[{"category": "", "categoryclass": "", "imagename": "1ca5c923284bf38e46587c4252efe70a.jpg", "infoid": 1006625, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "修女玛丽·肯尼斯·凯勒1914年出生于俄亥俄州，1932年加入慈善修女会，1940年宣誓就职。她继续在德保罗大学学习，在那里她获得了数学学士学位和数学和物理硕士学位。在此之前，人们对她的生平知之甚少，甚至连她的出生年份都有争议。\n20世纪60年代，凯勒修女就读于威斯康星大学。她还曾就读于普渡大学、密歇根大学和达特茅斯学院。达特茅斯大学放宽了禁止女性进入其计算机中心的规定，这允许凯勒帮助开发计算机语言Basic。(在BASIC之前，只有数学家和科学家才能编写定制软件；BASIC允许任何会学习语言的人这样做，使更多的人能够使用计算机。)。\n凯勒的论文是用CDC FORTRAN63编写的，题目是“关于计算机生成模式的归纳推理”。1965年，她成为第一位获得计算机科学博士学位的美国女性。\n之后，凯勒修女在爱荷华州的克拉克学院创立了计算机系，她指导了这个系长达20年之久。她热衷于为所有人提供访问和信息，而不仅仅是计算机科学家。她还设想了这样一个世界，在这个世界里，计算机让人们变得更聪明，并学会了独立思考。凯勒说：“我们现在第一次可以机械地模拟认知过程。我们可以在人工智能方面进行研究。除此之外，这种机制(计算机)可以用来帮助人类学习。随着时间的推移，我们会有更多更成熟的学生，这种教学方式可能会变得越来越重要。“", "note_en": "Sister Mary Kenneth Keller, born in Ohio in 1914, entered the Sisters of Charity in 1932 and professed her vows in 1940. She went on to study at DePaul University, where she received a B.S. in Mathematics and an M.S. in Mathematics and Physics. Before this, very little is known of her life; even her birth year is disputed.\n In the 1960s, Sister Keller studied at the University of Wisconsin. She also studied at Purdue, the University of Michigan, and Dartmouth College. Dartmouth relaxed the rule barring women from its computer center, which allowed Keller to help develop the computer language BASIC. (Before BASIC, only mathematicians and scientists could write custom software; BASIC allowed anyone who could learn the language to do so, making computer use accessible to a much larger swath of the population.)\n Keller’s dissertation, written in CDC FORTRAN 63, was titled &#34;Inductive Inference on Computer Generated Patterns.&#34; In 1965, she became the first American woman to earn a Ph.D. in Computer Science.\n Afterward, Sister Keller founded the computer science department at Clarke College in Iowa, which she directed for 20 years. She was passionate about providing access and information to everyone, not just computer scientists. She also envisioned a world in which computers made people smarter and learned to think on their own. Keller  said, “For the first time, we can now mechanically simulate the cognitive process. We can make studies in artificial intelligence. Beyond that, this mechanism [the computer] can be used to assist humans in learning. As we are going to have more mature students in greater numbers as time goes on, this type of teaching will probably be increasingly important.”", "posttime": "2020-06-15 14:06:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女博士,phd,计算机", "title": "第一个计算机科学女博士是个修女", "title_en": "The First Woman PhD in Computer Science Was a Nun", "transed": 1, "url": "https://www.mentalfloss.com/article/53178/first-woman-earn-phd-computer-science-was-nun", "via": "", "real_tags": ["女博士", "phd", "计算机"]}, {"category": "", "categoryclass": "", "imagename": "a031aa9d1d9b035b7d02d1277dbfefad.jpg", "infoid": 1006624, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很长一段时间以来，Windows10用户的日子一直不好过。现在，微软刚刚展示了为什么沮丧的用户应该退出。\nTechDows发现，这很可能是许多运行Windows10的人的最后一根稻草。虽然问题很严重，但问题不是最新的漏洞，而是它是如何做到这一点的，以及它对微软在构建可靠操作系统的过程中存在的根本性缺陷有何看法。\n这个漏洞是由(越来越臭名昭著的)“Windows102020年5月”更新引入的，它打破了许多人的一个重要特征：重新开始。这使得用户可以在不丢失数据的情况下重新安装Windows 10。对于许多人来说，如果他们的电脑遇到严重问题，这是一个至关重要的工具。漏洞是会发生的，但是TechDows发现的是，自从2020年5月的更新在八个多月前首次进入测试以来，用户就一直在成群结队地警告微软这一点。\nTechDows解释说：“微软内部人士和用户之前曾多次通过反馈中心向微软提出这个问题，但该公司在2020年5月发布了更新，但没有修复该问题。”更糟糕的是：“这个问题没有列在微软网站上维护的Windows102004已知问题文档中。”他们是对的，但事实并非如此。\n当你更仔细地观察时，情况会变得更糟。微软增加了数以百万计的所谓视窗内部人员(又名测试者)的庞大网络，他们为你承担所有风险，安装尖端的视窗更新，然后报告缺陷，然后…。被忽视了。\n更重要的是，这现在似乎是意料之中的。广受欢迎的视窗网站MSPoweruser形容这场重新开始的闹剧“并不令人意外”，而Neowin则指出“这个问题已经困扰视窗内部人员很长一段时间了，但微软没有注意到这一点，并在没有修复问题…的情况下推动了2020年5月的更新。微软错过了用户报告的多个问题，但这些问题没有添加到已知问题页面中。“。\n而且没有证据表明这会有所改善。早在2018年10月，微软就发布了一次更新，删除了用户数据，尽管Windows内部人士几个月来一直在警告该公司这一点。微软承诺会做得更好，但在2019年9月，一名前微软员工解释了该公司的整个测试计划是如何存在根本性缺陷的：\n这就把我们带到了今天最新的灾难。在此之前，事情并不是一帆风顺的。自5月以来，Windows10的更新影响了高端游戏，将用户踢出了他们的个人资料(两次)，损坏了打印机，切断了互联网连接，导致启动失败，是的，再次删除了用户数据。\n有些事情需要改变，在这一点上，要么是微软的Windows测试实践，要么是用户对操作系统的选择。", "note_en": "Windows 10 users have been having a  rough  time  for a  long  time. And now Microsoft has just shown why frustrated users should quit.\n      Picked up by  Techdows, is something which may well be the final straw for many running Windows 10. While serious, the problem is not the latest bug, but how it got there and what it says about Microsoft’s fundamentally flawed process in building a reliable operating system.\n     The bug was introduced by the ( increasingly infamous) ‘Windows 10 May 2020’ update and it breaks an important feature for many:  Fresh Start. This allows users to reinstall Windows 10 without losing their data. It’s a crucial tool for many if their PC runs into a serious problem. Bugs happen, but what Techdows discovered is users have been warning Microsoft about this in their droves since the May 2020 update first went into testing more than eight months ago.\n  “The issue was brought to Microsoft attention by insiders and users via feedback hub many times before, but the company released May 2020 Update without fixing the issue,” explains Techdows. And worse still: “This issue is not listed in Windows 10 2004 known issues document Microsoft maintains on its website.” They are right,  it’s not.\n      And it gets worse when you look more closely. Microsoft added a vast network of so-called Windows Insiders (aka beta testers) which  number in the millions and they take all the risks on your behalf by installing bleeding edge Windows updates, reporting the flaws then… getting ignored.\n  What’s more, this now seems to be expected. Popular Windows site  MSPoweruser described the Fresh Start farce as “no surprise” while  Neowin notes that “the issue has been plaguing Windows Insiders for quite some time but Microsoft did not take note of it and pushed the May 2020 Update without fixing the problem… Microsoft has missed out on multiple issues that have been reported by the users but were not added to the known issues page.”\n  And there’s no evidence this will improve. Back in October 2018, Microsoft shipped an update  which deleted user data despite Windows Insiders warning the company about this for months. Microsoft promised to do better, but in September 2019 an ex-Microsoft employee explained how the company’s entire testing program is fundamentally flawed:\n    Which brings us to today’s latest debacle. And it’s not like things were running smoothly before this. Since May, Windows 10 updates have  impacted premium games, kicked users  out of their profiles ( twice),  broken printers,  cut Internet connections,  caused boot failures and, yes, once again  deleted user data.\n  Something needs to change and at this point it is either Microsoft’s Windows testing practices or its users’ choice of operating system.", "posttime": "2020-06-15 14:06:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,windows,windows-10,microsoft,退出", "title": "微软给了10亿用户退出Windows 10的理由", "title_en": "Microsoft Gave a Billion Users a Reason to Quit Windows 10", "transed": 1, "url": "https://www.forbes.com/sites/gordonkelly/2020/06/14/microsoft-windows-10-problems-testing-windows-insiders-windows-10-updates/", "via": "", "real_tags": ["微软", "windows", "microsoft", "退出"]}, {"category": "", "categoryclass": "", "imagename": "6fbb169af0927775593e7875bb64e157.png", "infoid": 1006622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简报-开始安全的匿名视频聊天", "note_en": "Briefing - Start a secure anonymous video chat", "posttime": "2020-06-15 13:48:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webrtc,开源,安全,bg", "title": "匿名、安全、现代、开源的WebRTC群组视频聊天和BG模糊", "title_en": "Anonymous, secure, modern, open source WebRTC group video chat and bg blur", "transed": 1, "url": "https://brie.fi/ng?ref=hn", "via": "", "real_tags": ["webrtc", "开源", "安全", "bg"]}, {"category": "", "categoryclass": "", "imagename": "03d3a2f200095e1a11fb435010ae1b78.jpg", "infoid": 1006621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitch：https://www.twitch.tv/linkus7/在与斯普洛什·卡博姆打交道多年后，战舰上的迷你游戏在塞尔达传奇：风者，我们.", "note_en": "Twitch: https://www.twitch.tv/linkus7/ After Years of having to deal with Sploosh Kaboom, the Battleship Minigame in The Legend of Zelda: The Wind Waker, we ...", "posttime": "2020-06-15 13:30:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,解决,worst,https", "title": "我们解决了塞尔达历史上最糟糕的小游戏", "title_en": "We Solved the Worst Minigame in Zelda's History", "transed": 1, "url": "https://youtu.be/1hs451PfFzQ", "via": "", "real_tags": ["游戏", "解决", "worst", "https"]}, {"category": "", "categoryclass": "", "imagename": "cc85830b83182ca4cbd63458e118895f.jpeg", "infoid": 1006620, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软旗下的计算机代码公司Github正计划从其系统中取代“主人”一词，因为“黑人生命也是命”(Black Lives Matter)运动给科技公司带来了压力，要求它们放弃对奴隶制的认知。\nGithub首席执行官纳特·弗里德曼(Nat Friedman)表示，该公司正在努力将计算机代码的一个分支的默认名称从“master”改为“main”。\n编程语言历史上使用术语“主”和“从”来表示一个进程控制另一个进程的软件组件。\n批评人士说，这种语言是对历史暴行的不必要引用，也是科技行业正在与多样性作斗争的一个例子。虽然有几家公司和语言不鼓励使用这些术语，取而代之的是“主要的”和“复制的”等术语，但由于许多程序必须相互兼容，完全删除这些术语的速度一直很慢。\n弗里德曼在推特上表示，他正在考虑对分支结构做出改变，在分支结构中，“master”不是指主从关系，而是指用于复制的原始版本，类似于专辑的主录音。然而，一些人推动完全删除这个词。\n在回应谷歌Chrome工程师Una Kravets的推文时，他说：“这是个好主意，我们已经在努力了！”\nGitHub于2018年被微软以75亿美元(60亿GB)的价格收购，是领先的计算机代码共享网站之一，因此对软件编写方式产生了重大影响。\n一些对弗里德曼做出回应的程序员担心，这一变化会破坏一些现有的系统。\n今年早些时候，英国国家网络安全中心(NCSC)--GCHQ的一个分支机构--表示将停止使用“白名单”和“黑名单”这两个术语，这两个术语用来表示被批准或被禁止的网站或提供商的集合。\nNCSC表示，将改为使用“允许名单”和“拒绝名单”。该机构表示：“以帮助消除网络安全中的种族主义为名，我们今后将避免在我们的网站上出现这种随意贬义的措辞。”", "note_en": "The Microsoft-owned computer code company Github is planning to replace the term “master” from its systems as the Black Lives Matter movement puts tech companies under pressure to drop perceived references to slavery.\n Nat Friedman, Github’s chief executive,  said it was working on changing the default name for a branch of computer code from “master” to “main”.\n Programming languages have historically used the terms “master” and “slave” to denote software components where one process controls another.\n Critics say the language is an  unnecessary reference to historical atrocities, and an example of the tech industry’s ongoing struggles with diversity. While several companies and languages have discouraged use of the terms, replacing them with terms such as “primary” and “replica”, but since many programs must be compatible with one another, removing the terms completely has been slow.\n Mr Friedman said on Twitter that he was looking at making the change to branch structures, where “master” does not refer to a master-slave relationship, but to an original version for making copies, similar to a master recording of an album. However, some have pushed for the word to be removed completely.\n  Responding to a tweet from Google Chrome engineer Una Kravets, he said: “It’s a great idea and we are already working on this!”\n Github, which was  bought by Microsoft for $7.5bn (£6bn) in 2018, is one of the leading websites for sharing computer code, and as a result, a major influence in how software is written.\n Some programmers responding to Mr Friedman raised concerns that the change would break some existing systems.\n Earlier this year, the UK’s National Cyber Security Centre (NCSC), a branch of GCHQ,  said it would stop using the terms “whitelist” and “blacklist”, which are used to denote collections of approved or banned websites or providers.\n NCSC said it would instead start using “allow list” and “deny list”. The agency said: “In the name of helping to stamp out racism in cyber security, we will avoid this casually pejorative wording on our website in the future.”", "posttime": "2020-06-15 13:30:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,主人,replace,表示", "title": "GitHub将在推动移除奴隶制提法中取代“主人”一词", "title_en": "GitHub to replace the term 'master' in push to remove slavery references", "transed": 1, "url": "https://www.telegraph.co.uk/technology/2020/06/14/microsoft-owned-coding-site-github-replace-term-master-push/", "via": "", "real_tags": ["github", "主人", "replace", "表示"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你对世界各地的能源和发电了解多少？共有{{this.items.length}}个选择题。你有30秒的时间回答每个问题。每天都会创建一个新的测验。当前测验是在2小时前创建的。", "note_en": "How much do you know about energy sources and electricity generation around the world? There are {{ this.items.length }} multiple choice questions. You have 30 seconds to answer each question. A new quiz is created daily. The current quiz was created 2 hours ago.", "posttime": "2020-06-15 13:13:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,能源,quiz", "title": "关于世界各地能源和发电的琐碎问答游戏", "title_en": "Trivia quiz about energy sources and electricity generation around the world", "transed": 1, "url": "https://lowcarbonpower.org/quiz", "via": "", "real_tags": ["游戏", "能源", "quiz"]}, {"category": "", "categoryclass": "", "imagename": "bb68458e349f26e13acf72708423959c.jpg", "infoid": 1006618, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于商家来说，ACH支付的费用通常比信用卡低得多。但是引导消费者使用这种支付方式需要创造力和细心。\n海登·皮尔克尔(Hayden Pirkle)是格子花呢公司的产品营销经理。他感兴趣的是如何利用数据来改善金融包容性和福祉。\n2018年，电商销售额占零售总额的14.3%，高于2017年的12.9%和2016年的11.6%。事实上，去年电子商务对零售总额增长的贡献率为51.9%。随着网购市场份额的不断增加，许多商家都在密切关注他们向消费者提供的支付方式。\n目前来看，信用卡是王道，48%的消费者表示他们更喜欢在网上购物时使用信用卡。相比之下，28%的人更喜欢借记卡，12%的人更喜欢贝宝(PayPal)。\n信用卡之所以有吸引力，原因有很多。它们使消费者能够现在购买，以后付款-并因此获得丰厚的回报。信用卡使用方便，对消费者的欺诈行为有很大的保护作用。(文章继续如下)。\n然而，对于商家来说，信用卡可能很贵，他们通常会没收大约2%的购买价格来支付交换费。这些费用是按每笔交易向信用卡公司和发卡银行支付的；它们将用于系统维护、欺诈保护和奖励积分等方面的资金。(它们也是信用卡公司赚钱的方式。)。无论是好是坏，看起来短期内它们都会增加。\n当你考虑到2018年美国消费者在网上消费超过5170亿美元时，这些费用已经开始累积。事实上，美国商家在2017年向Visa和万事达卡支付了超过430亿美元的费用。\n商家可以做些什么来降低交易成本，增加营收？对许多人来说，答案就在自动清算所(ACH)，这是一个在美国实现银行间转账的网络。如果你曾经用Venmo向朋友汇款，水电费账单自动从你的支票账户中扣除，或者从你的雇主那里收到了直接存款，那么你就已经通过ACH网络进行了交易。\n随着网购市场份额的不断增加，许多商家都在密切关注他们向消费者提供的支付方式。\nACH加工有两种常见的定价模式：统一费率(通常为0.25-1.50美元)和0.5%-1%的百分比费用(通常这些基于百分比的费用上限为5美元或约5美元)。或许出于这个原因，51.2万亿美元是通过ACH处理的，相比之下，通过Visa和Mastercard Rails处理的是6万亿美元。\n这些数字突显了ACH支付的吸引力：它们通常比其他方式便宜得多。例如，与ACH进行的5000美元的交易可能会使发起人花费0.25-5美元，而如果使用信用卡进行同样的交易，成本将为90美元。\n阿尔托药房就是一个很好的例子。随着时间的推移，高价值交易(1000美元)已经占到他们每月经常性收入的5%以上。由于大多数交易是用信用卡完成的，阿尔托每笔交易至少要支付50美元，有时高达150美元。通过引导客户使用ACH，他们每月能够节省超过2万美元。他们以奖励折扣的形式将部分节省的资金转嫁给消费者，其余的再投资于企业。(文章继续如下)。\n如果ACH这么便宜，为什么不是每个人都在用呢？\n答案是，从历史上看，ACH一直缺乏信用卡的速度、便利性和奖励服务。ACH支付也容易受到一系列风险的影响，包括潜在的欺诈活动和破坏关系的不充分基金(NSF)费用-通常由消费者支付。但最近的技术进步在许多方面使这两种支付方式在安全性和便利性方面具有竞争力。\n商家可以做些什么来降低交易成本，增加营收？对许多人来说，答案就在自动票据交换所(ACH)。\n例如：当电商公司请求并获得连接到用户银行账户的许可时，它们可以利用消费者财务数据来减少总体支付时间，防止欺诈，并降低NSF费用的可能性。其结果是更无缝的支付体验，使商家能够在巩固客户忠诚度的同时推动营收增长。\n正如我们将看到的，联网账户服务在很大程度上有助于在ACH和信用卡之间建立公平的竞争环境。增强的连接性可以加快、简化ACH支付并降低风险，从而减少客户流失并改善客户关系。\n但如何才能让客户上船呢？在本文中，我们将仔细研究ACH和信用卡之间的区别，权衡利弊，并回顾商家用来推动客户采用ACH的一些策略。(文章继续如下)。\n在那里，它是由美联储或票据交换所等“操作员”清算的。\n大多数ACH支付仍然是这样进行的。但是，2016年同一天ACH的出现使这2-3天的窗口被削减到一天-尽管银行通常会对这种更快的ACH服务收取更高的费用。\n帐户身份验证是验证银行帐户及其关联的帐户和路由号码是否真实的过程。它先于ACH付款，旨在减少欺诈、付款中断和任何相关费用。传统的方法包括提交一张作废的支票或核实小额存款的收据；这些方法会增加ACH支付过程的几天，从开始到结束可能需要6天。\n在过去，用户被要求追踪他们的账号和路由号码，等待几天后小额存款出现在他们的账户中，然后返回电商网站进行验证。也许并不令人惊讶的是，他们中的许多人都未能完成这一过程。\n不用说，这样的时间表对所有参与的人都没有吸引力。客户变得沮丧，忘记完成，和/或选择了更快的付款方式-通常是与不同的供应商。商家更喜欢完成率更高的支付方式。\n多亏了技术进步，小额存款和作废支票不再是认证账户的唯一方式。使用即时帐户验证，用户输入他们的银行登录凭据，他们的帐户在几秒钟内即可通过身份验证。它可以缩短您的第一笔ACH付款所需的时间，最多可缩短三天。\n同样重要的是，它消除了入职过程中的重大摩擦。在过去，用户被要求追踪他们的账号和路由号码，等待几天后小额存款出现在他们的账户中，然后返回电商网站进行验证。也许并不令人惊讶的是，他们中的许多人都未能完成这一过程。\nVenmo和Coinbase提供了无缝ACH工作流的很好例子。这些企业只有在账户通过身份验证并将资金加载到其平台上后才能与用户进行交易，因此快速轻松的ACH体验对于降低流失率至关重要。(文章继续如下)。\n跳过小额存款验证，允许用户在帐户验证过程中交易，或者完全跳过帐户验证的商家，正在将自己暴露在巨大的欺诈风险中。与此同时，用户可能在不知不觉中花费了比他们账户中的更多的钱。这产生了不充足的资金(NSF)费用，这惹恼了用户，同时削减了商家的已实现收入。\n通过即时验证账户和确认重要的用户身份详细信息，商家可以识别和隔离虚拟或不活动的账户，降低欺诈的可能性，同时使用户能够以安全的方式立即进行交易。\n实时账户余额检查可以防止用户花费超过账户中的金额，因此他们不会受到透支或NSF费用的打击。因此，像Placid Express这样的供应商经历了几乎为零的NSF费用和ACH付款的退款。\n最后，帐户连接可以让商家获取帐户持有人信息：如姓名、电子邮件地址和物理地址。这对无缝入职、验证用户身份和了解客户(KYC)很有帮助。\n近年来，“建档立卡”的概念在支付领域掀起了波澜。\n这个术语描述的是存储消费者的信用卡以备将来购物之用。消费者只需输入一次信用卡号码，就可以为未来的商品或服务付款，而无需重新输入支付信息。\n优步没有发明这种模式，但他们在完善这一模式方面已经走了很长的路。他们有效地将支付从用户“做过”的事情转变为“发生”的事情。一旦您预订了乘车服务，就不需要进一步的操作了。\n许多企业只有在账户通过身份验证并将资金加载到其平台上后才能与用户进行交易，因此快速、轻松的ACH体验对于降低流失率至关重要。\n“无缝程度取决于从优步下车付款有多容易。优步美国金融科技和忠诚合作伙伴负责人朱迪·朱(Judy朱)表示：“无论你在世界上的哪个地方，在我们所在的600个城市里，优步的感觉几乎都是一样的。\n虽然存档卡提供了流畅的支付体验，但这种机制很容易受到“支付混乱”的影响，当客户因为存档卡不再工作而不由自主地停止支付时，就会发生“支付混乱”。信用卡每3年到期一次，导致每年33%的流失率。\n假设用户丢失了信用卡并订购了更换，但他们从不用新信息更新自己的Uber账户。他们不一定对优步的服务不满意；相反，这是刷卡方式的固有风险。对优步来说，其结果是收入损失。\n使用ACH而不是信用卡，或者创建一个归档帐户的经验，有可能降低这种风险。信用卡被拒付的几率约为15%，而支票账户则要稳定得多(降幅约为1-2%)。它们不会过期，也不能留在出租车的后座上。(文章继续如下)。\n虽然ACH可以为商家提供相当大的价值，但只有在您能够获得大量用户的情况下，才值得花费实施成本。这意味着改变一些根深蒂固的消费者行为。\n高昂的信用卡手续费是在数字经济中做生意的必要成本吗？对于许多电子商务企业来说，它们并不一定非得如此。\n今天的购物者必须学会输入他们的ACH银行登录凭证，而不是在销售点掏出信用卡。考虑到信用卡奖励计划的吸引力，创造这种行为改变并不是一项小任务。\n就像信用卡公司和银行使用奖励计划来引导消费者使用他们的卡一样，商家也可以为ACH做同样的事情。自由职业市场Upwork提供了一个有趣的例子。\n首先，他们对所有信用卡交易额外收取3%的费用。其次，他们通过为无限制的ACH交易提供30美元的月费来激励高流量用户。对于每个月在该平台上花费超过1000美元的人来说，这是有意义的。\n目前，信用卡是美国消费者在网上购买商品和服务的首选方式。\n这是可以理解的。现在购买/稍后付款、易用性和奖励计划只是使信用卡成为一个有吸引力的选项的几个功能之一。但高昂的交换费削减了商家的营收，往往会导致消费者的价格更高。\n高昂的信用卡手续费是在数字经济中做生意的必要成本吗？对于许多电子商务企业来说，它们并不一定非得如此。\n与ACH进行5000美元的交易将花费发起人不到1美元，而如果用信用卡进行同样的交易将花费90美元。\n无缝的ACH支付解决方案为商家和消费者带来价值。商家可以通过降低支付成本、减少客户流失和提高整体客户满意度来提高利润率。消费者可以享受一种“设置好就忘了它”的支付选项，它可以让他们频繁的付款不受干扰地进行，同时还可能在这一过程中节省他们的钱。\n在电子商务中更广泛地采用ACH的关键是投标指导机制，其设计目的是在结账时将消费者的信用卡放在钱包里。更低的价格、奖励计划或一个月的免费服务只是商家向这个方向推动客户的几种方式。\n海登·皮尔克尔(Hayden Pirkle)是格子花呢公司的产品营销经理。他感兴趣的是如何利用数据来改善金融包容性和福祉。", "note_en": "For merchants, ACH payments often cost significantly less than credit cards. But steering consumers toward this payment method requires creativity and care.\n       Hayden Pirkle is a product marketing manager at Plaid. He is interested in the ways in which data can be used to improve financial inclusion and well-being.\n  Ecommerce sales  made up 14.3% of total retail sales in 2018, up from 12.9% in 2017 and 11.6% in 2016. In fact, ecommerce accounted for 51.9% of total retail sales growth last year. As online shopping continues to gain market share, many merchants are taking a close look at the payment methods that they offer to consumers.\n For now, the credit card is king, with  48% of consumers saying they prefer to use credit cards when shopping online. By contrast, 28% prefer debit, and 12% prefer PayPal.\n Credit cards are appealing for a number of reasons. They enable consumers to buy now, pay later—and  be rewarded richly for it. Credit cards are convenient to use and offer consumers significant  protection against fraudulent purchases. (article continues below)\n    However, credit cards can be expensive for merchants, who typically  forfeit around 2% of the purchase price to interchange fees. These fees are paid on a per-transaction basis to credit card companies and issuing banks; they go to fund things like system maintenance, fraud protection, and rewards points. (They’re also how card companies make money.) For better or worse, it looks like they  will increase in the short term.\n When you consider that U.S. consumers spent  more than $517 billion online in 2018, those fees have started to add up. In fact, U.S. merchants paid Visa and Mastercard  more than $43 billion in fees in 2017.\n What can merchants do to reduce transaction costs and grow top-line revenue? For many, the answer lies in the  Automated Clearing House (ACH), the network that enables bank-to-bank transfers in the U.S. If you’ve ever sent money to a friend with Venmo, had a utility bill automatically debited from your checking account, or received a direct deposit from your employer, then you have transacted via the ACH network.\n As online shopping continues to gain market share, many merchants are taking a close look at the payment methods that they offer to consumers.\n There are two common pricing models for ACH processing: flat rates (typically $.25 - 1.50) and percentage fees that range from 0.5% - 1% (often these percentage-based fees are capped at or around $5). Perhaps for that reason,  $51.2 trillion was processed via ACH, compared with  $6 trillion over the Visa and Mastercard rails.\n Those numbers underscore the appeal of ACH payments: they are often significantly cheaper than other methods. For example, a $5,000 transaction made with ACH could cost the originator anywhere from $0.25 - $5, whereas the same transaction would cost $90 if it were made with a credit card.\n Alto Pharmacy is a  case in point. Over time, high-value transactions (&gt;$1000) have come to represent more than 5% of their monthly recurring revenue. Because most were made with credit cards, Alto was paying at least $50 per transaction, sometimes as much as $150. By steering its customers toward ACH, they have been able to save  more than $20,000 per month. They pass some of those savings along to consumers in the form of an incentive discount; the rest they reinvest in the business. (article continues below)\n    If ACH is so much cheaper, then why isn’t everyone already using it?\n The answer is that, historically, ACH has lacked the speed, convenience, and reward offerings of credit cards. ACH payments are also susceptible to a number of risks, including the potential for fraudulent activity and relationship-damaging non-sufficient funds (NSF) fees—often paid by consumers. But recent technological advances have in many ways rendered the two payment methods competitive in terms of their safety and convenience.\n What can merchants do to reduce transaction costs and grow top-line revenue? For many, the answer lies in the Automated Clearing House (ACH).\n For example: when ecommerce companies request and receive permission to connect to users’ bank accounts, they can leverage consumer financial data to reduce overall payment times, prevent fraud, and reduce the likelihood of NSF fees. The result is a more seamless payment experience, one that enables merchants to cement customer loyalty while driving top-line revenue growth.\n As we’ll see, connected account services go a long way toward leveling the playing field between ACH and credit cards. Enhanced connectivity can accelerate, streamline, and de-risk ACH payments, resulting in reduced churn and improved customer relations.\n But how to get customers on board? In this article, we’ll take a closer look at the difference between ACH and credit cards, weigh the pros and cons, and review some of the tactics that merchants use to drive ACH adoption among their customers. (article continues below)\n     There it was cleared by an “operator” such as the Federal Reserve or The Clearing House\n Most ACH payments are still conducted this way. But the emergence of  Same-Day ACH in 2016 enabled this 2-3 day window to be trimmed to a single day—although banks  typically upcharge for this faster ACH service.\n Account authentication is the process of validating that a bank account and its associated account and routing numbers are real. It precedes the initiation of an ACH payment and is designed to reduce fraud, payment disruptions, and any associated fees. Traditional methods include submitting a voided check or  verifying receipt of microdeposits; these methods add several days to the ACH payment process, which can end up taking six days from start to finish.\n In the past, users were required to track down their account and routing numbers, wait a few days for microdeposits to show up in their accounts, and return to the ecommerce site to verify them. Perhaps unsurprisingly, many of them failed to complete the process.\n Needless to say, that kind of timeline was unappealing for all involved. Customers became frustrated, forgot to finish, and/or opted for a quicker payment method—often with a different vendor. Merchants preferred payment methods with higher completion rates.\n Thanks to technological advances, microdeposits and voided checks are no longer the only ways to authenticate an account. With  instant account verification, users enter their bank login credentials, and their accounts are authenticated in a matter of seconds. It can shorten the amount of time it takes to make your first ACH payment by up to three days.\n Just as important, it removes significant friction from the onboarding process. In the past, users were required to track down their account and routing numbers, wait a few days for microdeposits to show up in their accounts, and return to the ecommerce site to verify them. Perhaps unsurprisingly, many of them failed to complete the process.\n Venmo and Coinbase offer good examples of seamless ACH workflows. These businesses can’t transact with users until accounts have been authenticated and funds have been loaded onto their platforms, so a quick and easy ACH experience is critical to reducing drop-off rates. (article continues below)\n    Merchants who skip microdeposit verification and allow users to transact during the account verification process, or skip account verification entirely, are exposing themselves to significant fraud risk. At the same time, users may unwittingly spend more than they have in their account. That generates non-sufficient funds (NSF) fees that annoy users while cutting into merchants’ realized revenue.\n  By instantly verifying accounts and confirming important user identity details with what’s on file at the bank, merchants can identify and isolate dummy or inactive accounts and reduce the likelihood of fraud, while enabling users to transact immediately in a secure fashion.\n Real-time account balance checks prevent users from spending more than they have in their accounts, so they don’t get hit with overdraft or NSF fees. As a result, vendors like  Placid Express experience a near-zero rate of NSF fees and chargebacks on their ACH payments.\n Finally, account connectivity can enable merchants to  pull account holder information: things like name, email address, and physical address. That’s helpful for seamless onboarding, verifying user identity, and know-your-customer (KYC).\n  The concept of a “card on file” has been  making waves in the payments space in recent years.\n The term describes the storage of a consumer’s credit card for future purchases. Consumers enter their credit card numbers once, then pay for future goods or services without having to re-enter their payment information.\n Uber didn’t invent this model, but they have gone a long way to perfecting it. They effectively transformed payment from something users “did” to something that “happened.” Once you book your ride, no further action is required.\n Many businesses can’t transact with users until accounts have been authenticated and funds have been loaded onto their platforms, so a quick and easy ACH experience is critical to reducing drop-off rates.\n “The seamlessness is predicated on how easy it is to get out of an Uber and pay. No matter where you are in the world in the 600 cities we’re in, Uber pretty much feels the same,”  said Judy Zhu, Uber’s U.S. fintech and loyalty partnerships lead.\n While card-on-file delivers a smooth payment experience, the mechanism is susceptible to “payment churn,” which occurs when a customer involuntarily stops being able to pay because the card on file no longer works. Credit cards expire every 3 years, leading to 33% annual churn.\n Say a user loses their credit card and orders a replacement, but they never update their Uber account with the new information. They’re not necessarily unhappy with Uber’s services; rather, it’s an inherent risk of the card-on-file method. The result, for Uber, is lost revenue.\n Using ACH instead of credit cards, or creating an account on file experience, has the potential to mitigate that risk. Credit cards are  declined ~15% of the time, while checking accounts are much more stable (~1-2% decline rate). They don’t expire and can’t be left in the backseat of a taxi. (article continues below)\n    While ACH can deliver considerable value to merchants, it’s only worth the cost of implementation if you can get a large number of users on board. That means rewiring some deeply ingrained consumer behavior.\n Are high credit card fees a necessary cost of doing business in the digital economy? For many ecommerce businesses, they don’t have to be.\n Instead of reaching for their credit cards at the point of sale, today’s shoppers must learn to enter their bank login credentials for ACH. Given the appeal of credit card rewards programs, creating that behavior change is no small task.\n Just as credit card companies and banks use rewards programs to steer consumers toward their cards, merchants could do the same thing for ACH. Freelance marketplace Upwork provides an interesting example.\n First, they charge an extra 3% on all credit card transactions. Second, they incentivize high-volume users by offering a $30 monthly fee for unlimited ACH transactions. That makes sense for anyone who spends more than $1000 a month on the platform.\n  For now, credit cards are the U.S. consumer’s preferred method for purchasing goods and services online.\n That’s understandable. Buy-now/pay-later, ease of use, and rewards programs are just a few of the features that make credit cards an appealing option. But high interchange fees cut into merchants’ top-line revenue and often result in higher prices for consumers.\n Are high credit card fees a necessary cost of doing business in the digital economy? For many ecommerce businesses, they don’t have to be.\n A $5,000 transaction made with ACH would cost the originator less than a dollar, whereas the same transaction would cost $90 if it were made with a credit card.\n A seamless ACH payment solution delivers value to both merchants and consumers. Merchants can improve margins through lower payments costs, reduced churn, and improved overall customer satisfaction. Consumers can enjoy a “set it and forget it” payment option that keeps their frequent payments up and running without disruption—while likely saving them money along the way.\n Critical to the more widespread adoption of ACH for ecommerce are tender steering mechanisms designed to keep consumers’ credit cards in their wallets at checkout. Lower prices, rewards schemes, or a month of free service are just a few of the ways that merchants can nudge their customers in that direciton.\n Hayden Pirkle is a product marketing manager at Plaid. He is interested in the ways in which data can be used to improve financial inclusion and well-being.", "posttime": "2020-06-15 13:11:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "付款,payments,信用卡", "title": "每笔付款的成本更低。在线购物者会转而购物吗？", "title_en": "ACH payments cost less. Will online shoppers ever switch?", "transed": 1, "url": "https://fin.plaid.com/articles/will-online-shoppers-ever-switch-to-ach/", "via": "", "real_tags": ["付款", "payments", "信用卡"]}, {"category": "", "categoryclass": "", "imagename": "8277aa86f1afdc663612c62e92251dfc.jpg", "infoid": 1006614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着过去几周新闻中突出提到互联网档案馆，我们已经有成千上万的人在社交媒体上讨论我们，并带着强烈的担忧和担忧直接与我们联系。最重要的是，许多人想以某种方式“帮助”，并问我们他们能做些什么，如果有什么帮助的话。虽然你在这段时间的捐赠受到了感谢，但实际上你可以做的事情还有很多，这将产生持久的影响。使用Internet档案网站。\n这听起来可能很简单，但仅仅是利用互联网档案馆来解释它存在的原因，就是实现了许多过去和现在从事过互联网档案馆工作的人的梦想。在Simple Archive.org地址和网站背后有超长时间的持续支持。你们中的一些人已经在享受档案的全部潜力，但许多人只是将其用于Wayback Machine，或者用于您收听或观看的一组最喜欢的媒体。浏览我们的堆栈、浏览、漫步…。输入您感兴趣的搜索词，查看弹出的内容以及它属于哪些收藏。你会发现这是无穷无尽的回报。数以千万计的物品在等着你。收藏品本身千差万别；一个被驱使的团队将创建一个收藏品，或者全球范围内的合作和合作将带来令人叹为观止的数量的材料，你可以享受。而且，和往常一样，数十亿个URL已经被镜像，为您带来了20年来Wayback Machine的独特奇迹。我们备份维基百科在添加时链接到的每个链接，以确保网络在短期内不会忘记它的引用和相关信息。\n说到回路机…。Wayback是我们皇冠上的明珠，我们还鼓励看到东西的人保存一份副本。为此，请访问主回发页面，并在右下角的Save Page Now表单中输入URL。我们将完成其余的工作(重复数据删除、归档等)。这就是我们如何意识到最新的URL，这些URL要么没有很长的保质期，要么我们通常在很长一段时间内都不会意识到这一点。如果你还没有在我们这里注册，那就成为我们的赞助人，这非常容易，而且是绝对免费的，而且永远都是免费的。有了虚拟图书卡，您就可以建立收藏清单，为您有意见的任何项目撰写评论，并允许您将自己的项目上传到我们的收藏中。在注册期间，您还可以注册我们的时事通讯，这对于跟踪与档案馆相关的新闻和事件非常有用。当然，您总是可以在任何地方匿名浏览；这就是图书馆的意义所在。但也可以考虑成为档案馆的一员。管理并上载到归档。\n作为档案馆的成员，您可以立即将项目上传到我们的堆栈中。文本、图像、电影、音频。每天都有数以千计的新物品进入收藏品。我们的上载页面包含有关您正在上载的内容的有用信息，以便您描述和验证您希望我们存储的项目。作为一个集合，我们的很多优势来自于个人上传他们或他们的社区创建的项目，并且需要一个托管空间来提供对项目的持续访问，不受限制。艺术家上传他们的音乐专辑，播客上传他们的剧集，数以百计的组织将他们的媒体和会议上传给我们，以确保他们的安全。告诉人们互联网档案馆的存在人们不知道回路机或互联网档案馆，但我们住在这里，这对我们来说总是令人惊讶的。在数百条推文中，埋藏着人们第一次发现我们的兴奋回应。如果你的朋友和家人不知道我们的情况，他们只需要你告诉他们我们就在几个点击的地方，那就太可惜了。花点时间告诉大家我们在这里等他们。(只需将它们链接到https://archive.org或https://web.archive.org-该网站很容易解释)。\n如果你想举例说明或链接到我们是谁和我们做什么的例子，我们有我们多年工作中的图像和徽标的集合。事实上，没有什么比其他人写下他们在进入书架的探险中发现的东西更让我们高兴的了；关于发现的不同寻常的杂志或文章的文章和帖子，并引用了18世纪和19世纪蓬勃发展的技术和学派的前辈们的话。我们的系统允许您为打印的项目添加书签，直至单个页面或音乐曲目，并链接到它们。浏览我们的众多收藏。我们的PB级数据有一生的价值可看；下面是我们数以万计的收藏中的几个亮点。几十年来，一群逐渐减少的人和歌迷创建了现场音乐档案馆，收集了超过22.5万场现场音乐表演，包括绝大多数感恩死者的现场表演，以及", "note_en": "With the Internet Archive in the news for the past couple of weeks being mentioned prominently, we’ve had thousands of people discuss us in social media, and contact us directly with strong concerns and worries.   Above all, many want, in some way, to “help” and have asked us what they can do, if anything.  While your  donations during this time have been appreciated, there’s actually many things you can do beyond that, which will have a lasting effect.   Use The  Internet Archive Site\n  It may sound simple, but just using the Internet Archive for why it exists in the first place is a fulfillment of the dream of the many who have worked on it, past and present. An extraordinary amount of hours of continuing support are behind the simple  archive.org address and website. Some of you are already enjoying the archive in its full potential, but many use it just for the  Wayback Machine, or for a favorite  set of media that you listen to or watch.   Take a walk through our stacks, browse, meander… enter a search term of something that interests you and see what pops up and what collections it’s part of. You’ll find it endlessly rewarding. Tens of millions of items await you.  The collections themselves vary wildly; a  driven group will create a collection, or collaborations and partnerships worldwide will lead to a  breathtaking amount of material you can enjoy. And, as always,  billions of URLs have been mirrored to bring the unique miracle of the  Wayback Machine to you for 20 years. We back up every link Wikipedia links out to at the time’s added, to make sure the web doesn’t forget its citations and relevant information anytime soon.\n  Speaking of the Wayback Machine… the Wayback is our crowning jewel, and we also encourage people who see something to save a copy of it.  To do so, visit the  main Wayback page and enter a URL in the  Save Page Now form on the lower right. We’ll do the rest (de-duplication, archiving, and so on). It’s how we become aware of to-the-minute URLs that either don’t have a long shelf life or which we would not normally be aware of for a significant amount of time.   Become a Patron  If you haven’t registered with us, it’s  incredibly easy to do so and absolutely free, and always will be. Having a virtual library card lets you build lists of favorites, write reviews for any items you have opinions on, and allow you to upload your own items into our collections. During signup, you can also register for our newsletter, which is really great for keeping track of news and events related to the Archive.   You can always browse anonymously, from anywhere, of course; that’s what a library is about. But consider being a member of the archive as well.   Curate and Upload to the Archive\n As a member of the Archive, you can upload items into our stacks instantly. Texts, Images, Movies, Audio. Thousands of new items enter into the collection every day. Our  Upload Page has helpful information about what you’re uploading to allow you to describe and verify the items you wish for us to store.   A lot of our strength as a collection comes from individuals uploading items they or their community have created, and in need of a hosting space that will provide access to the item continually, without limits. Artists upload their music albums,  podcasters upload their episodes, and  hundreds of organizations upload their media and meetings to us, to ensure they’re kept safe.    Tell People That the Internet Archive Exists  It’s always a surprise to us to find out that people don’t know about the Wayback Machine or the Internet Archive, but we live here. Buried among hundreds of tweets have been the excited responses of people discovering us for the first time. What a shame if your friends and family don’t know about us and all they need is for you to tell them we’re a few clicks away. Take a little time to spread the word we’re here and waiting for them. (Just link them to  https://archive.org or  https://web.archive.org – the site is pretty self explanatory).\n  We have a  collection of images and logos from our years of work if you wanted to illustrate or link to examples of who we are and what we do.  And really, nothing makes us happier than others writing about what they discover in expeditions into the stacks; essays and posts have been written about discovered unusual magazines or articles, and citing 18th and 19th century predecessors of technology and schools of thought that are flourishing in the present. Our system allows you to bookmark printed items down to the individual page or music track and link to them.    Browse Our Many, Many Collections.  Our petabytes of data have a lifetime’s worth of things to see; here’s a few highlights of our tens of thousands of collections.  For decades, a group of tapers and fans have created the   Live Music Archive, a collection of over 225,000 live performances of music, including the vast majority of all live performances of  The Grateful Dead, as well as thousands of other bands.  The  Bay Area Reporter, the oldest continuously published lesbian, gay, bisexual, transgender and queer weekly newspaper in the United States, made it a mission to scan and upload their entire back catalog of issues from their first to the present day. About 50 years of issues are represented, and are a fascinating deep dive. Other examples of broadsheets and bulletin history that have come to be hosted include the  Sparrows’ Nest Library of radical zines and newspapers, as well as the cultural-remix and art potential of  thousands of supermarket circulars.\n  The Netlabels area contains music and performances from “Netlabels”, online-only music groups, “record companies” and communities that have uploaded fully-produced albums with open licenses for years. For example, the  Curses from Past Times LP is at 800,000 views and counting. (Be sure to  click on the Llama on the right, too.)  The  Building Technology Heritage Library is a 11,000 item strong collection of catalogs, layouts and information about all sorts of architecture and aspects of building. Maintained by the  Association for Preservation Technology, these readable and downloadable works are a trove of artwork and design that are scanned, including, you’ll soon discover, items that have a tangent to building but also represent massive insights into long-lost items, like this  1,000 page Montgomery Ward Catalog.   Speaking of which.. we’ve partnered with  many other libraries, archives, and collectors to mirror or host millions of individual items. Our space and bandwidth are at their service to ensure the maximum audience is ready to interact with them, as needed.   Public Resource hosts 18,000+ Safety and Law Codes with us, allowing individuals to view the laws that affect their lives and functions within society without paying expensive rates to do so. An attempt to prevent this service by the State of Georgia ended up in a legal battle that  made its way to the Surpreme Court, which found in favor of Public Resource, allowing you to view these laws immediately. Over 22 million views of these laws have happened over the years.  The  Media History Digital Library has a collection in our stacks of film theory, cinema periodicals, and related documents and writings, which can be viewed from the  Media History Project site. These scans of industry trade magazines, announcements and advertising related to the film and television industries are instantly available and accessible by students, researchers and writers, as are all our collections.  And we don’t just host music and texts. Among our most storied and referenced items are the uploads of the  Prelinger Library, which include government public health films, commercials, instructional movies, and a growing set of home movies, which allow us to parts of visual history that didn’t have a commercial aspect. This work is done, among other ways, by a large-scale digitizing process hosted in the Archive’s Physical Archive.  In our software collections, we have brought back  thousands of hypercard stacks that used to be easily available for Macintosh computers in the 1980s and 1990s – they will boot in your browser and let you enjoy them near-instantly.\n  Just go in any direction in the Archive and you will spend weekends, days and nights finding and sharing what you discover.  However… if passively consuming media doesn’t feel like it’s “helping” us (although it is), there’s an even more active set of roles you can take:   Get Involved In Our Many Projects, Including The Wayback Machine  We’ve made an effort to work with many volunteers and collaborators over the years to ensure the Wayback Machine is capable of playing back as much of the now-lost and forgotten World Wide Web as possible. As you can imagine, the web is a moving target, and the terabytes a day of shifting websites presents one of the hardest technical challenges out there.   We have hundreds of guests in our Slack and other communication channels, working on open-source code and  helping us improve the software that drives us.  We have also moved into the real world where we can (even if we, like many others, are taking a break right now). We have co-hosted events like DWEBCAMP, provided space for  book readings, and engaged in a variety of  Artist-in-Residency programs; we expect to do more in the future and would love for you to be involved.  You can  write us if you have an interest in participating in any of these many and ongoing efforts.   But Most of All, Please Help Yourself First.  We’re touched by everyone who has spoken of their love and support of the Archive and its many missions, but this is also a time of much general uncertainty: economic, health concerns, and upheaval in society.  The Internet Archive is our job and mission. Your job and mission is to take care of yourself and those closest to you. Without you, we’re a bunch of hard drives on the Internet.  We’ll be here when you’re ready.", "posttime": "2020-06-15 12:18:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,internet,档案馆", "title": "你怎样才能帮助互联网档案馆呢？", "title_en": "How Can You Help the Internet Archive?", "transed": 1, "url": "https://blog.archive.org/2020/06/14/how-can-you-help-the-internet-archive/", "via": "", "real_tags": ["帮助", "internet", "档案馆"]}, {"category": "", "categoryclass": "", "imagename": "f614815d612c8b5d31f222fe9fc88ab2.jpg", "infoid": 1006613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sullimar Capital分析师比尔·布鲁斯特(Bill Brewster)在一条令人心碎的Twitter US：TWTR帖子中向追随者传达了这一信息，他在帖子中分享了一名家庭成员进入交易的悲惨经历。\n罗宾汉拒绝透露交易账户的任何细节，以及这种超大损失是如何累积的，但表示公司知道这一情况。\n这位发言人说：“听到这个可怕的消息，我们罗宾汉所有人都深感悲痛，我们伸出援手，与家人分享我们的哀悼。”\n“亚历克斯”的故事提醒人们，股票交易在现实生活中可能会产生毁灭性的后果。当谈到使用借来的现金来杠杆化股市头寸时，这可能是前所未有的真实情况。在股市，道琼斯工业平均指数(Dow Jones Industrial Average US：DJIA)某一交易日可能下跌近2000点，下一交易日反弹近500点。\n缺乏经验的交易员被认为是市场3月下旬低点和最近波动大幅反弹的驱动因素。德意志银行(Deutsche Bank)分析师帕拉格·萨特(Parag Thatte)表示，华尔街专业人士正被迫追逐继续抬高股市的业余人士。\nCNBC的吉姆·克雷默(Jim Cramer)周五也谈到了当前气候的危险。\n他在他的“疯狂金钱”节目中说：“事情变得太容易了，现在我们都要承受快速致富的人群被吹走的痛苦。”他将目前的环境描述为“猖獗的投机”。", "note_en": "Sullimar Capital analyst Bill Brewster delivered that message to followers in a heartbreaking Twitter  US:TWTR  thread in which he shared a family member’s tragic foray into trading.\n    Robinhood declined to share any details of the trading account and how such outsized losses piled up, but did say that the company was aware of the situation.\n    “All of us at Robinhood are deeply saddened to hear this terrible news and we reached out to share our condolences with the family,” the spokesperson said.\n  “Alex’s” story serves as a reminder that trading stocks can have devastating real-life consequences. This has perhaps never been more true than when it comes to using borrowed cash to leverage positions in a stock market where the Dow Jones Industrial Average  US:DJIA  can be down almost 2,000 points one session, then rebound nearly 500 points the next.\n  Inexperienced traders have been cited as a driving factor in the big bounce of the market’s late-March lows and the recent volatility. Deutsche Bank analyst Parag Thatte suggests that Wall Street professionals are being forced to chase amateurs who continue to bid up equities.\n    CNBC’s Jim Cramer on Friday also addressed the dangers of the current climate.\n  “It got too easy, and now we all have to suffer as the get-rich-quick crowd gets blown out,” he said on his “Mad Money” show, describing the current environment as one of “rampant speculation.”", "posttime": "2020-06-15 12:17:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗宾汉,options,股市", "title": "20岁的罗宾汉在罗宾汉期权上损失了70万英镑，夺走了生命", "title_en": "20-year-old lost 700k on Robinhood options, takes life", "transed": 1, "url": "https://www.marketwatch.com/story/finance-isnt-worth-losing-your-life-over-the-heartbreaking-story-of-a-rookie-trader-who-racked-up-700000-in-debt-2020-06-14", "via": "", "real_tags": ["罗宾汉", "options", "股市"]}, {"category": "", "categoryclass": "", "imagename": "736e4dd492d1f1403c0e0e455682eccc.jpg", "infoid": 1006611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亿万富翁出了名的不擅长本应相当容易的事情：捐出他们的钱。\n在超级富豪的万神殿里，杰克·多尔西(Jack Dorsey)作为世界第410位最富有的人，很难说是最吝啬的违法者。但他现在已经启动了这个历史上收入不平等时代最激进的实验之一-是否有可能迅速捐出超过10亿美元的钱，并有效地做到这一点。多尔西驳斥了亿万富翁的说法，即这是不可能的，他们需要庞大的团队，数十年的深入研究，完全的隐私，最重要的是，我们的耐心，才能巧妙地分配他们的财富。\n十年前，当被问及他的计划时，现在的世界首富杰夫·贝佐斯(Jeff Bezos)说：“我对慈善事业有很多想法--我还没有准备好分享或谈论这些想法。”“有时候我认为我们试图在理解问题之前先解决问题.”\n谷歌联合创始人谢尔盖·布林(Sergey Brin)现在是世界第14位最富有的人，他在2009年表示：“我想从容不迫地发展和系统化我们的慈善事业。”从那时起，他在很大程度上一直在重大捐赠的世界中擅离职守。\n这是美国亿万富翁们所宣扬的说教。通过模拟另一种选择，多尔西提供了最有说服力的反驳之一。\n拥有50亿美元净资产的Twitter和Square的联合创始人多尔西(Dorsey)不慌不忙。但随后他在今年4月表示，他将把当时三分之一的资产捐给一家新的慈善机构，从小规模做起，主要用于冠状病毒救援工作。到目前为止，这是亿万富翁向新冠肺炎捐赠的最大一笔钱。然而，更引人注目的是，多尔西愿意在谷歌的公共电子表格上实时披露每一份礼物。\n多尔西现在已经向全球各地和他家后院的50多个非营利组织捐赠了9000万美元，用于紧迫的需求和长期的重建项目，用于冠状病毒问题和种族正义，所有这些在支持少数族裔方面都有着突出的记录-这一记录正在赢得多尔西专家的尊重，甚至连那些最初将这一声明视为一次自私自利的宣传招待会的人也感到惊讶。\n“我希望整个硅谷都在关注杰克的所作所为。我希望签署捐赠誓言的每个人都在关注杰克的所作所为，“鲍勃·皮隆(Bob Pilon)说，他的改革联盟从多尔西(Dorsey)手中拿回了1000万美元。皮隆担心亿万富翁会表现得像完美主义者。“并不是每一美元都会得到绝对最有效的利用。但如果你能迅速将这些资金转移到有效的组织中，我认为这将增加很多价值。“\n“现在赚，以后再给”的做法成为亿万富翁世界的信条，主要是因为它的便利性。斯蒂芬妮·埃利斯-史密斯(Stephanie Ellis-Smith)为巨富们提供如何捐钱的建议，她称这种现象为“分析瘫痪”。财富顾问说，亿万富翁感觉自己的巨额财富几乎让他们背上了负担，他们觉得有责任不能把钱浪费掉，以至于他们最终什么都不做-把钱储存到私人基金会或捐赠者建议的基金中，把艰难的决定留到退休时再做，如果他们真的做出了决定的话。\n最糟糕的情况是一个给他们带来耻辱的错误，比如马克·扎克伯格(Mark Zuckerberg)在2010年向纽瓦克学校捐赠了1亿美元，这件事引起了争议，对于那些担心类似的公开失败的善意亿万富翁来说，这已经成为一个警示故事。\n亿万富翁约翰·阿诺德(John Arnold)去年告诉Recode：“我亲眼看到的是，许多人打算捐赠非常重要的资源，但他们推迟了实际的捐赠。”他说：“目的永远是在未来。然后他们离死亡太近了。“。\n但倡导者梦想着，在巨富的世界里，时代正在发生变化--只要有人能证明，在转移真金白银时避免失误并不是那么困难。这就是为什么当多尔西试验一种新方法时，这么多人的眼睛都盯着他。\n珍·卡罗兰(Jen Carolan)曾是教育改革慈善机构新学校风险基金(New School Venture Fund)的常务董事，她说，“旧的模式之所以进行优化，是因为担心失败，在我看来，这也是慈善家的遗产。”她与硅谷的慈善机构关系密切，曾担任过新学校风险基金(New School Venture Fund)的董事总经理。\n多尔西拒绝了就这篇报道的这种想法接受采访的请求，他也是在新一波对亿万富翁慈善的反弹之后，首批指导重大捐赠项目的亿万富翁之一。一些人认为，有迹象表明，多尔西至少比其他人更努力地应对这些批评：2018年，当他步行5英里上下班时，他听了阿南德·吉里达斯(Anand Giridharadas)对亿万富翁慈善事业的一本有影响力的、尖锐的批评--《赢家通吃》(Winner Take All)。\n在某种程度上，多尔西的模型是专门针对这一时刻的：冠状病毒提高了对目前正遭受大流行之苦的人们的果断和快速拨款的激励。一连串公开杀害手无寸铁的黑人的事件促使人们紧急推动解决美国的种族不公正问题。选择现在为哪些发行领域提供资金是一个相对容易的决定。但在其他方面，多尔西的方法对于亿万富翁阶层来说是高度可复制的-即使在大流行之后-因为它证明了许多阻碍他们慈善捐赠的程序和官僚作风是无端的。\n瓦妮莎·特里(Vanessa Terry)是唯一一个人，也是多尔西家族理财室的负责人，他负责指导捐款，这与他的同龄人笨拙的基金会形成了戏剧性的对比。多尔西本人也与一些潜在的受赠者一起出席了电话会议。这带来的速度是多尔西捐款的决定性因素，采访中描述了从他那里获得资金的八位非营利性领导人。\n正式申请吗？经过。报告要求吗？不。实地考察？这几天根本不可能。\n乔治·麦格劳(George McGraw)是纳瓦霍水务项目(Navajo Water Project)的负责人，该项目将土著居民与水源连接起来。他说，与多尔西的团队进行一次电话交谈，基本上就能拿到100万美元。\n“几个小时内，我们就有了答案。几天之内，钱就到了账户里，“他回忆道。“我从来没有见过这样的事情。”\n这种轻描淡写的做法引入了一些人认为不公平的新障碍：当多尔西在4月7日发布他的六条推文时，世界各地的非营利组织都在争先恐后地想办法走在多尔西之前，多尔西没有提供公开联系人或网站。这在很大程度上最终有利于两类人：一类是与硅谷内部人士有关系的人，他们可以在Twitter首席执行官面前获得想法；另一类是与名人有联系的人-或者是名人本身。\n麦格劳和其他人通过将他们联系在一起的共同朋友吸引了多尔西的注意。皮隆以及奥克兰和旧金山等其他受赠者能够获得礼物，因为他们的市长与多尔西有着长期的私人关系。\n可以肯定的是，传统的授予过程也不是完全公平或任人唯贤的。但一些积极分子说，多尔西的宏伟实验是有缺陷的，因为它没有为民众提供一个至少证明他们的理由的简单方法，尽管他高尚地承诺“透明地运作”。在某种程度上，这一障碍是对他标志性速度的权衡。\n泰龙·格兰迪森(Tyrone Grandison)为三家非营利性组织提供建议，他一直在努力争取在多尔西面前做到这一点，他开始在推特上使用多尔西的账号，试图联系到他。他说，整个经历让他对一个显示出如此多希望的项目感到“失望”。\n他说：“接入正确的网络胜过一切。”“最初的慈善透明主张在理论上是好的，但在实施中却步履蹒跚。”\n今年春天，社会企业家克里斯·梅尔卡多(Cris Mercado)花了几天时间试图在Start Small找到一个联系点，他说：“透明度只出现在分配端，这令人沮丧。”“它给人一种‘排他性俱乐部’的感觉，这种感觉经常围绕着科技行业。”\n一些非营利组织的负责人甚至要求允许编辑多尔西的公共电子表格，希望这个希望渺茫的请求至少能产生人类接触。\n这与认识或成为名人的感觉形成了鲜明对比。多尔西赠送的礼物中，有一半是与蕾哈娜(Rihanna)和杰伊-Z(Jay-Z)等名人共同捐赠的。其他几笔捐款也捐给了与肖恩·潘(Sean Penn)等电影明星或埃米纳姆(Eminem)和P·迪迪(P.Diddy)等艺术家有关的慈善基金会。这些名人中的许多人都是多尔西的私人朋友，像多尔西这样的硅谷人物越来越多地与这种类型的名人聚会和共同投资。\n这增加了多尔西的动机在一定程度上是为了帮助他的著名伙伴的可能性。写过一本关于名人慈善家的书的希尔德·范·登·布克(Hilde Van Den Bulck)说，这很重要，因为名人创建的慈善机构的记录参差不齐，其中一些，比如麦当娜花了数百万美元在非洲国家马拉维建造一所学校，结果证明这些钱是为了更多地为名人的品牌做贡献，而不是为世界做更多的事情。\nVan den Bulck说：“他们会选择他们认为很酷的东西--但这可能不一定是对抗Covid的首要任务。”“有些名人认为地球是平的。”\n名人关注的一个令人惊讶的好处是什么？多尔西对名人朋友优先事项的依赖似乎给了他一个独特的渠道，让他进入服务于少数族裔的非营利组织，这是许多亿万富翁和基金会难以做到的。多尔西合作的大多数名人都是黑人或拉丁裔。\n维纳斯·吉尼斯(Venus Ginés)几乎没有听说过这位Twitter创始人，她请求碧昂斯的基金会用大约20万美元资助她所在的休斯顿妇女健康组织Dia de la Mujer Latina。她最终得到了50万美元-几乎所有的钱都来自多尔西，而不是碧昂斯。\n“拉丁裔群体很少得到承认，”吉内斯说。“像他这样身材高大的人竟然会想到我们这个隐藏在休斯顿的小组织，这简直令人难以置信。”\n统计数据也证实了这一点。美国国家响应慈善中心(National Center For Responsive Philolopy)的瑞安·施莱格尔(Ryan Schlegel)5月中旬编制的一项研究显示，在将资金投向边缘人群方面，多尔西在分配资金方面比95%的美国慈善基金会做得更好，在造福有色人种方面，比80%的慈善基金会做得更好，在促进移民及其家庭的发展方面，比97%的慈善基金会做得更好。\n多尔西在旧金山也赢得了类似的掌声，尽管旧金山很贫穷，但科技亿万富翁长期以来一直忽视了他们喜欢的项目和登月想法，比如延长寿命的研究和殖民火星。密切关注旧金山湾区社会部门的金迈·卡特勒(Kim-Mai Cutler)说，她对多尔西支持的当地团体感到“惊喜”，她说，他选择的非营利组织需要真正的工作才能发现，而且“在他们自己的社区里受到很好的尊重”，特别是在有色人种中。\n所有这一切都是可以评估的，因为多尔西做了一件绝对可以复制的事情：他所有的天赋都在谷歌电子表格上披露。慈善基金会通常直到两年后才会在模糊的纳税申报文件中披露赠款，而有限责任公司-像多尔西或扎克伯格这样的慈善机构-在法律上不需要披露任何信息。\n马修·古多(Matthew Goudeau)是旧金山湾区的一名长期筹款人，他与多尔西的团队合作，为旧金山市的冠状病毒救援基金争取到了一笔最大的礼物-1500万美元-他认为这种透明度“相当激进”。\n他说：“特别是在旧金山，旧式家庭中一直有这样的传统：你悄悄地给予。”“现在，在这个大众传播和透明的时代，这种做法已经行不通了。”\n毫无疑问，这种透明度也给多尔西带来了好心人的善意，在2018年旧金山一项税收的激烈斗争之后，这一点尤为重要。旧金山的一项税收将多尔西描绘成一个吝啬的科技亿万富翁，同时他之前的慈善记录也有问题。每一份资金公告都会在电子表格上带来新的一行，通常还会有一场关于这家非营利性组织的新@Jack推特风暴-这也会让人们对一位仁慈、有社会意识的亿万富翁赞不绝口。\n但这也是可复制的。倡导者希望多尔西得到的宣传能给那些在临终前不知道如何处理财富的亿万富翁们起到有力的甜头，而不是创建一个用这位亿万富翁的姓氏装饰的慈善基金会，这个基金会在他们死后很长一段时间内仍然存在。\n本月早些时候，多尔西在一次播客中对他的朋友安德鲁·杨(Andrew Yang)说：“我想在有生之年把我所有的钱都捐出去。”他向他的非营利性组织捐赠了500万美元。“我自私地想在我的有生之年看到这些影响。”\n在Vox的每一天，我们都致力于回答您最重要的问题，并为您和世界各地的观众提供有能力拯救生命的信息。此时此刻，我们的使命从未像现在这样重要：通过理解来增强你们的能力。VOX的工作正在接触到比以往任何时候都多的人，但我们独特的解释性新闻品牌需要资源-特别是在大流行和经济低迷时期。您的财政贡献不会构成捐赠，但它将使我们的工作人员能够继续以当前所需的质量和音量提供免费的文章、视频和播客。请考虑今天就为VOX做出贡献。", "note_en": "Billionaires are notoriously bad at something that should be quite easy: giving away their money.\n In the pantheon of the ultra-rich, Jack Dorsey, as  the world’s 410th-wealthiest person, is hardly the stingiest offender. But he has now kick-started one of the most radical experiments in this  era of historic income inequality — whether it is possible to quickly give away more than $1 billion of his money, and to do it effectively. Dorsey is putting the lie to the claim from billionaires that this is impossible and that they need enormous teams, decades of deep study, total privacy, and, most of all, our patience, in order to smartly disburse their fortunes.\n “I have a lot of ideas about philanthropy — that I’m not ready to share or talk about,” Jeff Bezos, now the world’s richest man,  said a decade ago when asked about his plans. “Sometimes I think we try to solve problems before we understand the problem.”\n “Our philanthropy is something I want to take my time with and develop and systematize,” Google co-founder Sergey Brin, now the world’s 14th-wealthiest person,  said back in 2009. Since then, he has largely remained AWOL in the world of major giving.\n This has been the sermon preached by America’s billionaires. And by modeling an alternative, Dorsey is offering one of the most convincing rebuttals.\n Dorsey, the co-founder of Twitter and Square with a net worth of $5 billion,  has taken his time. But then he said this April that he would give away what was then one-third of his assets to a new charitable vehicle, Start Small, for  coronavirus relief efforts, primarily. It was, by far,  the largest dedication of money to Covid-19 by a billionaire. What was more striking, though, was Dorsey’s willingness to disclose each gift in real time on a public Google spreadsheet.\n Dorsey has now given away $90 million to five dozen nonprofit groups, both around the globe and in his backyard, on immediate needs and on longer-term rebuilding projects, for coronavirus issues  and for racial justice, and all of this with a standout record when it comes to supporting minorities — a record that is earning Dorsey respect from experts and is surprising even  those who originally saw the announcement as a self-serving publicity junket.\n “I hope all of Silicon Valley is looking at what Jack is doing. I hope everyone who has  signed the Giving Pledge is looking at what Jack is doing,” said Bob Pilon, whose REFORM Alliance took home $10 million from Dorsey. Pilon is worried about billionaires acting like perfectionists. “Not every single dollar is always going to be put to the absolutely most impactful use. But if you can get those dollars out there quickly, get them to effective organizations, I think that’s going to add a lot of value.”\n The “earn now, figure out the giving later” approach became gospel in the world of billionaires, primarily for its convenience. Stephanie Ellis-Smith, who advises the mega-wealthy on how to give away their money, called this phenomenon “analysis paralysis.” Billionaires feel almost burdened by their enormous wealth, wealth advisers say, and feel such a responsibility to not screw up giving it away that they end up doing nothing — stockpiling money into private foundations or  donor-advised funds and saving the hard decisions for their retirements, if they ever make them at all.\n The worst-case scenario is a mistake that brings them ignominy, such as  Mark Zuckerberg’s divisive $100 million gift to Newark schools in 2010, which has become a cautionary tale for well-intentioned billionaires who fear a similar public failure.\n “What I’ve seen firsthand is many people who have intent to give away very significant resources, but they delay the actual giving,”  billionaire John Arnold told Recode last year. “The intent is always in the future. And then they get too close to death.”\n But advocates dream that times are a-changin’ in the world of the mega-rich — if only  someone could show that it’s not so hard to avoid fumbles while moving real money. And that’s why so many eyes are on Dorsey as he tests a new way.\n “The old model was optimizing for fear of failure and, in my opinion, the philanthropist’s legacy,” said Jen Carolan, who is well wired into Silicon Valley charity as a former managing director at New Schools Venture Fund, an education reform philanthropy.\n Dorsey, who declined a request for an interview about this thinking for this story, is also among the first billionaires to direct major giving programs after the new wave of backlash to billionaire philanthropy. And some believe there are signs that Dorsey, more than others, has at least grappled with these critiques: As he  walked five miles to and from work in 2018, he listened to the audiobook of   Winners Take All , an influential, searing critique of billionaire philanthropy by Anand Giridharadas.\n To some extent, Dorsey’s model is specific to this moment: The coronavirus ups the incentives for decisiveness and rapid-fire grants to people suffering right now from the pandemic. A spate of publicized killings of unarmed black people has spurred an urgent push to address racial injustice in the US. Choosing what issue areas to fund right now is a relatively easy decision. But in other ways, Dorsey’s approach is highly replicable for the billionaire class — even after the pandemic — by serving as a proof point that a lot of the process and bureaucracy that stalls their charitable giving are gratuitous.\n    A sole person, Vanessa Terry, who also oversees Dorsey’s family office, is directing the donations, casting a dramatic contrast with the lumbering foundations of his peers. Dorsey himself has appeared on calls with some potential grantees. The speed this enables is the defining element of Dorsey’s giving, eight nonprofit leaders who received funding from him described in interviews.\n A formal application? Pass. A reporting requirement? Nah. A site visit? Not even possible these days.\n George McGraw, the head of the  Navajo Water Project, which connects indigenous people to water sources, said that one phone conversation with Dorsey’s team was basically all it took to land $1 million.\n “Within a few hours, we had an answer. And within a few days, the money was in the account,” he recalled. “I’ve never seen anything like this.”\n This light touch has introduced new hurdles that some see as unfair: When Dorsey unfurled his six-tweet thread on April 7, nonprofits around the world raced to figure out how to get in front of Dorsey, who offered no public point of contact or website. And that has largely ended up favoring two groups of people: those who had relationships with Silicon Valley insiders, who could get an idea in front of the Twitter CEO; and those with connections to celebrities — or are celebrities themselves.\n McGraw and others were able to get Dorsey’s attention through mutual friends who connected them. Pilon, along with other grantees like the cities of Oakland and San Francisco, were able to secure gifts because their mayors had long-standing personal relationships with Dorsey.\n The traditional grantmaking process is not totally fair or meritocratic either, to be sure. But some activists say Dorsey’s grand experiment is flawed because it didn’t offer the hoi polloi an easy way to at least make their case, despite his  high-minded promise to “operate transparently.” To some extent, this hurdle is a trade-off for his trademark speed.\n Tyrone Grandison, who advises three nonprofits that he has been struggling to get in front of Dorsey,  has taken to tweeting at Dorsey’s handle to try to get ahold of him. He said the whole experience left him “disappointed” in a project that showed so much promise.\n “Having access to the right networks trumps everything else,” he said. “The initial claims of transparency in philanthropy were good in theory but have faltered in implementation.”\n “It’s frustrating that the transparency is only on the allocation end,” said Cris Mercado, a social entrepreneur who spent a few days this spring trying to find a point of contact at Start Small. “It feeds into the ‘exclusive club’ feel that often surrounds tech.”\n Some nonprofit heads have even asked for permission to edit Dorsey’s public spreadsheet, hoping the long-shot request may at least yield a human contact.\n Contrast that with what it’s like to know — or be — a celebrity. Half of the total gifts Dorsey has given away have been made in a pooled donation with celebrities, such as Rihanna and Jay-Z. Several other donations have gone to charitable foundations tied to movie stars like Sean Penn or artists like Eminem and P. Diddy. Many of these celebrities are Dorsey’s personal friends, the type of celebrities that Silicon Valley figures like  Dorsey increasingly party and co-invest with.\n   That raises the possibility that Dorsey is motivated in part to do favors for his famous buddies. That matters, says Hilde Van den Bulck, who wrote a book on celebrity philanthropists, because celebrity-created charities have a checkered track record, with some,  such as the millions that Madonna spent to build a school in the African nation of Malawi, turning out to be boondoggles meant to do more for celebrities’ brands than for the world.\n “They will pick what they think is cool — but it may not necessarily be, say, the priority in fighting Covid,” said Van den Bulck. “There are some celebrities out there who think the Earth is flat.”\n One surprising upside of this celebrity focus? Dorsey’s reliance on the priorities of his celebrity friends seems to be giving him a unique funnel into nonprofits that serve minority populations, something that many billionaires and foundations struggle to do. Most of the celebrities Dorsey is working with are black or Latino.\n Venus Ginés had barely heard of the Twitter founder when she asked Beyoncé’s foundation to fund her Houston women’s health organization, Dia de la Mujer Latina, with about $200,000. She ended up getting $500,000 — with almost all of the money coming from Dorsey, not Beyoncé.\n “Latino groups rarely get acknowledged,” Ginés said. “It was just mind-boggling that somebody of his stature would think about our little organization, tucked away in Houston.”\n The stats bear this out, too. Dorsey is doing better at allocating money than 95 percent of US charitable foundations when it comes to targeting his money to benefit the marginalized, better than 80 percent of them when it comes to benefiting people of color, and better than 97 percent of them when it comes to boosting immigrants and their families, according to  mid-May research compiled by Ryan Schlegel of the National Center for Responsive Philanthropy.\n Dorsey is earning similar applause in San Francisco,  which, despite its poverty, tech billionaires have long neglected in favor of pet projects and moonshot ideas like life-extension research and colonizing Mars. Kim-Mai Cutler, a close observer of the Bay Area’s social sector, said she was “pleasantly surprised” by the local groups Dorsey had backed, saying the nonprofits he chose required real work to discover and were “well-respected within their own communities,” especially among people of color.\n Any of this is only assessable because of one thing Dorsey has done that is definitely replicable: All of his gifts are disclosed on a Google spreadsheet. Charitable foundations don’t typically disclose grants until as long as two years later in obscure tax filings,  while limited liability companies — philanthropic vehicles like Dorsey’s or Zuckerberg’s — aren’t legally required to disclose anything.\n Matthew Goudeau, a longtime Bay Area fundraiser who worked with Dorsey’s team to land the single biggest gift to the city of San Francisco’s coronavirus relief fund — $15 million — considers that transparency “pretty radical.”\n “In San Francisco especially, there’s been this tradition among the old-time families: You give quietly,” he said. “Now, in this era of mass communication and transparency, that doesn’t work anymore.”\n There is little doubt that this transparency brings Dorsey goodwill, too, as a good Samaritan, which is especially important after a bruising 2018 fight over a  San Francisco tax to combat homelessness that portrayed him as a stingy tech billionaire,  along with a questionable prior charitable record. Every funding announcement brings a new row on the spreadsheet, and often a new @Jack tweetstorm about the nonprofit — one that also invites gushing praise for a benevolent, social-minded billionaire.\n But that, too, is replicable. Rather than creating a charitable foundation adorned with the billionaire’s surname that lives long after their death, advocates hope the publicity Dorsey is getting serves as a potent sweetener for the billionaires who can’t figure out what to do with their fortune until they’re on their deathbed.\n “I want to give out all my money in my lifetime,” Dorsey said  on a podcast earlier this month to his friend Andrew Yang, to whose  nonprofit he gave $5 million. “I want to see the impacts, selfishly, in my lifetime.”\n   Every day at Vox, we aim to answer your most important questions and provide you, and our audience around the world, with information that has the power to save lives. Our mission has never been more vital than it is in this moment: to empower you through understanding. Vox’s work is reaching more people than ever, but our distinctive brand of explanatory journalism takes resources — particularly during a pandemic and an economic downturn. Your financial contribution will not constitute a donation, but it will enable our staff to continue to offer free articles, videos, and podcasts at the quality and volume that this moment requires.  Please consider making a contribution to Vox today.", "posttime": "2020-06-15 11:43:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "dorsey,亿万富翁", "title": "杰克·多尔西(Jack Dorsey)让亿万富翁捐钱的激进实验", "title_en": "Jack Dorsey's Radical Experiment for Billionaires to Give Away Their Money", "transed": 1, "url": "https://www.vox.com/recode/2020/6/11/21287395/jack-dorsey-start-small-billionaire-philanthropy-coronavirus-twitter-square-kaepernick-rihanna", "via": "", "real_tags": ["dorsey", "亿万富翁"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在做一个智力练习，它去了一个我认为不是特别有用的地方，但仍然足够有趣，可以分享。\n假设你想给某人一份你以前检索过的网页的副本，你想让他们相信你注册他们的东西在某个时候确实来自原始的Web服务器。\n这可能是有用的，例如，对于互联网档案馆。如果我想贡献自己的抓取结果，档案馆如何验证我提交的页面不是伪造的？\n请注意，收件人不能自己获取相同的页面，并将其与您提供给他们的内容进行比较。它可能在您检索它时已更改，或者他们可能没有访问该特定文档的权限。\n我真正想要的是原始服务器对文档进行数字签名。有一份签名HTTP交换的Internet草案就是这样做的，但是出于本练习的目的，我希望能够在今天部署的任何Web服务器上这样做，而不是要求支持新的协议。\n那么，我如何才能让现有的Web服务器为我签署响应呢？\n如果我使用的是HTTPS，那么服务器已经在TLS握手期间的CertificateVerify消息中向我发送了一个数字签名，该数字签名可以根据他们的TLS证书进行公开验证。我可以利用这一点吗？\n嗯，不完全是。该签名仅涵盖握手的前面部分。TLS对其他所有东西使用各种新的对称密钥，所有这些密钥都来自通过Diffie-Hellman临时密钥交换生成的随机密钥。\nTLS握手确实保证只要任何一方都没有泄露任何临时密钥，那么客户端就可以信任与其对话的服务器也拥有与服务器的公共证书相对应的私钥。\n因为使用的密码是基于对称密钥的，所以根据定义，客户端和服务器在握手之后共享所有相同的密钥。这意味着任何一端都可以伪造信息，假装来自另一端。但没关系，因为如果我收到你发来的自称是我发来的信息，我就不会上当了。最坏的结果是任意妄为地欺骗自己，而有更简单的方法可以做到这一点。\n不过，一旦我试图说服第三方相信这些信息的真实性，这些保证就会烟消云散。\n我能想到的唯一方法就是泄露临时密钥，以及完整的加密流。在这一点上，收件人可以验证整个流是由拥有这些密钥的人生成的，并验证服务器提供的证书在对话时是有效的。但他们不能证实我没有伪造所有的申请数据。事实上，他们现在可以自己作假了！\n我认为这个问题有一个简单的解决办法，尽管它使解决方案的用处比我希望的要小得多。\n让我们介绍一个简单的代理服务器。我会通过这个代理连接到源服务器。代理将记录通过它来回发送的字节，但它不会理解它们：它只会看到加密的TLS流量。在连接结束时，它将在时间戳加上完整的连接日志上给我一个数字签名。我可以检查来自代理的签名是否与我在对话结束时看到的匹配，如果不匹配，则丢弃日志。\n(引入此代理并不会改变TLS的安全状况：它必须能够抵御位于客户端和服务器之间的被动或主动攻击者。)。\n现在我可以给您签名的连接日志，以及连接过程中使用的临时密钥。\n如果您相信代理只对实际通过它的流量生成签名，那么您就有足够的信息来验证我是否与源服务器进行了可信的对话。\n嗯，差不多了。如果我能说服代理连接到我控制下的服务器，该服务器就可以完成与原始服务器的握手，然后通过另一个通道与我共享临时密钥，我们可以协作通过代理进行完全伪造的对话，获得原始服务器从未见过的流量的签名。\n验证TLS证书的过程包括检查证书中的DNS名称是否与客户端要连接的DNS名称匹配。我们不能使代理完全可信，但如果它尽最大努力确保它连接的服务器与请求的DNS名称相对应，我们可以降低它的不可信赖性。\n这至少意味着任何DNSSEC签名都应该包括在代理的流量日志中，这样收件人就可以确信DNSResponse来自同一来源。\n就我个人而言，我觉得我非常愿意接受像这样的可信时间戳代理的证据，假设代理是由一个合理的中立方操作的。\n如果这对您来说还不够，我怀疑有一种方法可以使用安全多方计算让代理和客户端都参与到会话中，这样就不会在会话期间泄露临时密钥。\n但这已经比我预想的要复杂得多，而且与让人们自己从原始服务器获取页面相比，并没有提供太多优势。所以我今天就到此为止了。\n不过，仔细阅读TLS1.3规范来解决所有这些问题肯定是一项有趣的练习！", "note_en": "I was doing a mental exercise and it went someplace that I think is notterribly useful but still interesting enough to share.\n Say you want to give somebody a copy of a web page that you’vepreviously retrieved, and you want to convince them that what you’regiving them really did come from the original web server at some point.\n This could be useful, for example, with the Internet Archive. If I wantto contribute my own crawl results, how can the Archive verify that Ididn’t forge the pages I’m submitting?\n Note that the recipient can’t just fetch the same page themself andcompare it to what you gave them. It may have changed since the timewhen you retrieved it, or they may not have access to that particulardocument.\n What I really want is for the origin server to have digitally signed thedocument. There’s an Internet Draft for  Signed HTTP Exchanges whichdoes exactly that, but for the purposes of this exercise I want to beable to do it for any web server as it is deployed today, rather thanrequiring support for a new protocol.\n So how else can I get an existing web server to sign its response forme?\n  If I’m using HTTPS then the server is already sending me a digitalsignature that’s publicly verifiable against their TLS certificate, inthe  CertificateVerify message during the TLS handshake. Can I takeadvantage of that?\n Well, not exactly. That signature only covers the preceding parts of thehandshake. TLS uses an assortment of new symmetric keys for everythingelse, all derived from a random key generated through a Diffie-Hellmanephemeral key exchange.\n The TLS handshake does guarantee that as long as neither party hasleaked any of the ephemeral keys, then the client can trust that theserver it’s talking to also posesses the private key corresponding tothe server’s public certificate.\n Because the cryptography in use is based on symmetric keys, bydefinition both the client and server share all the same keys after thehandshake. That means that either end could forge messages pretending tobe from the other. But that’s okay, because if I receive a message fromyou that claims to be from me, I’m not fooled. The worst either endcould do is willfully fool themselves, and there are easier ways to dothat.\n Those guarantees go out the window as soon as I try to convince a thirdparty of the authenticity of these messages, though.\n The only way I can think of to do that is to reveal the ephemeral keys,together with the full encrypted stream. At that point, the recipientcan verify that the entire stream was produced by somebody who had thosekeys, and verify that the server’s offered certificate was valid at thetime of the conversation. But they can’t verify that I didn’t forge partor all of the application data. In fact, they’re now in a position to dotheir own forgeries!\n  I think there’s a simple fix for that problem, although it makes thesolution much less useful than I hoped for.\n Let’s introduce a simple proxy server. I’ll connect to the origin serverthrough this proxy. The proxy will log the bytes that are sent back andforth through it, but it won’t understand them: it’ll only see theencrypted TLS traffic. At the end of the connection, it will give me adigital signature over a timestamp plus the complete connection log. Ican check that the signature from the proxy matches what I saw from myend of the conversation, and discard the log if not.\n (Introducing this proxy doesn’t change the security story for TLS: italready had to be resilient against passive or active attackers sittingbetween the client and the server.)\n Now I can give you the signed connection log, plus the ephemeral keysused during the connection.\n If you trust that the proxy only produces signatures over traffic thatactually passed through it, then you have enough information to verifythat I’ve given you an authentic conversation with the origin server.\n  Well, almost. If I can convince the proxy to connect to a server undermy control, that server can complete the handshake with the originserver, then share the ephemeral keys with me via another channel, andwe can collaborate to conduct a completely forged conversation throughthe proxy, getting its signature on traffic that the origin server neversaw.\n Part of the process of verifying a TLS certificate involves checkingthat the DNS name in the certificate matches the DNS name the client wastrying to connect to. We can’t make the proxy entirely trustworthy, butwe can make it less untrustworthy if it does its best to ensure that theserver it connects to corresponds to the requested DNS name.\n At the least this means any DNSSEC signatures should be included in theproxy’s traffic log, so a recipient can be convinced that the DNSresponse came from the same origin.\n   Personally I feel like I’d be pretty willing to accept evidence from atrusted timestamping proxy like this, assuming the proxy were operatedby a reasonably neutral party.\n If that isn’t enough for you, I suspect there’s a way to use securemulti-party computation to have the proxy and the client bothparticipate in the conversation, in such a way that neither is capableof leaking the ephemeral keys during the conversation.\n But this is already more complicated than I hoped for, and doesn’t offermuch advantage over just having people fetch pages from origin serversthemselves. So I’m calling it a day.\n Reading the TLS 1.3 specification carefully enough to work all this outwas sure an interesting exercise though!", "posttime": "2020-06-15 11:42:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缓存,共享,shared,代理", "title": "验证共享Web缓存", "title_en": "Authenticating Shared Web Caches", "transed": 1, "url": "https://jamey.thesharps.us/2020/06/13/authenticating-shared-web-caches/", "via": "", "real_tags": ["缓存", "共享", "shared", "代理"]}, {"category": "", "categoryclass": "", "imagename": "2eac011074c2a00544dcb03082abe549.png", "infoid": 1006608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个项目是一个低开销的Java采样分析器，不存在安全点偏差问题。它提供了特定于热点的API来收集堆栈跟踪和跟踪内存分配。该分析器可与OpenJDK、Oracle JDK和其他基于HotSpot JVM的Java运行时协同工作。\n硬件和软件性能计数器，如缓存未命中、分支未命中、页面错误、上下文切换等。\n在此模式下，分析器收集堆栈跟踪示例，包括Java方法、本机调用、JVM代码和内核函数。\n通常的方法是接收perf_events生成的调用堆栈，并将它们与AsyncGetCallTrace生成的调用堆栈进行匹配，以便生成Java和本机代码的准确配置文件。此外，异步事件探查器还提供了一种解决方法，可以在AsyncGetCallTrace失败的某些角落情况下恢复堆栈跟踪。\n与将地址转换为Java方法名称的Java代理直接使用perf_events相比，此方法具有以下优势：\n可以在较旧的Java版本上运行，因为它不需要-XX：+PReserve veFramePointer，后者只在JDK 8u60和更高版本中可用。\n不会引入来自-XX：+PReserve veFramePointer的性能开销，在极少数情况下可能高达10%。\n可以将探查器配置为收集分配最大堆内存的调用点，而不是检测消耗CPU的代码。\n异步探查器不使用具有重大性能影响的诸如字节码检测或昂贵的DTrace探测器等侵入性技术，也不影响转义分析或阻止诸如分配消除之类的JIT优化。仅测量实际的堆分配。\n该分析器具有TLAB驱动的采样功能。它依赖于特定于热点的回调来接收两种通知：\n当在新创建的TLAB(火焰图中的水帧)中分配对象时；\n这意味着不计算每个分配，而只计算每N kB的分配，其中N是TLAB的平均大小。这使得堆采样非常便宜，并且适合生产。另一方面，收集的数据可能是不完整的，尽管在实践中它通常会反映顶级分配来源。\n可以使用-i选项调整采样间隔。例如，-i 500k将在平均分配的500KB空间之后采集一个样本。但是，小于TLAB大小的间隔不会生效。\n与使用类似方法的Java Task Control不同，Async-Profiler不需要Java飞行记录器或任何其他JDK商业功能，它完全基于开源技术，与OpenJDK兼容。\n堆探查器需要热点调试符号。Oracle JDK已经将它们嵌入到libjvm.so中，但是在OpenJDK构建中，它们通常被放在单独的包中。例如，要在Debian/Ubuntu上安装OpenJDK调试符号，请运行：\n在Gentoo上，icedTea OpenJDK包可以使用每个包的设置Feature=&#34；nostrid&34；来保留符号。\n-e wall选项告诉异步探查器在给定的时间段内对所有线程进行平均采样，而不考虑线程状态：正在运行、休眠或已锁定。例如，这在分析应用程序启动时间时会很有帮助。\n-e ClassName.method Name选项检测给定的Java方法，以便使用堆栈跟踪记录此方法的所有调用。\n仅支持非本机Java方法。要评测本机方法，请改用硬件断点事件，例如-e JAVA_JAVA_LANG_Throwable_Fill InStackTrace。\n确保JAVA_HOME环境变量指向您的JDK安装，然后运行make。GCC是必修课。生成后，探查器代理二进制文件将位于生成子目录中。此外，可以将代理加载到目标进程的小型应用程序jattach也将编译到build子目录中。\n从Linux4.6开始，使用perf_events从非根进程捕获内核调用堆栈需要设置两个运行时变量。您可以使用sysctl或按如下方式设置它们：\n要运行代理并向其传递命令，需要提供帮助器脚本profiler.sh.。典型的工作流程是启动Java应用程序，附加代理并开始性能分析，演练您的性能场景，然后停止性能分析。代理的输出，包括分析结果，将显示在Java应用程序的标准输出中。\n或者，您可以指定-d(持续时间)参数，以便使用单个命令在固定的时间段内分析应用程序。\n默认情况下，性能分析频率为100 Hz(每10ms的CPU时间)。以下是打印到Java应用程序终端的输出示例：\n-执行配置文件-总样本数：687未知(本地)：1(0.15%)-6790000000(98.84%)ns，679个样本[0]Primes.isPrime[1]Primes.primesThread[2]Primes.access$000[3]Primes$1.run[4]java.lang.Thread.run.。为简洁起见省略了很多输出.。NS百分比样本最多-6790000000 98.84%679Primes.isPrime 40000000 0.58%4__do_softirq.。省略了更多输出.。\n这表明最热的方法是Primes.isPrime，导致它的hottestcall堆栈来自Primes.primesThread。\n如果您需要在JVM启动时立即分析一些代码，而不是使用profiler.sh脚本，那么可以在命令行上将async-profiler作为代理附加。例如：\n代理库通过JVMTI参数接口配置。参数字符串的格式在源代码中描述。profiler.sh脚本实际上将命令行参数转换为该格式。\n例如，-e alloc转换为event=alloc，-f profile.svg转换为file=profile.svg，依此类推。但是有些参数是由profiler.sh脚本直接处理的。例如，-d 5导致3个操作：使用启动命令附加分析器代理，休眠5秒，然后使用停止命令再次附加代理。\n异步探查器提供开箱即用的火焰图形支持。指定-o svg参数可将分析结果转储为可在所有主流浏览器中立即查看的交互式SVG。此外，如果目标文件名以.svg结尾，则将自动选择SVG输出格式。\nStart-以半自动模式开始评测，即Profiler将运行，直到显式调用停止命令。\n恢复-启动或恢复已停止的早期评测会话。所有收集的数据仍然有效。分析选项不会在会话之间保留，应重新指定。\n列表-显示可用性能分析事件的列表。此选项仍然需要PID，因为受支持的事件可能会因JVM版本而异。\n-d N-分析持续时间，以秒为单位。如果未提供Start、Resume、Stopor Status选项，则探查器将在指定的时间段内运行，然后自动停止。示例：./profiler.sh-d 30 8983。\n-e事件-分析事件：CPU、Alalloc、Lock、Cache-Misses等。使用列表查看可用事件的完整列表。\n在分配分析模式中，每个调用跟踪的顶帧是已分配对象的类，计数器是堆压力(已分配的TLabs或TLAB外的对象的总大小)。\n在锁分析模式中，顶部帧是锁/监视器的类，计数器是进入该锁/监视器所需的纳秒数。\n-e mem：&lt；func&gt；[：rwx]在函数&lt；func&gt；设置读/写/执行断点。mem事件的格式与perf-record.execution断点也可以由函数名指定，例如-e malloc将跟踪所有本地malloc函数的调用。\n-e trace：&lt；id&gt；设置内核跟踪点。可以指定tracepoint符号名称，例如-e syscalls：sys_enter_open将跟踪所有打开的syscall。\n-I N-如果N后跟ms(毫秒)、us(微秒)或s(秒)，则以纳秒或其他单位设置评测间隔。仅计算CPU活动时间。CPU空闲时不收集任何样本。默认值为10000000(10ms)。示例：./profiler.sh-i 500us 8983\n-j N-设置Java堆栈分析深度。如果N大于默认值2048，则此选项将被忽略。示例：./profiler.sh-j 30 8983。\n-b N-设置帧缓冲区大小，以缓冲区中应容纳的JavamMethod ID数表示。如果收到有关帧缓冲区大小不足的消息，请将此值从默认值增加。示例：./profiler.sh-b 5000000 8983。\n-t-单独配置螺纹。每个堆栈跟踪都将以表示单个线程的帧结束。示例：./profiler.sh-t 8983。\n-o fmt-指定分析结束时要转储的信息。FMT可以是以下选项之一：\nJFR-以Java任务控制可读的Java飞行记录器格式转储事件。这不需要启用JDK商业功能。\n折叠[=C]-以FlameGraph脚本使用的格式转储折叠的调用跟踪。这是调用堆栈的集合，其中每行都是分号分隔的帧列表，后跟一个计数器。\n总数-计数器是收集的指标的总值，例如总分配大小。\n-I包含给定模式的-X排除过滤器堆栈跟踪。-I定义必须出现在堆栈跟踪中的名称模式，而-X是不能出现在输出的任何堆栈跟踪中的模式。可以多次指定-i和-X选项。模式可以以星号*开始或结束，该星号表示任何(可能为空)字符序列。示例：./profiler.sh-i&39；素数。*&#39；-i&#39；java/*&#39；-X&#39；*Unsafe.park*&#39；8983\n--Title Title、--width px、--Height px、--minwidth px、--Reverse-FlameGraph参数。示例：./profiler.sh-f profile.svg--title&#34；示例CPU配置文件&#34；--minwidth 0.5 8983。\n-f文件名-要将配置文件信息转储到的文件名。文件名中的%p扩展到目标JVM的PID；%t-扩展到命令调用时的时间戳。示例：./profiler.sh-o已折叠-f/tmp/traces-%t.txt 8983。\n--all-user-仅包括用户模式事件。当内核分析受perf_event_paranoid设置限制时，此选项非常有用。--all-kernel是仅包含内核模式事件的对应选项。\n--cstack模式-如何遍历本机帧(C堆栈)。可能的模式有FP(帧指针)、LBR(最后一个分支记录，从Linux 4.1开始在Haswell上可用)和no(不收集C堆栈)。\n默认情况下，C堆栈显示在CPU、iTimer、Wall-Clock和perf-events配置文件中，Java级别的事件(如alloc和lock)只收集Java堆栈。\n-v，--version-打印Profiler库的版本。如果指定了PID，则获取加载到给定进程中的库的版本。\n可以从容器内部和主机系统分析在Docker或LXC容器中运行的Java进程。\n从主机分析时，PID应该是主机名称空间中的Java进程ID。使用PS AUX|grep java或docker top&lt；容器&gt；查找进程ID。\nAsync-Profiler应该由特权用户从主机运行-它将自动切换到正确的PID/装载名称空间，并更改用户凭据以匹配目标进程。还要确保目标容器可以通过与主机上相同的绝对路径访问libasyncProfiler.so。\n默认情况下，Docker容器限制访问perf_event_opensyscall。因此，为了允许在容器内进行性能分析，您需要修改seccomp配置文件，或者使用--security-opt seccomp=unconfined选项将其完全禁用。此外，可能需要--cap-add SYS_ADMIN。\n或者，如果无法更改Docker配置，您可以退回到-e定时器配置模式，请参阅故障排除。\n在大多数Linux系统上，perf_events捕获最大深度为127帧的调用堆栈。在最新的Linux内核上，可以使用sysctl kernel.perf_event_max_stack或通过写入/proc/sys/kernel/perf_event_max_stack文件来配置它。\nProfiler为目标进程的每个线程分配8KB的perf_event缓冲区。在非特权用户下运行时，请确保/proc/sys/kernel/perf_event_mlock_kb值足够大(超过8*个线程)。否则，消息&#34；perf_event mmap FAILED：将打印不允许的操作，并且不会收集本机堆栈跟踪。\n不能无懈可击地保证以保证没有其他代码运行的方式将perf_events溢出Signalis传递给Java线程，这意味着在极少数情况下，捕获的Java堆栈可能与捕获的本机(用户+内核)堆栈不匹配。\n您将不会看到堆栈上Java帧之前的非Java帧。例如，如果START_THREAD调用JavaMain，然后您的Javacode开始运行，您将看不到结果堆栈中的前两个帧。另一方面，您将看到Java代码调用了非Java框架(用户和内核)。\n分析间隔太短可能会导致诸如clone()这样的大型系统调用连续中断，因此它永远不会完成；请参阅#97。解决办法只需增加间隔即可。\n如果在JVM启动时未加载代理(通过使用-agentpath选项)，强烈建议使用-XX：+UnlockDiagnoticVMOptions-XX：+DebugNonSafepoints JVM标志。如果没有这些标志，探查器仍将正常工作，但结果可能不准确，例如，如果没有-XX：+DebugNonSafepoints，配置文件中很可能不会出现简单的内联方法。在运行时附加代理时，CompiledMethodLoad JVMTI事件启用调试信息，但仅适用于打开事件后编译的方法。\n由于HotSpot动态附加机制的限制，Profiler必须由与目标JVM进程所有者完全相同的用户(和组)运行，如果Profiler由不同的用户运行，它将尝试自动更改当前的用户和组。对于root用户，这可能会成功，但对于其他用户则不会，从而导致上述错误。\n附加套接字/tmp/.java_pidNNN已删除。使用某些计划脚本自动清理/tmp是一种常见做法。配置清理软件以排除删除.java_pid*文件。如何检查：运行lsof-p pid|grep java_pid如果它列出了套接字文件，但该文件不存在，则这就是描述的问题。\nJava进程的/tmp目录在物理上与您的shell的/tmp目录不同，因为Java运行在容器或chroot环境中。JAttach试图自动解决此问题，但它可能缺少执行此操作所需的权限。检查strace Build/jAttach PID属性。\nJVM正忙，无法到达安全点。例如，JVM正在进行长期运行的垃圾收集。检查方法：运行KILL-3 PID。健康的JVM进程应该在其控制台中打印线程转储和堆信息。\n已建立与目标JVM的连接，但JVM无法加载探查器共享库。请确保JVM进程的用户具有通过完全相同的绝对路径访问libasyncProfiler.so的权限。有关详细信息，请参阅#78。\nPERF_EVENT_OPEN()系统调用失败。错误消息被打印到目标JVM的错误流。\n如果无法更改配置，则可以退回到-e iTimer分析模式。它类似于CPU模式，但不需要perf_events支持。作为一个缺点，将不会有内核堆栈跟踪。\n可能需要安装带有OpenJDK调试符号的软件包。有关详细信息，请参阅分配分析。\nJVM共享库不导出gHotSpotVMStructs*符号-显然这不是热点JVM。有时，同样的消息也可能是由错误构建的JDK引起的(参见#218)。在这些情况下，安装JDK调试符号可能会解决问题。\n异步探查器无法解析非Java函数名称，因为/proc/[pid]/map中的内容已损坏。已知该问题发生在运行Linux kernel 5.x的Ubuntu时的容器中。这是操作系统错误，请参阅https://bugs.launchpad.net/ubuntu/+source/linux/+bug/1843018.。\n输出中的此消息表示没有足够的空间来存储所有调用跟踪。请考虑使用-b选项增加帧缓冲区大小。\n输出文件由目标JVM进程写入，而不是由探查器脚本写入。如果文件无法打开(例如，由于缺乏权限)，则错误消息将打印到目标进程(JVM控制台)的stderr。", "note_en": "This project is a low overhead sampling profiler for Javathat does not suffer from  Safepoint bias problem.It features HotSpot-specific APIs to collect stack tracesand to track memory allocations. The profiler works withOpenJDK, Oracle JDK and other Java runtimes based on the HotSpot JVM.\n  Hardware and Software performance counters like cache misses, branch misses, page faults, context switches etc.\n         In this mode profiler collects stack trace samples that include  Java methods, native calls,  JVM code and  kernel functions.\n The general approach is receiving call stacks generated by  perf_eventsand matching them up with call stacks generated by  AsyncGetCallTrace,in order to produce an accurate profile of both Java and native code.Additionally, async-profiler provides a workaround to recover stack tracesin some  corner caseswhere  AsyncGetCallTrace fails.\n This approach has the following advantages compared to using  perf_eventsdirectly with a Java agent that translates addresses to Java method names:\n Works on older Java versions because it doesn&#39;t require -XX:+PreserveFramePointer, which is only available in JDK 8u60 and later.\n Does not introduce the performance overhead from  -XX:+PreserveFramePointer,which can in rare cases be as high as 10%.\n  Instead of detecting CPU-consuming code, the profiler can be configuredto collect call sites where the largest amount of heap memory is allocated.\n async-profiler does not use intrusive techniques like bytecode instrumentationor expensive DTrace probes which have significant performance impact.It also does not affect Escape Analysis or prevent from JIT optimizationslike allocation elimination. Only actual heap allocations are measured.\n The profiler features TLAB-driven sampling. It relies on HotSpot-specificcallbacks to receive two kinds of notifications:\n when an object is allocated in a newly created TLAB (aqua frames in a Flame Graph);\n This means not each allocation is counted, but only allocations every  N kB,where  N is the average size of TLAB. This makes heap sampling very cheapand suitable for production. On the other hand, the collected datamay be incomplete, though in practice it will often reflect the top allocationsources.\n Sampling interval can be adjusted with  -i option.For example,  -i 500k will take one sample after 500 KB of allocatedspace on average. However, intervals less than TLAB size will not take effect.\n Unlike Java Mission Control which uses similar approach, async-profilerdoes not require Java Flight Recorder or any other JDK commercial feature.It is completely based on open source technologies and it works with OpenJDK.\n  Heap profiler requires HotSpot debug symbols. Oracle JDK already has themembedded in  libjvm.so, but in OpenJDK builds they are typically shippedin a separate package. For example, to install OpenJDK debug symbols onDebian / Ubuntu, run:\n      On Gentoo the  icedtea OpenJDK package can be built with the per-package setting FEATURES=&#34;nostrip&#34; to retain symbols.\n  -e wall option tells async-profiler to sample all threads equally every givenperiod of time regardless of thread status: Running, Sleeping or Blocked.For instance, this can be helpful when profiling application start-up time.\n    -e ClassName.methodName option instruments the given Java methodin order to record all invocations of this method with the stack traces.\n  Only non-native Java methods are supported. To profile a native method,use hardware breakpoint event instead, e.g.  -e Java_java_lang_Throwable_fillInStackTrace\n   Make sure the  JAVA_HOME environment variable points to your JDK installation,and then run  make. GCC is required. After building, the profiler agent binarywill be in the  build subdirectory. Additionally, a small application  jattachthat can load the agent into the target process will also be compiled to the build subdirectory.\n  As of Linux 4.6, capturing kernel call stacks using  perf_events from a non-root process requires setting two runtime variables. You can set them usingsysctl or as follows:\n  To run the agent and pass commands to it, the helper script  profiler.shis provided. A typical workflow would be to launch your Java application,attach the agent and start profiling, exercise your performance scenario, andthen stop profiling. The agent&#39;s output, including the profiling results, willbe displayed in the Java application&#39;s standard output.\n   Alternatively, you may specify  -d (duration) argument to profilethe application for a fixed period of time with a single command.\n  By default, the profiling frequency is 100Hz (every 10ms of CPU time).Here is a sample of the output printed to the Java application&#39;s terminal:\n --- Execution profile ---Total samples: 687Unknown (native): 1 (0.15%)--- 6790000000 (98.84%) ns, 679 samples [ 0] Primes.isPrime [ 1] Primes.primesThread [ 2] Primes.access$000 [ 3] Primes$1.run [ 4] java.lang.Thread.run... a lot of output omitted for brevity ... ns percent samples top ---------- ------- ------- --- 6790000000 98.84% 679 Primes.isPrime 40000000 0.58% 4 __do_softirq... more output omitted ...\n This indicates that the hottest method was  Primes.isPrime, and the hottestcall stack leading to it comes from  Primes.primesThread.\n  If you need to profile some code as soon as the JVM starts up, instead of using the  profiler.sh script,it is possible to attach async-profiler as an agent on the command line. For example:\n  Agent library is configured through the JVMTI argument interface.The format of the arguments string is described in the source code.The  profiler.sh script actually converts command line arguments to that format.\n For instance,  -e alloc is converted to  event=alloc,  -f profile.svgis converted to  file=profile.svg and so on. But some arguments are processeddirectly by  profiler.sh script. E.g.  -d 5 results in 3 actions:attaching profiler agent with start command, sleeping for 5 seconds,and then attaching the agent again with stop command.\n  async-profiler provides out-of-the-box  Flame Graph support.Specify  -o svg argument to dump profiling results as an interactive SVGimmediately viewable in all mainstream browsers.Also, SVG output format will be chosen automatically if the targetfilename ends with  .svg.\n     start - starts profiling in semi-automatic mode, i.e. profiler will rununtil  stop command is explicitly called.\n resume - starts or resumes earlier profiling session that has been stopped.All the collected data remains valid. The profiling options are not preservedbetween sessions, and should be specified again.\n    list - show the list of available profiling events. This option stillrequires PID, since supported events may differ depending on JVM version.\n -d N - the profiling duration, in seconds. If no  start,  resume,  stopor  status option is given, the profiler will run for the specified periodof time and then automatically stop. Example:  ./profiler.sh -d 30 8983\n -e event - the profiling event:  cpu,  alloc,  lock,  cache-misses etc.Use  list to see the complete list of available events.\n In allocation profiling mode the top frame of every call trace is the classof the allocated object, and the counter is the heap pressure (the total sizeof allocated TLABs or objects outside TLAB).\n In lock profiling mode the top frame is the class of lock/monitor, andthe counter is number of nanoseconds it took to enter this lock/monitor.\n  -e mem:&lt;func&gt;[:rwx] sets read/write/exec breakpoint at function &lt;func&gt;. The format of  mem event is the same as in  perf-record.Execution breakpoints can be also specified by the function name,e.g.  -e malloc will trace all calls of native  malloc function.\n -e trace:&lt;id&gt; sets a kernel tracepoint. It is possible to specifytracepoint symbolic name, e.g.  -e syscalls:sys_enter_open will traceall  open syscalls.\n -i N - sets the profiling interval in nanoseconds or in other units,if N is followed by  ms (for milliseconds),  us (for microseconds)or  s (for seconds). Only CPU active time is counted. No samplesare collected while CPU is idle. The default is 10000000 (10ms). Example:  ./profiler.sh -i 500us 8983\n -j N - sets the Java stack profiling depth. This option will be ignored if N is greaterthan default 2048. Example:  ./profiler.sh -j 30 8983\n -b N - sets the frame buffer size, in the number of Javamethod ids that should fit in the buffer. If you receive messages about aninsufficient frame buffer size, increase this value from the default. Example:  ./profiler.sh -b 5000000 8983\n -t - profile threads separately. Each stack trace will end with a framethat denotes a single thread. Example:  ./profiler.sh -t 8983\n    -o fmt - specifies what information to dump when profiling ends. fmt can be one of the following options:\n jfr - dump events in Java Flight Recorder format readable by Java Mission Control.This  does not require JDK commercial features to be enabled.\n collapsed[=C] - dump collapsed call traces in the format used by FlameGraph script. This isa collection of call stacks, where each line is a semicolon separated listof frames followed by a counter.\n  total - the counter is a total value of collected metric, e.g. total allocation size.\n -I include,  -X exclude - filter stack traces by the given pattern(s). -I defines the name pattern that  must be present in the stack traces,while  -X is the pattern that  must not occur in any of stack traces in the output. -I and  -X options can be specified multiple times. A pattern may begin or end witha star  * that denotes any (possibly empty) sequence of characters. Example:  ./profiler.sh -I &#39;Primes.*&#39; -I &#39;java/*&#39; -X &#39;*Unsafe.park*&#39; 8983\n --title TITLE,  --width PX,  --height PX,  --minwidth PX,  --reverse - FlameGraph parameters. Example:  ./profiler.sh -f profile.svg --title &#34;Sample CPU profile&#34; --minwidth 0.5 8983\n -f FILENAME - the file name to dump the profile information to.  %p in the file name is expanded to the PID of the target JVM;  %t - to the timestamp at the time of command invocation. Example:  ./profiler.sh -o collapsed -f /tmp/traces-%t.txt 8983\n --all-user - include only user-mode events. This option is helpful when kernel profilingis restricted by  perf_event_paranoid settings.  --all-kernel is its counterpart option for including only kernel-mode events.\n --cstack MODE - how to traverse native frames (C stack). Possible modes are fp (Frame Pointer),  lbr (Last Branch Record, available on Haswell since Linux 4.1),and  no (do not collect C stack).\n By default, C stack is shown in cpu, itimer, wall-clock and perf-events profiles.Java-level events like  alloc and  lock collect only Java stack.\n -v,  --version - prints the version of profiler library. If PID is specified,gets the version of the library loaded into the given process.\n  It is possible to profile Java processes running in a Docker or LXC containerboth from within a container and from the host system.\n When profiling from the host,  pid should be the Java process ID in the hostnamespace. Use  ps aux | grep java or  docker top &lt;container&gt; to findthe process ID.\n async-profiler should be run from the host by a privileged user - it willautomatically switch to the proper pid/mount namespace and changeuser credentials to match the target process. Also make sure thatthe target container can access  libasyncProfiler.so by the sameabsolute path as on the host.\n By default, Docker container restricts the access to  perf_event_opensyscall. So, in order to allow profiling inside a container, you&#39;ll needto modify  seccomp profileor disable it altogether with  --security-opt seccomp=unconfined option. Inaddition,  --cap-add SYS_ADMIN may be required.\n Alternatively, if changing Docker configuration is not possible,you may fall back to  -e itimer profiling mode, see  Troubleshooting.\n  On most Linux systems,  perf_events captures call stacks with a maximum depthof 127 frames. On recent Linux kernels, this can be configured using sysctl kernel.perf_event_max_stack or by writing to the /proc/sys/kernel/perf_event_max_stack file.\n Profiler allocates 8kB perf_event buffer for each thread of the target process.Make sure  /proc/sys/kernel/perf_event_mlock_kb value is large enough(more than  8 * threads) when running under unprivileged user.Otherwise the message  &#34;perf_event mmap failed: Operation not permitted&#34;will be printed, and no native stack traces will be collected.\n There is no bullet-proof guarantee that the  perf_events overflow signalis delivered to the Java thread in a way that guarantees no other code has run,which means that in some rare cases, the captured Java stack might not matchthe captured native (user+kernel) stack.\n You will not see the non-Java frames  preceding the Java frames on thestack. For example, if  start_thread called  JavaMain and then your Javacode started running, you will not see the first two frames in the resultingstack. On the other hand, you  will see non-Java frames (user and kernel)invoked by your Java code.\n  Too short profiling interval may cause continuous interruption of heavysystem calls like  clone(), so that it will never complete;see  #97.The workaround is simply to increase the interval.\n When agent is not loaded at JVM startup (by using -agentpath option) it ishighly recommended to use  -XX:+UnlockDiagnosticVMOptions -XX:+DebugNonSafepoints JVM flags.Without those flags the profiler will still work correctly but results might beless accurate e.g. without  -XX:+DebugNonSafepoints there is a high chance that simple inlined methods will not appear in the profile. When agent is attached at runtime  CompiledMethodLoad JVMTI eventenables debug info, but only for methods compiled after the event is turned on.\n   Due to limitation of HotSpot Dynamic Attach mechanism, the profiler must be runby exactly the same user (and group) as the owner of target JVM process.If profiler is run by a different user, it will try to automatically changecurrent user and group. This will likely succeed for  root, but not forother users, resulting in the above error.\n    Attach socket  /tmp/.java_pidNNN has been deleted. It is a commonpractice to clean  /tmp automatically with some scheduled script.Configure the cleanup software to exclude  .java_pid* files from deletion. How to check: run  lsof -p PID | grep java_pid If it lists a socket file, but the file does not exist, then this is exactlythe described problem.\n  /tmp directory of Java process is not physically the same directoryas  /tmp of your shell, because Java is running in a container or in chroot environment.  jattach attempts to solve this automatically,but it might lack the required permissions to do so. Check  strace build/jattach PID properties\n JVM is busy and cannot reach a safepoint. For instance,JVM is in the middle of long-running garbage collection. How to check: run  kill -3 PID. Healthy JVM process should printa thread dump and heap info in its console.\n  The connection with the target JVM has been established, but JVM is unable to load profiler shared library.Make sure the user of JVM process has permissions to access  libasyncProfiler.so by exactly the same absolute path.For more information see  #78.\n  perf_event_open() syscall has failed. The error message is printed to the error streamof the target JVM.\n   If changing the configuration is not possible, you may fall back to -e itimer profiling mode. It is similar to  cpu mode, but does notrequire perf_events support. As a drawback, there will be no kernelstack traces.\n  It might be needed to install the package with OpenJDK debug symbols.See  Allocation profiling for details.\n  JVM shared library does not export  gHotSpotVMStructs* symbols -apparently this is not a HotSpot JVM. Sometimes the same messagecan be also caused by an incorrectly built JDK(see  #218).In these cases installing JDK debug symbols may solve the problem.\n  Async-profiler was unable to parse non-Java function names because ofthe corrupted contents in  /proc/[pid]/maps. The problem is known tooccur in a container when running Ubuntu with Linux kernel 5.x.This is the OS bug, see  https://bugs.launchpad.net/ubuntu/+source/linux/+bug/1843018.\n  This message in the output means there was not enough space to store all call traces.Consider increasing frame buffer size with  -b option.\n  Output file is written by the target JVM process, not by the profiler script.If the file cannot be opened (e.g. due to lack of permissions), the error messageis printed to  stderr of the target process (JVM console).", "posttime": "2020-06-15 09:58:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,用于,profiler", "title": "用于Java的异步探查器-采样CPU和堆探查器", "title_en": "Async-profiler – sampling CPU and HEAP profiler for Java", "transed": 1, "url": "https://github.com/jvm-profiling-tools/async-profiler", "via": "", "real_tags": ["java", "用于", "profiler"]}, {"category": "", "categoryclass": "", "imagename": "1067bd208971db8d05766547a5de2b67.jpg", "infoid": 1006606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "菲利普·约翰逊是一位很有前途的音乐神童。然后他偷了一位老师珍爱的斯特拉迪瓦里小提琴。\n他快要死了，棉头肘部戳破了一件宽松的衬衫。朋友们来访，用勺子喂他吃冰激凌，放音乐。他的女儿们也在附近，放学后顺道过来，太小了，不能处理这可怕的场景。就在那里，斯特拉迪瓦里小提琴小心翼翼地放在壁橱里，在他前妻设立的房间里，看不见的地方有斯特拉迪瓦里小提琴。\n菲利普·约翰逊的手指不再强壮到可以拉任何小提琴，更不用说如此无情的人了。所以他把稻草放在塑料箱里。这件乐器是他唯一有价值的东西。这也是他最大的秘密。\n当他离开时，这个消息将震惊所有人，从FBI到他的家人，再到罗曼·托滕伯格(Roman Totenberg)的女儿们，她们都将继承这件乐器。他们会问，这个曾经很有前途，后来身无分文的怪人是如何偷了一把价值数百万美元的18世纪小提琴，并逍遥法外的。毕竟，1980年拍摄这张照片时，他是唯一的嫌疑人。随着死亡的临近，通常是房间里声音最大的约翰逊闭上了嘴。这是2011年的秋天。这是他31年来的秘密。\n约翰逊，谁也不能拥有一份工作，抵押贷款或一段关系，不知何故完成了一件几乎每个人都认为不可能的事情：他在明目张胆的情况下演奏托滕伯格的斯特拉迪瓦里小提琴，直到最后。\n他通过混乱和控制做到了这一点，在他的过去和现在之间筑起了一堵牢不可破的墙。那些怀疑约翰逊犯罪的人与他失去了联系。那些在他生命的最后20年里认识他的人从来没有听说过托滕伯格失窃事件。他们只是以为约翰逊有一把旧小提琴。\n“为什么，”他的朋友、同为小提琴家的格雷戈里·马尔多纳多(Gregory Maldonado)问道，“为什么菲尔会有一把稻草呢？”\n即使在约翰逊在2011年感恩节前两周死于胰腺癌后，这条小径仍然是冰冷的。然后，去年夏天，约翰逊的前妻萨恩·陈(Thanh Tran)决定考虑出售这把小提琴。她根本不知道那是稻草。\n一位朋友建议她联系匹兹堡的经销商菲利普·英杰安(Phillip Injeian)。是Injeian在处理电子邮件发送的照片时发现它与一辆1734年建造的斯特拉迪瓦里钢琴相匹配，这是从已故的托滕伯格那里偷来的。\nInjeian安排于6月下旬在纽约与Tran会面。他还给联邦调查局打了电话。在她向他展示小提琴后的几个小时内，该机构艺术品盗窃组的两名特工突然冲进来认领了这把小提琴。他们联系了托滕伯格夫妇，包括长期担任国家公共广播电台法律事务记者的女儿尼娜(Nina)。\n8月，在曼哈顿一场座无虚席的新闻发布会上，当局将小提琴归还给了他的家人。\n在城市的另一边，在大都会歌剧院的更衣室里，两名音乐家准备排练。\n阿贝·阿普尔曼停顿了一下。一个小提琴家多年没有想过的名字突然出现在他的脑海里。\n这一罪行违反了逻辑。这位年轻的小提琴家前面还有很多事等着他，当大师混进隔壁房间时，他却厚颜无耻地表演了起来。他疑神疑鬼地离开了小镇。甚至在他挥霍事业的同时，他也拒绝透露自己的秘密。这件精致的手工制作的木头和肠线杰作是他拥有、演奏和监禁的。\n一直都有暗示。直到现在，在发现之后的几个月里，那些接触过约翰逊的人才能拼凑出这位傲慢的业余人士是如何成为一名职业小偷的。\n他的兄弟姐妹们想起了他在费城郊外的童年。父母溺爱家里的宝宝，引发了终身的权利感。前妻指出了他的焦虑，那些似乎困扰着他母亲的焦虑，以及他的躁狂行为。这些症状使她考虑到未诊断出注意力缺陷障碍的可能性。其他人注意到约翰逊与上帝的关系。他从小就非常虔诚，但后来失去了信仰，斥责任何相信更高存在的人。\n最后，约翰逊的妹妹承认，她永远不会完全解开这个谜团。\n“我们能搞清楚是什么让别人这么做吗？”卡罗尔·安德森问道。“我们真的那么了解自己吗？圣经说，‘心在万物之上是诡诈的，是极其邪恶的，谁能知道呢？’“。\n这种弦乐器以意大利工匠安东尼奥·斯特拉迪瓦里的名字命名，被认为是最好的乐器。这也是非常罕见的。专家估计，在斯特拉迪瓦里1737年去世之前制作的1000把左右的小提琴中，约有500把今天幸存下来。\n小提琴明星约书亚·贝尔(Joshua Bell)说：“稻草的魔力很难用语言来形容。”“这在某种程度上是听帕瓦罗蒂演唱和听一个非常好的男高音之间的区别。当你弹奏一把斯特拉德琴，一把很棒的斯特拉德琴的时候，它有一些特别之处。就像，‘哦，天哪，小提琴应该是这样的声音。’“。\n2001年，贝尔花了近400万美元购买了一把有着自己迷人历史的斯特拉迪瓦里小提琴：1936年，一位名叫朱利安·奥特曼的熟练演奏家潜入卡内基音乐厅，从布朗尼斯·奥胡伯曼(Bronisław Huberman)手中偷走了这把小提琴，用厚厚的鞋油掩饰了它，并在斯特拉德琴上以B级演出长达数十年。奥特曼失窃案是在他于20世纪80年代中期去世后才被发现的。\n在某些方面，这个故事反映了托滕伯格的故事，他认识休伯曼，也是一位来自波兰的极具天赋的犹太小提琴家。有一个重要的例外。\n约翰逊从来就不想成为一名熟练工。有一段时间，他被许多人认为是一个充满活力的演奏家，包括他的大学老师约瑟夫·西尔弗斯坦(Joseph Silverstein)-20世纪最伟大的管弦乐小提琴家之一-有相当大的前途。\n“这个秘密。我认为这个秘密要了他的命，“认识约翰逊几十年的马尔多纳多说。\n这是1980年5月13日，托滕伯格正在马萨诸塞州剑桥市朗伊音乐学院举行一场全莫扎特独奏会。他不只是当晚最吸引人的明星。他也是学校的主任。\n约翰逊是来参加音乐会的，他并不出名，但在紧密联系的波士顿音乐界当了四年的学生后，他成了一张熟悉的面孔。\n他27岁，留着披头士式的棕色头发，英俊帅气。那天晚上，约翰逊带着一个小提琴盒来到皮克曼音乐厅就座。这起案件稍后将被人们记住，因为当局试图拼凑出某人是如何将一把246年前的小提琴从拥挤的建筑中走私出来的。\n今天，如果你走进朗伊位于哈佛广场边缘的主楼，你会被摄像机捕捉到。1980年的情况并非如此。你可以很容易地消失在大楼蜿蜒的走廊里。\n当晚，大约200人挤满了皮克曼，去听托滕伯格和钢琴家莉莉·杜蒙的表演。\n演出结束后，托滕伯格轻快地穿过大堂，把斯特拉迪瓦里音乐厅单独留在了与导演办公室相连的更衣室里。他走出来和人群混在一起。当他回来时，他的小提琴箱不见了。联邦调查局表示，它是在附近发现的，但是空的。\n“那天有人看到他在大楼里，这很奇怪，因为他不是托滕伯格先生的粉丝，”曾跟随托滕伯格学习的小提琴家艾琳·奎尔姆巴赫(Irene Quirmbach)回忆道。“我们并不真正理解他为什么会在那里。”\n托滕伯格的前助手之一肯尼思·萨奇(Kenneth Sarch)说，那天晚上有人无意中听到约翰逊抱怨说，这位年迈的大师不配得到这么好的乐器。\n凯伦·玛丽·马默(Karen Marie Marmer)当时是一名来自纽约的年轻小提琴家，她记得在朗伊的大堂遇到了约翰逊。她认为可能是演唱会后的第二天晚上。他很激动。\n“我不敢相信他们会指控我做这样的事，”他告诉她。\n约翰逊家所在的社区距离费城西南只有半小时车程，由战后在美国各地如雨后春笋般涌现的整洁、朴素的砖房组成。\n这不是一个幸福的家。他的父亲罗伯特在放弃成为一名机械师之前，曾学习成为一名艺术家。他的母亲玛丽恩因焦虑和抑郁而瘫痪。等到孩子们出现的时候，小罗伯特、卡罗尔和菲利普·马里恩都不愿离开家去超市了。\n“她会说，‘就像你出生的那一天，我的生命就结束了，’” 回忆起被告知的情景。\n宝宝的生活就不一样了。他在1953年早些时候到达。卡罗尔除非吃完她所有的胡萝卜，否则不允许从餐桌上起来。菲尔吃大块黄油，有时还蘸点番茄酱。比他大11岁的鲍比终于开口了。为什么他什么都能逍遥法外？\n鲍比先拉小提琴。但他缺乏纪律。当菲尔7岁时，他注意到了这件乐器。他问他是否可以试一下。\n“我几乎想不出该给他看什么了，”小罗伯特·约翰逊(Robert Johnson Jr.)说。今天说的。“他说，‘好吧，我想我会看看我能用它做些什么。’他只是坚持下去，坚持下去，到了夏末，到了上学的时候，他就能把赞美诗书里的每一首赞美诗都弹出来了。我们简直目瞪口呆。“\n“毫无疑问，菲尔是最好的小提琴手，”他的同学斯蒂芬·纳齐吉安(Stephen Nazigian)说。“当别人来回挠的时候，他用了整把弓。他真的知道自己在做什么。他每天练习一小时，而其他孩子很难练15分钟。“。\n随着男孩的成长超出了学校的计划，这家人找到了曾受过茱莉亚音乐学院培训的费城交响乐团成员杰罗姆·威格勒(Jerome Wigler)。今天，95岁的维格勒仍然记得约翰逊。但对他的演奏来说就不算什么了。\n威格勒记得他改宗的经历。菲尔站在维格勒家门外，急切地向任何一名新生推销，这让他感到不安。\n“他会试图让他们加入教会，”威格勒说。“他有各种各样的宣传。他只会谈论宗教。“。\n从里德利高中1970级毕业后，约翰逊前往南方的佛罗里达圣经学院学习。这就是事情发生变化的地方。\n他从学校辍学，开始为佛罗里达的交响乐团做自由撰稿人，到70年代中期他北上马萨诸塞州时-原因尚不清楚-他不再是一名信徒。\n1976年，现年23岁的约翰逊进入波士顿大学学习音乐。该系的教职员工中有一些该领域最具传奇色彩的球员，包括托滕伯格。\n其他教师是波士顿交响乐团的成员。后来成为约翰逊老师的小提琴家约瑟夫·西尔弗斯坦(Joseph Silverstein)记得许多让他与众不同的事情之一。\n“不是菲尔，”西尔弗斯坦说。“他不知从哪里冒出来的。我还是不知道他是从哪里来的。“。\n他的第一位老师罗杰·谢尔蒙特(Roger Shermont)是BSO的资深小提琴家，他发现他太难教了。西尔弗斯坦同意与约翰逊较量。\n这是一次幸运的中风。作为BSO的首席小提琴手，西尔弗斯坦是他那个时代最重要的管弦乐演奏家之一。对于一个年轻的学生来说，这就像是当米奇·曼特尔还在洋基队的中场漫步时，和他一起在击球笼里工作。\n西尔弗斯坦于2015年底去世，享年83岁。但在他致命心脏病发作的两周前，华盛顿邮报问他是否还记得约翰逊。\n这孩子看东西看得很快，而且有爵士乐的天赋。他获得了BSO避暑之家坦格尔伍德音乐中心(Tanglewood Music Center)的一项享有盛誉的奖学金。\n西尔弗斯坦说：“他也有某种与生俱来的魅力。”“这个狂野的孩子有些地方不对劲。他是个天才。他的打法很散漫，但很吸引人。“。\n然后是他的另一面。约翰逊没有尊重他人。不是他的同龄人，也不是他的上级。\n西尔弗斯坦说：“你会给他指定一首特定的音乐，而他会想出另一首歌。”“他是个叛逆者，我们真的在努力驾驭这个孩子，让他集中注意力。”\n西尔弗斯坦记得约翰逊对托滕伯格不屑一顾，托滕伯格在波士顿大学任教，直到1978年离开去朗伊。\n“但是听着，菲尔几乎对所有人都不屑一顾，”他说。“他是个相当傲慢的孩子。60年代的残留物。“。\n当约翰逊在波士顿大学的走廊里戴着手套时，其他学生窃笑着，表面上是为了保护他的手，即使在温暖的月份也是如此。在演出前的后台，约翰逊不会轻描淡写地使用他的天平。取而代之的是，他会炮制出主要作品的节选，以一种意在舞台上的强度表演。\n“他会吹嘘并提到他的独奏表演，”Quirmbach回忆道。“这一直都是关于他的。”", "note_en": "Philip Johnson was a promising musical prodigy. Then he stole a teacher’s prized Stradivarius.\n  He is dying, Q-tip elbows poking through a baggy shirt. Friends visit, spooning him ice cream and playing music. His daughters are around as well, stopping in after school, too young to process the grim scene. And there, carefully placed in the closet, out of view in the room his ex-wife has set up, is the Stradivarius.\n Philip Johnson’s fingers are no longer strong enough to play any violin, never mind one so unforgiving. So he keeps the Strad in a plastic crate. The instrument is the only thing he has of value. It is also his biggest secret.\n When he’s gone, the news will shock them all, from the FBI to his family to the daughters of Roman Totenberg, who stand to inherit the instrument. They will ask how this once-promising, later penniless eccentric stole an 18th-century violin worth millions — and got away with it. After all, he was the only suspect when it was taken in 1980. As death approaches, Johnson, usually the loudest voice in the room, keeps his mouth shut. It is the fall of 2011. This has been his secret for 31 years.\n Johnson, who was never able to hold a job, a mortgage or a relationship, somehow accomplished something most everyone thought impossible: He played Totenberg’s Stradivarius in plain view until the end.\n He did this through chaos and control, by building an impenetrable wall between his past and present. Those who suspected Johnson of the crime lost track of him. Those who knew him during the last two decades of his life had never heard of the Totenberg theft. They just thought Johnson had an old violin.\n “Why,” asked Gregory Maldonado, a friend and fellow violinist, “would Phil have a Strad?”\n The trail remained ice-cold even after Johnson died of pancreatic cancer two weeks before Thanksgiving 2011. Then, last summer, Thanh Tran, Johnson’s ex-wife, decided to look into selling the violin. She had no idea it was a Strad.\n A friend suggested she contact Phillip Injeian, a dealer in Pittsburgh. It was Injeian who, working off e-mailed photos, saw that it matched a Stradivarius built in 1734 and stolen from the late Totenberg.\n Injeian arranged to meet Tran in New York in late June. He also called the FBI. Within hours of her showing him the violin, two agents with the agency’s art theft team swooped in to claim the Strad. They contacted the Totenbergs, including daughter Nina, the longtime National Public Radio legal affairs correspondent.\n In August, during a packed news conference in Manhattan, the authorities returned the violin to the family.\n  Across town, in the locker room of the Metropolitan Opera, two musicians got ready for a rehearsal.\n  Abe Appleman paused. A name the violinist hadn’t thought of in years popped into his head.\n  The crime defies logic. The young violinist, with so much ahead of him, brazenly acts while the master mingles in the next room. He leaves town under a butt of suspicion. And even as he squanders his career, he refuses to reveal his secret. This delicate, hand-crafted masterpiece of wood and gut strings is his to possess, to play, to imprison.\n There were hints all along. Only now, in the months after the discovery, can those who came into contact with Johnson piece together how this cocky amateur became a professional thief.\n His siblings think of his childhood just outside Philadelphia. The parents coddling the baby of the family, sparking a lifetime sense of entitlement. The ex-wife points to his anxieties, the ones that seemed to haunt his mother, and the manic behavior. The symptoms led her to consider the possibility of undiagnosed attention-deficit disorder. Others note Johnson’s relationship with God. He grew up deeply religious but later lost faith, railing at anyone who believed in a higher being.\n In the end, Johnson’s sister admits that she will never fully unpack the mystery.\n “Can we ever figure out what makes someone else tick?” Carol Anderson asks. “Do we really know ourselves that well? The Bible says, ‘The heart is deceitful above all things, and desperately wicked: who can know it?’ ”\n  The stringed instrument, named for the Italian craftsman Antonio Stradivari, is considered the finest one can play. It is also very rare. Experts estimate that of the 1,000 or so violins crafted before Stradivari’s death in 1737, about 500 survive today.\n “The magic of a Strad is very hard to put in words,” says violin star Joshua Bell. “It’s sort of the difference between listening to Pavarotti sing and listening to a very good tenor. When you play a Strad, a great Strad, there’s something about it. Like, ‘Oh, my God, that’s what a violin should sound like.’ ”\n In 2001, Bell paid nearly $4 million for a Stradivarius with its own fascinating history: In 1936, a journeyman player named Julian Altman snuck into Carnegie Hall and stole the violin from Bronisław Huberman, disguised it with thick layers of shoe polish and performed on the Strad in B-rate gigs for decades. The Altman theft was uncovered only when he died in the mid-1980s.\n The story, in some ways, mirrors that of Totenberg, who knew Huberman and was also a supremely gifted Jewish violinist from Poland. There is an important exception.\n Johnson was never meant to be a journeyman. At one time, he was thought by many, including his college teacher Joseph Silverstein — one of the great orchestral violinists of the 20th century — to be a dynamic player with considerable promise.\n “The secret. I think the secret killed him,” says Maldonado, who knew Johnson for decades.\n  It is May 13, 1980, and Totenberg is playing an all-Mozart recital at the Longy School of Music in Cambridge, Mass. He is not just the star attraction that night. He is also the school’s director.\n Johnson, here to attend the concert, isn’t famous, but after four years as a student in the tightly knit Boston music community, he’s a familiar face.\n He is 27, a handsome man with Beatlesque brown hair. That night, Johnson brings a violin case to Pickman Hall and takes his seat. This case will be remembered later as authorities try to piece together how somebody could have smuggled a 246-year-old violin out of a crowded building.\n Today, if you walk into Longy’s main building on the edge of Harvard Square, you’ll be captured on camera. That wasn’t the case in 1980. You could easily disappear within the building’s winding hallways.\n That night, about 200 people packed Pickman to hear Totenberg perform with pianist Lily Dumont.\n After performing, Totenberg scoots across the lobby and leaves the Stradivarius alone, in a dressing room connected to the director’s office. He steps out to mix with the crowd. When he returns, his violin case is gone. The FBI says that it was found nearby, but empty.\n  “He had been seen in the building that day, and it was odd because he wasn’t a fan of Mr. Totenberg,” recalls Irene Quirmbach, a violinist who had studied with Totenberg. “We didn’t really understand why he was there.”\n Kenneth Sarch, one of Totenberg’s former assistants, says Johnson was overheard grumbling that night that the aging master didn’t deserve such a fine instrument.\n Karen Marie Marmer, then a young violinist visiting from New York, remembers running into Johnson in the lobby of Longy. She thinks it may have even been the night after the concert. He was agitated.\n “I can’t believe they’re accusing me of something like this,” he told her.\n The Johnson family’s neighborhood, just a half-hour southwest of Philadelphia, is made up of the neat, modest brick houses that sprang up all across postwar America.\n It was not a happy home. Robert, his father, had studied to become an artist before giving it up to become a machinist. Marion, his mother, is paralyzed by anxiety and depression. By the time the children come along — Robert Jr., Carol and finally Philip — Marion won’t so much as leave the house for the supermarket.\n “She would say, ‘It’s like the day you were born, my life ended,’ ” Carol recalls being told.\n Life for the baby is different. He arrives early in 1953. Carol isn’t allowed to get up from the table unless she finishes all of her carrots. Phil eats gobs of butter, sometimes dipped in ketchup. Bobby, 11 years older, finally speaks up.  Why is he getting away with everything?\n  Bobby plays the violin first. But he lacks discipline. When Phil is 7, he notices the instrument. He asks whether he can try it.\n “I could barely think of what to show him,” Robert Johnson Jr. says today. “He said, ‘Okay, I guess I’ll see what I can do with it.’ He just kept at it and kept at it, and by the end of the summer, when it was time to go to school, he could play every hymn in the hymn book. We were absolutely dumbfounded.”\n  “Phil was hands down the best violinist,” says Stephen Nazigian, a classmate. “He used the entire bow when others were scratching back and forth. He really knew what he was doing. He would practice an hour a day when other kids would be hard-pressed to do 15 minutes.”\n  With the boy outgrowing the school program, the family tracked down Jerome Wigler, Juilliard-trained and a member of the Philadelphia Orchestra. Today, at 95, Wigler still remembers Johnson. But not so much for his playing.\n Wigler remembers his proselytizing. It bothered him, how Phil stood outside Wigler’s house, eager to pitch any emerging student.\n “He would try to get them to join the church,” says Wigler. “He had all sorts of propaganda. He would just talk religion.”\n After graduating from Ridley High School, Class of 1970, Johnson headed south to Florida Bible College. And that’s where something shifted.\n He dropped out of school, began freelancing for orchestras in Florida and by the time he headed north to Massachusetts in the mid-’70s — why, it’s not clear — he was no longer a believer.\n In 1976, Johnson, now 23, entered Boston University to study music. The department’s faculty featured some of the most storied players in the field, including Totenberg.\n Other teachers were members of the Boston Symphony Orchestra. Joseph Silverstein, the violinist who would become Johnson’s teacher, remembers one of the many things that set him apart.\n  “Not Phil,” said Silverstein. “He just came out of nowhere. I still don’t know where he’s from.”\n His first teacher, Roger Shermont, a longtime BSO violinist, found him too difficult to teach. Silverstein agreed to take Johnson on.\n It was a lucky stroke. As the BSO’s concertmaster, Silverstein was one of the most important orchestral players of his era. For a young student, it would be like working in the batting cage with Mickey Mantle while he still roamed center field for the Yankees.\n Silverstein died in late 2015 at age 83. But two weeks before his fatal heart attack, he was asked by The Washington Post whether he remembered Johnson.\n The kid was a fast sight reader and had a talent for jazz. He scored a prestigious fellowship to the Tanglewood Music Center, the BSO’s summer home.\n “He also had a certain native charm about him,” Silverstein said. “There was something about this wild kid. He was a natural. His playing was undisciplined, but it was attractive.”\n Then there was his other side. Johnson did not treat others with respect. Not his peers, not his superiors.\n “You would assign him a particular piece of music and he’d come up with something else,” said Silverstein. “He was a rebel, and we were really trying to harness the kid and get him to focus.”\n Silverstein remembered Johnson being dismissive of Totenberg, who taught at BU until he left for Longy in 1978.\n “But listen, Phil was dismissive of almost everybody,” he said. “He was quite an arrogant kid. A vestigial remnant of the ’60s.”\n Other students snickered as Johnson, in the BU hallways, wore gloves, ostensibly to protect his hands, even during warmer months. Backstage before a performance, Johnson would not softly run through his scales. Instead, he’d blast out excerpts of major works, performing with an intensity meant for the stage.\n “He would be bragging and mentioning his solo performances,” Quirmbach recalls. “It was always about him.”", "posttime": "2020-06-15 09:40:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小提琴,violin", "title": "“小提琴窃贼”(2016)", "title_en": "The Violin Thief (2016)", "transed": 1, "url": "http://www.washingtonpost.com/sf/style/2016/03/17/the-violin-thief/", "via": "", "real_tags": ["小提琴", "violin"]}, {"category": "", "categoryclass": "", "imagename": "d74870eedfa5e0479762b6783d9fbdb6.jpg", "infoid": 1006605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌被广泛认为是最好的搜索引擎，这是该公司在过去20年里精心建立的声誉。\n然而，当涉及到一个特定的利基市场时，谷歌的业绩正在迅速恶化。我们说的是盗版网站。\n作为背景，值得一提的是，搜索引擎一直承受着将盗版网站从其索引中完全移除的巨大压力。谷歌断然拒绝这样做。取而代之的是，它选择推低某些关键字的流行盗版网站，包括电影和音乐标题。\n根据谷歌的说法，这在很多年前就开始了，并达到了预期的效果。搜索“权力的游戏洪流”的人不会在最上面的结果中找到海盗湾。同样，也为与音乐相关的查询设置了过滤器。\n因此，盗版网站的搜索流量急剧下降。这意味着这些网站的新访问者有所下降。然而，人们仍然可以通过搜索他们的名字来找到这些盗版网站。我们在这里使用过去时，因为许多网站的情况也发生了变化。\n在过去的几个月里，人们越来越难找到一些受欢迎的盗版网站的主页。取而代之的是，谷歌将人们引导到维基百科页面或使用相同名称的完全不同的-有时是欺诈性的-网站。我们将在这里举几个例子，将我们的发现与Bing和DuckDuckGo进行对比。\n我们从1337x.to开始，这是一个流行的Torrent网站，已经有十多年的历史了。虽然搜索结果可能每天都会有所不同，而且可能会因位置不同而有所不同，但我们在几大洲的测试中，在搜索“1337x”时，未能在搜索结果的顶部显示官方域名“1337x.to”。\n1337x的官方维基百科条目在排名靠前的结果和“知识图谱”中被突出显示。然而，它位于一个非官方的“1337x”条目列表中，这些条目将访问者吸引到第三方网站。这为诈骗者和钓鱼网站提供了一个重大机会。\n当然，谷歌并没有突然忘记真正的1337x网站的细节。此外，主域名的“消失”不是DMCA通知的结果，因为它会被明确地突出显示，1337x的主页也不会直接链接到任何侵权内容。根据一些算法，官方网站可能已经受到了惩罚。\n当我们将结果与其他搜索引擎进行比较时，差别是显而易见的，必应和DuckDuckGo返回的是1337x的官方主页。这就是该查询的正确结果。\n同样的消失技巧也适用于其他流行的Torrent网站，如Torrentz2，EZTV，NYAA和Limetorrents。在谷歌搜索引擎中输入这些关键字的谷歌用户不会被定向到官方网站，但会看到使用相同名称劫持流量的独立网站。\n例如，在谷歌上搜索NYAA，在第一个结果页面上没有显示官方域名。再一次，DuckDuckGo毫不费力地找到了官方网站，Bing也返回了正确的结果，包括一个允许人们直接搜索网站的搜索框。\nTorrentFreak与最受欢迎的Torrent网站之一LimeTorrents.info的运营商进行了交谈，后者证实谷歌的行为已经影响了该网站的流量。这也适用于该网站的官方代理域。然而，搜索“Limetorrents”的人数并没有下降，所以这些人现在去了其他地方。\nLimetorrents的运营商说：“谷歌从其搜索结果中删除了几乎所有Torrent网站的主页，我们网站的流量也受到了影响。”在这种情况下，失踪也与DMCA通知无关。\n主页的消失并不局限于洪流遗址。其他盗版网站也是如此，包括流媒体门户网站。例如，在谷歌的顶级搜索结果中找不到KissAnime。同样，Bing和DuckDuckGo可以毫不费力地找到正确的URL。\n这并不意味着其他搜索引擎就没有“问题”。当我们在Bing和DuckDuckGo上搜索F电影时，我们注意到所有的官方URL都被删除了。谷歌仍然会索引FMovies.to链接(当然不会出现在搜索结果的前几位)，但在搜索“FMovies”时不会显示它们\n在某些情况下，谷歌的“决定”可能会导致完全尴尬的情况。例如，搜索FMovies和其他受欢迎的盗版品牌，现在会在顶部显示美联社(AP)的一篇报道。\n这听起来像是合法的链接，但事实并非如此。美联社发布了充斥着海盗关键词的付费新闻稿，宣传盗版流媒体门户网站Yolamovies。这可不是什么好看的样子。\n当我们看海盗湾的结果时，事情变得复杂起来。在许多地方，广受欢迎的Torrent网站没有列在搜索结果的第一页。这可能会让人相当困惑，并将人们引向恶意软件警告和模仿者，这是一个连BBC都上当的陷阱。\n然而，有趣的是，在我们的北美测试中，官方的TPB域名是最好的结果。这意味着TPB的本地化“消失”可能是当地交通模式的结果，在网站被屏蔽的国家，这种模式发生了变化。\n虽然这些观察结果很耐人寻味，但我们不知道谷歌为什么要这样做。一个可能的选择是限制某些侵权网站的曝光。然而，问题是，这是否真的改善了这种情况，因为人们现在被驱车前往第三方盗版网站，这可能并不是出于好意。\n考虑到早些时候关于删除整个域名的评论，谷歌的行动也很有趣。\n谷歌此前曾表示，“全站删除是无效的，很容易导致对合法材料的审查”，并称这将“传递错误的信息，因为它偏向于过于包容的私人审查，而不是法治.”\n根据他们目前的措施，盗版网站仍然被编入索引。然而，当人们再也无法通过键入“1337x”找到1337x的非侵权主页时，肯定涉及到某种类型的算法审查，不管是无意的还是无意的。", "note_en": "Google is widely regarded as the best search engine, a reputation the company has carefully built up over the past two decades.\n However, when it comes to one particular niche, Google’s results are rapidly deteriorating. We’re talking about pirate sites.\n As background, it’s good to mention that search engines have been under a lot of pressure to remove pirate sites from their indexes entirely. Google categorically refused to do so. Instead, it chose to push down popular pirate sites for certain keywords, including movie and music titles.\n This started many years ago and worked as intended, according to Google. Someone searching for “Game of Thrones torrent” was not going to find The Pirate Bay in the top results. Similarly, filters were set up for music-related queries as well.\n As a result, pirate sites saw their search traffic decline drastically. This meant a drop in new visitors to these sites. However, people could still find these pirate sites by searching for their name. We use the past tense here because that has changed for many sites as well.\n Over the past few months, it has become harder and harder to find the homepages of some popular pirate sites. Instead, Google points people to Wikipedia pages or entirely different – sometimes scammy – sites that use the same name. We’ll address a few examples here, contrasting our findings with Bing and DuckDuckGo.\n We start with 1337x.to, a popular torrent site that has been around for well over a decade. While search results may vary from day to day and can differ based on location, our tests across several continents failed to show the official ‘1337x.to’ domain in the top results when searching for “1337x.”\n  1337x’s official Wikipedia entry is highlighted among the top results and in the “ knowledge graph“. However, it sits among a list of unofficial ‘1337x’ entries which drives visitors to third-party sites. This provides a major opportunity for scammers and phishing sites.\n Of course, Google hasn’t suddenly forgotten the details of the real 1337x site. Also, the ‘disappearance’ of the main domain is not the result of a DMCA notice, as that would be explicitly highlighted and 1337x’s homepage doesn’t link to any infringing content directly. The official site has likely been punished based on some algorithms.\n When we compare the results to other search engines, the difference is clear, with  Bing and DuckDuckGo returning the official 1337x homepage on top. That is the correct result for this query.\n  The same disappearing trick also applies to other popular torrent sites, such as Torrentz2, EZTV, NYAA, and LimeTorrents. Google users who enter these keywords in Google’s search engine are not directed to the official sites, but will see unaffiliated sites on top that hijack traffic by using the same name.\n A search for NYAA on Google, for example, doesn’t show the official domain anywhere  on the first results pages. Again, DuckDuckGo has no trouble finding the official site and Bing returns the proper result as well, including a search box that allows people to search the site directly.\n  TorrentFreak spoke to the operator of LimeTorrents.info, one of the  most popular torrent sites, who confirmed that Google’s actions have impacted the site’s traffic. That also applies to the site’s official proxy domains too. However, the number of people searching for ‘Limetorrents’ hasn’t dropped, so these people end up elsewhere now.\n “Google removed almost all torrent site homepages from its search results and our site’s traffic is affected too,” LimeTorrents’ operator says. In this case, the disappearance is not linked to a DMCA notice either.\n  The disappearance of homepages is not limited to torrent sites. The same can be observed for other pirate sites, including streaming portals. For example, Kissanime is  nowhere to be found in Google’s top results. Again,  Bing and  DuckDuckgo have no trouble locating the correct URL.\n That doesn’t mean that other search engines are without ‘issues.’ When we searched for Fmovies on Bing and DuckDuckGo we noticed that all official URLs have been removed. Google still indexes Fmovies.to links (not in the top results of course), but doesn’t show them when searching for “Fmovies”\n In some instances, Google’s ‘decisions’ can result in outright embarrassing situations. For example, a search for Fmovies and other popular pirate brands now shows an Associated Press (AP) story on top.\n  This may sound like a legitimate link but it’s not. AP runs paid press releases  filled with pirate keywords which promote the pirate streaming portal Yolamovies. That’s not a good look.\n When we look at The Pirate Bay’s results, things get complicated. In many of the locations the popular torrent site wasn’t listed in the first pages of results. This can be quite confusing and points people to malware warnings and copycats,  a trap even the BBC fell for.\n Interestingly, however, the official TPB domain was the top result in our North American tests. This means that TPB’s localized ‘disappearance’ may be the result of local traffic patterns, which change in countries where the site is blocked.\n While these observations are intriguing, we have no idea why Google is acting this way. A likely option would be to limit the exposure of certain infringing sites. However, the question is whether it actually improves the situation, as people are now driven to third-party pirate sites, which may not have good intentions.\n Google’s actions are also interesting in light of comments that were made earlier regarding the removal of entire domains.\n “Whole-site removal is ineffective and can easily result in the censorship of lawful material,” Google  previously said, adding that it would send “the wrong message by favoring over-inclusive private censorship over the rule of law.”\n With their current measures, pirate sites remain indexed. However, when one can no longer find 1337x’s non-infringing homepage by typing in “1337x,” there’s certainly some type of algorithmic censorship involved, inadvertent or not.", "posttime": "2020-06-15 09:39:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,app,盗版,pirate", "title": "热门盗版网站在谷歌搜索结果排行榜上慢慢“消失”", "title_en": "Popular Pirate Sites Slowly “Disappear” from Google’s Top Search Results", "transed": 1, "url": "https://torrentfreak.com/popular-pirate-sites-slowly-disappear-from-googles-top-search-results-200614/", "via": "", "real_tags": ["谷歌", "google", "app", "盗版", "pirate"]}, {"category": "", "categoryclass": "", "imagename": "32cda59059ab1b99bbbe63a86c927430.png", "infoid": 1006604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软已经向澳大利亚和新西兰的用户确认了Office 365的登录问题，数千人报告了问题。\n周一早上，在线生产力套件和微软托管的Dynamics客户关系管理(CRM)的用户通过DownDetector和Twitter记录了数千个问题实例。\n周一上午，在亚太地区，我们业务中的7000多名员工无法在O365上进行任何服务身份验证。我们在医疗保健行业工作。这是不可接受的，一名用户在推特上写道。\n该公司在一份服务健康通知中证实了这些问题，并指出这些问题只影响其大洋洲地区。\n该公司称，“用户在尝试访问微软365服务时可能会收到错误信息.”\n“用户可能会[看到]以下错误消息：‘AADSTS90033：发生暂时性错误。请重试‘“。”\nOffice 365无法访问似乎是Azure Active Directory问题造成的，尽管微软的Azure仪表板显示该地区没有具体问题。\n微软最初将用户定向到其管理门户上托管的状态咨询网站，但大多数用户无法通过身份验证来查看它。", "note_en": "Microsoft has confirmed login issues with Office 365 for users in Australia and New Zealand, with thousands reporting problems.\n Users of the online productivity suite and Microsoft&#39;s hosted Dynamics customer relationship management (CRM) logged several thousand instances of issues via  DownDetector and  Twitter on Monday morning.\n  &#34;Monday morning in APAC, 7000+ employees in our Business are unable to authenticate on O365 to any services. We work in healthcare. This is not acceptable,&#34; one user  tweeted.\n The company confirmed the problems in a service health notification, noting that they only impact its Oceania region.\n “Users may receive an error when attempting to access Microsoft 365 services,” the company said.\n “Users may [see] the following error message: ‘AADSTS90033: A transient error has occurred. Please try again’.”\n Inaccessibility to Office 365 appears to be the result of problems with Azure Active Directory, though Microsoft&#39;s Azure dashboard shows no specific problems in the region.\n Microsoft initially  directed users to a status advisory hosted on its admin portal, however most users were unable to authenticate to view it.", "posttime": "2020-06-15 09:22:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,遭遇,hit", "title": "微软在新西兰遭遇Office 365登录问题", "title_en": "Microsoft hit by Office 365 login issues in A/NZ", "transed": 1, "url": "https://www.itnews.com.au/news/microsoft-hit-by-office-365-login-issues-in-a-nz-549256", "via": "", "real_tags": ["微软", "microsoft", "遭遇", "hit"]}]