[{"category": "", "categoryclass": "", "imagename": "aaec763affdce3ca783ad84a4dc12f99.jpg", "infoid": 1033956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天发表在《脊椎动物古生物学杂志》上的一项新研究描述了一个化石家族，该家族阐明了脊椎动物的起源--包括马、犀牛和绒毛在内的哺乳动物群体。它为这些有蹄动物在哪里进化这一有争议的问题提供了洞察力，得出结论认为它们起源于今天的印度或接近今天的印度。通过350多个新化石，这项历时15年的研究拼凑出了一幅近乎完整的驼背龙(Cambaytherium)骨骼解剖图景。Cambaytherium是一种已灭绝的近亲，大约5500万年前生活在印度次大陆上。\n这些发现包括一种绵羊大小的动物，它的奔跑能力中等，特征介于特化的指骨周围动物和它们更普遍的哺乳动物祖先之间。将它的骨骼与其他许多现存和灭绝的哺乳动物进行比较后发现，弯曲龙代表着一个比已知的任何已知的周龙都更原始的进化阶段，支持该物种起源于印度或印度附近-当与亚洲的陆地连接形成后，它们才散布到其他大陆。\n这篇具有里程碑意义的新文章被选为享有盛誉的古脊椎动物协会回忆录系列的一部分出版，这是一份特别的年度出版物，提供了对最重要的脊椎动物化石的更深入的分析。\nCambaytherium于2005年首次被描述，是已灭绝的物种中最原始的成员，该物种在周脚龙进化之前分枝而出，为科学家提供了关于该物种的古老起源和进化的独特线索。\n约翰·霍普金斯大学名誉教授、该研究的第一作者肯·罗斯解释道：现代偶蹄目(偶趾有蹄类)、周足目和灵长类动物在5600万年前北半球始新世初突然出现，但它们的地理来源一直是个谜。\n罗斯教授对一种新的假说很感兴趣，这一假说表明，外脚趾可能是在印度与世隔绝地进化的。当时印度是一个向北漂流的岛屿大陆，但后来它与亚洲大陆相撞，形成了一个连续的大陆。\n1990年，克劳斯和马斯提出，这些目可能是在印度从马达加斯加向北迁移的过程中演化出来的，当印度与亚洲相撞时，这些目分散到了北部大陆。\n有了这一新假说，罗斯和他的同事们从国家地理学会(National Geological Society)获得了资金，以探索印度稀有的、年龄正确的化石岩石，这些岩石可能会为周脚龙和其他哺乳动物群体的起源提供关键证据。\n2001年第一次去拉贾斯坦邦的旅行收效甚微，虽然我们在那次旅行中只发现了几根鱼骨，但第二年，我们的印度同事拉金德拉·拉纳(Rajendra Rana)继续在南部勘探褐煤矿藏，并在古吉拉特邦发现了瓦斯坦矿场。\n事实证明，这个新矿的前景要好得多。罗斯补充道：2004年，我们的团队得以重返矿场，我们的比利时合作者蒂埃里·史密斯(Thierry Smith)在那里发现了第一批哺乳动物化石，包括坎贝氏菌(Cambaytherium)。\n在受到鼓舞的情况下，尽管条件艰苦，这个团队还是回到了矿场，收集了Cambaytherium和许多其他脊椎动物的骨骼化石。\n他说，褐煤矿山的高温、持续的噪音和煤尘非常恶劣--基本上是试图在露天褐煤矿山底部附近数百英尺深的地方工作，这些矿山每天24小时都在活跃地开采。\n通过多年具有挑战性的实地考察的积累，这个团队终于揭开了一个谜团。尽管北半球有大量的周脚类动物，但Cambaytherium认为，在古新世(66-5600万年前)，这个群体很可能是在印度境内或附近孤立进化的，然后在与亚洲的陆地连接形成后分散到其他大陆。更多信息：Kenneth D.Rose等，Cambaytherium的解剖学、亲缘关系和古生物学(哺乳动物纲，近足目，炭疽亚纲)，《脊椎动物古生物学杂志》(2020)。电话：10.1080/02724634.2020.1761370", "note_en": "New research published today in the  Journal of Vertebrate Paleontology describes a fossil family that illuminates the origin of perissodactyls—the group of mammals that includes horses, rhinos and tapirs. It provides insights on the controversial question of where these hoofed animals evolved, concluding that they arose in or near present day India.    With more than 350 new fossils, the 15-year study pieces together a nearly complete picture of the skeletal anatomy of the Cambaytherium—an extinct cousin of perissodactyls that lived on the Indian subcontinent almost 55 million years ago.\n  The findings include a sheep-sized animal with moderate running ability and features that were intermediate between specialized perissodactyls and their more generalized mammal forerunners. Comparing its bones with many other living and extinct mammals revealed that Cambaytherium represents an evolutionary stage more primitive than any known perissodactyl, supporting origin for the group in or near India—before they dispersed to other continents when the land connection with Asia formed.\n  This new landmark article was selected for publication as a part of the prestigious Society of Vertebrate Paleontology Memoir Series, a special yearly publication that provides a more in-depth analysis of the most significant vertebrate fossils.\n  Cambaytherium, first described in 2005, is the most primitive member of an extinct group that branched off just before the evolution of perissodactyls, providing scientists with unique clues to the ancient origins and evolution of the group.\n   &#34;The modern orders artiodactyla (even-toed ungulates), perissodactyla, and primates appeared abruptly at the beginning of the Eocene around 56 million years ago across the Northern Hemisphere, but their geographic source has remained a mystery,&#34; explained Ken Rose, emeritus professor at Johns Hopkins University and lead author of the study.\n  Prof. Rose became intrigued by a new hypothesis suggesting that perissodactyls may have evolved in isolation in India. Then India was an island continent drifting northwards, but it later collided with the continent of Asia to form a continuous landmass.\n  &#34;In 1990, Krause and Maas proposed that these orders might have evolved in India, during its northward drift from Madagascar, dispersing across the northern continents when India collided with Asia.&#34;\n  Armed with this new hypothesis, Rose and colleagues obtained funding from the National Geographic Society to explore India for rare fossil-bearing rocks of the correct age that might provide critical evidence for the origin of perissodactyls and other groups of mammals.\n    The first trip to Rajasthan in 2001 had little success, &#34;Although we found only a few fish bones on that trip, the following year our Indian colleague, Rajendra Rana, continued exploring lignite mines to the south and came upon Vastan Mine in Gujarat.&#34;\n   This new mine proved much more promising. Rose added: &#34;In 2004 our team was able to return to the mine, where our Belgian collaborator Thierry Smith found the first mammal fossils, including Cambaytherium.&#34;\n  Encouraged, the team returned to the mines and collected fossilized bones of Cambaytherium and many other vertebrates, despite challenging conditions.\n  &#34;The heat, the constant noise and coal dust in the lignite mines were tough—basically trying to work hundreds of feet down near the bottom of open-pit lignite mines that are being actively mined 24/7,&#34; he said.\n  Through the cumulation of many years of challenging fieldwork, the team can finally shed light on a   mystery. Despite the abundance of perissodactyls in the Northern Hemisphere, Cambaytherium suggests that the group likely evolved in isolation in or near India during the Paleocene (66-56 million years ago), before dispersing to other continents when the land connection with Asia formed.        More information:\t\t\t\t\t\t\t\t\t\t\t\tKenneth D. Rose et al, Anatomy, Relationships, and Paleobiology of Cambaytherium (Mammalia, Perissodactylamorpha, Anthracobunia) from the lower Eocene of western India,  Journal of Vertebrate Paleontology (2020).  DOI: 10.1080/02724634.2020.1761370", "posttime": "2020-11-09 08:58:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "化石,fossils,印度", "title": "印度化石支持有蹄哺乳动物起源的新假说", "title_en": "Indian fossils support new hypothesis for origin of hoofed mammals", "transed": 1, "url": "https://phys.org/news/2020-11-indian-fossils-hypothesis-hoofed-mammals.html", "via": "", "real_tags": ["化石", "fossils", "印度"]}, {"category": "", "categoryclass": "", "imagename": "367ac685dc4860fe22904640413e025b.jpg", "infoid": 1033955, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这花了很长时间，但现在大多数网络都使用HTTPS来安全地传输信息，这在一定程度上要归功于谷歌的推动。然而，这确实意味着，如果你的设备上没有安装适当的证书，许多网站可能会遇到问题(或者无法完全加载)，这正是明年老款Android设备将会发生的情况。\nLET的Encrypt是世界领先的证书颁发机构之一，大约30%的Web域使用该集团的证书。该组织最初成立时，曾申请在所有浏览器和操作系统上安装自己的ISRG Root根证书。到目前为止，所有的证书都是与IdenTrust的DST Root根交叉签名的，该根多年来一直在Windows、MacOS、Android和大多数其他软件平台上运行。\n让Encrypt与IdenTrust最初的合作伙伴关系于2021年9月1日到期，该集团不打算签订另一份交叉签署协议。这意味着，所有没有使用Leat的加密根证书的浏览器和操作系统都将无法再与使用该组证书的站点和服务一起工作。公告指出，运行安卓7.1或更低版本的设备也在受影响的人群中：\n然而，这确实带来了一些兼容性问题。一些自2016年以来就没有更新的软件(大概是在我们的根被许多根程序接受的时候)仍然不信任我们的根证书，ISRG Root X1。最值得注意的是，这包括7.1.1之前的Android版本。这意味着那些较老版本的Android将不再信任由We‘s Encrypt颁发的证书。\n尽管该协议要到明年9月才结束，但默认情况下，从2021年1月11日开始，let‘s Encrypt将停止交叉签名。站点和服务继续生成交叉签名证书的选项仍然存在，但只会持续到9月份。\n传统Android设备的唯一解决办法是安装Firefox浏览器，该浏览器使用自己的证书存储库，其中包括ISRG根目录。然而，这并不能阻止浏览器外部的应用程序和其他功能崩溃。", "note_en": "It took a long time, but most of the web now uses HTTPS to securely transmit information,  partially thanks to a push by Google. However, this does mean that many websites could encounter issues (or fail to load entirely) if the proper certificates aren&#39;t installed on your device, which is exactly what will happen to older Android devices next year.\n Let&#39;s Encrypt is one of the world&#39;s leading certificate authorities, and the group&#39;s certificates are used by  approximately 30% of all web domains. When the group was first founded, it applied for its own &#39;ISRG Root X1&#39; root certificate to be included in all browsers and operating systems. All certificates to date have also been cross-signed with IdenTrust&#39;s &#39;DST Root X3&#39; root, which has been in Windows, macOS, Android, and most other software platforms for years.\n Let&#39;s Encrypt&#39;s original partnership with IdenTrust expires on September 1st, 2021, and the group doesn&#39;t plan on entering another cross-signing agreement. This means that all browsers and operating systems without Let&#39;s Encrypt&#39;s root certificate will no longer work with sites and services using the group&#39;s certificates. The announcement pointed out that devices running Android 7.1 or lower is among the affected group:\n However, this does introduce some compatibility woes. Some software that hasn’t been updated since 2016 (approximately when our root was accepted to many root programs) still doesn’t trust our root certificate, ISRG Root X1. Most notably, this includes versions of Android prior to 7.1.1. That means those older versions of Android will no longer trust certificates issued by Let’s Encrypt.\n Even though the agreement doesn&#39;t end until September of next year, Let&#39;s Encrypt will stop cross-signing by default  starting on January 11, 2021. The option will still exist for sites and services to continue generating cross-signed certificates, but only until September.\n  The only workaround for legacy Android devices is to install the  Firefox browser, which uses its own certificate store that includes the ISRG root. However, this doesn&#39;t prevent applications and other functions outside the browser from breaking.", "posttime": "2020-11-09 08:57:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,stop,证书", "title": "许多网站将在2021年停止使用较旧的Android版本", "title_en": "Many websites will stop working on older Android versions in 2021", "transed": 1, "url": "https://www.androidpolice.com/2020/11/07/many-websites-will-stop-working-on-older-android-versions-in-2021/", "via": "", "real_tags": ["android", "stop", "证书"]}, {"category": "", "categoryclass": "", "imagename": "a91f1515910f1511eae48e1c57bc3ba3.jpg", "infoid": 1033954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "#APPLE#IPHONE 12#MAGSAFE我是从苹果公司拿到的，链接是：https://www.instagram.com/p/CHQeh55BA8k/?igshid=1pfz7f9t284u9，非常感谢，非常感谢。", "note_en": "#Apple #iPhone12 #Magsafe I got it from AppleDsign at this link: https://www.instagram.com/p/CHQeh55BA8k/?igshid=1pfz7f9t284u9 Thank you so much and apprecia...", "posttime": "2020-11-09 08:36:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,非常感谢", "title": "YouTube", "title_en": "YouTube", "transed": 1, "url": "https://www.youtube.com/watch?v=mMokSOYzJUw", "via": "", "real_tags": ["youtube", "非常感谢"]}, {"category": "", "categoryclass": "", "imagename": "255da1df46e6e69abf5e77970d640595.png", "infoid": 1033953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想试试Increment！费用是多少？如何创建帐户？答：在这里请求邀请。服务费用为0美元，我们正在进行封闭测试(仅限邀请)。对于那些每天都在使用增量的用户，我们在这里向您学习。您的反馈是服务费！\n为什么要递增。我？为什么SurveyMonkey或无数其他公司不做这方面的工作呢？Increment的匿名反馈应用非常简单，价格低廉，而且功能完全符合你的要求。如果您喜欢手动构建调查和处理结果，那么可以选择其中之一。如果你想跳过手工工作，专注于结果，我们希望你能试一试增量。\n什么是递增的。我？答案：这是一种极其简单的方式，可以将匿名反馈融入到每件事中。Increment总部设在得克萨斯州奥斯汀，是基于这样一种信念而创建的，即增长心态有利于个人和社区-我们努力通过创造帮助您做到最好的工具来帮助个人和社区茁壮成长。\n我的唯一代码是什么，它在我的电子邮件中是什么样子？回答：干净利落&简单！您的增量按钮以及在签名下方或个人资料中附带的任何文本-这里就是一个例子。克里斯汀，谢谢你前几天的研讨会。学到了很多。附件是我们谈到的预测。最好的，查理。\n增量对我的数据有什么作用？答：你就是使命。你的数据是你的，这就是为什么我们最终会为这项服务收费。同时，您的反馈就是费用！而且你的数据是安全的。你在网站上做的每件事都是在传输过程中使用SSL加密的，本网站不涉及任何网络分析或第三方Cookie。这是关于在我们能做到的每一个方面都变得更好--一步一步地递增。", "note_en": "I want to try Increment! What&#39;s the cost? How can I create an account? Answer:  Request an invite here. The service cost is $0, we&#39;re in a closed beta (invite-only). For those using increment every day, we&#39;re here for you to learn from you. Your feedback is the fee for the service!\n  Why increment.me? Why not surveymonkey or a zillion other companies doing this stuff? Increment&#39;s anonymous feedback app is dead simple, inexpensive, and works exactly like you&#39;d want. If you like building surveys and processing results by hand - go for one of those. If you want to skip the manual work and focus on outcomes, we hope you&#39;ll give increment a try.\n  What&#39;s increment.me? Answer: An insanely simple way to build anonymous feedback into everything. Based out of Austin, Texas, Increment was created out of the belief that a growth mindset benefits the individual and the community - and we strive to help both individuals and communities thrive by creating tools that help you be your best.\n    What&#39;s my &#34;unique code&#34;, what does it look like in my email? Answer: clean &amp; simple! Your increment button and whatever text you accompany it with below your signature or in your profile - here&#39;s an example.  Kristen,  Thanks for the workshop the other day. Learned a lot.  Attached is the forecast we talked about.  Best,  Charlie\n  What&#39;s increment&#39;s doing with my data? Answer: you are the mission. Your data is yours, which is why we&#39;ll charge for the service eventually. In the meantime, your feedback is the fee! And your data is secure. Everything you do on the site is encrypted in transit with SSL and no web analytics or 3rd party cookies are involved in this site. This is about being better in every way we can - increment by increment.", "posttime": "2020-11-09 08:32:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "匿名,anonymous,反馈", "title": "Increment.me：轻松获得任何匿名反馈", "title_en": "Increment.me: easily get anonymous feedback on anything", "transed": 1, "url": "https://increment.me", "via": "", "real_tags": ["匿名", "anonymous", "反馈"]}, {"category": "", "categoryclass": "", "imagename": "acd581e3c750cef758941612d07542c6.jpg", "infoid": 1033951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十年前，一群天文学家开始研究一个最古老的问题，这个问题一直在嘲弄哲学家、科学家、牧师、天文学家、神秘主义者和人类其他人：如果有的话，还有多少地球？据我们所知，地球上有多少遥远的行星可以孕育生命？\n他们的工具是开普勒宇宙飞船，它于2009年3月发射升空，任务是在银河系的一片天空中监测15万颗恒星，为期3年半。它寻找由一颗系外行星从其母星前面经过而引起的星光中的细微变化。\n“这不是外星人，但它是外星人的家，”威廉·博鲁斯基在2009年3月任务开始时说。现已从NASA艾姆斯研究中心退休的天文学家Borucki想出了这个项目，并花了20年时间说服NASA去做。\n在2018年宇宙飞船最终发射之前，它已经在这些恒星中发现了4000多个候选世界。到目前为止，还没有人表现出任何生命或居住的迹象。(当然，它们离得很远，很难研究。)。由此推断，银河系中有数十亿颗系外行星。但其中有多少可能是可居住的呢？\n在研究了开普勒的数据两年后，由NASA Ames的史蒂夫·布莱森(Steve Bryson)率领的44名天文学家组成的团队找到了他们所说的最终答案，至少目前是这样。他们的论文已被接受在《天文学杂志》上发表。\n开普勒的正式目标是测量一个名为ETA-Earth的数字：地球大小的恒星在“金发星座”或宜居带内有地球大小的物体围绕着它们运行的恒星的比例，在“金发星座”或宜居地带，那里的表面足够温暖，可以保留液态水。\n该团队计算出，在质量和亮度与太阳相似的恒星中，至少有三分之一(或许多达90%)在其宜居带有类似地球的岩石，这一范围反映了研究人员对他们各种方法和假设的信心。无论你怎么看，这都不是一个小财源。\n据NASA估计，银河系中至少有1000亿颗恒星，其中约40亿颗是类太阳恒星。如果只有7%的恒星拥有宜居行星--这是一个极其保守的估计--那么仅整个银河系就可能有多达3亿个潜在宜居地球。\n该报告的作者之一、位于马里兰州格林贝尔特的NASA戈达德太空飞行中心的研究员拉维·库马尔·科帕拉普(Ravi Kumar Kopparapu)说，“我们希望非常保守，以防大自然在宜居方面有任何意外。”“因此，我们故意低估了估计。”\n天文学家计算出，平均而言，最近的这类行星应该距离我们约20光年，在距太阳30光年左右的范围内应该有4颗行星。\n加州大学圣克鲁斯分校(University of California，Santa Cruz)天文学家娜塔莉·巴塔哈(Natalie Batalha)在一封得意洋洋的电子邮件中说，“它从发布到发表花了11年时间，但现在就是它了。”在开普勒任务的大部分时间里，她都是开普勒任务的负责人，也是这篇新论文的作者之一。“这是我们期待已久的科学结果--这就是开普勒在2001年12月被选中飞行的原因。”\n新的结果意味着，银河系的肥沃程度至少是2013年开普勒数据分析中估计的两倍。不是开普勒团队成员的安德鲁·霍华德(Andrew Howard)、埃里克·佩蒂古拉(Erik Petigura)和杰弗里·马西(Geoffrey Marcy)的这一发现得出的结论是，大约五分之一的类日恒星在其宜居带内藏有行星。\n巴塔哈说，这一次的一个改进是增加了来自欧洲盖亚卫星的数据，该卫星测量了10亿颗恒星的位置和亮度。这一知识使开普勒科学家能够更精确地绘制出恒星的宜居区。\n另一个改进是更好地处理统计数据，尽管如巴塔哈所说，“调查本身并不完整。”你不可能给每一个公民打电话；你不可能观察到每一颗星星。“。\n在开普勒的例子中，这种限制是严重的。开普勒探测器的定位系统在完成其主要探测任务之前就失效了，该探测任务仅限于探测轨道周期小于700天的行星--大约是地球一年周期的两倍。\n哈佛-史密森天体物理中心(Harvard-Smithsonian Center for AstroPhysical)的大卫·夏博诺(David Charbonneau)在一封电子邮件中表示，他对结果略有怀疑：“开普勒任务没有探测到很多(可以说是任何)真正的地球相似之物，即与地球半径相同、轨道处于同一时期的行星，因此接收到相同数量的光，并围绕类太阳恒星运行。”\n正如巴塔哈当时所说，“我们还没有找到在大小、轨道或恒星类型上与地球完全相似的候选行星。”我们现在仍然不知道。因此，天文学家们不得不从他们所看到的行星中推断出数据。\n尽管这些开普勒行星的大小和地球差不多--半径是地球半径的一半到1.5倍--而且可能是岩石，但没有人知道它们的细节是什么，也没有人知道它们上面是否有生命或可能有生命存在。他们离得太远，无法进一步研究。到目前为止，我们所知道的只有一颗行星，那就是我们自己的星球，拥有生命。\n但仍有很多机会尚未找到。开普勒对ETA-地球的测量只适用于太阳这样的恒星，但在银河系中，这些恒星的数量远远多于被称为红矮星的较小、较暗的恒星。根据现供职于加州大学伯克利分校(University of California，Berkeley)的考特尼·德雷泽(Courtney Dressing)的研究，四分之一到一半的红矮星还居住着宜居区域的行星，尽管一些天文学家担心，来自这些恒星的辐射耀斑会毁掉任何试图在那里开始的生命。红矮星没有包括在对ETA-地球的新分析中。\n这些红矮星与寻找生命有关，因为开普勒已经将火炬传递给了一颗名为凌日系外行星调查卫星(TESS)的航天器，该卫星于2018年发射，目的是在距离地球几百光年的地方搜寻整个天空中的系外行星。到目前为止，苔丝已经发现了66颗新的系外行星，并为2000多个候选行星编目。\n麻省理工学院(Massachusetts Institute Of Technology)天体物理学家、此次任务的首席研究员乔治·里克尔(George Ricker)在一封电子邮件中说，预计这些行星中的大多数都围绕着红矮星运行。“由于太阳附近大约四分之三的恒星都是M矮星，这就为苔丝在未来十年里留下了一个非常大的发现空间！”\n巴塔哈说，未来的年轻科学家可能还会找到一种方法来提高ETA-Earth的价值；“在那之前，这将是事实上的标准。”\n在被称为德雷克方程的数学表达式中，ETA-Earth的值是一个重要且迄今未知的因素。天文学家用它来估计银河系中可能存在多少科技文明--我们或许可以在宇宙中的某一天通过无线电或其他方式进行联系。\n是时候开始研究外星文明德雷克方程式中的下一个因素了：这些星球中生命出现的那部分。在某些外星岩石上寻找哪怕只是一种黏菌，都会给生物学带来革命性的变化，这是未来半个世纪的一项有价值的议程，因为人类将继续走出自我，进入宇宙，无休止地追求结束我们在宇宙中的孤独。", "note_en": "A decade ago, a band of astronomers set out to investigate one of the oldest questions taunting philosophers, scientists, priests, astronomers, mystics and the rest of the human race: How many more Earths are out there, if any? How many far-flung planets exist that could harbor life as we know it?\n  Their tool was the Kepler spacecraft, which was launched in March 2009 on a 3-1/2-year mission to monitor 150,000 stars in a patch of sky in the Milky Way. It looked for tiny dips in starlight caused by an exoplanet passing in front of its home star.\n    “It’s not E.T., but it’s E.T.&#39;s home,” said William Borucki when the mission was launched in March 2009. It was Borucki, an astronomer now retired from NASA’s Ames Research Center, who dreamed up the project and spent two decades convincing NASA to do it.\n  Before the spacecraft finally gave out in 2018, it had discovered more than 4,000 candidate worlds among those stars. So far, none have shown any sign of life or habitation. (Granted, they are very far away and hard to study.) Extrapolated, that figure suggests that there are billions of exoplanets in the Milky Way galaxy. But how many of those are potentially habitable?\n      After crunching Kepler’s data for two years, a team of 44 astronomers led by Steve Bryson of NASA Ames has landed on what they say is the definitive answer, at least for now. Their paper has been accepted for publication in the Astronomical Journal.\n  Kepler’s formal goal was to measure a number called eta-Earth: the fraction of sunlike stars that have an Earth-size object orbiting them in the “goldilocks” or habitable zone, where it is warm enough for the surface to retain liquid water.\n      The team calculated that at least one-third, and perhaps as many as 90%, of stars similar in mass and brightness to our sun have rocks like Earth in their habitable zones, with the range reflecting the researchers&#39; confidence in their various methods and assumptions. That is no small bonanza, however you look at it.\n  According to NASA estimates there are at least 100 billion stars in the Milky Way, of which about 4 billion are sunlike. If only 7% of those stars have habitable planets — a seriously conservative estimate — there could be as many as 300 million potentially habitable Earths out there in the whole Milky Way alone.\n    “We want to be very conservative in case nature has any surprises regarding habitability,” said Ravi Kumar Kopparapu, a researcher at NASA’s Goddard Space Flight Center in Greenbelt, Maryland, and one of the authors of the report. “So we are lowballing the estimates intentionally.”\n  On average, the astronomers calculated, the nearest such planet should be about 20 light-years away, and there should be four of them within 30 light-years or so of the sun.\n  “It took 11 years from launch to publication, but this is it,” said Natalie Batalha, an astronomer at the University of California, Santa Cruz, who directed the Kepler mission during most of its life and was one of the authors of the new paper, in a triumphant email. “This is the science result we’ve all been waiting for — the reason that Kepler was selected for flight in December 2001.”\n  The new result means that the galaxy is at least twice as fertile as estimated in one of the first analyses of Kepler data, in 2013. That finding, by Andrew Howard, Erik Petigura and Geoffrey Marcy, who were not part of the Kepler team, concluded that about one-fifth of sunlike stars harbored planets in their habitable zones.\n    Batalha said that one improvement this time around was the addition of data from the European GAIA satellite, which has measured the position and brightness of 1 billion stars. That knowledge allowed the Kepler scientists to more precisely chart the habitable zones of their stars.\n  Another improvement was better handling of the statistics, although, as Batalha noted, “surveys are inherently incomplete. You can’t call up every citizen; you can’t observe every star.”\n  In the case of Kepler, that limitation was serious. The spacecraft’s orientation system failed before Kepler could complete its prime survey, which limited it to detecting planets that had orbital periods of less than about 700 days — about twice the duration of an Earth year.\n  In an email, David Charbonneau, of the Harvard-Smithsonian Center for Astrophysics, said he was slightly skeptical of the results: “The Kepler Mission didn’t detect many (arguably, any) true Earth analogues, i.e. planets with the same radius as Earth AND orbiting at the same period, and hence receiving the same amount of light, AND orbiting sun-like stars.”\n    As Batalha said at the time, “We don’t yet have any planet candidates that are exact analogues of the Earth in terms of size, orbit or star type.” We still don’t. As a result, the astronomers had to extrapolate data from the planets they did see.\n  Although these Kepler planets are Earth-size — one-half to 1 1/2 the radius of Earth — and are presumably rocky, nobody knows what they are like in any detail, nor whether anything does, or could, live on them. They are too far away for further study. So far we know of only one planet, our own, that harbors life.\n  But there are plenty of opportunities yet to find one. The Kepler measurement of eta-Earth only pertains to stars like the sun, but in the galaxy those stars are vastly outnumbered by smaller, dimmer stars known as red dwarfs. One-quarter to one-half of red dwarfs also harbor habitable-zone planets, according to work by Courtney Dressing, now at the University of California, Berkeley, although some astronomers worry that radiation flares from such stars would doom any life trying to get started there. Red dwarf planets were not included in the new analysis of eta-Earth.\n  The red dwarf planets are relevant to the search for life because Kepler has passed the torch to a spacecraft called the Transiting Exoplanet Survey Satellite, or TESS, which was launched in 2018 to scour the entire sky for exoplanets within a few hundred light years of Earth — the local neighborhood. So far TESS has discovered 66 new exoplanets and has cataloged more than 2,000 candidates.\n  Most of those planets were expected to be found circling red dwarfs, said George Ricker, an astrophysicist at the Massachusetts Institute of Technology and principal investigator for the mission, in an email: “Since about three-fourths of the stars in the solar neighborhood are M dwarfs, that leaves open a very large discovery space for TESS in the decade ahead!”\n  Batalha said that young scientists in the future might yet find a way to improve the value of eta-Earth; “until then, this will be the de facto standard.”\n  The value of eta-Earth is an important and hitherto unknown factor in a mathematical expression known as the Drake equation. It is used by astronomers to estimate how many technological civilizations might exist in the galaxy — and that we might be able to contact by radio or other means some cosmic day.\n  It’s time to move on the next factor in the Drake equation for extraterrestrial civilizations: the fraction of these worlds on which life emerges. The search for even a single slime mold on some alien rock would revolutionize biology, and it is a worthy agenda for the next half-century as humans continue the climb out of ourselves and into the universe in the endless quest to end our cosmic loneliness.", "posttime": "2020-11-09 08:10:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "寻找,earth,开普勒", "title": "在寻找另一个地球吗？这里有3亿美元，也许吧", "title_en": "Looking For Another Earth? Here Are 300 Million, Maybe", "transed": 1, "url": "https://www.baltimoresun.com/featured/sns-nyt-astronomy-exoplanets-kepler-20201107-6ykfeoyu4vainlqjkaoctmzmay-story.html", "via": "", "real_tags": ["寻找", "earth", "开普勒"]}, {"category": "", "categoryclass": "", "imagename": "9f84775adaed5b4460a906a0616f4ce6.jpg", "infoid": 1033949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如何忠实地代表广义相对论？橡皮板的图像准确吗？时间的弯曲是什么？所有这些答案都在11分钟内！Fo..。", "note_en": "How to faithfully represent general relativity ? Is the image of the rubber sheet accurate ? What is the curvature of time ? All these answers in 11 minutes !Fo...", "posttime": "2020-11-09 08:05:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,广义,general", "title": "可视化广义相对论的新方法[视频]", "title_en": "A new way to visualize General Relativity [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=wrwgIjBUYVc", "via": "", "real_tags": ["可视化", "广义", "general"]}, {"category": "", "categoryclass": "", "imagename": "1a2a6e6cee6739506e0c8d6c85e8616a.jpeg", "infoid": 1033948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8008是英特尔于1972年推出的第一款8位微处理器。虽然以今天的标准来看，8008还很原始，但它在历史上具有重要意义，因为它基本上开启了微处理器革命，是现代x86处理器家族的鼻祖。我一直在显微镜下研究8008的硅晶片，并对其电路进行反向工程。", "note_en": "The 8008 was Intel&#39;s first 8-bit microprocessor, introduced in 1972.While primitive by today&#39;s standards, the8008 is historically important because it essentially started the  microprocessor revolution and is the ancestor of the modern x86 processor family.I&#39;ve been studying the 8008&#39;s silicon die under the microscope and reverse-engineering its circuitry.", "posttime": "2020-11-09 07:41:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "逆向工程,逆向,engineering,微处理器", "title": "对Intel 8008处理器中的超前进位电路进行逆向工程", "title_en": "Reverse-engineering the carry-lookahead circuit in the Intel 8008 processor", "transed": 1, "url": "http://www.righto.com/2020/11/reverse-engineering-carry-lookahead.html", "via": "", "real_tags": ["逆向工程", "逆向", "微处理器"]}, {"category": "", "categoryclass": "", "imagename": "c5407a537cc47a61eba6e87d2930eb02.png", "infoid": 1033947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我写给前KWite维护人员的邮件可以追溯到“清华，2000年12月14日18：38：42+0100”，我想我是在更早的时候开始对MDI KWite变体进行黑客攻击的。\n但为了有一个正式的日期，假设凯特出生于2000年12月14日，再过一个多月，凯特就正式年满20岁了。\n我们从下面这样的内容开始(屏幕截图更新鲜一些，它来自2001年的KDE 2.2.x)：\n我认为我们已经拥有了今天仍然存在的基本功能：文档的一些可拆分的主区域，以及文档列表或终端之类的工具视图。我们在设计上没有选项卡式的文档切换。\n那就是说，我们花了20年时间把颜色主题改成深色，再加上一些标签；=)不错，不是吗？\n撇开趣味不谈，截图显示：在过去的20年里，许多基本的东西都没有改变。\n但这并不意味着根本的东西没有发生很大变化。\n原版凯特/KWRITE/KTextEditor/…。到目前为止，它没有我们今天拥有的语法突出显示或任何类型的自动缩进，也没有那么多巧妙的编辑操作，你只能梦想着体面的代码完成。\n我们再次获得了更多的吸引力，随着我们转向GitLab实例，我们在过去的几个月里收到了很多合并的贡献。\n我认为这很好，我希望这种情况能继续下去(甚至加速)。\n我认为，对于所有现在和过去为我们的作品做出贡献的人来说，这是一个很好的成就。\n不幸的是，帮助启动这个项目的人并不多，但这就是生活，优先事项的转移，工作的改变，…。\n不是每个人都能独来独往，有时间维持一件事二十年。\n即使是这份不完整的自动生成的名单，也包含了500多人在过去20年里贡献了自己的东西。\n感谢你帮助提升了凯特，让她活了二十年。\n我希望凯特在不久的将来和将来都会继续健康。\n让我们为用户提供一些可行的文本编辑器替代方案，无论是在某些linux/bsd/…上。系统或Windows。", "note_en": "My mail to the former KWrite maintainer dates back to “Thu, 14 Dec 2000 18:38:42 +0100”, thought I think I started earlier with actually hacking on that MDI KWrite variant.\n But just to have some official date, let’s say Kate was born at 14th December 2000, in a bit over one month Kate will turn officially twenty ;=)\n  We started off with something like below (the screenshot is a bit fresher, it’s from 2001, KDE 2.2.x):\n  I think we already had the basics that we still have around today: some split-able main area for the documents and tool-views for stuff like a document list or terminal.We had no tabbed document switching, by design.\n    That means we spend 20 years just to change the color theme to something dark and add some tabs ;=)Not bad, isn’t it?\n Fun aside, the screenshots show: a lot of the basics did stay the same over the 20 years.\n But that doesn’t mean that not a lot of the underlying stuff changed drastically.\n  The original Kate/KWrite/KTextEditor/… had by far not the syntax highlighting we have today or any kind of working auto indentation, it had not that many nifty editing actions, you could only dream from  decent code completion.\n     We gained more traction again and with the switch to our GitLab instance we got a lot of contributions merged in the past months.\n    I think this is nice and I hope this continues that way (or even speeds up).\n  I think that is a nice achievement by all people that contribute now and in the past to our stuff.\n Unfortunately not a lot people that helped to start this have stayed with the project, but that is life, priorities shift, jobs change, …\n ;=) Not everybody can be a loner that has time to maintain something for two decades.\n   Even  this incomplete auto-generated list contains more than 500 people that contributed stuff in the past 20 years.\n Thanks that you helped to enhance Kate and keep it alive and kicking for two decades.\n And I hope Kate will continue to be well for the near and far future ;=)\n Let’s provide some viable text editor alternative for users out there, be it on some Linux/BSD/… system or Windows.", "posttime": "2020-11-09 07:41:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kate", "title": "凯特马上就要20岁了", "title_en": "Kate is soon 20 years old", "transed": 1, "url": "https://kate-editor.org/post/2020/2020-11-08-kate-is-soon-20-years-old/", "via": "", "real_tags": ["kate"]}, {"category": "", "categoryclass": "", "imagename": "1a2a6e6cee6739506e0c8d6c85e8616a.jpeg", "infoid": 1033946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8008是英特尔于1972年推出的第一款8位微处理器。虽然以今天的标准来看，8008还很原始，但它在历史上具有重要意义，因为它基本上开启了微处理器革命，是现代x86处理器家族的鼻祖。我一直在显微镜下研究8008的硅晶片，并对其电路进行反向工程。", "note_en": "The 8008 was Intel&#39;s first 8-bit microprocessor, introduced in 1972.While primitive by today&#39;s standards, the8008 is historically important because it essentially started the  microprocessor revolution and is the ancestor of the modern x86 processor family.I&#39;ve been studying the 8008&#39;s silicon die under the microscope and reverse-engineering its circuitry.", "posttime": "2020-11-09 07:41:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "逆向工程,逆向,engineering,微处理器", "title": "对Intel 8008处理器中的超前进位电路进行逆向工程", "title_en": "Reverse-engineering the carry-lookahead circuit in the Intel 8008 processor", "transed": 1, "url": "http://www.righto.com/2020/11/reverse-engineering-carry-lookahead.html?m=1", "via": "", "real_tags": ["逆向工程", "逆向", "微处理器"]}, {"category": "", "categoryclass": "", "imagename": "1b884f926ae2872c30903bc6f19d2e96.jpg", "infoid": 1033945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在与他年幼的女儿在露营车里生活了两年后，建筑师简·科尔贝斯想要一些更适合他们积极生活方式的东西，所以他决定...", "note_en": "After two years of living in a camper with his young daughter, architect Jan Körbes wanted something better suited to their active lifestyle, so he decided t...", "posttime": "2020-11-09 07:41:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "房子,home,女儿", "title": "旧筒仓里的小房子[视频]", "title_en": "Tiny home out of an old Silo [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=1v5DbCbl08M", "via": "", "real_tags": ["房子", "home", "女儿"]}, {"category": "", "categoryclass": "", "imagename": "504be68f661b3fd122eb05d69b1a6063.jpg", "infoid": 1033944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家对大滑翔机的新组织样本进行了DNA测试后，在澳大利亚发现了两种新的大滑翔机，这是一种猫大小的有袋类动物，生活在澳大利亚的森林里。一项新的研究发表在《自然》杂志的公共获取科学报告上，详细介绍了这一发现。\n这一发现意义重大，因为它意味着滑翔机比之前想象的更加多样化，增加了澳大利亚发现的动物的多样性。\n从实验室到你的收件箱。每周从CNET获取最新的科学报道。\n研究人员卡拉·扬正托布告诉《西澳大利亚人报》，在我们眼皮底下发现这种生物多样性真的很令人兴奋。将较大的滑翔机划分为多个物种，减少了原来物种的广泛分布，进一步增加了对这种动物的保护关注，并突显了对其他较大的滑翔机物种缺乏信息。\n夜间活动的大滑翔机白天生活在树洞里，晚上在森林里漫步，寻找它最喜欢的食物--桉树叶。与这种动物的同名动物不谋而合，这种生物可以在空中滑行328英尺(100米)。\n对濒危动物的有效保护依赖于准确的分类，因此这两个新物种可能需要保护，就像最初的滑翔机一样，由于澳大利亚栖息地遭到破坏，目前滑翔机被列为濒危物种。甚至在毁灭性的丛林大火导致澳大利亚数百万动物死亡之前，华美的Petauroides volans数量就在下降。\n扬正托布补充说，自从澳大利亚的森林大火以来，人们越来越重视了解物种的遗传多样性和结构，以保护它们在面对气候变化时的韧性。\n通过对昆士兰、维多利亚州等地发现的各种滑翔机的组织样本以及博物馆标本进行基因测序测试，研究人员得以确认滑翔机DNA的差异。较大的滑翔机分为三个不同的物种，现在除了最初的Petauroides volans外，还包括Petauroides Minor和Petauroides armillatus。\n这项专注于大型滑翔机遗传学的新研究发现，澳大利亚南部、中部和北部地区生活着三个截然不同的物种。来自澳大利亚国立大学、堪培拉大学、CSIRO和詹姆斯·库克大学的研究人员共同参与了这项研究。\n一段时间以来，人们一直在猜测，存在不止一种更大的滑翔机，但现在我们从DNA中得到了证据。研究人员丹尼斯·麦格雷戈(Denise McGregor)告诉《卫报》，这改变了我们对他们的整个看法。\n这两个新的更大的滑翔机物种的发现也在社交媒体上引发了动物爱好者的兴趣。就这样，世界变得好多了，一位网友写道。\nNGL，我看到了那张照片，我以为这是那些爱玩的澳大利亚人的恶作剧，他们试图让游客相信这只动物是真的，而不是填充玩具。事实证明，这是一架真正的滑翔机，被称为“更大的滑翔机”。太可爱了。(奥兹，愚弄我一次，我会永远保持警惕。确实是放弃了熊市。)。Https://t.co/vOcwBc8i5q。\n-📚tibby♀️(@tibby17)2020年11月8日。\n伟大的滑翔机。*可爱*！😊😘我急于了解更多，发现它们“能够在空中滑行百米，但在陆地上一只脚几乎不能放在另一只脚前面”……它们几乎要灭绝了。😑该死的。#HumansKillEverythingIncludingThemself pic.twitter.com/1nJGLXWZjm。\n-Nnedi Okorafor，博士(@nnedi)2020年11月8日。\n“当你真的看到它们的时候，它们就像一只毛茸茸的大动物，就像一只大猫……但这只会飞。”幸运的是，他们是素食主义者。“。Https://t.co/gwbgPeqepT\n--Molly Lambert🦔(@Mollylambert)。\n澳大利亚发现了两种新的更大的滑翔机物种！之前人们认为它们属于一个物种，但显然更大的滑翔机是由三个不同的物种组成的。它们是世界上最大的滑翔哺乳动物之一。看看他们有多可爱！Pic.twitter.com/neVdL7Klv3。\n-Freyr(@sunfloweraidil)2020年11月8日。\n😯发现了两种新的更大的滑翔机！这些令人难以置信的生物在维多利亚州被列为濒危物种，但它们的栖息地仍在被政府拥有的伐木者VicForests https://t.co/WTZ12iUxqk😡破坏。\n-环境维多利亚(@EnviroVic)2020年11月6日。\n就这样，世界变得更美好了。介绍澳大利亚新发现的大滑翔机！尽管如此，那双耳朵。#周日早晨pic.twitter.com/AeCjYJeEIo。\n--🐲Firey#1🐲(@AvatarBizarre)。\n新的垃圾动物刚刚掉了下来。我最好尽快去看更大的滑翔机https://t.co/crt9BBJayW😩\n--Rina the Shark(@RinaTheShark)2020年11月8日。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Two new species of greater glider, a cat-size marsupial that lives in the forests of Australia, have been discovered Down Under after scientists ran DNA tests on new tissue samples of the animals. A new  study published in Nature&#39;s public access Scientific Reports journal details the findings.\n The discovery is significant because it means gliders are more diverse than previously thought, adding to the biodiversity of animals found in Australia.\n From the lab to your inbox. Get the latest science stories from CNET every week.\n &#34;It&#39;s really exciting to find this biodiversity under our noses,&#34; study  researcher Kara Youngentob told The West Australian. &#34;The division of the greater glider into multiple species reduces the previous widespread distribution of the original species, further increasing conservation concern for that animal and highlighting the lack of information about the other greater glider species.&#34;\n The nocturnal greater glider lives inside hollow trees during the day and at night roams the forest looking for its favorite food -- eucalyptus leaves. True to the animal&#39;s namesake, the creature can glide up to 328 feet (100 meters) in the air.\n Effective conservation of endangered animals relies on accurate classification, so these two new species could possibly need protection just like the original glider, which is  currently listed as &#34;threatened&#34; due to habitat destruction in Australia. Even before devastating bushfires killed millions of animals in Australia, the  Petauroides volans population numbers were declining.\n  Since the   bushfires in Australia, &#34;there&#39;s been an increased focus on understanding genetic diversity and structure of species to protect resilience in the face of climate change,&#34; Youngentob added.\n Using genetic sequencing tests from tissue samples taken from various gliders found in areas of Queensland, Victoria, as well as museum specimens, researchers were able to confirm differences in the gliders&#39; DNA. Greater gliders fall into three distinct species that now include Petauroides minor and Petauroides armillatus, in addition to the original Petauroides volans.\n The new study focusing on the genetics of greater gliders found three distinct species living in the southern, central and northern areas of Australia. Researchers from Australian National University, the University of Canberra, CSIRO and James Cook University worked together on the study.\n &#34;There has been speculation for a while that there was more than one species of greater glider but now we have proof from the DNA. It changes the whole way we think about them,&#34; study  researcher Denise McGregor told The Guardian.\n The discovery of the two new greater glider species also sparked interest from animal lovers on social media. &#34;And just like that, the world became a lot better,&#34; one wrote.\n Ngl, I saw that pic &amp; thought this was going to be a hoax from those fun-loving Aussies trying to convince tourists this animal was real &amp; not a stuffed toy.  Turns out it is real &amp; called a greater glider. Too cute.  (Fool me once, Oz, and I&#39;m forever wary. Drop Bears, indeed).  https://t.co/vOcwBc8i5q\n— 📚Tibby♀️ (@tibby17)  November 8, 2020\n The Greater Glider. *Adorable*! 😊😘  I rush to learn more and find out they’re “capable of gliding 100 metres through the air, but barely able to put one foot in front of the other on land”...and they’re nearly extinct. 😑 Dammit.  #HumansKillEverythingIncludingThemselves  pic.twitter.com/1nJGLXWZjm\n— Nnedi Okorafor, PhD (@Nnedi)  November 8, 2020\n “When you do see them, they’re like a big fluffy animal that’s like a great big cat...but this one can fly. Fortunately, they’re vegetarians.”  https://t.co/gwbgPeqepT\n— Molly Lambert 🦔 (@mollylambert)  November 8, 2020\n two new greater glider species have been discovered in australia!  it was previously assumed they were of one species, but apparently greater gliders comprise of three separate species. they’re one of the world’s biggest gliding mammals. look at how cute they are!  pic.twitter.com/neVdL7Klv3\n— freyr (@sunfloweraidil)  November 8, 2020\n 😯 TWO new species of greater glider have been discovered!  These incredible creatures are listed as threatened in Victoria, yet their habitat is STILL being destroyed by government-owned loggers VicForests 😡  https://t.co/WTZ12iUxqk\n— Environment Victoria (@EnviroVic)  November 6, 2020\n And just like that, the world became a lot better. Introducing the Greater Glider, a newly discovered floof in Australia! Those ears tho.  #SundayMorning  pic.twitter.com/AeCjYJeEIo\n— 🐲Firey #1🐲 (@AvatarBizarre)  November 8, 2020\n New trash animal just dropped. I better see some Greater glider fursonas soon 😩 https://t.co/crt9BBJayW\n— Rina The Shark (@RinaTheShark)  November 8, 2020\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-11-09 07:21:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科学家,澳大利亚,discover,滑翔机", "title": "科学家在澳大利亚发现两种新哺乳动物", "title_en": "Scientists Discover Two New Mammals in Australia", "transed": 1, "url": "https://www.cnet.com/news/scientists-discover-two-new-mammals-in-australia/", "via": "", "real_tags": ["科学家", "澳大利亚", "discover", "滑翔机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一类和第二类错误、β，α、p值、功率和效应大小--零假设显著性检验的惯例包含许多奇怪的概念。\n关于显著性检验，人们已经说了很多--大多数都是否定的。方法学家不断指出，研究人员曲解了p值。有人说，往好了说，这是一项毫无意义的活动，往坏了说，是对科学发现的阻碍。因此，我认为学生和研究人员正确解读统计测试是极其重要的。这种可视化是为了帮助学生学习统计假设检验。可视化是基于一个样本的Z检验。您可以使用滑块更改采样大小、功率、显著程度和效果大小，以查看采样分布如何更改。\n可视化将显示，当d设置为零时，&#34；幂&#34；和&#34；类型II错误&#34；是&#34；-&#34；。然而，I类错误率意味着一定数量的测试将拒绝H0。人们也会忍不住说，这个比例就是测试能力，而教科书和软件往往就是这么做的。一些消息来源还说，当H0等于Ha时，幂是零。我的观点是，当假定的效应是H0参数空间的一个元素时，幂是不被定义的。在这种情况下，POWER函数返回α，因此&#34；POWER&#34；是未定义的。因此，即使POWER函数说5%的测试会拒绝NULL，在这里讨论POWER也是没有意义的。这还意味着，当Ha接近H0幂时，d的小值将接近α。因此，幂的滑块不允许等于或小于α。\n此博客上的内容是在抄送许可下免费共享的。如果你喜欢我的作品并想支持它，你可以：\n我对目前使用的显著性检验深表怀疑。下面的引语可能会激发你对围绕NHST的争议的兴趣。[零假设显著性检验]有什么问题？嗯，在许多事情中，它没有告诉我们我们想知道的，我们非常想知道我们想知道的，尽管如此，出于绝望，我们仍然相信它会！&#34；\n“…。理工科学生的死记硬背训练无疑是有史以来最愚蠢的误入歧途的程序&第34号；\n“…。尽管这种方法在我们的应用统计学期刊和教科书中获得了令人惊叹的卓越地位，但它是建立在对理性推理本质的根本误解的基础上的，而且很少(如果有的话)适合科学研究的目的。\n“…。在研究过程中一种基本的疏忽的例子&巴坎(1966)\n“统计学显著性检验阻碍了科学知识的增长；它从来没有做出过积极的贡献。”\n他说：“教科书是错的。教学是错误的。你刚刚参加的研讨会是错的。你所在科学领域最负盛名的期刊是错误的。\n这些引用大多摘自尼克森(Nickerson)(2000年)的优秀评论《零假设显著性检验：一场古老而持续的争论的回顾》(Null假说显著性检验：一场古老而持续的争论的回顾)。\n如果你有任何建议，在Twitter上给我发一条消息，或者使用我网站上的联系人表格。", "note_en": "Type I and Type II errors, β, α,  p-values, power and effect sizes – the ritual of null hypothesis significance testing contains many strange concepts.\n  Much has been said about significance testing – most of it negative. Methodologists constantly point out that researchers misinterpret  p-values. Some say that it is at best a meaningless exercise and at worst an impediment to scientific discoveries. Consequently, I believe it is extremely important that students and researchers correctly interpret statistical tests. This visualization is meant as an aid for students when they are learning about statistical hypothesis testing. The visualization is based on a one-sample Z-test. You can vary the sample size, power, significance level and the effect size using the sliders to see how the sampling distributions change.\n        The visualization will show that &#34;power&#34; and &#34;Type II error&#34; is &#34;-&#34; when  d is set to zero. However, the Type I error rate implies that a certain amount of tests will reject H 0. It is tempting to also say that this ratio is the test&#39;s &#34;power&#34;, and frequently textbooks and software do just that. Some sources also say that power is zero when H 0 is equal to H a. My view is that power is not defined when the assumed effect is an element of H 0&#39;s parameter space. When this is the case, the power function returns α, and therefore &#34;power&#34; is undefined. So even though the power function says 5 % of the tests will reject the null, it does not make sense to talk about &#34;power&#34; here. This also implies that as H a approaches H 0 power will approach α for small values of  d. As a result the slider for &#34;power&#34; isn&#39;t allowed to be equal to or less than α.\n  The content on this blog is shared for free under a CC-BY license. If you like my work and want to support it you can:\n  I am deeply skeptical about the current use of significance tests. The following quotes might spark your interest in the controversies surrounding NHST. \t\t\t\t   &#34;What&#39;s wrong with [null hypothesis significance testing]? Well, among many other things, it does not tell us what we want to know, and we so much want to know what we want to know that, out of desperation, we nevertheless believe that it does!&#34;\n  “… surely the most bone-headedly misguided procedure ever institutionalized in the rote training of science students&#34;\n  “… despite the awesome pre-eminence this method has attained in our journals and textbooks of applied statistics, it is based upon a fundamental misunderstanding of the nature of rational inference, and is seldom if ever appropriate to the aims of scientific research”\n  “… an instance of a kind of essential mindlessness in the conduct of research&#34; – Bakan (1966)\n  “Statistical significance testing retards the growth of scientific knowledge; it never makes a positive contribution”\n  “The textbooks are wrong. The teaching is wrong. The seminar you just attended is wrong. The most prestigious journal in your scientific field is wrong.&#34;\n \t\t\t\tThese quotes were mostly taken from Nickerson’s (2000) excellent review  “Null Hypothesis Significance Testing: A Review of an Old and Continuing Controversy”.\n  \t\tIf you have any suggestions send me a message on  Twitter or use the  contact form on my site.", "posttime": "2020-11-09 07:17:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "统计,statistical,检验", "title": "理解统计能力和显著性检验", "title_en": "Understanding Statistical Power and Significance Testing", "transed": 1, "url": "https://rpsychologist.com/d3/nhst/", "via": "", "real_tags": ["统计", "检验"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈林顿去年从可怕的跌倒中恢复过来，他在21小时多一点的时间里登上了约塞米蒂3000英尺高的花岗岩墙。\n艾米丽·哈灵顿成为第四位在一天内自由攀登约塞米蒂国家公园3000英尺高的花岗岩长城El Capitan的女性。\n周三早些时候，当大多数美国人都在关注总统选举的结果时，这位34岁的女性开始了她的攀登。21小时13分51秒后，她登上了冠军宝座。此前，只有三名女性在一天内完成了自由攀登。\n自由攀登指的是在跌倒时使用绳索保护攀登，而在其他情况下纯粹用手和脚在岩石上攀登，从不利用人工保护。\n它与自由式攀岩的不同之处在于，自由式攀岩没有绳子，这是因为亚历克斯·霍诺德(Alex Honnold)拍摄的一部奥斯卡获奖纪录片讲述了他在同一悬崖上攀登的故事。\n几十个人免费攀登了埃尔卡皮坦，但只有三个人-汤米·考德威尔、霍诺德和已故的布拉德·戈布赖特-登上了哈灵顿实现的路线，即众所周知的金门。\n1994年的一天，林恩·希尔(Lynn Hill)首次实现了埃尔卡皮坦(El Capitan)的自由攀登，他在任何时间内都比其他任何人都更早地实现了这一壮举。在希尔的壮举之后又过了四年，登山者才第一次找到了另一条通往山顶的自由之路。\n继希尔之后，斯蒂夫·戴维斯(Steph Davis)和玛雅·史密斯-戈巴特(Mayan Smith-Gobat)也分别在2004年和2011年一天内攀登了埃尔卡皮坦(El Capitan)。哈灵顿说，在一项男性主导的运动中取得这一壮举很重要。\n她告诉“旧金山纪事报”：“多年来，我一直觉得自己不属于这里，好像我没有赢得成为优胜美地登山者的资格。”“但通过这次经历，我认识到，在那里没有归属或不归属，没有取得成就的公式。”我很有创造力，也很有实验精神，我找到了自己的路。“。\n埃尔卡皮坦是世界上最著名的攀岩胜地之一，是几十年来最好的登山者的试验场，许多人认为国家公园是现代攀岩的发源地。\n哈林顿曾多次攀登长城上一条名为金门的特定路线，但从未在一天内爬过。大约一年前，她经历了一次可怕的跌倒，因伤被送往医院。她发誓要再试一次，并花了几个月的时间在加州塔霍市的家中健身房进行训练。\n这一次，她在男友阿德里安·巴林格(Adrian Ballinger)和亚历克斯·霍诺德(Alex Honnold)的帮助下登上了珠穆朗玛峰。巴林格是一位著名的珠穆朗玛峰导游，亚历克斯·霍诺德以史无前例。他们被绑在同一根绳子上。\n当哈林顿到达路线上最困难的路段之一时，她的脚滑倒了，侧身摔倒，头撞到了花岗岩上。\n巴林格在接受《纪事报》采访时说：“鲜血开始从她的脸上倾泻而下，滴到了我的保护层上。”“我们立刻认为她的一天已经结束了。”这是对去年秋天的一次疯狂而可怕的倒叙。\n“我内心有一部分想要放弃和放弃，”她说。“但我内心的另一面是，‘这就是你在这里的原因。这应该是很难的。你应该为自己再试一次。‘“", "note_en": "Harrington, who recovered from scary fall last year, reached top of 3,000ft granite wall in Yosemite in just over 21 hours\n    Emily Harrington has become the fourth woman to free-climb El Capitan, the 3,000ft granite wall in Yosemite national park, in a single day.\n   While most of the US was focused on the results of the presidential election early on Wednesday, the 34-year-old began her climb. She reached the top 21 hours, 13 minutes and 51 seconds later. Only three women have previously made the free climb in a day.\n Free-climbing means climbing with a rope for protection in case of falls but otherwise climbing purely with hands and feet on rock, never taking advantage of artificial protection.\n It is distinct from free-solo climbing, made famous by an Oscar-winning documentary about an ascent by Alex Honnold of the same cliff, in that in free-solo climbing there are no ropes.\n A few dozen men have “free-climbed” El Capitan, but only three – Tommy Caldwell, Honnold and the late Brad Gobright – have gone up the route Harrington achieved, known as Golden Gate.\n El Capitan was first free-climbed in a day in 1994 by Lynn Hill, who managed the feat before anyone else had free-climbed the cliff in any amount of time. It was another four years after Hill’s feat that a climber would first find another free way to the top.\n After Hill, Steph Davis and Mayan Smith-Gobat also free-climbed El Capitan in a day, in 2004 and 2011, respectively. Achieving the feat in a male-dominated sport mattered, Harrington said.\n “I spent a lot of years feeling like I didn’t belong, like maybe I hadn’t earned my place to be a Yosemite climber,” she told the San Francisco Chronicle. “But throughout this experience I learned that there is no belonging or not belonging, no formula to achievement up there. I was creative and experimental and I found my own way.”\n El Capitan is one of the world’s most famous climbing spots, a proving ground for the best climbers for decades in a national park which many consider the birthplace of modern rock climbing.\n Harrington had climbed a particular route on the wall, called Golden Gate, many times, but never in one day. Nearly a year ago, she endured a scary fall and was taken to the hospital with injuries. She vowed to try again and spent months training in her home gym in Tahoe City,  California.\n This time, she ascended with the assistance of her boyfriend Adrian Ballinger, a renowned Mount Everest guide, and Alex Honnold, famous for his unprecedented free solo climb of El Capitan. They were tied to the same rope.\n When Harrington reached one of the route’s most difficult sections, her foot slipped and she fell sideways, hitting her head on the granite.\n “Blood just started pouring down her face, dripping on to me at the belay,” Ballinger told the Chronicle. “We immediately thought her day was done. It was a wild, scary flashback to last year’s fall.”\n  “There was a part of me that wanted to give up and quit,” she said. “But this other part of me was like, ‘This is why you’re here. It’s supposed to be hard. You owe it to yourself to try again.’”", "posttime": "2020-11-09 07:16:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "哈林顿,harrington,攀登", "title": "艾米丽·哈林顿成为一天内第四位自由攀登埃尔卡皮坦的女性", "title_en": "Emily Harrington becomes fourth woman to free-climb El Capitan in a day", "transed": 1, "url": "https://www.theguardian.com/us-news/2020/nov/07/emily-harrington-free-climb-el-capitan-yosemite-first-woman", "via": "", "real_tags": ["哈林顿", "攀登"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想自始至终分享我的旅程，让1983年的IBM Model F XT机械键盘恢复昔日的辉煌。它包括使其与现代计算机一起工作所需的步骤、错误和附加硬件。这篇博文是献给我的父亲，他教会了我有关计算机的知识。\n几个月前，我父亲问我是否有兴趣购买他的IBM 5150型个人电脑。我毫不犹豫地说：好的！我想解决的第一个项目是修复1983年的F-XT机械键盘。在一种多愁善感的熟练工/学徒感中，我感觉我父亲是在传递他的手艺工具，以延续计算机工作的家族血统，我不能错过这一点。\nIBM Model F键盘不仅使用了最好的开关，生产过程中使用的材料(远远超过5磅的钢和其他金属)意味着它们在传给孙辈的时候会像新的一样工作。问题是……它们不再是这样制造的。IBM Model F在20世纪80年代停产。如果你真的找到了Model F，它将是肮脏、破损和/或昂贵的组合，需要数小时的工作才能重新运行！\n这个键盘槽的重量超过6磅，听起来是这样的，在生产的时候，1982年的零售价为300-400美元(按今天的美元调整后为800-1000美元！)。根据这篇评论。\n修复过程确实花了几个小时，幸运的是，修复过程中没有使用烙铁，也没有更换任何电气或物理部件，因为它已经处于良好的运行状态……这是对设计的真实证明。甚至更酷的是，这篇博客文章是用修复后的F型键盘打印出来的！\n在开始这个项目之前，我发现了ClickyKeyboard，这是一个专门修复和收集M型键盘的网站，M型键盘是F型键盘的继任者。在ClickyKeyboard上，有一个专门的适配器和转换器，可以用来使较旧的5针DIN插头键盘与现代USB端口兼容。ClickyKeyboard上提到的一家公司是Hagstrom Electronics，它销售键盘编码器和协议转换器。在没有太仔细研究其他产品的情况下，我很快就买了KE18-XTAT-PS/2，它可以将XT键盘转换为PS/2协议键盘，价格为55美元。我欣喜若狂，至少有一些东西可以让我进入PS/2的领域，因为在这一点上，我知道我可以很容易地找到PS/2到USB的转换器。\nKE18-XTAT-PS/2到达后，我很快打开了一个古老的盒子(没错，那就是Windows 2000！)。主板上有PS/2输入。我测试了所有的钥匙，以确保它们仍然有效，而且它们确实有效！确认键盘仍然有效后，是时候开始修复了。\n第一步是取下金属外壳，看看钥匙下面的板子是什么状态。有相当于多年的碎片、咖啡污渍和黏糊糊的东西必须清除。此外，电路板上有一些腐蚀斑点需要处理。\n脱壳后，我用压缩空气清理了关键的掩体，清除了任何松散的脏物。接下来，我试着用酒精和棉签试着去掉一些粘性的东西，但这确实奏效了(#39；t==##*_)。\n我借了一个旋转工具来消除腐蚀。我用的是一块带有柔软塑料触手的钻头，尽可能轻柔地把腐蚀的斑点擦得亮晶晶的。可能会有更好、更合适的部分，但它做到了这一点。即使在最低的设置下，旋转工具的功率和转速也有点过头了。理想情况下，我会使用最低RPM更少、位数更精确的一款来获得所有的光斑。\n我在头顶上明亮的台灯下使用旋转工具，光线反射的方式，我没有注意到它掉下了黑色的表面，露出了银色的金属底座。在这一点上，我只是决定在我能做到的地方抛光，让它看起来更均匀。当钥匙和盖子在背面时，银色金属是可见的，但它看起来很好。不幸的是，由于旋转头和钻头的大小，我不能将棋盘上的每一平方英寸都磨光，但我知道它会被覆盖，所以我并不太在意它看起来是否完美。\n还有一些残留物粘在黑板上，我想把它们去掉。我一开始是用一把小螺丝刀把它刮掉的，但它也去掉了一些黑色的部分，看起来不太好看。在这一点上，需要一个化学支点，我伸手去拿粘性物质，这是我从一开始就应该做的。粘性物质消失了，用Q-Tips擦了一点肘部的油脂，确实有效地去除了黑板上的顽固粘性物质。\n由于棋盘状态良好，是时候开始处理实际的按键了。我先用擦桌子的湿巾把它们擦得干干净净，去除了大部分的变色和污渍。然而，它们看起来还是不尽如人意，我读到，仅仅是把它们浸泡在一碗洗碗皂和水中几个小时就能产生奇迹……果真如此。它们看起来像崭新的钥匙。\n洗完后我犯了一个错误，就是没有让它们内部完全干透。我太快把钥匙放回滑板上，一些水漏到了几个弹簧上，造成了少量的生锈(在Goo Gone之后的图像中略微可见)。我又给了他们一次肥皂浸泡，用压缩空气把水真正抽出来。我也会让它们风干1-2天，然后再把它们放回冲浪板上。\n在成功测试了实际键盘并且恢复工作接近完成后，是时候搜索PS/2转USB电缆了。一时心血来潮，我回到了Hagstrom电子网站，注意到他们已经有了一个小盒子，Ke-XTUSB，可以将XT信号转换成USB，价格是一样的。他们很客气地允许我退还KE18-XTAT-PS/2，以换取价格相同的KE-XTUSB。几天后，KE-XTUSB收到了邮件，我急切地把它连接到我现在的电脑上。\n除了两把钥匙外，一切都运转得很好。按键的弹簧机构要么不会检测到按键按键被卡住，要么会使屏幕上的&#34；sssssssssssssssssssssssssssssssssssss&#34；处于按下状态。用一点小把戏，我把钥匙帽放对了，所以现在它就像冠军一样工作了。另一把有问题的钥匙是10键附近的会计师事务所。弹簧不知何故掉了下来，我用强力胶水把它粘了回去，但还是有什么不对劲，它无法记录击键。不会有太大的损失，因为用另一个组合键就可以实现。\n总体而言，我真的对它的外观印象深刻，当把它与这款从未打开过的Model F的拆箱视频进行比较时，它看起来几乎是一样的！", "note_en": "I wanted to share my journey from start to finish to restore a 1983 IBM Model F XT mechanical keyboard to it&#39;s former glory. It includes the steps, mistakes, and additional hardware required to make it functional with a modern computer. This blog post is dedicated to my dad for teaching me about computers.\n   A few months ago, my dad asked if I was interested in taking ownership of his  IBM model 5150 PC. Without hesitation, I said &#34;yes!&#34;. The first project I wanted to tackle was to restore the 1983 Model F XT mechanical keyboard keyboard. In a sentimental andjourneyman/apprentice-sense, it felt like my dad was passing on the tools of his craft to continue the family line ofcomputer work and I couldn&#39;t pass that up.\n    The IBM Model F keyboards not only used the best switches, the materials used in their production (well over 5lbs ofsteel and other metals) means they will be working as good as new when it’s time to pass it on to your grandchildren.The problem...they just aren&#39;t made that way any more. The IBM Model F was discontinued in the 1980&#39;s. If you dofind a Model F, it will be some combination of dirty, broken and/or expensive, requiring hours of work to get itworking again!\n This tank of a keyboard weighs in at over 6 pounds, sounds like  this, and at thetime of production, retailed for $300-400 in 1982 ($800-1000 dollars adjusted in today&#39;s dollars!) according to this review.\n The restoration did take a few hours and fortunately none of it involved a soldering iron or replacing any of theelectrical or physical components because it was already in great functioning shape...a true testament to the design.Even cooler, this blog post was typed up using the restored Model F keyboard!\n  Before beginning the project, I discovered  ClickyKeyboards, a site &#34;Specializing inthe restoration and collection of model M keyboards&#34;, the successor to the Model F. On ClickyKeyboards, there is asection dedicated to the adapters and converters that may be required to make older 5-pin DIN plug keyboards compatiblewith modern USB ports. One of the companies mentioned on ClickyKeyboards is Hagstrom Electronics, which sells keyboard encoders and protocol converters.Without looking too closely at the other products, I quickly purchased the KE18-XTAT-PS/2 which &#34;converts an XTkeyboard into a PS/2 protocol keyboard&#34; for $55. I was ecstatic that there was at least something to get me into PS/2land, because at that point I knew I could easily find a PS/2 to USB converter.\n After the KE18-XTAT-PS/2 arrived, I quickly fired up an ancient box (yes, that is Windows 2000!) with a PS/2 input onthe motherboard. I tested all the keys to ensure they still worked and they did! With confirmation that the keyboardstill worked, it was time to start the restoration.\n    The first step was to remove the metal casing and see what the state of the board was underneath the keys. There wasyears worth of debris, coffee stains, and gunk that had to be removed. In addition, there were a few spots withcorrosion on the board that needed to be addressed.\n  Once the casing was off, I utilized compressed air to clean out the key bunkers and get rid of any loose nastiness.Next, I tried using rubbing alcohol and Q-tips to try and remove some of the stickier stuff, but that didn&#39;treally work.\n  I borrowed a rotary tool to buff out the corrosion. I used one of the provided bits that had soft plastic tentacles totry and buff out the corroded spots as gently as possible. There are likely better and more appropriate bits, but itdid the job. The rotary tool&#39;s power and RPMs were a bit overkill even on the lowest setting. Ideally, I would haveused one with fewer minimum RPMs and a more precise bit to get all the spots.\n   I was using the rotary tool under a bright overhead desk lamp, and with the way the light was reflecting, I didn&#39;tnotice it was taking off the black finish and revealing the silver metal base. At that point, I just decided to buffoff the finish where I could to make it look more uniform. The silver metal is visible when the keys and cover are backon it, but it looks fine. Unfortunately, with the rotary head and bit size, I wasn&#39;t able to buff every last squareinch of the board, but I knew it&#39;d be covered so I wasn&#39;t too concerned with it looking perfect.\n    There was still some residue stuck to the board that I wanted to remove. I started out using a small eye glassscrewdriver to scrape it off, but it took some of the black finish off as well and didn&#39;t look that nice. At that point,a chemical pivot was required and I reached for the  Goo Gone, which I should have done from thebeginning. The Goo Gone and a bit of elbow grease with Q-Tips did the trick in removing the stubborn gunk on the board.\n   With the board in good shape, it was time to tackle the actual keys. I first gave them a good wipe-down using deskcleaning wipes, which removed most of the discoloration and stains. However, they still didn&#39;t look as good as theycould, and I read that just soaking them in a bowl of dish soap and water for a few hours can do wonders...and it did.They keys look brand new.\n  One mistake I made after washing them was to not let them completely dry on the inside. I placed the keys back on theboard too soon, and some water leaked onto a few of the springs causing a small amount of rusting (slightly visible inthe post-Goo Gone image). I gave them another soap soak and used the compressed air to really get out the water. Ialso let them air dry for 1-2 days before putting them back on the board.\n  After successfully testing the actual keyboard and the restoration almost complete, it was time to search for a PS/2 toUSB cable. On a whim, I was back on the Hagstrom Electronic site and noticed they already had a small box, the KE-XTUSB, that converted the XT signal to USB,and it was the same price. They graciously allowed me to return the KE18-XTAT-PS/2 in exchange for the KE-XTUSB whichwas the same price. A few days later the KE-XTUSB arrived in the mail and I eagerly connected it to my current computer.\n   Everything worked beautifully except for two keys. The &#34;s&#34; key&#39;s spring mechanism would either not detect a key pressor would be stuck in the depressed state blasting &#34;sssssssssssssssssssssssssssssssssssss&#34; across the screen. With abit of finagling, I got the key cap placed correctly so now it works like a champ. The other key that has issues is theaccountant&#39;s &#34;+&#34; near the 10 key pad. The spring had come off somehow and I super glued it back, but something stillisn&#39;t right and it fails to register key strokes. Not a huge loss since &#34;+&#34; can be achieved with another keycombination.\n Overall, I&#39;m really impressed with how it looks and, when comparing it to  thisunboxing video of a never before opened Model F, it looks about the same!", "posttime": "2020-11-09 06:53:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "键盘,ibm", "title": "修复一台已有37年历史的IBM F机械键盘", "title_en": "Restoring a 37 Year-Old IBM F Mechanical Keyboard", "transed": 1, "url": "https://blog.opsdisk.com/restoring-a-37-year-old-ibm-model-f-mechanical-keyboard.html", "via": "", "real_tags": ["键盘", "ibm"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033940, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "语音信箱太烂了！我根本不想要它，至少我绝对不想让我的语音信箱通知新来的人。有没有办法完全关掉它？", "note_en": "Voicemail sucks! I don&#39;t want it at all, and I definitely at least don&#39;t want notifications from my voicemail graveyard about new arrivals. Is there a way to turn it off completely?", "posttime": "2020-11-09 06:53:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,关闭,voicemail,语音信箱", "title": "你不能关闭Google Fi上的语音信箱", "title_en": "You can't turn off voicemail on Google Fi", "transed": 1, "url": "https://www.reddit.com/r/GoogleFi/comments/d0nhdt/how_do_i_disable_voicemail_entirely/", "via": "", "real_tags": ["google", "关闭", "voicemail", "语音信箱"]}]