[{"category": "", "categoryclass": "", "imagename": "55726a9992b88aa32792fefbdadf11de.jpg", "infoid": 1028130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "10月2日凌晨，唐纳德·特朗普总统在推特上表示，他的新冠肺炎检测呈阳性。距离一场极具争议性的选举只有33天了，这一诊断让这个国家陷入了不确定性。医生、科学家和权威人士很快就开始猜测总统会发生什么，白宫一直守口如瓶，而且容易给出关于这位VIP患者的相互矛盾的信息。\n但总的来说，这种疾病的病程对医学来说不再是一个完整的黑匣子。接受“科学美国人”采访的传染病和重症监护医生表示，特朗普将在本周后半段站在十字路口。他可能会在长期的疾病中走上一段糟糕的路程，也可能正在向上摆动，走向康复。可悲的是，医生们有过治疗全球3600多万新冠肺炎患者和美国750多万患者的经验。根据这一临床历史，许多医生现在将疾病分为几个阶段，每个阶段都有不同的症状和治疗方法。根据他第一次报告症状的时间，特朗普似乎处于一个阶段的结束和下一个阶段的边缘。以下是医生通常看到的序列，以及它如何适用于总统。\n暴露和孵化：当SARS-CoV-2病毒进入人体细胞并开始复制时，新冠肺炎感染就开始了。在感染之后但症状开始之前的这段时间被称为潜伏期-它发生在感染病毒后的2至14天之间。虽然人们可能不知道自己生病了，但他们通常在症状开始前两三天就会传染。\n病毒复制：对大多数人来说，感染后第五天开始出现症状，包括发烧、咳嗽、喉咙痛、乏力、疼痛、胃肠道问题以及嗅觉或味觉丧失。弗吉尼亚大学的肺部和重症监护医生泰森·贝尔(Taison Bell)说，当症状出现时，这种变化标志着一个人处于“传染性高峰期”，这意味着他们正在向空气中排放大量病毒颗粒，将附近的人置于危险之中。\n这个时机对总统和他周围的人有很大的影响，贝尔说：“现在世界上最有名的人有新冠肺炎，根据时间线，人们可以假设，他在总统辩论期间可能是有感染力的。”与挑战者乔·拜登的电视辩论发生在上周二，特朗普在接下来的周四开始出现症状。贝尔指的是特朗普周日与特勤局特工乘车进行的一次短途旅行，他说：“他现在仍然很有感染力，当他开车兜风的时候也是如此。”他指的是特朗普周日与特勤局特工乘车进行的一次短暂旅行。这辆车行驶在沃尔特里德国家军事医疗中心外，他当时正在那里接受治疗。\n在疾病的早期阶段，大多数人都没有接受积极的治疗，但特朗普被给予了两种实验药物：抗病毒药物resisivir和输注单克隆抗体。他还接受了一种已有的药物：类固醇地塞米松。贝尔说，在新冠肺炎病情发展的那个时候，瑞德维韦和抗体疗法是有意义的，因为它们的目标是减缓或阻止病毒复制。但地塞米松在后期被用来抑制免疫系统的过度反应。美国疾病控制和预防中心前负责人、传染病内科医生汤姆·弗里登(Tom Frieden)称早期使用免疫系统抑制剂“令人费解”，因为在新冠肺炎比赛开始时，身体需要天然防御系统来对抗病毒。“我不知道该怎么理解它，”他说。\n弗里登还指出，大多数人无法获得实验药物，部分原因是短缺和缺乏FDA的批准，一个典型的患者可能不会同时获得这三种药物。但对于总统来说，因为他们的领导角色而得到特殊待遇并不少见。\n免疫超速：疾病的下一阶段，通常发生在感染后6至10天，此时免疫系统进入超速状态。“这有点像油门踩得太紧而卡住了，”贝尔说。并不是所有的患者都会沿着这条路走下去，但当被称为细胞因子的化学信号变得异常活跃时，那些确实会被放大的人的身体就会变得异常活跃。细胞因子引发强烈的炎症反应，导致高烧，免疫细胞攻击充满液体的健康组织和肺。如果这种免疫反应得不到控制，患者可能会出现器官衰竭，需要机械通气。\n鉴于特朗普症状出现的时间，这可能是他进入的时期。据波士顿布里格姆妇女医院(Brigham and Women‘s Hospital)专门研究新发传染病的内科医生亚伯拉尔·卡兰(Abraar Karan)称，这将是一个关键时刻。在他的实践中，他看到人们从早期的病毒感染中恢复过来-甚至从医院回家-但随后突然下降，“回来时感觉病情严重得多，氧气水平甚至更差，可能对身体器官造成其他损害，”他说。例如，心脏的炎性损伤可能会导致心肌炎，当它击中胰腺时，可能会导致2型糖尿病。*。\n炎症并发症：布里格姆妇女医院的重症监护医生Edy Kim解释说，新冠肺炎大流行的一个显著特点是有多少患者受到细胞因子风暴的并发症。在他的诊所中，他看到很多人因血栓和继发性细菌感染而住院，比如耐甲氧西林金黄色葡萄球菌(MRSA)。\n一些医生开预防性抗凝剂来控制凝血，或者预防性抗生素来阻止重症监护病房的感染。在重症监护病房中，多达31%的新冠肺炎患者会受到凝血并发症的影响，即使是轻微的病例也可能发生凝血并发症。金说，所有住进他医院的患者都被给予了非常低剂量的抗凝剂。他指出，特朗普的医生提供的治疗清单中没有这种药物。金说，可能是因为特朗普感觉足够好，可以四处走动，所以没有给他服用，而活动减少了凝血的可能性。\n长期：对于那些最终战胜病毒并在炎症袭击中幸存下来的患者，估计有10%的患者会留下几个月的虚弱症状。一些医生开始认为COVID的这个尾部是另一个阶段。患者遭受令人衰弱的头痛、精神迷雾、深度疲惫和一系列其他问题。埃默里大学(Emory University)传染病内科医生G·马歇尔·里昂(G.Marshall Lyon)表示，这些困难中的许多看起来与肌痛性脑脊髓炎相似，也被称为慢性疲劳综合征，这是一种影响身体各种部位和系统的长期疾病。他说，他已经看到抗抑郁药物取得了一些成功，但医生们仍处于学习阶段，有效干预的研究仍在继续。\n里昂曾在2014年埃博拉疫情期间治疗过患者，他表示，新冠肺炎以难以预测疾病何时开始而闻名。他说：“在感染的最初几天，几乎不可能判断谁会得超级恶心，谁不会。”\n但在患病一周左右后，预后就会变得更加明朗。对于特朗普来说，金认为本周后半段发生的事情将是关键。贝尔对此表示同意，并表示特朗普可能即将进入免疫超速阶段-如果他真的进入的话。金承认他无法预测未来，但“这通常是我所期待的。”\n*编者按(10/9/20)：这句话是在发帖后增加的，目的是陈述心脏和胰腺受到炎症性损害所导致的具体疾病。​。\n从“科学美国人”这里阅读更多关于冠状病毒爆发的信息。在这里阅读我们的国际杂志网络的报道。", "note_en": "Early in the morning on October 2, President Donald Trump tweeted that he had tested positive for COVID-19. Only 33 days  away from a highly contentious election, the diagnosis plunged the nation into uncertainty. Doctors, scientists and pundits quickly began speculating on what will happen to the president, and the White House has been both tight-lipped and prone to giving conflicting information about the VIP patient.\n  But in general, the course of this disease is no longer a complete black box to medicine. Trump will be at a fork in the road during the latter half of this week, say infections disease and critical care physicians who spoke with  Scientific American. He could be heading for a bad stretch in a prolonged illness or he could be on an upward swing to recovery. Doctors sadly have the experience of treating more than 36 million COVID-19 patients worldwide and more than 7.5 million in the U.S. Using this clinical history,  many now divide the disease into several stages, each with distinct symptoms and treatments. Based on when he first reported symptoms, Trump appears to be at the end of one phase and the verge of the next. Here is the sequence that physicians usually see and how it applies to the president.\n  Exposure and incubation: A COVID-19 infection begins when the SARS-CoV-2 virus enters cells in the body and begins to replicate. This period of time, after infection but before symptoms start, is called the incubation period—and it occurs between two and 14 days after contracting the virus. While people may not know they are sick, they often become contagious two or three days before symptoms begin.\n  Viral replication: Symptoms start by the  fifth day after infection for most people, and they include fever, cough, sore throat, fatigue, aches, pains, gastrointestinal issues, and loss of smell or taste. Taison Bell, a pulmonary and critical care physician at the University of Virginia, says that when symptoms arise, this change signals a person is at “peak infectivity,” which means they are shedding lots of virus particles into the air, putting nearby people at risk.\n  This timing has big implications for the president and those around him, Bell says: “The most famous person in the world right now has COVID-19, and one could assume, based on the time line, that he could have been infectious during the presidential debate.” The televised argument with challenger Joe Biden took place last Tuesday, and Trump began showing symptoms on the following Thursday. “He is still infectious now and was when he took his joyride,” says Bell, referring to a  short trip Trump took in a car with Secret Service agents on Sunday. The vehicle traveled around and just outside the Walter Reed National Military Medical Center, where he was being treated.\n  At this early stage of the disease, most people do not receive aggressive treatment, but Trump was given two experimental drugs:  the antiviral medication remdesivir and an infusion of monoclonal antibodies. He also received an established medication: the steroid  dexamethasone. Bell says that remdesivir and the antibody therapy made sense at that point in the progression of COVID-19 because they aim to slow or stop viral replication. But dexamethasone is used at a later stage to tamp down immune system overreactions. Tom Frieden, former head of the U.S. Centers for Disease Control and Prevention and an infectious disease physician, calls early use of an immune-system inhibitor “puzzling” because, at the beginning of a COVID-19 bout, the body needs its natural defenses to work to fight the virus. “I don’t know what to make of it,” he says.\n  Frieden also notes that most people do not have access to the experimental drugs, partially because of shortages and a lack of FDA approval, and a typical patient probably will not get all three. But it is not unusual for presidents to get special treatment because of their leadership role.\n  Immune overdrive: The next phase of the illness, usually occurring between six and 10 days after infection, is  when the immune system goes into overdrive. “It’s kind of like the gas pedal gets pushed too hard and gets stuck,” Bell says. Not all patients go down this path, but the bodies of those who do get amped up when chemical signals called cytokines become abnormally hyperactive. The cytokines trigger a strong inflammatory response that leads to high fevers, immune cells that attack healthy tissues and lungs that fill with fluid. If this immune reaction is not controlled, patients can suffer organ failure and require mechanical ventilation.\n  This could be the period Trump is entering, given the timing of the onset of his symptom. According to Abraar Karan, a physician at Brigham and Women’s Hospital in Boston, who specializes in emerging infectious diseases, it will be a critical moment. In his practice, he has seen people recover from the early viral infection—and even go home from the hospital—but then decline suddenly and “come back feeling much sicker, with even worse oxygen levels and possibly other harm to the body’s organs,” he says. Inflammatory damage to the heart can cause myocarditis, for instance, and when it hits the pancreas, it may lead to  type 2 diabetes.*\n  Inflammatory complications: Edy Kim, a critical care physician at Brigham and Women’s, explains that a striking feature of the COVID-19 pandemic is how many patients suffer complications from the cytokine storm. In his practice, he sees a lot of people who are hospitalized with blood clots and secondary bacterial infections, such as methicillin-resistant  Staphylococcus aureus (MRSA).\n  Some doctors prescribe preventive anticoagulants to manage clotting or preventive antibiotics to halt infection in the intensive care unit. Clotting complications, which can affect as many as  31 percent of COVID-19 patients in the ICU, can occur in even mild cases. Kim says all patients with the disease admitted to his hospital are given a very low dose of an anticoagulant. He notes this kind of medication was absent from the list of Trump’s treatments that was provided by his doctors. It is possible that it was not given to Trump because he was feeling well enough to be walking around, and activity reduces the chances of clotting, Kim says.\n  The long haul: For those patients who eventually fight off the virus and survive the inflammatory assault, an estimated  10 percent are left with months of debilitating symptoms. Some doctors are beginning to think of this tail end of COVID as another stage. Patients suffer debilitating headaches, mental fog, deep exhaustion and an assortment of other problems. G. Marshall Lyon, an infectious disease physician at Emory University, says many of these difficulties look similar to myalgic encephalomyelitis, also called chronic fatigue syndrome, which is a long-term illness that affects a wide variety of body parts and systems. He says he has seen some success with antidepressants, but doctors are still in the learning phase, and research on effective interventions continues.\n  Lyon, who has treated patients during the 2014 Ebola epidemic, says COVID-19 is notoriously unpredictable when the illness begins. “It’s nearly impossible to tell, in the first few days of infection, who’s going to get supersick and who’s not,” he says.\n  But after a week or so of illness, the prognosis becomes clearer. For Trump, Kim believes that what happens during the latter half of this week will be key. Bell agrees and says Trump could be on the cusp of heading into that immune overdrive phase—if he enters it at all. Kim admits he cannot predict the future, but “that’s generally what I’d expect.”\n  *Editor’s Note (10/9/20): This sentence was added after posting to state specific diseases caused by inflammatory damage to the heart and pancreas.​\n  Read more about the coronavirus outbreak from Scientific American   here. And read coverage from our international network of magazines  here.", "posttime": "2020-10-11 17:18:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "covid,患者", "title": "特朗普的COVID案可能进入关键阶段", "title_en": "Trump’s COVID Case Could Be Entering a Crucial Stage", "transed": 1, "url": "https://www.scientificamerican.com/article/trumps-covid-case-could-be-entering-a-crucial-stage/", "via": "", "real_tags": ["covid", "患者"]}, {"category": "", "categoryclass": "", "imagename": "1afae6d5be5aaaf1c52593c569d916ee.png", "infoid": 1028129, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“它几乎不影响任何人，”唐纳德·特朗普总统在9月21日谈到这种新型冠状病毒时说。几个小时后，美国人死于新冠肺炎的人数超过20万人，不到两周后，他的检测呈阳性。与总统不同的是，这些数字不会说谎。这个里程碑式的数字背后的死亡人数大约相当于盐湖城或阿拉巴马州伯明翰的人口-也高于除内战和第二次世界大战以外的任何美国冲突中的死亡人数。\n这些数字不言而喻，“科学美国人”在这里进行了更深入的研究。新冠肺炎在3月30日至4月4日这一周成为第三大死因，仅次于心脏病和癌症。它导致的死亡人数比中风、慢性下呼吸道疾病、阿尔茨海默氏症、糖尿病、肾脏疾病或流感更多。在那一周，有近1万人死于冠状病毒引起的疾病。特朗普和其他人在讨论新冠肺炎时提到的流感，在同一时间段内导致1,870人死亡(这个数字包括肺炎)。逐周统计的高峰出现在4月中旬，当时新冠肺炎的病例成为主要死因。该疾病在5月4日至9日的一周内重新成为第三大致死点，并一直停留在那里。\n这一损失范围可以进一步扩大，以衡量高于典型死亡率的超额死亡人数。疾病控制和预防中心的临时死亡统计显示，今年3-8月每个月的死亡人数都超过了过去20年同期。(统计数据包括死于病毒的人数和其他原因的上升，如医院不堪重负时缺乏医疗护理。)。\n新冠肺炎至少标志着流行病学的暂时挫折。今年前8个月死亡的美国人比1970年以来的任何一年都要多-这一年矛盾的是，事实证明对公共卫生来说是好的一年。1970年，理查德·尼克松总统签署了“职业安全与健康法案”，在一项禁止电视和广播香烟广告的法案上签字，并向国会提交了一份设立环境保护局的计划。也许这样的行动可以作为未来几年的先例，届时政策制定者将召开会议，为未来大流行的必然性做计划。", "note_en": "“It affects virtually nobody,” President Donald Trump said of the novel coronavirus on September 21—a few hours before U.S. deaths from COVID-19 exceeded 200,000 and less than two weeks before he tested positive. Unlike the president, the numbers don’t lie. The human toll underlying that milestone figure is a number about as big as the population of Salt Lake City or Birmingham, Ala.—and greater than the deaths in any U.S. conflict except for the Civil War and World War II.\n  The figures speak for themselves, and  Scientific American takes a deeper look here. COVID-19 became the third biggest cause of deaths in the week of March 30 to April 4, trailing heart disease and cancer. It killed more people than stroke, chronic lower respiratory disease, Alzheimer’s, diabetes, kidney disease or influenza. In that week, close to 10,000 people died of the illness caused by the coronavirus. The flu, which Trump and others have invoked when discussing COVID-19, led to 1,870 deaths (a figure that includes pneumonia) over the same time frame. A spike in the week-by-week accounting came in mid-April, when COVID-19 cases became the leading cause of death. The disease returned to the third deadliest spot in the week of May 4 to 9 and has stayed there since.\n  This profile of loss can be broadened further to measure excess deaths above typical mortality rates.  Provisional death counts from the Centers for Disease Control and Prevention show that more people died every month from March to August this year than during the same period in the past 20 years. (The statistics include deaths from both the virus and upticks for other causes such as a lack of medical care as hospitals became overwhelmed.)\n  COVID-19 marks at least a temporary setback for epidemiology. The share of Americans who died in the first eight months of this year was greater than that of any year going back to 1970—a year that paradoxically turned out to be a good one for public health. In 1970 President Richard Nixon signed the Occupational Safety and Health Act, put his signature on a bill to ban television and radio cigarette ads, and sent to Congress a plan for setting up the Environmental Protection Agency. Maybe such actions can serve as precedents in years ahead when policy makers convene to plan for the inevitability of future pandemics.", "posttime": "2020-10-11 17:17:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,肺炎,leading,疾病", "title": "新冠肺炎现在是美国第三大死因。", "title_en": "COVID-19 Is Now the Third Leading Cause of Death in the U.S.", "transed": 1, "url": "https://www.scientificamerican.com/article/covid-19-is-now-the-third-leading-cause-of-death-in-the-u-s1/", "via": "", "real_tags": ["美国", "肺炎", "leading", "疾病"]}, {"category": "", "categoryclass": "", "imagename": "b8577c020cb06f6b0c2477261edf5af5.jpg", "infoid": 1028128, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，谷歌推出了另一个更便宜的Wi-Fi网状产品线。在推出Nest Wi-Fi一年多一点之后，这一新的产品线恢复了最初的Google Wi-Fi品牌，并以一件套、两件套或三件套的形式出售。\n在很大程度上，新的谷歌Wi-Fi似乎与最初的非常相似-每个设备都是一个小的、蹲着的白色圆柱体，带有两个千兆以太网端口，双频802.11ac，AC1200(Wi-Fi 5，2x2)无线电，以及蓝牙低能耗支持。2020年版的谷歌Wi-Fi有一个简单的直流桶形插孔，取代了最初版本的USB-C充电端口。\n更昂贵的Nest Wi-Fi在每个节点中都提供了集成的智能扬声器和更粗的Wi-Fi回程管道-尽管Nest Wi-Fi和Google Wi-Fi都是双频802.11ac(Wi-Fi 5)，但更昂贵的Nest Wi-Fi中的5 GHz无线电是4x4，提供两倍的回程(连接到离互联网更近的下一个节点)吞吐量。\nNest Wi-Fi还为最终的家庭自动化管理提供了Thread收音机，但它目前已被禁用。Nest Wi-Fi和Google Wi-Fi都不支持Zigbee或Z-wave，所以如果您想使用Google管理您的家庭自动化设备，您将需要一个集成了Google Assistant的独立集线器。三星的智能物集线器经常被推荐用于这一目的。\n谷歌对这两个产品线的预期覆盖范围有不同的建议：对于Nest Wi-Fi，一件套、两件套和三件套的覆盖面积为2200/3800/5400平方英尺。对于谷歌Wi-Fi，一体式和三件式套件的覆盖面积为1500/4500平方英尺。\n我们不建议认真对待这些平方英尺的估计-最初的谷歌Wi-Fi(三件式)和新的Nest Wi-Fi(两件式)在我们3500平方英尺的测试房中测试都不好。在这个问题上，谷歌Wi-Fi上的规格没有任何意义-你无法获得三件套覆盖范围的三倍，因为你从一体式套件获得的覆盖范围是一体式套件的三倍。为了让Wi-Fi回程正常工作，卫星节点必须大致放置在第一个单元覆盖区域的中间，而不是边缘。\n如果你深入谷歌生态系统，并且真的想要集成的谷歌助手智能扬声器，那么Nest Wi-Fi并不是一个糟糕的选择，尽管在我们的测试中，它并不是一个性能非常高的Wi-Fi系统。我们看不到更便宜的谷歌Wi-Fi的价值-没有迹象表明它的表现会比非常相似的原始谷歌Wi-Fi表现更好，后者在我们的排行榜上一直排名垫底。\n新款谷歌Wi-Fi的三件套非常便宜，仅售200美元，但考虑到谷歌Wi-Fi历来表现不佳，我们不推荐它。亚马逊Eero三件套是我们测试过的性能最高的双频三件套系统，售价约225美元-如果最终考虑的是价格，TP-Link Deco M5三件套系统目前的售价为170美元。", "note_en": "This week, Google launched another, cheaper version of its Wi-Fi-mesh product line. A little more than a year after the introduction of  Nest Wi-Fi, this new product line resurrects the original Google Wi-Fi branding and is sold in one-, two-, or three-piece sets.\n For the most part, the new Google Wi-Fi seems pretty similar to the original—each device is a small, squat white cylinder sporting twin gigabit Ethernet ports, dual-band 802.11ac, AC1200 (Wi-Fi 5, 2x2) radios, along with Bluetooth Low-Energy support. The 2020 version of Google Wi-Fi has a simple DC barrel jack in place of the USB-C charging port on the original version.\n The more expensive Nest Wi-Fi offers an integrated smart speaker in each node and a fatter Wi-Fi backhaul pipe—although both Nest Wi-Fi and Google Wi-Fi are dual-band 802.11ac (Wi-Fi 5), the 5GHz radio in the more expensive Nest Wi-Fi is 4x4, offering double the backhaul (connection to the next node closer to the Internet) throughput.\n Nest Wi-Fi also offers a Thread radio for eventual home automation management, but it&#39;s currently disabled. Neither Nest Wi-Fi nor Google Wi-Fi supports Zigbee or Z-wave, so you&#39;ll need a separate hub with Google Assistant integration if you want to use Google to manage your home automation gear. Samsung&#39;s  Smart Things hub is frequently recommended for this purpose.\n  Google has different recommendations for the two product lines regarding expected coverage: for Nest Wi-Fi, coverage is listed as 2,200/3,800/5,400 square feet for the one-, two-, and three-piece kits. For Google Wi-Fi, coverage is listed as 1,500/4,500 square feet for the one-piece and three-piece kits.\n We do not recommend taking those square-footage estimates seriously—neither the original Google Wi-Fi (three-piece) nor the new Nest Wi-Fi (two-piece) tested well in our 3,500-square-foot test home. For that matter, the specs on Google Wi-Fi don&#39;t make any sense—you cannot get triple the coverage from a three-piece kit as you get from a one-piece. For the Wi-Fi backhaul to work properly, the satellite nodes must be placed roughly in the middle of the first unit&#39;s coverage area, not at the edge.\n If you&#39;re deep into the Google ecosystem and really want integrated Google Assistant smart speakers, Nest Wi-Fi isn&#39;t a bad buy, even though it&#39;s not a very high-performing Wi-Fi system in our testing. We see less value in the cheaper Google Wi-Fi—there&#39;s no indication it will perform better than the very similarly specified original Google Wi-Fi, which consistently ranked at the very bottom of our charts.\n The three-piece kit for the new Google Wi-Fi is very  inexpensive at $200, but given Google Wi-Fi&#39;s historically poor performance, we don&#39;t recommend it. The three-piece Amazon Eero kit is the highest-performing dual-band, three-piece system we&#39;ve ever tested, and it&#39;s  available for $225—or if price is the ultimate consideration, a TP-Link Deco M5 three-piece system is  currently $170.", "posttime": "2020-10-11 17:17:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,发布,wi", "title": "谷歌发布新的、更便宜的谷歌Wi-Fi和Nest Wi-Fi", "title_en": "Google releases new, cheaper Google Wi-Fi alongside Nest Wi-Fi", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/google-releases-new-cheaper-google-wi-fi-alongside-nest-wi-fi/", "via": "", "real_tags": ["google", "谷歌", "发布", "wi"]}, {"category": "", "categoryclass": "", "imagename": "23cd52e6362735cd030e7ee2bfda66ff.png", "infoid": 1028127, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们又来了，距离苹果公司9月15日的活动还不到一个月。下周二，也就是10月13日，苹果公司的代表将走上流媒体舞台，发布新产品，这是苹果公司冠以“嗨，速度”的活动。但我们能从这场活动中期待什么呢？\n通常情况下，苹果会在9月份的发布会上发布iPhone，但今年它没有发布，可能是因为与COVID相关的新设备测试延迟了。相反，9月份的活动主要是关于Apple Watch(还有一款新的、重新设计的iPad Air，以及一些服务公告和一款略微改进的非Air、非Pro、非迷你iPad)。\n总而言之，iPhone很有可能成为苹果10月份发布会上的明星。让我们来看看对他们有什么期待--以及我们可能在活动中还会看到什么。\n如果泄密者、对iOS14构建的调查以及彭博社(Bloomberg)等知名出版物的报道是可信的，那么我们将迎来多年来最重大的iPhone大修--当然是自2017年iPhone X以来。\n虽然试图对苹果神秘的活动名称进行过多预测通常是愚蠢的，但嗨，Speed很可能指的是以下两件事中的一件或两件：A14芯片和5G连接。苹果的新款iPhone预计都会使用这两款手机。\n当苹果上个月发布新款iPad Air时，A14就已经向公众推出了。A14包括一个带有两个高性能内核和四个高效率内核的六核CPU，以及一个定制GPU和一个用于机器学习任务的16核神经引擎。\n尽管A14看起来并不比去年旗舰iPhone中的A13快得多，但它将继续保持苹果在性能上领先于大多数竞争对手的优势。至于5G，苹果的竞争对手最近已经开始加入这股潮流，预计苹果将全力以赴，在本季的所有新款iPhone中提供5G。\n考虑到5G网络在大多数地方还处于萌芽状态，5G目前不太可能对大多数用户产生太大影响。但根据它在iPhone上的实现情况，从长远来看，这可能是有好处的。\n有报道称，新款iPhone将有四种不同型号，三种尺寸。2019年iPhone11将有两款继任者：一款是5.4英寸的屏幕，另一款是6.1英寸的屏幕。与此同时，iPhone11Pro将有6.1英寸和6.7英寸两种型号可供选择。\n所有四款机型都将采用类似于iPhone4，iPhone5，以及最近的iPad Pro和新发布的iPad Air的设计和美学，因为它们的边缘将是平坦的。两款低端机型将由玻璃和铝制成，而高端机型将由玻璃和不锈钢制成。\n除了今年iPad Pro更新换代中出现的激光雷达传感器的可能性外，我们不确定在相机功能方面会有什么期待。传感器将支持新的或改进的计算摄影和增强现实功能和应用程序。\n关于新款iPhone还有一个可能令人震惊的消息：分析师和泄密者几个月来一直在说，任何新款iPhone都不会附带苹果廉价的有线耳机EarPods。如果这是真的，苹果很可能会用环保、反浪费的理由来包装这一点，就像它在新的Apple Watch盒子上省略了充电砖一样。\n今年6月，苹果宣布，它将开始(非常缓慢地)在新Mac上放弃英特尔的CPU，转而采用自己定制的、ARM衍生的硅片，类似于iPad Pro中的硅片。该公司还表示，首批运行这些芯片(被称为苹果硅)的Mac将于2020年底上市。\n这使得Apple Silicon Mac成为我们可能在10月13日看到的唯一一款已经确认的产品。然而，不能保证它会出现在这次活动中。该公司可以选择在11月或12月宣布这一消息。\n无论如何，除了新款Mac将采用苹果硅片这一事实外，我们对它一无所知。它会是一台低端的MacBook还是一台极其高端的机器？我们赌的是前者--或许是MacBook(SANS&34；Air&34；或Pro&34；)产品线的回归。但这只是一个有根据的猜测。\n今年早些时候，苹果向开发者发送了一台专门为在Apple Silicon上开发和测试Mac应用程序而制造的机器--本质上是一台内置iPad Pro芯片的Mac mini，但没有证据表明这款设备预示着哪款产品将首先在消费者手中发布。\nMacBook、MacBook Air或Mac mini级别的Apple Silicon Mac很可能会超过搭载英特尔CPU的低端Mac电脑(基于iPad Pro基准测试)。这意味着苹果的口号Hi，Speed也可能适用于一款新的Mac电脑。\n此外，我们不会为这件神秘的物品增加单独的部分，因为如果真的发生了，它很可能只是一个小小的规格提升，甚至可能不会在发布会上被提及-苹果将在未来一两个月内更新基于英特尔的16英寸MacBook Pro。\n不过，我们认为这不太可能成为苹果硅片的第一款产品，因为16英寸的MacBook Pro被内容创作专业人士广泛使用，他们依赖的软件可能还没有为新架构重新构建。\n这基本上是一个流传的笑话，因为这可能是苹果最终宣布AirTags的事件，这是该公司有史以来保守最糟糕的秘密之一。但现在又来了：现在可能是时候了。\n根据泄露的信息、可靠的报告，甚至是隐藏在iOS中的证据，AirTags将成为苹果Tile的竞争对手，Tile是一种可以通过GPS等定位服务追踪的小型物理标签。在一种用例中，您可以将AIRTAG附加到贵重物品上，以确保在丢失时可以找到它。\n早期泄露的消息表明，AirTags还将提供增强现实功能，允许车主在iPhone、iPad或(未来)AR眼镜上以平视显示器的AR视图找到它们。他们还可能使用U1超宽带芯片，这种芯片在最近的iPhone中有些神秘地包含了。\n彭博社(Bloomberg)几个月前的一篇报道描述了新的耳机，它将带有苹果品牌的名称，而不是Beats品牌。它们的价格可能与Beats Studio3(350美元)相似。\n和他们的Beats兄弟一样，新的苹果耳机(可能被称为AirPods Studio)将具有比我们去年推出的入耳式AirPods Pro更好的有源消噪和音质。同一份报告声称，这些新的耳机将是模块化的，允许用户更换耳垫等。\n我们不确定发布这些耳机的时间表，但与新款iPhone一起发布似乎是理想的。\n我们对新HomePod的了解甚至比对新耳机的了解更少，但来自几家出版物和消息来源的报道称，苹果计划推出一款更小、更便宜的HomePod，以与亚马逊(Amazon)和谷歌(Google)的低端扬声器竞争。\n目前，HomePod的价格高于这两家竞争对手提供的最昂贵的产品。评论家们普遍认为HomePod在音频质量方面是赢家，但不是智能扬声器功能。\n更便宜的扬声器可能会牺牲这种音频质量，将Siri带给更多的人。但除了隐私政策上的差异之外，目前尚不清楚为什么许多消费者会选择配备Siri的低端HomePod，而不是配备Google Assistant的Google Home扬声器或配备Amazon Alexa的设备，因为目前这些助手比Siri更有用、更准确。\n但我们可能会在下周的发布会上确切了解苹果对新发言人的观点。", "note_en": "Here we are again, less than one month after Apple&#39;s September 15 event. Next Tuesday, October 13, Apple representatives will take to the streaming stage to announce new products in an event  the company has monikered &#34;Hi, Speed.&#34; But what can we expect from the event?\n Normally, Apple launches iPhones at a September event, but it didn&#39;t this year, possibly because of  COVID-related delays in its testing of the new devices. Rather, the September event was primarily about the Apple Watch (there was also a new,  redesigned iPad Air, along with some services announcements and a slightly modified non-Air, non-Pro, non-mini iPad).\n All that is to say that iPhones are very likely to be the stars of Apple&#39;s October show. Let&#39;s get into what to expect from them—and what else we might see at the event.\n  If leakers, investigation into iOS 14 builds, and reports from generally reputable publications like Bloomberg are to be believed, we&#39;re in for the most significant iPhone overhaul in years—certainly since 2017&#39;s iPhone X.\n While it&#39;s usually folly to try to get too predictive about what Apple means with its cryptic event names, &#34;Hi, Speed&#34; is likely to refer to one or both of the following two things: the A14 chip and 5G connectivity. Both are expected in Apple&#39;s new iPhones.\n The A14 was already introduced to the public when Apple announced the new iPad Air last month. The A14 includes a six-core CPU with two high-performance cores and four efficiency cores, as well as a custom GPU and a 16-core neural engine for machine-learning tasks.\n While it doesn&#39;t look like the A14 is dramatically faster than the A13 found in last year&#39;s flagship iPhones, it will continue Apple&#39;s lead in performance over most competing devices. As for 5G, Apple&#39;s competitors have already started jumping on that bandwagon of late, and Apple is expected to go all-in, offering 5G in all of its new iPhones this season.\n 5G is unlikely to make a big difference for most users right now, given the nascency of 5G networks in most places. But depending on its implementation in the iPhones, it might be good for the long term.\n  Reports have said that the new iPhones will come in four different models across three sizes. 2019&#39;s iPhone 11 will see two successors: one with a 5.4-inch screen, and the other at 6.1 inches. Meanwhile, the iPhone 11 Pro will be available in 6.1-inch and 6.7-inch variants.\n All four models will adopt a design and aesthetic similar to the iPhone 4, iPhone 5, and recent iPad Pro and newly announced iPad Air in that they will have flat edges. The two lower-end models will be made of glass and aluminum, while the higher-end ones will be glass and stainless steel.\n     We&#39;re not sure what to expect in terms of camera features, other than the possibility that at least the higher-end phones will include the lidar sensor that appeared in this year&#39;s iPad Pro refresh. The sensor would support new or improved computational photography and augmented reality features and apps.\n There&#39;s one other potentially bombshell bit of news about the new iPhones: analysts and leakers alike have been saying for months that EarPods, Apple&#39;s cheap wired headphones, would not be included in the box with any new iPhone. If true, Apple is likely to wrap this in an environmentally friendly, anti-waste justification, just like it did with omitting the charging brick from the new Apple Watch boxes.\n  This June, Apple announced that it would begin (very gradually) moving away from Intel&#39;s CPUs in new Macs in favor of its own custom-designed, ARM-derived silicon similar to that found in the iPad Pro. It also said that the first of the Macs running on those chips (which are dubbed &#34;Apple Silicon&#34;) will arrive by the end of 2020.\n That makes the Apple Silicon Mac the only  already confirmed product we might see on October 13. However, there&#39;s no guarantee it will be at this event. The company could opt to announce it in November or December instead.\n In any case, we don&#39;t yet know anything about the new Mac besides the fact that it will have Apple Silicon. Will it be a low-end MacBook or a beastly high-end machine? We&#39;d bet the former—perhaps a return of the MacBook (sans &#34;Air&#34; or &#34;Pro&#34;) product line. But that&#39;s just an educated guess.\n     Apple sent developers a machine made specifically for developing and testing Mac apps on Apple Silicon earlier this year—it was essentially a Mac mini with an iPad Pro chip inside it—but there&#39;s no evidence the device was a harbinger of which product will get a consumer release first.\n An Apple Silicon Mac at the MacBook, MacBook Air, or Mac mini level would likely outperform low-end Macs with Intel CPUs (based on iPad Pro benchmarks). That means Apple&#39;s &#34;Hi, Speed&#34; tagline could also apply to a new Mac.\n Also—we&#39;re not adding a distinct section for this mystery item since, if it does happen, it&#39;s likely to be a minor specs bump and may not even be mentioned at the event—Apple is due to refresh the Intel-based, 16-inch MacBook Pro in the next month or two.\n We believe it&#39;s unlikely that will be the first product to go Apple Silicon, though, given that the 16-inch MacBook Pro is widely used by content-creation professionals who rely on software that may not have been rebuilt for the new architecture yet.\n  It&#39;s basically a running joke now that  this might be the event where Apple  finally announces AirTags, one of the company&#39;s all-time worst-kept secrets. But here it is again: this might be the time.\n Based on leaks, reliable reports, and even evidence buried in iOS, AirTags would be Apple&#39;s competitor to Tile—little physical tags that you can track with location services like GPS. In one use case, you could attach an AirTag to a valuable to make sure you can find it if lost.\n Early leaks suggested AirTags would also offer augmented reality features, allowing the owner to find them with a heads-up-display-like AR view on their iPhones, iPads, or (in the future) AR glasses. They might also work with the U1 ultrawide-band chip that has been somewhat  mysteriously included in recent iPhones.\n  A Bloomberg report a few months ago described new, over-ear headphones that would carry the Apple brand name, as opposed to Beats branding. They would probably come at a price point similar to that of the Beats Studio3 ($350).\n Like their Beats brethren, the new Apple headphones (possibly called AirPods Studio) would feature superior active noise cancellation and sound quality compared to what we got in the in-ear AirPods Pro that launched last year. The same report claimed these new headphones will be modular, allowing users to swap out the ear pads, among other things.\n     We&#39;re unsure of the timeline for announcing these headphones, but alongside new iPhones would seem to be ideal.\n  We know even less about a new HomePod than we know about the new headphones, but reports from several publications and sources have said that Apple plans to introduce a smaller, cheaper HomePod to compete with lower-end speakers from Amazon and Google.\n Currently, the HomePod is priced up against the most expensive offerings from those two competitors. Reviewers have generally said the HomePod was a winner in terms of audio quality but not smart speaker features.\n     A cheaper speaker would likely sacrifice that audio quality to bring Siri to more people. But apart from privacy-policy differences, it&#39;s not clear why many consumers would choose a low-end HomePod with Siri over a Google Home speaker with Google Assistant or a device with Amazon Alexa given that those assistants are more useful and accurate than Siri at this time.\n But we might learn exactly what Apple&#39;s argument is for the new speaker at next week&#39;s event.", "posttime": "2020-10-11 17:16:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,apple,活动", "title": "对苹果10月13日的“Hi，Speed”活动有什么期待", "title_en": "What to expect from Apple’s October 13 “Hi, Speed” event", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/what-to-expect-from-apples-october-13-hi-speed-event/", "via": "", "real_tags": ["苹果", "apple", "活动"]}, {"category": "", "categoryclass": "", "imagename": "60545616ff87b5594ba918d0e371a933.jpg", "infoid": 1028126, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "任何记得“不追踪”的人都知道这是一次失败--这项计划本应允许浏览器用户在网络上收回他们的隐私。网站不仅忽视了它，而且可以说，使用它会让人们变得不那么隐私，因为这会让他们变得突出。现在，隐私权倡导者又带着新的规范回来了，这一次他们带来了律师。\n在引擎盖下，这个被称为全球隐私控制(Global Privacy Control)的规范的工作方式与Do Not Track Did几乎相同。一个小的HTTP头通知站点访问者不想出售他们的数据。这一次最大的不同之处在于加州颁布了《消费者隐私法》，可能还有欧洲的《一般数据保护条例》(General Data Protection Regulations)，这两项法案都赋予消费者广泛的权利，让他们可以如何使用自己的私人信息。\n目前，不希望网站出售他们的数据的加州居民必须在每个网站上注册他们的选择，通常是每次他们访问它的时候。这既烦人又耗时。但加州的法律特别考虑了“用户启用的全球隐私控制，如浏览器插件或隐私设置”，这表明了这一选择。这就是全球隐私控制(Global Privacy Control，简称GPG)所做的事情。\n“这项工作的目标是帮助定义一种机制，最初可以满足CCPA对‘全球隐私控制’的要求，”参与领导该倡议的隐私研究员阿什坎·索尔塔尼(Ashkan Soltani)说。但他表示，GPC“可以扩展到适用于其他隐私法，如GDRP，如果政策制定者认为它足以在这些司法管辖区行使这些权利的话”。\n到目前为止，Brave浏览器的制造商是唯一承诺实现该控件的开发人员。Brave周三表示，该控件已经在桌面和Android版本的夜间或测试版进行试验，一旦提案接近成为标准，iOS的实施预计就会实现。一旦在版本中实现，该控件将“默认打开且不可配置”。\n与此同时，火狐开发者Mozilla表达了更多试探性的支持。浏览器制造商尚未表示将在浏览器中内置控制机制。火狐桌面副总裁赛琳娜·德克尔曼(Selena Deckelmann)在GPC发布声明的同时表示：“Mozilla很高兴支持全球隐私控制倡议。人们的数据权必须得到承认和尊重，这是朝着正确方向迈出的一步。我们期待着与其他网络标准团体合作，为每个人带来这些保护。“。\nGPC的其他支持者包括“纽约时报”、“华盛顿邮报”、“金融时报”、Automattic(WordPress.com&amp；Tumblr)、Gitch、DuckDuckGo、Brave、Mozilla、Disconnect、Abine、Digital Content Next、“消费者报告”(Consumer Reports)和电子前沿基金会(Electronic Frontier Foundation)。\n除了使用支持GPC的Brave的非发行版之外，人们还可以通过使用这些浏览器扩展之一来打开控件。如果没有这些机制之一，GPC网站的顶部将显示一个红点和“未检测到GPC信号”的字样。一旦使用了支持GPC的浏览器或插件，站点的顶部将如下所示：\n由于Do Not Track的失败仍然令人难忘，不能保证GPC的表现会更好，特别是在它与垂涎收集和销售有价值用户数据的广告商竞争的情况下。GPC可能会有一件对它有利的事情，那就是律师的支持。加州司法部长泽维尔·贝塞拉(Xavier Becera)就是其中之一。\nCA DOJ很高兴看到技术界制定全球隐私控制，以促进CCPA和消费者隐私权的发展。#数据隐私#CCPA。\n-Xavier Becera(@AGBecera)2020年10月7日。\n他写道：“这项拟议的标准是迈向有意义的全球隐私控制的第一步，这将使消费者在网上行使隐私权变得简单和容易。”CA DOJ很高兴看到科技界发展一项全球隐私控制，以促进CCPA和消费者隐私权的发展。“", "note_en": "Anyone who remembers Do Not Track—the initiative that was supposed to allow browser users to reclaim their privacy on the Web—knows it was a failure. Not only did websites ignore it, using it arguably made people less private because it made them stick out. Now, privacy advocates are back with a new specification, and this time they’ve brought the lawyers.\n Under the hood, the specification, known as Global Privacy Control, works pretty much the same way Do Not Track did. A small HTTP header informs sites that a visitor doesn’t want their data sold. The big difference this time is the enactment of the Consumer Privacy Act in California and, possibly, the General Data Protection Regulation in Europe, both of which give consumers broad rights over how their private information can be used.\n At the moment, California residents who don’t want websites to sell their data must register their choice with each site, often each time they visit it. That’s annoying and time-consuming. But the  California law specifically contemplates “user-enabled global privacy controls, such as a browser plug-in or privacy setting,” that signal the choice. That’s what the Global Privacy Control—or GPG—does.\n “It’s the goal of this effort to help define a mechanism that could satisfy, initially, CCPA’s requirement for a ‘global privacy control,’” Ashkan Soltani, the privacy researcher who helped lead the initiative, said. But he said GPC “is extensible to apply to other privacy laws, such as GDRP, should policymakers deem it adequate for exercising those rights in those jurisdictions.”\n  So far, the maker of the Brave browser is the only developer that has committed to implementing the control. Brave  said on Wednesday that the control is already in trial in nightly or beta builds of desktop and Android versions and that an iOS implementation is expected once the proposal gets closer to being a standard. Once implemented in the release, the control will be “on by default and unconfigurable.”\n Firefox developer Mozilla, meanwhile, has expressed more tentative support. The browser maker hasn’t indicated it will build the control mechanism into the browser. In a statement accompanying the  GPC announcement, Selena Deckelmann, the VP of Firefox Desktop, said: “Mozilla is pleased to support the Global Privacy Control initiative. People’s data rights must be recognized and respected, and this is a step in the right direction. We look forward to working with the rest of the web standards community to bring these protections to everyone.”\n Other supporters of GPC include The New York Times, The Washington Post, Financial Times, Automattic (WordPress.com &amp; Tumblr), Glitch, DuckDuckGo, Brave, Mozilla, Disconnect, Abine, Digital Content Next, Consumer Reports, and the Electronic Frontier Foundation.\n Besides using a non-release version of Brave that supports GPC, people can also turn on the control by using one of  these browser extensions. Without one of these mechanisms, the top of the  GPC website will display a red dot and the words “GPC signal not detected.” Once a GPC-supported browser or plugin is used, the top of the site will look like this:\n  With the failure of Do Not Track still memorable, there’s no guarantee that GPC will fare any better, particularly as it goes up against advertisers that covet the collection and selling of valuable user data. One thing GPC may have in its favor is the support of lawyers. Among them is California Attorney General Xavier Becerra.\n CA DOJ is encouraged to see the technology community developing a global privacy control in furtherance of the CCPA and consumer privacy rights.  #DataPrivacy  #CCPA\n— Xavier Becerra (@AGBecerra)  October 7, 2020\n “This proposed standard is a first step towards a meaningful global privacy control that will make it simple and easy for consumers to exercise their privacy rights online,” he wrote. “CA DOJ is encouraged to see the technology community developing a global privacy control in furtherance of the CCPA and consumer privacy rights.”", "posttime": "2020-10-11 17:16:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "强制执行,privacy,gpc", "title": "现在，您可以通过一个浏览器勾选来强制执行您的隐私权", "title_en": "Now you can enforce your privacy rights with a single browser tick", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/10/coming-to-a-browser-near-you-a-new-way-to-keep-sites-from-selling-your-data/", "via": "", "real_tags": ["强制执行", "privacy", "gpc"]}, {"category": "", "categoryclass": "", "imagename": "91ef6285ef7f0f14f98b17db778e3615.jpg", "infoid": 1028125, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你买了一辆特斯拉Model3，而不是宝马3系或奥迪A4，你可能会在汽车的整个生命周期内节省15,000美元。这是根据“消费者报告”(Consumer Reports)的一项最新分析得出的结论。该分析调查了电动汽车(包括电动汽车和插电式混合动力汽车)与同类内燃机汽车的总拥有成本。\nCR发现，与汽油相比，更低的维护成本和更低的电价足以抵消与内燃机相比的新Bev更高的购买价格。\n运营和维护成本是使用CR在2019年和2020年进行的年度可靠性调查数据计算的。在收集的其他数据中，调查要求CR成员估计他们在过去12个月的汽车维护和维修成本和行驶里程，以及他们车辆的总里程。(CR会过滤掉12个月内行驶不到2000英里(3200公里)或超过6万英里(96560公里)的异常值，以及维修费用超过2万美元的车辆或里程表上行驶超过20万英里(32.2万公里)的车辆。)。\n正如预期的那样，CR&39；的数据证实了早期BEV和PHEV的工作寿命维护成本确实是ICE汽车成本的一半左右。在前50,000英里(80,500公里)，一辆Bev的维护和维修费用仅为每英里0.012美元；一辆PHEV的维护和维修费用为0.021美元，而洲际电动车的维护和维修费为0.028美元。在接下来的50,000英里内，Bev和PHEV之间的差距将缩小，分别为0.028美元和0.031美元-你可以预计洲际交易所的价格是前者的两倍，或每英里0.06美元。\n由于样本量较小，CR&39；关于维护和维修成本在100,000-200,000英里之间的数据稍弱一些--只有大约200000辆PHEV和55辆BEV，其中大部分是老式的日产Leaf和特斯拉S车型。然而，根据计算，这段时间的成本分别为0.043美元的BEV，0.033美元的PHEV和0.079美元的ICE。终身平均每英里BEV为0.031美元，PHEV为0.030美元，ICE为0.061美元。\n正如你可能预期的那样，驾驶一辆耗能较少的车辆行驶给定单位的距离可以节省大量资金，特别是当这种能源比替代能源更便宜的时候。CR发现，节省的燃料因车辆类别而异，但计算出，与ICE汽车相比，Bev汽车在15,000英里(24,000公里)上将节省790美元。对于SUV来说，节省的费用是1020美元，对于皮卡来说，估计是1310美元。\n另一个有趣的发现是，行驶至少250英里(402公里)的BEV车主将能够在家中完成92%的充电，并且平均每年只需要使用直流快速充电器6次。(CR没有将蓬勃发展的从东海岸到西海岸的紧急长号送货业务考虑在内。)。在俄勒冈州和华盛顿州，改用Bev来节省每英里的钱是最有意义的，这要归功于高油价和廉价的水电价格的结合。\nCR决定研究价格上限为50,000美元的新BEV和PHEV，然后将它们分成五个车辆类别，并与最高效、最畅销和最高评级的ICE汽车进行比较，以及在每个类别中与Bev和PHEV性能相似的ICE汽车(因为电动汽车具有良好的加速性能)。\nCR计算了拥有的前七年的成本，还计算了超过20万英里(32.2万公里)的成本。它基于TrueCar公司的真实数据确定了每辆车的购买价格，并以4.7%的利息假设了一笔为期6年的贷款。对于BEV和PHEV，它从购买价格中减去了适用的IRS税收抵免，但没有考虑任何州或地方的激励措施。它还假设所有车辆的折旧曲线都是统一的，因为它发现，一旦根据税收优惠进行调整，BEV和PHEV的折旧率几乎与ICE车辆相同。\n选择一辆特斯拉Model3而不是宝马330i带来了一生中最大的节省-总共节省了17600美元。选择特斯拉Model Y而不是雷克萨斯跨界车将节省13,400美元。CR发现，与购买一辆本田思域掀背车相比，日产Leaf和雪佛兰Bolt车主在整个汽车生命周期内的花费预计将减少6000美元。或许令人惊讶的是，Bev和ICE跨界车之间的差异最小，福特野马Mach-E与丰田RAV4相比，估计只节省了3000美元。CR还指出，它很难与丰田的RAV4混合动力车竞争，后者既便宜(起价28500美元)，又高效(每加仑行驶40英里或5.9L/100公里)。\n最大的PHEV节省在轿车部门。CR&39；的研究发现，本田Clarity PHEV在整个生命周期内比丰田凯美瑞(Toyota Camry)便宜10600美元，福特Escape PHEV比RAV4节省1万美元。与野马马赫-E一样，丰田RAV4 Prime只能粗略地与RAV4混合动力车(不是插电式)盈亏平衡，甚至是基础的RAV4 LE。\nCR说，当你将BEV和PHEV与加速相似的汽车进行比较时，才会出现真正的便宜货。平均而言，对于第一位车主来说，这相当于10,000美元，在车辆的整个生命周期内，这相当于16,000美元到23,000美元之间。\n最后，CR对这一数据对寻找负担得起的二手电动汽车的人意味着什么持乐观态度。据该公司估计，购买一辆五到七年的电动汽车(而不是五到七年的ICE汽车)节省的资金应该是购买新电动汽车(而不是新的ICE汽车)时节省的钱的两到三倍。然而，它指出，需要一段时间才能有足够数量的电动汽车从第一个车主转移到第二个车主，才能让这一点出现。\nCR负责宣传的副总裁大卫·弗里德曼(David Friedman)表示，汽车业把大部分广告资金都花在了拉动我们的情绪和推广汽油动力汽车的性能上，但未能营销电动汽车、它们将节省的所有资金以及它们带来的性能。如果整个行业开始为每个人制造和营销引人注目的电动汽车，汽车的未来可以也将是电动的。这就是今天消费者所能看到的未来。", "note_en": "If you bought a  Tesla Model 3 instead of a BMW 3 Series or  Audi A4, you&#39;d probably save $15,000 over the total lifetime of the vehicle. That&#39;s according to a new analysis from Consumer Reports, which examines the total cost of ownership for electric vehicles—both battery EVs and plug-in hybrid EVs—versus comparable internal combustion engine vehicles.\n CR found that much lower maintenance costs and the lower price of electricity compared to gasoline more than offsets the higher purchase price of a new BEV compared to an ICE.\n Operating and maintenance costs were calculated using data from annual reliability surveys conducted by CR in 2019 and 2020. Among other data collected, the survey asked CR members to estimate their automotive maintenance and repair costs and driven mileage over the previous 12 months, as well as total mileage of their vehicle. (CR filtered out outliers who drove fewer than 2,000 miles (3,200km) or more than 60,000 miles (96,560km) in 12 months, as well as vehicles with more than $20,000 in maintenance costs or vehicles with more than 200,000 miles (322,000km) on the odometer.)\n  As expected, CR&#39;s data  confirms earlier work—lifetime maintenance costs for BEVs and PHEVs really are about half the cost for an ICE vehicle. For the first 50,000 miles (80,500km), the maintenance and repair costs for a BEV are just $0.012 per mile; for a PHEV it&#39;s $0.021, and $0.028 for ICE. For the next 50,000 miles, the gap between BEV and PHEV closes, at $0.028 and $0.031 respectively—you can expect to pay twice as much, or $0.06 per mile, for ICE.\n CR&#39;s data for maintenance and repair costs between 100,000-200,000 miles is a bit weaker because of a smaller sample size—only about 200 PHEVs and 55 BEVs, mostly older Nissan Leafs and Tesla Models S. However, the costs over this period were calculated at $0.043 for BEVs, $0.033 for PHEVs, and $0.079 for ICE. The lifetime average was $0.031 per mile for BEVs, $0.030 for PHEVs, and $0.061 for ICE.\n As you might expect, there are plenty of savings to be had driving a vehicle that uses less energy to travel a given unit of distance, particularly when that energy is cheaper than the alternative. CR found that fuel savings vary by vehicle class but calculate that a BEV car will save $790 over 15,000 miles (24,000km) compared to an ICE car. For an SUV the savings is $1,020, and for a pickup truck it estimates it to be $1,310.\n Another interesting finding is that owners of BEVs with at least 250 miles (402km) will be able to do 92 percent of their charging at home and will only need to use DC fast chargers an average of six times a year. (CR did not factor in the burgeoning emergency coast-to-coast trombone delivery business into its calculations.) Switching to a BEV to save money per mile makes the greatest sense in Oregon and Washington thanks to a combination of high gas prices and cheap hydroelectricity prices.\n CR decided to look at new BEVs and PHEVs with a price cap of $50,000 and then split them into five vehicle categories, with comparisons to the most-efficient, best-selling, and top-rated ICE vehicles, as well as an ICE vehicle with similar performance to the BEV and PHEV in each category (because EVs have good acceleration).\n  CR calculated costs for the first seven years of ownership, and also costs over 200,000 miles (322,000km). It based the purchase price for each vehicle on real-world data from TrueCar and assumed a six-year loan at 4.7-percent interest. For BEVs and PHEVs, it subtracted the applicable IRS tax credit from the purchase price but did not factor in any state or local incentives. It also assumed a uniform depreciation curve for all of the vehicles, having found that, once adjusted for tax incentives, BEVs and PHEVs depreciate at an almost-identical rate to ICE vehicles.\n Picking a Tesla Model 3 instead of a BMW 330i resulted in the greatest lifetime savings—a total of $17,600. And opting for a Tesla Model Y instead of that Lexus crossover would save $13,400. CR found that  Nissan Leaf and  Chevrolet Bolt owners can expect to spend $6,000 less over the lifetime of their vehicles than if they&#39;d bought a Honda Civic Hatchback. Perhaps surprisingly, the smallest difference is between BEV and ICE crossovers, with a mere $3,000 estimated savings for a  Ford Mustang Mach-E versus a Toyota RAV4. CR also notes that it&#39;s hard to compete with  Toyota&#39;s RAV4 Hybrid, which is both cheap (starting at $28,500) and efficient (40mpg or 5.9l/100km combined).\n The biggest PHEV savings are found in the sedan sector. CR&#39;s study found that a  Honda Clarity PHEV will cost $10,600 less over its lifetime than a  Toyota Camry, and a Ford Escape PHEV will save $10,000 over a RAV4. Like the Mustang Mach-E, the Toyota RAV4 Prime only roughly breaks even with the (not plug-in) RAV4 Hybrid and even the base RAV4 LE.\n The real bargains happen when you compare BEVs and PHEVs to cars with similar acceleration, CR says. On average, this equates to $10,000 for the first owner, and between $16,000 and $23,000 over the total lifetime of a vehicle.\n  Finally, CR is optimistic about what this data means for people looking for an affordable pre-owned EV. By its estimates, the money you save buying a five- to seven-year-old EV (instead of a five- to seven-year-old ICE vehicle) should be two to three times higher than the savings one would realize when buying a new EV (versus a new ICE vehicle). However, it notes that it will take some time before there is a sufficient volume of EVs moving from their first to second owners for this to show up.\n &#34;The auto industry has spent most of its ad money tugging at our emotions and promoting gas-powered vehicle performance, but failed to market EVs, all the money they will save, and the performance they deliver,&#34; says David Friedman, vice president of advocacy at CR. &#34;The future of cars can and will be electric if the entire industry starts making and marketing compelling EVs for everyone. And that’s a future consumers are getting a glimpse of today.&#34;", "posttime": "2020-10-11 17:16:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "报告,electric,节省", "title": "消费者报告发现，拥有一辆电动汽车真的很省钱", "title_en": "Owning an electric car really does save money, Consumer Reports finds", "transed": 1, "url": "https://arstechnica.com/cars/2020/10/owning-an-electric-car-really-does-save-money-consumer-reports-finds/", "via": "", "real_tags": ["报告", "electric", "节省"]}, {"category": "", "categoryclass": "", "imagename": "f40a788a2bd0e9737807db3d3abeb321.jpg", "infoid": 1028124, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OnePlus正在准备推出OnePlus 8T，这是OnePlus 8和OnePlus 8 Pro在2020年第四季度的后续产品，这两款产品都在4月份左右发布。这款手机将于10月14日正式发布，但作为该公司在发布前通常会提供的少量信息的一部分，今天它发布了一段手机的视频，确认了它的外观。\n这段视频只是一个快速的预告片，但它展示了手机背面和新的摄像头模块，以及手机正面的草图。与OnePlus 8 Pro相比，后置摄像头模块要大得多。现在，它不仅容纳了通常的三个相机镜头条，而且还容纳了额外的相机设备。从上到下，右侧的三个圆圈看起来像LED闪光灯、激光自动对焦和第四个相机镜头。在OnePlus8Pro上，这些组件正好与手机背面齐平。虽然手机制造商似乎永远不想给我们提供更厚、电池更大的手机，但更大的摄像头模块是朝着这个方向发展的一种方式，为电池释放了更多的内部空间。\n我们也知道OnePlus 8T的正面会是什么样子，这要归功于OnePlus在操作系统更新中意外地包含了手机的图像。这是常见的带有打孔式摄像头的全屏幕设计，看起来很像OnePlus8Pro。(在这里，我们希望2021年是显示屏下相机之年。)。唯一的主要区别是，OnePlus 8T的显示屏看起来是平面的，而不是像OnePlus 8 Pro那样是弯曲的。弧形显示屏不会给手机增加任何积极的东西；它们只是扭曲屏幕，接收头顶灯的眩光，所以这是一个很大的改进。\n我们也有一个规格表泄露，这要归功于伊桑·阿加瓦尔在Twitter上发布的早期亚马逊列表，显示这款设备有6.5英寸的120 Hz 1080p OLED显示屏，Snapdrag865，8 GB RAM，128 GB存储空间，以及一块4500mAh的电池。对于12 GB的RAM和256 GB的存储，有一个规格更高的选项。在接受PCMag采访时，该公司已经谈到了OnePlus 8T的65W翘曲充电能力；该功能的充电速度应该是目前OnePlus设备上30W充电速度的两倍。在接受PCMag采访时，该公司已经谈到了OnePlus 8T的65W充电能力；该功能的充电速度应该是目前OnePlus设备上30W充电速度的两倍。PCMag传达了OnePlus的速度预期，他说，根据OnePlus的说法，这意味着8T将在10分钟内充电到40%，15分钟内充电到58%，39分钟内充电到100%。在采访中，该公司还承认8T不会进行无线充电。\n一加8T和今年早些时候发布的一加8专业版之间似乎并没有太大的距离。如果不知道这部手机要花多少钱，就很难知道它是怎么回事。由于经济不景气，而且这是一款更便宜的非专业型号，我们希望能有一个低价。", "note_en": "OnePlus is gearing up to launch the OnePlus 8T, a Q4 2020 followup to the OnePlus 8 and  OnePlus 8 Pro, both of which launched around April. The phone is officially launching on October 14, but as part of the company&#39;s usual trickle of information before launch, today it  posted a video of the phone, confirming what it will look like.\n The video is just a quick teaser, but it shows off the back of the phone and the new camera block, along with a sketch of the front of the phone. The back camera block is a lot bigger compared to the OnePlus 8 Pro. Now it houses not only the usual strip of three camera lenses but also the extra camera equipment. From top to bottom, the three circles on the right side look like an LED flash, laser autofocus, and a fourth camera lens. On the OnePlus 8 Pro, these components were just flush with the back of the phone. While phone manufacturers seem to never want to give us thicker phones with bigger batteries, bigger camera blocks are a way to ever-so-slightly move in that direction, freeing up more internal space for battery.\n We also know what the front of the OnePlus 8T will look like, thanks to OnePlus  accidentally including an image of the phone in an OS update. It&#39;s the usual all-screen design with a hole-punch camera, and it looks a lot like the OnePlus 8 Pro. (Here&#39;s hoping that 2021 is the year of the  under-display camera.) The only major difference is that the display of the OnePlus 8T looks flat rather than curved like the sides of the OnePlus 8 Pro. Curved displays don&#39;t add anything positive to a phone; they just distort the screen and pick up glare from overhead lights, so this is a big improvement.\n We also have a spec sheet leak thanks to an  early Amazon listing posted by Ishan Agarwal on Twitter, showing that the device has a 6.5-inch 120Hz 1080p OLED display, a Snapdragon 865, 8GB of RAM, 128GB of storage, and a 4500mAh battery. There&#39;s a higher-spec option for 12GB of RAM and 256GB of storage. The company has already talked about the 65W &#34;Warp Charge&#34; capability of the OnePlus 8T in an interview with  PCMag; the feature is supposed to give double the speed of the 30W charging that ships on current OnePlus devices. PCMag relayed the speed expectations from OnePlus, saying, &#34;According to OnePlus, this means the 8T will charge to 40% in 10 minutes, to 58% in 15 minutes, and to 100% in 39 minutes.&#34; In the interview, the company also admitted that the phone won&#39;t have wireless charging.\n It doesn&#39;t seem like there&#39;s a huge distance between the OnePlus 8T and the OnePlus 8 Pro, which released earlier this year. It&#39;s hard to know what to make of the phone without knowing how much it will cost. With a pandemic-depressed economy and this being a cheaper, non-&#34;Pro&#34; model, we&#39;re hoping for a low price.", "posttime": "2020-10-11 17:15:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,发布,oneplus", "title": "OnePlus在发布前展示OnePlus 8T设计", "title_en": "OnePlus shows off the OnePlus 8T design before launch", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/oneplus-shows-off-the-oneplus-8t-design-before-launch/", "via": "", "real_tags": ["设计", "发布", "oneplus"]}, {"category": "", "categoryclass": "", "imagename": "56b23a5d0a17a804d3fd774d1aeb8c32.jpg", "infoid": 1028123, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，太空部队在佛罗里达州管理的发射任务在东部靶场发生了交通拥堵。在恶劣的天气和一系列地面支持设备的问题中，三枚火箭正在争夺升空的机会。\n其中最大的火箭是德尔塔IV重型助推器，携带的是最有价值的有效载荷-国家侦察办公室的一颗机密卫星，据说耗资远远超过10亿美元。SpaceX公司还准备了两枚火箭，一枚为太空部队携带一颗GPS卫星，另一枚纯商业任务是发射该公司的Starlink卫星。\n前两次任务位于围栏的空军一侧，由美国航天部队第45太空联队管理。第二枚SpaceX火箭搭载着60颗Starlink卫星，矗立在美国国家航空航天局(NASA)围栏的一侧，位于肯尼迪航天中心的发射综合体-39A。\n将三枚火箭放在发射台上，做出了一些艰难的决定。谁应该优先发射呢？在商业发射获得机会之前，军事任务应该有多少机会？既然越来越多的商业火箭来到美国航天港，在21世纪有没有更好的方法来管理发射场？\n美国太空部队在控制空军与太空有关的资产时，正在考虑所有这些问题。太空部队太空运营总监约翰·威廉·杰伊·雷蒙德(John William Jay&34；Raymond)领导的计划之一是“未来的范围”(Range Of The Future)。太空部队正在考虑的增加进入太空的想法之一是相当激进的--将其历史悠久的卡纳维拉尔角设施与美国国家航空航天局(NASA)的肯尼迪航天中心合并为一个单一的太空港管理局。\n在商业太空运输咨询委员会上个月的一次会议上，太空部队的行动和通信主管DeAnna Burt少将表示，美国军方计划很快发出一封信，建立一个跨部门程序，以审查某种形式的国家航天港管理局。\n我们怎样才能达到一个类似的机场结构，在那里我们有一个军事基地机场和跑道，与商业跑道和机场并排坐着？伯特说，回答了规划者面临的一些挑战。我们怎样才能在太空港做同样的事呢？我认为这是我们必须共同努力的地方。\n这里似乎有几股力量在起作用。首先，太空部队认识到，他们在卡纳维拉尔角及其另一个主要航天港-加利福尼亚州范登堡空军基地-正在花费大量资金处理道路和其他基础设施。它还一直在管理几家发射公司的租赁，包括联合发射联盟(United Launch Alliance)、SpaceX、蓝色起源(Blue Origin)、萤火虫航空航天(Firefly AerSpace)和相对论空间(Relative Space)，还有更多公司正在管理中。这些并不被视为军方的核心职能。\n与此同时，航天部队对商业发射部门的创新和灵活性越来越兴奋。在谈到SpaceX重复使用火箭时，伯特说，这绝对是一项令人惊叹的壮举，看到火箭回到发射台并看到它们被重复使用总是令人惊讶的。这是一种很好的成本削减和节约技术。太空部队希望通过放宽进入靶场的条件来支持商业太空部门。\n正在讨论的一个类比是1984年将国家机场和杜勒斯机场从联邦航空管理局转移到新的华盛顿大都会机场管理局。该机构又以罗纳德·里根(Ronald Reagan)总统的名字重新命名为国家机场(National)，然后找到私人投资，对机场进行现代化改造，以满足日益增长的商业需求。许多问题仍然存在，比如谁将管理佛罗里达州的一个联合太空港，谁将决定哪些任务优先，等等。这些都将受到谈判的影响，可能都会化为乌有。\n但显然，改变是可能的。太空部队的主要目标是执行其任务，包括快速可靠地进入太空。如果这意味着，就像它过去所做的那样，军方必须拥有和运营发射场的每一个方面，它会这样做的。但太空部队和伯特向更广泛的太空社区发出的信号是，如果有更好、更有效的方式来做这件事，减少新兴商业参与者的繁文缛节，他们愿意倾听。\n美国国家航空航天局(NASA)也愿意倾听吗？航天局局长吉姆·布里登斯廷(Jim Bridenstine)同意了。\n他告诉Ars，我很高兴看到潜在的合并等大创意被提出。这一点，以及其他雄心勃勃的未来概念都应该得到应有的考虑。然而，这样的合并建议需要大量的工作和努力。目前，NASA将继续专注于提高我们现有发射设施的效率和能力。我们在KSC的团队已经完成了一项伟大的工作，创建了一个繁荣的太空港，既满足了NASA的需求，也满足了商业需求。\n佛罗里达航天港的另一个参与者是该州的经济发展机构--佛罗里达太空公司。该集团负责政府和对外关系的副总裁戴尔·凯查姆(Dale Ketcham)也对简化寻求从佛罗里达州成立的公司的运营感兴趣。\n凯查姆说：我们知道，要实现各方真正蓬勃发展所需的治理简单性，这将是一场艰难而复杂的谈判。对话越早开始越好。“", "note_en": "Last month, the Space Force had a traffic jam to manage at the Eastern Range for launches it manages in Florida. Three rockets were vying for opportunities to liftoff amid poor weather and a slew of issues with ground support equipment.\n The largest of the rockets, a Delta IV Heavy booster, carried the most valuable payload—a classified satellite for the National Reconnaissance Office said to cost well north of $1 billion. SpaceX also had two rockets ready to go, one carrying a GPS satellite for the Space Force and another with a purely commercial mission to launch the company&#39;s Starlink satellites.\n  The first two missions were located on the Air Force side of the fence, which is managed by the US Space Force&#39;s 45th Space Wing. The second SpaceX rocket, carrying 60 Starlink satellites, stood on the NASA side of the fence, at Launch Complex-39A at Kennedy Space Center.\n Having three rockets on launch pads made for some difficult decisions. Who should have priority to launch? And how many chances should the military missions get before the commercial launch gets an opportunity? And is there a better way to manage launch ranges in the 21st century now that more and more commercial rockets are coming to US spaceports?\n The US Space Force is considering all these questions as it takes control of Air Force assets related to space. One of the initiatives being led by John William &#34;Jay&#34; Raymond, the chief of Space Operations for the Space Force, is the &#34;Range of the Future.&#34; And one of the ideas the Space Force is considering to increase access to space is pretty radical—merging its historic Cape Canaveral facility with NASA&#39;s Kennedy Space Center under a single spaceport authority.\n  During  a meeting of the Commercial Space Transportation Advisory Committee last month, the director of operations and communications for the Space Force, Major General DeAnna Burt, said the US military planned to soon issue a letter that would establish an interagency process to look at some sort of national spaceport authority.\n &#34;How do we get to a similar airport structure where we have a military base airport and runway sitting side by side with the commercial runway and airport?&#34; Burt said, addressing some of the challenges facing planners. &#34;How do we get to that same thing in the spaceport? I think together that&#39;s what we&#39;re going to have to cooperatively work on.&#34;\n A couple of forces seem to be at play here. First, the Space Force recognizes that it is spending a lot of money dealing with roads and other infrastructure at Cape Canaveral and its other major spaceport, Vandenberg Air Force Base in California. It has also been managing leases for several launch companies, including United Launch Alliance, SpaceX, Blue Origin, Firefly Aerospace, and Relativity Space, with more on the way. These are not seen as core functions of the military.\n  At the same time, the Space Force is becoming increasingly excited about the innovation and agility of the commercial launch sector. On SpaceX reusing rockets, Burt said, &#34;That is absolutely an amazing feat, and it&#39;s always amazing to watch rockets returned back to the pad and to be seeing them being reused. It&#39;s been a great cost cutting and saving technique.&#34; The Space Force would like to support the commercial space sector by easing their access to the range.\n One analogy being discussed is the transfer of National and Dulles Airports from the Federal Aviation Administration in 1984 to the new Metropolitan Washington Airports Authority. This agency in turn renamed National after President Ronald Reagan and then found private investments to modernize airports for growing commercial demands. Lots of questions remain about who would manage a combined spaceport in Florida, who would determine what missions have priority, and so on. These would all be subject to negotiation, and it may all come to naught.\n  But clearly, change is possible. The primary goal of the Space Force is to execute its mission, which includes getting into space quickly and reliably. If that means, as it has done in the past, that the military has to own and operate every facet of a launch site, it will. But what the Space Force and Burt have signaled to the broader space community is that if there&#39;s a better, more efficient way to do this, which cuts red tape for emerging commercial players, they&#39;re willing to listen.\n Would NASA be willing to listen as well? The space agency administrator, Jim Bridenstine, said yes.\n &#34;I’m glad to see big ideas being proposed such as a potential merger,&#34; he told Ars. &#34;This, and other ambitious concepts for the future should all be given due consideration. However, such a proposed merger would require a great deal of work and effort. For the time being, NASA will continue to focus on enhancing the efficiencies and capabilities at our existing launch facility. Our team at KSC has already done a great job creating a thriving spaceport to serve both NASA and commercial needs.&#34;\n  Another player at the Florida spaceport is the state&#39;s economic development agency, Space Florida. Dale Ketcham, that group&#39;s vice president of government and external relations, is also interested in streamlining operations for companies seeking to launch from Florida.\n &#34;We know it will be a difficult and complex negotiation to achieve the simplicity of governance all parties need to truly thrive,&#34; said Ketcham. &#34;The sooner that dialogue can begin, the better.”", "posttime": "2020-10-11 17:15:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "航天部队,space,太空", "title": "航天部队考虑将卡纳维拉尔角与肯尼迪航天中心合并", "title_en": "Space Force considers merging Cape Canaveral with Kennedy Space Center", "transed": 1, "url": "https://arstechnica.com/science/2020/10/space-force-considers-merging-cape-canaveral-with-kennedy-space-center/", "via": "", "real_tags": ["航天部队", "space", "太空"]}, {"category": "", "categoryclass": "", "imagename": "977da9b62d3ce5f44d6030b9abbc9c58.jpg", "infoid": 1028122, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在IT行业工作通常意味着找到创造性的方法来充分利用你所面临的局面。无论是解决不是你造成的问题，还是适应领导层未能考虑到的变化，这都是为了弄清楚如何在飞机飞行期间继续维修这架众所周知的飞机-而2020年并没有让任何人的事情变得更容易。\n为了给疲惫的IT决策者提供一点喘息之机--也因为我们这些极客会不择手段地谈论工作！--ARS将于下周组织一场实况转播的圆桌讨论会，由ARS IT/信息安全编辑荣誉退休人员肖恩·加拉格尔主演，届时他将与我们精心挑选的专家小组坐下来，讨论企业(以及他们内部的ITDM)如何围绕远程工作、流行病以及目前世界上正在发生的其他该死的事情等新现实，调整流程和战略。\nMarcis J.Carey，企业架构师，ReliaQuest。马库斯在渗透测试、事件响应和数字取证等联邦机构(如NSA、DC3、DIA和DARPA)工作了20多年。\n凯蒂·穆苏里斯，卢塔安全公司的首席执行官。拥有20多年专业网络安全经验的计算机黑客，是iso 29147(关于漏洞披露)、iso 30111(关于漏洞处理过程)和iso 27034(关于安全开发)的合著者和合著者。\n埃德·斯科迪斯(Ed Skoudis)，SANS讲师兼研究员，Counter Hack创始人。教育署已向超过一万二千名网络保安专业人士教授网络事故应变及先进渗透测试技术。\n我们将从今天开始，也就是10月15日星期四，东部夏令时下午2点(请看其他时区)一周后开始，我们将在Zoom上转播这一活动。如果您厌倦了Zoom会议，我们也会在Twitter上进行直播。\n如果您想要提前提交您可能希望小组讨论的问题，最好的方法是注册参加会议，并将您的问题放入队列中，这样我们就可以看到您的问题。(我也会密切关注这篇文章的讨论线索，以收获入门问题。)。\n我们期待着在那里见到你--把它想象成与ARS一起进行的团体IT治疗，每个人都被邀请了！", "note_en": "Working in IT often means finding creative ways to make the best of a situation you&#39;ve been handed. Whether it&#39;s fixing problems you didn&#39;t cause or adapting to changes that leadership failed to account for, it&#39;s all about figuring out how to keep repairing the proverbial airplane while it&#39;s flying—and 2020 hasn&#39;t really made things any easier for anyone.\n To provide a bit of a respite for weary IT decision makers—and also because we&#39;re geeks who will take any excuse to talk shop!—Ars is organizing a livestreamed roundtable discussion next week starring Ars IT/infosec Editor Emeritus Sean Gallagher, where he&#39;ll sit down with our hand-picked panel of experts to discuss the ways in which businesses (and the ITDMs within them) are adapting their processes and strategies around the new reality of remote work, pandemic, and whatever the hell else is happening in the world right now.\n   Marcis J. Carey, Enterprise Architect, ReliaQuest. Marcus has spent his more than 20-year career working in penetration testing, incident response, and digital forensics with federal agencies such as the NSA, DC3, DIA, and DARPA.\n Katie Moussouris, CEO of LutaSecurity. A computer hacker with more than 20 years of professional cybersecurity experience and co-author and co-editor of  ISO 29147 (on vulnerability disclosure),  ISO 30111 (on the vulnerability handling processes), and  ISO 27034 (on secure development).\n Ed Skoudis, SANS Instructor &amp; Fellow, and Counter Hack Founder. Ed has taught cyber incident response and advanced penetration testing techniques to more than 12,000 cybersecurity professionals.\n  We&#39;ll be getting started a week from today on Thursday October 15 at 2pm Eastern Daylight Time ( see other time zones), and we&#39;ll be broadcasting the event on Zoom. If you&#39;re sick of Zoom meetings, we&#39;ll also be livestreaming on Twitter.\n If you&#39;d like to submit questions in advance that you might like the panel to address, the best way to do it is to  register for the meeting and stuff your question into the queue there so we can see it. (I&#39;ll also be keeping an eye on this article&#39;s discussion thread to harvest starter questions.)\n We&#39;re looking forward to seeing you there—think of it like group IT therapy with Ars, and everyone&#39;s invited!", "posttime": "2020-10-11 17:15:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "应该,online", "title": "我们将在10月15日举行在线IT圆桌会议，您应该来参加", "title_en": "We’re holding an online IT roundtable on October 15, and you should come", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/join-sean-gallagher-and-guests-on-october-15-for-an-it-roundtable-talk/", "via": "", "real_tags": ["应该", "online"]}, {"category": "", "categoryclass": "", "imagename": "80a35651a0923b7d90e3d69aadd782c4.png", "infoid": 1028120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在今天举行的2020年AMD游戏盛会上，Red团队宣布了它在台式机CPU领域的下一件大事--由Zen 3驱动的Ryzen 5xxx系列。活动很简短-从开始到结束只有半个小时-AMD宣布了创纪录的内部基准结果。\nAMD首席执行官丽莎·苏(Lisa Su)、首席技术官马克·纸张大师(Mark Papermaster)和技术营销总监罗伯特·哈洛克(Robert Hallock)轮流称赞了新齿轮的功能。这三人描绘了一幅对竞争对手英特尔施加更多无情压力的图景。根据AMD的测试，与AMD和Intel目前领先的台式机处理器相比，原始性能、能效、IPC和单线程性能都有显著提高。\n根据首席技术官Mark Papermaster的说法，Zen 3-下个月Ryzen的产品阵容所基于的架构-已经开发了五年多。Zen 3采用新的统一8核复合体，允许群集中的每个核心直接访问L3缓存。Papermaster宣称，与Zen 2相比，新架构的每时钟周期指令(IPC)提升了19%。\n营销总监罗伯特·哈洛克采取了更直接的方法，他使用公司内部基准测试生成的图表显示，Ryzen 9 5900X同时摧毁了AMD和英特尔CPU。图表显示，与Ryzen 9 3900XT相比，Ryzen 9 5900X在105W TDP下提供了平均26%的游戏提升(以每秒帧数衡量)。\n与英特尔的125W i9-10900K相比，Ryzen 95900X&#39；的游戏提升幅度要小得多，但仍然几乎是一致的--“第五战场”显示5900X的损失为负3%，其他10款游戏的胜率都在1%到21%之间。\n最后，哈洛克展示了5900X从英特尔手中夺走了单线程性能的桂冠：5900X在单线程Cinebench R20上的得分为631，比i9-10900K&#39；544的得分有了很大的提升。\n对于那些真正关心散热和电源的人来说，我们还应该注意到，直接将i9-10900K&39；的125W TDP与AMD的105W TDPS进行比较可能会产生相当大的误导。尽管所述TDP之间的差异只有20%，但在运行Cinebench R20基准测试时，我们看到i9-10900K系统和Ryzen 9 3900XT系统之间持续的全系统功耗相差60%(336W与210W)。我们还看到桌面空闲功耗降低了30%，尽管Ryzen系统拥有独立的RTX 2060 GPU，而Intel系统仅在内部GPU上运行。\n在展示了5900X的内部基准在英特尔的竞争中夺得了所有剩余的桂冠之后-尽管正如哈洛克讽刺地指出的那样，我们知道你会等待基准-苏再次登上了舞台。她宣布，5900X不是新阵容中最高端的部分。售价800美元的Ryzen 9 5950X提供了比550美元5900X更多的内核和线程，以及更高的助推时钟，同时保持了相同的105W TDP。\n在演示后期介绍5950X最终解释了为什么AMD将5900X与3900XT进行比较，而不是将其与其速度最快的上一代台式机CPU进行比较-因为这一荣誉是为5950X保留的，它在3950X和英特尔的i9-10900K中占据主导地位。\nRyzen 9 5900X也没有长时间保持其单线程性能的桂冠-AMD表示，5950X的Cinebench R20 1T达到了640，略高于5900X已经打破纪录的631。\n苏还简短地调侃了一款RADEON 6000系列GPU，亲切地昵称为Big Navi，以及60+FPS 4K AAA游戏的短片。新的图形处理器还没有发布日期和官方规格，但是我们会在10月28日找到更多关于AMD10月28的下一款游戏“发布会”的信息。\nAMD表示，Ryzen 5000 CPU将于今天发货给OEM合作伙伴，并将于11月5日开始在全球上市。", "note_en": "At today&#39;s AMD Gaming Event 2020, Team Red announced its next big thing in desktop CPUs—the Zen 3 powered Ryzen 5xxx series. The event was brief—only a half hour from start to finish—with AMD announcing record-breaking internal benchmark results.\n AMD CEO Lisa Su, CTO Mark Papermaster, and Director of Technical Marketing Robert Hallock took turns extolling the new gear&#39;s features. The trio paints a picture of more unrelenting pressure being laid on competitor Intel. According to AMD testing, raw performance, power efficiency, IPC, and single-threaded performance all increased markedly compared to current leading desktop processors from both AMD and Intel.\n    According to CTO Mark Papermaster, Zen 3—the architecture next month&#39;s Ryzen lineup is based on—has been in development for over five years. Zen 3 features a new unified 8-core complex that allows each core in the cluster direct access to L3 cache. Papermaster declared that the new architecture sees a 19-percent instructions per clock cycle (IPC) uplift when compared with Zen 2.\n Marketing Director Robert Hallock took the more direct approach, using charts generated from in-company benchmarks to show the Ryzen 9 5900X demolishing both AMD and Intel CPUs. The charts show Ryzen 9 5900X, at 105W TDP, delivering an average 26-percent gaming uplift (as measured in frames per second) when compared to Ryzen 9  3900XT.\n Ryzen 9 5900X&#39;s gaming uplift compared to Intel&#39;s 125W  i9-10900K was much smaller but still nearly unanimous—Battlefield V showed a minus-3-percent loss for the 5900X, with each of the other 10 games showing wins ranging from 1 percent to 21 percent.\n Finally, Hallock showed the 5900X taking the single-threaded performance crown away from Intel: the 5900X scores 631 on single-threaded Cinebench R20, a significant boost from the i9-10900K&#39;s score of 544.\n For those who really care about thermals and power, we should also note that directly comparing the i9-10900K&#39;s 125W TDP to AMD&#39;s 105W TDPs can be pretty misleading. Although the difference between stated TDP is only 20 percent, we saw a 60-percent difference—336W vs 210W—in sustained, at-the-wall full-system power draw between an i9-10900K system and a Ryzen 9 3900XT system while running Cinebench R20 benchmarks. We also saw 30-percent lower desktop idle power draw, despite the Ryzen system having a discrete RTX 2060 GPU and the Intel system running on internal GPU only.\n    After showing internal benchmarks of the 5900X taking every remaining crown from the Intel competition—although, as Hallock wryly noted, &#34;we know you&#39;re going to wait for benchmarks&#34;—Su took the stage again. She announced that the 5900X is not the highest-end part in the new lineup. The $800 Ryzen 9 5950X offers more cores and threads and a higher boost clock than the $550 5900X while maintaining the same 105W TDP.\n    The introduction of the 5950X late in the presentation finally explains why AMD was comparing the 5900X to the 3900XT, not to its fastest previous-generation desktop CPU—because that honor was reserved for the 5950X, which dominates the 3950X and Intel&#39;s i9-10900K alike.\n The Ryzen 9 5900X didn&#39;t get to keep its single-threaded performance crown for long, either—AMD says the 5950X pulled a Cinebench R20 1T of 640, a little higher than the 5900X&#39;s already record-breaking 631.\n Su also briefly teased a Radeon 6000 series GPU, affectionately nicknamed &#34;Big Navi,&#34; along with short clips of 60+ FPS 4K triple-A gaming. The new GPU does not yet have a release date or official specifications, but we&#39;ll find out more on AMD&#39;s next gaming launch event on October 28.\n AMD says that Ryzen 5000 CPUs are shipping to OEM partners today, and will be globally available starting November 5.", "posttime": "2020-10-11 17:14:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新款,zen,amd", "title": "AMD新款Zen 3 Ryzen台式机CPU将于11月5日上市", "title_en": "AMD’s new Zen 3 Ryzen desktop CPUs arrive November 5", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/amds-new-zen-3-ryzen-desktop-cpus-arrive-november-5/", "via": "", "real_tags": ["新款", "zen", "amd"]}, {"category": "", "categoryclass": "", "imagename": "4ae6d5b381884bd7e0afda0ead1b9842.jpg", "infoid": 1028118, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "维亚康姆哥伦比亚广播公司(ViacomCBS)今天宣布，在“星际迷航：旅行者”中饰演凯瑟琳·詹威船长的女演员凯特·马尔格鲁将重返该系列，在即将上映的“星际迷航：神童”动画片中再次饰演角色。\n穆尔格鲁在今年全虚拟纽约动漫展的“星际迷航”座谈会结束时突然出现，宣布了这一令人惊讶的消息。我把我所有的才华都投入到了“珍妮薇船长”中，我迫不及待地想给她赋予我以前从未做过的细微差别，穆尔格鲁说。能够向这些年轻人介绍一个几十年来提升了世界的想法是多么令人兴奋。再次掌舵将以一种新的方式让我深感欣慰。\n执行制片人亚历克斯·库兹曼(Alex Kurtzman)对上世纪90年代首位女性星际迷航机长选角时困扰她的性别歧视进行了侧面抨击，他说，珍妮威机长的标准与她的前任不同。她被要求体现一种非人的完美水平，才能被怀疑者接受为“足够好”，但她向所有人展示了什么是真正的杰出。我们想不出比她更好的船长来激励尼克洛迪恩的下一代梦想家了。\n穆尔格鲁在1995年至2001年播出的《星际迷航：旅行者》的所有七季中都饰演珍妮薇。她最近在“星际迷航”中的银幕亮相是在2002年的电影“星际迷航：复仇女神”中客串饰演海军上将珍妮。\n“天才”是第一部明确面向年轻观众的现代“星际迷航”系列，将于2021年在尼克洛迪恩上映。据维亚康姆哥伦比亚广播公司(ViacomCBS)报道，这部电视剧讲述了一群无法无天的青少年发现了一艘被遗弃的星际舰队飞船，并用它来寻找冒险、意义和拯救。\n这部电脑动画系列将是继“星际迷航：发现”、“加入皮卡德”、“下层甲板”以及仍在制作中的“奇异新世界”之后的第四部“星际迷航”衍生剧。\n*星际迷航：动画片系列在1973年和1974年以周六早上的卡通片的形式上映；从那时起，所有的星际迷航或多或少都是针对成年人的。包括下层甲板，它只试图接触到我们内心12岁的自己，而不是字面上的孩子。", "note_en": "Actress Kate Mulgrew, who played Captain Kathryn Janeway in  Star Trek: Voyager, is returning to  the franchise to reprise her role in the upcoming  Star Trek: Prodigy animated series, ViacomCBS announced today.\n Mulgrew popped in to make made the surprise announcement during the end of a  Star Trek panel at this year&#39;s all-virtual New York Comic Con. &#34;I have invested every scintilla of my being in Captain Janeway, and I can’t wait to endow her with nuance that I never did before,&#34; Mulgrew said. &#34;How thrilling to be able to introduce to these young minds an idea that has elevated the world for decades. To be at the helm again is going to be deeply gratifying in a new way for me.&#34;\n Executive Producer Alex Kurtzman leveled a sideways blow at the sexism that dogged the first female  Star Trek captain when she was cast in the 1990s, saying, &#34;Captain Janeway was held to a different standard than her predecessors. She was asked to embody an inhuman level of perfection in order to be accepted as &#39;good enough&#39; by the doubters but showed them all what it means to be truly outstanding. We can think of no better captain to inspire the next generation of dreamers on Nickelodeon, than she.&#34;\n  Mulgrew starred as Janeway in all seven seasons of  Star Trek: Voyager, running from 1995 through 2001. Her most recent on-screen appearance in  Star Trek was a cameo as Admiral Janeway in the 2002 film  Star Trek: Nemesis.\n Prodigy, the first modern*  Star Trek series to be explicitly targeted to a young audience, will be coming to Nickelodeon at some point in 2021. According to ViacomCBS, the show &#34;follows a group of lawless teens who discover a derelict Starfleet ship and use it to search for adventure, meaning, and salvation.&#34;\n The computer-animated series will be the fourth spin-off  Star Trek series to follow the launch of  Star Trek: Discovery, joining   Picard,   Lower Decks, and the still in-production   Strange New Worlds.\n *Star Trek: The Animated Series  ran as a Saturday morning cartoon in 1973 and 1974; all Treks  since then have been aimed more-or-less at grown-ups. Including Lower Decks , which only tries to reach our inner  12-year-old selves, rather than literal children.", "posttime": "2020-10-11 17:13:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "星际,mulgrew", "title": "凯特·穆尔格鲁在“星际迷航：神童”中饰演珍妮薇船长", "title_en": "Kate Mulgrew returning as Capt. Janeway in Star Trek: Prodigy", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/captain-janeway-and-kate-mulgrew-coming-back-to-star-trek-in-2021/", "via": "", "real_tags": ["星际", "mulgrew"]}, {"category": "", "categoryclass": "", "imagename": "a7d769b76b9a82e23b8adfc5f40374a3.jpg", "infoid": 1028117, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Dealmaster的头条新闻是关于亚马逊各种订阅和服务的几个提前黄金日交易。与大多数Prime Day优惠一样，你必须是Prime会员才能使用，但如果是这样的话，你目前可以花30美元购买亚马逊Kindle无限电子书服务6个月的服务，或者以100美元的价格抢购其Audible Premium Plus有声阅读服务第一年的Grab。折扣分别是30美元和50美元。\n对于不熟悉的人来说，Kindle无限阅读器是一种可以随便吃的订阅方式，只需支付一个月的费用，就可以访问一个大型的电子书库。它可以在Kindle电子书阅读器上使用，也可以只通过亚马逊的Kindle应用程序使用。与此同时，Audible Premium Plus为有声读物、播客和原创节目提供了类似的设置。亚马逊最近推出了一项类似的订阅计划，名为Audible Plus，每月收费8美元，不过涵盖的内容选择较少。此交易还包括12个预付图书积分，可用于永久购买图书。\n在任何情况下，请注意，如果您冒险一试，这两种订阅都将被设置为自动续订，因此请密切关注，以避免任何不必要的费用。在其他地方，Dealmaster也有各种第一方开关游戏，PlayStation独家游戏对马的Ghost，各种iPad，戴尔显示器等。请看一下我们下面的完整摘要。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。\n注意：ARS Technica可能会通过会员计划从本帖子上的链接中获得销售补偿。\n仅限Prime：Audible Premium Plus，12个月会员+12个月预付电子书积分，在亚马逊支付99.50美元(通常为150美元)。\n仅限Prime+新Subs：亚马逊音乐无限，亚马逊4个月会员仅需0.99美元(非Prime会员3个月会员-通常为30美元)。\n100美元的Xbox礼品卡(数字)，在Newegg购买90美元(使用代码：93XPV37-通常是100美元)。\n27英寸戴尔U2721DE显示器-2560x1440，60 Hz，IPS+价值434.99美元的戴尔电子礼品卡(通常为470美元)。\nVAVA-UC071 7合1 USB-C集线器-92W USB-C PD，3x USB 3.0，microSD，SD，HDMI(4K@30 Hz)，亚马逊售价19.99美元(Clip 25%优惠券-通常为25美元)。\n27英寸戴尔S2721Q智能显示器-3840x2160，60 Hz，IPS，免费同步，戴尔和亚马逊的售价约为314.99美元(通常为400美元)。\n27英寸戴尔U2721DE显示器-2560x1440，60 Hz，IPS+价值434.99美元的戴尔电子礼品卡(通常为470美元)。\n34.14英寸Dell UltraSharp U3419W曲面显示器-3440x1440，60 Hz，IPS，亚马逊售价705美元(通常为750美元)。\nCritical MX500(500 GB)3D NAND SATA 2.5英寸内置固态硬盘，亚马逊售价57.99美元(通常为65美元)。\n《塞尔达传奇：野性呼吸》(Switch)在亚马逊和百思买售价44.99美元(通常为50美元)。\n驴港国家：热带冷冻服务(Switch)在亚马逊(Amazon)和百思买(Best Buy)的售价为44.99美元(通常为50美元)。\nXbox Live Gold Only：The External Worlds(XB1，数字)在微软售价23.99美元(通常为30美元)。\n金属齿轮实心V：PlayStation Store售价7.99美元(通常为20美元)的最终体验(PS4，数字)。\nMadden NFL 21(XB1，DIGITAL)在微软售价41.99亿美元(包括免费的下一代升级-通常是60美元)。\n罗技G305 LightSpeed无线游戏鼠标在亚马逊和百思买(通常为50美元)售价39.99美元。\n100美元的Xbox礼品卡(数字)，在Newegg购买90美元(使用代码：93XPV37-通常是100美元)。\n仅限Prime：Amazon Echo Show 5智能显示屏+Blink Mini 1080P室内安全摄像头在亚马逊售价49.99美元(通常为80美元)。\n在谷歌商店，谷歌Chromecast与谷歌电视频道(2020款)+Netflix Standard 6个月会员仅需89.99美元(通常为128美元)。\nSanDisk Extreme(1TB，最新型号)便携式固态硬盘-USB-C，USB3.2 Gen 2在亚马逊售价169.99美元(通常为240美元)。\nTP-Link Kasa HS300智能Wi-Fi配电盘-6倍交流，3倍USB-A，在亚马逊售价60.59亿美元(剪辑15美元优惠券-通常为70美元)。\nTP-Link Kasa HS200智能Wi-Fi灯开关在亚马逊商店售价14.99美元(剪辑2美元优惠券-通常为18美元)。\n仅限Prime：Audible Premium Plus，12个月会员+12个月预付电子书积分，在亚马逊支付99.50美元(通常为150美元)。\n仅限Prime+新Subs：亚马逊音乐无限，亚马逊4个月会员仅需0.99美元(非Prime会员3个月会员-通常为30美元)。\nRAVPower RP-PC058-QI无线充电器-10W Galaxy/7.5W iPhone+AC适配器，RAVPower售价12.59美元(使用代码：BACK60--正常情况下售价23美元)。\n仅限Prime：AUKEY Omnia PA-B3和USB-C壁式充电器-总计65W，65W USB-C PD，USB-A，GAN在亚马逊售价24.99美元(剪辑5美元优惠券-通常为38美元)。\nVAVA-UC071 7合1 USB-C集线器-92W USB-C PD，3x USB 3.0，microSD，SD，HDMI(4K@30 Hz)，亚马逊售价19.99美元(Clip 25%优惠券-通常为25美元)。\nAnker PowerExpand+7合1 USB-C HUB-85W USB-C PD，USB-C，2x USB 3.0，microSD，SD，HDMI(4K@30 Hz)，亚马逊售价25.49亿美元(通常为38美元)。", "note_en": "Today&#39;s Dealmaster is headlined by a handful of  early Prime Day deals on various Amazon subscriptions and services. Like most Prime Day offers, you have to be a Prime member to take advantage, but if that&#39;s the case, you can currently grab  six months of Amazon&#39;s Kindle Unlimited e-book service for $30 or grab  the first year of its Audible Premium Plus audiobook service for $100. Those are $30 and $50 discounts, respectively.\n For the unfamiliar, Kindle Unlimited is an all-you-can-eat subscription that gives access to a large library of e-books for one monthly fee. It can be used on Kindle e-book readers or just through Amazon&#39;s Kindle app. Audible Premium Plus, meanwhile, provides a similar setup for audiobooks, podcasts, and original shows. Amazon  recently introduced a similar subscription plan called Audible Plus  that costs $8 a month, though that covers a smaller selection of content. This deal also includes 12 book credits upfront, which can be used to purchase a title permanently.\n In any event, note that both subscriptions will be set to renew automatically if you take the plunge, so keep an eye out to avoid any unwanted charges. Elsewhere, the Dealmaster also has deals on various first-party Switch games, the PlayStation exclusive   Ghost of Tsushima, various iPads, Dell monitors, and more. Have a look at our full rundown below.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n  Prime only:  Audible Premium Plus 12-month membership + 12 upfront e-book credits for  $99.50 at Amazon (normally $150).\n Prime + new subs only:  Amazon Music Unlimited 4-month membership for  $0.99 at Amazon (3-month membership for non-Prime members - normally $30).\n   $100 Xbox Gift Card (digital) for  $90 at Newegg (use code:  93XPV37 - normally $100).\n  27-inch Dell U2721DE monitor - 2560x1440, 60Hz, IPS + $100 Dell e-gift card for  $434.99 at Dell (normally $470).\n  Vava VA-UC071 7-in-1 USB-C hub - 92W USB-C PD, 3x USB 3.0, microSD, SD, HDMI (4K@30Hz) for  $19.99 at Amazon ( clip 25% coupon - normally $25).\n   27-inch Dell S2721Q monitor - 3840x2160, 60Hz, IPS, FreeSync for  $314.99 at Dell and  Amazon (normally $400).\n 27-inch Dell U2721DE monitor - 2560x1440, 60Hz, IPS + $100 Dell e-gift card for  $434.99 at Dell (normally $470).\n 34.14-inch Dell UltraSharp U3419W curved monitor - 3440x1440, 60Hz, IPS for  $705 at Amazon (normally $750).\n Crucial MX500 (500GB) 3D NAND SATA 2.5-inch internal SSD for  $57.99 at Amazon (normally $65).\n   The Legend of Zelda: Breath of the Wild (Switch) for  $44.99 at Amazon and  Best Buy (normally $50).\n  Donkey Kong Country: Tropical Freeze (Switch) for  $44.99 at Amazon and  Best Buy (normally $50).\n       Xbox Live Gold only:   The Outer Worlds (XB1, digital) for  $23.99 at Microsoft (normally $30).\n       Metal Gear Solid V: The Definitive Experience (PS4, digital) for  $7.99 at PlayStation Store (normally $20).\n  Madden NFL 21 (XB1, digital) for  $41.99 at Microsoft (includes free next-gen upgrade - normally $60).\n   Logitech G305 Lightspeed wireless gaming mouse for  $39.99 at Amazon and  Best Buy (normally $50).\n $100 Xbox Gift Card (digital) for  $90 at Newegg (use code:  93XPV37 - normally $100).\n   Prime only:  Amazon Echo Show 5 smart display + Blink Mini 1080p indoor security cam for  $49.99 at Amazon (normally $80).\n Google Chromecast with Google TV (2020 model) + Netflix Standard 6-month membership for  $89.99 at Google Store (normally $128).\n SanDisk Extreme (1TB, latest model) portable SSD - USB-C, USB 3.2 Gen 2 for  $169.99 at Amazon (normally $240).\n    TP-Link Kasa HS300 smart Wi-Fi power strip - 6x AC, 3x USB-A for  $60.59 at Amazon ( clip $15 coupon - normally $70).\n TP-Link Kasa HS200 smart Wi-Fi light switch for  $14.99 at Amazon ( clip $2 coupon - normally $18).\n   Prime only:  Audible Premium Plus 12-month membership + 12 upfront e-book credits for  $99.50 at Amazon (normally $150).\n Prime + new subs only:  Amazon Music Unlimited 4-month membership for  $0.99 at Amazon (3-month membership for non-Prime members - normally $30).\n RAVPower RP-PC058 Qi wireless charger - 10W Galaxy/7.5W iPhone + AC adapter for  $12.59 at RAVPower (use code:  BACK60 - normally $23).\n Prime only:  Aukey Omnia PA-B3 USB-C wall charger - 65W total, 65W USB-C PD, USB-A, GaN for  $24.99 at Amazon ( clip $5 coupon - normally $38).\n Vava VA-UC071 7-in-1 USB-C hub - 92W USB-C PD, 3x USB 3.0, microSD, SD, HDMI (4K@30Hz) for  $19.99 at Amazon ( clip 25% coupon - normally $25).\n Anker PowerExpand+ 7-in-1 USB-C hub - 85W USB-C PD, USB-C, 2x USB 3.0, microSD, SD, HDMI (4K@30Hz) for  $25.49 at Amazon (normally $38).", "posttime": "2020-10-11 17:13:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,prime,usb", "title": "提前获得Kindle无限制和可听订阅的黄金日优惠", "title_en": "Get early Prime Day deals on Kindle Unlimited and Audible subscriptions", "transed": 1, "url": "https://arstechnica.com/staff/2020/10/early-prime-day-deals-kindle-unlimited-audible-subscriptions/", "via": "", "real_tags": ["获得", "prime", "usb"]}, {"category": "", "categoryclass": "", "imagename": "65177c3bf7aff949e37098512fd1b722.jpg", "infoid": 1028116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "物理学家通过探测引力波来寻找合并的黑洞和其他类似的宇宙事件，从中他们可以收集到有价值的信息，比如先驱黑洞的质量，以及合并产生的最后一个更大的黑洞的质量。现在，一组科学家发现了来自超级计算机模拟的证据，这些波可能还会编码合并黑洞的形状，因为它们最终形成了黑洞，根据发表在自然·通信物理杂志上的一篇新论文。\n广义相对论预测，两个合并的黑洞应该会发出强大的引力波--时空结构中的涟漪非常微弱，很难探测到。这些信号的波形相当于两个黑洞的音频指纹，这两个黑洞相互螺旋向内，合并成一个巨大的碰撞事件，在整个时空中发出强大的冲击波。物理学家们在两个黑洞碰撞时，在数据中寻找一种具有说服力的啁啾模式。新残留的黑洞在撞击的力量下振动，这些振动--因为它很像被敲打的钟声--也会产生引力波。这两个黑洞的波形就像是两个黑洞向内旋转，合并成一个巨大的碰撞事件，在时空中发出强大的冲击波。物理学家们在数据中寻找两个黑洞碰撞时的啁啾模式。新残留的黑洞会因撞击产生的力量而振动，而这些振动--因为它很像敲钟的声音--也会产生引力波。此外，引力波信号有多个频率，称为泛音，它们以不同的速率(衰减)衰减，每个音调对应于新黑洞的振动频率。\nLIGO通过激光干涉测量来探测这些引力波，使用高功率激光来测量相距几公里的两个物体之间距离的微小变化。(LIGO在华盛顿州汉福德和路易斯安那州利文斯顿都有探测器，而意大利的第三个探测器Advanced Virgo于2016年上线。)。2015年9月14日，美国东部夏令时上午5点51分，两个探测器首次在毫秒内接收到信号。\n从那时起，LIGO进行了升级，并又进行了两次运行，于2019年4月1日开始第三次运行。在一个月内，合作小组又探测到了五个引力波事件：三个来自合并的黑洞，一个来自中子星合并，另一个可能是中子星/黑洞合并的第一个实例。\n最近，在2020年6月，合作宣布在2019年5月21日检测到双星黑洞合并(指定为S190521g)。就在上个月，LIGO和处女座的合作宣布，它探测到了来自另一次黑洞合并的引力波信号。这是合作迄今检测到的最大规模和最遥远的合并，也产生了迄今为止检测到的最具活力的信号。与通常的啁啾相比，它在数据中表现得更具冲击力。这次探测也标志着首次直接观测到中等质量的黑洞。\n据佐治亚理工学院研究生、这篇最新论文的合著者克里斯托弗·埃文斯(Christopher Evans)称，他和他的同事对黑洞碰撞进行了超级计算机模拟，然后将残余黑洞发出的引力波与其最终形成时迅速变化的形状进行了比较，结果发现，标准的引力波观测通常从残余黑洞的顶部研究合并。埃文斯说，当研究小组从残骸赤道的角度观察这一事件时，模拟显示引力波信号比人们通常认为的要丰富和复杂得多。\n当我们从黑洞的赤道观察黑洞时，我们发现最终的黑洞发出了更复杂的信号，在它消亡之前，它的节距会上下波动几次，西班牙圣地亚哥德孔波斯特拉欧洲加利西亚高能物理研究所的合著者胡安·卡尔德龙·巴斯蒂略(Juan Calderón Bustillo)说。换句话说，黑洞实际上发出了几次啁啾声。\n而这个更复杂的信号似乎也编码了关于最终残存黑洞将呈现什么形状的信息。巴斯蒂洛说，当两个原始的母黑洞大小不同时，最终的黑洞最初看起来就像栗子，一边是尖端，另一边是更宽、更平滑的背部。事实证明，黑洞通过其最弯曲的区域，也就是其尖端周围的区域，发出了更强烈的引力波。这是因为残存的黑洞也在旋转，它的尖端和背面反复指向所有的观测者，产生多个啁啾。\n作者的结论是，LIGO/Virgo探测器现有的灵敏度应该足以在他们的数据中观察到这种合并后的啁啾特征。", "note_en": "Physicists hunt for merging black holes and other similar cosmic events through the detection of gravitational waves, from which they can glean valuable information, such as the mass of both the precursor black holes and the final, larger black hole that results from the merger. Now a team of scientists has found evidence from supercomputer simulations that those waves may also encode the shape of merging black holes as they settle into their final form, according to  a new paper published in the Nature journal Communications Physics.\n General relativity predicts that two merging black holes should give off powerful gravitational waves—ripples in the fabric of spacetime so faint that they&#39;re very difficult to detect. The waveforms of those signals serve as an audio fingerprint of the two black holes spiraling inward toward each other and merging in a massive collision event, sending powerful shock waves across spacetime. Physicists look for a telltale  &#34;chirp&#34; pattern in the data as the two black holes collide. The new remnant black hole vibrates from the force of that impact, and those vibrations—called a &#34;ringdown&#34; since it is much like the sound of a bell being struck—also produce gravitational waves. Furthermore, the gravitational-wave signals  have multiple frequencies, dubbed &#34;overtones,&#34; that fade away at different rates (decay), with each tone corresponding to a vibrational frequency of the new black hole.\n LIGO detects these gravitational waves via laser interferometry, using high-powered lasers to measure tiny changes in the distance between two objects positioned kilometers apart. (LIGO has detectors in Hanford, Washington, and in Livingston, Louisiana, while a third detector in Italy,  Advanced VIRGO, came online in 2016.) On September 14, 2015, at 5:51am EDT, both detectors picked up signals within milliseconds of each other for the very first time.\n Since then, LIGO has been upgraded and has conducted two more runs, kicking off its third run on April 1, 2019. Within a month, the collaboration detected  five more gravitational wave events: three from merging black holes, one from a neutron star merger, and another that may have been the first instance of a neutron star/black-hole merger.\n More recently, in June 2020 the collaboration  announced the detection of a binary black hole merger on May 21, 2019 (designated S190521g). And  just last month, the LIGO/VIRGO collaboration announced that it had detected a gravitational wave signal from another black hole merger. This was the most massive and most distant merger yet detected by the collaboration, and it produced the most energetic signal detected thus far. It showed up in the data as more of a &#34;bang&#34; than the usual &#34;chirp.&#34; The detection also marked the first direct observation of an intermediate-mass black hole.\n    According to Christopher Evans, a graduate student at Georgia Tech and a co-author of this latest paper, he and his colleagues conducted supercomputer simulations of black hole collisions and then compared the gravitational waves emitted by the remnant black hole to its rapidly changing shape as it settled into its final form. It turns out that standard gravitational-wave observations typically study the merger from the top of the remnant black hole. When the team looked at the event from the perspective of the remnant&#39;s equator, the simulations showed that gravitational wave signals &#34;are far more rich and complex than commonly thought,&#34;  Evans said.\n &#34;When we observed black holes from their equator, we found that the final black hole emits a more complex signal, with a pitch that goes up and down a few times before it dies,&#34;  said co-author Juan Calderón Bustillo of the Galician Institute for High Energy Physics in Santiago de Compostela, Spain. &#34;In other words, the black hole actually chirps several times.&#34;\n And that more complex signal also seems to encode information about what shape the final remnant black hole will take. &#34;When the two original, &#39;parent&#39; black holes are of different sizes, the final black hole initially looks like a chestnut, with a cusp on one side and a wider, smoother back on the other,&#34;  said Bustillo. &#34;It turns out that the black hole emits more intense gravitational waves through its most curved regions, which are those surrounding its cusp. This is because the remnant black hole is also spinning and its cusp and back repeatedly point to all observers, producing multiple chirps.&#34;\n The authors conclude that the existing sensitivity of the LIGO/VIRGO detectors should be sufficient to observe this post-merger chirp signature in their data.", "posttime": "2020-10-11 17:12:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "合并,hole,黑洞", "title": "黑洞合并可能会发出双重啁啾，给我们关于它们形状的线索。", "title_en": "Black hole mergers may emit double chirps, giving us clues about their shape", "transed": 1, "url": "https://arstechnica.com/science/2020/10/black-hole-mergers-may-emit-double-chips-giving-us-clues-about-their-shape/", "via": "", "real_tags": ["合并", "hole", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "6326cb2b3da0a2aab3c276c15e961cc3.jpg", "infoid": 1028115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "康卡斯特的有线互联网仍然非常注重下载速度，因为即使是它的千兆下载服务也只有35 Mbps的上传速度。但情况可能不会永远如此，因为康卡斯特今天宣布了一项技术里程碑，它可以在现有电缆上提供超过千兆位的下载和上传速度。\n具体地说，康卡斯特表示，它使用网络功能虚拟化(NFV)和最新的DOCSIS技术，在现场生产网络上进行了一项试验，提供1.25Gbps的上传和下载速度。康卡斯特在佛罗里达州杰克逊维尔的一户人家里安装了这项服务，技术团队在那里一直测量到通过连接的速度为1.25Gbps上载和1.25Gbps下载。&#34；康卡斯特表示，它使用网络功能虚拟化(NFV)结合最新的DOCSIS技术，在现场生产网络上进行了一次测试，上传和下载速度分别为1.25Gbps和1.25Gbps。\n这些速度是通过混合光纤电缆网络传输的，而同轴电缆提供了进入家庭的最终连接。这并不是什么新鲜事-康卡斯特多年来一直同时使用光纤和电缆，但康卡斯特表示，该试验受益于该公司将光纤进一步延伸到社区的持续努力。通常情况下，对称的千兆位速度需要光纤到户的连接。但拥有电缆的家庭比拥有光纤的家庭多得多，因此，如果对称千兆位技术不需要将光纤一直带到每栋建筑，那么它的部署速度可能会更快。\n美国最大的宽带提供商康卡斯特(Comcast)没有透露对称的1.25Gbps服务将于何时(或是否)开始销售。目前，还需要进行更多的测试。康卡斯特表示，在接下来的几周里，随着我们继续测试这项服务在多种不同家庭和网络环境下的性能，康卡斯特将把试用范围扩大到更多的家庭。\n由于有线电视行业标准DOCSIS(有线服务接口双工数据规范)的更新，有线电视网络上的对称上传和下载速度成为可能。不过，这类升级需要数年时间才能到达客户手中。支持10Gbps下载和上传速度的DOCSIS全双工版本于2017年10月定稿，支持10Gbps下载和1Gbps上传的版本于2013年发布。\n康卡斯特表示，其对称的1.25Gbps试用需要先进的架构，其中包括基于软件的网络技术，包括数字光纤、远程PHY数字节点和基于云的虚拟化电缆调制解调器终端系统平台(VCMTS)。\n康卡斯特已经通过其光纤到户服务提供了数千兆位的下载和上传服务，但全光纤网络并没有延伸到该公司的整个有线电视服务区。康卡斯特在2015年推出了对称的2Gbps全光纤服务，每月300美元，最高可达1000美元的启动费。\n康卡斯特在2018年表示，其2Gbps服务覆盖1800万个家庭，但我们今天在康卡斯特的网站上找不到任何2Gbps服务的报价。康卡斯特的千兆位网页上说，你必须给该公司打电话询问有关获得几千兆位速度的问题。", "note_en": "Comcast&#39;s cable Internet still has a heavy emphasis on download speeds, as even its gigabit-download service only comes with  35Mbps uploads. But that may not be the case forever, as  today Comcast announced a &#34;technical milestone&#34; that can deliver gigabit-plus download  and upload speeds over existing cable wires.\n Specifically, Comcast said it conducted &#34;a trial delivering 1.25Gbps upload and download speeds over a live production network using Network Function Virtualization (NFV) combined with the latest DOCSIS Technology.&#34; Comcast installed the service at a home in Jacksonville, Florida, where &#34;the technology team consistently measured speeds of 1.25 Gbps upload and 1.25Gbps download over the connection.&#34;\n The speeds were delivered over a hybrid fiber-cable network, with the coaxial cable providing the final connection into the home. That&#39;s nothing new—Comcast has been using both fiber and cable for years, but Comcast said the trial benefitted from the company&#39;s &#34;ongoing effort to extend fiber further into neighborhoods.&#34; Normally, symmetrical gigabit speeds require a fiber-to-the-home connection. But many more homes have cable than fiber, so a symmetrical gigabit technology could be deployed faster if it doesn&#39;t require bringing fiber all the way to each building.\n Comcast, the nation&#39;s largest broadband provider, did not say when (or whether) a symmetrical 1.25Gbps service will go on sale. For now, more testing is required. &#34;In the coming weeks, Comcast will expand the trial to more homes as we continue to test the performance of the service under multiple different home and network environments,&#34; the company said.\n  Symmetrical upload and download speeds on cable networks are possible because of updates to DOCSIS (Duplex Data Over Cable Service Interface Specification), the cable-industry standard. These kinds of upgrades take years to reach customers, though. A &#34;full duplex&#34; version of DOCSIS that supports download and upload speeds of 10Gbps was  finalized in October 2017, and a  version supporting 10Gbps downloads and 1Gbps uploads was released in 2013.\n Comcast said its symmetrical 1.25Gbps trial required an &#34;advanced architecture&#34; that includes &#34;software-powered networking technologies, including digital fiber optics, &#39;Remote PHY&#39; digital nodes, and a cloud-based, virtualized cable modem termination system platform (vCMTS).&#34;\n Comcast does already provide multi-gigabit downloads and uploads through its fiber-to-the-home service, but the all-fiber network does not extend across the company&#39;s entire cable service area. Comcast  introduced a symmetrical 2Gbps all-fiber service in 2015 for  $300 a month and up to $1,000 in startup fees.\n Comcast  in 2018 said its 2Gbps service was available to 18 million homes, but we couldn&#39;t find any offers for the 2Gbps service on Comcast&#39;s website today.  Comcast&#39;s gigabit webpage says you have to call the company to ask about getting multi-gigabit speeds.", "posttime": "2020-10-11 17:12:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下载,上传,gigabit,服务", "title": "康卡斯特表示，千兆下载和上传现在可以通过有线电视进行", "title_en": "Comcast says gigabit downloads and uploads are now possible over cable", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/comcast-says-gigabit-downloads-and-uploads-are-now-possible-over-cable/", "via": "", "real_tags": ["下载", "上传", "gigabit", "服务"]}, {"category": "", "categoryclass": "", "imagename": "300ab66318d8002cdb860a3d4817e60c.jpg", "infoid": 1028113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在报道了Waymo几年之后，我已经学会了对公司的公告持保留态度。\n例如，Waymo表示，将在2018年年底前推出完全无人驾驶的商业服务。Waymo确实在2018年12月发布了一项名为Waymo One的服务，但它有几个巨大的星号：每辆车都有一名安全司机，而且这项服务只对一小部分人开放。\n但今天，Waymo似乎终于要推出它两年前承诺的出租车服务了：一项完全无人驾驶并向公众开放的服务。Waymo告诉Ars，这项服务最初将在凤凰城郊区钱德勒、坦佩和梅萨50平方英里的区域内运营。\nWaymo的无人驾驶技术推出得如此缓慢和令人困惑，很容易让人忽视这是一项多么了不起的成就。在过去的一两年里，由于无人驾驶技术未能辜负早先的炒作，声称无人驾驶技术还需要几年甚至几十年的时间才能成为一种时尚。\n但事实并非如此。今天，住在钱德勒地区的公众可以叫到一辆完全无人驾驶的出租车。\nWaymo决定向普通公众提供完全无人驾驶的乘车服务，这表明该公司相信它可以安全地这样做。现在的问题是，它能以多快的速度在全国乃至全球范围内扩大服务。这既是一个技术问题，也是一个经济问题。\n该公司每个季度都在亏损数千万美元，甚至可能是数亿美元。Waymo的亏损很大一部分是由于开发Waymo技术的成本。但可以肯定的是，即使是付费的Waymo One游乐设施也会损失Waymo的钱。据推测，Waymo&39；的安全司机的收入至少与优步(Uber)或Lyft的司机相当，该公司还有车队支持人员远程监控车辆。每辆Waymo汽车都有昂贵的传感器和计算硬件，这是典型的优步或Lyft汽车所没有的。\n取消安全司机是迈向Waymo&#39；服务盈利的重要一步。但这本身可能还不够，因为Waymo表示，这些汽车仍然有远程监督。\n这些Waymo员工从不直接驾驶车辆，但他们确实会发出高级指令，帮助车辆摆脱棘手的情况。例如，Waymo的一位女发言人告诉我，如果Waymo的车辆检测到前方的道路可能因施工而关闭，它可以靠边停车，要求我们的车队响应专家提供第二组眼睛。然后，车队响应专家可以确认道路已关闭，并指示车辆走另一条路线。\nWaymo&#39；游乐设施盈利能力的关键问题不太可能是车辆与运营商的比例。如果每辆车都有运营商，Waymo很可能无法盈利。但如果一家运营商可以监管多辆车-最初可能是两到三辆，最终每个运营商可以监管10到20辆车，这项服务就会变得更加可行。\nWaymo的一位女发言人告诉ARS，车队响应人员接受的培训是同时监控多辆汽车，但我们不会透露具体数字。但我们可以预计，这将是Waymo未来几个月的主要关注点：减少每辆车所需的远程监控数量，这样Waymo就可以随着时间的推移降低后台支持成本。\n这里需要关注的一件关键事情是，Waymo将其服务扩展到现有服务区的更多客户的速度有多快。在周四的博客文章中，Waymo写道，我们将从那些已经成为Waymo One的一部分的人开始，在接下来的几周里，欢迎更多的人通过我们的应用程序直接使用这项服务。这可能意味着Waymo&34；的服务将在几周内向其服务区域内的所有人开放。或者Waymo可能只会缓慢扩张--这可能表明Waymo的服务仍处于高度无利可图的状态。\nWaymo的一位女发言人告诉Ars，在3月份疫情爆发之前，我们每周总共提供1000到2000次乘车服务，其中5%到10%是完全无人驾驶的。Waymo表示，预计在今年年底之前，每周的无人驾驶乘车次数将恢复到大约100次，然后继续增长。\n另一个大问题是，扩大覆盖范围需要多长时间-以及成本有多高。Waymo要扩展到一个新的领域，有三个步骤。首先，该公司制作了新领域的详细地图。然后，该公司让其汽车在该地区的行驶路线上配备安全司机，以测试其软件的性能。最后，一旦该公司对该软件的性能感到满意，它就会开始无人驾驶操作。\nWaymo花了三年多的时间才完成了亚利桑那州钱德勒周围最初50平方英里服务区域的这一过程。显然，如果Waymo想要建立一项全国性甚至全球性的出租车服务，它将需要大幅加快这一过程。接下来的50平方英里-甚至500平方英里-可能不会像前50平方英里那么长。\n将Waymo One的服务足迹扩展到凤凰城郊区的其他地区应该是直截了当的。Waymo还可以很容易地扩展到其他西南城市，那里道路宽阔，行人很少，几乎全年都是阳光明媚的天气。\n向美国其他地区扩张可能会更难。与凤凰城郊区相比，旧金山、纽约和芝加哥等主要城市中心的车辆、行人、自行车和其他障碍物的密度要高得多。像波士顿和明尼阿波利斯这样的北部城市有大雪。几乎每个大都市地区的降雨量都比凤凰城多。将Waymo&39；的技术引入这些领域可能需要更多年的工作。\nWaymo还将不得不应对法律和习惯上的差异。不同的州对红灯时右转之类的事情有不同的法律。Waymo必须确保它符合每个地区的法律。Waymo还需要调整其车辆，使其驾驶风格与当地司机一致。\n不过，如果Waymo至少能在凤凰城地区提供服务，这可能是相对于竞争对手的一大优势。即使在一个大都会地区运营一项大规模的出租车服务，也会给Waymo带来丰富的传感器数据和操作经验，这些数据和操作经验将为该公司解决其他地区的问题提供参考。Waymo远未赢得全国无人驾驶技术竞赛。但它仍然是明显的行业领先者。\n在报道了Waymo几年之后，我已经学会了对公司的公告持保留态度。\n我仍然对此持保留态度，认为他们将其描述为向公众开放是不真诚的。你仍然需要注册Waymo One，他们仍然将Waymo One的注册人数限制在他们可以扩大供应的速度。正如文章中引用的那样，到今年年底，他们预计不会提供比前一年更多的乘车服务。我能看到的唯一具体变化是，他们不再要求你签署保密协议。我认为他们循序渐进、谨慎扩张的做法是好的，没有什么可抱怨的。但这似乎又是我们重新推出面向公众的服务的又一次宣布，而他们还没有真正推出一般公共服务。\n他们还有一句可爱的话：今年晚些时候，为了卫生和安全，我们在前排和后排乘客舱之间增加了车内屏障后，我们还将重新引入由训练有素的车辆操作员驾驶的游乐设施，这将增加运力，并使我们能够服务于更大的地理区域。\n如果你把50平方英里与50英里的里程联系在一起，听起来很多，但实际上，它只是一块5x10英里的地方，汽车可以开进去。看一张地图，这似乎是他们社区的面积，大约有15条完全笔直的街道和完全相同的十字路口。\n放大看，那里远远不止15条街。那些只是大区块而已。\n我的头条反应是该死的，他们这么做了，然后第三段治愈了我：这仍然不是自动驾驶。如果你认为特斯拉不是自动驾驶，那么你一定会认为Waymo不是自动驾驶。有很多人，随时准备为赛车做决定。那不是自动驾驶。这是在自动驾驶的道路上又迈出了一步。我很想看看实验结果如何。会不会有边缘情况导致受伤？如果是这样的话，他们更多的是在特斯拉地区。如果不是，那么也许我们正处在自动驾驶的海岸上，但还有更多的工作要做。我的意思是，两年前我们就在这里，当时他们声称有自动驾驶功能，但没有。现在和当时一样，但没有安全司机。当然是进步了，但是...。自动驾驶？\n作为一名安装了FSD软件包的特斯拉车主，这是一个完全不同的自主水平。有了特斯拉，人类需要不断地监控汽车，以防止它潜在地杀害汽车的乘员。相比之下，Waymo汽车总是在操纵汽车。在Waymo汽车中，从来没有人控制车轮的方向，或者油门或刹车的驱动。从来没有员工为了避免事故而超越Waymo车辆的驾驶。Waymo的员工正在为奇怪的情况做出决定，比如汽车不确定要做什么…。比如发生了一起车祸，碎玻璃和一辆倒下的摩托车挡住了去路。车停下来问人类，它是应该绕行还是倒车再走另一圈？或者如果路上或周围有抗议/游行，应该试着后退……。或者干脆完全停下来？&#34；……。或者如果路上有一块巨大的巨石。Https://youtu.be/D5ogSmH8M84?t=16确信这只是4级自主(与终极的5级相比)，但是当一个人应该一直待命时。一般来说，99%的驾驶时间不是由人主动监控的(而特斯拉的情况正好相反)。", "note_en": "After covering Waymo for several years, I&#39;ve learned to take the company&#39;s announcements with a grain of salt.\n In 2018, for example, Waymo said it would launch a fully driverless commercial service by the end of the year. Waymo did release a service called Waymo One in December 2018, but it came with a couple of  huge asterisks: every vehicle had a safety driver, and the service was only open to a small group of people.\n But today Waymo finally seems to be launching the taxi service it promised two years ago: one that&#39;s fully driverless and open to the public. Waymo told Ars that the service will initially operate in a 50-square-mile area in the Phoenix suburbs of Chandler, Tempe, and Mesa.\n Waymo&#39;s rollout of driverless technology has been so slow and confusing that it can be easy to lose sight of what a remarkable accomplishment this is. In the last year or two, as driverless technology has failed to live up to earlier hype, it has become fashionable to claim that driverless technology is still years or even decades away.\n But that isn&#39;t true. Members of the public who live in the Chandler area can hail a fully driverless taxi today.\n   Waymo&#39;s decision to offer fully driverless rides to the general public signals that the company believes it can do so safely. The question now is how quickly it can scale its service up nationally and, eventually, globally. That&#39;s a question of economics as much as it is of technology.\n The company has been losing tens of millions—perhaps even hundreds of millions—of dollars each quarter. A big part of Waymo&#39;s losses are due to the cost of developing Waymo&#39;s technology. But it&#39;s a safe bet that even paid Waymo One rides have lost Waymo money. Waymo&#39;s safety drivers presumably make at least as much as an Uber or Lyft driver, and the company also has fleet support staff monitoring vehicles remotely. And each Waymo vehicle has expensive sensors and computing hardware not present on a typical Uber or Lyft car.\n Eliminating the safety driver is an important step toward making Waymo&#39;s service profitable. But it may not be enough on its own because Waymo says the cars still have remote overseers.\n These Waymo staffers never steer the vehicles directly, but they do send high-level instructions to help vehicles get out of tricky situations. For example, a Waymo spokeswoman told me, &#34;if a Waymo vehicle detects that a road ahead may be closed due to construction, it can pull over and request a second set of eyes from our fleet response specialists.&#34; The fleet response specialist can then confirm that the road is closed and instruct the vehicle to take another route.\n  The key question for the profitability of Waymo&#39;s rides is likely to be the ratio of vehicles to operators. Waymo probably can&#39;t turn a profit if there&#39;s an operator for every vehicle. But the service becomes more viable if one operator can oversee multiple vehicles—perhaps two or three at the outset, and eventually 10 or 20 vehicles per operator.\n A Waymo spokeswoman told Ars that &#34;fleet responders are trained to monitor multiple cars at the same time, but we don&#39;t share specific numbers.&#34; But we can expect this to be a major focus for Waymo in the coming months: reducing the amount of remote monitoring each vehicle requires so that Waymo can reduce its back-office support costs over time.\n A key thing to watch here is how quickly Waymo expands its service to additional customers in the existing service area. In  Thursday&#39;s blog post, Waymo wrote that &#34;we’ll start with those who are already a part of Waymo One and, over the next several weeks, welcome more people directly into the service through our app.&#34; That could mean that Waymo&#39;s service will be available to everyone in its service territory in several weeks. Or Waymo might expand only slowly—which might be a sign that Waymo&#39;s service is still highly unprofitable.\n A Waymo spokeswoman told Ars that, before the pandemic struck in March, &#34;we were serving 1,000 to 2,000 weekly rides total, five to 10 percent of which were fully driverless.&#34; Waymo said it expects to return to that volume of roughly 100 driverless rides per week before the end of the year and then grow from there.\n   The other big question is how long it takes—and how expensive it is—to expand the coverage area. There are three steps for Waymo to expand into a new area. First, the company builds detailed maps of the new territory. Then the company has its cars drive routes in the area with safety drivers to test how its software performs. Finally, once the company is satisfied with the software&#39;s performance, it begins driverless operations.\n Waymo took more than three years to complete this process for its initial 50-square-mile service territory around Chandler, Arizona. Obviously, Waymo will need to dramatically speed the process up if it wants to build a national—or even global—taxi service. The next 50 square miles—or even 500 square miles—will probably not take as long as the first 50.\n Expanding the Waymo One service footprint to other parts of suburban Phoenix should be straightforward. Waymo may also be able to easily expand to other Southwestern cities with wide roads, few pedestrians, and sunny weather almost all year.\n  Expanding to other parts of the United States may be harder. Major urban centers like San Francisco, New York, and Chicago have a much higher density of vehicles, pedestrians, bicycles, and other obstacles than the Phoenix suburbs. Northern cities like Boston and Minneapolis have heavy snowfall. Almost every metropolitan area gets more rain than Phoenix. It may take more years of work to bring Waymo&#39;s technology to these areas.\n Waymo will also have to cope with differences in law and custom. Different states have different laws on things like right-hand turns at red lights. Waymo will have to make sure it complies with the law in each locality. Waymo will also need to tune its vehicles so that its driving style is consistent with that of local drivers.\n Still, if Waymo can at least make its service available in the Phoenix area, that could be a big advantage over its rivals. Running a large-scale taxi service in even one metro area will give Waymo a wealth of sensor data and operational experience that will inform the company&#39;s efforts to tackle other regions. Waymo is far from winning the national driverless technology race. But it continues to be the clear industry leader.\n  After covering Waymo for several years, I&#39;ve learned to take the company&#39;s announcements with a grain of salt.\n I&#39;m still taking this with a huge grain of salt, and think that them describing it as &#34;open to the general public&#34; is disingenuous. You still have to sign up for Waymo One, and they are still limiting Waymo One enrollment to the rate at which they can expand supply. And as quoted in the article, by the end of the year they don&#39;t expect to be providing any more rides than they were a year prior to that. The only concrete change that I can see is that they no longer require you to sign an NDA.  I think their approach to gradually and cautiously expanding is a good one, and have no complaints there. But this seems like yet another &#34;We&#39;re Launching Service to the Public!&#34; announcement, when they aren&#39;t actually launching general public service yet.\n  They also had this lovely quote:   Later this year, after we&#39;ve added in-vehicle barriers between the front row and the rear passenger cabin for hygiene and safety, we&#39;ll also be re-introducing rides with a trained vehicle operator, which will add capacity and allow us to serve a larger geographical area\n  50 square miles sounds a lot if you associate it with something like 50 miles of range, but in reality it&#39;s just a 5x10 mile patch somewhere that the car can drive in. Looking at a map, that seems to be about the area of their neighbourhood with a whopping 15 or so perfectly straight streets and identical intersections in it.\n  zoom in, there&#39;s way more than 15 streets. Those are just the megablocks.\n  My headline reaction was &#34;ill be damned, they did it&#34;  Then the third paragraph cured me: this is still not self driving.  If you take the position that Tesla is not self driving, then you must take the position that Waymo is not self driving.  There are people, ready to make decisions for the car at any moment. That is not self driving. This is yet another incremental step on the road to self driving.  I am interested to see how the experiment pans out. Will there be edge cases resulting in injury? If so they are more in the Tesla zone. If not, then maybe we are on the shores of self driving but with a lot more work remaining.  I mean, we were literally here 2 years ago when they claimed to have self driving but did not. Now it is the same as then but sans safety drivers. An improvement to be sure but ... self driving?\n  As a Tesla owner with the FSD package installed this is a completely different level of autonomy. With a Tesla the human needs to  constantly monitor the car to keep it from  potentially killing the occupants of the car. In contrast, the Waymo car is  always operating the car. In the Waymo car, no human is ever controlling the direction of the wheels, or the actuation of the accelerator or the brakes. There is never an employee overriding the driving of a Waymo vehicle to avoid an accident.  The Waymo employee is making decisions for weird situations that the car is unsure of what to do... like if there is a car accident with broken glass and a down motorcycle in its way. The car stops and askes the human &#34;should it drive around or back up and go a different round?&#34; or if there is a protest/parade in the way or surrounding it &#34;should is try to back away... or just stop completely?&#34;... or if there a HUGE boulder on the road.   https://youtu.be/D5ogSmH8M84?t=16  Sure this is only SAE Level 4 autonomy (versus the ultimate Level 5) but while a human should be &#34;on-call&#34; all the time... generally 99% of the driving time is not being actively monitored by a human (while the reverse is true for Tesla).", "posttime": "2020-10-11 17:11:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "出租车,finally,waymo", "title": "Waymo终于推出了一项真正的公共无人驾驶出租车服务", "title_en": "Waymo finally launches an actual public, driverless taxi service", "transed": 1, "url": "https://arstechnica.com/cars/2020/10/waymo-finally-launches-an-actual-public-driverless-taxi-service/", "via": "", "real_tags": ["出租车", "finally", "waymo"]}]