[{"category": "", "categoryclass": "", "imagename": "4ba1f2679567f68d92bfa6c4b77733e8.jpg", "infoid": 1030596, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在第一次放映时，电视网认为它手头有一场灾难。这是一部安静的动画片--与其说是一部像样的假日电影，不如说是一部关于季节性抑郁的沉思。节奏很慢，由一群业余儿童配音，配乐只不过是绰号为“方克博士”的八字胡北滩潮人的爵士乐钢琴风格。\n最糟糕的是，“查理·布朗的圣诞节”积极抨击这一季的商业化，主要是以挥舞着毯子的莱纳斯的长篇独白的形式，背景是耶稣的诞生。\n“(高管们说)，‘我们只玩一次，仅此而已。不错的尝试，‘“制片人李·门德尔森在2006年的一次采访中告诉我。“(导演比尔·梅伦德斯)当它完成时，我认为我们已经永远地毁了查理·布朗。我们在某种程度上同意电视网的观点。其中一位动画师在房间后面站了起来--他喝了几杯--他说，“这将持续100年”，然后摔倒了。我们都认为他疯了，但他比我们更正确。“。\n当然，“查理·布朗的圣诞节”还在继续。这部时长25分钟的动画特辑自1965年首次亮相以来，每年都会在网络电视上播出。它在哥伦比亚广播公司(CBS)播出到2000年，然后每年在美国广播公司(ABC)播出，包括分别在2005年和2015年的成立40周年和50周年时进行特别广播。为了庆祝它的55周年纪念日，它根本不会出现在网络电视上。\n10月份，苹果公司获得了这一特别节目的独家版权，这是其正在进行的10亿美元Apple TV+推广活动的一部分。与WildBrain、花生世界(Peanuts Worldwide)和现已去世的门德尔森的制作公司达成的协议，使苹果的流媒体平台成为花生内容的独家版权所有者。这意味着随后的特别节目“查理·布朗感恩节”和“伟大的南瓜，查理·布朗”将会有类似的命运。\n在流媒体时代，这已经成为一个耳熟能详的故事。去年，HBO Max锁定了“芝麻街”新剧集的独家使用权，尽管这项具体协议允许剧集稍后在PBS播出。这里也有一点漏洞。与花生的交易要求苹果在有限的窗口内免费提供特价商品。从10月30日到11月1日，“伟大的南瓜”将通过这项服务免费提供，“感恩节”将从11月25日到27日提供，而“圣诞节”将在今年早些时候到来，从12月11日到13日。\n“(花生的创造者查尔斯·舒尔茨)会说这样的话，‘我从未想过会是大约25年后，’”他的遗孀让·舒尔茨在接受同一篇文章的采访时告诉我。“圣诞节如此美好的原因之一是，在1965年，没有VCR或DVD，所以你看过一次那部剧，你不得不等上整整一年才能再看一遍。当它开始的时候，它仍然站得住脚。它仍然很迷人。“。\n半个多世纪过去了，这款特辑仍然可以说是两者兼而有之。它是美国流行文化的完美艺术品，既是它自己时代的产物，也是对它的温和抗议。当然，莱纳斯在1965年警告我们的所有事情，在其间的几十年里都只是雪上加霜。自那以后，媒体版图也发生了几次变化。\n在一个变化是唯一不变的世界里，在电视上看“查理·布朗的圣诞节”一直是可以依赖的。今年，随着媒体公司竭尽全力争夺过时的目录，这部短片成为2020年伟大的流媒体战争中被瓜分的最新一小部分内容。\n露西·范·佩尔特(Lucy Van Pelt)饰演一个常年愤世嫉俗、充满敌意的足球搬家，她告诉这个有名无实的角色：“看，查理，让我们面对现实吧。我们都知道圣诞节是一场大型的商业活动。“。至少，这一点没有改变。", "note_en": "On first screening, the network assumed it had a disaster on its hands. It was a quiet cartoon — more of a meditation on seasonal depression than a proper holiday film. The pacing was slow, it was voiced by a cast of amateur children and the soundtrack amounted to little more than the jazz piano stylings of a mustachioed North Beach hipster nicknamed “Dr. Funk.”\n Worst of all, “A Charlie Brown Christmas” actively railed against the commercialization of the season, primarily in the form of an extended monologue from the blanket-wielding Linus set in the context of Jesus’s nativity.\n “[The executives said], ‘We’ll play it once and that will be all. Good try,’ ” producer Lee Mendelson  told me in an interview back in 2006. “[Director Bill Melendez] and I thought we had ruined Charlie Brown forever when it was done. We kind of agreed with the network. One of the animators stood up in the back of the room — he had had a couple of drinks — and he said, ‘It’s going to run for a hundred years,’ and then fell down. We all thought he was crazy, but he was more right than we were.”\n  “A Charlie Brown Christmas” has, of course, endured. The 25-minute animated special has aired on network television every year since its 1965 debut. It ran on CBS until 2000 and then on ABC each year subsequently, including special broadcasts on its 40th and 50th anniversaries on 2005 and 2015, respectively. For its 55th anniversary,  it won’t appear on network TV at all.\n In October,  Apple   acquired the exclusive rights to the special, as part of its ongoing, billion-dollar Apple TV+ push. The deal with Wildbrain, Peanuts Worldwide and the now-late Mendelson’s production company makes Apple’s streaming platform the exclusive rights holder for Peanuts content. That means that subsequent specials “A Charlie Brown Thanksgiving” and “It’s the Great Pumpkin, Charlie Brown” will see a similar fate.\n  It’s become a familiar story in the era of streaming. Last year HBO Max locked down exclusive access to new episodes of “Sesame Street,” though that specific deal allowed for episodes to air on PBS at a later date. There’s a bit of a loophole here, too. The Peanuts deal requires Apple to offer the specials for free for a limited window. The “Great Pumpkin” will be free through the service from October 30 until November 1, “Thanksgiving” will be made available from November 25 to the 27 and “Christmas” will come decidedly earlier this year, from December 11 to the 13.\n “[Peanuts creator Charles Schulz] would say things like, ‘I never thought it would be around 25 years later,’ ” his widow Jean Schulz told me in an interview for that same piece. “One of the reasons that  Christmas is so great is that back in 1965 there were no VCRs or DVDs, so you saw that show once, and you had to wait a whole year to see it again. And when it came on, it still held up. It was still charming.”\n More than a half of a century later, the special still qualifies as both. It’s a perfect artifact of American popular culture that is very much both a product of its own era and a gentle protest against it. Of course, all of the things that Linus warned us about back in 1965 have only compounded in the intervening decades. The media landscape, too, has transformed several times since then.\n In a world in which change is the only constant, watching “A Charlie Brown Christmas” on TV has been something to rely on. This year, the short becomes the latest bit of content to get shoveled up in the great streaming wars of 2020, as media companies fight tooth and nail for back catalogues.\n Cast as the perennial cynic and antagonist football mover, Lucy Van Pelt tells the titular character, “Look, Charlie, let’s face it. We all know that Christmas is a big commercial racket.” That, at least, hasn’t changed.", "posttime": "2020-10-23 00:20:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,布朗,brown,查理", "title": "\n“查理·布朗的圣诞节”现在是Apple TV+的独家节目", "title_en": "\n\t\t\t\t‘A Charlie Brown Christmas’ is now an Apple TV+ exclusive\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/a-charlie-brown-christmas-is-now-an-apple-tv-exclusive/", "via": "", "real_tags": ["apple", "布朗", "brown", "查理"]}, {"category": "", "categoryclass": "", "imagename": "8d90ccb52deb5c465b108953c895eb78.jpg", "infoid": 1030595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Harness软件开发平台由各种模块组成，最新的一个模块有助于持续集成，这是在开发人员开始部署代码更改之前进行的构建和测试过程。\n“无人机是一款持续集成的软件。它帮助开发人员持续构建、测试和部署他们的代码。该项目于2012年启动，是市场上第一个云原生、容器原生的持续集成解决方案，我们对其进行了开源。“。\nBansal在收购时表示，他希望在该开源项目的基础上构建并提供企业商业版本，同时继续支持该开源项目。\n班萨尔说：“这真的是业内第一款将人工智能和机器学习引入优化构建和测试过程的产品。”这个智能层将它与软件的开源版本区分开来，其想法是使用机器学习来加快构建和测试过程。\n该公司还宣布了一个围绕管理功能标志的新模块。这些是开发人员在代码中留下的限制软件推出的元素，允许他们在向广大用户推出更新之前查看更新的执行情况。问题是，随着这些标志的激增，它们变得很难管理，而新模块的设计目的是帮助开发人员理解和控制代码中存在的标志。\n班萨尔说，他对公司的目标一直是把世界上最大的科技公司已经到位的那种自动化软件交付管道放在每个开发者都能接触到的地方。\n班萨尔说：“(我们的目标)是，世界上每一家公司都能拥有与谷歌、亚马逊或Facebook一样的软件交付复杂程度。”\n班萨尔创立了AppDynamics，这是他于2017年以37亿美元的价格出售给思科的一家公司。同年晚些时候，他推出了Harness。根据Pitchbook的数据，该公司已经筹集了近8000万美元，估值为5亿美元。\n班萨尔还在2018年创办了风险投资公司Unique Ventures，似乎他没有足够的事情要做，他在7月份推出了他的第三家初创公司Tracable，一家安全公司。", "note_en": "The  Harness software development platform consists of various modules and the latest one helps with continuous integration, which is the build and test process that happens before developers start deploying their code changes.\n   “Drone is a continuous integration software. It helps developers to continuously build, test and deploy their code. The project was started in 2012, and it was the first cloud-native, container-native continuous integration solution on the market, and we open sourced it.”\n Bansal indicated at the time of the acquisition that he wanted to build on that open source project and provide an enterprise commercial version, while continuing to support the open source project.\n “This is really the first product in the industry that is bringing AI and machine learning into optimizing the build and test process,” Bansal said. That intelligence layer is what separates it from the open source version of the software, and the idea is to use machine learning to speed up the building and testing process.\n The company is also announcing a new module around managing feature flags. These are elements developers leave in the code to limit the roll out of software, allowing them to see how the update is performing before rolling it out to the user base at large. The problem is these as these flags proliferate, they become difficult to manage, and the new module is designed to help developers understand and control the flags that exist in their code.\n  Bansal says his goal for the company has been to put the kind of automated software delivery pipeline that’s in place at the world’s largest tech companies within reach of every developer.\n “[Our goal] is that every company in the world can have the same level of software delivery sophistication as a Google or Amazon or Facebook,” Bansal said.\n Bansal founded AppDynamics, a company he  sold to Cisco in 2017 for $3.7 billion. He launched Harness later that same year. The company has raised almost $80 million on a valuation of $500 million, according  to Pitchbook data.\n Bansal also started the venture capital firm  Unusual Ventures in 2018 and as though he doesn’t have enough to do,  he launched his third startup Traceable, a security company, in July.", "posttime": "2020-10-23 00:20:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收购,delivers", "title": "\nHarness在收购Drone.io之后提供企业持续集成", "title_en": "\n\t\t\t\tHarness delivers enterprise continuous integration on heels of Drone.io acquisition\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/harness-delivers-enterprise-continuous-integration-on-heels-of-drone-io-acquisition/", "via": "", "real_tags": ["收购", "delivers"]}, {"category": "", "categoryclass": "", "imagename": "9cb92750dbc1370c9fb3adc8daa943fa.jpg", "infoid": 1030594, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克拉沃克斯有一个胡桃木橱柜，黄铜天线，还有太多美妙的旋钮和表盘，看起来就像是从战前的录音棚里走出来的，这确实是它的初衷。\n它是以苏联音乐家克拉拉·罗克莫尔(Clara Rockmore)的名字命名的，她在20世纪30年代演奏了特雷曼，赢得了广泛的好评(也可能是令人费解的)，并对该乐器的声誉和设计做出了重大贡献。\n然而，与电子音乐开拓者鲍勃·穆格(Bob Moog)设计的玩具相比，她演奏的那个只是一个玩具。穆格根据1949年发表在一本杂志上的计划制作了自己的玩具。后来，他将对乐器进行迭代和改进，使其成为多功能而独特的特里曼，这将成为许多流派的主打作品，与穆格自己的合成器并驾齐驱。\n不过，克拉沃克斯并不是一件展品。这是终极的特雷曼，充斥着现代和老式的技术。您可以定制并在模拟和数字振荡器之间切换；波形整形电路来自Etherwave Pro；具有内置的延迟和预设存储；输入和输出允许与大量信号源和控制器配合使用；甚至还有一个配套支架(单独销售)。\n它的工作原理和特里明人的一贯做法一样：天线检测一个人的手(或其他物体)在其电场范围内的位置，一个控制音调，另一个控制音量。演奏乐器和演奏音乐本身一样重要，正如德彪西的“克莱尔·德·卢恩”的精彩演绎所显示的那样：\n感兴趣(而且财力雄厚)的Thermin爱好者今天可以以1,499美元的价格预订他们的克拉沃克斯百年纪念。它应该在12月份发货-正好赶上假期，如果你想给那个特别的、热爱合成的人带来惊喜的话。", "note_en": "With a walnut cabinet, brass antennas, and a plethora of wonderful knobs and dials, the Claravox looks like it emerged from a prewar recording studio, as indeed is the intention.\n It’s named after Clara Rockmore, the Soviet musician who played the Theremin in the 1930s to wide acclaim (and probably puzzlement) and contributed significantly to the fame of the instrument and to its design.\n  The one she played, however, was a mere toy compared to the ones devised by electronic music trailblazer Bob Moog, who built his own from plans published in a 1949 magazine. Later he would iterate on and improve the instrument to make it the versatile yet distinctive Theremin that would become a staple in many genres alongside Moog’s own synthesizers.\n  The Claravox isn’t meant to be a display piece, though. It’s the ultimate Theremin, packed with modern and old-school tech. You can customize and switch between analog and digital oscillators; the wave shaping circuit is from the Etherwave Pro; there’s a built-in delay and preset storage; the inputs and outputs allow for use with lots of sources and controllers; there’s even a matching stand (sold separately).\n It works the same as Theremins always have: the antennas detect the position of one’s hands (or other objects) in the range of their electric fields, and one controls pitch while the other controls volume. Playing the instrument is as much a performance as the music itself, as this excellent rendition of Debussy’s “Clair de Lune” shows:\n  Interested (and deep-pocketed) Theremin aficionados can  pre-order their Claravox Centennial today for $1,499. It should ship in December — just in time for the holidays, if you want to surprise that special, synth-loving someone.", "posttime": "2020-10-23 00:20:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "thermin100,moog,演奏", "title": "\n为庆祝Thermin100周年，穆格揭开了华丽的Clarvox百年纪念的面纱", "title_en": "\n\t\t\t\tFor the Theremin’s 100th anniversary, Moog unveils the gorgeous Claravox Centennial\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/for-the-theremins-100th-anniversary-moog-unveils-the-gorgeous-claravox-centennial/", "via": "", "real_tags": ["moog", "演奏"]}, {"category": "", "categoryclass": "", "imagename": "de5d731b294f002368259df3e6537dbe.jpg", "infoid": 1030593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "追赶你的脚步，第三季度有大量私人资金可供初创公司使用，这些资金倾向于后期融资。\n该交易所探索初创企业、市场和资金。每天早上在Extra Crunch上阅读它，或者每周六获得Exchange时事通讯。\n后期回合比早期回合规模更大，因此它们单独占用的美元更多。但2020年第三季度是一个突出的时期，与年轻初创企业可获得的现金相比，后期资金积累的水平有多高。\n例如，根据CB Insights的数据，第三季度投资于美国的所有风险资本中，有54%是1亿美元或更多的一轮投资的一部分。这相当于88轮-创下历史纪录-价值198亿美元。\n第三季度在美国的其他1,373笔风险投资交易不得不瓜分剩余的46%的资金。\n虽然更广泛的国内和全球风险投资场景显示出生机的迹象-投资于欧洲和亚洲的美元增加，美国种子交易量回升，诸如此类的事情-这是我无法撼动的后期数据。\n对于我的非美国朋友来说，我们现有的数据集中在美国，所以我们必须通过国内的镜头来审视后期的美元繁荣。一般性的观点应该广泛适用，我们将始终尽最大努力保持我们的视野开阔。", "note_en": "Catching you up, there was lots of private money available for startups in the third quarter, with the money tilting toward later-stage rounds.\n  The Exchange explores startups, markets and money. Read it  every morning on Extra Crunch, or get  The Exchange newsletter every Saturday.\n  Late-stage rounds are bigger than early-stage rounds, so they take up more dollars individually. But Q3 2020 was a standout period for how high late-stage money stacked up compared to cash available to younger startups.\n For example, according  to CB Insights data, 54% of all venture capital money invested in the United States in the third quarter was part of rounds that were $100 million or more. That worked out to 88 rounds — a historical record — worth $19.8 billion.\n The other 1,373 venture capital deals in the United States during Q3 had to split the remaining 46% of the money.\n While the broader domestic and global venture capital scenes showed signs of life — dollars invested in Europe and Asia rose, American seed deal volume perked back up, that sort of thing — it’s the late-stage data that I can’t shake.\n To my non-American friends, the data we have available is focused on the United States, so we’ll have to examine the late-stage dollar boom through a domestic lens. The general points should apply broadly, and we’ll always do our best to keep our perspective broad.", "posttime": "2020-10-23 00:20:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,帮助,helped,后期", "title": "\n独角兽如何帮助风险投资变得更晚、更大", "title_en": "\n\t\t\t\tHow unicorns helped venture capital get later, and bigger\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/how-unicorns-helped-venture-capital-get-later-and-bigger/", "via": "", "real_tags": ["风险投资", "帮助", "helped", "后期"]}, {"category": "", "categoryclass": "", "imagename": "2192806805c14168fb04819258256a35.jpeg", "infoid": 1030592, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-苹果公司(Apple Inc)零售主管在接受路透社采访时表示，苹果公司AAPL.O正在扩大一种新的实体店模式，试图将iPhone12机型送到消费者手中。\n新的“快递”商店开张之际，新冠肺炎在美国和欧洲各地的房价都在上涨。新的形式在主店前建了一堵墙，用有机玻璃保护销售柜台，以及几个货架上的配件，如手机壳和AirPods。客户预约领取在线订单，或与苹果的技术人员互动，以获得客户服务。\n对于在美国拥有271家零售店的苹果来说，新的模式可能有助于它驾驭假日销售挑战。\n随着大流行在美国和欧洲等关键市场再次爆发，该公司推出了今年最畅销的产品。该公司在重新开放零售店方面采取了谨慎的做法，使用一个包括医疗专家在内的团队逐县打自己的电话，有时会在当地法规允许门店运营的情况下再次关闭门店。\n新的“快递”专卖店为苹果提供了另一种选择，因为在这些地区，令人不安的新冠肺炎费率可能会迫使苹果考虑减少路边提货服务。\n苹果负责零售和人员的高级副总裁Deirdre O‘Brien表示，对于购物中心或繁华市中心购物区的苹果专卖店来说，这一选择并不那么顺利，因为那里的“路缘”可能离店面很远。\n她告诉路透，苹果目前在美国和欧洲大约有20家这样的门店，并计划在本月底之前在这两个地区扩大到50家。\n奥布莱恩说：“这是我们为客户提供服务的一种更快捷的方式。”“它使我们能够保持所有适当的社交距离，并在我们的商店内维持我们所有的健康协议。”\n由于与流行病相关的开发延迟，苹果iPhone的到货时间比往常晚了一个月。Creative Strategy的分析师卡罗琳娜·米拉内西(Carolina Milanesi)表示，周五购买iPhone的顾客不太可能因为无法在“Express”商店操作演示设备而望而却步。\n“在这个周期的早期买入的人，他们知道他们在买什么，”她说。\n苹果资深分析师、目前是Loup Ventures合伙人的吉恩·蒙斯特(Gene Munster)说，由于今年iPhone发布的零售环境，苹果可能会面临iPhone销量下降约5%的问题。苹果将失去那些在实体店购买外壳或耳机等配件的支出超过计划的客户。\n但这一损失已被苹果的客户服务所抵消，蒙斯特表示，这有助于推动苹果最近一个季度的收入增加。\n他说：“当你是一位试图在家上学的家长，或者是一位试图使用分布式技术的雇主时，这是一股积极的力量。”\n“这远远超过了他们零售店的负面影响，我们从他们的数字中看到了这一点。”", "note_en": "(Reuters) - Apple Inc   AAPL.O  is expanding a new physical store format as it tries to get iPhone 12 models into customers&#39; hands, its retail chief told Reuters in an interview.\n  The new “Express” stores come as COVID-19 rates are rising around the United States and Europe. The new format has a wall built in front of the main store with sales counters protected by plexiglass and a few shelves of accessories such as phone cases and AirPods. Customers make an appointment to pick up orders placed online or interact with Apple’s technicians for customer service.\n For Apple, which has 271 retail stores in the United States, the new format could help it navigate a holiday sales challenge.\n The company is launching its biggest-selling product of the year as the pandemic flares up again in key markets such as the United States and Europe. The company has taken a cautious approach to re-opening its retail stores, using a team that includes medical experts to make its own calls on a county-by-county basis and sometimes shuttering stores again when local rules would otherwise allow stores to operate.\n The new “Express” stores give Apple another option in areas where troubling COVID-19 rates might force it to consider reducing service to curbside pickup.\n  That option does not work as smoothly for Apple stores in shopping malls or busy downtown shopping districts where the “curb” may be far away from the storefront, said Deirdre O’Brien, senior vice president of retail and people at Apple.\n Apple currently has about 20 such stores in the United States and Europe and plans to expand to 50 across the two regions by the end of the month, she told Reuters.\n “It’s a swifter way for us to serve customers,” O’Brien said. “It allows us to maintain all the appropriate social distancing and maintain all of our health protocols within our stores.”\n Apple’s iPhones are arriving a month later than usual because of pandemic-related development delays. Carolina Milanesi, an analyst with Creative Strategies, said customers who buy iPhones on Friday are unlikely to be put off by not being able to handle demo devices at the “Express” stores.\n  “People who are buying this early in the cycle, they know what they are buying,” she said.\n Gene Munster, a longtime Apple analyst who is now a partner at Loup Ventures, said Apple will likely face about 5% fewer iPhone sales because of the retail environment for this year’s iPhone launch. And Apple will lose customers who spend more than they planned in physical stores on accessories like cases or headphones.\n But that loss has been offset by Apple’s customer service, which Munster said helped drive higher revenues in Apple’s most recent quarter.\n “When you’re a parent trying to do school from home or an employer trying to do distributed technology, that’s a positive force,” he said.\n “That far outweighs the negative of what is going on in their retail stores, and we see that in their numbers.”", "posttime": "2020-10-23 00:19:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,保护,expanding", "title": "苹果公司表示，在假日季之前，它正在扩大其COVID-Safe“Express”零售店，在一家商店的前面设置了一个用有机玻璃保护的柜台", "title_en": "Apple says it is expanding its COVID-safe “Express” retail stores, with a counter protected by plexiglass at the front of a store, ahead of the holiday season", "transed": 1, "url": "https://www.reuters.com/article/us-apple-retail-idUSKBN2771IR", "via": "", "real_tags": ["apple", "苹果", "保护", "expanding"]}, {"category": "", "categoryclass": "", "imagename": "774914de6bb18c065982d36c366149e8.jpeg", "infoid": 1030591, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你现在已经知道比分了。华为目前生产的安卓手机不能运行安卓应用程序，或者至少是我和大多数人想要使用的安卓手机。今天，该公司发布了Mate 40系列超大尺寸旗舰智能手机，但与去年的Mate 30相比，变化有多大呢？这里的硬件再一次令人信服，华为的外观、手感和成像能力值得称赞。在过去的几天里，我一直在用Mate 40 Pro，有很多值得庆祝的地方，但同样重要的是不要购买。", "note_en": "You know the  score by  now. Huawei currently makes Android phones that can’t run  Android apps, or at least the ones that I, and most people, want to use. Today, the company announced the  Mate 40 family of super-sized flagship smartphones, but has much changed since last year’s Mate 30? The hardware here is compelling, again, and Huawei deserves praise for the look, feel and imaging prowess that this phone can offer. I’ve spent the last few days with the Mate 40 Pro, and there’s much to celebrate, but the same big reason not to buy.", "posttime": "2020-10-23 00:19:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,手机,应用程序,huawei,安卓", "title": "亲身体验华为新款Mate 40 Pro：令人难以置信的摄像头和强大的处理器，但应用程序选择很糟糕，很难推荐这款手机", "title_en": "Hands-on with Huawei's new Mate 40 Pro: incredible cameras and powerful processors, but the app selection is atrocious and makes the handset hard to recommend", "transed": 1, "url": "https://www.engadget.com/huawei-mate-40-123031700.html", "via": "", "real_tags": ["程序", "手机", "应用程序", "huawei", "安卓"]}, {"category": "", "categoryclass": "", "imagename": "d45451e0f71b872780c4d5648f5ab3ac.png", "infoid": 1030589, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们将发布Rust的一个非常早期的版本-GPU-一个新的项目，使Rust成为GPU代码的一流语言和生态系统！\nGPU编程历来是使用HLSL或GLSL完成的，这两种简单的编程语言多年来随着呈现API的发展而发展。然而，随着游戏引擎的发展，这些语言未能提供处理大型代码库的机制，与其他编程语言相比，它们通常落后于其他编程语言。\n我们希望通过将Rust这一现有的低级、安全和高性能的语言引入GPU来推动该行业向前发展。随之而来的还有一些额外的巨大好处：一个业界最好的软件包/模块系统，内置的安全，不受竞争条件或越界内存访问，广泛的库和工具，以改进程序员的工作流程，以及许多其他！\n如果我们做对了这个项目，开发人员可以使用开放源码的板条箱，提供创造美好体验所需的图形效果。他们可以简单地添加正确的板条箱，而不是在论坛帖子上共享代码片段。\n在登船，我们一直在建立我们自己的新游戏引擎从头开始在铁锈。我们之前有内部开发RLSL原型的经验，我们有一支优秀的渲染工程师团队，他们熟悉来自游戏、游戏引擎和其他行业的当前着色语言中的问题。因此，我们相信，我们处于独特的地位，可以尝试解决这个问题。\n我们希望用一种优秀的语言简化我们自己的内部开发，建立一个开源图形生态系统和社区，促进GPU和CPU之间的代码共享，最重要的是：使我们(未来的)用户和其他开发人员能够更快地构建出色的外观和引人入胜的体验。\n领导该项目：@Jasper-Bekkers-具有Frostbit&amp；Seed经验的渲染工程师和导线研究主管。\n@VZout，@REPI，@MaikKlein，@h3r2tic，@hrydgard，@emilk，@NiklasNummelin-devs将尝试用Rust编写他们所有的着色器！\n但我们不能单独做到这一点。这就是为什么我们决定与其余的铁锈和图形编程社区一起，公开开发这个项目。如果您有兴趣合作，请与我们联系。\n编译和运行非常简单的图形着色器是可行的，核心库的很大一部分也会编译。\n有了这个，我们已经能够在Rust中创建一些第一个真正的着色器，比如这个天空着色器(来源)：\nRustc编译器后端生成SPIR-V，插入VIA-Z codegen-后端。未来的版本可能会支持DXIL(DirectX的目标)或WGSL(与SPIR-V双射的WebGPU着色语言)。\n高级渲染图形利用了这一点，使得用户很容易开发和使用渲染效果。\n我们将举行每周一次的会议，讨论不和谐问题，并在GitHub问题上分享公开的议程。RFC和其他讨论也将在GitHub处理。", "note_en": "Today, we&#39;re releasing a very early version of  rust-gpu - a new project to make  Rust a first-class language and ecosystem for GPU code!\n GPU programming has historically been done with HLSL or GLSL, simple programming languages that have evolved along with rendering APIs over the years. However, as game engines have evolved, these languages have failed to provide mechanisms for dealing with large codebases, and have generally stayed behind the curve compared to other programming languages.\n Our hope with this project is that we push the industry forward by bringing   Rust, an existing low-level, safe, and high performance language, to the GPU. And with it come some additional great benefits: a package/module system that&#39;s one of the industry&#39;s best, built in safety against race-conditions or out of bounds memory access, a wide range of libraries and tools to improve programmer workflows, and many others!\n If we do this project right, developers could use open-source crates that provide the graphical effects needed to create beautiful experiences. Instead of sharing snippets of code on forum posts, they could simply add the right crates.\n  At  Embark, we&#39;ve been building our own new game engine from the ground up in Rust. We have previous experience in-house developing the  RLSL prototype, and we have a team of excellent rendering engineers that are familiar with the problems in current shading languages both from games, game engines and other industries. So, we believe we are uniquely positioned to attempt solving this problem.\n We want to streamline our own internal development with a single great language, build an open source graphics ecosystem and community, facilitate code-sharing between GPU and CPU, and most importantly: to enable our (future) users, and fellow developers, to more rapidly build great looking and engaging experiences.\n  Leading the project: @Jasper-Bekkers - rendering engineer with experience from Frostbite &amp; SEED, and head of Traverse Research\n  @VZout,  @repi,  @MaikKlein,  @h3r2tic,  @hrydgard,  @emilk,  @NiklasNummelin - devs that will try to write write all their shaders in Rust!\n But we can&#39;t do this alone. That&#39;s why we&#39;ve decided to develop this project in the open,alongside the rest of the Rust and graphics programming communities. Please connect with us if you are interested in collaborating\n  Compiling and running very simple graphics shaders works, and a significant portion of  the core library also compiles.\n With this we&#39;ve been able to create some first real shaders in Rust, such as this sky shader written ( source):\n      rustc compiler backend to generate  SPIR-V, plugging in via  -Z codegen-backend. Possible a future version could suppport  DXIL (the target for DirectX) or  WGSL (the WebGPU shading language that&#39;s bijective with SPIR-V)\n   High-level render graph to take advantage of this, make it easy for users to develop and use rendering effects.\n   We&#39;ll have weekly meetings on Discord, with open agendas shared in GitHub issues. RFCs and other discussions will also be handled in GitHub.", "posttime": "2020-10-23 00:15:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,锈蚀,图形", "title": "锈蚀-GPU", "title_en": "Rust-GPU", "transed": 1, "url": "https://github.com/EmbarkStudios/rust-gpu/releases/tag/v0.1", "via": "", "real_tags": ["rust", "锈蚀", "图形"]}, {"category": "", "categoryclass": "", "imagename": "ae3fbd5be2985eaf88443752546930dd.jpg", "infoid": 1030588, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "RepTrak成立于2004年，通过每年收集的100多万份公司评级的数据库，帮助企业衡量自己(以及竞争对手的声誉)的声誉。与此同时，Onclusive(前身为AirPR)提供了各种工具来分析公关的影响，并赢得了媒体对公司利润的报道。\n这两个领域听起来可能没有太大区别，但贝尔特拉莫表示，对于公关专业人士来说，它们代表着两个不同的目标-RepTrak的声誉数据有助于填补Onclusive缺失的一些领域。\n“我们在公关分析领域声名鹊起，(衡量)我称之为漏斗底的东西，”他说。“这是公关的一个重要目标：你在推动销售吗？你在推动下载吗？“。\n贝尔特拉莫表示，通过将Onclusive的数据与RepTrak的数据结合起来，他们给了公关人员“一个在漏斗顶部努力争取的好办法”-对一些人来说，提高声誉可能比推动销售更重要：“在周期更长、问题更大的大公司里，声誉是公关人员的灵魂所在。”\n相反，他说，对于以前更注重高层声誉的首席公关官来说，Onclusive提供了更多的实时数据和战术工具。\n贝尔特拉莫补充说，合作将分为多个阶段。首先，两家公司正在努力在Rentrak系统中展示Onclusive的媒体分析。最终，信息也会朝着相反的方向流动，Onclusive的团队也会想办法将Rentrak纳入进来。\nRepTrak首席执行官凯莉·赖特-福特在一份声明中表示：“我很高兴，我们与Onclusive的合作伙伴关系将为我们的客户提供一种更主动的方式来激活他们的声誉管理努力，利用RepTrak平台对机会和威胁进行优先排序和诊断，然后深入他们的媒体存在的细节采取行动，”RepTrak首席执行官凯莉·赖特-福特(Kylie Wright-Ford)在一份声明中表示。“现在的媒体和文化环境非常动态，所以公司需要有一套完整的准确数据才能做出正确的决策。”", "note_en": "RepTrak, founded in 2004, helps businesses measure their reputations (and their competitors’ reputations) through a database of more than 1 million company ratings collected every year. Meanwhile, Onclusive ( formerly known as AirPR) offers a variety of tools to analyze the impact of PR and earned media coverage on a company’s bottom line.\n Those two areas might not sound dramatically different, but Beltramo said that for PR professionals, they represent two separate goals — and that RepTrak’s reputation data helps to fill in some of the areas that Onclusive was missing.\n  “We made our name in PR analytics, [measuring] what I would call bottom of the funnel,” he said. “It’s an important objective for PR: Are you driving sales? Are you driving downloads?”\n By combining Onclusive’s data with RepTrak’s, Beltramo said they’re giving PR people “a good measure to shoot for at the top of the funnel” — and for some, improving reputation may be more important than driving sales: “At bigger companies with longer cycles and bigger issues, reputation is where the PR person’s psyche was focused.”\n Conversely, he said that for a chief communications officer who’d previously paid more attention to high-level reputation, Onclusive’s provides more real-time data and tactical tools.\n Beltramo added that there will be multiple stages to the partnership. First, the companies are working to present Onclusive’s media analytics in the RenTrak system. Eventually, information will be flowing in the opposite direction too, with Onclusive’s team figuring out how to incorporate RenTrak as well.\n “I am pleased that our partnership with Onclusive will give our clients an even more proactive way to activate their reputation management efforts by using the RepTrak Platform to prioritize and diagnose opportunities and threats, then drill into the details of their media presence to take action,” said RepTrak CEO Kylie Wright-Ford in a statement. “The media and cultural environments are very dynamic right now, so companies need to have a complete set of accurate data to make the right decisions.”", "posttime": "2020-10-22 23:57:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "onclusive,partners", "title": "\nRepTrak与Onclusive合作将声誉和公关数据结合起来", "title_en": "\n\t\t\t\tRepTrak partners with Onclusive to combine reputation and PR data\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/22/reptrak-onclusive-partnership/", "via": "", "real_tags": ["onclusive", "partners"]}, {"category": "", "categoryclass": "", "imagename": "a69a12f4614cd76471610e090bab8f57.jpg", "infoid": 1030587, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着特斯拉(Tesla)、Waymo和其他公司在自动驾驶汽车成为主流的竞赛中争先恐后地定位，一家鲜为人知的湾区初创公司通过向该行业提供运行自动测试所需的软件，已经达到了“独角兽”的地位。\n应用直觉公司周四证实，该公司在由之前的投资者Lux Capital、Andreessen Horowitz和General Catalyst共同牵头的新一轮C系列融资中筹集了1.25亿美元。据两位知情人士透露，有了这笔新资金，Application Intuition的估值已经达到12.5亿美元。\n由Qasar尤尼斯和彼得·路德维希于2017年创立的应用直觉公司将自己定位为硅谷和传统汽车制造商之间的桥梁。尤尼斯是一家被谷歌收购的初创公司的联合创始人，后来担任初创公司加速器Y Combinator的首席运营官，他就读于密歇根州通用汽车学院(General Motors Institute Of Technology)；路德维希(Ludwig)就读于密歇根大学(University Of Michigan)获得本科和硕士学位。两人都搬到了加州，然后合作了一个项目，将现代软件引入汽车行业为他们的汽车添加自动驾驶功能的努力。\n尤尼斯说：“如果你是一家全球OEM的工程师，比方说你在韩国的现代(Hyundai)工作，你应该很容易在第一天登录并获得工具。”尤尼斯指的是原始设备制造商，即实体制造汽车及其零部件等产品的公司。“对于今天的汽车工程师来说，这不是HIT的工作方式。可能需要几个月的时间才能完成工程设置。“。\n虽然优步(Uber)、特斯拉(Tesla)和Waymo在自动驾驶汽车领域登上了头条，但应用直觉的崛起提醒人们，自动驾驶比全自动驾驶汽车要重要得多。虽然这家初创公司与其他科技先锋公司合作，如自动驾驶卡车初创公司Kodiak Robotics和自动驾驶出租车初创公司Voyage，但它的基本客户更像是斯堪尼亚(Scania)和丰田(Toyota)，这些OEM使用自动化来实现目前已经在生产的更低级的流程，如自动停车、自动刹车系统和仓库和矿山中使用的机器人。\n与一些基于云的软件企业一样，应用直觉表示，其销售额在新冠肺炎疫情期间有所改善。Lux投资者比拉尔·祖贝里(Bilal Zuberi)说，该公司不需要额外资本。祖贝里作为这轮融资的一部分加入了董事会。Zuberi说：“这是关于，随着我们更深入地融入我们的客户和客户，我们可以做些什么有趣的事情。”我们坚信，在未来，所有将被设计、工程、制造、测试和使用的物理物体都将使用某种形式的模拟。\n应用直觉此前曾筹集了4000万美元的B系列资金，由General Catalyst牵头，在马克·安德森(Marc Andreessen)前一年领导其A系列之后，于2019年9月宣布。这家初创公司计划利用这笔资金进行国际扩张-它已经在底特律、慕尼黑和东京设有办事处，最近还扩展到了首尔和洛杉矶-同时也在寻求邻近的垂直市场和软件的可能性。(想想农业或航空起飞和降落中的自主用例，以及大规模运行、调整和共享测试所需的数据和基础设施)。\n虽然应用直觉可能会面临来自大型软件供应商的日益激烈的竞争，但尤尼斯认为，谷歌和特斯拉还有其他需要担心的事情-完善全自动驾驶系统以及设计和销售汽车-而新的初创公司挑战者将发现很难跟上其老式底特律人脉和新学校、旧金山湾区软件知识的结合。他说：“我们正试图从这两个世界中得到最好的东西。”", "note_en": "As Tesla, Waymo and others jockey for positioning in the race to make self-driving vehicles mainstream, a lesser-known Bay Area startup has reached “unicorn” status by offering the industry the software needed to run autonomous tests.\n  Applied Intuition has raised $125 million in a new Series C funding round co-led by previous investors Lux Capital, Andreessen Horowitz and General Catalyst, the company confirmed on Thursday. With the new funding, Applied Intuition’s valuation has reached $1.25 billion, according to two sources with knowledge of the deal.\n Founded in 2017 by Qasar Younis and Peter Ludwig, Applied Intuition pitches itself as a bridge between Silicon Valley and traditional automakers. Younis, cofounder of a startup acquired by Google and later the chief operating officer of startup accelerator Y Combinator, attended the General Motors Institute of Technology in Michigan; Ludwig attended the University of Michigan for his undergraduate and master’s degrees. Both relocated to California before teaming up on a project to bring modern software to the auto industry’s efforts to add autonomous features to their vehicles.\n “If you’re an engineer at a global OEM, let’s say you work at Hyundai in South Korea, it should be very easy for you to log in on day one and have access to tools,” Younis says, referring to original equipment manufacturers, the companies physically making products like cars and their parts. “That’s not how hit works for an automotive engineer today. It could be months before you have your engineering setup.”\n  While Uber, Tesla and Waymo make headlines in autonomous vehicles, Applied Intuition’s rise is a reminder that there’s much more to autonomy than fully self-driving cars. While the startup works with other tech-first companies like self-driving truck startup Kodiak Robotics and self-driving taxi startup Voyage, its bread-and-butter clients are more like Scania and Toyota, OEMs using automation for humbler processes already in production today, such as auto-parking, automated braking systems and robots used in warehouses and mines.\n  Like some cloud-based software businesses, Applied Intuition says its sales improved during the Covid-19 pandemic. The company didn’t need additional capital, says Lux investor Bilal Zuberi, who is joining the board as part of the round. “This is about, what are interesting things we can do as we get more embedded into our clients and customers,” Zuberi says. “We are of the firm belief that in the future, everything, all physical objects that will be designed, engineered, manufactured, tested and used, will use simulation of some sort.”\n Applied Intuition had previously raised  a $40 million Series B led by General Catalyst  announced  in September 2019 after Marc Andreessen led its Series A the year before. The startup plans to use this money to expand internationally — already with offices in Detroit, Munich and Tokyo, it recently expanded to Seoul and Los Angeles, too — while also pursuing adjacent verticals and software possibilities. (Think autonomous use cases in agriculture or aviation’s take-offs and landings, and the data and infrastructure needed to run, tweak and share tests at scale).\n While Applied Intuition will likely face increasing competition from large software vendors, Younis argues that Google and Tesla have other things to worry about — perfecting fully self-driving systems and designing and selling cars — while new startup challengers will find it tough to keep up with its blend of old school Detroit connections and new school, Bay Area software know-now. “We’re trying to take the best out of both worlds,” he says.", "posttime": "2020-10-22 23:56:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,车辆,intuition", "title": "消息人士称，应用直觉为其自动车辆测试软件C系列筹集了1.25亿美元的资金，估值为12.5亿美元", "title_en": "Applied Intuition raises $125M Series C for its autonomous vehicle testing software, sources say at a valuation of $1.25B", "transed": 1, "url": "https://www.forbes.com/sites/alexkonrad/2020/10/22/autonomous-vehicle-software-startup-applied-intuition-valued-above-1-billion/", "via": "", "real_tags": ["软件", "车辆", "intuition"]}, {"category": "", "categoryclass": "", "imagename": "c517ee5710b387178bb357994fcc873c.jpeg", "infoid": 1030586, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-Facebook公司的FB.O监督委员会周四表示，它现在正在接受案件审查。FB.O监督委员会可以否决该公司关于内容是否应该被删除的决定。\nFacebook为回应外界对其处理问题内容的批评而成立了拖延已久的监督委员会，该委员会接受已用尽该公司上诉程序的用户和Facebook本身的诉讼，此时距离11月的美国总统大选还有不到两周的时间。\n然而，Facebook的治理和全球事务总监布伦特·哈里斯(Brent Harris)在与记者的电话会议上表示，该公司不会在选举前提交加快审查的案例。\n该委员会的行政主任托马斯·休斯(Thomas Hughes)表示，该委员会因职权范围狭窄而受到批评，该委员会还计划从2021年初开始审理有关Facebook和Instagram上被留下和删除的内容的案件。\n从周四开始，全球用户将可以通过该委员会的网站提交案件，尽管该委员会表示，所有用户可能需要几周时间才能拥有这一选项。Facebook可以就内容应该保持增长还是下降以及广告或Facebook群等更广泛的问题提交案例，也可以要求提供政策建议。\n该委员会将只能审查一小部分案件，该委员会表示，将在未来几周分享正在考虑的首批案件的细节，并将启动公众评论程序。", "note_en": "(Reuters) - Facebook Inc&#39;s   FB.O  Oversight Board, which can overrule the company&#39;s decisions on whether content should have been removed, said on Thursday it was now accepting cases for review.\n The long-delayed Oversight Board, created by Facebook in response to criticism of its handling of problematic content, is open for cases both from users who have exhausted the company’s appeals process and from Facebook itself, less than two weeks before the U.S. presidential election in November.\n  However, Facebook’s director of governance and global affairs Brent Harris said on a call with reporters the company would not submit a case for expedited review before the election.\n The board, which has been criticized for its narrow remit, also aims to hear cases about content that has been left up as well as taken down on Facebook and Instagram starting in early 2021, the board’s director of administration Thomas Hughes said.\n  Users globally will begin to be able to submit cases through the board’s website from Thursday, though the board said it may take some weeks for all users to have this option. Facebook, which can refer cases on whether content should remain up or come down and on a wider range of issues like ads or Facebook groups, can also ask for policy recommendations.\n The board, which will only be able to review a small slice of cases, said it would share details on the first cases it is considering in the coming weeks and would also open a public comment process.", "posttime": "2020-10-22 23:56:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,程序,委员会", "title": "Facebook监督委员会表示，目前正在接受来自已用尽公司上诉程序的用户和Facebook本身的案件进行审查", "title_en": "Facebook's Oversight Board says it is now accepting cases for review, both from users who have exhausted the company's appeals process and from Facebook itself", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-oversight-idUKKBN2772A5", "via": "", "real_tags": ["facebook", "程序", "委员会"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030584, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，一名荷兰研究人员正确猜出了总统的密码：“maga2020！”之后，唐纳德·特朗普的推特账户遭到黑客攻击。\n据de Volkskant报纸报道，安全专家维克多·盖弗斯(Victor Gevers)可以获得特朗普的直接信息，可以用他的名字发布推文，并更改他的个人资料。\nGevers之前曾在2016年成功登录特朗普的账户，他通过猜测特朗普的密码获得了访问权限。他试过“Maga2020！”在他的第五次尝试中，它起作用了。Maga代表特朗普经常使用的竞选口号“让美国再次伟大”。\n“我本以为在四次尝试失败后就会被屏蔽。或者至少会被要求提供额外的信息，“Gevers告诉de Volkskant。\n盖弗斯表示，他轻松进入特朗普的账户表明，总统没有使用两步验证等基本安全措施。\n访问特朗普的推特意味着Gevers突然能够联系到8700万用户--这是特朗普的粉丝数量--根据德·沃尔克斯克兰特的故事，这让他有点恐慌。\n“因此，他试图警告其他人。特朗普的竞选团队和他的家人。他通过推特发送信息，询问是否有人会提醒特朗普注意他的推特账户不安全的事实。他给自己贴上了中央情报局、白宫、联邦调查局和推特的标签。没有回应，“该报报导称。\n在他获得访问权限的一天后，Gevers注意到特朗普的账户上已经激活了两步验证。两天后，特勤局取得了联系。据德·沃尔克斯克兰特说，他们感谢他让他们注意到安全问题。\n值得注意的是，这并不是盖弗斯第一次进入总统的推特账户。2016年，他和另外两人猜测了特朗普的密码，并进入了他的账户。\n据VN新闻报道，当时特朗普的密码是“你被重新解雇了”。", "note_en": "Donald Trump’s  Twitter account was hacked last week, after a Dutch researcher correctly guessed the president’s password: “maga2020!”.\n Victor Gevers, a security expert, had access to Trump’s direct messages, could post tweets in his name and change his profile,  De Volkskrant newspaper reported.\n  Gevers – who previously managed to log into Trump’s account in 2016 – gained access by guessing Trump’s password. He tried “maga2020!” on his fifth attempt and it worked. Maga stands for Trump’s oft used campaign slogan Make America Great Again.\n “I expected to be blocked after four failed attempts. Or at least would be asked to provide additional information,” Gevers told  De Volkskrant.\n Gevers said the ease with which he accessed Trump’s account suggested the president was not using basic security measures like two-step verification.\n Gaining access to Trump’s Twitter meant Gevers was suddenly able to connect with 87m users – the number of Trump’s followers – and according to De Volkskrant’s story, it sent him into a bit of a panic.\n “So, he tries to warn others. Trump’s campaign team, his family. He sends messages via Twitter asking if someone will call Trump’s attention to the fact that his Twitter account is not safe. He tags the CIA, the White House, the FBI, Twitter themselves. No response,” the paper  reported.\n A day after he gained access, Gevers noticed that two-step verification had been activated on Trump’s account. Two days later, the Secret Service got in touch. According to De Volkskrant, they thanked him for bringing the security problem to their attention.\n Remarkably, it wasn’t the first time Gevers has gained access to the president’s Twitter account. In 2016 he and two others guessed Trump’s password and got into his account.\n Back then Trump’s password was “yourefired”, according to  VN news.", "posttime": "2020-10-22 23:51:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,密码,猜测,twitter,特朗普", "title": "荷兰研究人员猜测密码后，特朗普的Twitter账户被黑客入侵", "title_en": "Trump's Twitter account hacked after Dutch researcher guessed password", "transed": 1, "url": "https://www.theguardian.com/us-news/2020/oct/22/trump-twitter-hacked-dutch-researcher-password", "via": "", "real_tags": ["黑客", "密码", "猜测", "twitter", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "a99af3e9235f7ea3e15227d37a86519b.jpg", "infoid": 1030583, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年5月，巴西城市马瑙斯被新冠肺炎的大爆发摧毁。医院人满为患，该市正在周围森林中挖掘新的墓地。但到了8月份，情况发生了变化。尽管在6月初放松了社交距离要求，但这座拥有200万人口的城市已经将超额死亡人数从每天约120人减少到几乎为零。\n9月，两组研究人员发布了预印本，表明马瑙斯夏末新冠肺炎病例的放缓已经发生，至少在一定程度上是因为该社区的很大一部分人口已经接触到病毒，现在已经免疫。巴西圣保罗大学的免疫学家Ester Sabino和她的同事们测试了来自马瑙斯血库的6000多个样本，以检测SARS-CoV-2的抗体。\n萨比诺说：“我们表明，感染人数确实很高--在第一波感染结束时达到66%。”她的团队得出的结论是，如此高的感染率意味着仍然容易感染病毒的人数太少，无法维持新的疫情--这一现象被称为群体免疫。巴西的另一个小组得出了类似的结论2。\n来自马瑙斯的这样的报告，加上关于意大利部分地区在大流行早期遭受重创的类似论点，帮助鼓励了追逐群体免疫力的提议。这些计划建议让大多数社会恢复正常，同时采取一些措施保护那些最有可能患严重疾病的人。支持者说，这基本上会让冠状病毒顺其自然。\n但流行病学家一再驳斥这种想法。加利福尼亚州拉荷亚斯克里普斯研究所的免疫学家克里斯蒂安·安德森(Kristian Andersen)说，“向病毒投降”不是一个站得住脚的计划。他说，这样的方法将导致灾难性的生命损失，而不一定会加快社会恢复正常的速度。“我们以前从未能成功做到这一点，这将导致不可接受和不必要的人类死亡和痛苦。”\n尽管受到了广泛的批评，但这个想法在包括瑞典、英国和美国在内的许多国家的政客和政策制定者中不断涌现。美国总统唐纳德·特朗普(Donald Trump)在9月份积极评价了这一点，使用了不当的“羊群心态”。甚至一些科学家也推动了这一议程。10月初，一个自由意志主义智囊团和一小群科学家发布了一份名为“大巴灵顿宣言”的文件。在这份报告中，他们呼吁严重新冠肺炎风险较低的人恢复正常生活，允许SARS-CoV-2传播到足够的水平，给予群体免疫力。它说，高危人群，如老年人，可以通过基本上未指明的措施得到保护。宣言的撰稿人在白宫接待了听众，并引发了另一组科学家在“柳叶刀”上的反驳备忘录，称群体免疫方法是“没有科学证据支持的危险谬论”3。\n支持让病毒在很大程度上不受控制地运行的论点，分享了对什么是群体免疫力以及如何最好地实现这种免疫力的误解。在这里，“自然”杂志回答了关于这一有争议的想法的五个问题。\n当病毒不能传播时，就会产生群体免疫，因为它会不断接触那些受到保护不受感染的人。一旦足够比例的人口不再易受感染，任何新的疫情都会逐渐消失。马萨诸塞州波士顿哈佛T.H.Chan公共卫生学院的流行病学家Caroline Buckee说：“你不需要每个人都免疫-你只需要足够的人来免疫就行了。”\n通常，将群体免疫作为大规模疫苗接种计划的理想结果进行讨论。人群中高水平的疫苗诱导免疫使那些不能接受疫苗或对疫苗没有足够反应的人受益，例如免疫系统受损的人。Buckee说，许多医学专业人士讨厌“群体免疫”这个术语，而更喜欢称之为“群体保护”。这是因为这种现象实际上并没有赋予病毒本身免疫力-它只会降低易受感染的人接触病原体的风险。\n但在没有疫苗的情况下，公共卫生专家通常不会将群体免疫作为一种工具来谈论。洛桑瑞士联邦理工学院的流行病学家Marcel Salathé说：“我有点困惑，它现在被用来表示在这件事停止之前需要多少人感染。”\n流行病学家可以估计在群体免疫开始之前需要免疫的人群的比例。香港中文大学(Chinese University Of Hong Kong)传染病流行病学家、数学模型师郭健安(Kin On Kuo)表示，这一门槛取决于基本的繁殖数量R0-在一个完全易感、混合良好的人群中，一个感染者平均产生的病例数量。计算群体免疫阈值的公式是1-1/R0-这意味着被每个携带病毒的个人感染的人越多，需要免疫才能达到群体免疫的人口比例就越高。例如，麻疹传染性极强，R0通常在12到18之间，这相当于92%-94%的人群免疫阈值。对于传染性较低的病毒(繁殖次数较低)，门槛会较低。R0假设每个人都容易感染病毒，但随着疫情的发展，这种情况会发生变化，因为有些人会被感染并获得免疫力。出于这个原因，有时在这些计算中使用称为R有效(缩写为Rt或Re)的R0的变体，因为它考虑了人群中磁化率的变化。\n尽管在公式中插入数字可以得出群体免疫力的理论数字，但在现实中，它并不是在一个确切的点上实现的。相反，最好将其视为梯度，马里兰州巴尔的摩约翰霍普金斯大学的流行病学家Gypsyamber D‘Souza说。由于变量可以改变，包括R0和易受病毒感染的人数，因此群体免疫不是稳定的状态。\n即使在人群中获得了群体免疫力，仍有可能爆发大规模疫情，例如在疫苗接种率较低的地区。Salathé说：“我们已经看到，在某些关于疫苗安全性的错误信息传播的国家，这种情况正在上演。”“在当地，你会开始看到疫苗接种量的下降，然后你会发现当地爆发的疫情可能会非常大，尽管从技术上讲，你已经达到了数学上的群体免疫力。”最终的目标是防止人们身体不适，而不是在模型中达到一个数字。\n达到群体免疫力在一定程度上取决于人群中正在发生的事情。郭说，阈值的计算对R值非常敏感。今年6月，他和他的同事在“感染杂志”上发表了一封致编辑的信，证明了这一点。郭和他的团队使用3月份以来每天新增新冠肺炎病例的数据，估计了30多个国家的Rt。然后，他们使用这些值来计算每个国家人口的群体免疫力阈值。这一数字从巴林的高达85%(当时的Rt为6.64)到科威特的5.66%(Rt为1.06)不等。科威特的人数较低，反映出它正在实施许多措施来控制病毒，如建立当地宵禁和禁止来自许多国家的商业航班。郭说，如果国家停止这些措施，群体免疫力门槛将会上升。\n马萨诸塞州波士顿东北大学研究传染病的网络科学家塞缪尔·斯卡皮诺(Samuel Scarpino)表示，郭例子中的羊群免疫力计算建立在可能不能反映现实生活的假设之上。“大多数的群体免疫力计算根本没有关于行为的任何内容。他们假设没有干预，没有行为改变或类似的东西，“他说。这意味着，如果人们行为的短暂变化(如身体距离)导致Rt下降，那么“一旦行为恢复正常，群体免疫力阈值就会改变。”\n对SARS-CoV-2病毒阈值的估计在10%到70%之间，甚至更高，5，6。但是，在这个范围的低端计算数字的模型依赖于关于人们如何在社交网络中互动的假设，这可能并不成立，斯卡平说。\n安德森说，看看监狱和游轮上已知的超级传播者事件，似乎很明显，新冠肺炎最初会广泛传播，然后在圈养的未接种疫苗的人群中放缓。安德森说，在加利福尼亚州的圣昆廷州立监狱，超过60%的人口最终在疫情停止之前就被感染了，所以在30%的人感染病毒后，情况并不是奇迹般地停止了。“没有神秘的暗物质可以保护人类，”他说。\n巴尔的摩约翰·霍普金斯健康安全中心的流行病学家凯特琳·里弗斯说，尽管科学家可以估计群体免疫阈值，但他们不会实时知道实际数字。她说，取而代之的是，只有通过回顾分析数据才能确定地观察到群体免疫力，可能长达10年后。\n许多研究人员说，追求群体免疫力不是一个好主意。安德森说：“试图通过有针对性的感染达到群体免疫力简直是荒唐可笑的。”“在美国，可能会有一两百万人死亡。”\n在马瑙斯，5月第一周的死亡率飙升至7年前的4.5倍。尽管随后8月份的病例减少令人兴奋，但数字似乎又在上升。安德森说，这一激增表明，关于马瑙斯人口已经达到群体免疫力的猜测“完全不是真的”。\n死亡只是方程式的一部分。患病的个人可能会经历严重的医疗和经济后果，许多从病毒中康复的人报告说，对健康的影响挥之不去。在马瑙斯，超过5.8万人感染了SARS-CoV-2，这意味着许多人遭受痛苦。\n早些时候，媒体报道称，瑞典正在推行群体免疫战略，实质上是让人们过上正常的生活，但根据该国卫生和社会事务部长莉娜·哈伦格伦(Lena Hallengren)的说法，这种想法是一种“误解”。她在一份书面声明中告诉“自然”杂志，群体免疫“是病毒如何在瑞典或任何其他国家传播的潜在后果”，但这“不是我们战略的一部分”。她说，瑞典的做法使用了与大多数其他国家类似的工具：“促进社会距离，保护弱势群体，进行检测和接触者追踪，并加强我们的卫生系统，以应对大流行。”尽管如此，瑞典并不是一个成功的典范--约翰·霍普金斯大学的统计数据显示，瑞典每十万人中新冠肺炎死亡的人数是邻国挪威的十倍多(每10万人中有58.12人死于新冠肺炎，而挪威每10万人中有5.23人死于新冠肺炎)。瑞典的病死率是根据已知感染人数计算的，也是挪威和邻近的丹麦的至少三倍。\n通过病原体的社区传播实现群体免疫的概念建立在未经证实的假设基础上，即在感染中幸存下来的人将获得免疫力。Buckee说，对于SARS-CoV-2，某种功能性免疫似乎伴随着感染，但“为了了解免疫反应的持续时间和影响，我们必须纵向跟踪人们，现在还为时过早”。\n里弗斯说，目前还没有一种万无一失的方法来衡量对病毒的免疫力。研究人员可以测试人们是否有针对SARS-CoV-2的抗体，但他们仍然不知道任何免疫力可能会持续多久。Buckee说，引起普通感冒的季节性冠状病毒会引起免疫力减弱，这种免疫力似乎会持续大约一年。“作为一种假设，假设这一次将是类似的，这似乎是合理的。”\n安德森说，近几个月来，有报道称人们在首次感染后再次感染SARS-CoV-2，但这些再次感染发生的频率以及是否会导致不那么严重的疾病仍然是悬而未决的问题。里弗斯说，“如果感染者在一年内再次变得易感，那么基本上你将永远不会”通过自然传播达到群体免疫力。\n“这里没有我们可以使用的魔杖，”安徒生说。“我们必须面对现实--我们以前从未通过自然感染一种新型病毒获得过群体免疫力，不幸的是，SARS-CoV-2也没有什么不同。”他说，接种疫苗是获得群体免疫力的唯一道德途径。有多少人需要接种疫苗-以及多久接种一次-将取决于许多因素，包括疫苗的效果如何以及其保护期限有多长。\n人们对社会疏远和关闭等强加的措施来控制新冠肺炎的传播感到疲惫和沮丧，这是可以理解的，但在有疫苗之前，这些都是身边最好的一些工具。D‘Souza说：“我们并非都必须得这种感染。”“有很多理由让我们抱有很大的希望。如果我们能够继续采取降低风险的方法，直到我们拥有一种有效的疫苗，我们绝对可以拯救生命。“", "note_en": "In May, the Brazilian city of Manaus was devastated by a large outbreak of COVID-19. Hospitals were overwhelmed and the city was digging new grave sites in the surrounding forest. But by August, something had shifted. Despite relaxing social-distancing requirements in early June, the city of 2 million people had reduced its number of excess deaths from around 120 per day to nearly zero.\n In September, two groups of researchers posted preprints suggesting that Manaus’s late-summer slowdown in COVID-19 cases had happened, at least in part, because a large proportion of the community’s population had already been exposed to the virus and was now immune. Immunologist Ester Sabino at the University of São Paulo, Brazil, and her colleagues tested more than 6,000 samples from blood banks in Manaus for antibodies to SARS-CoV-2.\n “We show that the number of people who got infected was really high — reaching 66% by the end of the first wave,” Sabino says. Her group concluded  1 that this large infection rate meant that the number of people who were still vulnerable to the virus was too small to sustain new outbreaks — a phenomenon called herd immunity. Another group in Brazil reached similar conclusions  2.\n Such reports from Manaus, together with comparable arguments about parts of Italy that were hit hard early in the pandemic, helped to embolden proposals to chase herd immunity. The plans suggested letting most of society return to normal, while taking some steps to protect those who are most at risk of severe disease. That would essentially allow the coronavirus to run its course, proponents said.\n  But epidemiologists have repeatedly smacked down such ideas. “Surrendering to the virus” is not a defensible plan, says Kristian Andersen, an immunologist at the Scripps Research Institute in La Jolla, California. Such an approach would lead to a catastrophic loss of human lives without necessarily speeding up society’s return to normal, he says. “We have never successfully been able to do it before, and it will lead to unacceptable and unnecessary untold human death and suffering.”\n Despite widespread critique, the idea keeps popping up among politicians and policymakers in numerous countries, including Sweden, the United Kingdom and the United States. US President Donald Trump spoke positively about it in September, using the malapropism “herd mentality”. And even a few scientists have pushed the agenda. In early October, a libertarian think tank and a small group of scientists released a document called the Great Barrington Declaration. In it, they call for a return to normal life for people at lower risk of severe COVID-19, to allow SARS-CoV-2 to spread to a sufficient level to give herd immunity. People at high risk, such as elderly people, it says, could be protected through measures that are largely unspecified. The writers of the declaration received an audience in the White House, and sparked a counter memorandum from another group of scientists in  The Lancet, which called the herd-immunity approach a “dangerous fallacy unsupported by scientific evidence”  3.\n Arguments in favour of allowing the virus to run its course largely unchecked share a misunderstanding about what herd immunity is, and how best to achieve it. Here,  Nature answers five questions about the controversial idea.\n  Herd immunity happens when a virus can’t spread because it keeps encountering people who are protected against infection. Once a sufficient proportion of the population is no longer susceptible, any new outbreak peters out. “You don’t need everyone in the population to be immune — you just need enough people to be immune,” says Caroline Buckee, an epidemiologist at Harvard T.H. Chan School of Public Health in Boston, Massachusetts.\n Typically, herd immunity is discussed as a desirable result of wide-scale vaccination programmes. High levels of vaccination-induced immunity in the population benefits those who can’t receive or sufficiently respond to a vaccine, such as people with compromised immune systems. Many medical professionals hate the term herd immunity, and prefer to call it “herd protection”, Buckee says. That’s because the phenomenon doesn’t actually confer immunity to the virus itself — it only reduces the risk that vulnerable people will come into contact with the pathogen.\n But public-health experts don’t usually talk about herd immunity as a tool in the absence of vaccines. “I’m a bit puzzled that it’s now used to mean how many people need to get infected before this thing stops,” says Marcel Salathé, an epidemiologist at the Swiss Federal Institute of Technology in Lausanne.\n  Epidemiologists can estimate the proportion of a population that needs to be immune before herd immunity kicks in. This threshold depends on the  basic reproduction number,  R 0 — the number of cases, on average, spawned by one infected individual in an otherwise fully susceptible, well-mixed population, says Kin On Kwok, an infectious-disease epidemiologist and mathematical modeller at the Chinese University of Hong Kong. The formula for calculating the herd-immunity threshold is 1–1/ R 0 — meaning that the more people who become infected by each individual who has the virus, the higher the proportion of the population that needs to be immune to reach herd immunity. For instance, measles is extremely infectious, with an  R 0 typically between 12 and 18, which works out to a herd-immunity threshold of 92–94% of the population. For a virus that is less infectious (with a lower reproduction number), the threshold would be lower. The  R 0 assumes that everyone is susceptible to the virus, but that changes as the epidemic proceeds, because some people become infected and gain immunity. For that reason, a variation of  R 0 called the  R effective (abbreviated  R t or  R e) is sometimes used in these calculations, because it takes into consideration changes in susceptibility in the population.\n  Although plugging numbers into the formula spits out a theoretical number for herd immunity, in reality, it isn’t achieved at an exact point. Instead, it’s better to think of it as a gradient, says Gypsyamber D’Souza, an epidemiologist at Johns Hopkins University in Baltimore, Maryland. And because variables can change, including  R 0 and the number of people susceptible to a virus, herd immunity is not a steady state.\n Even once herd immunity is attained across a population, it’s still possible to have large outbreaks, such as in areas where vaccination rates are low. “We’ve seen that play out in certain countries where misinformation about vaccine safety has spread,” Salathé says. “In local pockets, you start to see a drop in vaccinations, and then you can have local outbreaks which can be very large, even though you’ve technically reached herd immunity as per the math.” The ultimate goal is to prevent people from becoming unwell, rather than to attain a number in a model.\n  Reaching herd immunity depends in part on what’s happening in the population. Calculations of the threshold are very sensitive to the values of  R, Kwok says. In June, he and his colleagues published a letter to the editor in the  Journal of Infection that demonstrates this  4. Kwok and his team estimated the  R t in more than 30 countries, using data on the daily number of new COVID-19 cases from March. They then used these values to calculate a threshold for herd immunity in each country’s population. The numbers ranged from as high as 85% in Bahrain, with its then- R t of 6.64, to as low as 5.66% in Kuwait, where the  R t was 1.06. Kuwait’s low numbers reflected the fact that it was putting in place lots of measures to control the virus, such as establishing local curfews and banning commercial flights from many countries. If the country stopped those measures, Kwok says, the herd-immunity threshold would go up.\n  Herd-immunity calculations such as the ones in Kwok’s example are built on assumptions that might not reflect real life, says Samuel Scarpino, a network scientist who studies infectious disease at Northeastern University in Boston, Massachusetts. “Most of the herd-immunity calculations don’t have anything to say about behaviour at all. They assume there’s no interventions, no behavioural changes or anything like that,” he says. This means that if a transient change in people’s behaviour (such as physical distancing) drives the  R t down, then “as soon as that behaviour goes back to normal, the herd-immunity threshold will change.”\n Estimates of the threshold for SARS-CoV-2 range from 10% to 70% or even more  5 ,  6. But models that calculate numbers at the lower end of that range rely on assumptions about how people interact in social networks that might not hold true, Scarpino says. Low-end estimates imagine that people with many contacts will get infected first, and that because they have a large number of contacts, they will spread the virus to more people. As these ‘superspreaders’ gain immunity to the virus, the transmission chains among those who are still susceptible are greatly reduced. And “as a result of that, you very quickly get to the herd-immunity threshold”, Scarpino says. But if it turns out that anybody could become a superspreader, then “those assumptions that people are relying on to get the estimates down to around 20% or 30% are just not accurate”, Scarpino explains. The result is that the herd-immunity threshold will be closer to 60–70%, which is what most models show (see, for example, ref. 6).\n Looking at known superspreader events in prisons and on cruise ships, it seems clear that COVID-19 spreads widely initially, before slowing down in a captive, unvaccinated population, Andersen says. At  San Quentin State Prison in California, more than 60% of the population was ultimately infected before the outbreak was halted, so it wasn’t as if it magically stopped after 30% of people got the virus, Andersen says. “There’s no mysterious dark matter that protects people,” he says.\n And although scientists can estimate herd-immunity thresholds, they won’t know the actual numbers in real time, says Caitlin Rivers, an epidemiologist at the Johns Hopkins Center for Health Security in Baltimore. Instead, herd immunity is something that can be observed with certainty only by analysing the data in retrospect, maybe as long as ten years afterwards, she says.\n  Many researchers say pursuing herd immunity is a bad idea. “Attempting to reach herd immunity via targeted infections is simply ludicrous,” Andersen says. “In the US, probably one to two million people would die.”\n  In Manaus, mortality rates during the first week of May soared to four-and-a-half times what they had been the preceding year  7. And despite the subsequent excitement over the August slowdown in cases,  numbers seem to be rising again. This surge shows that speculation that the population in Manaus has reached herd immunity “just isn’t true”, Andersen says.\n Deaths are only one part of the equation. Individuals who become ill with the disease can experience serious medical and financial consequences, and many people who have recovered from the virus report  lingering health effects. More than 58,000 people were infected with SARS-CoV-2 in Manaus, so that translates to a lot of human suffering.\n Earlier in the pandemic, media reports claimed that Sweden was pursuing a herd immunity strategy by essentially letting people live their lives as normal, but that idea is a “misunderstanding”, according to the country’s minister for health and social affairs, Lena Hallengren. Herd immunity “is a potential consequence of how the spread of the virus develops, in Sweden or in any other country”, she told  Nature in a written statement, but it is “not a part of our strategy”. Sweden’s approach, she said, uses similar tools to most other countries: “Promoting social distancing, protecting vulnerable people, carrying out testing and contact tracing, and reinforcing our health system to cope with the pandemic.” Despite this, Sweden is hardly a model of success —  statistics from Johns Hopkins University show the country has seen more than ten times the number of COVID-19 deaths per 100,000 people seen in neighbouring Norway (58.12 per 100,000, compared with 5.23 per 100,000 in Norway). Sweden’s case fatality rate, which is based on the number of known infections, is also at least three times those of Norway and nearby Denmark.\n  The concept of achieving herd immunity through community spread of a pathogen rests on the unproven assumption that people who survive an infection will become immune. For SARS-CoV-2, some kind of functional immunity seems to follow infection, but “to understand the duration and effects of the immune response we have to follow people longitudinally, and it’s still early days”, Buckee says.\n  Nor is there yet a foolproof way to measure immunity to the virus, Rivers says. Researchers can test whether people have antibodies that are specific to SARS-CoV-2, but they still don’t know how long any immunity might last. Seasonal coronaviruses that cause common colds provoke a waning immunity that seems to last approximately a year, Buckee says. “It seems reasonable as a hypothesis to assume this one will be similar.”\n In recent months,  there have been reports of people being reinfected with SARS-CoV-2 after an initial infection, but how frequently these reinfections happen and whether they result in less serious illnesses remain open questions, says Andersen. “If the people who are infected become susceptible again in a year, then basically you’ll never reach herd immunity” through natural transmission, Rivers says.\n “There’s no magic wand we can use here,” Andersen says. “We have to face reality — never before have we reached herd immunity via natural infection with a novel virus, and SARS-CoV-2 is unfortunately no different.” Vaccination is the only ethical path to herd immunity, he says. How many people will need to be vaccinated — and how often — will depend on many factors, including how effective the vaccine is and how long its protection lasts.\n People are understandably tired and frustrated with imposed measures such as social distancing and shutdowns to control the spread of COVID-19, but until there is a vaccine, these are some of the best tools around. “It is not inevitable that we all have to get this infection,” D’Souza says. “There are a lot of reasons to be very hopeful. If we can continue risk-mitigation approaches until we have an effective vaccine, we can absolutely save lives.”", "posttime": "2020-10-22 23:51:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肺炎,promise,群体", "title": "关于新冠肺炎获得群体豁免权的虚假承诺", "title_en": "The false promise of herd immunity for Covid-19", "transed": 1, "url": "https://www.nature.com/articles/d41586-020-02948-4", "via": "", "real_tags": ["肺炎", "promise", "群体"]}, {"category": "", "categoryclass": "", "imagename": "11bddff5d6ac80cacf1a170338669e65.jpeg", "infoid": 1030582, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在网络上收听这个故事的音频改编，可以在所有的播客应用程序上找到。\n挤在拉斯维加斯酒店套房里的人都睡着了，除了文斯·拉莫斯。永利豪华酒店拥有室内花园、海鲜餐厅和奢华的购物场所，在过去的几天里一直是这群人的天下，来自美国、加拿大和澳大利亚的执法官员正在盘问拉莫斯。四五名官员在另一次讯问嫌疑人后躺下。\n拉莫斯有短暂的休息时间去看望他的妻子和一个孩子，他们住在附近自己的房间里。拉莫斯担心，如果他不这样做，他将无法见到家人，于是他与特工们进行了详细的交谈。他们说，拉莫斯在休息期间，当他的家人看到他时，他看起来像个幽灵。\n作为他数百万美元生意的一部分，他去见了一位同事，以幻影安全(Phantom Secure)的品牌销售加密手机。幻影定制的黑莓手机使用了专门设计的软件，使普通的窃听变得不可能。这位同事和拉莫斯计划参加在拉斯维加斯举行的一场拳击比赛。但取而代之的是，联邦调查局在等待并将拉莫斯逼入绝境，在他的头顶上悬挂着指控，通常是为扳倒黑帮头目而保留的。澳大利亚的摩托帮派，加州的毒贩，甚至锡那罗亚卡特尔的成员都使用幻影的手机。当局表示，当犯罪分子使用苹果或谷歌制造的手机时，Phantom没有像苹果或谷歌那样被视为无辜的第三方犯罪，而是拉莫斯本人参与了犯罪阴谋。特工们有拉莫斯的录音，表明他制造手机是为了帮助毒品走私者。在酒店房间门的另一边，当特工们最终停止提问时，很可能会被判长期监禁。\n他没有叫醒抓他的人就溜进了走廊。拉莫斯走到他妻子的房间道别。他有机会到达华盛顿州，越过边境回到他在加拿大的家。\n他下了楼，穿过锅炉区和地下室，离开了酒店。让仍然在套房里的特工们感到尴尬的是，他们追捕多年的人刚刚离开了。\n拉莫斯一直是个商人。在推出Phantom Secure并成为国际调查目标之前，他曾在多层次营销公司安利工作，然后为总部位于多伦多的电信集团罗杰斯(Rogers)从事企业销售。拉莫斯的一位家庭成员说，拉莫斯因销售浴缸和手机而获得了月度最佳员工奖。他的母亲是一名护士，他的父亲是一名看门人。\n他非常精通商业。这位家庭成员说，他一生都在做销售。拉莫斯绝对是个彻头彻尾的商人。一点也不是黑帮分子，一位了解幽灵运作的消息来源补充道。\n拉莫斯是他儿子的旗帜足球队里士满袭击者队的教练。他和他的一个女儿练习柔术，和孩子们一起做手镯时还背着Hello Kitty背包。\n他还参与了广泛的公司和企业。拉莫斯为Allysian，一家健康和营养补充剂公司提供了一段视频推荐信。在YouTube上的这段视频中，拉莫斯用平静而略带紧张的语气说，他尊敬Allysian的创始人罗德·饶，因为他一直认为他是一个成功的企业家。\n拉莫斯是一个有点积极力量的人，这位了解幻影运作的消息人士补充道。拉莫斯不想听到抱怨。在他的Allysian推荐信中，拉莫斯说，我试过MasterMind、Genesis、维生素和巧克力，指的是该公司的一些产品。\n他说：“所有的天然成分，我放进身体里的东西，实际上让我感觉真的很好。”“我觉得自己精力充沛，而且，你知道吗，我甚至有额外的动力去健身房，更加努力地工作。”\nMotherboard采访了Phantom周围的六个消息来源，包括拉莫斯的家人，代表他在多个国家销售Phantom手机的分销商，以及了解该公司运营的人。在大多数情况下，消息人士要求匿名，以保护他们免受报复，特别是免受执法和犯罪分子的报复。拉莫斯的四名共同被告，据称帮助经营公司或销售手机的人，仍然是被通缉的国际逃犯。母板公司还从幻影内部获得了多份文件，并获得了一份执法文件，为调查提供了深刻的见解。\n许多消息来源将拉莫斯描述为一个天真和无知的人，而不是一个顽固的罪犯。他们形容他粗心大意，而不是恶毒。但随着公司的扩张，最终竞争加剧，情况发生了变化，拉莫斯在知情的情况下为犯罪市场服务。\n2008年，Phantom开局无伤大雅。据拉莫斯的家人说，拉莫斯获得了加拿大律师的批准，通过了适当的渠道，并获得了营业执照。商业记录显示，幻影安全通信公司是在加拿大里士满注册的。\n在该公司早期的赤裸裸的网站拉莫斯(Ramos)上，首席执行官拉莫斯(Ramos)列出了他说自己创办Phantom的部分原因。\n拉莫斯写道：我真的相信我们的隐私权，像许多互联网用户一样，我一直担心我的电子邮件存储和通信的安全。他说，他过去常常发送电子邮件，其中包含看似琐碎的细节，比如他回家的日期和时间，但也包含更重要的信息，比如具体的商业细节。意识到电子邮件作为媒介并不是特别隐私，他就寻找一种方法来保护他在互联网上的交流。\n拉莫斯的家人说，拉莫斯不太喜欢技术；他从来都不是一个真正的书呆子或极客。取而代之的是，另一个人，该公司的首席技术官(CTO)，负责操作的技术方面。法庭记录没有提到此人的名字，而是将他称为个人A和幻影安全公司(Phantom Secure.)的一名高级官员。母板在一份FBI文件中发现了他的身份和一张他的照片，并发现了与提到他名字的安全通信公司有关的加拿大公司记录。母板没有公开他的名字，因为他没有被指控犯罪，当记者联系到他请其置评时，他担心自己和家人的安全。\n他是一个非常难相处的人，所以文斯[拉莫斯]让他远离客户，这位了解幻影运营情况的消息人士在谈到首席技术官时说。\n你还知道关于幻影安全的其他事情吗？我们很高兴收到你的来信。使用非工作电话或计算机，您可以通过Signal(+44 20 8133 5190)、Wickr(Josephcox)、OTR Chat(Email：jfcox@jabber.ccc.de)或电子邮件(joseph.cox@vice.com)安全地联系约瑟夫·考克斯(Joseph Cox)。\nPhantom&#39；的手机使用的是Pretty Good Privacy或PGP加密的一个版本，这意味着只有预定的收件人才能解密发送给他们的消息。然而，幻影走得更远，还在物理上移除了黑莓手机的GPS功能，以及麦克风和摄像头。有了这个被彻底锁定的设备，用户不能在手机上打普通电话，而只能发送加密的电子邮件。幻影还引入了远程擦除功能，用户可以联系公司，幻影会删除手机上的信息，而不会对设备进行物理控制。该公司在加拿大以外运行其基础设施，并通过巴拿马和香港的服务器路由数据，试图使其远离第三方。\n对来自加密手机的消息的隐私保护通常只有在用户给也有加密手机的其他人发短信时才有效，有时公司会强制他们的设备只与同一制造商的手机通信。这样一来，如果有你需要聊天的人，而他们有这样一部手机，你也必须买一部。从商业角度来看，这是吸引和留住客户的一种方式。\n布鲁诺(化名)说，他在2008年开始使用幻影手机，当时他在多伦多的夜生活中工作。主板允许他匿名，以便更坦率地谈论销售加密手机的潜在灰色地带。这是黑莓(BlackBerry)自己的通讯系统BBM的全盛时期，在笨重的QWERTY键盘上打字被认为是时髦的。布鲁诺说，拥有一部幻影手机最初在VIP人群中是一种身份象征，从商人到护送人员，拉莫斯将这些设备描述为手机世界的路易威登(Louis Vuitton)。一部手机每年的订阅费高达数千美元。布鲁诺补充说，幻影将自己推销为唯一的完整隐私解决方案，其营销奏效了。\n布鲁诺说：我必须与贵宾客户保持联系，以满足他们在预订、预订等方面的各种需求。他补充说，他与购买幻影设备的房地产经纪人和会计师合作。\n布鲁诺说，拉莫斯向说唱歌手和运动员免费赠送幻影手机，其中包括多伦多猛龙的成员，然后他们将通过自己的社交网络使用这些设备。\n米茜·拉莫斯(Mitsy Ramos)是文斯·拉莫斯(Vince Ramos)的前妻，也是一名洛杉矶的Instagram模特。社交媒体帖子称，她曾为Phantom Secure和一家名为VMD Ventures的互联公司工作。2011年9月，她在推特上给迈阿密一家模特经纪公司发了一条推特，并附上了幻影网站的链接，我会给你一笔交易。米齐·拉莫斯(Mitsy Ramos)没有回复多个置评请求。\n文斯卖BB的[黑莓]手机就像卖安利一样。这位了解幻影运营情况的消息人士说，他一直在谈论直销等问题。消息人士补充说，拉莫斯阅读有关销售的书籍。多位消息人士称，大部分接触是通过口碑进行的。\n后来，Phantom在其网站上涂上了光滑的黑色和铬合金设计，剪影中的人物拿着手机。图片显示，男子穿着黑色西装，打着领带，开着豪华宾利汽车。\nPhantom&34；Phantom的网站稍后会读到，这是专为老练的高管设计的。一些销售拉莫斯手机的人在他们的社交媒体账户上附上了幻影设备被黄金首饰包围的照片。\n在“幻影”的宣传视频中，屏幕上显示着公司的标志，吉他叮当作响。视频中充斥着库存镜头：男人们抽着雪茄，坐在真皮座椅上，还有一座高耸的摩天大楼，侧面显然印着该公司的标志。\n离岸瑞士账户密码，视频中幻影用户之间的一段虚构文字这样写道，展示了客户可能想要使用手机相互发送什么样的敏感信息。\n你知道使用手机是最不安全的交流方式吗？视频问道。你知道普通电子邮件类似于寄明信片吗？你知道短信都是用感叹的文字发送的吗？\n拉莫斯通常不会直接与他的用户群互动，当时他的用户群主要是加拿大人。根据法庭记录，幻影的管理员处理了新的订阅，启动了设备擦除，或删除了账户。布鲁诺参观了温哥华的一家幻影办公室，他说这是一间300平方米的现代化、干净的办公室，但与普通的科技或创业空间不同。在管理员之下，拉莫斯雇佣了分销商，他们实质上是向用户销售手机的个人代理商和主要幻影公司本身之间的中间人，分销商将把他们的分成寄回给他们。布鲁诺从幻影用户成长为分销商；这在其他加密电话公司中是一条常见的路线。最终他成了一名批发商。\n布鲁诺和了解幻影运营情况的消息人士都表示，该公司在印度有一个客户支持中心。网站注册和在线公司记录显示，有一家公司与幻影的首席技术官(CTO)有关联，该公司提供远程客户支持，并在旁遮普邦的贾兰达尔(Jalandhar)设有分支机构。\n有了幻影的结构，拉莫斯对他的一大批客户相当放手，让工人们在自己的地理区域销售手机。\n但幻影在招聘分销商的方式上存在漏洞。布鲁诺说，他搬到了亚洲，开始在那里销售这些设备。起初，布鲁诺说，他只是简单地出售手机，以换取现金信封，但很快就试图收紧操作。他说，他开始对他下面的卖家进行尽职调查，以确保他向合法行业和客户提供手机。他要求提供个人信息，这样他就可以制定银行合规问题，并要求分销商填写反洗钱(AML)表格，他们在表格上提供姓名、地址和身份证明表格，以便公司可以核实他们在与谁打交道。布鲁诺向Motherboard提供了一批内部Phantom文档，包括填写的AML表格和银行对账单，以及分销商的驾驶执照，以展示他进行的一些检查。\n早些时候，有迹象表明，幻影的客户群中包括罪犯。布鲁诺说，他拒绝了一些想做生意的讨厌人物，纯粹是因为害怕，更不用说天知道他们在做什么了。布鲁诺过滤掉了更多可疑的人，他说。\n与此同时，根据布鲁诺的说法，拉莫斯本人并没有要求太多的核实。幻影的政策之一是不收集客户姓名，但该公司的部分部门也不会核实最初是谁在销售手机。\n布鲁诺说，缺乏对转售产品的任何人的筛查，缺乏基于司法管辖区的正式合同。布鲁诺补充说，他必须为拉莫斯签订并回归一份合同，因为幻影本身从未抽出时间来制作一份合同。布鲁诺向母板公司提供了一份合同副本。\n拉莫斯的家人说，在[拉莫斯]建立业务的时候，他并不真正知道自己在和谁打交道。但最终，我们知道可能有一些人是为了更邪恶的目的而染上它的。\n一些分销商显然热衷于将Phantom&#39；的手机卖给犯罪分子。一位曾经在网上为幻影设备做广告的工作人员说，我只卖给我们推荐的人，或者是动物园的人。他说，这是一个俚语，意为监狱。这就是我把执法人员拒之门外的方法；即使有人联系我的网站，我也不会回答。这个经销商还把带有“告密者得到缝合”的图片上传到他们的Instagram账户。\n布鲁诺说，当拉莫斯访问布鲁诺时，他更感兴趣的是聚会，而不是坐下来做生意。\n别误会我的意思。他是个超级好人。说话轻声细语，友好，周围很酷。但我一直在推动一段更专业的关系。取而代之的是，我认识了一个想当兄弟和派对的人，他补充道。布鲁诺说，拉莫斯希望成为每个人的朋友，而不是寻求解决冲突或正面解决问题。\n布鲁诺说，这是一场狗屎表演，他是如何经营生意的。我警告他要更认真地对待事情，并强制执行某种形式的合规，因为他的行为和其他经销商的行为的粗心对他的公司和我自己以及其他人都是不利的。\n布鲁诺说，拉莫斯一直说他想成为优步那样--只是用大量的设备涌入市场，稍后再制定监管规定。很快，幻影将特别垄断一个国家。\n澳大利亚一公斤可卡因的价格是美国的八倍多，因为向该国走私毒品是非常困难的。而顶级毒贩需要一种他们可以依赖的工具，而且不会让执法部门监听。\n2014年3月，美国广播公司(ABC)的一篇文章的标题是：幻影安全公司(Phantom Secure)提供的不可破解手机与地狱天使自行车谋杀案有关。报道称，澳大利亚执法机构无法监控有权势的犯罪分子的通讯，因为他们使用的是加密手机。它补充说，即使是澳大利亚信号局(澳大利亚版的NSA)也无法破解加密。情报机构通常不能自己破解加密--相反，他们通过侵入电话或自己引入漏洞来解决这个问题--但潜在的观众不需要知道这一点。\n美国广播公司还播放了一个电视广告，其中包括对网络安全专家的采访，解释了幻影的远程擦除功能，如果执法部门没收了手机，这项功能会有什么特别的帮助，以及幻影是如何在客户支付了设备费用后删除信用卡信息的。\n该媒体在文章中写道，ABC并没有暗示该公司本身知道其产品正被犯罪分子使用，只是说犯罪分子已经意识到了这款手机的用途，并利用了这一点。报道补充说，当时美国广播公司没有回应Phantom的采访请求。\n根据法庭记录中公布的一份文本副本，这是对我们一直以来所说的最好的验证-9年多来被证明是有效的，拉莫斯在文章发表后给一名幻影员工的消息中写道。这是最高级别的官方权威，证实了我们的有效性。没有比这更好的了。对拉莫斯来说，犯罪分子使用幻影不是一个问题，而是一个商机。一个Phantom经销商将ABC的电视广告上传到他们自己的YouTube频道，宣传他们的设备。\n幽灵在澳大利亚的使用呈爆炸式增长，该国的分销商将这种设备出售给犯罪分子。据澳大利亚媒体报道，幻影卖家李旺(音译)有大约800名客户，他们来自不同的犯罪网络，他的公寓里散落着黑莓、数万美元的现金和冰毒。\n根据Motherboard获得的一份FBI文件，全国各地的Phantom分销商都在销售这款手机。昆士兰、维多利亚州、新南威尔士州和其他地区都有销售幻影手机的团队。联邦调查局的文件补充说，幻影最初在美国站稳脚跟是因为它与大规模毒贩(或有影响力的人)合作，后者要求任何希望做生意的人也要使用幻影设备。\nFBI文件中提到的一位前幻影在澳大利亚的经销商告诉主板，销售这些手机是完全合法的，我们的公司是注册的。\n旨在减少该地区有组织犯罪的澳大利亚政府机构新南威尔士州犯罪委员会在其一份年度报告中写道，加密黑莓设备的大量使用仍然有增无减，就像前几年一样，这些设备被用来为毒品交易提供便利。澳大利亚国家刑事情报机构特别将Phantom列为有组织犯罪集团的首选，加密通讯应用Wickr也是如此。\nMotherboard获得的一份法律文件描述了幻影卖家的律师如何就幻影安全在澳大利亚的运营与澳大利亚犯罪委员会(ACC)的执行成员举行了高层会议。这封信是在幻影引起澳大利亚执法部门注意几年后发出的。(澳大利亚刑事情报委员会，ACC于2016年7月合并，12月。\n.", "note_en": "Listen to an  audio adaptation of this story on CYBER , available on all podcast apps.\n  Everyone crammed into the Las Vegas hotel suite was asleep except for Vince Ramos. The Wynn luxury hotel, with its indoor gardens, seafood restaurants, and extravagant shopping, had been this group&#39;s world for the past few days, with law enforcement officials from the U.S., Canada, and Australia grilling Ramos. Four or five officials lay down after another session of questioning their suspect.\n  Ramos had short breaks to see his wife and one of his children, who were staying in their own room nearby. Fearing he wouldn&#39;t be able to see his family if he didn&#39;t do so, Ramos spoke at length with the agents. Ramos looked like a ghost during those breaks when his family saw him, they said.\n    He’d travelled to meet an associate as part of his multi-million dollar business, selling encrypted phones under the brand name Phantom Secure. Phantom&#39;s customized BlackBerry phones used dedicated software designed to make an ordinary wiretap impossible. The associate and Ramos planned to attend a fight in Vegas. But instead the FBI were waiting and cornered Ramos, dangling charges above his head usually reserved for taking down mob bosses. Biker gangs in Australia, drug traffickers in California, and even members of the Sinaloa Cartel all used Phantom&#39;s phones. Rather than treat Phantom as an innocent third party to crime like Apple or Google when criminals use phones made by those companies, authorities said Ramos himself was part of criminal conspiracies. The agents had Ramos on tape suggesting he made the phones to help drug smugglers. On the other side of that hotel room door, when the agents finally stopped asking their questions, there was likely a long prison sentence.\n  He slipped out into the corridor without waking his captors. Ramos walked to his wife&#39;s room and said goodbye. He had a chance to get up to Washington state and cross the border back to his home in Canada.\n  He headed downstairs, moved through the boiler area and basement, and left the hotel. Embarrassingly for the agents still in the suite, the person they had been hunting for years had just walked away.\n  Ramos had always been a businessman. Before launching Phantom Secure and becoming the target of an international investigation, he worked with multi-level marketing company Amway, and went on to corporate sales for Rogers, the Toronto-headquartered telecom conglomerate. Ramos received employee of the month awards both for selling bathtubs and then for selling phones, a family member said. His mother was a nurse; his father, a janitor.\n  &#34;He was very business-savvy. His whole life, he was sales,&#34; the family member said. Ramos was &#34;definitely a businessman to the core. Not a gangster in the slightest,&#34; a source with knowledge of Phantom&#39;s operations added.\n  Ramos coached his son’s flag football team, the Richmond Raiders. He practiced jujitsu with one of his daughters and wore a Hello Kitty backpack while making bracelets with his children.\n  He also got involved with a wide range of companies and ventures. Ramos gave a video testimonial for Allysian, a wellness and nutritional supplements company. In the clip on YouTube, Ramos said in a quiet, slightly nervous tone, that he looked up to Rod Jao, the founder of Allysian, because he had &#34;always seen him as being a successful entrepreneur.&#34;\n  Ramos was a bit of a positive power kind of person, the source with knowledge of Phantom&#39;s operations added. Ramos didn&#39;t want to hear complaints. In his Allysian testimonial, Ramos said, &#34;I tried the Mastermind, the Genesis, and the vitamins, and the chocolates,&#34; referring to some of the company&#39;s products.\n  &#34;All natural ingredients, what I&#39;m putting into my body, actually makes me feel really good,” he said. “I feel like I have a lot more energy, and, you know what, I even have that extra motivation to go to the gym, and work extra hard.”\n  Motherboard spoke to over half a dozen sources around Phantom, including family members of Ramos, distributors who sold Phantom phones in multiple countries on his behalf, and people with knowledge of the company&#39;s operations. In most cases, the sources requested anonymity to protect them from retaliation, especially from law enforcement and criminals. Four of Ramos&#39;s co-defendants, people who allegedly helped run the company or sell phones, remain wanted international fugitives. Motherboard also obtained multiple documents from within Phantom and a law enforcement file that gives deep insight into the investigation.\n  Many of the sources described Ramos not as a hardened criminal, but as a person who was naive and ignorant about the situation he put himself in. They described him as negligent, not malevolent. But as the company expanded, and eventually competition ramped up, something changed, and Ramos knowingly served the criminal market.\n   In 2008, Phantom started innocuously. Ramos got approval from lawyers in Canada to create the firm, went through the proper channels, and got his business license, according to the family member. Business records show Phantom Secure Communications was registered in Richmond, Canada.\n  On  the company&#39;s early, barebones website, Ramos, under the handle &#34;CEO,&#34; laid out in part why he said he started Phantom.\n  &#34;I truly believe in our right to privacy and like many internet users I have always had a concern with the security of my email storage and communications,&#34; Ramos wrote. He said that he used to send emails that contained seemingly trivial details, like dates and times when he was coming home, but also more important information like specific business details. Realizing that email as a medium was not especially private, he looked for a way to protect his communications over the internet.\n  Ramos wasn&#39;t much of a tech guy; he was never really a nerd or geek, his family member said. Instead, another person, the company&#39;s chief technology officer (CTO), handled the technical aspects of the operation. Court records don&#39;t name this person, instead referring to him as Individual A and a &#34;high-ranking officer of Phantom Secure.&#34; Motherboard found his identity and a photo of him in an FBI document, and uncovered Canadian corporate records related to secure communications companies that mention his name. Motherboard is not naming him publicly because he has not been charged with a crime, and when reached for comment he feared for his and his family&#39;s safety.\n  &#34;He was a very difficult person so Vince [Ramos] kept him away from the clients,&#34; the source with knowledge of Phantom&#39;s operations said of the CTO.\n Do you know anything else about Phantom Secure? We&#39;d love to hear from you. Using a non-work phone or computer, you can contact Joseph Cox securely on Signal on +44 20 8133 5190, Wickr on josephcox, OTR chat on  jfcox@jabber.ccc.de  , or email  joseph.cox@vice.com  .\n  Phantom&#39;s phones used a version of Pretty Good Privacy, or PGP encryption, meaning that only the intended recipient is supposed to be able to decrypt messages sent to them. Phantom went further, however, and also physically removed the GPS functionality from the BlackBerry, as well as the microphone and camera. With this drastically locked down device, a user couldn&#39;t make ordinary calls on the phone and instead could only send encrypted emails. Phantom also introduced a remote wipe feature, where a user could contact the company, and Phantom would delete messages on the phone without having physical control of the device. The company ran its infrastructure outside of Canada, and routed data through servers in Panama and Hong Kong in an attempt to keep it out of the reach of third-parties.\n  The privacy protection on messages from encrypted phones typically only works if the user is texting someone else who also has an encrypted phone, and sometimes companies force their devices to only communicate with phones from the same manufacturer. That way, if there was someone you needed to chat to and they had such a phone, you had to buy one too. From a business perspective, it was a way to pull in and retain customers.\n  Bruno (not his real name) said he started using Phantom phones in 2008 when he worked in Toronto&#39;s nightlife. Motherboard granted him anonymity to speak more candidly about the potentially grey area of selling encrypted phones. This was the heyday of BlackBerry&#39;s own messaging system, BBM, when typing out texts on a clunky QWERTY keyboard was considered stylish. Bruno said having a Phantom phone was originally a status symbol with VIP crowds, ranging from businessmen to escorts, and Ramos described the devices as the Louis Vuitton of the phone world. A phone cost thousands of dollars a year in subscription fees. Phantom marketed itself as the only full privacy solution, and its marketing worked, Bruno added.\n  &#34;I had to be in contact with VIP clients to cater to their every need for bookings, reservations, etc,&#34; Bruno said, adding that he&#39;s worked with real estate agents and accountants who purchased Phantom devices.\n  Ramos gave free Phantom phones to rappers and athletes, including members of the Toronto Raptors, who would then use the devices with their own social network, Bruno said.\n  Mitsy Ramos, Vince Ramos&#39; ex-wife and a Los Angeles-based Instagram model, said she worked for Phantom Secure and a connected company called VMD Ventures, according to social media posts. &#34;I&#39;ll give you a deal,&#34; she tweeted to a Miami modeling agency in September 2011, along with a link to the Phantom website. Mitsy Ramos did not respond to multiple requests for comment.\n  &#34;Vince was selling BB’s [BlackBerries] like he sold Amway. He was always talking about direct marketing, etc,&#34; the source with knowledge of Phantom&#39;s operations said. Ramos read books about sales, the source added. Much of the exposure was done through word-of-mouth, multiple sources said.\n  Later on, Phantom coated its website  in a slick, black and chrome design, with silhouetted figures holding their phones. Images showed men in black suits and ties  and luxury Bentley cars.\n  &#34;Designed exclusively for the sophisticated executive,&#34; Phantom&#39;s website later read. Some people who sold Ramos&#39; phones included photos of Phantom devices surrounded by gold jewelry on their social media accounts.\n  In a Phantom promotional video, a guitar twangs as the screen displays the company&#39;s logo. The video is littered with stock footage: men smoking cigars, leather seats, and a towering skyscraper with the company&#39;s logo obviously photoshopped onto its side.\n    &#34;Offshore Swiss Account password,&#34; one fictional text between Phantom users in the video reads, demonstrating what sort of sensitive information clients might want to use the phones to send to one another.\n    &#34;Did you know that using cell phones is the least secure form of communication?&#34; the video asks. &#34;Did you know regular email is similar to sending post cards? Did you know that SMS texts are sent in plaint text?&#34;\n  Ramos typically didn&#39;t directly interact with his user base, which at the time was primarily Canadian. Administrators for Phantom handled new subscriptions, initiated device wipes, or removed accounts, according to court records. Bruno, who visited a Phantom office in Vancouver, said it was a 300-square-meter modern, clean office, but wasn&#39;t like an ordinary tech or startup space. Below the administrators, Ramos hired distributors, who essentially acted as middlemen between individual agents who sold phones to users, and the main Phantom company itself that the distributors would send their cut back up to. Bruno graduated from being a Phantom user to a distributor; a common route among other encrypted phone companies. Eventually he became a wholesaler.\n  Bruno and the source with knowledge of Phantom&#39;s operations both said that the company had a customer support center based in India. Website registration and online corporate records reveal a company linked to Phantom&#39;s CTO which does remote customer support and has a branch in Jalandhar, Punjab.\n  With Phantom&#39;s structure, Ramos was fairly hands-off with a large chunk of his customers, letting the workers sell the phones in their own geographic territories.\n     But Phantom had holes in how it hired distributors. Bruno said he moved to Asia to start selling the devices there. At first, Bruno said he simply sold the phones in exchange for envelopes of cash, but soon tried to tighten up the operation. He said he started to carry out due diligence on the sellers underneath him to make sure he was providing phones to legitimate industries and clients. He requested personal details so he could work out banking compliance and asked distributors to fill out anti-money laundering (AML) forms, where they provided names, addresses, and a form of identification so the company could verify who they were dealing with. Bruno provided Motherboard with a cache of internal Phantom documents, including filled out AML forms and bank statements, as well as driver licenses of distributors, to demonstrate some of the checks he carried out.\n  Early on, there were signs that Phantom&#39;s client base included criminals. Bruno said he turned down some &#34;unsavory characters&#34; looking to do business, &#34;simply out of fear, let alone God knows what they were doing.&#34; Bruno filtered out the more suspicious individuals, he said.\n  Ramos, meanwhile, wasn&#39;t asking for much of this verification himself, according to Bruno. One of Phantom&#39;s policies was that it did not collect client names, but parts of the company also weren&#39;t verifying who was selling phones in the first place.\n  &#34;Lack of screening anyone who resold the product, lack of formal contracts based on jurisdictions,&#34; Bruno said. Bruno added that he had to make a contract for Ramos to sign and return because Phantom itself never got around to making one. Bruno provided Motherboard with a copy of the contract.\n  &#34;As [Ramos] built the business, he didn&#39;t really know who he was dealing with,&#34; Ramos&#39; family member said. But ultimately, &#34;we knew there were probably some people who were getting it for more nefarious purposes.&#34;\n  And some distributors were clearly keen to sell Phantom&#39;s phones to criminals. &#34;I sold to people only that we&#39;re  [sic] recommended or were from the zoo,&#34; a worker who used to advertise Phantom devices online said, using a slang term for prison. &#34;That&#39;s how I kept law enforcement out; even if someone contacted my site, I wouldn&#39;t answer.&#34; This reseller also uploaded images with the phrase &#34;Snitches Get Stitches&#34; to their Instagram account.\n  When Ramos would visit Bruno, he would be more interested in partying than sitting down to conduct business, Bruno said.\n  &#34;Don&#39;t get me wrong. He was a super nice guy. Soft-spoken, friendly, and cool to be around. But I was always pushing for a more professional relationship. Instead I got a guy who wanted to hang out as bros and party,&#34; he added. Rather than looking to solve conflict or tackling problems head on, Ramos wanted to be everyone&#39;s friend, Bruno said.\n  &#34;It was a shit show how he ran the business,&#34; Bruno said. &#34;I warned him to take things more seriously, and to enforce some form of compliance as the carelessness of his actions and the actions of other distributors was bad for his company and myself and others.&#34;\n  Ramos kept saying he wanted to be like Uber—just flood the market with devices and figure out regulations later, Bruno said. Soon, Phantom would have a monopoly over one country in particular.\n  A kilogram of cocaine in Australia can go for over eight times what it costs in the United States because of how difficult it is to smuggle drugs into the country. And top-level drug dealers needed a tool they could rely on and wouldn&#39;t let law enforcement listen in.\n    &#34;Uncrackable phones provided by Phantom Secure linked to murder of Hells Angels bikies,&#34; the  headline on a March 2014 ABC article read. The report said that Australian law enforcement agencies were unable to monitor the communications of powerful criminals because of their use of encrypted phones. Even the Australian Signals Directorate, the country&#39;s version of the NSA, could not break through the encryption, it added. Intelligence agencies often can&#39;t crack encryption itself—instead, they work around it by hacking phones or introducing vulnerabilities themselves—but prospective viewers didn&#39;t need to know that.\n  ABC also aired a TV-spot including interviews with cyber security experts explaining Phantom&#39;s remote wipe feature and how that could specifically help if law enforcement seized the phone, as well as how Phantom deletes credit card information after a customer has paid for their device.\n  In the article, the outlet wrote that &#34;the ABC does not suggest the company itself is aware its products are being used by criminals, only that criminals have become aware of the phone&#39;s utility and have taken advantage.&#34; Phantom did not respond to a request for an interview from ABC at the time, the report added.\n    &#34;This is the best verification on what we have been saying all along—proven and effective for now over 9 years,&#34; Ramos wrote to a Phantom employee in a message after the article was published, according to a copy of the text published in court records. &#34;It is the highest level of official authority confirming our effectiveness. It can&#39;t get better than that.&#34; For Ramos, that criminals were using Phantom wasn&#39;t an issue, but a business opportunity. One Phantom reseller uploaded the ABC TV-spot to their own YouTube channel, promoting their devices.\n    Phantom&#39;s use exploded in Australia, with distributors in the country selling the devices to criminals. Li Wang, one Phantom seller, had around 800 clients from different criminal networks, and his apartment was littered with BlackBerries, tens of thousands of dollars in cash, and meth, according to  Australian media reports.\n  Phantom distributors based all across the country were selling the phones, according to an FBI document obtained by Motherboard. Queensland, Victoria, New South Wales, and other areas all had teams of people selling Phantom phones. The FBI document added that Phantom initially got a foothold in the country because it partnered with large scale drug traffickers—or &#34;influencers&#34;—who required anyone wishing to do business to also use a Phantom device.\n  One former Phantom distributor in Australia who is named in the FBI document told Motherboard that selling the phones &#34;was perfectly legal, our company was registered.&#34;\n  The New South Wales Crime Commission, an Australian government body that aims to reduce organized crime in the region, wrote in  one of its annual reports that &#34;the prolific use of encrypted Blackberry devices continued unabated and, as in previous years, these devices were used to facilitate drug trafficking.&#34; Australia&#39;s national criminal intelligence agency  specifically named Phantom as a go-to choice for organized crime groups, as well as the encrypted messaging app Wickr.\n  One legal document obtained by Motherboard describes how lawyers for a Phantom seller had &#34;high level meetings with executive members of the Australian Crime Commission (ACC) concerning Phantom Secure&#39;s operations in Australia.&#34; The letter is from several years after Phantom had already attracted the attention of Australian law enforcement. (The Australian Criminal Intelligence Commission, which the ACC merged into in July 2016, dec\n......", "posttime": "2020-10-22 23:50:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,secretive,幻影", "title": "网络：一家神秘的电话公司如何帮助犯罪世界走向黑暗", "title_en": "The Network: How a Secretive Phone Company Helped the Crime World Go Dark", "transed": 1, "url": "https://www.vice.com/en/article/v7m4pj/the-network-vincent-ramos-phantom-secure", "via": "", "real_tags": ["帮助", "secretive", "幻影"]}, {"category": "", "categoryclass": "", "imagename": "ad94220519e95de71f37cfbc8c476115.jpg", "infoid": 1030581, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们第一次看到了特斯拉的全自动驾驶Beta软件更新，因为一些正在测试它的车主正在分享视频，看起来简直是疯了。\n经过几个月的努力，特斯拉对其自动驾驶和全自动驾驶套装进行了彻底的核心重写，现在已经开始全面推出自动驾驶测试版。\n正如预期的那样，新的更新可以打开城市街道，并链接到特斯拉的Autopilot功能导航，提供一个几乎功能齐全的自动驾驶系统，司机需要不断监控。\n特斯拉在完整的自动驾驶测试版更新的发布说明中非常明确地表示，如果监控不当，可能会很危险：\n全自动驾驶还处于早期的限制访问Beta阶段，使用时必须格外小心。它可能会在最糟糕的时候做错事，所以你必须始终把手放在方向盘上，并格外注意道路。不要自满。\n启用全自动驾驶后，您的车辆将在高速公路上进行车道转换，选择岔道以跟随您的导航路线，在其他车辆和对象周围导航，并进行左转和右转。只有当你经常注意道路，并准备好立即采取行动，特别是在盲角、十字路口、十字路口和狭窄的驾驶情况下，才能在有限的Beta版中使用完全自动驾驶。\n这家汽车制造商目前只向Early Access计划中有限数量的车主发送更新，并计划在未来几周逐步将其推向更多人。\n由于它是基于许多神经网络的，随着更多的人使用和纠正它，预计该系统将迅速改进。\n一些车主开始分享特斯拉全自动驾驶Beta软件正在工作的图片，这表明特斯拉更新了驾驶可视化，提供了更多信息。\n以下是推特用户@brandonee916的快速浏览，他收到并激活了更新：\n这是真正的…。这是开发UI的一部分，是测试版。Pic.twitter.com/SmhCrftJcc。\n当沿路有很多物体和标志时，驾驶的可视化效果看起来有点疯狂。\n在环形交叉口…时过于谨慎。在这个过程结束之前，我不需要互动。第一次尝试还不错！加油消防队测试版！Pic.twitter.com/3gPkztUWgY。\n正如你所看到的，特斯拉分享了更多关于Autopilot看到的信息，但图形看起来没有以前那么精致：\n未来就在眼前，…。FSD测试版已经到了，我希望@Tesla取得进展，尽快把它传给更多的人！DEV UI上的全交叉渲染令人难以置信。除了修改我的跟随距离之外，我没有任何互动。Pic.twitter.com/eKhvmPsAt2。\n在接下来的视频中，我们可以看到特斯拉汽车使用自动驾驶导航在十字路口左转-这在这次测试版更新之前是不可能的：\n很难拍到视频…。我很快就会拿到更好的录像带…。它打开信号灯，等待汽车和行人的…。在晚上!。不可思议的工作@特斯拉！！❤️pic.twitter.com/HL65vB1gYR。\n如果您确实获得了更新，请严格按照说明操作，并按照特斯拉的建议格外小心。\n如果您有更多特斯拉全自动驾驶测试版的视频，请随时通过电子邮件fred@electrek.co、通过Wickr：fredev或通过我的社交媒体：推特(Twitter)和Instagram与我联系。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从何说起？请查看我们的YouTube频道以了解最新的评论。", "note_en": "We get our first look at Tesla’s Full Self-Driving Beta software update, as some owners who are testing it are sharing videos, and it looks just insane.\n  After months of working on a complete core rewrite of its Autopilot and Full Self-Driving Package,  Tesla has now started its Full Self-Driving Beta rollout.\n As expected, the new update enables turns on city streets and links to Tesla’s Navigate on Autopilot features, delivering a virtually feature-complete self-driving system that drivers need to constantly monitor.\n Tesla is very clear in the release notes of the Full Self-Driving Beta update that it can be dangerous if not monitored properly:\n Full Self-Driving is in early limited access Beta and must be used with additional caution. It may do the wrong thing at the worst time, so you must always keep your hands on the wheel and pay extra attention to the road. Do not become complacent.\n  When Full Self-Driving is enabled your vehicle will make lane changes off highway, select forks to follow your navigation route, navigate around other vehicles and objects, and make left and right turns. Use Full Self-Driving in limited Beta only if you will pay constant attention to the road, and be prepared to act immediately, especially around blind corners, crossings, intersections, and in narrow driving situations.\n The automaker is currently only sending the update to a limited number of owners in the early access program, and it plans to gradually push it to more people in the coming weeks.\n Since it is based on many neural networks, the system is expected to rapidly improve as more people use it and correct it.\n Some owners are starting to share images of Tesla’s Full Self-Driving Beta software at work, and it shows that Tesla updated the driving visualizations with a lot more information.\n Here’s a quick loook from Twitter user @brandonee916 who has received and activated the update:\n It’s real… this is part of the development UI and is BETA.  pic.twitter.com/SmhCrftJcc\n When there are a lot of objects and signs along the road, the driving visualizations look kind of insane.\n  Overly cautious at a roundabout… I didn’t have to interact until the end of the process. Not bad for the first attempt! Go FSD BETA!  pic.twitter.com/3gPkztUWgY\n As you can see, Tesla is sharing a lot more information about what Autopilot is seeing, but the graphics look less refined than before:\n The future is coming… FSD BETA is here, I hope  @Tesla makes progress to get this out to more people soon! Full intersection rendering on the DEV UI is incredible. I didn’t have any interaction other than modifying my following distance.  pic.twitter.com/eKhvmPsAt2\n In this next video, we can see the Tesla vehicle performing a left turn in an intersection using Navigate on Autopilot — something that wasn’t possible before this beta update:\n Very difficult to get video shot… I’ll get a better video soon… it turned on the signal, waited for the car and pedestrians… at night! Incredible work  @Tesla !! ❤️❤️❤️❤️  pic.twitter.com/HL65vB1gYR\n If you do get the update, please follow the instructions closely and be extremely careful as Tesla recommends.\n If you have more videos of Tesla’s Full Self-Driving Beta, please feel free to contact me via email at Fred@electrek.co, via Wickr: Fredev, or through my social media:  Twitter and  Instagram.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-10-22 23:50:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,驾驶,full", "title": "先看看特斯拉全自动驾驶测试版，它看起来简直疯了", "title_en": "First Look at Tesla Full Self-Driving Beta and it looks just insane", "transed": 1, "url": "https://electrek.co/2020/10/22/tesla-full-self-driving-beta-first-look-insane/", "via": "", "real_tags": ["特斯拉", "驾驶", "full"]}, {"category": "", "categoryclass": "", "imagename": "4c8f181bc9e375116e1cb180834578ad.png", "infoid": 1030580, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "QUIC是一种新的互联网传输协议，用于安全、可靠和多路复用的通信。HTTP/3构建在Quic之上，利用新功能来修复性能问题，如队头阻塞。这使得网页加载速度更快，特别是在麻烦的网络上。\nQUIC和HTTP/3是在IETF中开发了几乎整整4年的开放标准。2020年10月21日，经过两轮工作组Last Call之后，描述Quic和HTTP/3的文档家族中的32个草案被放入IETF Last Call。这对集团来说是一个重要的里程碑。我们现在告诉整个IETF社区，我们认为我们差不多完成了，我们将欢迎他们的最终审查。\n就我个人而言，我以某种形式与奎克打交道已经有很多年了。今年早些时候，我很荣幸被邀请帮助担任工作组的共同主席。我很高兴能帮助这些文件度过这个重要的阶段，并感谢所有参与其中的人所做的努力，特别是编辑们。我也对未来在Quic v1上发展的机会感到兴奋，以帮助建立更好的互联网。\n协议开发有两个方面。一个方面涉及编写和迭代描述协议本身的文档。然后，实现、部署和测试库、客户端和/或服务器。这些方面齐头并进，帮助工作组朝着实现其章程所列目标迈进。IETF Last Call标志着团队和他们负责的区域总监(在本例中为Magnus Westlund)相信这项工作已基本完成。现在是向更广泛的IETF社区征求反馈意见以供审查的时候了。在Last Call期间结束时，利益相关者将进行盘点，根据需要处理反馈，并祈祷进入下一步，要求将文档作为RFC发布在标准轨道上。\n尽管规范和实现齐头并进，但它们通常以不同的速度进行，这是完全没有问题的。到目前为止，Quic规范已经成熟且可部署了很长一段时间。从2019年9月开始，HTTP/3就可以在Cloudflare边缘上使用，我们很高兴看到Chrome、Firefox、Safari、CURL等用户代理推出了对HTTP/3的支持。虽然32草案是最新的规范，但社区暂时还是将29草案作为互操作性的坚实基础。这不应该令人惊讶，因为基础方面明确了迭代之间的更改范围减少。对于街上的普通人来说，29岁和32岁之间并没有太大的区别。所以今天，如果你访问一个启用了http/3的网站，比如https://cloudflare-quic.com，你可能会看到包含Alt-Svc：h3-29=&#34；…的响应头。。不久之后，一旦最后一次通话完成，RFC发货，您将开始看到网站简单地提供Alt-Svc：h3=#34；…。(注意，没有草稿版本！)。\n我们在https://cloudflare-quic.com.上收集了一堆资源链接。如果您更喜欢交互式视觉学习，您可能会很高兴听到我还在Cloudflare TV上主持了一部名为“用HTTP提升网络性能”的系列剧。有超过12个小时的内容，包括Quic的基础知识，使用Wireshark等工具测量和调试运行中的协议的方法，以及几个深入探讨特定主题的内容。我也很幸运，沿途有一些客座专家和我一起。下表概述了可供点播的剧集。\n那么，Last Call是否意味着Quic已经完成了？希望不大。新协议是互联网的一次巨大飞跃，因为它带来了新的机会和创新。Quicv1基本上是已进入最后调用的文档集。我们将继续看到人们获得部署和测试这一功能的经验，毫无疑问，关于调整参数以提高效率和性能的很酷的博客帖子也会出现在雷达上。但是Quic和HTTP/3是可扩展的，所以我们会看到人们对尝试新事物感兴趣，比如多路径、不同的拥塞控制方法，或者不可靠地传输数据的新方法，比如数据报帧。\n我们还看到人们对将Quic用于其他用例感兴趣。将DNS等其他应用程序协议映射到Quic是实现其改进的一种快速方法。我们看到人们想要使用Quic作为承载其他传输协议的基底，因此成立了假面工作组。有些人想使用Quic和HTTP/3作为增强型WebSocket，于是WebTransport工作组应运而生。\nQuic HTTP3速度安全", "note_en": "QUIC is a new Internet transport protocol for secure, reliable and multiplexed communications. HTTP/3 builds on top of QUIC, leveraging the new features to fix performance problems such as Head-of-Line blocking. This enables web pages to load faster, especially over troublesome networks.\n QUIC and HTTP/3 are open standards that have been under development in the IETF  for almost exactly 4 years. On October 21, 2020, following two rounds of Working Group Last Call, draft 32 of the family of documents that describe QUIC and HTTP/3 were put into  IETF Last Call. This is an important milestone for the group. We are now telling the entire IETF community that we think we&#39;re almost done and that we&#39;d welcome their final review.\n  Speaking personally, I&#39;ve been involved with QUIC in some shape or form for many years now. Earlier this year I was honoured to be asked to help co-chair the Working Group. I&#39;m pleased to help shepherd the documents through this important phase, and grateful for the efforts of everyone involved in getting us there, especially the editors. I&#39;m also excited about future opportunities to evolve on top of QUIC v1 to help build a better Internet.\n There are two aspects to protocol development. One aspect involves writing and iterating upon the documents that describe the protocols themselves. Then, there&#39;s implementing, deploying and testing libraries, clients and/or servers. These aspects operate hand in hand, helping the Working Group move towards satisfying the goals listed in its charter. IETF Last Call marks the point that the group and their responsible Area Director (in this case Magnus Westerlund) believe the job is almost done. Now is the time to solicit feedback from the wider IETF community for review. At the end of the Last Call period, the stakeholders will take stock, address feedback as needed and, fingers crossed, go onto the next step of requesting the documents be published as RFCs on the Standards Track.\n Although specification and implementation work hand in hand, they often progress at different rates, and that is totally fine. The QUIC specification has been mature and deployable for a long time now. HTTP/3 has been  generally available on the Cloudflare edge since September 2019, and we&#39;ve been delighted to see support roll out in user agents such as Chrome, Firefox, Safari, curl and so on. Although draft 32 is the latest specification, the community has for the time being settled on draft 29 as a solid basis for interoperability. This shouldn&#39;t be surprising, as foundational aspects crystallize the scope of changes between iterations decreases. For the average person in the street, there&#39;s not really much difference between 29 and 32.   So today, if you visit a website with HTTP/3 enabled—such as  https://cloudflare-quic.com—you’ll probably see response headers that contain Alt-Svc: h3-29=&#34;… . And in a while, once Last Call completes and the RFCs ship, you&#39;ll start to see websites simply offer Alt-Svc: h3=&#34;… (note, no draft version!).\n  We&#39;ve collected a bunch of resource links at  https://cloudflare-quic.com. If you&#39;re more of an interactive visual learner, you might be pleased to hear that I&#39;ve also been hosting a series on  Cloudflare TV called &#34;Levelling up Web Performance with HTTP/3&#34;. There are over 12 hours of content including the basics of QUIC, ways to measure and debug the protocol in action using tools like Wireshark, and several deep dives into specific topics. I&#39;ve also been lucky to have some guest experts join me along the way. The table below gives an overview of the episodes that are available on demand.\n     So does Last Call mean QUIC is &#34;done&#34;? Not by a long shot. The new protocol is a giant leap for the Internet, because it enables new opportunities and innovation. QUIC v1 is basically the set of documents that have gone into Last Call. We&#39;ll continue to see people gain experience deploying and testing this, and no doubt cool blog posts about tweaking parameters for efficiency and performance are on the radar. But QUIC and HTTP/3 are extensible, so we&#39;ll see people interested in trying new things like multipath, different congestion control approaches, or new ways to carry data unreliably such as the  DATAGRAM frame.\n We&#39;re also seeing people interested in using QUIC for other use cases. Mapping other application protocols like DNS to QUIC is a rapid way to get its improvements. We&#39;re seeing people that want to use QUIC as a substrate for carrying other transport protocols, hence the formation of the  MASQUE Working Group. There&#39;s folks that want to use QUIC and HTTP/3 as a &#34;supercharged WebSocket&#34;, hence the formation of the  WebTransport Working Group.\n  QUIC  HTTP3  Speed  Security", "posttime": "2020-10-22 23:50:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞跃,quic", "title": "互联网的巨大飞跃--Quic的最后呼唤", "title_en": "A Last Call for QUIC, a Giant Leap for the Internet", "transed": 1, "url": "https://blog.cloudflare.com/last-call-for-quic/", "via": "", "real_tags": ["飞跃", "quic"]}]