[{"category": "", "categoryclass": "", "imagename": "da333b6bf553d1269aad012724752b43.jpg", "infoid": 1069134, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦一家法院表示，英国软件公司 Autonomy 的创始人可以被引渡到美国，面临共谋和欺诈指控。迈克·林奇在 2011 年以 110 亿美元的价格将 Autonomy 卖给了美国计算机巨头惠普（HP）。他的律师、高伟绅律师事务所的克里斯·莫维罗表示，林奇博士对裁决感到失望并将上诉。林奇博士一直在伦敦高等法院面临民事指控，惠普正在起诉他对这笔交易的损害赔偿。但另外，美国司法部（DoJ）正在对他提起刑事指控。迈克尔·斯诺法官表示，他将在不等待民事判决的情况下就该诉讼作出裁决，称这“在本案中意义有限”。林奇博士在伦敦被法官保释。林奇博士告诉 BBC Radio 4 的 PM 节目，该决定并不意外，因为英国与美国签订的引渡条约的条款。 “我们有这种不平衡和默认的引渡条约，可用于[在]与美国公司及其利益发生的任何争端。”\n“这个引渡条约的疯狂之处在于它不依赖任何事实，”他说。林奇博士补充说，他认为引渡条约“不平衡”，英国公众没有意识到美国司法系统的运作方式与英国完全不同。他说，司法部没有等待英国高等法院的完整判决，这“特别令人震惊”，该判决将在九周后到期。他声称，他在 2019 年被判入狱五年的前首席财务官 Sushovan Hussain 没有得到公正的审判。林奇博士说，没有辩护证人出现在侯赛因先生的审判中，因为他们被告知如果他们进入美国将被逮捕。他的律师莫维洛先生说：“应美国司法部的要求，法院裁定，应将经营一家在伦敦证券交易所上市的英国公司的英国公民引渡到美国，因为他在英国的行为受到指控。 “我们说这个案子属于英国。如果内政大臣仍然决定下令引渡，林奇博士打算上诉。”英国严重欺诈办公室 (SFO) 于 2013 年调查了这笔交易，两年后因“证据不足”而撤销此案。\nAutonomy 由 Lynch 博士于 1996 年创立。它开发的软件可以从“非结构化”数据源（例如电话、电子邮件或视频）中提取有用信息，然后执行诸如向呼叫中心接线员或监视器建议答案等操作文字或主题的电视频道。在被惠普收购之前，它的总部位于旧金山和英国剑桥。 2010 年，Autonomy 报告的收入中约有 68% 来自美国和美洲其他地区。惠普和美国检察官指控林奇博士和其他前 Autonomy 高管在 2009 年至 2011 年间人为夸大了这家软件公司的收入和收益，导致惠普为该公司支付了过高的费用。但林奇博士辩称，惠普在 2011 年交易后利用这些指控掩盖了自己对 Autonomy 的管理不善。 “我认为我们在 Autonomy 没有做错任何事，但让我提醒你，惠普出于自愿决定为 Autonomy 支付比伦敦股票市场价格高 70% 的价格，”他告诉第 4 电台“这是一笔天文数字，但这是他们的选择——而不是我们的选择。”\n林奇博士还批评 SFO 未能清除他的罪名：“SFO 因没有认罪而受到很多批评，但就我而言，他们也未能清除无辜者。他们进行了调查，发现没有错，但基本上坐在那里。“当我们国家的无辜公司受到照顾自己利益的国家的司法干预时，保护他们很重要。”", "note_en": "The founder of UK software firm Autonomy can be extradited to the US to face charges of conspiracy and fraud, a London court has said.\n Mike Lynch sold Autonomy to US computer giant Hewlett Packard (HP) for $11bn in 2011.\n  His lawyer, Chris Morvillo of Clifford Chance, said Dr Lynch was disappointed by the ruling and would appeal.\n Dr Lynch has been facing civil charges at the High Court in London, where HP is suing him for damages over the deal. But separately, the US Department of Justice (DoJ) is pursuing criminal charges against him.\n Judge Michael Snow said he would deliver his ruling in that action without awaiting the civil verdict, saying it was &#34;of limited significance in the case&#34;. Dr Lynch was released on bail by the judge in London.\n   Dr Lynch told BBC Radio 4&#39;s PM programme that the decision was not unexpected, because of the terms of the extradition treaty the UK has with the US.\n &#34;We have this imbalance and this default extradition treaty which can be used [in] any dispute that&#39;s going on with American companies and their interests.&#34;\n &#34;The insanity of this extradition treaty [is that] it doesn&#39;t rely on any facts,&#34; he said.\n Dr Lynch added that he felt the extradition treaty was &#34;imbalanced&#34; and that the British public did not realise that the US justice system works entirely differently to the UK&#39;s.\n He said it was &#34;particularly egregious&#34; that the DoJ was not waiting to see the full judgement from the UK High Court, which will be due in nine weeks&#39; time.\n He claimed his former chief financial officer Sushovan Hussain, who was jailed for five years in 2019, did not receive a fair trial. Dr Lynch said no defence witnesses turned up to Mr Hussain&#39;s trial because they were told they would be arrested if they entered the US.\n  His lawyer Mr Morvillo said: &#34;At the request of the US Department of Justice, the court has ruled that a British citizen who ran a British company listed on the London Stock Exchange should be extradited to America over allegations about his conduct in the UK.\n &#34;We say this case belongs in the UK. If the home secretary nonetheless decides to order extradition, Dr Lynch intends to appeal.&#34;\n  The UK&#39;s Serious Fraud Office (SFO) investigated the deal in 2013, before dropping the case two years later because of &#34;insufficient evidence&#34;.\n Autonomy was founded by Dr Lynch in 1996. It developed software that could extract useful information from &#34;unstructured&#34; sources of data such as phone-calls, emails or video, and then do things such as suggest answers to a call-centre operator or monitor TV channels for words or subjects.\n Before it was bought by HP, it had headquarters in San Francisco and Cambridge in the UK.\n In 2010, about 68% of Autonomy&#39;s reported revenues came from the US and elsewhere in the Americas.\n  HP and US prosecutors allege that Dr Lynch and other former Autonomy executives artificially inflated the software company&#39;s revenues and earnings between 2009 and 2011, causing HP to overpay for the firm.\n But Dr Lynch has argued that HP used the allegations to cover up its own mismanagement of Autonomy after the 2011 deal.\n &#34;I don&#39;t think that we did anything wrong at Autonomy, but let me remind you that HP, of its own free will, decided to pay 70% more for Autonomy than its price on the London stock market,&#34; he told Radio 4.\n &#34;It was an astronomical amount of money, but it was their choice - not ours.&#34;\n Dr Lynch is also critical of the SFO for failing to clear him: &#34;The SFO has had a lot of criticism for not getting the guilty, but in my case, they&#39;ve also failed to clear the innocent. They&#39;ve investigated, found nothing wrong, and yet have basically sat there.\n &#34;It&#39;s important to defend the innocent companies in our country when they are subject to judicial overreach from countries that are looking after their own interests.&#34;", "posttime": "2021-07-23 07:27:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,引渡,founder", "title": "Autonomy 创始人迈克林奇可以被引渡到美国", "title_en": "Autonomy Founder Mike Lynch Can Be Extradited To US", "transed": 1, "url": "https://www.bbc.com/news/business-57933718", "via": "", "real_tags": ["美国", "引渡", "founder"]}, {"category": "", "categoryclass": "", "imagename": "aa478a9c65e00f0b965772729f14c58e.jpg", "infoid": 1069133, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在 3 月份，摩托罗拉就推出了 Moto G 系列的第一款旗舰手机：Moto G100。 G100 是第一款配备骁龙 800 系列芯片组的 Moto G 手机，特别是骁龙 870，但与摩托罗拉的 Edge+ 不同，G100 并没有破产。现在，摩托罗拉已经在美国推出了 Moto G100，并从今天开始上市。 Moto G100 凭借其骁龙 870 芯片组提供旗舰级性能，骁龙 865 的超频变体为摩托罗拉之前的 Edge+ 旗舰产品提供动力。该芯片组搭配 8GB RAM 和 128GB 内部存储，后者可通过 microSD 卡扩展至 1TB。这款手机由坚固的 5000mAh 电池供电；不支持无线充电，但可以通过随附的 20W 适配器为手机电池充电。在背面，Moto G100 配备三摄像头设置，包括一个 64MP 主摄像头、一个 16MP 超广角摄像头和一个 2MP 深度传感器。超广角相机兼作微距相机，并具有环形灯以照亮附近的拍摄对象，如特色图片所示。在正面，这款手机配备了一个 16MP 自拍相机和一个 8MP 广角相机，以容纳更多人。在正面，该手机具有 6.7 英寸 LCD 面板，分辨率为 2520×1080 像素，宽高比为 21:9。刷新率最高为 90Hz。由于 DisplayPort 备用模式支持，显示器可以扩展到外部显示器或电视，一旦扩展，摩托罗拉的“Ready For”软件就会接管以提供类似桌面的体验。与欧洲型号不同，美国 Moto G100 似乎没有专用的 Google Assistant 按钮（这是美国版摩托罗拉手机的典型特征）。它保留了嵌入电源按钮的指纹扫描仪、3.5 毫米耳机插孔和 microSD卡槽，但是。 Moto G100 在美国提供三种颜色：虹彩海洋、虹彩天空和石板灰。它与 AT&amp;T 和 T-Mobile 以及在其网络上运行的所有 MVNO 兼容。但是，它仅支持 AT&amp;T 网络上的 4G LTE，因此您需要使用 T-Mobile 或 T-Mobile MVNO 才能通过运营商的 sub-6GHz NSA 网络获得 5G 连接。考虑到这一点，您今天可以从 motorola.com 购买 Moto G100。摩托罗拉在有限的时间内为这款手机打折了 100 美元，因此它目前的售价为 499.99 美元。它不是你在美国能买到的最便宜的 5G 手机，但考虑到它的规格，它确实物超所值。\nMoto G100 是摩托罗拉首款具有旗舰级规格的 Moto G 手机，它终于在美国上市了", "note_en": "Back in March, Motorola launched its first flagship phone in the Moto G line:  the Moto G100. The G100 is the first Moto G phone with a Snapdragon 800-series chipset, specifically the  Snapdragon 870, but unlike Motorola’s Edge+, the G100 didn’t break the bank. Now, Motorola has launched the Moto G100 in the U.S., and it’s available starting today.\n  The Moto G100 offers flagship-level performance thanks to its Snapdragon 870 chipset, an overclocked variant of the Snapdragon 865 that powered Motorola’s previous Edge+ flagship. The chipset is paired with 8GB of RAM and 128GB of internal storage, the latter of which is expandable by up to 1TB with a microSD card. The phone is powered by a beefy 5000mAh battery; there’s no wireless charging support, but the phone’s battery can be charged via the included 20W adapter.\n On the rear, the Moto G100 sports a triple camera setup, comprised of a 64MP main camera, a 16MP ultra wide-angle camera, and a 2MP depth sensor. The ultra wide-angle camera doubles as a macro camera and has a ring light to illuminate nearby subjects, as shown in the featured image. On the front, the phone has a 16MP selfie camera joined by an 8MP wide-angle camera to fit more people in the frame.\n On the front, the phone has a 6.7-inch LCD panel at 2520×1080 pixel resolution for a 21:9 aspect ratio. The refresh rate maxes out at 90Hz. The display can be extended to an external monitor or TV thanks to DisplayPort Alternate Mode support, and once extended,  Motorola’s “Ready For” software takes over to provide a desktop-like experience.\n Unlike the European model, the American Moto G100 seems to lack the dedicated Google Assistant button (as is typical with U.S. versions of Motorola phones.) It does retain the fingerprint scanner embedded in the power button, the 3.5mm headphone jack, and the microSD card slot, however.\n The Moto G100 is available in the U.S. in three colors: Iridescent Ocean, Iridescent Sky, and Slate Grey. It’s compatible with both AT&amp;T and T-Mobile as well as all MVNOs operating on their networks. However, it only supports 4G LTE on AT&amp;T’s network, so you’ll need to be on T-Mobile or a T-Mobile MVNO to get 5G connectivity through the carrier’s sub-6GHz NSA network.\n With that in mind, you can  buy the Moto G100 from motorola.com today. Motorola has discounted the phone by $100 for a limited time, so it’s currently on sale for $499.99. It’s not the  cheapest 5G phone you can buy in the States, but it does give a lot of bang for the buck considering its specs.\n  The Moto G100 is Motorola&#39;s first Moto G phone with flagship-level specs, and it&#39;s finally available in the U.S.", "posttime": "2021-07-23 07:26:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,xda,手机", "title": "XDA 开发人员", "title_en": "XDA Developers", "transed": 1, "url": "https://www.xda-developers.com/moto-g100-us-launch/", "via": "", "real_tags": ["开发", "xda", "手机"]}, {"category": "", "categoryclass": "", "imagename": "8f1360cbd29a84fa7cf021fdd675f3cd.jpg", "infoid": 1069132, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "摩托罗拉在今年早些时候向拉丁美洲和欧洲市场推出 Moto G100 之后，现在正在美国销售它。它配备中端规格，例如 5,000 毫安时的大电池、5G 和 90Hz 屏幕，建议零售价为 599 美元。从即日起至 8 月 5 日，摩托罗拉提供全零售价 100 美元的折扣。 G100 的美国运营商兼容性有两个重要的脚注：它是仅支持 GSM 的手机，因此适用于 AT&amp;T 和 T-Mobile 但不适用于 Verizon，其 5G 连接仅与 T-Mobile 的 5G 网络兼容。除此之外，它似乎是一款受人尊敬的中端设备，如果价格偏高的话。它使用具有 8GB RAM、低于 6GHz 5G 的 Snapdragon 870 处理器和具有 90Hz 刷新率的 6.7 英寸 1080p 显示屏。摩托罗拉今年在美国发布的手机集中在 200-400 美元的范围内，使 G100 成为该公司最近在美国推出的价格较高的设备之一。虽然大电池、刷新速度更快的屏幕和更高级的处理器感觉适合其 599 美元的价格标签，但它缺乏 IP 等级和广泛的运营商/5G 支持可能会使其与三星 A52 5G 或Pixel 4A 5G（如果你还能找到的话）。", "note_en": "Motorola is  now selling the Moto G100 in the US, after  introducing it earlier this year for Latin American and European markets. It comes with midrange specs like a big 5,000mAh battery, 5G, and a 90Hz screen for a $599 MSRP. From now until August 5th, Motorola is offering a $100 discount off the full retail price.\n There are two important footnotes on the G100’s US carrier compatibility: it’s a GSM-only phone, so will work on AT&amp;T and T-Mobile but not Verizon, and its 5G connectivity is only compatible with T-Mobile’s 5G network. Outside of that, it appears to be a respectable midrange device, if priced a little on the high end. It uses a Snapdragon 870 processor with 8GB of RAM, sub-6GHz 5G, and a 6.7-inch 1080p display with 90Hz refresh rate.\n Motorola’s US phone releases this year have been concentrated around the $200-400 range, making G100 one of the pricier devices the company has introduced stateside recently. While a big battery, faster-refreshing screen, and a higher-tier processor feel fitting of its $599 price tag, its lack of IP-rating and broad carrier / 5G support could set it back against similarly priced peers like the Samsung A52 5G or the Pixel 4A 5G (if you can still find one).", "posttime": "2021-07-23 07:26:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,芯片,美国,上市,camera", "title": "摩托罗拉旗舰 Moto G100 手机于 3 月推出，现已在美国上市，售价 599 美元，配备三摄像头设置、Snapdragon 870 芯片组、128 GB 存储空间", "title_en": "Motorola's flagship Moto G100 phone, launched in March, is now available in the US for $599, with triple camera setup, Snapdragon 870 chipset, 128 GB of storage", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22589232/motorola-moto-g100-price-specs-screen-battery?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["手机", "芯片", "美国", "上市", "camera"]}, {"category": "", "categoryclass": "", "imagename": "a94f912466f94eac5dd0d54179428caa.jpeg", "infoid": 1069131, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州州长加文·纽瑟姆 (Gavin Newsom) 本周承诺在一场旋风般的“加利福尼亚复出”之旅中安置和养活世界上的无家可归者，该之旅旨在避免愤怒的选民在 9 月召回。金州已经在全国最大的无家可归人口和 COVID-19 后最糟糕的经济气候之一的重压下崩溃。随着数百万中产阶级居民和企业主逃往红州，留下来的人看到了新兴的下层阶级出现。一些县的汽油价格为每加仑 5 美元，180,000 名无家可归者挤进所有蓝色城市，破旧的高速公路上散落着垃圾。甚至大西洋杂志也在一篇题为“加州梦正在消亡”的长篇文章中概述了敌对的经济环境。正是在这种背景下，纽瑟姆周一召开了新闻发布会，承诺在已经花费的数十亿美元的基础上，再投入 120 亿美元用于解决无家可归问题。人们会得到照顾，任何想要实现加州梦的人都受到欢迎，他在回答记者问他是否希望国家的无家可归者带着这笔新支出来到加州时说。纽森说：“这是关于让人们远离街头，摆脱危机事件，在他们所在的地方与人们会面，以及人们想要来这里寻找新的开始和所有收入水平的程度，这是加州梦想的一部分。” “我们有责任容纳、活跃和鼓舞人心，加州的梦想仍然存在并且很好。”纽森补充说：“我为来自世界各地的人们再次关注加州寻找机会而感到自豪，而且这不应该只针对某些人。无论收入水平如何，无论生活状况如何，所有人都应该向往加州梦想。”\n加利福尼亚州是全美税收最高的州，对于普通居民来说，买房是遥不可及的。纽森没有提到这一点，而是指出了 800 亿美元的预算盈余，他说这笔钱足以帮助所有人实现美国梦。洛杉矶县警长亚历克斯·维拉纽瓦（Alex Villanueva）听取了纽森的信息，对所听到的内容并不满意。尽管今年预算削减了 1.45 亿美元，但维拉纽瓦仍试图弥补犯罪率上升和无家可归者人数增加的差距。 “那些评论让我们大吃一惊，我们正努力保持头脑清醒，他就这么说？”维拉纽瓦告诉华盛顿审查员。 “当他邀请全国其他无家可归的人到加利福尼亚时，这就是死亡之愿。” Villanueva表示，洛杉矶县洛杉矶县的凶杀案比去年增长了58％，新选区院士乔治·瓦尔康拒绝举办侦探带来的侦查犯罪案件5,900件刑事案件。加斯康在一个少起诉和更多社区援助违法者的平台上运行。 “凭借 [Gascon] 的特权成长，这不会影响他，”维拉纽瓦说。 “我在街上遇到患有精神疾病的无家可归者，他们袭击居民，放火烧他们的房子，并用汽车碾过他们。随着无家可归者人数的增加，暴力程度就像往火上泼汽油一样。”纽森在新闻发布会上说：“归根结底，我们必须承担责任，承担更多责任，做得更多，做得更好。”\n“这就是这个预算打算做的事情，它是关于结果的，”他补充道。", "note_en": "California Gov. Gavin Newsom pledged to house and feed the world’s homeless population this week during a whirlwind “Comeback California” tour that is designed to stave off a September recall by angry voters.\n The Golden State is already cracking under the weight of the nation’s largest homeless population and one of the worst economic climates post-COVID-19. With millions of middle-class residents and business owners fleeing to red states, those left behind have seen a burgeoning lower class emerge.\n  Gasoline is pushing $5 a gallon in some counties, 180,000 homeless pack into all the blue cities, and dilapidated freeways are strewn with trash.\n Even the Atlantic outlined the hostile economic environment in a lengthy article titled “ The California Dream is Dying.”\n It’s against this backdrop that Newsom held a  press conference Monday pledging $12 billion to combat homelessness on top of billions that have already been spent. People will be taken care of, and anyone who wants to avail themselves to the California dream is welcome, he said in response to a reporter who asked whether he expected the nation’s homeless to descend upon California with this new expenditure.\n “It’s about getting people off the streets, out of incidents of crisis, and meeting people where they are and to the extent that people want to come here for new beginnings and all income levels, that’s part of the California dream,” Newsom said. “We have a responsibility to accommodate and enliven and inspire, and California’s dream is still alive and well.”\n Newsom added: “I’m proud of people from around the world looking at California again for opportunity, and that, again, that should not just be for certain people. All people should aspire to that California dream regardless of their income level and regarding their lot in life.”\n California is the highest-taxed state in the nation, and buying a home is out of reach for the average resident. Newsom did not mention this but rather pointed to an $80 billion budget surplus that he said is enough money to help all achieve the American dream.\n  Los Angeles County Sheriff Alex Villanueva listened to Newsom’s message and was not pleased with what he heard.\n  Villanueva has tried to stand in the gap of rising crime and increased homelessness despite a $145 million “ defund the police” cut to his budget in the current year.\n “Those comments blew us away, we are trying to keep our heads above water, and he goes and says that?” Villanueva told the Washington Examiner. “When he invites the rest of the nation’s homeless to California, that is the death wish.”\n Homicides in Los Angeles County are up 58% from last year, and newly elected District Attorney George Gascon refused to file a record 5,900 criminal cases brought by detectives this year, Villanueva said. Gascon ran on a platform of less prosecution and more community assistance for lawbreakers.\n “With [Gascon’s] privileged upbringing, this doesn’t impact him,” Villanueva said. “I have homeless with mental illness on the streets who attack residents, set their houses on fire, and run over them with cars. Just the sheer level of violence that comes with the increase in population of homeless is like pouring gasoline on the fire.”\n  &#34;At the end of the day, we have to take accountability, responsibility, and do more, do better,&#34; Newsom said during the press conference.\n “And that’s what this budget intends to do, it’s about results,&#34; he added.", "posttime": "2021-07-23 07:26:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "邀请,newsom,加州", "title": "加文纽森邀请世界无家可归者到加州", "title_en": "Gavin Newsom invites world's homeless to California", "transed": 1, "url": "https://www.yahoo.com/now/gavin-newsom-invites-worlds-homeless-110000209.html", "via": "", "real_tags": ["邀请", "newsom", "加州"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069130, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建账户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2021-07-23 07:26:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "干扰,jamming,创建", "title": "古巴干扰火腿电台？", "title_en": "Cuba Jamming Ham Radio?", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/telecom/wireless/cuba-jamming-ham-radio-listen-for-yourself", "via": "", "real_tags": ["干扰", "jamming", "创建"]}]