[{"category": "", "categoryclass": "", "imagename": "a21e28f688d1d9a612d0c8d65e3ac907.jpg", "infoid": 1033900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第二次封锁将扼杀我们的经济复苏，只会推迟新冠肺炎不可避免的传播。", "note_en": "A second lockdown would smother our economic recovery and only delay the inevitable spread of COVID-19.", "posttime": "2020-11-09 02:38:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经济,stronger,扼杀", "title": "为了更好的健康和更强劲的经济，不要再禁锢", "title_en": "For Better Health and a Stronger Economy, Don’t Lock Down Again", "transed": 1, "url": "https://www.nationalreview.com/2020/11/for-better-health-and-a-stronger-economy-dont-lock-down-again/", "via": "", "real_tags": ["经济", "stronger", "扼杀"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎来到编写程序，这是一个免费的编程和计算机科学在线入门课程。按照SICP的传统，本文主要关注抽象方法、编程范例和管理大型程序复杂性的技术。这些概念主要是使用Python3编程语言来说明的。除了阅读下面的章节，您还可以将您的知识应用到文本附带的编程项目中，并使用在线Python Tutor可视化程序执行。", "note_en": "Welcome to  Composing Programs, a free online introduction to programming and computer science.\t In the tradition of  SICP, this text focuses on methods for abstraction, programming paradigms, and techniques for managing the complexity of large programs. These concepts are illustrated primarily using the  Python 3 programming language.\t In addition to reading the chapters below, you can apply your knowledge to the  programming projects that accompany the text and visualize program execution using the  Online Python Tutor.", "posttime": "2020-11-09 02:38:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,编写程序,composing,编程", "title": "编写程序", "title_en": "Composing Programs", "transed": 1, "url": "http://composingprograms.com/", "via": "", "real_tags": ["程序", "编写程序", "composing", "编程"]}, {"category": "", "categoryclass": "", "imagename": "ea0c1b19cbac8fa1c29d2986552ca69e.jpeg", "infoid": 1033898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿拉伯联合酋长国迪拜(美联社)-阿联酋周六宣布对该国的伊斯兰属人法进行重大改革，允许未婚夫妇同居，放松酒精限制，并将所谓的“荣誉杀戮”定为刑事犯罪。\n个人自由的扩大反映出这个国家的形象正在发生变化，尽管该国的伊斯兰法典此前曾在本国引发针对外国人的法庭诉讼和愤怒，但该国一直试图将自己标榜为游客、寻求财富的人和企业的西化目的地。\n国营的WAM通讯社表示，这些改革旨在提升阿联酋的经济和社会地位，并“巩固阿联酋的宽容原则”。该通讯社在周末出人意料的声明中只提供了最低限度的细节。与官方有关联的报纸《国家报》(The National)广泛概述了这些变化背后的政府法令，但没有透露消息来源。\n在此之前，美国斡旋达成了阿联酋和以色列关系正常化的历史性协议，预计这将带来以色列游客和投资的涌入。与此同时，摩天大楼林立的迪拜正准备举办世博会。这项事关重大的活动预计将带来一系列商业活动和约2500万游客，原定于10月份举行，但由于冠状病毒大流行而推迟了一年。\n国家表示，这些变化将立即生效，这也反映了阿联酋统治者努力跟上国内快速变化的社会的步伐。\n阿联酋电影制作人阿卜杜拉·阿尔·卡比(Abdallah Al Kaabi)说：“我为这些进步和积极主动的新法律感到非常高兴。”他的艺术作品解决了同性恋爱情和性别认同等禁忌话题。\n他补充道：“2020年对阿联酋来说是艰难而变革性的一年。”\n变化包括取消对21岁及以上人群的饮酒、销售和持有酒的处罚。虽然烈酒和啤酒在阿联酋繁华的沿海城市的酒吧和俱乐部里随处可见，但个人需要政府颁发的许可证才能购买、运输或在家中饮酒。新规定将允许被禁止获得许可证的穆斯林自由饮用酒精饮料。\n另一项修正案允许“未婚同居”，这在阿联酋一直是一种犯罪。当涉及到外国人时，当局，特别是在更自由的金融中心迪拜，经常对外国人视而不见，但惩罚的威胁仍然挥之不去。据《国家报》报道，伊斯兰法律禁止的自杀未遂也将被定为非刑事犯罪。\n为了更好地“保护女性的权利”，政府表示将废除维护“荣誉犯罪”的法律。“荣誉犯罪”是一种广受批评的部落习俗，在这种习俗中，男性亲属可能会因攻击被视为有损家庭名誉的女性而逃避起诉。对旨在消除女性“耻辱”、滥交或不遵守宗教和文化约束的罪行的惩罚，现在对任何其他类型的攻击都是一样的。\n在一个外籍人士数量几乎是公民数量的九倍的国家，修正案将允许外国人在婚姻、离婚和继承等问题上避开伊斯兰教法法院。\n声明没有提到其他被认为是对当地习俗的侮辱行为，这些行为过去曾让外国人入狱，比如同性恋行为、变装行为和公开示爱。\n在由七个沙漠酋长国组成的联盟中，传统的伊斯兰价值观依然牢固。即便如此，昆西负责任治国研究所(Quincy Institute For Responsible Statcraft)的中东研究员安妮尔·谢林(Annelle Sheline)在Twitter上写道，巨大的变化“可以在没有太多民众抵制的情况下发生，因为公民人口太少了，尤其是在迪拜和阿布扎比这两个主要城市。”\n阿联酋是一个世袭统治的国家，长期以来一直因镇压异见而受到批评。阿联酋大约100万阿联酋人紧跟政府的路线。政党和工会仍然是非法的。", "note_en": "DUBAI, United Arab Emirates (AP) — The United Arab Emirates announced on Saturday a major overhaul of the country’s Islamic personal laws, allowing unmarried couples to cohabitate, loosening alcohol restrictions and criminalizing so-called “honor killings.”\n The broadening of personal freedoms reflects the changing profile of a country that has sought to bill itself as a Westernized destination for tourists, fortune-seekers and businesses despite its Islamic legal code that has previously triggered court cases against foreigners and outrage in their home countries.\n The reforms aim to boost the country’s economic and social standing and “consolidate the UAE’s principles of tolerance,” said state-run WAM news agency, which offered only minimal details in the surprise weekend announcement. The government decrees behind the changes were outlined extensively in state-linked newspaper The National, which did not cite its source.\n The move follows a historic U.S.-brokered deal to normalize relations between the UAE and Israel, which is expected to bring an influx of Israeli tourists and investment. It also comes as skyscraper-studded Dubai gets ready to host the World Expo. The high-stakes event, expected to bring a flurry of commercial activity and some 25 million visitors to the country, was set for October but pushed back a year because of the coronavirus pandemic.\n The changes, which The National said would take immediate effect, also reflect the efforts of the Emirates’ rulers to keep pace with a rapidly changing society at home.\n “I could not be happier for these new laws that are progressive and proactive,” said Emirati filmmaker Abdallah Al Kaabi, whose art has tackled taboo topics like homosexual love and gender identity.\n “2020 has been a tough and transformative year for the UAE,” he added.\n Changes include scrapping penalties for alcohol consumption, sales and possession for those 21 and over. Although liquor and beer is widely available in bars and clubs in the UAE’s luxuriant coastal cities, individuals needed a government-issued license to purchase, transport or have alcohol in their homes. The new rule would allow Muslims who have been barred from obtaining licenses to drink alcoholic beverages freely.\n Another amendment allows for “cohabitation of unmarried couples,” which has long been a crime in the UAE. Authorities, especially in the more freewheeling financial hub of Dubai, often looked the other way when it came to foreigners, but the threat of punishment still lingered. Attempted suicide, forbidden in Islamic law, would also be decriminalized, The National reported.\n In a move to better “protect women’s rights,” the government said it would get rid of laws defending “honor crimes,” a widely criticized tribal custom in which a male relative may evade prosecution for assaulting a woman seen as dishonoring a family. The punishment for a crime committed to eradicate a woman’s “shame,” for promiscuity or disobeying religious and cultural strictures, will now be the same for any other kind of assault.\n  In a country where expatriates outnumber citizens nearly nine to one, the amendments will permit foreigners to avoid Islamic Shariah courts on issues like marriage, divorce and inheritance.\n The announcement said nothing of other behavior deemed insulting to local customs that has landed foreigners in jail in the past, such as acts of homosexuality, cross-dressing and public displays of affection.\n Traditional Islamic values remain strong in the federation of seven desert sheikhdoms. Even so, Annelle Sheline, a Middle East research fellow at the Quincy Institute for Responsible Statecraft, wrote on Twitter that the drastic changes “can happen without too much popular resistance because the population of citizens, especially in the main cities of Dubai and Abu Dhabi, is so small.”\n The roughly 1 million Emiratis in the UAE, a hereditarily ruled country long criticized for its suppression of dissent, closely toe the government line. Political parties and labor unions remain illegal.", "posttime": "2020-11-09 02:38:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宣布,announces,阿联酋", "title": "阿联酋宣布放宽伊斯兰法律以保障个人自由", "title_en": "UAE announces relaxing of Islamic laws for personal freedoms", "transed": 1, "url": "https://apnews.com/article/dubai-united-arab-emirates-honor-killings-travel-islam-bce74c423897dc77c7beb72e4f51a23a", "via": "", "real_tags": ["宣布", "announces", "阿联酋"]}, {"category": "", "categoryclass": "", "imagename": "355e74c11a1d08066cddc8dcb017811e.jpg", "infoid": 1033897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周日，长期播出的电视游戏节目《危险边缘》的工作人员证实，其敬爱的主持人亚历克斯·特雷贝克已经去世。他80岁高龄。\n虽然这一声明没有透露细节，只是证实他在家人和朋友在场的情况下于周日去世，但特雷贝克此前对粉丝公开了他被诊断为胰腺癌四期的消息，他在2019年3月通过YouTube直接告诉粉丝这一消息。当时，他说他选择通过YouTube对粉丝讲话，以防止你读到或听到一些夸张或不准确的报道。\n从那时起，特雷贝克继续在两轮治疗之间主持这一系列节目，并定期在Jeopardy的YouTube账户上发布最新消息。上一次这样的消息是在今年7月，当时该消息证实，由于新冠肺炎的预防措施，该剧的常规制作已经暂停。这让他得以写了一本回忆录，这本回忆录在YouTube上最后一条消息发布后不久就出来了：答案是……。反思我的生活。\n7月份向粉丝发布的声明列举了一些积极的因素：我做得很好。我一直在继续我的治疗，虽然它确实让我非常疲惫，但它正在奏效。我的数据很好，我感觉很好。与此同时，他在7月份的回忆录中更加坦率地讲述了他在癌症治疗过程中面临的挣扎，包括抑郁症状。令人难以置信的是，这本书在特雷贝克开始写作仅仅四个月后就出版了--这个仓促的决定部分是因为另一本回忆录计划在特雷贝克80岁生日前后出版。\n他们不会在我的葬礼上说一件事，作为悼词的一部分，那就是，他过早地离开了我们，特雷贝克在他的回忆录中写道。我马上就要80岁了。我过着美好而充实的生活。这种充实包括2014年被评为运行时间最长的游戏节目主持人的吉尼斯世界纪录。当时，这个数字，从1984年他接管这部电视剧开始，总共有6829集，这个数字他一直持续到2020年。\n虽然我们Ars Technica很欣赏特雷贝克这句话的意思，但我们对今天的新闻感到难过，因为我们非常欣赏特雷贝克对事实、科学、幽默和八字胡的坚持，并向他的家人和亲人致以最美好的祝愿。\n我在2015年上了这个节目。在镜头前和镜头后，他绝对像在直播中一样亲切和迷人。我知道对他来说这只是一天的工作，但对我来说却是一生难忘的经历，我会永远感激它。", "note_en": "The staff of long-running TV game show  Jeopardy confirmed on Sunday that its beloved host  Alex Trebek has passed away. He was 80 years old.\n While the announcement did not go into details, other than confirming he passed on Sunday in the presence of family and friends, Trebek had previously been transparent with fans about his stage-four pancreatic cancer diagnosis,  using YouTube to tell fans directly about the news in March 2019. At the time, he said he chose to speak to fans via YouTube &#34;to prevent you from reading or hearing some overblown or inaccurate reports.&#34;\n Since then, Trebek went on to continue hosting the series between rounds of treatment, posting regular updates to  Jeopardy&#39;s YouTube account. The last such message came in July of this year, which confirmed that the show&#39;s regular production had been put on hold due to COVID-19 precautions. This allowed him, among other things, to write a memoir that came out shortly after that last YouTube message:   The Answer is... Reflections on my Life.\n  The July announcement to fans cited positive factors: &#34;I&#39;m doing well. I&#39;ve been continuing my treatment, and it is paying off, though it does fatigue me a great deal. My numbers are good, and I&#39;m feeling great.&#34; His July memoir, meanwhile, was  more frank about the struggles he faced during cancer treatment, including symptoms of depression. Incredibly, that book was published only four months after Trebek began writing it—a hasty decision driven in part by another memoir being scheduled to publish around the time of Trebek&#39;s 80th birthday.\n &#34;One thing they&#39;re not going to say at my funeral as part of the eulogy is, &#39;He was taken from us too soon,&#39;&#34; Trebek wrote in his memoir. &#34;I&#39;m about to turn 80. I&#39;ve lived a good, full life.&#34; That fullness included a Guinness World Record awarded in 2014 for longest-running game show host. At the time, that tally, starting with his takeover of the series in its 1984 reboot, counted 6,829 episodes, a number he went on to pad even through 2020.\n While we at Ars Technica appreciate what Trebek meant by that statement, we are saddened by today&#39;s news, as serious appreciators of Trebek&#39;s insistence on facts, science, humor, and a mustache, and send our best to his family and loved ones.\n  I was on the show in 2015. He was absolutely as gracious and charming before and after the cameras were on as he was on-air. I know that for him it was just a day at work but for me it was the experience of a lifetime and I&#39;ll be forever grateful for it.", "posttime": "2020-11-09 02:24:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,特雷,alex,贝克", "title": "亚历克斯·特雷贝克(Alex Trebek)，1940-2020", "title_en": "Alex Trebek, 1940-2020", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/alex-trebek-1940-2020/", "via": "", "real_tags": ["2020", "特雷", "alex", "贝克"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于使用Rust编程语言编写名为Eldiro的编程语言的系列文章。", "note_en": "A series about making a programming language called  Eldiro using the  Rust programming language.", "posttime": "2020-11-09 02:00:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈,language,编程语言", "title": "用铁锈创造一门语言", "title_en": "Make a Language Using Rust", "transed": 1, "url": "https://arzg.github.io/lang/", "via": "", "real_tags": ["rust", "铁锈", "language", "编程语言"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一类包括学习语言语法、结构和模式等内容。我将其概括为能够连接和利用行业中的无数工具--语言、框架、API、库--来创建软件。通常有关于这些事情的教程。\n第二类包括一些比较难理解的东西，但最好的描述可能是解决问题的方法。它是分析、故障排除、调试或解决问题的能力。它是一种用抽象的想法进行推理并将其转化为代码的能力。\n这两个类别之间肯定有一些重叠，但我喜欢这样想。\n很难具体说明怎样才能擅长解决问题。我相信这是因为我们对周围世界的看法略有不同。每个人都学到了不同的东西。然而，至少有一些技巧可以让我向你学习，反之亦然。\n像我将要分享的这样的问题可以成为学习解决问题的很好的工具。这是来自Project Euler的。我的意图不是简单地破坏答案。我想分享我弄清楚这个问题的过程，希望能够找出一些可以用来解决各种问题的具体策略。\n您可以在这里找到原始的问题陈述。它很短，所以花点时间通读一下。\n挑战在于确定最短的可能密码是什么。以下是键盘记录程序文件的摘录。\n我开始用铅笔和纸坐下来，从清单上写下一些数字。写作帮助我开始思考这个问题。\n我想着清单上的这些数字能告诉我关于这个秘密号码的什么信息。或许我能找到一种方法至少算出它的长度。列表中大约有50个数字，所以这个数字可能与秘密数字有某种关联。\n这些都是我脑海中浮现的几个问题。如果你觉得答案非常明显，那么恭喜你，你可能比我聪明。在第一步中，最重要的是你要问问题。\n我很快意识到不是的，我得到的名单长度并不能告诉我太多，但你总得从某个地方开始吧。接下来，我的想法转向这样一个事实：每个数字都有三位数长。\n如果给我一份两位数的数字列表，或者甚至只给我一位数字的列表，会怎么样？关于密码的长度，这能告诉我些什么呢？三位数有什么特别之处吗？这些都是有价值的问题，因为它帮助我简化了问题。\n我列了一张一位数的单子，试着想一想，我如何才能用它来解决同样的问题。\n给出一个这样的列表作为线索，我可以肯定地说，这个秘密数字至少有6、2、1和0，但我也泄露了关于这个问题的基本信息：数字出现的顺序。一位数字的列表太含糊了。密码可能是6210、2601或任何其他组合，我无法知道哪一个是正确的。\n一份两位数的数字列表可能会更好。它不需要考虑太多，但仍然能够传达所需的信息。从现在开始，我决定把这个列表看作两位数的数字，而不是三位数的数字。\n在这一点上，我仍然不确定如何在纸上解决这个问题，所以我决定试着倒着做。我写下了一个随机数字，然后从其中挑选了几对数字，试图重建我自己版本的问题。我决定仔细检查列表中的每个数字，并将数字写下来，就像它们被插入到某种数组中一样。\n我意识到这样的方法不太实际，因为它仍然留下了模棱两可的空间。\n在上面的例子中，很明显5在2之前，但如果我继续添加下一个数字中的数字，我不知道1应该在5之前还是之后。8也是同样的问题：我知道它应该在2之前，但数据没有说明它应该在1之前还是在5之后。\n即使我有另一个数据点来消除线索的歧义--例如51--当然，它会告诉我1位于5和2之间的正确位置，但我已经感觉到，试图编写代码来解释数组中的数字切换是不现实的，而且可能有更简单的方法。\n这样写出来让我意识到，某种数据结构的帮助将有助于解决这个问题。\n所以现在的问题是，什么样的数据结构可以帮助建模这个问题？为了帮助做出这个决定，我考虑了问题中实际提供了哪些数据。使用上面的示例，数字列表如下所示：\n列表中的每个数字都提供了有用的线索，但问题是很难跟踪每条线索最终是如何组合在一起的。我试着想出一种数据结构，既可以单独表示每条线索，也可以作为一个整体来表示。\n有向图似乎很自然地适合表示这种信息。每个节点可以是一个数字，节点之间的边可以表示它们之间的关系。\n我对用图表来解决这个问题感觉不错，但仍然有一些问题需要我去弄清楚。\n我怎样才能知道图表何时有足够的信息来获得秘密数字呢？换句话说，我怎么知道我的答案是确凿的呢？\n如果一个秘密号码有多个相同数字怎么办？这会毁了我的方法吗？\n为了帮助回答这个问题，我使用了同样的技术，即创建问题的简化版本并向后处理。现在假设157是密码。节点之间需要多少条边才能确定1在5和7之前，5在7之前？答案是这个特殊图形的三条边。\n在本例中，当边的数量等于节点的数量时，顺序是已知的。就这么简单吗？如果边数等于节点数，我们能知道秘密数是多少吗？\n在本例中，答案是肯定的，但它并不适用于一般情况。通过创建更多的例子，我开始发现节点数和边数之间的关系。看看四位数和五位数的秘密数字在图表中是什么样子：\n在画了几张之后，我可以开始看到一种模式出现了。随着节点数量的增加，边的数量也会增加，如1、3、6、10、15、21、28……。\n寻找模式会很有帮助，因为这意味着有一个方程式可以用来表示问题的某些方面。这里的模式告诉我，为了知道什么时候我的答案可以被认为是确凿的，应该使用什么条件。这是表示该模式的等式，其中n是图中的节点数。\n手绘图形有助于可视化解决此问题的方法，但我知道我还需要记住如何用代码表示图形。具体地说，就是如何以编程方式遍历图形以生成结果。\n在盯着这些例子看了一段时间之后，我意识到这个图有一个明显且有用的属性。\n具有最向外边缘的节点位于向外边缘较少的节点之前。此外，每个节点的边数正好相差一个。这意味着密码的第一个数字应该具有最向外的边缘，而最后一个数字将不会有任何向外的边缘。\n这个属性对我来说是合乎逻辑的，而且可以很容易地转换成代码。\n有多个相同数字的密码可能会导致我的方法出现问题。这是我在工作时担心的事情，因为不清楚如何知道应该将边放在哪两个节点之间。例如，看一下1030作为密码，想象一下按以下顺序给出的数字：\n绘制图表有多种方法，因为有两种方法。仍然应该只有一种正确的方法。创建正确的图表可能取决于给出数字的顺序。我可能需要想出一些方法来回溯和重新连接节点，以便最终得到正确的图形。\n可以比较正确和不正确的图表，以了解它们到底有多大不同。错误的图形有循环依赖关系：3位于橙色和蓝色0之前，但蓝色0位于3之前，这是相互矛盾的。\n另一个不同之处在于，正确的版本是唯一满足上述属性的版本，其中每个节点的边数正好相差一个。对于使用图形建模的任何秘密数字，此属性应始终为真。\n在这一点上，我决定搁置重复数字的问题。看起来这会打破我原本计划使用的方法。我认为有可能弄清楚，但还不清楚这个用例是否需要支持。\n我现在的计划是将我的想法转化为代码，看看它是否会产生正确的答案。\n这一部分很快就过去了，因为我已经对这个问题有了很好的理解，以及如何解决它的方法。我选择了Python并没有什么特别的原因，只是我觉得用一种我有一段时间没用过的语言会很有趣。\n我不打算详细解释代码，但我想表达一下我在编写代码时的思考过程。\n我的想法是循环列表中的每个数字来构建图表。到目前为止，图形只在纸上用圆圈和箭头直观地表示出来。现在的任务是使用代码表示图形。\n至少有几种方法可以实现图表。我想出的方法最接近传统上所说的邻接矩阵，但有一些变化。\n密钥日志=[319,680,180,690，#...]密钥日志中的位数：a，b，c=str(位数)adj_Matrix[(a，b)]=1 adj_Matrix[(a，c)]=1 adj_Matrix[(b，c)]=1。\n在这里，该图由一个Python字典表示。字典中的每个键都是列表中当前号码的数字元组。这些值是用1硬编码的，表示元组中的两个数字之间有一条边。\n值不那么重要，只要有两个数字表示边缘的关键字就行。换句话说，边缘由词典中词条的存在来表示。\n请注意实际问题是如何提供三位数的列表的。使用两位数的数字是我最初为了帮助我思考这个问题而做的一个简化。三位数的数字并不能从根本上改变问题，它只是为每个数字提供了更多的数据。现在我不只知道数字a在数字b之前，我还知道数字a在c之前，b在c之前。\n下一步是添加检查，以查看图表是否包含足够的信息来揭示秘密数字。正如我已经发现的，可以使用以下公式对条件进行建模：\n对于键盘日志中的数字：#...。N_nodes=len(set([adj_matrix.key()中的边的位数，用于边中的位数]))n_edges=sum(adj_matrix.values())is_conducsive=n_node&gt；3 and(n_node*(n_node-1))/2==n_edges#...。\n我发现添加nNodes&gt；3是必要的，否则程序会在第一次迭代后停止。\n附注：我发现n*(n-1)/2==e+1也会产生正确的答案，而且迭代次数更少。然而，我认为它在某些情况下可能会留下模棱两可的空间，这取决于给出数字的顺序，所以我决定不把它作为我最终得到的解决方案的一部分。\n一旦满足条件，就可以遍历图表以生成正确答案。\n#...if is_conducsive：Nodes=[Edge[0]for edge in adj_Matrix]Counts_by_node=Reduced(count_digits，node，{})front_digits=排序(Counts_by_node，key=Counts_by_node.get，Reverse=True)[last_digit]=list(set([edge[1]for edge in adj_Matrix]).Difference(Nodes))Result=int(&#39；&#39；.Join(front_digits。\n使用我奇怪/独特的图形表示法，只需创建一个包含每个元组中第一个元素的列表，就可以找到出边最多的节点。得到的列表将包含来自密码的每个数字的一个或多个，并将对其进行计数和排序。以下是一些打印语句，以帮助说明正在发生的情况：\n打印(节点)#[&#39；3&#39；，&#39；3&#39；，&#39；1&#39；，&#39；6&#39；，&#39；8&#39；，&#39；1&#39；，&#39；1&#39；，&#39；6&#39；，&#39；1&#39；，&#39；1&#39；，&#39；1&#39；，&#39；1&#39；，&#39；1&#39；，&#39；1&#39；，&#39；2&#39；，&#39；6&#39；，&#39；7&#39；，&#39；7&#39；，&#39；8&#39；，&#39；3&#39；，&#39；7&#39；，&#39；7&#39；，&#39；1&#39；，&#39；7&#39；，&#39；7&#39；，&#39；2&#39；，&#39；3&#39；，&#39；3&#39；]打印(Counts_By_Nodes)#{&#39；3&#39；：6，&#39；1&#39；：5，&#39；6&#39；：4，&#39；8&#39；：2，&#39；9&#39；：1，&#39；2&#39；：3，&#39；7&#39；：7}打印(正面数字)#[&#39；7&#39；，&#39；3&#39；，&#39；1&#39；，&#39；6&#39；，&#39；2&#39；，&#39；8&#39；，&#39；9&#39；]。\n结果出来之前的最后一步是得到密码的最后一位。它不包括在front_digits列表中，因为密码中的最后一个数字没有向外的边缘。它应该是图表中保留的唯一数字，但不是节点列表中的数字--在本例中为0。\n所以密码是73162890。幸运的是，我不必担心重复的数字来解决这个特殊的问题，所以我很高兴我没有在这个问题上白白浪费时间。\n我的回答到此为止，但下一步将是寻找改进我的答案的方法。现在我有了一个基线，我可以改进程序的所有方面，比如它的运行时、内存使用情况、代码的可读性，或者进行重构以处理特殊情况(如重复数字)。\n我认为解决问题是非常个人化的。永远不会有一份供每个人遵循的繁琐步骤清单。我们的头脑是独一无二的，我们看待和解决问题的方式也是独一无二的，这真是太棒了！\n很明显，这里不只有一种方法可以解决这个例子，但我希望我已经演示了一些我认为有用的技术。\n从提出问题和对问题进行观察开始。有时候，这一步感觉就像我只是在转动轮子，或者在陈述显而易见的事情，但我发现它给了我开始工作所需的牵引力。\n试着把问题缩小，然后解决那些问题。寻找简化所给信息的方法。这可以帮助我更容易地理解这个问题，它可以揭示出我可能没有考虑过的不同方面。\n认识到你的想法很可能是错误的，而不是正确的。不要为此灰心丧气。失败的尝试可以为问题提供很多有价值的见解。\n把想法写下来，把它们形象化。铅笔和纸是一种帮助我清晰思考的媒介。\n尽量不要直接跳到代码中去，有时这是可以的，但也可能会让人分心。在代码中实现我的方法之前，我努力首先形成一个合理的概念模型。不过，有些时候我会做相反的事情。\n想想边缘情况，但不要试图一下子解决所有问题。只要做个笔记，然后在必要的时候再去看看会很有帮助。\n这几乎是不言而喻的，但实践/经验会产生很大的不同。例如，如果我从来没有听说过图形数据结构，我就不会想到将其应用于这个问题。所以，尽可能让练习和学习成为你日常工作流程的一部分。\n虽然我们绝对可以相互学习，但我们也应该制定自己的技巧来推理我们面临的问题。这对我来说是一次有趣的练习--不仅是为了解决问题，也是为了分析我自己版本的解决问题所涉及的内容。自己试一试，看看你能学到什么。", "note_en": "The first category includes things like learning language syntax, constructs, and patterns. I would summarize it as the ability to connect and utilize the myriad, &#34;tools of the trade&#34; -- languages, frameworks, APIs, libraries -- to create software. There&#39;s usually tutorials for these things.\n The second category includes things that are a little bit harder to put your finger on, but can probably be best described as problem solving. It&#39;s the ability to analyze, troubleshoot, debug, or solve a problem. It&#39;s the ability to reason with abstract ideas and turn them into code.\n There is for sure some overlap between these two categories, but this is how I like to think about it.\n It&#39;s hard to be specific about what it takes to be good at problem solving. I believe that&#39;s because we all have a slightly different perception of the world around us. Everyone learns differently. There must, however, be at least some techniques that I might learn from you, and vice versa.\n Problems like the one I am about to share can be great tools for learning about problem solving. This one&#39;s from Project Euler. My intention is not to simply spoil the answer. I want to share my process of figuring it out, with the hope of being able to pinpoint some specific strategies that can be used to solve all kinds of problems.\n  You can find the original problem statement  here. It&#39;s short, so take a moment to read through.\n  The challenge is to determine what the shortest possible secret number is. Here&#39;s an excerpt from the keylogger file.\n   I began by sitting down with pencil and paper to write some numbers from the list. Writing helps me begin to think about the problem.\n I thought about what these numbers in the list could tell me about the secret number. Maybe I could find a way to at least figure out its length. There are about fifty numbers in the list, so maybe that number is somehow correlated to the secret number.\n These were a few of the questions going through my head. If the answers seem super obvious to you, then congratulations, you might be smarter than me. What&#39;s most important during the first steps is that you ask questions.\n I realized pretty quickly that no, the length of the list I was given didn&#39;t tell me much, but you&#39;ve got to start somewhere. Next, my thoughts turned to the fact that each number was three digits long.\n What if I was given a list of two-digit numbers, or even a list of just one-digit numbers? What could that tell me about the length of the secret number? Is there something special about three-digit numbers in particular? These were valuable questions to ask, because it helped me to simplify the problem.\n I made a list of one-digit numbers and tried to think about how I might be able to solve the same problem with that instead.\n  Given a list like this as clues, I could say for certain that the secret number has at least a 6,2,1, and 0, but I also loose essential information about the problem: The order that the numbers appear in. A list of one-digit numbers is too ambiguous. The secret number could be  6210,  2601, or any other combination, and I would have no way of knowing which one is correct.\n A list of two-digit numbers might be nice. It&#39;s less to think about, yet is still able to convey the needed information. From this point forward, I decided to think about the list as two-digit numbers, rather than three-digit numbers.\n  At this point, I still wasn&#39;t sure how to solve the problem on paper, so I decided to try and work backwards. I wrote down a random number and then picked a few pairs of digits from it to try and reconstruct my own version of the problem. I decided to go through each number in the list and write down the digits as if they were being inserted into some kind of array.\n  I realized an approach like this would not be very practical because it still leaves room for ambiguity.\n In the example above, its clear that 5 is before 2, but if I continue to add the digits from the next number, I can&#39;t tell if the 1 should come before or after the 5. It&#39;s the same problem for the 8: I know it should come before the 2, but the data says nothing about if it should be before or after the 1, or the 5.\n Even if I had another data point to disambiguate the clues --  51, for example -- sure, it would tell me that the 1 is in the correct spot between 5 and 2, but I already get the feeling that trying to write code to account for switching numbers around in an array is not going to be practical, and that there is probably an easier way.\n Writing it out this way helped me realize that the help of some sort of data structure would be useful for solving this problem.\n So now the question is,  what kind of data structure could help model this problem? To help with this decision, I thought about what data is actually provided in the problem. Using the example above, the list of numbers reads as:\n  Each number in the list provides helpful clues, but the problem is that it&#39;s difficult to keep track of how each clue ultimately fits together. I tried to think of some kind of data structure that would be able to represent each clue individually, but also as a whole.\n A directed graph seems to be a pretty natural fit to represent this information. Each node could be a digit, and the edges between nodes could represent the relationship between them.\n  I felt good about using a graph to solve the problem, but there were still some questions that I had to figure out.\n How would I know when the graph has enough information to to be able to get the secret number? In other words, how can I know when my answer is conclusive?\n  What if a secret number had more than one of the same digit? Would that ruin my approach?\n  To help answer this question I used the same technique of creating a simplified version of the problem and working backwards. Pretend now that 157 is the secret number. How many edges between the nodes would it take to definitively say that 1 comes before both 5 and 7, and 5 comes before 7? The answer is three edges for this particular graph.\n  In this example, the order is known when number of edges are equal to the number of nodes.  Is it that simple? Can we know what the secret number is if the number of edges are equal to the number of nodes?\n In this example, yes, but it doesn&#39;t hold true for the general case. By creating more examples, I start to find a relationship between the number of nodes, and the number of edges. Have a look at what four and five-digit secret numbers look like as a graph:\n   After drawing a few of these, I could begin to see a pattern emerge. As the number of nodes increase, the number of edges increase like,  1, 3, 6, 10, 15, 21, 28, ...\n It can be helpful to look for patterns, because it means that there&#39;s an equation which can be used to represent some aspect of the problem. Here the pattern showed me what condition to use in order to know when my answer could be considered conclusive. This is the equation that represents that pattern, where n is the number of nodes in the graph.\n   A hand-drawn graph helps to visualize the approach of solving this problem, but I knew that I would also need to keep in mind how the graph could be represented with code. Specifically, how to programmatically traverse the graph to produce a result.\n After staring at the examples for a bit longer, I realized an obvious and helpful property about the graph.\n The nodes with the most outward edges come before those with less outward edges. Additionally, the number of edges for each node differ by exactly one. This means that the first digit of the secret number should have the most outward edges, while the last digit would not have any outward edges.\n This property made logical sense to me, and was something that could be easily translated into code.\n  A secret number with more than one of the same digit could cause problems with my approach. This was something that worried me as I was working, because it was not clear how to know which two nodes to put the edge between. For example, take a look at 1030 as the secret number, and imagine the digits given in the following order:\n  There are multiple ways to draw the graph because there are two 0&#39;s. There should still be only one &#34;correct&#34; way. Creating a correct graph might depend on the order in which the digits are given. I might need to think of some way to backtrack and re-connect nodes in order to end up with the correct graph.\n The correct and incorrect graphs can be compared to understand how exactly they differ. The incorrect graph has a circular dependency: 3 comes before both the orange and blue 0&#39;s, but then the blue 0 comes before 3, which is contradictory.\n Another difference is that the correct version is the only one that satisfies the property mentioned above, where the number of each node&#39;s edges differ by exactly one. This property should always be true for any secret number modeled with the graph.\n  At this point, I decided to put the question of duplicate digits on hold. It looked like this would break the approach that I had planned to use. I think its possible to figure out, but it was unclear if this use case needed to be supported at all.\n My plan was now to turn my ideas into code to see if it would produce the correct answer.\n  This part went by pretty quickly because I had formed a good understanding of the problem, as well as an approach for how to solve it. I picked Python for no particular reason, other than I thought it would be fun to use a language that I hadn&#39;t used in a while.\n I&#39;m not going explain the code in too much detail, but I want to express the thought process I had while writing it.\n My idea was to loop over each number in the list to build up the graph. Up until now, the graph had only been represented visually on paper with circles and arrows. The task is now to represent the graph using code.\n There&#39;s at least a couple ways to implement a graph. What I came up with was closest to what&#39;s traditionally known as an  adjacency matrix, but with some changes.\n keylogs = [ 319, 680, 180, 690, # ...]adj_matrix = {}for digits in keylogs: a, b, c = str(digits) adj_matrix[(a,b)] = 1 adj_matrix[(a,c)] = 1 adj_matrix[(b,c)] = 1\n Here the graph is represented by a Python dict. Each key in the dict is a tuple of digits from the current number in the list. The values are hard-coded with 1s to indicate that there is an edge between the two digits in the tuple.\n The values are less important, so long as there&#39;s a key with the two digits to signify an edge. In other words, the edge is indicated by the existance of an entry in the dict.\n Notice how the  actual problem provides a list of three-digit numbers. Using two-digit numbers was a simplification that I had made to help me think about the problem initially. Three-digit numbers do not fundamentally change the problem, it just provides more data per number. Now instead of only knowing that digit  a comes before digit  b, I also know that digit  a comes before  c, and  b before  c.\n The next step is to add a check to see if the graph contains enough information to reveal the secret number. As I had already discovered, the condition can be modeled using the following formula:\n for digits in keylogs: # ... n_nodes = len(set( [digit for edge in adj_matrix.keys() for digit in edge])) n_edges = sum(adj_matrix.values()) is_conclusive = n_nodes &gt; 3 and ( n_nodes * (n_nodes - 1)) / 2 == n_edges # ...\n I found that adding  n_nodes &gt; 3 was necessary, otherwise the program would stop after the very first iteration.\n Side note: I found that  n * (n - 1)) / 2 == e + 1 also produces the correct answer, and in fewer iterations. However, I believe it could leave room for ambiguity in some cases, depending on the order that the numbers are given, so I decided not include it as part of the solution I ended up with.\n Once the condition is met, the graph can be traversed to produce the correct answer.\n # ...if is_conclusive: nodes = [edge[0] for edge in adj_matrix] counts_by_node = reduce(count_digits, nodes, {}) front_digits = sorted(counts_by_node, key=counts_by_node.get, reverse=True) [last_digit] = list(set( [edge[1] for edge in adj_matrix]).difference(nodes)) result = int(&#39;&#39;.join(front_digits) + last_digit) return result\n Using my weird/unique representation of a graph, the nodes with the most outgoing edges can be found by creating a list of only the first element in each tuple. The resulting list will have one or more of each digit from the secret number, and it will be counted and sorted. Here&#39;s some print statements to help illustrate what&#39;s happening:\n print(nodes)# [&#39;3&#39;, &#39;3&#39;, &#39;1&#39;, &#39;6&#39;, &#39;6&#39;, &#39;8&#39;, &#39;1&#39;, &#39;1&#39;, &#39;6&#39;, &#39;9&#39;, &#39;1&#39;, &#39;2&#39;, &#39;6&#39;, &#39;2&#39;, &#39;7&#39;, &#39;7&#39;, &#39;8&#39;, &#39;3&#39;, &#39;3&#39;, &#39;7&#39;, &#39;7&#39;, &#39;1&#39;, &#39;7&#39;, &#39;7&#39;, &#39;2&#39;, &#39;7&#39;, &#39;3&#39;, &#39;3&#39;]print(counts_by_nodes)# {&#39;3&#39;: 6, &#39;1&#39;: 5, &#39;6&#39;: 4, &#39;8&#39;: 2, &#39;9&#39;: 1, &#39;2&#39;: 3, &#39;7&#39;: 7}print(front_digits)# [&#39;7&#39;, &#39;3&#39;, &#39;1&#39;, &#39;6&#39;, &#39;2&#39;, &#39;8&#39;, &#39;9&#39;]\n The final step before the result is to get the very last digit of the secret number. It&#39;s not included in the  front_digits list, because the last digit in the secret number has 0 outward edges. It should be the only number that remains in the graph, but not in the list of  nodes -- 0 in this case.\n And so the secret number is  73162890. Luckily I did not have to worry about duplicate digits to solve this particular problem, so I am glad that I didn&#39;t end up spending time on that for nothing.\n I&#39;m going to stop here, but the next step would be to look for ways to improve my answer. Now that I have a baseline, I can improve all sorts of things about the program such as its runtime, memory usage, the readability of the code, or work on refactoring to handle special cases (like duplicate digits.)\n  I think that problem solving is quite personal. There&#39;s never going to be a laundry list of steps for everyone to follow. Our minds are unique, as is the way that we see and solve problems, and that&#39;s awesome!\n There&#39;s obviously not just one way to solve the example here, but I hope that I have demonstrated at least a few of the techniques that I find useful.\n Start by asking questions and making observations about the problem. Sometimes this step feels like I&#39;m just spinning my wheels, or stating the obvious, but I find that it gives my mind the traction needed to get started.\n Try to make the problem smaller, and solve those ones instead. Look for ways to simplify the information given. This helps me reason about the problem easier, and it can reveal different aspects that I may not have considered otherwise.\n  Realize that your ideas will probably be wrong more often than they are right. Don&#39;t get discouraged about it. Failed attempts can provide a lot of valuable insight to the problem.\n   Visualize ideas by writing them down. Pencil and paper is a medium that helps me think clearly.\n Try not to jump straight into the code, sometimes it&#39;s OK, but it can also be distracting. I strive to first form a reasonable conceptual model of my approach before implementing it in code. There are times where I do the opposite though.\n Think about edge cases, but don&#39;t try to tackle everything at once. It helps to just make a note, and then revisit if necessary.\n It almost goes without saying, but practice/experience makes a big difference. For example, if I had never even heard of a graph data structure, I would not have thought to apply it to this problem. So, make practice and learning part of your daily workflow as much as possible.\n While we can definitely learn from each other, we should also formulate our own techniques to reason about the problems that we&#39;re given. This was a fun exercise for me -- to solve a problem, but also to analyze what my own version of problem solving involves. Try it out for yourself and see what you can learn.", "posttime": "2020-11-09 02:00:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解决问题,solving", "title": "解决问题的技巧", "title_en": "Problem Solving Techniques", "transed": 1, "url": "https://denvaar.github.io/articles/problem_solving_example.html", "via": "", "real_tags": ["解决问题", "solving"]}, {"category": "", "categoryclass": "", "imagename": "d8709c59d4188927a0cb9f77fad97fdb.jpg", "infoid": 1033894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Laurent Vivier谈到了现有的QEMU Quadra 800仿真和Linux用户模式。他会解释他们的局限性是什么，然后是什么。", "note_en": "Laurent Vivier talks about the existing QEMU Quadra 800 emulation and the linux-user mode. He will explain what are their limitations are, and then what a pu...", "posttime": "2020-11-09 01:59:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "qemu,support,vivier", "title": "QEMU中新的摩托罗拉68000仿真支持(Talk)", "title_en": "New Motorola 68000 emulation support in QEMU (talk)", "transed": 1, "url": "https://www.youtube.com/watch?v=s_ve0bCC9q4", "via": "", "real_tags": ["qemu", "support", "vivier"]}, {"category": "", "categoryclass": "", "imagename": "1063b0359908243b686c5a9b1a34b0c8.jpg", "infoid": 1033893, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特写是“当那个时代自取灭亡时，那只手是卡尔·克劳斯的。”\n该网站包含卡尔·克劳斯(Karl Kraus)关于第一次世界大战的非凡讽刺戏剧《我要死》(Die Letzten Tage Der Menschheit)的注释译本，作者是迈克尔·拉塞尔(Michael Russell)的《人类的最后日子》(The Last Days Of Human)。\n“人类最后的日子”(The Last Days of Man…)有了新的译本。我很高兴地告诉大家，迈克尔·罗素的译本非常棒--当然是我见过的最好的译本。我真希望在我开始研究克劳斯的时候就能拿到它！(南加州大学Marjorie Perloff教授，“关键调查”)", "note_en": "Featured    ‘When the age died by its own hand, that handwas Karl Kraus’s’\n   This site contains an annotated translation of Karl Kraus’s extraordinary satirical drama of the First World War, ‘Die letzten Tage der Menschheit’, ‘The Last Days of Mankind’, by Michael Russell.\n ‘There is a new translation of The Last Days of Mankind… and I am happy to report that Michael Russell’s translation is excellent — certainly the best I’ve seen to date. I only wish it had been available when I began my own work on Kraus!’ (Professor Marjorie Perloff, University of Southern California, ‘Critical Inquiry’)", "posttime": "2020-11-09 01:59:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "讽刺,mankind,days", "title": "《人类的最后日子》--卡尔·克劳斯的第一次世界大战讽刺代表作", "title_en": "The Last Days of Mankind – Karl Kraus – His Satirical Masterpiece of World War I", "transed": 1, "url": "https://thelastdaysofmankind.org/", "via": "", "real_tags": ["讽刺", "mankind", "days"]}, {"category": "", "categoryclass": "", "imagename": "47b797d963157e2be9c3b465530cc1c2.jpg", "infoid": 1033892, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在量子计算机研究的早期，计算机科学家提出了一个问题，他们知道，这个问题的答案将深刻揭示这些未来机器的力量。25年后，这个问题几乎解决了。在5月底发布在网上的一篇论文中，计算机科学家朗·拉兹(Run Raz)和阿维沙伊·塔尔(Avishay Tal)提供了强有力的证据，证明量子计算机拥有传统计算机无法实现的计算能力。\n普林斯顿大学(Princeton University)和魏茨曼科学研究所(Weizmann Institute Of Science)教授拉兹(Raz)和斯坦福大学(Stanford University)博士后研究员塔尔(Tal)定义了一种特定的计算问题。他们证明，有一定的警告，量子计算机可以有效地处理这个问题，而传统计算机将永远陷入困境，试图解决这个问题。自1993年以来，计算机科学家一直在寻找这样的问题，当时他们首次定义了一类被称为BQP的问题，这类问题涵盖了量子计算机可以解决的所有问题。\n从那时起，计算机科学家们就希望将BQP与一类被称为“PH”的问题进行对比，“PH”涵盖了任何可能的经典计算机所能解决的所有问题--甚至包括由某些未来文明设计的深不可测的高级问题。进行这种对比取决于找到一个可以被证明存在于BQP而不是PH中的问题。现在，拉兹和塔尔做到了。\n这一结果在任何实际意义上都不会使量子计算机超越经典计算机。首先，理论计算机科学家已经知道量子计算机可以解决经典计算机所能解决的任何问题。工程师们仍在努力建造一台有用的量子机。但拉兹和塔尔的论文证明，量子计算机和经典计算机实际上是一个截然不同的类别-即使在一个经典计算机取得了超越所有现实梦想的成功的世界里，量子计算机仍然会超越它们。\n理论计算机科学的一项基本任务是将问题归类为复杂类。复杂性类包含在给定资源预算内可以解决的所有问题，其中资源是时间或内存之类的东西。\n例如，计算机科学家已经找到了一种有效的算法来测试一个数字是否为质数。然而，他们还没有找到一种有效的算法来识别大数的素因数。因此，计算机科学家认为(但还无法证明)这两个问题属于不同的复杂性类别。\n最著名的两个复杂类是“P”和“NP”。P是经典计算机可以快速解决的所有问题。(“这个数字是质数吗？”属于P.)。NP是经典计算机不一定能快速解决的所有问题，但如果有答案，它们可以快速验证答案。(“它的主要因素是什么？”属于NP。)。计算机科学家认为P和NP是两个截然不同的类别，但实际上证明其区分性是该领域最困难和最重要的公开问题。\n1993年，计算机科学家伊桑·伯恩斯坦(Ethan Bernstein)和乌梅什·瓦兹拉尼(Uesh Vazirani)定义了一个新的复杂性类别，他们称之为BQP，意为“有界误差量子多项式时间”。他们将这一类定义为包含量子计算机可以有效解决的所有决策问题--答案为是或否的问题。大约在同一时间，他们还证明了量子计算机可以解决经典计算机能够解决的所有问题。也就是说，BQP包含了P中的所有问题。\n但他们无法确定BQP是否包含另一类重要问题“PH”中没有的问题，PH代表“多项式层次”。PH是NP的推广。这意味着它包含了你从NP问题开始的所有问题，并通过层次化限定语句，如“存在”和“为了所有人”，使问题变得更加复杂。1今天的经典计算机不能解决PH中的大多数问题，但你可以把PH看作是如果P被证明等于NP，那么经典计算机可以解决的所有问题的类别。换句话说，比较BQP和PH就是确定量子计算机是否比经典计算机更有优势，即使经典计算机(出人意料地)能够解决比现在多得多的问题，经典计算机也能存活下来。\n德克萨斯大学奥斯汀分校(University Of Texas At Austin)的计算机科学家斯科特·亚伦森(Scott Aaronson)说：“PH是最基本的经典复杂性课程之一。”“所以我们有点想知道，量子计算在经典复杂性理论的世界中处于什么位置？”\n区分两个复杂性类别的最好方法是找到一个可以证明存在于其中一个而不是另一个中的问题。然而，由于基本面和技术上的障碍，找到这样一个问题一直是一个挑战。\nAaronson说，如果你想要一个存在于BQP而非PH中的问题，你必须找出一些“根据定义，经典计算机甚至无法有效地验证答案，更不用说找到它了”。“这排除了我们在计算机科学中思考的很多问题。”\n这就是问题所在。假设您有两个随机数生成器，每个生成器都产生一个数字序列。你的计算机面临的问题是：这两个序列是完全相互独立的，还是以一种隐藏的方式联系在一起的(其中一个序列是另一个序列的“傅立叶变换”)？Aaronson在2009年提出了这个“关联”问题，并证明它属于BQP。这就留下了更难的第二步--证明For Relationship不在PH中。\n这就是拉兹和塔尔在某种意义上所做的事情。他们的论文实现了BQP和PH之间所谓的“先知”(或“黑箱”)分离。这在计算机科学中是一种常见的结果，当他们真正想要证明的东西超出了他们的能力范围时，研究人员就会求助于这种结果。\n区分BQP和PH等复杂类的实际最佳方法是测量解决每类复杂类中的问题所需的计算时间。但多伦多大学(University Of Toronto)的计算机科学家亨利·袁说，计算机科学家“对实际计算时间的理解或测量能力不是很高”。\n取而代之的是，计算机科学家们测量了一些其他的东西，他们希望这些东西能为他们无法测量的计算时间提供洞察力：他们计算出一台计算机为了得到答案而需要咨询一位“先知”的次数。先知就像一个提示者。你不知道它的提示是怎么来的，但你知道它们是可靠的。\n如果您的问题是要弄清楚两个随机数生成器是否秘密相关，您可以问一些先知问题，比如“每个生成器的第六个数字是什么？”然后，根据每种类型的计算机需要解决问题的提示数来比较计算能力。需要更多提示的计算机速度较慢。\n“从某种意义上说，我们对这种模式的理解要好得多。它更多地谈论信息，而不是计算。“塔尔说。\nRaz和Tal的新论文证明，量子计算机比经典计算机需要更少的提示来解决关联问题。事实上，量子计算机只需要一个提示，而即使有无限的提示，PH中也没有算法可以解决这个问题。拉兹说：“这意味着有一种非常有效的量子算法可以解决这个问题。”“但如果你只考虑经典算法，即使你上的是非常高级的经典算法，他们也做不到。”这表明，对于先知，关系是BQP中的问题，而不是PH中的问题。\n拉兹和塔尔几乎在四年前就实现了这一结果，但他们在未来的证据中一步也没能完成。就在一个月前，塔尔听了一篇关于伪随机数生成器的新论文的演讲，意识到论文中的技术正是他和拉兹完成自己的论文所需要的。“这就是缺失的部分，”塔尔说。\nBQP和PH分离的消息很快就传开了。佐治亚理工学院的计算机科学家兰斯·福特诺(Lance Fortnow)在拉兹(Raz)和塔尔(Tal)发表了他们的证明的第二天写道：“量子复杂性的世界正在震撼。”\n这项工作提供了一个确凿的保证，即量子计算机存在于与经典计算机不同的计算领域(至少相对于先知而言)。即使在P等于NP的世界里--旅行推销员问题就像在电子表格上找到一条最合适的线一样简单--Raz和Tal的证明表明，仍然存在只有量子计算机才能解决的问题。\nFortnow说：“即使P等于NP，即使做出这样强有力的假设，也不足以捕获量子计算。”\n更正2018年6月21日：这篇文章的早期版本指出，询问某条路径是否恰好是最短距离的旅行商问题的版本很可能是PH。事实上，它已经被证明处于PH状态。", "note_en": "Early on in the study of quantum computers, computer scientists posed a question whose answer, they knew, would reveal something deep about the power of these futuristic machines. Twenty-five years later, it’s been all but solved. In a paper  posted online at the end of May, computer scientists  Ran Raz and  Avishay Tal provide strong evidence that quantum computers possess a computing capacity beyond anything classical computers could ever achieve.\n Raz, a professor at Princeton University and the Weizmann Institute of Science, and Tal, a postdoctoral fellow at Stanford University, define a specific kind of computational problem. They prove, with a certain caveat, that quantum computers could handle the problem efficiently while traditional computers would bog down forever trying to solve it. Computer scientists have been looking for such a problem since 1993, when they first defined a class of problems known as “BQP,” which encompasses all problems that quantum computers can solve.\n  Since then, computer scientists have hoped to contrast BQP with a class of problems known as “PH,” which encompasses all the problems workable by any possible classical computer — even unfathomably advanced ones engineered by some future civilization. Making that contrast depended on finding a problem that could be proven to be in BQP but not in PH. And now, Raz and Tal have done it.\n The result does not elevate quantum computers over classical computers in any practical sense. For one, theoretical computer scientists already knew that quantum computers can solve any problems that classical computers can. And engineers are still  struggling to build a useful quantum machine. But Raz and Tal’s paper demonstrates that quantum and classical computers really are a category apart — that even in a world where classical computers succeed beyond all realistic dreams, quantum computers would still stand beyond them.\n  A basic task of theoretical computer science is to  sort problems into complexity classes. A complexity class contains all problems that can be solved within a given resource budget, where the resource is something like time or memory.\n Computer scientists have found an efficient algorithm, for example, for testing whether a number is prime. They have not, however, been able to find an efficient algorithm for identifying the prime factors of large numbers. Therefore, computer scientists believe (but have not been able to prove) that those two problems belong to different complexity classes.\n The two most famous complexity classes are “P” and “NP.” P is all the problems that a classical computer can solve quickly. (“Is this number prime?” belongs to P.) NP is all the problems that classical computers can’t necessarily solve quickly, but for which they can quickly verify an answer if presented with one. (“What are its prime factors?” belongs to NP.) Computer scientists believe that P and NP are distinct classes, but actually proving that distinctness is the hardest and most important open problem in the field.\n  In 1993 computer scientists Ethan Bernstein and  Umesh Vazirani defined a new complexity class that they called BQP, for “bounded-error quantum polynomial time.” They defined this class to contain all the decision problems — problems with a yes or no answer — that quantum computers can solve efficiently. Around the same time they also proved that quantum computers can solve all the problems that classical computers can solve. That is, BQP contains all the problems that are in P.\n  But they could not determine whether BQP contains problems not found in another important class of problems known as “PH,” which stands for “polynomial hierarchy.” PH is a generalization of NP. This means it contains all problems you get if you start with a problem in NP and make it more complex by layering qualifying statements like “there exists” and “for all.” 1 Classical computers today can’t solve most of the problems in PH, but you can think of PH as the class of all problems classical computers could solve if P turned out to equal NP. In other words, to compare BQP and PH is to determine whether quantum computers have an advantage over classical computers that would survive even if classical computers could (unexpectedly) solve many more problems than they can today.\n “PH is one of the most basic classical complexity classes there is,” said  Scott Aaronson, a computer scientist at the University of Texas at Austin. “So we sort of want to know, where does quantum computing fit into the world of classical complexity theory?”\n The best way to distinguish between two complexity classes is to find a problem that is provably in one and not the other. Yet due to a combination of fundamental and technical obstacles, finding such a problem has been a challenge.\n If you want a problem that is in BQP but not in PH, you have to identify something that “by definition a classical computer could not even efficiently verify the answer, let alone find it,” said Aaronson. “That rules out a lot of the problems we think about in computer science.”\n  Here’s the problem. Imagine you have two random number generators, each producing a sequence of digits. The question for your computer is this: Are the two sequences completely independent from each other, or are they related in a hidden way (where one sequence is the “Fourier transform” of the other)? Aaronson introduced this “forrelation” problem in 2009 and proved that it belongs to BQP. That left the harder, second step — to prove that forrelation is not in PH.\n  Which is what Raz and Tal have done, in a particular sense. Their paper achieves what is called “oracle” (or “black box”) separation between BQP and PH. This is a common kind of result in computer science and one that researchers resort to when the thing they’d really like to prove is beyond their reach.\n The actual best way to distinguish between complexity classes like BQP and PH is to measure the computational time required to solve a problem in each. But computer scientists “don’t have a very sophisticated understanding of, or ability to measure, actual computation time,” said  Henry Yuen, a computer scientist at the University of Toronto.\n So instead, computer scientists measure something else that they hope will provide insight into the computation times they can’t measure: They work out the number of times a computer needs to consult an “oracle” in order to come back with an answer. An oracle is like a hint-giver. You don’t know how it comes up with its hints, but you do know they’re reliable.\n If your problem is to figure out whether two random number generators are secretly related, you can ask the oracle questions such as “What’s the sixth number from each generator?” Then you compare computational power based on the number of hints each type of computer needs to solve the problem. The computer that needs more hints is slower.\n “In some sense we understand this model much better. It talks more about information than computation,” said Tal.\n  The new paper by Raz and Tal proves that a quantum computer needs far fewer hints than a classical computer to solve the forrelation problem. In fact, a quantum computer needs just one hint, while even with unlimited hints, there’s no algorithm in PH that can solve the problem. “This means there is a very efficient quantum algorithm that solves that problem,” said Raz. “But if you only consider classical algorithms, even if you go to very high classes of classical algorithms, they cannot.” This establishes that with an oracle, forrelation is a problem that is in BQP but not in PH.\n Raz and Tal nearly achieved this result almost four years ago, but they couldn’t complete one step in their would-be proof. Then just a month ago, Tal heard a talk on a  new paper on pseudorandom number generators and realized the techniques in that paper were just what he and Raz needed to finish their own. “This was the missing piece,” said Tal.\n  News of the separation between BQP and PH circulated quickly. “The quantum complexity world is a-rocking,”  wrote Lance Fortnow, a computer scientist at Georgia Tech, the day after Raz and Tal posted their proof.\n The work provides an ironclad assurance that quantum computers exist in a different computational realm than classical computers (at least relative to an oracle). Even in a world where P equals NP — one where the  traveling salesman problem is as simple as finding a best-fit line on a spreadsheet — Raz and Tal’s proof demonstrates that there would still be problems only quantum computers could solve.\n “Even if P were equal to NP, even making that strong assumption,” said Fortnow, “that’s not going to be enough to capture quantum computing.”\n Correction June 21, 2018: An earlier version of this article stated that the version of the traveling salesman problem that asks if a certain path is exactly the shortest distance is “likely” to be in PH. In fact, it has been proved to be in PH.", "posttime": "2020-11-09 01:59:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算机,problem", "title": "最后，一个只有量子计算机才能解决的问题(2018)", "title_en": "Finally, a Problem That Only Quantum Computers Will Ever Be Able to Solve (2018)", "transed": 1, "url": "https://www.quantamagazine.org/finally-a-problem-that-only-quantum-computers-will-ever-be-able-to-solve-20180621/", "via": "", "real_tags": ["计算机", "problem"]}, {"category": "", "categoryclass": "", "imagename": "d98cc7667a25a11dc2ac8612ed775598.jpg", "infoid": 1033891, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就啮齿动物而言，飞鼠已经是例外了。它们的四肢之间有一片皮，它们可以在它们生活的树木之间滑行很长一段距离。但新的研究表明，一些动物隐藏着一个奇怪的秘密--它们的皮毛在紫外线照射下会发出灿烂的泡泡糖粉色光芒。\n这使得这些松鼠成为为数不多的几种已知的哺乳动物之一。荧光是指吸收一种颜色或波长的光，然后发射另一种颜色或波长的光的能力。这一发现提出了关于这种发光能力的功能的耐人寻味的问题，并表明这一特征在哺乳动物中可能比之前认为的更常见。\n这项新研究的资深作者、诺斯兰学院(Northland College)的生物学家保拉·斯佩特·阿尼奇(Paula Spaeth Anich)说，这一发现完全是偶然的。\n阿尼奇说，乔恩·马丁(Jon Martin)是一名林业教授，也是这篇论文的合著者。他在夜间探索威斯康星州的一片森林，用紫外线手电筒扫描树冠上偶尔发出荧光的地衣、真菌、植物和青蛙。\n“有一天晚上，”阿尼奇说，“他听到一只飞松鼠对着一个喂鸟器的叫声，就用手电筒对准它，惊讶地看到了粉红色的荧光。”\n马丁把这次遭遇告诉了研究啮齿动物的阿尼奇。阿尼奇说：“我不得不承认，这个发现让我有点困惑。”“我试着把它放在一些我能理解的背景下。这是因为节食吗？这是本地现象吗？“。\n为了了解这种特征的广泛性，研究人员前往明尼苏达州的科学博物馆和芝加哥的菲尔德博物馆对飞行松鼠的皮肤进行了检查。北美的飞鼠(Glaucomys)由三种居住在森林中的松鼠组成，范围从西北部到加拿大，从美国东部一直到中美洲。研究小组在可见光和紫外光下拍摄照片，将它们与不会滑行的松鼠进行比较，并测量了荧光强度。\n虽然不会飞的松鼠没有发光，但除了一只外，所有的滑翔机样本都发出了类似的粉红色荧光。不管动物的性别或位置如何，这都是真的。\n阿尼奇说：“从19世纪到21世纪，从危地马拉到加拿大，无论是男性还是女性，在所有季节采集的标本中都有这种荧光。”\n虽然其他动物--例如海雀的嘴和变色龙的骨头--在紫外线照射下会发出诡异的蓝色光芒，但已知的唯一有荧光皮毛的哺乳动物是大约24种负鼠。这些分布在美洲各地的有袋类动物与飞松鼠没有密切的亲缘关系，生活在不同的生态系统中，有着不同的饮食习惯。\n但飞松鼠和负鼠确实有一个共同点：它们都在夜间和黄昏活动，而其他松鼠大多是白天活动的。\n弱光条件下的紫外光相对丰富，紫外光视力通常被认为对夜间活动的动物很重要。正因为如此，阿尼奇认为粉红色的光芒与夜间的感知和交流有关。\n粉红色还可以帮助飞鼠在寒冷、多雪的环境中飞行，这三个物种都在部分或全部活动范围内遇到了这种环境。\n阿尼奇说：“由于雪对紫外线的高反射率，这一特征在下雪的条件下可能更明显或更明显。”“如果这一特征与动物交流有关，雪可能会给它带来‘提振’。”\n但是荧光可能在说什么呢？科琳·迪金斯(Corinne Diggins)是弗吉尼亚理工大学(Virginia Tech University)的野生生物学家，没有参与这项研究。她怀疑这是否是松鼠向潜在配偶发出相对健康和活泼的信号的一种方式。\n迪金斯说：“也许雄性飞鼠身上鲜艳的粉红色荧光腹部会让雌性松鼠晕倒。”\n然而，阿尼奇认为这不太可能，因为荧光没有季节性高峰，也没有男性和女性之间的差异。与此同时，导致毛皮发出荧光的机制尚不清楚。\n阿尼奇和她的团队为粉色发光提供了其他可能的用途：伪装或模仿。许多覆盖着树木的地衣也会发出荧光，松鼠粉色的皮毛可能是融入周围环境的一种方式。或者，一些猫头鹰的腹部会发出亮粉色的荧光，因此松鼠可能会模仿这种颜色。\n华盛顿大学伯克博物馆(University of Washington‘s Burke Museum)哺乳动物馆长吉姆·凯纳吉(Jim Kenagy)没有参与这项研究，他好奇地想知道，在世界其他地方的飞行松鼠物种中是否也发现了这种荧光。\n凯纳吉说：“令人惊讶的是，他们没有测试更多代表飞松子家族其他物种的物种。”\n迪金斯说：“(这项研究)突显了飞松鼠如何相互作用以及它们所处的环境还有很多需要了解的地方。”\n了解飞松鼠如何看待它们的世界，以及这个世界如何看待它们，对于充分认识它们的栖息地需求至关重要，这与它们的持续保护息息相关。这一发现还提出了一种可能性，即许多其他哺乳动物都有一种紫外线专属的皮毛，这对我们来说是完全未知的。\n“教训是，从我们灵长类动物白天的角度来看，我们忽略了发生在黄昏和夜间的动物交流和感知的许多方面，”阿尼奇说。", "note_en": "Flying squirrels were already exceptional, as far as rodents go. Gifted with a flap of skin between their limbs, they can glide long distances between the trees where they live. But  new research suggests some of the critters hide a bizarre secret—their fur glows a brilliant, bubble-gum pink under ultraviolet light.\n This makes these squirrels one of only a few mammals known to fluoresce, which is the ability to absorb light in one color, or wavelength, and emit it in another. The finding raises tantalizing questions about the function of this glowing ability and suggests that the trait may be more common than previously thought among mammals.\n The discovery happened entirely by accident, says Paula Spaeth Anich, a biologist at Northland College and senior author on the new study,  published this month in the  Journal of Mammalogy.\n  Anich says that Jon Martin—a forestry professor and coauthor on the paper—was exploring a Wisconsin forest at night, using a UV flashlight to scan the canopy for lichens, fungi, plants, and frogs that occasionally fluoresce.\n “One evening,” says Anich, “he heard the chirp of a flying squirrel at a bird feeder, pointed the flashlight at it, and was amazed to see pink fluorescence.”\n   Martin told Anich—who studies rodents—about the encounter. “I have to admit that the discovery was a little confusing to me,” says Anich. “I tried to put it into some context I could understand. Was this due to diet? Was this a local phenomenon?”\n To see how widespread the trait might be, the researchers took to the Science Museum of Minnesota and the Field Museum in Chicago to examine the skins of flying squirrels. North America’s flying squirrels ( Glaucomys) consist of three forest-dwelling species, ranging from the Northwest through Canada and the eastern United States down to Central America. The team took photographs under visible and ultraviolet light, compared them to non-gliding squirrels, and measured the intensity of fluorescence.\n While non-flying squirrels didn’t glow, all but one specimen of the gliders did fluoresce a similar pink color. This was true despite the sex or location of the animal.\n “The fluorescence was there in the  Glaucomys from the 19th to 21st century, from Guatemala to Canada, in males and females, and in specimens collected in all seasons,” says Anich.\n While other animals fluoresce— puffins’ bills and  chameleon’s bones give off an eerie, blue glow under UV light, for example—the only other mammals known to have fluorescent fur are about two dozen species of opossum. These marsupials, scattered across the Americas, aren’t closely related to flying squirrels, live in different ecosystems, and have a different diet.\n  But flying squirrels do share one thing with the opossums: they’re all active at night and twilight, where other squirrels are mostly diurnal.\n Low-light conditions are relatively rich in ultraviolet light, and UV vision is generally thought to be important to nocturnal animals. Because of this, Anich thinks the pink glow has something to do with night-time perception and communication.\n The pink color may also help flying squirrels navigate cold, snowy environments, which all three species encounter in parts or all of their range.\n “The trait might be more visible, or noticeable, in snowy conditions because of the high rate of UV reflectance off of snow,” says Anich. “If this trait is involved in animal communication, snow might give it a ‘boost.’”\n  But what might the fluorescence be saying?  Corinne Diggins—a wildlife biologist at Virginia Tech University not involved in this study—wonders if it’s a way for the squirrels to signal relative health and vivaciousness to potential mates.\n “Maybe a brightly pink fluorescent belly on a male flying squirrel makes a female swoon,” Diggins says.\n However, Anich doesn’t think that’s as likely, since there was no seasonal peak in fluorescence or difference between males and females. Meanwhile, the mechanism that causes fur to fluoresce is unknown.\n  Anich and her team offer other possible uses for the pink glow: camouflage or mimicry. Many lichens that blanket trees also fluoresce, and the squirrels’ pink fur may be a way to blend in to their surroundings. Alternatively, some owls fluoresce bright pink on their undersides, so the squirrels may be mimicking this coloration.\n Jim Kenagy, curator of mammals at University of Washington’s Burke Museum and not involved in this study, is curious to see if the fluorescence is found in flying squirrel species elsewhere in the world.\n “It’s surprising that they did not test more of the species that represent the rest of the flying squirrel subfamily,” says Kenagy.\n  “[This research] highlights how much more there is to learn about how flying squirrels interact with each other and their environment,” says Diggins.\n Understanding how flying squirrels see their world—and how that world sees them—is crucial for fully appreciating their habitat needs, which is deeply intertwined with their continued conservation. The discovery also presents the possibility that many other mammals have a UV-specific coat, completely unknown to us.\n “The lesson is that, from our diurnal primate standpoint, we are overlooking many aspects of animal communication and perception that happen at twilight and night-time,” says Anich.", "posttime": "2020-11-09 01:59:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "飞行,squirrels,松鼠", "title": "由于荧光，飞行松鼠发出粉红色的光", "title_en": "Flying squirrels glow pink thanks to fluorescence", "transed": 1, "url": "https://www.nationalgeographic.com/animals/2019/01/flying-squirrels-fluorescent-secretly-glow-pink/", "via": "", "real_tags": ["飞行", "squirrels", "松鼠"]}, {"category": "", "categoryclass": "", "imagename": "e5487e436d7ee2f33e1f5743c92521c2.jpg", "infoid": 1033890, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几十年来，电视偶像亚历克斯·特雷贝克(Alex Trebek)在与胰腺癌的一场公开较量中去世。几十年来，特雷贝克一直以问题的形式回答问题，成为电视必看的节目。他的游戏节目《危险边缘》(Jeopardy)收视率很高。\n该游戏节目在一份声明中说，这位标志性的主持人周日早上在家人和朋友的陪伴下“平静地”在家中去世。\n特雷贝克勇敢地录制了这部受欢迎的电视剧的几集，尽管它在1964年首次亮相，比他接手整整20年，但他仍然勇敢地录制了这部热播电视剧的插曲，尽管它是在痛苦的癌症治疗中出现的。\n特雷贝克的重启版成为了全国各地家庭的晚间必备节目，家庭们与《每日双打》和《最后的危险》一起玩耍，与敲响蜂鸣器的参赛者斗智斗勇。\n在特雷贝克的监督下，《危险边缘》在好莱坞星光大道上赢得了一颗星，获得了六项艾美奖，并创下了由同一人主持的大多数游戏节目的吉尼斯世界纪录。\n但2019年成为特雷贝克最具挑战性的一年，仅次于《危险边缘》(Jeopardy)办公桌。3月4日，他在YouTube上分享了一段视频，并宣布了自己的癌症诊断。\n“就像美国每年有5万人一样，这周我被诊断出患有4期胰腺癌，”他告诉他的粉丝们。“我计划打破这种疾病的低存活率统计数据。”说实话，我不得不这样做，因为根据我的合同条款，我还得再主持三年的《危险边缘》(Jeopardy)。“。\n但特雷贝克用头发录制了一些节目，他后来承认，在录制期间的几天里，他“痛苦地扭动着”。\n那一季晚些时候，随着职业体育赌徒詹姆斯·霍尔祖尔(James Holzhauer)在33次出场中积累了超过240万美元的收入-平均每集74673美元，《危险边缘》的收视率飙升。\n在Holzhauer竞选期间，收视率上升了约30%，近1500万观众收看了他的失利。\n他没有任何弱点。。。。他有一个策略。“特雷贝克在霍尔祖尔竞选期间说。“他是个赌徒。”\n乔治·亚历山大·特雷贝克1940年7月22日出生于安大略省大萨德伯里。特雷贝克在渥太华大学获得哲学学位，在那里他是英语辩论协会的成员。\n特雷贝克对广播事业很感兴趣，在完成学位之前，他在加拿大广播公司(Canada Broadcast Corporation)找到了一份工作，阅读国家新闻和其他职责。\n特雷贝克第一次在美国露面是作为《赔率奇才》的主持人，这部电视剧只持续了一季。在最后一集播出三天后，他开始主持以骰子为基础的游戏节目“豪赌”。这一次，制片人与联合主持人-女演员Ruta Lee-合作，他们迷人的融洽关系在观众中大受欢迎。\n李开复在2019年6月接受福克斯新闻采访时说：“我认为我们最开心的时候就是在台下。”在私下里，他至今仍是一位亲密的朋友。\n特雷贝克还出演了一部不太成功的《双重挑战》(Double Dare)--《12.8万美元的问题》。《瀑布》和《经典聚精会神》\n但那是“危险边缘！”这将使他成为超过35年的每日电视主打节目。\n尽管在美国工作了几十年，特雷贝克直到1998年才加入美国国籍。\n特雷贝克解释说：“我的生活一直是对知识和理解的追求，但我还远远没有做到这一点。”“我一点也不介意。我死的时候会想不出生活中很多事情的答案。“", "note_en": "TV icon Alex Trebek, who for decades made must-watch TV out of delivering answers in the form of a question with his long-running and highly-rated game show, “Jeopardy,” has died after a publicized bout with pancreatic cancer.\n        The iconic host died “peacefully” at home Sunday morning, surrounded by family and friends, the game show said in a statement.\n  Trebek, who bravely recorded episodes of the popular show even in the midst of painful cancer treatments personified the program, even though it debuted in 1964, a full 20 years before he took over.\n      Trebek’s rebooted version became an evening staple in homes across the country with families playing along with “Daily Doubles” and “Final Jeopardy” to match wits with buzzer-banging contestants.\n  Under Trebek’s watch, “Jeopardy” earned a star on the Hollywood Walk of Fame, six Emmy Awards, and the Guinness World Record for Most Game Show Episodes Hosted by the Same Person.\n      But 2019 became Trebek’s most challenging year behind the “Jeopardy” desk. On March 4, he shared a video on YouTube and announced his cancer diagnosis.\n  “Just like 50,000 other people in the United States each year, this week I was diagnosed with Stage 4 pancreatic cancer,” he told his fans.. “I plan to beat the low survival rate statistics for this disease. Truth told, I have to because under the terms of my contract, I have to host Jeopardy for three more years.”\n    But Trebek, who taped some shows with a hair piece, would later admit that he was “writhing in pain” some days between tapings.\n   Later that season, “Jeopardy” ratings spiked as professional sports gambler James Holzhauer amassed more than $2.4 million during his 33 appearances — an eye-popping average of $74,673 per episode.\n  Ratings rose about 30% during Holzhauer’s run and nearly 15 million viewers tuned in to watch him lose.\n  “He has no weaknesses. . . . He has a strategy,” Trebek said during Holzhauer’s run. “He’s a gambler.”\n    George Alexander Trebek was born July 22, 1940 in Greater Sudbury, Ontario. Trebek earned a degree in philosophy from the University of Ottawa, where he was a member of the English Debating Society.\n   Trebek was interested in a career in broadcasting, and before he completed his degree, he took a job with the Canadian Broadcasting Corporation, reading the national news among other duties.\n    Trebek’s first American exposure was as host of “The Wizard of Odds,” a series that lasted only one season. Three days after its final episode, he began hosting the dice-based game show “High Rollers.” This time, producers teamed him with co-host — actress Ruta Lee — and their engaging rapport was a hit with audiences.\n    “I think the most fun we had was when we were off the stage,” said Lee, in a June 2019 interview with Fox News. “In private, he became a close and dear friend to this day.”\n    Trebek also starred on the less successful “Double Dare” “The $128,000 Question.” “Pitfall” and “Classic Concentration.”\n   But it was “Jeopardy!” that would make him a daily TV staple for more than 35 years.\n  Despite working in the U.S. for decades, Trebek didn’t become a naturalized citizen until 1998.\n      “My life has been a quest for knowledge and understanding, and I am nowhere near having achieved that,” explained Trebek. “And it doesn’t bother me in the least. I will die without having come up with the answers to many things in life.”", "posttime": "2020-11-09 01:58:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "边缘,host,贝克", "title": "《危险边缘》主持人亚历克斯·特雷贝克在抗癌斗争中去世，享年80岁", "title_en": "'Jeopardy’ host Alex Trebek dead at 80 after cancer battle", "transed": 1, "url": "https://www.nydailynews.com/snyde/ny-jeopardy-host-alex-trebek-dead-20201108-yxqn7dgnv5dsjj4e6uqte3twee-story.html", "via": "", "real_tags": ["边缘", "host", "贝克"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033889, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "<p>投票系统可以利用区块链的安全性和邮件提供可靠的投票系统。登记选民在邮件中收到计算机可读代码，并在选举中确认身份和确认正确的选票信息。该系统将选民身份和投票分开，以确保投票匿名性，并将选票存储在区块链中的分布式分类账上。</p>", "note_en": "<p id=\"p-0001\" num=\"0000\">A voting system can use the security of blockchain and the mail to provide a reliable voting system. A registered voter receives a computer readable code in the mail and confirms identity and confirms correct ballot information in an election. The system separates voter identification and votes to ensure vote anonymity, and stores votes on a distributed ledger in a blockchain.</p>", "posttime": "2020-11-09 01:58:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "区块链,usps,patent,选民", "title": "用区块链保护可靠投票系统的USPS专利", "title_en": "USPS patent for reliable voting system secured with blockchain", "transed": 1, "url": "https://patentscope.wipo.int/search/en/detail.jsf?docId=US301570250&tab=NATIONALBIBLIO", "via": "", "real_tags": ["区块链", "usps", "patent", "选民"]}, {"category": "", "categoryclass": "", "imagename": "7efb0dcffdfe3fec09bff5d6cc5df73b.jpg", "infoid": 1033886, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "记录我们在大流行期间在全球各地的心情", "note_en": "Recording our mood around the globe, during the pandemic", "posttime": "2020-11-09 01:57:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,coronavirus,feelings,记录", "title": "冠状病毒大流行期间人们的感受", "title_en": "People’s feelings during Coronavirus pandemic", "transed": 1, "url": "https://covid-mood.world/", "via": "", "real_tags": ["病毒", "冠状病毒", "feelings", "记录"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从我7岁起，我就想要一个乐高头脑风暴机器人。我承认，在后来的几年里，我主要是想向自己证明，在我年轻的时候，它看起来是如此昂贵，我已经取得了一定的成就。…。\n我知道它有一些运行MicroPython的能力，因为在产品描述中主要提到了这一点，这听起来像是一个非常容易被黑客攻击的平台。\n然而，在打开盒子后不久，我意识到这根本不只是MindStorms EV3的更新。显然，Robot的发明者比AA电池稍贵一些，功能更少，而且使用的是脂肪电池而不是AA电池。\n幸运的是，我通过商店的网站订购了它，这意味着根据法律，我可以在14天内退货，无论出于什么原因，它允许我打开盒子进行检查。\n因此，在说服一些顽固的店员相信这不是消费品(这会剥夺我打开盒子的权利)后，我拿回了它，并订购了EV3。\n两天后，我终于得到了我梦寐以求的东西。\n当我在等待EV3的时候，我四处看看它是如何做MicroPython的，就像它在下载页面上的这段话一样。\n现在，您可以使用EV3 Brick通过MicroPython释放Python编程的强大功能。只需将EV3 MicroPython镜像安装到任何Micro SD卡上，然后从其中启动EV3 Brick，即可立即开始编程。\n经过几分钟的搜索，我找到了ev3dev，这是一个开放源码社区项目，允许您在上面运行Debian！\n它看起来做得很好，而且显然足够好，乐高可以提供它的官方版本，这就是他们用来支持MicroPython的。\n因此，我继续下载磁盘镜像，并使用dd将其刷新到microSD卡。然后，我将microSD卡插入EV3控制器并打开…。\n令我惊讶的是，在通电后，我很高兴看到内核dmesg的输出在第一次尝试时就在EV3的LCD上滚动显示出来！\nRobot@ev3dev：~$uname-aLinux ev3dev 4.14.117-ev3dev-2.3.5-ev3#1 Preempt Sat Mar 7 12：54：39 CST 2020 armv5tejl GNU/linuxbot@ev3dev：~$cat/etc/os-Release PRETTY_NAME=&#34；ev3dev-stretch&#34；NAME=&#34；ev3dev-stretch&#34；ID=ev3devID_LIKE=debianHOME_URL=&#34；http://www.ev3dev.org&#34；SUPPORT_URL=&#34；http://www.ev3dev.org/support&#34；BUG_REPORT_URL=&#34；Https://github.com/ev3dev/ev3dev/issues&#34；\n在玩了大约两分钟后，我意识到了一些事情…。这款软件在Debian上运行的包库相当完整(它有大约64000个包，而普通的AMD64 Debian有大约66000个包)，它能运行BIRD吗？\n我猜想如果ARM926EJ-S CPU可以运行Debian之类的东西，那么它大概可以运行非常简单的BIRD配置，但是我对56MB的RAM不是很确定。\n所以我继续输入sudo apt install bird，然后按Enter…键\nBot@ev3dev：~$sudo apt安装Birdread软件包列表...。正在完成正在生成依赖关系树，正在读取状态信息...。DoneSuggest套餐：bird-doc.。\n(这实际上慢得令人痛苦，因为这款机器一点也没有强大的CPU)。\n当我看到鸟医生的时候，我意识到，是的，它至少有鸟在回购中，所以这是一个很好的第一步。\n我在这里只安装BIRD 1.6.3，因为如果我只运行IPv6守护进程并禁用IPv4守护进程，它可能会比BIRD 2使用更少的资源。\n然后，我编写了一个快速的小鸟配置，让EV3(AS202314)向我的家庭路由器(AS210089)通告2a0d：1a45：666：：/48，然后家庭路由器将处理其余的事情。\n我应用了这一点，并在我的家用路由器上写下了配置的另一端，也应用了这一点。\n然后我去了NLNOG的Look Glass戒指，我看到了AS202314宣布的/48！\n然后我把它发给了一个朋友，他指出只有大约一半的消息来源可以看到这条路线，结果发现我忘了给AS202314一个RPKI ROA作为前缀，所以我补充了这一点。\n然后，出于演示的目的，我安装了ngix，它运行得出奇地好，所以我有了一个网站，我可以在http://[2a0d:1a45:666：：]/[1]上访问它。\n这是出人意料的容易上手。向ev3dev人员致敬，因为他们为EV3制作了这个Debian衍生品。\n虽然让EV3坐在那里宣布IPv6的/48本身并不有用，但这显示了该平台的灵活性。事实上，我可以做这件傻事，这意味着我可以做一些不涉及BGP的更酷的事情，比如运行Web服务器和其他事情。\n如果这是你喜欢的，也许你会发现我的其他帖子很有趣，你也可以在Twitter上找到我的小项目和漫谈：@bitcynth。\n感谢本·考克斯和莫莉·米勒帮助编辑这篇博客文章。", "note_en": "Since I was 7 years old, I have wanted a LEGO Mindstorms robot. I will admit that in the later years it was mainly that I wanted to prove to myself that I got somewhere as it seemed so infinitely expensive back when I was younger…\n   I knew this thing had some capability to run  MicroPython since that was mentioned in the product description quite predominantly, which sounded like a pretty hackable platform.\n However, shortly after opening the box, I realized that this wasn’t at all just an update to the  Mindstorms EV3. Apparently the Robot Inventor was a slightly more expensive thing with less features and using a LiPo battery instead of AA cells.\n Luckily I ordered it via the store’s website which means that by law I can return it within 14 days for any reason, and it allows me to open the box for inspection.\n So after convincing some stubborn store employee that this is not a consumable product (which would remove my right to open the box), I got it returned and ordered the EV3.\n Then two days later I finally had the thing which I have wanted for so long.\n While I was waiting for the EV3, I was looking around at how it did MicroPython as it had this paragraph on the downloads page.\n You can now use your EV3 Brick to unleash the power of Python programming using MicroPython. Simply install the EV3 MicroPython image onto any micro SD card and boot up your EV3 Brick from it to start programming straight away.\n After just a few minutes of searching I found  ev3dev which is an open source community project that allows you to run Debian on it!\n It appears to be really well made and apparently good enough for LEGO to provide  official builds of it, which is what they use for MicroPython support.\n So I just went ahead and downloaded and flashed the disk image to a microSD card with  dd.I then plugged in the microSD card into the EV3 controller and turned it on…\n  To my surprise, after applying power I was pleased to see kernel dmesg output scrolling out on the LCD of the EV3 on the first try!\n robot@ev3dev:~$ uname -aLinux ev3dev 4.14.117-ev3dev-2.3.5-ev3 #1 PREEMPT Sat Mar 7 12:54:39 CST 2020 armv5tejl GNU/Linuxrobot@ev3dev:~$ cat /etc/os-release PRETTY_NAME=&#34;ev3dev-stretch&#34;NAME=&#34;ev3dev-stretch&#34;ID=ev3devID_LIKE=debianHOME_URL=&#34;http://www.ev3dev.org&#34;SUPPORT_URL=&#34;http://www.ev3dev.org/support&#34;BUG_REPORT_URL=&#34;https://github.com/ev3dev/ev3dev/issues&#34;\n After playing around with it for about two minutes, I realized something… this thing runs Debian with a pretty damn complete package repository (it has ~64000 packages and normal amd64 Debian has ~66000 packages), can this thing run BIRD?\n I assumed that if the ARM926EJ-S CPU can run Debian and stuff it can probably run a very minimal BIRD config, however I wasn’t so sure about the 56MB of RAM.\n  So I just went ahead and typed  sudo apt install bird and pressed enter…\n robot@ev3dev:~$ sudo apt install birdReading package lists... DoneBuilding dependency tree Reading state information... DoneSuggested packages: bird-doc\n (this was actually painfully slow as this thing doesn’t have a powerful CPU in the slightest)\n As soon as I saw  bird-doc I realized that yes it did at least have BIRD in the repo so that was a good first step.\n I am only installing BIRD 1.6.3 here as it will probably use less resources than BIRD 2 if I only run the IPv6 daemon and disable the IPv4 daemon.\n I then wrote a  quick little bird config to let the EV3 (AS202314) announce 2a0d:1a45:666::/48 to my home router (AS210089), and the home router will then deal with the rest.\n I applied that and wrote the other end of the config on my home router and applied that too.\n Then I went to the  NLNOG RING Looking Glass and I saw the /48 show up as announced by AS202314!\n  I then sent it to a friend who pointed out only about half of his sources could see the route, and well turns out I forgot to give AS202314 an  RPKI ROA for the prefix, so I added that.\n Then just for demo purposes I installed nginx which worked surprisingly well, so then I had a website I could access at http://[2a0d:1a45:666::]/   [1].\n This was surprisingly easy to get working. Hats off to the  ev3dev people for making this Debian derivative for the EV3.\n While having the EV3 sitting there announcing a /48 of IPv6 is not useful in itself, this shows off how flexible the platform is. The fact that I can do this silly thing means that I can do much cooler things that don’t involve BGP on this, like running web servers and other things.\n  If this was to your liking then maybe you will find my other posts interesting, and you can also find my smaller projects and ramblings on twitter:  @bitcynth.\n Thank you to  Ben Cox and  Molly Miller for the help in editing this blog post.", "posttime": "2020-11-09 01:57:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "头脑,networking,ev3", "title": "乐高头脑风暴上的BGP网络", "title_en": "BGP Networking on Lego Mindstorms", "transed": 1, "url": "https://blog.cynthia.re/post/bgp-lego", "via": "", "real_tags": ["头脑", "ev3"]}, {"category": "", "categoryclass": "", "imagename": "ecaf45642c623e81ec040e3521a6afd5.jpg", "infoid": 1033884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我刚刚尝试使用GO提示(也就是即将推出的GO 1.16)构建VictoriaMetrics项目，并注意到与GO 1.15.4相比，生成的二进制大小显著减少：\n$ls-lgg--si bin/总计34M-rwxr-xr-x 1 19M 11月7日01：19 Victoria-Metrics-go1.15.4-rwxr-xr-x 1 16M 11月7 01：21 Victoria-Metrics-Go-Tip。\nVictoriaMetrics的可执行文件大小已从19MB减少到16MB，几乎减少了16%。这看起来太棒了！\n如果能知道Go 1.16中的哪些特殊变化导致了如此巨大的二进制大小缩减，那将是一件很棒的事情。", "note_en": "Just tried building  VictoriaMetrics project with Go tip (aka upcoming Go 1.16) and noticed significant reduction in produced binary size comparing to Go 1.15.4:\n $ ls -lGg --si bin/total 34M-rwxr-xr-x 1 19M Nov 7 01:19 victoria-metrics-go1.15.4-rwxr-xr-x 1 16M Nov 7 01:21 victoria-metrics-go-tip\n VictoriaMetrics executable size has been reduced from 19MB to 16MB - almost 16% reduction. This looks awesome!\n It would be great to know which particular changes in Go 1.16 are responsible for such great binary size reduction.", "posttime": "2020-11-09 01:54:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生成,reduces,metrics", "title": "GO 1.16减少了生成的可执行文件的大小", "title_en": "Go 1.16 reduces significantly reduces sizes for built executables", "transed": 1, "url": "https://www.reddit.com/r/golang/comments/jqdkc6/upcoming_go_116_reduces_significantly_reduces/", "via": "", "real_tags": ["生成", "reduces", "metrics"]}]