[{"category": "", "categoryclass": "", "imagename": "021567703039d6691b33a84a63afcde5.png", "infoid": 1066821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都听到了这个谜语：如果在Windows 10中挖掘足够深，您将在Windows 3.x天中找到日期的元素。但它实际上是真的吗？在本文中，我们将发现Windows中有多少个UI层以及首次引入时的UI层。\n 出于本实验的目的，我选择了最新的Windows 10 Insider Build（截至2月6日，2021年），这是Windows 10 Build 21301。\n   首先，我们从最新，最伟大，流利的设计开始。 2017年宣布并介绍Windows 10 1803更新，Fluent Design是现代设计语言2（MDL2）的重大重新设计，旨在带来光，深度，运动，材料和规模等元素。它还介绍了揭示效果和丙烯酸半透明背景。\n 截至目前，大多数收件箱（UWP）应用程序已升级以使用流利的元素，以及一些更前面的元素，如开始菜单，活动中心和登录屏幕。\n 虽然流利的设计很受欢迎，但大多数爱好者认为这一行动太少了，太晚了，因为这种新的设计风格只有一个小的功能小组。\n   正如我们更深入地挖掘OS，我们可以看到自版本8/8.1以来尚未升级的元素。\n 其中一些是耀眼的疏散，如音量弹出，USB弹出以及登录屏幕的一些元素。 \n其他地铁元素虽然不是那么突出，是启动屏幕（很快将用更新的一个）和winre\n   您是否知道：第一次引入旋转点处于Windows 8 Build 7989中。\n  就像Windows 10一样，Windows 8也困扰着不一致的问题（无论好坏）。但是，Windows 8为主要用户元素（如Windows资源管理器或任务管理器）添加了有意义的增强功能。虽然它们会在随后的Windows 10更新中获得一些生活质量改进，但更改将是最小的。\n 此外，Windows 8带来的一个重要变化是文件传输对话框的重新设计。\n  其中一些更改在Windows 7中启动，这将我们带到第四层：\n  Windows 7毫无疑问是所有时间最受欢迎的Windows版本之一，赞扬了在Windows Vista上的巨大增强。它带来了许多新功能，尽管与Vista引入的那么重要，但使Windows 7成为一个非常坚固的操作系统，以及Windows XP的真实继承者。然而，带有Windows 7带来的最令人讨厌的变化之一是带UI，它是从Office 2007移植的功能。使用新的Ribbon UI更新的一些应用程序是Paint和WordPad。\n 虽然在某些时候微软决定贬低经典的涂料，支持新的涂料3D（用Windows 10创作者更新推出），后，他们扭转了他们的决定。 \n以来，在Windows 7中更新的其他功能，自从以下是：Windows Media Player 12，远程桌面连接和某些文件对话框。\n   Windows Vista是一个巨大的Windows版本，一个为平台带来了许多需要的现代化。 OS的几乎所有基本原理都以某种方式或另一种方式改进，从引导加载程序到驱动程序模型。然而，正如我们现在所知道的那样，Windows Vista将成为有史以来最糟糕的Windows发布之一，从一开始就困扰着问题。但是，少数称赞的功能之一是UI。它重新设计了自Windows 95以来尚未更新的一些基本原理。这一变化的主要促销活动之一是引入所谓的航空巫师，取代了以前的向导标准Wizard97。\n  在Windows Vista中重新设计的其他功能，在Windows 10中基本相同：控制面板，搜索程序，Windows传真和扫描。\n  说到Windows Vista：你知道在某些特殊情况下，Windows 10返回Vista Boot屏幕吗？当您的视频卡不支持标准启动屏幕使用的视频模式时，会发生这种情况。\n  相信它，没有那些嵌入到Windows 10中的许多XP元素。这可能是因为大多数基本面都是在Windows 2000中更新的。然而，Windows 10包含XP的一些文件对话框，当一个人安装一个司机。\n   Windows 2000是Microsoft的操作系统NT阵容的大型里程碑。它也是踩踏石头，它将发出到一个新的统一Windows愿景的转换。但是，Windows 2000仍然是一个以商业为导向的操作系统，这意味着它为专家提供了很多新功能。\n 最重要的添加之一是管理控制台（MMC），其UI元素以来基本上是相同的。 \n默认情况下在Windows 2000中引入的另一个功能是Windows Installer，它仍然存在于首次介绍时的图标！\n  另一个没有改变的UI元素（当然，当然，除了品牌之外）是Winver，其设计在Windows 2000 Build 1946中引入。\n  虽然Windows 2000引入了旨在为Power Users的大量功能，Windows 95可能是迄今为止最重要的Windows版本。它介绍了这一天的基本范式。它引入了“开始”菜单，上下文菜单，任务栏和回收站等功能。虽然这些功能当然在多年的过程中更新，但有些人几乎完全相同。\n  一个基本上是旧的计算习惯的元素，其中一个人必须保护他们的宝贵CRT屏幕是屏保设置。\n    传递时间测试的一个常见UI元素是文件夹属性屏幕。\n  并且有许多从Windows 95开始触及的UI元素。这是永恒设计的情况吗？我会让你自己判断。\n  嗯，这不是一个真正的“UI层”，因为我没有找到任何界面元素，捕获Windows 95（尽管我有一种肯定是有的感觉）。但是，Windows 10中存在一个特殊的文件，名为Moricons.dll，其中包含DoS天中的大量旧图标。看一看： \n好吧，这几乎是它。 正如您所知道的，微软计划用他们的“Sun Valley”更新改革Windows的UI，旨在统一操作系统的设计。 但是，正如我们所看到的，Windows是一个操作系统的庞然大物。 他们的努力将终于让凝聚力的用户体验成功吗？ 只有时间会给出答案。 ", "note_en": "We’ve all heard this riddle: if you dig down deep enough in Windows 10, you’ll find elements that date from Windows 3.x days. But is it actually true? In this article we’ll discover just how many UI layers are in Windows and when they were first introduced.\n For the purpose of this experiment, I chose the latest Windows 10 Insider Build (as of February 6th, 2021), which is Windows 10 build 21301.\n   First, we begin with the latest and greatest, Fluent Design. Announced in 2017 and introduced with Windows 10 1803 update, Fluent Design is a major redesign of the Modern Design Language 2 (MDL2), aimed at bringing elements like Light, Depth, Motion, Material, and Scale. It also introduces the Reveal effects and the Acrylic translucent background.\n As of now, most of the inbox (UWP) applications have been upgraded to take use of Fluent elements, as well as some of the more front-facing elements, like the Start Menu, Activity Center and the Login Screen.\n Although Fluent Design was well appreciated, most of the enthusiasts considered this move too little, too late, as only a small subset of features have been enhanced with this new design style.\n   Just as we dig a bit deeper into the OS, we can see elements that haven’t been upgraded since Windows 8/8.1.\n Some of these are glaring omissions, like the volume flyout, the USB flyout as well as some elements from the login screen.\n  Other Metro elements, although not as prominent, are the boot screen (which will soon be replaced with a newer one) and WinRE\n   Did you know: the first time the spinning dots were introduced was in Windows 8 build 7989.\n  Just like Windows 10, Windows 8 was also plagued with inconsistency issues (for better or for worse). However, Windows 8 added meaningful enhancements to major user elements, like the Windows Explorer or Task Manager. Although they would receive some quality-of-life improvements in subsequent Windows 10 updates, changes would be minimal.\n Also, an important change brought by Windows 8 was the redesign of the File Transfer dialogs.\n  Some of these changes started in Windows 7, which brings us to the fourth layer:\n  Windows 7 is without doubt one of the most beloved versions of Windows of all time, praised for its great enhancements over Windows Vista. It brought many new features that, although weren’t as significant as those that Vista introduces, made Windows 7 a very solid OS, and a true successor to Windows XP. However, one of the most infamous changes brought with Windows 7 is the Ribbon UI, which is a feature ported from Office 2007. Some of the apps that got updated with the new Ribbon UI are Paint and Wordpad.\n Although at some point Microsoft decided to deprecate the classic Paint in favor of the new Paint 3D (introduced with Windows 10 Creators Update), after major backlash, they reversed their decision.\n  Other features that were updated in Windows 7 and remained the same ever since are: Windows Media Player 12, Remote Desktop Connection and some file dialogs.\n   Windows Vista was a monumental Windows release, one that brought much needed modernization to the platform. Almost all of the fundamentals of the OS have been in some way or another improved, from the bootloader to the driver model. However, as we all know by now, Windows Vista would come to be one of the worst Windows releases ever, plagued with issues from the beginning. One of the few features that were praised, though, was the UI. It redesigned some of the fundamentals that haven’t been updated since Windows 95. One of the main promotors of this change was the introduction of the so-called Aero Wizards, replaced the previous wizard standard, Wizard97.\n  Other features that were redesigned in Windows Vista and are basically the same in Windows 10: the Control Panel, the Search program, Windows Fax and Scan.\n  Speaking of Windows Vista: did you know that in certain special circumstances Windows 10 falls back to the Vista boot screen? It happens when your video card doesn’t support the video mode that the standard boot screen uses.\n  Believe it or not, there are not that many XP elements embedded into Windows 10. That’s probably because most of the fundamentals were updated already into Windows 2000. However, Windows 10 contains some file dialogs from XP, which are seen when one is installing a driver.\n   Windows 2000 was a big milestone for the NT lineup of operating systems from Microsoft. It also was the stepping stone that would signal the start the transition to a new, unified Windows vision. However, Windows 2000 was still a business-oriented OS, which means that it brought a lot of new features designed for experts.\n One of the most significant addition is the Management Console (MMC), whose UI elements are basically the same ever since.\n  Another feature introduced by default in Windows 2000 is Windows Installer, which still has the same icon from when it was first introduced!\n  Another UI element that hasn’t changed (apart from branding, of course) is winver, whose design was introduced in Windows 2000 build 1946.\n  While Windows 2000 introduced lots of features aimed for power users, Windows 95 is probably the most significant Windows release to date. It introduced fundamental paradigms that still hold to this day. It introduced features like the Start Menu, context menus, the taskbar and recycle bin. While these features were of course updated over the course of many years, some remained almost exactly the same.\n  An element that is basically a relic of the older computing habits, where one had to protect their precious CRT screen is the screensaver settings.\n    One more common UI element that passed the test of time is the folder properties screen.\n  And there are so many more UI elements that haven’t been touched since Windows 95. Is this a case of timeless design? I’ll let you judge for yourself.\n  Well, this is not really a “UI layer”, as I haven’t been able to find any interface elements predating Windows 95 (although I have a feeling that there certainly are). However, there is a peculiar file in Windows 10, called moricons.dll, which contains a lot of old icons from the DOS days. Take a look:\n  Well, that’s pretty much it. As you may know, Microsoft is planning on overhauling the UI of Windows with their “Sun Valley” update, which aims to unify the design of the OS. However, as we can see, Windows is one behemoth of an operating system. Will their efforts to finally make a cohesive user experience succeed? Only time will tell.", "posttime": "2021-06-19 10:29:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,windows-10", "title": "Windows的状态：Windows 10中有多少层UI不一致？ ", "title_en": "State of the Windows: How many layers of UI inconsistencies are in Windows 10?", "transed": 1, "url": "https://ntdotdev.wordpress.com/2021/02/06/state-of-the-windows-how-many-layers-of-ui-inconsistencies-are-in-windows-10/", "via": "", "real_tags": ["windows"]}, {"category": "", "categoryclass": "", "imagename": "2d67af6fb3029d7f520acad2bdc74379.jpeg", "infoid": 1066820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当与17世纪的议案法则发布时，ISAAC牛顿首先意识到它确实可以将物体从地球送出到太空中。只要物体被射击到足够高的速度，它就会达到空间和轨道我们的星球。\n 随着1957年的烟囱卫星发射了一个强大的火箭，苏联确切地实现了这一点。在地球上有40亿年的生命中第一次，有意地送到空间。\n  通过在更强大的火箭或在板上使用推进器来推出卫星另一种速度提升，可以完全逃离地球的重力。这就是如何将任务发送给金星，火星，土星及以后。但这两者中的一个不像另一件事。\n  火箭方程是允许科学家和工程师量化和比较在太空中达到各种目的地所需的能量。它的含义是深远的，但不直观，所以我将尝试在不使用任何数学的情况下解释它们。\n  火箭方程告诉我们，火箭的能量量必须花费从地球表面到上方的轨道250公里，称为低地轨道，几乎是三个从那个低地轨道到月球的轨道！同样，从达到相同的轨道到达火星的需要两倍的低地球轨道成本。 1\n 即使我们包括降落在月球上的能量支出而不是从低地球轨道到达它，即使到地球轨道本身就会变得约50％。换句话说，达到地球轨道是空间探索的第一和最重要的障碍。\n  人类的巨大飞跃没有踩到月球，而是进入地球轨道。 \n火箭方程并不决定您在空间中达到各种目的地的能量，但如果您完全达到空间。\n  卫星是抬起它的火箭总质量的一小部分，但对火箭本身有影响。其中在于火箭科学的核心问题。\n 增加卫星的质量，使其更具用量，也意味着需要更多的火箭燃料将卫星放入所需的轨道中。但更多的燃料使系统重量更多。这意味着需要更多的燃料来将现在较重的系统发射到太空中。作为拇指规则，燃料需求随着卫星添加到卫星的每一步增加而呈指数级增长。\n 这就是我们如何结束火箭大多是燃料，然后是一些金属。即使是发给月球的宇航员的强大土星v也是85％的燃料，13％火箭 - 包括火箭身体，它的管道和零件 - 其余2％是与宇航员坐在里面的月干宇宙飞船！\n  此时，如果我们要使地球更加巨大，火箭必须降低巨大的能量，以防止更加严重的重力。达到空间需要更多的燃料，并且您的火箭可能比金属更多的燃料更多的东西。进一步增加地球质量，燃料质量比率将开始暴涨至根本不可能为这种近全燃料火箭工程！\n 以这种方式扼杀这些数字，事实证明，如果地球更大50％，即使在化学火箭中最有能量的燃料组合液氢和液氧氧气也无法进入空间。\n 这种巨大的岩石行星不是虚构的，其中几种存在。在其他4,000多个星球上，我们在我们的银河系中发现了约会，大约一千人是科学家称之为“超级地球”。这些是行星，比地球更大10倍，高达两倍多。超出该极限，行星并不岩石，开始转向天王星或海王星的天然气巨头。 \n许多这些超级地球躺在恒星周围的各自可居住的区域中，即就可以在我们所知的情况下支持生活。鉴于我们只搜查了一小部分我们的星系对行星，它可以说有数百万的超地球，其中许多可能会举办生活。\n 如果在这些超地球上发展智能生活，他们会有一个艰难的时间建筑火箭，从星球上获取。由于即使是最精力充沛的化学火箭也不会让它们到空间，因此他们可以被激励，以建立更多的推力，可以像核推进的火箭一样。这些可能比化学火箭更贵，但有时性质不会给你一个选择。\n  就像火箭方程一样，令人指重更加艰难地下降到行星中的肿块的行星，它也使得它更容易以更小的重力下降物体。现在，如果只有我们的物体比地球更少于地球，那么可访问和资源。\n  为了让人类生存和茁壮成长，在火星上具有永久性的人类住区是有意义的，因为它为我们提供了相对良性的环境。这样做需要通过几十到数百个巨大的火箭发射来向火山地面送达数百到数千吨材料。这几乎恰好是太空的星舰希望能做什么。这是我们的天体邻居，月亮，可以更好地让事情变得更好。\n 月亮的重力比地球更弱，允许火箭轻松起飞。这在阿波罗任务期间，这是最值得注意的，甚至托管两艘宇航员的航天器也可以进入月球轨道。而且，月亮位于地球的外缘井井，这意味着如果从月球发射，那么很容易逃脱我们的星球的拉力。事实上差不多五倍。\n 如果我们首先在月球上建立了巨大的永久定居点，我们最终可以利用其资源来从月球自身发射火箭。美国宇航局和伊斯罗士机构任务已经发现了月球杆上的大量水冰。未来的人类栖息地可能由富含金属富含金属的月球土地挖掘到这款水冰中，以供消费需求。该水也可以将其分成氢气和氧气以用作火箭燃料。从工业支持的Moonbase起飞的火箭可以乘坐月球行星际公路，比来自地球更有效地达到火星。\n  当然，建造一个工业夜间比赛将是昂贵的，但如果目标是可持续地扩展到太阳系中，我们正在播放比例数十到数千年。在这个大型的事情方案中，月球可以是火箭平台来建立和扩展可持续火星的存在，以便比从地球完成的等同物更便宜。 \n月亮的可访问性，低重力障碍和资源潜力是其支持者首先返回月亮的支持者而不是瞄准火星的原因。作为月球内的俗话：\n     月亮的优势可能延伸到在外太阳系统中为自己制作家园。火箭方程告诉我们，即使太阳系的外部到达的物体可能比月亮更靠近火星，即使是月亮更靠近火星，也越大的红色行星更深的重力也意味着需要更多的能量来摆脱它而不是到达那些目的地那里。\n 从月球表面到达小行星带至少40％的能量要求火箭的表面比火星表面 - 即使火星约7500万公里靠近皮带！这是差异重心使，火箭方程允许我们看到。月亮可以加速扩大我们对这些资源丰富的小行星的定居点。其中一些物体，如Ceres和Vesta，又可以与月球和小行星带的月球和小行星带来相同的角色，并扩大木星和土星的卫星的人类住区。\n  这最终为我们带来了来自火箭方程的单一重要的外卖。从低重力提取和利用原材料的能力将使我们摆脱拖延地球的引力拉动的暴政。\n 如果我们甚至没有以独立的方式扩展到太阳系，我们无法在星星中旅行，并为自己提供更大的资源池。空间内制造和工业化不仅仅是一种良好的，而且是扩展到太阳系的基本要求。只有当时人类将处于足够的职位上冒险到最近的明星，希望在太阳不发光之前做到这一点。\n   这篇文章感谢Gordon Roesler博士和Justin Alva在Patreon支持我。\n   就像你读过的？我所有的文章都是免费的，没有广告。支持我让我继续前进。 \n1从技术上讲，能源支出与Delta-V不同，这是火箭达到不同目的地所需的实际工作的实际衡量标准。 但由于能量支出与Delta-V成正比，因此它们被近似是相同的，以使物品变形为群众。 ", "note_en": "When dabbling with the laws of motion in the 17th century, Isaac Newton first realized that it’s indeed possible to send an object out of Earth, into space. As long as an object is shot away from Earth with a high enough velocity, it  will reach space and orbit our planet.\n With the launch of the Sputnik satellite in 1957 onboard a powerful rocket, the Soviet Union achieved exactly that. For the first time in four billion years of life on Earth, something was intentionally sent to space.\n  Give a satellite another speed boost, by either launching it on a more powerful rocket or using thrusters onboard, and it can escape from Earth’s gravitational hold completely. That’s how you can send missions to  Venus,  Mars,  Saturn and beyond. But one of these two things is not like the other.\n  The rocket equation is what allows scientists and engineers to quantify and compare the energy required to reach various destinations in space. Its implications are far-reaching but not intuitive so I shall attempt to explain them without use of any math.\n  The rocket equation tells us that the amount of energy a rocket must expend to go from the Earth’s surface to an orbit 250 kilometers above, called low Earth orbit, is almost thrice as much as going from that low Earth orbit to the Moon! Likewise, getting to low Earth orbit costs twice as much energy than what is required to reach Mars from that same orbit. 1\n Even if we include the energy expenditure to land on the Moon instead of just reaching it from low Earth orbit, getting to Earth orbit itself turns out to be about 50% more expensive. In other words, attaining Earth orbit is the first and the most significant barrier to space exploration.\n  The giant leap for humanity was not stepping on the Moon but getting to Earth orbit.\n The rocket equation doesn’t just dictate how much energy you must spend to reach various destinations in space but also if you can reach space at all.\n  The satellite is but a small fraction of the total mass of the rocket that lifts it and yet has an effect on the rocket itself. Therein lies the core problem of rocket science.\n Increasing the satellite’s mass, to make it more useful perhaps, also means more rocket fuel is required to put the satellite in the desired orbit. But more fuel makes the system weigh more. This means some more fuel is required to launch the now-heavier system into space. As a thumb rule, fuel requirements increase  exponentially with every step increase in mass added to the satellite.\n This is how we end up with rockets being mostly fuel and then some metal. Even the mighty Saturn V that sent astronauts to the Moon was 85% fuel, 13% rocket—including the rocket body, its plumbing and parts—and the rest 2% being the Moonbound spacecraft with astronauts sitting inside!\n  At this point, if we were to make Earth more massive, a rocket would have to expend an enormous amount of energy against a more gruesome gravity well. More fuel would be required to get to space, and your rocket might be something akin to 9 times more fuel than metal. Increase Earth’s mass further and the fuel-to-mass ratio would start  skyrocketing to a point where it’s simply not possible to engineer such a near-all-fuel rocket!\n Crunching the numbers in this manner, it turns out that if the Earth was 50% more massive, you simply wouldn’t be able to get to space even with the most energetic fuel combination—liquid hydrogen and liquid oxygen—available in chemical rockets.\n Such a massive rocky planet is not imaginary, several of its kind exist. Of the over 4,000 planets around other stars we’ve discovered to date in our galaxy, about a thousand are something scientists call ‘Super Earths’. These are planets which are up to 10 times more massive than Earth and up to twice as large. Beyond that limit, planets don’t remain rocky and start turning into  Uranus- or  Neptune-like gas giants.\n  Many of these Super Earths lie in the respective habitable zones around their stars i.e. conditions there could support life as we know it. Given that we’ve only searched a small fraction of our galaxy for planets, it’s fair to say there could be millions of Super Earths, many of which could host life.\n If intelligent life were to develop on these Super Earths, they’d have a hard time building rockets that get things off-planet. Since even the most energetic chemical rockets won’t get them to space, they’d be incentivized to build something with more thrust that can, like nuclear propulsion based rockets. These will likely be far more expensive than chemical rockets but sometimes nature doesn’t give you a choice.\n  Just like the rocket equation makes it exponentially harder to get off a planet with added mass to the planet, it also makes it exponentially easier to get off objects with lesser gravity. Now if only we had an object less massive than Earth that is accessible and resourceful.\n  In order for humanity to survive and thrive long term, it makes sense to have a permanent human settlement on Mars as it offers us a relatively benign environment. Doing so would require sending hundreds to thousands of tons of material from Earth to the martian surface via dozens to hundreds of huge rocket launches. That’s pretty much exactly what  SpaceX’s Starship hopes to do. Here’s where our celestial neighbor, the Moon, can make things better.\n The Moon has a much weaker gravity than Earth, allowing rockets to take off with ease. This was most notable during the Apollo missions, when even a spacecraft hosting two astronauts  could make its way to lunar orbit. Moreover, the Moon lies at the outer edge of Earth’s gravity well, meaning it’s easy to escape our planet’s pull completely if launched from the Moon. Almost five times easier in fact.\n If we establish a vast, permanent settlement on the Moon first, we can eventually tap into its resources to launch rockets from the Moon itself. NASA and ISRO missions have discovered  plenty of water ice on the Moon’s poles. It’s possible that future human habitats built from mining the metal-rich lunar soil tap into this water ice for consumption needs. This water can also be split into hydrogen and oxygen for use as rocket fuel. Rockets taking off from an industrially enabled Moonbase can ride the lunar interplanetary highway to reach Mars more efficiently than from Earth.\n  Sure, it would be expensive to build an industrial Moonbase but if the goal is to expand sustainably into the solar system, we’re playing the game on the scale of hundreds to thousands of years. In this large scheme of things, the Moon can be  the rocket platform to build and expand a sustainable Mars presence for much cheaper than an equivalent one done from Earth.\n The Moon’s accessibility, low gravity barrier, and resource potential are the reason why its proponents vouch for a sustainable return to the Moon first rather than targeting Mars. As the saying within the lunar circles goes:\n     The Moon’s advantages may extend to making homes for ourselves in the outer solar system as well. The rocket equation tells us that even if objects in the outer reaches of the solar system may be closer to Mars than the Moon, the more massive red planet’s deeper gravity well means more energy is required to get out of it than to reach those destinations from there.\n Getting to the asteroid belt from the Moon’s surface is at least 40% less energy demanding for a rocket than from Mars’ surface—even though Mars is about  75 million kilometers closer to the belt! This is the difference gravity makes, and which the rocket equation allows us to see. The Moon can accelerate expanding our settlements to these resource-rich asteroids. Some of these objects, like Ceres and Vesta, can in turn play the same role as the Moon can for Mars and the asteroid belt, and expand human settlements to moons of Jupiter and Saturn, and beyond.\n  This finally brings us to the single most important takeaway from the rocket equation. The ability to extract and harness raw materials from low-gravity, resourceful space objects would free us from the tyranny of dragging everything out of Earth’s gravitational pull.\n We cannot hope to be traveling among the stars if we don’t even expand into the solar system in an Earth-independent way and avail for ourselves a much larger resource pool. In-space manufacturing and industrialization is not just a good-to-have but a fundamental requirement for  expansion into the solar system. Only then humanity will be in an adequate position to venture to the nearest star and hopefully do it  before the Sun doesn’t shine.\n   This article was made possible thanks to  Dr. Gordon Roesler and  Justin Alva supporting me on Patreon.\n   Like what you read? All my articles are free, with no ads.  Support me to keep me going.\n  1 Technically, energy expenditure is not the same as delta-v, which is the actual measure of work required by rockets to reach different destinations. But since energy expenditure is proportional to delta-v, they have been approximated to be the same to make the article tangible for the masses.", "posttime": "2021-06-19 10:28:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,数学,rocket", "title": "没有数学的火箭方程的含义 ", "title_en": "Implications of the rocket equation without the math", "transed": 1, "url": "https://blog.jatan.space/p/the-moon-as-a-rocket-platform", "via": "", "real_tags": ["火箭", "数学", "rocket"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载PDF摘要：在公共场所使用视频监控 - 私人公民的政府Agenciesand  - 在核心方面吸引了相当大的关注，特别是在面部识别技术的快速进步。但是，难以系统地衡量相机的普遍存在，妨碍努力评估对隐私和公共安全的思路影响。在这里，我们提出了一种新颖的方法，用于监控摄像机的空间分布：将计算算法应用于大规模街道视图图像数据。具体而言，我们建立相机检测模型，并将其应用于160万个街道视图图像，从而为世界各地的6个大型美国城市和6个其他主要城市进行采样，用人类专家验证的呈现模型检测。在调整我们模型的次数回忆之后，并考虑我们采样的图像的空间覆盖范围，我们能够估计从道路的监视摄像机的密度。在我们考虑的16个城市中，监控摄像机的估计数为0.1（西雅图）至0.9（首尔）。在对10美国城市的详细分析中，我们发现该分子集中在商业，工业和混合区，以及不合适的非白居民股票的Inneighbors  - 即使在调整土地使用后也是据说据点。这些结果有助于通知持续使用监控技术的讨论，包括其对颜色社区的潜在的影响。 ", "note_en": "Download PDF  Abstract: The use of video surveillance in public spaces -- both by government agenciesand by private citizens -- has attracted considerable attention in recentyears, particularly in light of rapid advances in face-recognition technology.But it has been difficult to systematically measure the prevalence andplacement of cameras, hampering efforts to assess the implications ofsurveillance on privacy and public safety. Here we present a novel approach forestimating the spatial distribution of surveillance cameras: applying computervision algorithms to large-scale street view image data. Specifically, we builda camera detection model and apply it to 1.6 million street view images sampledfrom 10 large U.S. cities and 6 other major cities around the world, withpositive model detections verified by human experts. After adjusting for theestimated recall of our model, and accounting for the spatial coverage of oursampled images, we are able to estimate the density of surveillance camerasvisible from the road. Across the 16 cities we consider, the estimated numberof surveillance cameras per linear kilometer ranges from 0.1 (in Seattle) to0.9 (in Seoul). In a detailed analysis of the 10 U.S. cities, we find thatcameras are concentrated in commercial, industrial, and mixed zones, and inneighborhoods with higher shares of non-white residents -- a pattern thatpersists even after adjusting for land use. These results help inform ongoingdiscussions on the use of surveillance technology, including its potentialdisparate impacts on communities of color.", "posttime": "2021-06-19 10:28:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "街道,prevalence,监控", "title": "估算街道视图数据的监控摄像机的普遍存在 ", "title_en": "Estimating the Prevalence of Surveillance Cameras with Street View Data", "transed": 1, "url": "https://arxiv.org/abs/2105.01764", "via": "", "real_tags": ["街道", "监控"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "解释查询计划输出的改进使其更容易理解。令牌开始时的字节顺序标记被跳过，就好像它们是空白一样。在任何尝试访问视图或子查询的任何尝试时都会引发错误。以前，视图的ROWID将是不确定的并且通常是空的。 -dsqlite_allow_rowid_in_view编译时选项可用于恢复需要它的应用程序的遗留行为。默认情况下，现在启用了SQLite3_Deserialize（）和SQLite3_Serialize（）接口。不再需要-dsqlite_enable_deserialize编译时选项。相反，存在新的-dsqlite_omit_deserialize编译时选项以省略这些接口。 ＆＃34; memdb＆＃34;只要数据库名称以＆“/＆”/＆＃34; /＆＃34; /＆＃34; /＆＃34; /＆＃34; /＆＃34; /＆＃34;返回存在于存在的优化（SQLite 3.35.0中的第8B项，更改日志），因为它发现比速度更慢地减慢查询。\n  单个页面中的SQLite版本的完整列表也可以使用。 SQLite版本控制站点提供每种办理登机手续的详细历史记录。 ", "note_en": "Improvement to the  EXPLAIN QUERY PLAN output to make it easier to understand. Byte-order marks at the start of a token are skipped as if they were whitespace. An error is raised on any attempt to access the  rowid of a VIEW or subquery. Formerly, the rowid of a VIEW would be indeterminate and often would be NULL. The -DSQLITE_ALLOW_ROWID_IN_VIEW compile-time option is available to restore the legacy behavior for applications that need it. The  sqlite3_deserialize() and  sqlite3_serialize() interfaces are now enabled by default. The -DSQLITE_ENABLE_DESERIALIZE compile-time option is no longer required. Instead, there is is a new  -DSQLITE_OMIT_DESERIALIZE compile-time option to omit those interfaces. The &#34;memdb&#34; VFS now allows the same in-memory database to be shared among multiple database connections in the same process as long as the database name begins with &#34;/&#34;. Back out the EXISTS-to-IN optimization (item 8b in the  SQLite 3.35.0 change log) as it was found to slow down queries more often than speed them up.\n  A  complete list of SQLite releases in a single page and a  chronology are both also available. A detailed history of every check-in is available at   SQLite version control site.", "posttime": "2021-06-19 10:27:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,查询", "title": "sqlite 3.36.0 changelog. ", "title_en": "SQLite 3.36.0 Changelog", "transed": 1, "url": "https://www.sqlite.org/releaselog/3_36_0.html", "via": "", "real_tags": ["sqlite", "查询"]}, {"category": "", "categoryclass": "", "imagename": "da88fe932c0e564903484f91c6069be3.jpg", "infoid": 1066816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚借款将失业救济金的借贷将在明年年底前增加到267亿美元，因为国家资金证明涵盖了Covid-19大流行造成的前所未有的失业费用，这是一个新的报告警告。\n 州官员表示，即使经济反弹，失业率仍然很高，债务预计将超过243亿美元估计，州官员表示。\n 商业领袖周五表示，由于联邦失业信托基金的借贷被高等工资税，国家官员必须利用预计预算盈余，以减少已经努力从去年经济停工中恢复的雇主的金融袭击。\n “如果他们不做任何事情，企业将最终必须在经济复苏的关键时刻支付该税款，”加州商业圆桌会议总裁Rob Lapsley说。 “如果有些[企业]在财政悬崖的边缘缠绕，它可能会在边缘越过边缘，而且他们就业。”\n  加利福尼亚州从2020年3月开始的Covid-19 Pandemer开始以来，加利福尼亚州的失业索赔，州，该州已支付了1500亿美元的福利。\n 该报告于本周发布本周的国家就业开发部门，为失业系统未解决的问题弥补了GOV.Gavin Newsom和立法者的新挑战。\n 雇主代表每位雇员在工资单中向失业保险基金支付联邦和州税款。当基金运行低时，各国可以从联邦政府扣除援助，以确保可以继续支付常规债务付款。 \n但是，从联邦政府借来的资金通过每年逐渐上升的工资税增加，在10年后达到超过3％，直到债务偿还。\n  EDD债务预测报告指出，雇主捐款估计从今年48亿美元增加到明年的60亿美元。独立立法分析师的办公室估计，直到2031年可能无法支付总债务。\n 扩大债务已经谈到了国家领导人的争议，超过了应削减企业负担的大部分盈余。\n Newsom最近宣布，该州预计税收意外收获额为760亿美元，除了270亿美元，国家将从联邦美国救援计划中获得。\n   “它展示了我们必须在这笔款项上获得跳跃开始的承诺，”新闻组织上个月表示，当他揭开他的预算提案时。 “该国的每个州都会在许多人的过程中挣扎，许多年来偿还那个债务，正如我们在最后一次经济衰退，巨大的经济衰退所做的时候，所花了很多年。”\n 在十年前的经济衰退期间，加利福尼亚州从联邦信托基金借了107亿美元，以支付失业救济金;从2011年到2018年宣布了债务。\n 这一次，加利福尼亚州是19个州之一，必须从联邦信托基金借用530亿美元，以便在大流行期间涵盖失业救济金。其他贷款的国家包括马萨诸塞州，伊利诺伊州，纽约和德克萨斯州，但加州借来的最多借入了总数的40％以上。 \n加州商会执行副总裁Jennifer Barrera介绍，总督提出的11亿美元是“朝着正确的方向走向”。\n  “然而，为了保护小型企业和其他雇主因税收增加的风险和更经济的不确定性而受到大流行的风险，国家需要更积极地在尽快偿还整个债务，”巴雷拉说。\n 作为Newsom计划的替代方案，立法机关拟议了20亿美元的薪水税收税给小雇主，超过10年。双方仍在谈判提案，达普兰派提议成立工作组以解决问题。他说，即使是每年2亿美元的立法提案也不足以防止业务的繁琐税，并将突破服务和酒店行业。\n 国家对失业制度债务的回应被一些立法者称为不足。\n “如果没有以明显和实质的方式解决，它将导致我们已经努力的小企业支付的更高税收，”大会预算委员会副主席副主席Vince Fong（R-Bakersfield）表示。\n  一些立法者指出，EDD官员表示，该机构已经确定了至少110亿美元的欺诈性索赔所带来的福利。虽然在联邦计划中的索赔中发生绝大多数欺诈，但一些欺诈付款是国家的负债。\n “由于我们的国家政府不管理，而不是我们当地的小企业，”这是我们当地的小企业的管理，“这是关于预算的一层争论的同事。 “缺乏行动只会导致艰苦的加利福尼亚人将来要承受的更高的税收负担。” \n10月，EDD思想加州的贷款余额今年可能达到480亿美元，但在一些官员引用包括许多雇主向遥远的雇员转向遥控器的因素后，估计率下调。  “底线是，在未来10年内，令人骚动的加州企业估计估计为267亿美元的税收增加或更多，将使资源转移远离他们在大流行停机期间持续的损失的能力，并将妨碍加州的整体经济 恢复，“巴雷拉说。 ", "note_en": "California’s borrowing to pay unemployment benefits will balloon to $26.7 billion by the end of next year as state funds prove inadequate to cover the costs of unprecedented joblessness caused by the COVID-19 pandemic, a new report warns.\n Even as the economy is rebounding, unemployment remains high, and the debt is forecast to grow beyond the $24.3 billion estimated for the end of this year, state officials said.\n Business leaders said Friday that as borrowing from the federal unemployment trust fund is paid back by higher payroll taxes, state officials must tap more of a projected budget surplus to lessen the financial hit on employers already struggling to recover from the economic shutdown of the last year.\n “If they don’t do anything more, businesses are going to end up having to pay that tax at a critical time of our economic recovery,” said Rob Lapsley, president of the California Business Roundtable. “If some [businesses] are teetering on the edge of a fiscal cliff, it could drive them right over the edge, and they go out of business.”\n  California has processed a record 22.5 million unemployment claims since the COVID-19 pandemic began in March 2020, and the state has paid $150 billion in benefits.\n The report, released this week by the state Employment Development Department, poses a new challenge for Gov. Gavin Newsom and legislators after months of unresolved problems with the unemployment system.\n Employers pay federal and state taxes into unemployment insurance funds on behalf of each employee on their payroll. When the fund runs low, states can tap into assistance from the federal government to ensure that regular benefit payments can continue to be paid.\n But  money borrowed from the federal government is paid back through an increase in the payroll tax that gradually rises each year, hitting more than 3% after 10 years, until the debt is repaid.\n  The EDD debt forecast report noted that employer contributions are estimated to increase from $4.8 billion this year to $6 billion next year. The independent Legislative Analyst’s Office estimates that the total debt may not be paid off until 2031.\n The expanding debt has touched off a dispute among state leaders over how much of the surplus should be put toward reducing the burden on businesses.\n Newsom recently announced that the state is projected to have a tax windfall of $76 billion, in addition to $27 billion the state will receive from the federal American Rescue Plan.\n   “It shows the commitment we have to get a jump-start on that payment,” Newsom said last month, when he unveiled his budget proposal. “Every state in the country will struggle over the course of many, many years to pay back that debt, as we did in the last recession, the Great Recession, when it took a number of years.”\n During the recession of a decade ago, California borrowed $10.7 billion from the federal trust fund to pay unemployment benefits; it took the state from 2011 to 2018 to repay the debt.\n This time, California is one of 19 states that have had to borrow a combined $53 billion from the federal trust fund to cover unemployment benefits during the pandemic. Other states that took loans include Massachusetts, Illinois, New York and Texas, but California has borrowed the most by far — more than 40% of the total.\n The $1.1 billion proposed by the governor is “a step in the right direction,” according to Jennifer Barrera, executive vice president of the California Chamber of Commerce.\n  “However, in order to protect small businesses and other employers devastated by the pandemic from the risk of increased taxes and more economic uncertainty, the state needs to be far more aggressive in paying off the entire debt as soon as possible,” Barrera said.\n As an alternative to Newsom’s plan, the Legislature has proposed $2 billion in payroll tax credits to small employers, spread over 10 years. The two sides are still negotiating on the proposals, and Lapsley has proposed that a working group be formed to resolve the issue. He said even the legislative proposal of $200 million a year is not enough to prevent burdensome tax increases on businesses, and would hit the service and hospitality industries especially hard.\n The state’s response to the unemployment system debt has been called inadequate by some lawmakers.\n “If it is not addressed in a significantly and substantial way, it will lead to higher taxes paid for and by our already struggling small businesses,” said Assemblyman Vince Fong (R-Bakersfield), vice chairman of the Assembly Budget Committee.\n  Some legislators noted that EDD officials said the agency has identified at least $11 billion in benefits paid on fraudulent claims. While the vast majority of fraud occurred on claims in a federal program, some of the fraud payments are liabilities of the state.\n “This debt was incurred because of the mismanagement of our state government, not by our local small businesses,” Fong told colleagues during Monday’s floor debate on the budget. “The lack of action will only lead to a higher tax burden that hardworking Californians will have to bear in the future.”\n In October, the EDD thought California’s loan balance might hit $48 billion this year, but the estimate was revised downward after some officials cited factors that include many employers transitioning large numbers of employees to remote working.\n   “The bottom line is that saddling California businesses with what is estimated to amount to a $26.7-billion tax increase or more over the next 10 years will divert resources away from their ability to regain losses sustained during the pandemic shutdowns and will hamper California’s overall economic recovery,” said Barrera.", "posttime": "2021-06-19 10:27:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "失业,unemployment", "title": "加州的失业债务随着企业提出帮助而增长 ", "title_en": "California’s unemployment debt grows as businesses ask Newsom for help", "transed": 1, "url": "https://www.latimes.com/california/story/2021-06-18/california-unemployment-debt-grows-businesses-ask-newsom-for-help", "via": "", "real_tags": ["失业"]}]