[{"category": "", "categoryclass": "", "imagename": "afda1654d52346d3ea72c0f60bea3876.png", "infoid": 1069722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "刚开始时，CSS 可能很难掌握。这看起来像是魔法，你很容易发现自己在玩鼹鼠游戏，调整一个属性只是为了让其他东西坏掉。这是令人沮丧的，这是我很长一段时间的经历，然后事情突然似乎“咔嗒”一声。回想这段时间，我认为有一些关键概念对事物最终变得有意义并融合在一起至关重要。它们是： 在构建可重用和可组合的组件时，还需要记住一些有用的概念。我认为构建可视化 UI 组件的一个关键方法是，基本上所有内容都可以分解为页面上的一堆矩形。一次考虑页面的所有方面可能会让人不知所措，因此在精神上将事情分解为一系列矩形组件，并忽略与您当时正在处理的部分无关的所有内容。当你考虑一个元素的大小（即它的高度和宽度）时，有两种不同的模型来衡量它，你可以用 box-sizing 属性调整它。元素的大小仅包括其内容，而不包括其内边距或边框。元素的大小包括其内边距和边框。当您使用 content-box 设置 width: 100% 时，内容将是父元素宽度的 100%，但任何边框和填充都会使元素更宽。\nborder-box 更有意义，我发现它更容易推理。要将 border-box 应用于页面上的所有元素，请确保您的样式表中有类似此代码段的内容（无论如何，很多 CSS 重置都会包含此内容）：展望未来，我将只考虑使用 border-box，因为它是我们在 Kablamo 首选的盒子模型。边距值有时会与相邻元素的边距一起折叠，取它们之间的最大边距，而不是两者的组合。围绕这个的规则可能有些复杂，MDN 有一个文档描述它们： Mastering margin collapsing 元素通常按照它们在标记中出现的顺序排列在文档中。 display 属性控制元素和/或其子元素的布局方式。您可以在 MDN 上阅读有关显示的更多详细信息。 display: inline 允许内容像文本一样流动并适合其他内嵌内容，有点像俄罗斯方块 display: block 意味着元素有效地表现得像一个包含其所有子元素的矩形，该矩形包含其所有子元素，其高度增长以适应内容（宽度是默认情况下 100% 的父内容框）。实际上，在元素前后插入换行符。 display: inline-block 就像是 inline 和 block 的混合体。它的内容将包含在一个矩形内，但该矩形可以作为内联内容的一部分进行布局。\ndisplay: flex 和 display: grid 是更高级的布局算法，用于根据某些规则排列子项。这些是构建灵活、响应式布局的基础，值得深入学习。在 Flexbox Froggy 和 Grid Garden 中学习这些已经被游戏化了。 position 属性结合定位属性（顶部、左侧、右侧、底部、插入）影响元素相对于文档流的定位方式。元素默认为position:static，表示定位属性对元素的位置没有影响，元素正常布局。静态定位的元素也没有自己的堆叠上下文，这意味着设置 z-index 也将不起作用。 position: relative 类似于 position static，除了 top、left 和其他定位属性的作用类似于元素应该在视觉上布局的位置的偏移量（尽管兄弟元素和祖先元素的行为好像它仍然在原始位置）。 position: absolute 将元素从文档流中取出，祖先/兄弟姐妹将被布局，就好像该元素不存在一样。定位属性指定元素相对于最近的非静态父元素应该在视觉上布局的位置的偏移量。您可以添加 position: relative 以将其用作具有 position: absolute 的元素的锚点。 position: fixed 与定位属性一起意味着元素从文档的正常流中移除，而是相对于视口进行布局。如果指定了定位属性，它们将确保元素始终以与视口的偏移量进行布局（即它们看起来固定在适当的位置并且不会移动，即使在滚动时）。位置：粘性有点复杂，但您可以将其视为位置：相对和位置：固定的混合体。您可以在 MDN 上阅读有关确切机制的更多信息。\n理想情况下，可重用和可组合组件的视觉方面应该是独立的。外边距通常是一个坏主意。外边框的边距折叠意味着组件布局的推理更复杂，有效边界与视觉边界（例如边框）不同。这可能意味着组件的行为不太可预测，您不能再将它们视为一个矩形。本质上，您想让您的组件易于包含在应用程序中，而不必担心它们是否会超出其简单的矩形。总的来说，我认为这些是大部分指导原则，我希望我能比实际更早地理解这些原则。我花了很多时间摸索，来回调整 CSS，并没有真正理解为什么事情没有按预期运行。", "note_en": "CSS can be hard to grasp when you&#39;re starting out. It can seem like magic wizardry and you can very easily find yourself playing whack-a-mole adjusting one property only to have something else break. It is frustrating, and that was my experience for quite a long time before things suddenly seemed to &#34;click&#34;.\n Reflecting back on this time, I think there are a few key concepts that were vital to things finally all making sense and fitting together. These were:\n  There are also some useful concepts to keep in mind when building reusable and composable components.\n  A key way I think about building visual UI components is that basically everything can be broken down into a bunch of rectangles on a page. It can be overwhelming to consider all aspects of a page at once, so break things down mentally into a series of rectangular components and ignore everything that doesn&#39;t matter for the piece that you&#39;re working on at that point.\n   When you consider the size of an element (i.e. its  height and  width), there are two different models by which to measure this and you can adjust this with the   box-sizing property.\n  The size of an element only includes its content, and not its  padding or  border.\n  The size of an element is inclusive of its  padding and  border. When you set  width: 100% with  content-box, the content will be 100% of the width of the parent element, but any borders and padding will make the element even wider.\n border-box makes a lot more sense, and I find it much easier to reason about. To apply  border-box to all elements on the page, make sure you have something like this snippet in your stylesheet (a lot of CSS resets will include this anyway):\n  Going forward, I&#39;m only going to be considering  border-box, as it&#39;s our preferred box model at  Kablamo.\n margin values sometimes collapse with an adjacent element&#39;s  margin, taking the maximum of the margins between them rather than the combination of both. The rules around this can be somewhat complex, and  MDN has a document describing them:  Mastering margin collapsing\n  Elements are usually laid out in the document in the order that they appear in the markup. The  display property controls how an element and/or its children are laid out. You can read about  display in more detail at   MDN.\n display: inline allows content to flow kind of like text and to fit with other inline content, sort of like tetris pieces\n display: block means the element effectively behaves like a rectangle containing all of its children that grows in height to fit content ( width is 100% of the parent content box by default). Effectively, line breaks are inserted before and after the element.\n display: inline-block is like a mixture of both  inline and  block. Its contents will be contained within a rectangle, but that rectangle can be laid out as part of inline content.\n display: flex and  display: grid are more advanced layout algorithms for arranging children according to certain rules. These are the bread and butter of building flexible, responsive layouts and are well-worth learning about in more depth. Learning these has been gamified in  Flexbox Froggy and  Grid Garden.\n  The  position property affects how elements are positioned with respect to the flow of the document in combination with positioning properties ( top,  left,  right,  bottom,  inset).\n Elements are  position: static by default, which means that positioning properties have no effect on the position of the element and the element is laid out normally. Statically positioned elements also do not have their own  stacking context, which means that setting  z-index will also have no effect.\n position: relative is like position static, except that  top,  left, and other positioning properties act like an offset of where the element should be visually laid out (although sibling and ancestor elements will behave as though it is still in the original position).\n position: absolute takes the element out of the flow of the document and ancestors/siblings will be laid out as if the element were not present. Positioning properties specify offsets of where the element should be visually laid out relative to the nearest non- static parent. You can add  position: relative to an ancestor to use it as the anchor point for an element with  position: absolute.\n position: fixed along with positioning properties means that the element is removed from the normal flow of the document and instead laid out relative to the viewport. If positioning properties are specified, they will ensure the element is laid out always with that offset to the viewport (i.e. they appear fixed in place and don’t move, even when scrolling).\n position: sticky is a bit more complex, but you can think about it as a hybrid of  position: relative and  position: fixed. You can read more about the exact mechanism at   MDN.\n  The visual aspect of reusable and composable components should ideally be self-contained. Outer margins are generally a bad idea. Margin collapse on outer borders means component layout is more complicated to reason about and the effective boundary is not the same as the visual boundary (such as a border). This can mean that components behave less predictably and you can no longer think of them as just a rectangle.\n Essentially, you want to make your components easy to just include in an application without worrying if they break outside of their simple rectangle.\n  Overall, I think these are most of the guiding principles that I wish I understood a lot sooner than I actually did. I spent a lot of time fumbling around, tweaking CSS back and forth, and not really understanding why things weren&#39;t behaving as expected.", "posttime": "2021-07-26 05:06:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "有所,css,元素", "title": "我希望从前端开始时我对 CSS 有所了解", "title_en": "What I Wish I Knew About CSS When Starting Out as a Front Ender", "transed": 1, "url": "https://engineering.kablamo.com.au/posts/2021/my-first-css", "via": "", "real_tags": ["有所", "css", "元素"]}, {"category": "", "categoryclass": "", "imagename": "57703d8d74ebcf9d1871ab14655b3a34.png", "infoid": 1069721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "诗歌在运动。 Haiku 项目及其开发人员和团队成员宣布，Haiku 操作系统于 2021 年 7 月 25 日发布了第三个 beta 版本，版本 R1/Beta3。版本 R1B3 延续了更频繁发布的趋势，为用户和开发人员提供了一个最新且稳定的平台工作。此版本结合了 Haiku 作为 BeOS 精神继承者的最佳历史和充满激情的社区的辛勤工作。它提供了几个使 Haiku 变得更好的新功能和性能改进。 Beta 3 包括系统和捆绑应用程序的新捷克语翻译。有了这个添加，俳句现在有 28 种不同的语言。 Haiku 项目感谢那些付出时间确保 Haiku 支持多种语言的人，以便操作系统可以在世界各地使用。由 Haiku 团队 WebPositive 开发的捆绑式 Web 浏览器的后端 WebKit 获得了多项重大改进。这为 WebPositive 的进一步改进以及改进的浏览和网站渲染体验提供了良好的基础，开发人员将继续关注下一个版本 Beta 4 和 asHaiku 接近其第一个初始版本 R1。更好的安装过程，对磁盘分区程序 (DriveSetupGUI) 进行了各种修复，使安装过程更轻松、更顺畅。各种软件的新端口和更新端口，包括弃用 Python 2 和使 Python 3 成为安装的默认版本 所有这些改进都已为社区和社区实施，以便最终用户更好地控制他们每天使用的设备.\n当然，这一切都离不开世界各地捐助者的慷慨捐助，也离不开一个充满热情和勤奋的社区。俳句项目感谢那些付出时间或捐款的人。 Haiku 可以随时使用开发人员和志愿者，为任何有兴趣的人提供大量机会，让他们留下自己的印记，让计算世界变得更美好。 Haiku 是用于个人计算的免费开源操作系统 - 下载以 ISO 文件形式提供，该文件可以刻录到物理介质上，然后安装到物理硬件上，或在虚拟机中使用。请注意，此版本的新闻资料袋中包含屏幕截图、徽标和其他资源，以便在出版物中使用。 Haiku 是一个受 BeOS 启发并在 MIT 许可下许可的免费开源操作系统。 Haiku 专门针对个人计算，是一个快速、高效、简单易用、易学且功能强大的系统，适用于各个级别的计算机用户，可以从官方项目网站免费下载 ISO 文件。由热情友好的志愿者社区（统称为“Haiku 项目”）维护，Haiku 欢迎所有志愿者和贡献者，无论他们的技能水平或背景如何。有关更多信息，请访问 https://haiku-os.org Haiku Inc.一个 501(c)(3) 非营利组织（在美国注册），致力于支持俳句项目和俳句的发展。 Haiku Inc. 持有 Haiku 的商标注册，代表 Haiku 项目募集捐款并管理财务。过去，收集的捐款用于资助有偿开发合同和 Haiku Code Drive——一个类似于谷歌代码之夏的计划。欲了解更多信息，请访问 https://haiku-inc.org", "note_en": "Poetry is in motion. The Haiku Project, its developers and team members announced theHaiku operating system released its third beta release, version R1/Beta3, July 25th, 2021.Version R1B3 continues the trend of more frequent releases to provide users anddevelopers with an up to date and stable platform to work on.\n This release combines the best of Haiku’s history as a spiritual successor of BeOS and thehard work of a passionate community. It provides several new features and performanceimprovements that make Haiku even better.\n Beta 3 includes the new Czech translation for the system and bundled applications. With thisaddition, Haiku is now available in 28 different languages. The Haiku Project is thankful tothose who have given their time to ensure Haiku is available in a wide variety of languagesso the operating system can be used all over the world.\n WebKit, the backend of the bundled web browser developed by the Haiku team,WebPositive, received multiple major improvements. This provides a good base for furtherimprovements as well as an improved browsing and website rendering experience inWebPositive, which developers will continue to focus on for the next release, Beta 4 and asHaiku nears its first initial release, R1.\n  A better installation process, with various fixes to the disk partitioner (DriveSetupGUI) to make the process easier and go more smoothly.\n    New and updated ports of various software, including deprecating Python 2 andmaking Python 3 the default version installed\n All of these improvements have been implemented for the community and by the community,to provide greater control to the end-user over the devices they use every day.\n  Of course, all this would not be possible without the generous donations from donors all overthe world, as well as a passionate and hardworking community. The Haiku Project thanksthose who have contributed with their time or with their donations.\n Haiku could always use developers and volunteers, with plenty of opportunities for anyoneinterested to make their mark and the computing world a better place.\n Haiku is a free and open-source operating system for personal computing - the download isprovided as an ISO file which can be burned to physical media to be installed onto physicalhardware, or used in a virtual machine.\n      Note that screenshots, logos and other resources are included in the press kit for thisrelease for use in publications.\n  Haiku is a free and open-source operating system inspired by BeOS and licensed under theMIT license. Specifically targeting personal computing, Haiku is a fast, efficient, simple touse, easy to learn, and yet very powerful system for computer users of all levels, and can bedownloaded freely from the official project website as an ISO file. Maintained by apassionate and friendly volunteer community (known collectively as the “Haiku Project”),Haiku welcomes all volunteers and contributors regardless of their skill level or background.For more information please visit  https://haiku-os.org\n  Haiku Inc. is a 501(c)(3) non-profit organization (registered in the United States) dedicated tosupporting the Haiku Project and the development of Haiku. Haiku Inc. holds the trademarkregistrations for Haiku, collects donations on behalf of and manages finances for the HaikuProject. In the past, donations collected have been used to fund paid development contractsand the Haiku Code Drive - a program similar to Google’s Summer of Code. For moreinformation, please visit  https://haiku-inc.org", "posttime": "2021-07-26 05:06:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,r1,haiku", "title": "Haiku R1/beta3 发布", "title_en": "Haiku R1/beta3 is released", "transed": 1, "url": "https://www.haiku-os.org/news/2021-07-26_media_release_the_haiku_project_celebrates_the_release_of_beta_3/", "via": "", "real_tags": ["发布", "r1", "haiku"]}, {"category": "", "categoryclass": "", "imagename": "71098a09c52054c5494ce71a3adf002c.png", "infoid": 1069720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前端客户端中的应用程序状态是一种复杂性，充其量是可以管理的，最糟糕的是您无法交付新功能的原因。在现代前端应用程序中，有很多方法可以处理应用程序状态。您可能熟悉 React 的 useState/useReducer 钩子、Redux 或许多其他状态管理库之一。但是，当您将该状态与业务逻辑配对时，有限状态机可能是一种更好的管理方式。有限状态机是计算的数学模型。它是一个抽象的“机器”，可以在任何给定时间处于有限数量的状态中的一个。机器可以响应某些已知输入从一种状态转换到另一种状态作为事件。您可以通过状态列表、初始状态和触发每个转换的事件来定义有限状态机。让我们举一个真实世界的化妆 (😝) 示例。您正在为您的应用程序构建一个配置文件页面。当用户第一次使用你的应用程序时，他们有一个空白的配置文件。当用户进入个人资料页面时，如果用户有个人资料，您希望个人资料页面显示该个人资料。如果他们没有个人资料，您希望为他们提供一种创建和保存个人资料的方法。如果他们确实有个人资料，您还希望为他们提供编辑和保存个人资料的方式。我们可以在流程图中定义它，而不是将命令式业务逻辑分散在代码中，从开发人员到利益相关者都可以看到和理解。\n配置文件加载状态 - 服务器响应配置文件请求时 线条和箭头显示了我们如何从状态转换到状态。有时我们直接转换，有时根据我们转换到一种或另一种状态的条件。现在我们知道所有状态以及如何在它们之间转换，我们可以继续使用 XState 创建我们的状态机。 XState 是最全面的 Javascript 有限状态机库之一，具有可视化等附加工具。我们将首先使用 createMachine 创建一个 XState 机器。我们将给它一个 id 和一个初始状态，我们将称其为正在加载，我们将为 profile 和 error 添加一个空值到您可以想到的上下文中类似于 React 的状态对象。我们也会列出所有可能的状态。我们将添加一个 invoke 属性，该属性指向在 createMachine 调用的第二个参数中定义的 fetchProfile 服务。这意味着当机器处于加载状态时，它会调用 fetchProfile 服务中定义的函数。这是一个 API 调用，它返回一个承诺和一些数据。我们已经在加载状态调用属性上定义了 onDone 和 onError 属性。这些在承诺解决或拒绝时被调用。\n如果我们得到一个成功的响应，我们就会触发 XState 的分配操作，用事件数据更新上下文，然后转到 profileLoaded 状态。接下来，让我们将名为 hasProfile 的保护添加到传递给 createMachine 对象的第二个参数中。如果配置文件存在，这将返回一个布尔值。我们还将设置 profileLoaded 状态以检查配置文件是否存在。如果是，则移至 showProfile 状态，如果不是，则移至 noProfile 状态。我们在这里使用“eventless” always 属性来根据守卫自动移动到下一个状态。我们在 noProfile 状态上添加了一个 CREATE_NEW_PROFILE 事件，当触发时，会将状态转换为 createdProfile 状态。我们还在创建配置文件状态上添加了事件来处理保存和取消创建的配置文件。最后，我们将根据我们从前面的步骤中了解到的信息填写其余的状态、转换和服务，最终得到这样的结果：\n由于布局的原因，我们的最终状态图可能看起来有点忙，但它与上面的原始流程图具有相同的步骤。此图表示通常定义不明确且分散在整个代码中的业务逻辑。使用 FSM 的优点是我们必须预先考虑这种状态，以便我们可以更好地理解和定义它。仅此一项就可以减少构建过程、维护和附加功能构建期间的错误和沟通不畅。现在要在 React 中使用它，我们只需添加 @xstate/react 包并导入 useMachine 钩子状态是一个具有值（当前机器状态）和上下文（具有我们的配置文件和错误的对象）的对象。状态对象上还有一个匹配函数，可用于匹配状态。我们可以通过发送函数向机器发送状态适当的事件。例如，当处于 showProfile 状态时，我们可以调用 send(&#39;EDIT_PROFILE&#39;) 并且状态将从 showProfile 转换为正在编辑的配置文件。\n当状态对象发生更改时，组件将重新渲染，允许您使用适当的 UI 代码响应这些状态更改。有限状态机是一种非常好的方式，可以迫使您预先考虑应用程序可能处于的状态，然后将这些状态编码到驱动您的用户体验的机器中。我们经常使用多个 useState 或 useReducer 钩子或全局状态管理解决方案来处理 React 中的这种复杂性。这种方法不需要替换它们，但它在您的工具箱中提供了一个有用的工具来控制您可能会遇到的一些更复杂的工作流时不时遇到。", "note_en": "Application state in front-end clients is a complexity that is at best managed, and at worst the reason you can&#39;t deliver new features.\n There are many ways to handle application state in modern front-end applications. You may be familiar with React&#39;s useState/useReducer hooks, Redux or one of the many other state management libraries.But, when you pair that state with business logic, a finite state machine can be a much better way to manage it.\n  A finite state machine is a mathematical model of computation.It is an abstract &#34;machine&#34; that can be in exactly one of a finite number of states at any given time.The machine can  transition from one state to another in response to some inputs known as  events.\n You define a finite state machine by a list of its  states, its initial state and the events that trigger each transition.\n    Let’s take a real-world made-up (😝) example. You’re building a profile page for your application.\n When users use your application for the first time, they have a blank profile. As the user enters the profile page, you want the profile page to display the profile if the user has one.If they don’t have a profile, you want to provide them with a way to create one and save it. If they do have a profile, you also want to offer them way to edit and save their profile.\n Instead of having that imperative business logic scattered around the code, we can define it in a flow chart that everyone from developers up to stakeholders can see and understand.\n   Profile Loaded state - When the server has responded from the request for a profile\n The lines and arrows show how we transition from state-to-state. Sometimes we transition directly, sometimes based on a condition we transition to one state or another.\n  Now that we know all the states and how to transition between them, we can go ahead and create our state machine using XState.\n XState is one of the most comprehensive Javascript finite state machine libraries with additional tooling like visualisations.\n  We&#39;ll start by creating an XState machine using  createMachine.We&#39;ll give it an  id and an initial state which we&#39;ll say is  loading, and we&#39;ll add a null value for  profile and  error to the context which you can think of as similar to React&#39;s  state objects.We&#39;ll also list out all of the possible states.\n     We&#39;ll add an  invoke property which points to a  fetchProfile service which is defined in the second parameter of the  createMachine call. This means that when the machine is in the  loading state, it will call the function defined in the  fetchProfile service. This is an API call which returns a promise and some data.\n We&#39;ve defined  onDone and  onError properties on the  loading state  invoke property. These are invoked when the promise resolves or rejects.\n If we get a successful response, we trigger XState&#39;s  assign action to update the context with the event data then move on to the  profileLoaded state.\n     Next, let&#39;s add a  guard called  hasProfile into the second param passed to the  createMachine object. This will return a boolean if the profile exists.\n We&#39;ll also set up the  profileLoaded state to check if the profile exists. If it does, move to the  showProfile state, and if it doesn&#39;t, move to the  noProfile state.\n We use the &#34;eventless&#34;  always property here to automatically move to the next state based on the guards.\n     We&#39;ve added a  CREATE_NEW_PROFILE event on the  noProfile state which when triggered, will transition the state to the  creatingProfile state.\n We&#39;ve also added events on the  creatingProfile state to handle saving and cancelling the created profile.\n     Finally, we&#39;ll fill out the rest of the states, transitions and services based on what we know from the previous steps to end up with this:\n  Our final state diagram might look a little busy due to the layout, but it has equivalent steps to our original flow chart above.\n This diagram represents the business logic that is often ill-defined and scattered throughout your code.The advantage of using a   FSM is that we have to think about this state upfront, so we can understand and define it better.\n That alone can reduce bugs and miscommunication during the build process, maintenance and additional feature building.\n   Now to use this in React, we simply add the  @xstate/react package and import the  useMachine hook\n  state is an object that has  value (the current machine state) and  context (the object with our  profile and  error).\n There is also a  matches function on the state object that can be used to match states.\n We can send state appropriate events to the machine via the  send function. For example, when in the  showProfile state, we can call  send(&#39;EDIT_PROFILE&#39;) and the state will transition from  showProfile to  editingProfile.\n When changes to the state object occur, the component will re-render allowing you to respond to those state changes with appropriate UI code.\n  Finite State Machines are a pretty nice way to force you to think about the states your application could be in upfront, then encode those states into a machine which drives your user-experience.\n We often deal with this complexity in React using multiple  useState or  useReducer hooks or global state management solutions.This approach doesn&#39;t need to replace them, but it provides a useful tool in your toolbox to control some of the more complex workflows that you might come up against from time to time.", "posttime": "2021-07-26 04:20:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,xstate,application,状态", "title": "如何使用有限状态机和 XState 在 React 中对应用程序流进行建模", "title_en": "How to model application flows in React with finite state machines and XState", "transed": 1, "url": "https://engineering.kablamo.com.au/posts/2021/finite-state-machines-and-xstate", "via": "", "real_tags": ["程序", "xstate", "状态"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年年底，有几篇关于日本在新数字时代未能成为巨人的文章（新闻周刊关于为什么苹果不是日本的，博客回复中有一些有趣的评论日本不再是一个电子行业的领导者）。不幸的是，《新闻周刊》的文章完全忽略了构成日本当前在数字时代地位基础的技术背景。在这篇文章中，我想探讨这种技术背景，并说明为什么像 CEO 和新闻周刊这样的商业类型的读者确实需要了解问题的潜在技术问题。日本与西方世界之间的数字鸿沟的真正开始始于 1970 年代末和 80 年代初，当时第一批 8 位家用计算机开始发布。此时最重要的因素之一是日语的复杂性。简而言之，只有 64k 内存的 8 位计算机根本没有编辑日语的能力。例如，第一个使用现代假名汉字文本输入系统的日语文字处理器是东芝 JW-10。 JW-10 是专用的文字处理器，没有其他功能。 JW-10 于 1979 年 2 月发布，重 220 公斤，标价为 6,300,000 日元（约合 30,000 美元）。在西方，我们可以通过将 300 美元的 Commodore Vic-20 连接到便宜的 8 针点阵打印机来获得类似的功能。 （事实上​​，您可能会争辩说 Vic-20 提供了更好的功能）。在我们继续历史之前，让我们先看看技术细节。 （如果您不在乎，请跳过此部分）。日语有两个独立的技术障碍。首先是显示字符。对于没有使用过 Apple II、Commodore-64 或其他 8 位系统的人，这里是一个屏幕截图，显示了 1982 年的尖端 8×8 像素字体。为了比较，让我们看一些常见的日语字符（这些字符分别排在第 35、64 和 104 位最常用的字符）：应该很清楚，日本人不会在 320×200 像素的屏幕上使用 8×8 像素的字符。 NEC PC-9801 是当时日本领先的个人电脑之一，提供 640×400 显示屏和 16×20 像素字符。对于 1978 年日本工业标准 (JIS C 6226-1978) 中定义的所有 6802 个字符，我们得到 6802x20x16 位 = 265 KB 的字体数据。 （相比之下，256 个 8×8 ASCII 字符仅为 2 KB）。第二个问题是文本输入过程——键盘上的 100 个左右的键用于从 6000 个左右的字符中进行选择。在电报时代，这是使用写在一张纸上的 94×94 单元格表完成的，上面列出了所有字符。 “kuten”代码是该表中字符的坐标。现代假名-汉字转换方法包括按语音输入字符，并根据字典进行转换。字典的大小与输入文本的难易程度直接相关。作为比较，Windows XP 上的转换词典为 36 MB。 8 位系统几乎受磁盘大小的限制。 1) 任天堂娱乐系统于 1983 年发布。14400 日元（约合 70 美元）。没有键盘。日语文本显示为游戏中存储的图形（只需包含显示字符的字体数据）。 2) 带有“片假名”日文字符的 8 位计算机。 （例如 NEC PC-8001 系列。1983 年发布的 Mark II 售价为 123,000 日元（约合 600 美元））。片假名是只需要 50 个字符的日语拼音字母表。在计算机出现之前，片假名从未被用来写完整的句子。只提供片假名的电脑对 NES 上的家庭用户没有实际价值，电脑爱好者除外。虽然这些电脑在技术能力上与 Commodore 64/Apple II 类似，但从家庭消费者的角度来看，它们在功能上是残缺的。\n3) 具有特殊硬件的 16 位计算机，用于显示汉字。 NEC PC-9801 于 1982 年发布，成为日本销量第一的家用电脑。第一款的零售价约为 300,000 日元（1500 美元）。包含汉字字体数据的 ROM 芯片是额外的（50,000 日元 – 250 美元），并且只支持级别 1 字符（大约是日本标准中数字的一半）。汉字输入是通过 kuten 代码（即您必须输入要显示的字符的十六进制数）。 PC-9801 的标准分辨率为 640×400，直到 1987 年 VGA 和 Macintosh II 发布，西方才超过这一标准。 4) 专业文字处理系统（即日本相当于电子打字机的系统） ）。 JW-1（介绍中讨论的 JW-10 的孙子）于 1983 年以 500,000 日元（约合 2,500 美元）的价格发布。因此，在 Apple II 首次将计算机带入美国家庭 6 年后，日本人仍然没有理由购买家用计算机，除非他们想通过输入十六进制代码来打字。西方的计算机制造商可以在“为什么只买电子游戏？”的前提下做广告，但日本家庭面临着在 1500 美元的十六进制噩梦世界和马里奥兄弟世界的 70 美元之间做出选择。在整个 1980 年代，西方各国通用计算平台出现爆炸式增长，甚至游戏制造商雅达利也从游戏机转向通用计算机（雅达利 ST）。而另一方面，日本则深深地沉浸在计算机的家电思维中。任天堂、世嘉和索尼等公司主导了游戏机市场。当美国开发人员致力于通用计算机的 Windows 和 MacOS 等桌面操作系统时，日本工程师则致力于开发 TRON 和 T-Kernel 等嵌入式操作系统，用于运行传真机和汽车发动机控制系统等嵌入式设备。 （顺便说一句，虽然 TRON 这个名字在消费者中并不为人所知，但运行 TRON 的设备数量与 Windows 的安装基础相当）。到 2001 年 iPod 发布时，日本手机已经具备电子邮件和互联网功能。尽管个人电脑数量增加了，但更多的日本人通过手机访问互联网而不是通过电脑，日本制造商陷入了家电思维模式。例如，考虑 2002 年发布的 Sharp J-SH51 手机，它也提供内置 MP3 播放器和数码相机。尽管是当时世界上最先进的手机之一，但 J-SH51 无法连接到电脑。那么你是如何将音乐传送到手机上的呢？好吧，你拿了一根模拟音频线，把它插入辅助。拔出 CD 播放器的插头。在西方，家用电脑已经被视为数字时代的中心枢纽。很明显，数码相机和 MP3 播放器等设备需要与家用电脑连接，人们会将照片从数码相机传输到电脑，或者将电脑用作音乐文件的中央存储上传到他们的电脑。 iPod 或其他需要的音乐播放器。例如，iPod 需要一台家用电脑。没有它，就无法在设备上打开或关闭音乐。然而，在日本，情况就不同了。或许，了解当时日本市场最简单的方式就是想象家用电脑并不存在。从这个角度来说，日本电子产业所走的方向是完全合情合理的。一切都需要设计为独立的设备。其中大部分的基础是数字存储卡，尤其是 SD 卡。数码相机和照相手机将所有内容存储在记忆棒上，并提供用于配置打印选项的 DPOF 配置选项。彩色打印机开始销售，提供 SD 卡插槽，以便在中间没有计算机的情况下可以打印这些照片。 MP3 播放器也有类似的转变，提供模拟电缆连接或用于音乐传输的 SD 卡插槽。新的立体声系统还提供了一个额外的 SD 卡插槽。 SD 卡就像新的磁带。唱片店甚至开始提供销售直接存储在 SD 卡上的数字音乐的机器。 3G 手机于 2001 年发布，日本电信公司设想了一个消费者可以直接在手机上购买和下载音乐的世界。如果没有人拥有家用电脑，并且手机是互联网连接的主要形式，这一切都有意义。\n对不需要家用计算机的独立设备的所有这些支持的另一面是，日本电子制造商几乎不提供对家用计算机的支持。许多设备根本无法连接到 PC。对于那些可以连接的，支持软件是不友好的，而且非常原始。我们以 SD 卡为例。 SD 卡提供了一种称为 SD 音频的“功能”，其中音乐由 DRM 系统保护存储。然而，只有一家制造商生产过真正支持这种方案的 USB 读卡器。即使您确实设法找到了支持 SD 音频的单独读卡器，您仍然无法将音乐传输到您的 SD 卡。事实上，您现在必须购买 RealPlayer 的特殊版本（没错，您必须为免费软件付费）。当然，这种情况在西方是行不通的，那里每个人都有一台家用电脑。即使在日本市场，这也不会成功。到2000年，日本80、90年代电脑所面临的技术难题大部分已经解决，家用电脑成为主流。日本消费者希望他们的电器能够连接到 PC，而 iPod 提供了一个设计精良、功能强大的包装。因此，Apple 创造了 iPod，而日本电子制造商不得不重新评估一个以家用电脑为数字媒体中心的新世界。日本制造商终于迎头赶上并开始提供 PC 连接。现在，大多数手机都带有 USB 数据线和软件，用于在 PC 之间传输照片和音乐。虽然最新的具有音乐功能的手机仍然配备 SD 卡，但已添加对 Apple MP4 格式的支持，并且可以使用通用读卡器传输文件。很难说日本电子公司的误判是一次性的失误，还是趋势的开始。任天堂 Wii 无疑是一个强有力的指标，表明一切都没有丢失，即使它重新回到了面向家电设备的日本强国。", "note_en": "At the end of last year, there were a couple of articles about Japan’s failure to be a giant in the new digital age (Newsweek on  Why Apple Isn’t Japanese, and there were some interesting comments in a blog response  Japan is no longer a leader in Electronics). Unfortunately, the Newsweek article completely ignores the technical background which forms the basis for Japan’s current position in the digital age. In this post, I want to explore this technical background and show why business-types such as CEO’s and Newsweek readers really do need to understand the underlying technical issues of a problem.\n  The real start of the digital gulf between Japan and the western world started back in the late 1970s and early 1980s when the first 8-bit home computers began to be released. One of the most important factors at this time was the complexity of the Japanese language. Put simply, an 8-bit computer with only 64k of memory simply does not have the capacity to edit Japanese. As an example, the first Japanese word processor to use the modern kana-kanji text entry system was the  Toshiba JW-10. The JW-10 was a dedicated word processor with no other functionality. Released in February 1979, the JW-10 weighed 220kg and had a price tag of 6,300,000 yen (around $30,000). Here in the west, we could get similar capabilities with a $300  Commodore Vic-20 connected to a cheap 8-pin dot matrix printer. (In fact, you could argue that the Vic-20 offered better functionality). Before we continue with the history, let’s look at the technical details. (Skip this section if you don’t care).\n  There are two separate technical barriers for the Japanese language. The first is displaying the characters. For anyone who hasn’t used an Apple II, Commodore-64 or other 8-bit system,  here is a screen-shot showing the cutting-edge 8×8 pixel fonts of 1982. For comparison, let’s look at a few common Japanese characters (these are ranked as the 35th, 64th, and 104th most commonly used characters, respectively):\n  It should be pretty clear that the Japanese are not getting away with 8×8 pixel characters on a 320×200 pixel screen. The NEC PC-9801 was one of the leading Japanese personal computers of the time, and offered a 640×400 display with 16×20 pixel characters. For all 6802 characters defined in the 1978 Japanese Industrial Standards (JIS C 6226-1978), we get 6802x20x16 bits = 265 kBytes of font data. (Compared to a mere 2 kBytes for 256 8×8 ASCII characters).\n The second problem is the text entry process – whereby the 100 or so keys on the keyboard are used to select from the 6000 or so characters. In the days of telegraph, this was done using a 94×94 cell table written on a sheet of paper with all of the characters listed on it. The “kuten” codes were the coordinates of the characters in this table. The modern kana-kanji conversion approach involves entering characters phonetically, and converting based on dictionaries. The size of the dictionaries is directly related to how easy it is to enter text. For comparison, the conversion dictionaries on Windows XP are 36 MB. An 8-bit system is pretty much limited to the size of a disk.\n   1) The Nintendo Entertainment System released 1983. 14400 yen (around $70). No keyboard. Japanese text is displayed as graphics stored in the game (only the font data for displayed characters need be included).\n 2) 8-bit computer with “katakana” Japanese characters. (Examples include the NEC PC-8001 series. The Mark II was released in 1983 was 123,000 yen (around $600)). Katakana is a Japanese phonetic alphabet only requiring 50 characters. Before the advent of computers, katakana was never used to write entire sentences. Computers that only offered katakana had no practical value to home users over the NES, except for computer enthusiasts. Although these computers are similar to the Commodore 64/Apple II in terms of technical capabilities, they are crippled in terms of functionality from the viewpoint of home consumers.\n 3) 16-bit computers with special hardware for displaying kanji. The NEC PC-9801 was released in 1982 and became the number one selling home computer in Japan. The first model retailed for around 300,000 yen ($1500). The ROM chips containing the kanji font data were extra (50,000 yen – $250), and only support Level 1 characters (around half of the number in the Japanese standards). Kanji input was by kuten code (i.e. you had to type in the hexadecimal number of the characters you wanted to display). The PC-9801 featured a standard resolution of 640×400, which would not be surpassed as a standard in the west until the release of VGA and Macintosh II in 1987.\n 4) Specialist word processing systems (i.e. the Japanese equivalent of an electronic typewriter). The JW-1 (grandchild of the JW-10 discussed in the intro) was released in 1983 for 500,000 yen (around $2,500).\n So, 6 years after the Apple II first brought computers into homes in America, the Japanese still had no reason to buy a home computer unless they wanted to type by entering hexadecimal codes. Whereas computer manufacturers in the west could advertise under the premise of  Why Buy Just a Video Game?, Japanese households were faced with a choice between $1500 for a world of hexadecimal nightmare compared to $70 for the world of Mario Bros.\n  Throughout the 1980s, western countries saw explosive growth in general-purpose computing platforms, with even games manufacturer Atari switching from a console to a general-purpose computer (Atari ST). Japan, on the other hand, was deeply immersed in an appliance mentality of computers. Companies like Nintendo, Sega, and Sony dominated the games console market. And while American developers worked on desktop operating systems such as Windows and MacOS for general purpose computers, Japanese engineers were working on embedded operating systems such as TRON and T-Kernel for running embedded devices such as fax machines and car engine control systems. (As an aside, although the name TRON is not well-known among consumers, the number of devices running TRON is on par with the install-base of Windows).\n  By the time the iPod was released in 2001, Japanese mobile phones were already e-mail and internet capable. Although personal computer numbers had grown, more Japanese were accessing the Internet through their mobile phone than through a computer, and Japanese manufacturers were locked into the appliance mindset. As an example, consider the Sharp J-SH51 mobile phone released in 2002 which also offered a built-in MP3 player and digital camera. Despite being one of the most advanced mobile phones in the world at the time, the J-SH51 could not be connected to a computer. So how did you get music onto your phone? Well, you took an analog audio cable and plugged it into the aux. out plug on your CD player.\n In the west, the home computer was already being viewed as the central hub of the digital age. It was obvious that devices such as digital cameras and MP3 players would need connectivity with the home computer, and that people would transfer pictures from the digital camera to their computer, or would use their computer as the central storage for music files to upload to their iPod or other music player as needed. The iPod, for example, requires a home computer. Without one, there is no way to get music on or off the device.\n In Japan, however, things were different. Perhaps the easiest way to understand the Japanese market at the time is to imagine that home computers did not exist. From this perspective, the direction that the Japanese electronics industry took makes perfect sense. Everything needed to be designed as stand-alone appliance. The basis for much of this was the digital memory card, particularly the SD card. Digital cameras and camera-phones stored everything on a memory stick, and offered DPOF configuration options for configuring printing options. Color printers went on sale offering SD card slots so that these photos could be printed without a computer in the middle. MP3 players took a similar turn, offering either analog cable connectivity or SD card slots for music transfers. New stereo systems also offered an additional SD card slot. The SD card was like the new cassette. Record stores even began offering machines that sold digital music directly stored on your SD card. 3G phone handsets were released in 2001, and Japanese telecoms envisioned a world where consumers would buy and download music directly onto their mobile phones. It all makes sense if nobody owns a home computer, and when the mobile phone is the dominant form of Internet connectivity.\n The flip-side of all this support for stand-alone appliances that do not require a home computer is that the Japanese electronics manufacturers offered virtually no support at all for home computers. Many devices simply could not be connected to a PC. For those that could be connected, the support software was unfriendly and extremely primitive. Let’s take the SD card as an example. SD cards offered a ‘feature’ called SD Audio whereby music was stored protected by a DRM system. However, only one manufacturer ever produced USB card readers that actually supported this scheme. Even if you did manage to track down the lone card reader that supported SD Audio, you still can’t transfer music to your SD card. In fact, you now had to purchase a special version of RealPlayer (that’s right, you had to pay for free software).\n Of course, this kind of situation wasn’t going to fly in the west, where everyone had a home computer. Even in the Japanese market, this wasn’t going to fly. By the year 2000, most of the technical difficulties facing computers in Japan in the 80s and 90s had been resolved, and home computers were becoming mainstream. Japanese consumers wanted PC connectivity from their appliances, and the iPod offered a well-designed, highly functional package. So Apple created the iPod, and Japanese electronics manufacturers were left to re-evaluate a new world where the home computer is the hub for digital media.\n  Japanese manufacturers are finally catching on and have started to offer PC connectivity. Most mobile phones now come with USB cables and software for transferring photos and music to and from a PC. While the latest music-capable phones still come with an SD card, support has been added for Apple’s MP4 format, and files can be transferred using a generic card reader. It’s difficult to say whether the misjudgment of the Japanese electronics companies was a one-off falter, or if it is the start of a trend. The Nintendo Wii is certainly a strong indicator that all is not lost, even if it is back on the Japanese strong ground of an appliance-oriented device.", "posttime": "2021-07-26 04:19:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,didn", "title": "为什么日本没有创造 iPod", "title_en": "Why Japan Didn’t Create the iPod", "transed": 1, "url": "https://blog.gatunka.com/2008/05/05/why-japan-didnt-create-the-ipod/", "via": "", "real_tags": ["日本", "didn"]}, {"category": "", "categoryclass": "", "imagename": "602e11ddf0f53b1d6a426044baddef17.jpg", "infoid": 1069718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6 月初，当 Brayden LeBlanc 看到来自流行电子竞技团队 FaZe Clan 的四位有影响力的人宣传加密货币项目时，他认为自己即将进行一项安全且值得的投资。该项目是一种名为 Save the Kids 的慈善加密货币令牌，于 6 月 5 日启动，其创建者将其推广为一种让世界变得更美好的方式。 FaZe Clan 的成员，每个人都有数百万的社交媒体粉丝，给它一种新的和令人兴奋的感觉。 21 岁的勒布朗来自加拿大新不伦瑞克省的圣约翰，最初投资了 94 美元。但在加密货币令牌推出数小时后，其价值暴跌。 LeBlanc 的投资现在价值约 5 美元。 “我觉得我被玩弄了，”勒布朗说。 “这些 FaZe 成员是我和数百万其他人所仰慕的人。我们想和他们一样。”虽然推广该代币的 FaZe Clan 成员因参与而被团队移除或暂停，但这一事件已成为最引人注目的例子之一，表明行业观察者和新兴的在线监管团体认为这是一个有问题的动态其中有影响力的人推广加密货币——年轻人特别容易受到炒作的影响。 2020 年和 2021 年初的加密货币热潮吸引了新一波主流投资者的兴趣，尤其是像勒布朗这样的年轻人，因为比特币和以太坊等更成熟的加密货币以及狗狗币等替代货币的价值飙升。这有助于激发一波新的加密货币进入市场，其中一些转向名人和互联网影响者成为大使并帮助获得牵引力。金·卡戴珊、弗洛伊德·梅威瑟和洛根·保罗只是推广山寨币的少数人——这是比特币以外的加密货币的统称。\n但有些人出错了。 LeBlanc 声称 Save the Kids 代币是一种暴涨和暴跌——一个众所周知的提高资产价格的计划。至少有一名 FaZe Clan 成员表示，他也亏了钱，并认为应该归咎于滥用影响者信任的“骗子”。 “感觉就像我和其他投资者被用作轻松赚钱的一种方式，”勒布朗说。根据追踪网站 CoinMarketCap 的数据，在过去一年中，加密货币的数量翻了一番，达到 10,000 种。根据联邦贸易委员会今年的一份报告，尽管市场看起来正在蓬勃发展，但自 2020 年 10 月以来，与加密相关的骗局已经损失了超过 8000 万美元。 FTC 分析师 Emma Fletcher 表示：“随着近几个月比特币的价值飙升，新投资者可能渴望参与其中。” “所有这些都落入了骗子的手中。”该报告发现，20 至 49 岁的人在加密货币投资骗局中赔钱的可能性是老年人群的五倍。英国金融行为监管局在今年的一份报告中还透露，新的和年轻的受众正在从事加密等高风险投资，并且往往受情绪和感受的驱动。研究发现，投资的原因通常是基于竞争和新颖性，而不是“传统的、更实用的原因”，例如为退休储蓄。雷切尔·西格尔 (Rachel Siegel) 表示，新的加密货币技术为诈骗创造了机会，她在 Twitter 上为超过 150,000 名粉丝提供了与加密相关的教育内容。\n“拯救儿童骗局与我们在加密领域看到的许多其他骗局非常相似，”西格尔声称。 “我认为这项技术有很多很好的利用方式。只是还没有足够长的时间来清楚地将合法项目与不诚实的项目区分开来。”美国联邦贸易委员会拒绝评论它是否正在调查救助儿童会事件。加密货币产生的一夜暴富的吸引力加上广受关注的社交媒体明星的影响，被加密货币行业的一些人视为灾难的根源。 20 岁的 Lucas Dimos 是一群试图解决这个问题的社交媒体影响者之一。在他的 TikTok 账户上，他试图向他的近 300,000 名追随者提供关于加密市场繁荣的现实检查，并警告人们不要期待一夜成名。他说：“人们只是超越了他们应有的苍白和赌博方式，”并补充说，许多人已经联系过他，声称他们已经失去了一半的大学学费投资于加密货币。 “这些人不是投资者，他们是赌博成瘾者。我们需要停止把它当作赌场来对待，”迪莫斯说。 “做你自己的研究，投资于好的、基本合理的项目，永远不要投资超过你能承受的损失。 ......这三件事是我一直在人们脑海中挥之不去的一切，因为它可以很快变得非常令人兴奋。”他还表示，几乎没有什么可以阻止影响者在几乎没有监督的情况下从他们的影响力中获利。 “我们现在在狂野的西部，”他说。 “警长不在城里。没有人会来敲你的门。”\n其他社交媒体人物走得更远，形成了一种非正式的监督亚文化，试图识别骗局并警告人们注意它们。一位名叫 Coffeezilla 的 YouTube 创作者（他的真名是 Stephen，但由于他创作的视频内容而在网上隐瞒了他的姓氏）于 6 月 24 日制作了一段视频，重点介绍了 Save the Kids 加密货币的涉嫌问题。他声称代币的开发人员在最后一刻秘密更改了代码，以允许早期投资者抛售他们的代币并带着钱跑掉。 “对我来说，这巩固了它作为一个终极骗局，”他声称。 “这是一场有预谋的骗局。对我来说，这让它变得更加令人震惊，然后你将它与孩子有关的事实结合起来，你就拥有了阴暗影响者加密诈骗的圣杯。”在斯蒂芬发布他关于拯救孩子的第一个视频几天后，推广该项目的 FaZe Clan 影响者之一弗雷泽“凯”卡特里向他的粉丝道歉，称他“不负责任地”推广加密货币“没有了解更多，并且现在知道它们弊大于利。” Khattri 还在 YouTube 上宣布，他发现了“一个不诚实的人滥用对我的信任来欺骗所有人的重要证据”，并且他和他的律师正在立案以追究“骗子”的责任。根据斯蒂芬的说法，哈特里的律师以“虚假和诽谤性公开声明”为由向他发出了禁止令。涉及的其他 FaZe Clan 影响者尚未发表公开声明，他们也没有回应 NBC 新闻的置评请求。然而，周日，另一位 FaZe Clan 成员 Teeqo 在推特上发帖称“过去一个月的生活绝对是一场噩梦”，并且他“不确定我何时或是否会回来”，斯蒂芬说他认为他的视频是一个机会向可能试图利用年轻人和易受影响的人施加压力。\n“如果没有人追究任何人的责任，就没有恐惧，”他说。 “这有点像你在地下操作。”他说：“我可以报告此事，直到我脸色发青，但是……直到有人因此陷入真正的麻烦为止，我认为这种情况有持续存在的危险，”他补充说，“我认为执法部门需要介入在人们开始真正关注之前的某个层面。”", "note_en": "In early June, when Brayden LeBlanc saw four influencers from the popular esports team FaZe Clan promote a cryptocurrency project, he thought he was about to make a safe and worthwhile investment.\n The project, a charity cryptocurrency token called Save the Kids, launched on June 5, and its creators promoted it as a way to make the world a better place. The members of FaZe Clan, who each have millions of social media followers, gave it the feeling of something new and exciting. LeBlanc, 21, from Saint John in New Brunswick, Canada, initially invested $94.\n   But hours after the cryptocurrency token’s launch, its value crashed. LeBlanc’s investment is now worth around $5.\n “I feel like I’ve been played,” LeBlanc said. “These FaZe members are people that myself and millions of others look up to. We want to be like them.”\n  While the FaZe Clan members who promoted the token have since been  removed or suspended by the team for their involvement, the episode has become one of the most high-profile examples of what industry watchers and an emerging group of online watchdogs say is a problematic dynamic in which influencers promote cryptocurrencies — with young people particularly susceptible to the hype.\n The cryptocurrency boom of 2020 and early 2021 attracted a new wave of mainstream investor interest,  particularly from younger people like LeBlanc, as more established cryptocurrencies like bitcoin and ethereum, along with alternative coins like dogecoin, skyrocketed in value.\n  That helped inspire a wave of new cryptocurrencies to enter the market, some of which turned to celebrities and internet influencers to become ambassadors and help gain traction.  Kim Kardashian, Floyd Mayweather and  Logan Paul are just a few of the personalities to have promoted  altcoins — a catchall term for cryptocurrencies other than bitcoin.\n But some have gone wrong. LeBlanc alleged the Save the Kids token was  a pump and dump — a well-known scheme to boost the price of an asset. At least one of the FaZe Clan members has said he also lost money and believes a “con man” who abused the influencers’ trust is to blame.\n “It just feels like me and the other investors were used as a way to get easy money,” LeBlanc said.\n In the past year, the number of cryptocurrencies have doubled to 10,000 according to the tracking website CoinMarketCap. And while it appears the market is booming, more than $80 million has been lost in crypto-related scams since October 2020, according to  a report this year by the Federal Trade Commission.\n  “With bitcoin’s value soaring in recent months, new investors may be eager to get in on the action,” said Emma Fletcher, an analyst with the FTC. “All of this plays right into the hands of scammers.”\n  The report found that people aged 20 to 49 were five times more likely to lose money in cryptocurrency investment scams than older age groups. The United Kingdom’s  Financial Conduct Authority also revealed in a report this year that new and younger audiences were engaging in high-risk investments like crypto and were often driven by emotions and feelings.\n It found that the reasons for investing were often based on competition and novelty, rather than “conventional, more functional reasons” such as saving for retirement.\n New cryptocurrency technology has created opportunities for scams to take place, according to Rachel Siegel, who provides crypto-related educational content to more than 150,000 followers on  Twitter.\n  “The Save the Kids scam was very similar to a lot of other scams we see in the crypto space,” Siegel alleged. “I think that there is a lot of good ways this technology can be utilized. It just hasn’t been around long enough to clearly decipher legitimate projects from disingenuous ones.”\n  The FTC declined to comment on whether it was investigating the Save the Kids matter.\n  The allure of overnight wealth generated by cryptocurrencies combined with the sway of widely followed social media stars is seen by some in the cryptocurrency industry as a recipe for disaster. Lucas Dimos, 20, is one of a group of social media influencers trying to counter this problem.  On his TikTok account, he tries to offer a reality check to his almost 300,000 followers on the exuberance of the crypto market and warn people away from expecting overnight success.\n “People just go beyond the pale and gamble way more than they should have,” he said, adding that a number of people have contacted him claiming they had lost half their college tuition investing in crypto.\n  “These people are not investors, they’re gambling addicts. We need to stop treating it like a casino,” Dimos said. “Do your own research, invest in good, fundamentally sound projects and never invest more than you can afford to lose. … Those three things are everything I keep hammering home in people’s heads because it can get really exciting really quickly.”\n He also said there’s little stopping influencers from profiting off their clout with little oversight.\n “We’re in the Wild West right now,” he said. “The sheriff is not in town. Nobody’s going to come knocking at your door.”\n Other social media personalities have gone further, forming something of an informal watchdog subculture to try to identify scams and warn people about them. One YouTube creator who goes by Coffeezilla (his real name is Stephen but he withholds his last name online due to the video content he creates)  made a video on June 24 highlighting alleged issues with the Save the Kids cryptocurrency. He alleged the token’s developers had secretly changed its code at the last minute to allow early investors to dump their tokens and run off with the money.\n  “That to me solidified it as an ultimate scam,” he claimed. “It is a premeditated scam. That to me makes it even more egregious, and then you combine the fact that it’s about kids, and you have the holy grail of shady influencers crypto scams.”\n  A few days after Stephen posted his first video about Save the Kids, Frazier “ Kay” Khattri, one of the FaZe Clan influencers who promoted the projected,  issued an apology to his fans saying it was “irresponsible” for him to promote cryptocurrencies “without knowing more, &amp; knowing now that they can do more harm than good.”\n Khattri also announced on  YouTube that he had uncovered “significant evidence that a dishonest person abused his trust with me to scam everybody,” and that he and his lawyers were building a case to hold the “con man” accountable.\n According to Stephen, Khattri’s lawyers have issued him  a cease and desist letter for “false and defamatory public statements.”\n The other FaZe Clan influencers involved have not issued public statements, and they did not respond to an NBC News request for comment. However, on Sunday another FaZe Clan member,  Teeqo, posted on Twitter that “life’s been an absolute nightmare the past month,” and that he’s “not sure when or if I’ll be back”\n  Stephen said he sees his videos as a chance to put pressure on people who may be trying to take advantage of young and impressionable people.\n “If nobody’s holding anyone accountable, there is no fear,” he said. “It’s just sort of like you’re operating underground.”\n  “I can report on this till I’m blue in the face but … until somebody gets in real trouble for this, I think there’s a danger of this continuing,” he said, adding, “I think that law enforcement needs to get involved at some level before people start really paying attention.”", "posttime": "2021-07-26 04:19:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "货币,investors", "title": "年轻投资者说他们被有影响力的加密货币“玩弄”了", "title_en": "Young investors say they were 'played' by influencer-endorsed cryptocurrency", "transed": 1, "url": "https://www.nbcnews.com/tech/tech-news/wild-west-cryptocurrencies-social-media-influencers-rcna1469", "via": "", "real_tags": ["货币", "investors"]}, {"category": "", "categoryclass": "", "imagename": "477b972c57ac92f280f586685c6f3c8c.jpg", "infoid": 1069717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我在浏览器选项卡中打开的一篇论文的摘要；我不记得我在哪里遇到过它。我认为这是一篇不错的论文，但它也有 63 页长，对于那些不会以其他方式解决它的人来说，似乎值得一提纲。 Scott 在 For, then against, High-saturated-fat diets 中得出结论，肥胖危机似乎意味着三个答案之一：减轻体重真的很难，而前几个世纪的人们生活真的很艰难，这就是为什么很少有人肥胖的原因然后。它是“由影响微生物组的塑料或抗生素或类似的东西引起的”。首先，有理由对这篇论文保持警惕：两位作者（同姓）似乎都没有适用领域的专业知识，而且它似乎是在 Computer Modern Roman 中设置的，几乎不是期刊投稿的风格。所以它来自传统专业知识之外。 （我在这里也没有任何专业知识。）考虑到这一点，本文首先提出了一系列关于肥胖的具有挑战性的事实。 （参考原文：）它是新的。一百年前，肥胖症非常罕见（约占人口的 1%），但有很多人吃饱了，从我们的角度来看，他们吃了很多发胖的食物。\n这不仅仅是新的，它似乎在 1980 年左右突然开始。“今天，意大利、法国和瑞典的肥胖率约为 20%。 1975年，世界上没有一个国家的肥胖率超过15%”。它仍然变得更糟。它在新闻中较少，但如果有的话，它在美国正在加速。尽管美国人自 2000 年以来显着减少糖和碳水化合物的摄入量，但情况仍然如此。不仅仅是人类：实验室动物和野生动物似乎也随着时间的推移变得越来越胖。 （让我感到惊讶，但偶然的检查似乎证实，这确实是评论论文所注意到的。）超市里的垃圾食品使老鼠变胖的效果远远超过给它们提供更多的任何常量营养素。不知何故，垃圾食品不仅仅是糖、蛋白质和脂肪的总和。节食会在数周或数月内适度减轻体重，但随着时间的推移，体重会恢复。有很多人在寻找有效的饮食，但在大量人群中它们都是一样的。 “是暴饮暴食造成的！”，他们哭了。但是受控的过度喂养研究（从 1970 年代开始——爆炸前）很难让人体重增加，一旦过度喂养停止，他们就会迅速减轻体重。 （这是反对滞后理论的证据。）“这是缺乏锻炼”，他们喊道。但让人们运动似乎并没有显着减轻体重，尽管投入了大量金钱和精力进行运动，肥胖仍在蔓延。\n“这是吃太多脂肪造成的”，响起。但是几十年前，美国人为了回应有关脂肪的危害的信息而减少了他们的脂肪摄入量，但并没有帮助。低脂饮食也不是很有效。 “这是太多的糖/碳水化合物”，你听到了。但美国人近年来减少了糖和（更普遍的）碳水化合物的摄入量，这也无济于事。 Gary Taubes 的研究有点像哑炮。在这一部分，所有的东西都有一个狩猎采集部落。我对这一证据线有点怀疑，因为这些小群体可能已经进化到可以忍受他们特定的环境，但是，如果你想要一群零肥胖率的人吃 60%+ 或 60%+胖子，这篇论文为你准备了一份。他们有充足的食物，他们只是快乐地生活并保持苗条。接下来，论文确定大脑对体重有一定程度的稳态调节。您可能会损害大脑的特定部分并导致肥胖。或者你可能有遗传缺陷，导致脂肪细胞不产生瘦素，从而导致食欲不振。 （但是给超重的人添加瘦素不起作用。）现在这篇论文提出了它的论点：这一切都是由一种微妙的毒药引起的！其生产在 1980 年之前真正起飞，并且正在增加或具有生物累积性。节食不起作用，因为这不是节食问题。超市食品比任何大量营养食品更容易使老鼠发胖，因为超市食品含有更多的污染物。野生动物越来越胖，因为它们也在吃。生活在海平面意味着你的水源流动得更远，吸收了更多的水，这就是为什么海拔高度与肥胖不相关。有许多药物会导致体重增加，而且似乎是通过作用于大脑来实现的，因此这些东西可能存在。这并不是第一篇表明某些化学物质会导致该问题的论文，但这篇论文通过说它是主导因素来区分自己。详细列出了三个特定的化学品家族以供考虑：抗生素；全氟烷基和多氟烷基 (PFAS)；和锂。都有模棱两可的证据。\n抗生素肯定会使动物变胖，但它们对人类的消耗量是否也一样？如果是这样，为什么使用牲畜脂肪多的地方不比使用少的地方多？为什么纯素饮食对减肥没有魔力？ PFAS 是一个由数千种研究不足的化学物质组成的家族，但它们并没有在合理的水平上明显地导致人类体重增加。但他们肯定无处不在。锂显然确实会导致人类体重增加，但是人们接触到的锂量是否会增加，并且它们的量是否足以导致体重增加？该论文还指出，事情更糟，因为化学物质在环境和动物中会产生复杂的作用。您不仅要考虑制造的化学品，还必须担心它们可能变成的一切。这篇论文以科罗拉多州的一家工厂为例，该工厂制造“战争材料”并向工厂周围的地下释放了一些化学物质。化学物质通过地下水传播到几英里外的农场需要数年时间。在那段时间里，他们反应形成了 2,4-D，一种除草剂，它杀死了这些农场的庄稼。 （未反应的化学物质也很讨厌。）转向应该完全归咎于我的猜测，而不是论文：似乎任何影响肥胖调节的化学物质都可能朝着肥胖的方向这样做.有几种药物针对大脑并导致体重增加，但导致体重显着下调的安全药物较少。 （如果有几种这样的药物，很多人会服用它们。）相反，导致体重减轻的药物通常会导致身体能量浪费，而不是改变体重调节：DNP 导致热量流失，或 SGLT2 抑制剂导致葡萄糖排泄。因此，我们可能面临多种次要因素影响脂肪调节的情况，但总体影响是针对肥胖的，因为任何影响都倾向于朝着这个方向发展。导致体重下调的一个明显例子是吸烟。 （虽然我们不会称其为“安全”。）我想知道这篇论文是否过度关注在 1980 年之前的流行度发生了阶段性变化的东西。它可能在过去几十年中一直在稳步发展，但 40% 的60 年代/ 70 年代吸烟的美国成年人隐藏了一段时间。如果我们假设某些环境因素导致了肥胖问题的很大一部分，那么我们将如何测试它？它很可能是多种因素的总和，鉴于与海拔的相关性，其中一些因素可能会在水中携带。似乎需要一群超重的人愿意消费专门提供的水（来自蒸馏）和某种原始食物来源。至少 PFAS 的半衰期是在人类中以年为单位来衡量的，因此受试者必须长时间遵守这种被禁饮食。为了有对照组，我们必须（双盲）用环境上合理的候选化学物质污染原始食物，我猜？这会通过任何 IRB 吗？这篇论文包含更简单的实验，比如让科威特改变其海水淡化过程，或者更合理地让一家汽车修理厂更换润滑脂，但除非我们很幸运并且一个因素占主导地位，否则这些只会产生部分答案。\n环境假说主要是一种排除性假说，本文就是一个很好的例子。 （尽管对于超出自己专业知识范围的任何复杂技术论点，人们都应该具有重要的认识论谦逊。）而且我什至没有涵盖所有内容！论文继续讨论矛盾反应和厌食症的发生！如果这个摘要引起了兴趣，那么里面还有更多内容。如果我们假设某些环境因素导致了肥胖问题的很大一部分，那么我们将如何测试它？假设您无法运行数十年的 RCT 或说服整个国家大幅改变其水资源政策（听起来有点棘手？），您正在寻找的统计灵丹妙药是方差成分分析。您需要一个等价于遗传力的方差分量分析，但针对水/肥胖。这是一个完美的匹配：你有一个非常高维的测量（饮用水和食品的 GC-MS），你无法观察到它的成分，因为你甚至不知道有多少比哪些（比如原始污染物可能会在此过程中发生反应的未知化学物质**），直接预测/回归将失败，因为它需要大量荒谬的数据（特别是考虑到他们概述的统计问题），并且您的原始研究问题不是“在哪里是大海捞针”，但“这个大海捞针到底有没有针”。在行为遗传学中，如果你根据基因相似性和表型相似性绘制成对的人，你会发现两者相似的人倾向于聚集；性状越具有遗传性，它们就越聚集。您可以针对非“遗传”的相似性执行此操作。方差分量的想法是从直接关联/回归水中的特定化学物质水平转变，试图测量每种化学物质对肥胖症的确切直接影响，转而询问，“就整体水化学成分而言，有多相似？ “相似的远或瘦的人？胖人的化学光谱看起来很相似，瘦人的光谱看起来相似吗？它们是否共同变化和聚类？“将水 GC-MS 视为一种指纹或高维总结。它不需要包含实际的关键数据点，只需要很多相关/代理（例如，您可以在叶子上发光，它就会起作用！）。重点不是直接测量罪魁祸首，而是间接测量数据点的距离；也许化学物质 A 出现而化学物质 B 没有清楚地显示出来，而 B 是真正的原因，但只要化学物质 A 与化学物质 B 相关（也许它是不同的反应产物，或者只是被制造或使用与 B 密切相关） )，那么您会看到脂肪族的水谱往往很接近（因为 A），并且您将有强有力的证据表明“水中有东西”，因为在劣质水聚集的地方脂肪族会聚集在一起。所以，你会做一些事情，比如记录 10,000 人的 BMI，抽取他们的饮用水样本，GC-MS（理想情况下，但可以使用许多其他分析技术，也许这里有些会更好，我会推迟到该主题的任何实际分析化学家），然后插入混合线性模型。您可以根据需要插入协变量（家族/系谱以联合建模遗传遗传力、邮政编码、年龄、性别、当地采矿/工厂、GC-MS 检测到的已知有害污染物，诸如此类）。这可以在多个层次上完成：嵌套在家庭中、区域内、国家内等的个人。 水谱和 BMI 之间的协方差量衡量水的含量可以解释的方差量，并取决于测量错误等等，鉴于遗传遗传力限制了水遗传力可以解释多少，你应该得到&lt;30%。根据大多数肥胖理论，很难理解为什么人们会预测不同于 0%* 的水遗传力，尤其是如果已经将海拔/社会经济地位/家庭/地区作为协变量（这应该涵盖所有明显的混杂因素，例如“也许受污染的水只是生活在贫困地区/附近有采矿/贫困的代表”），因此任何&gt; 0％都是高度可疑的。\n这不需要任何 RCT（或任何类型的干预）、纵向数据集、数以百万计的 n 或大多数拟议测试的任何障碍。您只需要肥胖/水样的横截面。个人水平是理想的，但如果地理单位在足够多的单位中可用（个人 n 比 k 更嘈杂，但也更容易获得高统计能力），那么使用地理单位也很有用。这甚至可能已经存在！饮用水经常因多种原因进行检测，肥胖健康数据是几乎所有相关研究中收集的标准医学数据；所以应该有很多可能的交叉引用。 * 你也可以用食物来做到这一点，但我专注于水，因为水每天都更加稳定，食物结果会模棱两可。一天的食物仍然不能很好地代表个人消费（也许你的妻子在家做饭很健康，但你在办公室吃加工过的垃圾，样本来自周末），所以它提供了一个非常糟糕的整体饮食测量化学签名。如果你证明肥胖具有很大的食物遗传性，这将被视为证明“看到了吗？糖/脂肪/卡路里/高可口加工导致一切，就像我们一直说的！”，并且是弱证据最好是污染。 ** 它们还提出了相互作用和非线性响应的问题。当然，这些也是行为遗传学中的问题，特别是支配性/上位性，并且可以在水环境中类似地处理：“狭义”与“广义”遗传力涵盖简单的加法与相互作用，您可以做像 DeFries- Fulker，我认为，用于非线性响应。我的猜测是，污染主要是“累加”的，出于与遗传学倾向于“累加”类似的潜在原因：许多相互作用只是常数，因为它们是在固定的化学背景下完成的，而混杂的相互作用平均会产生累加效应。但这种事情只有在完成了简单的工作之后才需要担心。你有没有见过甚至听说过一个肥胖的人不吃超可口的食物？ （也就是说，他们只吃味道自然、未加工的“健康”食品）。这对我来说似乎是奥卡姆剃刀式的扩展。我们的一些新口味/质地组合非常有益，以至于它们很容易克服自然停止信号，导致大多数（在不同程度上）热量消耗过多，从而导致一些体重增加。一项让参与者每天摄入 1000 卡路里的饮食过剩的研究发现，一些参与者在研究过程中增加了 14 公斤脂肪（我认为是 3 个月），其他人仅增加了 4 公斤。正如人们所料，一个人对有害热量过剩影响的脆弱性存在遗传变异，而且一个人对超可口食物的易感性也可能存在遗传变异。我希望看到的研究是让肥胖者在 3 个月内无限制地只吃天然食物。他们可以加盐和香料，但不能加油，绝对不能加糖。饮食将是瘦肉、水果、蔬菜和豆类（不确定允许吃坚果是否是个好主意，因为它们的卡路里含量极高，但从技术上讲，根据此定义，它们应该被允许）。\n如果这不起作用，我会感到惊讶。在这个模型下，我认为超可口的食物等同于对肥胖人群的成瘾药物。就像你有酗酒的不良表型一样，你应该完全避免饮酒，如果你有过度食用超可口食物的不良表型，以及将那些额外的卡路里转化为脂肪的不良表型，你应该避免超可口食物。海拔高度相关性似乎特别表明饮用水是罪魁祸首，并提出了一项简单而直接的研究，可以一劳永逸地解决这个问题：随机分配一组家庭，要么在他们的水龙头上安装反渗透过滤器，要么不，然后跟踪这些家庭中的人是否变得肥胖。我检查了这项研究是否已经进行，据我所知，还没有。有研究随机安装了反渗透过滤器，但他们正在检查其他东西并且没有跟踪人们的体重。海拔高度的另一个影响是大气层，有证据表明海拔高度降低重量的有效成分是稀薄的大气层。例如，“一项关于老鼠的研究发现，它们在被运送到派克峰后一天吃的量减少了 58%，并且在两周后仍然每天减少了 16%。”直接影响强烈表明它不是由水源中的任何东西引起的。有关处理这一点的作者，请参阅论文的第 6 页。这当然是一个潜在的解释，但美国的肥胖地图似乎确实表明，在密西西比盆地的河口比在西海岸更糟糕，尽管它们都在海平面上。反渗透过滤器在一些水质较硬的地方已经更常见（并决定在市政层面软化它不会具有成本效益）。如果有关于水硬度和肥胖程度的细粒度数据，那至少可以提供一点信号。哦，呵呵——看来这篇论文是“Slime Mold Time Mold”系列博客的总结？猜猜我可以阅读这篇论文跳到最后，因为还没有全部发布。 :P\nAdderall（和其他类似的兴奋剂）可以抑制食欲。它们不是作为食欲抑制剂开处方的好选择，因为它们具有其他主要作用，而且它似乎不会影响每个人，但它们确实有效。有一段时间我有一个理论，即“饮料中的糖不与大块食物搭配”会在没有人脑/任何注意的情况下增加卡路里，并且当达到正确的卡路里消耗水平时，饱腹感机制就会启动。这里的原型研究将涉及仔细测量一个人每周消耗多少卡路里，C，然后 C/3500 是随着时间的推移他们每周应该增加多少磅。我不知道这是不是真的，但我开始重新调整我对食物的习惯和感受，试图让我的个人 C“在我自己的习惯和选择时接近于零”，这似乎足够接近了。如果我现在只想“喝”，我会尽量只喝水或牛奶。不总是。有时我发现自己很想喝橙汁，但我会先尝试吃其他类似的水果，然后再喝一杯美味可口的柠檬酸味糖水。在这一部分，所有的东西都有一个狩猎采集部落。我有点怀疑......", "note_en": "This is a summary of  a paper that I found open in a browser tab; I don&#39;t recall where I came across it. I think it&#39;s a nice paper, but it&#39;s also 63 pages long and seemed worth a synopsis for those who wouldn&#39;t otherwise tackle it.\n Scott concluded in  For, then Against, High-saturated-fat diets that the obesity crisis seemed to imply one of three answers:\n That weight less is really hard and people in previous centuries had really hard lives and that&#39;s why there was so little obesity back then.\n That it&#39;s “being caused by plastics or antibiotics affecting the microbiome or something like that”.\n  At the outset, there are reasons to be wary of this paper: neither author (who share a family name) appear to have expertise in applicable fields, and it appears to be set in Computer Modern Roman, hardly the style of a journal submission. So it&#39;s coming from outside of traditional expertise. (I don&#39;t have any expertise here either.)\n With that in mind, the paper starts by posing a series of challenging facts about obesity. (References in the original:)\n It&#39;s new. One hundred years ago obesity was very rare (~1% of the population) but there were plenty of people who had enough to eat and, from our point of view, ate a lot of fattening foods.\n It&#39;s not just new, it seemed to suddenly kick off around 1980. “Today the rate of obesity in Italy, France, and Sweden is around 20%. In 1975, there was no country in the world that had an obesity rate higher than 15%”.\n It&#39;s still getting worse. It&#39;s less in the news but if anything it&#39;s accelerating in the US. This is despite Americans significantly cutting back on sugars and carbs since 2000.\n It&#39;s not just humans: lab animals and wild animals appear to be getting fatter over time too. (A surprise to me, but casual inspection seems to confirm that this is really a thing that reviewed papers are noting.)\n Junk food from a supermarket fattens rats far more than giving them more of any macro-nutrient does. Somehow junk food is more than the sum of its sugars, proteins, and fats.\n  Diets produce modest reductions in weight over the span of weeks or months, but the weight comes back over time. There&#39;s been a  lot of searching for effective diets, but they&#39;re all about the same in large populations.\n  “It&#39;s from overeating!”, they cry. But controlled overfeeding studies (from the 1970&#39;s—pre-explosion) struggle to make people gain weight and they loose it quickly once the overfeeding stops. (Which is evidence against a hysteresis theory.)\n “It&#39;s lack of exercise”, they yell. But making people exercise doesn&#39;t seem to produce significant weight loss, and obesity is still spreading despite lots of money and effort being put into exercise.\n “It&#39;s from eating too much fat”, rings out. But Americans reduced their fat intake in response to messaging about the evils of fat some decades ago and it didn&#39;t help. Nor are low-fat diets very effective.\n “It&#39;s too much sugar / carbs”, you hear. But Americans reduced their sugar and (more generally) carb intakes over recent years and that didn&#39;t help either. Gary Taubes&#39;s study was a bit of a damp squib.\n In this section there&#39;s a hunter-gatherer tribe for everything. I&#39;m a little suspicious of this line of evidence because these small human populations could plausibly have evolved to tolerate their specific environment but, if you want a group of humans with zero-percent obesity who eat 60%+ carbs, or 60%+ fat, this paper has one for you. They have plenty of food, they just live happily and remain thin.\n Next the paper establishes that there is clearly some degree of homeostatic regulation of weight by the brain. You can damage a specific part of the brain and cause obesity. Or you can have a genetic flaw that results in fat cells not producing leptin, which results in an insatiable appetite. (But adding leptin to overweight people  doesn&#39;t work.)\n Now the paper presents its thesis: it&#39;s all caused by a subtle poison! Manufacture of which really took off slightly before 1980, and is increasing or is bio-accumulative. Diets don&#39;t work because it&#39;s not a diet problem. Supermarket food fattens rats much more than any macro-nutrient chow because supermarket food contains more of the contamination. Wild animals are getting fatter because they&#39;re consuming it too. Living at sea-level means that your water supply has traveled much further and picked up more of it, which is why altitude is anti-correlated with obesity.\n There are many drugs that cause weight gain and that appear to do so by acting on the brain, so these things can exist. This is hardly the first paper to suggest that certain chemicals contribute to the problem, but this paper is distinguishing itself by saying that it&#39;s the dominant factor.\n Three specific families of chemicals are detailed for consideration: antibiotics; per-, and poly-fluoroalkyls (PFAS); and lithium. All have ambiguous evidence.\n Antibiotics certainly make animals fatter, but do they do the same to humans in the amounts consumed? If so, why aren&#39;t places that use a lot in livestock fatter than those which use less? Why aren&#39;t vegan diets magic for weight loss?\n PFAS is a family of thousands of under-studied chemicals, but they doesn&#39;t clearly cause weight gain in humans at plausible levels. But they are certainly getting everywhere.\n Lithium clearly does cause weight gain in humans, but are the amounts that people are exposed to increasing, and they are large enough to cause weight gain?\n The paper also notes that things are even worse to think about because chemicals do complex things in the environment, and in animals. You don&#39;t just have to think about the chemicals that are made, you have to worry about everything they can become. The paper includes the example of a factory in Colorado that made “war materials” and released some chemicals into the ground around the factory. It took several years for the chemicals to travel through the ground water to farms several miles away. During that time they had reacted to form 2,4-D, a herbicide, which killed crops on those farms. (The unreacted chemicals were also pretty nasty.)\n Switching to speculation that should be blamed entirely on me, not the paper: it seems that there might be a tendency for any chemical that affects the regulation of adiposity to do so in the direction of obesity. There are several drugs that target the brain and cause weight gain, but fewer safe drugs that cause significant down regulation of weight. (If there were several such drugs, lots of people would be taking them.) Rather, drugs that cause weight loss often cause energy to be wasted from the body rather than changing the regulation of weight: DNP causing heat-loss, or SGLT2 inhibitors causing glucose excretion. Thus we might be facing a situation where multiple minor factors affect adipose regulation, but the overall effect is towards obesity because any effect tends to be in that direction.\n The obvious example of something that causes down-regulation of weight is smoking. (We wouldn&#39;t call it “safe” though.) I wonder whether the paper is overly focused on something that had a step change in prevalence shortly before 1980. It might have been building steadily in the prior decades but the  40%ish of American adults who smoked in the 60s/70s hid it for a while.\n If we were to hypothesise that some environmental factor is causing a significant fraction of the obesity problem then how would we test it? It could well be the sum of multiple factors, some of which may be carried in water given the correlation with elevation. It seems that one would need groups of overweight people willing to consume exclusively provided water (from distillation) and a source of food that is somehow pristine. The half-life of PFAS, at least, is measured in years in humans, so the subjects would have to remain compliant with this proscribed diet for extended periods of time. In order to have control groups we would have to (double-blind) contaminate the pristine food with environmentally-plausible levels of candidate chemicals, I guess? Would that get past any IRB? The paper contains easier experiments, like having Kuwait change its desalination process or, more reasonably, have a car-mechanic company change grease, but these would only produce partial answers unless we got lucky and one factor dominates.\n  The environmental hypothesis is primarily one of exclusion, and this paper makes a good case. (Although one should have significant epistemological humility about any complex technical argument outside of one&#39;s expertise.) And I haven&#39;t even covered it all! The paper continues with arguments about paradoxical reactions and the occurrence of anorexia! There is much more within if this summary piqued an interest.\n  If we were to hypothesise that some environmental factor is causing a significant fraction of the obesity problem then how would we test it?\n The statistical silver bullet you&#39;re looking for, assuming you can&#39;t run multi-decade RCTs or convince entire countries to dramatically change their water policies (sounds a bit tricky?), is  variance components analysis.\n You want a variance component analysis equivalent to heritability, but for water/obesity. This is a perfect match: you have a very high-dimensional measurement ( GC-MS of drinking water &amp; foodstuffs), whose components you can&#39;t observe because you don&#39;t even know how many there are much less which ones (like the unknown chemicals that the original contaminants may react into along the way**), where direct prediction/regression would fail because it requires absurd amounts of data (especially given the statistical issues they outline), and where your original research question is not &#34;where is the needle in the haystack&#34; but &#34;does this haystack have any needles at all&#34;.\n In behavioral genetics, if you plot pairs of people by their genetic similarity and their phenotypic similarity, you will find that people similar on both tend to cluster; and the more heritable the trait is, the more they cluster. You can do this for kinds of similarity which aren&#39;t &#39;genetic&#39;. The idea of variance components is to switch from directly correlating/regressing the specific chemical levels in water, trying to measure the exact direct effect of each chemical on obesity, to instead asking, &#34;how similar, in terms of overall water chemical composition, are similarly far or thin people? Do the chemical spectrums of fat people tend to look similar, and the spectrums of thin people look similar? Do they co-vary, and cluster?&#34;\n Think of the water GC-MS as a sort of fingerprint or high-dimensional summary. It doesn&#39;t need to contain the actual critical datapoint, just a lot of correlates/proxies thereof (eg you can just  shine some light on leaves and it&#39;ll work!). The point is not to directly measure the culprit, but to indirectly measure how distant the datapoints are; perhaps chemical A shows up and chemical B does not show up clearly, and B is the real cause, but as long as chemical A correlates with chemical B (maybe it&#39;s a different reaction product, or just gets manufactured or used in close correlation with B), then you will see that fatties tend to have close-together water spectra (because of A) and you will have strong evidence that &#34;there is  something in the water&#34; because where the bad water clusters the fatties cluster.\n So, you&#39;d do something like record the BMI of 10,000 people, take a sample of their drinking water, GC-MS it (ideally, but many other analytical techniques could be used and maybe some would be better here, I&#39;ll defer to any actual analytical chemists on that topic), and then plug into a mixed linear-model. You can plug in covariates as necessary (families/pedigrees to jointly model genetic heritability, ZIP codes, age, sex, local mining/factories, already known harmful contaminants the GC-MS detected, that sort of thing). This can be done at multiple levels: individuals nested in households, within regions, within countries, etc. The amount of covariance between the water spectrum and BMI measures the amount of variance the contents of the water en masse can explain, and depending on measurement error and whatnot, given the genetic heritability bounding how much water-heritability can explain, you should get somewhere &lt;30%. Under most theories of obesity, it&#39;s difficult to see why one would predict a water-heritability different from 0%*, especially if one has already included altitude/SES/household/region as covariates (which should cover all the obvious confounders like &#34;maybe contaminated water is just a proxy for living in a poor region / having mining nearby / being poor&#34;), so anything &gt;0% is highly suspicious.\n This doesn&#39;t require any RCTs (or interventions of any kind), longitudinal datasets,  n in the millions, or any of the barriers to most of the proposed tests. You only need a cross-section of obesity/water-samples. Individual level is ideal, but doing it with geographic units can be useful too if that is what is available across enough units (individual  n are much nosier than  k, but also much easier to get high statistical power with). This may even already exist! Drinking water is often tested for many reasons, and obesity health data is standard medical data collected in almost any relevant research; so there ought to be a lot of possible cross-references.\n * you could do this with food as well but I focus on water because water is a lot more consistent day to day, and food results would be ambiguous. A single day&#39;s food is still not very representative of individual consumption (maybe your wife cooks healthy at home but then you eat processed garbage at the office, and the sample comes from the weekend), so it provides a very poor measurement of the overall diet&#39;s chemical signature. And if you demonstrated a large food-heritability of obesity, this would just be taken as proving that &#34;see? sugar / fat / calories / highly-palatable processing causes everything, just like we said all along!&#34;, and be weak evidence for contamination at best.\n ** They also raise the problem of interactions &amp; nonlinear responses. These are issues in behavioral genetics too, of course, with dominance/epistasis particularly, and can be dealt with similarly in the water context: &#34;narrowsense&#34; vs &#34;broadsense&#34; heritability covers simple additive vs interactions, and you can do things like DeFries-Fulker, I think, for nonlinear responses. My guess is that contamination would be &#39;additive&#39; mostly, for similar underlying reasons as genetics tends to be &#39;additive&#39;: many interactions are just constants because they are done on a fixed background of chemistry, and promiscuous interactions average out to additive effects. But this is the sort of thing to worry about only after having done the straightforward work.\n Have you ever seen or even heard of a person who is obese who doesn&#39;t eat hyperpalatable foods? (That is, they only eat naturally tasting, unprocessed, &#34;healthy&#34; foods).\n This seems like the occam&#39;s razor expanation to me. Some of our new flavour/texture combinations are so rewarding that they easily overcome the natural stop signals, leading to excess caloric consumption in most (to a variable degree), which leads to weight gain in some.\n A study which gave its participants a 1000cal/day dietary surplus found while some participants gained 14kg of fat over the course of the study (I think it was for 3 months), others gained as little as 4kg. As one would expect, there is genetic variance in one&#39;s vulnerability to the effects of a harmful caloric surplus, and there is probably also genetic variance in one&#39;s susceptability to hyperpalatable foods.\n The study I would like to see is giving obese people unlimited access to only natural foods for 3 months. They could add salt and spices, but no oil and definitely no sugar. The diet would be lean(ish) meats, fruits, vegetables and legumes (unsure if allowing nuts is a good idea as they&#39;re extremely calorie dense, but technically they should be allowed under this definition).\n I would be surprised if this didn&#39;t work. Under this model I view hyperpalatble foods as equivalent to an addictive drug for obese people. Just as if you have a poor phenotype for alcoholism, you should avoid alcohol altogether, if you have a poor phenotype for the overconsumption of hyperpalatable foods, and a poor phenotype for the conversion of those extra calories into fat, you should avoid hyperpalatble foods.\n The altitude correlation would seem to suggest drinking water in particular as a culprit, and suggests a simple and straightforward study that would settle the question once and for all: randomize a group of households to either receive reverse osmosis filters on their taps, or not, then track whether the people in those households become obese.\n I checked whether this study has been performed, and as far as I can tell, it hasn&#39;t. There have been studies that randomly installed reverse osmosis filters, but they were checking for something else and didn&#39;t track peoples&#39; weight.\n Another effect of altitude is the atmosphere, and  there is evidence that the active ingredient in altitude decreasing weight is the thin atmosphere. For example, &#34; One study on rats found that they ate 58% less one day after being transported to Pike’s Peak, and were still eating 16% less per day two weeks afterwards.&#34; The immediate effect strongly suggests that it&#39;s not caused by anything in the water source.\n See page six of the paper for the authors dealing with this point. It&#39;s certainly a potential explanation, but the map of obesity in the US does seem to suggest that being, say, at the mouth of the Mississippi basin is much worse than being on the west coast, despite them both being at sea level.\n Reverse osmosis filters will already be more common in some places that have harder water (and decided that softening it at the municipal level wouldn&#39;t be cost-effective). If there was fine grained data available about water hardness and obesity levels, that might provide at least a little signal.\n Oh, huh -- looks like this paper is the summary of the  blog series that &#34;Slime Mold Time Mold&#34; has been written about it? Guess I can read this paper to skip to the end, since not all of it is posted yet. :P\n Adderall (and other similar stimulants) are known to suppress appetites. They&#39;re not a great choice to prescribe as an appetite suppressant, due to their major other effects and since it doesn&#39;t seem to affect everyone, but they do work.\n For a while I had a theory that &#34;sugar in a beverage not paired with bulky food&#34; added calories without the human brain/whatever noticing and having the satiety mechanism(s?) kick in when the right calorie consumption level was hit. The archetypal study here would involve carefully measuring how many calories like this, C, that a person consumed per week, and then C/3500 is how many pounds per week they should gain over time.\n I dunno if this is true, but it seemed close enough to likely to be true that I started rejiggering my habits and feelings about food to try to get my personal C &#34;close to zero when left to my own habits and choices&#34;. If I&#39;m just going to &#34;drink&#34; now, I try to basically only drink water or milk.  Not ALWAYS. Sometimes I find myself craving orange juice, but I try to eat other similar fruits first, before I fall back to a cup of delicious delicious citric acid flavored sugar water.\n In this section there&#39;s a hunter-gatherer tribe for everything. I&#39;m a little suspic\n......", "posttime": "2021-07-26 04:18:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "污染,theory,导致", "title": "肥胖流行的污染理论", "title_en": "A Contamination Theory of the Obesity Epidemic", "transed": 1, "url": "https://www.lesswrong.com/posts/6miu9BsKdoAi72nkL/a-contamination-theory-of-the-obesity-epidemic", "via": "", "real_tags": ["污染", "theory", "导致"]}, {"category": "", "categoryclass": "", "imagename": "718c6e76a7ff1253ffa17253c00ecd3f.jpg", "infoid": 1069715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "打击数量有限的“超排放”发电厂可能会大幅减少全球发电产生的碳排放量。科罗拉多大学博尔德分校的 Don Grant 和他的同事梳理了 221 个国家/地区 29,000 多个化石燃料发电厂的清单，以确定截至 2018 年世界上最大的污染者。最严重的违规者提高了效率，改用低碳燃料或实施了碳捕获技术。研究小组发现，极端排放者——在气候污染方面排在前 5% 的发电厂——占全球发电排放量的 73%，而且效率往往低于本国的平均发电厂。该团队的计算表明，如果这些污染者提高效率以达到全球平均水平，排放量将下降约 25%。将他们的燃料来源从煤炭或石油转向天然气可以将全球排放量减少近 30%，而实施碳捕获技术可以将排放量减少近一半。研究人员认为，针对世界上的超级污染者可能会产生不成比例的国家和全球利益。", "note_en": "A crackdown on a limited number of ‘hyper-emitting’ power plants could yield outsize cuts in the carbon emissions resulting from global electricity generation.\n Don Grant and his colleagues at the University of Colorado Boulder, combed an inventory of more than 29,000 fossil-fuel power plants across 221 countries to identify the world’s largest polluters as of 2018. They then calculated the potential emissions reductions that could be attained if the worst offenders boosted their efficiency, switched to lower-carbon fuels or implemented carbon-capture technologies.\n The team found that extreme emitters — power plants that ranked in the top 5% in terms of climate pollution — were responsible for 73% of global emissions from electricity generation, and tended to be less efficient than average power plants in their home countries. The team’s calculations suggest that emissions would fall by roughly 25% if those polluters boosted their efficiency to match the global average. Switching their fuel source from coal or oil to natural gas could cut global emissions by almost 30%, and implementing carbon-capture technologies could cut emissions nearly in half.\n Targeting the world’s super polluters could yield disproportionate national and global benefits, the researchers argue.", "posttime": "2021-07-26 03:32:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "排放量,power,全球", "title": "世界上仅 5% 的发电厂就占了近 75% 的碳排放量", "title_en": "Just 5% of world’s power plants account for almost 75% of carbon emissions", "transed": 1, "url": "https://www.nature.com/articles/d41586-021-01983-z", "via": "", "real_tags": ["排放量", "power", "全球"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ttfautohint 提供了一个 99% 的自动化提示过程和一个用于精细手工提示最后 1% 的平台。它是网页字体的理想选择，并支持多种文字：拉丁文、希腊文、阿拉伯文、梵文、希伯来文、高棉文、缅甸文、泰文等等。另一个错误修复版本，版本 1.8.3，纠正了具有复杂轮廓的字形可能出现的失真。蒙古语支持已作为新功能添加今天我发布了一个错误修复版本，版本 1.8.2，主要是为了让 ttfautohintGUI 在自制软件上再次编译。然而，格鲁吉亚用户可能会感到高兴，因为唯一的新功能是对 Mtavruli 的支持，该功能最近已添加到 Unicode 11。新的一年从新的 ttfautohint 版本开始，版本 1.8.1！ （由于公开标记 git 存储库后发现了严重的配置错误，因此未发布 1.8 版。）其主要新功能是第三种词干宽度和定位模式，“自然”：不调整词干宽度，离散蓝色区域定位。这就是 FreeType 用于其“轻”（自动）提示模式的内容。另一个重要的改进是可以手动覆盖提示过程的词干宽度。这对于超粗字体特别有用，其中算法派生的值通常太大，导致在像“e”或“a”这样的字形中填充小尺寸的“眼睛”。最后，ttfautohint 现在也作为库安装（如果您使用 Unix 工具链进行构建和安装）。此版本主要支持一系列新脚本：Adlam、Avestan、Bamum、Buhid、Unified Canadian Syllabics、Carian、Chakma、Coptic、Cypriot、Deseret、Glagolitic、Gothic、Kayah Li、Lisu、N&#39;Ko、Ol Chiki、 Old Turkic、Osage、Osmanya、Saurashtra、Shavian、Sundanese、Tai Viet、Tifinagh、Vai——非常感谢 Sascha Brawer 贡献了大部分代码！\n期待已久的 1.6 版本终于出来了！它的主要新功能是支持参考文件，所有蓝色区域值都来自该文件。除此之外，还添加了大量新文字：亚美尼亚语、切诺基语、埃塞俄比亚语、格鲁吉亚语、古吉拉特语、古尔穆基语、卡纳达语、马拉雅拉姆语、僧伽罗语和泰米尔语。我刚刚发布了 1.5 版，它主要支持一些新脚本：高棉语、缅甸语和孟加拉语（以及下一个版本中将出现的更多印度语脚本）。有关其他更改和错误修复的信息可以在发行说明中找到。由于将控制指令应用于类似重音的字形时存在严重错误，因此有必要发布 1.4.1 版（不包含其他值得注意的更改）。所有用户都应该升级。 1.4 版出来了！它现在支持提示为老挝语、泰语和阿拉伯语等提供字形的字体。它还修复了控制指令文件中使用的“touch”关键字的烦人小问题。我已经发布了 1.3 版。除了支持泰卢固语外，还有一个新工具可以并行测试 ttfautohint 的参数。从昨天开始，1.2 版可供下载。最重要的变化是在低级别微调提示过程的新可能性。 1.1 版现已推出。主要的新功能是支持梵文脚本——请测试！如果您需要提示 GDI ClearType，您应该升级到这个版本，因为一些与词干宽度计算相关的错误已被识别和修复。像往常一样，可以在此处找到重要更改的完整列表。\nttfautohintGUI 1.00 版的 Windows 二进制文件无法按预期独立运行。请重新下载（新的 .7z 存档日期为 26-Mar-2014，大小为 3278316 字节）。终于，期待已久的 1.0 版本来了！与 1.00rc1 版本相比，内存管理得到了改进，以避免在某些情况下过度分配。对符号字体的支持也已得到修复。如前所述，GDI ClearType 提示现在要好得多。但是，我错过了显示比较图像，现在我这样做了。顶部和底部图像（显示使用 ttfautohint 处理的 Ubuntu 常规图像）分别是旧版本和当前版本的 ttfautohint 的输出。 Werner Lemberg 使用 ttfautohint 使字体设计师可以轻松创建在 Windows 上看起来很棒的 Web 字体。提示 TrueType 字体可能是一个缓慢而昂贵的过程，许多字体完全缺乏良好的提示，因为它们是从另一种字体格式转换为 TrueType 的。 ttfautohint 通过建立在 FreeType 的自动提示系统上解决了这个问题。它为不使用 FreeType 的平台带来了 FreeType 渲染的卓越品质，但需要提示文本才能看起来不错——比如 Microsoft Windows。在当今的 Windows 渲染环境中，ttfautohint 字体在启用 DirectWrite ClearType 的情况下看起来最好。这是 Windows 7 和更新版本的默认设置。在最近使用 FreeType 进行渲染的 MacOS X 版本和 GNU/Linux 系统中也可以看到良好的视觉效果。\n该项目的主要部分是一个代码库，libttfautohint，这里描述。有具有命令行和 GUI 界面的实用程序，可以立即使用。该项目的目标是生成“第一遍”，暗示字体开发人员可以进一步改进以获得最终质量。上面的动画显示了 ttfautohint 创建的提示如何使用 FontForge 的 TrueType 提示字节码调试器以每 em 19 像素的速度应用于 Liberation Serif Regular 的美元字形。 （您可以直接查看图像以原始尺寸查看。）该项目始于 2010 年，当时 Dave Crossland 提出了该程序的想法。由于 Google Web Fonts 团队的财政支持，Werner 能够开始开发。对于字体设计师来说，提示 TrueType 字体是一个非常耗时且昂贵的过程。为字体中的大多数字形生成高质量的提示，并允许他们手动微调结果将简化所有字体设计师的生活。这个小程序旨在提高网页排版的质量！源代码存储库中的 TODO 文件提供了最终将以一种或另一种方式处理的内容的广泛列表。以下是基本项目的简短列表： 改进微调结果的方式——您已经可以控制蓝色区域和词干宽度以及 delta 指令和提示过程的其他细节，但肯定有一些方面可以改进更远。如果您对此功能有任何反馈意见，请发送电子邮件至 Werner Lemberg。\n为其他工具添加钩子 - 允许与各种字体编辑器平滑集成。其中一些已经支持直接调用 ttfautohint，但还有更多工作要做，尤其是微调蓝色区域等。以高级提示命令语言发出操作 - 其他工具中使用的操作，例如 Visual TrueType (VTT) 或 FontLab，而不是仅发出最终的低级字节码。这将允许设计师手动微调结果——对于那些需要人类智能决策的棘手字形至关重要。已故的 Vernon Adams 帮助提供了比较图像，测试了不同平台上各种浏览器的输出。为此，他使用了他出色的框架来测试浏览器字体。其中一些如下所示。您应该在没有任何缩放的情况下查看图像，以便您的浏览器不会重新缩放它们。 Ubuntu 常规、Windows DirectWrite ClearType（由 Firefox 在 Windows 7 上呈现）。保留原始的手动提示，右使用 ttfautohint 应用的提示：Ubuntu 常规、GDI ClearType（由 Windows 7 上的 Chrome 呈现）。左边是原始的手动提示，右边是 ttfautohint 应用的提示：Bitstream Vera Sans、Windows DirectWrite ClearType（由 Firefox 在 Windows 7 上呈现）。左边是原始的手动提示，右边是 ttfautohint 应用的提示：\nBitstream Vera Sans、GDI ClearType（由 Windows 7 上的 Chrome 渲染）。左边是原始的手动提示，右边是 ttfautohint 应用的提示：DroidSerif Regular、Windows DirectWrite ClearType（由 Firefox 在 Windows 7 上呈现）。左边是原始的手动提示，右边是 ttfautohint 应用的提示：DroidSerif Regular、GDI ClearType（在 Windows 7 上由 Chrome 渲染）。左边是原来的手动提示，右边是ttfautohint应用的提示：最后，这里是上面示例中使用的字体文件，以便您可以自己比较提示结果。请注意，字体是使用 ttfautohint 的 1.00rc1 版本生成的（使用默认设置）；他们还使用 ttx 手动编辑以更改字体名称，以便可以并行使用原始版本和使用 ttfautohint 处理的版本。最近，Jasper de Waard 完成了他的 Proza Libre 字体系列，使用 ttfautohint 进行提示，他在博客和视频中记录了这一点。 Matt Wiebe 使用 ttfautohint 的早期版本测试了 VAG Rounded 字体；他在他的博客上展示了结果。\n可以在此处找到 FreeType 中自动提示的详细说明。尽管这些网页需要更新，但自动提示过程的基本原理并没有改变。有一个例外：自动提示不再尝试为单色光栅化提供良好的提示。相反，它期望具有 256 级灰度的抗锯齿，这已成为 Windows 98 的标准。 EuroTeX 2003 会议录中发表的一篇学术论文，题为实时网格拟合的排版轮廓，进一步深入了解自动提示系统的内部工作原理.在上面的链接中，缺少自动提示过程的一个方面：自动提示执行的各个步骤（称为操作）可以描述为高级操作，例如“将给定的边缘与给定的蓝色区域对齐，”或“将这条边与给定距离内的另一条边连接起来。” ttfautohint 库与这些操作挂钩，并将它们转换为字节码例程。与大多数 TrueType 提示类似，自动提示操作取决于设备分辨率。因此，ttfautohint 遍历大范围的 ppem 值（默认为 8 到 50 ppem）并将操作作为集合收集。一个典型的字形轮廓需要三到四组（覆盖整个范围），但有时需要超过十组。 ttfautohint 特意仅沿 y 轴添加提示。 Anti-Grain 研究描述了这一决定背后的一些原因。虽然文章很旧，但提到的想法仍然有效。 ttfautohint 库包含 FreeType 的“autofit”模块的副本，重新格式化并使用不同的函数前缀，并略微扩展了挂钩到提示操作的功能。因此，它继承了与 FreeType 相同的双重许可；您可以在 GNU 公共许可证 (GPL) 第 2 版和 FreeType 许可证 (FTL) 之间进行选择。 Werner Lemberg (wl@gnu.org) 是技术主管，负责所有的编程工作。他是一位专业的古典音乐家，现居奥地利维也纳。\nDave Crossland (dave@understandingfonts.com) 是项目经理，他撰写并指导了本页顶部的宣传视频。他是一名专业字体设计师，住在英国伦敦。 Andy Ellis (hello@fadeinfadeout.co.uk) 设计并制作了宣传视频。他是一名专业的动态图形设计师，住在英国伦敦。这些独立版本的 ttfautohint 和 ttfautohintGUI 没有任何依赖关系，可以在解压缩存档后直接运行。 Apple ttfautohint 1.8.3 – 目前仅限命令行；感谢 Karsten Lücke 创造了这个！这个适用于 i386 和 x86_64 架构的通用二进制文件已在 OS X 10.5.8 下编译，并且也应该在较新的版本上运行。阅读此页面如何获取 GUI 版本。 ttfautohint 的最新源包，包括 HTML、PDF 和文本格式的文档，可以从 Savannah 或 SourceForge 下载。该文档也可在线获取。所有开发都在公共 git 存储库中进行；有关详细信息，请参阅 repo.or.cz 存储库主页。注意：编译库的先决条件是 FreeType 2.4.5 或更新版本和 HarfBuzz 1.3.0 或更新版本；有关更多信息，请参阅 FreeType 的下载页面和 HarfBuzz 的下载页面。", "note_en": "ttfautohint provides a 99% automated hinting process and a platform for finely hand-hinting the last 1%. It is ideal for web fonts and supports many scripts: Latin, Greek, Arabic, Devanagari, Hebrew, Khmer, Myanmar, Thai, and many more.\n     Another bug fix release, version 1.8.3, correcting possible distortions for glyphs with complicated outlines. Mongolian support has been added as a new feature\n      Today I&#39;m releasing a bug fix release, version 1.8.2, mainly to make ttfautohintGUI compile again on homebrew. Georgian users might rejoice, however, since the only new feature is support of Mtavruli, which has been added recently to Unicode 11.\n      The new year starts with a new ttfautohint release, version 1.8.1! (Version 1.8 was not released due to a serious configuration bug found after publicly tagging the git repository.) Its main new feature is a third stem width and positioning mode, ‘natural’: No adjustments to stem widths, discrete blue zone positioning. This is what FreeType uses for its ‘light’ (auto-)hinting mode.\n  Another important improvement is the possibility to manually override stem widths for the hinting process. This is especially useful for extra-bold fonts, where the algorithmically derived values are often too large, causing the filling of ‘eyes’ in glyphs like ‘e’ or ‘a’ at small sizes.\n  Finally, ttfautohint gets now installed as a library also (if you use the Unix toolchain for building and installation).\n      This release mainly brings support for a bunch of new scripts: Adlam, Avestan, Bamum, Buhid, Unified Canadian Syllabics, Carian, Chakma, Coptic, Cypriot, Deseret, Glagolitic, Gothic, Kayah Li, Lisu, N&#39;Ko, Ol Chiki, Old Turkic, Osage, Osmanya, Saurashtra, Shavian, Sundanese, Tai Viet, Tifinagh, Vai – many thanks to Sascha Brawer who contributed most of the code!\n      The long overdue version 1.6 is finally out! Its main new feature is the support of a reference file from which all blue zone values are taken. Besides that, a large bunch of new scripts has been added: Armenian, Cherokee, Ethiopic, Georgian, Gujarati, Gurmukhi, Kannada, Malayalam, Sinhala, and Tamil.\n        I&#39;ve just released version 1.5, which mainly brings support for some new scripts: Khmer, Mynamar, and Bengali (and more Indic scripts to come in the next release). Information on other changes and bugfixes can be found in the  release notes.\n    Due to a serious bug in applying control instructions to accent-like glyphs, it was necessary to release version 1.4.1 (containing no other noteworthy changes). All users should upgrade.    Version 1.4 is out! It now supports hinting for fonts providing glyphs for Lao, Thai, and Arabic, among other things. It also fixes an annoying buglet for the ‘touch’ keyword as used in control instructions files.\n      I&#39;ve released version 1.3. Besides support for Telugu, there is a new facility for testing parameters of ttfautohint in parallel.\n      Since yesterday, version 1.2 is available for download. The most important change is a new possibility to fine-tune the hinting process at a low level.\n      Version 1.1 is now available. The main new feature is support for the Devanagari script – please test!\n  In case you need hinting for GDI ClearType, you should upgrade to this version, since some bugs related to stem width computation were identified and fixed. As usual, the complete list of important changes can be found  here.\n    The Windows binary of ttfautohintGUI version 1.00 didn&#39;t work standalone, as intended. Please download it again (the new  .7z archive has 26-Mar-2014 as the date and a size of 3278316 bytes).\n      Finally, the long-awaited version 1.0 is here! Compared to the 1.00rc1 release, the memory management has been improved to avoid excessive allocation under certain circumstances. Support for symbol fonts has been fixed also.\n  As mentioned earlier, GDI ClearType hinting is now much better. However, I missed to show comparison images, which I now do. The top and bottom images (showing Ubuntu regular processed with ttfautohint) are the output of an older and the current version of ttfautohint, respectively.\n   Werner Lemberg is making it easy for type designers to create web fonts that look great on Windows, with  ttfautohint.\n  Hinting TrueType fonts can be a slow and expensive process, and many fonts lack good hinting totally because they are converted to TrueType from another font format.\n  ttfautohint solves this, by building on  FreeType&#39;s auto-hinting system. It brings the excellent quality of FreeType rendering to platforms which don&#39;t use FreeType, yet require hinting for text to look good – like Microsoft Windows.\n  Across Windows rendering environments today,  ttfautohint fonts look best with DirectWrite ClearType enabled. This is the default for Windows 7 and newer. Good visual results are also seen in recent MacOS X versions and GNU/Linux systems that do use FreeType for rendering.\n  The main part of the project is a code library,  libttfautohint, which is described in  here. There are utility programs with both command-line and GUI interfaces,  ready to use today.\n  The goal of the project is to generate a ‘first pass’ of hinting that font developers can refine further for ultimate quality.\n    The animation above shows how the hints created by  ttfautohint get applied to the dollar glyph of  Liberation Serif Regular at 19 pixels per em, using  FontForge&#39;s TrueType hinting bytecode debugger. (You can view the image  directly to see it in original size.)\n   The project started in 2010 when  Dave Crossland suggested the idea of the program. Werner was able to start development thanks to financial support from the  Google Web Fonts team.\n    Hinting TrueType fonts is a very time consuming and expensive process for type designers. Producing high quality hinting for most glyphs in a font, and allowing them to fine-tune the results by hand will simplify the lives of all type designers. This little program is set to improve the quality of web typography!\n  The   TODO file in the source code repository provides an extensive list of things which will be eventually handled in one or another way. Here is a short list of essential items:\n  Improve the way you can fine-tune the results – you can already control blue zones and stem widths together with delta instructions and other details of the hinting process, but there are certainly aspects that could be improved further. If you have feedback for this feature, please send an e-mail to  Werner Lemberg.\n  Add hooks for other tools – to allow smooth integration with various font editors. Some of them already support a direct call of ttfautohint, but more has to be done, especially for fine-tuning blue-zones and the like.\n  Emit the actions in the high-level hinting command languages – those used in other tools, such as  Visual TrueType (VTT) or  FontLab, instead of only emitting final low-level bytecode. This will allow designers to fine tune the results by hand – essential for those tricky glyphs that require intelligent decisions by a human\n   The late  Vernon Adams helped in providing comparison images, testing the output of various browsers on different platforms. For this purpose, he used his excellent  framework for testing browser fonts. Some of them are shown below.\n  You should look at the images without any zoom so that your browser doesn&#39;t rescale them.\n  Ubuntu Regular, Windows DirectWrite ClearType (as rendered by Firefox on Windows 7). Left the original, manual hinting, right the hinting applied by  ttfautohint:\n    Ubuntu regular, GDI ClearType (as rendered by Chrome on Windows 7). Left the original, manual hinting, right the hinting applied by  ttfautohint:\n    Bitstream Vera Sans, Windows DirectWrite ClearType (as rendered by Firefox on Windows 7). Left the original, manual hinting, right the hinting applied by  ttfautohint:\n    Bitstream Vera Sans, GDI ClearType (as rendered by Chrome on Windows 7). Left the original, manual hinting, right the hinting applied by  ttfautohint:\n    DroidSerif Regular, Windows DirectWrite ClearType (as rendered by Firefox on Windows 7). Left the original, manual hinting, right the hinting applied by  ttfautohint:\n    DroidSerif Regular, GDI ClearType (as rendered by Chrome on Windows 7). Left the original, manual hinting, right the hinting applied by  ttfautohint:\n    Finally, here the font files used in the samples above so that you can compare the hinting results by yourself.\n    Note that the fonts were generated with version 1.00rc1 of  ttfautohint (using default settings); they were also manually edited with  ttx to change the font names so that it is possible to use the original versions and the versions processed with  ttfautohint in parallel.\n  Recently, Jasper de Waard completed his  Proza Libre font family, using ttfautohint for hinting, which he documented both in a  blog and a video.\n    Matt Wiebe has tested the font   VAG Rounded with a very early version of  ttfautohint; he presents the results on his  blog.\n   A detailed description of the auto-hinter inside FreeType can be found  here. Although these web pages are in need of an update, the basic principles of the auto-hinting process haven&#39;t changed. There is one exception: The auto-hinter no longer tries to provide good hinting for monochrome rasterization. Instead, it expects anti-aliasing with 256 gray levels, which became standard with Windows 98.\n  A scholarly paper published in the EuroTeX 2003 proceedings, titled   Real-Time Grid Fitting of Typographic Outlines, gives further insight into the auto-hinting system&#39;s inner workings.\n  In the above links, one aspect of the auto-hinting process is missing: The various steps performed by the auto-hinter (called  actions) can be described as high-level operations, for example “aligning a given edge to a given blue zone,” or “linking this edge to another one within a given distance.” The  ttfautohint library hooks into these actions and transforms them into bytecode routines.\n  Similar to most TrueType hints, the autohint actions depend on the device resolution. Consequently,  ttfautohint walks over a large range of ppem values (8 to 50 ppem by default) and collects the actions as sets. A typical glyph outline needs three to four sets (covering the whole range), but sometimes more than ten are necessary.\n  Intentionally,  ttfautohint adds hints only along the y-axis. The  Anti-Grain research describes some of the reasons behind this decision. While the article is quite old, the mentioned ideas are still valid.\n  The  ttfautohint library contains a copy of FreeType&#39;s ‘autofit’ module, reformatted and using a different function prefix, and with slight extensions for hooks into hinting actions. It therefore inherits the same dual-licensing as FreeType; you can choose between the GNU Public License (GPL) Version 2 and the FreeType License (FTL).\n   Werner Lemberg ( wl@gnu.org) is Technical Lead, and does all the programming. He is a professional classical musician and lives in Vienna, Austria.\n  Dave Crossland ( dave@understandingfonts.com) is the Project Manager, and wrote and art directed the promotional video at the top of this page. He is a professional type designer and lives in London, England.\n  Andy Ellis ( hello@fadeinfadeout.co.uk) designed and produced the promotion video. He is a professional motion graphic designer and lives in London, England.\n   These stand-alone versions of ttfautohint and ttfautohintGUI don&#39;t have any dependencies and can be run directly after uncompressing the archive.\n    Apple    ttfautohint 1.8.3 – currently command line only; thanks to Karsten Lücke for creating this! This universal binary for the i386 and x86_64 architectures has been compiled under OS X 10.5.8 and should run with newer versions also. Read  this page how to get the GUI version.\n    The latest source package of  ttfautohint, including documentation in HTML, PDF, and text format, can be downloaded either from  Savannah or from  SourceForge.\n  The documentation is available  online also.  All development takes places within a public git repository; see the  repo.or.cz repository homepage for details.\n  Note: Prerequisites for compiling the library is FreeType version 2.4.5 or newer and HarfBuzz version 1.3.0 or newer; see  FreeType&#39;s download page and  HarfBuzz&#39;s download page for more information.", "posttime": "2021-07-26 03:31:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,font,提示", "title": "Ttfautohint – 99% 的自动化字体提示过程", "title_en": "Ttfautohint – a 99% automated font hinting process", "transed": 1, "url": "https://www.freetype.org/ttfautohint/", "via": "", "real_tags": ["字体", "font", "提示"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "*最低系统要求保证能够以 60fps 无延迟地玩所选游戏。图形处理单元：AMD Radeon R9 280 | NVIDIA GeForce GTX 760 (Windows 10) | NVIDIA GeForce GTX 1050 (Windows 7) 或更好。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。图形处理单元：NVIDIA GeForce GTX 670 | NVIDIA GeForce GTX 1650 | AMD Radeon HD 7950。*最低系统要求保证能够以 60fps 无延迟地玩所选游戏。图形处理单元:: Geforce 970 或 Geforce 1060 | Radeon R9 290X 或 Radeon RX 480，4GB RAM\n*最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。\n图形处理单元：AMD Radeon R9 280 | NVIDIA GeForce GTX 760 (Windows 10) | NVIDIA GeForce GTX 1050 (Windows 7) 或更好。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。图形处理单元：NVIDIA GeForce GTX 670 | NVIDIA GeForce GTX 1650 | AMD Radeon HD 7950。*最低系统要求保证能够以 60fps 无延迟地玩所选游戏。图形处理单元:: Geforce 970 或 Geforce 1060 | Radeon R9 290X 或 Radeon RX 480，4GB RAM *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。\n*最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。 *最低系统要求保证能够以 60fps 无延迟地玩所选游戏。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。\nAlienware 最先进的基于英特尔的中塔式游戏台式机，配备全新的第 11 代英特尔® 酷睿™ 处理器，可提供无与伦比的性能。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。如果购买余额未在 12 个月内全额支付，将从交易发布之日起向您的账户收取利息。如果在 12 个月内全额支付 799 美元以上，则无需支付利息^ 如果在 12 个月内未全额支付购买余额，将从交易发布之日起向您的帐户收取利息。如果购买余额未在 12 个月内全额支付，将从交易发布之日起向您的账户收取利息。如果购买余额未在 12 个月内全额支付，将从交易发布之日起向您的账户收取利息。如果购买余额未在 12 个月内全额支付，将从交易发布之日起向您的账户收取利息。\n由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。由于加利福尼亚州、科罗拉多州、夏威夷州、俄勒冈州、佛蒙特州或华盛顿州采用的电力消耗法规，本产品无法运送到这些州。任何针对这些州的订单都将被取消。如果购买余额未在 12 个月内全额支付，将从交易发布之日起向您的账户收取利息。如果购买余额未在 12 个月内全额支付，将从交易发布之日起向您的账户收取利息。", "note_en": "*The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  Graphics Processing Unit:\r  AMD Radeon R9 280 | NVIDIA GeForce GTX 760 (Windows 10) | NVIDIA GeForce GTX 1050 (Windows 7) or better.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  Graphics Processing Unit:\r  NVIDIA GeForce GTX 670 | NVIDIA GeForce GTX 1650 | AMD Radeon HD 7950.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  Graphics Processing Unit::\r  Geforce 970 or Geforce 1060 | Radeon R9 290X or Radeon RX 480, 4GB RAM\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  Graphics Processing Unit:\r  AMD Radeon R9 280 | NVIDIA GeForce GTX 760 (Windows 10) | NVIDIA GeForce GTX 1050 (Windows 7) or better.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  Graphics Processing Unit:\r  NVIDIA GeForce GTX 670 | NVIDIA GeForce GTX 1650 | AMD Radeon HD 7950.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  Graphics Processing Unit::\r  Geforce 970 or Geforce 1060 | Radeon R9 290X or Radeon RX 480, 4GB RAM\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n  *The minimum system requirements guarantees the ability to play the selected game at 60fps without lag.\n          This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n  This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n  Alienware’s most advanced Intel-based mid-tower gaming desktop featuring the new 11th Gen Intel® Core™ processor for unmatched performance.\n  This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n    Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.\n  No interest if paid in full within 12 mos on purchases $799+^ \r     Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.\n  Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.\n  Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.\n  Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.\n     This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n  This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n  This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n  This product cannot be shipped to the states of  California, Colorado, Hawaii, Oregon, Vermont or Washington due to power consumption regulations adopted by those states. Any orders placed that are bound for those states will be canceled.\n    Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.\n  Interest will be charged to your account from the transaction posting date if the purchase balance is not paid in full within 12 mos.", "posttime": "2021-07-26 03:31:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pc,shipped,支付", "title": "由于耗电，PC 无法运送到 CA、CO、HI、OR、VT 或 WA", "title_en": "PC can't be shipped to CA, CO, HI, OR, VT or WA due to power consumption", "transed": 1, "url": "https://www.dell.com/en-us/shop/gaming-and-games/cp/game?~ck=mn", "via": "", "real_tags": ["pc", "shipped", "支付"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1069712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你 40 岁的时候回到“软件工程师”/“全栈网络开发”游戏是一件很麻烦的事情，因为你在 15 多年前的成长过程中做得很好。经过一年的自欺欺人，加上我所有复杂的坏习惯、糟糕的生活方式选择以及超出马斯洛需求层次基础的几次复发，我知道我需要做点什么才能再次赚钱。 15 年前，我在 Web 开发/设计方面的经历与现在大不相同。在静态 html、Macromedia Flash、iframes 以及一切/无网站、网络圈和青春活力的时代长大，我能够比其他人获得优势。我可以无休止地使用 Flash 和 ActionScript、Photoshop 和记事本。网页设计是非常原始和实验性的，不是程序员或工程师发号施令或铺路，而是艺术家和人们在玩 Flash，利用在一张画布上同化多种媒体的力量。是的，除了那些高度参与和积极创造它们的人之外，许多人一想到“Flash 介绍的时代”就会感到腹股沟。像 Ultrashock 论坛、newgrounds、phong 以及其他试图破解像样的 2advanced 盗版代码的其他人一样狗屎。 Eric Jordan 是王者，他真的为全面的网页设计铺平了道路，无论是 UI/UX 还是病态的动画/动态图形。我仍然记得我在高中时带着我的 The New Masters of Flash 到春假并梳理了各种方法。 Ultrashock 过去每周都会向一些社区贡献称为“轰轰烈烈”之类的“礼帽”或其他东西，而且伙计，为网络制作东西很有趣。\n今天，网页设计师/开发者的时代早已一去不复返了；不要误会我的意思，网络一直是软件工程师和程序员茁壮成长的沃土，他们只花了一分钟时间就构建了我们如今认为理所当然的抽象、语言、工具和整个行业。硅谷海盗的船已经启航，我们留下了各种各样的职位、角色、抽象、方法和实践，以“正确”的方式构建东西。您很少会看到能够拥有愿景并构建自己的作品的人。这么多年之后，开发人员停止了如此多的设计工作，以便为他们没有接受任何高等教育或关心投入时间的替代学科和工作方法腾出空间。不要误会我的意思，设计/开发人员的混合体仍然存在并完成工作，他只是被当今互联网上争夺您注意力的所有噪音所掩盖。马上就想到了 mrdoob，我觉得那些能把钱（他们的模拟或线框）放在嘴边（作为编辑器中的代码）的设计师是做最有趣的工作的人。您很少会让开发人员在设计术语中以相反的方向工作。我不知道，我只是想回答这个问题“为什么我很难从头开始”，我认为这是我在重新构建东西时曾经感受到的（设计）所有权的丧失在白天。", "note_en": "Getting back into “software engineer” / “full-stack web dev” game when you’re pushing 40 is quite a chore when it was something you just fell back on because you were good doing it growing up 15+ years ago.\n After year of jacking off, the sum of all my compounded bad habits, poor lifestyle choices and several relapses beyond the base of maslow’s hierarchy of needs, I know I need to do something to make money again.\n My story into web dev/design was a lot different 15 years ago than it is now. Growing up in the age of static html, Macromedia Flash, iframes, and everything/nothing web-sites, web-rings, and the invigorating power of youth I was able to get an edge on everyone else.\n I could endlessly geek out in Flash and ActionScript, Photoshop, and Notepad. Web-design was very raw and experimental and it wasn’t programmers or engineers calling the shots or paving the way, it was artists and people fucking with Flash, tapping into the power of assimilating multiple mediums on one canvas. Yeah, many people groin whenever they think about “the age of the flash intro” except the ones highly involved and active creating them.\n Shit like ultrashock forums, newgrounds, phong, and everyone else in-between trying to crack the code of a decent 2advanced rip-off. Eric Jordan was king and really paved the way for web-design across the board, whether it was UI/UX or just sick ass animations/motion-graphics.\n I still remember bringing my copy of  The New Masters of Flash down to spring break with me during High School and combing through all sorts of approaches.\n Ultrashock used to do this weekly “tip of the hat” to some community contribution called the bombshock or something and man it was fun making stuff for the web.\n  Today the age of the web-designer/developer is long gone; don’t get me wrong, the web was always fertile grounds for software engineers and programmers to thrive, it just took them a minute to build out the abstractions, languages, tooling, and an entire industry that we take for granted these days.\n The Pirates of Silicon Valley’s ship has sailed and we are left an assortment of job titles, roles, abstractions, approaches, and practices to building stuff the “right” way. You will rarely see that guy who can own the vision AND build his creation. After so many years, developers stopped doing so much design work in order to make space for alternative disciplines and approaches to doing work they didn’t receive any higher education on or care to invest time into.\n Don’t get me wrong, that design/developer hybrid is still out there and getting stuff done, he’s just sort of eclipsed by all the noise that is the internet these days competing for you attention.\n Right off the bat,  mrdoob comes to mind, and I feel like the designers who can put their money (their mocks or wireframes) where their mouth is (as code in an editor) are the ones doing the most interesting work. You will rarely get the developer working in the opposite direction into the nomenclature of design.\n I dunno, I’m just trying to come to terms for answering the question “why is it so hard for me to start something from scratch,” and I think it’s that loss of (design) ownership I once felt when building out stuff back in the day.", "posttime": "2021-07-26 03:30:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,网络,web,设计", "title": "在失业一年后引导我的旧网络开发人员", "title_en": "Bootstrapping my old web dev ass after a year of unemployment", "transed": 1, "url": "https://boomerwebdev.wordpress.com/2021/07/25/bootstrapping-my-old-web-dev-ass-after-a-year-of-unemployment/", "via": "", "real_tags": ["开发", "网络", "web", "设计"]}, {"category": "", "categoryclass": "", "imagename": "a0183dffdf165c47043d0f74b1b646ff.jpg", "infoid": 1069711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名被三名不同医生宣布死亡的囚犯在停尸房醒来后，西班牙监狱当局感到困惑——就在他自己的尸检开始前几个小时。 2018 年 1 月 7 日，在早上的点名中，当时 29 岁的囚犯 Gonzalo Montoya Jiménez 被发现在牢房里没有反应，当病理学家听到一些奇怪的消息时，他被装在尸袋里转移到医院太平间。 Jiménez 在西班牙西北部的 Asturias Central Penitentiary 的最高安全区因抢劫罪而服刑，在他被发现坐在牢房的椅子上失去知觉后，首先由两名在监狱值班的医生看管，没有任何迹象暴力明显。医生没有感觉到生命体征，宣布他死亡，一个小时后，法医检查了尸体，同意第一次评估，并发布了第三次死亡报告。此时，Jiménez 已经在冷藏室中度过了一段时间以帮助保存他的身体，他的皮肤上已经用手术刀标记为即将到来的尸检做准备——此时错误的尸体突然动了起来。 “法医开始听到包里传来声音。蒙托亚没有死。恰恰相反，”西班牙人报道。 Jiménez 随后被救护车转移到另一家医院，以从他的神秘事件中恢复过来，并最终据报情况稳定——但至于最初如何发生混乱，监狱当局似乎已经不知道。\n“我无法对法医学研究所发生的事情发表评论，”西班牙监狱管理局的一位发言人告诉媒体，“但三名医生已经看到了死亡的临床迹象，所以目前还不清楚究竟为什么会发生这种情况。 .” Jiménez 被发现“死亡”的前一天，他抱怨说感觉不舒服，虽然不清楚是什么导致了他的病情，但官员们称他的身体出现了紫绀的迹象——由于血液循环不良或缺乏氧气 - 除了僵硬。医院官员告诉西班牙媒体，假死可能是僵住症，身体进入恍惚或癫痫样状态，表现出意识和感觉的丧失，以及身体僵硬。 Jiménez 是如何变得僵硬的尚不清楚，尽管该囚犯患有癫痫症，并为此服用药物——但他的家人说，Jiménez 在禁闭期间坚持服药时间表并不总是那么容易，所以这可能有什么影响用它来做。在医院里，希门尼斯在重症监护室花了 24 小时才恢复意识，并开始说话，医生说这是一个好兆头。", "note_en": "Spanish prison authorities were baffled after a prisoner who was declared dead by three separate doctors woke up in the morgue – just hours before his own autopsy was set to commence.\n   The prisoner, then-29-year-old Gonzalo Montoya Jiménez, was found unresponsive in his cell during a morning roll call on 7 January 2018 and had been transferred to a hospital mortuary in a body bag when pathologists heard something strange.\n  Jiménez, who was serving time for robbery in the maximum security wing of Asturias Central Penitentiary in northwest Spain, was first attended by two doctors on duty in the prison, after he was found sitting unconscious in a chair in his cell, with no signs of violence being evident.\n Sensing no vital signs, the doctors declared him dead, and an hour later a forensic doctor inspected the body, concurred with the first evaluations, and issued a third death report.\n  By this point, Jiménez had already spent time in a cold storage room to help preserve his body, and his skin had been marked with scalpel guidelines in preparation for his imminent autopsy – at which point the mistaken corpse suddenly stirred.\n   &#34;Forensic doctors began to hear noises coming from inside the bag. Montoya was not dead. Quite the opposite,&#34; reported   El Español.\n  Jiménez was subsequently transferred under guard in an ambulance to another hospital to recover from his mystery episode, and was eventually reported to be in a stable condition – but as for how the mix-up could have occurred in the first place, prison authorities seemingly had no idea.\n &#34;I can&#39;t comment on what happened at the Institute of Legal Medicine,&#34; a spokesperson for the Spanish Prison Service  told the media, &#34;but three doctors have seen clinical signs of death so it&#39;s still not clear at the moment exactly why this occurred.&#34;\n The day before Jiménez was found &#39;dead&#39;, he complained of feeling ill, and while it was unknown exactly what caused his condition, officials  described his body as showing signs of  cyanosis – a purplish discoloration of the skin caused by poor circulation or lack of oxygen – in addition to  rigor mortis.\n   Hospital officials  told Spanish media the faux fatality could be a case of  catalepsy, in which the body enters a trance or seizure-like state, exhibiting a loss of  consciousness and sensation, together with physical rigidity.\n Just how Jiménez became cataleptic is unclear, although the prisoner experienced  epilepsy, and takes medication for the condition – but  his family said it wasn&#39;t always easy for Jiménez to adhere to his medication schedule in lock-up, so that might have had something to do with it.\n In the hospital, it took 24 hours before Jiménez recovered consciousness in intensive care, and began to speak, which doctors said was a good sign.", "posttime": "2021-07-26 03:30:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宣布,man", "title": "一名男子的案例 3 名医生被宣布死亡，他在尸检前醒来", "title_en": "Case of a Man 3 Doctors Declared Dead Who Woke Up Just Before His Autopsy", "transed": 1, "url": "https://www.sciencealert.com/the-weird-case-of-a-man-3-doctors-declared-dead-who-woke-up-just-before-his-autopsy", "via": "", "real_tags": ["宣布", "man"]}, {"category": "", "categoryclass": "", "imagename": "c72a4bdf84c77ccc3eff0558d5edc17a.jpg", "infoid": 1069709, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有时会咨询其他部门从事高级统计模型或模拟的聪明同事。他们来自经济学、心理学等等。很多时候，他们的代码很慢。如“运行需要数周时间”。这不好。鉴于学术研究的缓慢步伐，您可能会认为如此长时间的延误没什么可担心的。然而，我的同事们常常理所当然地担心。如果您需要数周时间才能获得结果，那么您一年只能迭代几次您的想法。这极大地限制了您调查问题的深度。这些可怜的人经常被派往我的路上。在理想的世界中，他们会有预算，以便他们的代码可以重新设计以提高速度……但大多数研究都没有充足的资金。他们经常被他们放在一起的任何东西困住。他们常常希望我有一台功能强大的机器可以更快地运行他们的代码。我确实有一些快速的机器，但它们通常没有他们期望的那么有用。强大的计算机往往非常擅长并行。也许与直觉相反，这些计算机运行非并行代码的速度可能比普通 PC 慢。因此，将您的代码转储到超级计算机上甚至会使速度变慢！理论上，你会认为软件可以“自动”并行化，以便它可以在超级计算机上快速运行。遗憾的是，我想不出很多例子，软件会自动尝试使用 CPU 上所有可用的芯片来运行。程序员仍然需要告诉代码并行运行（尽管通常很简单）。一些软件库很聪明，可以为您完成这项工作……但是如果您编写代码时不关心性能，很可能您没有选择这些聪明的库。如果您只是从 Internet 上抓取代码，并且您不完全了解发生了什么……或者您对软件性能一无所知……很可能一点点工程可以使代码运行 10、100 或快 1000 倍。因此，搞乱一台超级计算机可能完全是可选的。大概是这样。不止一次，通过改变单个依赖项或单个函数，我已经能够将某人的代码从“太慢”切换到“非常快”。\n我建议进行粗略的计算。处理器每秒可以执行数十亿次操作。你大概做了多少操作？如果您正在执行 10 亿次简单运算（例如 10 亿次乘法）并且需要几分钟、几天或几周的时间，那么一定是出了问题，您可以做得更好。如果您真的需要数百万次操作，那么您可能需要一台超级计算机。估计很重要。我的一个学生曾经抱怨过内存不足。我愚蠢地支付了更多的内存。然而，为了确定机器没有问题，我所要做的就是将学生代码与在线找到的标准示例进行比较。该示例比在同一台机器上运行的学生的代码快得多，但该示例却用不多的代码完成了更多的工作。这足以确定问题所在：我鼓励学生查看示例代码。您通常不需要花哨的工具来使代码运行得更快。一旦确定可以更快地运行算法，您通常可以检查代码并一目了然地确定大部分工作在哪里完成。然后你可以搜索替代库，或者只是考虑不同的工作方式。", "note_en": "I sometimes consult with bright colleagues from other departments who do advanced statistical models or simulations. They are from economics, psychology, and so forth. Quite often, their code is slow. As in “it takes weeks to run”. That’s not good.\n Given the glacial pace of academic research, you might think that such long delays are nothing to worry about. However, my colleagues are often rightfully concerned. If it takes weeks for you to get the results back, you can only iterate over your ideas a few times a year. This limits drastically how deeply you can investigate issues.\n These poor folks are often sent my way. In an ideal world, they would have a budget so that their code can be redesigned for speed… but most research is not well funded. They are often stuck with whatever they put together.\n Too often they hope that I have a powerful machine that can run their code much faster. I do have a few fast machines, but it is often not as helpful as they expect.\n Powerful computers tend to be really good at parallelism. Maybe counter-intuitively, these same computers can run non-parallel code slower than your ordinary PC. So dumping your code on a supercomputer can even make things slower!\n In theory, you would think that software could be “automatically” parallelized so that it can run fast on supercomputers. Sadly, I cannot think of many examples where the software automatically tries to run using all available silicon on your CPU. Programmers still need to tell the code to run in parallel (though, often, it is quite simple). Some software libraries are clever and do this work for you… but if you wrote your code without care for performance, it is likely you did not select these clever libraries.\n If you just grabbed code off the Internet, and you do not fully understand what is going on… or you don’t know anything about software performance… it is quite possible that a little bit of engineering can make the code run 10, 100 or 1000 times faster. So messing with a supercomputer could be entirely optional. It probably is. More than a few times, by changing just a single dependency, or just a single function, I have been able to switch someone’s code from “too slow” to “really fast”.\n  I recommend making back-of-the-envelope computations. A processor can do billions of operations a second. How many operations are you doing, roughly? If you are doing a billion simple operations (like a billion multiplications) and it takes minutes, days or weeks, something is wrong and you can do much better. If you genuinely require millions of billions of operations, then you might need a supercomputer.\n Estimates are important. A student of mine once complained about running out of memory. I stupidly paid for much more RAM. Yet all I had to do to establish that the machine was not at fault was to compare the student code with a standard example found online. The example was much, much faster than the student’s code running on the same machine, and yet the example did much more work with not much more code. That was enough to establish the problem: I encouraged the student to look at the example code.\n You often do not need fancy tools to make code run faster. Once you have determined that you could run your algorithm faster, you can often inspect the code and determine at a glance where most of the work is being done. Then you can search for alternatives libraries, or just think about different ways to do the work.", "posttime": "2021-07-26 02:44:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,不会,won", "title": "不，超级计算机不会让你的代码运行得更快（2017）", "title_en": "No, a supercomputer won’t make your code run faster (2017)", "transed": 1, "url": "https://lemire.me/blog/2017/12/11/no-a-supercomputer-wont-make-your-code-run-faster/", "via": "", "real_tags": ["代码", "不会", "won"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算机在自动化方面是有效的，这已经不是什么秘密了。我们利用他们的力量来扩大我们的影响力——作为我们思想的延伸。直到最近，绝大多数用户基本上都无法获得这种能力。今天，我们改变了这一点，Nyxt 迈出了自动化民主化的第一步。那么，第一步是什么？适合所有人的简单自动化。让我介绍一下编辑宏。编辑宏允许用户定义要执行的动作序列。然后用户可以随时保存和重用他们的宏。让我们通过一个简单的例子来展示它们的威力。在本例中，我们将创建一个简单的宏来打印当前缓冲区，然后切换到下一个缓冲区。您可以想象连续多次调用此宏将允许您快速打印所有缓冲区。让我们从给我们的宏一个名字开始，让我们称之为 print-and-next。给它命名后，我们必须选择我们希望它执行的命令。为此，我们单击“+ 添加命令”。我们现在看到一个屏幕，其中列出了 Nyxt 中可用的所有命令。我们选择一个命令，按回车键，它就会被添加到我们的命令列表中。我们现在准备测试！要测试，请按“评估宏”。这将编译我们的宏并使其可从执行命令菜单运行。\n如果一切都按预期工作，就是这样，我们就完成了！我们可以使用我们的宏，我们可以绑定到一个热键，在另一个宏中使用它等等。可能性是无穷无尽的。如果我们希望为以后的会话保存我们的宏，我们所要做的就是按“保存宏”。然后 Nyxt 会自动将我们的宏保存到我们的 auto-config.lisp 文件中。如果您好奇，这里是我们的宏生成的代码： 如您所见，宏非常强大。也就是说，还有很多重要的工作要做：在后续的变体中，我们希望引入分支、变量等（不会让用户感到不知所措）！我们将此自动化界面的开发视为迈向自动化民主化的重要第一步。", "note_en": "It is no secret that computers are effective at automation. We use their power to multiply our impact- as an extension of our minds.\n Until recently, this power has been largely inaccessible for the vast majority of users. Today, we change this, Nyxt has taken the first steps towards the democratization of automation.\n So, what is the first step? Simple automation for everyone. Let me introduce  edit-macro. Edit macro allows the user to define a sequence of actions to execute. The user can then save, and reuse their macro whenever they want. Let&#39;s go through a simple example demonstrating their power.\n     In this example, we&#39;ll be creating a simple macro that prints the current buffer, and then switches to the next one. You can imagine that invoking this macro several times in a row would allow you to quickly print all of your buffers.\n Let&#39;s start off by giving our macro a name, let&#39;s call it  print-and-next. After giving it a name, we have to select which commands we want it to execute. To do so, we click &#34;+ Add Command&#34;.\n  We are now presented with a screen that lists all of the commands available in Nyxt. We select a command, press return, and it is added to our command list.\n      We are now ready to test! To test press &#34;Evaluate macro&#34;. This will compile our macro and make it runnable from the  execute-command menu.\n  If everything works as expected, that&#39;s it, we&#39;re done! We can use our macro, we can bind to a hotkey, use it in another macro etc. The possibilities are literally endless.\n Should we wish to save our macro for future sessions, all we have to do is press &#34;Save macro&#34;. Nyxt will then automatically save our macro into our  auto-config.lisp file. If you are curious, here is the code that our macro produces:\n  As you can see, macros are very powerful. That said, there remains a lot of important work to be done: in subsequent variants we hope to introduce branching, variables, and more (without overwhelming the user)! We see the development of this automation interface as an important first step towards the democratization of automation.", "posttime": "2021-07-26 01:57:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编辑,edit,自动化", "title": "宏编辑：使自动化民主化", "title_en": "Macro Edit: Democratizing Automation", "transed": 1, "url": "https://nyxt.atlas.engineer/article/macro-edit.org", "via": "", "real_tags": ["编辑", "edit", "自动化"]}, {"category": "", "categoryclass": "", "imagename": "3449bfc27f1b2b0190cef78b4113a3dc.jpeg", "infoid": 1069705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人们讨厌改变。他们有一种倾向，只是因为它是新的和不同的，就深陷其中并反对它。他们将变化与损失联系起来，而不是收益。因此，当您倡导变革时，人们往往会认为您是在攻击他们、他们的生活方式以及他们珍视的一切，这导致了很多守门人，人们试图在它获得任何牵引力之前“用火杀死它”。那么什么是趋势呢？某物如何成为“热门新事物”？我认为，如果你做一些新的和不同的事情，并且不知何故不会引起警钟，它就会成为热门的新事物。如果人们不立即用“我们必须用火杀死它！”来迎接它。下意识的反应，然后它传播得相当快，因为​​它是新的，它是不同的，它是令人兴奋的，无论如何它奇迹般地被接受。我认为你可以积极尝试成为热门的新事物，部分是通过努力做到无害。理想情况下，这植根于真正尊重人和他们的界限。如果您希望倡导变革和社区发展，您可以从过去实际成功的项目中吸取教训。从如何争论...，这里有一些从成功的住房项目中学到的经验教训，转化为如何在交通方面做同样的事情：不要使用可能被误解的术语。非常具体地说明您想要开发的内容。不要攻击汽车。谴责我们发生的许多事故，因为例如，由于缺乏交通选择，青少年和老年人的事故发生率都很高。当然，如果他们有其他方式到达那里，这些不安全的司机会做正确的事情并停止在路上杀人！不要将司机视为罪人，将行人、骑自行车的人等视为好人的道德论据。不要让它听起来绝对主义，好像废除汽车是最终目标一样。您只想要更多其他选择。你不想追捕每辆驾驶混蛋的汽车，并像过境国的惩罚者一样消灭它们。到目前为止，这就是所有的“理论”。现在我正在尝试使用 Project Bike Rack 将其付诸实践。在这一点上，目标只是对我居住的小镇市中心及其附近的现有自行车架和“想要的自行车架”站点进行编目。我还邀请整个华盛顿沿海地区的人们参与发布照片和位置自行车架和“自行车架通缉”站点的信息贯穿整个州手套形状的“拇指”。我不确定我将如何推广它。这需要一些研究。好消息是 r/CoastalWa 已经有 41 名成员，尽管我很少在那里发布任何内容。我最好的猜测是，尽管几个月的大部分时间都被忽视了，但由于写得很好的欢迎信息解释了我创建 sub 的原因，它仍然变得如此之大。我将亲自对我镇市中心及周边地区的自行车架和“想要的自行车架”站点进行编目。这部分是我可以自己做的，虽然需要时间。但是如果我不能吸引其他参与者，这个项目就不会发展到我所在的城镇之外。这意味着这个项目有两个部分，它最终可能只是部分成功。它可能只为我的城镇而不是该地区做些什么。当然，要真正取得成功，这个项目需要以某种方式导致在公共场所安装更多的自行车架，最好是离企业很近。如果不能促进更多自行车架的扩散，则对现有自行车架和“想要的自行车架”站点进行编目的价值是有限的。这是第一步。我已经在进行额外的研究和记笔记，以弄清楚如何从收集数据到鼓励企业购买和安装自行车架。也许只是让企业知道这是人们想要的东西会导致一些企业去“这是个好主意！”赶紧跑出去买个自行车架。或者可能需要做更多的工作。时间会告诉我们的。目前，在参加了近四年的公开会议、研究当地需求等之后，我很高兴能有一个具体的项目来开展工作。我认为这是一个可靠的想法，可能会有腿。这也是一个项目，如果您愿意，您可以借鉴其想法，通过在您居住的地方推广自行车基础设施来促进自行车运动。", "note_en": "People hate change. They have something of a tendency to dig their heels in and be against it just because it is new and different.  They associate change with loss, not gain. So when you advocate for change, people tend to see you as attacking them, their way of life and everything they cherish and this leads to a lot of gatekeeping where people try to &#34;kill it with fire&#34; before it can get any traction.  So what makes for a trend? How does something become &#34;The hot new thing&#34;? I think if you do something new and different that somehow doesn&#39;t set off alarm bells, it becomes  the hot new thing. If people don&#39;t immediately greet it with that &#34;We must kill it with fire!&#34; knee-jerk reaction, then it spreads fairly rapidly because it&#39;s new, it&#39;s different, it&#39;s exciting and it&#39;s somehow miraculously  acceptable anyway.  I think you can actively try to become the hot new thing in part by  working on being inoffensive. Ideally, that&#39;s rooted in actually respecting people and their boundaries.   If you are looking to advocate for change and community development, you can take lessons from past projects that were actually successful. From  How to argue..., here are some lessons learned from a successful housing project translated into how to do the same thing transportation-wise: Don&#39;t use terms that could be misconstrued. Get very specific about what you want developed.\n Don&#39;t attack cars. Decry the many accidents we have because, for example, teens and seniors both have high rates of accidents due to a lack of transportation choice. Surely, these unsafe drivers would do the right thing and stop killing people on the road if they had another way to get there!\n Don&#39;t make it a moral argument that frames drivers as sinners and pedestrians, cyclists, etc as The Good Guys.\n Don&#39;t make it sound absolutist, as if abolishing cars is the ultimate goal. You just want more other options. You don&#39;t want to hunt down every car driving motherf*cker and exterminate them like The Punisher of transitland.\nSo far, that&#39;s kind of all &#34;theory.&#34; Now I am trying to put it into practice with  Project Bike Rack.  At this point, the goal is simply to catalog existing bike racks and &#34;bike rack wanted&#34; sites in and near the downtown area of the small town I live in. I am also inviting people throughout the  Coastal Washington region to participate posting photos and location information for bike racks and &#34;bike rack wanted&#34; sites throughout the &#34;thumb&#34; of the mitten-shape of the state.  I&#39;m not sure how I will promote it. That will take some research.  The good news is that  r/CoastalWa already has 41 members though I rarely post anything there. My best guess is that it&#39;s grown that large in spite of months of mostly neglect because of the well-written  Welcome message explaining why I created the sub.  I will personally be cataloging bike racks and &#34;bike rack wanted&#34; sites in and around the downtown of my town. That part is something I can do myself, though it will take time.   But the project won&#39;t grow beyond my town if I can&#39;t attract other participants. That means there are two parts to this project and it may end up being only a partial success. It may only do something for my town and not for the region.  Of course, to actually be successful this project needs to somehow lead to more bike racks being installed in public spaces, ideally very near businesses. Cataloging existing bike racks and &#34;bike rack wanted&#34; sites is of limited value if it doesn&#39;t foster the proliferation of more bike racks.   This is step one. I am already working on doing additional research and note-taking to figure out how to go from gathering data to encouraging businesses to buy and install a bike rack.  Maybe just letting businesses know this is something people want will cause some businesses to go &#34;That&#39;s a great idea!&#34; and run right out and buy a bike rack. Or maybe it will take more work than that.  Time will tell. At the moment, I am just excited to have a concrete project to work on after nearly four years of attending public meetings, doing research into local needs and so forth.  I think it&#39;s a solid idea and likely will have legs. It&#39;s also a project that you could borrow ideas from to promote cycling by promoting cycling infrastructure where you live, if you so desire.", "posttime": "2021-07-26 01:11:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "成为,anti,自行车", "title": "不要反汽车。成为专业人士。", "title_en": "Don't Be Anti Car. Be Pro Something Else.", "transed": 1, "url": "https://www.eclogiselle.com/2021/07/the-hot-new-thing.html", "via": "", "real_tags": ["成为", "anti", "自行车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您使用的是过时的浏览器。它可能无法正确显示此网站或其他网站。您应该升级或使用其他浏览器。我读过很多关于 AP 的帖子，但它失败了等等，但我坚持了过去 2 年，并认为对它的特殊性有所了解。主要挑战是幻影制动，学会注意桥梁，经过的卡车，道路上的波峰，迎面而来的车辆急转弯，偶尔无缘无故地减速并迅速踩下油门以避免跟车（无疑是几个&#39;为什么不幸的追随者会想到那个布偶刹车的想法）。然而今天发生的事情意味着我放弃了。沿着 A 路笔直行驶，我前面没有车辆，后面几乎没有汽车（所有人都保持距离，即感谢上帝没有尾随）。左边的路有一辆车耐心地等待加入 A-Road - 在我看来，不要太向前引发“幻影制动”。下一件事是完全紧急制动，系紧安全带把风吹倒了我 - WTF !!!这真是太危险了，嗨，伙计。我现在有几次这样的经历，我学会了期待它并向前踩踏板。您目前是哪个软件版本？我已经注意到至少它在我 2021.4.18.11 更新后开始发生。感觉就像他们改变了雷达灵敏度。嗨，伙计。我现在有几次这样的经历，我学会了期待它并向前踩踏板。您目前是哪个软件版本？我已经注意到至少它在我 2021.4.18.11 更新后开始发生。感觉就像他们改变了雷达灵敏度。 2021.4.18.2 我必须说，我从 3 月份开始才拥有这辆车，我的想法也很相似。我只在主要的双车道上使用 AP/NoA，并且只在较大的道路上使用 TACC，在那里我可以预测会发生什么。如果没有一些幻影制动事件，我无法单次上下班（往返约 55 英里），通常是侧面摄像头或传感器看到我们已经在旁边的东西并决定紧急制动。出于这个原因，我只在非常清楚的时候使用 TACC，并在有任何可能会扰乱它的时候停用它。有一个例子，一辆从另一边驶来的汽车离道路的中心线太近了，TACC 认为太近了，紧急刹车。好在我接手很快，跟在我身后的人并没有靠的太近，不然的话那是TACC垃圾一塌糊涂造成的事故。我真的希望这与他们在视觉和雷达之间遇到的困难有关，而仅使用视觉的新 FSD 堆栈将解决这些问题。我只能希望。我只能说“只有视觉”堆栈不能更糟。真正让我烦恼的是它在过去 2 年里变得越来越糟 - 备受赞誉的 OTA 更新，不要认为这个想法是定期自动地使功能变得更糟。我开始想念我的梅赛德斯和它的驾驶飞行员 - 它比 6 年前的这个 cr*p 效果更好\n然而今天发生的事情意味着我放弃了。沿着 A 路笔直行驶，我前面没有车辆，后面几乎没有汽车（所有人都保持距离，即感谢上帝没有尾随）。左边的路有一辆车耐心地等待加入 A-Road - 在我看来，不要太向前引发“幻影制动”。下一件事是完全紧急制动，系紧安全带把风吹倒了我 - WTF !!!这简直太危险了 [更新] 在撰写本文时，OP 的评论并未表明他们仅使用了 Autopilot 的 TACC 子集。这篇文章是基于当引用术语 Autopilot 时，它指的是 Autopilot 的全部功能，即 TACC 和 Autosteer（除了安全功能）。因此参考手册中的 Autosteer 约束。尽管这篇文章与 TACC 无关，但我将重点介绍影响完整 Autopilot/Autosteer 功能的用例约束。这听起来正是不应使用自动驾驶仪/自动转向的道路类型——它不受入口和出口坡道的限制。如果在不使用的情况下使用自动驾驶仪/自动驾驶仪，那么它有时会以未定义的方式执行。我也在 2021.4.18.2（我似乎不再获得软件更新，自上一次以来已经有很长的差距）并且正如我多次向该小组发表评论时，我遇到了与您刚刚描述的完全相同的经历。上一次在 A1 上行驶时，在接近一辆等待驶出加油站的汽车时引发了猛烈的撞击和几乎弄脏裤子的事件。幸运的是没有人紧随其后。正如我之前评论过的，这是 Autopilot 最新版本的一个严重错误，特斯拉需要解决这个问题，因为它确实存在潜在危险。也就是说，我最近在高速公路上使用 FSD 的体验非常非常好。数百英里的舒适驾驶，换道和处理合并交通的工作非常好。所以我还没有把婴儿和洗澡水一起倒掉。对我来说，真正令人沮丧的是特斯拉在按照承诺部署可靠的 FSD 功能方面的进展速度比宣传的要慢得多，尤其是在美国以外。此外，在 Elon 广泛报道的推文中，软件功能取得了巨大进步的无益声称似乎从未交付过。 YouTube 上新的 FSD beta V9 视频确实展示了一些令人印象深刻的进步并展示了系统的真正潜力，但它们也突出了许多遗留的问题和错误，以至于我们很难清楚地知道我们何时可以访问这里是对真正有用的 FSD 版本的重大升级，不仅仅是高速公路驾驶，这几乎证明了我提前支付的标价是合理的。尽管如此，希望还是永恒的......这就是为什么这些道路不打算与 Autopilot 一起使用。我们中的许多人不时这样做......在我自己的情况下只是为了测试技术的进展情况，如果可能的话，我总是比正常驾驶时更加小心和关注。我已经超越了极限，看看在某些情况下它是否真的会驶离道路边缘......（是的，是的，并且在 A 路上）......但我不会声称特斯拉的失败，因为他们已经告诉我不要这样做！当然，双车道是另一回事。在其操作环境之外使用任何工具都是危险的。将您的体验归结为用户错误。在 NoA 上，我在外面的车道上一个空的 d/c。一辆汽车从出口匝道中途汇入内侧车道。我通过了它，然后刹车来了。我已经提前进入o/s车道，让另一辆车加入。 NoA 可用的事实意味着正确使用 AP。事后刹车。完全不能接受。幸运的是，我的脚总是在那些场合盖住油门。我在 4.18.11，它比 4.18.3 更糟糕。汽车太靠近路缘石并且太靠近 l/h 弯道上的白线 这听起来正是不应使用自动驾驶仪/自动转向的道路类型 - 它不受入口和出口坡道的限制。如果在不使用的情况下使用自动驾驶仪/自动转向，那么它有时会以未定义的方式执行。查看附件 686175 查看附件 686176\n不太确定引用手册的 Autosteer 部分有什么作用，我完全了解 Autosteer 的限制和推荐使用。这不是我有问题的自动转向，我认为它是交通感知巡航控制，根据我对手册的阅读，允许在 A 道路上使用。我完全理解“这是测试版”，但我的观点仍然存在。根据我的经验，在我深思熟虑的观点中，过去两年情况变得更糟，甚至变得危险。所以我将停止使用它，我 6 年前的前车可以做得更好。不太确定引用手册的 Autosteer 部分有什么作用，我完全了解 Autosteer 的限制和推荐使用。这不是我有问题的自动转向，我认为它是交通感知巡航控制，根据我对手册的阅读，允许在 A 道路上使用。我完全理解“这是测试版”，但我的观点仍然存在。根据我的经验，在我深思熟虑的观点中，过去两年情况变得更糟，甚至变得危险。所以我将停止使用它，我 6 年前的前车可以做得更好。我同意。我已经对它失去了所有的信心，并尽可能避免使用它。我唯一一次使用它是在高速公路上从头到尾的交通。我发现 TACC 上的幻影制动和 AP 上一样经常和多事。不幸的是，没有选择只能保持速度的愚蠢巡航控制系统。还是我错过了那个设置？我们家的另一辆车是 ICE Corsa，我使用这种愚蠢的巡航比使用 TACC 多。正如其他人评论的那样，当您保持平衡时，它会让您更加专心，准备好跳上快速踏板，以防汽车在经过的阴影处摇晃。我发现自己很少使用 AP 或 TACC，压力太大了！可悲的是，其他汽车在自适应巡航控制方面做得很好，例如我妻子的基本款高尔夫。只是有效 - 保持您设定的速度或按照您设定的距离跟随前面的汽车。并且在各种道路上。我已经遇到过几次，虽然这不是我最大的抱怨，但可能不是严格的 AP，但我一点也不相信显示的速度限制。我有 40 in 60, 60 in 40, 70 in 50, 70 in 60（单车道所以不可能是 70）等等。所以即使我信任 TACC，我也不能相信它的速度是正确的。我也在 2021.4.18.2（我似乎不再获得软件更新，自上一次以来已经有很长的差距）并且正如我多次向该小组发表评论时，我遇到了与您刚刚描述的完全相同的经历。\n左边的路有一辆车耐心地等待加入 A-Road - 在我看来，不要太向前引发“幻影制动”。我在 2021.4.18.11 上，我的现在也在这样做（不确定这改变了哪个版本，但最近）。没有理由，另一辆车不在路上，只是在一个路口等着，自动驾驶仪出于某种原因将其视为威胁，并在您通过路口时猛踩刹车。我不认为这是“幻影制动”，对我来说这意味着在未知情况下制动。相反，在这里我们可以确切地看到汽车制动的原因，但它根本不应该这样做。不确定这是否是另一个被忽视的右手驱动错误（否则这肯定会被其他人报告在这里？），但它很危险，应该尽快修复。同样在 2021.4.18.2，并且现在（在过去一个月左右）两次出现这种不必要的中断，但幸运的是没有线程启动器那么戏剧化。我的第一个例子是在 A90 的双车道部分，另一辆车正等待从一条几乎垂直的侧路加入 - 视野清晰，没有明显向前爬行，但靠近我的左侧车道。第二个例子是类似的，但我没有那么惊讶，可能会更快地踩下加速器来中止刹车。根据手册猜测，我不应该在双车道上使用自动转向，除非它们实际上是具有适当交叉点的高速公路……这会真正减少苏格兰的公用事业。请注意，这已在此处标记，以便特斯拉将其视为可能的 RHD/英国特定问题，请竖起大拇指，以帮助特斯拉确定优先事项。我最近在恶劣的天气里从贝兹开车到朴茨茅斯。然后桑坦德到赫罗纳，阳光充足。一个全开幻影刹车，一个在旅途中退缩。使用 FSD 运行 4.18.11（我该死的更新在哪里？！？！？）大约 90 pc NoA。快乐的露营者......油漆很好，没有面板间隙，只是回到 SC 更换了道路危险轮胎（这是在回家的路上）。天啊。我的经验：特斯拉的自动驾驶仪并不比之前梅赛德斯的巡航控制系统灵敏。不像左边的任何东西暗示系统“某事”可能会发生。大多数情况下，当车辆等待从左侧的侧转弯向右转时，也会出现左转车辆的滑道。它比梅赛德斯更好，因为我可以设置我和前面汽车之间的距离。但是当它发现一个行人从右到左横穿马路时，我紧急停车，它忽略了有行人避难所的事实，并假设这个人会跑在汽车前面。不好玩。除了在高速公路上缓慢行驶之外，自动转向毫无意义。我不期望自动驾驶，除了在高速公路上，会在我的有生之年发生（我 69 岁）最近我从克劳利到利物浦又回来了……FSD 一直活跃（除了环形交叉路口），没有问题……快乐的！", "note_en": "You are using an out of date browser. It may not display this or other websites correctly. You should upgrade or use an  alternative browser.\n I&#39;ve read many a thread regarding AP and it&#39;s failing etc, but I persevered for the last 2 years, and thought had a handle on it&#39;s peculiarities.  Main challenge was phantom braking, learnt to watch out for bridges, passing lorries, crest&#39;s in road&#39;s, sharpish turns with oncoming traffic, occasional sporadic slow down for no apparent reason and pressed accelerator promptly to avoid freaking out following traffic (no doubt a few &#39;why is that muppet braking&#39; thoughts by the unfortunates following).  However what happened today means I give up.  Travelling down straight A-Road, no traffic in front of me, few cars behind (all keeping their distances i.e. no tailgating thank god). Road on left has a car patiently waiting to join A-Road - Not to far forward to provoke &#39;phantom braking&#39; in my view. Next thing full emergency braking and the wind knocked out of me by seatbelt tightening - WTF !!!!  This is just bloody dangerous\n Hi mate. I had this now a few times and I learn to expect it and step the pedal ahead. Which software version you are at the moment? I have noticed for me at least it started happening after I updated at 2021.4.18.11. It feels like they change something on the radar sensitivity.\n Hi mate. I had this now a few times and I learn to expect it and step the pedal ahead. Which software version you are at the moment? I have noticed for me at least it started happening after I updated at 2021.4.18.11. It feels like they change something on the radar sensitivity.\n2021.4.18.2\n I must say, I’ve only had the car since March and I’m of a similar mind. I only use AP/NoA on major dual carriageways and only use TACC on larger roads where I can predict what’s going to happen. I can’t go a single trip to work and back (around 55mi round trip) without some phantom braking event, usually where a side camera or sensor sees something that we’re already next to and decides to emergency brake. For that reason, I only use TACC when it’s pretty clear, and deactivate it when there’s any chance of anything upsetting it. Had one instance where a car coming the other way got a bit too close to the central line in the road and TACC decided that was too close and emergency braked. Fortunately, I took over pretty quickly and the person behind me wasn’t too close, otherwise that would’ve been an accident caused by TACC being utter rubbish. I’m really hoping this is all to do with the difficulties they’ve had between vision and radar and the new FSD stack using only vision will solve these issues. I can but hope.\n All I can say is &#39;vision only&#39; stack can&#39;t be worse. What really annoys me is it has been getting worse over the last 2 years - so much the much lauded OTA updates, don&#39;t think the idea was to regularly make a feature worse and automatically at that.  I&#39;m beginning to miss my mercedes and it&#39;s drive pilot - It worked better than this cr*p and that was 6 years ago\n However what happened today means I give up.  Travelling down straight A-Road, no traffic in front of me, few cars behind (all keeping their distances i.e. no tailgating thank god). Road on left has a car patiently waiting to join A-Road - Not to far forward to provoke &#39;phantom braking&#39; in my view. Next thing full emergency braking and the wind knocked out of me by seatbelt tightening - WTF !!!!  This is just bloody dangerous\n  [update] At time of writing, the OP&#39;s comment gave no indication that they were using just the TACC subset of Autopilot. This post was made on the basis that when the term Autopilot is referenced, it refers to the full capabilities of Autopilot, ie TACC &amp; Autosteer (in addition to the safety features). Hence references to Autosteer constraints from manual. Even though this post is not relevant to TACC, I will leave it be to highlight the use case constraints that do affect full Autopilot/Autosteer functionality.  This sounds to be precisely the type of roads where autopilot/autosteer should not be used - it is not limited by entry and exit ramps. If autopilot/autosteer is used in circumstances where it is not for use, then from time to time it is going to perform in an undefined way.\n I am also on 2021.4.18.2 (I don&#39;t seem to be getting software updates any more, has been a long gap since last one) and as I commented to this group several times I have had exactly the same experience you just described. Last time was driving along on the A1 when approaching a car waiting to pull out of a petrol station induced a violent slam-on and near trouser soiling event. Fortunately nobody close behind.  As I commented before, this is a serious bug with recent versions of Autopilot and Tesla need to fix this as it is indeed potentially dangerous. That said, my recent experience with FSD on the motorway was really, really good. Hundreds of miles of comfortable driving with lane changing and dealing with merging traffic working really well. So I am not throwing the baby out with the bath water just yet.   The real frustration here for me is the much slower than advertised rate of progress with Tesla in getting reliable FSD features deployed as had been promised, especially outside of USA. Also, the unhelpful claims of wonderful progress with software features in Elon&#39;s widely reported tweets that never seem to be delivered. The new spate of FSD beta V9 videos on YouTube definitely show some impressive progress and tease the true potential of the system, but they also highlight so many remaining issues and bugs that it is hard to get any clear idea as to when we will get access here to a significant upgrade to a genuinely useful version of FSD for more than motorway driving that comes anywhere close to justifying the sticker price I paid in advance. Still, hope springs eternal...\n That&#39;s why those kind roads are not intended to be used with Autopilot. Many of us do it from time to time ... in my own case just to test how things are going with the tech and invariably I am applying even more care and attention than when driving normally, if that&#39;s possible. I&#39;ve pushed beyond the limits to see if it really would drive off the edge of the road in some circumstances ... (yes it does, yes and on an A road   ) ... but I&#39;m not going to claim a fail on Tesla&#39;s part because they already told me not to do it! Dual carriageways are, of course, a different matter.\n Using ANY tool outside its operating environment will be dangerous. Put your experience down to user error.\n On NoA, I was in the outside lane on an empty d/c. a car merged from the off ramp partway Into the inside lane. I passed it and then the brakes came on. I’d moved into the o/s lane well ahead to allow the other car to join. the fact that NoA was available implies correct use of AP. Braking after the event. Completely unacceptable. Luckily my foot is always covering the accelerator for just those occasions. I’m on 4.18.11 and it’s worse than 4.18.3. Car too close to kerbs and too close to the white line on l/h bends\n This sounds to be precisely the type of roads where autopilot/autosteer should not be used - it is not limited by entry and exit ramps. If autopilot/autosteer is used in circumstances where it is not for use, then from time to time it is going to perform in an undefined way.   View attachment 686175 View attachment 686176\nNot too sure what quoting the Autosteer section of the manual does,  I&#39;m fully aware of the limitations and recommended use of Autosteer. It&#39;s not autosteer I have a problem with, I assume it&#39;s traffic aware cruise control, which based on my reading of the manual is allowed for use on A Roads.  I fully understand &#39;it&#39;s beta&#39;, but my point remains. Based on my experience, It&#39;s got worse in the last two years to the point of being dangerous, in my considered opinion. So I will stop using it and my previous car 6 years ago could do a better job.\n Not too sure what quoting the Autosteer section of the manual does,  I&#39;m fully aware of the limitations and recommended use of Autosteer. It&#39;s not autosteer I have a problem with, I assume it&#39;s traffic aware cruise control, which based on my reading of the manual is allowed for use on A Roads.  I fully understand &#39;it&#39;s beta&#39;, but my point remains. Based on my experience, It&#39;s got worse in the last two years to the point of being dangerous, in my considered opinion. So I will stop using it and my previous car 6 years ago could do a better job.\nI agree. I’ve lost all faith in it and avoid using it wherever possible. The only time I use it is in nose to tail traffic on motorways.\n I find phantom braking on TACC as regular and eventful as on AP. Unfortunately there&#39;s no option to have a dumb cruise control that just holds your speed. Or have I missed that setting?   The other car in our house is an ICE Corsa and I use that dumb cruise more than I use TACC. As someone else commented it makes your more attentive as you are poised, ready to jump on the fast pedal in case the car throws a wobbly at a passing shadow. I find myself rarely using AP or TACC, it&#39;s just too stressful!\n The sad thing is that other cars do adaptive cruise control so well, for example my wife’s basic Golf. just works - keeps the speed you’ve set or follows the car in front at the distance you’ve set. And on all kinds of roads.\n I&#39;ve had that a couple of times although its not my biggest gripe, may not be stricktly AP but I don&#39;t trust the displayed speed limits one bit. I&#39;ve had 40 in 60, 60 in 40, 70 in 50, 70 in 60 (single carriageway so could never be 70) etc. So even if I trusted TACC, I can&#39;t trust it to be doing the correct speed.\n I am also on 2021.4.18.2 (I don&#39;t seem to be getting software updates any more, has been a long gap since last one) and as I commented to this group several times I have had exactly the same experience you just described.\n Road on left has a car patiently waiting to join A-Road - Not to far forward to provoke &#39;phantom braking&#39; in my view.\n I&#39;m on 2021.4.18.11 and mine is now doing this too (not sure what version this changed, but quite recent). There is no reason for it, the other car is not on the road, is merely waiting at a junction, and autopilot for some reason sees this as a threat and slams on the brakes as you pass the junction.  I don&#39;t think this is &#34;phantom braking&#34; as such, to me that implies braking for unknown circumstances. Instead, here we can see exactly why the car is braking, but it simply should not be doing it.  Not sure if this is another right hand drive bug that has crept in unnoticed (otherwise this would surely be reported by others more here?), but it is dangerous and should be fixed asap.\n Also on 2021.4.18.2, and had this unwanted breaking twice now (in the last month or so), but thankfully not as dramatic as the thread starter.  My first example was on a dual carriageway section of the A90, another car waiting to join from a near perpendicular side road - had a clear side on view, wasn&#39;t obviously creeping forward but was close to my left hand lane.  Second example was similar, but I was less surprised, and probably pressed the accelerator quicker to abort the breaking.  Guess as per the manual I shouldn&#39;t be using auto steer on dual carriageways unless they are actually motorways with proper junctions... which would really cut down on the utility here in Scotland.  Note this has been  flagged here for Tesla to look into as a possible RHD/UK specific issue, please go give that a thumbs up in case that helps Tesla prioritise things.\n I recently drove from Beds to Portsmouth in foul weather. Then Santander to Girona in full sun. One full-on phantom brake, one flinch on the trip. Running 4.18.11 with FSD (where&#39;s my damn update?!?!?) About 90pc NoA. Happy camper... paint fine, no panel gaps, only been back to the SC to replace a road hazarded tyre (it was on the way home). YMMV.\n My experience:   Tesla&#39;s Autopilot is no more, or less, sensitive than Cruise Control on the previous Mercedes. Neither like anything on the left which suggests to the system &#34;something&#34; might happen. Mostly it is when a vehicle is waiting to turn right from a side turn on the left, but also when there is a slip lane for cars turning left. It is better than the Mercedes as I can set the distance between me and the car in front.  BUT I had a full blown emergency stop when it spotted a pedestrian crossing the road from right to left, it ignored the fact that there is a pedestrian refuge and assumed that the person would run in front of the car. Not fun.   Autosteer is pointless, other than driving slowly in traffic on a motorway.   I have no expectation that autonomous driving, other than on a motorway, will happen in my lifetime (Im 69)\n Recently I had a trip from Crawley to Liverpool and back... FSD active always (except roundabouts) and no issues... Happy!", "posttime": "2021-07-26 01:11:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,放弃,autopilot,tacc", "title": "特斯拉 AutoPilot – 我放弃了，它是彻头彻尾的致命", "title_en": "Tesla AutoPilot – I give up, it's downright lethal", "transed": 1, "url": "https://teslamotorsclub.com/tmc/threads/auto-pilot-i-give-up-its-downright-lethal.234498/", "via": "", "real_tags": ["特斯拉", "放弃", "autopilot", "tacc"]}]