[{"category": "", "categoryclass": "", "imagename": "aea18b71276a07e96a20e9aeba0575c2.jpg", "infoid": 1069093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着未接种疫苗人群中冠状病毒病例的增加，民主党参议员周四提出了一项新法案，如果 Facebook 和其他社交媒体平台放大有害的公共卫生错误信息，将剥夺它们的第 230 条责任保护。周四由 Sens. Amy Klobuchar (D-MN) 和 Ben Ray Luján (D-NM) 推出的《健康错误信息法案》将在《通信规范法》第 230 条中创建一个豁免条款，将 Facebook 等社交媒体平台开放至托管诉讼一些危险的健康错误信息。该法案指示卫生与公共服务部部长发布关于应归类为“健康错误信息”的指导方针。正如 HHS 部长所宣布的那样，这项豁免仅适用于在线错误信息与现有的公共卫生紧急情况（如正在进行的冠状病毒大流行）有关的情况。如果内容被算法放大，它只会让平台承担责任，而不是通过“中性机制，例如通过使用按时间顺序排列的功能”。 “长期以来，在线平台在保护美国人的健康方面做得还不够。这些是世界上一些最大、最富有的公司，他们必须采取更多措施来防止致命的疫苗错误信息的传播，”克洛布查尔周四在一份声明中说。 “冠状病毒大流行向我们展示了错误信息的致命性，我们有责任采取行动。”目前尚不清楚取消第 230 条保护是否会产生立法者想要的效果。第 230 条保护平台免于为其平台上托管的非法内容承担责任——但错误信息本身并不违法。因此，即使取消了第 230 条的保护，也不清楚针对 Facebook 的虚假信息可能提起的诉讼会是什么样子。该法案的出台是在拜登政府发布一份新报告称社交媒体上的疫苗错误信息一周后提出的。该报告呼吁全社会推动解决冠状病毒的错误信息，包括针对 Facebook、Twitter 和 YouTube 等公司的新政策建议。该报告没有提到第 230 条，但建议平台重新设计算法以“避免放大错误信息”，并在共享功能中构建更多“摩擦”，以敦促用户避免共享虚假信息。报告发布后不久，白宫官员和总统乔·拜登 (Joe Biden) 专门指责 Facebook 在放大疫苗错误信息方面的作用。上周五，拜登告诉记者，像 Facebook 这样的平台通过发布虚假疫苗信息来“杀人”。 Facebook 发言人回应说：“事实表明，Facebook 正在帮助挽救生命。时期。”\n周一，拜登收回了这一声明，称错误信息正在“杀人”，而不是 Facebook 本身。尽管如此，白宫通讯主任凯特贝丁菲尔德周二告诉 MSNBC，政府正在审查第 230 条，以确定打击 COVID-19 错误信息的方法。 “当然，他们应该被追究责任，”贝丁菲尔德周二在谈到社交媒体公司时说。 “这是一个庞大而复杂的生态系统，每个人都有责任确保我们不会向人们提供有关可以挽救他们生命的疫苗的不良信息。”", "note_en": "As coronavirus cases rise in unvaccinated populations, Democratic senators are introducing a new bill Thursday that would strip away Facebook and other social media platforms’ Section 230 liability shield if they amplify harmful public health misinformation.\n The Health Misinformation Act, introduced by Sens. Amy Klobuchar (D-MN) and Ben Ray Luján (D-NM) Thursday, would create a carveout in Section 230 of the Communications Decency Act opening social media platforms like Facebook up to lawsuits for hosting some dangerous health misinformation. The bill directs the Health and Human Services secretary to issue guidelines on what should be classified as “health misinformation.”\n The carveout would only apply in situations where online misinformation is related to an existing public health emergency like the ongoing coronavirus pandemic, as declared by the HHS secretary. It would only open a platform up to liability if the content is being algorithmically amplified, not through “a neutral mechanism, such as through the use of chronological functionality.”\n  “For far too long, online platforms have not done enough to protect the health of Americans. These are some of the biggest, richest companies in the world and they must do more to prevent the spread of deadly vaccine misinformation,” Klobuchar said in a statement Thursday. “The coronavirus pandemic has shown us how lethal misinformation can be and it is our responsibility to take action.”\n It’s not clear that removing Section 230 protections would have the effect lawmakers intend. Section 230 protects platforms  from liability for illegal content hosted on their platforms — but misinformation is not illegal in itself. As a result, it’s unclear what a potential lawsuit against Facebook for misinformation would look like, even once the protections of Section 230 are stripped away.\n The bill’s introduction comes just a week after the Biden administration issued a new report  calling out vaccine misinformation on social media. The report called for an all-of-society push to address coronavirus misinformation, including new policy recommendations for companies like Facebook, Twitter, and YouTube. The report didn’t mention Section 230 but suggested that platforms redesign their algorithms to “avoid amplifying misinformation” and to build more “friction” into sharing functions to urge users to avoid sharing false information.\n Shortly after the report’s release, White House officials and President Joe Biden called out Facebook specifically for its role in amplifying vaccine misinformation. Last Friday,  Biden told reporters that platforms like Facebook were “killing people” by platforming false vaccine information. A Facebook spokesperson responded, saying, “The facts show that Facebook is helping save lives. Period.”\n On Monday,  Biden walked back that statement, saying that misinformation was “killing people,” not Facebook itself. Still, White House Communications Director Kate Bedingfield  told MSNBC  Tuesday that the administration was reviewing Section 230 in order to determine a means of combating COVID-19 misinformation.\n “Certainly they should be held accountable,” Bedingfield said of social media companies Tuesday. “It is a big and complicated ecosystem, and everybody bears responsibility to ensure that we are not providing people with bad information about a vaccine that will save their lives.”", "posttime": "2021-07-23 03:35:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "社交,shield,错误信息", "title": "两名民主党参议员提出一项法案，如果社交媒体平台放大有害的公共卫生错误信息，则剥夺社交媒体平台的第 230 条责任盾", "title_en": "Two Democratic senators introduce a bill to strip away social media platforms' Section 230 liability shield if they amplify harmful public health misinformation", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22588903/covid19-misinformation-section-230-facebook-joe-biden-white-house?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["社交", "shield", "错误信息"]}, {"category": "", "categoryclass": "", "imagename": "d82e64368513cbd17733d4548f9155be.jpg", "infoid": 1069092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿大学的研究人员开发了一种方法，该方法使用游戏显卡来控制原型聚变反应堆中的等离子体形成。这里显示的是反应器内部的视图：等离子体（明亮的流）从设备顶部的注射器进入，然后围绕中间可见的两个锥体组织成一个环（这里的视图是从环的侧面） .这些等离子流移动得非常快——这段视频只有千分之三秒长。图片来源：华盛顿大学 这个过程也发生在太阳中，它涉及等离子体，即由带电粒子组成的流体，被加热到极高的温度，使原子融合在一起，释放出丰富的能量。在地球上进行这种反应的一个挑战是等离子体的动态特性，必须对其进行控制以达到允许聚变发生所需的温度。现在，华盛顿大学的研究人员开发了一种利用计算机游戏行业进步的方法：它使用游戏图形卡或 GPU 来运行其原型聚变反应堆的控制系统。 “您需要等离子体具有这种水平的速度和精度，因为它们具有如此复杂的动态变化，并且以非常高的速度发展。如果你跟不上它们，或者如果你错误地预测了等离子体的反应，它们就会有一个非常糟糕的习惯，很快就会朝着完全错误的方向发展。部。 “大多数应用程序都试图在系统非常静态的区域中运行。至多你所要做的就是把东西“推”回原处，”汉森说。 “在我们的实验室中，我们正在努力开发方法，以在更动态的系统中积极地将等离子体保持在我们想要的位置。” UW 团队的实验反应堆完全在等离子体内自行产生磁场，使其可能比其他使用外部磁场的反应堆更小、更便宜。 “通过向等离子体添加磁场，您可以移动和控制它们，而无需‘接触’等离子体，”汉森说。 “例如，当来自太阳的等离子体进入地球磁场时，北极光就会发生，地球磁场会捕获它并使其向下流向两极。当它撞击大气层时，带电粒子会发光。”\n华盛顿大学团队的原型反应堆将等离子体加热到大约 100 万摄氏度（180 万华氏度）。这远低于聚变所需的 1.5 亿摄氏度，但足以研究这个概念。在这里，等离子体在设备上的三个注射器中形成，然后它们结合并自然地组织成一个环形物体，如烟圈。这些等离子体只持续千分之几秒，这就是为什么该团队需要一种高速方法来控制正在发生的事情。以前，研究人员使用速度较慢或不太友好的技术来对他们的控制系统进行编程。因此，该团队转向了专为机器学习应用程序设计的 NVIDIA Tesla GPU。 “GPU 为我们提供了大量的计算能力，”主要作者、华盛顿大学航空航天系研究科学家凯尔摩根说。 “这种性能水平是由计算机游戏行业以及最近的机器学习驱动的，但这款显卡也为控制等离子提供了一个非常好的平台。”使用显卡，该团队可以微调等离子体进入反应器的方式，让研究人员更准确地了解等离子体形成时发生的情况——最终有可能使团队创造出更接近条件的寿命更长的等离子体需要受控的聚变功率。 “最大的不同在于未来，”汉森说。 “这个新系统让我们可以尝试更新、更先进的算法，这些算法可以实现更好的控制，这可以为等离子体和聚变技术打开一个新应用的世界。”本文的其他合著者是 UW 航空航天系研究科学家 Aaron Hossack；布赖恩纳尔逊，华盛顿大学电气和计算机工程系的附属研究教授；和 Derek Sutherland，他在华盛顿大学完成了博士学位，但现在是 CTFusion, Inc. 的首席执行官。这项研究由美国能源部和 CTFusion, Inc. 通过高级研究计划署能源奖资助。", "note_en": "UW researchers have developed a method that uses a gaming graphics card to control plasma formation in their prototype fusion reactor. Shown here is a view from inside the reactor: Plasma (bright streams) enters from the injectors on the top of the device and then organizes into a ring around the two cones visible in the middle (view here is from the side of the ring). These plasma streams move very quickly — this video is only three-thousandths of a second long.  Credit: University of Washington\n   This process, which also occurs in the sun, involves plasmas, fluids composed of charged particles, being heated to extremely high temperatures so that the atoms fuse together, releasing abundant energy.\n One challenge to performing this reaction on Earth is the dynamic nature of plasmas, which must be controlled to reach the required temperatures that allow fusion to happen. Now researchers at the University of Washington have developed a method that harnesses advances in the computer gaming industry: It uses a gaming graphics card, or GPU, to run the control system for their prototype fusion reactor.\n  “You need this level of speed and precision with plasmas because they have such complex dynamics that evolve at very high speeds. If you cannot keep up with them, or if you mispredict how plasmas will react, they have a nasty habit of going in the totally wrong direction very quickly,” said co-author  Chris Hansen, a UW senior research scientist in the aeronautics and astronautics department.\n “Most applications try to operate in an area where the system is pretty static. At most all you have to do is ‘nudge’ things back in place,” Hansen said. “In our lab, we are working to develop methods to actively keep the plasma where we want it in more dynamic systems.”\n The UW team’s experimental  reactor self-generates magnetic fields entirely within the plasma, making it potentially smaller and cheaper than other reactors that use external magnetic fields.\n “By adding magnetic fields to plasmas, you can move and control them without having to ‘touch’ the plasma,” Hansen said. “For example, the northern lights occur when plasma traveling from the sun runs into the Earth’s magnetic field, which captures it and causes it to stream down toward the poles. As it hits the atmosphere, the charged particles emit light.”\n The UW team’s prototype reactor heats plasma to about 1 million degrees Celsius (1.8 million degrees Fahrenheit). This is far short of the 150 million degrees Celsius necessary for fusion, but hot enough to study the concept.\n Here, the plasma forms in three injectors on the device and then these combine and naturally organize into a doughnut-shaped object, like a smoke ring. These plasmas last only a few thousandths of a second, which is why the team needed to have a high-speed method for controlling what’s happening.\n Previously, researchers have used slower or less user-friendly technology to program their control systems. So the team turned to an NVIDIA Tesla GPU, which is designed for machine learning applications.\n “The GPU gives us access to a huge amount of computing power,” said lead author  Kyle Morgan, a UW research scientist in the aeronautics and astronautics department. “This level of performance was driven by the computer gaming industry and, more recently, machine learning, but this graphics card provides a really great platform for controlling plasmas as well.”\n  Using the graphics card, the team could fine-tune how plasmas entered the reactor, giving the researchers a more precise view of what’s happening as the plasmas form — and eventually potentially allowing the team to create longer-living plasmas that operate closer to the conditions required for controlled fusion power.\n “The biggest difference is for the future,” Hansen said. “This new system lets us try newer, more advanced algorithms that could enable significantly better control, which can open a world of new applications for plasma and fusion technology.”\n Additional co-authors on this paper are  Aaron Hossack, a UW research scientist in the aeronautics and astronautics department;  Brian Nelson, a UW affiliate research professor in the electrical and computer engineering department; and  Derek Sutherland, who completed a doctoral degree at the UW but is now the CEO of CTFusion, Inc. This research was funded by the U.S. Department of Energy and by CTFusion, Inc., through an Advanced Research Projects Agency-Energy award.", "posttime": "2021-07-23 03:34:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,显卡,graphics,等离子体", "title": "用于控制原型聚变反应堆中等离子体形成的游戏显卡", "title_en": "Gaming graphics card to control plasma formation in prototype fusion reactor", "transed": 1, "url": "https://www.washington.edu/news/2021/07/22/gaming-graphics-card-allows-faster-more-precise-control-of-fusion-energy-experiments/", "via": "", "real_tags": ["游戏", "显卡", "graphics", "等离子体"]}, {"category": "", "categoryclass": "", "imagename": "2a1b9a19477de7737ddb70383055c74c.jpg", "infoid": 1069091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在病例不断增加的情况下，疾病预防控制中心主任警告说，美国正处于大流行的“另一个关键点”。视频 疾病控制与预防中心主任罗谢尔·瓦伦斯基博士警告说，美国正处于“这场大流行的另一个关键点”，因为传染性 Delta 变体继续推动大多数新的 Covid-19 病例。 “Delta 变种正在以令人难以置信的效率传播，现在占美国流行病毒的 83% 以上。与我们在大流行开始时最初在美国传播的病毒相比，Delta 变体比以前传播的毒株更具攻击性，并且更容易传播。它是我们所知道的最具传染性的呼吸道病毒之一，我在 20 年的职业生涯中见过这种病毒。我们正处于这场大流行病的另一个关键时刻，病例再次上升，一些医院在某些地区达到了产能。” “未接种疫苗的人几乎占美国新冠肺炎住院和死亡人数的 97%。数据很清楚。病例增加集中在疫苗接种率低的社区。”美国疾病控制与预防中心主任周四对冠状病毒大流行发出了新的紧急基调，警告说美国“还没有走出困境”，并再次处于“这场大流行的另一个关键点”因为高度传染性的 Delta 变种在疫苗接种率低的社区中肆虐。在白宫 Covid-19 应对小组成员的简报会上，主任罗谢尔·瓦伦斯基 (Rochelle Walensky) 博士发出的警告与几周前相比有了显着转变，当时拜登总统在美国南部草坪举办了一场盛大的七月四日派对。白宫宣布独立于病毒。这反映出政府官员越来越担心他们似乎已经取得的成果正在被抹去——目前病例的激增将使该国疫苗接种率低、住院率高的部分地区的卫生系统不堪重负。尽管如此，新病例、住院人数和死亡人数仍处于之前破坏性高峰的一小部分。疫苗对 Covid-19 的最坏结果仍然有效，包括 Delta 变体，CDC 本周早些时候估计，这种变体占美国新病例的 83%。\n根据疾病预防控制中心的数据，全国只有不到一半的人完全接种了疫苗，只有不到 60% 的符合条件的人接种了疫苗。 Walensky 博士恳求未接种疫苗的人“请认真对待 Delta 变种”，并补充说，“这种病毒已经没有放弃的动力，它仍然在寻找下一个易感染的人。请考虑接种疫苗并采取预防措施，直到您接种为止。”白宫官员周四还宣布，作为美国救援计划的一部分，他们将花费国会授权的 16 亿美元用于在“高风险聚集环境”（包括无家可归者收容所和监狱）中进行测试和其他缓解措施。他们表示，他们将向农村卫生诊所捐赠 1 亿美元，以支持那些疫苗接种率普遍较低的社区的疫苗教育和外展工作。对于 CDC 是否会重新审视其口罩指南的问题，Walensky 博士说，CDC 目前的指南保持不变，并补充说：“如果您接种了疫苗，您将获得疫苗的特殊保护，但您有机会做出个人选择添加额外的保护层。”", "note_en": "Amid rising cases, the C.D.C. director warns the U.S. is at ‘another pivotal point’ in the pandemic.\n Video Dr. Rochelle Walensky, the director of the Centers for Disease Control and Prevention, warned that the U.S. is at “another pivotal point in this pandemic” as the infectious Delta variant continues to drive the majority of new Covid-19 cases.\n “The Delta variant is spreading with incredible efficiency, and now represents more than 83 percent of the virus circulating in the United States. Compared to the virus we had circulating initially in the United States at the start of the pandemic, the Delta variant is more aggressive, and much more transmissible than previously circulating strains. It is one of the most infectious respiratory viruses we know of, and that I have seen in my 20-year career. We are yet at another pivotal moment in this pandemic, with cases rising again and some hospitals reaching their capacity in some areas.” “Unvaccinated individuals account for virtually all 97 percent of the Covid hospitalizations and deaths in the U.S. The data is clear. The case increases are concentrated in communities with low vaccination rates.”\n The director of the Centers for Disease Control and Prevention struck a  new tone of urgency on Thursday about the coronavirus pandemic, warning that the United States is “not out of the woods yet” and is once again at “another pivotal point in this pandemic” as the highly infectious Delta variant  rips through communities with low rates of vaccination.\n The warning from the director, Dr. Rochelle Walensky, during a briefing by members of the White House Covid-19 response team, was a marked shift from just weeks ago, when  President Biden threw a big Fourth of July party on the South Lawn of the White House to declare independence from the virus.\n It reflects a growing concern among administration officials that the gains they appeared to have made are being erased — and that the current surge in cases will  overwhelm health systems in parts of the country  where vaccination rates are low and hospitalizations are high.\n Still, new cases, hospitalizations and deaths remain at a fraction of their previous devastating peaks. Vaccines remain effective against the worst outcomes of Covid-19, including from the Delta variant, which the C.D.C. earlier this week  estimated accounts for 83 percent of new cases in the United States.\n Slightly fewer than half of the country was fully vaccinated, as were just under 60 percent of eligible people, according to  data from the C.D.C.\n Dr. Walensky pleaded with unvaccinated people to “please take the Delta variant seriously,” adding, “This virus has no incentive to let up, and it remains in search of the next vulnerable person to infect. Please consider getting vaccinated and take precautions until you do.”\n White House officials also announced Thursday that they will spend $1.6 billion authorized by Congress as part of the American Rescue Plan on testing and other mitigation measures in “high risk congregant settings,” including homeless shelters and prisons. And they said they would send $100 million to rural health clinics to support vaccine education and outreach efforts in those communities, where vaccination rates are generally low.\n Amid questions about whether the C.D.C.  might revisit its mask guidance, Dr. Walensky said that the C.D.C.’s current guidance remains unchanged, adding, “If you are vaccinated you get exceptional protection from the vaccines, but you have the opportunity to make the personal choice to add extra layers of protection.”", "posttime": "2021-07-23 03:34:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,警告,director,疫苗", "title": "CDC主任警告美国正处于大流行的“另一个关键点”", "title_en": "CDC Director Warns U.S. Is at ‘Another Pivotal Point’ in Pandemic", "transed": 1, "url": "https://www.nytimes.com/2021/07/22/us/politics/cdc-delta-cases.html", "via": "", "real_tags": ["美国", "警告", "director", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "f0a3999fa4e004944532ea4d615c6335.jpg", "infoid": 1069089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，一场致命的热浪席卷了太平洋西北部，在一个不习惯三位数温度的地区，医院急诊室不堪重负，医生们求助于一种严峻但实用的工具来挽救生命：装满冰和水的人体袋。西雅图和华盛顿州伦顿医院的官员表示，随着越来越多的人到达可能会致命的中暑，并且冷却导管甚至冰袋供应不足，他们使用这种新颖的治疗方法让几名老年人迅速浸入水中并降温。 UW Medicine 的 Harbourview 医疗中心的急诊医师 Alex St. John 博士说，将中暑患者拉入装满冰块的尸体袋效果很好，以至于在气候变化日益改变的世界中，它可能成为首选治​​疗方法。 “我有一种感觉，我们未来会看到更多极端高温天气，而且这种情况可能会变得更加普遍，”他说。斯坦福大学急诊医学教授格兰特·利普曼 (Grant Lipman) 博士说，尽管裹尸袋的含义令人毛骨悚然，但使用它们是一种廉价、方便且可扩展的方法来治疗因过热引起的大规模伤亡紧急情况的患者。他与人合着了一项开创性的案例研究，记录了医生所谓的“人体遗骸袋”用于中暑的情况。中暑是最危险的中暑疾病，是一种医疗紧急情况，可导致多达三分之一的住院患者死亡。它发生在身体过热时，要么是因为在高温下运动，要么是因为长时间暴露在高温下而没有缓解。核心体温升至华氏 104 度或更高，这会损害大脑和其他器官。中暑对儿童和老年人尤其危险，因为他们的身体不能很好地调节温度。此外，老年人可能服用的药物会削弱他们耐受高温的能力。\n患者通常会使用有策略地放置的冰袋或用水雾化并放置在巨大的风扇前进行治疗。一些急诊室工作人员将患者浸入大桶水中或将冷却导管插入身体的大静脉。圣约翰在 6 月 28 日治疗了近两打中暑患者，这是六天热浪中最热的时期，当时西雅图的气温飙升至创纪录的 108 度。他说，这比他当医生的十年里见过的还要多，包括在亚利桑那沙漠​​的医院工作。急诊科主任卡梅伦·巴克博士说，同样，位于伦顿的威斯康星大学谷医疗中心治疗了 70 多名与高温有关的疾病，其中 3 人接受了尸袋治疗。根据疾病控制和预防中心的数据，从 6 月 25 日到 6 月 30 日，在俄勒冈州、华盛顿州、爱达荷州和阿拉斯加州等地区，共有近 2,800 人因中暑就诊，其中仅 6 月 28 日就超过 1,000 人次。州官员说，华盛顿至少有 112 人死亡，俄勒冈州有 115 人死亡与热浪有关。在圣约翰看到的病情最严重的患者中，有一名 70 多岁的女性，她于 6 月 28 日到达港景急诊室，神志不清，身体虚弱，核心体温为 104 度。一位家庭成员在家里发现她生病了。圣约翰说，几天前一位同事提到了尸体袋技术，所以他试了一下。治疗包括用水和冰浆填充尸体袋，将患者放入体内并将袋子拉到腋窝处，以便进入医疗设备并进行密切监测。自给式袋子将冰和水保持在靠近患者皮肤的位置。圣约翰说，在她被放入袋子后几分钟内，该女子的体温下降到 100.4 度，刚好足以“让她离开那个危险区域”。她从袋子里取出，晾干并放在轮床上，让她身体的自然冷却能力接管。他说，在她入院后，她完全康复了。\n斯坦福大学荒野医学奖学金负责人利普曼说，由于气候变化的影响导致更多地方气温升高——包括历史上没有广泛使用空调的温带地区——使用尸体袋快速治疗中暑是一个合乎逻辑的解决方案。并运行 Global Outdoor Emergency Support，为户外旅行者提供医疗指导。他和同事描述了在旧金山湾区（另一个不习惯持续高温的地区）的一个停车场中，一名 87 岁的癌症妇女在一场热浪中被发现失去知觉。那是 2019 年 7 月，当时被指定为地球上有记录以来最热的月份。医生使用装满冰水的尸体袋，在 10 分钟内将她的体温从 104 度降至 101.1 度。她也完全康复了。利普曼说，长期以来，将患者浸入冷水中一直是治疗因劳累引起的中暑的金标准。这是最有效的方法，因为水从身体中传导热量的速度大约是空气的 25 倍。目前，尸体袋疗法主要在年轻、健康的人群中进行研究，一些医生担心冷水对老年人的影响，以及该技术是否会引起寒颤，实际上会升高体温。利普曼同意需要进一步研究，但表示他的经验发现“冷却的好处将超过颤抖的任何危害。”那些一想到被拉进尸体袋就会不寒而栗的病人呢？利普曼说，因为他们到达时通常病得很重，而且很快得到治疗，所以“他们不太可能意识到”，并补充说：“但你需要问他们。”", "note_en": "As a deadly  heat wave scorched the Pacific Northwest last month, overwhelming hospital emergency rooms in a region unaccustomed to triple-digit temperatures, doctors resorted to a grim but practical tool to save lives: human body bags filled with ice and water.\n Officials at hospitals in Seattle and Renton, Washington, said that as more people arrived experiencing potentially fatal heatstroke, and with cooling catheters and even ice packs in short supply, they used the novel treatment to quickly immerse and cool several elderly people.\n   Zipping heatstroke patients into ice-filled body bags worked so well that it could become a go-to treatment in a  world increasingly altered by climate change, said Dr. Alex St. John, an emergency physician at UW Medicine&#39;s Harborview Medical Center.\n &#34;I have a feeling that we&#39;re looking at many more days of extreme heat in the future, and this is likely to become more common,&#34; he said.\n  Despite the macabre connotation of body bags, using them is a cheap, convenient and scalable way to treat patients in mass casualty emergencies caused by excessive heat, said Dr. Grant Lipman, a Stanford University professor of emergency medicine. He co-authored a pioneering  case study documenting the use of what doctors call &#34;human remains pouches&#34; for heatstroke.\n   Heatstroke, the most dangerous type of heat illness, is a medical emergency that leads to death in up to a third of hospitalized patients. It occurs when the body overheats, either because of exertion in high temperatures or because of prolonged exposure to heat with no relief. The core body temperature rises to 104 degrees Fahrenheit or higher, which can damage the brain and other organs.\n Heatstroke can be particularly dangerous for children and older people, whose bodies don&#39;t regulate temperature well. In addition, elderly people may take medications that impair their ability to tolerate high temperatures.\n Patients typically would be treated with strategically placed ice packs or misted with water and placed in front of huge fans. Some emergency room staffers immerse patients in large tubs of water or insert cooling catheters into the body&#39;s large veins.\n   St. John treated nearly two dozen heatstroke patients on June 28, the hottest period of a six-day heat wave, when temperatures in Seattle shot to a record 108 degrees. That was more than he&#39;d seen at one time in his decade as a doctor, including working in hospitals in the Arizona desert, he said.\n  Similarly, UW Valley Medical Center in Renton treated more than 70 patients with heat-related illnesses, three of whom who were treated using body bags, said Dr. Cameron Buck, director of the emergency department.\n   Overall,  nearly 2,800 emergency department visits for heat illness were logged from June 25 through June 30 in a region that includes Oregon, Washington, Idaho and Alaska, including more than 1,000 on June 28 alone, according to the Centers for Disease Control and Prevention. At least 112 deaths in Washington and 115 deaths in Oregon have been linked to the heat wave, state officials said.\n  Among the sickest patients St. John saw was a woman in her 70s who arrived at the Harborview ER on June 28 confused and weak, with a core body temperature of 104 degrees. A family member had discovered her ill at home. St. John said a colleague had mentioned the body bag technique just days earlier, so he gave it a try.\n  The treatment involves filling a body bag with a slurry of water and ice, putting the patient inside and zipping the bag just up to the armpits to allow access for medical equipment and close monitoring. The self-contained bag keeps the ice and water close to the patient&#39;s skin.\n Within several minutes of her being placed into the bag, the woman&#39;s temperature dropped to 100.4 degrees, just enough to &#34;get her out of that danger zone,&#34; St. John said. She was removed from the bag, dried off and placed on a gurney, allowing her body&#39;s natural cooling abilities to take over. After she was admitted to the hospital, she recovered fully, he said.\n As the effects of  climate change lead to hotter temperatures in more places — including historically temperate zones where air conditioning isn&#39;t in wide use — using body bags to rapidly treat heat illness is a logical solution, said Lipman, who directs Stanford&#39;s Wilderness Medicine Fellowship and runs  Global Outdoor Emergency Support, which provides medical guidance for outdoor travelers.\n   He and colleagues described the treatment of an 87-year-old woman with cancer who was found unconscious in a parking lot during a heat wave in the San Francisco Bay Area, another region not accustomed to sustained high temperatures. It was July 2019, which was then designated  the hottest month recorded on Earth. Using the ice- and water-filled body bags, doctors cooled her temperature from 104 degrees to 101.1 within 10 minutes. She, too, fully recovered.\n Immersing patients in cold water has long been the gold standard for treating athletes with heatstroke caused by exertion, Lipman said. It&#39;s the most efficient method because water conducts heat away from the body about 25 times faster than air.\n For now, the body bag treatment has been studied mostly in younger, healthier people, and some doctors worry about the effects of cold water on older people and whether the technique might induce shivering that actually raises body temperature. Lipman agrees that further study is needed but said his experience has found that &#34;the cooling benefits will outweigh any harm of shivering.&#34;\n And what about patients who might shudder at the thought of being zipped into body bags?\n  Because they&#39;re generally so ill when they arrive and get treated so quickly, it&#39;s &#34;unlikely they&#39;re aware,&#34; Lipman said, adding: &#34;But you&#39;d need to ask them.&#34;", "posttime": "2021-07-23 03:33:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高温,heat,中暑", "title": "随着极端高温变得越来越普遍，急诊室求助于尸袋来挽救生命", "title_en": "As extreme heat becomes more common, ERs turn to body bags to save lives", "transed": 1, "url": "https://www.nbcnews.com/health/health-news/extreme-heat-becomes-more-common-ers-turn-body-bags-save-n1274675", "via": "", "real_tags": ["高温", "heat", "中暑"]}, {"category": "", "categoryclass": "", "imagename": "2f658358a1220f061cbb912384a8b3ba.jpg", "infoid": 1069088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Absci 专注于加速临床前阶段的药物开发。该公司已经开发并获得了一些工具，可以预测候选药物、识别潜在的治疗靶点、在数十亿个细胞上测试治疗性蛋白质并确定哪些是值得追求的。 “我们正在为药物开发提供完全集成的端到端解决方案，”Absci 创始人 Sean McClain 告诉 TechCrunch。 “将其视为蛋白质药物发现和生物制造的 Google 索引搜索。”根据 S-1 文件，IPO 最初定价为每股 16 美元，投前估值约为 15 亿美元。该公司将发行 1250 万股普通股，并计划筹集 2 亿美元。然而，截至撰写本文时，Absci 的股价已经飙升至每股 21 美元。普通股的交易代码为“ABSI”。麦克莱恩说，公司现在选择上市，以提高公司吸引和留住新人才的能力。 “随着我们继续快速增长和扩大规模，我们需要接触最优秀的人才，而 IPO 为我们在人才获取和保留方面提供了惊人的可见性，”麦克莱恩说。 Absci 成立于 2011 年，专注于在大肠杆菌中制造蛋白质。到 2018 年，该公司推出了第一款名为 SoluPro 的商业产品——一种可以构建复杂蛋白质的生物基因系统。 2019 年，该公司通过实施“蛋白质打印”平台扩大了这一过程。自成立以来，Absci 已发展到 170 名员工并筹集了 2.3 亿美元——最近一次涌入的是 1.25 亿美元的交叉融资，该轮融资于 2020 年 6 月结束，由 Casdin Capital 和 Redmile Group 领投。但今年，两项重大收购完善了 Absci 的产品，从蛋白质制造和测试到支持人工智能的药物开发。 2021 年 1 月，Absci 收购了 Denovium，这是一家使用深度学习 AI 对蛋白质的行为进行分类和预测的公司。 Denovium 的“引擎”已经接受了超过 1 亿种蛋白质的训练。 6 月，该公司还收购了 Totient，这是一家分析免疫系统对某些疾病的反应的生物技术公司。在 Totient 被收购时，该公司已经从 50,000 名患者的免疫系统数据中重建了 4,500 种抗体。\nAbsci 已经具备蛋白质制造、评估和筛选能力，但收购 Totient 使其能够识别新药的潜在目标。 Denovium 的收购增加了一个基于人工智能的引擎，以帮助发现蛋白质。 “我们现在正在做的是将 [我们自己的数据] 输入深度学习模型，这就是我们收购 Denovium 的原因。在加入 Totient 之前，我们正在进行药物发现和细胞系开发。这种[收购]使我们能够完全整合，现在我们也可以进行目标发现，”麦克莱恩说。这两次收购使 Absci 成为药物开发领域中一个特别活跃的利基市场。首先，即使在药物研发的低回报几十年之后，在开发新的药物开发方法方面也有一些值得注意的财政利益。 2021 年上半年，Evaluate 报告称，新药开发商在西方交易所的 IPO 中筹集了约 90 亿美元。尽管事实上药物开发在传统上是高风险的。德勤 2021 年的一份报告指出，生物制药的研发回报率在 2019 年创下 1.6% 的历史新低，目前仅反弹至 2.5% 左右。在药物开发领域，我们已经看到人工智能发挥着越来越大的作用。同一份德勤报告指出，“大多数生物制药公司正试图将人工智能整合到药物发现和开发过程中。”而且，根据斯坦福大学的人工智能指数年度报告，药物发现项目在 2020 年获得了最多的 AI 投资美元。最近，在药物开发中使用人工智能的前景得到了公司的支持，这些公司已经将候选人转移到了临床前开发阶段。今年 6 月，总部位于香港的初创公司 Insilico Medicine 宣布，它已经通过临床前测试阶段带来了一种人工智能识别的特发性肺纤维化候选药物——这一壮举帮助完成了 2.55 亿美元的 C 轮融资。创始人 Alexander Zharaonkov 告诉 TechCrunch，PI 药物将在今年年底或明年初开始对该药物进行临床试验。\n凭借在人工智能和蛋白质制造方面的一手，Absci 已经将自己定位在一个拥挤但充满炒作的空间。但展望未来，该公司仍需制定其商业模式的细节。 Absci 正在寻求与药品制造商的合作商业模式。这意味着该公司没有计划进行自己的临床试验。相反，它希望通过“里程碑付款”（以达到药物开发过程的某些阶段为条件）或销售特许权使用费来赚取收入。麦克莱恩说，这确实提供了一些优势。在投入数百万研发资金进行测试后，该公司能够规避候选药物失败的风险，并且可以一次投资开发“数百种”候选药物。在这一点上，Absci 确实有九个目前与制药商合作的“活跃项目”。该公司的细胞系制造平台正在八家生物制药公司的药物测试项目中使用，包括默克、安斯泰来和 Alpha Cancer 技术（其余未公开）。根据该公司的 S-1 文件，其中五个项目处于临床前阶段，一个处于 1 期临床试验阶段，一个处于 3 期临床试验阶段，最后一个专注于动物健康。一家名为 Astellas 的公司目前正在使用 Absci 的发现平台。但麦克莱恩指出，Absci 今年才刚刚推出其药物发现能力。然而，这些合作伙伴都没有正式许可 Absci 的任何平台用于临床或商业用途。麦克莱恩指出，九个活跃的项目都有里程碑和与之相关的版税“潜力”。在盈利能力方面，该公司确实有一些需要弥补的地方。今年到目前为止，Absci 的总收入约为 480 万美元，高于 2019 年的约 210 万美元。 尽管如此，成本仍然很高，S-1 文件指出，该公司在过去两年中出现了净亏损。 2019 年，该公司报告 2019 年净亏损 660 万美元，2020 年净亏损 1440 万美元。\n该公司的 S-1 将这些损失归结为与研发成本、建立知识产权组合、招聘人员、筹集资金和为这些活动提供支持相关的支出。麦克莱恩指出，Absci 最近完成了占地 77,000 平方英尺的设施的建设。因此，展望未来，该公司确实预见了扩大其运营规模的潜力。在不久的将来，该公司计划利用 IPO 筹集的资金来增加使用 Absci 技术的程序数量，投资研发并继续完善公司基于人工智能的新产品。", "note_en": "Absci focuses on speeding drug development in the preclinical stages. The company has developed and acquired a handful of tools that can predict drug candidates, identify potential therapeutic targets, and test therapeutic proteins on billions of cells and identify which ones are worth pursuing.\n “We are offering a fully-integrated end-to-end solution for pharmaceutical drug development,” Absci founder Sean McClain tells TechCrunch. “Think of this as the Google index search for protein drug discovery and biomanufacturing.”\n  The IPO was initially priced at $16 per share, with a pre-money valuation of about $1.5 billion,   per S-1 filings .  The company is offering 12.5 million shares of common stock, with plans to raise $200 million. However, Absci stock has already ballooned to  $21 per share as of writing. Common stock is trading under the ticker “ABSI.”\n The company has elected to go public now, McClain says, to increase the company’s ability to attract and retain new talent. “As we continue to rapidly grow and scale, we need access to the best talent, and the IPO gives us amazing visibility for talent acquisition and retention,” says McClain.\n Absci was founded in 2011 with a focus on manufacturing proteins in  E.Coli . By 2018, the company had launched its first commercial product called SoluPro – a biogeneered E.Coli system that can build complex proteins. In 2019, the company scaled this process up by implementing a “protein printing” platform.\n Since its founding Absci has grown to 170 employees and raised $230 million – the most recent influx was a $125 million crossover financing round closed in June 2020 led by  Casdin Capital and Redmile Group. But this year, two major acquisitions have rounded out Absci’s offerings from protein manufacturing and testing to AI-enabled drug development.\n In January 2021, Absci acquired Denovium, a company using deep learning AI to categorize and predict the behavior of proteins. Denovium’s “engine” had been trained on more than 100 million proteins. In June, the company also acquired Totient, a biotech company that analyzes the immune system’s response to certain diseases. At the time of Totient’s acquisition, the company had already reconstructed 4,500 antibodies gleaned from immune system data from 50,000 patients.\n Absci already had protein manufacturing, evaluation and screening capabilities, but the Totient acquisition allowed it to identify potential targets for new drugs. The Denovium acquisition added an AI-based engine to aid in protein discovery.\n “What we’re doing is now feeding [our own data] into deep learning models and so that is why we acquired Denovium. Prior to Totient we were doing drug discovery and cell line development. This [acquisition] allows us to go fully integrated where we can now do target discovery as well,” McClain says.\n These two acquisitions place Absci into a particularly active niche in the drug development world.\n To start with, there’s been some noteworthy fiscal interest in developing new approaches to drug development, even after decades of low returns on drug R&amp;D.  In the first half of 2021,   Evaluate  reported that new drug developers raised about   $9 billion  in IPOs on Western exchanges. This is despite the fact that drug development is traditionally high risk. R&amp;D returns for biopharmaceuticals hit a record low of 1.6 percent in 2019, and have rebounded to only about 2.5 percent, a Deloitte 2021   report notes.\n Within the world of drug development, we’ve seen AI play an increasingly large role. That same Deloitte report notes that “most biopharma companies are attempting to integrate AI into drug discovery, and development processes.” And, drug discovery projects received the greatest amount of AI investment dollars in 2020, according to Stanford University’s Artificial Intelligence Index   annual report .\n More recently, the outlook on the use of AI in drug development has been bolstered by companies that have moved a candidate through the stages of pre-clinical development.\n In June, Insilico Medicine, a Hong Kong-based startup, announced that it had brought an A.I-identified drug candidate for idiopathic pulmonary fibrosis through the preclinical testing stages – a feat that helped close a   $255 million Series C round . Founder Alexander Zharaonkov told TechCrunch the PI drug would begin a clinical trial on the drug late this year or early next year.\n With a hand in AI and in protein manufacturing, Absci has already positioned itself in a crowded, but hype-filled space. But going forward, the company will still have to work out the details of its business model.\n Absci is pursuing a partnership business model with drug manufacturers. This means that the company doesn’t have plans to run clinical trials of its own. Rather, it expects to earn revenue through “milestone payments” (conditional upon reaching certain stages of the drug development process) or, if drugs are approved, royalties on sales.\n This does offer some advantages, says McClain. The company is able to sidestep the risk of drug candidates failing after millions of R&amp;D cash is poured into testing and can invest in developing “hundreds” of drug candidates at once.\n At this point, Absci does have nine currently “active programs” with drugmakers. The company’s cell line manufacturing platforms are in use in drug testing programs at eight biopharma companies, including Merck, Astellas, and Alpha Cancer technologies (the rest are undisclosed). Five of these projects are in the preclinical stage, one is in Phase 1 clinical trials, one is in a Phase 3 clinical trial, and the last is focused on animal health, per the company’s S-1 filing.\n One company, Astellas, is currently using Absci’s discovery platforms. But McClain notes that Absci has only just rolled out its drug discovery capabilities this year.\n However, none of these partners have formally licensed any of Absci’s platforms for clinical or commercial use. McClain notes that the nine active programs have milestones and royalty “potentials” associated with them.\n The company does have some ground to make up when it comes to profitability. So far this year, Absci has generated about $4.8 million in total revenue – up from about $2.1 million in 2019. Still, the costs have remained high, and S-1 filings note that the company has incurred net losses in the past two years. In 2019, the company reported $6.6 million in net losses in 2019 and $14.4 million in net losses in 2020.\n The company’s S-1 chalks up these losses to expenditures related to cost of research and development, establishing an intellectual property portfolio, hiring personnel, raising capital and providing support for these activities.\n Absci has recently completed the construction of a 77,000 square foot facility, notes McClain. So going forward the company does foresee the potential to increase the scale of its operations.\n In the immediate future, the company plans to use money raised from the IPO to grow the number of programs using Absci’s technology, invest in R&amp;D and continue to refine the company’s new AI-based products.", "posttime": "2021-07-23 03:00:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,发现,protein", "title": "蛋白质发现平台 Absci pop 的股票上市", "title_en": "\n\t\t\t\tShares of protein discovery platform Absci pop in market debut\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/shares-of-protein-discovery-platform-absci-pop-in-market-debut/", "via": "", "real_tags": ["股票", "发现", "protein"]}, {"category": "", "categoryclass": "", "imagename": "184b4834133744a12d499e51996c4854.jpg", "infoid": 1069087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位熟悉此举的消息人士告诉 TechCrunch，该公司将首先招聘大约 12 名工程师，他们将在谷歌位于 Bakery Square 区的现有办公室共同办公。截至周四，Waymo 的网站上只列出了匹兹堡地区的大约三个空缺职位，但该公司将很快增加更多职位。一些新团队将来自位于匹兹堡的 RobotWits，这是一家专注于自动驾驶汽车决策的科技初创公司。其中包括 RobotWits 的创始人兼首席执行官 Maxim Likhachev，以及其工程和技术团队的其他成员。消息人士称，虽然从技术上讲，Waymo 并未收购这家初创公司，但它确实获得了 RobotWits 的知识产权。消息人士补充说，目前没有计划在匹兹堡部署所谓的 Waymo Driver，即其自动驾驶平台。相反，新团队将致力于运动规划开发、实时路线规划和开发驱动程序。到目前为止，Driver 已经在亚利桑那州凤凰城都市区进行了部署。其 Waymo Via 货运和货运服务将与德克萨斯州的货运物流公司 JB Hunt Transport Services 进行试运行。 AV 技术竞争对手 Aurora、Motional、Argo AI 已经在该市设立了办事处；结合卡内基梅隆大学的人才，该市已成为自主工程开发的真正中心。匹兹堡也是许多小型自动驾驶初创公司的所在地，包括致力于自动驾驶卡车的 Locomation。 Waymo 位于匹兹堡的办事处将加入其在山景城、旧金山、凤凰城、纽约、达拉斯和印度海得拉巴的办事处网络。", "note_en": "The company will start by hiring around a dozen engineers, a source familiar with the move told TechCrunch, and they’ll co-locate in Google’s existing offices in the Bakery Square district. As of Thursday, only around three open positions for the Pittsburgh area were listed on Waymo’s website, but the company will be adding more roles soon.\n Some of the new team will come from Pittsburgh-based RobotWits, a tech startup focused on autonomous vehicle decision-making. That includes RobotWits’ founder and CEO Maxim Likhachev, and other members of its engineering and technical team. While Waymo did not technically acquire the startup, it did acquire RobotWits’ IP rights, the source said.\n  There are no current plans to deploy the so-called Waymo Driver, its autonomous driving platform, in Pittsburgh, the source added. Instead, the new team will work on motion planning development, real-time route planning and developing Driver. Thus far, Driver has seen deployment in the Phoenix, Arizona metro area. Its Waymo Via trucking and cargo service will be deployed  in a test run with trucking logistics company J.B. Hunt Transport Services in Texas.\n AV tech rivals Aurora, Motional, Argo AI have already established offices in the city; combined with talent at Carnegie Melon University, the city has established itself as a bona fide hub for autonomous engineering development. Pittsburgh is also home to many smaller AV startups, including Locomation, which is working on autonomous trucks.\n Waymo’s Pittsburgh location will join its network of offices in Mountain View, San Francisco, Phoenix, New York, Dallas and Hyderabad, India.", "posttime": "2021-07-23 03:00:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "av,open,匹兹堡", "title": "Waymo 将在 AV 技术中心匹兹堡开设办事处", "title_en": "\n\t\t\t\tWaymo to open offices in Pittsburgh, an AV tech hub\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/waymo-to-open-offices-in-pittsburgh-an-av-tech-hub/", "via": "", "real_tags": ["av", "open", "匹兹堡"]}, {"category": "", "categoryclass": "", "imagename": "c72a9ddeab9065a4ed1535bfbc6cab13.jpg", "infoid": 1069086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透社 7 月 22 日 - Alphabet 的 (GOOGL.O) 周四表示，谷歌现在将向其搜索引擎用户展示更多关于它为什么找到显示结果的信息。它表示，人们现在可以通过谷歌搜索查询详细信息，例如他们的结果如何与某些搜索词匹配，以便更好地确定信息是否相关。谷歌一直在做出改变，为用户提供有关其搜索引擎提供的结果的更多背景信息。今年早些时候，它引入了面板来告诉用户他们所看到的信息的来源。当主题快速发展并且搜索结果可能不可靠时，它还开始警告用户。", "note_en": "July 22 (Reuters) - Alphabet&#39;s  (GOOGL.O) Google will now show its search engine users more information about why it found the results they are shown, the company said on Thursday.\n It said people googling queries will now be able to click into details such as how their result matched certain search terms, in order to better decide if the information is relevant.\n Google has been making changes to give users more context about the results its search engine provides. Earlier this year it introduced panels to tell users about the sources of the information they are seeing. It has also started warning users when a topic is rapidly evolving and search results might not be reliable.", "posttime": "2021-07-23 02:56:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,告诉,starting", "title": "谷歌开始告诉你它是如何找到搜索结果的", "title_en": "Google is Starting To Tell You How It Found Search Results", "transed": 1, "url": "https://www.reuters.com/technology/google-is-starting-tell-you-how-it-found-search-results-2021-07-22/", "via": "", "real_tags": ["google", "谷歌", "告诉", "starting"]}, {"category": "", "categoryclass": "", "imagename": "32e74544464681aea6d1fa92376971ac.jpeg", "infoid": 1069085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一凌晨，保守派新闻机构天主教通讯社的执行董事向天主教世界发出警告：一个不知名的天主教团体即将使用移动应用程序数据揭露一名正在发生同性恋的神职人员。他写道，他部分知道这一点，因为早在 2018 年，有人“关注改革天主教神职人员”就找到了他和其他天主教团体、媒体组织和人们，以提供工具来做同样的事情。 “该党声称拥有能够识别神职人员和其他下载流行的‘连接’应用程序的技术，例如 Grindr 和 Tinder，并使用他们的计算机或移动设备的互联网地址来确定他们的位置，”记者，亚历杭德罗·贝穆德斯写道。然后，在周二下午，由前天主教通讯社记者创立的新天主教新闻网站 The Pillar 放弃了其报道。在其中，该网站报道说，美国主教会议秘书长杰弗里·伯里尔 (Jeffrey Burrill) 在过去几年中“几乎每天”访问同性恋酒吧并使用 Grindr。他们的调查基于“对与 Burrill 移动设备相关的应用数据信号的分析”，使用的是“商用应用信号数据记录”。在 Pillar 发表他们的文章时，Burrill 已经辞去了他的职务。后果超出了典型的天主教内讧。许多进步的天主教徒大声反对同性恋牧师的出游和公开播出单身男子与独身主义的私人斗争。其他人再次开始争论男同性恋在神职人员中的地位，以及发布信息的新闻道德。但最直接的反应是对 Pillar 最初发现 Burrill 行为的方式深感不安。看到有人公开跟踪一个人并根据他们的私人应用程序使用情况跟踪他们的行动，这令人不安。据一位从事位置数据相关问题研究的隐私工程师称，Pillar（或在 2018 年向 CNA 提供数据的组织）可能从数据经纪人那里购买了一个数据集，而后者又可能从一个数据经纪人那里购买了这些数据。 Grindr 使用的第三方广告网络。 Grindr 本身不会是数据的来源，但只要用户同意 Grindr 的服务条款，广告网络就可以完全访问用户的信息。 （2018 年，使用高度细化位置信息的 Grindr 被发现与第三方分析公司共享用户的匿名位置、种族、性偏好，甚至 HIV 状况。今年，挪威因披露用户信息而对 Grindr 罚款 1170 万美元&#39; 向广告公司提供私人信息，这违反了欧洲隐私法。Grindr 没有回应 Slate 对其数据隐私政策发表评论的请求。）通过删除某些信息，这些数据将被显示为“匿名”，例如作为用户名。但它会包含应用程序使用时设备的带时间戳的 GPS 位置。隐私工程师说，所有这些都是合法的，但并不是大多数用户在冒险时考虑的因素。购买数据后，Pillar 将能够在数据集中搜索他们已经确定与 Burrill 或一些天主教神职人员有关的位置。 （目前尚不清楚调查是从一开始就针对 Burrill，还是在被调查的神职人员名单中发现了他。根据 Bermudez 的说法，2018 年与他接触的组织还提供了他们所说的使用的知名天主教徒的名字应用程序。）那时，这只是一个交叉引用的问题。东北大学法学和计算机科学教授阿里·埃兹拉·沃尔德曼说：“有一个价值数百亿美元的公司行业，你从未听说过。” “他们的商业模式是从互联网的各个角落收集信息并将其出售给人们，这样他们就可以对人口做出一般性结论并向其做广告。他们说信息是不可识别的。这是另一个彻头彻尾的谎言的例子。”\n这种策略在美国几乎没有先例虽然其他国家的当局已经使用同性恋约会和联播应用程序——主要是通过虚假账户的陷阱——来迫害同性恋者，但美国对该应用程序的担忧更多地与保护用户免受其他用户的侵害。在天主教神职人员的背景下，支柱事件引发了一个令人担忧的前景，在那里，同性恋——并据此行事——被认为是一种越界罪。在他的 CNA 文章中，Bermudez 写道，与他接触的团体希望“私下向教会官员提供这些信息，希望他们能够惩戒或驱逐那些被发现使用这些技术违反他们的神职誓言并可能给他们带来丑闻的人。教堂。”这个群体会有大量的盟友，他们不仅相信同性恋和性活跃的牧师是一种愤怒，因为教会关于性的教义和圣召要求独身，而且因为错误的相信同性恋牧师对性行为负责滥用危机。 （The Pillar 没有提供任何证据表明 Burrill 与未成年人发生过性接触。）JD Flynn 是此次曝光背后的 Pillar 记者之一，周三在一条推文中为自己免受批评进行了辩护，称他和他的合著者已经权衡了个人问题。隐私并决定 Burrill 的 Grindr 使用是一个公共利益问题，因为他是“高级公众人物，直接负责制定和监督政策，解决与教会对待性道德问题有关的文书责任问题。 ”然而，在最初的 Pillar 文章中，记者们明确表示，他们的推理超越了 Burrill 行为的虚伪：“[A] 牧师对该应用程序的任何使用都可能与他在开发和监督方面的角色发生冲突。国家儿童保护政策，正如教会领袖最近几个月呼吁在教会政策中更加强调技术责任。”许多批评者抗议说，在没有证据的情况下，将同性恋与虐待儿童联系起来，暴露了在努力揭露牧师的工作中存在的恐同症。 “当然，它是针对同性恋牧师和&#39;同性恋应用程序&#39;，这不应该让任何人感到惊讶，”神父。倡导 LGBTQ 天主教徒的进步神父詹姆斯·马丁在推特上说。 “这是针对同性恋神父的持续女巫追捕的一部分，无论你在网上读到什么，他们中的绝大多数，就像他们的异性恋一样，都是独身和贞洁的。”几乎没有什么可以阻止天主教会本身进行此类数据调查。许多团体和个人争辩说，除了神父的誓言之外，任何约会应用程序的使用都会在神职人员中助长一种危险的保密文化。其中一些团体可能会决定将公众和教会的需求置于个人隐私权之前。\nNew America&#39;s Open Technology Institute 的技术专家 Nat Meysenburg 说，专家们多年来一直警告这样的事情会发生，而且只需要一群特别坚定的人有一个非常具体的目标和时间来解决这个问题。数据。 “令人担忧的是，这会因各种原因被各种人复制，”他说。 “现在有一个概念证明。”", "note_en": "Early Monday morning, the executive director of the conservative news service Catholic News Agency published  a warning to the Catholic world: an unknown Catholic group was about to use mobile app data to expose a member of the clergy who was having gay sex.\n  He knew this in part, he wrote, because back in 2018, someone “concerned with reforming the Catholic clergy” approached him and other Catholic groups, media organizations, and people to offer the tools to do the same. “This party claimed to have access to technology capable of identifying clergy and others who download popular ‘hook-up’ apps, such as Grindr and Tinder, and to pinpoint their locations using the internet addresses of their computers or mobile devices,” the journalist, Alejandro Bermudez, wrote.\n    Then, on Tuesday afternoon, The Pillar—a new Catholic news site founded by former Catholic News Agency journalists—dropped its report. In it, the site reported that Monsignor Jeffrey Burrill, the general secretary of the U.S. bishops’ conference, visited gay bars and used Grindr “on a near-daily basis” in the last several years. Their investigation was based on “an analysis of app data signals correlated to Burrill’s mobile device,” using “commercially available records of app signal data.” Burrill had resigned from his position by the time Pillar published their piece.\n      The fallout exploded beyond typical Catholic infighting. Many progressive Catholics cried out against the outing of a gay priest and of the public airing of a single man’s private struggles with celibacy. Others began to argue, again, about the place of gay men in the priesthood, and about the journalistic ethics of publishing the information. But the most immediate reaction was one of deep discomfort over the way Pillar had found out about Burrill’s actions in the first place. It was unsettling to watch someone publicly go after a single individual—and track their movements—based on their private app use.\n    According to one privacy engineer who has worked on issues related to location data, Pillar (or the group that had offered CNA the data back in 2018) probably purchased a data set from a data broker, which in turn had likely purchased the data from a third-party ad network that Grindr uses. Grindr itself would not have been the source of the data, but the ad network would have been given full access to the users’ information as long as they agreed to Grindr’s terms of services. (In 2018, Grindr, which uses highly granular location information, was found to have shared users’ anonymized locations, race, sexual preferences, and even HIV status with third-party analytic firms. This year, Norway fined Grindr $11.7 million for disclosing users’ private information to advertising companies, in violation of European privacy laws. Grindr did not respond to Slate’s request for comment on its data privacy policies.) The data would have been presented as “anonymized” through the removal of certain pieces of information, such as users’ names. But it would have  included the timestamped GPS locations for the device from when the app was in use. All of this is legal, the privacy engineer said, but not something most users factor into their risk-taking.\n      After purchasing the data, Pillar would have been able to search locations they had already identified as being associated with Burrill—or a number of Catholics clerics, if they wanted—in the data set. (It’s not clear if the investigation targeted Burrill from the beginning or if he was found among a list of clergy being investigated. According to Bermudez, the group that approached him in 2018 also offered up the names of high-profile Catholics they said were using the apps.) At that point, it was just a matter of cross-referencing.\n  “There’s an entire multi-hundred billion dollar industry of companies you’ve never heard of,” said Ari Ezra Waldman, a professor of law and computer science at Northeastern University. “Their business model is collecting info from all corners of the internet and selling it to people so they can make general conclusions about a population and advertise to it. They say that information is non-identifiable. This is another example of how it’s an utter lie.”\n    There’s little precedent for this kind of tactic in the U.S. While authorities in other countries  have used gay dating and hookup apps—mainly through entrapment with fake accounts—to persecute queer people, the concerns over the app in the U.S. have had more to do with  protecting  users from other users.\n    The Pillar incident raises an alarming prospect in the context of the Catholic priesthood, where being gay—and acting on it—is considered a line-crossing sin. In his CNA article, Bermudez wrote that the group that approached him had wanted “to provide this information privately to Church officials in the hopes that they would discipline or remove those found to be using these technologies to violate their clerical vows and possibly bring scandal to the Church.”\n    This group would have a large number of allies who believe not only that gay and sexually active priests are an outrage because of the church’s teachings on sexuality and the vocation’s call for celibacy, but because of the incorrect belief that gay priests are responsible for the sex abuse crisis. (The Pillar presented no evidence that Burrill had sexual encounters with minors.)\n  JD Flynn, one of the Pillar journalists behind the expose, defended himself from criticism on Wednesday in a  tweet saying that he and his co-author had weighed the question of individual privacy and decided that Burrill’s Grindr use was a matter of public interest because he was a “high-ranking public figure who was responsible in a direct way for the development and oversight of policies addressing clerical accountability with regard to the Church’s approach to sexual morality.”\n    In the original Pillar piece, however, the journalists made it clear that their reasoning went beyond the hypocrisy of Burrill’s actions: “[A]ny use of the app by the priest could be seen to present a conflict with his role in developing and overseeing national child protection policies, as Church leaders have called in recent months for a greater emphasis on technology accountability in Church policies.”\n    Many critics protested that such a linking of gay sex with child abuse, with no evidence, revealed the homophobia at work in the efforts to expose the priest. “Of course it’s aimed at gay priests, and ‘gay apps,’ which shouldn’t surprise anyone,” Fr. James Martin, a progressive priest who advocates for LGBTQ Catholics,  said on Twitter. “It’s part of the ongoing witch hunt against gay priests, the vast majority of whom, like their straight counterparts, are celibate and chaste, no matter what you may read online.”\n    There’s little to stop the Catholic Church itself from conducting such data plumbing. And many groups and individuals argue that beyond the matter of the priest’s vows, any use of dating apps feeds a dangerous culture of secrecy among the clergy. Some of these groups might decide that the public’s—and Church’s—needs come before the individual’s privacy rights.\n  Nat Meysenburg, a technologist at New America’s Open Technology Institute, said that experts had warned about something like this happening for years, and that it only took a particularly determined group of people with a very specific goal in mind and the time to work through the data. “The worry is that this gets replicated by all kinds of people for all kinds of reasons,” he said. “And now there’s a proof of concept out there.”", "posttime": "2021-07-23 02:55:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "outed,数据", "title": "一位牧师因使用 Grindr 而被开除。专家称这是隐私的警告信号", "title_en": "A Priest Was Outed for Using Grindr. Experts Say It’s a Warning Sign for Privacy", "transed": 1, "url": "https://slate.com/technology/2021/07/catholic-priest-grindr-data-privacy.html", "via": "", "real_tags": ["outed", "数据"]}, {"category": "", "categoryclass": "", "imagename": "80534ad2a4369786e4cb75611c8cd377.jpg", "infoid": 1069084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "杰夫·贝佐斯 (Jeff Bezos) 去了太空，给该行业带来了近期记忆中最糟糕的宣传日。这种敌意与他的太空公司 Blue Origin 没什么关系。其中大部分是由贝佐斯的财富及其获得方式所驱动，最近关于亚马逊物流工人待遇不佳以及该公司创始人如何使用（法律）策略来避免缴纳所得税的报道放大了这一点。很多贝索斯的仇恨只是人们对私营企业的想法感到不满，或者基于关于贝索斯没有花钱来对抗贫困或气候变化的虚假二进制文件。 （贝索斯是慈善事业的后来者，已向专注于经济脱碳的组织承诺了 100 亿美元，并承诺向贫困人口提供 1 亿美元。）其他批评者显然对太空探索有基本的误解：部分公众错误地认为美国宇航局之前的成功确实做到了不涉及私人公司，或者像贝索斯、理查德布兰森或埃隆马斯克这样的人正在取代或重新引导 NASA 的科学工作。现实既平淡又有趣：贝索斯和布兰森对 NASA 的影响微乎其微，远远超出了为微重力实验有效载荷提供了一个新的（和赞赏的）场所，而马斯克的 SpaceX 为该机构节省了数十亿美元并赋予了它能力再次飞行宇航员。部分问题在于新闻媒体，尤其是电视新闻，它们无所不在地放大了布兰森和贝佐斯的亚轨道旅游项目的进口。观众自然对一场只产生几分钟微重力的太空竞赛感到失望——即使其他人荒谬地担心亿万富翁将放弃这个星球。然后是发布会上实际发生的事情，对贝索斯、他的家人和他的抱负的关注掩盖了 Blue Origin 实际取得的成就。任何迎合超级富豪的企业都必定会招致批评，但突然转向宣布向权威人士范琼斯和厨师活动家何塞安德烈斯捐款 1 亿美元的做法实在太离谱了，以至于感觉就像是：努力在分心。\n真正的耻辱是，正如贝索斯所指出的，数百人为设计、测试和操作新谢泼德火箭助推器和太空舱付出了难以置信的努力。 Blue Origin 拒绝了多次采访这些工程师的请求，并让他们分享他们创造这辆车所克服的挑战；没有高管加入机组人员的飞行后新闻发布会。公众对贝索斯飞行的接受可能会损害我们为人类利用空间的方式所做的更广泛的努力。美国宇航局的公私合作取得了重大成功，但他们仍然面临许多批评者，他们现在将建立在像“贝索斯救助”这样的言论之上。具有讽刺意味的是，这最终将使军工复合体的传统承包商受益，这显然被贝索斯的进步批评者所忽视。新牧羊人可能具有持久的意义，但其中很大一部分取决于 Blue Origin 对构建它的经验教训。对亚轨道旅游的关注分散了太空用户在为日常生活增加价值方面取得的进步。贝索斯戴着牛仔帽和靴子，让人想起 19 世纪横贯大陆的铁路彻底改变了交通运输后，农场和游客扮演牛仔的形象。真正的太空业务看起来更像是铁路，而不是牧场。贝索斯以以客户为中心作为亚马逊的基准而著称，但在使自己成为 Blue Origin 的主要客户时，他忘记了太空市场比已经对其充满热情的人要广阔得多。", "note_en": "﻿Jeff Bezos  went to space, and gave the industry the worst day of publicity it’s had in recent memory.\n The animus had little to do with his space company, Blue Origin. Much of it was driven by Bezos’ wealth and how he got it, amplified by recent reporting into the  poor treatment of Amazon’s logistics workers and how the company’s founder  used (legal) strategies to avoid paying income tax.\n A good deal of the Bezos hate is simply people upset with the idea of private enterprise at all, or based in false binaries about Bezos not spending his money to fight poverty or climate change. (Bezos, a latecomer to philanthropy, has  committed $10 billion to organizations focused on decarbonizing the economy and  $100 million to feeding the poor.)\n  Other critics clearly have basic misconceptions about space exploration: Some portion of the public incorrectly thinks that previous NASA successes  did not involve private companies, or that people like Bezos, Richard Branson, or Elon Musk are replacing or redirecting NASA’s science work.\n The reality is both more prosaic and more interesting: Bezos and Branson have had very little impact on NASA thus far beyond offering a new (and appreciated) venue for experimental payloads in microgravity, while Musk’s SpaceX has saved the agency billions and  given it the ability to fly astronauts once again.\n Part of the problem is the news media, particularly TV news, which has amplified the import of Branson and Bezos’ suborbital tourism projects beyond all reason. Viewers were naturally disappointed in a space race that results in just a few minutes of microgravity—even as  others fretted  nonsensically that billionaires are set to abandon the planet.\n  And then there was what actually happened at the launch, where the focus on Bezos, his family and his aspirations clouded over what Blue Origin had actually accomplished. Any business catering to the ultra-wealthy is bound to attract criticism, but the sudden pivot to announcing $100 million donations to pundit Van Jones and chef-activist José Andrés was so out of left field that it felt like what it was: an effort at distraction.\n  The real shame is that, as Bezos pointed out, hundreds of people worked incredibly hard to design, test, and operate the New Shepard rocket booster and space capsule. Blue Origin has refused multiple requests to interview these engineers and let them share the challenges they surmounted to create this vehicle; no executives joined the crew for a post-flight press conference.\n The public reception to Bezos’ flight could damage the broader effort to expand the ways we utilize space on behalf of humanity. Public-private partnerships at NASA have led to major success, but they still face many critics who will now build on rhetoric like the “Bezos bailout.” The irony that this will ultimately benefit the traditional contractors of the military-industrial complex is clearly lost to Bezos’ progressive critics.\n The New Shepherd may have lasting significance but much of that rests on what Blue Origin  does with the lessons from building it. The focus on suborbital tourism distracts from the strides space users have made in adding value to everyday life. Bezos, clad in his cowboy hat and boots, calls to mind the image of the dude ranch and tourists cosplaying as cowboys after the transcontinental railroad revolutionized transportation in the 19th century.\n  The real businesses of space will look more like the railroad, not the dude ranch. Bezos famously uses customer focus as Amazon’s benchmark, but in making himself the key customer for Blue Origin, he forgot that the market for space is so much broader than the people for whom it is already a passion.", "posttime": "2021-07-23 02:55:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蓝色,backlash,贝索斯", "title": "贝索斯的强烈反对比蓝色起源的成功更大", "title_en": "The Bezos backlash is bigger than Blue Origin’s success", "transed": 1, "url": "https://qz.com/2036968/the-bezos-backlash-is-bigger-than-blue-origin", "via": "", "real_tags": ["蓝色", "backlash", "贝索斯"]}, {"category": "", "categoryclass": "", "imagename": "b5d199b4adcea3a78afbed0b00f2e572.jpg", "infoid": 1069082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌表示，它已经修复了一个主要的 Chrome 操作系统错误，该错误将用户锁定在他们的设备之外。谷歌的公告称，本周短暂推出的 Chrome OS 版本 91.0.4472.165 使用户无法登录他们的设备，实质上是让他们变砖。 Chrome OS 会在重新启动后自动下载更新并切换到新版本，因此重新启动设备的用户会突然被锁定。当这个损坏的更新出现时，建议不要重新启动。该公告称，新版本 91.0.4472.167 现已推出以解决该问题，但可能需要“几天”才能影响到所有人。受错误更新影响的用户可以等待设备再次更新或“强力清洗”他们的设备（即擦除所有本地数据）以登录。Chrome 操作系统主要基于云，因此如果您不做任何事情像运行 Linux 应用程序一样先进，与其他操作系统相比，此解决方案带来的不便更少。尽管如此，仍有一些用户抱怨数据丢失。 ChromeOS 是开源的，因此我们可以获得更多关于修复的详细信息，这要归功于 Android Police 搜索了用户 elitist_ferret 的 Reddit 评论。问题显然归结为单字符错字。谷歌在 Chrome 操作系统的 Cryptohome VaultKeyset 中错误地声明了一个条件语句，这是操作系统中保存用户加密密钥的部分。该行应为“if (key_data_.has_value() &amp;&amp; !key_data_-&gt;label().empty()) {”但不是“&amp;&amp;”——“AND”运算符的C++版本——错误的更新使用了一个＆符号，打破条件语句的后半部分。听起来，由于此错误，Chrome 操作系统从未根据存储的密钥正确检查用户密码，因此即使是正确的密码也会返回一条消息，说“抱歉，无法验证您的密码。” Chrome OS 的整个卖点是它可靠且牢不可破，像这样的拙劣更新会损害操作系统。目前尚不清楚像这样一个如此明显的、令人眼花缭乱的问题是如何进入稳定发布渠道的。 Chrome OS 有三个测试渠道，更改应该通过“金丝雀”、“开发”和“测试版”渠道——在发布之间进行数周的测试。不知何故，这个错误逃脱了整个过程。这个问题似乎也是单元测试或自动化测试可能会发现的问题——无法登录是很明显的。该错误标志着本月推出的第二个有缺陷的 Chrome 操作系统更新。 7 月初的更新使某些型号的 CPU 使用率飙升，从而使它们慢下来。", "note_en": "Google says it has fixed a major Chrome OS bug that locked users out of their devices.  Google&#39;s bulletin says that Chrome OS version 91.0.4472.165, which was briefly available this week, renders users unable to log in to their devices, essentially bricking them.\n Chrome OS automatically downloads updates and switches to the new version after a reboot, so users who reboot their devices are suddenly locked out them. The go-to advice while this broken update is out there is to not reboot.\n The bulletin says that a new build, version 91.0.4472.167, is rolling out now to fix the issue, but it could take a &#34;few days&#34; to hit everyone. Users affected by the bad update can either wait for the device to update again or &#34;powerwash&#34; their device—meaning wipe all the local data—to get logged in. Chrome OS is primarily cloud-based, so if you&#39;re not doing something advanced like running Linux apps, this solution presents less of an inconvenience than it would on other operating systems. Still, some users are complaining about lost data.\n ChromeOS is open source, so we can get a bit more detail about the fix thanks to  Android Police hunting down a Reddit comment from user  elitist_ferret. The problem apparently boils down to  a single-character typo. Google flubbed a conditional statement in Chrome OS&#39;s  Cryptohome VaultKeyset, the part of the OS that holds user encryption keys. The line should read &#34;if (key_data_.has_value() &amp;&amp; !key_data_-&gt;label().empty()) {&#34; but instead of &#34;&amp;&amp;&#34;—the C++ version of the &#34;AND&#34; operator—the bad update used a single ampersand, breaking the second half of the conditional statement.\n     It sounds like, because of this error, Chrome OS never properly checked user passwords against the stored keys, so even correct passwords came back with a message saying, &#34;Sorry, your password could not be verified.&#34;\n The whole selling point of Chrome OS is that it&#39;s reliable and unbreakable, and botched updates like this hurt the OS. It&#39;s not clear how such an obvious, show-stopping problem like this made it into the stable release channel. Chrome OS has three testing channels that changes are supposed to go through—the &#34;canary,&#34; &#34;dev,&#34; and &#34;beta&#34; channels—with weeks of testing between releases. Somehow this bug escaped that entire process. This problem also seems like something a unit test or automated testing could have caught—not being able to log in is pretty obvious.\n The error marks the second defective Chrome OS update pushed out this month. An update at the beginning of July  made CPU usage spike on some models, slowing them down to a crawl.", "posttime": "2021-07-23 02:55:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,chrome,错别字,pushed", "title": "谷歌将一个字符的错别字推向生产，使 Chrome OS 设备变砖", "title_en": "Google pushed a one-character typo to production, bricking Chrome OS devices", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/google-pushed-a-one-character-typo-to-production-bricking-chrome-os-devices/?comments=1", "via": "", "real_tags": ["google", "谷歌", "chrome", "错别字", "pushed"]}, {"category": "", "categoryclass": "", "imagename": "c300de7b493aff99d1d52c675b80e46a.jpg", "infoid": 1069081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“通常，关于蝴蝶的书籍是静态的，”项目负责人 Purnendu 说。 “但是你能不能让一只蝴蝶在书中扇动翅膀？我们已经证明这是可能的。”在名为“Electriflow”的科罗拉多电动液压装置中，其执行器包括两个相连的部分：一个流体泵室和一个将流体运动转换为机械角度变化的第二个室。两个腔室都是塑料袋，除了相互连接外都是密封的。泵由两个相当坚硬的平板组成，边缘连接在一起，就像一本稍微打开的书。电极沉积在这些薄片的外侧，当它们被充电到相反的电压时——项目中使用了 10kV——静电力将书拉开。书本状结构的边缘用柔性膜密封，并填充有硅油，当施加电压时，硅油会逐渐被挤出。第二个腔室的所有表面都是柔性的，尽管有些是有弹性的，有些则不是。通过改变哪些是灵活的，当油被强制进入时可以获得各种运动。\n该团队已经确定了三个第二弧度布置，它们创建了称为执行器的执行器：铰链弯曲（急剧折叠形状变化）、新月形（平滑弯曲折叠）和四分之一月形（来自全软结构的急剧折叠）。结果很快：Purnendu 创造的类似昆虫的机器人以高达 25Hz 的频率拍打翅膀，“比大多数真正的蝴蝶快，与一些速度更快的飞蛾相当”，该大学表示。 Purnendu（Purnendu 是研究人员的全名）的灵感来自 HASEL（液压放大的自愈静电）执行器，由 CU Boulder 的 Christoph Keplinger 开发，现在是 Artimus Robotics 的商业产品。 Electriflow 在 DIS 2021（计算机协会的设计交互系统会议）上进行了展示。它在“Electriflow：用于形状变化界面原型设计的软电液构建块”中有详细描述，这是一篇发表在 ACM（计算机协会）数字图书馆中的开放获取论文。所使用的 10kV 电源是 Peta-pico Voltron，值得特别提及。它建立在由 Samuel Schlatter 和 Samuel Rosset 在洛桑联邦理工学院创建的开源电源设计基础上，专门用于软执行器研究，因为他们无法为他们的研究项目找到合适的电源。关于 Peta-pico Voltron 的信息可以在这里找到——它不寻常的高压调制开关是 OC100G 光隔离器，它有 10kV 光电二极管作为输出设备。\n执行器机器人软核", "note_en": "“Usually, books about butterflies are static,” said project leader Purnendu. “But could you have a butterfly flap its wings within a book? We’ve shown that it’s possible.”\n In the Colorado Electro-hydraulic device, branded ‘Electriflow’, its actuators comprise two linked parts: a fluid pumping chamber and a second chamber that converts fluid movement into a mechanical angle change. Both chambers are plastic pouches, sealed except for a connection to each other.\n   The pump consists of two reasonably stiff flat sheets joined at one edge like a slightly open book.\n       Electrodes are deposited on the outsides of these sheets and, when these are charged to opposing voltages – 10kV is used in the project – electrostatic forces pull the book shut.\n The edges of the book-like structure are sealed with flexible membranes, and it is filled with silicone oil that is progressively forced out when voltage is applied.\n All of its surfaces of the second chamber are flexible, although some are stretchy and some are not.\n By varying which are flexible, various motions can be obtained when oil is forced in.\n The team has settled on three second camber arrangements which create actuators dubbed: hinge-bending (sharp fold shape change), crescent (smooth curved fold) and quarter-moon (sharp fold from an all-soft structure).\n The results are fast: an insect-like robot created by Purnendu beats its wings at up to ~25Hz “quicker than most real butterflies and on-par with some speedier moths”, said the university.\n Purnendu (Purnendu is the researcher’s entire name) was inspired by HASEL (hydraulically amplified self-healing electrostatic) actuators, developed by Christoph Keplinger at CU Boulder and now a commercial product from Artimus Robotics.\n Electriflow was presented at DIS 2021, the the Association for Computing Machinery’s Designing Interactive Systems conference.\n It is described in detail in ‘ Electriflow: Soft electrohydraulic building blocks for prototyping shape-changing interfaces‘, an open-access paper published in the ACM (Association for Computing Machinery) digital library.\n   The 10kV power supply used, which is a Peta-pico Voltron, deserves a special mention. It is built from on open-source power supply design created at Ecole polytechnique fédérale de Lausanne by Samuel Schlatter and Samuel Rosset specifically for soft actuator research after they could not find a suitable supply for their research project.\n Information about the  Peta-pico Voltron can be found here – its unusual high voltage modulation switches are  OC100G opto-isolators which have 10kV photo-diodes as output devices.\n       actuator  robotics  soft core", "posttime": "2021-07-23 02:54:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,制作,hydraulic,执行器", "title": "电动液压执行器为软迷你机器人制作动画", "title_en": "Electro-hydraulic actuator animates soft mini-robots", "transed": 1, "url": "https://www.electronicsweekly.com/news/research-news/electro-hydraulic-actuator-animates-soft-mini-robots-2021-07/", "via": "", "real_tags": ["机器人", "制作", "hydraulic", "执行器"]}, {"category": "", "categoryclass": "", "imagename": "aea18b71276a07e96a20e9aeba0575c2.jpg", "infoid": 1069080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着未接种疫苗人群中冠状病毒病例的增加，民主党参议员周四提出了一项新法案，如果 Facebook 和其他社交媒体平台放大有害的公共卫生错误信息，将剥夺它们的第 230 条责任保护。周四由 Sens. Amy Klobuchar (D-MN) 和 Ben Ray Luján (D-NM) 推出的《健康错误信息法案》将在《通信规范法》第 230 条中创建一个豁免条款，将 Facebook 等社交媒体平台开放至托管诉讼一些危险的健康错误信息。该法案指示卫生与公共服务部部长发布关于应归类为“健康错误信息”的指导方针。正如 HHS 部长所宣布的那样，这项豁免仅适用于在线错误信息与现有的公共卫生紧急情况（如正在进行的冠状病毒大流行）有关的情况。如果内容被算法放大，它只会让平台承担责任，而不是通过“中性机制，例如通过使用按时间顺序排列的功能”。 “长期以来，在线平台在保护美国人的健康方面做得还不够。这些是世界上一些最大、最富有的公司，他们必须采取更多措施来防止致命的疫苗错误信息的传播，”克洛布查尔周四在一份声明中说。 “冠状病毒大流行向我们展示了错误信息的致命性，我们有责任采取行动。”目前尚不清楚取消第 230 条保护是否会产生立法者想要的效果。第 230 条保护平台免于为其平台上托管的非法内容承担责任——但错误信息本身并不违法。因此，即使取消了第 230 条的保护，也不清楚针对 Facebook 的虚假信息可能提起的诉讼会是什么样子。该法案的出台是在拜登政府发布一份新报告称社交媒体上的疫苗错误信息一周后提出的。该报告呼吁全社会推动解决冠状病毒的错误信息，包括针对 Facebook、Twitter 和 YouTube 等公司的新政策建议。该报告没有提到第 230 条，但建议平台重新设计算法以“避免放大错误信息”，并在共享功能中构建更多“摩擦”，以敦促用户避免共享虚假信息。报告发布后不久，白宫官员和总统乔·拜登 (Joe Biden) 专门指责 Facebook 在放大疫苗错误信息方面的作用。上周五，拜登告诉记者，像 Facebook 这样的平台通过发布虚假疫苗信息来“杀人”。 Facebook 发言人回应说：“事实表明，Facebook 正在帮助挽救生命。时期。”\n周一，拜登收回了这一声明，称错误信息正在“杀人”，而不是 Facebook 本身。尽管如此，白宫通讯主任凯特贝丁菲尔德周二告诉 MSNBC，政府正在审查第 230 条，以确定打击 COVID-19 错误信息的方法。 “当然，他们应该被追究责任，”贝丁菲尔德周二在谈到社交媒体公司时说。 “这是一个庞大而复杂的生态系统，每个人都有责任确保我们不会向人们提供有关可以挽救他们生命的疫苗的不良信息。”", "note_en": "As coronavirus cases rise in unvaccinated populations, Democratic senators are introducing a new bill Thursday that would strip away Facebook and other social media platforms’ Section 230 liability shield if they amplify harmful public health misinformation.\n The Health Misinformation Act, introduced by Sens. Amy Klobuchar (D-MN) and Ben Ray Luján (D-NM) Thursday, would create a carveout in Section 230 of the Communications Decency Act opening social media platforms like Facebook up to lawsuits for hosting some dangerous health misinformation. The bill directs the Health and Human Services secretary to issue guidelines on what should be classified as “health misinformation.”\n The carveout would only apply in situations where online misinformation is related to an existing public health emergency like the ongoing coronavirus pandemic, as declared by the HHS secretary. It would only open a platform up to liability if the content is being algorithmically amplified, not through “a neutral mechanism, such as through the use of chronological functionality.”\n  “For far too long, online platforms have not done enough to protect the health of Americans. These are some of the biggest, richest companies in the world and they must do more to prevent the spread of deadly vaccine misinformation,” Klobuchar said in a statement Thursday. “The coronavirus pandemic has shown us how lethal misinformation can be and it is our responsibility to take action.”\n It’s not clear that removing Section 230 protections would have the effect lawmakers intend. Section 230 protects platforms  from liability for illegal content hosted on their platforms — but misinformation is not illegal in itself. As a result, it’s unclear what a potential lawsuit against Facebook for misinformation would look like, even once the protections of Section 230 are stripped away.\n The bill’s introduction comes just a week after the Biden administration issued a new report  calling out vaccine misinformation on social media. The report called for an all-of-society push to address coronavirus misinformation, including new policy recommendations for companies like Facebook, Twitter, and YouTube. The report didn’t mention Section 230 but suggested that platforms redesign their algorithms to “avoid amplifying misinformation” and to build more “friction” into sharing functions to urge users to avoid sharing false information.\n Shortly after the report’s release, White House officials and President Joe Biden called out Facebook specifically for its role in amplifying vaccine misinformation. Last Friday,  Biden told reporters that platforms like Facebook were “killing people” by platforming false vaccine information. A Facebook spokesperson responded, saying, “The facts show that Facebook is helping save lives. Period.”\n On Monday,  Biden walked back that statement, saying that misinformation was “killing people,” not Facebook itself. Still, White House Communications Director Kate Bedingfield  told MSNBC  Tuesday that the administration was reviewing Section 230 in order to determine a means of combating COVID-19 misinformation.\n “Certainly they should be held accountable,” Bedingfield said of social media companies Tuesday. “It is a big and complicated ecosystem, and everybody bears responsibility to ensure that we are not providing people with bad information about a vaccine that will save their lives.”", "posttime": "2021-07-23 02:54:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打击,target,错误信息", "title": "参议员将第 230 条作为打击 Covid-19 疫苗错误信息的目标", "title_en": "Senators target Section 230 to fight Covid-19 vaccine misinformation", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22588903/covid19-misinformation-section-230-facebook-joe-biden-white-house/", "via": "", "real_tags": ["打击", "target", "错误信息"]}, {"category": "", "categoryclass": "", "imagename": "5c7a66dcc61f704275dae7e8c0ceb6b7.jpg", "infoid": 1069079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stefan Goetsch 花了数年时间进行疯狂的噪音实验：解剖电子设备，重新组装它们，并试图让它们唱歌。这位柏林作曲家以 Hainbach 的名义经营，通过他的 YouTube 频道将这一阴谋传递给成千上万的人 - 一个宝库，其中包括“如何使用老式钢琴调音器制作音乐”和“使用核乐器和未知合成器进行现场演奏”。他可爱的视频部分是历史课，部分是书呆子的技术出口，部分是哲学肥皂盒。在一篇关于从苏联有线录音机中吸取诡异音调的上传中，Goetsch 在描述它的声音时明显变得兴奋起来。 “它有一种令人难以忘怀的品质，有点像被困在金属笼子里的过去的幽灵，”他笑着说。垃圾填埋场图腾是 Goetsch 最新发布的 Hainbach 版本，直接处理这些鬼魂。这个项目源于他对过时的测试设备的迷恋——从粒子加速器组件到核研究中使用的古董金属块，再到美国海军曾经使用过的海豚定位装置，应有尽有。 Goetsch 发现，虽然它们的原始功能可能会丢失，但这些机器可以发出声音并像巨大的单音合成器一样被操纵。痴迷于它们的潜力，他从在线爱好者和尘土飞扬的棚子里收集了大量设备，并最终获得了画廊空间来试验他的收获。但是，当这些机器在广阔的白色房间面前显得相形见绌时，Goetsch 觉得有必要让它们变得更宏伟、更有气势。他本能地将它们排列成塔，提升了它们的物理高度和象征意义。巧妙地（虽然不牢固）堆叠的声音雕塑对他来说变得栩栩如生——它们的旋钮和线条形成了整洁的银色面孔。垃圾填埋场图腾的标题指的是这种拟人化，并暗示了单位的一种轮回或超越：尖端的高科技设备已经被丢弃，然后被赋予新的生命——一种垃圾堆变形金刚效应。在这些图腾配置中，Goetsch 可以窥视过去机器的灵魂。 Goetsch 跟随他的画廊表演发行了一张同名专辑，他现场录制了这张专辑。他会走近他的塔，每天在一条轨道上工作，只使用他会议的原材料。 Landfill Totems 上的歌曲既黑暗又奇怪；它们会发出噼啪声、咝咝声、啁啾声和嚎叫声。其中一些噪音是机器发出的最后一次噪音。在最后一次迭代中，Landfill Totems 被翻译成一个样本库，它提供了丰富的纹理、无人机和鼓声，供制作人在他们自己的作品中使用。 “我真的很喜欢看到人们如何与他们合作，”Goetsch 在他柏林工作室的 Zoom 电话中说道。垃圾填埋场图腾以多种形式确保这些被遗忘的机器会产生共鸣。海恩巴赫：拆开我妈妈的闹钟。我只是把一把螺丝刀放进去，打开它，然后我看了看，又把它放回原处。我不认为在那之后它起作用了，但是我的父母很好，然后给我买了一个电子套件。当我学习音乐学时，我看到了像 Stockhausen、Pierre Schaeffer 和 BBC Radiophonic Workshop 这样的早期电子音乐家所做的事情。他们没有合成器。他们拥有所有这些测试设备、测量设备、电子滤波器和用于电信和广播的声音发生器。\n我爱上了用测试设备制作音乐的概念。使用这些过时的声音发生器有一些美妙的东西，因为从构成上来说，它可以让你创作出非常简单的音乐。他们只想做一件事，那就是给你完美的信号。当你谈论图腾时，你使用了很多拟人化的语言，比如它们的旋钮是如何形成“面孔”的。你给他们命名了还是在情感上产生了依恋？我有很多秘密的名字。当我和他们一起举办第一场音乐会时，中间有一个，她看起来超级强大，我想，“这是格蕾丝琼斯。”有一位秘鲁医生，因为它在我看来就像一位秘鲁女士——你知道，戴着帽子的传统服装——而且因为顶部装置是一个医疗探测器。然后是约翰尼 5。当我玩它的时候，我有很多死亡。第一首曲目采用最精确、制作精美的生物泰克函数发生器之一。我开始了它，但它没有做正常的事情，那就是“哔哔”，它做了，“哒当当当当当当”，一种拉丁节奏。所以我很快地创作了整首曲目，录制了它，我真的很高兴。我出去喝了杯咖啡，10 分钟后回来时，开始闻到烧焦的电子设备的味道。这就是它的绝唱。它在播放这首曲子时基本上死了。这种情况发生了很多次。许多声音我无法再重现，因为它基本上是电路死亡。有些东西根本无法修复，因为运算放大器不再存在。当我遇到该项目时，我想到的第一件事是计划过时，即设计为在一两年内损坏和更换。但是你正在做相反的事情——使用经得起时间考验但不再有用的设备。它们旨在永久使用。如果您查看其中的一个，所有东西都是双重屏蔽的，并且所有的管子都在它们的金属容器中。一切都受到保护，可能不会受到核爆炸的影响。这是设计上的差异。当你转动其中一个旋钮时，你会意识到它从来没有比这更好。这些机器很坚固。你可以感受到它的工艺和美感。当您弹奏非常好的钢琴时，也会有类似的感觉。你意识到：这不是批量生产的。这是性格。这是手艺。\n我的意思是，我不得不弹钢琴。从我 6 岁起，我妈妈就说：“你弹钢琴。”我真的不喜欢钢琴，直到我找到了通过在磁带上录制游戏配乐来让它变得更有趣的方法，然后将它们交给我的钢琴老师并说：“你能转录这个以便我演奏吗？”我演奏了 Leisure Suit Larry 的主题曲，这实际上是一个相当不错的爵士乐曲数，因为程序员 Al Lowe 在制作这些粗俗的冒险游戏之前是一名爵士音乐家。与这些机器一起工作教会我变得更小，做更少的事情。现在大多数音乐家都来自一个富足的地方，因为你只要打开 MacBook，就会有上百万种声音。但是一旦你被限制在三个，你就会意识到在这些频率之间的微观距离中存在着世界。", "note_en": "Stefan Goetsch has spent years conducting madcap noise experiments: dissecting electronics, reassembling them, and trying to make them sing. Operating under the name  Hainbach, the Berlin composer transmits this intrigue to thousands via his  YouTube channel—a treasure trove of clips with titles like “ How to Make Music With a Vintage Piano Tuner” and “ Playing Live With Nuclear Instruments and Unknown Synths.” His endearing videos are part history lesson, part nerdy tech outlet, part philosophical soapbox. In one upload about siphoning eerie tones from a  Soviet wire recorder, Goetsch becomes visibly excited when describing its sound. “It has a haunting quality, sort of like the ghost of the past caught in a metal cage,” he says, beaming.\n  Landfill Totems, Goetsch’s latest Hainbach release, deals directly with those ghosts. The project grew from his fascination with obsolete test equipment—everything from particle accelerator components to lunks of antique metal used in nuclear research to a dolphin-locating device once used by the U.S. Navy. Goetsch discovered that while their original functions might be lost, these machines could emit sounds and be manipulated like massive, single-tone synthesizers. Obsessed with their potential, he collected a vanful of equipment from online enthusiasts and dusty sheds, and was eventually offered gallery space to experiment with his haul. But when the machines were dwarfed by the vast white room, Goetsch felt compelled to make them grander, more imposing. He instinctively arranged them into towers, elevating their physical height and symbolic magnitude.\n  The artfully (though not securely) stacked sound sculptures became lifelike to him—their knobs and lines forming tidy silver faces. The title  Landfill Totems refers to this anthropomorphism and suggests a kind of reincarnation or transcendence for the units: cutting edge, hi-tech equipment that has been discarded, then given new life—a kind of trash-heap  Transformers effect. In these totemic configurations, Goetsch could peer into the souls of bygone machinery.\n  Goetsch followed his gallery performances with an album of the same name, which he recorded live. He would approach his towers and work on one track per day, using only the raw material of his sessions. The songs on  Landfill Totems are dark and strange; they crackle, croak, chirp, and howl. Some of these noises were the last the machines ever made.\n  In its final iteration,  Landfill Totems was translated into a  sample library that offers a wealth of textures, drones, and drum sounds for producers to use in their own compositions. “I really love seeing how people work with them,” Goetsch says on a Zoom call from his Berlin studio. In its many forms,  Landfill Totems ensures that these forgotten machines will echo on.\n   Hainbach: By taking apart my mother’s alarm clock. I just put a screwdriver in and opened it up, and then I looked at it and put it back together. I don’t think it worked after that, but my parents were nice enough to then buy me an electronics kit.\n  When I studied musicology, I saw what early electronic musicians like  Stockhausen,  Pierre Schaeffer, and the  BBC Radiophonic Workshop did. They didn’t have synthesizers. They had all this test equipment, measurement equipment, electronic filters, and sound generators meant for telecommunications and broadcast.\n  I fell in love with the concept of making music with test equipment. There is just something beautiful about working with these obsolete sound generators because, compositionally, it makes you create very minimal music. They just want to do one thing and that’s to give you the perfect signal.\n You use a lot of anthropomorphic language when you talk about the totems, like how their knobs formed “faces.” Did you name them or grow emotionally attached?\n I had a lot of secret names. When I made the first concert with them, there was one in the middle, and she looked super powerful, and I was like, “This is Grace Jones.” There was the Peruvian Doctor because it looked like a Peruvian lady to me—you know, the traditional garb with the hat—and because the top unit was a medical detector. And then there was Johnny 5.\n  There was a lot of dying on me right while I was playing it. The first track features one of the most precise, beautifully made bio-tektronix function generators. I started it, but instead of doing the normal thing, which is to go “beeeeep” it did, “da dang dang dang da dang dang dang,” kind of a Latin rhythm. So I quickly composed the whole track, recorded it, and I was really happy. I went out for a coffee, and when I came back 10 minutes later, it started to smell of burned electronics. So that was its swan song. It basically died while playing this piece. That happened a bunch of times. Many of the sounds I can’t reproduce anymore because it’s basically the circuitry dying. And some of the stuff is not fixable at all because the operational amplifiers don’t exist anymore.\n  The first thing I thought of when I came across the project was planned obsolescence, where things are designed to break and be replaced within a year or two. But you’re doing the opposite—using equipment that was made to stand the test of time but is no longer useful.\n They’re designed to last forever. If you look into one of these things, everything is doubly shielded, and all the tubes are in their metal containers. Everything is protected, probably against a nuclear blast. This is such a difference in design. When you turn one of the knobs on one of these things, you realize it never got any better than this.\n There is a sturdiness to these machines. You can feel the craft and the beauty of that. It’s a similar feeling when you’re playing a really nice piano. You realize: This is not mass-produced. This is character. This is craftsmanship.\n  I mean, I had to play piano. Since I was 6, my mother said, “You play piano.” I really didn’t like piano until I found ways to make it more fun by recording game soundtracks on cassette, and then giving those to my piano teacher and saying, “Can you transcribe this so I can play it?” I played the theme from   Leisure Suit Larry , which is actually a pretty good jazz number because the programmer  Al Lowe was a jazz musician before he made these raunchy adventure games.\n  Working with these machines taught me to be more minimal, to do less. Most musicians now come from a place of plenty, because you just open up the MacBook and there’s a million sounds. But once you’re confined to just three, you realize that there are worlds in these microscopic distances between frequencies.", "posttime": "2021-07-23 02:54:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "制作,producer,goetsch", "title": "德国制作人用回收的核实验室设备制作音乐", "title_en": "The German Producer Making Music with Salvaged Nuclear Lab Equipment", "transed": 1, "url": "https://pitchfork.com/thepitch/meet-the-german-producer-making-music-with-salvaged-nuclear-lab-equipment-hainbach/", "via": "", "real_tags": ["制作", "producer", "goetsch"]}, {"category": "", "categoryclass": "", "imagename": "8c82e6ecfbb17d632430c693ad442bd2.jpg", "infoid": 1069078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的大规模互联网中断使 downdetector.com 覆盖了对流行网站和服务的警告，例如 PlayStation Network、Steam、Fidelity Investments、Airbnb、FedEx、LastPass、UPS、亚马逊等。中断的根本原因似乎是 Akamai 的 Edge DNS 服务出现故障。其系统状态页面报告说，Akamai 意识到“Edge DNS 服务出现了一个新问题”——一个降级为“轻微服务中断”，截至发稿时没有进一步解释。尚不确定为什么网上有这么多网站没有加载，但确认这不是 @Cloudflare 问题。糟糕的日子发生在每个人身上，所以希望无论谁遇到它，都能尽快解决。 #hugops — Matthew Prince 🌥 (@eastdakota) 2021 年 7 月 22 日 据 Akamai 称，已实施修复，Edge DNS 正在“恢复正常运营”。 Akamai 还表示，未指明的问题“不是 Akamai 平台上的网络攻击的结果”，尽管目前还没有关于问题究竟是什么或导致它的原因的消息。大规模 Internet 中断的数量似乎只会增加，其中一些世界上最大的站点通常受到的影响最大。今天的中断是由 DNS 故障而不是内容交付网络故障造成的——但它强调了一个重要的点。互联网最初设计为去中心化和抗故障——但随着世界上最大的站点和服务聚集在几个大型基础设施提供商周围，这些提供商的故障对整个互联网生态系统的影响越来越显着。", "note_en": "A massive Internet outage today has  downdetector.com covered in warnings for popular websites and services, such as the PlayStation Network, Steam, Fidelity Investments, Airbnb, FedEx, LastPass, UPS, Amazon, and others.\n The root cause of the outage appears to be a failure in Akamai&#39;s Edge DNS Service. Its system status page  reports that Akamai is aware of &#34;an emerging issue with the Edge DNS service&#34;—one downgraded to &#34;Minor Service Outage,&#34; with no further explanation as of press time.\n Not sure yet why so many sites online not loading, but confirmed it&#39;s not a  @Cloudflare issue. Bad days happen to everyone so hope whoever is having one it gets resolved quickly.  #hugops\n— Matthew Prince 🌥 (@eastdakota)  July 22, 2021\n According to Akamai, a fix has been implemented, and Edge DNS is &#34;resuming normal operations.&#34; Akamai also states that the unspecified issue &#34;was not a result of a cyberattack on the Akamai platform,&#34; although there&#39;s no word so far on what the issue actually was or what caused it.\n  The volume of large-scale Internet outages seems only to be increasing, with some of the world&#39;s largest sites often the most heavily impacted. Today&#39;s outage resulted from a DNS failure rather than a content delivery network failure—but it underscores an important point.\n The Internet was originally designed to be decentralized and fault-resistant—but as the world&#39;s biggest sites and services coalesce around a few massive infrastructure providers, failures at those providers have increasingly significant effects on the Internet ecosystem as a whole.", "posttime": "2021-07-23 02:21:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "中断,massive", "title": "今天的大规模互联网中断由 Akamai Edge DNS 提供", "title_en": "Today’s massive Internet outage comes courtesy of Akamai Edge DNS", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/todays-massive-internet-outage-comes-courtesy-of-akamai-edge-dns/", "via": "", "real_tags": ["中断", "massive"]}, {"category": "", "categoryclass": "", "imagename": "8fda268b22ec3c92eae949dcf67726cf.jpg", "infoid": 1069077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rivian 没有详细说明它计划何时建造工厂，但确实确认它正在为第二个工厂确定选址。路透社报道称，这家名为 Project Tera 的工厂还将包括电池生产，这一细节将推高工厂的成本和规模。发言人艾米·马斯特（Amy Mast）在一封电子邮件声明中说：“虽然它处于不断发展的早期阶段，但 Rivian 正在探索第二个美国制造工厂的地点。 “我们期待与支持性、技术前沿的社区合作，以建立与我们与伊利诺伊州 Normal 一样强大的伙伴关系。”一周前，Rivian 首席执行官 RJ Scaringe 致信客户称，由于“大流行的连锁影响”导致生产延迟，该公司将推迟交付期待已久的 R1T 电动皮卡和 R1S SUV 数月。 ，”尤其是全球半导体芯片的持续短缺。 Scaringe 在消息中写道，R1T 交付将于 9 月开始，R1S 将“很快”跟进。 Rivian 计划在其位于伊利诺伊州诺曼 (Normal) 的工厂组装其消费产品——R1T、R1S——以及计划用于亚马逊的商用送货车。该工厂曾经通过三菱和克莱斯勒公司的合资企业生产三菱 Eclipse，现已全面更新和扩建。 Normal 工厂有两条独立的生产线生产车辆。一条专用于 R1 车辆，另一条线路用于其商用货车。亚马逊订购了 100,000 辆这样的货车，并于 2021 年开始交付。这家汽车制造商已从包括福特、考克斯汽车、T. Rowe Price Associates Inc.、富达管理和研究公司、亚马逊气候在内的各种支持者那里筹集了超过 80 亿美元质押基金、Coatue 和 D1 Capital Partners。需要这笔资金来维持其 7,000 名员工的运转，并在建造装配厂的同时，如果按照行业估计，该项目将耗资至少 10 亿美元。", "note_en": "Rivian wouldn’t elaborate on when it planned to build the factory, but did confirm it was in the process of identifying a site for a second plant. Reuters reported that the factory, dubbed Project Tera, would also include battery cell production, a detail that would drive up the cost and size of the factory.\n “While it’s early in an evolving process, Rivian is exploring locations for a second U.S. manufacturing facility,” spokesperson Amy Mast said in an emailed statement. “We look forward to working with a supportive, technology-forward community in order to create a partnership as strong as the one we have with Normal, Illinois.”\n  The news comes a week after Rivian CEO RJ Scaringe sent a letter to customers that the company was  pushing back deliveries of its long-awaited R1T electric pickup truck and R1S SUV several more months due to delays in production caused by “cascading impacts of the pandemic,” particularly the ongoing global shortage of semiconductor chips. The R1T deliveries will begin in September with the R1S to follow “shortly,” Scaringe wrote in the message.\n Rivian plans to assemble its consumer products — the R1T, R1S — as well as the commercial delivery vans slated for Amazon at its factory in Normal, Illinois. That factory, which once produced the Mitsubishi Eclipse through a joint venture between Mitsubishi and Chrysler Corporation, has been completely updated and expanded.\n The Normal factory has two separate production lines producing vehicles. One is dedicated for the R1 vehicles and other line is for its commercial vans. Amazon ordered 100,000 of these vans, with deliveries starting in 2021.\n The automaker has raised more than $8 billion from a diverse set of backers that includes Ford, Cox Automotive, T. Rowe Price Associates Inc., Fidelity Management and Research Company, Amazon’s Climate Pledge Fund, Coatue and D1 Capital Partners. That capital will be needed to keep its 7,000-person workforce running and while building an assembly factory, a project that will cost at least $1 billion if it follows industry estimates.", "posttime": "2021-07-23 02:20:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,计划,planning,工厂", "title": "Rivian 计划在美国开设第二家工厂", "title_en": "\n\t\t\t\tRivian is planning a second US factory\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/rivian-is-planning-a-second-u-s-factory/", "via": "", "real_tags": ["美国", "计划", "planning", "工厂"]}]