[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1071252, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《卫报》的一名副新闻制作编辑向同事讲述了几十年来剪切和更正副本的演变 自我加入《卫报》以来的 21 年里，互联网可能已经彻底改变了媒体，但我作为副编辑的角色基本保持不变.我们检查事实，撰写标题并将故事剪裁到合适的长度，并在将其移至下一阶段之前进行最后的拼写检查。但直到上世纪末，子编辑看起来完全不同。 Chris Dodd 于 1965 年在一家酒吧接受“采访”（他不知道是该喝酒还是戒酒，还是买一杯）后，于 1965 年在曼彻斯特开始工作，而 Barry Johnson 和 Jay Sivell 加入了1986 年在法灵顿路的伦敦办事处。然后在下午的不同时间开始轮班，潜艇（正如他们所说的那样）享受着悠闲的开始。 “人们过去常常接受国际象棋和书籍，或者做填字游戏。你可以一无所有地坐上几个小时，”12 月退休的约翰逊说。随着新闻转移的进展，订阅者在纸上勾勒出页面设计并等待故事或“副本”，这些故事或“副本”以编号页面的形式出现在铁丝篮中，每个页面包含一两个段落。潜艇被赋予故事长度，以一列类型的英寸为单位，并且必须估计要削减多少字。一旦故事的长度大致合适，它就会被送到一个修订版，被认为适合出版，然后被放在另一个篮子里，由信使收集，并通过气动管送到地下室的合成室。由于这项任务由不同的工会控制，因此禁止潜水员接触管子；三人都深情地记得，特稿编辑和后来的编辑彼得普雷斯顿是唯一敢打破这条规则的记者。写标题——通常是在编辑故事后两三个小时——也涉及计算。 Subs 得到了一个标题大小——比如三行 36 点类型的两列——并使用表格来评估适合多少字符。宽字母如 M 计为 1.5 个字符，空格计为一半。 “如果它失败了半个字符，您可能会将其发送出去并希望一切顺利，”约翰逊说。 “如果它不起作用，并且合成 [合成师] 感觉有帮助，他们可以稍微挤压一下。”除非你的标题因为它失败而被用管子发回给你，否则这通常是你直到早上看到你的工作的最后一次。 “当我们开始时，修订版有点吓人，”约翰逊说。 “他在战争中曾在轰炸机司令部工作，虽然很友善，但相当突然，他会坐在那里抽烟斗。他会瞪着旅行中的闹钟，也盯着那份复印件，随着夜幕降临，他抽着烟斗越来越厉害。如果他不喜欢头条新闻，他会毫不犹豫地把它扔回给你。”事实核查可能很费力。在没有搜索引擎的情况下，拥有广泛的常识是至关重要的，经常使用桌面地名录和名人录也是如此。在办公时间，subs 可以打电话给图书馆提问，通常在大约半小时内得到答复。但是，约翰逊说，晚上你必须自己去图书馆。 “它包含一些过时的教科书和剪报的架子，所以你需要了解那些剪报的人的思想是如何运作的，以及他们可能将这些东西归档在什么之下。”一些记者，就像现在一样，需要比其他人更多的检查：多德回忆起一个人在一个故事中用 13 种不同的方式拼写了诗人叶夫根尼·叶夫图申科的名字。\n下午 5 点，乐队的一名高级成员将下到地下室——一个充满Linotype 机器的大教堂般的空间，那时乐队将开始工作。这些故事被分发给 Linotype 操作员，他们将它们以单行方式放入熔融金属中，称为 slugs。 Comps 会在草图布局的指导下，使用冷却的金属类型组装页面，然后将其固定在框架中；丢弃它是一场灾难，被称为打印机的馅饼。对石子有严格的规定。组合（总是男性）站在一侧，而潜艇则在对面。那条线不能越过。伴奏会告诉副歌一个故事结束了多少行，副歌在纸上剪下并把它们交还给伴奏，后者取出了金属字体中的等价部分。在截止日期前，潜艇必须能够阅读正面和背面颠倒放置的领先物质。 Sivell 说：“这是一个负责任的转变，我很高兴能做到，尽管这很辛苦。我是一名非常年轻的女记者，她们可能比我更了解我的业务，​​但她们往往对男性更有帮助。”多德回忆说，尽管排版室中的大多数互动都是善意的，但这是“一种困难的关系：你正在 [为你的编辑] 与一个为主打印机工作的排版一起在一个页面上工作”。计算机逐渐被引入，最终只有新闻页面使用了热金属，直到 1987 年它也被喧闹地“敲响”（新闻业的传统告别）。多样性不是优先事项。当 Sivell 到达时，她是两名女性家庭新闻副播之一，而《卫报》是如此男性化的环境，以至于她和她的同事 Celia Locks 被邀请到女性编辑 Mary Stott 家共进午餐，讨论她们的经历。现在，在性别、阶级、种族、年龄和性取向方面的多样性得到改善，体现在更周到的语言中。 “我们更清楚地反映了读者词汇的变化，过去作为工作一部分的非常白人男性的词汇已经消失，”西维尔说，他仍然为该报做自由轮班。 “我们有一个不断受到审查和挑战的风格指南。妓女或性工作者，诸如‘他们’之类的代词的使用——这就是语言的演变方式，这掌握在潜艇手中。”我当时最大的变化是对网站的关注。从附属的副业，主要是初级员工，它已经成为一个全天候的全球业务，在伦敦、悉尼和纽约设有分部。\n如今，我们在伦敦的许多人通过网络和印刷品工作。有些人更喜欢每天在晚上 9 点截止日期前赶时间。其他人喜欢网络字幕的灵活性，以及​​它的速度和范围。无论我们在哪张桌子上工作，无论我们来自哪个时期，我们都可以回忆起创作一个重大故事时的电击气氛——从水门事件（多德），到戴安娜（约翰逊）之死，波蒂略失去座位的那个晚上（ Sivell）或英国投票支持脱欧（我）。新技术于 1980 年代中期首次印刷，以四节 AA 电池供电的 Tandys 形式出现，可记忆约 1,000 个单词。计算机逐渐被引入，最终只有新闻页面使用了热金属，直到 1987 年它也被嘈杂地“砰”地一声“敲响”（新闻业的传统告别）。西维尔说。 “当新技术出现时，这是一个替补的艰难时期，”多德承认道。那么，在所有技术出现之前的日子是“适当”替换的时代吗？不，西维尔说：“你现在可以专注于文字；你不是在计算一个字母的宽度。”本文于 2021 年 8 月 2 日进行了修订，以澄清有关石头子/补偿编辑过程中页面方向的详细信息。", "note_en": "A deputy news production editor at the Guardian speaks to colleagues about how cutting and correcting copy has evolved over decades\n   T he internet may have revolutionised the media in the 21 years since I joined the Guardian, but my role as a subeditor has stayed essentially the same. We check facts, write headlines and cut stories to the right length, with a final spellcheck before moving it to its next stage.\n But until late last century, subediting looked completely different. Chris Dodd started work on the features desk, then based in Manchester, in 1965, after an “interview” in a pub (he didn’t know whether to drink or abstain, or buy a round), while Barry Johnson and Jay Sivell joined the London office in Farringdon Road in 1986. Shifts then started at various points in the afternoon, and subs (as they are called) enjoyed a leisurely start. “People used to take in chess sets and books, or do the crossword. You could sit for hours with nothing,” says Johnson, who retired in December.\n  As news shifts progressed, subs sketched out page designs on paper and awaited the stories, or “copy”, which arrived in a wire basket as numbered pages, each containing one or two paragraphs. Subs were given story lengths, measured as inches down a single column of type, and had to estimate how many words to cut. Once the story was approximately the right length, it went to a revise sub to be deemed fit for publication before being placed in another basket to be collected by a messenger and sent by pneumatic tube to the compositing room in the basement. Subs were banned from touching the tubes as this task was controlled by a different union; all three fondly remember that Peter Preston, features editor and later editor, was the only journalist who dared break this rule.\n Writing headlines – often two or three hours after editing the story – also involved calculations. Subs got a headline size – say three lines of 36-point type over two columns – and used a table to assess how many characters would fit. Wide letters such as M counted as 1.5 characters and spaces counted as a half. “If it bust by half a character, you might send it down and hope for the best,” says Johnson. “If it didn’t work and the comps [compositors] were feeling helpful, they could squeeze it a bit.” Unless your headline was sent back to you in a tube because it bust, that was usually the last you saw of your work until the morning.\n  “When we started, the revise sub was slightly frightening,” says Johnson. “He’d been in Bomber Command in the war and was rather abrupt, though kindly, and he’d sit there smoking his pipe. He’d glare at his travelling alarm clock and glare at the copy, puffing at his pipe more as the evening went on. If he didn’t like a headline, he’d literally throw it back at you.”\n Fact-checking could be laborious. Without search engines, having vast general knowledge was crucial, as was frequent use of the desk’s gazetteer and Who’s Who. In office hours, subs could call the library with questions, with answers typically provided in about half an hour. But, says Johnson, in the evening you had to go up to the library yourself. “It consisted of some obsolete textbooks and shelves of cuttings, so you needed a feel for how the minds worked of the people who took the cuttings and what they might have filed things under.” Some reporters, as now, needed more checking than others: Dodd recalls one spelling the name of the poet Yevgeny Yevtushenko 13 different ways in one story.\n A senior member of the team known as the stone sub would go down to the basement – a cathedral-like space filled with Linotype machines – at 5pm, when the comps would start work. The stories were handed out to Linotype operators, who set them in molten metal in single lines, known as slugs. Comps would assemble the page, guided by the sketched layout, using the cooled metal type, before it was secured in a frame; dropping it was a disaster known as printer’s pie.\n There were strict rules for the stone sub. The comp (always male) stood on one side, and the sub was opposite. That line could not be crossed. The comp would tell the sub how many lines a story was over, and the sub made cuts on paper and handed them back to the comp, who took out the equivalent bits in the metal type. On deadline, subs had to be able to read the lead over-matter laid out on the side upside down as well as back to front.\n  Sivell says: “It was a responsible shift and I felt pleased to do it, even though it was hard work. I was a very young female journalist and they did know my business better than I did, probably, but they tended to be more helpful to the men.”\n Dodd recalls that although most interactions in the comp room were good-natured, it was “a difficult relationship: you’re working [for your editor] on a page with a comp who’s working for the master printer”.\n Computers were introduced gradually and eventually only the news pages used hot metal, until it too was noisily &#39;banged out&#39; (a traditional farewell in journalism) in 1987\n Diversity was not a priority. When Sivell arrived she was one of two female home news subs, and the Guardian was such a masculine environment that she and her colleague Celia Locks were invited to lunch at the home of Mary Stott, the women’s editor, to discuss their experiences. Improved diversity now, in terms of gender, class, ethnicity, age and sexuality, is reflected in more thoughtful language. “We are more aware of reflecting changes in vocabulary for the readership, and that the very white male vocabulary that used to be part of the job has gone,” says Sivell, who still does freelance shifts for the paper. “We have a style guide that is constantly being reviewed and challenged. Prostitute or sex worker, the use of pronouns such as ‘they’ – this is how language evolves, and that is in the hands of the subs.”\n The biggest change in my time has been the focus on the website. From a sideline in an annex, with mostly junior staff, it has become a round-the-clock global operation, with subs in London, Sydney and New York.\n These days, many of us in London work across web and print. Some prefer print’s daily rush for the 9pm deadline. Others like the flexibility of web subbing, as well as its speed and reach. Whichever desk we work on, and whichever period we come from, we can all recall the electric atmosphere when working on a big breaking story – from Watergate (Dodd), to the death of Diana (Johnson), the night Portillo lost his seat (Sivell) or the UK voting for Brexit (me).\n New technology first arrived for print in the mid-1980s, in the form of Tandys powered by four AA batteries and with a memory of about 1,000 words. Computers were introduced gradually, and eventually only the news pages used hot metal, until it too was noisily “ banged out” (a traditional farewell in journalism) in 1987.\n The moment when journalists were on machines dealing with type themselves was a huge step, Sivell says. “It was a ropey period for subbing when new tech came in,” admits Dodd.\n So were the days before all the technology the era of “proper” subbing? No, says Sivell: “You can focus on the words now; you’re not fiddling about counting how wide a letter is.”\n  This article was amended on 2 August 2021 to clarify details about the orientation of the page during the stone sub/comp editing process.", "posttime": "2021-08-03 02:59:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,阅读,art,编辑", "title": "副编辑不断变化的艺术：“你必须颠倒阅读类型”", "title_en": "The changing art of the subeditor: ‘You had to read the type upside down’", "transed": 1, "url": "https://www.theguardian.com/media/2021/aug/02/the-changing-art-of-the-subeditor-you-had-to-read-the-type-upside-down", "via": "", "real_tags": ["艺术", "阅读", "art", "编辑"]}, {"category": "", "categoryclass": "", "imagename": "d8e87601f88cfc839f0381123eadb1fd.jpg", "infoid": 1071251, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "7 月 30 日（现在的可再生能源）——尽管大流行，美国在 2020 年安装了创纪录的 26 吉瓦清洁能源工厂，达到超过 170 吉瓦的风能、公用事业太阳能和电池存储电力容量，根据第一份清洁能源年度报告美国清洁能源 (ACP) 协会于周四发布。该国增加了 16,836 兆瓦的陆上风能、8,894 兆瓦的公用事业规模太阳能和 760 兆瓦的电池存储容量，它们在 2020 年占所有新电力装置的 78%，高于 2010 年的 28%。目前为 10.7%报告称，美国的电力来自清洁能源技术。去年委托的项目转化为约 390 亿美元（330 亿欧元）的投资。还有近 90 吉瓦的清洁能源项目正在进行中，投资额超过 1200 亿美元。美国东海岸的 9 吉瓦海上风电项目正在推进开发中。 2020 年安装清洁电力容量最多的州是德克萨斯州，装机容量为 6,320 MW。接下来是加利福尼亚州的 2,193 兆瓦，佛罗里达州的 1,267 兆瓦，爱荷华州的 1,218 兆瓦和俄克拉荷马州的 1,182 兆瓦。在累计清洁电力容量方面，德克萨斯州以 37,443 MW、加利福尼亚州 20,354 兆瓦、爱荷华州 11,394 兆瓦、俄克拉荷马州 9,395 兆瓦和堪萨斯州 7,058 兆瓦领先。去年清洁发电份额排名前五的州是爱荷华州（57.6%）、堪萨斯州（43.4%）、俄克拉荷马州（35.5%）、南达科他州（32.9%）和北达科他州（30.8%）。根据 ACP 的报告，风能和太阳能是该国大部分地区最便宜的发电方式。自 2009 年以来，风能和太阳能的无补贴能源成本分别下降了 71% 和 90%。\n去年，企业对清洁能源的需求也创下历史新高，因为企业买家签订了 10,417 兆瓦的清洁电力容量，几乎与公用事业签订的 10,854 兆瓦容量持平。", "note_en": "July 30 (Renewables Now) - Despite the pandemic, the US installed a record 26 GW of clean energy plants in 2020 to reach more than 170 GW of wind, utility solar and battery storage power capacity, according to the first Clean Power Annual report of the American Clean Power (ACP) Association, released on Thursday.\n  The country added 16,836 MW of land-based wind, 8,894 MW of utility-scale solar and 760 MW of battery storage capacity, which together represent 78% of all new power installations in 2020, up from 28% in 2010. Currently, 10.7% of the US electricity comes from clean power technologies, according to the report.\n  The projects commissioned last year translate to around USD 39 billion (EUR 33bn) in investment. A further almost 90 GW of clean energy projects are underway, representing an investment of more than USD 120 billion. Offshore wind projects of 9 GW are in advanced development along the US East coast.\n  The state that installed the most clean power capacity in 2020 was Texas with 6,320 MW. Next come California with 2,193 MW, Florida with 1,267 MW, Iowa with 1,218 MW and Oklahoma with 1,182 MW.\n  In terms of cumulative clean power capacity, the chart is led by Texas with 37,443 MW, California with 20,354 MW, Iowa with 11,394 MW, Oklahoma with 9,395 MW and Kansas with 7,058 MW.\n  The top five states for share of clean power generation last year were Iowa with 57.6%, Kansas with 43.4%, Oklahoma with 35.5%, South Dakota with 32.9% and North Dakota with 30.8%.\n  According to ACP’s report, wind and solar are the cheapest form of generation in most parts of the country. Since 2009 the unsubsidised cost of energy has declined by 71% and 90% for wind and solar power, respectively.\n  Last year also saw record business demand for clean power as corporate buyers contracted 10,417 MW of clean power capacity, almost matching the 10,854 MW contracted by utilities.", "posttime": "2021-08-03 02:59:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,2020,组织,power,能源", "title": "清洁能源组织 ACP 表示，美国在 2020 年增加了创纪录的 26 吉瓦可再生能源", "title_en": "US adds record 26 GW of renewables in 2020, says clean power org ACP", "transed": 1, "url": "https://renewablesnow.com/news/us-adds-record-26-gw-of-renewables-in-2020-says-clean-power-org-acp-749351/", "via": "", "real_tags": ["美国", "2020", "组织", "power", "能源"]}, {"category": "", "categoryclass": "", "imagename": "43702aed4ff2a9ea7d2fb25458423700.jpg", "infoid": 1071250, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们的每个大脑中，有 860 亿个神经元并行工作，处理来自感官和记忆的输入，以产生人类认知的许多壮举。其他生物的大脑没有那么广泛的能力，但这些动物通常表现出对特定任务的先天能力，这些能力是经过数百万年的进化磨练出来的。我们大多数人都见过动物做聪明的事情。也许您的家养宠物是逃生艺术家。也许您住在鸟类或蝴蝶的迁徙路线附近并庆祝它们的年度回归。或者，您可能对蚂蚁侵入您的食品储藏室似乎一心一意感到惊奇。将这种专门的神经系统视为人工智能模型，可能证明与研究人脑一样有价值，甚至更多。想想你储藏室里那些蚂蚁的大脑。每个都有大约 250,000 个神经元。较大的昆虫有接近100万只。在阿尔伯克基桑迪亚国家实验室的研究中，我研究了其中一种大型昆虫蜻蜓的大脑。我和我在国家安全实验室桑迪亚的同事们希望利用这些昆虫的专长来设计计算系统，这些系统针对拦截来袭导弹或跟踪气味羽流等任务进行了优化。通过利用蜻蜓神经系统的速度、简单性和效率，我们的目标是设计能够更快地执行这些功能的计算机，并且功耗仅为传统系统的一小部分。将蜻蜓视为未来计算机系统的先驱似乎有悖常理。制造新闻的人工智能和机器学习的发展通常是模仿人类智能甚至超越人类能力的算法。在某些特定任务上，例如在医学扫描中检测癌症，神经网络的表现已经不亚于人们——如果不是更好的话。这些神经网络的潜力远远超出了视觉处理。通过自我对弈训练的计算机程序AlphaZero是世界上最好的围棋选手。它的兄弟 AI AlphaStar 跻身星际争霸 II 最佳玩家之列。然而，这样的壮举是有代价的。开发这些复杂的系统需要大量的处理能力，通常只有选择拥有最快超级计算机和支持它们的资源的机构才能使用。而且能源成本令人反感。最近的估计表明，开发和训练自然语言处理算法所产生的碳排放量大于四辆汽车在其生命周期中产生的碳排放量。但是人工神经网络真的需要大而复杂才能有用吗？我相信不会。为了在短期内获得受神经启发的计算机的好处，我们必须在简单性和复杂性之间取得平衡。这让我想起了蜻蜓，一种有大脑的动物，可以为某些应用提供精确的平衡。\n如果您曾经遇到过蜻蜓，您就会知道这些美丽的生物的缩放速度有多快，并且您已经看到了它们在空中惊人的敏捷性。随便观察一下，也许不太明显的是它们出色的狩猎能力：蜻蜓成功捕获了高达 95% 的猎物，一天吃掉数百只蚊子。蜻蜓的身体实力当然不会被忽视。几十年来，美国机构一直在尝试将蜻蜓设计用于监视无人机。现在是时候把我们的注意力转向控制这个微型狩猎机器的大脑了。虽然蜻蜓可能无法玩像围棋这样的战略游戏，但蜻蜓确实展示了一种战略形式，它在猎物当前位置之前瞄准以拦截它的晚餐。这需要以极快的速度执行计算——蜻蜓通常只需要 50 毫秒就可以开始转动以响应猎物的动作。它在跟踪头部和身体之间的角度的同时这样做，以便它知道哪个翅膀更快地扇动以在猎物前面转动。它还会跟踪自己的动作，因为当蜻蜓转动时，猎物也会出现移动。考虑到单个神经元将其所有输入相加所需的时间（称为膜时间常数）超过 10 毫秒，因此蜻蜓的大脑正在执行一项非凡的壮举。如果你考虑到眼睛处理视觉信息的时间和肌肉产生移动所需的力的时间，那么实际上只有三层甚至四层神经元按顺序将它们的输入相加并传递信息我可以建立一个像蜻蜓拦截系统一样工作的神经网络吗？我还想知道这种受神经启发的拦截系统的用途。在桑迪亚，我立即考虑了防御应用，例如导弹防御，想象未来的导弹具有旨在快速计算拦截轨迹而不影响导弹重量或功耗的机载系统。但也有民用应用。例如，控制自动驾驶汽车的算法可能会变得更高效，不再需要大量的计算设备。如果受蜻蜓启发的系统可以执行计算以绘制拦截轨迹，那么自主无人机或许可以使用它来避免碰撞。如果计算机可以制造成与蜻蜓大脑相同的大小（约 6 立方毫米），也许有一天驱虫剂和蚊帐将成为过去，取而代之的是小型杀虫无人机！为了开始回答这些问题，我创建了一个简单的神经网络来代替蜻蜓的神经系统，并用它来计算蜻蜓捕捉猎物的转弯。我的三层神经网络作为软件模拟存在。最初，我在 Matlab 中工作只是因为那是我已经在使用的编码环境。从那以后，我将该模型移植到 Python 中。\n因为蜻蜓必须看到它们的猎物才能捕捉到它，所以我首先模拟了蜻蜓眼睛的简化版本，捕捉了追踪猎物所需的最少细节。尽管蜻蜓有两只眼睛，但人们普遍认为它们不使用立体深度感知来估计与猎物的距离。在我的模型中，我没有对双眼进行建模。我也没有试图匹配蜻蜓眼的分辨率。相反，神经网络的第一层包括 441 个代表眼睛输入的神经元，每个神经元描述视野的一个特定区域——这些区域被平铺以形成一个 21×21 的神经元阵列，覆盖蜻蜓的视野。看法。随着蜻蜓转动，猎物图像在蜻蜓视野中的位置发生变化。蜻蜓计算将猎物的图像与这些“眼睛”神经元中的一个（或几个，如果猎物足够大）对齐所需的轮数。第二组 441 个神经元，也在网络的第一层，告诉蜻蜓哪些眼睛神经元应该与猎物的图像对齐，即猎物应该在其视野内的哪个位置。处理——接收描述物体在视野中​​运动的输入并将其转化为关于蜻蜓需要转向哪个方向的指令的计算——发生在我的人工神经网络的第一层和第三层之间。在第二层中，我使用了 194,481 (21 4) 个神经元的阵列，可能比蜻蜓用于此任务的神经元数量大得多。我预先计算了网络中所有神经元之间连接的权重。虽然这些权重可以用足够的时间学习，但通过进化和预编程的神经网络架构“学习”是有优势的。一旦它作为有翼成虫（技术上称为天体）从若虫阶段出来，蜻蜓就没有父母来喂养它或向它展示如何捕猎。蜻蜓处于脆弱状态，适应了新的身体——同时想出狩猎策略是不利的。我设置了网络的权重以允许模型蜻蜓计算正确的转弯以从传入的视觉信息中拦截它的猎物。那些是什么转弯？好吧，如果蜻蜓想要抓住一只穿过它路径的蚊子，它不能只瞄准蚊子。借用曲棍球运动员韦恩·格雷茨基 (Wayne Gretsky) 曾经说过的关于冰球的说法，蜻蜓必须瞄准蚊子所在的位置。您可能认为遵循 Gretsky 的建议需要复杂的算法，但实际上该策略非常简单：蜻蜓所需要做的就是在其视线与午餐和固定参考方向之间保持恒定的角度。有任何驾驶船只经验的读者都会明白为什么会这样。当另一艘船的视线与参考方向（例如正北）之间的角度保持不变时，他们知道会担心，因为他们处于碰撞路线上。水手长期以来一直避免转向这种称为平行导航的路线，以避免碰撞 翻译成蜻蜓，它们想要与猎物发生碰撞，处方很简单：相对于某些外部参考，保持对猎物的视线恒定。然而，对于蜻蜓来说，这项任务不一定是微不足道的，因为它会猛扑和转身，收集食物。蜻蜓没有内部陀螺仪（我们知道），无论蜻蜓如何转动，它都会保持恒定的方向并提供参考。它也没有始终指向北方的磁罗盘。在我对蜻蜓狩猎的简化模拟中，蜻蜓转向将猎物的图像与其眼睛上的特定位置对齐，但它需要计算该位置应该是什么。我的模拟神经网络的第三层也是最后一层是运动命令层。这一层神经元的输出是蜻蜓肌肉的高级指令，告诉蜻蜓向哪个方向转动。蜻蜓还使用该层的输出来预测它自己的动作对其视野中猎物图像位置的影响，并相应地更新投影位置。这种更新允许蜻蜓在接近猎物时相对于外部世界保持其猎物的视线稳定。生物蜻蜓可能已经进化出额外的工具来帮助进行这种预测所需的计算。例如，蜻蜓有专门的传感器来测量飞行过程中的身体旋转以及头部相对于身体的旋转——如果这些传感器足够快，蜻蜓可以直接从传感器输出或使用一种方法来交叉检查另一种。我在模拟中没有考虑这种可能性。为了测试这个三层神经网络，我模拟了一只蜻蜓和它的猎物，它们在三维空间中以相同的速度移动。当他们这样做时，我的模型神经网络大脑“看到”了猎物，计算指向哪里以将猎物的图像保持在一个恒定的角度，并向肌肉发送适当的指令。我能够证明蜻蜓大脑的这个简单模型确实可以成功拦截其他虫子，甚至是沿着弯曲或半随机轨迹行进的猎物。模拟蜻蜓虽然没有完全达到生物蜻蜓的成功率，但也不具备蜻蜓众所周知的所有优点（例如惊人的飞行速度）。\n需要做更多的工作来确定这个神经网络是否真的包含了蜻蜓大脑的所有秘密。弗吉尼亚州霍华德休斯医学研究所 Janelia 研究园区的研究人员为蜻蜓开发了微型背包，可以在蜻蜓飞行时测量来自其神经系统的电信号并传输这些数据进行分析。背包足够小，不会分散蜻蜓的注意力。同样，神经科学家还可以记录蜻蜓大脑中单个神经元的信号，同时昆虫保持不动，但通过向其提供适当的视觉提示，使其认为它在移动，从而创建了一个蜻蜓级的虚拟现实。来自这些系统的数据允许神经科学家通过将蜻蜓大脑模型的活动与活跃蜻蜓中生物神经元的活动模式进行比较来验证蜻蜓大脑模型。虽然我们还不能直接测量蜻蜓大脑中神经元之间的个体连接，但我和我的合作者将能够推断出蜻蜓的神经系统是否正在进行类似于我的人工神经网络预测的计算。这将有助于确定蜻蜓大脑中的连接是否类似于我在神经网络中预先计算的权重。我们将不可避免地找到我们的模型与实际蜻蜓大脑不同的方式。也许这些差异将为蜻蜓大脑加速计算的捷径提供线索。蜻蜓还可以教我们如何在计算机上实现“注意力”。您可能知道当您的大脑全神贯注、完全处于该区域、专注于一项任务到其他分心似乎逐渐消失时的感觉。蜻蜓同样可以集中注意力。它的神经系统会提高对特定的、可能选定的目标的反应音量，即使在同一视野中可以看到其他潜在的猎物。蜻蜓一旦决定追逐特定的猎物，只有在未能捕捉到它的第一选择时才应该改变目标，这是有道理的。 （换句话说，如果你很容易分心，使用平行导航来吃饭是没有用的。）即使我们最终发现用于引导注意力的蜻蜓机制不如人们在拥挤的人群中集中注意力的那些机制那么复杂咖啡店，通过提供有效的方法来丢弃不相关的输入，一种更简单但功耗更低的机制可能会证明对下一代算法和计算机系统有利。研究蜻蜓大脑的优势并不止于新算法；它们还会影响系统设计。蜻蜓的眼睛速度很快，相当于每秒 200 帧：这是人类视觉速度的几倍。但它们的空间分辨率相对较差，可能只有人眼的百分之一。尽管感知能力有限，但了解蜻蜓如何如此有效地捕猎，可以为设计更高效系统提供建议。使用导弹防御问题，蜻蜓的例子表明，我们具有快速光学传感的反导弹系统可能需要较低的空间分辨率来击中目标。蜻蜓并不是当今唯一可以为受神经启发的计算机设计提供信息的昆虫。帝王蝶的迁徙距离令人难以置信地长，它们利用某种与生俱来的本能在一年中的适当时间开始它们的旅程，并朝着正确的方向前进。我们知道君主依赖于太阳的位置，但是通过太阳航行需要跟踪一天中的时间。如果你是一只向南飞的蝴蝶，你会希望太阳早上在你的左边，而在下午的时候在你的右边。因此，为了确定路线，蝴蝶大脑必须读取自己的昼夜节律，并将该信息与所观察到的信息结合起来。其他昆虫，如撒哈拉沙漠蚂蚁，必须相对长距离觅食。一旦找到食物来源，这只蚂蚁不会简单地原路返回巢穴，很可能是一条迂回的路径。相反，它计算返回的直接路线。因为蚂蚁食物来源的位置每天都在变化，所以它必须能够记住它在觅食过程中走过的路径，将视觉信息与一些内部距离测量结合起来，然后从这些记忆中计算出它的返回路线。\n虽然没有人知道沙漠蚂蚁的哪些神经回路执行这项任务，但 Janelia 研究园区的研究人员已经确定了允许果蝇使用视觉地标进行自我定位的神经回路。沙漠蚂蚁和帝王蝶可能使用类似的机制。这种神经回路有朝一日可能会被证明在低功率无人机中很有用。如果受昆虫启发的计算的效率使得这些专门组件的数百万个实例可以并行运行以支持更强大的数据处理或机器学习，该怎么办？下一个 AlphaZero 能否结合数以百万计的蚂蚁觅食架构来改进其游戏玩法？也许昆虫会激发新一代看起来与我们今天所拥有的截然不同的计算机。一小群类似蜻蜓拦截的算法可用于控制游乐园游乐设施的移动部件，确保即使在复杂但激动人心的舞蹈中，个别汽车也不会发生碰撞（就像飞行员驾驶他们的船一样）。没有人知道下一代计算机会是什么样子，它们是半机械人的伙伴还是像艾萨克·阿西莫夫的 Multivac 那样的集中资源。同样，没有人能说出开发这些平台的最佳途径是什么。虽然研究人员从人脑中汲取灵感开发了早期的神经网络，但今天的人工神经网络通常依赖于绝对不像大脑的计算。研究生物神经回路中单个神经元的计算——目前只能直接在非人类系统中实现——可能会教给我们更多。昆虫看似简单，但它们的能力往往令人惊讶，它们对下一代计算机的发展有很大贡献，尤其是随着神经科学研究继续推动对生物神经回路如何工作的更深入了解。所以下次当你看到一只昆虫做一些聪明的事情时，想象一下如果你能拥有一支由蜻蜓、蝴蝶或蚂蚁大脑组成的小军队的出色效率，它会对你的日常生活产生什么影响。也许未来的计算机会给“蜂巢思维”这个术语赋予新的含义，它拥有大量高度专业化但极其高效的微型处理器，能够根据手头的任务进行重新配置和部署。随着当今神经科学的进步，这种看似幻想的事物可能比您想象的更接近现实。这篇文章作为“蜻蜓大脑的教训”出现在 2021 年 8 月的印刷版中。", "note_en": "In each of our brains, 86 billion neurons work in parallel, processing inputs from senses and memories to produce the many feats of human cognition. The brains of other creatures are less broadly capable, but those animals often exhibit innate aptitudes for particular tasks, abilities honed by millions of years of evolution.\n Most of us have seen animals doing clever things. Perhaps your house pet is an escape artist. Maybe you live near the migration path of birds or butterflies and celebrate their annual return. Or perhaps you have marveled at the seeming single-mindedness with which ants invade your pantry\n Looking to such specialized nervous systems as a model for artificial intelligence may prove just as valuable, if not more so, than studying the human brain. Consider the brains of those ants in your pantry. Each has some 250,000 neurons. Larger insects have closer to 1 million. In my research at Sandia National Laboratories in Albuquerque, I study the brains of one of these larger insects, the dragonfly. I and my colleagues at Sandia, a national-security laboratory, hope to take advantage of these insects&#39; specializations to design computing systems optimized for tasks like intercepting an incoming missile or following an odor plume. By harnessing the speed, simplicity, and efficiency of the dragonfly nervous system, we aim to design computers that perform these functions faster and at a fraction of the power that conventional systems consume.\n Looking to a dragonfly as a harbinger of future computer systems may seem counterintuitive. The developments in artificial intelligence and machine learning that make news are typically algorithms that mimic human intelligence or even surpass people&#39;s abilities. Neural networks can already perform as well—if not better—than people at some specific tasks, such as detecting cancer in medical scans. And the potential of these neural networks stretches far beyond visual processing. The computer program   AlphaZero, trained by self-play, is the best Go player in the world. Its sibling AI,   AlphaStar, ranks among the best  Starcraft II players.\n Such feats, however, come at a cost. Developing these sophisticated systems requires massive amounts of processing power, generally available only to select institutions with the fastest supercomputers and the resources to support them. And the energy cost is off-putting.\t   Recent estimates suggest that the carbon emissions resulting from developing and training a natural-language processing algorithm are greater than those produced by four cars over their lifetimes.\n  But does an artificial neural network really need to be large and complex to be useful? I believe it doesn&#39;t. To reap the benefits of neural-inspired computers in the near term, we must strike a balance between simplicity and sophistication.\n Which brings me back to the dragonfly, an animal with a brain that may provide precisely the right balance for certain applications.\n If you have ever encountered a dragonfly, you already know how fast these beautiful creatures can zoom, and you&#39;ve seen their incredible agility in the air. Maybe less obvious from casual observation is their excellent hunting ability: Dragonflies successfully capture up to 95 percent of the prey they pursue, eating hundreds of mosquitoes in a day.\n The physical prowess of the dragonfly has certainly not gone unnoticed. For decades, U.S. agencies have experimented with using dragonfly-inspired designs for surveillance drones. Now it is time to turn our attention to the brain that controls this tiny hunting machine.\n While dragonflies may not be able to play strategic games like Go, a dragonfly does demonstrate a form of strategy in the way it aims ahead of its prey&#39;s current location to intercept its dinner. This takes calculations performed extremely fast—it typically takes a dragonfly just 50 milliseconds to start turning in response to a prey&#39;s maneuver. It does this while tracking the angle between its head and its body, so that it knows which wings to flap faster to turn ahead of the prey. And it also tracks its own movements, because as the dragonfly turns, the prey will also appear to move.\n    So the dragonfly&#39;s brain is performing a remarkable feat, given that the time needed for a single neuron to add up all its inputs—called its membrane time constant—exceeds 10 milliseconds. If you factor in time for the eye to process visual information and for the muscles to produce the force needed to move, there&#39;s really only time for three, maybe four, layers of neurons, in sequence, to add up their inputs and pass on information\n Could I build a neural network that works like the dragonfly interception system? I also wondered about uses for such a neural-inspired interception system. Being at Sandia, I immediately considered defense applications, such as missile defense, imagining missiles of the future with onboard systems designed to rapidly calculate interception trajectories without affecting a missile&#39;s weight or power consumption. But there are civilian applications as well.\n For example, the algorithms that control self-driving cars might be made more efficient, no longer requiring a trunkful of computing equipment. If a dragonfly-inspired system can perform the calculations to plot an interception trajectory, perhaps autonomous drones could use it to \t avoid collisions. And if a computer could be made the same size as a dragonfly brain (about 6 cubic millimeters), perhaps insect repellent and mosquito netting will one day become a thing of the past, replaced by tiny insect-zapping drones!\n To begin to answer these questions, I created a simple neural network to stand in for the dragonfly&#39;s nervous system and used it to calculate the turns that a dragonfly makes to capture prey. My three-layer neural network exists as a software simulation. Initially, I worked in Matlab simply because that was the coding environment I was already using. I have since ported the model to Python.\n Because dragonflies have to see their prey to capture it, I started by simulating a simplified version of the dragonfly&#39;s eyes, capturing the minimum detail required for tracking prey. Although dragonflies have two eyes, it&#39;s generally accepted that they do not use stereoscopic depth perception to estimate distance to their prey. In my model, I did not model both eyes. Nor did I try to match the resolution of\t   a  dragonfly eye. Instead, the first layer of the neural network includes 441 neurons that represent input from the eyes, each describing a specific region of the visual field—these regions are tiled to form a 21-by-21-neuron array that covers the dragonfly&#39;s field of view. As the dragonfly turns, the location of the prey&#39;s image in the dragonfly&#39;s field of view changes. The dragonfly calculates turns required to align the prey&#39;s image with one (or a few, if the prey is large enough) of these &#34;eye&#34; neurons. A second set of 441 neurons, also in the first layer of the network, tells the dragonfly which eye neurons should be aligned with the prey&#39;s image, that is, where the prey should be within its field of view.\n  Processing—the calculations that take input describing the movement of an object across the field of vision and turn it into instructions about which direction the dragonfly needs to turn—happens between the first and third layers of my artificial neural network. In this second layer, I used an array of 194,481 (21 4) neurons, likely much larger than the number of neurons used by a dragonfly for this task. I precalculated the weights of the connections between all the neurons into the network. While these weights could be learned with enough time, there is an advantage to &#34;learning&#34; through evolution and preprogrammed neural network architectures. Once it comes out of its nymph stage as a winged adult (technically referred to as a teneral), the dragonfly does not have a parent to feed it or show it how to hunt. The dragonfly is in a vulnerable state and getting used to a new body—it would be disadvantageous to have to figure out a hunting strategy at the same time. I set the weights of the network to allow the model dragonfly to calculate the correct turns to intercept its prey from incoming visual information. What turns are those? Well, if a dragonfly wants to catch a mosquito that&#39;s crossing its path, it can&#39;t just aim at the mosquito. To borrow from what hockey player Wayne Gretsky once said about pucks, the dragonfly has to aim for where the mosquito is going to be. You might think that following Gretsky&#39;s advice would require a complex algorithm, but in fact the strategy is quite simple: All the dragonfly needs to do is to maintain a constant angle between its line of sight with its lunch and a fixed reference direction.\n Readers who have any experience piloting boats will understand why that is. They know to get worried when the angle between the line of sight to another boat and a reference direction (for example due north) remains constant, because they are on a collision course. Mariners have long avoided steering such a course, known as parallel navigation, to avoid collisions\n  Translated to dragonflies, which \t want to collide with their prey, the prescription is simple: keep the line of sight to your prey constant relative to some external reference. However, this task is not necessarily trivial for a dragonfly as it swoops and turns, collecting its meals. The dragonfly does not have an internal gyroscope (that we know of) that will maintain a constant orientation and provide a reference regardless of how the dragonfly turns. Nor does it have a magnetic compass that will always point north. In my simplified simulation of dragonfly hunting, the dragonfly turns to align the prey&#39;s image with a specific location on its eye, but it needs to calculate what that location should be.\n The third and final layer of my simulated neural network is the motor-command layer. The outputs of the neurons in this layer are high-level instructions for the dragonfly&#39;s muscles, telling the dragonfly in which direction to turn. The dragonfly also uses the output of this layer to predict the effect of its own maneuvers on the location of the prey&#39;s image in its field of view and updates that projected location accordingly. This updating allows the dragonfly to hold the line of sight to its prey steady, relative to the external world, as it approaches.\n It is possible that biological dragonflies have evolved additional tools to help with the calculations needed for this prediction. For example, dragonflies have specialized sensors that measure body rotations during flight as well as head rotations relative to the body—if these sensors are fast enough, the dragonfly could calculate the effect of its movements on the prey&#39;s image directly from the sensor outputs or use one method to cross-check the other. I did not consider this possibility in my simulation.\n To test this three-layer neural network, I simulated a dragonfly and its prey, moving at the same speed through three-dimensional space. As they do so my modeled neural-network brain &#34;sees&#34; the prey, calculates where to point to keep the image of the prey at a constant angle, and sends the appropriate instructions to the muscles. I was able to show that this simple model of a dragonfly&#39;s brain can indeed successfully intercept other bugs, even prey traveling along curved or semi-random trajectories. The simulated dragonfly does not quite achieve the success rate of the biological dragonfly, but it also does not have all the advantages (for example, impressive flying speed) for which dragonflies are known.\n More work is needed to determine whether this neural network is really incorporating all the secrets of the dragonfly&#39;s brain. Researchers at the Howard Hughes Medical Institute&#39;s Janelia Research Campus, in Virginia, have developed tiny backpacks for dragonflies that can measure electrical signals from a dragonfly&#39;s nervous system while it is in flight and transmit these data for analysis. The backpacks are small enough not to distract the dragonfly from the hunt. Similarly, neuroscientists can also record signals from individual neurons in the dragonfly&#39;s brain while the insect is held motionless but made to think it&#39;s moving by presenting it with the appropriate visual cues, creating a dragonfly-scale virtual reality.\n Data from these systems allows neuroscientists to validate dragonfly-brain models by comparing their activity with activity patterns of biological neurons in an active dragonfly. While we cannot yet directly measure individual connections between neurons in the dragonfly brain, I and my collaborators will be able to infer whether the dragonfly&#39;s nervous system is making calculations similar to those predicted by my artificial neural network. That will help determine whether connections in the dragonfly brain resemble my precalculated weights in the neural network. We will inevitably find ways in which our model differs from the actual dragonfly brain. Perhaps these differences will provide clues to the shortcuts that the dragonfly brain takes to speed up its calculations.\n  Dragonflies could also teach us how to implement &#34;attention&#34; on a computer. You likely know what it feels like when your brain is at full attention, completely in the zone, focused on one task to the point that other distractions seem to fade away. A dragonfly can likewise focus its attention. Its nervous system turns up the volume on responses to particular, presumably selected, targets, even when other potential prey are visible in the same field of view. It makes sense that once a dragonfly has decided to pursue a particular prey, it should change targets only if it has failed to capture its first choice. (In other words, using parallel navigation to catch a meal is not useful if you are easily distracted.)\n Even if we end up discovering that the dragonfly mechanisms for directing attention are less sophisticated than those people use to focus in the middle of a crowded coffee shop, it&#39;s possible that a simpler but lower-power mechanism will prove advantageous for next-generation algorithms and computer systems by offering efficient ways to discard irrelevant inputs\n The advantages of studying the dragonfly brain do not end with new algorithms; they also can affect systems design. Dragonfly eyes are fast, operating at the equivalent of 200 frames per second: That&#39;s several times the speed of human vision. But their spatial resolution is relatively poor, perhaps just a hundredth of that of the human eye. Understanding how the dragonfly hunts so effectively, despite its limited sensing abilities, can suggest ways of designing more efficient systems. Using the missile-defense problem, the dragonfly example suggests that our antimissile systems with fast optical sensing could require less spatial resolution to hit a target.\n The dragonfly isn&#39;t the only insect that could inform neural-inspired computer design today. Monarch butterflies migrate incredibly long distances, using some innate instinct to begin their journeys at the appropriate time of year and to head in the right direction. We know that monarchs rely on the position of the sun, but navigating by the sun requires keeping track of the time of day. If you are a butterfly heading south, you would want the sun on your left in the morning but on your right in the afternoon. So, to set its course, the butterfly brain must therefore read its own circadian rhythm and combine that information with what it is observing.\n Other insects, like the Sahara desert ant, must forage for relatively long distances. Once a source of sustenance is found, this ant does not simply retrace its steps back to the nest, likely a circuitous path. Instead it calculates a direct route back. Because the location of an ant&#39;s food source changes from day to day, it must be able to remember the path it took on its foraging journey, combining visual information with some internal measure of distance traveled, and then\t   calculate its return route from those memories.\n While nobody knows what neural circuits in the desert ant perform this task, researchers at the Janelia Research Campus have identified neural circuits that allow the fruit fly to\t   self-orient using visual landmarks. The desert ant and monarch butterfly likely use similar mechanisms. Such neural circuits might one day prove useful in, say, low-power drones.\n And what if the efficiency of insect-inspired computation is such that millions of instances of these specialized components can be run in parallel to support more powerful data processing or machine learning? Could the next AlphaZero incorporate millions of antlike foraging architectures to refine its game playing? Perhaps insects will inspire a new generation of computers that look very different from what we have today. A small army of dragonfly-interception-like algorithms could be used to control moving pieces of an amusement park ride, ensuring that individual cars do not collide (much like pilots steering their boats) even in the midst of a complicated but thrilling dance.\n No one knows what the next generation of computers will look like, whether they will be part-cyborg companions or centralized resources much like Isaac Asimov&#39;s Multivac. Likewise, no one can tell what the best path to developing these platforms will entail. While researchers developed early neural networks drawing inspiration from the human brain, today&#39;s artificial neural networks often rely on decidedly unbrainlike calculations. Studying the calculations of individual neurons in biological neural circuits—currently only directly possible in nonhuman systems—may have more to teach us. Insects, apparently simple but often astonishing in what they can do, have much to contribute to the development of next-generation computers, especially as neuroscience research continues to drive toward a deeper understanding of how biological neural circuits work.\n So next time you see an insect doing something clever, imagine the impact on your everyday life if you could have the brilliant efficiency of a small army of tiny dragonfly, butterfly, or ant brains at your disposal. Maybe computers of the future will give new meaning to the term &#34;hive mind,&#34; with swarms of highly specialized but extremely efficient minuscule processors, able to be reconfigured and deployed depending on the task at hand. With the advances being made in neuroscience today, this seeming fantasy may be closer to reality than you think.\n This article appears in the August 2021 print issue as &#34;Lessons From a Dragonfly&#39;s Brain.&#34;", "posttime": "2021-08-03 02:58:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,复制,efficient,蜻蜓", "title": "快速、高效的神经网络复制蜻蜓大脑", "title_en": "Fast, Efficient Neural Networks Copy Dragonfly Brains", "transed": 1, "url": "https://spectrum.ieee.org/fast-efficient-neural-networks-copy-dragonfly-brains", "via": "", "real_tags": ["神经网络", "复制", "efficient", "蜻蜓"]}, {"category": "", "categoryclass": "", "imagename": "0858dd7d32ced134cb5798e7fc1b4c12.jpg", "infoid": 1071249, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于基础设施法案的最终谈判已将基础资金从乔拜登总统提出的 2.25 万亿美元提案降至微不足道的 5500 亿美元。据 E&amp;E News 报道，监督谈判的两党参议员小组从之前的草案中削减了约 290 亿美元的新支出，减少了法案中剩余的 200 亿美元气候支出。与 6 月份公布的前一份法案草案相比，该法案的最新和最终草案从公共交通支出中减少了 100 亿美元，从电动校车资金中减少了 50 亿美元。它还有效地将电动汽车充电基础设施从之前的草案减少了一半，从 150 亿美元减少到 75 亿美元。这些削减是两党组织一再对拜登最初提案中的气候条款进行大幅削减的又一个例子。电动汽车融资比最初的 1740 亿美元减少了近 96%，交通融资总体上减少了 2630 亿美元。两党团体与拜登一起吹捧该法案是成功的。拜登在一份声明中说：“这笔交易向世界表明，我们的民主可以发挥作用、实现并做大事。”但是，到目前为止，基础设施谈判更多的是挫败民主党立法者和进步运动，而不是给他们一些值得庆祝的东西。数月来，进步人士一直在说，他们不会支持一项没有充分解决气候危机的法案，他们采用了“没有气候，就没有交易”的口号。两党协议中对气候条款的大幅削减与进步人士今年早些时候提出的 10 万亿美元气候、司法和基础设施法案形成鲜明对比，该法案称为“繁荣法案”。该法案旨在减少排放，同时在未来十年推动司法倡议，气候倡导者称赞它是华盛顿唯一接近与气候危机规模相匹配的提案之一。\n尽管 THRIVE 法案获得通过的可能性很小，但关注气候的进步人士并没有失去所有希望。民主党人希望将谈判中削减的气候和其他条款纳入一项 3.5 万亿美元的和解法案，只要所有民主党参议员都参与，他们就可以通过简单的多数票通过。然而，参议员 Kyrsten Sinema（D-Arizona）最近宣布反对该计划，对淡化的和解和基础设施法案的渐进式支持提出了质疑。众议员亚历山大·奥卡西奥-科尔特斯（D-New York）指出，两党团体从法案中削减气候条款的动机可能直接来自化石燃料说客。 “埃克森美孚的游说者吹嘘他们在这笔交易中的影响力有多大，”她在推特上说。 “这就是这种影响的样子，”她说，并分享了关于气候条款被削减的 E&amp;E 新闻报道。事实上，绿色和平组织 6 月份的一份爆炸性报告发现，埃克森美孚持续了数十年来与气候政策作斗争的做法，正在“幕后努力消除为拜登的气候政策提供的拟议资金”。游说者还针对两党团体中的一些保守派共和党人和民主党人，包括参议员乔曼钦（西弗吉尼亚州民主党）、电影院、约翰泰斯特（蒙大拿州民主党）、克里斯库恩斯（特拉华州民主党）和雪莱摩尔卡皮托（R-西弗吉尼亚州）。", "note_en": "The final negotiations over the infrastructure bill have ground funding down to a paltry $550 billion, from what began as a $2.25 trillion proposal from President Joe Biden.\n The bipartisan group of senators overseeing the negotiations cut about   $29 billion  in new spending from the previous draft, eliminating $20 billion of   what little climate spending  was left in the bill,   E&amp;E News  reported.\n Compared to the previous draft of the bill announced in June, the latest and final draft of the bill removes $10 billion from public transit spending and $5 billion from electric school bus funding. It also effectively cut electric vehicle charging infrastructure in half from the previous draft from $15 billion to $7.5 billion.\n  The cuts are yet another instance of drastic reductions that the bipartisan group has repeatedly made to climate provisions from Biden’s original proposal. Electric vehicle funding fell by nearly 96 percent from the first proposal of $174 billion, and   transportation funding  in general took a $263 billion cut.\n The bipartisan group, along with Biden, touted the bill as a success. “This deal signals to the world that our democracy can function, deliver, and do big things,” Biden said   in a statement .\n But, so far, the infrastructure negotiations have done more to frustrate Democratic lawmakers and progressive movements than to give them something to celebrate. Progressives have been saying for months that they wouldn’t support a bill that didn’t sufficiently address the climate crisis, adopting the mantra “  no climate, no deal .”\n The sharp cuts to climate provisions in the bipartisan deal are a sharp contrast from the $10 trillion climate, justice and infrastructure bill that progressives had introduced earlier this year, called   the THRIVE Act . The bill aims to reduce emission while boosting justice initiatives over the next decade, and climate advocates have lauded it as one of the only proposals in Washington that comes close to matching the scale of the climate crisis.\n Though the THRIVE Act has little chance of passing, all hope isn’t lost for climate-focused progressives. Democrats were hoping to tack on climate and other provisions cut from the negotiations onto a $3.5 trillion reconciliation bill that they could pass through a simple majority vote as long as all Democratic senators were on board.\n However, Sen. Kyrsten Sinema’s (D-Arizona)   recently announced opposition  to that plan, throwing progressive support for watered-down reconciliation and infrastructure bills   into question .\n    Rep. Alexandria Ocasio-Cortez (D-New York) pointed out that the motivation of the bipartisan group to cut climate provisions from the bill might have come directly from fossil fuel lobbyists. “  Exxon lobbyists bragged about how much influence  they had in this deal,” she said on Twitter. “This is what that influence looks like,” she said, sharing the   E&amp;E News  report on the climate provisions being cut.\n Indeed, an explosive   June report  from Greenpeace found that Exxon, continuing decades-long practices of fighting climate policy, was “working hard behind the scenes to eliminate the proposed funding” for Biden’s climate policies.\n The lobbyists had also targeted a number of the conservative Republicans and Democrats in the bipartisan group, including Senators Joe Manchin (D-West Virginia), Sinema, John Tester (D-Montana), Chris Coons (D-Delaware) and Shelley Moore Capito (R-West Virginia).", "posttime": "2021-08-03 02:58:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "影响,influenced,法案", "title": "受埃克森美孚影响的参议员几乎摆脱了基础设施的影响", "title_en": "Exxon-Influenced Senators Carved Climate Out of Infrastructure Almost", "transed": 1, "url": "https://truthout.org/articles/exxon-influenced-senators-carved-climate-out-of-infrastructure-almost-entirely/", "via": "", "real_tags": ["影响", "法案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071248, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我十几岁的周末和暑期工作是在一家“大盒子”商店做货架堆垛员。我专业从事打印机和打印机墨盒。客户有时想听听我的建议，但一旦他们收到我对 100 英镑单声道激光的推荐，他们就再也不想听了。他们中的大多数人以不到 30 英镑的价格购买了店里最便宜的打印机，Lexmark 型号，显然是一笔划算的交易。他们中的很大一部分在一周内返回购买更多墨水，因为与打印机捆绑在一起的墨盒只装满了三分之一。当他们看到他们的新打印机的补充墨盒将近 40 英镑时，他们往往真的成为了一笔令人震惊的交易。那时他们最不想听到的事情是“再次流血的单色激光”。更换打印机会更合理，但沉没成本谬论产生了强大的吸引力，大多数人确实购买了补充墨盒。那个小小的 Lexmark 墨盒做了很好的回头客。打印机的秘密在于您不是购买打印机，而是订阅打印机墨盒，这通常是毁灭性的。但这个事实是模糊的，打印机制造商努力确保它仍然如此。花钱买东西有两种方式。一种是直接购买某物然后拥有它。会计师称此为资本支出（“资本支出”），因为您正在花费公司的股本。然后它最终会出现在您的资产负债表上，这意味着您将其视为公司拥有的有价值的东西。另一种方式是租房。会计师称之为运营支出（“opex”），而不是永远拥有这件东西，你付钱给某人让你暂时使用它。尽管有打印机示例，但重要的是要了解这不一定更糟，而且通常会更好。作为一家公司，如果您拥有自己的办公室，您将把公司的资金投入到公司经营所在城镇的商业地产中。这将是您的核心业务无法再使用的一些资金。如果您的核心业务的股本回报率为 20%，那么将您的资本用于那里可能是一个更好的主意，而不是将其投入商业地产，因为商业地产每年仅能产生 7% 的收益（...在好年景中）。并非所有资本支出与运营支出的决策都如此理性或如此明确。现代企业的一大自负是假装自己在投资资本，而实际上只是在培养新的支出流。人们通常会说他们正在“投资[某某]”或“建立资产”，而实际上他们只是为支出分配了更多预算（即：运营支出）。\n什么是资产？更多来自会计帮助的条款。当会计师对资产进行估值以将其记录在公司资产负债表上时，他们会以历史成本或可变现净值（以较低者为准）标记其价值。对于许多软件项目来说，证明“净可变现价值”是很困难的。这意味着您必须找到买家。那不是会购买许可证（即租用权限）的人，而是会直接购买东西并将其从您身上拿走的人。产生收入并不能使某些东西成为资产——尽管如果您可以出售许可证（扣除成本后有利可图！），这表明可能有人会购买它，或者它可以作为单独的业务分拆出来。在实践中，任何软件项目都有一个真正的潜在买家是非常特殊的。那个新的“大数据”仓库平台可能不会有任何现成的买家——它对您的业务过于具体，具有您“需要”的分析数据。新的客户服务系统也不会——酒店业中没有其他人会要求基于 Kafka 的酒店投诉可重播性。资本化的压力从何而来？一般来自管理人员。大多数业务部门都有一些收入和一些支出。如果您开始将东西资本化，这些费用就会消失，更好的是，甚至开始作为资产出现在您的资产负债表上——无论多么模糊。现在你的数字看起来非常好。会计师以前听说过这个，这就是规则如此严格的原因。我的一个基本事实是，软件项目实际上看起来更像是一种负债而不是资产。软件，无论是否有人从中获得任何好处，都会吸引大量非常烦人的费用：安全漏洞争夺、错误修复和数据库升级，所有这些都让富有的系统管理员腰包。就像我十几岁的打印机一样，有些东西看起来是产品，但实际上是订阅。秘密订阅的产品的一个标志是网络：如果它连接到互联网，因此连接到某个服务器，它很可能是订阅而不是产品 - 即使“产品”本身声称另有说法。我最喜欢的例子是“智能”电视，有一天他们自己决定开始展示他们的广告：对于那些认为自己是所有者的订阅者来说，这是一种新的、经常性的心理成本。另一个是拖拉机制造商约翰迪尔 (John Deere)，他们努力确保您仅靠一套插座和一份用户手册就无法再让拖拉机保持良好的工作状态，而且还需要付费订阅他们的在线服务：（否则他们将远程禁用关键功能）。\n套用莱斯利·兰波特 (Leslie Lamport) 的话说，秘密订阅是一种对您甚至不知道存在的服务器的依赖，可能会使您继续使用“产品”产生新的费用。但有时，“运营成本”是可以的。有时您真的想从非常大的东西中咬一口。您想在几小时或几分钟内访问一个巨大的数据中心：那么按小时租用云计算机就是您的选择。所提供的服务中包含了操作此类事物所需的所有低级系统管理员知识 - 他们对它是一项服务非常开放。在任何给定的情况下，公司（或个人）都会想要购买或租用他们需要的东西，他们应该仔细决定要做什么。可以公平地说，这个问题的答案是企业融资的总主题。公司很少仅靠良好的公司财务就能成功，但有一种倒置的公司财务确实可以提供帮助：让您的供应商和客户做糟糕的公司财务。一个非常流行的例子是将原本单次购买软件包的方式转变为长期租赁——“SaaS”。这发生在 Adob​​e Photoshop 上，几十年来你可以很高兴地购买它的副本，直到 Adob​​e 意识到他们真的可以开始使用燃气做饭，只要他们支付持续费用即可。对于 Adob​​e 的订户来说，锁定是相当大的，因为访问他们现有的文件和文档库取决于继续付款。另一个例子发生在企业对企业的交易中。如果交易的一方强于另一方，他们通常会让实力较弱的一方动用其资金，而不是投资自己的资金。超市通常只以“寄售”方式储存商品——这意味着他们在商品售出前不支付任何费用（实际上，通常是售后 90 天），如果没有售出，他们有权退货。这将供应商的资金用于产品而不是乐购，因此乐购将它们放在杂货店相当于“不赢，不收费”。第三个例子是汽车。汽车是一种非常令人讨厌的产品，因为除非它们可靠，否则它们没有多大用处，并且如果您确实使它们可靠，它们往往会持续很长时间 - 大约 20 年。为了确保大多数人不会在两年之间换一辆新车，汽车制造商拥有庞大的消费金融部门，他们强烈鼓励人们通过称为“PCP”的极其混乱的月度订阅计划来购买汽车。 PCP 的要点是，您在 4-5 年内每月支付 250-500 英镑，最终您不拥有汽车——尽管伪金融对“存款”、“股权”和“购买选项”（我作为消费者的黄金法则是永远不要购买金融衍生品）。在他们 4 到 5 年的合同结束时，这些秘密租房者在经销商处被迷惑了，并被说服只需将他们的交易“滚动”到一辆新车上，每月付款几乎相同，同样，没有所有权。做这个伟大的繁文缛节比直接购买要贵得多。\n良好的商业意识是只做对自己合理的事情，而卓越的商业意识是让别人做不合理的事情。请随时给我发一封关于这篇文章的电子邮件，特别是如果你不同意它。当我通过电子邮件提醒或 RSS 提要撰写新内容时，您会收到通知。如果您喜欢这篇文章并因此对我感到慈善，请测试我的副项目 Quarchive，一个 FOSS 社交书签样式站点，并将您的反馈通过电子邮件发送给我！当我第一次对金融感兴趣时，我公司的会计师告诉我，他在面试时问会计师的一个问题是：“金融租赁与经营租赁之间有什么区别？”。我仍然认为这是一个非常尖锐的面试问题。很遗憾我自己的领域没有这么好的“哪条路向上？”面试问题。我认为公司财务知识的适用范围越大，年龄越大。例如，我喜欢这篇讨论它与计算机游戏开发相关性的文章。我喜欢迈克尔波特的战略和互联网。假设 2001 年以来任何关于互联网战略的文章都过时以至于无关紧要，这似乎是合理的，但我认为它仍然没有被完全采用。我也喜欢信息规则，它涵盖了一些相同的材料，但从更经济的角度来看。\n我还没有深入了解打印机墨盒业务的所有令人难以置信的 hijinks，但将在此处提供一些快速事实，截至 2008 年年中全部准确：许多喷墨制造商将所有颜色放在一个墨盒中，然后在出现任何情况时阻止它打印他们变低了。通常先变低，您必须购买全新的墨盒。喷墨制造商对于将墨滴管安装在墨盒上还是内置在打印机中是否更可靠这一问题没有达成共识。权衡是滴管可能因不活动而变干或因过度使用而磨损。那些认为它可能会干掉它的人先把它放在墨盒上，而那些认为你会磨损它的人先把它放在打印机机构上。如果每年的打印页数低于某个（实际上相当高）水平，您最好租用打印机。我工作的大卖场会以每页 5p 的速度进行彩色打印（单色打印更少），这确实是一笔划算的交易，但很少有客户使用它。他们都想拥有自己的打印机，因为有一次他们会在家里匆忙或深夜打印一张 8 色饼图。当然。普通用户在其彩色打印机的生命周期内只打印一张彩色页面。它通常是测试页。", "note_en": "My teenage weekend and summer job was to be shelf-stacker in a &#34;big box&#34; shop. I specialised in printers and printer cartridges. Customers sometimes wanted to hear my advice but once they received my recommendation of a £100 mono laser they never wanted to hear any more of it. Most of them bought the cheapest printer in the shop, a Lexmark model for less than £30, clearly a screaming deal. A huge fraction of them returned within the week to buy more ink, for the cartridge that was bundled with the printer came only a third full. When they saw that the refill cartridge for their new printer was nearly £40 it often really did become a screaming deal.\n  The very last thing they wanted to hear about at that point was &#34;that bleeding mono laser again&#34;. It  would have been more rational to switch printer but sunk cost fallacy exerts a strong pull and the majority did buy the refill cartridge. That little Lexmark cartridge did excellent repeat business.\n  The secret of printers is that you aren&#39;t buying the printer but instead entering into a subscription for  printer cartridges, which are often ruinous. But that truth is obscure and printer manufacturers work hard to ensure it remains so.\n    There are two ways to spend money on things. One is to buy something outright and then own it. Accountants call this  capital expenditure (&#34;capex&#34;) because you&#39;re spending your company&#39;s share capital. It then ends up on your balance sheet, meaning you count it as something of value that your company owns.\n  The other way is to rent. Accountants call this operational expenditure (&#34;opex&#34;) and instead of owning the thing forever you pay someone to give you access to it for a while. Despite the printer example, it is important to understand that this is not necessarily worse and can often be a better deal.\n  If, as a company, you owned your own offices you would sink your company&#39;s capital into commercial property in the town your company operates in. That would be some capital no longer available to your core business. If your core business has a return on equity of 20% then it&#39;s probably a better idea to use your capital there rather than putting it into commercial property which makes only about 7% a year (...in a good year).\n    Not all capex vs opex decisions are so rational, or so clear. One of the great conceits of modern business is to pretend that you are investing capital when you are really just cultivating a new stream of expenses. It&#39;s common for people to say that they are &#34;investing in [such and such]&#34; or &#34;building an asset&#34; when really they are just allocating more budget for spending (ie: opex).\n  What makes an asset, though? More terms from accountancy help. When an accountant values an asset in order to record it on the company balance sheet they mark its value at historical cost or net realisable value -  whichever is lower. Demonstrating &#34;net realisable value&#34; proves hard for many software projects. It means you have to find a buyer.\n  That isn&#39;t someone who will buy licences (ie rent access) but someone who would buy the thing outright and take it off you. Generating revenue does not make something an asset - though if you can sell licences (profitably, after costs!) that is a suggestion that there might be someone out there who would buy it or that it could be spun out as a separate business.\n  In practice is it pretty exceptional for any software project to have a real prospective buyer. That new, &#34;big data&#34; warehouse platform probably won&#39;t have any ready buyers - it&#39;s too specific to your business, with that analytics data you &#34;need&#34;. The new customer service system also won&#39;t - no one else in the hospitality industry is crying out for Kafka-based replayability of hotel complaints.\n  Where does the pressure to capitalise come from? Generally from managers. Most business units have some income and some expenses. If you start capitalising stuff those expenses disappear and, better yet, even start to appear on your balance sheet as an asset - however nebulous. Now your numbers look  really good. Accountants have heard this one before and that&#39;s why the rules are so strict.\n  A home truth of mine is that software projects in fact look more like a liability than an asset. Software, whether anyone is getting any benefit from it or not attracts a huge number of very annoying expenses: security vulnerability scrambles, bug fixes and database upgrades, and all of it just lines the pockets of wealthy sysadmins.\n    Like the printers of my teenage years, some things appear to be products but in fact are subscriptions. One sign of a product that is secretly a subscription is networking: if it connects to the internet, and thus to some server, it is likely to be a subscription rather than a product - even if the &#34;product&#34; itself claims otherwise.\n  My favourite example of this are the &#34;smart&#34; televisions that one day decided,   all on their own, to start showing their adverts: a new, recurring psychic cost for their subscribers, who had thought they were owners. Another is the tractor manufacturer John Deere, who work hard to ensure that you can no longer keep your tractor in good working order with just a socket set and an owner&#39;s manual but   also need a paid-up subscription to their online services: (else they will remotely disable crucial features).\n  To  paraphrase Leslie Lamport, a secret subscription is one in which the reliance on a server which you did not even know existed can render new expenses onto your continued use of the &#34;product&#34;.\n  Sometimes, though, &#34;opex&#34; is ok. There are times when you truly want a little bite out of something that is very big. You want, for a few hours or minutes, to have access to an enormous data centre: then hourly rental of cloud computers is the thing for you. All of the low-level sysadmin knowledge required to operate such a thing is encompassed in the service offered - and they are quite open about it being a service.\n    In any given scenario, a company (or person) will want to buy or rent something they need and they should decide carefully which to do. It&#39;s fair to say that the answer to that question is the total subject of corporate finance.\n  Companies rarely succeed based on good corporate finance alone but there is a kind of upside-down corporate finance that can really help: to make your suppliers and customers do bad corporate finance.\n  An example, very of-the-moment, is to turn what would otherwise be a single purchase of a software package into a long-term rental - a &#34;SaaS&#34;. This  happened with Adobe Photoshop, which was happily a thing you could buy a copy of for decades until Adobe realised that they could really start cooking with gas if they only made it available for an ongoing fee. For Adobe&#39;s subscribers, the lock-in is considerable as access to their existing bank of files and documents is contingent on continued payment.\n  Another example occurs in business-to-business deals. If one party to the deal is stronger than the other they will often make the weaker party apply their capital rather than invest their own. Supermarkets often only stock items on &#34;consignment&#34; - meaning they pay nothing until the items sell (in fact, usually 90 days after that) and have the right to return them if it doesn&#39;t sell. This ties up the supplier&#39;s capital in the products instead of Tesco&#39;s and so Tesco have them on the grocer&#39;s equivalent of &#34;no win, no fee&#34;.\n  A third example is cars. Cars are an extremely annoying product to sell because they are not much use unless they are reliable and if you do make them reliable they tend to last a long time - about 20 years. In order to ensure that most people do not go two decades between new cars, carmakers have enormous consumer finance departments and they strongly encourage people to get their cars via an exceptionally confusing monthly subscription plan called a  &#34;PCP&#34;. The gist of a PCP is that you pay £250-£500 per month for 4-5 years and at the end you do  not own the car - despite pseudo-financial mutterings to the contrary about &#34;deposits&#34;, &#34;equity&#34; and &#34;options to purchase&#34; (my golden rule as a consumer is never to buy a financial derivative). At the end of their 4-5 year contract these secret renters are bamboozled at the dealership and convinced to just &#34;roll over&#34; their deal onto a new car with much the same monthly payment and, again, no ownership. It costs considerably more to do this great rigmarole than just to buy outright.\n  Good business sense is to do only what is reasonable for yourself but great business sense is to make others do what is not.\n    Please do feel free to send me  an email about this article, especially if you disagreed with it.\n    You can get notified when I write something new  by email alert or  by RSS feed.\n  If you have enjoyed this article and as a result are feeling charitable towards me, please test out my side project,  Quarchive, a FOSS social bookmarking style site, and email me your feedback!\n    When I was first getting interested in finance my company&#39;s accountant told me that one of the questions he asked accountants at interview was: &#34;What&#39;s the difference between a financial versus an operating lease?&#34;. I still think this a very pretty sharp interview question. It&#39;s a shame my own field does not have such a good &#34;which way is up?&#34; interview question.\n  The older I get the more widely applicable I think corporate finance knowledge is. For example I enjoyed this article discussing it&#39;s   relevance to computer game development.\n  I love Michael Porter&#39;s  Strategy and the Internet. It would seem reasonable to assumed that any writing on strategy regarding the internet from 2001 would be so dated as to be irrelevant but I think it still hasn&#39;t been adopted fully. I also loved   Information Rules which covers some of the same material but from a more economic perspective.\n  I have not gotten onto all the incredible hijinks of the printer cartridge business but will put some quick facts here, all accurate as of mid-2008:\n  Many inkjet manufacturers put all the colours in a single cartridge and then block it from printing when  any of them get low. Usually one gets low first and you have to buy a whole new cartridge.\n  Inkjet manufacturers have no consensus on whether it&#39;s better for reliability to have the ink dropper on the cartridge or built in to the printer. The trade-off is that the dropper can dry out from inactivity or wear out from overuse. Those who think it&#39;ll probably dry it out first put it on the cartridge and those who think you&#39;ll wear it out first put it on the printer mechanism.\n  Below a certain (actually quite high) level of printed pages per year, you are better off renting access to printers. The big box shop I worked for would do colour printing for 5p a page (monochrome for much less) which  really was a screaming deal but very, very few customers used it. They all wanted to own their own printer for that one time they&#39;d print off an 8-colour pie chart at home, in a rush or late at night. Of course.\n  The average user prints exactly one colour page during the lifetime of their colour printer. It is usually the test page.", "posttime": "2021-08-03 02:53:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看起来,secretly,打印机", "title": "它看起来像一个产品，但实际上是一个订阅", "title_en": "It looks like a product but is secretly a subscription", "transed": 1, "url": "https://calpaterson.com/printers.html", "via": "", "real_tags": ["看起来", "secretly", "打印机"]}, {"category": "", "categoryclass": "", "imagename": "a7ee73fe813cfdedea796ccc69e10e19.png", "infoid": 1071247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让消费者更好地访问和控制他们的财务数据是金融科技的一个主要趋势。一整套挑战者现在致力于“开放银行”的使命，包括 Moneyhub、Yolt 和 Tink（最近被 Visa 以 18 亿欧元收购）。这些公司允许用户“开放”并与其他方共享他们的银行数据，向他们的客户收取特权费用。但迄今为止，开放银行业务的采用速度缓慢。 2021 年 1 月，英国的活跃用户达到 300 万，远低于之前预测的 2022 年的 3300 万。这再次引发了关于初创企业是否应该通过开放银行服务赚钱的争论。对话还扩展到“开放金融”——将数据共享功能扩展到银行之外，包括养老基金、储蓄账户和其他资产。但与开放银行不同，目前对开放金融数据的访问不受监管，引发了有关消费者保护的进一步问题。什么将导致开放银行业务的大规模采用？免费开放银行服务提供商的兴起会破坏这个领域吗？ Plaid、TrueLayer 和 Tink 等金融科技公司已经建立了自己的业务，以提供对受监管银行数据的收费访问，为 Freetrade、Plum 和 Emma 等大量金融应用程序提供服务。\n在当前的银行监管下，原始数据必须通过官方应用程序编程接口（或 API）免费提供给消费者。因此，应用程序代表其用户收取费用。但并非所有人都认为原始银行数据应该以第三方为代价。早在 12 月，位于拉脱维亚的开放银行平台 Nordigen 就开始通过免费的 API 向第三方提供这些原始数据。 “我们的直觉是有些事情不对劲。开放银行推出一年后，该技术的大部分用户都是大企业。 Nordigen 联合创始人兼首席执行官 Rolands Mester 表示，本应进行金融科技革命，但进展非常缓慢。 “我们决定使数据访问民主化。我们聚合与其他人相同的 API，但我们免费提供连接。有了更多的智者和克拉纳斯，世界会变得更好，但现任者并不热衷于创新。他们对现状很满意，”他补充道。 Nordigen 的商业模式是追加销售数据分析解决方案，同时免费提供原始银行和开放金融数据。 “有了更多的智者和克拉纳斯，世界会变得更好，但现任者并不热衷于创新。他们对现状很满意。”作为一个在游戏中有皮肤的人，您可能会认为梅斯特斯会全力支持开放金融。但梅斯特斯担心数据安全，称其有“阴暗面”。\n“法规规定你应该使用银行自己的 API，但如果它出现故障，你可以依靠屏幕抓取（第三方公司通过代表机构客户使用他们的密码和用户名登录数字门户来访问财务数据），”他告诉筛选。他解释说，由于目前没有密码共享技术就无法实现开放式金融，因此它更依赖于屏幕抓取。 “我们想问——我们确定要这样做吗？这是我们想要的开放银行和金融吗？也许我们需要放慢速度，更好地执行当前的监管，并首先建立更多的监管，”梅斯特斯说。尽管许多人热衷于指出技术的发展步伐使监管变得困难，但 Moneyhub 的首席技术官 Dave Tonge 表示，监管不是这里的问题，而是数据保护的问题。 “开放银行和开放金融的主要问题是数据保护，这受到 GDPR 和英国 2018 年数据保护法的保护。我们对更多监管持开放态度，但这主要是为了迫使养老金公司等数据提供商让客户访问他们的数据。自己的数据，”Tonge 说，像梅斯特斯这样的人认为不应该付出代价。目前，消费者信任和数据安全仍然是开放银行业务增长的障碍——进而是开放金融。 2019 年德勤在美国的一项调查发现，69% 的消费者担心身份盗用，60% 的消费者担心在开放银行业务中滥用数据。\n借贷软件公司 HES Fintech 的联合创始人 Dmitry Dolgorukov 认为，开放金融在最好的情况下为消费者提供了更多的透明度和控制权，但用户教育是关键。 “屏幕抓取使用户很容易以他们不知道的方式共享他们的数据，”他同意道。 “我相信客户许可的数据是出路。 API 平台可以作为与第三方应用程序安全共享数据的单一安全网关，并有助于限制大量有风险的连接。”一如既往，这是一个进化的过程。需要更多的监管来提高数据安全性，但对于多尔戈鲁科夫来说，开放金融的利好大于弊。 “作为一个技术乐观主义者，我相信开放金融中的数据共享将提高便利性和个性化，逐步控制缺点和威胁。更好的金融产品、更高的客户保留率和新市场的开发都值得付出努力和主动。”", "note_en": "Giving consumers better access to, and control of, their financial data is a major trend in fintech.\n  A whole set of challengers are now dedicated to the ‘open banking’ mission, including Moneyhub, Yolt and Tink (which was   recently bought by Visa for €1.8bn ). These companies allow users to ‘open up’ and  share their bank data with other parties, charging their clients for the privilege.\n  But open banking has so far seen slow adoption. Active users in the UK reached   3m  in January 2021, well behind previous predictions of   33m by 2022.\n  This has reignited a debate about whether startups should be making money from open banking services.\n  The conversation has also extended to  ‘open finance’ — which extends data-sharing capabilities beyond just banks to include pension funds, saving accounts and other assets. But unlike open banking, access to open finance data is currently unregulated, prompting further questions about consumer protection.\n  What will lead to the mass adoption of open banking? And will the rise of  free open banking providers disrupt the space?\n     Fintechs like Plaid, TrueLayer and Tink have founded their businesses on providing access to regulated banking data for a fee, servicing a vast array of finance apps like Freetrade, Plum and Emma.\n  Under current banking regulation, raw data must be provided for free to consumers via an official application programming interface (or API). As a result, the apps pick up the cost on behalf of their users.\n  But not everyone believes raw bank data should come at a price to third parties. Back in December, Latvia-based open banking platform Nordigen began offering this  raw data  to third parties  via a free API.\n  “Our instinct was that something was off. A year after the launch of open banking, most of the users of the technology were big enterprises. There was supposed to be a fintech revolution but it was very slow,” says Nordigen cofounder and CEO Rolands Mester.\n  “We decided to democratise access to the data. We aggregate the same APIs as everyone else but we offer the connections for free. The world would be better with more Wises and Klarnas but the incumbent aren’t keen to innovate. They’re happy with the status quo,” he adds.\n  Nordigen’s business model is to upsell data analysis solutions, while providing the raw banking and open finance data for free.\n  “The world would be better with more Wises and Klarnas but the incumbent aren’t keen to innovate. They’re happy with the status quo.”\n  As someone with skin in the game, you might expect Mesters would be all for open finance. But Mesters has concerns about data security, saying it has a ‘dark side’.\n  “Regulation says you should use a bank’s own API but if it’s down, you can fall back on screen scraping (where third party companies access financial data by logging into digital portals on behalf of an institution’s customers using their passwords and usernames),” he tells Sifted.\n  He explains that because open finance isn’t currently possible without password-sharing technologies, it relies more heavily on screen scraping.\n  “We want to ask — are we sure we want to do this? Is this the open banking and finance we want? Maybe we need to take things a bit slower, enforce current regulation better and build in more regulation first,” says Mesters.\n  While many are keen to point out the pace of technology makes regulation difficult, Dave Tonge, chief technology officer at Moneyhub, says regulation isn’t the problem here but rather data protection.\n  “The main issue with open banking and open finance is data protection, which is covered by GDPR and the UK’s Data Protection Act 2018. We are open to more regulation but this is mainly to force data providers like pension companies to give customers access to their own data,” Tonge says, which individuals like Mesters argue shouldn’t come at a price.\n    For now, consumer trust and data safety remain barriers to open banking’s growth — and by extension, open finance.\n  A   2019 Deloitte survey  in the US found 69% of consumers had concerns over identity theft and 60% were worried about misuse of data when it came to open banking.\n  Dmitry Dolgorukov, cofounder at lending software company HES Fintech, believes that at its best, open finance provides consumers with more transparency and control, but user education is key.\n  “Screen scraping leaves users vulnerable to having their data shared in ways they’re unaware of,” he agrees. “I believe customer-permissioned data is the way out. API platforms can serve as a single secure gateway for secure data sharing with third-party apps and help limit an abundance of risky connections.”\n  As ever, it’s a process of evolution. More regulation is required to increase data security but for Dolgorukov, open finance’s positives outweigh its negatives.\n  “As a tech optimist, I believe that data sharing in open finance is going to improve convenience and personalisation, with drawbacks and threats taken under control step-by-step. Better financial products, higher customer retention and the development of new markets are worth the effort and initiative.”", "posttime": "2021-08-03 02:53:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开放,battle", "title": "围绕开放银行展开的静悄悄的战斗", "title_en": "The quiet battle raging around open banking", "transed": 1, "url": "https://sifted.eu/articles/open-banking-finance-battle/", "via": "", "real_tags": ["开放", "battle"]}, {"category": "", "categoryclass": "", "imagename": "ffeba8118efca737c03645b986c6292e.png", "infoid": 1071246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这几乎可以应用于您阅读的所有内容，因此我将在此处以一篇文章为例。首先，您查看文章的标题，如果它很吸引人，您就打开它。然后滚动文章并阅读小标题以了解文章的全部内容。如果它看起来很有趣，您可以滚动回顶部并阅读介绍的前 30-50 个单词，然后向下滚动到第一个小标题。阅读下面的几句话后，您继续对每个小标题做同样的事情，直到得出结论并获得文章的整体观点/想法。当我们没有时间深入阅读材料或迫切需要信息时，我们会使用这种阅读方式。第二种子类型是您简单地阅读。你逐页翻阅，阅读每一个单词，但不会停下来。不管你是否理解它，你只是继续前进。你不会思考作者提出的论点，也不会试图在空白处写东西。这就是人们在阅读报纸时通常会做的事情，吸收他们所掌握的所有信息。在讨论他们所读到的内容时，他们经常不加质疑地反驳别人的意见。但这种阅读也用于放松，例如，当您阅读布里奇特·琼斯的日记或暮光之城时。因此，如果您只想了解信息和放松，则主要使用这种阅读级别。", "note_en": "This can be applied to almost everything you read so I will take an example of an article here.\n First, you look at the title of the article and if it’s appealing, you open it.  Then you scroll through the article and read the sub-heads to see what the article is all about. If it seems interesting, you scroll back to the top and read the first 30-50 words of the intro and then scroll down to the first subhead. After reading a few sentences under it, you proceed to do the same for each subhead till you reach the conclusion and get the overall point/idea of the article.\n We use this kind of reading when we lack the time to read the material in-depth or when we need information urgently.\n  The second sub-type is when you simply read. You go from page to page, reading every single word but not stopping at any. It doesn’t matter if you understand it or not, you simply move along. You don’t ponder the arguments presented by the author or try to write in the margins.\n  This is what people usually do when they read newspapers, taking in every information at their disposal. When discussing what they’ve read, they often regurgitate someone else’s opinion without questioning it.\n But this kind of reading is also used for relaxing, for example, when you are reading   Bridget Jones’s Diary or   Twilight. So if you want just information and relaxation, you mostly use this kind of reading level.", "posttime": "2021-08-03 02:53:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书籍,阅读,levels", "title": "阅读层次：不同书籍的不同阅读方式", "title_en": "Reading Levels: Different Ways to Read Different Books", "transed": 1, "url": "https://www.thecuriousreader.in/features/reading-levels/", "via": "", "real_tags": ["书籍", "阅读", "levels"]}, {"category": "", "categoryclass": "", "imagename": "03ef544c0dfc3b8a46217d536709d63a.jpg", "infoid": 1071245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌发布了其即将推出的 Pixel 6 旗舰产品的官方“先睹为快”。包含在推特风暴和预告网站中，我们终于获得了官方图片并确认了许多谣言。首先，Pixel 6 最令人兴奋的方面之一是包含谷歌“Whitechapel”SoC。这是谷歌首款内部 SoC，将作为为手机供电的主要芯片。它代表谷歌放弃高通作为 SoC 制造商，并对其手机硬件采取更像苹果的垂直方法。该芯片的正式名称为“Google Tensor”，该公司将其描述为“谷歌设计的全新芯片，专为 Pixel 定制”。 “Tensor 的亮点在于它可以直接在 #Pixel6 上处理谷歌最强大的 AI 和 ML 模型。你会看到相机、语音识别和许多其他 Pixel 6 功能的转变体验，”谷歌在今天的帖子中说. “语音识别是另一项基础技术，您将在 #Pixel6 中看到巨大的改进。Google Tensor 使我们能够在以下方面取得巨大飞跃：语音命令、翻译、字幕和听写。”帖子中没有提到的另一个假定好处是，谷歌 Tensor 芯片应该允许谷歌支持 Pixel 6 超过三年。生成 Android 更新时，第一步是从 SoC 供应商处获取更新的硬件支持。大多数商业运营只支持 SoC 制造商参与的设备。对于高通（一家芯片供应商）来说，支持设备更长时间意味着销售更少的芯片，因此该公司不希望将苹果漫长的 iPhone 5 到 6 年支持窗口与具有竞争力的套餐相匹配。不过，随着高通公司的退出，Pixel 6 的支持时间表将完全取决于谷歌。正式地，Pixel 6 将有两种尺寸，“Pixel 6”和“Pixel 6 Pro”。两者都有三种不同的颜色，如果您正在查看图片，Google 表示“Pro”型号是相机块上方空间最大的型号。 Pro 有三个摄像头，包括一个 4 倍长焦，而基本型号有两个摄像头（它跳过了变焦镜头）。帖子中也没有提到，这应该是谷歌自 Pixel 2 以来的第一次摄像头芯片升级。 Pixel 2、3、4 和 5 都使用相同的摄像头芯片，只有更新的软件提供了额外的功能。 Google 商店上有一个 Pixel 6 预告页面，您可以在其中注册以获取更多信息。谷歌表示这款手机将在秋季推出 Android 12 和可爱的新变色用户界面。", "note_en": "Google has posted an official &#34;sneak peek&#34; of its upcoming Pixel 6 flagship. Contained in a  tweet storm and a  teaser website, we&#39;re finally getting official pictures and confirmation for many of the rumors that have been out there.\n First up, one of the most exciting aspects of the Pixel 6 is the inclusion of the Google &#34; Whitechapel&#34; SoC. This is Google&#39;s first in-house SoC that will serve as the main chip powering the phone. It represents Google dumping Qualcomm as the SoC manufacturer and taking a more Apple-like vertical approach to its phone hardware. The chip is officially called &#34;Google  Tensor,&#34; and it&#39;s described by the company as &#34;the brand new chip designed by Google, custom-made for Pixel.&#34;\n  &#34;The highlight of Tensor is that it can process Google’s most powerful AI and ML models directly on #Pixel6. You’ll see a transformed experience for the camera, speech recognition, and many other Pixel 6 features,&#34; Google said in its posts today. &#34;Speech recognition is another foundational technology where you will see a huge improvement in #Pixel6. Google Tensor allows us to make big leaps in: Voice commands, Translation, Captioning, &amp; Dictation.&#34; Another presumed benefit not mentioned in the thread is that the Google Tensor chip should allow Google to support the Pixel 6 for longer than three years. When producing an Android update, the first step is getting updated hardware support from the SoC vendor. Most commercial operations only support a device for as long as the SoC manufacturer is on board. For Qualcomm (a chip vendor), supporting a device for longer means selling fewer chips, so the company  doesn&#39;t want to match Apple&#39;s lengthy iPhone five- to six-year support window with a competitive package. With Qualcomm out of the way, though, the Pixel 6 support timeline will be entirely up to Google.\n    Officially, the Pixel 6 will come in two sizes, the &#34;Pixel 6&#34; and &#34;Pixel 6 Pro.&#34; Both will come in three different colors, and if you&#39;re looking at the pictures, Google says the &#34;Pro&#34; model is the one with the most space above the camera block. The Pro has three cameras, including a 4x telephoto, while the base model has two cameras (it skips out on the zoom lens). Also not mentioned in the thread, this should be Google&#39;s first camera chip upgrade since the Pixel 2. The Pixel 2, 3, 4, and 5 all use the same camera chip, with only newer software offering additional features.\n There&#39;s a Pixel 6 teaser page up on the Google Store where you can sign up for more info. Google says the phone will ship in the fall with Android 12 and the sweet new  color-changing UI.", "posttime": "2021-08-03 02:09:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "pixel,谷歌", "title": "这是第一批官方 Pixel 6 图片和信息", "title_en": "Here are the first official Pixel 6 pictures and info", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/08/google-previews-pixel-6-with-the-companys-tensor-soc-revamped-camera/", "via": "", "real_tags": ["pixel", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "3943d5186e68504641b8b3469457a5b1.jpg", "infoid": 1071244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时很难客观地写出 SpaceX 取得进展的速度。我们在公司位于德克萨斯州南部的 Starbase 站点上看到的进步是前所未有的。周日，SpaceX 完成了它所谓的“助推器 4”的堆放，这是它的第一个超重型火箭助推器，预计将起飞。这是一枚巨大的单核火箭，高约70米，直径9米。它的推力大约是将美国宇航局宇航员送上月球的土星五号火箭的两倍。然后，一夜之间，发生了一件了不起的事情。 SpaceX 在博卡奇卡海滩附近建造设施的技术人员和工程师将 29 个猛禽火箭发动机安装到火箭上。二十九个引擎。每个都有复杂的管道和连接。这是 Super Heavy 用于初始飞行测试的发动机数量，尽管最终配置可能有 32 台发动机。我真的不知道该写些什么或说些什么，因为通常在火箭业务中，安装一个引擎需要几天时间。在组装区进行一些初步检查后，Booster 4 将滚到几公里外的发射场。这可能最早在周二发生。在此之后，可能会进行压力测试和一系列静态防火测试。有了这么多有价值的猛禽引擎，我们可能会期望 SpaceX 对这款车辆的测试计划相当谨慎。 SpaceX 也几乎完成了“Ship 20”，这是最新的 Starship 上层原型，将放置在 Booster 4 之上，用于 Starship 系统的全栈发射。尽管 SpaceX 在硬件方面取得了实质性进展，但该公司在监管方面的动向仍然不明朗。似乎星际飞船、其超重型助推器和南德克萨斯轨道发射综合体的快速组装将在 FAA 和 SpaceX 之间掀起另一场高风险的对决。该公司将准备飞行，但尚不清楚美国联邦航空管理局何时完成对 Starbase 位置的环境审查并批准从该站点进行轨道发射。\n几个月来，SpaceX 一直在与 FAA 合作进行环境评估。在此评估的“草案”发布后，将有至少 30 天的公众评论期。随后将采取其他步骤，包括 FAA 确定 SpaceX 提出的环境缓解措施是否足够，或者是否需要更多工作。有关此过程的更多信息，请访问 FAA 网站。鉴于所有这些，SpaceX 很难在今年秋天之前（如果不是更晚）获得必要的监管批准，以在轨道试飞中发射 Starship。即便如此，据报道，SpaceX 仍在德克萨斯州南部部署人员，从其位于加利福尼亚的总部和其他地方引入数百名员工，以完成 Booster 4 和发射场设施的组装。如果监管部门的批准几个月都没有到来，为什么要这样做呢？诱使 FAA 在监管过程中更快地采取行动，这似乎是经过深思熟虑的努力。迄今为止，世界上最大、最强大的火箭，坐在发射台上等待文书工作，其光学性能并不好。由于 NASA 和美国国防部现在都对 Starship 的成功有着既得利益，SpaceX 可能会在美国政府的其他地方找到盟友。", "note_en": "Sometimes it is difficult to write objectively about the rate at which SpaceX makes progress. The advancements we&#39;re seeing at the company&#39;s Starbase site in South Texas are unprecedented.\n  On Sunday, SpaceX finished stacking what it is calling &#34;Booster 4,&#34; the first of its Super Heavy rocket boosters expected to take flight. This is a massive, single-core rocket that is approximately 70 meters tall, with a diameter of 9 meters. It has a thrust approximately double that of the Saturn V rocket that launched NASA astronauts to the Moon.\n  Then, overnight, something remarkable happened. Technicians and engineers at the SpaceX build facility near Boca Chica Beach attached 29 Raptor rocket engines to the rocket.  Twenty-nine engines. Each with intricate plumbing lines and connections. This is the number of engines that Super Heavy will fly with for initial flight tests, although the final configuration is likely to have 32 engines.\n I&#39;m not really sure what to write or say about all this, because typically in the rocket business it takes a few days to install a single engine.\n After some initial checkouts in the assembly area, Booster 4 will roll to the launch site a couple of kilometers down the road. This may happen as early as Tuesday. After this, there likely will be pressure tests and a series of static fire tests. With this many valuable Raptor engines on the line, we can probably expect SpaceX to be fairly cautious with the test program for this vehicle.\n    SpaceX has also nearly completed &#34;Ship 20,&#34; the latest Starship upper-stage prototype that will be placed on top of Booster 4 for a full-stack launch of the Starship system.\n While SpaceX has made substantial progress on hardware, the company&#39;s movement on the regulatory side of things remains murky. It appears as though the rapid assembly of Starship, its Super Heavy booster, and the orbital launch complex in South Texas will set up yet another high-stakes showdown between the FAA and SpaceX. The company is going to be ready to fly, but there&#39;s no clarity on when the Federal Aviation Administration will complete its environmental review of the Starbase location and approve orbital launches from the site.\n For months, SpaceX has been working with the FAA on an environmental assessment. After a &#34;draft&#34; of this assessment is published, there will be a minimum of a 30-day period for public comments. This will be followed by other steps, including a determination by the FAA on whether SpaceX&#39;s proposed environmental mitigations will be enough, or if more work is required. More information about this process is available on the  FAA&#39;s website.\n Given all of that, it is difficult to see SpaceX receiving the required regulatory approvals to launch Starship on an orbital test flight before this fall, if not later.\n  Even so, SpaceX has reportedly been staffing up in South Texas, bringing hundreds of employees in from its California-based headquarters and elsewhere in order to complete assembly of Booster 4 and the launch site facilities. Why would it be doing this if regulatory approval is not coming for months?\n It seems like a calculated effort to induce the FAA to move more quickly with the regulatory process. The optics of a completed rocket, by far the largest and most powerful in the world, sitting on a launch pad waiting for paperwork is not great. And with both  NASA and the  US Department of Defense now having a vested interest in Starship&#39;s success, SpaceX may find allies elsewhere in the US government.", "posttime": "2021-08-03 02:09:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,spacex,engines", "title": "SpaceX昨晚在超重型火箭上安装了29个猛禽引擎", "title_en": "SpaceX installed 29 Raptor engines on a Super Heavy rocket last night", "transed": 1, "url": "https://arstechnica.com/science/2021/08/spacex-installed-29-raptor-engines-on-a-super-heavy-rocket-last-night/", "via": "", "real_tags": ["火箭", "spacex", "engines"]}, {"category": "", "categoryclass": "", "imagename": "9abd0ef7fee8ecd83733ed2bed899ba4.jpg", "infoid": 1071243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在大流行之前，这带来了可访问性问题——例如，当某些任务只能通过步行一定距离才能完成时，它疏远了身体状况和残疾的用户，使他们无法轻松地在附近散步。另外，对于坐在轮椅上的玩家，可能无法进入某些 PokéStops 和健身房。有必要与这些现实世界的地标互动以充分发挥游戏的作用。当世界大部分地区在 2020 年 3 月进入封锁状态时，Pokémon Go 将玩家可与 PokéStop 或健身房互动的半径扩大了一倍，将半径从 40 米扩大到 80 米。因此，您现在可以远离地标，但仍能收获回报。这让用户可以更轻松地在家玩游戏，或者在社交疏远的同时在户外玩游戏——但也让游戏更容易上手。此外，对于一款仍然因引发交通事故而声名狼藉的游戏，增加的半径帮助行人玩家进入地标，而不会肆无忌惮地横穿马路（公平地说，用户在增强现实游戏中做出明智的决定是——但是，Niantic 在这里也有责任）。而对于恰好位于突袭战斗黄金地段的企业，需要玩家亲自聚集在道馆半径内以击败稀有怪物，这意味着神奇宝贝玩家可以在玩游戏时与店面保持尊重的距离（在大流行后期，远程加入突袭战斗成为可能——这个功能将保留在游戏中，可能是因为它被证明是有利可图的）。这些流行病激励措施总是被定义为临时奖金，但玩家接受了这些变化——在 2020 年，Pokémon GO 是有史以来收入最高的一年。现在，在美国和新西兰，增加的地标半径已被取消“作为测试”。该公司在一篇博客文章中写道：“当我们再次回到外部世界时，这些变化旨在恢复 Pokémon GO 对现实世界中运动和探索的关注。” “这些变化将被缓慢而谨慎地引入，让探索周围的世界变得更加令人兴奋。”一项新奖励为用户首次访问新的 PokéStop（或者，在现实世界中，访问一个新地方）提供 10 倍 XP。但随着 Delta 变体在美国的传播，玩家发现这些变化令人沮丧和误导。为什么要回滚那些使游戏更易于访问同时还能为公司带来更多收益的功能呢？双倍距离的消除简直就是对#PokemonGO 社区的一记耳光。我会现实地说，如果没有尽快做出改变，我将退出 GO。\n我拒绝报道一个没有其最佳利益的玩家基础的游戏。为 Niantic 创建赞助内容的 Pokémon Go YouTuber Reversal 写道，如果不尽快进行更改，他将退出游戏。其他玩家发起了一份有超过 130,000 个签名的请愿书，以增加 PokéStop 和 Gym 的互动距离。 ZoëTwoDots 和 The Trainer Club 等著名的 Pokémon Go 内容创作者在他们今天上传的视频中提到了对该游戏的潜在抵制，理由是 Niantic 在他们宣布 6 月份大流行奖金即将结束后拒绝听取社区的担忧。与 Niantic 合作过的 ZoëTwoDots 告诉她的 212,000 名订阅者：“如果我们对此产生共鸣，我会坚决抵制与所有人一起玩的游戏。” “我个人知道，在他们公开解决之前，我不会在游戏中花钱。”我对 Pokéstop 半径的看法没有改变。由于（持续的）大流行，这是一种明显的生活质量变化，只有完全实现。它为残疾玩家提供了可访问性，为所有玩家提供了安全，并且永远不会影响我们的探索乐趣。 https://t.co/DK1VWkw0ga 随着游戏庆祝其五周年，它现在面临的冲突不是玩家希望游戏更容易。相反，这代表 Niantic 未能倾听其用户群的意见，优先考虑可访问性，并在美国 COVID-19 病例再次上升时激励用户呆在家里", "note_en": "Before the pandemic, this posed an accessibility issue — when certain tasks could only be completed by walking a certain distance, for example, it alienated users with physical conditions and disabilities that prevent them from easily taking a walk around the neighborhood. Plus, for players in wheelchairs, it might be impossible to access certain PokéStops and Gyms. It’s necessary to interact with these  real-world landmarks to play the game to its fullest.\n  When much of the world entered lockdown March 2020, Pokémon Go doubled the size of the radius that players can be within to interact with a PokéStop or Gym, widening the radius from 40 meters to 80 meters. So, you could now be further away from a landmark but still reap its rewards. This made it easier for users to  play from home, or play outside while social distancing — but it also made the game much more accessible. Plus, for a game that still gets a bad rep for causing  traffic accidents, the increased radius helped pedestrian players access landmarks without brazenly jay-walking across the street (to be fair, it’s on users to make smart decisions while gaming in augmented reality — but, Niantic has responsibility here too). And for businesses that happened to be located in a prime location for raid battles, which require players to gather in-person within a Gym’s radius to defeat rare monsters, this meant that Pokémon players could maintain a respectful distance from store fronts while playing the game (later in the pandemic, it became possible to join raid battles remotely — this feature will remain in the game, probably because it proved profitable).\n These pandemic incentives were always framed as  temporary bonuses, but players embraced the changes — in 2020, Pokémon GO had  its highest-earning year yet. Now, the increased landmark radius has been removed “ as a test” in the U.S. and New Zealand.\n “As we return to the outside world again, these changes are aimed at restoring the focus of Pokémon GO on movement and exploration in the real world,” the company wrote in  a blog post. “These changes will be introduced slowly and carefully to make it more exciting to explore the world around you.”\n One new incentive gives users 10x XP for visiting a new PokéStop for the first time (or, in real-world terms, visiting a new place). But as the  Delta variant spreads in the U.S., players find these changes to be frustrating and misguided. Why roll back features that made the game more accessible while also netting the company more money?\n The removal of double distance is nothing short of a slap in the face towards the  #PokemonGO Community.\n I’ll realistic and say I that I’ll quit GO if changes aren’t being made ASAP.\n I REFUSE to cover a game that doesn’t have it’s player base in its best interest.\n The Pokémon Go YouTuber, Reversal, who has created sponsored content for Niantic, wrote that he will quit the game if changes aren’t being made ASAP. Other players launched  a petition with over 130,000 signatures to keep increased PokéStop and Gym interaction distance. Prominent Pokémon Go content creators like  ZoëTwoDots and  The Trainer Club have referenced a potential boycott of the game in videos they uploaded today, citing Niantic’s refusal to listen to community concerns after they announced the  impending end of pandemic bonuses in June.\n “I’m more than down to boycott the game with everyone if we’re vibing that,”  ZoëTwoDots, who has also partnered with Niantic, told her 212,000 subscribers. “I know for myself personally, I’m just straight up not spending money in the game going forward until they address it publicly.”\n My opinion on the Pokéstop radius hasn&#39;t changed. It was a clear quality of life change that was only fully realised because of a (ongoing) pandemic. It has provided accessibility to disabled players, safety to all players, and NEVER affected our enjoyment of exploration.  https://t.co/DK1VWkw0ga\n As the game celebrates its five year anniversary, the conflict it now faces isn’t about players wishing for the game to be easier. Rather, this represents a failure by Niantic to listen to its user base, prioritize accessibility, and incentivize users to stay home as COVID-19 cases  rise again in the U.S.", "posttime": "2021-08-03 02:08:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "covid,mon,玩家", "title": "在 Niantic 取消 COVID 安全措施后，Pokémon GO 影响者威胁要抵制", "title_en": "\n\t\t\t\tPokémon GO influencers threaten a boycott after Niantic removes COVID safety measures\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/pokemon-go-influencers-threaten-a-boycott-after-niantic-removes-covid-safety-measures/", "via": "", "real_tags": ["covid", "mon", "玩家"]}, {"category": "", "categoryclass": "", "imagename": "b831694f103da7ac15b6d3673056433e.jpg", "infoid": 1071242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "底座 6 将采用哑光铝饰面和 6.4 英寸显示屏，而 Pro 则采用更闪亮的抛光铝饰面和 6.7 英寸显示屏。 Pixel 6 有两个摄像头（广角和超广角），而 6 Pro 增加了一个长焦变焦镜头凹凸现在已经演变成“相机栏”，谷歌的 Rick Osterloh 指出，更好的传感器和镜头不适合更小的包装。这些将是第一款运行 Tensor 的手机，Tensor 是谷歌首款完全定制的片上系统。之前的 Pixel 已经在高通的 Snapdragon 平台上运行。谷歌 CEO Sundar Pichai 表示，他们已经在芯片上工作了 4 年多。在宣布这些设备的博客文章中，Osterloh 建议这里的重点是制造一种针对设备上 AI 和 ML 进行调整的芯片。许多细节，包括定价和大部分规格表（CPU、RAM 等）目前仍然是个谜——尽管到目前为止，早期的泄漏似乎已经发现。", "note_en": "The base 6 will have a matte aluminum finish  with a 6.4″ display, while the Pro has a shinier polished aluminum finish with a 6.7″.\n Pixel 6 has two cameras (wide and ultra wide), while the 6 Pro adds a telephoto zoom lens\n If you were hoping the increasingly common “camera bump” trend was on the way out… not quite. The bump has now evolved into the “camera bar”, with Google’s Rick Osterloh noting that better sensors and lenses just won’t fit in a smaller package.\n These will be the first phones to run Tensor, Google’s first entirely custom system-on-a-chip. Previous Pixels have run on Qualcomm’s Snapdragon platform. Google CEO Sundar Pichai says  they’ve been working on the chip for 4+ years. In a blog post  announcing the devices, Osterloh suggests that the focus here is making a chip tuned for on-device AI and ML.\n  Lots of details, including pricing and much of the spec sheet (CPU, RAM, etc.) are still a mystery for now — though  earlier leaks seem to be spot on, so far.", "posttime": "2021-08-03 02:08:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,展示,world", "title": "谷歌首次正式向全世界展示了 Pixel 6", "title_en": "\n\t\t\t\tGoogle gives the world its first official glimpse of the Pixel 6\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/google-gives-the-world-its-first-glimpse-of-the-pixel-6/", "via": "", "real_tags": ["谷歌", "google", "展示", "world"]}, {"category": "", "categoryclass": "", "imagename": "9425617373b40fffc20c87ac2becfa32.jpg", "infoid": 1071241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不在奥迪看来。 2022 Audi e-tron GT 和 RS e-tron GT 是一对全电动豪华旅行车，看起来不像 2060 年的东西。它们看起来就像时尚的汽油动力 GT，但在皮肤之下，有比乍一看的设计所暗示的要强大得多，技术流行和华丽。 2022 款奥迪 e-tron GT 和 RS e-tron GT 拥有低悬的车顶线、宽轮距和长轴距，就像过去的那些豪华旅行车一样，并增加了一些设计上的华丽，使其与奥迪微妙的、奢华的美学。虽然 e-tron GT 和 RS e-tron GT 都是与奥迪 R8 一起生产的（它的车顶线低于 R8）并借鉴了这一标志性设计的一些东西，但这些电动大旅行车是一对野兽自己的。基于与保时捷 Taycan 相同的 800 伏架构，e-tron GT 通过一对为前后轮提供动力的双永磁电机产生 469 马力的总功率（最高可达 522 马力）。 RS e-tron GT 可以从这些相同的电机中产生 590（637 马力，超增压）马力，奥迪表示它可以在 3.1 秒内完成 0-60。这两款车都有能力、自信和快速，不会在山路或长长的高速公路上停留。加速几乎是无缝的，就像大多数电动汽车一样。多亏了奥迪带有扭矩矢量系统的电动 quattro 全轮驱动系统，即使车轮开始发出尖叫声，两辆车也能稳稳当当地进行分类。该系统允许向在急转弯、突然变道或在湿滑条件下行驶时打滑的车轮发送可变数量的动力。我驾驶的车辆配备了夏季轮胎，我必须在洛杉矶市中心东北约 50 英里的 Agua Dulce Airpark 终点站突然变道的封闭回转路线上测试一下。我连续 3 次让 RS e-tron GT 穿过锥体，以感受系统，每次汽车都感到安全、稳定和受控。 e-tron GT 和 RS e-tron GT 都可以选装后轮转向。在时速 30 英里以下，后轮可以与前轮相反的方向最多转动 2.8 度，以帮助使 e-tron GT 和 RS e-tron GT 的转弯半径更小。超过 30 英里/小时，后轮转向与前轮相同的方向。该系统与保时捷 Taycan 中的系统相似（旋转角度较少）。\n虽然我没有在机场平稳的停机坪上尝试在任何一辆车上尝试过增压，但我确实使用 RS e-tron GT 中的发射控制运行了一系列背靠背的 0 到 100 英里/小时的加速。在那里的一群记者中，我排在第二位，在 3.24 秒内完成了 0-60，在 7.29 秒内完成了 0-100。在 102 度的高温下，在冷轮胎上，这些数字令人印象深刻。在跑道尽头，我看到速度接近 120 英里/小时，比电子限制的 155 英里/小时（e-tron GT 中的 152 英里/小时）低 32 英里/小时，然后才刹车。经过 3 次背靠背运行后，充满电的 RS e-tron GT 仅损失了 20 英里的续航里程。 RS e-tron GT 的 EPA 估计续航里程为 232 英里，而 e-tron GT 估计续航里程为 239 英里。这些估计的 EPA 范围是低挂 93 kWh 电池组（两辆车相同）的结果，奥迪表示可以在 23 分钟内使用 270 伏充电器（直流快速充电）充电 80%。 e-tron GT 的起价为 99,900 美元，RS e-tron GT 的起价为 139,900 美元（均不包括 1,045 美元的目的地费用）。这个价格标签确实带来了一次性有限的好处。奥迪与 Electrify America 合作，提供三年免费、无限制的公共充电（没有时间限制）。他们还提供通过 Qmerit 设置的家庭充电站。 e-tron GT 和 RS e-tron GT 均配备标准双充电端口和具有 240 伏容量的 9.6 kW 充电系统，因此车主可以在任何地方充电。在柴油门丑闻之后，拥有奥迪的大众汽车集团推出了 Electrify America。可以通过称为 MMI 的信息娱乐系统和中控台中的 10.1 英寸触摸屏找到任何充电器。前往导航，然后点击标有插头的图标，您附近的充电器列表将出现。虽然我没有机会在一日游中尝试找到充电器，但奥迪表示，通过奥迪的 MyAudi 应用程序（可通过智能手机和台式机使用）和 MMI 可以轻松找到 EA 充电器及其状态和可用性.奥迪表示，驾驶员可以根据自己喜欢的充电水平（从 1 级到直流快速充电器）进行分类，并导航到充电器，而无需离开奥迪的车载界面。\n司机还可以通过 EA 的应用程序或 MyAudi 应用程序在手机上执行搜索，并通过无线 CarPlay（目前可用）或无线 Android Auto（即将用于量产车型，但不可用）向汽车发送路线在我驾驶的 e-tron GT 或 RS e-tron GT 中。驾驶员还可以通过位于中央扶手的 USB-C 端口连接智能手机。我没有尝试 MyAudi 应用程序，因为我不是车主（它需要将车辆的 VIN 绑定到应用程序以确保隐私得到保护），但奥迪表示司机可以在他们的 MyAudi 应用程序上规划路线，并且系统将自动包括沿途的充电站，以确保他们到达时有足够的备用电池。对于那些希望获得更多支持以无缝过渡到全电动豪华车的奢侈品买家，奥迪推出了他们所谓的带有 e-tron GT 和 RS e-tron GT 的电动汽车 Audi Care。在参与的经销商处，车主可以额外支付 999 美元加税，以获得为期四年的车辆维修服务，其中包括雨刷和刹车片等高磨损物品、可用于服务预约的代客接送服务、移动服务（轮胎更换、基本维护），如果车主需要，每年最多可免费拖到奥迪中心 10 次。奥迪还通过购买 e-tron GT 或 RS e-tron 提供 Silvercar 提供的 7 天免费租赁服务。 e-tron GT 和 RS e-tron GT 融合了 e-tron（SUV）和奥迪 R8 的功能，并且这两款 GT 都配备了双屏幕，可为驾驶员和乘客提供大量功能。驾驶员面前的 12.3 英寸虚拟驾驶舱是高度可定制的，就像今天大多数现代奥迪一样，提供从地图视图到电池状态访问的所有内容，只需在方向盘上进行一些简单的输入。该系统使导航变得轻而易举，驾驶员或乘客只需按下方向盘上的按钮并为汽车提供地址、兴趣点或城市，即可使用语音控制设置目的地。语音系统非常强大，虽然我使用它时有点滞后，但它可以识别自然语言输入，并在两个选项之间进行选择时口头提示说话者使用特定术语 - 例如取消路线和放置新目的地与制作中途停留。我从来没有一次必须尝试多次才能让系统识别我想要做什么。中控台中的 10.1 英寸信息娱乐系统提供从驾驶模式选择到特定奥迪应用程序、导航选项、可选按摩、加热和冷却座椅等等的一切。\n奥迪 MMI 中央屏幕是触摸电容，用户可以拖放图标，让车主和乘客可以以任何方式自定义主屏幕。如果有人愿意（并拥有合适的设备），座椅加热器、冷却器和按摩都可以同时运行，所有这些都来自 MMI。两辆 GT 都在推 100,000 美元，为此，一些买家可能想要更多的炫目。对于发布年份，奥迪在 RS e-tron GT 上提供了一个昂贵但特殊的选项：第一年套餐。车主只需 20,350 美元，即可获得“碳性能”套装，其中包括碳纤维装饰、发光门槛、黑色徽章和后轮转向，以及特殊的 21 英寸车轮、红色陶瓷制动卡钳、红色安全带和内部红色缝线.对于那些想要奢侈品牌的声望、力量和先进技术的人来说，2022 奥迪 e-tron GT 和奥迪 RS e-tron GT 适合那些（不一定）配备所有闪光灯的电动光环豪华旅行车账单。两者现在都在出售。", "note_en": "Not in Audi’s view. The 2022 Audi e-tron GT and RS e-tron GT are a pair of all-electric grand touring halo cars that don’t look like something from 2060. They look just like sleek gasoline-powered GTs, but beneath the skin, there’s a whole lot more power, technological pop and panache than the design implies at first glance.\n The 2022 Audi e-tron GT and RS e-tron GT get a low-slung roofline, wide track and long wheelbase like those grand tourers of the past, with the addition of a few design flourishes to bring it in line with Audi’s subtle, yet luxurious aesthetic. While the e-tron GT and the RS e-tron GT were both produced alongside the Audi R8 (its roofline is lower than the R8) and borrow a few things from that iconic design, these electric grand tourers are a pair of beasts all their own.\n   Based on the same 800-volt architecture as the Porsche Taycan, the e-tron GT makes 469 combined horsepower (up to 522 hp with overboost) from a pair of dual, permanent-magnet motors powering the front and rear wheels. The RS e-tron GT makes 590 (637 hp with overboost) horsepower from those same motors and Audi says it can do 0-60 in 3.1 seconds.\n Both vehicles are capable, confident and quick and don’t tarry on mountain roads or long highway stretches. Acceleration is almost seamless, as it is in most electric vehicles.\n Thanks to Audi’s electric quattro all-wheel drive with torque vectoring system, both vehicles are sure-footed and well sorted, even when the wheels start to squeal. This system allows a variable amount of power to be sent to wheels that slip when cornering hard, making a sudden lane change, or driving in slippery conditions.\n The vehicles I drove were outfitted with summer tires, and I got to test a bit of this out on a closed slalom course with a sudden lane change at the end at the Agua Dulce Airpark about 50 miles northeast of downtown Los Angeles. I ran the RS e-tron GT through the cones three consecutive times to get a feel for the system and each time the car felt secure, planted and under control.\n   Both the e-tron GT and the RS e-tron GT also get optional rear-wheel steering. Under 30 mph, the rear wheels can turn up to 2.8 degrees in the opposite direction to the front wheels to help make the turning radius of the e-tron GT and the RS e-tron GT smaller. Above 30 mph the rear wheels turn in the same direction as the front. This system is similar (with fewer degrees of rotation) to that in the Porsche Taycan.\n While I did not get to try out overboost in either vehicle on the smooth tarmac at the airpark, I did run a series of back-to-back 0 to 100 mph accelerations using launch control in the RS e-tron GT. Amongst the cohort of journalists there, I came in second, doing 0-60 in 3.24 seconds and 0-100 in 7.29 seconds. In 102-degree heat, on cold tires, those numbers are plenty impressive. By the end of the runway, I saw speeds approaching 120 mph, 32 mph short of the electronically limited 155 mph, (152 mph in the e-tron GT) before hitting the brakes. After three back-to-back runs, the fully charged RS e-tron GT had only lost 20 miles of range.\n The EPA-estimated range for the RS e-tron GT is 232 miles while the e-tron GT is estimated to get 239 miles of range.\n   Those estimated EPA ranges are a result of the low-slung 93 kWh battery pack (the same in both vehicles) that Audi says can charge up to 80% in 23 minutes on 270-volt chargers (DC fast charging).\n The e-tron GT starts at $99,900 and the RS e-tron GT pops to a higher $139,900 (both excluding the $1,045 destination charge). That price tag does come with one-time limited benefit.\n Audi paired up with Electrify America to offer free, unlimited public charging for three years (without time restrictions). They also offer at-home charging stations set up through Qmerit. Both the e-tron GT and the RS e-tron GT come with standard dual charging ports and a 9.6 kW charging system with 240-volt capability so that owners can charge anywhere. Electrify America was launched by the Volkswagen Group, which owns Audi, following the Dieselgate scandal.\n Finding any charger is available through the infotainment system, known as the MMI, and the 10.1-inch touchscreen in the center console. Head to navigation and then hit the icon marked with a plug and a list of chargers near you will populate.\n While I didn’t get the opportunity to try to find chargers on the one-day drive, Audi says that finding EA chargers and their status and availability is easy through both Audi’s MyAudi app (available via smartphone and desktop), and through the MMI.  Audi says that drivers can sort by their preferred charging level (Level 1 through DC fast chargers) and navigate to the charger all without leaving Audi’s in-vehicle interface.\n Drivers can also perform the search on their phone through EA’s app or through the MyAudi app and send directions to the car either via wireless CarPlay, which is currently available or wireless Android Auto, which is coming on production models, though it wasn’t available in the e-tron GT or the RS e-tron GT that I drove. Drivers can also connect their smartphone through a USB-C port located in the center armrest.\n I didn’t get to try the MyAudi app since I am not an owner (it requires tying the vehicle’s VIN to the app to ensure that privacy is maintained), but Audi says that drivers can plan a route on their MyAudi app, and the system will automatically include charge stops along the way to ensure that they arrive with plenty of battery in reserve.\n For those luxury buyers who want a bit more support to make a seamless transition to an all-electric luxury car, Audi is launching what they call Audi Care for EVs with the e-tron GT and RS e-tron GT. At participating dealers, owners can pay an additional $999 plus tax to get vehicle servicing for four years that includes high-wear items like wipers and brake pads, available valet pick-up and drop-off for service appointments, mobile service (tire changes, basic maintenance) and, if an owner needs it, up to 10 free tows to an Audi center per year. Audi is also offering seven free days of rentals from Audi by Silvercar with the purchase of an e-tron GT or a RS e-tron.\n   The e-tron GT and the RS e-tron GT blend features from both the e-tron (the SUV) and the Audi R8, and both GTs get dual screens that offer tons of features for drivers and passengers. The 12.3-inch virtual cockpit in front of the driver is highly customizable, like it is on most modern Audis today, offering everything from map views to battery status access with few simple inputs on the steering wheel.\n The system makes navigating a breeze and drivers or passengers can use voice control to set destinations by simply pressing the button on the steering wheel and giving the car an address, point of interest or city.\n The voice system is surprisingly robust and while it was a bit laggy when I used it, it recognizes natural language inputs and verbally prompts the speaker to use specific terms when choosing between two options — say canceling a route and putting in a new destination versus making a stopover. Never once did I have to try multiple times to get the system to recognize what I wanted to do.\n The 10.1-inch infotainment system in the center console offers everything from drive mode selection to specific Audi apps, navigation options, optional massage, heat and cooled seats, and much more.\n The Audi MMI center screen is touch capacitive and users can drag and drop icons around, allowing owners and their passengers to customize the home screen in any way. The seat heater, cooler and the massage can all be run at the same time, should someone so desire (and have the right equipment), all from the MMI.\n   Both GTs are pushing $100,000, and for that, some buyers may want just a little bit more razzle dazzle.\n For the launch year, Audi is offering one pricey, but special option on the RS e-tron GT: the Year One package. For $20,350, owners get the “carbon performance” package with features like carbon-fiber trim, illuminated door sills, black badges and rear-wheel steering, along with special 21-inch wheels, red ceramic brake calipers, red seatbelts and red stitching inside.\n For those who want the prestige, power and advanced technology of a luxury brand, in an electric halo grand tourer that doesn’t (necessarily) come with all the flash, the 2022 Audi e-tron GT and Audi RS e-tron GT fit the bill. Both are on sale now.", "posttime": "2021-08-03 02:08:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tron,奥迪", "title": "全电动 2022 奥迪 e-tron GT 和 RS e-tron GT 以低调的包装提供流行的技术", "title_en": "\n\t\t\t\tAll-electric 2022 Audi e-tron GT and RS e-tron GT provide a pop of tech in understated packaging\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/all-electric-2022-audi-e-tron-gt-and-rs-e-tron-gt-provide-a-pop-of-tech-in-understated-packaging/", "via": "", "real_tags": ["tron", "奥迪"]}, {"category": "", "categoryclass": "", "imagename": "cceb60a5a5efe577c23a568cbfb1c639.jpg", "infoid": 1071240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Salesforce 打算将 Servicetrace 纳入 Mulesoft，该公司于 2018 年以 65 亿美元收购。两家公司没有透露收购价格，暗示这是一笔小得多的交易。当 Servicetrace 在折叠中时，它应该与 Mulesoft 的 API 集成很好地配合，有助于向 Mulesoft 的工具包添加一个自动化层。 “随着 Servicetrace 的加入，MuleSoft 将能够提供领先的统一集成、API 管理和 RPA 平台，这将进一步丰富 Salesforce Customer 360——使组织能够从任何地方提供互联体验。新的 RPA 功能将增强 Salesforce 的 Einstein Automate 解决方案，实现跨服务、销售、工业等任何系统的端到端工作流自动化，”Mulesoft 首席执行官布伦特海沃德在宣布这笔交易的博客文章中写道。虽然 Salesforce 的人工智能层 Einstein 为拥有更现代工具的公司提供了自动执行某些任务的能力，但 RPA 适合更多的传统运营，此次收购可能是帮助 Salesforce 弥合旧的本地工具与更多工具之间差距的又一步现代云软件。 CRM Essentials 的创始人兼首席分析师 Brent Leary 表示，它为 Salesforce 的数字化转型工具带来了另一个维度。 “在完成对 Slack 的最大收购后，Salesforce 很快就开始进行下一次收购。但由来自越来越多的来源的实时数据推动的流程和工作流程自动化正在成为数字化转型成功的关键。这为 Salesforce/MulseSoft 的难题增加了一个关键部分，”他说。虽然感觉 Salesforce 加入市场的时间较晚，但在我们于 5 月发布的一项投资者调查中，CapitalG 的普通合伙人 Laela Sturdy 告诉我们，到目前为止，就 RPA 的潜力而言，我们只是表面上浮现。 “我们距离需要考虑成熟的空间还有很长的路要走。事实上，当您考虑到 RPA 的巨大潜力时，它的采用仍处于起步阶段。大多数公司现在才刚刚开始探索跨行业存在的众多用例。越多企业涉足 RPA，他们设想的用例就越多，”Sturdy 在调查中回应道。 Servicetrace 成立于 2004 年，早在 RPA 的概念出现之前。 Crunchbase 和 Pitchbook 都没有显示任何筹集到的资金，但该网站表明这是一家拥有丰富产品集的成熟公司。客户包括富士通、西门子、默克和德国电信。", "note_en": "Salesforce intends to make Servicetrace part of Mulesoft, the company  it bought in 2018 for $6.5 billion. The companies aren’t divulging the purchase price, suggesting it’s a much smaller deal. When Servicetrace is in the fold, it should fit in well with Mulesoft’s API integration, helping to add an automation layer to Mulesoft’s tool kit.\n “With the addition of Servicetrace, MuleSoft will be able to deliver a leading unified integration, API management, and RPA platform, which will further enrich the Salesforce Customer 360 — empowering organizations to deliver connected experiences from anywhere. The new RPA capabilities will enhance Salesforce’s Einstein Automate solution, enabling end-to-end workflow automation across any system for Service, Sales, Industries, and more,” Mulesoft CEO Brent Hayward wrote  in a blog post announcing the deal.\n  While Einstein, Salesforce’s artificial intelligence layer, gives companies with more modern tooling the ability to automate certain tasks, RPA is suited to more legacy operations, and this acquisition could be another step in helping Salesforce bridge the gap between older on-prem tools and more modern cloud software.\n Brent Leary, founder and principal analyst at CRM Essentials says that it brings another dimension to Salesforce’s digital transformation tools. “It didn’t take Salesforce long to move to the next acquisition after closing  their biggest purchase with Slack. But automation of processes and workflows fueled by realtime data coming from a growing variety sources is becoming a key to finding success with digital transformation. And this adds a critical piece to that puzzle for Salesforce/MulseSoft,” he said.\n While it feels like Salesforce is joining the market late,  in an investor survey we published in May Laela Sturdy, general partner at CapitalG told us that we are just skimming the surface so far when it comes to RPA’s potential.\n “We’re a long way from needing to think about the space maturing. In fact, RPA adoption is still in its early infancy when you consider its immense potential. Most companies are only now just beginning to explore the numerous use cases that exist across industries. The more enterprises dip their toes into RPA, the more use cases they envision,” Sturdy responded in the survey.\n Servicetrace was founded in 2004, long before the notion of RPA even existed. Neither Crunchbase nor Pitchbook shows any money raised, but the website suggests a mature company with a rich product set. Customers include Fujitsu, Siemens, Merck and Deutsche Telekom.", "posttime": "2021-08-03 02:07:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "salesforce,涉足,steps", "title": "Salesforce 涉足 RPA，购买 Servicetrace 并将其与 Mulesoft 合作", "title_en": "\n\t\t\t\tSalesforce steps into RPA buying Servicetrace and teaming it with Mulesoft\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/salesforce-steps-into-rpa-buying-servicetrace-and-teaming-it-with-mulesoft/", "via": "", "real_tags": ["涉足", "steps"]}, {"category": "", "categoryclass": "", "imagename": "680e364e46eb50f62e4c1393760aa9ec.jpg", "infoid": 1071239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论是哪种情况，我们都首先了解了即将推出的 Android 智能手机，包括对后置摄像头系统进行了相当大规模的重新设计。该公司已将其方形配置换成了一个大的黑条，这似乎表明在几代人坚持认为软件/人工智能是它选择与之抗争的基础之后，它似乎对升级硬件进行了更大的推动。然而，更有趣的是 Tensor 的到来，这是一种新的定制 SoC（片上系统），它将在 Pixel 6 和 Pixel 6 Pro 上首次亮相。这是该公司迈出的重要一步，因为它希望在拥挤的智能手机领域脱颖而出——该公司过去一直在努力解决这一问题。这意味着在这些高端系统上放弃高通芯片，走苹果创建定制芯片的道路。也就是说，这些芯片将基于高通用来创建其无处不在的 Snapdragon 芯片的相同 ARM 架构，而谷歌仍将依赖圣地亚哥公司为其预算有限的 A 系列提供组件。 Tensor 这个名字是对谷歌的 TensorFlow ML 的明确致敬，它推动了它的许多项目。不出所料，该公司将 AI/ML 定位为该芯片在即将推出的手机中的地位的基础。 Pixel 团队长期以来一直在推动基于软件的解决方案，例如计算摄影，作为差异化因素。 “设计我们芯片的团队希望让 Pixel 更加强大。例如，使用 Tensor，我们考虑了芯片的每一部分，并对其进行了定制，以运行谷歌的计算摄影模型，”谷歌写道。 “对于用户来说，这意味着全新的功能，以及对现有功能的改进。”除了升级后的摄像头系统，Tensor 还将成为改进语音识别和语言学习等方面的核心。可以理解的是，细节仍然很薄弱（请注意，完整的揭示将在秋季进行），但今天的公告似乎旨在为经过改造的 Pixel 团队规划未来的样子——当然，这些类型的重点正是谷歌应该做的在智能手机领域做：专注于人工智能和软件方面的智能。去年 5 月，Pixel 团队的主要成员离开了谷歌，这意味着团队的过渡。据报道，当时硬件负责人 Rick Osterloh 的言辞严厉。\n“人工智能是我们创新工作的未来，但问题是我们遇到了计算限制，使我们无法完全实现我们的使命，”奥斯特洛在今天的帖子中写道。 “因此，我们着手构建一个专为移动设备打造的技术平台，让我们能够将最具创新性的 AI 和机器学习 (ML) 带给我们的 Pixel 用户。”", "note_en": "In either case, we got the  first look at the upcoming Android smartphone, including a fairly massive redesign of the camera system on the rear. The company has traded its square configuration for a big, black bar that appears to indicate an even larger push into upgraded hardware after a couple of generations spent insisting that software/AI are the grounds on which it has chosen to fight.\n  More interesting, however, is the arrival of Tensor, a new custom SoC (system on a chip) that will debut on the Pixel 6 and Pixel 6 Pro. It’s an important step from the company, as it looks to differentiate itself in a crowded smartphone field — something the company has admittedly struggled with in the past.\n That means moving away from Qualcomm chips on these higher-end systems, following in Apple’s path of creating custom silicon. That said, the chips will be based on the same ARM architecture that Qualcomm uses to create its otherwise ubiquitous Snapdragon chips, and Google  will still rely on the San Diego company to supply components for its budget-minded A Series.\n  The Tensor name is a clear homage to Google’s TensorFlow ML, which has driven a number of its projects. And unsurprisingly, the company sites AI/ML as foundational to the chip’s place in the forthcoming phones. The Pixel team has long pushed software-based solutions, such as computational photography, as a differentiator.\n “The team that designed our silicon wanted to make Pixel even more capable. For example, with Tensor we thought about every piece of the chip and customized it to run Google’s computational photography models,” Google writes. “For users, this means entirely new features, plus improvements to existing ones.”\n Beyond the upgraded camera system, Tensor will be central to improving things such as speech recognition and language learning. Details are understandably still thin (the full reveal is happening in the fall, mind), but today’s announcement seems geared toward laying out what the future looks like for a revamped Pixel team — and certainly these sorts of focuses play into precisely what Google ought to be doing in the smartphone space: focusing on its smarts in AI and software.\n In May of last year, key members of the Pixel team left Google, pointing to what looked to be a transition for the team. Hardware head Rick Osterloh was reported to have had harsh words at the time.\n “AI is the future of our innovation work, but the problem is we’ve run into computing limitations that prevented us from fully pursuing our mission,” Osterloh wrote in today’s post. “So we set about building a technology platform built for mobile that enabled us to bring our most innovative AI and machine learning (ML) to our Pixel users.”", "posttime": "2021-08-03 02:07:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,芯片,google,building", "title": "谷歌正在为 Pixel 6 打造自己的芯片", "title_en": "\n\t\t\t\tGoogle is building its own chip for the Pixel 6\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/google-is-building-its-own-chip-for-the-pixel-6/", "via": "", "real_tags": ["谷歌", "芯片", "google", "building"]}, {"category": "", "categoryclass": "", "imagename": "9a6deaf08f4a918edcd288da0a90a22d.jpeg", "infoid": 1071238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌周一宣布将打造自己的智能手机处理器，称为 Google Tensor，该处理器将在今年秋季为其新款 Pixel 6 和 Pixel 6 Pro 手机提供动力。这是公司构建自己的芯片以创造市场上已经存在的芯片无法实现的另一个例子。在这种情况下，谷歌正在放弃高通。此举是继苹果之后，它在其新计算机中使用自己的处理器而不是英特尔芯片。与 Apple 一样，Google 也在使用基于 Arm 的架构。 Arm 处理器功耗较低，可用于整个行业的移动设备，从手机到平板电脑和笔记本电脑。高通表示，将继续与谷歌密切合作，开发基于其 Snapdragon 平台的当前和未来产品。谷歌 Tensor 将为预计于 10 月推出的新旗舰手机提供动力。 （谷歌将在临近发布时透露有关这些手机的更多细节。）这也是谷歌的战略转变，近年来，谷歌一直专注于其 Pixel 设备的可负担性，而不是提供高端手机。这表明谷歌再次试图在旗舰领域直接与苹果和三星竞争。谷歌张量这个名字是对谷歌用于云计算的张量处理单元的名称的致敬。这是一个完整的片上系统或 SoC，该公司表示，它将为手机上的照片和视频处理提供重大改进，以及语音转语音和翻译等功能。除了 CPU、GPU 和图像信号处理器之外，它还包括一个运行人工智能应用程序的专用处理器。它将允许手机在设备上处理更多信息，而不必将数据发送到云端。 “Pixel 的问题在于，我们一直遇到现有现​​成技术解决方案的限制，而且很难将我们最先进的东西从研究团队带到手机上，”谷歌的硬件负责人 Rick Osterloh 在接受 CNBC 采访时表示。上周的一次采访。 “它将真正改变我们可以通过机器学习和人工智能在手机上做的事情。” Osterloh 表示，新芯片将帮助谷歌的手机拍摄更好的照片和视频。 “我们真的为计算摄影制作了一台定制计算机，”他说。\n谷歌的 Pixel 手机已经拍出了市场上所有手机中最好的照片，所以这是一个很大的主张。但在 CNBC 的演示中，Osterloh 展示了一个示例，说明当您拍照时拍摄对象移动时，新芯片如何帮助减少模糊。谷歌用来改进照片的相同技术现在可以用来改进视频，奥斯特洛说这是其他芯片无法实现的。 Osterloh 展示了其他示例，例如在您说出文本消息时更快、更准确的文本到语音转换，以及视频字幕的新离线翻译。这些都是芯片强大功能的巧妙例子，但它们可能不足以让人们通过 iPhone 或三星 Galaxy 设备购买 Pixel。这就是谷歌真正需要解决的问题：首先让人们购买 Pixel。该公司早期的手机非常棒，但谷歌没有做足够的营销来让消费者意识到它们的存在，或者它们有什么好处。对于较早的型号，它甚至无法让所有主要的美国运营商都提供它们。目前还不清楚这次是否有所有这些。但奥斯特洛表示，谷歌将生产更多旗舰级手机，我们可以期待在秋季围绕 Pixel 6 和 Pixel 6 Pro 进行大规模营销。", "note_en": "Google announced Monday it will build its own smartphone processor, called Google Tensor, that will power its new Pixel 6 and Pixel 6 Pro phones this fall.\n It&#39;s another example of a company building its own chips to create what it felt wasn&#39;t possible with those already on the market. In this case, Google is ditching  Qualcomm. The move follows  Apple, which is using its own processors in its new computers instead of  Intel chips. And like Apple, Google is using an Arm-based architecture. Arm processors are lower power and are used across the industry for mobile devices, from phones to tablets and laptops.\n  Qualcomm said it will continue to work closely with Google on current and future products based on its Snapdragon platform.\n Google Tensor will power new flagship phones that are expected to launch in October. (Google will reveal more details about those phones closer to launch.) That, too, is a strategy shift for Google, which in recent years has focused on affordability in its Pixel devices instead of offering high-end phones. And it shows that Google is again trying to compete directly in the flagship space against Apple and Samsung.\n  The name Google Tensor is a nod to the name of Google&#39;s Tensor Processing Unit the company uses for cloud computing. It&#39;s a full system on a chip, or SoC, that the company says will offer big improvements to photo and video processing on phones, along with features like voice-to-speech and translation. And it includes a dedicated processor that runs artificial intelligence applications, in addition to a CPU, GPU and image signal processor. It will allow the phone to process more information on the device instead of having to send data to the cloud.\n  &#34;The problem with Pixel has been that we keep running into limits with existing off-the-shelf technology solutions, and it&#39;s just really hard to get our most advanced stuff from research teams onto the phone,&#34; Google&#39;s hardware boss Rick Osterloh told CNBC in an interview last week. &#34;It&#39;s going to really transform what we can do on the phone with machine learning and AI.&#34;\n Osterloh said the new chip will help Google&#39;s phones take better photos and videos. &#34;We&#39;ve really made a custom computer built for computational photography,&#34; he said.\n  Google&#39;s Pixel phones already take some of the best pictures of any phone on the market, so that&#39;s a big claim. But in a demo with CNBC, Osterloh showed one example of how the new chip can help decrease blurring when a subject moves while you&#39;re taking a picture. The same technology Google uses to improve photos can now be used to improve videos, which Osterloh said wasn&#39;t possible with other chips.\n Osterloh showed other examples, like faster and more accurate text-to-speech when you&#39;re speaking out a text message, and new offline translation for captions for videos. Those are neat examples of the power of the chip, but they may not be enough to get people to buy a Pixel over an iPhone or a Samsung Galaxy device.\n And that&#39;s the problem Google really needs to solve: getting people to buy Pixel in the first place.\n The company&#39;s earlier phones have been great, but Google hasn&#39;t done enough marketing to make consumers aware that they exist, or that they&#39;re any good. With earlier models, it couldn&#39;t even get all the major U.S. carriers to offer them. And it&#39;s unclear if it has all of them on board this time. But Osterloh said Google will make more flagship-tier phones and that we can expect a big marketing push around Pixel 6 and Pixel 6 Pro in the fall.", "posttime": "2021-08-03 01:50:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,手机,google,今年,abandon", "title": "谷歌今年将放弃高通，自建智能手机处理器", "title_en": "Google Will Abandon Qualcomm and Build Its Own Smartphone Processors This Year", "transed": 1, "url": "https://www.cnbc.com/2021/08/02/pixel-6-will-have-processor-designed-by-google.html", "via": "", "real_tags": ["谷歌", "手机", "google", "今年", "abandon"]}]