[{"category": "", "categoryclass": "", "imagename": "784425757bcdefb88fa721366f0a2eb2.jpg", "infoid": 1017341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着深空任务和火星殖民地继续从科幻小说转向可能在不久的将来成为现实，看到好莱坞考虑讲述不同类型的太空探索故事也就不足为奇了。Netflix将于9月4日首播的新电视剧《远走高飞》(Away)看起来就是这样的故事。\n这部剧由奥斯卡获得者希拉里·斯万克主演，由“为人父母”和“周五夜之光”背后的人创作。这是一部关于宇航员火星任务的节目-但显然也是关于家庭戏剧和由此产生的紧张局势，无论是对那些在太空进行多年长期任务的人，还是对他们离开地球家乡的家人来说都是如此。\n这部剧还希望让“傲骨贤妻”中的乔什·查尔斯(Josh Charles)扮演关键的配角，这很棒，因为他很棒。考虑到人才的水平，节目运营者的血统和空间设置，这看起来像是一个伟大的新节目的奇妙食谱。第一季将于9月4日在Netflix上提供流媒体服务。", "note_en": "As deep space missions and Mars colonies continue to shift from science fiction to potential near future reality, it’s not surprising to see Hollywood think about different types of stories to tell about space exploration.  Away, a new series from  Netflix   premiering on September 4, looks like that kind of story.\n The show stars Oscar-winner Hilary Swank, and is created by the people behind  Parenthood and  Friday Night Lights. It’s a show about an astronaut mission to Mars – but it’s clearly also about the family drama and tensions that arise, both for those in space on a multi-year long-duration mission, and for the families they left back home on Earth.\n  The show also looks to feature  The Good Wife’s Josh Charles in a key supporting role, which is awesome because he’s fantastic. Given the level of talent, the pedigree of the show runners and the space setting, this looks like a fantastic recipe for a great new show. The first season will be available to stream on September 4 on Netflix.", "posttime": "2020-08-10 22:22:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火星,太空,netflix,trailer,看起来", "title": "\n看Netflix关于火星任务的新家庭太空剧预告片", "title_en": "\n\t\t\t\tWatch the trailer for Netflix’s new family space drama about a mission to Mars\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/watch-the-trailer-for-netflixs-new-family-space-drama-about-a-mission-to-mars/", "via": "", "real_tags": ["火星", "太空", "netflix", "trailer", "看起来"]}, {"category": "", "categoryclass": "", "imagename": "c895b13fc15b7d084c6634aa41360edc.jpg", "infoid": 1017340, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，新冠肺炎疫情彻底摧毁了许多行业，但随着人们继续滞留在家里，美国博彩业继续受益。NPD的另一份报告强调了一个出色的季度，美国的支出创下了第二季度的新纪录。\n根据数据，游戏玩家花费了116亿美元，比去年同期增长了30%。这也比第一季度的109亿增长了7%，因为在大流行继续肆虐的情况下，支出仍在继续。\n游戏本身就占了这一数字的102亿美元(本身同比增长了28%)，一些大家熟悉的游戏占据了榜首，包括《动物穿越：新地平线》、《使命召唤》和《现代战争》。游戏硬件类别比2019年增长了57%，任天堂Switch、PlayStation4和Xbox One的销售都很强劲。\n考虑到今年早些时候经历的短缺，这一转变并不令人意外。也许更出人意料的是PS4和Xbox One的持续销售，因为这两款游戏机都将在今年晚些时候被下一代设备黯然失色。当然，这些即将到来的系统在目前的在家订购期间对游戏玩家并没有太大的好处。", "note_en": "The COVID-19 pandemic has utterly decimate a number of industries over the the past several months, but the U.S. gaming industry continues to benefit as people continue to be stuck at home. Yet  another report from NPD highlights an excellent quarter, with spending hitting a new Q2 record in the States.\n According to the figures, gamers spent $11.6 billion, marking a 30% increase over a year prior. It was also a 7% increase over Q1’s 10.9 billion, as spending continues while the pandemic continues to rage.\n  Games themselves comprised $10.2 billion of that figure (itself a 28% increase y-o-y), with some familiar titles occupying the top spots, including Animal Crossing: New Horizons, Calls of Duty Warzone and Modern Warfare. The gaming hardware category saw a 57% increase from 2019, with Nintendo Switch, PlayStation 4 and Xbox One all seeing strong sales.\n The Switch isn’t a surprise, given shortages experienced earlier in the year. Perhaps a bit more unexpected are continued sales on the PS4 and Xbox One, given that both consoles are set to be eclipsed by next generation devices later in the year. Of course, those upcoming systems aren’t doing gamers much good during the current moment of stay at home orders.", "posttime": "2020-08-10 22:22:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,推动,industry,继续", "title": "\n美国博彩业再创佳绩，大流行推动销售", "title_en": "\n\t\t\t\tU.S. gaming industry records another excellent quarter as pandemic fuels sales\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/u-s-gaming-industry-records-another-excellent-quarter-as-pandemic-fuels-sales/", "via": "", "real_tags": ["美国", "推动", "industry", "继续"]}, {"category": "", "categoryclass": "", "imagename": "9a1c4436f496fe79b19f7cc406c3635f.jpg", "infoid": 1017339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "洛夫格伦是一位民主党国会女议员，土生土长的加利福尼亚州人，自从1995年首次当选美国众议院议员以来，她一直在硅谷的心脏地带服务，在那里她服务过四位总统-并弹劾了其中的一半。\n作为硅谷最著名的议员之一，洛夫格伦对服务于她选区的世界上最大的科技巨头的需求有着独特的洞察力-但也要让他们承担责任。\n作为人民及其宪法权利的坚定捍卫者，洛夫格伦一直在推动保护网络中立，努力遏制国内政府的监控，并游说反对影响深远的反盗版规定，批评人士称这些规定会导致网络审查。她一直致力于保护诚信的安全研究人员免受“过分热心的起诉”，她是安全加密的热心支持者-尽管政府努力推动后门。洛夫格伦还继续向联邦政府施压，要求其在11月总统选举前改善选举安全。\n但她也一直站在控制大型科技公司(Big Tech)的最前线，并毫不回避地推动立法，以遏制硅谷一些更恶劣的数据隐私和商业做法。\n到目前为止，洛夫格伦是国会山最了解情况、最精通技术的立法者之一，这正是我们很高兴她将在Disrupt2020与我们一起谈论一些最热点问题的原因。\n每个美国人都应该有合法的权利从渴求数据的科技巨头那里获得在线隐私吗？在一个不断变化的安全和隐私规则世界里，作为一家初创公司意味着什么？她有多担心外国势力干预我们的民主进程呢？普通美国人能做些什么来反击政府的窥探？\n快来扰乱2020吧，一探究竟。我们离活动越来越近了，早起的鸟儿价格将在本周末到期。在7月31日之前抢购通行证可以节省$$！", "note_en": "Lofgren, a Democrat congresswoman and California native, has served at the heart of Silicon Valley since she was first elected to the U.S. House of Representatives in 1995, under which she’s served four presidents — and impeached exactly half of them.\n As one of the most prominent lawmakers in Silicon Valley, Lofgren has a unique insights into the wants and needs of the world’s biggest tech giants that serve in her constituency — but also to hold them to account.\n  As a staunch defender of the people and their constitutional rights, Lofgren has pushed to protect  net neutrality, fought  to curb domestic government surveillance, and  lobbied against far-reaching anti-piracy rules that critics said would have led to online censorship. She has campaigned  to protect good-faith security researchers from “overzealous prosecutions,”and is a  fervent supporter of secure encryption — despite efforts by the government to push for backdoors. Lofgren also continues to press the federal government to improve election security ahead of November’s presidential vote.\n But she has also been at the forefront of keeping Big Tech in check, and hasn’t shied away from pushing legislation to rein in some of Silicon Valley’s more  egregious data privacy and  business practices.\n Lofgren is by far one of the most clued-in and tech savvy lawmakers on Capitol Hill, which is precisely why we’re thrilled she will join us at  Disrupt 2020 to talk about some of the most hot-button issues.\n Should every American have the legal right to online privacy from data-hungry tech giants? What does it mean to be a startup in an ever-changing world of security and privacy rules? How worried is she about foreign powers interfering with our democratic process? And what can ordinary Americans do to push back against government snooping?\n Come to  Disrupt 2020 to find out. We’re getting closer to the event and  early bird pricing is about to expire at the end of the week. Save some $$ by  grabbing your pass before July 31!", "posttime": "2020-08-10 22:21:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,zoe,lofgren,安全", "title": "\n众议员佐伊·洛夫格伦(Zoe Lofgren)将在Disrupt 2020上谈论隐私和政策", "title_en": "\n\t\t\t\tRep. Zoe Lofgren to talk privacy and policy at Disrupt 2020\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/rep-zoe-lofgren-to-talk-privacy-and-policy-at-disrupt-2020/", "via": "", "real_tags": ["2020", "zoe", "lofgren", "安全"]}, {"category": "", "categoryclass": "", "imagename": "1395c4369d214d2dadb2c41e95a04400.png", "infoid": 1017338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步首席执行官Dara Khosrowshahi周一表示，优步的司机应该得到两全其美的好处--福利和工作灵活性。在“纽约时报”发表的一篇评论文章中，Khosrowshahi提议立法者要求零工经济公司设立福利基金，这将给员工提供现金，让他们可以用来享受他们想要的福利，比如医疗保险或带薪休假。\n我们目前的雇佣制度是过时的和不公平的。Khosrowshahi写道，它迫使每个员工做出选择，要么成为福利更高但灵活性较小的员工，要么成为灵活性更大但几乎没有安全网的独立承包商。现在是超越这个错误选择的时候了。\n这篇评论文章发表之际，优步及其竞争对手叫车公司Lyft在加州可能面临一项禁令，该禁令将迫使他们将司机重新归类为员工。目前，司机被归类为独立承包商，这意味着他们自己支付费用，如汽油、汽车维修和保险。司机也没有医疗保险和病假等福利。\n在5月份对这些公司提起的诉讼中，加州司法部长泽维尔·贝塞拉(Xavier Becera)指控优步和Lyft剥削了数十万加州员工，将他们的司机归类为独立承包商而不是员工，从而违反了加州的AB5法律。\n优步还在一篇针对政策制定者和其他零工经济公司的博客文章和文件中阐述了自己的提议。Khosrowshahi说，除了创建福利基金外，立法者还应该要求零工公司为工作中发生的伤害提供医疗保险。这位优步首席执行官表示，公司还将自行采取一些措施，包括提高司机收入的透明度，并对所有司机进行调查，了解哪些有效，哪些无效。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Uber CEO Dara Khosrowshahi on Monday said its drivers should get the &#34;best of both worlds&#34; -- benefits and work flexibility. In an  op-ed published in The New York Times, Khosrowshahi proposed that lawmakers require gig economy companies to create &#34;benefits funds&#34; that would &#34;give workers cash that they can use for the benefits they want, like health insurance or paid time off.&#34;\n &#34;Our current employment system is outdated and unfair. It forces every worker to choose between being an employee with more benefits but less flexibility, or an independent contractor with more flexibility but almost no safety net,&#34; wrote Khosrowshahi. &#34;It&#39;s time to move beyond this false choice.&#34;\n   The op-ed comes as Uber and rival ride-hailing company Lyft   face a possible injunction in California that would force them to reclassify their drivers as employees. Currently, drivers are classified as independent contractors, which means they pay for their own expenses, such as gas, car maintenance and insurance. Drivers also don&#39;t have benefits like health insurance and sick leave.\n In a  lawsuit brought against the companies in May, California Attorney General Xavier Becerra alleged that Uber and Lyft have &#34;exploited hundreds of thousands of California workers&#34; by classifying their drivers as independent contractors rather than employees -- thus violating  California law AB 5.\n Uber also  laid out its proposal in a  blog post and document aimed at policy makers and other gig economy companies. In addition to creating benefits funds, Khosrowshahi said lawmakers should require gig companies to provide medical coverage for injuries that happen on the job. The Uber CEO said the company will also take some steps on its own, including being more transparent about the money that drivers can earn and surveying all its drivers about &#34;what&#39;s working and what&#39;s not.&#34;\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-08-10 22:21:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "首席,ceo,司机", "title": "优步首席执行官呼吁为临时工设立“福利基金”", "title_en": "Uber CEO Calls For 'Benefits Funds' for Gig Workers", "transed": 1, "url": "https://www.cnet.com/news/uber-ceo-calls-for-benefits-funds-for-gig-workers/", "via": "", "real_tags": ["首席", "ceo", "司机"]}, {"category": "", "categoryclass": "", "imagename": "66fc0657386195b08e2998a100c5d5c3.png", "infoid": 1017337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "甚至在大流行之前，争夺你的起居室的斗争就已经达到了沸点。现在的大屏幕比以往任何时候都大，因为2020年加速了流媒体战争，并提高了智能电视平台的赌注。当然，谷歌正在尽一切努力避免落后。今天，该公司为Android电视开发者提供了新的工具，包括Google Play Instant，模拟器中的Play Store，PIN码购买，Gboard TV，自动低延迟模式，以及倾斜库的改进。\n智能电视领域在很大程度上由Tizen和webOS在全球占据主导地位，Roku和亚马逊的Fire TV赢得了美国消费者的青睐。虽然谷歌很早就看到了其廉价的Chromecast电视加密狗取得了很大的成功，但消费者在升级电视体验时并没有转向Android电视。有传言称，一款搭载Android TV的Chromecast Ultra将于今年晚些时候发布，因此这可能是谷歌试图让开发者对其平台感到兴奋的早期尝试。\n谷歌表示，Android TV现在与前十大智能电视OEM中的七家和160多家电视运营商合作。该公司还补充说，现在“与一年前相比，Android电视月活跃设备增加了80%以上”，但没有透露原始数据。到目前为止，开发者已经在Android TV上为Google Play构建了约7000个应用程序，高于2019年4月的5000个。\nGoogle Play Instant是指无需事先安装即可立即启动的Android应用程序和游戏。谷歌多年来一直致力于这一概念。该公司在2016年5月发布了Android Instant Apps，并在2018年3月将其更名为Google Play Instant，同时增加了对游戏的支持。Google Play Instant终于在2018年5月向所有Android开发者开放。两年多后，Android电视开发者终于也明白了这一点。\n目前还不清楚Google Play Instant在电视上是否有意义。当然，让用户在不安装的情况下试用应用程序是有好处的，但在手机上一次性使用应用程序(对于停车公司、滑板车服务、城市指南)更有意义。尽管如此，开发人员可能会想出一些有趣的电视用例。\n开发者会发现Android TV Emulator对Play Store的支持非常有用。这将使在模拟器中测试Android电视项目和功能(如订阅)变得更容易，而不必在真实设备上部署任何内容。\n谷歌还增加了PIN码购买，试图缓解在Android电视上购买内容的摩擦。但这并没有太大的进步：你现在可以在Google Play上键入PIN码，而不是在Google Play上键入密码。有什么大不了的。\n说到用遥控器打字，这很可能是智能电视最令人恼火的体验之一。谷歌终于用QWERTY布局取代了A-Z布局。新的Gboard TV还包括语音到文本、预测性打字、不同的排列(中、左或右)，以及针对30多个国家的优化。语音到文本和预测性打字作为应用程序中的替代输入选项将特别有用。\n谷歌还通过自动低延迟模式改进了Android电视上的游戏。该模式允许开发人员禁用Android电视后处理，并在游戏全屏显示时将延迟降至最低。\n最后，谷歌简化了倾斜库，包括顶部标签导航，媒体标题分页，以及手机和电视之间的代码库共享。如果这激起了你的兴趣，你可能想看看Android 11开发者预览版。", "note_en": "Even before the pandemic, the battle to own your living room was reaching a boiling point. Now the big screen is bigger than ever as 2020 accelerates the  streaming wars and raises the smart TV platform stakes. Naturally, Google is making every effort to avoid being left behind. Today the company gave Android TV developers new tools, including Google Play Instant, the Play Store in the emulator, PIN code purchases, Gboard TV, auto low latency mode, and leanback library improvements.\n The smart TV space is largely dominated by Tizen and webOS globally, with Roku and Amazon’s Fire TV winning over U.S. consumers. While Google saw plenty of success with its cheap  Chromecast TV dongle early on, consumers did not convert to Android TV as they upgraded their TV experience. Rumor has it a  Chromecast Ultra powered by Android TV is coming later this year, so this might be Google’s early attempt to get developers excited about its platform.\n  Google says Android TV now works with seven of the top 10 smart TV OEMs and over 160 TV operators. The company also added that there are now “over 80% more Android TV monthly active devices than a year ago,” but didn’t divulge raw numbers. Developers have built about 7,000 apps for Google Play on Android TV, to date, up from 5,000 in April 2019.\n  Google Play Instant refers to Android apps and games that can be launched immediately without being installed first. Google has been working on the concept for years. The company  unveiled Android Instant Apps in May 2016 and  renamed it to Google Play Instant while adding support for games in March 2018. Google Play Instant was finally  made available to all Android developers in May 2018. More than two years later, Android TV developers are finally getting it too.\n  It’s not clear whether Google Play Instant makes sense on TVs. Letting users try apps without installing them has its advantages, sure, but one-time use apps (for a parking company, a scooter service, a city guide) just make more sense on phones. Still, it’s possible developers may dream up some interesting TV use cases.\n  What developers will find useful is Play Store support in the Android TV Emulator. This will make it easier to test Android TV projects and features (like subscriptions) in the emulator without having to deploy anything on a real device.\n  Google has also added PIN code purchasing in an attempt to ease the friction of buying content on Android TV. But it’s not much of an improvement: Instead of typing your password on Google Play, you can now type a PIN code instead. Big whoop.\n  Speaking of typing with a remote, that’s easily one of the most infuriating experiences with smart TVs. Google has finally replaced the A-Z layout with a QWERTY layout. The new GBoard TV also includes speech-to-text, predictive typing, different alignments (center, left, or right), and optimizations for over 30 countries. Speech-to-text and predictive typing will be particularly useful as alternative input options in apps.\n  Google has also improved gaming on Android TV with an auto low latency mode. The mode lets developers disable Android TV post-processing and minimize latency whenever a game is shown in fullscreen.\n Finally, Google has simplified the leanback library with top tab navigation, paging through media titles, and shared code bases across mobile and TV. If that piques your interest, you may want to check out the  Android 11 Developer Preview.", "posttime": "2020-08-10 22:20:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,开发,谷歌,android,扩展", "title": "谷歌扩展了Android TV的开发者工具，包括即时应用和语音到文本的支持，并表示月度活跃设备同比增长超过80%", "title_en": "Google expands developer tools for Android TV, including instant apps and speech-to-text support, and says monthly active devices have grown more than 80% YoY", "transed": 1, "url": "https://venturebeat.com/2020/08/10/android-tv-google-play-instant-apps-speech-to-text-predictive-typing/", "via": "", "real_tags": ["google", "开发", "谷歌", "android", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是我试图在印度开一家制造工厂的故事，…。\n请注意，马哈拉施特拉邦被认为是印度在“经商便利性”方面最自由、最好的邦之一。\n我在2019年11月左右开始了这一过程。已经9个多月了，我至少还有4个月的时间才能获得许可，允许我在我的农地上建造任何东西。\n是的，在你用自己的钱在你自己的土地上建造任何制造结构之前，你需要获得“许可”。此权限称为NA或非农业证书。\n为了拿到那个，我去了桑里区行政办公室。这座建筑看起来相当不错。\n在打听了一会儿之后，我被告知我可以从“税务局”办公室获得NA许可。\n前两个文档可以在网上获得，而且很容易获得。第三份和第四份文件也很容易，因为格式已经可以使用了，我只需要填好它们并签字即可。\n最后三份文件不容易拿到。我花了3个多月的时间和2000卢比的律师费，以及相距10多公里的20多个不同办公室的访问。\n但我最终还是拿到了。我以为就是这里了。我现在要拿到享有盛誉的NA证书。\n所以我买了一份档案，把所有这些文件都归档在里面，然后去了“税务局”办公室。\n我提交了文件。并被告知，申请将在一次会议上进行审查和讨论，如果申请获得批准，就可以启动土地审批程序。\n大约一个月后，我接到税务局的电话，要求拜访他们进一步办理手续。\n在那里，我收到了一封信，写给11个不同的部门，要求这些部门给我一份NOC(不反对证书)。我被告知通过向每个部门出示这封信和他们可能要求的任何其他文件来获得所有11个国家奥委会。\n其实，我们要取得的国家奥委会超过13份，但这封信只提及11份。\n在申请了这些地方之后，他们给出了自己的文件清单，每个文件都需要一个或两个以上的国家奥委会。\n好的，酷。我对自己说。4个月后，我所要做的就是把这封信带到每个办公室(在找到他们的地址后，位于这个地区的某个地方)，然后拿到他们的信。我想，这很简单。\n但是不是的！当我到达第一个“残疾人”办公室时，他们给了我一份他们授予我NOC所需的文件清单。\n我明白需要残疾人士国家奥委会背后的理据。如果他们计划修建一条穿过我们打算在其上施工的土地的公路怎么办？在我们进行任何施工活动之前，通知公共工程部当然是值得的。\n而且PWD NOC很容易拿到。这花了4个多月的时间，但没有人索要任何贿赂，也没有人要求任何奢侈的文件或签名。\n同样，马哈维塔兰是马哈拉施特拉邦的国有公司。它拥有低压输电线，为房屋、商业空间和农场提供电力。(不是行业)。\n对马哈维塔兰国家奥委会的要求是，“如果”有任何线路穿过农田，那么土地所有者必须将它们移除。我也同意这个想法。\n尽管拆除这些线路的成本很高，但这是安全的重要一步。所以，再说一遍，这不是问题。\n同样，Mahatransco与Mahavitaran相同，只是它为工业用途提供高压电力传输。\n如果没有高压线，就像我们的土地上的情况一样，农场所有者自我声明没有Mahatransco线就足够了。\n我申请了国家奥委会。他们来检查过了。他们的人签名并写道，没有Mahatransco线路。然后他们给了我那张纸，让我得到两个村庄当局的签名。塔拉西人和圈子军官。\n没有签名，Mahatransco不会接受它。而这两个人也不会不惜任何代价在上面签字。\n他们不仅需要11份文件，每份文件几乎需要一个月才能获得，他们还希望我们支付289000卢比(这是印度人均国民收入135000卢比的两倍多)，因为“我们的土地属于灌溉部运河服务的地区”。\n现在，首先，印度农民不支付电费和水费。所以他们只是让水泵的开关一直开着。只要有电，水就会源源不断地被抽到农场里，把不必要的水淹没在农场里。\n不管怎样，让我们假设我一点也不关心农民浪费的水和电。\n我所关心的就是我应该接上水和电，而且我应该按当时的价格收费，我会付账的。\n但是没有。有人正在不辞辛劳地建立一个制造单位。有人在不辞辛劳地提供就业机会。所以，让我们尽可能多地从这个人身上榨取利润，这样我们就可以继续向这些‘多数派’农民免费赠送东西，并继续当选。\n为什么你需要卫生部门的“许可”才能在你的土地上建立一个制造单位？嗯，也许是因为政府有兴趣设置尽可能多的障碍，这样这些“公仆”就可以从那些想创业和创造就业的傻瓜那里榨取尽可能多的钱。\n还有，他们给了我一份文件清单。这些文件将被上传到一个网站上。而且网站总是不起作用。\nMIDC NOC是可以理解的。他们购买土地，并将其以低价出售用于制造目的。因此，有必要确认您正在建设的土地不是任何即将到来的MIDC项目的一部分。\n而且这里的过程很快。没有人索要任何贿赂。所以我对这个没有问题。\n设立该办事处是为了促进该地区商业能力的发展。但现在，它只会增加负担，因为它在你开始创业之前需要完成的障碍清单上。\n但幸运的是，我用一个应用程序在一周内就得到了它，所以无论如何它都应该被删除。\n几天之内就拿到了，不需要任何文件。它是污染控制委员会，它是拯救环境所必需的。所以我不介意。只要它快就行了。\n在Miraj的Tahshildar办公室申请了这个NOC。没有回应。没有信。没有交流。而且没有人愿意谈论下一步应该做什么。\n显然，他们在玩“难以获得”的游戏，让我支付一些贿赂，并启动这一过程。但在经历了这一切之后，我不会向任何人行贿。\n这是最重要的NOC之一，根据许多经验丰富的“特工”，他们已经在这场N.A.游戏中。这个国家奥委会需要投入大量的资金，否则他们可能会无限期地推迟你的项目。\n因此，由于这是上面提到的几乎所有国家奥委会的要求，我去申请了Gram Panchayat国家奥委会。\n而许多其他的NOC依赖于Gram Panchayat NOC，所以他们也被困住了。\n女士们，先生们，兄弟姐妹们，如果你们尝试开办一个小型制造单位，为自己和其他几个人创造就业机会、有用的产品和繁荣，印度就会这样对待你们。\n已经9个多月了，我从一个办公室到另一个办公室。从一个塔鲁卡到另一个塔鲁卡，大多数时候都会发现有关的人当天已经决定呆在家里。\n村里的办公室，马拉提语中所说的“chavdi”，是根据一个人的突发奇想运行的，这个人可能随时出现在办公室，也可能随时消失。你所能做的就是坐着等到晚上，“希望”这个人能在下午6点之前到达。\n嗯，我发现管理这些规则的法律是以“马哈拉施特拉邦土地收入法”为基础的。我将试图在法庭上挑战这一过程，并抗议变革，这样任何人都可以在自己的土地上开始或建造任何他们选择的东西。\n我对你们的请求是和我一起执行这项使命，真正使印度成为一个商业像野草一样在肥沃的土地上生长的地方。目前，尽管人们有很多愿望，很多人想创业，但这样的法律就像肥沃的土地上的一层混凝土，完全阻止了印度农村和穷人的创业意志力。", "note_en": "So this is the story of me trying to start a manufacturing unit in India…\n  Do note that, Maharashtra state is considered to be one of the most liberal and best states in terms of “ease of doing business” in India.\n I started the process around November 2019. It’s been more than 9 months and I am still at least 4 months away from getting the permission that allows me to construct anything on my agricultural land.\n  Yes, you need to obtain “permission” before you build any manufacturing structure on your own land with your own money. This permission is called the NA or  Non- Agricultural Certificate.\n  To get that, I went to the Sangli District Administration Office. The building looks quite good.\n  After asking around a bit, I was told that I could get the NA permission from the “Revenue Department” office.\n      The first two documents are available online and easy to get. The 3rd and 4th documents were also easy as the format was already available, I just had to fill them up and sign on them.\n The last three documents were not easy to get. It took me more than 3 months and 2000 Rs in legal fees and more than 20 visits to different offices more than 10 kms apart.\n But I finally got them. I thought this was it. I was now going to get the prestigious NA certificate.\n And so I bought a file and filed all these papers in it and went to the “Revenue Department” Office.\n I submitted the file. And was told that the application will be reviewed, discussed in a meeting and then if the application is approved, the procedure for NA-ing the land could be started.\n After about a month, I got a call from the Revenue Department asking to visit them for further procedure.\n There I was handed a letter, addressing 11 different departments and asking those departments to give me a NOC (No Objection Certificate). I was told to get all the 11 NOC’s by showing this letter to each department and any other additional documents they might ask.\n  Actually, there are more than 13 NOC’s required to be obtained but this letter only mentions 11 of them.\n After applying to each of these places, they give their own list of documents which require one or two more NOC’s each.\n   Okay cool. I said to myself. After 4 months, all I had to do was to take this letter to each of these offices (after finding their address, located somewhere in the district) and then get their letter. Easy peasy, I thought.\n But no! Once I reached the first “PWD” office, they gave me a list of documents required by them to grant me NOC.\n   I understand the reasoning behind the need for a PWD NOC. What if they’re planning to build a road through the land on which we intend to do our construction. It’s certainly worth notifying the public works department before we do any construction activity.\n And the PWD NOC was easy to get. It took more than 4 months but no one asked for any bribe nor did anyone ask for any extravagant documents or signatures.\n   Again, Mahavitaran is the Maharashtra state owned company. It owns the low-tension electricity transmission lines which provides electricity to houses, commercial spaces and farms. (Not industries).\n The requirement for the Mahavitaran NOC is that “if” there are any lines going through the farm land, then the land owner must get them removed. I also agree with this idea.\n Even though removing these lines cost a lot, it is an important step for safety. So again, not a problem.\n   Again Mahatransco is the same as Mahavitaran except that it provides high-tension electricity transmission for industrial use.\n  If there are no high-tension lines, as is the case in our land, a self-declaration by the farm owner that there is no Mahatransco line should be sufficient.\n  I applied for NOC. They came and checked. Their person signed and wrote that there is no Mahatransco line. And then they gave me that paper and asked me to get signatures from two village authorities. The Talathi and The Circle Officer.\n   Mahatransco would not accept it without the signatures. And these two people would not sign it at any cost.\n     Not only do they need 11 documents, each of which requires almost a month to obtain, they also want us to pay Rupees 2,89,000 (That is more than twice the Average Per Capita National Income of India ~1,35,000) “because” our land falls within the area served by a canal from the Irrigation Department.\n Now, to begin with, Indian farmers don’t pay for electricity and water. So they just keep the Switch for the water pump turned ON always. Whenever electricity is available, the water keeps getting pumped into the farm, flooding the farm with unnecessary water.\n Anyway, let’s assume that I don’t care at all about the water and electricity being wasted by the farmers.\n All I care about is that I should get a water and an electricity connection and I should be billed at whatever price that prevails and I will pay the bill.\n But no. Someone is taking the pain to setup a manufacturing unit. Someone is taking the pain to provide employment. “So let’s just milk out as much as we can from this person so that we can continue giving free things to these “majority” farmers and keep getting elected.”\n    Why do you need the health department’s “permission” to start a manufacturing unit on your land? Well maybe because the government is interested in creating as many hurdles as possible so that these “public servants” can milk as much money as possible from the fool who wants to start a business and create employment.\n Also, they gave me a list of documents. These documents were to be uploaded on to a website. And always, the website doesn’t work.\n      MIDC NOC is understandable. They procure land and offer it for cheap prices for manufacturing purposes. Therefore it is necessary to confirm that the land on which you are building is not a part of any upcoming MIDC project.\n And the process was fast here. No one asked for any bribes. So I have no problem with this one.\n  This office was created to facilitate the creation of business capacity in the district. But now it just adds to the burden by being in the list of barriers to be completed before you can start a business.\n But fortunately I got it with one application and within one week, so it should just be removed anyway.\n  Got it within a few days without the need of any documents. And it’s the Pollution Control Board, which is necessary to save the environment. So I am fine with it. As long as it’s fast.\n  Applied for this NOC in the Tahshildar Office at Miraj. No response. No letter. No communication. And no person is willing to talk about what one should do next.\n  Obviously, they are playing “hard to get” to get me to pay some bribe and initiate the process. But after going through all this, I am not going to pay any bribe to anyone.\n    This is one of the most important NOC according to many experienced “agents” who have been in this N.A. game. A lot of money needs to be sprinkled for this NOC or they can delay your project infinitely.\n    So as this is a requirement in almost all the NOC’s mentioned above, I went and applied for the Gram Panchayat NOC.\n   And many other NOC’s depend on the Gram Panchayat NOC, so they are stuck too.\n And this is how, ladies and gentlemen, brother and sisters, India will treat you if you try starting a small manufacturing unit to create jobs, useful products and prosperity for yourself and a few others.\n It’s been more than 9 months, I went from one office to another. From one Taluka to another, most of the times to find out that the concerned person has decided to stay at home that day.\n The office in the village, the “chavdi” as it is called in Marathi runs on the whims of one person and this one person could appear at the office any day and disappear any day. All you can do is sit and wait till the evening and “hope” that this person arrives before 6 PM.\n  Well, I have found out that the law governing these rules is based in the “Maharastra State Land Revenue Code”. I will try to challenge this process in the court as well as protest for change so any one could start or construct anything of their choice on their land.\n My request to you is join me in this mission to really make India a place where Businesses come up like weeds grow on fertile land. Currently even though there is a lot of aspiration in the people and lot of people want to start something, laws like these act as a concrete layer on fertile land to completely halt any entrepreneurial willpower in the rural and the poor people of India.", "posttime": "2020-08-10 22:19:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "印度,manufacturing,土地", "title": "我试着在印度开了一家制造厂", "title_en": "I tried starting a manufacturing unit in India", "transed": 1, "url": "https://superr.in/economy/i-tried-starting-a-manufacturing-unit-in-india/", "via": "", "real_tags": ["印度", "土地"]}, {"category": "", "categoryclass": "", "imagename": "a4f97e581128b325bb2c6b599956773e.jpg", "infoid": 1017335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "钻孔公司继续进行扩建计划，埃隆·马斯克已获准在拉斯维加斯地下延长隧道。这条隧道将把城市从一端连接到另一端，将穿越时间从30分钟减少到只有3分钟。\n这一扩建是在拉斯维加斯会议中心东西之间完成的第一部分之后进行的。这个城市下面的地道网将避免主干道上的拥堵。\n钻探公司修建这条隧道的目的是通过提供几个车站来服务于位于其轴线上的不同目的地，从而减少穿越城市所需的时间。拉斯维加斯的中心，像许多大城市一样，交通拥堵。\n钻探公司提供了一个独创的解决方案，将高速行驶的车辆放在专门为此目的而设计的隧道中。车辆的最高时速将达到155英里每小时，这样就可以在3分钟内将城市从北到南连接起来，而不是使用通常的车道需要30分钟。隧道的延伸还可以将麦卡伦国际机场连接到城市南部。\n一个由多层深度的隧道组成的广泛网络将有助于减少任何城市的拥堵。不管一个城市有多大，都有可能增加更多的关卡。vbl.)。\n由于采用了一种新的、更有效和经济的挖掘方法，这一扩建工程的完成不会对空中交通路线造成任何干扰。这一新阶段的工作预计将于今年年底开始。这个地下网络最终将能够每小时运送多达4400人。\n钻探公司目前正在与美国其他城市协商在拉斯维加斯以外部署这类项目。洛杉矶正在考虑一个项目，芝加哥也在考虑另一个项目，这两个城市也交通拥堵。", "note_en": "The Boring Company ContinuesExpansion Plans as Elon Musk has been granted permission to extend histunnel under Las Vegas. This tunnel will link the city from one end to theother, reducing the crossing time from 30 minutes to only 3 minutes.\n     This extension followsthe first section completed between the east and west of the Las VegasConvention Center. This network of tunnels under the city would avoid congestionon the main roads.\n      The purpose of the tunnelbuilt by The Boring Company is to reduce the time it takes to cross the city byoffering several stations to serve different destinations located on its axis.The center of Las Vegas, like many large cities, is congested with too muchtraffic.\n        The Boring Companyprovides an original solution by placing vehicles travelling at very high speedunder the city in a tunnel specially designed for this purpose. The vehicleswill be able to reach a top speed of 155 mph, making it possible to link thecity from north to south in only 3 minutes instead of 30 minutes using theusual traffic lanes. The extension of the tunnel could also connect McCarranInternational Airport to the south of the city.\n       &#34;Anextensive network of tunnels at several levels of depth would help reducecongestion in any city. Regardless of the size of a city, it is always possibleto add more levels. »\n   The completion of thisextension will not cause any disruption to air traffic routes thanks to a new,more efficient and economical digging method. Work on this new phase isexpected to begin at the end of the year. This underground network willeventually be capable of carrying up to 4,400 people per hour.\n      The Boring Company iscurrently negotiating with other American cities to deploy this type of projectoutside Las Vegas. One project is being considered for Los Angeles and anotherfor Chicago, which are also congested with traffic.", "posttime": "2020-08-10 22:18:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "埃隆·马斯克,马斯克,musk,城市", "title": "埃隆·马斯克获准扩建拉斯维加斯地下隧道", "title_en": "Elon Musk Gets Approval to Tunnel Expansion Beneath Las Vegas", "transed": 1, "url": "https://www.simturax.com/2020/08/elon-musk-gets-approval-tunnel-expansion-las-vegas.html?m=1", "via": "", "real_tags": ["埃隆·马斯克", "马斯克", "musk", "城市"]}, {"category": "", "categoryclass": "", "imagename": "e63307c15c90efa64fa6c815ef4f2114.jpg", "infoid": 1017334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔·拜登希望在气候变化和工会问题上大放异彩。埃隆·马斯克领先于前者，但落后于后者。\n重要原因：马斯克并不是唯一反对工会的人，但特斯拉被认为是应对气候变化所需新技术的领先者。如果拜登成为总统并兑现他的竞选誓言，马斯克的领导精神可能会成为靶子。\n快速赶上：拜登的气候变化计划呼吁可再生能源在很大程度上取代石油、天然气和煤炭，并大规模建设电动汽车。他还在推动这些清洁能源行业接受工会，而他们基本上还没有这样做。\n特斯拉有望从拜登的气候政策中获得巨大利益，但马斯克有反工会行为的历史。\n现状：去年秋天，一名行政法法官裁定，特斯拉和马斯克在2017年和2018年工人试图组建工会时，公司官员的一系列行动和马斯克的推文违反了联邦劳动法。\n国家劳资关系委员会(National Labor Relations Board)是一个独立的联邦机构，目前正在等待上诉。但现行法律无论如何都不会施加惩罚。直到今天，特斯拉还没有工会。\n福布斯在2019年的一篇文章中报道，特斯拉在加州的大型工厂也因数十起安全违规行为而被传讯。\n最近，工会官员表示，马斯克在疫情爆发期间开设特斯拉工厂，可能违反了其他劳动法，尽管政府官员提出了不同的要求。\n大局：特斯拉介于汽车制造商和科技公司之间，但马斯克是一位典型的硅谷首席执行官，他们中的大多数人通常都会避开工会。美国三大汽车制造商--通用汽车、福特和克莱斯勒--都有工会。在美国历史较少的外国汽车制造商在美国没有工会，科技公司也没有。\n郑重声明：特斯拉的新闻部门没有回应多次置评请求。\n马斯克在Twitter上多次为自己在工人权利方面的记录辩护，他在2018年表示，他并不反对工会，只是反对全美汽车工人联合会(United Auto Workers)。UAW向劳工委员会提交了最初的申诉。\n特斯拉在今年春季提交给美国证券交易委员会(Securities And Exchange Commission)的一份文件中还表示：“特斯拉的员工可以自由地与包括工会在内的任何第三方交往或不交往。”\n拜登竞选团队发言人马特·希尔(Matt Hill)没有具体评论特斯拉，而是笼统地表示，拜登的气候计划将创造“100多万个高薪工会工作岗位，使美国成为生产电动汽车及其零部件的全球领先者。”\n阴谋：跟踪特斯拉的专家表示，该公司不仅错过了在气候问题上领先的机会，也错过了在工人权利方面领先的机会。\n“如果他们决定接受这样一种理念，即员工需要有发言权，员工需要能够参与这项创新创造的财富，那么他们会成为一家更好的公司，也会是一家更成功的公司。”\n-戴夫·福斯特(Dave Foster)，前能源部官员，目前在能源未来倡议(Energy Futures Initiative)研究劳工问题如何运作：拜登最近扩大的气候和能源计划呼吁对劳动法进行全面改革，同时实现积极的目标，摆脱化石燃料。\n该计划规定，建设清洁能源基础设施的工人“必须有权选择加入工会并集体讨价还价”。\n该计划支持立法，使工人更容易进行集体讨价还价。拜登说，如果高管进行干预，他还将追究他们“个人责任”。\n强大的众议院筹款委员会(House Ways And Means Committee)主席、马萨诸塞州民主党众议员理查德·尼尔(Richard Neal)今年夏天早些时候说，他希望将电动汽车纳入即将出台的立法中，这些立法将为劳动力标准更高的可再生能源公司提供更大的激励。如果拜登获胜，该法案与电动汽车零部件一起通过的可能性将大大增加。\n他们的意思是：“拜登的意思是，你终于可以在美国劳动法中占有一席之地了，”美国劳工联合会-产联(AFL-CIO)前全国组织主任理查德·本辛格(Richard Bensinger)说。\n“通过追究马斯克个人的责任，这可能会阻止马斯克像往常一样破坏工会。目前的法律没有惩罚，只有补救措施，也没有个人责任，“本辛格说，他也是全美汽车工人联合会(United Auto Workers)的前组织主任。\n“这将对组织像特斯拉这样的地方产生很大影响，因为这将让这些业主承担责任，让他们为抗争美国工人组织工会的权利负责。”\n是的，但是：与大多数大胆的竞选承诺一样，这一承诺在很大程度上依赖于国会对拜登目标的支持。如果参议院仍然由共和党控制(这一前景看起来不太确定)，拜登想要的很多东西都不会发生。", "note_en": "Joe Biden wants to go big on climate change and big on unions. Elon Musk leads on the former but lags on the latter.\n Why it matters: Musk isn’t uniquely averse to unions, but Tesla is considered a leader on the type of new technologies needed to tackle climate change. Musk’s leadership ethos could be in the crosshairs if Biden becomes president and follows through on his campaign vows.\n Catch up fast: Biden’s  climate-change plan calls for renewable energy to largely replace oil, natural gas and coal and for a huge buildout of electric vehicles. He is also pushing for these clean-energy industries  to embrace unions, which they largely have not.\n Tesla is poised to benefit greatly from Biden’s climate policies, but Musk has a history of anti-union behavior.\n Where it stands:An administrative law judge  ruled last fall that Tesla and Musk broke federal labor laws during a series of actions by company officials and  tweets by Musk in 2017 and 2018 as workers were trying to form a union.\n An appeal is pending at the National Labor Relations Board, an independent federal agency. But  current law doesn’t impose penalties regardless. To this day, Tesla doesn&#39;t have a union.\n Tesla has also been cited for  dozens of safety violations at its massive plant in California, Forbes  reported  in a 2019 article.\n More recently,  union officials say Musk may have broken other labor laws by opening Tesla’s plant during the pandemic  despite government officials requesting otherwise.\n The big picture: Tesla falls somewhere between automaker and tech company, but Musk is a classic Silicon Valley CEO, most of whom generally eschew unions. America’s three major automakers — General Motors, Ford and Chrysler — all have unions. Foreign automakers with less history in the U.S. don’t have unions here, and neither do tech companies.\n For the record: Tesla’s press department didn&#39;t respond to multiple requests for comment.\n Musk has defended his record on worker rights several times on Twitter,  saying in 2018 that he is not opposed to unions generally,  just the United Auto Workers. UAW filed the original complaint with the labor board.\n Tesla also said in a  document filed with the Securities and Exchange Commission this spring: “Tesla’s employees are free to associate or refrain from associating with any third parties, including labor unions.”\n Biden campaign spokesman Matt Hill didn’t comment on Tesla specifically, and instead said generally that Biden’s climate plan will create “more than one million good-paying union jobs to make America a global leader in producing electric vehicles and their parts.”\n The intrigue: Experts following Tesla say the firm is missing an opportunity  to lead not only on climate,  but on worker rights too.\n “They would be a better company and a more successful company if they decided to embrace the idea that employees need to have a voice and employees need to be able to participate in the wealth that is created by this innovation.”\n — Dave Foster, former Energy Department official now working on labor issues at the Energy Futures Initiative  How it works: Biden’s  recently expanded climate and energy plan calls for sweeping changes to labor laws, along with aggressive goals to transition away from fossil fuels.\n Workers building clean-energy infrastructure “must have the choice to join a union and collectively bargain,” the plan states.\n The plan supports  legislation making it easier for workers to collectively bargain. Biden says he would also hold executives “personally liable” if they interfere.\n Democratic Rep. Richard Neal of Massachusetts, who chairs the powerful House Ways and Means Committee,  said earlier this summer he wants to include electric vehicles in pending legislation that would provide greater incentives for renewable-energy companies with stronger labor standards. The potential of that bill passing with an electric-vehicle component would increase greatly if Biden wins.\n What they&#39;re saying: “What Biden is suggesting is that you finally have some teeth in U.S. labor laws,” said Richard Bensinger, a former national organizing director of the AFL-CIO.\n “By holding Musk personally accountable it might deter Musk from his usual union busting. The current law has no penalties, only remedies and no individual liability,” said Bensinger, who was also a former organizing director of the United Auto Workers.\n “This will make a big difference in organizing places like Tesla because it will take these owners and hold them accountable for fighting the right of American workers to organize a union.”\n Yes, but: As with most bold campaign promises, this one relies heavily on Congress supporting Biden’s goals. If the Senate remains in Republican control (a prospect that&#39;s looking less certain), a lot of what Biden wants won&#39;t happen.", "posttime": "2020-08-10 21:52:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,biden,elon,工会", "title": "乔·拜登(Joe Biden)推动清洁能源工会工作可能迫使他与埃隆·马斯克(Elon Musk)摊牌", "title_en": "Joe Biden’s push for clean-energy union jobs could force showdown with Elon Musk", "transed": 1, "url": "https://www.axios.com/biden-elon-musk-unions-582e5ea6-7e38-4357-974e-a20103c0366d.html", "via": "", "real_tags": ["埃隆·马斯克", "biden", "elon", "工会"]}, {"category": "", "categoryclass": "", "imagename": "e7cd7233d7f9cfcd91e7115099a75419.jpg", "infoid": 1017333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上月底，CES的组织者召集了一场Audible，取消了2020年的面对面科技展。这一消息似乎导致总部位于柏林的IFA背后的力量加倍努力，为即将到来的活动传递信息。在9月份的节目之前，IFA特别积极地试图将这一消息传播出去。\n以8月4日的新闻稿“IFA 2020特别版：IFA全球新闻发布会上的新闻公告不间断--全球品牌为即将到来的年终购物季推出他们的最新产品、新闻和服务”为例。我看过比这个主题行还短的新闻稿。关键是，这场秀可以而且必须继续下去，尽管，嗯，一切都是如此。\n然而，今天上午，组织者宣布，这次展会将跳过一年，以参加大会的关键活动之一-全球市场。该活动于2016年启动，旨在将OEM/OEM、零售商和分销商聚集在一起。这一次，新闻稿的主题行写着，希望是“IFA 2020特别版：尽管业界高度关注，IFA全球市场仍推迟到2021年”，并打出了“科技回归”的横幅。IFA指出，事实证明，这次旅行对与会者来说是一个问题，特别是那些来自亚洲市场的人。\nIFA执行董事延斯·海瑟克(Jens Heithecker)在新闻稿中表示：“(P)持续的旅行限制阻止亚洲公司参加在柏林举行的现场活动。”“在这种情况下，许多人不得不将参加IFA Global Markets的时间推迟到明年。消费和家用电子行业内的泛亚洲供应商占IFA全球市场参展商的主要部分。“。\nIFA是今年选择亲自举办的极少数科技展之一，尽管有一些之前概述的保障措施和限制，包括对参观者的限制。今天公布的一项针对德国企业的最新民意调查显示，面对该国不断增加的新冠肺炎案件，对公共生活的限制预计还将持续8.5月。", "note_en": "Late last-month, CES’s organizers called an audible,  canceling the in-person tech show for 2020. The news seemingly cause the forces behind Berlin-based IFA to double down on the messaging for their upcoming event. Ahead of the September show,  IFA   has been particularly aggressive in attempting to get the word out.\n Take the  August 4 press release, “IFA 2020 Special Edition: News Announcements non-stop at the IFA Global Press Conference – Global Brands unveil their latest Products, News and Services for the upcoming end-of-the-year Shopping Season.” I’ve seen press releases shorter than that subject line. The point is, the show can and must go on, in spite of, well, everything.\n This morning, however, organizers announced that the show will be skipping a year for one of the conference’s key events, Global Markets. Launched in 2016, the event is designed to bring together OEMs/ODMs, retailers and distributors. This time, the press release subject line reads, hopefully, “IFA 2020 Special Edition: IFA Global Markets postponed to 2021 despite industry’s high interest” and sports a “Tech is Back” banner. IFA notes that the travel was proving to be an issue for attendees, particularly those coming from Asian markets.\n  “[P]ersistent travel restrictions prevent Asian companies from joining the live event in Berlin,” IFA Executive Director Jens Heithecker said in the release. “Under these circumstances, many had to postpone their participation in IFA Global Markets to next year. Pan-Asian suppliers within the consumer and home electronics industry account for a major part of IFA Global Markets exhibitors.”\n IFA is one of exceedingly few tech shows that have opted to go ahead in person this year, albeit with a number of  previously outlined safeguards and restrictions, including a limit on attendees. A  new poll of German businesses released today notes that restrictions on public life are expected to last another 8.5 months, in the face of  a rising number of COVID-19 cases in the country.", "posttime": "2020-08-10 21:51:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "取消,full,ifa", "title": "\nIFA取消全球市场活动，但组织者表示，其余展会策划工作正在如火如荼地进行", "title_en": "\n\t\t\t\tIFA cancels Global Markets event, but organizers say rest of show planning is in ‘full swing’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/ifa-cancels-global-markets-event-but-organizers-say-rest-of-show-planning-is-in-full-swing/", "via": "", "real_tags": ["取消", "full", "ifa"]}, {"category": "", "categoryclass": "", "imagename": "e79f84ae0d1c99c81d1e30786ce4ac3c.jpg", "infoid": 1017331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有传言称，苹果公司(Apple)AAPL将在今年秋天发布有史以来最便宜的顶级手机。\n颇具影响力的科技杂志“汤姆指南”最近发布了一则消息，称iPhone12的零售价将从549美元起。这几乎是苹果几年前iPhone X售价的一半。\n泄密事件发生在苹果发布第二款“经济型”手机iPhone SE后不久，这款手机的售价为399美元。这比第一部iPhone便宜100美元。\n这就提出了一个问题：为什么最高端的科技产品制造商突然开始卖空自己？正如我稍后将展示的那样，苹果的业务正在进入一个新时代，在这个时代，iPhone的利润将不再重要。\n低价标签看起来似乎是为了抵御竞争而不顾一切的举动。但就像一位国际象棋大师计划下几步棋一样，苹果正在用廉价手机抓住苹果首席执行官蒂姆·库克所说的“所有机会之母”。\n毫无疑问，iPhone是历史上最成功的产品。自推出以来，苹果售出了价值超过1万亿美元的iPhone。多年来，iPhone创造了苹果总销售额的一半以上。\n但iPhone不仅仅是苹果最大的摇钱树。它是苹果公司进入超过10亿人口袋的门户。\n请看这张图表。它展示了苹果活跃设备在世界各地的增长情况：\n多亏了iPhone，苹果现在拥有15亿活跃设备-手机、手表等-被来自世界各地的超过10亿人使用。仅在过去的几年里，该公司就增加了惊人的5亿台设备。\n想想看，现在近七分之一的人每天都会随身携带一台苹果设备。\n今天，这15亿台活跃设备是苹果业务最重要的单一驱动力。甚至比手机销售本身更重要。因为苹果每天都能从他们身上赚到越来越多的钱。\n接受付款。任何人每次使用iPhone购物，苹果都会赚钱。当他们在当地的杂货店用Apple Pay付款时，苹果会得到提成。当他们从App Store购买应用程序时，苹果公司会从中分得一杯羹。\n此外，还有一套订阅服务，苹果可以方便地将其塞进iPhone持有者的脸上。\n首先，苹果销售一项非常昂贵的保修和保险服务-AppleCare-相当于手机价格的五分之一左右。然后是iCloud云服务和杂志订阅服务Apple News。\n2015年，苹果还推出了音乐流媒体服务Apple Music。在短短四年内，Apple Music的订户增长到6800万，并成为世界第二大音乐流媒体公司。\n去年，苹果与Apple TV+一起加入了视频流竞赛。苹果没有报道其订阅量，但几个消息来源称订阅量在1000万到3000万之间。\n苹果服务业务中最不显眼，但却非常有利可图的一面是授权。苹果向公司收取数十亿美元的费用，让它们在苹果设备上获得服务或应用程序。例如，谷歌GOOGL每年向苹果支付高达70亿美元，让其成为iPhone上的默认搜索引擎。\n还有更多规模较小的苹果服务我没有提到。他们每个人赚的钱都比你想象的要多。\n让我给你展示一下现在关于苹果最重要的图表。它显示了苹果近年来从服务与产品中赚取了多少利润：\n2017年，苹果产品获得了利润的最大份额，而服务仅占15%。今天，服务带来了苹果总毛利润的一半以上-而苹果刚刚涉足这一行业。\n现在，苹果将目光投向了一个更大的市场份额：企业服务。这是一个如此有利可图的行业，以至于苹果首席执行官蒂姆·库克称其为“所有机会之母”。\n你可能还没有注意到这一点，但苹果已经在采取行动，试图涉足这一领域。在新闻头条背后，它已经开始吞并拥有针对企业的技术的公司。\n上个月，苹果收购了Fleetsmith，这是一家帮助企业在不同工作场所部署和跟踪苹果设备的软件公司。这是苹果计划的一部分，目的是让企业使用苹果设备，进而使用其企业服务。\n几周前，苹果收购了Mobeewave，这是一家拥有可以将iPhone变成移动支付终端的技术的公司。这项技术将使苹果公司获得价值690亿美元的庞大销售点终端产业。\n我预计未来会有越来越多的类似收购，可能很快就会演变为苹果最有利可图的服务套件。\n这就是为什么苹果不再关心iPhone价格的原因。它的目标很简单，就是不惜一切代价把越来越多的手机送到人们手中。因为携带iPhone的人越多，购买苹果服务的人就会越多。\n上个季度，苹果在服务领域的销售额创下了历史新高。但随着苹果进军赚钱的企业服务领域，我相信苹果的增长故事才刚刚开始。出于这个原因，苹果股票位居我观察名单的首位。", "note_en": "Rumor has it that Apple (APPL)    AAPL  will release its  cheapest  ever top-tier phone this fall.\n  Influential tech magazine  Tom’s Guide recently posted a leak claiming iPhone 12 will retail starting at $549. That’s almost  half of what Apple charged for iPhone X a few years ago.\n  The leak came shortly after Apple released its second “budget” phone, iPhone SE, which sells for $399. That’s a hundred bucks less than the first iPhone.\n  This raises the question: Why is the most  premium tech product maker all of a sudden selling itself short? As I’ll show in a moment, Apple’s business is entering a new era where iPhone profits won’t matter anymore.\n    Low price tags might seem like a desperate move to fend off competition. But like a chess master plotting several moves ahead, Apple is using cheap phones to seize what Apple’s CEO, Tim Cook, calls the “mother of all opportunities.”\n     iPhone is hands-down the most successful product in history. Since its introduction, Apple sold more than a trillion dollars’ worth of iPhones. And for years, iPhone generated more than half of Apple’s total sales.\n    But iPhone was more than Apple’s biggest money maker. It was Apple’s gateway into the pockets of over a billion people.\n  Take a look at this chart. It shows the growth of Apple’s active devices all across the world:\n    Thanks to iPhone, Apple now has 1.5 billion active devices—phones, watches, etc.— used by over a billion people from all across the world. The company added a whopping half billion devices during the last few years alone.\n  Think about it, nearly one in seven people now carry around an Apple device every day.\n  Today, those 1.5 billion active devices are the single most important driver of Apple’s business. Even more important than phone sales alone. Because every day Apple earns more and more money from them.\n      Take payments. Apple earns money every time anyone uses an iPhone to shop. When they pay at a local grocery store with Apple Pay, Apple gets a cut. When they buy an app from the App Store, Apple gets a cut.\n  Then there’s a suite of subscription services that Apple conveniently shoves into the faces of iPhone holders.\n  For starters, Apple sells a very steep warranty and insurance service—AppleCare—which amounts to about one-fifth of the phone price. Then there’s the iCloud cloud service and the magazine subscription service, Apple News.\n  In 2015, Apple also launched its music streaming service, Apple Music. In just four years, Apple Music grew to 68 million subscribers and became the world’s second biggest music streamer.\n  Last year, Apple joined the video streaming race with Apple TV+. Apple hasn’t reported on its subscriptions, but several sources pegged the number at 10-30 million.\n  The least visible, yet very lucrative, side of Apple’s services business is licensing. Apple charges companies billions of dollars to get their services or apps on Apple devices. For example, Google    GOOGL  pays Apple a whopping $7 billion a year to be the default search engine on iPhones.\n  There are many more smaller Apple services I haven’t mentioned. And every one of them pulls in more money than you might think.\n    Let me show you the most important chart about Apple right now. It shows how much of its profits Apple earned from services vs. products in recent years:\n    In 2017, Apple products earned the lion’s share of their profits while services made up just 15%. Today, services bring in more than half of Apple’s total gross profits—and Apple has just barely dipped its toes in this industry.\n    Now Apple has set its sights on a much larger bite of the apple: enterprise services. It’s such a lucrative industry that Apple’s CEO, Tim Cook, calls it the “mother of all opportunities.”\n  You probably haven’t noticed it, but Apple is already making moves to get its foot in there. Behind the headlines, it has started gobbling up companies with technologies aimed at businesses.\n  Last month, Apple bought Fleetsmith, a software company that helps businesses deploy and track Apple devices across workplaces. This is part of Apple’s plan to get businesses to use Apple devices, and in turn, its enterprise services.\n  A few weeks ago, Apple bought Mobeewave, a company with technology that could turn iPhones into mobile payment terminals. This technology will get Apple’s hands on a massive $69 billion point-of-sale terminal industry.\n  I expect more and more similar acquisitions down the line that could soon morph into the most lucrative suite of Apple’s services.\n      That’s why Apple doesn’t care about iPhone prices anymore. It’s goal is simply to put more and more of its phones in people’s hands—at any cost. Because the more people carry iPhones, the more people will buy Apple services.\n    Last quarter, Apple’s sales from services roared to an all-time record. But with its push into money-spinning enterprise services, I’m convinced Apple’s growth story is just starting. For this reason, Apple stock sits at the top of my watch list.", "posttime": "2020-08-10 21:49:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,era", "title": "苹果的新纪元已经开始", "title_en": "Apple’s New Era Has Begun", "transed": 1, "url": "https://www.forbes.com/sites/danrunkevicius/2020/08/10/apple-new-era-has-begun/#3ad4e9b34072", "via": "", "real_tags": ["apple", "苹果", "era"]}, {"category": "", "categoryclass": "", "imagename": "5eec94a780ec2adfe48d6e54a6a973d2.jpg", "infoid": 1017330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，如果你希望这意味着标准的“我的世界”游戏现在也可以在Chromebook上使用，恐怕我得让你失望了。教育版不仅需要微软365 for Education(A3或A5)许可证，而且它更像是一种教育工具，而不是游戏，课程重点是数学、科学、语言艺术、历史和视觉艺术。\n该公司表示，它正在与谷歌教育团队合作，欢迎Chromebook教育进入“我的世界”。\nChromebook版本将提供与Windows、Mac和iOS上的“我的世界：教育版”相同的一套功能，包括跨平台的多人支持。目前，学生需要一个微软账号才能登录，不过该公司表示，“不久的将来”就会支持使用谷歌账号登录。\n微软在今天的公告中解释说：“我的世界：教育版是一个基于游戏的学习平台，有助于培养21世纪的关键技能，比如编码和创造性的解决问题。”“游戏中和在线上都提供了数百门免费的符合标准的课程、设计挑战和STEM课程，同时还提供了灵活的模板，供教师设计自己的学习活动。在与课堂保持联系变得格外重要的时候，“我的世界”支持协作和有意义的学生主导的学习。“。\n“我的世界：教育版”现已在谷歌Play商店面向拥有相应许可证的用户出售。尽管有一个明确的警告，它需要Office365教育账号才能登录，但你会看到很多失望的玩家给出的一星级评论，他们认为这是普通的“我的世界”。不过，有了合适的Chromebook，这些玩家也可以在Chrome OS上玩Android版的“我的世界”。", "note_en": "Now, if you were hoping that this means that the standard Minecraft game is now available on Chromebooks, too, I’m afraid I’ll have to disappoint you. The Education Edition not only requires a Microsoft 365 for Education (A3 or A5) license, it’s also meant to more of an educational tool than a game, with lessons that focus on math, science, language arts, history and visual arts.\n The company says that it is partnering with the Google Education team to welcome educations on Chromebooks to Minecraft.\n  The Chromebook version will offer the same set of features as Minecraft: Education Edition on Windows, Mac and iOS, including cross-platform multiplayer support. For now, students will need a Microsoft account to log in, though the company says support for logging in with Google accounts is coming “in the near future.”\n  “Minecraft: Education Edition is a game-based learning platform that helps build key 21st century skills like coding and creative problem solving,” Microsoft explains in today’s announcement. “Hundreds of free standards-aligned lessons, design challenges, and STEM curriculum are available in-game and online, along with flexible templates for teachers to design their own learning activities. In a time when staying connected to the classroom is of extra importance, Minecraft supports collaboration and meaningful student-led learning.”\n The Minecraft: Education Edition is  now available in Google’s Play Store for users with the right licenses. Despite a clear warning that it takes an Office 365 Education account to log in, you’ll see plenty of one-star reviews from disappointed players who think it’s the regular Minecraft. With the  right Chromebook, though, these players could always play  Minecraft for Android on Chrome OS, too.", "posttime": "2020-08-10 21:18:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,教育,education,世界", "title": "\n我的世界：教育版来到Chromebook", "title_en": "\n\t\t\t\tMinecraft: Education Edition comes to Chromebooks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/minecraft-education-edition-comes-to-chromebooks/", "via": "", "real_tags": ["chrome", "教育", "education", "世界"]}, {"category": "", "categoryclass": "", "imagename": "4cd886ca0f0dce868c6bc7c53177d10b.jpeg", "infoid": 1017329, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据他们的主管称，苏、兰德尔、科林和鲍比是田纳西州孟菲斯联邦快递世界枢纽公司最可靠的四名员工。每个人每天都要稳定工作8小时，每小时将大约1300个包裹从垃圾箱分拣到传送带上-白班4个小时，晚上4个小时。他们几乎从不休息，但由于他们仍在工作中学习，他们确实会定期打电话给设施中的同事寻求帮助。例如，苏在通常用来装运衣服的软袋上遇到了一些麻烦。\n这四名工人实际上是260磅的工业机器人手臂。它们由伊利诺伊州沃基根的安川美国公司制造，配备了圣安东尼奥的Plus One Robotics的计算机视觉和人工智能。\n联邦快递快递(FedEx Express)技术研究和规划团队高级顾问亚伦·普拉瑟(Aaron Praise)表示，在同样的角色下，他们的工作速度只有熟练工人的一半左右，但他们正迅速成为保持包裹通过世界上最大的航空货运设施的机器和人员链中的重要组成部分。\n而联邦快递公司(FedEx Corp.)、德国邮政DHL集团(Deutsche Post DHL Group)、联合包裹服务公司(United Parcel Service Inc.)。和亚马逊公司(Amazon COM Inc.)。长期以来，这些机械臂一直依赖价值数十亿美元的自动化来将包裹快速送到客户手中-从沿着一条或另一条路径分流包裹的传送带，到在整个货架上穿梭的引导车辆-这些机械臂是不同的。它们是有史以来出现在联邦快递设施中的第一批此类机械臂，也是世界上最早日常使用这项技术的例子之一。\n这些机器人代表了自动化的重要发展趋势，尤其是机器人技术。这里的新鲜事是，现有的机器同时拥有“眼睛”和“大脑”，使它们能够感知和响应。对于机器人来说，这通常意味着增加摄像头，这与手机上的摄像头没有太大区别，手机上的摄像头可以感知可见光。计算机视觉还可以包括使用其他技术来感知深度的传感器。与此同时，机器人的“大脑”是用人工智能构建的，通常是某种形式的机器学习，这是一个广泛的类别，从Alexa对我们声音的理解到可以自学如何在棋盘游戏中击败人类的系统，应有尽有。这种人工智能给现有的机器人和其他机器带来了前所未有的适应性水平。事实上，新的灵活性和智能性使他们第一次能够在仓储和物流领域的一些最常见的工作中取代人类。\n然而，这些机器人并不是要抢走这些行业的所有工作岗位。就目前而言，他们主要是填补需求激增带来的空缺，并在可能的情况下给人类一个晋升的机会。在可预见的未来，随着工作需求的变化，人类的适应能力将会更强。\n支持者认为，至少出于三个原因，让机器人扮演这些角色是必要的。\n首先，电子商务的爆炸式增长意味着送货到家的包裹数量激增。根据以邮资计时器闻名的Pitney Bowes的数据，2018年全球约有870亿个包裹发运-相当于美国每人每年40个包裹-到2025年，这一数量将翻一番以上。在大流行期间，这一数字的增长速度远远快于预期。UPS表示，在截至6月份的季度里，从企业运往家庭的包裹数量比去年同期激增了65%。\n其次，由于新冠肺炎案件的增加，新的和正在进行的全职订单减少了，即使是基本业务的工人也减少了。第三，仓库和其他物流设施内需要社会距离，这意味着自动化可以在帮助工人完成工作方面发挥作用，而不是直接相邻。\n尽管失业现象普遍存在，但物流业的公司仍然发现很难足够快地招聘人员。普拉瑟说，联邦快递在孟菲斯的航空枢纽目前有500个职位空缺。他补充说，甚至在大流行之前，仓库和分拣中心就出现了劳动力紧缩，因为该行业的许多工作既要求体力，又枯燥乏味，导致人员流失率高，招聘方面也面临挑战。\n“这从来不是关于‘机器人能打败人类吗？’”Plus One Robotics的创始人埃里克·尼维斯(Erik Nieves)说。“这是关于孟菲斯每晚短缺一千人的问题，别无选择。”\n联邦快递和其他公司聘请的一些人可以承担更高级别的监督角色，受伤风险更低，从而扩大新兴的机器人技术支持部门。\n联邦快递目前在孟菲斯的设施中有四个这样的机器人，但该公司估计，一个人可以照顾多达八个机器人，只有当他们有自己无法解决的问题时才会跳出来，比如包裹被传送带卡住并阻塞了传感器。与此同时，在圣安东尼奥的Plus One指挥中心，当机器人遇到无法识别的包裹或其他逻辑困难时，人们随叫随到，甚至在需要任何人在现场干预之前，就可以帮助它远程引导。\n为这些机器手臂提供动力的人工智能一直在学习，但总有一些情况会让它绊倒，需要人工干预。任何数量的人工智能，至少是现在存在的那种，都不能处理每一种可能的“边缘情况”，这些意外情况单独来说是罕见的，但当综合考虑时，它们是相当常见的。这一大堆边缘案例是完全自主的人工智能系统的主要障碍。\n风险投资公司Playround Global的创始合伙人布鲁斯·利克(Bruce Leke)表示，对于任何自动化电子商务的尝试来说，“挑战是人类是令人难以置信的。”“25年前，亚马逊还不存在，”他补充道，“如今，他们有100多万直接员工。人是可培训的、灵活的、有弹性的和智能的，而自动化和机器人不是这些东西。“。(亚马逊的一位女发言人表示，该公司目前有87.6万名员工。)。\n利克是总部位于马萨诸塞州萨默维尔的Right Hand Robotics的投资者，该公司生产类似的人工智能驱动、配备摄像头的拾取系统。它的技术被少数几家公司使用，包括日本的Paltac，一家消费包装商品的批发商。\n许多其他初创公司最近都获得了资金或宣布了销售机器人拣选系统的交易，包括CoVariant、Osaro、Dexterity、Pickle Robot Company、XYZ Robotics、Fizyr、Mujin和Dorabot。此外，像Daifuku、Dematic和Honeywell这样的老牌系统集成商将这些初创公司和老牌工业机器人制造商的技术结合在一起，包括安川、Universal Robots、ABB Kuka、Fanuc等。\n尽管有这样一系列的活动，但世界上绝大多数的工业机器人手臂仍然是那种“哑巴”：它们一遍又一遍地重复同样的动作-例如，在汽车生产线上反复将相同的部件焊接在一起。在完成电子商务订单的仓库中，大多数自动化包括各种分拣技术。\n至少在公开场合，亚马逊自己还没有将机器人手臂投入到人类的拣选和分拣工作中。虽然亚马逊是移动货架和帮助分拣包裹的机器人的狂热生产商和消费者，但亚马逊仍然使用人类来完成将商品从货架或垃圾箱中取出，并将其放入其他垃圾箱或传送带上的任务。亚马逊机器人公司(Amazon Robotics)副总裁布拉德·波特(Brad Porter)表示，该公司庞大且快速变化的库存仍然击败了人工智能、计算机视觉和抓手的最佳组合。\n“人们总是需要支持我们履行中心的自动化，”他补充说。我们看到新技术提高了安全性，加快了交付时间，并在我们的网络中增加了效率；我们将这些节省的效率再投资于为客户提供的新服务，从而创造新的就业机会。“。\n虽然这项技术很适合分拣包裹，就像联邦快递一样，而且可以处理有限范围的物品，就像在Paltac一样，但可能在很长一段时间内，拣选技术的圣杯-可以处理与人类相同种类的机器人-将仍然遥不可及，就像我们还没有创造出一种可以处理人类可以处理的各种道路情况的自动车辆一样。\n尼维斯说，机器人突然流行的一个原因是，它们可以在不完全重新设计仓库内部的情况下完成与人类相同的工作。“这些机械臂很有意义，”联邦快递的普拉瑟先生说，“因为我们不能就这样拆了大楼，然后说，‘好吧，大家等一年，直到我们有了新的。’”\n但是，当这些大公司中的一家确实建造了一座新设施，使用的是过去几年才出现的那种技术时，情况就不同了。例如，许多为联邦快递地面服务分拣包裹的仓库比其孟菲斯航空枢纽要新。联邦快递地面公司(FedEx Ground)负责运营技术和创新的董事总经理泰德·登格尔(Ted Dengel)表示，这些设施是如此完全自动化，例如，有了智能传送带，被称为“鞋子分拣机”，人们只有在包裹用卡车运进这些建筑，或者用不同的卡车离开时，才会触摸包裹。\n因此，除非世界上每一家工厂和配送中心都重新设计为“黑暗”运行，也就是说，没有任何人力参与，否则这些具有独特挑战性的任务将受益于人类的大脑和身体-或者至少是一份合理的传真机。\n-有关WSJ Technology的更多分析、评论、建议和头条新闻，请订阅我们的每周时事通讯。", "note_en": "Sue, Randall, Colin and Bobby are four of the most reliable workers at the  FedEx Express   World Hub in Memphis, Tenn., according to their supervisors. Each clocks eight hours a day of steady work, sorting around 1,300 packages an hour from bins onto a conveyor—four hours on the day shift and another four at night. They almost never take breaks, but since they’re still learning on the job, they do regularly call on coworkers in the facility for help. Sue, for instance, has had some trouble with the soft bags in which clothing is typically shipped.\n  The four workers are actually 260-pound industrial robot arms. Manufactured by Waukegan, Ill.-based  Yaskawa America    6506  -1.66%  they are equipped with computer vision and artificial intelligence from San Antonio-based Plus One Robotics.\n  They work only about half as fast as skilled humans in the same roles, but they are quickly becoming an important part of the chain of machines and people that keep packages flowing through the world’s largest air freight facility, says Aaron Prather, senior advisor of the technology research and planning team at FedEx Express.\n  While companies such as FedEx Corp., Deutsche Post DHL Group, United Parcel Service Inc. and  Amazon  com Inc. have long relied on billions of dollars worth of automation to get packages to customers quickly—from conveyors that divert packages down one path or another to guided vehicles that shuttle about entire shelves of goods—these robot arms are something different. They’re the first arms of their kind to ever appear in a FedEx facility, and among the earliest examples of the day-to-day use of this technology anywhere in the world.\n    These robots typify an important and growing trend in automation in general, and robotics in particular. What’s new here is that existing machines are getting both “eyes” and “brains” that allow them to sense and respond. For robots, this generally means the addition of cameras not so different from the ones in cellphones, which perceive visible light. Computer vision can also include sensors that use other technologies in order to perceive depth. Meanwhile the “brains” of the robot are built with artificial intelligence, generally some form of machine learning, a broad category that enables everything from Alexa’s understanding of our voices to systems that can teach themselves how to beat humans at board games. This AI gives existing robots and other machines a level of adaptability not before seen. In fact, the new flexibility and intelligence make them able, for the first time, to replace humans in some of the most common jobs in warehousing and logistics.\n    It’s not as if these robots are about to steal all the jobs in these industries, however. For now, they’re mostly filling vacancies created by surging demand and, where possible, giving humans a chance for promotion. For the foreseeable future, humans will prove more adaptable as work needs change.\n  Proponents argue that bringing robots into these roles is necessary for at least three reasons.\n  First, the explosion of e-commerce means an explosion in the volume of packages shipped to homes. About  87 billion parcels were shipped worldwide in 2018—that’s 40 a year to every person in America—and this volume will more than double by 2025, according to  Pitney Bowes, best known for its postage meters. The number has grown much faster than expected during the pandemic.  UPS said in the quarter ending in June, the  volume of packages shipped from businesses to homes surged by 65%  from a year before.\n  Second, with new and ongoing stay-at-home orders due to increasing Covid-19 cases, the availability of workers even for essential businesses is reduced. Third, the need for social distancing within warehouses and other logistics facilities means automation can play a role in helping workers do their jobs without being directly adjacent to one another.\n  Despite widespread unemployment, companies in the logistics industry are still finding it hard to hire people fast enough. FedEx’s air hub in Memphis currently has 500 job openings, says Mr. Prather. Even before the pandemic, warehouses and sorting centers had a labor crunch because many of the jobs in the industry are both physically demanding and dull, leading to high turnover and challenges with recruitment, he adds.\n    “This has never been about, ‘Can a robot beat a human?’” says Erik Nieves, founder of Plus One Robotics. “This is about how they’re a thousand people short every night in Memphis, and there is no alternative.”\n  Some of the humans FedEx and others do hire could take on higher-level supervisory roles, with less risk of injury, expanding the burgeoning sector of  robot tech support.\n  FedEx currently has four of these robots at its Memphis facility, but the company estimates one human could tend up to eight of them, jumping in only when they have a problem they can’t solve on their own, like when packages get caught in a conveyor and block a sensor. Meanwhile, at the Plus One command center in San Antonio, people are on call to help guide the robot remotely when it encounters a package it can’t identify or some other logical difficulty, even before anyone is needed to intervene on site.\n  The AI that powers these robot arms is learning all the time, but there are always situations that trip it up and  require human intervention. No amount of AI, at least of  the sort that exists now, can handle every possible “edge case,” those unexpected situations which are individually rare but quite common when considered all together. This galaxy of edge cases is a  major barrier to fully autonomous AI systems.\n  For any attempts to automate e-commerce, “the challenge is that humans are incredible,” says Bruce Leak, founding partner at venture capital firm Playground Global. “Twenty-five years ago Amazon didn’t exist,” he adds, “and today they have more than a million direct employees. People are trainable, flexible, resilient and intelligent, and automation and robots aren’t any of those things.” (Amazon currently has 876,000 employees, says a spokeswoman for the company.)\n  Mr. Leak is an investor in RightHand Robotics, based in Somerville, Mass., which makes a similar AI-powered, camera-equipped picking system. Its technology is used by a handful of companies, including Japan’s  Paltac  a wholesaler of consumer packaged goods.\n    Many other startups have recently received funding or announced deals to sell robotic picking systems, including Covariant, Osaro, Dexterity, Pickle Robot Company, XYZ Robotics, Fizyr, Mujin and Dorabot. In addition, established systems integrators like Daifuku, Dematic and  Honeywell bring together technologies from these startups and established makers of industrial robots, including Yaskawa, Universal Robots,  ABB  Kuka, Fanuc and others.\n  Despite this flurry of activity, the overwhelming majority of industrial robot arms in the world are still the “dumb” kind: They repeat the same action over and over again—for example welding the same parts together repeatedly on an automobile production line. In warehouses where e-commerce orders are filled, most automation consists of various sorting technologies.\n  Amazon itself has yet to move robot arms into the human job of picking and sorting, publicly at least. While the company is an avid producer and consumer of robots that move shelves and help sort packages, Amazon still uses humans to accomplish the task of taking goods off of shelves or out of bins and putting them into other bins or on conveyors. The company’s enormous and quickly changing inventory still defeats even the best combination of AI, computer vision and gripper, says Brad Porter, vice president at Amazon Robotics.\n  “There will always be a need for people to support the automation in our fulfillment centers,” he adds. “We see new technologies increasing safety, speeding up delivery times, and adding efficiencies within our network; we re-invest those efficiency savings in new services for customers that lead to the creation of new jobs.”\n  While this technology is great for sorting packages, as at FedEx, and dealing with a limited range of items, as at Paltac, it’s possible that the holy grail of picking technology—a robot that can handle the same variety as a human—will remain out of reach for a long time, in the same way we have yet to create an autonomous vehicle that can handle  the same variety of road situations a human can.\n  One reason for the sudden popularity of robots, says Mr. Nieves, is they are a way to do the same job as a human without completely re-engineering the inside of a warehouse. “These robot arms make a lot of sense,” says FedEx’s Mr. Prather, “because we can’t just tear down the building and say, ‘OK, everyone wait a year until we have a new one.’”\n  But when one of these big players does build a new facility, using the sort of technology that’s only become available in the past few years, things are different. For example, many of the warehouses where packages are sorted for FedEx’s ground service are newer than its Memphis air hub. These facilities are so completely automated with, for instance, smart conveyors known as “shoe sorters,” humans only touch packages when they’re brought into these buildings on trucks, and when they exit them on different trucks, says Ted Dengel, managing director of operations technology and innovation at FedEx Ground.\n  So until and unless every factory and fulfillment center in the world is re-designed to run “dark,” that is, without the involvement of any human labor, these uniquely challenging tasks will benefit from the human brain and body—or at least a reasonable facsimile.\n  —For more WSJ Technology analysis, reviews, advice and headlines, sign up for  our weekly newsletter.", "posttime": "2020-08-10 21:17:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,机器人,激增,vision", "title": "在对送货到家的需求激增的情况下，像联邦快递这样的托运人越来越多地采用配备计算机视觉和人工智能的工业机器人手臂", "title_en": "Amid an explosion in demand for home-delivered goods, shippers like FedEx are increasingly adopting industrial robot arms equipped with computer vision and AI", "transed": 1, "url": "https://www.wsj.com/articles/as-e-commerce-booms-robots-pick-up-human-slack-11596859205?mod=djemalertNEWS", "via": "", "real_tags": ["人工智能", "机器人", "激增", "vision"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你在一座宏伟城堡的宏伟大厅里。地面铺着厚厚的红地毯，石墙被打磨得熠熠生辉。显然，这座城堡的入口不是为战斗部队的磨损而设计的，而是为迎接像您这样的贵宾而设计的。一块用链条锁在拱形石头天花板上的牌子上写着..。致敬和欢迎来到安东尼·蒂森的叶堡，他是龙的朋友，符文图标的收藏家，风筝的传播者，电脑魔法的魔法师。这是我的家，我在这里研究伟大的网络的计算力，以及我的其他爱好。尽情漫步和探索吧。对于不耐烦的人来说，所有主要感兴趣的区域都可以通过这个门厅中央这个标志下面的五星形心灵传送直接到达。然而，通过参观这座城堡可以发现许多其他地区。别担心，它不是真的那么大！\n在你的左边是一个由符文按钮组成的柔和发光的魔法面板，上面有某种显示器。看起来它能让你看到城堡主人的一些信息。", "note_en": "You are in a grand foyer of a magnificent castle. The floor is decked ina thick red carpet and the stone walls have been polished until it shines.Obviously this castle entrance is not designed for the wear and tear ofcombat troops, but for the greeting of noble visitors such as yourself.  A sign chained to the arched stone ceiling reads... reetings and Welcome,     to Ye Castle of Anthony Thyssen, friend of dragons, collector of runic icons, flyer of kites, and sorcerer of computer magic. This be my home where I study the computational forces of the Great Web, and other hobbies of mine. Feel free to wander and explore.  For the impatient, all the areas of major interest be directly reachable via ye teleportation  pentagram below this sign in the middle of this foyer. However many other area&#39;s can be discovered by exporing the castle. Don&#39;t worry, it isn&#39;t really that big!\nTo your left is a softly glowing magical panel of runic buttons with a displayof some kind. Looks like it lets you see some information about the owner ofthe castle.", "posttime": "2020-08-10 21:16:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安东尼,thyssen,城堡", "title": "安东尼·蒂森的主页(1994)", "title_en": "Anthony Thyssen's Homepage (1994)", "transed": 1, "url": "https://antofthy.gitlab.io/", "via": "", "real_tags": ["安东尼", "thyssen", "城堡"]}, {"category": "", "categoryclass": "", "imagename": "586e0defe0ce03e4f6eb1ed969fd929d.jpeg", "infoid": 1017327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分布式缓存和内存中的键/值数据存储。它既可以作为嵌入式围棋库使用，也可以作为独立于语言的服务使用。\n使用Olric，您可以跨计算机群集即时创建快速、可扩展的共享RAM池。", "note_en": "Distributed cache and in-memory key/value data store. It can be used both as an embedded Go library and as a language-independent service.\n With Olric, you can instantly create a fast, scalable, shared pool of RAM across a cluster of computers.", "posttime": "2020-08-10 21:16:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,independent", "title": "围棋中的分布式内存数据结构。可嵌入或独立的服务", "title_en": "Distributed in-memory data structures in Go. Embeddable or independent service", "transed": 1, "url": "https://github.com/buraksezer/olric/releases/tag/v0.3.0-beta.1#=", "via": "", "real_tags": ["内存"]}, {"category": "", "categoryclass": "", "imagename": "2e49ebf350470beecb9c45355d5ae944.png", "infoid": 1017326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果有一种特定的罪行来定义大流行的当前阶段，那可能是对亚当·扎博罗夫斯基的指控。\n这名35岁的男子走进宾夕法尼亚州伯利恒小镇的一家雪茄店后，当工作人员要求他戴上口罩时，他勃然大怒。取而代之的是，他抓起两支雪茄，没有付钱就离开了。一名店员跟着他走了出去，扎博罗夫斯基向他开枪。警方说，当警方追踪扎博罗夫斯基时，他抓获了一支突击步枪。在与七名警官发生枪战后，扎博罗夫斯基被空运到医院并受到指控。\n他的律师约翰·沃尔德隆(John Waldron)解释说，扎博罗夫斯基“只是没有很好地应对大流行”。\n加拿大也出现了与壮观犯罪有关的明显的大流行偏执狂或压力的反复出现。\n在一起几乎相同的事件中，在多伦多东北部的平房村哈利伯顿(Haliburton)，警方在7月份的一次对峙中击毙了一名男子，此前他在一场关于拒绝戴口罩的争吵中袭击了商店工作人员。\n同月，科里·赫伦(Corey Hurren)在一辆皮卡冲破总理贾斯汀·特鲁多(Justin Trudeau)居住的里多厅(Rideau Hall)大门后被捕，车上装有子弹。据环球新闻报道，赫伦留下了一张纸条，称COVID正在毁掉他的经济，限制措施正在将加拿大变成共产主义独裁政权。\n即使是加拿大最严重的大屠杀也可能有COVID作为触发因素。加布里埃尔·沃特曼(Gabriel Wortman)的一位朋友说，今年4月，加布里埃尔·沃特曼(Gabriel Wortman)“对大流行持偏执态度”，在他装扮成警察并在新斯科舍省杀害22人前不久，他清算了自己的投资，囤积了食物和燃料。\n要迅速地对每一起特定犯罪的原因进行反向工程并不容易。寻找逻辑或答案通常是令人沮丧的。\n然而，关于是什么更广泛地推动犯罪，有一些想法，犯罪和司法研究人员经常收集关于谁在对谁做什么、在哪里、何时以及如何做的大量数据。\n紧急隔离令、关闭边境、疏远社会和强制封锁既不方便，也代价高昂，但人们希望，这至少会考验犯罪真正发生的原因，以及如何预测和减少犯罪的理论，这是前所未有的。\n根据有影响力的美国犯罪学家马库斯·费尔森的说法，新冠肺炎大流行是“历史上最大的犯罪学实验”。“这就像一个天然的实验室，”费尔森在一次采访中说--我们都是被锁定在这种反乌托邦探索中的测试对象。\n德克萨斯州立大学(Texas State University)教授费尔森(Felson)在最近的一篇论文中写道：“‘呆在家里’的命令给人类历史上数十亿人的生活带来了最广泛、最重大和最突然的改变。”他在最近的一篇论文中召集了世界各地的犯罪学家，积极地从悲剧中抓住机会。\n这场大流行肯定会对人们的压力和紧张程度造成一些附带损害。\n“几乎一夜之间，整个国家停止或大幅减少了日常旅行，取消了从家到单位的通勤，以及休闲活动、购物旅行、社交聚会、外出就餐等。\n“在美国和世界各地，这些史无前例的事件的一个积极副产品是犯罪率的大幅下降，”费尔森写道，他与田纳西中部州立大学(Central Tennessee State University)教授本·斯蒂克尔(Ben Stickle)共同撰写了这篇文章。\n然而，犯罪率的下降并不是所有类型的犯罪都是一致的。一些犯罪上升，而另一些犯罪下降。他说，在人类日常生活和活动在很大程度上被冻结的时候，剖析这种兴衰的相互作用可能是关键。\n40多年前，他创立了犯罪的“常规活动理论”，这是一种犯罪学的方法，它不再专注于罪犯来了解犯罪发生的原因，而是着眼于犯罪发生的环境。\n他的前提是，当三件事汇聚在一起时，犯罪就会发生：有能力的犯罪者，合适的目标，以及没有合适的监护人。换句话说，是一种特定的威慑。\n现在，突然间，费尔森看到了用强大的全球数据来检验这一理论的机会，这种方式在新冠肺炎之前是不可想象的，因为伴随着疾病和死亡，这种新颖的冠状病毒让我们陷入了封锁。\n就通常与犯罪相关的广泛因素：贫困、不平等、失业、生物和生理条件而言，与让人们呆在家里一样戏剧性的变化实际上几乎没有什么变化。\n“基本人口没有改变，”费尔森说。他说：“社区的种族组成维持不变。贫穷和不平等不是一夜之间消失或增加的。社会基本结构没有太大变化。“。\n真正发生变化的-突然而显著的-是大量人的日常活动，几乎在全球范围内，犯罪率几乎立即下降了两位数。例行活动理论表明，这是因为封锁阻止了有能力的罪犯实现有价值的目标，或者将监护权从办公室和企业转移到家庭。\n费尔森说，犯罪学家面临的一个问题是，犯罪提供了太多的变量，无法牢牢把握因果关系。这就是为什么他希望犯罪学家抓住这一时刻，这是一个变量明显减少的独特时刻。这场危机提供了一个自然发生的准随机对照试验。\n世界各地的研究人员现在都在应用费尔森的理论来分析COVID限制是如何改变不同社区、城市和地区的犯罪模式的。\n例如，温哥华是澳大利亚犯罪学家的重点，他们研究了该市在封锁的头12周内的犯罪数据。研究人员发现，总犯罪率显著下降，但并不是所有类型的犯罪率都有所下降：例如，商业入室盗窃有所增加。这支持了常规活动理论，因为关闭的企业缺乏积极的守护者，即商店员工和顾客，而他们通常会起到威慑作用。\n这个自然发生的实验将促进我们对犯罪和人类行为的认识，这是其他任何事件都没有做过的。\n在英国，一项研究发现，兰开夏郡以商店行窃为首的举报犯罪总数大幅下降；当大多数商店关闭时，商店扒手无法找到有吸引力的偷窃目标。\n根据斯德哥尔摩一项关于犯罪的研究，COVID对扒手来说也是灾难性的，这种犯罪在一群熙熙攘攘的人身上蓬勃发展。\n几个城市的警察告诉国家邮报，警察看到了类似的犯罪模式变化，包括多伦多、温哥华、埃德蒙顿、渥太华和卡尔加里。\n从3月到6月，多伦多北部的约克地区警察看到总体犯罪率明显下降。\n他说：“我们发现，由於人们留在家中，汽车碰撞及违例驾驶的情况有所下降。”我们看到的其他趋势是特技驾驶违章行为的增加，以及家庭事故的增加。“安迪·帕滕登中士说。“我们将家庭家庭事件的增加归因于更多的人长期呆在家里，因为他们是孤立的。”\n多伦多警方发言人康妮·奥斯本(Connie Osborne)表示，在多伦多，枪支谋杀案似乎不受COVID的影响，而大多数其他犯罪都有所下降。\n她说：“特别是非法闯入事件已经减少，虽然我不能直接将其归因于COVID，但我认为这可以与家里更多的人争辩，因为入室盗窃的可能性较小。”\n对于日常活动理论的支持者来说，这就像猫薄荷；家里的人是阻止针对房主财产的犯罪的典型守护者。\n更难归入任何框架的是成为最大头条新闻的爆炸性犯罪、疯狂的警察枪战、令人痛心的大屠杀，以及可能的暗杀企图。\n新冠肺炎的大范围限制进入第五个月，这一特殊事件的性质正在发生变化：经济损失和经济困难正在增加；封锁有所缓解，但仍然没有疫苗和治疗；戴口罩引发了纠纷。\n轶事和新闻报道表明，其他暴力事件可能与大流行带来的压力、孤独和心理社会变化有关。也许在封锁的情况下，一些人正在失去他们通常的应对机制：酒吧、朋友、教堂、治疗、购物。\n在德克萨斯州立大学任教的加拿大健康犯罪学家亚当·沃恩(Adam Vaughan)表示，压力可能会导致犯罪。\n“这场流行病肯定会对人们的压力和紧张程度造成一些附带损害。对一些人来说，这可能会表现为暴力行为。对于大多数人来说，这不太可能出现在严重的暴力行为中，“沃恩说。\n这些备受瞩目的事件对媒体和公众来说是避雷针，但对犯罪学家来说就不那么重要了。费尔森称这些属于正常模式之外的“特殊的、离奇的事件”。\n费尔森说：“大多数犯罪都是相当普通的，而这些非同寻常的犯罪引起了如此多的关注，以至于你忘记了大多数犯罪是多么普通。”\n费尔森说，即便如此，如果这些奇怪的事件与COVID的不确定性或压力有关，这并不会削弱他理论的说服力。\n如果说有什么不同的话，那就是工作不安全感和压力的增加将预示着犯罪率的增加，而不是像现在所经历的那样导致犯罪率下降。\n“很难得出这样的结论，新冠肺炎大流行对犯罪的早期影响在很大程度上取决于日常活动理论，”他说。\n这一切都增强了人们的希望，即他的理论可以帮助预测在大流行期间和之后，哪些犯罪会上升，发生在哪里。他希望仔细的研究能检验当封锁结束时犯罪是如何变化的。\n犯罪研究还告诉我们：在特殊事件结束后，人类行为会恢复正常，这意味着潜在的受害者、潜在的犯罪者以及他们相遇的情况也会恢复正常。\n“在过去的一周里，我们在受害者被枪杀的约克地区发生了三起凶杀案。帕滕登说：“随着人们回到家中以外的地方进行社交和饮酒或吸毒，我们再次看到受损驾驶事件的增加。”\n“自7月以来，随着该省重新开放，情况开始回归新常态，我们看到犯罪率正在上升，回到了历史水平。”\n“最终，”费尔森说，“这个自然发生的实验将促进我们对犯罪和人类行为的了解，在犯罪学数据广泛可得的时代，没有任何其他事件能做到这一点。”\n这给了我们希望，当我们到达大流行的另一边时，我们可能会知道更多。\n注册接收国家邮报的每日头条新闻，国家邮报是邮政媒体网络公司的一个部门。\n一封欢迎电子邮件正在发送中。如果您没有看到，请检查您的垃圾文件夹。\n邮政媒体致力于保持一个活泼而文明的讨论论坛，并鼓励所有读者分享他们对我们文章的看法。评论可能需要长达一个小时的审核时间才能出现在网站上。我们要求您保持相关和尊重您的评论。我们已经启用了电子邮件通知-如果您收到对您的评论的回复、您关注的评论帖子有更新，或者如果用户关注您的评论，您现在将收到一封电子邮件。有关如何调整您的电子邮件设置的更多信息和详细信息，请访问我们的社区指南。", "note_en": "If there were one specific crime to define the current phase of the pandemic, it could be the allegations against Adam Zaborowski.\n After the 35-year-old man walked into a cigar store in Bethlehem Township, Pa., he flew into a rage when staff asked him to put on a mask. Instead, he grabbed two cigars and left without paying. A clerk followed him outside, where Zaborowski shot at him. When police tracked Zaborowski down, he grabbed an assault rifle, police said. After a shootout with seven officers, Zaborowski was airlifted to hospital and charged.\n  His lawyer, John Waldron, explained that Zaborowski was “just not handling the pandemic well.”\n   Canada has seen its own iterations of apparent pandemic paranoia or stress linked to spectacular crimes.\n In an almost identical incident, police in Haliburton, cottage country northeast of Toronto, shot a man dead during a standoff in July after he assaulted store staff in an argument over his refusal to wear a mask.\n  That same month, Corey Hurren was arrested with loaded guns after a pickup crashed through the gates of Rideau Hall, where Prime Minister Justin Trudeau lives. Hurren left a note saying COVID was ruining him financially and restrictions were turning Canada into a communist dictatorship, Global News reported.\n Even Canada’s worst mass killing has COVID as a possible trigger. In April, Gabriel Wortman was “paranoid about the pandemic,” a friend said, and liquidated his investments and stockpiled food and fuel shortly before he dressed as a cop and killed 22 people in Nova Scotia.\n  It is not easy to quickly reverse engineer the causes of each specific crime. Looking for logic or answers is often frustrating.\n There are ideas, however, on what drives crime more broadly, with crime and justice researchers regularly plumbing reams of data on who is doing what to whom, where, when and how.\n  Emergency isolation orders, border closures, social distancing and mandated lockdowns are inconvenient and costly, but, it is hoped, it will at least test theories like never before of why crime really happens and how it can be predicted and reduced.\n The COVID-19 pandemic is “the largest criminological experiment in history,” according to influential American criminologist Marcus Felson. “It’s like a natural lab,” Felson says in an interview — and we are all test subjects locked in this dystopian exploration.\n  “The ‘stay-at-home’ mandates brought about the most wide-reaching, significant, and sudden alteration of the lives of billions of people in human history,” Felson, a professor at Texas State University, wrote in a recent paper rallying criminologists around the world to aggressively seize opportunity from tragedy.\n The pandemic certainly has some collateral damage to folks’ levels of stress and strain\n “Practically overnight, the entire country ceased or significantly reduced day-to-day travels, eliminating commutes from home to work, as well as leisure activities, shopping trips, social gatherings, the ability to dine out, and more.\n “Across the United States and around the world, a positive byproduct of these unprecedented events is a dramatic drop in crime rates,” writes Felson, co-authoring with Ben Stickle, a professor at Middle Tennessee State University.\n That drop in crime, though, has not been uniform across types of offenses. Some crimes rose while others fell. A dissection of the interplay of this rise and fall — at a time when human routines and activities are largely frozen — may be the key, he says.\n  More than 40 years ago, he created the “routine activity theory” of crime, an approach to criminology that moves away from focusing on offenders to learn why crime happens, and to look instead at the circumstances in which crimes occur.\n His premise is crime happens when three things converge: a capable offender, a suitable target and the absence of an appropriate guardian. In other words, a specific deterrent.\n  Now, suddenly, Felson sees a chance to test this theory with robust global data in ways unthinkable before COVID-19 because, along with illness and death, the novel coronavirus gave us lockdowns.\n  As dramatic a change as immobilizing people in their homes, little actually changed in terms of the broad factors often associated with crime: poverty, inequality, unemployment, biological and physiological conditions.\n “The basic population didn’t change,” Felson says. “The racial composition of communities remained the same. Poverty and inequality did not disappear or increase overnight. There is not much change in the basic social structure.”\n What did change — suddenly and significantly — are the routine activities of huge swaths of people, almost globally, and crime rates dropped by double digits almost immediately. The routine activity theory suggests it’s because lockdowns prevent capable offenders from meeting worthwhile targets or shifts guardianship, such as from offices and businesses to homes.\n  One problem criminologists face, Felson says, is crime offers too many variables to get a firm grip on cause and effect. That’s why he wants criminologists to seize this moment, a unique time when variables are conspicuously reduced. The crisis offers a naturally occurring quasi-random control trial.\n Researchers around the world are now applying Felson’s theory to analyze how COVID restrictions are changing crime patterns in different communities, cities and regions.\n  Vancouver, for instance, was the focus of criminologists in Australia who studied the city’s crime data during the first 12 weeks of lockdown. The researchers found a significant decrease in total crime, but not across all types: there was an increase in commercial burglary, for example. This supports routine activity theory, because closed businesses lack active guardians, namely store staff and customers, who would normally act as deterrence.\n This naturally occurring experiment will advance our knowledge of crime and human behaviour as no other event has ever done\n In Great Britain, a study found a huge drop in total reported crime in Lancashire County, led by shoplifting; when most stores are closed, shoplifters don’t have access to an attractive target to steal.\n COVID is also disastrous for pickpockets, a crime that thrives on a crowd of bustling and hurried people, according to a study of crime in Stockholm.\n Police in several cities told  National Post that officers are seeing similar changes in crime patterns, including in Toronto, Vancouver, Edmonton, Ottawa and Calgary.\n From March through June, York Regional Police, north of Toronto, saw a noticeable drop in overall crime.\n “We saw a drop in motor vehicle collisions and impaired driving offences as people were staying home. Other trends we saw were increases in stunt driving offences, as well as a rise in domestic incidents,” said Sgt. Andy Pattenden. “We attribute the rise in family domestic incidents to more people being at home with one another for long periods of time as they were isolating.”\n  In Toronto, gun murders seem unaffected by COVID, while most other crimes are down, said Toronto police spokeswoman Connie Osborne.\n “Break and enters in particular have declined and, while I couldn’t directly attribute it specifically to COVID, I think it could be argued with more people at home there are less likely to be break-ins,” she said.\n That’s like catnip for proponents of routine activity theory; people at home are the quintessential guardians to deter crimes against a homeowner’s property.\n What is more difficult to place in any framework are the explosive crimes that make the biggest headlines, the crazy police shootouts, the distressing mass murder, the possible assassination attempt.\n Into the fifth month of widespread COVID-19 restrictions, the nature of this exceptional event is changing: Economic loss and financial hardship are increasing; lockdowns ease but there is still no vaccine or treatment; there are disputes over wearing masks.\n Anecdotal and news accounts suggest other violent incidents may have links to the stress, loneliness, and psychosocial changes from the pandemic. Perhaps under lockdown, some people are losing access to their usual coping mechanisms: bars, friends, church, therapy, shopping.\n Adam Vaughan, a Canadian health criminologist teaching at Texas State University, said stress could lead to crime.\n “The pandemic certainly has some collateral damage to folks’ levels of stress and strain. For some, this may manifest into violent behaviour. For most, this is not likely to show up in severe acts of violence,” Vaughan says.\n  These high-profile incidents are lightning rods for media and the public, but not so much for criminologists. Felson calls these “particular, bizarre incidents” that fall outside normal patterns.\n “Most crime is quite ordinary, and these extraordinary crimes get so much attention you forget how ordinary most crime is,” Felson says.\n Even so, if these bizarre incidents are linked to uncertainty or stress from COVID, it does not diminish the persuasiveness of his theory, Felson says.\n If anything, an increase in job insecurity and stress would predict an increase in crime, not account for a decrease, as is being experienced.\n “It is difficult to escape the conclusion that the early effects of the COVID-19 pandemic on crime largely rest on routine activity theory,” he says.\n It all bolsters the hope his theory can help predict what crimes will go up and where that will happen, both during a pandemic and afterwards. He hopes careful research examines how crime changes when lockdowns end.\n Crime research also tells us this: after an exceptional event ends, human behaviour returns to normal, meaning potential victims, potential offenders and the situations where they meet also return to normal.\n   “In the past week we have had three homicides in York Region where the victims were shot. We have been seeing an increase in impaired driving incidents again as people return to socializing and consuming alcohol or drugs in places other than their homes,” said Pattenden.\n “Since July, as the province re-opens and things start to get back to the new normal, we are seeing crime on the rise back to historical levels.”\n  “In the end,” Felson says, “this naturally occurring experiment will advance our knowledge of crime and human behaviour as no other event has ever done during the era in which criminological data were widely available.”\n It gives hope we may know a lot more when we get to the other side of the pandemic.\n Sign up to receive the daily top stories from the National Post, a division of Postmedia Network Inc.\n  A welcome email is on its way. If you don&#39;t see it please check your junk folder.\n    Postmedia is committed to maintaining a lively but civil forum for discussion and encourage all readers to share their views on our articles. Comments may take up to an hour for moderation before appearing on the site. We ask you to keep your comments relevant and respectful. We have enabled email notifications—you will now receive an email if you receive a reply to your comment, there is an update to a comment thread you follow or if a user you follow comments. Visit our  Community Guidelines for more information and details on how to adjust your  email settings.", "posttime": "2020-08-10 21:15:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "肺炎,largest,犯罪", "title": "新冠肺炎带来了“史上最大规模的犯罪学实验”", "title_en": "Covid-19 brought the 'largest criminology experiment in history'", "transed": 1, "url": "https://nationalpost.com/news/paranoid-about-the-pandemic-how-covid-19-brought-the-largest-criminology-experiment-in-history/wcm/964870a2-86c8-4814-a34f-edf1bc76417e/", "via": "", "real_tags": ["肺炎", "largest", "犯罪"]}]