[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1067164, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有机地图是Android＆amp; iOS离线地图席位，基于人群源的OpenstreetMap数据的顶级，并通过Maps.me创始人策划与爱情策划。  加入我们的俄语集团的电报进行反馈和帮助  ©2021 Organic MapsOü，reg。 代码16225385 Harju Maakond，Tallinn，Kristiine Linnaosa，A.H.Tammsaare Tee 47,11316，爱沙尼亚 ", "note_en": "Organic Maps is an Android &amp; iOS offline maps appfor travelers, tourists, hikers, and cyclists based on top of crowd-sourced OpenStreetMap data and curated with love by  MAPS.ME founders.\n                       Присоединяйтесь к нашей  русскоязычной группе в Telegram для обратной связи и помощи\n  © 2021  Organic Maps OÜ, reg. code 16225385  Harju maakond, Tallinn, Kristiine linnaosa, A. H. Tammsaare tee 47, 11316, Estonia", "posttime": "2021-06-21 17:16:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,广告,ios,地图", "title": "OrganicMaps是Android和IOS离线地图，无需跟踪或广告 ", "title_en": "OrganicMaps is Android and iOS offline maps for travel without trackers or ads", "transed": 1, "url": "https://organicmaps.app/", "via": "", "real_tags": ["android", "广告", "ios", "地图"]}, {"category": "", "categoryclass": "", "imagename": "17e5f15580e31b5ce712e500ef0fe1e2.jpg", "infoid": 1067163, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊决定在未经用户的同意下启动人行道，只允许他们选择退出。亚马逊自动打开人行道;如果用户不希望将亚马逊设备成为网络的一部分，则它们必须手动禁用它。 （这是如何。）\n 这同样适用于智能锁或图块等其他支持其他侧面的设备。他们的用户还需要通过一个过程来选择退出网络。\n 该决策破坏了人们对其设备和数据的控制，因为它利用“默认偏见”来损害消费者。行为经济学解释说，即使在其他选项可用时，“默认偏见”驱动器必须在不同选项之间进行选择以保留默认选项。换句话说，人们很少通过步骤来拒绝默认设置 - 在这种情况下，您的设备可以连接到人行道并成为桥梁，只要设备能够执行此操作。这就是为什么最好的隐私制度是选择选择 - 而不是选择退出。亚马逊知道这一点，但制作人行道选择的意思是解释系统和令人信服的利益，这是公司显然想要避免的一步。\n  亚马逊发布了一个WhitePaper寻址人行道网络的隐私和安全措施。然而，本文未能解释这些措施如何防止商业收益和政府监测的不必要的数据收集。\n WhitePaper讨论网络内置的加密协议以及设计如何限制收集和共享的数据量。但大部分白皮书讨论了高级技术问题或不明确的协议，将消费者留在黑暗中，了解客户数据亚马逊从人行道上收集的内容。例如，在其常见问题解答中，亚马逊表示有一个选项可以共享人行道设备的近似位置信息。但技术白皮书没有提供任何解释，以及如何工作或“近似”手段。\n  “简单的问题”，没有公开的答案“这项新服务会收集哪些客户信息？”亚马逊松散地指的是其覆盖收集，管理和披露所收集的信息的普通隐私政策，没有进一步解释。\n 不出所料，该公司解释了它将继续遵守执法请求，并认为“数据最小化政策和加密政策降低了我们能够在法律所需生产的数据的范围和实用性。”但是，它并没有解释为什么，如何，或者在假设案例中可能无用的数据。 \n这很重要，因为人行道可能成为环形安全摄像机业务的一个组成部分。作为TechCrunch的报道，“戒指在2020年期间收到了超过1,800美元的法律要求，比前一年度增加了两倍。”仍然，戒指拒绝回答警察给予了多少用户或账户。该公司的人行道白皮书无理由相信戒指和人行道之间的政策和实践会有所不同。\n   在官方网站上，亚马逊提到，将有一个人行道标准的标准，其他公司和开发人员可以用于构建支持人行道的设备。这将基本上创建一个私人网络，可以连接各种设备 - 在我们的家中和外部 - 亚马逊作为其唯一的网守。这将使亚马逊几乎行动为ISP，对同一安全风险开放，但不受法规的情况。 （亚马逊也在建造项目Kuiper，一个低地球轨道卫星星座，能够提供宽带服务。）\n 也许更糟糕的是，政府能够从一个地方获取所有信息。现在，由于其商业活动，亚马逊已经访问了一个人的家庭住址，现场位置，购物习惯等等。链接安全设备的专用网络将更多的行为数据添加到此集合中。例如，如果一个人在携带侧面行动的设备周围散步，人行道生态系统可能会透露人们去的地方。像这样的Panopticon风格监视系统是民权和公民自由的噩梦。我们不希望在我们的社区中看到一连串的眼睛。\n 几年前，ACLU表示，购买环形摄像机是个性决定，这取决于许多因素和考虑因素。现在，我们有另一个因素要考虑：人行道和促进亚马逊不断增长的监视基础设施的可能性。\n 我们的工作在Creative Commons（CC By-NC-ND 3.0）下获得许可。随时重新发布和股票。 ", "note_en": "Amazon decided to launch Sidewalk without consent from their users, only allowing them to opt out. Amazon automatically turned on Sidewalk; if users don’t want their Amazon devices to be part of the network, they will have to disable it manually. (Here is  how.)\n The same applies to other Sidewalk-enabled devices like smart locks or tiles. Their users also need to go through a  process to opt out of the network.\n This decision undermines people’s control over their devices and data because it exploits “ default bias” to the detriment of the consumers. Behavioral economics explains that the “default bias” drives people who have to choose between different options to remain with the default option, even when other options are available. In other words, people rarely go through the steps to reject the default setting — in this case, having your device get connected to Sidewalk and being a bridge, provided the device is capable of doing that. That is why the best privacy regimes are opt-in — not opt-out. Amazon knows this, but making Sidewalks opt-in would mean explaining the system and convincing people of its benefits, a step the company apparently wants to avoid.\n  Amazon has posted a  whitepaper addressing privacy and security measures for the Sidewalk network. The paper, however, fails to explain how these measures would prevent unnecessary data collection for commercial gain and government surveillance.\n The whitepaper discusses encryption protocols built into the network and how the design limits the amount of data collected and shared. But much of the whitepaper discusses high-level technical issues or unclear protocols, leaving consumers in the dark about what customer data Amazon collects from Sidewalk. For example, in its  FAQ, Amazon says that there is an option to share the approximate location information of Sidewalk devices. But the technical whitepaper does not provide any explanation as to how this would work or what “approximate” means.\n  There is no public answer to the simple question of “What customer information does this new service collect?” Amazon loosely refers to its general privacy policy covering the collection, management, and disclosure of the information collected without further explanation.\n Unsurprisingly, the company explains it will keep complying with law enforcement requests and argues that “data minimization policies and encryption policies reduce the scope and usefulness of data that we would be able to produce if legally required.” However, it doesn’t explain why, how, or what sort of data might not be useful in a hypothetical case.\n This is significant because Sidewalk will likely become an integral part of the Ring security camera business. As Techcrunch  reports, “Ring received over 1,800 legal demands during 2020, more than double from the year earlier.” Still, Ring refuses to answer how many users or accounts had footage given to police. The company’s Sidewalk whitepaper gives no reason to believe policies and practices will vary between Ring and Sidewalk.\n   On the  official website, Amazon mentions that there will be a Sidewalk standard that other companies and developers can use to build Sidewalk-enabled devices. This would essentially create a private network that connects all sorts of devices — inside and outside our homes — with Amazon as its only gatekeeper. This would leave Amazon practically acting as an ISP, open to the same security  risks, but without being subjected to the regulations ISPs are. (Amazon is also building Project  Kuiper, a low Earth orbit satellite constellation capable of providing broadband  service.)\n Perhaps worse, the government would be able to get all the information it needs from one place. Now, and because of its commercial activities, Amazon already has access to a person’s home address, live location, shopping habits, and much more. A private network that links security devices adds more behavioral data to this collection. For example, if one person takes a stroll around her neighborhood carrying a Sidewalk-enabled device, the Sidewalk ecosystem might reveal where the person went and when. A panopticon-style surveillance system like this is a nightmare for civil rights and civil liberties. We do not want an all-seeing eye in our communities.\n A couple of years ago, the ACLU  said that buying a Ring camera is an individual decision that depends on many factors and considerations. Now, we have another factor to consider: Sidewalk and the possibility of contributing to Amazon’s growing surveillance infrastructure.\n Our work is licensed under Creative Commons (CC BY-NC-ND 3.0). Feel free to republish and share widely.", "posttime": "2021-06-21 17:16:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,监控,alarm,人行道", "title": "ACLU警报作为亚马逊激活人行道监控系统 ", "title_en": "ACLU Alarm as Amazon Activates Sidewalk Surveillance System", "transed": 1, "url": "https://www.commondreams.org/views/2021/06/20/aclu-alarm-amazon-activates-sidewalk-surveillance-system", "via": "", "real_tags": ["亚马逊", "amazon", "监控", "alarm", "人行道"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067162, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "lwn.net需要你！没有订阅者，LWN将根本不存在。请考虑注册订阅并帮助保持LWN出版\n   自由软件和安全社区最近曾在操作系统下面运行的计算机的元素。这些专有的固件组件通常是不可能延伸的，并且已经暂时怀疑（在几种情况下且伴有了且有关有关的安全问题。 LinuxBoot项目正在使用Alinux内核工作Toreplace这个复杂的，专有的，并且很大程度上的固件。这具有额外的好处，可以使用从Linux获得良好测试的驱动程序替换现有驱动程序的固件。\n 要了解LinuxBoot和问题，我们努力解决，我们首先讨论计算机实际启动的方式。我们通常会想到一个runningsystem，包括硬件，操作系统（OS），和申请。但是，出于多种原因，硬件和操作系统之间存在多个层次。大多数UEFI的大多数用户区域软件（替换旧BIOS）;对于许多系统，ITPREPLES系统运行并加载引导加载程序。但是，这些必要的功能只是冰山的Tipof。即使计算机完成加载TheOS后，也有多个嵌入式系统，也与操作系统完全分开。最值得注意的是，Intel ManagementEngine（ME）运行完整的MINIX操作系统，而系统管理示例（SMM）用于以完全不可见的方式运行某些事件（例如笔记本电脑LID GESSLOSED）的代码。\n 所有这些都加入了LinuxBoot项目＆＃39; S语句＆＃34;硬件和Linux之间至少2.5内核，＆＃34 ;;那些内核统称固件。许多这些都是令人惊讶的复杂性，拥有完整的网络堆栈和广泛的软件驱动程序。固件对自由软件交通的主要关注点，因为它将所有在庞大的代码基础上运行的计算机都留下了专有的和未经审核。由于固件为强大，持久的漏洞利用和rootkits提供了许多机会，因此对大型技术概念和云提供商来说也是一个主要风险。除了这些实质性的疑虑之外，靴子早期性能和灵活性的改善也是这种简化和移动Topen来源的主要动力。\n 为了实现更优雅和开放的解决方案，谷歌推出了名为NERF的APRoRoject，或者在11月份LWNCOVERED的非扩展程序固件。 nerf的主要目标是通过删除几乎所有不需要启动操作系统的功能来减少功能攻击表面（尽管这是可能的extent的限制）。 nerf由a＆＃34; fullstack＆＃34;剥离的EFI固件，Linux内核和Aninitramfs的解决方案与Go Go的工具。虽然这些组件都使存储在ROM中的Upone捆绑包，但它们已被分成单独的项目：Linuxboot是固件和内核，而使用Go工具的用户-spactinitramfs映像作为U-Root可用。由于这种模块化，Linuxboot可以与各种initramfs图像一起使用。\n   它更容易了解这些组件如果我们先向启动过程较近时如何合适。四个主要的计算机靴。安全阶段（SEC）和预EFI初始化阶段（PEI）负责低级操作，以准备硬件，并且非常具体于它们为其实现的硬件。在这些替代之后，驱动程序执行环境（DXE）加载各种驱动程序，然后启动设备选择（BDS）相位可以开始。\n BDS阶段是我们作为用户所知的大多数情况发生的地方：搜索存储设备的系统，这些设备被检查ForbooOloLopers，然后启动其中一个引导加载程序。这种声音，但是，由于许多不同的存储设备和引导架构，因此在实践中可能相当复杂。为管理此复分分复性，先前的DXE阶段在大部分系统上加载数百个驱动程序，为大多数设备的支持实施终遗工系统将能够使用。此外，系统中的硬件可以难以提供＆＃34;选项roms＆＃34;其中包括额外的驱动因素，以在BDS之前被掩盖和执行。所有这些都是潜在的脆弱性，而且它易于想象基于大量隐藏的UEFI的延伸性令人难以置信的攻击攻击。 \n这是Linuxboot进入的地方。它在DXESTAGE期间开始，导致大多数驱动程序（及其关联的攻击曲面）未加载。相反，Linux内核被加载好像ITWER驱动程序一样。这带来了几个直接的优势。第一个，Andperhaps最令人兴奋，是Linux内核是一个开源系统，这一直是经过大量的安全审查和接收修复。与现有FII驱动程序的情况几乎是完全相反的情况。第二个是实际改进：在本领上运行Linux提供了一种标准化和记录良好的编程环境，用于开发进一步的模块。这使得延伸UEFI和＃39的能力远远差不多。\n 通过在DXE期间加载，Linuxboot在uefi的前两个阶段之后运行，但在此之后接管，替换UEFI驱动程序。因此，完全取代了大部分靴子进程，这是通常仍然将＆＃34转化为＆＃34; TheBIOS＆＃34;由于Linuxboot处理了启动过程的一部分，其中overi / o设备可用，因此它消除了UEFI的部分，具有最初的安全性和稳定性风险。\n  单独的Linux内核不是很多使用;要实现实际的SystemFeatures，需要一个Linux用户空间。用户空间是在initRamfs文件系统中提供的，就像标准的Linux BootProcess一样。目前有几个可用于用户 -  Spacetools的选项。一个是U root，它是谷歌开发的原始化，作为NERF项目的一部分。 U-Root是一个包含在Go编程语言中完全写入的二进制文件的TinyImage，并且可以选择作为单个可执行二进制出口负载和执行时间构建。这使得它类似于BusyBox。 U-Rootis通过简单地使用KEXEC执行其内核来启动最终操作系统的完整的Linux系统。\n 用户空间的另一个值得注意的选项是头部，这是一个专门设计用于安全的Linux系统，即使攻击者隐藏对系统的访问。它通过基于TPM的硬励将和对固件攻击的广泛保护实现了这一点。头部令人遗憾地设计用于直接从CoreBoot启动，但也已移植到Workas一个Linuxboot initramfs。\n 基本上，可以进行足够紧凑的Linux工具集以适合可用ROM，可以内置于LinuxBoot的InitRamfs中，包括BusyBox和其他最小的用户空间项目。 ForeInitRamfs图像的可用性强调Linuxboot的核心功能：它是一个开单次。 Linuxboot源本身不仅是可用的，社区是向外开发利用Linuxkernel的电源的InitRamfs映像，以将固件扩展到几乎不可能的新方向，这是由于UEFI实现的封闭性质。\n 由于在前博进程早期可用的环境的限制，LinuxBoot内核和用户空间将受到强度下降。您希望使用作为实际计算环境。相反，Linuxboot可以执行将该系统带到可用状态的后续步骤。在许多情况下，这与搜索标准Linux内核的可力存储设备一样简单，并且使用KUXEC移交OverControl，但LinuxBoot也可以实现更复杂的引导过程。最终操作系统的一个明显的应用程序验证，在可信计算系统中构建另一个联机。然而，天空是极限，并且在此可能性很多：例如，改进了网络的启动，例如不寻常的存储安排和高级安全性控制器。\n 与LinuxBoot initRamfs相似的依赖于Linuxboot kernel tostart，所以linuxboot内核也取决于博波进程中的前一步。这是可能涉及CoreBoot的地方。 Linuxboot andCoreboot不是竞争对手，而是他们解决了Oooting的不同阶段。请记住，UEFI引导进程由四个阶段组成，其中第三个（驱动程序执行环境或DXE）是Linuxboot的重点。 CoreBoot是第一个替代的实现，它可以替换主板Vendor提供的UEFI固件。 CoreBoot仅支持窄范围的硬件，但是，当它可以使用LinuxBoot使用时，它可以实现几乎完全打开的BootProcess。 \nLinuxboot本身承诺比CoreBoot更广泛的硬件支持，因为LinuxBoot内核和initramfs通常不需要为硬件定制 - 这是inthinuxboot旨在在UEFI引导的前几个阶段开始后开始的原因的主要部分。这就是UEFI固件来处理特定硬件的步骤，据认领者倾向于保持交易秘密。\n Linuxboot已在Chromebook上演示，并具有用于消费者计算机的特性。 Linuxboot Atpresent的主要目标是服务器。它最近在大数据中心环境中引起了相当的关注; Open ComputeProject，维护开源基础架构设计的开放源基础架构设计，其中包括LinuxBoot Developer Ron Minnich所在的IffaceBook中使用的，作为其固件的两个引导率之一。服务器供应商的Horizo​​ n计算计划很快释放WinterFellserver，一个开放的计算项目实现，用LinuxBootand nerf船用。考虑到Facebook＆＃39;在开放计算中的重型投资，这意味着在Google之外的Linuxboot即将在Google之外。\n Linuxboot项目最近成为Linuxfoundation项目。该项目的贡献者包括Google和Facesbook与较小的公司Horizo​​ n Computing，两个Sigma，AND9ELEMENT。通过该项目吸引了兴趣水平的判断，这个名单似乎可能会增长。\n Linuxboot是一个有希望的开发，任何人都沮丧，他们在其计算机上的计算机上沮丧，攻击表面和维护复杂性都会带来。项目＆＃39;在固件安全性的工业支持和ageneral浪潮中可能会使我们的基础设施牢固安全，并使我们的设备更接近我们的控制。\n     （ 登录后发表评论）\n  谢谢你写这个。我们是，GNU / Linux Aficionados正在等待它，并希望这个项目看到日光。我的意思是，它应该具有现实生活的实现和可用性。从启动过程的开头拥有这种东西非常令人兴奋。它肯定会允许别人调查这个过程，并且可能会促进他们的理解更多。我亲自保持手指越过。 GNU / Linux成为一个引导加载程序... Whoa！ kexec很好，但在早期阶段使用这是一个严重的凉爽的步骤。杂乱，散发会消失，奥术，不透明的东西不会阻碍任何东西。\n  将Linuxboot与Petitboot比较，这将是有趣的，这是较早尝试使用Linux作为引导加载程序。 \n这里的一个切向想到的，但是linuxboot是足够的，足以替换痛苦的长Memtest进程大多数服务器默认情况下？ 它＆＃39; d表示，说，验证前512MB是否处于工作状态，然后将该处理到主内核中的处理，该内核在后台完成。  这听起来很棒。 和魔鬼详细信息......在Linuxboot之前，您需要在LinuxBoot之前拥有一些最小的固件部分。 因此，您支持CoreBoot支持的所有50（？）主板，而99.99％的其他电脑只能与他们写入闪存（旧式BIOS或EFI）。 ", "note_en": "LWN.net needs you! Without subscribers, LWN would simply not exist. Please consider  signing up for a subscription and helping to keep LWN publishing\n   Both the free-software and security communities have recently beenfocusing on the elements of our computers that run  belowthe operating system. These proprietary firmware components are usuallydifficult or impossible to extend and it has long been suspected (andproven in several cases) that there are significant security concerns withthem. The  LinuxBoot Project is working toreplace this complex, proprietary, and largely unknown firmware with aLinux kernel. That has the added benefit of replacing the existing driversin the firmware with well-tested drivers from Linux.\n To understand LinuxBoot and the problem it&#39;s working to solve, we firsthave to discuss how computers actually boot. We usually think of a runningsystem as including the hardware, operating system (OS), andapplications. However, for a number of reasons, there are several layersthat run between the hardware and the OS. Most users areaware of UEFI (which replaced the older BIOS); for many systems, itprepares the system to run and loads the bootloader. These necessary functions are just the tipof the iceberg, though. Even after the computer finishes loading theOS, there are multiple embedded systems also running on thesystem entirely separate from the OS. Most notably, the  Intel ManagementEngine (ME) runs a complete Minix operating system, while  System ManagementMode (SMM) is used to run code for certain events (e.g. laptop lid getsclosed) in a way that is completely invisible to the running OS.\n All of these add up to the LinuxBoot project&#39;s statement thatthere are &#34;at least 2.5 kernels between the hardware and Linux,&#34;;those kernels collectively make up the firmware. Many of these firmwarecomponents are surprisingly complex and capable, with full network stacks and extensivehardware drivers. The firmware is a major concern to the free-softwarecommunity, as it leaves all computers running on a large foundation of codethat is proprietary and unaudited. It is also a major risk to large techcompanies and cloud providers since the firmware presents many opportunitiesfor powerful, persistent exploits and rootkits. Besides these substantialsecurity concerns, improvements in performance and flexibility of the earlystages of boot is also a major motivation for this simplification and move toopen source.\n To work towards a more elegant and open solution, Google launched aproject called NERF, or the  Non-ExtensibleReduced Firmware, which  LWNcovered back in November. The primary goal of NERF was to reduce thefirmware attack surface by removing almost all functionality that was notnecessary to start the operating system (although there are limits on theextent to which this is possible). NERF consisted of a &#34;fullstack&#34; solution of stripped-down EFI firmware, a Linux kernel, and aninitramfs with tools written in Go. Although these components all make upone bundle stored in ROM, they have since been split into separateprojects: LinuxBoot is the firmware and kernel while the user-spaceinitramfs image with Go tools for system booting is available as  u-root. Due to this modularity, LinuxBoot canbe used with a variety of initramfs images.\n   It&#39;s easier to understand how these components fit together if we firstlook a bit closer at the boot process. A UEFI computer boots in four mainphases. The security phase (SEC) and the Pre-EFI Initialization Stage (PEI)are responsible for low-level operations to prepare the hardware and areusually specific to the hardware they are implemented for. After these twostages, the Driver Execution Environment (DXE) loads various drivers,and then the Boot Device Select (BDS) phase can begin.\n The BDS phase is where most of what we as users are aware of happens: thesystem is searched for storage devices, those devices are inspected forbootloaders, and then one of those bootloaders is started. This soundssimple but, due to the many different storage devices and boot schemesavailable, it can be quite complicated in practice. To manage thiscomplexity, the previous DXE stage loads hundreds of drivers on mostsystems, implementing support for the majority of the devices the finaloperating system will be able to use. Further, hardware in the system canprovide &#34;option ROMs&#34; that include additional drivers to beloaded and executed prior to BDS. All of these are potentially vulnerable,and it&#39;s easy to imagine incredibly damaging attacks based on the extensivecapabilities of the largely hidden UEFI.\n This is where LinuxBoot comes in. It starts during the DXEstage, resulting in most of the drivers (and their associated attacksurface) not being loaded. Instead, a Linux kernel is loaded as if itwere a driver. This brings several immediate advantages. The first, andperhaps most exciting, is that the Linux kernel is an open-source systemthat has been subject to a great deal of security scrutiny and receivesregular fixes. This is almost the exact opposite of the case with existingUEFI drivers. The second is a practical improvement: running Linux at thisearly stage provides a standardized and well-documented programmingenvironment for developing further modules. This makes it far morepractical to extend UEFI&#39;s capabilities.\n By loading during the DXE, LinuxBoot runs after the first two stages of theUEFI, but takes over after that point, replacing the UEFI drivers. Ittherefore completely replaces a large portion of the boot process, muchof what is often still colloquially referred to as &#34;theBIOS&#34;. Because LinuxBoot handles the part of the boot process whereI/O devices become available, it eliminates the parts of UEFI with thegreatest security and stability risk.\n  A Linux kernel alone is not of much use; to implement actual systemfeatures, a Linux user space is needed. That user space is providedin an initramfs filesystem, much like the standard Linux bootprocess. There are currently several options available for user-spacetools. One is u-root, which is the originalsolution developed by Google as part of the NERF project. U-root is a tinyimage containing binaries written entirely in the Go programming language, and can optionally be built as a single executable binary foroptimal load and execution times. This makes it similar to BusyBox. U-rootis a complete-enough Linux system to start the final operating system by simply executing its kernel using kexec.\n Another notable option for the user space is  HEADS, which is a Linux system specifically designed to be secure even when an attacker hasphysical access to the system. It achieves this through TPM-based hardwaretrust and extensive protections against firmware attacks. HEADS wasoriginally designed to boot directly from  coreboot, but has been ported to workas a LinuxBoot initramfs as well.\n Essentially any Linux tool set that can be made compact enough to fit inthe available ROM can be built into an initramfs for LinuxBoot, includingBusyBox and other minimal user-space projects. The availability of severalinitramfs images emphasizes the core feature of LinuxBoot: it is an opensystem. Not only is the LinuxBoot source itself available, the community isfree to develop initramfs images that utilize the power of the Linuxkernel to extend the firmware in new directions that were almost impossiblebefore due to the closed nature of UEFI implementations.\n Because of the limitations of the environment available early in theboot process, the LinuxBoot kernel and user space are highlystripped down. You wouldn&#39;t want to use either as your actual computing environment. Instead, LinuxBoot can carry out the next steps to bring thesystem to a usable state. In many cases this is as simple as searching theavailable storage devices for a standard Linux kernel and handing overcontrol using kexec, but LinuxBoot enables more sophisticated boot processes as well. An obvious application iscryptographic verification of the final operating system, building anotherlink in a trusted computing system. The sky is the limit, though, and thereare many possibilities: improved booting from the network, easiersupport for unusual storage arrangements, and advanced securitycontrols, for example.\n Much like the LinuxBoot initramfs depends on the LinuxBoot kernel tostart, so too does the LinuxBoot kernel depend on a previous step in theboot process. This is where coreboot may be involved. LinuxBoot andcoreboot are not competitors, rather they address different stages ofbooting. Remember that the UEFI boot process consists of four stages, ofwhich the third (the driver execution environment or DXE) is the point atwhich LinuxBoot starts. Coreboot is an implementation of the first twostages, where it can replace the UEFI firmware provided by the motherboardvendor. Coreboot only supports a narrow range of hardware but, when it canbe used inconcert with LinuxBoot, it enables an almost completely open bootprocess.\n LinuxBoot itself promises much broader hardware support than corebootbecause the LinuxBoot kernel and initramfs generally do not need to beheavily customized for the hardware—this is a major part of the reason thatLinuxBoot is designed to start after the first few stages of UEFI boot. Thatallows the UEFI firmware to handle the hardware-specific steps thatvendors tend to keep as trade secrets.\n LinuxBoot has been demonstrated on Chromebooks, and has clearapplications for consumer computers. The major target for LinuxBoot atpresent is servers. It has recently drawn quite a bit of attention in the large data centerenvironment; the  Open ComputeProject, which maintains open-source infrastructure designs used byFacebook among others,  recentlyannounced that LinuxBoot developer Ron Minnich is to serve as one ofthe two leads of its  firmwarework. Server vendor Horizon Computing plans to soon release the  Winterfellserver, an Open Compute Project implementation that ships with LinuxBootand NERF. Considering Facebook&#39;s heavy investment in Open Compute, thiscould mean LinuxBoot in use outside of Google soon.\n The LinuxBoot Project has recently become a  LinuxFoundation project. Contributors to the project include Google andFacebook alongside smaller firms Horizon Computing, Two Sigma, and9elements. Judging by the level of interest the project has attracted earlyon, this list seems likely to grow.\n LinuxBoot is a promising development for anyone frustrated with theamount of hidden, proprietary, and highly privileged firmware in theircomputers—and the attack surface and maintenance complexity that all ofthat brings with it. The project&#39;s industry support and ageneral wave of interest in firmware security may make our infrastructuremore secure and bring our devices a bit closer to being under our control.\n     ( Log in to post comments)\n  Thanks for writing this. We are, the GNU/Linux aficionados are waiting for it and hoping that this project sees the daylight. I mean, it should have real-life implementation and usability. It is very very exciting to have this kind of stuff from the beginning of the boot process.   It will certainly allow other people look into the process and probably contribute more with their understanding. I am personally keeping my fingers crossed.  GNU/Linux becomes a bootloader...whoa! kexec is good, but using this in the early stage is a seriously cool step.Moreover, the clutter will go away, the arcane, the opaque thing will not hinder anything.\n  It would be interesting to compare LinuxBoot with Petitboot, which was an earlier attempt at using Linux as a bootloader.\n  Bit of a tangential thought here, but does LinuxBoot run early enough to replace that painfully long memtest process most servers do by default? It&#39;d be cool to have it, say, verify the first 512MB are in working order and then hand that process off to the main kernel which finishes it up in the background.\n  All that sounds great. And devil is in details...  You need to have some minimal firmware part before LinuxBoot. So you support all those 50(?) mainboards supported by coreboot and 99.99% of other PCs just stay with whatever they have written into flash (either old style BIOS or EFI).", "posttime": "2021-06-21 17:15:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,linuxboot", "title": "Linuxboot：Linux作为固件（2018） ", "title_en": "LinuxBoot: Linux as Firmware (2018)", "transed": 1, "url": "https://lwn.net/Articles/748586/", "via": "", "real_tags": ["linux", "linuxboot"]}, {"category": "", "categoryclass": "", "imagename": "a739dd5f349f770b67db5060f72000c1.jpg", "infoid": 1067161, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年8月，Alex Hernandez发现了一个新的家具市场。\n 这位31岁的执行助理在她的迈阿密一室公寓里挖了起来，疲惫不堪，她的“便宜和基本的”宜家沙发。她在网上购物了，发现了一个她喜欢的新人 - 但它是一个超出她的价格范围的设计师品牌。\n  她从宜家定制网站上用一套中世纪的现代腿（70美元）和新的封面（120美元）加香料。该项目的成本是Hernandez大约十分之一的设计师版本，她已经注意到了它，它拯救了一件旧家具从垃圾填埋场。\n 这种兴高采烈地称为宜家黑客，一直在大流行期间的崛起。\n 以及销售自定义宜家友好灯具的公司 - 腿，沙发覆盖，旋钮和橱柜门 - 业务正在蓬勃发展。\n  宜家已经实现了大多数公司只能梦寐以求的规模和品牌认可。\n 基于瑞典的公司，445家零售店和217万员工的年收入〜44亿美元，是全球最大的家居家具零售商，享有一家迷人的家具市场。 \n在某种程度上，宜家有点像家具的比特币：公司使用通用设计，这意味着它的硬件和测量在大部分发达的世界中都是均匀的。\n 和那些想要为他们的批量生产Billy Bookcases和Kallax货架单位添加一些Pizzazz的人，没有缺乏自定义选项可供在线选择。\n 广泛地说，宜家黑客是任何形式的升级，定制，重新展示或个性化伊克伊斯特家具。\n 当宜家黑客和授权等人流行的DIY博客时，运动在2000年代中期获得了蒸汽的蒸汽，开始为Billy Bookcases和Kallax货架单位等流行物品提供简单的，实惠的调整。\n 起初，宜家不是定制其家具的人的粉丝，甚至发送了宜家黑客停止和停止。但从那时起，该公司已接受其黑客。\n 在过去十年中，曾经小而古怪的社区曾兴成了一个完整的行业。\n     在这个更广泛的生态系统中，某些宜家产品在利基社区赢得了邪教。 \n植物爱好者使用Fabrikör橱柜制作自己的室内温室。摄影师将Schottis色调转换为DIY灯箱。父母将Flisat表转变为幼儿的感官站。有些人甚至把性玩具制成了宜家鞋树和牛奶奶奶。\n 在对喧嚣的1,206名读者的一项调查中，所有受访者的一半人表示他们听说过宜家黑客的概念 -  43％的人表示他们在某些时候练习实践。\n   在我们的调查中，读者对旧宜家家具的创造性新用途没有短缺：\n Peter Sanderson（罗德岛销售总监）将宜家床头板转换为他的Rottweiler小狗的狗门。\n  Rick Moore（电影技术员，温哥华）将宜家屠夫块推车转变为葡萄酒架。\n 月桂选择（文学代理人，纽约）制作了宜家架子，腿和台面的厨房岛屿。\n 在大流行期间，遥远工作的增加和在家里花费的时间导致了DIY Remodel  - 宜家黑客的浪涌。 \n在我们的受访者中，69％表示他们在大流行期间买了新家具，38％的人表示他们已经更新了现有的家具。\n   “我们拆解了一个廉价的宜家桌子，涂上了一种新的颜色，并购买了新的腿，使其成为北卡罗来纳州数字营销经理Zoëkronovet的近期现代。 “我们还买了一个300美元的天鹅绒午夜 - 蓝色封面，为一个基本的宜家沙发提供了新的生活。”\n 像Kronovet一样，大多数宜家黑客都坚持简单的审美变化：梳妆台上的新旋钮，一张桌子上的一套新的腿，或者新的橱柜门 - 小触摸摇动东西。\n   当狩猎改造老宜家的商品时，潜在客户常常转向电子商务初创公司的山寨行业 - 主要是女性拥有 - 专门从事宜家定制：\n 超级，Norse Interiors：腿，硬件和橱柜门用于一系列畅销的宜家产品\n 在Etsy上，您会发现几十家小型公司抱怨手工腿，铜管旋钮，搁板插入件和沙发盖，专门制作适合宜家家具线。\n  a之前/后厨房改造使用宜家基础系统修改了SemihandMade Mahogany Panels（SemihandMade） \n10年前Monica出生于10年前向她的撰稿人辞职，以与她的丈夫米克找到超级面，在注意到她在瑞典的许多朋友都是从当地木匠调试自己的昂贵的宜家替代门。\n 在瑞典，其中90％的居民拥有宜家家具，她感受到了简化和规范定制过程的机会。\n 今天，业务提供与宜家的4个畅销家具线兼容的橱柜门，手柄和腿。\n 天生表示，该公司在今年销售额达到〜800万美元 - 去年的50％颠簸。\n “这越来越多，[常见]告诉你的晚餐客人，你重新安排了一些东西，”她说。 “这很酷，”我们认为扔掉那块宜家家具，让我们重新设计它。“\n Jana Kagin在2012年留下了心理学的职业生涯，以在2012年推出基于斯德哥尔摩的宜家定制者Prettypegs。\n “宜家是瑞典的巨大的DNA这么大的部分 - 它在我们的母乳中，”她说。 “但很多人都希望区分大规模生产的。我们通过高端设计配对DIY提供更实惠的选择。“ \n作为一个例子，她引用了一个能够使用一套Prettypegs腿（60美元），旋钮（28美元）和DIY手工的一套以288美元重建1美元的欧洲榆树控制台的客户。\n  基于佛罗里达州的房主Kim Bui，使用自定义宜家腿，硬件和一些肘部润滑脂攻击设计师控制台复制品（XO我的家;图形：喧嚣）\n 她说，需求如此之高，这是难以存放库存的物品。\n “当我们第一次开始时，我们想，”这只是家具腿，这不是火箭科学！“但一切都变成了火箭科学作为一个商业秤，”她说。 “物流，硬件，包装，漆，涂料 - 有这么多的动力零件现在已经存在了电源链。”\n 虽然这些公司中的许多公司都在瑞典，但一些企业家在美国市场上找到了成功。\n Norse Interiors的创始人Lotta Lundaas表示，纽约市表示，她的公司正在追踪销售额在发射后3年达到100万美元 - 同比增长3倍。\n Lundaas利用她的背景作为一个在线营销人员，以确定哪些宜家产品提供定制柜门，通过查看搜索量数据来逆转工程公司的最佳卖家。 \n左派：宜家贝斯塔柜;右：宜家BESTA柜用甘蔗双门，铬旋钮和铬腿从Norse Interiors（宜家，Norse Interiors）升级\n  2014年推出，目的是定制宜家厨柜的目的，该公司自已搬进其自己的产品线。但它难以让价格对宜家人口造成吸引力。\n “难以匹配宜家的规模经济，”该公司董事总经理斯科特·伯德说。 “他们以低于我们甚至可以源的价格出售他们的一些产品。”\n   除了设计之外，宜家黑客旨在解决更大的问题：所谓的“快速家具”的祸害。\n 在20世纪50年代，家具被视为持续数十年的世代投资。今天，平均沙发只持续了6年。每年，美国人丢弃了20米吨家具 - 一个数字在过去十年中翻了一番。\n 宜家 - 一个使用世界整个木材供应的1％的公司，并鼓励客户经常更换过去的家具 - 是在这个问题的中心。\n 宜家黑客的陈述的一部分，以及大的升级运动，是延长家具的寿命。 \n在自己的独立研究中，PrettyPEGS发现，一个简单的设计变化可能导致一个人保持一件家具20％的人。 该公司估计，它帮助客户持有19K件宜家家具，节省了179吨二氧化碳排放。  消费者越来越关注他们的购买环境影响：在我们的调查中，60％的受访者表示，在购买家居家具时，生态友好是一个重要的考虑因素。  93％的全球消费者预计他们用来解决的品牌并考虑环境问题  就其部分而言，宜家宣布了2030年的“气候积极”的回购方案，并计划成为“气候积极”。  但对于已经拥有宜家家具的房屋的消费者来说，一点重新设计和重新展现可能是最近的行动过程。  “我们都在制作宜家产品的业务中，”Prettypegs的Cagin说。 “我们希望将快速的家具变成慢家具。” ", "note_en": "Last August,  Alex Hernandez found herself in the market for a new piece of furniture.\n Holed up in her Miami studio apartment, the 31-year-old executive assistant had grown weary of her “cheap and basic-looking” Ikea couch. She shopped around online and found a new one she liked — but it was a designer brand that was out of her price range.\n  She spiced things up with a set of mid-century modern legs ($70) and a new cover ($120) from an Ikea customization website. The project cost Hernandez about one-tenth of the designer version she’d had her eye on and it saved an old piece of furniture from the landfill.\n This type of upcycling, called  Ikea hacking, has been on the rise during the pandemic.\n And for companies that sell custom Ikea-friendly fixtures — legs, couch covers, knobs, and cabinet doors — business is booming.\n  Ikea has achieved the kind of scale and  brand recognition that most companies can only dream of.\n With  ~$44B in annual revenue,  445 retail stores, and  217k employees, the Sweden-based company is the  world’s largest home furnishings retailer, enjoying a stranglehold on the ready-to-assemble furniture market.\n    In a way, Ikea is kind of like the Bitcoin of furniture: the company uses  universal designs, meaning its hardware and measurements are  uniform across most of the developed world.\n And folks who want to add some pizzazz to their mass-produced Billy bookcases and Kallax shelf units have no shortage of customization options to choose from online.\n Broadly, Ikea hacking is any form of upgrading, customizing, repurposing, or personalizing a piece of stock Ikea furniture.\n The movement gained steam in the mid-2000s, when popular DIY blogs like  Ikea Hackers and  Instructables began offering up easy, affordable tweaks to popular items like Billy bookcases and Kallax shelf units.\n At first, Ikea wasn’t a fan of people customizing its furniture and even sent Ikea Hackers a  cease and desist. But since then, the company has embraced its hackers.\n And over the past decade, this once small and wacky community has burgeoned into a full-fledged industry.\n     Within this broader ecosystem, certain Ikea products have earned a cult following in niche communities.\n Plant enthusiasts use Fabrikör cabinets to make their own indoor greenhouses.  Photographers convert Schottis shades into DIY lightboxes.  Parents transform Flisat tables into sensory stations for toddlers. Some have even crafted  sex toys out of Ikea shoe trees and milk frothers.\n In a survey of 1,206 readers of  The Hustle,  half of all respondents said they had heard of the concept of Ikea hacking — and  43% said they’d engaged in the practice at some point.\n   In our survey, readers had no shortage of their own creative new uses for old Ikea furniture:\n Peter Sanderson (sales director, Rhode Island) converted an Ikea headboard into a dog gate for his Rottweiler puppy.\n  Rick Moore (film technician, Vancouver) transformed an Ikea butcher block cart into a wine rack.\n Laurel Choate (literary agent, New York) made a kitchen island out of Ikea shelves, legs, and a countertop.\n During the pandemic, an increase in remote work and time spent at home has led to a  DIY remodel boom — and a surge in Ikea hacks.\n Among our respondents,  69% said they had bought new furniture during the pandemic, and  38% said they had updated an existing piece of furniture.\n   “We disassembled a cheap Ikea table, painted it a new color, and bought new legs to make it more mid-century modern,” says  Zoë Kronovet, a digital marketing manager in North Carolina. “We also bought a $300 velvet midnight-blue cover for a basic Ikea couch to give it a new life.”\n Like Kronovet, the majority of Ikea hackers stick to simple aesthetic changes: new knobs on a dresser, a new set of legs on a table, or new cabinet doors — little touches to shake things up.\n   When on the hunt to revamp old Ikea wares, prospective customers often turn to a cottage industry of e-commerce startups — mostly female-owned — that specialize in Ikea customization:\n Superfront,  Norse Interiors: legs, hardware, and cabinet doors for an array of best-selling Ikea products\n On  Etsy, you’ll find dozens of smaller companies hawking handmade legs, brass knobs, shelf inserts, and sofa covers specifically crafted to fit Ikea furniture lines.\n  A before/after kitchen remodel using an Ikea base system modified with Semihandmade mahogany panels (Semihandmade)\n Monica Born quit her copywriting gig 10 years ago to found Superfront with her husband Mick, after noticing that many of her friends in Sweden were commissioning their own pricey Ikea replacement doors from local carpenters.\n In Sweden, where  90% of residents own Ikea furniture, she sensed an opportunity to streamline and normalize the customization process.\n Today, the business offers cabinet doors, handles, and legs compatible with Ikea’s 4 best-selling furniture lines.\n Born says the company is on track to hit  ~$8m in annual sales this year — a 50% bump from last year.\n “It’s becoming more and more [common] to tell your dinner guests that you repurposed something,” she says. “It’s cool to say, ‘We thought it was crazy to throw away that piece of Ikea furniture so we redesigned it instead.’”\n Jana Kagin left a career in psychology to launch the Stockholm-based Ikea customizer Prettypegs in 2012.\n “Ikea is such a huge part of Sweden’s DNA — it’s in our breast milk,” she says. “But a lot of people want to differentiate from the mass-produced. We offer a more affordable option by pairing DIY with high-end design.”\n As an example, she cites a  customer who was able to reconstruct a  $1.5k West Elm console for  $288 using a set of Prettypegs legs ($60), knobs ($28), and a bit of DIY handiwork.\n  Kim Bui, a Florida-based homeowner, hacked together a designer console replica using custom Ikea legs, hardware, and some elbow grease (XO My Home; graphic: The Hustle)\n Demand is so high, she says, that it’s been hard to keep items in stock.\n “When we first started, we thought, ‘It’s just furniture legs, it’s not rocket science!’ But everything becomes rocket science as a business scales,” she says. “Logistics, hardware, packaging, lacquer, paint — there are so many moving parts that have strained supply chains right now.”\n While many of these companies are based in Sweden, some entrepreneurs have found success focusing on the US market.\n Lotta Lundaas, the founder of Norse Interiors, based in New York City, says her company is on track to hit  $1m in sales just 3 years after launching — a  3x increase year-over-year.\n Lundaas leveraged her background as an online marketer to identify which Ikea products to offer custom cabinet doors for, reverse engineering the company’s best sellers by looking at search volume data.\n  Left: A stock Ikea Besta cabinet; Right: An Ikea Besta cabinet upgraded with cane double doors, chrome knobs, and chrome legs from Norse Interiors (Ikea, Norse Interiors)\n  Launched in 2014 with the aim of customizing Ikea kitchen cabinets, the company has since moved into offering its own product lines. But it has trouble keeping its prices appealing to the Ikea demographic.\n “It’s hard to match Ikea’s economies of scale,” says  Scott Bird, the company’s managing director. “They sell some of their products at a price that’s lower than what we can even source them for.”\n   Beyond design, Ikea hacking aims to tackle a larger problem: the scourge of so-called “ fast furniture.”\n In the 1950s, furniture was seen as a generational investment that would last decades. Today, the average couch lasts just  6 years. Each year, Americans discard  20m tons of furniture — a figure that has  doubled in the last decade.\n Ikea — a company that  uses 1% of the world’s entire wood supply and has  encouraged customers to frequently replace furniture in the past  — is at the center of this problem.\n Part of the stated mission of Ikea hacking, and the  upcycling movement at large, is to extend the lifespan of furniture.\n In its own independent research, Prettypegs found that a simple design change could result in a person keeping a piece of furniture  20% longer. The company estimates that it has helped customers hold on to 19k pieces of Ikea furniture, saving 179 tons of CO 2 emissions.\n Consumers are increasingly concerned about the environmental impact of their purchases: In our survey,  60% of respondents said eco-friendliness is an important consideration when buying home furnishings.\n    93% of global consumers expect the brands they use to address and consider environmental issues\n For its part, Ikea has announced  buy-back programs and  plans to be “climate positive” by 2030.\n But for consumers who already have a house full of Ikea furniture, a little redesigning and repurposing may be the greenest course of action.\n “We’re all in the business of making Ikea products last longer,” says Cagin, of Prettypegs. “We want to turn fast furniture into slow furniture.”", "posttime": "2021-06-21 17:10:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宜家,黑客,business", "title": "宜家黑客的蓬勃发展 ", "title_en": "The thriving business of IKEA hacking", "transed": 1, "url": "https://thehustle.co/the-thriving-business-of-ikea-hacking/", "via": "", "real_tags": ["宜家", "黑客", "business"]}, {"category": "", "categoryclass": "", "imagename": "f25f655436894095c4c7278b46380c1f.png", "infoid": 1067160, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MFAST，一个让越南用户在偏远地区获得金融服务的移动应用程序，宣布今天筹集了150万美元的第一款。这圆由Do Ventures领导，参加Jafco Asia。\n 2019年由Fintech公司DigiPay推出，Mfast表示已被60万人使用迄今为止。 IT与金融机构合作，提供贷款和保险等服务，并表示已被用于迄今为止分配超过500亿VND（约220万美元）的产品。\n   大多数或大约75％到80％的Mffast的用户在远程省或农村地区，该公司表示经常限制他们对银行和信贷相关服务的机会。\n 资金将用于扩大越南更多城市和省份，发展其技术和伴侣。 MFAST还计划将来进入其他市场。\n Mfast的消费者信用伙伴包括Mirae资产，CIMB，MCREDIT和Easy Credit，其保险伙伴包括PVI，PTI和BSH。它声称拥有超过350,000名顾问的网络，他们通过该应用程序提供服务，并且其数据分析工具能够减少债务和欺诈率。 ", "note_en": "MFast, a mobile app that lets Vietnamese users in remote areas access financial services, announced it has raised a $1.5 million pre-Series A today. The round was led by Do Ventures, with participation from JAFCO Asia.\n Launched in 2019 by fintech company Digipay, MFast says it has been used by 600,000 people to date. It partners with financial institutions who provide services like loans and insurance, and says it has been used to distribute more than 50 billion VND (about $2.2 million USD) worth of products so far.\n   The majority, or about 75% to 80% of MFast’s users are in remote provinces or rural areas, which the company says often limits their access to banking and credit-related services.\n The funding will be used to expand MFast to more cities and provinces in Vietnam, develop its technology and partner with more institutions. MFast also plans to enter other markets in the future.\n MFast’s consumer credit partners include Mirae Asset, CIMB, Mcredit and Easy Credit, and its insurance partners include PVI, PTI and BSH. It claims to have a network of more than 350,000 advisors, who offers their services through the app, and that its data analysis tools are able to reduce bad debt and fraud rates.", "posttime": "2021-06-21 16:34:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ventures,led,服务", "title": "越南金融服务App Mfast通过Do Ventures获得了1.5亿美元的Pre系列A LED ", "title_en": "\n\t\t\t\tVietnamese financial services app MFast gets $1.5M pre-Series A led by Do Ventures\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/vietnamese-financial-services-app-mfast-gets-1-5m-pre-series-a-led-by-do-ventures/", "via": "", "real_tags": ["ventures", "led", "服务"]}]