[{"category": "", "categoryclass": "", "imagename": "8bc5c0c847f19225b3284d0d7718e705.jpeg", "infoid": 1003390, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据华尔街日报最先报道，汽车租赁巨头赫兹周五晚间申请破产，此前该公司未能与其最大的贷款人达成协议。\n赫兹向特拉华州威尔明顿的美国破产法院申请破产法第11章的保护，使其成为冠状病毒大流行广泛经济影响的最大企业受害者之一，因为旅行限制摧毁了租车行业。\n据“华尔街日报”报道，赫兹的债务约为190亿美元，其中包括大约43亿美元的公司债券和贷款，以及由该公司车队支持的144亿美元债务，贷款人曾要求该公司预付其中一些债务，但未能得到其同意。“华尔街日报”称，赫兹有大约190亿美元的债务，其中包括约43亿美元的公司债券和贷款，以及144亿美元由该公司车队支持的债务，贷款人曾要求该公司预付部分债务，但未能得到其同意。\n甚至在疫情爆发之前，赫兹的业务就已经在苦苦挣扎，因为它试图抵御来自其他租赁机构以及优步(Uber)和Lyft等叫车业务的竞争。\n今年4月，随着旅行陷入停顿，该公司解雇了1万名员工-约占员工总数的26%-为了节省现金，该公司甚至在网上以大幅折扣出售了至少20辆相同的黄色克尔维特Z06。\n首席执行官凯瑟琳·马里内洛于上周六辞职，公司董事会任命保罗·斯通接替马里内洛，此前保罗·斯通曾担任该公司北美执行副总裁兼首席零售运营官。\n赫兹的母公司赫兹全球控股公司(Hertz Global Holdings Inc.)也拥有租赁品牌美元(Dollar)和节俭(Thrity)。赫兹曾在4月份的一份监管申报文件中表示，在没有支付运营租约的某些款项后，该公司正在考虑寻求破产保护。赫兹表示，如果在5月的第一周之前，与贷款人就减少这些付款的讨论不能取得成果，那么它可能会受到实质性的负面影响。\n在“华尔街日报”最初报道赫兹将于周五晚间申请破产后，赫兹的股价在盘后交易中下跌了50%。", "note_en": "Car-rental giant Hertz filed for bankruptcy Friday night after it was unable to reach an agreement with its biggest lenders,  The Wall Street Journal first reported.\n Hertz  filed for Chapter 11 protections in the U.S. Bankruptcy Court in Wilmington, Delaware, making it one of the largest corporate casualties of the coronavirus pandemic&#39;s widespread economic fallout as travel restrictions decimate the rental car industry.\n  Hertz has around $19 billion in debt, which includes roughly $4.3 billion in corporate bonds and loans as well as $14.4 billion of debt backed by the company&#39;s fleet of vehicles, and lenders had asked the company for upfront payment on some of those obligations but couldn&#39;t get it to agree, according to The Journal.\n   Hertz&#39;s business had  already been struggling even before the pandemic as it tried to fend off competition from other rental agencies as well as ride-hailing businesses like Uber and Lyft.\n In April, as travel ground to a halt, it  laid off 10,000 workers — roughly 26% of its total workforce — and even put at least  20 identical yellow Corvette Z06s up for sale online at a steep discount as it tried to preserve cash.\n CEO Kathryn Marinello resigned last Saturday, and the company&#39;s board of directors named Paul Stone, who previously served as the company&#39;s executive vice president and chief retail operations officer for North America, to step in for Marinello.\n Hertz, whose parent company, Hertz Global Holdings Inc., also owns rental brands Dollar and Thrifty, had said in a  regulatory filing in April that it was considering seeking bankruptcy protections after it &#34;did not make certain payments&#34; on its operating lease. Hertz said it &#34;could be materially and negatively impacted&#34; if discussions with lenders to reduce those payments weren&#39;t fruitful by the first week of May.\n   Hertz&#39;s stock dropped by as much as 50% in after-hours trading following the The Wall Street Journal&#39;s initial report that the company would file for bankruptcy on Friday night.", "posttime": "2020-05-23 20:16:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,病毒,重创,files", "title": "赫兹申请破产，冠状病毒大流行重创租赁业", "title_en": "Hertz files for bankruptcy as the coronavirus pandemic crushes rental industry", "transed": 1, "url": "https://www.businessinsider.com/hertz-filing-for-bankruptcy-as-early-as-this-weekend-report-2020-5", "via": "", "real_tags": ["冠状病毒", "病毒", "重创", "files"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003389, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SF时间表包括2,400+个想法和发明，来自350+个作者的750+个作品。", "note_en": "SF timeline of 2,400+ ideas and inventions from 750+ works by 350+ authors.", "posttime": "2020-05-23 19:49:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发明,fiction,时间表", "title": "科幻小说的发明时间线", "title_en": "Science Fiction Timeline of Inventions", "transed": 1, "url": "http://www.technovelgy.com/ct/ctnlistPubDate.asp", "via": "", "real_tags": ["发明", "fiction", "时间表"]}, {"category": "", "categoryclass": "", "imagename": "ce180ee0bc883fe2936e72c295fb79f8.jpg", "infoid": 1003388, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，在英特尔新推出的Comet Lake处理器上架后，AMD的Ryzen 9 3900X已经降价，这当然可以被视为第10代台式机发布后的一次被动举动。\n根据TechPowerup的一份报告，AMD已经向零售商发出信号，要求在美国将3900X的价格降至410美元左右，它将在美国与酷睿i9-10900K甚至酷睿i7-10700K展开竞争。如果这不是对英特尔处理器发布的反应，那么时机肯定是你所说的有趣的…。\n然而，这个故事有一点令人费解的地方。就AMD的官方售价而言，3900X的首发价为499美元，但现在AMD网站上的标价为449美元。正如前面提到的，TechPowerup争辩说，在线零售商正在整理价格降至410美元左右的产品，尽管价格在这个价位附近徘徊不定。\n此外，请注意，3900X之前已经跌至这种略高于400美元的水平。\n回到目前的价格，Ryzen 3900X昨天在亚马逊的价格可能是410美元，但现在在亚马逊的价格是420美元，在美国的Newegg是432美元-但正如一位目光敏锐的TechPowerup读者所发现的那样，它在Micro Center的价格已经跌至390美元。\n考虑到即使是酷睿i7-10700K的发布价格也在410美元左右，这真的是一笔划算的交易。与12核的Ryzen相比，这是一个8核的Intel部件。\n10核的英特尔酷睿i9-10900K售价在510美元或更高，正如我们在评论中指出的那样，在大多数CPU繁重的工作负载(以及一些在多核上对处理器造成沉重打击的游戏)上，它的表现都超过了3900X。\n在英国，在撰写本文时，3900X现在可以在网上买到大约410 GB的价格，10700K也差不多，10900K的标价大约是530 GB。\n看看Micro Center 3900X在美国的价值，这款AMD 12核处理器无疑为许多希望打造更强大PC的用户提供了一个极具诱惑力的提议。请记住，您也可以获得与3900X捆绑在一起的冷却器(尽管许多人可能很想升级该组件，但事实是默认情况下它仍然在那里)。\nAMD似乎明确表示，它在台式机CPU领域的推进不会有丝毫缓和，当然这甚至没有考虑到我们即将推出Ryzen 4000处理器，根据传言磨坊的说法，该处理器将于9月份首次亮相。", "note_en": "AMD’s Ryzen 9 3900X has reportedly been given a price cut in the wake of  Intel’s new Comet Lake processors hitting the shelves, which could certainly be viewed as a reactive move following the 10th-gen desktop launch.\n According to a report by  TechPowerup, AMD has signaled to retailers to drop the price of the 3900X to around $410 over in the US, where it will compete with the Core i9-10900K and indeed the Core i7-10700K. If this isn’t a reaction to the launch of those Intel processors, then the timing is certainly what you’d call interesting…\n    There’s a bit to unpick with this story, however. As far as the official price listed by AMD goes, the  3900X launched at $499, but is now listed at $449 on AMD’s website. As mentioned, TechPowerup contends that a drop to around $410 is being marshaled with online retailers, although prices are kind of peppered around that mark.\n Furthermore, note that the 3900X has been dropped to this kind of just-over-$400 level before.\n Going back to the current prices, the Ryzen 3900X might have been $410 yesterday at Amazon, but now sits at $420 there, or $432 at Newegg in the US – but as one eagle-eyed TechPowerup reader spotted, it has crashed down to  $390 at Micro Center.\n Now that really is a steal, given that even the Core i7-10700K has launched at around $410. That’s an 8-core Intel part, compared to the 12-core Ryzen.\n  The 10-core Intel Core i9-10900K is pegged at $510 or more, and  as we pointed out in our review, it is outdone by the 3900X in most CPU-heavy workloads (and some games which hit the processor hard across multiple cores).\n In the UK, the 3900X can now be had for around £410 online, at the time of writing, and the 10700K is around the same mark, with the 10900K pitched at about £530.\n Looking at the value of the 3900X in the US at Micro Center, then, this AMD 12-core processor presents a highly tempting proposition for many users looking at building a beefier PC, no doubt. And remember that you get a cooler bundled with the 3900X too (although many may well want to upgrade that component, the fact is it’s still there by default).\n AMD would seem to be making it clear that it’s not going to relent in the slightest with its push in the desktop CPU arena, and of course that’s not even taking into account that we have  Ryzen 4000 processors on the near horizon,  ready to debut in September according to the rumor mill.", "posttime": "2020-05-23 18:54:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,下跌,drop,价格", "title": "AMD Ryzen 9 3900x价格下跌可能会削弱英特尔彗星湖的销售", "title_en": "AMD Ryzen 9 3900x price drop could take the wind out of Intel comet lake sales", "transed": 1, "url": "https://www.techradar.com/in/news/amd-ryzen-9-3900x-price-drop-could-take-the-wind-out-of-intel-comet-lake-cpu-sales", "via": "", "real_tags": ["英特尔", "下跌", "drop", "价格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003387, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你好，世界！", "note_en": "Hello, world!", "posttime": "2020-05-23 18:54:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,intentionally,你好", "title": "Gourami：一个特意小而轻量级的ActivityPub微博服务", "title_en": "Gourami: An intentionally small, lightweight ActivityPub microblogging service", "transed": 1, "url": "https://dev.gourami.social/", "via": "", "real_tags": ["服务", "你好"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003386, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多亏了Sharaf Zaman的努力，Krita现在可以在Google Play商店为Android平板电脑和Chromebook(不是Android手机)提供。\n这个测试版基于Krita 4.2.9，是Krita的完整桌面版本，因此没有特殊的触摸用户界面。但它就在那里，你可以玩它。\n与Windows和Steam商店不同，我们不会在商店里为Krita索要钱，因为这是人们在这些设备上安装Krita的唯一方式，但你可以从Krita内部购买支持徽章来支持开发。\n你可以在这里阅读在Google的Play Store中获取测试版的官方说明。(一点也不难！只需转到“早期访问”，搜索org.krita即可。在我们获得合理的下载量之前，您必须稍微向下滚动。)。\n注意：如果您已经安装了Sharaf的某个版本或您自己签名的版本，则需要首先为所有用户卸载该版本！", "note_en": "Thanks to the hard work of Sharaf Zaman, Krita is now available in the Google Play Store for Android tablets and Chromebooks (not for Android phones).\n This beta, based on Krita 4.2.9, is the full desktop version of Krita, so it doesn’t have a special touch user interface. But it’s there, and you can play with it.\n Unlike the Windows and Steam store, we don’t ask for money for Krita in the store, since it’s the only way people can install Krita on those devices, but you can buy a supporter badge from within Krita to support development.\n You can read here  the official instructions on getting beta releases in Google’s Play Store. (It’s not hard at all! Just go to “ Early access” and search for org.krita. Until we’ve got a reasonable number of downloads, you’ll have to scroll down a bit.)\n NOTE: if you have installed one of Sharaf’s builds or a build you’ve signed yourself, you need to uninstall that first, for all users!", "posttime": "2020-05-23 18:27:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrome,android,适用,beta,版本", "title": "Play商店首次推出适用于Android和ChromeOS的Krita Beta", "title_en": "First Krita Beta for Android and ChromeOS in Play Store", "transed": 1, "url": "https://krita.org/en/item/first-krita-beta-for-android-and-chromeos-in-play-store/", "via": "", "real_tags": ["chrome", "android", "适用", "beta", "版本"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003385, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JWT通常用于无状态身份验证流。多亏了签名，服务器不需要任何其他东西来验证令牌的有效性。作用域声明(RFC8693第4.2节)包含与令牌相关联的作用域的空格分隔列表。服务器可以使用它来检查应用程序权限，尽管这一要求可能很快就会变得繁重。作用域越多，令牌就越大！但是jwt应该是紧凑的令牌格式…。\n今天，我很自豪地向您介绍一个想法，将作用域列表压缩成一个位图，其中一位代表一个作用域。\n这个想法很简单。我将每个作用域与字节序列中的一个位相关联，而不是包含与该令牌相关联的所有作用域的巨大字符串。每一位都告诉我们作用域是否与令牌关联(或不关联)。\n0 1 1 0 1 0 0 1 1 1 0 1(.)Scope_a──┘│Scope_b─┘│Scope_c─┘┆(.)┆。\n正如您已经知道的，字节数组不是JSON数据类型。但这没什么大不了的，我们可以用64进制对这些字节进行编码。\n我不想覆盖当前的范围声明规范。即使从技术上讲它不会违反规范(因为我们仍然在里面存储一个字符串)，这也不是一个好的实践，IMO。此外，在某些情况下，您可能希望同时拥有传统作用域声明和位图作用域声明。\n任何资源提供程序都在记录其API中可用的作用域列表。它是在“人类可读的”文档(文本、HTML、PDF、…)中定义的。或者采用结构化规范(OAuth Authorization Server元数据、OpenID连接发现、OpenAPI、…)。。\n对于结构化规范，我的建议是保持相同的有序列表，并使用每个作用域的索引作为位号。OAuth元数据中的SCOLES_SUPPORTED字段是一个JSON数组。元素的顺序被保留。但是，OpenAPI中的Scope字段是一个映射(JSON对象)。我们不应该依赖于钥匙的排序。OpenAPI规范很有希望允许扩展。这意味着我们可以定义一个x-scope-order关键字，该关键字将列出(JSON数组)具有保留顺序的作用域(就像在OAuth元数据中一样)。\n假设您的API中有42个作用域(我以Facebook API为例)。在位图中存储它们将需要6个字节。由于采用Base64编码，我们必须做4*n/3(+四舍五入的乘数4)=8字节。为了公平起见，我在声明名称中添加了2个字节(前缀b_与作用域Claim相比)，总共10个字节。作用域列表电子邮件名称的大小相等。\n使用二元运算符测试字节序列不会消耗CPU。与字符串操作和比较相比，它的性能可能更好。\nLSB vs MSB。目前我不知道最好的选择是什么。我想答案应该来自以下几个标准：\n什么是最有效的/最好的？要用多种面向网络的语言(JS、Python、Ruby、Rust、SWIFT、…)进行测试。\n您可能想要弃用某个作用域，但是您不能从列表中删除此作用域，否则它会移动后面所有其他作用域。\n在这种情况下，你会松一点。但是如果您的令牌时间有限，您可以在一段弃用时间(长于最长令牌生存期)之后用另一个位作用域替换该位作用域。\n有些人正在定义“动态”范围。例如：perts.{id}.read。我认为这不是一个好的做法。我对作用域的理解是授予对API功能的访问权限，而不是对资源本身的访问权限。换句话说，您应该只有一个允许应用程序读取宠物的作用域pet.read。您的资源(也称为内容)ACL不应该在作用域本身中。\n有何不可？我还没有分析我们可以在哪里以及如何使用它，但是我猜在某些情况下它可能会很有用，但是我看不出在OAuth(令牌和授权)端点中使用它有什么大的好处。在每个API请求中发送JWT时，会准时调用这些端点。\n你可能有问题，或者你只是想讨论一下。请在我的博客库中打开问题，或随时给我发电子邮件。", "note_en": "JWT are often used in stateless authentication flows. Thanks to the signature, the server does not need anything else to verify the token validity.The  scope claim ( RFC8693 section 4.2) contains  a space-separated list of scopes associated with the token. The server can use it to check the application permissions.Although this claim can quickly become heavy. The more scopes you have, the bigger your token is!But JWT are meant to be a   compact token format…\n Today I’m proud to present you an idea to compress scope list into a bitmap where one bit represents one scope.\n  The idea is quite simple. Instead of a huge string with all the scopes associated with the token, I associate each scope to a bit in a byte sequence. Each bit tells us if a scope is associated (or not) to the token.\n  0 1 1 0 1 0 0 1 1 0 1 (...)scope_a ──┘ │ │ │ │ │ │ │ │ │ │scope_b ─────┘ │ │ │ │ │ │ │ │ │scope_c ────────┘ ┆ ┆ ┆ ┆ ┆ ┆ ┆ ┆(...) ┆ ┆ ┆ ┆ ┆ ┆ ┆\n  As you already know,  byte-array is not a JSON data type. But it’s not a big deal, we can encode these bytes in  Base 64.\n    I  don’t want to can’t override the current  scope claim specification. Even if technically it would not break the specification (because we still store a string inside), this is not a good practice IMO. Furthermore, in some cases you might want to have both a traditional  scope claim and a bitmap scope claim.\n   Any resource provider is documenting the list of scopes available in its API. It’s defined either in a “human readable” documentation (text, html, pdf,…) or in a structured specification ( OAuth Authorization Server Metadata,  OpenID Connect Discovery, OpenAPI,…).\n For structured specifications my suggestion would be to keep the same ordered list and use the index of each scope as bit number.The   scopes_supported field in OAuth Metadata is a JSON array. Order of elements is preserved. However the   scopes field in OpenAPI is a map (JSON Object). We should not rely on the ordering of keys. Hopefuly the OpenAPI specification  allows extensions. It means that we could define a  x-scopes-order keyword which would list (JSON Array) the scopes with preserved ordering (like in OAuth Metadata).\n   Let say that you have 42 scopes in your API ( I use Facebook API as example). It would require 6 bytes to store them in the bitmap. Because of Base 64 encoding we have to do  4 * n / 3 (+ rounded up mult 4) = 8 bytes. And to be fair, I added 2 bytes in claim name (prefix  b_ compared to  scope claim) for a total of 10 bytes. The equivalent in size of scope list  email name.\n  Testing a byte sequence with binary operators is not CPU consuming. Compared to string manipulation and comparison it’s probably more performant.\n   LSB vs  MSB. Currently I don’t know what’s the best option. I guess the answer should come from the following criteria:\n What’s the most efficient/performant ?To be tested in multiple web-oriented languages (JS, Python, Ruby, Rust, Swift,…)\n  You might want to deprecate a scope but you can’t remove this scope from the list otherwise it would shift all other following scopes.\n In this case you will loose a bit. But if your tokens are limited in time, you could replace the bit scope with another after a deprecation period (longer than the max token lifetime).\n   Some people are definining “dynamic” scopes. For instance:  pets.{id}.read. I don’t think it’s a good practice. My understanding of scopes is to grant access to an API feature, not to the resource itself. In other words, IMHO you should have only one scope  pet.read which allows application to read a pet. Your resources (aka content) ACL should not be in the scope itself.\n   Why not ? I didn’t analyze (yet) where and how we could use it but I guess it could be useful in some cases.However I don’t see a big benefit to use it in OAuth (token and authorize) endpoints. These endpoints are called punctually while JWT is sent in each API request.\n  You might have questions or you just want to discuss about it. Please open issue in my blog repository or feel free to send me an email.", "posttime": "2020-05-23 18:00:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "scope,作用域", "title": "JWT`Scope`声明压缩", "title_en": "JWT `Scope` Claim Compression", "transed": 1, "url": "https://raphael.medaer.me/2020/05/21/scope-bitmap.html", "via": "", "real_tags": ["scope", "作用域"]}, {"category": "", "categoryclass": "", "imagename": "ee837ad822eaf99f7652b2ea52cc109b.jpg", "infoid": 1003383, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Convos v4.08是面包店刚推出的，这一次我们很自豪地宣布支持视频！\n如果您只是在测试Convos，您将不会看到启动Videochat的任何按钮。其原因是底层技术需要安全连接、STUN服务器和可选的TURN服务器。\n如果您在没有安全连接的情况下连接到Convos，WebRTC将(可能)无法正常工作。SSL证书可以购买，也可以使用“让我们加密”免费设置。如果您直接在Internet上公开Convos，则可以从命令行指定证书：\n启用视频支持的绝对最低要求是STUN服务器。此服务器需要强制交换有关如何相互联系的基本信息。\n要使用给定的STUN服务器启动Convos，您需要指定CONVOS_STUN环境变量。示例：\nSTUN服务器不需要太多带宽，因此有许多免费的备选方案可供选择。如果您想设置自己的服务器，那么CoTurn是一个值得尝试的可靠项目。\n在两个客户端之间的网络“复杂”的情况下，可能需要TURN服务器。在这种情况下，两个客户端将视频和音频流发送到TURN服务器，而不是使用对等连接。\n要使用给定的TURN服务器启动Convos，需要指定CONVOS_TURN环境变量。示例：\n(据我所知)没有免费的替代方案，因此您必须为此设置您自己的服务器。Coturserver还支持TURN，因此您只需一台外部服务器即可获得所有情况下的Avideo连接。\n一旦您使用CONVOS_STUN环境变量启动了Convos，您就可以进入任何对话，并且在对话名称的右侧应该有一个摄像机符号。\n单击视频按钮将通知对话中的其他用户您已准备好进行视频聊天。然后任何其他用户都可以加入，然后你们就可以看到并听到对方的声音。\n信令协议使用IRC来发送WebRTC信号。然而，信令协议是专门针对Convos的，所以您只能与与您有相同Convos版本的其他人进行视频聊天。\n信令协议可能会导致某些IRC网络出现问题。这是未知的，但不能保证它将与您最喜欢的IRC服务器/网络一起工作。\n目前实现的错误处理非常少。如果视频对您不起作用，您可能必须在浏览器中打开开发人员控制台来查找问题。\n我们希望在Convos v5.00中稳定对视频的支持。这听起来可能是未来的事了，但实际上，一旦视频支持正常工作，Convos将从4.xx跳到5.00。", "note_en": "Convos  v4.08 isfresh from the bakery, and this time we are proud to announce video support!\n  If you are just testing out Convos, you won’t see any button to start the videochat. The reason for this is that the underlying technology require a secure connection, a  STUN serverand optionally a  TURN server.\n  WebRTC will (probably) not function properly if you connect to Convos without asecure connection. SSL certificates can either be bought or set up for free with Let’s Encrypt. If you expose Convos directly on theinternet you can specify the certificates from the command line:\n    The absolute minimum to enable video support is a STUN server. This server is needed forclients to exchange basic information for how to reach each other.\n To start Convos with a given STUN server, you need to specify the CONVOS_STUN environment variable. Example:\n  A STUN server does not require much bandwidth, so there are many free alternativesto choose from. If you want to set up your own server then Coturn is a solid project to try out.\n  A TURN server  might be needed some cases where the network between the twoclients is “complicated”. The two clients will in that case send the video andaudio streams to the TURN server, instead of using peer-to-peer connections.\n To start Convos with a given TURN server, you need to specify the CONVOS_TURN environment variable. Example:\n  There are (to my knowledge) no free alternatives for this, so you have to setup your own server for this. The  Coturnserver also supports TURN, so you only need one external server to get avideo connection for all cases.\n  Once you have started Convos with the  CONVOS_STUN environment variable, youcan go to any conversation and there should be a video camera symbol on theright side of the conversation name.\n  Clicking on the video button will notify the other user(s) in the conversationthat you are ready to video chat. Any other user can then join and you willthen see and hear each other.\n  The signalling protocol use IRC to send the WebRTC signals. The signalling protocolis however specific for Convos, so you can only video chat with other peoplewho have the same Convos version as yourself.\n   The signalling protocol  might cause issues for certain IRC networks. It isunknown which, but there are no guaranty that it will work with your favoriteIRC server/network.\n    There are very little error handling currently implemented. You probably haveto peak into the developer console in your browser to look for issues ifvideo does not work for you.\n  We hope to stabilize video support in Convos v5.00. It might sound likethat that is way into the future, but in reality Convos will jump from 4.xx to5.00 once video support seems to work properly.", "posttime": "2020-05-23 17:05:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "irc,convos", "title": "Convos IRC客户端现在支持视频聊天", "title_en": "Convos IRC client now supports video chat", "transed": 1, "url": "https://convos.by/2020/5/23/experimental-video-support-using-webrtc.html", "via": "", "real_tags": ["irc", "convos"]}, {"category": "", "categoryclass": "", "imagename": "41c0e94e65b4f38fdba1b6c583388f86.jpg", "infoid": 1003382, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简单地、真实地、绝对地、绝对地理解一个系统或软件体系结构无疑需要一个偶然的序列图。在面向对象设计成为标准之前，我离开了大学，但它开始流行起来。作为我第一份工作的一部分，我们接受了面向对象和使用Rational Rose的正式培训。当这个工具被集成到我们的开发过程和环境中时，我欣然接受了这个工具，特别是在通过消息跟踪图(也称为序列图)来描述类交互的能力方面。不幸的是，Rational Rose在今天是昂贵和不常见的。的开发实践，但是序列图仍然存在。白板图是乏味和耗时的，但是互联网上有真正简化图表创建的在线工具；就像这里的这个家伙：只要稍加努力，PythonImageMagick和https://www.websequencediagrams.com/就可以生成一个粗略的近似值。一个快速工具/库可以实现这一点：图表=Diagram()；方法1=对象(&#39；object1&#39；)；对象2=对象(&#39；object2&39；)；对象3=对象(&#39；object3&39；)；*m1=消息(obj1，obj2，&#39；method 1(Arg1)&#39；)；图表.add(M1)；*m2=消息(&#39；obj2，&#39；Method 1(Arg1)&#39；)；图表.add(M1)；*m2=消息(&#39；object3&#39；)。*m3=message(obj1，obj1，&#39；Method 2(Abc)&#39；)；*Diagram.add(M3)；*m4=message(obj1，obj3，&#39；Method 3()&#39；)；*Diagram.add(M4)；*Diagram.raw()；\n将其与一些日志分析或调试器跟踪配对，您可以轻松地自动生成整个系统交互。", "note_en": "Understanding a system or software architecture simply, truly, absolutely, undoubtedly requires an occasional sequence diagram.  I left university before object-oriented design became the norm, but it was trending up.  As part of my first job we were officially trained in OO and the use of Rational Rose.  The tool was integrated into our development process and environment, I embraced that tool, particularly in the ability to depict class interactions via &#39;message trace diagrams&#39;, otherwise known as &#39;sequence diagrams&#39;.  Unfortunately, Rational Rose is pricey and uncommon in today&#39;s development practices but sequence diagrams are alive and well.  Whiteboarding diagrams is tedious and time-consuming, but the inter-webs has on-line tools that really ease the creation of diagrams; like this fella right here:  https://www.websequencediagrams.com/  With a bit of effort, Python paired with ImageMagick can generate a rough approximation.  A quick tool/library can make this:    diagram=Diagram();    obj1=Object(&#39;object1&#39;);    obj2=Object(&#39;object2&#39;);    obj3=Object(&#39;object3&#39;);      m1=Message(obj1,obj2,&#39;method1(arg1)&#39;);    diagram.add(m1);      m2=Message(obj2,obj1,&#39;return val&#39;);    diagram.add(m2);      m3=Message(obj1,obj1,&#39;method2(abc)&#39;);    diagram.add(m3);      m4=Message(obj1,obj3,&#39;method3()&#39;);    diagram.add(m4);      diagram.draw();        \n Pair this with some logging analysis, or debugger traces and you could auto-generate entire system interactions with ease.", "posttime": "2020-05-23 16:37:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,sequence,obj1", "title": "使用Python/ImageMagick创建序列图", "title_en": "Creating Sequence Diagrams with Python/ImageMagick", "transed": 1, "url": "https://dragonquest64.blogspot.com/2020/05/python-generated-sequence-diagrams.html", "via": "", "real_tags": ["python", "sequence", "obj1"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1003381, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我重读了本·莫斯利(Ben Moseley)和彼得·马克斯(Peter Marks)的“走出焦油坑”(Out Of The Tar Pit)一文，为“我们热爱的工作”(Pap。这是一份非常有名的报纸。你可以在GitHub的Papers We Love存储库找到它，原因很简单，很多人都喜欢它。再次阅读这篇论文引发了一些思考，因此才有了这篇博客文章。\n当心图灵的焦油坑，在那里一切都有可能，但有趣的事情都不容易。\n图灵焦油坑是一种图灵完全的语言或系统(任何语言或系统都可以做到这一点)，但使用起来既麻烦又不切实际。图灵机本身就是一个图灵焦油坑，因为你可能不会在工作中使用它来解决真正的问题。这可能很有趣，但并不实用。\n标题的含义是，我们目前正处于图灵焦油坑，我们需要采取措施摆脱它。具体地说，文件中概述的措施。\n本文由两部分组成。第一部分是关于软件复杂性的前因后果的论述。第二部分是提出的编程模型，以最小化软件中的所谓意外复杂性。\n本文的论点是这样的：复杂性是软件开发中出现问题的主要原因。复杂性是有问题的，因为它阻碍了对软件系统的理解。这会导致各种不良的二阶效应，包括不可靠、安全问题、延迟交付和糟糕的性能，并且-在恶性循环中-复合复杂性，随着系统变得更大，所有的问题都会以非线性的方式恶化。\n继弗雷德·布鲁克斯在“没有银弹”一书之后，作者们区分了本质复杂性和偶然性复杂性。作者将“本质复杂性”定义为用户看到的问题所固有的复杂性。“偶然的复杂性”就是剩下的一切，包括所有与计算的平凡、实用方面有关的东西。\n作者认为状态处理、控制流和代码量是复杂性的驱动因素。大多数这种复杂性都被贴上了“偶然”的标签，因为它与机器的物理现实有关，而不是与用户的问题有关。\n建议的解决方法是将用户的非正式问题陈述转化为正式问题陈述：派生出可执行规范。除此之外，我们应该只考虑到实际效率考虑所需的最小程度的“意外”复杂性的增加。\n作者发现我们当前的编程模型不够完善，因为它们带来了太多的意外复杂性。因此，需要一种新的编程模型，一种意外复杂性最低的编程模型。论文的第二部分提出了这样一个模型。\n当我再次阅读这篇论文时，让我印象深刻的是，它总体上对软件开发的复杂性和天真的原因是错误的。\n这篇论文是错误的，有两个原因。首先，因为它将软件开发视为实现问题。如果那是真的就好了。不是这样的。如果我们一直认为是这样的话，我们在软件开发方面就不会变得更好。第二，因为它忽略了软件开发的动态性，并且做了无效的假设。具体地说，它对我们通过制作软件解决的问题的性质是天真的。\n我同意作者的观点，即复杂性是软件中的一个巨大问题。复杂性的非线性累积通常会威胁到非平凡的软件开发工作停滞不前。许多软件系统不仅仅是技术债务，这是我们经常用来形容失控复杂性的术语-它们实际上已经破产了！然而，复杂性问题不能仅靠更好的编程模型来解决。我们必须追查复杂性的原因，超越机器的领域，深入到现实世界。虽然更好的编程模型会很好，但我们不能指望它们会带来奇迹。原因是，复杂性的根本原因在于软件系统与其运行的世界之间的紧张关系。这超出了编程模型的范畴。\n根据作者的说法，软件开发团队的角色是“生产(使用某些给定的语言和基础设施)并维护服务于其用户目的的软件系统”。换句话说，角色是实现软件。另一方面，用户的角色是充当需要解决的问题的先知。作者在括号中指出，他们假设“用户确实知道并理解他们想要解决的问题”。然而，众所周知，这一假设是站不住脚的！问问软件行业的任何人吧！我们已经有麻烦了。如果没有这种知识和理解的来源，我们如何创建可执行规范？\n在任何非平凡的系统中，都有一些需要解决的问题固有的复杂性。\n因此，很明显，这个问题很重要。但这是什么呢？事实上，让我们通过问几个问题，把“需要解决的问题”这句话拉开一点。\n问题从何而来？谁定义了这个问题？问题是如何表达和沟通的，是由谁向谁传达的？对问题是什么达成一致了吗？对这个问题有多少种解释和提法？为什么是这个问题，而不是其他问题？谁会受到这个问题的影响？谁对此感兴趣？谁拥有它？为什么这个问题很重要？是谁认定这是一个值得解决的问题？为什么要解决呢？这个问题有多迫切需要解决？时间相关吗？这一直是个问题吗？这个问题或类似的问题存在了多久？这能不再是个问题吗？如果问题得不到解决怎么办？部分解决方案可行吗？这个问题与其他问题有什么关系，或者与其他问题的解决方案有什么关系？问题多久改变一次？问题改变意味着什么？还需要解决吗？现实世界中的哪些力量可能会导致变化？我们能期望这样的变化有多激进呢？\n我们很快就会发现问题不是解决方案，而是问题本身！如果这些问题中至少有一些没有答案，我们怎么能开始幻想如何最好地为我们的“问题”开发一个“解决方案”呢？软件开发的魔咒是，我们永远不能完全回答所有这些问题，但它们对我们的企业至关重要！如果我们要寻找软件复杂性的根本原因，我们必须从解决这样的问题开始。\n当我们以某种方式将问题定义视为超出软件开发工作的范围时，我们就会给自己带来令人不快的惊喜--以及猖獗的复杂性。正如杰拉尔德·温伯格(Gerald Weinberg)在“你的灯亮了吗？”(Are Your Lights On？)中所说：“计算机领域是问题定义课程的母矿。”事实上，当我们试图实施一个解决方案时，任何关于问题是什么的模棱两可、误解、冲突、避免冲突等问题都会以复杂性的形式自然地回来困扰我们。\n考虑一个由实际领域中的实际组织进行的实际软件开发的示例：由挪威国家公共广播公司NRK提供的电视流媒体服务。那是我工作的地方。有什么问题吗？这要看你问谁了。你应该问谁呢？我正好在附近。如果你问我，我是从事这项服务的众多开发者之一，我可能会说类似于“为挪威公众提供流行的、高质量的、多样化的电视流媒体服务”。很明显，提供这样的服务不是一个纯粹的技术问题：我们需要伟大的内容、伟大的展示、伟大的可用性、伟大的交付平台等等。创建有用的、重要的软件系统是一项多学科的工作。\n同样清楚的是，这样一个高级别的问题陈述必须以一百万种方式加以解释和详细说明，才能具有可操作性。所有上述问题开始纷至沓来。谁提供必要的解释和审议？这个问题是谁造成的？是我们的首席执行官吗？电视流媒体服务的产品所有者？用户体验专家？我?。公众？答案是我们所有人都没有！\n但它会变得更糟，或者更有趣，这取决于你的观点。世界是动态的。不管我们喜不喜欢，它一直在变。因此，“问题”也发生了变化。这不是我们可以完全控制的事情。我们不存在于真空中。例如，公众媒体消费习惯的变化对我们的影响很大。国际媒体巨头的行动也影响着我们的行动，大型社交媒体平台的行动也是如此。一切都在改变，有时会从令人惊讶的角度以令人惊讶的方式发生变化。\n在这样的背景下，我们该如何解决“问题”呢？我们未来的最佳服务方向是什么？怎样才能使它更受欢迎，质量更高，更多样化，对公众更好？众说纷纭！是ML驱动的定制和个性化吗？它有更多的社交功能吗？挑战电视内容及其消费方式的是全新的身临其境的互动体验吗？我们也不知道。没人知道。\n如果认为有“用户”这回事，那就太天真了。如果真的有“使用者”这回事，以为他们可以为我们提供“问题”，实在是太天真了。如果他们能向我们提供“问题”，以为它会长期稳定，那就太天真了。如果“问题”确实随着时间的推移保持稳定，那么认为每个人都会以同样的方式理解它的想法是天真的。以此类推。\n我们不能指望“用户”向我们提供问题描述，至少我们不能用它来实现可执行规范。定义问题的问题随着时间的推移在一个具体但不断变化的背景下展开，在一个由人类行为者组成的复杂系统中展开。这不是无关紧要的，它在我们做的每件事中都根深蒂固。我们无法逃脱它。给它贴上意外标签也不会让它消失。\n我们应该接受它，而不是忽视它或梦想一个“理想世界”，在那里软件开发的所有这些方面都可以被忽略。事实上，不仅接受它，而且把它视为我们要处理的工作。软件开发人员不仅应该提供编程或在生产中运行软件的专业知识，还应该提供心理模型的外部化方面的专业知识，以促进交流和支持协作建模。软件开发在很大程度上是一个通信问题。我们应该积极参与定义、描绘、描述和探索超越软件系统的问题域本身。我们应该提供更好的概念和更丰富的语言来描述该领域。它将帮助我们发现新的和更好的问题描述，这将导致新的和更好的软件系统。这种探索是一个永无止境的发现、协商和重新评估的过程。我们应该在这方面发挥带头作用，而不是等待别人为我们做这件事。\n当我们假装有用户可以交给“开发团队”实现的“本质问题”时，我们是天真的柏拉图主义者。我们表现得好像“问题”是某种稳定和永恒的东西，是我们可以发现的先验的、神圣的实体。但这并不是大多数问题领域的现实。也许可以将这样的问题识别为纯粹抽象的数学结构--不需要在我们居住的转瞬即逝的世界中扎根的结构。但是大多数软件系统不处理这样的结构。\n相反，大多数程序或软件系统在不断变化的动态世界中处理非正式的、模棱两可的、自相矛盾的、波动的、不稳定的问题。“需要解决的问题”总是处于谈判和局部理解的状态。假设和假定的不变量被一个没有特别考虑我们试图描述它的现实所证明是无效的。事实上，如果没有现有模式的失效，就不可能有创新！软件开发的问题不是“如何实现给定问题的解决方案而不搬起石头砸自己的脚”。它是将本质上是非正式和不可形式化的东西正规化。正如斯蒂芬·杰伊·古尔德在“斑马到底是什么？”一书中所说的那样，“我不相信大自然的设计会让我们沮丧，但我还是为她的不妥协感到高兴。”\n作为软件开发人员，我们不能对这种情况视而不见。这是软件开发中的一个内在问题，因此也是一个基本问题，也是我们必须迎头解决的问题。在“世界与机器”(The World And The Machine)中，迈克尔·A·杰克逊(Michael A.Jackson)提到了他所说的“冯·诺依曼原理”：\n在应用这些方法的概念和问题不明确的情况下，使用确切的方法是没有意义的。\n这意味着我们必须获得深刻的理解和丰富的语言来描述问题域本身，而不仅仅是我们想要在该问题域中操作的软件系统。\n挑战在于成功地打好一场不可能的战斗。我们必须不断尝试将问题锁定到足够的程度，以便能够构建一台有用的机器来帮助解决问题，就像我们目前所理解的那样。我们必须接受这个解决方案是暂时的，因为问题会改变。然后，我们必须努力在一个根本不稳定的问题和一个渴望稳定的机器之间保持舞蹈，而不是倒下。\n如果我们忽视这一过程的本质，我们就不能指望这一努力取得成功。对软件复杂性的描述没有考虑到必然的正式系统和不可还原的非正式世界之间的持续紧张，这就遗漏了软件开发的一些基本内容。这就是为什么“走出焦油坑”是错误的。\n我认为我们需要接受和拥抱这个焦油坑。至少那时我们正在努力解决复杂性的真正原因。现实世界是一个又热又粘的地方。这是我们的软件系统和我们作为软件开发人员必须运行的地方。任何有趣的事情都不会是容易的。但是也许我们可以振作起来，一切都是有可能的！", "note_en": "I recently re-read the “ Out of the Tar Pit” paper by Ben Moseley and Peter Marks for a Papers We Love session at work. It is a pretty famous paper. You can find it at the Papers We Love repository at GitHub for the simple reason that lots of people love it. Reading the paper again triggered some thoughts, hence this blog post.\n  Beware of the Turing tar-pit in which everything is possible but nothing of interest is easy.\n A  Turing tar-pit is a language or system that is Turing complete (and so can do as much as any language or system can do) yet is cumbersome and impractical to use. The Turing machine itself is a Turing tar-pit, because you probably wouldn’t use it at work to solve real problems. It might be amusing but not practical.\n The implication of the title is that we are currently in a Turing tar-pit, and we need to take measures to get out of it. Specifically, the measures outlined in the paper.\n The paper consists of two parts. The first part is an essay about the causes and effects of complexity in software. The second part is a proposed programming model to minimize so-called accidental complexity in software.\n The argument of the paper goes like this: Complexity is the primary cause of problems in software development. Complexity is problematic because it hinders the understanding of software systems. This leads to all kinds of bad second-order effects including unreliability, security issues, late delivery and poor performance, and – in a vicious circle – compound complexity, making all the problems worse in a non-linear fashion as systems grow larger.\n Following  Fred Brooks in “ No Silver Bullet“, the authors distinguish between  essential and  accidental complexity. The authors define “essential complexity” as the complexity inherent in the problem seen by the users. The “accidental complexity” is all the rest, including everything that has to do with the mundane, practical aspects of computing.\n The authors identify  state handling,  control flow and  code volume as drivers of complexity. Most of this complexity is labeled “accidental”, since it has to do with the physical reality of the machine, not with the user’s problem.\n The proposed fix is to turn the user’s informal problem statement into a formal one: to derive an executable specification. Beyond that, we should only allow for the minimal addition of “accidental” complexity as needed for practical efficiency concerns.\n The authors find our current programming models inadequate because they incur too much accidental complexity. Hence a new programming model is needed, one that incurs a minimum of accidental complexity. The second part of the paper presents such a model.\n What struck me as I was reading the paper again was that it is wrong about the causes of complexity and naive about software development in general.\n The paper is wrong for two reasons. First, because it treats software development as an implementation problem. It would be nice if that were true. It’s not. We will not get much better at software development if we keep thinking that it is. Second, because it ignores the dynamics of software development and makes invalid assumptions. Specifically, it is naive about the nature of the problems we address by making software.\n I agree with the authors that complexity is a tremendous problem in software. The non-linear cumulation of complexity often threatens to make non-trivial software development efforts grind to a halt. Many software systems are not just riddled with  technical debt which is the term we often use for runaway complexity – they have practically gone bankrupt! However, the problem of complexity cannot be solved by means of a better programming model alone. We must trace the causes of complexity beyond the realm of the machine and into the real world. While better programming models would be nice, we can’t expect wonders from them. The reason is that the root cause of complexity is to be found in the strenuous relationship between the software system and the world in which it operates. This is outside the realm of programming models.\n According to the authors, the role of a software development team is “to produce (using some given language and infrastructure) and maintain a software system which serves the purposes of its users”. In other words, the role is to implement the software. The role of the user, on the other hand, is to act as oracle with respect to the problem that needs to be solved. The authors note in parenthesis that they are assuming “that the users do in fact know and understand the problem that they want solved”. Yet it is well-known that this assumption doesn’t hold! Ask anyone in software! Already we’re in trouble. How can we create an executable specification without a source for this knowledge and understanding?\n  In any non-trivial system there is some complexity inherent in the problem that needs to be solved.\n So clearly the problem is important. But what is it? In fact, let’s pull the sentence “the problem that needs to be solved” apart a bit, by asking some questions.\n Where did the problem come from? Who defined the problem? How is the problem articulated and communicated, by whom, to whom? Is there agreement on what the problem is? How many interpretations and formulations of the problem are there? Why this problem and not some other problem? Who are affected by this problem? Who has an interest in it? Who owns it? Why does the problem matter? Who determined that it was a problem worth solving? Why does it need to be solved? How badly does it need to be solved? Is time relevant? Has it always been a problem? How long has this problem or similar problems existed? Could it cease to be a problem? What happens if it isn’t solved? Is a partial solution viable? How does the problem relate to other problems, or to solutions to other problems? How often does the problem change? What does it mean for the problem to change? Will it still need solving? What forces in the real world could potentially lead to changes? How radical can we expect such changes to be?\n We quickly see that the problem isn’t  the solution, the problem is the problem itself! How can we even begin to have illusions about how to best develop a “solution” to our “problem” without answers to at least some of these questions? The curse of software development is that we can never fully answer all of these questions, yet they are crucial to our enterprise! If we are to look for root causes of complexity in software, we must start by addressing questions such as these.\n When we treat the problem definition as somehow outside the scope of the software development effort, we set ourselves up for nasty surprises – and rampant complexity. As  Gerald Weinberg put it in “ Are Your Lights On?“: “The computer field is a mother lode of problem definition lessons.” Indeed, any ambiguity, misunderstandings, conflicts, conflict avoidance etc with respect to what the problem  is will naturally come back to haunt us in the form of complexity when we try to implement a solution.\n Consider an example of actual software development by an actual organization in an actual domain: the TV streaming service offered by NRK, the national public broadcaster in Norway. It’s where I work. What is the problem? It depends on who you ask. Who should you ask? I happen to be nearby. If you ask me, one of many developers working on the service, I might say something like “to provide a popular, high-quality, diverse TV streaming service for the Norwegian public”. It is immediately clear that providing such a service is not a purely technical problem: we need great content, great presentation, great usability, a great delivery platform, among many other things. Creating useful, non-trivial software systems is a multi-disciplinary effort.\n It is also clear that such a high-level problem statement must be interpreted and detailed in a million ways in order to be actionable. All the questions above start pouring in. Who provides the necessary interpretation and deliberation? Who owns this problem? Is it our CEO? The product owner for the TV streaming service? The user experience experts? Me? The public? The answer is all and none of us!\n But it gets worse, or more interesting, depending on your perspective. The world is dynamic. It changes all the time, whether we like it or not. Hence “the problem” changes as well. It is not something that we can exercise full control over. We don’t exist in a vacuum. We are heavily influenced by changes to the media consumption habits of the public, for instance. The actions of the international media giants influence our actions as well, as do the actions of the large social media platforms. Everything changes, sometimes in surprising ways from surprising angles.\n With this backdrop, how do we address “the problem”? What is the best future direction for our service? What would make it more popular, higher quality, more diverse, better for the public? Opinions vary! Is it ML-driven customization and personalization? Is it more social features? Is it radical new immersive and interactive experiences that challenge what TV content is and how it is consumed? We don’t know. No-one knows.\n It is naive to think that there is such a thing as “the user”. If there were such a thing as “the user”, it is naive to think that they could provide us with “the problem”. If they could provide us with “the problem”, it is naive to think that it would stay stable over time. If “the problem” did stay stable over time, it is naive to think that everyone would understand it the same way. And so on and so forth.\n We cannot expect “the user” to provide us with a problem description, at least not one that we could use to implement an executable specification. The problem of defining the problem unfolds over time in a concrete yet shifting context, in a complex system of human actors. There is nothing inessential about this, it is ingrained in everything we do. We can’t escape from it. Labeling it accidental won’t make it go away.\n Instead of ignoring it or dreaming about an “ideal world” where all of these aspects of software development can be ignored, we should accept it. Not only accept it, in fact, but see it as our job to handle. Software developers should provide expertise not just in programming or in running software in production, but also in the externalization of mental models to facilitate communication and enable collaborative modelling. Software development is largely a communication problem. We should take active part in defining, delineating, describing and exploring the problem domain itself, which goes beyond the software system. We should contribute to better concepts and a richer language to describe the domain. It will help us uncover new and better problem descriptions, which will lead to new and better software systems. This exploration is a never-ending process of discovery, negotiation and reevaluation. We should lead in this effort, not wait for someone else to do it for us.\n When we pretend that there is such a thing as “the essential problem” that the user can hand over to “the development team” for implementation, we are being naive Platonists. We’re acting as if “the problem” is something stable and eternal, an a priori, celestial entity that we can uncover. But that is not the reality of most problem domains. It may be possible to identify such problems for purely abstract, mathematical structures – structures that need no grounding in the fleeting world that we inhabit. But most software systems don’t deal with such structures.\n Instead, most programs or software systems deal with informal, ambiguous, self-contradictory, fluctuating, unstable problems in a shifting, dynamic world. “The problem that needs solving” is always in a state of negotiation and partial understanding. Assumptions and presumed invariants are rendered invalid by a reality that has no particular regard for our attempts to describe it. Indeed, there can be no innovation without the invalidation of existing models! The problem of software development is not “how to implement a solution to a given problem without shooting yourself in the foot”. It is to formalize something that in its nature is informal and unformalizable. As  Stephen Jay Gould puts it in “ What, if anything, is a zebra?“, “I do not believe that nature frustrates us by design, but I rejoice in her intransigence nonetheless.”\n As software developers, we can’t turn a blind eye to this state of affairs. It is an  intrinsic and hence  essential problem in software development, and one that we must tackle head-on. In “ The World and the Machine“,  Michael A. Jackson refers to what he calls the “Von Neumann principle”:\n There is no point in using exact methods where there is no clarity in the concepts and issues to which they are to be applied.\n This means that we must gain a deep understanding and a rich language to describe the problem domain itself, not just the software system we want to operate in that problem domain.\n The challenge is to fight an impossible battle successfully. We must constantly try to pin down a problem to a sufficient degree to be able to construct a useful machine that helps solve the problem, as we currently understand it. We must accept that this solution is temporary since the problem will change. And then we must try to keep a dance going on between a fundamentally unstable problem and a machine that longs for stability, without toppling over.\n We can’t hope to be successful in this endeavor if we ignore the nature of this process. An account of complexity in software that doesn’t account for the continuous tension between a necessarily formal system and an irreducibly informal world is missing something essential about software development. That’s why “Out of the Tar Pit” is wrong.\n I think we need to accept and embrace the tar-pit. At least then we’re grappling with the real causes of complexity. The real world is a hot and sticky place. This is where our software systems and we, as software developers, must operate. Nothing of interest is ever going to be easy. But perhaps we can take heart that everything is still possible!", "posttime": "2020-05-23 15:43:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "焦油,tar,问题", "title": "进入焦油坑", "title_en": "Into the Tar Pit", "transed": 1, "url": "https://einarwh.wordpress.com/2020/05/19/into-the-tar-pit/", "via": "", "real_tags": ["焦油", "tar", "问题"]}, {"category": "", "categoryclass": "", "imagename": "ffc75dc14ef85fa89ac324b6b288dc20.jpg", "infoid": 1003380, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我们138亿年的宇宙中，像我们的银河系一样的大多数星系都是逐渐形成的，达到大质量的时间相对较晚。但是，用阿塔卡马大毫米/亚毫米阵列(ALMA)发现的一个巨大的旋转盘状星系，在宇宙只有现在年龄的10%时被发现，挑战了传统的星系形成模型。这项研究发表在2020年5月20日的“自然”杂志上。星系DLA0817G，以已故天文学家亚瑟·M·沃尔夫的名字昵称为沃尔夫盘，是迄今观测到的最远的旋转盘状星系。ALMA无与伦比的力量使我们有可能看到这个星系以每秒170英里(272公里)的速度旋转，类似于我们的银河系。\n德国海德堡马克斯·普朗克天文学研究所的主要作者马塞尔·尼尔曼说，虽然之前的研究暗示了这些早期旋转的富含气体的圆盘的存在，但多亏了ALMA，我们现在有明确的证据表明，它们最早发生在大爆炸后的15亿年前，德国海德堡马克斯·普朗克天文学研究所的主要作者马塞尔·尼尔曼(Marcel Neeleman)说。\n沃尔夫圆盘的发现为许多星系形成模拟提供了挑战，这些模拟预测，在宇宙演化的这一点上，大质量星系是通过较小星系和热气团的多次合并而成长的。\n尼尔曼解释说，我们在宇宙早期发现的大多数星系看起来都像火车残骸，因为它们经历了始终如一的、经常是猛烈的合并。这些热合并使我们很难形成有序的、冷旋转的圆盘，就像我们在我们现在的宇宙中观察到的那样。\n在大多数星系形成的情景中，星系在大爆炸后60亿年左右才开始显示出结构良好的圆盘。事实上，天文学家在宇宙只有现在年龄的百分之十的时候发现了这样一个盘状星系，这表明肯定有其他生长过程主导了这一事实。\n这篇论文的合著者、加州大学圣克鲁斯分校的J·泽维尔·普罗查斯卡说，我们认为沃尔夫圆盘主要是通过冷气体的稳定积累而成长起来的。然而，剩下的问题之一是如何在保持相对稳定的旋转圆盘的同时组装如此大的气团。\n研究小组还利用国家科学基金会的卡尔·G·詹斯基超大型阵列(VLA)和NASA/ESA哈勃太空望远镜来了解更多关于沃尔夫圆盘中恒星形成的信息。在射电波段，ALMA观察了星系中原子气体和尘埃的运动和质量，而VLA则测量了分子质量--恒星形成的燃料。在紫外光下，哈勃观测到了大质量恒星。普罗查斯卡解释说，沃尔夫盘中的这一比率至少是我们银河系的十倍。它一定是早期宇宙中最多产的盘状星系之一。\n沃尔夫圆盘是ALMA于2017年首次发现的。尼尔曼和他的团队在检查一个更远的类星体发出的光时发现了这个星系。类星体发出的光在穿过银河系周围巨大的氢气库时被吸收了--这就是它是如何揭示自己的。天文学家没有寻找来自极其明亮但更稀有的星系的直射光，而是使用这种吸收方法来寻找早期宇宙中更暗、更正常的星系。\n尼尔曼说，我们用这种方法发现沃尔夫圆盘的事实告诉我们，它属于早期存在的正常星系群。当我们与ALMA的最新观测令人惊讶地显示它在旋转时，我们意识到早期旋转的星系并不像我们想象的那么罕见，而且应该有更多的旋转星系。\n美国国家科学基金会的天文学项目主任乔·佩斯(Joe Pesce)说，这一观测集中体现了ALMA给射电天文学带来的高级灵敏度是如何增强了我们对天文学的理解。国家科学基金会是该望远镜的资金来源，该基金会负责天文学项目的主任乔·佩斯(Joe Pesce)说。ALMA允许我们在几乎每一次观测中都有新的、意想不到的发现。更多信息：宇宙大爆炸15亿年后，一个寒冷、巨大、旋转的盘状星系，自然界(2020)。网址：10.1038/s41586-0202276-y，网址：www.nature.com/products/s41586-0202276-y", "note_en": "In our 13.8 billion-year-old universe, most galaxies like our Milky Way form gradually, reaching their large mass relatively late. But a new discovery made with the Atacama Large Millimeter/submillimeter Array (ALMA) of a massive rotating disk galaxy, seen when the universe was only ten percent of its current age, challenges the traditional models of galaxy formation. This research appears on 20 May 2020 in the journal  Nature.    Galaxy DLA0817g, nicknamed the Wolfe Disk after the late astronomer Arthur M. Wolfe, is the most distant rotating disk galaxy ever observed. The unparalleled power of ALMA made it possible to see this galaxy spinning at 170 miles (272 kilometers) per second, similar to our Milky Way.\n  &#34;While previous studies hinted at the existence of these early rotating gas-rich disk  , thanks to ALMA we now have unambiguous evidence that they occur as early as 1.5 billion years after the Big Bang,&#34; said lead author Marcel Neeleman of the Max Planck Institute for Astronomy in Heidelberg, Germany.\n    The discovery of the Wolfe Disk provides a challenge for many galaxy formation simulations, which predict that massive galaxies at this point in the evolution of the cosmos grew through many mergers of smaller galaxies and hot clumps of gas.\n  &#34;Most galaxies that we find early in the universe look like train wrecks because they underwent consistent and often &#39;violent&#39; merging,&#34; explained Neeleman. &#34;These hot mergers make it difficult to form well-ordered, cold rotating disks like we observe in our present universe.&#34;\n   In most galaxy formation scenarios, galaxies only start to show a well-formed disk around 6 billion years after the Big Bang. The fact that the astronomers found such a disk galaxy when the universe was only ten percent of its current age, indicates that other growth processes must have dominated.\n  &#34;We think the Wolfe Disk has grown primarily through the steady accretion of cold gas,&#34; said J. Xavier Prochaska, of the University of California, Santa Cruz and coauthor of the paper. &#34;Still, one of the questions that remains is how to assemble such a large gas mass while maintaining a relatively stable, rotating disk.&#34;\n    The team also used the National Science Foundation&#39;s Karl G. Jansky Very Large Array (VLA) and the NASA/ESA Hubble Space Telescope to learn more about star formation in the Wolfe Disk. In radio wavelengths, ALMA looked at the galaxy&#39;s movements and mass of atomic gas and dust while the VLA measured the amount of molecular mass—the fuel for star formation. In UV-light, Hubble observed massive stars. &#34;The   rate in the Wolfe Disk is at least ten times higher than in our own galaxy,&#34; explained Prochaska. &#34;It must be one of the most productive disk galaxies in the early universe.&#34;\n       The Wolfe Disk was first discovered by ALMA in 2017. Neeleman and his team found the galaxy when they examined the light from a more distant quasar. The light from the quasar was absorbed as it passed through a massive reservoir of hydrogen gas surrounding the galaxy—which is how it revealed itself. Rather than looking for direct light from extremely bright, but more rare galaxies, astronomers used this &#39;absorption&#39; method to find fainter, and more &#39;normal&#39; galaxies in the early universe.\n  &#34;The fact that we found the Wolfe Disk using this method, tells us that it belongs to the normal population of galaxies present at early times,&#34; said Neeleman. &#34;When our newest observations with ALMA surprisingly showed that it is rotating, we realized that early rotating   galaxies are not as rare as we thought and that there should be a lot more of them out there.&#34;\n  &#34;This observation epitomizes how our understanding of the   is enhanced with the advanced sensitivity that ALMA brings to radio astronomy,&#34; said Joe Pesce, astronomy program director at the National Science Foundation, which funds the telescope. &#34;ALMA allows us to make new, unexpected findings with almost every observation.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tA cold, massive, rotating disk galaxy 1.5 billion years after the Big Bang,  Nature (2020).  DOI: 10.1038/s41586-020-2276-y ,  www.nature.com/articles/s41586-020-2276-y", "posttime": "2020-05-23 15:22:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "早期,discovers,星系", "title": "ALMA在早期宇宙中发现大质量旋转盘", "title_en": "ALMA Discovers Massive Rotating Disk In Early Universe", "transed": 1, "url": "https://phys.org/news/2020-05-alma-massive-rotating-disk-early.html", "via": "", "real_tags": ["早期", "discovers", "星系"]}, {"category": "", "categoryclass": "", "imagename": "7717ad7eed59baca64ed55ee7e10107a.jpg", "infoid": 1003379, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2006年，当研究员蒂姆·巴塞洛莫斯(Tim Bartholomaus)在阿拉斯加的罗特冰川(Root Glacier)周围徒步旅行安装科学仪器时，遇到了一些意想不到的事情。\n这到底是怎么回事！&#34；巴塞洛马回忆起当时的想法。他是爱达荷大学的冰川学家。\n冰川上散落着一团团苔藓。他们没有附着在任何东西上，他们只是躺在冰上休息，他说。在白色的世界里，它们是亮绿色的。\n出于好奇，他和两位同事开始研究这些奇怪的苔藓球。他们在“极地生物学”(Polar Biology)杂志上报道，这些球可以持续数年，并以一种协调的、羊群的方式四处移动，这是研究人员目前还无法解释的。\n整个苔藓球群体，整个群体，以大致相同的速度和方向移动，Bartholomaus说。这些速度和方向可能会在几周内发生变化。\n上世纪50年代，一位冰岛研究人员在“冰川学杂志”(Journal Of Glaciology)上对它们进行了描述，指出滚石可以聚集苔藓。他称它们为冰川老鼠。\n这项新工作增加了对这些绒毛球的一小部分研究，尽管冰川学家早就知道并倾向于喜欢它们。\n同样来自爱达荷大学的野生生物学家索菲·吉尔伯特说，它们看起来真的很像在冰川上奔跑的小哺乳动物、小老鼠、花栗鼠或老鼠，尽管它们的动作显然非常缓慢。\n每个球都像一个柔软、潮湿、柔软的苔藓枕头。这些球可以由不同的苔藓种类组成，并被认为是围绕着某种杂质形成的，比如一点灰尘。它们已经在阿拉斯加、冰岛、斯瓦尔巴群岛和南美被发现，尽管它们不会在任何冰川上生长--似乎条件必须恰到好处。\n吉尔伯特和巴塞洛莫斯以及他们在华盛顿州立大学的同事斯科特·霍塔林(Scott Hotaling)对他们的动议感兴趣。\n吉尔伯特说，大多数看着它们的人都会立即想知道，嗯，我想知道它们是不是以某种方式在这里打滚。我脑海中浮现的是小黄花，它们显然是完全不同的，但也是圆的，滚来滚去的。\n她指出，球的整个表面必须定期暴露在阳光下。吉尔伯特说，这些东西必须真的滚来滚去，否则底部的苔藓就会死掉。\n其他研究人员已经注意到了它们滚动的可能性，他们之前观察到，有时可以发现这些球在冰基上摇摇欲坠。当苔藓球隔离了下面的冰，防止它像周围的冰一样快速融化时，这个基座可能会形成。科学家们怀疑球最终会从基座上倾倒并滚开。\n为了跟踪阿拉斯加30个苔藓球的运动，吉尔伯特和巴塞洛马斯在每个苔藓球上标上了一个小铁丝圈，上面有一个彩色珠子的识别序列。在2009年的54天时间里，他们追踪了每个球的位置。他们在2010年、2011年和2012年回来检查他们。\n巴塞洛莫斯说，通过年复一年地回来，我们可以计算出这些单独的苔藓球的寿命至少是，你知道的，五六年，甚至可能更长。\n苔藓球的运动很奇特。研究人员曾预计，这些球会通过从冰基上滚落而随机移动。现实是不同的。这些球以一种精心设计的队形平均每天移动约一英寸-就像一群鸟或一群角马。\n巴塞洛马斯说，当我们参观他们所有人的时候，他们都在相对缓慢地移动，最初都是向南移动。然后他们都开始加速，并开始向西方偏离。然后他们又放慢了速度，向西前进了更远。\n研究人员考虑了几种可能的解释。第一个，也是最明显的一个，就是他们刚从山坡上滚下来。但测量结果显示，苔藓球并没有下坡。\n巴塞洛马乌斯说，我们下一步想，也许是风把它们吹向了一致的方向，所以我们测量了主要的风向。\n吉尔伯特说，不过，当事情不符合你的假设，不符合你的思维方式时，这总是令人兴奋的。\n丹麦气象研究所的气候科学家露丝·莫特伦(Ruth Mottram)表示：我认为，冰川表面周围的能量和热量可能存在某种物理意义上的解释，但我们还没有完全做到这一点。\n长期以来，她一直很欣赏冰川老鼠，这是她在冰岛进行田野调查时看到的。她说，当你把它们放在一大堆东西上看时，它们非常吸引人。很难不去想“星际迷航”之类的事情。\n她希望看到更多关于它们的研究，因为对冰川生命的研究在最近几年真的开始了。曾经被认为是一个寒冷、贫瘠的世界，现在却发现到处都是细菌、藻类和神秘的生命形式。\n莫特伦说：几年前我参与了一些研究，我们估计格陵兰冰盖夏季融化的5%到10%与表面藻类和细菌的生长有关。\n事实上，根据2012年的一项研究，包括简单蠕虫和水熊在内的微小生物甚至可以生活在苔藓球内。\n诺丁汉特伦特大学(Nottingham Trent University)的尼古拉斯·米格利(Nicholas Midgley)说，当时，他和同事斯蒂芬·库尔森(Stephen Coulson)解剖了苔藓球，并在其中安装了加速计。米奇利说，从这一点我们可以推断它们实际上是在旋转。\n他们没有追踪球滚到哪里去。米格利说，这显然是开展并发表在“根冰川”(Root Glacier)上的工作促进了我们理解的地方。他指出，研究苔藓球的科学家非常少。\n巴塞洛莫斯说，他想再次回到鲁特冰川，好好地、长时间地寻找十多年前贴上标签的苔藓球。他知道那个地方仍然堆满了苔藓球。\n巴塞洛马斯说，我去年确实去过他们那里。我粗略地看了一眼，没有发现任何标签，但苔藓球还在那里。大概他们还在冰川上打滚，做着苔藓球的事情。", "note_en": "In 2006, while hiking around the  Root Glacier in Alaska to set up scientific instruments, researcher  Tim Bartholomaus encountered something unexpected.\n  &#34;What the heck is this!&#34; Bartholomaus recalls thinking. He&#39;s a glaciologist at the University of Idaho.\n  Scattered across the glacier were balls of moss. &#34;They&#39;re not attached to anything and they&#39;re just resting there on ice,&#34; he says. &#34;They&#39;re bright green in a world of white.&#34;\n  Intrigued, he and two colleagues set out to study these strange moss balls. In the journal  Polar Biology, they  report that the balls can persist for years and move around in a coordinated, herdlike fashion that the researchers can not yet explain.\n  &#34;The whole colony of moss balls, this whole grouping, moves at about the same speeds and in the same directions,&#34; Bartholomaus says. &#34;Those speeds and directions can change over the course of weeks.&#34;\n  In the 1950s, an Icelandic researcher  described them in the  Journal of Glaciology, noting that &#34;rolling stones  can gather moss.&#34; He called them &#34;jökla-mýs&#34; or &#34;glacier mice.&#34;\n    This new work adds to a very small body of research on these fuzz balls, even though glaciologists have long known about them and tend to be fond of them.\n    &#34;They really do look like little mammals, little mice or chipmunks or rats or something running around on the glacier, although they run in obviously very slow motion,&#34; says wildlife biologist  Sophie Gilbert, also at the University of Idaho.\n  Each ball is like a soft, wet, squishy pillow of moss. The balls can be composed of different moss species and are thought to form around some kind of impurity, like a bit of dust. They&#39;ve been seen in Alaska, Iceland, Svalbard and South America, although they won&#39;t grow on just any glacier — it seems that conditions have to be just right.\n  Their motion is what interested Gilbert and Bartholomaus, as well as their Washington State University colleague  Scott Hotaling.\n  &#34;Most people who would look at them would immediately wonder, &#39;Well, I wonder if they roll around out here in some way,&#39; &#34; says Gilbert. &#34;Tumbleweeds come to mind, which are obviously totally different, but also round and roll around.&#34;\n  She notes that the entire surface of the ball must periodically get exposed to the sun. &#34;These things must actually roll around or else that moss on the bottom would die,&#34; says Gilbert.\n  The possibility of their rolling had been noted by other researchers, who previously observed that the balls sometimes could be found teetering on a pedestal of ice. That pedestal might form as the moss ball insulated the ice underneath it, preventing it from melting as fast as the surrounding ice. Scientists suspected that the ball would eventually tip off of the pedestal and roll away.\n  To track the motion of 30 moss balls in Alaska, Gilbert and Bartholomaus tagged each one with a little loop of wire that had an identifying sequence of colored beads. Over a period of 54 days in 2009, they tracked the location of each ball. They returned to check on them in 2010, 2011 and 2012.\n  &#34;By coming back year after year,&#34; says Bartholomaus, &#34;we could figure out that these individual moss balls were living at least, you know, five, six years and potentially much, much longer.&#34;\n  The movement of the moss balls was peculiar. The researchers had expected that the balls would travel around randomly by rolling off their ice pedestals. The reality was different. The balls moved about an average of an inch a day in a kind of choreographed formation — like a flock of birds or a herd of wildebeests.\n  &#34;When we visited them all, they were all just sort of moving relatively slowly and initially toward the south,&#34; says Bartholomaus. &#34;Then they all started to speed up and kind of start to deviate toward the west. And then they slowed down again and progressed even farther to the west.&#34;\n    The researchers considered several possible explanations. The first, and most obvious one, is that they just rolled downhill. But measurements showed that the moss balls weren&#39;t going down a slope.\n  &#34;We next thought maybe the wind is sort of blowing them in consistent directions,&#34; says Bartholomaus, &#34;and so we measured the dominant direction of the wind.&#34;\n      &#34;It&#39;s always kind of exciting, though, when things don&#39;t comply with your hypothesis, with the way you think things work,&#34; says Gilbert.\n    &#34;I think that probably the explanation is somewhere in the physics of the energy and the heat around the surface of the glacier, but we haven&#39;t quite got there yet,&#34; says  Ruth Mottram, a climate scientist at the Danish Meteorological Institute.\n  She has long admired glacier mice, which she saw while doing fieldwork in Iceland. &#34;They&#39;re extremely engaging when you look at them in a great big mass,&#34; she says. &#34;It&#39;s very hard not to think of  tribbles from Star Trek or something like that.&#34;\n  She expects to see more research on them, as the study of life on glaciers has really taken off in recent years. What was once viewed as a cold, sterile world is now known to be full of bacteria and algae and mysterious life forms.\n  &#34;I was involved in some research a couple of years ago where we estimated that between 5 and 10% of the melt of the Greenland ice sheet in the summertime is related to the growth of algae and bacteria on the surface,&#34; says Mottram.\n  Indeed, tiny critters including simple worms and  water bears can even live inside moss balls, according to one  study from 2012.\n  Nicholas Midgley of Nottingham Trent University says that back then, he and his colleague  Stephen Coulson dissected moss balls and put accelerometers inside a number of them. &#34;From that we were able to deduce that they were actually rotating,&#34; says Midgley.\n  They did not track where the balls rolled. &#34;That&#39;s obviously where the work that&#39;s been undertaken and published on the Root Glacier advances our understanding,&#34; says Midgley, who notes that &#34;exceptionally few&#34; scientists have ever studied moss balls.\n  Bartholomaus says he&#39;d like to go back to Root Glacier again and do a good, long hunt for the moss balls that were tagged over a decade ago. He knows that the spot is still loaded with moss balls.\n  &#34;I did visit them last year,&#34; says Bartholomaus. &#34;I didn&#39;t find any tags during a quick cursory look, but the moss balls are still there. Presumably they&#39;re still rolling around on the glacier, doing their moss ball thing.&#34;", "posttime": "2020-05-23 15:15:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,冰川,fuzzy,苔藓", "title": "一群模糊的绿色“冰川老鼠”让科学家们感到困惑", "title_en": "Herd of Fuzzy Green 'Glacier Mice' Baffles Scientists", "transed": 1, "url": "https://www.npr.org/2020/05/22/858800112/herd-like-movement-of-fuzzy-green-glacier-mice-baffles-scientists", "via": "", "real_tags": ["科学家", "冰川", "fuzzy", "苔藓"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一家新公司入职可能是一件很奇怪的事情。除了这个听起来很像公司的名字本身(这让我们中的一些人觉得水刑)，他们还试图用一些奇怪的方式来教育新员工。\n这里有一种情况：你和大约12个新来的人在一个会议室里。你在背包里递给你一个触控杆Macbook Pro。这是你使用过的第一个这样的型号，你会发现你的自然打字位置突出了最上面一行的数字，并触发了通常存在于那里的元功能：亮度调高/调低，音量调高/调低，以及你所在的程序上下文中可能存在的任何其他功能。\n此外，这款键盘是声名狼藉的蝴蝶键盘，这是你第一次使用它们。你已经听说过这件事，但这是你第一次跳这件事的探戈。结果不是很好。尽管你有几十年的相对较高速度的打字经验，但你还是犯了很多错误。你开始觉得自己很老了。\n他们让你做一堆乱七八糟的事情来签到一些东西。他们有一个半途而废的单点登录系统，但实际上并非如此，而且有一大批供应商需要他们自己的授权材料。您必须在您的(个人！)上安装一堆应用程序。手机可以实现双重身份验证和其他安全功能：先是二人组，然后是谷歌应用程序，然后是Lastpass。你还可以在笔记本电脑上登录所有这些东西，一路上会造成大量的打字错误，并触发触摸栏上的东西。\n无论如何，在某个时刻，您可以开始执行此操作，现在是开始安装dev环境的时候了。您运行了一系列神秘的命令，其中包括您从提供的URL中获取的内容，并将其通过管道传输到shell中，从而让它随心所欲地做任何事情。本身没有合适的安装程序。\n这将开始下载数GB的数据。你和其他十几个人都在同一时间，在同一个封闭的空间里，在同一个无线网络上做这件事。你们中的大多数人坐在房间的中间，因此不是在有电源插座的墙上。你的笔记本电脑会发热，风扇也会变大。电池开始滴答作响。\n然后他们会要求你将其最小化，因为现在是做下一件事的时候了。他们说，让它在后台结束吧。它必须运行很长一段时间，这样我们才能进入下一阶段。\n是的，有人在这里试着教大家如何使用内部系统。每个人都要到这家调查公司的网站上输入他们写在记分板上的密码。你知道吗，在那些调查中，公司会在你上次交易时问你是否喜欢他们的服务？就是这种事。\n您应该深入内部工具来查看员工名录。你应该找到你的经理的名字，然后输入，然后输入他们的头衔。然后，你应该找出在公司其他地方拥有特定头衔的人的名字。\n你必须把它打对。在您这样做之前，它不会让您单击[下一步]。他们告诉您不要单击“后退”或重新加载或诸如此类的操作，因为您可能会搞砸。\n我有没有提到在这期间有一个定时器在滴答作响？大约2分钟开始，它就在那里，1：59，1：58，1：57，1：56，……。以此类推，一直如此。\n这基本上是制造压力和对可怕制度普遍憎恨的完美环境。其中一个问题是给一只狗取名，因为公司名录里有宠物。我没能很快找到一个。你应该在组织结构图上点击一下，直到找到为止。\n现在，当我遇到这样的事情时，我开始尖刻和恶毒，开始横向思考。就像，好吧，看着我不用你那愚蠢的系统，但不管怎样还是要得到答案。举个恰当的例子：前一天房间里有一只狗。我只是对着房间喊道：嘿，刚才在这里的那只狗叫什么名字？传感器？来点吗？六个字母？#34；……。答案又回来了：“鸡块”。我把它打进去，它起作用了。&#34；谢谢！&#34；\n事情就是这样进行的，问了更多愚蠢的问题，让我在他们愚蠢的工具上徒劳无功。最后，它说到下一部分就停在这里，并指出到目前为止我只完成了30%。是的，还有更多的事情要做，而且谁知道还会有多少模块以这种方式执行。呻吟。\n另一部分让你和其他人配对。你们两个都有笔记本电脑，但其中一台被故意忽略了，所以你不得不来回递送一台(或者把它滑到桌子上，随便什么)。你的失败现在成了别人的问题。更多的压力和对可怕过程的憎恨。\n事情还变得更好了：他们声称(并撒谎)，你的经理将能够看到这一结果。首先，我怀疑这是真的。其次，我的经理不会把结果如何放在心上。第三，我做这行的时间够长了，即使他们发现我讨厌他们糟糕的内部网工具和愚蠢的定时寻宝工具，而且在这方面做得很差，我也不在乎。\n他们说这样的话来吓唬后辈。这是胡说八道。我知道这一点，也是这样对待它的，但他们不知道，而且可能会担心。亲眼目睹这件事的发生告诉我，他们对待每个人都像对待孩子一样，即使是他们全新的软件人员也是如此。这是个坏兆头。\n又过了一个小时，我受够了。我告诉我的同桌(用另一台笔记本电脑的那个)，好的，回头见。他问我这一天是否做完了，我只说做完了。然后我站起来，悄悄地离开了。我再也没有回过水^H^致敬班。事实证明这无关紧要。\n第二天，我走了进去，刚好避开了登机区。我应该提一下，没有人要求或为我设立办公桌，所以我最终像难民一样在一些像餐厅摊位一样设置的公共空间扎营。一些已经在公司工作的朋友伸出援手，提供了他们自己对如何开始的看法，我就是从那里开始的。我站稳了脚跟，作为一个自我驱动的初学者项目，开始做一些稍微有用的事情。\n如果不是他们伸出援手帮助我，我很可能会在那里就完事了，然后就走了。相反，他们支持我。当然，这只是意味着我可以留下来度过2019年剩下的疯狂时光，一年后无论如何都会离开。\n结语：有一天，当我坐在没有办公桌的地方时，一个完全偶然的机会，我的经理走过，在我上任以来第一次发现了我，问我是否要和某个新上任的高层管理人员在炉边聊天。我甚至不知道这是一件事，但他说我应该去，所以我和他一起去了。\n我们来得有点早，人们围着我们站着。我最后被介绍给某人，我打了声招呼。他发现这已经是我在公司的第三天了，他问我，你有办公桌了吗？我说没有。很有趣，对，在我的新老板面前被问到这个问题。但是，嘿，诚实的问题会得到诚实的回答，这就是他得到的。\n后来我发现，问这个问题的人是首席执行官。不错。也许他是开玩笑的，但我是认真的：我没有办公桌。\n至于为什么我没有认出CEO：我才刚开始，我又不是记住了这些人的名字和面孔。你好，跟踪狂小镇还是亲屁股小镇，我都不是。我会在需要的时候学习它们，事实上，在适当的时候，我会在它出现的时候记住它们的名字和面孔。", "note_en": "Onboarding at a new company can be a weird thing. Besides the very corporate-sounding name itself (that makes some of us think&#34;waterboarding&#34;), there are some odd ways they try to &#34;teach&#34; the new employees.\n Here&#39;s a situation: you&#39;re in a conference room with about a dozen other new people. You&#39;re handed a touch bar Macbook Pro in a backpack. It&#39;s the first such model you&#39;ve ever used, and you&#39;re discovering that your natural typing position overhangs the top row of numbers, and is triggering the &#34;meta&#34; functions which typically live there: brightness up/down, volume up/down, and whatever else might be there from the context of the program you&#39;re in.\n Also, the keyboard is the infamous &#34;butterfly&#34; one, and this is your first time on one of them. You&#39;ve heard about it but this is your first tango with this particular thing. It turns out to not be very nice. You&#39;re making lots of mistakes, despite having decades of typing experience at relatively high speeds. You start feeling very old.\n They have you do a bunch of random crap to get signed in to things. They have a half-assed &#34;single sign on&#34; system that really isn&#39;t, and there are a bunch of vendors which require their own authorization stuff. You have to install a bunch of apps on your (personal!) phone to do the two-factor auth and other security stuff: there&#39;s Duo, then the Google app, and then Lastpass. You also get to sign in to all of this stuff on the laptop itself, making typing errors galore along the way, and triggering things on the touch bar.\n Anyway, at some point, you get this going, and now it&#39;s time to start &#34;installing&#34; the dev environment. You run a bunch of arcane commands, including something where you &#34;curl&#34; something from a provided URL, and pipe it into a shell, thus letting it do whatever it wants to do. There is not a proper installer per se.\n This starts downloading multiple gigabytes of data. You and the other dozen-or-so people are all doing this at the same time, in the same enclosed space, on the same wireless network. Most of you are sitting in the middle of the room and thus are not next to a wall with power outlets. Your laptop heats up, and the fan ramps up. The battery starts ticking down.\n Then they ask you to minimize that, because it&#39;s time for the next thing. Let it finish in the background, they said. It has to run for a long time and this way we can move on to the next stage.\n Yes, someone&#39;s here to try to teach the group how to use the internal systems. Everyone is to go out to this survey company&#39;s web site and type in a password they&#39;ve written on the marker board. You know those surveys where companies ask if you liked their service at your last transaction? It&#39;s that kind of thing.\n You&#39;re supposed to go dive into the internal tooling to look at the directory of employees. You&#39;re supposed to find your manager&#39;s name and type it in, followed by their title. Then you&#39;re supposed to find out the name of the person who has a specific title somewhere else in the company.\n You HAVE to type it in correctly. Until you do, it won&#39;t let you click [next]. They tell you not to click back or reload or anything like that, since &#34;you may screw it up&#34;.\n Did I mention there&#39;s a timer ticking down during all of this? It starts at maybe 2 minutes and it&#39;s just there, going 1:59, 1:58, 1:57, 1:56, ... and so on the whole time.\n This is basically the perfect environment for creating stress and general hatred of terrible systems. One of the questions was &#34;name a dog&#34;, because, well, the company directory included pets. I couldn&#39;t find one quickly. You were supposed to just click around the org chart until you found one.\n Now, when I run into a thing like this, I start getting snarky and bitchy and start thinking laterally. Like, okay, watch me not use your stupid system but get the answer anyway. Case in point: there had been a dog in the room the day before. I just called out to the room: &#34;Hey, what was the name of the dog that was in here before? Sensor? Morsel? Six letters?&#34; ... and the answer came back: &#34;Nugget&#34;. I typed it in and it worked. &#34;Thanks!&#34;\n It went on like this, asking more idiotic questions and sending me on wild goose chases through their stupid tools. Finally, it said &#34;stop here until the next part&#34; and noted that I had done only 30% of it so far. Yes, there was much more to go, plus who knows how many other modules were going to be executed this way. GROAN.\n Another part had you pair up with someone else. You both had laptops, but one was purposely ignored for this, so you had to hand the one back and forth (or slide it on the table, whatever). Your failings were now someone else&#39;s problem. More stress and hatred of a terrible process.\n It gets better, too: they had claimed (and lied) that &#34;your manager will be able to see the results of this&#34;. First of all, I doubt that was true. Second, my manager wouldn&#39;t give a rat&#39;s ass what the results of it would be. Third, I&#39;ve been doing this long enough that I don&#39;t care  even if they could find out that I hate their terrible &#34;intranet&#34; tools and moronic timed treasure hunt for dog names and people&#39;s titles and did poorly at it.\n They say stuff like that to scare the junior folks. It&#39;s bullshit. I know it and treat it as such, but they don&#39;t, and probably worry. Seeing it happen told me that they treat everyone like children, even their brand new software people. Bad sign.\n After another hour of this, I had enough. I told my table-mate (the one with the other laptop) &#34;well, see you around&#34;. He asked if I was &#34;done for the day&#34; and I just said &#34;yep&#34;. Then I got up and quietly exited. I never went back to any of the water^H^H^H^H^Honboarding classes. It turned out to not matter.\n  The next day, I went in and just avoided the onboarding area. I should mention that nobody had requested or set up a desk for me, so I wound up camped like a refugee in some common space that was set up like a restaurant booth. Some friends who had already been at the company reached out and provided their own take on how to get started, and I went from that. I got my footing and started doing mildly useful things as a self-driven starter project.\n If not for them reaching out and helping me, I probably would have just called it done right there and walked. Instead, they supported me. Of course, that just meant I got to stick around for the rest of the insanity that was my 2019, and wound up leaving anyway a year later.\n  Epilogue: while sitting there sans desk one day, by total chance, my manager walked by, spotted me for the first time since I had started, and asked if I was going to &#34;the fireside chat&#34; with some new incoming upper management type. I had no idea it even was a thing, but he said I should go, and so up I went with him.\n We were a little early and people were standing around. I wound up being introduced to someone and I said hello. He found out it was now my third day at the company and he asked &#34;do you have a desk yet&#34;, and I said I did not. It was funny, right, being asked that with my new boss right there. But hey, honest questions get honest answers, and that&#39;s what he got.\n I later found out the person asking the question was the CEO. Awesome.Maybe he meant it as a joke, but I was dead serious: I had no desk.\n As for why I didn&#39;t recognize the CEO: I had just started, and it&#39;s not like I memorize names and faces of these people. Hello, stalker-ville or ass-kisser-ville, and I am neither. I&#39;ll learn them as I need to learn them, and indeed, in due time, picked up the names and faces as it came up.", "posttime": "2020-05-23 15:14:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "危险,red", "title": "只是一些危险信号。别小题大作。别理他们就行了", "title_en": "Just some red flags. No big deal. Just ignore them", "transed": 1, "url": "https://rachelbythebay.com/w/2020/05/22/boarded/", "via": "", "real_tags": ["危险", "red"]}, {"category": "", "categoryclass": "", "imagename": "88fd6ddb8253d4481c2e73bf9c8b9c36.png", "infoid": 1003377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我曾经在某种程度上持有所有这些误解，今天我看到许多初学者都在与这些误解作斗争。我的一些术语可能不是标准的，所以这里有一张我使用的速记短语的表格，以及我想要表达的意思。\n简而言之：变量的生存期是编译器可以静态验证它所指向的数据在其当前内存地址有效的时间长度。我现在将用接下来的6000个单词更详细地介绍人们通常会感到困惑的地方。\n这种误解更多的是关于泛型，而不是生存期，但是泛型和生存期在铁锈中紧密交织在一起，所以谈到其中一个而不谈到另一个是不可能的。不管怎么说：\n当我第一次开始学习Rust时，我知道I32、&amp；I32和&amp；mut I32是不同的类型。我还理解一些泛型类型变量T表示包含所有可能类型的集合。然而，尽管我把这两件事分开理解，我还是不能把它们放在一起理解。在我的新手Rust头脑中，我认为泛型是这样工作的：\n%t包含所有拥有的类型。&amp；T包含所有不变的借用类型。&amp；mut T包含所有可变借用类型。T、&amp；T和&amp；mut T是不相交的有限集。漂亮，简单，干净，轻松，直观，完全错误。下面是泛型在Rust中的实际工作方式：\nT、&amp；T和&amp；mut T都是无限集合，因为可以借用ad-infinitum类型。T是&amp；T和&amp；mut的超集。&amp；T和&amp；mut T是不相交的集合。这里有几个例子来验证这些概念：\n&amp；T{}的特征特征{}实施&lt；T&&gt;；特征(&amp；t；T&&gt;；特征)&amp；T；T&&gt;；特征(&amp；t；T&&gt;；特征)编译错误(&amp；mut；T&&gt;；T&&gt;；特征)(&amp；mut T{})//编译错误。\n错误[E0119]。mut_`：--&gt；src/lib.rs：7：1|3|为T{}实施&lt；T&gt；特征|-第一个实现在此.。7|实施&amp；mut T{}的T&gt；特征|^`冲突的`&amp；mut_`实现\n编译器不允许我们定义&amp；T和&amp；mut T的特征实现，因为这将与已经包括所有&amp；T和&amp；mut T的特征实现冲突。以下程序按预期进行编译，因为&amp；T和&amp；mut T是不相交的：\n特征特征{}实施&amp；T&&gt;；特征{}//编译&amp；mut T{}//实施&lt；T&&gt;；特征。\n大多数Rust初学者都是在如下代码示例中第一次了解静态生存期的：\n他们被告知，字符串文字被硬编码到编译后的二进制文件中，并且在运行时加载到只读存储器中，因此它是不可变的，并且对整个程序有效，这就是它是静态的。围绕使用static关键字定义静态变量的规则进一步强化了这些概念。\n静态字节：[U8；3]=[1，2，3]；静态mut_bytes：[U8；3]=[1，2，3]；fn main(){mut_bytes[0]=99；//编译错误，变异静态不安全{mut_bytes[0]=99；assert_eq！(99，mut_bytes[0])；}}。\n静态生存期可能是以静态变量的默认生存期命名的，对吗？因此，静态生存期必须遵循所有相同的规则是有道理的，对吗？\n是的，但是具有静态生存期的类型与以静态生存期为界限的类型是不同的。后者可以在运行时动态分配，可以安全自由地变异，可以删除，并且可以存活任意持续时间。\n静态T是对某些T的不可变引用，这些T可以安全地无限期地保持很长时间，包括直到程序结束。只有当T本身是不可变的，并且在创建引用后不会移动时，这才是可能的。t不需要在编译时创建。有可能在运行时生成随机的动态分配的数据，并返回对它的静态引用，代价是内存泄漏，例如\n使用rand；//在运行时生成随机静态字符串引用fn rand_str_Generator()-&gt；&amp；&#39；静态字符串{let rand_string=rand：：Random：：&lt；U64&gt；()。to_string()；Box：：Leak(rand_string。into_boxed_str())}。\nT：&#39；Static是一些T，它可以安全地无限期地保持很长时间，包括直到程序结束。T：&#39；static包括所有&amp；&amp；static T，但它也包括所有拥有的类型，如String、Vec等。某些数据的所有者可以保证，只要所有者持有数据，数据就永远不会失效，因此所有者可以安全地无限期地持有数据，包括直到程序结束。T：&#39；静态应理解为&#34；T由&#34；静态生存期限定，而不是&#34；T具有&#34；静态生存期。帮助说明这些概念的程序：\n使用rand；fn drop_static&lt；T：&#39；static&gt；(t：t){std：：mem：：drop(T)；}fn main(){let mut string：vec&lt；string&gt；=vec：：new()；for_in 0.。10{if rand：：Random(){//所有字符串都是随机生成的//并在运行时动态分配，让string=rand：：Random：：&lt；U64&gt；()。to_string()；字符串。Push(String)；}//字符串是拥有的类型，因此它们由字符串中mut字符串的静态约束{//所有字符串都是可变字符串。PUSH_STR(&#34；a突变&#34；)；//所有字符串都是可丢弃的DROP_STATIC(字符串)；//编译}//程序结束前所有字符串都已失效println！(&#34；我是程序的结尾&#34；)；}。\n如果T：静态，则T可以是具有静态生存期的借用类型或拥有类型。\n&amp；A T需要并暗示T：&#39；a，因为如果T本身对&#39；a无效，则对生命周期&a的引用不能对&#39；a有效。例如，Rust编译器永远不允许构造类型&amp；static Ref&lt；&#39；a，因为如果引用仅对&#39；a有效，我们就不能使&#39；a成为静态类型。\n//仅采用&#39；a，t：&#39；a，T：&#39；a&gt；(t：&amp；&39；a){}//以&#39；fn t_bound&lt；&#39；a，T：&#39；a&gt；(t：t){}//所拥有的包含引用结构的类型为边界的ref类型(&#39；a_ref&lt；&#39；a，T：&#39；a&gt；(t：t){}//包含引用结构的fn t_bound&lt；(t：t){}//拥有的类型包含引用结构。a&gt；(&amp；#39；a T)；fn main(){let string=string：：from(&#34；string&#34；)；t_Bound(&amp；string)；//编译t_Bound(Ref(&amp；string))；//编译t_Bound(&amp；Ref(&amp；String))；//编译t_ref(&amp；string)；//编译t_ref(Ref(&amp；String))；//编译t_ref(&amp；string)；//编译t_ref(&amp；string。//编译错误，预期的ref，找到struct t_ref(&amp；Ref(&amp；string))；//编译//字符串变量由&#39；a t_bound(String)；//编译}。\n多亏了Rust的生存期省略规则，这个令人欣慰的误解得以保留，它允许您省略函数中的生存期注释，因为Rust借入检查器将按照以下规则推断它们：\n如果存在多个输入生存期，但其中之一是&amp；self或&amp mut self，则self的生存期将应用于所有输出引用\n//elided FN打印(s：&amp；str)；//扩展FN打印(s：&amp；&39；a&gt；(s：&amp；&#39；a str)；//elid FN trim(s：&amp；str)-&gt；&amp；str；//扩展FN trim&lt；&39；a&gt；(s：&amp；&39；a str)-&gt；&amp。//非法，无法确定输出寿命，没有输入fn get_str()-&gt；&amp；str；//显式选项包括fn get_str；()-&gt；&amp；&39；a str；//毫无意义的泛型，因为&#39；a必须等于&#39；static fn get_str()-&gt；&amp；&39；static str。//更好、更明确//非法，无法确定输出寿命，多个输入fn重叠(s：&amp；str，t：&amp；str)-&gt；&amp；str；//显式(但仍部分省略)选项包括fn重叠&lt；&39；a&gt；(s：&amp；&39；a str，t：&amp；str)-&gt；&amp；a str；/。t超出fn重叠&lt；a&gt；(s：&amp；str，t：&amp；&39；a str)-&gt；&amp；a str；//输出不能超过fn重叠&lt；&39；a&gt；(s：&amp；a str，t：&amp；a str)-&gt；&amp。//输出可以超过s&amp；t FN重叠(s：&amp；str，t：&amp；str)-&gt；&amp；&39；静态str；//输出可以超过s&amp；t FN重叠&lt；&39；a&gt；(s：&amp；str，t：&amp；str)-&&gt;&amp；&amp；a str；//输入和amp；之间没有关系。&#39；a，&#39；b&&gt;(s：&amp；a str，t：&amp；&39；b str)-&gt；&amp；&amp；&#39；a，&#39；b&&gt;(s：&amp；&39；a str，t：&amp；&39；b str)-&gt；&amp；&#39；b。fn重叠&lt；a&gt；(s：&amp；a str，t：&amp；a str)-&gt；&amp；a str；fn重叠&lt；a，&#39；b&gt；(s：&amp；&39；a str，t：&amp；&39；b str)-&gt；&amp；&39；&#39；a，&#39；b，&#39；c&&gt;；(s：&amp；&39；a str，t：&amp；&#39；b str)-&gt；&amp；&#39；c str；//省略FN比较(&amp；self，s：&amp；str)-&gt；&amp；&amp；str；//扩展的fn比较&lt；a，&39；b&gt。&#39；a Self，&amp；&b str)-&gt；&amp；a str；\nRust程序有可能在技术上是可编译的，但在语义上仍然是错误的。以此为例：\nstruct ByteIter&lt；&#39；a&&gt;；{剩余部分：&amp；&39；a[U8]}实施&lt；&#39；a；ByteIter&lt；{fn Next(&amp；mut self)-&gt；option&lt；&amp；U8&&gt;；{如果自我保留。is_Empty(){None}Else{let byte=&amp；self.reminder[0]；self.reminder=&amp；self.remindance[1..]；Some(Byte)}fn main(){let mut bytes=ByteIter{Remainder：B&#34；1&#34；}；assert_eq！(Some(&amp；b&#39；1&#39；)，bytes。next())；assert_eq！(无，字节。Next())；}。\nByteIter是迭代字节切片的迭代器。为简洁起见，我们将跳过迭代器特征实现。它似乎工作得很好，但是如果我们想一次检查几个字节怎么办？\nfn main(){设mut bytes=ByteIter{剩余部分：B&#34；1123&#34；}；设byte_1=字节。Next()；设byte_2=字节。Next()；如果byte_1==byte_2{//做点什么}}。\n错误[E0499]：不能一次将`bytes`作为可变变量多次借用--&gt；src/main.rs：20：18|19|let byte_1=bytes。Next()；|-第一个可变借入出现在这里20|let byte_2=bytes。Next()；|^第二次可变借入出现在此处21|If BYTE_1==BYTE_2{|-这里稍后使用的第一次借入。\n我想我们可以复制每个字节。当我们正在处理字节时，复制是可以的，但是如果我们将ByteIter转换为可以迭代任何[T]的泛型切片迭代器，那么我们可能希望在将来将其用于可能非常昂贵或不可能复制/克隆的类型。哦，好吧，我想我们对此无能为力，代码会编译，所以生存期注释一定是正确的，对吗？\n不，当前的生存期注释实际上是错误的来源！它特别难被发现，因为错误的生命周期注释被省略了。为了更清楚地了解问题，让我们延长已取消的生命周期：\nstruct ByteIter&lt；&#39；a&&gt;；{剩余部分：&amp；&39；a&&gt;}实施&lt；&#39；a&&gt;；字节项&lt；{FN Next&lt；&#39；b&&gt;(&amp；#39；b mut Self)-&&gt;选项&lt；&amp；b U8&&gt;t；{FN Next&lt；(&amp；#39；b MUT Self)-&&gt;选项&lt；&amp；b U8&&gt;t；{FN Next&lt；(&amp；#39；b MUT Self)-&&gt;选项&lt；&amp；b U8&&gt;。IS_EMPTY(){NONE}ELSE{let byte=&amp；self.reminder[0]；self.reminder=&amp；self.reminder[1..]；ome(Byte)}。\n那一点帮助都没有。我还是很困惑。这里有一个只有铁锈专家才知道的热点提示：给你的终身注释起描述性的名字。让我们重试：\n结构字节项目&#39；剩余部分&&gt;；{剩余部分：&amp；#39；剩余部分[U8]}实施&lt；&#39；剩余部分；字节项&lt；&#39；剩余部分&&gt;{FN NEXT&lt；&#39；MUT_SELF&&gt;(&amp；&39；MUT_Self MUT SELF)-&&gt;选项&lt；&amp；&39；IS_EMPTY(){NONE}ELSE{let byte=&amp；self.reminder[0]；self.reminder=&amp；self.reminder[1..]；ome(Byte)}。\n每个返回的字节都带有&#39；mut_self注释，但是这些字节显然来自&#39；RELENDER！让我们把它修好。\n结构字节项&lt；&#39；剩余&&gt;；{剩余部分：&amp；&#39；剩余部分[U8]}实施&lt；&#39；剩余部分&lt；&#39；剩余部分&&gt;{fn Next(&amp；mut self)-&&gt;选项&lt；&amp；&amp；&#39；剩余部分U8&&gt;{如果自我保留。is_Empty(){None}Else{let byte=&amp；self.reemainth[0]；self.reminder=&amp；self.remindance[1..]；Some(Byte)}fn main(){let mut bytes=ByteIter{RELEMENT：B&#34；1123&#34；}；let byte_1=bytes。Next()；设byte_2=字节。Next()；std：：mem：：drop(Bytes)；//我们现在甚至可以删除迭代器！如果BYTE_1==BYTE_2{//编译//执行某些操作}}。\n现在我们回过头来看我们程序的前一个版本，它显然是错误的，那么为什么Rust要编译它呢？答案很简单：它是内存安全的。\nRust借入检查器只关心程序中的生存期注释，只要它可以使用它们来静态验证程序的内存安全性。即使生命周期注释有语义错误，Rust也会愉快地编译程序，其结果是程序变得不必要的限制。\n这里是一个与前一个示例相反的快速示例：在这个实例中，Ruust的生存期省略规则碰巧在语义上是正确的，但是我们无意中用我们自己不必要的显式生存期注释编写了一个非常有限制性的方法。在这种情况下，Ruust的生存期省略规则在语义上是正确的，但是我们无意中用自己不必要的显式生存期注释编写了一个非常严格的方法。\n#[Derive(Debug)]struct NumRef&lt；&#39；a&gt；(&amp；#39；a I32)；Iml&lt；&#39；a；NumRef&lt；&#39；a&&gt;{//my struct是&#39；a上的泛型结构，这意味着我也需要用&#39；a注释//我的self参数，对吗？(回答：不，不正确)fn ome_method(&amp；&#39；a mut self){}}fn main(){let mut num_ref=NumRef(&amp；5)；num_ref。SomeMethod()；//可变地借用num_ref作为其剩余生命周期的num_ref。Some_Method()；//编译错误println！(&#34；{：？}&#34；，num_ref)；//也编译错误}。\n如果我们在&#39；a上有一些结构泛型，我们几乎永远不会想要编写一个带有mut自身接收器的方法。我们正在向Rust传达的是，此方法将在结构的整个生命周期内可变地借用结构。实际上，这意味着Rust的借入检查器在结构变为永久可变借入从而不可用之前，最多只允许调用一次某些方法。这方面的用例极其罕见，但是上面的代码对于困惑的初学者来说非常容易编写，并且可以编译。修复方法是不添加不必要的显式生存期注释，并让Rust的生存期省略规则处理：\n#[派生(调试)]struct NumRef&lt；&#39；a&gt；(&amp；#39；a I32)；实施&39；a；NumRef&lt；&#39；a&&gt;a on mut self FN SOME_METHOD(&amp；MUT Self){}//以上行对FN SOME_METHOD_Desugared&lt。b mut self){}}fn main(){let mut num_ref=NumRef(&amp；5)；num_ref.。某些方法()；num_ref。Some_Method()；//编译println！(&#34；{：？}&#34；，num_ref)；//编译}。\n前面我们讨论了Rust的函数生命周期省略规则。Ruust还具有特征对象的生存期省略规则，其中包括：\n如果将特征对象用作泛型类型的类型参数，则从包含类型推断其生存期界限。如果从包含类型有多个界限，则必须指定显式界限。\n如果上述条件不适用，则如果特性定义为具有单个生命周期界限，则使用该界限。\n如果特征没有生存期界限，则其生存期在表达式中推断，并且在表达式之外是静态的。\n所有这一切听起来超级复杂，但可以简单地概括为特征对象的生命周期界限是从上下文中推断出来的。在看了几个例子之后，我们会发现生命周期界限的推论非常直观，所以我们不需要记住形式规则：\n使用std：：cell：：ref；特征特征{}//省略类型T1=Box&lt；dyn特征&gt；；//展开，Box&lt；T&gt；对T没有生存期限制，因此推断为&#39；静态类型T2=Box&lt；dyn特征+&#39；静态&gt；；//省略实施动态特征{}//扩展实施动态特征+&#39；静态{}//省略类型T3。动态特征；//扩展的T需要T：&#39；a，因此推断为&#39；a类型T4&gt；=&amp；#39；a(动态特征；a)；//省略类型T5&lt；&39；a&&gt;；=Ref&lt；a，Dyn特征&&gt;；//扩展，参考。需要T：&#39；a，因此推断为&#39；a类型T6&lt；&#39；a&&gt;；=Ref&lt；&#39；a，dyn特征；特性GenericTrait&lt；&#39；a&&gt;；：&#39；a{}//省略类型T7&lt；&#39；a&&gt;；=Box&lt；a&&gt;；=Box&lt；a&gt；=Box&lt；a&&gt;；&#39；a&&gt;=Box&lt；dyn GenericTrait&lt；&#39；a&gt；dyn GenericTrait&lt；&#39；a&gt；\n实现特征的具体类型可以有引用，因此它们也有生存期界限，因此它们对应的特征对象也有生存期界限。此外，您还可以直接为引用实现特征，这显然是有生命周期限制的：\n特征{}struct Struct{}struct Ref&&gt;；(&amp；&39；T&&gt;；(&amp；；a T)；对结构{}实施特征对&amp；Struct{}//对引用类型实施特征直接对引用类型实施特征；对类型实施特征(&amp；A，T&&gt;；{}//对引用类型实施特征)，T&&gt;；(&amp；A，T&&gt;；(&amp；a)；(&amp；a)；直接在引用类型上实施特征(&amp；Struct{})//实施特征(&amp；Struct{}//Iml Struct{}//Iml Characteristic)。\n无论如何，这是值得复习的，因为当初学者将函数从使用特征对象重构到泛型(反之亦然)时，这常常会让他们感到困惑。以此程序为例：\n使用std：：fmt：：display；fn dynamic_thread_print(t：box&lt；dyn display+send&gt；){std：：thread：：spawn(Move||{println！(&#34；{}&#34；，t)；})。Join()；}fn static_thread_print&lt；T：display+send&gt；(t：t){std：：thread：：spawn(Move||{println！(&#34；{}&#34；，t)；})。Join()；}。\n错误[E0310]：参数类型`T`可能存在时间不够长--&gt；src/lib.rs：10：5|9|fn static_thread_print&lt；T：display+send&gt；(t：t){|--help：考虑添加明确的生存期限制.：`t：&#39；static+`10|std：：Thread：：SPAWN(移动||{|^}类型`[Close@src/lib.rs：10：gt；src/lib.rs：10：5|10|std：：Thread：：Spawn(移动||{|^。\n好的，很好，编译器告诉我们如何解决这个问题，所以让我们来解决这个问题。\n使用std：：fmt：：display；fn dynamic_thread_print(t：box&lt；dyn display+send&gt；){std：：thread：：spawn(Move||{println！(&#34；{}&#34；，t)；})。Join()；}fn static_thread_print&lt；T：display+send+&#39；static&gt；(t：t){std：：thread：：spawn(Move||{println！(&#34；{}&#34；，t)；})。Join()；}\n它现在可以编译，但是这两个函数看起来彼此相邻不方便，为什么第二个函数需要一个&#3。\n..", "note_en": "I&#39;ve held all of these misconceptions at some point and I see many beginners struggle with these misconceptions today. Some of my terminology might be non-standard, so here&#39;s a table of shorthand phrases I use and what I intend for them to mean.\n   In a nutshell: A variable&#39;s lifetime is how long the data it points to can be statically verified by the compiler to be valid at its current memory address. I&#39;ll now spend the next ~6000 words going into more detail about where people commonly get confused.\n  This misconception is more about generics than lifetimes but generics and lifetimes are tightly interwined in Rust so it&#39;s not possible to talk about one without also talking about the other. Anyway:\n When I first started learning Rust I understood that  i32,  &amp;i32, and  &amp;mut i32 are different types. I also understood that some generic type variable  T represents a set which contains all possible types. However, despite understanding both of these things separately, I wasn&#39;t able to understand them together. In my newbie Rust mind this is how I thought generics worked:\n  T contains all owned types.  &amp;T contains all immutably borrowed types.  &amp;mut T contains all mutably borrowed types.  T,  &amp;T, and  &amp;mut T are disjoint finite sets. Nice, simple, clean, easy, intuitive, and completely totally wrong. This is how generics actually work in Rust:\n  T,  &amp;T, and  &amp;mut T are all infinite sets, since it&#39;s possible to borrow a type ad-infinitum.  T is a superset of both  &amp;T and  &amp;mut T.  &amp;T and  &amp;mut T are disjoint sets. Here&#39;s a couple examples which validate these concepts:\n trait  Trait {} impl&lt;T&gt;  Trait  for  T {} impl&lt;T&gt;  Trait  for  &amp; T {}  // compile error impl&lt;T&gt;  Trait  for  &amp; mut  T {}  // compile error\n  error[E0119]: conflicting implementations of trait `Trait`  for type ` &amp;_`:  -- &gt; src /lib.rs: 5: 1  | 3  |  impl&lt;T&gt;  Trait  for  T {}  |  ------------------- first implementation here 4  | 5  |  impl&lt;T&gt;  Trait  for  &amp; T {}  |  ^^^^^^^^^^^^^^^^^^^^ conflicting implementation  for ` &amp;_`error[E0119]: conflicting implementations of trait `Trait`  for type ` &amp; mut _`:  -- &gt; src /lib.rs: 7: 1  | 3  |  impl&lt;T&gt;  Trait  for  T {}  |  ------------------- first implementation here... 7  |  impl&lt;T&gt;  Trait  for  &amp; mut  T {}  |  ^^^^^^^^^^^^^^^^^^^^^^^^ conflicting implementation  for ` &amp; mut _`\n The compiler doesn&#39;t allow us to define an implementation of  Trait for  &amp;T and  &amp;mut T since it would conflict with the implementation of  Trait for  T which already includes all of  &amp;T and  &amp;mut T. The program below compiles as expected, since  &amp;T and  &amp;mut T are disjoint:\n trait  Trait {} impl&lt;T&gt;  Trait  for  &amp; T {}  // compiles impl&lt;T&gt;  Trait  for  &amp; mut  T {}  // compiles\n      Most Rust beginners get introduced to the  &#39;static lifetime for the first time in a code example that looks something like this:\n  They get told that  &#34;str literal&#34; is hardcoded into the compiled binary and it&#39;s loaded into read-only memory at run-time so it&#39;s immutable and valid for the entire program and that&#39;s what makes it  &#39;static. These concepts are further reinforced by the rules surrounding defining  static variables using the  static keyword.\n static BYTES: [ u8;  3]  = [ 1,  2,  3]; static  mut MUT_BYTES: [ u8;  3]  = [ 1,  2,  3]; fn  main() { MUT_BYTES[ 0]  =  99;  // compile error, mutating static is unsafe  unsafe { MUT_BYTES[ 0]  =  99;  assert_eq!( 99, MUT_BYTES[ 0]); }}\n   The  &#39;static lifetime was probably named after the default lifetime of  static variables, right? So it makes sense that the  &#39;static lifetime has to follow all the same rules, right?\n Well yes, but a type  with a  &#39;static lifetime is different from a type  bounded by a  &#39;static lifetime. The latter can be dynamically allocated at run-time, can be safely and freely mutated, can be dropped, and can live for arbitrary durations.\n  &amp;&#39;static T is an immutable reference to some  T that can be safely held indefinitely long, including up until the end of the program. This is only possible if  T itself is immutable and does not move  after the reference was created.  T does not need to be created at compile-time. It&#39;s possible to generate random dynamically allocated data at run-time and return  &#39;static references to it at the cost of leaking memory, e.g.\n use rand; // generate random &#39;static str refs at run-time fn  rand_str_generator() -&gt; &amp; &#39; static  str {  let rand_string  = rand :: random ::&lt; u64&gt;(). to_string();  Box :: leak(rand_string. into_boxed_str())}\n T: &#39;static is some  T that can be safely held indefinitely long, including up until the end of the program.  T: &#39;static includes all  &amp;&#39;static T however it also includes all owned types, like  String,  Vec, etc. The owner of some data is guaranted that data will never get invalidated as long as the owner holds onto it, therefore the owner can safely hold onto the data indefinitely long, including up until the end of the program.  T: &#39;static should be read as  &#34; T is bounded by a  &#39;static lifetime&#34; not  &#34; T has a  &#39;static lifetime&#34;. A program to help illustrate these concepts:\n use rand; fn  drop_static&lt;T:  &#39; static&gt;(t: T) { std ::mem :: drop(t);} fn  main() {  let  mut strings:  Vec &lt; String &gt;  =  Vec :: new();  for _  in  0.. 10 {  if rand :: random() {  // all the strings are randomly generated  // and dynamically allocated at run-time  let string  = rand :: random ::&lt; u64&gt;(). to_string(); strings. push(string); } }  // strings are owned types so they&#39;re bounded by &#39;static  for  mut string  in strings {  // all the strings are mutable string. push_str( &#34;a mutation&#34;);  // all the strings are droppable  drop_static(string);  // compiles }  // all the strings have been invalidated before the end of the program  println!( &#34;i am the end of the program&#34;);}\n  if  T: &#39;static then  T can be a borrowed type with a  &#39;static lifetime  or an owned type\n   &amp;&#39;a T requires and implies  T: &#39;a since a reference to  T of lifetime  &#39;a cannot be valid for  &#39;a if  T itself is not valid for  &#39;a. For example, the Rust compiler will never allow the construction of the type  &amp;&#39;static Ref&lt;&#39;a, T&gt; because if  Ref is only valid for  &#39;a we can&#39;t make a  &#39;static reference to it.\n  // only takes ref types bounded by &#39;a fn  t_ref&lt; &#39; a, T:  &#39; a&gt;(t: &amp; &#39; a T) {} // takes any types bounded by &#39;a fn  t_bound&lt; &#39; a, T:  &#39; a&gt;(t: T) {} // owned type which contains a reference struct  Ref&lt; &#39; a, T:  &#39; a&gt;(&amp; &#39; a T); fn  main() {  let string  =  String :: from( &#34;string&#34;);  t_bound( &amp;string);  // compiles  t_bound( Ref( &amp;string));  // compiles  t_bound( &amp; Ref( &amp;string));  // compiles  t_ref( &amp;string);  // compiles  t_ref( Ref( &amp;string));  // compile error, expected ref, found struct  t_ref( &amp; Ref( &amp;string));  // compiles  // string var is bounded by &#39;static which is bounded by &#39;a  t_bound(string);  // compiles}\n      This comforting misconception is kept alive thanks to Rust&#39;s lifetime elision rules, which allow you to omit lifetime annotations in functions because the Rust borrow checker will infer them following these rules:\n if there&#39;s multiple input lifetimes but one of them is  &amp;self or  &amp;mut self then the lifetime of  self is applied to all output refs\n  // elided fn  print(s:  &amp; str); // expanded fn  print&lt; &#39; a&gt;(s: &amp; &#39; a  str); // elided fn  trim(s:  &amp; str) -&gt;  &amp; str; // expanded fn  trim&lt; &#39; a&gt;(s: &amp; &#39; a  str) -&gt; &amp; &#39; a  str; // illegal, can&#39;t determine output lifetime, no inputs fn  get_str() -&gt;  &amp; str; // explicit options include fn  get_str&lt; &#39; a&gt;() -&gt; &amp; &#39; a  str;  // pointlessly generic, since &#39;a must equal &#39;static fn  get_str() -&gt; &amp; &#39; static  str;  // better, more explicit // illegal, can&#39;t determine output lifetime, multiple inputs fn  overlap(s:  &amp; str, t:  &amp; str) -&gt;  &amp; str; // explicit (but still partially elided) options include fn  overlap&lt; &#39; a&gt;(s: &amp; &#39; a  str, t:  &amp; str) -&gt; &amp; &#39; a  str;  // output can&#39;t outlive s fn  overlap&lt; &#39; a&gt;(s:  &amp; str, t: &amp; &#39; a  str) -&gt; &amp; &#39; a  str;  // output can&#39;t outlive t fn  overlap&lt; &#39; a&gt;(s: &amp; &#39; a  str, t: &amp; &#39; a  str) -&gt; &amp; &#39; a  str;  // output can&#39;t outlive s &amp; t fn  overlap(s:  &amp; str, t:  &amp; str) -&gt; &amp; &#39; static  str;  // output can outlive s &amp; t fn  overlap&lt; &#39; a&gt;(s:  &amp; str, t:  &amp; str) -&gt; &amp; &#39; a  str;  // no relationship between input &amp; output lifetimes // expanded fn  overlap&lt; &#39; a,  &#39; b&gt;(s: &amp; &#39; a  str, t: &amp; &#39; b  str) -&gt; &amp; &#39; a  str; fn  overlap&lt; &#39; a,  &#39; b&gt;(s: &amp; &#39; a  str, t: &amp; &#39; b  str) -&gt; &amp; &#39; b  str; fn  overlap&lt; &#39; a&gt;(s: &amp; &#39; a  str, t: &amp; &#39; a  str) -&gt; &amp; &#39; a  str; fn  overlap&lt; &#39; a,  &#39; b&gt;(s: &amp; &#39; a  str, t: &amp; &#39; b  str) -&gt; &amp; &#39; static  str; fn  overlap&lt; &#39; a,  &#39; b,  &#39; c&gt;(s: &amp; &#39; a  str, t: &amp; &#39; b  str) -&gt; &amp; &#39; c  str; // elided fn  compare( &amp; self, s:  &amp; str) -&gt;  &amp; str; // expanded fn  compare&lt; &#39; a,  &#39; b&gt;(&amp; &#39; a  self, &amp; &#39; b  str) -&gt; &amp; &#39; a  str;\n         It&#39;s possible for a Rust program to be technically compilable but still semantically wrong. Take this for example:\n struct  ByteIter&lt; &#39; a&gt; { remainder: &amp; &#39; a [ u8]} impl&lt; &#39; a&gt;  ByteIter&lt; &#39; a&gt; {  fn  next( &amp; mut  self) -&gt;  Option&lt; &amp; u8&gt; {  if  self.remainder. is_empty() {  None }  else {  let byte  =  &amp; self.remainder[ 0];  self.remainder  =  &amp; self.remainder[ 1..];  Some(byte) } }} fn  main() {  let  mut bytes  = ByteIter { remainder:  b&#34;1&#34; };  assert_eq!( Some( &amp; b&#39;1&#39;), bytes. next());  assert_eq!( None, bytes. next());}\n ByteIter is an iterator that iterates over a slice of bytes. We&#39;re skipping the  Iterator trait implementation for conciseness. It seems to work fine, but what if we want to check a couple bytes at a time?\n fn  main() {  let  mut bytes  = ByteIter { remainder:  b&#34;1123&#34; };  let byte_1  = bytes. next();  let byte_2  = bytes. next();  if byte_1  == byte_2 {  // do something }}\n  error[E0499]: cannot borrow `bytes`  as mutable more than once at a time  -- &gt; src /main.rs: 20: 18  | 19  |  let byte_1  = bytes. next();  |  ----- first mutable borrow occurs here 20  |  let byte_2  = bytes. next();  |  ^^^^^ second mutable borrow occurs here 21  |  if byte_1  == byte_2 {  |  ------ first borrow later used here\n I guess we can copy each byte. Copying is okay when we&#39;re working with bytes but if we turned  ByteIter into a generic slice iterator that can iterate over any  &amp;&#39;a [T] then we might want to use it in the future with types that may be very expensive or impossible copy / clone. Oh well, I guess there&#39;s nothing we can do about that, the code compiles so the lifetime annotations must be right, right?\n Nope, the current lifetime annotations are actually the source of the bug! It&#39;s particularly hard to spot because the buggy lifetime annotations are elided. Lets expand the elided lifetimes to get a clearer look at the problem:\n struct  ByteIter&lt; &#39; a&gt; { remainder: &amp; &#39; a [ u8]} impl&lt; &#39; a&gt;  ByteIter&lt; &#39; a&gt; {  fn  next&lt; &#39; b&gt;(&amp; &#39; b  mut  self) -&gt;  Option&lt;&amp; &#39; b  u8&gt; {  if  self.remainder. is_empty() {  None }  else {  let byte  =  &amp; self.remainder[ 0];  self.remainder  =  &amp; self.remainder[ 1..];  Some(byte) } }}\n That didn&#39;t help at all. I&#39;m still confused. Here&#39;s a hot tip that only Rust pros know: give your lifetime annotations descriptive names. Lets try again:\n struct  ByteIter&lt; &#39; remainder&gt; { remainder: &amp; &#39; remainder [ u8]} impl&lt; &#39; remainder&gt;  ByteIter&lt; &#39; remainder&gt; {  fn  next&lt; &#39; mut_self&gt;(&amp; &#39; mut_self  mut  self) -&gt;  Option&lt;&amp; &#39; mut_self  u8&gt; {  if  self.remainder. is_empty() {  None }  else {  let byte  =  &amp; self.remainder[ 0];  self.remainder  =  &amp; self.remainder[ 1..];  Some(byte) } }}\n Each returned byte is annotated with  &#39;mut_self but the bytes are clearly coming from  &#39;remainder! Lets fix it.\n struct  ByteIter&lt; &#39; remainder&gt; { remainder: &amp; &#39; remainder [ u8]} impl&lt; &#39; remainder&gt;  ByteIter&lt; &#39; remainder&gt; {  fn  next( &amp; mut  self) -&gt;  Option&lt;&amp; &#39; remainder  u8&gt; {  if  self.remainder. is_empty() {  None }  else {  let byte  =  &amp; self.remainder[ 0];  self.remainder  =  &amp; self.remainder[ 1..];  Some(byte) } }} fn  main() {  let  mut bytes  = ByteIter { remainder:  b&#34;1123&#34; };  let byte_1  = bytes. next();  let byte_2  = bytes. next(); std ::mem :: drop(bytes);  // we can even drop the iterator now!  if byte_1  == byte_2 {  // compiles  // do something }}\n Now that we look back on the previous version of our program it was obviously wrong, so why did Rust compile it? The answer is simple: it was memory safe.\n The Rust borrow checker only cares about the lifetime annotations in a program to the extent it can use them to statically verify the memory safety of the program. Rust will happily compile programs even if the lifetime annotations have semantic errors, and the consequence of this is that the program becomes unnecessarily restrictive.\n Here&#39;s a quick example that&#39;s the opposite of the previous example: Rust&#39;s lifetime elision rules happen to be semantically correct in this instance but we unintentionally write a very restrictive method with our own unnecessary explicit lifetime annotations.\n #[derive(Debug)] struct  NumRef&lt; &#39; a&gt;(&amp; &#39; a  i32); impl&lt; &#39; a&gt;  NumRef&lt; &#39; a&gt; {  // my struct is generic over &#39;a so that means I need to annotate  // my self parameters with &#39;a too, right? (answer: no, not right)  fn  some_method(&amp; &#39; a  mut  self) {}} fn  main() {  let  mut num_ref  =  NumRef( &amp; 5); num_ref. some_method();  // mutably borrows num_ref for the rest of its lifetime num_ref. some_method();  // compile error  println!( &#34;{:?}&#34;, num_ref);  // also compile error}\n If we have some struct generic over  &#39;a we almost never want to write a method with a  &amp;&#39;a mut self receiver. What we&#39;re communicating to Rust is &#34;this method will mutably borrow the struct for the entirety of the struct&#39;s lifetime&#34;. In practice this means Rust&#39;s borrow checker will only allow at most one call to  some_method before the struct becomes permanently mutably borrowed and thus unusable. The use-cases for this are extremely rare but the code above is very easy for confused beginners to write and it compiles. The fix is to not add unnecessary explicit lifetime annotations and let Rust&#39;s lifetime elision rules handle it:\n #[derive(Debug)] struct  NumRef&lt; &#39; a&gt;(&amp; &#39; a  i32); impl&lt; &#39; a&gt;  NumRef&lt; &#39; a&gt; {  // no more &#39;a on mut self  fn  some_method( &amp; mut  self) {}  // above line desugars to  fn  some_method_desugared&lt; &#39; b&gt;(&amp; &#39; b  mut  self){}} fn  main() {  let  mut num_ref  =  NumRef( &amp; 5); num_ref. some_method(); num_ref. some_method();  // compiles  println!( &#34;{:?}&#34;, num_ref);  // compiles}\n    Earlier we discussed Rust&#39;s lifetime elision rules  for functions. Rust also has lifetime elision rules for trait objects, which are:\n if a trait object is used as a type argument to a generic type then its life bound is inferred from the containing type if there&#39;s more than one bound from the containing type then an explicit bound must be specified\n if the above doesn&#39;t apply then if the trait is defined with a single lifetime bound then that bound is used\n  if the trait has no lifetime bounds then its lifetime is inferred in expressions and is  &#39;static outside of expressions\n All of that sounds super complicated but can be simply summarized as  &#34;a trait object&#39;s lifetime bound is inferred from context.&#34; After looking at a handful of examples we&#39;ll see the lifetime bound inferences are pretty intuitive so we don&#39;t have to memorize the formal rules:\n use std ::cell ::Ref; trait  Trait {} // elided type  T1 =  Box&lt; dyn Trait&gt;; // expanded, Box&lt;T&gt; has no lifetime bound on T, so inferred as &#39;static type  T2 =  Box&lt; dyn Trait +  &#39; static&gt;; // elided impl  dyn  Trait {} // expanded impl  dyn  Trait + &#39; static {} // elided type  T3&lt; &#39; a&gt; = &amp; &#39; a  dyn Trait; // expanded, &amp;&#39;a T requires T: &#39;a, so inferred as &#39;a type  T4&lt; &#39; a&gt; = &amp; &#39; a ( dyn Trait +  &#39; a); // elided type  T5&lt; &#39; a&gt; = Ref&lt; &#39; a,  dyn Trait&gt;; // expanded, Ref&lt;&#39;a, T&gt; requires T: &#39;a, so inferred as &#39;a type  T6&lt; &#39; a&gt; = Ref&lt; &#39; a,  dyn Trait +  &#39; a&gt;; trait  GenericTrait&lt; &#39; a&gt;: &#39;a {} // elided type  T7&lt; &#39; a&gt; =  Box&lt; dyn GenericTrait&lt; &#39; a&gt;&gt;; // expanded type  T8&lt; &#39; a&gt; =  Box&lt; dyn GenericTrait&lt; &#39; a&gt; +  &#39; a&gt;; // elided impl&lt; &#39; a&gt;  dyn  GenericTrait&lt; &#39; a&gt; {} // expanded impl&lt; &#39; a&gt;  dyn  GenericTrait&lt; &#39; a&gt; + &#39; a {}\n Concrete types which implement traits can have references and thus they also have lifetime bounds, and so their corresponding trait objects have lifetime bounds. Also you can implement traits directly for references which obviously have lifetime bounds:\n trait  Trait {} struct  Struct {} struct  Ref&lt; &#39; a, T&gt;(&amp; &#39; a T); impl  Trait  for  Struct {} impl  Trait  for  &amp; Struct {}  // impl Trait directly on a ref type impl&lt; &#39; a, T&gt;  Trait  for  Ref&lt; &#39; a, T&gt; {}  // impl Trait on a type containing refs\n Anyway, this is worth going over because it often confuses beginners when they refactor a function from using trait objects to generics or vice versa. Take this program for example:\n use std ::fmt ::Display; fn  dynamic_thread_print(t:  Box&lt; dyn Display +  Send&gt;) { std ::thread :: spawn( move  || {  println!( &#34;{}&#34;, t); }). join();} fn  static_thread_print&lt;T: Display +  Send&gt;(t: T) { std ::thread :: spawn( move  || {  println!( &#34;{}&#34;, t); }). join();}\n  error[E0310]: the parameter type `T` may not live long enough  -- &gt; src /lib.rs: 10: 5  | 9  |  fn  static_thread_print&lt;T: Display +  Send&gt;(t: T) {  |  -- help: consider adding an explicit lifetime bound...: `T:  &#39; static  +` 10  | std ::thread :: spawn( move  || {  |  ^^^^^^^^^^^^^^^^^^  |note: ...so that the type `[closure@src /lib.rs: 10: 24:  12: 6 t:T]` will meet its required lifetime bounds  -- &gt; src /lib.rs: 10: 5  | 10  | std ::thread :: spawn( move  || {  |  ^^^^^^^^^^^^^^^^^^\n Okay great, the compiler tells us how to fix the issue so lets fix the issue.\n use std ::fmt ::Display; fn  dynamic_thread_print(t:  Box&lt; dyn Display +  Send&gt;) { std ::thread :: spawn( move  || {  println!( &#34;{}&#34;, t); }). join();} fn  static_thread_print&lt;T: Display +  Send +  &#39; static&gt;(t: T) { std ::thread :: spawn( move  || {  println!( &#34;{}&#34;, t); }). join();}\n It compiles now but these two functions look awkward next to each other, why does the second function require a  &#3\n......", "posttime": "2020-05-23 15:14:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,寿命,类型", "title": "常见的锈蚀寿命误区", "title_en": "Common Rust Lifetime Misconceptions", "transed": 1, "url": "https://github.com/pretzelhammer/rust-blog/blob/master/posts/common-rust-lifetime-misconceptions.md", "via": "", "real_tags": ["rust", "寿命", "类型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003376, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一本散文集，解释了为什么在线社区会以这样的方式结束，它们是如何成功和失败的，以及如何创建和管理一个在线社区。我认为他们都很有趣，虽然我不同意他们说的每一件事。\n卢卡斯电影公司“栖息地”的教训。奇普·晨星，F·兰德尔·法默。1990年。另见：道格拉斯·克罗克福德的电子社区页面上收集的栖息地链接。", "note_en": "This is a collection of essays that explain why online communities end up the way they do, how they succeed and fail, and how to create and manage one. I think they are all interesting, though I don&#39;t agree with everything they say.\n The Lessons of Lucasfilm&#39;s Habitat. Chip Morningstar, F. Randall Farmer. 1990. See also: the Habitat links collected on Douglas Crockford&#39;s  Electric Communities page.", "posttime": "2020-05-23 14:46:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,结束,essays,栖息地", "title": "这是一本关于在线社区为什么会以这样的方式结束的论文集", "title_en": "A collection of essays about why online communities end up the way they do", "transed": 1, "url": "https://dbohdan.com/wiki?name=How+Internet+communities+function", "via": "", "real_tags": ["论文", "结束", "essays", "栖息地"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003375, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在即将到来的Linux 5.8内核周期之前，Amazon AWS工程师率先在每个上下文交换机上有选择地刷新L1数据缓存的Linux内核补丁现在已经在x86/mm分支中排队。上下文交换机上的这种L1d高速缓存刷新是根据最近曝光的各种CPU安全问题进行的，并承认可能存在其他尚未发现的漏洞。在上下文交换机上刷新L1d缓存有助于防止数据通过旁路被窥探或泄漏。此刷新确实针对CVE-2020-0550进行窥探辅助的L1数据采样，但主要重点似乎是尚未发现的漏洞。&#34；但是如此频繁地刷新L1数据缓存会对性能造成很大影响，因此文档继续将此功能称为Paranoid&34；用户。这种选择加入机制需要从用户空间应用程序通过prctl()启用，并且将使用任何CPU硬件机制进行L1d刷新，否则将是软件后备。通过前一篇文章，详细介绍了每个上下文切换的可选L1d刷新。补丁排在x86/mm(内存管理)分支中，预计将在6月初开启Linux5.8内核周期，然后可能在8月发布稳定的补丁。除了这个可选的安全特性之外，Linux 5.8还将提供更多的安全特性。", "note_en": "The Linux kernel patches that have been spearheaded by Amazon AWS engineers to optionally flush the L1 data cache on each context switch have now been queued in the x86/mm branch ahead of the upcoming Linux 5.8 kernel cycle.\r   This  L1d cache flushing on context switches is being done in light of the various CPU security issues that have come to light in recent times and acknowledging there are likely other yet to be discovered vulnerabilities. Flushing the L1d cache on context switches helps fend off data from being snooped or leaked via side channels.\r   This flushing does address CVE-2020-0550 for snoop-assisted L1 data sampling but the main emphasis seems to be on the &#34;yet to be discovered vulnerabilities.&#34; But in flushing the L1 data cache so frequently, there are big performance implications and as such the documentation continues to refer to this capability as something for &#34;paranoid&#34; users.\r    This opt-in mechanism needs to be enabled from user-space applications via prctl() and will use any CPU hardware mechanism for L1d flushing otherwise a software fallback. More details on this optional L1d flushing per context switch via  this earlier article.\r   The patches are  queued in the x86/mm (memory management) branch ahead of the Linux 5.8 kernel cycle expected to open in early June and then release as stable likely in August. Besides this optional security feature, there is  a lot more coming for Linux 5.8.", "posttime": "2020-05-23 14:42:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缓存,linux,上下文,flush,刷新", "title": "Linux 5.8可选择在上下文切换时刷新L1d缓存以提高安全性", "title_en": "Linux 5.8 Optionally Flush the L1d Cache on Context Switch to Increase Security", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=L1d-Cache-Flushing-Queued", "via": "", "real_tags": ["缓存", "linux", "上下文", "flush", "刷新"]}]