[{"category": "", "categoryclass": "", "imagename": "71a5f25733e70fb56e9fd1a81654be03.jpg", "infoid": 1070437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家电子商务巨头在其常见问题页面中列出了将受到切换影响的特定设备。它指出，第一代和第二代 Kindle 以及 Kindle DX 将根本无法连接到互联网，因为它们没有可依赖的 WiFi 连接。列表中的其他设备是 Kindle 键盘（第 3 代）、Kindle Touch（第 4 代）、Kindle Paperwhite（第 5、6 和第 7 代）、Kindle Voyage（第 7 代）和 Kindle Oasis（第 8 代），所有这些有WiFi连接。不过，您仍然可以在较旧的设备上访问您的图书，并且可以根据需要进行有线传输。如果您有更新的 4G 或仅支持 WiFi 的 Kindle，则完全不会受到影响。亚马逊在其电子邮件中包含了一个代码，客户可以使用该代码从新的 Kindle Paperwhite 或 Oasis 中获得 50 美元的折扣，以及 15 美元的电子书积分。如果您一直在寻求升级，您可能需要检查您的收件箱，看看您是否收到了公司的通知。", "note_en": "The e-commerce giant listed the particular devices that will be affected by the switch in  its FAQ page. It noted that the first- and second-generation Kindles, as well as the Kindle DX, won’t be able to connect to the internet at all since they don’t have WiFi connectivity to fall back on. The other devices in the list are the Kindle Keyboard (3rd Generation), Kindle Touch (4th Generation), Kindle Paperwhite (5th, 6th and 7th Generation), Kindle Voyage (7th Generation) and  Kindle Oasis (8th Generation), all of which have WiFi connection.\n You’ll still be able to access your books on an older device and can do wired transfers if you want, though. And if you have a newer 4G or WiFi-only Kindle, you won’t be affected at all. In its email, Amazon included a code customers can use to get $50 off a new Kindle Paperwhite or Oasis, along with $15 in eBook credits. You may want to check your inbox to see if you got the company’s notice in case you’ve been looking to upgrade anyway.", "posttime": "2021-07-30 00:53:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,kindle", "title": "旧的亚马逊 Kindle 设备将很快失去 3G 访问权限", "title_en": "\n\t\t\t\tOld Amazon Kindle devices will soon lose 3G access\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/29/old-amazon-kindle-devices-will-soon-lose-3g-access/", "via": "", "real_tags": ["amazon", "亚马逊", "kindle"]}, {"category": "", "categoryclass": "", "imagename": "880b165da90e6f2ed89a7005f28d155a.jpg", "infoid": 1070436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“DevSecOps”一词在过去几年变得流行，其目的是将安全性和合规性无缝集成到 DevOps 框架中。然而，现实远非理想：安全工具与新的自动化层一起被固定到现有的 DevOps 流程中，每个人都称之为“DevSecOps”。这是一种被误导的方法，没有遵循协作和敏捷的原则。将安全性集成到 DevOps 以提供 DevSecOps 需要改变思维方式、流程和技术。安全和风险管理领导者必须坚持 DevOps 的协作、敏捷性质，以便安全测试在开发过程中实现无缝，从而使 DevSecOps 中的“安全”变得透明。 — Neil MacDonald，Gartner 在理想的世界中，所有开发人员都应接受过从前端到后端的安全编码实践的培训和经验，并且能够熟练地防止从 SQL 注入到授权框架漏洞的一切。开发人员还将拥有在设计阶段早期做出与安全相关的决策所需的所有信息。再一次，现实与理想不符。虽然 CI/CD 自动化赋予了开发人员对其代码部署的所有权，但这些开发人员仍然因缺乏对相关信息的可见性而受到阻碍，这些信息可以帮助他们在坐下来编写代码之前做出更好的决策。在开发过程中早期发现和修复漏洞的整个概念在某些方面已经过时了。更好的方法是为开发人员提供他们所需的信息和培训，以防止潜在风险成为漏洞。考虑分配给面向 Internet 的 API 添加 PII 字段的开发人员。云 API 网关中的授权控制对于新功能的安全性至关重要。 “向左移动和向右延伸”并不意味着扫描工具或安全架构师应该在流程的早期检测到安全风险——这意味着开发人员应该在漏洞发生之前拥有所有上下文来防止漏洞发生。持续反馈是将开发人员的安全知识提升几个数量级的关键。", "note_en": "The term “DevSecOps” has come into fashion the past few years with the intention of seamlessly integrating security and compliance into the DevOps framework. However, the reality is far from the ideal: Security tools have been bolted onto the existing DevOps process along with new layers of automation, and everyone’s calling it “DevSecOps.” This is a misguided approach that fails to embrace the principles of collaboration and agility.\n Integrating security into DevOps to deliver DevSecOps demands changed mindsets, processes and technologies. Security and risk management leaders must adhere to the collaborative, agile nature of DevOps for security testing to be seamless in development, making the “Sec” in DevSecOps transparent. —  Neil MacDonald, Gartner\n In an ideal world, all developers would be trained and experienced in secure coding practices from front end to back end and be skilled in preventing everything from SQL injection to authorization framework exploits. Developers would also have all the information they need to make security-related decisions early in the design phase.\n  Once again, the reality falls short of the ideal. While CI/CD automation has given developers ownership over the deployment of their code, those developers are still hampered by a lack of visibility into relevant information that would help them make better decisions before even sitting down to write code.\n The entire concept of discovering and remediating vulnerabilities earlier in the development process is already, in some ways, out of date. A better approach is to provide developers with the information and training they need to prevent potential risks from becoming vulnerabilities in the first place.\n Consider a developer that is assigned to add PII fields to an internet-facing API. The authorization controls in the cloud API gateway are critical to the security of the new feature. “Shifting left and extending right” doesn’t mean that a scanning tool or security architect should detect a security risk earlier in the process — it means that a developer should have all the context to prevent the vulnerability before it even happens. Continuous feedback is key to up-leveling the security knowledge of developers by orders of magnitude.", "posttime": "2021-07-30 00:52:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,右移,shift,安全", "title": "真正的“左移右移”安全需要有能力的开发人员", "title_en": "\n\t\t\t\tTrue ‘shift left and extend right’ security requires empowered developers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/29/true-shift-left-and-extend-right-security-requires-empowered-developers/", "via": "", "real_tags": ["开发", "右移", "shift", "安全"]}, {"category": "", "categoryclass": "", "imagename": "9c37b4e179039e2d9856f5a614ff7ecc.png", "infoid": 1070435, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安全研究人员发现了一种新颖的 Android 恶意软件，它使用 VNC 技术记录和广播受害者的智能手机活动，允许威胁行为者收集键盘按下和应用程序密码。荷兰安全公司 ThreatFabric 于 2021 年 3 月首次发现这种名为 Vultur 的新恶意软件，它与其他 Android 恶意软件不同，后者通常依赖漂浮在合法应用程序顶部的虚假登录屏幕来收集受害者的凭据。相反，Vultur 在受感染的手机上打开一个 VNC 服务器，并将屏幕截图广播到攻击者的命令和控制服务器，Vultur 操作员在那里提取所需应用程序的密码。以下是本周与 The Record 分享的 ThreatFabric 报告中详细介绍的 Vultur 功能摘要： 尽管 Vultur 被宣传为银行木马，但 Vultur 是最近趋势的一部分，其中 Android 银行木马还具有远程访问木马的典型功能（ RATs)，允许攻击者完全控制设备。 Vultur 目前安装在先前感染了 Brunhilda 恶意软件 [PDF] 的设备上，众所周知，该恶意软件有时会进入 Google Play 商店并充当其他恶意软件菌株的“投放器”。只有当 Vultur 设法欺骗用户授予对辅助功能的访问权限时，它才能成功地完全控制设备。\n每当用户导航到要卸载其父应用程序的屏幕时，Vultur 都会自动按下“返回”按钮。用户可以发现 Vultur 正在运行，因为每次它广播受害者的屏幕时，Android 通知面板中的“保护卫士”指示灯都会亮起。除了通过 VNC 收集按键，Vultur 还可以向恶意软件操作员发送已安装应用程序的列表，以确定受害者是否是有价值的资产。根据恶意软件的配置，它目前针对意大利、澳大利亚、西班牙、荷兰和英国的银行的移动银行应用程序。它还可以锁定和窃取加密货币移动钱包和社交媒体应用程序的凭据。 ThreatFabric 表示，一项代码级调查发现了与 Brunhilda 开发人员的相似之处和可能的联系。", "note_en": "Security researchers have discovered a novel piece of Android malware that uses the  VNC technology to record and broadcast a victim’s smartphone activity, allowing threat actors to collect keyboard presses and app passwords.\n First spotted in March 2021 by Dutch security firm ThreatFabric, this new piece of malware, named  Vultur, is a departure from other Android malware strains that usually rely on fake login screens floating on top of legitimate apps to collect a victim’s credentials.\n Instead, Vultur opens a VNC server on the infected phone, and broadcasts screen captures to an attacker command and control server, where the Vultur operator extracts passwords for desired apps.\n Below is a summary of Vultur features as detailed in a  ThreatFabric report shared with The Record this week:\n Although it is advertised as a banking trojan, Vultur is part of a recent trend where Android banking trojans also come with features typical to remote access trojans (RATs), allowing attackers full control over a device.\n Vultur is currently installed on devices that have been previously infected with the  Brunhilda malware [PDF], known to sometimes reached the Google Play Store and serve as a “dropper” for other malware strains.\n Vultur is successful in taking full control over a device only if it manages to trick users into granting access to the Accessibility permission.\n Vultur automatically presses the “Back” button whenever users navigate to the screen where they would uninstall its parent app.\n Users can spot Vultur in operation because every time it broadcasts the victim’s screen, the “ Protection Guard” indicator lights up in the Android notification panel.\n  Besides collecting key presses via VNC, Vultur can also send a list of installed apps to the malware operator in order to decide if the victim is a valuable asset.\n  Per the malware’s configuration, it currently targets mobile banking apps for banks in Italy, Australia, Spain, the Netherlands, and the UK.\n It can also target and steal credentials for cryptocurrency mobile wallets and social media apps.\n ThreatFabric said that a code-level investigation unearthed similarities and possible connections to the Brunhilda developers.", "posttime": "2021-07-30 00:44:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,软件,android,手机,恶意软件", "title": "新的 Android 恶意软件通过 VNC 记录智能手机以窃取密码", "title_en": "New Android Malware Records Smartphones via VNC To Steal Passwords", "transed": 1, "url": "https://therecord.media/new-android-malware-records-smartphones-via-vnc-to-steal-passwords/", "via": "", "real_tags": ["密码", "软件", "android", "手机", "恶意软件"]}, {"category": "", "categoryclass": "", "imagename": "cb3538650195c95aecd778036201963f.jpg", "infoid": 1070434, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司周四证实，联邦大陪审团以三项欺诈罪名起诉了尼古拉创始人兼前执行主席特雷弗·米尔顿 (Trevor Milton)。大陪审团指控米尔顿犯有两项证券欺诈罪和一项电汇欺诈罪，罪名是涉嫌在“业务的几乎所有方面”撒谎。 CNBC在起诉书揭开后于周四首次报道了这一消息。 “今天的政府行动是针对米尔顿先生个人的，而不是针对公司的，”尼古拉发言人在一份声明中说。 “Nikola 在整个调查过程中一直与政府合作。我们仍然致力于我们之前宣布的里程碑和时间表，并专注于今年晚些时候从公司的制造工厂交付 Nikola Tre 电池电动卡车。”曼哈顿的美国检察官办公室没有立即回复路演的置评请求，但 CNBC 报道称，米尔顿已向当局自首，并将于今天晚些时候出庭。在 Hindenburg Research 发布深入的财务调查报告后，Milton 于 9 月辞去了 Nikola 的执行主席一职。兴登堡证实，在披露对该公司的多项指控时，它对该公司的股票持有空头头寸，其中包括米尔顿提出的一些谎言。米尔顿承诺将把氢燃料电池驱动的半卡车推向市场的技术，并透露了一种名为獾的氢电动皮卡车的计划，等等。根据该报告，米尔顿在其价值最高时持有价值 85 亿美元的公司股票。大陪审团表示，这位前高管必须归还任何“可追溯至上述罪行的实施”，其中可能包括通过尼古拉股票赚取的超过 10 亿美元。坐在驾驶座上获取最新的汽车新闻和评论，每周两次发送到您的收件箱。", "note_en": "A federal grand jury has indicted Nikola founder and former executive chairman   Trevor Milton on three counts of fraud, the company confirmed Thursday. The grand jury charged Milton with two counts of securities fraud and one count of wire fraud for allegedly lying about &#34;nearly all aspects of the business.&#34;  CNBC first reported the news on Thursday after the indictment was unsealed.\n &#34;Today&#39;s government actions are against Mr. Milton individually, and not against the company,&#34; a Nikola spokesperson said in a statement. &#34;Nikola has cooperated with the government throughout the course of its inquiry. We remain committed to our previously announced milestones and timelines and are focused on delivering   Nikola Tre battery-electric trucks later this year from the company&#39;s manufacturing facilities.&#34;\n The US Attorney&#39;s Office in Manhattan did not immediately return Roadshow&#39;s request for comment, but CNBC reports that Milton surrendered to authorities and will appear in court later today.\n Milton resigned as executive chairman of Nikola in September following an   in-depth financial investigation report from Hindenburg Research. Hindenberg confirmed it took a short position on the company&#39;s stock when revealing numerous allegations against the company, including a number of falsehoods Milton presented. Milton promised technologies that would bring   hydrogen-fuel-cell-powered semi trucks to market and revealed plans for a hydrogen-electric pickup truck called the   Badger, among other things.\n According to the report, Milton held $8.5 billion worth of company stock at the height of its value. The grand jury said the former executive must return anything &#34;traceable to the commission of said offenses,&#34; which likely includes over $1 billion earned through Nikola stock.\n                                             Climb in the driver&#39;s seat for the latest car news and reviews, delivered to your inbox twice weekly.", "posttime": "2021-07-30 00:44:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "milton,founder", "title": "Nikola 创始人特雷弗·米尔顿 (Trevor Milton) 被控三项欺诈罪", "title_en": "Nikola Founder Trevor Milton Indicted on Three Counts of Fraud", "transed": 1, "url": "https://www.cnet.com/roadshow/news/nikola-founder-trevor-milton-indicted-on-three-counts-of-fraud/", "via": "", "real_tags": ["milton", "founder"]}, {"category": "", "categoryclass": "", "imagename": "25e09760e1c759e422bcc32fd8474ea1.jpg", "infoid": 1070432, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在早期采用者中，去年这个时候最令人垂涎​​的项目不是洗手液或高乐氏湿巾，而是 Clubhouse 上的用户名，这是一个纯音频社交媒体平台，在春季推出时在硅谷引起了轰动。访问需要来自已经在应用程序上的人的邀请，而这些在隔离的孤独月份变得如此受欢迎，以至于有些人在 eBay 上以数百美元的价格出售。会所被众多媒体（包括这家）誉为社交媒体的未来，因为其等候名单已增至 1000 万。今天，这些邀请一文不值：Clubhouse 在周三发布了期待已久的全面发布，这意味着现在任何人都可以通过下载该应用程序来设置一个帐户。然而，大众似乎并没有涌入。根据分析组织 SensorTower 的数据，该应用在 7 月 21 日至 25 日期间在全球有 484,000 次新安装。这比之前的五天时间增加了 17%，主要来自美国以外的地区。在苹果的 App Store 上，Clubhouse 在向公众开放的第一天就在免费社交网络类别的应用程序中排名第 10 位——甚至 Google Duo 的下载量也更高。在 Android 上，Clubhouse 较新，它勉强进入前 20 名。对于最近才在全球应用商店中击败 Instagram、TikTok 和 WhatsApp 的应用，这是一个中等的首次亮相。过去，Clubhouse 曾表示，其邀请系统是“以一种有节制的方式”增长、分批加入新用户并根据需要构建 DM 等功能的关键。但是，如果没有排他性，Clubhouse 似乎也失去了一些炒作。 “卖掉我的会所邀请函，”科技博主 Jane Manchun Wong 周三开玩笑说，当时该应用程序宣布可提供一般下载。 “你可能需要付钱让人们从你那里拿走它们，”Morning Brew 的执行主席亚历克斯利伯曼回答说，这是一种深受千禧一代商业人士青睐的电子邮件通讯。 Morning Brew 最近宣布 Clubhouse 已经“结束”，并指出该应用程序感觉不像“Soho House——排他性的，因此神秘地很酷”，而更像是“一个开放的房子”。会所在一些市场仍在增长，尤其是在美国以外的市场。 6 月份，该应用程序的新下载量为 770 万次，其中 580 万次来自印度。国际增长是 Clubhouse 最新筹款的关键部分，在此期间，投资者对该应用程序的估值为 40 亿美元。尽管如此，随着美国用户增长放缓，一些人质疑该应用程序能否达到其估值。 “NFT 或 Clubhouse 估值，哪个泡沫更大？”科技分析师迈克尔加滕伯格今年早些时候发了推文。上周，技术公关人员 Ed Zitron 称 Clubhouse 的全面发布是“没人想谈论的大臭蛋”。 Clubhouse 将其国际增长作为人们仍然喜欢使用该应用程序的证据。一位发言人在电子邮件中写道：“在全球范围内，我们看到每天创建的房间数量从 5 月的 30 万个增加到 6 月的 40 万个，再到 7 月的 50 万多个，这表明参与的用户数量在不断增加。”但与刚推出时相比，它现在也面临着更多的竞争。 Facebook 和 Twitter 都在去年创建了实时音频功能，为音频创作者提供了通过其内容获利的方法。 Discord 是最初受游戏玩家欢迎的音频聊天应用程序，后来将自己重新命名为各种创作者“交谈和闲逛”的地方。大流行的社会隔离是许多数字平台的顺风；现在，他们将不得不相互竞争创作者和内容，以吸引用户回来。在 Clubhouse，如今的许多房间听起来都与一年前的房间相似：“向 VC 和顶级企业家推介您的初创公司📈”或“Mix &amp; Mingle Shoot Your Shot 30+ Singles”。但也有迹象表明会所的人口结构正在发生变化，尤其是在其新的增长来自国外的情况下。星期四，成千上万的人冲进了一个名为 H1GHER HOUR 的房间，由同名的韩国嘻哈唱片公司领导，韩国男孩乐队领导人 Jay B 和说唱歌手 pH-1 就在那里。房间很快就达到了8000人的容量，有人做了一个溢出的房间，然后那个房间就达到了容量。这感觉就像是俱乐部早期的时刻之一。 Clubhouse 的未来可能看起来更像那样——仍在增长，只是不再像以前那样面向同一群人了。\n🏃🏽‍♀️ 想要获得健康的最佳工具吗？查看我们的 Gear 团队精选的最佳健身追踪器、跑步装备（包括鞋子和袜子）和最佳耳机", "note_en": "Among early adopters, the most coveted item this time last year was not hand sanitizer or Clorox wipes but a username on Clubhouse, the audio-only social media platform that had  Silicon Valley abuzz when it launched in the spring. Access required an invitation from someone already on the app, and these became so in-demand during the lonely months of quarantine that some sold for hundreds of dollars on eBay. Clubhouse was hailed as the  future  of  social  media by numerous outlets (including this one) as its waiting list grew to 10 million.\n Today, those invitations are worthless: Clubhouse had its long-awaited general release on Wednesday, meaning anyone can now set up an account simply by downloading the app. And yet, the masses don’t seem to be rushing in. The app had 484,000 new installs globally between July 21 and 25, according to analytics group SensorTower. That’s a 17 percent increase from the previous five-day period, mostly coming from outside of the United States. On Apple’s App Store, Clubhouse ranked 10th among apps in the category of free social networking on its first day open to the public—even downloads of Google Duo were higher. On Android, where Clubhouse is newer, it barely cracked the top 20.\n For an app that  only recently beat out Instagram, TikTok, and WhatsApp in global app stores, that’s a middling debut. In the past, Clubhouse has said that its invite system was key to growing “in a measured way,” onboarding new users in batches and building out features like DMs as needed. Without its exclusivity, though, Clubhouse also seems to have lost some of its hype.\n  “Selling my Clubhouse invites,” the tech blogger Jane Manchun Wong  joked on Wednesday, when the app announced that it would be available for general download. “You may have to pay people to take them from you,” replied Alex Lieberman, the executive chairman of Morning Brew, an email newsletter favored by the millennial business set. Morning Brew had recently declared Clubhouse “ over,” noting that the app felt less “like Soho House—exclusive and therefore mysteriously cool” and more “like an open house.”\n  Clubhouse is still growing in some markets, particularly outside of the United States. In June, the app had 7.7 million new downloads, 5.8 million of which came from India. International growth was a key part of Clubhouse’s latest fundraising, during which investors valued the app at  $4 billion. Still, as user growth in the US slowed, some have questioned whether the app can live up to its valuation. “NFTs or Clubhouse valuation, which is the bigger bubble?” tech analyst Michael Gartenberg  tweeted earlier this year. And last week, technology publicist Ed Zitron called Clubhouse’s general release “ the big stinker that nobody wants to talk about.”\n Clubhouse points to its international growth as evidence that people still enjoy being on the app. “Globally, we&#39;ve seen the number of rooms created daily rise from 300K in May to 400K in June to 500K+ in July, which indicates a growing number of engaged users,” a spokesperson wrote over email. But it also faces more competition now than it did when it first launched. Facebook and Twitter both created live audio features in the last year, with ways for  audio creators to monetize their content. Discord, the audio chat app originally popular with gamers, rebranded itself as a place for creators of all sorts to “talk and hang out.” The social isolation of the pandemic was a tailwind for many digital platforms; now, they’ll have to compete with each other for the creators and content that will keep users coming back.\n  On Clubhouse, many of the rooms these days sound similar to the ones that existed a year ago: “PITCH your startup 📈 to VCs and Top Entrepreneurs,” or “Mix &amp; Mingle Shoot Your Shot 30+ Singles.” But there are also signs that Clubhouse’s demographics are changing, especially as its new growth comes from abroad. On Thursday, thousands of people rushed into a room called the H1GHER HOUR, led by the eponymous Korean hip hop record label, where Korean boy band leader Jay B and rapper pH-1 were on stage. The room quickly reached the 8,000-person capacity, someone made an overflow room, and then that room reached capacity. It felt like one of the moments from Clubhouse’s early days. Clubhouse’s future might look more like that—still growing, just not for the same crowd as before.\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2021-07-30 00:42:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大家,opens,应用程序", "title": "会所向大家敞开大门，有人抢着进去吗？", "title_en": "Clubhouse opens its doors to everyone, is anyone rushing to get in?", "transed": 1, "url": "https://www.wired.com/story/clubhouse-opens-its-doors-is-anyone-rushing-to-get-in/", "via": "", "real_tags": ["大家", "opens", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "aba3fb9068060e6e7e57876a8ed44f14.png", "infoid": 1070431, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个程序员都应该对像 &quot;5&quot; == 5 这样的表达式的结果有自己的看法，甚至可能猜测他们最熟悉的编程语言中的答案是什么。在我看来，SQL 是正确的。例如，我们在 Google BigQuery 中得到以下内容。 SELECT &quot;5&quot; = 5-- 没有匹配的运算符 = 参数类型的签名：STRING、INT64。支持的签名：ANY = ANY at [1:8] 这是一个很好的安全早期错误，可以防止很多令人困惑的数据处理错误。这在相关示例中可能更清楚。 SELECT &quot;5&quot; IN (1, 2, 3)-- 对于参数类型文字 STRING 和 {INT64} 在 [1:12] 处的运算符 IN 没有匹配的签名在这种情况下：用户很可能是指 SELECT 5 IN (1 , 2, 3)，即检查一个整数是否在给定的整数集合中。并且用户实际上不太可能是指 SELECT &quot;5&quot; IN (1, 2, 3)。通过简单的类型检查，第二种形式在 SQL 中永远不会为真，因此禁止它很有用。违反预期的行为会被发现，因此很容易发现和避免。为了好玩，从记忆中，在 Python3 中计算表达式 &quot;5&quot; == 5 的结果是什么？\n事实证明它是 False，这在通用编程语言中很有用且易于理解。 Python 处理异构列表和集合。因此，给定语言上下文，{1, 2, 3} 中的 &quot;5&quot; == 5 和 &quot;5&quot; 是合理的表达式。 R 是一种我喜欢并经常使用的语言。哎呀，我什至写了一本关于使用 R 工作的书，我为此感到非常自豪。但是，我无法为“5”==5 的 R 返回值辩护。结果证明这是正确的。当然，人们可以猜测哪种隐式转换支持这一点，但 R 不是一种字符串和数字通常等效的语言。然而，我们有 5 %in% c(&quot;5&quot;) 评估为 TRUE。 R 主要强制执行同构类型，但它通过安静的隐式类型转换（一种不断提供的错误礼物）来实现。一个消息灵通的 R 用户期望 c(5, &quot;5&quot;) 是一个字符串向量；我不太相信许多人期望“5” == 5 评估为 TRUE。人们会期望相等的值总是可以支持相同的操作。然而，在 R 中，5 + 1 是一个合理的表达方式，而“5” + 1 则不是。所以，我发现很难说 5 和“5”是等价的。", "note_en": "Every programmer should have an opinion on what the outcomes of the expressions like  &#34;5&#34; == 5 should be, and perhaps even a guess as to what the answer is in their most familiar programming language.\n In my opinion SQL gets it right. For example, we get the following in Google BigQuery.\n SELECT &#34;5&#34; = 5-- No matching signature for operator = for argument types: STRING, INT64. Supported signature: ANY = ANY at [1:8]\n That is a nice safe early error that can prevent a lot of confusing data processing bugs down the line. This may be clearer in the related example.\n SELECT &#34;5&#34; IN (1, 2, 3)-- No matching signature for operator IN for argument types literal STRING and {INT64} at [1:12]\n  In this context: it is likely the user meant  SELECT 5 IN (1, 2, 3), i.e. to check if an integer was in a given set of integers. And it is unlikely the user actually meant  SELECT &#34;5&#34; IN (1, 2, 3). The second form can  never be true in SQL, by simple type inspection, so it is useful to have it disallowed. Violations of expectations are caught and thus easy to find and avoid.\n  For fun, from memory, what is the outcome of evaluating the expression  &#34;5&#34; == 5 in Python3?\n    It turns out it is  False, which is useful and understandable in a general purpose programming language. Python deals with heterogeneous lists and sets. Thus,  &#34;5&#34; == 5 and  &#34;5&#34; in {1, 2, 3} are sensible expressions, given the language context.\n  R is a language I love and routinely work in. Heck, I even wrote a book about working in it, which I am very proud of.\n However, I can’t defend R’s return value for  &#34;5&#34; == 5. This turns out to be  TRUE. One can, of course, guess at what sort of implicit casting is supporting this, but R isn’t a language where strings and numbers are generally equivalent. Yet we have  5 %in% c(&#34;5&#34;) evaluating to  TRUE. R mostly enforces homogeneous types, but it does so by quiet implicit type conversion (a buggy gift that keeps on giving). A well informed R user expects  c(5, &#34;5&#34;) to be a vector of strings; I am less convinced many expect  &#34;5&#34; == 5 to evaluate to  TRUE.\n One would expect equal values can always support the same operations. However, in R,  5 + 1 is a sensible expression and  &#34;5&#34; + 1 is not. So, I find it hard to argue  5 and  &#34;5&#34; are equivalent values.", "posttime": "2021-07-30 00:42:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看法,opinion,期望", "title": "我对“5”的看法 == 5", "title_en": "My Opinion on “5” == 5", "transed": 1, "url": "https://win-vector.com/2021/07/28/my-opinion-on-5-5/", "via": "", "real_tags": ["看法", "opinion", "期望"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070430, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎阅读我们关于在生产中使用 Elixir 的公司的系列案例研究。查看我们迄今为止发布的所有案例。 X-Plane 11 是世界上最全面、最强大的个人电脑和移动设备飞行模拟器。 X-Plane 不是游戏，而是由 Laminar Research 创建的工程工具，可用于以令人难以置信的准确度预测固定翼和旋翼飞机的飞行质量。 X-Plane 特许经营权有消费者版和 FAA 认证的专业版。最近，X-Plane 团队接受了添加多人游戏体验的挑战，目标是在同一会话中容纳 10000 名以北的用户。本文探讨了他们选择 Elixir 的原因，以及一个由一个开发人员组成的团队（之前没有语言经验）如何在 6 个月内学习该语言并部署了广受欢迎的多人游戏体验。整体解决方案采用 Elixir 中 RakNet 通信协议的全新开源实现，并在遇到意外负载时超过了原始要求。 X-Plane 团队长期以来一直在模拟器中提供点对点多人游戏，但从未提供服务器托管的多人游戏。这对他们来说是一个新的旅程，他们可以完全自由地选择技术堆栈。根据他们的博客文章，他们的目标是：构建一个具有错误隔离功能的坚如磐石的服务器。例如，客户端更新期间的异常不应导致整个服务器停机。实现一个可以扩展到数万个并发试验的共享世界。快速迭代：因为这是 Laminar 研究团队第一次提供托管多人游戏环境，他们希望快速行动以发布该系统。这将允许用户立即开始组队飞行，并作为一个平台来衡量对进一步功能开发的兴趣。\n要快速和一致。多人游戏具有“软实时”约束，他们需要始终如一地准时为所有客户提供服务。从数量上讲，这意味着 99% 的响应时间比平均值或中位数重要得多。从这些需求来看，对稳定性和快速迭代的需求排除了低级语言，即使是那些他们有大量内部经验的语言。对速度和垂直可扩展性的需求排除了许多现代 Web 语言，例如 Ruby 和 Python，在这些语言中，扩展模型通常会投入更多的服务器。必须避免在多台机器之间同步状态，这需要更多的开发时间，并且由于延迟的增加而恶化了用户体验。他们最终确定了三个顶级竞争者：Rust、Go 和 Elixir。 Elixir 的优势在于两个独特的功能：容错和可预测的延迟。两者都内置于 Erlang 虚拟机的核心——Elixir 运行的强大平台。 X-Plane 负责该实施的工程师 Tyler Young 强调说：“我们想要一个可以最大化服务器容量的堆栈。我们宁愿运行 64 核机器，也不愿运行数十个 4 核 VM。 Saša Jurić 的演讲，Erlang 和 Elixir 的灵魂，向我们展示了平台提供的并发模型、进程隔离和部分重启是我们正在寻找的抽象。”准备尝试 Elixir 时，Tyler 拿起了几本书，但很快意识到该语言的入门指南提供了他需要的背景知识。他解释说：“虽然介绍性指南涵盖了语言结构，但网站上的高级指南让您使用 TCP 连接构建一个实际项目，以及我们将在生产中使用的基本架构模式。”然而，他并没有一头扎进多人服务器，而是决定让 Elixir 尝试解决一个较小的问题。他为美国国家海洋和大气管理局 (NOAA) 气象服务编写了一个网络代理，并将其投入生产。这次经历教会了他利用 Erlang VM 提供的所有工具和指标的重要性。他们选择 AppSignal 来帮助消费和消化这些信息。两周后，他通过在 Elixir 中实现以 UDP 为中心的 RakNet 协议，开始在服务器上工作。不幸的是，文档很少，因此大多数时候他们不得不参考 C++ 中的参考实现。幸运的是，由于其根植于电信和网络服务，Elixir 和 Erlang 内置了对解析二进制数据包的支持，这让这项任务变得很有趣。该团队还将每个 UDP 连接映射到 Elixir 中不同的轻量级执行线程，我们称之为进程。 Elixir 进程便宜、隔离、并发，并且由运行时合理调度。这种设计使 X-Plane 团队能够充分利用最初将他们吸引到平台的稳健性和可预测延迟的特性。他们的实现是在 Erlang 的 gen_udp 之上编写的，并且是开源的。\n在选择 Elixir 五个月后，他们开始欢迎 beta 测试人员加入服务器。社区的反应非常积极，新的多人游戏体验在一个月后上线后导致订阅数量大幅增加。目前，X-Plane 在北美的玩家群由一台服务器驱动，运行在 1 台 16GB 内存的八核机器上，尽管有效使用了 200MB 或 300MB 的内存。每个连接的播放器每秒发送 10 个更新。对于部署，他们使用蓝绿策略，在相同容量的两台服务器之间交替。 Tyler 解释说：“我们知道 Erlang VM 提供热代码交换和分发，但我们尽可能采取最简单的路线。我们在部署期间在两台服务器之间交替使用要容易得多，因为服务器很稳定，而且我们不经常部署。同样，在分销方面，我们更喜欢垂直扩展或为全球玩家在不同地区设置不同的服务器。”项目启动后加入的 Paul McCarty 可以证明它的简单性：“即使没有 Elixir 之前的经验，我也能够尽早加入并为我们的 HTTP API 添加新功能。”这些 API 构建在 Plug 之上，以支持其聊天服务、提供有关已连接用户的信息等。他总结道：“在添加新功能时，服务器开发永远不是瓶颈。”保罗和泰勒用一个奇怪的轶事结束了我们的谈话：几个月前，他们发布了一个更新的客户端版本，其中包含调试代码。这个额外的代码导致每个连接的用户每 100 毫秒不断地 ping 服务器，即使不是在多人模式下也是如此。这导致他们的流量增加了 1000 倍！两周后，当他们看到 Elixir 服务器中的 CPU 使用率从 5% 增加到 21% 时，他们才发现这种增长。一旦他们发现了根本原因以及系统如何处理它，他们就会意识到他们不必急于更新客户端来删除调试代码，他们选择保持正常的发布周期。归根结底，这是他们围绕语言和平台获得和建立的信心的完美例子。", "note_en": "Welcome to our series of case studies about companies using Elixir in production.  See all cases we have published so far.\n X-Plane 11 is the world’s most comprehensive and powerful flight simulator for personal computers and mobile devices. X-Plane is not a game but an engineering tool created by Laminar Research that can be used to predict the flying qualities of fixed- and rotary-wing aircraft with incredible accuracy. The X-Plane franchise comes in both consumer and FAA-certifiable professional versions.\n Recently, the X-Plane team took on the challenge of adding a multiplayer experience with the goal of hosting north of 10000 users in the same session. This article explores why they chose Elixir and how a team of one developer - without prior language experience - learned the language and deployed a well-received multiplayer experience in 6 months. The overall solution features a brand new open-source implementation of the RakNet communication protocol in Elixir and overperforms the original requirements when put under unexpected load.\n   The X-Plane team has offered peer-to-peer multiplayer in the simulator for a long time but never server-hosted multiplayer. This was a new journey for them and they had complete freedom to pick the technology stack.  According to their blog post, their goals were:\n To build a rock-solid server with error isolation. For example, an exception during a client update should not bring the whole server down.\n  To implement a single shared world that can scale to tens of thousands of concurrent pilots.\n  To iterate quickly: because this was the first time the Laminar Research team offered a hosted multiplayer environment, they wanted to move quickly to ship this system. This would allow users to begin flying in groups immediately and serve as a platform to gauge interest in further feature development.\n  To be fast and consistent. Multiplayer has a “soft real-time” constraint, and they need to service  all clients consistently and on time. Quantitatively, this means the 99th percentile response times matter a lot more than the mean or median.\n From those requirements, the need for stability and fast iteration ruled out low-level languages, even the ones in which they had plenty of in-house experience.\n The need for speed and vertical scalability excluded many modern web languages, such as Ruby and Python, where the model for scaling up is generally throwing more servers at it. It was essential to avoid synchronizing state across multiple machines, which requires more development time and worsens the user experience due to the increased latency.\n They eventually settled on three top contenders: Rust, Go, and Elixir. Elixir took the edge thanks to two exclusive features: fault tolerance and predictable latency. Both are built into the very core of the Erlang Virtual Machine - the robust platform that Elixir runs on. Tyler Young, X-Plane’s engineer leading this implementation, highlights: “We wanted a stack that could max server capacity. We would rather run a 64-core machine than dozens of 4-core VMs. Saša Jurić’s talk,  the Soul of Erlang and Elixir, showed us that the concurrency model, process isolation, and partial restarts provided by the platform were the abstractions we were looking for.”\n  Ready to give Elixir a try, Tyler picked up a couple books but soon realized the language’s  Getting Started guide provided the background he needed. He explains: “while the introductory guide covers the language constructs, the advanced guide on the website has you build an actual project with TCP connections, with the basic architectural patterns we would use in production.”\n However, instead of jumping headfirst into the multiplayer server, he decided to give Elixir a try on a smaller problem. He wrote a web proxy to the National Oceanic and Atmospheric Administration (NOAA) weather services and put it in production. This experience taught him the importance of leveraging all of the instrumentation and metrics provided by the Erlang VM. They chose  AppSignal to help consume and digest this information.\n Two weeks later, he started working on the server by implementing  the UDP-centric RakNet protocol in Elixir. Unfortunately, there is little documentation, so they had to refer to the reference implementation in C++ most of the time. Luckily, thanks to its roots in telecommunication and network services,  Elixir and Erlang have built-in support for parsing binary packets, which made the task a joy. The team also mapped each UDP connection to distinct lightweight threads of execution in Elixir, which we call  processes. Elixir processes are cheap, isolated, concurrent, and are fairly scheduled by the runtime. This design allowed the X-Plane team to fully leverage the properties of robustness and predictable latency that first attracted them to the platform. Their implementation is written on top of Erlang’s  gen_udp and  is open source.\n Five months after choosing Elixir, they began welcoming beta testers into the server. The community’s reaction was overwhelmingly positive, and the new multiplayer experience led to a strong uptick in the number of subscriptions as it went live a month later.\n  At the moment, X-Plane’s player base in North America is powered by a single server, running on 1 eight-core machine with 16GB of memory, although only 200MB or 300MB of memory is effectively used. Each connected player sends 10 updates a second.\n For deployments, they use a blue-green strategy, alternating between two servers of the same capacity. Tyler explains: “We are aware the Erlang VM provides hot code swapping and distribution, but we are taking the simplest route whenever possible. It is much easier for us to alternate between two servers during deployments, as the servers are stable and we don’t deploy frequently. Similarly, when it comes to distribution, we prefer to scale vertically or set up different servers in different regions for players across the globe.”\n Paul McCarty, who joined the project after launch, can attest to its simplicity: “even without prior Elixir experience, I was able to jump in and add new functionality to our HTTP APIs early on.” Those APIs are built on top of  Plug to power their chat services, provide information about connected users, and more. He concludes: “When adding new features, the server development is never the bottleneck.”\n Paul and Tyler finished our conversation with a curious anecdote: a couple months ago, they distributed an updated client version with debug code in it. This additional code caused each connected user to constantly ping the server every 100ms, even if not in multiplayer mode. This caused their traffic to increase 1000x! They only discovered this increase 2 weeks later when they saw the CPU usage in their Elixir server went from 5% to 21%. Once they found out the root cause and how the system handled it, they realized they didn’t have to rush a client update to remove the debug code and they chose to maintain their regular release cycle. At the end of the day, it was a perfect example of the confidence they gained and built around the language and platform.", "posttime": "2021-07-30 00:42:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "elixir,multiplayer", "title": "在 X-Plane 上使用 Elixir 引导多人服务器", "title_en": "Bootstrapping a multiplayer server with Elixir at X-Plane", "transed": 1, "url": "https://elixir-lang.org/blog/2021/07/29/bootstraping-a-multiplayer-server-with-elixir-at-x-plane/", "via": "", "real_tags": ["elixir"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070429, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 PDF 摘要：我们展示了光子的自由空间衍射分布非常有用的纠缠：传播模式的接收器可以仅使用线性光学和光子计数进行分布式量子计算。分布式计算需要接收器之间的经典通信，但是，类似于标准的基于测量的计算，这种通信是纯随机结果，因此无法与噪声区分开来。标题中的推测源于进一步的观察，即谨慎的文明隐藏其光子纠缠分布的自然方法是利用它们所访问的各个恒星已经发出的热光。这要求他们知道他们选择使用的模式中的光子数，因此他们需要对光子数进行量子非破坏测量。因为他们测量的热光在数字基础上是对角线的，即使这个过程原则上可以被排除在谈话之外的我们这些人无法分辨。", "note_en": "Download PDF  Abstract: We show that free-space diffraction of photons distributes highly usefulentanglement: the receivers of the propagated modes can do a distributedquantum computation using only linear optics and photon counting. Thedistributed computation requires classical communication between receivers,however, similar to standard measurement-based computation, that communicationis of purely random outcomes and so can be indistinguishable from noise. Thespeculation in the title arises from the further observation that the naturalway for a circumspect civilization to hide their photonic entanglementdistribution is to use the thermal light already being emitted from the variousstars they visit. This requires them knowing the number of photons in the modesthey have chosen to use, and as such they would need to perform a quantumnon-demolition measurement of photon number. Because the thermal light they aremeasuring is diagonal in the number basis even this process can be rendered inprinciple indiscernible to those of us excluded from the conversation.", "posttime": "2021-07-30 00:42:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文明,quantum,光子", "title": "外星文明无法检测的量子计算和通信", "title_en": "Undetectable quantum computation and communication for alien civilizations", "transed": 1, "url": "https://arxiv.org/abs/2107.13023", "via": "", "real_tags": ["文明", "quantum", "光子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当代安培科技股份有限公司（CATL）于7月29日成功举办首场线上发布会“科技区”，宁德时代董事长曾彦宏博士携旗下AB公司第一代钠离子电池亮相电池组解决方案 - 能够将钠离子电池和锂离子电池集成为一个电池组 - 在活动中。作为宁德时代探索基础科学技术的又一里程碑，钠离子电池将为清洁能源的利用和交通电气化提供新的解决方案，从而推动碳中和目标的早日实现。随着碳中和成为全球共识，新能源产业进入复杂多元的发展阶段。日益细分的市场对电池提出了差异化的要求。与此同时，世界范围内电池基础材料的研发正在加速推进，为钠离子电池的产业化打开了双向窗口。钠离子电池的工作原理与锂离子电池相似。钠离子也在阴极和阳极之间穿梭。但与锂离子相比，钠离子体积更大，对材料的结构稳定性和动力学性能要求更高。这已经成为钠离子电池产业化的瓶颈。 CATL多年来一直致力于钠离子电池电极材料的研发。在正极材料方面，宁德时代采用了比容量更高的普鲁士白材料，通过重新排列电子重新设计了材料的体结构，解决了材料循环时容量快速衰减的世界性难题。在负极材料方面，宁德时代开发了一种具有独特多孔结构的硬碳材料，能够实现钠离子的丰富储存和快速移动，并具有出色的循环性能。宁德时代第一代钠离子电池基于一系列化学体系创新，具有能量密度高、充电快、热稳定性好、低温性能好、集成效率高等优点。 .宁德时代的钠离子电池电芯能量密度最高可达160Wh/kg，室温下15分钟可充至80%SOC。而且，在-20°C的低温环境下，钠离子电池的容量保持率可达90%以上，系统集成效率可达80%以上。钠离子电池的热稳定性超过了国家对牵引电池的安全要求。第一代钠离子电池可用于各种交通电气化场景，尤其是在极低温地区，其突出优势更加明显。并且可以灵活适配储能领域所有场景的应用需求。宁德时代一直以成为全球首屈一指的创新科技公司为愿景，为人类绿色能源解决方案做出卓越贡献。为实现愿景，宁德时代正在三个战略发展方向上不懈努力。第一个发展方向是用可再生能源发电和储能替代固定化石能源；二是用电动汽车电池替代移动化石能源，加快电动汽车的发展；三是推动市场应用以电气化+智能化的融合创新，加快推动新能源在不同领域的应用。为支持这三个发展方向的可持续发展，宁德时代建立了化学体系、结构体系、制造体系和商业模式四大创新体系，构建了从基础研究到产业应用的快速转化能力，到大规模商业化。材料和化学体系的基础研究具有重要意义。宁德时代董事长曾斌博士曾表示，有人认为电池化学体系很难有突破，只能在物理结构体系上有所改进。但我们相信电化学的世界就像能量立方体，那里还有很多未知数等着我们去发现。我们永远不会厌倦探索它的奥秘。通过使用高通量计算平台和仿真技术，基于对原理的深刻理解，结合先进算法和计算能力的应用，我们进行深入探索，开发出最适合钠离子的化学体系。离子电池，使其进入产业化快车道，不断进化。下一代钠离子电池的能量密度发展目标是超过200Wh/kg。\n在电池系统创新方面，宁德时代在电池系统集成方面又取得突破，开发了AB电池系统解决方案，将钠离子电池和锂离子电池按一定比例混合搭配，集成为一个电池系统。 ，并通过BMS精密算法控制不同的电池系统。 AB电池系统解决方案可以弥补目前钠离子电池能量密度不足的问题，同时也扩大了其在低温下的高功率和性能优势。得益于这种创新的结构体系，锂钠电池系统的应用场景得到了扩展。活动现场，宁德时代研究院副院长黄奇森博士表示，钠离子电池制造与锂离子电池生产设备和工艺完美兼容，生产线可快速切换，实现高-生产能力。目前，宁德时代已开始钠离子电池产业布局，计划到2023年形成基础产业链。宁德时代诚邀上游供应商、下游客户、研究机构共同加快钠离子电池的推广和发展。离子电池。 Robin Zeng博士表示，碳中和催生了对TWh级电池的需求，推动了新能源产业的蓬勃发展。应用需求的不断涌现为展示不同技术的能力提供了机会。多元化的技术路线也将保证行业长期发展的稳定性。", "note_en": "Contemporary Amperex Technology Co., Ltd. (CATL) successfully held its first online launch event “Tech Zone” on July 29. Dr. Robin Zeng, chairman of CATL, unveiled the company’s first-generation sodium-ion battery, together with its AB battery pack solution - which is able to integrate sodium-ion cells and lithium-ion cells into one pack - at the event. As another milestone of CATL in the exploration of basic science and technology, sodium-ion batteries will provide a new solution for the use of clean energy and transportation electrification, thus promoting the early realization of the goal of carbon neutrality.\n       As carbon neutrality has become a global consensus, the new energy industry has entered a complex and diversified development stage. The increasingly segmented markets have raised differentiated requirements for batteries. At the same time, the worldwide research and development of basic materials for batteries is accelerating, which opens a two-way window for the industrialization of sodium-ion batteries.\n  The sodium-ion battery has a similar working principle to the lithium-ion battery. Sodium ions also shuttle between the cathode and anode. However, compared with lithium ions, sodium ions have a larger volume and higher requirements regarding structural stability and the kinetic properties of materials. This has become a bottleneck for the industrialization of sodium-ion batteries.\n  CATL has been dedicated to the research and development of sodium-ion battery electrode materials for many years. In terms of cathode materials, CATL has applied Prussian white material with a higher specific capacity and redesigned the bulk structure of the material by rearranging the electrons, which solved the worldwide problem of rapid capacity fading upon material cycling. In terms of anode materials, CATL has developed a hard carbon material that features a unique porous structure, which enables the abundant storage and fast movement of sodium ions, and also an outstanding cycle performance.\n  Based on a series of innovations in the chemistry system, CATL’s first generation of sodium-ion batteries has the advantages of high-energy density, fast-charging capability, excellent thermal stability, great low-temperature performance and high-integration efficiency, among others. The energy density of CATL’s sodium-ion battery cell can achieve up to 160Wh/kg, and the battery can charge in 15 minutes to 80% SOC at room temperature. Moreover, in a low-temperature environment of  -20°C, the sodium-ion battery has a capacity retention rate of more than 90%, and its system integration efficiency can reach more than 80%. The sodium-ion batteries’ thermal stability exceeds the national safety requirements for traction batteries. The first generation of sodium-ion batteries can be used in various transportation electrification scenarios, especially in regions with extremely low temperatures, where its outstanding advantages become obvious. Also, it can be flexibly adapted to the application needs of all scenarios in the energy storage field.\n    CATL has always been committed to being a global premier innovative technology corporation and delivering excellent contributions to the green energy resolution for mankind as its vision. To achieve its vision, CATL is making unremitting efforts in three strategic development directions. The first development direction is to replace stationary fossil energy with renewable energy generation and energy storage; the second is to replace mobile fossil energy by using EV batteries to accelerate the development of E-mobility; the third is to promote the integration innovation of market applications leveraging electrification plus intelligence to accelerate the drive towards new energy applications in different fields. To support sustainable development in these three development directions, CATL has established a four-pillar innovation system, namely in the chemistry system, structure system, manufacturing system and business models, to build a rapid transformation capability from fundamental research to industrial application, and then to large-scale commercialization.\n     The fundamental research of material and the chemistry system is of great importance. Dr. Robin Zeng, chairman of CATL, has said that some people believe that the battery chemistry system will hardly see any more breakthroughs, and that only improvements can be made in the physical structure system. But we believe that the world of electrochemistry is like the Energy Cube, where there are still a lot of unknowns for us to discover. We never get tired of exploring its mysteries. By using a high-throughput calculation platform and simulation technology, based on our deep understanding of principles combined with the application of advanced algorithms and computing capacity, we engage in an in-depth exploration to develop a chemistry system that is most suitable for sodium-ion batteries, enable them to enter the fast track to industrialization, and continuously evolve. The next generation of sodium-ion batteries’ energy density development target is to exceed 200Wh/kg.\n  In terms of battery system innovation, CATL has made another breakthrough in battery system integration and developed an AB battery system solution, which is to mix and match sodium-ion batteries and lithium-ion batteries in a certain proportion and integrate them into one battery system, and control the different battery systems through the BMS precision algorithm. The AB battery system solution can compensate for the current energy-density shortage of the sodium-ion battery, and also expand its advantages of high power and performance in low temperatures. Thanks to this innovative structure system, application scenarios for the lithium-sodium battery system are expanded.\n    At the event, Dr. Qisen Huang, deputy dean of the CATL Research Institute, said that sodium-ion battery manufacturing is perfectly compatible with the lithium-ion battery production equipment and processes, and the production lines can be rapidly switched to achieve a high-production capacity. As of now, CATL has started its industrial deployment of sodium-ion batteries, and plans to form a basic industrial chain by 2023. CATL invites upstream suppliers and downstream customers, as well as research institutions to jointly accelerate the promotion and development of sodium-ion batteries.\n     Dr. Robin Zeng said that carbon neutrality has spawned a demand for TWh-scale batteries and has promoted the vigorous development of the new energy industry. The continued emergence of application demands has given an opportunity to showcase the capabilities of different technologies. Diversified technical routes will also assure the stability of the industry&#39;s long-term development.", "posttime": "2021-07-30 00:41:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时代,unveils,电池", "title": "宁德时代推出第一代钠离子电池", "title_en": "CATL Unveils First Generation of Sodium-Ion Batteries", "transed": 1, "url": "https://www.catl.com/en/news/665.html", "via": "", "real_tags": ["时代", "unveils", "电池"]}, {"category": "", "categoryclass": "", "imagename": "876e33c32a491d47ef14c7ccae12fb40.png", "infoid": 1070427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "矮人要塞是闯入互联网意识的那些古怪的激情项目之一。这是一款免费游戏，您可以在随机生成的幻想世界中扮演冒险家或充满矮人的堡垒。模拟运行深入，新游戏创造了多个具有历史、神话和文物的文明。它已经臭名昭著，这是正确的。个别矮人有情绪状态、最喜欢的宝石和怨恨。这一切都发生在一个 ASCII 界面中，对新手来说看起来很威风，但感觉就像矩阵中的文字：手工艺侏儒，河流，传奇巨兽。整个游戏是开发者 Tarn Adams（又名 Toady One）的产品，他自 2002 年以来一直在 Dwarf Fortress 工作。前四年它是一个兼职项目，但自 2006 年以来一直是全职项目。他自己编写所有代码，尽管他的兄弟帮助设计并根据游戏创建故事。到目前为止，他依靠捐款来维持生计，但他目前正在开发一个带有像素图形和改进后的用户界面的版本，可以在 Steam 上购买。我联系了 Tarn Adams，想了解他在 15 年多的时间里如何管理一个不断增长的代码库、路径的危险以及调试死猫。为了清楚起见，我们对下面的对话进行了编辑。问：您使用哪些编程语言和其他技术？基本上，你的堆栈是什么？在您这样做的 15 到 20 年间，这种情况发生了变化吗？答：DF 是 C 和 C++ 的某种组合，不是以某种标准的服从方式，而是随着时间的推移而产生的混乱。自 MSVC 6 以来，我一直在使用 Microsoft Visual Studio，但现在我使用的是 Visual Studio 社区的某个版本。我使用 OpenGL 和 SDL 来处理引擎问题。我们选择了那些，因为将它们移植到 OSX 和 Linux 更容易，尽管我自己当然仍然无法做到这一点。如果我有选择，我不确定现在是否会使用 Unity 或 Unreal 之类的东西，因为我不知道如何使用它们中的任何一个。但是处理你自己的引擎也是一个真正的痛苦，特别是现在我正在做一些超出文本图形的事情。我将 FMOD 用于声音。\n所有这一切在项目过程中一直保持不变，只是几年后引入了 SDL，因此我们可以进行移植。在游戏的机械方面，我不使用很多外部库，但我偶尔会使用一些随机数生成器——很久以前我放入了一个 Mersenne Twister，最近我采用了 SplitMix64，这是在上一届 Roguelike 庆典的演讲中提到的。 Q : 开发一个项目这么长时间有什么挑战？你认为这更容易自己做吗？也就是说，因为你写了每一行，是不是更容易维护和改变？ A：很容易忘记东西！搜索“;”，这是一种松散的方法，但足够接近，我们有多达 711,000 行，所以现在不可能把它全部记在我的脑海里。我尝试一致且令人难忘地命名我的变量和对象，并在周围留下足够的注释以提醒自己当我到达某个代码点时发生了什么。有时，当我去重温我十年未接触过的游戏的某个部分时，需要多次搜索才能找到我想要拉扯的确切线索，这种情况经常发生。我想说大多数改动都只集中在游戏的某些部分，所以有一种活跃的熔化核心，我有更好的工作知识。在 2006 年首次发布之前，我还没有看过一些非常棘手的部分。 关于自己做事的相对容易程度，当然对于我来说，我没有从事大型多人项目的工作经验，这个是要走的路！人们显然擅长以另一种方式做这件事，例如在 AAA 游戏环境中，并且显然需要多名工程师来按时完成工作。我会犹豫地说我可以比他们更快地进入并改变东西，因为我之前没有在这种情况下工作过，但确实我没有任何以团队为导向或官僚主义的障碍可以跳过通过当我想改变。我可以去做。但我也必须独自完成。 A：有一些重构持续了几个月，重做某些数据结构等等，虽然我不确定这里有什么是严格的重构，因为总是有机会同时推动机制向前发展，这样做是有意义的所以当代码知识新鲜时。添加 Z 坐标使游戏机械化 3D（同时仍然是文本）是另一种方式，这可能是我做过的最令人麻木的事情。仅仅数周又数周的时间进行依赖于 X 和 Y 的逻辑和函数调用，并查看 Z 是如何适应的。使物品系统多态最终是一个错误，但这是一个很大的错误。\n答：当你声明一个类是一种项时，它会将你锁定在该结构中，而不是你只有成员元素。能够使用虚函数之类的东西很好，但是权衡太多了。我开始在层次结构中使用“工具”项目，它开始获得各种功能，现在可以支持从梯子到蜂箱到研钵（和杵，分别地，哈哈）的任何东西，而且感觉更灵活，我希望游戏中的每一个精心制作的物品都在这把伞下。我们做了很多程序生成，如果我们想生成一个部分像一个东西而部分像另一个东西的项目，当你被锁定在一个类层次结构中时，要做到这一点就更难了。添加诸如钻石依赖项之类的东西，当有更简洁的方法来做时，所有这些最终都会让您束手无策。如果可以关闭和打开不同的组件，那就更容易了，并且可以让您做更多的事情。我认为一些游戏开发人员将其称为实体组件系统，但我的理解是，核心优化器的人认为它是其他东西，您实际上在其中按各个领域分解事物。对于缓存未命中，使用具有不同分配子对象的单个对象几乎肯定会更糟，这是另一回事，但在组织、灵活性和可扩展性方面的好处是不容忽视的，工具项的不同子字段是t 使用太频繁以至于它变成了一个优化问题。问：您从 32 位迁移到 64 位时遇到过任何问题吗？这感觉就像是当时很重要但已被广泛接受的事情之一。答：完全没有！我正在努力思考一个问题。对我们来说幸运的是，我们已经很好地控制了我们的字节大小，因为它会保存和加载世界；当我们设置它时，需要确定格式，特别是因为我们不得不处理操作系统之间的字节序等等。而且我们不做任何粗糙的指针操作或其他可能给我们带来麻烦的东西。由于我们的其他实践，它最终成为非常好的 64 位转换代码，完全是偶然的。主要问题只是让时间聚在一起做出改变，然后它并没有像我想象的那么长。问：我见过类似 DF 的其他游戏在他们的寻路算法上死亡。你使用什么以及如何保持效率？ A：是的，基本算法只是其中的一部分。我们使用 A*，它当然很快，但它本身还不够好。我们不能利用这方面的一些创新（例如跳跃点），因为我们的地图变化太大了。通常，人们使用在地图顶部添加各种较大结构的方法来偷工减料，并且由于地图的变化，这些维护时间太长，否则很麻烦。所以我们的方法一直是跟踪可通过步行到达的连接组件。即使地图快速变化，这些也很容易更新，尽管它确实涉及一些洪水填充。例如，如果水将堡垒切成两半，它需要从一侧涌出并将堡垒的整个一半更新为新的索引，但是一旦完成，一般来说就很好了。这样我们就可以从游戏中删除几乎所有失败的 A* 调​​用——我们的代理只需要查询组件编号，如果组件编号相同，他们就知道调用会成功。\n维护速度很快，但缺点是组件索引仅用于步行。例如，这意味着飞行生物没有与步行者有任何不同的全局寻路智能。在战斗和其他一些情况下，我们使用带有实际逻辑的短程洪水填充来给他们一些优势。但这对他们来说并不理想。我不确定我们会在这里尝试其他结构以使其工作得更好。对于我们的地图尺寸，它们都失败了，包括一些外部尝试。当然，通过真正齐心协力的努力，这可能是可能的，而且我已经看到其他游戏已经管理，例如，一些矩形叠加等等，看起来很有希望，但我不确定他们的地图有多大的波动或大.最简单的想法就是为传单添加一个新索引，但这会占用大量内存和速度，因为我们需要同时维护两个索引，而一个已经够糟糕了。更具体的叠加层可以跟踪它们的路径属性（然后您可以通过叠加层而不是图块进行路径选择），但是随着地图的变化，它们难以维护且速度缓慢。还有各种各样的其他想法，比如跟踪楼梯，或者做一些有限的路径缓存，可能会有一些收获。在代理和地图复杂性方面，我们当然处于我们目前可以支持的边缘，所以如果我们想从中获得更多，就必须付出一些努力。问：关于这一点，你同时模拟了很多东西——你如何异步管理这么多这么多的演员（或者你自己）？答：如果我们在讨论多线程中的异步，那么不，除了图形显示本身之外，我们不做任何事情。这里有很多希望，即使是微线程，社区已经帮助我解决了这个问题，但我没有时间深入研究。我没有任何经验，这是一个容易出错的事情。答：当然！过去十年左右在计算机之间迁移的副项目文件夹中包含大约 90 个项目。有的持续数天，有的持续数年。它们大多是其他游戏，几乎总是其他类型的，但也有一些 DF 辅助项目，例如神话生成器原型。没有什么可以接近日光的，但玩起来很有趣。问：在您的大约 90 个副项目中，您是否探索过其他编程语言？如果有，有什么喜欢的吗？\n答：哈哈，没有！我更喜欢设计方面的面条，而不是技术。我确信有些事情确实会加速我的设计的实现，所以我可能至少应该学习一些脚本并更多地玩线程。人们甚至很乐意提供一些图书馆和东西来帮助那里，但是当我的业余项目时间用于放松时，很难阻止业余项目时间用于技术学习。问：你们有最有趣的发行说明。你最喜欢的错误是什么，是什么导致了它？ A：我说起来可能很无聊，但我就是打不过醉猫虫。到目前为止，已经有一些关于它的视频。那是猫在酒馆地板上到处都是死的地方，结果证明它们在清洁爪子时摄入了溢出的酒精。一个数字在清理时摄入代码中被关闭，它让他们经历了酒精中毒的所有症状（我们在整理有毒生物时添加了这一点。）标签：矮人要塞，独立开发者，电子游戏", "note_en": "Dwarf Fortress is one of those oddball passion projects that’s broken into Internet consciousness. It’s a free game where you play either an adventurer or a fortress full of dwarves in a randomly generated fantasy world. The simulation runs deep, with new games creating multiple civilizations with histories, mythologies, and artifacts.\n It has become notorious, and rightly so. Individual dwarves have emotional states, favorite gems, and grudges. And it all takes place in an ASCII interface that looks imposing to newbies, but feels like the text crawl in  The Matrix: craftsdwarf, river, legendary megabeast.\n The entire game is product of one developer, Tarn Adams, aka Toady One, who has been working on Dwarf Fortress since 2002. For the first four years it was a part time project, but since 2006 it’s been full time. He writes all the code himself, although his brother helps out with design and creates stories based on the game. Up until now, he’s relied on donations to keep him going, but he’s currently working on a version with pixel graphics and a revamped UI that will be available for purchase on Steam.\n I reached out to Tarn Adams to see how he’s managed a single, growing codebase over 15+ years, the perils of pathing, and debugging dead cats. Our conversation below has been edited for clarity.\n  Q : What programming languages and other technologies do you use? Basically, what’s your stack? Has that changed over the 15-20 years you’ve been doing this?\n A: DF is some combination of C and C++, not in some kind of standard obeying way, but sort of a mess that’s accreted over time. I’ve been using Microsoft Visual Studio since MSVC 6, though now I’m on some version of Visual Studio Community.\n I use OpenGL and SDL to handle the engine matters. We went with those because it was easier to port them to OSX and Linux, though I still wasn’t able to do that myself of course. I’m not sure if I’d use something like Unity or Unreal now if I had the choice since I don’t know how to use either of them. But handling your own engine is also a real pain, especially now that I’m doing something beyond text graphics. I use FMOD for sound.\n All of this has been constant over the course of the project, except that SDL got introduced a few years in so we could do the ports. On the mechanical side of the game, I don’t use a lot of outside libraries, but I’ve occasional picked up some random number gen stuff—I put in a  Mersenne Twister a long while ago, and most recently I adopted  SplitMix64, which was featured in a talk at the last Roguelike Celebration.\n  Q : What are the challenges in developing a single project for so long? Do you think this is easier to do by yourself? That is, because you wrote every line, is it easier to maintain and change?\n A: It’s easy to forget stuff! Searching for ‘;’, which is a loose method but close enough, we’re up to 711,000 lines, so it’s just not possible to keep it all in my head now. I try to name my variables and objects consistently and memorably, and I leave enough  comments around to remind myself of what’s going on when I arrive at a spot of code. Sometimes it takes several searches to find the exact thread I’m trying to tug on when I go and revisit some piece of the game I haven’t touched for a decade, which happens quite a bit. I’d say most changes are focused only on certain parts of the game, so there is kind of an active molten core that I have a much better working knowledge of. There are a few really crusty bits that I haven’t looked at since before the first release in 2006.\n Regarding the relative ease of doing things by myself, certainly for me, who has no experience working on a large multi-person project, this is the way to go! People obviously get good at doing it the other way, for example over in the AAA games context, and clearly multiple engineers are needed over there to get things done on time. I’d be hesitant to say I can go in and change stuff faster than they can, necessarily, since I haven’t worked in that context before, but it’s true that I don’t have any team-oriented or bureaucratic hurdles to jump through when I want to make an alteration. I can just go do it. But I also have to do it alone.\n  A: There have been some refactors that have lasted for months, redoing certain data structures and so forth, though I’m not sure anything is ever a refactor strictly here since there’s always opportunities to push the mechanics forward simultaneously and it makes sense to do so when the code knowledge is fresh.\n Adding the Z coordinate to make the game mechanically 3D (while still being text) was another one, and really the most mind-numbing thing I’ve probably ever done. Just weeks and weeks and weeks of taking logic and function calls that relied on X and Y and seeing how a Z fits in there.\n Making the item system polymorphic was ultimately a mistake, but that was a big one.\n  A: When you declare a class that’s a kind of item, it locks you into that structure much more tightly than if you just have member elements. It’s nice to be able to use virtual functions and that kind of thing, but the tradeoffs are just too much. I started using a “tool” item in the hierarchy, which started to get various functionality, and can now support anything from a stepladder to a beehive to a mortar (and pestle, separately, ha ha), and it just feels more flexible, and I wish every crafted item in the game were under that umbrella.\n We do a lot of procedural generation, and if we wanted to, say, generate an item that acts partially like one thing and partially like another, it’s just way harder to do that when you are locked down in a class hierarchy. Adding things like  diamond dependencies and all that just end up tying you in knots when there are cleaner ways to do it. If different components can just be turned off and on, it’s easier, and allows you to do more.\n I think some game developers refer to this as an entity component system, though it’s my understanding that harder-core optimizer people think of that as something else where you’re actually breaking things down by individual fields. Using a single object with different allocated subobjects is almost certainly worse for cache misses, which is a whole other thing, but the benefits in organization, flexibility, and extensibility just can’t be ignored, and the different subfields of the tool item aren’t used so often that it becomes an optimization issue.\n Q : Did you run into any issues moving from 32 bit to 64 bit? That feels like one of those things that was huge at the time but has become pretty accepted.\n A: Not at all! I’m struggling to think of a single issue. Fortunately for us, we already had our byte sizes under control pretty well, since it comes up saving and loading the worlds; the format needed to be nailed down back when we set that up, especially because we’ve had to deal with endian stuff between OSes and all that. And we don’t do any gnarly pointer operations or other stuff that might have gotten us in trouble. It just ended up being really good code for 64 bit conversion due to our other practices, entirely by accident. The main issue was just getting the time together to make the change, and then it didn’t end up taking nearly as long as I thought it would.\n Q : I’ve seen other games similar to DF die on their pathfinding algorithms.What do you use and how do you keep it efficient?\n A: Yeah, the base algorithm is only part of it. We use  A*, which is fast of course, but it’s not good enough by itself. We can’t take advantage of some of the innovations on that (e.g.  jump point) since our map changes so much. Generally, people have used approaches that add various larger structures on top of the map to cut corners, and because of the changing map, these just take too long to maintain, or are otherwise a hassle. So our approach has been to just keep track of connected components reachable by walking. These are pretty easy to update even when the map changes quickly, though it does involve some flood-filling. For instance, if water cuts the fortress in half, it needs to flood out from one side and update a whole half of the fortress to a new index, but once that’s done, it’s good, generally. Then that allows us to cut almost all failed A* calls from the game—our agents just need to query component numbers, and if the component numbers are the same, they know the call will succeed.\n It’s fast to maintain, but the downside is that the component indices are maintained for walking only. This means that flying creatures, for instance, don’t have global pathfinding intelligence that’s any different from a walker. In combat and a few other situations, we use short-range flood fills with their actual logic to give them some advantages though. But it’s not ideal for them.\n I’m not sure we’ll attempt other structures here to make it work any better. For our map sizes, they’ve all failed, including some outside attempts. Of course, it might be possible with a really concerted effort, and I’ve seen other games that have managed, for instance, some rectangular overlays and so forth that seem promising, but I’m not sure how volatile or large their maps were.\n The most simple idea would just be something like adding a new index for fliers, but that’s a large memory and speed hit, since we’d need to maintain two indices at once, and one is bad enough. More specific overlays can track their pathing properties (and then you path through the overlays instead of the tiles), but they are hard and slow to maintain as the map changes. There are various other ideas floating around, like tracking stairs, or doing some limited path caching, and there are probably some gains to be made there. We are certainly at the edge of what we can currently support in terms of agents and map complexity, so something’ll have to give if we want to get more out of it.\n Q : On that note, you’re simulating a lot of things all at once—how do you manage so many so many actors asynchronously (or do you)?\n A: If we’re talking about asynchronous as in multithreading, then no, we don’t do any of that, aside from the graphical display itself. There’s a lot of promise here, even with microthreading, which the community has helped me out with, but I haven’t had time to dive into. I don’t have any experience and it’s a bug-prone thing.\n  A: Sure! The side project folder that’s migrated between computers for the last ten years or so has about 90 projects in it. Some of them lasted for days, some for multiple years. They are mostly other games, almost always in other genres, but there are also a few DF helper projects, like the myth generator prototype. Nothing close to seeing the light of day, but it’s fun to play around.\n Q : With your ~90 side projects, have you explored any other programming languages? If so, any favorites?\n A: Ha ha, nope! I’m more of a noodler over on the design side, rather than with the tech. I’m sure some things would really speed up the realization of my designs though, so I should probably at least learn some scripting and play around with threading more. People have even been kind enough to supply some libraries and things to help out there, but it’s just difficult to block side project time out for tech learning when my side project time is for relaxing.\n Q : You have the most interesting release notes. What’s your favorite bug and what caused it?\n A: It’s probably boring for me to say, but I just can’t beat the drunken cat bug. There’ve been a few videos made about it by this point. That was the one where the cats were showing up dead all over the tavern floor, and it turned out they were ingesting spilled alcohol when they cleaned their paws. One number was off in the ingest-while-cleaning code, and it sent them through all the symptoms of alcohol poisoning (which we added when we spruced up venomous creatures.)\n  Tags:  dwarf fortress,  solo developer,  video games", "posttime": "2021-07-30 00:41:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,代码,要塞,developer,游戏", "title": "70 万行代码、20 年和一名开发人员：矮人要塞是如何构建的", "title_en": "700k lines of code, 20 years, and one developer: How Dwarf Fortress is built", "transed": 1, "url": "https://stackoverflow.blog/2021/07/28/700000-lines-of-code-20-years-and-one-developer-how-dwarf-fortress-is-built/", "via": "", "real_tags": ["开发", "代码", "要塞", "developer", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "58900216bda614f0f7867dd673e0ba66.jpg", "infoid": 1070426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Tobias Hollitzer 是位于德国东部城市莱比锡的斯塔西“Runde Ecke”博物馆馆长。一排密封的罐子，每个罐子里都装着一块看似无害的黄色防尘布，构成了博物馆永久展览的一部分。但这些罐子是东德秘密警察收集的用于追踪持不同政见者的气味样本的一部分。 Hollitzer 与 DW-WORLD.DE 谈论了 Stasi 收集人们的气味以及他对今天使用这种方法执法的看法。斯塔西有各种各样的方法和手段来试图追踪那些说过或做过任何批评东德共产主义政权的人。收集气味样本被用来尝试识别那些人，例如，谁分发了传单或谁写了批评性涂鸦。当他们发现一张涂鸦或传单时，他们拿了一块通常是黄色的防尘布，在传单旁边放了一会儿，上面覆盖着一层铝箔保护片，然后他们拿到了样品。然后将布密封在酸洗罐中并储存。如果斯塔西后来在调查过程中遇到了嫌疑人，他们也会试图从这个人那里获取样本——当然，秘密进行。一只训练有素的狗被赋予了两种气味，如果它们匹配，斯塔西就会有一个具体的名字。例如，他们经常会邀请某人与警察或其他官员交谈，而假装是警察或行政人员的卧底斯塔西官员通常会出席这次会议。而当这个人坐在办公室的椅子上时，他们会在不知不觉中浸渍隐藏在座位下的黄色布。当这次虚构的访问结束后，斯塔西官员会将布放入泡菜罐中——他们得到了样品。不，这是警方在刑事调查中使用的一种众所周知的方法，但即使在东德，它也不允许作为证据被接受，这就是为什么通常秘密收集样本而不是公开收集样本的原因。问题不在于气味分析本身，而在于收集气味作为预防措施，以防将来最终使用它们。这就是斯塔西所做的——他们有一个巨大的异见者气味登记册。他们真的试图让每个可能对国家发表批评言论的人都有一个样本，我不确定具体数字，因为在 1989 年（柏林墙倒塌时），样本被摧毁，并且它们没有被列入史塔西文件。但光是在莱比锡地区，肯定有几千。\n您如何看待目前有关德国警方从可能参与 G8 峰会前夕暴力活动的活动人士那里收集气味样本的报道？我认为重要的是要非常清楚该方法的危险在于在没有具体犯罪的情况下使用它。因怀疑人们将来可能会抗议或冒犯而收集样本显然可以追溯到斯塔西时代，当时安全官员的行动不受任何类型的国家限制。在这些所谓的反恐战争时期，您是否认为德国国家在安全活动方面做得太过分了？很长一段时间以来，该州一直走得太远——只是现在围绕气味样本收集的问题使这一点变得明显，因为在德国，Stasi 与这种特殊方法密切相关。如果你看看自 9 月 11 日以来这里发生的事情。有了新的安全法，那么我们不得不问一个问题，我们想以安全的名义牺牲多少自由。电话和互联网数据等信息现在必须至少保存六个月。内政部长沃尔夫冈·朔伊布勒呼吁当局获取道路通行费数据，很明显我们正在成为一个监控国家。", "note_en": "Tobias Hollitzer is the head of the Stasi &#34;Runde Ecke&#34; Museum in the eastern German city of  Leipzig . A row of sealed jars, each containing a seemingly innocuous yellow dust cloth, forms part of the museum&#39;s permanent exhibition. But these jars were part of the East German secret police&#39;s collection of scent samples used to keep track of dissidents.\n  Hollitzer talked to DW-WORLD.DE about the Stasi&#39;s collection of people&#39;s smells and what he thinks of law enforcement using the method today.\n    The Stasi had a whole range of methods and means to try to track down people who said or did anything critical of the East German communist regime. Collecting scent samples was used to try to identify those, for example, who had distributed flyers or who wrote critical graffiti.\n      When they found a piece of graffiti or a flyer then they took a dust cloth, which was usually yellow, and left it for a while lying next to the flyers covered by a protective piece of aluminum foil and then they had their sample. The cloth was then sealed in a pickling jar and stored. If the Stasi later came across a suspect in the process of the investigation, they tried to get a sample from this person as well -- of course, secretly. A trained dog was given the two smells, and if they matched, the Stasi had a concrete name.\n    They would often invite someone in for a talk with the police or other officials, for example, and undercover Stasi officers pretending to be police officers or an administrative person were usually present at this meeting. And while the person sat on the chair in the office, they would be, without knowing it, impregnating a yellow cloth hidden under the seat. When this fictive visit was over, the Stasi officer would then put the cloth in the pickle jar -- and they had their sample.\n    No, it&#39;s a well-known police method used in criminal investigations, but even in the GDR it wasn&#39;t allowed to be admitted as evidence and that&#39;s why the samples were often collected secretly instead of openly. The problem is not with scent profiling as such, but rather with collecting scents as a precautionary measure in case they can eventually be used in the future. This is what the Stasi did -- they had a giant scent register of dissidents. They really tried to have a sample of everyone who potentially could have said something critical of the state\n      I&#39;m not sure of concrete numbers because in 1989 (when the Berlin Wall fell) the samples were destroyed and they aren&#39;t listed in the Stasi files. But just in the Leipzig area, it would have certainly been several thousand.\n  What do you think of current reports that German police have collected scent samples from activists who could be involved in violence in the lead-up to the G8 summit?\n  I think it is important to be very clear that the danger of the method is using it without having a concrete crime. Collecting samples on the suspicion that people could protest or offend in the future clearly harks back to Stasi times, when security officials operated without any type of state limitation.\n  In these times of the so-called war on terror, do you think the German state is going too far in its security activities?\n  The state has being going too far for a very long time -- it&#39;s just that now the issues surrounding the collection of scent samples are making this evident because here in Germany, the Stasi are so strongly associated with this particular method.\n  If you take a look at what has happened here since Sept 11. with new security laws, then we have to ask the question of how much freedom we want to sacrifice in the name of security. Information such as telephone and Internet data now has to be saved for at least six months. Interior Minister Wolfgang Schäuble is calling for authorities to have access to road toll data, and it is clear that we are on the way to becoming a surveillance state.", "posttime": "2021-07-30 00:41:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "气味,giant", "title": "“斯塔西有一个巨大的异见者气味登记册”", "title_en": "“The Stasi Had a Giant Smell Register of Dissidents”", "transed": 1, "url": "https://m.dw.com/en/the-stasi-had-a-giant-smell-register-of-dissidents/a-2555053", "via": "", "real_tags": ["气味", "giant"]}, {"category": "", "categoryclass": "", "imagename": "b24fbbe2fad0f9feb1402b597cc53f3d.png", "infoid": 1070425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么 ISO 应该公开所有标准", "note_en": "Why ISO should make all standards Publicly Available", "posttime": "2021-07-30 00:40:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iso,standards", "title": "ISO 应公开所有标准", "title_en": "ISO should make all standards Publicly Available", "transed": 1, "url": "https://docs.google.com/document/d/12Gmy2s4Nmkw6VDv2B6b5K1DLYhPrTUqSntrlmYzJpNw/edit#", "via": "", "real_tags": ["iso", "standards"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070423, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PulseAudio 现在支持 A2DP 的 LDAC 和 AptX 编解码器。为了使用它们，设备也必须支持编解码器。旧 SBC 编解码器的“XQ”配置变体也可用。 SBC XQ 变体具有固定（并且高于“正常”SBC）比特率，因此如果无线连接不好，它们可能会有更多的掉线，但另一方面，如果连接良好，质量总是很好。对于可变比特率，pulseaudio 现在能够在由于连接问题而降低比特率后再次提高比特率。可以使用 pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez switch-codec CODEC 在命令行上切换编解码器。将 XX_XX_XX_XX_XX_XX 替换为设备地址，例如可以使用 LANG=C pactl list card | 找到该地址。名称。用可用的编解码器名称之一替换编解码器：aptx、aptx_hd、ldac_hq（“高质量”）、ldac_sq（“标准质量”）、ldac_mq（“移动质量”）、sbc、sbc_xq_453、sbc_xq_512、x_sb55可以使用 pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez list-codecs 获取设备支持的编解码器列表，可以使用 pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez get- 查询当前活动的编解码器编解码器。 pavucontrol 中已经实现了一种简化的切换编解码器的方法，并将在下一个 pavucontrol 版本中提供。添加了对 HFP AG 角色的本机支持。本机后端已成为 HSP/HFP 的默认后端。将后端参数设置为 auto 或 ofono 时，仍然支持 ofono。原生后端目前只实现了HFP AG角色，没有实现HFP HS角色，所以这个角色还是需要ofono。此外，还实施了对 mSBC 的支持以提高语音质量。 AVRCP 绝对音量允许 PulseAudio 控制连接的 A2DP 设备的音量（播放时）或连接的设备控制 PulseAudio 中的音量（当设备播放到 PulseAudio 时）。以前在播放耳机时，PulseAudio 在软件中进行自己的音量控制，而耳机在硬件中进行自己的音量控制。有两级音量有时很难获得足够高的音量，现在只有一级音量控制。可以通过将 avrcp_absolute_volume=false 传递给 default.pa 配置文件中的 module-bluetooth-discover 来禁用此功能。加载 ALSA 路径配置文件的代码现在检查文件是否存在于 XDG_DATA_HOME 或 XDG_DATA_DIRS 环境变量指定的目录中（在 pulseaudio/alsa-mixer/paths 子目录下）。这些环境变量由 XDG 基本目录规范定义，即使未设置这些环境变量，XDG 基本目录规范也会定义 PulseAudio 使用的默认位置。特别是，在通常没有设置 XDG_DATA_HOME 的情况下，默认值为 $HOME/.local/share，因此 PulseAudio 将从用户家下的该目录中查找路径配置文件。这在需要自定义路径配置文件时很有用。以前必须修改 /usr/share/pulseaudio/alsa-mixer/paths 中的文件，并且每次升级 PulseAudio 时修改都会丢失。卷积处理代码已被重写以使用阻塞的 FFT 函数，支持潜在的更大的脉冲响应。现有的冲动将随着重写继续发挥作用。过滤器可选地支持不对称响应，这可以通过指定两组脉冲文件来启用，使用 hrir_left 和 hrir_right 选项而不是原始 hrir 选项。 Impulses 应该与格式和频道布局相匹配。可以使用 channel_map 设置指定用于处理的实际音频输入的通道布局，只要所有指定的通道都存在于一个或两个脉冲中。\n当 JACK 启动时，module-jackdbus-detect 会自动加载一个 JACK 接收器和源。现在可以更好地配置接收器和源的参数。 module-jackdbus-detect 接受以下新参数： sink_client_name - JACK 接收器在向 JACK 注册客户端时使用的名称 source_client_name - JACK 源在向 JACK 注册客户端时使用的名称 与使用相同的自定义配置其他几款 USB 游戏耳机现在应用于 SteelSeries Arctis 9，这使得该设备的功能更加强大。 HP Thunderbolt Dock 120W G2 有一个 3.5 毫米耳机连接器，并且有一个单独的音频模块为扩展坞出售，提供免提功能（集成麦克风和具有回声消除功能的扬声器）。 PulseAudio 现在具有改进向用户显示的设备描述并将扬声器标记为语音音频的首选设备的配置。 Behringer U-Phoria UMC22 有两个单声道麦克风输入，在 ALSA 中显示为单个立体声设备。 PulseAudio 现在具有此声卡的自定义配置，允许用户选择仅启用一个或另一个通道的配置文件。这样，录音应用程序最终不会录制仅在一个通道上有音频的立体声轨道。 OnePlus Type-C Bullets 是一款简单的 USB-C 耳机设备。它也适用于默认配置，但添加了自定义配置以隐藏没有意义的卡配置文件（例如，HDMI 显示为默认配置的受支持配置文件）。\nSennheiser GSX 1000 和 1200 PRO 是专为游戏设计的 USB DAC。它们有一个单独的用于语音音频的单声道输出，它们还提供了一个虚拟环绕声设备，可以将 7.1 环绕声音频缩混到硬件中的耳机。添加了自定义配置以正确公开这些设备。现在可以使用 PULSE_MODARGS 变量通过 udev 配置设置 module-alsa-card 模块参数。例如，这允许为基于计时器的调度有问题的特定声卡设置 tsched=false。以前的选项是将tsched选项传递给default.pa中的module-udev-detect，导致所有声卡都受到影响，或者完全放弃自动声卡检测和热插拔支持，在default.pa中手动配置每个声卡.现在可以使用 max_latency_msec 模块参数配置模块空源延迟的上限。 module-filter-apply 在流需要过滤时自动加载过滤器模块（即具有 filter.want 属性）。以前额外的过滤器模块参数可以由 filter.apply.&lt;filter&gt;.paramaters 属性中的流提供，现在可以在硬件接收器/源属性中设置 filter.apply.&lt;filter&gt;.parameters，所以一个流可以简单地请求过滤器而不指定参数，硬件设备可以设置（可能是硬件特定的）参数。最初的期望是不需要多次加载模块匹配，因此它被标记为不打算（也不能）多次加载的模块。然而，结果证明用不同的配置文件匹配不同的属性很有用，所以现在可以多次加载模块。来自 FreeBSD 的几个补丁已经上传。现在拔出声卡应该表现得更好，设备有更好的描述，模块开发检测现在支持热插拔设备。 PulseAudio 的 Meson 构建系统在为 Windows 构建时落后于旧的 Autotools 构建系统，现在应该可以使用 MinGW 使用 Meson 为 Windows 构建 PulseAudio。还有各种针对 Windows 的修复程序，PA 现在可以作为服务在 Win32 上运行。\n可以使用命令 pactl send-message /card/&lt;card name&gt; set-profile-sticky &#39;true|false&#39; 将卡配置文件设置为粘性。可以使用 pactl send-message /card/&lt;card name&gt; get-profile-sticky 查询当前状态。如果卡配置文件具有粘性，即使配置文件不可用，它也将始终被恢复。此外，卡上的端口可用性更改不会影响配置文件选择。例如，这对于将 HDMI 设备的卡配置文件永久设置为“关闭”很有用。将配置文件设置为粘性已在 pavucontrol 中实现，并将在下一个 pavucontrol 版本中提供。添加了新的“消息 API”以促进客户端和脉冲音频对象之间的轻松通信。它目前用于切换蓝牙编解码器并将卡配置文件设置为粘性。消息 API 使用 JSON 格式在脉冲音频对象和客户端之间交换信息。如果应用程序需要虚拟内存的最后一位，它可以通过在连接时在 pa_context 对象上设置 PA_PROP_CONTEXT_FORCE_DISABLE_SHM 布尔 proplist 值来强制禁用共享内存通信通道。主要用户将是具有 2Gb vmem 限制的 Wine 32bit。正如 14.0 发行说明中已经宣布的那样，最终放弃了对 autotools 的支持。介子构建系统得到了显着改进，现在是构建脉冲音频的标准方法。 PulseAudio 的启动脚本（默认为每用户模式的 default.pa 和系统模式的 system.pa）定义了在启动时自动加载的模块集。在脚本的末尾，现在有一个包含指令，用于从 /etc/pulse/default.pa.d/ 或 /etc/pulse/system.pa.d/ 加载文件。这主要适用于在安装包时想要向配置添加一些模块的发行版：现在可以轻松安装包含已安装包配置的文件。如果用户更喜欢在不修改原始启动脚本的情况下将模块添加到配置中，他们当然也可以使用此机制。当使用 PipeWire 替换 PulseAudio 时，libpulse 和 PulseAudio 实用程序仍然有用，但不需要 PulseAudio 守护程序。现在可以在不编译守护程序的情况下编译 libpulse 和实用程序。为此，请将 -Ddaemon=false 传递给 Meson。 PulseAudio 传统上通过 /etc/xdg/autostart/pulseaudio.desktop 文件在图形登录时自动加载一些 X11 模块。这在 Wayland 上并不是真正可取的，因为即使没有以其他方式使用它，它也会自动启动 XWayland。 pulseaudio.desktop 文件现在包含 X-GNOME-HiddenUnderSystemd=true 行，因此当使用 GNOME 和 systemd 时，X11 模块不再以这种方式加载。如果 GNOME 在 X11 下运行，则有一个名为 pulseaudio-x11 的新 systemd 服务来处理加载 X11 模块。\n此行为在 GNOME 以外的其他桌面环境中不可用，但现在它已实现一次，为其他桌面环境开发类似的解决方案也应该很容易。 oss-output Meson 选项可用于显式启用或禁用 OSS 支持（以前，当使用 Meson 而不是 Autotools 时，当找到 sys/soundcard.h 标头时会自动启用 OSS 支持）。 valgrind Meson 选项可用于显式启用或禁用 Valgrind 支持（以前在找到 valgrind/memcheck.h 标头时会自动启用 Valgrind 支持）。 Alexey Rubtsov (1)：使用 Weblate 翻译（俄语）Alper Nebi Yasak（1）：alsa-ucm：在探测卷时记录正确的路径值Anders Jonsson（1）：使用 Weblate 翻译（瑞典语）Arun Raghavan（13）：proplist -util：删除不推荐使用的 G_CONST_RETURN 宏 glib-mainloop：删除不推荐使用的 g_get_current_time() 用法流恢复，设备恢复：避免未对齐的访问互斥锁：修复解锁（）检查文档的错误分配：添加一些贡献者指南更新新闻更新新闻gitignore：为本地前缀安装添加 install/ build-sys：Bump libpulse soversion build-sys：修复几个介子警告 15.0 build-sys 的更新新闻：修复与 gsettings 和配置数据相关的警告 build-sys：修复警告与 avahi 和配置相关的数据Ben Buchwald (1): jackdbus-detect: Passthrough more arguments to sink and source Benjamin Valentin (1): alsa-mixer: 如果 max_dB 为负则禁用 has_dB Carlos Garnacho (3): daemon: 添加“stop”参数start-pulseaudio-x11 脚本守护进程：我nstall start-pulseadio-x11 作为 Xwayland-session.d 脚本守护进程：依赖 systemd 单元文件进行 X11 插件初始化Carmen Bianca Bakker (2)：使用 Weblate (Esperanto) 添加翻译 使用 Weblate (Esperanto) 翻译 Christopher Arndt (1)：将端口顺序元数据添加到 JACK sink / source portsChristopher Snowhill (1): virtual-surround-sink: 使用 FFTW3 而不是天真的方法大卫 (2): 在 module-jack-source.c 中将 jack 大写 在 module-jack-sink 中将 jack 大写。 cDusan Kazik (1)：使用 Weblate 翻译（斯洛伐克语）Edward Lee (9): win32: Handle (WSA)EWOULDBLOCK as EAGAIN。 win32：修复（临时）module-protocol-stub.c 中的esound 路径 win32：检查 pa_is_unix_socket_stale 中的 WSAGetLastError()。 win32：（临时）从 win32 添加 sockaddr_un 定义：在 autoconf 构建中添加对 Unix 套接字的支持。 win32：更改 lt_preloaded_symbols 的链接以匹配 daemon/main.c 中 libtool 中的定义。 win32：修复 Windows 的介子构建系统。 Win32：修复构建问题。 Win32：在 Windows 上使用 WAVEFORMATEX 进行多声道音频输出。Emilio Herrera (1)：使用 Weblate 翻译（西班牙语）Evan Miller（1）：修复严格原型警告Fabian Affolter（1）：使用 Weblate 翻译（德语）Faidon Liambotis (2): 测试: 修复未初始化变量 cpu_info buildsys/autotools 的使用: 添加pulseaudio-x11.service.inFelipe Sateler (3): treewide: 修复一堆错别字不要链接 libpulsecommon 与 GLib 和 GTK 测试：修复 json 测试对于大数字Frédéric Danis (1): core, modules: 删除无用的 EINTR 测试Georg Chini (17): protocol-native: 添加消息发送能力 pactl, pacmd, cli-command: 添加发送消息命令 core: 添加消息处理程序 pactl: 实现list message-handlers message-params：允许参数字符串包含转义的花括号 core-util：添加 pa_atoi64() 和 pa_atou64() 函数 message-params：为各种简单数据类型添加读/写函数 message-params：添加读取函数对于数组消息参数：修复数组读取功能环回：如果源是具有固定延迟接收器的 alsa 源，则修复接收器延迟计算：在取消链接接收器之前取消链接监视器源 null-source：当延迟更改源输出时更改 max_rewind：在移动虚拟源流后修复源输出音量接收器：请求回退 0 字节时不增加水印环回：修复崩溃错误流恢复：修复未初始化变量空接收器的使用：请求不超过来自接收器输入格雷格 V（19）的配置延迟：构建系统： meson：设置 HAVE_DLADDR，即使它在 libc (FreeBSD) 中，而不是 libdl build-sys：meson：当使用 libc iconv 时，告诉 libiconv 头假装是 libc 的 iconv build-sys：meson：检查 shm_open 即使它在 libc 中(FreeBSD)，而不是 librt 构建系统：介子：在 alsa 测试中添加缺失的 pthread 依赖 padsp：修复在 FreeBSD 上的构建（使用与 glibc 相同的 ioctl 签名） raop：在 FreeBSD 构建系统上添加缺失的 netinet 包括：介子：添加 execinfo 依赖对于 FreeBSD 构建系统：介子：支持 m没有 SYS_memfd_create 的 emfd (FreeBSD 13) iochannel：支持在 FreeBSD pulsecore 上传递的凭据：删除古老的 __FreeBSD_version &lt; 600000 代码 util：在没有 procfs 要求的 FreeBSD 上实现 pa_get_binary_name 检测：修复/改进 FreeBSD 支持 oss：不要回退到写入模式FreeBSD oss：支持 24 位示例格式 oss：支持 FreeBSD 上的热拔出 oss：在 FreeBSD 上正确解析设备名称 module-devd-detect：FreeBSD 上声卡热插拔的新模块 atomic-test：在 FreeBSD (cpuset_t) 上 unbreak 构建- sys: meson: only warn about缺乏 udev on LinuxGöran Uddeborg (4): Translated using Weblate (Swedish) Translated using Weblate (Swedish) Translated using Weblate (Swedish) Translated using Weblate (Swedish)Hela Basa (1): 添加翻译使用Weblate（僧伽罗语）Henri Chain（1）：systemd：移动到会话 sliceHui Wang（8）：alsa-mixer：一旦系统有扬声器开关可用，禁用自动静音：切换到耳机或麦克风未知使用 alsa-car d：为 alsa 配置文件添加动态优先级奖励基础 switch-on-port-available：在切换配置文件时检查关闭配置文件 alsa-mixer：将 HDMI/DP 输出设备的最大数量增加到 11 Revert“alsa-mixer：设置”Front “在耳机路径上控制到 0 dB” alsa-mixer：仅使用开关将耳机路径中的 Front 静音 alsa-sink/source：如果 ucm_port 发生变化，则立即将音量设置为 hw Igor V. Kovalenko (88)：pa-info：寻找/usr/sbin 中的 alsa-info.sh 以及 build-sys: meson: 为 OSS 输出支持添加 oss-output 选项 build-sys: meson: use target_machine.cpu_family() for CANONICAL_HOST message-params: 添加读取长度参数参考到数组读取方法 message-params：通过数组读取方法使用包含 {} 的数组 module-alsa-card：处理 udev PULSE_MODARGS build-sys：meson：将 oss-output 布尔值更改为 Meson 功能蓝牙：将最大可渲染块大小与帧大小对齐上下文：添加属性以强制禁用共享内存通道 ladspa-sink：不调用 pa_sink_sus如果 PA_SINK_IS_LINKED 为 false，则挂起 x11：优雅地处理 X11 连接错误 x11：优雅地处理 ICE 连接错误守护程序：修复从构建树数据库运行时的默认 daemon.conf：提取处理机器 ID 和架构数据库的通用方法：使用匹配相同架构的现有数据库前缀数据库：从新创建的数据库文件名数据库中删除 arch：从任何 arch 数据库中选择旧数据库文件：清除对 CANONICAL_HOST 的剩余引用 alsa-mixer：添加对 SteelSeries Arctis 9 buildsys 的支持：autotools：将映射文件移动到 src/pulse buildsys：介子：实现更新映射文件目标映射文件：重新生成蓝牙：使GStreamer线程实时蓝牙：允许增加输出比特率蓝牙：允许增加SBC输出比特率蓝牙：通过output_rate_refresh_interval_ms模块参数蓝牙：a2dp双通道SBC XQ编解码器配置蓝牙：支持增加 SBC XQ 的比特率 build-sys：删除 gconf 支持 build-sys：meso n：添加 tcp-wrappers build-sys：meson：支持 elogind 替代 module-systemd-login 蓝牙：从 bluez 回退代码中删除不需要的更改 蓝牙：启用 module-bluez5-discover 参数 enable_native_hfp_hf 蓝牙：修复耳机 = 自动 ofono 切换蓝牙：更喜欢耳机 HFP HF 与本机后端蓝牙的连接：完整的蓝牙配置文件分离蓝牙：使用设备标志来防止关机期间断言失败蓝牙：将 enable_hs_role 重命名为 enable_shared_profiles 蓝牙：清理 rfcomm_write 使用蓝牙：修复错字检查目标编解码器是否可用蓝牙：正确rfcomm 命令和回复格式 build-sys: drop autotools build system build-sys: meson: fix meson dist version bluetooth: 接受 +VGM/+VGS 不请自来的回复与&#39;=&#39; 和 &#39;:&#39; 分隔符 json: 改进支持的数字 json: add JSON 编码器消息参数：使用 JSON 而不是自定义格式消息参数：清理蓝牙：更新消息传递 API 参考蓝牙：prio ritize 原生后端 HFP HF 连接蓝牙：统一编码器代码路径 bluetooth：统一解码器代码路径 bluetooth：添加 CVSD 编解码器实现 bluetooth：根据读取数据包大小应用写入 MTU 检测 bluetooth：使用 helper 设置多个传输对象属性 bluetooth：mSBC：忽略全零数据包蓝牙：mSBC：忽略空编码帧蓝牙：准备重做传输写出调度蓝牙：将 mSBC 添加到后端-ofono 蓝牙：显示协商的 HFP 编解码器蓝牙：记住......", "note_en": "PulseAudio now supports the LDAC and AptX codecs for A2DP. In order to use them, the device has to support the codecs too. Also &#34;XQ&#34; configuration variants for the old SBC codec are available. The SBC XQ variants have a fixed (and higher than the &#34;normal&#34; SBC) bitrate, so they may have more drop-outs if the wireless connection is bad, but on the other hand the quality is always good if the connection is good. For variable bitrate, pulseaudio is now able to increase the bitrate again after it was reduced due to connectivity issues.\n Switching the codec can be done on the command line with  pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez switch-codec CODEC. Replace  XX_XX_XX_XX_XX_XX with the device address, which can be found for example with  LANG=C pactl list cards | grep Name. Replace  CODEC with one of the available codec names:  aptx,  aptx_hd,  ldac_hq (&#34;High Quality&#34;),  ldac_sq (&#34;Standard Quality&#34;),  ldac_mq (&#34;Mobile Quality&#34;),  sbc,  sbc_xq_453,  sbc_xq_512,  sbc_xq_552. A list of codecs supported by the device can be obtained with  pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez list-codecs and the currently active codec can be queried with  pactl send-message /card/bluez_card.XX_XX_XX_XX_XX_XX/bluez get-codec. A simplified way of switching codecs is already implemented in pavucontrol and will be provided with the next pavucontrol release.\n  Native support for HFP AG role has been added. The native backend has become the default backend for HSP/HFP. Support for ofono is still available when setting the backend parameter to  auto or  ofono. The native backend currently only implements the HFP AG role, but not the HFP HS role, therefore ofono is still required for this role. Additionally, support for mSBC has been implemented to improve voice quality.\n  AVRCP Absolute Volume allows PulseAudio to control the volume of the connected A2DP device (when playing to it) or for a connected device to control volume in PulseAudio (when the device plays to PulseAudio). Previously when playing to e.g. a headset, PulseAudio did its own volume control in software, and the headset did its own volume in hardware. Having two levels of volumes sometimes made it difficult to get high enough volume, now there&#39;s only one level of volume control.\n This feature can be disabled by passing  avrcp_absolute_volume=false to module-bluetooth-discover in the  default.pa configuration file.\n  The code that loads the ALSA path configuration files now checks if the files exist in the directories specified with the  XDG_DATA_HOME or  XDG_DATA_DIRS environment variables (under  pulseaudio/alsa-mixer/paths subdirectory). Those environment variables are defined by the  XDG Base Directory Spec, and even if those environment variables aren&#39;t set, the XDG Base Directory Spec defines default locations that PulseAudio uses. In particular, in the usual case where  XDG_DATA_HOME isn&#39;t set, the default value is  $HOME/.local/share, so PulseAudio will look for path configuration files from that directory under the user&#39;s home. This is useful when it&#39;s necessary to customize the path configuration files. Previously the files in  /usr/share/pulseaudio/alsa-mixer/paths had to be modified, and the modifications were lost whenever upgrading PulseAudio.\n  The convolution processing code has been rewritten to use a blocked FFT function, supporting potentially much larger impulse responses. Existing impulses will continue to function with the rewrite. The filter optionally supports asymmetrical responses, which may be enabled by specifying two sets of impulse files, using the  hrir_left and  hrir_right options instead of the original  hrir option. Impulses should be matching format and channel layouts. The channel layout of the actual audio input for processing may be specified using the  channel_map setting, so long as all specified channels are present in one or both impulses.\n  module-jackdbus-detect automatically loads a JACK sink and source when JACK starts. It&#39;s now possible to better configure the parameters of the sink and source. module-jackdbus-detect accepts these new arguments:\n sink_client_name - The name that the JACK sink uses when it registers a client with JACK\n source_client_name - The name that the JACK source uses when it registers a client with JACK\n   The same custom configuration that is used with several other USB gaming headsets is now applied to SteelSeries Arctis 9, which makes the device much more functional.\n  HP Thunderbolt Dock 120W G2 has a 3.5 mm headset connector, and there&#39;s a separate audio module sold for the dock that provides speakerphone functionality (integrated microphone and speaker with echo cancellation). PulseAudio now has configuration that improves the device descriptions shown to the user and marks the speakerphone as a preferred device for voice audio.\n  Behringer U-Phoria UMC22 has two mono microphone inputs, which show up as a single stereo device in ALSA. PulseAudio now has custom configuration for this sound card, allowing the user to select a profile that enables only one or the other of the channels. That way recording applications don&#39;t end up recording a stereo track that has audio only on one channel.\n  OnePlus Type-C Bullets is a simple USB-C headset device. It works with the default configuration too, but custom configuration was added to hide card profiles that don&#39;t make sense (for example, HDMI showed up as a supported profile with the default configuration).\n  Sennheiser GSX 1000 and 1200 PRO are USB DACs designed for gaming. They have a separate mono output for voice audio, and they also provide a virtual surround device that downmixes 7.1 surround audio to headphones in hardware. Custom configuration was added to expose these devices properly.\n  It&#39;s now possible to set module-alsa-card module arguments via udev configuration by using the PULSE_MODARGS variable. This allows for example setting  tsched=false for a particular sound card that has trouble with the timer-based scheduling. Previously the options were to pass the tsched option to module-udev-detect in default.pa, causing all sound cards to be affected, or to give up automatic sound card detection and hotplug support altogether and configure each sound card manually in default.pa.\n  It&#39;s now possible to configure the upper limit for latency of module-null-source with the  max_latency_msec module argument.\n  module-filter-apply automatically loads a filter module when a stream wants to be filtered (i.e. has the  filter.want property). Previously additional filter module arguments could be provided by the stream in the  filter.apply.&lt;filter&gt;.paramaters property, now it&#39;s possible to set  filter.apply.&lt;filter&gt;.parameters also in the hardware sink/source properties, so a stream can simply request a filter without specifying the parameters, and the hardware device can set the (possibly hardware specific) parameters.\n  The original expectation was that there wouldn&#39;t be need for loading module-match multiple times, so it was marked as a module that isn&#39;t meant to (and can&#39;t) be loaded multiple times. However, it turned out to be useful to match against different properties with different configuration files, so the module can now be loaded multiple times.\n  Several patches from FreeBSD have been upstreamed. Unplugging sound cards should behave better now, devices have better descriptions, hotplugging devices is now supported with module-devd-detect.\n  PulseAudio&#39;s Meson build system was lagging behind the old Autotools build system when it came to building for Windows, now it should be possible to build PulseAudio for Windows with Meson using MinGW. There are also various fixes for Windows and PA can now be run as a service on Win32.\n    Card profiles can be set to sticky using the command  pactl send-message /card/&lt;card name&gt; set-profile-sticky &#39;true|false&#39;. The current status can be queried using  pactl send-message /card/&lt;card name&gt; get-profile-sticky. If a card profile is sticky, it will always be restored, even if the profile is unavailable. Also port availability changes on the card will not impact the profile choice. This is for example useful to set the card profile permanently to &#34;off&#34; for HDMI devices. Setting profiles to sticky is already implemented in pavucontrol and will be provided with the next pavucontrol release.\n   The new &#34;message API&#34; was added to facilitate easy communication between clients and pulseaudio objects. It&#39;s currently used for switching bluetooth codecs and setting card profiles to sticky. The message API is using JSON format to exchange information between pulseaudio objects and a client.\n  If an application wants last bits of virtual memory, it can forcefully disable shared memory communication channels by setting the  PA_PROP_CONTEXT_FORCE_DISABLE_SHM boolean proplist value on the  pa_context object when connecting. The primary user would be Wine 32bit with 2Gb vmem limit.\n   As already announced in the 14.0 release notes, the support for autotools finally has been dropped. The meson build system has been improved significantly and is now the standard way to build pulseaudio.\n  PulseAudio&#39;s startup script (default.pa for the normal per-user mode and system.pa for the system mode) defines the set of modules to load automatically on startup. At the end of the scripts there is now an include directive that loads files from  /etc/pulse/default.pa.d/ or  /etc/pulse/system.pa.d/. This is primarily meant for distributions when they want to add some module to the configuration when installing a package: it&#39;s now easy to install a file containing the configuration for the installed package. Users can of course use this mechanism too if they prefer to add a module to the configuration without modifying the original startup script.\n  When PipeWire is used to replace PulseAudio, libpulse and PulseAudio utilities are still useful but the PulseAudio daemon is not needed. It&#39;s now possible to compile libpulse and the utilities without compiling the daemon. To do this, pass  -Ddaemon=false to Meson.\n  PulseAudio traditionally loads a few X11 modules automatically on a graphical login via the  /etc/xdg/autostart/pulseaudio.desktop file. That&#39;s not really desirable on Wayland, because that will autostart XWayland even if it&#39;s not otherwise used. The  pulseaudio.desktop file now contains the line  X-GNOME-HiddenUnderSystemd=true, so when using GNOME and systemd the X11 modules aren&#39;t loaded this way any more. If GNOME is run under X11, there&#39;s a new systemd service called  pulseaudio-x11 that handles loading the X11 modules.\n This behaviour is not available on other desktop environments than GNOME, but now that it&#39;s implemented once, it should be pretty easy to develop a similar solution for other desktop environments as well.\n  The  oss-output Meson option can be used to explicitly enable or disable OSS support (previously, when using Meson instead of Autotools, OSS support was automatically enabled when the  sys/soundcard.h header was found).\n  The  valgrind Meson option can be used to explicitly enable or disable Valgrind support (previously Valgrind support was automatically enabled when the  valgrind/memcheck.h header was found).\n  Alexey Rubtsov (1): Translated using Weblate (Russian)Alper Nebi Yasak (1): alsa-ucm: Log about the correct path value when probing volumesAnders Jonsson (1): Translated using Weblate (Swedish)Arun Raghavan (13): proplist-util: Drop deprecated G_CONST_RETURN macro glib-mainloop: Drop deprecated g_get_current_time() usage stream-restore,device-restore: Avoid unaligned access mutex-posix: Fix error assignment for unlock() check doc: Add some contributor guidelines Update NEWS Update NEWS gitignore: Add install/ for local prefixed installs build-sys: Bump libpulse soversion build-sys: Fix a couple of meson warnings Update NEWS for 15.0 build-sys: Fix a warning related to gsettings and config data build-sys: Fix a warning related to avahi and config dataBen Buchwald (1): jackdbus-detect: Passthrough more arguments to sink and sourceBenjamin Valentin (1): alsa-mixer: disable has_dB if max_dB is negativeCarlos Garnacho (3): daemon: Add &#34;stop&#34; argument to start-pulseaudio-x11 script daemon: Install start-pulseadio-x11 as a Xwayland-session.d script daemon: Rely on systemd unit file for X11 plugin initializationCarmen Bianca Bakker (2): Added translation using Weblate (Esperanto) Translated using Weblate (Esperanto)Christopher Arndt (1): Add port order metadata to JACK sink / source portsChristopher Snowhill (1): virtual-surround-sink: Use FFTW3 instead of naive approachDavid (2): Capitalize jack in module-jack-source.c Capitalize jack in module-jack-sink.cDusan Kazik (1): Translated using Weblate (Slovak)Edward Lee (9): win32: Handle (WSA)EWOULDBLOCK as EAGAIN. win32: Fix (interim) esound paths in module-protocol-stub.c win32: Check WSAGetLastError() in pa_is_unix_socket_stale. win32: (Temporarily) Add sockaddr_un definition from  win32: Add support for Unix sockets in autoconf build. win32: Change linkage of lt_preloaded_symbols to match definition in libtool in daemon/main.c. win32: Fix meson build system for Windows. Win32: Fix build issues. Win32: Use WAVEFORMATEX for multi-channel audio output on Windows.Emilio Herrera (1): Translated using Weblate (Spanish)Evan Miller (1): Fix a strict-prototypes warningFabian Affolter (1): Translated using Weblate (German)Faidon Liambotis (2): tests: fix use of uninitialized variable cpu_info buildsys/autotools: add pulseaudio-x11.service.inFelipe Sateler (3): treewide: fix a bunch of typos Don&#39;t link libpulsecommon with GLib and GTK tests: fix json test for large numbersFrédéric Danis (1): core, modules: Remove useless EINTR testsGeorg Chini (17): protocol-native: add message sending capability pactl, pacmd, cli-command: Add send-message command core: add message handler pactl: Implement list message-handlers message-params: Allow parameter strings to contain escaped curly braces core-util: Add pa_atoi64() and pa_atou64() functions message-params: Add read/write functions for various simple data types message-params: Add read functions for arrays message-params: Fix array reading functions loopback: Fix sink latency calculation if source is alsa source with fixed latency sink: Unlink monitor source before unlinking sink null-source: Change max_rewind when the latency changes source-output: Fix source-output volume after move of virtual source stream alsa-sink: Do not increase watermark when requested to rewind 0 bytes loopback: Fix crash bug stream-restore: Fix use of uninitialized variable null-sink: Request no more than the configured latency from sink-inputGreg V (19): build-sys: meson: set HAVE_DLADDR even if it&#39;s in libc (FreeBSD), not libdl build-sys: meson: when libc iconv is used, tell libiconv header to pretend to be libc&#39;s iconv build-sys: meson: check for shm_open even if it&#39;s in libc (FreeBSD), not librt build-sys: meson: add missing pthread dependency on alsa tests padsp: fix build on FreeBSD (use same ioctl signature as glibc) raop: add missing netinet include on FreeBSD build-sys: meson: add execinfo dependency for FreeBSD build-sys: meson: support memfd without SYS_memfd_create (FreeBSD 13) iochannel: support credentials passing on FreeBSD pulsecore: remove ancient __FreeBSD_version &lt; 600000 code util: implement pa_get_binary_name on FreeBSD without procfs requirement detect: fix/improve FreeBSD support oss: do not fall back to write() mode on FreeBSD oss: support 24-bit sample formats oss: support hot-unplug on FreeBSD oss: parse device names correctly on FreeBSD module-devd-detect: new module for soundcard hotplug on FreeBSD atomic-test: unbreak on FreeBSD (cpuset_t) build-sys: meson: only warn about lack of udev on LinuxGöran Uddeborg (4): Translated using Weblate (Swedish) Translated using Weblate (Swedish) Translated using Weblate (Swedish) Translated using Weblate (Swedish)Hela Basa (1): Added translation using Weblate (Sinhala)Henri Chain (1): systemd: move to session sliceHui Wang (8): alsa-mixer: disable the Auto-Mute once the system has speaker switch-on-port-available: Switch to headset or mic on unknown avail alsa-card: add dynamic priority bonus base for alsa profiles switch-on-port-available: checking the off profile when switching profile alsa-mixer: increase the max number of HDMI/DP output device to 11 Revert &#34;alsa-mixer: Set &#34;Front&#34; control to 0 dB on headphone path&#34; alsa-mixer: only use switch to mute Front in the Headphone path alsa-sink/source: set volume to hw immediately if ucm_port changingIgor V. Kovalenko (88): pa-info: look for alsa-info.sh in /usr/sbin as well build-sys: meson: add oss-output option for OSS output support build-sys: meson: use target_machine.cpu_family() for CANONICAL_HOST message-params: add read length param reference to array read methods message-params: consume array enclosing {} by array read methods module-alsa-card: handle udev PULSE_MODARGS build-sys: meson: change oss-output boolean to Meson feature bluetooth: align max renderable block size to frame size context: add property to forcefully disable shared memory channels ladspa-sink: do not call pa_sink_suspend if PA_SINK_IS_LINKED is false x11: gracefully handle X11 connection error x11: gracefully handle ICE connection error daemon: fix default daemon.conf when running from build tree database: extract common method to handle machine id and architecture database: use existing database matching same architecture prefix database: drop arch from newly created database file name database: pick old database file from any arch database: clean up remaining references to CANONICAL_HOST alsa-mixer: add support for SteelSeries Arctis 9 buildsys: autotools: move map-file to src/pulse buildsys: meson: implement update-map-file target map-file: regenerate bluetooth: Make GStreamer threads realtime bluetooth: allow increasing output bitrate bluetooth: allow increasing SBC output bitrate bluetooth: pass output_rate_refresh_interval_ms module parameter bluetooth: a2dp dual channel SBC XQ codec configurations bluetooth: support increasing bitrate for SBC XQ build-sys: drop gconf support build-sys: meson: add tcp-wrappers build-sys: meson: support elogind alternative for module-systemd-login bluetooth: remove unwanted change from bluez fallback code bluetooth: enable module-bluez5-discover argument enable_native_hfp_hf bluetooth: fix headset=auto ofono handover bluetooth: prefer headset HFP HF connection with native backend bluetooth: complete bluetooth profile separation bluetooth: use device flag to prevent assertion failure during shutdown bluetooth: rename enable_hs_role to enable_shared_profiles bluetooth: clean up rfcomm_write usage bluetooth: fix typo checking if target codec is available bluetooth: correct rfcomm command and reply formatting build-sys: drop autotools build system build-sys: meson: fix meson dist version bluetooth: accept +VGM/+VGS unsolicited reply with &#39;=&#39; and &#39;:&#39; separator json: improve supported numbers json: add JSON encoder message-params: use JSON instead of custom format message-params: clean up bluetooth: update messaging api reference bluetooth: prioritize native backend HFP HF connection bluetooth: unify encoder code paths bluetooth: unify decoder code paths bluetooth: add CVSD codec implementation bluetooth: apply write MTU detection based on read packet size bluetooth: use helper to set multiple transport object attributes bluetooth: mSBC: ignore all-zero packets bluetooth: mSBC: ignore empty encoded frame bluetooth: prepare to redo transport writeout scheduling bluetooth: add mSBC to backend-ofono bluetooth: show negotiated HFP codec bluetooth: rememb\n......", "posttime": "2021-07-30 00:40:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发行,release", "title": "PulseAudio 15.0 发行说明", "title_en": "PulseAudio 15.0 Release Notes", "transed": 1, "url": "https://www.freedesktop.org/wiki/Software/PulseAudio/Notes/15.0/", "via": "", "real_tags": ["发行", "release"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，LeDanté Walker 留出了他能找到的一点点额外现金，所以无论他的健康保险有什么问题，他的看护人总是得到照顾。沃克 (Walker) 在 1997 年的一次事故中被从汽车后座上弹射而导致脊髓损伤，他的许多日常功能都依赖家庭护理人员，从每天早上从床上移动到轮椅，帮他洗澡，穿好衣服，去洗手间，准备饭菜。但今年早些时候，在他的看护人的薪水比她欠她的工资少了 900 美元之后，沃克突然不得不比以往任何时候都更深入地投入到他的应急基金中。沃克把他省下的每一分钱都给了她，宁愿自掏腰包来维持他的工人提供的自由和稳定，也不愿眼睁睁地看着她陷入财务困境。 “我想独立，”他说。 “这是我的权利。”工资缺失是由一种称为电子访问验证 (EVV) 的新数字工具存在缺陷造成的，EVV 是一款下载到家庭护理人员智能手机上的应用程序，可跟踪他们的日常工作量、实际位置和工作时间。科技公司和立法者承诺，EVV 将提高家庭护理的效率和问责制，并将减少政府资助项目中的欺诈、浪费和滥用。但该工具对阿肯色州的许多人来说是一场灾难，比如沃克，以及全国其他数千人。倡导团体和残疾人从一开始就警告说，EVV 系统会侵蚀客户的自主权，使家庭护理更加困难，并威胁残疾人权利和独立生活运动的进展。这些分歧的核心是客户和工人——通常是有色人种或移民的女性——他们觉得自己好像一直受到监视和怀疑。\n奥巴马政府通过了一项立法，要求实施 EVV 来管理由 Medicaid 支付的所有家庭个人护理服务，该计划旨在帮助美国的贫困和工薪家庭支付医疗费用。 4 月 1 日，在联邦实施或失去部分医疗补助资金的最后期限内，阿肯色州为像沃克这样的自主客户推出了 EVV，这些客户直接管理他们的护理人员，而不是通过家庭医疗保健机构。大多数其他州目前也在推出 EVV 系统。据沃克和阿肯色州的其他数十名项目参与者说，实施是一场灾难。直到 EVV 推出四天前，沃克才收到该州数字化转型的正式通知。他打电话给他的支持协调员发短信，但她没有接听。他最终被引导到 YouTube 上针对家庭医疗保健机构的培训视频，而不是像他这样的自主客户。它没有回答他的问题。沃克花了数百美元为他的家庭护理人员购买了一部额外的手机，他要求在这个故事中不透露姓名。她下载了该州名为 AuthentiCare 的 EVV 应用程序，并开始使用它。但它经常出现故障。她 4 月 13 日至 26 日的时间表因“资金不足”而被拒绝，这对沃克来说毫无意义，沃克仔细协调了工人的日程安排与州允许的护理时间。两周的工作让她损失了 900 美元。沃克的现金帮助她把杂货放在冰箱里，让家里的灯亮着，但不会持续太久。他调整好自己的面罩，将齐腰的长发绺从脸上推开。 “我会没事的，因为我和我的看护人制定了一个系统，”他说。但是有超过 2,000 人像他一样通过 ARchoices 获得自主服务，这是一项旨在帮助阿肯色州残疾人和老年人在家中获得医疗补助资助的护理的豁免计划。他知道他们中很少有人有资源来支付家庭护理人员的薪水。 “我们已经在一起 10 多年了，”沃克说。 “如果我们是新来的，她就会离开。”阿肯色州的护理危机尤为严重。这里的工资是出了名的低：十年后，沃克的看护人的时薪仍仅为 12.08 美元，仅略高于阿肯色州 11 美元的最低工资。阿肯色州的家庭护理成本比全国平均水平低 17%，部分原因是工资低和人员流动率高。沃克知道，如果为阿肯色州的自主客户提供财务管理服务的承包商 Palco 不定期支付员工工资，她可能会通过代理机构在别处找到工作，或者干脆离开这个行业。\n在 6 月 18 日的联合声明中，Palco 和阿肯色州国土安全部承认：“当我们在 4 月 1 日为自主客户启用 EVV 系统时，出现的问题比我们预期的要多。”但自我导向的客户和他们的倡导者一直警告说，这种推广会失败多年。他们说，国家及其承包商只是不听。早在 2019 年 4 月，Spa Area Independent Living Services 的执行董事 Brenda Stinebuck 就担心该系统将是一场灾难。阿肯色州在试点测试中不包括自我指导的客户或住家护理人员。 DHS 与她的办公室没有关于 EVV 的沟通。 “指导自己护理的能力越来越难，”她当时说。转向 EVV 也使家庭和住家看护人的工作变得更加困难。 60 岁的 Nancy Morell 每天凌晨 4 点起床，给她的姐姐 Carolyn 送咖啡，给她洗澡，擦干头发，给她穿衣服。她让她在客厅里看电视，宽阔的窗户可以俯瞰尤里卡斯普林斯外的欧扎克山脉。患有脑瘫的卡罗琳无法说话或移动，但他们找到了其他交流方式。莫雷尔是一位金发及肩的苗条女性，她是一个天生的计划者，优雅而专注地管理着复杂的多代家庭。她帮卡罗琳购物和洗衣服，准备她的饭菜，把她带到浴室，在豆袋、躺椅和沙发之间转移她以保持她的舒适。天气好的时候，她带她到后廊，他们一起看蜂鸟喂食器。她修剪 Carolyn 的指甲，涂上除臭剂和乳液，并在晚上 8 点左右照顾她姐姐睡觉前出现的任何其他个人需求——她与她 85 岁的母亲同住一个房间。莫雷尔每周 7 天、每天 16 小时都在照顾卡罗琳——如果晚上有紧急情况，她总是有空。 “她 24/7 和我在一起。我没有加班，”莫雷尔说。即便如此，阿肯色州人类服务部 (DHS) 已经确定 Carolyn 的需求可以通过每天 8 小时的护理来满足，因此莫雷尔每周的税后收入约为 550 美元。\n在 EVV 推出之前，Morell 参加了 Palco 提供的仅有的两次培训之一。她下载了 43 页的手册。她看了YouTube视频。尽管付出了很多努力，莫雷尔还是有两周无法访问系统。当她最终成功时，她的薪水晚了三个星期。她登录网站查看延迟的原因，并看到系统已对她的所有 16 个班次进行了红色标记。为姐姐打工的13年里，她只经历过两班被Palco警告过的问题，很快就解决了问题。现在，像沃克一样，她无法通过电话联系支持协调员。但对莫雷尔来说，真正的问题是 EVV 的不灵活给本已要求很高的工作增加了新的、看似随意的责任。 Morell 每天必须按固定时间进出应用程序四次，即使 Carolyn 在需要时得到护理，而不是在预定时间。她在手机上设置闹钟，害怕因为她正在准备饭菜或帮助 Carolyn 去洗手间而错过打卡时间。她的母亲是 Carolyn 的法定代表人，每天结束时都必须在应用程序上签名。为 EVV 铺平道路的 2016 年联邦法律——《21 世纪治愈法案》——要求系统“负担最小”。但阿肯色州和许多其他州一样，似乎已经实施了一种负担沉重的方法。正如莫雷尔在 6 月 11 日给阿肯色州国土安全部的一封信中写道：“签署时间表并提交给 Palco 总共需要 15 秒的时间——现在需要很多小时；应该给予客户照顾的时间。” EVV 供应商承诺，他们的解决方案将通过减少他们声称普遍存在的欺诈和浪费来为各州节省资金。 2016 年的一份联邦报告声称，在全国范围内使用 EVV 最终将在十年内节省 2.9 亿美元的成本，部分原因是减少不当计费。但在实践中，几乎没有证据表明欺诈是普遍存在或严重的。根据总部位于波士顿的咨询公司 Applied Self-Direction 收集的数据，2020 年阿肯色州的 4,500 多名员工中，只有 7 人被指控在自我指导的个人护理服务中存在欺诈行为。该州确定了三项定罪，总共追回了 1,930 美元——每起案件 643 美元。到目前为止，EVV 系统已花费该州 570 万美元。\n最近通过公共记录请求获得的对阿肯色州国土安全部的投诉说明了普遍延迟付款的改变生活的后果。国土安全部就该机构从一名家庭护理员那里收到的语音邮件做了以下说明：“她说她不能买杂货，她的公用事业被关闭，她有驱逐通知。” Palco 和阿肯色州国土安全部在他们的声明中说：“EVV 系统正在运行，护理人员正在获得报酬。提交索赔的错误率非常低——只有 2%。”由于 Palco 每两周处理大约 25,000 项索赔，因此 2% 的错误率会影响每个支付周期的 500 名护理人员的生活。对于低工资的工人来说，一次错过的薪水很快就会带来灾难。阿肯色州法律援助的律师特雷弗·霍金斯 (Trevor Hawkins) 在一封电子邮件中说：“直到今天，仍有受益人试图让他们的看护人退还到 4 月初。” “在解决漏洞的过程中，没有提供任何便利来覆盖它们。”对于一些人来说，新系统感觉就像被软禁。 EVV 应用程序结合了 GPS 来验证家庭护理人员的位置和称为“地理围栏”的功能。它在客户家周围建立了最大距离，允许护理人员在其中打卡或下班，而不会被标记为不合规。 46 岁的梅丽莎·哈维尔站在她位于小石城以北约 40 英里的格林布赖尔乡村的前廊附近，说：“下面的金属建筑，我们知道我们可以走那么远。” “然后到车道的尽头。” Harville 使用 EVV 应用程序来绘制出允许她离开家多远而不会触发“未经授权的位置”警报的情况，该警报必须由她的机构解决才能获得报酬。五月，哈维尔和她 57 岁的搭档凯文胡佛坐在他们简单的木屋外面，蜜蜂在初夏的阳光下大声嗡嗡作响。她指出了这对夫妇所描述的人类隐形狗围栏的界限。 “这就像住在一个盒子里，”她说。在她工作的家庭护理机构于 2020 年 11 月开始使用 AuthentiCare 应用程序之前，她和自 2009 年失去双腿功能以来一直使用手动轮椅的胡佛一直在旅途中。她可以带他去治疗、买菜、见朋友。 “而现在我们不能。你必须在家里打卡和打卡，”哈维尔说。\n倡导者说，使用 GPS 来验证家庭护理人员的位置背后的意图可能是为了让工作人员负责并确保客户安全，但其含义是数字边界破坏了独立生活背后的理念。六十年来，残疾活动家一直主张对自己的生活拥有自主权，以及在更广泛的社区内生活、工作和接受服务的能力。 EVV 中的地理围栏建立在一个与此相矛盾的前提上：它假设像 Kevin Hoover 这样喜欢钓鱼、开汽车和与朋友一起玩音乐的人都宅在家里，而不是过着积极而充满活力的生活。该州和 Palco 表示，联邦法律要求他们记录提供服务的位置，并且护理人员和机构认为错误的例外通知只是“信息地理围栏消息”，“并不意味着在家外的时间不会付钱。”但全国独立生活委员会在 2020 年对 36 个州的家庭护理接受者及其护理提供者进行了一项调查，发现三分之一的受访者表示，由于恐惧，他们“比使用 EVV 之前更频繁地呆在家里地理围栏限制会将访问标记为欺诈或导致提供者工资的延迟或损失。”更重要的是，因为在提供护理服务时，工人和客户往往就在附近，“EVV 正在无意中跟踪护理的接受者，”草根运动停止 EVV 的政策主管肯德拉·斯卡利亚 (Kendra Scalia) 说。数字健康博客 The Mighty 的残疾编辑卡琳·威利森 (Karin Willison) 认为，“电子访问验证相当于在残疾人身上安装脚踝监视器，并告诉我们我们可以去哪里，不能去哪里。” EVV 的推出讲述了一个更广泛的关于错位的优先事项的故事。州医疗补助计划面临着通过限制资格、削减福利和压低工人工资来弥补预算赤字的长期压力。\n在这种环境下，承诺节省成本的技术解决方案似乎很有吸引力。但是 EVV 的人力成本，无论是财务上的还是个人的，都可能超过任何效率收益。美国劳工统计局预计，家庭健康和个人护理助理将成为未来几年增长最快的职业之一。但除了低工资外，这些工作通常没有标准的工作场所福利，如健康保险、带薪病假、假期或残疾保险。这导致长期劳动力短缺，如果护理人员因工资延迟和数字监控而被迫放弃该职业，这种情况只会恶化。 “停下来，”在尤里卡斯普林斯照顾妹妹的南希莫雷尔说。 “你手机上的那个应用程序？它并不像纸质时间表那样保证工作正在完成。回到以前的样子。这将吸引人们重新回到他们报名的工作中。这项工作需要用心做人。我们不值得这样。”从一开始，残障人士和劳工倡导者就一直在表达他们的担忧，就设计不那么繁重和侵入性的系统的方法提供意见。在加利福尼亚州，工会联合家政工人和加州残疾人权利协会与客户、工人和州官员合作设计了一个内部门户网站，该门户网站不收集 GPS 数据或要求工人实时记录他们的工作时间。但是，联邦政府表示该系统不合规，并指出仅基于网络的时间表不能对提交的数据提供可审计的确认。但联邦授权并非一成不变。弗吉尼亚州选择完全免除住家护理人员的 EVV 要求。地理围栏也是可选的。对 LeDanté Walker 来说，不与受影响社区进行协商就像是一种蔑视。 “他们需要听取残疾人的意见，”他说。 “问。这。人们。”", "note_en": "For years, LeDanté Walker set aside what little extra cash he could find so no matter the issue with his health insurance coverage, his caregiver was always taken care of.\n Walker, who sustained a spinal cord injury when he was ejected from the back seat of a car in a 1997 accident, relies on a home care worker for many day-to-day functions, from moving from his bed to his wheelchair every morning, to helping him shower, get dressed, go to the bathroom and prepare meals.\n  But earlier this year, Walker abruptly had to dip deeper into his rainy day fund than ever before, after his caregiver’s paychecks fell $900 short of what she was owed. Walker offered her every spare dime he had saved, preferring to pay out-of-pocket to maintain the freedom and stability his worker provided than see her left in a financial lurch.\n “I want to be independent,” he says. “That’s my right.”\n  The missing wages were caused by flaws in a new digital tool called electronic visit verification (EVV), an app downloaded to a home care worker’s smartphone that tracks their daily work output, physical location and hours.\n Tech companies and lawmakers promise that EVV will increase efficiency and accountability in home care and will reduce fraud, waste and abuse in government-funded programs. But the tool has been a catastrophe for many in Arkansas, like Walker, and thousands of others across the nation. Advocacy groups and people with disabilities warned from the start that EVV systems would erode clients’ autonomy, make home care more difficult and threaten the progress of the disability rights and independent living movements.\n At the heart of these disagreements are clients and workers – often women of color or immigrants – who feel as if they are constantly surveilled and under suspicion.\n The Obama administration passed legislation requiring that EVV be implemented to manage all in-home personal care services paid for by Medicaid, the program that helps poor and working families in the US with healthcare costs. And on 1 April, under a federal deadline to implement or lose a percentage of its Medicaid funding, Arkansas rolled out EVV for self-directed clients like Walker who manage their care workers directly rather than go through a home healthcare agency. Most other states are also currently unveiling EVV systems.\n According to Walker and dozens of other program participants in Arkansas, the implementation has been a disaster. Walker didn’t get official notification of the state’s digital transformation until four days before the EVV rollout. He called and texted his support coordinator, but she wasn’t answering. He was eventually guided to a training video on YouTube aimed at home healthcare agencies, not self-directed clients like him. It didn’t answer his questions.\n Walker spent hundreds of dollars to purchase an extra cell phone for his home care worker, who asked not to be named in this story. She downloaded the state’s EVV app, called AuthentiCare, and began to use it. But it was frequently glitchy. Her 13-26 April timesheet was denied for “insufficient funds,” which made no sense to Walker, who carefully reconciles his worker’s schedule with the care hours the state allows him.\n She was out $900 for two weeks’ work. Walker’s cash helped her keep groceries in the fridge and the lights on in her house, but it wouldn’t last long.\n  He adjusts his mask and pushes his waist-length dreadlocks out of his face. “I’ll be okay, because I worked out a system with my caregiver,” he says. But there are more than 2,000 people like him who receive self-directed services through ARChoices, a waiver program intended to help disabled and older Arkansans receive Medicaid-funded care in their own homes. He knows that few of them have the resources to underwrite their home care workers’ paychecks.\n “We’ve been together 10-plus years,” Walker says. “If we were new, she’d be gone.”\n  The care crisis is especially acute in Arkansas. Pay here is notoriously low: after a decade, Walker’s caregiver still makes just  $12.08 an hour, barely more than Arkansas’ $11 minimum wage. The cost of in-home care in Arkansas is 17% lower than the national average, in part because of low pay and high turnover. If Palco, the contractor that provides financial management services for self-directed clients in Arkansas, doesn’t pay his worker regularly, Walker knows, she might find work elsewhere through an agency or leave the industry altogether.\n In a 18 June joint statement, Palco and Arkansas DHS conceded: “When we went live April 1 with the EVV system for self-direction clients, there were more issues than we anticipated.”\n But self-directed clients and their advocates have been warning that the roll-out would fail for years. The state and its contractor, they say, were just not listening.\n As far back as April 2019, Brenda Stinebuck, the executive director of Spa Area Independent Living Services, worried that the system would be a catastrophe. Arkansas did not include self-directed clients or live-in caregivers in pilot testing. DHS had no communication about EVV with her office. “The ability to direct your own care is getting harder and harder and harder,” she said at the time.\n  The move to EVV has also made the jobs of family and live-in caregivers more difficult.\n Nancy Morell, 60, rises at 4am every day to bring her older sister Carolyn her coffee, bathe her, dry her hair and dress her. She sets her up to watch TV in the living room, with its broad windows overlooking the Ozark mountains outside Eureka Springs. Carolyn, who has cerebral palsy, can’t talk or move much, but they’ve found other ways to communicate.\n Morell, a slender woman with shoulder-length blonde hair, is a natural planner, running a complicated multigenerational household with grace and focus. She does Carolyn’s shopping and laundry, prepares her meals, carries her to the bathroom and shifts her between a beanbag, recliner and sofa to keep her comfortable. In good weather, she takes her to the back porch and they watch the hummingbird feeders together. She trims Carolyn’s nails, puts on her deodorant and lotion, and takes care of any other personal needs that come up before her sister goes to bed – she shares a room with her 85-year-old mother– at about 8pm.\n Morell attends Carolyn 16 hours a day, seven days a week – and she’s always available if there is an emergency in the night. “She’s with me 24/7. I don’t get overtime,” Morell said. Even so, the Arkansas department of human services (DHS) has determined that Carolyn’s needs can be met with 8 hours of care a day, so Morell   is paid about $550 a week after taxes.\n Before the EVV rollout, Morell attended one of only two trainings offered by Palco. She downloaded the 43-page manual. She watched the YouTube video.\n  Despite all her efforts, Morell couldn’t access the system for two weeks. When she finally succeeded, her paycheck was three weeks late. She logged on to the website to find out why it was delayed, and saw the system had red-flagged all 16 of her shifts. In the 13 years she’s worked for her sister, she’s had just two shifts red-flagged by Palco, and the problems had been quickly resolved. Now, like Walker, she couldn’t get through to a support coordinator on the phone.\n But for Morell, the real problem is that EVV’s inflexibility adds new and seemingly arbitrary responsibilities to an already demanding job. Morell has to clock in and out of the app as often as four times a day, and on a fixed schedule, even though Carolyn gets care whenever she needs it, not at predetermined times. She sets alarms on her phone, terrified she’ll miss a clock-in because she is preparing meals or helping Carolyn to the bathroom. Her mother, who is Carolyn’s legal representative, has to sign the app at the end of every day.\n The 2016 federal law that paved the way for EVV – the 21st Century Cures Act – requires that the systems be “minimally burdensome.” But Arkansas, like many other states, appears to have implemented an approach with burdens galore.\n As Morell wrote in an 11 June letter to Arkansas DHS: “What took a total of 15 seconds – to sign a timesheet and submit to Palco – now takes many hours; hours that should be given to the client for care.”\n  EVV vendors promise their solutions will save states money by cutting down on what they claim is pervasive fraud and waste. A 2016 federal  report  claimed that EVV use across the country would eventually lead to $290m in cost savings over a ten year period, in part by reducing improper billing.\n But in practice there is little evidence to suggest fraud is either widespread or significant. Only seven people were charged with fraud in self-directed personal care services in Arkansas in 2020, out of a workforce of more than 4,500, according to data collected by Applied Self-Direction, a Boston-based consultancy. The state secured three convictions, recovering $1,930 total – $643 per case. The EVV system has cost the state $5.7m so far.\n  Recent complaints to Arkansas’s DHS, acquired through a public records request, illustrate the life-altering consequences of the widespread delays in payment. DHS made the following note about a voicemail the agency received from a home care worker: “She said she cannot buy groceries, her utilities are being shut off and she has an eviction notice.”\n In their statement, Palco and the Arkansas DHS say that “the EVV system is working and caregivers are getting paid. There is a very low error rate for submitted claims – just 2 percent.” Since Palco processes approximately 25,000 claims every two weeks, a 2% error rate affects the lives of 500 caregivers each pay period. And a single missed paycheck can quickly spell catastrophe for a low-wage worker.\n “There are, to this day, still beneficiaries trying to get their caregivers paid back to early April,” said Trevor Hawkins, staff attorney at Legal Aid of Arkansas, in an email. “There were no accommodations made to cover them while the bugs were worked out.”\n  For some, the new system feels like being under house arrest. The EVV app incorporates GPS to verify a home care worker’s location and a feature called “geofencing”. It establishes a maximum distance around a client’s home inside which a care worker is allowed to clock in or out without getting flagged as noncompliant.\n “The metal building down there, we know we can go that far,” says Melissa Harville, 46, standing near her front porch in rural Greenbrier, about 40 miles north of Little Rock. “And to the end of the driveway.”\n Harville used the EVV app to map out how far away from her home she is allowed to go without triggering an “unauthorized location” alert that will have to be resolved by her agency before she can be paid. In May, Harville and her partner Kevin Hoover, 57, were sitting outside their simple log home as bees buzzed loudly in the early summer sun. She was pointing out the boundaries of what the couple characterize as an invisible dog fence for humans. “It’s like living in a box,” she says.\n   Before the home care agency she works for started using the AuthentiCare app in November 2020, she and Hoover, who has used a manual wheelchair since he lost the use of his legs in 2009, were always on the go. She could take him to therapy, grocery shopping, to see friends. “And now we can’t. You have to be at home to clock in and clock out,” Harville says.\n The intentions behind using GPS to verify a home care worker’s location might be to keep workers accountable and clients safe, but the implications are digital borders that undermine the philosophy behind independent living, advocates say.\n For more than six decades, disability activists have asserted the right to autonomy over one’s life and the ability to live, work and receive services within the broader community. Geo-fencing in EVV is built on a premise that contradicts this: it assumes that people like Kevin Hoover, who loves to fish, work on cars and play music with his friends, are homebound, not living active and vibrant lives.\n The state and Palco say that federal law requires them to log the location at which services are provided, and that the exception notices that caregivers and agencies perceive as errors are simply “informational geofencing messages” and “do not mean that time outside of the home will not be paid.”\n But the National Council on Independent Living conducted a  survey of home care recipients and their care providers across 36 states in 2020, and found that one-third of respondents said that they “stay at home more often than prior to EVV use, due to fear that geofencing limitations will flag a visit as fraud or cause delay in or loss of provider wages.”\n What’s more, because workers and clients tend to be nearby when care services are delivered, “what EVV is doing is unintentionally tracking the recipient of care,” says Kendra Scalia, director of policy for the grassroots campaign  Stop EVV.\n Karin Willison, disability editor at the digital health blog The Mighty, has  argued that “electronic visit verification is the equivalent of putting an ankle monitor on people with disabilities and telling us where we can and can’t go.”\n  The EVV rollout tells a wider story about misplaced priorities. State Medicaid programs face perennial pressures to patch budget deficits by restricting eligibility, slashing benefits and suppressing worker wages.\n In this environment, tech solutions that promise cost savings appear appealing. But the human costs of EVV, whether financial or personal, may well exceed any gains in efficiency.\n The Bureau of Labor Statistics  projects that home health and personal care aides will be among the fastest growing occupations in the coming years. But on top of low wages, these jobs typically do not come with standard workplace benefits like health insurance, paid sick leave, vacation or disability insurance. This leads to chronic labor shortages, which will only be worsened if care workers feel forced to abandon the profession because of delayed paychecks and digital surveillance.\n “Just stop,” says Nancy Morell, the woman who cares for her sister in Eureka Springs. “That app on your phone? It doesn’t guarantee that the work is being done any more than a paper timesheet does. Go back to the way it was before. That will attract people back into the job they signed up for. This job takes people with heart. We don’t deserve this.”\n  From the start, disability and labor advocates have been vocal about their concerns, providing input on ways to design systems that are less onerous and invasive. In California, the labor union United Domestic Workers and Disability Rights California  collaborated with clients, workers and state officials to design an in-house web portal that did not collect GPS data or require workers to log their hours in real-time.\n However, the federal government  said that this system would not be compliant, stating that web-based timesheets alone do not provide auditable confirmation of data submitted.\n  But the federal mandate is not inflexible. The state of Virginia chose to exempt live-in caregivers from EVV requirements entirely. Geofencing is optional, as well.\n To LeDanté Walker, the lack of consultation with the affected communities feels like contempt. “They need to listen to people with disabilities,” he says. “Ask. The. People.”", "posttime": "2021-07-30 00:39:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,护理人员,surveillance,evv", "title": "美国护理人员的数字监控", "title_en": "Digital Surveillance of US Caregivers", "transed": 1, "url": "https://www.theguardian.com/us-news/2021/jul/28/digital-surveillance-caregivers-artificial-intelligence", "via": "", "real_tags": ["美国", "护理人员", "evv"]}, {"category": "", "categoryclass": "", "imagename": "c75361dbdb41d0f03370a1282c996772.jpg", "infoid": 1070419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年，暴雪观察家们开始有报道称，2004 年首次被聘用的长期魔兽世界开发商亚历克斯·阿弗拉西亚比（Alex Afrasiabi）在没有任何官方解释的情况下悄悄离开了公司。既然 Afrasiabi 在加利福尼亚州针对该公司提起的性别歧视诉讼中被特别提及，暴雪确认 Afrasiabi 于 2020 年初被解雇，“因为他在对待其他员工时的不当行为”。暴雪发言人的确认来自一份严厉的 Kotaku 报告，其中包括所谓的“Cosby 套房”的图片和故事，这是 2013 年暴雪嘉年华的酒店房间，据报道被用作暴雪员工和粉丝的酒精派对场所.加利福尼亚州的诉讼提到了“克罗斯比套房”（诉讼中的拼写错误），声称“Afrasiabi 以骚扰女性而闻名，在涉嫌强奸犯比尔克罗斯比 [原文如此] 之后，他的套房被昵称为‘克罗斯比套房’。”更具体地说，该诉讼称，Afrasiabi“会攻击女性员工，告诉[她们]他想嫁给她们，试图亲吻她们，并用胳膊搂住她们。这是其他男性员工，包括主管，谁不得不干预，把他从女员工身上拉下来。” Kotaku 的报道发现，同时出现的社交媒体图片和讨论显示，该套房中有多名员工，他们经常拿着 Cosby 的带框照片摆姿势（到 2013 年，他曾面临多项性行为不端指控，但距离他 2018 年的定罪和今年早些时候的推翻还差几年） .不过，Kotaku 文章中的一些消息来源对这个名字与 Cosby 过去肮脏的一面的联系提出了异议。前暴雪员工 Josh Mosquiera 在 Medium 上写道，他认为“这间套房以 Cosby 的名字命名，因为丑陋的地毯让我们想起了他的毛衣。”他还写道，这间套房是他参加“近 100 人”聚会的场所，其中包括“暴雪员工以及他们的配偶、朋友，甚至家人”。前暴雪员工 Greg Street 曾出现在 Cosby Suite 的一些照片中，现在在 Riot 游戏中工作，他在推特上发表了一份简短声明，称该套房是“暴雪嘉年华的一个绿色房间，当时我们中的许多人过去常常休息在会议期间放松。” Street 说他“从未见过或经历过指控中描述的任何骚扰——如果我有，我绝对会介入。”但 Kotaku 的报道显示，Street 参与了文本对话，其中前暴雪员工 Dave Kosak 提到“为 Coz 收集热辣的 chixx”，以及许多其他性化参考。 “一名员工在 2020 年 6 月让我们注意到了这些 2013 年的事件，动视暴雪的一位发言人告诉 Kotaku。我们立即进行了自己的调查并采取了纠正措施。”在撰写报告时，我们已经对 Alex Afrasiabi 进行了单独调查，并因他对待其他员工的不当行为而解雇了他。”\n尽管 Afrasiabi 不再与暴雪合作，但他是少数魔兽世界角色和物品的同名人物。魔兽世界开发团队周二承诺，它正在努力“立即在艾泽拉斯采取行动，删除不适合我们世界的参考资料”，尽管该团队没有提到 Afrasiabi 的名字。在周三由动视暴雪员工组织的“平等罢工”之前，首席执行官鲍比科蒂克在周二晚些时候写了一条公开信息，为公司对诉讼的“聋哑”初步回应道歉，并承诺采取多项行动来鼓励“长期改变”在公司。 “我们必须承认所有观点和经历，并尊重以任何方式受到虐待的人的感受。我很抱歉我们没有提供正确的同情和理解，”他写道。", "note_en": "Last year,  reports started to bubble up among Blizzard-watchers that  longtime  World of Warcraft developer Alex Afrasiabi, who was first hired in 2004, had quietly left the company without any official explanation. Now that Afrasiabi has been specifically named in  a gender discrimination lawsuit brought against the company by California state, Blizzard is confirming that Afrasiabi was let go in early 2020 &#34;for his misconduct in his treatment of other employees.&#34; That confirmation from a Blizzard spokesperson comes from  a scathing Kotaku report that includes pictures of and stories about the so-called &#34;Cosby suite,&#34; a hotel room at Blizzcon 2013 that was reportedly used as an alcohol-filled party space for Blizzard employees and fans.\n The California lawsuit refers to a &#34;Crosby Suite&#34; (misspelled in the suit), alleging that &#34;Afrasiabi was so known to engage in harassment of females that his suite was nicknamed the ‘Crosby Suite’ after alleged rapist Bill Crosby [sic].&#34; More specifically, the suit alleges that Afrasiabi &#34;would hit on female employees, telling [them] he wanted to marry them, attempting to kiss them, and putting his arms around them. This was in plain view of other male employees, including supervisors, who had to intervene and pull him off female employees.&#34;\n Kotaku&#39;s reporting found contemporaneous social media images and discussions showing multiple employees in the suite, often posing with a framed photograph of Cosby (who by 2013 had faced multiple accusations of sexual misconduct but was years away from his 2018 conviction and  its overturning earlier this year).\n Some sources in Kotaku&#39;s piece dispute the name&#39;s association with the sordid side of Cosby&#39;s past, though. Ex-Blizzard employee Josh Mosquiera  wrote on Medium that he thought &#34;the suite was named after Cosby because of the hideous carpet that reminded us of his sweaters.&#34; He also wrote that the suite was the scene of a party he attended with &#34;close to 100 people,&#34; including &#34;Blizzard employees and also their spouses, friends, and even family.&#34;\n    Former Blizzard employee Greg Street, who is shown in some of the Cosby Suite pictures and now works at Riot games,  tweeted a short statement saying the suite was &#34;a green room at BlizzCon that many of us at the time used to take a break and relax during the convention.&#34; Street says he &#34;never saw or experienced any of the harassment described in the allegations—and if I had I absolutely would have stepped in.&#34;\n But Kotaku&#39;s reporting shows that Street participated in text conversations in which former Blizzard employee Dave Kosak mentions &#34;gathering hot chixx for the Coz,&#34; among many other sexualized references.\n &#34;An employee brought these 2013 events to our attention in June 2020, an Activision Blizzard spokesperson told Kotaku. &#34;We immediately conducted our own investigation and took corrective action. At the time of the report, we had already conducted a separate investigation of Alex Afrasiabi and terminated him for his misconduct in his treatment of other employees.&#34;\n Though Afrasiabi is no longer with Blizzard, he is the namesake of  a handful of  World of Warcraft characters and items. The  World of Warcraft development team  promised Tuesday it was working to take &#34;immediate action in Azeroth to remove references that are not appropriate for our world,&#34; though the team didn&#39;t mention Afrasiabi by name.\n  Ahead of  a Wednesday &#34;Walkout for Equality&#34; organized by a number of Activision Blizzard employees, CEO Bobby Kotick  wrote a public message late Tuesday apologizing for the company&#39;s  &#34;tone deaf&#34; initial response to the lawsuit and promising several actions to encourage &#34;long-lasting change&#34; at the company. &#34;It is imperative that we acknowledge all perspectives and experiences and respect the feelings of those who have been mistreated in any way. I am sorry that we did not provide the right empathy and understanding,&#34; he wrote.", "posttime": "2021-07-29 23:57:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,证实,confirms,员工", "title": "暴雪证实在诉讼中点名的开发商因“不当行为”而被撤职", "title_en": "Blizzard confirms developer named in lawsuit was removed for “misconduct”", "transed": 1, "url": "https://arstechnica.com/gaming/2021/07/blizzard-confirms-developer-named-in-lawsuit-was-removed-for-misconduct/", "via": "", "real_tags": ["开发", "证实", "confirms", "员工"]}]