[{"category": "", "categoryclass": "", "imagename": "fdae700291593e69c6e7d5d8a5963ae3.jpg", "infoid": 1008698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴塞罗那的Gran Teatre del Liceu歌剧院的演出门票销售一空并不少见，但周一音乐家们向不同寻常的观众演奏，以纪念西班牙解除封锁--数千株植物挤满了座位。\n这次活动是概念艺术家尤金尼奥·安普迪亚(Eugenio Ampudia)的作品，其中包括UceLi四重奏弦乐四重奏的表演。\n根据Liceu的一份声明，剧院里总共挤满了2292株植物，而弦乐四重奏则表演了普契尼·克里桑特米(Puccini&#34；s&34；Crisantemi)。\n虽然观众席中没有人，但观众可以通过直播观看康赛尔托生态节(Concierto para el bioceno&34；the Concierto para el bioceno&#34；Concierto para el bioceno)。\n这家著名的歌剧院在声明中表示，它欢迎并领导了一场高度象征性的行动，捍卫艺术、音乐和自然的价值，将其作为我们重返活动的介绍信。\n这些植物是从附近的苗圃运来的，每株都将捐赠给巴塞罗那医院诊所的一名医护人员。\n歌剧院在声明中补充说，在这段奇怪而痛苦的时期之后，组织者希望为我们提供一个不同的视角，让我们重返活动，这个视角让我们更接近我们与自然的关系这样重要的东西。\n西班牙冠状病毒进入紧急状态，迫使Liceu在3月中旬暂停其活动计划。\n根据约翰·霍普金斯大学(Johns Hopkins University)的数据，到目前为止，该国已记录到246,504例冠状病毒病例，28,324人死亡。\n该国的紧急状态已于周日结束，文化场馆现在可以重新开放，观众人数有限。\n一些人尝试了在线流媒体，另一些人在免下车电影院演出，还有一些人甚至预订了在空荡荡的体育场演出。\n而且看起来这种情况可能会持续一段时间，因为包括洛杉矶市长埃里克·加希蒂在内的一些人表示，像体育赛事或音乐会这样的大型集会可能在2021年之前不会恢复。", "note_en": "It&#39;s not uncommon for performances at Barcelona&#39;s Gran Teatre del Liceu opera house to be sold out, but musicians played to an unusual audience on Monday to mark  Spain&#39;s lifting of lockdown -- as thousands of plants filled its seats.\n The event was the work of conceptual artist Eugenio Ampudia and included a performance from the UceLi Quartet string quartet.\n  A total of 2,292 plants were packed into the theater, while the string quartet performed Puccini&#39;s &#34;Crisantemi,&#34; according to a statement from the Liceu.\n  Although humans were not present in the audience, spectators could watch the &#34;Concierto para el bioceno&#34; via livestream.\n  The famed opera house said in the statement that it &#34;welcomes and leads a highly symbolic act that defends the value of art, music and nature as a letter of introduction to our return to activity.&#34;\n The plants were brought in from nearby nurseries and each one will be donated to a healthcare worker from the Hospital Clinic of Barcelona.\n  The opera house added in the statement that, following this &#34;strange, painful period,&#34; organizers wanted to &#34;offer us a different perspective for our return to activity, a perspective that brings us closer to something as essential as our relationship with nature.&#34;\n Spain&#39;s coronavirus state of emergency forced the Liceu to suspend its program of events in mid-March.\n The country has so far recorded 246,504 coronavirus cases and 28,324 deaths,  according to figures from Johns Hopkins University.\n The country&#39;s state of emergency ended on Sunday and cultural venues can now reopen with a limited number of spectators.\n   Some have tried streaming online, others have  played at drive-in movie theaters, and a few have even booked to play in empty stadiums.\n  And it looks like the situation could last a while as some, including Los Angeles Mayor Eric Garcetti, say large gatherings like sporting events or concerts  may not resume before 2021.", "posttime": "2020-06-28 15:10:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "巴塞罗那,opera,观众", "title": "巴塞罗那歌剧院重新开放，演出2292株植物", "title_en": "Barcelona opera house reopens with performance to 2,292 plants", "transed": 1, "url": "https://edition.cnn.com/style/article/barcelona-opera-plants-scli-intl/index.html", "via": "", "real_tags": ["巴塞罗那", "opera", "观众"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008697, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着英国准备下周重返酒吧、餐馆和电影院，全国各地的大量办公室仍将是空置的。一些公司乐于保持这种状态-这给首都正在进行的数百万英镑的摩天大楼项目带来了严重的问题。\n总部位于伦敦的毕晓普斯盖特金融咨询公司(Bishopsgate Financial Consulting)是在冠状病毒大流行后越来越多的公司放弃或缩减办事处的公司之一。\n“我们本来打算搬办公室的。Bishopsgate的首席执行官迈克·汉普森说：“我们在封锁之前就发出了通知。”“当我们开始远程工作时，我们意识到我们的工作效率非常高。”\n因此，在与65名员工讨论后，他决定放弃位于首都平方英里金融区的公司总部。此举每年将为公司节省数十万英镑，将年度成本削减四分之一。员工也将在经济上受益-一些人每年的通勤账单每人节省了数千英镑。汉普森本人每年从肯特郡汤布里奇上下班要花费5000多英镑。\nBishopsgate购买了办公桌、笔记本电脑、双屏幕和打印机供员工在家使用，同时在伦敦金融城拥有一间“虚拟办公室”，这至少为公司提供了一个办公地址，并在需要时可以进入会议室和休息室。\n为瑞银(UBS)和瑞士信贷(Credit Suisse)等银行培训毕业生的Vantage Point Global也放弃了位于平方英里(Square Mile)英国央行(Bank Of England)总部附近的总部。该公司拥有45名员工。\n“从4月1日起，我们就不在办公室了，”Vantage的首席执行官詹姆斯·布林卡特(James Brincat)说。“这对底线…产生了影响。我们的工作做得非常好，几乎比以前更好。人们很高兴他们可以省去通勤时间。“。进入附近的“工作场所俱乐部”允许公司每月使用会议室和休息室，而费用只是以前租金的一小部分。\n这些决定是在全球大流行和大量建筑起重机的背景下做出的。尽管许多企业可能不愿回到写字楼，但首都的一些大型建筑项目依赖于它们坚持旧的企业生活方式。在距离毕晓普斯盖特(Bishopsgate)和凡蒂奇(Vantage)不远的地方，英国最大的商业塔楼项目正寄希望于围绕饮水机的团聚，并推进上层建筑建设，无视有关现代工作可能需要数年时间才能恢复到清洁前正常状态的警告。\n与封锁相关的经济放缓，对公共交通使用的严格限制，以及可能长期保留的物理距离指导方针，给现代服务型经济的基石蒙上了一层阴影：开放式办公室。全国各地数以百万计的休假或社交疏远的员工离开了办公桌，没有人照看，有迹象表明，这一变化可能是永久性的。\n上个月，Facebook表示，其4.8万名员工中有多达一半可能在十年内在家工作，而加拿大电商公司Shopify效仿Twitter表示，其5000名员工可以永久在家工作。在英国，在金丝雀码头(Canary Wharf)一座塔楼运营的巴克莱银行(Barclays Bank)首席执行官曾表示，“让7000人住进大楼的想法可能已经过去了”。\n伦敦金融城的基石之一也在拥抱变革。世界上最大的保险市场伦敦的劳合社正致力于创建一个虚拟保险室，这是一个新的数字平台，将利用Zoom等视频会议应用程序的最佳功能。\n劳合社在3月末关闭了其在Square Mile的承销室，这是其334年历史上的第一次，并计划在8月份重新开放。该公司预计，目前只有20%至25%的850名公司员工以及3000至4000名经纪人和承销商将返回伦敦莱姆街大楼。\n但是，尽管办公空间的需求可能会下降，但对于建筑业的一些元素来说，除了回到工地上开始建设，并希望工作场所在摩天大楼开业时再次挤满人之外，别无选择。首都在最雄心勃勃的计划中占据主导地位。重新开工的项目包括基金管理公司M&amp；G的利德霍尔街40号塔楼(昵称为哥谭市，因为它们与蝙蝠侠城相似)，以及伦敦三菱地产(Mitsubishi Estate London)的Bishopsgate 8号大楼，这两座大楼都位于平方英里(Square Mile)。\n然而，如果这些建筑总是不太可能在施工中途被遗弃，那么在更远的开发项目中，至少有一些犹豫不决。在新冠肺炎之后，可能会有更多的员工至少在部分时间在家工作，这表明企业将需要更少的空间-尽管社交距离的要求可能会让办公室变得很难瘦身。虽然政府的距离指引已从2米改为1米，“在2米不可行的地方”，但企业主是否会利用这一变化来寻求更广泛的员工重返办公室，仍有待观察。\n因此，一些建设计划可能会暂停。德勤(Deloitte)的顾问表示，伦敦金融城(City Of London)计划的几个大型项目可能会被搁置。它们可能包括被称为格子大厦的Under竖井1号，这将是西欧第二高的建筑，仅次于碎片大厦，高290米，预计将于今年年底开工；钻石大厦，高达247米；以及毕晓普斯盖特古德萨德大厦(Bishopsgate Goodsyard Tower)。\n德勤(Deloitte)在其最近的伦敦起重机调查中预测，建筑工程将延误3至6个月。该调查监测办公室的发展情况，其中许多工程将于今年完工，推迟到2021年。计划于今年完工的建筑包括伦敦金融城的22号毕晓普斯盖特(22 Bishopsgate)和西区的亨丽埃塔大厦(Henrietta House)。\n预计未来六到九个月几乎不会有新的建设开工。随着经济低迷的加深，获得融资可能会变得更加困难，开发商担心留下空置的建筑，或者担心租金随着空置率的上升而下降。\n伦敦起重机调查的作者迈克尔·克拉克内尔(Michael Cracknell)表示：“由于计划尚未启动，人们将不可避免地会犹豫不决。”“任何明智的居住者都会评估他们的办公空间需求；我们调查的首席财务官(CFO)中有98%的人表示，他们会考虑办公空间，以及他们如何使用灵活的工作安排。”\n在封锁导致大多数网站关闭之前，英国最大城市的写字楼和公寓楼建设一直在蓬勃发展，但许多网站在最近几周重新开放。\n然而，建筑产品协会(Construction Products Association)经济总监诺布尔·弗朗西斯(Noble Francis)表示，由于建筑公司在努力获得关键材料的同时，试图实施物理距离指导方针，生产率下降了30%至40%。\n“这意味着建筑成本更高，耗时更长，”他说。“这可能会导致合同的重新谈判和随之而来的延误…。并有可能阻碍一些未来发展项目的财务可行性。“。\n尽管存在这些担忧，但正在进行或获得规划许可的项目不太可能被放弃。房地产公司第一太平戴维斯(Savills)英国和欧洲商业地产研究团队负责人马特·奥克利(Mat Oakley)表示，他只记得一个大型写字楼开发项目在他的职业生涯中被放弃的例子：顶峰大厦(Pinnacle)，它在金融危机中失败，后来被称为树桩，后来被22 Bishopsgate大楼取代。\n伦敦金融区的对讲机和芝士收款机摩天大楼在金融危机期间被搁置，但一旦写字楼市场复苏，它们就继续建设。对于该行业的推动者来说，问题是写字楼市场这一次何时反弹，反弹程度如何。\n“行为科学问题是这场危机独有的，”奥克利说。“我们不知道三到六个月后职场人会有什么感受，会不会不顾一切地走进办公室，还是害怕乘坐公共交通？”\n无论哪种情况，在家工作的增加并不意味着办公室的终结。Cracknell说，由于网络攻击的风险，银行、保险公司和律师事务所仍将依赖写字楼来确保员工在安全的网络环境中工作。\n科技、媒体和电信公司现在是办公空间需求的主要来源，在大流行期间，对其产品和服务的需求激增，并可能继续扩大。\n但问题仍然存在：在前舒适时代为集中工作而设计的建筑是否适合现在的用途：通勤劳动力的位置合适吗？经济复苏是否会支撑起雇佣数千名员工的那种公司？资金紧张的公司是否会成为没有办公室的成本；以及，重要的是，在相对自由的在家工作之后，员工是否愿意在集体环境中工作？\n即使支持办公室的声音是正确的，现有的网站也需要重新配置，随着公司实施新冠肺炎的安全指导方针，每个员工需要更多的空间-比如办公桌之间的屏风和有限的会议出席人数。\n哥谭市、格子和钻石酒店的未来将取决于上班族-在经历了几个月的免通勤、在家就业之后-接受这样一个受限的工作环境。", "note_en": "As England prepares to return to pubs, restaurants and cinemas next week, vast numbers of offices around the country will remain empty. And some companies are happy for it to stay that way – which poses a serious problem for multimillion pound skyscraper projects under way in the capital.\n London-based Bishopsgate Financial Consulting is one of a growing number of firms that are giving up or downsizing their offices in the wake of the coronavirus pandemic.\n “We were planning to move offices. We’d given notice just before the lockdown came in,” says Mike Hampson, chief executive of Bishopsgate. “When we started working remotely, we realised we were working very effectively as we were.”\n So, after a discussion with his 65 staff, he decided to give up the firm’s head office in the capital’s Square Mile financial district. The move will save the company hundreds of thousands of pounds a year, slicing a quarter off its annual costs. Employees will also benefit financially – with some saving thousands of pounds each in annual commuting bills. Hampson himself has been spending more than £5,000 a year commuting from Tonbridge in Kent.\n Bishopsgate has bought desks, laptops, dual screens and printers for its staff to use at home, while taking a “virtual office” in the City of London, which at least gives the firm an office address along with access to meeting rooms and lounges when it needs them.\n Vantage Point Global, which trains graduates for banks including UBS and Credit Suisse and employs 45 people, has also given up its head office near the Bank of England headquarters in the Square Mile.\n  “From 1 April we were out of the office,” says James Brincat, Vantage’s chief executive. “It’s got an impact on the bottom line … We are working perfectly well, almost better than before. People are happy they can cut out the commute.” Access to a “workplace club” nearby allows the firm to use meeting rooms and lounges certain days a month, while the cost is a fraction of the previous rent bill.\n These decisions are being taken against a backdrop of a global pandemic – and a mass of construction cranes. Although many businesses might be reluctant to return to their office buildings, a number of substantial building projects in the capital are dependent on them sticking to the old way of corporate life. Around the corner from Bishopsgate and Vantage, the UK’s biggest commercial tower projects are banking on a reunion round the water cooler and pushing ahead with building superstructures, in defiance of warnings that modern working could take years to return to pre-covid normality.\n  The lockdown-related economic slowdown, severe restrictions on public transport use and the likely retention of physical distancing guidelines for a long period have cast a pall over the cornerstone of the modern service economy: the open-plan office. Millions of furloughed or socially distanced workers are leaving desks unattended around the country, and there are signs that the change could be permanent.\n Last month, Facebook said as many as half its 48,000 employees could be working from home within a decade, while Canadian e-commerce firm Shopify  followed Twitter in saying its 5,000 employees could work from home permanently. In the UK, the chief executive of Barclays bank, which operates from a tower block in Canary Wharf, has said that “the notion of putting 7,000 people in the building may be a thing of the past”.\n  One of the City’s cornerstone names is embracing change too. Lloyd’s of London, the world’s biggest insurance market, is working on creating a virtual underwriting room, a new digital platform that will use the best features of video-conferencing apps like Zoom.\n Lloyd’s, which closed its underwriting room in the Square Mile in late March, for the first time in its 334-year history, plans to reopen it in August. It expects that only 20% to 25% of 850 corporation staff and 3,000 to 4,000 brokers and underwriters will return to the Lime Street building in the City, for the time being.\n But despite the likely decline in demand for office space, for some elements of the construction industry there is no choice other than to get back on the site, start building and hope that workplaces fill up again when their skyscrapers open for business. The capital dominates among the most ambitious plans. Projects getting back under way include the fund manager M&amp;G’s 40 Leadenhall Street towers, nicknamed Gotham City for their resemblance to the Batman city, and Mitsubishi Estate London’s 8 Bishopsgate, both in the Square Mile.\n However, if those buildings were always unlikely to be abandoned mid-construction, there is at least hesitation among the developments that are further down the pipeline. In the wake of Covid-19 it is likely that more staff will work from home at least part of the time, suggesting that businesses will need less space – although the requirement for social distancing might make it difficult to slim down offices. While government distancing guidance has switched from 2 metres to 1 metre “where 2 metres is not viable”, it remains to be seen whether business owners will use that change to seek a wider workforce return to offices.\n Some construction schemes are therefore likely to pause. Several large projects planned in the City of London are likely to be put on hold, say consultants at Deloitte. They could include  1 Undershaft, known as the Trellis, which would be the second-tallest building in western Europe after the Shard at 290 metres, and where construction had been expected to start by the end of this year; the Diamond, rising to 247 metres; and the Bishopsgate Goodsyard towers.\n  Deloitte is predicting construction delays of three to six months in its recent  London crane survey, which monitors office developments, with many of the completions due this year pushed into 2021. Buildings that had been scheduled to finish this year include 22 Bishopsgate, in the City, and Henrietta House in the West End.\n Very little new construction is expected to start over the next six to nine months. Securing finance is likely to become tougher as the economic downturn deepens, and developers are nervous about being left with empty buildings, or rents falling as vacancies rise.\n “It’s inevitable that with schemes that haven’t started people are going to be hesitant,” says Michael Cracknell, author of the London crane survey. “Any sensible occupier is going to review their space requirements; 98% of CFOs [chief financial officers] we surveyed said they’d be looking at space and how they’re using flexible working arrangements.”\n  Office and apartment-block construction had been booming in the UK’s largest cities until the lockdown led to most sites being shut down, but many have reopened in recent weeks.\n However, productivity has dropped by 30% to 40%, as construction firms try to implement physical distancing guidelines while struggling to get key materials, says Noble Francis, economics director at the Construction Products Association.\n “This means construction will cost more and take longer,” he says. “This could lead to renegotiations of contracts and consequent delays … and potentially hinder the financial viability of some future developments.”\n Despite these concerns, projects underway or with planning permission are unlikely to be abandoned. Mat Oakley, head of the UK and European commercial property research team at property firm Savills, says he can only recall one example of a major office development being abandoned during his career: the Pinnacle, which was defeated by the financial crisis and became known as the Stump, later  replaced by the 22 Bishopsgate building.\n The Walkie-Talkie and Cheesegrater skyscrapers in London’s financial district were put on hold during the financial crisis, but  went ahead once the office market recovered. The question for the sector’s boosters is when, and to what extent, the office market will bounce back this time.\n  “The behavioural science question is unique to this crisis,” says Oakley. “We don’t know how workers will be feeling in three to six months’ time, will they be desperate to go into the office, or frightened of going on public transport?”\n Either way, the rise in home working does not spell the end of the office. Banks, insurers and law firms will still rely on office buildings to ensure staff work in secure network environments because of the risk of cyber-attacks, says Cracknell.\n Technology, media and telecoms firms, which are now the dominant sources of demand for office space, have seen demand for their products and services boom during the pandemic and could continue to expand.\n But questions remain over whether buildings designed for massed working in the pre-covid era are fit for purpose now: is the location right for a commuting workforce; will a recovering economy support the kind of firm that employs thousands of people; will offices become a cost cash-strapped companies can live without; and, importantly, do employees want to work in a collective environment after the relative freedom of home-working?\n Even if the pro-office voices are right, existing sites need to be reconfigured, with more space needed for each worker as firms implement Covid-19 safety guidelines – such as screens between desks and limited attendances at meetings.\n The future of Gotham City, the Trellis and the Diamond will depend on office workers – after months of commute-free, home-based employment – embracing such a constrained work environment.", "posttime": "2020-06-28 15:09:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "热潮,working", "title": "为什么在家工作的热潮会推倒伦敦的摩天大楼", "title_en": "Why the home-working boom could tumble London's skyscrapers", "transed": 1, "url": "https://www.theguardian.com/business/2020/jun/27/why-the-home-working-boom-could-tumble-londons-skyscrapers", "via": "", "real_tags": ["热潮", "working"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Linux raspberry pi大约在两个月前，我开始为我正在进行的一个项目构建一个四节点的Raspberry pI4集群。找出在每个节点上安装Linux的最佳方法让我陷入困境，接下来的四周我都在刮牦牛胡子。\n引导PI最常见的方式是从SD卡启动。但是它们又慢又不可靠--我不喜欢它们。某些型号的PI 2和PI 3支持从USB存储启动，但PI 4还不能这样做。因此，我不得不为每个PI使用SD卡。或者我是这样想的。\n原来，Raspberry PI 2和3也支持网络引导。去年年底发布了支持PXE for PI 4的测试版固件。我在LinuxHit上找到了一篇文章，详细介绍了安装固件和设置网络引导的过程。\n为了测试这一点，我在其中一个PI上更新了固件并配置了PXE服务器。我尝试通过网络和…启动另一个PI。成功了！以下是PXE服务器设置过程的要点：\n将/boot和/的其余内容复制到本地文件系统上的单独文件夹中。我将我的文件分别复制到/tftp/raspbian-boot和/nfs/raspbian-root。\n我不能从相同的引导和根文件系统引导所有三个节点，因为它们不是只读的。我不想为每个节点维护这些文件的副本。但这是一个已解决的问题-Docker已经允许您从单个基础映像启动多个容器。因此，我将按照Docker的做法-使用raspbian-root和raspbian-boot作为我的下层目录，为每个节点创建OverlayFS。我会像以前一样通过NFS分享它们。\n其中一个节点的配置如下所示。其他两个节点遵循相同的模式。注意，我将raspbian-root和raspbian-boot移到了USB硬盘驱动器(挂载在/mnt)，以获得更好的读/写性能。DC-a6-32-XX-XX-XX是节点的MAC地址。我在dnsmasq中使用tftp-ique-root=mac选项，根据每个节点的MAC地址为其维护单独的引导环境。\n$mount-t overlay nog-boot-o lowerdir=/mnt/raspbian-boot，upperdir=/mnt/up/nog-boot，workdir=/mnt/work/nog-boot-o nfs_export=on-o index=on-o redirect_dir=noollow/tftpboot/dc-a6-32-XX-XX-XX$mount-t overlay nog-root-o lowerdir=/mnt/R。workdir=/mnt/work/nog-root-o nfs_export=on-o index=on-o redirect_dir=NOFLOW/nfs/nog$cat/tftpboot/dc-a6-32-XX-XX-XX/cmdline.txtconsole=序列0,115200控制台=tty1root=/dev/nfs nfsroot=&lt；IP地址&gt；：/nfs/nog，vers=4.1，proto=TCP rw IP=dhcp rootwait level=Deadline\n(如果您想知道nog是什么：我以星球大战宇宙中的行星命名我的服务器。遵循这一传统，我将Pis Mandalore(PXE服务器)命名为Nog、Ordo和Werda)。\nNFS和OverlayFS彼此并不友好。在一个周末试图解决一些奇怪的问题后，我放弃了。\n但是OverlayFS不是唯一存在的写入时拷贝文件系统，不是吗？ZFS和BTRFS提供我可以使用的子卷和快照。但在此之前，我拖延了两个星期，决定用哪一个。\n计划很简单：我将分别为raspbian-root和raspbian-boot创建一个子卷。然后，我将为每个子卷创建三个快照-每个节点一个快照。我在外部驱动器上创建了一个btrfs文件系统，并运行以下命令。\n$btrfs子卷创建raspbian-root$btrfs子卷为每个节点创建raspbian-boot#根据需要更改文件夹名称$btrfs子卷快照raspbian-boot nog-boot$btrfs子卷快照raspbian-root nog-root$mount--bind/mnt/nog-boot/tftpboot/DC-a6-32-XX-XX-XX$mount--bind/mnt/nog-root/nfs/nog#Don。：/nfs/nog，vers=4.1，proto=tcp rw ip=dhcp rootwait level=Deadline。\n嗯，这招奏效了！我在没有SD卡的情况下运行PI！！现在，我需要做的就是创建systemd单元文件来启动所有需要的服务并挂载快照。我终于可以开始做我的项目了。\n等一下。仔细查看cat/tftpboot/dc-a6-32-XX-XX-XX/cmdline.txt的输出。如果您和我一样，您将第一次意识到，此文件中的root=定义将从何处挂载根文件系统。现在，我们告诉它从/dev/nfs挂载。如果我连接一个外部驱动器并将root=设置为指向该外部驱动器，该怎么办？\nRPI 4不能直接从USB驱动器启动。与中一样-开机时无法在USB驱动器上找到/引导。但是，如果我们使用cmdline.txt提供/boot，并使用cmdline.txt从USB驱动器挂载/引导，会怎么样呢？测试时间到了。\n我将raspbian-root复制到USB驱动器，编辑fstab以挂载/使用分区的PARTUUID，并将其连接到Nog。然后我更新了/tftpboot/dc-a6-32-XX-XX-XX/cmdline.txt的内容。\n在几次重启之后，它起作用了！我现在有一个运行在USB硬盘上的RPI 4！\n让我们从我要找的东西开始吧。我只想不要处理SD卡，因为它们速度慢，不可靠。可靠性是相对的-一切都会在某个时候失败。但是一个质量不错的USB硬盘可能会比SD卡更耐用。因此，让我们只看一些读/写性能数据，看看它们之间的比较。\n$sync；dd if=/dev/Zero of=twogefile bs=1M count=2048；sync#写入性能$sudo sh-c&#34；sync&amp；&amp；echo 3&gt；/proc/sys/vm/drop_caches&#34；$dd if=twogefile of=/dev/null bs=1M count=2048#读取性能。\n通过网络引导，我能够获得类似于10类SD卡的读写速度。请注意，引导映像托管在连接到Mandalore(PXE服务器)的USB硬盘驱动器上。NFS似乎是这里的瓶颈-硬盘驱动器的原始读/写速度比这个要好得多。所有PI都连接到Netkit的8端口千兆以太网交换机。\n不足为奇的是，当PI使用USB硬盘时，情况会有相当大的改善。请注意，我使用的外置驱动器是从非常旧的MacBook改装而来的5400rpm硬盘。我在易趣上花了10美元买的。YMMV。\n现在，我让Mandalore从SD卡引导和/或从USB硬盘挂载。Nog、Ordo和Werda通过网络从Mandalore获取/引导和/或从USB硬盘挂载。", "note_en": "linux  raspberry pi  Almost two months ago, I started building a four node Raspberry Pi 4 cluster for a project I’m working on. Figuring out the best way to get Linux on each node lead me down a rabbit hole and I spent the next four weeks  yak shaving.\n The most common way to boot a Pi is from an SD card. But they are slow and unreliable - I don’t like them. Certain models of Pi 2 and Pi 3 support  booting from USB storage, but Pi 4 cannot do that yet. So, I’m stuck with using an SD card for each Pi. Or so I thought.\n  Turns out, Raspberry Pi 2 and 3 also  support network booting. A beta firmware was released late last year that enables  PXE for Pi 4. I found  an article on LinuxHit detailing the process of installing the firmware and setting up network boot.\n Just to test this out, I updated the firmware and configured PXE server on one of the Pis. I tried booting another Pi over the network and…it worked!Here is the gist of PXE server setup process:\n Copy the contents of  /boot and the rest of  / into separate folders on your local filesystem. I copied mine to  /tftp/raspbian-boot and  /nfs/raspbian-root respectively.\n   I cannot just boot all three nodes from the same boot and root filesystems since they are not read-only. And I don’t want to maintain a copy of these for each node. But this is a solved problem - Docker already lets you spin up multiple containers from a single base image. So I’ll just do  what Docker does - create  OverlayFS for each node using raspbian-root and raspbian-boot as my lower directories. I’ll share them over NFS like before.\n Configuration for one of the nodes is below. Other two nodes follow the same pattern. Note that I moved raspbian-root and raspbian-boot to a USB hard drive (mounted at  /mnt) to get better r/w performance. dc-a6-32-XX-XX-XX is the MAC address of the node. I’m using  tftp-unique-root=mac option in  dnsmasq to maintain a separate boot environment for each node based on its MAC address.\n $ mount -t overlay nog-boot -o lowerdir =/mnt/raspbian-boot,upperdir =/mnt/upper/nog-boot,workdir =/mnt/work/nog-boot -o nfs_export =on -o index =on -o redirect_dir =nofollow /tftpboot/dc-a6-32-XX-XX-XX$ mount -t overlay nog-root -o lowerdir =/mnt/raspbian-root,upperdir =/mnt/work/nog-root,workdir =/mnt/work/nog-root -o nfs_export =on -o index =on -o redirect_dir =nofollow /nfs/nog$ cat /tftpboot/dc-a6-32-XX-XX-XX/cmdline.txtconsole =serial0,115200 console =tty1 root =/dev/nfs nfsroot =&lt;IP addr&gt;:/nfs/nog,vers =4.1,proto =tcp rw ip =dhcp rootwait elevator =deadline\n (In case you are wondering what  nog is: I name my servers after planets from the Star Wars universe. Following this tradition, I’ve named the Pis Mandalore (PXE server), Nog, Ordo and Werda)\n  NFS and OverlayFS did not play nice with each other. After a weekend trying to work around some weird issues, I gave up.\n But OverlayFS is not the only copy-on-write filesystem in existence, is it? ZFS and BTRFS offer  subvolumes and snapshots that I can use instead. But not before I  procrastinate spend 2 weeks deciding which one to use.\n  The plan is simple: I’ll create a subvolume each for raspbian-root and raspbian-boot. I’ll then create three snapshots of each subvolume - one for every node. I created a  btrfs file system on my external drive and ran the following commands\n $ btrfs subvolume create raspbian-root$ btrfs subvolume create raspbian-boot # Repeat the following for each node changing folder names as necessary$ btrfs subvolume snapshot raspbian-boot nog-boot$ btrfs subvolume snapshot raspbian-root nog-root$ mount --bind /mnt/nog-boot /tftpboot/dc-a6-32-XX-XX-XX$ mount --bind /mnt/nog-root /nfs/nog # Don’t forget to edit cmdline.txt for each node$ cat /tftpboot/dc-a6-32-XX-XX-XX/cmdline.txtconsole =serial0,115200 console =tty1 root =/dev/nfs nfsroot =&lt;IP addr&gt;:/nfs/nog,vers =4.1,proto =tcp rw ip =dhcp rootwait elevator =deadline\n Well, this worked! I have a Pi running without an SD card!! Now all I have to do is create systemd unit files to start all required services and mount snapshots. I can finally start working on my project.\n Wait a minute. Take a closer look at the output of  cat /tftpboot/dc-a6-32-XX-XX-XX/cmdline.txt.If you are like me, you will realize for the first time that  root= in this file defines where the root filesystem will be mounted from. Right now, we are telling it to mount from  /dev/nfs. What if I attach an external drive and set  root= to point to the external drive?\n  RPi 4 cannot directly boot from a USB drive. As in - it cannot find  /boot on a USB drive when powering on. But what if we provide  /boot with network boot and mount  / from a USB drive using  cmdline.txt? Time to test.\n I copied raspbian-root to a USB drive, edited  fstab to mount  / using the partition’s PARTUUID and connected it to Nog. I then updated the contents of  /tftpboot/dc-a6-32-XX-XX-XX/cmdline.txt.\n  After a couple of reboots, it worked! I now have a RPi 4 running off a USB hard drive!\n  Let’s start with what I was looking for. All I wanted was to not deal with SD cards because they are slow and unreliable. Reliability is relative - everything fails at some point. But a decent quality USB hard drive will likely outlive an SD card. So let’s just look at some read/write performance numbers and see how they compare.\n $ sync; dd  if =/dev/zero of =twogeefile bs =1M count =2048; sync  # Write performance$ sudo sh -c  &#34;sync &amp;&amp; echo 3 &gt; /proc/sys/vm/drop_caches&#34;$ dd  if =twogeefile of =/dev/null bs =1M count = 2048  # Read performance\n  With network boot, I was able to get read and write speeds similar to a class 10 SD card. Note that the boot images are hosted on a USB hard drive connected to Mandalore (PXE server). NFS seems to be the bottleneck here - raw r/w speeds of the hard drive are much better than this. All Pis are connected to Netgear’s 8 port gigabit ethernet switch.\n To no one’s surprise, things improve considerably when Pis are running off a USB hard disk. Note that the external drives I used are 5400RPM hard disks repurposed from very old MacBooks. I bought them on eBay for $10 a pop. YMMV.\n  Right now, I have Mandalore booting from an SD card and  / mounted from a USB hard disk. Nog, Ordo and Werda fetch  /boot from Mandalore over the network and  / mounted from a USB hard disk.", "posttime": "2020-06-28 15:09:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,raspberry-pi,启动,booting,nog", "title": "在Raspberry PI 4上启动Linux的历险", "title_en": "Adventures in booting Linux on Raspberry Pi 4", "transed": 1, "url": "https://blog.mostlypointless.dev/posts/net-boot-rpi/", "via": "", "real_tags": ["linux", "启动", "booting", "nog"]}, {"category": "", "categoryclass": "", "imagename": "f8eb40a4a87ee9a8a02151e0055a2adb.png", "infoid": 1008695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Foam是一个受Roam Research启发的个人知识管理和共享系统，基于Visual Studio代码和GitHub构建。\n您可以使用Foam来组织您的研究、保存可重复发现的笔记、编写长篇内容，还可以选择将其发布到网络上。\n泡沫是免费的、开源的，并且极具可扩展性，适合您的个人工作流程。您拥有使用Foam创建的信息，您可以自由地共享这些信息，并与您想要的任何人进行协作。\n匆匆忙忙？您可以跳到入门，但我强烈建议您先阅读介绍性部分。泡沫并不明显。\n泡沫是一种支持在思想和信息之间创建关系的工具，可以帮助您更好地思考。\n无论你是想要建立第二个大脑，还是想要成为Zettelkasten，写一本书，或者只是想在长期学习中变得更好，只要你遵循这些简单的规则，泡沫塑料可以帮助你组织你的想法：\n把你的想法写在标记文档中(我喜欢称它们为气泡，但那可能有点太夸张了)。这些文档应该是原子的：将本应放在一起的内容放到单个文档中，并将其内容限制在单个主题中。(来源)。\n使用Foam的快捷方式和自动完成功能将您的想法与[[wiki-link]]链接在一起，并在它们之间导航以浏览您的知识图谱。\n使用[图形可视化](⚠️wip)了解您的泡沫工作空间，并使用[反向链接]发现您的想法之间的关系。\n泡沫就像浴缸：你从里面得到什么取决于你往里面放了什么。\nFoam的编辑体验由VS Code提供支持，并通过粘合在一起的[推荐扩展]工作区设置和为编写和导航信息而优化的首选项来增强。\n要在设备之间备份、协作和共享您的内容，Foam可以与GitHub很好地配对。\n要发布您的内容，您可以将其设置为发布到GitHub页面，无需代码和配置，也可以发布到任何网站托管平台，如Netlify或Vercel。\n⚠️泡沫仍在预览中。预计这段经历会有点艰难。\n这些说明假定您拥有GitHub帐户，并且安装了Visual Studio代码。\n从Foam-Template创建一个GitHub存储库。如果您希望将您的想法保密，请记住将存储库设置为私有。\n提示安装推荐的扩展模块时，单击全部安装(如果要逐个查看并安装，则单击显示建议)。\n设置存储库后，打开.vscode/settings.json，然后编辑、添加或删除您希望用于泡沫工作区的任何设置。\n泡沫不具有传统意义上的特征。开箱即用，您可以使用VS代码的所有功能和您选择安装的所有[推荐扩展]，但这取决于您发现您可以用它做些什么！\n泡沫塑料的目标是成为你追求知识的私人伴侣。\n与我想过的所有功能相比，它目前大约有10%的功能已经准备就绪，但我只考虑了它可能拥有的功能的1%左右，我很高兴能从别人那里学到东西。\n我把它当做我个人的思考工具。通过将其公之于众，我希望不仅从别人那里学习如何改进泡沫，而且还可以改进我学习和管理信息的方式。\n如果这听起来像是你感兴趣的东西，我很乐意让你和我一起旅行。\n请随时打开GitHub的问题，给我反馈和新功能的想法。\n如果没有Visual Studio代码和GitHub，泡沫就不可能实现，并且严重依赖我们出色的开源[推荐扩展]及其所有贡献者：", "note_en": "Foam is a personal knowledge management and sharing system inspired by  Roam Research, built on  Visual Studio Code and  GitHub.\n You can use  Foam for organising your research, keeping re-discoverable notes, writing long-form content and, optionally, publishing it to the web.\n Foam is free, open source, and extremely extensible to suit your personal workflow. You own the information you create with Foam, and you&#39;re free to share it, and collaborate on it with anyone you want.\n In a rush? You  could jump to  Getting started, but I highly recommend reading the introductory sections first.  Foam isn&#39;t obvious.\n    Foam is a tool that supports creating relationships between thoughts and information to help you think better.\n  Whether you want to build a  Second Brain or a  Zettelkasten, write a book, or just get better at long-term learning,  Foam can help you organise your thoughts if you follow these simple rules:\n Write your thoughts in markdown documents (I like to call them  Bubbles, but that might be more than a little twee). These documents should be atomic: Put things that belong together into a single document, and limit its content to that single topic. ( source)\n Use Foam&#39;s shortcuts and autocompletions to link your thoughts together with  [[wiki-links]], and navigate between them to explore your knowledge graph.\n Get an overview of your  Foam workspace using a [ graph-visualisation] ( ⚠️ WIP), and discover relationships between your thoughts with the use of [ backlinking].\n Foam is a like a bathtub:  What you get out of it depends on what you put into it.\n   The editing experience of  Foam is powered by VS Code, enhanced by workspace settings that glue together [ recommended-extensions] and preferences optimised for writing and navigating information.\n To back up, collaborate on and share your content between devices, Foam pairs well with  GitHub.\n To publish your content, you can set it up to publish to  GitHub Pages with zero code and zero config, or to any website hosting platform like  Netlify or  Vercel.\n   ⚠️ Foam is still in preview. Expect the experience to be a little rough.\n These instructions assume you have a GitHub account, and you have Visual Studio Code installed.\n Create a GitHub repository from foam-template. If you want to keep your thoughts to yourself, remember to set the repository private.\n  When prompted to install recommended extensions, click  Install all (or  Show Recommendations if you want to review and install them one by one)\n After setting up the repository, open  .vscode/settings.json and edit, add or remove any settings you&#39;d like for your Foam workspace.\n    Foam doesn&#39;t have features in the traditional sense. Out of the box, you have access to all features of VS Code and all the [ recommended-extensions] you choose to install, but it&#39;s up to you to discover what you can do with it!\n   The goal of  Foam is to be your personal companion on your quest for knowledge.\n It&#39;s is currently about &#34;10% ready&#34; relative to all the features I&#39;ve thought of, but I&#39;ve only thought of ~1% of the features it could have, and I&#39;m excited to learn from others.\n I am using it as my personal thinking tool. By making it public, I hope to learn from others not only how to improve Foam, but also to improve how I learn and manage information.\n If that sounds like something you&#39;re interested in, I&#39;d love to have you along on the journey.\n Feel free to open  GitHub issues to give me feedback and ideas for new features.\n    Foam wouldn&#39;t be possible without  Visual Studio Code and  GitHub, and relies heavily on our fantastic open source [ recommended-extensions] and all their contributors:", "posttime": "2020-06-28 14:47:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,markdown,research", "title": "一种基于VScode、Markdown和GitHub的漫游研究方案", "title_en": "A Roam Research alternative with VSCode, Markdown and GitHub", "transed": 1, "url": "https://github.com/foambubble/foam", "via": "", "real_tags": ["github", "markdown", "research"]}, {"category": "", "categoryclass": "", "imagename": "e385cc31f3d1fe3dbd23bf88c9fb1adc.png", "infoid": 1008694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据吉尼斯世界纪录，阿尔法波是有史以来第一款3D平台游戏。\n最初在Atari St开发，然后移植到Amiga和IBMPC上。这项技术后来产生了Alone in the Dark，这是一款在大联盟推出Infogrames的主要游戏。这就是这款游戏的历史。\n这款游戏最初是在Atari St上开发的，代表了17000行68K汇编代码。后来被移植到Amiga和IBMPC上，是Infogrames移植到另一个CPU上的第一款也是唯一一款汇编程序游戏。为这款游戏开发的技术后来启发弗雷德里克·雷纳尔在黑暗中独自开发，这是一款重要的游戏，在大联盟中推出了Infogrames。\n围绕游戏的有趣故事和琐事，包括Infogrames在人工智能领域的经历和孤单在黑暗中的起源", "note_en": "Alpha Waves is the first 3D platform game ever, according to the Guiness Book of Records.\n Initially developed on Atari ST, it was then ported on Amiga and on the IBM PC.The technology later gave rise to Alone in the Dark, a major game that launched Infogrames in the big league.This is the history of that game.\n The game was initially developed on Atari ST, representing 17000 lines of 68K assembly code.It was later ported on Amiga and on the IBM PC, and was the first and only assembly program game that Infogrames ever ported to another CPU.The technology developed for that game later inspired Frederick Raynal to develop Alone in the Dark, a major game that launched Infogrames in the big league.\n  Funny stories and trivia around the game, including the stints of Infogrames in Artificial Intelligence and the arch-genesis of Alone in the Dark", "posttime": "2020-06-28 14:26:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,alpha", "title": "Alpha Waves是第一款3D平台游戏", "title_en": "Alpha Waves was the first 3D platform game", "transed": 1, "url": "https://fosdem.org/2020/schedule/event/retro_alpha_waves_1st_3d_platformer_ever/", "via": "", "real_tags": ["游戏", "alpha"]}, {"category": "", "categoryclass": "", "imagename": "56173716723778ade0513d620070c3a0.jpg", "infoid": 1008693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新泄露的文件显示，在乔治·弗洛伊德被杀后，当地和联邦执法机构一再告诉明尼苏达州警方，他们受到了攻击。警告引发的恐惧似乎为警方对抗议活动不断升级的暴力回应奠定了基础，包括广泛使用催泪瓦斯、冲击弹和橡皮子弹，有时会近距离发射。\n文件显示，执法领导层警告了来自Antifa和“出于种族动机的黑人暴力极端分子”的潜在威胁，并含糊地描述了社交媒体用户。文件显示，联邦和地方机构从私人在线消息群组和Slake频道收集情报。这些机构还追踪Facebook RSVP参加和平抗议活动，包括郊区的烛光守夜活动。\n进入警方内部备忘录的窗口要归功于发布在分布式否认秘密网站上的一批名为Blueleaks的文件。该网站的创始人告诉“连线”杂志，这些文件来自黑客组织“匿名者”，也就是声称与该组织有关联的人。档案出现在这些文件中的政府官员告诉“拦截报”，这些文件是“非法获取的”，但没有人质疑它们的真实性。有关明尼苏达州的文件来自许多地方和联邦执法机构以及协调办公室，这些机构致力于在他们之间共享信息。\n虽然这些文件揭示了对自称致力于动乱的团体的担忧，比如极右翼组织Boogaloo，但它们也表明，人们倾向于将标准的抗议行为归类为对警察的威胁。例如，明尼苏达融合中心(Minnesota Fusion Center)5月28日的一份文件警告称，警方应该警惕一系列令人眼花缭乱的可疑行为，包括拥有气球或自行车锁的人，以及戴口罩的人-这种描述包括许多在大流行期间走上街头的人。明尼苏达融合中心是一个后9·11时代的机构，负责协调各个执法机构。\n该国其他地区也发出了类似的警告。负责协调洛杉矶地区联邦、州和地方情报的联合地区情报中心(Joint Region Intelligence Center)5月29日的一次简报称，抗议者可能会使用涉及“集体、经常是暴力行动”的“黑人集团策略”。虽然文件中提供的这些策略的一些例子会构成犯罪，但其他的是完全合法和广泛的活动，比如监控警方的扫描仪，通过加密的应用程序进行通信，以指挥“地面行动”。\n这些文件还警告了一些即将发生的事件，这些事件显然从未发生过。明尼苏达州公共安全部下属的临时协调机构多机构指挥中心(Multi-Agency Command Center)于5月29日启动，该中心在5月30日的更新中提到，“有未经证实的报告称，紧邻的地铁以外的富裕社区和地区可能成为袭击目标。”其他警告也是模糊不清的：同样是在5月30日，指挥中心的更新描述了“有关明尼苏达州与内乱有关的极端组织活动的未经证实的报告”。明尼苏达州公共安全部发言人拒绝置评，并补充道，“我们不会回应基于非法获得的文件的问题.”多机构指挥中心于6月7日结束运营。\n在乔治·弗洛伊德被杀后的几天里，双城发生的一些重大财产损失确实是针对执法部门的，明尼阿波利斯警察局的第三分局被烧毁，各种警车遭到破坏。但是，尽管有报道称有人向警察投掷石块，除了向警车开枪的事件，抗议期间执法人员受伤的情况也很分散，但就连多机构指挥中心(Multi-Agency Command Center)分发的抗议期间全国警察伤亡的清单也没有明尼苏达州的例子。\n长期以来，不合理的恐惧一直是警察滥用职权的原因。詹姆斯·鲍德温(James Baldwin)1966年在谈到“国家警察”时写道：“自从他们知道自己被人憎恨以来，他们总是害怕。”“对于残忍行为，没有比这更可靠的方案了。”根据丹·奥弗莱厄蒂(Dan O‘Flaherty)和拉吉夫·塞西(Rajiv Sethi)的书“怀疑的阴影：刻板印象、犯罪和正义的追求”，基于错误信息的不当安全服务恐惧在历史上导致了警察杀害和伤害平民。\n明尼阿波利斯泄露的文件中弥漫着焦虑，这似乎反映在警方随后几天的极端反应中，抗议活动在全国蔓延。在明尼阿波利斯，警方和其他安全部门被指控与示威者和居民进行对抗，包括使用“不那么致命”的弹药和催泪瓦斯推进和平抗议，以及袭击站在自家门廊上的旁观者。\nO‘Flaherty说：“在弗洛伊德死后的几周里，我们看到了许多关于警察不正当使用武力的视频和相当确凿的报道，包括几起可疑的杀人案。”“这些事件让你摸不着头脑。“他们在想什么呢？他们知道全世界都在看着。最有说服力的解释是恐惧。“。\n这些警告在弗洛伊德死后不久就开始了。5月27日，也就是明尼阿波利斯第三分局被烧毁的前一天，明尼苏达州融合中心发布了一份题为“在全球报道明尼阿波利斯在押死亡事件后，针对执法部门和政府官员的威胁活动增加的可能性”。在这一点上，明尼阿波利斯的抗议活动已经是压倒性的和平。但这份文件描述了“针对参与弗洛伊德谋杀案的四名MPD警官的威胁”-包括在网上公布其中两名警官的个人信息。\n公告敦促明尼阿波利斯警察局的所有员工，包括行政人员，寻找可疑人员和车辆，并“考虑改变旅行计划，以避免监视”。作为警方处于危险之中的进一步证据，这份新闻稿提供了财产损失的例子，包括一辆遭到破坏的警车和一扇打碎的警察局窗户的照片，以及发送到明尼阿波利斯警察局Twitter账户的一条威胁性推文。公告强调：“虽然最近的网上讨论专门讨论了针对这四名MPD官员的问题，但个人可能会试图伤害任何执法人员。”\n在接下来的几天里，明尼苏达州融合中心和亨内平县警长办公室犯罪信息共享和分析股发布了抗议相关活动的回复计数，显然是从Facebook上获得的。“在报道时，有833人在网上表示他们会参加，而3300人似乎有兴趣，”一条关于一场名为“正义4乔治·弗洛伊德-制止警察犯罪-释放他们所有人”的抗议活动的说明写道。\n“我笑是因为我们知道他们在监视我们，”萨姆·马丁内斯(Sam Martinez)说，他是策划这次活动的双城正义联盟(Twin Cities Coalition For Justice 4 Jamar)的发言人之一。马丁内斯估计有5000人参加，并表示组织者没有听说过发生任何暴力事件，并补充说，监控是“荒谬的”。\n这些文件明确表示，在某些情况下，执法部门可以看到私人通信。亨内平县警长办公室6月1日的一份新闻稿描述了一篇“私人社交媒体聊天应用程序帖子”，该帖子主张以国民警卫队士兵为目标。根据警方的文件，该帖子声称国民警卫队成员是“几乎没有接受过训练的容易攻击的目标”。\n报告中传播的其他情报是从斯拉克那里收集的。多机构指挥中心(Multi-Agency Command Center)6月6日发布的一份报告称，明尼阿波利斯的“一个革命性的反资本主义组织”收集了执法部门下落的细节，并补充说，该组织的成员“使用Slake消息应用程序向该组织的Antifa部分传递情报”。这些信息被认为是联邦调查局提供的。\n在这两起案件中，尚不清楚执法部门是否渗透到了在线群组中，还是被一名成员通风报信。\n在另一起事件中，FBI从“一位访问渠道极佳的敏感消息来源”那里收到了一条线索，内容是关于即时通讯应用Telegram上的频道，抗议者在骚乱期间使用该应用来协调和“保护人们不受警察的伤害”。文件指出，这些频道包括“几个城市的‘公告频道’、‘警用扫描频道’和‘聊天/协调频道’。”\n文件显示，亨内平县警长办公室甚至对家人和神职人员喜欢的小活动都保持密切关注，比如在明尼阿波利斯北部一座教堂举行的和平与祈祷烧烤活动，以及在宁静的郊区枫树林(Maple Grove)举行的烛光守夜活动。守夜活动的组织者之一坦维·普里格(Tanwi Prigge)说，她和她的联合主办方提前通知了警方，警察帮助指挥了活动的交通。(警长办公室拒绝置评。)。\n多机构指挥中心的报告每天发布多次，包括全州即将举行的抗议和集会的清单。报告的作者意识到他们的监视有可能违反宪法。“本产品中点名的个人或团体已被确认参与了受美国宪法第一修正案保护的活动，”在几份报告中重复了一份免责声明。“然而，根据已知的情报和/或具体的历史观察，受保护的活动可能会引发针对主体个人或团体的暴力反应，或者该活动可能被用作针对执法部门的手段。”\n对执法部门遇袭的担忧主要集中在所谓的极端分子身上。5月30日周六，各机构注意到抗议活动的语气发生了变化。国土安全部的一份情报报告称：“国内暴力极端分子正试图组织抗议活动，将目标对准州、地方和联邦权力的具体象征。”文件接着说，该部门对“在5月30日至31日的黑暗期间，暴力抗议运动将会发展壮大，DVE-国内暴力极端分子-以及其他人将寻求接管政府设施和攻击执法部门”抱有“高度信心”。\n文件中引用的此类暴力的一个先例是米卡·约翰逊(Micah Johnson)的案例，他在2016年7月反对警察暴力的抗议活动中杀害了5名达拉斯警察。这份文件可疑地将他描述为“黑人至上主义极端分子”。事实上，约翰逊是单独行动的，他参与了联邦调查局所称的“黑人身份极端主义”组织，包括搜索和点赞Facebook页面。\n在明尼阿波利斯，这些机构密切监控被报道为黑人极端分子的各种个人的活动。例如，一份报告指出，5月31日，一个“出于种族动机的黑人暴力极端主义”组织的成员“计划前往明尼阿波利斯的政府中心”。这份日期为5月30日的文件警告称，来自一名“联邦合作伙伴”的“可靠信息”称，“明尼阿波利斯的一名黑人分离主义组织领导人”持有武器，曾参加过密苏里州弗格森的示威活动，而且“很可能是暴力分子”。\n虽然尚不清楚“联邦合作伙伴”指的是哪个机构，但正如截获调查显示的那样，FBI之前曾对不同的团体和个人使用过“黑人分离主义者”、“出于种族动机的黑人暴力极端主义分子”和“黑人身份极端主义分子”等有问题的标签。然而，没有一个主要的黑人活动组织被证明对美国公众构成重大暴力威胁。\n被称为Antifa的反法西斯运动也受到了特别的审查。5月30日的一份文件中描述的来自一名“联邦合作伙伴”的情报显示，明尼阿波利斯的第四分局可能成为暴力的目标，这显然是基于“总防御委员会(GDC)”一名领导人在社交媒体上发布的一篇帖子。该文件称该委员会为“安提法的一个分支”。Antifa不是一个组织，而是一个范围广泛的无领导运动。这名官员可能指的是世界防总委员会的产业工人，该委员会确实认为自己是反法西斯的。\n多机构指挥中心(Multi-Agency Command Center)6月1日的一份报告警告称，“Antifa将利用车载简易爆炸装置(VBIED)对国民警卫队和执法机构发动袭击。”该报告还援引了一名联邦合作伙伴收集的情报。它接着说：“这些车辆将挂上虚构的车牌。”事实证明，这些警告是没有根据的。没有证据表明，在明尼阿波利斯的抗议活动中，有任何组织使用汽车炸弹袭击军事或警察目标。\n文件显示，执法机构还监控了右翼和白人至上主义团体。引用的大部分证据显然来自互联网，但警长办公室6月4日发布的一份公告指出，有人发现“‘Boohajideen’的成员声称保护明尼阿波利斯北部历史悠久的黑人社区。”Boohajideen是一个与Boogaloo运动相关的术语。两份文件记录了据称白人至上主义者雅利安牛仔的存在。6月1日的一份报告称，明尼阿波利斯地狱天使据称从明尼苏达州北部带来了“大约75名”雅利安牛仔到明尼阿波利斯进行保护。几天后的一份报告指出，一名消息人士声称，具有明显白人至上主义观点的摩托车帮派成员讨论了“冒充安提法成员煽动骚乱”，并补充说，这些人“实际上冒充安提法成员参与了内乱”。\n在接下来的几周里，随着全国各地的抗议活动继续进行，警方对抗议者的暴力行为有所增加。在明尼阿波利斯，警察向一名失去眼睛的摄影师发射了一颗橡皮子弹，并从行驶中的车辆上向非暴力示威者喷洒胡椒。哥伦比亚广播公司新闻报道，抗议活动发生后，全美至少有40起警察暴力诉讼。\n然而，明尼苏达州的执法部门仍然专注于对警察的威胁。在抗议活动的第二周，明尼苏达融合中心分发了一份附录，列出了美国各地官员的伤亡情况，并要求各机构分享更多事件。没有关于抗议者、媒体和旁观者在试图控制人群的警察手中遭受的无数伤口的相应数据。\n明尼阿波利斯泄露的文件充斥着可能永远无法核实的谣言。他们警告说，“一辆满载携带AR-15的德克萨斯居民的卡车”和“满载着来自芝加哥的人的大巴”驶向抗议区域。他们还举了几个反应过度的生动例子。“据报道，明尼阿波利斯市中心的一个停车坡道上有一辆租来的车，车内有佛罗里达州的车牌和无线电设备，”警长办公室的一份新闻稿写道。“安保人员后来证实，它属于一个住在酒店的媒体工作人员。”\n另一份来自5月30日的报告指出，附近警察局的警察“与来自威斯康星州的个人取得了联系”。根据这份文件，该组织本来是在去抗议的路上，但后来改变了主意：“各方表示，他们临阵退缩，决定回家。”", "note_en": "Newly leaked documents reveal that, in the wake of George Floyd’s killing, local and federal law enforcement agencies repeatedly told police in Minnesota that they were under attack. The fears stoked by the warnings appear to have set the stage for the police’s escalating, violent response to the protests, including the  widespread  use of tear gas,  percussion grenades, and rubber bullets, sometimes fired at close range.\n The documents show that law enforcement leadership warned of potential threats from antifa and “black racially motivated violent extremists,” as well as vaguely described social media users. Federal and local agencies collected intelligence drawn from private online messaging groups and Slack channels, according to the documents. The agencies also tracked Facebook RSVPs to peaceful protest events, including a suburban candlelight vigil.\n The window into the police’s internal memos came thanks to a trove of documents called Blueleaks, which were published on the website  Distributed Denial of Secrets. The site’s founder told  Wired that the documents came from the hacking collective Anonymous, or someone claiming to be affiliated with the group. Government officials whose files appeared among the documents told the Intercept they were “illegally obtained,” but no questions have been raised about their authenticity. The documents on Minnesota are from a host of local and federal law enforcement agencies and coordinating offices that worked to share information between them.\n While the documents reveal concern over groups with a professed commitment to unrest, like the far-right group Boogaloo, they also suggest a tendency to categorize standard protest behavior as a threat to police. For instance, a May 28  document from the Minnesota Fusion Center, a post-9/11 body that coordinates among various law enforcement agencies, warned that police should look out for a dizzying array of suspicious behaviors, including people possessing balloons or bike locks and wearing masks — a description that includes many of those who took to the streets during the pandemic.\n  Similar warnings were issued in other parts of the country. A May 29  briefing from the Joint Regional Intelligence Center, which coordinates federal, state, and local intelligence in the Los Angeles area, said that protesters might use “Black Bloc Tactics” involving “collective, frequently violent action.” Though some examples of these tactics offered in the document would constitute crimes, others were entirely lawful and widespread activities like monitoring police scanners and communicating over encrypted apps to direct “ground movement.”\n The documents also warn of a number of impending events that apparently never came to pass. A May 30  update from the Multi-Agency Command Center, a temporary coordinating agency under the Minnesota Department of Public Safety that was activated on May 29, mentioned “unconfirmed reports of the possibility of affluent neighborhoods and areas outside of the immediate metro being targeted.” Other warnings were hazy: A command center  update, also from May 30, described “unconfirmed reports of extremist group activity in Minnesota related to civil unrest.” A spokesperson for the Minnesota Department of Public Safety declined to comment, adding, “We will not respond to questions based on illegally obtained documents.” The Multi-Agency Command Center ended its operations on June 7.\n Some of the substantial property damage in the Twin Cities in the days following George Floyd’s killing was indeed directed at law enforcement, with the Minneapolis Police Department’s Third Precinct burned to the ground and various police vehicles vandalized. But, though there were  reports of rocks being thrown at officers, an incident of  shots fired at a police car, and scattered law enforcement injuries during the protests, even a  list distributed by the Multi-Agency Command Center of nationwide officer injuries and deaths during the protests includes no examples from Minnesota.\n Unjustified fear has long played into abuse in policing. “Since they know that they are hated, they are always afraid,” James Baldwin  wrote of the police in The Nation in 1966. “One cannot possibly arrive at a more surefire formula for cruelty.” According to Dan O’Flaherty and Rajiv Sethi’s book “ Shadows of Doubt: Stereotypes, Crime, and the Pursuit of Justice,” undue security service fears based on errant information have historically contributed to police killing and injuring civilians.\n The anxiety that pervades the leaked documents from Minneapolis seemed to be reflected in the extreme police reaction throughout the days that followed, as protests spread across the country. In Minneapolis, the police and other security services were accused of undertaking confrontations with demonstrators and residents alike, including  advancing on peaceful protests using “ less-lethal” munitions and tear gas, and  attacking on-lookers standing on their own porch.\n “In the weeks since Floyd’s death, we have seen many videos and pretty well substantiated reports of unjustified police use of force, including several questionable homicides,” said O’Flaherty. “These incidents make you scratch your head. ‘What were they thinking? They knew the whole world was watching.’ The most cogent explanation is fear.”\n  The warnings began soon after Floyd’s death. On May 27, the day before Minneapolis’s Third Precinct burned, the Minnesota Fusion Center published a  bulletin titled “Possibility for Increased Threatening Activity towards Law Enforcement and Government Officials following Worldwide Coverage of Minneapolis In-Custody Death.” At that point, the protests in Minneapolis had been overwhelmingly peaceful. But the document described “threats directed toward the four MPD” officers involved in Floyd’s killing — including the publishing of personal details about two of the officers online.\n The bulletin urged all employees of the Minneapolis Police Department, including administrative staff, to look for suspicious people and vehicles and to “consider varying travel plans to avoid surveillance.” As further evidence that police were in danger, the dispatch offered examples of property damage, including photos of a vandalized police squad car and a broken police station window, as well as a threatening tweet sent to the Minneapolis Police Department’s Twitter account. “While recent online chatter specifically discusses targeting the four MPD officers, individuals may seek to harm any law enforcement personnel,” the bulletin stressed.\n    In the days that followed, the Minnesota Fusion Center and the Hennepin County Sheriff’s Office Criminal Information Sharing and Analysis Unit disseminated the RSVP counts for protest-related events, apparently taken from Facebook. “At the time of reporting, 833 people indicated online that they are attending, while 3,300 people appear interested,” read a  note about a protest event titled  “Justice 4 George Floyd — Stop Police Crimes — Free Them All.”\n “I’m laughing because we know they’re monitoring us,” said Sam Martinez, a spokesperson for one of the organizations that planned the event, the Twin Cities Coalition for Justice 4 Jamar. Martinez estimated that 5,000 people attended and said organizers had not heard of any violence taking place, adding that the monitoring was “ridiculous.”\n The documents make clear that, in some cases, law enforcement had visibility into private communications. A  dispatch from the Hennepin County Sheriff’s Office on June 1 described a “private social media chat app post” that advocated targeting National Guard soldiers. According to the police document, the post claimed that members of the National Guard are “easy targets who are barely trained at all.”\n Other intelligence disseminated in the reports was gleaned from Slack. A June 6  report from the Multi-Agency Command Center contended that “a revolutionary anti-capitalist group” in Minneapolis had collected details on law enforcement’s whereabouts, adding that the group’s members “used the Slack messaging app to pass intelligence to the Antifa portion of the group.” The information was attributed to the FBI.\n In these two cases, it is unclear whether law enforcement had infiltrated the online groups or were tipped off by a member.\n In another  instance, the FBI received a tip from “a sensitive source with excellent access” about channels on the messaging app Telegram used by protesters to coordinate and “‘keep people safe from police’ during riots.” The document noted that these included “‘announcement channels,’ ‘police scanner channels,’ and ‘chat/coordination channels’ in several cities.”\n And the documents show that the Hennepin County Sheriff’s Office  kept  tabs on RSVPs to even small events favored by families and clergy, such as a  Peace and Prayers BBQ at a church in North Minneapolis and a  candlelight vigil in Maple Grove, a placid suburb. Tanwi Prigge, one of the organizers of the vigil, said that she and her co-hosts had alerted police ahead of time, and that officers had helped direct traffic at the event. (The sheriff’s office declined to comment.)\n  The Multi-Agency Command Center reports, disseminated multiple times each day, include lists of upcoming protests and gatherings across the state. The authors of the reports were self-conscious of the potential for their surveillance to violate the Constitution. “Individuals or groups named in this product have been identified as participating in activities that are protected by the First Amendment to the U.S. Constitution,” a disclaimer repeated on several of the  reports notes. “However, based on known intelligence and/or specific, historical observations, it is possible the protected activity could invite a violent reaction towards the subject individuals or groups, or the activity could be used as a means to target law enforcement.”\n  Much of the anxiety about attacks on law enforcement centered on so-called extremists.  On Saturday, May 30, agencies noted a change in the tone of the protests. “Domestic violent extremists are attempting to structure the protests to target specific symbols of state, local, and federal authority,” a Department of Homeland Security  intelligence note stated. The document went on to say that the department had “high confidence” that  “during the period of darkness from 30 to 31 May the violent protest movements will grow and DVEs” — domestic violent extremists — “and others will seek to take over government facilities and attack law enforcement.”\n One precedent cited in the document for such violence is the case of Micah Johnson, who killed five Dallas police officers during a July 2016 protest against police violence. The document dubiously described  him as a “black supremacist extremist.” In fact, Johnson acted alone and his involvement with what the FBI termed “black identity extremist” groups consisted of him  searching and liking Facebook pages.\n In Minneapolis, the agencies closely monitored the activities of various individuals that the reports framed as Black extremists. One report noted, for example, that members of a “black racially motivated violent extremist” group “planned to travel to the Government Center in Minneapolis” on May 31. The same  document, dated May 30, warned of “credible information” from a “Federal partner” that “a Minneapolis-based leader of a black separatist group” was armed, had participated in demonstrations in Ferguson, Missouri, and was “likely to be violent.”\n    While it is unclear what agency the “Federal partner” refers to, the FBI has previously used questionable labels like “ black separatist,” “black racially motivated violent extremist,” and “black identity extremist” for disparate groups and individuals, as Intercept  investigations have  shown. Yet no major Black activist group has proven to be a significant violent threat to the public in the U.S.\n The anti-fascist movement known as antifa also came in for special scrutiny. Intelligence from a “federal partner” described in a May 30  document suggests that Minneapolis’s Fourth Precinct could be a target for violence, apparently based on a social media post by a leader of the “General Defense Council (GDC),” which the document refers to as “a branch of Antifa.” Antifa is not an organization but rather a wide-ranging, leaderless movement. The officer may have been referring to the Industrial Workers of the World’s General Defense Committee, which does identify as anti-fascist.\n  A June 1  report from the Multi-Agency Command Center warned, “Antifa will utilize vehicle borne improvised explosive devices (VBIEDs) to launch attacks against National Guard and law enforcement agencies,” also citing intelligence collected by a federal partner. It continued: “The vehicles will bear fictitious license plates.” The warnings turned out to be unfounded. There is no evidence that any groups used car bombs against military or police targets during the protests in Minneapolis.\n Law enforcement agencies also monitored right-wing and white supremacist groups, the documents show. Most of the evidence cited apparently came from the internet, but a June 4  bulletin from the sheriff’s office noted that “members of the ‘Boohajideen,’” a term affiliated with the Boogaloo movement, had been spotted claiming to protect historically Black neighborhoods in North Minneapolis. Two documents noted the alleged presence of the white supremacist  Aryan Cowboys. A June 1  report said that the Minneapolis Hells Angels had allegedly brought “approximately 75” Aryan Cowboys from northern Minnesota to Minneapolis for protection. A  report few days later noted that a source claimed motorcycle gang members with apparent white supremacist views had discussed “inciting riots while posing as Antifa members” and added that such individuals “have in fact participated in civil disturbances while posing as Antifa members.”\n  As protests across the nation continued in the following weeks, police violence against protesters mounted. In Minneapolis, officers shot a rubber bullet at a photographer, who  lost her eye, and pepper-sprayed nonviolent demonstrators from their  moving  vehicles. CBS News  reported that at least 40 police brutality lawsuits have been filed across the U.S. in the wake of the protests.\n Minnesota law enforcement, however, remained fixated on threats to officers. In the second week of protests, the Minnesota Fusion Center disseminated an  appendix listing officer deaths and injuries across the U.S., and asked agencies to share additional incidents. No corresponding data about the myriad wounds protesters, media, and bystanders suffered at the hands of police attempting crowd control was included.\n The leaked documents from Minneapolis are filled with rumors that may never be verified. They  warn of a “truck full of Texas residents with AR-15s” and “busloads of people coming from Chicago” headed to the protest area. They also give a few telling examples of overreaction. “A rental vehicle was reported downtown Minneapolis in a parking ramp with Florida plates and radio equipment within,” read a  dispatch from the sheriff’s office. “Security later confirmed it belonged to a media crew staying at the hotel.”\n Another, from May 30,  noted that officers from a nearby police department “made contact with individuals from Wisconsin.” The group had been en route to a protest but had changed their minds, according to the document: “The parties stated they had gotten cold feet and decided to go home.”", "posttime": "2020-06-28 13:05:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "通讯,enforcement,活动", "title": "执法部门清理抗议者通讯，夸大对明尼阿波利斯警察的威胁，泄露文件显示", "title_en": "Law Enforcement Scoured Protester Communications and Exaggerated Threats to Minneapolis Cops, Leaked Documents Show", "transed": 1, "url": "https://theintercept.com/2020/06/26/blueleaks-minneapolis-police-protest-fears/", "via": "", "real_tags": ["通讯", "活动"]}, {"category": "", "categoryclass": "", "imagename": "8879ca030c9c799f6fcca1b201532c2f.png", "infoid": 1008691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管现在我们通常不再经常使用手机打电话，但手机的实际电话部分仍然很重要。谷歌长期以来一直致力于通过自动电话筛选和垃圾邮件检测等功能来减少打电话的烦人。现在，一项新的验证电话功能似乎正在推出，以帮助消费者在接听之前知道企业为什么要打电话给他们。\n根据谷歌的支持页面，验证电话是一项功能，可以帮助用户在接听之前了解更多关于来电的信息。与任何来电都可以由用户发起的来电筛选不同，经过验证的来电只来自通过谷歌审批程序的企业。当从批准的企业发出符合条件的呼叫时，用户将看到企业名称和徽标以及呼叫原因。\n经过验证的呼叫需要企业将呼叫信息发送到安全的Google服务器。然后，该服务器会将信息推送到您设备上的Google Phone应用程序。当实际拨打电话时，该应用程序会对照存储的数据检查呼叫者的信息，以验证来电是否确实来自企业。如果每件事都是合法的，手机应用程序会将电话显示为已验证，并显示企业提供的有用信息。接到电话几分钟后，该信息就会从谷歌的服务器上删除。默认情况下会打开已验证的呼叫，但在手机应用程序中应该有选择退出的设置。不过，它似乎还没有出现。\n接到未知来电可能会引起焦虑，这样的功能有助于缓解一些压力。如果你知道是谁打来的电话，为什么打来，你就能在知情的情况下决定是否要接听电话，以及在接听电话时如何问候来电者。这听起来像是对呼叫体验的独特改进，如果有足够多的企业真正利用它，它可能会被证明是有用的。我们还没有对该功能进行测试，但是在线支持页面建议您现在就可以开始接到验证过的电话。", "note_en": "Even though we don&#39;t generally use our phones for calling as much these days, the actual phone part of your phone is still important. Google has long worked to make phone calls less annoying with features like  automatic call screening and spam detection. Now, it looks like a new Verified Calls feature is rolling out to help consumers know why a business is calling them before they pick up.\n  According to Google&#39;s support page, Verified Calls is a feature that helps users learn more about incoming calls before answering. Unlike call screening, which can be initiated by the user on any incoming call, Verified Calls only come from businesses that have gone through Google&#39;s approval process. When a call that meets the criteria is placed from an approved business, the user will see the business name and logo, as well as the reason for the call.\n  Verified Calls require the business to send call information to a secure Google server. That server then pushes the info to the Google phone app on your device. When the actual call is placed, the app checks the caller&#39;s info against that stored data in order to verify the call is indeed coming from the business. If everything&#39;s legit, the Phone app displays the call as being Verified, and presents the helpful info provided by the business. A few minutes after receiving the call, the information is deleted from Google&#39;s server. Verified Calls will be turned on by default, but there should be a setting to opt-out in the Phone app. Although, it doesn&#39;t seem to be showing up yet.\n Receiving an unknown incoming call can cause anxiety, and features like this help to alleviate some of that pressure. If you know who&#39;s calling and why, you&#39;re able to make an informed decision on if you want to pick up the call, and how you&#39;ll greet the caller when you answer. It sounds like a unique improvement to the calling experience that could prove useful if enough businesses actually take advantage of it. We haven&#39;t been able to test the feature yet, but the live support page suggests you could start getting verified calls any time now.", "posttime": "2020-06-28 12:40:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,google,手机,谷歌,phone", "title": "谷歌的手机应用程序可能很快就会告诉你为什么企业会打电话给你", "title_en": "Google's Phone App May Soon Tell You Why Businesses Are Calling", "transed": 1, "url": "https://www.androidpolice.com/2020/06/25/verified-calls-for-the-google-phone-app-will-let-you-know-why-a-business-is-calling/", "via": "", "real_tags": ["程序", "google", "手机", "谷歌", "phone"]}, {"category": "", "categoryclass": "", "imagename": "ad4c0029107f0a7610ab22253ee4e9bd.png", "infoid": 1008690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特里斯特拉姆·尚迪与汤姆·琼斯这样的下流流浪汉并驾齐驱，进入了18世纪的文学史。但与其他作品不同的是，劳伦斯·斯特恩的创作是一部反小说：它的开头和结尾，整页甚至都不是文字-空白或纯黑，或大理石纹，或充满线条和漩涡，表明叙事的任性形状(在这样的时刻，斯特恩真正的身份似乎是一个具体的诗人)。当作者不想让你知道他说的是什么淘气的事情时(尽管他辞去了部长一职去写作，斯特恩仍然是一个谦虚的人)，那里有一堆起伏的星号。通过这种方式-以一种疯狂而又坚持不懈的谈话方式解释-你会得到你手中的书是活的，它会变成他想要的任何异想天开的该死的方式。劳伦斯·斯特恩是一个有趣的人，这部作品有一种毁灭性的临场感。\n尚德的崇拜者包括卡尔·马克思、托马斯·杰斐逊、詹姆斯·乔伊斯、歌德、弗吉尼亚·伍尔夫和大卫·福斯特·华莱士。所有的小题大做都是因为在英国文学的早期，有一位暴发户牧师嘲笑写作的行为，换言之，他是在嘲笑生活本身。在这两个方面对我来说都是这本书的天堂。\n然而，在崔斯特瑞姆·尚迪狡猾的形式挑战本质中-关于这本书是否是一本小说-仍然没有达成一致意见这一明目张胆的主题可以被不同地识别为阉割焦虑、(受伤的)男性气概、阳痿、对女性生殖器和权力的恐惧，以及对被戴绿帽子的预期，甚至是事实。而且有点无动于衷。一位评论家指出，在崔斯特瑞姆·尚迪中，每个男性都是阳痿，包括结束故事的城市公牛。\n这个故事有点像这样。有一天，崔斯特瑞姆的父亲什么都不想，他的母亲打断了她的丈夫，提醒他给钟上发条--尚迪(作者)断言，这就是一切问题的根源。他移动(s-l-o-w-l-y)到自己出生的那一刻。\n崔斯特瑞姆的母亲想要一名助产士，而她的丈夫更喜欢他的伙伴斯洛普医生，因为他希望自己的孩子通过剖腹产的方法分娩，这样他就可以从侧面进入生活。出生的下降因素，即顺着产道顺着阴道而下，让沃尔特·尚迪感到不安。妇女被认为仅仅是儿童的载体。特里斯特瑞姆打趣说，“尚迪家族自始至终都有一个独一无二的性格：--我是说男性，--女性根本没有性格。”\n这里的许多被排挤在外的女性都是坚定的机动车。虽然坚持认为Tristram Shandy的价值当然是写作，是(第一次见作者？)。在写作活动中嬉戏，我认为有一种方式可以同时看待斯特恩对女性的具体蔑视。写一个自我很大程度上意味着生下你自己。所以这里的意思是，你只是把有问题的女人放进书里，你的男人子宫。我很高兴弄清楚了这一点。因为我认为这种早期的“人生写作”的主要或次要目的是向工作中的女性发起战争，并取得胜利。\n年轻的尚迪在往窗外撒尿时无意中接受了割礼(在女佣的建议下，然后腰带掉了下来)，失去了他的迪克尖。崔斯特瑞姆的叔叔托比·尚迪是九年战争的老兵，他和他的下属特里姆下士一直在尚迪庄园里玩战争游戏。他们的事业不时被不断重申托比叔叔腹股沟战伤的事实所打断。抓住他的听众：“是的，夫人，这是因为在纳穆尔围城时，一块石头从角架的栏杆上被一颗球砸断了，完全砸在了我叔叔托比的腹股沟上。-这会对它产生什么影响？夫人，这故事讲得又长又有趣；--不过，把我的历史告诉您，简直是胡说八道。“。事实上，我们有数百页的内容，加起来只不过是18世纪的创伤后应激障碍，表现得不假思索和无情。\n在他的欧洲之旅期间，崔斯特瑞姆与女人发生了性关系，但什么也没有发生。它既是一种反作剧，也是一种反嬉戏。他勤奋地翻着书页，你会真切地感受到所有的书页。劳伦斯·斯特恩受过充分的古典文学教育，特里斯特拉姆和他父亲的话不出所料地被一句希腊名言或一句拉丁文名言装饰化--原文中有大量的脚注。在大流行期间，阅读它可能会感觉像是和某人一起在监狱里，或者在一个非常小的公寓里，但然后你开始玩文字游戏，无论是近距离的还是远距离的，在那个接近的音调，你会发现你的天堂。\n首先，这是它的时间。这本书的第一卷于1759年出版。读到这样一本美国独立战争前的日常书，不知何故让我兴奋不已。他很有名气，但我现在也是。斯特恩距离莎士比亚只有两百年之遥，语言也同样曲折曲折。它是以这样的花体字节奏进行的，但他经常把它的话含在嘴里很长一段时间，这是对这种早期英语的诗意品味，在18世纪的一个如此缓慢的日子里。当我在书的内部移动(花了大约四个月的时间)时，我很享受在电脑上搜索旧单词和短语的解脱，这让我找到了“certes”-为什么我们不再这么说了？意思是“当然可以。”感觉就像“手提箱”事物是“水轻的”；女人当然是“triticale”，意思是陈腐的、陈腐的。不过，我不知道如果女性几乎不在谈话中，她们怎么会感到疲倦。更像是听觉迟钝或重听，就像凯利·赖哈特(Kelly Reichardt)的“米克的断头台”(Meek‘s Cutoff)中的那些因为戴着该死的帽子而耳部痛苦的女人。\n然而，正如尚迪兴高采烈地说的那样：“我的方式永远是向好奇的、不同的调查领域指出，在我讲述的事件的第一个春天到来。”简单地说，这就是这本书的趣味性和特殊性。他从头开始，甚至在它之前，然后他尽可能长时间地徘徊，把思想和时间的头发分开，拿起这把人类(男性)的剃须刷，仔细盯着每一个部分，弯曲它，弄湿它，让语言自由地向每个方向弹来弹去，就像你所做的，知道的和经历的一样-也许是唯一的无机的，但又奇怪地活着的东西，这种病毒，语言，这位牧师在那里找到了他的霸道讲坛。\n在本书接近尾声的时候，托比叔叔期待着与寡妇沃德曼结婚，后者像农民一样按摩和检查托比家的公鸡和蛋蛋附近的东西，看看那里有什么，它起作用了。这个过程令人兴奋，每个人都参与其中，但结果尚不清楚。\n艾琳·迈尔斯(Eileen Myles)是一位诗人、小说家和艺术记者，她关于写作的长篇文章将于今年秋天由耶鲁大学出版社出版。", "note_en": "TRISTRAM SHANDY sailed into eighteenth-century literary history alongside such bawdy picaresques as  Tom Jones. But unlike the rest Laurence Sterne’s creation is an antinovel: It starts and stops, has entire pages that aren’t even text—blank or solid black or marbled or filled with lines and swirls that indicate the wayward shapes of the narrative (at such moments it seems like what Sterne really is is a concrete poet). On the occasions when the author doesn’t want you to know what naughty thing he’s saying (though he quit being a minister to write, Sterne was still a modest man) there are heaving piles of asterisks. By such means—explained in an insanely arch but persistently conversational manner—you get that the book in your hands is alive and it will turn any whimsical damn way he wants. Laurence Sterne is a funny guy and there is a devastating presentness to this work.\n The list of Shandean admirers includes Karl Marx, Thomas Jefferson, James Joyce, Goethe, Virginia Woolf, and David Foster Wallace. All the fuss is because so early on in English literature there was this upstart minister laughing at the act of writing and metonymically he’s laughing at life itself. And it’s the heaven of this book for me on both counts.\n Yet in the midst of  Tristram Shandy’s wily form-defying nature—there’s still no agreement as to whether the book is a novel at all—there is this blatant subject matter that can be variously identified as castration anxiety, (wounded) masculinity, impotence, fear of female genitalia and power, and an anticipation of, or even the fact of, being cuckolded. And kind of not minding it. One critic pointed out that every male is impotent in  Tristram Shandy, including the town bull who ends the story.\n The story is somewhat this. Tristram’s father is thinking of nothing one day and his mother interrupts her husband to remind him to wind a clock—and that, Shandy (the author) asserts, is the source of the problem with everything. He moves (s-l-o-w-l-y) to the moment of his own birth.\n Tristram’s mother wants a midwife, and her husband prefers his buddy Dr. Slop because he wants his child delivered by the cesarean method so he can enter life sideways. The descent factor of birth, that one comes down the birth canal and through the cunt, is disturbing to Walter Shandy. Women are considered mere vectors of children. Tristram quips that “the Shandy Family were of an original character throughout:—I mean the males,—the females had no character at all.”\n The sidelined lot of women here is adamantly vehicular. While maintaining that the value of  Tristram Shandy is, of course, the writing, the experience of seeing an author (for the first time?) frolicking inside the act of writing, I think there’s a way to look at Sterne’s specific contempt for women simultaneously. Writing a self pretty much means giving birth to yourself. So what that means here is that you just put the problematic woman inside the book, your man-womb. I’m delighted to have figured this out. Because I think the primary or secondary purpose of this early “life writing” is to wage war against women inside of the work and win.\n Young Shandy is inadvertently circumcised while pissing out a window (on the advice of a maid and then the sash fell), losing the tip of his dick. Tristram’s uncle Toby Shandy, a veteran of the Nine Years’ War, is perpetually playing war games on the Shandy estate with his underling Corporal Trim. Their enterprise is punctuated by the constant reiteration of the fact of Uncle Toby’s war wound to the groin. Catch his audience: “Yes, Madam, it was owing to a blow from a stone, broke off by a ball from the parapet of a hornwork at the siege of Namur, which struck full upon my uncle Toby’s groin. —Which way could that affect it? The story of that, Madam, is long and interesting;—but it would be running my history all upon heaps to give it you here.” And indeed we have hundreds of pages of what adds up to nothing more than eighteenth-century PTSD performed thoughtlessly and relentlessly.\n During his travels to Europe, Tristram has escapades with women but nothing happens. As well as being an antinovel it’s an anti-romp. Diligently he turns pages out, and you really feel all those pages. Laurence Sterne was amply educated in the classics, and Tristram’s and his father’s utterances are predictably ornamentalized by a Greek quote or a Latin quote—there are footnotes galore in the original language. Reading it can feel like being in prison with someone or being in a very small apartment during a pandemic, but then you begin to play word games both near and afar, and at that pitch of closeness you find your heaven.\n For one thing it’s the when of it. The first volumes of the book were published in 1759. It thrills me somehow to be reading such a daily book from before the American Revolution. He’s in the air of it but now so am I. Sterne was only two hundred years away from Shakespeare and the language has the same sinuosity. It’s conducted at such a curlicue pace, but he often holds the words of it in his mouth for a long while, and it’s a poetic savoring of this earlier English language on such a slow day in the eighteenth century. I enjoyed the relief of searching the old words and phrasings on my computer as I moved (it took me about four months) through the interior of the book, which led me to “certes”—why don’t we say that anymore? It means “certainly.” It feels like “totes.” Things are “water-landish”; women of course are “triticale,” meaning trite, hackneyed. Though I don’t know how women even get tired if they are barely in the conversation. More like dull or hard of hearing, like the women in Kelly Reichardt’s  Meek’s Cutoff who are aurally afflicted because of those damn bonnets.\n And yet as Shandy gleefully puts it: “My way is ever to point out to the curious, different tracts of investigation, to come at  the first springs of the events I tell.” Which simply put is the delight and the specialness of this book. He begins at the beginning, he even precedes it, and then he wanders about for as long as humanly possible, dividing hair upon hair of thought and time, taking this shaving brush of being human (male) and staring closely at each part, bending it, wetting it, letting language freely flick in every direction as what you do and know and experience—being perhaps the only inorganic and yet strangely alive thing, this virus, language, and this minister found his bully pulpit there.\n Back at Shandy Hall toward the end of the book, Uncle Toby anticipates marrying the Widow Wadman, who massages and inspects, farmer-like, the neighborhood of Toby’s cock and balls to see what’s there and does it work. The process is titillating, everyone’s involved, but the results are unclear.\n  Eileen Myles is a poet, novelist, and art journalist whose book-length essay about writing, For Now , will be out from Yale University Press this fall.", "posttime": "2020-06-28 12:39:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "喜剧,heirs,尚迪", "title": "继承人的喜剧：在崔斯特瑞姆·尚迪的禁锢中瞥见天堂", "title_en": "Comedy of Heirs: Catching a glimpse of heaven in the confines of Tristram Shandy", "transed": 1, "url": "https://www.bookforum.com/print/2702/catching-a-glimpse-of-heaven-in-the-confines-of-tristram-shandy-24029", "via": "", "real_tags": ["喜剧", "heirs", "尚迪"]}, {"category": "", "categoryclass": "", "imagename": "f79cb4a364ab10c4689b71641cf3cefe.jpg", "infoid": 1008689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在为防止冠状病毒传播而被关在家里数月后，过去几周，数以千计的人走上街头，抗议警察杀害黑人和数十年的系统性种族主义。这些集会让一些人担心冠状病毒感染的激增-但他们也得到了一些公共卫生专家的辩护，他们认为种族不公正本身就是一个重大的公共健康威胁。\n冠状病毒在户外传播的风险可能较低，许多抗议者一直戴着口罩。但一些专家指出，风险仍然存在-特别是考虑到警方和抗议者之间的密切互动，催泪瓦斯和胡椒喷雾等刺激粘膜的化学物质的使用(导致撕裂、流鼻涕和咳嗽)，以及被捕抗议者被围困在拥挤的面包车和牢房里。\n到目前为止，没有太多证据表明抗议活动导致冠状病毒感染激增。哈佛大学公共卫生学院(Harvard T.H.Chan School Of Public Health)流行病学副教授卡罗琳·巴克基(Caroline Buckee)表示，抗议活动导致的任何病例的增加，都很难与各州总体上重新开放的事实分开。“科学美国人”采访了Buckee，谈到了抗议活动带来的风险，追溯到抗议活动感染的难度，以及如何在行使民主权利的同时保持安全。\n有没有可能说出感染人数的激增是由于抗议活动，还是其他限制的放松？抗议活动是在(各州)重新开放的背景下发生的。在一些州，我们几乎已经回到了通常的流动性水平。当然，我们有阵亡将士纪念日周末，我们知道它吸引了很多人出来，以增强传播的方式混杂在一起。在我们看到(冠状病毒病例)增幅最大的许多州，如亚利桑那州和佛罗里达州，事实上，在抗议之前，人们就已经开始四处走动和互动了。因此，要理清直接由抗议活动引起的案件与仅仅开放社会的案件有些困难。\n(此外)抗议者一般都很年轻。这意味着他们中的许多人不会有症状，或者会有足够轻微的症状，以至于他们不会去卫生保健机构，所以[这些病例就不会被记录下来]。这意味着他们中的许多人不会出现症状，或者症状足够轻微，以至于他们不会去医疗机构就诊，所以[这些病例]就不会被记录下来。正在住院并死于COVID的人是老年人和患有合并症的人。因此，抗议活动或任何此类集会的影响，无论是阵亡将士纪念日周末还是刚刚重新开放，可能需要一段时间才能接触到将出现在医院的老年人和其他不健康的人群。\n抗议会带来什么风险？我们知道，人们挤在一起会有传播的风险，当然，虽然呆在外面比呆在里面要好，而且很多抗议者确实努力保持社交距离，戴上口罩。尽管如此，我们认为有很多东西传播的风险很高。其中一些事情是对抗议活动的回应，比如挤在面包车里，挤在监狱里，催泪瓦斯等等。那么，抗议活动是否存在风险呢？我会说，“是的。”我认为这将对传播产生什么影响还有待观察。\n有趣的是，在纽约，我们还没有看到病例大幅上升-但可能只是在传播和[新]病例以及症状和住院之间存在一段时间间隔。[编者按：纽约市卫生部的一名代表表示，目前还没有与抗议活动相关的冠状病毒感染人数的数据，但他指出，那些参加抗议活动的人有资格在城市周围的一些中心接受检测。]。我确实认为，就人们正在承担的风险而言，抗议权利是一个重要的功能。就像我们优先考虑重要的工作人员一样，我们也应该优先考虑民主的基本功能。因此，我个人支持抗议背后的想法，尽管我确实认为将很多人聚集在一起会有一些风险。\n抗议者在很大程度上权衡了多种健康风险，包括在美国身为黑人的健康风险。想必，考虑到许多抗议活动背后的组织都强调社会距离和戴口罩，我们有理由认为，许多抗议者意识到了风险，并将积极努力防止传播给年迈的亲戚和朋友。\n有报道称，警察自己并不总是戴口罩。这会给抗议者带来风险吗？是的，如果我们首先假设抗议权利是我们民主的一项基本职能，而警察的职能是保护人民，那么警察的职能就是保护行使民主权利的抗议者。因此，[警方]绝对应该确保他们控制抗议的政策不会加剧传播，[确保]他们自己也在采取预防措施，包括戴口罩。所有这些做法，比如把人关进监狱，把人挤在一起-这些都是不负责任的。\n如果人们在外面，而且彼此不在几英尺之内，你认为口罩在保护人们方面有多有效？面具是很难对付的。关于[他们]的科学证据有限。没有真正有力的数据，而且有很多数据是关于面膜在临床环境中的使用情况，而不是在社区环境中的使用情况。话虽如此，我认为总体来说，戴口罩的建议是一个好的建议，因为我们有足够的似是而非的机械理由认为口罩在防止飞沫传播方面是有用的。所以我认为口罩加上社交距离是一个很好的总体策略。\n你如何建议那些可能考虑参加抗议的个人评估自己受到新冠肺炎的风险？这真的很棘手，每个人都必须权衡自己的风险和平衡。我认为，如果你的家庭中有年迈的父母或年迈的亲戚非常脆弱，那么你可能会认真考虑你可以采取的所有措施，(包括)在抗议活动后接受检测，或者在你参加抗议活动以保护他们之后与他们隔离。在你自己的家庭结构中考虑你自己的社交网络是重要的第一步。当你参加抗议活动时，除了你自己，你还会让谁处于危险之中？然后，当然，尽可能多地采取预防措施，提前做一些研究，找出你要走的路线，以及所有这些事情。大多数(领导抗议的)组织已经就抗议期间的实际行为发布了相当明确的指导方针，包括社交距离和戴口罩等。\n我认为，[黑人生命也是命]抗议(The Black Lives Matter)抗议活动和反封锁抗议活动之间有着截然不同的区别，前者围绕社会距离和口罩发出明确的信息，后者明确反对公共卫生措施--它们鼓励人们不要戴口罩，也不要与社会保持距离。有意识的信息确实很重要。\n如果人们参加了抗议活动，他们是否应该接受新冠肺炎的检测？绝对一点儿没错。重要的是要记住，你必须等待几天(在接受检测之前)，因为病毒载量需要几天的时间才能增加到足够的程度，检测才能检测到它。所以，不要第二天就去考试，要在三到四天后去考试。\n点击此处阅读更多有关冠状病毒爆发的信息，请点击此处。并在这里阅读我们最新的国际杂志网络的报道。", "note_en": "After months of being cooped up at home to prevent the spread of coronavirus, people have taken to the streets by the thousands over the past few weeks to protest against police killings of Black people and decades of systemic racism. The gatherings have some people worried about a spike in coronavirus infections—but they have also been defended by some public health experts, who argue that racial injustice is itself a major public health threat.\n  The risk of transmitting coronavirus is likely lower outdoors, and many of the protesters have been wearing masks. But some experts note there is still risk—especially given the close interactions between police and protesters, the use of chemicals such as  tear gas and pepper spray that irritate the mucous membranes (causing tearing, runny noses and coughing), and the corralling of arrested protesters in crowded vans and jail cells.\n  There is not much evidence that the protests have caused spikes in coronavirus infections so far. And any increase in cases from the protests would be hard to separate from the fact that states are reopening in general, according to Caroline Buckee, an associate professor of epidemiology at the Harvard T.H. Chan School of Public Health.  Scientific American spoke with Buckee about the risks posed by protesting, the difficulty of tracing infections back to the protests, and how to stay safe while exercising one’s democratic rights.\n    Is it possible to tell whether a spike in infections was due to the protests, or the relaxation of other restrictions? \rThe protests have occurred against the backdrop of [states] reopening. In some states, we&#39;re already almost back to kind of usual levels of mobility. And of course we had the Memorial Day weekend, which we know brought a lot of people out and mixing in ways that would enhance transmission. In many of the states where we&#39;re seeing the largest increases [in coronavirus cases], such as Arizona and Florida, in fact, people were starting to move around and interact before the protests. So, it&#39;s somewhat difficult to disentangle cases directly arising from the protests versus just opening up of society in general.\n  [In addition] the protesters are generally young. And that means that many of them won&#39;t have symptoms, or will have symptoms that are mild enough that they don&#39;t go to a health care facility, so then [the cases wouldn’t be recorded]. The people who are being hospitalized and dying of COVID are elderly people and those with comorbidities. So the impact of the protests—or of any of these gatherings, whether it&#39;s Memorial Day weekend or just reopening—it might take a little while to reach the people who will show up at the hospital who are elderly and otherwise unhealthy populations.\n  What are the risks posed by protesting? \rWe know that people crowding together is a risk for transmission, although being outside is better than being inside, of course, and a lot of the protesters did make an effort to social distance and wear masks. Nevertheless there were a lot of things that we think would be a high risk for transmission. And some of those things were the response to the protests, such as being crowded together in vans, being crowded together in jails, tear gas, and so on. So, were there risks associated with the protests? I would say, “Yeah.” I think it remains to be seen what impact that will have had on transmission.\n  It&#39;s interesting that in New York, we haven&#39;t yet seen a massive uptick in cases—but it might just be that there&#39;s a time lag between transmission and [new] cases, and symptoms and hospitalizations. [ Editor’s Note: A representative for the New York City Department of Health said data on the number of coronavirus infections linked the protests was not yet available,  but noted that those who attend protests are eligible to get tested at a number of centers around the city.] I do think that, in terms of the risks people are taking, the right to protest is an important function. And just as we prioritize essential workers, we should prioritize essential functions [of] democracy. So I personally support the idea behind the protests, even though I do think that there is some risk when you bring a lot of people together.\n  The protesters are largely weighing multiple health risks, including the health risk of being Black in America. And presumably, given the emphasis on social distancing and mask wearing by many of the organizations behind the protests, it&#39;s reasonable to assume that many of the protesters are aware of the risks and would be actively trying to prevent spread to their elderly relatives and friends.\n  There are reports that police themselves do not always wear masks. Is that a risk for the protesters?  \rYeah—if we start with the premise that the right to protest is an essential function of our democracy, and [that] it&#39;s the function of the police to protect people, then [it follows that] it&#39;s the function of the police to protect protesters who are exercising their democratic rights. So, [the police] should absolutely be making sure that their policies for controlling the protests do not enhance transmission and [that] they themselves are taking precautions, including wearing masks. And all of these practices, such as putting people in jail cells and crowding people together—those are irresponsible.\n  How effective do you think masks are at protecting people if they’re outside and aren’t within a few feet of each other? \rMasks are tricky. The scientific evidence on [them] has been limited. There isn&#39;t really strong data, and a lot of the data that there is is about mask use in a clinical setting, not in a community setting. Having said that, I think generally the recommendation to wear masks is a good one because we have enough plausible, mechanistic reasons to think that they are useful at preventing droplet transmission. So I think masks plus social distancing are a good general policy.\n  How would you advise individuals that might be considering attending a protest to evaluate their risk from COVID-19? \rIt&#39;s really tricky, and everybody has to weigh up their own risks and balances. I think if you are in a household where you have elderly parents or elderly relatives who are very vulnerable, then you may seriously want to consider all the steps that you can take, [including getting] tested after the protest, or quarantining away from them after you&#39;ve attended a protest to protect them. Thinking about your own social network in your own household structure is an important first step. Who are you putting at risk, in addition to yourself, when you attend a protest? And then, of course, taking as many precautions as you can, and doing some research ahead of time to figure out the route you&#39;ll take and all of those kinds of things. And most of the organizations [leading the protests] have put out pretty clear guidelines about actual behavior during the protests around social distancing and wearing masks and so on.\n  I think there&#39;s a stark difference between [the Black Lives Matter] protests, where there&#39;s an explicit messaging around social distancing and masks, and the anti-lockdown protests, which were explicitly against the public health measures—they encouraged people not to wear masks and not to social distance. That intentional messaging does matter.\n  If people have attended a protest, should they get tested for COVID-19? \rAbsolutely. The important thing there is to remember that you have to wait a few days [before getting a test] because it takes a few days for the viral load to increase enough for the test to be able to detect it. So, don&#39;t get the test the very next day, get your test three to four days later.\n  Read more about the coronavirus outbreak   from Scientific American  here . And read coverage from our  international network of magazines here.", "posttime": "2020-06-28 12:19:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,冠状病毒,coronavirus,黑人,抗议", "title": "如何评估“黑人生命也是命”抗议活动中的冠状病毒风险", "title_en": "How to Evaluate Coronavirus Risks from Black Lives Matter Protests", "transed": 1, "url": "https://www.scientificamerican.com/article/how-to-evaluate-coronavirus-risks-from-black-lives-matter-protests/", "via": "", "real_tags": ["病毒", "冠状病毒", "黑人", "抗议"]}, {"category": "", "categoryclass": "", "imagename": "67d471e61ad447f16f594c38e9f3cd25.png", "infoid": 1008688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ars Technica写道：“Charge Communications已请求联邦监管机构允许从明年开始对宽带用户设置数据上限，并向大型在线视频提供商寻求互联费用。”Slashdot的长期读者Proudrooster分享了他们的报告：宪章，不像其他…", "note_en": "\"Charter Communications has asked federal regulators for permission to impose data caps on broadband users and to seek interconnection payments from large online video providers, starting next year,\" writes Ars Technica. Long-time Slashdot reader Proudrooster shares their report:Charter, unlike o...", "posttime": "2020-06-28 11:58:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "收取,video,technica", "title": "Charge寻求FCC许可对视频服务设置数据上限并收取费用", "title_en": "Charter Seeks FCC Permission to Impose Data Caps and Charge Fees to Video Services", "transed": 1, "url": "https://tech.slashdot.org/story/20/06/27/0125215/charter-seeks-fcc-permission-to-impose-data-caps-and-charge-fees-to-video-services?utm_source=rss1.0mainlinkanon&utm_medium=feed", "via": "", "real_tags": ["收取", "video", "technica"]}, {"category": "", "categoryclass": "", "imagename": "35e130f562eb36a2b055491be130674d.jpg", "infoid": 1008687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "支撑着无数硅谷成功故事的是一种商业方法，这种方法将数百万工人视为一次性员工，剥夺了他们正式员工享有的保护，比如雇主支付的医疗保健。将优步司机和DoorDash快递员归类为承包商，为这些公司节省了数十亿美元的成本，并帮助推动了数十亿美元的投资者价值。\n现在，所谓的零工经济公司正在加州的大本营进行一场事关生死存亡的斗争，通过将司机和送餐人员归类为独立承包商，以保持这些成本优势。\n这些公司正在法庭上与一项新的州法律作斗争，该法律对哪些工人可以被视为承包商进行了更狭隘的定义。它的设计在很大程度上是为了遏制优步(Uber)、Insta和其他以低工资或不确定工资剥削工人的公司。\n亏损将意味着新的支出，如工资税、旅行报销、医疗保险和遣散费，并可能使工人能够集体讨价还价，防止票价或工资突然变化。据估计，Lyft和Uber通过不向加州的失业基金缴费，从2014年到2019年节省了超过4亿美元。\n圣地亚哥市检察官玛拉·埃利奥特(Mara Elliott)表示：“他们依赖纳税人首当其冲地承受失业，因为他们没有支付公平的份额。”\n加州立法者和监管机构表示，应用驱动的工作要求使工人有权获得与正式员工相同的福利，如带薪病假、报销费用和医疗保健。今年5月，州总检察长以及圣地亚哥、洛杉矶和旧金山的市检察官起诉优步(Uber)和Lyft，称这两家公司继续将工人归类为独立承包商，是藐视法律。\n现在，他们正在寻求禁制令，以迫使这些公司对劳工进行重新分类，并将于8月份在法庭上进行辩论。旧金山地区检察官本月也以州法律为由，质疑DoorDash对工人的分类方式。\n旧金山市检察官丹尼斯·埃雷拉(Dennis Herrera)说，“这些公司正在为一种实质上剥夺工人权利的商业模式而战。”“他们的商业模式有赖于他们违法。”\n很明显，优步和其他科技公司只是违抗了这项法规，虚伪地辩称这项法律不适用于他们，而且，他们的员工反对这项法律，因为他们会失去随时登录或退出应用程序的灵活性。\n但是，按需公司没有理由不为他们的工人提供基本保护，同时也给予他们灵活的工作时间。而且，在讨价还价中，这些企业将获得谈判条款的能力，这些条款可能包括，比方说，禁止他们的工人为竞争对手的拼车平台工作。\n事实上，这项法律编纂了2018年州最高法院的一项裁决，该裁决要求公司接受三个部分的测试，以证明工人确实是独立的，包括证明工人可以自由为他人工作，他们自主运营，以及他们的劳动力不是公司业务的核心。\n特别是，优步(Uber)在试图解释如何获得豁免时陷入了困境。该公司甚至辩称，司机不是这项业务的核心部分--就好像汽车是自动驾驶的--而且优步“不是一家运输公司”。\n但优步的理由在仔细审查下崩溃了。该公司和其他按需公司一样，规定了汽车工人应该使用什么类型的汽车，应该在何时何地去，以及他们应该如何到达那里。工人们说，这些公司可以在没有通知的情况下改变工资和规则，并将他们踢出应用程序，而没有追索权。\n尽管辩称州法律不适用于他们，但Insta、DoorDash、Lyft、PostMates和Uber总共承诺提供超过1.1亿美元的资金，为加州的一项投票提案提供资金，允许零工经济公司具体分拆，同时保证适度的最低工资和福利。\n这项提案主要是为了保护公司不会为他们的员工军团支付适当的工资，选民们明智的做法是拒绝它。一项研究发现，根据投票提案，在计入司机停机时间和其他费用(如燃料和车辆维护)后，时薪将仅为5.64美元。优步威胁要停止在这个美国最大的州的运营，这是不可信的，特别是在该公司努力克服数十亿年度亏损的情况下。\n这些公司表示，这项法律将迫使他们提价。这应该被视为一个必要的目标。思考零工公司商业模式的一种方式是，它们允许客户从与沃尔玛相同的定价权中受益。每个人只购买少量的低成本劳动力，但总体而言，他们可以向司机口述条款。\n最低工资和福利标准的要点是限制这种市场力量的影响。零工工人需要保护。他们需要政府迫使消费者支付更多的出租车费用。\n美国人愿意在智能手机上大手大脚地花钱。现在，他们也应该在手机带来的人为低薪劳动力上多花一点钱了。\n在冠状病毒大流行期间，全国范围内更新的按需工人分类变得更加紧迫，因为在家避难的订单已经摧毁了叫车行业。自从需求陷入困境以来，主要收入是运送Lyft和优步乘客的工人一直在努力弥补损失的收入。\n零工工人通常没有资格领取失业救济金，在联邦冠状病毒援助计划中获得了一条临时救命稻草-但一些州表示，他们将不得不等待数周才能获得刺激计划的检查(零工经济公司不会代表他们的合同工减免工资税)。随着德克萨斯州和佛罗里达州等州暂停重新开业计划，如果零工工作再次枯竭，按需工人是否能够获得额外的援助尚不清楚。\n在没有严格的雇佣规则的情况下，一些按需公司在大流行期间未能执行一致的安全措施，包括提供足够数量的口罩或社交距离指导，同时推动工人履行越来越多的订单，以跟上不断增长的送餐需求。例如，一些Insta的员工说，他们在为人们购物和递送杂货时，与几十个人有近距离接触。\n当然，点播公司的另一个担忧是，如果其他州在国内输掉了这场战斗，他们可能很快就会追随加州的脚步。纽约州和伊利诺伊州等州提出的立法似乎是明智的，无论加州的结果如何，都应该认真考虑。\n零工经济已经成为我们日常生活的一部分。但工人不应该首当其冲地承受只有当他们被剥削时才有效的商业模式的冲击。\n“泰晤士报”致力于向编辑发表各种信件。我们想听听您对这篇文章或我们的任何一篇文章的看法。这里有一些小贴士。这是我们的电子邮件：Letters@nytimes.com。", "note_en": "The underpinning of countless Silicon Valley success stories is a method of commerce that treats millions of workers as  disposable and deprives them of protections regular employees enjoy, like employer-paid health care. Keeping Uber drivers and DoorDash food couriers classified as contractors saves the companies billions in costs and has helped fuel billions more in investor value.\n Now, so-called gig economy companies are engaged in an existential fight on their California home turf to maintain those cost advantages by keeping drivers and food deliverers classified as independent contractors.\n The companies are in court battling  a new state law that more narrowly defines which workers can be treated as contractors. It was designed in large part to rein in Uber, Instacart and other companies that have exploited their workers with low or uncertain wages.\n A loss would mean new outlays, like payroll taxes, travel reimbursement, health insurance and severance pay, and could empower workers to collectively bargain and forestall sudden fare or wage changes. By one estimate, Lyft and Uber saved  more than $400 million from 2014 to 2019 by not paying into California’s unemployment fund.\n “They are relying on taxpayers to bear the brunt of unemployment since they aren’t paying their fair share,” said Mara Elliott, the San Diego city attorney.\n California lawmakers and regulators say the requirements of app-driven gigs entitle workers to the same benefits as regular employees, such as paid sick leave, reimbursed expenses and health care. The state attorney general and the city attorneys of San Diego, Los Angeles and San Francisco  sued Uber and Lyft in May, saying the companies were flouting the law by continuing to classify workers as independent contractors.\n Now, they are  seeking an injunction to compel the companies to reclassify the laborers and will argue it in court in August. San Francisco’s district attorney, too, challenged DoorDash this month for how it classifies workers, citing the state law.\n “These companies are engaged in a fight to benefit a business model that essentially denies workers their rights,” said Dennis Herrera, the San Francisco city attorney. “Their business model depends on them violating the law.”\n It’s clear that Uber and other tech companies have simply defied the statute, arguing disingenuously that the law doesn’t apply to them and, moreover, that their workers oppose it because they would lose the flexibility of logging into or out of the app whenever they choose.\n But there is no reason the on-demand companies couldn’t provide basic protections to their workers while also granting them flexible work schedules. And, in the bargain, the businesses would gain the ability to negotiate terms that could include, say, barring their workers from working for rival ride-sharing platforms.\n The law, in fact, codifies a 2018 State Supreme Court  ruling that holds companies to a three-part test to prove that workers are truly independent, including demonstrating that workers are free to work for others, that they operate autonomously and that their labor is not central to a company’s business.\n Uber, in particular, has  twisted itself into knots trying to explain how it should be exempt. It has even argued that drivers aren’t a core part of the business — as if the cars drive themselves — and that Uber is  “not a transportation company.”\n But Uber’s reasoning crumbles under scrutiny. The company, like other on-demand firms, dictates what type of car workers should use, when and where they should go and how they should get there.  Workers say the companies can change wages and rules without notice and kick them off the apps, with no recourse.\n While arguing that the state law doesn’t apply to them, Instacart, DoorDash, Lyft, Postmates and Uber have nonetheless committed  more than $110 million collectively to funding a California ballot proposal granting gig economy companies a specific carve-out, while guaranteeing modest wage minimums and benefits.\n That proposal is designed primarily to protect the companies from properly paying for their legion of workers, and voters would be wise to reject it.  One study found that, under the ballot proposal, hourly wages would be a meager $5.64 after factoring in driver down time and other expenses, like fuel and vehicle maintenance. Uber’s threat to halt operations in the nation’s largest state is implausible, particularly as it struggles to overcome  billions in annual losses.\n The companies say that the law will force them to raise prices. That ought to be seen as a necessary goal. One way to think about the business model of gig companies is that they allow customers to benefit from the same kind of pricing power as Walmart. Each person is buying only a little bit of low-cost labor, but collectively, they can dictate terms to the drivers.\n The point of minimum wage and benefit standards is to limit the impact of this kind of market power. Gig workers need protections. They need the government to force consumers to pay more for cab rides.\n Americans are willing to spend extravagantly on their smartphones. Now it’s time they also spent a little more on the artificially low-paid labor those phones have made possible.\n The updated classification of on-demand workers nationwide has taken on added urgency during the coronavirus pandemic as shelter-at-home orders have decimated the ride-hailing industry. Workers whose primary income was ferrying Lyft and Uber passengers have struggled to replace their lost income since demand cratered.\n Normally ineligible for unemployment benefits, gig workers were granted a temporary lifeline in the federal coronavirus aid package — but some states have said they’ll have to  wait weeks for stimulus checks (gig economy companies don’t remit payroll taxes on behalf of their contract workers). And as states  like Texas and  Florida pause their reopening plans, it’s not clear that on-demand workers will be able to get additional aid if gig work dries up again.\n Without strict employment rules, some of the on-demand companies have failed to enforce consistent safety measures during the pandemic, including providing  sufficient numbers of masks or guidance on social distancing, while pushing workers to fulfill an ever greater number of orders to keep up with the rising demand for food deliveries. Some  Instacart workers, for instance, say they come into close contact with dozens of people while shopping for and delivering people’s groceries.\n Another fear for on-demand companies, of course, is that other states could quickly follow in California’s footsteps if they lose the fight at home. Proposed legislation in states  such as New York and Illinois appears sensible and should be seriously considered, whatever the outcome in California.\n The gig economy has become a part of our daily routines. But workers shouldn’t have to bear the brunt of a business model that works only when they are exploited.\n The Times is committed to publishing   a diversity of letters  to the editor. We’d like to hear what you think about this or any of our articles. Here are some   tips . And here’s our email:   letters@nytimes.com .", "posttime": "2020-06-28 11:55:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打车,rides", "title": "优步打车要花更多钱吗？好的", "title_en": "Uber Rides Cost More? OK", "transed": 1, "url": "https://www.nytimes.com/2020/06/27/opinion/uber-covid-gig-economy.html", "via": "", "real_tags": ["打车", "rides"]}, {"category": "", "categoryclass": "", "imagename": "b38ff9144dfbe39c5f0fe73224a0b2a6.jpg", "infoid": 1008685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "考古学家认为，在巨石阵附近发现的一圈大竖井形成了英国迄今发现的最大的史前纪念碑。\n对这些坑进行的测试表明，它们是由新石器时代的人在4500多年前挖掘出来的。\n专家认为，这20个或更多的竖井可能是通往与巨石阵相连的圣地的边界。\n首席研究员文斯·加夫尼(Vince Gaffney)教授表示，竖井和回路的大小在英国是史无前例的。\n1.2英里宽(2公里)的大竖井直径超过10米(30英尺)，深5米(15英尺)，比英国任何可比的史前纪念碑都要大得多。\n一个由圣安德鲁斯大学、伯明翰大学、华威大学、布拉德福德大学、格拉斯哥大学和威尔士大学圣大卫分校的学者组成的团队参与了这个项目。\n这些坑围绕在距离巨石阵2英里(3公里)的杜灵顿墙的古代聚居地周围，是利用遥感技术和采样发现的。\n布拉德福德大学的加夫尼教授说，这一发现证明了新石器时代社区记录他们的宇宙学信仰体系的能力和愿望，其方式和规模是我们以前从未预料到的。\n他补充说，巨石阵周围地区是地球上研究最多的考古景观之一。\n值得注意的是，新技术的应用仍然能导致发现如此巨大的史前建筑。\n当人们第一次注意到这些坑时，人们认为它们可能是自然特征。只有通过地球物理调查，我们才能把这些点连接起来，才能看到大规模的图案。\n加夫尼教授表示，要确定这些坑的确切性质，需要进行适当的挖掘，但研究小组认为，它们起到了边界的作用，可能会将杜灵顿墙标记为一个特殊的地方，或者强调杜灵顿和巨石阵地区的不同。\n他说，很难推测他们需要多长时间才能创造出来，但使用手工石器，生产这种规模的坑将需要相当大的劳动力组织。\n不管怎么估计，这些坑都很大。据我们所知，它们几乎是垂直的；也就是说，我们看不到任何可能暗示着某种竖井的狭窄。一些淤泥表明坑的填充相对缓慢。加夫尼教授补充道，换言之，它们被切开并敞开着。\n圣安德鲁斯地球与环境科学学院的理查德·贝茨博士说，这项研究让我们洞察到一个比我们想象的还要复杂的社会。\n他的同事蒂姆·金奈德(Tim Kinnaird)说，竖井中的沉积物使考古学家能够对过去4000年的巨石阵景观进行详细的叙述。\n英国国家信托基金会的巨石阵世界遗产考古学家尼克·斯纳沙尔博士称赞这一发现是惊人的。\n她说：作为巨石阵建造者生活和宴请的地方，杜灵顿城墙是解开巨石阵更广阔景观故事的关键，这一令人震惊的发现为我们提供了对新石器时代祖先生活和信仰的新见解。\n隐藏景观团队将尖端的考古田野工作与优秀的老式侦探工作相结合，揭示了这一非凡的发现，并在巨石阵景观的故事中谱写了全新的篇章。", "note_en": "A ring of large shafts discovered near Stonehenge form the largest prehistoric monument ever discovered in Britain, archaeologists believe.\n Tests carried out on the pits suggest they were excavated by Neolithic people more than 4,500 years ago.\n Experts believe the 20 or more shafts may have served as a boundary to a sacred area connected to the henge.\n &#34;The size of the shafts and circuit is without precedent in the UK,&#34; said Prof Vince Gaffney, a lead researcher.\n The 1.2 mile-wide (2km) circle of large shafts measuring more than 10m (30ft) in diameter and 5m (15ft) in depth are significantly larger than any comparable prehistoric monument in Britain.\n  A team of academics from the universities of St Andrews, Birmingham, Warwick, Bradford, Glasgow and the University of Wales Trinity Saint David worked on the project.\n The pits surround the ancient settlement of Durrington Walls, two miles (3km) from Stonehenge, and were discovered using remote sensing technology and sampling.\n  Prof Gaffney, of the University of Bradford, said the discovery demonstrated &#34;the capacity and desire of Neolithic communities to record their cosmological belief systems in ways, and at a scale, that we had never previously anticipated&#34;.\n &#34;The area around Stonehenge is amongst the most studied archaeological landscapes on earth,&#34; he added.\n &#34;It is remarkable that the application of new technology can still lead to the discovery of such a massive prehistoric structure.\n &#34;When these pits were first noted, it was thought they might be natural features. Only through geophysical surveys, could we join the dots and see there was a pattern on a massive scale.&#34;\n Prof Gaffney said a &#34;proper excavation&#34; was required to determine the exact nature of the pits but that the team believed they acted as a boundary, perhaps marking out Durrington Walls as a special place, or emphasising the difference between the Durrington and Stonehenge areas.\n  He said it was difficult to speculate how long they would have taken to create, but using manual stone tools, there would have been &#34;considerable organisation of labour to produce pits on this scale&#34;.\n &#34;The pits are massive by any estimate. As far as we can tell they are nearly vertical sided; that is we can&#39;t see any narrowing that might imply some sort of shaft. Some of the silts suggest relatively slow filling of the pits. In other words they were cut and left open,&#34; added Prof Gaffney.\n Dr Richard Bates, from St Andrews&#39; School of Earth and Environmental Sciences, said it had given an insight to &#34;an even more complex society than we could ever imagine&#34;.\n His colleague Tim Kinnaird said sediments from the shafts had allowed archaeologists to &#34;write detailed narratives of the Stonehenge landscape for the last 4,000 years&#34;.\n   Dr Nick Snashall, National Trust archaeologist for the Stonehenge World Heritage Site, hailed the discovery as &#34;astonishing&#34;.\n She said: &#34;As the place where the builders of Stonehenge lived and feasted, Durrington Walls is key to unlocking the story of the wider Stonehenge landscape, and this astonishing discovery offers us new insights into the lives and beliefs of our Neolithic ancestors.\n &#34;The Hidden Landscapes team have combined cutting-edge, archaeological fieldwork with good old-fashioned detective work to reveal this extraordinary discovery and write a whole new chapter in the story of the Stonehenge landscape.&#34;", "posttime": "2020-06-28 11:34:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新石器,neolithic,巨石阵", "title": "巨石阵：圣地附近发现的新石器时代纪念碑", "title_en": "Stonehenge: Neolithic monument found near sacred site", "transed": 1, "url": "https://www.bbc.com/news/uk-england-wiltshire-53132567", "via": "", "real_tags": ["新石器", "neolithic", "巨石阵"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Deno是默认情况下具有安全性的JavaScript/TypeScript运行时。Deno倾向于用更简单、更现代、更安全的运行时替换Node.js。\nDeno构建在V8、Rust和Tokio(Rust异步运行时环境)之上。它的目标是为现代编程世界提供一个高效和安全的脚本环境，Deno就是为您准备的！\n我们的Deno教程是为简单而设计的。我们还有很多例子可以让你参与到游戏中来。\nDeno是一个JavaScript/TypeScript运行时环境，这意味着您可以使用Deno通过编写JavaScript或TypeScript来处理服务器端操作。想一想其他服务器端编程语言可以做的任何事情。\n想一想其他服务器端编程语言可以做的任何事情，然后考虑使用Deno实现安全性、简单性和现代化。\n附带内置工具，可简化代码检查和格式化，包括Deno info和Deno FMT。\n任何人都可以学习Deno，只要您具备JavaScript的基本知识，特别是关于异步/等待的基础知识。\nDeno中的所有异步操作都返回一个承诺。因此，Deno提供了与Node不同的API。\n使用&#34；ES模块，不支持Required()。第三方模块通过URL导入：IMPORT*AS LOG FROM&#34；https://deno.land/std/log/mod.ts&#34；；\n您应该知道Deno是类型脚本代码，标准文件扩展名是.js和.ts", "note_en": "Deno is a JavaScript/TypeScript runtime with security by default. Deno tends to substitute Node.js with a simpler, modern, and more secure runtime.\n Deno is built on V8, Rust, and  Tokio, a Rust asynchronous runtime environment. It aims to be a productive and secure scripting environment for the modern world of programming, Deno is for you!\n  Our Deno tutorial is designed for simplicity. We also have tons of examples to get you in the game.\n     Deno is a JavaScript/TypeScript runtime environment, this means that you can use Deno to process server-side actions by writing JavaScript or TypeScript. Think of anything that other server-side programming languages can do.\n   Think of anything other server-side programming languages can do, then think  security,  simplicity, and  modernization with Deno.\n Ships with built-in tools that make code inspection and formatting easy,  the  deno info and  deno fmt.\n  Deno can be learned by anyone, provided that you have the basic knowledge of  JavaScript especially about  async/ await.\n  All async actions in Deno return a promise. Thus Deno provides different APIs than Node.\n   Uses &#34;ES Modules&#34; and does not support  require(). Third-party modules are imported via URLs:  import * as log from &#34;https://deno.land/std/log/mod.ts&#34;;\n   You should know that  Deno is TypeScript-code and the standard file extensions are  .js and  .ts", "posttime": "2020-06-28 10:33:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教程,deno", "title": "完整的DENO教程", "title_en": "Full Deno Tutorial", "transed": 1, "url": "https://lyty.dev/deno/deno-tutorial.html", "via": "", "real_tags": ["教程", "deno"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008683, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "菱形平方算法", "note_en": "The Diamond-Square Algorithm", "posttime": "2020-06-28 09:34:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,菱形,square", "title": "菱形平方算法", "title_en": "The Diamond-Square Algorithm", "transed": 1, "url": "https://diamond-square.netlify.app/", "via": "", "real_tags": ["算法", "菱形", "square"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008682, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6月4日，该网站注意到NetWalker勒索软件运营商已经将加州大学旧金山分校(UCSF)添加到他们的网站上，在那里他们列出了没有支付赎金要求的受害者的名字。我没想到这所大学会付钱，当时我评论道，“我想知道威胁行为者是否知道加州大学旧金山分校多年来发生了多少次泄漏和泄密事件。他们这次到底为什么要付赎金呢？“。\n当我在6月19日回来查看时，UCSF不再列在NetWalker的网站上，我发现这很有趣。\n昨天，彭博社(Bloomberg)的卡蒂凯·梅赫罗特拉(Kartikay Mehrotra)报道称，加州大学旧金山分校向NetWalker支付了114万美元赎金。该大学昨天还发表了另一份声明：\n正如我们在6月3日披露的那样，加州大学旧金山分校的IT人员在6月1日检测到在加州大学旧金山分校医学院IT环境的有限部分发生了一起安全事件。\n作为一项安全措施，我们隔离了医学院内的几个IT系统，并成功地将事件与加州大学旧金山分校的核心网络隔离开来。重要的是，这件事并没有影响到我们的送病员业务，没有影响到整个校园网，也没有影响到新冠肺炎的工作。\n当我们在攻击发生时阻止了攻击，演员们启动了恶意软件，加密了医学院内的有限数量的服务器，使它们暂时无法访问。从那时起，我们一直在与一家领先的网络安全顾问和其他外部专家合作调查这起事件，并加强我们IT系统的防御。我们预计很快就能完全恢复受影响的服务器。\n我们的调查正在进行中，但目前，我们认为恶意软件对我们的服务器进行了机会主义的加密，没有特定的目标区域。袭击者获得了一些数据，作为他们行动的证据，用于他们要求支付赎金。我们正在继续调查，但我们目前不认为患者的医疗记录被泄露。随着更多事实的了解，我们将提供进一步的更新。\n作为一所服务于公共利益的大学，加密的数据对我们从事的一些学术工作很重要。因此，我们做出了艰难的决定，向恶意软件攻击背后的个人支付了大约114万美元的部分赎金，以换取一个工具来解锁加密的数据，并归还他们获得的数据。\n这起事件反映了世界各地寻求金钱利益的网络犯罪分子越来越多地使用恶意软件，包括最近对高等教育机构的几次攻击。我们继续与执法部门合作，我们感谢大家的理解，即我们在继续调查期间所能分享的信息有限。\n该声明没有解释是否有可用的备份，或者如果没有，原因是什么。\n公开支付赎金可能只会鼓励其他威胁行为者也试图攻击大学，他们的要求也会增加。希望其他大学能紧急加强防御，确保它们有经过测试和有效的备份-而且这些备份也不容易被恶意软件锁定。", "note_en": "On June 4, this site noted that NetWalker ransomware operators had  added the University of California at San Francisco (UCSF) to their website where they name victims who have not paid their ransom demands. I did not expect the university to pay, commenting, at the time, “I wonder if the threat actors know how many leaks and breaches UCSF has had over the years. Why on earth would they pay ransom this time?”\n When I  checked back on June 19, UCSF was no longer listed on NetWalker’s site, which I found interesting.\n Yesterday, Kartikay Mehrotra of Bloomberg  reported that UCSF did pay NetWalker $1.14 million ransom. The university also issued another  statement yesterday:\n As we disclosed on June 3, UCSF IT staff detected a security incident that occurred in a limited part of the UCSF School of Medicine’s IT environment on June 1.\n We quarantined several IT systems within the School of Medicine as a safety measure, and we successfully isolated the incident from the core UCSF network. Importantly, this incident did not affect our patient care delivery operations, overall campus network, or COVID-19 work.\n While we stopped the attack as it was occurring, the actors launched malware that encrypted a limited number of servers within the School of Medicine, making them temporarily inaccessible. Since that time, we have been working with a leading cyber-security consultant and other outside experts to investigate the incident and reinforce our IT systems’ defenses. We expect to fully restore the affected servers soon.\n Our investigation is ongoing but, at this time, we believe that the malware encrypted our servers opportunistically, with no particular area being targeted. The attackers obtained some data as proof of their action, to use in their demand for a ransom payment. We are continuing our investigation, but we do not currently believe patient medical records were exposed. As additional facts become known, we will provide further updates.\n The data that was encrypted is important to some of the academic work we pursue as a university serving the public good. We therefore made the difficult decision to pay some portion of the ransom, approximately $1.14 million, to the individuals behind the malware attack in exchange for a tool to unlock the encrypted data and the return of the data they obtained.\n This incident reflects the growing use of malware by cyber-criminals around the world seeking monetary gain, including several recent attacks on institutions of higher education. We continue to cooperate with law enforcement, and we appreciate everyone’s understanding that we are limited in what we can share while we continue with our investigation.\n The statement does not explain whether there were backups available or if not, why not.\n Going public about paying ransom will likely only encourage other threat actors to try attacking universities, too, and their demands will increase.  Hopefully other universities will urgently harden their defenses and make sure that they have backups that they test and that work — and that are not vulnerable to being locked up by the malware too.", "posttime": "2020-06-28 09:33:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,大学,admits", "title": "加州大学旧金山分校承认向NetWalker支付了100多万美元赎金", "title_en": "UCSF admits it paid NetWalker more than $1M ransom", "transed": 1, "url": "https://www.databreaches.net/ucsf-admits-it-paid-netwalker-more-than-1-million-ransom/", "via": "", "real_tags": ["旧金山", "大学", "admits"]}]