[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1028014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "适用于所有浏览器的数学JavaScript显示引擎。不再为读卡器设置。只是起作用了。\nMathJax提供了一些工具，可以将您的内容从传统的印刷源转换为现代的、可访问的Web内容和ePub。\n无障碍网络和ePub。\nMathJax团队可以培训您的员工如何使用我们的资源准备在线教学材料和创建可访问的STEM内容。\n了解更多。\nMathJax非常灵活，通过创建定制配置和专门的软件工作流程，可以根据贵机构的需求进行定制。\n联系我们。\nMathJax可以帮助您转换遗留来源和打印内容中的数学文档，以及生成在线可供有特殊需求的读者完全访问的新颖内容。MathJax团队可以就在您的机构中实施必要的工作流提供咨询。MathJax还可以在服务器端工作流中使用，以准备可以脱机查看的内容或生成与现代ePub阅读器兼容的文档。可以通过包含替代文本描述或更细粒度的语音注释和盲文来确保可访问性。\nMathJax团队的成员都是各自机构的教授，在教学和研究方面有着长期而成功的记录。我们定期在国际活动中就MathJax的使用及其在线教学的易访问性功能进行演示和研讨会。\nMathJax与大多数学习管理系统兼容。我们可以帮助您将您的数学教材传输到网络上，让您的教师以包容和可访问的方式在线教授数学。\n远程在线考试越来越重要。MathJax可以帮助准备考试材料，这些材料不仅在视觉上是最高质量的，而且还确保所有学生都可以访问这些材料，而不管他们的个人需求如何。\n我们对教师、教职员工进行培训，教他们如何准备完全可用的数学课程材料。培训计划可以根据您和您的听众的具体要求量身定做。我们涵盖了各种主题，包括：将数学文档从LaTeX、Word和PDF等源移植到包含SVG和MathJax的Web格式，\n请与我们联系，了解有关如何将您的教学上线以及我们可以提供的培训计划的更多信息。\nMathJax是一个高度模块化和灵活的系统，可以适应任何应用程序和任何内容的需要：从静态网站到高度动态的环境；从简单的教学讲义到科学出版中的高度复杂的排版。我们可以帮助您为您的环境创建正确的配置，并根据您组织的需求调整MathJax。\n随着版本3.0的发布，MathJax已经转向现代的TypeScript实现。如果您需要有关升级本地安装或内容以使用MathJax v3的建议，请与我们联系。\n我们支持多种字体，并采用技术来调整公式的呈现，以使其在视觉上适合周围的文本。如果您需要特殊的字体或渲染支持，可以将其合并到我们的生产流程中，作为贵组织的扩展或在核心系统中提供。\nMathJax是将传统印刷源转换为可访问的、可上网的内容的重要工具。我们可以建议您哪个工具链最适合您的需求，组装安装，并为您提供定制的MathJax定制。\n我们提供咨询，指导如何调整您现有的网络内容、软件解决方案和工作流程，使视觉和印刷有障碍的用户可以完全访问它们。我们将与您自己的人员合作，确保您的材料完全可访问。\n如果您对MathJax在贵组织中的工作有任何特殊需求，请与我们联系咨询服务事宜。\nMathJax使用带有Web字体或SVG的CSS，而不是位图图像或Flash，因此公式在所有缩放级别下都会随周围文本缩放。\n查看示例。\nMathJax在输入和输出方面是高度模块化的。使用MathML、Tex和ASCIIath作为输入，并生成HTML+CSS、SVG或MathML作为输出。\n尝试现场演示。\nMathJax与屏幕阅读器配合使用&它提供了表情缩放和交互式浏览功能。您还可以将公式复制到Office、LaTeX、Wiki和其他软件中。\n了解更多。\n我们的主页配置为使用MathJax的CommonHTML模式和网页字体来显示公式，从而在不同的浏览器上产生统一的布局和排版。但是，MathJax也可以配置为使用HTML-CSS(用于传统浏览器)、SVG和本地MathML呈现(如果在浏览器中可用)。您可以使用MathJax上下文菜单(通过ctrl+单击/alt+单击/右键单击公式来访问)或下面的菜单尝试各种输出模式。\n\\[X={-b\\pm\\sqrt{b^2-4ac}\\over2a}}\\]\\[f(A)=\\frac{1}{2\\pi}\\oint\\frac{f(Z)}{z-a}dz\\]\\[\\cos(\\theta+\\phi)=\\cos(\\theta)\\cos(\\phi)−\\sin(\\theta)\\sin(\\phi)\\]\\[\\int_D({\\nabla\\cdot。}F)dv=\\int_{\\Partial D}F\\CDOT NDS\\]\\[\\vec{\\nabla}\\Times\\vec{F}=\\Left(\\frac{\\Partial F_z}{\\Partial y}-\\frac{\\Partial F_y}{\\Partial z}\\Right)\\mathbf{i}+\\Left(\\frac{\\Partial F_x}{\\Partial z}-\\FRAC{\\Partial F_z}{\\Partial x}。\\右)\\mathbf{j}+\\Left(\\frac{\\Partial F_y}{\\Partial x}-\\frac{\\Partial F_x}{\\Partial y}\\Right)\\mathbf{k}\\]\\[\\sigma=\\sqrt{\\frac{1}{N}\\sum_{i=1}^N(x_i-\\mu)^2}\\]\\[(\\nabla_xy)^k=X^i(\\nabla_i y)^k。=X^i\\Left(\\frac{\\Partial Y^k}{\\Partial X^i}+\\Gamma_{im}^k Y^m\\Right)\\]。\n在下面的框中键入文本。包含一些数学知识：MathML作为MathML标签，Tex用$...$或$$...$$分隔符(或\\(...\\)和\\[...\\])包装，AsciiMath用`...`分隔符包装。您输入的文本实际上是HTML，因此您可以根据需要包括标记；但这也意味着您必须小心在数学计算中如何使用小于号、与号和其他HTML特殊字符(用空格将它们括起来就足够了)。\n当$a\\ne 0$时，\\(ax^2+bx+c=0\\)有两个解，它们是$$x={-b\\pm\\sqrt{b^2-4ac}\\over 2a}。$$", "note_en": "A JavaScript display engine for mathematics that works in all browsers.  No more setup for readers. It just works.\n MathJax provides tools to transform your content from traditional print sources into modern, accessible web content and ePubs.\n  Accessible Web and EPubs\n  The MathJax team is available to train your staff in using our resources for preparing online teaching material and creating accessible STEM content.\n  Learn more\n  MathJax is highly flexible and can be tailored to the needs of your institution by creating customized configurations and specialized software workflows.\n  Contact us\n  MathJax can help you with the conversion of math documents from legacy sources and print content as well as with the generation of novel content that is online ready and fully accessible for readers with special needs. The MathJax team is available to consult on putting the necessary workflows in place in your institution.    MathJax can also be employed in server-side workflows to prepare content that can be viewed offline or generate documents that are compatible with modern ePub readers. Accessibility can be ensured by including alternative textual descriptions or more fine-grained speech annotations and Braille.\n  The members of the  MathJax team are professors in their own institutions with a long and successful track record in teaching and research. We regularly give presentations and workshops on the use of MathJax and its accessibility features for online teaching at international events.\n    MathJax is compatible with most Learning Management systems. We can help you to transfer your mathematical teaching materials to the web, allowing your faculty to teach mathematics online in an inclusive and accessible manner.\n    Remote online examinations are increasingly important. MathJax can help in preparing exam materials that are not only visually of the highest quality but also ensures that they are accessible for all students regardless of their individual needs.\n    We train teachers, faculty, and staff on how to prepare fully accessible math course materials. Training programs can be tailored to your specific requirements and those of your audience. We cover a variety of topics including:  porting math documents from sources like LaTeX, Word, and PDF to web formats containing SVG and MathJax,\n    Please  contact us for more information on how to get your teaching online and the training programs we can provide.\n  MathJax is a highly modular and flexible system that can be adapted to fit the needs of any application and any content: from static website to highly dynamic environments; from simple teaching handouts to highly sophisticated typesetting in scientific publishing. We can help you create the right configurations for you environments and adapt MathJax for the needs of your organization.\n    With the release of version 3.0, MathJax has moved to a modern  TypeScript implementation. If you need advice on upgrading your local installation, or your content to use MathJax v3, please contact us.\n    We support a variety of fonts and employ techniques to adapt rendering of formulas to fit visually to their surrounding text. Should you need a specialised font or rendering support, it can be incorporated into our production pipeline to be available as an extension for your organization or in the core system.\n    MathJax is an essential tool in converting traditional print sources to accessible, web-ready content. We can advise you on what tool chain is best for your needs, assemble installations, and provide you with bespoke MathJax customizations.\n    We provide consultancy on how to adapt your existing web-content, software solutions, and workflows to make them fully accessible for users with visual and print impairments. We will work with your own personnel to ensure that your material is fully accessible.\n  If you have any particular needs for making MathJax working in your organization, please  contact us regarding our consultancy services.\n MathJax uses CSS with web fonts or SVG, instead of bitmap images or Flash, so equations scale with surrounding text at all zoom levels.\n  View Samples\n  MathJax is highly modular on input and output. Use MathML, TeX, and ASCIImath as input and produce HTML+CSS, SVG, or MathML as output.\n  Try a live demo\n  MathJax works with screenreaders &amp; provides expression zoom and interactive exploration. You also can copy equations into Office, LaTeX, wikis, and other software.\n  Learn more\n  Our homepage is configured to use MathJax&#39;s CommonHTML mode with web fonts to display the equations, which produces uniform layout and typesetting across browsers. But MathJax can also be configured to use HTML-CSS (for legacy browsers), SVG, and native MathML rendering when available in a browser. You can try the various output modes using the MathJax context Menu (which you access by ctrl+clicking / alt-clicking / right-clicking an equation) or the menu below.\n     \\[x = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}.\\]   \\[f(a) = \\frac{1}{2\\pi i} \\oint\\frac{f(z)}{z-a}dz\\]   \\[ \\cos(\\theta+\\phi)=\\cos(\\theta)\\cos(\\phi)−\\sin(\\theta)\\sin(\\phi) \\]   \\[ \\int_D ({\\nabla\\cdot} F)dV=\\int_{\\partial D} F\\cdot ndS \\]   \\[ \\vec{\\nabla} \\times \\vec{F} = \\left( \\frac{\\partial F_z}{\\partial y} - \\frac{\\partial F_y}{\\partial z} \\right) \\mathbf{i} + \\left( \\frac{\\partial F_x}{\\partial z} - \\frac{\\partial F_z}{\\partial x} \\right) \\mathbf{j} + \\left( \\frac{\\partial F_y}{\\partial x} - \\frac{\\partial F_x}{\\partial y} \\right) \\mathbf{k} \\]   \\[\\sigma = \\sqrt{ \\frac{1}{N} \\sum_{i=1}^N (x_i -\\mu)^2} \\]   \\[(\\nabla_X Y)^k = X^i (\\nabla_i Y)^k = X^i \\left( \\frac{\\partial Y^k}{\\partial x^i} + \\Gamma_{im}^k Y^m \\right)\\]\n  Type text in the box below. Include some math: enter MathML as MathML tags, and wrap TeX in  $...$ or  $$...$$ delimiters (or  \\(...\\) and  \\[...\\]), and AsciiMath in  `...` delimiters. The text you enter is actually HTML, so you can include tags if you want; but this also means you have to be careful how you use less-than signs, ampersands, and other HTML special characters within your math (surrounding them by spaces should be sufficient).\n  When $a \\ne 0$, there are two solutions to \\(ax^2 + bx + c = 0\\) and they are$$x = {-b \\pm \\sqrt{b^2-4ac} \\over 2a}.$$", "posttime": "2020-10-11 16:28:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mathjax", "title": "MathJax", "title_en": "MathJax", "transed": 1, "url": "https://www.mathjax.org", "via": "", "real_tags": ["mathjax"]}, {"category": "", "categoryclass": "", "imagename": "d16bddf4259267a562041ec40ac27326.jpeg", "infoid": 1028013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这些描绘日本生活的玻璃板透明胶片可能是一些摄影师(姓名不详)的作品，是加拿大一家进出口公司的经理赫伯特·盖德斯(Herbert Geddes)于1908-1918年在横滨收集的。据这些车牌所在的维多利亚大学(University Of Victoria)称，这类照片(被称为横滨照片)“在相机和明信片普遍出现之前，大约在1869年至1912年间卖给了外国游客”。\n这里的主题从我们仍然会与以游客为目标的艺术(寺庙、桥梁、城市街道)联系在一起的东西，到现在不太常见的劳工图像(包括丝绸厂、稻米种植和铁匠-更不用说许多背着婴儿的妇女和女孩了)-提供了一个进入一个基本上已经过去的世界的亲密视角。\n像这样的正玻璃透明胶片是直接从玻璃底片(在照相胶片引入之前通常使用的)制成的。正如摄影历史学家金·蒂姆比(Kim Timby)所写的那样，“当接触印刷玻璃底片来制作玻璃正片时，玻璃支架提供的透明度和精确度丝毫没有丢失。纸质纤维在任何阶段都不会吸收溶液，也不会在印刷过程中留下痕迹。“。由此产生的图像非常清晰，可以通过“神灯”投射出来，让人们体验令人印象深刻的摄影。廷比写道，玻璃的使用也有一些吸引现代美学的地方：“它让人想起镜片和棱镜的精确度、视觉科学、温室的光线和透明度，以及现代城市生活中有遮盖的拱廊和橱窗。”\n与照相相片一样，玻璃透明胶片通常是手工着色的，这种做法在明治时期(1868-1912)变得比在欧洲或美国更受欢迎。随着市场上照片逐渐取代浮世绘，版画家们发现自己失业了，于是他们将熟练的双手转向了为竞争上色。\n这种颜色在玻璃上的发光效果，比如在Geddes&39；系列中，特别令人惊叹。一些照片的景深，再加上艺术家们专注的阴影和色调，让他们看起来像是昨天用彩色胶片拍的。\n\n我们在我们的在线印刷店里有从这篇文章中挑选出来的图片-所有的图片都是按照最高标准定制的，有框的或无框的，然后送到你的门口。", "note_en": "These glass-plate transparencies depicting life in Japan, likely the work of a number of photographers (names unknown), were collected in Yokohama during the years 1908–1918 by Herbert Geddes, a manager for a Canadian import-export company.  According to the University of Victoria, where the plates are housed, such photographs (known as &#34;Yokohama Photographs&#34;) were “sold to foreign tourists between about 1869 and 1912, before cameras and postcards were generally available”.\n The subjects here range from what we would still associate with art aimed at tourists (temples, bridges, urban streets) to now less common images of labor (including silk factories, rice cultivation, and blacksmithing — not to mention the many women and girls carrying babies on their backs) — providing an intimate view into a largely bygone world.\n Positive glass transparencies such as these were made directly from glass negatives (which were commonly used before the introduction of photographic film). As the photography historian  Kim Timby writes, “When a glass negative was contact-printed to create a glass positive, none of the transparency and precision provided by the glass support were lost. No paper fibers absorbed solutions at any stage or left their trace during printing.” The resulting images were crystal clear, and could be projected through “magic lanterns” to allow people to experience photograph at an impressive scale. There was also something about the use of glass, so Timby writes, that appealed to a modern aesthetic: “It called to mind the exactness of lenses and prisms, the science of vision, the light and transparency of greenhouses, and the covered arcades and shop windows of modern urban life.”\n As with photographic prints, glass transparencies were often hand-colored, a practice which during the Meiji Period (1868–1912) became  more popular in Japan than it ever was in Europe or America. As photographs gradually replaced   ukiyo-e prints on the marketplace, printmakers found themselves out of work — and so turned their skilled hands to coloring the competition.\n The luminous effect of such coloring on glass, such as in Geddes&#39; collection, are particularly stunning. The depth of field in some of the images, combined with the artists’ attentive shading and sense of tone, make it seem they could have been taken yesterday on color film.\n    \n We’ve a selection of images from this post in our online prints shop—all custom made to the highest standards, framed or unframed, and shipped to your door.", "posttime": "2020-10-11 16:27:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时代,coloured,玻璃", "title": "明治时代的手绘玻璃透明片", "title_en": "Hand-Coloured Glass Transparencies of the Meiji-Era", "transed": 1, "url": "https://publicdomainreview.org/collection/herbert-geddes-life-in-japan", "via": "", "real_tags": ["时代", "coloured", "玻璃"]}, {"category": "", "categoryclass": "", "imagename": "81f722c9fca4d7af00c0e14c3b8d6147.jpg", "infoid": 1028012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我从小在太浩湖滑雪比赛长大。我是斯阔谷滑雪队的成员，十多年来，它一直是我生活的中心。在几个月前的一次会议上，有人问我滑雪在投资方面教会了我什么。这是在舞台上，你不能思考你的答案-你必须脱口而出你能想到的任何东西。我不认为滑雪能教会我任何关于投资的知识。但有一件事浮现在我的脑海里。“好吧，让我把这件事带到一个黑暗而悲惨的地方，”我在给一群500名陌生人讲述一个我近20年来很少谈论的故事之前说。我们十几个人从小一起滑雪长大。大多数人从我们很小的时候就认识了。到了2001年，我们都快十几岁了，在过去的十年里，我们醒着的大部分时间从未远离过对方。我们一周滑雪6天，每年10个月，在山上的冰川上度过夏天。俄勒冈州的胡德和新西兰，那里的季节反映了我们的季节。滑雪是第一位的。我们中的大多数人都参加了独立学习项目，这让我们绕过了传统的高中。滑雪了一整天之后，我们在晚上读了几本书，填了几张表，令我们惊讶的是，这让我们拿到了文凭。我们在一起的时间使我们的关系更亲近于兄弟姐妹，而不是朋友。滑雪比赛是团队和个人运动的奇怪混合体。你们作为一个团队训练、旅行和吃饭，但这项运动本身是个人的。我们的比赛结果不是相互依赖的；我们每天的理智是相互依赖的。任何十几个青少年组成的团体都会找到一种方法来迎头相撞。我想我们有一半的时间都恨对方。20年后，我们中几乎没有人保持联系。但是，到2001年，在十几个与我共度大半生的青少年中，我们中有四个成了形影不离的好朋友。这是他们中的两个人--布兰登·艾伦和布莱恩·里士满的故事。当奇妙的事情变成例行公事时，你会认为它们是理所当然的。斯阔谷是北美最大的滑雪场之一，是1960年奥运会的举办地，每年吸引100万游客。它美得令人吃惊。对我们来说，这只是家的延伸。滑雪比赛每天需要四个小时的训练，这对我们来说就像是工作。剩下的时间-每天另外四个小时，一周六天-我们只是四处滑雪，没有条理，玩得很开心。我们称之为“免费滑雪”。其他人都管它叫滑雪。2001年2月15日，我们刚从科罗拉多州的一场比赛回来。我们回家的航班延误了，因为太浩湖被暴风雪袭击了，即使按照它自己的标准也很凶猛。当有一层新的雪地需要坚硬的冰时，你就不能参加比赛或训练。所以现在是免费滑雪一周的时候了。当月早些时候，塔霍收到了几英尺厚的轻盈蓬松的雪，这些雪来自北极的温度。2月中旬袭击的风暴是不同的。天气很暖和-几乎不到冰点-而且威力很大，在它之前到来的轻质粉末上留下了三英尺厚的湿重的积雪。我们当时没有想过这一点--我们在17岁的时候没有想过太多--但是大雪加上蓬松的雪创造了教科书上完美的雪崩条件。想象一下，上面有一层厚厚的沙子，上面有一层厚重的水泥。现在想象一下把这些层放在陡峭的山上。它很易碎，很容易滑下来。这就是2001年2月下旬斯阔谷的情况。滑雪场善于管理这些条件，以确保人们的安全。很少有游客意识到这一点，但如果你在暴风雪过后的清晨参观滑雪胜地，你会听到像炸弹爆炸的声音。这声音没有欺骗性。在迫击炮、手榴弹和从直升机上投下的炸药的组合下，滑雪巡逻队控制着危险球场的爆炸，在度假村空无一人时故意触发雪崩，在客人到达之前先发制人(查看一些视频)。这是一个有效的系统，使主要度假村的雪崩事故变得罕见。但是，如果你在越界滑雪--躲在“请勿穿越绳索”下滑雪，在没有被湾区游客触碰的禁地滑雪--系统就帮不了你了。越界滑雪是非法的，是非法侵入的一种形式。度假村不想让你这么做的主要原因是因为太危险了。越界区域没有巡逻，所以如果你受伤了，你要靠自己。它们通常不会通向缆车，所以你必须自己想办法再上去。它们不是为了控制雪崩而轰炸的。因此，滑雪者最有可能在这里--超出界限--发现大自然母亲滑动的愤怒。2001年2月21日上午，布兰登、布莱恩和我像以前一样，在斯阔谷滑雪队更衣室会面。几年后，布莱恩的妈妈告诉我，那天早上他离开家时的最后一句话是，“别担心，妈妈，我不会滑雪越界的。”但是我们一打开滑雪板，我们三个就这么做了。斯阔谷的背面，在", "note_en": "I grew up ski racing in Lake Tahoe. I was on the Squaw Valley Ski Team, and it was the center of my life for over a decade. At a conference a few months ago I was asked what skiing taught me about investing. This was on stage, where you can’t ponder your answer – you have to blurt out whatever you can think of. I didn’t think skiing taught me anything about investing. But one incident came to mind. “Well, let me take this to a dark and tragic place,” I said before telling a group of 500 strangers a story I hadn’t talked about much in almost 20 years. A dozen of us had grown up skiing together. Most had known each other since we were young children. By 2001 we were in our late teens, having spent the majority of our waking hours over the previous decade never far from each other. We skied six days a week, 10 months a year, spending summers on the glacier of Mt. Hood, Oregon and in New Zealand, where the seasons mirror our own. Skiing took precedence to everything. Most of us were in an independent study program that let us bypass traditional high school. After skiing all day we read a few books and filled out a few forms in the evening in what – to our amazement – led to a diploma. The amount of time we spent together created a relationship closer to siblings than friends. Ski racing is an odd hybrid between a team and individual sport. You train and travel and eat as a team, but the sport itself is individual. Our race results did not rely on each other; our daily sanity did. Any group of a dozen teenagers will find a way to butt heads. Half the time I think we hated each other. Twenty years later, few of us keep in touch. But of the dozen teenagers who, by 2001, I had spent the majority of my life with, four of us had become inseparable best friends. This is the story of two of them – Brendan Allan and Bryan Richmond. You take amazing things for granted when they become routine. Squaw Valley is one of the largest ski resorts in North America, was home to the 1960 Olympics, and attracts a million visitors a year. It’s staggeringly beautiful. To us, it was just an extension of home. Ski racing required four hours a day of training, which felt like work to us. The rest of the time – another four hours a day, six days a week – we just skied around, unstructured, having a good time. We called it “free skiing.” Everyone else just calls it skiing. On February 15th, 2001, we had just returned from a race in Colorado. Our flight home was delayed because Lake Tahoe was blasted with a blizzard vicious even by its own standards. You can’t race or train when there’s a blanket of new snow – racing requires hard-packed ice. So it was time for a week of free skiing. Earlier that month Tahoe received several feet of light, fluffy snow that comes from Arctic temperatures. The storm that hit in mid-February was different. It was warm – barely at the freezing point – and powerful, leaving three feet of heavy, wet snow on top of the light powder that came before it. We didn’t think about it at the time – we didn’t think about much at age 17 – but the combination of heavy snow on top of fluffy snow creates textbook perfect avalanche conditions. Imagine a thick layer of sand with a layer of heavy cement on top. Now imagine putting those layers on a steep hill. It’s fragile, prone to sliding down. That’s what Squaw Valley was like in late February 2001. Ski resorts are good at managing these kinds of conditions to keep people safe. Few tourists realize it, but if you visit a ski resort in the early morning hours after a blizzard you will hear what sounds like bombs going off. The sound isn’t deceiving. With a combination of mortars, grenades, and charges dropped from helicopters, ski patrol do controlled blasts of at-risk pitches to intentionally trigger avalanches when the resort is empty, preempting slides before guests arrive (check out some videos). It’s an effective system, keeping avalanche accidents at major resorts rare. But if you’re skiing out of bounds – ducking under the DO NOT CROSS ropes to ski the forbidden terrain untouched by masses of Bay Area tourists – the system won’t help you. Skiing out of bounds is illegal, a form of trespassing. The main reason resorts don’t want you doing it is because it’s dangerous. Out-of-bounds areas aren’t patrolled, so you’re on your own if you get injured. They usually don’t lead down to a chairlift, so you have to find your own way back up. And they’re not bombed for avalanche control. So it’s here – out of bounds – that a skier is most likely to discover Mother Nature’s sliding wrath. On the morning of February 21st, 2001, Brendan, Bryan, and I met in the Squaw Valley Ski Team locker room, like we had hundreds of times before. Bryan’s mom told me years later that his last words when he left his house that morning were, “Don’t worry, Mom, I won’t ski out of bounds.” But as soon as we clicked into our skis, that’s what the three of us did. The backside of Squaw Valley, behind the KT-22 chairlift, is a stretch of mountain about a mile long that separated Squaw with Alpine Meadows ski resort. It’s good skiing – steep, wide open, with rolling terrain. And since it’s out of bounds, it was completely untouched. Our private playground. Before February 21st I had skied it maybe a dozen times. It wasn’t one of our frequent spots, because it’s laborious. The end of Squaw’s backside spits you out on a back country road, where we would hitchhike back to our locker room. Brendan, Bryan, and I decided to ski it that morning. When an event becomes life-changing, all kinds of mundane details sear into your memory. Almost 20 years later I remember Brendan duct-taping his ski pants shut on the chairlift because I had broken the side zipper while wearing them the week before. I remember Bryan cackling with joy as the three of us entered barren wilderness while the rest of the resort was packed with crowds. And I vividly remember getting hit by one of the only avalanches I’ve ever experienced. It was tiny, not going over my knees. It wasn’t scary. I remember laughing. But the feeling is unforgettable. I didn’t hear or see the slide. I just suddenly realized my skis weren’t on the ground anymore – I was literally floating in a cloud of snow. You have no control in these situations, because rather than pushing back on the ground to gain traction with your skis, the ground is pushing you in all directions. I remember putting my hands up and shouting, “Wahooo” like I was on a roller coaster. I essentially was. The avalanche ended quickly. Brendan was to my left and Bryan was below us. No one stopped. We just charged to the bottom. “Holy shit, did you see that avalanche?” I remember saying when we got to the road. “Haha, that was awesome.” Brendan said. No one thought much more of it. We hitchhiked back. At first we had trouble getting a car to pick us up, so I decided if we took our shirts off in the 20-degree weather people would have sympathy for us and stop. It actually worked. Seventeen-year-old boys are resourceful. When we got back to Squaw Brendan and Bryan said they wanted to ski the backside again. I have no recollection of why, or how this came about, but I didn’t want to go. It may have been the hitchhiking, which I always hated. That, more than the out-of-bounds skiing, felt risky to me. But I had an idea. Brendan and Bryan could ski the backside themselves. Rather than hitchhiking back, I would pick them up in my truck. Everyone agreed on the plan, which we made in the Wildflour Baking Company cookie shop in the Squaw Valley lodge after lunch. This was before we had cell phones, so syncing on concrete plans ahead of time was important. Brendan and Bryan walked out and skied off. Thirty minutes after Brendan and Bryan took the chair up to ski the backside, I drove to the back-country road where I was scheduled to pick them up. They weren’t there. I waited another 30 minutes before giving up. It took maybe five minutes to ski the pitch, so I knew they weren’t coming. It didn’t occur to me that they were in danger. I figured they beat me to the bottom and hitchhiked back. I drove back to our locker room, expecting to find them. They weren’t there, either. I asked around. No one had seen them. I drove to Brendan’s house, which wasn’t far from the pick-up point. No one was home. I drove back to the locker room and called his house. It went to voicemail. I remember ending the message with, “I hope you’re OK man.” I was starting to get nervous, but not enough to make a big deal. People were more comfortable being out of touch before the texting era. Later that day, around 4 pm, Bryan’s mom called me at home. I remember every word. “Hi Morgan, Bryan didn’t show up for work. Do you know where he is?” she asked. I told her the truth. “We skied the backside of KT-22 this morning. He and Brendan did it again, I was going to pick them up on the road. But they weren’t there, and I haven’t seen them since.” “Oh my God,” she said. Click. I think in that moment she pieced together what likely happened to her son. I did, too. Later that evening, after sunset, my friend Ahren and I bought heavy duty flashlights at a drug store and drove to the pick-up spot. We shined the lights up the mountain shouting, “Brennnndan …. Bryyyyyan.” I remember Ahren and I thinking they had likely broken their legs and were stuck on the hill. In the back of my mind I knew it was more serious, but it was comforting to think we could find them. We gave up quickly and drove to the locker room. I forget who made the call, but the police were suddenly taking our information in what had become a missing-person report. I don’t fault the police for this, but they didn’t take it very seriously. I remember one saying, “99% of the time in cases like these the person is out drunk at a party, or ran off with a girl for the night.” I’m sure he was right – that was usually the case. But I knew he was wrong. “Their shoes are right there,” I said, pointing to Brendan and Bryan’s sneakers on the locker room floor. “That means their ski boots are on their feet. And it’s now 9 pm. Think about that. It’s 9 pm and they have their ski boots on their feet. They are not at a party.” Around 10 pm I was told to go to the Squaw Valley Fire Department where I met the local search and rescue team. They took it much more seriously. I explained everything Brendan, Bryan, and I did that day. The search team pulled out maps, and I showed them exactly where we entered the out-of-bounds area, where we exited, and the path we took. I told them about the small avalanche we were caught in that morning. As soon as I mentioned it I could see the dots connecting in the rescuers’ heads. These were seasoned professionals who understood the danger of mountains. When I finished talking I remember two of the rescuers looked at each other and sighed. They knew. I drove back to the locker room around midnight. The Squaw Valley parking lot can hold several thousand cars. By this time it was almost empty. Everyone had gone home, except two cars parked next to each other: Brendan’s Jeep, and Bryan’s Chevy pickup. Search and rescue teams were on the backside of Squaw by midnight. It was still a blizzard, with gusty winds and low visibility even during daylight. I remember watching them ski off in the pitchblack night. With giant floodlights, 12-foot probing poles, and a team of search dogs, they went looking for Brendan and Bryan. I later learned that as soon as the rescue team entered the out-of-bounds point where I told them we skied, they found the fresh scars of a massive avalanche field. I tried to sleep on a bench in the ski team locker room, but couldn’t shut my eyes. I remember hoping Brendan and Bryan would come bounding through the door. The hours dragged on, and felt like days. By 9 am the locker room was packed with other ski racers, parents, friends, and family, all eager to help. It became a staging area for the search. I laid back down on the bench and finally fell asleep. A few minutes later I awoke to the sound of a scream, followed by yelling and commotion. I knew what happened. No one needed to say it. I walked to the second floor of the locker room where I saw Bryan’s mom on a couch. The scream that woke me up off the bench was hers, made after she was told every parent’s worst nightmare. “I’m so sorry,” I told her, bawling. It’s hard to describe a moment like that. I didn’t know what else to say then. I don’t know what else to say now. Search dogs had honed in on a spot in the avalanche field where rescuers with probe poles found Brendan and Bryan buried under six feet of snow. They were born one day apart, and died 10 feet from each other. Later that day I drove to see my dad at work. I wanted to be around family. He met me in the parking lot and said, “I’ve never been so happy to see you.” It was the only time I’ve seen him cry. It didn’t occur to me until that moment how close I was to going with Brendan and Bryan. Why did I ski the backside with them once that morning, but then decline a second run? I’ve thought about it a million times. I have no idea. Why was the avalanche on our first run a tiny little thrill, but the second run triggered a deadly slide that killed two 17-year-olds? We’ll never know. The next evening, Tom Brokaw told Brendan and Bryan’s story on the NBC Nightly News. It was surreal to watch. We were laughing together 36 hours before. Now their death was national news. And the only thing that kept me from being a third name in the newscast I had watched religiously was a fluke decision I put no thought into. It’s been almost 20 years since this happened. Sometimes I think about everything that’s occurred since – college, marriage, career, kids – and remind myself that I’ve only experienced it because of a blind, thoughtless decision to decline another ski run. This story isn’t unique. Many people reading this have had near-death experiences. Most have lost someone dear to them. And everyone reading this has made what seemed like no-nothing, inconsequential decisions that fundamentally reshaped their lives. Sometimes those fluke decisions are positive. Sometimes they’re negative. But they’re always out of the blue, unforeseeable. It’s just how life works. After I told this story at the conference I had to tie it back to an investing lesson. It was easier than I thought. My risk tolerance plunged after Brendan and Bryan died. I broke my back skiing (no nerve damage) a few months later, which crushed it even more. I haven’t skied much since. Maybe ten times in the last 19 years. If I’m honest, it scares me. I’ve been risk-averse in other areas of life ever since, too. I drive the speed limit. I obey the seatbelt sign on airplanes. I invest in index funds. I don’t know if Brendan and Bryan’s death actually affected how I invest. But it opened my eyes to the idea that there are three distinct sides of risk: The odds you will get hit. The average consequences of getting hit. The tail-end consequences of getting hit. The first two are easy to grasp. It’s the third that’s hardest to learn, and can often only be learned through experience. We knew we were taking risks when we skied. We knew that going out of bounds was wrong, and that we might get caught. But at 17 years old we figured the consequences of “risk” meant our coaches might yell at us. Maybe we’d get our season pass revoked for the year. Never, not once, did we think we’d pay the ultimate price. But once you go through something like that, you realize that the tail-end consequences – the low-probability, high-impact events – are all that matter. In investing, the average consequences of risk make up most of the daily news headlines. But the tail-end consequences of risk – like pandemics, and depressions – are what make the pages of history books. They’re all that matter. They’re all you should focus on. We spent the last decade debating whether economic risk meant the Federal Reserve set interest rates at 0.25% or 0.5%. Then 36 million people lost their jobs in two months because of a virus. It’s absurd. Tail-end events are all that matter. Once you experience it, you’ll never think otherwise.", "posttime": "2020-10-11 16:27:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风险,sides,滑雪", "title": "风险的三个方面", "title_en": "The Three Sides of Risk", "transed": 1, "url": "https://www.collaborativefund.com/blog/the-three-sides-of-risk/", "via": "", "real_tags": ["风险", "sides", "滑雪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1028011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个世界是一个复杂的、相互联系的系统网络。我们试图通过创建各种(看似无关的)学科来理解这一点。学科众多，当我说任何一个人都不可能成为所有这些领域的专家时，我想你会同意我的看法。\n然而，即使你深入某一领域，它仍然非常复杂，即使在某个特定领域的范围内，你也会对真正理解任何东西的想法感到绝望，即使是在一个特定领域的范围内，这也是如此之难，甚至当你深入某一领域时，它仍然是如此的复杂，以至于你会对真正理解任何东西的想法感到绝望，即使是在一个特定的领域内。\n大多数场似乎呈现出分形图案。我的意思是，您越是尝试放大系统的某个特定方面，就会显示出越多的细节。无论你谈论的是经济学、物理学还是生物学，道理都是一样的。一个全新的细节世界展现在所有不同的层面上。\n当然，当面对复杂性时，我们的第一本能是减少和孤立对待它们，我们已经试图通过创建专门化(本质上是子领域)来适应领域内的复杂性。\n这就是为什么微生物学家和生态学家似乎说着完全不同的语言。这可能会让你想知道这两个领域是否有关联；有人可能会争辩说，它们都是通过一套截然不同的镜头来看待世界的。\n随着人类知识的进步，我们能够理解不同层次的系统，我们不断催生越来越新的专业化和超专业化。\n这一概念在计算机科学中最为清晰，在计算机科学中，人们建造了令人难以置信的复杂系统，将猫视频传输到你的屏幕上。我在这里选择计算机科学没有什么特别之处，因为我确信在任何领域的表面之下都潜藏着类似程度的复杂性。\n即使你花了很多年的时间深入研究，你仍然不会真正完全了解计算机是如何工作的。你的知识中总会有空白。即使在像允许你在屏幕上阅读这些单词这样看似简单的事情背后，也隐藏着如此之多的复杂性。有很多抽象塔可以实现这一点：\n你的CPU(本质上是一块很小的硅片，只能把两个数字相加)在你读这句话的时候执行了几百万条指令。欢迎来到计算机体系结构！\n在大多数情况下，这些指令是人类无法理解的。所以我们发明了一种高级语言，并编写了另一个软件将这种高级语言转换成指令。欢迎使用编译器！\n有多个应用程序同时在该系统上运行；不知何故，一段代码(操作系统)设法将所有这些抽象出来，以便这些应用程序能够假装它们是该系统上运行的唯一应用程序。同样，还有其他资源(RAM、文件、I/O设备)都需要在系统上运行的数百个程序之间共享。欢迎使用操作系统！\n您的设备不是孤立存在的。事实上，它的很多功能都是与其他设备相关的。仅仅是为了加载和查看这个网站，它就必须将信号发送到以太，而以太不知何故(就像一个贴有标签的信封)找到了正确的服务器，然后他们用您所请求的数据做出回应。欢迎加入网络公司！\n事实上，上述所有情况都是极大的简化。我甚至还没有开始触及皮毛。如果你想了解更多，看看一个简单的谷歌搜索背后隐藏了多少细节。\n那么，你是如何开始理解和理解似乎有这么多相互关联的东西的呢？\n这里有一个简短的题外话：心理学中有一个关于工作记忆的著名结果(也被称为米勒定律)。研究表明，人类平均一次可以在短期记忆中保持大约7个物体。基本上，如果你在脑海中玩弄概念，思考事物之间是如何联系的，那么你的认知极限似乎只有7个。\n当然，这是相当模糊的，从任何一个结果中得出太多结论当然是危险的。然而，我建议我们可以从米勒定律中吸取这一教训：人类不能同时在头脑中容纳太多东西。软件系统是非常复杂的野兽，任何人都无法在脑海中记住事物如何工作的所有微小细节。\n这就是抽象的用武之地。这是计算机科学、工程和一般解决问题的基本构件之一。抽象是当你眯着眼睛，把某物当作一个黑匣子的时候。你暂时选择不关心黑匣子里发生了什么，因为其他细节更重要。\n有关抽象的示例，请考虑您常用的对象的接口。例如，一辆汽车隐藏了很多复杂的电路和机械，但说到底，你需要关心的只是方向盘和几个踏板。那是一辆汽车的抽象视图。我不关心赛车如何将这些输入转化为多个复杂的输出量，如进油量、扭矩等。我完全忽略了这一点，因为这对我来说并不重要。我只想从A点到B点，我只需要知道如何使用汽车的接口来实现这个目标。\n设计良好的界面(软件界面也是如此！)。这会让你在开车时专注于更少的汽车方面，减少认知上的努力；我现在谈论的是手动、自动和自动驾驶汽车。\n当然，这一切都很好，但这篇文章是关于处理复杂性的，而不是关于假装它不存在。毕竟，最终确实有人必须设计和处理潜在的复杂性(特斯勒定律)。如果你只能把一辆车看作它的界面，你就会成为一名糟糕的汽车工程师！\n当你还是一名学生，想要更多地了解某个你没有先验知识的领域时，事情就更难了；有这么多要学的东西，你怎么决定什么值得更深入地钻研呢？\n因此，请记住这个抽象的概念，让我们来谈谈分形学习，这也是这篇博客文章的重点。\n分形学习本质上是一种用来理解复杂系统而不会太迷失在细节中的策略。它是关于处于金发地带，不浪费时间学习太多(你有其他事情要做)，同时全面了解事物是如何组合在一起的。\n我第一次想到这个概念是在优秀的Intermezzos书中。它完美地概括了学生和研究人员努力理解复杂系统的挑战：\n一次学完所有的东西是不可能的。如果你继续挖掘，你会发现更多的问题，而挖掘这些问题会引出更多的问题……。在某种程度上，你不得不说，好吧，我现在知道的够多了，是时候继续前进了。\n让我们假设这棵树代表你感兴趣的领域。你的工作就是以某种方式浏览这棵树(或树枝)，并学习一切。现在，很明显，在这一生中不可能学到所有的东西，但你仍然想要知道足够多的知识，以便更好地了解每件事是如何组合在一起的。\n大多数人似乎遵循两种策略中的一种-这些策略归入计算机科学中的树遍历算法的保护伞下。\n让我们更深入地研究这两个问题，因为它们与讨论相关。\n第一种是深度优先搜索(我称之为掉进兔子洞)。它由此动画1：\n在这里，您从树的根(由1表示)开始，并沿着任何一条路径不断深入。当你不能再往前走时，你会停下来，然后尝试另一条路。\n我希望你明白为什么我把它叫做“掉进兔子洞”；你只是越来越深入地挖掘一个特定的主题，而没有真正后退一步去探索其他相关的主题。这是一种聚焦于排斥的激光聚焦战略。这相当于一个孩子不停地问为什么要问一个特定的话题，直到她再也得不到有意义的答案。如果一个人只遵循这个学习策略，她会对这一件事情有非常详细和具体的知识，但对密切相关的事情却完全不知道。\n这与之前的方法截然相反。在这里，你相当胆小，你从来不会一次走超过一层，你会一层一层地走。\n再一次，我希望这是有道理的，为什么我称之为洪水；它的工作原理类似于水是如何缓慢上升来淹没一个地区的。在这里，你的挖掘非常肤浅，在深入研究之前，花时间去理解一切的基本知识。这项工作的重点是包容性，了解每件事是如何结合在一起的，即使这并不相关。只遵循这一策略的人将是一个多面手，他会知道一切的基本原理，但就像打个比方说的那样，他什么都不会。\n遗憾的是，就像生活中的许多事情一样，答案是：这要视情况而定。你将不得不用你的判断力和直觉来根据情况来决定使用哪种方法。这两种方法都有其权衡之处。\n当然，如果有足够的时间，这两种方法都会覆盖整个树。正如我们所看到的，这两种方法都设法解决了这个迷宫。\n在下面的示例中(这两个都是真实场景)，上述策略不是最优的。你必须将两者结合起来，仔细地用你的判断力来挑选哪些话题值得深入探索，哪些话题只值得粗略浏览。\n当你刚进入一个领域，并试图全面了解该领域的运作方式时，掉进任何一个兔子洞可能是浪费时间，因为你没有经验知道哪些问题是相关的。因此，以广度为中心的方法可能对您很有帮助。在这种情况下，您应该为您遇到的概念形成适当的抽象，以便以后需要时可以更深入地挖掘它们。\n例如，在浏览文章的其余部分时，只阅读您遇到的主题的Wikipedia简介，同时单击简介中的链接以进行进一步的探索。在这里，重要的是仍然要注意一些细节，这样你就可以稍后再讨论它。\n另一方面，比方说你正在努力为你想要解决的特定问题找到解决方案。在这里，更明智的做法可能是遵循一种更以深度为中心的方法，利用你的直觉引导你沿着相关的提问路线前进。请注意，最好已经对事物的工作原理有一个整体的了解；否则，你就不知道从哪里开始了，而且这只是一次无方向的(可能是徒劳无功的)搜索。在这里，想太多你所遇到的事情只会让你分心。这可能会为你节省一些时间，让你浏览一下材料，对事情是如何运作的有一个整体的感觉，以防你以后需要它。然而，重要的是要保持在正轨上，不要忽视你当时试图解决的具体事情。\n这方面的一个例子是试图在维基百科上查找特定的信息。你会有一种狭隘的视野：你确切地知道你想要什么，而其他一切都只是分散注意力。在这里，重要的是不要过于专注，同时也要注意整体环境。然后，您对整个领域的了解就会增长，而不仅仅是您正在处理的特定部分。\n最终，这两个例子真正证明了这篇博客文章的主题：分形学习。\n即使在深入研究细节的同时，也要牢记大局。\n这意味着，有时你选择接受事物的本来面目，而不是更深层次的质疑；也许稍后，你会选择更深入地挖掘同样的假设。\n这似乎从根本上看是相当矛盾的。这几乎是一个非常禅宗的方面，因为要做出这些权衡并不是一件容易或简单的事情。失败是不可避免的，有时你太深入不相关的细节，太肤浅了，这是很自然的，也是意料之中的。但这绝对是一项可以学习的技能。事实上，它不仅是一项技能，而且是一项元技能，它会极大地提高你学习所有技能的速度。\n我发现自己有一种普遍的倾向，那就是在早期太深入地研究一个话题，然后在迷宫中迷路。如果你和我一样，我希望这篇文章鼓励你停下来，退一步，偶尔考虑一下整个系统。\n在继续前行之前，不完全理解一些东西是可以的，不管这意味着什么。你会回到这件事上来的。有时候，学习其他东西比钻研每一个细节更重要。", "note_en": "This world is a complex, interconnected web of systems. We&#39;ve tried to make sense of this by creating various (seemingly-unrelated) disciplines. With the huge number of disciplines, I think you&#39;ll agree with me when I say that it&#39;s impossible for any one person to be an expert in all of these fields.\n It&#39;s turtles all the way down, however, and even as you go deeper into a field, there&#39;s still so much complexity that you would despair at the idea of ever really understanding anything even within the confines of one specific field.\n Most fields seem to exhibit a fractal pattern. By this, I mean that the more you try to  zoom in onto a specific aspect of a system, the more detail is revealed. The same is true whether you&#39;re talking about economics or physics or biology. A whole new world of detail is revealed at all the different levels.\n Of course, when confronted with complexity, our first instinct is to  reduce and to treat these in isolation, and we&#39;ve tried to come to terms with the complexity within fields by creating  specializations, which are essentially sub-fields.\n This is why a microbiologist seems to speak a completely different language from an ecologist. This might make you wonder whether the two fields are even related; one could argue that they both view the world through a radically different set of lenses.\n As human knowledge progresses and we&#39;re able to understand systems at different levels, we&#39;re continuously spawning newer and newer specializations and hyperspecializations.\n Nowhere is this concept clearer than in computer science where incredibly complex systems have been built to deliver cat videos to your screen. There&#39;s nothing special about my choice of computer science here, as I&#39;m sure there are similar levels of complexity lurking beneath the surface of any domain.\n You could spend years and years in deep study and you still wouldn&#39;t really fully  get how a computer worked. There would always be gaps in your knowledge. Even behind something as seemingly simple as allowing you to read these words on your screen, there is so much hidden complexity. There are towers and towers of abstractions that enable this to happen:\n Your CPU (essentially a tiny piece of silicon that can&#39;t do much but add two numbers together) executed a few million instructions during the time you were reading this sentence. Welcome to Computer Architecture!\n These instructions are in most cases not understandable by a human. So we invented a  high-level language and wrote another software to convert this high level language into the instructions. Welcome to Compilers!\n There are multiple applications running on this system at the same time; somehow, a piece of code (the Operating System), managed to abstract all this away such that the applications are able to pretend that they&#39;re the only application running on the system. Similarly, there are other resources (RAM, files, I/O devices) that all need to be shared between the hundreds of programs running on your system. Welcome to Operating Systems!\n Your device doesn&#39;t exist in isolation. In fact, a lot of its capabilities arise in relation with other devices. Just for the purpose of loading this website and viewing it, it had to send signals out into the ether which somehow (like a labelled envelope) found its way to the right servers and then they responded back with the data you were requesting. Welcome to Networks!\n In fact, all of the cases above are huge simplifications. I haven&#39;t even begun scratching the surface. If you&#39;re curious to learn more,  look at how much detail is hidden behind a simple Google search.\n So how do you even begin to understand and make sense of things which seem to have so many interconnected pieces?\n A short digression here: there is a famous result in psychology about working memory (also called  Miller&#39;s Law). It suggests that humans can, on average, hold about 7 objects in their short-term memory at one time. Basically, if you&#39;re playing around with concepts in your head and thinking about how things relate with one another, there seems to be a cognitive limit of about 7 items.\n Of course that is quite fuzzy and it is of course dangerous to generalize too much from any one result. However, I&#39;d suggest that we can take away this lesson from Miller&#39;s Law: humans can&#39;t hold too many things in their head at the same time. Software systems are very complex beasts and it&#39;s beyond the scope of any person to hold in their head all the minute details of how something is working.\n This is where  Abstraction comes in. This is one of the fundamental building blocks of Computer Science, Engineering, and Problem Solving in general. Abstraction is when you squint your eyes and treat something as a  black box. You are temporarily choosing to not care about what&#39;s happening inside the black box because other details are more important.\n For an example of abstraction think about  interfaces to objects you commonly use. A car for example hides a lot of complicated circuitry and machinery, but at the end of the day, all you need to care about is the steering wheel and a couple of pedals. That&#39;s the abstract view of a car. I don&#39;t care how that car turns these inputs into the multiple complicated outputs of fuel intake, torque etc. I completely ignore that because it&#39;s not important to me. I just want to get from point A to point B and I just need to know how to use the interface of the car to achieve the goal.\n A well-designed interface (this is true of software interfaces too!) would allow you to focus on fewer aspects of the car and expend lesser  cognitive effort when driving the car; I&#39;m talking about manual vs automatic vs self-driving cars.\n Sure, that&#39;s all well and good, but this article is about  Dealing with Complexity, not about  Pretending it doesn&#39;t exist. After all, someone does ultimately have to design and work with the underlying complexity ( Tesler&#39;s Law). You&#39;d be a terrible automobile engineer if you were only able to see a car as its interface!\n Things are even harder when you&#39;re a student and trying to learn more about a certain field you have no prior knowledge in; with so much to learn, how do you decide what is worth digging deeper into?\n So hold on to this idea of abstraction, and let&#39;s talk about Fractal Learning, which is the focus of this blog post.\n  Fractal learning is essentially a strategy used to make sense of complex systems without getting too lost in the details. It&#39;s about being in that Goldilocks zone of not wasting your time learning too much (you have other things to do) while at the same time getting an overall understanding of how things fit together.\n I first came across this concept in the excellent  IntermezzOS Book. It beautifully encapsulates the challenges of students and researchers working to make sense of complex systems:\n It&#39;s impossible to learn everything at once. If you keep digging, you&#39;ll find more questions, and digging into those questions leads to more questions... at some point, you have to say &#34;okay, I know enough about this for now, it&#39;s time to move on.&#34;\n   Let&#39;s imagine that this tree represents your field of interest. Your job is to somehow navigate this tree (or a branch) and learn  everything. Now, clearly, learning everything isn&#39;t going to happen in this lifetime, but you still want to know enough to get a good idea of how everything fits together.\n  Most people seem to follow one of two strategies - and these strategies come under the umbrella of  tree-traversal algorithms in computer science.\n Let&#39;s dig a bit deeper into both of these as they are relevant to the discussion.\n The first is depth-first search (I call it  falling down the rabbit hole). It&#39;s represented by this animation  1:\n     Here, you start at the root of the tree (represented by 1) and you keep going deeper and deeper along any one path. You stop when you can go no further and then try one of the other paths.\n      I hope you get why I called it falling down the rabbit hole; you&#39;re just digging deeper and deeper into a specific topic without really taking a step back to explore other related topics. This is a laser-focused strategy that focuses on exclusion. It&#39;s the equivalent of the child who keeps asking &#34;Why?&#34; for a specific topic until she can no longer get a meaningful answer. If someone followed only this strategy for learning about things, she would have very detailed and specific knowledge about that one thing but have absolutely no idea about even closely related things.\n      This is the polar opposite of the previous approach. Here you are quite timid, and you never go more than one level at a time, and you make your way level-by-level.\n      Again, I hope it makes sense why I called it flooding; it works similarly to how water slowly rises to flood an area. Here you dig very shallowly and take the time to understand the basics of everything before making your way deeper. This is focused on being inclusive and getting a sense of how everything fits together, even if it&#39;s not relevant. Someone who followed only this strategy would be a jack of all trades, he would know the fundamentals of everything; but like the figure of speech goes, he would be a master of none.\n  Sadly, as with a lot of things in life, the answer is: it depends. You will have to use your judgment and intuition to decide which approach to use depending on the situation. Both approaches have their trade-offs.\n Of course, given enough time, both approaches would cover the entire tree. As we saw, both approaches managed to solve the maze.\n  In the following examples (both of which are real-world scenarios), the above strategies are sub-optimal. You will have to use a combination of both, carefully using your judgment to pick which topics are worth exploring deeper, and which are only worth skimming through.\n When you are new to a field and trying to get an overall sense of how the field works, it might be a waste of time to fall down any rabbit holes as you don&#39;t have the experience to know which lines of questioning are relevant. So a breadth-centric approach might serve you well. In this case, you should form appropriate abstractions for the concepts you are encountering so that you can dig deeper into them later if you need.\n An example of this would be reading only the Wikipedia introductions for the topics you encounter while skimming through the rest of the article, while clicking through the links in the introduction for further exploration. Here, it&#39;s important to still pay some attention to the details so you can return to it later.\n On the other hand, let&#39;s say you are trying to find a solution to a specific problem that you are trying to solve. Here it might be wiser to follow a more depth-centric approach, using your intuition to guide you down relevant lines of questioning. Note that it&#39;s much better to already have an overall sense of how things work; otherwise, you wouldn&#39;t know where to start, and it would just be an undirected (and probably fruitless) search. Here, it would just be a distraction to think too much about the things you are encountering. It may save you some time to skim through the material and get an overall sense of how things work, in case you need it later. However, it is essential to stay on track and not lose sight of the specific thing you are trying to solve at that moment.\n An example of this would be trying to find a specific piece of information on Wikipedia. You would have a sort of tunnel vision: You know exactly what you want, and everything else is a mere distraction. Here, it is important to not get too hyper-focused and pay some attention to the overall context as well. Then, your understanding of the entire field grows, not just the specific part you are dealing with.\n Ultimately these two examples really serve to demonstrate what the topic of this blog post is about: Fractal learning.\n  keeping the big picture in your mind even when digging into the details, whilst simultaneously\n It means that sometimes you choose to accept things the way things are without questioning deeper; and maybe later, you choose to dig deeper into those same assumptions.\n This might seem fundamentally to be quite contradictory. There&#39;s almost a very Zen aspect to it as it is not an easy or simple thing to do to make these trade-offs. Failure is inevitable and it is natural and expected that you sometimes you go too deeply into irrelevant details and too shallowly into the important details. But this  is definitely a skill that can be learned. In fact, It&#39;s not just a skill but a  meta-skill that would greatly increase the rate at which you learn all skills.\n I have seen a general tendency in myself to dig too deep into a topic early on and get lost in the maze. If you&#39;re like me, I hope this article encourages you to pause, take a step back, and think about the overall system every once in a while.\n It&#39;s okay to not &#34;fully&#34; understand something before moving on, whatever that means. You&#39;ll get back to it. Sometimes, learning something else is more important than diving into every last detail.", "posttime": "2020-10-11 16:26:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分形,fractal,领域", "title": "分形学习", "title_en": "Fractal Learning", "transed": 1, "url": "https://reisub0.github.io/fractal-learning.html", "via": "", "real_tags": ["分形", "fractal", "领域"]}, {"category": "", "categoryclass": "", "imagename": "930e241eb4c76655a005eee88006d727.jpeg", "infoid": 1028010, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我从历史的角度就天文学中的宇宙距离阶梯做了一次公开演讲(并强调了数学在构建这一阶梯中的作用)。我之前在这里写过关于讲座的博客；最新版本的幻灯片可以在这里找到。最近，我开始与Tanya Klowden(我的老朋友，有各种主题的通俗写作背景，包括天文学)合作，将讲座扩展为一本科普书籍，试探性的格式是非技术性章节，穿插一些更多的数学部分，以提供一些技术细节。我们仍在撰写过程中，但我们已经制作了一个样本章节(这一章讲述了我们所说的距离阶梯的“第四级”-行星的距离和轨道-以及哥白尼、布拉赫、开普勒和其他人的工作如何导致对这些轨道的准确测量，以及开普勒著名的行星运动定律)。一如既往，欢迎对本章的任何反馈。(由于各种与大流行相关的不确定性，我们对这本书何时完成没有明确的目标截止日期，但估计这将发生在明年的某个时候。)。\n这是一个有趣的话题，我不得不问一下恒星的位置，有没有什么数学定律可以预测太空中开始的确切位置？\n天文学(就像任何物理科学一样)是从积累的观测数据中寻找数学模式的愿望发展而来的。有可能有一种终极数学理论有可能解释每一种可能的观测数据。\n你最好把你的书读过文艺复兴时期的数学(https://thonyc.wordpress.com/).。他非常清楚科学是一个团队的努力，而不是(仅仅)个人天才。对于想要进入科学领域的孩子来说，这是一个重要的信息。或者你可以阅读他的博客“现代天文学的出现--一幅复杂的马赛克”，目前已经发展到了第XLVI部分。\n在写任何关于这个主题的文章之前，请先阅读C K Raju的“数学的文化基础”。\n在第一段中，吠陀把行星称为恶魔。对此有何看法？这一提法出现在希腊与印度的联系之前。秋分的岁差问题声称早在希腊人https://en.wikipedia.org/wiki/Ayan%C4%81%E1%B9%83%C5%9Ba之前就被列出来了，尽管是为了占星术的目的，而不是像希腊文化中那样为了知道的目的。有没有证据表明某些东西在不同文化中的希腊人之前就已经知道了？\n她被介绍到柏拉图的著作中，发现费拉拉-佛罗伦萨会议之后在希腊的生活很不舒服。我不得不对此进行了几次解析。怎么样：他发现在希腊的生活不舒服，跟随着费拉拉-佛罗伦萨理事会。当时在Tübingen=&gt；在Tübingen；他在著名数学家的指导下学习Just怎么样：他在短时间内师从这位著名数学家，很快就把他=&gt；带到了短时间内，这很快让他和他们在开普勒能够这样做之前就给自己施压了=&gt；并让他们在开普勒能够给出一个很好的地球轨道=&gt；为了很好地近似地球的轨道，行星围绕太阳的速度=&gt；行星围绕太阳的速度使它们可能只是有趣的奇特之物，它们使得在这个平面上关于任意选择的一对派林台风模型，太阳=&gt；在台风模型中，太阳可能只是一个有趣的奇特之物，在这个平面上，关于一个任意选择的派林台风模型，太阳=&gt；在台风模型中，太阳=&gt；在台风模型中，太阳=&gt；在这个平面上，关于任意选择的派林台风模型，太阳=&gt；在台风模型中，太阳=&gt；在这个平面上，关于任意选择的派林台风模型，太阳=&gt；", "note_en": "Several years ago, I developed a public lecture on the  cosmic distance ladder in astronomy from a historical perspective (and emphasising the role of mathematics in building the ladder). I previously blogged about the lecture  here; the most recent version of the slides can be found  here. Recently, I have begun working with  Tanya Klowden (a long time friend with a background in popular writing on a variety of topics,  including astronomy) to expand the lecture into a popular science book, with the tentative format being non-technical chapters interspersed with some more mathematical sections to give some technical details. We are still in the middle of the writing process, but we have produced  a sample chapter (which deals what what we call the “fourth rung” of the distance ladder – the distances and orbits of the planets – and how the work of Copernicus, Brahe, Kepler and others led to accurate measurements of these orbits, as well as  Kepler’s famous laws of planetary motion). As always, any feedback on the chapter is welcome. (Due to various pandemic-related uncertainties, we do not have a definite target deadline for when the book will be completed, but presumably this will occur sometime in the next year.)\n  That is an interesting topic , I have to ask about stars locations , Is there any mathematical law to predict the exact location of starts in the space ?\n    Astronomy (as any physical science) developed from the desire to find mathematical patterns among the accumulated observational data. It is possible that there is an ultimate mathematical theory with the potential to explain every possible observational data.\n  You’d be wise to run your book past the Renaissance Mathematicus ( https://thonyc.wordpress.com/). He’s very strong on how Science is a team effort, not (just) individual geniuses. This is an important message for kids wanting to go into Science. Or you can read his blogs on “The emergence of modern astronomy – a complex mosaic”, currently up to Part XLVI.\n  Kindly read Cultural Foundations of Mathematics by C K Raju before writing anything on this topic.\n  On the very first paragraph – the vedas referred to the planets as demons. Any opinion on this? This reference is before the Greek connection to India. The question of precession of equinoxes is claimed to be tabulated long before the greeks  https://en.wikipedia.org/wiki/Ayan%C4%81%E1%B9%83%C5%9Ba though for the purpose of astrology not for the purpose of knowing as in the Greek culture. Any evidence certain things could have been known prior to Greeks in different cultures?\n  introduced to the Plato’s writings =&gt; introduced to Plato’s writingshe found life in Greece following the Council of Ferrara-Florence uncomfortable. I had to parse this a couple of times. How about: he found life in Greece uncomfortable, following the Council of Ferrara-Florence.and at it was at Tübingen =&gt; and it was at TübingenHe studied under the instruction of the renowned mathematician How about just: He studied under the renowned mathematicianwithin short order and quickly brought him =&gt; within short order, which quickly brought himand getting them to press himself before Kepler would be able to do so =&gt; and getting them to press before Kepler would be able to do soto give a good approximation the orbit of the Earth =&gt; to give a good approximation to the orbit of the Earththe velocity of the a planet around the Sun =&gt; the velocity of a planet around the Sunthey make possible them to be only interesting curiosities =&gt; they make possible to be only interesting curiositiesin this plane with respect an arbitrarily chosen pair =&gt; in this plane with respect to an arbitrarily chosen pairIn Tychonic model, the Sun =&gt; In the Tychonic model, the Sun", "posttime": "2020-10-11 16:26:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,宇宙,cosmic,数学", "title": "攀登宇宙距离阶梯陶渊明新书发布会", "title_en": "Climbing the cosmic distance ladder: Terence Tao book announcement", "transed": 1, "url": "https://terrytao.wordpress.com/2020/10/10/climbing-the-cosmic-distance-ladder-book-announcement/", "via": "", "real_tags": ["发布", "宇宙", "cosmic", "数学"]}]