[{"category": "", "categoryclass": "", "imagename": "c8b90314b8a8ced430f128de6683f25d.jpg", "infoid": 1005338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让事情变得复杂的是，谷歌保留了Google+，即使在Current推出后也是如此，但在给G Suite管理员的电子邮件中，谷歌现在宣布，Google+for G Suite将于7月6日关门，之后将没有办法选择退出Current或恢复到Google+。\n至此，谷歌已经在Google+的棺材上钉上了最后一颗钉子。Google+移动应用程序将自动更新为最新版本。所有到Google+的现有链接都将重定向到Current。\n展望未来，Google+将只会成为一个模糊的记忆，充满了朋友圈，所有的朋友圈都被迫使用真名(至少在一开始是这样)，到处都是+1按钮，火花四溅，承诺会有有趣的游戏、涟漪等等。\nCurrent完全是业务-虽然我不知道有多少公司在使用它，但对于那些在微软生态系统中使用Yammer/Teams组合的公司来说，它看起来是一个可靠的选择。现在，我想，在谷歌推出另一个社交网络之前，我们可以开始倒计时了。\n如果你想在记忆中漫步，看看我们的Google+历史吧：", "note_en": "To complicate matters, Google kept Google+ around, even after the launch of Currents, but in an email to G Suite admins, it has now announced that Google+ for G Suite will close its doors on July 6, after which there will be no way to opt out of Currents or revert back to Google+.\n  And with that, Google has driven the final nail into Google+’s coffin. The Google+ mobile apps will be automatically updated to Currents. All existing links to Google+ will redirect to Currents.\n Going forward, Google+ will only live on as a  hazy memory, filled with  circles of friends, all of which were forced to use their real name (at least at the beginning),  +1 buttons everywhere,  sparks and the promise of fun games,  ripples and more.\n Currents is all business — and while I’m not aware of a lot of companies that use it, it looks to be a solid option for companies that would otherwise use the  Yammer/Teams   combination in the Microsoft ecosystem. Now, I guess, we can start the countdown before Google launches another social network.\n If you want to take a stroll down memory lane, check out our history of Google+ below:", "posttime": "2020-06-06 03:43:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google", "title": "这就是Google+", "title_en": "And That’s It for Google+", "transed": 1, "url": "https://techcrunch.com/2020/06/05/and-thats-really-it-for-google/", "via": "", "real_tags": ["google"]}, {"category": "", "categoryclass": "", "imagename": "97cc2254b069720063879157184ead38.jpg", "infoid": 1005337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Serena Williams的丈夫Alexis Ohanian-Reddit的联合创始人-今天辞去了Reddit董事会的职务。他在推特上宣布了这一举措，敦促公司聘请一名黑人候选人代替他，并承诺他未来从Reddit股票中获得的收益将服务于黑人社区。\n就在两天前，一些受欢迎的Subreddits私有化，在某些情况下，禁止发布新帖子，以抗议该公司的仇恨言论政策。该网站一些最大社区的一些版主特别指责Ohanian的联合创始人、现任首席执行官史蒂夫·赫夫曼(Steve Huffman)未能采取行动反对种族主义，以及该网站一些最恶毒的社区，如支持特朗普的子编辑网站r/the_Donald。\n我已经辞去了Reddit董事会成员的职务，我敦促他们用一位黑人候选人来填补我的席位，+我将利用我的Reddit股票未来的收益来服务黑人社区，主要是为了遏制种族仇恨，我将从向@kaeperick7的@your rightscamp承诺100万美元开始。\n-Alexis Ohanian Sr.(@alexisohanian)2020年6月5日。\nReddit是一个全球论坛，也是最早普及和优先考虑不受限制的言论自由理念的在线群众性聚会场所之一。最近，它的立场发生了变化。\n在过去的几年里，Reddit已经开始主动禁止在唐纳德·特朗普当选总统之前它会容忍的社区类型，比如qanon subreddit或另类右翼r/Million DollarExtreme。但这并不完美。就在本周，前首席执行官鲍康如(Ellen Pao)-在用户对她任职期间网站的变化表示反抗后辞职-指责Reddit历史上容忍种族主义和白人至上主义思想。\n我有义务叫你出来：你应该关闭_Donald，而不是放大它及其仇恨、种族主义和暴力。现在发生的很多事情都在你的脚下。当Reddit一天到晚培养白人至上主义和仇恨并将其货币化时，你就不能说“BLM”了。https://t.co/VN5XCiYp5g。\n-鲍康如(@EKP)2020年6月2日。\nOhanian希望利用他的权力和地位做一些好事的愿望令人钦佩，但这并没有消除Reddit所造成的伤害，因为它对言论的承诺高于一切。\n我相信辞职实际上可以是当权者的一种领导行为。致为拯救我们支离破碎的国家而战的每一个人：不要停下来。https://t.co/LWI1OnCaVi。\n-Alexis Ohanian Sr.(@alexisohanian)2020年6月5日。\nReddit首席执行官史蒂夫·赫夫曼(Steve Huffman)周五在一篇帖子中写道，公司将尊重奥哈尼安的要求，用一名黑人候选人取代他。“我们正在与MODS合作，改变我们的内容政策，明确解决仇恨问题，”赫夫曼补充道。“我想为多年来让我们走到这一步的政策历史负责，我们还有工作要做.”", "note_en": "Serena Williams’ husband Alexis Ohanian — the co-founder of Reddit — resigned from Reddit’s board of directors today. He announced the move in a tweet, urging the company to hire a black candidate in his stead and promising his future gains on Reddit stock to serve the black community.\n The move comes just two days after a  number of popular subreddits went private or, in some cases, banned new posts to protest the company’s hate speech policies. Some moderators of some of the site’s largest communities specifically called out Ohanian’s co-founder, current CEO Steve Huffman, for failing to take action against racism and some of the site’s most virulent communities like r/The_Donald, its pro-Trump subreddit.\n I&#39;ve resigned as a member of the reddit board, I have urged them to fill my seat with a black candidate, + I will use future gains on my Reddit stock to serve the black community, chiefly to curb racial hate, and I’m starting with a pledge of $1M to  @kaepernick7’s  @yourrightscamp\n— Alexis Ohanian Sr. (@alexisohanian)  June 5, 2020\n Reddit is a global forum, and one of the earliest mass gathering places online that popularized and prioritized the idea of unrestricted free speech. Its stance has changed more recently.\n Over the last couple years,  Reddit has started to proactively ban the kinds of communities it would have tolerated before Donald Trump’s election as president, like the QAnon subreddit or the alt-right r/MillionDollarExtreme. But it hasn’t been perfect. Just this week, former CEO Ellen Pao —  who resigned after users revolted over changes to the site during her tenure — took Reddit to task over its historical tolerance of racism and white supremacist thought.\n I am obligated to call you out: You should have shut down the_donald instead of amplifying it and its hate, racism, and violence. So much of what is happening now lies at your feet. You don&#39;t get to say BLM when reddit nurtures and monetizes white supremacy and hate all day long  https://t.co/VN5XCiYp5g\n— Ellen K. Pao (@ekp)  June 2, 2020\n Ohanian’s desire to do some good with his power and position is admirable, but it doesn’t erase the harm Reddit has done because of its commitment to speech above all else.\n I believe resignation can actually be an act of leadership from people in power right now. To everyone fighting to fix our broken nation: do not stop. https://t.co/LWI1OnCaVi\n— Alexis Ohanian Sr. (@alexisohanian)  June 5, 2020\n Reddit CEO  Steve Huffman wrote in a post Friday that the company would honor Ohanian’s request to replace him with a black candidate. “We’re working with mods to change our content policy to explicitly address hate,” Huffman added. “I want to take responsibility for the history of our policies over the years that got us here, and we still have work to do.”", "posttime": "2020-06-06 03:42:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "西斯,ohanian,reddit", "title": "亚历克西斯·奥哈尼安(Alexis Ohanian)从Reddit辞职，要求由黑人候选人接替他的职位", "title_en": "Alexis Ohanian asks to be replaced by black candidate as he resigns from Reddit", "transed": 1, "url": "https://www.theverge.com/2020/6/5/21281744/reddit-co-founder-alexis-ohanian-resigns-board", "via": "", "real_tags": ["西斯", "ohanian", "reddit"]}, {"category": "", "categoryclass": "", "imagename": "c4319da3500309ad8d2e9fde44bb66ac.jpg", "infoid": 1005336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1965年，英特尔(Intel)联合创始人戈登·摩尔(Gordon Moore)预测，计算机芯片上可以容纳的晶体管数量将呈指数级增长--事实的确如此，大约每两年翻一番。半个世纪以来，摩尔定律一直存在：计算机变得更小、更快、更便宜、更高效，使得个人电脑、智能手机、高速互联网等在全球范围内迅速普及。这种小型化趋势导致了今天的硅芯片具有几乎不可想象的小电路。晶体管，即实现计算机微处理器的微小开关，如此之小，以至于1000个首尾相连的晶体管还不到一根头发那么宽。在很长一段时间里，晶体管越小，它们切换的速度就越快。\n但今天，我们正在接近晶体管可以小到什么程度的极限。因此，在过去的十年里，研究人员一直在绞尽脑汁寻找其他方法来提高性能，以便计算机行业能够继续创新。\n虽然我们在等待量子、碳纳米管或光子学等新计算技术的成熟(这可能需要一段时间)，但随着摩尔定律的终结，还需要其他方法来提高性能。在最近发表在“科学”杂志上的一篇期刊文章中，CSAIL的一个团队确定了继续提高计算速度需要优先考虑的三个关键领域：更好的软件和更精简的硬件。\n资深作者Charles E.Leiserson说，几十年来，小型化带来的性能好处是如此之大，以至于程序员能够优先考虑让代码编写变得更容易，而不是让代码本身运行得更快。这种趋势带来的低效是可以接受的，因为更快的速度总是能够弥补不足。\n不过，麻省理工学院电气工程与计算机科学系埃德温·西布利·韦伯斯特(Edwin Sibley Webster)教授莱瑟森表示，如今，要想在机器学习、机器人和虚拟现实等领域取得更大进展，将需要巨大的计算能力，而小型化已经无法提供这些能力。如果我们想要充分利用这些技术的潜力，我们必须改变我们的计算方式。\n莱瑟森与研究科学家尼尔·汤普森、丹尼尔·桑切斯教授、兼职教授巴特勒·兰普森以及研究科学家乔尔·埃默、布拉德利·库兹毛尔和陶沙德尔共同撰写了这篇论文。它将发表在本周出版的下期“科学”杂志上。\n对于软件，他们说，程序员以前把生产力放在性能之上的优先顺序导致了一些有问题的策略，比如减少：取处理问题A的代码，并用它来解决问题B。例如，如果有人必须创建一个系统来识别是或否，但不想编写一个全新的自定义程序，他们可以使用一个能够识别广泛单词的现有程序，并将其调整为只对是或否的答案做出响应。\n虽然这种方法减少了编码时间，但它产生的低效很快就会加剧：如果单个缩减的效率是自定义解决方案的80%，然后添加20层缩减，那么代码的效率最终将比它可能的效率低100倍。\n汤普森说，随着硬件改进速度的放缓，程序员必须重新考虑这些策略。如果我们想继续获得我们已经习惯的提速，我们就不能继续照常做生意。\n取而代之的是，研究人员推荐像并行化代码这样的技术。许多现有的软件都是使用古老的假设设计的，即处理器一次只能执行一项操作。但近年来，多核技术使复杂任务的完成速度提高了数千倍，并以更节能的方式完成。\n没有参与该项目的赖斯大学(Rice University)计算工程教授摩西·瓦迪(Mohe Vardi)表示：既然摩尔定律不会在银盘上给我们带来更好的性能，我们将不得不以艰难的方式提供性能。这是计算研究的大好机会，[麻省理工学院CSAIL]报告为此类研究提供了路线图。\n对于算法，该团队建议了一个三管齐下的方法，包括探索新的问题领域，解决对算法如何扩展的担忧，以及对它们进行调整以更好地利用现代硬件。\n在方面，该团队主张精简硬件，这样可以用更少的晶体管和更少的硅来解决问题。精简包括使用更简单的处理器和创建为特定应用程序量身定做的硬件，如图形处理器(GPU)是为计算机图形量身定做的。\nSchardl说，为特定领域定制的硬件可以更高效，使用更少的晶体管，使应用程序的运行速度提高数十到数百倍。更广泛地说，硬件精简将进一步鼓励并行编程，创造额外的芯片面积，用于更多可以并行操作的电路。\n虽然这些方法可能是最好的前进道路，但研究人员说，这并不总是一帆风顺的。使用这种技术的组织可能直到投入了大量的工程时间之后才知道他们努力的好处。此外，提速不会像摩尔定律那样一致：它们可能在一开始是戏剧性的，然后需要大量的努力才能做出较小的改进。\n汤普森表示，对于谷歌(Google)和亚马逊(Amazon)这样的科技巨头来说，其数据中心的巨大规模意味着，即使是软件性能的微小改进也能带来巨大的财务回报。但是，虽然这些公司可能是领头羊，但其他许多公司如果想要保持竞争力，就需要认真对待这些问题。\n要在团队确定的领域得到改善，还需要建立使其成为可能的基础设施和劳动力。\nLeiserson说，性能增长将需要新的工具、编程语言和硬件来促进更多更好的性能工程。这也意味着计算机科学家可以更好地了解如何让软件、算法和硬件协同工作，而不是把它们放在不同的竖井里。\n减少是指您提取处理问题A的代码，并使用它来解决问题B。(例如，如果某人必须创建一个识别是或否语音命令的系统，但又不想编写一个全新的自定义程序，那么他们可以采用一个能够识别大范围单词的现有程序，并将其调整为只对是或否的答案作出响应。)。\n虽然这种方法减少了编码时间，但它产生的低效很快就会加剧：如果单个缩减的效率是自定义解决方案的80%，然后添加20层缩减，那么代码的效率最终将比它可能的效率低100倍。更多信息：查尔斯·E·莱瑟森(Charles E.Leiserson)等人。顶层有很大的空间：在摩尔定律、科学(2020)之后，什么将推动计算机性能？网址：10.1126/cience.aam9744", "note_en": "In 1965, Intel co-founder Gordon Moore predicted that the number of transistors that could fit on a computer chip would grow exponentially —- and they did, doubling about every two years. For half a century Moore&#39;s Law has endured: computers have gotten smaller, faster, cheaper and more efficient, enabling the rapid worldwide adoption of PCs, smartphones, high-speed Internet and more.    This miniaturization trend has led to silicon chips today that have almost unimaginably small circuitry. Transistors, the tiny switches that implement computer microprocessors, are so small that 1000 of them laid end-to-end are no wider than a human hair. For a long time, the smaller the transistors were, the faster they could switch.\n  But today, we&#39;re approaching the limit of how small transistors can get. As a result, over the last decade researchers have been scratching their heads to find other ways to improve performance so that the computer industry can continue to innovate.\n  While we wait for the maturation of new computing technologies like quantum, carbon nanotubes, or photonics (which may take a while), other approaches will be needed to get performance as Moore&#39;s Law comes to an end. In a recent journal article published in  Science, a CSAIL team identifies three key areas to prioritize to continue to deliver computing speed-ups: better software,   and more streamlined hardware.\n  Senior author Charles E. Leiserson says that the performance benefits from miniaturization have been so great that, for decades, programmers have been able to prioritize making the writing of code easier rather than making the code itself run faster. The inefficiency that this tendency introduces has been acceptable, because faster   have always been able to pick up the slack.\n  &#34;But nowadays, being able to make further advances in fields like machine learning, robotics and virtual reality will require huge amounts of computational power that miniaturization can no longer provide,&#34; says Leiserson, the Edwin Sibley Webster Professor in MIT&#39;s Department of Electrical Engineering and Computer Science (EECS). &#34;If we want to harness the full potential of these technologies, we must change our approach to computing.&#34;\n  Leiserson co-wrote the paper with research scientist Neil Thompson, professor Daniel Sanchez, adjunct professor Butler Lampson and research scientists Joel Emer, Bradley Kuszmaul and Tao Schardl. It will be published in the next issue of  Science, out this week.\n         With software, they say that programmers&#39; previous prioritization of productivity over performance has led to problematic strategies like &#34;reduction&#34;: taking code that worked on problem A, and using it to solve problem B. For example, if someone has to create a system to recognize yes-or-no  , but doesn&#39;t want to code a whole new custom program, they could take an existing program that recognizes a wide range of words, and tweak it to respond only to yes-or-no answers.\n  While this approach reduces coding time, the inefficiencies it creates quickly compound: if a single reduction is 80 percent as efficient as a custom solution, and you then add twenty layers of reduction, the code will ultimately be 100 times less efficient than it could be.\n   &#34;These are the kinds of strategies that programmers have to rethink as hardware improvements slow down,&#34; says Thompson. &#34;We can&#39;t keep doing &#39;business as usual&#39; if we want to continue to get the speed-ups we&#39;ve grown accustomed to.&#34;\n  Instead, the researchers recommend techniques like parallelizing code. Much existing software has been designed using ancient assumptions that processors can only do only one operation at a time. But in recent years multicore technology has enabled complex tasks to be completed thousands of times faster and in a much more energy-efficient way.\n  &#34;Since Moore&#39;s Law will not be handing us improved performance on a silver platter, we will have to deliver performance the hard way,&#34; says Moshe Vardi, a professor in computational engineering at Rice University who was not part of the project. &#34;This is a great opportunity for computing research, and the [MIT CSAIL] report provides a road map for such research.&#34;\n  For algorithms, the team suggests a three-pronged approach that includes exploring new problem areas, addressing concerns about how algorithms scale, and tailoring them to better take advantage of modern hardware.\n  In terms of  , the team advocates that hardware be streamlined so that problems can be solved with fewer transistors and less silicon. Streamlining includes using simpler processors and creating hardware tailored to specific applications, like the graphics-processing unit (GPU) is tailored for computer graphics.\n  &#34;Hardware customized for particular domains can be much more efficient and use far fewer transistors, enabling applications to run tens to hundreds of times faster,&#34; says Schardl. &#34;More generally, hardware streamlining would further encourage parallel programming, creating additional chip area to be used for more circuitry that can operate in parallel.&#34;\n  While these approaches may be the best path forward, the researchers say that it won&#39;t always be an easy one. Organizations that use such techniques may not know the benefits of their efforts until after they&#39;ve invested a lot of engineering time. Plus, the speed-ups won&#39;t be as consistent as they were with Moore&#39;s Law: they may be dramatic at first, and then require large amounts of effort for smaller improvements.\n    &#34;For tech giants like Google and Amazon, the huge scale of their data centers means that even small improvements in software performance can result in large financial returns,&#34; says Thompson. &#34;But while these firms may be leading the charge, many others will need to take these issues seriously if they want to stay competitive.&#34;\n  Getting improvements in the areas identified by the team will also require building up the infrastructure and workforce that make them possible.\n  &#34;Performance growth will require new tools, programming languages and hardware to facilitate more and better performance engineering,&#34; says Leiserson. &#34;It also means computer scientists being better educated about how we can make software, algorithms and hardware work together, instead of putting them in different silos.&#34;\n      Reduction is when you take code that worked on problem A, and use it to solve problem B. (For example, if someone has to create a system to recognize yes-or-no voice commands, but doesn&#39;t want to code a whole new custom program, they could take an existing program that recognizes a wide range of words, and tweak it to respond only to yes-or-no answers.)\n  While this approach reduces coding time, the inefficiencies it creates quickly compound: if a single reduction is 80 percent as efficient as a custom solution, and you then add 20 layers of reduction, the code will ultimately be 100 times less efficient than it could be.        More information:\t\t\t\t\t\t\t\t\t\t\t\tCharles E. Leiserson et al. There&#39;s plenty of room at the Top: What will drive computer performance after Moore&#39;s law?,  Science (2020).  DOI: 10.1126/science.aam9744", "posttime": "2020-06-06 03:24:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,开发,不能,smaller,需要", "title": "如果晶体管不能变得更小，那么软件开发人员就必须变得更聪明", "title_en": "If transistors can't get smaller, then software developers have to get smarter", "transed": 1, "url": "https://techxplore.com/news/2020-06-transistors-smaller-software-smarter.html", "via": "", "real_tags": ["软件", "开发", "不能", "smaller", "需要"]}, {"category": "", "categoryclass": "", "imagename": "1975dc0e42e3eab67dc91fd094e1cecd.jpg", "infoid": 1005335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了解决系统性种族主义问题，亚历克西斯·奥哈尼安(Alexis Ohanian)要求用一名黑人成员取代董事会成员。\n他承诺将他的Reddit股票收益投资于造福黑人社区的项目。\n2005年与人共同创立社交媒体聚合网站Reddit的亚历克西斯·奥哈尼安(Alexis Ohanian)今天宣布，他已从公司董事会辞职，并敦促其余董事会成员用一名黑人候选人取代他。\n奥哈尼安还表示，他将把从Reddit股票中获得的收益再投资于服务黑人社区，主要是为了遏制种族仇恨。他的第一笔捐款是承诺给前旧金山49人队四分卫科林·凯珀尼克(Colin Kaepernick)的“了解你的权利营”(Know Your Rights Camp)。\n奥哈尼安嫁给了网球明星塞雷娜·威廉姆斯(Serena Williams)，他说他觉得有必要这么做，这样当他黑人女儿问他，你做了什么时，他就可以回答她了。\n这一举措正值美国开始与系统性种族主义作斗争，此前发生了几起备受瞩目的黑人公民死于警察之手的事件。\n奥哈尼安认为，他可以提供帮助的一种方式是在一个缺乏黑人代表的竞技场上让位。Black Enterprise的2019 Power in the董事会报告发现，37%的标准普尔500指数成份股公司没有黑板成员。这包括思科、甲骨文和Intuit等大型科技公司。\nReddit的小董事会位于标准普尔500指数之外，目前也没有黑人成员。它由奥哈尼安、康泰纳仕的高管罗伯特·索尔伯格、OpenAI的萨姆·奥特曼和个人资本公司的波特·盖尔组成。\n虽然他在美国访问量最大的网站之一担任的高管职位可以为奥哈尼安提供一个巨大的平台，但他离开Reddit的全职职位可能会让他更多地专注于向拥有不同领导团队的项目投入大量资金。\nOhanian共同创立的风险投资公司Initialized Capital已经投资了Coinbase等密码初创公司，并在3月份牵头了对Horizon Block Chain Games的一轮投资。通过将他的激进主义与他的钱包相结合，奥哈尼安可以帮助改变密码项目的竞争环境，这些项目通常旨在纠正系统性的不公正。\n例如，Coinbase在2月份报告称，美国黑人受到当前金融体系负面影响的可能性是白人的两倍。", "note_en": "In a bid to address systemic racism, Alexis Ohanian asked to be replaced on the board with a black member.\n   He has pledged to invest his Reddit stock earnings to projects that benefit the black community.\n Alexis Ohanian, who co-founded the social media aggregator site Reddit in 2005, announced today that he has resigned from the company&#39;s board of directors and urged the remaining board members to replace him with a black candidate.\n Ohanian also said he would reinvest gains from his Reddit stock &#34;to serve the black community, chiefly to curb racial hate.&#34; His first donation was a pledge to former San Francisco 49ers&#39; quarterback Colin Kaepernick&#39;s   Know Your Rights Camp .\n   Ohanian, who is married to tennis star Serena Williams, said he felt compelled to make the move so he can answer his black daughter when she asks, &#34;What did you do?&#34;\n The move comes as the nation begins to grapple with systemic racism in the wake of several high-profile deaths of black citizens at the hands of police.\n Ohanian felt that one way he could help was by stepping aside in an arena where black representation is lacking.   Black Enterprise &#39;s 2019 Power in the Boardroom  report  found that  37% of S&amp;P 500 companies had no black board members. That included major tech firms like Cisco, Oracle, and Intuit.\n  The small board at Reddit, which lies outside of the S&amp;P 500, currently has no black members either. It&#39;s comprised of Ohanian, Condé Nast executive Robert Sauerberg, OpenAI&#39;s Sam Altman, and Personal Capital Corporation&#39;s Porter Gale.\n Although his executive post for one of the country&#39;s most-visited websites would conceivably give Ohanian a large platform, his full-time move away from Reddit may allow him to focus more on pouring money into projects with diverse leadership teams.\n  Initialized Capital , a venture capital firm Ohanian co-founded, has already invested in crypto startups such as Coinbase, and it   led an investment round  in Horizon Blockchain Games in March. By pairing his activism with his pocketbooks, Ohanian could help change the playing field for crypto projects, which often aim to redress systemic injustices.\n Coinbase, for instance,  reported in February  that  black Americans were twice as likely to &#34;have been negatively impacted by the current financial system as white Americans.&#34;", "posttime": "2020-06-06 03:24:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联合,founder,黑人", "title": "Reddit联合创始人辞职打击种族不公正", "title_en": "Reddit co-founder resigns to fight racial injustice", "transed": 1, "url": "https://decrypt.co/31436/reddit-co-founder-resigns-fight-racial-injustice", "via": "", "real_tags": ["联合", "founder", "黑人"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我到处听到关于Crystal编程语言的消息，但直到昨天才有机会去看一看。\n什么是水晶？它是一种静态类型的、编译的、面向对象的语言，其语法深受Ruby的启发。\n其网站上的承诺是，该语言像C一样快，像Ruby一样流畅。这句话听起来令人兴奋，让您想看看Crystal与Ruby相比有多快。当然，这不是一个公平的比较，因为一个是编译语言，另一个是解释语言(下面使用的Ruby MRI实现)。\n从Crystal的网站上摘取的一个基本HTTP服务器的实现按预期工作，代码看起来确实像Ruby的：\n要求&#34；http/server&#34；server=HTTP：：server。新建DO|Context|Context。回应。content_type=&#34；文本/纯文本&#34；上下文。回应。打印&#34；Hello world，获得#{上下文。请求。PATH}！&#34；END PUT&#34；侦听http://127.0.0.1:8080&#34；服务器。聆听(8080)。\n让我们用Ruby和Crystal编写一些代码，为给定的数字生成斐波纳契数列。然后，我们可以查看查找序列中第46个数字(即1，836，311，903)所需的时间。稍后你就会明白我为什么选这个号码了。\n如果我们试图找到斐波纳契序列中的下一个，第47个数字，Crystal实际上会给我们一个错误：\n未经处理的异常：Fibonacci中的Fibonacci中的算术溢出(OverflowError)。cr：6：6 in&#39；__Crystal_Main&#39；中的/usr/local/Cellar/crystal/0.34.0/src/crystal/main.cr:105:5 in&#39；Main&#39；\n如果您还记得Crystal是一种静态类型的语言，但是您可以省略显式类型限制，编译器会尝试推断变量的类型。在我们的代码中，Crystal对n变量使用Int32类型，它的最大值为2，147，483，647，但是第47个数字更高。在本例中，我们需要指定n的类型。我们可以使用无符号整数64。\n我们可以优化代码并引入记忆化，以返回先前计算的数字的缓存结果。\ndef Fibonacci(n，cache=[0，1])如果cache[n]cache[n]=Fibonacci(n-1，cache)+Fibonacci(n-2，cache)end放入斐波纳契数(100)，则返回cache[n]。\ndef fibonacci(n，cache=[0，1]of UInt128)如果cache[n]？(cache&lt；&lt；&lt；fibonacci(n-1，cache)+Fibonacci(n-2，cache))[-1]end放置斐波纳奇数(100)，则返回cache[n]。\n当我们尝试寻找斐波纳契序列中相当大的第100个数字时：354,224,848,179,261,915,075，结果如下：\n这表明，必须首先优化的是算法，而不是选择一种速度更快的语言或机器。\n水晶碎片数据库-就像水晶的Ruby工具箱", "note_en": "I’ve been hearing about the  Crystal programming language here and there over the last couple of years but never had a chance to give it a look until yesterday.\n What is Crystal? It’s a statically type, compiled, object-oriented language with syntax heavily inspired by Ruby’s.\n The promise on its site is that the language is fast as C, sleek as Ruby. This statement sounds exciting and makes you want to check how fast Crystal is comparing to Ruby. Of course, it won’t be a fair comparison since one is a compiled language and another is an interpreted one (the Ruby MRI implementation used below).\n       An implementation of a basic HTTP server taken from the Crystal’s web site works as expected and the code indeed looks like Ruby’s:\n require  &#34;http/server&#34; server  =  HTTP :: Server . new  do  | context |  context . response . content_type  =  &#34;text/plain&#34;  context . response . print  &#34;Hello world, got  #{ context . request . path } !&#34; end puts  &#34;Listening on http://127.0.0.1:8080&#34; server . listen ( 8080 )\n  Let’s write some code in Ruby and Crystal to generate a Fibonacci sequence for a given number. We can then see how much time it takes to find the 46th number (which is 1,836,311,903) in the sequence. You will see in a bit why I picked this number.\n        If we try to find the next, 47th number in the Fibonacci sequence, Crystal will actually give us an error:\n Unhandled exception: Arithmetic overflow (OverflowError) from fibonacci from fib.cr:6:6 in &#39;__crystal_main&#39; from /usr/local/Cellar/crystal/0.34.0/src/crystal/main.cr:105:5 in &#39;main&#39;\n  If you recall Crystal is a statically typed language but you can omit explicit type restriction and the compiler will try to infer the type of variable. In our code Crystal uses the Int32 type for the n variable which has the maximum value of 2,147,483,647 but the 47th number is higher. In this case we need to specify the type of n. We can use Unsigned Int 64.\n    We can optimize our code and introduce memoization to return cached results of the previously calculated numbers.\n  def  fibonacci ( n ,  cache  =  [ 0 ,  1 ])  return  cache [ n ]  if  cache [ n ]  cache [ n ]  =  fibonacci ( n - 1 ,  cache )  +  fibonacci ( n - 2 ,  cache ) end puts  fibonacci ( 100 )\n  def  fibonacci ( n ,  cache  =  [ 0 ,  1 ]  of  UInt128 )  return  cache [ n ]  if  cache [ n ]?  ( cache  &lt;&lt;  fibonacci ( n - 1 ,  cache )  +  fibonacci ( n - 2 ,  cache ))[ - 1 ] end puts  fibonacci ( 100 )\n When we try to find the 100th number in the Fibonacci sequence which is pretty big: 354,224,848,179,261,915,075 we end up with the following results:\n  Which makes the point that what has to be optimized first is the algorithm and not picking up a faster language or machine.\n    A Database of Crystal Shards - it’s like the Ruby Toolbox for Crystal", "posttime": "2020-06-06 03:06:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,性能,水晶,crystal", "title": "红宝石与水晶性能对比", "title_en": "Ruby vs. Crystal Performance", "transed": 1, "url": "https://ptimofeev.com/ruby-vs-crystal-performance/", "via": "", "real_tags": ["ruby", "性能", "水晶", "crystal"]}, {"category": "", "categoryclass": "", "imagename": "98aa4dc1ecb29d00c69465fe9745dce3.jpg", "infoid": 1005333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "知情人士告诉CNBC，正在调查谷歌潜在违反反垄断行为的州总检察长倾向于推动拆分其广告技术业务，这是预计将提起的诉讼的一部分。\n近几个月来，50名司法部长一直在调查谷歌的商业行为，与此同时，美国司法部也在领导一项类似的调查。知情人士告诉CNBC，美国各州和美国司法部都在寻求在未来几个月内对这家互联网巨头提起诉讼。\n知情人士说，各州和司法部尚未正式决定是否合并他们预期的诉讼，尽管他们一直在密切合作。两家公司一直在调查谷歌的搜索、广告技术和安卓业务。\n其中一位消息人士称，调查谷歌的总检察长尚未明确排除推动其广告技术业务替代方案的可能性，比如对其业务运营方式施加限制。谷歌隶属于Alphabet，港湾。诉讼还可能包括推动这一选择和拆分广告技术业务。\n如果总检察长积极寻求拆分谷歌的广告技术业务，那将是值得注意的。虽然监管执法机构最近青睐−拆分和资产剥离的结构性补救措施，但监管机构可以找到不那么繁琐的解决方案，比如通过同意法令禁止某些行为。\n一旦总检察长提起预期的诉讼，他们就有许多工具可供他们使用，以表明他们有意推动拆分谷歌的广告技术业务。这包括他们所声称的，他们介绍的证据，审判前的简报会和新闻发布会。\n一些律师表示，在谷歌的案例中，推动拆分其广告技术业务可能很困难，因为它不是作为一个容易剥离的独立部门而存在的。它的两笔主要交易，2007年的DoubleClick和2009年的AdMob，都是几年前的事了。\n20年前微软(Microsoft)反垄断案的政府律师之一斯蒂芬·霍克(Stephen Houck)表示：法院非常担心，拆分一家公司会伤害消费者，并让那些没有这样做的专业知识的人的情况变得更糟。\n虽然谷歌大约1610亿美元的收入中有大部分来自广告销售，但它从作为这项业务支柱的软件和技术中获得的收入要小得多。其网络会员业务，包括AdMob，AdSense和Google Ad Manager，在上一财年创造了约220亿美元的销售额。\n谷歌在2018年停用了DoubleClick这个名称，将面向广告商的DoubleClick产品与谷歌分析360(Google Analytics 360)放在一起，成为谷歌营销平台。然后，谷歌将面向出版商的DoubleClick产品和DoubleClick广告交易所放入了谷歌广告管理器(Google Ad Manager)。\n尽管政府过去曾成功地争取拆分企业巨头，包括1911年的标准石油(Standard Oil)和20世纪80年代的美国电话电报公司(AT&amp；T)，但最近的案例实施的补救措施较弱。上世纪80年代的IBM和2000年的微软都在没有拆分各自公司的情况下结束了反垄断诉讼。\n唐纳德·特朗普(Donald Trump)总统与其他共和党人一起指控谷歌(Google)等公司审查保守内容，谷歌否认了这一指控。本月早些时候，他签署了一项行政命令，誓言要通过通信体面法案(Communications Decency Act)第230条打击谷歌等互联网公司的责任保护。\n司法部长威廉·巴尔(William Barr)出席了这项行政命令的签署仪式。在谷歌最高反垄断官员马坎·德拉希姆(Makan Delrahim)回避后，巴尔的副手最近接手了司法部对谷歌的反垄断调查。\n总统候选人乔·拜登(Joe Biden)担任巴拉克·奥巴马(Barack Obama)的副总统，奥巴马因允许科技公司在他的领导下变得过于强大而受到批评。拜登曾表示，作为总统，他将在司法部内设立一个新部门，回去研究已经发生的大型合并和正在提议发生的合并。\n谷歌的一位发言人在一份声明中告诉CNBC，我们继续参与由司法部和司法部长帕克斯顿领导的正在进行的调查，我们没有任何关于猜测的最新消息或评论。\n事实很清楚，她补充说，我们的数字广告产品在一个拥挤的行业中与数百个竞争对手和技术竞争，并帮助降低了广告商和消费者的成本。她补充说，我们的数字广告产品在这个拥挤的行业中与数百家竞争对手和技术竞争，帮助降低了广告商和消费者的成本。\n德克萨斯州司法部长肯·帕克斯顿(Ken Paxton)的发言人拒绝置评。帕克斯顿负责调查的广告技术部分。美国司法部发言人没有回复记者的置评请求。\n批评人士称，谷歌将其广告工具捆绑在一起，这样竞争对手就无法与其提供的产品相匹敌，而且它对搜索结果、YouTube、Gmail和其他服务的运营阻碍了广告竞争。他们还表示，谷歌拥有出售和购买广告的拍卖交易所的所有方面，这让它获得了不公平的优势。\n谷歌辩称，它还在与许多垂直整合的公司竞争，包括美国电话电报公司(AT&amp；T)、康卡斯特(Comcast)和威瑞森(Verizon)。与此同时，圣路易斯联邦储备银行(St.Louis Federal Reserve)的数据显示，数字广告产品的价格自2010年以来下降了40%以上。\n虽然目前尚不清楚司法部长可能会以何种方式拆分谷歌的广告技术业务，但谷歌斥资31亿美元收购DoubleClick为其在广告技术领域提供了关键的立足点。联邦贸易委员会(Federal Trade Commission)以4比1的投票结果决定，它不会寻求阻止这笔交易，裁定它不是反竞争的。\n反对票帕梅拉·琼斯(Pamela Jones)当时辩称，她担心这笔交易会通过DoubleClick提供的数据赋予谷歌太多权力。\n她写道，通过收购DoubleClick，谷歌将获得有助于并加剧网络效应的数据。因此，谷歌和DoubleClick的合并很可能会使搜索和显示市场对谷歌有利，并使任何其他公司更难挑战合并后的公司。\n琼斯补充说，合并后的谷歌和DoubleClick可以获得无与伦比的数据源，这将使谷歌能够以竞争对手无法比拟的方式匹配广告买家和卖家。\n根据CNBC获得的一份法庭记录，谷歌的一名律师今年早些时候在德克萨斯州一家法院表示，总检察长的调查正在寻求有关谷歌广告技术客户姓名和产品定价细节的非常详细的信息。他说，调查集中在谷歌的DoubleClick和AdMob业务上。\n就谷歌而言，它在去年的一篇博客文章中辩称，广告技术行业是出了名的拥挤，并援引了电信(Telaria)、卢比孔项目(Rubicon Project)和贸易台(Trade Desk)等竞争对手的话。它还表示，出版商使用它的技术来获取数百个合作伙伴的需求，而广告商使用它的技术在80多个交易所购买广告空间。", "note_en": "The state attorneys general investigating Google for potential antitrust violations are leaning towards pushing for a breakup of its ad technology business as part of an expected suit, people familiar with the situation told CNBC.\n Fifty attorneys general have been probing Google&#39;s business practices for months, alongside a similar probe being led by the U.S. Department of Justice. Both the states and the DOJ are looking to file a suit against the internet giant as soon as within the next few months, people familiar with the situation told CNBC.\n  The states and the Justice Department have not yet officially decided whether to combine their expected suits, the people said,  though they have been collaborating closely. Both  have been investigating Google&#39;s search, ad technology and android business.\n The attorneys general investigating Google, which is owned by  Alphabet, haven&#39;t yet definitively ruled out pushing for alternatives for its ad technology business, like imposing restrictions on how it runs its business, one of the sources said. A suit may also include a push for both that option and breaking up the ad tech business.\n Should the attorneys general aggressively pursue a break up of Google&#39;s ad technology business, it would be notable. While regulatory enforcement agencies have recently favored &#34;structural remedies&#34; − break-ups and divestitures − regulators have less onerous solutions available, like barring certain behaviors through a consent decree.\n Once the attorneys general file their expected lawsuit, they have a number of tools at their disposal to signal their intent to push for a breakup of Google&#39;s ad technology business. That includes what they allege, the evidence they introduce, pre-trial briefings and press conferences.\n In Google&#39;s case, pushing for a break up of its ad technology business may be difficult, some lawyers say, because it does not exist as a stand-alone unit easily hived off. And its two main deals,  DoubleClick in 2007 and AdMob in 2009, were years ago.\n  &#34;Courts are very concerned that by ripping a company apart, it hurts consumers and make it worse for people that don&#39;t have the expertise to do that,&#34; said Stephen Houck, one of the government lawyers in the  Microsoft antitrust case two decades ago.\n While Google generates the majority of its roughly $161 billion in revenue from ad sales, the revenue it gets from the software and technology that serve as the backbone of that business is far smaller. Its Network Members business, which includes AdMob, AdSense, and Google Ad Manager, generated about $22 billion in sales the last fiscal year.\n Google retired the DoubleClick name in 2018,  putting its DoubleClick products for advertisers together with Google Analytics 360 to become the &#34;Google Marketing Platform.&#34; Then it put its DoubleClick products for publishers and the DoubleClick ad exchange into the &#34;Google Ad Manager.&#34;\n While the government has successfully fought for a break up of corporate giants in the past, including Standard Oil in 1911 and AT&amp;T in the 1980s, more recent cases have imposed weaker remedies. Both  IBM in the 1980s and Microsoft in 2000 concluded antitrust suits without breaking up the respective companies.\n  President Donald Trump has alleged, along with other Republicans, that companies like Google censor conservative content, a claim Google has denied. He earlier this month  signed an executive order vowing to crack down on the liability protections internet companies like Google through section 230 of the Communications Decency Act.\n Attending the signing of that executive order was Attorney General William Barr, whose deputy recently  took leadership of the Justice Departments&#39; antitrust investigation into Google, after the country&#39;s top antitrust official, Makan Delrahim, recused himself.\n Presidential candidate Joe Biden served as vice president to  Barack Obama, who has been criticized for allowing tech companies to become too powerful on his watch. Biden has said that, as president,  he would set up a new department within the Justice Department to go back and look at the mega-mergers that have occurred and those who are being proposed to occur.\n A spokesperson for Google told CNBC in a statement, &#34;We continue to engage with the ongoing investigations led by the Department of Justice and Attorney General Paxton, and we don&#39;t have any updates or comments on speculation.&#34;\n &#34;The facts are clear,&#34; she added, &#34;our digital advertising products compete across a crowded industry with hundreds of rivals and technologies, and have helped lower costs for advertisers and consumers.&#34;\n A spokesperson for Texas Attorney General Ken Paxton, who is leading the ad tech part of the probe, declined to comment. A spokesperson for DOJ did not respond to a request for comment.\n  Critics have said that Google bundles its ad tools so that rivals can&#39;t afford to match its offerings and that its operation of search results, YouTube, Gmail and other services to hinder ad competition. They also say that Google owns all sides of the &#34;auction exchange&#34; through which ads are sold and bought, giving it an unfair advantage.\n Google has argued it competes with many vertically integrated players including  AT&amp;T,  Comcast, and  Verizon. Data from the St. Louis Federal Reserve, meantime, show that the price of digital advertising  has fallen by more than 40% since 2010.\n While it remains unclear in what fashion the attorneys general might push to break up Google&#39;s ad tech business,  Google&#39;s $3.1 billion acquisition of DoubleClick provided it the crucial foothold into advertising technology. The Federal Trade Commission decided in a 4-1 vote it would not seek to block the deal, ruling that it was not anti-competitive.\n The dissenting vote, Pamela Jones, argued at the time she worried the deal would give Google too much power by way of the data that DoubleClick provides.\n &#34;By purchasing DoubleClick, Google will acquire data that will contribute to, and exacerbate, network effects,&#34; she wrote. &#34;As a result, the Google/DoubleClick combination is likely to &#39;tip&#39; both the search and display markets in Google&#39;s favor, and make it more difficult for any other company to challenge the combined firm.&#34;\n Jones added that the combined Google and DoubleClick could get access to &#34;unparalleled data sources&#34; that would allow it to match up buyers and sellers of ads in a way its competitors could not.\n A lawyer for Google said in a Texas court earlier this year the attorneys general probe was seeking &#34;very detailed information&#34; on the names of Google&#39;s ad tech customers and details pertaining to product pricing, according to a court transcript obtained by CNBC. Inquiries focused on Google&#39;s DoubleClick and AdMob businesses, he said.\n For its part, Google argued in a blog post last year the ad technology industry is &#34;famously crowded,&#34; citing competitors like Telaria, Rubicon Project and The Trade Desk. It also said publishers use its technology &#34;to access demand from hundreds of partners,&#34; while advertisers use its technology to buy ad space &#34;on more than 80 exchanges.&#34;", "posttime": "2020-06-06 03:05:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,谷歌,google,拆分,lean", "title": "美国各州倾向于拆分谷歌的广告技术业务", "title_en": "U.S. states lean toward breaking up Google's ad tech business", "transed": 1, "url": "https://www.cnbc.com/2020/06/05/states-lean-toward-pushing-to-break-up-googles-ad-tech-business.html", "via": "", "real_tags": ["广告", "谷歌", "google", "拆分", "lean"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年11月28日：我在结尾处添加了一个小更新，介绍如何使用每个插槽生成计数器防止“处理冲突”\n…。其中我稍微谈了一下最近我是如何在C和C++中进行动态内存管理的，它基本上是用“索引句柄”取代了原始指针和智能指针。\n在我上一篇博客文章中，我提到了免指针和免分配编程，但是跳过了细节。这就是下面这篇博文的主题。\n这一切都是基于与相当大的C++代码库(0.5到1MLOC)搏斗了15年以上(有时很痛苦)的经历，在这些代码库中，内存通常是通过智能指针来管理的。最糟糕的情况是数以万计到几十万个小C++对象，每个对象都在自己的堆分配中，通过智能指针相互指向。虽然这类代码在内存损坏方面相当健壮(段错误和损坏很少发生，因为大多数尝试在解除引用智能指针时都被断言捕获)，但这种类型的“对象蜘蛛网络代码”也非常慢，没有明显的优化起点，因为整个代码充满了缓存未命中。其他典型的问题是内存碎片和“假内存泄漏”，因为忘记的智能指针会阻止释放底层内存(我称之为“假泄漏”，因为内存调试工具无法捕获这种类型的泄漏)。\n这里介绍的并不是什么特别新或特别聪明的东西，它只是收集了一些简单的想法，它们一起在较大的代码库中工作得相当好，可以防止(或至少早期检测)C和C++中与内存有关的一些常见问题，甚至在更高级别的垃圾收集语言中可能会很有用，以减轻垃圾收集器的压力。\n然而，底层的设计哲学并不能很好地适应典型的OOP世界，在这个世界中，应用程序是由相互交互的小型自主对象构建的。这就是为什么在现有的大型OOP代码库中实现这些想法也相当棘手的原因，在那里，对象的创建和销毁发生在整个代码中“分散的”。\n不过，这里描述的方法在面向数据的体系结构中工作得非常好，在这种体系结构中，中央系统在内存中紧密打包的数据项阵列上工作。\n下面的博客文章大部分是从游戏开发人员的角度撰写的，但也应该适用于程序需要在内存中同时处理几百到几百万个对象(或一般的“数据项”)，以及经常创建和销毁此类项的其他领域。\n将所有内存管理移至集中系统(如渲染、物理、动画、…)。，系统是其内存分配的唯一所有者。\n将相同类型的项分组到数组中，并将数组基指针视为系统私有。\n创建项目时，只向外部世界返回一个‘index-Handle’，而不是指向该项目的指针。\n在索引句柄中，只使用数组索引所需的位数，其余位用于额外的内存安全检查。\n只有在绝对需要时才将句柄转换为指针，并且不要将指针存储在任何地方。\n下面我将详细解释其中的每一点。但基本的想法是，通用的“用户级”代码不会直接调用内存分配函数(如malloc、new或make_share/make_only)，并将指针的使用减少到绝对最少(只有在绝对需要直接访问内存时才作为短暂的引用)。最重要的是，指针永远不是项的底层内存的“所有者”。\n相反，直接内存操作尽可能多地发生在少数集中式系统中，在这些系统中，与内存相关的问题更容易调试和优化。\n在这篇博客中，“系统”是代码库的一部分(通常相当大)，它负责许多相关的任务，比如“渲染”、“物理”、“人工智能”、“角色动画”等等。这样的系统通过清晰定义的函数API与其他系统和“用户代码”分开，对系统数据所做的工作在紧密的中心循环中执行，而不是分散在整个代码库中。\n系统通常在用户代码的控制下创建和销毁项目(但请注意，创建和销毁项目不同于分配和释放这些项目使用的内存！)。例如，渲染系统可能处理顶点缓冲区、纹理、着色器和管道状态对象，物理系统处理刚体、关节和碰撞基本体，动画系统处理动画关键点和曲线。\n将这些项的内存管理转移到系统本身是有意义的，因为一般的内存分配器不具备关于如何处理数据项以及数据项之间的关系的系统特定的“域知识”。这允许系统优化内存分配，在创建和销毁项目时执行额外的验证检查，并在内存中安排项目以最大限度地利用CPU的数据缓存。\n这种“系统域知识”的一个很好的例子是用现代3DAPI呈现资源对象的破坏：资源对象不能简单地在用户代码指示时立即销毁，因为该资源可能仍在等待GPU使用的命令列表中被引用。相反，呈现系统只会在用户代码请求销毁资源对象时将其标记为销毁，但实际销毁会在稍后GPU不再使用该资源时发生。\n一旦所有内存管理转移到系统中，系统就可以利用其关于howitems的附加知识来优化内存分配和内存布局。一个明显的优化是通过将相同类型的项分组到数组中，并在系统启动时分配这些数组来减少通用内存分配的数量。\n系统不会在每次创建新项时执行内存分配，而是跟踪空闲数组插槽，并挑选下一个空闲插槽。当用户代码不再需要该项时，系统简单地再次将插槽标记为空闲，而不是执行释放分配(与典型的池分配器没有什么不同)。\n这种池分配很可能比按项执行内存分配要快一点，但这甚至不是将项保存在数组中的主要原因(现代通用分配器对于小分配也相当快)。\n项目保证被紧密地打包在内存中，一般分配器有时需要在实际项目内存旁边保留一些内务数据。\n在连续的内存范围内保存“热门项目”更容易，这样CPU就可以更好地利用它的数据缓存\n还可以将单个项的数据拆分成不同数组中的几个子项，以实现更紧密的打包和更好的数据缓存使用(AoS与SoA以及两者之间的所有内容)，并且所有这些数据布局细节都是系统私有的，更改起来微不足道，不会影响“外部代码”\n只要系统不需要重新分配数组，就可以保证不会出现内存碎片(尽管这在64位地址空间中问题不大)。\n更容易及早发现内存泄漏，并提供更有用的错误消息：当创建新项目时，系统可以根据预期上限简单地检查当前项目数量(例如，游戏可能知道一次活动的纹理不应该超过1024个，而且由于所有纹理都是通过渲染系统创建的，因此当超过这个数字时，系统可以打印出更有用的警告消息)。\n将系统项保存在数组中而不是唯一分配的优点是，可以通过数组索引来标识项，而不需要完整的指针。这对于内存安全非常有用，系统可以将数组基指针视为“私有知识”，而不是将内存指针交给外部世界，而只向公众分发数组索引。如果没有基指针来计算项目的内存位置，外部代码就无法访问项目的内存，即使有很大的犯罪能量也是如此。\n在许多情况下，系统外的代码甚至不需要直接访问项的内存，而只需要系统访问。在这种“理想”情况下，用户代码永远不会通过指针访问内存，也不会导致内存损坏。\n因为只有系统知道数组基指针，所以可以随意移动或重新分配项数组，而不会使现有的索引句柄无效。\n与完整指针相比，数组索引需要的位数更少，并且可以为它们选择更小的数据类型，这反过来又允许更紧密地打包数据结构和更好的数据高速缓存使用(这有一个警告，即可以使用额外的句柄位来提高内存安全性，下面将详细介绍这一点)。\n如果用户代码需要直接访问项的内存，则需要通过“查找函数”获取指针，该函数将句柄作为输入并返回指针。一旦存在这样的查找函数，上面概述的相当严密的内存安全场景就不再得到保证，用户代码应该遵守以下几条规则：\n指针不应该存储在任何地方，因为下次使用指针时，它可能不再指向同一项，甚至不再指向有效内存。\n指针应该只在简单的代码块中使用，而不能“跨越”函数调用。\n每次将句柄转换为指针时，系统可以保证返回的指针仍然指向最初为其创建句柄的同一项(下面将详细介绍)，但是这种保证会超时，因为指针下的项可能已被销毁，或者底层内存可能已被重新分配到不同的位置(这与C++中迭代器无效的问题相同)。\n上面两个简单的规则很容易记住，它们是完全不向用户代码公开指针和每次内存访问都有句柄到指针转换(代价有点高)之间的一个很好的折衷。\n首先，每种类型的句柄都应该有自己的C/C++类型，这样就可以在编译时检测到试图将错误的句柄类型传递给函数的行为(请注意，简单的tyecif不足以产生编译器警告，句柄必须包装到它自己的结构或类中-但是，这可以限于调试编译模式)。\n所有运行时内存安全检查都发生在将句柄转换为指针的函数中。如果句柄只是一个数组索引，则如下所示：\n针对当前项数组大小对索引进行范围检查，这可防止分段错误以及读取或写入已分配但不相关的内存区域。\n需要检查索引的数组项槽是否包含活动项(当前不是“空闲槽”)，这会阻止“释放后使用”的简单变体\n最后，根据私有数组基指针和公共项索引计算项指针。\n两者都只能发生在系统的一个函数中，这就是为什么存在两个“指针使用规则”(不要存储指针，不要跨函数调用保留指针)。\n不过，上面的释放后使用检查有一个很大的漏洞：如果我们只检查索引句柄后面的数组槽是否包含有效项，就不能保证它与最初为其创建该句柄的项相同。可能会发生这样的情况：原始物品被销毁，而相同的插槽被重新用于新物品。\n这就是句柄中的“空闲位”的用武之地：假设我们的句柄是16位的，但我们同时只需要1024个活动项。只需要10个索引位就可以寻址1024个项目，这样就有6个位可以用来处理其他事情。\n如果这6位包含某种“唯一模式”，就有可能检测到悬空访问：\n创建项时，会选取一个自由数组项，并将其索引放入较低的10个句柄位。将高6位设置为“唯一位模式”\n得到的16位句柄(10位索引+6位“唯一模式”)返回给外界，同时与数组槽一起存储。\n当项目被销毁时，与数组槽一起存储的项目句柄被设置为“无效句柄”值(可以是零，只要零从未作为有效句柄返回给外界)\n当句柄转换为指针时，低10位用作数组索引以查找数组槽，并将整个16位句柄与当前存储在数组槽中的句柄进行比较：如果两个句柄相等，则指针有效，并指向为其创建该句柄的同一项。\n否则，这是一次悬空访问，插槽项目要么已被销毁(在这种情况下，存储的句柄将具有“无效句柄”值)，要么已被销毁并重新用于新项目(在这种情况下，高6个“唯一模式”位不匹配)。\n在将句柄转换为指针时，这种句柄比较检查可以很好地检测悬空访问，但它不是防水的，因为数组索引和“唯一模式”的相同组合迟早会被创建。但它仍然比根本没有悬空保护(如原始指针)或“假内存泄漏”要好，后者在智能指针的类似情况下会发生。\n当然，找到好的策略来创建尽可能少发生冲突的独特句柄是最重要的部分，并留给读者作为练习；P&lt;foreign language=“English”&gt;P&lt;/foreign&gt;。\n显然，将尽可能多的位用于唯一模式是很好的，并且空闲数组槽的重用方式也很重要(例如，后进先出与先进先出)。编写一些创建/销毁压力测试，检查句柄冲突，并可用于调整特定用例的独特模式创建，可能也很好。与很少创建和销毁物品的系统相比，频繁创建和销毁物品的系统需要更多的工作(或者只是更多的句柄位)。\n除了整个内存安全方面，句柄对于指针有问题的其他情况也很有用：\n句柄可以用作跨进程的共享对象标识符(您所需要的只是某种“create_item_with_handle()”函数，该函数不会创建新的句柄，而是将现有的句柄作为输入参数)。这对于在线游戏特别有用，在游戏会话中，服务器和所有客户端之间可以共享句柄，或者在savegame系统中，用于存储对其他对象的引用。\n有时，创建一整组相关项目(用于实例动画关键点和曲线)并使用单个句柄引用整个项目组非常有用。在这种情况下，可以使用某种“范围句柄”，它不仅包含(第一项的)索引，还包含范围中的项数。\n在某些情况下，如果编译时静态类型检查不够，为项类型保留几个句柄位也很有用。\n总之，我发现用传统的“堆上对象指针”模型很自然、很优雅地解决了我过去遇到的许多问题，现在我很少怀念这个模型(以及围绕它构建的C++部分)。\nSOKOL-gfxAPI是C-API的一个示例，它使用句柄而不是呈现资源对象(缓冲区、图像、着色器、…)的指针。：\nOryol动画扩展模块是一个角色动画系统，它将其所有数据保存在数组中：\n…。在上面的帖子中，我对为同一个位置创建两次相同的唯一标签的问题不屑一顾，推特上的一位好心人暗示我一个非常简单、优雅、令人尴尬的“显而易见”的解决方案：\n每个数组槽都有自己的生成计数器，当释放句柄时会发生碰撞(也可能在创建句柄时发生，但是碰撞释放意味着您不需要“空闲槽”的保留值来检测无效的句柄)。\n要检查句柄是否有效，只需将其唯一标记与其槽中的currentGeneration计数器进行比较即可。\n一旦生成计数器将“溢出”，则禁用该数组插槽，这样就不会为该插槽返回新的句柄。\n这是避免手柄冲突的完美解决方案，但手柄最终会用完，因为所有阵列插槽最终都将被禁用。但是因为每个槽都有自己的计数器，所以这只有在所有句柄位耗尽之后才会发生，而不仅仅是少数几个唯一标记位。\n因此，使用32位句柄，您总是可以创建40亿个项目，同时最多有2^(32-num_counter_bits)处于活动状态。这也意味着唯一标签的位数可以减少，而不会损害“处理安全”。\n一旦可以保证不再有该插槽的句柄在野外(可能在代码中的特殊位置，如进入或退出关卡)，也可以重新激活被禁用的插槽。", "note_en": "28-Nov-2018: I’ve added a small update at the end on how to prevent‘handle collisions’ with a per-slot generation counter\n  …wherein I talk a bit about how I’m doing dynamic memory management in Cand C++ these days which basically replaces raw- and smart-pointers with‘index-handles’.\n In my  last blog post I was mentioningpointer- and allocation-free programming, but was skipping overthe details. This is what the following blog post isabout.\n This is all based on the (sometimes painful) experience of wrestling for 15+years with fairly big C++ code bases (0.5 to around 1 mloc) where memory isoften managed through smart pointers. The worst case being tens- tohundreds-of-thousands of small C++ objects, each in its own heapallocation, pointing to each other through smart pointers. While such codeis quite robust in terms of memory corruption (segfaults and corruptionrarely happens, since most attempts are caught by asserts when dereferencingsmart pointers), this type of ‘object spiderweb code’ is also dog-slowwithout obvious starting points for optimization, since the entire code is full ofcache misses. Other typical problems are memory fragmentation and ‘fakememory leaks’ because a forgotten smart pointer prevents freeing theunderlying memory (I call them ‘fake leaks’ because this type of leaks cannotbe caught by memory debugging tools).\n Nothing presented here is particularly new or clever, it’s justa collection of a few simple ideas which together work fairly well in biggercode bases to prevent (or at least detect early) a number of commonmemory-related problems in C and C++, and may even be useful in higher-levelgarbage-collected languages to reduce pressure on the garbage collector.\n However, the underlying design philosophy doesn’t fit very well into aclassical OOP world where applications are built from small autonomousobjects interacting with each other. That’s why it’s also quite tricky toimplement those ideas in a big existing OOP code base, where object creationand destruction happens ‘decentralized’ all over the code.\n The approach described here works very well though with a data-orientedarchitecture, where central systems work on arrays of data items packedtightly in memory.\n Most of the following blog post is written from a game developer’sperspective, but should also apply to other areas where a program needs tojuggle a few hundred to a few million objects (or generally ‘data items’) inmemory, and where such items are created and destroyed frequently.\n  move all memory management into centralized systems (like rendering, physics, animation, …), with the systems being the sole owner of their memory allocations\n  group items of the same type into arrays, and treat the array base pointer as system-private\n  when creating an item, only return an ‘index-handle’ to the outside world, not a pointer to the item\n  in the index-handles, only use as many bits as needed for the array index, and use the remaining bits for additional memory safety checks\n  only convert a handle to a pointer when absolutely needed, and don’t store the pointer anywhere\n I’ll explain each of those points in detail below. But the idea is basicallythat common ‘user-level’ code doesn’t directly call memory allocationfunctions (like malloc, new or make_shared/make_unique), and reduces the useof pointers to an absolute minimum (only as short-lived references whendirect memory access to an item is absolutely needed). Most importantly,pointers are never the ‘owner’ of an item’s underlying memory.\n Instead, direct memory manipulation happens as much as possible inside a fewcentralized systems where memory-related problems are easier to debug andoptimize.\n  In this blog post, a ‘system’ is a (usually fairly big) part of a code basewhich takes care of a number of related tasks, like ‘rendering’, ‘physics’,‘AI’, ‘character animation’ and so on. Such a system is separated from othersystems and ‘user-code’ through a clearly defined function API, and the workthat happens on the system’s data is performed in tight central loops insteadof being spread out all over the code base.\n Systems often work on items created and destroyed under control of user code(but note that creation and destruction of items is different from allocatingand freeing the memory used by those items!). For instance a rendering systemmight deal with vertex buffers, textures, shaders and pipeline state objects.A physics system works with rigid bodies, joints and collision primitives,and an animation system works with animation keys and curves.\n It makes sense to move the memory management for such items into the systemsthemselves, because a general memory allocator doesn’t have thesystem-specific ‘domain knowledge’ about how data items are processed and therelationships between data items. This allows the system to optimize memoryallocations, perform additional validation checks when creating anddestroying items, and arrange items in memory for making best use of theCPU’s data caches.\n A good example for this ‘system domain knowledge’ is the destruction ofrendering resource objects with modern 3D APIs: a resource object can notsimply be destroyed immediately when the user code says so because theresource might still be referenced in a command list waiting to be consumedby the GPU. Instead the rendering system would only mark the resource objectfor destruction when the user code requests its destruction, but the actualdestruction happens at a later time when the GPU no longer uses the resource.\n  Once all memory management has moved into systems, the system can optimizememory allocations and memory layout with its additional knowledge about howitems are used. One obvious optimization is to reduce the number of generalmemory allocations by grouping items of the same type into arrays, andallocate those arrays at system startup.\n Instead of performing a memory allocation each time a new item is created,the system keeps track of free array slots, and picks the next free slot.When the user code no longer needs the item, the system simply marks the slotas free again instead of performing a deallocation (not differentfrom a typical pool allocator).\n This pool allocation is most likely a little bit faster than performing amemory allocation per item, but this is not even the main reason for keepingitems in arrays (modern general allocators are quite fast too for smallallocations).\n  items are guaranteed to be packed tightly in memory, general allocators sometimes need to keep some housekeeping data next to the actual item memory\n  it’s easier to keep ‘hot items’ in continuous memory ranges, so that the CPU can make better use of its data caches\n  it’s also possible to split the data of a single item into several subitems in different arrays for even tighter packing and better data cache usage (AoS vs SoA and everything inbetween), and all those data layout details remain private to the system and are trivial to change without affecting ‘outside code’\n  as long as the system doesn’t need to reallocate arrays, it is guaranteed that there will be no memory fragmentation (although this is less of an issue in a 64-bit address space)\n  it’s easier to detect memory leaks early, and provide more useful error messages: when a new item is created a system can trivially check the current number of items against an expected upper bound (for instance a game might know that there should never be more than 1024 textures alive at a time, and since all textures are created through the rendering system, the system can print out a more useful warning message when this number is exceeded)\n  Keeping system items in arrays instead of unique allocations has theadvantage that an item can be identified through an array index instead ofrequiring a full pointer. This is very useful for memory safety.Instead of handing memory pointers to the outside world, the system can treatthe array base pointers as ‘private knowledge’, and only hand out arrayindices to the public. Without the base pointer to compute an item’s memorylocation, the outside code can’t access the item’s memory, even with a lotof criminal energy.\n  In many situations, code outside the system never even needs to directly access memory of an item, only the system does. In such an ‘ideal’ situation, user code never accesses memory through pointers, and can never cause memory corruption.\n  Since only the system knows the array base pointers, it’s free to move or reallocate the item arrays at will without invalidating existing index handles.\n  Array indices need fewer bits than full pointers, and a smaller data type can be picked for them, which in turn allows tighter packing of data structures and better data cache usage (this has the caveat that additional handle bits can be used to increase memory safety, more about this below)\n If user code needs to access the memory of an item directly it needs to obtaina pointer through a ‘lookup function’ which takes a handle as input and returnsa pointer. As soon as such a lookup function exists, the fairly watertight memory safety scenario outlined above is no longer guaranteed, and the user codeshould adhere to a few rules:\n pointers should never be stored anywhere, since the next time the pointer is used it may no longer point to the same item, or even to valid memory\n  a pointer should only be used in a simple code block, and not ‘across’ function calls\n Every time a handle is converted into a pointer, the system can guaranteethat the returned pointer still points to the same item that the handle wasoriginally created for (more on this below), but this guarantee ‘decays’ overtime since the item under the pointer may have been destroyed, or the underlyingmemory may have been reallocated to a different location (this is the sameproblem as iterator invalidation in C++).\n The two simple rules above are easy to memorize and are a good compromise betweennot exposing pointers to user code at all, and having a (somewhat costly) handle-to-pointer conversion for every single memory access.\n  First, each type of handle should get its own C/C++ type, so that attemptingto pass the wrong handle type to a function is already detected at compiletime (note that a simple typedef isn’t enough to produce a compiler warning,the handle must be wrapped into its own struct or class - however this couldbe limited to debug compilation mode).\n All runtime memory safety checks happen in the function which converts ahandle into a pointer. If the handle is just an array index, it would looklike this:\n a range check happens for the index against the current item array size, this prevents segmentation faults and reading or writing allocated but unrelated memory areas\n  a check needs to happen whether the indexed array item slot contains an active item (is not currently a ‘free slot’), this prevents the simple variant of ‘use after free’\n  finally the item pointer is computed from the private array base pointer and public item index\n   Both can only happen inside one of the system’s functions, that’s why the two‘pointer usage rules’ exist (don’t store pointers, don’t keep pointers acrossfunction calls).\n There is a pretty big hole in the above use-after-free check though: if we onlycheck if an array slot behind an index-handle contains a valid item, it’snot guaranteed that it is the  same item the handle was originally createdfor. It can happen that the original item was destroyed, and the samearray slot was reused for a  new item.\n This is where the ‘free bits’ in a handle come in: Let’s say ourhandles are 16-bits, but we only ever need 1024 items aliveat the same time. Only 10 index bits are needed to address 1024 items, whichleaves 6 bits free for something else.\n If those 6 bits contain some sort of ‘unique pattern’, it’s possible todetect dangling accesses:\n When an item is created, a free array item is picked and its index is put into the lower 10 handle bits. The upper 6 bits are set to a ‘unique bit pattern’\n  The resulting 16-bit handle (10 bits index + 6 bit ‘unique pattern’) are returned to the outside world, and at the same time stored with the array slot.\n  When an item is destroyed, the item handle stored with the array slot is set to the ‘invalid handle’ value (can be zero, as long as zero is never returned as a valid handle to the outside world)\n  When the handle is converted to a pointer, the lower 10 bits are used as array index to lookup the array slot, and the entire 16-bit handle is compared against the handle that’s currently stored with the array slot:  if both handles are equal, the pointer is valid and points to the same item the handle was created for\n  otherwise this is a dangling access, the slot item has either been destroyed (in that case the stored handle would have the ‘invalid handle’ value), or has been destroyed and reused for a new item (in that case the upper 6 ‘unique pattern’ bits don’t match)\n This handle-comparison check when converting a handle to a pointer worksquite well to detect dangling-accesses, but it isn’t waterproof because thesame combination of array index and ‘unique pattern’ will be created sooner orlater.But it’s still better than no dangling protection at all (like raw pointers),or a ‘fake memory leak’ which would happen in similar situations with smart pointers.\n Finding good strategies to create unique handles that collide as rarely aspossible is the most important part of course, and left as an excercise tothe reader ;P\n Obviously it’s good to use as many bits for the unique pattern as possible, and theway how free array slots are reused is important as well (e.g. LIFO vs FIFO). It’sprobably also good to write a little creation/destruction stress-test whichchecks for handle collisions and can be used to tweak the unique-pattern creation forspecific use cases. A system where items are created and destroyed with a veryhigh frequency needs more effort (or simply more handle bits) than systems where item creation and destruction is a rare occurance.\n  Apart from the whole memory safety aspect, handles are also useful for other situations where pointers are problematic:\n Handles can be used as shared object identifiers across processes (all you need issome sort of ‘create_item_with_handle()’ function, which doesn’t create a new handle, but takes an existing handle as input argument). This is especiallyuseful for online games where handles can be shared between the server andall clients in a game session, or in savegame systems to store referencesto other objects.\n Sometimes it’s useful to create a whole group of related items (for instanceanimation keys and curves), and reference the whole item group with a singlehandle. In that case some sort of ‘range handle’ can be used, which containsnot only an index (of the first item), but also the number of items in the range.\n In some situations it’s also useful to reserve a few handle bits for an itemtype if static type checking at compile time isn’t sufficient.\n In conclusion, I find it quite surprising how naturally and elegantly handlessolve many problems I encountered in the past with the traditional ‘pointersto objects on the heap’ model, and how little I miss this model now (and theparts of C++ that are built around it).\n  The sokol-gfx API is an example of a C-API which uses handles instead ofpointer of rendering resource objects (buffers, images, shaders, …):\n    The Oryol Animation extension module is a character animation system which keeps all its data in arrays:\n   …in the post above I was sort of handwaving away the problem of creatingthe same unique-tag twice for the same slot, and a nice person on twitterhinted me about a very simple, elegant and embarrassingly ‘obvious’ solution:\n Each array slot gets its own  generation counter, which is bumped when ahandle is released (can also happen when the handle is created, but bumpingon release means you don’t need a reserved value for “free slots” to detectan invalid handle).\n To check if a handle is valid, simply compare its unique-tag with the currentgeneration counter in its slot.\n Once the generation counter would ‘overflow’,  disable that array slot, sothat no new handles are returned for this slot.\n This is a perfect solution for avoiding handle collisions, but the handleswill eventually run out since all array slots will be disabled eventually. Butsince each slot has its own counter, this only happens after  allhandle-bits are exhausted, not just the few unique-tag bits.\n So with 32-bit handles, you can always create 4 billion items, with at most2^(32 - num_counter_bits) alive at the same time. This also means the number ofbits for the unique-tag can be reduced without compromising ‘handle safety’.\n It may also be possible to re-activate disabled slots once it can beguaranteed that no more handles for that slot are out in the wild(maybe at special places in the code like entering or exiting a level).", "posttime": "2020-06-06 03:05:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "句柄,handles,内存", "title": "句柄是更好的指针(2018年)", "title_en": "Handles are the better pointers (2018)", "transed": 1, "url": "https://floooh.github.io/2018/06/17/handles-vs-pointers.html", "via": "", "real_tags": ["句柄", "handles", "内存"]}, {"category": "", "categoryclass": "", "imagename": "2ecebe4d9fabf7e20434195d388b9ba6.jpg", "infoid": 1005331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在20世纪90年代，当时70多岁的特立独行的美国作曲家卢·哈里森(Lou Harrison)住在旧金山南部。他是旧金山湾区备受爱戴的音乐大师，长期以来一直被享有盛誉的旧金山交响乐团忽视。\n迈克尔·蒂尔森·托马斯改变了这一点。1995年9月，他作为交响乐团的音乐总监指挥的第一首作品是哈里森的首演，这是一个庞大的乐团的丰富作品，包括爪哇锣、氧气罐、风琴-作品。在托马斯的领导下，旧金山也迅速成为其他打破传统的音乐的发源地，同时在标准曲目中提升了其卓越的声誉。\n25年后，托马斯的变革性任期将于今年春天结束。这本来是去欧洲和卡内基音乐厅巡回演出的机会，也是瓦格纳的“飞翔的荷兰人”和马勒的“千人交响曲”的超大型演出。遗憾的是，由于冠状病毒大流行，大部分计划都泡汤了。(乐团改为在网上举办庆祝活动，一直持续到6月28日，每天都会发布托马斯任职一年的内容。)。\n但是，尽管出现了意想不到的低潮，托马斯在旧金山的时间在即将结束时不应该没有标记。从一开始，这就是一场非凡的音乐联姻。托马斯在第一季主持的每个订阅项目中都展示了一部美国作品，这是一个大胆的声明。但他只是把美国交响乐团的角色看作是美国音乐的拥护者。如果这个想法现在看起来很标准，那部分是因为他。\n他拥抱了有点脱离主流的作曲家，如查尔斯·艾夫斯(Charles Ives)、亨利·考威尔(Henry Cowell)、莫顿·费尔德曼(Morton Feldman)、约翰·凯奇(John Cage)和亨利·勃兰特(Henry Brandt。他与在世的作曲家建立了关系；将乐团带到了技术活力的新高度；并将其转变为世界上最受尊敬的马勒乐团之一，在一系列专辑上表演和录制了作曲家完整的交响乐和歌曲周期-这些专辑由乐团的SFS Media Label发行，这是托马斯的另一项倡议-获得了多项格莱美奖。他是一名公开同性恋身份的音乐总监，这也不是一件小事，当时这是一件罕见的事情，现在仍然是如此。\n现年75岁的托马斯是一位才华横溢的音乐家，也是一名钢琴家和作曲家，他出生在洛杉矶的一个在美国意第绪语剧场有着丰富传统的家庭。他很早就因其充满活力的音乐天赋和广泛的品味而吸引了人们的注意。如果说在那段年轻时期，他也经常被认为是顽皮和叛逆的，那么作为布法罗爱乐乐团的音乐总监和伦敦交响乐团的首席指挥，他取得了创新的成果。1987年，他帮助在迈阿密成立了新世界交响乐团，该交响乐团可能成为美国杰出的年轻艺术家培训交响乐团。\n但他的职业生涯将由他在旧金山的四分之一个世纪来定义。托马斯清楚地意识到，通过安顿下来，专注于准备冒险的单一剧团，他可以培养玩家和观众的好奇心。\n诚然，在过去的五个赛季中-有人会说更多-他对探索的兴趣似乎在减弱，新的举措减少了，更多的是向标准剧目倾斜。托马斯先生本质上是通过决定继续前行来回应这一批评。现在是时候发表其他观点和声音了；他的继任者埃萨-佩卡·萨洛宁(Esa-Pekka Salonen)肯定会将乐团拉向新的方向。但是，如果旧金山交响乐团已经为这些挑战做好了准备，那在很大程度上是因为托马斯已经做好了所有的工作。\n以下是他们共同制作的许多录音中一些最受欢迎的精选，由纽约时报评论家选择。\n在1996年与旧金山合作的首批录音中，托马斯强调，“阿巴拉契亚之春”(Appalachian Spring)看似温馨的作曲家亚伦·科普朗(Aaron Copland)有一种毫不掩饰的现代主义倾向。我特别喜欢柯普朗对他那坚硬的钢琴变奏曲的改编，那是原始而引人入胜的管弦乐变奏曲的毛茸茸的表演。安东尼·托马西尼。\n在这个国家最大的交响乐团的领导人中，托马斯先生不同寻常：他是一个美国人。他还制定了一个持续的项目，展示他的同胞的音乐。有一些令人费解的遗漏--他选择的作曲家往往是白人和男性--但托马斯的努力对于保留单调的、经常被忽视的声音至关重要。他可能是卡尔·拉格尔斯最杰出的拥护者，卡尔·拉格尔斯是艾夫斯的同代人，他的肌肉发达的“踏太阳人”提供了美国无调性的黄铜宣言。约书亚·巴隆。\n托马斯先生是自伦纳德·伯恩斯坦(Leonard Bernstein)以来最有才华、最有成效的普通大众音乐教育家。以纪录片“古斯塔夫·马勒：起源”(Gustav Mahler：Origins)为例，这是他开创的雄心勃勃的记分项目的一部分。在这本书中，托马斯先生前往捷克共和国的乡村地区，在街头乐队、民歌和大自然中发现马勒音乐的起源，然后揭秘地分析了第一交响曲，最后以一场激动人心的完整表演结束。安东尼·托马西尼。\n蒂尔森·托马斯在旧金山交响乐团的中期主要由马勒主导，他们花了十年多的时间才发行了他的交响曲，获得了极大的好评。他们从这第六个开始，他们在9月9日之后的几天里记录了这个。11.也许有时有点小题大做，但它仍然演奏得恰如其分，没有瑕疵，这是自伦纳德·伯恩斯坦(Leonard Bernstein)与纽约爱乐乐团合作以来最好的美国马勒循环的一个令人信服的开始。大卫·艾伦。\n乐团与旧金山湾区作曲家的家长约翰·亚当斯(John Adams)富有成效的关系早在托马斯任职之前就开始了，但在他的领导下继续蓬勃发展。向托马斯和他的丈夫约书亚·罗宾逊(Joshua Robison)致敬的“我依然在跳舞”(I Say Dance)最近一季在旧金山开幕，这是一系列非凡委托中的最新一季，其中包括2012年的“绝对玩笑”(Absolute Jest)，这是对贝多芬晚期音响世界的狂热之旅。约书亚·巴隆。\n2013年，托马斯和乐团罕见地获得了所有“西区故事”版权所有者的许可，可以将伯恩斯坦的完整配乐作为音乐会作品演奏。他们的演绎对写作中的所有细节都很敏感。当女高音歌唱家朱莉娅·布洛克(Julia Bullock)演唱“某地”(Somewhere)时，她的最后一个音节与胜利的希望产生了共鸣，但整个乐团在下面翻滚，似乎预示着悲剧的结局，个人希望的破灭。赛斯·科尔特墙。\n托马斯先生与艾夫斯的长期恋情随着2019年发行的《第四交响曲》达到顶峰，这是他对该作品的第二张唱片。在混乱而可爱的第二乐章中，在沉思的琴弦上奔跑的铜管拥有他们需要的所有夸张。美味和辛辣混合在一起，这要归功于一位经验丰富的艾维斯人。赛斯·科尔特墙\n考威尔很少演奏的钢琴协奏曲的录音很少，所以托马斯和旧金山闪闪发光的演奏会，杰里米·丹克(Jeremy Denk)恰好是一个有力的独奏者，是一份礼物。这部15分钟的作品的三个动作都很令人愉快，但请听最后的“反节奏”(Counter Rhythm)，它交替经历了冷酷、干涩、嬉戏、宇宙、温和和眩晕的情绪，最后以CinemaScope范围内的繁荣结束。扎卡里·伍尔夫。\n旧金山在很少录制的作品中增加的另一个作品-尽管出自一位更广为人知的作曲家-是贝多芬早期出色的“关于皇帝约瑟夫二世之死的大合唱”。托马斯先生的管弦乐队在这里是清醒的，也是光鲜的，就像它在考威尔一样棱角分明。扎卡里·伍尔夫", "note_en": "Back in the 1990s, Lou Harrison, a maverick American composer then in his late 70s, was living south of San Francisco. A beloved musical guru in the Bay Area, he had long been ignored by the prestigious San Francisco Symphony.\n Michael Tilson Thomas changed that. The first piece he conducted as the orchestra’s music director, in September 1995, was a Harrison premiere, a teeming piece for an enormous ensemble, including Javanese gongs, oxygen tanks, organ — the works. And San Francisco under Mr. Thomas swiftly became a home for music by other iconoclasts, too, while burnishing its sterling reputation in the standard repertory.\n After 25 years,  Mr. Thomas’s transformational tenure ends this spring. It was to have been the occasion for a tour to Europe and Carnegie Hall, as well as super-scale performances of Wagner’s “Flying Dutchman” and Mahler’s “Symphony of a Thousand.” Sadly, most of the plans were lost to the coronavirus pandemic. (The orchestra is instead hosting  an online celebration through June 28, releasing content from one year of Mr. Thomas’s tenure each day.)\n  But despite the unexpected anticlimax,  Mr. Thomas’s time in San Francisco should not go unmarked as it comes to a close. From the beginning, it has been a remarkable musical marriage. Mr. Thomas presented an American work in each subscription program he led that first season, a bold statement. But he simply saw the role of an American orchestra as championing American music. If that idea now seems standard, it’s in part because of him.\n He embraced composers a bit outside the mainstream, like Charles Ives, Henry Cowell, Morton Feldman, John Cage and Henry Brandt, inaugurating an American Mavericks series that drew in eager audiences. He fostered relationships with living composers; brought the orchestra to new heights of technical vitality; and turned it into one of the world’s most respected Mahler ensembles, performing and recording the composer’s complete symphonies and song cycles on a series of albums — released on the orchestra’s SFS Media label, another Thomas initiative — that garnered multiple Grammy Awards. It was also no small thing that he was an openly gay music director when that was,  as it still is, a rarity.\n A prodigiously talented musician, also a pianist and composer, Mr. Thomas, 75, was born in Los Angeles to a family with a rich heritage in the American Yiddish theater. He attracted attention early on for his dynamic musicianship and wide-ranging tastes. If during that youthful period he was also often perceived as  bratty and rebellious, he had innovative results as music director of the Buffalo Philharmonic and principal conductor of the London Symphony Orchestra. In 1987, he helped found the New World Symphony in Miami, which became perhaps America’s pre-eminent training orchestra for young artists.\n But his career will be defined by his quarter-century in San Francisco. Mr. Thomas clearly realized that by settling in and focusing on a single ensemble poised for adventure, he could foster curiosity among both players and audiences.\n It’s true that over the last five seasons — more, some would say — his penchant for exploration seemed to be waning, with fewer fresh initiatives and more of a tilt toward the standard repertory. Mr. Thomas answered this criticism, in essence, by deciding to move on. It’s time for other perspectives and voices; Esa-Pekka Salonen, his successor, is sure to pull the orchestra in new directions. But if the San Francisco Symphony is ready for those challenges, it’s in large part because of all that Mr. Thomas has already done.\n Here is a selection of some favorites among the many recordings they have made together, chosen by New York Times critics.\n   For one of his first recordings with San Francisco, in 1996, Mr. Thomas emphasized that Aaron Copland, the cozy-seeming composer of “Appalachian Spring,” had an unabashed modernist streak. I especially like the bristling performance of the raw and riveting Orchestral Variations, Copland’s arrangement of his flinty Piano Variations.  ANTHONY TOMMASINI\n  Mr. Thomas is unusual among the leaders of the country’s largest orchestras: He’s an American. And he has made a sustained project of presenting music by his compatriots. There are puzzling omissions — the composers he chooses tend to be white and male — but Mr. Thomas’s efforts have nevertheless been essential to keeping in the repertory works by singular, often overlooked voices. He may be the most prominent champion of Carl Ruggles, a contemporary of Ives whose muscular “Sun-Treader” offers a brassy declaration of American atonality.  JOSHUA BARONE\n  Mr. Thomas is the most gifted and effective educator about music for the general public since Leonard Bernstein. Take the documentary “Gustav Mahler: Origins,” part of the ambitious Keeping Score project that he inaugurated. In it, Mr. Thomas journeys to rural stretches of the Czech Republic to discover the origins of Mahler’s music in street bands, folk songs and nature, then revealingly analyzes the First Symphony before ending with an exciting complete performance.  ANTHONY TOMMASINI\n  Mr. Tilson Thomas’s middle period with the San Francisco Symphony was dominated by Mahler, whose symphonies it took them the better part of a decade to release, to immense acclaim. They began with this Sixth, which they recorded in the days after Sept. 11. Perhaps a little fussy at times, it is still properly intense and flawlessly played, a convincing start to what became the best American Mahler cycle since Leonard Bernstein’s with the New York Philharmonic.  DAVID ALLEN\n  The orchestra’s productive relationship with John Adams, the paterfamilias of Bay Area composers, began long before Mr. Thomas’s tenure but continued to flourish under his leadership.  “I Still Dance,” a propulsive tribute to Mr. Thomas and his husband, Joshua Robison, opened the most recent season in San Francisco, the latest in a line of extraordinary commissions that includes “Absolute Jest” (2012), a frenetic journey through the sound world of late Beethoven.  JOSHUA BARONE\n  In 2013, Mr. Thomas and the orchestra earned the rare permission from all of the “West Side Story” rights holders to perform Bernstein’s full score  as a concert work. Their rendition is sensitive to all the grit in the writing. When the soprano Julia Bullock sings “Somewhere,” her final syllables resonate with triumphant hopefulness, but the ensemble roils underneath, as if predicting the tragic finale, the dashing of individual hopes.  SETH COLTER WALLS\n  Mr. Thomas’s long love affair with Ives reached a pinnacle with this 2019 release of the Fourth Symphony, his  second recording of the work. In the chaotic — and lovely — second movement, the brasses that run riot over pensive strings have all the bombast that they need. Delicacy mixes with pungency, courtesy a veteran Ivesian.  SETH COLTER WALLS\n  There are few recordings of Cowell’s rarely performed Piano Concerto, so Mr. Thomas and San Francisco’s sparkling rendition, with Jeremy Denk a precisely pounding soloist, is a gift. All three movements of the 15-minute work are delightful, but listen to the finale, “Counter Rhythm,” which goes through moods alternately grim, jerky, playful, cosmic, suave and woozy before ending with a CinemaScope-wide flourish.  ZACHARY WOOLFE\n  Another of San Francisco’s additions to the body of rarely recorded works — albeit by a rather more widely known composer — is Beethoven’s early, superb “Cantata on the Death of Emperor Joseph II.” Mr. Thomas’s orchestra is as sober and burnished here as it is angular in Cowell.  ZACHARY WOOLFE", "posttime": "2020-06-06 03:04:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "旧金山,san,音乐", "title": "25年后，旧金山的小牛指挥家继续前进", "title_en": "After 25 Years, San Francisco’s Maverick Conductor Moves On", "transed": 1, "url": "https://www.nytimes.com/2020/06/05/arts/music/san-francisco-symphony-michael-tilson-thomas-mtt.html", "via": "", "real_tags": ["旧金山", "san", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "83327ab813c3718ac113ac0d2b7eff83.jpg", "infoid": 1005330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于专业记者和任何拥有智能手机的人的共同努力，美国各地都在记录警察对和平集会人群的暴力行为。随着抗议活动在所有50个州都在增加，越来越多的视频显示，警察在公共场所暴力和非法攻击和平抗议的人，甚至根本不抗议。虽然警察暴行的视频在很大程度上并没有阻止它-事实上，可能会进一步伤害被警察暴行的社区-但当前的历史时刻需要完整的记录。\n拍摄视频并不能保证正义，但随着警察暴力事件的增加，我们看到了一些结果。6月4日，纽约州布法罗的两名警察被拍到袭击一名75岁的男子，这名男子似乎只是在和他们说话。警察推了推这名男子，这名男子随后向后绊倒，头部撞到人行道上。可以看到血从这名男子的耳朵里溢出，可以看到几名警察从他地上走过他的身体。\n这段视频是由水牛城NPR附属电台WBFO的迈克·德斯蒙德拍摄的。(警告：该视频是图形化的。)。它迅速在推特上传播开来，引发了围观者的愤怒。布法罗市市长拜伦·布朗(Byron Brown)随后宣布对这起事件进行调查，并表示两名警官已被无薪停职。\n“我对这段视频深感不安，”市长在一份声明中说。\n但在城市领导人采取行动之前，布法罗警方对这一事件撒了谎。在一份初步声明中，该部门表示，一人在“与其他抗议者的小规模冲突中”被捕，“在那次涉及抗议者的小规模冲突中，有一人被绊倒受伤。”视频清楚地驳斥了这一说法，显示这名老人周围没有发生小规模冲突，警察没有正当理由将他推倒在地。\n再说一遍：记录警察并不能保证正义。而在这起案件中迅速采取行动的原因可以解释为，一名白人老年男子既不会对警方构成可以想象的威胁，又向公众提出了一个更具同情心的案件。在布法罗袭击事件发生的同一天，纽约州州长安德鲁·科莫(Andrew Cuomo)否认纽约警察局用警棍袭击抗议者，称一名记者对此的质疑是“超党派攻击”，并声称“(警方)不会那样做”。(纽约警察局确实会这么做，过去一周，有人看到他们在全市范围内这样做，因为人们用手机记录下了袭击过程。)。但库默很快对这名老人在布法罗遇袭的视频做出了回应。\n这一事件是完全没有道理的，是完全可耻的。我已经和Buffalo@MayorByronBrown谈过了，我们同意相关警官应该立即停职，等待正式调查。警察必须执行-而不是滥用-法律。https://t.co/EYIbTlXnPt。\n-安德鲁·科莫(@NYGovCuomo)2020年6月5日\n黑人和棕色人是警察暴力的受害者，即使是在视频中捕捉到的，也很少得到正义的伸张。但在没有证据的情况下，警方占了上风。他们的谎言不会受到质疑。\n美国的每个人-无论是公民还是居民-都有宪法权利记录正在履行公共职责的警察。只要你没有扰乱他们的生意，警察就没有权利阻止你，他们也不能因为你在录音就没收你的手机或相机。这是联邦法院和最高法院的一致意见，他们在2014年(在9比0的裁决中)确认，如果警察想要扣押和搜查你的手机，他们需要搜查令。\n当然，全国性的抗议活动是关于警察无视公民权利。事实上，我们在过去一周看到的视频显示，警察普遍无法无天，警察在合法集会中任意侵犯和平示威者的权利。所以不能保证警方会尊重你的录音权利。这个峡谷--介于成文的法律和实现的法律之间--是美国人在所有50个州抗议的原因之一。\n如果你担心发布视频会招致报复，请问问能安全做到这一点的朋友，或者联系一名记者，他可能会在保护你身份的同时传播视频。\n如果你知道你会在公共场合待很长一段时间，带一个备用充电器或为你的手机准备一个外部电池盒。\n如果您有备用电话或设备，请考虑使用它来录制，而不是使用您的主要设备。这有助于确保您用作生命线的电话不会受到影响。\n确保您的手机已锁定，以便在手机被没收时无法访问。\n如果您想了解更多，请查看位于您右侧的美国公民自由联盟的这份有用的指南来拍摄视频和照片。\n对每个人来说，记录警察是一项平等的权利，但这并不是一种平等的责任。被边缘化的人比白人更有可能记录警察；例如，拍摄杀害埃里克·加纳(Eric Garner)的男子受到纽约市警方的迫害，他们采取了有针对性的骚扰和监禁进行报复。\n如果你觉得记录警察是安全的，就按下按钮。你捕捉到的信息可能会造成掩盖和真相之间的差异。", "note_en": "Police violence against people peacefully assembling in the United States is being documented across the country thanks to the combined efforts of professional journalists and anybody with a smartphone. As protests grow in all 50 states, more and more videos are surfacing of police violently and lawlessly attacking people in public places who are protesting peacefully or not even protesting at all. And while video of police brutality  has largely done nothing to stop it — and, in fact, may further traumatize the communities being brutalized by police — the current historical moment demands a complete record.\n Justice is not guaranteed by taking video, but we are seeing some results as the volume of police violence increases. On June 4th, two Buffalo, New York police officers were filmed assaulting a 75-year-old man who appeared to simply be speaking to them. The officers pushed the man, who then stumbled backward and fell, hitting his head on the pavement. Blood could be seen spilling from the man’s ear as several officers could be seen walking past his body on the ground.\n The video was captured by Mike Desmond of WBFO, Buffalo’s NPR affiliate station. (Warning:  the video is graphic.) It quickly spread on Twitter, sparking outrage from onlookers. Buffalo Mayor Byron Brown subsequently announced an investigation into the incident and said that two officers had been suspended without pay.\n “I was deeply disturbed by the video,” the mayor said in a statement.\n But before action was taken by city leaders, Buffalo police lied about the incident. In an initial statement, the department said that a person was arrested “during a skirmish with other protesters,” and that “during that skirmish involving protesters, one person was injured when he tripped and fell.” The video clearly refutes the statement, showing that there was no skirmish around the elderly man, and that the officers pushed him to the ground for no justifiable reason.\n Again: recording the police does not guarantee justice. And the swift action in this case could be explained by the fact that a white, elderly man both posed no conceivable threat to police and presented a more sympathetic case to the public. On the same day of the attack in Buffalo, New York Governor Andrew Cuomo  denied that the NYPD was assaulting protesters with batons, calling the question about it from a reporter a “hyperpartisan attack,” and claiming that “[the police] don’t do that.” (The NYPD  does do that, and they have been seen doing that across the city in the past week because of people recording the attacks from their cellphones.) But Cuomo swiftly responded to the video of the elderly man’s assault in Buffalo.\n This incident is wholly unjustified and utterly disgraceful.  I&#39;ve spoken with Buffalo  @MayorByronBrown and we agree that the officers involved should be immediately suspended pending a formal investigation.  Police Officers must enforce — NOT ABUSE — the law.  https://t.co/EYIbTlXnPt\n— Andrew Cuomo (@NYGovCuomo)  June 5, 2020\n Black and brown people who are victims of police violence, even when it is captured on video, are rarely delivered justice. But without the evidence, police have the upper hand. Their lies can go unchallenged.\n  Everyone in the United States — citizen or resident — has a constitutional right to record police who are performing their public duties. The police don’t have the right to stop you as long as you’re not disrupting their business, and they aren’t allowed to confiscate your phone or camera just because you were recording them. This is the consistent opinion of federal courts and the Supreme Court, which affirmed in 2014 (in a 9-0 decision) that cops need a warrant if they want to seize and search your cellphone.\n Of course, the nationwide protests are about the police  ignoring civil rights. Indeed, the videos we’ve seen in the past week show widespread police lawlessness, with officers arbitrarily violating the rights of peaceful demonstrators in lawful assemblies. So there’s no  guarantee that the police will respect your right to record. This canyon — between the law as it is written and the law as it is realized — is one of the reasons Americans are protesting in all 50 states.\n If you are worried about retaliation for posting your video, ask a friend who can do it safely, or contact a journalist who may be able to distribute it while protecting your identity.\n  If you know you will be in public for a long period of time, bring a spare charger or get an external battery case for your phone.\n If you have a spare phone or device, consider using it to record instead of your primary device. This can help ensure that the phone you use as a lifeline is not compromised.\n Make sure your phone is locked so that it cannot be accessed if it is confiscated.\n If you want to learn more,  check out this helpful guide from the ACLU on your right to take videos and photographs.\n  Recording the police is an equal right for everyone, but it is not an equal responsibility. Marginalized people are more at risk for recording the police than whites; the man who filmed the killing of Eric Garner, for example,  was persecuted by New York City Police who took revenge with targeted harassment and imprisonment.\n If you feel safe recording the police, press the button. What you capture could make the difference between a cover-up and the truth.", "posttime": "2020-06-06 03:04:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察,start", "title": "如果你看到警察，开始录音", "title_en": "If you see the cops, start recording", "transed": 1, "url": "https://www.theverge.com/2020/6/5/21281264/protests-police-violence-record-phone-video-right-legal", "via": "", "real_tags": ["警察", "start"]}, {"category": "", "categoryclass": "", "imagename": "1c005e8b346452ea5ad252bb5674a0a6.jpg", "infoid": 1005328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司今天通知开发者，它已经启动了一个新的开源项目，旨在让那些开发密码管理应用的人创建与流行网站兼容的强密码。\n新的Password Manager Resources开源项目允许密码管理应用程序集成iCloud Keychain Password Manager使用的特定于网站的要求，以生成强大、唯一的密码。\n许多密码管理器为人们生成强大的、唯一的密码，因此他们不会尝试手动创建自己的密码，这会导致密码很容易被猜中和重复使用。每次密码管理器生成的密码实际上与网站不兼容时，人们不仅体验不佳，而且有理由尝试创建自己的密码。编辑密码规则怪癖有助于减少遇到此类问题的人，同时还记录了服务的密码策略对使用密码管理器的人限制太多，这可能会激励服务进行更改。\n该项目还提供了一系列已知的共享登录系统的网站，用户可以在其中更改密码的网站页面链接，以及更多，完整的详细信息可以在GitHub上找到。\n苹果表示，让密码管理器在密码规则和更改密码URL等资源上进行协作，可以让所有密码管理应用程序以更少的工作提高质量，此外，它还鼓励网站使用标准或新兴标准来改善与密码管理器的兼容性。\n我猜，如果他们真的引用了它，这里的人会问，为什么他们会挑出1Password作为特色，而不是其他PWM。\n我真正想看到的是在Safari中为第三方应用生成密码。使用正确的url在1Password中创建新帐户有点麻烦。你必须在应用程序和1Password之间来回来回一两次。如果能为第三方应用程序提供更多的精简，就像对钥匙链一样，那就更好了。\n仍然会有大量的网站创建他们自己愚蠢的密码规则，没有任何生成强密码的密码管理器能够遵守这些规则。人们仍将不得不自食其力-有点像是夺走了这个项目的火花。-但至少这是朝着正确方向迈出的一步。\n在我看来，这就是这个项目的目标。一旦有足够多的密码管理器添加此功能，(从密码生成视点)要求是什么就无关紧要了。密码管理器在生成密码之前就会知道。以Password-rules.json中的一个现有网站为例：根据JSON的规定，bhPhotoVideo.com要求密码最大长度为15个字符。假设您转到该网站并尝试创建帐户。在Safari(或任何密码管理器)中使用Password Generator，在密码生成器尝试创建复杂密码之前，它会读取JSON并找到bhPhotoVideo.com URL。然后它读取要求(最大长度为15)。无论您的默认设置是什么，它都会立即创建符合该要求的密码。您无需执行任何操作即可手动更改要求(这在网页上可能不明显)。关键是(A)密码要求列表保持最新。由于这篇文章发布在GitHub上，任何人都可以请求更新。我想知道苹果的合并要求会是什么。(B)密码管理器将此集成到那里的工作流中。\n如果网站在其输入验证和数据库架构上保持一定的一致性，那就太好了。我知道有一家公司几乎允许除逗号以外的所有特殊字符-错误消息没有告诉你哪个特殊字符是不允许的。我使用1Password，必须检查生成的密码并逐个删除每个特殊字符，才能找出哪个是有问题的。人力资源管理，奥托索普？没有。模数呢？没有。烟斗？没有。星号？没有。大于符号吗？没有。那就只剩下逗号了。什么？!。真的吗？&#34；这真的是一种可怕的体验，我能理解为什么其他用户会求助于弱密码和/或重复使用密码。我看过其他网站有非常具体的字符长度指南和其他奇怪的组合。有一个网站，后来更新到了更安全的地方，甚至曾经只需要8-15个字符、字母和数字。如果我试图暴力破解或猜测一个潜在的弱密码，难道这不会使字典变得小得多，从而更容易破解吗？\n仍然会有大量的网站创建他们自己愚蠢的密码规则，没有任何生成强密码的密码管理器能够遵守这些规则。人们仍将不得不自食其力-有点像是夺走了这个项目的火花。-但至少这是朝着正确方向迈出的一步。\n如果你仍在使用2012年中型号的配备视网膜显示屏的15英寸MacBook Pro，并需要更换电池或进行其他维修，请务必尽快与服务提供商预约。在今天由MacRumors获得的一份内部备忘录中，苹果公司表示，这款特殊的MacBook Pro机型将于2020年6月30日在全球范围内被标记为过时，刚刚超过.。\n为Mac开发的应用程序通常不会像为iPhone和iPad设计的应用程序那样覆盖范围，所以我们在MacRumors上有一个系列文章，重点介绍了值得一看的有趣的Mac应用程序。本月推出的应用程序旨在让在家工作变得更轻松。订阅MacRumors YouTube频道可以获得更多视频。Meeter(免费)-经常在家工作.。\n苹果音乐公司已经取消了周二停电的Beats 1广播计划，并建议听众收听庆祝黑人音乐中最好的广播节目。在明尼阿波利斯公民乔治·弗洛伊德(George Floyd)在被捕过程中被警方击毙后，音乐行业组织了一项活动，以支持黑人生命也是命(Black Lives Matter)。在推出Apple Music时，许多用户.。\n据今天早上在推特上分享这条消息的泄密者怀特先生说，下一代苹果铅笔可能是第一次有黑色版本。黑色苹果铅笔的模型我们还没有听说下一代苹果铅笔的传言，目前还不清楚什么时候会发布新型号的苹果铅笔。有传言称，苹果正在研发迷你LED版的iPad Pro，而这款产品将是苹果的主打产品。\n根据越来越可靠的推特账号L0vtoDream，苹果计划在2021年第一季度或第二季度推出配备A14X芯片、5G连接和Mini-LED显示屏的新iPad Pro型号。泄密者声称，新的iPad Pro型号将配备高通的骁龙X55调制解调器，该调制解调器既支持毫米波，也支持低于6 GHz的频率。毫米波是一组5G频率.\n苹果公司今天发布了MacOS Catalina 10.15.5的补充更新，这是MacOS Catalina操作系统于2019年10月发布的第五次更新。补充更新是在MacOS Catalina 10.15.5更新发布一周后发布的。‌MacOS Catalina‌10.15.5是一个免费更新，可以使用系统中的更新功能从Mac应用商店下载.。\n上周美国明尼阿波利斯警察击毙乔治·弗洛伊德后，美国多个城市发生骚乱。苹果首席执行官蒂姆·库克通过彭博社(Bloomberg)与员工分享了一份内部备忘录，谈到了许多人感受到的痛苦，并敦促其他人承诺为每个人创造一个更美好、更公正的世界。库克还宣布，苹果正在向几个挑战……的团体捐款。\n根据MacRumors读者和Twitter用户的抱怨，iCloud目前似乎对许多人来说都是停机的。当问题开始出现时，苹果的系统状态页面最初并没有显示错误，但已经更新，以确认iCloud帐户登录存在问题。该支持站点表示，某些用户可能无法登录到他们的iCloud帐户，也可能是.。\n根据以色列网站The Verizer今天分享的信息，iOS14将与所有能够运行iOS13的iPhone和iPod touch机型兼容。据称，兼容性数据是在泄露的iOS14版本中发现的，并得到了验证者所说的来自系统开发过程的可信来源的确认。&#34；iOS13与iPhone6s及更高版本兼容，具有完整的.。\n在苹果发布iPhone12之前，我们还有几个月的时间，但关于iPhone13将于2021年秋季发布的传言已经在流传。日本网站Mac Otakara今天分享了一张粗略的3D打印样机，据称将于2021年推出5.5英寸的iPhone，该样机来自阿里巴巴的消息来源。这款机型可能是基于泄露的规格和谣言建立的，但信息来源尚不清楚。..。", "note_en": "Apple  today informed developers that it has launched a new open source project that&#39;s designed to let those who develop password management apps create strong passwords compatible with popular websites.\n The new Password Manager Resources open source project allows password management apps to integrate website-specific requirements used by the  iCloud Keychain password manager to generate strong, unique passwords.\n Many password managers generate strong, unique passwords for people, so that they aren&#39;t tempted to create their own passwords by hand, which leads to easily guessed and reused passwords. Every time a password manager generates a password that isn&#39;t actually compatible with a website, a person not only has a bad experience, but a reason to be tempted to create their own password. Compiling password rule quirks helps fewer people run into issues like these while also documenting that a service&#39;s password policy is too restrictive for people using password managers, which may incentivize the services to change.\n The project also features a collection of websites known to share a sign-in system, links to website pages where users can change passwords, and more, with full details  available on GitHub.\n Apple says that having password managers collaborate on resources like password rules and change password URLs allows all password management apps to improve their quality with less work, plus it encourages websites to use standards or emerging standards to improve their compatibility with password managers.\n I&#39;d guess that if they did reference it, people on here would be asking why they&#39;d singled out 1Password to feature over other PWMs\n The thing I’d really like to see is password generation in safari for 3rd party apps.  It’s a bit of a pain to create new accounts in 1Password with the proper url. You have to go back and forth between the app and 1Password a time or two. It’d be nice if it was more streamlined for 3rd party apps kind of like it is for keychain.\n there&#39;s still going to be (and are) plenty of websites that create their own stupid password rules that no password manager that generates strong passwords will be able to comply. People are still going to have to roll their own- kinda taking away the spark of this project. - But at least it&#39;s a step in the right direction.\nFrom the way I read it, that is the goal of this project. Once enough password managers add this feature, it should not matter (from a password generation POV), what the requirements are. The password manager will know BEFORE it generates a password.   Take an example from one of the existing websites in the password-rules.json:  According to the JSON, bhphotovideo.com has a requirement of a password max length of 15 characters. Pretend you go to that website and attempt to create an account. You use the Password Generator in Safari (or any password manager), BEFORE the password generator attempts to create a complex password, it reads the JSON and finds the bhphotovideo.com URL. It then reads the requirements (Max length 15). It immediate creates a password that fits that requirement, regardless of what your defaults are. No action needed on your part to manually change the requirements (which may not be obvious on the webpage.)  The key is (a) the list of password requirements is kept up to date. Since this is published on GitHub, anyone can make a PULL request to update. I wonder what Apple&#39;s merge requirements are going to be.  (b) Password managers integrate this in to there workflow.\n It would be great if websites would have some consistency in their input validation and database schemas. I know one company that allows almost every special character but a comma - and the error message doesn&#39;t tell you which special character is the disallowed one. I used 1password and had to go through the generated password and remove each special character 1-by-1 to figure out which one was problematic. &#34;Hrm, octothorp? Nope. Modulus? Nope. Pipe? Nope. Asterisk? Nope. Greater than symbol? Nope. That just leaves the comma. What?! Seriously?&#34; It really is an awful experience and I can see why other users would resort to weak and/or reused passwords. I&#39;ve see other sites with very specific character length guidelines and other weird combinations. One site, which has since updated to something more secure, even once required 8-15 characters, letters and numbers only. If I were trying to brute force or guess a potentially weak password, wouldn&#39;t that make the dictionary size much smaller and thus easier to crack?\n there&#39;s still going to be (and are) plenty of websites that create their own stupid password rules that no password manager that generates strong passwords will be able to comply. People are still going to have to roll their own- kinda taking away the spark of this project. - But at least it&#39;s a step in the right direction.\n  If you are still hanging on to a Mid 2012 model of the 15-inch MacBook Pro with a Retina display, and require a new battery or other repairs, be sure to book an appointment with a service provider as soon as possible.\rIn an internal memo today, obtained by MacRumors, Apple has indicated that this particular MacBook Pro model will be marked as &#34;obsolete&#34; worldwide on June 30, 2020, just over...\n Apps developed for the Mac often don&#39;t receive as much coverage as apps designed for iPhones and iPads, so we have a series at MacRumors that highlights interesting Mac apps that are worth taking a look at. This month&#39;s apps are designed to make working from home a little bit easier.\rSubscribe to the MacRumors YouTube channel for more videos. Meeter (Free) - Working from home often...\n Apple Music has cancelled its Beats 1 radio schedule for Blackout Tuesday and is suggesting that listeners tune in to a radio stream celebrating the best in black music.\rBlackout Tuesday is a campaign organized by the music industry to support Black Lives Matter after Minneapolis citizen George Floyd was killed by police in the course of his arrest. On launching Apple Music, many users...\n The next iteration of the Apple Pencil could be available in black for the first time, according to leaker Mr. White who shared the tidbit on Twitter this morning. A mockup of an Apple Pencil in black We haven&#39;t heard rumors of a next-generation Apple Pencil and it&#39;s not clear when a new model might be released. Apple is rumored to be working on mini-LED versions of the iPad Pro, and it&#39;s...\n Apple plans to launch new iPad Pro models with an A14X chip, 5G connectivity, and a Mini-LED display in the first or second quarter of 2021, according to the increasingly reliable Twitter account L0vetodream.\rThe leaker claims that the new iPad Pro models will be equipped with Qualcomm&#39;s Snapdragon X55 modem, which supports both mmWave and sub-6GHz. mmWave is a set of 5G frequencies that...\n Apple today released a supplemental update for macOS Catalina 10.15.5, the fifth update to the macOS Catalina operating system that was released in October 2019. The supplemental update comes a week after the release of the macOS Catalina 10.15.5 update.\r‌macOS Catalina‌ 10.15.5 is a free update that can be downloaded from the Mac App Store using the Update feature in the System...\n Amid unrest in numerous U.S. cities following last week&#39;s killing of George Floyd by police in Minneapolis, Apple CEO Tim Cook has shared an internal memo with employees (via Bloomberg) addressing the pain that many are feeling and urging others to commit &#34;to creating a better, more just world for everyone.&#34;\rCook also announced that Apple is making donations to several groups challenging...\n iCloud appears to be down for many people at the current time, based on complaints from MacRumors readers and Twitter users.\rApple&#39;s system status page was not initially displaying an error when the problems started, but has been updated to confirm an issue with iCloud account sign ins. The support site says that some users may be unable to sign in to their iCloud accounts and may also be...\n iOS 14 will be compatible with all iPhones and iPod touch models able to run iOS 13, according to information shared today by Israeli site The Verifier.\rThe compatibility data was allegedly found in a leaked version of iOS 14 and confirmed by what The Verifier says is a &#34;trusted source from the system development process.&#34;\riOS 13 is compatible with the iPhone 6s and later, with a full...\n We still have a few months to go before Apple unveils the iPhone 12, but rumors about the iPhone 13, coming in fall 2021, are already circulating.\rJapanese site Mac Otakara today shared a rough 3D printed mockup of a 5.5-inch iPhone said to be coming in 2021, which is from &#34;Alibaba sources.&#34; The model may be built on leaked specifications and rumors, but where the info comes from is unclear.\r...", "posttime": "2020-06-06 02:45:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,苹果,开源,app,apple", "title": "苹果启动开源项目让密码管理应用创建强密码", "title_en": "Apple Launches Open Source Project to Let Password Management Apps Create Strong Passwords", "transed": 1, "url": "https://www.macrumors.com/2020/06/05/apple-open-source-password-management-project/", "via": "", "real_tags": ["密码", "苹果", "开源", "app", "apple"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1005327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于共享软件分发模型的特殊性，很难精确地量化1992年至1993年期间沃尔芬斯坦3D的流行程度。但有一件事我们可以肯定地说，无论以什么标准衡量，它都非常受欢迎。Aogee卖出了大约20万份付费剧集，但这个数字很难开始体现游戏的真正影响力。大多数获得免费剧集的人都对它感到满意，或者买不起其他分期付款，或者有朋友已经购买了它们，并且很乐意与人分享。因此，似乎有理由假设沃尔芬斯坦3D玩家的总数达到了7位数，使游戏的曝光率与1993年拳击行业最热门的第7位客人持平，这款游戏普遍同意将CD-ROM放在地图上。然而，从长远来看，沃尔芬斯坦3D的影响将比“第七客”更惊天动地。\n它的影响力的一个明显迹象-以及它只是一种从根本上不同于第七位来宾的游戏类型，那个庄严的多媒体展品-是在它周围涌现的造型场景。游戏的关卡是以一种相当容易理解的格式存储的：“wad”文件，代表“所有的数据在哪里？”有进取心的黑客很快就编写和分发了他们自己的级别编辑器和自定义级别。(其中最受欢迎的都是在纳粹总部的走廊里摆满了儿童电视角色恐龙巴尼(Barney The Dinosaur)的复制品，这个甜蜜得令人恶心的、令人难以置信的不聪明、令人难以置信的痛苦，让你可以用自动武器发泄你的挫败感。)。ID男孩们内部就是否应该打击改造者进行了激烈的辩论，但约翰·卡马克(John Carmack)在易受影响的年龄阅读了史蒂芬·利维(Steven Levy)的里程碑式著作“黑客”(Hacker)，并完全吸收了书中英雄们开放和透明的精神气质，坚持允许人们对他的创作为所欲为。当卡马克坚定自己的立场时，他总是如愿以偿；归根结底，他是id集体中唯一不可替代的成员，其他每个人都知道这一点。\n随着沃尔芬斯坦3D的人气飙升，id男孩们开始贪婪地盯着盒装出版商的地盘。他们与一家名为FormGen的公司达成协议，将游戏的第七个更长的部分作为盒装零售产品独家发布；它于1992年9月以命运之矛的名义出现。因此，“电脑游戏世界”(Computer Gaming World)等杂志的读者可能会对沃尔芬斯坦(Wolfenstein)3D游戏的两个单独的、暴力的整版广告感到困惑，每一个广告的底部都有不同的出版商的名字。“命运之矛”的零售价至少卖出了10万份，既卖给了无法获得足够的沃尔芬斯坦3D的铁杆粉丝，也卖给了许多其他人，他们与典型的共享软件分发方式隔绝开来，第一次以这种形式接触到了这款游戏。\n就连任天堂(Nintendo)也是恭恭敬敬地打来电话，就在几年前，任天堂拒绝了id提出的制作电脑版超级马里奥兄弟3(Super Mario Bros.3)的提议。ID男孩们现在听从了任天堂的请求，将沃尔芬斯坦3D移植到新的超级任天堂娱乐系统中，同时也不情愿地同意遵守任天堂臭名昭著的严格审查机构的指令。他们根本不知道自己报名参加的是什么。在他们完成之前，任天堂要求他们用汗水代替鲜血，用变异的老鼠代替看门狗，用一个叫做“Staatmeister”的通用恶棍代替这个游戏不可避免的最终老板阿道夫·希特勒(Adolf Hitler)。他们怀着强烈的痛恨之情，但既然同意开进港口，他们就如愿以偿地坚持到底，喃喃地说：“再也不会了！”自始至终都在自言自语。事实上，当他们结束时，他们共同发誓再也不会与任天堂合作。谁需要他们？这个世界是艾德的牡蛎。\n到现在，1992年已经接近尾声，他们都觉得是时候转向下一个新事物了。因为ID的每个人，尤其是约翰·卡马克，都开始以一种明显带有偏见的眼光看待沃尔芬斯坦3D。\n沃尔芬斯坦3D的巨大成功掩盖了一个肮脏的小秘密，那就是一旦剥夺了它的新奇价值，它就不再是一款伟大的游戏了。它的引擎太基础了，无法进行令人信服的水平设计。你滑过它的走廊，就像你在一条与游乐场射击场拼凑在一起的分支有轨电车线路上，试图射杀在他们开枪之前突然出现的纳粹。没有任何形式的游戏地图意味着你甚至大部分时间都不知道自己在哪里；你只是不停地四处移动，直到你跌跌撞撞地走到下一层的电梯上。任何通过这七集的人-别搞错了，有很多这样做的球员-要么有可怕的攻击性要发泄，要么就是\n可怜的汤姆。只有像他这样的甜蜜天真的天性才能相信，其他的id男孩会愿意回到他们的任天堂拼图游戏中去，享受天真无邪的乐趣。沃尔芬斯坦3D和基恩指挥官是完全不同的野兽。这并不仅仅是因为它和其他人已经做过的事情一样好；它就像以前没有人做过的事情一样。他们拥有这个新东西，拥有一切。霍尔的第三部“指挥官基恩”三部曲根本不在纸牌上--甚至当他提出使用沃尔芬斯坦3D引擎的更新版本进行3D拍摄时也是如此。可爱和异想天开的是id的昨天；坚韧不拔和血腥的是他们的今天，如果他们有什么要说的话，他们的明天也是如此。\nID男孩们翻出了他们不太鼓的流行文化参考点，拿出了“异形”系列电影。这些电影会制作出多么棒的3D游戏啊！在幽闭恐怖走廊的迷宫中奔跑，射杀外星人…。那就太棒了！然而，经过进一步的思考，没有人想要尝试达到官方许可所带来的麻烦，即使假设这样的事情是可能的；id本质上仍然是一个地下叛乱，失去了律师和好莱坞的联系。他们的想法是通过不同的故事情节来创造类似的效果。\nID男孩们在桌面上进行了一场旷日持久的“地下城与龙”战役，其中包括恶魔从他们地狱般的存在层面溢出到日常幻想的所谓“主要物质层面”。如果他们做了这样的事情，只是在科幻小说的背景下会怎么样？太空中的恶魔！那就太完美了！实际上，这个名字的提出者是约翰·卡马克，他通常是最不参与这类讨论的本能男孩。在1986年马丁·斯科塞斯(Martin Scorsese)执导的电影“金钱的颜色”(The Color Of Money)中的一个场景中，汤姆·克鲁斯(Tom Cruise)扮演的一个年轻的游泳池犀利大摇大摆地走进了一家酒吧，酒吧里装。“你里面有什么？”他最后的帕特西面露威胁性的怒容问道。当我们的英雄打开箱子，露出他的台球球杆时，他闪了一下100千瓦的汤姆·克鲁斯的微笑，说了一个词：“末日”。\n汤姆·霍尔再一次试图给予支持，并充分利用这一点。他仍然担任着id小说的世界缔造者的官方角色。于是，他开始了几个星期的工作，终于拿出了id任何人都写过的最全面的设计文件，恰如其分地取名为《末日圣经》。它提供了大量的枪战机会，但也讲述了一个严肃的故事，在这个故事中，作为一名被困在空间站上的宇航员，在神秘外星人的袭击下，你逐渐了解到，他们是从地狱出来的字面上的恶魔，通过时空结构中的裂痕逃往我们的维度。它充满了要前进的目标和要解决的问题，而不仅仅是砍倒成群的怪物，随着你的玩耍，情节也在不断演变。至少在短期内，如果其他的id男孩有兴趣在一个模拟丰富的虚拟现实中追寻霍尔复杂的讲故事之路，那么游戏的历史将会截然不同。\n然而，事实上，霍尔的雄心壮志落地时发出了响亮的撞击声。诚然，他的朋友们有各种有效的实际理由持怀疑态度。诚然，从沃尔芬斯坦3D的伪3D引擎转变为能够支持霍尔设想的复杂谜题和场景类型的引擎，并使其在日常硬件上以可接受的速度运行，即使对于约翰·卡马克这样的巫师来说，也可能是一个不可逾越的挑战。然而，事实仍然是，问题至少是动机问题和技术问题一样多。其他身份的男孩就是不关心那些让汤姆·霍尔如此兴奋的事情。这再次归结到约翰·卡马克(John Carmack)，他通常是小组中最不善于表达意见的成员，他表达了他们的反对意见。“游戏中的故事，”他说，“就像色情电影中的故事。预计会在那里，但并不是那么重要。“。\n汤姆·霍尔又坚持了几个月，但他就是无法说服自己完全接受他的朋友们想要的游戏。他和其他人的关系每况愈下，直到1993年8月，其他人最终要求他离开：“显然这是行不通的。”到那时，末日无疑是世界上最受期待的游戏，没有人在乎它不会有一个复杂的故事。“厄运意味着两件事，”约翰·卡马克说。“恶魔和猎枪！”无论是那时还是现在，它的大多数粉丝都不会有任何其他方式。\n制造末日最终需要的工时是id男孩们以前做过的任何事情的三倍多。从1993年1月到当年12月，它占据了他们醒着的每一个小时。在那段时间的早期，他们决定不会通过Apogee出版这本书。艾德男孩和斯科特·米勒之间的关系开始出现裂痕。\n杰伊·威尔伯现在取代了米勒在id中的旧角色。他每天花几个小时在商业在线服务、主要的公告牌系统和早起的互联网上徘徊，在这里点燃期待的火焰，在那里回答问题。\n而且有很多问题，因为“末日”其实不仅仅是关于恶魔和猎枪的：它也是关于技术的。无论它会变成什么样子，“末日”都将是约翰·卡马克(John Carmack)最新引擎的展示窗口，这位年轻人很快就把自己打造成了世界上最好的游戏程序员。有了末日，他允许自己在系统要求方面比他为沃尔芬斯坦3D设定的底线高得多。\n对于任何游戏开发人员来说，系统需求一直是一个不断变化的目标。太用力了，你可能最终会发布一款几乎没人会玩的游戏；太保守了，你可能会发布一些看起来像是昨天新闻的东西。在这个连续体上精确定位正确的点需要了解您的客户。Apogee的共享软件人群通常没有尖端的计算机；他们往往比那些购买大型盒装游戏的人更年轻，也更不富裕。因此，id使得在仅有640K内存的基于80286的两代机器上运行Wolfenstein3D成为可能。其伪3d引擎的显著局限性既来自于此类硬件的局限性，也源于约翰卡马克(John Carmak)的哲学，即任何时候在逼真度和速度之间的较量中，后者都应该获胜。\n当他走向末日时，他仍然一如既往地坚定地坚持这一理念，但市场后缘的缓慢发展确实给了他更多的工作空间：他为至少一台基于80386的计算机设计了末日，建议使用80486，内存至少为4MB。通过使用一种名为“DOS扩展器”的相对较新的软件技术，他基本上能够忽略一代程序员的痛苦，即MS-DOS无法无缝寻址超过640K的内存，这在很大程度上受到了微软最近为其MS-DOS托管的Windows版本所做的创新的启发。通过在实时模式和保护模式之间透明地转换处理器，Rational Systems的“DOS/4GW”可以使程序员觉得好像所有机器的内存都像第一个640KDOS/4GW一样毫不费力地就可以使用。DOS/4GW包含在编译器的最新版本中，而在此之前，C编译器是由一家名为Watcom的加拿大小公司制造的。Carmack选择Watcom编译器是因为DOS/4GW；没有它，Doom几乎是不可能的。在Doom突出使用它之后，Watcom的将成为游戏开发的首选C编译器，一直持续到MS-DOS游戏时代的剩余几年。\n不仅由于这些新的负担，而且--最重要的是--约翰·卡马克(John Carmack)作为一名程序员的持续进化，末日引擎在几个重要方面超越了沃尔芬斯坦3D(Wolfenstein 3D)。具有讽刺意味的是，他为Super NES设计了令人厌恶的沃尔芬斯坦3D审查版本，这是一个考虑到基于2D精灵的游戏而不是3D图形的平台，这让他在布鲁斯·内勒(Bruce Nayler)的一篇博士论文中发现了一种闪电般的新方法，即所谓的二进制空间划分，可以在可见表面上进行排序。这对新发动机的性能有很好的启示作用。\n这就是说，新引擎确实像它的前身一样，被困在2D和真3D之间的一个有限空间里；只是它在连续体上朝着后者走得更远了。不再需要所有的东西和每个人都生活在同一平面上；你现在可以爬楼梯，走到桌子和台上。而且墙壁不再必须彼此成直角，这意味着这个世界不再需要像孩子们过去玩的那些钢球迷宫一样。\n另一方面，墙壁必须完全垂直，地板和天花板必须完全水平；注定允许楼梯，但不允许山丘或坡道。这些限制使得将纹理映射到环境上成为可能，而不会出现困扰蓝天制作公司早期但更“诚实”的3D游戏Ultima Underworld的丑陋间断。“末日”中的纹理贴图虽然不是完全正确的视角，但至少比老游戏更接近这一理想。“末日”在游戏工程中做了如此有用的研究，因为它如此生动地说明，为了玩家而令人信服地伪造它，比模拟只让虚拟世界的程序员高兴的东西要好得多。它的引擎非常适合它想要的游戏。\n只要你一开始玩这个游戏，简单地增加身高的价值就会微妙地显现出来--诚然，这不是一个经常与厄运联系在一起的副词！而不是平滑地滑动\n但是，引入不同的高度对于这项运动的战术可能性意味着什么，这是最重要的。现在怪兽可以站在阳台上向你发射火球，或者你也可以对他们做同样的事情。末日世界不再是一个直截了当的射击场，而是一个充满陷阱和伏击的迂回之地。卡马克的最新引擎还首次支持可变级别的照明，这本身就开辟了一个全新的领域，既有戏剧性的可能性，也有战术可能性；至少可以说，进入一个未经探索的漆黑的房间可能是一个令人望而生畏的前景。\n此外，新引擎大大改进了沃尔芬斯坦3D中几乎不存在的物理模拟程度。重量和动量被实施，甚至子弹也被模拟成世界上的物理物体。立体声音景也被实现了；除了让人不安之外，它还可能成为另一个重要的战术工具。与此同时，怪兽的人工智能虽然还相当初级，但比沃尔芬斯坦3D要先进得多。甚至有可能引诱两个怪物而不是你来打架。\n约翰·卡马克还对杀死怪物以外的事情表示了些许支持，尽管远未达到汤姆·霍尔曾经设想的程度。该引擎可以用来呈现简单的拼图游戏，比如锁着的门和钥匙，操纵环境部分的开关和杠杆：平台可以上下移动，桥梁可以伸展和收缩。考虑到这一增加的复杂程度，这可能会突然使地理细节和你在其中的确切位置变得真正相关，引擎提供了一个做得很好的自动地图来跟踪这些事情。\n当然，如果没有利用它们的水平设计，这些新的负担能力都不会有意义。最初的计划是由汤姆·霍尔(Tom Hall)和约翰·罗梅罗(John Romero)创建关卡。但是，正如我们已经看到的，霍尔似乎就是达不到身份证男孩们想要的目标。在最终解雇他之后，他们意识到罗梅罗仍然需要帮助来承担设计负担。它来自一个最不可能的来源--来自一个在年龄、经验和性情上与其他的id男孩相去甚远的家伙。\n桑迪·彼得森(Sandy Petersen)已经是某些圈子里的狂热英雄，因为他在1981年创建了一个名为Call of Cthulhu的桌面RPG。它是根据恐怖作家H·P·洛夫克拉夫特的作品改编的。\n..", "note_en": "The full extent of  Wolfenstein 3D‘s popularity during 1992 and 1993 is difficult to quantify with any precision due to the peculiarities of the shareware distribution model. But the one thing we can say for sure is that it was  enormously popular by any standard. Apogee sold roughly 200,000 copies of the paid episodes, yet that number hardly begins to express the game’s real reach. Most people who acquired the free episode were content with it alone, or couldn’t afford to buy the other installments, or had friends who had bought them already and were happy to share. It thus seems reasonable to assume that the total number of  Wolfenstein 3D players reached well into seven digits, putting the game’s exposure on a par with   The 7th Guest, the boxed industry’s biggest hit of 1993, the game generally agreed to have put CD-ROM on the map. And yet  Wolfenstein 3D‘s impact would prove even more earthshaking than that of  The 7th Guest in the long run.\n One telling sign of its influence — and of the way that it was just a fundamentally different  type of game than  The 7th Guest, that stately multimedia showpiece — is the modding scene that sprang up around it. The game’s levels were stored in a rather easily decipherable format: the “WAD” file, standing for “Where’s All the Data?” Enterprising hackers were soon writing and distributing their own level editors, along with custom levels. (The most popular of them all filled the corridors of the Nazi headquarters with facsimiles of the sickly sweet, thuddingly unclever, unbelievably grating children’s-television character Barney the Dinosaur and let you take out your frustrations with an automatic weapon.) The id boys debated fiercely among themselves whether they should crack down on the modders, but John Carmack, who had read Steven Levy’s landmark book   Hackers at an impressionable age and thoroughly absorbed its heroes’ ethos of openness and transparency, insisted that people be allowed to do whatever they wished with his creation. And when Carmack put his foot down, he always got his way; at the end of the day, he was the one irreplaceable member of the id collective, and every one of the others knew it.\n With  Wolfenstein 3D‘s popularity soaring, the id boys started eyeing the territory of the boxed publishers greedily. They struck a deal with a company called FormGen to release a seventh, lengthier installment of the game exclusively as a boxed retail product; it appeared under the name of   Spear of Destiny in September of 1992. Thus readers of magazines like  Computer Gaming World could scratch their heads that fall over two separate luridly violent full-page advertisements for  Wolfenstein 3D games, each with a different publisher’s name at the bottom.  Spear of Destiny sold at least 100,000 copies at retail, both to hardcore  Wolfenstein 3D addicts who couldn’t get enough and to many others, isolated from the typical means of shareware distribution, who came upon the game for the first time in this form.\n Even Nintendo came calling with hat in hand, just a couple of years after summarily rejecting id’s offer to make a version of  Super Mario Bros. 3 that ran on computers. The id boys now heeded Nintendo’s plea to port  Wolfenstein 3D to the new Super Nintendo Entertainment System, whilst also grudgingly agreeing to abide by the dictates of Nintendo’s infamously strict censors. They had no idea what they had signed up for. Before they were through, Nintendo demanded that they replace blood with sweat, guard dogs with mutant rats, and Adolf Hitler, the game’s inevitable final boss, with a generic villain named the “Staatmeister.” They hated this bowdlerization with a passion, but, having agreed to do the port, they duly saw it through, muttering “Never again!” to themselves all the while. And indeed, when they were finished they took a mutual vow never to work with Nintendo again. Who needed them? The world was id’s oyster.\n By now, 1992 was drawing  to a close, and they all felt it was high time that they moved on to the next  new thing. For everyone at id, and most especially John Carmack, was beginning to look upon  Wolfenstein 3D with a decidedly jaundiced eye.\n   The dirty little secret that was occluded by  Wolfenstein 3D‘s immense success was that it wasn’t all that great a game once it was stripped of its novelty value. Its engine was just  too basic to allow for compelling level design. You glided through its corridors as if you were on a branching tram line that had been mashed together with a fairground shooting gallery, trying to shoot the Nazis who popped up before they could shoot you. The lack of any sort of in-game map meant that you didn’t even know where you were most of the time; you just kept moving around shooting Nazis until you stumbled upon the elevator to the next level. Anyone who made it through seven episodes of this — and make no mistake, there were plenty of players who did — either had an awful lot of aggression to vent or really, really loved the unprecedented look and style of the game. The levels were even boring for their designers. John Romero:\n Tom [Hall] and I [designed] levels [for Wolfenstein 3D] fast. Making those levels was the most boring shit ever because they were so simple. Tom was so bored; I kept on bugging him to do it. I told him about Scott Miller’s 300ZX and George Broussard’s Acura NSX. We needed cool cars too! Whenever he got distracted, I’d tell him, “Dude, NSX! NSX!”\n Tom Hall had it doubly hard. The fact was, the ultra-violence of  Wolfenstein 3D just wasn’t really his thing. He preferred worlds of candy-apple red, not bloody scarlet; of precocious kids and cuddly robots, not rabid vigilantes and sadistic Nazis. Still, he was nothing if not a team player. John Romero and Adrian Carmack had gone along with him for  Commander Keen, so it was only fair that he humored them with  Wolfenstein 3D. But now, he thought, all of that business was finally over, and they could all start thinking about making a third  Commander Keen trilogy.\n Poor Tom. It took a sweetly naïve nature like his to believe that the other id boys would be willing to go back to the innocent fun of their Nintendo pastiches.  Wolfenstein 3D was a different beast entirely than  Commander Keen. It wasn’t remarkable just for being as good as something someone else had already done; it was like nothing anyone had ever done before. And they  owned this new thing, had it all to themselves. Hall’s third  Commander Keen trilogy just wasn’t in the cards — not even when he offered to do it in 3D, using an updated version of the  Wolfenstein 3D engine. Cute and whimsical was id’s yesterday; gritty and bloody was their today and, if they had anything to say about it, their tomorrow as well.\n Digging into their less-than-bulging bag of pop-culture reference points, the id boys pulled out the  Alien film franchise. What a 3D game those movies would make! Running through a labyrinth of claustrophobic corridors, shooting aliens… that would be amazing! On further reflection, though, no one wanted the hassle that would come with trying to live up to an official license, even assuming such a thing was possible; id was still an underground insurgency at heart, bereft of lawyers and Hollywood contacts. Their thinking moved toward creating a similar effect via a different story line.\n The id boys had a long-running tabletop  Dungeon &amp; Dragons campaign involving demons who spilled over from their infernal plane of existence into the so-called “Prime Material Plane” of everyday fantasy. What if they did something like that, only in a science-fiction context? Demons in space! It would be perfect! It was actually John Carmack, normally the id boy least engaged by these sorts of discussions, who proposed the name. In  a scene from the 1986 Martin Scorsese movie  The Color of Money, a young pool sharp played by Tom Cruise struts into a bar carrying what looks like a clarinet case. “What you got in there?” asks his eventual patsy with an intimidating scowl. As our hero opens the case to reveal his pool cue, he flashes a 100-kilowatt Tom Cruise smile and says a single word: “Doom.”\n Once again, Tom Hall tried to be supportive and make the best of it. He still held the official role of world-builder for id’s fictions. So, he went to work for some weeks, emerging at last with the most comprehensive design document which anyone at id had ever written, appropriately entitled  The DOOM Bible. It offered plenty of opportunity for gunplay, but it also told an earnest story, in which you, as an astronaut trapped aboard a space station under assault by mysterious aliens, gradually learned to your horror that they were literal demons out of Hell, escaping into our dimension through a rift in the fabric of space-time. It was full of goals to advance and problems to solve beyond that of mowing down hordes of monsters, with a plot that evolved as you played. The history of gaming would have been markedly different, at least in the short term, if the other id boys had been interested in pursuing Hall’s path of complex storytelling within a richly simulated embodied virtual reality.\n As it was, though, Hall’s ambitions landed with a resounding thud. Granted, there were all sorts of valid practical reasons for his friends to be skeptical. It was true enough that to go from the pseudo-3D engine of  Wolfenstein 3D to one capable of supporting the type of complex puzzles and situations envisioned by Hall, and to get it all to run at an acceptable speed on everyday hardware, might be an insurmountable challenge even for a wizard like John Carmack. And yet the fact remains that the problem was at least as much one of motivation as one of technology. The other id boys just didn’t  care about the sort of things that had Tom Hall so juiced. It again came down to John Carmack, normally the least articulate member of the group, to articulate their objections. “Story in a game,” he said, “is like story in a porn movie. It’s expected to be there, but it’s not that important.”\n Tom Hall held out for several more months, but he just couldn’t convince himself to get fully onboard with the game his friends wanted to make. His relationship with the others went from bad to worse, until finally, in August of 1993, the others asked him to leave: “Obviously this isn’t working out.” By that time,  DOOM was easily the most hotly anticipated game in the world, and nobody cared that it wouldn’t have a complicated story. “ DOOM means two things,” said John Carmack. “Demons and shotguns!” And most of its fans wouldn’t have it any other way, then or now.\n   Making  DOOM wound up requiring more than three times as many man-hours as anything the id boys had ever done before. It absorbed their every waking hour from January of 1993 to December of that year. Early on in that period, they decided that they wouldn’t be publishing it through Apogee. Cracks in the relationship between the id boys and Scott Miller had started forming around the latter’s business practices, which were scrupulously honest but also chaotic in that way dismayingly typical of a fast-growing business helmed by a first-time entrepreneur. Reports kept reaching id of people who wanted to buy  Wolfenstein 3D, but couldn’t get through on the phone, or who managed to give Apogee their order only to have it never fulfilled.\n But those complaints were perhaps just a convenient excuse. The reality was that the id boys just didn’t feel that they needed Apogee anymore. They had huge name recognition of their own now and plenty of money coming in to spend on advertising and promotion, and they could upload their new game to the major online services just as easily as Scott Miller could. Why keep giving him half of their money? Miller, for his part, handled the loss of his cash cow with graceful aplomb. He saw it as just business, nothing personal. “I would have done the same thing in their shoes,” he would frequently say in later interviews. He even hired Tom Hall to work at Apogee after the id boys cast him adrift in the foreign environs of Dallas.\n Jay Wilbur now stepped into Miller’s old role for id. He prowled the commercial online services, the major bulletin-board systems, and the early Internet for hours each day, stoking the the flames of anticipation here, answering questions there.\n And there were lots of questions, for  DOOM was actually about a bit more than demons and shotguns: it was also about technology. Whatever else it might become,  DOOM was to be a showcase for the latest engine from John Carmack, a young man who was swiftly making a name for himself as the best game programmer in the world. With  DOOM, he allowed himself to set the floor considerably higher in terms of system requirements than he had for  Wolfenstein 3D.\n System requirements have always been a moving target for any game developer. Push too hard, and you may end up releasing a game that almost no one can play; stay too conservative, and you may release something that looks like yesterday’s news. Striking precisely the right point on this continuum requires knowing your customers. The Apogee shareware demographic didn’t typically have cutting-edge computers; they tended to be younger and a bit less affluent than those buying the big boxed games. Thus id had made it possible to run  Wolfenstein 3D on a two-generations-behind 80286-based machine with just 640 K of memory. The marked limitations of its pseudo-3D engine sprang as much from the limitations of such hardware as it did from John Carmack’s philosophy that, any time it came down to a contest between fidelity to the real world and speed, the latter should win.\n He still held to that philosophy as firmly as ever when he moved on to  DOOM, but the slow progression of the market’s trailing edge did give him more to work with: he designed  DOOM for at least an 80386-based computer — 80486 recommended — with at least 4 MB of memory. He was able to mostly ignore that bane of a generation of programmers, MS-DOS’s  inability to seamlessly address memory beyond 640 K, by using a relatively new piece of software technology called a “DOS extender,” inspired to a large extent by Microsoft’s  recent innovations for their MS-DOS-hosted versions of Windows. By transparently shifting the processor between its real and protected modes on the fly, Rational Systems’s “DOS/4GW” could make it seem to the programmer as if all of the machine’s memory was as effortlessly available as the first 640 K. DOS/4GW was included in the latest versions of what had heretofore been something of an also-ran in the compiler sweepstakes: the C compiler made by a small Canadian company known as Watcom. Carmack chose the Watcom compiler because of DOS/4GW;  DOOM would quite literally have been impossible without it. In the aftermath of  DOOM‘s prominent use of it, Watcom’s would become the C compiler of choice for game development, right through the remaining years of the MS-DOS-gaming era.\n  Thanks not only to these new affordances but also — most of all, really — to John Carmack’s continuing evolution as a programmer, the  DOOM engine advanced beyond that of  Wolfenstein 3D in several important ways. Ironically, his work on the detested censored version of  Wolfenstein 3D for the Super NES, a platform designed with 2D sprite-based games in mind rather than 3D graphics, had led him to discover a lightning-fast new way of sorting through visible surfaces, known as binary space partitioning, in a doctoral thesis by one Bruce Naylor. It had a well-nigh revelatory effect on the new engine’s capabilities.\n That said, the new engine did remain caught, like its predecessor, in a liminal space between 2D and true 3D; it was just that it moved significantly further on the continuum toward the latter. No longer must everything and everyone exist on the same flat horizontal plane; you could now climb stairs and walk onto desks and daises. And walls must no longer all be at right angles to one another, meaning the world needed no longer resemble one of those steel-ball mazes children used to play with.\n  On the other hand, walls must still all be exactly vertical, and floors and ceilings must all be exactly horizontal;  DOOM allowed stairs but not hills or ramps. These restrictions made it possible to map textures onto the environment without the ugly discontinuities that had plagued Blue Sky Productions’s earlier but more “honest” 3D game   Ultima Underworld. Texture mapping in  DOOM, while by no means perfectly perspective-correct, was at least closer to that ideal than in the older game.  DOOM makes such a useful study in game engineering because it so vividly illustrates that faking it convincingly for the sake of the player is better than simulating things which delight only the programmer of the virtual world. Its engine is perfect for the game it wants to be.\n  The value of the simple addition of height to the equation was revealed subtly — admittedly not an adverb often associated with  DOOM! — as soon as you started the game. Instead of gliding smoothly about like a tram, your view now bobbed with uncanny verisimilitude as you  ran about. You might never consciously notice the effect, but it made a huge difference to your feeling of really being  in the world; if you tried to go back to  Wolfenstein 3D after playing  DOOM, you immediately had the feeling that something was somehow  off.\n But the introduction of varying height was most important for what it meant in terms of the game’s tactical possibilities. Now monsters could stand on balconies and shoot fireballs down at you, or you could do the same to them. Instead of a straightforward shooting gallery, the world of  DOOM became a devious place of traps and ambushes. Carmack’s latest engine also supported variable levels of lighting for the first time, which opened up a whole new realm of both dramatic and tactical possibility in itself; entering an unexplored pitch-dark room could be, to say the least, an intimidating prospect.\n  In addition, the new engine dramatically improved upon the nearly non-existent degree of physics simulation in  Wolfenstein 3D. Weight and momentum were implemented; even bullets were simulated as physical objects in the world. A stereo soundscape was implemented as well; in addition to being unnerving as all get-out, it could become another vital tactical tool. Meanwhile the artificial intelligence of the monsters, while still fairly rudimentary, advanced significantly over that of  Wolfenstein 3D. It was even possible to lure two monsters into fighting each other instead of you.\n John Carmack also added a modicum of support for doing things other than killing monsters, although to nowhere near the degree once envisioned by Tom Hall. The engine could be used to present simple set-piece puzzles, such as locked doors and keys, switches and levers for manipulating parts of the environment: platforms could move up and down, bridges could extend and retract. And in recognition of this added level of complexity, which could suddenly make the details of the geography and your precise position within it truly relevant, the engine offered a well-done auto-map for keeping track of those things.\n   Of course, none of these new affordances would matter without level designs that took advantage of them. The original plan was for Tom Hall and John Romero to create the levels. But, as we’ve seen, Hall just couldn’t seem to hit the mark that the id boys were aiming for. After finally dismissing him, they realized that Romero still needed helped to shoulder the design burden. It arrived from a most unlikely source — from a fellow far removed from the rest of the id boys in age, experience, and temperament.\n Sandy Petersen was already a cult hero in certain circles for having created a tabletop RPG called   Call of Cthulhu in 1981. Based on the works of the horror writer  H.P. Lovecraft, it\n......", "posttime": "2020-06-06 02:45:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,共享软件,scene,游戏", "title": "共享软件场景，第4部分：末日", "title_en": "The Shareware Scene, Part 4: Doom", "transed": 1, "url": "https://www.filfre.net/2020/06/the-shareware-scene-part-4-doom/", "via": "", "real_tags": ["软件", "共享软件", "scene", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "c6b78eb42b84959bdfe601f16f3bc75a.jpeg", "infoid": 1005326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-CNBC周五援引消息人士的话报道，调查Alphabet Inc.谷歌潜在反垄断行为的美国州总检察长倾向于推动拆分其广告技术业务，作为预期诉讼的一部分。\n司法部和几乎所有的州总检察长都对谷歌违反反垄断法的指控展开了调查。联邦调查的重点是搜索偏向、广告和谷歌Android操作系统的管理。", "note_en": "(Reuters) - The U.S. state attorneys general investigating Alphabet Inc’s Google for potential antitrust violations are leaning towards pushing for a breakup of its ad technology business as part of an expected suit, CNBC reported on Friday, citing sources.\n  The Justice Department and nearly all state attorneys general have opened investigations into allegations that Google has broken antitrust laws. The federal probe focuses on search bias, advertising and management of Google’s Android operating system.", "posttime": "2020-06-06 02:43:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,谷歌,google,拆分,lean", "title": "美国各州倾向于拆分谷歌的广告技术业务", "title_en": "U.S. states lean toward breaking up Google's ad tech business", "transed": 1, "url": "https://www.reuters.com/article/us-usa-google/u-s-states-lean-toward-breaking-up-googles-ad-tech-business-cnbc-idUSKBN23C2NZ", "via": "", "real_tags": ["广告", "谷歌", "google", "拆分", "lean"]}, {"category": "", "categoryclass": "", "imagename": "4a24dd5ec23e549e0af3c6fc02f79db1.jpg", "infoid": 1005325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在《柳叶刀1》(Lancet 1)一篇备受瞩目的论文报道抗疟疾药物羟基氯喹可能对新冠肺炎患者有危险两周后，该论文的四名作者中有三人撤回了这项研究，因为他们无法独立核实自己的数据集。数据集是美国公司Surgisphere分析的一个大型专有电子健康记录集合。\n同一天，也就是6月4日，研究人员和其他合著者出于同样的原因撤回了“新英格兰医学杂志”(NEJM)2上的一篇论文。这项研究发表在一个月前，研究了某些心脏药物对新冠肺炎患者的影响，没有发现安全问题。\n科学家们说，这件事对研究人员和期刊评估他们发表的论文背后的数据的方式提出了严重的问题，并可能使在冠状病毒大流行期间试验药物的努力复杂化。\n澳大利亚悉尼大学的生物伦理学家伊恩·科里奇说：“整个事件是灾难性的--它对涉及的期刊是有问题的，对科学的完整性是有问题的，对医学是有问题的，对临床试验和证据生成的概念也是有问题的。”\n这两篇论文都依赖于从电子健康记录中分析的专有数据，这些电子健康记录显然是由Surgisphere从世界各地的数百家医院收集的。但在批评人士对这些研究提出质疑后，该公司没有将其原始数据提供给第三方审计师进行验证。根据“柳叶刀”上的撤回通知，Surgisphere担心转移数据会违反客户协议和保密要求。\n马萨诸塞州波士顿布里格姆妇女医院(Brigham and Women‘s Hospital)的心脏病专家曼迪普·梅赫拉(ManDeep Mehra)是这两项研究的主要作者，她说，“由于我们没有能力核实主要数据或主要数据来源，我不再相信数据的来源和准确性，也不再相信它们带来的结果。”\n萨潘·德赛(Sapan Desai)是位于伊利诺伊州芝加哥的Surgisphere的创始人，也是这项研究的合著者之一。他拒绝对“自然”杂志发表评论，拒绝就撤回以及对研究背后数据质量的担忧发表评论。德赛签署了“新英格兰医学杂志”的撤回，但没有签署“柳叶刀”的撤回。\n在“柳叶刀”的研究发表后，一些监管机构暂停了羟基氯喹作为COVID-19治疗方法的临床试验的登记。这种药物价格便宜，易于管理，在大流行中得到了广泛认可，包括美国总统唐纳德·特朗普(Donald Trump)，尽管几乎没有证据表明其有效性。一些暂停的试验，包括由世界卫生组织领导的一项试验，现在又开始了。但研究人员表示，他们已经失去了时间，参与试验的热情可能正在减弱。\n德赛、梅赫拉和其他人利用Surgisphere数据撰写的第三项研究声称，当患者服用抗寄生虫药物伊维菌素时，发现新冠肺炎的死亡率大幅降低，该研究于4月6日首次发布在社会科学预印服务器SSRN上，现已从该服务器上消失；4月19日发布了第二个版本。梅拉告诉“自然”杂志，他删除这项研究是因为他觉得它还没有准备好接受同行评审。\n西班牙巴塞罗那全球卫生研究所的卡洛斯·查库尔(Carlos Chaccour)表示，尽管这篇论文没有发表在同行评议的期刊上，但它仍然推动了伊维菌素在南美的受欢迎程度。查库尔正在进行伊维菌素的临床试验，并对预印本的数据提出了质疑。\n生物伦理学家说，撤回和取消预印本不仅提出了关于Surgisphere数据的质量和性质的问题，也提出了为什么论文的其他作者同意使用他们无法验证的大型数据集的问题，以及这项工作是如何在著名医学期刊上通过同行审查的。\n5月22日发表的这项羟氯喹研究据称分析了从六大洲671家医院的9.6万名患者身上收集的电子健康记录。但批评人士很快就对数据中的古怪之处提出了质疑，并要求提供更多关于其来源的细节。到5月28日，120名研究人员在致“柳叶刀”的一封信上签了名，强调了他们的担忧。这些问题也让人对NEJM的研究产生了怀疑，该研究依赖于Surgisphere的数据，这些数据显然覆盖了169家医院的近9000名患者。\nMehra说，他和其他合著者要求对位于马里兰州贝塞斯达的医疗数据研究机构医疗技术与实践模式研究所(MTPPI)的两篇论文中的数据进行独立审计。但是在6月3日，Mehra说，MTPPI告诉他们，Surgisphere不会分享数据，“因为它与客户达成了协议，而且这些文件包含机密信息”。梅赫拉和他的合著者要求撤回。\n悉尼麦格理大学(Macquarie University)的生物伦理学家温迪·罗杰斯(Wendy Rogers)表示，在发表研究之前，研究人员和期刊本应提出更多问题，比如在大流行期间从世界各地的医院收集了如此全面的数据集。“事后诸葛亮总是比较容易，”她说，“但总的来说，COVID-19的研究总是如此仓促，以至于各种真正糟糕的论文都被发表了。”她说，“但总的来说，COVID-19的研究是如此仓促，以至于各种真正糟糕的论文都在发表。”\n在大型临床试验中测试羟基氯喹的研究人员说，他们担心围绕柳叶刀研究结果的宣传可能会使完成他们的研究变得更加困难，尽管这篇论文现在已经被撤回。加州大学圣地亚哥分校的传染病专家大卫·史密斯说：“我们听说人们对羟基氯喹不感兴趣。”他正在帮助进行一项由美国国家过敏和传染病研究所资助的试验，以测试这种药物在没有住院的新冠肺炎患者身上的作用。“撤回不会像最初的研究那样获得更多的新闻，”他说。“关于羟氯喹的治疗，我们可能永远得不到答案。”\n新冠肺炎中有关羟氯喹的数据大多来自体外研究或小型临床试验。然而，6月5日，在英国进行了一项名为RECOVERY的大型随机试验的研究人员宣布，他们对4600多名住院患者的数据表明，羟基氯喹并不能降低死亡风险，他们正在停止这项试验。6月3日，一项对820人进行的随机对照研究报告称，在接触新冠肺炎3病毒的高危人群中，该药物对预防感染无效。与撤回的柳叶刀论文相比，这些研究没有发现羟氯喹治疗对心脏有毒性的证据。\n英国剑桥大学医院NHS基金会信托基金(Cambridge University Hospital NHS Foundation Trust)的临床药理学家约瑟夫·切里扬(Joseph Cheriyan)表示，这些发现并不排除羟基氯喹在其他环境中可能的好处。在柳叶刀的论文发表后，测试该药物的试验被暂停，等待安全性审查。(自那以后，其中一家已经恢复。)。“我们唯一能知道的方法就是我们是否做了试验，令人沮丧的是，这篇文章基本上耽误了我们的时间，”他说。\n史密斯说，使用大型数据集的研究在没有对原始数据进行外部审查的情况下发表的情况并不少见。但有一个例外，那就是这篇论文预计会产生特别高的影响，就像柳叶刀的案例一样。他说，在这种情况下，似乎忽略了额外仔细的审查。“现在很匆忙，”他说。“我们迫切需要知识，也许我们跳过了一些久经考验的检查。”\n“柳叶刀”和“新英格兰医学杂志”都表示，他们的同行审查过程是保密的，他们不能透露论文审查速度的细节。“这篇文章进行了外部同行评审和统计评审，以及科学和稿件编辑。然而，就像我们处理任何这类事件一样，我们正在审查我们的程序，包括如何评估基于电子病历数据分析大型数据集的研究，NEJM的一位发言人表示。\nSurgisphere的伊维菌素预印本可能寿命更长。查库说，秘鲁政府在一份白皮书引用SSRN预印本几天后，将这种药物纳入了国民治疗指南，一周后，玻利维亚以秘鲁的情况为由，在其治疗指南中增加了伊维菌素。巴拉圭发布了伊维菌素的销售限制，因为需求量很大。\n查科尔在Facebook上向秘鲁科学院发表了关于伊维菌素的演讲后，他说他几乎每天都会收到人们的短信，说他们有一个受感染的家庭成员，可以获得用于动物而不是人类的伊维菌素配方。“他们寄给我一张兽药配方的照片，问我，‘你介意告诉我我们应该用什么吗？’”他说。“它随处可见，人们普遍感到绝望，这可能会导致滥用。”\n查库尔担心，因为这两个版本的预印本没有在期刊上发表，所以没有缩回机制来限制它们的伸展距离。“拉丁美洲的伊维菌素幽灵是谁收回的？”他说。“没有高调的期刊说这是错误的。”", "note_en": "Two weeks after a high-profile paper in  The Lancet  1 reported that the antimalarial drug hydroxychloroquine might be dangerous to patients with COVID-19, three of its four authors have retracted the work because they were unable to independently verify their data set, a large proprietary collection of electronic health records analysed by Surgisphere, a US company.\n On the same day, 4 June, the researchers and other co-authors retracted a paper in the  New England Journal of Medicine ( NEJM)  2, for the same reason. That study, published a month ago, had looked at the impact of certain heart medications on people with COVID-19, and found no safety concerns.\n Scientists say the affair raises serious questions about the way researchers and journals evaluate the data underlying papers that they publish, and may complicate the effort to trial drugs during the coronavirus pandemic.\n “This whole event is catastrophic — it is problematic for the journals involved, it is problematic for the integrity of science, it is problematic for medicine, and it is problematic for the notion of clinical trials and evidence generation,” says Ian Kerridge, a bioethicist at the University of Sydney, Australia.\n Both papers relied on proprietary data analysed from electronic health records that were apparently gathered from hundreds of hospitals around the world by Surgisphere. But after critics raised questions about the studies, the firm did not make its raw data available to third-party auditors for validation. According to the retraction notice in the  Lancet, Surgisphere was concerned that transferring the data would violate &#34;client agreements and confidentiality requirements&#34;.\n “Since we do not have the ability to verify the primary data or primary data source, I no longer have confidence in the origination and veracity of the data, nor the findings they have led to,” said Mandeep Mehra, a cardiologist at Brigham and Women’s Hospital in Boston, Massachusetts, who was the lead author on both studies.\n Sapan Desai, the founder of Surgisphere, in Chicago, Illinois, and a co-author of the studies, declined to comment to  Nature on the retractions and on concerns about the quality of the data behind the studies. Desai signed the  NEJM retraction but not the  Lancet one.\n After the  Lancet study appeared, some regulators had  paused enrolment in clinical trials of hydroxychloroquine as a treatment for COVID-19. The drug, which is cheap and easy to administer, has been widely endorsed in the pandemic, including by US President Donald Trump, despite scant evidence of its effectiveness. Some of the halted trials, including one led by the World Health Organization, are now starting again. But researchers say they’ve lost time and that enthusiasm to take part in the trials may be waning.\n A third study authored by Desai, Mehra and others that used Surgisphere data, which claimed to find a large reduction in COVID-19 mortality when patients were given the anti-parasitic drug ivermectin, has disappeared from the social-sciences preprint server SSRN, where it was first posted on 6 April; a second version was posted on 19 April. Mehra told  Nature that he removed the study because he &#34;did not feel it was ready for peer review&#34;.\n Although the paper was not published in a peer-reviewed journal, it has nonetheless contributed to a surge in the popularity of ivermectin in South America, says Carlos Chaccour of the Barcelona Institute for Global Health in Spain, who is running a clinical trial of ivermectin and had  raised questions about the preprint’s data.\n  Bioethicists say the retractions, and the pulled preprint, raise questions not only about the quality and nature of Surgisphere&#39;s data, but also about why the paper’s other authors agreed to work with a large data set they couldn’t validate, and how the work passed peer review at prestigious medical journals.\n The hydroxychloroquine study, published on 22 May, had purportedly analysed electronic health records gathered on 96,000 patients in 671 hospitals across six continents. But critics soon raised questions about oddities in the data, and asked for more details on its origins. By 28 May, 120 researchers had signed a letter to  The Lancet highlighting their concerns. The questions also cast doubt on the  NEJM study, which relied on Surgisphere data that apparently covered almost 9,000 patients across 169 hospitals.\n Mehra says he and other co-authors asked for an independent audit of the data in both papers from Medical Technology &amp; Practice Patterns Institute (MTPPI), a health-care data research institute in Bethesda, Maryland. But on 3 June, Mehra says, MTPPI told them that Surgisphere would not share the data “because of agreements with its clients and the fact that the documents contain confidential information”. Mehra and his co-authors asked for retractions.\n Before they published the studies, researchers and journals should have asked more questions about how so comprehensive a data set had been gathered from hospitals across the world in the middle of a pandemic, says Wendy Rogers, a bioethicist at Macquarie University in Sydney. “It is always easier with hindsight,” she says, “but in general with the COVID-19 research, there has been such a rush that all sorts of really abysmal papers are getting published.”\n  Researchers testing hydroxychloroquine in large clinical trials say they’re worried that the publicity around the  Lancet findings may make it harder to complete their research, even though the paper has now been retracted. “We’re hearing that people just aren’t interested in hydroxychloroquine,” says David Smith, an infectious disease specialist at the University of California, San Diego, who is helping to run a trial funded by the US National Institute of Allergy and Infectious Diseases to test the drug in people with COVID-19 who have not been hospitalized. “The retraction won’t get anywhere near as much news as the original study,” he says. “We may never get an answer about treatment with hydroxychloroquine.”\n Most data on hydroxychloroquine in COVID-19 has come from in vitro studies or small clinical trials. On 5 June, however, researchers with a large randomized UK trial, called RECOVERY, announced that their data on more than 4,600 hospitalized patients indicated that hydroxychloroquine didn&#39;t reduce the risk of death, and they were stopping that arm of the trial. And a randomized, controlled study in 820 people reported on 3 June that the drug was not effective in preventing infection among people who were at high risk of infection following exposure to someone with COVID-19  3. In contrast to the retracted  Lancet paper, the studies found no evidence of toxicity to the heart from hydroxychloroquine treatment.\n Those findings don’t rule out possible benefits from hydroxychloroquine in other settings, says Joseph Cheriyan, a clinical pharmacologist at the Cambridge University Hospitals NHS Foundation Trust in the United Kingdom, where trials testing the drug were halted pending a safety review after the  Lancet paper. (One has since resumed.) “The only way we’re going to know is if we do the trials, and what is frustrating is that this article has essentially delayed us,” he says.\n It is not uncommon for studies that use large data sets to be published without external scrutiny of the raw data, says Smith. But an exception to this is when the paper is expected to have particularly high impact, as in the  Lancet case. In this instance, he says, it appears that extra-careful review was skipped. “It’s a rush right now,” he says. “We are desperate for knowledge, and maybe we’re skipping over some of our tried-and-true checks.”\n Both  The Lancet and the  NEJM said their peer review processes were confidential, and that they could not give details about how quickly the papers were reviewed. “The article had external peer review and statistical review, as well as scientific and manuscript editing. However, as we would do with any incident of this type, we are reviewing our procedures, including how we assess research analyzing large datasets based on electronic medical record data,&#34; said an  NEJM spokesperson.\n  Surgisphere’s ivermectin preprint may have a longer life. The Peruvian government included the drug in its national treatment guidelines a few days after a white paper cited the SSRN preprint, Chaccour says, and a week after that, Bolivia added ivermectin to its treatment guidelines, citing the situation in Peru. Paraguay has issued restrictions on the sale of ivermectin because of high demand.\n After Chaccour gave a talk about ivermectin to the Peruvian Academy of Sciences, streamed on Facebook, he says he gets texts almost every day from people saying that they have an infected family member and can obtain formulations of ivermectin intended for use in animals, not people. “They send me a photo of a veterinary formulation and ask me, ‘Would you mind telling me what dose we should use?’” he says. “It is broadly available and people are broadly desperate and this could lead to misuse.”\n Because the two versions of the preprint were not published in a journal, there is no retraction mechanism to limit their long reach, Chaccour worries. “Who retracts this ivermectin ghost in Latin America?” he says. “There’s no high-profile journal saying this was wrong.”", "posttime": "2020-06-06 02:42:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,profile,研究", "title": "高调的冠状病毒撤回引发了人们对数据监管的担忧", "title_en": "High-profile coronavirus retractions raise concerns about data oversight", "transed": 1, "url": "https://www.nature.com/articles/d41586-020-01695-w", "via": "", "real_tags": ["病毒", "冠状病毒", "profile", "研究"]}, {"category": "", "categoryclass": "", "imagename": "e5154da45817685d2539202d91aa3350.jpg", "infoid": 1005324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有什么比得上真实的第一人称视频的威力了。如果你在家和你的孩子或宠物玩耍，佩戴随身相机可以让你保存那些特别的记忆，而不需要把脸贴在手机里。而且，如果你参加抗议活动，想要抓住任何人的渎职行为，这也是符合条件的。\n虽然你可以不厌其烦地买一台专用的随身相机，但用一台树莓Pi Zero W和几个便宜的部件就可以很容易地制作一台。请注意，如果您要参加抗议活动，您将希望使您的设置尽可能地不引人注目和不具威胁性。如果你的夹克外面有电线和胶带，人们可能会有错误的印象。本文中的照片展示了我们关于如何使设置看起来像车载相机的最好方法，但您也许可以使其更紧凑，看起来不那么吓人。\n这个项目将记录您的日常生活，只需按一下按钮。它将以两分钟的块持续录制，当触发时，它会将视频保存到磁盘，然后上传到私人Dropbox文件夹进行安全保管。因此，即使你的相机坏了或被没收了，你的视频也可以在云中使用。在Dropbox中，您可以根据需要编辑和共享视频。\n树莓圆周率相机模块。请注意，PI Zeros使用的相机电缆比其他PI更窄。\n1.将两条导线连接到树莓PI Zero W上的GPIO 16和GND。您可以将导线焊接在PI Zero W上或将GPIO引脚连接到PI Zero W，方法是将其焊接或使用Pimoroni Hammer接头。预焊覆盆子Pi Zero Ws，被称为Zero WH，也可以出售。\n使用2x母式到母式跳线和2针按钮将GPIO16和GND连接到按钮。\n2.使用小胶带或热收缩管来整理连接。把胶带包起来，使纽扣和电线牢固。\n3.使用适配器将摄像头模块插入Raspberry PI Zero W摄像头插槽。确保电缆正确插入并锁定到位。如果使用官方Raspberry Pi Zero W表壳，请将带状电缆插入表壳下侧的插槽中。\n4.在连接外围设备的情况下启动Raspberry PI Zero W。如果您还没有microSD卡，请参阅我们关于如何首次设置Raspberry PI的文章。\n5.打开手机热点，或将手机设置为接入点。记下接入点名称和密码。\n7.启用Raspberry PI OS下的摄像头模块。您可以通过转到Preferences&gt；&gt；Raspberry PI Configuration，单击Interfaces选项卡并确保启用相机界面来实现此目的。重新启动PI以使其生效。\n8.在命令提示符下输入以下命令，安装Python 3的Dropbox库。\n9.在浏览器中导航到Dropbox Developers www.dropbox.com/Developers，然后单击Create Apps登录。如果您还没有Dropbox帐户，请注册一个(2 GB基本计划是免费的)，然后返回此页面。\n10.选择Dropbox API和App文件夹访问。然后命名应用程序，这将创建一个文件夹来存储视频文件，并单击创建应用程序。\n11.单击“生成的访问令牌”下的“生成”，然后将此令牌复制到备用文本文档中以供日后参考。\n13.输入代码，如下所述。Python的第一行是Python3解释器的位置，这是使代码可从终端执行所需的位置。\n14.导入下列库，增加对基础IO、按钮、摄像头、日期/时间、Dropbox的支持。\n15.将Dropbox内标识粘贴到代码中，然后将其赋给一个名为“Token”的变量。然后使用用于身份验证的令牌连接到Dropbox。\n16.创建一个对象“Trigger”，该对象将用于将连接到GPIO 16的按钮链接到代码。\n17.创建与Raspberry Pi摄像头的连接，然后将分辨率设置为720p。\n18.创建录制流。流用于创建一个循环缓冲区，该缓冲区将在按下按钮之前记录事件。在这里，摄像机被指示在激活前2分钟进行记录。该流被记录到H264文件。\n19.添加一条try语句，该语句将尝试运行其中缩进的代码，在本例中，它将以循环开始，以不断运行其中的代码。\n20.创建延迟，强制摄像机在每次循环迭代时等待一秒。\n21.。为触发器创建IF条件，并设置当前日期和时间，稍后用作时间戳。当用户按下该按钮时，该IF条件将启动视频采集过程。\n22.。向终端打印一条消息，显示记录器已被触发，并将记录时间设置为120秒。\n23.。添加此代码将视频流保存到一个文件中，该文件使用时间戳作为文件名，并附加文件格式以创建有效的文件。打印另一条消息以通知用户。\n24.。添加此代码以使脚本能够以只读模式打开新创建的视频文件，并将其上载到Dropbox，覆盖任何共享相同名称的文件。完成此操作后，将向终端打印一条消息。\n25.。创建最后两行代码，以便在用户停止运行代码时停止摄像机录制。", "note_en": "There’s nothing quite like the power of real, first-person video. If you’re at home playing with your children or pets, wearing a body camera lets you save those special memories, without sticking your face in your phone. And, if you’re attending a protest and want to capture malfeasance on anyone’s part, it also fits the bill.\n While you could go out of your way to buy a dedicated body camera, it’s easy enough to build one using a  Raspberry Pi Zero W and a few inexpensive parts. Note that, if you are going to a protest, you’ll want to make your setup as unobtrusive and non-threatening as possible. If you have wires and duct tape hanging out of your jacket, people could get the wrong impression. The photos in this article show our best take on how to make the setup look like the body camera that it is, but you may be able to make it more compact and less scary looking.\n  This project will record your daily life at the push of a button. It will be constantly recording in two minute chunks, and when triggered it will save the video to disk, before uploading for safe keeping to a private Dropbox folder. So, even if your camera breaks or is confiscated, your video will be available in the cloud. From Dropbox, you can edit and share your videos as necessary.\n  Raspberry Pi Camera Module. Note that Pi Zeros use a narrower camera cable than other Pis.\n   1.  Attach two wires to GPIO 16 and GND on the Raspberry Pi Zero W. You can either solder the wires on or attach GPIO pins to the Pi Zero W, either by soldering them on or using a   Pimoroni Hammer Header. Pre-soldered Raspberry Pi Zero Ws, known as the Zero WH, are also available for sale.\n  Using 2x female to female jumper wires and a 2 pin push button connect GPIO16 and GND to the button.\n  2.  Use a little tape or heat shrink tubing to tidy up the connection. Wrap the tape so that the button and the wires are secure.\n 3.  Insert the camera module to the Raspberry Pi Zero W Camera slot using the adapter. Ensure that the cable is inserted correctly and locked into place. If using the official Raspberry Pi Zero W case, feed the ribbon cable through the slot on the underside of the case.\n   4.  Boot your Raspberry Pi Zero W with peripherals connected. If you don’t already have a microSD card see our article on   how to set up a Raspberry Pi for the first time.\n 5.  Turn on your mobile hotspot, or set your cell phone to act as an access point. Make a note of the access point name and the password.\n  7.  Enable the camera module in Raspberry Pi OS. You can do that, by going to Preferences &gt;&gt; Raspberry Pi Configuration, clicking on the Interfaces tab and ensuring that.the Camera interface is enabled. Reboot the Pi for this to take effect.\n  8.  Install the Dropbox library for Python 3 by entering the following at the command prompt.\n   9.  Navigate to Dropbox Developers   www.dropbox.com/developers in your browser and  Click on Create Apps to sign in. If you don’t already have a Dropbox account, register for one (2GB Basic Plan is free) and then return to this page.\n 10.  Select the Dropbox API and App Folder access. Then  name the app, which creates a folder to store the video files and click  Create App.\n   11.  Click Generate under Generated access token then  copy this token into a spare text document for later reference.\n    13.  Enter the code as described below. The first line of Python is the location of the Python3 interpreter, this is needed to make the code executable from the terminal.\n   14.  Import the following libraries to add support for basic IO, a push button, the camera,  date / time and Dropbox.\n  15.  Paste the Dropbox token into the code, and then  assign it to a variable called “token”. Then a connection to Dropbox is made using the token for authentication.\n  16.  Create an object, “trigger” that will be used to link the button connected to GPIO 16 to the code.\n  17.  Create a connection to the Raspberry Pi Camera, then  set the resolution to 720p.\n  18.  Create a recording stream. A stream is used to create a circular buffer that will record events before the button is pressed. Here the camera is instructed to record 2 minutes before activation. The stream is recorded to an h264 file.\n  19.  Add a try statement which will attempt to run the code indented within it, in this case it will start with a loop to constantly run the code within.\n  20.  Create a delay, forcing the camera to wait for one second each time the loop iterates.\n  21.  Create an if condition for the trigger and  set the current date and time, used later as a timestamp. When the user presses the button, this if condition will start the process of capturing video.\n  22.  Print a message to the terminal to show that the recorder has been triggered and  set the recording time to 120 seconds.\n  23.  Add this code to save the video stream to a file, which uses the timestamp as the filename, and appends the file format to create a valid file. Another message is printed to advise the user.\n  24.  Add this code to enable the script to open the freshly created video file in read only mode and upload it to Dropbox, overwriting any files that share the same name. A message is printed to the Terminal when this is complete.\n  25.  Create these last two lines of code to stop the camera recording when the user stops the code from running.", "posttime": "2020-06-06 02:42:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "raspberry-pi,相机,树莓,raspberry,dropbox", "title": "如何制作树莓派人体相机", "title_en": "How to Build a Raspberry Pi Body Camera", "transed": 1, "url": "https://www.tomshardware.com/uk/how-to/raspberry-pi-body-camera", "via": "", "real_tags": ["相机", "树莓", "raspberry", "dropbox"]}, {"category": "", "categoryclass": "", "imagename": "6077afe1c0732c0ffa2f73b417a69d00.jpg", "infoid": 1005323, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司今天宣布，它正在启动一个为密码管理器开发者设计的开源项目。目标是让开发人员更容易“创建与流行网站兼容的强密码”。\n苹果的iCloud钥匙链平台已经能够在创建账户或更改密码时生成强密码。新的Password Manager Resources开源项目旨在将其扩展到Password Manager应用程序。\nPassword Manager Resources开源项目允许您集成iCloud Keychain Password Manager使用的特定于网站的要求，以生成强的、唯一的密码。该项目还包含已知的共享登录系统的网站集合，指向用户更改密码的网站页面的链接，等等。\n苹果在GitHub上推出了新的密码管理器资源，让所有人都可以使用。该项目背后的团队解释说，这个想法是为了让“密码管理器的创建者可以在资源上进行协作，为用户更好地进行密码管理。”到目前为止，可用的信息由数据或“怪胎”和代码组成。\n具有共享凭据后端的网站：已知使用相同凭据后端的网站组，可用于增强登录网站的建议凭据。\n更改密码URL：为了推动强密码的采用，能够将用户直接带到网站的更改密码页面是很有用的。\n通过共享资源，所有密码管理器都可以通过比任何单个密码管理器获得相同效果所需的工作更少的工作来提高其质量。\n通过公开记录特定于网站的行为，密码管理器可以激励网站使用标准或新兴标准来提高它们与密码管理器的兼容性；在列表上被叫出来一点都不好玩！\n通过提高密码管理器的质量，我们提高了用户对他们的信任度，这对每个人都是有利的。\n你可以在苹果的GitHub页面上查看完整的密码管理器资源集合。\n您正在阅读的是朝九晚五的Mac--日复一日地发布有关苹果及其周边生态系统的新闻的专家们。请务必查看我们的主页以获取所有最新新闻，并在Twitter、Facebook和LinkedIn上关注9to5Mac以随时了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "Apple has  announced today that it is launching an open source project designed for developers of password managers. The goal is to make it easier for developers to “create strong passwords that are compatible with popular websites.\n  Apple’s iCloud Keychain platform is already able to generate strong passwords at the time of account creation or when you change a password. The new Password Manager Resources open source project aims to extend that to password manager applications.\n  The Password Manager Resources open source project allows you to integrate website-specific requirements used by the iCloud Keychain password manager to generate strong, unique passwords. The project also contains collections of websites known to share a sign-in system, links to websites’ pages where users change passwords, and more.\n Apple has launched the new  Password Manager Resources on GitHub, making it available to everyone. The team behind the project explains that the idea is to make it so “creators of password managers can collaborate on resources to make password management better for users.” As of right now, the available information consists of data, or “quirks”, and code.\n Websites with Shared Credential Backends: Groups of websites known to use the same credential backend, which can be used to enhance suggested credentials to sign into websites.\n Change Password URLs: To drive adoption of strong passwords, it’s useful to be able to take users directly to websites’ change password pages.\n  By sharing resources, all password managers can improve their quality with less work than it’d take for any individual password manager to achieve the same effect.\n By publicly documenting website-specific behaviors, password managers can offer an incentive for websites to use standards or emerging standards to improve their compatibility with password managers; it’s no fun to be called out on a list!\n By improving the quality of password managers, we improve user trust in them as a concept, which benefits everyone.\n You can view the full collection of Password Manager Resources on Apple’s  GitHub page here.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-06-06 02:42:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,开发,发布,开源,app", "title": "苹果为开发者发布开源的“Password Manager Resources”项目", "title_en": "Apple releases open source 'Password Manager Resources' project for developers", "transed": 1, "url": "https://9to5mac.com/2020/06/05/apple-releases-new-open-source-password-manager-resources-project-for-developers/", "via": "", "real_tags": ["苹果", "开发", "发布", "开源", "app"]}]