[{"category": "", "categoryclass": "", "imagename": "59abf42ca20f04d1c852861e4c803fcf.png", "infoid": 1031960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是给那些在大学做过科学研究并正在考虑成立一家公司将其商业化的人的建议。\n在YC，我们已经在这种情况下为75家以上的公司提供了资金。我们最近还参加了一次生物之旅，我们走访了研究型大学，并与数百名生命科学领域的学生和教授讨论了将他们的研究商业化的问题。这些是创始人向我们询问的最常见的话题。\n在一个典型的衍生情况下，有几个人参与了这项研究，包括学生、博士后和教职员工。你需要决定的第一件事是谁将在公司工作，谁将留在大学。\n许多科学创始人对如何构建他们的创始团队有误解。以下是最常见的几种。\n这里有一个直截了当的事实，它经常让创始人感到不舒服：除非从事原始研究的人愿意离开大学职位来创办这家公司，否则你的公司几乎没有成功的机会。\n如果你是一名即将毕业的学生，你可以等到毕业，那是开公司的绝佳时机。但不然的话，在某个时候，你将不得不做出有意离职的决定，这样你才能经营公司。\n太多的科学家认为，他们应该留在学术界，找一位首席执行官围绕他们的发明创办一家公司。这几乎总是一个坏主意。首先，在这么早的阶段很难找到一位优秀的CEO来管理公司。真正伟大的CEO很少，他们通常比在没有资金的情况下经营一家创意阶段的初创公司有更好的机会。因此，大多数尝试这种方法的科学家要么永远找不到CEO，要么最终满足于一个平庸的CEO。如果你的大学试图为你找一位首席执行官，那就更糟了。\n但是，即使你可以挑选世界上任何一个人来管理你的公司，这可能也不是一个好主意。这一阶段最好的首席执行官是做过最初研究的人之一。与任何局外人相比，进行原始研究的人对企业成功的投入要大得多。他们也更有资格围绕它创建一家公司，因为他们在该领域的领域知识比外部CEO带来的任何一般商业技能都要有价值得多。\n一个相关的误解是认为研究已经完成，剩下的就是将其商业化。如果这是真的，或许外部CEO会有意义。然而，很少会有这样的结果。通常，你会发现市场想要的东西并不完全是你发明的东西，需要做更多的研究。最初的发明者可以接受这种反馈并做出调整；外部首席执行官只会被卡住。\n许多科学家认为，要创办一家公司，你需要有商业和金融经验的人。事实并非如此。在最初的几年里，通常没有什么“业务”要做，无论你需要什么业务技能，你都会在一路上学到。我们在Y Combinator资助的大多数科学家都没有商业经验。\n在商界工作的人喜欢把它说得很难，好像商界就像量子物理学一样，这是一个需要研究多年才能掌握的领域。事实是，它根本不是很接近。\n通常，人们不确定自己是否愿意冒险离开稳定的学术职位去追求创业。因此，他们将自己的想法推介给一些当地的风险投资公司。他们认为，如果这是一个好主意，风投公司会为他们提供资金，验证这个想法，让他们从大学工作平稳过渡到一家资金雄厚的公司。\n虽然风投公司偶尔会以这种方式为分拆提供资金，但通常不会。不幸的是，太多的创始人被风投拒绝了，并得出结论，他们的想法肯定是糟糕的，于是放弃了。实际上，问题在于，现在从风投公司筹集资金还为时过早。\n通常情况下，创始人需要在公司全职工作1年以上，才能从风投那里筹集数百万美元。与此同时，他们通过从储蓄中自筹资金、获得政府研究拨款、从朋友和家人那里筹集一小笔资金，或者从天使投资者、加速器或种子基金那里筹集一小笔“种子”资金来维持自己的生计。\n在筹集资金之前不愿辞职的创始人通常会陷入进退两难的境地。在他们辞职之前，他们正在等待投资者对他们下注。但投资者们正在等待创始人们对自己的公司有足够的信心，从而辞去他们的工作！\n理想的情况是，实验室里有两个或更多做过这项工作的人一起离开，以联合创始人的身份创办公司。一名全职创始人也可以。离开公司创办公司的人中应该有一个是首席执行官。\n在许多情况下，其他参与研究的人希望留在大学里，但仍然以某种方式做出贡献。那没问题。这些人通常被称为“学术联合创始人”或“科学联合创始人”，他们仍然可以非常有帮助。但将成为全职创始人的人是最重要的。\n在开发一项新技术的早期阶段，你仍然可以利用大学的资源在大学里取得更快的进步。这是做初步实验以证明你的想法可行的理想场所。你甚至可以通过像NSF i-Corps这样的项目，或者仅仅通过打电话给潜在的客户/利益相关者，对新产品的市场需求进行一些测试。然而，在某一时刻，情况会发生逆转，在大学里会开始放慢你的速度，因为大学并不是为技术商业化而设立的。\n在离开之前，有可能走得太早，也有可能等得太久。不过，毫无疑问，更常见的错误是等待时间太长。\n大多数创始人等待的时间太长了，因为离开是可怕的。学术界是一个舒适的环境。没有人强迫你离开，离开似乎有风险，所以自然而然的做法就是不断拖延。在推出之前，有一种让技术变得完美的诱惑，而且你总是可以“再做一次实验”。如果你不停止这个循环，你就永远不会离开。\n通常在人们真的离开后，他们意识到他们去年所做的很多工作都是浪费的，因为他们对市场需要什么的一些假设是错误的。他们还意识到，作为一家公司，他们现在的发展速度要快得多，如果早一年剥离出来，他们本可以节省几个月的时间。\n在你决定了谁将是创业公司的全职人员，以及每个人的角色都将是什么之后，你会想要拆分股权。\n尽管这一决定很重要，但创始人往往没有一个好的框架来做出决定。以下是我推荐的框架。它只有两条规则1。\n1)将在公司全职工作的创始人应获得同等或接近同等数额的股权。\n2)将离职到公司全职工作的创始人应该比将继续留在学术界的创始人获得更多的股权。学术联合创始人通常不应持有超过10%的股份，除非他们打算继续亲力亲为。\n我的同事迈克尔·西贝尔(Michael Seibel)之前曾写过一篇很棒的文章，阐述了为什么第一条规则如此重要。规则2很重要，因为全职创始人会花费数年时间让公司取得成功，他们需要拥有足够的所有权，这样做对他们来说是有意义的。\n我看到科学创始团队在这里犯的最大的概念性错误是，他们认为分配股权的目的是奖励过去的贡献，而实际上主要是预期未来的贡献。\n这里有一个关于创办公司的直截了当的事实。如果你要让一家新公司取得成功，你可能需要在分拆后为它工作7-10年。那可是很长的一段时间啊！\n如果你现在刚从一所大学毕业，你可能会觉得自己完成了一半，但实际上你是在26英里马拉松的2英里处。学术创始人可能在第一英里中起到了重要作用，但全职创始人将主要带领你走完剩下的25英里。创始人之间的股权分配必须反映出整个马拉松比赛的预期贡献。\n这样做的一个后果是，你在新公司的股权分割不一定与你在原来学术团队中的资历有任何关系。通常情况是，离开的人更初级，而资深人员/教职员工留下来。在这种情况下，离开的创始人最终将比他们的前老板拥有更多的股权。这可能是一次尴尬的谈话，但这是完全明智的。\n如果你打算将一所大学开始的研究成果商业化，你可能需要就知识产权的权利进行谈判。大学里这样做的组织是技术转移办公室。3个。\n在过去，技术转移办公室有着当之无愧的坏名声。他们以行动迟缓和官僚作风著称，并将繁琐的条款强加给脆弱的年轻初创公司。他们坚持的条款多次扼杀了他们试图创建的公司。该行业透明度极低，创始人很难知道哪些条款是公平的。\n幸运的是，情况已经好转了。现在有更多的信息可供创始人使用。哈佛、麻省理工学院和斯坦福等主要创业中心大学的技术转移小组现在给初创公司合理的条款(尽管他们做这件事仍然需要太长时间)。在那些没有看到很多成功的衍生产品的大学里，这是随机的。一些大学现在正在使用“快速许可协议”，这是一种预先设定的协议，几乎不需要谈判；希望这种情况会变得更加普遍。\n1)公平。通常情况下，大学将获得该公司的股权。只要不太多就可以。3-5%是典型的。超过10%会带来问题。5、6。\n2)版税。这意味着你要向大学支付一定比例的收入或利润。如果这一比例过高，可能会影响公司筹资和运营的生存能力。理想情况下，您应该将其设为零。如果你不能做到这一点，试着保持它&lt；5%，并在一定的年限和/或一定的付款水平后终止它。\n3)里程碑付款。也就是说，“当公司筹集第一个1000万美元时，你欠我们25万美元”，或者“当你进入第二阶段临床试验时，你欠我们50万美元”。因为在创业初期现金稀缺，所以你想把这些钱保持在尽可能低的水平。你永远不需要花费超过你募集资金的几个百分点。\n4)排他性。如果许可不是排他性的，理论上大学可以转而将相同的知识产权授权给一家大公司与你竞争。这听起来像是一个真正的问题，但通常不是。对于许多发明来说，在实践中，其他公司不会知道如何使用知识产权，也不会重视它，直到你做了多年的工作来进一步开发它(在这一点上，大学拥有的知识产权是不够的)。7最初拥有非排他性许可并可选择稍后将其设为排他性许可或优先购买权条款可能是最佳的。这里有一些关于谈判这些协议的建议。\n你应该与最近与同一办公室谈判协议的其他公司的创始人取得联系。找出他们得到了什么条件，并就谈判策略征求意见。你也可以问投资者、律师和顾问。您应该获得尽可能多的数据点。\n如果你是一名学生或博士后，让管理你的实验室的教授参与进来是很有价值的。教授们在大学里有影响力，他们会让你对顽固的技术转移办公室起到杠杆作用。你还需要确保他们没有任何竞争性的计划来利用这项技术进行自己的衍生产品。通常情况下，通过让他们及早加入成为顾问，他们将有助于获得一笔好交易，也会让你在投资者中获得信誉。\n如果协议太繁重，问问你自己是否需要它。在公司的时间里重新创建类似的东西可能会更便宜。8个\n更戏剧性的是，你可能最终甚至不会使用你计划许可的东西，因为初创公司一直在转移。我曾与许多公司就他们的技术转让协议进行过激烈的斗争，结果发现一年后，他们完全改变了做法，放弃了他们为获得许可而拼命争取的知识产权！防止这种情况的一种方法是确保任何特许权使用费都直接与技术的使用捆绑在一起。\n考虑在将来选择许可IP，而不是现在协商完整的许可协议。一种选择通常更便宜，也更容易获得，而且可以让你将最后的谈判推迟6到12个月。这也让您有时间在承诺授权之前查看您使用了多少原始IP。\n当心来自大学创业办公室的善意但糟糕的建议。大学里的一些创业办公室很棒，但不幸的是有些不好。更糟糕的是，一些人有自己的议程，比如帮助当地投资者。当你听取他们的建议时，考虑一下与你交谈的人是否有许多真正成功的公司的过往记录。\n尽早开始和这个办公室的谈话。这会给你更多的时间来达成协议，也会让你了解情况。\n不要等到协议达成后才成立公司。达成协议可能需要6个月或更长时间。许多投资者(包括YC)会在公司达成协议之前为它们提供资金。你在公司方面取得的进展越多，你在谈判中的筹码就越多。\n你需要把你的公司合并起来。如果你的总部设在美国(即使你不在美国)，不管你实际处于哪个州，你都会想要合并为特拉华州的C公司。9个。\n继续与您的实验室合作很可能是有意义的。他们可能会制作您想要许可的新作品。\n在某些情况下，您可能希望继续使用大学实验室进行实验工作。大学核心设施通常向公司开放，尽管收费较高。使用大学资源而不是从商业上购买等价物是有可能节省一大笔钱的。这很好，只要它不会显著减慢你的速度，也不会产生知识产权问题。不幸的是，通常需要在速度和成本之间进行权衡。\n对于学术界的创始人来说，一个很大的调整是将一种不同的激励结构内在化。在学术界，你会因为新的发现和发表而获得奖励。在初创企业中，新发现的奖励为零，出版的奖励几乎为零。在初创企业中，唯一能让你获得回报的就是朝着有商业价值的产品取得切实进展。\n一个副作用是，在初创企业中，做一些新的或困难的事情没有内在的奖励。任何时候，只要有捷径可以复制或购买已经存在的东西，你就应该选择它。在初创企业中，你希望你正在做的事情中的“新部分”尽可能小，而其他所有事情都要尽可能枯燥和低风险。\n另一个大的调整是速度。在初创企业中，你是在与时间赛跑。如果你没有在目前的资金耗尽之前达到里程碑，你的公司就会耗尽资金而死亡。这种硬约束迫使人们集中精力，这是独一无二的。因此，离开学术界去做YC的创始人经常告诉我们，他们在三个月的YC批次中比前一年完成了更多的工作。\n如果这让初创公司听起来压力很大，那么它们确实是有压力的，如果只是因为事关重大的话。当你开始自己的公司时，与任何正式工作相比，高潮更高，低谷更低。如果你想更多地了解创业的感觉，有一篇很棒的文章叫“创业到底是什么样子”(What Startups Is Real Like)。\n现在是创办生物科技或硬科技公司的最佳时机。现在可用的资金比以往任何时候都多，而且有一个发达的生态系统在每个阶段为创始人提供支持。今天，大多数研究生和博士后在留在学术界和在工业界找工作之间做出选择。我们认为将会有越来越多的第三种选择：创办自己的公司。\n谢谢，如果没有许多YC创始人的帮助，我不可能写出这篇文章，他们自己做了衍生产品。特别感谢Uri Lopatin，Birgitt Boschisch，Aaron Lazarus，Alexis Rovner，Juan Medina，Glenn Markov，John Ramunas，Wesley Wiersen，Lindsay Amos，Ravi Pamnani和Andrew Jajack阅读本文的草稿。\n1.另外，对于所有创始人来说，对他们的股票都有一个归属时间表也是非常重要的。它应该至少在四年内授予。↩2.“亲力亲为”不仅仅意味着提供建议。这意味着每周至少花1天/周为公司做积极的工作-写赠款，在实验室，参加销售会议等。他们的股权归属应该与他们继续担任亲力亲为的角色捆绑在一起。↩3.名称略有不同-有时被称为“技术许可办公室”，或“创新办公室”，但我将使用这个术语。↩4.这里有一些不太重要但仍然常见的术语和快速建议：(5)专利起诉-您应该控制专利申请和专利战略，(6)再许可-可能对您能够进行再许可很重要，(7)资金要求-尽量避免，(8)预付和年费-如果相对较小，可以接受，(9)来自同一实验室的未来知识产权的权利-可能值得也可能不值得，(10)按比例分配权利，以便大学可以投资以维持其所有权-如果大学能够迅速做出决定，并且只适用于定价的轮次，而不是可转换证券，则可以接受。↩5.有时条款要求的是“任何流动性事件收益的百分比”。这比股权更糟糕，因为它不能被稀释。所以，如果你的大学因为不能接受公平而坚持这一点，那么它应该是一个非常小的百分比，大约相当于公平百分比的⅓。↩6.另一个问题是反稀释条款，即在你筹集到XM美元之前，这些股权百分比不会稀释。↩7.与此相关的是，一些大学要求有一个“营销期”，在此期间他们向其他潜在买家兜售发明，但通常这只是一种形式，因为他们很少获得兴趣。↩8。此外，如果你有一个合理的途径来重建它，这可以让你比技术转移办公室更有优势。如果他们知道您正在忙于重新创建它，那么许可协议的价值每天都会下降。执行此操作的两个简单选项是http://clerky.com/和https://stripe.com/atlas.，↩9.。↩", "note_en": "This is advice for people who have done scientific research at a university and are considering starting a company to commercialize it.\n At YC, we’ve funded more than 75 companies in this situation. We also recently went on a  Bio Tour where we went around to research universities and talked with hundreds of students and professors in the life sciences about commercializing their research. These are the most common topics founders have asked us about.\n  In a typical spin-out situation, there are several people who worked on the research, including a mix of students, post docs and faculty. The first thing you need to decide is who is going to work on the company and who is going to stay at the university.\n A lot of scientific founders have misconceptions about how to structure their founding team. Here are the most common ones.\n  Here is a blunt fact that often makes founders uncomfortable: your company has little chance of success unless someone who worked on the original research is willing to leave their university role to start this company.\n If you are a student graduating soon, you can just wait until you graduate; that’s a perfect time to start a company. But otherwise, at some point you will have to make an intentional decision to leave so you can run the company.\n  Too many scientists believe that they should remain in academia and find a CEO to start a company around their invention. This is almost always a bad idea. For one, it’s hard to find a great CEO to run a company at this early stage. Truly great CEOs are scarce, and they usually have much better opportunities available to them than running an idea-stage startup with no funding. As a result, most scientists that try this approach either never find a CEO or end up settling for a mediocre one. It’s even worse if your university tries to find a CEO for you.\n But even if you could draft any person in the world to run your company, it still probably wouldn’t be a good idea. The best CEO for this stage is one of the people who did the original research. The people who did the original research will be far more invested in the success of the venture than any outsider. They are also far more qualified to build a company around it because their domain knowledge of the field is much more valuable than whatever general business skills an outside CEO would bring.\n A related misconception is believing that the research is done and that all that’s left is to commercialize it. If this were true, perhaps an outside CEO would make sense. However, it rarely works out that way. Usually you find that the thing the market wants is not quite the thing that you’ve invented, and that more research needs to be done. The original inventors can take this feedback and make adjustments; an outside CEO will just be stuck.\n  Many scientists think that to start a company you need someone with prior business and financial experience. This is just not the case. In the first couple of years, there is typically very little “business” to be done, and whatever business skills you need you will pick up along the way. Most of the scientists we fund at Y Combinator have no prior experience in business.\n People who work in business like to make it sound hard, as if business were like quantum physics, a field that needed to be studied for years to master. The fact is, it’s not even close.\n  Often, people are unsure of whether they want to risk leaving a stable academic role to pursue a startup. So they take their idea and pitch it to some local VC firms. They figure if it’s a good idea, the VC firms will fund them, validating the idea and giving them a smooth transition out of their university job and into a well-funded company.\n While VC firms will occasionally fund spin-outs this way, usually they don’t. Unfortunately, too many founders get turned down by VCs and conclude that their idea must be bad and give up. Actually, the issue is that it’s just too early at this point to raise money from VCs.\n Typically, founders will need to work full-time on their company for 1+ years before it is ready to raise a multi-million dollar round from VCs. In the meantime, they sustain themselves by self-funding from their savings, getting government research grants, raising a small amount from friends and family, or raising a small “pre-seed” round from angel investors, accelerators, or seed funds.\n Founders who won’t quit their job before they raise money often get stuck in a catch-22. They are waiting for an investor to take a bet on them before they quit their job. But the investors are waiting for the founders to believe enough in their own company to quit their job!\n  The ideal situation is that two or more people from the lab who did the work leave together to start the company as cofounders. One full-time founder is also ok. One of the people who leave to start the company should be the CEO.\n In many cases, other people who were involved in the research want to remain behind at the university but still contribute in some way. That’s fine. Those are often called “academic cofounders” or “scientific cofounders” and they can still be very helpful. But the founders who are going to be full-time are the most important.\n  In the early stages of developing a new technology, you’ll make faster progress still at the university, taking advantage of university resources. It’s the ideal place to do the initial experiments to prove that your idea could work. You can even do some testing of market demand for a new product, through programs like NSF I-Corps or just by calling up potential customers/stakeholders. At some point, though, that will flip, and being at a university will start to slow you down, because universities are not set up to commercialize technologies.\n It’s possible to leave too early and possible to wait too long before leaving. Unquestionably, though, the far more common mistake is to wait too long.\n Most founders wait too long because leaving is scary. Academia is a comforting environment. No one is pressuring you to leave and leaving seems risky so the natural thing to do is to keep delaying it. There’s a temptation to make the technology perfect before spinning out, and there’s always “one more experiment” you could do. If you don’t stop this cycle, you’ll never leave.\n Often after people do leave, they realize that a lot of the work they did in the last year was wasted, because some of their assumptions about what the market wanted were wrong. They also realize that they are now moving so much faster as a company that they could have saved months of time by spinning out a year earlier.\n  After you’ve decided who is going to be full-time on the startup and what everyone’s role will be, you’ll want to split up equity.\n As important as this decision is, founders often don’t have a good framework for making it. Here is the framework I recommend. It has just two rules  1.\n 1) Founders who will be working on the company full-time should get equal or nearly equal amounts of equity.\n 2) Founders who will be leaving their job to work on the company full-time should get much more equity than founders who are going to remain in academia. Academic cofounders should typically own no more than 10% unless they are going to continue to be hands-on  2.\n My colleague Michael Seibel previously wrote a  great essay about why rule #1 is so important. Rule #2 is important because it is the full-time founders who will invest years of their life exclusively in making the company successful, and they need to have enough ownership that it makes sense for them to do that.\n The biggest conceptual mistake I see scientific founding teams make here is that they think the purpose of allocating equity is to reward past contributions, when actually it’s mainly to anticipate future ones.\n Here’s a blunt fact about starting a company. If you are going to make a new company successful, you will probably have to work on it for 7-10 years post spin-out. That’s a long time!\n If you are just spinning out of a university now, you might feel like you’re halfway done, but actually you are on mile 2 of a 26 mile marathon. The academic founders may have been instrumental in the first mile, but it is the full-time founders who will be primarily taking you the other 25. The equity split between founders has to reflect the expected contributions over the whole marathon.\n One consequence of this is that your equity split in the new company will not necessarily have any relation to your seniority within the original academic team. It’s often the case that the people leaving are more junior, while the senior people / faculty remain. In that case, the founders who leave will end up with much more equity than their former boss. This can be an awkward conversation, but it’s entirely sensible.\n  If you are going to commercialize research started at a university, you will probably need to negotiate the rights to the intellectual property. The group at a university that does that is the technology transfer office.  3\n In the past, tech transfer offices had a well-deserved bad reputation. They were known for being slow and bureaucratic, and for forcing onerous terms onto fragile young startups. Many times the terms they insisted on strangled the very companies they were trying to create. There was so little transparency in the industry, it was hard for founders to know what terms were fair.\n Fortunately, things have gotten better. There is now much more information available for founders. Tech transfer groups at the universities in major startup hubs like Harvard, MIT and Stanford now give startups reasonable terms (though they still take too long to do it). At universities that have not seen many successful spin-outs, it’s hit-or-miss. A few universities are now using “ express  license agreements”, preset agreements that require little to no negotiation; hopefully this will become more common.\n  1) Equity. Typically the university will get equity in the company. This is ok as long as it is not too much. 3-5% is typical. Above 10% will cause problems.  5,   6\n 2) Royalty. This means that you pay a percentage of revenue or profits to the university. If this is too high, it can affect the viability of the company to raise money and operate. Ideally you would make this zero. If you can’t do that, try to keep it &lt; 5%, and to have it terminate after a certain number of years and/or a certain level of payments.\n 3) Milestone payments. I.e., “You owe us $250K when the company raises its first $10M”, or “You owe us $500K when you reach Phase II clinical trials”. Because cash is scarce in the early days of a startup, you want to keep these as low as possible. You should never need to spend more than a few percent of the money you raise.\n 4) Exclusivity. If a license is not exclusive, the university could theoretically turn around and license the same IP to a big company to go compete with you. This sounds like a real problem, but often it’s not. For many inventions, in practice other companies won’t know how to use the IP and won’t value it until you’ve done years of work further developing it (at which point the university-owned IP isn’t sufficient).  7 It may be optimal to have a non-exclusive license initially with an option to make it exclusive later, or a right of first refusal clause. Here is some advice for negotiating these agreements.\n You should get in touch with founders of other companies that have recently negotiated agreements with the same office. Find out what terms they got and ask for advice on negotiating strategy. You can also ask investors, lawyers, and advisors. You should get as many data points as possible.\n If you’re a student or post doc, it’s valuable to have the buy-in of the professor running your lab. Professors have sway at universities and will give you leverage over a stubborn tech transfer office. You also want to make sure that they don’t have any competing plans to do their own spin-out with the technology. Often by getting them onboard as an advisor early, they will be helpful in securing a good deal, and they’ll also give you credibility with investors.\n If the agreement feels too onerous, ask yourself if you need it at all. It might be cheaper to recreate something similar on the company’s time.  8\n More dramatically, you might end up not even using what you’re planning to license, because startups pivot all the time. I’ve worked with many companies that fought tooth and nail over their tech transfer agreement, only to find that a year later they’d totally changed their approach and abandoned the IP they fought so hard to license! One way to protect against this is to ensure that any royalties are directly tied to the use of the technology.\n Consider taking an option to license the IP in the future, rather than negotiating a full license agreement now. An option is often much cheaper and simpler to get, and allows you to defer the final negotiation for six to twelve months. That also gives you time to see how much you are using the original IP before committing to licensing it.\n Beware of well-meaning but bad advice from university entrepreneurship offices. Some entrepreneurship offices at universities are great, but unfortunately some are not. Worse, some have their own agendas, like helping local investors. Consider whether the people you’re talking to have a track record of many truly successful companies when listening to their advice.\n Start the conversation with this office as early as possible. This will give you more time to work out an agreement and also let you find out the lay of the land.\n Don’t wait for the agreement to start the company. Getting an agreement can take 6 months or longer. Many investors (including YC) will fund companies before they have an agreement in place. The more progress you make on the company, the more leverage you have in the negotiation.\n  You’ll need to incorporate your company. If you are based in the US (and possibly even if you aren’t), you’ll want to incorporate as a Delaware C Corporation, no matter which state you are physically in.  9\n It may well make sense to continue collaborating with your lab. They may produce new work which you want to license.\n In some cases, you may want to continue doing experimental work using university labs. University core facilities are commonly available to companies, albeit for higher fees. It’s possible to save a lot of money using university resources instead of buying equivalents commercially. That’s fine, as long as it isn’t slowing you down significantly and doesn’t create IP issues. Unfortunately there is often a tradeoff between speed and cost.\n A big adjustment for founders from academia is internalizing a different incentive structure. In academia, you’re rewarded for new discoveries and for publications. In startups, there is zero reward for new discoveries and hardly any for publications. In startups, the only thing that you are rewarded for is making tangible progress towards a commercially valuable product.\n A side effect is that in startups, there is no intrinsic reward for doing something new or difficult. Any time there is a shortcut where you can copy or buy something that already exists, you should take it. In startups, you want the “new part” of what you are doing to be as small as possible, and everything else to be as boring and low risk as possible.\n Another big adjustment is the pace. In startups, you are racing against the clock. If you don’t hit milestones before your current funding runs out, your company will run out of money and die. That kind of hard constraint forces focus like nothing else. As a result, founders who leave academia to do YC often tell us they got more done in the three month YC batch than the prior year.\n If that’s made startups sound stressful, they are, if only because so much is at stake. When you’re starting your own company, the highs are higher and the lows are lower than any regular job. If you want to learn more about what it feels like, there’s a great essay called “ What Startups Are Really Like”.\n There has  never been a better time to start a biotech or hard-tech company. There is  far more funding available now than ever before, and a well developed ecosystem to support founders at every stage. Today most grad students and postdocs choose between staying in academia and getting a job in industry. We think there will increasingly be a third option: to start their own company.\n Thanks I couldn’t have written this without the help of many YC founders who did spin-outs themselves. Special thanks to Uri Lopatin, Birgitt Boschitsch, Aaron Lazarus, Alexis Rovner, Juan Medina, Glenn Markov, John Ramunas, Wesley Wiersen, Lindsay Amos, Ravi Pamnani, and Andrew Jajack for reading drafts of this.\n  1. Separately, it’s also very important for all founders to have a  vesting schedule for their shares. It should vest over at least four years. ↩  2. Being “hands-on” means more than giving advice. It means spending at least 1 day / week doing active work for the company – writing grants, being in the lab, going to sales meetings, etc. Their equity vesting should be tied to them continuing to take a hands-on role. ↩  3. The names vary a little – sometimes it’s called the “office of technology licensing”, or the “innovation office”, but I’ll use this term. ↩  4. Here are some less critical but still common terms and quick advice for them: (5) patent prosecution – you should have control of the patent filing and patent strategy, (6) sublicensing – likely important for you to be able to sublicense, (7) funding requirements – try to avoid, (8) upfront and annual fees – ok if relatively small, (9) rights to future IP coming out of the same lab – may or may not be worth it, (10) pro rata rights so the university can invest to maintain their ownership – acceptable if the university can decide quickly and if it only applies to priced rounds, not convertible securities. ↩  5. Sometimes the terms call for a “percentage of proceeds from any liquidity event” instead. This is worse than equity because it can’t be diluted. So if your university insists on this because they can’t accept equity, it should be a very small percentage, about ⅓ of the equivalent equity percentage. ↩  6.  Another wrinkle is anti-dilution clauses where these equity percentages don’t dilute until you’ve raised $xM. ↩  7. Related to this, some universities require a “marketing period” where they shop the invention around to other potential buyers but usually this is a formality because they rarely get interest. ↩  8. Also, if you have a reasonable path to recreating it, that can give you leverage over a tech transfer office. If they know you are busily working on recreating it, the value of the license deal goes down every day. ↩  9. Two easy options for doing this are http://clerky.com/ and https://stripe.com/atlas. ↩", "posttime": "2020-10-29 17:06:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,scientific", "title": "如何将你的科研从一所大学转到一家初创公司", "title_en": "How to spin your scientific research out of a university and into a startup", "transed": 1, "url": "https://blog.ycombinator.com/how-to-spin-your-scientific-research-out-of-a-university-and-into-a-startup/", "via": "", "real_tags": ["大学"]}, {"category": "", "categoryclass": "", "imagename": "ccd07ec8bd99e29d44598d5dd23fa0ce.jpg", "infoid": 1031958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "位于俄勒冈州克拉马斯福尔斯的天空湖医疗中心的计算机系统在10月27日的一次勒索软件攻击中遭到破坏，该医院Facebook主页上的一篇帖子称。四个细节：1.医院报告说，由于这次攻击，计算机系统瘫痪了，在停机期间，通讯很复杂。2.据先驱报和新闻报道，医院仍在推进预定的程序，尽管需要成像服务的程序可能会推迟。3.据报道，在停工期间，医院仍在为天空湖药店配药。据先驱报和新闻报道，急诊室和紧急护理服务也仍在开放。4.天空湖表示，它不认为患者信息被泄露。更多关于网络安全的文章：医院CISO将召开会议，准备应对网络攻击的长期战争本月发生10起医疗恶意软件、勒索软件和网络钓鱼事件网络攻击正在关闭医院IT网络：8起最近发生的事件。\n©ASC Communications 2020版权所有。有兴趣链接或转载此内容吗？单击此处查看我们的政策。", "note_en": "Klamath Falls, Ore.-based Sky Lakes Medical Center&#39;s computer systems were compromised by a ransomware attack Oct. 27, according to a  post on the hospital&#39;s Facebook page.    Four details:   1. The hospital reported computer systems are down due to the attack and communication is &#34;complicated&#34; during the downtime.   2. The hospital is still moving forward with scheduled procedures, although those requiring imaging services may be delayed, according to a  Herald and News  report.   3. The hospital is still filling prescriptions at Sky Lakes pharmacies during the downtime, according to the report. Emergency room and urgent care services are still open as well, according to a  Herald and News report.   4. Sky Lakes said it does not believe patient information was compromised.    More articles on cybersecurity:  Hospital CISOs to meet, prep for &#39;long war&#39; against cyberattacks  10 healthcare malware, ransomware and phishing incidents this month  Cyberattacks are shutting down hospital IT networks: 8 recent incidents\n       © Copyright ASC COMMUNICATIONS 2020. Interested in LINKING to or REPRINTING this content? View our policies by  clicking here.", "posttime": "2020-10-29 17:05:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,俄勒冈州,hospital,医院", "title": "俄勒冈州医院在勒索软件攻击后关闭计算机系统", "title_en": "Oregon hospital shuts down computer system after ransomware attack", "transed": 1, "url": "https://www.beckershospitalreview.com/cybersecurity/oregon-hospital-shuts-down-computer-system-after-ransomware-attack-4-notes.html", "via": "", "real_tags": ["软件", "俄勒冈州", "hospital", "医院"]}, {"category": "", "categoryclass": "", "imagename": "5487d5d3544f28cc9501653942de9e82.jpg", "infoid": 1031957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有人声称已经越狱了Quest 2，绕过了登录Facebook账户才能使用该设备的要求。\n独立XR研究公司XRSI表示，他们已经核实了越狱说法的合法性。\n为设备寻根并绕过Facebook登录可能违反Facebook服务条款。\n自从Facebook最初宣布Oculus耳机将需要Facebook账户以来，人们一直在向社区询问使用Oculus Quest 2的替代方式。继一周前有人在Reddit上提出要求后，非营利性组织独立研究公司XRSI表示，他们已经证实了Oculus Quest 2的根用户访问权限的可行性。\n虽然在Android智能手机领域，root访问通常被认为是一种刷新ROM或修改操作系统的方式，但在Quest 2上，root访问意味着人们可以绕过登录Facebook账户的要求，然后才能使用Oculus Quest 2。目前，这种根访问方法对公众是不可用的，也没有公开展示过，除了一些截图显示Quest 2在没有登录Facebook账户的情况下也可以工作。让Quest 2扎根几乎肯定违反了Facebook的服务条款。我们已经就此事联系了Facebook，并将以他们的回应更新这篇文章。\n除了简单地想在没有先登录Facebook的情况下使用Oculus Quest 2之外，一些用户因为他们的Facebook账户被禁止而根本无法使用Oculus Quest 2。这些禁令源于几个问题，包括对Facebook社区标准的合法违反，以及Facebook试图识别虚假账户的算法的错误禁令。\nXRSI还指出了在气候变化和过量电子垃圾的时代，设备总所有权或维修权的重要性。逻辑规定，您完全拥有您购买的任何设备，包括修改它或以其他方式随心所欲地使用它的权利。虽然这不适用于Facebook的任何服务，但它将意味着用户可以继续通过Sidequest等第三方应用商店使用Quest 2，而不必担心他们的设备被砖封或以其他方式无法使用。\n在Oculus Quest 2上玩游戏不需要PC或游戏机，这使它成为在VR中玩的最简单的方式。", "note_en": "Someone claims to have jailbroken the Quest 2, bypassing the requirement to log in to a Facebook account to use the device.\n Independent XR research firm XRSI says they have verified the legitimacy of the jailbreak claim.\n Rooting the device and bypassing the Facebook login could be in violation of Facebook Terms of Service.\n Ever since Facebook originally announced that a Facebook account  will be required on Oculus headsets, folks have been asking the community for an alternative way to use their Oculus Quest 2. Following-up on a claim from   someone on Reddit one week ago, independent research firm XRSI, a not-for-profit organization, says   it has confirmed the viability of root access on the  Oculus Quest 2.\n While root access is generally thought of as a way to flash ROMs or modify the operating system in the Android smartphone world, root access on a Quest 2 means folks would be able to bypass the requirement to log into a Facebook account before being able to use their Oculus Quest 2. Right now, this root method is not available to the public and has not been publicly shown off beyond a handful of screenshots that appear to show the Quest 2 working without a logged-in Facebook account. Rooting a Quest 2 is almost certainly a violation of Facebook Terms of Service. We&#39;ve contacted Facebook about this matter and will update this article with their response.\n  Aside from simply wanting to use an Oculus Quest 2 without logging into Facebook first, some users have been unable to use their Oculus Quest 2   at all due to their Facebook account being banned. These bans have stemmed from several issues, including legitimate violations of Facebook&#39;s community standards, as well as erroneous bans from Facebook&#39;s algorithms that attempt to identify fake accounts.\n XRSI also states the importance of total device ownership, or the Right to Repair, in the era of climate change and excessive e-waste. The logic dictates that you fully own any device that you purchase, including the right to modify it or otherwise use it as you would like. While this wouldn&#39;t apply to any Facebook services, it would mean that users could continue to use their Quest 2 via third-party app stores  like Sidequest without fear of having their device bricked or otherwise rendered unusable.\n You won&#39;t need a PC or a console to play on the Oculus Quest 2, which makes this the easiest way to play in VR.", "posttime": "2020-10-29 16:39:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,绕过,allegedly", "title": "据称Quest 2已经越狱，绕过了Facebook的登录要求", "title_en": "Quest 2 has allegedly been jailbroken, bypassing Facebook login requirement", "transed": 1, "url": "https://www.androidcentral.com/quest-2-has-allegedly-been-jailbroken-bypassing-facebook-login-requirement", "via": "", "real_tags": ["facebook", "绕过", "allegedly"]}, {"category": "", "categoryclass": "", "imagename": "45143d34db0c8a35875b32dc1f5f8b4b.jpg", "infoid": 1031956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Brave网络浏览器很快就会屏蔽CNAME伪装，这是在线营销人员用来对抗旨在阻止使用第三方cookie的隐私控制的一种技术。\n浏览器安全模型对第一方域(被访问的域)和第三方域(从图像资产或跟踪代码等的供应商到访问的站点)进行了区分。多年来，许多侵犯在线隐私的行为都来自脚本和Cookie等第三方资源，这就是为什么现在Brave、Firefox、Safari和Tor浏览器默认阻止第三方Cookie的原因。\n勇敢者，谷歌，微软，Mozilla齐聚一堂，讨论网络隐私……。以及为什么我们都不应该吃太多。\n多读。\n与此同时，Microsoft Edge有一个分层方案，默认设置为平衡设置，可以阻止一些第三方cookie。谷歌Chrome可能已经实施了其SameSite cookie计划，作为其计划于2022年逐步淘汰第三方cookie的前奏。\n虽然谷歌试图赢得对其各种隐私沙盒(Privacy Sandbox)提案的支持，这些提案旨在为营销人员提供表面上保护隐私的替代方案，以取代越来越受到回避的第三方cookie，但营销人员一直依赖CNAME的恶作剧来将他们的第三方追踪器冒充为第一方资源。\n开源内容阻止扩展uBlock Origin背后的开发者在11月份实现了对基于CNAME的跟踪的防御，现在Brave也这样做了。\n在周二的一篇博客文章中，Brave Software的研究工程师安东·拉扎列夫(Anton Lazarev)和高级隐私研究员彼得·斯奈德(Peter Snyder)解释说，在线跟踪脚本可能会使用规范的名称DNS记录，即CNAME，使相关的第三方跟踪域看起来像是实际访问的第一方网站的一部分。\n他们以https://mathon.fr网站为例，指出如果不揭开cname的外衣，brave就会阻止谷歌、facebook、criteo、sirdan和trustilot等广告公司提供的6个跟踪脚本的请求。\n勇敢的索兹对将搜索查询发送到附属链接的编码混乱进行了编码，坚称这种做法是行业标准的；\n多读。\n但是该页面也通过驻留在第一方子域16ao.mathon.fr下的随机路径处的脚本发出四个请求。\n在浏览器外部检查发现，16ao.mathon.fr实际上有一个规范名称et5.eulerian.net，这意味着它是由Eulerian提供服务的第三方脚本，观察Lazarev和Snyder。\n当Brave1.17在下个月发布时(目前是开发者版本)，它将能够揭开CNAME欺骗的外衣，并阻止欧拉脚本。\n其他浏览器供应商正在计划相关的防御措施。自去年11月以来，Mozilla一直致力于Firefox的修复。8月份，苹果公司的Safari WebKit团队提出了一种方法，可以防止CNAME伪装被用来绕过WebKit智能跟踪保护系统规定的7天Cookie有效期。®。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "The Brave web browser will soon block CNAME cloaking, a technique used by online marketers to defy privacy controls designed to prevent the use of third-party cookies.\n  The browser security model makes a distinction between first-party domains – those being visited – and third-party domains – from the suppliers of things like image assets or tracking code, to the visited site. Many of the online privacy abuses over the years have come from third-party resources like scripts and cookies, which is why third-party cookies are now blocked by default in Brave, Firefox, Safari, and Tor Browser.\n  Brave, Google, Microsoft, Mozilla gather together to talk web privacy... and why we all shouldn&#39;t get too much of it\n  READ MORE\n  Microsoft Edge, meanwhile, has a tiered scheme that defaults to a &#34;Balanced&#34; setting, which blocks some third-party cookies. Google Chrome has implemented its SameSite cookie scheme as a prelude to its planned 2022 phase-out of third-party cookies,  maybe.\n  While Google tries to win support for its various  Privacy Sandbox proposals, which aim to provide marketers with ostensibly privacy-preserving alternatives to increasingly shunned third-party cookies, marketers have been relying on CNAME shenanigans to pass their third-party trackers off as first-party resources.\n  The developers behind open-source content blocking extension uBlock Origin  implemented a defense against CNAME-based tracking in November and now Brave has done so as well.\n    In a  blog post on Tuesday, Anton Lazarev, research engineer at Brave Software, and senior privacy researcher Peter Snyder, explain that online tracking scripts may use canonical name DNS records, known as CNAMEs, to make associated third-party tracking domains look like they&#39;re part of the first-party websites actually being visited.\n  They point to the site  https://mathon.fr as an example, noting that without CNAME uncloaking, Brave blocks six requests for tracking scripts served by ad companies like Google, Facebook, Criteo, Sirdan, and Trustpilot.\n  Brave soz about coding snafu that sent search queries to affiliate links, insists practice is &#39;industry-standard&#39;\n  READ MORE\n  But the page also makes four requests via a script hosted at a randomized path under the first-party subdomain  16ao.mathon.fr.\n  &#34;Inspection outside of the browser reveals that  16ao.mathon.fr actually has a canonical name of  et5.eulerian.net, meaning it’s a third-party script served by Eulerian,&#34; observe Lazarev and Snyder.\n  When Brave 1.17 ships next month (currently available as  a developer build), it will be able to uncloak the CNAME deception and block the Eulerian script.\n  Other browser vendors are planning related defenses. Mozilla has been  working on a fix in Firefox since last November. And in August, Apple&#39;s Safari WebKit team  proposed a way to prevent CNAME cloaking from being used to bypass the seven-day cookie lifetime imposed by WebKit&#39;s Intelligent Tracking Protection system. ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-10-29 16:13:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,程序,cname,nix", "title": "勇敢地第一个取消CNAME伪装，这是一种用来逃避广告拦截程序的偷偷摸摸的DNS伎俩", "title_en": "Brave first to nix CNAME cloaking, a sneaky DNS trick used to evade adblockers", "transed": 1, "url": "https://www.theregister.com/2020/10/28/brave_cname_block/", "via": "", "real_tags": ["广告", "程序", "cname", "nix"]}, {"category": "", "categoryclass": "", "imagename": "b13a8f892ca13a6325a991859dd9a7df.jpeg", "infoid": 1031955, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1982年夏天，我花了大约三个月的时间创建了一个包含4096个数字的列表，一丝不苟地确保每个数字都是正确的值，并且在列表中的正确位置。当我完成工作时，我工作的唯一有形证据就是那份长长的数字清单。\n当清单完成后，经过近1000个小时的工作，前康涅狄格州皮革公司？将数字(按顺序)放入计算机内存芯片和塑料盒中，并在全国各地的商店出售。人们真的买了它。\n我创建的数字列表被公众称为热门投币式视频游戏金刚的雅达利2600版本。为了创建这个列表，我花了大约3个月的时间用6502汇编语言编写了一个计算机程序，几乎没有睡觉。为了赶在假日销售前及时提交最终代码，我承受着巨大的压力，我在办公桌前连续72小时完成了游戏，之后我被告知我看起来像个僵尸。\n就背景而言，任天堂的“金驴子”(街机游戏)是电子游戏设计上的一次突破，也是20世纪80年代初最成功的投币游戏之一。需要澄清的是，“金驴子”不是我发明的。这款游戏是由传奇人物宫本茂(Shigeru Miyamoto)设计的，他可能已经成为历史上最成功的视频游戏设计师。这是第一款以马里奥为主角的视频游戏，马里奥后来在超级马里奥兄弟系列游戏中成名致富(尽管在金刚驴子中他只被称为Jumpman)。金刚是最早使用卡通质量的动画和讲故事将玩家吸引到行动中的视频游戏之一。我的角色仅限于创作宫本杰作的雅达利2600版。\n金刚驴子的故事发生在一个建筑工地上。遇险的少女，马里奥的女朋友？波琳被一只顽固的²猿绑架了。作为无畏的英雄马里奥，你的任务是把公主从无礼的灵长类动物手中拯救出来。街机游戏如下所示。\n在游戏的第一阶段，目标是跑上在建建筑的大梁，到达波琳(注：屏幕顶部说有遇难的少女，大喊“救命！”)。玩家用操纵杆和按钮控制马里奥。操纵杆可以上下左右移动马里奥，而按钮可以让他跳跃。为了阻止马里奥到达波林，猿猴沿着倾斜的大梁源源不断地发射桶，以阻止他爬上大楼。\n如果马里奥成功地避开了桶，到达了大楼的顶端，他就会清扫波林，从屏幕顶部爬到第二阶段。这款街机游戏总共有四个阶段(关卡)，在建筑工地的不同区域都有类似的越轨和游戏挑战。\n1982年，金枪鱼是拱廊里最大的东西之一，以创纪录的速度吞噬了25美分。即使你不玩电子游戏，你也很可能听说过金刚。\n与此同时，家庭视频游戏市场正处于井喷式增长之中。在20世纪70年代初，你的标准家庭视频游戏设备连接到电视上，可以玩一种或多种类似乒乓球和划桨的游戏。\n每种游戏的选择都差不多，但它们都有巧妙的名字，比如网球、乒乓球和曲棍球，让你觉得自己玩的不是乒乓球。当你厌倦了球类和划桨类游戏时，系统就会被扔进壁橱(或垃圾)。\n1977年，雅达利视频计算机系统(VCS，或2600)推出。2600在头几年打入了家庭视频游戏市场，尽管价格比之前的产品高得多，这在一定程度上要归功于它的可拆卸游戏盒。能够购买更多的盒式游戏极大地延长了机器的寿命，让家人在厌倦了玩到死的游戏时可以尝试一些新的东西。\n然而，推动雅达利2600进入平流层的事件是1980年太空入侵者子弹的释放。由日本游戏公司Taito的西加多智弘(Tomohiro Nishikado)设计的大型街机游戏“太空入侵者”(Space Invaders)，是街机大片进入家庭视频游戏市场的第一个重要许可证。当它到达雅达利时，不仅墨盒卖得疯狂，而且雅达利2600机器的销量在一夜之间翻了两番，因为一群发烧友需要游戏机来玩墨盒。\n该行业已经学到了宝贵的一课。授权一款热门街机游戏并将其带到家用游戏机上，有可能是纯粹的黄金。\n现在回到我的故事部分。20世纪70年代中期，作为新泽西州的一名大学生，我非常幸运地在一家四人电子公司找到了一份兼职工作，从事设计和工程小工具的业务，如计算器、数字钟，最后是电子玩具。作为地位低下的人，我最初的职责包括为工程师准备午餐。\n随着时间的推移，在一家人才才华横溢，但资源有限，而且有过度承诺习惯的公司里，我被快速地带入了工作中学习的道路，主要是一次又一次地被扔进火里。虽然这并不容易，但它是令人难以置信的回报，并有助于定义我未来的职业道路。\n到了1979/1980年，尽管我还没有完成大学学位，但我已经是一名成熟的自学成才的工程师了。到那时，我作为第四名员工加入的公司规模已经扩大，主要精力集中在手持电子玩具上(另一篇报道)。我喜欢从事电子玩具的工作，但我也被雅达利视频游戏系统的市场成功所吸引。在管理层的支持下，我买了一台雅达利(Atari)机器，把它拆开，弄清楚它是如何工作的，这个过程被称为逆向工程。不久之后，我设计并编写了我的第一款Atari 2600游戏(实际上，我的第一款视频游戏)，太空骑师，这款游戏于1982年发布。\n在那之后，我决定离开第一份工程工作。我的事业蒸蒸日上，是时候为我寻找更有价值的工作了。\n1982年5月，我现在是独立的个体经营者，我得到了一份合同，开发一款与雅达利2600兼容的驴子金刚(Donkey Kong)版本。Coleco(前述康涅狄格州皮革公司)在雅达利上看到家庭版《太空入侵者》取得商业成功后，前往任天堂，获得了当时世界上最大的街机游戏的独家版权。虽然与驴子的交易主要集中在Coleco即将推出的Colecovision游戏机上，Coleco是Atari 2600的竞争对手系统，但如果Coleco不为Atari系统营销一个版本，那将是疯狂的，因为Atari系统在国内市场拥有最大的玩家受众。\n对我来说幸运的是，几乎没有独立工程师拥有编写雅达利游戏所必需的知识。有雅达利的员工(他们非常忙，没有时间)，有Activision的游戏设计师(雅达利的一个分支，也是完全忙碌的，也没有时间)，其他人也不多。至于我，我最近失业了，而且愿意而且有能力，所以我接受了这个项目。\n正如我在下面解释的那样，这不是一件容易的事情。我非常熟悉街机游戏及其开创性的图形、动画和游戏玩法。手头的任务是创造一款价值3000美元的硬币游戏的商业可行版本，这款游戏将在30美元的雅达利墨盒上运行。\n-我大约有3个月的时间来写。我本可以用一年的时间。\n-我有4096字节的内存，用来存储所有的代码、图形和音效。另外，我有128字节的RAM内存来跟踪所有事情(注意：不是千字节，字节)。游戏将被编程为在1 MHz的8位微处理器上运行。这些数字几乎肯定会让知识渊博的程序员屈服。\n-除了上述限制外，我正在编程的游戏机Atari 2600从技术角度来看受到严重(我是说严重的)限制(这是一个完全独立的讨论)，特别是与一台3,000美元的游戏机相比。雅达利2600系统最初设计用来玩两种游戏--乒乓球和格斗。因此，2600的图形能力仅限于显示两(2)个精灵(动画、移动角色)，外加一(1)个球和两(2)枚导弹。球和导弹是简单的方形/矩形抛射物，而两个精灵有8位宽，能够显示基本的动画帧。\n乒乓球有左拍、右拍和一个球。战斗有玩家1的坦克，玩家2的坦克，以及两枚导弹，每人一枚。雅达利在设计雅达利2600时的假设是，所有未来的游戏都将有两个移动的精灵和最多三个抛射物。这与金刚游戏机形成鲜明对比，后者能够显示“128个前景精灵，每个精灵像素为16x16”。\n除了对屏幕上对象数量的限制外，由于内存限制，Atari 2600仅限于在1/2的屏幕上显示独特的背景图形。换句话说，屏幕的右侧只能显示屏幕左侧的副本或反射。由于驴刚标志性的倾斜坡道本质上是不对称的(从左到右比较时不是复制或反射)，我不得不想出一种方法来“绕过”硬件来实现倾斜坡道。\n为了写这个游戏，我用一种叫做6502汇编语言的语言编写了一个计算机程序。编写的程序是由一个叫做汇编器的基于计算机的工具处理的，它在我的Apple II个人电脑上运行。汇编器的输出是一个包含4096个数字的列表，每个数字的值都在0到255之间(由于二进制数系统的奥秘，我将在以后的帖子中对此进行解释)。\n除了编写程序外，我还必须创建将显示在电视机屏幕上的计算机图形。当时，没有工具来创建这样的图形，所以我在一张图表纸上用正方形着色来创建背景，每个人物，如马里奥，以及其他物品，如锤子，以及显示分数的单个数字。左边的图像显示Mario处于站立位置，每行由8个像素(即像素=图片元素)和18行图形组成。右边的图像是马里奥头部的更近距离的视图，显示了每个像素是如何在8个单元格宽的图形纸上用颜色填充的。由于Atari系统被限制为每行(每个字符)一种颜色，请注意，Mario是由18个单色线组成的。\n一旦在图表纸上绘制了图形，我就必须将它们转换成数字(是的，我们回到4096个数字的列表中)，马里奥图形的每一行都占据了一个数字来表示点的图案，另一个数字来表示颜色。因此，如上所示，Mario的站立图像占据了我可用的4096字节数据中的大约36(18x2)字节。\n虽然我在Apple II上完成了大部分工作，但在某个时候，我不得不将4096个字节放入Atari机器中，以查看我正在编写的程序是否完成了我设计的功能(这些程序很少能做到)。在编写游戏程序时，您需要花一个小时左右的时间编写代码，汇编您编写的代码，然后试用该程序，看看它是否正常工作。要做到这一点，一种方法是将数字列表，称为二进制，并将其放入墨盒中的计算机芯片中，插入雅达利。不幸的是，这种方法需要很多时间，而且不是你想要一天做20次的事情。\n因此，我设计了一个定制的电子板，将雅达利系统直接连接到Apple II计算机上。一旦程序组装完成，电路板就允许雅达利立即运行程序(就像将盒式磁带插入游戏机一样)。我的定制雅达利接口板如下所示。\n当我让游戏处于相当好的状态时(从游戏的角度来看)，我比分配的4096个字节多了大约1200个字节。在这一点上，我别无选择，只能开始代码优化过程，或者正如我们过去所说的那样，削减字节。要减少字节，我必须逐个例程查看程序，并弄清楚如何用更少的代码完成相同的任务(而不破坏功能)。这听起来很可怕，但实际上是我最喜欢做的事情之一。\n下图显示的是雅达利2600版“驴子刚”的第一个舞台画面。提到这张图片，我不得不创建图形并编写计算机代码来生成非对称倾斜坡道(紫色)、4个滚动桶(这里只显示了一个)、Mario、Donkey Kong、Pauline、锤子、一个“Lives”显示(右上角的块)和6位(总共)分数。我上面列出的所有物品都不符合雅达利机器“两(2)个精灵加一(1)个球和两(2)枚导弹”的限制。复杂的、时间错综复杂的汇编语言代码被用来欺骗硬件来显示可用的有限对象的许多唯一副本(当然可以在另一次讨论)。\n虽然我觉得我在一项几乎不可能完成的任务上尽了最大努力，但港口并不完美。由于内存的限制，我只能包括四个街机游戏阶段中的两个(如上所述，在最初的投币机中有四个不同的游戏屏幕)。多年来，我对这一决定感到非常悲痛，但从技术上讲，我不可能在盒式磁带上添加任何其他东西，除非出版商Coleco同意使用更大的盒式存储器，这将给我8192字节的工作空间。考虑到制造成本的增加，他们下降了。有了这样的现实，我专注于制作这款游戏最具可玩性和图形愉悦的版本，这是在考虑到众多限制的情况下可以完成的。\n驴刚2600游戏盒式磁带对Coleco来说是一个巨大的商业成功。几年前，我读到一份分析师报告，报告称，虽然雅达利2600版的驴子是Coleco当年推出的550款产品之一，但它占其总收入的25%。保守估计，仅1982年这款游戏的零售收入就为1亿美元，相当于2020年约2.69亿美元，即4096个数字中每个数字约65,670美元。\n我很感谢我在正确的时间出现在正确的地点，为这样一个标志性的游戏工作。这当然是一次令人筋疲力尽的努力，但我不会用这段经历换取任何东西。\n他说：康涅狄格州皮革公司？在凭借卷心菜贴娃娃和视频游戏成名致富之前，Coleco被称为康涅狄格州皮革公司。\n他说：你会问为什么是建筑工地？问得好。答案很简单，那就是它对游戏性有效。出于这个原因，你在视频游戏中看到了许多奇怪的东西，标准的游戏设计师反驳道：“这是一款视频游戏，我不需要理由。”有没有问过自己，在“愤怒的小鸟”中，你为什么要用弹弓把鸟扔向由猪建造的建筑？答案是一样的。\n他说：顽固的猿游戏的设计者宫本茂(Shigeru Miyamoto)最初把猿称为顽固的猿。当从日语翻译成英语时，“顽固”这个词被翻译成“驴子”，原因显而易见。因此才有了独特的名字“驴子金刚”。", "note_en": "In the summer of 1982, I spent about three months creating a list of 4,096 numbers, meticulously ensuring that every single number was the right value, and in the correct place in the list. When I finished, the only tangible evidence of my work was that long list of numbers.\n When the list was complete, after nearly 1,000 hours of work, the former Connecticut Leather Company¹ put the numbers (in order) into a computer memory chip and plastic case and sold it at stores throughout the country. And people actually bought it.\n The l ist of numbers that I created was known to the public as the Atari 2600 version of the hit coin-op video game   Donkey Kong. To create the list, I wrote a computer program in 6502 assembly language in about 3 months, with little sleep. With enormous pressure to submit final code in time for holiday sales, I finished the game with a push of 72 straight hours at my desk, after which I was told that I looked like a zombie.\n  For background, Nintendo’s   Donkey Kong (the arcade game) was a breakthrough in video game design, and one of the most successful coin-operated games of the early 1980&#39;s. To be clear, I did not invent Donkey Kong. The game was designed by the legendary   Shigeru Miyamoto, who has gone on to be possibly the most successful video game designer in history. It was the first video game to feature Mario, who went on to fame and fortune in the Super Mario Bros series of games (though in Donkey Kong he was referred to only as Jumpman). Donkey Kong was one of the first video games to use cartoon-quality animation and storytelling to draw the player into the action. My role was limited to creating an Atari 2600 version of Miyamoto’s masterpiece.\n Donkey Kong takes place in a construction site.¹ Pauline, the damsel in distress, and Mario’s girlfriend, has been abducted by a stubborn² ape. As Mario, the intrepid hero, your job is to save the princess from the impertinent primate. The arcade game is shown below.\n  In the first stage of the game, the object is to run and climb up the girders of the under-construction building to reach Pauline (note said damsel-in-distress at the top of the screen, yelling “help!”). The player controls Mario with a joystick and button. The joystick moves Mario up, down, left and right, while the button allows him to jump. To stop Mario from reaching Pauline, the ape launches a steady stream of barrels down the slanted girders to impede his progress up the building.\n If Mario successfully avoids the barrels and reaches the top of the building, he sweeps up Pauline, and climbs off the top of the screen to Stage 2. The arcade game has four Stages (levels) in all, featuring similar escapades and gameplay challenges in different areas of the construction site.\n In 1982, Donkey Kong was one of the biggest things in the arcade, sucking down quarters at a record pace. Even if you didn’t play video games, you likely had heard about Donkey Kong.\n  At the same time, the home video game market was in the midst of a growth spurt. In the early 1970’s, your standard home video game gadget connected to the TV and played one or more PONG-like ball and paddle games.\n  Every game selection was pretty much the same, but they had clever names like tennis, ping pong, and hockey, to make you think you were playing something besides PONG. When you got bored with ball and paddle games, the system went in the closet (or the garbage).\n In 1977, the Atari Video Computer System (the VCS, or 2600), was launched. The 2600 made inroads into the home video game market for its first couple of years despite a much higher price than its predecessors, thanks in part to its removable game cartridges. Being able to buy additional games in cartridge form greatly extended the life of the machine, allowing the family to try something new when they got bored of the games they had played to death.\n  However, the event that propelled the Atari 2600 into the stratosphere was the release of the   Space Invaders cartridge in 1980. Space Invaders, a huge arcade hit designed by   Tomohiro Nishikado of the Japanese game company   Taito, was the first significant license of an arcade megahit to the home video game market. When it arrived on the Atari, not only did the cartridge sell like crazy, but the Atari 2600 machine quadrupled in sales overnight as the crowd of enthusiasts needed the game console to play the cartridge.\n The industry had learned a valuable lesson. Licensing a hit arcade game and bringing it to a home console had the potential to be pure gold.\n  Now back to my part of the story. In the mid 1970’s, as a college student in New Jersey, I was very fortunate to get a part-time job at a four-person electronics company, in the business of designing and engineering gadgets such as calculators, digital clocks, and eventually electronic toys. As low man on the totem pole, my initial responsibilities included getting lunch for the engineers.\n Over time, in a company with brilliant people, but limited resources and a habit of over-promising, I was fast-tracked into learning on the job, mainly by being thrown into the fire time and time again. While it wasn’t easy, it was incredibly rewarding, and was instrumental in defining the future path of my career.\n By 1979/1980, even though I had still not completed my college degree, I was a full-fledged, self-taught engineer. By that time, the company I had joined as the fourth employee had grown in size, and focused most of its efforts on handheld electronic toys (a story for another post). I loved working on electronic toys, but I was also fascinated by the market successes of the Atari video game system. With support from management, I bought an Atari machine, ripped it open, and figured out how it worked, a process called reverse-engineering. Soon after, I designed and programmed my first Atari 2600 game (in fact, my first video game),   Space Jockey, which released in 1982.\n  After that, I decided to move on from that first job in engineering. My career was flourishing, and it was time to find something more rewarding for me.\n  In May of 1982, now independent and self-employed, I was offered a contract to develop an Atari 2600-compatible version of Donkey Kong. Coleco (the aforementioned Connecticut Leather Company), after seeing the commercial success of the home version of Space Invaders on the Atari, went to Nintendo and acquired exclusive home rights to the biggest arcade game in the world at the time. While the Donkey Kong deal was primarily focused on Coleco’s soon-to-be launched Colecovision game console, a competitor system to the Atari 2600, it would have been crazy for Coleco not to market a version for the Atari system, with the largest audience of players in the home market.\n Fortunately for me, there were very few independent engineers who had the knowhow necessary to write an Atari game. There were the Atari employees (who were plenty busy, and not available), the game designers at Activision (an Atari spinoff, also fully occupied and not available), and not too many others. As for me, I was recently unemployed, and willing and able, so I took the project.\n It would not an easy undertaking, as I explain below. I was very familiar with the arcade game and its groundbreaking graphics, animation and gameplay. The task at hand was to create a commercially-viable version of a $3,000 coin-op game which would run on a $30 Atari cartridge.\n  - I had about 3 months to write it. I could have used a year.\n - I had  4,096  bytes of memory in which to store all of the code, graphics and sound effects. In addition, I had  128  bytes of RAM memory to keep track of everything (NOTE: not kilobytes, bytes). The game would be programmed to run on a 1 MHZ, 8-bit microprocessor. Those numbers are almost guaranteed to bring knowledgeable programmers to their knees.\n - In addition to the above constraints, the game console I was programming on, the Atari 2600, was severely (I mean SEVERELY) limited from a technical standpoint (which is an entirely separate discussion), especially when compared to a $3,000 arcade machine. The Atari 2600 system was originally designed to play 2 games — PONG and COMBAT. Consequently, the graphic capabilities of the 2600 were limited to displaying two (2) sprites (animating, moving characters), plus one (1) ball and two (2) missiles. The ball and missiles were simple square/rectangle projectile objects while the two sprites were 8-bits wide, with the ability to display rudimentary animation frames.\n PONG had a left paddle, right paddle, and a ball. COMBAT had Player 1’s tank, Player 2’s tank, and two missiles, one for each player. Atari’s assumption in designing the Atari 2600 was that all future games would have two moving sprites and up to three projectile objects. This was in contrast to the Donkey Kong arcade machine, which was capable of displaying “128 foreground sprites at 16x16 pixels each.”\n In addition to the limitation on the number of objects on the screen, due to memory constraints, the Atari 2600 was limited to displaying unique background graphics for only 1/2 of the screen. In other words, the right side of the screen could only display a copy or a reflection of the left side of the screen. Since the iconic slanted ramps of Donkey Kong are non-symmetrical in nature (not a copy or reflection when comparing left to right), I had to come up with a way to “work around” the hardware to achieve the slanted ramps.\n To write the game, I composed a computer program in a language called 6502 assembly language. The written program was processed by a computer-based tool called an   assembler, which ran on my   Apple II personal computer. The output of the assembler was a list of 4,096 numbers, with each number having a value of between 0 and 255 (owing to the mystery of the binary number system, which I may explain at some point in a future post).\n In addition to writing the program, I also had to create the computer graphics which would be displayed on the screen of the television. At the time, there were no tools to create such graphics, so I colored in squares on a piece of graph paper to create the background, each of the characters, such as Mario, and other items, such as the hammer, and the individual digits which displayed the score. The image on the left shows Mario in his standing position, comprised of 8 pixels (i.e. pixel=picture element) on each line, and 18 lines of graphics. The image on the right is a closer view of Mario’s head, showing how each pixel is filled in in color on graphic paper of 8 cells wide. As the Atari system was limited to one color per line (per character), notice that Mario is made up of 18 single color lines.\n  Once the graphics were drawn on graph paper, I had to convert them into numbers (yes, we’re back to that list of 4,096 numbers), with each line of Mario’s graphic taking up one number for the pattern of dots, and a second number for the color. So Mario’s standing image, as shown above, took up about 36 (18 x 2) of my available 4,096 bytes of data.\n While I did most of my work on the Apple II, at some point, I had to get the 4,096 bytes into the Atari machine to see if the program I was writing did what I had designed it to do (which programs rarely do). When writing a game program, you will write code for an hour or so, assemble what you’ve written, and then try the program out to see if it works. One way to do that would be to take the list of numbers, referred to as the   binary, and put it into a computer chip in a cartridge, to plug into the Atari. That method, unfortunately, takes a lot of time, and is not something you’d want to do 20 times a day.\n Consequently, I designed a custom electronic board that connected the Atari system directly to the Apple II computer. Once the assembly of the program was complete, the board allowed the Atari to instantly run the program (as if a cartridge was plugged into the game console). My custom Atari interface board is shown below.\n  When I had the game in pretty good shape (from a play standpoint), I was about 1,200 bytes over my allotment of 4,096. At that point, I had no choice but to begin the process of   code optimization, or as we used to call it, cutting bytes. To cut bytes, I had to look at the program, routine by routine, and figure out how to accomplish the same task in less code (without breaking the functionality). It sounds gruesome, but it was actually one of my favorite things to do.\n  The image below shows the first Stage screen of the Atari 2600 version of Donkey Kong. Referring to the image, I had to create graphics and write computer code to generate the non-symmetrical slanted ramps (in purple), 4 rolling barrels (only one shown here), Mario, Donkey Kong, Pauline, the hammer, a “lives” display (the block in the upper right corner), and six (in total) digits of score. All of the objects I have listed above count against the Atari machine’s limit of “two (2) sprites plus one (1) ball and two (2) missiles.” Complex, intricately-timed assembly language code was used to trick the hardware into displaying many unique copies of the limited objects available (certainly a discussion for another time).\n  While I feel that I did the best job possible on an almost impossible task, the port was not perfect. Due to memory constraints, I could only include two of the four arcade game Stages (as mentioned above, there were four distinct gameplay screens in the original coin-op machine). I’ve gotten a lot of grief over the years about that decision but it was technically impossible to add anything else to the cartridge, unless the publisher, Coleco, agreed to go to a larger cartridge memory, which would have given me 8,192 bytes to work with. Given the added cost of manufacturing, they declined. With that reality, I focused on making the most playable and graphically-pleasing version of the game that could be done given the numerous constraints.\n The Donkey Kong 2600 game cartridge was a huge commercial success for Coleco. I read an analyst report years ago that stated that, while the Atari 2600 version of Donkey Kong was one of 550 products that Coleco put out that year, it represented 25% of their total revenue. A conservative estimate of the retail revenue of the game in 1982 alone was $100 million dollars, equivalent to about $269 million dollars in 2020, or about $65,670 per each number in that list of 4,096 numbers.\n I’m thankful that I was in the right place at the right time to work on such an iconic game. It was certainly a back-breaking effort, but I wouldn’t have traded the experience for anything.\n   1:   The Connecticut Leather Company? Before going on to fame and fortune with Cabbage Patch Dolls, and video games,   Coleco was known as the Connecticut Leather Company.\n 1:   Why a construction site, you ask? Great question. The answer is simply that it worked for gameplay. You see many strange things in video games for that reason, with the standard game designer retort of “it’s a video game, I don’t need a reason.” Ever ask yourself why in   Angry Birds you are using a slingshot to fling birds at structures built by pigs? Same answer.\n 2:   Stubborn Ape The game’s designer, Shigeru Miyamoto, initially referred to the ape as the stubborn ape. When translated from Japanese to English, the word stubborn was translated as “donkey,” for obvious reasons. Thus the unique name “Donkey Kong.”", "posttime": "2020-10-29 15:47:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "夏天,donkey,游戏", "title": "我是如何度过1982年的夏天的：为雅达利2600制作驴孔", "title_en": "How I spent my summer of 1982: the Making of Donkey Kong for the Atari 2600", "transed": 1, "url": "https://garrykitchen.medium.com/how-i-spent-my-summer-of-1982-59638293f358", "via": "", "real_tags": ["夏天", "donkey", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "219c6fb8ea48cf5b1a989862e02e6840.jpg", "infoid": 1031954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国宇航局的哈勃太空望远镜在太阳系火星和木星之间的主要小行星带发现了一颗罕见的、重的、极有价值的小行星，名为“16普赛克”。\n小行星普塞克位于距离地球约2.3亿英里(3.7亿公里)处，直径140英里(226公里)，大约相当于西弗吉尼亚州的大小。根据周一发表在行星科学杂志上的一项研究，它的特别之处在于，与大多数岩石或冰冷的小行星不同，普赛克几乎完全由金属组成，就像地球的核心一样。\n该研究的作者之一、德克萨斯州圣安东尼奥西南研究所(Southwest Research Institute)的行星科学家特蕾西·贝克尔(Tracy Becker)说，“我们已经看到了以金属为主的陨石，但普塞克可能是独一无二的，因为它可能是一颗完全由铁和镍组成的小行星。”他是该研究的作者之一，也是德克萨斯州圣安东尼奥西南研究所(Southwest Research Institute)的行星科学家。\n考虑到这颗小行星的大小，它的金属含量可能价值10000万亿美元(10000亿美元)，或者说大约是2019年全球经济的1万倍。\n利用哈勃太空望远镜上的太空望远镜成像光谱仪在2017年的两次观测中收集的紫外光谱数据，研究人员推断，普赛克的表面可能主要是纯铁。然而，他们认识到，低至10%的铁成分的存在可能会主导紫外线观测。\n普赛克是美国宇航局发现任务普赛克的目标，预计将于2022年搭载SpaceX猎鹰重型火箭发射。当轨道探测器在2026年初到达时，关于这颗小行星的更多事实，包括它的确切金属含量，有望被揭开。\n“16普赛克是太阳系中唯一已知的此类天体，这也是人类访问核心的唯一途径。我们通过访问外层空间来了解内部空间，“NASA任务的首席科学家、亚利桑那州立大学地球与空间探索学院院长Lindy Elkins-Tanton在2017年1月宣布这项任务的声明中说。\n这颗小行星被认为是一颗行星留下的死核，这颗行星在太阳系生命早期的形成过程中失败了，或者是它遥远的过去多次猛烈碰撞的结果。\n“短短它是死星…。另一种可能性是它是太阳系早期非常靠近太阳形成的物质，“埃尔金斯-坦顿在2017年5月的一次采访中告诉福布斯。“我想我们要么去看一些非常不可能和独特的东西，要么去看一些完全令人惊叹的东西。”", "note_en": "NASA’s Hubble Space Telescope has discovered a rare, heavy and immensely valuable asteroid called “16 Psyche” in the Solar System’s main asteroid belt between Mars and Jupiter.\n Asteroid Psyche is located at roughly 230 million miles (370 million kilometers) from Earth and measures 140 miles (226 kilometers) across, about the size of West Virginia. What makes it special is that, unlike most asteroids that are either rocky or icy, Psyche is made almost entirely of metals, just like the core of Earth, according to a  study published in the  Planetary Science Journal on Monday.\n “We’ve seen meteorites that are mostly metal, but Psyche could be unique in that it might be an asteroid that is totally made of iron and nickel,” said Tracy Becker, one of the study’s authors and a planetary scientist at the Southwest Research Institute in San Antonio, Texas.\n Given the asteroid’s size, its metal content could be worth $10,000 quadrillion ($10,000,000,000,000,000,000), or about 10,000 times the global economy as of 2019.\n  Using ultraviolet spectrum data collected by the Space Telescope Imaging Spectrograph on the Hubble Space Telescope during two observations in 2017, researchers deduced that Psyche’s surface could be mostly pure iron. However, they recognized that the presence of an iron composition of as small as 10 percent could dominate ultraviolet observations.\n Psyche is the target of the  NASA Discovery Mission Psyche, expected to launch in 2022 atop a SpaceX Falcon Heavy rocket. Further facts about the asteroid, including its exact metal content, will hopefully be uncovered when an orbiting probe arrives in early 2026.\n “16 Psyche is the only known object of its kind in the Solar System, and this is the only way humans will ever visit a core. We learn about inner space by visiting outer space,” Lindy Elkins-Tanton, the lead scientist on the NASA mission and the director of Arizona State University’s School of Earth and Space Exploration, said in  a statement announcing the mission in January 2017.\n The asteroid is believed to be the dead core left by a planet that failed during its formation early in the Solar System’s life or the result of many violent collisions in its distant past.\n “Short of it being the Death Star… one other possibility is that it’s material that formed very near the Sun early in the Solar System,” Elkins-Tanton told Forbes in  an interview in May, 2017 interview. “I figure we’re either going to go see something that’s really improbable and unique, or something that is completely astonishing.”", "posttime": "2020-10-29 15:25:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,discovers,太阳系", "title": "NASA发现一颗价值1万美元的稀有金属小行星", "title_en": " NASA Discovers a Rare Metal Asteroid That's Worth $10,000 Quadrillion", "transed": 1, "url": "https://observer.com/2020/10/nasa-discover-asteroid-pysche-metal-10-quadrillion/", "via": "", "real_tags": ["nasa", "discovers", "太阳系"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日本的自杀事件就像加州的野火：悲剧，不可避免，似乎无法解决。根据国家警察局的数据，9月份有1805人自杀，女性自杀率上升不成比例。\n尽管如此，过去10年中自杀的案例有所下降，2019年年底只有20169例-这是自1978年政府首次开始记录以来的最低死亡人数，在早期的零工期间，死亡人数为负1万多人。奇怪的是，尽管日本政府对群岛上发现的几乎所有其他故障都守口如瓶，但他们一直对国家的自杀率直言不讳。世界上很少有国家愿意公布这一数字，但日本除外。\n自杀在这里从来不是禁忌。早在东京还叫江户，全国禁止外国人进入的时候，据说这座城市的自杀率是现在的两倍，人口只有100万，是今天的十四分之一。\n有一种集体心态认为，亲手死亡是发表声明或消除问题的最好、最有效的方式，这一遗产仍然存在。人们普遍认为，每个日本人一生中都至少知道一个人自杀了。(我自己知道有六个，但这是相当常见的。)。\n今年，自杀率在6月份之前一直很低，但从7月到8月，这一数字一直在攀升。这或多或少是有可能的-一些专家早在3月份就预测，在新冠肺炎的大流行下，自杀的人会比死于病毒的人更多。仅在8月份，就有1854人结束了自己的生命，其中119人是30岁以下的妇女。这一数字令人担忧，但主流媒体似乎过于分心，无法解释为什么会发生这种情况。然而，那些费心的人找到了松本俊彦(Toshihiko Matsumoto)博士，他是一位几乎只与自杀患者合作的精神病学家。根据松本的说法，自黄金周(5月初)以来，有自杀倾向的年轻女性有所增加，那些无法度过春季的女性在夏季将自己推向了悬崖边缘。\n松本说，在日本，女性自杀的原因与男性不同。“男性的问题几乎总是源于工作或工作场所，而女性则更注重社交，更容易在人际关系中遇到障碍。”在大流行前的日子里，女孩们可以和她们的朋友一起喝咖啡，然后发泄一下。但在呆在家里期间，他们被剥夺了这项娱乐活动。当你看到的只有家人时，抑郁的素材很多。“。他说得有道理。大多数日本女儿都很勤奋和尽职尽责，但她们还没有准备好和爸爸妈妈讨论生活问题。松本解释说：“他们不想让父母失望。”这一逻辑本身就是产生自杀念头的温床。\n引发年轻女性自杀的另一个因素可能是最近演员/表演者中出现的一波自杀事件。这些名人似乎拥有活着的一切，但仍然选择死亡作为一条出路。5月下旬，职业摔跤运动员Hana Kimura(22岁)被发现死于家中，此前她受到社交媒体欺凌的困扰。今年7月，业内最受欢迎的演员之一三浦原(30岁)的身体在他的厨房里被发现。在三浦之后，女演员兼模特Sei Ashina(36岁)去世了。最近令人震惊的是竹内由子(40岁)的去世，这位一线女演员的职业生涯跨越了25年，她刚刚在2月份与一位联合主演再婚。到目前为止，已经有五人死亡，其中只有一人留下了纸条演员藤木隆(Takashi Fujiki，80岁)，他的身体是在中野区一套廉价的小公寓里被发现的。\n媒体分析人士大多回避这个话题，担心踩到社交媒体上散落的地雷。即使是一句礼貌的话也可能被认为是冒犯的、伤害的或最糟糕的--激励他人自杀。\n野口美佐子(Misako Noguchi)在过去的30年里一直担任选角总监，她说她从来没有见过这样的事情。“无论现实世界变得多么糟糕，表演者主动死亡的情况都非常罕见。像这样的事情对整个社会的影响将是巨大的，大多数明星都意识到了这一点。野口说，她把责任归咎于新冠肺炎-“当一个表演者被迫连续几周甚至几个月呆在家里时，他们的心理健康就会受到巨大的损害。”我自己也快疯了，被困在公寓的四面墙里，身无分文，情绪低落。想象一下竹内由子这样的大明星会有什么感受。她习惯了一天12小时处于聚光灯下，周围都是摄像机和人。然后突然，砰的一声！工作枯竭了。她甚至不能出去。“。\n至此，大多数日本人已经与新冠肺炎达成协议。我们会戴口罩，大力消毒，尽量避开人群。请让我们回到表面上的正常状态。但对一些日本人来说，这可能太少了，也太晚了。现在，心理健康专业人士担心，自杀率将在12月再次飙升-传统上，这是许多日本人通过结束自己的生命来逃避年终财务困境的月份。失业和倒闭的企业可能会将更多的人推到边缘，与夏季的几个月不同，死亡预计将发生在40多岁至60多岁的人中。\n在一个以长寿和超龄社会闻名的国家里，自杀竟然是主要的死亡原因，这似乎令人头脑麻木。正如松本博士所说，“也许这个社会现在需要的不是保护措施，而是更少的社会距离和更多不必要的短途旅行。”\n如果你正在考虑自杀，或者你认识一个正在自杀的人，这个日语网站提供了许多获得咨询的方法。\n如有紧急情况，请立即拨打日本境内的119寻求帮助。需要免费匿名咨询的人可以拨打03-5774-0992提供英语版的Tell Lifline。你也可以在Telljp.com上访问他们。对于其他国家的人，请访问www.suicide.org/international-suicide-hotlines.html", "note_en": "Suicides in Japan are like wildfires in California: tragic, inevitable and seemingly unsolvable. According to the National Police Agency, 1805 people killed themselves in September and suicides amongst women were disproportionately rising.\n  Still, cases of people offing themselves had gone down in the past 10 years, and 2019 closed out the year with 20,169 cases – the lowest number of deaths since 1978 when the government first started keeping records, and minus 10,000-plus cases during the early naughts. Strangely enough, though the Japanese government is secretive and reticent about almost every other glitch found in the archipelago, they’ve always been upfront about the nation’s suicide rate. Few countries in the world are s o ready to reveal the numbers but not in Japan.\n Suicide has never been taboo here. Back when Tokyo was called Edo and the nation was closed off to foreigners, the suicide rate in this city was said to be twice what it is now, among a population of a mere one million, which is one-fourteenth of what it is today.\n There was a collective mentality that dying by one’s own hand is the best and most effective way to make a statement or erase problems, and the legacy still holds.  Popular belief has it that every Japanese person goes through life knowing at least one person who committed suicide. (I myself have known six, but that’s fairly common.)\n This year, suicides were low until June, but from July to August, the figures kept climbing. This was more or less in the cards – some experts had predicted as early as March that under the Covid-19 pandemic, more people will kill themselves than be killed by the virus. In August alone, 1854 people took their own lives of which 119 were women under 30 years old. This figure is alarming, but mainstream media seems too distracted to shed much light on why this is happening. Those who bothered however, tracked down Dr. Toshihiko Matsumoto, a psychiatrist who works almost exclusively with suicidal patients. According to Matsumoto, there had been an increase in young women with suicidal tendencies since Golden Week (early May), and those who couldn’t make it through the spring drove themselves over the edge during the summer.\n Matsumoto said that in Japan, women commit suicides for different reasons from men. “Men’s problems almost always stem from work or the workplace, whereas women are much more social and are apt to encounter snags in their personal relationships. In pre-pandemic days girls could meet their friends for coffee, and just vent. But they were deprived of this pastime during the stay-home period. When the only people you see are family, there’s a lot of material for depression.” He has a point. Most Japanese daughters are diligent and dutiful, but they’re not ready to discuss life problems with mom and dad. “They don’t want to let their parents down,” explained Matsumoto, a logic that in itself is a breeding ground for suicidal thoughts.\n Another factor triggering the suicides of young women could be the recent wave of self-inflicted deaths among actors/performers. These were celebrities who seemingly had everything to live for, and still chose death as a way out. In late May,  professional wrestler Hana Kimura (22) was found dead in her home after being plagued by social media bullying. In July, the body of Haruma Miura (30) – one of the most popular actors in the industry, was found in his kitchen. After Miura came the death of actress and model Sei Ashina (36). The most recent shocker is the death of Yuko Takeuchi (40), an A-list actress whose career spans 25 years, and who had just remarried a co-star in February. There are five deaths so far, and only one of them left a note – actor Takashi Fujiki (80), whose body was found in a cheap, tiny apartment in Nakano ward.\n Media analysts have mostly steered clear of the topic, fearful of stepping on the landmines strewn about on social media. Even a polite statement may be construed as offensive, hurtful or most damning of all – inspire others to die by their own hand.\n Misako Noguchi, who has worked as a casting director for the past 30 years, says that she has never seen anything like it. “No matter how bad things got in the real world, it was very rare for performers to die of their own accord. The repercussions of something like that on the larger society would be enormous, and most stars were aware of that.” Noguchi says she blames Covid-19 – “when a performer is forced to stay home for weeks and months on end, it takes a huge toll on their mental health. I myself was going crazy, trapped inside the four walls of my apartment, broke and depressed. Imagine how a big star like Yuko Takeuchi would feel. She was used to being under the spotlight 12 hours a day, surrounded by cameras and people. Then suddenly, bang! Work dried up. She couldn’t even go outside.”\n At this point, most Japanese have struck a deal with Covid-19. We’ll wear masks, disinfect vigorously and try to avoid crowds. Just please let us return to a semblance of normalcy. But for some Japanese, it may be too little, too late. Now mental health professionals fear that suicide rate will soar again in December – traditionally a month when many Japanese seek escape from year-end financial troubles by taking their own lives. Unemployment and failed businesses could push more people over the edge, and unlike the summer months, the deaths are expected to occur among people in their 40s to 60s.\n It seems mind-numbingly strange that in a country famed for longevity and its super-aged society, suicides should be a leading cause of death. As Dr. Matsumoto says, “maybe what this society needs now isn’t protection measures but far less social distancing and more non-essential excursions.”\n   If you’re considering suicide or know someone who is, this site in Japanese offers a number of ways to get counseling.\n  In case of an emergency, please call 119 in Japan for immediate assistance. The TELL Lifeline is available in English for those who need free and anonymous counseling at 03-5774-0992. You can also visit them at  telljp.com. For those in other countries, visit  www.suicide.org/international-suicide-hotlines.html", "posttime": "2020-10-29 15:19:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,自杀,suicide", "title": "日本的自杀事件", "title_en": "Suicide in Japan", "transed": 1, "url": "http://www.japansubculture.com/japans-death-wish-resurges-like-a-plague/", "via": "", "real_tags": ["日本", "自杀", "suicide"]}, {"category": "", "categoryclass": "", "imagename": "23ee84448d71876b1c7789af2bfb9786.jpeg", "infoid": 1031951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波士顿(美联社)-美国联邦机构警告称，网络犯罪分子正在对美国医疗系统发动一波数据扰乱勒索企图，目的是锁定医院信息系统，这可能会在全国新冠肺炎病例激增之际损害患者护理。\n在周三的联合警报中，联邦调查局(FBI)和两个联邦机构警告称，他们掌握了“可信的信息，表明美国医院和医疗保健提供者面临的网络犯罪威胁正在增加和迫在眉睫”。警报称，恶意组织正以该行业为目标，发动攻击，产生“数据窃取和医疗服务中断”。\n网络攻击涉及勒索软件，它将数据扰乱为乱码，只有在目标付清款项后才能用软件密钥解锁。独立安全专家说，本周已经有至少五家美国医院陷入困境，可能还会影响数百家医院。\n一个讲俄语的犯罪团伙的进攻恰逢美国总统大选，尽管没有直接迹象表明他们的动机除了利润之外。网络安全公司曼迪昂特(Mandiant)的首席技术官查尔斯·卡马卡尔(Charles Carmakal)在一份声明中说，“我们正在经历美国有史以来最严重的网络安全威胁。”\n一年多来，Hold Security一直在密切跟踪有问题的勒索软件。该公司首席执行官亚历克斯·霍尔登(Alex Holden)也认为，考虑到这场攻势正值总统选举的激烈争执和一个世纪以来最严重的全球大流行，正在展开的攻势对美国来说是史无前例的。\n联邦警报是由国土安全部和卫生与公众服务部共同撰写的。\n发动攻击的网络罪犯使用一种名为Ryuk的勒索软件，这种软件通过名为Trickbot的僵尸计算机网络播种，微软从10月初开始试图反击。据报道，美国网络司令部也对Trickbot采取了行动。虽然微软通过法律行动将其指挥控制服务器下线取得了相当大的成功，但分析人士表示，犯罪分子仍在寻找传播Ryuk的方法。\n在过去的18个月左右的时间里，美国经历了一场勒索软件的瘟疫，从巴尔的摩到亚特兰大的主要城市受到了打击，地方政府和学校受到的打击尤其严重。\n9月份，一次勒索软件攻击使连锁医院Universal Health Services的所有250家美国设施陷入瘫痪，迫使医生和护士依赖纸张和铅笔进行记录，并减缓了实验室工作的速度。员工们描述了阻碍患者护理的混乱条件，包括急诊室等待时间的增加和无线生命体征监测设备的故障。\n同样在9月份，已知的第一起与勒索软件有关的死亡事件发生在德国杜塞尔多夫，当时IT系统故障迫使一名危重患者被送往另一座城市的医院。\n霍尔登说，他在监测了一些医院的感染企图后，于周五通知了联邦执法部门，其中一些医院可能已经击退了感染。FBI没有立即回复记者的置评请求。\n他说，该组织要求的赎金远远超过每个目标1000万美元，参与暗网的犯罪分子正在讨论试图感染400多家医院、诊所和其他医疗设施的计划。\n霍尔登说：“坏人的评论之一是，他们预计会引起恐慌，而且，不，他们没有攻击选举系统。”“他们打到了更痛的地方，他们知道这一点。”美国官员一再对影响总统选举的重大勒索软件攻击表示担忧，尽管犯罪分子的动机主要是利润。\nMandiant的Carmakal确认这个犯罪团伙为U.1878，称“他们故意瞄准和扰乱美国医院，迫使他们将病人转移到其他医疗保健提供者”，并导致重症监护工作长期拖延。\n他称这个东欧组织是“我在职业生涯中观察到的最肆无忌惮、最无情、最具破坏性的威胁因素之一”。\n虽然还没有人证明俄罗斯政府与使用Trickbot平台的帮派之间存在可疑的联系，但霍尔登表示，他“毫无疑问，俄罗斯政府知道这次行动--真的是恐怖主义。”他说，数十个不同的犯罪集团使用Ryuk，向其设计师支付一定的分成。\n网络安全公司CrowdStrike的联合创始人、前首席技术官德米特里·阿尔佩罗维奇(Dmitri Alperovitch)表示，“俄罗斯网络罪犯和国家之间肯定有很多联系”，克里姆林宫雇佣的黑客有时还兼职充当网络罪犯。\n霍尔登和卡马卡尔都不愿透露受影响的医院。据报道，本周到目前为止，已有四家医疗机构受到勒索软件的攻击，其中三家属于纽约州北部的圣劳伦斯县医疗系统(St.Lawrence County Health System)和俄勒冈州克拉马斯瀑布(Klamath Falls)的天空湖医疗中心(Sky Lake Medical Center)。\n天空湖在一份在线声明中承认了勒索软件攻击，称没有证据表明患者信息被泄露。该公司表示，圣劳伦斯系统没有立即回复寻求置评的电话，急救和紧急护理“仍然可用”。\n越来越多的勒索软件犯罪分子在加密网络之前从他们的目标窃取数据，并将其用于敲诈勒索。网络安全公司Emsisoft的分析师布雷特·卡洛(Brett Callow)说，他们通常在恶意软件激活前几周播种，等待他们认为可以赚取最高付款的时刻。\n卡洛说，2020年共有59家美国医疗保健提供商/系统受到勒索软件的影响，扰乱了多达510家机构的患者护理。\nCarmakal说，Mandiant周三向微软提供了尽可能多的关于Thr Eat的细节，这样它就可以向客户分发细节。微软发言人没有立即置评。\n美联社撰稿人埃里克·塔克(Eric Tucker)在华盛顿特区、丽莎·鲍曼(Lisa Baumann)在西雅图和迪普蒂·哈杰拉(Deepti Hajela)在纽约市对这篇报道也有贡献。", "note_en": "BOSTON (AP) — Federal agencies warned that cybercriminals are  unleashing a wave of data-scrambling extortion attempts against the U.S. healthcare system designed to lock up hospital information systems, which could hurt patient care just as nationwide cases of COVID-19 are spiking.\n In a joint alert Wednesday, the FBI and two federal agencies warned that they had “credible information of an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.” The alert said malicious groups are targeting the sector with attacks that produce “data theft and disruption of healthcare services.”\n  The cyberattacks involve ransomware, which scrambles data into gibberish that can only be unlocked with software keys provided once targets pay up. Independent security experts say it has already hobbled at least five U.S. hospitals this week, and could potentially impact hundreds more.\n The offensive by a Russian-speaking criminal gang coincides with the U.S. presidential election, although there is no immediate indication they were motivated by anything but profit. “We are experiencing the most significant cyber security threat we’ve ever seen in the United States,” Charles Carmakal, chief technical officer of the cybersecurity firm Mandiant, said in a statement.\n Alex Holden, CEO of Hold Security, which has been closely tracking the ransomware in question for more than a year, agreed that the unfolding offensive is unprecedented in magnitude for the U.S. given its timing in the heat of a contentions presidential election and the worst global pandemic in a century.\n The federal alert was co-authored by the Department of Homeland Security and the Department of Health and Human Services.\n The cybercriminals launching the attacks use a strain of ransomware known as Ryuk, which is seeded through a network of zombie computers called Trickbot that Microsoft  began trying to counter earlier in October. U.S. Cyber Command has also reportedly taken action against Trickbot. While Microsoft has had considerable success knocking its command-and-control servers offline through legal action, analysts say criminals have still been finding ways to spread Ryuk.\n The U.S. has seen a plague of ransomware over the past 18 months or so, with major cities from Baltimore to Atlanta hit and local governments and schools hit especially hard.\n In September, a ransomware attack  hobbled all 250 U.S. facilities of the hospital chain Universal Health Services, forcing doctors and nurses to rely on paper and pencil for record-keeping and slowing lab work. Employees described chaotic conditions impeding patient care, including mounting emergency room waits and the failure of wireless vital-signs monitoring equipment.\n Also in September, the  first known fatality related to ransomware occurred in Duesseldorf, Germany, when an IT system failure forced a critically ill patient to be routed to a hospital in another city.\n Holden said he alerted federal law enforcement Friday after monitoring infection attempts at a number of hospitals, some of which may have beaten back infections. The FBI did not immediately respond to a request for comment.\n He said the group was demanding ransoms well above $10 million per target and that criminals involved on the dark web were discussing plans to try to infect more than 400 hospitals, clinics and other medical facilities.\n “One of the comments from the bad guys is that they are expecting to cause panic and, no, they are not hitting election systems,” Holden said. “They are hitting where it hurts even more and they know it.” U.S. officials have repeatedly expressed concern about major ransomware attacks affecting the presidential election, even if the criminals are motivated chiefly by profit.\n Mandiant’s Carmakal identified the criminal gang as UNC1878, saying “it is deliberately targeting and disrupting U.S. hospitals, forcing them to divert patients to other healthcare providers” and producing prolonged delays in critical care.\n He called the eastern European group “one of most brazen, heartless, and disruptive threat actors I’ve observed over my career.”\n While no one has proven suspected ties between the Russian government and gangs that use the Trickbot platform, Holden said he has “no doubt that the Russian government is aware of this operation — of terrorism, really.” He said dozens of different criminal groups use Ryuk, paying its architects a cut.\n Dmitri Alperovitch, co-founder and former chief technical officer of the cybersecurity firm Crowdstrike, said there are “certainly lot of connections between Russian cyber criminals and the state,” with Kremlin-employed hackers sometimes moonlighting as cyber criminals.\n Neither Holden nor Carmakal would identify the affected hospitals. Four healthcare institutions have been reported hit by ransomware so far this week, three belonging to the St. Lawrence County Health System in upstate New York and the Sky Lakes Medical Center in Klamath Falls, Oregon.\n Sky Lakes acknowledged the ransomware attack in an online statement, saying it had no evidence that patient information was compromised. It said emergency and urgent care “remain available” The St. Lawrence system did not immediately return phone calls seeking comment.\n Increasingly, ransomware criminals are stealing data from their targets before encrypting networks, using it for extortion. They often sow the malware weeks before activating it, waiting for moments when they believe they can extract the highest payments, said Brett Callow, an analyst at the cybersecurity firm Emsisoft.\n A total of 59 U.S. healthcare providers/systems have been impacted by ransomware in 2020, disrupting patient care at up to 510 facilities, Callow said.\n Carmakal said Mandiant had provided Microsoft on Wednesday with as much detail as it could  about the thr eat so it could distribute details to its customers. A Microsoft spokesman had no immediate comment.\n  Associated Press writers Eric Tucker in Washington, D.C., Lisa Baumann in Seattle and Deepti Hajela in New York City contributed to this report.", "posttime": "2020-10-29 15:00:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,美国,攻击,warns", "title": "FBI警告勒索软件攻击威胁美国医疗体系", "title_en": "FBI warns ransomware assault threatens US healthcare system", "transed": 1, "url": "https://apnews.com/article/politics-crime-elections-presidential-elections-548634f03e71a830811d291401651610", "via": "", "real_tags": ["软件", "美国", "攻击", "warns"]}, {"category": "", "categoryclass": "", "imagename": "c511d0560e93d14de8b7bb070f29336a.jpg", "infoid": 1031950, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "The Graph是一个服务于主要Defi客户的区块链数据项目，在一次迅速售罄的象征性销售中筹集了1200万美元。\nThe Graph是一家区块链数据公司，为Defi一些最受欢迎的应用程序提供服务，该公司在一次象征性的销售中筹集了1200万美元，仅在24小时多一点的时间内就销售一空。\nGraph基金会今天宣布，以1200万美元的资金成功出售了4亿个GRT代币，完全使用Graph自己的技术在链上执行。此次销售占总GRT供应量的4%，包括来自90个国家的4500名参与者。\n这些令牌将在未来几年内在扩展Graph的服务方面发挥关键作用，因为Defi应用程序的增长推动了对海量区块链数据的高速需求。\nGraph帮助客户通过SQL等更熟悉的数据库接口语言访问区块链数据，轻松将数据集成到基于区块链的应用中。分散的金融，或DEFI，应用程序是Graph数据的主要需求来源，因为它们使用区块链数据来帮助设定贷款和客户存款的利率。\n来自Graph的数据是如此重要，事实上，爆炸性需求导致的系统故障导致几个Defi服务出现问题长达数小时，包括贷款协议AAVE和去中心化交易所聚合器1inch.exchange。\nGraph于10月13日宣布了此次代币销售，并在10月15日之前接受了超过1.4万名非美国居民的注册。75%的代币是由3000名精选的参与者在前24小时内购买的，这些参与者与Graph的社区有很强的联系。\nGraph计划在未来两个月内推出其主网网络，这将允许令牌持有者和其他基础设施运营商TFO通过便利Graph客户的数据请求来开始下注和赚取令牌。在销售期间购买的GRT令牌在大型网发布之前是不可转让的。\nGraph已经证明自己是Defi基础设施的重要组成部分，随着越来越多的公司在分散的Web3.0上存储和搜索数据，它的客户基础可能会继续增长。就像Etherum一样，Graph正在着眼于去中心化和可伸缩性为未来做准备，而成功的GRT代币销售应该会对这两个方面都有所帮助。\n为获得最佳体验，请立即下载指尖上的顶级密码新闻和独家功能。", "note_en": "The Graph, a blockchain data project serving major DeFi customers, has raised $12 million in a quickly sold-out token sale.\n   The Graph, a blockchain data company providing services for some of DeFi’s most popular apps, has raised $12 million in a token sale that sold out in just over 24 hours.\n The Graph Foundation   announced  today the successful sale of 400 million GRT tokens for $12 million in funding , performed entirely on-chain using The Graph’s own technology. The sale represents 4% of the total GRT supply and included 4,500 participants across 90 countries.\n   The tokens will serve a key role in scaling The Graph’s services over the coming years, as DeFi app growth fuels the need for vast amounts of blockchain data at high speed.\n The Graph helps customers access blockchain data through more familiar database interface languages like SQL, easing the integration of the data into blockchain-based applications.   Decentralized finance , or DeFi, applications are a major source of demand for data from The Graph, as they use blockchain data to help set interest rates on loans and customer deposits.\n Data from The Graph is so essential, in fact, that a glitch in the system caused by explosive demand led to   issues at several DeFi services for hours , including at lending protocol Aave and decentralized exchange aggregator 1inch.exchange.\n The Graph   announced the token sale on October 13  and took registrations from more than 14,000 non-US residents until October 15. Seventy-five percent of tokens were purchased in the first 24 hours by 3,000 select participants with strong connections to The Graph’s community.\n  The Graph plans to launch its mainnet network within the next two months, which will allow token holders and other infrastructure operators tfo begin staking and earning tokens by facilitating data requests from The Graph customers. GRT tokens purchased during the sale are non-transferable until after the mainnet launch.\n The Graph has proven itself an essential part of DeFi infrastructure, and could continue to grow its customer base as more companies store and search for data on the decentralized Web 3.0. Just like Ethereum, The Graph is gearing up for the future with an eye on decentralization and scaling, and the successful GRT token sale should help with both.\n  For the best experience, top crypto news at your fingertips and exclusive features download now.", "posttime": "2020-10-29 14:32:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,数据,services,graph", "title": "The Graph为一些流行的Defi应用程序提供服务，通过象征性销售筹集了1200万美元，预计将在两个月内推出其数据提供商网络", "title_en": "The Graph, which provides services for some popular DeFi apps, raises $12M in a token sale and expects to launch its data provider network within two months", "transed": 1, "url": "https://decrypt.co/46560/the-graph-token-sale-raises-12-million-in-24-hours", "via": "", "real_tags": ["程序", "数据", "services", "graph"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章是关于机器学习和人工智能的系列文章的一部分。点击博客标签“Huskyai”查看相关帖子。\n几周前，在为我的GrayHat 2020-Red Team Village演示文稿准备演示时，我在Erwin Quiring等人的“对抗性预处理：理解和防止机器学习中的图像缩放攻击”一书中遇到了“图像缩放攻击”。\n其基本思想是将较小的图像隐藏在较大的图像中(它应该是大图像的5-10倍大小)。事实上，这次攻击很容易解释：\n攻击者通过将所需的目标图像隐藏在良性图像中来手工创建恶意输入图像。\n如果你仔细观察，你会发现第二张照片周围确实有一些奇怪的点。但当以较小的版本查看时，这一点并不明显。\n你可以在Github上找到密码。我使用Google Colab来运行它，一开始有一些错误，但它起作用了-如果感兴趣的话，让我知道，我可以清理并分享笔记本。\n现在，看看使用默认设置使用OpenCV加载图像并调整其大小时会发生什么情况：\n在左边你可以看到原始大小的图像，在左边同样的图像被缩小到128x128像素。\n缩小后的图片现在完全不同了！当然，我选择了一只哈士奇，因为我想攻击“哈士奇人工智能”，并找到另一个旁路。\n模型查询：模型预测的图像可能与用户上传的图像不同。\n与ML无关的攻击：在其他非机器学习领域，这也可能是一个问题。\n事实证明，赫斯基人工智能使用PIL，默认情况下，它不容易受到这种攻击。\n我很幸运，因为最初赫斯基人工智能确实使用了OpenCV，它的默认设置是调整图像的大小。但出于某种原因，我在早期就改变了这一点(不知道这也会减轻这次攻击)。\n如果使用OpenCV，则可以通过在调用RESIZE API时使用插值参数使其不使用默认值来修复该问题。\n对抗性预处理：理解和防止机器学习中的图像缩放攻击(https://www.usenix.org/system/files/sec20-quiring.pdf)(Erwin Quiring，TU Braunschweig)", "note_en": "This post is part of a series about machine learning and artificial intelligence. Click on the blog tag “huskyai” to see related posts.\n  A few weeks ago while preparing demos for my GrayHat 2020 - Red Team Village presentation I ran across “Image Scaling Attacks” in  Adversarial Preprocessing: Understanding and Preventing Image-Scaling Attacks in Machine Learning by Erwin Quiring, et al.\n   The basic idea is to hide a smaller image inside a larger image (it should be about 5-10x the size). The attack is easy to explain actually:\n Attacker crafts a malicious input image by hiding the desired target image inside a benign image\n    If you look closely, you can see that the second image does have some strange dots all around. But this is not noticable when viewed in smaller version.\n You can find the code on  Github. I used Google Colab to run it, and there were some errors initialy but it worked - let me know if interested and I can clean up and share the Notebook also.\n  Now, look what happens when the image is loaded and resized with  OpenCV using default settings:\n  On the left you can see the original sized image, and on the left the same image downsized to 128x128 pixels.\n  The downsized image is an entirely different picture now! Of course I picked a husky, since I wanted to attack “Husky AI” and find another bypass.\n   Model queries: The model might predict on a different image than the one the user uploaded\n Non ML related attacks: This can also be an issue in other, non machine learning areas.\n   Turns out that Husky AI uses PIL and that was not vulnerable to this attack by default.\n I got lucky, because initially Husky AI did use  OpenCV and it’s default settings to resize images. But for some reason I changed that early on (not knowing it would also mitigate this attack).\n If you use  OpenCV the issue can be fixed by using the  interpolation argument when calling the  resize API to not have it use the default.\n     Adversarial Preprocessing: Understanding and Preventing Image-Scaling Attacks in Machine Learning ( https://www.usenix.org/system/files/sec20-quiring.pdf) (Erwin Quiring, TU Braunschweig)", "posttime": "2020-10-29 14:27:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缩放,scaling,图像", "title": "图像缩放攻击", "title_en": "Image Scaling Attacks", "transed": 1, "url": "https://embracethered.com/blog/posts/2020/husky-ai-image-rescaling-attacks/", "via": "", "real_tags": ["缩放", "scaling", "图像"]}, {"category": "", "categoryclass": "", "imagename": "627321fb5b26eb92660c437d7dc96a5d.png", "infoid": 1031948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Monkeytype是一款简约的、可定制的打字测试，具有多种测试模式、保存打字速度历史记录的帐户系统以及用户可配置的功能，如主题、流畅的插入符号等等。\n最近，一个不和谐的机器人被添加到自动分配角色中。你可以在https://github.com/Miodec/monkey-bot上找到它的代码。\n如果你遇到一个错误，或者有一个功能请求-在Reddit上给我发一条消息，制造一个问题，或者加入不一致服务器。\nMontydrei的名字建议每一位对这个网站原型的Reddit原始帖子提供宝贵反馈的人都是帮助实现各种功能、添加主题和更多内容的贡献者。\n如果你想支持进一步的发展，并感觉特别棒，你可以在这里这样做。", "note_en": "Monkeytype is a minimalistic, customisable typing test, featuring many test modes, an account system to save your typing speed history and user configurable features like themes, a smooth caret and more.\n    Recently, a Discord bot was added to autoassign roles. You can find the code for it over at  https://github.com/Miodec/monkey-bot\n  If you encounter a bug, or have a feature request - send me a message on Reddit, create an issue or join the  Discord server.\n  Montydrei for the name suggestionEveryone who provided valuable feedback on the original reddit post for the prototype of this websiteContributors that have helped with implementing various features, adding themes and more.\n  If you wish to support further development and feeling extra awesome, you can do so  here.", "posttime": "2020-10-29 14:02:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "打字,minimalistic,功能", "title": "Monkeytype-一种简约的打字测试", "title_en": "Monkeytype – A Minimalistic Typing Test", "transed": 1, "url": "https://github.com/Miodec/monkeytype", "via": "", "real_tags": ["打字", "功能"]}, {"category": "", "categoryclass": "", "imagename": "b428baaf6053e720317235cbe1a32158.jpg", "infoid": 1031946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Coinbase卡是一种Visa®借记卡，您可以使用Coinbase产品组合中的任何资产并从每次购买中赚取奖励。\n\nCoinbase卡由MetaBank®，N.A.，FDIC成员根据Visa U.S.A.Inc.的许可发行。Coinbase卡由Marqeta提供支持。1Crypto奖励是Coinbase的一项可选优惠。2 Coinbase将自动将所有加密货币转换为美元，用于购买和自动取款机取款。3其他标准费用可能适用，并将在注册期间分摊。", "note_en": "Coinbase Card is a Visa® debit card that lets you spend any asset in your Coinbase portfolio and earn rewards for each purchase.\n \n The Coinbase Card is issued by MetaBank®, N.A., Member FDIC, pursuant to a license from Visa U.S.A. Inc. The Coinbase Card is powered by Marqeta.  1Crypto rewards is an optional Coinbase offer.  2Coinbase will automatically convert all cryptocurrency to US Dollars for use in purchases and ATM withdrawals.  3Other standard fees may apply, and will be shared during sign-up.", "posttime": "2020-10-29 13:35:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coinbase", "title": "Coinbase卡", "title_en": "Coinbase Card", "transed": 1, "url": "https://www.coinbase.com/card", "via": "", "real_tags": ["coinbase"]}, {"category": "", "categoryclass": "", "imagename": "c8b94a11bfd826c741b680c4a455d2a2.jpg", "infoid": 1031944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自三个政府机构和私营部门的官员警告称，就在科罗娜病毒卷土重来、美国总统大选进入最后阶段之际，俄罗斯黑客正以数百家美国医院和医疗保健提供者为目标。\nFBI、卫生与公众服务部(Health And Human Services)和网络安全与基础设施安全局(CyberSecurity&amp；Infrastructure Security Agency)联合发布的一份公告称，黑客通常会利用TrickBot感染的计算机网络渗透到这些组织中，并在进一步侵入他们的网络后部署Ryuk，这是一种特别具有攻击性的勒索软件。\n周三晚间的公告称：“CISA、FBI和HHS掌握了可靠的信息，表明网络犯罪对美国医院和医疗保健提供者的威胁日益增加和迫在眉睫。”CISA、FBI和HHS正在共享此信息，以向医疗保健提供者提供警告，以确保他们采取及时和合理的预防措施来保护其网络免受这些威胁。\n安全公司Mandiant在自己的通知中也说了大致相同的话，该通知提供了妥协的指标，目标组织可以使用这些指标来确定他们是否受到攻击。\nMandiant高级副总裁兼首席技术官Charles Carmakal在给记者的电子邮件中说，目标是“我们在美国见过的最严重的网络安全威胁”。他继续将计划背后的俄罗斯黑客组织描述为“我在职业生涯中观察到的最肆无忌惮、最无情和最具破坏性的威胁行为之一”。他说，在过去的几天里，已经有几家医院受到了攻击。\n他在一次采访中说：“威胁行为人的意图是打击数以百计的其他组织。”“大多数威胁行为者都不想故意袭击医院组织。这是一条道德界限，他们选择不越过它。这位特殊的演员，他们没有越界的问题。他们正积极瞄准医疗保健和医院组织。“。\n有报道称，在过去的几周里，少数几家医院受到了网络攻击。CNN说，它已经证实，“总部设在宾夕法尼亚州的医院医疗服务公司Universal Health Services、纽约的圣劳伦斯医疗系统公司和俄勒冈州的天空湖医疗中心在过去几天里都受到了感染。”\n两周前，微软和许多行业合作伙伴采取了协调一致的行动来颠覆TrickBot。在第一波浪潮中，合作伙伴关闭了该组织已知使用的69台命令和控制服务器中的62台。当黑客做出回应，启动了59台新服务器时，合作伙伴们关闭了所有服务器，只剩下一台。这些打击让TrickBot运营商争先恐后地维持僵尸网络的生存。\n微软表示，它在选举前采取行动，保护美国选举系统免受严重的勒索软件攻击。“纽约时报”(New York Times)报道称，这种干扰是双向的，因为它阻碍了研究人员过去用来追踪该组织的一些方法。\n泰晤士报援引总部位于密尔沃基的Hold Security创始人亚历克斯·霍尔登(Alex Holden)的话说：“这里的挑战是，由于试图拆除TrickBot，TrickBot的基础设施发生了变化，我们没有了以前的遥测技术。”针对数百家医院的袭击表明，该组织正在使用新的战术。\n由于公共和私营部门都警告关键基础设施在关键时刻面临严重威胁，医疗行业的人员最好检查日志，安装补丁，对员工进行网络钓鱼攻击方面的教育，并采取其他预防措施。上述美国政府和曼迪昂特的帖子也提供了一系列可行的建议。\n如果你在#Healthcare，你不能忽视这一点。这不是演习。你正受到攻击。五家医院已经(在两天内)受到令人衰弱的勒索软件的攻击，这些勒索软件几乎使他们的业务无法运行…。Https://t.co/zqII57f6JU https://t.co/CKDsbHtnmX。\n-千兆系统(@GigabitSys)2020年10月29日。\n“如果你在#Healthcare，你不能忽视这一点，”安全公司Giga Systems在推特上写道。“这不是演习。你正受到攻击。“", "note_en": "Russian hackers are targeting hundreds of US hospitals and healthcare providers just as the Corona Virus is making a comeback and the US presidential election is in its final stretch, officials from three government agencies and the private sector are warning.\n The hackers typically use the TrickBot network of infected computers to penetrate the organizations and after further burrowing into their networks deploy Ryuk, a particularly aggressive piece of ransomware, a  joint advisory published by the FBI, Health and Human Services, and the Cybersecurity &amp; Infrastructure Security agency said.\n “CISA, FBI, and HHS have credible information of an increased and imminent cybercrime threat to US hospitals and healthcare providers,” Wednesday evening’s advisory stated. “CISA, FBI, and HHS are sharing this information to provide warning to healthcare providers to ensure that they take timely and reasonable precautions to protect their networks from these threats.”\n Security firm Mandiant said much the same in its  own notice, which provided indicators of compromise that targeted organizations can use to determine if they were under attack.\n Mandiant Senior VP and CTO Charles Carmakal said in an email to reporters that the targeting was “the most significant cyber security threat we’ve ever seen in the United States.” He went on to describe the Russian hacking group behind the plans as “one of most brazen, heartless, and disruptive threat actors I’ve observed over my career.” Already several hospitals have come under attack in the past few days, he said.\n  “The intention by the threat actor is to hit hundreds of other organizations out there,” he said in an interview. “Most threat actors don’t want to deliberately hit hospital organizations. There&#39;s an ethical line and they choose not to cross it. This particular actor, they have no problem crossing the line. They’re actively targeting healthcare and hospital organizations.”\n There are reports of a handful of hospitals that have been hit with cyberattacks over the past few weeks. CNN  said, it had confirmed that “Universal Health Services, a hospital health care service company based in Pennsylvania; St. Lawrence Health Systems in New York; and the Sky Lakes Medical Center in Oregon were all infected over the past few days.”\n Two weeks ago, Microsoft and a host of industry partners took coordinated action to  disrupt TrickBot. In a first wave, the partners shut down 62 of 69 command and control servers known to be used by the group. When the hackers responded by spinning up 59 new servers, the partners took down all but one. The blows kept the TrickBot operators scrambling to keep the botnet alive.\n Microsoft said it took action to protect the US election systems from crippling ransomware attacks in the lead up to the elections. The New York Times  reported that the disruption worked both ways, because it hampered some of the methods researchers have used in the past to track the group.\n “The challenge here is because of the attempted takedowns, the TrickBot infrastructure has changed and we don’t have the same telemetry we had before,” the Times quoted Alex Holden, founder of Milwaukee-based Hold Security, saying. The targeting of hundreds of hospitals indicated the group was using new tactics.\n With both the public and private sectors warning of a grave threat to a critical infrastructure at a crucial time, people in the healthcare industry would do well to check logs, install patches, educate employees about phishing attacks, and take other precautions. The above-linked US government and Mandiant posts also provide a host of actionable advice.\n If you are in  #healthcare, you can’t afford to ignore this. This is not a drill. You are under attack.   Five hospitals have already been hit (in two days) with debilitating Ransomware that have virtually disabled their operations… https://t.co/zqII57f6JU  https://t.co/CKDsbHtnmX\n— Gigabit systems (@GigabitSys)  October 29, 2020\n “If you are in #healthcare, you can’t afford to ignore this,” security firm Giga Systems  tweeted. “This is not a drill. You are under attack.”", "posttime": "2020-10-29 13:15:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,软件,俄罗斯,美国,医院", "title": "建议：“布拉森”俄罗斯勒索软件黑客以数百家美国医院为目标", "title_en": "Advisories: “Brazen” Russian ransomware hackers target hundreds of US hospitals", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/10/us-government-warns-of-imminent-ransomware-attacks-against-hospitals/", "via": "", "real_tags": ["黑客", "软件", "俄罗斯", "美国", "医院"]}, {"category": "", "categoryclass": "", "imagename": "19ebf6be28add1a1e72954ba01704afb.jpeg", "infoid": 1031943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，Marvell科技集团有限公司(Marvell Technology Group Ltd.)即将达成协议，以高达100亿美元的价格收购Inphi Corp.，这将是本周半导体行业迅速整合之际的第二笔大型合并交易。\n知情人士说，如果谈判不破裂，两家公司最早可能在周四宣布交易。\nMarvell的市值约为260亿美元，主要生产用于数据存储和网络的芯片。收购Inphi将有助于Marvell扩大其在网络领域的影响力，这一快速增长的领域帮助推动Inphi的股价今年上涨了约50%。\n半导体行业正处于一场全面的并购狂潮中，在大流行的情况下，这一点更加令人惊讶。笔记本电脑和视频游戏的需求激增，人们呆在家里，数据中心的增长促进了公司在线业务活动的转移，这推动了这一趋势。\n在这种需求的支持下，股价上涨为芯片公司提供了进行引人注目的收购的工具。\n先进微设备公司(Advanced Micro Devices Inc.)。周二同意收购芯片制造商Xilinx Inc.。350亿美元，这是2020年美国最大的一笔收购。在此之前，英伟达公司(Nvidia Corp.)同意以400亿美元收购英国手机芯片设计巨头ARM控股公司(Arm Holdings)。就在上周，英特尔公司(Intel Corp.)同意将其闪存制造业务出售给韩国SK海力士公司(SK Hynix Inc.)。约90亿美元，此举将把这家苦苦挣扎的行业巨头从一个具有历史重要性的领域重新定位。\n7月份，ADI公司。同意支付超过200亿美元收购Maxim集成产品公司。\nMarvell的上一笔重大交易是在2018年，当时它收购了Cavium Inc.。这笔交易价值约64亿美元。Marvell总部设在百慕大，但在Inphi总部所在的加利福尼亚州圣克拉拉运营。\n在2020年10月29日的印刷版中，芯片公司Marvell Nears以100亿美元的价格合并。", "note_en": "Marvell Technology Group  Ltd. is nearing a deal to buy  Inphi  Corp. for as much as $10 billion, according to people familiar with the matter, in what would be the second big semiconductor tie-up this week as the industry rapidly consolidates.\n  The companies could announce a deal as soon as Thursday, assuming the talks don’t fall apart, the people said.\n  Marvell, which has a market value of roughly $26 billion, primarily makes chips used in data storage and networking. Buying Inphi would help Marvell expand its reach in networking, a fast-growing segment that has helped push Inphi’s stock up roughly 50% this year.\n  The  semiconductor industry is in the midst of a full-fledged merger frenzy, all the more surprising in the middle of a pandemic. It has been fueled by surging demand for laptops and videogames, with people stuck at home, as well as growth in the data centers that facilitate companies’ shifting business activity online.\n    Rising share prices on the back of that demand have given chip companies a tool to make splashy acquisitions.\n  Advanced Micro Devices  Inc. agreed Tuesday to buy chip maker  Xilinx  Inc. for $35 billion, in the biggest U.S. acquisition of 2020. That followed closely  Nvidia  Corp.’s agreement to pay $40 billion for Arm Holdings, the British mobile-phone chip design giant. Just last week,  Intel  Corp. agreed to sell its flash-memory manufacturing business to South Korea’s  SK Hynix  Inc. for around $9 billion, in a move that will reorient the struggling industry giant away from an area of historical importance.\n  In July,  Analog Devices  Inc. agreed to pay more than $20 billion for  Maxim Integrated Products  Inc.\n  Marvell’s last major deal was in 2018, when it bought Cavium Inc. in a roughly $6.4 billion deal. Marvell is based in Bermuda but run from Santa Clara, Calif., where Inphi has headquarters.\n  Appeared in the October 29, 2020, print edition as &#39;Chip Firm Marvell Nears $10 Billion Merger.&#39;", "posttime": "2020-10-29 13:11:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,marvell,reach", "title": "消息人士：Marvell Technology接近达成以高达100亿美元收购半导体公司Inphi Corp.的交易，以帮助扩大其在网络领域的触角", "title_en": "Sources: Marvell Technology is nearing a deal to buy semiconductor company Inphi Corp. for as much as $10B, to help expand its reach in networking", "transed": 1, "url": "https://www.wsj.com/articles/marvell-nears-deal-to-buy-inphi-11603936620?mod=djemalertNEWS", "via": "", "real_tags": ["交易", "marvell", "reach"]}, {"category": "", "categoryclass": "", "imagename": "cbbddf3f487617d505e88b8e09cd9087.jpg", "infoid": 1031939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "业余无线电数字通信(ARDC)总裁证实，他们从亚马逊获得了1.08亿美元的400万个业余无线电TCP/IP地址。\n互联网网络44(44.0.0.0/8)名为AMPRnet™，自八十年代中期分配给业余无线电以来，业余无线电操作员一直使用该网络进行科学研究和试验无线电数字通信，目的是提高业余无线电联网的技术水平，并教育业余无线电操作员使用这些技术。\n业余无线电数字通信(ARDC)是加州成立的一家非营利性公司，目的是为了实现这些目标。\n2019年年中，ARDC将1600万个可用的AMPRnet™IP地址块(44.192.0.0/10)出售给了亚马逊，但直到现在才公布了售价。亚马逊为每个IPv4地址支付了27美元。\n“与亚马逊签订的涵盖出售我们剩余IP地址的保密协议要求我们对确切的美元金额保密，直到我们被法律要求在我们的年度纳税申报、审计和财务报告中披露这些金额。这些资料刚刚公之于众，并可通过加州总检察长的网站在线获取(因为ARDC是在加州注册成立的)。您还可以通过我们(独立编写的)维基百科文章获取一些背景信息。底线是，这笔交易为我们带来了约1.08亿美元的净收入，我们预计将根据我们的投资表现，持续*每年*至少拨款500万美元，用于各种互联网和业余无线电数字通信项目。到目前为止，我们已经获得了大约250万美元的赠款，所以我们才刚刚开始。“", "note_en": "President of Amateur Radio Digital Communications (ARDC) has confirmed they received $108 million from Amazon for 4 million amateur radio TCP/IP addresses\n Since its allocation to Amateur Radio in the mid-1980s, Internet network 44 (44.0.0.0/8), known as the AMPRNet™, has been used by amateur radio operators to conduct scientific research and to experiment with digital communications over the radio with a goal of advancing the state of the art of Amateur Radio networking, and to educate amateur radio operators in these techniques.\n Amateur Radio Digital Communications (ARDC) is a non-profit California corporation formed to further these goals.\n In mid-2019 a block (44.192.0.0/10) of approximately four million AMPRNet™ IP addresses, out of the 16 million available, was sold to Amazon by ARDC but it is only now that the sale price has been released. Amazon paid $27 for each IPv4 address.\n “The NDA with Amazon that covered the sale of our surplus IP addresses required us to keep the exact dollar amounts private until we were legally required to disclose them in our annual tax filings, audit and financial reports. These have just been made public and are available online through the California Attorney General’s website (since ARDC is incorporated in California). You can also get some background information through our (independently written) Wikipedia article.  The bottom line is that the sale netted us about US $108M, and we expect to grant at least US $5 million *per year* on an ongoing basis, depending on how our investments perform, to a wide variety of Internet and amateur radio digital communication projects. To date we have made about $2.5 million in grants, so we’re only getting started. ”", "posttime": "2020-10-29 13:04:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "业余,amateur,ip", "title": "出售业余AMPRnet TCP/IP地址筹集1.08亿美元", "title_en": "Sale of Amateur Radio AMPRnet TCP/IP Addresses Raised $108M", "transed": 1, "url": "https://www.icqpodcast.com/news/2020/10/25/sale-of-amateur-radio-amprnet-tcpip-addresses-raised-108m", "via": "", "real_tags": ["业余", "amateur", "ip"]}]