[{"category": "", "categoryclass": "", "imagename": "2f7d161ac33bdf91723bff2c2ebed556.jpg", "infoid": 1006790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有没有想过像人类这样的陆地动物是如何进化成比它们的水生祖先更聪明的？你可以感谢你所行走的这片土地。西北大学(Northwest University)的研究人员最近发现，复杂的景观-点缀着树木、灌木、巨石和小圆丘-可能有助于陆生生物进化出比它们的水生祖先更高的智力。\n与辽阔的空旷相比，土地上充斥着障碍和闭塞。通过为猎物提供藏身的空间，为捕食者提供偷袭的掩护，陆地上可能的栖息地可能有助于为其中许多动物制定规划策略-而不是基于习性的策略。\n但研究人员发现，规划并没有让我们的祖先在所有的景观中占据上风。研究人员的模拟显示，捕食者的感知存在着金发碧眼的障碍--不是太少也不是太多--在这一点上，规划的优势确实闪耀着光芒。在开阔的土地等简单的景观或茂密的丛林等拥挤的景观中，没有任何优势。\n领导这项研究的西北大学的马尔科姆·麦克弗(Malcolm MacIver)问道，所有动物--无论是在陆地上还是在水中--都有同样长的进化时间，那么为什么陆地动物的聪明程度最高呢？我们的研究表明，这不仅仅关乎头脑中的东西，也关乎环境中的东西。\n而且，不，海豚和鲸鱼不属于智力较低的海洋生物。两者都是最近(从进化上讲)回到水中的。\n这是MacIver进行的一系列研究中最新的一项，这些研究提出了计划能力是如何进化的理论。在与西北大学神经生物学教授丹·董贝克(Dan Dombeck)正在进行的后续研究中，麦克伊弗将通过在机器人可重构环境中对小动物进行实验来检验这项计算研究产生的预测。\n麦克弗是西北大学麦考密克工程学院的生物医学教授和温伯格艺术与科学学院的神经生物学教授。MacIver实验室的博士生乌古尔坎·穆根(Uurcan Mugan)是这篇论文的第一作者。\n在之前的工作中，麦克弗表明，当3.85亿年前动物开始入侵陆地时，它们获得了比在水中看得更远100倍的能力。麦克弗假设，作为捕食者或猎物，在能够看到更远的背景下，可能需要的不仅仅是在空旷的开阔水域中狩猎。然而，这项新研究的超级计算机模拟(在一台个人电脑上进行了35年的计算)显示，尽管更远的视野对于优势规划是必要的，但这还不够。取而代之的是，只有将长远的视野和景观与开阔区域和更密集的植被地带相结合，才能在规划方面取得明显的胜利。\n麦克弗说：我们推测，搬到陆地上对大脑的进化倾注了喷气燃料，因为这可能有利于最困难的认知操作：展望未来。这可以解释为什么我们可以出去吃海鲜，但是海鲜不能为我们出去。\n为了验证这一假设，MacIver和他的团队开发了计算模拟来测试在两种不同的决策策略下被捕食者积极猎杀的猎物的存活率：基于习惯的(自动的，比如输入你已经记住的密码)和基于计划的(想象几个场景并选择最好的一个)。研究小组创造了一个简单、开放的世界，没有视觉障碍来模拟一个水生世界。然后，他们添加不同密度的物体来模拟陆地。\n麦克弗说，在定义复杂认知时，我们区分了基于习惯的行动和计划。习惯的重要之处在于它是不灵活的，不依赖于结果。这就是为什么您在更改旧密码后仍要输入一段时间的原因。在计划时，你必须想象不同的未来，选择最好的潜在结果。\n在研究中考察的简单的水生和陆地环境中，无论是使用基于习惯的行动的猎物，还是那些有计划能力的猎物，存活率都很低。高度拥挤的环境也是如此，比如珊瑚礁和茂密的热带雨林。\n麦克弗说，在那些简单、开放或高度拥挤的环境中，规划没有任何好处。在开阔的水上环境中，你只需要朝相反的方向奔跑，并抱着最好的希望。而在高度拥挤的环境中，只有几条路可走，而且你无法制定战略，因为你看不到很远。在这样的环境下，我们发现计划并不能提高你的生存机会。\n然而，当成片的植被和地形点缀着类似于稀树大草原的广阔开阔区域时，模拟表明，与基于习惯的运动相比，规划会带来巨大的生存回报。因为计划增加了生存的机会，进化会选择大脑回路，让动物想象未来的场景，评估它们，然后制定一个场景。\nMacIver说，在斑驳的景观中，透明和不透明的空间区域和远程视野相互作用，这意味着你的动作可以向对手隐藏或暴露你的存在。&#34；Terra Firma变成了一个棋盘。每一个动作，你都有机会展开一项战略。\n有趣的是，他指出，当我们在近700万年前与黑猩猩一起脱离树上的生活时，大脑大小迅速增加了四倍，古生态学研究指出，我们入侵了斑驳的景观，类似于我们研究中强调的那些，是战略思维的最大回报。更多信息：具有长视觉范围的空间规划有利于在复杂的自然环境中逃避视觉捕食者，&#34；自然通讯(Nature Communications(。电话：10.1038/s4146720-16102-1", "note_en": "Ever wonder how land animals like humans evolved to become smarter than their aquatic ancestors? You can thank the ground you walk on.    Northwestern University researchers recently discovered that complex landscapes—dotted with trees, bushes, boulders and knolls—might have helped land-dwelling   evolve higher intelligence than their aquatic ancestors.\n  Compared to the vast emptiness of  , land is rife with obstacles and occlusions. By providing prey with spaces to hide and predators with cover for sneak attacks, the habitats possible on land may have helped give rise to planning strategies—rather than those based on habit—for many of those animals.\n  But the researchers found that planning did not give our ancestors the upper hand in all landscapes. The researchers&#39; simulations show there is a Goldilocks level of barriers—not too few and not too many—to a predator&#39;s perception, in which the advantage of planning really shines. In simple landscapes like open ground or packed landscapes like dense jungle, there was no advantage.\n  &#34;All animals—on land or in water—had the same amount of time to evolve, so why do land animals have most of the smarts?&#34; asked Northwestern&#39;s Malcolm MacIver, who led the study. &#34;Our work shows that it&#39;s not just about what&#39;s in the head but also about what&#39;s in the environment.&#34;\n  And, no, dolphins and whales do not fall into the category of less intelligent sea creatures. Both are   that recently (evolutionarily speaking) returned to water.\n    It is the latest in a series of studies conducted by MacIver that advance a theory of how   evolved the ability to plan. In a follow-up study now underway with Dan Dombeck, a professor of neurobiology at Northwestern, MacIver will put the predictions generated by this computational study to the test through experiments with small animals in a robotic reconfigurable environment.\n    MacIver is a professor of biomedical and   in Northwestern&#39;s McCormick School of Engineering and a professor of neurobiology in the Weinberg College of Arts and Sciences. Ugurcan Mugan, a Ph.D. candidate in MacIver&#39;s laboratory, is the paper&#39;s first author.\n     In previous work, MacIver showed that when animals started invading land 385 million years ago, they gained the ability to see around a hundred times farther than they could in water. MacIver hypothesized that being a predator or a prey in the context of being able to see so much farther might require more   than hunting through empty, open water. However, the supercomputer simulations for the new study (35 years of calculations on a single PC) revealed that although seeing farther is necessary to advantage planning, it&#39;s not sufficient. Instead, only a combination of long-range vision and landscapes with a mix of open areas and more densely vegetated zones resulted in a clear win for planning.\n  &#34;We speculated that moving onto land poured jet fuel on the evolution of the brain as it may have advantaged the hardest cognitive operation there is: Envisioning the future,&#34; MacIver said. &#34;It could explain why we can go out for seafood, but seafood can&#39;t go out for us.&#34;\n  To test this hypothesis, MacIver and his team developed computational simulations to test the survival rates of prey being actively hunted by a predator under two different decision-making strategies: Habit-based (automatic, such as entering a password that you have memorized) and plan-based (imagining several scenarios and selecting the best one). The team created a simple, open world without visual barriers to simulate an aquatic world. Then, they added objects of varying densities to simulate land.\n    &#34;When defining complex cognition, we made a distinction between habit-based action and planning,&#34; MacIver said. &#34;The important thing about habit is that it is inflexible and outcome independent. That&#39;s why you keep entering your old password for a while after changing it. In planning, you have to imagine different futures and choose the best potential outcome.&#34;\n  In the simple aquatic and terrestrial environments examined in the study, survival rate was low both for prey that used habit-based actions and those that had the capability to plan. The same was true of highly packed environments, such as coral reefs and dense rainforests.\n  &#34;In those simple open or highly packed environments, there is no benefit to planning,&#34; MacIver said. &#34;In the open aquatic environments, you just need to run in the opposite direction and hope for the best. While in the highly packed environments, there are only a few paths to take, and you are not able to strategize because you can&#39;t see far. In these environments, we found that planning does not improve your chances of survival.&#34;\n    When patches of vegetation and topography are interspersed with wide open areas similar to a savanna, however, simulations showed that planning results in a huge survival payoff compared to habit-based movements. Because planning increases the chance of survival, evolution would have selected for the brain circuitry that allowed animals to imagine future scenarios, evaluate them and then enact one.\n  &#34;With patchy landscapes, there is an interplay of transparent and opaque regions of space and long-range vision, which means that your movement can hide or reveal your presence to an adversary,&#34; MacIver said. &#34;Terra firma becomes a chess board. With every movement, you have a chance to unfurl a strategy.\n  &#34;Interestingly,&#34; he noted, &#34;when we split off from life in the trees with chimpanzees nearly seven million years ago and quickly quadrupled in brain size, paleoecology studies point to our having invaded patchy landscapes, similar to those our study highlights, as giving the biggest payoff for strategic thinking.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\t&#34;Spatial planning with long visual range benefits escape from visual predators in complex naturalistic environments,&#34;  Nature Communications (2020).  DOI: 10.1038/s41467-020-16102-1", "posttime": "2020-06-16 18:53:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,savanna,研究", "title": "在稀树草原般的景观中狩猎可能为大脑进化注入了喷气式燃料。", "title_en": "Hunting in savanna-like landscapes may have poured jet fuel on brain evolution", "transed": 1, "url": "https://phys.org/news/2020-06-savanna-like-landscapes-jet-fuel-brain.html", "via": "", "real_tags": ["可能", "savanna", "研究"]}, {"category": "", "categoryclass": "", "imagename": "2fbcc57d692c73be57b83e84715d99a5.png", "infoid": 1006789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德国官方新冠肺炎曝光通知应用。-Corona-Warn-App", "note_en": "The official COVID-19 exposure notification app for Germany. - Corona-Warn-App", "posttime": "2020-06-16 18:35:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,app,官方,tracing,warn", "title": "德国官方新冠肺炎联系方式追踪APP源代码", "title_en": "Source code of Germanys official covid-19 contact tracing app", "transed": 1, "url": "https://github.com/corona-warn-app", "via": "", "real_tags": ["代码", "app", "官方", "tracing", "warn"]}, {"category": "", "categoryclass": "", "imagename": "01ee91a7a99ced465831795709b15175.jpg", "infoid": 1006788, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第二次世界大战结束十年后，加拿大制造了一架喷气式飞机，将技术推向了极限。但它的消亡表明了为什么较小的国家很难在喷气式飞机时代竞争。\n冷战初期，加拿大决定设计制造世界上最先进的战斗机。\n加拿大以其崎岖的丛林飞机而闻名，能够在荒野中粗暴降落和令人毛骨悚然的起飞。从20世纪30年代末开始，这个北美国家也开始为盟军的战争努力制造英国设计的飞机。这些飞机中的许多都是战时的标志性设计，比如霍克飓风战斗机和Avro Lancaster轰炸机。\n雄心勃勃的加拿大政客和工程师对此并不满意。他们决定从战争期间建立的工厂和熟练劳动力中锻造出一个世界领先的飞机制造业。厌倦了制造别人设计的飞机，新一代加拿大领导人决心生产加拿大的设计。战后成立的加拿大飞机制造商Avro Aircraft是实现他们梦想的公司。\n从Avro更成熟的竞争对手的固定思维方式中解脱出来，该公司的工程师们能够研发革命性的喷气式战斗机、商用客机、飞碟，甚至是太空飞机。他们将加拿大置于新喷气式飞机时代的技术前沿。\n在这样做的过程中，这些工程师挑战了像加拿大这样的小国在当今高科技行业能取得什么成就的观念，尽管说服政客们为他们掏钱完全是一件更棘手的事情。\n然后箭出现了。1957年10月4日，14000人观看了多伦多郊区的一个大型机库的开放，展示了一架美丽的、大型的白色三角翼飞机。这架飞机是Avro Arrow拦截机。“箭”比今天的欧洲台风战斗机更长更宽，飞行速度接近2.0马赫(每小时1500英里，相当于协和式飞机的最大速度)，而且有可能飞得更快。这是加拿大以2.5亿加元(今天为1.58万亿美元)竞标成为航空超级大国。\n这个项目确实是开创性的。Avro的工程师被允许毫不妥协地制造一台破纪录的飞机。但加拿大人很快就会发现，超音速时代使得航空项目变得如此昂贵，以至于只有少数几个国家能够实施这些项目-不幸的是，加拿大不在其中。\nAvro飞机庆祝“加拿大1909-1959年动力飞行的第一个50周年”的广告刚刚印刷出来，1959年2月20日“黑色星期五”，位于多伦多郊区的Avro飞机工厂的扬声器响起。数以千计的工人听到公司总裁宣布“在渥太华扎克”(新当选的加拿大总理约翰·迪芬贝克)取消了整个“箭”计划。当天晚些时候，14,500名熟练男女失去了工作。这些工程师中的许多人加入了人才流失到美国的行列。由32名工程师组成的Avro团队在美国国家航空航天局(NASA)的阿波罗(Apollo)计划中扮演着关键角色，具有讽刺意味的是，该计划在将人送上月球的竞赛中击败了苏联。\n肯·巴恩斯(Ken Barnes)听到这个坏消息时，是制造这架革命性飞机项目的高级绘图员。像许多加拿大人一样，巴恩斯对取消Avro Arrow的决定感到震惊。当巴恩斯接到销毁蓝图的命令时，他把它们藏在地下室里。这些设计一直留在那里，直到巴恩斯的侄子在他死后发现了它们。去年，这一发现登上了加拿大各地的头条，并点燃了人们对另一个奇迹的希望，即可能有一架飞机不知何故逃脱了摧毁。\n如果大规模裁员是该公司的边缘政策，那么它并没有奏效。在一个震惊加拿大的举动中，Arrow原型的切割发生在这家沉默的工厂前面。这一时刻被捕捉到了一张颗粒状的黑白照片中，这张照片继续困扰着加拿大。三年后，Avro飞机公司将消失，总共损失约5万个工作岗位。\n加拿大航空航天博物馆馆长艾琳·格雷戈里(Erin Gregory)表示，你找不到其他国家有多少国家如此投资于从未服役的飞机。“对加拿大人来说，有一种错失机会的感觉。还有一种观点认为，我们是一个幅员辽阔的国家，人口很少，创新精神在许多领域都不同凡响，箭头就是其中之一。那是航空技术的巅峰时期，Avro是加拿大的高科技航空公司。然而，他们的政府挫败了他们。\n加拿大航天历史学家艾米·希拉·泰特尔(Amy Shira Teitel)说：“加拿大人并不是每晚都坐在那里重温箭的光辉岁月。”她著有“为太空而战：两名飞行员及其为女性太空飞行的历史性战斗”(Fighting for Space：Two Pilots and They History Battle for Women Spaceflance)一书。“但加拿大痴迷于加拿大，而”箭“是革命性的。这是一架与美国并驾齐驱的马赫2喷气式飞机，是加拿大制造的，安大略省马尔顿市制造。然后出现了一个奇怪的决定，在没有任何警告的情况下取消了它：‘我们没有把飞机卖给英国或美国，所以让我们毁了它，假装什么都没有发生。’“。\n加拿大有一个古老的笑话，说发生在美国的最好的事情就是取消了箭。许多加拿大人确实采取了下一步行动，并本能地将该计划的失败归咎于他们南方的友情。\n但是，争论和阴谋论隐藏了一个关键的事实。“高科技国防项目非常昂贵，”航空博客Hush-Kit的出版人乔·科尔斯(Joe Coles)说。如果没有贵国的大额保证订单，它们通常都是令人望而却步的。“。\n格雷戈里说：“当它被取消时，该项目的费用已经膨胀到令人震惊的2.5亿加元。”在20世纪50年代，这是一笔非同寻常的钱，特别是对于一个像加拿大这样的小国来说。考虑到还需要数百万美元，这是一个很容易削减的开支。\n箭头是建造它的独特公司的反映。Avro飞机诞生于英国在第二次世界大战前利用“影子工厂”分散飞机、坦克和其他武器装备生产的战略。在战争期间，该工厂生产了标志性的飞机，如霍克飓风和兰开斯特轰炸机。随着胜利的临近，加拿大政府部长CD Howe认为，利用这个机会建立加拿大飞机工业是“至关重要的”。Avro的工程师们奋起迎接挑战。1949年，C-102喷气式客机问世，这是加拿大的第一架喷气式飞机，北美的第一架客机，也是世界上第二架喷气式客机。一年后，他们推出了加拿大第一架-也是迄今为止唯一架批量生产的-喷气式战斗机CF-100 Canuck。\nAvro的保密特别项目组开创了像Avrocar这样的飞碟形状的垂直起降飞机。另一个小组正在研究太空门槛飞行器，将一个人带到太空边缘并返回。一架跨大西洋超音速客机的可行性研究在“箭”号被取消的时候已经准备好了。\n加拿大皇家军事学院(Royal Military College Of Canada)历史学教授兰德尔·瓦克拉姆(Randall Wakelam)表示，Avro既取得了令人难以置信的成就，也是该国成为航空强国的雄心壮志的核心。政府打算将加拿大从一个在英国或美国设计的小型飞机组装厂转变为与其他国家平起平坐的国际级制造商。\n渥太华的决定并不总是对制造商有帮助。1950年，当朝鲜入侵韩国时，冷战变得激烈起来。CD Howe要求Avro取消喷气式客机项目，优先制造Canuck。在箭的命运的一个预兆中，美国人对制造飞机的兴趣被忽视了，工人们切割了喷气式客机的原型。\n然后在1954年，加拿大皇家空军(RCAF)公布了对新战斗机的要求。“箭”赢了，但很快成长为一个复杂的项目，推动了科学知识的前沿，推动了Avro管理科学知识的能力，以及政府负担得起科学知识的能力。拦截机必须能够在50000英尺的高空飞行和开火，速度超过1.5马赫。它必须在北极恶劣的条件下运行，并能够进行这一要求的长距离飞行。\n为了实现这些目标，Avro的工程师们在飞机和使用实时遥测的导航计算机上创造了第一个非试验性的电传飞行控制系统(用计算机控制系统取代飞机的传统手动飞行控制系统)。他们在机身上使用了新材料，并在一家姊妹公司设计和制造了新的强大、轻便、超音速的易洛魁发动机。为了最大限度地利用其能力，拦截器催生了一种名为阿斯特拉(Astra)的新武器计划(昵称为天文数字昂贵的阿斯特拉)和一种新型导弹。\n“箭”是如此先进，以至于加拿大没有测试它的所有设施。取而代之的是，工程师们不得不使用美国的设施，如弗吉尼亚州兰利公园的国家航空咨询委员会(NACA)超音速研究中心。加拿大人和他们的飞机给他们的美国同事留下了深刻的印象-这是一张对人类未来产生持久影响的名片。1958年，美国国家航空航天局改名为美国国家航空航天局。\n科尔斯说：“箭是一种性能极高、技术含量极高的战斗机。”“它的设计者几乎没有做出任何妥协来降低成本，而且它在很大程度上是镀金的解决方案。”\n“箭”再创第一。这是工程师第一次使用生产工具而不是工程师手工制造如此复杂的飞机原型。这一过程意味着，从第一次绘制箭头到它的推出只有28个月的时间，到1959年2月，生产线已经投入使用。\n当扬声器在黑色星期五嘎嘎作响时，已经有五个飞行原型。还有一架安装了易洛魁发动机，几乎可以飞行，另有四架处于不同的组装状态。工厂里有生产飞机的大部分零部件。关于3马赫和5马赫高超声速版本的箭的提案正在起草中，还有一种零长度发射箭，它将从一个升高的发射台上向空中发射，就像科幻电视连续剧中的雷鸟1号一样。\nWakelam说：“在Diefenbaker做出他的决定之前，问题已经酝酿了很多个月，如果不是公开讨论的话。”“是继续还是放弃这个项目的问题，不仅是民族自豪感和技术进步的问题，也是就业经济学、有限的联邦预算、稀缺的市场和不断变化的威胁的问题。”\n与喷气式客机一样，迪芬贝克政府下令拆分所有原型，尽管美国提出购买所有完成的飞机，英国也要求使用部分飞机进行超音速飞行研究。Arrow项目的其他部分也进展不佳。政府已经取消了Astra系统。一台易洛魁发动机被提供给英国，以帮助其超音速客机项目。然而，尽管有商业利益，政府并没有继续这个项目。\n不过，美国国家航空航天局并没有浪费任何时间。在项目取消后的几个小时内，他们首先联系了Avro的工程师。他们选择的32名男子前往水星、双子座和阿波罗等项目工作。吉姆·张伯伦(Jim Chamberlain)，前技术设计负责人，领导了双子座任务，也是月球轨道会合(LOR)的主要倡导者之一。前高级应力工程师欧文·梅纳德(Owen Maynard)是负责登月舱设计的最主要的人。\n组成美国宇航局太空任务组的一大批工程师来自Avro，他们为美国宇航局的太空飞行中心奠定了基础，“艾米·希拉·泰特尔(Amy Shira Teitel)说。“加拿大人太谦虚了，不能说是我做的，但在阿波罗时代做出关键决定的很多人都是加拿大人。\n“我认为，如果没有这些大脑，登上月球看起来会非常不同。”\n阿波罗也不是他们任务的终点。Avro小组开始影响航天飞机计划和国际空间站。\n“黑色星期五”后不久，谣言开始传播，说一架箭被一名试飞员偷偷带到了安全的地方。通过比较Avro工厂外原型被摧毁的第一张照片和后来的照片，似乎RL-202原型已经消失了。也有目击者。住在工厂附近的加拿大作家琼·考尔伍德(JunCallwood)声称，在取消当天听到了一支箭从空中起飞的声音。1968年，战时英雄、箭项目负责人威尔弗雷德·柯蒂斯(Wilfred Curtis)空军元帅在接受采访时，当被问及是否有箭被走私到安全地带时，他拒绝回答。\n由于在英国发现了Arrow和其他文物的弹射座椅，“箭头”开始怀疑其中一架喷气式飞机是否被走私到了英国的安全地带。根据一份报告，这些发现反过来又促使一名目击者讲述了20世纪60年代在肯特郡皇家空军基地发生的一起事件，当时一架没有国家标志或注册的白色三角翼飞机降落。是箭吗？\n绘图员肯·巴恩斯(Ken Barnes)并不是唯一一名在“黑色星期五”走私出Avro或无价文件的Avro员工-也许，与其将这些文物视为有一支丢失的箭等待寻找的证据，他们加在一起就是一架失踪的飞机。\n在丢掉工作后，巴恩斯最终加入了为美国宇航局航天飞机设计机械臂的加拿大团队。\n科尔斯说：“归根结底，不管有些人怎么说，杀死箭的不是美国的压力。”“这是这架加拿大超级战斗机发人深省的预算要求。”\n然而，即使Arrow计划继续进行，Avro飞机也可能面临同样的命运。格雷戈里说：“你只需要想想你在亚利桑那州皮马市的‘骨场’看到的大量飞机就知道了。”“所有那些美国公司在整个冷战期间都在大量生产新的设计，因为它们是由政府提供合同的。美国负担得起，但我只是不知道加拿大政府能给Avro什么合同，把公司带到60年代、70年代和80年代。“。\n然而，加拿大战时愿景中的一个要素已经变成了现实。“加拿大拥有世界第五大航空工业，”格雷戈里补充说。\n通过在Facebook上为我们点赞加入100万未来粉丝，或者在Twitter或Instagram上关注我们。\n如果你喜欢这个故事，可以注册bbc.com每周专题时事通讯，名为“基本清单”(The Essential List)。精选BBC《未来》、《文化》、《职场生活》和《旅行》中的故事，每周五发送到您的收件箱。", "note_en": "A decade after the end of World War Two, Canada built a jet which pushed technology to its limits. But its demise showed why smaller nations found it difficult to compete in the Jet Age.\n In the early years of the Cold War, Canada decided to design and build the most advanced fighter aircraft in the world.\n Canada is well known for its rugged bush planes, capable of rough landings and hair-raising take-offs in the wilderness. From the late 1930s, the North American country had also started to manufacture British-designed planes for the Allied war effort. Many of these planes were iconic wartime designs like the Hawker Hurricane fighter and Avro Lancaster bomber.\n Ambitious Canadian politicians and engineers weren’t satisfied with this. They decided to forge a world-leading aircraft manufacturing industry out of the factories and skilled workforce built up during the war. Tired of manufacturing aircraft designed by others, this new generation of Canadian leaders were determined to produce Canadian designs. Avro Aircraft, the Canadian airplane maker created after the war, was the company that would deliver their dream.\n Freed from the set ways-of-thinking of Avro’s more established rivals, the firm’s engineers were able to work on revolutionary jet fighters, commercial airliners, flying saucers and even a space plane. They placed Canada at the technological cutting edge of the new Jet Age.\n In so doing, these engineers challenged notions of what small countries like Canada could achieve in the hi-tech industries of the day, even if convincing politicians to stump up the cash for them was an altogether trickier business.\n   Then came the Arrow. On 4 October 1957, 14,000 people watched a large hangar on the outskirts of Toronto open to reveal a beautiful, large, white, delta-wing aircraft. The plane was the Avro Arrow interceptor. A third longer and broader than today’s Eurofighter Typhoon, the Arrow could fly close to Mach 2.0 (1,500 mph, or the maximum speed of Concorde), and had the potential to fly even faster. It was Canada’s Can$250m (US$1,58bn today) bid to become an aviation superpower.\n The project was genuinely ground-breaking. Avro’s engineers had been allowed to build a record-breaker without compromise. But Canadians would soon discover that the supersonic age had made aviation projects so expensive that only a handful of countries could carry them out – and Canada, unfortunately, wasn’t one of them.\n The advert for Avro Aircraft celebrating the “first 50 years of powered flight in Canada 1909–1959” had only just been printed when on “Black Friday”, 20 February 1959, the loudspeaker of the Avro Aircraft factory on the outskirts of Toronto crackled to life. Thousands of workers heard the company president announce “that f------ prick in Ottawa” (the newly elected Canadian prime minister John Diefenbaker) had cancelled the entire Arrow programme. Later that day, 14,500 skilled men and women lost their jobs. Many of these engineers joined the brain-drain to the United States. The &#34;Avro group&#34; of 32 engineers playing critical roles in Nasa&#39;s Apollo programme, which – ironically – beat the Soviets in the race to land a man on the moon.\n  Ken Barnes was a senior draftsman on the project to build the revolutionary plane when he heard the bad news. Like many Canadians, Barnes was appalled by the decision to cancel the Avro Arrow. When Barnes was told to destroy the blueprints, he hid them in his basement. There the designs stayed until Barnes&#39;s nephew discovered them after his death. It was a revelation that made headlines across Canada last year and fuelled hopes of another miracle, that perhaps one of the planes had somehow escaped destruction.\n If the mass layoffs was an act of brinkmanship by the company, then it didn&#39;t work. In a move which shocked Canada, the cutting up of the Arrow prototypes took place in front of the silent factory. The moment was captured in a grainy black-and-white photograph which continues to haunt Canada. Three years later the Avro Aircraft company would be gone, with a total loss of around 50,000 jobs.\n &#34;You won&#39;t find many other countries that are so invested in an aircraft that never saw service,&#34; says Erin Gregory, curator of the Canada Aviation and Space Museum. “For Canadians, there is a sense of missed opportunities. Then there&#39;s the idea that we are a vast country with a small population and an innovative spirit that punches above its weight in many areas and the Arrow was one of those. It was the height of aviation technology, and Avro was the high-tech aviation firm in Canada. Yet, their government foils them.&#34;\n  “Canadians aren’t sitting around every night reliving the glory days of the Arrow,” says Amy Shira Teitel, a Canadian spaceflight historian and author of Fighting for Space: Two Pilots and Their Historic Battle for Female Spaceflight. “But Canada is obsessed with Canadiana, and the Arrow was revolutionary. It was a Mach 2 jet on par with the United States, and it was Canadian, made in Malton, Ontario. Then there was the weird decision to cancel it with no warning: ‘We failed to sell the plane to either Britain or the United States, so let’s destroy it and pretend it never happened.’”\n There is an old Canadian joke that says the best thing that happened to America was the cancellation of the Arrow. Many Canadians did make the next step and instinctively blame their southern &#39;frenemy&#39; for the failure of the programme.\n But the controversy and conspiracy theories hid a critical truth. “Hi-tech defence projects are very expensive,” says Joe Coles, publisher of Hush-Kit, an aviation blog. &#34;Without a large guaranteed order from your nation, they are usually prohibitively so.”\n “By the time it was cancelled, the cost of the programme had ballooned to an astonishing Canadian $250m,” says Gregory. &#34;That was an extraordinary amount of money in the 1950s, especially for a country as small as Canada. Given that millions of more dollars were still needed, it was a pretty easy cut to make.&#34;\n  The Arrow was a reflection of the unique company that built it. Avro Aircraft was born of the British strategy of using “shadow factories” to disperse the production of planes, tanks and other armaments in the build-up to World War Two. During the war, the factory produced iconic aircraft such as the Hawker Hurricane and the Lancaster bomber. With victory approaching, the Canadian government minister CD Howe believed it was of “utmost importance” to use this opportunity to establish a Canadian aircraft industry. Avro’s engineers rose to the challenge. In 1949 came the  C-102 Jetliner, Canada’s first jet plane, North America’s first passenger jet, and the world&#39;s second jet airliner. One year later they rolled out Canada’s first – and so far, only mass-produced – jet fighter, the  CF-100 Canuck.\n Avro’s hush-hush Special Project Group pioneered flying saucer-shaped vertical take-off and landing aircraft like the  Avrocar. Another group was working on the  Space Threshold Vehicle to take a man to the edge of space and back. A feasibility study for a supersonic transatlantic airliner was ready by the time of the Arrow&#39;s cancellation.\n  &#34;Avro was both incredible in its achievements and central to the nation&#39;s aspirations to become an aeronautical powerhouse,&#34; says Randall Wakelam, a history professor at the Royal Military College of Canada. &#34;The government intended to take Canada from being a small-time assembler of aircraft designed in the UK or US to become an international-level manufacturer the equal of other nations.&#34;\n Ottawa’s decisions didn’t always help the manufacturer. In 1950 the Cold War turned hot when North Korea invaded the South. CD Howe demanded that Avro cancel the Jetliner project and prioritise the manufacture of the Canuck. In a foreshadowing of the fate of the Arrow, American interest in manufacturing the plane was ignored and workers cut up the Jetliner prototype.\n  Then in 1954, the Royal Canadian Air Force (RCAF) published requirements for a new fighter. The Arrow won, but quickly grew into a complex project that pushed forward the edge of scientific knowledge, Avro’s ability to manage it and the government’s ability to afford it. The interceptor had to be able to fly and fire at 50,000ft and speeds over Mach 1.5. It had to be to operate in the harsh conditions of the Arctic and be able to fly the long distances that this required.\n To achieve these goals, the Avro engineers created the first non-experimental fly-by-wire control system (a system that replaces the conventional manual flight controls of an aircraft with a computer-controlled system) in an aircraft and a navigational computer that used real-time telemetry. They used new materials in its airframe, and, at a sister company, designed and built the new powerful, lightweight, supersonic Iroquois engine. To make the most of its capabilities, the interceptor spawned a new weapons programme called Astra (nicknamed &#34;Astronomically Expensive&#34;), and a new missile.\n The Arrow was so advanced that Canada didn&#39;t have all the facilities for testing it. Instead, the engineers had to use facilities in the USA such as the National Advisory Committee for Aeronautics (NACA) supersonic research centre at Langley Park, Virginia. The Canadians and their aircraft impressed their American colleagues – a calling card that had lasting consequences for the future of humanity. In 1958 NACA became Nasa.\n “The Arrow was an extremely high-performance, hi-tech fighter,” says Coles. “Its designers had made very few compromises to keep its costs down, and it was very much the &#39;gold-plated&#39; solution.”\n  The Arrow achieved another first. It was the first time that engineers built prototypes of such a sophisticated aircraft using production tooling rather than handmade by engineers. This process meant that it was a mere 28 months from the first drawing of the Arrow to its rollout, and by February 1959 the production line was up and running.\n By the time the loudspeaker crackled into life on Black Friday, there were five flying prototypes. There was another fitted with an Iroquois engine nearly ready to fly and another four in various states of assembly. In the factory were the majority of parts for the production aircraft. Proposals for a Mach 3 and a hypersonic – Mach 5 – version of the Arrow were on the drawing board, as was a &#34;zero-length launch Arrow&#34;, which would blast into the air from a raised launch pad like Thunderbird 1 from the science fiction television series.\n “Problems had been brewing, if not publicly discussed, for many months before Diefenbaker made his decision,” says Wakelam. “The issue of whether to keep going or abandon the project was caught in the warp and weft not only of national pride and technological advancement but also in the economics of jobs, limited federal budgets, scarce markets and shifting threats.”\n  As with the Jetliner, Diefenbaker’s government ordered all the prototypes broken up despite the offers from the United States to buy all the completed planes, as well a request from Britain to use some of the aircraft for research into supersonic flight The rest of the Arrow project fared no better. The government had cancelled the Astra system already. One Iroquois engine was given to Britain to help its supersonic airliner project. Yet, the government didn&#39;t pursue the project, despite commercial interest.\n However, Nasa didn’t waste any time. They first approached Avro’s engineers within hours of the project’s cancellation. The 32 men they chose went to work on projects like Mercury, Gemini and Apollo. Jim Chamberlain, ex-chief of technical design, led the Gemini mission and was one of the leading advocates for the Lunar Orbit Rendezvous (LOR). Owen Maynard, a former senior stress engineer, was the man most responsible for the design of the Lunar Module.\n  A huge contingent of the engineers who made up Nasa&#39;s Space Task Group were from Avro, and they laid the foundation for Nasa’s Spaceflight Center,” says Amy Shira Teitel. “Canadians are way too modest to say I did it, but a lot of the people who made the critical decisions in the Apollo-era were Canadian.\n “I think getting to the Moon without those brains would have looked very different.”\n Apollo wasn’t the end of their mission either. The Avro group went onto influence the Space Shuttle programme and the International Space Station.\n Not long after “Black Friday”, rumours started to spread that an Arrows had been smuggled to safety by one of the test pilots. By comparing the first pictures of the destruction of the prototypes outside of the Avro factory with later ones, it appeared that prototype RL-202 had disappeared. There were witnesses as well. Canadian writer, June Callwood, who lived near the plant, claimed to hear an Arrow taking off the day of its cancellation. Then in 1968, Air Marshall Wilfred Curtis, a wartime hero and the man in charge of the Arrow programme refused to answer when asked in an interview if an Arrow had been smuggled to safety.\n  Fuelled by the discovery of ejector seats from the Arrow and other artefacts in the United Kingdom, “Arrowheads” started to wonder if one of the jets had been smuggled to safety in the United Kingdom. These discoveries, in turn, prompted according to one report, an eyewitness to recount an incident at an RAF base in Kent in the 1960s when a white delta-wing aircraft with no national markings or registration landed. Was it the Arrow?\n Draughtsman Ken Barnes wasn’t the only Avro employee who smuggled out a piece of the Avro or priceless document on “Black Friday” – and, perhaps, rather than seeing these artefacts as evidence that there is a lost Arrow waiting to be found, together they add up to a missing aircraft.\n After losing his job, Barnes eventually ended up on the Canadian team which designed the robotic arm for Nasa’s Space Shuttle.\n “In the end, despite what some may say, it wasn’t US pressure that killed the Arrow,” says Coles. “It was the sobering budgetary requirements of this Canadian super-fighter.”\n  Yet, Avro Aircraft may have faced the same fate even if the Arrow programme had continued. “You just need to think about the vast number of aircraft you see at the ‘boneyard’ in Pima, Arizona,” says Gregory. “All those American firms were churning out new designs all through the Cold War because they were fed contracts by the government. The United States can afford that, but I just don’t know what contract the Canadian government could have given to Avro to have carried the company into 60s, 70s and 80s.”\n Yet, one element of Canada’s war time vision has been turned into reality. “Canada has the fifth largest aerospace industry in the world,” Gregory adds.\n  Join one million Future fans by liking us on    Facebook , or follow us on    Twitter  or     Instagram .\n If you liked this story,    sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from BBC Future, Culture, Worklife, and Travel, delivered to your inbox every Friday.", "posttime": "2020-06-16 18:35:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "徘徊,arrow,飞机", "title": "Avro Arrow-仍在一个国家徘徊的破纪录喷气式飞机", "title_en": "Avro Arrow – The record-breaking jet which still haunts a country", "transed": 1, "url": "https://www.bbc.com/future/article/20200615-the-record-breaking-jet-which-still-haunts-a-country", "via": "", "real_tags": ["徘徊", "arrow", "飞机"]}, {"category": "", "categoryclass": "", "imagename": "ddb1f3b0341b8b8dcb664b6cce65ff4a.png", "infoid": 1006786, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你对无代码运动感兴趣，你可能听说过本·托塞尔的名字。但今天我们在这里不是要谈论Makerpad，这是一个领先的无程序员社区，而是关于Ben之前的项目。我们想知道哪里出了问题，吸取了什么教训，以及后来他是如何取得成功的。\n你能给我们介绍一下你的背景吗？你目前在做什么？\n几年前，我曾经领导过这个社区的Product Hunt，我想建立我自己的项目。我有点沉迷于没有代码的工具，发现我可以用它们来构建东西，然后把它们放在一起，这样它们就会感觉、看起来和工作起来都像真正的软件。从那时起，我基本上在一年内创建了几个项目来自己测试。快进，我发现了Makerpad，这也是我目前正在研究的。我们于2019年1月开始。这是一个学习社区，我们在这里教人们如何在不需要编码的情况下构建软件产品。\n你是怎么想到要建新公司的？其背后的动机是什么？\n我当时正试图启动“产品猎人”的项目，所以当我离开的时候，我有一个项目要做。我尝试了很多想法，人们似乎都很感兴趣，但实际上没有人付钱，也没有人买过任何东西。我发现人们的兴趣来自于我如何将这些项目与Typeform、Carrd和Zapier放在一起，让它看起来像是一个真正的服务，一个真正的产品。\n我的电子邮件列表上有1500-2000个人，但没有人为我的任何项目付费。我又回到了绘图板上。我看到一些独立黑客的截图公司，比如GoRails。他们每个月赚15000美元。那么，为什么我不拍摄我自己创作的东西，然后人们就可以付费并获得这些东西的使用权呢？我给我的电子邮件订户发了信息，告诉他们我要做一些视频教程。15个人付了钱。我需要成立一家公司，我给它取名为newco，因为我想不出一个名字。它基本上是一个Webflow站点，有一个指向支付页面的链接，这是另一个Carrd站点。当人们付钱时，我用电子邮件给他们发了一个名为“积极香蕉”的密码。您可以使用它访问Webflow上的受保护页面，然后访问教程。\n我真的不知道我在做什么。我只是在推特上说这是我做的很酷的东西。就这些了。\n新来的，谁来了？在创业领域度过了充满挑战的过去18个月后，我决定回到我最擅长的领域……。在没有代码的情况下构建小型项目。(也要帮助其他人做到这一点！)。https://t.co/Ssq90KnYfn https://t.co/yC68ryd9aF\n-Ben Tossell(@bentossell)2018年5月17日。\n我甚至不记得有没有一个社区。可能有一个松弛社区，因为大多数制造商都有一个。我试着在黑客新闻(Hacker News)和红迪(Reddit)上发布了一些东西，但这些东西哪儿也没去过，人们只是在那里对我大喊大叫。但对我来说，推特似乎总是比其他平台更容易被接受。\n当我在Product Hunt上发布时，其中一条评论指出，这个想法真的很酷，但这个家伙非常乏味。在那段时间里，我正在做视频教程。我不知道我在做什么。我只是在录制并试着按照剧本来做。这比人们想象的要难得多，涉及的内容也多得多。我可能没有尽到足够的努力来制作一部真正好的作品，但我正在观察它的发展方向。\n那时候，我还抱着这样的想法：每一家创业公司每周都要增长10%，然后你就会去Y Combinator。然后你得到风投的资助，这将会成为一件大事。我通过“独立黑客”(Indie Hacker)看到其他初创公司靠自己做得很好，但增长速度较慢，我想通过这种方式做到这一点。为了搭建这个平台，我请到了我的一个朋友穆巴沙尔·伊克巴尔(Mubashar Iqbal)，他建造了很多东西。他是一个技术人员，也是一个多产的制造者。我想以一种可以扩展的方式建造它，这还为时过早。没有必要那样做。\n我在追求我认为正确的东西，而不是听人们喜欢的东西。\n很快，我就没有意识到我们的产品是我们想要做的。我真的不确定我卖的是什么，我是怎么卖的，或者我卖给了谁。有一些视频，但实际上我们有另一个功能，我们正在尝试公司注册。我们在同一时间做了太多的事情，事情变得有点混乱。几个月后，我觉得我需要关闭它，因为我不知道这个平台会变成什么样子。\n承诺每周一次的放映是一件很重要的事情，当动力从缓慢的增长中下降时，这可能是一个更艰难的要求！\n截至2018年6月底，我们拥有90名付费客户。当时，这很酷，我想我就靠这个过日子吧。但是我也会在这里和那里做一些咨询。不幸的是，由于终生付款，8K美元的总销售额仅相当于约700美元的MRR。我在付款时使用的是集成了条纹的Typeform，所以这实际上不是经常性的会员费。\n没有，因为我们从中赚了一些钱。实际上，我没有付钱给穆巴沙尔，因为他是我的朋友。他做的一切都是免费的，而且他总是和人们一起做项目。我很幸运，情况就是这样。否则，所有的钱都会流向开发商来建造它。但我没有失去任何东西，因为它实际上就是我坐在那里创作。\n如果你有机会重新开始，你会用不同的方式做什么？\n我确实有机会用Makerpad重新开始。在关闭Newco之后，我离开了三个月，和我的女朋友一起旅行，想知道我们要做什么。旅行时，我读了保罗·贾维斯的书“一个人的公司”。我了解到，还有其他人自己创办了初创公司，并从中获得了丰厚的生活。\n有些东西在和新闻公司合作。人们真的很喜欢学习如何做无代码的事情。假设是这样，我继续使用无代码教育服务。我用和newco一样的视频推出了Makerpad。人们必须为访问视频付费。\n在看了newco发生的事情后，我了解到你应该忘记所有平台的东西。这是我自己建造的，这是我维修它的更简单的方式。\n做得太多是不好的-做一些简单就可以做的复杂的事情-尽早创建一个独特的平台-承诺一个不切实际的产出-提供太多的赚钱方式(计划，各种各样的东西)我在建设新公司时犯了这些错误。\n-Ben Tossell(@bentossell)2019年1月21日。\n从你从这次经历中得到的所有收获中，你会给其他想要开始或刚刚开始他们的项目的企业家提供什么建议呢？\n人们对经营什么样的企业的最终目标考虑得很多，而对于他们试图建立的目标似乎并不现实。这对你来说是不是每月2万美元的收入，而且你不需要管理任何员工？这是一个很好的处境。我的想法是，如果我有1000个客户，客户支持将比只有一个客户差1000倍。我为我的客户做事情的方式就是确保这是一件有趣的事情。我每天都要生产新产品。有些人认为你必须推出一些非常大的东西。你需要做所有这些没有规模的事情。即使你不喜欢，你也要和人们交谈。\n我的第一个百万播客，由沙恩·普里和山姆·帕尔完成。这是一种让你思考想法和不同类型商业模式的绝佳方式。你还可以得到他们的建议，以改善你目前的业务。\n书名/作者声明：[font=宋体]Trends.vc by Dru Riley。它深入不同的市场，比如在线课程、增长工具和付费社区。每份报告都有很多真知灼见，绝对值得！", "note_en": "If you are interested in the no-code movement, you’ve probably heard Ben Tossell’s name. But today we’re not here to talk about Makerpad, one of the leading communities for no-coders, but about Ben’s previous project. We want to know what went wrong, what were the lessons learned and how it lead to his success afterwards.\n  Can you tell us a bit about your background and what are you currently working on?\n I used to lead the community on  Product Hunt a few years ago and wanted to build my own projects. I sort of fell down into the no-code tools and found out that I could build stuff using them and putting them together so they&#39;ll feel, look, and work like real software. From there, I basically created a few projects in a year to test things on my own. Fast forward through those I came to found  Makerpad, which is what I&#39;m currently working on. We started in January 2019. It&#39;s a learning community, where we teach people how to build software products without needing to code.\n  How did you come up with the idea of building newCo? What was the motivation behind it?\n I was trying to launch projects on Product Hunt, so when I left I had a project to work on. I tried many ideas and people seemed to be interested but no one actually paid for anything, no one ever bought anything. I found out the interest came with how I was putting these projects together with  Typeform,  Carrd, and  Zapier to make it feel like it was a real service, a real product.\n I had like 1500-2000 people on the email list, but no one paid for any of my projects. I went back to the drawing board. I saw some screencasting companies on  Indie Hackers like  GoRails. They were making $15,000/month. So, why don&#39;t I film myself creating stuff, and then people can pay and get access to that? I messaged my email subscribers telling them I was going to do some video tutorials. 15 people paid. I needed to set up a company and I called it newCo because I couldn&#39;t think of a name. It was basically a  Webflow site with a link to a payment page, which was another Carrd site. When people paid, I emailed them a password which was called  &#34;positivebananas&#34;. You use that to get to the protected page on Webflow and then you get access to the tutorials.\n   I didn&#39;t really know what I was doing. I was just tweeting stuff saying this is a cool thing I built. That was all of it.\n newCo, who dis?  After a challenging past 18 months in startup-land, I&#39;ve decided to go back to what I do best...  Building mini-projects without code. (and helping others do this too!) https://t.co/Ssq90KnYfn https://t.co/yC68ryd9aF\n— Ben Tossell (@bentossell)  May 17, 2018\n I can&#39;t even remember if there was a community. There probably was a Slack community because most makers had one. I tried posting stuff on Hacker News, which never went anywhere, and stuff on Reddit, where people just shouted at me. But for me, Twitter always seems to be more well-accepted than other platforms.\n   When I launched on Product Hunt, one of the reviews pointed out that this idea is really cool, but the guy is dreadfully dull. During that time I was doing video tutorials. I didn&#39;t know what I was doing. I was just recording and trying to follow a script. It&#39;s a lot more difficult than people think, a lot more goes into it. I probably wasn&#39;t doing enough to make a really good production, but I was seeing where it was going.\n At that time, I was still in the mindset of every startup has to grow 10% every week and then you go to  Y Combinator. Then you get funded by VCs and it&#39;s got to become a huge thing. I saw other startups through Indie Hackers that were doing well by themselves growing at a slower pace and I wanted to do it that way. To build the platform, I got a friend of mine,  Mubashar Iqbal, who builds tons of things. He&#39;s a technical guy and a prolific maker. I wanted to build it in a way that could scale, which was far too early. There was no need to be doing that.\n I was chasing what I thought was the right thing rather than listening to what people enjoyed.\n Soon enough, I didn&#39;t recognize our product as what we were trying to do. I was not really sure what I was selling, how I was selling it, or who I was selling it to. There were some videos, but actually we got another feature that we were trying companies to sign up for. We were doing too many things at the same time and it became a bit of a mess. After a few months, I felt that I needed to shut it down, as I didn&#39;t know what the platform was becoming.\n Promising weekly screencasts is a big thing to do and when motivation is down from the slow growth, it can be an even tougher ask!\n  We had 90 paying customers by the end of June 2018. At the time, it was cool and I thought I&#39;ll just live off that. But I will also do some consulting here and there. Unfortunately, $8k in total sales only equated to ~$700 MRR because of lifetime payments. I was using Typeform with Stripe integrated for the payments, so it wasn’t actually a recurring membership fee.\n   None, because we made some money from it. Actually, I didn&#39;t pay Mubashar as he is my friend. He did all for free and he always does project stuff with people. I was very lucky that was the case. Otherwise, all of that money would have gone to a developer to build it. But I didn&#39;t lose anything because it was literally just me sitting there creating.\n If you had the chance to start over, what would you do in a different way?\n I did have the chance to start it over with Makerpad. After shutting down newCo, I went away for three months, traveling with my girlfriend to figure out what we were going to do. While traveling, I read the book  &#34; Company of One&#34; by Paul Jarvis. I learned that there were other people building startups by themselves and had a great living from it.\n There was something working with newCo. People really liked learning about doing no-code stuff. Assuming that, I kept going with a no-code education service. I launched Makerpad with the same videos I had at newCo. People had to pay for accessing the videos.\n After looking at what happened with newCo, I learned that you should forget all the platform stuff. I built it myself and that was the easier way for me to service it.\n Doing too much is bad  - Building something complex when simple will do - Creating a unique platform early - Committing to an unrealistic output - Offering too many ways to get paid (plans, various packages of things)  I made these mistakes building newco\n— Ben Tossell (@bentossell)  January 21, 2019\n From all your takeaways you&#39;ve got from this experience, what advice would you give other entrepreneurs who want to get started or are just starting out with their projects?\n People think a lot about the end goal of what kind of business and don&#39;t seem to be realistic about what they&#39;re trying to build. Is it a $20,000/month revenue for you and you don&#39;t have to manage any employees? That&#39;s a great situation to be in. What I thought was if I have 1,000 customers, customer support will be 1,000 times worse than having one customer. And the way I&#39;ve done things for my customers was to just make sure that it was a fun thing. I got to build new products every day. Some people think that you have to launch something that is really big. That you need to do all these things that don&#39;t scale. That you have to talk to people even if you don&#39;t like it.\n   My First Million podcast by  Shaan Puri and  Sam Parr. It&#39;s an awesome way to get you thinking about ideas and different types of business models. You could also get their advice for improving your current business.\n Trends.vc by  Dru Riley. It&#39;s a deep dive into different markets like online courses, growth tools, and paid communities. Lots of insights into each report, totally worth it!", "posttime": "2020-06-16 18:17:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生意,business,东西", "title": "为什么做得太多会让一家价值6000美元的mr生意关门大吉？", "title_en": "How doing too much made a $6k MR business shut down", "transed": 1, "url": "https://phoenixdown.co/focusing-many-fronts-business-shutdown/", "via": "", "real_tags": ["生意", "business", "东西"]}, {"category": "", "categoryclass": "", "imagename": "4b0667d21f111639e566c672f47d6973.png", "infoid": 1006785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是一对双胞胎的全职妈妈，以前是一名科学家。我花了很多时间通过玩耍来教我的双胞胎，我最挣扎的部分是活动前的长时间准备。通常是这样的：我跑来跑去试着准备，我的孩子们会厌倦把我准备的东西弄得乱七八糟或不准备好，或者他们会互相争执-在我长期的准备工作之后，对方哭着结束了，对做实验不感兴趣。正如你可以想象的，这对我和我的孩子来说是令人沮丧的。\n然后，我试着和我的孩子们一起看有科学活动的YouTube视频。我们的想法是，我们将一起观看视频，并按照他们的指示设置和播放我们自己的科学活动！我想，如果他们参与准备，那会很棒，因为他们不会感到无聊或沮丧。我希望我们最终都会以积极的态度和愿意做实验的态度结束。但是我们也没有做到这一点！我们找到的视频是：\n需要太多或太复杂的物品，而这些物品通常是我们家里没有的，或者。\n我们最终会搜索和观看大量的YouTube视频来寻找可做的事情，当我们找到它的时候，我们都会感到疲惫和无聊。\n我决定自己动手，创造我正在寻找的东西：快速视频，用简单的科学活动吸引年轻观众(2-7岁)，使用家居用品。\n我制作了一个YouTube频道，里面有专门为父母和年幼孩子设计的视频，供他们一起观看。这是一个频道，在这里你可以和你的孩子一起准备和玩简单，有趣的STEM活动，使用家居用品。鼓励孩子们自己准备活动对双方都有好处：父母和孩子。父母避免了长时间的准备，孩子们学会了遵循简单的指示：这是生活中的一项有用的技能！\n例如，这种剪纸工艺在小孩子中很受欢迎，尽管很基础，但非常有教育意义。它帮助幼儿获得空间知识并理解对称的概念。此外，他们还可以练习剪刀技巧！每次孩子重复这个实验，都会产生一个独特的结果，这让它变得超级吸引人，非常有趣，而且他们自己可以做的事情！你可以谈论所有的形状，给它上色，或者把它贴到不同的纸上，创造出一张漂亮的对称卡片。\n把我四岁的双胞胎包括在我们每周的科学活动的准备中，解决了很多争论，实际上让我们玩并热爱科学活动和实验。如果你有机会和你的孩子们一起试用我的视频，我很有兴趣知道进展如何。让我知道，问我问题&并保持联系！", "note_en": "I am a stay at home mum of twins &amp; previously a scientist . I spend many hours trying to teach my twins through play and the part I struggled the most, is the  long preparations before an activity. It would usually go like this: I run around trying to prepare, my kids would be bored making messes or un-preparing what I prepared OR they would argue with each-other ending up in tears and uninterested to do the experiment after all my long efforts of preparation. As you can imagine, this was discouraging for myself and my children.\n Then, I tried watching Youtube videos with science activities together with my kids. The idea was that we will be watching the videos together, and follow their instructions to setup and play our own science activities! I thought that if they participate in the preparation, it would be great as they won’t get bored or upset. I hoped that we would all end up with positiveness and willingness to do the experiments after-all.  But we failed to this as well! The videos we found were:\n Requiring too many or complicated items that we usually didn’t have at home OR\n We would end up searching and watching tons of Youtube videos to find something to do, and by the time we found it, we would all be tired and bored.\n I decided to take matters on my own hands and create what I was looking for: Quick videos, engaging for young audience (2–7 Year Olds) with easy science activities that use household items.\n I did a Youtube channel with videos designed especially for parents and young kids to watch together. Its a channel where you can follow along, together with your child, to prepare and play easy, fun, STEM activities using household items. Encouraging kids to prepare their own activities is benefiting both: parents and children. Parents avoid long preparations and kids learn to follow simple instructions: a useful skill in life!\n For example, this  paper cutting craft was very popular wth young kids and even though basic, very educational. It helps young children gain spatial knowledge and understand the concept of symmetry. Additionally, they get to practice their scissor skills! Every time a child repeats the experiment, a unique result is produced, which makes it super engaging, fun and something they can do on their own! You can talk all about shapes and color it or stick it to a different paper creating a beautiful symmetrical card.\n  Including my four year old twins in the preparation of our weekly science activities solved lots of arguments and actually made us play and love science activities and experiments . If you get to try out my videos with your kids, I would be interested to know how it goes. Let me know, ask me questions &amp; stay connected!", "posttime": "2020-06-16 18:16:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教师,science,孩子", "title": "如何向幼儿园教师传授科学知识", "title_en": "How to Teach Science to Kindergarteners", "transed": 1, "url": "https://medium.com/@marialarkworthy/science-activities-for-young-kids-73c48c179ea1", "via": "", "real_tags": ["教师", "science", "孩子"]}, {"category": "", "categoryclass": "", "imagename": "68ed53bc3a5f4bdc4400885739dbb198.jpg", "infoid": 1006782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电子邮件掌握着通往王国的钥匙。您所有的密码重置都是通过电子邮件进行的，放弃旧域名会让攻击者很容易重新注册旧域名并获取您的东西。\n安全研究员Gabor Szathmari指出，对于合伙企业经常形成、解散和合并的律师事务所来说，这个问题尤其严重。合并或收购通常涉及新公司的新品牌，并使用新的域名进行匹配，或者被收购的公司放弃旧的品牌和域名。让这些旧域名过期是危险的。\n萨特马里写道，在美国，2017年是顶级律师事务所并购创纪录的一年，全年有102宗合并或收购，在小型律师事务所层面，这一数字可能会达到数千起。\n为了测试问题到底有多严重，Szathmari为几家合并后的律师事务所重新注册了旧域名，设置了一台电子邮件服务器，在没有黑客攻击的情况下，他说他收到了源源不断的机密信息，包括银行通信、其他律师事务所的发票、客户的敏感法律文件，以及来自LinkedIn的更新。(Szathmari正在努力将受影响的域名归还给它们的原始所有者。)。\n他说，同样的技术很容易被用来实施欺诈。他在写给CSO的一封电子邮件中写道，通过恢复以前在废弃域名上运营的在线网店，不良分子可以从Archive.org下载原始网页，然后通过伪装成功能齐全的网店接受新的订单和付款。&#34；他在给CSO的一封电子邮件中写道，坏人可以从Archive.org下载原始网页，然后假扮成功能齐全的网店接受新的订单和付款。\n他补充说，如果以前的网店有CRM系统或MailChimp进行营销活动，犯罪分子可以通过重新设置基于电子邮件的密码来接管这些账户，从而访问以前客户的名单。他们可以向他们提供一个特殊的折扣代码，以鼓励他们提交永远不会发货的订单。天空是极限。\n即将到期的域名由域名注册机构以域名删除列表的形式每天发布。不需要犯罪策划者每天下载这些名单，并将它们与相关行业酒吧的并购新闻进行交叉对照，或者只是重新注册任何他们喜欢的域名。\nSzathmari还能够使用重新注册的域名通过haveibeenpwned.com和SpyCloud.com访问第三方攻破密码。这两项服务都需要域名验证，一旦您拥有有问题的域名，就很容易绕过这一防御措施。由于密码重复使用仍然猖獗，Szathmari写道，他本可以很容易地使用这些第三方密码来危害受影响的员工，包括他们的商业和个人生活。\n安全总比后悔好。域名并不贵，而保留旧域名是你购买过的最便宜的网络安全保险单。\nSzathmari建议建立一个包罗万象的电子邮件服务，将所有收到的电子邮件重定向到值得信任的管理员，这个管理员可以查看写给前任和现任员工的信件，以及在线服务的密码重置电子邮件。\n子域劫持是指攻击者接管一个子域，例如subdomain.youdomain.com。当域所有者关闭在子域上运行的服务，并且忘记更新继续指向不存在的服务的DNS子域记录时，通常会发生这种情况。\n今年早些时候，微软犯下了这个新手错误，未能确保垃圾邮件发送者用来推广在线扑克赌场的两个子域的安全。如果微软，一家成熟的专注于安全的软件制造商，能够犯下这个错误，那么您的组织很可能也会犯同样的错误。\n常见的子域接管事件涉及组织将子域设置为指向第三方服务，例如GitHub Pages、Heroku或Shopify。例如，如果您的组织稍后终止该服务并删除其GitHub Pages帐户，则攻击者可以重新注册该GitHub Pages帐户(因为它现在对所有用户都可用)，并在subdomain.youdomain.com上发布他们喜欢的任何内容。\n任何花哨而昂贵的安全工具都不能阻止次要的接管，只有组织的合作才能阻止。谁管理贵公司的DNS？谁批准将子域用于支持票务或电子商务或填空？当子域不再使用时，用于记录和强制检查它们的活页夹(数字的或纸质的)在哪里？\n安全是一个过程，而不是一个产品，在解决子域名接管问题时，这一老生常谈成为焦点。在IT和安全部门各有不同部门的大型组织中，这可能是一个特别的问题。管理DNS条目通常是一项IT工作职能--让我的在线工具上线，这样我就可以做我的工作了。一旦它上线了，谁来记录它还在使用中呢？那是谁的工作职责？\n考虑到子域接管攻击是多么微不足道，它可能对您的品牌造成多大的声誉损害，而且几乎不需要付出什么努力来修复它-只需编辑您的DNS设置-就值得考虑如何将常规的子域检查集成到您的安全工作流程中。", "note_en": "Email holds the keys to the kingdom. All your password resets go through email, and abandoning an old domain name makes it easy for attackers to re-register the old domain and get your stuff.\n  The problem is especially grave for law firms where partnerships form, dissolve, and merge often,  security researcher Gabor Szathmari points out. A merger or acquisition typically involves either new branding for the new firm, with a new domain name to match, or the acquired firm dropping their old branding and domain name. Letting those old domains expire is dangerous.\n  &#34;In the US,  2017 was a record year for top-tier law firm mergers with 102 mergers or acquisitions in the year,&#34; Szathmari writes, &#34;At the small legal practice level, the number is likely to be in the thousands.&#34;\n To test just how bad the problem is, Szathmari re-registered old domain names for several law firms that had merged, set up an email server, and without hacking anything, he says he received a steady stream of confidential information, including bank correspondence, invoices from other law firms, sensitive legal documents from clients, and updates from LinkedIn. (Szathmari is working to return the affected domain names to their original owners.)\n  The same technique, he says, could easily be used to commit fraud. &#34;By reinstating an online web shop formerly running on an abandoned domain name,&#34; he writes in an email to CSO, &#34;Bad actors could download the original web pages from archive.org, then take new orders and payments by posing as a fully functioning web shop.&#34;\n &#34;If the former web shop had a CRM system or MailChimp running marketing campaigns,&#34; he adds, &#34;criminals could access the list of the former customers by taking over those accounts with an email-based password reset. They could offer them a special discount code to encourage them to submit orders which would never be delivered. The sky is the limit.&#34;\n  Expiring domain names are published daily by domain name registries in the form of  domain name drop lists. It doesn&#39;t take a criminal mastermind to download those lists daily and cross-reference them against news of mergers and acquisitions in the relevant trade pubs, or just re-register any domain name that catches their fancy.\n  Szathmari was also able to use the re-registered domain names to access third-party breach passwords using HaveIBeenPwned.com and SpyCloud.com. Both services require domain name verification, an easily bypassed defense once you own the domain in question. Because password re-use remains rampant, Szathmari writes that he could easily have used those third-party passwords to compromise affected employees, including their business and personal lives.\n   Better safe than sorry. Domain names aren&#39;t expensive, and keeping old domains in your possession is the cheapest cybersecurity insurance policy you&#39;ll ever purchase.\n Szathmari recommends setting up a catch-all email service that redirects all incoming email to a trusted administrator, someone who can review correspondence addressed former and current staff, and password reset emails for online services.\n  Subdomain hijacking is when an attacker takes over a subdomain, such as subdomain.yourdomain.com. This usually happens when the domain owner shuts down a service running on the subdomain, and forgets to update their DNS subdomain record that continues to point to a nonexisting service.\n Earlier this year  Microsoft made this rookie mistake, failing to secure two subdomains that spammers used to promote online poker casinos. If Microsoft, a mature security-focused software maker, can make this mistake, odds are your organization can, too.\n  A common subdomain takeover occurrence involves an organization setting up a subdomain to point to a third-party service, such as GitHub Pages, Heroku, or Shopify. If your organization later ends that service and deletes its GitHub Pages account, for instance, then an attacker can re-register that GitHub Pages account (since it&#39;s now available to all comers) and publish whatever they like at subdomain.yourdomain.com.\n  None of the fancy-schmancy expensive security tools out there can prevent a subomain takeover, only organizational working-togetherness. Who manages your company&#39;s DNS? Who approves subdomain uses for support ticketing or e-commerce or fill-in-the blank? Where is the binder, digital or paper, that documents and enforces checking subdomains when they are no longer in use?\n Security is a process, not a product, and this truism comes into focus when solving the problem of subdomain takeovers. This can be especially a problem in larger organizations where IT and security have their own separate departments. Managing DNS entries is typically an IT job function--make my online thingumajigger go live so I can do my job. Once it&#39;s live, who&#39;s keeping track that it&#39;s still in use? Whose job function is that?\n Given how trivial a subdomain takeover attack is, how much reputational damage to your brand it can create, and little effort is required to fix it--simply edit your DNS settings--it is worth considering how to integrate regular subdomain checking into your security workflow.", "posttime": "2020-06-16 17:05:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,domain", "title": "为什么放弃的域名如此危险", "title_en": "Why abandoned domain names are so dangerous", "transed": 1, "url": "https://www.csoonline.com/article/3300164/dont-abandon-that-domain-name.html", "via": "", "real_tags": ["域名", "domain"]}, {"category": "", "categoryclass": "", "imagename": "6dd4cf28082d1bc6fbd7739a3ed54ae1.jpg", "infoid": 1006781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司目前运营着一个三环马戏团，一个“快速”环提供新的但粗糙的代码，一个“慢”环提供更稳定的构建，一个“发布预览”环提供对已经上线的Windows10版本的更新。\n但现在首席项目经理阿曼达·兰戈夫斯基认为，微软背离了三个环的最初目的，这一事实从以下事实中可见一斑：“2019年年中，内部人士运行3个不同版本的版本(在我们开发周期的不同阶段)，快速环位于20H1，慢环位于19H2代码，发布预览环位于19H1代码。”\n她的答案是“一种新的渠道模型，它以构建的质量为中心，更好地支持并行编码工作。”更好的是，新模型将在Windows、Office、Edge甚至团队中保持一致。\n那么新的模式是什么呢？它现在是一个有三个频道的马戏团，如下所示：\nDev Channel取代了FAST RING，并被标榜为“高科技用户的理想选择”。此通道中的构建“将包含来自我们工程师的最新进行中的代码”，并且“将具有粗糙的边缘和一些可能会阻碍关键活动或需要解决办法的不稳定性”。开发渠道代码不会与特定的Windows10版本捆绑在一起；\nBeta Channel取代了慢环，推荐给“早期采用者”和那些想在“经过微软验证的相对可靠的更新”中试用即将推出的Windows10功能的用户。HITS频道中的代码与即将发布的特定Windows10版本捆绑在一起。\n发布预览频道将发布“即将发布的Windows10版本，在它向世界发布之前，将提供先进的质量更新和某些关键功能。”将支持代码。微软建议将该频道作为“在广泛部署之前预览和验证即将发布的Windows10版本”的方式。\n微软将把内部人员从他们目前的圈子转移到相应的渠道，而且仍然有可能在不同渠道之间流动。\n虽然针对Windows Insider的新计划更类似于Office Insider计划，但这两个计划仍然是分开的，成员需要在每个节目中选择他们想要的频道。\nLangowski暗示这种情况可能会改变，他写道：“我们希望随着时间的推移改善这种体验。”\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "The company currently operates a three-ring circus for these things, with a “fast” ring offering new-but-rough-edged code, a “slow” ring that delivers more stable builds and a “release preview” ring that delivered updates to already-live versions of Windows 10.\n  But now principal program manager lead Amanda Langowski reckons Microsoft drifted away from the original purpose of the three rings, as illustrated by the fact that “In the middle of 2019, Insiders were running builds from 3 different releases (at various stages in our development cycle) with the Fast ring being on 20H1, the Slow ring on 19H2 code, and the Release Preview ring on 19H1 code.”\n  Her answer is “a new channel model that pivots on the quality of builds and better supports parallel coding efforts.” Better yet, the new model will be consistent across Windows, Office, Edge and even Teams.\n  So what is the new model? It’s now a three-channel circus, as follows:\n  Dev Channel replaces the fast ring and is billed as “ideal for highly technical users”. Builds in this channel “will contain the latest work-in-progress code from our engineers” and “will have rough edges and some instability that could block key activities or require workarounds.” Dev Channel code won’t be tied to a particular Windows 10 release;\n Beta Channel replaces the slow ring and is recommended for “early adopters” and those who want to play with upcoming Windows 10 features in “relatively reliable updates that are validated by Microsoft.” Code in hits channel is tied to a specific upcoming Windows 10 release.\n Release Preview Channel will deliver “the upcoming release of Windows 10 prior to it being released to the world, with advanced quality updates and certain key features.” Code will be supported. Microsoft suggests this Channel as the way to “preview and validate upcoming Windows 10 releases before broad deployment”.\n  Microsoft will migrate Insiders from their current ring into the corresponding Channel and it remains possible to move between channels.\n  While the new scheme for Windows Insiders more closely resembles the Office Insider scheme, the two remain discrete and members need to opt-in to and pick the Channel they desire in each programme.\n  Langowski hinted that could change, writing “we are looking to improve this experience over time.” ®\n        The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-06-16 16:48:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,windows,microsoft,announced,代码", "title": "微软宣布对Windows预览版进行重大修改", "title_en": "Microsoft has announced big changes to Windows previews", "transed": 1, "url": "https://www.theregister.com/2020/06/16/windows_insider_changes/", "via": "", "real_tags": ["微软", "windows", "microsoft", "announced", "代码"]}, {"category": "", "categoryclass": "", "imagename": "ac2e00df6317e6f05fa2e09cc5c242ee.png", "infoid": 1006780, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您的数据库已经有数百个表，并且您计划从单一应用程序迁移到MicroService，那么DrawERD的分组功能是最好的工具。通过模拟模块分组，您可以清楚地确定哪个实体放在哪个服务中更合理。", "note_en": "If your database already has hundreds of tables and you plan to migrate from a monolithic application to a MicroService, then DrawERD&#39;s grouping function is the best tool. By simulating the grouping of modules, you can clearly determine which entity is placed in which service More reasonable.", "posttime": "2020-06-16 16:47:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,可视化,database,结构,easy", "title": "DrawERD：使可视化您的数据库结构变得更容易", "title_en": "DrawERD: Makes it easy to visualize your database structure", "transed": 1, "url": "https://drawerd.com", "via": "", "real_tags": ["数据库", "可视化", "database", "结构", "easy"]}, {"category": "", "categoryclass": "", "imagename": "a765d0b478e9077e1ff08940722fe9f4.png", "infoid": 1006779, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此程序是自由软件：您可以根据自由软件基金会发布的GNU通用公共许可证版本3的条款重新分发和/或修改它。\n分发本程序的目的是希望它有用，但没有任何担保；甚至没有对适销性或是否适用于特定目的的默示担保。有关更多详细信息，请参阅GNU通用公共许可证。\n您应该已经收到了GNU通用公共许可证的副本以及此程序。如果没有，请参阅http://www.gnu.org/licenses/.", "note_en": "This program is free software: you can redistribute it and/or modifyit under the terms of the GNU General Public License version 3 aspublished by the Free Software Foundation.\n This program is distributed in the hope that it will be useful,but WITHOUT ANY WARRANTY; without even the implied warranty ofMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See theGNU General Public License for more details.\n You should have received a copy of the GNU General Public Licensealong with this program. If not, see  http://www.gnu.org/licenses/.", "posttime": "2020-06-16 16:30:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,媒体,source,gnu", "title": "开源媒体服务闭路电视/录像/物体检测", "title_en": "Open Source Media Service CCTV/Video Recording/Object Detection", "transed": 1, "url": "https://github.com/fastogt/fastocloud/", "via": "", "real_tags": ["开源", "媒体", "source", "gnu"]}, {"category": "", "categoryclass": "", "imagename": "8642b8f770a6251cf503d73c51499406.png", "infoid": 1006778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "南非邮政银行(Postbank)是南非邮局的银行部门，在欺诈交易中损失了320多万美元，在员工打印并窃取了万能钥匙后，现在不得不为客户更换超过1200万张卡。\n爆料此事的南非当地新闻机构“星期日泰晤士报”称，该事件发生在2018年12月，当时有人在比勒陀利亚旧数据中心的一张纸上打印了该银行的万能钥匙。\n新闻刊物援引他们从银行消息来源获得的内部安全审计称，银行怀疑员工是此次入侵的幕后黑手。\n主密钥是一个36位的代码(加密密钥)，它允许持有者解密银行的操作，甚至访问和修改银行系统。它还用于生成客户卡的密钥。\n内部报告称，2019年3月至12月，流氓员工使用万能钥匙进入账户，进行了超过2.5万笔欺诈性交易，从客户余额中窃取了超过320万美元(5600万兰特)。\n在发现漏洞后，邮政银行现在将不得不用万能钥匙替换所有生成的客户卡，银行怀疑这一操作将花费超过10亿兰特(约合5800万美元)。\n这包括更换普通支付卡，也包括领取政府社会福利卡。“星期日泰晤士报”说，大约有800万到1000万张卡是用来领取社会补助的，这些卡是大多数欺诈操作发生的地方。\n根据这份报告，似乎腐败的员工已经获得了主机主密钥(HMK)或更低级别的密钥，Bank Security背后的安全研究员在今天的一次采访中告诉ZDNet。Bank Security是一个致力于银行欺诈的Twitter账户。\n研究人员告诉ZDNet，HMK是保护所有密钥的钥匙，在大型机架构中，这些密钥可以访问ATM密码、家庭银行访问码、客户数据、信用卡等。\n对此类数据的访问取决于架构、服务器和数据库配置。如上所述，可以访问具有存储的客户数据的不同内部应用程序和数据库的大型机或服务器随后使用该密钥。\n这位研究人员说，这个密钥和所有其他较低级别的密钥与第三方系统交换的方式有不同的实现方式，不同的银行会有所不同。\n邮政银行事件是独一无二的，因为银行万能钥匙是银行最敏感的秘密，因此受到保护，很少被泄露，更不用说直接被盗了。\n银行安全告诉ZDNet，一般来说，根据最佳实践，HMK密钥在专用服务器(具有专用操作系统)上管理，并受到高度保护，不会被物理访问(多个并发徽章访问和受限/独立的数据中心)。\n此外，一个人不能访问整个密钥，而是在各种可靠的经理或贵宾之间分配，只有在每个人都腐败的情况下才能重建密钥。\n研究人员说，通常情况下，人员和密钥会定期准确地更换，以避免这种类型的欺诈或问题，就像邮政银行的情况一样。据我所知，这些密钥的管理是留给各个银行的，而监管定期变更和安全性的内部流程是由单个银行决定的，而不是由一个明确的规定决定的。\n2020年2月，另一家南非银行Nedbank也报告了安全漏洞。该银行表示，黑客入侵了一家第三方服务提供商，然后窃取了超过170万客户的信息。", "note_en": "Postbank, the banking division of South Africa&#39;s Post Office, has lost more than $3.2 million from fraudulent transactions and will now have to replace more than 12 million cards for its customers after employees printed and then stole its master key.\n The  Sunday Times of South Africa, the local news outlet that broke the story, said the incident took place in December 2018 when someone printed the bank&#39;s master key on a piece of paper at its old data center in the city of Pretoria.\n The bank suspects that employees are behind the breach, the news publication said, citing an internal security audit they obtained from a source in the bank.\n The master key is a 36-digit code (encryption key) that allows its holder to decrypt the bank&#39;s operations and even access and modify banking systems. It is also used to generate keys for customer cards.\n The internal report said that between March and December 2019, the rogue employees used the master key to access accounts and make more than 25,000 fraudulent transactions, stealing more than $3.2 million (56 million rand) from customer balances.\n   Following the discovery of the breach, Postbank will now have to replace all customer cards that have been generated with the master key, an operation the bank suspects it would cost it more than one billion rands (~$58 million).\n This includes replacing normal payment cards, but also cards for receiving government social benefits. Sunday Times said that roughly eight to ten million of the cards are for receiving social grants, and these were where most of the fraudulent operations had taken place.\n    &#34;According to the report, it seems that corrupt employees have had access to the Host Master Key (HMK) or lower level keys,&#34; the security researcher behind  Bank Security, a Twitter account dedicated to banking fraud, told  ZDNet today in an interview.\n &#34;The HMK is the key that protects all the keys, which, in a mainframe architecture, could access the ATM pins, home banking access codes, customer data, credit cards, etc.,&#34; the researcher told  ZDNet.\n &#34;Access to this type of data depends on the architecture, servers and database configurations. This key is then used by mainframes or servers that have access to the different internal applications and databases with stored customer data, as mentioned above.\n &#34;The way in which this key and all the others lower-level keys are exchanged with third party systems has different implementations that vary from bank to bank,&#34; the researcher said.\n The Postbank incident is one of a kind as bank master keys are a bank&#39;s most sensitive secret and guarded accordingly, and are very rarely compromised, let alone outright stolen.\n &#34;Generally, by best practice, the HMK key is managed on dedicated servers (with dedicated OS) and is highly protected from physical access (multiple simultaneous badge access and restricted/separated data center),&#34; Bank Security told  ZDNet.\n &#34;Furthermore, a single person does not have access to the entire key but is divided between various reliable managers or VIPs, and the key can only be reconstructed if everyone is corrupt.\n &#34;Generally, the people and the key are changed periodically precisely to avoid this type of fraud or problem ,as in the case of PostBank,&#34; the researcher said. &#34;As far as i know, the management of these keys is left to the individual banks and the internal processes that regulate the periodic change and security are decided by the individual bank and not by a defined regulation.&#34;\n  In February 2020, fellow South African bank  Nedbank also reported a security breach. The bank said that hackers breached a third-party service provider and then stole information on more than 1.7 million of its customers.", "posttime": "2020-06-16 16:29:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "银行,bank", "title": "南非银行在员工窃取万能钥匙后将更换1200万张卡", "title_en": "South African bank to replace 12m cards after employees stole master key", "transed": 1, "url": "https://www.zdnet.com/article/south-african-bank-to-replace-12m-cards-after-employees-stole-master-key/", "via": "", "real_tags": ["银行", "bank"]}, {"category": "", "categoryclass": "", "imagename": "a078d6d29af4435e88003dcf7b0fe9eb.jpg", "infoid": 1006776, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年晚些时候，如果一切顺利，国际空间站将收到一项非常重要的交付：一个新的、改进的厕所系统。\n当然，它还有一个更华丽的名字，官方名称是NASA的通用废物管理系统(UWMS)。该系统旨在弥合当前厕所空间技术与人类舒适地延长访问火星所需之间的差距。但是，没有什么比管道问题更能让任何旅行看起来比它实际的时间长得多，所以在工程师们把超大规模杀伤性武器带到离家那么远的地方之前，他们想要在轨道上对其进行测试。\nNASA的一位发言人向Space.com证实，发射的目标不早于秋季，尽管该机构仍在确定哪艘航天器将携带新管道升空。\n休斯敦美国宇航局约翰逊航天中心负责环境控制和生命支持技术以及机组人员健康和表现的项目副经理吉姆·布罗扬(Jim Broyan)在5月20日的空间研究委员会(COSPAR)会议上说，从长远来看，新马桶是为了让废物管理工程师做好准备，以应对专家们预计在未来任务中面临的一些挑战。\n会议重点讨论了人类前往火星的任务对行星保护的意义，即寻求保护地球和太阳系其他部分免受生物交叉污染的做法。当然，垃圾收集和储存的时机已经成熟，可以进行这种交叉污染，因为人类排泄物中充满了微生物。因此，未来的火星访问者不一定能够像阿波罗宇航员那样接近月球，他们只是在月球表面留下了一袋袋人类排泄物。\n对于必然要进行更长时间飞行的火星任务来说，体积是另一个挑战。布罗扬说，目前的估计表明，火星任务将需要管理约600磅。(270千克)固体废物，其中约75%是水。\nBroyan说，这些挑战意味着在人类前往火星之前，废物管理专家已经有了一个遗愿清单。我们未来的目标是稳定和干燥新陈代谢废物，使其微生物不活跃，并可能重复使用这些水，减少厕所的消耗品数量，因为它确实会在一项长期的任务中积累，我们也在考虑，我们可以重复使用一些废物吗？\n虽然目前在粪便容器中添加抑制恶臭的木炭并将这些容器储存在船上的标准做法现在有效，但对于更长的任务来说，这种做法不那么有吸引力，可能需要太多的质量。\n新的空间站厕所不能单独解决所有这些挑战，但它将改进美国宇航局以前为航天飞机和空间站设计的厕所，并纳入机组人员对这些系统的反馈。根据NASA的说法，UWMS对于支持空间站美国一侧更多的人口来说也是至关重要的，而即将到来的商业机组任务的增加将促进这一点。\n根据对太空厕所的详细审查，目前空间站美国一侧提供的厕所是在20世纪90年代设计的，以航天飞机厕所为基础。但是这个仪器也有它的缺陷。根据这份评论，它使用起来可能很笨重，尤其是对女性来说，而且它对座椅上的机组人员排列很敏感，有时会导致混乱。\n因此，NASA试图在削减质量和体积并做出一些设计改变的同时，保持那些获得积极评价的方面，比如调整座椅的形状，更换压缩废物的设备。\n另一个变化模仿了空间站俄罗斯一侧马桶的一个特点，宇航员只需将脚钩入脚趾杆，而不是美国空间站上用来在微重力环境中锚定宇航员的大腿杆。\nUWMS将在轨道实验室的剩余时间里一直留在空间站上，根据NASA雄心勃勃的月球返回计划，宇航员们在第一次载人阿特弥斯任务中将使用猎户座太空舱飞行第二个相同型号的马桶来环绕月球飞行，根据NASA的雄心勃勃的月球返回计划，UWMS将在空间站上度过剩余的时间，第二个相同型号的马桶将在猎户座太空舱上飞行，宇航员们将使用这个太空舱绕月飞行。\n向Meghan Bartels发送电子邮件至mbartels@space.com或关注她@meganbartels。在Twitter@spacedotcom和Facebook上关注我们。\n在有限的时间内，您可以订阅我们任何畅销的科学杂志，每月只需2.38美元，即前三个月的标准价格有45%的折扣。视图交易。\n加入我们的空间论坛，继续谈论空间的最新任务，夜空和更多！如果您有任何新闻提示、更正或评论，请发送电子邮件至：Community@space.com。\n我希望新改进的太空厕所的使用者能成功冲水。；)。\n回覆", "note_en": "Later this year, if all goes well, the   International Space Station will receive a very important delivery: a new and improved toilet system.\n It has a fancier name, of course; officially, the commode is NASA&#39;s Universal Waste Management System (UWMS). The system is designed to bridge the gap between current lavatorial space technology and what humans will need to make extended visits to, say,   Mars, in comfort. But there&#39;s nothing like a plumbing problem to make any trip seem much longer than it is, so before engineers take UWMS that far from the comforts of home, they want to test it in orbit.\n  The launch is targeted for no earlier than the fall, a NASA spokesperson confirmed to Space.com, although the agency is still determining what spacecraft will carry the new plumbing up.\n   In the long term, the new toilet is meant to prepare waste-management engineers for some of the challenges experts anticipate on future missions, Jim Broyan, a deputy program manager for Environmental Control and Life Support Technology and Crew Health and Performance at NASA&#39;s Johnson Space Center in Houston, said during a meeting of the Committee on Space Research, or COSPAR, on May 20.\n The meeting focused on what human missions to Mars mean for   planetary protection, the practice of looking to protect both Earth and the rest of the solar system from cross-contamination by living organisms. Waste collection and storage are ripe for such cross-contamination, of course, since human waste is full of microbes. So future Mars visitors won&#39;t necessarily be able to take the approach of Apollo astronauts on the moon, who simply   left bags of human waste on the lunar surface.\n  For Mars missions, which by necessity will be much longer flights, volume is another challenge. Broyan said that current estimates suggest Mars missions would need to manage about 600 lbs. (270 kilograms) of solid waste, about 75% of which is water.\n Those challenges mean that before   humans head to Mars, waste-management experts have, well, a bucket list, Broyan said. &#34;Our future goals are to stabilize and dry the metabolic waste to make it microbially inactive and possibly reuse that water, reduce the amount of consumables for the potty, because it does really accumulate on a long mission, and we&#39;re also looking at, Can we reuse some of the waste?&#34;\n   And while the current standard practice of adding stench-dampening charcoal to fecal containers and storing those containers on the ship works now, for longer missions it is less appealing and may require too much mass.\n The new station-bound toilet won&#39;t tackle all of those challenges single-handedly, but it will improve on previous NASA designs for the shuttle and space station and incorporate crew feedback about those systems. The UWMS is also crucial to support the larger population on the U.S. side of the space station that the coming rise in commercial crew missions will facilitate,   according to NASA.\n The toilet currently on offer on the U.S. side of the space station was designed in the 1990s and based on its shuttle counterpart, according to a   detailed review of space toiletry. But the apparatus has its flaws. It can be clunky to use, particularly for women, and it is &#34;sensitive to crew alignment on the seat,&#34; sometimes resulting in messes, according to that review.\n  So NASA has tried to keep the aspects that have gotten positive reviews while trimming mass and volume and making some design changes, like adjusting the shape of the seat and replacing the apparatus that compresses the waste.\n Another change mimics a feature of the   toilet on the Russian side of the space station, where astronauts simply hook their feet into toe bars, rather than the thigh bars used on the American equivalent to anchor the astronaut in the microgravity environment.\n The UWMS will remain on the space station for the rest of the orbiting laboratory&#39;s lifetime, and a second toilet of the same model will fly on the Orion capsule that astronauts use to fly around the moon on the first crewed Artemis mission in NASA&#39;s ambitious lunar return plan,   according to the agency.\n  Email Meghan Bartels at mbartels@space.com or follow her    @meghanbartels . Follow us  on Twitter    @Spacedotcom  and on    Facebook .\n For a limited time, you can take out a digital subscription to any of  our best-selling science magazines for just $2.38 per month, or 45% off the standard price for the first three months. View Deal\n Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.\n     I hope the users of the new improved space toilet will be flushed with success. ;)\n   Reply", "posttime": "2020-06-16 15:03:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "空间站,toilet,厕所", "title": "国际空间站今年将安装一个新马桶", "title_en": "The ISS Is Getting a New Toilet This Year", "transed": 1, "url": "https://www.space.com/new-toilet-coming-for-international-space-station-astronauts.html", "via": "", "real_tags": ["空间站", "toilet", "厕所"]}, {"category": "", "categoryclass": "", "imagename": "068db0ea56dc7010171238c583705c45.jpg", "infoid": 1006775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有很多方法可以在太空中穿行，但大多数都相当慢。这就是为什么，即使在最佳时间发射，离开地球的航天器也需要大约6个月的时间才能到达火星轨道。\n几十年来，许多火箭科学家一直将由核反应堆提供动力的推进系统视为更快到达火星和太阳系其他地方的最快实用手段。\n二战后叛逃到美国的德国工程师维尔纳·冯·布劳恩(Wernher Von Braun)甚至在他的土星V号火箭用化学推进将人类送上月球之前就意识到了核热推进的潜力。最终，这导致了一个名为NERVA的项目，它代表着火箭运载火箭应用的核发动机。它最终被取消，以帮助支付航天飞机的费用。\n自那以后，NASA一直支持断断续续地开发核热发动机的努力。基本想法很简单-核反应堆加热推进剂，如液氢，它通过火箭喷嘴膨胀并提供推力。然而，从来没有这样的火箭发动机飞行过，目前，美国国家航空航天局(NASA)对开发用于其他世界地面动力的核能更感兴趣，而不是致力于推进工作。\n但现在，美国国防部开始对天基推进产生兴趣。上个月，美国国防高级研究计划局(Defense Advanced Research Projects Agency)通过一项预投票，宣布了它打算在2025年准备好示范一种可飞行的核热推进系统。\n通过这一敏捷环月作战示范火箭(DRACO)计划，美国国防部寻求的技术将允许对地球轨道、月球轨道以及两者之间的任何地方的航天器进行更灵敏的控制，从而在这些领域给予军方更大的行动自由。\nDraco项目经理内森·格雷纳少校告诉ARS，未来几年，地月空间的活动预计将大幅增加。灵活的核热推进飞行器使美国国防部能够在如此巨大的体积内保持对蓬勃发展的活动的空间域意识。\n在其征集的第一阶段，DARPA已经要求工业界提供核热反应堆和运行中的航天器的设计，以便在上面进行演示。该计划的第一阶段将持续18个月。后续阶段将进行详细的设计、制造、地面测试和太空演示。目前还没有授予任何合同，奖励价值将根据行业提交的文件确定。\n有了Draco计划，美国国防部可能会在地月空间快速移动大型卫星。例如，将一颗4吨重的卫星从A点移动到B点，在太阳能电力推进下可能需要大约6个月的时间，而在核热推进下可以在几个小时内完成。\n要将这项技术用于火星任务，美国国家航空航天局(NASA)可能需要一个推力更大的系统。但是，让DARPA在开发这项技术、证明许多重叠技术以及展示核发动机在太空中的操作方面指明方向，将会对NASA未来产生好处。因此，虽然国防部对环月空间感兴趣，但成功的德拉科测试对人类的探索也是个好消息。\nBWX Technologies高级项目总裁乔纳森·切尔坦(Jonathan Cirtain)表示，DARPA决定推进核热推进发展之际，关键使能技术正在成熟。Cirtain的公司制造了美国海军潜艇和航空母舰上的大部分核反应堆，该公司正在与NASA合作设计一种反应堆，以实现火星任务。\n其中一个进步来自于制造耐热金属的能力，这种金属具有极强的耐热性。Cirtain说，为了有效地运行，发动机必须能够承受仅两米长的巨大温度和压力变化。氢燃料的储存温度只有19开尔文，加热到2500开尔文或更高。\n与此同时，设计核反应堆堆芯的工程师可以获得计算能力，使他们能够快速迭代新的设计-计算中子通量和流体动力学等变量。他说：现在，有了办公桌上的超级计算机，你可以从几年的计算时间缩短到几天，迭代到设计解决方案的速度比以前快得多。", "note_en": "There are many ways to get around space, but most of them are pretty slow. This is why, even when launching at an optimal time, a spacecraft leaving Earth requires about six months to reach orbit around Mars.\n For decades, many rocket scientists have looked to a propulsion system powered by a nuclear reactor as the fastest practical means of getting to Mars and other places in the Solar System more quickly.\n Wernher von Braun, the German engineer who defected to the United States after World War II, recognized the potential of nuclear thermal propulsion even before his Saturn V rocket landed humans on the Moon with chemical propulsion. Eventually, this led to a project  called NERVA, which stood for Nuclear Engine for Rocket Vehicle Application. It was eventually canceled to help pay for the space shuttle.\n NASA has supported efforts to develop a nuclear thermal engine in fits and starts since. The basic idea is pretty simple—a nuclear reactor heats a propellant such as liquid hydrogen, and it expands through a rocket nozzle and provides thrust. No such rocket engine has ever flown, however, and at present,  NASA is more interested in developing nuclear energy for surface power on other worlds than working on propulsion.\n  But now, the US Department of Defense is getting interested in space-based propulsion. Last month,  through a presolicitation, the US Defense Advanced Research Projects Agency announced its intent to have a flyable nuclear thermal propulsion system ready for a demonstration in 2025.\n Through this Demonstration Rocket for Agile Cislunar Operations, or DRACO program, the defense agency seeks technology that will allow for more responsive control of spacecraft in Earth orbit, lunar orbit, and everywhere in between, giving the military greater operational freedom in these domains.\n &#34;Activity in cislunar space is expected to increase considerably in the coming years,&#34; Maj Nathan Greiner, manager of the DRACO Program, told Ars. &#34;An agile nuclear thermal propulsion vehicle enables the DOD to maintain Space Domain Awareness of the burgeoning activity within this vast volume.&#34;\n  In &#34;Phase 1&#34; of its solicitation, DARPA has asked industry for the designs of both a nuclear thermal reactor and an operational spacecraft upon which to demonstrate it. This initial phase of the program will last 18 months. Subsequent phases will lead to detailed design, fabrication, ground tests, and an in-space demonstration. No contracts have yet been awarded, and award values will be determined by industry submissions.\n With the DRACO program, the US Defense Department could potentially move large satellites quickly around cislunar space. For example, moving a 4-ton satellite from point A to point B might take about six months with solar electric propulsion, whereas it could be done in a few hours with nuclear thermal propulsion.\n To use this technology for Mars missions, NASA would probably want a system with higher thrust. But having DARPA show the way in terms of developing this technology, proving out a lot of overlapping technologies, and demonstrating operation of a nuclear engine in space, would have benefits for NASA down the road. So while the defense department is interested in cislunar space, a successful DRACO test would be good news for human exploration as well.\n  DARPA&#39;s decision to push forward with development of nuclear thermal propulsion comes as critical enabling technologies are maturing, said Jonathan Cirtain, president of advanced programs at BWX Technologies. Cirtain&#39;s company, which makes most of the nuclear reactors found on US Navy submarines and aircraft carriers, is  working with NASA on the design of a reactor to enable Mars missions.\n One advancement has come in the ability to manufacture refractory metals, which are extraordinarily resistant to heating. To operate efficiently, Cirtain said, an engine must be able to withstand huge temperature and pressure changes across just two meters in length. Hydrogen fuel is stored at just 19 Kelvin and heated to 2,500 Kelvin or higher.\n At the same time, engineers designing nuclear reactor cores have access to computational power that allows them to iterate new designs—calculating such variables as neutron flux and fluid dynamics—quickly. &#34;N ow, with supercomputers on your desk, you can go from years&#39; worth of calculation time to days, and iterate to a design solution much faster than you could previously,&#34; he said.", "posttime": "2020-06-16 14:45:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "核热,nuclear,推进", "title": "美国军方正认真对待核热飞船推进", "title_en": "The US military is getting serious about nuclear thermal spacecraft propulsion", "transed": 1, "url": "https://arstechnica.com/science/2020/06/the-us-military-is-getting-serious-about-nuclear-thermal-propulsion/", "via": "", "real_tags": ["核热", "nuclear", "推进"]}, {"category": "", "categoryclass": "", "imagename": "6066d31639edae8c64c6aea37de7765a.jpg", "infoid": 1006774, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是最古老也是最伟大的宇宙问题：有没有人在那里？\n多年来，我们只有德雷克方程来帮助我们理解这个问题，但没有迹象表明答案。现在，诺丁汉大学的一组科学家认为，他们已经提出了一项基于“宇宙进化”的新计算，认为我们的银河系中可能至少有36个正在进行的智能文明。\n银河系是我们太阳系的家园，据估计，银河系有1000亿到4000亿颗恒星，在我们的银河系中，大约每颗恒星都有一颗系外行星。\n今天发表在“天体物理杂志”上的这篇新论文研究了银河系中可能存在的交流地外智能(CETI)文明的数量。它假设智能生命会出现在其他星球上，就像它在我们自己的星球上所做的那样。\n一个关键的假设是，其他行星上智能生命的形成需要大约50亿年的时间，就像它在地球上所做的那样。另一种观点是，技术文明将至少持续100年--就像我们到目前为止所做的那样。毕竟，经过45亿年的进化，地球上才出现了能够交流的技术文明。\n文明的数量在很大程度上取决于它们在多长时间内积极地向太空发出它们存在的信号-例如来自卫星和电视的无线电传输。\n这项计算表明，在我们的银河系中可能有36个活跃的智能文明在交流，研究人员将其称为“天体生物学哥白尼极限”。它考虑到：\n这篇论文的主要作者、诺丁汉大学工程系助理教授汤姆·韦斯特比(Tom Westby)表示：“估计智能文明数量的经典方法依赖于猜测与生命相关的价值，但对这类问题的看法差异很大。”“我们的新研究使用新数据简化了这些假设，让我们对银河系中文明的数量有了可靠的估计。”\n使用最严格的一组假设-即交流文明只存在100年-估计至少36个文明实际上是最保守的下限。\n然而，作者指出，与这36个文明中的一个文明的平均距离约为17,000光年，因此目前不可能进行探测和通信。\n还有一个棘手的问题，即智能文明往往会持续多久。\n领导这项研究的诺丁汉大学天体物理学教授克里斯托弗·康塞利斯说：“搜寻外星智慧文明不仅揭示了生命本身是如何形成的，而且还给了我们关于我们自己的文明将持续多久的线索。”这项研究的负责人、诺丁汉大学天体物理学教授克里斯托弗·康塞利斯(Christopher Conselice)是这项研究的带头人。“如果我们发现智能生命是普遍存在的，那么这将揭示出我们的文明可能存在的时间比几百年长得多。”\n“或者，如果我们发现我们的银河系中没有活跃的文明，这对我们自己的长期存在来说是一个不好的迹象。”\n在我的推特或LinkedIn上关注我。我可以在我的个人网站上查看，或者在这里查看我的一些其他工作。", "note_en": "It’s the oldest and the greatest cosmic question of all: is there anybody out there?\n  For years all we’ve had is the  Drake Equation to help us understand the question, but no indication of an answer. Now a group of scientists at the University of Nottingham think they’ve come up with a new “cosmic evolution”-based calculation that says that there are likely to be at least 36 ongoing intelligent civilizations in our Milky Way galaxy.\n  The Milky Way, home to our Solar System, is estimated to have 100 billion to 400 billion stars, and roughly one exoplanet per star in our galaxy.\n  Published today in  The Astrophysical Journal, the new paper examines the likely number of Communicating Extra-Terrestrial Intelligent (CETI) civilizations in the Milky Way. It assumes that intelligent life comes to occur on other planets much as it has done on our own planet.\n  A key assumption is that it takes around five billion years for intelligent life to form on other planets, as it does on Earth. Another is that a technological civilization will last at least 100 years—as ours has, thus far. After all, it took 4.5 billion years of evolution before a technological civilization arose on Earth, and was capable of communicating.\n    The number of civilizations depends strongly on how long they are actively sending out signals of their existence into space—such as radio transmissions from satellites and TV.\n  The calculation—which says that there could be 36 active communicating intelligent civilizations in our home galaxy—is called the “Astrobiological Copernican Limit” by the researchers. It takes into account:\n         “The classic method for estimating the number of intelligent civilizations relies on making guesses of values relating to life, but opinions about such matters vary quite substantially,” said Tom Westby, Assistant Professor, Faculty of Engineering at the University of Nottingham, and lead author on the paper. “Our new study simplifies these assumptions using new data, giving us a solid estimate of the number of civilizations in our galaxy.”\n    The estimation of at least 36 civilizations is actually the most conservative lower limit using the strictest set of assumptions—namely that communicating civilizations only survive for 100 years.\n  However, the authors note that the average distance to one of these 36 civilizations is around 17,000 light-years, so detection and communication is currently impossible.\n  There’s also the thorny question of how long intelligent civilizations tend to survive.\n  “Searches for extraterrestrial intelligent civilizations not only reveals the existence of how life itself forms, but also gives us clues about how long our own civilization will last,” said Christopher Conselice, Professor of Astrophysics at the University of Nottingham, who led the research. “If we find that intelligent life is common then this would reveal that our civilization could exist for much longer than a few hundred years.”\n  “Alternatively, if we find that there are no active civilizations in our galaxy it is a bad sign for our own long-term existence.”\n Follow me on  Twitter or  LinkedIn.  Check out my  website or some of my other work  here.", "posttime": "2020-06-16 14:18:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "外星人,alien,文明", "title": "我们银河系中至少有36种智能外星人文明", "title_en": "There Are at Least 36 Intelligent Alien Civilizations in Our Galaxy", "transed": 1, "url": "https://www.forbes.com/sites/jamiecartereurope/2020/06/15/there-are-36-intelligent-alien-civilizations-in-our-galaxy-say-scientists/", "via": "", "real_tags": ["外星人", "alien", "文明"]}, {"category": "", "categoryclass": "", "imagename": "d6125043880596c7f2e6ec33be88a93d.jpg", "infoid": 1006773, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最佳的收听体验是在Chrome、Firefox或Safari上。在苹果播客或PodCastOne上订阅Federal Drive的每日音频采访。\n在2020财年，美国国税局(IRS)收到了一笔为期两年、价值1.8亿美元的资金，用于商业系统现代化。\n这位专员是这样说的：“通过对信息技术的投资，美国经济实现了令人印象深刻的生产力增长。美国国税局(IRS)仍然依赖于20世纪60年代和70年代安装的系统，它已经建立了商业系统现代化计划，以利用新技术来改造我们的经营方式。我坚信这个项目正走在成功的道路上。“。\n哎呀，那是查尔斯·罗索蒂，他在2000年的一份进度报告中写道。他承诺从2001年开始取得实实在在的成果。在其间的几年里，美国国税局实际上已经对其许多系统和程序进行了现代化改造。此外，在那份报告发布后不久，美国国税局成功地将其转换为4位日期代码。美国国税局将继续花费数十亿美元，但没有一个承包商能够将用汇编语言编码的个人主文件转换成现代代码。\n去年4月发布的最新现代化计划，以2020年的沙拉术语进行了讨论：人工智能、机器人过程自动化、“客户”体验的转变、数据数字化和分析、云计算和应用编程接口。\n还有“消除数百万行遗留代码”。美国国税局将这一细节包括在其六年计划中，称该计划可能耗资高达27亿美元。最初的1.8亿美元中有多少将用于消除旧代码，我们不知道。\n但我们确实知道这一点-几年来，美国国税局一直拥有将汇编语言代码转换为Java的技术解决方案。现代代码，再加上提取与旧代码相关的数据，将有助于美国国税局实现其分析、自动化和客户服务目标。使用几十年前编程的批处理系统，你不能在线回答问题，无论是对你的员工还是使用数字服务的纳税人。\n我上一次写这项技术是在两年前的一篇帖子里，那篇帖子在网上疯传。个人主文件系统近25年来就像一块海岸线的岩石一样屹立不倒，抵御着承包商资金向其投掷的破碎浪潮。美国国税局拥有的方法是由前雇员王健(Jian Wang)内部开发的。他是美国国税局一个名为CADE-2的项目的总工程师，CADE是客户账户数据引擎的缩写。要将纳税人的数据放入关系数据库，以便在当代使用，这是一项长期的努力。王现在正致力于更新社会保障管理局的遗留代码。\n王说，他和一个七人团队，花费200万美元，设法将90%的IMF代码转换为Java。它本应与2018年提交季节的汇编器代码并行运行，并在2019年更换汇编器。目前的现代化计划只说“…。正在努力从基于文本的遗留编程(如COBOL)迁移到现代通用语言(如.NET、Java)，这将促进编程语言标准化并降低劳动力维持风险。“。该计划没有提供更多细节。\n汇编程序代码在当时是非常棒的，是独创性和编程的奇迹。你可以对蒸汽机车说同样的话，但现在没有人再用它们来拉火车了。然而，国税局的装配工就像沃尔斯哈茨的阀门装置一样，继续嘎嘎作响。\n现在王的发明有了更新。去年10月15日，它获得了美国专利号10,445,078。它的标题是“汇编语言到目标语言翻译的分层软件体系结构模型”，这项技术已经不是什么秘密了。王指出，美国国税局前首席信息官特里·米尔霍兰(Terry Milholland)在2016年就此向国会作证。前专员约翰·科斯基宁在2017年的一次演讲中讨论了这一问题。\n2015年的一张照片显示，王从科斯基宁那里接受了一个巨大的、装框的成就奖，旁边是运营支持副专员杰夫·特里比亚诺和时任小企业个体户部门专员的卡伦·席勒(Karen Schiller)。\n事实上，另外两项相关专利申请仍处于休眠状态。正如美国专利商标局所说，它们被遗弃了，因为美国国税局不愿支付发行费。\n王说，他亲自要求当时的副首席信息官、现在的代理首席信息官南希·西格(Nancy Sieger)批准250美元的费用。他说，这一要求甚至提交给了专员查尔斯·雷蒂格(Charles Rettig)。\n对于王和前CIO Terry Milholland来说，与其说是围绕着专利申请，不如说是为什么美国国税局显然放弃了自己的技术。这一事件引起了财政部税务监察长的注意。但它对代码转换之谜的调查因对2018年4月税日停电的调查而分道扬镳。\n我最近再次请求美国国税局讨论它的代码替换策略，以及为什么据任何人所知，它没有使用自己的专利技术，也没有使用它生成的Java代码。我与美国国税局公共事务部门进行了一次愉快的对话，但还没有接受特里比亚诺或西格的采访。我很高兴介绍一下美国国税局对此的看法，以及它的技术人员是如何计划处理遗留代码的。\n在18个月前的一次采访中，美国政府问责局的戴夫·鲍纳(Dave Powner)指出，美国国税局的时间已经不多了。能够处理汇编语言代码的内部人员更少，潜在雇员也更少。美国国税局自己表示，未来五年将有三分之一的人退休。\n国会也在关注。美国国税局的资金要求国税局发送现代化项目和支出的季度报告，包括它们是否以及为什么偏离成本或进度承诺。\n在其新的2019财年进展更新中，美国国税局在客户服务和服务级别、员工数据工具以及IT运营方面提供了一长串切实的成就。报告指出：“美国国税局认为，提高灵活性、效率、有效性和安全性的关键是实现国税局的现代化。现代化对所有核心功能都至关重要。“。这份报告讲述了技术人员是如何更新硬件的，但它只暗示了主文件的挑战：“但为了确保美国国税局能够长期完成任务，还需要做更多的工作，包括更新遗留的计算基础设施和业务运营。”它向读者推荐我上面引用的2019年4月现代化业务计划。\n多年来，美国国税局(IRS)一直在关注遗留代码。我很想知道它处理代码的具体计划。", "note_en": "Best listening experience is on Chrome, Firefox or Safari. Subscribe to Federal Drive’s daily audio interviews on  Apple Podcasts or  PodcastOne.\n For fiscal 2020, the IRS has received a two-year, $180 million chunk for business systems modernization.\n Here’s what the commissioner says about it: “The US economy has achieved impressive increases in productivity through investments in information technology. The IRS, which is still dependent on systems installed in the 1960s and 1970s, has established the Business Systems Modernization Program to take advantage of new technology to revamp the way we do business. I firmly believe the program is on the path to succeed.”\n Oops, that was Charles Rossotti, writing in a 2000 progress report. He promised real results starting in 2001. In intervening years, the IRS has in fact modernized many of its systems and procedures. Plus, soon after that report, the IRS made it successfully through the conversion to 4-digit date codes. The IRS would go on to spend billions, but none of the contractors could ever convert the Individual Master File, coded in assembler language, to modern code.\n    The latest  modernization plan, issued last April, talks in the salad of 2020 terms: Artificial intelligence, robotic process automation, transformation of “customer” experience, data digitization and analysis, cloud computing, and application programming interfaces.\n There’s also “eliminating millions of lines of legacy code.” The IRS included this detail in its six-year plan, which it says could cost up to $2.7 billion. How much of that initial $180 million will go to eliminating old code, we don’t know.\n But we do know this — for several years the IRS has possessed  a technological solution to converting assembly language code to Java. Modern code, coupled with extraction of data associated with the old code, would help the IRS with its analytics, automation and customer service goals. You can’t give online answers to questions, neither to your staff or to taxpayers using digital services, with a batch processing system programmed decades ago.\n I last  wrote about this technology two years ago in a post that went viral. The Individual Master File system for nearly 25 years has stood like a shoreline rock, resisting the crashing waves of contractor money thrown against it. The methodology the IRS possesses was developed in-house, by former employee Jian Wang. He was the IRS’ chief engineer on a project known as CADE-2, CADE stands for Customer Account Data Engine. It’s a long running effort to get taxpayer data into a relational database so it can be used in contemporary ways. Wang’s now working to update legacy code at the Social Security Administration.\n Wang said he and a team of seven people, at a cost of $2 million, managed to convert 90% of the IMF code to Java. It was to have run in parallel with the assembler code for the 2018 filing season, and to have replaced the assembler for 2019. The current modernization plan only says, “… efforts are underway to migrate from text-based legacy programming [like COBOL] to modern, common languages (e.g., .NET, JAVA), which will promote programming language standardization and reduce workforce sustainment risks.” The plan offers no more detail.\n Assembler code was fantastic in its day, a marvel of ingenuity and programming. You can say the same thing about steam locomotives, but no one uses them to pull trains anymore. Yet the IRS assembler keeps chugging along, like Walschaerts valve gear.\n    Now there’s an update to Wang’s invention. This last Oct. 15, it received U.S. Patent number 10,445,078. It’s titled  “Layered Software Architecture Model for Translation of Assembler Language to Target Language.” The technology is no secret. Wang points out, former IRS chief information officer Terry Milholland testified to Congress about it in 2016. Former Commissioner John Koskinen discussed it in a speech in 2017.\n  A 2015 photo shows Wang receiving a huge, framed achievement award from Koskinen, flanked by the deputy commissioner for Operations Support, Jeff Tribiano, and Karen Schiller, then the commissioner for the Small Business-Self Employed Division.\n In fact, two other related patent applications remain dormant. They lie abandoned, as the U.S. Patent and Trademark Office calls it, because the IRS wouldn’t pay the issue fees.\n Wang said he personally asked Tribiano, then-deputy CIO Nancy Sieger, now the acting CIO, to authorize the $250 fees. He said the request even went to Commissioner Charles Rettig.\n For Wang, and former CIO Terry Milholland, the puzzle centers not as much on the patent applications so much as on why the IRS apparently abandoned its own technology. The episode got the attention of the Treasury Inspector General for Tax Administration. But its investigation into the code conversion mystery got sidetracked by a look into the  April 2018 tax day outage.\n I recently renewed my request to the IRS to discuss its code-replacement strategy, and why, so far as anyone can tell, it’s not using its own patented technology, or the Java code it produced. I’ve had a nice dialog with IRS public affairs, but not yet an interview with Tribiano or Sieger. I’ll be glad to relate the IRS’ view on this, and how its technicians do plan on dealing with the legacy code.\n In an interview 18 months ago, the  Government Accountability Office’s Dave Powner noted time is running out on the IRS. Fewer of its in-house people, and fewer would-be hires, are capable of dealing with assembler code. The IRS itself says a third of its people will retire over the next five years.\n Congress is also watching. IRS funding came with a requirement for IRS to send quarterly reports on modernization project and spending, including if and why they deviate from cost or schedule promises.\n In its new  Progress Update FY 2019, the IRS provides a long list of tangible achievements in customer services and service levels, data tools for its employees, and IT operations. The report states, “The IRS believes the key to achieving increased agility, efficiency, effectiveness and security is to  modernize the IRS. Modernization is vital to all core functions.” The report recounts how the tech staff updated hardware, but it only hints at the master file challenge: “But to ensure the IRS can fulfill the mission over the long term, more needs to be done, including updates to legacy computing infrastructure and business operations.” It refers readers to the April 2019 modernization business plan I referenced above.\n The IRS has been staring at the legacy code for many years. I’d love to know its specific plan to deal with the code.", "posttime": "2020-06-16 13:28:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,国税局", "title": "美国国税局编程之谜继续", "title_en": "IRS Programming Mystery Continues", "transed": 1, "url": "https://federalnewsnetwork.com/tom-temin-commentary/2020/01/irs-programming-mystery-continues/", "via": "", "real_tags": ["编程", "国税局"]}, {"category": "", "categoryclass": "", "imagename": "725234b31ae7a659a0693bc447b12607.jpg", "infoid": 1006771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我想磁场--即使是覆盖整个社区的磁场也可能与此有关。例如：附近的一条高压电线。旧的软盘有可能比我们想的做得更好。我在90年代初将我的5 1/4磁盘转换成了1.4个磁盘，在它们问世后，所以我现在没有这些磁盘了。但我记得有很多人不会读书，而这些人都是10岁的孩子。我确实有一些8英寸的磁盘，可以在12年后读取，它们的密度较低，并且不会将所有东西放得太近，这可能会对数据读取的恢复产生影响。My 1.4 Disks我将其转换为硬盘存储库，并使用相应的数据库条目创建了每个磁盘的映像。如果需要，您可以使用像Magic ISO这样的基本软件将磁盘映像挂载为驱动器。我已经有一段时间没有访问它们了。不过，我确实保留了一个可引导的6.22DOS映像，偶尔会在上面处理汇编中的软件。最大的问题是像COM端口和LPT端口这样的东西不能映射到USB，因为它当时还不存在。不过，有些人有一种产品可以帮他们绘制地图，我只是不想为此付钱。", "note_en": "I suppose magnetic fields – even ones that blanket a neighborhood might have something to do with it. For example: A nearby high tension electric line. It’s possible that the older floppies were built better that we thought. I converted my 5 1/4s to 1.4 disks in the early 90’s after they came out, so I don’t have those anymore. But I remember that many won’t read, and those were 10 years old. I did have some 8 inch disks that read after 12 years, they are lower density and don’t pack everything so close, maybe that makes a difference on the recovery of data reads. My 1.4 disks I converted to hard drive repository and created images of each disk with a corresponding database entry. You can mount the disk image as a drive if needed using some basic software like Magic ISO I think. It’s been a while since I accessed them. I do however keep a bootable 6.22 DOS image and work on software in assembly on there occasionally. Biggest problem with that is things like COM ports and LPT ports don’t map to USB because it didn’t exist back then. There is someone that has a product for sale that will map them though, I just don’t feel like paying bucks for that.", "posttime": "2020-06-16 13:26:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,app,os,磁盘", "title": "崩溃操作系统，一种在不可想象的事情发生时使用的操作系统", "title_en": "Collapse OS, an OS for When the Unthinkable Happens", "transed": 1, "url": "https://hackaday.com/2019/10/26/collapse-os-an-os-for-when-the-unthinkable-happens/", "via": "", "real_tags": ["操作系统", "app", "os", "磁盘"]}]