[{"category": "", "categoryclass": "", "imagename": "a491aa16df7ac6f7cbd66379efb6dc7a.jpg", "infoid": 1008302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国全国广播公司(NBC)的孔雀流媒体服务将于下月推出，首次公开发行的明珠无疑是根据奥尔德斯·赫胥黎(Aldous Huxley)1932年经典反乌托邦小说改编的雄心勃勃的“美丽新世界”(The Brave New World)。这部“孔雀”原创系列的完整预告片终于出炉了，奥尔登·埃伦瑞奇(Alden Ehrenreich)饰演赫胥黎笔下的反英雄--野人约翰(John The Savage)，当他被推入一个乌托邦社会时，他发现自己很难适应。\n正如我们在四月份报道的那样，“美丽的新世界”的故事背景设定在2540年，在世界之都伦敦，人们出生在人造子宫里，通过睡眠学习接受灌输，以适应他们指定的预先确定的种姓。公民经常服用一种名为SOMA的药物(部分是抗抑郁剂，部分是迷幻剂)，以保持他们的温顺，并帮助他们遵守严格的社会法律。乱交受到鼓励，但怀孕(对女性而言)是令人羞愧的原因。不用说，艺术和科学(尽管程度较小)都受到怀疑。\n西欧常驻世界管理员穆斯塔法·蒙德告诉这部小说的反英雄主人公野人约翰，纯科学领域的每一项发现都有潜在的颠覆性。科学是危险的，我们必须小心翼翼地用铁链锁住它，给它戴上嘴巴。\n约翰是一位高级政府官员的私生子，在萨维奇保留地出生和长大，那里的人仍然在生育，年龄自然，通常代表着世界国家精心控制的理想的对立面。他唯一受过教育的是莎士比亚全集。(小说的标题引用了米兰达在“暴风雨”中的一句话。)。当约翰和他的母亲琳达找到回到世界之州的路时，他最初成为了塞莱布雷的事业，但却在努力适应新的社会习俗。更具体地说，他爱上了一位名叫列尼娜·克劳恩的年轻女子，但他无法应对她的滥交和性行为。他最终将自己与社会隔离开来，希望洗清自己的罪孽。事情对任何人来说都不会有好的结局。\n在4月的预告片中，我们遇到了Beta-Plus Lenina(杰西卡·布朗·芬德利Jessica Brown Findlay饰)，丢下一张索玛的标签，与各种潜在的性伴侣狂欢，偶尔的情妇伯纳德·马克思(亨利·劳埃德饰)嫉妒地看着。我们还看到了Savageland，琳达(黛米·摩尔饰)敦促她的儿子约翰(Ehrenreich饰)和她一起回到新伦敦。我们还看到了变性的威权主义者穆斯塔法·蒙德(Nina Sosanya)向一群追随者讲授提问或欢迎新想法的危险：病毒进入细胞。故事就是这样开始的。同样换了性别：伯纳德的朋友、情绪工程学院教授赫尔姆霍兹·沃森(Helmholtz Watson)现在是汉娜·约翰-卡门(Hannah John-Kamen)饰演的威廉敏娜·赫尔姆·沃森(Wilhelmina Helm&34；Watson)。\n新的预告片为我们提供了更多的细节和即将到来的事情的暗示。它以列尼娜略微提到索玛开场，而伯纳德的声音则向我们介绍了所谓的乌托邦--新伦敦。每个人都很快乐，每个人都知道自己的位置，没有饥饿、暴力或痛苦--你明白的。约翰的母亲琳达告诉他，我一直想为你做这件事。剩下的大部分预告片都是关于约翰在努力适应新伦敦时的反应。他被告知，你所要做的就是连接，这似乎涉及到一种特殊的隐形眼镜，它会连接到你的眼球上。\n每个人都时时刻刻都是相互联系的，这意味着没有人是真正孤独的，这似乎一点也不适合约翰。他在场但不在现场，观察但不吸引人，而且他似乎不喜欢他所看到的。你知道，我一直在关注你们这些人，他一度说。如果这个地方如此完美，为什么一切都颠倒了呢？我们看到伯纳德在这个原本很理想的城市里靠在一具身体上，所以约翰说得有道理。唯一的亮点是莱尼娜，她发现自己被野蛮人所吸引，而他也被她所吸引。约翰显然对新伦敦产生了颠覆性的影响，这一点并不是没有被当权者忽视的。蒙德说：我们需要在这件事走得太远之前阻止它。\n早在4月份，我就写道，虽然孔雀进入流媒体领域相对较晚，但这部电视剧看起来可能会成为这项羽翼未丰的服务的赢家。我坚持这种印象。这部电视剧在视觉上引人注目，演员阵容一流，节目制作人大卫·维纳看起来像是富有想象力地更新了赫胥黎21世纪小说的技术细节。“美丽的新世界”将于2020年7月15日首次亮相，作为孔雀流媒体服务推出的一部分。", "note_en": "NBC&#39;s  Peacock streaming service launches next month, and the jewel in the crown of its initial offerings is undoubtedly   Brave New World, an ambitious adaptation of Aldous Huxley&#39;s classic 1932 dystopian novel. The full trailer for this Peacock original series is finally here, starring Alden Ehrenreich as Huxley&#39;s antihero, John the Savage, who finds himself struggling to adapt when he is thrust into a utopian society.\n  As  we reported in April,  Brave New World is set in the year 2540, in the World State city of London, where people are born in artificial wombs and indoctrinated through &#34;sleep-learning&#34; to fit into their assigned predetermined caste. Citizens regularly consume a drug called soma (part anti-depressant, part hallucinogen) to keep them docile and help them conform to strict social laws. Promiscuity is encouraged, but pregnancy (for women) is a cause for shame. Needless to say, both art and science (albeit to a lesser extent) are viewed with suspicion.\n &#34;Every discovery in pure science is potentially subversive,&#34; Resident World Controller of Western Europe Mustapha Mond tells the novel&#39;s antihero protagonist, John the Savage. &#34;Science is dangerous; we have to keep it most carefully chained and muzzled.&#34;\n John is the illegitimate son of a high-level government official, born and raised on the Savage Reservation, where people still give birth, age naturally, and generally represent the opposite of the World State&#39;s carefully controlled ideals. His only education has been the complete works of Shakespeare. (The novel&#39;s title references a line by Miranda in  The Tempest.) When John and his mother, Linda, find their way back to the World State, he initially becomes a cause célèbre but struggles to adapt to the new social mores. Specifically, he falls in love with a young woman named Lenina Crowne but can&#39;t deal with her promiscuity and sexual forwardness. He ultimately isolates himself from society in hopes of purging himself of &#34;sin.&#34; Things don&#39;t end well for anyone.\n In the April teaser, we met Beta-Plus Lenina (Jessica Brown Findlay), dropping a tab of soma and partying with various potential sexual partners, as occasional paramour Bernard Marx (Henry Lloyd) looked on with jealousy. And we got a glimpse of Savageland, as Linda (Demi Moore) urged her son John (Ehrenreich) to return with her to New London. We also saw gender-swapped authoritarian Mustapha Mond (Nina Sosanya) lecturing a group of acolytes about the danger of asking questions or welcoming new ideas: &#34;A virus enters a cell. That&#39;s how it begins.&#34; Also gender-swapped: Bernard&#39;s friend Helmholtz Watson, a professor at the College of Emotional Engineering, is now Wilhelmina &#34;Helm&#34; Watson, played by Hannah John-Kamen.\n    The new trailer gives us a few more details and hints of things to come. It opens with Lenina dropping a bit of soma, while Bernard&#39;s voice introduces us to the supposed utopia that is New London. Everyone is happy, everyone knows their place, there&#39;s no hunger or violence or pain—you get the idea. &#34;I&#39;ve always wanted that for you,&#34; John&#39;s mother Linda tells him. Much of the remaining trailer is devoted to John&#39;s reaction as he struggles to adapt to New London. &#34;All you have to do is connect,&#34; he is told, which seems to involve a special kind of contact lens that wires into your eyeball.\n Everyone is connected, all the time, which means no one is ever truly alone, which doesn&#39;t seem to suit John at all. He&#39;s present but apart, observing but not engaging, and he doesn&#39;t seem to like what he sees. &#34;You know I&#39;ve been watching you people,&#34; he says at one point. &#34;If this place is so perfect, why is everything upside down?&#34; We see Bernard leaning over a dead body in this otherwise ideal city, so John has a point. The only bright spot is Lenina, who finds herself drawn to the savage, and he to her. John is clearly having a disruptive influence on New London, something that does not go unnoticed by those in power. &#34;We need to stop this before it goes too far,&#34; Mond says.\n Back in April, I wrote that &#34;while Peacock is relatively late to the streaming scene, the series looks like it could be a winner for the fledgling service.&#34; I stand by that impression. The series is visually striking and has a stellar cast, and showrunner David Wiener looks like he has imaginatively updated the technological details of Huxley&#39;s novel for the 21st century.  Brave New World debuts on July 15, 2020 as part of the launch of the Peacock streaming service.", "posttime": "2020-06-26 06:06:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新世界,brave,伯纳德", "title": "在“美丽新世界”的预告片中，除了野人约翰，每个人都知道自己的位置。", "title_en": "In trailer for Brave New World, everyone but John the Savage knows their place", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/perfection-isnt-what-it-seems-in-new-trailer-for-peacocks-brave-new-world/", "via": "", "real_tags": ["新世界", "brave", "伯纳德"]}, {"category": "", "categoryclass": "", "imagename": "e36f6a0b0cb6616e16327cc79e59d50a.jpeg", "infoid": 1008301, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嘿，库比蒂诺的朋友们！当你在Safari中输入Realty.com(我的公司)，然后按GO，就会进入Realtor.com(我的竞争对手)。有人能帮我个忙把这个修好吗？看起来不那么合法。顺便说一句。关闭Safari建议可以解决问题(但最终用户不会这样做)。谢谢！", "note_en": "Hey Cupertino Folks! When you type  Realty.com (my company) into Safari and press go it takes you to  Realtor.com (my competition). Can someone do me a solid and fix this? Seems not that legal. btw... turning off Safari Suggestions resolves the issue (but end users don&#39;t do that). Thx!", "posttime": "2020-06-26 06:05:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "条目,redirect,safari", "title": "为什么Safari会将确切的域条目重定向到他们认为您想要的位置？", "title_en": "Why does Safari redirect exact domain entries to what they think you want?", "transed": 1, "url": "https://m.facebook.com/story.php?story_fbid=10157161487396994&id=501751993", "via": "", "real_tags": ["条目", "redirect", "safari"]}, {"category": "", "categoryclass": "", "imagename": "23dfc28582a2f06387876bd87aec9c39.png", "infoid": 1008300, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在大家都知道，虽然新冠肺炎连很年轻的人都能打，但年纪大的人面临的风险最大。在受重创的富裕国家，约60%的死于该疾病的人年龄在80岁及以上。然而，美国是个例外。疾病控制中心(CDC)6月16日发布的数据显示，该国的死亡人数明显偏年轻。在那里，80多岁的人占新冠肺炎死亡人数的不到一半，与此同时，40多岁、50多岁和60多岁的人占死亡人数的比例要大得多。美国新冠肺炎患者的中位数是48岁，意大利是63岁。\n为什么美国如此离群索居？部分原因当然在于这样一个事实，即美国的人口比欧洲年轻。美国的平均年龄只有38岁；意大利是45岁。另一个原因可能是，美国中年人可能比他们的欧洲同龄人不健康，例如，因为他们往往更肥胖。\n不管是什么原因，美国新冠肺炎受害者的相对年轻意味着冠状病毒正在夺走美国人更多宝贵的生命。一组苏格兰研究人员最近的一项研究将受害者的潜在健康状况考虑在内，估计了新冠肺炎按年龄损失的寿命。研究发现，在意大利，死于50多岁、60多岁和70多岁的人通常分别少活了30岁、21岁和12岁。那些80多岁的人平均损失了5年。\n将这些估计应用于美国疫情的受害者，粗略的计算表明，到目前为止，新冠肺炎已经将美国受害者的寿命平均缩短了11年，而受影响最严重的欧洲国家大约为9年。美国可能还没有达到像英国、西班牙和意大利那样的新冠肺炎死亡率。但在美国的传染远未得到遏制。安东尼·福奇(Anthony Fuci)是负责美国应对的专家之一，他警告说，该国部分地区的新感染人数“令人不安地激增”。当考虑到年龄因素时，美国人更有理由感到不安。", "note_en": "IT IS NOW well-known that, although covid-19 can strike even the very young, older folk face the greatest risk. In hard-hit rich countries, about 60% of all deaths from the disease are among people aged 80 and over. America, however, is an exception.  Data released on June 16th by the Centres for Disease Control (CDC) show that the country’s death toll skews significantly younger. There, people in their 80s account for less than half of all covid-19 deaths; people in their 40s, 50s and 60s, meanwhile, account for a significantly larger share of those who die. The median covid-19 sufferer in America is a 48-year-old; in Italy it is a 63-year-old.\n Why is America such an outlier? Part of the explanation surely lies in the fact that America has a younger population than Europe does. America’s median age is just 38; Italy’s is 45. Another reason, perhaps, is that middle-aged Americans may be less healthy than their European peers, eg, because they tend to be more obese.\n  Whatever the cause, the relative youthfulness of America’s covid-19 victims means that the coronavirus is robbing Americans of more years of precious life. A recent study by a group of Scottish researchers estimated the number of years of life lost to covid-19 by age, taking account of the victims’ underlying health conditions. It found that in Italy, people who died in their 50s, 60s, and 70s typically lost 30, 21, and 12 years, respectively. Those in their 80s lost five years, on average.\n Applying these estimates to the victims of America’s outbreak, a back-of-the-envelope calculation suggests that covid-19 has so far shortened the lives of its American victims by 11 years, on average, compared with about nine years in the hardest-hit European countries. America may not yet have reached the same rate of covid-19 deaths as the likes of Britain, Spain and Italy. But the contagion in America is far from contained. Anthony Fauci, one of the experts in charge of America’s response, has warned of a “disturbing surge” in new infections in parts of the country. And when the age profile is factored in, there is even more reason for Americans to be disturbed.", "posttime": "2020-06-26 06:04:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,肺炎,analysed", "title": "当新冠肺炎的死亡按年龄进行分析时，美国是一个异常值。", "title_en": "When Covid-19 deaths are analysed by age, America is an outlier", "transed": 1, "url": "https://www.economist.com/graphic-detail/2020/06/24/when-covid-19-deaths-are-analysed-by-age-america-is-an-outlier", "via": "", "real_tags": ["美国", "肺炎", "analysed"]}, {"category": "", "categoryclass": "", "imagename": "79fac8fffdba5d840bb9b42b7e2bb947.png", "infoid": 1008299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还记得查看器(Viewfinder)吗？马特·斯塔克(Matt Stark)正在开发的那款耗尽小脑精力的独立游戏，其特点是一些酷毙了的递归效果。经过一段时间的拖延，马特仍然在修补它，并添加新的机制--包括上面这个：\n在Viewfinder中，您将能够从墙上捕捉绘画，并将它们变成3D游戏世界中的真实对象。(这里是爱德华·霍珀(Edward Hopper)1929年的油画。)下面是斯塔克是如何做到这一点的：\nBlender有一个工具，可以让你使用相机投影生成UV，马特解释说，这就是我如何将绘画纹理应用到网格上的。\n最棘手的是做一个网格来适应这幅画--起初我以为这很容易，因为这幅画是一堆几何物体，但后来发现这幅画的透视在很多地方都有点摇晃。&#34；(这就是为你准备的Hopper。)。\n捕捉方法类似于他在这里所描述的：&#34；当玩家拍摄照片时，我复制环境，将其灰度化并将网格切片以移除照片之外的任何东西。当他们把它放到这个世界上时，我会把环境中的网格切成一个洞，用来放照片。\n当Viewfinder最终开始阅读播放测试时，请关注Matt以获取更新，不过我肯定也会在这里提到这一点。", "note_en": "Remember Viewfinder,  that cerebellum-straining indie game in development  by Matt Stark featuring  some insanely cool recursion effects? After some delay , Matt is still tinkering away it and adding new mechanics -- including this one above:\n  In Viewfinder, you will be able to &#34;capture&#34; paintings from off a wall, and turn them into real objects in the 3D game world. (A 1929 Edward Hopper painting, in this case.) Here&#39;s roughly how Mr. Stark does this:\n    &#34;Blender has a tool that lets you generate UVs using a camera projection,&#34; Matt explains, &#34;so that&#39;s how I got the painting texture applied to the mesh.\n  &#34;The tricky bit was making a mesh to fit the painting -- at first I thought it would be easy cause the painting&#39;s a bunch of geometric objects, but it turns out the painting&#39;s perspective is a little wonky in a bunch of places.&#34; (That&#39;s Hopper for you.)\n  The capture method is  similar to how he described it here: &#34;When the player takes a photo I duplicate the environment, make it greyscale and slice the meshes to remove anything outside the photo. When they place it into the world I slice the environment&#39;s meshes to make a hole for the photo.&#34;\n  Follow Matt for updates for when Viewfinder will finally be reading for playtesting, though I will surely mention it here too.", "posttime": "2020-06-26 06:04:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,游戏,game,网格", "title": "独立游戏正在开发中，具有很酷的“将2D绘画变成3D现实”的功能", "title_en": "Indie game in development with cool “turn 2D paintings into 3D reality” feature", "transed": 1, "url": "https://nwn.blogs.com/nwn/2020/06/viewfinder-matt-stark-unity-indie-game.html", "via": "", "real_tags": ["开发", "游戏", "game", "网格"]}, {"category": "", "categoryclass": "", "imagename": "7d11af1f91b19a353d70c53e2d178214.jpeg", "infoid": 1008298, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果已经收购了设备管理初创公司Fleetsmith。作为收购的一部分，将加入苹果的技术和人员可能有助于苹果扩大设备注册，并引入更好的方式在组织内设置iPad和Mac等新设备。\nFleetsmith向客户(以及苹果公司)提出的建议似乎完全契合了我们这个时代：该公司为组织提供了一种方法，让远程员工(或其他不在中心办公室的员工)配备设备，一旦这些设备重新启动，就会自动注册和设置，供企业使用。在那之后，Fleetsmith会自动确保设备获得所需的软件更新。它还为IT经理提供了管理车队的仪表盘。\n如果你使用过JAMF，一个更广泛的竞争对手，你就会大致了解。但Fleetsmith已经特别关注苹果设备，它有一种类似苹果的设计敏感性，而且对苹果来说，这可能是一个比JAMF便宜得多的选择。JAMF似乎走上了一条不同的道路，计划进行30亿美元的IPO。\n不过，说到钱，苹果和Fleetsmith都没有透露收购价格。不过，Fleetsmith确实发表了一篇关于此次收购的博客文章。这里是它说的一些内容：\n我们创建了Fleetsmith，以平衡IT的管理和安全需求与用户喜爱的Mac、iPad和iPhone体验。我们为我们建立的才华横溢的团队感到自豪，我们一直忠于我们的使命：让每个人都能获得强大、安全的苹果车队管理。\n我们很高兴能加入苹果公司。我们共同的价值观是以客户为中心，而不牺牲隐私和安全，这意味着我们可以真正履行我们的使命，将Fleetsmith交付给世界各地各种规模的企业和机构。\n该帖子还指出，Fleetsmith将继续为新客户和现有客户提供服务，因此这不是纯粹的知识产权或人力资本收购。据我们所知，它似乎会继续运营。\n苹果不太可能在不久的将来停止与JAMF的合作，但通过收购Fleetsmith，库比蒂诺显然对自己的内部设备管理战略有了一些特殊的计划。我们只能等着看它们是什么了。", "note_en": "Apple has acquired device-management startup Fleetsmith. The technology and personnel that will join Apple as part of the acquisition could help Apple expand upon device enrollment and introduce better ways to set up new devices like iPads and Macs within organizations.\n Fleetsmith&#39;s proposition to customers (and Apple) seems perfectly tailored to our times: the company offers a way for organizations to equip remote workers&#39; (or workers otherwise not located in the central office) devices and have those devices automatically registered and set up for enterprise use as soon as they&#39;re first turned on. After that, Fleetsmith automatically ensures devices get needed software updates. It also provides IT managers with a dashboard for managing the fleet.\n If you&#39;ve used Jamf, a more widespread competitor, you get the general idea. But Fleetsmith already had a special focus on Apple devices, it has an Apple-like design sensibility, and it was likely a much cheaper option for Apple than Jamf, to boot. Jamf appears to be on a different path, with a $3 billion  IPO planned.\n Speaking of money, though, neither Apple nor Fleetsmith has revealed the purchase price. Fleetsmith did publish a  blog post about the acquisition, though. Here&#39;s some of what it says:\n We started Fleetsmith to balance the management and security needs of IT with the experience users love about Mac, iPad, and iPhone. We’re proud of the incredibly talented team we’ve built, and that we’ve stayed true to our mission: to make powerful, secure Apple fleet management available to everyone.\n We’re thrilled to join Apple. Our shared values of putting the customer at the center of everything we do without sacrificing privacy and security, means we can truly meet our mission, delivering Fleetsmith to businesses and institutions of all sizes, around the world.\n The post also notes that Fleetsmith will continue to serve both new and existing customers, so this is not an acquisition purely of intellectual property or human capital. It seems like Fleetsmith as we know it will continue operating.\n It&#39;s unlikely that Apple will stop working with Jamf in the near future, but with this acquisition of Fleetsmith, Cupertino clearly has some special plans for its own in-house device management strategy. We&#39;ll just have to wait and see what they are.", "posttime": "2020-06-26 05:45:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,初创,acquisition", "title": "苹果进行另一笔收购：IT初创公司Fleetsmith", "title_en": "Apple makes another acquisition: IT startup Fleetsmith", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/06/apple-acquires-fleetsmith-a-remote-device-management-startup/", "via": "", "real_tags": ["apple", "苹果", "初创"]}, {"category": "", "categoryclass": "", "imagename": "006e9092229bcbe4ec27e34655392090.jpg", "infoid": 1008297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管苹果公司负责全球营销的高级副总裁菲尔·席勒否认公司正在做出任何改变，但一项新的政策将允许开发者挑战他们被该平台拒绝的规则，这表明改变正在酝酿之中。\n根据其自己的数据，App Store在2019年促成了超过5000亿美元的电子商务交易。作为参考，联邦政府已经向美国企业发放了约5290亿美元的贷款，作为Paycheck保护计划的一部分。\n鉴于其庞大的覆盖范围，现在是苹果改变条款的时候了吗？它是否会允许其收入份额温和地进入那个美好的夜晚，或者它是否有足够的资源来遏制新的立法，并安抚日益直言不讳的软件开发人员社区？为了研究这些问题，TechCrunch的四名员工加入了进来：\n苹果开始意识到，其培养应用程序经济的简单化和家长式做法可能弊大于利。情况并不总是这样：在早先的日子里，仅仅是为了获得参与其快速扩张的市场的特权，就值得付钱给苹果。\n但数字经济已经摆脱了以前推动增长的条件：一开始是新奇的，然后是由社交媒体增压的蓬勃发展的广告市场。钟摆正在向更传统的支付模式摇摆：对严肃的服务进行一次性和订阅支付。想象一下！\n再加上移动平台的出现，不仅是简单的消费和通信工具，而且是严肃的工作和生产力的工具，赌注已经上升。人们开始问，苹果向任何想要使用其平台的人寻求租金，到底提供了什么价值？\n苹果当然应该为它的麻烦付出一些代价，但它只占一家公司收入的四分之一多一点？对于一款99美分的应用程序来说，一对开发人员只是很高兴地卖出了几千份，现在看起来有点过分，但现在看起来确实是敲诈勒索。\n苹果处于强势地位，可能会继续撼动整个行业，但它担心在努力使其平台真正有利于生产率的过程中失去合作伙伴。这个市场更大，更复杂，有跨平台和跨设备的复杂性，其中App Store和iOS可能只是一小部分-但需要令人难以置信的超大份额。\n它会松开把手，但不着急。如果过于宽容，让其新规则被玩弄并仓促修改，那将是一种代价高昂的侮辱。允许开发者反击他们不喜欢的规则给了苹果很多东西可用，但没有承诺。毫无疑问，大玩家将获得更大的话语权，App Store的新常态将反映出金钱利益之间的缓和，而不是苹果慷慨的改变主意。", "note_en": "Although  Apple’s   Senior Vice President of worldwide marketing Phil Schiller  denied the company was making any changes, a new policy will let developers  challenge the very rules by which they were rejected from the platform, which suggests that change is in the air.\n According to its own numbers, the App Store facilitated more than $500 billion in e-commerce transactions in 2019. For reference, the  federal government has given out about $529 billion in loans to U.S. businesses as part of the Paycheck Protection Program.\n Given its massive reach, is it time for Apple to change its terms? Will it allow its revenue share to go gently into that good night, or does it have enough resources to keep new legislation at bay and mollify an increasingly vocal community of software developers? To examine these questions, four TechCrunch staffers weighed in:\n   Apple is starting to see that its simplistic and paternalistic approach to cultivating the app economy may be doing more harm than good. That wasn’t always the case: In earlier days it was worth paying Apple simply for the privilege of taking part in its fast-expanding marketplace.\n But the digital economy has moved on from the conditions that drove growth before: Novelty at first, then a burgeoning ad market supercharged by social media. The pendulum is swinging back to more traditional modes of payment: one-time and subscription payments for no-nonsense services. Imagine that!\n Combined with the emergence of mobile platforms not just as tools for simple consumption and communication but for serious work and productivity, the stakes have risen. People have started asking, what value is Apple really providing in return for the rent it seeks from anyone who wants to use its platform?\n Surely Apple is due something for its troubles, but just over a quarter of a company’s revenue? What seemed merely excessive for a 99-cent app that a pair of developers were just happy to sell a few thousand copies of now seems positively extortionate.\n Apple is in a position of strength and could continue shaking down the industry, but it is wary of losing partners in the effort to make its platform truly conducive to productivity. The market is larger and more complicated, with cross-platform and cross-device complications of which the App Store and iOS may only be a small part — but demanding an incredibly outsized share.\n It will loosen the grip, but there’s no hurry. It would be a costly indignity to be too permissive and have its new rules be gamed and hastily revised. Allowing developers to push back on rules they don’t like gives Apple a lot to work with but no commitment. Big players will get a big voice, no doubt, and the new normal for the App Store will reflect a detente between moneyed interests, not a generous change of heart by Apple.", "posttime": "2020-06-26 05:44:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果", "title": "\n四种观点：苹果会削减App Store费用吗？", "title_en": "\n\t\t\t\tFour perspectives: Will Apple trim App Store fees?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/four-perspectives-will-apple-trim-app-store-fees/", "via": "", "real_tags": ["apple", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "a91fc19bdf754215986181a4bee89fed.png", "infoid": 1008296, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免费更新将于7月3日到来，这标志着定于夏季发布的两波新内容中的第一波(无论如何，对北半球的玩家来说是如此)。这一更新邀请玩家跳入海洋，四处游泳，收集海葵、海星、鳗鱼和其他海洋动物，然后这些动物可以捐赠给他们的博物馆藏品。神秘的后半部分更新定于8月初发布。\n[公告]进入#AnimalCrossing：New Horizons免费夏季更新-第一波，7/3到来，为这个夏天降温吧！穿上潜水服潜水和在海洋中游泳，甚至可以结识新角色！请继续关注计划于8月初发布的第2波的相关信息。pic.twitter.com/cYd86R7g6D。\n游戏还将增加另一个新角色，帕斯卡，一只可以为你提供新食谱的海獭。任何玩过动物穿越游戏的人都会认出帕斯卡是一个冷静的人，他在漫不经心地踩水的同时，也同样散发着冰冷的智慧珍珠。\n对于一项围绕着熟悉的循环-收集水果、拔草、摇晃树木以找到漂亮的客厅家具-的游戏来说，游泳和跳水的增加实际上是一个相当大的变化。对于那些在大流行初期严厉打击“新地平线”的人来说，这可能是一个很好的理由，因为他们已经没有什么可以做的了，可以重新审视这个游戏。看看任天堂在New Horizons商店里还有什么会很有趣，因为这是游戏时代第一款期待发布后大量可下载内容的游戏，已经在路线图上规划了出来。\n如果像我一样，你的妻子不小心弄坏了你的一个开关控制器，而你已经三个星期没有玩了，这也是一个完美的时间，可以在你的村民中随意漫步，同时表现得好像没有经过任何时间。Lolly，如果你正在读这篇文章，我想让你知道他们是延期订购的，这不会改变我们之间的任何事情。真的。", "note_en": "The free update will arrive on July 3, marking the first of two waves of new content due out in the summer season (for players in the Northern Hemisphere, anyway!). The update invites players to plunge into the ocean and swim around to collect anemones, starfish, eels and other sea-faring creatures, which can then be donated to their museum collection. The mysterious second half of the update is due out in early August.\n [Announcement] Cool off this summer by diving into the  #AnimalCrossing: New Horizons free Summer Update – Wave 1, arriving 7/3! Put on your wet suit to dive &amp; swim in the ocean, and even meet new characters! Stay tuned for info on Wave 2, planned for release in early August.  pic.twitter.com/cYd86R7g6D\n The game will also add another new character, Pascal, a sea otter who you can hit up for new recipes. Anyone who’s played past Animal Crossing titles will recognize Pascal as a chill guy who doles out equally chill pearls of wisdom while casually treading water.\n For a game that revolves around familiar cycles—collecting fruit, pulling weeds, shaking trees to find nice living room furniture—the addition of swimming and diving is actually a pretty big change. And it’s probably a good reason for anyone who went hard on New Horizons in the early days of the pandemic and ran out of things to do to revisit the game. It’ll be interesting to see what else Nintendo has in store New Horizons, since it’s the first Animal Crossing title in in a gaming era that expects of plenty of post-release downloadable content already plotted out on the roadmap.\n It’s also the perfect time to casually stroll out among your villagers while acting like no time passed at all if, like me, your wife accidentally broke one of your Switch controllers and you haven’t played in three weeks. Lolly, if you’re reading this, I want you to know they were back-ordered and this doesn’t change anything between us. Really.", "posttime": "2020-06-26 05:44:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "穿越,crossing,游戏", "title": "\n动物穿越的夏季更新将让你为海洋生物游泳", "title_en": "\n\t\t\t\tAnimal Crossing’s summer update will let you swim for sea critters\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/animal-crossing-swimming-new-horizons/", "via": "", "real_tags": ["穿越", "crossing", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "42c7b6d39ffe0f8f62da687a9379d7bd.jpg", "infoid": 1008295, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JPL的Pulse Wearable使用3D打印部件和现成的、价格实惠的电子元件，只做一件事：提醒人们不要触摸他们的脸。喷气推进实验室的设计者声称，它非常简单，“任何人都可以很容易地复制这个小玩意儿，无论他们的专业水平如何”，为了鼓励更多的人和公司真正这样做，实验室通过开放源码许可证提供了完整的零部件清单、3D建模文件和完整的组装说明。\n脉搏本质上是一个吊坠，戴在离头部6英寸到1英尺的地方绕着脖子，它可以使用基于GaN IR的接近传感器检测到一个人的手何时接近他们的脸。然后，振动马达发出警报，当你的手靠近你的脸时，反应会变得更强。\n硬件本身很简单，但这就是关键所在。它的设计使用现成的3V硬币电池，如果你有一台3D打印机可以用来装箱子，还可以访问亚马逊，你可能很快就可以在家里自己组装一台。\nPULSE的目标显然不是单枪匹马消灭新冠肺炎-从受污染的手到人的嘴、鼻子或眼睛的接触性传播只是一个媒介，而且似乎很可能导致空气传播的呼吸道飞沫在传播病毒方面至少同样有效。但是，就像经常戴口罩可以极大地降低传播风险一样，最大限度地减少你触摸面部的频率可以与其他减少传播的措施产生很大的组合效应。\n实际上，其他健康可穿戴设备可能会在你出现明显症状或检测结果呈阳性之前告诉你新冠肺炎是什么时候患上的-但还需要做一些工作来了解这一功能有多好，以及如何用它来限制暴露。喷气推进实验室的“脉搏”有一个优势，那就是现在在建立积极的习惯方面是有效的，我们知道这些习惯将限制新冠肺炎的传播，以及其他病毒感染。", "note_en": "JPL’s PULSE wearable uses 3D-printed parts and readily available, affordable electronic components to do just one thing: remind a person not to touch their face. JPL’s designers claim that its simple enough that the gadget “can easily be reproduced by anyone regardless of their level of expertise,” and to encourage more people and companies to actually do that, the lab has made available a full list of parts, 3D modelling files and full instructions for its assembly via an open source license.\n The PULSE is essentially a pendant, worn between six inches and 1 foot from the head around the neck, which can detect when a person’s hand is approaching their face using gan IR-based proximity sensor. A vibration motor then shakes out an alert, and the response becomes stronger as your hand gets closer to your face.\n  The hardware itself is simple – but that’s the point. It’s designed to run on readily available 3V coin batteries, and if you have a 3D printer to hand for the case and access to Amazon, you can probably put one together yourself at home in no time.\n The goal of PULSE obviously isn’t to single-handedly eliminate COVID-19 – contact transmission from contaminated hands to a person’s mouth, nose or eyes is just one vector, and it seems likely that respiratory droplets that result in airborne transmission is at least as effective at passing’s the virus around. But just like regular mask-wearing can dramatically reduce transmission risk, minimizing how often you touch your face can have a big combinatory effect with other measures taken to reduce the spread.\n Other health wearables might actually be able to tell you when you have COVID-19 before you show significant symptoms or have a positive test result – but work still needs to be done to understand how well that works, and how it could be used to limit exposure. JPL’s Pulse has the advantage of being effective now in terms of building positive habits that we know will limit the spread of COVID-19, as well as other viral infections.", "posttime": "2020-06-26 05:43:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,开源,美国,喷气,spread", "title": "\n美国国家航空航天局喷气推进实验室开源一款反碰脸穿戴设备有助于减少新冠肺炎的传播", "title_en": "\n\t\t\t\tNASA’s JPL open-sources an anti-face touching wearable to help reduce the spread of COVID-19\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/06/25/nasas-jpl-open-sources-an-anti-face-touching-wearable-to-help-reduce-the-spread-of-covid-19/", "via": "", "real_tags": ["nasa", "开源", "美国", "喷气", "spread"]}, {"category": "", "categoryclass": "", "imagename": "e80d53ce807ce4d270894a0862ab2007.png", "infoid": 1008294, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华特迪士尼公司仍然致力于我们的儿童频道业务，并继续在许多也有迪士尼+的市场执行迪士尼频道的分销协议。\n今年秋天，华特迪士尼公司(Walt Disney Co.)将关闭其在英国的三个线性频道，并将内容转移到流媒体服务迪士尼+(Disney+)。\n迪士尼公司周四表示，从10月1日起，迪士尼+将成为迪士尼频道、迪士尼XD和迪士尼少年频道内容的英国独家总部。\n迪士尼表示，这项直接面向消费者的服务在头七个月就在全球获得了超过5450万订户，现在将首播迪士尼三个频道的所有最新电影、连续剧和特辑，同时还将在英国提供丰富而庞大的迪士尼频道电影目录，包括米老鼠俱乐部、后裔3和菲尼亚斯与费布。\n这家好莱坞企业集团补充说：华特迪士尼公司仍然致力于我们的儿童频道业务，并继续在许多也有迪士尼+的市场执行迪士尼频道的分销协议，目标是给我们的粉丝提供多个讲故事的切入点。 &#34；\n康卡斯特旗下的付费电视巨头天空英国公司(Sky U.K.)今年早些时候与迪士尼+达成了分销协议，该公司的一名代表表示：除了我们出色的线性频道(来自我们的合作伙伴维亚康姆(Viacom)和特纳(Turner))，我们还有5000多集点播内容，我们也在投资自己的天空儿童原创频道，比如Moominvley和Morph。孩子们可以观看最喜欢的乐高玩具，如Peppa Pig和Paw Patrol，海绵宝宝方裤和口香糖的神奇世界，所有精彩的乐高内容等等。而且，在[付费电视服务]Sky Q.&#34上，你可以在一个地方(连同最好的应用程序，如迪士尼+和Netflix)获得所有这些服务。\n一位分析师表示，迪士尼及其在英国的分销合作伙伴越来越难为该公司的三个孩子电视网达成对双方都有财务意义的运输协议，这使得整合频道内容成为合乎逻辑的下一步行动。\nPP Foresight分析师保罗·佩斯卡托雷称英国新闻是一个里程碑式的时刻，他解释说：流媒体革命正在加速，不容忽视。公司不能再继续支持一系列渠道，蚕食收入流。未来完全是流媒体，这一最新举措为其他公司树立了效仿的基准。", "note_en": "&#34;The Walt Disney Company remains committed to our kids channels business and continues to execute distribution agreements for Disney channels in many markets where Disney+ is also available.&#34;\n The Walt Disney Co. will close down its three linear channels in the U.K. this fall and move content to streaming service Disney+.\n From Oct. 1, Disney+ will become the exclusive U.K. home for content from Disney Channel, DisneyXD and Disney Junior, the company said Thursday.\n &#34;The direct-to-consumer service, which garnered more than 54.5 million subscribers worldwide in its first seven months, will now premiere all the latest films, series and specials from the three Disney Channels, along with offering a rich and expansive back catalogue of Disney Channel titles in the U.K., including  Mickey Mouse Clubhouse,  Descendants 3 and  Phineas and Ferb,&#34; Disney said.\n The Hollywood conglomerate added: &#34;The Walt Disney Company remains committed to our kids channels business and continues to execute distribution agreements for Disney channels in many markets where Disney+ is also available, with the goal of giving our fans multiple entry points to our storytelling. &#34;\n A representative for Comcast-owned pay TV giant Sky U.K., which earlier this year  struck a distribution deal for Disney+, said: &#34;We have over 5,000 episodes of on demand content alongside our brilliant linear channels, from our partners Viacom and Turner, and we’re investing more in our own Sky kids originals, too, like  Moominvalley and  Morph. Kids can watch favorites like  Peppa Pig and  Paw Patrol,  SpongeBob Squarepants and  The  Amazing World of Gumball, all the wonderful LEGO content and much, much more. And it is all available in one place – together with the best apps, like Disney+ and Netflix – on [premium pay TV service] Sky Q.&#34;\n One analyst suggested that it had been getting more difficult for Disney and its distribution partners in Britain to strike carriage deals for the company&#39;s three kids networks that make financial sense for both sides, making the consolidation of the channels&#39; content a logical next step.\n PP Foresight analyst Paolo Pescatore called the U.K. news &#34;a landmark moment,&#34; explaining: &#34;The streaming revolution is gathering pace and cannot be ignored. Companies can no longer continue to support a slew of channels and cannibalize revenue streams. The future is all about streaming and this latest move sets a benchmark for others to follow suit.&#34;", "posttime": "2020-06-26 05:43:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "迪士尼,disney", "title": "迪士尼儿童频道在英国关闭，内容转移到迪士尼+", "title_en": "Disney Kids Channels To Shutter In UK, Content Moving To Disney+", "transed": 1, "url": "https://www.hollywoodreporter.com/news/disney-kids-channels-shutter-uk-content-moving-disney-1300369", "via": "", "real_tags": ["迪士尼", "disney"]}, {"category": "", "categoryclass": "", "imagename": "9fae41a828393978daab94b30951889b.jpg", "infoid": 1008293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，三名北卡罗来纳州警察被解雇，因为调查人员发现警察自己的仪表盘摄像头意外记录下了令人难以置信的种族主义、令人不安的对话和暴力威胁。\n威尔明顿警察局长唐尼·威廉姆斯(Donny Williams)周三表示，凯文·皮纳(Kevin Piner)警官巡逻车上的仪表盘摄像头从两个小时的录音中捕捉到了超过46分钟的相关镜头。\n根据该部门的报告(PDF)，皮纳的相机是由于意外激活而被记录下来的。那次激活最终捕捉到了皮纳和另外两名警官杰西·摩尔(Jessie Moore)和布莱恩·吉尔摩(Brian Gilmore)--都是白人--使用众所周知的种族主义诽谤，讨论警察中的黑人成员和当地抗议者。摩尔一度说，一名当地治安官，一名黑人妇女，在三人谈论他们对内战即将到来的感受之前，需要一颗子弹击中她的头部，三人都声称已经准备好了。我们只是要出去开始屠杀他们，他妈的-s，&#34；皮纳补充道。\n威廉姆斯说，这些谈话非常无礼，理应立即采取行动。当我第一次得知这些对话时，我感到震惊、悲伤和厌恶。在我们的机构和我们的城市里，这种行为是没有立足之地的，也是不能容忍的。\n威廉姆斯还补充说，他正在向法院请愿，根据北卡罗来纳州的法律，决定是否可以公开发布这段视频。\n警察身体或仪表盘安装的摄像头经常被宣传为警方问责的福音，威尔明顿案件似乎证明了原因。\n最近几周，许多州和地方政府争相通过决议，呼吁增加摄像头的使用或资金，以回应正在进行的反对警察暴行和支持黑人社区的全国性抗议运动。例如，在纽约州，州议会刚刚通过立法，要求所有州警察都要配备随身相机。议长卡尔·希斯蒂谈到这项措施时说，作为美国最大的州警察机构之一，纽约州警察局应该是第一批树立榜样的机构之一，向其他人展示如何正确使用随身摄像头，向公众传递透明度和问责性。\n有时镜头确实能达到预期效果。例如，2017年，马里兰州有34起刑事案件被驳回，因为穿戴在身上的摄像头拍摄的画面显示，警察在嫌疑人附近种植毒品。\n但这项技术本身并不是灵丹妙药。“纽约时报”(New York Times)早在2017年就报道过，大大小小的警察部门都在推出昂贵的随身相机项目，但对这些问题没有一致的答案，或者根据政策专家的说法，没有令人信服的证据表明摄像头确保了公众要求的问责程度，而这些问题似乎还没有答案。\n2017年在华盛顿特区进行的一项研究发现，自从首都的警察开始佩戴随身相机后，警察的行为或公民投诉没有改变。2019年，研究人员发表了一项对70项关于警察随身相机的研究的荟萃分析，发现DC并不是唯一的一个，而且相机对警察行为或投诉的整体影响并不是始终如一的或显著的。\n隐私权倡导者也一直在警告随身携带的警用摄像头带来的危险，不仅是当警方与应该享有隐私的个人交谈时，而且在示威者认为自己是匿名的大规模抗议活动等情况下也是如此。\n美国公民自由联盟(American Civil Liberties Union)今天在一篇博客文章中写道，改革积极分子不应该简单地要求硬件。他们应该要求有效的人体相机项目，这些项目不仅包括相机，还包括强有力的政策和制度实践，以使这些相机有效。", "note_en": "Three North Carolina police officers were fired from their jobs this week after investigators found incredibly racist, troubling conversations, and threats of violence accidentally recorded by the cops&#39; own dashboard camera.\n The dashboard camera in Officer Kevin Piner&#39;s patrol car captured more than 46 minutes of relevant footage from a two-hour recording, Wilmington Police Chief Donny Williams  said Wednesday.\n According to the department&#39;s report ( PDF), Piner&#39;s camera was recording due to &#34;accidental activation.&#34; That activation ended up capturing Piner and two other officers, Jessie Moore and Brian Gilmore—all white—discussing Black members of the force as well as local protesters, using well-known racist slurs. At one point, Moore said a local magistrate, a Black woman, &#34;needed a bullet in her head,&#34; before the three discussed their feelings that a civil war was coming, for which all three claimed to be ready. &#34;We are just gonna go out and start slaughtering them fucking n------s,&#34; Piner added.\n The conversations &#34;were brutally offensive and deserved immediate action,&#34; Williams said. &#34;When I first learned of these conversations, I was shocked, saddened, and disgusted. There is no place for this behavior in our agency or our city and it will not be tolerated.&#34;\n Williams also added that he was petitioning the court to determine whether the footage could be released publicly, in accordance with  North Carolina law.\n  Police body or dashboard-mounted cameras are  often promoted as a boon to police accountability, and the Wilmington case seems to prove why.\n Many state and local governments have rushed to adopt resolutions in recent weeks calling for increased camera usage or funding, in response the ongoing nationwide protest movement against police brutality and in support of Black communities. In New York state, for example, the state Assembly  just passed legislation requiring body cameras for all state police. Speaker Carl Heastie said about the measure, &#34;As one of the largest state police agencies in the country, the New York State Police should be one of the first agencies to set an example, to show others how to properly use body cams to deliver transparency and accountability to the public.&#34;\n Sometimes the footage does indeed work as intended. In 2017, for example, 34 criminal cases were  thrown out in Maryland after footage from body-worn cameras showed police planting drugs near suspects.\n But the technology is not in and of itself a panacea. &#34;Police departments large and small are rolling out expensive body-camera programs without consistent answers to the questions or, according to policy experts, convincing evidence that the cameras ensure the level of accountability that the public demands,&#34;  The New York Times reported back in 2017, and those questions do not yet seem to have answers.\n A study conducted in Washington, DC, in 2017 found  no change in police behavior or citizen complaints after police in the nation&#39;s capital began wearing body cameras. In 2019, researchers who  published a meta-analysis of 70 studies on police body-worn cameras found that DC was not alone, and cameras did not have &#34;a consistent or significant effect&#34; on officer behavior or complaints overall.\n  Privacy advocates have also warned consistently about the dangers posed by body-worn police cameras, not only when police are  speaking with individuals who deserve privacy, but also in situations such as  mass protests when demonstrators believe they have anonymity.\n &#34;Reform activists should not simply demand hardware,&#34; the American Civil Liberties Union wrote in  a blog post today. &#34;They should demand effective body camera  programs, which include not just cameras but also strong policies and institutional practices to make those cameras effective.&#34;", "posttime": "2020-06-26 05:22:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "摄像头,fired,警察", "title": "三名警察在意外激活仪表盘摄像头捕捉到种族主义咆哮后被解雇", "title_en": "Three cops fired after accidental dashcam activation captures racist rants", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/06/three-cops-fired-after-accidental-dashcam-activation-captures-racist-rants/", "via": "", "real_tags": ["摄像头", "fired", "警察"]}, {"category": "", "categoryclass": "", "imagename": "9eab1a4a00f30c357c268171abb6b007.jpg", "infoid": 1008292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Mozilla宣布Comcast已经加入其可信递归解析器计划，该计划旨在使DNS(域名系统)更加可信和安全。CloudFlare和NextDNS已经是TRR计划的一部分，它们向选择在HTTPS(DoH)上使用DNS的Firefox用户提供DNS服务。\n康卡斯特公司已经迅速采取行动采用DNS加密技术，我们很高兴让他们加入TRR计划。将ISP纳入TRR计划有助于我们在不中断现有用户体验的情况下在线保护用户隐私。我们希望这为浏览器和ISP之间的进一步合作开创先例。“。\nMozilla在其TRR程序中表示，使用DoH加密DNS数据只是保护DNS安全的第一步。它说，第二步要求处理数据的公司有适当的规则来处理它。Mozilla认为这些规则包括限制数据收集和保留，确保任何保留数据的透明度，以及限制使用解析器来阻止访问或修改内容。\n我们很自豪能成为第一个与Mozilla一起支持DNS隐私这一重要发展的ISP。与全球技术界的合作为我们提供了更好的工具来保护我们的客户，像这样的伙伴关系推进了我们使客户的互联网体验更加私密和安全的使命。“。\nDNS是在线基础设施的重要组成部分，因为它的功能类似于电话簿；当您键入像Firefox.com这样的网站时，DNS会将此URL转换为计算机可以理解的互联网地址，然后您的浏览器可以将您连接到正确的位置。通过在HTTPS上引入DNS之类的功能，用户将受益于更高的安全性和私密性。", "note_en": "Mozilla  has announced that Comcast has joined its  Trusted Recursive Resolver program which aims to make DNS (domain name system) more trusted and secure. Cloudflare and NextDNS are already part of the TRR program and provide their DNS services to Firefox users who opt to use DNS over HTTPS (DoH).\n  “Comcast has moved quickly to adopt DNS encryption technology and we’re excited to have them join the TRR program. Bringing ISPs into the TRR program helps us protect user privacy online without disrupting existing user experiences. We hope this sets a precedent for further cooperation between browsers and ISPs.”\n With its TRR program, Mozilla said that encrypting DNS data with DoH is just the first step in securing DNS. It said that the second step requires companies handling the data to have appropriate rules in place for handling it. Mozilla believes these rules include limiting data collection and retention, ensuring transparency about any retained data, and limiting the use of the resolver to block access or modify content.\n  “We’re proud to be the first ISP to join with Mozilla to support this important evolution of DNS privacy. Engaging with the global technology community gives us better tools to protect our customers, and partnerships like this advance our mission to make our customers’ internet experience more private and secure.”\n DNS is an important part of the online infrastructure as it functions like a phone book; when you type in a website like Firefox.com, the DNS will translate this URL into an internet address that the computer understands, your browser can then connect you to the right place. By introducing things like DNS over HTTPS, users will benefit from more security and privacy.", "posttime": "2020-06-26 05:21:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加入,isp,dns", "title": "康卡斯特成为加入Mozilla TRR计划的第一家ISP", "title_en": "Comcast Becomes the First ISP To Join Mozilla's TRR Program", "transed": 1, "url": "https://www.neowin.net/news/comcast-becomes-the-first-isp-to-join-mozillas-trr-program/", "via": "", "real_tags": ["加入", "isp", "dns"]}, {"category": "", "categoryclass": "", "imagename": "b02d9197504a7271eb7875588c6ab4db.jpeg", "infoid": 1008291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你曾经在一座古老的建筑中工作过，你很有可能会在某个时候走过一个神秘的小黄铜盒子。它位于墙的一半左右，值得注意的是，一段平的玻璃长度进出它，消失在天花板和下面的地板上。它们经常被粉刷一遍，被忽视，没有人使用，它们是早期摩天大楼黄金时代的遗迹，被称为卡特勒邮件滑道。\n卡特勒邮槽在20世纪之交第一批多层建筑出现时蓬勃发展。这项发明相当简单：玻璃滑槽将在建筑物内部延伸，每层楼都有一个邮递槽。你不需要长途跋涉下楼去寻找最近的邮箱或邮局，你只需把你的信从你工作过的那个地板上的滑槽里扔进去，重力就会迅速把你的信送到大堂的邮箱，每天从邮递员那里取信。在那个人们每天都要寄一把信的时代，卡特勒邮筒的便利简直是天赐之物。\n值得注意的是，今天，卡特勒邮件降落伞仍然在使用。事实上，大约有900人在纽约积极工作，仅芝加哥就有360多人，邮局仍然定期从那里收集邮件。\n邮筒是由纽约州罗切斯特市的詹姆斯·古尔德·卡特勒于1883年发明的，最初安装在市中心的埃尔伍德大厦。事实证明，它立即取得了成功，卡特勒获得了邮寄系统的专利，这让他在接下来的20年里几乎获得了垄断地位。\n专利规定，大堂包厢本身必须由“金属制成，并明显标有‘US Letter Box’字样”，“门必须用一侧的铰链打开，门底离地面不少于2英尺6英寸”。为了保护可能会从许多楼层掉落的邮件，卡特勒为大堂的箱子配备了一个“弹性垫子，以防止邮件受到伤害。”\n在与邮局的密切合作下，卡特勒的专利系统首先安装在铁路和公共建筑中。\n但随着城市的蓬勃发展，在接下来的20年里，卡特勒售出了1600多个邮筒，进入了全新的、最先进的摩天大楼、写字楼、公寓和酒店。在他们名为装饰艺术邮箱、作家和邮件滑道爱好者凯伦·格林(Karen Greene)和琳恩·拉维尔(Lynne Lavelle)的典范插图设计史中，注意到卡特勒的系统是如何迅速变得“对任何主要酒店、写字楼、民用或住宅楼的运营至关重要，就像前门一样”。根据1888年罗切斯特的报告：\n在当今多层建筑的时代，在卡特勒美国邮筒投入使用之前，没有任何这样一座大厦的建造者或所有者拥有所有必要和方便的电器-这是一种与电梯一样对商人来说必不可少的设备。\n邮件滑道系统可能出自功能性，但卡特勒为邮箱本身注入了优雅。他的目录提供了大堂盒子，配有闪闪发光的黄铜配件和精心设计的细节。他还有远见卓识地与当时的领先建筑师合作，允许设计出与特定建筑的宏伟相匹配的个别邮箱。通过布奥艺术运动，到新艺术运动，再到装饰艺术，卡特勒的邮箱变得越来越漂亮和华丽。The Cutler Co.与丹尼尔·伯纳姆(The Flatiron)、施瑞夫·兰姆·哈蒙(Shreve，Lamb；Harmon)(帝国大厦)、斯隆·罗伯逊(St.Regis)和卡斯·吉尔伯特(Cass Gilbert)(伍尔沃斯)等建筑师合作。\n随着信件尺寸的增大，邮件通道的堵塞成为一个日益严重的问题。一个著名的例子发生在西42街宏伟的老麦格劳山大楼。这座建筑曾经是翡翠装饰艺术的杰作，也是漫威漫画的故居，现在已经褪色到年久失修，他们的邮筒在20世纪80年代中期被发现堵塞。当它最终被追踪并清除时，随之而来的雪崩般的无法投递的邮件填满了23个麻袋。\n偶尔，信件被卡住的时间会比这长得多。1995年，在佛罗里达州布鲁克斯维尔，一位名叫玛格丽特·格里斯代尔·林奇(Marguerite Grisdale Lynch)的女士惊讶地收到了她丈夫50年前寄来的一封信，50年前，他把信丢在了密歇根一家退伍军人医院的邮筒里。他已经去世19年了。\n到了20世纪90年代，消防法规几乎禁止在新建筑中安装Cutler邮件降落伞。定制的收发室取代了它们的用途。一些仍在运营的公司正在逐渐衰落；克莱斯勒大楼最近关闭了他们的大楼，而耀眼的华尔道夫-阿斯托里亚酒店也关闭了他们的三个降落伞。\n今天存放降落伞的建筑五花八门。有些是宏伟的，比如弗雷德·弗伦奇酒店闪闪发光的金色大厅，克莱斯勒汽车的光滑的铬和钢，罗斯福酒店的精致，以及中央车站的宏伟。其他的功能更多，比如港务局巴士终点站，百老汇、服装区和第五大道两旁排列着无数的办公室。\n我注意到的第一个Cutler邮件滑道是在我自己的工作大楼里，这是一个相当普通的20层办公室，建于1927年，位于第10大道和第34街的拐角处。我楼层的降落伞，也就是第5层，早已被漆成白色，但槽仍然敞开着。大厅的邮箱没有展示任何装饰艺术的东西，比方说，西联汇款旧大楼里的卡特勒信箱(Cutler Box)。但仍然整齐地摆放着标准卡特勒4165型的黄铜配件和黑色油漆镶嵌。在告诉大堂保安时，他不建议使用它超过16层，因为有一个地方堵塞了。他说：“有时候超级兵会上去把重物扔下去，把它清理干净。”\n然而，邮递员每天都会从卡特勒降落伞尽头的大堂信箱里取回信件。", "note_en": "If you have ever worked in an old building, the chances are you will have at some point walked past a small mysterious brass box . Located about halfway up the wall, it is notable for a flat length of glass leading both into and out it, disappearing into the ceiling and the floor below. Often painted over, ignored and unused, they are a relic of the golden age of early skyscrapers called the Cutler mail chute.\n The Cutler mail chutes flourished during the advent of the first multi-story buildings in the turn of the 20 th century. The invention was fairly simple: the glass chutes would run internally the length of the building, with a mailing slot on each floor. Rather than having to make the trek downstairs to find the nearest mail box or post office, you would simply pop your letter into the chute from whichever floored you worked on, and gravity would swiftly carry your letter to a mailbox in the lobby, for daily collection from the postman. In an era when people were sending handfuls of letters each day,  the convenience of the Cutler mail chute was a godsend.\n   Remarkably today, the Cutler mail chute is still in use. In fact there are approximately 900 actively working in New York and just over 360 in Chicago alone, from which the post office still routinely collects the mail.\n  The mail chute was invented by James Goold Cutler in Rochester, NY, in 1883 and was first installed at the  Elwood building in the center of the city. It proved an instant success and Cutler received the patent for the mailing system, that secured him  a virtual monopoly for the next 20 years.\n The patent specified that the lobby box itself must be made “of metal, distinctly marked ‘US Letter Box’”, and that the “door must open on hinges on one side, with the bottom of the door not less than 2’6 above the floor.” To protect items of mail that would be dropping from many floors, Cutler outfitted the lobby box with an  “elastic cushion to prevent injury to the mail.”\n   Working in close co-operation with the post office, Cutler’s patent system was first installed in  railways and public buildings.\n But as cities boomed skywards, over the next 20 years Cutler sold over 1,600 mail chutes, making their way into brand new, state of the art skyscrapers, office buildings, apartments and hotels. In their exemplary illustrated design history called   Art Deco Mailboxes, writers and mail chute aficionados Karen Greene and Lynne Lavelle, note how Cutler’s system quickly became as “essential to the operation of any major hotel, office, civic or residential building as the front door.” And according to report from Rochester in 1888:\n “In the present age of multi-storied buildings, no builder or owner of such an edifice has all the needful and convenient appliances until the Cutler US Mail Chute is in use therein—a device as necessary for the businessman as the elevator.”\n The mail chute system might have born out of functionality, but Cutler infused the mailboxes themselves with elegance. His catalogue offered lobby boxes furnished with gleaming brass fittings and elaborate detailing. He also had the foresight to collaborate with the leading architects of the day to allow the design of individual mail boxes that would match the grandeur of specific buildings. Through the Beaux Arts movement to Art Nouveau to Art Deco, Cutler’s mailboxes became increasingly beautiful and ornate. The Cutler Co. worked with architects such as Daniel Burnham (the Flatiron), Shreve, Lamb &amp; Harmon (the Empire State), Sloan &amp; Robertson (the St.Regis) and Cass Gilbert (the Woolworth).\n        As letters grew in size, clogging of the mail chutes became an increasing problem. A famous example occurred at the grand old McGraw Hill building on West 42nd Street. Once an emerald Art Deco masterpiece, and former home of Marvel Comics, the building has now faded into disrepair and a clog in their mail chute was discovered in the mid 1980s. When it was eventually tracked down and cleared, the resulting  avalanche of undelivered mail filled 23 sacks.\n Occasionally, letters get stuck for much longer than that. In 1995, in Brooksville, Florida a lady called Marguerite Grisdale Lynch was astonished to receive a letter from her husband 50 years after he dropped it in a mail chute in a Michigan Veteran’s hospital.  He had already been dead for 19 years.\n By the 1990s, fire codes all but outlawed Cutler mail chutes from being installed in new buildings. Bespoke mail rooms replaced their use. And some of the ones still in operation are gradually on the wane; the Chrysler building recently sealed theirs, whilst the glitzy Waldorf-Astoria also closed their three chutes.\n  The buildings that house the chutes today are a varied lot. Some are grand, such as the gleaming gold lobby of the Fred French, the sleek chromium and steel of the Chrysler, the sophistication of the Roosevelt hotel, and the magnificence of Grand Central Station. Others are more functional like the Port Authority bus terminal, and countless offices lining Broadway, the Garment District and Fifth Avenue.\n         The first Cutler mail chute I noticed was in my own work building, a fairly average 20 floor office built in 1927 on the corner of 10th Avenue and 34th Street. The chute on my floor, the 5th, had long been painted over in white, but the slot was still open. The mailbox in the lobby didn’t display any of the art deco flourishes of, say, the Cutler box in the old Western Union building. but was still neatly furnished with the brass fittings and black painted inlays of the standard Cutler model 4165. Speaking to the lobby security guard, he didn’t recommend using it up past floor 16 as there was a blockage somewhere. “Sometimes the super will go up and drop something heavy down there to clear it,” he said.\n Every day, though, the postman still retrieves letters from the lobby box at the end of the Cutler chute.", "posttime": "2020-06-26 05:21:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "纽约市,city,邮件", "title": "纽约市的邮筒(2015)", "title_en": "New York City’s Mail Chutes (2015)", "transed": 1, "url": "https://www.atlasobscura.com/articles/new-york-citys-mail-chutes-are-lovely-ingenious-and-almost-entirely-ignored", "via": "", "real_tags": ["纽约市", "city", "邮件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用展开元素，如手风琴、工具栏、工具提示或滑动侧栏(或其他非模态元素)。\n将用户引导到不同的页面，以隔离交互，而不会丢失对导航等功能的访问。\n考虑使用内联“撤消”选项来加速用户的交互，而不是使用确认模态。\n如果您一定要使用一个，请确保您的模式是好的！\n通过退出键、在模式窗口外单击以及带有清晰标签的关闭按钮，可以轻松清除破折号(&amp；)。\n这是相当不言而喻的-如果你不能让它变得容易访问，就不要使用模态。", "note_en": "Use expanding elements such as accordions, toolbars, tooltips, or sliding sidebars (or other modeless elements).\n  Lead the user to a different page to isolate the interaction without losing access to functionality such as navigation.\n  Instead of for instance confirmation modals, consider using inline “Undo” option to speed up the user&#39;s interactions.\n  If you absolutely have to use one, make sure your modal is a good one!\n  Make it simple to get rid of &amp;dash by escape key, clicking outside the modal window, and a clearly labelled close button.\n      This is fairly selfexplanatory — if you can&#39;t make it accessible, don&#39;t use a modal.", "posttime": "2020-06-26 05:20:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "情态,damn", "title": "我们用了太多该死的情态动词", "title_en": "We Use Too Many Damn Modals", "transed": 1, "url": "https://modalzmodalzmodalz.com/", "via": "", "real_tags": ["情态", "damn"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Fly的头几周是忙碌的，我边走边写东西，因为如果我必须学习，你也要学习。这会有点曲折，你得应付一下。\n让我们从“什么是飞翔？”开始吧。简要地说：Fly是一个用于Docker容器的内容交付网络。动态托管的应用程序速度很快，因为它们运行在离用户很近的机器上。要做到这一点，我们在许多城市运行裸机服务器，并将容器托管在这些服务器上的“鞭炮”虚拟机中。我们通过全局WireGuard网格代理从边缘服务器到容器的流量。它比ECS或K8要容易得多，所以注册一个免费账户可能是体验它的最好方式，也是一种燃烧5-10分钟的愉快方式。\n显然，要执行此类操作，您需要生成证书。2020年要做到这一点，合理的方式是使用LetsEncrypt。我们会自动为我们的用户做这件事，但是“它就是有效的”使得这篇文章相当枯燥，所以让我们看看我能做得有多复杂和多曲折。\nLetsEncrypt不是验证来自“合格的独立信息源”的信息，而是简单地基于域的所有权证明进行域验证证书，并由名为ACME的协议驱动。Acme非常简单。它几乎是在纯Bourne shell中实现的。其中最复杂的是JWS签名，虽然很糟糕，但至少是标准化的。ACME协议本身是通过普通HTTP请求完成的；流程大致如下：\n您创建一个帐户并将ECDSA/EdDSA密钥与其相关联，随后该密钥将对您的所有请求进行身份验证。\n然后您发布证书的“订单”，指定您需要的DNS名称。作为回报，您将获得“授权”和“最终”URL。\n您在自己端设置质询，然后轮询状态URL以验证质询是否已完成。\nAcme质询旨在验证您对某个域的所有权。它们有三个(如果算上预授权，有四个，LetsEncrypt没有)；最初，它们是：\ntls-http-01，其中您将获得一个令牌，放在您的服务器上的/.well-now/acme-challengl下，并在80/tcp上服务于LetsEncrypt的客户机。这很容易描述和实现，但是需要您响应80/TCP上的HTTP请求，这是很多人(明智地)不想做的。\nTLS-DNS-01，其中给您一个令牌以放入您的DNS区域的TXT记录中。这直接证明了对域的控制，但操作员很难做到这一点。特别是，尤其是在较大的组织中，需要证书的人不一定被授予访问DNS配置的权限。\ntns-sni-01，其中您将获得一个令牌，用于将您向通过TLS SNI请求证书的TLS客户端提供的证书嵌入到SAN中，这相当于TLS的HTTP“Host”标头。这一点实现起来比较复杂，但却是最大的挑战：您所需要做的就是运行您本来要运行的TLS服务器。\n但TLS-SNI-01已不复存在，因为它不安全。SNI挑战的问题是共享主机。\n由于IP地址稀缺，许多主机提供商安排客户共享IP地址。当客户的请求到达时，它们基于SNI进行路由。\n与您可以配置本地nginx以响应任何Host标头而不中断Internet的方式相同，托管提供商通常允许人们在其平台上“声明”任意主机名。这表面上无关紧要，因为如果没有对DNS的控制，您无法让人们与您声称的主机名对话。\n你可能已经看到这是怎么回事了。下面是LetsEncrypt使用SNI验证域所有权的方法：\n它为您生成了一个令牌，用于放入一个自签名证书，其形式为“.acme.invalid”主机名。\n它解析了您在DNS中为其生成证书的主机名，并将其连接到该主机名。\n如果主机提供商让您在“.Invalid”TLD中声明名称，并为它们上传您自己的证书，您可以获得为您IP上托管的所有客户颁发的证书。Heroku允许您这样做，AWS CloudFront也是如此，谁知道还会有谁呢。\nLetsEncrypt在主机提供商部署修复程序的同时，迅速解决了SNI的挑战。最终，SNI被如此广泛地使用，以至于CA得出结论，将SNI用作挑战从根本上是不安全的，ACME SNI挑战被否决，并最终在去年被删除。\n此攻击是一种称为“子域接管”的更广泛攻击类别的实例，该攻击类别是漏洞赏金猎人的中流砥柱。如果你想在一个晚上赚50美元左右，HackerOne会告诉你一切。\n因此，每当您为客户域托管内容时，您都会遇到当客户停止使用您的服务时会发生什么的问题。正如您可能预期的那样，很多时候您会忘记停止向旧的过期服务转发DNS。但您在这些服务上的帐户已失效，这通常意味着其他人可以声明与您使用的名称相同的名称。由于您仍在将流量定向到该服务，新的索赔人现在已经劫持了您的一个子域。\n这对于各种原因都是不好的；它允许您窃取cookie、违反CORS、绕过CSP；它甚至会影响OAuth2。\nFly通过不重复使用IP地址缓解了ALPN挑战的这一问题。每个应用程序都获得一个唯一的、可路由的IPv6地址，除非目标主机名通过CNAME解析为该IPv6地址，否则我们不会尝试让验证加密。(我们为DNS挑战做了类似的事情)。\n回想一下TLS-SNI-01挑战的优点：它不需要您有权访问您的DNS配置，也不需要打开80/tcp。你想要这样的挑战。还有一个：新的第三届ACME挑战赛，TLS-ALPN-01。\n要理解TLS-ALPN-01，您当然需要知道ALPN是什么。这是一个简单的概念：假设TLS本身就是一个传输协议，与TCP和UDP并驾齐驱；ALPN将是它的端口号。我是说，它们是字符串，不是数字，而是一样的概念。\n为什么TLS需要这样的东西？大多数使用TLS的东西都已经有了自己的TCP端口。当然，答案是HTTP/2。HTTP/2与HTTP/1(它是为流水线优化的二进制协议)不是有线兼容的。但它不能有自己的TCP端口，因为如果有，就没有人能说出自己的话：互联网的大量数据都被锁定在端口80和443上。\n(顺便说一句，我们不是在运行；您可以在这里运行您想要的任何TCP服务。但我离题了)。\n为了解决这个问题，当Google在设计SPDY(HTTP/2的前身)时，他们提出了NPN，即“下一协议协商”。NPN的工作方式是：\nTLS客户端向其ClientHello添加了NPN扩展，即TLS客户端发送以打开连接的消息。\n支持的TLS服务器将使用ServerHello进行响应，该服务器具有填充了其支持的协议的NPN扩展。\n密钥交换已经完成，连接的两端都将开启加密。\nTLS客户端将发送加密的NextProtocol消息，该消息选择下一个协议(从技术上讲，如果双方都试图偷偷摸摸的话，该协议可能是服务器列出的协议，也可能不是)。\n通过这样做，Chrome可以在与谷歌服务器交谈时选择使用SPDY，而不需要花费往返的谈判时间。\n当SPDY变成HTTP/2时，像NPN这样的东西也需要标准化。但是IETF TLS-WG并不喜欢NPN；尤其是，它颠倒了TLS协商的正常顺序，即客户端提议和服务器选择。因此，IETF提出了应用层协议协商(ALPN)。ALPN的工作原理如下：\nTLS客户端将ALPN扩展添加到其ClientHello，以指示其支持的所有协议。\nTLS服务器在其ServerHello中指示其在ALPN扩展中选择的协议。\n这里有明显的隐私暗示，对吗？因为您可能要求的ALPN协议是“TOR”。IETF毁了一切。这是真的，但这很复杂。\n首先，加密的NextProtocol帧提供的安全性有点粗略。以下是一次袭击的概要：\n爱丽丝连接到鲍勃，马洛里非常想知道爱丽丝会要求什么协议。\nMallory MITMS连接并降低其安全级别。请记住，当“Finish”消息对握手进行了密码身份验证时，NPN正在运行/Inside/握手，而不是/After/It。\n同时，Alice重新连接，因为这就是您要做的，并直接与Bob重复完全相同的过程，发送相同的NextProtocol。\n在实践中，使用Firefox时，您可以通过发送一个假证书来完成此操作；Firefox将完成握手(包括NPN)，即使证书没有验证。\n(不管它有什么价值，这里的一些隐私问题在TLS 1.3中都有讨论)。\n此外，尽管亚当·兰利(Adam Langley)在编写NPN规范时无疑考虑到了隐私问题，但更重要的问题可能是中间盒兼容性。\n中间盒的工作方式是，企业购买它们。它们相当昂贵，而且企业一口气买了一大堆可怕的东西，所以供应商们真的很努力地赢得了这些交易。赢得预选赛的一个直接方法是比你的竞争对手拥有更多的功能。这里有一个特性：“根据客户端选择的应用程序协议过滤连接”。Chrome团队大概在一英里外看到了这个愚蠢的功能，通过加密NPN选择将其从桌面上删除。\n(这听起来有点偏执，但前提是您从未使用过真实的TLS。在NPN vs.ALPN TLS-WG线程中，AGL引用了他们在英国发现的一家ISP，该ISP自行阻止了所有ECDHE密码组。为什么？谁知道呢？人们会做这样的事情。)。\n最终，ALPN在TLS-WG中击败了NPN。但是，就在他们完成标准的时候，Mozilla的布莱恩·史密斯(也是Rust的戒指密码库的作者)把事情搞砸了。\n根据Mozilla的经验，在某些情况下，当他们收到长度超过255个字节的ClientHello时，中间盒就会挂起。挂起是非常糟糕的，因为Mozilla需要超时逻辑来检测它，并尝试更简单的握手，但这种逻辑也会对使用糟糕的互联网连接的人触发，并产生阻止这些人使用现代TLS的效果。\n神奇的是，一天后，F5的吴晓勇跳上了线程，解释说旧的F5软件将256字节的ClientHello帧与TLSv2混淆了。TLS帧长度为2字节宽；一旦ClientHello超过255字节，最高长度字节变为01h。该字节在帧中的位置与SSLv2中的消息类型相同。对于F5，帧可以是长客户端Hello…。或者非常长的SSLV2 MTCLIENTHELLO，也是01h。F5选择了SSLv2。\n解决办法是什么？发送/更多/字节！在512字节时，高长字节不再是01h。因此诞生了“jpeg-of-cat”扩展，AGL将其重命名为“TLS ClientHello填充扩展”，以此为乐趣。\n这有点平淡无奇，但是我们已经走了这么远，所以您不妨了解一下Fly(和其他CDN，以及Caddy之类的东西)是如何使用ACME生成证书的：\nLetsEncrypt为我们提供了一个令牌，我们为它生成嵌入了令牌的自签名证书，并将其加载到分布式证书存储中。\n我们(在ACME中)说“继续”，LetsEncrypt查找我们正在服务的主机名，连接到它，并发送一个将“acme-TLS/1”设置为ALPN协议的ClientHello。\n我们的Rust代理捕获ACME ALPN案例，检索质询证书，并将其提供给LetsEncrypt。\nLetsEncrypt丢弃连接，将质询设置为已完成，并允许我们完成证书生成。\nALPN挑战比SNI挑战更明确；我们必须专门设置子服务来为客户完成ALPN挑战，而不是在某种程度上基于我们本地的SNI处理来隐式完成。(根据我们的证书处理方式，我们无论如何都不会有问题，但这就是为什么ALPN可以，而SNI不可以的逻辑)。\n这个过程几乎是无缝的；你所要做的就是说“是的，我想要我的应用程序自定义域的TLS证书”。不过，它只适用于单个主机名，这可能没有问题，但如果不适用，您可以与我们一起进行DNS质询，以生成通配符证书。", "note_en": "It’s been a hectic first couple of weeks at Fly, and I’m writing things up as I go along, because if I have to learn, so do you. This is going to be a bit of a meander; you’ll have to deal.\n  Let’s start with “ what’s Fly?” Briefly: Fly is a content delivery network for Docker containers. Applications hosted on Fly are fast because they’re running on machines close to users. To do that, we run bare metal servers in a bunch of cities and host containers on them in  Firecracker VMs. We proxy traffic from edge servers to containers through a global  WireGuard mesh. It’s much easier to play with than ECS or K8s is, so  signing up for a free account is probably the best way to get a feel for it, and a pleasant way to burn 5-10 minutes.\n  Obviously, to do stuff like this, you need to generate certificates. The reasonable way to do that in 2020 is with LetsEncrypt. We do that for our users automatically, but “it just works” makes for a pretty boring writeup, so let’s see how complicated and meandering I can make this.\n     Rather than verifying information from  “Qualified Independent Information Sources”, LetsEncrypt does domain-validated certificates, based simply on proof of ownership of a domain, and is driven by a protocol called ACME. ACME is really simple. It’s been  implemented in almost pure Bourne shell. The most complicated thing about it is JWS signatures, which are awful, but at least standardized. The ACME protocol is itself done over normal HTTP requests; the flow is roughly:\n  You make an account and associate an ECDSA/EdDSA key with it, which subsequently authenticates all your requests.\n You then post an “order” for a certificate, specifying the DNS names you need it for. You’re given “authorization” and “finalization” URLs in return.\n  You set up the challenges on your own side, and then poll a status URL to verify that the challenges have completed.\n  ACME challenges are intended to verify your ownership of a domain. There are three of them (four, if you count preauthorization, which LetsEncrypt doesn’t do); originally, they were:\n  tls-http-01, in which you’re given a token to put on your server, under /.well-known/acme-challenge, and serve to LetsEncrypt’s client on 80/tcp. This is simple to describe and implement, but requires you to respond to HTTP requests on 80/tcp, which lots of people (sensibly) don’t want to do.\n tls-dns-01, in which you’re given a token to put in a TXT record in your DNS zone. This directly proves control over a domain, but it can be hard for operators to do. In particular, especially in larger organizations, the people who need certificates are not necessarily given access to DNS configuration.\n tns-sni-01, in which you’re given a token to embed in the SAN of a certificate you serve to TLS clients who request it through TLS SNI, which is TLS’s equivalent of the HTTP “Host” header. This is more complicated to implement, but is the most seamless of the challenges: all you need to do it is to run the TLS server you were going to run anyways.\n   But  tls-sni-01 no longer exists, because  it’s insecure. The problem with SNI challenges is shared hosting.\n  Because IP addresses are scarce, many hosting providers arrange for customers to share IP addresses. As requests arrive for customers, they’re routed based on SNI.\n  In the same way that you can configure a local nginx to respond to any Host header without breaking the Internet, hosting providers routinely allow people to “claim” arbitrary hostnames on their platforms. This ostensibly doesn’t matter, because without control of the DNS, you can’t get people to talk to your claimed hostname.\n    You may see where this is going already. Here’s what LetsEncrypt did to verify domain ownership using SNI:\n  It generated a token for you to put in a self-signed certificate, in the form of an “.acme.invalid” hostname.\n It resolved the hostname you were generating a certificate for in the DNS and connected to it.\n  If a hosting provider let you claim names in the “.invalid” TLD, and upload your own certificate for them, you could get a certificate issued for all the customers hosted on your IP. Heroku let you do this, as did AWS Cloudfront, and who knows who else.\n  LetsEncrypt quickly  took the SNI challenges down while hosting providers deployed fixes. Ultimately, SNI was so widely used this way that CAs concluded SNI was fundamentally unsafe to use as a challenge, and the ACME SNI challenge was deprecated, and finally removed last year.\n   This attack is an instance of a broader attack class called “subdomain takeover”, which is a mainstay among bug bounty hunters.  HackerOne will tell you all about it, if you want to make $50 or so in an evening.\n  So, any time you’re hosting content for customer domains, you have the problem of what happens when the customer stops using your service. As you might expect, lots of times you’ll forget to stop forwarding DNS to old expired services. But your account on those services has lapsed, and that usually means that other people can claim the same names you were using. Since you’re still directing traffic to the service, the new claimant has now hijacked one of your subdomains.\n  Which is bad for all kinds of reasons; it allows you to steal cookies, violate CORS, bypass CSP; it even impacts OAuth2.\n  Fly mitigates this problem for ALPN challenges by not reusing IP addresses. Every application gets a unique, routable IPv6 address, and we won’t attempt Lets Encrypt validation unless the target hostname resolves via CNAME to that IPv6 address. (We do something similar for DNS challenges).\n   Recall the virtue of the  tls-sni-01 challenge: it doesn’t require you to have access to your DNS configuration, nor do you need to open 80/tcp. You want a challenge that works this way. And there is one: the new third ACME challenge,  tls-alpn-01.\n  To grok  tls-alpn-01, you’ll of course need to know what ALPN is. It’s an easy concept: Imagine TLS was a transport protocol in its own right, alongside TCP and UDP; ALPN would be its port number. I mean, they’re strings, not numbers, but same idea.\n  Why does TLS need such a thing? Most things that use TLS have their own TCP ports already. The answer is, of course,  HTTP/2. HTTP/2 isn’t wire-compatible with HTTP/1 (it’s a binary protocol optimized for pipelining). But it can’t have its own TCP port, because if it did, nobody would be able to speak it: huge chunks of the Internet are locked down to ports 80 and 443.\n  (We’re not, at Fly, by the way; you can run any TCP service you want here. But I digress from my digressions).\n  To solve this problem, when Google was designing SPDY (HTTP/2’s predecessor), they came up with NPN,  “Next Protocol Negotiation”. The way NPN worked was:\n  A TLS client added an NPN extension to their ClientHello, the message TLS clients send to open up a connection.\n A supportive TLS server would respond with a ServerHello that had an NPN extension populated with the protocols it supported.\n A key exchange having been completed, both sides of the connection would switch on encryption.\n The TLS client would send an encrypted NextProtocol message that chose a next protocol (which technically may or may not have been one listed by the server, if both sides were trying to be sneaky about things).\n  By doing this, Chrome could opt into SPDY when talking to Google servers without burning a round trip for the negotiation.\n  When SPDY turned into HTTP/2, something like NPN needed to get standardized, too. But the IETF tls-wg  wasn’t a fan of NPN; in particular, it reversed the normal order of TLS negotiation, where the client proposes and the server chooses. So the IETF came up with ALPN,  Application Layer Protocol Negotiation. ALPN works like this:\n  A TLS client adds an ALPN extension to its ClientHello indicating all the protocols it supports.\n A TLS server indicates which protocol it selected in the ALPN extension in its ServerHello.\n  There’s a clear privacy implication here, right? Because the ALPN protocol you might be asking for is “tor”. The IETF ruins everything. And that’s true, but it’s complicated.\n  First, the security offered by the encrypted NextProtocol frame was a little sketchy. Here’s an  outline of an attack:\n  Alice connects to Bob, and Mallory really wants to know what protocol Alice is going to ask for.\n Mallory MITMs the connection and downgrades its security. Remember that NPN is running /inside/ the handshake, not /after/ it, when the “Finished” message has cryptographically authenticated the handshake.\n   Alice, meanwhile, re-connects, because that’s what you do, and repeats the exact same process with Bob directly, sending the same NextProtocol.\n  In practice, with Firefox, you could at one point do this  simply by sending a bogus certificate; Firefox would complete the handshake, NPN included, even if the certificate didn’t validate.\n  (For what it’s worth, some of the privacy issues here got mooted in  TLS 1.3).\n   Additionally, while privacy was doubtlessly on Adam Langley’s mind when he wrote the NPN spec, the more important problem was probably middlebox compatibility.\n  The way middleboxes work is, enterprises buy them. They’re quite expensive, and enterprises buy big ghastly bunches of them in one go, so vendors work really hard to win those deals. And one straightforward way to win a bakeoff is to come to it with more features than your competitors. Here’s a feature: “filter connections based on what application protocol the client selects”. The Chrome team, presumably seeing that dumb feature a mile away, took it off the table by encrypting NPN selections.\n  (This sounds paranoid, but only if you’ve never worked on real-world TLS. In the NPN vs. ALPN tls-wg thread, AGL cited an ISP they found in the UK that took it upon themselves to block all the ECDHE ciphersuites. Why? Who knows? People do stuff like this.)\n  Ultimately, ALPN beat out NPN in the tls-wg. But, just as they were wrapping up the standard, Brian Smith at Mozilla (and author of Rust’s ring crypto library)  threw a wrench in the works.\n  It had been Mozilla’s experience that, in some cases, middleboxes would hang when they got a ClientHello that was more than 255 bytes long. Hanging is very bad, because Mozilla needed timeout logic to detect it and try a simpler handshake, but that logic would also fire for people on crappy Internet connections, and had the effect of preventing those people from using modern TLS at all.\n  Miraculously, a day later, Xiaoyong Wu at F5  jumped onto the thread to explain that older F5 software confused 256 byte ClientHello frames with TLSv2. TLS frame lengths are 2 bytes wide; once the ClientHello ticks past 255 bytes, the high length byte becomes 01h. That byte occupies the same point in the frame as the message type in SSLv2. To the F5, the frame could be a long-ish ClientHello… or a very long SSLV2 MTCLIENTHELLO, which was also 01h. The F5 chose SSLv2.\n  The fix? Send /more/ bytes! At 512 bytes, the high length byte is no longer 01h. And thus was born the “jpeg-of-a-cat” extension, which AGL took the fun out of by renaming it  “the TLS ClientHello Padding Extension”.\n   This is a little anti-climactic, but we’ve come all this way, so you might as well understand how Fly (and other CDNs, and things like Caddy) generates certificates with ACME:\n  LetsEncrypt gives us a token, for which we generate a self-signed certificate with the token embedded, that we load into our distributed certificate storage.\n We say (in ACME) “go ahead”, and LetsEncrypt looks up the hostname we’re serving, connects to it, and sends a ClientHello with “acme-tls/1” set as the ALPN protocol.\n Our Rust proxy catches the ACME ALPN case, retrieves the challenge certificate, and feeds it to LetsEncrypt.\n LetsEncrypt drops the connection, sets the challenge to completed, and allows us to complete the certificate generation.\n  The ALPN challenge is more explicit than the SNI challenge; we had to specifically set up a subservice to complete ALPN challenges for customers, rather than doing it sort of implicitly based on our native SNI handling. (We wouldn’t have had the problem anyways based on how our certificate handling works, but this is the logic behind why ALPN is OK and SNI isn’t).\n  This process is pretty much seamless; all you have to do is say “yeah, I want a TLS certificate for my app’s custom domain”. It only works with individual hostnames, though, which may be fine, but if it isn’t, you can do a DNS challenge with us to generate a wildcard certificate.", "posttime": "2020-06-26 05:20:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生成,generate,tls", "title": "CDN如何生成证书", "title_en": "How CDNs Generate Certificates", "transed": 1, "url": "https://fly.io/blog/how-cdns-generate-certificates/", "via": "", "real_tags": ["生成", "generate", "tls"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在就开始使用面向技术专业人士的在线简历生成器免费构建您的简历。我们将为您提供数据驱动的推荐，帮助您找到梦寐以求的工作。", "note_en": "Start building your resume for free today with the online          resume builder for tech professionals. We'll give          you data-driven recommendations to help you land your dream job.", "posttime": "2020-06-26 05:19:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "种族,diversity", "title": "从数字看科技领域的种族多样性", "title_en": "Racial Diversity In Tech By The Numbers", "transed": 1, "url": "https://www.beamjobs.com/diversity/racial-diversity-in-tech", "via": "", "real_tags": ["种族", "diversity"]}]