[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1029108, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "否则，我们的路径必须使用图中所示的其中一条紫色边。此外，由于路径(和循环)不能重复顶点，因此一旦使用了这些紫色边中的一条，其他边就不能使用了，因为否则我们将返回顶点$u$。这是被禁止的。所以我们可以去掉紫色的边，然后对于每个红色的顶点，我们计算从那里到$v$的路径数。因此，让我们获得紫色边列表，并删除它们：对于紫色边中的边，如果e[0]==u或e[1]==u，则紫色边=[e for e in graph_edges if e[0]==u或e[1]==u]：del graph_edge[edge]。\n然后我们就会得到红色顶点的列表。如果e[0]==u]，则对于紫色边缘中的e，红色顶点=[e[1]；如果e[1]==u，则对于紫色边缘中的e，红色顶点=[e[1])。\n从$u$到$v$的路径总数是从红色顶点到$v$的路径总数。因此，我们通过递归调用相同例程来求和：最后，我们将所有这些边放回原处，并返回我们的结果：def count_path(graph_edges，u，V)：if u==v：对于紫色边缘中的边，如果e[0]==u或e[1]==u，则返回1紫色边缘=[e对于graph_edges中的e，或者e[1]==u]。对于紫色边缘中的e，如果e[0]==u，则返回1紫色边缘中的e；如果e[1]==u，则返回1紫色边缘中的e；对于red_vertex中的red_vertex，如果e[1]=u，则返回[e[0]；对于red_vertex中的red_vertex，总计=0；对于red_vertex中的red_vertex，总计+=count_path(graph_edges，red_vertex，V)对于紫色边缘中的边：GRAPH_EDGES[EDGE]=1返回totaldef COUNT_COUNDS(GRAPH_EDGES)：如果不是GRAPE_EDGES：返回0 SELECTED_EDGE=CHOOSE_EDGE(GRAPH_EDGES)del GRAPH_EDGE[SELECTED_EDGE]Cycle_Without=COUNT_CORLES(GRAPH_EDGE)u，v=vertices_of_edge(SELECTED_EDGE)CYCLES_WITH=count_path(graph_Edges，u，v)graph_Edgees[SELECTED_EDGE]=1返回COUNT_PAT", "note_en": "Otherwise our path must use one of the purple edges shown here onthe diagram. Further, since paths (and cycles) can&#39;t repeat a vertex,once one of these purple edges is used, the other ones can&#39;t be usedbecause otherwise we would be returning to vertex $u$. Which isforbidden. So we can remove the purple edges, and for each of the red verticeswe then count the number of paths from that to $v$. So let&#39;s get our list of purple edges, and remove them: purple_edges = [ e for e in graph_edges if e[0]==u or e[1]==u ] for edge in purple_edges: del graph_edges[ edge ]\n  Then we get our list of red vertices. red_vertices = [ e[1] for e in purple_edges if e[0]==u ] + [ e[0] for e in purple_edges if e[1]==u ]\n  The total number of paths from $u$ to $v$ is the total number ofpaths from the red vertices to $v$. So we take that total by arecursive call to this same routine: Finally, we put all those edges back, and return our result: def count_paths( graph_edges, u, v ): if u == v: return 1 purple_edges = [ e for e in graph_edges if e[0]==u or e[1]==u ] for edge in purple_edges: del graph_edges[ edge ] red_vertices = [ e[1] for e in purple_edges if e[0]==u ] + [ e[0] for e in purple_edges if e[1]==u ] total = 0 for red_vertex in red_vertices: total += count_paths( graph_edges, red_vertex, v ) for edge in purple_edges: graph_edges[ edge ] = 1 return totaldef count_cycles( graph_edges ): if not graph_edges: return 0 selected_edge = choose_edge( graph_edges ) del graph_edges[ selected_edge ] cycles_without = count_cycles( graph_edges ) u, v = vertices_of_edge( selected_edge ) cycles_with = count_paths( graph_edges, u, v ) graph_edges[ selected_edge ] = 1 return cycles_without + cycles_with", "posttime": "2020-10-16 03:59:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "递归,recursion,count", "title": "再谈递归", "title_en": "Recursion Revisited", "transed": 1, "url": "https://www.solipsys.co.uk/new/RecursionRevisited.html?tj15hn", "via": "", "real_tags": ["递归", "recursion", "count"]}, {"category": "", "categoryclass": "", "imagename": "b97cca6d91bae968d69833d8f8da7015.png", "infoid": 1029107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虚拟现实(VR)是一项正在消费者市场获得吸引力的技术。随之而来的是一种前所未有的跟踪身体运动的能力。这些身体动作是对个人身份、医疗条件和精神状态的诊断。以前的工作集中在理想化情况下身体运动的可识别性，在这种情况下，研究设计者选择了一些动作。相比之下，我们的工作是在典型的VR观看环境下测试用户的可识别性，没有专门设计识别任务。在511名参与者中，当对每人不到5分钟的跟踪数据进行培训时，系统正确识别了95%的用户。我们认为，这些结果表明，非语言数据应该被公众和研究人员理解为个人识别数据。\n虚拟现实(Virtual Reality)是一种利用计算技术来创建模拟环境的技术，近年来使用激增1。为了从用户的角度呈现虚拟世界，必须计算和跟踪用户的位置。所有的VR系统都测量头部方向，大多数测量头部位置，还有很多测量手部方向和位置2。虽然不太常见，但一些系统可以跟踪脚、胸部，甚至手肘和膝盖，以增加沉浸感3。对于关心隐私的用户来说，这些数据是一个问题。VR提供的跟踪数据可以是可识别的。\n与以前专注于设计VR任务来识别或验证用户4、5、6的工作不同，我们从一个不是为识别而设计的任务开始。事实上，我们使用的跟踪数据来自一项研究7，其目的是检查运动、自我报告情感数据和视频内容之间的关联。\n此外，目前的工作是独特的，因为它使用了一个非常大的(超过500个)和多样化的样本，主要来自大学以外的地方。样本的这两个特征在理论上是相关的。首先，在小样本中的识别可能高估了某些特征的诊断能力，因为身体大小和其他方差来源没有重叠。其次，不同的人可能有不同类型的身体运动。例如，这项研究有60多名55岁以上的参与者，这一群体的运动很可能与典型的大学生不同。\n如果跟踪数据本质上是可识别的，那么随着VR变得越来越流行，这对隐私有重要的影响。最紧迫的一类问题属于去识别数据的过程。发布研究数据集或共享VR数据以删除任何可以识别参与者或用户的信息是标准做法。在Oculus和HTC的隐私政策中，这两家公司都被允许分享任何未识别的数据。Oculus和HTC是2020年最受欢迎的两款VR头盔的制造商。如果跟踪数据是根据未识别数据的规则共享的，那么无论原则上承诺什么，从数据集中删除一个人的名字实际上收效甚微。\n第二类威胁广泛涉及将VR会话链接在一起的改进能力。以前分散和分离的信息现在可以通过“运动签名”连接在一起。例如，在将一些跟踪数据连接到名称时，现在许多其他地方的跟踪数据都附加到相同的名称。这提高了基于从跟踪数据推断受保护的健康信息的威胁的有效性(例如，请参阅相关工作)。\n第三类威胁来自私人浏览。原则上，有一种方法可以在网络浏览器中进入私人浏览模式。虽然这可能很困难，并且需要许多工具来隐藏多层信息，但这是可能的。有了准确的虚拟现实跟踪数据，私人浏览模式原则上是不可能的。\n仅使用位置跟踪数据，我们发现，即使有500多个参与者可供选择，一个简单的机器学习模型也可以从不到5分钟的跟踪数据中识别参与者，准确率在95%以上。因此，我们提供的数据表明，典型的虚拟现实体验产生了识别数据。此外，通过检查不同类型的模型和不同的特征集，我们阐明了识别背后的可能机制，这也提出了防止滥用的策略。\n本文首先回顾了相关工作的两条主线：通过跟踪数据识别用户的方法，以及对VR隐私的关注。其次，介绍了实验装置和数据采集过程。最后，报告了各个识别任务的结果，并对结果进行了讨论。\n以前的工作使用跟踪数据来识别用户，但识别是正面的，通常是作为身份验证的工具。VR的持续采用引发了人们对VR跟踪数据的担忧，认为这是一个隐私问题。\nVR跟踪数据作为身体姿势和运动的衡量标准，是一个令人惊讶的强大信息来源。各种身体运动和创造力8、学习9和其他行为结果10之间存在联系。\n此外，在跟踪数据中捕获的行为可以与诸如ADHD 11、自闭症12和创伤后应激障碍13等医疗状况相关联。也有越来越多的文献使用跟踪数据来诊断痴呆症14、15、16。\n从这些例子中，出现了一种模式。这些测试中的每一个都是一个日常场景，实验者在其中测量一些已知的表明某种医学状况的行为(例如，分心、对脸的注意力、运动规划中的持续时间)。仅仅通过跟踪数据就能找到这些关联的能力已经引起了研究人员对虚拟现实17中隐私的关注。\n18岁的霍斯费尔特讨论了身临其境的媒体伦理，并指出了收集非自愿非语言互动的力量。我们期望的私有响应可能会在我们不知道的情况下被算法快速检测到。Vitak等人。19在网络隐私的更大背景下讨论VR隐私。与许多隐私问题一样，问题在于用户获得的收益是否超过了担忧。\n先前关于识别头盔显示器用户的工作已经使用了不同类型的生物测定测量。最常见的是通过设备4、6、20、21中的惯性测量单元的头部旋转和加速。随着VR头戴式耳机的普及，头戴式耳机和手控制器的位置和方位数据成为更常见的数据源5、22。\n确定用户身份的目的可以是为了认证或识别。我们遵循罗杰斯等人的区别。6在认证和识别之间做出选择。身份验证需要强有力的确凿证据，将单个用户与系统的任何其他用户区分开来，并且通常会导致权限提升(例如，访问敏感数据或运行更强大的命令)。另一方面，标识是任意(但有限)数量的用户的预定义集合内的用户的匹配。例如，标识可用于自动应用用户首选项或创建个性化广告。\n以前的工作主要集中在寻找可以识别用户的任务。例如，用户可以响应音频剪辑点头，创建“动作密码”20。人们一直感兴趣的是减少这些验证任务的侵扰性。例如，Kupin等人。22名用户在做投掷动作时进行跟踪，穆斯塔法等人。4当参与者在房间中走动时跟踪。然而，在从毫无识别意图的体验中收集的数据中确定身份方面所做的工作很少。\n参与者观看了360度的视频，并在VR中回答了问卷。对跟踪数据进行总结和处理，作为三种机器学习算法的输入。这项研究是由斯坦福大学IRB根据43879号协议批准的，所有的方法都是根据这些指南进行的。\n总共招募了548名参与者参与这项研究。在这些人中，10人不允许将他们的跟踪数据作为分析的一部分，27人出于各种原因之一没有完成这5个视频：7人为节省时间提前结束，通常是因为他们预订了另一项博物馆活动，6人在被问及时没有说明原因，5人无法阅读调查文本，4人因模拟器疾病或眼睛疲劳而结束，3人因内容结束(2人不喜欢人群，1人不喜欢动物)，2人因不舒服的耳机安装而结束。总共有511名参与者完成了实验。博物馆里有378个，校园里有133个。人口统计信息如图1所示。年龄是以范围给出的，而不是原始值，因为选定的参与者不能输入他们的年龄，而是从七个选项中选择一个。种族和民族是使用改编自2010年美国人口普查的类别给出的。可以在研究的在线储存库23中找到每个问题的全文及其答案选项。\n研究参与者的人口统计信息(年龄、性别、以前虚拟现实经历的数量，以及种族和民族)的直方图。\n所有成年参与者都阅读并签署了IRB批准的同意书。对于18岁以下的参赛者，需要得到孩子的同意和父母的同意。如果博物馆的参与者选择不参与研究，他们仍然可以选择观看360个视频，而不收集他们的数据。\n使用HTC Vive虚拟现实耳机和控制器24显示虚拟现实内容。校园内的实验空间如图2所示。\n实验装置。左上角：其中一个360度视频的截图。右上角：VR问卷的截图。左下角和右下角：合著者在实验过程中演示观看视频和回答调查过程的照片。\n正在讨论的虚拟现实内容由5个360度视频组成，每个视频20分钟长，从80个视频中随机选择。这些视频被收集到价位(积极与消极)和唤醒(平静与兴奋)的范围内。对于每个视频，从原始摄像人员处获得了显示视频并允许研究人员重复使用的许可，并且所有视频都可以通过研究储存库23获得。\n所有视频都本地存储在连接到VR耳机的计算机上。这些视频的帧率从23.97到120不等，低于29.97fps的视频有8个，帧率在29.97到30fps之间的视频有66个，超过30fps的视频有6个。这些视频的分辨率从1920×960像素到4096×2048像素不等，其中39个视频位于这个范围的最高端。\n鉴于360度视频可提供任何方向的观看，考虑内容本身对运动的影响也很重要。如果内容导致许多人以相似的方式移动，通过运动进行识别可能会更加困难。可能导致这种情况的两个特征是口述和视频焦点的强度。没有外部解说员告诉观众往哪里看的视频，但有16个视频可以听到人的声音，其中9个可以辨认出特定的单词和特定的说话者。在摄像机周围走动的单一动物(如大象、狒狒、长颈鹿)的视频中，视频的焦点最强，而在树木四面八方可见的自然场景的视频中，焦点最弱。具有场景更改、摄像机旋转或抖动摄像机运动的视频事先被排除。只有一段视频涉及摄像机的运动，而且摄像机是以缓慢的恒速移动的。\n研究人员在两个地点招募了参与者：一个位于大城市的技术博物馆，另一个是来自一所大学的学生。研究人员使用同意书获得了所有18岁以上参与者的知情同意。对于18岁以下的参与者，父母或法定监护人通过父母同意表给予知情同意，参与者通过同意表给予同意。在征得同意后，研究人员为参与者设置了VR耳机和手控器，确认了耳机的适合性和舒适性，并开始了虚拟现实应用。\n在虚拟现实应用程序中，参与者回答了一份人口统计调查问卷。当这些问题完成后，程序随机选择了五个视频。对于每一个视频，程序向参与者展示视频，然后提示参与者关于价格、唤醒25、存在、模拟器疾病和分享内容的愿望的问题。问卷的全文可在研究储存库23中获得。与这些问卷内容有关的实质性结果已经在单独的出版物7中进行了调查，重点是虚拟现实的内容和使用。一旦参与者回答了这些问题，程序就会加载另一个视频，显示该视频，并提示另一轮问题。博物馆的378名参与者重复了5次，校园的133名参与者重复了8次。在当前论文中报告的分析中，忽略了该大学在5号之后进行的任何试验，以确保数据集的一致性。\n当最后的视频被显示后，研究人员帮助参与者走出VR耳机，回答任何问题，并听取参与者关于实验的简报。\n以90 Hz的频率收集原始跟踪数据。数据采集率稳定，只有0.05%的帧出现在前一帧之后超过30ms。在每一帧中，记录时间戳和按钮按下，以及耳机、左手控制器和右手控制器的6自由度(即位置和旋转)。\n三个位置维度表示为X、Y和Z。在Unity约定中，开发虚拟现实体验的游戏引擎是在其中开发的，Y轴是垂直的，Z轴是向前-向后的，X轴是从左向右的。这三个旋转维度是偏航(围绕垂直轴旋转)、俯仰(围绕左右或X轴向上或向下倾斜的旋转)和侧滚(围绕前后或Z轴旋转)。其中一些测量具有直接的空间意义，例如y轴捕捉被跟踪对象(耳机或手控器)离地面的高度，以及耳机偏航指示参与者正在观看的水平方向。\n为了将数据总结成适合于机器学习算法的样本、多维向量，跟踪数据被分成1-s块。为汇总统计数据(最大、最小、中值、平均值和标准差)、身体部位(头部、左手、右手)和尺寸(x、y、z、偏航、俯仰和侧滚)的每个组合计算一个值。这导致每个视频会话的每秒都有一个90维向量。将可变长度数据分成块并汇总块的过程是在先前的身体运动和识别方法5中执行的过程。总共有61,121个样本在视频任务中，115,093个样本在调查任务中。细分每人的样本数量，平均有345个样本，一个阶段\n这些样本是在每个参与者的十个会话中收集的，通过每个视频(其中有五个)的开头和正在执行的任务(观看视频或回答相应视频之后的调查)来描述。按照每届会议的样本数量划分，平均有34.5个样本，标准偏差为16个样本，范围从13个样本到178个样本。\n准确性是根据每个会话而不是每个样本给出的预测来评估的(即，观看一个视频的每个会话时间的单个预测，或者回答一个视频的调查，而不是每秒的预测)。这是通过收集任务中每一秒的预测作为选票，并将该会话的预测指定为得票最多的预测来实现的。\n遵循Pfeuffer等人的观点。5、分类准确率(即正确预测占总预测的百分比)是选择的性能度量。虽然相关论文使用相同的错误率4、20或平衡准确率6，但它们是风险不对称的认证任务。假阴性是用户的烦恼，但假阳性会损害系统的安全性。在像我们的工作这样的识别任务中，我们假设错误的代价与真实的和预测的类别无关。此外，每个类中都有相同数量的示例，因为预测是按会话而不是按秒进行评估的，因此天真的最常见条目分类器的性能不可能比机会好(1/511，约0.2%)。因此，分类准确性提供了一种公正、易于理解的性能度量。\n除非另有说明，本文报告的准确值来自20次蒙特卡罗交叉验证的平均值，按参与者和任务分层。对于每个参与者和任务，随机选择一个会话的数据，并将其从培训过程中删除。一旦对模型进行了训练，就会根据遗漏的数据对其进行测试。然后，丢弃旧模型，进行新的训练和测试拆分，并对新模型进行评估。\n试验了三种机器学习模型：K近邻(KNN)26、随机森林27和梯度助推机28(GBM)。所有的方法都运行在R版本3.5.3中，其中“class”版本7.3-15，“随机森林”版本4.6-14，以及“GBM”版本2.1.5。\n虽然以前的工作使用支持向量机(SVM)来识别用户，但支持向量机并不直接支持多类分类。常用的支持向量机R库‘e1071’通过训练O(N2)个一对一分类器(每对类一个分类器)来解决这个问题。不幸的是，这意味着需要训练超过100,000个SVM分类器，这在现有机器上计算起来很困难。\nKNN、随机森林和GBM的选择有不同的动机。最近邻近似是一种健壮的算法，它很容易理解，只需很少的统计背景26。随机森林方法在之前的身体运动识别任务5、6中取得了成功。GBM类似于随机森林，因为两者都使用决策树，但不是创建许多树来对称为集合模型的预测进行投票，而是对每棵树进行训练，以减少在称为增强的过程中的后续错误。GBM可以创造比随机森林更准确的预测，但通常需要更多的树木才能做到这一点。\n每个算法接受90个元素的运动汇总矢量作为输入，并且它输出表示511个参与者之一的分类预测。对于kNN，在计算点之间的欧几里得距离之前，每个变量被归一化为均值0和方差1。RandomForest参数设置为R默认值，但训练了100棵树。GBM用20棵树运行，交互深度为10，每个节点至少有10个观测。由于在511类之间进行分类的计算强度较大，GBM模型中的树木数量较少。这可能会降低算法的性能。\n一旦对算法进行了比较，我们将选择其中最成功的算法进行进一步的分析。\n使用VR跟踪数据，评估模型以确定如何以及何时可以进行识别。\n首先必须问的问题是，VR是否能产生识别信息。分类准确性报告如下。所有算法的性能都比Chance好得多，但随机森林和KNN的性能最好(图3)。\n.", "note_en": "Virtual reality (VR) is a technology that is gaining traction in the consumer market. With it comes an unprecedented ability to track body motions. These body motions are diagnostic of personal identity, medical conditions, and mental states. Previous work has focused on the identifiability of body motions in idealized situations in which some action is chosen by the study designer. In contrast, our work tests the identifiability of users under typical VR viewing circumstances, with no specially designed identifying task. Out of a pool of 511 participants, the system identifies 95% of users correctly when trained on less than 5 min of tracking data per person. We argue these results show nonverbal data should be understood by the public and by researchers as personally identifying data.\n     Virtual reality, the use of computational technology to create a simulated environment, has spiked in use in recent years  1. In order to render the virtual world from the viewpoint of the user, the user’s position must be calculated and tracked. All VR systems measure head orientation, most measure head position, and many measure hand orientation and position  2. While less common, some can track feet, chest, and even elbows and knees to increase immersion  3. This data is a problem for users concerned about privacy. The tracking data VR provides can be identifying.\n In contrast to previous work, which has focused on designing VR tasks to identify or authenticate users  4, 5, 6, we begin with a task that was not designed for identification. In fact, the tracking data we use is from a study  7 designed with the intention examining the associations between motion, self-report emotion data, and video content.\n Moreover, the current work is unique in that it uses a very large (over 500) and diverse sample primarily from outside a university. Both features of the sample are relevant theoretically. First, identification in small samples likely overestimates the diagnosticity of certain features given the lack of overlap in body size and other sources of variance. Second, different people likely have different types of body movements. For example, the study has over 60 participants over the age of 55, and the movement of this group is likely different from a typical college student.\n If tracking data is by nature identifying, there are important implications for privacy as VR becomes more popular. The most pressing class of issues falls under the process of de-identifying data. It is standard practice in releasing research datasets or sharing VR data to remove any information that can identify participants or users. In both the privacy policy of Oculus and HTC, makers of two of the most popular VR headsets in 2020, the companies are permitted to share any de-identified data. If the tracking data is shared according to rules for de-identified data, then regardless of what is promised in principle, in practice taking one’s name off a dataset accomplishes very little.\n The second class of threats is broadly concerned with an improved ability to link VR sessions together. Information that was previously scattered and separate is now able to be joined by a “motion signature.” In connecting some tracking data to a name, for example, now tracking data in many other places are attached to the same name. This increases the effectiveness of threats based upon inference of protected health information from tracking data (for examples, see Related Work).\n A third class of threats stems from &#34;private browsing&#34;. In principle, there is a way to enter a &#34;private browsing mode&#34; in a web browser. While it may be difficult and require many tools hiding many layers of information, it is possible. With accurate VR tracking data, a &#34;private browsing mode&#34; is in principle impossible.\n Using only the position tracking data, we find that even with more than 500 participants to choose from, a simple machine learning model can identify participants from less than 5 min of tracking data at above 95% accuracy. Therefore, we contribute data suggesting typical VR experiences produce identifying data. Moreover, by examining different types of models and different feature sets, we shed light on the possible mechanism behind identification, which also suggest at strategies to prevent abuse.\n In this paper, first two threads of related work are reviewed: methods of identifying users through tracking data, and concerns about VR privacy. Second, the experimental setup and data collection processes are reported. Finally, the results of each identification task are reported, and results are discussed.\n Previous work has used tracking data to identify users, but identification is framed positively, often as a tool for authentication. The ongoing adoption of VR has raised concerns about VR tracking data as a privacy concern.\n  VR tracking data, as a measure of body pose and motion, is a surprisingly powerful source of information. Associations have been made between kinds of body motion and creativity  8, learning  9, and other behavioral outcomes  10.\n Furthermore, behaviors captured in tracking data can be associated with medical conditions such as ADHD  11, autism  12, and PTSD  13. There is also growing literature in the use of tracking data to diagnose dementia  14, 15, 16.\n From these examples, a pattern emerges. Each of these tests are an everyday scene in which the experimenter measures some behavior known to be indicative of some medical condition (e.g., distraction, attention to faces, duration in motion planning). The ability to find these associations merely from tracking data has brought researchers’ attentions to privacy in VR  17.\n Hosfelt  18 discusses immersive media ethics and notes the power of collecting involuntary nonverbal interactions. Responses that we expect to be private may be quickly detected by algorithms while we are unaware. Vitak et al.  19 grounds the discussion of VR privacy within a larger context of networked privacy. As with many privacy concerns, the question hinges on whether the gains to the user outweigh the concerns.\n  Previous work on identifying users of head-mounted displays have used different types of biometric measurements. The most common is head rotation and acceleration through inertial measurement units in the device  4, 6, 20, 21. With the rise in popularity of VR headsets, position and orientation data of the headset and hand controllers have become more common data sources  5, 22.\n The purpose of determining the user’s identity may be for authentication or identification. We follow the distinction Rogers et al.  6 make between authentication and identification. Authentication requires strong positive evidence identifying a single user from any other user of a system, and usually leads to elevated privileges (e.g., access to sensitive data, or ability to run more powerful commands). Identification, on the other hand, is the matching of a user within a predefined set of an arbitrary (but finite) number of users. For example, identification might be used to automatically apply user preferences or create personalized advertisements.\n Previous work has focused on finding a task that can identify users. For example, users can nod their head in response to an audio clip, creating a “motion password”  20. There has been interest in making these authentication tasks less intrusive. For example, Kupin et al.  22 track users as they make a throwing motion, and Mustafa et al.  4 track as participants walk around a room. However, little work has been done in determining identity from data gathered from an experience designed with no intention of identification.\n Participants watched 360-degree videos and answered questionnaires in VR. The tracking data was summarized and processed as input for three machine learning algorithms. The study was approved by the Stanford University IRB under protocol number 43879, and all methods were performed in accordance with these guidelines.\n  A total of 548 participants were recruited to participate in the study. Of these, 10 did not permit their tracking data to be used as part of the analysis, and 27 did not finish the five videos for one of various reasons: 7 ended early to save time, often because they had a reservation for another museum activity, 6 did not specify a reason when asked, 5 could not read the survey text, 4 ended due to simulator sickness or eyestrain, 3 ended due to content (2 did not like the crowds and 1 did not like the animals) and 2 ended due to uncomfortable headset fits. In total, 511 participants completed the experiment. There were 378 at the museum and 133 from campus. Demographic information is given in Fig.  1. Ages are given in ranges rather than raw values because participants selected were not able to type in their age but rather select one of the seven options. Race and Ethnicity is given using categories adapted from the 2010 United States Census. The full text of each question, as well as its answer options, can be found in the study’s online repository  23.\n Histograms of demographic information (age, gender, number of previous VR experiences, and race and ethnicity) of study participants.\n All adult participants read and signed an IRB-approved consent form. To run participants younger than 18, child assent and parental consent were required. If participants at the museum opted out of participating in research, they still had the option to view the 360 videos without having their data collected.\n  Virtual reality content was displayed using the HTC Vive virtual reality headset and controllers  24. The experimental space on campus is shown in Fig.  2.\n Experimental setup. Top left: a screenshot of one of the 360-degree videos. Top right: a screenshot of the VR questionnaire. Bottom left and right: photograph of co-author demonstrating the process of watching video and answering survey during the experiment.\n  The virtual reality content in question consisted of five 360-degree videos, each 20 s long, randomly selected from a set of 80 videos. The videos were gathered to range in valence (positive versus negative) and arousal (calm versus exciting). Permission to display videos and allow researcher reuse was obtained for each video from the original videographer, and all videos are available through the study repository  23.\n All videos were stored locally on the computer connected to the VR headset. The framerates of the videos varied from 23.97 to 120, with 8 videos with fewer than 29.97fps, 66 videos with framerates between 29.97 and 30fps, and 6 videos with more than 30 fps. The resolution of the videos ranged from 1920 by 960 pixels up to 4096 by 2048 pixels, with 39 videos at the top end of this range.\n Given 360-degree video offers viewing in any direction, it is also important to consider the effect of the content itself on motion. If the content causes many people to move in similar ways, identification by motion may be more difficult. Two features that may cause this are spoken narrations and the strength of the video’s focal point. There were no videos that had an external narrator telling the viewer where to look, but there were sixteen videos in which a human voice could be heard, and of those, nine where specific words and specific speakers could be made out. The focal point of videos were strongest in videos of a single animal (e.g., elephant, baboon, giraffe) that paced around the camera, and focal points were weakest in videos of nature scenes with trees visible in all directions. Videos with scene changes, camera rotation, or jerky camera motion were excluded beforehand. Only one video involved motion of the camera, and the camera was moving at a slow constant velocity.\n  Researchers recruited participants at two locations: a technology museum based in a large city, and students from a university. Researchers obtained informed consent from all participants over 18 using a consent form. For participants younger than 18, a parent or legal guardian gave informed consent through a parental consent form and the participant gave assent through an assent form. After consent was obtained, the researcher set up the participant with the VR headset and hand controllers, confirmed the fit and comfort of the headset, and began the virtual reality application.\n Within the virtual reality application, participants answered a demographic questionnaire. When those questions were completed, the program randomly selected five videos. For each of the videos, the program displayed the video to the participant and then prompted the participant with questions about valence, arousal  25, presence, simulator sickness, and desire to share the content. The full text of questionnaires are available in the study repository  23. The substantive results relating to content from these questionnaires have been investigated in separate publication  7 focused on VR content and use. Once the participant answered these questions, the program loaded another video, displayed it, and prompted with another round of questions. This repeated five times for the 378 participants at the museum and eight times for the 133 participants on campus. For the analyses reported in the current paper, any trial from the university past the fifth was ignored to ensure the datasets were consistent.\n When the final video had been displayed, the researcher helped the participant out of the VR headset, answered any questions, and debriefed the participant about the experiment.\n  Raw tracking data was collected at 90 Hz. The data collection rate was stable, with only 0.05% of frames coming more than 30 ms after the previous frame. In each frame, the timestamp and button presses were recorded, along with the 6DOF (i.e., position and rotation) of the headset, left hand controller, and right hand controller.\n The three positional dimensions are denoted as X, Y, and Z. In the conventions of Unity, the game engine the virtual reality experience was developed in, the Y axis is vertical, the Z axis is forward–backward, and the X axis is left–right. The three rotational dimensions are yaw (rotations about the vertical axis), pitch (rotation tilting upwards or downwards, about the left–right or X axis) and roll (rotation around the forward–backward or Z axis). Some of these measures have straightforward spatial meanings, e.g. the y-axis captures how high the tracked object (headset or hand controller) is from the ground, and headset yaw indicates the horizontal direction the participant is looking.\n To summarize the data into  samples, multi-dimensional vectors appropriate for the machine learning algorithms, the tracking data was binned into 1-s chunks. A value was calculated for each combination of summary statistic (maximum, minimum, median, mean, and standard deviation), body part (head, left hand, right hand), and dimension (x, y, z, yaw, pitch, and roll). This resulted in a 90-dimensional vector for each second of each video session. The process of dividing variable length data into chunks and summarizing chunks is a process performed in previous methods  5 of body motion and identification. In total, there were 61,121 samples in the video task, and 115,093 samples in the survey task. Breaking down the number of samples per person, there was an average of 345 samples, a standard deviation of 60.5 samples, and a range from 214 to 663.\n These samples were collected across ten  sessions for each participant, which are delineated by the beginning of each of the videos (of which there were five) and the task being performed (either watching the video, or answering the survey that followed the corresponding video). Breaking down the number of samples per session, there was an average of 34.5 samples, a standard deviation of 16 samples, and a range from 13 to 178 samples.\n  Accuracy is evaluated upon predictions given per-session rather than per-sample (i.e., a single prediction for each session of time watching one video, or answering one video’s survey, rather than a prediction per second). This is done by collecting the predictions of each second of the task as votes and designating the session’s prediction as the prediction with the most votes.\n Following Pfeuffer et al.  5, classification accuracy, (i.e., the percentage of correct predictions to total predictions made) is the chosen metric of performance. While related papers have used equal error rate  4, 20 or balanced accuracy rate  6, they are authentication tasks where risks are asymmetric. A false negative is an annoyance for the user, but a false positive compromises the security of the system. In identification tasks such as our work, we assume the cost of error is independent of the true and predicted classes. Furthermore, there are an equal number of examples in each class, as predictions are evaluated per-session rather than per-second, so a naïve most-common-entry classifier cannot perform better than chance (1/511, or about 0.2%). Therefore, classification accuracy provides an unbiased, easily understandable measure of performance.\n The accuracy values reported in this paper, unless specified otherwise, come from the average of twenty Monte Carlo cross-validations, stratified by participant and task. For each participant and task, one session’s data is randomly chosen and left out of the training process. Once the model has been trained, it is tested against this left-out data. Then, the old model is thrown out, a new training and testing split is made, and a new model is evaluated.\n  Three machine learning models were piloted: k-nearest-neighbors (kNN)  26, random forest  27, and gradient boosting machine  28 (GBM). All methods were run in R version 3.5.3, with ‘class’ version 7.3-15, ‘randomForest’ version 4.6-14, and ‘gbm’ version 2.1.5.\n While previous work has used support vector machines (SVMs) to identify users, SVMs do not directly support multiclass classification. The commonly used R library for SVM, ‘e1071′, works around this by training  O(n 2 ) one-to-one classifiers, one for each pair of classes. Unfortunately, this implied training over 100,000 SVM classifiers, which was computationally intractable on available machines.\n The choices of kNN, random forest, and GBM, were motivated in different ways. Nearest-neighbor approximation is a robust algorithm that can be easily understood with little statistical background  26. The random forest method has seen success in previous body motion identification tasks  5, 6. GBM is similar to random forest in that both use decision trees, but instead of creating many trees that vote on predictions called an  ensemble model, each tree is trained to reduce subsequent error in a process called  boosting. GBM can create more accurate predictions than random forests but often require many more trees to do so.\n Each algorithm accepted a 90-element motion summary vector as input, and it output a classification prediction representing one of the 511 participants. For kNN, each variable is normalized to mean zero and variance one before computing the Euclidean distances between points. The RandomForest parameters were set to R defaults, except that 100 trees were trained. GBM was run with 20 trees, with an interaction depth of 10 and a minimum of 10 observations per node. The number of trees in the GBM model is small because of the computational intensity of classifying between 511 classes. This likely reduced the algorithm’s performance.\n Once the algorithms are compared, we will select the most successful of them to continue further analysis.\n Using the VR tracking data, models are evaluated to determine how and when identification can take place.\n  The question that must be asked first is whether VR produces identifying information. Classification accuracy is reported below. All algorithms performed much better than chance, but Random Forest and kNN performed best (Fig.  3).\n......", "posttime": "2020-10-16 03:59:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,数据,study", "title": "斯坦福大学的一项研究表明，运动跟踪的VR数据可以识别", "title_en": "Stanford Study Shows Motion-Tracked VR Data Can Be Identifiable", "transed": 1, "url": "https://www.nature.com/articles/s41598-020-74486-y", "via": "", "real_tags": ["大学", "数据", "study"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "利用Getty图像放大特斯拉S型车VCG图像。\n特斯拉在过去三天里两次下调其远程Model S汽车的价格-最新的折扣是基于对于性和大麻的笑话。\n周二降价4%使这款电动汽车的价格降至71,990美元，而随后的降价目前售价为69,420美元。最新也是最低的价格是指首席执行官埃隆·马斯克(Elon Musk)在Twitter上经常出现的关于性爱姿势和大麻的笑话。\n“挑战已经被抛下了！预言将会实现，“马斯克在一条宣布价格变动的推文中写道。\n事实上，最新的价格正好是特斯拉7月份开始出售的一条红色缎子短裤的一千倍，这条短裤的售价是“69.420美元”，目的是取笑该公司的反对者。2018年，马斯克同样遇到了证券监管机构的麻烦，当时他在推特上表示，他正在考虑以420美元的价格将特斯拉私有化。\n特斯拉在2012年推出了Model S，但近年来这款车面临着来自价格较低的Model 3轿车的竞争，目前Model3轿车的起价为37,990美元。瑞士信贷(Credit Suisse)一位分析师在给投资者的一份报告中表示，Model S仅占特斯拉单位销量的5%左右。\n这位分析师表示，Model S的降价可能是对电动汽车初创公司Lucid Motors降价的回应，Lucid Motors以69,900美元的起价出售其豪华轿车Air Model。这包括特斯拉汽车不再有资格享受的7500美元的美国政府电动汽车税收抵免。\n周四上午，特斯拉股价下跌1.6%，至453.78美元。", "note_en": "Enlarge Image    A Tesla Model S vehicle  VCG via Getty Images\n    Tesla cut the price for its Long Range Model S vehicle twice in the past three days — and the latest discount is based on jokes about sex and pot.\n A 4 percent cut on Tuesday brought the electric car’s price tag down to $71,990, while a subsequent cut now has it selling for $69,420. The latest and lowest price is a reference to jokes about a sex position and marijuana that frequently pop up in the Twitter feed of chief executive Elon Musk.\n “The gauntlet has been thrown down! The prophecy will be fulfilled,” Musk  wrote in a tweet announcing the price change.\n Indeed, the latest price is exactly a thousand times that of a pair of  red satin shorts that Tesla started selling in July for “$69.420” to poke fun at the company’s naysayers. Musk likewise got into hot water with securities regulators in 2018 when he  tweeted that he was “considering taking Tesla private at $420.”\n Tesla introduced its Model S in 2012, but in recent years the car has faced competition from its less expensive Model 3 sedan, which currently starts at $37,990. The Model S makes up only around 5 percent of Tesla’s unit volume, a Credit Suisse analyst said in a note to investors.\n The analyst said the Model S price reduction was likely in response to price cuts by electric vehicle startup Lucid Motors, which sells its luxury sedan Air model at a starting price of $69,900. That includes a $7,500 US government electric vehicle tax credit that Tesla vehicles are no longer eligible for.\n Shares of Tesla were down 1.6 percent Thursday morning, at $453.78.", "posttime": "2020-10-16 03:58:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,大麻,tesla,model", "title": "特斯拉Model S的新价格基于性和大麻笑话", "title_en": "The new price of Tesla’s Model S is based on sex and pot jokes", "transed": 1, "url": "https://nypost.com/2020/10/15/the-new-price-of-teslas-model-s-is-based-on-sex-and-pot-jokes/", "via": "", "real_tags": ["特斯拉", "大麻", "tesla", "model"]}, {"category": "", "categoryclass": "", "imagename": "79f1ffa108baf687af24a376c93257b2.jpg", "infoid": 1029105, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个名为“埃格雷戈尔”的勒索软件团伙泄露了他们声称从当今最大的两家游戏公司--育碧和Crytek的内部网络获得的数据。\n据称从每家公司窃取的数据已于周二公布在勒索软件团伙的黑暗门户网站上。\n像Egregor这样的勒索软件团伙经常侵入公司，窃取他们的数据，加密文件，并要求赎金来解密锁定的数据。\n然而，在许多事件中，勒索软件团伙也在数据外泄过程中被抓获并踢出网络，文件从未加密。尽管如此，他们仍然勒索公司，向受害者索要金钱，让他们不要泄露敏感文件。\n通常，当谈判破裂时，勒索软件团伙会将被盗文件的部分泄露发布在所谓的泄密网站上。\n周二，Crytek和Ubisoft的泄密事件同时发布在Egregor门户网站上，勒索软件团队威胁要在未来几天泄露更多文件。\n对于育碧泄密事件，Egregor小组分享了一些文件，表明他们拥有该公司的一款Watch Dog游戏的源代码。在其门户网站上，该组织吹捧他们拥有定于本月晚些时候发布的Watch Dog：Legion游戏的源代码。然而，无法确认这些文件是否来自新游戏，而不是现有版本。\n在过去的一年里，安全研究人员试图联系育碧，通知育碧其几名员工被网络钓鱼，但没有结果，这可能为黑客可能是如何获得网络钓鱼提供了线索。", "note_en": "A ransomware gang going by the of  Egregor has leaked data it claims to have obtained from the internal networks of two of today&#39;s largest gaming companies — Ubisoft and Crytek.\n Data allegedly taken from each company has been published on the ransomware gang&#39;s dark web portal on Tuesday.\n   Ransomware gangs like Egregor regularly breach companies, steal their data, encrypt files, and ask for a ransom to decrypt the locked data.\n However, in many incidents, ransomware gangs are also get caught and kicked out of networks during the data exfiltration process, and files are never encrypted. Nevertheless, they still extort companies, asking victims for money to not leak sensitive files.\n Usually, when negotiations break down, ransomware gangs post a partial leak of the stolen files on so-called  leak sites.\n On Tuesday, leaks for both Crytek and Ubisoft were posted on the Egregor portal at the same time, with threats from the ransomware crew to leak more files in the coming days.\n   For the Ubisoft leak, the Egregor group shared files to suggest they were in possession of source code from one of the company&#39;s Watch Dogs games. On its web portal, the group touted they were in possession of the source code for the Watch Dogs: Legion game, scheduled to be released later this month. It was, however, impossible to verify that these files came from the new game, rather than an existing release.\n  For the past year, security researchers have  tried to reach out and notify Ubisoft about several of its employees getting phished, with no results, which may provide a clue of how the hackers might have got it.\n But while hackers leaked only 20 MB from Ubisoft, they leaked 300 MB from Crytek, and this data contained a lot more information.\n The Crytek files included documents that appeared to have been stolen from the company&#39;s game development division. These documents contained resources and information about the development process of games like Arena of Fate and Warface, but also Crytek&#39;s old Gface social gaming network.\n    Neither Ubisoft nor Crytek responded to emails seeking comment on the leaks. None of the companies reported major security incidents weeks, nor any abnormal and prolonged downtimes, suggesting the Egregor intrusion didn&#39;t likely impact cloud and gaming system, but merely backend office and work networks, where most ransomware incidents usually incur damages.\n However, in an email interview with ZDNet, the Egregor gang provided more details about the two incidents. The ransomware operators said they breached the Ubisoft network, but only stole data, and did not encrypt any of the company&#39;s files.\n  The Egregor group said that neither company engaged in discussions, despite their intrusions, and no ransom has been officially requested yet.\n &#34;In case Ubisoft will not contact us we will begin posting the source code of upcoming Watch Dogs and their engine,&#34; the group threatened, promising to publish more data in a press release tomorrow.", "posttime": "2020-10-16 03:41:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "育碧,软件,发布,帮派,crytek", "title": "育碧，Crytek数据发布在勒索软件帮派的网站上", "title_en": "Ubisoft, Crytek Data Posted on Ransomware Gang's Site", "transed": 1, "url": "https://www.zdnet.com/article/ubisoft-crytek-data-posted-on-ransomware-gangs-site/", "via": "", "real_tags": ["育碧", "软件", "发布", "帮派", "crytek"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Neon是一种高级的、静态类型的、垃圾收集的、命令式编程语言，旨在教授和学习编程技术。它的设计借鉴了许多流行语言的特点，但又小心地避免了初学者使用其他语言时遇到的常见错误。\n霓虹灯算术使用十进制浮点，消除了二进制浮点有时出现的意外。符号运算符是明确的，通常只有一个意义。支持指针，但设计上不可能出现空指针错误。不能跟踪名称，消除了常见的混淆来源。\n霓虹灯还具有使学习编程变得实用和有趣的功能。有用于图形、声音、文本模式界面(Curses)、网络等的标准库。图形和声音库让人回想起Apple][和Commodore 64]的早期。Curses界面提供交互式文本模式功能。链接到外部库和调用外部函数的能力打开了多种可能性。定义良好的扩展接口支持第三方库集成。\n霓虹灯程序从源文件中的第一条语句开始执行。例如，程序可以如下所示：\n#对于从1到100的每个整数，打印&#34；Fizz&#34；如果数字#可以被3整除，或者&#34；Buzz&#34；如果数字可以被5整除，或者&#34；FizzBuzz&#34；如果两个数字都可以整除，则打印数字。#否则，打印数字本身。对于I：=1到100，如果I MOD 15=0，则打印(&#34；FizzBuzz&#34；)ELSIF I MOD 3=0，则打印(&#34；Fizz&#34；)ELSI MOD 5=0，则打印(#34；Fizz&#34；)ELSI MOD 5=0，则打印(&#34；Fizz&#34；)ELSIF I MOD 5=0，则打印(&#34；Fizz&#34；)ELSI MOD 5=0，则打印(&#34；Fizz&#34；)。Buzz&#34；)否则打印(&#34；\\(I)&#34；)结束IFEND。\nNeon语法对空格不敏感，没有语句分隔符，Neon源代码区分大小写，但对用户自定义标识符的大小写没有要求。", "note_en": "Neon is a high-level, statically typed, garbage collected, imperative programming language intended for teaching and learning the craft of programming.Its design borrows features from many  popular languages, yet carefully avoids  common errors encountered by beginning programmers in other languages.\n Neon arithmetic uses decimal floating point, eliminating surprises that sometimes arise with binary floating point.Symbolic operators are unambiguous and usually have only one meaning.Pointers are supported, but null pointer errors are not possible by design.Names cannot be shadowed, eliminating a common source of confusion.\n Neon also has features that can make learning programming practical and fun.There are  standard libraries for graphics, sound, text mode interfaces (curses), networking, and more.The graphics and sound libraries recall the early days of the Apple ][ and Commodore 64.The curses interface provides interactive text mode capability.The ability to link to external libraries and to call external functions opens up a wide variety of possibilities.A well-defined extension interface supports third party library integration.\n   Neon programs start executing at the first statement in the source file.For example, a program can be as short as this:\n   # For each integer from 1 to 100, print &#34;Fizz&#34; if the number# is divisible by 3, or &#34;Buzz&#34; if the number is divisible# by 5, or &#34;FizzBuzz&#34; if the number is divisible by both.# Otherwise, print the number itself.FOR i := 1 TO 100 DO IF i MOD 15 = 0 THEN print(&#34;FizzBuzz&#34;) ELSIF i MOD 3 = 0 THEN print(&#34;Fizz&#34;) ELSIF i MOD 5 = 0 THEN print(&#34;Buzz&#34;) ELSE print(&#34;\\(i)&#34;) END IFEND FOR\n Neon syntax is not sensitive to whitespace, and does not have statement separators.Neon source code is case sensitive, but there are no requirements on the case of user-defined identifiers.", "posttime": "2020-10-16 03:37:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,霓虹灯,打印", "title": "霓虹灯编程语言", "title_en": "Neon Programming Language", "transed": 1, "url": "https://neon-lang.dev/", "via": "", "real_tags": ["编程", "霓虹灯", "打印"]}, {"category": "", "categoryclass": "", "imagename": "bfa49211a31dee53022f629cf8e9c740.png", "infoid": 1029103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个博客是我在Starlink上最初帖子的续篇。StarLink是SpaceX公司开发的新兴高性能星基互联网路由网络。它的最终目的是成为事实上的互联网骨干网提供商，让数十亿人连接到互联网，并彻底改变进入太空的方式。\n通常的免责声明适用。我对星联行动没有相关的内幕消息。我不是网络方面的专家，而且与Starlink的员工不同的是，我并没有花很多年的时间只解决这个问题。事实上，即使在最好的情况下，我通常也会非常困惑。但是我有一个很酷的想法，我想和大家分享一下。\n截至2020年9月，计划让数万颗Starlink卫星在大约9个独立的低地球轨道上运行，每个轨道具有不同的高度和倾角。在单一轨道上的每个子星座实际上形成了一张向北和向南移动的卫星表，当实施激光链路时，这些卫星可以很容易地与当地卫星进行通信。因此，每个轨道在某一纬度形成了对地球的“双重覆盖”。\n最初，Starlink卫星将通过地面站和用户终端相互通信。以后的版本将实现与同一轨道上其他附近卫星的激光链接，允许在每个2D数据表内进行高数据流。由于有九个独立的轨道族，每个轨道族都有一个向北和向南移动的工作表，路线可能会变得相当复杂。\n就本博客而言，每个单向微波或激光链路都可以被认为是连接多个节点的离散通道，每个节点都充当路由器。因此，每颗卫星都是连接数十条传入和传出数据链路的路由节点。每个离散信道将具有独立的纠错、编码和动态链路质量评估。用户终端和高带宽网关也可以被认为是相同意义上的节点。\n在数据包级别，Starlink路由问题归结为“数据包如何穿越网络？”这个问题因以下因素而变得复杂，在本博客的其余部分展开：\n卫星之间的连接是短暂的，并且会受到意外降级的影响，因此数据包可能会丢失。\n这篇博客关注的是星联网络的安全和隐私方面。如果不考虑这些，对星座进行一些全球模拟，集中计算最佳路线，将信息推送给卫星本身，并让它们执行预先计算的行为，这将是相对微不足道的。使用TLS，数据包内容将被端到端加密，但至关重要的是，网络拓扑和数据包元数据将被公开。\n在许多方面，与数据包内容本身相比，互联网元数据更是一个隐私问题。元数据对地球上任何人的社交和其他方面的图表进行编码。一种独特的、随时间演变的指纹，通常比包裹内容揭示更多关于一个人的信息。\n将元数据公开，即使是向SpaceX公开，也不是一个好主意。情报机构可以利用它进行间谍活动，而竞争对手可以利用它破坏SpaceX的技术优势。如果SpaceX可以访问它，它将在法律上被迫过滤各个司法管辖区的内容，这将破坏自由、网络中立性，并极大地增加法律风险。由于SpaceX可能更愿意把钱花在工程师身上，而不是律师身上，所以建立一个对任何人都无法访问元数据的网络是一个好主意。默认情况下，这样的网络保护隐私，确保电子商务的安全，并阻止黑客的干预。\n网络的理想状态是，即使在卫星本身被泄露或记录数据的情况下，它也能作为分散的自主透明通信介质运行，没有旁信道泄漏、无持久性、最小状态、前向保密性和元数据保护。是的，威胁模型必须包括SpaceX自己的硬件或软件可能行为不当的可能性。这使得路由问题成为拜占庭将军问题的变体，尽管这里不需要区块链。\n由于威胁模型必须包括无线或激光信号被第三方接收器截获的可能性，因此适当加密的信号应该在统计上与白噪声无法区分。\n虽然Tor网络旨在提供其中一些隐私保护功能，但它缺乏为Starlink工作所需的性能、可靠性、功能和地理连接。然而，一个执行良好的Starlink网络应该像Tor一样保护隐私。StarLink还必须提供最大带宽、最小延迟和最小数据包头开销。\n本博客不会详细介绍边界网关协议，这是互联网用来在网络之间传递数据包的常用系统。也就是说，Starlink网络的地理规模和速度确实给内容交付网络运营商带来了一些有趣的挑战。我相信Cloudflare已经想过这件事了！\n相反，我将把重点放在数据包如何在不牺牲速度和隐私的情况下实际穿越Starlink网络内部的具体细节。\n问题的核心在于，数据包如何以稳健、分散的方式通过网络从地面终端到多个卫星再到地面终端，利用IP地址、物理位置和网络拓扑之间的某种映射。能做到这一点的最低逻辑量是多少？\n换句话说，我们可以在数据包报头中隐藏多少上下文信息，但仍然具有功能？\n信息包环绕整个地球旅行的时间尺度大约是十分之一秒。在这个时间尺度上，卫星大约移动半英里，而由于地球自转，赤道的地面站将移动大约50米。准确地说，在光速的情况下，卫星是不会移动的，所以我们不必担心数据包会脱落。\n为了找到到达正确目的地地面站的正确波束，除了目的地地面站的大致GPS位置之外，信息包不需要知道任何其他信息-两个小数位就足够了。\n原则上，即使这些信息也可以从数据包路径上的几乎所有硬件中混淆。所有硬件需要知道的是哪个方向是最快的，这可能包括该特定路由器上的任何缓冲区积压。\n每个数据包都被加密，并由原始SpaceX硬件给出一个报头，该硬件对端点的大致地理位置进行编码，通过缓存或查找来确定。此地理位置被分成不同的部分，并使用时间和空间演变密钥进行加密。比方说，这些密钥在一秒内保持有效。每颗卫星都有一个根据当地时间和卫星位置不断更新的密钥。如果时间窗口有效，解密操作将解锁2或3比特的显著细节，仅此而已。这足以让路由器将其缓冲区中的指针实时分流到适当的输出通道。\n例如，一个从洛杉矶始发、目的地为纽约的数据包。第一颗卫星连接到数千个用户终端和几个网关。它确定(仅)数据包正向东北移动，并将其路由到该方向。即使它记录了有关数据包的信息，它也只知道它到达的时间、时长和去向。\n链中的最后一颗卫星能够读取目的地终端的大致地理位置，并将数据包分配给定向正确的波束。但它不知道除了“西南”之外，包裹从哪里来。\n指向该卫星的每个用户终端都会接收在该波束中发送的每个数据包，但只有预期的接收者才会拥有必要的密钥来解密数据包，将其转换回常规的互联网流量，并通过某一地面光纤将其发送到服务器或其他任何地方。\n即使数据包被截获，其地理位置密钥也会在一秒内过期，并且无法再与白噪声区分开来。\n即使动机极强的攻击者能够收集每个数据包的日志，执行计时攻击也需要纠正每个单独日志的时钟偏移。实际上，在目标设备上执行零日的可能性更大。\n归根结底，这样的方案与邮政地址的工作方式没有太大不同。递送过程中的每个步骤只需要知道一行地址，通常只有您当地的邮政工作人员才会对确保正确的人收到正确的信件所需的姓名和地址有详细的了解。一个足够热心于隐私的用户可以将他们的信息封装在四个单独的信封中，每个信封上都有地址的下一行，只有在成功投递到更本地化的地理区域时才能打开。\n最后，我确信，在卫星互联网上实现实时分散路由的方法有无数种，而且最优化并不等同于成为我想到的第一种方法。您希望看到这个系统是如何工作的吗？", "note_en": "This blog is a follow on to  my original post on Starlink. Starlink is an emerging high performance satellite-based internet routing network developed by SpaceX. Its ultimate purpose is to become the de-facto internet backbone provider, connect billions more people to the internet, and revolutionize access to space.\n The usual disclaimers apply. I have no relevant inside knowledge of Starlink operations. I’m not an expert in networking, and unlike Starlink’s staff I haven’t spent years working only on this problem. In fact, I’m usually deeply confused at the best of times. But I had a cool idea and I wanted to share it.\n  As of September 2020, the plan is for tens of thousands of Starlink satellites to orbit in about 9 separate low Earth orbits, each orbit with a different altitude and inclination. Each sub-constellation in a single orbit forms, in effect, a northward and southward comoving sheet of satellites that, when laser links are implemented, can communicate readily to local satellites. Thus, each orbit forms a “double cover” of the Earth up to some latitude.\n  Initially, Starlink satellites will communicate with each other via ground stations and user terminals. Later versions will implement laser links to other nearby satellites in the same orbit, permitting high data flows within each 2D data sheet. With nine separate orbit families, each having a north- and south-moving sheet, routing can get quite complicated.\n  For the purposes of this blog, each unidirectional microwave or laser link can be thought of as a discrete channel linking many nodes, each of which functions as a router. Thus, each satellite is a routing node connecting dozens of incoming and outgoing data links. Each discrete channel would have self-contained error correction, encoding, and dynamic link quality assessment. The user terminals and high bandwidth gateways can also be thought of as nodes in the identical sense.\n At the packet level, the question of Starlink routing boils down to “how does a packet traverse the network?” This question is complicated by the following factors, expanded in the rest of this blog:\n Connections between satellites are ephemeral and subject to unexpected degradation, so packets may get lost.\n  This blog focuses on the security and privacy aspects of the Starlink network. If these were not concerns it would be relatively trivial to perform some global simulation of the constellation, centrally calculate optimal routes, push that info out to the satellites themselves, and have them execute precomputed behavior. With TLS, the packet contents would be encrypted from end to end but, crucially, network topology and packet metadata would be exposed.\n In many ways, internet metadata is  more of a privacy concern than the packet contents themselves. The metadata encodes the graph, social and otherwise, of anyone on Earth. A unique, time-evolving fingerprint that often reveals more about a person than the packet contents.\n Exposing metadata, even to SpaceX, is a bad idea. Intelligence agencies can use it to spy, while competitors can use it to undermine SpaceX’s technological advantages. If SpaceX has access to it, it is legally compelled to filter content in various jurisdictions, undermining freedom, net neutrality, and greatly increasing legal risk. Since SpaceX would probably prefer to spend money on engineers than lawyers, building a network that lacks access to metadata, for anyone, is a good idea. Such a network by default preserves privacy, ensures security for e-commerce, and discourages hackers from meddling.\n The ideal for the network is that it function as a decentralized autonomous transparent communications medium with no side channel leakage, no persistence, minimal state, forward secrecy, and metadata protection, even in the case where the satellites themselves are compromised or logging data. Yes, the threat model has to include the possibility that SpaceX’s own hardware or software could misbehave. This makes the routing problem a variant of the  Byzantine General’s problem, though blockchain is not required here.\n Since the threat model has to include the possibility of radio or laser signals being intercepted by third party receivers, appropriately encrypted signals should be statistically indistinguishable from white noise.\n While the  Tor network was set up to provide some of these privacy-preserving features, it lacks the performance, reliability, functionality, and geographic connection necessary to work for Starlink. However, a well executed Starlink network should preserve privacy just as well as Tor. Starlink also has to provide maximum bandwidth, minimum latency, and minimal packet header overhead.\n This blog won’t go into detail on the  Border Gateway Protocol, the usual system the internet uses to pass packets between networks. That said, the geographic size and speed of the Starlink network does present some interesting challenges for operators of  content delivery networks. I’m sure Cloudflare has thought about this!\n Instead, I’m going to focus on the nuts and bolts of how packets might actually traverse the interior of the Starlink network without sacrificing speed or privacy.\n  At its core, the question boils down to how a packet can traverse the network from ground terminal to multiple satellites to ground terminal, exploiting some kind of map between IP addresses, physical locations, and network topology, in a robust, decentralized way. What is the barest minimum quantity of logic that can do this?\n In other words, how much contextual information can we obscure in a packet header and still have functionality?\n The time scale for a packet to travel around the entire Earth is about a tenth of a second. On this time scale, the satellites move about half a mile, while a ground station at the equator would move about 50 meters due to the Earth’s rotation. To a good approximation, at the speed of light the satellites are not moving, so we don’t have to worry about packets getting splinched.\n In order to find the right beam to the right destination ground station, a packet doesn’t need to know anything other than the rough GPS location of the destination ground station – two decimal places is plenty.\n In principle, even this information can be obfuscated from nearly all the hardware on the packet’s path. All the hardware needs to know is which direction is fastest, and that can include any buffer backlogs on that particular router.\n Each packet is encrypted and given a header by the origin SpaceX hardware which encodes the rough geolocation of the end point, determined either by caching or look up. This geolocation is split into varying pieces and encrypted using time- and space-evolving keys. These keys remain valid for, say, one second. Each satellite has a key that is updated continuously depending on the local time and the location of the satellite. Provided the time window is valid, a decryption operation unlocks 2 or 3 bits of salient detail, and no more. This is enough for the router to shunt a pointer in its buffer to the appropriate output channel in real time.\n For example, a packet originates in Los Angeles destined for New York. The first satellite is connected to several thousand user terminals and a handful of gateways. It determines (only) that the packet is traveling north east and routes it in that direction. Even if it logs the information about the packet, all it will know is the time it arrived, how long it was, and which direction it went.\n The last satellite in the chain is able to read the rough geolocation of the destination terminal, and assign the packet to the correctly-oriented beam. But it doesn’t know where the packet came from other than “south west”.\n Every user terminal pointed at that satellite receives every data packet sent in that beam, but only the intended recipient will have the necessary keys to decrypt the packet, convert it back to regular internet traffic and either send it off on some ground-based fiber, into a server, or whatever.\n Even if the packet is intercepted, within a second its geolocation keys expire and it is no longer distinguishable from white noise.\n Even if an extremely well-motivated adversary was able to collect a log on every packet, performing a timing attack would require that each separate log’s clock offset be corrected. In practice, executing a zero-day on the target’s device is more likely.\n In the end, such a scheme is not that different to how postal addresses work. Each step in the delivery only needs to know one line of the address, and typically only your local postal worker will have granular knowledge of names and addresses necessary to ensure that the right people get the right letters. A sufficiently zealous privacy-minded user could enclose their message in four separate envelopes each with the next line of the address, to be opened only on delivery to successfully more localized geographic regions.\n Finally, I am certain that there is a countably infinite number of ways to implement real-time decentralized routing on a satellite internet network, and that optimality is not equivalent to being the first one I thought of. How would you like to see the system work?", "posttime": "2020-10-16 03:37:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据包,packet", "title": "StarLink数据包路由", "title_en": "Starlink Packet Routing", "transed": 1, "url": "https://caseyhandmer.wordpress.com/2020/09/23/starlink-packet-routing/", "via": "", "real_tags": ["数据包", "packet"]}, {"category": "", "categoryclass": "", "imagename": "e404e930e32b62ca8a1b5e7e9bb7d21b.jpg", "infoid": 1029101, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阿特金森超级易读字体是由盲文研究所和应用设计公司开发的一种免费字体，可以使视力低下的人更容易阅读文本。\n“人们可能会感到惊讶的是，绝大多数来盲文学院的学生都有一定程度的视力，”该学院负责营销和传播的副总裁桑迪·辛(Sandy Shin)说，“人们可能会感到惊讶，因为绝大多数来盲文学院的学生都有一定程度的视力。”“他们不是百分之百失明的。”\n因此，盲文研究所遍布南加州的37,000名客户中的大多数都不依赖于基于点的盲文语言。取而代之的是，他们依赖口语工具和可访问性标准，鼓励文本出版商更仔细地考虑页面上单词的可读性。\n正如您在上图(摘自他们的摘要PDF)中看到的那样，Atkinson HyperEvible的字体的构造使每个字母都尽可能与众不同，因此即使在模糊或因视力低下而扭曲的情况下也是可识别的。你可以在盲文研究所的网站上下载“阿特金森超级易读”。(通过打印)", "note_en": "Atkinson Hyperlegible is a free typeface developed by the Braille Institute and Applied Design Works that makes text more readable  for people with low vision.\n “People may be surprised that the vast majority of the students who come to Braille Institute have some degree of vision,” says Sandy Shin, the institute’s vice president for marketing and communications. “They’re not 100% blind.”\n Thus, most of the Braille Institute’s 37,000 clients across Southern California don’t depend on the dot-based Braille language. Instead, they rely on spoken-word tools and accessibility standards that encourage text publishers to think more carefully about the legibility of words on pages.\n As you can see in the graphic above (taken from  their summary PDF), Atkinson Hyperlegible’s letterforms are constructed so that each letter is as distinctive as possible so that it’s recognizable even when blurry or distorted by low vision. You can  download Atkinson Hyperlegible on the Braille Institute site. (via  print)", "posttime": "2020-10-16 03:37:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "字体,免费,盲文,hyperlegible", "title": "来自盲文研究所的免费超级易读字体", "title_en": "A Free Hyperlegible Typeface from the Braille Institute", "transed": 1, "url": "https://kottke.org/20/10/a-free-hyperlegible-typeface-from-the-braille-institute", "via": "", "real_tags": ["字体", "免费", "盲文"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029099, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "除了特别说明的内容外，操作环境还必须满足操作系统的要求。\n选择相机型号后，即可下载该软件。(允许多选。)。\n*以下列表中包含的某些产品可能无法在您所在的国家或地区销售。\n要卸载Mac版本，请打开下载的IEW100_2010a.dmg文件，然后双击出现的文件夹中的Uninstall。", "note_en": "In addition to what is specifically noted, the operating environment must satisfy the requirements of the OS.\n    Once you select your camera model, you can download the software. (Multiple selections are allowed.)\n  * Some products included in the list below may not be available for sale in your country or region.\n    To uninstall the Mac version, open the downloaded IEW100_2010a.dmg file and double-click Uninstall in the folder that appears.", "posttime": "2020-10-16 03:36:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄像头,cameras,下载", "title": "索尼摄像头现在可以用作Mac的网络摄像头", "title_en": "Sony cameras can now be used as webcams for Mac", "transed": 1, "url": "https://support.d-imaging.sony.co.jp/app/webcam/en/download/", "via": "", "real_tags": ["摄像头", "cameras", "下载"]}, {"category": "", "categoryclass": "", "imagename": "117e26ff66eeec5136783ec848c4fa94.jpg", "infoid": 1029098, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity(现已上Twitter！)，我们在这里解开头条背后的数字。\n今天全体船员都回来了，娜塔莎、丹尼和我聚在一起分析一下真正的新闻。很多初创公司都在募集资金。很多风投公司都在募集资金。一些独角兽公司正在努力上市。有很多事要做，但我们会赶上你的。\n媒体综述：这家巨头在一轮融资中筹集了200万美元，我们发现这轮融资既酷又及时。一家媒体初创公司融资的消息与电子邮件媒体宠儿晨酿(Morning Brew)退出的传言相伴而生，价格高达7500万美元。支持每个故事的是最近关于Axios正在享受的收入成功的报道。报道一些不是新的裁员的媒体新闻是很好的。\n一群健康初创公司正在筹集资金：如果你喜欢锻炼自己的身心，这一周对你来说是个好消息。平静正在以更高的估值寻找新的基金。TechCrunch在这里有报道。CoA确实筹集了资金，为心理健康小组课程增加了300万美元的金库。Playbook为其健身教练平台筹集了930万美元。\n风投们募集了大量资金：现在是风投们自己募集资金的热门时期，OpenView、Canaan、True Ventures、Lead Edge Capital、First圆形和Khosla要么结束了几轮融资，要么宣布了新的融资计划。\n最后，我们进入了最近的GetAround资金和扭亏为盈的故事，这让我们进入了Airbnb自己的复苏。TechCrunch这里有更多报道。\n到此为止，我们要放假到周一早上。快点聊天，注意安全。\n股市每周一上午7点下跌。PT和周四下午，我们会尽快发布它，所以请订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast ( now on Twitter!), where we unpack the numbers behind the headlines.\n The whole crew was back today, with  Natasha and  Danny and  I gathered to parse over what was really a blast of news. Lots of startups are raising. Lots of VCs are raising. And some unicorns are shooting to go public. It’s a lot to get through, but we’re here to catch you up.\n  A Media Roundup: The  Juggernaut raised $2 million in a round that we found to be both cool and timely. The news of a media startup raising money was paired with  rumors of an exit for email media darling Morning Brew for a price-tag of up to $75 million. Undergirding each story was  recent reporting concerning the revenue success that Axios is enjoying. It’s nice to report on some media news that isn’t fresh layoffs.\n A cluster of wellness startups raising capital: If you like to work out your mind and body, it was a good week of news for you. Calm is  looking for new funds at a frewh, higher valuation.  TechCrunch has coverage here. Coa did raise,  adding $3 million to its coffers for mental health group classes. And  Playbook put together $9.3 million for its fitness instructor platform.\n VCs raised lots: It’s a hot time for VCs themselves to raise money, with  OpenView,  Canaan,  True Ventures,  Lead Edge Capital,  First Round, and  Khosla either closing rounds or announcing new fundraises.\n  Finally, we got into the  recent GetAround funding and turnaround story, which segued us  into Airbnb’s own recovery.  TechCrunch has more here.\n And with that, we’re off until Monday morning. Chat soon, and stay safe.\n Equity drops every Monday at 7:00 a.m. PT and Thursday afternoon as fast as we can get it out, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-10-16 03:20:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "锻炼,worked,资金", "title": "\n你最后一次锻炼灵魂是什么时候？", "title_en": "\n\t\t\t\tWhen was the last time you worked out your soul?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/when-was-the-last-time-you-worked-out-your-soul/", "via": "", "real_tags": ["锻炼", "worked", "资金"]}, {"category": "", "categoryclass": "", "imagename": "65f6c130f2223cdee0ac81bfac35051c.jpg", "infoid": 1029097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "何鸿燊辩称，这些平台-无论是提供在线交付服务、用户评论还是营销工具-都有相同的潜在模式：“他们寻求接管小企业的客户群，然后向他们征税，开始接触这些客户。”\n从表面上看，像Fivestars这样的公司已经开发了支持小企业支付和营销的软件，听起来可能也没什么不同。\n但何鸿燊表示，这家初创公司实际上采取了“相反”的方式，因为Fivestars并不是试图为自己的客户建立一个大的“围墙花园”，企业可以付费进入。取而代之的是，企业为软件付费，他们用来建立自己客户的数据库；他们不必付费就能接触到这些客户。\nFivestars平台包括其自己的支付产品，与其他销售点系统的集成，向客户提供个性化信息的营销自动化，以及一个由6000万购物者组成的更广泛的网络，允许在不同的Fivestars业务之间进行交叉促销。\n这家初创公司今天宣布，它已经筹集了5250万美元的新资金，将D系列股权和债务结合在一起，使其总融资达到1.455亿美元。这轮融资由Salt Partners牵头，LightSpeed Venture Partners、DCM Ventures、Menlo Ventures和HarbourVest Partners参与其中。\n何鸿燊表示，菲维斯特实际上在新冠肺炎疫情爆发之前就结束了这轮融资，但团队决定推迟宣布，因为在这么多客户都在受苦的情况下，“炫耀”公司的银行账户似乎不是一个好主意。\n在流感大流行期间，该公司看到了“创纪录的使用量”，每月有100万新购物者加入该网络。与此同时，何鸿燊承认，大流行已经导致该公司改变了战略。最初，这笔资金的目标是“在我们现有的产品中继续扩大我们的商家组合”，但Ho说，“在这段时间里，对我们来说非常戏剧性的变化是强调支付部分和网络”，并专注于“小企业比以往任何时候都更需要的东西”。\n他还指出，在大流行期间，该公司向客户提供了价值100多万美元的信贷，并使更多产品免费使用。\n“很明显，小企业具有令人难以置信的弹性，”何鸿燊补充道。“尤其是在体验方面--你不会带妻子去必胜客约会，去巴黎的时候，你也不会去普通连锁店。”\n在资金公告中，劳德代尔堡健康食品店TropiBowls的娜塔莎·蒂格(Natasha Teague)形容Fivestars平台是“巨大的帮助”。\n蒂格在一份声明中说：“能够与我们的客户实时沟通并分享最新消息的价值是不可估量的。”Fivestars庞大的网络和支付技术的力量使我们的重新开放过程变得无缝，在我们驾驭大流行带来的新需求时成为救命稻草。“", "note_en": "Ho argued that those platforms — whether they offer delivery services, user reviews or marketing tools — all have the same underlying model: “They seek to take over a small business’ customer base and then charge them a tax to start reaching those customers.”\n Superficially, a company like  Fivestars,   which has created software to support small business payments and marketing, might not sound that different.\n  But Ho said that the startup actually takes the “opposite” approach, because Fivestars isn’t trying to build up a big “walled garden” of its own customers that businesses pay to access. Instead, businesses pay for the software, which they use to build a database of their own customers; they don’t have to pay to reach those customers.\n   The Fivestars platform includes its own payment product, integration with other point-of-sale systems, marketing automation that delivers personalized messages to customers and a broader network of 60 million shoppers, allowing for cross-promotion across different Fivestars businesses.\n The startup is announcing today that it has raised $52.5 million in new funding, combining a Series D equity round as well as debt and bringing its total funding to $145.5 million. The round was led by Salt Partners, with participation from Lightspeed Venture Partners, DCM Ventures, Menlo Ventures and HarbourVest Partners.\n Ho said Fivestars actually closed the round before the COVID-19 pandemic, but the team decided to hold off on the announcement because it seemed like a bad idea to “flaunt” the company’s bank account when so many of its customers were suffering.\n The company has seen “record usage” during the pandemic, with 1 million new shoppers joining the network every month. At the same time, Ho acknowledged that the pandemic has caused the company to shift its strategy. Originally, the goal for the funding was “just to keep growing our portfolio of merchants across our existing products,” but Ho said, “What changed pretty dramatically through this period for us was emphasizing the payments piece and the network” and focusing on “what small businesses need more than ever.”\n He also noted that during the pandemic, the company has provided customers with more than $1 million worth of credits and also made more of its products free to use.\n “It’s very clear that small businesses are incredibly resilient,” Ho added. “Particularly when it comes to the category of experiences — you’re not going to take your wife on a date to Pizza Hut, when you go to Paris, you’re not going to go to a generic chains.”\n In the funding announcement, Natasha Teague of Ft Lauderdale health food store  Tropibowls described the Fivestars platform as “a huge help.”\n “The value of being able to communicate with our customers and share updates in real-time has been immeasurable,” Teague said in a statement. “The power of Fivestars’ expansive network and payment tech has made our reopening process seamless and a lifesaver as we navigate new needs as a result of the pandemic.”", "posttime": "2020-10-16 03:20:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "支付,business", "title": "\n小企业支付和营销初创公司Fivestars筹集5250万美元", "title_en": "\n\t\t\t\tSmall business payments and marketing startup Fivestars raises $52.5M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/15/fivestars-series-d/", "via": "", "real_tags": ["支付", "business"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "世界协调时2020-10-16凌晨1点左右，一颗退役的Parus卫星与长征4C的第三级火箭助推器之间将有一次高风险的近距离接近。Parus卫星有一个17米长的重力梯度吊杆，考虑到最小接近距离为12米，这并不令人鼓舞。Https://twitter.com/LeoLabs_Space/status/1316147305125490694 https://twitter.com/LeoLabs_Space/status/1316410789134245889。\n世界协调时2020-10-16凌晨1点左右，一颗退役的Parus卫星与长征4C的第三级火箭助推器之间将有一次高风险的近距离接近。Parus卫星有一个17米长的重力梯度吊杆，考虑到最小接近距离为12米，这并不令人鼓舞。\n的确，它的主体大约有3米高。根据它的相对方位WRT&gt；7米高的第三级，它几乎占据了30m(12+18m)的1-sigma不确定区间。\n如果我没有读错前面评论中的图片，那么LM4C RB在1000公里(970x1203公里)的轨道上，所以如果发生碰撞，几乎所有的碎片都将在轨道上停留数百年。干得好，2020年！\n世界协调时2020-10-16凌晨1点左右，一颗退役的Parus卫星与长征4C的第三级火箭助推器之间将有一次高风险的近距离接近。Parus卫星有一个17米长的重力梯度吊杆，考虑到最小接近距离为12米，这并不令人鼓舞。\n感谢您的信息。此网页将为您提供准确的UTC时间。继任者：格林威治标准时间(格林威治标准时间)https://time.is/UTC，我不想错过。\n*一旦你品尝了协和式飞机，你就会把眼睛转向天空，在地球上行走，因为你已经去过那里，而且你会渴望回到那里。*Fire du ciel le plus bel endroit de la terre c&#39；Est Impact Sans Concorde", "note_en": "On 2020-10-16 at approximately 01:00 AM UTC there will be a high risk close approach between a decommissioned Parus satellite and the third stage rocket booster of a Long March 4C.  The Parus satellite has a 17 meter long gravity gradient boom, which is less than encouraging given the minimum approach distance of 12 meters.   https://twitter.com/LeoLabs_Space/status/1316147305125490694   https://twitter.com/LeoLabs_Space/status/1316410789134245889\n   On 2020-10-16 at approximately 01:00 AM UTC there will be a high risk close approach between a decommissioned Parus satellite and the third stage rocket booster of a Long March 4C.  The Parus satellite has a 17 meter long gravity gradient boom, which is less than encouraging given the minimum approach distance of 12 meters.\n  Indeed, and its main body is around 3m tall. Depending on its relative orientation wrt the &gt;7 m tall third stage, it takes up almost entirely the 1-sigma uncertainty interval of 30m (12+18 m).\n   If I&#39;m reading the image in the previous comment correctly, the LM 4C RB is in a 1000km (970x1203km) orbit, so if there is a collision, almost all the debris will stay in orbit for hundreds of years. Way to go, 2020!\n   On 2020-10-16 at approximately 01:00 AM UTC there will be a high risk close approach between a decommissioned Parus satellite and the third stage rocket booster of a Long March 4C.  The Parus satellite has a 17 meter long gravity gradient boom, which is less than encouraging given the minimum approach distance of 12 meters.\n  Thank you for your info.  This web page will give you the exact UTC time.  Successor to:    Greenwich Mean Time (GMT)   https://time.is/UTC  I don&#39;t want to miss out.\n *** For once you have tasted Concorde you will walk the earth with your eyes turned skywards, for there you have been and there you will long to return. *** Faire du ciel le plus bel endroit de la terre c&#39;est impossible sans Concorde", "posttime": "2020-10-16 03:17:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "天体,large,时间", "title": "CZ-4C R/B与COSMOS 2004的潜在大型天体碰撞", "title_en": "Potential large objects collision COSMOS 2004 with CZ-4C R/B", "transed": 1, "url": "https://forum.nasaspaceflight.com/index.php?topic=52100.0", "via": "", "real_tags": ["天体", "large", "时间"]}, {"category": "", "categoryclass": "", "imagename": "8dc179069d4c3e115cd1350b78b7cee8.jpg", "infoid": 1029095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "留给Google Play音乐的时间不多了。我们知道谷歌成立9年的音乐服务即将退出市场，但本周谷歌实际上已经开始关闭部分云音乐服务，希望借此推动人们使用YouTube音乐。\n谷歌音乐商店(Google Play Music Store)周一开始逐步关闭，此前该商店允许你购买音乐进行播放和下载，而不是如今主导音乐版图的随心所欲的租赁服务。谷歌的音乐商店曾是谷歌Play商店的一部分，现在只显示一条消息，说明该功能已被删除。谷歌正在完全退出音乐销售业务，现在只通过YouTube音乐提供租赁服务。\n另一个被关闭的大功能是Google Home和Nest Audio扬声器上的音乐播放。虽然谷歌音乐应用程序仍然可以运行，你可以通过Chromecast开始播放，但你不再能够通过谷歌助手设备以语音方式开始播放音乐。如果您深入研究Google Assistant的所有设置(即在手机上打开Google应用程序，然后点击更多，然后点击设置，然后点击Google助手，然后是服务，最后是音乐)，您会发现Google Play Music选项已经完全消失了。(#34；#34；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；；&#34；Google Play Music；&#34；；&#34；；&#34；；&#34；Google Play Music&#34；选项已完全消失。现在唯一支持的语音命令服务是YouTube Music、Pandora、Deezer和Spotify。", "note_en": "There&#39;s not much time left for Google Play Music. We&#39;ve known Google&#39;s 9-year-old music service  was on the way out, but this week Google has started to actually shut down parts of its cloud music service in the hopes of pushing people to YouTube Music.\n The gradual shutdown started on Monday with the death of the Google Play Music Store, which previously let you purchase music for playback and download, as opposed to the all-you-can-eat rental services that dominate the music landscape today. Google&#39;s Music store was a section of the Google Play Store, which now just shows a message saying the feature has been removed. Google is getting out of the business of selling music entirely and now only offers a rental service through YouTube Music.\n The other big feature shutdown is music playback on Google Home and Nest Audio speakers. While the Google Music app still works and you can start a playback through Chromecast, you&#39;re no longer able to start music by voice through Google Assistant devices. If you dig into the Google Assistant settings (that means opening the Google app on your phone, then hitting &#34;More,&#34; then &#34;Settings,&#34; then &#34;Google Assistant,&#34; &#34;Services,&#34; and finally &#34;Music&#34;) you&#39;ll find that the &#34;Google Play Music&#34; option has completely disappeared. Now the only supported services for voice commands are YouTube Music, Pandora, Deezer, and Spotify.", "posttime": "2020-10-16 03:03:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,音乐,music", "title": "谷歌音乐关闭智能音箱支持和音乐商店", "title_en": "Google Music shuts down smart speaker support and music store", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/google-music-shuts-down-smart-speaker-support-and-music-store/", "via": "", "real_tags": ["google", "谷歌", "音乐", "music"]}, {"category": "", "categoryclass": "", "imagename": "8121772fff0ba6367e6d13c177704f4c.jpg", "infoid": 1029094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook周三表示，将减少“纽约邮报”(New York Post)一篇报道的分发，该报道发表了关于前副总统乔·拜登(Joe Biden)和他的儿子亨特(Hunter)的未经证实的说法，等待该网站事实核查伙伴的审查。\n但一年多来，这家社交网络为一群可疑的乌克兰特工提供了传播未经证实或被揭穿的关于拜登家族的阴谋论的平台-其中包括一名被美国财政部制裁并被视为试图干预2020年大选的“活跃俄罗斯特工”。\n这些乌克兰人一直是帮助特朗普律师鲁迪·朱利安尼抹黑拜登夫妇并帮助唐纳德·特朗普总统赢得连任的关键。一路上，他们在Facebook上获得了20多万粉丝和朋友，部分原因是他们在美国总统的支持者中很受欢迎，他们认为他们是拜登相关指控的来源。\n当纽约邮报的报道发表时，该组织在Facebook上再次传播关于拜登夫妇的未经证实的信息，以示庆祝。\n在三个人-安德烈·特里琴科(Andriy Telizhenko)、奥莱克桑德尔·奥尼申科(Oleksandr Onyshchenko)和安德烈·德尔卡奇(Andriy Derkach)-的个人Facebook页面上，最前面和中心的是关于《纽约邮报》故事。虽然他们没有直接分享故事的链接，但他们共享了有关报道或图片的链接。\n前乌克兰外交官、朱利安尼的长期助手特里琴科(Telizhenko)发布了一张特朗普手持周三版“纽约邮报”(New York Post)的照片，标题为“拜登秘密电子邮件”(Biden Secret E-mail)。特利琴科一直是所谓拜登夫妇丑闻的关键来源。\n两个小时后，Telizhenko在一个支持特朗普的博客上发布了一个链接，链接到一篇关于另一篇《纽约邮报》(New York Post)故事的文章，并用英文写道：“参议院委员会调查新发现的亨特·拜登(Hunter Biden)电子邮件。”一夜之间，他发布了第三篇帖子，并附上了另一个链接，指向与邮报报道相关的一篇文章。\n这些帖子被分享了5次、14次和2次，在发布时分别获得了36、13和7个赞，参与度与Telizhenko之前的帖子一致。\n朱利安尼的另一名同事、现已解散的亲俄地区党(Party Of Regions)前乌克兰议员奥尼什琴科(Onyshchenko)也发布了这一故事。奥尼什琴科目前因涉嫌从一家乌克兰天然气公司挪用1.2亿美元而逃亡。\n用俄语总结这篇报道时，Onyshchenko的帖子被分享了22次，获得了超过145个赞，参与度与他平时的帖子持平-如果不是略高的话。\n乌克兰议会议员德尔卡赫(Derkach)上个月受到美国财政部的制裁，并称其为“十多年来活跃的俄罗斯特工，与俄罗斯情报机构保持密切联系”。在“纽约邮报”(New York Post)的报道发表后，德尔卡赫用俄语发帖，讲述了他之前对拜登夫妇未经证实的指控。\n周三，他在基辅接受BuzzFeed新闻采访时表示，他与《纽约邮报》的报道没有任何关系，但他很高兴读到这篇报道。他说，他认为这份报告支持了他自己对拜登夫妇的未经证实的指控。他还指导BuzzFeed News观看了他最近在包括Facebook在内的社交媒体平台上分享的一段视频。\n德尔卡赫至少与朱利安尼见过三次面，包括去年12月在基辅，当时他传递了这位前纽约市市长的文件，两人声称显示拜登夫妇的腐败行为。那次会面在Facebook上发布的一条帖子，包括两人在基辅一家酒店的三张照片，已经被分享118次，评论38次，点赞550次。\nFacebook一直是Derkach的主要平台，用于分享有关泄露和编辑的录音的内容，据称这些录音来自拜登担任副总统期间与乌克兰前总统彼得罗·波罗申科(Petro Poroshenko)的对话。美国官员称这些录音是虚假信息，拜登竞选团队表示，这些录音是俄罗斯干预选举和帮助特朗普运动的一部分。\n这些录音从未经过认证，没有提供任何证据来支持有关拜登滥用职权帮助儿子在乌克兰的商业利益的指控。\n在过去的五周里，德尔卡赫在他的Facebook页面上发布的最后九个视频中，有七个是关于拜登-波罗申科的录音和相关文件的。这些视频总共被观看了超过8.3万次。其中四张照片显示，他出现在亲俄的乌克兰电视频道上，与总统弗拉基米尔·普京(Vladimir Putin)的密友、乌克兰议员维克托·梅德韦德丘克(Viktor Medvedchuk)有关联。\n位于华盛顿的伍德罗·威尔逊国际学者中心(Woodrow Wilson International Center For Scholars)的虚假信息研究员尼娜·扬科维奇(Nina Jankowicz)告诉BuzzFeed新闻，她认为Facebook可能是出于对《纽约邮报》报道中信息被非法获取的担忧，已经采取行动限制了该报道的传播。\n她说，“他们很难对拜登-乌克兰阴谋的其他一些说法采取类似的行动，因为他们不直接处理非法材料或其他直接违反服务条款的行为。”\n但德尔卡赫的录音可能会。今年早些时候，乌克兰启动了对它们来源的调查。据国际文传电讯社-乌克兰通讯社报道，总检察长伊琳娜·威尼迪克托娃(Iryna Vendiktova)在9月份表示，她的办公室也在调查这些文件是否经过编辑。", "note_en": "Facebook  said on Wednesday it would reduce the distribution of a New York Post story that published unverified claims about former vice president Joe Biden and his son, Hunter, pending a review by the site&#39;s fact-checking partners.\n But for more than a year, the social network has given a platform to a shady group of Ukrainian operatives — including one the US Treasury sanctioned and deemed an “active Russian agent” trying to interfere in the 2020 election — to spread unsubstantiated or debunked conspiracy theories about the Biden family.\n These Ukrainians have been key to helping Trump lawyer Rudy Giuliani with his efforts to smear the Bidens and help President Donald Trump win reelection. Along the way, they have garnered more than 200,000 followers and friends on Facebook, in part because of their popularity among supporters of the US president who look to them as sources of Biden-related allegations.\n And when the New York Post story was published, the group celebrated on Facebook by spreading unconfirmed information about the Bidens yet again.\n  Front and center on the personal Facebook pages of three men — Andriy Telizhenko, Oleksandr Onyshchenko, and Andriy Derkach — were posts about the New York Post story. While they did not share the link directly to the story, they shared links to reports about it or images of it.\n Telizhenko, a former Ukrainian diplomat and longtime Giuliani associate who has been a key source of purported dirt on the Bidens,  published what appeared to be a photoshopped image of Trump holding up a copy of Wednesday’s edition of the New York Post with the headline, “Biden Secret E-Mails.”\n Two hours later, Telizhenko  posted a link to an article in a pro-Trump blog about a different New York Post story, writing in English, “Senate committee to investigate newly discovered Hunter Biden emails.” And overnight, he published a  third post with yet another link to an article related to the Post’s report.\n The posts were shared 5, 14, and 2 times, with 36, 13, and 7 likes, respectively, at the time of publishing, amounts of engagement that are in line with previous posts from Telizhenko.\n Onyshchenko, another Giuliani associate and a former Ukrainian lawmaker in the now-defunct pro-Russia Party of Regions who is now a fugitive for allegedly embezzling more than $120 million from a Ukrainian gas company, also  posted about the story.\n Summarizing the report in Russian, Onyshchenko’s post was shared 22 times and received more than 145 likes, amounts of engagement that are in line with — if not slightly higher — than his usual posts.\n Derkach, a member of the Ukrainian Parliament, whom the US Treasury  sanctioned last month and termed “an active Russian agent for over a decade, maintaining close connections with the Russian Intelligence Services,”  posted in Russian about unverified allegations he made previously about the Bidens after the New York Post story was published.\n He told BuzzFeed News from Kyiv on Wednesday that he had nothing to do with the New York Post story but was pleased to read it. He said he believed the report bolstered his own unsubstantiated allegations against the Bidens. He also directed BuzzFeed News to a recent video he shared across his social media platforms, including Facebook.\n Derkach has met Giuliani on at least three occasions, including  in Kyiv last December, when he passed the former New York City mayor documents the two men have claimed to show corruption on the part of the Bidens. A  Facebook post from that meeting, which included three photographs of the two men together at a Kyiv hotel has been shared 118 times, commented on 38 times, and liked 550 times.\n Facebook has been Derkach’s main platform for sharing content about leaked and edited audio recordings purported to be from conversations that Biden had while serving as vice president with former Ukrainian president Petro Poroshenko. US officials have labeled the recordings disinformation and the Biden campaign has said they are part of a Russian campaign to interfere in the election and help Trump.\n The recordings, which have never been authenticated, provide no evidence to back up accusations that Biden abused his power to help his son’s business interests in Ukraine.\n Seven of the last nine videos  posted by Derkach to his Facebook page in the last five weeks have been about the Biden-Poroshenko recordings and related documents. Collectively, they have been viewed more than 83,000 times. Four of them show his appearances on pro-Russia Ukrainian television channels  linked to Viktor Medvedchuk, a fellow Ukrainian lawmaker who is  a close friend of President Vladimir Putin.\n Nina Jankowicz, a disinformation fellow at the Washington-based Woodrow Wilson International Center for Scholars, told BuzzFeed News she thought Facebook may have moved to limit the spread of the New York Post story out of concern that the information included in it was illicitly obtained.\n “It would be harder for them to take similar action with some of the other narratives that have been spun as part of the Biden-Ukraine conspiracy, as they don’t deal directly with illicit material or other direct violations of terms of service,” she said.\n But the Derkach recordings might. A Ukrainian investigation into their origin was launched earlier this year. Prosecutor General Iryna Venediktova said in September that her office was also looking at whether they had been edited, the Interfax-Ukraine news agency  reported.", "posttime": "2020-10-16 02:59:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,美国,特工,group,乌克兰", "title": "Facebook让一群乌克兰特工，包括一名受到美国财政部制裁的特工，在一年多的时间里散布有关拜登家族的阴谋论", "title_en": "Facebook let a group of Ukrainian operatives, including one sanctioned by US Treasury, spread conspiracy theories about the Biden family for more than a year", "transed": 1, "url": "https://www.buzzfeednews.com/article/christopherm51/facebook-giuliani-ukraine-posts?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "美国", "特工", "group", "乌克兰"]}, {"category": "", "categoryclass": "", "imagename": "0cfd844dd303a632fd7ef81beffd3817.png", "infoid": 1029093, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你一直躲在一块岩石下--这些天谁会责怪你呢？--你可能错过了库伯内斯现在是如何完全主导集装箱编排的。快速掌握Kubernetes的一种方法是使用Canonical的MicroK8。这是一个易于运行和安装的Kubernetes迷你版。现在，Canonical增加了自主高可用性(HA)集群。\n您可以看到，MicroK8虽然又小又简单，但却是一个成熟的Kubernetes实现。它包括自动更新和定义明确的安全功能。Microk8还包括规范的开源附加服务，如容器注册表、存储直通，以及用于硬件加速和机器学习工作流的本地GPGPU支持。\n现在，有了HA，MicroK8s已经准备好从物联网(IoT)实施，在工作站上测试Kubernetes实施，或者简单地学习Kubernetes，转而从事更大、更好的云工作。\n在新的MicroK8s版本中，一旦群集了三个或更多节点，就会自动启用高可用性，并且数据存储会在节点之间自动迁移，以便在发生故障时保持仲裁。MicroK8设计为最小的兼容Kubernetes，可以在Linux、MacOS或Windows上轻松安装和集群。\n要工作，HA Kubernetes集群需要三个要素。下面是它在MicroK8中的工作原理。\n必须有多个工作节点。因为MicroK8s将每个节点都用作工作节点，所以只要群集中有多个节点，总会有另一个工作节点可用。\nKubernetes API服务必须在一个或多个节点上运行，这样丢失单个节点才不会导致集群无法运行。MicroK8s集群中的每个节点都是一个API服务器，这简化了负载平衡，这意味着如果一个API端点出现故障，我们可以即时切换到不同的API端点。\n群集状态必须位于可靠的数据存储区中。默认情况下，MicroK8s使用高可用性SQLite Dqlite作为其数据存储。\nDqlite是Canonical的RAFT-Enhanced SQLite。RAFT是一种流行的共识复制算法，用于构建弹性强一致的系统。Dqlite减少了群集内存占用，并自动执行数据存储区维护。如果您愿意，您还可以将MicroK8配置为使用etcd，但是Dqlite提供了自动、自主的高可用性。\n要使其正常工作，您只需在集群中拥有三个或更多节点即可。一旦您拥有了它，Dqlite就会自动高度可用。如果群集有三个以上的节点，则其他节点将成为数据存储区的备用候选节点，并在数据存储区丢失其中一个节点时自动升级。自动将备用节点提升到Dqlite的投票集群使MicroK8s HA具有自治性，并确保即使不采取任何管理操作也能保持仲裁。\nMicroK8会自动选择最佳节点来提供数据存储区。如果一个数据存储区节点出现故障，下一个最佳节点将自动升级到其位置。MicroK8s管理自己的控制平面，确保API服务保持正常运行。\n这相当巧妙，而且对于这么小的Kubernetes实现来说也是非常顺利的。数据中心解决方案产品经理Canonical Alex Chalkias称，其结果是零操作体验，非常适合分布式微云和忙碌的管理员。\nMavenCode的联合创始人兼MLOps平台工程师查尔斯·阿德蒂洛耶(Charles Adetiloye)对此表示赞同。他的公司使用它来构建机器学习(ML)模型管道，以便与Kubeflow进行大规模的生产部署。\nAdetiloye说，对于MavenCode，MicroK8对我们的数据科学家和ML工程师来说很方便，可以快速制作、构建和部署这些管道的原型。MicroK8非常容易设置和配置，极其轻巧，它很容易模拟我们的生产环境，实现管道的无缝迁移和部署。\n但Canonical指出，MicroK8在生产中也很有用。它可用于强化工业物联网应用；边缘节点，如远程分支机构机架、零售点、蜂窝塔或汽车；以及任务关键型控制系统。简而言之，新的microK8可能正是您的公司开发新应用并将其部署到物联网设备和边缘所需的。", "note_en": "If you&#39;ve been hiding under a rock -- and who could blame you these days? -- you may have missed how totally  Kubernetes now dominates container orchestration. One way to quickly get up to speed on  Kubernetes is with  Canonical&#39;s   MicroK8s. This is an easy-to-run and install mini-version of Kubernetes. And now Canonical has added  autonomous high availability (HA) clustering to it.\n      You see MicroK8s, although small and simple, is a full-fledged Kubernetes implementation. It includes automatic updates and well-defined security capabilities. Microk8s also includes Canonical open-source  add-on services such as a container registry, storage pass-through, and native GPGPU enablement for hardware acceleration and machine learning workflows.\n Now, with HA, MicroK8s is ready to move from Internet of Things (IoT) implementations, testing out Kubernetes implementations on a workstation, or simply learning Kubernetes to bigger, better cloud jobs.\n With the new MicroK8s release, HA is enabled automatically once three or more nodes are clustered, and the data store migrates automatically between nodes to maintain a quorum in the event of a failure. Designed as a minimal conformant Kubernetes, MicroK8s installs, and clusters easily on Linux, macOS, or Windows.\n To work, a HA Kubernetes cluster needs three elements. Here&#39;s how it works in MicroK8s.\n There must be more than one worker node. Since MicroK8s uses every node as a worker node, there is always another worker available so long as there&#39;s more than one node in the cluster.\n The Kubernetes API services must run on one or more nodes so that losing a single node would not render the cluster inoperable. Every node in the MicroK8s cluster is an API server, which simplifies load-balancing and means we can switch instantaneously to a different API endpoint if one fails.\n The cluster state must be in a reliable datastore. By default, MicroK8s uses  Dqlite, a high-availability  SQLite, as its datastore.\n Dqlite is Canonical&#39;s raft-enhanced SQLite.  Raft is a popular consensus replication algorithm for building resilient, strongly consistent systems. Dqlite reduces the cluster memory footprint and automates datastore maintenance. If you want, you can also configure MicroK8s to use etcd, but Dqlite provides automatic, autonomous high availability.\n   To get this to work, all you need is to have three or more nodes in your cluster. Once you have that, Dqlite is automatically highly available. If the cluster has more than three nodes, then additional nodes will be standby candidates for the datastore and promoted automatically if the datastore loses one of its nodes. The automatic promotion of standby nodes into the voting cluster of Dqlite makes MicroK8s HA autonomous and ensures that quorum is maintained even if no administrative action is taken.\n MicroK8s automatically chooses the best nodes to provide the datastore. If one datastore node fails, the next best one is automatically promoted in its place. MicroK8s manages its own control plane, ensuring API services stay up and running.\n This is pretty darn neat, and it&#39;s remarkably smooth for such a small Kubernetes implementation. The result is &#34;a zero-ops experience that is perfect for distributed micro clouds and busy administrators,&#34; claimed Canonical Alex Chalkias, datacenter solutions product manager.\n Charles Adetiloye, co-founder and MLOps Platform Engineer at  MavenCode agreed. His company uses it for building machine learning (ML) model pipelines for production deployment at scale with  Kubeflow.\n For MavenCode, Adetiloye said, &#34;MicroK8s comes in handy for our Data Scientists and ML Engineers to quickly prototype, build, and deploy these pipelines. MicroK8s is very easy to set up and configure, extremely lightweight and it easily emulates our production environments for seamless migration and deployment of the pipelines.&#34;\n But Canonical points out MicroK8s is also useful in production. It can be used to harden industrial IoT applications; edge nodes such as remote branch office racks, retail points of sale, cell towers, or cars; and mission-critical control systems. In short, the new microK8s may be just what your company needs for developing new apps and deploying them to IoT devices and the edge.", "posttime": "2020-10-16 02:55:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推出,introduces,节点", "title": "Canonical推出高可用性Micro-Kubernetes", "title_en": "Canonical introduces high-availability Micro-Kubernetes", "transed": 1, "url": "https://www.zdnet.com/article/canonical-introduces-high-availability-micro-kubernetes/", "via": "", "real_tags": ["推出", "节点"]}, {"category": "", "categoryclass": "", "imagename": "48dbe2ae61922fb318b4e16b9404efc0.png", "infoid": 1029092, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CloudFlare于十年前推出，旨在保护面向网络的属性不受攻击，并对访问者进行快速访问。CloudFlare客户拥有放置在我们网络上的互联网资产。这些网站和应用程序的访问者享受到了更快的体验，但访问Cloudflare网络以外的互联网资产的速度并不一致。\n在过去的几年里，我们开始打造能够帮助每个人提供更快、更安全的互联网的产品，而不仅仅是我们网络上网站的访问者。我们从访问任何网站的第一步开始，即DNS查询，并发布了世界上最快的公共DNS解析器1.1.1.1。任何互联网用户只需更换他们的解析器就可以提高连接到任何网站的速度。\n在让用户上网更快的同时，我们也专注于让互联网变得更加私密。我们构建了1.1.1.1来加速连接的最后一英里，从用户到我们的边缘或互联网上的其他目的地。与其他提供商不同的是，我们并不是为了销售广告而建造它的。\n去年，当我们推出Cloudflare Warp时，我们更进一步，让从一台设备进行的整个连接变得更快、更安全。只需按一下按钮，用户就可以通过附近的Cloudflare数据中心使用WireGuard隧道将他们的移动设备连接到整个互联网。Cloudflare背后网站的流量变得更快，用户对互联网其余部分的体验变得更加安全和私密。\n我们在今年早些时候将这种体验带到了测试版的台式机上，今天我们很兴奋地宣布Cloudflare Warp面向台式机用户全面上市。现在，无论您如何连接，整个互联网都可以更加安全和私密。\n对于世界各地的个人用户来说，Warp让互联网变得更快、更私密。但是，随着企业大规模采用远程工作模式，安全团队很难将他们在办公室启用的安全控制扩展到远程员工。今天，我们将把我们的用户期望从WARP到安全团队的所有东西都带到安全部门。该版本还在我们的Cloudflare网关产品中启用了新功能。\n客户可以使用Cloudflare Warp应用程序将公司台式机连接到Cloudflare网关，以进行高级Web过滤。网关功能依赖于底层WARP技术的相同性能和安全优势，现在可对连接使用安全过滤。\n其结果是，企业可以通过一种简单的方式来保护其用户，无论他们身在何处，而无需将网络流量回程到集中的安全边界。取而代之的是，组织可以配置WARP客户端应用程序，以便通过他们附近的Cloudflare数据中心安全且私密地发送远程用户的流量。网关管理员将策略应用于通过客户端代理的出站Internet流量，从而使组织能够保护用户免受Internet上的威胁，并阻止企业数据离开其组织。\nWARP建立在这样一种理念之上，即即使不知道“VPN”代表什么的人也应该能够轻松地获得VPN提供的保护。不幸的是，对于我们这些非常熟悉传统企业VPN的人来说，需要一些更好的东西。进入我们自己的名为BoringTun的WireGuard实现。\nWarp应用程序使用BoringTun对来自您设备的所有流量进行加密，并将其直接发送到Cloudflare的边缘，确保中间没有人在窥探您正在做的事情。如果您正在访问的站点已经是Cloudflare客户，则内容会立即发送到您的设备。借助WARP+，我们使用Argo Smart Routing来设计通过我们的全球数据中心网络到达您正在与之交谈的任何人的最短路径。\n与1.1.1.1(世界上最快的公共DNS解析器)的强大功能相结合，WARP可确保您的流量安全、私密和快速。由于您在Internet上所做的几乎所有事情都是从DNS请求开始的，因此在所有设备上选择最快的DNS服务器将加快您在网上所做的几乎所有事情。不过，速度并不是一切，虽然您的应用程序和网站之间的连接可能是加密的，但该网站的DNS查找不是加密的。这使得任何人，甚至您的Internet服务提供商，都可以潜在地窥探(和销售)您在Internet上的位置。\nCloudFlare永远不会窥探或出售您的个人数据。如果您对我们的1.1.1.1解析器使用HTTPS上的DNS或TLS上的DNS，您的DNS请求将通过安全通道发送。这意味着如果您使用1.1.1.1解析器，那么除了我们的隐私保证之外，窃听者不能看到您的DNS请求。不过，不要轻信我们的话，今年早些时候，我们公布了第三方隐私检查的结果，我们会继续这样做，并希望其他人也会这样做。\n对于Gateway客户，我们致力于隐私和信任，永远不会将您的个人数据出售给第三方。虽然您的管理员将能够审核您组织的流量，创建有关数据保留时间的规则，或创建有关数据去向的特定策略，但Cloudflare永远不会出售您的个人数据或使用您的个人数据通过广告重新定位您。组织数据的隐私和控制权掌握在您手中。\n传统上，公司使用VPN解决方案来控制对公司资源的访问，并使用其过滤规则保护设备的安全。这些连接很快成为故障点(和入侵媒介)，因为随着通过其内部部署服务器的流量增长，组织需要管理和扩展VPN服务器。最终用户也不喜欢它。VPN服务器在高峰期通常不堪重负，客户端体积庞大，在设计时很少考虑性能。一旦一个差劲的演员进来，他们就可以接触到所有的东西。\n2020年1月，我们推出了用于团队的Cloudflare，作为此模型的替代品。面向团队的CloudFlare围绕两个核心产品构建。CloudFlare Access是一个零信任解决方案，允许组织将内部(现在是SaaS)应用程序连接到CloudFlare的边缘，并构建安全规则来实施对它们的安全访问。VPN不再是您组织的单一入口点；用户可以从任何地方工作，但仍然可以访问。CloudFlare Gateway的首批功能集中于通过专为企业构建的DNS解析器和策略引擎保护用户免受互联网威胁。\n目前全球数百万用户都在使用WARP客户端的强大功能，这将为安全团队带来令人难以置信的新用例：\n加密所有用户流量-无论您的用户在哪里，来自其设备的所有流量都会使用WARP加密，并私下发送到最近的WARP端点。这可以保护您的用户和组织免受任何人的窥探。如果您仍在访问之上使用传统VPN来加密用户流量，则不再需要。\nWARP+-Cloudflare为希望获得额外速度优势的客户提供优质的WARP+服务。现在将其打包到团队部署中。任何部署了团队客户端应用程序的团队客户都将自动获得WARP+的超高速度优势。\n远程员工的网关-直到今天，Gateway还要求您跟踪所有用户的IP地址，并为每个位置建立策略。这使得当用户将其设备带到新位置时，很难执行策略或提供恶意软件保护。安装了客户端后，可以在任何地方实施这些策略。\nL7防火墙和基于用户的策略-今天发布的Cloudflare Gateway SWG和Secure DNS允许您的组织对您的团队帐户实施设备身份验证，从而使您能够构建特定于用户的策略并强制所有流量通过防火墙。\n设备和用户审核-除了用户和设备策略，管理员还可以审核特定的用户和设备流量。与日志推送一起使用时，这将允许您的组织在发生违规或审核时进行详细的级别跟踪。\n我们知道在您的组织中部署另一款软件有多难，因此我们一直在努力使部署变得容易。要开始，只需导航到我们的注册页面并创建一个帐户。如果您已经有一个活跃账户，您可以绕过这一步，直接进入Cloudflare for Teams仪表板，在那里您将被直接放入我们的入职流程。注册并配置团队后，设置网关策略，然后从以下三种安装客户端的方式中选择一种来实施该策略：\n自助安装如果您是一个没有IT部门的小型组织，请您的用户自己下载客户端并键入所需的设置是最快的上手方式。\n脚本化安装我们的桌面安装程序支持快速编写安装脚本的功能。对于Windows，这与以下命令行一样简单：\nCloudFlare_warp_release-x64.msi/Quiet Organization=&#34；&lt；插入您的组织&&gt;34；service_mode=&#34；warp&#34；enable=&#34；true&#34；Gateway_Unique_ID=&34；&lt；插入您的网关DoH域&&gt;34；Support_URL=“&lt；mailto or http&&gt;您的支持人员&&gt;34；&#34；\n使用MDM工具(如Intune或JAMF)的受管设备组织可以通过一次操作将WARP部署到他们的整个设备群。就像您预先配置所有其他设备设置一样，可以设置WARP，以便最终用户只需在部署后单击Cloudflare WARP客户端，即可登录您团队的身份提供商。\n有关所有平台的安装选项、必填字段和分步说明的完整列表，请参阅WARP客户端文档。\n我们还想为我们的消费者用户WARP和我们的Cloudflare for Teams客户构建更多内容。下面是一些我们最兴奋(并允许分享)的文章：\n新的合作伙伴与CrowdStrike和VMware Carbon Black(现已上市)的集成将使您能够构建更全面的CloudFlare访问策略，在允许用户连接到应用程序之前检查设备运行状况。\n拆分隧道支持将允许您或您的组织指定应从WARP中排除的应用程序、站点或IP地址。这将允许游戏、流服务或您选择的任何应用程序等内容在连接之外工作。\nBYOD设备支持，特别是对移动客户端的支持。不在工作时间的企业用户应该能够很容易地关闭“办公模式”，这样公司政策就不会限制个人使用他们的个人设备。\n我们的客户端产品组合中还缺少一个主要的操作系统，Linux支持即将到来。\n我们很高兴终于能与我们的客户分享这些应用程序。我们要特别感谢我们的Cloudflare MVP，台式机上10万+的测试版用户，以及数百万移动用户，他们帮助Warp发展到今天的水平。\n产品新闻零信任零信任周1.1.1.1翘曲", "note_en": "Cloudflare launched ten years ago to keep web-facing properties safe from attack and fast for visitors. Cloudflare customers owned Internet properties that they placed on our network. Visitors to those sites and applications enjoyed a faster experience, but that speed was not consistent for accessing Internet properties outside the Cloudflare network.\n Over the last few years, we began building products that could help deliver a faster and safer Internet to everyone, not just visitors to sites on our network. We started with the first step to visiting any website, a DNS query, and released the world’s fastest public DNS resolver, 1.1.1.1. Any Internet user could improve the speed to connect to any website simply by changing their resolver.\n While making the Internet faster for users, we also focused on making it more private. We built 1.1.1.1 to accelerate the last mile of connections, from user to our edge or other destinations on the Internet. Unlike other providers, we did not build it to sell ads.\n Last year we went one step further to make the entire connection from a device both faster and safer when we launched Cloudflare WARP. With the push of a button, users could connect their mobile device to the entire Internet using a WireGuard tunnel through a Cloudflare data center near to them. Traffic to sites behind Cloudflare became even faster and a user’s experience with the rest of the Internet became more secure and private.\n We brought that experience to desktops in beta earlier this year, and are excited to announce the general availability of Cloudflare WARP for desktop users today. The entire Internet can now be more secure and private regardless of how you connect.\n  WARP made the Internet faster and more private for individual users everywhere. But as businesses embraced remote work models at scale, security teams struggled to extend the security controls they had enabled in the office to their remote workers. Today, we’re bringing everything our users have come to expect from WARP to security teams. The release also enables new functionality in our  Cloudflare Gateway product.\n Customers can use the Cloudflare WARP application to connect corporate desktops to Cloudflare Gateway for advanced web filtering. The Gateway features rely on the same performance and security benefits of the underlying WARP technology, now with security filtering available to the connection.\n The result is a simple way for enterprises to protect their users wherever they are without requiring the backhaul of network traffic to a centralized security boundary. Instead, organizations can configure the WARP client application to securely and privately send remote users’ traffic through a Cloudflare data center near them. Gateway administrators apply policies to outbound Internet traffic proxied through the client, allowing organizations to protect users from threats on the Internet, and stop corporate data from leaving their organization.\n  WARP was built on the philosophy that even people who don’t know what “VPN”  stands for should be able to still easily get the protection a VPN offers. For those of us unfortunately very familiar with traditional corporate VPNs, something better was needed. Enter our own WireGuard implementation called  BoringTun.\n The WARP application uses BoringTun to encrypt all the traffic from your device and send it directly to Cloudflare’s edge, ensuring that no one in between is snooping on what you&#39;re doing. If the site you are visiting is already a Cloudflare customer, the content is immediately sent down to your device. With WARP+ we use Argo Smart Routing to to devise the shortest path through our global network of data centers to reach whomever you are talking to.\n  Combined with the power of  1.1.1.1 (the  world&#39;s fastest public DNS resolver), WARP keeps your traffic secure, private and fast. Since nearly everything you do on the Internet starts with a DNS request, choosing the fastest DNS server across all your devices will accelerate almost everything you do online. Speed isn’t everything though, and while the connection between your application and a website may be encrypted, DNS lookups for that website were not. This allowed anyone, even your Internet Service Provider, to potentially snoop (and sell) on where you are going on the Internet.\n Cloudflare will never snoop or sell your personal data. And if you use DNS-over-HTTPS or DNS-over-TLS to our 1.1.1.1 resolver, your DNS request will be sent over a secure channel. This means that if you use the 1.1.1.1 resolver then in addition to our privacy guarantees an eavesdropper can’t see your DNS requests. Don’t take our word for it though, earlier this year we published the results of a  third-party privacy examination, something we’ll keep doing and wish others would do as well.\n For Gateway customers, we are committed to privacy and trust and will never sell your personal data to third parties. While your administrator will have the ability to audit your organization&#39;s traffic, create rules around how long data is retained, or create specific policies about where they can go, Cloudflare will never sell your personal data or use your personal data to retarget you with advertisements. Privacy and control of your organization&#39;s data is in your hands.\n  Traditionally, companies have used VPN solutions to gate access to corporate resources and keep devices secure with their filtering rules. These connections quickly became a point of failure (and intrusion vector) as organizations needed to manage and scale up VPN servers as traffic through their on premise servers grew. End users didn&#39;t like it either. VPN servers were usually overwhelmed at peak times, the client was bulky and they were rarely made with performance in mind. And once a bad actor got in, they had access to everything.\n  In  January 2020, we launched Cloudflare for Teams as a replacement to this model. Cloudflare for Teams is built around two core products.  Cloudflare Access is a Zero Trust solution allowing organizations to connect internal (and now,  SaaS) applications to Cloudflare’s edge and build security rules to enforce safe access to them. No longer were VPNs a single entry point to your organization; users could work from anywhere and still get access.  Cloudflare Gateway’s first features focused on protecting users from threats on the Internet with a DNS resolver and policy engine built for enterprises.\n The strength and power of WARP clients, used today by millions of users around the world, will enable incredible new use cases for security teams:\n Encrypt all user traffic - Regardless of your users’ location, all traffic from their device is encrypted with WARP and sent privately to the nearest WARP endpoint. This keeps your users and your organizations protected from whomever may be snooping. If you still used a traditional VPN on top of Access to encrypt user traffic, that is no longer needed.\n WARP+ - Cloudflare offers a premium WARP+ service for customers who want additional speed benefits. That now comes packaged into Teams deployments. Any Teams customer who deploys the Teams client applications will automatically receive the premium speed benefits of WARP+.\n Gateway for remote workers - Until today, Gateway required that you keep track of all your users’ IP addresses and build policies per location. This made it difficult to enforce policy or provide malware protection when a user took their device to a new location. With the client installed, these policies can be enforced anywhere.\n L7 Firewall and user based policies - Today&#39;s announcement of  Cloudflare Gateway SWG and Secure DNS allows your organization to enforce device authentication to your Teams account, enabling you to build user-specific policies and force all traffic through the firewall.\n Device and User auditing - Along with user and device policies, administrators will also be able to audit specific user and device traffic. Used in conjunction with logpush, this will allow your organization to do detailed level tracing in case of a breach or audit.\n   We know how hard it can be to deploy another piece of software in your organization, so we’ve worked hard to make deployment easy. To get started, just navigate to our  sign-up page and create an account. If you already have an active account, you can bypass this step and head straight to the  Cloudflare for Teams dashboard where you’ll be dropped directly into our onboarding flow. After you have signed up and configured your team,  setup a Gateway policy and then choose one of the three ways to install the clients to enforce that policy from below:\n Self Install If you are a small organization without an IT department, asking your users to download the client themselves and type in the required settings is the fastest way to get going.\n  Scripted Install Our desktop installers support the ability to quickly script the installation. In the case of Windows, this is as easy as this command line:\n Cloudflare_WARP_Release-x64.msi /quiet ORGANIZATION=&#34;&lt;insert your org&gt;&#34; SERVICE_MODE=&#34;warp&#34; ENABLE=&#34;true&#34; GATEWAY_UNIQUE_ID=&#34;&lt;insert your gateway DoH domain&gt;&#34; SUPPORT_URL=”&lt;mailto or http of your support person&gt;&#34;\n Managed Device Organizations with MDM tools like Intune or JAMF can deploy WARP to their entire fleet of devices from a single operation. Just as you preconfigure all other device settings, WARP can be set so that all end users need to do is login with your team’s identity provider by clicking on the Cloudflare WARP client after it has been deployed.\n  For a complete list of the installation options, required fields and step by step instructions for all platforms see the  WARP Client documentation.\n  There is still more we want to build for both our consumer users of WARP and our Cloudflare for Teams customers. Here’s a sneak peek at some of the ones we are most excited about (and allowed to share):\n New partner integrations with CrowdStrike and VMware Carbon Black (Tanium available today) will allow you to build even more comprehensive Cloudflare Access policies that check for device health before allowing users to connect to applications\n Split Tunnel support will allow you or your organization to specify applications, sites or IP addresses that should be excluded from WARP. This will allow content like games, streaming services, or any application you choose to work outside the connection.\n BYOD device support, especially for mobile clients. Enterprise users that are not on the clock should be able to easily toggle off “office mode,” so corporate policies don’t limit personal use of their personal devices.\n We are still missing one major operating system from our client portfolio and Linux support is coming.\n  We are excited to finally share these applications with our customers. We&#39;d especially like to thank our Cloudflare MVP’s, the 100,000+ beta users on desktop, and the millions of existing users on mobile who have helped grow WARP into what it is today.\n  Product News  Zero Trust  Zero Trust Week  1.1.1.1  WARP", "posttime": "2020-10-16 02:55:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "适用,cloudflare,warp", "title": "介绍适用于桌面的Cloudflare Warp和适用于团队的CloudFlare", "title_en": "Introducing Cloudflare WARP for Desktop and Cloudflare for Teams", "transed": 1, "url": "https://blog.cloudflare.com/warp-for-desktop/", "via": "", "real_tags": ["适用", "warp"]}]