[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033293, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开发者使用的代码托管服务GitHub.com的全部源代码刚刚泄露给公众。\n在一次对GitHub DMCA官方存储库的可疑提交中，一个身份不明的人上传了机密源代码，利用GitHub应用程序中的一个漏洞冒充了纳特·弗里德曼(Nat Friedman)。\n作为开源的核心，GitHub长期以来一直因对其源代码保密而受到批评。该平台托管着数百万个开源项目，批评人士称GitHub的立场有些虚伪。\n然而，这引发了人们对GitHub源代码安全性的质疑，以及如果GitHub确实计划公开发布源代码，GitHub是否会有什么损失。\n一些人担心这会损害GitHub的整体安全，这可能是真的。通常情况下，封闭源代码应用程序的安全性是默默无闻的。这意味着源代码是隐藏的，目的是隐藏安全风险。\n自2018年微软收购GitHub以来，微软一再强调他们对开源的热爱。我们从反复的商业广告中看到了这一点，这些广告的目的是让微软走在开源开发的前沿。\n一些用户，如Drew DeVault，暗示微软正试图集中开源。通过封闭源代码的应用程序和对Git的专有扩展，GitHub被视为一个试图包含开源的平台。这方面的一个例子是GitHub离线两个小时，导致数千个开源项目无法访问和使用。\n也许GitHub晚了12年才向公众公布他们的源代码；也许这正是我们所需要的。你认为如何？", "note_en": "The entire source code for the code hosting service used by developers,  GitHub.com, has just been leaked to the public.\n In a suspicious  commit to the  official GitHub DMCA repository, an unknown individual uploaded the confidential source code, impersonating Nat Friedman using a bug in GitHub&#39;s application.\n At the heart of open-source, GitHub has long been criticised for keeping its source code private. The platform hosts millions of open-source projects, and critics say GitHub&#39;s position is somewhat hypocritical.\n However, this raises questions around the security of GitHub&#39;s source code, and whether or not GitHub have anything to lose, if they do plan to release the source code in a public setting.\n Some worry this will damage the overall security of GitHub, and this may be true. Commonly, closed-source applications perform &#34;security by obscurity&#34;. This means the source code is hidden, with the intention of concealing security risks.\n Since Microsoft&#39;s  acquisition of GitHub in 2018, Microsoft have repeatedly emphasised their &#34;love&#34; for open-source. We have seen this through repeated commercial advertisements, which aim to place Microsoft at the forefront of open-source development.\n Some users, such as Drew DeVault, suggest Microsoft is attempting to  centralise open-source. Through closed-source applications, and proprietary extensions to Git, GitHub is seen as a platform that tries to  contain open-source. An example of this is when  GitHub went offline for two hours, leaving thousands of open-source projects inaccessible and unusable.\n  Perhaps GitHub as 12 years late in finally revealing their source code to the public; and maybe this is just what we need.  What do you think?", "posttime": "2020-11-05 20:15:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,github,源代码,source", "title": "GitHub源代码泄露", "title_en": "GitHub Source Code Leak", "transed": 1, "url": "https://resynth1943.net/articles/github-source-code-leak/", "via": "", "real_tags": ["代码", "github", "源代码", "source"]}, {"category": "", "categoryclass": "", "imagename": "fd89d343a489237db4bd95ab98b134e8.jpg", "infoid": 1033292, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "观点画廊-3图片许多行业使用热量密集的过程，通常需要燃烧化石燃料，但一种令人惊讶的绿色燃料替代品正在以金属粉末的形式出现。磨得很细的廉价铁粉在高温下很容易燃烧，在不排放碳的过程中释放能量，并产生容易收集的铁锈或氧化铁作为其唯一的排放物。\n如果燃烧金属粉末作为燃料听起来很奇怪，那么下一步的过程将更加令人惊讶。使用电力，铁锈可以直接再生成铁粉，如果你使用太阳能、风能或其他零碳发电系统，你最终会得到一个完全无碳的循环。铁作为燃烧过程中的一种清洁电池，通过包括电解在内的多种方法之一充电，并在火焰和热量中放电。\n最近，荷兰的Swinkels Family Brewers成为世界上第一家将这一工艺投入工业规模的企业。该公司一直在与金属电力联盟(Metal Power Consortium)和德克萨斯大学埃因霍温分校(TU Eindhoven)的研究人员合作，在其巴伐利亚啤酒厂安装循环铁燃料系统，该系统能够提供每年约1500万杯啤酒所需的所有热量。\n皇家Swinkels Family Brewers的首席执行官Peer Swinkels说：“我们非常自豪能成为第一家在工业规模上测试这种新燃料的公司，以帮助加速能源转型，”Royal Swinkels Family Brewers的首席执行官佩尔·斯温克斯(Peer Swinkels)说。“作为一家家族企业，我们投资于可持续循环经济，因为我们是按世代而不是按年限思考的。我们在与金属电力联盟的合作中，将这种思维方式与高质量的知识结合在一起。通过这项创新技术，我们希望减少酿造过程对化石燃料的依赖。我们将继续在这项创新上投入资金。“。\n作为一种可燃烧的清洁能源存储介质，铁粉的优点包括：它便宜而丰富；它易于运输，具有良好的能量密度；它的燃烧温度高达1800摄氏度(3272华氏度)；以及(例如，与氢气不同)它不需要低温冷却，也不会在长时间的储存中损失任何能量。\n该系统的往返能量循环效率取决于再生过程中将能量输入到铁中的过程。根据这篇2018年的论文，高效的氧化铁电解可以将高达80%的输入能量储存在铁燃料中-这个数字与你用现代氢气分离得到的数字相似。\n这项技术还有更宏大的计划，不仅仅是启动单独的工业应用，甚至是主要输出热量的应用。\nTU Eindhoven是一个致力于发展金属燃料的组织，该组织的学生团队Solid负责人Chan Botter说：“我们为这个巨大的里程碑感到自豪，但我们也展望了未来。”他说：“目前已经有一个后续项目，目标是实现1兆瓦的系统，我们还致力于系统的技术改进。我们还计划在2024年建成一个10兆瓦的系统。我们的雄心壮志是到2030年将首批燃煤电厂转变为可持续的铁燃料工厂。“\n根据这篇2018年的论文，使用这种循环过程发电可能会接近40%左右的理论效率。生产可再生能源，然后以低效的汽轮机发电过程丢弃60%的可再生能源，这看起来可能有点奇怪，但这最终可能成为一种灵活且经济高效的方式来捕获、分配甚至出口可再生能源，这些能源是在不方便的时候产生的，当时没有直接送入电网的需求。\n通过现有的发电基础设施运行铁粉，可能只是需要改装以处理不同的燃烧过程，这将实现一个非常清洁、但对负荷敏感的电网，该电网可以利用从上述清洁、可再生能源再生作业或任何数量的工业制造作业中用卡车运来的容易储存的原材料。\n当然，经济学最终将决定这一想法会走多远，而在目前的早期阶段，这一点仍然存在疑问。但这一想法看起来肯定比氢气、抽水蓄能、电池或动能储存有一些优势，这取决于你使用它的目的，这是一个有趣的想法，我们将密切关注。\n查看图库-3张图片", "note_en": "View gallery - 3 images   Many industries use heat-intensive processes that generally require the burning of fossil fuels, but a surprising  green fuel alternative is emerging in the form of metal powders. Ground very fine, cheap iron powder burns readily at high temperatures, releasing energy as it oxidizes in a process that emits no carbon and produces easily collectable rust, or iron oxide, as its only emission.\n If burning metal powder as fuel sounds strange, the next part of the process will be even more surprising. That rust can be regenerated straight back into iron powder with the application of electricity, and if you do this using solar, wind or other zero-carbon power generation systems, you end up with a totally carbon-free cycle. The iron acts as a kind of clean battery for combustion processes, charging up via one of a number of means including electrolysis, and discharging in flames and heat.\n Recently, Swinkels Family Brewers in the Netherlands has become the first business in the world to put this process to work at an industrial scale. The company has been working with the Metal Power Consortium and researchers at TU Eindhoven to install a cyclical iron fuel system at its Brewery Bavaria that&#39;s capable of providing all the heat necessary for some 15 million glasses of beer a year.\n “We are enormously proud to be the first company to test this new fuel on an industrial scale in order to help accelerate the energy transition,” said Peer Swinkels, CEO of Royal Swinkels Family Brewers. “As a family business, we invest in a sustainable and circular economy because we think in terms of generations, not years. We combine this way of thinking with high-quality knowledge in the collaboration with the Metal Power Consortium. Through this innovative technology, we want to make our brewing process less dependent on fossil fuels. We will continue to invest in this innovation.”\n  As a burnable clean energy storage medium, iron powder&#39;s advantages include the fact that it&#39;s cheap and abundant, the fact that it&#39;s easy to transport and has a good energy density, its high burning temperature of up to 1,800 °C (3,272 °F), and the fact that (unlike hydrogen, for example) it doesn&#39;t need to be cryogenically cooled, or lose any energy during long periods of storage.\n The round-trip energy cycle efficiency of this system is dependent on the processes used to put the energy into the iron in the regeneration process. High-efficiency electrolysis of iron oxide can store as much as 80 percent of your input energy in the iron fuel, according to  this 2018 paper – a figure similar to what you get with  modern hydrogen splitting.\n There are bigger plans for this technology than just firing up individual industrial applications – or even just applications where the main output is heat.\n “While we’re proud of this huge milestone, we also look at the future,” says Chan Botter, who leads  student team SOLID at TU Eindhoven, a group dedicated to the advancement of metal fuels. “There’s already a follow-up project which aims to realize a 1-MW system in which we also work on the technical improvement of the system. We’re also making plans for a 10-MW system that should be ready in 2024. Our ambition is to convert the first coal-fired power plants into sustainable iron fuel plants by 2030.”\n  Using this kind of cyclical process to generate electricity could approach a theoretical efficiency around 40 percent, again according to  this 2018 paper. It might seem a little odd to generate renewable energy, then toss 60 percent of it out in the form of inefficient steam turbine generation processes, but this could end up being a flexible and cost-effective way to capture, distribute and even export renewable energy that&#39;s generated at inconvenient times when there&#39;s no demand for it to be fed directly into the grid.\n Running iron powder through existing power generation infrastructure, which may simply need retro-fitting to deal with a different combustion process, would enable a very clean, yet load-responsive power grid that could operate on an easily-stored stash of raw material trucked in either from clean, renewable energy regeneration operations as described above, or from any number of industrial manufacturing operations.\n Economics will eventually determine how far this idea gets, of course, and that remains in question at this early stage. But the idea certainly seems to have some advantages over hydrogen, pumped hydro, batteries or kinetic energy storage, depending on what you&#39;re using it for, and it&#39;s an interesting idea we&#39;ll be keeping an eye on.\n   View gallery - 3 images", "posttime": "2020-11-05 20:14:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "啤酒厂,brewery,燃料", "title": "荷兰啤酒厂燃烧铁作为一种清洁、可回收的燃料", "title_en": "Dutch brewery burns iron as a clean, recyclable fuel", "transed": 1, "url": "https://newatlas.com/energy/bavarian-brewery-carbon-free-renewable-iron-fuel/", "via": "", "real_tags": ["啤酒厂", "brewery", "燃料"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033291, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一个也是唯一一个用于Windows、WebAssembly、iOS、MacOS、Android和Linux的单代码库应用程序的用户界面平台。\n唯一的开源平台，用于创建真正的单源、多平台应用程序。跨本地移动、Web和桌面重用99%的业务逻辑和用户界面层。\n保持对像素去向的完美控制，同时可以选择开发特定于平台的或自定义的应用程序外观。\n对C#和XAML的熟悉和丰富，以及热重新加载、热重新启动、编辑和继续等工作效率的提升。", "note_en": "The first and only UI Platform for single-codebase applications for Windows, WebAssembly, iOS, macOS, Android and Linux\n  The only open source-platform for creating true single-source, multi-platform applications. Reuse 99% of the business logic and UI layer across native mobile, web and desktop.\n  Maintain   pixel-perfect control over where pixels go while having a   choice of developing platform-specific or custom look and feel of your application.\n  Familiarity and richness of C# and XAML combined with productivity boosts of hot reload, hot restart, edit and continue and more.", "posttime": "2020-11-05 20:14:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,android,webassembly,windows,linux", "title": "Uno：适用于Windows、WebAssembly、iOS、MacOS、Android和Linux的单代码库", "title_en": "Uno: Single-Codebase for Windows, WebAssembly, iOS, macOS, Android and Linux", "transed": 1, "url": "https://platform.uno/", "via": "", "real_tags": ["代码", "android", "windows", "linux"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033290, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "受到勒索软件攻击的公司往往面临双重威胁：即使他们避免支付赎金，并可以从头开始恢复，大约一半的时间里，攻击者也威胁要公布敏感的被盗数据，除非受害者为删除数据的承诺买单。撇开受害者可能对攻击者实际上会销毁被盗数据的真实预期不谈，新的研究表明，相当数量的确实付钱的受害者可能会看到部分或全部被盗数据被公布。\nCoveware是一家专门帮助公司从勒索软件攻击中恢复的公司，该公司今天发布了一份报告，得出了这一发现。Coveware表示，现在几乎一半的勒索软件案例都包括释放泄露数据的威胁。\n报告指出：“以前，当勒索软件的受害者有足够的备份时，他们只会恢复并继续生活；甚至没有理由与威胁行为者接触。”现在，当威胁参与者窃取数据时，拥有完全可恢复备份的公司通常会被迫至少与威胁参与者接触，以确定窃取了哪些数据。\nCoveware表示，它看到了大量证据表明，受害者在付费删除数据后，看到部分或全部被盗数据被公布；在其他情况下，这些数据甚至在受害者有机会谈判数据删除协议之前就被公布在网上。\n“与协商解密密钥不同，隐藏被盗数据的协商没有有限的终点，”该报告继续说道。“受害人一旦收到解密密钥，就不能带走，也不会随时间退化。有了被盗的数据，威胁行为人可以在未来的任何时候回来要求第二次付款。以往的记录太短，而且已经在收集有选择地违约的证据。“。\n该公司表示，它建议客户永远不要支付数据删除赎金，而是聘请称职的隐私律师，对哪些数据被盗进行调查，并根据律师和应用程序数据泄露通知法的建议通知任何受影响的客户。\n电脑安全公司Emsisoft的首席技术官法比安·沃萨尔(Fabian Wosar)表示，勒索软件受害者在试图阻止公众了解入侵事件时，往往默许数据发布勒索要求。\n“公司不希望这些数据被转储或出售。因此，他们为此付出代价，希望威胁行为人删除数据。从技术上讲，从法律角度看，他们是否删除数据并不重要。数据在被渗出的时候就丢失了。“\nWosar说，支付数字密钥来解锁被恶意软件加密的服务器和桌面系统的勒索软件受害者也依赖于希望，因为解密密钥无法解锁部分或所有受感染的机器的情况也并不少见。\n“当你查看大量赎金纸条时，你实际上可以看到团体非常直接地解决了这个问题，他们的短信内容大致是这样的：是的，你现在完蛋了。但如果你付钱给我们，一切都可以回到我们上你之前的状态。", "note_en": "Companies hit by ransomware often face a dual threat: Even if they avoid paying the ransom and can restore things from scratch, about half the time the attackers also threaten to release sensitive stolen data unless the victim pays for a promise to have the data deleted. Leaving aside the notion that victims might have any real expectation the attackers will actually destroy the stolen data, new research suggests a fair number of victims who do pay up may see some or all of the stolen data published anyway.\n  The findings come in  a report today from  Coveware, a company that specializes in helping firms recover from ransomware attacks. Coveware says nearly half of all ransomware cases now include the threat to release exfiltrated data.\n “Previously, when a victim of ransomware had adequate backups, they would just restore and go on with life; there was zero reason to even engage with the threat actor,” the report observes. “Now, when a threat actor steals data, a company with perfectly restorable backups is often compelled to at least engage with the threat actor to determine what data was taken.”\n Coveware said it has seen ample evidence of victims seeing some or all of their stolen data published after paying to have it deleted; in other cases, the data gets published online before the victim is even given a chance to negotiate a data deletion agreement.\n “Unlike negotiating for a decryption key, negotiating for the suppression of stolen data has no finite end,” the report continues. “Once a victim receives a decryption key, it can’t be taken away and does not degrade with time. With stolen data, a threat actor can return for a second payment at any point in the future. The track records are too short and evidence that defaults are selectively occurring is already collecting.”\n  The company said it advises clients never to pay a data deletion ransom, but rather to engage competent privacy attorneys, perform an investigation into what data was stolen, and notify any affected customers according to the advice of counsel and application data breach notification laws.\n Fabian Wosar, chief technology officer at computer security firm  Emsisoft, said ransomware victims often acquiesce to data publication extortion demands when they are trying to prevent the public from learning about the breach.\n “The company doesn’t want the data to be dumped or sold. So they pay for it hoping the threat actor deletes the data. Technically speaking, whether they delete the data or not doesn’t matter from a legal point of view. The data was lost at the point when it was exfiltrated.”\n Ransomware victims who pay for a digital key to unlock servers and desktop systems encrypted by the malware also are relying on hope, Wosar said, because it’s also not uncommon that a decryption key fails to unlock some or all of the infected machines.\n “When you look at a lot of ransom notes, you can actually see groups address this very directly and have texts that say stuff along the lines of, Yeah, you are fucked now. But if you pay us, everything can go back to before we fucked you.&#39;”", "posttime": "2020-11-05 20:13:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "被盗,delete,数据", "title": "为什么为删除被盗数据付费是件疯狂的事", "title_en": "Why Paying to Delete Stolen Data Is Bonkers", "transed": 1, "url": "https://krebsonsecurity.com/2020/11/why-paying-to-delete-stolen-data-is-bonkers/", "via": "", "real_tags": ["被盗", "delete", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033289, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的18个月里，我一直在脑海中断断续续地玩弄着一个理论上的想法，但我还没有完全大声地表达出来。它涉及编程语言中的所有权语义(OS)或移动语义的概念。从根本上说，本文是对这一概念的批判，并指出这一概念是传统面向对象程序设计的二元性，但适用于不同的领域。\n本文中使用的术语定义的一般列表，以最大限度地减少混淆。\n(数据)类型是一个值的属性，它编码有关如何对数据值进行操作的信息。\n自有价值是一种属于价值所有权等级的价值，这意味着它是由代理人管理的。\n范例是一种对编程语言结构模型进行分类的方法；范例是一种解释模型。\n面向对象编程(OOP)--通常通过将数据和代码耦合到单个单元中，围绕对象的唯一概念构建程序的范例。\n尽管Alan Kay 1创造的术语的原始概念从未按照他的意图使用，但术语面向对象编程(OOP)通常被理解为一种围绕对象概念构建程序的范例，通常是通过将数据和代码耦合到单个单元中来实现的。许多语言支持多种范式，包括面向对象编程范式的方面，但我将它们归类为多范式，而不只是一种面向对象语言。\n大多数语言按照Simula传统实现对象和类；大多数著名的OOP语言通过在类定义中定义方法(成员函数)来实现类似的形式。传统上，Java等语言可以单独归类为面向对象的语言。\n大多数传统的OOP语言都基于继承的概念，继承是一种从另一个类数据类型派生类数据类型并保留类似信息的机制。大多数人通常认为继承是子类型和通过虚拟方法表(Vtable)进行动态调度的组合。这引发了很多讨论，如果一种语言不支持继承2，那么它是否可以被称为面向对象程序设计(OOP)。\n最近，继承已经不再流行，取而代之的是组成3。这主要是由于将类符合严格(单一)代理层次结构的问题，而实际上，事物可以属于许多(如果不是无限的)类别和层次结构，以及我将在整篇文章中讨论的另一个方面。\n对OOP 4 5 6 6 7 8 9有很多批评，但我一般的批评是，它把重点从数据结构和算法转移到试图解决类型系统中的问题，而数据结构和算法是程序本质的核心。\n由于对象本身被视为具有行为(而不仅仅是类型属性)，因此它们实际上被视为程序中的代理。这种思维模式有很多结论，其中很多都会引发问题。\n面向对象编程是一种被误解和误用的亚里士多德形而上学，适用于它从未打算建模的领域。\n我这样说的意思是，人为地将数据和类型之间的任何/所有关系都遵循人为的代理层次结构，是天真-亚里士多德式形而上学的一种形式。由于编程对象中没有实际的代理，这是一个部分谬误。当程序试图使其具有特定的结构时，如果它不是自然的，那么程序中没有结构比糟糕的结构更有用。\n向类/对象添加方法的概念已被证明对许多人很有用。真正的问题是：\n对于大多数人来说，我敢打赌，在强调继承而不是组合的语言(如C++或Java)中，方法被视为将函数/过程与数据记录分类和关联的一种方式。采用这种方法有几个原因：\n允许将方法作为以主谓宾语方式编写调用的语法糖的形式，例如foo_do_thing(x，y)vs x.do_thing(Y)。\n根据经验，我发现长期使用“面向对象”语言的用户最终开始主要使用前两种方法来处理方法。\n我不会深入讨论OOP的其他主要方面，如封装、本地保留、多态形式等，因为分层性质是本文关注的基本方面。代理的(线性)层级是主要问题。人们之所以主张组合而不是继承，是因为它使这种线性层次变得扁平，降低了它的影响。它是从名义类型到结构类型的过渡，更灵活，因为许多数据结构和问题具有非线性性质，这是线性方法无法处理的。当试图坚持严格的层次结构类型系统方法时，这会导致许多问题，因为对于大多数问题来说，数据更多的是图形(非线性)，而不是树形(线性)。这种严格的层次结构也发生在对象级别的封装中，即消息/引用的严格层次结构；这种层次结构性质源于概念代理本身，继承不是根本原因。\n注：继承并不全是坏事，在现实生活中确实有很多实际用途，但在使用它们之前必须知道这些成本，就像使用任何工具一样。\n注：线性关系与数据结构本身有关，而与算法无关。\nC++11引入了移动语义或所有权语义(OS)的概念，这是一种通过复制构造函数最小化数据复制的方法。它利用增加的r值引用(T&amp；&amp；)概念来实现这一点。然而，这个概念开始被用于远远超出其基本目的的用途。这个概念增加了“移动”对象而不是“复制”对象的高级抽象。从物理上讲，计算机只会复制，这种高层次的抽象，把对象当作“真实的对象”来对待，这并不是实际发生的事情。将它们视为“真实对象”也是一个范畴错误，因为“真实对象”和“编程对象”在本体论上几乎没有联系。当一个值或对象被“移动”时，这意味着该对象的资源的责任已经转移到另一个对象或环境主体。在这种情况下，所有权/移动语义基本上是基于跟踪值使用情况的值的职责。\n在这种代理模式下，代理的竞技场可以采取多种形式，如区块、程序主体或聚合价值。因此，一些拥有价值的人还拥有其他价值，因此价值可能具有代理性。\n如果我们把所有权语义学称为一种范式，那就是以一种层次分明的方式围绕价值的责任进行定位，把重点从数据结构和算法转移到这个责任体系上。\n责任和所有权的概念与现实世界的对应概念相似，因为拥有某种东西意味着对它拥有独家使用和全部责任。\nRust是一种多范例编程语言，但其核心是一种面向所有权的语言。铁锈中的每一样东西都有一个“所有权”和与之相关的生命周期的概念。Ruust的设计初衷是要首先做到“安全”，尤其是在并发性方面。Rust在理念和风格上源自C++家族，但使用了更加侧重于限定符的声明语法和来自ML家族函数式语言的许多概念。\n理论上，生命周期与所有权是正交的，但在实践中，它们通常是内在耦合的。在本文中，我不会讨论基于对象的生存期问题。\n下面的Rust代码可以用来演示不同捕获对象(如let语句)之间的责任转移：\nPub struct foo{value：i32，}fn main(){let foo=foo{value：123}；let bar=foo；//`foo`的责任转移到`bar`println！(&#34；{}&#34；，foo.value)；//错误：使用移动值：`foo.value`println！(&#34；{}&#34；，bar.value)；}。\n默认情况下，Ruust是一种不可变的语言，可以选择使用mut实现可变性。不变性对逻辑的数学证明有很大帮助，因为事物可以很容易地“扁平化”，然而几乎所有的计算机从根本上都是可变的东西，即使不变性的抽象是一个有用的工具。因此，所有权语义系统需要更多的规则来考虑可变性，即通过引用添加“借用”的概念。借用检查器的一般规则如下：\n在使用Rust(或在C++11中充分利用语义)时，大多数人会定期与借阅检查器(特别是新手或在不同语言之间交换的人)进行竞争。很多人已经找到了减少这些问题的方法：\n保持小块，小结构，等等--这就缩小了代理的范围，从而减少了它必须承担的责任。\n最小化结构中的自引用，即很难使用引用实现类似图的数据结构。\n本质上，所有这些方法都以某种形式(如果不是完全的话)绕过了借入检查器，特别是索引/句柄的使用。前三种方法是扁平化(线性)责任层次。\n注：所有权语义确实有很多实际用例，可以用来证明许多问题的安全性，特别是减少程序中的漏洞。这就是Mozilla开发Rust的主要目的。通过沙箱、数据竞争、网络和其他并发问题，Web浏览器需要是非常安全的程序。当涉及到程序的安全性和健壮性时，能够在编译时证明某些事情是非常有用的。然而，正如我已经说过的，由于操作系统的线性性质，如果不诉诸不安全或完全绕过借入检查器的另一种方式，它无法解决一系列其他问题。\n所有权语义是仿射子结构类型系统1112的一种形式，这意味着它们基本上由线性逻辑描述，并解释了为什么它难以表达非线性问题。因此，所有权语义和借用检查器基本上是线性树(层次结构)，而不是其底层形式逻辑所描述的非线性图。现实生活中的许多数据结构和问题基本上都是非线性的，而线性方法无法处理这些问题。\n在引入移动语义的C++11中，STL包含了“智能指针”的概念，每个指针都有不同的子结构逻辑。\n如果您想更多地了解应用于Rust语言的所有权语义的基本逻辑，我推荐阅读这篇使用形式化数学解释该逻辑的文章：Oxide：the Essence of Rust(arxiv：1903.00982)。\n在面向对象的情况下，值/对象是代理。在操作系统的情况下，代理是对其负责的任何东西(例如，另一个对象、函数、块等)。两者都有非常严格和单一的线性值层次结构。\n两者在本质上都是单一的，因为它们处理的是单一形式的价值，而不是一组价值。它们(传统上)都是非常层次分明的，并且把重点放在系统作为控制过程的一种方式，而不是指导过程的算法。对象和拥有值基本上是“名词”，但程序是“动词”。\n处理奇异值可能非常有用，但并不是所有东西都是值。有些东西基本上是“非值”的，例如指令/控制流/声明。这是一种类似于面向对象程序设计(OOP)的整体世界观，即一切都必须是X(或产生X)。\n所有权语义与终生语义是分开的，但它们都需要在更复杂的问题中有用，而且通常是耦合的；这自然是因为基于单值的性质。\n从这些文章中，许多其他人认为，像Rust这样的语言可以解决许多这样的问题，比如释放后使用。然而，这不一定是真的。所有权语义可以解决一些问题，比如释放后使用，这是正确的，但这并不意味着它可以解决大部分问题。即使像释放后使用这样的事情是安全/内存错误，它们通常也是另一个更大问题的症状，而不是它本身就是根本原因。\n阅读这篇文章时，许多人会问一件事：“如果所有权语义不好，你建议用什么来替代呢？”\n通常，大多数困难问题不能在编译时解决；正因为如此，在语言的类型系统中添加越来越多的概念不会有任何帮助，除非增加额外的成本。这并不意味着所有权语义不好，但不能解决该领域的许多问题。\n许多与责任相关的问题都可以通过程序中的“子系统”形式得到更好的解决，这些“子系统”处理一组“事物”，并给出“事物”的句柄，而不是直接引用。这与许多人已经使用的通过使用索引/句柄绕过借入检查器的方法有关。句柄可以包含比单数多得多的信息。一种常见的方法是将世代号与索引一起存储在句柄中。如果一代死了，但是要求使用句柄，那么子系统可以发出一个虚拟的前哨数值并报告一个错误。\n其他方法是首先减少对责任的需求。通过保持数据结构POD的可复制性和零值的实用性，可以帮助您改变思考手头问题的方式并简化代码。它更强调数据和算法本身，而不是对象和类型之间的关系。\n所有权语义是一种以层次化的方式处理值的责任的方式，它以层次化的方式围绕值的责任进行处理。这导致了责任的(线性)价值层次结构，其中工程师对价值负责。所有权语义的问题与传统的面向对象程序设计(OOP)具有相同的结构性问题，这导致了行为的(线性)值层次结构，其中值充当代理。\n所有权语义对于某些问题来说是一个有用的工具，但由于其内在的线性逻辑，它们不能用来表达非线性问题，这使得人们试图完全绕过这个概念。\n“我认为物体就像网络上的生物细胞和/或单独的计算机，只能通过消息进行交流(所以消息传递一开始就是这样--花了一段时间才知道如何用一种编程语言高效地传递消息，使之变得有用)。”--艾伦·凯，2003年，http://userpage.fu-berlin.de/~ram/pub/pub_jf47ht81Ht/doc_kay_oop_en↩︎。\nGo编程语言不支持继承。然而，根据我的定义，Go是一种面向对象的语言，但它是围绕(隐式)接口(类型类或结构类型的一种形式)设计的，作为组成对象的一种方式，方法可以应用于任何用户定义的类型；而不仅仅是记录类型。↩︎。\n人们习惯于绕过借入检查器来减少争执，这意味着人们刚刚找到了一种方法来应对它施加的限制。↩︎。\n在写这篇文章的时候，我没有意识到这已经被开发出来了，我意外地重新发现了子结构类型系统和线性逻辑，并有了自己的术语。但是，它更适用于更常用的术语。↩︎", "note_en": "I have been toying with a theoretical idea for the past 18 months off-and-on in my head and I have not fully articulated it aloud yet. It is regarding the concept of  Ownership Semantics (OS) or  Move Semantics in programming languages. Fundamentally this article is a criticism of the concept and states that the concept is a duality of traditional OOP but applied to a different area.\n  A general list of definitions of terminology used within this article in order to minimize confusion.\n A  (Data) Type is an attribute of a value which encodes information about how the data value can be operated upon\n    An  Owned-Value is a value which belongs to a hierarchy of value ownership, which implies it is governed by an  agent\n   A  Paradigm is a way of classifying models of structure of programming languages; a  Paradigm is a  model of interpretation\n Object Orient(at)ed Programming (OOP) - A paradigm of structuring a program around the sole concept of  Objects, commonly through coupling data and code into a single unit.\n  Though the original conception of the term coined by Alan Kay  1 was never used as he intended it to be, the term  Object Orient(at)ed Programming (OOP) has been commonly understood to be a paradigm of structuring a program around the concept of  Objects, commonly through coupling data and code into a single unit. Many languages support multiple paradigms, including aspects for the OOP paradigm, but I would class those as multiparadigm rather than being  solely an OOP language.\n Most languages implement  Objects and  Classes in the Simula tradition; most of the notable OOP languages have a similar form by defining methods (member functions) within the class definition. Traditionally languages such as Java can be classed as  solely an OOP language.\n Most traditional OOP languages are based around the concept of  inheritance, a mechanism of deriving a class data type from another class data type and retaining similar information. Most people generally view inheritance as a combination of  subtyping and  dynamic dispatch through  virtual method tables (vtables). This has lead to many discussions asking whether a language can be called as OOP if it does not support inheritance  2.\n In recent times,  inheritance has been falling out of fashion in favour of  composition  3. This is mostly due to the issue of conforming a  class to a strict (singular) hierarchy of agency when in reality, things can belong to many (if not infinite) categories and hierarchies, as well as another aspect which I will be discussing throughout this article.\n There are many criticisms of OOP  4  5  6  7  8  9 but my general criticism is that by placing emphasis on trying to solve problem in the type system, it shifts focus from the data structures and algorithms,  the core of what a program fundamentally is.\n Since objects themselves are being treated  as if they have behaviour (not just type properties), they are effectively being treated as if they were  agents in the program. This mental model has many conclusions, many of which cause issues.\n  Object orientated programming is a form of misinterpreted and misapplied Aristotelian Metaphysics applied to a domain it was never meant to model\n What I mean by this statement is that  artificially conforming any/all relationships between data and types to an artificial hierarchy of  agency is a form of naïve-Aristotelian metaphysics. Since there is no actual  agency in the programming objects, it is a partial fallacy. When trying to conform a program to have a particular structure when it does not naturally, the absence of a structure in a program is more useful than a bad structure.\n  The concept of adding methods to classes/objects has proven useful to many. The real questions are:\n  For most people, I am going to bet that methods, in languages with an emphasis on inheritance rather than composition (such as C++ or Java), are treated as a way of categorizing and associating functions/procedures with a data record. There are a few reasons for this approach:\n Allowing methods as a form of syntactic sugar for writing calls in a  subject verb object manner e.g.  foo_do_thing(x, y) vs  x.do_thing(y)\n From experience, I have found that long time users of “OOP” languages eventually start treating methods primarily in the first two approaches.\n I will not go into depth about the other main aspects of OOP such as encapsulation, local retention, forms of polymorphism, etc, as the hierarchical nature is the fundamental aspect of focus for this article. The (linear) hierarchy of agency is the main problem. The reason why people argue for  composition over inheritance is that it flattens this linear hierarchy, reducing its effect. It is the transition from  nominal typing to  structural typing, which is more flexible because many data structures and problems have a  non-linear nature to them, which  linear approaches  cannot handle. When trying to adhere to the the strict hierarchical type system approaches, it leads to numerous issues because data is more commonly graph-like (non-linear) than tree-like (linear) for most problems. This strict hierarchy does occur with encapsulation at the object level too, a strict hierarchy of messages/references; this hierarchical nature arises from the concept agency itself, inheritance is not the root cause.\n n.b. Inheritance is not all bad and does have many real life practical uses, but these costs must be known before using them, like with any tool.\n n.b. The linearity is with regards to the data structures themselves and not the algorithms.\n  C++11 introduced the concept of  move semantics or  ownership semantics (OS), a way to minimize the copying of data through copy constructors. It utilizes the added concept of r-value references ( T &amp;&amp;) as a means to do this. However, the concept began to be used for a lot more than its basic purpose. The concept adds the high level abstraction of “moving” objects rather than “copying” objects. Physically, a computer only ever copies and this high level abstraction, to treat objects  as if they were “real objects”, is not what actually happens. It is also a  category error to treat them as “real objects” since “real objects” and “programming objects” have little connection with each other ontologically. When a value or object is “moved”, this means is that the  responsibilities of the resources of that object have been transferred to another object or environment— agents. In this case, ownership/move semantics is fundamentally based around the  responsibilities of values by tracking value usage.\n In this model of agency, the arena of agency can take on many forms, such as blocks, procedure bodies, or aggregate values. Therefore some  owned-values also  own other values, and thus a value could have agency.\n If we were to call Ownership Semantics a paradigm, it would be the orientation around the  responsibility of values in a hierarchical fashion, placing emphasis on this system of responsibility, shifting focus from data structures and algorithms.\n The concept of  responsibility and  ownership is similar to the real world counter parts in that to own something means to have exclusive use and full responsibility over it.\n Rust is a multi-paradigm programming language but at its core is an Ownership-Orientated language. Everything in Rust has a concept of  “ownership” and  lifetime associated with it. Rust is designed around trying to be first and foremost “safe”, especially with regards to concurrency. Rust derives from the C++ family in terms of philosophy and style, but uses a more  qualifier-focused declaration syntax and many concepts from functional languages from the  ML family.\n Lifetimes are theoretically orthogonal to  ownership but in practical, they usually are intrinsically coupled. I will not discuss the problems with object-based lifetimes in this article.\n The following Rust code can be used to demonstrate this responsibility transfer between different capturing things such as  let statements:\n pub struct Foo {\tvalue: i32,}fn main() {\tlet foo = Foo{value: 123};\tlet bar = foo; // the responsibility of `foo` is transferred to `bar`\tprintln!(&#34;{}&#34;, foo.value); // error: use of moved value: `foo.value`\tprintln!(&#34;{}&#34;, bar.value);}\n Rust is an immutable-by-default language, with the option to opt into mutability with  mut. Immutability helps a lot with mathematical proofs for logic since things things can be “flattened” quite easily, however virtually all computers are fundamentally mutable things, even if the abstraction of immutability is a useful tool. As a result, the ownership semantics system requires a few more rules to take into account mutability, by adding the concept of “borrowing” through references. The general rules for the borrow checker are:\n  When using Rust (or move semantics to their full extent in C++11), most people will fight the borrow checker regularly  10 (especially newcomers to the language or people swapping between different languages). Many people have found approaches to reduce these issues:\n Keep blocks small, structs small, etc—this reduces the size of the arena of agency and thus reduces the amount of responsibility it must take care of\n Minimize self references in structs, i.e. graph-like data structures are difficult to implement using references\n Essentially, all of these approaches are bypassing the borrow checker in some form (if not entirely), especially the use of indices/handles. The first three approaches are to flatten the (linear) responsibility hierarchy.\n n.b. Ownership semantics do have many practical use cases, and can be used to prove the safety of numerous problems, especially reducing vulnerabilities in programs. This is the main purpose why Rust was developed at Mozilla. Web browsers need to be very  safe programs, through sandboxing, data races, networking, and other concurrency issues. Being able to prove certain things at compile time is a very useful thing when it comes to safety and robustness of a program. However, as I have stated that because of the linear nature of OS, it cannot solve a whole range of other problems without resorting to  unsafe or another way of bypassing the borrow checker entirely.\n  Ownership semantics are a form of an  affine substructural type system  11  12 which means that they are fundamentally described by a  linear logic, and explains why it struggles to express  non-linear problems. Therefore ownership semantics and the borrow checker are fundamentally a linear tree (hierarchy) and not a non-linear graph, as described by its underlying formal logic. Many data structures and problems in real life are fundamentally  non-linear, of which  linear approaches  cannot handle.\n In C++11 with introduction of move semantics, the STL includes the concept of “smart pointers”, each with different substructural logic.\n  If you would like to learn more about the fundamental logic of the ownership semantics applied to the Rust language, I recommend reading this paper explaining the logic using formal mathematics:  Oxide: The Essence of Rust (arXiv:1903.00982).\n    In the the OOP case, the value/object is the agent. In the OS case, the agent is whatever has responsibility for it (e.g. another object, function, block, etc). Both have linear value hierarchies which are quite strict and singular.\n  Both are singular in nature in that they deal with singular forms of values rather than groups of values. They are both (traditionally) very hierarchical, and place emphasis on the system as a way to control the processes rather than the algorithms directing the processes. Objects and Owned-Values are fundamentally “nouns”, but programs are “verbs”.\n Dealing with singular values can be very useful, but not everything is a value. Some things are fundamentally “non-values” e.g. instructions/control-flow/declarations. It is a similar holistic world-view as OOP where everything must be X(, or produce X).\n Ownership Semantics are separate from  Lifetime Semantics, but they are both required to be useful in more complex problems, and are usually coupled; naturally because of the singular-value-based nature.\n   From these articles, many others have argued that languages like Rust would solve many of these problems, such as   use-after-free. However this may not be necessarily true. It is correct that ownership semantics would solve  some problems that cause things like  use-after-free but that does not mean it will solve most of them. Even if things like  use-after-free are security/memory bugs, they are usually a symptom of another larger problem than it itself being the root cause.\n  One thing many people will ask whilst reading this article is “if Ownership Semantics are bad, what do you propose as a replacement?”\n In general, most hard problems cannot be solved at compile time; because of this, adding more and more concepts to the type system of the language will not help without adding extra costs. This does not mean ownership semantics is bad but not a solution for many problems in that domain.\n A lot of the problems related to responsibility are better solved with forms of “subsystems” within programs which handle groups of “things” and give out  handles of the “thing” instead of a direct reference. This is related to the approach many people use already to bypass the borrow checker through using indices/handles. Handles can contain a lot more information than a singular number. A common approach is to store a generation number alongside the index in the handle. If a generation has died, but the handle is asked to be used, the subsystem can give out a dummy sentinel value and report an error.\n Other approaches are to reduce the need for responsibility in the first place. By keeping data structures  POD, trivially copyable, and the zero value of it useful, can help you change the way you think about the problem at hand and simplify code. It places more emphasis on the data and algorithms themselves rather than the relationships between objects and types.\n    Ownership semantics are a way to handle the responsibility of values in a hierarchical fashion Orientation around responsibility of values in a hierarchical fashion. This results in a (linear) value hierarchy of responsibility, where agents are responsible for values. The issues of ownership semantics parallel the same structural issues that Traditional-OOP has which results in a (linear) value hierarchy of behaviour, where the values act as agents.\n Ownership semantics can be a useful tool for certain problems, but due to their underlying linear logic, they  cannot be use to express  non-linear problems which resorts people to try and bypass the concept entirely.\n “I thought of objects being like biological cells and/or individual computers on a network, only able to communicate with messages (so messaging came at the very beginning – it took a while to see how to do messaging in a programming language efficiently enough to be useful).” - Alan Kay, 2003  http://userpage.fu-berlin.de/~ram/pub/pub_jf47ht81Ht/doc_kay_oop_en  ↩︎\n The  Go programming language does not support inheritance. However under my definition, Go is an OOP language but is designed around (implicit)  interfaces (a form of  type-classes or  structural typing) as a way to compose objects, and methods can be applied to any user defined type; not just record types.  ↩︎\n        Getting used bypassing the borrow checker to reduce fighting implies people have just found a way to cope with the constraints it imposes.  ↩︎\n Whilst writing this article, I did not realize that this was already developed, and I accidentally rediscovered substructural type systems and linear logic, and had my own terminology for it. However, it is more appropriate to the more commonly used terminology.  ↩︎", "posttime": "2020-11-05 20:13:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语义学,flaw,对象", "title": "所有权语义学的致命缺陷", "title_en": "The Fatal Flaw of Ownership Semantics", "transed": 1, "url": "http://www.gingerbill.org/article/2020/06/21/the-ownership-semantics-flaw/", "via": "", "real_tags": ["语义学", "flaw", "对象"]}, {"category": "", "categoryclass": "", "imagename": "e849366036aef3ba55efd605de539c70.jpeg", "infoid": 1033288, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迈阿密大学声称他们没有使用面部识别来恐吓学生抗议者。我们有证据证明他们在撒谎。\n迈阿密大学(University Of Miami)的学生们在得知校警利用识别技术瞄准并恐吓抗议政府对新冠肺炎安全防范措施不足的学生后感到愤怒。上个月，该校学生会院长把一群学生叫到他的办公室，斥责他们在新冠肺炎疫情爆发期间，与教职员工一起躺在院子里，以“未经批准”的方式举行抗议活动，要求提供更多保护措施。当一名学生询问被叫到院长办公室的人的名单是如何整理出来的时，院长告诉他们，他们的身份是通过面部识别技术识别出来的。\n是的，昨天，为未来而战了解到迈阿密大学的一位发言人断然否认该校使用面部识别。以下是该大学传播与公共关系执行主任发出的声明截图：\n但“为未来而战”(Fight For The Future)揭露的公开文件显示，这所大学几乎肯定是在撒谎。就在上周，密歇根州立大学警察局长还公开吹嘘该大学使用面部识别监控系统。在接受迈阿密大学校园杂志采访时，大卫·里韦罗说：\n通过佛罗里达州执法部门的面部识别软件，“我们能够[轻松地]辨认并逮捕他”。“我们已经(发现)了一些这样的坏人。”\n里韦罗局长的简历可以在迈阿密大学的网站上看到，他说他监督了该大学摄像头系统的创建，该系统包括面部识别。点击此处查看截图：\n然而，当记者联系迈阿密大学请其置评时，他们得到的回应却不符：“迈阿密大学不使用面部识别技术。”\n迈阿密大学(University Of Miami)研究生、迈阿密大学员工学生联盟(UMESA)成员马尔斯·费尔南德斯(Mars Fernandez)说：“面部识别能被用来传唤我和其他学生表达对我们学校处理致命病毒和经济危机的不满，这令人不安。他们现在否认了，但就在上周，一本校园杂志援引UMPD警察局长里韦罗的话说，他使用了面部识别。他们本可以询问分包工、教职员工和学生工作者我们怎么样了，需要什么。相反，他们似乎使用先进的技术来警告我们，不要“正确地”抗议，就好像他们从来都不会听一样。\n迈阿密大学(University Of Miami)本科生、UMESA成员埃斯特班·伍德(Esteban Wood)补充道：“我认为校园执法部门的任务是识别和平抗议者，这是一件令人遗憾的事情。”“高等院校应该欢迎异见人士，而不是恐吓异见人士。听说校园领导层使用面部识别技术，令人深感不安。\n大卫·里韦罗(David Rivero)在迈阿密警察局工作了26年，之后担任迈阿密大学(University Of Miami)警察局长。今年夏天，该警察局因使用面部识别技术识别黑人生命也是抗议者而受到人权专家和活动人士的严厉批评。\n根据BanFacialRecognition.com/Campus的计分卡，迈阿密大学使用面部识别将是逆势而为。从哈佛到麻省理工学院，美国有60多所大学表示，他们不打算使用面部识别技术，这项技术被专家广泛谴责为侵入性的、无效的，并受到系统性种族和性别偏见的困扰。\n支持学生积极分子的数字权利组织Fight for the Future的组织者莉娅·霍兰德(Lia Holland)说：“看起来迈阿密大学肯定是在利用面部识别来攻击和恐吓正在行使第一修正案权利的学生。”(她/她)是数字权利组织“争取未来”(Fight For The Future)的组织者，目前支持学生积极分子。“如果事实并非如此，那么他们需要告诉警察局长停止声称他们使用这项技术，并在校园内完全禁止面部识别。”以加州大学洛杉矶分校(UCLA)等其他校园以及波特兰、旧金山和波士顿等城市为榜样，清晰地维护学生、教职员工和教职员工的权利。\n迈阿密大学员工学生联盟(UMESA)的学生可以通过lia@fightforthefuture.org接受面试。为未来而战也可以发表评论。", "note_en": "The University of Miami claims they didn’t use facial recognition to intimidate student protesters. We have proof they’re lying.\n  Students at University of Miami  are outraged after learning that university police used recognition technology to target and intimidate students protesting the administration’s insufficient COVID-19 safety precautions. Last month, the Dean of Students called a group of students into his office to reprimand them for protesting in an “unapproved” manner by laying in a courtyard alongside faculty and staff to demand greater protections during the COVID-19 pandemic. When a student asked how the list of those called to the Dean’s office had been assembled, the Dean told them that they had been identified using facial recognition technology.\n Yes terday,  Fight for the Future learned that a University of Miami spokesperson is flat out denying that the school uses facial recognition. Here’s a screenshot of the statement sent by the university’s Executive Director of Communications and Public Relations:\n  But publicly available documents uncovered by Fight for the Future show that the university is almost certainly lying. The UM Chief of Police has openly bragged about the University’s use of facial recognition surveillance as recently as last week. In  an interview with the University of Miami’s campus magazine, David Rivero said:\n “We were able to [easily] identify and arrest him” through the Florida Department of Law Enforcement’s facial recognition software. “We’ve [detected] a few bad guys that way.”\n Chief Rivero’s resume, available through the   University of Miami website , states that he has overseen the creation of the University’s camera system and that that system includes facial recognition. See a screenshot here:\n  Yet when reporters reached out to the university for comment, they were met with a response that doesn’t line up: “The University of Miami does not utilize facial recognition technology.”\n  Mars Fernandez (she/they), graduate student at University of Miami and member of the University of Miami Employee Student Alliance (UMESA), said, “It’s disturbing that facial recognition can be used to summon me and other students for expressing discontent at our university’s handling of a deadly virus and economic crisis. They deny it now, but just last week UMPD Police Chief Rivero is quoted in a campus magazine as using facial recognition. They could have asked subcontracted workers, faculty workers, and student workers how we are and what we need. Instead it appears they use advanced technology to warn us about protesting “correctly,” as if they ever would have listened.”\n “I think it’s a shame that campus law enforcement was tasked with identifying peaceful protesters,”  added Esteban Wood (he/him), undergraduate student at University of Miami and also a member of UMESA. “Institutions of higher learning should welcome dissent, not intimidate dissenters. It’s deeply troubling to hear that campus leadership uses facial recognition technology.”\n David Rivero was with the Miami Police Department for 26 years before taking the role of Chief of Police for the University of Miami. This police department has sustained heavy criticism from human rights experts and activists for  using facial recognition technology to identify Black Lives Matter protesters this summer.\n According to the scorecard at  BanFacialRecognition.com/Campus, any use of Facial Recognition by the University of Miami would be a move against the tide. Over 60 campuses in the US, from Harvard to MIT, have stated that they do not plan to use facial recognition, technology that has been widely condemned by experts as invasive, ineffective, and plagued by systemic racial and gender bias.\n “It sure seems like the University of Miami is using facial recognition to target and intimidate students who are exercising their First Amendment rights,”  said Lia Holland (she/her), an organizer with digital rights group Fight for the Future who is supporting student activists. “If that’s not the case, then they need to tell their Chief of Police to stop claiming they use this technology and ban facial recognition from their campus entirely. Be crystal clear and stand up for the rights of students, staff, and faculty alike, following the lead of other campuses like UCLA, and cities like Portland, San Francisco, and Boston.”\n Students with the University of Miami Employee Student Alliance (UMESA) are available for interviews via  lia@fightforthefuture.org. Fight for the Future is also available to comment.", "posttime": "2020-11-05 20:12:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,恐吓,facial,学生", "title": "迈阿密大学使用面部识别来恐吓抗议者", "title_en": "U of Miami uses facial recognition to intimidate protestors", "transed": 1, "url": "https://fightfortheftr.medium.com/the-university-of-miami-claims-they-didnt-use-facial-recognition-to-intimidate-student-protesters-9a4f4b334dda", "via": "", "real_tags": ["大学", "恐吓", "facial", "学生"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033286, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您可以在浏览器中尝试使用typedef！Try.typedes.com现有的工具(Protobuf、Thrift)缺乏代数结构，在更有原则的设置(如证明助手或纯函数式编程语言)中使用时可能会引起摩擦。\n这个项目即将投入使用。我们正在努力提供文档、工具和目标语言支持。\n从长远来看，我们设想的是一个内容可寻址的类型库，可以在所有编程语言中使用，甚至可以在其他编程语言中使用。\n或者在giHub/typedef上查看我们的代码。在推特上关注@statebox，随时关注最新消息。", "note_en": "You can try typedefs in your browser!   try.typedefs.com  Existing tools ( protobuf,  thrift) lack algebraic structure and may cause friction when used in more principled settings such as  proof assistants or  purely functional programming languages.\n   This project is close to being usable. We are working hard on documentation, tooling and target language support.\n In the long term, we envision a content addressable repository of types, usable in all programming languages and beyond.\n   Or check out our code on  github/typedefs. Follow   @statebox on twitter to stay up to date.", "posttime": "2020-11-05 20:12:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "typedefs", "title": "Typedefs", "title_en": "Typedefs", "transed": 1, "url": "https://typedefs.com/", "via": "", "real_tags": ["typedefs"]}, {"category": "", "categoryclass": "", "imagename": "1ebaed220f298ad954b6b1831048724c.png", "infoid": 1033285, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2017年，我们推出了Amazon MQ-面向Apache ActiveMQ的托管消息代理服务，这是一个流行的开源消息代理，速度快，功能丰富。它提供队列和主题、持久和非持久订阅、基于推送和基于投票的消息传递以及过滤。借助Amazon MQ，我们通过客户反馈增强了许多新功能，以提高高可扩展性和可用性，例如垂直扩展和具有99.9%服务级别协议(SLA)的吞吐量优化消息代理，以支持LDAP身份验证和授权，并在美国商业区构建合规应用程序，如HIPAA、ISO/PCI DSS、SOC和FIPS 140-2验证的终端。\n不仅是ActiveMQ，RabbitMQ也是最流行的开源消息代理之一，也是大宗商品交易和订单处理软件等分布式应用程序的关键组件。一些客户选择RabbitMQ是因为它的功能丰富、活跃的社区支持以及广泛的支持客户端和框架。但是，RabbitMQ消息代理需要在创建和修补复杂集群部署所需的专业知识方面进行大量投资。那些愿意更换经纪人并转向托管服务的公司，不得不花费数周时间来更换他们的应用程序。\n今天，我们推出了Amazon MQ for RabbitMQ，这是一项托管消息服务，可以降低管理RabbitMQ消息代理的公司的运营开销。数以千计的客户已经使用Amazon MQ来降低其消息传递基础设施的运营开销。通过添加RabbitMQ来扩展Amazon MQ应用程序兼容性，使更多公司从部署、扩展和操作消息代理的复杂性中解脱出来。\n您可以继续使用首选代理，并拥有经济高效的可扩展报文传送功能，同时降低运营开销。Amazon MQ管理设置单个消息代理和群集消息代理所涉及的工作：从配置基础设施容量到安装消息传递软件。一旦启动并运行，Amazon MQ就会处理诸如修补操作系统和消息传递软件等管理任务。\nAmazon MQ for RabbitMQ-开始创建新的RabbitMQ消息代理，您可以单击Amazon MQ控制台中的Get Started按钮，然后选择代理引擎，ActiveMQ或RabbitMQ提供对AMQP 0.9.1协议的本地支持，并为各种平台(包括Ruby、Python、Node.js、.NET等)提供客户端库。\n下一步，选择RabbitMQ的部署模式。单代理部署将在一个可用区中有一个代理实例，集群部署将有一个由三个节点组成的逻辑分组，每个节点共享一个分布式状态、用户和队列。在群集部署中，数据跨多个可用区冗余存储，以提供消息持久性。\nRabbitMQ集群支持传统的队列镜像，适用于需要高可用性的用例。镜像队列跨多个节点复制消息。如果托管队列的主节点出现故障，镜像节点将升级到主节点，从而实现不间断的可用性。\n在下一步中，输入代理名称并选择实例类型。对于具有单实例代理部署的Free Tier，您可以选择mq.t3.Micro进行基本评估。输入用户名和密码以访问RabbitMQ Web控制台。\n对于其他设置，您可以选择代理引擎版本，启用CloudWatch日志以将代理日志发布到Amazon CloudWatch，并将访问类型设置为虚拟私有云(VPC)外部或仅在VPC内。如果您选择私有访问，您可以分配vPC/子网以附加您的EC2实例和安全组，以定义授权来自需要访问您的Broker实例的所有EC2实例和设备的连接的规则。\n单击Next(下一步)并检查您的设置，然后单击Create Broker(创建代理)按钮，您的代理将在5-10分钟内创建完毕并可供使用。\n您可以通过一个简单的AWS命令行界面(CLI)命令为群集部署创建RabbitMQ代理：\n$AWS MQ Create-Broker--Broker-name myRabbitCluster\\\r--部署模式CLUSTER_MULTI_AZ\\\r--引擎型Rabbitmq\\\r--引擎-版本3.8.6\\\r--主机实例类型mq.m5.Large\\\r--公开访问\\\r--用户ConsoleAccess=true，用户名=admin，密码=str0nGpass@#，组=admin。\n创建新代理后，您用来访问代理的Web控制台URL和端点只需单击一下即可访问：\n您可以通过提供的链接访问RabbitMQ Web控制台。我只是使用Pika Python客户端测试了这个代理：\n代理将实例、主题和队列指标发布到CloudWatch。要了解更多信息，请阅读Amazon MQ for Rabbit MQ开发人员指南。\n现在就有！Amazon MQ for RabbitMQ现已推出，您可以在Amazon MQ当前所在的所有地区开始使用它。有关详细信息，请参阅产品页面、定价和。请在Amazon MQ的AWS论坛或通过AWS支持或您的客户团队向我们发送反馈。", "note_en": "In 2017, we  launched  Amazon MQ – a managed message broker service for  Apache ActiveMQ, a popular open-source message broker that is fast and feature-rich. It offers queues and topics, durable and non-durable subscriptions, push-based and poll-based messaging, and filtering. With Amazon MQ, we have enhanced lots of new features by customer feedback to improve high scalability and availability such as  vertical scaling and  throughput-optimized message brokers with   99.9% Service Level Agreement (SLA), to support   LDAP Authentication and Authorization, and to build compliant applications such as   HIPAA,  ISO/PCI DSS,  SOC, and  FIPS 140-2 validated endpoints in US Commercial Regions.\n  Not only ActiveMQ, but  RabbitMQ is also one of the most popular open source message brokers and a critical component of distributed applications, like commodities trading and order processing software. Some customers choose RabbitMQ for its feature richness, active community support, and broad range of supported clients and frameworks. However, RabbitMQ message brokers require significant investment in the expertise needed for creating and patching complex clustered deployments. Companies willing to change to a different broker, and to migrate to a managed service, had to invest weeks in changing their application.\n  Today, we are launching  Amazon MQ for RabbitMQ, a managed messaging service that reduces the operational overhead for companies managing RabbitMQ message brokers. Thousands of customers have already used Amazon MQ to reduce the operational overhead for their messaging infrastructure. Expanding Amazon MQ application compatibility by adding RabbitMQ frees more companies from the complexity of deploying, scaling, and operating message brokers.\n  You can continue to use your preferred broker and have cost-efficient scalable messaging capacity with reduced operational overhead. Amazon MQ manages the work involved in setting up both individual and clustered message brokers: from provisioning the infrastructure capacity to installing the messaging software. Once it is up and running, Amazon MQ handles administrative tasks such as patching the operating system and messaging software.\n  Amazon MQ for RabbitMQ – Getting Started  To create new RabbitMQ message brokers, you can click the  Get started button in  Amazon MQ console and select a broker engine, either ActiveMQ or RabbitMQ that offers native support for the AMQP 0.9.1 protocol with client libraries for a variety of platforms, including Ruby, Python, Node.js, .NET, and more.\n    In the next step, select a deployment mode of RabbitMQ. Single-broker deployment will have one broker instance in one Availability Zone, Cluster deployment will have a logical grouping of three nodes, each sharing a distributed state, users, and queues. In a cluster deployment, data is stored redundantly across multiple Availability Zones to provide message durability.\n  RabbitMQ clusters support classic queue mirroring for use cases that require high availability. Mirrored queues replicate messages across multiple nodes. If the main node that hosts a queue fails, a mirror node is promoted to the main node, resulting in uninterrupted availability.\n    In the next step, enter a Broker name and choose the instance type. You can select  mq.t3.micro for basic evaluations eligible for the  Free Tier with a single-instance broker deployment. Enter  Username and  Password to access RabbitMQ web console.\n    For your additional setting, you can choose a broker engine version, enable CloudWatch Logs to publish the broker’s logs to  Amazon CloudWatch, and set the access type to outside  Virtual Private Cloud (VPC) or only within VPC. If you select Private access, you can assign VPC/Subnet(s) to attach your EC2 instances and Security group(s) to define the rules that authorize connections from all EC2 instances and devices that require access to your broker instance.\n    Click  Next and review your setting and click  Create broker button, which your broker will be created and ready to use in 5-10 minutes.\n    You can create a RabbitMQ broker via a simple command of  AWS Command Line Interface (CLI) for the cluster deployment:\n  $ aws mq create-broker --broker-name myRabbitCluster \\\r --deployment-mode CLUSTER_MULTI_AZ \\\r --engine-type rabbitmq \\\r --engine-version 3.8.6 \\\r --host-instance-type mq.m5.large \\ \r --publicly-accessible \\\r --users ConsoleAccess=true,Username=admin,Password=str0nGpass@#,Groups=admin\n  Once your new broker was created, the web console URL and endpoints that you use to access your broker are all available at a click:\n    You can access the RabbitMQ web console at the link provided. I simply tested this broker using the  Pika Python client:\n    The broker publishes instance, topic, and queue metrics to CloudWatch. To learn more, read the  Amazon MQ for Rabbit MQ Developer Guide.\n  Available Now!   Amazon MQ for RabbitMQ is available now and you can start using it in all regions Amazon MQ is currently available in. For more information, refer to the  product page, its  pricing, and  . Please send us feedback either in the  AWS forum for Amazon MQ or through AWS support, or your account team.", "posttime": "2020-11-05 20:12:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,消息,launches,代理", "title": "亚马逊推出新的RabbitMQ消息中介服务", "title_en": "Amazon Launches New RabbitMQ Message Broker Service", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/amazon-mq-update-new-rabbitmq-message-broker-service/", "via": "", "real_tags": ["amazon", "亚马逊", "消息", "launches", "代理"]}, {"category": "", "categoryclass": "", "imagename": "f1a12f91084d2eaea2a83841a48f07f8.jpg", "infoid": 1033284, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项针对24名患有严重抑郁症的成年人的新研究发现，两剂迷幻物质裸盖菇素配合支持性心理治疗，可迅速大幅减轻抑郁症状。大多数参与者都有改善，在四周的随访中有一半的人取得了缓解。裸盖菇素是一种在所谓的“神奇蘑菇”中发现的化合物。它会在几个小时内产生视觉和听觉幻觉，以及意识的深刻变化。这一发现发表在11月4日的《美国医学会精神病学》杂志上。约翰霍普金斯大学的合著者艾伦·戴维斯(Alan Davis)说：“我们看到的效果比市场上传统抗抑郁药的临床试验显示的要大四倍。”正如这篇论文所解释的那样，“这项研究中报告的效应大小大约是心理治疗中发现的效应大小的2.5倍，比心理药理学抑郁症治疗研究中发现的效应大小大4倍以上。”戴维斯说，因为大多数其他抑郁症治疗方法需要几周或几个月的时间才能奏效，而且可能会产生不良影响，如果这些发现在未来的临床试验中站得住脚，这可能会改变游戏规则。与传统的抗抑郁药物相比，裸盖菇素的副作用更为有限。这些症状包括轻度到中度头痛，以及治疗期间的“挑战性情绪”。另一方面，抗抑郁药物有更深远的副作用。这些症状包括自杀念头、性欲下降和体重增加。此外，裸盖菇素治疗只需一次或两次给药即可见效。这是与通常需要每日服用的常用抗抑郁药相比的另一个优势。在这项新的研究中，研究人员招募了24名有长期抑郁症史的人。大多数参与者在参加这项研究之前都经历了大约两年的症状。参与者在研究人员的监督下，接受了两次5小时的裸盖菇素治疗。参与者的平均年龄为39岁。其中16人是女性。22名被确认为白人，一名被确认为亚洲人，一名被确认为非裔美国人。在研究之前，参与者必须逐渐减少任何抗抑郁药物。他们在私人医生的帮助下做到了这一点，以确保安全地接触到这种实验性的治疗方法。治疗包括由两名监测员给予两剂裸盖菇素，他们提供指导和安慰。这些剂量在2017年8月至2019年4月之间相隔两周服用。每次治疗持续约5个小时。参与者躺在沙发上，戴着眼罩，戴着播放音乐的耳机，在监视器面前。所有参与者在注册时都完成了GRID-汉密尔顿抑郁量表(GRID-Hamilton Depression Scale)。他们在治疗结束后的一周和四周也做了同样的评估。得分在24或更高的人表示严重抑郁。17-23分表示中度抑郁，8-16分表示轻度抑郁，7分或更低表示无抑郁。在注册时，参与者的平均抑郁量表评分为23分。但在治疗后一周和四周，他们的平均抑郁量表得分为8分。治疗后，大多数参与者的症状都有了实质性的改善。同样，在为期四周的随访中，几乎一半的人从抑郁中得到缓解。在24名参与者中，67%的人在一周的随访中抑郁症状减少了50%以上，四周的随访中有71%的人表现出抑郁症状的减少。总体而言，治疗后四周，54%的参与者被认为是缓解期，这意味着他们不再有抑郁的资格。与另一种最近被发现可以缓解抑郁的精神活性物质氯胺酮相比，裸盖菇素有几个优点。裸盖菇素的抗抑郁作用似乎持续时间更长。裸盖菇素与氯胺酮相比，成瘾和不良反应的可能性也更低。研究人员说，他们将在研究结束后对参与者进行为期一年的跟踪调查，看看裸盖菇素治疗的抗抑郁效果能持续多久。他们将在以后的出版物中报告这些新发现。2016年，约翰·霍普金斯医学院的研究人员首次报道，在心理支持的条件下使用裸盖菇素治疗，显著缓解了被诊断为严重威胁生命的癌症患者的生存性焦虑和抑郁。根据美国国家心理健康研究所(National Institute Of Mental Health)的数据，美国有超过1700万人，全世界有3亿人经历过严重的抑郁症。企业家兼慈善家蒂姆·费里斯(Tim Ferriss)支持这项研究的筹资活动。他说：“我相信这项研究是医学上批准裸盖菇素治疗抑郁症的一个极其重要的概念证明，我个人几十年来一直在与这种疾病作斗争。”“我们如何解释令人难以置信的麦格尼", "note_en": "A  new study of 24 adults with major depression finds that two doses of the psychedelic substance psilocybin, given with supportive psychotherapy, produced rapid and large reductions in depressive symptoms. Most of the participants showed improvement, and half achieved remission at the four-week follow-up.    Psilocybin is a compound found in so-called “magic mushrooms.” It produces visual and auditory hallucinations, and profound changes in consciousness, over a period of several hours. The findings appeared on November 4 in   JAMA Psychiatry.  “The magnitude of the effect we saw was about four times larger than what clinical trials have shown for traditional antidepressants on the market,” said co-author  Alan Davis of Johns Hopkins University. As the paper explains, “the effect sizes reported in this study were approximately 2.5 times greater than the effect sizes found in psychotherapy, and more than 4 times greater than the effect sizes found in psycho-pharmacological depression treatment studies.”    “Because most other depression treatments take weeks or months to work and may have undesirable effects, this could be a game changer if these findings hold up” in future clinical trials,” Davis said. And compared to traditional antidepressants, the side effects of psilocybin are more limited. These include mild-to-moderate headaches, and “challenging emotions” during the sessions. Antidepressant medications, on the other hand, have more far-reaching side effects. These include  suicidal ideation, decrease in sexual drive, and weight gain. Furthermore, the effectiveness of psilocybin  therapy appears after only one or two administrations. This represents another advantage over commonly used antidepressants, which typically require daily administration.  For the new study, the researchers recruited 24 people with a long-term history of depression. Most of the participants had experienced symptoms for about two years before enrolling in the study.     The participants underwent two five-hour psilocybin sessions, under the supervision of the researchers. The average age of participants was 39. Sixteen were women. Twenty-two identified as white, one identified as Asian, and one identified as African American. Participants had to taper off any antidepressants prior to the study. They did so with the help of their personal physician, to ensure safe exposure to this experimental treatment. Treatment consisted of two psilocybin doses given by two monitors who provided guidance and reassurance. The doses were given two weeks apart, between August 2017 and April 2019. Each treatment session lasted about five hours. The participants lay on a couch wearing eyeshades and headphones that played music, in the presence of the monitors.  All participants completed the  GRID-Hamilton Depression Rating Scale upon enrollment. They also did this same assessment at one and four weeks following completion of their treatment. A score of 24 or more indicates severe depression. A score of 17-23 means moderate depression, 8-16 mild depression, and 7 or less no depression. At enrollment, participants had an average depression scale rating of 23. But at one week and four weeks after treatment, they had an average depression scale score of 8. After treatment, most participants showed a substantial decrease in their symptoms. Likewise, almost half were in remission from depression at the four-week follow-up. For the entire group of 24 participants, 67% showed a more than 50% reduction in depression symptoms at the one-week follow-up, and 71% at the four-week follow-up. Overall, four weeks post-treatment, 54% of participants were considered in remission, meaning they no longer qualified as being depressed. Compared to ketamine, another psychoactive substance that has  recently been found to alleviate depression, psilocybin has several advantages. The antidepressant effects of psilocybin seem to last longer. Psilocybin also has a lower potential for addiction and adverse events than ketamine.  The researchers say they will follow the participants for a year after the study to see how long the antidepressant effects of the psilocybin treatment last. They will report these new findings in a later publication. In 2016, Johns Hopkins Medicine researchers first reported that treatment with psilocybin under psychologically supported conditions significantly relieved existential anxiety and depression in people with a  life-threatening cancer diagnosis. According to the National Institute of Mental Health, more than 17 million people in the U.S., and 300 million people worldwide, have experienced major  depression. Entrepreneur and philanthropist  Tim Ferriss supported the funding campaign for this study. “I believe this study to be a critically important proof of concept for the medical approval of psilocybin for treatment of depression, a condition I have personally struggled with for decades,” he said. “How do we explain the incredible magnitude and durability of effects? Treatment research with moderate to high doses of psychedelics may uncover entirely new paradigms for understanding and improving mood and mind,” Ferriss said.  Study: “ Effects of Psilocybin-Assisted Therapy on Major Depressive Disorder: A Randomized Clinical Trial“  Authors: Alan K. Davis, Frederick S. Barrett, Darrick G. May, Mary P. Cosimano, Nathan D. Sepeda, Matthew W. Johnson, Patrick H. Finan, and Roland R. Griffiths  Published in:   JAMA Psychiatry  Publication date: November 4, 2020  DOI: doi:10.1001/jamapsychiatry.2020.3285  Photo: by  James Bak via  Unsplash  For a weekly summary of the latest psychology news, subscribe to our  Psych News Weekly newsletter.", "posttime": "2020-11-05 20:11:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "研究,finds,治疗", "title": "一项新的研究发现裸盖菇素能显著且迅速地缓解抑郁症", "title_en": "New study finds psilocybin greatly and quickly relieves depression", "transed": 1, "url": "https://www.psychnewsdaily.com/new-study-psilocybin-magic-mushrooms-relieves-depression/", "via": "", "real_tags": ["研究", "finds", "治疗"]}, {"category": "", "categoryclass": "", "imagename": "c13477f6896e3f061f40791358604777.png", "infoid": 1033283, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Singulity是一个开源容器平台，旨在简单、快速和安全。奇点针对专注于计算的企业和HPC工作负载进行了优化，允许不受信任的用户在可信任方式中运行不受信任的容器。\n系统管理员可以在管理员指南中了解如何配置奇点，并获得其体系结构和安全功能的概述。\n社区的贡献总是受到极大的赞赏。要开始开发奇点，请查看投稿指南。\n库尔策·GM，Sochat V，Bauer MW(2017)奇点：计算移动性的科学容器。PLOS One 12(5)：e0177459。Https://doi.org/10.1371/journal.pone.0177459。\n这是一个所有版本的DOI。点击Zenodo链接，获取特定版本奇点的DOI。\n除非另有说明，本项目是根据许可文件中的3条BSD许可进行许可的。", "note_en": "Singularity is an open source container platform designed to be simple, fast,and secure. Singularity is optimized for compute focused enterprise and HPCworkloads, allowing untrusted users to run untrusted containers in a trustedway.\n    System administrators can learn how to configure Singularity, and get anoverview of its architecture and security features in the  administratorguide.\n   Community contributions are always greatly appreciated. To start developingSingularity, check out the  guidelines for contributing.\n      Kurtzer GM, Sochat V, Bauer MW (2017) Singularity: Scientific containers for mobility of compute. PLoS ONE 12(5): e0177459. https://doi.org/10.1371/journal.pone.0177459\n    This is an &#39;all versions&#39; DOI. Follow the link to Zenodo to obtain a DOI specificto a particular version of Singularity.\n  Unless otherwise noted, this project is licensed under a 3-clause BSD licensefound in the  license file.", "posttime": "2020-11-05 20:11:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,容器,open,奇点", "title": "奇点--一个开源的简单、快速、安全的容器平台", "title_en": "Singularity – an open source simple, fast, and secure container platform", "transed": 1, "url": "https://github.com/hpcng/singularity", "via": "", "real_tags": ["开源", "容器", "open", "奇点"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033281, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "管理程序内存自省(HVMI)依赖于分析内存访问以确定它们是否合法。例如，通过分析旧的存储值和新存储的值，HVMI可以决定是否允许修改。然而，这带来了需要对修改受保护内存的每条指令进行深入分析的复杂性。与RISC体系结构不同，x86有大量的指令可以通过复杂的读-修改-写(RMW)方式访问存储器，并使用复杂的寻址方案。为了简化指令解码和分析，我们创建了一个专用的x86指令解码器，能够提供完整的指令信息，从而减轻了HVMI模块对x86指令格式的需要。这篇博客文章将详细介绍一些bddisasm内部机制，以及如何使用它，同时强调为什么它是HVMI的关键部分。此外，我们还将介绍x86指令编码的一些特殊性。主要的bddisasm项目位于此处，可以在此处访问文档。\nBddisasm是一个用C编写的独立库，使用一些Python生成内部解码表。该库构建得很快，同时提供尽可能多的关于已解码指令的信息-这一点很重要，因为其他使用bddisasm的项目可以依赖它来提供关于指令的完整而准确的信息。在考虑其他解码库时，只有一些功能相似：\nIntel Xed是由Intel编写和维护的，因此以某种方式使其成为标准的x86解码器；虽然它不是最快的，但它提供了关于解码指令的丰富信息；\nZydis，就功能而言可以与Xed相媲美，而且轻量级(然而，在内部创建bddisasm时，Zydis还不存在)；\n用其他语言(如Rust或C#)编写的其他解码器或反汇编程序(只提供指令的文本输出，而不提供实际解码的指令信息)不被考虑。考虑到当时Xed和Capstone似乎很难合作，我们决定创建自己的轻量级解码器，考虑到以下目标：\n轻量级-完全用C语言编写，没有外部依赖，没有分配内存，设计上是线程安全的；\n速度--虽然我们需要一个能够提供尽可能多的指令信息的解码器，但我们仍然认为速度是一个重要因素；\n弹性-解码器应该能够处理各种格式错误的指令，以及包含冗余前缀或非典型编码的有效指令；\n完整-解码器必须支持所有现有的x86指令，包括AVX；此外，扩展对新指令的支持应该尽可能简单；\n易于使用-单头文件，单API库，它提供了输出解码指令中所有可能的信息，而不需要调用额外的函数来从解码指令中提取信息；\n我们不会对bddisasm和其他解码库进行比较，我们将把这篇博客的重点放在如何使用bddisasm以及它在HVMI中的用处。\n使用解码库很容易：包括bddisasm.h头文件，链接到bddisasm.lib(Windows)或libbddisasm.a(Linux)，然后调用解码API！Bddisasm使用单一API解码方案，其中NdDecode API提供一个包含有关指令的所有可能信息的输出INSTRUX结构。INSTRUX结构中唯一没有包括的是指令的文本反汇编，它必须使用NdToText API单独生成。典型的使用场景可能如下所示：\n#INCLUDE&#34；bddisasm/bddisasm.h&#34；int main(){INSTRUX ix；unsign char ins[2]={0x33，0xC0}；NDSTATUS Status；Status=NdDecodeEx(&amp；ix，ins，sizeof(Ins)，ND_CODE_64，ND_DATA_64)；如果(！ND_SUCCESS(状态)){printf(&#34；解码失败，错误0x%08x！\\n&#34；，状态)；return-1；}printf(&#34；解码的指令长度为%d！\\n&#34；，ix。长度)；}。\n请注意，输出INSTRUX ix结构将包含有关已解码指令的所有信息。有关您可以找到的信息类型的综合列表：\n重复解码的前缀信息，例如指令是否使用锁定，是否启用xAcquisition/xRelease或跟踪CET；\n长度信息，包括关于指令本身和指令的不同字段的信息，例如立即字段或移位；\n关于指令的每个构成字段的偏移量信息(指令中每个字段的位置)；\nCPUID特征标志，其指示必须查询的叶和子叶，以及指示对该特定指令的支持的寄存器和位；\n操作数信息，包括：操作数类型、大小、访问(读、条件读、写、条件写)和详细信息；\n全内存操作数详细信息：段、基数、索引、小数位数、压缩位移、堆栈、字符串、位库、VSIB等)；\n关于如何从INSTRUX中提取不同类型的信息的例子可以在官方文档页面上找到。\n使用NdToText函数，可以将解码的INSTRUX转换为可以打印的文本反汇编。NdToText函数仅支持英特尔风格的语法，因此以下指令33C0将被解码为XOR eax，eax，而4833C0将被解码为XOR rax，rax。NdToText函数的典型用法是：\n//为该指令创建文本反汇编。字符文本[ND_MIN_BUF_SIZE]；NdToText(&amp；ix，0，sizeof(Text)，text)；printf(&#34；说明：%s\\n&#34；，text)；\n分流是HVMI技术的关键部分。如前所述，解码和分析指令非常重要，因为HVMI处理的绝大多数事件都违反了EPT(内存引用指令)。\n当EPT违规发生时，HVMI做的第一件事就是对违规指令进行解码。由于访问客户内存通常很慢(因为它涉及将客户线性地址转换为客户物理地址，并映射进程中的每个物理页面-页表和实际页面)，因此一旦指令被解码，它就会被内部缓存。来自同一指令指针的后续访问将产生已解码的高速缓存指令，从而加速这一过程(当然，高速缓存指令还意味着必须监视包含它们的页的修改，以便在指令被修改时使高速缓存无效)。\n一旦指令被解码，HVMI将对其进行剖析，以确定所访问的每个存储器位置。这一点很重要，因为一条指令可以直接或间接访问多个内存位置，在允许指令继续之前，我们必须分析每次访问。因为bddisasm提供了完整的操作数信息(包括隐式操作数)，所以HVMI基本上会遍历所有指令操作数，并检查它们是否为内存。然后，对于每个内存操作数，它将确保它访问不受HVMI监视的内存区域。访问多个地址的指令示例可能包括：\n调用[mem]-它读取[mem]操作数，并写入堆栈；如果启用了CET影子堆栈，它还可以访问影子堆栈；\n使用VSIB寻址的AVX指令-多个地址可由VSIB操作数访问，例如[rax+xmm0*8]；\n还有一些事件(主要是异步事件)可能会导致EPT冲突，即使当前指令不执行任何类型的内存访问也是如此；此类事件包括：\n发送中断或异常，该中断或异常将读取中断描述符表(IDT)，并将中断帧写入堆栈；\n作为任务切换或中断传送的一部分的任务状态段(TSS)内的访问；\n页表内的访问，作为页面遍历的一部分(尽管这些访问是使用VMCS EPT违规退出资格内的专用位明确表示的)；\n这些类型的事件不包括在INSTRUX结构中，因为它们可能在正常指令执行期间以异步方式发生。\n一旦错误指令被解码，Introcore内部的多个模块就会对其进行分析，以确定它是否为合法修改(这与提取的其他类型的信息一起使用，例如指令属于哪个模块)。典型的验证是将旧内存值与即将存储的新值进行比较-如果它们相同，则允许指令执行通常是安全的。提取旧值可以通过对指令进行简单的模拟来完成-因为bddisasm已经提供了所有必要的信息，所以可以相当容易地计算出新值(而且由于这不是一个全面的模拟，所以在这一点上不需要进行检查)。\n对访问内存的指令执行的另一个常见任务是计算显式内存操作数访问的客户线性地址。对于典型的modrm编码内存操作数，计算该值所需的步骤包括：\n查询段寄存器，并获取寻址中使用的段的基址；所得到的线性地址可以被初始化为该段基值，或者不使用段的0；\n如果内存操作数是直接的(例如在A01111111111111111中，其解码为MOVAL，字节PTR[0x11111111111111])，则可以将地址添加到线性地址，并且不需要进一步处理；\n如果内存操作数使用基址寄存器，则将其值与线性地址相加；\n如果内存操作数使用索引寄存器，则对其进行缩放并将其添加到线性地址；\n如果内存操作是RIP相关的，则添加当前指令的长度，后跟当前RIP；\n如果内存操作数使用位基寻址(BT、BTS、BTR、BTC指令)，则计算源操作数的位偏移量，并将其与结果线性地址相加；\n如果操作是堆栈推送，则从得到的线性地址减去堆栈操作的大小；\n上面列出的步骤将产生指令操作数使用的线性地址，可以对其进行进一步处理以提取更多信息。\nBddisasm是以可扩展的方式创建的，这使得添加新指令变得微不足道，只要它们不使用新的编码方案或新的寄存器。说明数据库包含在bddisasm repo的isagenerator/Instructions项目内的几个.dat文件中。虽然自述文件中已经提供了关于该项目的足够信息，但我们将只演示如何向bddisasm添加新的说明。\n让我们首先选择一个当前没有被任何指令0F04使用的编码(尽管应该注意，它是由LoadAll在286上使用的)。如果我们尝试解码此指令，我们将看到bddisasm失败：\n查看disasmstatus.h内部，我们看到错误代码0x80000002表示ND_STATUS_INVALID_ENCODING-因此没有有效的编码，这很好，因为我们想创建自己的编码。\n现在让我们假设我们要创建的指令是一个简单的模编码指令，有两个操作数-第一个是通用寄存器，第二个是通用寄存器或内存。让我们将此指令称为BDDISASM，让我们看看几种可能的形式：\n如前所述，该指令的操作码将是(当前未分配的)0F04。第一个操作数将是16位、32位或64位通用寄存器，具体取决于操作数大小。第二个操作数将是16、32或64位通用寄存器或内存位置，具体取决于modrm.mod和操作数大小。第一个操作数是读写的，而第二个操作数是只读的。没有隐式操作数。现在我们可以在TABLE_0F.dat中描述基本指令：\n第二个元素GV表示第一个操作数是以modrm.reg(G)编码的通用寄存器，其大小取决于操作数大小(V)，大小为16、32或64位；\n第三个元素ev表示第二操作数是以modrm.rm(E)编码的通用寄存器或存储器，其大小取决于操作数大小(V)，大小为16、32或64位；\n下一个元素描述指令访问的隐式操作数；因为我们没有任何操作数，所以我们指定为nil；\n下一个元素是最重要的，它描述了编码；它列举了所有操作码字节-0F和04，后跟/r，表明指令使用modrm编码；\n最后一个元素是每个指令操作数的访问映射，并使用关键字w：指定。第一个操作数是读写(RW)，而第二个操作数是读(R)。\n现在，让我们通过在VisualStudio中构建isagenerator项目，或者运行make，然后重建bddisasm库和disasmtool来重建解码树。现在让我们再次尝试对指令进行解码：\n现在我们得到一个不同的错误：0x80000001，表示ND_STATUS_BUFFER_TOO_SMALL-这表明存在用于此编码的有效指令，但我们没有提供足够的字节来解码它。事实上，我们没有这样做，因为我们只指定了操作码，而没有modrm字节。让我们再试一次，这次也使用modrm字节：\n如您所见，指令已被成功解码！使用不同的编码会产生预期的指令：\nC：\\&gt；disasm-b64-h 0F0400660F0400480F0400670F0400F30F04000000000000000000 0f0400 BDDISASM eax，双字PTR[rax]0000000000000003 660f0400 BDDISASM ax，word PTr[rax]0000000000000007 480f0400 BDDISASM rax，qword PTR[rax]000000000000000B 670f0400 BDDISASM eax，dword PTR[eax]000000000000000F f30f0400 BAX。\n如果我们愿意，我们可以在我们的指导中添加更多的信息。例如，我们现在可以假设指令修改了标志-它总是设置进位标志(CF)。为了指定这一点，我们必须首先指示指令使用隐式操作数fv，它代表标志寄存器，然后我们必须使用f：关键字告诉它它修改了哪些标志：\nC：\\&gt；Disasm-b64-h 0F0400-exi0000000000000000 0f0400 BDDISASM eax，双字PTR[rax]DSIZE：32，ASIZE：64，Vlen：-ISA Set：UNKNOWN，INS CAT：UNKNOWN，CET TRACKED：无标志访问CF：1，有效模式R0：YES，R1：YES，R2：YES，R3：YES REAL：YES，V8086：YES，PROT：YES，COMPAT：YES，VMX OFF：YES有效前缀rep：no，REPcc：no，lock：no，HLE：no，仅XACQUIRE：no，仅XRELEASE：no BND：no，BHINT：no，DNT：no Operand：0，ACC：RW，Type：Register，Size：4，RawSize：4，Ending：R，RegType：General Purpose，RegSize：4，RegID：0，RegCount：1 Operand：1。原始大小：4，编码：s，RegType：标志，RegSize：4，RegID：0，RegCount：1。\n您可以看到，在标志访问部分中列出了CF：1，这意味着它始终设置为1。标志的其他可能值包括m(表示根据结果修改标志)、0(表示标志已清除)、t(表示标志已测试)和u(表示标志未定义)。标志访问部分中缺失的标志根本不会被触及。\n最后，让我们讨论一下在处理指令编码时一些不太为人所知的情况。当然，所有这些信息都有文档记录，但在SDM中查找这些信息可能需要一些时间，因此以下是最相关信息的快速列表：\n可以对看似有效的指令进行编码，这些指令的长度超过15字节的最大限制，但CPU无论如何都会在这些指令上生成#GP；\nREX前缀必须始终是操作码字节之前的最后一个字节，否则将被忽略：48F333C0将解码为XOR eax，eax，而不是XOR rax，rax，因为F3前缀在REX 48前缀之后；\n如果指令中同时存在F2和F3前缀，则CPU将考虑最后出现的前缀：F2F2F2F3A6将解码为REPZ cmpsb，因为F3是最后出现的前缀，并且所有的F2前缀都将被忽略；\n同样，考虑最后出现的段前缀，但请注意，在64位模式下，只接受fs和gs覆盖：65642e2e3300将在32位模式下解码为XOR eax，dword PTR cs：[EAX]，但在64位模式下，它将解码为xor eax，dword PTR fs：[rax]；\n被忽略和冗余的前缀是指令的一部分，因此它们被计入指令长度：F2F2F2F2F2F2F2F2F2F2F2F2F2F290作为NOP被解码和执行，但是再增加一个F2前缀将使指令16字节长，从而产生#GP，并导致解码错误；\nRSP不能用作SIB寻址的索引，它将被忽略：3304E0将解码为XOR eax，dword PTR[rax]而不是xor eax，dword ptr[rax+rsp*8]；\n在64位模式下使用modrm.mod==0(内存)和modrm.rm==5(RBP)时，将使用RIP相对寻址而不是直接寻址；但是，通过使用带有modrm.mod==0(内存)、modrm.rm==4(RSP、SIB)、SIB.base==5(RBP)和SIB.index==4(RSP)的SIB寻址，即使使用SIB寻址，也可以直接寻址到绝对32位地址。\n在64位模式下，堆栈操作默认使用64位操作数(即使没有REX.W前缀)；然而，这意味着使用32位操作数编码PUSH/POP是不可能的，尽管您仍然可以使用16位操作数编码PUSH/POP：6650即使在64位模式下也将解码为PUSH AX，无法编码PUSH EAX；\n在64位模式下，在Intel CPU上，间接分支总是使用64位操作数：FF20、48FF20、66FF20都将在64位模式下解码为JMP qword PTR[rax]；\n移入/移出控制/调试寄存器将始终使用modrm.mod==3，即使实际modrm.mod为0、1或2：0F2000将解码为mov rax，CR0，而不是mov[rax]，cr0；\n移入/移出modrm.mod==1或modrm.mod==2的控制/调试寄存器(带位移)，将忽略位移：0F2040将解码为mov rax，CR0，即使正常情况下modrm.mod==1需要1个字节的位移；\n在AMD上，可以使用带mov cr指令的锁定前缀F0来访问cr8寄存器：F00F22C0解码为mov cr8，eax；\n在这篇博客文章中，我们展示了一个全面的、编写良好的指令解码器如何在处理指令时极大地改善开发人员的生活。当然，bddisasm是HVMI的一个非常重要的部分，因为很多自省逻辑都围绕着分析指令，并且可以选择使用简单、快速和准确的解码器来实现这一点，从而极大地提高了代码质量。\n我们将在未来的一篇博客文章中看到bddisasm如何帮助创建简单的指令模拟器，届时我们将深入研究另一个重要的项目-BitDefender Shellcode Emulator-bdshemu。", "note_en": "Hypervisor Memory Introspection (HVMI) relies on analyzing memory accesses in order to determine whether they are legitimate or not. For example, by analyzing the old memory value and the newly stored value, HVMI can decide whether to allow the modification or not. This, however, introduces the complication of needing to do an in-depth analysis of each instruction that modifies protected memory. Unlike a RISC architecture, x86 has a large number of instructions that may access memory in a complicated, read-modify-write (RMW) manner, and using complicated addressing schemes.In order to simplify instruction decoding and analysis, a dedicated x86 instruction decoder has been created, capable of providing full instruction information, and thus alleviating the HVMI module from needing to know x86 instructions format. This blog post will detail some bddisasm internals, how to work with it, while highlighting why it is a critical part of HVMI. In addition, we will go through some particularities of x86 instruction encoding. The main bddisasm project is located  here, and the documentation can be accessed  here.\n  bddisasm is a standalone library, written in C, with some Python used for internal decoder-tables generation. The library is built to be fast, while providing as much information about the decoded instructions as possible - this is important, because other projects using bddisasm can rely on it to provide complete and accurate information about instructions. When considering other decoding libraries, there are only some which are similar in features:\n Intel Xed, which is written and maintained by Intel, thus somehow making it the standard x86 decoder; while not the fastest, it provides rich information about the decoded instructions;\n    ZyDis, which is comparable to Xed as far as features go, and lightweight (however, when bddisasm was created internally, ZyDis did not exist yet);\n Other decoders written in other languages, such as Rust or C#, or disassembler (which only provide a textual output of the instruction, without providing actual decoded instruction information) were not considered. Given that Xed and Capstone seemed rather difficult to work with at that time, we decided to create a lightweight decoder of our own, with the following objectives in mind:\n Lightweight - written entirely in C, with no external dependencies, no memory allocated, and thread-safe by design;\n  Fast - while we needed a decoder capable of providing as much information as possible about instructions, we still considered speed an important factor;\n  Resilient - the decoder should be able to handle all kinds of malformed instructions, as well as valid instructions containing redundant prefixes, or encodings which are not typical;\n  Complete - the decoder must support all existing x86 instructions, including AVX; moreover, extending the support to new instructions should be as simple as possible;\n  Easy to work with - single-header file, single-API library, which provides all possible information in the output decoded instruction, without the need to call additional functions in order to extract information from the decoded instruction;\n We will not get into a comparison between bddisasm and other decoding libraries, and we will keep the focus of this blog post on how to work with bddisasm and how useful it is in HVMI.\n  Working with the decoding library is easy: include the  bddisasm.h header file, link with the  bddisasm.lib (Windows) or  libbddisasm.a (Linux), and call the decoding API! bddisasm uses a single-API decoding scheme, where the  NdDecode APIs provide an output  INSTRUX structure containing all the possible information about the instruction. The only thing not included in the  INSTRUX structure is the textual disassembly of the instruction, which has to be generated separately using the  NdToText API. A typical usage scenario might be the following:\n #include &#34;bddisasm/bddisasm.h&#34; int  main () {  INSTRUX  ix ;  unsigned  char  ins [ 2 ]  =  {  0x33 ,  0xC0  };  NDSTATUS  status ;  status  =  NdDecodeEx ( &amp; ix ,  ins ,  sizeof ( ins ),  ND_CODE_64 ,  ND_DATA_64 );  if  ( ! ND_SUCCESS ( status ))  {  printf ( &#34;Decoding failed with error 0x%08x! \\n &#34; ,  status );  return  - 1 ;  }  printf ( &#34;Decoded instruction with length %d! \\n &#34; ,  ix . Length ); }\n  Note that the output  INSTRUX ix structure will contain  all the information about the decoded instruction. A comprehensive list about what kind of information you can find:\n Decoded prefix information, such as whether the instruction uses lock, is repeated, is xacquire/xrelease enabled or CET tracked;\n  Length information, including about the instruction itself and different fields of the instruction, such as immediate fields or displacement;\n  Offset information about each constituent field of the instruction (position of each field inside the instruction);\n            CPUID feature flag, which indicates the leaf and subleaf that must be queried, together with the register and bit which indicates support for that particular instruction;\n          Operand information, including: operand type, size, access (read, conditional read, write, conditional write) and details;\n  Full memory operand details: segment, base, index, scale, compressed displacement, stack, string, bitbase, VSIB, etc.);\n Examples on how different kind if info can be extracted from  INSTRUX can be found on the  official documentation page.\n  Using the  NdToText function, one can convert a decoded  INSTRUX to a textual disassembly that can be printed. The  NdToText function only supports Intel style syntax, so the following instruction  33C0 would be decoded as  XOR eax, eax, and  4833C0 would be decoded as  XOR rax, rax. Typical usage of the  NdToText function is:\n // Create the text disassembly for this instruction.  char  text [ ND_MIN_BUF_SIZE ];  NdToText ( &amp; ix ,  0 ,  sizeof ( text ),  text );  printf ( &#34;Instruction: %s \\n &#34; ,  text );\n  bddisasm is a critical part of the HVMI technology. As mentioned, decoding and analyzing instructions is important, since the vast majority of events HVMI is dealing with are EPT violations (memory-referencing instructions).\n One of the first things HVMI does when an EPT violation takes place is to decode the offending instruction. Since accessing guest memory is usually slow (as it involves translating the guest linear address to a guest physical address, and mapping each physical page in the process - both page-tables and the actual page), once an instruction is decoded, it gets cached internally. Subsequent accesses from the same instruction pointer would yield an already decoded, cached instruction, thus speeding up this process (of course, caching instructions also implies that the pages containing them have to be monitored for modifications, in order to invalidate the cache if an instruction is modified).\n Once the instruction has been decoded, HVMI will dissect it in order to determine each memory location accessed. This is important, because one instruction may directly, or indirectly, access multiple memory locations, and we have to analyze each access before allowing the instruction to continue. Since bddisasm provides full operand information (including implicit operands), HVMI will basically iterate through all the instruction operands, and check if they’re memory. For each memory operand, it would then make sure that it accesses a region of memory that is not monitored by HVMI. Examples of instructions that access multiple addresses might include:\n CALL [mem] - it reads the  [mem] operand, and it writes the stack; it may also access the shadow stack, if CET Shadow Stack is enabled;\n    AVX instruction using VSIB addressing - multiple addresses may be accessed by a VSIB operand such as  [rax+xmm0*8];\n There are also some events (mostly asynchronous) which may cause EPT violations, even if the current instruction does not do any kind of memory access; such events include:\n Delivery of interrupts or exceptions, which will read the Interrupt Descriptor Table (IDT), and will write the interrupt frame on the stack;\n    Access inside the Task State Segment (TSS) as part of a task switch or interrupt delivery;\n  Accesses inside page-tables, as part of page-walks (although these are distinctively indicated using a dedicated bit inside the VMCS EPT violation exit qualification);\n These types of events are not included in the  INSTRUX structure, as they may occur in an asynchronous manner, during normal instruction execution.\n Once the faulting instruction has been decoded, it gets analyzed by multiple modules inside Introcore, in order to determine whether it is a legitimate modification (this is used together with other kinds of information extracted, such as what module the instruction belongs to). A typical validation is comparing the old memory value with the new value that is about to be stored - if they are the same, it is generally safe to allow the instruction to execute. Extracting the old value can be done by doing a simple emulation of the instruction - since bddisasm already provides all the necessary information, the new value can be computed fairly easy (and since this is not a full-blown emulation, there’s no need to do checks at this point).\n Another common task done to instructions which access memory is to compute the guest linear address accessed by an explicit memory operand. For a typical modrm encoded memory operand, steps needed in order to compute this value include:\n Querying the segment registers, and fetching the base of the segment used in the addressing; the resulting linear address can be initialized to this segment-base value, or 0, of no segment is used;\n  If the memory operand is direct (such as in  A01111111111111111, which decodes to  MOV al, byte ptr [0x1111111111111111]), the address can be added to the linear address, and no further processing is needed;\n  If the memory operand uses a base register, add its value to the linear address;\n  If the memory operand uses an index register, scale it and add it to the linear address;\n    If the memory oprand is RIP-relative, add the length of the current instruction, followed by the current RIP;\n  If the memory operand uses bitbase addressing ( BT,  BTS,  BTR,  BTC instructions), compute the bit offset from the source operand, and add it to the resulting linear address;\n  If the operation is a stack push, subtract the size of the stack operation from the resulting linear address;\n The steps listed above will yield the linear address used by the instruction operand, which can be further processed to extract more information.\n  bddisasm has been created in an extensible way, making the addition of new instructions trivial, as long as they don’t use a new encoding scheme, or new registers. The instructions database is contained in several  .dat files located inside the  isagenerator/instructions project of the bddisasm repo. While sufficient information about this project is already provided in the  readme, we will only show a quick demonstration about adding new instructions to bddisasm.\n Let’s first pick up an encoding that is not currently used by any instruction -  0F04 (although it should be noted that it was used on 286 by  LOADALL). If we try to decode this instruction, we will see that bddisasm fails:\n  Looking inside  disasmstatus.h, we see that error code  0x80000002 means  ND_STATUS_INVALID_ENCODING - so there is no valid encoding for it, which is good, since we want to create our own.\n Let’s now assume that the instruction we want to create is a simple, modrm encoded instruction, with two operands - the first one is a general purpose register, while the second one is either general purpose register, or memory. Let’s call this instruction  BDDISASM, and let’s see a couple of possible forms:\n  As already mentioned, the opcode for this instruction will be (the currently unassigned)  0F04. The first operand will be a 16, 32 or 64 bit general purpose register, depending on operand size. The second operand will be a 16, 32 or 64 bit general purpose register or memory location, depending on modrm.mod and operand size. The first operand is read-write, while the second one is only read. There are no implicit operands. We can now describe the basic instruction in  table_0F.dat:\n   The second element,  Gv, indicates that the first operand is a general purpose register encoded in modrm.reg ( G), and is 16, 32 or 64 bit in size, depending on operand size ( v);\n  The third element,  Ev, indicates that the second operand is a general purpose register or memory encoded in modrm.rm ( E), and is 16, 32 or 64 bit in size, depending on operand size ( v);\n  The next element describes the implicit operands accessed by the instruction; since we have none, we specify  nil;\n  The next element is the most important, and it describes the encoding; it enumerates all the opcode bytes -  0F and  04, followed by  /r, indicating that the instruction uses modrm encoding;\n  The last element is the access map for each instruction operand, and is specified using the keyword  w:. The first operand is read-write ( RW), while the second one is read ( R).\n Let’s now rebuild the decoding tree by building the  isagenerator project in VisualStudio, or by running  make, followed by rebuilding the  bddisasm library and the  disasmtool. Let’s now try to decode the instruction again:\n  We now get a different error:  0x80000001 which means  ND_STATUS_BUFFER_TOO_SMALL - this indicates that there is a valid instruction for this encoding, but we didn’t supply enough bytes to decode it. Indeed, we did not, as we only specified the opcode, without the modrm byte. Let’s try again, using the modrm byte as well this time:\n  As you can see, the instruction has been successfully decoded! Playing with different encodings yield the expected instruction:\n C:\\&gt;disasm -b64 -h 0F0400660F0400480F0400670F0400F30F04000000000000000000 0f0400 BDDISASM eax, dword ptr [rax]0000000000000003 660f0400 BDDISASM ax, word ptr [rax]0000000000000007 480f0400 BDDISASM rax, qword ptr [rax]000000000000000B 670f0400 BDDISASM eax, dword ptr [eax]000000000000000F f30f0400 BDDISASM eax, dword ptr [rax]\n If we want, we can add more information to our instruction. For example, we can now assume that the instruction modifies the flags - it always sets the carry-flag ( CF). In order to specify this, we have to first indicate that the instruction uses the implicit operand  Fv, which stands for the flags register, and then we have to tell it what flags it modifies, using the  f: keyword:\n   C:\\&gt;disasm -b64 -h 0F0400 -exi0000000000000000 0f0400 BDDISASM eax, dword ptr [rax] DSIZE: 32, ASIZE: 64, VLEN: - ISA Set: UNKNOWN, Ins cat: UNKNOWN, CET tracked: no FLAGS access CF: 1, Valid modes R0: yes, R1: yes, R2: yes, R3: yes Real: yes, V8086: yes, Prot: yes, Compat: yes, Long: yes SMM on: yes, SMM off: yes, SGX on: yes, SGX off: yes, TSX on: yes, TSX off: yes VMXRoot: yes, VMXNonRoot: yes, VMXRoot SEAM: yes, VMXNonRoot SEAM: yes, VMX off: yes Valid prefixes REP: no, REPcc: no, LOCK: no HLE: no, XACQUIRE only: no, XRELEASE only: no BND: no, BHINT: no, DNT: no Operand: 0, Acc: RW, Type: Register, Size: 4, RawSize: 4, Encoding: R, RegType: General Purpose, RegSize: 4, RegId: 0, RegCount: 1 Operand: 1, Acc: R-, Type: Memory, Size: 4, RawSize: 4, Encoding: M, Segment: 3, Base: 0, Operand: 2, Acc: -W, Type: Register, Size: 4, RawSize: 4, Encoding: S, RegType: Flags, RegSize: 4, RegId: 0, RegCount: 1\n You can see that in the  FLAGS access section,  CF: 1 is listed, meaning that it is always set to  1. Other possible values for flags include  m, which means that the flag is modified according to the result,  0, which means that the flag is cleared,  t which means the flag is tested, and  u, which means the flag is undefined. Flags which are missing from the  FLAGS access section are not touched at all.\n  Finally, let’s discuss some not-so-well-known cases when dealing with instruction encodings. Of course, all of them are documented, but finding this information in the SDM can take some time, so here is a quick list of the most relevant ones:\n It is possible to encode seemingly valid instructions which are longer than the maximum limit of 15 bytes, but the CPU would generate #GP on them anyway;\n  The REX prefix must always be the last byte before the opcode bytes, otherwise it’s ignored:  48F333C0 will decode to  xor eax, eax, NOT  xor rax, rax, because  F3 prefix comes after the REX  48 prefix;\n  If both  F2 and  F3 prefixes are present in an instruction, the CPU will consider the last occurring prefix:  F2F2F2F3A6 will decode to  repz cmpsb, since  F3 is the last occurring prefix, and all of the  F2 prefixes will be ignored ;\n  Likewise, the last occurring segment prefix is considered, but note that in 64 bit mode, only  fs and  gs overrides are accepted:  65642e2e3300 will decode to  xor eax, dword ptr cs:[eax] in 32 bit mode, but it will decode to  xor eax, dword ptr fs:[rax] in 64 bit mode;\n  Ignored and redundant prefixes are part of the instruction, so they are counted to the instruction length:  F2F2F2F2F2F2F2F2F2F2F2F2F2F290 is decoded &amp; executed as a  NOP, but adding one more  F2 prefix will make the instruction 16 bytes long, thus generating a #GP, and causing a decode error;\n  RSP cannot be used as an index with SIB addressing, and it will be ignored:  3304E0 will decode to  xor eax, dword ptr [rax] instead of  xor eax, dword ptr [rax+rsp*8];\n  When using  modrm.mod == 0 (memory) and  modrm.rm == 5 (rbp) in 64 bit mode, RIP relative addressing is used instead of direct addressing; however, by using SIB addressing with  modrm.mod == 0 (memory),  modrm.rm == 4 (rsp, SIB),  SIB.base == 5 (rbp), and  SIB.index == 4 (rsp), one ca still do direct addressing to an absolute 32 bit address even in 64 bit mode:  33042544444444 will decode to  xor eax, dword ptr [0x44444444];\n  In 64 bit mode, stack operations use 64 bit operands by default (even without REX.W prefix); however, this means that encoding a PUSH/POP with a 32 bit operand is impossible, although you can still encode PUSH/POP with 16 bit operands:  6650 will decode to  push ax even in 64 bit mode, with no way to encode  push eax;\n  In 64 bit mode, on Intel CPUs, indirect branches always use 64 bit operands:  FF20,  48FF20,  66FF20 will all decode to  jmp qword ptr [rax] in 64 bit mode;\n  Moves to/from control/debug registers will always use modrm.mod == 3, even if the actual modrm.mod is 0, 1 or 2:  0F2000 will decode to  mov rax, cr0, not  mov [rax], cr0;\n  Moves to/from control/debug registers with modrm.mod == 1 or modrm.mod == 2 (with displacement), will ignore the displacement:  0F2040 will decode to  mov rax, cr0, even if normally modrm.mod == 1 would require a 1 byte displacement;\n  On AMD, one can use the  LOCK prefix  F0 with  mov cr instruction to access the cr8 registers:  F00F22C0 decodes to  mov cr8, eax;\n  We presented in this blog-post how a comprehensive, well written instruction decoder can greatly improve the life of a developer when working with instructions. Surely, bddisasm is a very important part of HVMI, as much of the introspection logic revolves around analyzing instructions, and having the option of doing this with a simple, fast and accurate decoder greately improves code quality.\n We will see in a future blog-post how bddisasm can also help create simple instruction emulators, when we will dig into another important project - the Bitdefender Shellcode Emulator - bdshemu.", "posttime": "2020-11-05 20:10:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,汇编,程序,bitdefender,指令", "title": "Bddisasm：BitDefender x86反汇编程序", "title_en": "Bddisasm: The Bitdefender x86 Disassembler", "transed": 1, "url": "https://hvmi.github.io/blog/2020/11/04/bddisasm.html", "via": "", "real_tags": ["编程", "汇编", "程序", "指令"]}, {"category": "", "categoryclass": "", "imagename": "75570ac22da8e65c8779e6efddcf4579.png", "infoid": 1033280, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "理论上，IPv6是解决很多问题的解决方案，包括不断缩小的IPv4地址空间。IPv6是1997年的草案(！)，并于2017年成为真正的互联网标准。坦率地说，它只是在没有足够好处的情况下增加了太多麻烦的事情之一。\n好吧，是的，IPV6的地址空间很大。IPV4使用32位地址，总共有4,294,967,296个地址。IPV6使用128位地址，这意味着…。340,282,366,920,938,463,463,374,607,431,768,211,456地址。1整个v4空间可以放入v6空间$7.922816251426434\\x 10^{28}$。2分配给人的默认地址为a/64，这意味着前一半的地址是固定的，而整个后半部分是网络唯一的部分，这意味着大多数人在家里有18,446,744,073,709,551,616个地址可以玩。3与v4相比，在v4中，大多数网络都在/24左右，这意味着前三个分组是固定的，您得到的是…。254个地址。另外，在上下文中，标准/64分配可以再次将整个v4地址空间放入其内部4,294,967,296次。(是的，这是IPv4地址空间中的地址数量。这就是当你将一个权力除以一半的权力时会发生的事情。)。\n考虑到大多数高级管理机构已经用完了地址，IPv4地址是稀疏的，但是因为CIDR和NAT是一种东西，我们真的已经开始压缩我们的使用了。我的整个房子有60多个IP，占据了…。2，根据世界其他地区的说法。\n人们批评IPv4的一件事是分配太糟糕了。例如，任何以127开头的地址都是本地主机。通常情况下是127.0.0.1，但从127.0.0.0到127.255.255.255的任何地址都意味着完全相同的东西。那就是16,777,216个地址，字面上都是本地主机地址。按数字计算，地址空间的0.39%，但请记住这一点。\n同样，任何以0开头的地址实际上都是“当前网络”(仅作为源地址有效)，也就是另外1600万个地址。\n私有网络还有多个地址块，10.0.0.0/8、172.16.0.0/12和192.168.0.0/16，总共有17,891,328个地址。\n是的，与IPV6相比，IPV6是更好的…。在理论上。只有一个环回地址，：：1。同时…。FC00：：/7(26，58,455,991,569,831,745,807,614,120,560,689,152地址)是私有地址空间(稍后将详细介绍)，FE80：：/10(332,306,998,946,228,968,225,951,765,070,086,144地址是本地地址空间，FF00：：/8(1,329,227,995,784,915,872,903,807,060,280,344,576地址。)。是组播。是的，你看到一种重复出现的模式吗？尽管整个“特殊”地址分配恰好占整个IPV6地址空间的1.271，但我们仍然在分配大量的地址。历史会重演，你可以在这里看到这一点。\n我承认，IPV6中的多播是特殊的，因为地址中的一些位是特殊标志，而且一种形式的多播实际上包括响应节点的地址，所以它不只是一个任意数字，而是…。得了吧，有这么大的空间，这有点不必要。\n我们都知道IPV4地址是什么样子的，对吧？0-255范围内的四个点分十进制分组。例如，192.168.5.225。IPv6使用八个分组，每组四个十六进制数字，用冒号分隔。例如，2607:f0d0:1002:0051:0000:0000:0000:0004.That’s…。非常不好用，所以我们有几条缩写规则。可以删除组前的任何零，结果是：2607：f0d0：1002：51：0：0：0：4。由于这仍然是重复的，您可以用空的：2607：f0d0：1002：51：：4替换一个包含多组全零的序列。为了记录，这就是环回地址为：：1的原因。完整地址为0000。而且比IPv4地址更难说。\n请记住，此地址违反了url规范，因为：字符专门用于将主机部分(例如，google.com)与要连接的端口(假设是非标准的)分开。例如，我可以通过http://192.168.5.43:9091.See到达我的Torrent客户端：那里？因为传输侦听的是端口9091，而不是端口80。我们如何解决这个问题？好的，通过自然地再次断开它。要连接到原始的IPV6地址，你把它包在方括号里。要直接连接到2607：f0d0：1002：51：：4，那是http://[2607:f0d0:1002:51：：4]/为什么这是一件事？！\n好吧，诚然，自从…以来，IPV6有点依赖于域名系统。几乎所有东西都使用dns，当然，实际名称比32位十六进制数字更容易记住，但dns并不神奇。除非你有自己的dns服务器(实际上没有那么难)，否则你仍然需要手动输入地址。当然，如果你有pfense来管理你的网络，每个静态dhcp租约都会在dns中注册，但它必须占用dhcp租约。如果这个设备不能…，那么你还是需要手动输入地址。当然，如果你有pfense来管理你的网络，每个静态的dhcp租约都会在dns中注册，但它必须占用dhcp租约。如果这个设备不能pfense。好吧，我希望你不介意手动打出来连接，这样你就可以配置它了。\n更棒的是，rDNS.rDNS，或反向DNS，是使用在PTR记录中返回相关主机名的IP地址执行的DNS查询。例如，google.com解析到的IPv4,216.58.192.142，可以被查询为142.192.58.216.in-addr.arpa以获得它的“真实”名称，这是ord36s01-in-f142.1e100.net的PTR记录。前面有in-addr.arpa。它是向后的，因为DNS的分层性质，它从右到左运行，与IP相反。当然，还有用于IPv6的RDNS：\n$Dig-x 2607：f0d0：1002：51：：4；&lt；&lt；&gt；dig9.11.3-1ubuntu1.12-Ubuntu&lt；&lt；&gt；-x 2607：f0d0：1002：51：：4；；全局选项：+cmd；；得到答案：；；-&gt；&gt；Header&lt；&lt；OPT PSEUDOSECTION：；EDNS：版本：0，标志：；UDP：65494；；问题SECTION：；4.0.0.0.0.0.0.0.0.0.0.0.0.0.0.0.1.5.0.0.2.0.0.1.0.d.0.f.7.0.6.2.ip6.arpa.。在Ptr；中；回答SECTION:4.0.0.0.0.0.0.0.0.0.0.0.0.0.0.0.1.5.0.0.2.0.0.1.0.d.0.f.7.0.6.2.ip6.arpa.。3600in PTR 4000.0000.0000.0000.1500.2001.0d0f.7062.ip6.static.sl-reverse.com.；；查询时间：731毫秒；服务器：127.0.0.53#53(127.0.0.53)；；时间：美国东部时间2020年8月30日00：52：50；消息大小接收：180。\n这太疯狂了。IPV6RDNS TLD只有ip6.arpa，而IP部分是…。每一个十六进制数字，颠倒过来。\nIPv6的核心支柱之一是大多数流量的处理应该发生在端点-路由器除了读取和转发之外不做太多的工作，实际的数据处理很少。IPv6报头虽然比较庞大(因为巨大的地址)，但也简单得多。固定的版本代码(6)，流量类别(DiffServ+ECN)，流标签，它实际上是一个随机值，对于每个属于相同逻辑连接的数据包、长度、下一个报头类型和TTL来说都是恒定不变的。它是一个固定的版本代码(6)、流量类别(DiffServ+ECN)、流标签(Flow Label)，对于属于相同逻辑连接、长度、下一个报头类型和TTL的每个数据包来说，该值是恒定的。显然)。就是这样。IPv4报头包含13个字段外加可选部分，而IPv6报头包含平面8。当然，您实际上可能需要其他细节，这就是下一个报头字段的用武之地。IPv6不是将各种选项打包到标准的全局报头中，而是使用附加的报头扩展，这些扩展可以一个接一个地附加以提供信息，比如用于分段或IPsec。4Next Header字段中的值标识下一步的内容，该行中的最后一个Header将使用该字段指示包含的协议，可以是TCP、UDP或其他协议。\n我的意思是，几乎每个设备都使用以太网，以太网有帧校验序列，udp有校验和选项，tcp有必需的校验和…。如果我们想要简单地处理数据包，丢弃总和。确实，在某种程度上这是有意义的。即使没有这个，这也意味着大多数程序都有两个校验和：帧传输时的以太网FCS\n最后一点是，这也给另一个协议带来了变化：UDP。在IPv4中，UDP校验和字段可以(通常也会)留空为全零，这意味着“没有校验和”。在IPv6中，这现在是不允许的，并且仍然会对全零校验和进行…检查。然后发现无效。所有IPv6上的UDP数据包都必须计算有效的校验和。\n因此，设备之间的每条链路都有MTU(最大传输单位)。对于普通的以太网链路，减去帧开销，这是1500字节。如果您的设备支持巨型帧，则接近9000字节。并不是所有的链路都是相等的。有些设备可能一端具有高MTU链路，而另一端具有较低的MTU链路。例如，我的路由器可能在内部支持巨型帧，但广域网端不允许这样做。为了解决这个问题，我们有碎片。\n如果路由器由于MTU差异而无法转发帧，则在允许的情况下，它将使用IPv4报头的More Fragments标志和片段偏移量字段将数据包分成多个块，并将数据包分成多个帧逐个发送，另一端可以重新组装。请注意，我说的是“如果允许”。IPv4报头中有一个“不要分片”标志，如果发送设备设置了该标志，则不能支持这种大小的数据包的路由器将发回ICMP“Packet Too Large”(数据包太大)消息，该消息会弹回。这意味着，在发送数据时，您唯一关心的MTU是您直接连接的设备的MTU；你自己的链接。\nIPv6不允许这样做。中间路由器不允许对数据包进行分段，而是会发回ICMP错误。如果您要对数据包进行分段(这也是非常不鼓励的)，则发送设备可以添加分段报头扩展。因此，要么根本不对数据包进行分段，要么从始发设备对数据包进行分段。IPv6还希望发送者通过实际侦听ICMP数据包太大的消息来执行路径MTU发现，该消息包含该节点的MTU。因此，IPv6还希望发送者执行路径MTU发现，方法是实际侦听包含该节点MTU的ICMP数据包太大的消息。因此，IPv6不允许对数据包进行分段，而是将其发回ICMP错误。如果您要对数据包进行分段(这也是非常不鼓励的)，则发送设备可以添加分段报头扩展。不要超过IPv6的最小MTU，即1280字节。\n如果你了解我，你就知道我总是说，计算机网络是一个奇迹，只有通过胶带、工程师的祈祷和愚蠢的运气才能维系在一起。没有什么比将IPv6引入网络更正确的了，在这个网络中，几乎每个与我交谈的人都在为他们提供选择的所有东西上彻底禁用了IPv6-这太令人头疼了，不得不处理所有这些-如果它被启用，90%的新网络问题变成了这样一个事实，即设备现在正在做你从未想过的意想不到的IPv6事情。这是一个令人头疼的问题，如果它被启用，90%的新网络问题变成了这样一个事实，即设备现在正在做你从未想过的意想不到的IPv6事情。\n但除此之外，如果你想用IPv6运行网络，你可能不得不同时运行4和6，因为IPv4仍然很强大。这意味着对于涉及特定主机或网络的每条防火墙规则，你都需要两条：一条用于IPv4块，另一条用于IPv6块。如果你改变了一个，而忘记了另一个，那是不可能的。\n一般情况下，当你得到一个IP地址后，这个地址就可以在全球范围内进行路由了--任何人都可以从任何地方访问它，就像好莱坞式的那样。\n但是，如果您想要私有网络，有一个前缀：从fc00：0000：0000：0000：0000：0000：0000：0000：0000：0000：0000：0000到fdff：ffff：ffff(fc00：：/7)之间的任何内容都被认为是私有网络不可路由的。从技术上讲，这里允许您修改的第一位应该始终是1，这意味着您实际的rfc兼容范围是fd00：：/8，即fd00：0000：0000：0000：0000：0000：0000：0000到fdff：ffff：fff。地址的一半，但仍然很多。是的，实际的规范更复杂，并且在“网络”区域定义了几个部分，但是…。好吧，你明白我的意思了。\n所以现在的问题是：假设你已经做到了这一点。你如何将数据包路由到这些私有IP？答案是网络地址前缀转换。等待…。什么？\n是。NAT是一种IPv4协议。NPT是一种IPv6技术。使用IPv4，你可以扫描信息包，如果它们符合一定的标准(比如，去往已知地址，比如你的广域网地址)，就用一个新的地址交换目的地(或源)地址。这就是我对我的所有服务只使用一个IP的方式：目的地端口决定你的请求被路由到哪个服务器。从这个意义上说，所有未知的流量都会被丢弃，我对其有NAT规则的流量也会被允许通过防火墙。这是一个“默认丢弃系统”(Default Drop System)。这是一个“默认丢弃系统”(Default Drop System)。从这个意义上说，所有未知的流量都会被丢弃，而我对其有NAT规则的流量也会被允许通过防火墙。\n例如，假设我在私有地址fd2c：a7c6：2aae：ef93：：41上有一个主机，然后我可以为添加一个npt规则，将fd2c：a7c6：2aae：ef93：：转换为2607：f0d0：1002：51：：。这实际上是1：1的映射，这意味着它是双向的，入站和出站都将被转换。\n为此，我可以(也许使用aaaa记录)将服务器的公共IP通告为2607：f0d0：1002：51：：41，当数据包以…格式传入时。\n这不仅意味着我暴露了我的整个网络，而且我需要为每个不同的目的地提供不同的IP，此外，我还会泄露我的网络的内部结构！你可能不知道前缀，但你会知道确切的子网地址，因为我只翻译一个前缀！\n那个“不同的IP”位听起来可能有点…。嗯，那么请记住，对于我运行的一些系统(比如这个博客，使用NNTP)，端口号本身就决定了目的地，你甚至仍然可以使用相同的域名进行计数。使用NPT，你无法做到这一点，你必须有一个额外的设备，如第7层代理(如HAProxy)来接收所有内容并将其发送到正确的目的地，这意味着我需要一台专用主机来做IPv4 NAT本来就可以做的事情！\n而且情况会变得更好。记住，这将会盲目地交换前缀。过去的日子是“只有我显式地为其创建规则的流量才能进入”。现在，只需添加一个步骤，就可以默认地暴露您的整个网络！现在，您需要防火墙规则来拦截您不想要的内容，并添加显式允许，这一次是手动作为额外的步骤。这更像是一种“默认通过”路由--除非我告诉您不要这样做，否则就让它通过。现在，大多数防火墙都是这样做的。如果某个东西没有NAT规则，那么即使它被允许通过，它实际上也不知道路由到哪里。有了《不扩散核武器条约》，你就没有了那层安全层，防火墙是外部世界和你的网络之间唯一的东西。\n如果你还记得关于IPv6的一件事，那就是这件事。正确的。这就是我暂时不会开始运行IPv6网络的原因。\n但我还没做完，整个实践都是…。PfSense手册甚至说，我刚才说的可能也不能正确工作，所以，不错，但同时，ipv6的全部要点是所有节点都是全球可路由的，你不需要特殊的私有地址空间或任何类型的转换，它就可以工作。如果你想，哈，隐私，这就是防火墙的用途。这就是…。好的，说真的，这就像是一群不知道技术应该如何工作的人被要求设计一种技术文盲可以真正理解和流利使用的东西，我们有…。这个。就像现在，IETF在写RFC时是不是看了一些网络犯罪电影？世界上任何地方的每台计算机默认情况下都是可以访问的，除非你特别防火墙。我知道即使是在IPv4中，事情也是这样运作的，直到你设置了一个子网边界，但在V6中，它要么是防火墙，要么是没有保护。从技术角度来看，这种端到端的焦点性质真的是考虑不周。而且，正如数据显示的那样，那些积极使用IPv6的设备。从“只是工作”的角度来看，这是不错的，但就像最近的许多事情一样，“好的，它需要无缝工作”这一方面与“实际有用的功能”这一方面严重冲突。\n客户端从源0.0.0.0向广播地址发送一个DHCPDISCOVER数据包。\n服务器向广播IP(但目的MAC)发送一个DHCPOFFER，其中包含提供的客户端IP、子网掩码、DNS服务器、租用时间和其他信息。\n服务器发送带有提议中相同信息的DHCPACK，从而确认IP分配。\n这里的DHCP还包括大量编号选项形式的数据，但以下是一些常见的值：\n还可以发送一些额外的值，比如默认的MTU(选项26)。有254个有效选项，0x00是填充，0xff是消息的结尾。\n在短短四个UDP消息中，一台主机只需开机就可以获得它可能需要的几乎每一位信息。\nDHCPv6…。不是很多。协议一分为二，让我们先来看看DHCPv6。这也是一个四步过程：\n客户端从其本地链路向“All DHCP”组播地址ff02：：1：2发送请求。\n一些过时的选项，比如WINS服务器被移除了，但是你会注意到一些东西完全丢失了，比如网络网关。同样，DHCP服务器只提供地址的本地部分，它甚至不提供网络前缀。但是在我们开始之前，这里有一些有趣的东西：DHCP(V4)使用客户端的MAC地址作为它的标识符，IP被租给特定的MAC。DHCPv6使用一个DHCP唯一标识符(DUID)，通常是MAC地址，还有其他东西。DUID(Duid)，通常是MAC地址。在我们开始之前，这里有一些有趣的事情：DHCP(V4)使用客户端的MAC地址作为它的标识符，IP被租给特定的MAC。DHCPv6使用一个DHCP唯一标识符(DUID)，通常是MAC地址，还有其他东西。基于UUID。IP租给DUID而不是Mac，所以实际上很难提前预订。最简单的做法是等待客户端获得租约，然后将其升级为静态分配。哦，当然，这里有一个MAC+Time DUID的示例：00-01-00-01-18-BA-30-56-D8-9D-67-C9-FA-33。您注意到这里的模式了吗。为了简单起见，创造了不必要的复杂性，这是我在计算和网络领域看到的最具讽刺意味的转折之一。\n还要注意的是，这在默认情况下也不会发生。只有在SLAAC/RA允许的情况下才会使用DHCP。虽然我马上就会讲到SLAAC，但让我们来谈谈邻居发现协议和路由器通告。\n当一台支持IPv6的主机加入网络时，它将发送路由器请求(嗯，我在这里几次看到“Solicate”作为动词，我想我找到了每个人最喜欢的新单词)。可转发帧的可用的IPv6网关将定期发送路由器通告消息，或者，如果它们看到请求，将立即发出广告。\n通告包含M和O标志(等待)、最多三个DNS服务器、一个搜索列表(与DHCP相同)和网络前缀。通告包含M和O标志(等待)、最多三个DNS服务器、搜索列表(与DHCP相同)和网络前缀。通告还包含该特定路由器的优先级(低、正常或高)之一。为什么只有三个？问倒我了。不，在同一优先级上有多个路由器通常不是一个简单的想法。如果一个网络上有三个以上的网关(因为这是你现在可以做的事情)，那就玩得开心。不管怎么说，托管的和其他有状态的标志可以更深入地控制主机的行为。还有更多关于前缀dat的标志。\n.", "note_en": "So this is just going to be a total rant.IPv6 is, in theory, a solution to many things, including the dwindling IPv4 address space.IPv6 was a draft in 1997(!), and became a real  Internet Standard in 2017.And, quite frankly, it’s one of those things that just adds too much hassle for not enough benefit.\n  Okay, yes, IPv6’s address space is   massive.IPv4 uses 32-bit addresses, allowing for 4,294,967,296 total addresses.IPv6 uses 128-bit addresses, meaning… 340,282,366,920,938,463,463,374,607,431,768,211,456 addresses.  1The entire v4 space could fit into the v6 space $7.922816251426434 \\times 10^{28}$ times over.  2The default allocation to people, a  /64, meaning the first half of the addresses is fixed and the entire second half is the part unique to the network, means that most people have 18,446,744,073,709,551,616 addresses to play with at home.  3Compared to v4, where  most networks are around  /24, meaning the first three groupings are fixed, you get… 254 addresses.Again, context, a standard  /64 allocation can,  again, fit the entire v4 address space inside itself 4,294,967,296 times. (Yes, that’s the number of addresses  in the IPv4 address space. That’s what happens when you divide a power by half of that power.)\n IPv4 addresses are, well, sparse, given that most high-level authorities have already run out of addresses, but because CIDR and NAT are a thing, we’ve really started compacting down our usage. My entire house of easily over 60 IPs takes up… 2, according to the rest of the world.\n  One thing that people have criticized IPv4 for is that the allocations are just horrible.For example,  anything starting with  127 is  localhost.normally this is  127.0.0.1, but anything from  127.0.0.0 to  127.255.255.255 all mean the  exact same thing.That’s 16,777,216 addresses all  literally for  localhost.By numbers, 0.39% of the address space, but just keep this in mind.\n Similarly, anything starting with a  0, is effectively “current network” (only valid as source), again, another 16 million addresses.\n There’s also multiple blocks for private networks,  10.0.0.0/8,  172.16.0.0/12, and  192.168.0.0/16.In total, 17,891,328 addresses.\n Compared to IPv6, yes, IPv6 is much better… in theory.There’s only  one loopback address,  ::1.At the same time…  fc00::/7 (26,58,455,991,569,831,745,807,614,120,560,689,152 addresses) is the private address space (more on that later),  fe80::/10 (332,306,998,946,228,968,225,951,765,070,086,144 addresses) is the  local address space, and  ff00::/8 (1,329,227,995,784,915,872,903,807,060,280,344,576 addresses.) is multicast.yes, do you see a recurring pattern?Even though the entire “special” address assignments are exactly 1.271% of the entire IPv6 address space, we’re still allocating  giant swathes of addresses.History repeats itself, you can see that  right here.\n And I will admit, that multicast in IPv6 is special since some bits in the address are special flags, and one form of multicast actually includes a response node’s address, so it’s not  just an arbitrary number, but… come on, that’s a little uncalled for, having  that much space.\n  We all know what an IPv4 address looks like, right?Four dotted-decimal grouping in the range from 0–255.For example,  192.168.5.225.IPv6 uses  eight groupings of four  hex digits, colon-separated.For example,  2607:f0d0:1002:0051:0000:0000:0000:0004.That’s… very unweildy, so we have a few shortening rules.Any zeros that  lead the droup can be dropped, giving us this:  2607:f0d0:1002:51:0:0:0:4.And since  that is still repetitive, you can replace  exactly one sequence of  more than one group of all zeros with an empty:  2607:f0d0:1002:51::4.For the record this is why the loopback address is  ::1.The full address is  0000:0000:0000:0000:0000:0000:0000:0001.Even with those methods, they’re still  much longer, harder to remember, and harder to even say than IPv4 addresses.\n  And remember that this address violates the URL spec, since the  : character is specifically to be used to separate the  host portion (e.g.,  google.com) from the  port to connect to (assuming nonstandard).As an example, I can reach my torrent client via  http://192.168.5.43:9091.See that  : there?Because Transmission listens on port 9091, not port 80.How do we fix this?Well, by breaking it again, naturally.To connect to a raw IPv6 address, you wrap it in square brackets.To connect to  2607:f0d0:1002:51::4 directly, that’s  http://[2607:f0d0:1002:51::4]/ Why is this a thing?!.\n  okay, admittedly, IPv6 kinda relies on DNS since… just about everything uses DNS, and of course, actual names are more memorable than 32 hexadecimal digits, but DNS isn’t magic.Unless you have your own DNS server (actually not that hard) that’s configured, you’re still manually typing addresses.Of course if you have, say, pfSense managing your network, every static DHCP lease will be registered in DNS, but it has to take a DHCP lease.And if this device doesn’t… well, I hope you don’t mind typing that out by hand to connect so you can configure it.\n Even better, rDNS.rDNS, or Reverse DNS, is where a DNS query is performed  with an IP address that returns the hostname associated, in a  PTR record.For example, the IPv4 that  google.com resolves to,  216.58.192.142, can be queried as  142.192.58.216.in-addr.arpa to get it’s “real” name, a  PTR record for  ord36s01-in-f142.1e100.net.With  dig, specifying a  -x and then the IP will convert it to the correct format.And if you look close, the query name is the IP, backwards, with  in-addr.arpa at the front.It’s backwards because of the hierarchical nature of DNS, which runs right to left, the opposite of IPs.Of course, there’s also rDNS for IPv6:\n $ dig -x 2607:f0d0:1002:51::4; &lt;&lt;&gt;&gt; DiG 9.11.3-1ubuntu1.12-Ubuntu &lt;&lt;&gt;&gt; -x 2607:f0d0:1002:51::4;; global options: +cmd;; Got answer:;; -&gt;&gt;HEADER&lt;&lt;- opcode: QUERY, status: NOERROR, id: 22821;; flags: qr rd ra; QUERY: 1, ANSWER: 1, AUTHORITY: 0, ADDITIONAL: 1;; OPT PSEUDOSECTION:; EDNS: version: 0, flags:; udp: 65494;; QUESTION SECTION:;4.0.0.0.0.0.0.0.0.0.0.0.0.0.0.0.1.5.0.0.2.0.0.1.0.d.0.f.7.0.6.2.ip6.arpa. IN PTR;; ANSWER SECTION:4.0.0.0.0.0.0.0.0.0.0.0.0.0.0.0.1.5.0.0.2.0.0.1.0.d.0.f.7.0.6.2.ip6.arpa. 3600 IN PTR 4000.0000.0000.0000.1500.2001.0d0f.7062.ip6.static.sl-reverse.com.;; Query time: 731 msec;; SERVER: 127.0.0.53#53(127.0.0.53);; WHEN: Sun Aug 30 00:52:50 EDT 2020;; MSG SIZE rcvd: 180\n That is   insane.The IPv6 rDNS  TLDis just  ip6.arpa, and the IP part is…every single hex digit, reversed.\n   One of the core pillars of IPv6 is that most of the processing of traffic should happen at the endpoints — routers don’t do much besides read, and forward, with very little actual data processing.The IPv6 header while being  gargantuan in comparison (because the giant addresses), is also much simpler.A fixed version code (6), the traffic class ( DiffServ+  ECN), a  flow label which is effectively a random value that’s constant for every packet that’s part of the same logical connection, length, type of next header, and a TTL (then addresses, obviously).That is  it.The IPv4 header contains 13 fields plus optional sections, and the IPv6 header contains a flat 8.Of course, you may actually need other details, and that’s where the  next header field comes in.Instead of packing all sorts of options into the standard, global header, IPv6 uses additional header  extensions that can get tacked on one after another to provide that information, say for fragmentation or IPsec.  4The value in the next header field identifies what’s going to come next, and the final header in the line will use this field to indicate the contained protocol, be it TCP, UDP, or something else.\n Also note there’s no checksum anymore.I mean, just about every device uses Ethernet, which has a Frame Check Sequence (FCS), UDP has a checksum option, TCP has a required checksum…If we want to simply packet processing, drop the sum.And really, it does make sense, in a way.Even without that one, that means that most programs have two checksums: the Ethernet FCS as the frame gets transmitted point to point, and the transport layer checksum, making sure the entire packet is still valid.Also, the IPv4 checksum also included the TTL (max number of hops in the path before the packet is dropped), meaning that at  every stop along the way, the checksum had to be recalculated.\n As a final point, this also does bring a change to another protocol: UDP.With IPv4, the UDP checksum field can (and often would) be left blank as all zeros, meaning “no checksum”.In IPv6, this is now disallowed, and a all zero checksum will still be checked… and then found invalid.All UDP packets over IPv6  must have a valid checksum calculated.\n  So every link between devices has an MTU, the Maximum Transmission Unit.For normal Ethernet links, minus the frame overhead, this is 1500 bytes.If your equipment supports jumbo frames, that’s closer to 9000 bytes.Well not all links are equal.Some devices might have a high-MTU link on one end, and a lower MTU link on the other.For example, my router might support jumbo frames internally, but the WAN side doesn’t allow that.To deal with, this, we have  fragmentation.\n If a router is unable to forward a frame due to MTU differences, it will, if allowed, split the packet into multiple chunks, using the More Fragments flag and the Fragment Offset field of the IPv4 header, and send the packet in multiple frames piece by piece, which the other end can reassemble.Note that I said “if allowed.”There is a Don’t Fragment flag in the IPv4 header, and if this is set by the sending device, a router that cannot support a packet of that size will send back an  ICMP“packet too big” message which bounces back along the chain.Any node in the network path can perform this, meaning that for sending data, the only MTU you care about is the MTU of the device you’re directly connected to; your own link.\n IPv6 does not allow this.Intermediate routers are  not allowed to fragment a packet, and instead will send back an ICMP error.If you’re going to fragment a packet (which is also heavily discouraged), then the sending device can add a  Fragmentation header extension.So, either packets are not fragmented at all, or packets are fragmented from the originating device.IPv6 also expects senders to perform  Path MTU discovery, by actually listening to ICMP packet too big messages, which contains the MTU of that node.The sender is expected to read this, and then adjust accordingly, repeating this in a loop until the packet can pass just fine.Alternatively… don’t exceed the IPv6 minimum MTU, 1280 bytes.\n  If you know me, you know I always say that computer networking is a miracle that only holds together by duct tape, prayers of engineers, and dumb luck.Nowhere does this hold true more than the introduction of IPv6 into a network, where just about everyone that I talk to has flat out disabled IPv6 on everything that gives them the option — it’s just way too much headache to have to deal with it all, and if it’s enabled, 90% of your new network problems become the fact that devices are now doing unexpected IPv6 things that you never thought of.\n but besides that point, if you want to run a network with IPv6, you’re likely going to have to operate both 4 and 6 just because IPv4 is still going strong.So that means for every firewall rule that involves a specific host or network, you need two: one for the IPv4 block, and one for the IPv6 block.And heaven forbid if you change one and forget the other.\n  Does not exist.Generally when you get an IP address, that address will be globally routable — anyone can access it, from anywhere, Hollywood style.\n However, if you want a private network, there is  one prefix for that: anything from  fc00:0000:0000:0000:0000:0000:0000:0000 to  fdff:ffff:ffff:ffff:ffff:ffff:ffff:ffff ( fc00::/7) is considered non-routable for private networks. Technically the first bit here you’re allowed to modify should  always be 1, meaning your  actually RFC compliant range is  fd00::/8, which is  fd00:0000:0000:0000:0000:0000:0000:0000 to  fdff:ffff:ffff:ffff:ffff:ffff:ffff:ffff.half the addresses, but still plenty.Yes, the actual spec is more complicated and defines a few parts in the “network” area, but… well, you get the point.\n So here’s the question: Say you’ve done that.How do you route packets to these private IPs?The answer is Network  Address  Prefix Translation.Wait… what?\n Yes. NAT is an IPv4 thing. NPt is an IPv6 thing.With IPv4, you can scan for packets and, if they match certain criteria (say, going to a known address, like your WAN address, on a known port), swap the destination (or source) address with a new one.This is how I am using just  one IP for all my services: the destination port decides what server your request gets routed to.In this sense, all unknown traffic is dropped, and traffic that I have NAT rules for are also allowed pas the firewall.This is a “default drop” system.Nothing gets through unless I say so.\n  Say, for example, I have a host at the private address of  fd2c:a7c6:2aae:ef93::41.I could then add an NPt rule for to transform  fd2c:a7c6:2aae:ef93:: into  2607:f0d0:1002:51::.This is effectively a 1:1 mapping, meaning that it works both ways, both inbound and outbound will be translated.\n For this, I could then, say, advertise (with an  AAAA record, perhaps) the public IP of the server as  2607:f0d0:1002:51::41, and when the packet comes in…\n  Which not  only means that I’m exposing my  entire network, but I  need a different IP for every different destination, and, additionally, I’m also giving away the internal structure of my network!You may not know the prefix but you’ll know the  exact subnet address since I’m   only translating a prefix!!!\n That “different IPs” bit may sound a bit… duh, then remember that for some systems I run (like this blog, with NNTP), the  port number alone is what decides the destination, you could even still go to the  same domain name and it counts.With NPt, you  cannot do this, you’d have to have an  additional device like a layer 7 proxy (like HAProxy) to take in everything and send it to the correct destination, meaning I need a dedicated host to do the thing that  IPv4 NAT  could already do natively!\n And  it gets better.Remember, this will  blindly just swap prefixes in and out.Gone are the days of “only the traffic I explicitly create a rule for can get in”.See, now, just adding that  one step will, be default, expose your  entire network!You now need firewall rules to block what you don’t want and add explicit allows, this time manually as an additional step.This is more of a “default pass” routing — unless I tell you not to, let it through.Now, most firewalls do by default drop unknown traffic, but with NAT, if there’s no NAT rule for something it literally has no clue where to route it even if it  is allowed through.With NPt, you don’t have that layer of security, the firewall is the  only thing between the outside world, and your network.\n Really if you remember  one thing about IPv6, it’s  this. right. here.And this  alone is the reason that for the time being I will  never start running IPv6 networks.\n But  I’m not done yet.The entire practice is… just flat out discouraged.The pfSense manual even says that what I just said might also not work correctly, so,  nice, but also, the entire  point of IPv6 is that all nodes are globally routable, you don’t  need special private address spaces or translation of any kind, it  just works.And if you want, hah,  privacy, that’s what firewalls are for.It’s… okay, seriously, it’s like a group of people that have no clue how tech  should work were asked to design something that the tech-illiterate can actually understand and use fluently, and we have…  this.Like, really now, was the IETF watching some cybercrime flicks as they wrote the RFC?Every computer just  by default accessible  anywhere in the world unless you  specifically firewall things?I get that even with IPv4 that’s how things worked  until you set up a subnet boundary, but here, in v6, it’s either a firewall or no protection.This whole “end-to-end” focus nature really feels poorly thought out, from a techie perspective.And, as data shows, the kind of devices that  do actively use IPv6 (mobile devices, mainly), are able to just zeroconf themselves perfectly, which is nice from a “just works” perspective, but like many things recently, the “well it needs to work seamlessly” side  seriously clashes with the “actual useful functionality” side.\n   Client sends out a  DHCPDISCOVER packet from a source of  0.0.0.0 to the broadcast address\n Server sends a  DHCPOFFER to broadcast IP (but destination MAC) with the offered client IP, subnet mask, DNS servers, lease time, and other information\n  Server sends a  DHCPACK with the same information in the offer, thus confirming the IP assignment\n DHCP here also includes a lot of data in the form of numbered options, but here’s some common values:\n  Some additional values like the default MTU (option 26) can also be sent.There’s 254 valid options, as  0x00 is padding and  0xff marks the end of the message.\n In just four UDP messages, a host just powering on can gain just about  every bit of information that it may need.\n DHCPv6… not so much.The protocol  is split in two, and let’s go over DHCPv6 first.This is, again, a four step process:\n Client sends a  SOLICIT from its link-local to the “All DHCP” multicast address,  ff02::1:2\n   Some obsolete options like WINS servers are removed, but you’ll notice some things like the  network gateway are completely missing.Also the DHCP server just provides the local part of the address, it doesn’t even give out the network prefix.But before we get into  that, here’s something fun:DHCP(v4) uses the MAC address of the client as it’s identifier, IPs are leased to a particular MAC.DHCPv6 uses a DHCP Unique Identifier (DUID), which is  usually the MAC address, with other things.There’s four types: one for the MAC + timestamp, a unique enterprise number based DUID, just the MAC, and a UUID based one.IPs are leased out to  DUIDs not  MACs, and so it’s actually  really difficult to make reservations ahead of time.The easiest course of action is to wait for the client to grab a lease, then upgrade that to a static assignment.Oh, and yes, of course, here’s an example MAC + time DUID:  00-01-00-01-18-BA-30-56-D8-9D-67-C9-FA-33.Are you noticing a pattern here with IPv6?Everything is just getting long, unwieldy, and, in my opinion, creates needless complexity  in the interest of simplicity in one of the most ironic twists I’ve seen in computing and networking.\n Also note that  this also doesn’t happen by default either.DHCP will only be used  if SLAAC / RA permits.And while I’ll get to SLAAC in a second, let’s talk about the Neighbor DIscovery Protocol, and Router Advertisements.\n  When an IPv6 capable host joins a network, it will send out  Router Solicitation (hmm, I’m seeing “solicit” as a verb here a few times, I think I found everyone’s new favorite word) message.Available IPv6 gateways that can forward frames will periodically send out  Router Advertisement messages, or, if they see a solicitation, will immediately send out an advert.\n The advertisements contain the M and O flags (hold on), a lifetime for which the advert should be considered valid, up to three DNS servers, a search list (same as DHCP), and the network prefix.The advert also contains a priority, one of low, normal, or high, for that particular router.Why only three? Beats me.And no, it’s  not usually a giid idea to have more than one router on the same priority level.If you have more than three gateways on a network (because  of course thats a thing you can do now), have fun.Anyways, the Managed and “Other stateful” flags control the behavior of hosts a bit more in-depth.There’s even  more flags concerning the prefix dat\n......", "posttime": "2020-11-05 20:09:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "彻头彻尾,total,地址", "title": "IPv6是一场彻头彻尾的噩梦--这就是为什么", "title_en": "IPv6 Is a Total Nightmare – This Is Why", "transed": 1, "url": "https://teknikaldomain.me/post/ipv6-is-a-total-nightmare/", "via": "", "real_tags": ["彻头彻尾", "total", "地址"]}, {"category": "", "categoryclass": "", "imagename": "de56332b89439e9e99de10ee9e16a6db.png", "infoid": 1033279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Compose for Desktop简化并加速了桌面应用程序的用户界面开发，并允许在Android和桌面应用程序之间进行广泛的用户界面代码共享。目前在阿尔法。\n关于GitHub的探索。\nCompose for Desktop简化并加速了桌面应用程序的用户界面开发，并允许在Android和桌面应用程序之间进行广泛的用户界面代码共享。目前在阿尔法。\n关于GitHub的探索。\nCompose for Desktop为使用Kotlin创建用户界面提供了一种声明性和反应性方法。组合可组合的功能来构建您的用户界面，并享受来自您的IDE和构建系统的完整工具支持-不需要XML或模板语言。\nCompose for Desktop以JVM为目标，通过利用强大的原生Skia图形库，在所有主要桌面平台(MacOS、Windows和Linux/x64)上支持高性能、硬件加速的用户界面渲染。\n请阅读我们的教程，了解Compose for Desktop必须提供的功能。\n在本教程中，我们将了解如何使用Compose for Desktop创建一个简单的桌面用户界面应用程序。\n查看教程。\n使用Compose for Desktop和Android显示来自远程服务器的图像的图片库示例。\n浏览应用程序。\n请注意，Compose for Desktop目前处于早期的Alpha开发阶段，可能不适合生产应用程序。\n这个跨平台的文件查看器应用程序是用Compose for Desktop开发的。它显示了桌面应用程序中常见的大多数元素：", "note_en": "Compose for Desktop simplifies and accelerates UI development for desktop applications, and allows extensive UI code sharing between Android and desktop applications. Currently in alpha.\n Explore on GitHub\n Compose for Desktop simplifies and accelerates UI development for desktop applications, and allows extensive UI code sharing between Android and desktop applications. Currently in alpha.\n Explore on GitHub\n Compose for Desktop provides a declarative and reactive approach to creating user interfaces with Kotlin. Combine composable functions to build your user interface, and enjoy full tooling support from your IDE and build system – no XML or templating language required.\n Compose for Desktop targets the JVM, and supports high-performance, hardware-accelerated UI rendering on all major desktop platforms (macOS, Windows, and Linux/x64) by leveraging the powerful native  Skia graphics library.\n  Work through our tutorials to learn about the features Compose for Desktop has to offer.\n In this tutorial we will see how to create a simple desktop UI application using Compose for Desktop.\n View tutorial\n An example of an image gallery showing images from a remote server, using Compose for Desktop and Android.\n Explore app\n Please note that Compose for Desktop is currently in early alpha development stage and may not be fit for production applications.\n This cross-platform file viewer application is developed with Compose for Desktop. It manifests most elements typically found in a desktop application:", "posttime": "2020-11-05 20:07:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jetbrains,用户界面", "title": "JetBrains谱曲", "title_en": "JetBrains Compose", "transed": 1, "url": "https://www.jetbrains.com/lp/compose/", "via": "", "real_tags": ["jetbrains", "用户界面"]}, {"category": "", "categoryclass": "", "imagename": "2516de75fadea703902389a6a1656c2c.jpeg", "infoid": 1033278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是Kotlin访谈的第四部分，我在这个系列中回顾了Kotlin函数和代码片段，这些都是我在准备Android面试时经常出现的。我还编写了一份小抄，涵盖了本系列的全部5个部分，你可以在这里找到。\n许多面试问题都需要某种迭代，无论是操作输入数组还是使用映射来存储信息，因此我将介绍一些常见数据结构的不同迭代方式。\nKotlin中的范围是由起始值、终止值和步长定义的一系列值。步长(即两个值之间的距离)的缺省值为1。您最常遇到的步长是IntRange，但您也可以使用long grange和CharRange。\nForEach()对集合中的每个元素执行给定的操作。这是我在普通项目中最常用的迭代方法，但在访谈中使用的频率不高，因为1)如果在迭代访问集合时试图修改集合，forEach()将抛出ConcurrentModificationException异常；2)很多面试问题也需要考虑索引。\nForEachIndexed()与forEach()类似，不同之处在于您还可以访问lambda中的元素索引，这是面试问题中经常需要的。\n//以偶数索引打印元素。List.forEachIndexed{index，Element-&gt；if(index%2==0)println(&#34；$Element&#34；)}。\n..，也称为rangeTo()，可以以for(a..b中的i)的形式使用来创建然后迭代范围。该范围将包括start(A)和end(B)元素，因此如果您希望使用它来迭代列表/数组，则应该将其写为for(i in 0..list.size-1)或使用Until。尽管它最常与Int一起使用，但您也可以迭代字符。\n//从i=0到i=100迭代打印(i in 0..100){println(I)}//从i=0迭代到i=list.size-1 for(i in 0..list.size-1){println(list[i])}//迭代并打印&#39；a&#39；，&#39；b&#39；，&#39；c&#39；，&#39；d&#39；for(i in&#39；d&#39；for(i in&#。..){println(I)}\nDownTo()的工作方式与..类似，不同之处在于每次迭代都向下一步而不是向上一步。\n//从i=100到i=0迭代打印(i in 100向下到0){println(I)}。\n//(i in 1..8 step 2){println(I)}迭代打印1，3，5，7 for(I In 8 Down To 1 Step 3){println(I)}。\nUntil()包括开始元素，但不包括结束元素。这是我首选的遍历集合索引的方式，因为如果使用列表的大小作为结尾，就不必担心索引超出界限。\n//从i=0到i=99迭代打印(i in 0到100){println(I)}//迭代并打印元素从i=0到i=list.size-1 for(i in 0到list.size){println(list[i])}。\nINDEX返回表示集合的有效索引的IntRange，其使用方法与Until()类似。\nVal list=listof(&#39；a&#39；，&#39；b&#39；，&#39；c&#39；)println(list.index)//打印0..2//迭代并打印(i in list.index){println(List[i])}中i=0到i=2的元素。\n这在实际项目中并不常见，但在面试问题中却经常出现--网格、迷宫、图表等等都可以用2D数组来表示。\n以下是我使用Until迭代二维数组或列表的首选方法：\nIf(grid.isEmpty())return for(i in 0 to grid.size){for(j in 0 in 0 to grid[0].size){println(grid[i][j])}}。\nIf(grid.isEmpty())return for(i in grid.index){for(j in 0，直至Grid[0].size){println(grid[i][j])}}。\n地图在面试问题中也很常见，特别是当列表不够时，地图是存储信息的好方法。\n如果需要遍历键-值对，可以使用for循环或forEach循环。这取决于个人喜好。\n//使用for循环for((key，value)in map){println(&#34；$key=$value&#34；)}//使用forEach()map.forEach{(key，value)-&gt；println(&#34；$key=$value&#34；)}迭代条目。\n如果只需要遍历这些键，则可以使用键val来获取映射中的一组所有键，并遍历这些键。\n同样，如果只需要遍历这些值，值val将返回一组映射中的所有值。\n当您希望根据元素的优先级处理元素时，PriorityQueue非常有用。它们经常用在要求第K个最大值、第K个最小值、最大K个频率等面试问题中。我在第1部分中更详细地讨论了这些问题，但这里提醒您迭代遍历是什么样子的。\nVal pq=PriorityQueue&lt；Int&gt；(listof(2，1，3))//pq将在3次迭代后为空，而(pq.isNotEmpty()){println(pq.pol())//打印1，然后打印2，然后打印3}。\n第4部分到此为止！这里的链接再次涵盖了所有5个部分的小抄。", "note_en": "This is Part 4 of Kotlin for Interviews, a series where I go over Kotlin functions and code snippets that came up often during my Android interview prep. also compiled a cheatsheet that covers all 5 parts of this series, which you can find  here.\n    Many interview problems require some kind of iteration, be it manipulating an input array or using a map to store information, so I’ll go over different ways of iterating over some common data structures.\n  A  Range in Kotlin is a sequence of values defined by a start value, an end value, and a step. The step, or distance between two values, has a default value of 1. The one you’ll encounter the most often is  IntRange, but you can use  LongRange and  CharRange as well.\n  forEach() performs the given action on each element in the collection. This is the iteration method I use most often in normal projects, but didn’t use as often in interviews because 1)  forEach() will throw a  ConcurrentModificationException if you try to modify the collection while iterating through it, and 2) a lot of interview problems require taking the index into account as well.\n forEachIndexed() is like  forEach(), except you also have access to the element’s index inside the lambda, which you often need in interview problems.\n // Print elements at even indices.  list.forEachIndexed { index, element -&gt;   if (index % 2 == 0) println(&#34;$element&#34;) }\n .., aka  rangeTo(), can be used in the form of  for(i in a..b) to create then iterate through a  Range. The range would include both the start ( a) and end ( b) elements, so if you want to use it to iterate through a list/array, you should either write it as  for (i in 0..list.size-1) or use  until instead. Even though it’s most often used with  Ints, you can iterate over  Chars as well.\n // Iterate and print from i = 0 to i = 100  for (i in 0..100) { println(i) }  // Iterate from i = 0 to i = list.size-1  for (i in 0..list.size-1) { println(list[i]) }  // Iterate and print &#39;a&#39;, &#39;b&#39;, &#39;c&#39;, &#39;d&#39;  for (i in &#39;a&#39;..&#39;d&#39;) { println(i) }\n downTo() works like  .., except each iteration goes down a step rather than up one.\n // Iterate and print from i = 100 to i = 0  for (i in 100 downTo 0) { println(i) }\n  // Iterate and print 1, 3, 5, 7  for (i in 1..8 step 2) { println(i) }  // Iterate and print 8, 5, 2  for (i in 8 downTo 1 step 3) { println(i) }\n until() includes the start element, but not the end element. It’s my preferred way of iterating through a collection’s indices, because if you use the list’s size as the end you don’t have to worry about indices being out of bounds.\n // Iterate and print from i = 0 to i = 99  for (i in 0 until 100) { println(i) }  // Iterate and print elements from i = 0 to i = list.size-1  for (i in 0 until list.size) { println(list[i]) }\n indices returns an  IntRange representing a collection’s valid indices, and can be used similarly to  until().\n val list = listOf(&#39;a&#39;, &#39;b&#39;, &#39;c&#39;) println(list.indices)  // Prints 0..2  // Iterate and print elements from i = 0 to i = 2  for (i in list.indices) { println(list[i]) }\n    This is something you don’t see that often in real projects, but appears all the time in interview problems — grids, mazes, graphs, and more may all be represented using a 2D array.\n Here’s my preferred way to iterate through a 2D array or list using  until:\n if (grid.isEmpty()) return for (i in 0 until grid.size) {  for (j in 0 until grid[0].size) {  println(grid[i][j])  } }\n  if (grid.isEmpty()) return for (i in grid.indices) {  for (j in 0 until grid[0].size) {  println(grid[i][j])  } }\n  Maps are also common in interview problems, especially as a good way to store information when a list isn’t enough.\n If you need to iterate through key-value pairs, you can either use a  for loop or a  forEach loop. This is up to personal preference.\n // Iterate through entries using a for-loop  for ((key, value) in map) {  println(&#34;$key = $value&#34;) }  // Iterate through entries using forEach()  map.forEach { (key, value) -&gt; println(&#34;$key = $value&#34;) }\n If you only need to iterate through the keys, you can use the  keys val to get a  Set of all the keys in the map, and iterate through those.\n  Similarly, if you only need to iterate through the values, the  values val will return a  Set of all the values in the map.\n   PriorityQueues are helpful for when you want elements to be processed based on their priority. They’re often used in interview problems that ask for K-th largest, K-th smallest, top K frequent, etc. I covered them in more detail in Part 1, but here’s a reminder of what iterating through one looks like.\n val pq = PriorityQueue&lt;Int&gt;(listOf(2, 1, 3))  // pq will be empty after 3 iterations  while(pq.isNotEmpty()) {  println(pq.poll())  // prints 1, then 2, then 3  }\n That’s it for part 4! Here’s the  link to the cheatsheet covering all 5 parts again.", "posttime": "2020-11-05 20:06:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "部分,interviews", "title": "采访用柯特林.第4部分：迭代", "title_en": "Kotlin for Interviews – Part 4: Iteration", "transed": 1, "url": "https://blog.kotlin-academy.com/kotlin-for-interviews-part-4-iteration-b176dee4f1ae", "via": "", "real_tags": ["部分"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加入Slack以获取帮助或更多信息", "note_en": "Join the Slack  for help or more info", "posttime": "2020-11-05 20:06:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编写,scriptable,slack", "title": "爪子-可编写脚本的语音/凝视输入", "title_en": "Talon – scriptable voice/gaze input", "transed": 1, "url": "https://talonvoice.com", "via": "", "real_tags": ["编写", "slack"]}]