[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1001778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有五个新宏可以帮助生成目录。所有用于目录的条目必须用.XSand.XE对括起来，可选的.XAmacros用于附加条目。.XS或.XA的第一个参数指定要打印在一行点之后的页码。如果第一个参数为NO，则不会打印页码，就像章节及其第一个子节在同一页上开始时一样。第二个参数指定缩进级别；如果缺少此参数，则当前缩进保持有效。最后，.PX宏打印出目录。如果您忘记了，不会发生任何事情。以下是典型输入和输出文本的示例：.XS II(开始)介绍。XA 1第一章：历史。XA no第二章：证据.XA 24 5(缩进5个字符)启发式假设.XA 35实验数据.XA 56 0(返回原始缩进)结论.XE(结束).PX(打印输出)CONTENTS简介表格.。第三章第一章：历史.。1第2章：证据启发式假设.。24实验数据.。35结论.。五十六。\n还可以在整个文本正文中使用.XS和.XE对自动收集目录，包括自动生成的页码。例如，您可能想要为每个部分标题编制索引，在这种情况下，您可以执行以下操作：如果您使用的是.NH宏生成的编号标题，并且希望目录中包含标题编号，请使用此格式：\\*(输出目录时，SN字符串将替换为标题编号，例如：TableOf Contents1。原生动物门.。12.Porifera门.。63.。腔肠动物门.。10个。\n或者，您可以在纸张末尾使用.TC宏(而不是.PX)打印出目录。如果您忘记了它，则不会发生任何事情。这两个宏几乎完全相同，但.TC会导致分页符，并将页码重置为I(小写罗马数字1)。(因此，第I页将显示在文档的最后一页之后，但不会阻止您将其移到最前面。)。\n请注意，这种自动索引方法只能在一次运行中正确工作。在排字机上，一次运行被限制在35页以内。\n如果您没有另外请求，nroff将生成单列格式的输出。通过在输入文件中放置命令.2C，输出将以双列格式开始打印。每列的宽度将是单列格式下一行长度的7/15，而栏间距或列之间的间距将是整个行长的1/15。要返回单列，请使用命令。1C。从双列切换时，请使用命令.1C从双列格式切换到单列格式。要返回到单列格式，请使用命令.1C。从双列格式的行长的7/15的宽度，以及列之间的间距将是整个行长的1/15。要返回单列，请使用命令.1C。从双列格式切换到单列格式时，每列的宽度将是下一行长度的7/15。\n这将导致输出的格式设置为页面上可以容纳的指定宽度的列数。列宽可以用任何刻度单位指定，但如果没有标明单位，则该设置将被理解为若干个EN。(刻度单位在第2.15节中讨论。)不指定任何列宽的.MC表示与.2C相同的含义。列数的任何更改(从1到更大的列数除外)都会导致跳到新页。\n-ms软件包提供了用于将文本块全部保留在一页上的宏。有两种方法可以做到这一点。标准保持以宏.KS开始，以.KE结束。如果当前页面上有足够的空间容纳这两个宏之间包含的材料，nroff会在那里打印它；如果没有，它会跳到下一页并在那里打印。另一种类型称为浮动保持，&#34；以.KF开头，以.KE结束。如果有必要跳到新页面打印此材料，nroff首先用输入文件中Keep之后的普通文本填充当前页面。这可避免在页面底部保留保留材料之前的空白。浮动Keep最常用于定位表格或不属于严格文本逻辑顺序的某些其他类型的材料。无论使用哪种样式的Keep，都必须以.KE结尾。宏/转移溢出。&#34；\n在双栏或多栏格式中，KEEP宏会尝试将所有保留的素材放在同一栏中。如果包含在KEEP道岔中的素材需要超过一页空间或多栏格式的一栏，则它将从新的页面或栏开始，然后直接转到下一页或栏。\n有时需要设置某些文本的格式而不填充和调整它-例如，项目列表或诗节。要关闭填充以使每一个输出行精确对应于一行输入，请使用命令.DS开始材料，使用.de结束材料。默认情况下，此材料从左边距缩进PI值。以下是一些输入示例：\n请注意，在上面的示例中，每行都是单独居中的。要生成作为页面上的一部分居中的左调整块，请使用.DS B开始：\n另一种可能是.DS I，其含义与普通.DS相同。您可以通过在这两个构造中的任何一个后面包括另一个参数来指定缩进量；.DS I 3或.DS 3开始显示时从页边距缩进3 ns。\n上述任何显示都会自动放入标准保留中。与普通保留文本块一样，如果当前页面上没有足够的显示空间，则会保存整个显示并放到下一页上。如果您不想将显示保留在单个页面上，并且希望避免文本中出现难看的间隙，或者如果您的显示比一页长，请使用显示命令.BD、.CD、.ID或.LD，而不是.DS B、.DS C、.DS I，请使用显示命令.BD、.CD、.ID或.LD，而不是使用.DS B、.DS C、.DS I。这两个命令也必须用.de关闭才能结束任何类型的显示。未能包括结束命令会导致类似于无法关闭脚注或保留而导致的问题。(=。\nMS为加快文档格式化所做的一件事就是建立标准的页面布局样式。在用-ms制作的论文中，文本行的默认长度为6英寸；段落第一行的缩进为5英寸；页码打印在每页后每页的顶部中心；页眉和页脚边距为1英寸宽。这些功能中的许多功能都由-ms作为变量存储在计算机内存中的值控制。这使得这成为可能。\n存储这些值的存储位置称为数字寄存器和字符串寄存器。前者保存数字值，后者保存字符串。数字和字符串寄存器的名称类似于命令的名称，长度为一或两个字符。例如，行长的值存储在名为LL的数字寄存器中。除非您发出命令更改寄存器LL中存储的值，否则它将包含由-ms分配给它的标准值或缺省值(6英寸)。在寄存器LL中存储这些值的存储位置称为数字寄存器和字符串寄存器。前者保存数字值，后者保存字符串。数字和字符串寄存器的名称类似于命令的名称，长度为一两个字符。例如，行长的值存储在一个名为LL的数字寄存器中。\n要更改尺寸(如线长度)的缺省值，可重置相关的编号寄存器。为此，请使用nroff命令.nr，如下所示：\n第一个参数是数字寄存器的名称，第二个参数是分配给它的值。值可以表示为整数，也可以包含小数。设置数字寄存器的值时，几乎总是需要在值之后紧跟一个缩放单位。在上面的示例中，&#34；i&#34；由于刻度单位会让nroff知道您的意思是5英寸，而不是其他距离单位的5英寸。但是点大小(PS)和垂直间距(VS)寄存器是此规则的例外：通常应将一个值指定为点数，而不应指明刻度单位。例如，要将垂直间距从12点(单倍间距)更改为24点(双倍间距)，请使用以下命令：\n在要将垂直间距设置为大于半英寸(大于36磅)的特殊情况下，请在设置VS寄存器时包括一个刻度单位。表1解释了nroff和troff可用的测量单位。\n+--+|表1||诺洛夫和特洛夫计量单位|+。-+|__表示__||单位abbr Nroff Troff||point p 1/72英寸1/72英寸||pica P 1/6英寸1/6英寸||em m宽度等于||当前字体大小||中的||个|点数||en n半个em|字符||垂直v间距，已测量||基线||英寸i英寸||厘米c厘米||机器u 1/240英寸1/432英寸||单位|+--+。\n单位point、pica、em和en是传统排版中使用的度量单位。垂直空间单位也对应于排版术语&#34；LEADING，&#34；指的是从一行文字的基线到下一行基线的距离。Em和en特别有趣，因为它们与当前使用的字体大小成比例(通常表示为几个点)。Aem是等于字体大小中的点数的距离(大致等于。这些单位便于指定尺寸，如缩进。在troff中，em和en有其传统含义--距离的一个em等于两个en。另一方面，对于nroff，em和en都表示相同的距离量，即一个打字字符的宽度。在troff中，em和en有其传统含义--一个em距离等于两个en。另一方面，em和en都表示相同的距离量，即一个打字字符的宽度。在nroff中，em和en都表示相同的距离量，即一个打字字符的宽度。在troff中，em和en有其传统含义-距离的一个em等于两个en。\n机器单位是一种特殊的单位，几乎所有的尺寸在存入存储器时都会通过nroff和troff在内部转换为该单位。尽管存在这样的测量单位，但它永远不会用来修改默认尺寸。\n数字寄存器需要记住的一个重要方面是，对一个寄存器(如LL)的更改不会立即改变输出中该点的相关维度。相反，在行长的情况下，更改发生在下一段的开头，其中-ms将各种维度重置为相关的数字寄存器的当前值。表2为每个寄存器列出了对寄存器的更改实际生效的位置。\n如果立即需要效果(例如，如果您需要更改段落中间的垂直间距)，则必须使用nroff命令.vs，该命令直接控制垂直间距。该命令在输入文件中出现的位置生效。但是，由于它不会更改VSregister，因此其效果仅持续到下一段落的开头。一般规则是：要进行永久性更改，或者更改将持续多个段落直到您再次更改它的值，请更改。使用nroff命令。(请参阅&#34；欲了解更多信息，请参见第7节。)如果你希望改变既立竿见影又持久，那就两者兼而有之。\n+--+|表2||-ms编号寄存器摘要|+。-+|注册表。采用||名称控制生效默认值||PS点大小下一段。10||与下一段垂直间距相比。12||所有行长下一段。6i||文本||LT下一页行长与页标题LL||相同||FL下一FS 5.5i行长||脚注||PD垂直距离下一段。.3v(特罗夫)||1v(特罗夫)||下一个DS的DD垂直距离。5v(特罗夫)||显示器周围的1v(特罗夫)||PI段。缩进下一段。5N||QI左、右下一QP 5N||QP缩进||FI脚注缩进下一FS 5N||PO下一页偏移量~1i(Troff)||0(Nroff)||HM页眉边距下一页1i||FM下一页页脚边距1i||下一页前M1间距HM/2||标题||下一页后M4空间FM/2||标题|+。-+。\n在设置缺省页面布局时，-ms提供了六个字符串寄存器来存储要打印在页面顶部和底部的连续标题。与数字寄存器一样，字符串寄存器也是计算机内存中的存储位置；它们的不同之处在于它们的内容是字符串而不是数字值。除第一页(大概有标题)之外，每页顶部的三毫秒字符串寄存器名称是LH、CH和RH。它们表示打印位置的左侧、中部和右侧\n对于nroff输出，默认值ch是由连字符括起来的当前页码；cf包含计算机提供的当前日期。对于troff，ch值也包含页码，但cfis为空。对于nroff和troff，其他四个寄存器默认情况下都是空的。您可以使用命令.ds(&#34；定义字符串&#34；)为字符串寄存器赋值。例如：\n这会导致字符串&#34；NOT FOR PUBLICATION&#34；打印在每页的右下角。不需要用双引号将参数括起来；这是参数内空格规则的另一个例外。要删除字符串寄存器，只需使用.rm命令即可。例如，要清除字符串寄存器CH，使后续页面的中心标题为空，请使用以下命令：\n在页眉和页脚中，页眉和页脚都是指nroff的自动页面计数器的特殊符号。如果要在页码的两侧使用连字符，请将它们放在命令中%的任意一侧。\n还可以生成在偶数页和奇数页上不同的自定义页眉和页脚。.OH和.EH宏定义奇数和偶数页眉，而.OF和.EF定义奇数和偶数页脚。这四个宏的参数必须包含在一组四个撇号中。例如：\n在本例中，标题(此处的斜体，请参阅第2.4节)通过括在第一个和第二个撇号之间的方式打印在奇数页的左侧。中间区域留空，因为不会在中央页眉区域打印任何内容。请注意，这两个标记是单撇号，而不是双引号。页码指定(斜体，因为它在字体更改范围内)出现在第三和第四个撇号之间的右侧。左侧的任何变体。通过调整由四个撇号分隔的区域内的标题部分，可以创建右侧位置。重要的是，不要在标题文本中使用撇号，除非您在标题的左、中和右部分周围使用不同的分隔符。您可以使用任何字符作为分隔符，只要它不使用&#39；在.OH、.EH、.OF或.EF的参数中，不会出现在其他位置。标题长度的默认限制是9个单词。如果需要更多内容，请将整个标题参数括在双引号中，也包括四个撇号。\n另一个涉及页眉和页脚的新功能是.TM宏，用于根据伯克利标准打印论文。(此论文模式非常类似于-me中的.th宏)。它会自动将页码放在每页的右上角，并对第一页进行编号。此外，它会取消中间页脚中的日期，并将除引号、显示和保留之外的所有内容加倍。它应该用在组成论文的每个文件的顶部。作为副产品，.TM的调用定义了章节标题的.CT宏。每当新章节开始时，使用此宏会将页码从右页眉移动到中心页脚。与之类似，即使没有论文模式也可以使用.P1(P ONE)宏，打印第1页的页眉(包括页码)。如果要使用罗马数字页码，请将该行放在文件的开头：\n在引用页码的任何行中-其中，例如要放置页眉或页脚-使用\\\\n(PN而不是%)。要返回到阿拉伯数字并从第1页开始新的一节，请插入以下行：\n如果设置字符串和数字寄存器的值的命令要从输出的第一页起生效，则它们应该放在输入文件的开头或附近，在开始宏之前(而开始宏必须在第一行文本之前)。(初始化或开始宏可以是标题宏，也可以是段落或小节标题宏之一。这一点在第1.3节中讨论。输入文件的示例开始在第6节中显示。)因为开始宏会导致所谓的伪。对于纸张的第一页(包括该页的页首处理)，尤其重要的是，在过渡到要生效的页面之前，应放置更改页面偏移量、上下边距、PO、HM和FM编号寄存器以及页眉字符串寄存器的值的命令。附录B列出了可以设置uPA文件的可能命令和可以启动文件的命令。\n某些外语重音符号已预定义为-ms包中的字符串。要使用它们，请在要强调的字母之前放置对重音字符串的引用。在输入文本中，字符串引用位于字母&#34；e&#34；之前，例如：\n以下是DEFAULT提供的七个重音字符串的列表及其打印形式的示例：\n输入输出输入输出输出\\*&#39；eé\\*~aã\\*`eè\\*：uü\\*，cç\\*ce[对不起，无法在HTML中做--JRP]\\*.Eê.。\n现在有大量额外的外国重音符号以及上面七个变音符号的更好定义可供使用。要使用它们，命令.AM必须包含在文档的开头。与默认的-ms重音符号不同，新的重音字符串应该放在要强调的字母之后。但是，某些外语结构完全由重音字符串组成。请小心区分下表中的哪个是哪个：[对不起，其中一些是&#39；\n重音符号输入output--急性重音e*&#39；éGrave accent e\\*`èspirflex o\\*ôcedilla c\\*，çtilde n\\*~ñproblem\\*？感叹\\*！元音u*：üdigraph s 8？hacek c*v马克龙a*_下点s\\*。o-斜杠o*/øangstrom a*o­yogh KNI\\*(Th？thorn\\*(TH Eth\\*(D-Ig-Eth\\*(d-Ika Hooko\\*Q ae Ligature\\*(aeæAE Ligature\\*(Ae？OE Ligature\\*(OE OLigature\\*(Oe？Oe Ligature\\*(Oe。\n如果.am不在文件顶部，这些新的变音符号将不会出现或放置在错误的字母上。如果.am位于文件的顶部，则默认的-ms重音符号将放置在错误的字母上。选择一组或另一组并一致使用。\n为了帮助生成可以使用nroff和troff正确格式化的文本，有一些新的字符串定义为这两个格式化程序中的每一个程序定义了破折号和引号。\\(*-字符串将在nroff中生成两个连字符，但在troff中它将生成一个em破折号--就像这样。\\*q和\\(*U字符串将在troff中生成开始引号和结束引号，但在nroff中生成直接的双引号。(在排版中，双引号。\nms宏组成了一个软件包，因为它们旨在满足大多数格式化需求，并且不需要学习关于更多组件的大量详细信息。\n..", "note_en": "There are five new macros to help produce a table of contents.All entries intended for the table of contentsmust be enclosed in  .XSand  .XEpairs, with optional  .XAmacros for additional entries.The first argument to  .XS or .XA specifies the page number,to be printed after a line of dots.If this first argument is  no, no pagenumber will be printed, as when a chapter and itsfirst subsection begin on the same page.The second argument specifies the indentation level;if this argument is missing,the current indentation stays in effect.Finally, the  .PXmacro prints out the table of contents.If you forget it, nothing will happen.Here is a sample of typical input and output text: .XS ii  (Start)Introduction.XA 1Chapter 1: History.XA noChapter 2: Evidence.XA 24 5  (indent 5 ens)Heuristic Assumptions.XA 35Experimental Data.XA 56 0  (go back to original indentation)Conclusions.XE  (End).PX  (Print out)  Table of ContentsIntroduction ..................... iiChapter 1: History ............... 1Chapter 2: Evidence Heuristic Assumptions ........ 24 Experimental Data ............ 35Conclusions ...................... 56\nThe  .XS and  .XEpairs may also be used throughout the body of a textto collect a table of contents automatically,including automatically generated page numbers.For example, you might want to index each section header,in which case you would do this: If you are using numbered headings produced with the .NH macro, and you want the headingnumbers included in thetable of contents, use this format: The \\*(SN string will be replaced withthe number of the heading when the table of contents is output,for example: Table of Contents1. Phylum Protozoa ................... 12. Phylum Porifera ................... 63. Phylum Coelenterata ............... 10\n Or you can use the  .TCmacro (rather than  .PX)at the end of the paper to print out the table of contents.If you forget it, nothing will happen.The two macros are almost identical, but .TC causes a page break and resets thepage number to i (lower case Roman numeral one).(Page i will thus appear after the last page of thedocument, but nothing prevents you from shuffling itup to the front.)\n Note that this automatic indexing method will onlywork correctly within a single run.On the typesetter, a single run is limited to 35 pages.\n  If you do not request otherwise, nroff produces output in single-column format.By placing the command  .2Cin your input file, the outputis printed in double-column format beginningat that point.Each column will have a width 7/15 that of thetext line length in single-columnformat, and the &#34;gutter,&#34; or gap between columns,will be 1/15 of the full line length.To return to single-column, use the command .1C.Switching from double to single-column always causesa skip to a new page.\n   This will cause output to be formatted in as many columnsof the specified width as will fit on the page.The column-width may be specified in any unitof scale, but if no unit is indicatedthe setting will be understood as a number of ens.(Units of scale are discussed in  section 2.15.)An  .MCwithout any column-width specification means the same thing as .2C. Any change in the number of columns,except from one to a larger number,causes a skip to a new page.\n  The  -ms package provides macros for keepinga block of text all together on one page.There are two ways of doing this.The standard &#34;keep&#34; is begun with the macro .KS and ended with .KE.If there is enough room on the current page for thematerial contained between these two macros, nroff prints it there; if not,it skips to the next page and prints it there instead.The other type, called a &#34;floating keep,&#34;is begun with  .KFand ended with  .KE.If it is necessary to skip to a new page toprint this material, nroff first fills the current page with theordinary text that follows the keep in the input file.This avoids leaving blank space at the bottom of the pagepreceding the kept material.A floating keep is most often used for positioninga table or some other type of material not partof the strict logical sequence of text.Whichever style of keep you use,it is essential to end each one with .KE to complete the pair.Otherwise, the remainder of your text will be processed as a keep,and you will get a &#34;macro/diversion overflow.&#34;\n In double- or multi-column formats, the keep macrosattempt to place all the kept material in the same column.If the material enclosed within a keep turnsout to require more than a page of space,or more than a column in multi-column format,it will start on a new page or column and simplyrun over onto the following page or column.\n  Occasionally it is desirable to format some text withoutfilling and adjusting it-for example,a list of items or a stanza of poetry.To turn off filling so that each output linewill correspond exactly to one line of input,use the command .DS to start the material and .DE to end it.By default, this material is indented from the left marginby the value of PI.Here is some sample input:\n        Note that in the example above,each line is centered individually.To produce a left-adjusted block that iscentered as a piece on the page,use  .DS B to start:\n  Another possibility is  .DS I,which means the same thing as plain  .DS.You can specify the amount of indentation by includinganother argument after either of these constructions; .DS I 3 or  .DS 3begins a display to be indented 3 ens from the margin.\n Any of the displays described aboveis automatically put into a standard keep.As with ordinary blocks of kept text, if there is notenough room for the display on the current page,the entire display will be saved and put onto the next page.If you do not want to keep displays on a single page,and want to avoid unsightly gaps in the text,or if you have displays that are longer than a page,use the display commands  .BD, .CD,  .ID, or .LD, instead of .DS B,  .DS C, .DS I, or  .DS L,respectively.These commands also have to be turned off with  .DE to end any type of display.Failure to include the ending command causes problemssimilar to those caused by failure to close a footnote or a keep.\n  One of the things  -ms does to expeditedocument formatting is to establish a standardpage layout style.In papers produced with  -ms,the text line has a default length of six inches;the indentation of the first line of a paragraph isfive ens; the page number is printed at the top centerof every page after page one;and the header and footer margins are an inch wide.Many of these features are controlled by valuesstored by  -ms as variables in the computer&#39;s memory.This makes it possible to alter the default formatcharacteristics by changing the values that control them.\n The memory locations where these values are storedare called  number registersand  string registers.The former hold numeric values; the latter hold strings of characters.Number and string registers have names like those of commands,one or two characters long.For instance, the value of the line length isstored in a number register named  LL.Unless you give a command to change the value storedin register  LL,it will contain the standard or defaultvalue (6 inches) assigned to it by  -ms.\n  In order to change a dimension such as the line lengthfrom its default value,you can reset the associated number register.To do this, use the  nroff command .nr as follows:\n  The first argument is the name of a numberregister, and the second is the value being assigned to it.The value may be expressed as an integeror may contain a decimal fraction.When setting the value of a number register,it is almost always necessary to include a unit of scaleimmediately after the value.In the example above,the &#34;i&#34; as the unit of scale lets  nroffknow you mean five  inchesand not five of some other unit of distance.But the point size (PS) and vertical spacing (VS)registers are exceptions to this rule:ordinarily they should be assigned a value as a number of points without indicating the unit of scale.For example, to change the vertical spacing from 12 points(single spacing) to 24 points (double spacing),use the command:\n  In the unusual case where you want to set the verticalspacing to more than half an inch (more than 36 points),include a unit of scale in setting the  VS register.Table 1 explains the units ofmeasurement available with  nroff and  troff.\n +-----------------------------------------------------------+ | Table 1 | | Units of Measurement in Nroff and Troff | +-----------------------------------------------------------+ | __Meaning For__ | | Unit Abbr Nroff Troff | | point p 1/72 inch 1/72 inch | | pica P 1/6 inch 1/6 inch | | em m width of one distance equal | | character to number of | | points in the | | current typesize | | en n width of one half an em | | character | | vertical v amount of space in which each | | space line of text is set, measured | | baseline to baseline | | inch i inch inch | | centimeter c centimeter centimeter | | machine u 1/240 inch 1/432 inch | | unit | +-----------------------------------------------------------+\n The units  point,  pica,  em,and  en are units of measurement used traditionally in typesetting.The  vertical spaceunit also corresponds to the typesetting term &#34;leading,&#34;referring to the distance from the baselineof one line of type to the baseline of the next.Em and en are particularly interestingin that they are proportional to the type size currently in use(normally expressed as a number of points).An em is the distance equal tothe number of points in the type size(roughly the width of the letter &#34;m&#34; in that point size),while an en is half that (about the width of the letter &#34;n&#34;).These units are convenient for specifying dimensionssuch as indentation.In  troff, em and en have their traditional meanings--one em of distance is equal to two ens.For  nroff, on the other hand,em and en both mean the same quantity of distance,the width of one typewritten character.\n The  machine unitis a special unit to which almost all dimensions are converted by nroff and  troff internallywhen storing them in memory.Although such a unit of measurement exists, it would never be usedto modify default dimensions.\n One important aspect of number registers to remember is thata change to a register such as  LLdoes not immediately change the related dimensionat that point in the output.Instead, in the case of the line length,the change takes place at the beginning ofthe next paragraph, where  -ms resetsvarious dimensions to the current values of therelated number registers.Table 2 lists, for each register, the placeat which a change to the register actually takes effect.\n If the effect is needed immediately--if, for instance,you need to change the vertical spacing in the middle of a paragraph--you must use the  nroff command .vs,which controls the vertical spacing directly.It takes effect at the place where it occursin your input file.Since it does not change the  VSregister, however,its effect lasts only until the beginning of thenext paragraph.As a general rule:to make a permanent change, or one that will lastfor several paragraphs until you want to change it again,alter the value of the  -ms register.If the change must happen immediately, somewhereother than the point shown in Table 2,use the  nroff command.(See &#34;For More Information,&#34;  section 7.)If you want the change to be both immediate and lasting,do both.\n +-----------------------------------------------------------+ | Table 2 | | Summary of -ms Number Registers | +-----------------------------------------------------------+ | Reg. Takes | | Name Controls Effect Default | | PS point size next para. 10 | | VS vertical spacing next para. 12 | | LL line length next para. 6i | | of text | | LT line length next page same as LL | | of page titles | | FL line length next FS 5.5i | | of footnotes | | PD vertical distance next para. .3v (troff) | | 1v (nroff) | | DD vertical distance next DS .5v (troff) | | around displays 1v (nroff) | | PI para. indent next para. 5n | | QI left and right next QP 5n | | indent for QP | | FI footnote indent next FS 5n | | PO page offset next page ~1i (troff) | | 0 (nroff) | | HM header margin next page 1i | | FM footer margin next page 1i | | M1 space before page next page HM/2 | | titles | | M4 space after bottom next page FM/2 | | titles | +-----------------------------------------------------------+\n  In setting up the default page layout, -ms provides for six string registersto store the running titles to be printed at tops andbottoms of pages.Like number registers, string registers arestorage locations in the computer&#39;s memory;they differ in that their contentsare strings of characters rather than numeric values.The three  -ms string register namesfor the top of every page other than the first,which presumably has a title, are LH,  CH,and  RH.They indicate the printed positions of left, center, andright.The string registers for the bottom of the page, including the first, are LF,  CF,and  RF,\n For  nroff output, the default value of CHis the current page numbersurrounded on either side by hyphens; CFcontains the current date as supplied by the computer.For  troff,  CHalso contains the page number but  CFis empty.The other four registers are empty by defaultfor both  nroff and  troff.You can use the command .ds(&#34;define string&#34;) to assign a value to a string register.For example:\n  This causes the character string &#34;Not for publication&#34;to be printed at the bottom right of every page.No double-quote marks are needed to enclose the argument;this is another exception to the rule about spaces within arguments.In order to remove a string register,simply use the  .rm command.For instance, to clear string register CH,making the center header blank on following pages,use the command:\n    In page titles, both headers and footers, &#34;%&#34; isa special symbol referring to  nroff&#39;s automatic page counter.If you want hyphens on either side of the page number,place them on either side of the % in the command.\n It is also possible to produce custom headers and footersthat are different on even and odd pages.The  .OH and .EH macros define odd and even headers, while .OF and  .EFdefine odd and even footers.Arguments to these four macros must be enclosedwithin a set of four apostrophes.For example:\n  In this example the title (for the italicizing here, see section 2.4)is printed on the left side of odd pages by being enclosed betweenthe first and second apostrophe.The center area is left blank because nothingis to be printed in the center header area.Note that these two marks are single apostrophe marks,not double quotation marks.The page number designation(italicized because it is within the font changes)appears on the right side between the third and fourth apostrophes.Any variations of the left, center, and right positions can bemade by adjusting the parts of a title within areasdelimited by the four apostrophes.It is important not to use an apostrophe in the header text,unless you use a different delimiteraround the left, center, and right portions of the title.You can use any character as a delimiter,provided it doesn&#39;t appear elsewhere in the argument to .OH,  .EH,  .OF,or  .EF.The default limit to title length is nine words.If you need more, enclose the entire title argumentin double quotation marks, also including the four apostrophes.\n Another new feature that involves page headers and footersis the  .TMmacro for printing theses according to Berkeley standards.(This thesis mode is much like the  .thmacro in -me).It will automatically put page numbersin the upper right-hand corner of every page,and number the first page.In addition it suppresses the date in the center footer,and doublespaces everything except quotes, displays, and keeps.It should be used at the top of each file making up your thesis.As a by-product, the invocation of  .TMdefines the  .CTmacro for chapter titles.Using this macro whenever a new chapter begins willmove the page number from the right header to the center footer.In a similar way the  .P1(P one) macro,which can be used even without thesis mode,prints the header (including page number) on page 1.If youwant roman numeral page numbering,put this line at the beginning of the file:\n  And in any line referring to the page number-wherein the header or footer to put it, for example-use\\\\n(PN rather than %.To go back to arabic numeralsand start a new section with page 1, insert the lines:\n   If commands that set the values of string and number registersare meant to take effect as of the first page of output,they should be placed at or near the beginning of the input file,before the beginning macro(which, in turn, must precede the first line of text).(The initializing or beginning macro can be thetitle macroor one of the paragraph or section heading macros.This point is discussed in  section 1.3.Sample beginnings of input files are shown in  section 6.)Since the beginning macro causes what is calleda &#34;pseudo page break&#34; onto page one of the paper,including the top-of-page processing for that page,it is particularly important that commandschanging the value of the page offset, top and bottom margins, the PO,  HM,and  FMnumber registers, and the page header string registers,be placed before the transition onto the pagewhere they are intended to take effect. Appendix B gives a list ofpossible commands that can set upa file and those that can start a file.\n  Certain foreign-language accent markshave been predefined as strings in the  -ms package.Use them by placing a reference to the accent stringbefore the letter being accented.The string reference \\*&#39;placed immediately before the letter &#34;e&#34; in input text,as in:\n    Here is a list of the seven accent strings provided by defaultwith examples of their printed form:\n Input Output Input Output \\*&#39;e é \\*~a ã \\*`e è \\*:u ü \\*,c ç \\*Ce [sorry, can&#39;t do in HTML--jrp] \\*.e ê\n There are now a large number of additional foreign accent marksas well as better definitions of the seven diacritical marksabove available for use.To use them, the command  .AMmust be included at the beginning of your document.Unlike the default  -ms accent marks,the new accent strings should be placed after the letter being accented.Certain foreign-language constructs, however,are entirely made up of the accent string.Be careful to distinguish which is which in the following list:[Sorry, some of these aren&#39;t available in HTML--jrp.]\n accent mark input output----------------------------------------------------------------- acute accent e\\*&#39; é grave accent e\\*` è circumflex o\\*^ ô cedilla c\\*, ç tilde n\\*~ ñ question \\*? exclamation \\*! umlaut u\\*: ü digraph s \\*8 ß hacek c\\*v macron a\\*_ underdot s\\*. o-slash o\\*/ ø angstrom a\\*o å yogh kni\\*3t Thorn \\*(Th Þ thorn \\*(th þ Eth \\*(D- Ð eth \\*(d- ð hooked o \\*q ae ligature \\*(ae æ AE ligature \\*(Ae Æ oe ligature \\*(oe OE ligature \\*(Oe\n These new diacritical marks will not appear or will beplaced on the wrong letter if .AMis not at the top of your file.If .AM is at the top of your file,the default  -ms accent marks will be placedon the wrong letter.Choose one set or the other and use it consistently.\n As an aid in producing text that will format correctlywith both  nroff and  troff,there are some new string definitions that define dashesand quotation marks for each of these two formatting programs.The \\(*- string will yield two hyphens in  nroff,but in  troff it will produce an em dash--like this one.The \\*Q and \\(*U stringswill produce open and close quotes in  troff,but straight double quotes in  nroff.(In typesetting, the double quote characteris traditionally considered bad form.)\n  The  -ms macros make up a package in the sense thatthey are designed to meet most formatting needs,and to make it unnecessary to learn a large amount of detailabout the more comp\n......", "posttime": "2020-05-12 15:06:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ms,text,打印", "title": "使用-ms宏设置UNIX文本格式(1984)", "title_en": "UNIX Text Formatting Using the -ms Macros (1984)", "transed": 1, "url": "https://www.hactrn.net/ietf/rfcgen/textms.html", "via": "", "real_tags": ["ms", "text", "打印"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001777, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇博客讨论了一个老问题，图像格式解析器中的漏洞，在一个新的(呃)上下文中：在流行的Messenger应用程序中的无交互代码路径上。本研究的重点是Apple生态系统及其提供的图像解析API：ImageIO框架。在图像解析代码中发现了多个漏洞，报告给了Apple或各自的开源图像库维护人员，并随后进行了修复。在这项研究中，为封闭源码二进制文件实现了一种轻量级、低开销的引导模糊方法，并与本文一起发布。\n重申一点重要的是，本博客中描述的漏洞可以通过流行的信使访问，但不是其代码库的一部分。因此，修复它们不是信使供应商的责任。\n在对流行的Messenger应用程序进行反向工程时，我在无需用户交互即可访问的代码路径上遇到了以下代码(手动反编译为objc并略微简化)：\n此代码对作为来自发送方的传入消息的一部分接收的二进制数据进行解密，并从该数据实例化一个UIImage实例。然后，UIImage构造函数将尝试自动确定图像格式。然后，将接收到的图像传递给以下代码：\n此代码的目的是呈现输入图像的较小尺寸版本，以用作用户通知中的缩略图。不出所料，类似的代码也可以在其他Messenger应用程序中找到。本质上，上面所示的代码会将Apple的UIImage图像解析和CoreGraphics图像渲染代码变成0click攻击面。\n从开发针对iMessage漏洞的攻击中获得的一个见解是，如果满足以下前提条件，则很可能会使用所描述的技术利用内存损坏漏洞进行攻击：\n在这种情况下，例如，该漏洞可以用来破坏指向objc对象(或类似对象)的指针，然后构造一个崩溃的预言来绕过ASLR，然后获得代码执行。\n在当前的攻击场景中，所有的前提条件都得到了满足，从而促使人们对暴露的图像解析代码的健壮性进行了一些研究。查看UImage的文档可以发现这样一句话：“您使用图像对象来表示各种类型的图像数据，UIImage类能够管理底层平台支持的所有图像格式的数据”。因此，下一步是准确确定底层平台支持哪些图像格式。\n传递给UIImage的图像数据的解析是在ImageIO框架中实现的。因此，可以通过对MacOS上的ImageIO库(/System/Library/Frameworks/ImageIO.framework/Versions/A/ImageIO或iOS上的DYLDSHARED_CACHE的一部分进行反向工程来枚举支持的映像格式)。\n在ImageIO框架中，每种受支持的图像格式都有一个专用的IIO_Reader子类。每个IIO_Reader子类都应该实现一个testHeader函数，当给定一个字节块时，该函数应该决定这些字节是否表示读取器支持的格式的图像。下面显示了LibJPEG阅读器的testHeader实现的示例实现。它只是测试输入的几个字节，以检测JPEG报头的魔力。\n因此，通过列出不同的testHeader实现，可以编译ImageIO库支持的文件格式列表。名单如下：\n虽然这个列表包含许多熟悉的格式(jpeg、png、gif、…)。还有许多相当异国情调的游戏(KTX和ASTC，显然用于纹理或AI：Adobe Illustrator Artwork)，还有一些似乎特定于苹果生态系统(ICNS用于图标，ATX可能用于Animojis)。\n对不同格式的支持也各不相同。有些格式似乎完全受支持，并且通常使用开源解析库来实现，这些解析库可以在MacOS上的/System/Library/Frameworks/ImageIO.framework/Versions/A/Resources中找到：libGIF.dylib、libJP2.dylib、libJPEG.dylib、libOpenEXR.dylib、libPng.dylib、libRadiance.dylib和libTIFF.dylib。对于处理最常见的情况，其他格式似乎只有基本的支持。\n最后，一些格式(如psd)似乎也支持进程外解码(在MacOS上，这是由/System/Library/Frameworks/ImageIO.framework/Versions/A/XPCServices/ImageIOXPCService.xpc)处理的，这可以帮助解析器中的沙盒漏洞。然而，似乎不可能在公共API中指定应该在进程内还是进程外执行解析，并且没有尝试更改默认行为。\n考虑到可用的图像格式范围很广，而且大多数代码都没有源代码可用，模糊处理似乎是显而易见的选择。\n选择使用哪种模糊和模糊方法并不是那么明显。因为大多数目标代码不是开源的，所以许多标准工具不能直接适用。此外，为了简单起见，我决定将模糊功能限制在一台Mac Mini上。因此，绒毛器应该：\n以尽可能少的开销运行，以充分利用可用的计算资源，并且。\n最后，我决定在洪福兹的基础上自己实现一些东西。模糊方法的思想大致基于这篇论文：全速模糊：通过覆盖率引导的跟踪减少模糊开销。\n枚举程序/库中每个基本块的起始偏移量。这是通过一个简单的IDAPython脚本完成的。\n在运行时，在模糊化过程中，用断点指令(Intel上的int3)替换每个未发现的基本块的第一个字节。覆盖位图中的原始字节和对应的偏移被存储在专用影子存储器映射中，该映射的地址可以根据修改的库的地址来计算，并且。\n检索出错地址并计算库中的偏移量以及影子存储器中相应条目的地址。\n由于只检测未发现的基本块，并且每个断点只触发一次，因此运行时开销很快接近于零。然而，应该注意的是，该方法仅实现了基本块覆盖，而不是例如由AFL使用的边缘覆盖，并且对于封闭源目标，这可以通过动态二进制插装来实现，尽管具有一些性能开销。因此，它将更加“粗粒度”，例如，将到同一基本块的不同过渡视为相等，而AFL则不同。因此，在迭代次数相同的情况下，此方法可能会发现较少的漏洞。我认为这是可以接受的，因为本研究的目标不是彻底发现所有漏洞，而是快速测试图像解析代码的健壮性并突出攻击向量。在任何情况下，彻底的模糊总是由具有源代码访问权限的维护人员执行得最好。\n通过修补honggfuzz的客户端工具代码并编写一个IDAPython脚本来枚举基本块偏移量，所描述的方法非常容易实现。补丁和IDAPython脚本都可以在这里找到。\n然后，Fuzzer从一个由大约700个种子图像组成的小语料库开始，涵盖了支持的图像格式，并运行了几个星期。最后，发现了以下漏洞：\nImageIO对libTiff的使用中存在错误，导致控制数据写入超过内存缓冲区末尾。没有为这个问题分配CVE，可能是因为在我们报告之前，苹果内部已经发现了这个问题。\n可能是PVR解码逻辑中的偏差-1错误，导致额外的像素数据行被写入超出输出缓冲器末端的边界。\nPVR解码器中的相关错误导致越界读取，可能与1974年P0问题具有相同的根本原因，因此分配了相同的CVE编号。\n最后一个问题有些特殊，因为它出现在与ImageIO捆绑在一起的第三方代码中，即OpenEXR库。由于该库是开放源码的，我决定将其单独模糊化。\nOpenEXR是“一种高动态范围(HDR)图像文件格式[.]。用于计算机成像应用“。解析器是用C和C++实现的，可以在GitHub上找到。\n如上所述，OpenEXR库通过Apple的ImageIO框架公开，因此通过苹果设备上各种流行的信使应用程序暴露为0click攻击面。虽然我还没有进行更多的研究来支持这一说法，但攻击表面很可能并不局限于即时通讯应用程序。\n由于该库是开源的，所以“传统的”引导模糊更容易执行。我使用了一款谷歌内部的、覆盖导向的模糊器，在大约500个内核上运行了大约两周。模糊器以使用llvm的SanitizerCoverage的边缘覆盖为导向，通过使用常见的二进制突变策略对现有的图像进行突变，并从一组大约80张现有的openexr图像作为种子开始生成新的输入。\n发现了8个可能的独特漏洞，并将其作为P0问题1987报告给OpenEXR维护人员，然后在2.4.1版本中进行了修复。下面对它们进行简要总结：\n导致std：：Vector被读出边界的错误。之后，调用代码将写入此向量的元素槽，因此可能会损坏内存。\n一种越界memcpy，该memcpy正在读取越界数据，然后可能也会将其写入越界。\n堆栈上的越界读取，可能是由于以前覆盖堆栈上的字符串空终止符时出现按一取一的错误。\n有趣的是，ImageIO Fuzzer最初发现的崩溃(1988年版)似乎无法在上游OpenEXR库中重现，因此直接报告给了Apple。一种可能的解释是，苹果发布了一个过时版本的OpenEXR库，在此期间，该漏洞已被上游修复。\n媒体格式解析仍然是一个重要的问题。其他研究人员和供应商建议也证明了这一点，以下两点立即浮现在脑海中：\n当然，这表明输入解析器的持续模糊测试应该在供应商/代码维护人员端进行。此外，允许像ImageIO这样的库的客户端限制允许的输入格式，并有可能选择进程外解码，这有助于防止利用漏洞。\n在信使端，一种建议是通过将接收器限制为少量受支持的图像格式(至少对于不需要交互的消息预览)来减少攻击面。在这种情况下，发送方随后会在将任何不支持的图像格式发送给接收方之前对其进行重新编码。在ImageIO的情况下，这将把攻击面从大约25种图像格式减少到几种或更少。\n这篇博客文章描述了图像解析代码作为操作系统或第三方库的一部分，最终如何通过流行的信使暴露于0click攻击面。对暴露的代码进行模糊处理发现了许多新的漏洞，这些漏洞已被修复。很可能，只要付出足够的努力(以及由于自动重新启动服务而允许的攻击尝试)，某些已发现的漏洞就可以在0click攻击方案中用于RCE。不幸的是，其他错误也很可能仍然存在或将在未来引入。因此，建议在操作系统库(在本例中为ImageIO)和Messenger应用程序(通过限制接收器上可接受的图像格式的数量)中对该代码和类似的媒体格式解析代码进行持续模糊测试，并积极减少攻击面。", "note_en": "This blog post discusses an old type of issue, vulnerabilities in image format parsers, in a new(er) context: on interactionless code paths in popular messenger apps. This research was focused on the Apple ecosystem and the image parsing API provided by it: the ImageIO framework. Multiple vulnerabilities in image parsing code were found, reported to Apple or the respective open source image library maintainers, and subsequently fixed. During this research, a lightweight and low-overhead guided fuzzing approach for closed source binaries was implemented and is released alongside this blogpost.\n   To reiterate an important point, the vulnerabilities described throughout this blog are reachable through popular messengers but are not part of their codebase. It is thus not the responsibility of the messenger vendors to fix them.\n    While reverse engineering popular messenger apps, I came across the following code (manually decompiled into ObjC and slightly simplified) on a code path reachable without user interaction:\n          This code decrypts binary data received as part of an incoming message from the sender and instantiates a   UIImage  instance from it. The UIImage constructor will then try to determine the image format automatically. Afterwards, the received image is passed to the following code:\n            The purpose of this code is to render a smaller sized version of the input image for use as a thumbnail in a notification for the user. Unsurprisingly, similar code can be found in other messenger apps as well. In essence, code like the one shown above turns Apple’s UIImage image parsing and CoreGraphics image rendering code into 0click attack surface.\n   One of the insights gained from   developing an exploit for an iMessage vulnerability  was that a memory corruption vulnerability could likely be exploited using the described techniques if the following preconditions are met:\n      In that case, the vulnerability could for example be used to corrupt a pointer to an ObjC object (or something similar), then construct a crash oracle to bypass ASLR, then gain code execution afterwards.\n   All preconditions are satisfied in the current attack scenario, thus prompting some research into the robustness of the exposed image parsing code. Looking into the   documentation of UImage , the following sentence can be found: “You use image objects to represent image data of all kinds, and the UIImage class is capable of managing data for all image formats supported by the underlying platform”. As such, the next step was determining exactly what image formats were supported by the underlying platform.\n      Parsing of image data passed to UIImage is implemented in the ImageIO framework. As such, the supported image formats can be enumerated by reverse engineering the ImageIO library (/System/Library/Frameworks/ImageIO.framework/Versions/A/ImageIO on macOS or part of the dyld_shared_cache on iOS).\n   In the ImageIO framework, every supported image format has a dedicated IIO_Reader subclass for it. Each IIO_Reader subclass is expected to implement a testHeader function which, when given a chunk of bytes, should decide whether these bytes represent an image in the format supported by the reader. An example implementation of the testHeader implementation for the LibJPEG reader is shown below. It simply tests a few bytes of the input to detect the JPEG header magic.\n         By listing the different testHeader implementations, it thus becomes possible to compile a list of file formats supported by the ImageIO library. The list is as follows:\n                                While this list contains many familiar formats (JPEG, PNG, GIF, …) there are numerous rather exotic ones as well (KTX and ASTC, apparently used for textures or AI: Adobe Illustrator Artwork) and some that appear to be specific to the Apple ecosystem (ICNS for icons, ATX likely for Animojis)\n   Support for the different formats also varies. Some formats appear fully supported and are often implemented using what appear to be the open source parsing library which can be found in /System/Library/Frameworks/ImageIO.framework/Versions/A/Resources on macOS: libGIF.dylib, libJP2.dylib, libJPEG.dylib, libOpenEXR.dylib, libPng.dylib, libRadiance.dylib, and libTIFF.dylib. Other formats seem to have only rudimentary support for handling the most common cases.\n   Finally, some formats (e.g. PSD), also appear to support out-of-process decoding (on macOS this is handled by /System/Library/Frameworks/ImageIO.framework/Versions/A/XPCServices/ImageIOXPCService.xpc) which can help sandbox vulnerabilities in the parsers. It does not, however, seem to be possible to specify whether parsing should be performed in-process or out-of-process in the public APIs, and no attempt was made to change the default behaviour.\n      Given the wide range of available image formats and the fact that no source code is available for the majority of the code, fuzzing seemed like the obvious choice.\n   The choice of which fuzzer and fuzzing approach to use was not so obvious. Since the majority of the target code was not open source, many standard tools were not directly applicable. Further, I had decided to limit fuzzing to a single Mac Mini for simplicity. Thus, the fuzzer should:\n Run with as little overhead as possible to fully utilize the available compute resources, and\n In the end I decided to implement something myself on top of   Honggfuzz . The idea for the fuzzing approach is loosely based on the paper:   Full-speed Fuzzing: Reducing Fuzzing Overhead through Coverage-guided Tracing\n    Enumerating the start offset of every basic block in the program/library. This is done with a simple IDAPython script\n At runtime, in the fuzzed process, replacing the first byte of every undiscovered basic block with a breakpoint instruction (int3 on Intel). The original byte and the corresponding offset in the coverage bitmap are stored in a dedicated shadow memory mapping whose address can be computed from the address of the modified library, and\n  Retrieve the faulting address and compute the offset in the library as well as the address of the corresponding entry in the shadow memory\n   As only undiscovered basic blocks are instrumented and since every breakpoint is only triggered once, the runtime overhead quickly approaches zero. It should, however, be noted that this approach only achieves basic block coverage and not edge coverage as used for example by   AFL  and which, for closed source targets, can be achieved through   dynamic    binary    instrumentation  albeit with some performance overhead. It will thus be more “coarse grained” and for example treat different transitions to the same basic block as equal whereas AFL would not. As such, this approach will likely find fewer vulnerabilities given the same number of iterations. I deemed this acceptable as the goal of this research was not to perform thorough discovery of all vulnerabilities but rather to quickly test the robustness of the image parsing code and highlight the attack vector. Thorough fuzzing, in any case, is always best performed by the maintainers with source code access.\n   The described approach was fairly easy to implement by patching honggfuzz’s client instrumentation code and writing an IDAPython script to enumerate the basic block offsets. Both patch and IDAPython script can be found   here .\n   The fuzzer then started from a small corpus of around 700 seed images covering the supported image formats and ran for multiple weeks. In the end, the following vulnerabilities were identified:\n    A bug in the usage of libTiff by ImageIO which caused controlled data to be written past the end of a memory buffer. No CVE was assigned for this issue likely because it had already been discovered internally by Apple before we reported it.\n            Possibly an off-by-one error in the PVR decoding logic leading to an additional row of pixel data being written out-of-bounds past the end of the output buffer.\n    A related bug in the PVR decoder leading to an out-of-bounds read which likely had the same root cause as P0 Issue 1974 and thus was assigned the same CVE number.\n       The last issue was somewhat special as it occurred in 3rd party code bundled with ImageIO, namely that of the   OpenEXR library . As that library is open source, I decided to fuzz it separately as well.\n      OpenEXR  is “a high dynamic-range (HDR) image file format [...] for use in computer imaging applications”. The parser is implemented in C and C++ and can be found on   github .\n As described above, the OpenEXR library is exposed through Apple’s ImageIO framework and therefore is exposed as a 0click attack surface through various popular messenger apps on Apple devices. It is likely that the attack surface is not limited to messaging apps, though I haven&#39;t conducted additional research to support that claim.\n   As the library is open source, “conventional” guided fuzzing is much easier to perform. I used a Google internal, coverage-guided fuzzer running on roughly 500 cores for around two weeks. The fuzzer was guided by edge coverage using llvm’s   SanitizerCoverage  and generated new inputs by mutating existing ones using common binary mutation strategies and starting from a set of roughly 80 existing OpenEXR images as seeds.\n   Eight likely unique vulnerabilities were identified and reported as   P0 issue 1987  to the OpenEXR maintainers, then fixed in the   2.4.1 release . They are briefly summarized next:\n        A bug that caused a std::vector to be read out-ouf-bounds. Afterwards, the calling code would write into an element slot of this vector, thus likely corrupting memory.\n    An out-of-bounds memcpy that was reading data out-of-bounds and afterwards potentially writing it out-of-bounds as well.\n        An out-of-bounds read on the stack, likely due to an off-by-one error previously overwriting a string null terminator on the stack.\n       Interestingly, the crash initially found by the ImageIO fuzzer (  issue 1988 ) did not appear to be reproducible in the upstream OpenEXR library and was thus reported directly to Apple. A possible explanation is that Apple was shipping an outdated version of the OpenEXR library and the bug had been fixed upstream in the meantime.\n      Media format parsing remains an important issue. This was also demonstrated by other researchers and vendor advisories, with the two following coming immediately to mind:\n    This of course suggests that continuous fuzz-testing of input parsers should occur on the vendor/code maintainer side. Further, allowing clients of a library like ImageIO to restrict the allowed input formats and potentially to opt-in to out-of-process decoding can help prevent exploitation.\n   On the messenger side, one recommendation is to reduce the attack surface by restricting the receiver to a small number of supported image formats (at least for message previews that don’t require interaction). In that case, the sender would then re-encode any unsupported image format prior to sending it to the receiver. In the case of ImageIO, that would reduce the attack surface from around 25 image formats down to just a handful or less.\n    This blog post described how image parsing code, as part of the operating system or third party libraries, end up being exposed to 0click attack surface through popular messengers. Fuzzing of the exposed code turned up numerous new vulnerabilities which have since been fixed. It is likely that, given enough effort (and exploit attempts granted due to automatically restarting services), some of the found vulnerabilities can be exploited for RCE in a 0click attack scenario. Unfortunately it is also likely that other bugs remain or will be introduced in the future. As such, continuous fuzz-testing of this and similar media format parsing code as well as aggressive attack-surface reduction, both in operating system libraries (in this case ImageIO) as well as messenger apps (by restricting the number of accepted image formats on the receiver) are recommended.", "posttime": "2020-05-12 15:05:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模糊化,fuzzing,代码", "title": "模糊化ImageIO", "title_en": "Fuzzing ImageIO", "transed": 1, "url": "https://googleprojectzero.blogspot.com/2020/04/fuzzing-imageio.html?m=1", "via": "", "real_tags": ["模糊化", "fuzzing", "代码"]}, {"category": "", "categoryclass": "", "imagename": "3249ecd0b3e8d60d2ca092c2e97b89c6.png", "infoid": 1001776, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows上的Chromium沙盒经受住了时间的考验。它被认为是不需要提升特权就可以大规模部署的更好的沙箱机制之一。从好的方面来说，它确实有它的弱点。主要的问题是沙箱的实现依赖于Windows操作系统的安全性。更改Windows的行为不在Chromium开发团队的控制范围之内。如果在Windows的安全实施机制中发现错误，则沙箱可能会被破坏。\n这篇博客是关于Windows101903中引入的一个漏洞，该漏洞打破了Chromium用来保证沙箱安全的一些安全假设。我将介绍如何利用该bug开发一系列执行链，以避开Chrome/Edge上的GPU进程或Firefox中的默认内容沙箱所使用的沙箱。利用过程也是对Windows中的小弱点的一个有趣的洞察，这些小弱点本身并没有越过安全边界，但却导致了成功的沙盒逃脱。此漏洞已在2020年4月修复，名称为CVE-2020-0981。\n在描述错误本身之前，让我们快速了解一下Chromium沙箱在Windows上是如何工作的。沙箱通过使用受限令牌来处理最小特权的概念。受限令牌是Windows 2000中添加的一项功能，它通过以下操作修改进程的访问令牌，从而减少授予进程的访问权限：\n禁用组会删除访问令牌的成员身份，从而导致禁用对这些组保护的资源的访问。删除权限可防止进程执行任何不必要的特权操作。最后，添加受限SID会更改安全访问检查流程。要获得对资源的访问权限，我们需要匹配主列表和受限SID列表中的组的安全描述符条目。如果其中一个SID列表未授予对资源的访问权限，则访问将被拒绝。\nChrome还使用Vista中添加的完整性级别(IL)功能进一步限制资源访问。通过设置较低的IL，我们可以阻止对更高完整性资源的写访问，而不管访问检查的结果如何。\n以这种方式将受限令牌与IL一起使用允许沙箱限制受危害的进程可以访问的资源，从而限制RCE可能产生的影响。阻止写访问尤其重要，因为这通常会允许攻击者通过写入文件或注册表项来危害系统的其他部分。\nWindows上的任何进程都可以使用不同的令牌创建新进程，例如，通过调用CreateProcessAsUser。是什么阻止沙箱进程使用无限制令牌创建新进程？Windows和Chromium实施了一些安全缓解措施，使得在沙箱之外创建新进程变得困难：\n内核限制非特权用户可以将哪些令牌分配给新进程。\n沙箱限制限制了用于新进程的适当访问令牌的可用性。\nCr在Job对象内运行沙箱进程，该对象由任何硬进程配额限制为1的子进程继承。\n在Windows 10中，Chromium使用子进程缓解策略来阻止创建子进程。这是在3中的Job对象之外应用的。\n所有这些缓解措施最终都依赖于Windows的安全性。但是，到目前为止，最关键的是1。即使2到4失败，理论上我们也不能为新进程分配更有特权的访问令牌。当涉及到分配新令牌时，内核检查是什么？\n假设调用进程没有SeAssignPrimaryTokenPrivilege(我们没有)，那么新令牌必须满足内核函数SeIsTokenAssignableToProcess中检查的两个条件之一。这些条件基于内核的标记对象结构中的指定值，如下图所示。\n当前进程令牌的子级。基于新令牌的父令牌ID等于进程令牌的ID。\n当前进程令牌的同级。基于父令牌ID和身份验证ID字段都相等。\n还需要进行额外的检查，以确保新的令牌不是标识级别的模拟令牌(由于我报告的这个错误)，并且新令牌的IL必须小于或等于当前的进程令牌。这些都同样重要，但正如我们将看到的，在实践中用处较小。\n令牌分配不会明显检查父令牌或子令牌是否受到限制。如果您在受限令牌沙箱中，是否可以获得通过所有检查并将其分配给有效逃离沙箱的子代的无限制令牌？不，您不能，系统确保在分配受限令牌时兄弟令牌检查失败，而是确保父/子检查是将强制执行的检查。如果您查看内核函数SepFilterToken，就会了解它是如何实现的。将现有属性从父令牌复制到新的受限令牌时，将执行以下代码。\n通过设置新的受限令牌的父令牌ID，它确保只有创建受限令牌的进程才能为子进程使用它，因为令牌ID对于令牌对象的每个实例都是唯一的。同时，通过更改父令牌ID，兄弟检查被破坏。\n然而，当我在做一些测试来验证Windows101909上的令牌分配行为时，我注意到一些奇怪的事情。无论我创建了什么受限令牌，我都无法使赋值失败。再次查看SepFilterToken，我发现代码已经更改。\n内核代码现在只是从旧令牌直接复制父令牌ID。这完全打破了检查，因为新的沙箱进程有一个令牌，该令牌被认为是桌面上任何其他令牌的兄弟。\n假设我可以绕过已经到位的其他3个子进程缓解，那么这一行更改就足以突破受限令牌沙箱。让我们来经历一下为做到这一点而承担的考验和磨难。\n我想出的最终沙盒逃逸是相当复杂的，这也不一定是最优的方法。然而，Windows的复杂性意味着在我们的链中很难找到可供利用的替代原语。\n让我们从尝试获取合适的访问令牌来分配给新进程开始。令牌需要满足一些条件：\n令牌具有等于沙箱IL的IL，或者是可写的，从而可以降低IL级别。\n访问令牌是可保护的对象，因此，如果您有足够的访问权限，则可以打开令牌的句柄。但是，访问令牌不是由名称引用的，相反，要打开令牌，您需要拥有对进程或模拟线程的访问权限。我们可以使用NtObjectManager PowerShell模块通过Get-AccessibleToken命令查找可访问的令牌。\n该脚本获得在我的机器上运行的每个沙箱Chrome进程的句柄(显然是首先启动Chrome)，然后使用每个进程的访问令牌来确定我们可以打开哪些其他令牌进行Token_Duplicate访问。检查TOKEN_DUPLICATE以用作新进程中的令牌的原因是，我们需要制作令牌的副本，因为两个进程不能使用相同的访问令牌对象。访问检查会考虑调用进程是否具有对目标进程的PROCESS_QUERY_LIMITED_INFORMATION访问权限，这是打开令牌的先决条件。我们已经有了相当数量的结果，超过100个条目。\n然而，这个数字具有欺骗性，首先，我们可以访问的一些令牌几乎肯定会比当前令牌被沙箱更多地被沙箱。实际上，我们只需要无沙箱的可访问令牌。其次，虽然有很多可访问的令牌，但这很可能是少数进程能够访问大量令牌的产物。我们将把它过滤到只有Chrome进程的命令行，这些进程可以访问非沙箱令牌。\n在所有可能的Chrome进程中，只有GPU进程和Audio实用程序进程可以访问非沙箱令牌。这应该不会让人大吃一惊。由于调用系统服务以使这些进程正常工作的限制，渲染器进程比GPU或音频沙箱的锁定程度要高得多。这确实意味着从RCE到沙箱转义的可能性大大降低，因为大多数RCE发生在呈现HTML/JS内容时。也就是说，GPU错误确实存在，例如，这个错误就是洛基哈特在2016年Pwn2Own大会上使用的一个错误。\n让我们重点关注如何摆脱GPU进程沙箱。因为我没有GPU RCE可用，所以我将只向进程中注入一个DLL来运行转义。这并不像听起来那么简单，一旦GPU进程启动，该进程就被锁定为只加载Microsoft签名的DLL。我对KnownDlls使用了一个技巧，将DLL加载到内存中(有关详细信息，请参阅这篇博客文章)。\n丢弃令牌的IL以匹配当前令牌(对于GPU，这是低IL)。\n即使是在第一步，我们也有问题。获取无限制令牌的最简单方法是打开父进程的令牌，父进程是Chrome浏览器的主进程。但是，如果您查看GPU进程可以访问的令牌列表，您会发现不包括主Chrome浏览器进程。为什么会这样呢？这是故意的，因为在报告内核中的这个错误后，我意识到GPU进程沙箱可以打开浏览器进程的令牌。有了这个令牌，就可以创建一个新的受限令牌，该令牌将通过同级检查来创建一个具有更多访问权限的新进程，并退出沙箱。为了缓解这个问题，我修改了进程令牌的访问权限，以阻止较低的IL进程为TOKEN_DUPLICATE访问打开令牌。请参阅HardenTokenIntegerityLevelPolicy。在此修复之前，您不需要内核中的bug就可以逃离Chrome GPU沙箱，至少可以达到正常的低IL令牌。\n因此，我们没有简单的路径可用，但是我们应该能够简单地枚举进程，并找到符合我们标准的进程。我们可以通过使用NtGetNextProcess系统调用来实现这一点，正如我在上一篇博客文章(关于稍后我们将讨论的主题)中所描述的那样。我们为PROCESS_QUERY_LIMITED_INFORMATION访问打开所有进程，然后为TOKEN_DUPLICATE和TOKEN_QUERY。然后，在继续执行步骤2之前，我们可以检查令牌以确保其不受限制。\n为了复制令牌，我们调用DuplicateTokenEx并请求一个主令牌，将TOKEN_ALL_ACCESS作为所需的访问权限进行传递。但是有一个新问题，当我们尝试降低IL时，从SetTokenInformation得到ERROR_ACCESS_DENIED。这是因为微软在Windows10中添加了沙箱，并重新移植到所有支持的操作系统(包括Windows7)。以下代码是引入缓解的NtDuplicateToken中的一段代码。\n当您复制令牌时，内核会检查调用方是否被沙箱保护。如果内核被沙箱保护，则检查要复制的令牌是否比调用方受到的限制更少。如果限制较少，则代码将所需的访问限制为TOKEN_READ和TOKEN_EXECUTE。这意味着，如果我们请求诸如TOKEN_ADJUST_DEFAULT这样的写访问，它将在从复制调用返回给我们的句柄上被删除。反过来，这将阻止我们减少IL，以便将其分配给新进程。\n这似乎结束了我们的利用链。如果我们不能写入令牌，我们就不能减少令牌的IL，这会阻止我们分配它。但是实现有一个很小的缺陷，复制操作会继续完成，并返回一个访问权限有限的句柄。创建新的令牌对象时，默认安全性授予调用方对令牌对象的完全访问权限。这意味着一旦获得新令牌的句柄，就可以调用普通的DuplicateHandle API将其转换为完全可写的句柄。目前还不清楚这是否是故意的，不过应该注意，如果新令牌不受限制，CreateRestrictedToken中的类似检查将返回错误。无论在哪种情况下，我们都可以滥用这一错误特性来获得一个可写的无限制令牌，以使用正确的IL将其分配给新进程。\n现在我们可以获得一个不受限制的令牌，我们可以调用CreateProcessAsUser来创建我们的新流程。但不会那么快，因为GPU进程仍在一个受限的Job对象中运行，该对象会阻止创建新进程。大约5年前，我在我的“In-Console-able”博客文章中详细介绍了Job对象如何阻止新进程的创建。我们可以不使用控制台驱动程序中的相同错误来转义作业对象吗？在Windows8.1上，您可能可以(尽管我承认我没有测试过)，但是在Windows10上，有两件事阻碍了我们使用它：\nMicrosoft更改了作业对象以支持辅助进程计数器。如果您拥有SeTcbPrivilege，您可以向NtCreateUserProcess传递一个标志，以创建一个仍在Job内的新进程，该进程不计入进程计数。控制台驱动程序使用它来消除转义作业的要求。因为我们在沙箱中没有SeTcbPrivilege，所以我们不能使用此功能。\nMicrosoft向令牌添加了一个新标志，以防止它们被用于新进程。此标志由Chrome在所有沙箱进程上设置，以限制新的子进程。即使没有‘1’，该标志也会阻止滥用控制台驱动程序来生成新进程。\n这两个功能的组合会阻止通过滥用控制台驱动程序在当前作业之外生成新进程。我们需要想出另一种方法来避开Job对象限制，同时绕过子进程限制标志。\nJob对象是从父对象继承到子对象的，因此，如果我们可以找到GPU进程可以控制的Job对象之外的进程，我们就可以将该进程用作新的父进程并退出Job。不幸的是，至少在默认情况下，如果您检查GPU进程可以访问哪些进程，它只能打开自己。\n开放本身不会有多大用处，我们不能指望幸运地处理一个恰好正在运行的进程，而这个进程既可以访问，又不能运行作业。我们需要自己创造运气。\n我注意到的一件事是，有一个小的竞争条件设置了一个新的Chrome沙箱进程。首先创建进程，然后应用作业对象。如果我们可以让Chrome浏览器生成一个新的GPU进程，我们就可以在应用Job对象之前将其用作父进程。GPU进程的处理甚至支持在进程崩溃时重新生成进程。然而，我无法找到一种方法，让一个新的GPU进程在不终止当前进程的情况下产生，所以不可能让代码运行足够长的时间来利用竞争。\n相反，我决定集中精力寻找一个RPC服务，该服务将在Job之外创建一个新流程。有相当多的RPC服务以创建进程为主要目标，而其他服务则以创建进程为副作用。例如，我已经在上一篇博客文章中记录了二级登录服务，其中RPC服务的全部目的是生成新进程。\n不过，这个想法有一点小缺陷，特别是令牌中的子进程缓解标志是跨模拟边界继承的。由于使用模拟令牌作为新进程的基础是很常见的，因此任何新进程都将被阻塞。但是，我们有一个未设置标志的无限制令牌。我们可以使用无限制令牌来创建可以在RPC调用期间模拟的受限令牌，并且可以绕过子进程缓解标志。\n我尝试列出了哪些已知的服务可以以这种方式使用，我将这些服务汇总在下表中：\n该表并不详尽，可能还有其他允许创建进程的RPC服务。正如我们在表中看到的那样，产生二级登录、WMI和BITS等进程的众所周知的RPC服务不能从我们的沙箱级别访问。UAC服务是可访问的，正如我在上一篇博客中所描述的，存在一种通过滥用调试对象来滥用该服务来运行任意特权代码的方法。不幸的是，当创建新的UAC进程时，该服务将父进程设置为调用者进程。由于继承了Job对象，因此新进程将被阻止。\n列表中的最后一个服务是DCOM激活器。这是负责启动进程外COM服务器的系统服务，可以从我们的沙箱级别进行访问。它还将所有COM服务器作为服务进程的子级启动，这意味着作业对象不会被继承。看起来很理想，但是有一个小问题，为了使DCOM Activator有用，我们需要沙箱可以创建的进程外COM服务器。此对象必须满足一组条件：\n服务器不能作为交互式用户(将从沙箱中派生出来)或在服务进程内部运行。\n我们不必担心标准3，GPU进程可以访问系统可执行文件，因此我们将坚持使用预先安装的COM服务器。如果我们在创建后不能访问COM服务器，也不要紧，我们所需要的就是在作业之外启动COM服务器进程的权限，然后我们就可以劫持它了。我们可以使用OleViewDotNet和Select-ComAccess命令查找可访问的COM服务器。\n在默认安装的Windows 10上，我们有6个候选者。请注意，最后4个都在DLL中，但是这些类被注册为在DLL代理程序内运行，因此仍然可以在进程外使用。我决定使用COREDPUSSVR中的服务器，因为它是唯一的可执行文件，而不是通用的DLLHOST，因此更容易找到。此COM服务器的启动安全性授予Everyone和所有AppContainer包本地激活权限，如下所示：\n另外，尽管有两个类注册了COREDPUSSVR，但实际上只有一个以417976b7开头的类是由可执行文件注册的。创建另一个类将启动服务器可执行文件，但是类创建将挂起，等待永远不会出现的类。\n要启动服务器，您可以在模拟子进程缓解无标志受限令牌时调用CoCreateInstance。您还需要传递CLSCTX_ENABLE_COWAKING以使用模拟令牌激活服务器，默认情况下将使用进程令牌，该令牌设置子进程缓解标志，因此会阻止进程创建。这样做，您会发现COREDPUSSVR的一个实例在相同的沙箱级别上运行，但是在Job对象之外，并且没有子进程缓解。成功？\n还没那么快。通常，新进程的缺省安全性基于用于创建它的访问令牌内的缺省DACL。不幸的是，由于某些不清楚的原因，DCOM激活器在进程上设置了显式DACL，该DACL仅授予用户、系统和当前登录SID访问权限。这不允许GPU进程打开新的COM服务器进程，即使它实际上运行在相同的安全级别。如此接近，却又如此遥远。我尝试了几种方法来让代码在COM服务器内执行，比如Windows Hooks，但是都没有明显的效果。\n幸运的是，默认的DACL仍然用于进程启动后创建的任何线程。我们可以打开其中一个线程进行完全访问，并使用S将线程上下文更改为重定向执行。\n..", "note_en": "The Chromium sandbox on Windows has stood the test of time. It’s considered one of the better sandboxing mechanisms deployed at scale without requiring elevated privileges to function. For all the good, it does have its weaknesses. The main one being the sandbox’s implementation is reliant on the security of the Windows OS. Changing the behavior of Windows is out of the control of the Chromium development team. If a bug is found in the security enforcement mechanisms of Windows then the sandbox can break.\n   This blog is about a   vulnerability  introduced in Windows 10 1903 which broke some of the security assumptions that Chromium relied on to make the sandbox secure. I’ll present how I used the bug to develop a chain of execution to escape the sandbox as used for the GPU Process on Chrome/Edge or the default content sandbox in Firefox. The exploitation process is also an interesting insight into the little weaknesses in Windows which in themselves do not cross a security boundary but led to a successful sandbox escape. This vulnerability was fixed in April 2020 as   CVE-2020-0981 .\n  Let’s have a quick look at how the   Chromium sandbox works on Windows  before describing the bug itself. The sandbox works on the concept of least privilege by using Restricted Tokens. A Restricted Token is a feature added in Windows 2000 to reduce the access granted to a process through the modification of the Process’s Access Token through the following operations:\n    Disabling groups removes the Access Token’s membership, resulting in disabling access to resources secured by those groups. Removing privileges prevents the process from performing any unnecessary privileged operations. Finally, adding restricted SIDs changes the security access check process. To be granted access to a resource we need to match a security descriptor entry for both a group in our main list as well as the list of Restricted SIDs. If one of the lists of SIDs does not grant access to the resource then access will be denied.\n   Chromium also uses the Integrity Level (IL) feature added in Vista to further restrict resource access. By setting a low IL we can block write access to higher integrity resources regardless of the result of the access check.\n   Using Restricted Tokens with IL in this way allows the sandbox to limit what resources a compromised process can access and therefore the impact an RCE can have. It’s especially important to block write access as that would typically grant an attacker leverage to compromise other parts of the system by writing files or registry keys.\n   Any process on Windows can create a new process with a different Token, for example by calling   CreateProcessAsUser . What stops a sandboxed process creating a new process using an unrestricted token? Windows and Chromium implement a few security mitigations to make creating a new process outside of the sandbox difficult:\n The Kernel restricts what Tokens can be assigned by an unprivileged user to a new process.\n The sandbox restrictions limit the availability of suitable access tokens to use for the new process.\n Chromium runs a sandboxed process inside a Job object which is inherited by any child processes which has a hard process quota limit of 1.\n From Windows 10, Chromium uses the Child Process Mitigation Policy to block child process creation. This is applied in addition to the Job object from 3.\n   All of these mitigations are ultimately relying on Windows to be secure. However by far the most critical is 1. Even if 2 through 4 fail, in theory we shouldn’t be able to assign a more privileged access token to the new process. What is the kernel checking when it comes to assigning a new token?\n   Assuming the calling process doesn’t have  SeAssignPrimaryTokenPrivilege  (which we don’t) then the new token must meet one of two criteria which are checked in the kernel function  SeIsTokenAssignableToProcess . The criteria are based on specified values in the kernel’s TOKEN object structure as shown in the following diagram\n       A child of the current process token. Based on the new token’s Parent Token ID being equal to the Process Token’s ID.\n A sibling of the current process token. Based on both the Parent Token ID and Authentication ID fields being equal.\n   There’s also additional checks to ensure that the new Token is not an identification level impersonation token (due to this   bug  I reported) and the IL of the new token must be less than or equal to the current process token. These are equally important, but as we’ll see, less useful in practice.\n   One thing the token assignment does not obviously check is whether the Parent or Child tokens are restricted. If you were in a restricted token sandbox could you get an Unrestricted Token which passes all of the checks and assign it to a child effectively escaping the sandbox? No you can’t, the system ensures the Sibling Token check fails when assigning Restricted Tokens and instead ensures the Parent/Child check is the one which will be enforced. If you inspect the kernel function  SepFilterToken , you’ll understand how this is implemented. The following code is executed when copying the existing properties from the parent token to the new restricted token.\n      By setting the new Restricted Token’s Parent Token ID it ensures that only the process which created the Restricted Token can use it for a child as the Token ID is unique for every instance of a TOKEN object. At the same time by changing the Parent Token ID the sibling check is broken.\n   However, when I was doing some testing to verify the token assignment behavior on Windows 10 1909 I noticed something odd. No matter what Restricted Token I created I couldn’t get the assignment to fail. Looking at  SepFilterToken  again I found the code had changed.\n      The kernel code was now just copying the Parent Token ID directly across from the old token. This completely breaks the check, as the new sandboxed process has a token which is considered a sibling of any other token on the desktop.\n   This one line change could just be sufficient to break out of the Restricted Token sandbox, assuming I could bypass the other 3 child process mitigations already in place. Let’s go through the trials and tribulations undertaken to do just that.\n  The final sandbox escape I came up with is quite complicated, it’s also not necessarily the optimal approach. However, the complexity of Windows means it can be difficult to find alternative primitives to exploit in our chain.\n   Let’s start with trying to get a suitable access token to assign to a new process. The token needs to meet some criteria:\n The Token has an IL equal to the sandbox IL, or is writable so that the IL level can be reduced.\n   Access Tokens are securable objects therefore if you have sufficient access you can open a handle to a Token. However, Access Tokens are not referred to by a name, instead to open a Token you need to have access to either a Process or an Impersonating Thread. We can use my   NtObjectManager  PowerShell module to find accessible tokens using the  Get-AccessibleToken  command.\n      This script gets a handle to every sandboxed Chrome process running on my machine (obviously start Chrome first), then uses the access token from each process to determine what other tokens we can open for  TOKEN_DUPLICATE  access. The reason for checking for  TOKEN_DUPLICATE  to use as the token in a new process is that we need to make a copy of the token as two processes can’t use the same access token object. The access check takes into account whether the calling process would have  PROCESS_QUERY_LIMITED_INFORMATION  access to the target process which is a prerequisite for opening the Token. We’ve got a fair number of results, over 100 entries.\n   However this number is deceiving, for a start, some of the Tokens we can access will almost certainly be sandboxed more than the current token is sandboxed. Really we want only accessible tokens which are unsandboxed. Secondly, while there’s a lot of accessible tokens, that&#39;s likely an artifact of a small number of processes being able to access a large number of tokens. We’ll filter it down to just the command lines of the Chrome processes which can access non-sandboxed tokens.\n      Out of all the potential Chrome processes only the GPU process and the Audio utility process have access to non-sandbox tokens. This shouldn’t come as a massive surprise. The renderer processes are significantly more locked down than either the GPU or Audio sandboxes due to the limitations of calling into system services for those processes to function. This does mean that the likelihood of an RCE to sandbox escape is much reduced, as most RCE occur in rendering HTML/JS content. That said GPU bugs do exist, for example   this bug  is one used by Lokihardt at Pwn2Own 2016.\n   Let’s focus on escaping the GPU process sandbox. As I don’t have a GPU RCE to hand I’ll just inject a DLL into the process to run the escape. That’s not as simple as it sounds, once the GPU process has started the process is locked down to only loading Microsoft signed DLLs. I use a trick with  KnownDlls  to load the DLL into memory (see   this blog post  for full details).\n    Drop the IL of the token to match the current token (for GPU this is Low IL)\n   Even for step 1 we’ve got a problem. The simplest way of getting an unrestricted token would be to open the token for the parent process which is the main Chrome browser process. However, if you look through the list of tokens the GPU process can access you’ll find that the main Chrome browser process is not included. Why is that? This is intentional, as I realized after reporting   this bug  in the kernel that a GPU process sandbox could open the browser process’ token. With this token it’s possible to create a new restricted token which would pass the sibling check to create a new process with much more access and escape the sandbox. To mitigate this I modified the access for the process token to block lower IL processes from opening the token for  TOKEN_DUPLICATE  access. See   HardenTokenIntegerityLevelPolicy . Prior to this fix you didn’t need a bug in the kernel to escape the Chrome GPU sandbox, at least to a normal Low IL token.\n   Therefore the easy route is not available to us, however we should be able to trivially enumerate processes and find one which meets our criteria. We can do this by using the  NtGetNextProcess  system call as I described in a   previous blog post  (on a topic we’ll come back to later). We open all processes for  PROCESS_QUERY_LIMITED_INFORMATION  access, then open the token for  TOKEN_DUPLICATE  and  TOKEN_QUERY  access. We can then inspect the token to ensure it’s unrestricted before proceeding to step 2.\n   To duplicate the token we call   DuplicateTokenEx  and request a primary token passing  TOKEN_ALL_ACCESS  as the desired access. But there’s a new problem, when we try and lower the IL we get  ERROR_ACCESS_DENIED  from   SetTokenInformation . This is due to a sandbox mitigation Microsoft added to Windows 10 and back ported to all supported OS’s (including Windows 7). The following code is a snippet from  NtDuplicateToken  where the mitigation has been introduced.\n      When you duplicate a token the kernel checks if the caller is sandboxed. If sandboxed the kernel then checks if the token to be duplicated is less restricted than the caller. If it’s less restricted then the code limits the desired access to  TOKEN_READ  and  TOKEN_EXECUTE . This means that if we request a write access such as  TOKEN_ADJUST_DEFAULT  it’ll be removed on the handle returned to us from the duplication call. In turn this will prevent us reducing the IL so that it can be assigned to a new process.\n   This would seem to end our exploit chain. If we can’t write to the token, we can’t reduce the token’s IL, which prevents us from assigning it. But the implementation has a tiny flaw, the duplicate operation continues to complete and returns a handle just with limited access rights. When you create a new token object the default security grants the caller full access to the Token object. This means once you get back a handle to the new Token you can call the normal   DuplicateHandle  API to convert it to a fully writable handle. It’s unclear if this was intentional or not, although it should be noted that the similar check in  CreateRestrictedToken  returns an error if the new token isn’t as restricted. Whatever the case we can abuse this misfeature to get an writable unrestricted token to assign to the new process with the correct IL.\n   Now that we can get an unrestricted token we can call  CreateProcessAsUser  to create our new process. But not so fast, as the GPU process is still running in a restrictive Job object which prevents creating new processes. I detailed how Job objects prevent new process creation in my “  In-Console-Able ” blog post almost 5 years ago. Can we not use the same bug in the Console Driver to escape the Job object? On Windows 8.1 you probably can (although I’ll admit I’ve not tested), however on Windows 10 there’s two things which prevent us from using it:\n Microsoft changed Job objects to support an auxiliary process counter. If you have  SeTcbPrivilege  you can pass a flag to  NtCreateUserProcess  to create a new process still inside the Job which doesn’t count towards the process count. This is used by the Console Driver to remove the requirement to escape the Job. As we don’t have  SeTcbPrivilege  in the sandbox we can’t use this feature.\n Microsoft added a new flag to Tokens which prevent them being used for a new process. This flag is set by Chrome on all sandboxed processes to restrict new child processes. Even without ‘1’ the flag would block abusing the Console Driver to spawn a new process.\n   The combination of these two features blocks spawning a new process outside of the current Job by abusing the Console Driver. We need to come up with another way of escaping both the Job object restriction and to also circumvent the child process restriction flag.\n   The Job object is inherited from parent to child, therefore if we could find a process outside of a Job object which the GPU process can control we can use that process as a new parent and escape the Job. Unfortunately, at least by default, if you check what processes the GPU process can access it can only open itself.\n      Opening itself isn’t going to be very useful, and we can’t rely on getting lucky with a process which just happens to be running at the time which is both accessible and not running a Job. We need to make our own luck.\n   One thing I noticed is that there’s a small race condition setting up a new Chrome sandbox process. The process is first created, then the   Job object is applied . If we could get the Chrome browser to spawn a new GPU process we could use it as a parent before the Job object is applied. The handling of the GPU process even supports respawning the process if it crashes. However I couldn’t find a way of getting a new GPU process to spawn without also causing the current one to terminate so it wasn’t possible to have code running long enough to exploit the race.\n   Instead I decided to concentrate on finding a RPC service which would create a new process outside of the Job. There’s quite a few RPC services where process creation is the main goal, and others where process creation is a side effect. For example I already documented the Secondary Logon service in a   previous blog post  where the entire purpose of the RPC service is to spawn new processes.\n   There is a slight flaw in this idea though, specifically the child process mitigation flag in the token is inherited across impersonation boundaries. As it’s common to use the impersonated token as the basis for the new process any new process will be blocked. However, we have an unrestricted token that does not have the flag set. We can use the unrestricted token to create a restricted token we can impersonate during a RPC call and we can bypass the child process mitigation flag.\n   I tried to list what known services could be used in this way, which I’ve put together in the following table:\n      The table is not exhaustive and there’s likely to be other RPC services which would allow processes to be created. As we can see in the table, well known RPC services which spawn processes such as Secondary Logon, WMI and BITS are not accessible from our sandbox level. The UAC service is accessible and as I described in a   previous blog post  there exists a way of abusing the service to run arbitrary privileged code by abusing debug objects. Unfortunately when a new UAC process is created the service sets the parent process to the caller process. As the Job object is inherited the new process will be blocked.\n   The last service in the list is the DCOM Activator. This is the system service which is responsible for starting out-of-process COM servers and is accessible from our sandbox level. It also starts all COM servers as children of the service process which means the Job object is not inherited. Seems ideal, however there is a slight issue, in order for the DCOM Activator to be useful we need an out-of-process COM server that the sandbox can create. This object must meet a set of criteria:\n   The server must not run as Interactive User (which would spawn out of the sandbox) or inside a service process.\n   We don’t have to worry about criteria 3, the GPU process can access system executables so we’ll stick to pre-installed COM servers. It also doesn’t matter if we can’t access the COM server after creation, all we need is the rights to start the COM server process outside of the Job and then we can hijack it. We can find accessible COM servers using   OleViewDotNet  and the  Select-ComAccess  command.\n      On a default installation of Windows 10 we have 6 candidates. Note that the last 4 are all in DLLs, however these classes are registered to run inside a   DLL Surrogate  so can still be used out-of-process. I decided to go for the servers in COREDPUSSVR because it’s a unique executable rather than the generic DLLHOST so makes it easier to find. The Launch Security for this COM server grants  Everyone  and all AppContainer packages local activation permission as shown below:\n    As an aside, even though there are two classes registered for COREDPUSSVR, only the one starting with  417976b7  is actually registered by the executable. Creating the other class will start the server executable, however the class creation will hang waiting for a class which will never come.\n   To start the server you call   CoCreateInstance  while impersonating the child process mitigation flag-free restricted token. You need to pass the  CLSCTX_ENABLE_CLOAKING  as well to activate the server using the impersonation token, the default would use the process token which has the child process mitigation flag set and so would block process creation. Doing this, you’ll find an instance of COREDPUSSVR running at the same sandbox level however outside of the Job object and without the child process mitigation. Success?\n   Not so fast. Normally the default security of a new process is based on the default DACL inside the access token used to create it. Unfortunately for some unclear reason the DCOM activator sets an explicit DACL on the process which only grants access to the user, SYSTEM and the current logon SID. This doesn’t allow the GPU process to open the new COM server process, even though it’s running at effectively the same security level. So close and yet so far. I tried a few approaches to get code executed inside the COM server such as   Windows Hooks  however nothing obvious worked.\n   Fortunately, the default DACL is still used for any threads created after process startup. We can open one of those threads for full access and change the thread context to redirect execution using   S\n......", "posttime": "2020-05-12 15:04:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrom,chrome,line,进程", "title": "你不会相信这一行的改变对Chrome沙盒造成了什么影响", "title_en": "You Won't Believe What This One Line Change Did to the Chrome Sandbox", "transed": 1, "url": "https://googleprojectzero.blogspot.com/2020/04/you-wont-believe-what-this-one-line.html?m=1", "via": "", "real_tags": ["chrom", "chrome", "line", "进程"]}, {"category": "", "categoryclass": "", "imagename": "cd7f90b3b7167c9468e810dae283b838.jpg", "infoid": 1001775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌可以与万维网打交道，而企业的回应范围要小得多。人们很容易认为，这应该会让我们更容易找到理想的回应，但事实恰恰相反。您拥有的数据越多，找到正确文档的可能性就越大。\n亚马逊正试图改变企业搜索游戏，将其置于更现代的机器学习驱动的环境中，使用当今的技术来帮助你找到完美的答案，就像你通常在网络上所做的那样。\n今天，该公司宣布亚马逊Kendra全面上市，这是该公司去年在AWS Re：Inventt上宣布的云企业搜索产品。它使用自然语言处理，允许用户简单地提出问题，然后在连接到搜索引擎的存储库中搜索，以找到准确的答案。\n“亚马逊肯德拉通过允许终端用户使用真实问题(而不仅仅是关键字)在多个数据孤岛上进行搜索，从而重塑了企业搜索，并在幕后利用机器学习模型来理解文档的内容和它们之间的关系，从而提供他们寻求的准确答案(而不是随机的链接列表)，”该公司在一份声明中描述了这项新服务。\nAWS已经针对包括IT、医疗保健和保险在内的特定行业调整了搜索引擎。它承诺，能源、工业、金融服务、法律、媒体和娱乐、旅行和接待、人力资源、新闻、电信、采矿、食品和饮料以及汽车将在今年晚些时候到来。\n这意味着这些行业中的任何一家公司在搜索方面都应该领先一步，因为系统将理解特定于这些垂直行业的语言。您可以将Kendra搜索框拖放到应用程序或网站中，它具有类似于您在这样的工具中所期望的提前键入的功能。\n企业搜索已经存在很长时间了，但或许通过让AI和机器学习来承担，我们最终可以一劳永逸地解决它。", "note_en": "While Google has the universe of the World Wide Web to work with, enterprises have a much narrower set of responses. It would be easy to think that should make it easier to find the ideal response, but the fact is that it’s the opposite. The more data you have, the more likely you’ll find the correct document.\n Amazon   is trying to change the enterprise search game by putting it into a more modern machine learning-driven context to use today’s technology to help you find that perfect response just as you typically do on the web.\n  Today the company announced the general availability of Amazon Kendra, its cloud enterprise search product that the company  announced last year at AWS re:Invent. It uses natural language processing to allow the user to simply ask a question, then searches across the repositories connected to the search engine to find a precise answer.\n “Amazon Kendra reinvents enterprise search by allowing end-users to search across multiple silos of data using real questions (not just keywords) and leverages machine learning models under the hood to understand the content of documents and the relationships between them to deliver the precise answers they seek (instead of a random list of links),” the company described the new service in a statement.\n AWS has tuned the search engine for specific industries including IT, healthcare and insurance. It promises energy, industrial, financial services, legal, media and entertainment, travel and hospitality, human resources, news, telecommunications, mining, food and beverage and automotive will be coming later this year.\n This means any company in one of those industries should have a head start when it comes to searching because the system will understand the language specific to those verticals. You can drop your Kendra search box into an application or a website, and it has features like type ahead you would expect in a tool like this.\n Enterprise search has been around for a long time, but perhaps by bringing AI and machine learning to bear on it, we can finally solve it once and for all.", "posttime": "2020-05-12 15:03:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,amazon,企业,kendra,搜索", "title": "Amazon Kendra是一款面向企业的人工智能搜索服务，现已公开提供", "title_en": "Amazon Kendra, an AI powered search service for enterprises, is openly available", "transed": 1, "url": "https://techcrunch.com/2020/05/11/amazon-releases-kendra-to-solve-enterprise-search-with-ai-and-machine-learning/", "via": "", "real_tags": ["人工智能", "amazon", "企业", "kendra", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "daa1279051c5c47a3e6a496361f86f9e.jpg", "infoid": 1001774, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LIDL的母公司施瓦茨集团(Schwarz Group)正在与亚马逊展开竞争，推出了自己的云计算服务，面向第三方零售商。\n据Lebensmittel Zeitun报道，同时拥有Lidl和Kaufland的施瓦茨集团(Schwarz Group)在最近收购了软件专业公司Camao IDC后，将推出自己的竞争对手亚马逊网络服务(Amazon Web Services，AWS)。\n此次收购于5月1日完成，将70名云专家纳入更广泛的集团，代表“一个重要数字化领域的关键资源”。\n其战略和业务管理主管斯特凡·赫罗德(Stefan Herold)将于3月份上任，他将负责新的云服务，据悉，由于冠状病毒危机，这项服务已经加速。\n虽然施瓦茨IT打算利用欧洲增强的数据保护法作为亚马逊主导服务的关键差异化因素，但许多人表示担心，AWS现金储备和低价可能是确保客户安全的主要障碍。\n今年1月，有报道称，LIDL可能会在今年年中之前在英国推出在线送货服务。\n10月份，LIDL正在为“令人兴奋的新电子商务项目”招聘数字经理，而其英国数字总监亚历克斯·默里(Alex Murray)在2018年3月的一次行业会议上暗示了在线计划。\n同年，Lidl推出了Lidl Digital物流英国有限公司，进一步加剧了人们对英国可能即将推出的猜测。", "note_en": "Lidl’s parent company Schwarz Group is taking on Amazon by launching its own cloud computing service for third party retailers.\n Schwarz Group, which owns both Lidl and Kaufland, is launching its own rival to Amazon Web Services (AWS) following the recent acquisition of software specialist Camao IDC, according to  Lebensmittel Zeitun.\n The acquisition, which completed on May 1, brings 70 cloud specialists into the wider group representing key “resources in an important area of digitalisation”.\n Its head of strategy and business management Stefan Herold, who took on the role in March, will head up the new cloud service, which is understood to have been accelerated due to the coronavirus crisis.\n  While Schwarz IT intends to use Europe’s enhanced data protection laws as a key differentiator to Amazon’s dominant service, many have expressed concerns that AWS cash reserves and low prices could be major obstacles in securing clients.\n In January, reports emerged that Lidl could launch an online delivery service here in the UK by the middle of the year.\n In October that Lidl was advertising for digital managers for “exciting new ecommerce projects”, while its UK digital director Alex Murray alluded to online plans at an industry conference in March 2018.\n That same year Lidl launched Lidl Digital Logistics Great Britain Ltd, adding further weight to speculation a UK launch could be close by.", "posttime": "2020-05-12 14:49:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推出,launch,lidl", "title": "LIDL将推出AWS的竞争对手", "title_en": "Lidl to Launch Rival to AWS", "transed": 1, "url": "https://www.chargedretail.co.uk/2020/05/11/lidl-owner-launching-its-own-rival-to-amazon-web-services/", "via": "", "real_tags": ["推出", "launch", "lidl"]}, {"category": "", "categoryclass": "", "imagename": "971d69a3066b3dadcfb3e27c558a3981.jpg", "infoid": 1001773, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麻省理工学院开放式课程软件是一个免费开放的出版物，内容来自数千门麻省理工学院的课程，涵盖整个麻省理工学院的课程。\n没有注册或注册。自由浏览和使用开放式课程的材料，您可以按照自己的节奏。没有注册，也没有开始或结束日期。\n知识是你的回报。用开放式课程指导自己的终身学习，或者教给别人。我们不提供使用开放式课程的学分或认证。\n为分享而生。下载文件以备以后使用。发送给朋友和同事。修改、混合和重用(只需记住引用OCW作为源代码)。\n这六个简短的视频录制于2020年，包含斯特朗教授关于线性代数教与学的主题推荐顺序的想法和建议。第一个题目叫“线性代数的新入门方法”。关键点是从矩阵A的列和组合这些列的乘法Ax开始。\n这就引出了矩阵的列空间和独立列的概念，以及A=CR的因式分解，它告诉了我们很多关于A的信息。有了好的数字，每个学生都能看到相关的列。\n剩下的视频非常简要地概述了整个课程：线性代数大图景；正交向量；特征值和特征向量；以及奇异值和奇异向量。奇异值变得如此重要，它们直接来自A&A的特征值。\n你可以在斯特朗教授2019年课程18.065数据分析、信号处理和机器学习中的矩阵方法的第一节视频讲座中看到这一新想法的发展。", "note_en": "MIT OpenCourseWare is a free &amp; open publication of material from thousands of MIT courses, covering the entire MIT curriculum.\n  No enrollment or registration. Freely browse and use OCW materials at your own pace. There&#39;s no signup, and no start or end dates.\n  Knowledge is your reward. Use OCW to guide your own life-long learning, or to teach others. We don&#39;t offer credit or certification for using OCW.\n  Made for sharing. Download files for later. Send to friends and colleagues. Modify, remix, and reuse (just remember to cite OCW as the source.)\n   These six brief videos, recorded in 2020, contain ideas and suggestions from Professor Strang about the recommended order of topics in teaching and learning linear algebra. The first topic is called  A New Way to Start Linear Algebra. The key point is to start right in with the columns of a matrix  A and the multiplication  Ax that combines those columns.\n That leads to  The Column Space of a Matrix and the idea of independent columns and the factorization  A = CR that tells so much about  A. With good numbers, every student can see dependent columns.\n The remaining videos outline very briefly the full course:  The Big Picture of Linear Algebra;  Orthogonal Vectors;  Eigenvalues &amp; Eigenvectors; and  Singular Values &amp; Singular Vectors. Singular values have become so important and they come directly from the eigenvalues of  A&#39;A.\n You can see this new idea developing in the  first video lecture of Professor Strang’s 2019 course   18.065 Matrix Methods in Data Analysis, Signal Processing, and Machine Learning.", "posttime": "2020-05-12 14:21:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,线性代数,linear,课程", "title": "吉尔伯特·斯特朗的“2020年线性代数远景”", "title_en": "Gilbert Strang's a 2020 Vision of Linear Algebra", "transed": 1, "url": "https://ocw.mit.edu/resources/res-18-010-a-2020-vision-of-linear-algebra-spring-2020/index.htm", "via": "", "real_tags": ["2020", "线性代数", "linear", "课程"]}, {"category": "", "categoryclass": "", "imagename": "3729759b5ef2fbfbe98b7b23e20598f8.jpeg", "infoid": 1001772, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我对人工智能趋势感兴趣，这些趋势塑造了人与技术的交叉和互动方式。\n自动语音识别(ASR)是将口语转换为文本。如果你曾经使用过像Siri或Alexa这样的虚拟助手，那么你一定有过使用自动语音识别系统的经验。这项技术正在短信应用、搜索引擎、车载系统和家庭自动化中实施。\n尽管所有这些系统依赖的技术流程略有不同，但它们的第一步都是相同的：捕获语音数据并将其转换为机器可读的文本。\n在本文中，我将简要介绍自动语音识别。我们将研究语音到文本的转换过程，如何构建ASR系统，并触及未来ASR技术的前景。\n但是要从输入到输出，音频数据需要是机器可读的。这意味着通过声学模型和语言模型发送它。这两个过程的工作方式如下：\n声学模型确定一种语言中的音频信号和语音单元之间的关系，而语言模型将声音与单词和单词序列相匹配。\n这两个系统允许ASR系统对音频输入进行概率检查，以预测音频输入中有哪些单词和句子。然后，系统从这些预测中选择置信度最高的预测。*。\n*有时语言模型可以优先考虑由于其他因素而被认为更有可能的某些预测\n因此，如果我们通过ASR系统运行a短语，它将执行以下操作：\n值得一提的是，如果自动语音识别系统是语音用户界面的一部分，那么ASR模型将不是唯一起作用的机器学习模型。许多自动语音识别系统与自然语言处理(NLP)和文本到语音(TTS)系统配对以执行其给定的角色。\n也就是说，深入研究语音用户界面本身就是一个完整的话题。要了解更多信息，请查看这篇文章。\n现在我们知道了ASR系统是如何工作的，但是您需要做些什么来构建一个ASR系统呢？\n一个好的ASR系统应该是灵活的。它需要理解各种音频输入(语音样本)，并根据这些数据创建准确的文本输出，以便做出相应的反应。\n为了实现这一点，ASR系统需要标记语音样本和转录的形式的数据。这比这要复杂一些(例如，数据标记过程非常重要，但经常被忽视)，但出于本文的目的，让我们让事情变得简单。\nASR系统需要大量的音频数据。为什么？因为说话很复杂。说同一件事有很多不同的方式，句子的意思会随着单词的位置和强调而改变。还要考虑到世界上充满了不同的语言，在这些语言中，根据位置和口音等因素，发音和选词可能会有所不同。\n考虑到这一点，您为ASR系统提供的语音样本越多，它在识别和分类新语音输入方面的表现就越好。从广泛的声音和环境中获得的样本越多，系统在识别这些环境中的声音时就越好。通过专门的微调和维护，自动语音识别系统将在使用过程中得到改进。\n所以在最基本的层面上，数据越多越好。确实，目前正在进行优化较小数据集的研究，但目前大多数模型仍需要大量数据才能很好地执行。\n幸运的是，多亏了数据集库和专用的数据收集服务，音频数据收集变得越来越简单。这反过来又加快了技术发展的速度，所以为了完成这件事，让我们简要地看看自动语音识别在未来可以发挥什么作用。\nASR技术已经将自己嵌入到我们的社会中。虚拟助理、车载系统和家庭自动化都在为日常生活创造便利。他们的能力范围很可能也会扩大；随着更多的人采用这些服务，这项技术将进一步发展。\n除了上述示例之外，自动语音识别还在各种有趣的领域和行业发挥作用：\n交流：随着全球手机的普及，ASR系统即使对读写能力较低的社区也能提供消息传递、在线搜索和基于文本的服务。\n提高可访问性：自动语音识别系统还可以通过免提访问应用程序以及为电视、电影和商务会议提供自动字幕来帮助残疾或受伤人士。\n军事技术：在美国、法国和英国，军事项目一直在测试和评估战斗机的ASR系统。这包括设置无线电频率、指挥自动驾驶系统和控制飞行显示等任务。\n这些只是ASR如何支持和改善生活的几个例子，很可能在新的改编的同时，未来十年还会有更多的改进。\n无论如何，我希望这篇文章很好地介绍了ASR系统是如何工作的，如何构建它们，以及对未来的展望。如果您有任何意见或想法，请随时在下面留言，我会尽快找到它。\n非常感谢您的阅读。有关人工智能新闻和机器学习发展的更多信息，请在Twitter上关注我。", "note_en": "I&#39;m interested in the AI trends that shape how people and technology intersect and interact.\n Automatic speech recognition (ASR) is the transformation of spoken language into text. If you’ve ever used a virtual assistant like Siri or Alexa, you’ve experienced using an automatic speech recognition system. The technology is being implemented in messaging apps, search engines, in-car systems, and home automation.\n And though all these systems rely on slightly different technical processes, the first step for all of them is the same: capturing speech data and transforming it into machine-readable text.\n  In this article, I’ll give a brief introduction to automatic speech recognition. We&#39;ll look at the speech-to-text transformation process, how to build an  ASR system, and touch on where to expect ASR tech in the future.\n     But to get from the input to the output, the audio data needs to be made machine-readable. This means sending it through an  acoustic model and a  language model. The two processes work like this:\n An acoustic model determines the relationship between audio signals and phonetic units in a language, while a language model matches sounds to words and word sequences.\n These two systems allow ASR systems to run probability checks on audio input to develop predictions of what words and sentences are in it. From these predictions, the systems then selects the prediction with the highest confidence rating.*\n *Sometimes the language model can give priority to certain predictions that are deemed more likely due to other factors\n So if we run the a phrase through an ASR system, it will do the following:\n  It&#39;s worth mentioning here that if an automatic speech recognition system is part of a voice user interface, the ASR model won’t be the only machine learning model at work. Many automatic speech recognition systems are paired with natural language processing (NLP) and Text-to-speech (TTS) systems to perform their given roles.\n That said, digging into voice user interfaces is a whole topic of its own. To learn more about it, check out  this article.\n So now we know how ASR systems work, but what do you need to build one?\n   A good ASR system is expected to be flexible. It needs to understand a wide variety of audio input (speech samples) and create accurate text output from that data so it can react accordingly.\n To achieve this, ASR systems require data in the form of labeled speech samples and transcriptions. It&#39;s a little more complicated than that (the  data labeling process is hugely important and often overlooked, for example), but for the purposes of this article let&#39;s keep things simple.\n ASR systems require huge amounts of  audio data. Why? Because speech is complicated. There are lots of different ways to say the same thing, and the meaning of a sentence can change with word placement and emphasis. Also consider that the world is filled with different languages, and within these languages pronunciation and word choice can differ depending on factors such as location and accent.\n  With this in mind, the more speech samples you feed an ASR system, the better it gets at identifying and classifying new speech input. The more samples you have from a broad range of voices and environments, the better the system gets at identifying voices within those environments. With dedicated fine-tuning and maintenance, automatic speech recognition systems will improve as they are used.\n So at the most basic level, the more data, the better. It&#39;s true that there is ongoing research into optimizing smaller datasets, but at present most models still require large amounts of data to perform well.\n Fortunately, audio data collection is getting simpler thanks to dataset repositories and dedicated data collection services. This in turn is increasing the rate of technological development, so to finish things off, let&#39;s take a brief look at where automatic speech recognition can play a role in the future.\n  ASR Technology is already embedding itself into our society. Virtual assistants, in-car systems, and home automation are all creating convenience in everyday life. It&#39;s likely that the scope of their abilities will expand too; as more people adopt these services the technology will develop further.\n Outside of the above examples, automatic speech recognition is playing a role in a variety of interesting fields and industries:\n Communication: With the adoption of cell phones worldwide, ASR systems can make messaging, online searches, and  text-based services available even to communities with low levels of reading and writing literacy.\n Improving Accessibility: Automatic speech recognition systems can also help  people with disabilities or injuries by providing hands-free access to applications, and auto-captioning for television, movies, and business meetings.\n Military Technology: In the US, France, and the UK, military programs have been testing and evaluating ASR systems for  fighter jets. This includes tasks such as setting radio frequencies, commanding autopilot systems, and controlling flight displays.\n These are just a few examples of how ASR can support and improve lives, and it&#39;s likely that the next decade will see even more improvements alongside novel adaptations.\n In any case, I hope this article has been a good introduction to how ASR systems work, how to build them, and what to look forward to in the future. If you have any comments or thoughts, feel free to leave a comment below and I’ll get to it as soon as I can.\n  Thanks so much for reading. For more about AI news and machine learning developments, follow me   on twitter .", "posttime": "2020-05-12 14:20:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "自动,automatic,系统", "title": "WTF是自动语音识别吗？", "title_en": "WTF Is Automatic Speech Recognition?", "transed": 1, "url": "https://hackernoon.com/wtf-is-automatic-speech-recognition-sd593bhv", "via": "", "real_tags": ["自动", "automatic", "系统"]}, {"category": "", "categoryclass": "", "imagename": "e7117e2db671fcdebcea09e106639103.png", "infoid": 1001771, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SWIFT 5.3是一个旨在包含重大质量和性能增强功能的版本。此外，此版本还将扩大SWIFT可用和支持的平台数量，特别是增加了对Windows和其他Linux版本的支持。\nSWIFT 5.3版本分支的可下载快照将作为持续集成测试的一部分定期发布。由于支持可用，将为新支持的平台添加快照下载。\n一旦SWIFT 5.3发布，除了快照之外，还将发布正式的最终版本。\n2020年4月20日，将在快速存储库和最相关的项目存储库中削减Release/5.3分支。请注意新的分支机构命名方案。其中将包含将在SWIFT 5.3中发布的更改。分支被切断后，如果更改满足发布标准，则可以通过Pull请求将更改落地到分支上。\n同样的政策将适用于这些项目：一旦分支被切断，如果更改满足发布标准，则可以通过拉入请求将更改落地到分支上。\nSWIFT 5.3的所有语言和API更改都将经过SWIFT演进流程。演进建议书的目标应该是在分支机构日期之前完成，以增加其影响SWIFT 5.3版本的机会。例外情况将在个案的基础上加以考虑，特别是如果它们与版本的核心目标一致的话。\n其他更改(例如，错误修复、诊断改进、SourceKit界面改进)将根据其风险和影响接受。\n低风险的测试调整也将在发布分支后期接受，如果它有助于验证发布的话。\n作为SWIFT 5.3版本的一部分，以下存储库将有一个Tracksource/5.3版本分支：\n版本的整体管理将由以下个人监督，他们将在版本收敛时宣布SWIFT 5.3版本何时开始实施更严格的更改控制。\n对于SWIFT 5.3版本，我们正在为我们支持的每个平台添加版本管理器。他们将监督特定于平台的问题以及该平台发布的资格。\n请随时在开发论坛上发帖，或直接联系Ted Kremenek，询问有关发布管理过程的任何问题。\n为了在剪切拉取请求后考虑将其包括在Release分支(Release/5.3)中，它必须包括以下信息：\n说明：对正在修复的问题或正在进行的增强的描述。这可能很简短，但应该很清楚。\n范围：对变更的影响/重要性的评估。例如，这个变化是不是一个突破性的语言变化，等等。\n测试：已经或需要进行哪些具体的测试来进一步验证此更改的任何影响？\n审查者：受影响组件的一个或多个代码所有者应该审查更改。技术审查可以由代码所有者委托，或在认为适当或有用的情况下要求进行技术审查。\nRelease/5.3分支上的所有更改都必须通过相应的版本经理接受的Pull请求。", "note_en": "Swift 5.3 is a release meant to include significant quality and performance enhancements. In addition, this release will expand the number of platforms where Swift is available and supported, notably adding support for Windows and additional Linux distributions.\n  Downloadable snapshots of the Swift 5.3 release branch will be postedregularly as part of  continuous integration testing. As support is available, snapshot downloads will be added for newly supported platforms.\n Once Swift 5.3 is released, the official final builds will also be posted in addition to the snapshots.\n  On  April 20, 2020 the  release/5.3 branch will be cut in the swift repository and most related project repositories. Please note the new branch naming scheme. This will contain the changes that will be released in Swift 5.3. After the branch is cut, changes can be landed on the branch via pull request if they meet the criteria for the release.\n   The same policies will apply to these projects: once the branch is cut, changes can be landed on the branch via pull request if they meet the criteria for the release.\n  All language and API changes for Swift 5.3 will go through the  SwiftEvolution process. Evolutionproposals should aim to be completed by the branch date in order toincrease their chances of impacting the Swift 5.3 release. Exceptionswill be considered on a case-by-case basis, particularly if they tiein with the core goal of the release.\n  Other changes (e.g., bug fixes, diagnostic improvements, SourceKit interfaceimprovements) will be accepted based on their risk and impact.\n  Low-risk test tweaks will also be accepted late into the release branch ifit aids in the qualification of the release.\n  The following repositories will have a  release/5.3 branch to tracksources as part of Swift 5.3 release:\n    The overall management of the release will be overseen by the followingindividuals, who will announce when stricter control of change goes intoeffect for the Swift 5.3 release as the release converges.\n For the Swift 5.3 release, we are adding release managers for each of our supported platforms. They will oversee platform specific issues as well as qualification of that platform for the release.\n    Please feel free to post on the  development forumor contact  Ted Kremenek directly concerning any questions about the release managementprocess.\n  In order for a pull request to be considered for inclusion in the releasebranch ( release/5.3) after it has been cut, it must include the followinginformation:\n Explanation: A description of the issue being fixed or enhancement beingmade. This can be brief, but it should be clear.\n  Scope: An assessment of the impact/importance of the change. Forexample, is the change a source-breaking language change, etc.\n      Testing: What specific testing has been done or needs to be done tofurther validate any impact of this change?\n  Reviewer: One or more  code ownersfor the impacted components should review the change. Technical review canbe delegated by a code owner or otherwise requested as deemed appropriate oruseful.\n All changes going on the  release/5.3 branch  must go through pull requests that areaccepted by the corresponding release manager.", "posttime": "2020-05-12 14:05:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,官方,official,版本", "title": "SWIFT 5.3将带来官方Windows支持", "title_en": "Swift 5.3 will bring official Windows support", "transed": 1, "url": "https://swift.org/blog/5-3-release-process/?hn", "via": "", "real_tags": ["windows", "官方", "official", "版本"]}, {"category": "", "categoryclass": "", "imagename": "91cc92480848a7f8964c8acdbb5a98ca.png", "infoid": 1001770, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索俄罗斯方块效应(也称为俄罗斯方块综合症)是指人们在一项活动上投入了如此多的时间和注意力，以至于它开始形成他们的思想、脑海中的图像和梦境。[1]它的名字取自视频游戏俄罗斯方块。[1]。\n玩了很长时间俄罗斯方块的人会发现自己在思考如何将现实世界中不同形状的东西拼凑在一起，比如超市货架上的盒子或街道上的建筑。[1]他们可能会在视野边缘或当他们闭上眼睛时看到碎片落在看不见的布局上的彩色图像。[1]当他们入睡时，他们可能会看到这种彩色的运动图像，这是催眠图像的一种形式。[2]。\n那些体验到这种影响的人可能会觉得他们无法阻止这些想法、图像或梦想的发生。[3]。\n对玩视频游戏的挥之不去的影响的更全面的理解被称为游戏转移现象(GTP)。\n俄罗斯方块效应可能会发生在其他视频游戏中。[4]众所周知，这也发生在非视频游戏中，例如拼图后出现曲线错觉、国际象棋棋盘的跳棋图案，或在速成方块中常见的魔方算法的不由自主的脑海中的可视化。\n罗伯特·斯蒂克戈尔德报告了他自己攀岩本体感官意象的经历。[3]另一个例子是一种俄罗斯方块效应。在海上呆了很长一段时间后新上岸的人可能会感觉到虚幻的摇摆运动，因为他已经习惯了不断调整以适应船只做出这样的运动的工作(参见#34；自我运动的幻觉；和#34；Mal de Debarquement&34；)。鲁迪亚德·吉卜林的诗“靴子”描述了行军过程中重复的视觉体验所产生的效果：\n“一天比一天好，因为我的同伴，\n但是-夜带来了长长的弦-O‘40万亿靴子-靴子-再次向上移动和向下移动。\n据数学家报道，他们梦到了数字或方程式；例如，斯里尼瓦萨·拉马努扬(Srinivasa Ramanujan)或弗里德里希·恩格斯(Friedrich Engels)上周在梦中说，我给了一个小伙子衬衫纽扣让他区分，结果他把它们带走了。[5]。\nStickgold等人。(2000)提出俄罗斯方块效应意象是一种独立的记忆形式，可能与程序记忆有关。[2]这来自他们的研究，研究表明，患有顺行性健忘症的人无法形成新的陈述性记忆，尽管根本不记得玩过俄罗斯方块，但他们报告说，他们梦见白天玩俄罗斯方块后出现了倒下的形状。\n自2010年以来，对6000多名游戏玩家进行了一系列实证研究，研究游戏转移现象(GTP)，这是Angelica B.Ortiz de Gortari在她的论文中提出的俄罗斯方块效应概念的扩展。[6]GTP不限于改变的视觉感知或心理过程，还包括听觉、触觉和动觉感觉、不真实感觉以及视频游戏内容的自动行为。GTP确定了内源性现象(例如，闭着眼睛看到图像，在头上听到音乐)和外源性现象(例如，看到人们头顶上的电源条，听到与视频游戏相关的物体发出的声音)之间的区别，以及无意识行为(例如，用电子游戏内容不由自主地说些什么)和自愿行为(例如，使用视频游戏中的俚语来娱乐)之间的区别。[7][8][9]。\n已知的最早提及这一术语的文章出现在杰弗里·戈德史密斯的文章“俄罗斯方块上的你的大脑”(This Is Your Brain On Tetris)，该文章于1994年5月发表在“连线”杂志上：\n在1990年，没有一个家没有游戏机是甜蜜的。那一年，我和东京的一位朋友住了一周，俄罗斯方块奴役了我的大脑。夜里，当我躺在借来的鞑靼米地板上时，几何形状落在黑暗中。几天前，我坐在薰衣草绒面沙发上，疯狂地玩俄罗斯方块。在难得的离家远足期间，我会在视觉上把汽车、树木和人放在一起。[.]。\n俄罗斯方块效应是一个生化的、还原论的隐喻，如果你好奇的话，可以说是发明，是创造的冲动。将形状组合在一起就是组织、构建、交易、修复、理解和折叠床单。我们所有的精神活动都是相似的，每一种都可能会让人上瘾。[10]。\n这个术语是由Earling(1996)重新发现的，[1]引用了Garth Kidd在1996年2月对该术语的使用。[11]基德描述了长达几天的游戏后画面，以及一种将世界上的一切都识别为由四个正方形组成的趋势，并试图确定它适合的位置。基德将这个词的由来归因于来自澳大利亚阿德莱德的电脑游戏玩家。对这一普遍现象的最早描述出现在尼尔·盖曼(Neil Gaiman)在“数字梦”(Digital Dreams)中的科幻诗歌“病毒”(Virus)(1987)中。“见证者”的结尾类似于俄罗斯方块的效果，未具名的主角从游戏的虚拟现实中被带出来，在现实世界的物体中看到了游戏中的谜题。“证人”的结尾类似于俄罗斯方块的效果，即未具名的主人公被带出游戏的虚拟现实，在现实世界的物体中看到游戏的谜题。\n2018年，Enhance宣布这一术语为PlayStation4上的一款新俄罗斯方块游戏的名称。[13]\n^a b c d e Earling，安妮特(1996年3月21日)。电脑游戏能煎熬你的大脑吗？费城都市报。2008年1月22日从原件存档。\n^a b Stickgold，Robert；Malia，4月；Maguire，Denise；Roddenberry，David；O&#39；Connor，Margaret(2000-10-13)。重演游戏：正常与赦免中的催眠图像。科学。290(5490)：350-353。密码：2000Sci.290..350S。DOI：10.1126/Science.290.5490.350.。ISSN：0036-8075。PMID为11030656。\n^a b Stickgold，R.，为澳大利亚国家广播电台的健康报告(文字稿)，2000年10月30日，诺曼·斯旺采访了他。检索于2020年1月15日。\n丹尼尔·特迪曼(2005年1月11日)。现实世界不使用操纵杆。窃听。从原件存档于2019-12-24。\nOrtiz de Gortari，Angelica(2018年3月12日)。拥抱因玩电子游戏而产生的假性幻觉现象。伽马苏拉。\n^Ortiz de Gortari，Angelica B.(2019年)。游戏转移现象：视频游戏研究领域的起源、发展和贡献。“牛津网络心理学手册”。doi：10.1093/oxfordhb/9780198812746.013.29.。\n奥尔蒂斯·德·戈尔塔里，安吉丽卡·B；格里菲斯，马克·D(2016)。游戏转移现象的流行与特征：描述性调查研究。国际人机交互杂志。32(6)：470-480。DOI：10.1080/10447318.2016.1164430.。ISSN电话：1044-7318。\n杰弗里·戈德史密斯(1994年5月)。这是你在俄罗斯方块上的大脑。有线问题2.05。\n加思·基德(1996-02-20)。虚拟现实未来可能存在的风险。风险文摘：计算机及相关系统对公众的风险论坛。17(78)。\n^Fagan，Kaylee(2018-06-07)。这款华丽的俄罗斯方块新游戏受到科学的启发，可以让你长达数小时的入场时间。商业内幕。", "note_en": "Jump to navigation  Jump to search  The   Tetris effect (also known as   Tetris syndrome) occurs when people devote so much time and attention to an activity that it begins to pattern their  thoughts,  mental images, and  dreams.  [1] It takes its name from the  video game   Tetris.  [1]\n People who have played  Tetris for a prolonged amount of time can find themselves thinking about ways different shapes in the real world can fit together, such as the boxes on a supermarket shelf or the buildings on a street.  [1] They may see coloured images of pieces falling into place on an invisible layout at the edges of their visual fields or when they close their eyes.  [1] They may see such coloured, moving images when they are falling asleep, a form of  hypnagogic imagery.  [2]\n Those experiencing the effect may feel they are unable to prevent the thoughts, images, or dreams from happening.  [3]\n A more comprehensive understanding of the lingering effects of playing video games has been investigated empirically as  Game Transfer Phenomena (GTP).\n   The  Tetris effect can occur with other video games.  [4] It has also been known to occur with non-video games, such as the illusion of curved lines after doing a  jigsaw puzzle, the checker pattern of a chess board, or the involuntary mental visualisation of  Rubik&#39;s Cube algorithms common amongst  speedcubers.\n Robert Stickgold reported on his own experiences of  proprioceptive imagery from rock climbing.  [3] Another example  sea legs are a kind of Tetris effect. A person newly on land after spending long periods at sea may sense illusory rocking motion, having become accustomed to the constant work of adjusting to the boat making such movements (see &#34; Illusions of self-motion&#34; and &#34; Mal de debarquement&#34;). The poem &#34; Boots&#34; by  Rudyard Kipling describes the effect, resulting from repetitive visual experience during a  route march:\n ’Tain’t—so—bad—by—day because o’ company,\n But—night—brings—long—strings—o’ forty thousand million \tBoots—boots—boots—boots—movin’ up an’ down again.\n Mathematicians have reported dreaming of numbers or equations; for example  Srinivasa Ramanujan, or  Friedrich Engels who remarked &#34;last week in a dream I gave a chap my shirt-buttons to  differentiate, and he ran off with them&#34;.  [5]\n  Stickgold et al. (2000) have proposed that  Tetris-effect imagery is a separate form of  memory, likely related to  procedural memory.  [2] This is from their research in which they showed that people with  anterograde amnesia, unable to form new  declarative memories, reported dreaming of falling shapes after playing  Tetris during the day, despite not being able to remember playing the game at all.\n  A series of empirical studies with over 6,000 gamers has been conducted since 2010 into Game Transfer Phenomena ( GTP), a broadening of the Tetris effect concept coined by Angelica B. Ortiz de Gortari in her thesis.  [6] GTP is not limited to altered visual perceptions or mental processes but also includes auditory, tactile and kinaesthetic sensory perceptions, sensations of unreality, and automatic behaviours with video game content. GTP establishes the differences between endogenous (e.g., seeing images with closed eyes, hearing music in the head) and exogenous phenomena (e.g., seeing power bars above people&#39;s head, hearing sounds coming from objects associated with a video game) and between involuntary (e.g., saying something involuntarily with video game content) and voluntary behaviours (e.g., using slang from the video game for amusement).  [7]  [8]  [9]\n  The earliest known reference to the term appears in Jeffrey Goldsmith&#39;s article, &#34;This is Your Brain on  Tetris&#34;, published in   Wired in May 1994:\n No home was sweet without a  Game Boy in 1990. That year, I stayed &#34;for a week&#34; with a friend in Tokyo, and Tetris enslaved my brain. At night, geometric shapes fell in the darkness as I lay on loaned  tatami floor space. Days, I sat on a lavender suede sofa and played Tetris furiously. During rare jaunts from the house, I visually fit cars and trees and people together. [...]\n The Tetris effect is a biochemical, reductionistic metaphor, if you will, for curiosity, invention, the creative urge. To fit shapes together is to organize, to build, to make deals, to fix, to understand, to fold sheets. All of our mental activities are analogous, each as potentially addictive as the next.  [10]\n The term was rediscovered by Earling (1996),  [1] citing a use of the term by Garth Kidd in February 1996.  [11] Kidd described &#34;after-images of the game for up to days afterwards&#34; and &#34;a tendency to identify everything in the world as being made of four squares and attempt to determine &#39;where it fits in&#39;&#34;. Kidd attributed the origin of the term to computer-game players from  Adelaide,  Australia. The earliest description of the general phenomenon appears in  Neil Gaiman&#39;s science fiction poem &#34;Virus&#34;  [12] (1987) in Digital Dreams. The ending of  The Witness resembles the Tetris effect, where the unnamed protagonist is taken out of the game&#39;s  virtual reality and sees the game&#39;s puzzles in real-world objects.\n In 2018, the term was announced as the name of  a new  Tetris game on the  PlayStation 4 by Enhance.  [13]\n    ^     a     b     c     d     e   Earling, Annette (March 21, 1996).  &#34;Do Computer Games Fry Your Brain?&#34;.   Philadelphia City Paper. Archived from  the original on January 22, 2008 .\n ^     a     b   Stickgold, Robert; Malia, April; Maguire, Denise; Roddenberry, David; O&#39;Connor, Margaret (2000-10-13). &#34;Replaying the Game: Hypnagogic Images in Normals and Amnesics&#34;.  Science.  290 (5490): 350–353.  Bibcode: 2000Sci...290..350S.  doi: 10.1126/science.290.5490.350.  ISSN  0036-8075.  PMID  11030656.\n ^     a     b  Stickgold, R., interviewed 30 October 2000 by  Norman Swan for   The Health Report on Australia&#39;s  Radio National ( transcript). Retrieved 15 January 2020.\n ^   Terdiman, Daniel (January 11, 2005).  &#34;Real World Doesn&#39;t Use a Joystick&#34;.  Wired.  Archived from the original on 2019-12-24.\n   ^   Ortiz de Gortari, Angelica (March 12, 2018).  &#34;Embracing pseudo-hallucinatory phenomena induced by playing video games&#34;.  Gamasutra .\n ^   Ortiz de Gortari, Angelica B. (2019).  &#34;Game Transfer Phenomena: Origin, Development, and Contributions to the Video Game Research Field&#34;.  The Oxford Handbook of Cyberpsychology.  doi: 10.1093/oxfordhb/9780198812746.013.29.\n ^   Ortiz de Gortari, Angelica B.; Griffiths, Mark D. (2016).  &#34;Prevalence and characteristics of Game Transfer Phenomena: A descriptive survey study&#34;.  International Journal of Human-Computer Interaction.  32 (6): 470–480.  doi: 10.1080/10447318.2016.1164430.  ISSN  1044-7318.\n ^   Goldsmith, Jeffrey (May 1994).  &#34;This is Your Brain on Tetris&#34;.  Wired Issue 2.05 .\n ^   Kidd, Garth (1996-02-20).  &#34;Possible future risk of virtual reality&#34;.  The RISKS Digest: Forum on Risks to the Public in Computers and Related Systems.  17 (78) .\n  ^   Fagan, Kaylee (2018-06-07).  &#34;This gorgeous new Tetris game is inspired by science to entrance you for hours&#34;.  Business Insider .", "posttime": "2020-05-12 13:50:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "方块,tetris,游戏", "title": "俄罗斯方块效应", "title_en": "The Tetris Effect", "transed": 1, "url": "https://en.wikipedia.org/wiki/Tetris_effect", "via": "", "real_tags": ["方块", "tetris", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "bd0d6088ca9d0ed3c459e756b55bbdab.gif", "infoid": 1001768, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，我一直在帮助新的开发人员创建内容。我准备的其中一个主题是Git。我使用GIT已经超过12年了，在做研究的同时，我很惊讶地学到了新的东西。所以我决定和大家分享一些有用的链接。\n超级完整的GIT小抄。如果您正在寻找可打印的版本，请查看Github PDF小抄。\n如果您正在寻找学习基础知识的教程，请查看BitBucket教程和学习分支的交互式方式。\n您需要航站楼的自动完成功能。有关如何设置它，请查看本教程。\n另外，我很懒，我希望您也是，所以考虑为常用命令使用一些别名。您可以使用诸如git-alias之类的内容，也可以将您自己的内容添加到您的终端配置文件中。下面是我使用的一些别名：alias gs=“git status”alias gull=“git ull--rebase”alias gm=“git Commit-m”\n虽然我大部分时间都在使用终端，但有时我会使用UI编辑器。以下是排名前10位的UI客户端的列表。我过去经常使用Sourcetree。\n我找到了这篇文章，大吃一惊。我在提交之前经常使用git diff(只是为了确保我没有添加任何不必要的内容)。在与fzf的更好的git差异中，拉斐尔·蒙迪奥拉展示了如何改善git差异体验，浏览文件并查看右侧的预览！注意：POST上的确切命令对我不起作用，但我改用了以下命令：fd(){git diff$@--name-only|fzf-m--ansi--review&#34；git diff$@--color=Always--{-1}&#34；}。\n另外，如果您大量使用Github，请查看此2020年推荐的Github集成列表。\n最后，有两个高级命令可以帮助你度过最黑暗的时刻：git reflog。不仅提交可以回滚，Git还保留所有操作的日志，您还可以回顾历史。\n我想用一个有趣的故事来结束。当我们在为演示做准备时，我正在播放一张关于Git是什么的快速幻灯片，有人问我：Git代表什么？老实说，我不知道，所以我做了一些调查：\nGIT不是首字母缩写，在俚语中“GIT”的意思是“愚蠢的人”。Linus Torvalds在创建第一个版本时将其命名为“愚蠢的内容跟踪器”，Git就是这样诞生的！", "note_en": "Recently I have been helping to create content to onboard new developers. One of the topics I prepared was Git. I have been using git for more than 12 years, and while doing research I was surprised to learn new things. So I decided to share some useful links with everyone.\n  Super complete git cheatsheet. If you are looking for a printable version, check  Github PDF cheatsheet.\n If you are looking for some tutorials to learn the basics check  BitBucket tutorials and an  interactive way to learn branching.\n You need autocomplete for the terminal.  Check this tutorial on how to set it up\n Also, I am lazy and I hope you too, so consider having some aliases for common commands. You can use something like  git-alias or add your own to your terminal profile. Here are some of the ones I use: alias gs=”git status”alias gpull=”git pull --rebase”alias gm=”git commit -m”\n While most of the time I use the terminal, sometimes I reach for a UI editor. Here is a list of the  top 10 UI clients. I have used Sourcetree a lot in the past.\n I found this article and blowed my mind. I use git diff a lot before making commits (just to make sure I am not adding anything unnecessary). In  Better git diffs with FZF Rafael Mendiola shows how you can improve the git diff experience, navigate through files and see previews on the right!  NOTE: the exact command on the post did not work for me, but I used this instead: fd() { git diff $@ --name-only | fzf -m --ansi --preview &#34;git diff $@ --color=always -- {-1}&#34;}\n   Also if you use Github intensively check this list of  recommended Github integrations for 2020.\n Lastly, 2 advanced commands that can help you in your darkest moments: git reflog. Not only commits can be rollbacked, Git keeps a log of all the actions, and you can go back in history too.\n I want to end with a funny story. While we were doing prep for the presentation, I was showing a quick slide on what Git is and someone asked me: What does Git stands for? Honestly, I did not know so I did some research:\n Git is not an acronym, in slang “git” means “a stupid person”. Linus Torvalds when he created the first version name it “the stupid content tracker” and that is how Git was born!", "posttime": "2020-05-12 13:35:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "专家,git", "title": "从新手到专家学习Git", "title_en": "Learning Git from Novice to Expert", "transed": 1, "url": "https://juanmanuelalloron.com/2020/04/26/weekly-digest-6-learning-git-from-novice-to-expert", "via": "", "real_tags": ["专家", "git"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001767, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Vacuum是PostgreSQL中的一个子系统，每个版本都会得到改进。“我检查了过去的五个版本，每个版本都有相当多的Vacuum改进。”顺应潮流，在即将发布的PostgreSQL版本(V13)中，Vacuum有很多改进，本文将对此进行报道。\nVacuum将被允许并行处理索引。这意味着它可以利用多个CPU来执行索引清理。这在内部使用PostgreSQL的后台工作进程基础设施来完成工作。*有一个新的选项PARALLEL来控制VACUUM使用的并行度。用户可以使用这个新选项来指定可用于执行VACUUAL命令的工作进程数，该数目受到(A)表上的索引数和(B)max_PARALLEL_Maintenance_WORKS的最小限制。*VACUUAL命令的并行度在默认情况下是启用的，这意味着即使用户没有使用&#39；不指定PARALLEARY选项，它使用的工作进程数等于正在清空的表上的索引数。我们可以通过使用PARALLEL选项将工作进程数指定为零来禁用真空的并行性。*索引可以并行参与。\n并行选项不能与VACUUM命令中的FULL选项一起使用。如果此功能不能通过自动真空使用，用户需要使用VAUAUM命令才能获得此功能提供的好处。\n还有许多其他博客[1][2]显示了此功能的好处。“EnterpriseDB最近发布的一篇博客显示，使用7个工作者可以将吸尘器的速度提高约4倍，特别是当关系非常需要吸尘器时，请阅读该博客以获取有关测试的更多信息。\n在上面的测试中，即使我们指定了4，也使用了2个并行工作进程，原因是索引的数量是3，并且工作进程的数量不能超过索引，这进一步受到max_parallel_maintenance_worker的限制，正如您可以通过下面的命令看到的那样。\n我们在此功能中确保的另一个最重要的事情是，与非并行真空相比，并行不会使用更多的内存或I/O带宽。\n允许插入以触发自动真空活动。*此功能对仅插入表非常有用，在这些表中，反环绕真空可能是表收到的第一个真空，这样的运行将需要很长时间。*此功能允许将堆页设置为全可见，从而允许仅索引扫描跳过堆提取，并在需要冻结表时减少必要的工作。*这由两个新的GUC和relc选项控制：autoVacuum_Vacuum_Insert_Threshold和AutoVacuum_。\n让我用一个例子的帮助来演示这个功能的好处。用autoVacuum_Vacuum_INSERT_THRESHOLD=-1启动服务器(一个人可以编辑postgresql.conf文件来更改这个参数的值，或者可以使用ALTER SYSTEM命令)。*通过连接psql，我们可以执行下面的命令来查看行为。\n几秒钟后，您可以在服务器日志中注意到下面的消息，该消息显示AutoVacuum已经对该表执行了分析。\n日志：自动分析表&#34；postgres.public.vac_ins&#34；系统使用情况：CPU：用户：0.03s，系统：0.11s，已用时间：0.15s。\n这里，&#34；Heap Fetches：99&#34；显示了上面的查询需要访问heap来获取所需的信息，即使它存在于索引中，并且使用的扫描类型是仅索引扫描。\n现在，使用默认值autoVacuum_Vacuum_INSERT_THRESHOLD重新启动服务器，并从psql执行以下命令，查看新功能有何帮助：\n几秒钟后，您可以在服务器日志中注意到下面的消息，它指示AutoVacuum已经在表上执行了VACUUM和ANALYSITY。\n日志：自动分析表&#34；postgres.public.vac_ins&#34；系统使用情况：CPU：用户：0.01s，系统：0.15s，已用时间：0.21s。\n这里，&#34；Heap Fetches：0&#34；显示了上面的查询不需要访问堆来获取所需的信息。我们可以看到，在这种情况下，完成执行的时间大大减少了。\n允许(自动)真空在出错的情况下显示有关堆或索引的附加信息。*此功能可以在数据库有一些损坏的情况下帮助用户。例如，如果关系上的一个索引有一些损坏的数据(由于坏的硬件或某些错误)，它将让用户知道索引信息，用户可以采取适当的操作，如重新编制索引，或者可能删除并重新创建该特定索引来克服该问题。例如，在堆的情况下，它会让用户知道索引信息，并且用户可以采取适当的操作，如重新编制索引或可能删除并重新创建该特定的索引来克服该问题。在堆的情况下，它显示发生错误的块号，这使得用户和开发人员更容易检测到问题。o在最坏的情况下，如果表中的任何特定块损坏，用户可以删除该特定块的所有行，然后可以使用该表。\n接下来，我使用&#34；select*from heap_page_item(GET_RAW_PAGE(&#39；PVAC&#39；，2469))；&#34；查找页面中所有行指针的信息，然后将它们从以下查询中删除。\n现在，您可以看到块号从2469更改为2468，这意味着真空可以继续。因为在这种情况下，我通过更改代码手动诱导了错误，所以每个块都会发生错误，但实际上是针对某些特定的块，一旦用户可以清除这些块，表就可以重复使用。我不想说这是理想的情况，但至少它允许用户继续操作，并且它可以帮助开发人员缩小错误的范围(如果其中有错误的话)。我不想说这是理想的情况，但至少它会允许用户继续操作，并且它可以帮助开发人员缩小错误的范围(如果其中有错误的话)。我不想说这是理想的情况，但至少它会允许用户继续操作，并且它可以帮助开发人员缩小错误的范围(如果其中有错误的话。\n自动真空现在将记录WAL使用率统计信息和其他信息。*WAL使用率包含有关记录总数、整页图像数和总字节数的信息。*缓冲区使用率和WAL使用率统计信息结合在一起，可为我们提供特定自动真空运行时I/O的大致使用率。我举了一个运行信息的例子，它将在下面显示，人们可以参考WAL使用情况来检查关于新添加的统计数据的信息。\n元组：已删除100000个，剩余100000个，0个已死但尚未删除，最早的xmin：529xmin。\n将真空缓冲区计数器设置为64位宽，以避免缓冲区使用统计信息溢出。*如果没有此功能，在极端情况下，如果存在足以容纳40亿次缓冲区访问的表，则显示的统计信息将毫无意义。请参阅下面的pgsql-hacker提供的缓冲区使用统计信息示例(&#39；Buffer Usage&#39；stats of&#39；Buffer Usage&#39；stats from pgsql-hacker)：\n添加等待事件以报告基于成本的真空延迟。这将帮助我们监控[自动]真空节流。这是一个很小的功能，但非常重要，因为目前我们无法监控[自动]真空节流，这种情况在用户环境中并不少见。", "note_en": "Vacuum is one of the sub-systems in PostgreSQL which gets improved with each release.  I have checked past five  releases and each has quite a few improvements for vacuum.  Following the trend, there are a number of improvements in vacuum in the upcoming PostgreSQL release (v13) which are covered in this blog.\n    Vacuum will be allowed to process indexes in parallel. This means it can leverage multiple CPUs in order to perform index cleanup. This internally uses the background worker infrastructure of PostgreSQL to accomplish the work.  There is a new option PARALLEL which controls the parallelism used by vacuum.  Users can use the new option to specify the number of workers that can be used to perform the vacuum command which is limited by the minimum of (a) the number of indexes on a table and (b)  max_parallel_maintenance_workers.  The parallelism for vacuum command is enabled by default which means it will be used even if the user didn&#39;t specify the PARALLEL option and it uses the number of workers equal to the number of indexes on the table being vacuumed.  We can disable parallelism for vacuum by specifying zero as the number of workers with the PARALLEL option.  The index can participate in parallel\n   The PARALLEL option can&#39;t be used with the FULL option in vacuum command.  This feature won&#39;t be available via autovacuum, users need to use vacuum command to get the benefit provided by this feature.\n  There are a number of other blogs [ 1][ 2] written on this topic which shows the benefit of this feature.  A recent  blog published by EnterpriseDB shows that vacuum could be approximately 4 times faster by using 7 workers especially when the relation is in dire need of vacuum, read that blog for more information about the test.\n                       In the above test, 2 parallel workers were used even though we have specified 4 and the reason is that the number of indexes is 3, and the number of workers can&#39;t be more than index which is further limited by max_parallel_maintenance_workers as you can see by command below.\n        The other most important thing we have ensured in this feature is that the parallelism won&#39;t use more memory or I/O bandwidth as compared to non-parallel vacuum.\n    Allow inserts to trigger autovacuum activity.  This feature will be really helpful for the insert-only tables where anti-wraparound vacuums could be the first vacuum that the table ever receives and such a run would take a really long time.   This allows heap pages to be set as all-visible, which then allows index-only scans to skip heap fetches, and reduces the work necessary when the table needs to be frozen.  This is controlled by two new GUCs and reloptions;  autovacuum_vacuum_insert_threshold and  autovacuum_vacuum_insert_scale_factor.\n  Let me demonstrate the benefit of this feature with the help on an example.  Start the server with autovacuum_vacuum_insert_threshold = -1 (one can edit postgresql.conf file to change value of this parameter or can use Alter System command).  By connecting with psql, we can execute below commands to see the behavior.\n               After a few seconds, you can notice the below message in the server log which shows that autovacuum has performed analyze on the table.\n  LOG:  automatic analyze of table &#34;postgres.public.vac_ins&#34; system usage: CPU: user: 0.03 s, system: 0.11 s, elapsed: 0.15 s\n              Here, &#34;Heap Fetches: 99&#34; shows that the above query need to visit heap to fetch the required information even though it is present in index and the scan type used is Index Only Scan.\n     Now, restart the server with a default value of autovacuum_vacuum_insert_threshold and execute below commands from psql to see how the new feature helps:\n           After a few seconds, you can notice the below message in the server log which indicates that autovacuum has performed both vacuum and analyze on the table.\n    LOG:  automatic analyze of table &#34;postgres.public.vac_ins&#34; system usage: CPU: user: 0.01 s, system: 0.15 s, elapsed: 0.21 s\n              Here, &#34;Heap Fetches: 0&#34; shows that the above query doesn&#39;t need to visit heap to fetch the required information. We can see that the time to complete the execution is reduced significantly in this case.\n    Allow an (auto)vacuum to display additional information about the heap or index in case of an error.  This feature could help users in case the database has some corruption.  For example, if one of the indexes on a relation has some corrupted data (due to bad hardware or some bug), it will let the user know the index information, and the user can take appropriate action like either Reindex or maybe drop and recreate that particular index to overcome the problem.  In the case of the heap, it displays the block number for which an error has occurred which makes it much easier for users and developers to detect the problem.  In the worst case, if any particular block is corrupted in a table, users can remove all the rows of that particular block and the table can be used.\n      Next, I used &#34;SELECT * FROM heap_page_items(get_raw_page(&#39;pvac&#39;, 2469));&#34; to find the information of all line pointers in the page and then removed them from using below query.\n           Now, you can see the block number is changed from 2469 to 2468 which means the vacuum could proceed.  As, in this case, I have manually induced the error by changing code, so it occurs for every block but in reality it would be for some particular block(s) and once user can get rid of those block(s), the table can be reused.  I don&#39;t want to say that is an ideal situation but at least it will allow users to proceed and it can help developers to narrow down the bug if there is any in the code.\n    Autovacuum will now log WAL usage statistics along with other information.  The WAL usage contains information on the total number of records, number of full pages images, and the total number of bytes.  The buffer usage and WAL usage stats combined gives us approximate usage of I/O by a particular autovacuum run. I took one example runs information which will be shown below, one can refer to &#34;WAL usage&#34; to check the information on newly added stats.\n    tuples: 100000 removed, 100000 remain, 0 are dead but not yet removable, oldest xmin: 529\n        Make vacuum buffer counters 64-bits wide to avoid overflow of buffer usage stats.  Without this feature, in extreme cases, if there exist tables that are large enough for 4 billion buffer accesses to be a possibility, the stats displayed are meaningless.  See below example of &#39;buffer usage&#39; stats from pgsql-hackers:\n           Add wait event &#39;VacuumDelay&#39; to report on cost-based vacuum delay.  This will help us to monitor the [auto]vacuum throttling.  This is a small feature but quite important as right now we have no way to monitor [auto]vacuum throttling and it is not very uncommon to see this in user environments.", "posttime": "2020-05-12 13:35:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgresql,改进,auto", "title": "PostgreSQL 13中改进的(自动)真空", "title_en": "Improved (auto)vacuum in PostgreSQL 13", "transed": 1, "url": "https://amitkapila16.blogspot.com/2020/05/improved-autovacuum-in-postgresql-13.html", "via": "", "real_tags": ["改进", "auto"]}, {"category": "", "categoryclass": "", "imagename": "9ea17e2b1eb8e19bfb976b3187e5d3cf.png", "infoid": 1001766, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "免费开放源码软件(FOSS)列表，用于节省Android-Freedom and Privacy(自由与隐私)。-offa/android-foss", "note_en": "A list of Free and Open Source Software (FOSS) for Android – saving Freedom and Privacy. - offa/android-foss", "posttime": "2020-05-12 13:34:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,程序,软件,android,app", "title": "适用于Android的自由/开源软件应用程序列表", "title_en": "A list of FOSS apps for Android", "transed": 1, "url": "https://github.com/offa/android-foss", "via": "", "real_tags": ["开源", "程序", "软件", "android", "app"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001765, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你想学习新技能，努力做什么和怎么做，你并不孤单。我去过那里，很多人都经历过同样的困惑。\n我发现学习新技能最有效的方法是重新创作(或复制)这一领域的大师/专家的作品。挑选一些顶尖人物和他们的一些作品。试着在他们的指导下(最好)或没有他们的指导下自己重新创作他们的作品。\n这种学习方法对人类来说是很自然的。蹒跚学步的孩子通过模仿来学习一门语言，尽管他们不懂它是怎么写的。他们不会自己发明一种新的语言。模仿他人作品的能力在我们的基因和社会中根深蒂固。但这背后有几个科学原因。\n首先，你对你的工作有多好有一个衡量标准。如果你在做你自己的工作，你不知道它是好是坏，直到另一个人评判你的工作。如果你在抄袭一位大师的作品，很容易看出这两件作品的不同之处，而你自己也可以判断自己的进步。\n其次，这可以让你学习你所在领域的基础知识。伟大的作品总是建立在其他伟大作品的基础上。伟大的艺术家总是从其他艺术家那里获得灵感，无论他们的作品多么原创。复制大师可以让你在发明任何新东西之前将基本技能内在化。\n你更有可能走上一个好的学习方向，而不是在不同的路线上徘徊。这可能会为你节省大量的时间，让你取得更快的进步。\n不要担心你的作品会看起来像你的主人。每个人都是不同的，没有两个人最终会创造出相同的东西。另外，如果你很棒，你不想被贴上别人的模仿者的标签。担心成为别人的复制品并不是你一开始就必须担心的事情。\n复制母版的第三个原因是为了保存你的脑力。这并不是很明显，但可能是决定您是否要继续的一个因素。\n我们的大脑用最少的努力做一些事情，不需要做太多的决定。复制比发明容易，而且需要更少的脑力。当你自己发明的时候，你必须在两者之间做出很多决定，这会降低你的脑力。\n诚然，我们在奋斗中学到了更多东西，但一开始奋斗得太多可能会阻碍学习者继续他们的道路。把苦苦挣扎的事留到学习的后期吧。\n这与我们的习惯有一定的科学联系。养成习惯的关键是一致性，而不是强度。持续学习的关键是中等难度的重复。\n每个人都知道，开始工作并积聚动力是最具挑战性的部分。如果你能不费吹灰之力就能做到某件事，你就更有可能保持这种行为。创作一些看起来像样的东西(因为这是大师作品的复制品)会给你带来一些继续下去的满足感。直接奖励是触发你的大脑继续做某事的信号。\n复制大师作品的最后一个社会效益是让你有机会与专家互动。每个人都喜欢与了解自己工作的人交谈。通过了解专家的工作，您可以与他们建立一种天然的联系。如果你联系他们，他们更有可能做出回应，这可能是你职业生涯的重要纽带。\n复制母版是在您学习了您的领域的基础知识之后的一个步骤。如果孩子不知道什么是字母，你就不能让他写一段话。\n在任何领域，总有一些鼓舞人心的东西让你重新创造。如果你是一名设计师，从Dirbbble拿起一个好的设计，然后试着找出如何做到这一点。如果您是一名程序员，可以选择一个相当大的开放源码项目，并学习如何从头开始创建。\n永远不要害怕向专家请教。你给了他们一个帮助别人的机会，这是在帮他们的忙！\n当你完成了几个项目后，你就开始品尝什么是好作品，以及如何创作好作品。这是你开始内化你的技能的时刻。如果你达到这种状态，你可以在没有任何其他帮助或指导的情况下自学。\n这一策略适用的不仅仅是硬技能。你可以通过与你钦佩的人一起工作来建立你的职业生涯。你不仅能练就扎实的技能，还能拓展一个网络，为你未来的职业生涯提供支持。\n如果你把大师的作品留给自己或者得到作者的批准用于商业用途，那么复制大师的作品就不是剽窃。老实说，师父的作品往往很有名，其他人都会认领他们的作品。在互联网和技术日益普及的今天，在没有事先通知的情况下很难剽窃。\n订阅此时事通讯，成为更好的思考者和创造者(没有垃圾邮件)。我会每周给你寄一份关于学习、创业和心智模式的时事通讯。", "note_en": "If you want to learn new skills and struggle what to do and how to do, you are not alone. I have been there and many people do going through the same confusion.\n What I find the most effective way to learn new skills is recreating (or copying) works from the master/expert in the field. Pick a few top people and a few of their works. Try recreating their work yourselves with (preferably) or without their instruction.\n  This learning method is natural to humans. Toddlers learn a language by imitation though they do not understand how it is written. They do not invent a new language on their own. The ability to mimic other&#39;s work is ingrained in our genes and society. But there are a few scientific reasons behind this.\n First, you have a measurement of how good your work is. If you are doing your own work you have no idea if it is good or bad until another person judges your work. If you are copying a master&#39;s work, it&#39;s very easy to see the difference between the two works and you yourselves can judge your progress.\n  Secondly, this allows you to learn the fundamental of your field. Great work is always based on other great works. Great artists always have inspiration from other artists no matter how original their work is. Copying the master allows you to internalize the fundamental skills before you can invent anything new.\n You are more likely to go on a good direction of learning rather than wandering around in different routes. This might save you tons of time and let you make faster progress.\n Don&#39;t worry that your work will look like your master&#39;s. Everyone is different and no two persons will create the same thing eventually. Plus if you are great, you do not want to be labeled as a copycat of some other. Worrying to become a copy of others is not something you have to fret at the start.\n The third reason for copying the master is for conserving your mental strength. This is not so obvious to notice but could be a deciding factor if you want to continue or not.\n  Our brain is wired to do something with the least effort and without taking much decision. Copying is easier than inventing and requires less mental strength. When you invent by yourself, you have to make lots of decisions in between and this reduces your mental strength.\n It is true that we learn more while we struggle but struggling too much at the beginning it can discourage the learner to continue their path. Save the struggling till the later phase of learning.\n This has some scientific tie to our habit. The key to building a habit is consistency, not intensity. The key to continuous learning is repetition with moderate difficulty.\n Everyone knows that getting things started and building momentum is the most challenging part. If you can do something with little effort, you are more likely to keep that behavior. And creating something that looks decent (since this is a copy of the master&#39;s work) gives you some satisfaction to continue. Immediate reward is a signal to trigger your brain to continue doing something.\n The last social benefit of copying a master&#39;s work is to give you a chance to interact with the expert. Everyone loves talking with people who understand their work. You create a natural bonding with expert by understanding their work. If you reach out to them, they are more likely to respond and this might be an important connection for your career.\n  Copying the master is a step after you learn the basics of your fields. You cannot tell a child to write a paragraph if it does not know what a letter is.\n In any field, there is always something inspiring for you to recreate. If you are a designer, pick up a good design from Dirbbble and try to figure out how to do it. If you are a programmer, pick up a decent-sized open source project and learn how to create from scratch.\n Never be afraid to ask an expert. You are doing them a favor by giving them a chance to help other people!\n When you have done a few projects, you start developing a  taste of what is good work and how to create good work. It is the moment when you start internalizing your skills. If you get to this state, you can self-study without any other help or guidance.\n This strategy applies for more than hard skills. You can build your career by  working with the people you admire. You not only build hard skills but also expand a network that can support your future career.\n Copying a master&#39;s work is not  plagiarism if you keep the work for yourself or get the author&#39;s approval for commercial usage. To be honest, master&#39;s works are often well-known enough for others to claim their work. With the proliferation of the Internet and technology today, it&#39;s hard to plagiarize without notice.\n  Subscribe to this newsletter to become a better thinker and maker (no spam). I will send you a weekly newsletter on learning, entrepreneurship and mental models.", "posttime": "2020-05-12 13:34:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抄袭,afraid,学习", "title": "不要怕抄袭母版", "title_en": "Don't be afraid of copying the master", "transed": 1, "url": "https://www.tyroway.com/blog/dont-be-afraid-of-copying-the-master/", "via": "", "real_tags": ["抄袭", "afraid", "学习"]}, {"category": "", "categoryclass": "", "imagename": "a3927436930ff88e131bc901dab8b11a.jpg", "infoid": 1001764, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我已经把每件事都做对了，但是已经是凌晨2点了，我还是睡不着觉。我在睡觉前已经冥想了30分钟。为了保险起见，我甚至吃了几片褪黑激素药片。然而，在这里，我完全醒着，担心第二天上班会变得多么疲惫。\n我的问题并不是独一无二的。在美国，每10个成年人中就有一个会经历慢性失眠1。只需一晚睡眠不佳，就会演变成长期的睡眠问题。这是因为大多数睡眠问题源于焦虑和担忧2.你越担心睡眠不足，你的睡眠就越差。\n对我来说，我的睡眠问题从大学一开始就开始了。我刚开始一份软件工程师的工作，我开始感受到压力。我有几个重要的最后期限快到了，有一天晚上我发现自己辗转反侧，无法入睡。我的脑子一直在飞驰，一直想着我要做的所有工作，直到我终于睡着了。\n我以为就是这样了--一个不寻常的夜晚，但后来又发生了。这一次，我的观点改变了。我开始担心睡眠不足会如何影响我的一天。我在网上查阅了基本的睡眠卫生提示，并决定额外早点上床睡觉，以确保我能弥补失去的睡眠。结果适得其反，我花了几个小时才最终入睡。\n在这一点上，我的睡眠挣扎开始变得更加规律。我下载了几款冥想应用程序，希望冥想和聆听舒缓的声音能帮助我睡得更好。我甚至在入睡时间太长的晚上求助于柜台上的助眠器。结果好坏参半--我会更快入睡，但随着时间的推移，我会回到睡眠不佳的状态。\n我最终屈服了，决定试试处方药。我读了很多关于它们的书，由于它们的长期副作用，我非常不情愿。在去看医生的时候，我问她是否可以给我开一些帮助我睡眠的药。她说她可以，但不会是药物治疗。取而代之的是，她推荐了CBT-I(失眠认知行为疗法)治疗师。\nCBT-I是一种以证据为基础(在临床试验中得到证实)的技术，用于治疗睡眠问题3.有两种驱动力诱导睡眠-睡眠驱动力和精神唤醒。你的睡眠驱动力就是你上床睡觉时感觉有多困/有多累。你的精神唤醒是当你上床睡觉时你感觉到的快速思维和警觉性。当你的睡眠驱动力很高，而你的唤醒水平较低时，就更容易入睡。CBT-I规定了一个睡眠时间表，以确保你有一个高睡眠驱动力。它还教会你减少担忧和降低唤醒的技巧。\nCBT-I对治疗睡眠问题非常有效。临床试验表明，80%遵循良好CBT-I计划的人在4号结束时会有正常的睡眠。这一结果也是永久性的，不像助眠剂只有在你服用它们的情况下才有效。\n我和一位治疗师一起接受了为期3个月的CBT-I项目。我们开始限制我在床上的时间，以增加我的睡眠驱动力。我开始注意到，在我第一周的最后一周，我睡觉的时间减少了。到了第三周，我睡得更多了，持续入睡的时间变少了。节目结束时，我每晚的睡眠时间超过7个小时。更重要的是，我没有整天担心我的睡眠。\nCBT-I并不是一个简单的解决方案。睡眠时间表很难遵循，结果也不是立竿见影的。这需要时间和精力，但永久改善睡眠的回报是非常值得的。我很感激有一位教练帮我完成了旅途。如果你决定试一试，让我知道它是否能帮助你改善睡眠。在这里，祝你早日睡得更好。CBT-我改变了我的生活，但这个项目花了我700美元。我很幸运，有钱买得起它，但对许多人来说，它远远超出了价格范围。我们建造了Sleepedy，希望让教练指导的CBT-I项目更容易负担得起。如果您想了解更多信息，请访问我们的网站或下载下面的iOS应用程序。", "note_en": "I&#39;d done everything right, yet it was 2 am and I still couldn&#39;t sleep. I had meditated for 30 minutes before I went to bed. I even took a couple of melatonin pills right after to be sure. Yet, here I was wide awake dreading how exhausted I would be the next day at work.\n My problem wasn&#39;t unique. In America, one in every 10 adults will experience chronic insomnia  1. It takes just one poor night of sleep to devolve into long term sleeping problems. This is because the majority of sleeping problems stem from anxiety and worry  2.  The more you worry about not getting enough sleep, the worse your sleep gets.\n For me, my sleeping issues began right out of college. I had started a job as a software engineer and I was starting to feel the pressure. I had a couple of big deadlines coming up and I found myself tossing and turning unable to sleep one night. My mind kept racing, thinking about all the work I had until I finally fell asleep.\n I thought that was it — an abnormal night, but then it happened again. This time, my outlook changed. I started worrying about how not getting enough sleep would affect my day. I looked up basic sleep hygiene tips online and decided to go to bed extra early to make sure I made up for lost sleep. This ended up backfiring and it took a few hours before I could finally sleep.\n At this point, my sleeping struggles started becoming more regular. I downloaded a couple of meditation apps in the hopes that meditating and listening to soothing sounds would help me sleep better. I even resorted to over the counter sleeping aids on nights when it took me too long to fall asleep.  The results were mixed — I&#39;d fall asleep faster but over time I&#39;d revert back to having poor sleep.\n I finally caved and decided to try prescription medication. I had read a lot about them and was very reluctant because of their long term side effects. On a visit to my doctor, I asked her if she could prescribe me something to help me sleep. She said she said she could, but it wasn&#39;t going to be medication. Instead, she put in a referral to a CBT-I (Cognitive Behavioral Therapy for Insomnia) therapist.\n CBT-I is an evidence-based (proven in clinical trials) technique used to treat sleep problems  3.  Two driving forces induce sleep — sleep drive &amp; mental arousal. Your sleep drive is how sleepy/tired you feel when going to bed. Your mental arousal is the racing thoughts and alertness you feel when you go to bed. When your sleep drive is high and your arousal levels are low; it is easier to fall asleep. CBT-I prescribes a sleep schedule that ensures you have a high sleep drive. It also teaches you techniques to worry less and reduce your arousal.\n CBT-I is extremely effective in treating sleeping problems. Clinical trials have shown that 80% of people that follow a good CBT-I program will have normal sleep by the end  4. The results are also permanent, unlike sleeping aids which are effective only as long as you are taking them  5.\n I underwent a CBT-I program with a therapist for 3 months. We started by restricting the time I spent in bed to increase my sleep drive. I started noticing a decrease in the amount of time it took me to sleep by the end of my first week. By the third week, I was sleeping more and taking less time to fall asleep consistently. At the end of the program, I was sleeping over 7 hours a night. More importantly, I wasn&#39;t spending my days worrying about my sleep.\n CBT-I isn&#39;t an easy solution. The sleep schedules are hard to follow and the results aren&#39;t instantaneous. It takes time and effort but the reward of permanently improved sleep is well worth it. I&#39;m grateful to have had a coach help me through my journey. Let me know if you do decide to try it and if it helps you improve your sleep. Here&#39;s to hoping you get better sleep soon. CBT-I changed my life, but the program cost me $700 out of pocket. I was fortunate to have had the means to afford it but it is well out of the price range for many people. We built Sleepedy with the hopes of making access to a coach-led CBT-I program more affordable. If you&#39;d like to know more, check out our website or download our iOS app below.", "posttime": "2020-05-12 11:56:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "患者,journey,睡眠", "title": "失眠症患者的规律睡眠之旅", "title_en": "An Insomniac's journey to regular sleep", "transed": 1, "url": "https://www.sleepedy.com/articles/insomniac-to-normal-sleep", "via": "", "real_tags": ["患者", "journey", "睡眠"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001763, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在YouTube上推广的所有产品中，哪一个是最好的？虽然我想通过参加一门合法的课程来减少我的学习曲线，但我也不想付钱给那些在亚马逊上实际上并不成功地建立了一项有利可图的业务的人。\n亚马逊的商业课程与大多数“如何在线赚钱”课程的规则是一样的：很多都是骗局，但也有一些是合法的学习机会。\n所有销售“在亚马逊上建立有利可图的业务”课程的人真的在亚马逊上建立了有利可图的业务吗？绝对不行-在他们开始销售课程之前，没有实体来审查他们的申请。你不一定要自己完成某件事，才能宣称你可以教别人去做。\n然而，他们中的一些人做了他们声称能够教的事情。诀窍在于学会如何辨别哪个是哪个。这里有一些避免诈骗的方法。\n检查是否符合FTC合规性要求某些索赔的公司必须遵守FTC的商机规则。\n这条规则的一个要求是，如果一家公司声称你在购买他们的系统后可以赚到一定数量的钱(“在第一个月赚到1万美元！”)，它必须提供一份收入申报单。这一声明必须提供证据，证明人们确实可以使用他们的方法赚取那么多钱。第二个要求是，该公司必须提供一份关于其业务的披露文件。\n如果一家公司是个骗局，它很可能不会遵守联邦贸易委员会的这一规定。在你购买做出这些承诺的课程之前，询问他们的收入申报单和披露文件。如果卖家不能立即提供这些信息，那很可能是个骗局。\n然而，阅读细则联邦贸易委员会给骗子留下了一个漏洞。如果课程的卖家声明他们的方法“并不适用于所有人”，他们就可以避免联邦贸易委员会的压力来支持他们的主张。如果你在小字上看到这句话的某些版本，可能意味着很多人在尝试课程倡导的方法时赔钱了。\n与以前的学习者联系如果一门课程是合法的，其他人以前就会选修它并取得成功。你可以让卖家帮你联系以前的学员。\n当然，这并不能保证他们不会将你与他们付钱购买评论的假“学生”联系起来(或者与冒充学生的卖家联系起来)。然而，如果他们能把你和几个以前的学生联系起来，并且毫不犹豫地这么做，这可能是一个迹象(尽管不能保证)这是一门合法的课程。\n如果你确实和以前的学员交谈过，询问他们的具体情况，比如他们实际上能够从他们的业务中赚到多少钱，以及实现这一目标需要花费多少钱。\n阅读在线评论总是在你投资一门课程之前在谷歌上快速搜索一下。如果很多人都对它持负面评价或称其为骗局，那就是一个明显的危险信号。然而，请记住，缺乏信息也可能是一个不好的迹象，积极的评论可能是有偿的，也可能是虚假的，所以它们并不是合法性的确切标志。\n检查语言骗局往往言过其实，而真正的课程会更切合实际。当然，任何语言都会试图引诱你购买，但寻找太好而不真实的说法是值得的。\n诈骗课程经常声称提供了一个“经过验证的系统”，或者保证用最少的工作就能快速获利。真正的课程将现实地看待建立一个有利可图的亚马逊业务所涉及的时间和精力，以及并不是每个尝试过的人都能成功的事实。警惕那些听起来容易的课程。\n此外，要警惕那些表明购买课程没有风险的退款政策。诈骗者经常声称他们会退还你的钱，但实际上并不打算这样做。\n当心咄咄逼人的免费赠品，许多骗局用免费的电话或咨询把你拉进来。然而，合法的课程也可能试图用免费的东西来吸引你。不同的是，骗子会在谈话中向你施压，要求你立即购买他们的课程。合法的卖家不会试图说服你必须现在买入，以免错失良机。\n了解亚马逊的服务条款诈骗者经常出售实际上违反亚马逊服务条款的提示，并可能导致您在网站上被禁止。即使是合法的课程也可能意外地提供违反这些条款的提示。一定要熟悉服务条款，不要把钱花在任何暗示你违反服务条款的课程上。\n即使不是为了诈骗你的非诈骗者课程也要警惕，因为它可能不会提供最好的信息。在真正想提供帮助的卖家中，提供的课程质量差异很大。\n因此，一旦你确定一门课程不是骗局，就继续批判性地思考，以确定它是否真的值得你花钱。例如，一些课程提供了非常基本的信息，你可以很容易地在其他地方免费获得。\n尽管许多课程都声称，在亚马逊上销售没有什么秘密。一门好的课程会简单地整理一些信息，虽然你可以在其他地方找到这些信息，但很难在一个地方找到所有的信息。\n亚马逊最好的课程是什么？即使经过仔细的研究，卖家也很难区分哪些课程是合法的，哪些是不合法的。\n因为在你选修一门课程(或与卖家和以前的学生详细交谈)之前，很难判断这门课程的合法性，所以我们不能推荐一门具体的课程作为“最好的”。不过，让我们看看您提到的课程，再加上一个可能值得您花费时间和金钱的课程来源。\n九大是九大合法吗？快速浏览一下他们的网站就会发现答案可能是否定的。\n该网站的许多方面看起来都很有希望，比如主页上详细的成功故事。然而，在页面的底部，有一份免责声明，其中包括这样的文字：“老实说，如果你正在阅读这份免责声明，并想知道这是不是某种‘骗局’，你可能还没有准备好成为一名企业家。”一家合法的公司不太可能对怀疑者如此不屑一顾--相反，它会提供合法性的证据。\n该网站也让人很难知道这门课程的费用是多少，但似乎是1,997美元。对于学习如何在亚马逊上获利来说，这是一个非常高的价格：这是许多人自学的。就算九大不是骗局，也可能不值这个价。\n丛林童子军有趣的是，丛林童子军实际上并不是一门课程。相反，它是一个订阅网站，帮助亚马逊进行产品研究。你可能最终会决定你不需要它，但这可能不是一个骗局-你可以尝试一下(49美元/月，不是一笔巨大的投资)，然后如果它对你不起作用就取消你的订阅。\n电子商务帝国建设者和九大一样，很难说电子商务帝国建设者是不是一个骗局。然而，其网站上的说法听起来肯定好得令人难以置信。\n例如，如果您观看免费培训，主页承诺提供“3500美元/周的免费销售漏斗模板”。这是一个很高的要求，而且不太可能每个使用该模板的人都能真正看到这样的销售。\n这个网站也让你很难看到费用，但其他消息来源建议你为这门课程支付997美元-对于不能保证的信息来说，这是另一个高昂的价格。记住，即使你找到了一条好的路线，也不能保证你的亚马逊商店一定会成功，因为电子商务世界竞争非常激烈，变化很快。\nUdemy如果你真的想参加亚马逊的商业课程，我们建议你从Udemy上提供的课程开始，而不是上面列出的昂贵的大牌课程。\nUdemy仅仅是一个聚合各种主题课程的网站。不能保证在这个平台上的课程是有价值的。但好消息是，你可以在那里找到许多低成本的亚马逊FBA课程，这些课程往往有很多用户评论。\n参加几个便宜的Udemy课程来学习基础知识，你可能会发现1000美元和2000美元的课程看起来没那么有吸引力。\n许多Udemy课程也关注在亚马逊上销售的具体方面，而不是一刀切的“如何盈利”的方法。这让你可以将自己的研究与便宜的Udemy课程结合起来，以填补你的知识空白-如果一门课程最终被证明不是那么好，至少你不会在它上面花费太多钱。\n最后想一想，诈骗者很容易使用营销策略来让他们的课程看起来合法。许多备受瞩目的亚马逊课程骗局在买家已经花费了数千美元之前，几乎没有显示出警告信号。\n热情洋溢的在线评论和高调的在线出版物中的提及并不能保证一门课程是合法的。需要大量的研究才能弄清楚哪些是骗局，哪些不是，这就是为什么我们不会对这里提到的课程做出任何特定的声明-但我们会说它们看起来太好了，不像是真的。\n如果你能轻松地花掉1000美元或更多，并且渴望参加一门昂贵的课程，那很好，但请记住，那里有比合法课程多得多的骗局。即使是合法的也不太可能教会你什么特别革命性的东西。一旦你在一门课程上花了钱，大多数卖家就会使用精明的营销策略来让你继续花钱。因此，我们建议从便宜或免费的信息开始。这可能需要更长一点的时间，但所花费的时间可以为您节省数千美元。\n回答这个问题", "note_en": "Which one is the best of all the ones being promoted on YouTube? While I would like to reduce my learning curve by taking a legitimate course, I also don’t want to pay someone who isn’t actually successful at building a profitable business on Amazon.\n       Amazon business courses are subject to the same rule that governs most “how to make money online” courses: many are scams, but some are legitimate learning opportunities.\n  Have all the people selling “Build a Profitable Business on Amazon” courses actually built a profitable business on Amazon? Absolutely not - there’s no entity to vet their claims before they start selling courses. You don’t have to accomplish something yourself in order to claim that you can teach someone else to do it.\n  However, some of them have done what they claim to be able to teach. The trick lies in learning how to tell which is which. Here are some ways to steer clear of scams.\n   Check for FTC Compliance    Companies that make certain claims are required to  comply with the   FTC’s Business Opportunity Rule .\n  One requirement of this rule is that, if a company claims you can make a certain amount of money after buying into their system (“Make up to $10,000 in your first month!”), it has to provide an earnings claim statement. That statement must offer proof that people can actually earn that amount using their methods. A second requirement is that the company has to offer a disclosure document about their business.\n  If a company is a scam, it probably won’t comply with this FTC rule. Before you buy a course that makes these promises, ask for their earnings claim statement and disclosure document. If the seller can’t provide that information immediately, it’s probably a scam.\n   Read the Fine Print   The FTC has   left a loophole  for scammers, though. If the seller of a course states that their method “doesn’t work for everyone,” they can avoid the FTC pressure to back up their claims. If you see some version of this statement in the fine print, it could mean lots of people have lost money trying the methods the course advocates.\n   Connect with Former Learners    If a course is legit, other people will have taken it before and succeeded. You can ask the seller to connect you with former students from the course.\n  Of course, this doesn’t guarantee that they won’t connect you with bogus “students” who they’ve paid for reviews (or with one of the sellers posing as a student). However, if they can connect you with several former students and don’t hesitate to do so, that may be a sign (though not a guarantee) that it’s a legit course.\n  If you do talk to former learners, ask for specifics, such as how much they were actually able to earn from their business and what it took to get there.\n   Read Online Reviews   Always do a quick Google search before you invest in a course. If lots of people have reviewed it negatively or called it a scam, that’s an obvious red flag. However, keep in mind that a lack of information may also be a bad sign, and positive reviews can be paid-for or fake, so they aren’t a sure sign of legitimacy.\n   Check the Language    Scams tend to over-promise, while genuine courses will be more realistic. Of course, any course will use language that tries to entice you to buy, but it’s worthwhile to look for too-good-to-be-true claims.\n  Scam courses often claim to offer a “proven system,” or guarantee fast profits with minimal work. Real courses will be realistic about the time and effort involved in building a profitable Amazon business, and the fact that not everyone who attempts it succeeds. Be wary of courses that make it sound easy.\n  Also, be wary of refund policies that suggest there’s no risk involved in buying a course. Scammers often claim they’ll refund your money with no intention of actually doing so.\n   Watch out for Pushy Freebies   Many scams rope you in with a free call or consultation. Legitimate courses may also try to hook you with a freebie, though. The difference is that the scammers will put pressure on you to buy their course right away during the conversation. A legitimate seller won’t try to convince you that you must  buy now  to avoid missing out.\n   Learn Amazon’s Terms of Service   Scammers often sell tips that actually   violate Amazon’s terms of service  and could get you banned from the site. Even legitimate courses may accidentally offer tips that violate those terms. Make sure to get familiar with the terms of service, and don’t spend money on any course that suggests you violate them.\n   Be Wary Even of Non-Scammers   Courses that aren’t aiming to scam you still may not provide the best information. Among sellers who genuinely want to help, there’s a large range in the quality of courses offered.\n  So, once you’ve determined a course isn’t a scam, keep thinking critically to determine if it’s really worth your money. Some courses offer very basic information that you can easily get for free elsewhere, for example.\n  Despite what many courses claim, there are no secrets to selling on Amazon. A good course will simply collate information that, while you could find it elsewhere, would be hard to find all in one place.\n      What’s the Best Amazon Course?    Even with careful research, sellers make it very hard to tell which courses are legit and which aren’t.\n  Because it’s so hard to tell the legitimacy of a course until you’ve taken it (or spoken at length with the sellers and former students), we can’t recommend one specific course as the “best.” However, let’s take a look at the courses you mentioned, plus one source for courses that might be worth your time and money.\n   Nine University   Is Nine University legit? A quick glance at their website suggests that the answer may be no.\n  Many aspects of the site look promising, such as the detailed success stories on the homepage. However, at the bottom of the page, there’s a disclaimer that includes this  text: “Honestly, if you are reading this disclaimer and wondering whether this is a ‘scam’ of some sort, you probably aren’t ready to be an entrepreneur.” A legitimate company isn’t likely to be so dismissive of skeptics - it would offer proof of legitimacy instead.\n  The site also makes it difficult to tell how much this course costs, but it appears to be  $1,997. That’s a very high price tag for learning how to profit on Amazon: something that many people have taught themselves. Even if Nine University isn’t a scam, it’s likely not worth that price.\n   Jungle Scout    Interestingly, Jungle Scout isn’t actually a course. Instead, it’s a subscription-based site that helps with Amazon product research. You may ultimately decide you don’t need it, but it’s probably not a scam - you can try it (for $49/month, not a huge investment) and then cancel your subscription if it doesn’t work for you.\n   Ecommerce Empire Builders   As with Nine University, it’s hard to say for certain whether or not Ecommerce Empire Builders is a scam. However, the claims on its site certainly sound too good to be true.\n  For example, the homepage promises a “Free $3,500/Wk Sales Funnel Template” if you watch the free training. That’s a high claim, and it’s very unlikely that everyone who uses the template will actually see sales like that.\n  This site also makes it hard to see the cost, but other sources suggest that you’d pay  $997 for the course - another high price tag for information that can’t be guaranteed. Remember that even if you find a good course, there’s no guarantee that your Amazon store will be a success, since the eCommerce world is very competitive and changes fast.\n   Udemy   If you do want to take an Amazon business course, we suggest starting with   those offered on Udemy , rather than the high-cost, big-name courses listed above.\n  Udemy is simply a site that aggregates courses on a variety of topics. There’s no promise that a course on the platform is valuable. But the good news is that you can find many low-cost Amazon FBA courses there, which often have many user reviews.\n  Take a few inexpensive Udemy courses to learn the basics, and you’ll probably find that the $1,000 and $2,000 courses look far less appealing.\n  Many Udemy courses also focus on specific aspects of selling on Amazon, rather than a one-size-fits-all “how to make a profit” approach. This lets you combine your own research with cheap Udemy courses to fill in your knowledge gaps - and if a course turns out to be not that great, at least you won’t have spent much on it.\n   Final Thoughts    It’s very easy for scammers to use marketing tactics to make their courses appear legitimate. Many high-profile Amazon course scams showed few or no warning signs to buyers until they had already spent thousands.\n  Glowing online reviews and mentions in high-profile online publications don’t guarantee a course is legit. It takes a lot of research to figure out which are scams and which aren’t, which is why we won’t make any certain claims about the courses mentioned here - but we will say that they look too good to be true.\n  If you can easily spare $1,000 or more and are dying to take a pricey course, that’s fine, but remember that there are far more scams than legitimate courses out there. Even the legitimate ones aren’t likely to teach you anything particularly revolutionary. And once you’ve spent money on a course, most sellers will use savvy marketing tactics to get you to keep spending. So, we recommend starting with inexpensive or free information instead. It may take a little longer, but the time spent could save you thousands of dollars.\n  Answer this question", "posttime": "2020-05-12 11:55:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,有利可图,build,课程", "title": "关于“在亚马逊上建立有利可图的业务”课程的真相", "title_en": "The Truth About “Build a Profitable Business on Amazon” Courses", "transed": 1, "url": "https://capitalandgrowth.org/answers/3231378/Are-Build-a-Profitable-Business-on-Amazon-courses-like-NineUniversity-Jungle-Scout-a-scam", "via": "", "real_tags": ["亚马逊", "amazon", "有利可图", "build", "课程"]}]