[{"category": "", "categoryclass": "", "imagename": "33de3e2c1862644b9a9f91817794cfc2.jpg", "infoid": 1011971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "C系列融资由Draper ESPRIT牵头，现有投资者Amadeus Capital Partners、Blackfin Tech和Psience Capital参与其中。Rvelin在2018年9月披露了1000万美元的B系列资金。\nRavvelin于2016年推出，利用机器学习和图形网络技术帮助在线企业减少欺诈损失，提高订单接受率。这个想法是要废除更粗糙的、基于规则的系统，并使用机器学习来否定假阳性，并给商家更多接受客户/交易的信心。\n至于产品市场适合性，ravelin表示，它最初在大规模的食品和出租车市场取得了成功，但后来扩展到旅游、票务、娱乐、游戏、博彩和零售领域。除了识别信用卡欺诈外，ravelin还与客户合作，查找被泄露的账户(称为“账户接管”)，发现激励滥用行为，并打击市场中的供应商欺诈行为。\n账户接管是指欺诈者使用在数据泄露中暴露的凭证来接管个人的在线账户供自己使用或在黑暗网络上销售。Ravvelin的首席营销官Gerry Carr解释说：“我们有一种产品，首先可以帮助保护账户，识别风险账户，并帮助商家收回原始用户的账户。”“这是一个复杂的问题，而且由于容易做到，这是一个快速增长的问题。”\n奖励滥用是指用户重复使用和/或共享优惠券和注册奖励来欺骗商家。为了防止这种情况，ravelin能够绘制出用户网络及其相关的代金券代码，以发现某个代金券是否已被其他用户使用并阻止它。\n供应商欺诈通常会影响客户、快递公司或产品供应商欺骗市场的市场。卡尔说：“有很多种方式可以做到这一点，一个简单的例子就是供应商使用假账户以现金交付的方式下订单。在这种情况下，市场会提前向餐厅付款。一旦他们收到付款，餐厅就会取消订单，并保留付款。我们可以帮助市场识别网络中的异常活动，制止欺诈行为“。\nravelin还在开发“ravelin Accept”，这是一款旨在帮助企业浏览PDS2并自信地接受而不是拒绝更多交易的产品。PSD2意味着交易将需要更多身份验证。\n卡尔解释说：“这冒着很多交易失败的风险，因为消费者正在为加强身份验证而苦苦挣扎，商家也不确定如何获得安全身份验证的豁免。”Ravelin Accept将内置有关主要发行人喜欢如何管理交易的情报。它将在可能的情况下将交易路由到豁免以进行身份验证，如果不是，[它]将动态管理该步骤，以使其获得最好的接受机会。今年年底PSD2的硬期限应该会看到对ravelin Accept的巨大需求，以帮助提高录取率。\n与此同时，ravelin表示，它将利用C系列融资进一步投资于这些创新，并在全球范围内接触到更多的市场和行业。\nDraper ESPRIT的Vinoth Jayakumar评论说：“我们的模式是长期投资于创新。ravelin与这一论点完全一致。Ravelin的团队是世界级的，并继续努力推动他们的产品…的边界。真正让我们兴奋的是他们为客户解决的一系列问题，以及他们正在开发的一套产品。“", "note_en": "The Series C round is led by Draper Esprit, with participation from existing investors Amadeus Capital Partners, BlackFin Tech, and Passion Capital.  Ravelin    disclosed $10 million in Series B funding in September 2018.\n Launched in 2016, Ravelin utilises machine learning and graph network technologies to help online businesses reduce losses to fraud and improve acceptance rates of orders. The idea is to do away with cruder, rule-based systems and use machine learning to negate false positives and give merchants more confidence accepting customers/transactions.\n  With regards to product-market fit, Ravelin says it first found success with large-scale food and cab-ride marketplaces, but has since expanded into travel, ticketing, entertainment, gaming, gambling, and retail. In addition to identifying card fraud, Ravelin also works with clients to find compromised accounts (referred to as “account takeover”), spot incentive abuse and tackle supplier fraud in marketplaces.\n Account takeover is where fraudsters use credentials that have been exposed in data breaches to take over an individual’s online account for their own use or to sell on the dark web. “We have a product that helps secure accounts in the first place, identify at risk accounts and help the merchant reclaim the account for the original user,” explains Ravelin’s chief marketing officerGerry Carr. “It’s a complex problem and due to the ease that it can be done, a fast growing issue”.\n Incentive abuse sees users re-using and/or sharing vouchers and sign-up incentives to defraud a merchant. To prevent this, Ravelin is able to map out the network of users and their associated voucher codes to spot if a voucher is already used by another user and block it.\n Supplier fraud typically affects marketplaces where the customer, the courier or the product supplier is working to defraud the marketplace. “There are many ways this can happen,” says Carr, “a simple example might be a supplier uses a fake account to place an order with cash delivery. In this scenario the marketplace advances the restaurant the payment. Once they receive the payment, the restaurant cancels the order and keeps the payment. We can help a marketplace identify anomalous activity in the network and put a stop to fraudulent behaviour”.\n Ravelin is also developing “Ravelin Accept,” a product aimed at helping businesses navigate PDS2 and confidently accept rather than reject more transactions. PSD2 means there will be a lot more authentication required for transactions.\n “This risks a lot of failed transactions as consumers struggle with the step-up authentication and merchants are unsure about how to get exemptions to the secure authentication,” explains Carr. “Ravelin Accept will have built-in intelligence about how the major issuers like to manage transactions. It will route a transaction to an exemption to authentication where possible, and where it is not, [it] will manage that step-up dynamically to give it the best chance of acceptance. The hard deadline of PSD2 at the end of this year should see significant demand for Ravelin Accept to help with acceptance rates”.\n Meanwhile, Ravelin says it will use its Series C round to further invest in these innovations, and to reach more markets and industries globally.\n Comments Draper Esprit’s Vinoth Jayakumar: “Our model is to invest in innovation over the long term. Ravelin perfectly aligns with that thesis. The team at Ravelin are world-class and continue to work to push the boundaries of their products… What got us really excited was the range of problems they solve for clients and the suite of products they are developing”.", "posttime": "2020-07-15 15:18:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "检测,detection,ravelin", "title": "\n欺诈检测初创公司RAVELIN获得2000万美元的C系列投资", "title_en": "\n\t\t\t\tFraud detection startup Ravelin secures $20M Series C\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/ravelin/", "via": "", "real_tags": ["检测", "detection", "ravelin"]}, {"category": "", "categoryclass": "", "imagename": "dbda24a1f17e466f13cea5a403f1ba6f.jpeg", "infoid": 1011969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "顶级WHIS、DNS、IP和威胁情报数据提供商。我们提供API、数据库和工具。\n以冠状病毒为主题的新注册域名展示了如何将域名注册行为与新闻联系起来。\n在早些时候的一次涵盖2020年1月至3月的域名情报分析中，我们检测到不少于5万个域名带有暗示与大流行有关的术语。\n冠状病毒引起了所有人的注意，导致了大量的信息搜寻。因此，托管在包含相关流行病搜索词的域名上的网站可以通过在其页面上显示广告来赚钱。使冠状病毒主题的新注册域名成熟进行网络钓鱼的是可以实现的金钱收益，特别是通过出售个人防护装备(PPE)、取消旅行的退款、诉讼和和解以及捐款。\n有点类似的是，我们开始检测到1000多个新注册的域名，这一次与“黑人生命也是命”运动有关。由于这些事件也引起了公众的大量关注，这篇文章考虑了在未来几周内使用这些域名可能会采取的恶意或误导的角度。\n“George Floyd”和“Black Lives Matter”新注册域名激增。\n包含字符串“orge”和“loyd”的域名最近出现在域名系统(DNS)中。从5月28日到6月15日，人们注意到乔治·弗洛伊德(George Floyd)的名字大约有356个变体(大多数包含打字错误)。以下是几个示例：\n在监测的19天内，总共检测到1140个与乔治·弗洛伊德(George Floyd)和黑人生命也是(Black Lives Matter)有关的域名。登记人数在6月1日达到顶峰，大约在黑人生命也是运动引起全球关注的时候。\n研究表明，70%的新注册域名是恶意的或可疑的，可能涉及钓鱼活动和恶意软件攻击。乔治·弗洛伊德(George Floyd)和“黑人生命也是命”(Black Lives Matter)域名的一些最终目标可能相似。这些域名注册可能产生的一些影响包括：\n骗子善于引发反应。例如，诸如georgefloydcharity[.]com、georgefloydcharityFoundation[.]org、Blacklivesmatterfund[.]com、BlackLives[.]Support及其变体之类的域名可以说服同情者延长货币捐赠。\n虽然其中一些域名属于合法的慈善基金会，但也有几个域名可能是由骗子运营的。事实上，一个虚假的“黑人生命也是命”Facebook页面声称正在为积极分子筹集资金，并获得了大约10万美元的捐款。因此，希望向黑人生命也是命(Black Lives Matter)运动和弗洛伊德的家人捐款的人应该谨慎行事。\n“黑人生命也是命”运动并不新鲜。BlackLivesMatter[.]com自2013年以来一直在上线。对WHOIS历史的研究支持这一说法，因为它允许从2013年10月检索域名的WHOIS记录。\n但是任何人都可以在他们的域名中使用“黑人的生命也很重要”。\n在我们的分析中发现了数百个使用不同顶级域(TLD)扩展或包含拼写错误的新注册域名，其中的子集包括：\n使用屏幕截图工具，我们发现这些域名中的许多都没有托管任何可消费内容--要么是因为它们已经停放，要么是因为它们有一个正在建设中的网站，或者正在等待WHOIS的验证。一些人确实主办了一个电子商务网站，该网站可能与BLM运动的官方代表有关联，也可能没有。\n这些域名可能被利用的另一种方式是散布关于黑人生命也是倡导者的不实信息。美国官员最近要求国家情报总监(National Intelligence Director)确定外国实体是否在利用互联网散布虚假信息，以利用该国的社会动荡。基于历史行为，一些国际演员利用黑人生命也是运动，通过虚假的BLM社交媒体账户传播不和谐。\n现在就断言“黑人生命重要”和相关的新注册域名是否会导致随后的一波诈骗和造谣运动，可能还为时过早。尽管如此，监控网络钓鱼和欺诈的迹象还是值得推荐的。", "note_en": "Top Whois, DNS, IP and threat intelligence data provider. We provide APIs, databases, and tools.\n Coronavirus-themed new registered domains showed how domain name registration behaviors can be linked back to the news.\n In an earlier  domain intelligence analysis covering January to March 2020, we detected no less than 50,000 domain names with terms hinting a connection to the pandemic.\n The coronavirus caught everyone’s attention and resulted in a lot of information seeking. As a result, websites hosted on domains containing relevant pandemic search terms could make money by displaying ads on their pages. What made coronavirus-themed new registered domains ripe for phishing were achievable monetary gains, notably through the sale of personal protective equipment (PPE), refunds for canceled trips, lawsuits and settlements, and donations.\n Somewhat similarly, we started detecting 1,000+  new registered domains this time related to the Black Lives Matter movement. As these events also gained a lot of public attention, this post considers possible malicious or misinformative angles that could be taken in the coming weeks using these domains.\n Surge in “George Floyd” and “Black Lives Matter” New Registered Domains\n Domains that contain the strings “eorge” and “loyd” appeared in the Domain Name System (DNS) recently. From 28 May to 15 June, some 356 variations of George Floyd’s name (most containing typos) were noticed. Below are a few examples:\n    In total, 1,140 domain names related to George Floyd and Black Lives Matter were detected within 19 days of monitoring. The registrations peaked on 1 June, around the time that the Black Lives Matter movement drew global attention.\n  Studies show that  70% of new registered domains are malicious or suspicious, possibly figuring in phishing campaigns and malware attacks. Some of the George Floyd and Black Lives Matter domain names’ end goals could be similar. A few possible repercussions of these domain name registrations include:\n  Scammers are good at triggering reactions. Domain names such as georgefloydcharity[.]com, georgefloydcharityfoundations[.]org, blacklivesmatterfund[.]com, blacklives[.]support, and their variations, for instance, could convince sympathizers to extend monetary donations.\n While some of these domains belong to legitimate charitable foundations, several could be operated by scammers. In fact, a fake Black Lives Matter  Facebook page claimed to be raising money for activists and obtained around US$100,000 in donations. People looking to donate to the Black Lives Matter movement and Floyd’s family should thus exercise caution.\n  The Black Lives Matter movement is not new. Blacklivesmatter[.]com has been up since 2013. A look into  WHOIS history supports this claim as it allowed retrieving the domain’s WHOIS record from October 2013.\n But anyone can use the words “Black Lives Matter” in their domain names.\n Hundreds of new registered domains were found in our analysis using different top-level domain (TLD) extensions or containing typos, a subset of which include:\n  Using a  screenshot tool, we found that many of these domains are not hosting any consumable content—either because they are parked, have a site under construction, or are pending WHOIS verification. Some did host an e-commerce website, which may or may not be affiliated with official representatives of the BLM movement.\n  Another way that these domains could be used is to spread disinformation about the Black Lives Matter advocacy in general.  U.S. officials recently asked the National Intelligence Director to determine if foreign entities are using the Internet to take advantage of the country&#39;s social unrest by spreading disinformation. Based on historical behavior, some international actors have used the Black Lives Matter movement to spread discord via  fake BLM social media accounts.\n  It may still be too early to say whether “Black Lives Matter” and related new registered domains will result in a subsequent wave of scams and disinformation campaigns. Monitoring telltale signs of phishing and fraud is nonetheless recommendable.", "posttime": "2020-07-15 14:55:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "域名,注册,triggers", "title": "BLM触发数千个域名注册：这意味着什么", "title_en": "BLM Triggers Thousands of Domain Registrations: What This Means", "transed": 1, "url": "https://hackernoon.com/blm-triggers-thousands-of-domain-registrations-what-this-means-0z8w3us8", "via": "", "real_tags": ["域名", "注册", "triggers"]}, {"category": "", "categoryclass": "", "imagename": "8d23362ffc871f6a54f77c9b9a871d8c.jpeg", "infoid": 1011968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为金融机构提供基于云的软件的NCino在上市首日股价飙升超过150%。\n该公司股价开盘报71美元，交易价格为77.20美元，午盘上涨150%。nCino目前约有8920万股流通股，市值为69亿美元。\n首日表现强劲之前，nCino在首次公开募股(IPO)中筹集了2.48亿美元，高于预期。在北卡罗来纳州威尔明顿，金融科技周一晚间以每股31美元的价格出售了806万股票。这一数字高于nCino最初计划发行的762.5万股，每股价格为22美元至24美元。\n根据7月10日提交给美国证券交易委员会(Securities And Exchange Commission)的一份文件，该公司将价格区间上调至28美元至29美元。备案文件称，美国银行证券(BofA Securities)、巴克莱Keybanc资本市场(Barclays Keybanc Capital Markets)和SunTrust Robinson Humphrey是这笔交易的承销商。\nNCino是最新一家首日表现强劲的公司。本月早些时候，保险技术公司Lemonade的股价在上市首日上涨了一倍多。\nnCino网站称，银行家和企业家在2011年创办了nCino，因为他们发现商业贷款流程“效率低下，耗时长”。\nnCino操作系统为包括银行和信用社在内的1,100多家金融机构提供入职、贷款发放和开户的单一平台。目前客户包括(股票代码：BAC)、巴克莱(BCS)、桑坦德银行(SAN)和道明银行(TD)。NCino在七个办事处拥有934名员工。\nnCino首席执行官皮埃尔·诺德(Pierre Naude)表示，此次IPO是该公司的一个里程碑。\nNaude在一份声明中说：“现在比以往任何时候都更多的金融机构开始理解数字化转型的必要性，这为nCino创造了一个令人信服的市场机会。”进入公开市场是一个机会，可以让我们的公司负责任地投资于增长，并加强我们继续专注于我们的核心使命和愿景的能力-通过创新、声誉和速度改变全球金融服务业。“。\nnCino表示，新冠肺炎继续在全球金融市场造成不确定性，这可能会影响技术支出。不过，该公司还表示，它已经将其小企业管理局(Small Business Administration)贷款解决方案调整为Paycheck Protection Program，该计划为陷入困境的公司提供贷款。\n监管申报文件称，NCino的银行客户已经处理了“数十万份申请”，并使用其软件提供了超过500亿美元的PPP资金.。\n金融科技计划将发行所得用于一般企业用途，包括营运资金，以及增加办公室。该公司表示，NCino还可能使用一部分资金“收购、投资或获得”免费的技术、产品、服务或业务。\nNCino没有盈利。截至4月30日的季度，净亏损扩大至480万美元，营收为4470万美元，而2019年同期的净亏损为340万美元，营收为2980万美元。\nInsight Partners持有nCino最大的股份，IPO后有望持有42.6%的股份。美国客户关系管理公司(CRM)占12.1%，惠灵顿管理公司(Wellington Management)将占8.6%。", "note_en": "NCino, which provides cloud-based software for financial institutions, saw its stock surge more than 150% in its first day of trading.\n  Shares of   opened at $71 and were trading at $77.20, up 150% on the   at midday. With roughly 89.2 million shares outstanding, nCino now has a market capitalization of $6.9 billion.\n  The strong first day comes after nCino raised $248 million, more than expected, in its initial public offering. The Wilmington, North Carolina, fintech sold 8.06 million shares at $31 each  late Monday. That’s up from the 7.625 million shares at $22 to $24 each that nCino initially planned to offer.\n  The company boosted its price range to $28 to $29,  according to a July 10 filing with the Securities and Exchange Commission. BofA Securities,  Barclays  Keybanc Capital Markets and SunTrust Robinson Humphrey are underwriters on the deal, the filing said.\n    NCino is the latest company to post a strong first day. Lemonade, an insurance technology company,  saw its shares more than double earlier this month in its market debut.\n  Bankers and entrepreneurs started nCino in 2011 because they found the commercial lending process “inefficient and time consuming,” the nCino website says.\n  The nCino operating system provides a single platform for onboarding, loan origination, and account opening for more than 1100 financial institutions, including banks and credit unions. Customers currently include   (ticker: BAC), Barclays (BCS),   (SAN), and TD Bank (TD). NCino employs 934 people across seven offices.\n  Pierre Naude, nCino’s CEO, said the IPO was a milestone for the company.\n  “Now more than ever financial institutions are beginning to understand the digital transformation imperative, creating a compelling market opportunity for nCino,” Naude said in a statement. “Entering the public market is an opportunity that can allow our company to responsibly invest in growth, and strengthen our ability to remain focused on our core mission and vision—to transform the global financial services industry through innovation, reputation and speed.”\n  Covid-19, nCino said, continues to create uncertainty in the global financial markets, which could affect technology spending. The company also said, though, that it had adapted its Small Business Administration loan solution to the Paycheck Protection Program, which provides loans to struggling companies.\n  NCino’s banking customers have processed “hundreds of thousands of applications” and provided more than $50 billion in PPP funding using its software, the regulatory filing said.\n  The fintech plans to use proceeds from the offering for general corporate purposes, including working capital, as well as adding offices. NCino may also use a portion to “acquire, invest in or obtain” complimentary technologies, products, services or businesses, it said.\n  NCino is not profitable. Net losses widened to $4.8 million on $44.7 million of revenue for the quarter ended April 30, compared to $3.4 million in net losses and $29.8 million in revenue for the same period in 2019.\n  Insight Partners has the biggest stake in nCino and was in line to own 42.6% after the IPO.   (CRM) has 12.1%, while Wellington Management will have 8.6%.", "posttime": "2020-07-15 14:34:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "操作系统,交易,开发,trading,ncino", "title": "nCino是一家为金融机构开发基于云的操作系统的公司，在首次公开募股(IPO)中筹集了约2.49亿美元后，其股价在首日交易中飙升195%以上", "title_en": "Shares of nCino, which develops a cloud-based operating system for financial institutions, surged 195%+ on first day of trading after raising ~$249M in IPO", "transed": 1, "url": "https://www.barrons.com/articles/ncino-stock-rockets-150-after-fintechs-ipo-51594751287", "via": "", "real_tags": ["操作系统", "交易", "开发", "trading", "ncino"]}, {"category": "", "categoryclass": "", "imagename": "ec43004cac70333a7596a2a02d6c1130.jpg", "infoid": 1011967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你在日常工作中真的使用算法和数据结构吗？我注意到，越来越多的人认为算法是毫无意义的问题，这些问题纯粹是科技公司提出的一种武断的衡量标准，这一趋势越来越大。我听到更多的人抱怨说，所有这些都是纯粹的学术活动。在“自制酒”(Homebrew)的作者马克斯·豪厄尔(Max Howell)发布了他在谷歌上的采访经历后，这个概念肯定得到了普及：\n谷歌：我们90%的工程师都在使用你写的软件(Homebrew)，但是你不能在白板上倒置二叉树，所以他妈的去他妈的。\n-Max Howell(@mxcl)2015年6月10日。\n虽然我也从来不需要使用二叉树倒置，但我在Skype/Microsoft、Skyscanner和Uber工作时遇到过数据结构和算法的日常用例。这包括编写代码和基于这些概念做出决策。更重要的是，我利用这些知识了解了一些东西是如何构建的以及为什么要构建，以及我可以如何使用或修改它们。\n本文是一组真实世界的示例，其中在生产中使用了树、图和各种算法等数据结构。所有这些都是我的亲身经历。我希望说明，通用的数据结构和算法知识不只是为了面试--而是你在快速增长的创新科技公司工作时可能会接触到的东西。\n我使用了非常小的算法子集，但几乎使用了所有的数据结构。不足为奇的是，我不喜欢像红黑树或AVL树这样具有奇异数据类型的算法繁重且不切实际的面试问题。从来没有问过这些，将来也不会。你可以在这篇文章的末尾读到我对这些采访的看法。尽管如此，我发现了解他们可以选择哪些基本数据类型选项来解决某些问题是很有价值的。有了这一点，让我们跳到例子中去。\n当我们构建Xbox One的Skype时，我们开发的是一个基本的Xbox操作系统，缺少密钥库。我们正在构建该平台上首批成熟的应用程序之一。我们需要一种导航解决方案，既可以连接到触摸手势，也可以连接到语音命令。\n我们在WinJS之上构建了一个通用导航框架。为此，我们需要维护一个类似DOM的图来跟踪可操作的元素。为了找到这些元素，我们进行了DOM遍历-基本上是B树遍历-遍历现有的DOM。这是BFS或DFS(广度优先搜索或深度优先搜索)的典型案例。\n在Uber，团队构建了许多工具来可视化节点、依赖关系和它们的连接。一个例子是肋骨节点的可视化工具。在这种情况下，方法是相同的。该工具需要维护一棵树，将其可视化为SVG，然后在移动设备上的肋骨树更改时更新该树。此外，RIB本身维护与呈现对象不同的状态管理的逻辑树结构：这是其设计背后的关键思想之一。\nSkyscanner找到最划算的机票。它通过扫描世界各地的所有路线，然后将它们组合在一起来做到这一点。虽然问题的本质更多地是爬行，而不是缓存-随着航空公司计算中转选项-多城市规划选项成为最短路径问题。\n多城市是Skyscanner花了相当多时间构建的功能之一-公平地说，困难更多的是在产品方面，而不是任何事情。最佳的多城市交易是通过使用Dijkstra或A*等最短路径算法来计算的。飞行路线用有向图表示，每条边都有机票成本的权重。通过对每条路线实施改进的A*搜索算法，计算两个城市之间的最便宜价格选项。如果你对航班和最短路径感兴趣，萨钦·马尔霍特拉(Sachin Malhotra)撰写的关于使用BFS实现最短航班搜索路径的文章是一本不错的读物。\n不过，使用Skyscanner，实际的算法就不那么重要了。缓存、爬行和处理不同的网站负载是更难破解的事情。尽管如此，最短路径问题的另一种变体出现了许多几家旅游公司，它们根据组合进行价格优化。不出所料，这个话题也是这里走廊讨论的一个来源。\n排序是我很少有借口实现或需要深入使用的算法家族。了解不同类型的排序方式是很有趣的，从冒泡排序、插入排序、合并排序、选择排序，还有--最复杂的一种--快速排序。尽管如此，我还是发现我几乎没有理由必须实现这些功能，特别是因为我从来不需要将排序函数作为库的一部分来编写。\n不过，在Skype，我对这方面的知识进行了一些练习。另一位工程师决定实现列出联系人的插入排序。2013年，当Skype连接到网络时，联系人会成群结队地到达，所有联系人都需要一段时间才能到达。因此，这位工程师认为，使用插入排序按姓名组织的联系人列表性能更好。我们对此进行了反复讨论，为什么不直接使用默认排序算法。最后，更多的工作是对实现进行适当的测试，并对其进行基准测试。我个人认为这样做没有多大意义：但我们正处于项目的阶段，我们有时间。\n在一些真实的用例中，有效的排序非常重要，并且根据数据控制您使用的排序类型可以起到很大的作用。当以大块流式传输实时数据并为这些数据源构建实时可视化时，插入排序非常有用。如果涉及到存储在不同节点上的大量数据，合并排序可以很好地使用分而治之的方法。我没有使用过这些方法，所以除了欣赏不同的方法之外，我仍然会标记我几乎用不到的排序。\n我经常使用的最频繁的数据结构是哈希表和哈希函数。它是一个非常方便的工具，从计数，到检测重复，再到缓存，一直到像分片这样的分布式系统用例。在数组之后，它很容易成为我在无数场合使用过的最常用的数据结构。几乎所有的语言都带有这种数据结构，如果您需要它，它很容易实现。\n任何调试过具有堆栈跟踪的语言的人都会非常熟悉堆栈数据结构。作为一种数据结构，我在使用它时遇到了一些问题，但是调试和性能分析让我错综复杂地熟悉了它。\n我很少选择队列作为代码的数据结构，但我在代码库、代码弹出或推送中遇到过它很多次。对于分析和分析构建的构建瓶颈检测器工具，我读取了使用Python堆队列算法巧妙地使用优先级队列进行优化的代码。\n优步很早就采用了几种语言和技术，而密码学的实现并没有达到我们所需的稳定性。iOS和Android就是一个很好的例子。来自客户端的用户输入的敏感信息在通过网络发送之前需要加密，只需在特定服务上解密。\n有些情况下，我们必须构建我们自己的加密/解密实现，在没有支持它的框架或可用的经审计的库的情况下，对它们进行正式的验证和审计。\n构建密码总是很有趣的。这更像是一个实现挑战：你不需要想出一个新的算法--对于加密来说，这可能是你从事工程工作时最糟糕的想法之一。取而代之的是，采用符合要求的现有的、文档齐全的标准，然后对其进行编码、验证、审计，然后再次进行审计。在本例中，这是实现AES标准。这是一项有趣的智力挑战。我们构建了一些移动和网络加密实现，深入了解了高级加密标准(AEP)、散列消息验证码(HMAC)或RSA公钥加密的细节。\n作为审核解决方案的一部分，调查消息篡改或拒绝服务影响等攻击载体。验证一系列加密步骤是否可证明是安全的是另一件需要理解的有趣事情。正如深入了解加密和MAC、MAC然后加密和加密然后MAC之间，它们中只有一个是可证明的安全的，但这并不意味着其他的不是安全的。(#39；#**$${##**$$}。\n当我在2016年加入优步时，移动领域最大的痛点是构建需要多长时间，以及合并您的更改需要多长时间。一个完整的构建大约需要40分钟，从构建到所有测试-单元、集成、E2E。我们有大约300名开发人员正在推动生产，所有的更改都必须经过构建才能落地。师父需要始终保持绿色。\n当构建被并行化时，60%的情况下，在构建通过后，合并将失败。其他人会更改类似的代码路径，并且他们的更改已经在repo中。因此，通过多次重试，合并您的更改平均需要2-3个小时。\n坐在我旁边的开发者体验团队想要解决这个问题，他们从两个角度来做。首先，他们加快了构建和测试的速度，使其花费的时间不超过30分钟。其次，他们的目标是每个人换衣服的时间应该是30分钟，95%的时间。但是合并冲突怎么办呢？让我们预测它们，并相应地建立队列。这就是他们所做的，通过创建冲突和投机图表。在这份白皮书中有更多的细节，但结果是一个更快的队列-称为SubmitQueue-优化了构建时间，并使现在的400名移动工程师的生活变得更加愉快。在幕后使用了一些算法。\n最后一个项目是我没有参与的，但我观察到并使用了建立在它之上的工具。在这里，我了解了一种新的数据结构：具有分层索引的六边形网格。\n优步需要解决的最困难和最有趣的问题之一是如何优化出行定价和合作伙伴的派遣。价格可以是动态的，司机们也在不断地移动。H3是优步的网格系统工程师，其构建目的是在越来越细粒度的水平上跨城市可视化和分析数据。它的数据结构和可视化结构是一个具有分层索引的六边形网格。\n该数据结构具有特定的索引、遍历、分层网格、区域和单向边函数，详见API参考。有关更详细的深入研究，请参阅关于H3库的文章、源代码或关于如何以及为什么构建此工具的演示文稿。\n我真正喜欢这个经历的地方是，我了解到如何在特定领域创建您自己的专用数据结构是有意义的。除了将映射与每个单元格中的各种数据级别相结合之外，使用分层索引的六边形网格的用例并不多。不过，如果您熟悉一些数据结构，理解这种新的数据结构就容易得多--因为它可以为特殊需要设计另一个数据结构。\n这些都是我多年来在多家公司之间专业使用的实际数据结构和算法的亮点。因此，让我们回到最初的推特上，那条推文抱怨问问题，比如在白板上颠倒二叉树。在这件事上，我是站在马特这边的。\n要在一家科技公司工作，了解流行的算法或奇异的数据结构是如何工作的，并不是你应该知道的事情。您应该知道什么是算法，并且应该能够自己想出简单的算法，比如贪婪的算法。您还应该了解非常常见的基本数据结构，如哈希表、队列或堆栈。但是像Dijkstra或A*这样的特定算法不是你需要记住的：你会有这方面的参考，就像我在实现Crypto时一样。异类数据结构(如红黑树或AVL树)也是如此。我从来没有使用过这些数据结构，即使我使用了，我也会再次查找它们。我从来没有问过需要这种知识才能解决的问题，将来也不会。\n我完全赞成要求实际的编码练习，那里有许多好的解决方案，从蛮力或贪婪的方法到潜在的更复杂的方法。例如，像这样要求实现一个对齐文本函数是一个公平的问题：这是我在Windows Phone上构建一个简单的文本渲染器时做的事情。您只需使用一个数组和几个if/Else语句就可以解决这个问题，而不需要任何花哨的数据结构。\n现实情况是，许多团队和公司都在算法挑战上走得太远。我可以看到算法问题的吸引力：它们在45分钟或更短的时间内给出信号，并且问题可以很容易地交换；因此，问题泄露几乎没有什么坏处。它们在招聘时也很容易扩展，因为你可以有一个包含100多个问题的问题库，任何面试官都可以对其中的任何一个进行评估。特别是在硅谷，听到针对动态编程或外来数据结构的问题越来越常见。这些问题将有助于雇佣优秀的工程师，但也会导致那些本可以在不需要高级算法知识的工作中表现出色的人被拒之门外。\n任何读者，如果你所在的公司有招聘熟记一些高级算法的人的权利：如果这是你所需要的，请三思而后行。我已经在伦敦Skyscanner和优步阿姆斯特丹雇佣了非常棒的团队，没有任何棘手的算法问题，只涉及数据结构和问题解决。你不应该把算法背得一清二楚。您需要的是了解最常见的数据结构，并能够提出简单的算法来解决手头的问题，作为一个工具集。\n如果你在一家快速发展的创新科技公司工作，你几乎肯定会在代码库中遇到各种各样的数据结构和不同的算法实现。当您构建新的创新解决方案时，您通常会发现自己达到了正确的数据结构。这就是你想要了解可供选择的选项及其权衡的时候。\n数据结构和算法是您在构建软件时应该自信地使用的工具。了解这些工具，您就会熟悉使用它们的代码库导航。你也会对如何实施难题的解决方案更有信心。您将了解理论上的限制，您可以进行的优化，并且您将提出尽可能好的解决方案-所有折衷都要考虑在内。\n阅读哈希表、链表、树、图、堆、队列和堆栈数据结构。玩弄一下如何在你的语言中使用它们。作为一个概述，GeeksforGeek有一个很好的概述。对于编码实践，我推荐使用HackerRank数据结构集合。\n研习算法Aditya Bhargava是从初学者到有经验的工程师关于算法的最佳指南。这是一本非常平易近人的视觉指南，涵盖了大多数人-包括我自己-在这个主题上需要知道的所有内容。我相信你不需要比本书封面更了解算法。\n《算法设计手册》和《算法：第四版》都是我当年拿来复习大学里学过的一些东西的书。我中途放弃了，发现它们相当干燥，不适用于我所做的工作。\n喜欢这篇文章吗？订阅我的时事通讯，并在您的收件箱中获取未来的帖子。这是一本相当不错的书，拥有超过3500名订阅者。\n订阅我的时事通讯，了解实用的软件开发和工程职业发展的最新情况。", "note_en": "Do you actually use algorithms and data structures on your day to day job? I&#39;ve noticed a growing trend of people assuming algorithms are pointless questions that are asked by tech companies purely as an arbitrary measure. I hear more people complain about how all of this is a purely academic exercise. This notion was definitely popularized after Max Howell, the author of Homebrew, posted his Google interview experience:\n Google: 90% of our engineers use the software you wrote (Homebrew), but you can’t invert a binary tree on a whiteboard so fuck off.\n— Max Howell (@mxcl)  June 10, 2015\n  While I&#39;ve also never needed to use binary tree inversion, but I have come across everyday use cases of data structures and algorithms when  working at Skype/Microsoft, Skyscanner and Uber. This included writing code and making decisions based on these concepts. Even more, I used this knowledge to understand how and why some things were built and how I can use or modify them.\n This article is a set of real-world examples where data structures like trees, graphs, and various algorithms were used in production. All of these are my first-hand experiences. I hope to illustrate that a generic data structures and algorithms knowledge is not &#34;just for the interview&#34; - but something that you&#39;d likely find yourself reaching for when working at fast-growing, innovative tech companies.\n I&#39;ve used a very small subset of algorithms, but almost all data structures. It should be of no surprise that I am no fan of algorithm-heavy and non-practical interview questions with exotic data types like Red-Black trees or AVL trees. Never asked these, and never will. You can read about what I think about these interviews at the  end of this article. Still, I find lots of value in being aware of what options for basic data types they can choose to tackle certain problems. With this, let&#39;s jump into examples.\n  When we built Skype of Xbox One, we worked on a barebones Xbox OS, that was missing key libraries. We were building one of the first full-fledged applications on the platform. We needed a navigation solution that we could hook up both to touch gestures and to voice commands.\n We built a generic navigation framework on top of WinJS. To do so, we needed to maintain a DOM-like  graph to keep track of the actionable elements. To find these elements, we did DOM traversal - basically, a  B-tree traversal - across the existing DOM. This is a classic case of  BFS or  DFS (breadth-first search or depth-first search).\n At Uber, the team built many tools to visualize nodes, dependencies, and their connections. One example was a visualization tool for RIB nodes. The approach was the same in this case. The tool needed to maintain a  tree, visualize this into an SVG, then update the tree, as the RIB tree on the mobile device changed. Also, RIBs themselves maintain a logical  tree structure for state management that is different from the rendered objects: this is one of the key ideas behind their design.\n   Skyscanner finds the best deals on airline tickets. It does this by scanning all routes worldwide, then putting them together. While the nature of the problem is more on crawling, and less on caching - as airlines calculate the layover options - the multi-city planning option becomes the  shortest path problem.\n Multi-city was one of the features that took Skyscanner quite a bit of time to build - in all fairness, the difficulty was more on the product side, than anything. The best multi-city deals are calculated by using shortest path algorithms like Dijkstra or A*. Flight routes are represented as a directed graph, with each edge having a weight of the cost of the ticket. Calculating the cheapest price option between two cities was done via an implementation of a modified   A* search algorithm  per route. If you&#39;re interested in flights and shortest paths, the article on implementing the shortest flight search path using  BFS  by Sachin Malhotra is a good read.\n With Skyscanner, the actual algorithm was far less important, though. Caching, crawling, and handling the varying website load were much more difficult things to crack. Still, a variation of the shortest paths problem comes up with many several travel companies that optimize for price based on combinations. Unsurprisingly, this topic was also a source of hallway discussions here.\n  Sorting is an algorithm family I rarely had an excuse to implement or needed to use in-depth. It&#39;s interesting to understand the different types of ways to sort, from bubble sort, insertion sort, merge sort, selection sort and - the most complex one - quicksort. Still, I found that there is rarely a reason I had to implement any of this, especially as I never had to write sort functions as part of a library.\n At Skype, I got to exercise a bit on this knowledge, though. One of the other engineers decided to implement an insertion sort for listing contacts. In 2013, when Skype connected to the network, contacts would arrive in bursts, and it would take some time for all the contacts to arrive. So this engineer thought it&#39;s more performant to build the contact list organized by name, using insertion sort. We had a back-and-forth on this, over why not just use the default sort algorithm. In the end, it was more work to properly test the implementation, and to benchmark it. I personally didn&#39;t see much point in doing so: but we were in the stage of the project that we had the time.\n There are definitely some real-world use cases where efficient sorting matters, and having control over what type of sorting you use, based on the data, can make a difference. Insertion sort can be useful when streaming realtime data in large chunks and building realtime visualization for these data sources. Merge sort can work well with divide-and-conquer approaches if it comes to large amounts of data stored on different nodes. I&#39;ve not worked with these, so I&#39;ll still mark sorting that I&#39;ve had little use for, beyond the appreciation of the different approaches.\n  The most frequent data structure I&#39;ve used regularly was  hashtables and the  hashing function. It&#39;s such a handy tool from counting, to detecting duplications, to caching, all the way to  distributed systems use cases like sharding. After arrays, it&#39;s easily the most common data structure I&#39;ve used on countless occasions. Almost all languages come with this data structure, and it&#39;s simple to implement if you&#39;d need it.\n  The  stack data structure will be very familiar to anyone who has debugged a language that has a stack trace. As a data structure, I&#39;ve had a few problems to use it for, but debugging and performance profiling makes me intricately familiar with it.\n I rarely chose  queues as data structures for my code, but I came across it plenty of times in codebases, code popping, or pushing. For a build bottleneck detector tool that analyzed and profiled builds, I read code that was cleverly optimized with priority queues, using the  Python heap queue algorithm.\n  Uber adopted several languages and technologies early on, and  cryptography was not implemented to the stability that we needed. A good example was iOS and Android. User-entered sensitive information coming from the clients needs to be encrypted before sending through the network, only to be decrypted on a specific service.\n There were cases where we had to build our own encryption / decryption implementations, formally verifying and auditing them, in the absence of the framework supporting it, or audited libraries being available.\n Building crypto is always a lot of fun. This is more of an implementation challenge: you don&#39;t come up with a new algorithm - with crypto, this can be one of the worst ideas when you&#39;re in engineering. Instead, you take an existing, well-documented standard that fits the bill, then code it, verify it, audit it, and audit it again. In this case, this was  implementing the AES standard. It&#39;s a fun intellectual challenge. We&#39;ve built some mobile and web crypto implementations, me learning in-depth details of the Advanced Encryption Standard ( AEP), Hashed Message Authentication Codes ( HMAC), or the  RSA public-key encryption.\n As part of auditing the solution, investigating attack vectors like message tampering or the impact of denial-of service. Verifying that a series of encryption steps are provably secure was another interesting thing to understand. As was getting to the bottom of how, between encrypt-and-MAC, MAC-then-encrypt, and encrypt-then-MAC, only  one of them are provably secure, but that doesn&#39;t mean the others are not secure.\n  When I joined Uber in 2016, the biggest pain point on mobile was just how long the build took, and how much longer it took to merge your changes. A full build would run about 40 minutes, from build and all tests - unit, integration, E2E. We had about 300 developers pushing to production, and all changes had to go through the build before landed. Master needed to always be green.\n While builds were parallelized, 60% of the time, after the build passed, the merge would fail. Someone else would change a similar code path, and their change would already be in the repo. So it took, on average, 2-3 hours to merge your change in, with multiple retries.\n The Developer Experience team sitting next to me wanted to solve this problem, and they did it from two angles. First, they sped up the build and tests to take no more than 30 minutes. Second, their goal was that everyone&#39;s change should take 30 minutes, 95% of the time. But what about merge conflicts? Let&#39;s predict them, and queue builds accordingly. And this is what they did, by creating conflict and speculation graphs. There are a  lot more details in this whitepaper, but the result was a much faster queue - called SubmitQueue - that optimized build time, and made the life of now 400 mobile engineers far more pleasant. With some algorithms behind the scenes.\n   This last project is one I was not involved in, but one I&#39;ve observed and have played around with the tools that have been built on top of it. Here, I learned about a new data structure: hexagonal grids with hierarchical indexes.\n One of the most difficult and interesting problems to solve at Uber is how to optimize the pricing of trips, and the dispatching of partners. Prices can be dynamic, and drivers are constantly on the move. H3 is a grid system engineers at Uber built to both visualize and analyze data across cities, at an increasingly granular level. The data - and visualization - structure for this is a hexagonal grid with hierarchical indexes.\n  The data structure has specific indexing, traversal, hierarchical grid, region, and unidirectional edge functions,  detailed in the API reference. For a more detailed deep-dive, see the  article on the H3 library, the  source code, or the  presentation on how and why this tool was built.\n What I really liked about this experience is how I learned how creating your own specialized data structures can make sense in a niche area. There aren&#39;t many use cases where hexagonal grids with hierarchical indexes would make sense beyond combining mapping with various data levels within each cell. Still, if you&#39;re familiar with some data structures, understanding this new data structure is much easier - as it would be to design yet another data structure for a specialized need.\n  Those were the highlights of the actual data structures and algorithms I&#39;ve used professionally between multiple companies and many years. So let&#39;s go back to the original tweet that complained about asking things like inverting a binary tree on a whiteboard. I&#39;m on Matt&#39;s side on this one.\n Knowing how popular algorithms or exotic data structures work are not something you should need to know to work at a tech company. You should know what an algorithm is, and should be able to come up with simple ones on your own, like a greedy one. You should also know about basic data structures that are pretty common, like hashtables, queues, or stacks. But specific algorithms like Dijkstra or A* are not ones you&#39;d need to memorize: you&#39;ll have a reference for this, just like I had when implementing crypto. Same with exotic data structures like Red-Black trees or AVL trees. I&#39;ve never had to use these data structures, and even if I did, I would look them up again. I have never asked questions that needed this kind of knowledge to solve them, and never will.\n I am all for asking practical coding exercises, where there are many good solutions, from brute force or greedy approaches to potentially more sophisticated ones. For example, asking to implement a justify text function  like this question is a fair one: it&#39;s something I did when I was building a simple text renderer on Windows Phone. You can solve this problem just by using an array and a few if/else statements, without any fancy data structures.\n The reality is that many teams and companies are going overboard with algorithmic challenges. I can see the appeal of algorithmic questions: they give you signal in 45 minutes or less, and questions can be easily swapped around; thus, there is little harm if the question leaks. They are also easy to scale when recruiting, as you can have a question pool of 100+ questions, and any interviewer can evaluate any of them. Especially in Silicon Valley, it is more and more common to hear questions geared for dynamic programming or exotic data structures. These questions will help hire strong engineers - but also result in turning away people who would have excelled at a job that doesn&#39;t need advanced algorithms knowledge.\n To anyone reading whose company has a bar to hire people who know some of the advanced algorithms by heart: think again if this is what you need. I&#39;ve hired fantastic teams at Skyscanner London and Uber Amsterdam without any tricky algorithm questions, covering no more than data structures and problem solving. You shouldn&#39;t need to know algorithms by heart. What you do need is awareness of the most common data structures and the ability to come up with simple algorithms to solve the problem at hand, as a toolset.\n  If you work in a fast-moving, innovative tech company, you will almost certainly come across all sorts of data structures and different algorithm implementations in the codebase. When you build new and innovative solutions, you will often find yourself reaching to the right data structure. This is when you&#39;ll want to be aware of the options to choose from and their tradeoffs.\n Data structures and algorithms are a tool that you should use with confidence when building software. Know these tools, and you&#39;ll be familiar with navigating codebases that use them. You&#39;ll also be far more confident in how to implement solutions to hard problems. You&#39;ll know the theoretical limits, the optimizations you can make, and you&#39;ll come up with solutions that are as good as they get - all tradeoffs considered.\n  Read up on the hashtable, linked list, tree, graphs, heap, queue and stack data structures. Play around with how to can use them in your language. For an overview, GeeksforGeeks has a  good overview. For coding practice, I&#39;d recommend the  HackerRank Data Structures collection.\n Grokking Algorithms   Aditya Bhargava is hands down the best guide on algorithms from beginners to experienced engineers. A very approachable, and visual guide, covering all that most people - including myself - need to know on this topic.  I am convinced that you don&#39;t need to know more about algorithms than this book covers.\n The Algorithm Design  Manual and  Algorithms: Fourth Edition are both books I picked up back in the day to refresh some of the stuff I studied at university. I gave up midway, and found them pretty dry, and not applicable to the work I&#39;ve done.\n  Liked this article? Subscribe to my newsletter and get future posts in your inbox. It&#39;s a pretty good read, going out to over 3,500 subscribers.\n  Subscribe to my newsletter and stay up to date on pragmatic software development and engineering career growth.", "posttime": "2020-07-15 14:33:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,algorithms,structures", "title": "我在科技公司工作时使用的数据结构和算法", "title_en": "Data Structures and Algorithms I Used Working at Tech Companies", "transed": 1, "url": "https://blog.pragmaticengineer.com/data-structures-and-algorithms-i-actually-used-day-to-day/", "via": "", "real_tags": ["算法"]}, {"category": "", "categoryclass": "", "imagename": "0456cc52ebdabf407d60c06601ec8801.jpg", "infoid": 1011966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周二，伊万卡·特朗普敦促失业的美国人“寻找新的工作”，这是一项新的就业计划的一部分，该计划旨在兜售技能培训和不需要大学学位的职业道路的好处。\n但这一努力-包括网站、广告宣传和虚拟圆桌会议，由苹果首席执行官蒂姆·库克和IBM董事长金尼·罗睿兰(Ginni Rometty)出席-考虑到大流行、经济衰退和特朗普自己的家族就业史，很快在社交媒体上被嘲笑为“毫无头绪”和“音盲”。\n特朗普总统的大女儿和白宫顾问在推特上说：“这项倡议是为了挑战传统的2年制和4年制大学是获得工作所需技能的唯一选择这一观点。”“这项工作从来没有像现在这样紧迫。”\n这场运动是在这个国家处于公共健康危机之中的时候进行的，这场危机颠覆了整个行业，并引发了经济衰退，导致美国的失业率飙升至11%以上。根据劳工部的数据，美国目前有540万个职位空缺，对于大约1800万正式失业的美国人和目前正在领取失业救济金的3300万美国人来说，这远远不够。\n许多人认为，考虑到由于大流行迫使公司关闭或大幅缩减业务，生计消失的美国人所遭受的痛苦，这场运动是麻木不仁的。对许多人来说，伊万卡·特朗普(Ivanka Trump)--亿万富翁的女儿和本身就是千万富翁的女儿--不是应对找工作挑战的合适人选。\n“在这场流行病肆虐之际，趁没有人招人的时候，去寻找新的工作吧！”说不定你父亲会雇你呢！“。ProPublica的杰西卡·胡斯曼(Jessica Huseman)在推特上说。\n该活动的网站列出了几个“上升的职业”，劳工统计局预计这些职业将出现就业增长。但许多立场都是特朗普总统明确或间接抨击的工作领域。\n其中一个角色是风力涡轮机技术员，预计到2028年将增长57%。然而，总统一再大喊大叫地谈论风力涡轮机，称它们是搞砸农场和田野视觉美学的“怪物”。研究表明，涡轮机显著减少了碳排放。风能是所有发电能源中碳足迹最小的能源之一。\n该网站推荐的另一个长期职业前景是接触追踪器：公共卫生工作者争分夺秒地接触到可能接触过新冠肺炎和其他传染病的人，指导他们接受检测和隔离。川普總統一再反對他自己政府的公共衛生指導，傳染病專家表示，這種指導传递出的信息喜忧参半，加大了减缓病毒傳播的难度。到目前为止，美国已有330万人感染，至少有132,000人死于新冠肺炎。\n非营利广告委员会与苹果、IBM、美国电话电报公司、沃尔玛、洛克希德·马丁公司和商业圆桌会议等20多个组织合作，创建了“寻找新东西”活动。相应的网站链接到教育和培训选项。", "note_en": "Ivanka Trump urged out-of-work Americans to “find something new” Tuesday as part of a new jobs initiative designed to tout the benefits of skills training and career paths that don’t require a college degree.\n  But the effort — complete with a  website, advertising campaign and  virtual roundtable featuring Apple CEO Tim Cook and IBM chair Ginni Rometty — was swiftly derided on social media as “clueless” and “tone-deaf” given the pandemic, recession and Trump’s own familial employment history.\n “This initiative is about challenging the idea the traditional 2 and 4 yr college is the only option to acquire the skills needed to secure a job,” President Trump’s eldest daughter and White House adviser said in a Twitter post. “This work has never been more urgent.”\n  The campaign comes with the country in the midst of a public health crisis that has upended entire industries and kicked off a recession that has sent the nation’s unemployment rate shooting above 11 percent. The nation currently has 5.4 million job openings, according to the Labor Department, which is not nearly enough for the roughly 18 million Americans who are officially unemployed and the 33 million who are currently receiving unemployment benefits.\n  Many saw the campaign as insensitive given the suffering of Americans whose livelihoods disappeared as the pandemic forced companies to shutter or sharply curtail operations. And for many, Ivanka Trump — the daughter of a billionaire and a multimillionaire in her own right — is the wrong person to speak to the challenges of finding a job.\n   “Go find something new in the middle of this pandemic while no one is hiring! Perhaps your father will hire you!” Jessica Huseman of ProPublica said in a Twitter post.\n  The  campaign’s website lists several “rising careers” that the Bureau of Labor Statistics projects will see job growth. But many of the positions are in lines of work that President Trump has railed against explicitly or indirectly.\n Among the roles is wind turbine technician, which is projected to grow 57 percent through 2028. Yet the  president has repeatedly ranted about wind turbines, describing them as “monsters” that botch the visual aesthetics of farms and fields. Research has shown turbines significantly reduce carbon emissions. And wind energy has one of the smallest carbon footprints of any electricity-generating power source.\n   Another long-term career prospect the website recommends is  contact tracer: the public health workers who  race against time to reach people who may have been exposed to covid-19 and other contagious diseases, steering them to get tested and to quarantine. President Trump has  repeatedly contradicted the public health guidance of his own government, which infectious-disease experts say sends mixed messages that have made it harder to slow the spread of the virus. So far,  3.3 million people in the United States have been infected and at least 132,000 people have died of covid-19.\n The nonprofit Ad Council created the “find something new” campaign in partnership with more than 20 organizations, including Apple, IBM, AT&amp;T, Walmart, Lockheed Martin and the Business Roundtable. A corresponding  website links to education and training options.", "posttime": "2020-07-15 14:32:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "白宫,house,美国", "title": "白宫告诉1800万失业工人要“寻找新的东西”", "title_en": "White House tells 18M unemployed workers to ‘Find Something New’", "transed": 1, "url": "https://www.washingtonpost.com/business/2020/07/14/ivanka-trump-jobs-find-something-new/", "via": "", "real_tags": ["白宫", "house", "美国"]}, {"category": "", "categoryclass": "", "imagename": "1fb144e2c9d0e23a8ae85c0119e684a7.jpeg", "infoid": 1011965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎疫情摧毁了Airbnb在全球的收入之后，这家短期租赁平台已经开始要求客人捐款，向他们的前主人发送包括现金捐赠在内的善意卡片-近几个月来，随着旅行因疫情而陷入停顿，这些人眼睁睁地看着数十亿美元的收入消失了。\n这一新工具似乎是另一种缓解东道主财务担忧的努力，这一次是通过征求前客人的捐款来实现的。Airbnb的一位发言人告诉“商业内幕”，好心卡的收益将100%捐给东道主。\n本着重新建立联系的精神，我们开发了一项新功能，允许客人向热情好客的主人发送带有支持和鼓励信息的虚拟卡片。这位发言人说，如果客人愿意，他们可以选择增加一笔自愿捐款。\n但这一工具在推特上迅速引起了人们的强烈反对，他们表示，在流感大流行期间，他们也同样在努力节省资金，并质疑为什么支持东道主应该是他们的责任。\n主持人们将愤怒的矛头指向Airbnb，称该公司在新冠肺炎大流行开始时就实施了取消政策，这让他们损失了更多的钱。Airbnb在3月份表示，将花费2.5亿美元补偿房东因冠状病毒关闭而取消的客人。\n巨型房东的财务状况尤其糟糕，他们中的一些人买下了几十套房产，建立了短租帝国，这构成了他们的主要收入来源(根据分析网站AirDNA的数据，大约三分之一的Airbnb房东拥有超过25套房产)。\n“纽约时报”科技记者迈克·艾萨克(Mike Isaac)表示，该计划就像共享经济中的抵押贷款支持证券。\n另一位推特用户写道，我不确定目前我是否会为任何人的第二套房子提供抵押贷款。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "After the COVID-19 pandemic obliterated Airbnb revenues across the globe, the short-term-rental platform has begun asking guests to chip in by sending &#34; kindness cards&#34; that include cash donations to their former hosts — who have seen billions of dollars in revenue  vanish in recent months as travel has ground to a halt because of the pandemic.\n The new tool appears to be another effort to assuage hosts&#39; financial concerns, this time by soliciting contributions from former guests. An Airbnb spokesperson told Business Insider that 100% of the proceeds from the kindness cards would go to the hosts.\n &#34;In the spirit of rekindling connections, we developed a new feature that allows guests to send virtual cards with messages of support and encouragement to hosts who provided excellent hospitality. If they wish, guests have the option to add a voluntary financial contribution,&#34; the spokesperson said.\n But the tool has been met with swift backlash from people on Twitter who say they&#39;re similarly struggling to save money amid the pandemic and question why it should be their responsibility to support hosts.\n     Hosts have directed their anger at Airbnb,  saying the company implemented cancellation policies at the onset of the COVID-19 pandemic that cost them even more money. Airbnb  said in March that it would spend $250 million to reimburse hosts for guests&#39; cancellations that stemmed from coronavirus shutdowns.\n The financial situation is especially dire for megahosts, some of whom  bought up dozens of properties and built short-term-rental empires that made up their main source of income (about one-third of Airbnb hosts have more than 25 properties, according to the analytics site  AirDNA).\n New York Times tech reporter Mike Isaac  said the program was &#34;like the mortgage-backed securities of the sharing economy.&#34;\n   &#34;I&#39;m not sure I will be contributing to the mortgage for anyone&#39;s second house at this time,&#34; another Twitter user  wrote.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-15 14:31:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ripped,客人", "title": "Airbnb因要求客人向东道主捐款而受到抨击", "title_en": "Airbnb is getting ripped apart for asking guests to donate money to hosts", "transed": 1, "url": "https://www.businessinsider.com/airbnb-asking-renters-to-donate-kindness-cards-backlash-2020-7", "via": "", "real_tags": ["ripped", "客人"]}, {"category": "", "categoryclass": "", "imagename": "e7948c06add0945cc481803700db5837.jpeg", "infoid": 1011964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据周二发布的一篇官方博客文章，亚马逊将在美国五个城市为该公司的仓库工人及其家人推出20家医疗诊所。\n据CNBC报道，这些诊所的服务将包括预防性初级保健、处方药和疫苗接种。他们将由Crossover Health运营，这是一家为苹果、Facebook和LinkedIn等公司运营现场诊所的初创公司。\n该公司宣布，试点计划将在达拉斯-沃斯堡大都市区推出第一家诊所，那里居住着2万多名亚马逊员工。据该公司称，其中1.1万人是运营员工。其余的试点诊所将在未来几个月内在凤凰城、路易斯维尔、底特律和加利福尼亚州的圣贝纳迪诺-莫雷诺山谷地区建立。\n该公司的一位发言人告诉Business Insider，该项目从大流行之前就已经在进行中了。诊所不会提供与冠状病毒疾病相关的检测或护理。\n如果这些诊所-将位于履行中心和运营设施附近-取得成功，该公司将考虑在2021年进行更广泛的推出。\n去年10月，这家电商巨头启动了一项名为亚马逊护理(Amazon Care)的试点计划，其中包括与临床医生进行视频和短信访问，以及为西雅图的员工提供家庭护理。之后，这家电商巨头推出了这一新计划。\n根据“商业内幕”(Business Insider)4月份的一份报告，员工们称亚马逊的仓库是冠状病毒病的温床，因为在这种环境下，社交距离被证明是很困难的。这些员工还表示，亚马逊在帮助防止新冠肺炎感染他们和他们所服务的社区方面做得不够。\n6月初，CNBC报道称，该公司的目标是每隔一周对大多数仓库工人进行一次疾病检测。亚马逊曾表示，预计2020年将在员工测试上花费10亿美元。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "Amazon is rolling out 20 healthcare clinics for the company&#39;s warehouse workers and their families in five US cities, according to a  blog post published Tuesday.\n As  CNBC reports, the clinics&#39; services will include preventive primary care, prescription medications, and vaccinations. They will be operated by Crossover Health, a startup that  has run onsite clinics for the likes of Apple, Facebook, and LinkedIn.\n The company announced that the pilot program will launch its first clinic in the Dallas-Fort Worth metro area, where more than 20,000 Amazon employees reside. Of those,  11,000 are operation employees, according to the company. The rest of the pilot clinics will be established in Phoenix, Louisville, Detroit, and California&#39;s San Bernardino-Moreno Valley area in the next few months.\n The program has been in the works since before the pandemic, a company spokesperson told Business Insider. The clinics will not offer testing or care related to the coronavirus disease.\n   If the clinics — which will be situated close to fulfillment centers and operations facilities — are successful, the company will look into a wider rollout in 2021.\n The new program comes after the e-commerce giant last October launched a pilot program called  Amazon Care, which included video and text visits with clinicians, as well as in-home care, for employees in Seattle.\n Employees have called Amazon&#39;s warehouses a &#34;breeding ground&#34; for the coronavirus disease as social distancing proves difficult in such environments, according to a  Business Insider report in April. The employees also said that Amazon was not doing enough to help prevent COVID-19 from infecting them and the communities they serve.\n In early June,  CNBC reported the company was aiming to test the majority of its warehouse workers for the disease  every other week. Amazon  has said it expects to spend $1 billion in employee testing in 2020.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-15 14:12:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,工人,clinics", "title": "亚马逊为仓库工人及其家人开设的20家新的医疗诊所将不会为新冠肺炎提供检测或护理", "title_en": "Amazon's 20 new healthcare clinics for warehouse workers and their families will not offer COVID-19 testing or care", "transed": 1, "url": "https://www.businessinsider.com/amazon-healthcare-clinics-warehouse-workers-texas-2020-7", "via": "", "real_tags": ["亚马逊", "amazon", "工人", "clinics"]}, {"category": "", "categoryclass": "", "imagename": "ec6d340a4e47d531f935cd712a67f592.jpg", "infoid": 1011963, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "日产公司在日本横滨举行的数字活动中表示，日产Ariya将于2021年年中首先在日本销售，然后在今年晚些时候前往美国和加拿大的经销商。\n对于这家陷入争议一年多的公司来说，此次揭幕是一个里程碑。此前，日产集团(Nissan Group)和雷诺-日产-三菱联盟(Renault-Nissan-Mitsubishi Alliance)的前董事长卡洛斯·戈恩(Carlos Ghosn)被捕并随后逃脱。\n这也是自十年前日产推出Leaf掀背车以来，日产推出的第一款全电动汽车。日产是电动汽车的早期先驱，自2010年以来已售出近50万辆Leaf汽车。但特斯拉以及老牌原始设备制造商(OEM)的其他电动车型的崛起，让该行业早期的任何主导地位黯然失色。现在，日产的目标是重新回到领先地位。\n咏叹调不是叶子。这是一款更成熟、更精致的跨界车，设计流畅而简单，内饰以薄型“零重力”座椅为特色，意在给人一种高档的氛围。它还将技术放在前沿和中心，强调自然的语音控制、亚马逊Alexa和无线Apple CarPlay和Android Auto，让司机可以将他们的智能手机与信息娱乐系统集成在一起。\n“该公司预计，到2023财年末，其电动汽车和e-power电气化车型的年销量将超过100万辆。阿里亚将在实现这一目标方面发挥重要作用，“首席运营官阿什瓦尼·古普塔(Ashwani Gupta)在为新SUV揭幕的数字活动中表示。\n这款车将采用日产的下一代驾驶员辅助系统ProPILOT，该系统使用驾驶员注意力监控来实现不插手的单车道高速公路运营。还有一系列其他驾驶员辅助功能，包括带有行人检测的自动紧急制动、后部自动制动、车道偏离警告、盲点警告、后交叉交通警报和远光辅助。阿里亚还将包括一个监视器，提供完整的360视图和前碰撞警告。\nAriya将有四轮或两轮驱动版本可供选择；300英里的续航里程是日产基于2WD版本的估计。重要的是，日产正在抛弃欧洲和美国的CHAdeMO DC快速充电标准，转而选择这些市场的竞争对手联合充电系统(CCS)标准。", "note_en": "The Nissan Ariya will first be sold in Japan in mid-2021, before heading to dealerships in the U.S. and Canada later in the year, the company said in digital event in Yokohama, Japan.\n The unveiling is a milestone for a company that has been embroiled in controversy for more than year, following  the arrest and subsequent escape of Carlos Ghosn, the former chairman of the Nissan Group and the Renault–Nissan–Mitsubishi Alliance.\n   It’s also the first all-electric to come out of Nissan since the early EV pioneer introduced the Leaf hatchback a decade ago. Nissan was an early EV pioneer and has sold nearly 500,000 Leaf vehicles since 2010. But any early dominance in the industry has been overshadowed by the rise of Tesla as well as other electric models from established OEMs. Now Nissan aiming to get back in a leading position.\n The Ariya is no Leaf. This is a more mature, refined crossover with a sleek and simple design and an interior featuring thin profile “Zero Gravity” seats that are meant to give off an upscale vibe. It also puts tech front and center with an emphasis on natural voice controls, Amazon Alexa and wireless Apple CarPlay and Android Auto to let drivers integrate their smartphones with the infotainment system.\n  “The company expects sales of its EVs and e-POWER electrified models to be more than 1 million units a year by the end of fiscal 2023. The Ariya will play a significant role in attaining that goal,” COO Ashwani Gupta said during the digital event unveiling the new SUV.\n  The vehicle will feature Nissan’s next-generation driver assistance system called ProPILOT, which uses driver attention monitoring to enable hands-off single-lane highway operation. There is an array of other driver assist features, including automatic emergency braking with pedestrian detection, rear automatic braking, lane departure warning, blind spot warning, rear cross traffic alert and high beam assist. The Ariya will also include a monitor that provides a full 360 view and a forward collision warning.\n The Ariya will be available in all-wheel or two-wheel drive versions; that 300 miles of range is Nissan’s estimate based on the 2WD version. Importantly, Nissan is ditching the CHAdeMO DC fast charging standard in Europe and the U.S. and is instead opting for the competing Combined Charging System (CCS) standard for these markets.", "posttime": "2020-07-15 14:11:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电动汽车,stakes,日产", "title": "\n日产将其电动汽车的未来押在300英里里程的Ariya跨界车上", "title_en": "\n\t\t\t\tNissan stakes its EV future on the 300-mile range Ariya crossover\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/nissan-stakes-its-ev-future-on-the-300-mile-range-ariya-crossover/", "via": "", "real_tags": ["电动汽车", "stakes", "日产"]}, {"category": "", "categoryclass": "", "imagename": "7d6ab90784983da74149da64cc689c27.jpg", "infoid": 1011962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "耶路撒冷的一名研究人员声称，一种现有的药物可以将冠状病毒的危险程度“降低”到普通感冒的危险水平，该药物在受感染的人体组织上进行了测试。雅科夫·纳米亚斯教授说，他的研究表明，这种新型冠状病毒之所以如此恶毒，是因为它会导致脂质沉积在肺部，而且有一个解决方案可以消除这种损害：一种被广泛使用的抗胆固醇药物，名为非诺贝特。纳米亚斯说：“如果我们的发现得到临床研究的证实，这个疗程可能会将新冠肺炎的严重程度降低到只是普通感冒。”非诺贝特有时以Tricor的品牌出售，与因其对冠状病毒患者的疗效而受到赞誉的雷米希韦不同，它已经得到了美国食品和药物管理局(FDA)的认可，而且供应充足。Remdesivir供不应求，也仍在等待FDA等监管机构的全面批准。纳米亚斯是希伯来大学格拉斯生物工程中心的主任，他与纽约西奈山医疗中心的本杰明·滕奥弗博士进行了联合研究，得出了他的结论。他们的论文已经在生物医学期刊出版商细胞出版社(Cell Press)运营的在线门户网站上上线，用于尚未经过同行审查的研究。Nahmias和TenOver从未对感染SARS-CoV-2的人类肺细胞进行过实验室测试。Nahmias说，他们在研究了新型冠状病毒“劫持”人体的方式后，得出了降胆固醇药物可能有帮助的想法。他告诉以色列《泰晤士报》：“问题是，为什么这种新型猪冠状病毒与它的近亲如此不同，只会导致普通感冒。我们看到的是，这种病毒确实改变了人类肺部的脂质新陈代谢。“新的冠状病毒会导致微小的脂滴在肺部积聚，这是你通常不会在肺部看到的任何明显数量的东西。”Nahmias说，类似的过程，取决于病毒沉积脂肪，似乎也发生在身体的其他部位，比如肝脏。他认为，病毒这样做是为了在宿主中永久存在，如果这个过程能够被阻止，它将阻止器官-通常是肺部-导致病毒严重影响患者的问题的出现。\n他说，病毒干扰人体分解脂肪的能力，而非诺贝特启动了这一过程。“关于我们的研究，有趣的是，非诺贝特实际上结合并激活了DNA上病毒关闭的那个位点--我们DNA中允许我们细胞燃烧脂肪的一部分，”他说。\n病毒感染会导致肺细胞开始积聚脂肪，而非诺贝特可以让细胞燃烧脂肪。\n他说，这个过程的重启非常迅速，他将其比作“当插头从浴缸中拔出时”。\n纳米亚斯说，冠状病毒的高危险程度不是由它的传染性或人体一般清除病毒的能力造成的，而是由它引起的独特症状造成的。他说：“你的身体可以很容易地应对病毒，我们所需要做的就是处理症状。”\n“我们需要给身体时间在不进入呼吸衰竭的情况下清除病毒。我认为正是通过这样做，我们才能把它转变成不那么严重的疾病，比如普通感冒。“", "note_en": "An existing medicine can “downgrade” the danger-level of coronavirus to that of a common cold, a Jerusalem researcher is claiming, after testing it on infected human tissue. Prof. Yaakov Nahmias says that his research shows that the novel coronavirus is so vicious because it causes lipids to be deposited in the lungs, and that there is a solution to undo the damage: a widely-used anti cholesterol drug called fenofibrate.    “If our findings are borne out by clinical studies, this course of treatment could potentially downgrade COVID-19’s severity into nothing worse than a common cold,” Nahmias said.\t\t\t\t\t\t\t\t\t\t\t  Unlike remdesivir, which is being lauded for its effect on coronavirus patients, fenofibrate, sometimes sold under the brand name  Tricor, is already accredited by America’s Food and Drug Administration and is in plentiful supply. Remdesivir is  in short supply and is also still pending full approval by regulators like the FDA.\t  Nahmias, director of Hebrew University’s Grass Center for Bioengineering, reached his conclusion in joint research with Dr. Benjamin tenOever at New York’s Mount Sinai Medical Center. Their paper has gone  live on an online portal run by Cell Press, publishers of biomedical journals, for research that hasn’t yet been peer reviewed. Nahmias and tenOever performed lab tests on human lung cells infected with SARS-CoV-2. Nahmias said they arrived at the idea that a cholesterol drug could help after studying the way in which the novel coronavirus “hijacks” the human body. He told The Times of Israel: “The question is why this new coronavirus is so different from its close relatives that just cause a common cold. What we see is that this virus really changes lipid metabolism in the human lungs. The new coronavirus causes tiny lipid droplets to accumulate in the lungs, something you don’t normally see in the lungs in any significant quantity.” Similar processes, hinging on the virus depositing fats, seem to take place in other parts of the body too, such as the liver, said Nahmias. He believes that the virus does this in order to perpetuate itself in the host, and that if this process can be stopped, it will halt the onset of problems with organs — normally the lungs — that cause the virus to badly affect patients.\n He said the virus interferes with the ability of the body to break down fat, and fenofibrate jump-starts this process. “The interesting thing about our study is that fenofibrate actually binds and activates the very site on the DNA that the virus shuts down — a part of our DNA that allows our cells to burn fat,” he stated.\n “Virus infection causes the lung cells to start building up fat, and fenofibrate allows the cells to burn it.”\n The restart of the process is swift, he said, comparing it to “when the plug is removed from the bath tub.”\n Nahmias said that the high danger level from coronavirus isn’t caused by its infectiousness or the body’s general ability to rid itself of the virus, but rather by the unique symptoms it causes. “Your body can easily deal with the virus, all we need to do is deal with the symptoms,” he said.\n “We need to give the body time to clear the virus without going into respiratory failure. And it’s by doing this that I think we can transform it into something far less serious, something like the common cold.”", "posttime": "2020-07-15 14:08:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "耶路撒冷,drug,病毒", "title": "现有药物可能会将Covid威胁降级至普通感冒水平-耶路撒冷研究", "title_en": "Existing drug may downgrade Covid threat to common cold level – Jerusalem study", "transed": 1, "url": "https://www.timesofisrael.com/existing-drug-may-downgrade-covid-threat-to-common-cold-level-jerusalem-study/", "via": "", "real_tags": ["耶路撒冷", "drug", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "d29006b10576f7d25d8325b86b829b75.jpg", "infoid": 1011961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多亏了新冠肺炎的大流行，2020年是史无前例的一年，科技公司做生意的方式发生了根本性的变化，再加上可以说是大萧条(Great Depression)以来前所未有的经济混乱-风险投资也没有完全幸免。\n周二早些时候发布的季度PitchBook-NVCA Venture Monitor报告显示，风投行业在第二季度一如预期被打乱，但好消息是，结果远没有本来可能的那么糟糕。\n风险资本市场的不同领域表现与其他领域不同，最大的整体下滑发生在4月份，当时美国各地都处于停摆状态。报告指出，从4月份到5月初，许多风险投资公司保持谨慎，对自己的投资组合公司进行分类，主要专注于稳定自己的投资组合公司。但到5月中旬，投资开始再次回升。\n投资的回升在很大程度上要归功于政府的经济刺激计划，特别是Paycheck Protection Program，但报告确实指出，尽管出现了一些积极的趋势，但至少在未来几个季度，大流行带来的不确定性可能会持续下去。\n风险投资活动在第二季度放缓，在2,197笔交易中投资了343亿美元，与2019年第二季度相比，交易数量下降了23%，但仅略低于今年第一季度的2,298笔风险投资交易。\n其中值得注意的是，本季度种子交易暴跌至315笔，远低于去年平均每季度650笔交易。相比之下，天使轮在本季度大致稳定。种子期投资的下降归因于投资者重新评估他们的投资组合，并为未来几个季度支撑资产负债表。\n在数据中脱颖而出的是投资者加倍押注投资组合公司的趋势，该季度的后续融资活动大大超过了首次融资。同样，后期活动也没有下降，因为交易数量的跟踪速度高于2019年。\n该季度有57场后期盛会，票房超过1亿美元。这使得今年的总规模超过100场，有望超过2019年关闭的175场。报告指出，其中一些交易可以归因于初创企业在大流行期间经历了新的增长，而另一些交易则被迫筹集额外资金，以度过经济动荡。\n后期投资也有望超过2019年，今年上半年有1,501笔交易，相比之下，截至2019年全年有2,847笔交易，后者是目前的纪录。\n新冠肺炎造成影响的一个领域是退出：本季度只有147万人，价值212亿美元，低于第一季度的183万人。相比之下，2019年的退出规模超过了1000亿美元，但正如报告指出的那样，2019年第二季度创下了纪录，此后再也没有人能与之匹敌。今年上半年，目前已有376人退出，接近2011年以来的最低数字。\n展望未来，报告指出，有一些积极的势头，特别是在首次公开募股(IPO)方面，比如Vroom Inc.。最近有几家公司提交了IPO申请，包括雪花公司(Snowflake Inc.)、Palantir Technologies Inc.。和Rackspace Technology Inc.。\nPitchBook创始人兼首席执行官John Gabbert在声明中称，“过去几年风投退出的力度为有限合伙人提供了承诺新基金的资金.”“由于强大的筹款，全科医生积累了大量的干粉库存，这应该能让他们安然度过新冠肺炎带来的经济低迷。”\n但他补充说，“长期的经济衰退将改变一些围绕对风险投资的承诺的较长期行为。现在这一点更加重要，因为基金需要更长的时间来清算，并保留了比我们在过去经济低迷时更高的未实现价值比例。“。\n通过一键订阅我们的YouTube频道(如下所示)，显示您对我们使命的支持。我们的订阅用户越多，YouTube向您推荐的相关企业和新兴技术内容就越多。谢谢!。\n…。我们还想告诉您我们的使命，以及您如何帮助我们完成它。SiliconANGLE Media Inc.的商业模式是基于内容的内在价值，而不是广告。与许多在线出版物不同的是，我们没有付费墙或投放横幅广告，因为我们想让我们的新闻保持开放，不受影响，也不需要追逐流量。关于SiliconANGLE的新闻、报道和评论-以及我们的硅谷演播室和CUBE的全球巡回视频团队提供的现场无脚本视频-需要大量的辛勤工作、时间和金钱。要保持高质量，需要赞助商的支持，这些赞助商与我们对无广告新闻内容的愿景保持一致。\n如果您喜欢这里的报道、视频采访等无广告内容，请花点时间查看一下我们赞助商支持的视频内容样本，发推特表示支持，并不断回到SiliconANGLE。", "note_en": "2020 has been an unprecedented year thanks to the COVID-19 pandemic, with radical changes in the way tech companies do business coupled with economic disruption that arguably is unrivaled since the Great Depression — and venture capital hasn’t been completely spared either.\n The VC industry was disrupted in the second quarter  as predicted, but the good news is that the results were not nearly as bad as they could have been, according to the quarterly  PitchBook-NVCA Venture Monitor report released early Tuesday.\n Different segments of the venture capital market fared differently to others with the biggest overall slump occurring in April amid lockdowns across the U.S. The report notes that through April and into early May, many venture capital firms exercised caution, triaging and focusing primarily on stabilizing their own portfolio companies. But investment started to pick up again by mid-May.\n Much of the pickup in investment is credited to government economic stimulus packages, in particular the Paycheck Protection Program, but the report does note that despite some positive trends, uncertainty because of the pandemic is likely to persist for at least the next few quarters.\n Venture deal activity slowed in the second quarter, with $34.3 billion invested across 2,197 deals, a 23% decline in deal count compared to the second quarter of 2019 but only down slightly from 2,298 venture capital deals in the first quarter of this year.\n Notable among the figures was a slump in seed deals to 315 in the quarter, way down from an average of 650 deals per quarter over the last year. Angel rounds were roughly steady by comparison in the quarter. The dropping investment in seed rounds is attributed to investors re-evaluating their portfolios and shoring up balance sheets for the quarters to come.\n Standing out in the data is a trend for investors to double down on portfolio companies, with follow-on financing activity heavily outweighing first-time financing in the quarter. Likewise, there has not been a drop in late-stage activity as deal count tracked at a higher pace than 2019.\n In the quarter there were 57 late-stage megadeals, those of more than $100 million. That brought total megadeals to more than 100 this year, on track to surpass the 175 megadeals closed in 2019. The report notes that some of those deals can be attributed to startups experiencing newfound growth amid the pandemic, while others were forced to raise additional funds to weather the economic turmoil.\n Late-stage investments are also on track to surpass 2019 with 1,501 deals through the first half of the year, compared with 2,847 deals through the whole of 2019, the latter figure the current record.\n One segment that has suffered due to COVID-19 is exits: only 147 in the quarter, worth $21.2 billion, down from 183 exits in the first quarter. By comparison, exits surpassed $100 billion in 2019, but as the report notes, the second quarter of 2019 was record-breaking and hasn’t been matched since. For the first half of the year, there have now been 376 exits, headed toward the lowest number since 2011.\n Looking ahead, the report notes that there is some positive momentum, particularly on initial public offerings, such as  Vroom Inc.’s. Several companies have filed for IPOs recently, including  Snowflake Inc.,  Palantir Technologies Inc. and  Rackspace Technology Inc.\n “The strength of VC exits over the past few years has provided LPs with capital to commit to new funds,” John Gabbert, founder and chief executive officer of PitchBook, said in a statement. “As a result of strong fundraising, GPs have built up a large stockpile of dry powder, which should allow them to weather the economic downturn due to COVID-19.”\n But he added that “an extended economic decline would change some longer-term behaviors around commitments to VC. This is even more important now that funds are taking longer to liquidate and are retaining higher proportions of unrealized value than we saw in past downturns.”\n  Show your support for our mission with our one-click subscription to our YouTube channel (below). The more subscribers we have, the more YouTube will suggest relevant enterprise and emerging technology content to you. Thanks!\n  … We’d also like to tell you about our mission and how you can help us fulfill it. SiliconANGLE Media Inc.’s business model is based on the intrinsic value of the content, not advertising. Unlike many online publications, we don’t have a paywall or run banner advertising, because we want to keep our journalism open, without influence or the need to chase traffic. The journalism, reporting and commentary on  SiliconANGLE — along with live, unscripted video from our Silicon Valley studio and globe-trotting video teams at   theCUBE — take a lot of hard work, time and money. Keeping the quality high requires the support of sponsors who are aligned with our vision of ad-free journalism content.\n If you like the reporting, video interviews and other ad-free content here, please take a moment to check out a sample of the video content supported by our sponsors,   tweet your support, and keep coming back to   SiliconANGLE.", "posttime": "2020-07-15 13:45:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,交易,美国,vc", "title": "报告：美国风险投资交易在第二季度放缓，2197笔交易投资343亿美元，同比下降23%，但随着政府刺激计划的推出，到5月中旬开始回升", "title_en": "Report: US VC deals slowed in Q2, with $34.3B invested across 2,197 deals, down 23% YoY, but started to pick up by mid-May with govt stimulus package rollout", "transed": 1, "url": "https://siliconangle.com/2020/07/14/venture-capital-drops-due-covid-19-second-quarter-started-recover/", "via": "", "real_tags": ["风险投资", "交易", "美国", "vc"]}, {"category": "", "categoryclass": "", "imagename": "48fb3ed6d20b8d7e64f4af8d6264be3b.jpg", "infoid": 1011960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在其核心部分，Sentry是一个提醒您注意生产软件中的缺陷的工具。但它所做的不仅仅是将堆栈跟踪放入您的收件箱：Sentry提供了强大的工作流来帮助您的团队确定根本原因，对您的团队进行分类，并通过评论和通知跟踪持续关注的问题。\n这些协作功能可以帮助您快速解决软件问题。但这里的关键词是协作；如果您的整个团队无法访问Sentry，您可能会发现自己很快就会被无休止的积压问题淹没，而且没有人可以帮助。\n2019年底，成长团队把让我们的用户更容易邀请队友加入他们的哨兵作为我们的使命。为达致这个目标，我们处理了三个截然不同的范畴：\n扩展Sentry的权限模型，允许更多类型的用户发送邀请。\n我们的理论是：改善邀请用户的用户体验，并将流程民主化以包括所有团队成员，将显著增加整个团队的采用率。(旁白：的确如此。)。\n在深入了解我们所做的更改及其对底线的影响之前，让我们快速回顾一下用户邀请是如何工作的：您在下面看到的Add Member to Organization页面。\n这种隐藏在Sentry账户设置中的整页体验存在一些问题：\n因为这是一整页，读到它就意味着你会被断章取义，不管你之前在做什么。\n邀请多个用户时，您只能将组分配给相同的角色和团队集合。\n有趣的是，为了提高可发现性，我们以前引入了一些“快速链接”来更容易地访问此页面。但这些链接分散在应用程序中，当用户发出邀请成员意图的信号时，它们不会出现在上下文中。\n这些用户体验和发现挑战感觉就像是显而易见的起点。但是，我们决定从头开始重新思考整个体验，而不是仅仅满足于一种新的“改进”形式。\n我们的第一反应可能并不令人惊讶，我们的第一反应是将这个页面转换成一个模态页面，它设法将前面展示的所有功能都压缩到一个更小、更简洁的体验中。它实际上做得更好：模式更清楚地表明您可以邀请多个用户，并允许您为每个被邀请者设置唯一的权限。\n虽然在Web应用程序中有时会过度使用模态，但我们相信这种方法将解决关键的可发现性和导航问题：它可以在不离开当前页面的情况下在上下文中显示，并且完成表单会返回到您正在做的事情。\n在这一点上，我们另外引入了按钮，以便在整个Sentry中以上下文方式启动邀请新成员模式：\n查看问题并注意到同事的可疑行为？如果他们还不是您的哨兵组织的一部分，您现在可以当场邀请他们。\n尝试将问题分配给团队成员，但在受理人列表中看不到他们的名字？现在，您可以在下拉列表中选择邀请他们。\n创建一个新团队？现在，您可以随时随地直接邀请新成员加入该团队。\n当我们开始在整个应用程序中推出新的“邀请新会员”体验时，我们清醒地认识到：只有大约一半的哨兵用户可以实际使用我们的新模式。这是因为从历史上看，只有拥有所有者或经理级别权限的人才能邀请其他团队成员。拥有这些权限的用户加起来占活动用户的比例不到50%。\n限制向帐户管理员添加新用户的能力是软件工具的常见做法，Sentry也不例外。当一名员工加入一个新团队时，通常会看到这样的交流：\n艾丽斯：太棒了，我们用的是哨兵。你能把我加进这个组织吗？鲍勃：啊，我不能邀请你。也许问问珍？\n在完美的情况下，会找到您的一名管理员，他们会手动将新的队友添加到帐户中。但有时那个人是不知名的，或者在度假，或者可能需要几天、几周甚至几个月的时间。\n我们开始问自己：如果我们可以释放团队成员来快速跟踪整个过程，并邀请成员自己，会怎么样？这导致了我们的下一个重大变化：更新我们的权限模型，允许成员请求邀请其他成员。\n现在，当非管理员打开邀请新成员模式时，它会根据上下文更改为“请求邀请”，而不是直接邀请。点击“发送”会向所有组织管理员发送一封电子邮件，提示他们批准任何未完成的请求。\n在这一点上，我们已经建立了我们认为是非常棒的新用户体验，我们刚刚将可以利用它的用户数量增加了一倍。但这种开放用户邀请的做法让我们思考：如果还有更多我们没有接触到的未开发用户呢？\n在上一节中，我们重点介绍了一个场景，其中一个队友请求另一个队友访问Sentry。由于我们最近的变化，用户可以请求自己邀请他们的团队成员，而不是必须跟踪并询问他们的帐户管理员。\n但是这个场景仍然有一个把关元素：新的队友必须向另一个队友请求访问权限。如果新队友发现来自斯莱克哨兵的警报源于他们最近的变化，而周围没有人授予他们访问权限，该怎么办？不幸的是，他们会落在认证墙上，这会阻止他们走得更远。\n这就提出了一个问题：是否有未开发的潜在用户来源，我们没有通过将邀请限制为活动哨兵用户来接触到？如果新用户根本不需要询问任何人会怎么样呢？\n因此，为了让这个聚会继续进行，我们深入研究并额外允许外部用户请求加入组织。\n现在，当用户登录到组织的登录页面时，他们可以选择“请求加入”，这将要求提供用户的姓名和电子邮件地址。点击Send(发送)后，组织所有者将收到一封电子邮件，提示他们批准加入请求。以防万一，还要求他们的组织完全禁用该功能。\n在开发了一个新的上下文邀请模式和两个对邀请友好的权限更改之后，我们确信这些更改将对用户行为产生强大的影响。现在是时候把我们的钱放在我们的代码所在的地方了，并验证所有这些艰苦的工作是否真的起到了作用。\n我们验证产品变更有效性的标准程序是通过A/B测试(也称为拆分测试)。这意味着利用我们的应用程序代码在同一时间段内为不同的用户群提供不同的体验，并比较结果。这一步需要额外的努力，但这是值得的-因为另一种选择是满足于数据的前后快照，这太容易受到季节性或营销推动等外部因素的影响。\nℹ️要了解更多关于我们如何在哨兵执行A/B测试的信息，请参阅之前的这篇博客文章。\nA/B测试很容易让人忘乎所以，而且有太多的排列，以至于你没有足够的数据在统计上有意义。因此，为了简单起见，我们决定所有的治疗都将获得新的模式体验，我们的“治疗”小组将专注于新的许可更改。\n这样我们就有了4种不同的治疗方法，我们向4个同等规模的客户群推出了这4种治疗方法：\n我们确定成功的主要标准是：这些处理中的哪些会增加被接受的邀请(从而增加新用户)？\n接受同时启用邀请请求和邀请治疗请求的用户增加21%。\n允许更多的用户邀请团队成员可能会导致更多的用户邀请团队成员，这可能并不令人惊讶。同时启用这两个功能集甚至更好(考虑到它们相辅相成)，这可能也就不足为奇了！\n让更多的用户加入您的平台固然很好，但是如果这些用户从未真正使用过产品，那又有什么意义呢？要真正相信我们的改变是成功的，我们还需要确保治疗组中的受邀者确实在使用Sentry。\n在内部，我们认为“活跃用户”是那些在30天内与产品有意义地互动的人(而不是刚刚登录)-例如，查看或分类问题。在基线处理中，用户在以71.3%的比率接受邀请后变得活跃。在其余的治疗组中，这一数字从72.7%到78.4%不等。\n第一个有趣的观察是，尽管我们让邀请用户变得更容易，但邀请的总体接受率实际上是上升的。这与转换优化项目在漏斗的一个部分改进指标的趋势背道而驰，而牺牲了漏斗中进一步向下的其他指标。这可以归因于在新的流程中邀请了更多合格的用户。\n第二个观察结果是，INVITE VARIANT的请求明显优于其他VARIANT。我们的猜测是，这是因为成员邀请他们的团队成员进行协作是获得新的敬业用户的最好方式之一。\n在积累了足够的数据来对我们的结果充满信心(并发布上面的数据)之后，我们最近关闭了A/B测试，并向所有组织推出了这些更改。如果您是任何组织的Sentry用户，现在您将发现这些新的上下文邀请链接和邀请友好的权限更改可供使用。\n最初是一个简单的项目来改进我们的邀请UX，后来扩展到包括有意义的权限更改，这些更改显著提高了新用户加入和使用Sentry的速度。我们没有部署任何诡计或“增长黑客”来实现这些结果；我们只是通过避开用户并让他们解决自己的问题来使产品变得更好。作为产品开发人员，没有比这更令人满意的了。\n该项目是我们多学科发展团队的共同努力：Evan Purkhiser(软件工程师)、Megan Heskett(软件工程师)、John Manhart(设计师)、AJ Jindal(增长负责人)和Adhiraj Somani(产品经理)。\n哨兵的成长工程团队正在招聘！如果您有兴趣帮助我们使用数据改善Sentry的入职、用户体验和整体采用率，我们很乐意与您交谈。请查看我们在https://sentry.io/careers/.上的公开职位", "note_en": "At its core, Sentry is a tool that alerts you to defects in your production software. But it does more than blast stack traces into your inbox: Sentry provides powerful workflows to help your team determine root cause,  triage issues to your team, and keep tabs on ongoing concerns with comments and notifications.\n These collaborative features can help you resolve problems with your software quickly. But the keyword here is  collaborative; without your full team having access to Sentry, you may find yourself quickly becoming overwhelmed with an endless backlog of issues and no one to help.\n At the end of 2019, the Growth team made it our mission to make it easier for our users to invite their teammates to join them on Sentry. To achieve this, we tackled three distinct areas:\n Expanding Sentry’s permission model to allow  more types of users to send invitations\n Our theory: improving the user experience of inviting users,  as well as democratizing the process to include all team members would lead to a significant increase in team-wide adoption.  (Narrator: it did.)\n  Before we get deep into what we changed and how it impacted the bottom line, let’s quickly revisit how user invitations worked: the  Add Member to Organization page you see below.\n  This full-page experience, tucked away deep in Sentry’s account settings, had a number of issues:\n Since this is a full page, reaching it meant you would be taken out of context of whatever you were doing previously\n   When inviting multiple users, you could only assign the group to the same role and collection of teams\n Interestingly, to improve discoverability, we had previously introduced a number of “quick links” to reach this page more easily. But these links were scattered around the application, and didn’t appear contextually when users signaled intent to invite members.\n  These user experience and discovery challenges felt like obvious starting places. But instead of just settling for a new “improved” form, we decided to rethink the entire experience from the ground up.\n  It’s probably not a surprise that our first instinct was to convert this page into a modal – one that manages to squeeze all of the capabilities shown earlier into a smaller, more concise experience. It actually does one better: the modal is clearer in indicating that you can invite multiple users, and allows you to set unique permissions for each invitee.\n  While modals are sometimes overused in web applications, we believed this approach would solve our key discoverability and navigation concerns: it can be shown contextually without leaving the current page, and completing the form returns you to what you were doing.\n To that point, we additionally introduced buttons to launch this  Invite New Members modal contextually throughout Sentry:\n Viewing an issue and notice a  suspect commit made by a coworker? If they’re not already part of your Sentry organization, you can now invite them then and there.\n Trying to assign an issue to a team member, but don’t see their name in the assignee list? You now have the option to invite them right in the dropdown.\n Creating a new team? Now you can invite new members directly to that team as you go.\n  As we began rolling out our new  Invite New Members experience across the application, we came to a sobering realization: only roughly   half of Sentry users could actually use our new modal. That’s because historically, only those with Owner or Manager-level permissions could invite other team members. Combined, users with these permissions accounted for less than 50% of active users.\n  Restricting the ability to add new users to account administrators is pretty common practice for software tools, and Sentry is no exception. When an employee onboards on a new team, it’s common to see an exchange like this:\n Alice: Oh awesome, we use Sentry. Can you add me to the organization?Bob: Ah, I can’t invite you. Maybe ask Jen?\n In a perfect world, one of your administrators is tracked down, and they manually add the new teammate to the account. But sometimes that person is unknown, or is on a vacation, or maybe it takes them days or weeks or even months.\n We began asking ourselves: what if we could unlock team members to fast-track this whole process and invite members themselves? This led to our next major change: updating our permission model to allow for  members to request to invite other members.\n  Now, when non-administrators open up the Invite New Members modal, it changes contextually to become a “request to invite” rather than a direct invitation. Hitting “send” kicks off an email to all organization administrators, who are prompted to approve any outstanding requests.\n  At this point, we had built what we thought was a fantastic new user experience and we just  doubled the number of users who could take advantage of it. But this exercise of opening up user invitations got us thinking: what if there was an even  further source of untapped users we weren’t reaching?\n  In the last section, we highlighted a scenario where one teammate asks another teammate for access to Sentry. And because of our recent changes, users can request to invite their teammates themselves instead of having to track down and ask their account administrator.\n But this scenario still has a gatekeeping element: the new teammate has to ask  another teammate for access. What if the new teammate spots an alert from Sentry in Slack stemming from their recent changes, and no one’s around to grant them access? Unfortunately, they’d land on an authentication wall that would prevent them from going any further.\n  This begged the question: was there an untapped source of potential users we weren’t reaching by restricting invitations  only to active Sentry users? What if new users didn’t have to ask anyone at all?\n So, to keep this party going, we dug in and additionally made it possible for  external users to request to join an organization.\n  Now when a user lands on an Organization’s login page, they have the option to “Request to join”, which asks for the user’s name and email address. Once they hit send, the organization owners are sent an email that prompts them to approve the join request. Just in case, there’s also a call-to-action to disable the feature entirely for their organization.\n  Having developed a new contextual invitation modal and a pair of invite-friendly permission changes, we were  feeling confident that these changes were going to have a strong impact on user behavior. It was time now to put our money where our code was, and verify that all this hard work actually moved the needle.\n  Our standard procedure for validating the efficacy of product changes is through A/B testing (also known as split testing). This means instrumenting our application code to serve different experiences to segments of users over the same time period, and comparing the results. This step takes extra effort, but it’s worth it – the alternative is to settle for a before-and-after snapshot of data, which is too easily impacted by external factors like seasonality or marketing pushes.\n ℹ️  To learn more about how we perform A/B testing at Sentry, please see  this earlier blog post.\n It’s easy to get carried away with A/B testing, and having so many permutations that you don’t have enough data to be statistically significant. So, to simplify things, we decided that all treatments would get the new modal experience, and our “treatment” groups would focus on the new permission changes.\n This left us with 4 distinct treatments that we rolled out to 4 equally-sized customer segments:\n  Our main criteria for determining success: which of these treatments would result in  an increase in  accepted invitations (and thus new users)?\n  21% more users accepted invitations who had both  Request to Invite and  Request to Invite treatments enabled\n It’s probably not a surprise that allowing a wider set of users to invite team members resulted in more users inviting team members. It’s also probably not a surprise that enabling both feature sets at the same time was even better (given that they complement each other)!\n  Having more users join your platform is great, but what’s the point if those users never actually  use the product? To be truly confident our changes were successful, we need to additionally make sure that invitees in the treatment groups were actually  using Sentry.\n Internally, we view “active users” as those who meaningfully interact with the product within a 30 day period (vs. just signing in) – for example, viewing or triaging an issue. In the baseline treatment, users became active after accepting an invitation at a rate of 71.3%. In the remaining treatment groups, that number ranged from 72.7% to 78.4% .\n  The first interesting observation is that despite us making it easier to invite users, overall acceptance rate of invites  actually  went  up. This bucks the trend of conversion optimization projects improving metrics in one part of the funnel at the expense of other metrics further down the funnel. This can be attributed to  more qualified  users being invited in the new flows.\n The second observation is that the  Request to Invite variant significantly outperformed the other variants. Our guess is that this is because members inviting their teammates to collaborate is one of the best ways to acquire new engaged users.\n  Having accumulated enough data to feel confident in our results (and to publish the data above), we recently turned off our A/B tests and rolled out these changes to all organizations. If you’re a Sentry user on  any organization, you’ll now find these new contextual invite links and invite-friendly permission changes available to use.\n What began as a simple project to improve our invitation UX expanded to include meaningful permission changes that significantly improved the rate at which new users both join  and use Sentry. We didn’t deploy any trickery or “growth hacks” to achieve these results; we just made the product better by getting out of the way of the user and letting them solve their own problems. As product developers, it doesn’t get more satisfying than that.\n This project was a combined effort from our multi-disciplinary Growth team: Evan Purkhiser (Software Engineer), Megan Heskett (Software Engineer), John Manhart (Designer), AJ Jindal (Head of Growth), and Adhiraj Somani (Product Manager).\n The Growth Engineering team at Sentry is hiring! If you’re interested in helping us use data to improve the onboarding, user experience, and overall adoption of Sentry, we’d love to talk to you. Please check out our open roles at  https://sentry.io/careers/.", "posttime": "2020-07-15 13:23:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "邀请,sentry", "title": "我们如何通过重新考虑邀请来增加Sentry的月度活跃用户", "title_en": "How we grew Sentry's monthly active users by rethinking invitations", "transed": 1, "url": "https://blog.sentry.io/2020/02/12/how-we-grew-sentrys-monthly-active-users-by-rethinking-invitations", "via": "", "real_tags": ["邀请", "sentry"]}, {"category": "", "categoryclass": "", "imagename": "8afed90b2c56ff0ac62be080a8c028cc.png", "infoid": 1011957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "直升机258是直升机突击队的一个港口，这是一款由马克·柯里在1990年用Turbo Pascal编写的DOS游戏。\n大约30年后，也就是2020年，我重新拾起了旧代码，给它注入了一些新的活力。我已经将其移植到C语言，并使其与SDL2一起工作，现在它可以在现代环境中本地运行。\n遗憾的是，您的浏览器似乎不兼容。由于使用了某些低级功能，这款游戏目前只能在桌面Chrome上运行。\n感谢Mark Currie允许我发表他的游戏的这个翻译版本。除了发布源代码、可播放版本、可播放版本之外，我还在为该项目撰写一系列文章，其中第一部分包括在下面。\n我还制作了一些动画和互动部分，你可以随意操作，比如后面的调色板选取器。\n我选择重访“直升机突击队”有几个原因。最大的问题之一就是怀旧。我记得小时候很喜欢玩这个游戏，在我的电脑上和其他人一起玩，对一些新奇的机制感到惊讶。我还记得我笑得很开心。这是我玩的第一个游戏，你可以离开汽车，四处奔跑，步行做事情，然后回到里面继续前进。我认为这太酷了，这是我今天喜欢的沙盒游戏的早期先驱。我对这样的卧室编码工作情有独钟，游戏的核心和灵魂不会被许多层的润色所掩盖。想象一个15岁的马克·柯里在他的286上为自己写一个游戏，并从中获得真正的乐趣，这并不是太难想象的。作为一个年轻的有抱负的游戏程序员，这样的游戏对我来说是相当重要的。不像像“超级马里奥”这样的东西，在当时我似乎拿不到，我可以玩这个，并开始研究如何制作类似的东西，即使用我现有的简单工具也是如此。这比我之前的作品“太空入侵者”更小，也更直接。这个项目花了大约3个月的日历时间，总共花了大约200个小时。由于这个游戏的源代码是可用的，尽管是用Pascal编写的，所以不需要太多的逆向工程。大部分工作都花在了从C语言到C语言的转换，以及构建新的代码来为Turbo Pascal API提供类似的工作。我最后做的部分之一，声音，也是最难的部分之一。最初的游戏以一种动态的方式使用PC扬声器的声音，我不得不为它编写一个合成器。这是相当费力的时间，并使其听起来像原来的。在第二部分中将详细介绍这一点。原来的代码大约有5500行Pascal，全部是游戏逻辑代码，新的C版本大约有5500行游戏逻辑，1500行支持代码和400行注释。与上一个项目相比，这个项目中没有太多未发布的代码。我写了几个小片断来帮助翻译，一些脚本来构建字体数据，还有一些原型来帮助弄清楚声音代码。我最终还是写了一点Pascal代码，主要是作为原始游戏源代码的临时mod来帮助我弄清楚原始系统在做什么。有关编译旧代码的更多详细信息将在后面的文章中提供。我在这个项目上做的第一件事就是找出原始游戏的帧缓冲区格式，然后开始破解，让它在现代系统上显示出来。帧缓冲器是CGA，这意味着它是320像素宽，200行高，有2位调色板颜色，一次在屏幕上总共有四种可能的颜色。下面是游戏中所有CGA荣耀的屏幕截图精选。\n仔细一看，即使每个屏幕只能显示四种颜色，也可以看到总共有四种以上的颜色。这是托帕莱特的应收款。在CGA方案中，有四个基色调色板可用，并且每个调色板都有16种可能颜色的不同排列。作为一个额外的调整，调色板中的第一种颜色(通常是背景色)可以从十六种颜色中自由选择，从而提供了稍微多一点的灵活性。这意味着四个基本调色板中的每一个都有十六个变体，总共有六十四个调色板。要使用颜色组合，请单击下面第一个面板中的彩色区域。您可以选择调色板和背景色，效果将使用其中一个屏幕截图显示在第二个面板中。使用“上一张”和“下一张”可以切换到不同的屏幕截图。在旧系统中，帧缓冲区和调色板设置是存储在显卡上的小块内存，由游戏直接操作。在新系统中，这些驻留在主机内存中，每帧都必须动态转换为现代纹理格式，以便GPU使用。由于只有64个可能的调色板，可以使用一个巧妙的技巧来简化和加速帧缓冲区转换。在比赛开始前，所有可能的组合", "note_en": "chopper258 is a port of  Chopper Commando, a DOS game written by  Mark Currie using Turbo Pascal in 1990.\n Some thirty years later, in 2020, I&#39;ve dusted off the old code and breathed some new life into it. I&#39;ve ported it to C and made it work with SDL2, and it can now run natively in modern environments.\n            Unfortunately, your browser looks to be incompatible. The game currently only works in Desktop Chrome, due to the use of certain low level features.\n Thanks to Mark Currie for granting me permission to publish this translation of his game. In addition to publishing the  source code, and  playable version, playable version, I am also writing a series of articles to accompany theproject, the first part of which is included below.\n I have also made some animations and interactive parts that you can  play aroundwith, such as the  palette picker later on in this piece.\n   I chose to revisit Chopper Commando for a few reasons. One of the biggest ones is nostalgia. I remember enjoying playing this gameas a child, on my PC and with others, and being surprised at some of the novelmechanics. I also remember having a good laugh. This is the first game I played where you could leave avehicle, run around and do things on foot, and then get back in and keep going.I thought that was so cool, and it was an early precursor to the sandbox games Ienjoy today. I have a soft spot for bedroom coded efforts like this, where the heart andsoul of the game isn&#39;t obscured by many layers of polish. It&#39;s not too hard toimagine a 15-year old Mark Currie writing a game for himself on his 286, andgetting a real kick out of doing so. Games like this were pretty formative for me as a young aspiring gamesprogrammer. Unlike something like Super Mario, which seemed unreachable to me at the time, I could play this and start working out how to make something similar, even with the simple tools I had.  This was a bit smaller and more straightforward than my previous effort, Space Invaders In C. This projecttook around 3 months of calendar time, and about 200 hours were spent on it in total. As the source code to the game was available, albeit in Pascal, not muchreverse engineering was required. Most of the effort went into the translationto C, and building new code to provide workalikes for the Turbo Pascal API. One of the last parts I worked on, the sound, also turned out to be one ofthe most difficult. The original game used PC speaker sound in a dynamic way,and I had to write a synthesizer for it. It was quite fiddly to get the timingright and make it sound like the original. More on that in part two. The original code is around 5500 lines of Pascal, all of it game logic code.The new C version is around 5500 lines of game logic, 1500 lines of supportcode and 400 lines of comments. Compared to the last project, there isn&#39;t too much behind the scenesunpublished code in this one. I wrote a few small pieces to aid translation,some scripts to build the font data, and some prototypes to help figure out thesound code. I did end up writing a little bit of pascal code, mostly as temporary mods to theoriginal game source to help me figure out what the original system was doing. Moredetail on compiling the old code is provided in a later piece.  One of the very first things I did on the project was to figure out the framebuffer formatfor the original game, and start hacking to get it to display on a modern system. The frame buffer is CGA, meaning it is 320 pixels wide, 200 lines high and has2 bit paletted color, for a grand total of four possible colors on screen atany one time. Below is a selection of screen shots from the game in all their CGA glory.\n  If you look carefully, even though each screen can only show four colors, you can see that there are more than four colors in total. This is due topalettes. In the CGA scheme, four base color palettes are available and each has adifferent arrangement of sixteen possible colors. As an extra tweak, the first color in the palette (typically the background color), can befreely chosen out of the sixteen, giving slightly more flexibility. This means that thereare sixteen variations of each of the four base palettes, giving sixty four palettes in total.  To play with the color combinations,  click on the colored areas in the first panel below.You can pick a palette and background color, and the effect will be shown in the second panel,using one of the screenshots. Use prev and next to cycle to a different screenshot.  In the old system, the framebuffer and the palette settings are bits of memorythat live on the graphics card and are twiddled by the game directly. In thenew system, these reside in host memory, and must be converted into a modern texture formaton the fly every frame for the GPU to use. Given that there are only 64 possible palettes, a neat trick can be used tosimplify and speed up the framebuffer conversion. Before the game startsrunning, every possible combination of palette, background color and inputframebuffer byte (4 pixels at 2bpp) are iterated through, and the resulting 8output bytes (4 pixels at 16bpp) are stored in a 16 * 4 * 256 entry lookuptable. Converting the framebuffer each frame is then just a matter of iteratingthrough each byte and performing a simple lookup and memcpy to stamp out fourpixels at a time.  As mentioned earlier, the sound code was one of the hardest parts of the port. Part twoexplains why that was so, and the solution I used to solve it.", "posttime": "2020-07-15 13:01:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "直升机,commando,游戏", "title": "直升机突击队再次亮相", "title_en": "Chopper Commando Revisited", "transed": 1, "url": "https://blog.loadzero.com/blog/chopper258/", "via": "", "real_tags": ["直升机", "commando", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "eb0a7cc0f7982c06cf65ed65b6380357.jpg", "infoid": 1011956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周初，适用于数字店面的欧盟新法规开始生效，最引人注目的是苹果和谷歌针对移动设备的法规。新的规定大大加强了那些通过这些市场销售的人的权利。\n如果你愿意，你可以在这里看到这些规则的全部内容，或者就像EGDF的Jari-Pekka Kaleva在GI.biz上讨论的那样，它涵盖了开发人员与商店之间持续存在的广泛问题。\n平台在从商店中删除内容之前必须向出版商发出30天的通知，让他们有时间上诉或对其软件进行更改。因此，没有立即和不透明的禁令(第4条)。\n这些规定(第5条)将迫使商店在其排名系统的运作方式上更加透明，例如，让出版商了解“流行”应用程序是如何被选择的。\n第7条也遵循类似的主题，店面必须披露任何可能给一个商品卖家相对于另一个卖家的“差别待遇”，这应该结束对较大出版商的任何真正(或想象中的)优惠待遇-或者至少让每个人都清楚地知道，竞争环境是如何以及何时不公平的。\n此外，这些信息以及出版商收到的所有信息都必须以您可以理解的方式编写。所有条款和条件将以“通俗易懂的语言”起草。\nKaleva指出，新规定不会对游戏机商店或订阅服务造成很大影响，因为这些更像是数字零售商，而不是开放市场。\n“它们与玩家有直接的交易关系，并不受新规例规管，因为它们是‘网上中介服务’，方便开发商/出版商和玩家之间进行直接交易。”\n在此之前，欧盟最近宣布对苹果进行反垄断调查，特别是App Store和Apple Pay，这可能会进一步扼杀苹果商店及其做法的翅膀，蒂姆·斯威尼(Tim Sweeney)最近对此表示支持。", "note_en": "New EU regulation came into play at the start of the week that applies to digital storefronts, most notably Apple and Google’s for mobile devices. With the new regulations significantly strengthen the rights of those selling through such marketplaces.\n The rules, which you can  see here in full if you’re happy to fight through them, or as discussed here by the  EGDF’s Jari-Pekka Kaleva on GI.Biz, cover a wide range of ongoing issues that developers have with stores.\n Platforms will have to provide 30 days notice to publishers before removing content from stores, allowing them time to appeal or make changes to their software. So no immediate and opaque bans (article 4).\n The regulations (in article 5) will force stores to be more transparent in how their ranking systems work, letting publishers understand how ‘trending’ apps are being chosen for instance.\n  Article 7 follows similar themes, with storefronts having to disclose any ‘differentiated treatment’ it may give one seller of goods over another, which should put paid to any real (or imagined) preferential treatment for larger publishers – or at least make it clear to everyone how and when the playing field isn’t even.\n Also, that information, and all the information that publishers receive will have to be written in terms that you can understand. With all terms and conditions to be drafted in ‘plain and intelligible language’.\n Kaleva notes that the new regulations will not largely impact console stores or subscription services, as these act more like digital retailers than open marketplaces.\n “They enter into direct transactional relations with players, and do not fall under the new regulation as ‘online intermediation services’ that facilitate the initiating of direct transactions between developers/publishers and players.”\n All of this follows the recent announcement of an EU antitrust probe against Apple, specifically the App Store and Apple Pay, which may further clip the wings of the store and its practices, and which  Tim Sweeney threw his support behind recently.", "posttime": "2020-07-15 13:01:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,apple,苹果,法规,app", "title": "欧盟法规加强了开发者与店面的对抗(例如苹果应用商店)", "title_en": "EU regulation strengthens developers vs. storefronts (e.g. Apple App Store)", "transed": 1, "url": "https://www.mcvuk.com/business-news/new-eu-regulation-strengthens-hand-of-developers-and-publishers-in-dealings-with-storefronts/", "via": "", "real_tags": ["开发", "apple", "苹果", "法规", "app"]}, {"category": "", "categoryclass": "", "imagename": "9781cc2f76c0026b8f4c3ab7b0a276a6.jpg", "infoid": 1011953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在12岁的时候加入了我们附近当地志愿消防队的青年小组。十几岁的时候，我没有意识到青年教官们将乐趣、训练、重复和严格的命令巧妙地结合在一起，把我们从笨拙的年轻人变成了真正的消防员。后来，我明白这不是一件容易的事。当我接手青年指导员的角色并慢慢进入这一行业时，我意识到激励和培训青少年是多么困难(见上图我的青少年团队在灭火器培训期间的照片)。准备、训练和指导11-15岁的男孩和女孩长达4年，同时保持他们的动力，直到他们最终加入扑灭房屋火灾和营救猫的成年人的队伍，这是一个挑战。\n有人会认为，救火的行动已经促使志愿消防员参加每周一次的晚上训练，每年几个为期几天的课程，并承担起组织中的责任，从而牺牲他们的空闲时间。\n我了解到，这并不是那么容易，因为我更多地参与了组织的管理，并在15年后最终当选为我们部门的副消防局长。这听起来可能很老套，但志愿者不会仅仅因为你的级别更高而跟随你。你需要信任，人们也必须相信你能处理好手术。如果你下达命令进入着火的房子，人们只有在信任你的情况下才会遵守你的命令(如果这是有意义的)。\n如果你命令人们必须出现在下周的训练中，他们不会的。他们没有必要这样做。不是军队，不是他们的工作，他们会找借口，慢慢淡出组织。当我们的活跃人员从50人缩减到20人时，我经历了艰难的时期。\n工程师几乎是自愿为您工作的。他们挣很多钱，但是因为他们为你工作，我想他们真的很不错；)而且他们会马上找到另一份好工作的。因此，在更长的一段时间内，金钱不是一个激励因素，你必须让他们保持动力。我已经听过首席执行官们说：他们应该为为我们工作感到自豪。从长远来看，这甚至对五大都不起作用，所以我想，它也不会对你起作用。\n我想工程师和志愿消防队的动态是非常相似的，也许它甚至适用于所有的团队。在这篇文章中，我总结了我在消防部门学到的五大教训，以及它如何帮助我塑造了作为一名工程经理的领导风格。\n特别是在球队的动力已经下降的情况下，对于领先的球队来说，保持下去是超级困难的。但这正是最重要的阶段，关键是要有一个不放弃的领导。对于一支处于这种螺旋式下降中的球队来说，最重要的是结构。\n在消防部门，当团队由于缺乏动力而变得越来越小时，我们犯了一个大错误：我们取消了一些每周的演习，因为在场的人太小了，无法进行更大规模的行动-或者至少这是借口。结果，更多的人感到厌烦，退学了。\n当动力减弱时，我在工程团队中看到了类似的情况。人们变得越来越被动，他们不再提议迎头赶上，不再集思广益，也不再相互交谈来寻找问题的最佳解决方案。\n在这种情况下，在你经历困难时期之前，坚持你希望已经建立的常规是至关重要的。不接受1：1会议、回顾会议或其他定期会议的取消请求。在这种危险的情况下，作为领队，你就是力量之塔，你可以帮助球队渡过难关。这听起来相当容易，但实际上并非如此。在这种情况下，我也很沮丧，也没有动力。\n每个人的工作方式都不同，但我认为一个普遍的建议是先稳定自己。在工作之外做一些让你快乐的事情。走近你的盟友(私下或商务)，讨论一下情况，以便能更快地消化它。在那之后，支持团队并保持日常活动。对于每周一次的消防员演习，我准备了后备计划，以防人太少的情况下出现。准备好后备计划并保持系统运行总是很好的。对于1：1，你可以试着通过问一些不同的和新的问题来给它带来一些变化。\n庆祝你的团队，和团队一起庆祝。我在这里明确提到它，因为我经常忘记它。特别是作为领队，你的节奏并不总是与团队同步。我经常遇到这样的情况：在项目的最后阶段，我已经被下一个项目的组织任务压得喘不过气来。\n一句简单的“谢谢”可能就足够了，或者有时需要和团队一起开一个大派对。当团队完成了一些事情，可以进入当之无愧的休息时间时，领导应该考虑庆祝活动，以及她如何感谢人们。消防员牺牲他们的空闲时间，参加训练活动，而他们可以与家人、朋友一起度过时间，或者只是以另一种方式享受他们的空闲时间。\n我们的消防队在奥地利因斯布鲁克山区的一个较高的地区，在冬天(雪)和夏天(洪水)的自然灾害期间，我们的消防队几次值班好几天。邀请朋友和家人来参加消防部门的小型晚宴没什么大不了的，但你要向所有参与其中的人表示感谢。\n您的开发团队可能也会遇到类似的令人精疲力竭的情况。他们为了赶在最后期限前完成任务而加班几个星期，或者只是因为他们相信这个项目而非常努力地工作。这不是常态，你应该感谢他们。说“谢谢”的方式有很多种，可以是在1：1的会议上致谢，也可以是在日常工作环境之外的更大规模的团队活动。对我来说，重要的是这是一句真诚的“谢谢”，而不仅仅是两个字。同样，他们也可以用不同的方式消磨时间，其他公司也可以支付员工工资，这并不是你独有的。\n这听起来很明显，但是你了解你的人吗？你能回答每个团队成员的以下问题吗？\n在我们的消防部门，我们需要负责IT系统、消防车、设备和工具维护、操作制服和许多其他领域的人员。当进入着火的房子时，你最好知道工具和设备的维护是以适当的方式进行的。仅仅分配责任是不够的，你必须了解人们的热情，如果他们真的想做这件事的话。此外，你必须判断他们是否能够并且想要学习他们需要知道的一切，以接管一个责任领域。\n在一家公司或团队中，你还会发现有很多不同的任务需要完成。特别是在规模较小的公司，并不是每个领域都有专家。对于人们来说，这可能是一种负担，但也是一个机会，让他们不仅做好自己的主要工作，还会感到无聊。有些人喜欢时不时地做其他事情，也喜欢学习新事物。\n招聘就是一个很好的例子。并不是每个人都想做这件事，也不是每个人都适合做这件事。你必须了解你的员工，有时也要督促他们接受新的挑战。有些人经常低估自己，认为自己没有足够的知识来接受新的挑战。无论是担任新项目的技术领导角色、招聘，还是从个人贡献者角色转换为经理角色，都无关紧要。当你了解人们，了解他们的技能和兴趣，你就可以更好地判断他们是否有能力做到这一点，你可以帮助或激励他们发现新的挑战，发展他们的技能。\n有大量的领导力文章表明，国家说“不”是至关重要的。在很多情况下，这可能是真的，但当涉及到公司或团队文化时，我不同意他们的观点。想想你自己，想想你向某人提建议时的感受，然后你得到的回答是“不”，或者或多或少相当于“是的，但是&amp；mldr”。我称这些短语为激励杀手，使用它会让团队成员感到沮丧。\n答应并不意味着你必须接受或喜欢一切。例如，答案是“是的，听起来是个可行的想法。你将如何实施呢？“。并不意味着你同意它。您可以提出更多问题，并与团队成员一起分析提案。在最坏的情况下，通过回答你的问题，这个人意识到这个想法可能会有一些问题。在最好的情况下，这是值得的，而且已经有一个团队成员买入并想要参与这个项目。\n我从真正年轻的消防员那里听到了很多想法，他们提出了新的训练方法或超级酷的训练对象，比如古老的干燥圣诞树(见本文开头的图片)。有时候，特别是对于更资深的人来说，一个“是的，伟大的想法”作为领导的支持信号就已经足够了。如果这个人需要更多的指导，领导的工作就是提供指导，并跟进指导，使项目结束。\n遵循这种积极的“说好”的态度，你最终会有很多想法，在我看来，这也是你的团队繁荣创新文化的主要因素之一。一位开发人员曾经提议召开一次每周一次的分享会，座右铭是“这周我学到了这件很酷的事情”，后来他也推动并组织了这次非常成功的会议。这一倡议提供了结构(第1课)，并支持人们学习新事物(第3课)。感谢(第二课)，不仅是我自己，还有其他几个团队成员。我什么也没做，只是说“好的，好主意，我们试试吧”。你不必每件事都靠你自己发明，这总是需要团队的努力。\n前面提到的所有点都会影响到它，团队最重要的关键绩效指标(KPI)，团队的幸福感。这是一个模糊的术语，很难衡量，然而，对于团队领导者来说，它应该是他们优先考虑的事情。我不想在这里详述，因为幸福以某种方式涵盖了几乎所有人的话题，但我想提到幸福的两个重要因素。在我看来，优秀的开发人员想要接受挑战，想要学习，所以您应该通过塑造环境来促进这两个因素，使其成为可能。\n当我们的消防部门遭遇高辍学率时，我们将大部分职责分配给积极的人，给他们新的挑战，并努力与剩下的人一起前进。结合空前牛逼的团队氛围，短短一段时间后，我们就因为口碑而成长起来。人们听说加入消防部门很好玩，可以学到很多新鲜有意义的东西，是一个很开放的群体。\n我在一家公司再次经历了同样的情况，当时我们在一个运作良好的团队中开设了一些职位。同一家公司的几个人直接找到我，在内部申请了这个职位，因为他们听到了很多关于我们团队的好评。因此，如果你在招聘方面有问题，让你的团队开心，让他们成长。这可能非常耗时，对您的团队也是一笔巨大的投资，但最终，它会得到回报。\n我加入消防队的时候只有12岁，25年多了，我仍然是消防队的一员。我仍然喜欢多样化的球队，喜欢这里的氛围，每当我回到家乡，我都会参加训练，从15年前我训练过的年轻人那里学到新东西。显然，你不能将工程经理的工作归结为一个方面，但在我看来，复制这种使人们能够在友好和专业的环境中学习和成长的文化是领导力的关键。别忘了说谢谢。谢谢你的阅读。\n这篇文章不只是给管理者看的！值得一提的是，即使没有领导/经理的角色，每个人都可以在这些领域做出贡献，这一点对我来说非常重要。在所有提到的情况下，我都不是一个人，很多想法和改变都是由“非经理人”推动的。所以，请提出想法和推动项目，即使你没有戴上官方的“经理”或“领导”帽子。我强烈推荐阅读汤姆·巴特尔(Tom Bartel)的文章“作为个人贡献者的领导力”。返回顶部↑。\n很长一段时间以来，我一直在想，现代IT世界中更常见的自下而上的领导风格是否也适用于等级森严的传统环境，如消防员或军人世界。我知道这在我们的小志愿消防部门是可能的，但我也知道其他消防部门的分级领导方式非常普遍。我认为我们的部门更像是一个例外，我不确定这样的领导风格是否会在有受薪消防员的专业消防部门奏效。\n后来当我在Trivago工作的时候，我读到了“让船掉头”这本书！戴维·马奎特和我发现它显然可以在这样的环境下工作。这本书是由海军核动力潜艇的一名指挥官写的，他解释了他是如何应用自下而上的领导风格的，这种风格赋予人们在这个传统上非常等级制度的环境中的权力。\n这本书涵盖了如何领导的许多方面，同时授权人们对自己负责，并在自己的角色中成长。我可以强烈推荐这本书给任何领导，特别是工程经理。最后，海军专家和IT专家之间的差异可能比预期的要小。)。\n非常感谢克里斯托夫·施伦茨(Christof Schlenz)，他是我的朋友、青年指导员，后来也是我们消防部门的消防队长，他教会了我如何在没有“等级权威”的情况下领导。", "note_en": "I joined the youth group of our small local volunteer fire department in the neighbourhood when I was 12 years old. As a teenager, I was not aware that the youth instructors applied a very smart mix of fun, training, repetition, and strict commands to transform us from clumsy youngsters to real firefighters. Later, I understood that it wasn’t an easy task. I learned how difficult it is to motivate teenagers and train them when I took over the youth instructor role and slowly got into this business (see picture above of my team of youngsters during a fire extinguisher training). It is a challenge to prepare, train, and guide 11-15 years old boys and girls 4 years long while keeping them motivated until they can finally join the crew of adults who extinguish house fires and rescue cats.\n  One would think that the action of fighting a fire already motivates volunteer firefighters to join the weekly training in the evening, several multi-day courses every year, and take over responsibilities in the organization and, thus, sacrifice their free time.\n I have learned that this is not that easy after I was more involved in the management of the organization and was finally elected as the deputy fire chief of our department after 15 years. It might sound corny, but volunteers don’t follow just because you have a higher rank. You need trust and people have to believe that you can handle an operation. If you give the command to enter a burning house, people will only follow your commands if they trust you (and if it makes sense).\n If you give an order that people have to show up at the training next week, they won’t. They don’t have to. It is not the army, it is not their job, they will find excuses and will slowly fade out from the organization. I have experienced hard times when our crew of active people has shrunk from 50 to 20 people.\n   Engineers work almost voluntarily for you. They earn a lot of money but as they work for you, they are really good I guess ;) and they will find another good job immediately. Thus, money isn’t a motivator for a longer period of time and you have to keep them motivated.I already heard CEOs say: they should be proud to work for us. In the long run that even doesn’t work for the  Big Five, so I assume, it won’t work for you either.\n I figured that the dynamics of engineers and volunteer firefighter teams are very similar, maybe it applies even for all kinds of teams. In this post I have summarized my top five lessons learned from my time in the fire department and how it helped me to shape my leadership style as an engineering manager.\n  Especially when the motivation in the team is already down, for a lead, it is super hard to keep going. But this is exactly the most important phase and it is crucial to have a lead who does not give up. For a team in this downwards spiral, the most important thing is structure.\n In the fire department, when the team got smaller and smaller due to a lack of motivation, we made a big mistake: We canceled some of the weekly drills as the group of present people was too small to practise bigger operations—or at least that was the excuse. As a result, even more people got bored and dropped out.\n I saw similar situations in engineering teams when the motivation was down. People got more and more passive and they no longer proposed to catch up, to have brainstorming sessions, or to talk with each other to find the best solution for a problem.\n In this situation it is essential to insist on the routine that you have hopefully already established before you experience difficult times. Do not accept cancellation requests for 1:1 sessions, retrospectives, or other regular meetings. In this dangerous situation, as a lead, you are the tower of strength and you can help the team to overcome the situation. It sounds quite easy but in reality it is not. In such situations I was depressed and unmotivated as well.\n Everybody works differently but I think a piece of general advice is to stabilize yourself first. Do something outside of your job that makes you happy. Approach your allies (in private or business) and discuss the situation to be able to digest it faster. After that, support the team and keep the routine going. For the weekly firefighter drills I prepared backup plans in case too few people showed up. It is always good to have backup plans to be prepared and keep the system going. For 1:1s, you can try to bring some variety to it by e.g.  asking different and new questions.\n   Celebrate your team and celebrate with the team. I mention it here explicitly because I forgot it too often. Especially as a lead your rhythm is not always synced with the team. It happened regularly to me that during the last phase of a project I was already snowed under with organizational tasks for the next project.\n A simple “thank you” might be enough, or sometimes a big party together with the team is called for. When the team has accomplished something and can move on to the well-deserved resting time, the lead should think about the celebration and how she can thank people. Firefighters sacrifice their free time and join training events while they could spend time with their families, friends, or just enjoy their free time in another way.\n Our fire department is in a higher region in the mountains in Innsbruck in Austria and it happened several times that the team was on duty for several days during natural disasters in winter (snow) and summer (floodings). It is not a big deal to invite over friends and family to a small dinner party in the fire department but you show the appreciation of all the people involved.\n  Your development team might also run into similar exhausting situations. They do over-hours for several weeks to meet a deadline or just work very hard because they believe in the project. This is not the norm and you should thank them. There are many ways of saying “thank you”, and it can range from thanks you deliver in a 1:1 meeting to a bigger team event activity outside of your daily work environment. For me, it is always important that it is an honest “thank you” and that it is not just two words. Again, they could also spend their time in a different way and also other companies pay their employees, that is not unique to you.\n  It sounds obvious, but do you know your people? Can you answer the following questions for every team member?\n  In our fire department we need people who take responsibility over the IT system, fire trucks, equipment &amp; tools maintenance, operational uniforms, and a lot of other areas. When entering a burning house you better know that the maintenance of tools and equipment was done in a proper way. It is not sufficient to just distribute the responsibilities, you have to know about the passion of people and if they really want to do it. Furthermore, you have to judge if they can and want to learn everything they need to know to take over a responsibility area.\n  In a company or team you also find a variety of different tasks that have to be done. Especially in smaller companies you do not have specialists for every single area. This can be a burden but also an opportunity for people to not only do their main job and get bored. Some people like to do other things from time to time and also learn new things.\n A good example is recruiting. Not everybody wants to do it and not everybody is suited for it. You have to know your people and sometimes, also push them a bit to take on new challenges. Some people underestimate themselves very often and think they do not know enough to take on a new challenge. It doesn’t matter if it is about taking the tech lead role of a new project, recruiting, or switching from an individual contributor role to a manager role. When you know people, their skills and interests, you can judge better if they are capable of doing it and you can help or motivate them to find new challenges and develop their skills.\n  There are tons of leadership articles out there that state saying no is crucial. In a lot of situations that might be true but I disagree with them when it is about company or team culture. Think about yourself and how you feel when approaching somebody with a suggestion and then you get the reply “no” or the more or less equivalent “yes, but&amp;mldr”. I call those phrases motivational killers and using it leads to frustrated team members.\n Saying yes doesn’t mean that you have to accept or like everything. For example, the answer “Yes, that sounds like a feasible idea. How would you implement it?” doesn’t mean that you agreed with it. You can ask more questions and analyze the proposal together with the team member. In the worst case, by answering your questions, the person realizes that there might be some issues with the idea. In the best case, it is worth working on it and there is already a team member who buys in and wants to work on this project.\n I heard a lot of ideas from really young firefighters who proposed new ways of training or super cool training objects like old dry Christmas trees (see image at the beginning of the article). Sometimes, especially with more senior people, a “yes, great idea” as a supporting sign from the lead can be already sufficient. In case the person needs more guidance, it is the job of the lead to provide it and also follow up on it to bring the project to an end.\n  Following this positive “say yes” attitude, you will end up with a lot of ideas and in my opinion, it is also one of the main ingredients for a prosperous innovation culture in your team. One developer once proposed a weekly sharing meeting under the motto “I learned this cool thing this week” and later also drove and organized the very successful meeting. This initiative provided structure (lesson 1), and supported people to learn new things (lesson 3). The thank you (lesson 2), was not only given by myself but also by several other team members. I did nothing but saying “yes, cool idea, let’s try it out”. You don’t have to invent everything on your own, it is always a team effort.\n  All previously mentioned points influence it, the most important key performance indicator ( KPI) of your team, the team’s happiness. It is a fluffy term and it is difficult to measure, nevertheless, for team leads, it should be on top of their priority list. I do not want to go into detail here as happiness covers almost all people topics somehow but I want to mention two important factors for happiness. In my opinion, good developers want to be challenged and want to learn, so you should boost those two factors by shaping the environment to make it possible.\n  When our fire department suffered from a high dropout rate, we distributed most responsibilities to active people, gave them new challenges and tried to keep going with the remaining people. Combined with the all-time awesome team atmosphere, we grew after a short period of time just due to the word of mouth. People heard that it is fun to join the fire department, you can learn a lot of new and meaningful things, and it is a great open-minded group.\n I experienced the same situation in a company again when we opened some positions in a well-functioning team. Several people in the same company directly approached me and applied for the position internally as they heard a lot of good things about our team. So in case you have recruiting problems, make your team happy and let them grow. This might be a very time consuming and a big investment in your team, but eventually, it will pay off.\n  I was twelve when I joined the fire department and I am still a member of the team after more than 25 years. I still like the diverse team, the atmosphere, and whenever I am in my home town I join drills and learn new things from people who were in the team of youngsters I trained 15 years ago. Clearly you cannot boil down the work of an engineering manager to one aspect but in my opinion replicating this type of culture that enables people to learn and grow in a friendly and professional environment is key in leadership. And don’t forget to say thank you. Thanks for reading.\n   This article is not only for managers! It is very important to me to mention that everybody can contribute in those fields, even without a lead/manager role. In all mentioned situations I was not on my own and a lot of ideas and changes were driven by “non-managers”. So please, propose ideas and drive projects, even if you do not wear the official “manager” or “lead” hat. I can strongly recommend reading the article  Leadership as an Individual Contributor by Tom Bartel.  back to the top ↑\n  For a long time I was wondering if a bottom-up leadership style, which is more common in the modern IT world would also work in a very hierarchical traditional environment, such as the world of firefighters or military. I know it was possible in our small volunteer fire department but I also knew other fire departments where the hierarchical leadership approach was very common. I saw our department more like an exception and I was not sure if such a leadership style would work in a professional fire department with paid firefighters.\n Later when I was working for trivago, I read the book  Turn The Ship Around! by L. David Marquet and I found out that apparently it can work in such an environment. The book is written by a commander of a nuclear-powered submarine in the navy who explains how he applied the bottom-up leadership style which empowers people in this traditionally very hierarchical environment.\n The book covers a lot of aspects of how to lead while empowering people to take responsibility for themselves and to grow in their roles. I can strongly recommend this book to any lead and especially engineering managers. At the end the difference between navy specialists and IT specialists might be smaller than expected ;)\n    Thanks a lot to Christof Schlenz, my friend, youth instructor, and later fire chief of our fire department who showed me how to lead without “ authority by hierarchy&#34;.", "posttime": "2020-07-15 12:39:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经理,taught,团队", "title": "作为一名工程经理，消防工作教会了我什么", "title_en": "What firefighting taught me for my job as an engineering manager", "transed": 1, "url": "https://wolfgang.gassler.org/firefighter-experience-impact-on-leadership-style/#not-only-for-managers", "via": "", "real_tags": ["经理", "taught", "团队"]}, {"category": "", "categoryclass": "", "imagename": "5d9c95d8e41fa57e4ddc22291744da82.jpg", "infoid": 1011952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个世纪以来，人类一直认为海洋是如此广阔，不可能对其造成可测量的伤害。但我们现在知道，人类活动会破坏关键的海洋栖息地，危险地污染海水，使海洋环境变得更加酸性。过度捕捞扰乱了食物链，直接将许多海洋物种推入极度濒危的类别，并导致包括斯特勒海牛在内的一些动物完全灭绝。今年3月，光滑的手鱼Sympterichthys unipennis正式成为第一条被宣布灭绝的现代海水鱼。\n手鱼是一个由14种不寻常的海底栖息物种组成的家族，与深海鳗鱼有亲缘关系。塔斯马尼亚大学(University Of Tasmania)的海洋生态学家格雷厄姆·埃德加(Graham Edgar)表示，与大多数其他鱼类不同的是，它们没有幼体阶段，成年后也不太会四处走动；这些特征使它们对环境变化非常敏感。埃德加说：“它们大部分时间都坐在海床上，如果受到干扰，偶尔会拍打几米。”由于缺乏幼体阶段，它们无法分散到新的地点-因此，手鱼的数量非常局部化，容易受到威胁。他补充说，1996年，另一种名为斑点手鱼的物种是国际自然保护联盟(IUCN)红色名录上第一条被列为极度濒危的海洋鱼类。\n光滑的手鱼曾经非常常见，成为欧洲探险家在澳大利亚描述的第一批鱼类物种之一。尽管在已知的范围内(包括埃德加和他的同事)进行了频繁的科学采样，但现在一个多世纪以来都没有报告过这种情况。红名单指导方针正式将“灭绝”定义为“没有合理怀疑最后一个人已经死亡”的意思。埃德加和澳大利亚国家手鱼恢复小组的成员今年早些时候被迫得出这个结论，红色名单将其列入灭绝类别。科学家们不确定到底是什么导致了该物种的灭绝，但该地区的其他物种受到拖网捕鱼、污染和气候变化的威胁。\n埃德加说，更多的海洋鱼类物种可能也已经灭绝了，尽管科学家们还不能做出这一呼吁。还有更多的物种处于极度濒危状态。非营利保护组织“海洋”的首席科学家凯蒂·马修斯说：“可能很难想象，为什么在一个几乎没有人去过的地方，一个小小的有机体占据一席之地会很重要--但它是一种来自极端微生物的酶，目前正被用于诊断新冠肺炎的测试中。”“海洋”组织的首席科学家凯蒂·马修斯(Katie Matthews)说，“在一个几乎没有人去过的地方，一个小小的有机体为什么会如此重要。”“生物多样性很重要，即使你不能亲眼看到。”\n理想情况下，这一消息将是一个悲哀的警钟：“一些现存的手鱼物种濒临灭绝，”马修斯说，“但只要采取明智的行动，我们就可以减轻这些威胁。”", "note_en": "For centuries humans believed the ocean was so vast that it was impossible to do it measurable harm. But we now know human activities can destroy critical marine habitats, dangerously pollute seawater and make sea environments more acidic. Overharvesting has disrupted food chains and directly pushed many ocean species into the critically endangered category—and has driven some animals, including Steller&#39;s sea cow, into total extinction. This past March the smooth handfish,  Sympterichthys unipennis, officially became the first modern-day marine fish to be declared extinct.\n  Handfish are a family of 14 unusual bottom-dwelling species related to deep-sea anglerfish. Unlike most other fishes, they do not have a larval phase and do not move around very much as adults; these traits make them sensitive to environmental changes, according to Graham Edgar, a marine ecologist at the University of Tasmania. “They spend most of their time sitting on the seabed, with an occasional flap for a few meters if they&#39;re disturbed,” Edgar says. “As they lack a larval stage, they are unable to disperse to new locations—and consequently, handfish populations are very localized and vulnerable to threats.” In 1996, he adds, another species called the spotted handfish was the first marine fish listed as critically endangered on the International Union for Conservation of Nature (IUCN) Red List.\n  The smooth handfish was once common enough to be one of the first fish species described by European explorers in Australia. Now none has been reported in well over a century, despite frequent scientific sampling in its known range (including by Edgar and his colleagues). Red List guidelines officially define “extinct” as meaning “there is no reasonable doubt that the last individual has died.” Edgar and the members of Australia&#39;s National Handfish Recovery Team were forced to that conclusion earlier this year, and the Red List placed it in the extinct category. Scientists are unsure exactly what finished off the species, but others in the region are threatened by trawl fishing, pollution and climate change.\n  Edgar says additional marine fish species may already be extinct as well, although scientists cannot yet make the call. Many more are critically endangered. “It might be hard to imagine why a little organism occupying a small niche in a place few humans ever visit might be important—but it&#39;s an enzyme from an extremophile microbe that&#39;s being used in tests to diagnose COVID-19 right now,” says Katie Matthews, chief scientist for the nonprofit conservation group Oceana. “Biodiversity matters, even if you can&#39;t see it with your own eyes.”\n  Ideally, this news will be a sad wake-up call: “Some remaining species of handfish are endangered,” Matthews says, “but with smart action, we can mitigate those threats.”", "posttime": "2020-07-15 12:19:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "灭绝,handfish,物种", "title": "平滑的手鱼灭绝标志着一个悲哀的里程碑", "title_en": "Smooth Handfish Extinction Marks a Sad Milestone", "transed": 1, "url": "https://www.scientificamerican.com/article/smooth-handfish-extinction-marks-a-sad-milestone/", "via": "", "real_tags": ["灭绝", "handfish", "物种"]}]