[{"category": "", "categoryclass": "", "imagename": "a81b20264a51be670f2804fd81d39f8d.jpeg", "infoid": 1066851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据联邦数据的说法，今年迄今为止，今年距离今年的新野火数量达到了十年高位。促使警告长期，潜在危险的火灾。\n  现在最受关注的领域之一是犹他州，内华达州和俄勒冈州东部的高沙漠伟大的盆地地区。\n  ＆＃34;当你站立死草时，当我们有高热量时，当我们有高温时，点火潜力急剧增加，＆＃34; Paul Peterson表示，土地管理局的火灾管理官。\n  自1月份以来，超过28,000英亩的野火烧毁了这一日期的最多火灾。目前在西方有33个活跃的大火。峡谷和凤凰城以东的峡谷和山谷中最大的最大速度烧焦了超过175,000英亩。它含有73％。\n    本周西方的录制热浪尚不讨论＆＃39; t帮助缓解火灾危险。温度飙升到盐湖城，拉斯维加斯和蒙大拿州的三位数中，新野火的日本普通突出了几周。\n    它们包括24,000英亩的大火燃烧的黄石国家公园，靠近红屋顶镇的黄石国家公园。它到目前为止销毁了18个结构，含有0％。在一年中的这个时候，木材和草地出现异常干燥。\n    ＆＃34;它不是很典型的，＆＃34; Pilly Chapman表示，Custer-Gallatin国家森林的公共信息官。 ＆＃34;我想到了很多＆＃39;热量。我们真的没有任何春雨。＆＃34; \n如果异常温暖的温度和干燥的条件持续到夏天，查普曼预测严重的野火季节。  ＆＃34;事情可能会改变 - 我希望他们做到 - 但这不是一个很好的趋势，＃34; 他说。  高风在蒙大拿州＆＃39;首都，海伦娜附近燃烧了另一个大火燃烧，其中一个国家自然资源和保护直升机在战斗中坠毁的燃烧着。 所有五名机组人员都患有轻微的伤害。  这个故事的早期版本在一张照片标题中表示，罗伯逊绘制火灾是Wyo的水牛南部。事实上，它是蒙特红色小屋的南部。 ", "note_en": "The number of new wildfires in the U.S. so far this year is at  a ten-year high, according to federal data, prompting warnings of a long, potentially dangerous summer of fire.\n  One of the biggest areas of concern right now is the high desert Great Basin region in Utah, Nevada and eastern Oregon.\n  &#34;When you have standing dead grass that&#39;s already out there and when we have high heat, that ignition potential raises dramatically,&#34; said Paul Peterson, a fire management officer for the Bureau of Land Management.\n  Since January, more than a million acres have burned from more than 28,000 wildfires – the highest number of fires for this date since 2011. There are currently 33 active large fires across the West. The biggest has scorched more than 175,000 acres in the canyons and valleys east of Phoenix. It is 73% contained.\n    A record-breaking heat wave across the West this week isn&#39;t helping ease fire danger. Temperatures have soared into the triple digits in Salt Lake City, Las Vegas and Montana, where new wildfires are sparking weeks earlier than normal.\n    They include a 24,000-acre fire burning northeast of Yellowstone National Park near the town of Red Lodge, Mont. It has destroyed 18 structures so far and is 0% contained. The timber and grasses there are unusually dry for this time of year.\n    &#34;It&#39;s not very typical,&#34; said Billy Chapman, public information officer at Custer-Gallatin National Forest. &#34;I think a lot of it&#39;s the heat. We have not had any spring rain really.&#34;\n  Chapman predicts a severe wildfire season if the abnormally warm temperatures and dry conditions continue into the summer.\n  &#34;Things could change – and I hope they do – but this is not a good trend,&#34; he said.\n  High winds have fueled another large fire burning near Montana&#39;s capital, Helena, where a state Department of Natural Resources and Conservation helicopter crash-landed while battling the blaze. All five crew members survived with minor injuries.\n An earlier version of this story said in a photo caption that the Robertson Draw Fire was south of Buffalo, Wyo. In fact, it is south of Red Lodge, Mont.", "posttime": "2021-06-19 15:32:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "野火,high,火灾", "title": "新的野火在炎热，干燥的西方野生中达到了10年的高位 ", "title_en": "New Wildfires Are At A 10-Year High In The Hot, Dry Western US", "transed": 1, "url": "https://www.npr.org/2021/06/17/1007784176/new-wildfires-10-year-high-western-u-s", "via": "", "real_tags": ["野火", "high", "火灾"]}, {"category": "", "categoryclass": "", "imagename": "f1dbc60d581b005804f9867d1d9b8758.jpeg", "infoid": 1066850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月的澳大利亚餐厅Crux发布的视频显示了一些影响他们周日早午餐的任何影响者所期望的东西：一把刀慢慢地在荷兰那岛拍了一个鸡蛋，因为任何好的鸡蛋是 - 直到金黄蛋糕渗出。但外观正在欺骗，并且由于覆盖到剪辑上的文本明确表示：是的，它是素食主义者。是的，它是流行的。\n  对于素食主义者，乳酸素食者和其他任何削减卵消耗的人，长期以来几种方法可以取代鸡蛋的功能。亚麻籽，Chia种子，香蕉，苹果酱和淀粉混合物，如eNer-g蛋换剂，鸡蛋的绑定任务很好地进行了味道，可以在味道中找到。豆腐可以加扰，鹰嘴豆粉可以煮成薄，煎蛋型薄板。当素食主义看到一个令人兴奋的鼎盛时期时，其他商业蛋换剂选择正在上升。\n  沿着您的心灵，这位基于工厂的空间的50岁的领导者，2015年推出了一种争吵的替代品。VEGG销售蛋蛋白替代品，包括粉末，意味着模拟法式吐司等菜肴中的蛋黄的味道和质地。 Juggernaut只是鸡蛋，其绿豆的液体争先恐后的鸡蛋，在2018年争抢美国。到今年3月，当刚收到卡塔尔投资机关的额外投资2亿美元，公司卖了相当于1亿鸡蛋。华盛顿邮政报道，2019年，2019年，美国人在每年吃大约279个鸡蛋 - 最高50年的鸡蛋消耗最高。\n  但是，商业素食产品尚未捕获的特殊快乐：鸡蛋蛋黄在其所有粘性，球状，食物色情 - 荣耀。毕竟，尤利，与“把鸡蛋放在上面”的放纵Instagram吸引力有关，是否是“它”是披萨，汉堡还是早餐哈希。对于那些不想完全放弃鸡蛋概念的人，素食主义者鸡蛋用柔滑的白人和球形液体蛋黄是难以捉摸的但不是遥不可及的。这就是家庭和餐厅厨房的厨师有多欺骗科学，使基于工厂的Yolk POP成为可能。\n  在2018年在阿德莱德开设的症状，提供了两种方式的素食蛋。鸡蛋本尼迪克特含有他们的偷猎，它为蛋黄的白人和西红柿使用腰基。早餐三明治采用了煎蛋的传真，配有闪亮，大豆的白人，含有花边边缘和蛋黄的相同泡沫。虽然你可以告诉蛋黄的主要组成部分是西红柿和大豆，但是，两个版本都是在Crux Owner George Thomson说的那种版本中的白人的质地和味道。 “客户不断评论我们所做的事情被认为是”巫术“。\n  开发Crux的素食蛋“绝对消耗”汤姆森，培养皿大约五年来。 “我看到人们在网上制作素食主义者'煎蛋'，我想，我可以做得更好，”他说。 YouTube单独提供许多方法。 2018年，Ellie Blowen的博客elsa的健康生活共享了一个非常模仿的视频，其中她将南瓜融入黄色混合物中，然后将其Dolpoped它送到由面粉和椰奶制成的圆圈上。 Emmymade的emmy cho在使用鸡油果上的食谱上悄悄地，Canistel的口语名字;当它成熟时，与中美洲最原产树的树的水果相比，与煮沸的蛋黄的质地相比。然而，这些食谱尚未缩短，是“蛋黄”并没有吞噬，而是一勺酱油在有效的白色煎饼。\n   未加工的鸡蛋蛋黄是蛋白质，脂肪，水和矿物质的液体混合物，其包裹在透明膜中，使蛋黄与构成蛋清的蛋白分开。为了使素食蛋蛋黄表现得类似，然后复制膜至关重要。 \n在20世纪40年代获得专利的食品科学家William Peschardt，球形化是一种捕获薄凝胶膜中液体的技术。 Peschardt建议它用于“人工食用樱桃，软片等”。该过程通过混合含有藻酸钠的可食用液体，然后将其滴入盐浴中。 （还有逆向球化，涉及将含钙物质滴入藻酸盐浴中。）当藻酸钠达到钙离子时，离子粘合在一起，液体浸出凝胶皮。\n  Flacherification在2003年真正进入公众意识，当时西班牙餐厅El Bulli  - 赢得了上一年的最佳餐厅，每年从2006年到2009年开始使用它并获得橄榄果汁制成的“橄榄”这样的菜肴赞誉。 El Bulli和Chef FerranAdrià是烹饪运动中的领导者，有时被称为“分子美食”，尽管许多与之相关的厨师使用“现代化的烹饪”。\n  归功于物理学家Nicholas Kurti和ChemistHervé，其约会于1988年，分子美食是一个研究领域，探讨了家庭和餐厅厨房的烹饪背后的科学。 （“食品科学”与比较，一般是指工业粮食生产，安全和营养的研究。）该术语也被误认为是百科全书的不列颠诺坦尼卡 - 指的是使用科学创造新的菜肴和烹饪技巧。由于1990年代末，1990年代末，“分子美食”等厨师的工作，即“分子美食，”尽管潜在的错误数，但却成为泡沫，凝胶和球体等格式的食物的代名词。\n  曾以鸡蛋的热爱闻名的Dufresne甚至是椰子 - 胡萝卜混合物，旨在看起来像他纽约市餐厅WD-50的阳光壮丽的鸡蛋，从2003年到2014年开放。（2007年，Dufresne的“鸡蛋”成为了在线厨师的Marcel Vigneron“撕开了”撕开了“网络蛋”时的“撕裂了”的争议的主题。）\n  今天，Crux-of Comper-Sustes Facherized将番茄蛋蛋黄转化为番茄蛋黄。使用西红柿的类似技术在2019年的Insider视频中普及关于洛杉矶素食餐厅CrossRoads厨房，它自从2016年以来一直为番茄蛋黄提供服务。新的Paltz，纽约的Lagusta甜美的委员会于2016年开业，创造了它的自己的“分子蛋”在拉面顶部提供。但是，当Buzzfeed在诸如此写作中有近400万视图的视频中尝试时，Crossroads厨房的番茄技术在去年的善意时甚至更加关注。该方法正在Tiktok上的回合：除了Crux的剪辑之外，番茄素素食鸡蛋出现在User @ Oprahwinfrey.car1本月早些时候的Tiktok中，目前拥有350万次景观。 Crux还使用与腰果混合物的球形化，以使其其余的素食荷包蛋。\n  Lisa Kitahara Food Blog Okodici厨房开发了她的素食蛋蛋黄食谱，因为她错过了Tamago Kake Gohan，生蛋的舒适食物混合在炎热的米饭中，当她的家人每年访问日本时，她会吃。她还使用了球形化技术，而不是西红柿，她发现“太多汁”，她发现了使用南瓜，胡萝卜或甜土豆的成功，使蛋黄基础是光滑和黄油的蛋黄。\n  Kitahara在Tamago Kake Gohan的另一个关键成分是Nagaimo，这是一个山地山药，在加入蛋黄之前，她将腌制到她的碗里。 “这有点模仿鸡蛋的粘性纹理，”她说。她还在素食主义者中使用Nagaimo，以Kaki Fry或日式炸牡蛎。在那篇论述中，长头队以鸡蛋的方式束缚她用来挖掘牡蛎蘑菇的混合物，也增加了一种粘着的雪，这使得来自海洋的牡蛎。 \n蛋黄比表格更多，许多素食蛋食谱中的常见风味元素包括kitahara和汤姆森是kala namak，也被称为印度人或喜马拉雅黑盐。与含有活性炭的夏威夷黑盐不同，Kala Namak含有硫磺化合物，使鸡蛋的气味和味道不同。其中一个是硫化氢，这是鸡蛋的味道，从饥饿诱导腐烂的污垢。\n  为什么这些技术在商业甚至餐厅的意义上都不会更受欢迎可能是因为努力成为制造它们。汤森开发了一个成功的素食蛋原型之后，他的下一个挑战是在更大的规模上进行的，这是一个花了几个月的过程。 “制作少量素食主义者的鸡蛋是一件事，这是一个在商业环境中创造成千上万的不同游戏，”他说。“ “素食主义者'煎蛋'和素食主义者'偷猎鸡蛋'即使在完善两种方法之后，也会采取巨大的能量。”\n  虽然Kitahara在她的博客上为她的素食蛋蛋黄进行了食谱，但她计划继续尝试这些过程。她喜欢最终解决一个版本的onsen tamago（“温泉蛋”中的日语），鸡蛋在低于沸腾的温度下慢慢煮熟，直到它们柔滑，柔软，番荔枝。她认为这可以通过使用琼脂来实现这一常用素食替代。 “即使是现在，我又非常兴奋地对食谱有点兴奋，”Kitahara说。也许有一天，她建议，她可以为每个人的偏好制作完美的素食蛋的指导;她想弄清楚蛋黄混合物中的根蔬菜的正确比例，以创造从流y蛋糕到更厚的更熟练的看似的液体的选择。\n  在Crux，素食主义者蛋黄如此准确，这两种菜肴目前都有一个免责声明，“请小心鸡蛋。” “在菜单上的警告之前，人们对人们低估了他们的常见情况，他们最终会在素食主义者蛋黄中覆盖，”汤姆森说。 ", "note_en": "A  video posted by the Australian restaurant  Crux on TikTok last month shows something you’d expect from any influencer filming their Sunday brunch: A knife slowly breaks an egg—blanketed in hollandaise, as any good eggs Benedict is—until golden yolk oozes out. But appearances are deceiving, and as the text overlaid onto the clip makes clear: Yes, it’s vegan. And yes, it pops.\n  For vegans,  lacto-vegetarians, and anyone else cutting their egg consumption, there have long been many ways to replace the functions of the egg. Flax seeds, chia seeds, bananas, applesauce, and starch blends like Ener-G Egg Replacer perform the binding tasks that eggs do so well—a guide to which can be found  in Taste. Tofu can be scrambled, and chickpea flour can be cooked into a thin, omelette-esque sheet. Other commercial egg replacer options are on the rise as veganism  sees an exciting heyday.\n  Follow Your Heart, the 50-year-old leader in the plant-based space, launched a substitute intended for scrambles  in 2015.  Vegg sells egg replacer products including a  powder meant to simulate the taste and texture of egg yolks in dishes like French toast. The juggernaut is  JUST Egg, whose mung bean-based liquid that scrambles like real eggs, hit the United States  in 2018. By March of this year, when JUST  received a $200 million investment backed by the Qatar Investment Authority,  the company had sold the equivalent of 100 million chicken eggs. Chicken eggs remain big business:  In 2019, Americans were eating about 279 eggs per person per year—the highest egg consumption in almost 50 years, the  Washington Post reported.\n  But there’s a particular pleasure that commercial vegan products haven’t yet captured: the egg yolk in all of its gooey, globular, food porn-y glory. The yolk, after all, has much to do with the indulgent Instagram appeal of “ putting  an egg  on it,” whether “it” is a pizza, a burger, or a breakfast hash. For those who don’t want to give up the concept of the egg entirely, the vegan egg with silky whites and a spherical liquid yolk is elusive but not out of reach. This is how obsessed cooks in home and restaurant kitchens have tinkered with science to make the plant-based yolk pop possible.\n  Crux, which opened in Adelaide in 2018, offers vegan eggs two ways. The eggs Benedict contains their poached version, which uses a cashew base for the whites and tomatoes for the yolks. The breakfast sandwich features their facsimile of a fried egg, complete with shiny, soy-based whites with lacy edges and the same bubble of a yolk. Though you can tell that the egg yolks’ main components are tomatoes and soy, the texture and flavor of the whites in both versions is spot on, says Crux owner George Thomson. “Customers are constantly commenting about how what we do is considered ‘wizardry.’”\n  The process of developing Crux’s vegan eggs “absolutely consumed” Thomson, who has been vegan for about five years. “I saw people making vegan ‘fried eggs’ online, and I thought,  I could do that better,” he said. YouTube alone offers many methods. In 2018, Ellie Bullen of the blog Elsa’s Wholesome Life shared a much-imitated video in which she  blended pumpkin into a yellow mixture and then dolloped it onto a circle made of flour and coconut milk. Emmy Cho of Emmymade  riffed on that recipe using eggfruit, the colloquial name for canistel; when it’s ripe, the fruit, which comes from a tree native to Central America,  is compared to the texture of a hard-boiled egg yolk. Where these recipes fall short, though, is that the “yolks” aren’t poppable, but rather a spoonful of sauce atop what is effectively a white pancake.\n   A raw chicken egg yolk is a liquid mixture of protein, fat, water, and minerals that’s encased in a  transparent membrane, which keeps the yolk separate from the albumen that makes up the egg whites. To make a vegan egg yolk that behaves similarly, then, replicating that membrane is crucial.\n  Patented in the 1940s by food scientist William Peschardt, spherification is a technique that traps a liquid in a thin gel membrane. Peschardt suggested it for use in “artificial edible cherries, soft sheets, and the like.” The process works  by mixing an edible liquid that contains no calcium with sodium alginate, and then dropping it into a calcium salt bath. (There’s also  reverse spherification, which involves dripping a calcium-containing substance into an alginate bath.) When the sodium alginate meets the calcium ions,  the ions bind together, giving the drops of liquid a gel skin.\n  Spherification really entered public consciousness in 2003, when the Spanish restaurant El Bulli—which won World’s Best Restaurant the previous year, and every year from 2006 to 2009— began using it and gained acclaim for dishes like  an “olive” made out of olive juice. El Bulli and chef Ferran Adrià were leaders in the cooking movement that’s sometimes referred to as “molecular gastronomy,” though many chefs associated with it use terms like “ modernist cuisine.”\n  Credited to physicist Nicholas Kurti and chemist Hervé This and dating to 1988,  molecular gastronomy is a field of study that explores the science behind cooking in home and restaurant kitchens. (“ Food science,” by comparison, generally refers to the study of industrial food production, safety, and nutrition.) The term was also used—mistakenly,  according to Encyclopedia Britannica—to refer to the use of science to create new dishes and cooking techniques. Thanks to the work of chefs like Adrià, Heston Blumenthal, and Wylie Dusfresne in the late 1990s to early 2000s, “molecular gastronomy,” despite the potential misnomer, became synonymous with foods in formats like foams, gels, and spheres.\n  Dufresne, who was known for his love of eggs, even served a  coconut-carrot mixture designed to look like a sunny-side-up egg at his New York City restaurant WD-50, which was  open from 2003 to 2014. (In 2007, Dufresne’s “egg” became the subject of brief food world controversy when  Top Chef’s Marcel Vigneron “ ripped [it] off” with his “ cyber egg” that was featured in  Wired.)\n  Today, Crux—which is focused on “boundary-pushing vegan food”—uses spherification to turn a tomato-based mixture into its vegan egg yolk. A similar technique using tomatoes was popularized online in a  2019 Insider video about the Los Angeles vegan restaurant  Crossroads Kitchen, which has been serving a tomato yolk  since at least 2016. New Paltz, New York’s  Lagusta’s Luscious Commissary, which opened in 2016, created its own “ molecular egg” to serve on top of ramen. But Crossroads Kitchen’s tomato technique got even more attention last year when Buzzfeed’s  Goodful tried it in a video that has almost 4 million views as of this writing. The method is now making the rounds on TikTok: In addition to Crux’s clips, a tomato-based vegan egg appears in  a TikTok posted by the user @oprahwinfrey.car1 earlier this month and which currently has 3.5 million views. Crux also uses spherification with a cashew-based mixture to make the rest of its vegan poached egg.\n  Lisa Kitahara of the food blog  Okonomi Kitchen developed her  vegan egg yolk recipe because she missed the tamago kake gohan, a comfort food of raw egg mixed into hot rice, that she would eat when her family visited Japan every year. She also uses the spherification technique, but instead of tomatoes, which she found “too juicy,” she’s found success using squash, carrots, or sweet potatoes to make an egg yolk base that’s smooth and buttery.\n  Another key ingredient in Kitahara’s take on tamago kake gohan is nagaimo, a mountain yam, which she grates raw into her bowl of rice before adding the egg yolk. “It kind of mimics that slimy texture that eggs have,” she said. She also uses nagaimo in her  vegan take on kaki fry, or Japanese-style fried oysters. In that recipe, nagaimo acts in the place of eggs to bind the mixture she uses to dredge oyster mushrooms, and it also adds a sliminess that’s reminiscent of an oyster from the sea.\n  There’s more to an egg yolk than form, and a common flavor element in many vegan egg recipes including Kitahara’s and Thomson’s is  kala namak, also known as Indian or Himalayan black salt. Unlike  Hawaiian black salts that contain activated charcoal, kala namak  contains sulfur compounds that evoke the smell and flavor of eggs. One of these is hydrogen sulfide,  which is responsible for the smell of eggs, from hunger-inducing to spoiled rotten.\n  Why these techniques aren’t more popular in a commercial or even restaurant sense might be because of the effort that goes into making them. After Thomson developed a successful prototype of his vegan egg, his next challenge was making it on a larger scale, a process that took months. “It’s one thing to make a handful of vegan ‘poached eggs,’ it’s a whole different game to create thousands of them in a commercial environment,” he said. “Both the vegan ‘fried eggs’ and vegan ‘poached eggs’ take tremendous amounts of energy to create, even after perfecting both methods.”\n  Though Kitahara has put a recipe for her vegan egg yolk on her blog, she plans to continue experimenting with the process. She’d like to eventually tackle a version of  onsen tamago (“hot springs eggs” in Japanese),  eggs slowly cooked at a temperature below boiling until they’re silky, soft, and custardy. She thinks this could be possible with the use of agar, a common vegetarian alternative to gelatin. “Even now, I&#39;m still very excited to kind of tweak the recipe a bit,” Kitahara said. Perhaps one day, she suggested, she could make a guide to the perfect vegan egg for each person’s preference; she’d like to figure out the right proportions of liquid to root vegetables in her yolk mixture to create options from runny yolks to thicker, more cooked-seeming ones.\n  At Crux, the vegan egg yolks are so accurate that both dishes currently come with a disclaimer to “please pop eggs with care.” “Before the warning on the menu, it was a common occurrence for people to underestimate just how realistic they were, and they would end up covered in vegan egg yolk,” Thomson said.", "posttime": "2021-06-19 15:31:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可口,squeezable,鸡蛋", "title": "挤压，可口素食蛋蛋黄的科学 ", "title_en": "The Science of the Squeezable, Poppable Vegan Egg Yolk", "transed": 1, "url": "https://www.vice.com/en/article/7kv4xy/the-science-of-the-squeezable-poppable-vegan-egg-yolk", "via": "", "real_tags": ["可口", "鸡蛋"]}, {"category": "", "categoryclass": "", "imagename": "1e277f1778f9d49c341b6d5cb32bf46a.png", "infoid": 1066848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第2部分。C编程简介（#include，#define，main（），数据类型，运算符，...等）\n  此Web编程指南启动为YouTube上的视频系列，支持通过Patreon支持。在惠顾＆＃34; C编程＆＃34;等级及以上（Patreon）访问这些额外信息：\n 独家访问其余的＆＃34;编程指南＆＃34;更详细信息和信息，并将其陷入视频中\n  一周的帕勒顿论坛提出有关那周的问题＆＃39; s＆＃34; c编程＆＃34;主题（如果你用视频和需要帮助下沿，这是问的地方）\n  视频系列完成后，我将编程指南编辑为A＆＃34;教自己编程＆＃34;通过出版合作伙伴Lulu预订。顾客可以以成本购买这本书 - ＆＃39;从一般的书中储蓄一大笔钱\n  我喜欢感谢所有支持我的帕勒顿的每个人，包括Jason Pittman，Alexander Shendi，Gustavo Pezzi，Scott Bollinger，Ryan Harris，Rafael Campos，K Mi，Nikola Markovic BGD，Wade Brainerd，Mike Garcia，Philip Espi， Vlastimil Holer，Dan Mons，Stephen Smogen，Bill Marshall，Pater，Brett Owen，Ronald Eichler，Tom Dison，Joe Walker，Magnus Wild，Kwang Lee，Mitchel Valentino，TheGreatCodeholio，Bérenger，Daniel Monteiro，Mark Eichin，Sparheld International GmbH， Hallmentum Llc，Eric Leblanc，Luke Abbott，John Paul Wohlscheid，Sean Dobes，Tom Dearden，Eric Smith，Superilu和Dwayne。 ", "note_en": "Part 2. Introduction to C Programming (#include, #define, main(), data types, operators, … and more)\n  This web programming guide started out as a video series on YouTube, supported through Patreon. Patrons at the &#34;C programming&#34; level and above (Patreon) got access to these extras:\n Exclusive access to the rest of the &#34;programming guide&#34; with more detail and information that didn&#39;t make it into the videos\n  A weekly Patreon forum to ask questions about that week&#39;s &#34;C programming&#34; topics (if you were following along with the videos and need help, this was the place to ask)\n  After the video series was finished, I edited the programming guide into a &#34;teach yourself programming&#34; book, via publishing partner Lulu. Patrons can purchase the book at cost—that&#39;s a big savings from the general cover price for a finished book\n  I&#39;d like to thank everyone who supported me on Patreon, including Jason Pittman, Alexander Shendi, Gustavo Pezzi, Scott Bollinger, Ryan Harris, Rafael Campos, K MI, Nikola Markovic BGD, Wade Brainerd, Mike Garcia, Philip Espi, Vlastimil Holer, Dan Mons, Stephen Smoogen, Bill Marshall, Patater, Brett Owen, Ronald Eichler, Tom Dison, Joe Walker, Magnus Wild, Kwang Lee, Mitchel Valentino, TheGreatCodeholio, Bérenger Doneux, Daniel Monteiro, Mark Eichin, Sparheld International GmbH, Hallmentum LLC, Eric LeBlanc, Luke Abbott, John Paul Wohlscheid, Sean Dobes, Tom Dearden, Eric Smith, SuperIlu, and Dwayne.", "posttime": "2021-06-19 15:31:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,freedos,编程", "title": "在C（2020）中编写Freedos计划 ", "title_en": "Writing FreeDOS Programs in C (2020)", "transed": 1, "url": "https://www.freedos.org/books/cprogramming/", "via": "", "real_tags": ["2020", "freedos", "编程"]}, {"category": "", "categoryclass": "", "imagename": "10d96ecc65a3daaeaae257b0b3980347.jpg", "infoid": 1066847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容的一些人，以及每天更多的人，相信这一点：那些不相信疫苗的美德的人 - 反vaxxers  - 是无知和危险的疯子，可能是邪恶的。\n  我花了大部分时间相信这一点。在我20多岁的早期期间，我在怀疑博客圈，一个2000年代中期的互联网社区，理论上围绕高度富有魅力的博主，冯政府和其他知识分子组织。然而，在实践中，这些群体以更基本的原则为中心：对任何人和它被视为的任何人都有敌意;非理性。＆＃34;那是现在，现在仍然是一个非常白人，男性和防守的地方。\n  正是在那里，我对抗疫苗接种运动发展了深深的抗病。它不是我知道的，他们对疫苗错了。它不止于此。我相信自己在智力上和道德上优于那些人，我加强了每次我发表评论或观看vlog或重新发布关于这个主题的讽刺文章的信念。我掌握了一张脸，一种令人震惊的，不赞成的人在任何时候都有任何人甚至拉大了疫苗怀疑的主题。\n          我九年前遇见了我的妻子。我想乘坐挥舞着舞蹈，并决定采取私募课程来克服我的一些焦虑。当我打电话时，她是拿起电话的老师。\n  我立刻被她吸引了，但在她与她女儿的父亲一起参与她的舞蹈伴侣时。\n  所以起初我们建立了柏拉图友谊。我们花时间在一起。我们对我们对跳舞的共同兴趣结合。我在第一次提到她的女儿没有接种疫苗时，我认识她一年多的一年多。\n  那么，当你相信的人都聪明而且明智的结论时，你做了什么，你发现完全错了？那个人是否停止在那个精确的时刻聪明？ \n我的时间阅读（傲慢）怀疑博客让我说服了我的道德和智力优势。我相信，因为我是一个聪明，明智的，同情的人，我可以看到疫苗的价值。这个女人来了。我知道她不是愚蠢的 - 事实上，我以为她非常有洞察力。我知道她是and＃39; t危险或阴谋 - 我们谈到了关于我们如何关心人的几天，以及我们所居住的社会以及它意味着人类。我已经信任了她。\n  我是否必须完全重新评估我对这个人的看法？我必须检查自己的偏见和精神漫画，决定反vaxxers也是人吗？\n  好吧，没有。我做了大多数人所做的事情：选择认知不和谐。我决定它是值得争吵的，她可以成为我的朋友，同时对疫苗有奇怪的意见。即使她和她的伴侣分手，我和我分手了，我们发现自己在一起度过了很多时间，我忽略了这个问题。疫苗的主题过度或两次过晚餐，但是什么？我可以看到她深深地爱着她的女儿。她是我钦佩和尊重的人，并开始爱。疫苗没有进入vid。\n  而且，当然，如果我们一起度过足够的时间，我最终会改变自己的想法。\n      这是对抗vaxxers的任何真正讨论的殴打心脏。它不可能了解他们的立场而不考虑进入抗疫苗叙事的恐惧的数量，并考虑人们如何构建和处理恐惧。\n    现在，你可能会认为恐惧是恐惧，公共卫生是别的 - 而且你可能是对的。那个＆＃39;是理性的观点。但是，你自己的恐惧是如何理性的？\n  也许你＆＃39;害怕高度。也许它＆＃39; s蜘蛛。在任何一种情况下，你＆＃39;再幸运：应对你的恐惧，大多数人的方式 - 避免 - 不到他人的费用。但是，当每个人都买时，疫苗只能工作。公共卫生取决于反vaxxers面对他们最大的恐惧，因为他的利益。 \n对于那些不分享他们的恐惧的人，它非常简单，方便地要求反vaxxers只是吸收它并拍摄。我希望他们也会。但是，通过侮辱和贬低他们，拒绝认真对待他们的恐惧，即使有很多东西，也从来没有欺负他们，拒绝把他们恐惧的事实欺负，＆＃39;\n  难以做到。你有没有试图盯着眼睛盯着眼睛，告诉她你会把孩子放在危险之中？\n  尽管最初避免了这个主题，但我决定，在我们结婚后，我应该说服我的妻子接种女儿。毕竟，疫苗很好。疫苗是安全的。麻疹爆发一直在新闻 - 提高主题的更好时间更好？\n  但是，当我这样做时，我意识到从她的角度来看，我的所有对抗的推理都听起来像是我要求将枪指向女儿，并让她的信任充满空白。望着她的眼睛，我意识到她对我的信任受到威胁。她问为什么我会这样做。所有的坚持疫苗都是安全的，而＃39; T。去告诉阿拉罕医生父母，你必须把蜘蛛放在孩子身上，因为社会取决于它，看看它是怎么回事。在摘要中表达射门的好处，根本无法通过推翻立即，解除武装的恐惧。\n  所以我退缩了。反vax的位置不是我的交易破碎机，但建议我们应该把女儿暴露给严重危险，因为我的妻子是一个交易破碎机。我爱我的妻子。我没有渴望结束事物。是的，我认为女儿接受疫苗是非常重要的 - 但它没有＆＃39;不是我的妻子会在一个分手斗争中改变主意。\n  我退缩了，在机会出现时，在较少的对抗术语中得到了谈话。\n    我的妻子是我认识的最聪明，最敏感的人之一。那么聪明，明智的人在感知威胁时会做什么？他们做了聪明，明智的事情：采取预防措施并警告他人。 \n再次，它＆＃39很容易将反vaxxers的担忧视为非理性，用偏执的行为向偏执倾斜，但这是一个关键点：推理，一旦你接受大，未经证实的前提，就是有效的。它也是如此远离＆＃39;如果你不考虑它，那么太难了：有一些令人心碎的先例喂养这个逻辑。铅漆，烟草，血统 - 每次都感受到回复的冲动，＆＃34;但疫苗是安全的，每个人都知道，＆＃34;我们应该记住同样的判决，认真和自信地说，关于绝对是危险的事情。\n  去告诉阿拉罕医生的父母，你必须把蜘蛛放在孩子身上，因为社会取决于它，看看是怎么回事\n  如果你＆＃39; ve相信疫苗是危险的，那么抗vax行为几乎是合理的。如果我们想达到这些人，请将他们的逻辑视为荒谬或边缘是最糟糕的策略。它扮演反疫苗接种叙述：它们是＆＃34;只有理智的，＆＃34;警告粗心的群众对一个非常真实和隐患的危险。\n  我的妻子（和她的家人）真诚地相信，虽然她的担忧被认为是非理性的，但他们aren＆＃39; t。它易于想象一下，第一人称如何注意到普遍存在的东西，就像铅一样，被她的同龄人被视为不合理的恐惧 - 并想象你可能是其中一个人之一。第一个反引导人称为曲柄 - 直到它们被证明是正确的。\n  我的观点是＆＃39;反vaxxers可能是对的。他们＆＃39;重新。我的观点是，一旦你相信一些不真实的东西，它很容易保持合理化这种信念。它非常容易将批评者视为短视。当你＆＃39;重申不断攻击，它是＆＃39的自然，使你的恢复力成为你的身份，变得更加致力于维护它。\n  人们不是散文，在那里你可以通过细心，不受干扰的解剖来回到前一段并破坏前瞻。人们谈话和人民栏杆。我的妻子不会袖手会让我挑选她，就像她是一个需要解决的问题;她的前锋 - 就像其他人一样＆＃39; s  - 是她身份的一部分。我们所有人都有这种情况;它＆＃39;我们大多数人都可以更容易地离开它们。我们需要停止看到反vaxxers作为可以被说服抛弃坏主意的人，而是我们＆＃39;重申抛弃自己的一部分 - 他们的防御性的身份感＆＃39; ve鼓励糟糕的策略。\n      身份感或＃39;唯一一个使反vaxxers不受影响对抗对抗的争论。如果你采取深刻争议的立场，特别是在开始，你赢得了持续持续的持久性，没有强大的支持系统。不幸的是，恐惧卖 - 和＃39;总是有人愿意为您提供价格。 \n显然，不要＆＃39; t信任或价值常规医学的人仍然生病。在加拿大，在我生活的地方，社会化医疗保健涵盖几乎所有传统的医疗费用，但有一个严重的私人市场，宁愿从替代来源获得治疗。这些替代来源可以做一些好处：生病的人需要照顾，并且一定程度的护理通常比不健康更好。但替代卫生行业也是一个企业，而且在最糟糕的是，这就是业务的作品：关于儿童转向的文章＆＃34;自闭症＆＃34;拍摄后由作者销售书籍，销售广告的网站以及销售治疗的商家。当你＆＃39;在销售对补贴竞争对手的销售治疗的业务时，你的球场需要表情感，必不可少。它需要吸引观众的价值观。由于有一个真正的经济对人们不信任常规医学，因此其演员通过卡车卷发出耸人听闻的恐慌块，这验证了反vaxxers广告的预先存在的焦虑 - 并将它们驱逐出愿意销售的人的怀抱一个解法。\n    回到我的妻子和我只是朋友的时候，我遇见了她的妹妹几次。她是一个非常愉快，完全同意的，自然的善于善人的人。我真的没有理由对她友好的东西。然后我的妻子告诉我，她的妹妹是一个自然病，研究了疫苗和＃34;广泛的疫苗的毒性作用。＆＃34;\n  我的嫂子也是我妻子的重要组成部分。当我的妻子是第二次猜测疫苗 - 当她的女儿＆＃39;父亲在分离后提出了这个问题 - 她转向她的妹妹。她的妹妹甚至更深入地在运动中，她是贸易的替代药物的提供者 - 当他们谈话时，我的妻子更肯定的是反vax worldview。再次：这是一个奇怪的行为。你有多少次想到一些重要的事情，只能通过与亲人的对话来安抚？\n  当然，它与反柬柬者没有独特地狡猾地寻求志同道合的人验证他们的观点;我们都这样做。例如，我喜欢许多报纸和杂志的原因之一是因为他们告诉我我已经考虑了外交政策，城市，女权主义和种族的事情 - 我们都遭受了一定程度的确认偏见。但与更普通的偏见不同，替代医学球拍完全没有选中;根据定义，它估算主流检查其理论和实践。它兑现了鼓励其参与者的孤立和依赖。这是一个环境，其中每一个假设都是相同的重量，所有假设都与某种产品推荐包装。\n  没有盈利产业，反vax信仰可能无法生存漫长。但再一次，我们该怎么办？疫苗接种叙事的整体媒体存在使怀疑论者是一个＆＃34;袭击和被压迫的＆＃34;展望鼓励其成员寻求切割世界观的角落。那些角落然后卖给他们自己的偏见 - 他们变得更加自信，他们＆＃39;重新右转。\n    我决定在揭示Pandemrix，旨在打击猪流感的疫苗后写下这件作品，导致儿童鼻神病。正如Julia Belluz所指出的那样，尽管实际且表现出副作用，但2013年发现几乎没有被媒体覆盖 - 恰恰是这种行为反vaxxers嫌疑人的行为发生了所有疫苗。\n  我留意这样的故事，一个可以允许我的妻子和我讨论非共用术语的疫苗接种。像Pandemrix这样的故事让我诚信地吸引她，承认有时医学会发出不良呼叫，媒体可以是同谋的。我把它带到了我的妻子，表明我关心她的担忧，我认为他们超越了苍白。在缓解某人和＃39;恐惧时，爱情很少 - 需要表情，特别是当你想说服时。拒绝从事任何开放的思想讨论，承认这一切可能会出错，允许它＆＃39;我们不知道一切：那种屈尊屈服于我的妻子和女儿没有更接近疫苗。它有没有争夺更广泛的反vaxxers。 \n在缓解某人时，爱情很少足够了 - 需要表情，特别是在你想说服的时候\n  缺乏个人投资是因为它发生了导致我的妻子的初始拒绝疫苗：她在白青少年时期有一个非常令人满意的MD，而她经历了很多身体和精神上的痛苦。\n  它始于药物引起的精神病崩溃。她在一个破碎的家中长大，缺乏父亲，一个瘾君子的母亲，一个暴力的继父 - 一种毒品容易被忽视的环境。在17岁时，她抽出了一些奇怪的东西，感觉自己非常失去它。幻觉。惊恐发作。恶心和心悸。经过一周的艰苦的一周，她做了正常的事情，并把自己拿到了一名医生。\n  她用处方和一种不可动摇的感觉，这位医生和他的诊所以及为他服务支付的政府，并不关心她的担忧，她的需求和她的恐惧。她是一个可以用几个药片解决的问题。她觉得她理智的恐惧没有尊重，甚至没有考虑过。那种毒品问题的解决方案更具药物。\n    这不是违反可以通过讲述疫苗来恢复的信任。\n  它的明显和痛苦，所有人类系统都会因人类缺陷而在某些地方失败。它可能是不可能强迫所有医生善良和体贴的人。\n  也许我的妻子也会像在那一刻那一刻做的一切都是正确的。但是，了解许多反vaxxers有一个根本原因 - 导致它们滥用医学的东西，然后在反馈回路中结束，加强不信任 - 对推回来至关重要。我认为心灵可以改变，心脏可以赢得，但是我＆＃39; vere达到了我的和平：只有爱，耐心和同理心会导致进入。善待反vaxxers，如果只是因为它＆＃39;当你的对手善良时很难遭受迫害。这是我选择的道路，我很乐意与一个挑战和激励我的人分享我的生活。一个小十年前的人，我会考虑一个危险的疯狂。 \n然后，上周，她的女儿问她今年会拍摄。  ＆＃34;不与您的同学，＆＃34; 我的妻子说。 ＆＃34;但是，它和＃39;时间。 我们＆＃39; ll与我们的新家庭医生预约。＆＃34;  第一人称vox＆＃39;家的引人注目的挑衅性叙事散文。 你有一个分享的故事吗？ 阅读我们的提交指南，并在FirstPerson@vox.com上投球。  数百万人转向Vox，了解新闻中发生的事情。 我们的使命从未比这一刻更重要：通过了解来赋予。 我们读者的财务贡献是支持我们资源密集型工作的关键部分，并帮助我们为所有人提供新闻。 请考虑今天为vox提供贡献，从3美元的价格下降。  解释者与这些侵入性的“疯狂的”蠕虫是什么，为什么我们不能摆脱它们？  查看科学＆amp的所有故事; 健康 ", "note_en": "Skip to main content                                                                                                                Some people, and more people every day, believe this, too: Those who don&#39;t believe in the virtues of vaccines — anti-vaxxers — are ignorant and dangerous lunatics, possibly evil.\n  I spent most of my life believing that. During my early 20s, I lived in the skeptic blogosphere, a mid-2000s constellation of internet communities theoretically organized around highly charismatic bloggers, vloggers, and other intellectuals. In practice, however, these groups were centered on a more basic principle: hostility toward anyone and anything it deemed &#34;irrational.&#34; It was then and is still now a very white, male, and defensive place.\n  It was there that I developed a deep antipathy toward the anti-vaccination movement. It wasn&#39;t that I knew they were wrong about vaccines. It was more than that. I believed myself intellectually and morally superior to those people, and I reinforced that belief each time I left a comment or watched a vlog or republished a snarky article on the subject. I mastered a face, a kind of appalled, disapproving look for any time anybody even broached the subject of vaccine skepticism.\n          I met my wife nine years ago. I wanted to take up swing dancing and decided to take a private class to get over some of my anxiety. She was the teacher who picked up the phone when I called.\n  I was immediately attracted to her, but at the time she was engaged to her dancing partner, the father of her daughter.\n  So at first we built a platonic friendship. We spent time together. We bonded over our mutual interest in dancing. I had known her for more than a year the first time she mentioned that her daughter was not vaccinated.\n  What do you do, then, when someone you believe is both smart and sensible comes to a conclusion you find completely wrong? Does that person stop being smart at that precise moment?\n  My time reading (arrogant) skeptic blogs had convinced me of my moral and intellectual superiority. I believed that  because I was a smart, sensible, and empathetic person I could see the value of vaccines. Yet here this woman was. I knew she wasn&#39;t dumb — in fact, I thought she was very insightful. I knew she wasn&#39;t dangerous or conspiratorial — we had talked for days about how we care about people, and the society we live in, and what it means to be human. I already trusted her.\n  Did I have to completely reassess my opinion of this person? Did I have to examine my own biases and mental caricatures, decide that anti-vaxxers  are people too?\n  Well, no. I did what most people did: opted for cognitive dissonance. I decided it wasn&#39;t worth getting into a fight over, that she could be my friend and have weird opinions about vaccines at the same time. Even as she broke up with her partner, and I broke up with mine, and we found ourselves spending a lot of time together, I ignored the issue. The subject of vaccines came up once or twice over dinners, but so what? I could see she loved and cared deeply for her daughter. She was someone I admired and respected and was beginning to love. Vaccines didn&#39;t get in the way.\n  And, of course, I believed that if we spent enough time together, I&#39;d eventually change her mind.\n      This is the beating heart of any real discussion about anti-vaxxers. It&#39;s impossible to understand their position without considering the amount of fear that goes into the anti-vaccine narrative, and considering how people construct and deal with fear.\n    Now, you might think that a fear is a fear and public health is something else — and you might be right. That&#39;s the rational point of view. But then, how rational are your own fears?\n  Maybe you&#39;re afraid of heights. Maybe it&#39;s spiders. In either case, you&#39;re lucky: Coping with your fear the way most people do — avoidance — doesn&#39;t come at a cost to others. But vaccines only work when everyone buys in. Public health depends on anti-vaxxers confronting their greatest fears for the benefit of others.\n  For people who don&#39;t share their fear, it&#39;s very easy and convenient to demand that anti-vaxxers just suck it up and take the shot. I wish they would, too. But we&#39;ll never get there by bullying them, by insulting and demeaning them and refusing to take the fact of their fear seriously, even if there isn&#39;t much that&#39;s serious in its content.\n  That&#39;s hard to do. Have you ever tried to stare a loved one into the eye and tell her you are going to put her child in danger?\n  Despite initially avoiding the subject, I decided, after we were married, that I should convince my wife to vaccinate her daughter. Vaccines are good, after all. Vaccines are safe. Measles outbreaks had been on the news — what better time to raise the subject?\n  But when I did, I realized that from her perspective, all of my confrontational reasoning sounded like me asking to point a gun at her daughter and have her trust that it was full of blanks. Looking into her eyes, I realized her trust in me was threatened. She asked why I would do that to a child. All of my insistence that vaccines are safe didn&#39;t matter. Go tell arachnophobic parents that you must put spiders on their child because society depends on it, and see how that goes. The benefits of getting the shot, expressed in the abstract, simply could not overpower the immediate, disarming fear.\n  So I backed down. The anti-vax position was not a deal breaker for me, but suggesting that we should expose her daughter to grave dangers for no good reason was a deal breaker for my wife. I loved my wife. I had no desire to end things. Yes, I think it was very important for her daughter to receive vaccines — but it&#39;s not as if my wife would have changed her mind over a breakup fight.\n  I backed down and resolved to have that conversation in less confrontational terms when the opportunity arose.\n    My wife is one of the smartest, most sensible people I know. So what do smart, sensible people do when they perceive a threat? They do the smart, sensible thing: take precautions and warn others.\n    Again, it&#39;s easy to dismiss the worries of anti-vaxxers as irrational and chalk up their activism to paranoid behavior, but this misses a crucial point: The reasoning, once you accept the big, unsubstantiated premise, is valid. It isn&#39;t even  that far-fetched, if you don&#39;t think about it too hard: There are some heartbreaking precedents that feed this logic. Lead paint, tobacco, bloodletting — every time we feel the urge to reply, &#34;But vaccines are safe, everyone knows that,&#34; we ought to remember that the same sentence has been said, earnestly and confidently, about things that absolutely were hazardous.\n  Go tell arachnophobic parents that you must put spiders on their child because society depends on it, and see how that goes\n  If you&#39;ve come to believe that vaccines are dangerous, then anti-vax behavior follows almost rationally. If we want to reach these people, dismissing their logic as ridiculous or fringe is the worst strategy. It plays right into the anti-vaccination narrative: that they are the &#34;only sane ones,&#34; warning the careless masses about a very real and hidden danger.\n  My wife (and her family) sincerely believes that though her worries are being recognized as irrational, they aren&#39;t. It&#39;s easy to imagine how the very first person to notice the dangers of something ubiquitous, like lead, was dismissed by her peers as irrationally afraid — and to imagine you might be one of these people. The first anti-lead folks were called cranks — until they were proven right.\n  My point isn&#39;t that the anti-vaxxers might be right. They&#39;re not. My point is that once you believe something untrue, it&#39;s very easy to keep rationalizing that belief. It&#39;s very easy to dismiss your critics as shortsighted. And when you&#39;re constantly attacked, it&#39;s natural to make your resilience part of your identity, to become even more committed to maintaining it.\n  People are not essays, where you can go back to a previous paragraph and undermine the priors through careful, unperturbed dissection. People talk, and people balk. My wife would not stand to have me pick her apart like she is a problem that needs to be solved; her priors — like everyone else&#39;s — are part of her identity. All of us have beliefs of this sort; it&#39;s just that most of us can get away with them more easily. We need to stop seeing anti-vaxxers as people who can be persuaded to abandon a bad idea, and instead as people we&#39;re asking to abandon a part of themselves — people whose defensive sense of identity we&#39;ve encouraged with bad tactics.\n      A sense of identity isn&#39;t the only thing that makes anti-vaxxers impervious to confrontational argument. If you take a deeply controversial position, especially in the beginning, you won&#39;t last long without a strong support system. Unfortunately, fear sells — and there&#39;s always someone willing to give you that support for a price.\n  Evidently, people who don&#39;t trust or value conventional medicine still get sick. In Canada, where I live, socialized health care covers almost all conventional health-care costs, but there is a serious private market for people who would rather get their treatments from alternative sources. These alternative sources  can do some good: Sick people need care, and some amount of care is usually better than no care at all. But the alternative health industry is also a business, and at its worst, this is how the business works:  Articles about children turning &#34;autistic&#34; after a shot are circulated by authors selling books, websites selling ads, and merchants selling cures. When you&#39;re in the business of selling treatments against a subsidized competitor, your pitch needs to be emotive, essential. It needs to appeal to the values of your audience. Since there is a real economy hinging on people not trusting conventional medicine, its actors churn out sensationalist scare pieces by the truckload, which validates the preexisting anxieties of anti-vaxxers ad nauseam — and drive them into the arms of the people willing to sell them a solution.\n    Back when my wife and I were just friends, I met her sister a couple of times. She is a very pleasant, completely agreeable, and naturally sociable person. I really had no reason to be anything less than friendly to her. Then my wife told me that her sister is a naturopath who studied the toxic effects of vaccines &#34;extensively.&#34;\n  My sister-in-law is also a big part of my wife&#39;s support network. When my wife is second-guessing herself about vaccines — like when her daughter&#39;s father raised the issue after their separation — she turns to her sister. Her sister is even deeper in the movement that she is — she&#39;s a provider of alternative medicines by trade — and when they talk, my wife comes away more sure of the anti-vax worldview. Again: This isn&#39;t a strange behavior. How many times have you wondered about something important, only to be reassured by a conversation with a loved one?\n  Of course, it&#39;s not uniquely devious for anti-vaxxers to seek like-minded people to validate their views; we all do it. One of the reasons I like many of the newspapers and magazines I like, for instance, is because they tell me things I already think about foreign policy, urbanism, feminism, and race — we all suffer from confirmation bias to some extent. But unlike more ordinary biases, the alternative medicine racket is completely unchecked; by definition, it eschews mainstream checks on its theories and practices. It cashes in on encouraging the isolation and dependence of its participants. This is an environment in which every hypothesis is given equal weight, and all of them come packaged with some kind of product recommendation.\n  Without a profitable industry, anti-vax beliefs might not survive long. But again, what do we do? The monolithic media presence of the vaccination narrative gives skeptics an &#34;assaulted and oppressed&#34; outlook that encourages its members to seek out corners that coddle their worldviews. Those corners then sell them back their own biases — and they become even more confident that they&#39;re right.\n    I decided to write this piece after it was revealed that Pandemrix, a vaccine designed to combat swine flu, was causing narcolepsy in children. As Julia Belluz pointed out  on this site, the 2013 discovery was hardly covered by the media despite real and demonstrated side effects — precisely the kind of behavior anti-vaxxers suspect is happening with all vaccines.\n  I keep an eye out for stories like this, one that could allow my wife and me to discuss vaccination in nonconfrontational terms. A story like Pandemrix allowed me to engage her in good faith, to admit that sometimes medicine makes bad calls and that the media can be complicit. I brought it up to my wife to show that I care about her worries, that I don&#39;t think they are beyond the pale. When easing somebody&#39;s fears, love is rarely enough — empathy is needed, especially when you want to persuade. Refusing to engage in any open-minded discussion, to concede that things can go wrong, to admit that it&#39;s possible we don&#39;t know everything: That kind of condescension had gotten me nowhere with my wife and her daughter no closer to vaccinations. It hasn&#39;t gotten the broader fight against anti-vaxxers very far either.\n  When easing somebody&#39;s fears, love is rarely enough — empathy is needed, especially when you want to persuade\n  A lack of personal investment is, as it happens, what led to my wife&#39;s initial rejection of vaccines: She had a very unfortunate run-in with a complacent MD in her late teens, while she was going through a lot of pain physically and mentally.\n  It started with a drug-induced psychotic breakdown. She grew up in something of a broken home, with an absent father, an addict mother, and a violent stepfather — an environment where drugs were easy to come by and hard to ignore. At 17, she smoked something weird and felt herself quite literally losing it. Hallucinations. Panic attacks. Nausea and heart palpitations. After a grueling week of recovering from the episode, she did the normal thing and took herself to a doctor.\n  She got out with a prescription and an unshakable feeling that this doctor, and his clinic, and the government that paid for his services, did not care at all about her concerns, her needs, and her fears. That she was a problem that could be solved with a couple of pills. That the fear she had felt for her sanity was not respected, not even considered. That the solution to her drug problem was  more drugs.\n    This is not a breach of trust that can be restored by telling her vaccines are safe.\n  It&#39;s obvious and painful that all human systems are going to fail at some places due to human imperfection. It&#39;s probably impossible to force all doctors to be nice and considerate people.\n  Maybe my wife would have felt just as abandoned even if the doctor did everything right at that moment. But knowing that for many anti-vaxxers there is a root cause — something that led them to mistrust medicine and then wind up in a feedback loop that reinforced that mistrust — is vital to pushing back. I do think minds can be changed and hearts can be won, but I&#39;ve made my peace: Only love, patience, and empathy will make inroads. Treat anti-vaxxers kindly, if only because it&#39;s pretty hard to feel persecuted when your adversaries are being kind. This is the road I chose, and I am happy to share my life with a person who challenges and inspires me. Someone whom, a mere decade ago, I would have considered a dangerous lunatic.\n  And then, last week, her daughter asked if she would be getting shots this year.\n  &#34;Not with your classmates,&#34; my wife said. &#34;But yes, it&#39;s time. We&#39;ll schedule an appointment with our new family doctor.&#34;\n        First Person is Vox&#39;s home for compelling, provocative narrative essays. Do you have a story to share? Read our  submission guidelines, and pitch us at  firstperson@vox.com.\n     Millions turn to Vox to understand what’s happening in the news. Our mission has never been more vital than it is in this moment: to empower through understanding. Financial contributions from our readers are a critical part of supporting our resource-intensive work and help us keep our journalism free for all.  Please consider making a contribution to Vox today from as little as $3.\n Explainers   What’s with these invasive “crazy” worms and why can’t we get rid of them?\n  View all stories in Science &amp; Health", "posttime": "2021-06-19 15:30:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "vaxxers,anti,疫苗", "title": "我以为所有的反vaxxers都是白痴。 然后我结婚了。 （2015） ", "title_en": "I thought all anti-vaxxers were idiots. Then I married one. (2015)", "transed": 1, "url": "https://www.vox.com/2015/9/4/9252489/anti-vaxx-wife", "via": "", "real_tags": ["vaxxers", "anti", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "259e4637ca0f08999c463b038ce85400.jpg", "infoid": 1066846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃因霍温技术大学，高科技校园埃因霍温，以及像ASML和飞利浦这样的本地企业一直在欧洲的举措，并申请他们学会了到该地区的战略。飞利浦于1891年在埃因霍温推出，并在市政野心成为技术中心的雄心壮志中发挥了不小部分。\n 考虑到其小人口，埃因霍温每年生产大量专利，并已成为过多数量的硬件初创公司。例如，本地高科技校园具有高硬件焦点。\n  我们的调查受访者认为这座城市在光子，机器人，医疗器械，材料科学，深度技术，汽车技术，可持续发展技术，Medtech，大数据，硬件和精密工程等领域。他们正在寻找更多成熟的初创公司和扩展，专注于AI和Hard Tech。\n 埃因霍温被认为是金融气和消费品的较弱，并且存在于全球知名度有限的小区域。\n 在未来五年内，一位受访者表示，“埃因霍温将向荷兰的第二大科技生态系统落后于阿姆斯特丹。在欧洲规模上，埃因霍温将进入前十名。“\n     什么行业部门是您的科技生态系统强大？你最兴奋的是什么？什么是弱者？\n    科技投资者是什么样的？你城市的投资场景是什么？他们的焦点是什么？ \n谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？  什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  高科技系统和材料，真正的高科技和深度技术的东西，要么导致科学突破或转向公司的科学突破。 光刻对此以及医疗设备和生产技术作出了重大贡献。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  五年后，你在哪里看到你的城市的科技场景？ \n什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  优点是高科技系统，协作文化和优秀的创业生态系统; 缺点是，它是全球知名度有限的小区域。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  其他人会搬进去！ 住房非常昂贵，但对熟练员工的需求非常高。 如果人们搬到周边地区，30公里内，房价飙升全面。  谁是您所在城市的主要启动人员（例如，投资者，创始人，律师，设计师等）？\\  五年后，你在哪里看到你的城市的科技场景？ \n全球领先地位在几个技术领域，主要是高精度，轧辊加工原子层沉积，物料搬运，工业4.0，硅加工设备。\n  什么行业部门是您的科技生态系统强大？你最兴奋的是什么？什么是弱者？\n 该地区深入技术，汽车技术，可持续发展技术，Medtech，大数据，硬件和精密工程。最兴奋的可持续发展技术和深度技术。该地区在金融气中很弱。\n   科技投资者是什么样的？你城市的投资场景是什么？他们的焦点是什么？\n 保守，非风险 - 采取措施 - 有这么多的补贴，他们不需要冒险，所以一旦科技风险消失了，他们就是好的，但它们并不是全球化的;硬件。\n 随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？\n 硬件是实践 - 人们还在搬进去！我们有一个住房“危机！” \n谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？  什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？ \n什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  该地区深度技术和健康状况很强。 我对不同公司之间的合作机会感到兴奋。 它在种子投资中很弱。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  他们会留下来; 从家里工作有一些好处，但在鼓舞人心的环境中会面的人会带来最好的协同作用。  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？ \n什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  该地区在建立可持续发展和有弹性的城市和城市/社会和技术市场之间的平台方面很强。  数字工具箱（Serendipity Spinoff），琥珀（移动性），Active Esports Arena和Lumo Labs的其他投资组合公司。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  通过LUMO实验室，重点是社会投资; 其余的是由于大行业（VDLK，ASML，恩智浦，菲利普斯）的高科技投资。  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？ \n埃因霍温科技大学和大公司支持的加速器（Lumo Labs，Hightechxl，Braventure）和Brainport（生态系统管理）的组合。  五年后，你在哪里看到你的城市的科技场景？  领导世界各社会/全身变化 - 从高科技迈向影响（更多软件和数字化）。  什么行业部门是您的科技生态系统强大？ 你最兴奋的是什么？ 什么是弱者？  它在高科技设备，硬件，光子，添加剂制造，照明，电子，半导体技术和健康技术方面强大，消费产品和应用程序疲软。  科技投资者是什么样的？ 你城市的投资场景是什么？ 他们的焦点是什么？  随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？ \n他们会留下来。埃因霍温是一个热点，具有许多文化，国际科技界和基础设施伟大的基础设施，而感觉像一个村庄。\n 谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？\n  五年后，你在哪里看到你的城市的科技场景？\n   什么行业部门是您的科技生态系统强大？你最兴奋的是什么？什么是弱者？\n 埃因霍温生态系统在流动性，智能城市和能源的部门中非常强大。我对聪明的城市非常兴奋。这是我们的焦点部门，它是与影响解决方案的生态系统合作的体现。\n   科技投资者是什么样的？你城市的投资场景是什么？他们的焦点是什么？\n 投资场景越来越好。他们越来越意识到深度技术需要时间，需要培养，但潜在的影响是巨大的，对整个生态系统产生巨大影响。仍有相对较少的早期影响驱动器投资者。 Lumo Labs正在领先地前面的包装。 \n随着在Covid-19大流行期间的遥控工作的转变，人们会留在你的城市，搬出或别人搬进去吗？  我认为更多的人将留在荷兰的技术中心减少到阿姆斯特丹的必要性，使埃因霍温引起了加强其自身的生态系统，这反过来又会让更多人留下来吸引人们在城市搬迁。 因此，Covid-19将对Eindhoven的科技生态系统产生积极影响，我相信。  谁是您所在城市的主要初创人（例如，投资者，创始人，律师，设计师等）？  五年后，你在哪里看到你的城市的科技场景？  五年来，我认为埃因霍温将发展到荷兰的第二大科技生态系统，落后于阿姆斯特丹。 在欧洲规模上，埃因霍温将进入前10名。 ", "note_en": "The Technical University of Eindhoven, High Tech Campus Eindhoven, and locally based corporates like ASML and Philips have been eyeing initiatives across Europe and applying what they’ve learned to the region’s strategy. Philips launched in Eindhoven in 1891 and played no small part in the municipality’s ambitions to become a tech hub.\n Eindhoven produces a high number of patents per year considering its small population and has been home to an inordinate number of hardware startups. The local High Tech Campus has a high hardware focus, for instance.\n  Our survey respondents consider the city strong in areas like photonics, robotics, medical devices, materials science, deep tech, automotive tech, sustainability tech, medtech, Big Data, hardware and precision engineering. They are looking for more mature startups and scaleups focused on AI and hard tech.\n Eindhoven is considered weaker in fintech and consumer products, and it exists in a small region with limited global visibility.\n Over the next five years, one respondent said, “Eindhoven will have evolved to the Netherlands’ second-largest tech ecosystem, behind Amsterdam. On a European scale, Eindhoven will have entered the top 10.”\n     What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n    What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n High-tech systems and materials, the real high-tech and deep tech stuff that either leads to scientific breakthroughs or turns scientific breakthroughs into companies. Lithography makes a major contribution to that, as well as medical devices and production technologies.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The pros are high-tech systems, collaboration culture and excellent startup ecosystem; The cons are that it’s a small region with limited visibility globally.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n Others will move in! Housing is extremely expensive but the demand for a skilled workforce is extremely high. If people move to surrounding areas, within 30 km, housing prices skyrocket all over.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\\\n  Where do you see your city’s tech scene in five years’ time?\n Leading worldwide in several technology areas, mainly, high-precision, roll-to-roll processing atomic layer deposition, material handling, industry 4.0, silicon processing equipment.\n  What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The region is strong in deep tech, automotive tech, sustainability tech, medtech, Big Data, hardware and precision engineering. Most excited by sustainability tech and deep tech. The region is weak in fintech.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n Conservative, non-risk-taking — there are so many subsidies they don’t need to take risks, so once the tech risk is gone, they are good, but they are not global enough; hardware.\n With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n Hardware is hands-on — people are still moving in! We have a housing “crisis!”\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n    What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n  Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The region is strong in deep tech and health. I’m excited about opportunities for cooperation between different companies. It’s weak in seed investment.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n They will stay; working from home has some benefits but meeting people in an inspiring environment gives the best synergy.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The region is strong in building sustainable and resilient cities and a platform between cities/society and tech market.\n  Digital Toolbox (a Serendipity spinoff), Amber (mobility), Active Esports Arena and other portfolio companies of LUMO Labs.\n What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n Through LUMO Labs, there is a focus on societal investments; the rest is investment in high tech due to the big industries (VDLK, ASML, NXP, Phillips).\n With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n  Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n A combination of accelerators (LUMO Labs, HighTechXL, Braventure) and Brainport (ecosystem management) supported by the Eindhoven University of Technology and big corporates.\n Where do you see your city’s tech scene in five years’ time?\n Leading in the world on societal/systemic change — moving from high-tech toward impact (more software and digitization).\n  What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n It’s strong in high-tech equipment, hardware, photonics, additive manufacturing, lighting, electronics, semiconductor technology and health tech, and weak in consumer products and apps.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n  With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n They will stay. Eindhoven is a hot spot with many cultures, international tech community and great infrastructure, while it feels like a village.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n   What industry sectors is your tech ecosystem strong in? What are you most excited by? What is it weak in?\n The Eindhoven ecosystem is really strong in the sectors of mobility, smart city and energy. I’m most excited about smart city. This is our focus sector and it is the embodiment of ecosystem collaboration with impact solutions.\n   What are the tech investors like? What is the investment scene like in your city? What’s their focus?\n The investment scene is getting better. They are increasingly realizing that deep tech takes time and needs to be nurtured, but the potential impact is massive and can have a dramatic effect on the entire ecosystem. There are still relatively few early-stage impact drive investors. LUMO Labs is leading the pack on that front.\n With the shift to remote working during the COVID-19 pandemic, will people stay in your city, move out or will others move in?\n I think more people will stay as the need to move to Amsterdam as the tech hub of the Netherlands diminishes, giving Eindhoven a boost to strengthen its own ecosystem, which will in turn make even more people stay and attract people to move in the city. As a result, COVID-19 will have a positive effect on Eindhoven’s tech ecosystem, I believe.\n Who are the key startup people in your city (e.g., investors, founders, lawyers, designers, etc.)?\n  Where do you see your city’s tech scene in five years’ time?\n In five years, I believe Eindhoven will have evolved to Netherlands’ second-largest tech ecosystem, behind Amsterdam. On a European scale, Eindhoven will have entered the top 10.", "posttime": "2021-06-19 14:54:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "表示,eindhoven,技术", "title": "投资者表示，埃因霍温将成为荷兰的2号技术中心 ", "title_en": "\n\t\t\t\tInvestors say Eindhoven poised to become Netherlands’ No. 2 tech hub\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/18/investors-say-eindhoven-poised-to-become-netherlands-no-2-tech-hub/", "via": "", "real_tags": ["表示", "eindhoven", "技术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们推出这个时\r 页面在1996年，有很多网站的特色电视故障，\r 但从那时起，每个汤姆迪克和哈利都推出了自己的页面。即便是\r 英国广播公司已经进入了这一行为，随着他们的崇拜推出\r 电视节。我们希望是最好的，所以MHP与之合作\r 电视室，现在乘坐身份区内容。\n  原始标识区域\r 内容将留在这里，但没有更新。请访问\r 英国电视演示报道的全面目录的电视室。\n        每章都致力于\r 特定的电视图形，象征，符号或徽标。随着时间的推移，\r 我们希望它将建立成为电视的最终信息来源\r 图形。部分部分由MHP以外的网站托管。不要＆＃39; t\r 担心 - 他们都非常好，希望他们都包含一个链接。\r 如果您想了解更多关于a的信息，我们还会提出一些推荐的链接\r 具体主题。\n  如果您可以帮助纠正任何一个\r 事实，提供任何日期，或者建议缺少什么＆＃39;即使你没有\r 副本），然后请联系。加入MHP-Chat\r 并讨论与同事的主题。\n    \n        如果您喜欢此功能，您可能会喜欢\r加入与MHP聊天讨论此网站涵盖的主题的同事爱好者 ", "note_en": "When we launched this \r page in 1996, there were very few websites which featured television idents, \r but since then every Tom Dick and Harry has launched their own page. Even the \r BBC have got in on the act, with the launch of their  Cult \r TV section. We want to be the best, so MHP has teamed up with  The \r TV Room, who have now taken on board the Ident Zone content.\n  The original Ident Zone \r content will remain here, but is not being updated. Please do visit  The \r TV Room for the comprehensive catalogue of UK Television Presentation idents.\n        Each chapter is dedicated to \r a particular breed of television graphics, idents, symbols or logos. Over time, \r we hope it will build to become the definitive source of information on television \r graphics. Some of the sections are hosted by web sites other than the MHP. Don&#39;t \r worry - they are all very good and hopefully they all contain a link back here. \r We have also put some recommended links if you want to find out more about a \r particular topic.\n  If you can help correct any of \r the facts, supply any dates, or suggest what&#39;s missing (even if you don&#39;t have \r a copy), then please get in touch. Join  mhp-chat \r and discuss the subject with fellow enthusiasts.\n    \n        If you enjoyed this feature, you might like to\rjoin fellow enthusiasts who discuss the subjects covered by this web site on  mhp-chat", "posttime": "2021-06-19 14:47:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电视,zone", "title": "ident区 - 通过年龄的电视图形（2000） ", "title_en": "The Ident Zone – Television Graphics Through the Ages (2000)", "transed": 1, "url": "http://www.meldrum.co.uk/mhp/identzone/index.html", "via": "", "real_tags": ["电视", "zone"]}, {"category": "", "categoryclass": "", "imagename": "a5a7d525b1a0334079e70c48f9f21b0a.jpg", "infoid": 1066844, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "具有索赔国际名声的最不寻常的当地网站之一是伍德德德。它是由布莱顿的监护人更加成本削减练习的1858年，而不是打破世界纪录的尝试，但它确实突破了一个纪录，仍然是世界上最深的“手挖”。\n 计划在1858年的新工作室重新开始，计划在目前Elm Grove的顶部建立一个新的工作室，并在沃伦农场距离少年2英里的少年工业学院添加到它。学校的目的是教导小镇的错位青年“行业的习惯”，并从“贫民祸害”中解脱出来。\n 然而，泵送水的费用，从当地的水上供应泵送水，然后在Lewes Road（现在的桑德斯公园）的角落被认为是禁止的，因此监护人决定他们将为两个属性构建一个井从Dyke Road Wouchhouse劳动中增加劳动力的劳动力。在他们看来，为更贫困的贫民，年轻或旧的，无论是性别的，有条件的穷人建设的一个方面都会减轻劳动力的一个方面，这将减少劳动力成本，并对考虑申请申请工作时，对任何人间接增加进一步威慑力宽松糟糕。\n 最初的计划不是成功的初始计划是将一个6英尺宽，砖衬里轴下降约400英尺到地下水位。所有的土壤挖出将放在铲斗中，手绞合到轴顶部的平台，在那里可以处理它。经过2年的挖掘后，轴仅达到约438英尺的深度，但没有发现水。担心他们刚错过了这项供应，承包商给了一个横向室的指示北向北驶过30英尺，但这也没有任何东西。进一步的横向隧道是向西和向东推动的，但它们都没有成功。未能承认失败，监护人在东部隧道尽头制定了另外4英尺宽轴的结构。\n 每天24小时挖掘24小时的工作持续了几年，男子每天24小时工作，只是蜡烛灯在令人震惊的条件下。许多人拆除了他们的衣服，赤身裸体工作，范围内的4英尺的男子队伍的范围不得不挖掘，装配桶和砖块。 Winchmen站在微小的平台上切成轴的一侧，随着轴继续向下延伸而使破坏和砖块下来。一个绞车实际上陷入了他的死亡。\n 升级成本导致地面的关注受到监护人开始争夺费用，对于伍德德德井现在正在降低当地的比率Payer，每周约90英镑，关于它的竞赛常见。有些人说该镇正在建造一个替代路线到左侧，而其他小镇则将整个东西描述为“一个伟大的钻孔”！\n 最后一次突破于1862年3月16日星期日晚上的变化，瓦工注意到他站立的地球薄的地壳正在像巨型活塞一样慢慢推动。争先着每个绞车的平台，他和其他人快速腾出了井。这一定是井现在已经沉没到这么令人惊叹的深度的艰难任务，他们的成功出口花了约45分钟。突然用咆哮，活塞头碎了碎，铲斗和梯子淹没了轴。最后发现了水。它已经采取了4年的劳动力劳动力，包括许多布赖顿派斯，手工挖掘轴约1285英尺（其中850英尺，在海平面低于海平面）而没有机器。 \n一个令人难以置信的成就，使这种令人难以置信的成就，距离和危险进入视角，我可以想到没有比P Mercer＆amp中使用的更大的比喻; D荷兰的“亨纽斯坑”，我用自己的插图解释了。 伍德德德井的深度进入地球的深度大于帝国大厦的高度。 想象一下，在每天两次，使用一系列摇摇欲坠的梯子在黑暗中攀登攀登，并在你和你的同事下面的水淹没了恐慌状态。  我同意我的姓名和电子邮件地址与此评论一起存储，并通过关于必要的电子邮件与我通信的网站编辑。 我的名字可以与网站的评论一起发布，但我的电子邮件地址不会发布。 我的信息不会与任何第三方共享（请参阅我们的隐私声明 - 在新窗口中打开）。 * ", "note_en": "One of the more unusual local sites with a claim to international fame is the Woodingdean Well. It was started in 1858 by Brighton’s Guardians more as a cost cutting exercise, than as an attempt to break a world record, but it did break a record and still remains as the deepest “HAND DUG” well in the world.\n Plans for a new workhouse  Back in 1858, plans were in hand to build a new workhouse at the top of what is now  Elm Grove and to add to it an industrial school for juveniles some 2 miles away at Warren Farm. The aim of the school would be to teach the misplaced youth of the town “the habits of industry” and relieve them from “the bane of pauperism.”\n The expense of pumped water  However, the expense of having pumped water supplied from the local waterworks, then on the corner of  Lewes Road (now Saunders Park) was considered prohibitive, so the Guardians decided that they would construct a single well for both properties and augment the workforce with labour from the  Dyke Road Workhouse. In their opinion, making relief for the more able pauper, young or old and regardless of gender, conditional on some of the destitute undertaking an aspect of the well’s construction would reduce labour costs and indirectly add a further deterrent to anyone considering applying to the workhouse for poor relief.\n The initial plans were not successful  initial plan was to sink a 6 ft wide, brick lined shaft down some 400 feet to the subterranean water table. All the soil dug out would be placed in buckets and hand winched to a platform at the top of the shaft where it could be disposed of. After 2 years of digging, the shaft had only reached a depth of some 438 feet, but no water had been found. Fearing that they had just missed the supply, the contractor gave instructions for a lateral chamber to be driven some 30 ft northwards, but this too yeilded nothing. Further lateral tunnels were driven westwards and eastwards, but none of them were successful. Failing to acknowledge defeat, the Guardians sanctioned the construction of a further 4 ft wide shaft at the end of the eastern tunnel.\n Digging done for 24 hours a day  Work continued for several more years with men working 24 hours a day just by candle light in appalling conditions. Many removed their clothes and worked naked for within the confines of a 4 ft circle teams of men had to dig, load buckets and lay bricks. Winchmen stood on tiny platforms cut into the side of the shaft, passing spoil up and bricks down as the shaft continued forever downwards. One winchman actually plunged to his death.\n Escalating costs caused concern  Above ground the Guardians began to bicker about the expense, for the Woodingdean Well was now costing the local ratepayer some £90 a week and jests about it were frequent. Some said the town was constructing an alternative route to the Antipodes, whereas others described the whole thing as “a great bore”!\n The final break through  At the change of the evening shifts on Sunday 16th March 1862, the bricklayer noticed that the thin crust of earth he was standing on was being slowly pushed upwards like a giant piston. Scrambling up the numerous ladders to each winchman’s platform, he and the others quickly vacated the shaft. It must have been a difficult task for the well had now been sunk to such an amazing depth their successful exit took some 45 minutes. Suddenly with a roar, the piston head crumbled and tools, buckets and ladders flooded up the shaft. Water had at last been found. It had taken over 4 years backbreaking work for a labour force which included many Brighton paupers, to hand dig a shaft some 1285 feet deep (850 of which were below sea level) without the aid of machines.\n An incredible achievement  To put this incredible achievement, distance and the danger into perspective, I can think of no greater analogy than that used in P Mercer &amp; D Holland’s “Hunns Mere Pit” which I have interpreted using my own illustration. The Woodingdean Well’s depth into the earth was greater than the height of the Empire State Building. Imagine climbing that building in darkness on a twice daily basis, using just a series of rickety ladders, let alone in a panic situation with water flooding up beneath you and your colleagues!\n  I consent to my name and e-mail address being stored along with this comment, and to the website editors communicating with me by e-mail about the comment if necessary. My name may be published alongside the comment on the website, but my e-mail address will not be published. My information will not be shared with any third party (see our  Privacy Statement - opens in a new window).  *", "posttime": "2021-06-19 14:47:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "在世界上,hand", "title": "最深的手在世界上挖井 ", "title_en": "Deepest Hand Dug Well in the World", "transed": 1, "url": "https://www.mybrightonandhove.org.uk/places/utilities/woodingdean-well/woodingdean-well", "via": "", "real_tags": ["在世界上", "hand"]}, {"category": "", "categoryclass": "", "imagename": "b2954f158a2afc09ff84567f354259a1.jpg", "infoid": 1066843, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MCLean，基于弗吉尼亚州Booz Allen Hamilton，已经是D.C.地区最大的IT承包商，已完成7.25亿美元的基于Herndon的自由IT解决方案收购。  该公司拥有大约600名员工。 除了埃尔纽隆总部，它还拥有埃斯诺伊州埃斯塔尼亚和墨尔本，佛罗里达州的业务。 其工作包括政府机构和医疗保健行业的现代化项目，包括退伍军人事务部。  Liberty IT解决方案在其现代化工作中具有超过20亿美元的积压。 Booz Allen表示，收购将立即增加收入增长和收益。  Booz Allen在本月早些时候的现金组合和5亿美元债务提供的收益。  Booz Allen拥有超过14,000个D.C.区域员工，近28,000个全球。 2020年收入的79亿美元，几乎所有来自政府承包销售的收入。 ", "note_en": "McLean, Virginia-based  Booz Allen Hamilton, already the largest government IT contractor in the D.C. region, has completed its acquisition of Herndon-based  Liberty IT Solutions for $725 million.\n  The company has about 600 employees. In addition to its Herndon headquarters, it has operations in Exton, Pennsylvania, and Melbourne, Florida. Its work includes IT modernization projects for government agencies and the health care industry, including the Department of Veterans Affairs.\n  Liberty IT Solutions has a backlog of more than $2 billion in IT modernization work. Booz Allen says the acquisition will immediately increase revenue growth and earnings.\n Booz Allen paid for the acquisition with a combination of cash and from proceeds of a $500 million debt offering earlier this month.\n Booz Allen has more than 14,000 D.C.-area employees and almost 28,000 worldwide. It had $7.9 billion in 2020 revenue, almost of all which came from government contracting sales.", "posttime": "2021-06-19 14:05:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "liberty,allen", "title": "Booz Allen Hamilton以725米的价格获得Liberty IT解决方案; Liberty它的工作包括GOVT的现代化项目。 机构和医疗保健行业 ", "title_en": "Booz Allen Hamilton acquires Liberty IT Solutions for $725M; Liberty IT's work includes IT modernization projects for govt. agencies and the healthcare industry", "transed": 1, "url": "https://wtop.com/business-finance/2021/06/booz-allen-closes-on-725m-acquisition-of-herndon-it-contractor/", "via": "", "real_tags": ["liberty", "allen"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此站点需要要启用的cookie才能运行。 请确保cookie已打开，然后重新访问所需的页面。 ", "note_en": "This site requires Cookies to be enabled to function. Please ensure Cookies are  turned on and then re-visit the desired page.", "posttime": "2021-06-19 14:05:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,伊维,effect,cookie", "title": "高剂量伊维菌素在成人与Covid-19中的抗病毒作用 ", "title_en": "Antiviral effect of high-dose ivermectin in adults with Covid-19", "transed": 1, "url": "https://www.thelancet.com/journals/eclinm/article/PIIS2589-5370(21)00239-X/fulltext", "via": "", "real_tags": ["病毒", "伊维", "effect", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "9f8a6569228527d4ce156f92345a5136.jpg", "infoid": 1066841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大多数毕业咨询 - 是否在危机的繁荣时期或时刻 - 描绘未来用未经搞砸的地面和无穷无尽的未知。如果你从过去看一下开始发表的地址，你会看到一个人的权力人员告诉特权的年轻人相信和草图的未来可能是什么，我们现在可以考虑旁边的现实接下来是什么。 Lapham的季度正在重新审视毕业生和其他人在获取知识或技能的过程中向毕业生和其他人提供建议的历史。\n  教会书是圣经“智慧”书籍之一，属于古老的文学传统，从苏美尔和巴比伦开始，记录圣人的建议。 ECclesistes这个词从希腊ekklesiastes源于希腊ekklesiastes，或者“解决一个装配的人”，这是希伯来语Qohelet（也是koheleth）的粗略翻译，意思是“传教士”或“老师”。 Qohelet是由教会的明显作者在文本中给出的名称。他还声称成为耶路撒冷之王和大卫的儿子。如果这是他真正的父母，Qohelet就是以色列人的第十世纪统治者王于萨洛蒙。犹太人和基督教神学家传统上，通过将特罗蒙斯和谚语，所罗门的其他圣经着作之间放置在旧约中的歌曲之间的歌曲和谚语。然而，文本的亚拉姆语贷款歌曲建议它是在第三世纪组成的，在所罗门的王国分开，耶路撒冷成为亚渊帝国的殖民地之一。\n Qohelet是一个深刻的愤世嫉俗的思想家，也许是因为以色列人的状态减弱。他描述了一个无法保证成功和幸福的世界，在人类贪婪，识别和痛苦面临的情况下，个人在很大程度上是无能为力的。他对读者的建议是接受他们的生活的徒劳，欢迎所有人类行为是“虚荣”或“蒸气”的知识。他建议（也许受到埃基哲学的希腊哲学的影响），最好的行动方案是追求宁静和快乐：\n 因此，用快乐吃你的面包，用快乐的心喝你的葡萄酒。上帝已经批准了你的契约。始终是你的衣服白色，让油不是缺乏你的头部。与你的爱的女人享受生活的生活，所以上帝在太阳下给了你的生活。这是生活中的部分和阳光下的你的辛劳的补偿。无论你能用你的物质所做的，因为没有活动，或监测或知识，没有智慧。 1\n 自第一世纪以来，学者们已经争论了为什么Qohelet对人类生活的悲观冥想被列入圣经中。宾夕法尼亚大学的山茱萸专家莫里斯Jastrow Jr.在他的1919年翻译中指出，“这是一个奇怪的书，陷入了神圣的系列。” Jastrow出现了产生新的Qohelet的词语翻译，相信各个巨大的适应和重新恢复导致不同的工作，而不是创造者的意图;他决心给二十世纪读者一个非常古老的文本的新印象：\n 在新的服装中提出Qohelet，减去附加到原始组合物的装饰，我希望能够在旧约的任何一系列翻译中阅读它比读它更容易理解的文学制作，所有这些都以1611的经典“授权”版本为模型，并且所有这些都认为本书是其现状的文学单位。换句话说，我试图将读者置于原始形式的Qohelet书，如目前可能的那样。\n 来自William Shakespeare的作家到伊迪丝沃顿省沃特顿有易怒的Qohelet的话语，Leo Tolstoy在一个忏悔的中期危机中转向牧师，写出他的疑惑，他的疑惑开始了一个人的疑虑：“我是什么意思是什么意思。在这几句话中，整个问题都在于整个问题。“ \n他的所有辛劳的人有什么东西，他在阳光下辛劳？一代来，一代去，但地球仍然是永恒的。太阳升起和太阳落山，他回来的冉冉升起的地方。在南方和北部圈出来，周围和周围的风，以及风返回的电路。所有溪流都流入大海，但大海并不满。到溪流流动的地方，从那里流出。一切都疲惫不堪，超越人类的话语，超越视野和听证会。是什么意思;发生了什么，这将发生这种情况，因此在阳光下没有任何新的东西。\n 如果发生某些事情，其中​​一个人说：“看到，这是我们之前的新” - 它已经发生了。未记录以前的事件，稍后的发生也不会被迄今为止的年龄记住。\n 我，Qohelet是耶路撒冷的以色列国王，我申请了我的思想，寻求和探索太阳下的一切 - 一个遗憾的业务，上帝给予男人的孩子们的痛苦。我看到所有发生在太阳下面的一切 - 并且在风之后都是虚荣的。\n 现在我想自己，我已经变得伟大，比任何在耶路撒冷统治的人都多得多。我的思绪非常智慧和知识。所以我出发了体验轻浮和愚蠢，尽管我也知道这也是在风之后追逐。我对自己说，来吧，我会对快乐进行考验，并且有一个美好的时光，但唉！这也表明是虚荣的。体育运动，我被告知得出结论，它是疯狂，而且快乐 - 它的成就是什么！我决定用葡萄酒刺激我的身体并追求愚蠢，以确定这对男人的孩子来说是度过他们的生活的好方法。\n 我进行了伟大的作品。我获得了房屋;我种植了葡萄园;我制作了花园和公园。我种植了各种各样的果树，我制作了水池，灌溉发芽森林。我购买了奴隶和手工，并拥有家族，除了拥有大量的牛和鸡群，比耶路撒冷面前的任何人都多。我也聚集了银色和金，皇家珍品和省份;我有歌手和跳舞少女和男人孩子的所有美食。\n 所以我变得伟大，超过了在耶路撒冷面前的任何人。我没有扣留任何我的眼睛所希望的东西，我没有否认自己有任何乐趣，因为我在我所有的辛劳中都很高兴，这是我所有的辛劳的一部分。但是当我看着所有的手都是锻造的所有东西时，我的劳动到了所有的东西，那么风似乎是虚荣的，风后追逐。在阳光下似乎没有什么值得的。\n 所以我对疯狂和愚蠢的考验，对于任何人都可以做些什么，以外的是他已经完成的东西？然而，我似乎也许智慧在愚蠢方面有一个优势，因为光比黑暗更好。但是，我意识到所有人都有一个和同样的命运，我反映了傻瓜的命运也会超越我。为什么我应该越来越多？我得出结论，这也是虚荣的。对于聪明人来说，因为傻瓜，没有永久的记录。在到来的日子里，一切都被遗忘了。看看智者如何像傻瓜一样死！ \n所以我讨厌生活。在太阳下面发生的一切对我来说看起来很邪恶，因为一切都是虚荣的，风后追逐。我讨厌，我必须把我所有人留给在阳光下辛苦的人，以追随我的人。一个用智慧，知识和诚信辛苦辛辛劳的人必须把它作为一种追求的人作为一个尚未辛苦的人 - 肯定是虚荣和一个伟大的邪恶。什么是他在阳光下的所有辛劳和他艰苦的努力的人，因为他所有的日子都是痛苦和他的野心，即使在晚上也没有休息？当然这是虚荣的。\n 一个人比吃和喝酒，喝酒并享受他的辛劳的更好。在我看来，这就是上帝的旨意。一切都有其指定的时间，并且有一段时间在阳光下。有一个诞生的时间，以及死亡的时间。有一个种植时间，以及连根拔起的时间。那么，有什么利润，有他的辛劳工人？\n 我已经观察到上帝为男人的孩子们为他们的痛苦而引起的每一个野心。他让他们把它们掌握了整个世界，没有人们在那些人中掌握了上帝从一开始到结束的工作。我意识到一个男人没有比快乐更好，在他的生命中享受自己，并且每个人都吃喝的人，在他所有的劳动中都有美好时光享有上帝的礼物。我意识到，无论上帝所做的任何东西都是永远的，哪一个不能添加，从中一个不能带走。无论是以前的任何东西，还有什么已经过去。\n 我在阳光下看到正义的邪恶，并且正义应该是邪恶的地方。我反映了上帝允许这是男人的孩子来测试它们并表明他们是野兽。对于男人的命运和野兽的命运是一样的。正如这个模具所在，那就是死亡，而且有相同的精神。男人对野兽没有优势，因为一切都是虚荣的。一切都去了一个地方。一切都是灰尘，都回到灰尘。谁知道男人的孩子是否安装起来，野兽的精神下降了？它似乎对人类来说比享受自己更好。这是他的部分 - 谁可以帮助他看看他应该是什么？\n 我认为在阳光下练习的所有压迫，而受压迫者的泪水没有任何人控制他们，以及他们的压迫者的暴力者在视线上没有被击退！我赞扬了这些长期死亡超过仍然生活的长期;比两者更好的是尚未成为的人，因为他没有看到太阳下的邪恶发生。我认为所有辛劳和所有诚实的工作都只是因为男人对他的邻居的热情 - 肯定是虚荣和风后追逐。更好的少于两只遥控辛劳和追逐之后的安静。我进一步考虑了在太阳下面的虚荣。没有一个没有伴侣的单身男人，没有儿子或兄弟，但毫无端兴奋，而眼睛从不满足他的财富。那么我应该辛劳辛劳剥夺自己的好时光吗？当然这是虚荣的，对不起的事。\n 更好的是孩子谦虚的孩子和聪明的是一个傻瓜，无法照顾自己。因为叛乱可能会犯统治，即使一个人在自己的王国出生差。我看到阳光下的所有生活蜂拥到孩子的一侧，谁在他的位置。所有人都没有结束，但那些来到的人不会在他身上欢喜快乐 - 现在这是虚荣之后的虚荣和追逐。\n 观察你的上帝之家的朝圣，但是抽取近听，而不是傻瓜提供牺牲，因为他们不知道伤害。不要用你的嘴巴猛烈，而不是匆匆地领导上帝面前的一句话，因为上帝在天堂和地球上的艺术。因此，让你的话很少。如果你确实向上帝发誓，请不要推迟付钱。无论你誓言，付钱！最好不要誓要发誓而不是付钱。不要让你的嘴带到你的罪，而不是在上帝面前说它是滑倒。为什么唤起上帝的愤怒并摧毁你自己的手工作业？ \n多种梦想导致许多愚蠢的词语，因为一个梦想来通过太多的业务，并且有许多话说傻瓜的声音。如果你认为穷人的压迫，而在这个国家的义法和正义欺骗，不要惊讶于发生，因为有一些“守护者”更高的上升和仍然更高的人，并超越他们一切都是国王。\n  我在阳光下看到的邪恶是困境的财富，当事人通过一个糟糕的冒险丢失，那个儿子被他从事。他不能随身携带他的辛劳和他所获得的东西。当然，这是一个痛苦的邪恶，就像他来的那样，所以他去了。因此，对他来说，他辛劳的潜水是什么盈利，他在拯救和不断担心和疾病中度过了所有的日子？\n 在我看来，这是好的，善于吃饭，喝酒，并在阳光下的所有辛劳下都有一个美好的时光，因为这是他的部分。上帝赋予财富和财产的每个人都有权力享受它并带走他的部分并在他的辛劳中幸福 - 这是上帝的礼物。因为他应该记住，生命是短暂的，上帝的喜悦批准。\n 我在阳光下观察到了一个邪恶，它沉重地对待人类 - 一个上帝给予了财富和财产和超级水的人，没有任何他所希望的任何东西，而是上帝没有给予谁享受它，让陌生人享受它 - 这肯定是虚荣，邪恶痛苦。\n 如果一个人会有一百个孩子和生活多年来，就是他的生活这么长时间，他并没有让他填补他的喜悦 - 我说堕胎比他更快乐。即使它变成了虚荣，在黑暗中移动，并且在黑暗中，它的名字被覆盖，它从未见过太阳也没有知道的事情 - 但这对另一方来说是优选的。虽然一个男人的生活一千年，两次被告知，并没有愉快的时光 - 不要全部去一个地方？\n 傻瓜有什么优势，或者通过他的知识的穷人设定了一个例子？更好的是享受而不是渴望 - 虽然这也是虚荣的虚荣和追逐。\n 由于确定了，因此已确定并且已修复的内容。男人不能争辩，什么比自己强。由于许多财产只是增加虚荣，他们对人类的优势是什么？对于谁知道在跨越虚荣处期间对一个男人有什么好处？虽然他花了像阴影的生活，但有人可以告诉男人是在阳光下追随他的人吗？ \n1 Sheol是希伯来黑社会，在圣经中描述为“悲观和深黑的土地”（Jow 10:21）。 ↩  阅读我们系列中的其他参赛作品：Lewis H. Lapham，Frederick Douglass，Virginia Gildersleeve和Kurt Vonnegut。  Qohelet是ECCLESSISSTES的归属作者，这是一本智慧文学的旧约。 由于这本书的叙述者是指自己作为“大卫的儿子，耶路撒冷国王”，一些读者已经确定了ECCLESSIASTES的作者作为所罗门，而其他读者则谨慎对待与文本作者等同于叙述者。 ", "note_en": "Most graduation advice—whether given in boom times or moments of crisis—depicts a future replete with untrammeled ground and endless unknowns. And if you take a look at commencement addresses from the past, you’ll see a glimpse of what people in power told privileged young people to believe in and sketches of what the future could be, which we can now consider next to the reality of what came next. Lapham’s Quarterly  is revisiting the history of giving advice to graduates and others in the process of acquiring knowledge or skills.\n  The Book of Ecclesiastes is one of the biblical “wisdom” books and belongs to an ancient literary tradition, beginning in Sumer and Babylonia, of recording the advice of sages. The word  Ecclesiastes derives from the Greek  ekklesiastes, or “one who addresses an assembly,” which is a rough translation of the Hebrew word  Qohelet (also  Koheleth), meaning “preacher” or “teacher.” Qohelet is the name  given in the text by the apparent author of Ecclesiastes. He also claims to be a king of Jerusalem and the son of David. If that is his true parentage, Qohelet was King Solomon, the tenth-century-  ruler of the Israelites. Jewish and Christian theologians have traditionally followed this attribution by placing Ecclesiastes between the Song of Solomon and the Book of Proverbs, Solomon’s other biblical writings, in the Old Testament. Yet the text’s Aramaic loanwords suggest it was composed in the third century  , after Solomon’s kingdom was divided and Jerusalem became one of the colonies of the Achaemenid Empire.\n Qohelet was a deeply cynical thinker, perhaps because of the diminished state of the Israelites. He describes a world in which success and happiness are not guaranteed, where an individual is largely powerless in the face of human greed, fallibility, and suffering. His advice for readers is to accept the futility of their lives and welcome the knowledge that all human actions are “vanity” or “vapor.” He suggests (perhaps influenced by the Greek philosophy of Epicureanism) that the best course of action is to pursue tranquility and pleasure:\n Therefore eat thy bread with joy, and drink thy wine with a merry heart. God has already given his approval to thy deeds. At all times be thy garments white, and let oil not be lacking for thy head. Enjoy life with the woman of thy love all the days of thy vain life that God has given thee under the sun. That is thy portion in life and the compensation for thy toil under the sun. Whatever thou can afford with thy substance do, for there is no activity, or reckoning, or knowledge, and no wisdom in Sheol.  1\n Since the first century, scholars have debated why Qohelet’s pessimistic meditation on human life was included in the Bible. Morris Jastrow Jr., an expert on Semitic languages at the University of Pennsylvania, noted in his 1919 translation, “It is a strange book to have slipped into a sacred collection.” Jastrow set out to produce a new translation of Qohelet’s words, believing that centuries of adaptation and reframing had resulted in a different work than its creator had intended; he was determined to give twentieth-century readers a new impression of a very old text:\n In presenting Qohelet in a new garb, minus the trimmings which were attached to the original composition, it is my hope to make a remarkable literary production more intelligible than is possible by reading it in any of our present-day translations of the Old Testament, which are all modeled on the classic “authorized” version of 1611, and which all assume the book to be a literary unit in its present form. In other words, I have tried to give the reader the book of Qohelet in its original form, as nearly as that is at present possible.\n Writers from  William Shakespeare to  Edith Wharton have paraphrased Qohelet’s words, and  Leo Tolstoy turned to Ecclesiastes during a midlife crisis of faith, writing in   A Confession that his doubts began with a single realization: “What am I?—A part of the infinite. In those few words lies the whole problem.”\n   What gain has a man of all his toil, \tWhich he toils under the sun? \tGeneration comes and generation goes, but the earth remains forever. \tThe sun rises and the sun sets, \tAnd to his rising place he returns. \tAround to the south and circling to the north, \tAround and around goes the wind, \tAnd on its circuits the wind returns. \tAll streams flow into the sea, \tBut the sea is not full. \tTo the place whither the streams flow, \tFrom there they flow back again. \tEverything is wearied, \tBeyond human utterance, \tBeyond sight and hearing. \tWhat has been is that which shall be; \tAnd what has happened is that which shall happen, \tSo that there is nothing new under the sun.\n If something occurs of which one says, “See, this is new”—ages before us it has already happened. Former occurrences are not recorded, and later occurrences also shall not be remembered by the ages that are to come.\n I, Qohelet, was king over Israel in Jerusalem, and I applied my mind to seek and explore everything under the sun—a sorry business which God has given the children of men for their affliction. I saw all that happened under the sun—and behold it was all vanity and chasing after wind.\n Now I thought to myself,  I have become great and acquired much more than anyone who reigned before me over Jerusalem. My mind was stored with very much wisdom and knowledge. So I set out to experience frivolity and foolishness, though I knew that this, too, was chasing after wind. I said to myself,  Come, I’ll make a test of pleasure and of having a good time, but alas! This also turned out to be vanity. Of sport, I was led to conclude that it was madness, and of joy—what does it accomplish! I made up my mind to stimulate my body with wine and to pursue folly, in order to ascertain whether this was a good way for the children of men to spend the days of their lives.\n I undertook great works. I acquired houses; I planted vineyards; I made gardens and parks. I planted in them all kinds of fruit trees, I made pools of water to irrigate the sprouting forest. I purchased slaves and handmaidens, and had a household of dependents, besides having possessions of cattle and flocks in large number, more than anyone before me in Jerusalem. I gathered also silver and gold, royal treasures, and provinces; I got singers and dancing maidens and all the delights of the children of men.\n So I became great, in excess of anyone who was before me in Jerusalem. I did not withhold anything that my eyes desired, I did not deny myself any pleasure, for I rejoiced in all my toil, and this was my portion of all my toil. But when I looked on all what my hands had wrought and on what I had toiled for—all indeed seemed vanity and chasing after wind. Nothing seemed worthwhile under the sun.\n So I made a test of madness and folly, for what can any man do who comes after a king beyond what he has already done? And yet it seemed to me that perhaps wisdom  has an advantage over folly, insofar as light is better than darkness. But then I realized that there is one and the same fate for all, and I reflected that the fate of the fool will also overtake me. Why then should I be overwise? I concluded that this also is vanity. For of the wise man, as of the fool, there is no permanent record. In the days to come everything is forgotten. And see how the wise man dies just as the fool!\n So I hated life. All that happened under the sun seemed evil to me since all was vanity and chasing after wind. I hated that I must leave all that I had toiled for under the sun to one who comes after me. A man who toils with wisdom, knowledge, and integrity must hand it over as an inheritance to one who has not toiled for it—surely this is vanity and a great evil. What has a man of all his toil and of his painstaking efforts under the sun, since all his days are pains and his ambition a vexation, with no rest for his mind even at night? Surely this is vanity.\n There is nothing better for a man than to eat and to drink and to enjoy himself for his toil; it seems to me that such is the will of God. Everything has its appointed time, and there is a time for every occurrence under the sun. There is a time to be born, and a time to die. There is a time for planting, and a time for uprooting. What profit, then, has the worker of his toil?\n I have observed every ambition which God has given the children of men for their affliction. He has given them a grasp of the whole world without the possibility on the part of man to fathom the work which God has made from the beginning to the end. I realized that there is nothing better for a man than to be happy and to enjoy himself in his life, and that every man who eats and drinks and has a good time in all his toil enjoys a gift of God. I realized that whatever God does is forever, to which one cannot add and from which one cannot take away. Whatever has been has been before, and what is to be has already been.\n I saw under the sun in the place of justice wickedness, and where the righteous should have been the wicked was. I reflected that God permits this in the case of children of men to test them and to show that they are beasts. For the fate of the children of men and the fate of the beast is the same. As this one dies, so is the death of that, and there is the same spirit to all. Man has no advantage over the beast, for all is vanity. All go to one place. All are of the dust and all return to dust. Who knows whether the spirit of the children of men mounts up and the spirit of the beast goes down? It appeared to me that there is nothing better for man than to enjoy himself. That is his portion—who can help him to see what shall be after him?\n I considered all the oppressions practiced under the sun, and the tears of the oppressed without anyone to console them, and the violence of their oppressors with no comforter in sight! And I praised these long since dead more than those still living; better than both is the one who has not yet been, as he has not seen the evil happenings under the sun. I considered that all toil and all honest work is merely due to man’s zeal against his neighbor—surely this is vanity and chasing after wind. Better a handful in quiet than two handsful in toil and chasing after wind. And I further considered the vanity that there is under the sun. There is a single man without a mate, without a son or brother, yet toiling without end, and with an eye never satisfied by his wealth. For whom then should I toil and deprive myself of a good time? Surely this is vanity and a sorry business.\n Better is the child of humble birth and wise than an old king who is a fool and unable to take care of himself. For through a rebellion one may come to rule, even though one is born poor in one’s own kingdom. I saw all the living under the sun flocking to the side of the child, who was to stand in his place. There was no end to all the people, yet those that come after will not rejoice in him—now surely this is vanity and chasing after wind.\n Observe thy pilgrimages to the house of God but draw nigh to hear, rather than to have fools offer a sacrifice, for they do not know enough to do any harm. Be not rash with thy mouth, and be not led hastily to utter a word before God, for God is in heaven and thou art upon earth. Therefore, let thy words be few. If thou  does make a vow to God, do not defer paying it. Whatever thou vows, pay! It is better not to vow than to vow and not pay. Let not thy mouth bring sin upon thee, and do not say before God that it was a slip. Why arouse God’s anger and destroy thy own handiwork?\n A multitude of dreams results in many foolish words, for a dream comes through too much business, and a fool’s voice is heard in many words. If thou sees the oppression of the poor, and justice and righteousness in the country defrauded, do not be amazed at the occurrence, for there is some “guardian” higher up and still higher ones above this one, and overtopping them all is the king.\n  A sore evil that I have seen under the sun is riches hoarded by the owner, and when that fortune is lost through a bad venture, the son begotten by him has nothing. He cannot carry anything that he has acquired by his toil away with him. Surely this  is a sore evil, that just as he came, so he goes. Therefore, what profit is it to him that he toils for the wind and that he spends all his days in saving and in constant worry and sickness and distress?\n It seems to me the thing that is good and proper is to eat, drink, and to have a good time with all one’s toil under the sun during the span of life which God has allotted to one, for that is his portion. Every man to whom God has given riches and possessions and who has the power to enjoy it and to take his portion and to be happy in his toil—this is a gift of God. For he should remember that life is short and that God approves of joy.\n There is an evil I have observed under the sun and it bears heavily on mankind—a man to whom God has given riches and possessions and superfluity with nothing lacking of anything that he might wish for, but to whom God has not given the power to enjoy it, so that a stranger enjoys it—this surely is vanity and a sore evil.\n If a man begets a hundred children and lives many years, be his life ever so long, and he does not get his fill of joy out of it—I say that the abortion is happier than he. Even though it comes into vanity, moves in darkness, and with darkness its name is covered and it has never seen the sun nor has known anything—yet this is preferable to the other. And though a man lives a thousand years twice told and has not had a good time—do not all go to one place?\n What advantage has a wise man over a fool, or the poor man who by his knowledge sets an example to the living? Better is enjoyment than longing—though this also is vanity and chasing after wind.\n Whatever is has long since been determined and what is has been fixed. Man cannot contend with what is stronger than himself. Since many possessions merely increase vanity, what advantage are they to man? For who knows what is good for a man during the span of his life of vanity? And though he spends his life like a shadow, is there anyone who can tell man who is to be after him under the sun?\n  1 Sheol is the Hebrew underworld, described in the Bible as “the land of gloom and deep darkness” (Job 10:21).  ↩\n  Read the other entries in our series:  Lewis H. Lapham,  Frederick Douglass,  Virginia Gildersleeve, and  Kurt Vonnegut.\n  Qohelet is the attributed author of Ecclesiastes, an Old Testament book of wisdom literature. As the narrator of the book refers to himself as “the son of David, king in Jerusalem,” some readers have identified Ecclesiastes’ author as Solomon, while others caution against equating the narrator with the writer of the text.", "posttime": "2021-06-19 13:22:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "教会,wind", "title": "风后追逐：重新掠夺教会的书 ", "title_en": "Chasing After Wind: Reframing the Book of Ecclesiastes", "transed": 1, "url": "https://www.laphamsquarterly.org/roundtable/chasing-after-wind", "via": "", "real_tags": ["教会", "wind"]}, {"category": "", "categoryclass": "", "imagename": "9a3c76bd073031fc6a14ec8816b69439.jpg", "infoid": 1066839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6月18日（路透社） -  Alphabet Inc's（Googl.o）谷歌本周告诉路透社，它正在开发一种替代行业标准方法来分类肤质的标准方法，这是一种越来越多的技术研究人员和皮肤科医生所说的评估产品是否不充分偏向于色彩的人。\n 问题是一种称为Fitzpatrick皮肤类型（FST）的六色标度，自20世纪70年代以来已经使用了皮肤科医生。科技公司现在依靠它来分类人员并衡量面部识别系统或智能手术率传感器等产品是否跨肤色调同样好。阅读更多\n  批评者表示FST，其中包括四类＆＃34;白色＆＃34;皮肤和一体的＆＃34;黑色＆＃34;和＃34;棕色，＆＃34;无视颜色人民之间的多样性。美国国土安全部的研究人员在去年10月的联邦技术标准会议期间，推荐用于评估面部识别的FST，因为它在不同人群中代表着色范围。\n 回应路透社＆＃39;关于FST，谷歌的问题，第一次和领先于同行，表示，它一直悄悄地追求更好的措施。\n ＆＃34;我们正在替代，更具包容性，可用于在我们的产品的发展中有用的措施，并将与科学和医学专家合作，以及与彩色社区合作的团体，＆＃34;该公司表示，拒绝提供有关努力的详细信息。\n 争议是对技术产业的种族主义和多样性更大的一部分，劳动力比金融等行业更为白色。确保技术适用于所有肤色，由于不同的年龄和性别，假设常用于新产品，通常由人工智能（AI）提供动力，延伸到医疗保健和执法等敏感和受管制区域。\n 公司知道他们的产品可能有缺陷，用于研究和测试数据中所代表的群体。对FST的担忧是，其对较深的皮肤的有限量可能导致技术，例如，用于金色棕色皮肤，但浓缩咖啡浓咖啡失败。 \n许多类型的产品提供比FST更丰富的调色板。去年拍打地带推出了24个皮肤色调蜡笔，而Mattel Inc＆＃39; s（mat.o）芭比时尚艺术品今年覆盖九个色调。\n 这个问题远非谷歌学术。当该公司于2月份宣布，一些Android手机上的摄像机可以通过指尖测量脉冲率，而无论用户是否有光肤或暗皮肤，它表示读数的读数将误差1.8％。\n 该公司稍后提供了类似的保证，即皮肤类型不会影响过滤背景的功能的结果，也不会识别用于识别皮肤状况的即将到来的Web工具，非正式称为DERM辅助。\n    已故哈佛大学皮肤科医生博士托马斯Fitzpatrick发明了规模，为牛皮癣进行了个性化紫外线辐射治疗，瘙痒的皮肤状况。他分组了＆＃34;白色＆＃34;人们作为罗马数字，通过询问太阳在某些时期后开发的晒伤或棕褐色。\n 十年后，v＆＃34; brown＆＃34;皮肤和vi for＆＃34;黑色。＆＃34;规模仍然是美国试验防晒版的美国法规的一部分，它仍然是评估患者患者的流行皮肤病学标准;癌症风险和更多。\n 一些皮肤科医生表示，规模是穷人和过度使用的照顾措施，并经常与种族和种族混淆。\n ＆＃34;很多人都会假设我是皮肤类型v，这很少永远不会烧伤，但我燃烧，＆＃34;潘尼斯·泰勒博士（宾夕法尼亚大学皮肤科医师都表示，2004年创立了彩色社会皮肤，促进了对边缘化社区的研究。 ＆＃34;看看我的肌肤色调，说我是v对我is isservice。＆＃34; \n技术公司，直到最近，令人不安。 Unicode是一个监督Emojis的行业协会，2014年提到FST是为了采用黄色的五种肤色，说出规模为＆＃34;没有负面协会。＆＃34;\n 2018年研究标题为＆＃34;性别色调，＆＃34;其中发现面部分析系统更常见的皮肤较深的皮肤，使用FST普及评估AI。该研究描述了FST作为A＆＃34;起点，＆＃34;但是，稍后来的类似研究的科学家告诉路透社他们使用规模保持一致。\n ＆＃34;作为相对未成熟市场的第一款，它为您提供帮助我们识别红旗的目的，＆＃34; Mozilla别墅inioluwa deborah Raji表示，重点是审计AI。\n 在4月的学习测试AI检测Deepfakes，Facebook Inc（FB.O）研究人员写了FST＆＃34;显然不包括在棕色和黑色肤色中的多样性。＆＃34;尽管如此，它们仍然发布了3,000名用于评估AI系统的视频，基于八个人类评估者的评估附加FST标签。\n 评估者的判决是中央。面部识别软件启动AnyVision去年将名人举例说明为评估者：前棒球巨人德里克Jeter作为IV型，模型TYRA银行A V和REPPER 50美分的VI。\n Anyvision告诉路透社，它同意谷歌和＃39;决定重新审视FST的决定，Facebook表示，更好的措施开放。\n Microsoft Corp（MSFT.O）和SmartWatch Makers Apple Inc（AAPl.o）和Garmin Ltd（Grmn.o）在工作与健康相关的传感器时参考FST。 \n但是使用FST可以是促进＆＃34;假设＆＃34; 关于智能手表的心率读数在加州大学圣地亚哥临床医生中，由黑人生活社会平等运动的启发，在去年睡眠中写道。  微软承认FST＆＃39;缺陷。 Apple表示，它对肤色的人类测试了各种措施，仅在他们中间的FST。 Garmin表示，由于宽程度的测试，它认为读数是可靠的。  Victor Casale成立了化妆公司暴徒美容和帮助牧师在新蜡笔上，他表示，他为基础开发了40种，每个人不同于下一个约3％，或者足以让大多数成年人区分。  颜色精度对电子产品建议科技标准应该有12到18个音调，他说，加入，“你不能只有六个。” ", "note_en": "June 18 (Reuters) - Alphabet Inc’s  (GOOGL.O) Google told Reuters this week it is developing an alternative to the industry standard method for classifying skin tones, which a growing chorus of technology researchers and dermatologists says is inadequate for assessing whether products are biased against people of color.\n At issue is a six-color scale known as Fitzpatrick Skin Type (FST), which dermatologists have used since the 1970s. Tech companies now rely on it to categorize people and measure whether products such as facial recognition systems or smartwatch heart-rate sensors perform equally well across skin tones.   read more\n  Critics say FST, which includes four categories for &#34;white&#34; skin and one apiece for &#34;black&#34; and &#34;brown,&#34; disregards diversity among people of color. Researchers at the U.S. Department of Homeland Security, during  a federal technology standards conference last October, recommended abandoning FST for evaluating facial recognition because it poorly represents color range in diverse populations.\n In response to Reuters&#39; questions about FST, Google, for the first time and ahead of peers, said that it has been quietly pursuing better measures.\n &#34;We are working on alternative, more inclusive, measures that could be useful in the development of our products, and will collaborate with scientific and medical experts, as well as groups working with communities of color,&#34; the company said, declining to offer details on the effort.\n The controversy is part of a larger reckoning over racism and diversity in the tech industry, where the workforce is more white than in sectors like finance. Ensuring technology works well for all skin colors, as well different ages and genders, is assuming greater importance as new products, often powered by artificial intelligence (AI), extend into sensitive and regulated areas such as healthcare and law enforcement.\n Companies know their products can be faulty for groups that are under-represented in research and testing data. The concern over FST is that its limited scale for darker skin could lead to technology that, for instance, works for golden brown skin but fails for espresso red tones.\n Numerous types of products offer palettes far richer than FST. Crayola last year launched 24 skin tone crayons, and Mattel Inc&#39;s  (MAT.O) Barbie Fashionistas dolls this year cover nine tones.\n The issue is far from academic for Google. When the company announced in February that cameras on some Android phones could measure pulse rates via a fingertip,  it said readings on average would err by 1.8% regardless of whether users had light or dark skin.\n The company later gave  similar warranties that skin type would not noticeably affect results of a feature for filtering backgrounds on Meet video conferences, nor of an upcoming web tool for identifying skin conditions, informally dubbed  Derm Assist.\n    The late Harvard University dermatologist Dr.  Thomas Fitzpatrick invented the scale to personalize ultraviolet radiation treatment for psoriasis, an itchy skin condition. He grouped the skin of &#34;white&#34; people as Roman numerals I to IV by asking how much sunburn or tan they developed after certain periods in sun.\n A decade later came type V for &#34;brown&#34; skin and VI for &#34;black.&#34; The scale is still part of U.S. regulations for testing sunblock products, and it remains a popular dermatology standard for assessing patients&#39; cancer risk and more.\n Some dermatologists say the scale is a poor and overused measure for care, and often conflated with race and ethnicity.\n &#34;Many people would assume I am skin type V, which rarely to never burns, but I burn,&#34; said Dr. Susan Taylor, a University of Pennsylvania dermatologist who founded Skin of Color Society in 2004 to promote research on marginalized communities. &#34;To look at my skin hue and say I am type V does me disservice.&#34;\n Technology companies, until recently, were unconcerned. Unicode, an industry association overseeing emojis, referred to FST in 2014 as its basis for adopting five skin tones beyond yellow,  saying the scale was &#34;without negative associations.&#34;\n A 2018 study titled  &#34;Gender Shades,&#34; which found facial analysis systems more often misgendered people with darker skin, popularized using FST for evaluating AI. The research described FST as a &#34;starting point,&#34; but scientists of similar studies that came later told Reuters they used the scale to stay consistent.\n &#34;As a first measure for a relatively immature market, it serves its purpose to help us identify red flags,&#34; said Inioluwa Deborah Raji, a Mozilla fellow focused on auditing AI.\n In  an April study testing AI for detecting deepfakes, Facebook Inc  (FB.O) researchers wrote FST &#34;clearly does not encompass the diversity within brown and black skin tones.&#34; Still, they released videos of 3,000 individuals to be used for evaluating AI systems, with FST tags attached based on the assessments of eight human raters.\n The judgment of the raters is central. Facial recognition software startup AnyVision last year gave  celebrity examples to raters: former baseball great Derek Jeter as a type IV, model Tyra Banks a V and rapper 50 Cent a VI.\n AnyVision told Reuters it agreed with Google&#39;s decision to revisit use of FST, and Facebook said it is open to better measures.\n Microsoft Corp  (MSFT.O) and smartwatch makers Apple Inc  (AAPL.O) and Garmin Ltd  (GRMN.O) reference FST when working on health-related sensors.\n But use of FST could be fueling &#34;false assurances&#34; about heart rate readings from smartwatches on darker skin, University of California San Diego clinicians, inspired by the Black Lives Matter social equality movement,  wrote in the journal Sleep last year.\n Microsoft acknowledged FST&#39;s imperfections. Apple said it tests on humans across skin tones using various measures, FST only at times among them. Garmin said due to wide-ranging testing it believes readings are reliable.\n Victor Casale, who founded makeup company Mob Beauty and helped Crayola on the new crayons, said he developed 40 shades for foundation, each different from the next by about 3%, or enough for most adults to distinguish.\n Color accuracy on electronics suggest tech standards should have 12 to 18 tones, he said, adding, “you can’t just have six.”", "posttime": "2021-06-19 12:40:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,测量,searches,fst", "title": "谷歌搜索新的肤色测量来遏制产品偏见 ", "title_en": "Google Searches for New Measure of Skin Tones To Curb Bias in Products", "transed": 1, "url": "https://www.reuters.com/business/sustainable-business/exclusive-google-searches-new-measure-skin-tones-curb-bias-products-2021-06-18/", "via": "", "real_tags": ["google", "谷歌", "测量", "searches", "fst"]}, {"category": "", "categoryclass": "", "imagename": "d243b70ecc9b7a8acf71f0bd50c86446.jpg", "infoid": 1066838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新闻休斯顿 - 休斯顿地区的一些邻居表示，本周，他们的房屋也越来越温暖，即使他们正在运行空调。  他们中的许多人声称，自从能量短缺开始以来，有人在恒温器上调高了温度。  当鹿园居民勃兰登的英语周三回到家里，他的房子很热。  “（我的妻子）让它在2:30下调了它，”英语说。 ＆＃34;这房子需要很长时间，在它变得热烈时会变得很酷。“  英语的妻子和他们的女儿决定在当天早些时候下午午睡。  “他们已经睡得足够了，这房子已经达到了78度，”英语说。 “所以他们醒来出汗。”  没有人触摸它，他们说他们的恒温器在睡觉时改变了，让他们的家难以忍受。 \n“我的女儿在过热的点吗？”英语说。 “她3个月了。他们很快就脱水。“\n  他的妻子很快就在她的手机上收到了警报。这个家庭说他们的恒温器已经远程改变，在三小时的“节能活动中，提高了他们家的温度”。\n  几年前，家庭的智能恒温器是在新家庭安全包的一部分安装的。许多智能恒温器可以参加一个名为＆＃34;智能储蓄德克萨斯州的程序。＆＃34;它＆＃39;由一家名为Energyhub操作的公司。\n  该协议指出，以换取追加赌注，电动客户允许他们在高能源需求期间控制其恒温器。 EnergyHub其客户名单包括TXU Energy，Centerpoint和Ercot。\n    “我不希望其他人控制我的东西，”他说。\n  通过休斯顿红线板滚动显示英语并不孤单。其他几个人说他们在本周的热浪中发现了他们的恒温器正在进入，并远程出现。\n    英语说他的智能恒温器是方便的，但表示不值得。 \n“如果其他人可以操纵这一点，我不是因为它，”他说。 ", "note_en": "News          HOUSTON — Some neighbors in the Houston area said their homes have been much warmer this week, even while they are running their air conditioners.\n  Many of them claim someone has been turning up the temperature on their thermostats since the  energy shortage began.\n        When Deer Park resident Brandon English  got home from work on Wednesday, his house was hot.\n  “(My wife) had it cranked it down at 2:30,” English said. &#34;It takes a long time for this house to get cool when it gets that hot.”\n  English’s wife and their daughters decided to take their afternoon nap earlier in the day.\n  “They’d been asleep long enough that the house had already gotten to 78 degrees,” English said. “So they woke up sweating.”\n  Without anyone touching it, they said their thermostat was changed while they were sleeping, making their home unbearably hot.\n  “Was my daughter at the point of overheating?” English said. “She’s 3 months old. They dehydrate very quickly.”\n  His wife received an alert on her phone soon after that. The family said their thermostat had been changed remotely, raising the temperature of their home during a three-hour “energy saving event.”\n  The family’s smart thermostat was installed a few years ago as part of a new home security package. Many smart thermostats can be enrolled in a program called &#34;Smart Savers Texas.&#34; It&#39;s operated by a company called  EnergyHub.\n  The agreement states that in exchange for an entry into sweepstakes, electric customers allow them to control their thermostats during periods of high energy demand. EnergyHub’s list of its clients include TXU Energy, CenterPoint and ERCOT.\n    “I wouldn’t want anybody else controlling my things for me,” he said.\n  A scroll through a Houston Reddit board shows English is not alone. Several others said they found out during this week’s heatwave that their thermostats were being accessed, and turned up, remotely.\n    English said his smart thermostat is convenient but said it’s not worth it.\n  “If somebody else can manipulate this, I’m not for it,” he said.", "posttime": "2021-06-19 12:39:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,智能,smart,恒温器", "title": "震惊地找到智能恒温器通过“智能救护者德克萨斯州”程序远程举起 ", "title_en": "Shocked to find smart thermostats raised remotely by “Smart Savers Texas” progrm", "transed": 1, "url": "https://www.ksdk.com/article/news/remote-thermostat-adjustment-texas-energy-shortage/285-5acf2bc5-54b7-4160-bffe-1f9a5ef4362a", "via": "", "real_tags": ["程序", "智能", "smart", "恒温器"]}, {"category": "", "categoryclass": "", "imagename": "57a81209d930d5a135cadcbffec8c998.jpg", "infoid": 1066837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Romanesco西兰花和蕨叶的分形（沙龙/盖蒂图像的照片插图）你曾经看过悬崖的一侧，看到岩石上的一张脸，就像山上的老人着名的新汉普郡的春天或者也许你看过龙形状的云，或者耶稣在一块烧焦的吐司上的脸？如果是这样，你经历过什么心理学家呼叫和＃34; Pareidolia＆＃34; - 以可视模式查找有意义的图像。\n 虽然Pareidolia的经验是普遍的，但很少知道Pareidolia也是创造力的迹象和审美升值的基本特征。最近的科学研究＆＃34的神经科学;自发思考＆＃34;表明Pareidolia的来源可能是我们喜欢艺术和自然的原因之一。\n 认知波动是大脑中神经活动的不可预测的变化。他们的原因目前未知。神经科学家自20世纪30年代以来一直意识到这些波动，但通常将它们平均为＆＃34;背景噪音＆＃34;来自其他脑活动与有意识的思想相关。\n 最近，科学家们始终认为大脑中所谓的背景噪音可能比以前想象的意识更为重要。最近的研究发现，这些波动占大脑活动的95％;意识思考仅占5％。认知波动就像暗物质或＆＃34;垃圾＆＃34;大脑的DNA，因为它们弥补了发生的最重要部分，但仍然是神秘的。\n 神经科学家，如Georg Northoff，Robin Carhart-Harris和Stanislas Dehaene一直专注于过去十五年来对这些波动的研究。他们得出结论，神经波动不是次要的，但意识的根本。利用测量大脑中大型神经波动的频率和强度的技术，科学家们发现脑波倾向于彼此嵌入，如音乐中的舞蹈。在最低频率下，滚筒铺设了一个节拍，低音扮演节奏。在那些节奏的音符之间，吉他扮演旋律。意识的歌曲从自发神经波动中建立起来。\n 世界上具有类似的自发波动，我们的尸体和大脑。当来自世界的感官信息与大脑相互作用时，它会产生独特的＆＃34;衍射和＃34;类似于由石头制成的碰撞波的图案落入水池中。世界脉冲具有声音和光的频率，如我们的身体消化食物，击败心脏和泵肺。\n 我们的大脑并不代表世界，而是通过自己的自发波动来回应这种刺激。他们在与弥补思想和感受的旋律的波浪之间发挥作用。就像爵士乐三重奏，世界，身体和大脑都有自己的自发波动，这是我们称之为现实的创造性的即兴创作的基础。 \n这些波动也是我们Pareidolia经验的来源。当我们让我们的思想徘徊和白日梦时，他们越来越开放，这些分歧＆＃34;自下而上的＆＃34;衍射和弱点。当我们的大脑不由自主地试验看到各种＆＃34;自上而下的＆＃34;在这些波动中的动物形状或面部等图像。在这种即兴的心态中，自发的思想和创造性的图像像来自无意识的海洋一样像波浪一样再次消失。这一来回是一种即兴的过程，增加了大脑中的认知波动，并且具有与增加认知通量的其他活动类似的治疗效果。\n 但为什么我们享受这么多的这种状态？为什么我们更喜欢一些植物，或者一些艺术品，超越别人？一些景点和声音倾向于放大这些自发波动等。例如，科学家们表明，由于性质上的某些模式称为分形，往往会增加户外散步。当我们在艺术中查看这些模式和比例时，同样的事情就会发生。分形是一种特定的重复粗粒于细粒图案，例如树形图案在其分支，树枝和叶静脉中重复的树。\n 当我们看世界时，我们无意识的眼睛运动或＆＃34;眼扫描＆＃34;在移动图像时也具有分形图案。当我们通过分形眼睛运动观看分形模式时，我们的身体变得不那么强调，我们介意更多，因为图像出现并从有意识的意识中消失。即使我们的脑袋也变得更加分形，更互连，当我们的思想徘徊时。这种遐想的经历往往会感觉良好。\n  想要更多的健康和科学故事吗？订阅沙龙＆＃39;每周时事通讯粗俗的科学家。\n  例如，最近的几项研究表明，人们更喜欢看不仅仅是非分形的分形模式和艺术品，并发现它们更美观。分形图像和声音邀请我们的眼睛，身体和大脑玩，徘徊，并以主要是无意识和非自愿的水平的新协会。即使我们没有自觉地了解原因，我们也享受它。\n 正如您可能猜到的那样，分形也增加了Pareidolia。研究表明，人们倾向于在Rorschach墨水印迹试验中看到更多的图像，具有特定的分形尺寸。\n 但为什么身体，大脑和世界之间的戏剧如此广泛的经历令人愉悦和美丽？物理学家Richard Taylor在俄勒冈大学，推测人类是＆＃34;有线＆＃34;与一个＆＃34;分形流畅度＆＃34;因为我们演变出来被植物，云和岩石的自然分形图案包围。研究证实，分形增加了关注，模式识别，导航，减轻压力，并具有审美吸引力。泰勒认为分形也是我们的来源和＃34;生物嗜酚，＆＃34;或者对自然的热爱。 \n我觉得认知波动与艺术和性质的分形模式之间的相互关系是什么，它们往往以独特的俏皮的方式对我们有益。自然并没有决定一个普遍的正确行动形式，健康的生活或美丽的艺术。相反，一些模式让我们或多或少地进行播放和实验。似乎我们的身体更喜欢玩。\n 但游戏也可能是危险的。不是我们的实验都有工作，有些事情出错了。心灵徘徊可以导致负面的谣言，而不是每个人都喜欢相同的分形美学。\n 但这是外带：我们没有生物学上编程为......或者这个或那个对象，而是倾向于享受所有事情的播放，即兴，试验和错误的过程。换句话说，最近的思想徘徊和分形的研究表明，参与制作和体验艺术的创造性和无意识的过程是审美美女和对自然的热爱的重要来源。\n       Thomas Nail是丹佛大学哲学教授，众多书籍和文章的作者，其中一些可以在这里在线阅读。在Twitter或他的博客上找到他。\n  更多来自 ", "note_en": "Fractals of Romanesco broccoli and fern leaves\t\t\t\t\t\t\t (Photo illustration by Salon/Getty Images)   Have you ever looked at the side of a cliff and seen a face in the rock, like the Old Man on the Mountain famously minted on the New Hampshire quarter? Or perhaps you have seen clouds in the shape of dragons, or the face of Jesus on a piece of burnt toast? If so, you have experienced what psychologists call &#34; pareidolia&#34; — finding meaningful images in visual patterns.\n And while the experience of pareidolia is universal, few know that pareidolia is also an indication of  creativity and a fundamental feature of aesthetic appreciation. Recent scientific research into the neuroscience of &#34;spontaneous thought&#34; suggests that the source of pareidolia may be one of the reasons we love art and nature so much.\n Cognitive fluctuations are unpredictable changes in neural activity in the brain.  Their causes are presently unknown. Neuroscientists have been aware of these fluctuations since the 1930s, but typically averaged them out as &#34;background noise&#34; from other brain activity correlated to conscious thought.\n Recently, scientists have come to believe that so-called background noise in the brain may be more crucial to consciousness than previously thought. Recent research found that these fluctuations make up 95% of brain activity; conscious thoughts account for merely 5%. Cognitive fluctuations are like the dark matter or &#34;junk&#34; DNA of the brain, in that they make up the most significant part of what&#39;s happening but remain mysterious.\n Neuroscientists such as  Georg Northoff,  Robin Carhart-Harris, and  Stanislas Dehaene have been focusing their research on these fluctuations in the last fifteen years. They have concluded that neural fluctuations are not secondary, but fundamental for consciousness. Using technologies that measure the frequency and strength of large groups of neural fluctuations in the brain, scientists have discovered that brain waves tend to nest into one another, like syncopation in music. At the lowest frequencies, the drums lay down a beat, and the bass plays a rhythm. In between the notes of that rhythm, the guitar plays a melody. The song of consciousness builds up from spontaneous neural fluctuations.\n There are similar spontaneous fluctuations in the world, our bodies, and our brains. When sensory information from the world interacts with the brain, it creates unique &#34;diffractive&#34; patterns, similar to the colliding waves made by stones dropped into a pool of water. The world pulses with frequencies of sound and light like a drumbeat within which our bodies digest food, beat hearts, and pump lungs.\n Our brains do not represent the world, but rather respond to this stimuli with their own spontaneous fluctuations. They play between the waves with melodies that make up our thoughts and feelings. Like a jazz trio, the world, body, and brain have their own spontaneous fluctuations that are the basis of the creative improvisation we call reality.\n These fluctuations are also the source of our experience of  pareidolia. When we let our minds wander and daydream, they become increasingly open to these divergent &#34;bottom-up&#34; diffractions and weak associations. Pareidolia occurs when our brains involuntarily experiment with seeing various &#34;top-down&#34; images such as animal shapes or faces in these fluctuations. In this improvisational state of mind, spontaneous thoughts and creative images rise like waves from the ocean of the unconscious and disappear  again. This back-and-forth is an improvisational process that increases cognitive fluctuations in the brain and has  therapeutic effects similar to other  activities that increase  cognitive flux.\n But why do we enjoy this state of being so much? Why do we prefer some plants, or some works of art, over others? Some sights and sounds tend to amplify these spontaneous fluctuations and others do not. For instance, scientists have shown that taking a walk outdoors tends to increase mind-wandering due to certain  patterns in nature called fractals. The same thing happens when we view these patterns and proportions in  art. A fractal is a particular repeating coarse-grained to fine-grain pattern, such as a tree whose forking patterns  repeat in its branches, twigs, and leaf veins.\n When we look at the world, our unconscious eye movements or &#34;eye saccades&#34; also have a fractal pattern as they move over  images. When we view fractal patterns with our fractal eye movements, our bodies become  less stressed, and we mind-wander more as images emerge and disappear from conscious awareness. Even our brainwaves become more fractal and more interconnected when our minds  wander. And this experience of reverie tends to feel good.\n  Want more health and science stories in your inbox? Subscribe to Salon&#39;s weekly newsletter  The Vulgar Scientist.\n  For instance, several recent studies have shown that people prefer to look at fractal patterns and artworks more than non-fractal ones and find them more aesthetically  beautiful. Fractal images and sounds invite our eyes, bodies, and brains to play, wander, and make new associations at a mainly unconscious and involuntary level. We enjoy it even if when we do not consciously know why.\n As you might guess, fractals also increase pareidolia. Studies show that people tend to see more images in Rorschach ink-blot tests with a particular fractal  dimension.\n But why is the play between body, brain, and world so widely experienced as pleasurable and beautiful? The physicist, Richard Taylor at the University of Oregon, speculates that humans are &#34;wired&#34; with a &#34; fractal fluency&#34; because we evolved surrounded by the natural fractal patterns of plants, clouds, and rocks. Studies confirm that fractals increase attention, pattern recognition, navigation, reduce stress, and have aesthetic appeal. Taylor argues fractals are also the source of our &#34;biophilia,&#34; or love of nature.\n What I find fascinating about the interrelation between cognitive fluctuations, mind wandering, and fractal patterns in art and nature is that they tend to be good for us in a uniquely  playful way. Nature does not dictate a single universal form of right action, healthy living, or beautiful art. Instead, some patterns let us play and experiment more or less. And it seems that our bodies prefer to play.\n But play can also be dangerous. Not all our experiments work, and some go wrong. Mind-wandering can lead to negative rumination, and not everyone prefers the same fractal aesthetics.\n But here is the takeaway: we are not biologically programmed to like or this or that object, but rather inclined to enjoy the process of play, improvisation, trial, and error in all things. In other words, recent research into mind wandering and fractals suggests that the process of creativity and unconscious play involved in making and experiencing art is a crucial source of aesthetic beauty and our love of nature.\n       Thomas Nail is Professor of Philosophy at the  University of Denver and author of numerous books and articles, some of which can be read online  here. Find him on  Twitter or on his  blog.\n  MORE FROM", "posttime": "2021-06-19 12:39:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "艺术,大脑,brains,分形", "title": "为什么我们的“漫游大脑”是有线爱艺术和自然 ", "title_en": "Why our “wandering brains” are wired to love art and nature", "transed": 1, "url": "https://www.salon.com/2021/06/15/why-our-wandering-brains-are-wired-to-love-art-and-nature/", "via": "", "real_tags": ["艺术", "大脑", "brains", "分形"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Maddy Mail Server实现运行E-MailServer所需的所有功能。 它可以通过SMTP（工作为MTA）发送邮件，通过SMTP（适用为MX）并存储消息，并通过IMAP提供对其访问的信息.IN，它实现了必要的辅助协议，该协议保留电子邮件合理安全（DKIM， SPF，DMARC，DANE，MTA-STS）。  它替换了Postfix，DoveCot，Opendkim，OpenSPF，OpendMarc等统一配置和最小维护成本。  注意：IMAP存储是＆＃34; beta＆＃34; 如果您正在寻找稳定的且齐全的实现，您可能想要使用Dovecot。 Maddy Stillcan处理留言交付业务。 ", "note_en": "Maddy Mail Server implements all functionality required to run a e-mailserver. It can send messages via SMTP (works as MTA), accept messages via SMTP(works as MX) and store messages while providing access to them via IMAP.In addition to that it implements auxiliary protocols that are mandatoryto keep email reasonably secure (DKIM, SPF, DMARC, DANE, MTA-STS).\n It replaces Postfix, Dovecot, OpenDKIM, OpenSPF, OpenDMARC and more with onedaemon with uniform configuration and minimal maintenance cost.\n Note: IMAP storage is &#34;beta&#34;. If you are looking for stable andfeature-packed implementation you may want to use Dovecot instead. maddy stillcan handle message delivery business.", "posttime": "2021-06-19 12:39:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "组合,composable,实现", "title": "Maddy：可组合的一体式邮件服务器 ", "title_en": "Maddy: Composable all-in-one mail server", "transed": 1, "url": "https://maddy.email/", "via": "", "real_tags": ["组合", "实现"]}, {"category": "", "categoryclass": "", "imagename": "8a268f98869d74f9e3ca2793e79cbeb0.jpg", "infoid": 1066835, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为2000年代最着名的面孔之一，人们认为他们知道巴黎希尔顿的故事。所以，当40岁的孩子去年发布了一个关于她的生活的YouTube纪录片时，许多人震惊地了解她几十年与创伤的斗争。\n 希尔顿泪流满面地讲述了她在卧室的中间的陌生人作为少年来醒来的陌生人，并强行占据全国各地。她说，她没有答复的哭泣，帮助在噩梦中反复发挥作用，这使得难以入睡。\n 她的故事，虽然令人震惊，并不是独一无二的。希尔顿是父母每年送入私人网络的数千名美国儿童之一，进入＆＃34;强烈的爱情＆＃34;在改革他们的行为时销售的住宅方案和学校。\n   ＆＃34;我的父母让我绑架并在山中间掉下来，＃34; 21岁的Daniel在Tiktok视频中说了超过一百万次。\n 作为一个少年，丹尼尔遭受焦虑和抑郁症。他15岁，当他如此严重地自我伤害时，他最近出现了同性恋者。它在医院，他在两个男人中间被唤醒了醒来。他们告诉他这个过程可能很容易或努力 - 取决于他抵制了多少。在他身上留下了很少的战斗，丹尼尔和这对一起去了。但是，当他询问陌生人时，如果他可以使用电话致电他的父母，他说护送用手铐威胁他。\n  丹尼尔被派往犹他州的荒野计划，他在户外生活77天，每天徒步旅游。他生动地记得感到寒冷，饥饿和肮脏的周末，并目睹了其他人试图逃跑并试图采取自己的生活。与许多其他人送到荒野计划一样，他被直接注册到长期设施 - 这次在蒙大拿州 - 他将在那里花15个月。\n  陷入困境的青少年行业（TTI）已成为一个伞长的私人住宅计划，如这些私人住宅课程，旨在改变青少年行为。从训练营到寄宿学校，这些设施被销售为广泛的行为和心理健康问题，包括饮食障碍，吸毒和蔑视。 \n占据了希尔顿和丹尼尔的人来自专门销售给关心他们的孩子如何在纳入计划中的家庭的家庭。这些青年交通服务广告良好，经常建议，父母通常支付几千美元，让他们的孩子从床上取出并在全国各地省外掉下来。\n 父母有时被第三方提到行业后，在感受到他们筋疲力尽的其他手段后，他们已经筋疲力尽了。方案销售在高水平的轶事成功上，具有营销材料和学生的推荐，并在线评论将其描述为转型性甚至挽救生命。\n 但多年来，其他前居民一直在这些设施中绘制了他们的时间的非常不同的照片，包括诉讼和刑事投诉，涉及情绪和身体虐待。\n  英国广播公司已谈到20人认为，陷入困境的青少年幸存者，从20岁到40多岁以后，在过去的几十年中，他们在行业内的经验。\n  虽然他们的个人背景和被派遣的原因差异不同，但在他们的账户中出现了模式，并且在TTI Survivor支持网络在线中的数百更多。\n 整个美国的行业大小及其年度营业额仍然难以捉摸，因为没有联邦监管机构监测。\n   美国政府责任办公室的任务是在2007年调查了对整个行业的忽视和滥用的指控，但由于在国家一级的州立一级的许可规则和围绕标签设施的歧义使用来描述自己，难以掌握国家景象训练营或治疗学校。 \n他们的调查人员发现了数千个滥用的指控，并在美国和美国所有企业的行为方案中审查了一些死亡人数。他们的报告提出了关于员工所需培训水平的担忧，以及他们被描述为父母的欺骗性和可疑的营销实践。\n  Cynthia Clark Harvey是其中之一。她的女儿埃里卡在2002年在内华达州荒野计划的第一个全天死于她的第一个整天的热艇和脱水时，她只是15岁。\n  辛西娅记得女儿是一个明亮，周到和运动的年轻女孩，他们一直在学术上做得很好，直到她开始患上14岁的心理健康问题。她的斗争使她成为自杀，开始尝试非法药物。当埃里卡被送往医院并被排除在学校之外时，这个家庭觉得害怕和摆脱他们的深度。\n   当时，情况感到震惊。埃里卡一直在做得更好，但她的精神科医生建议住宅治疗可以帮助她恢复的途径。\n 她的家庭选择的计划是众所周知和认可的。他们感到放心的埃里卡在安全的手中，并从经验中增长。经过几周的审议和规划，他们在与她的妹妹的家庭旅行的幌子下前往内华达州。当欺骗被揭露时，埃里卡变得害怕和生气，拒绝离开汽车。在与其他家庭进行动荡的小时群治疗会议之后，她和其他孩子被带走了。\n 这是辛西娅最后一次和她的丈夫看到他们的女儿活着。当他们回到亚利桑那州的后晚上时，他们已经有一条消息等待他们的答辩电话告诉他们打电话。他们被告知埃里卡发生了意外，员工正在进行心肺复苏术。\n ＆＃34;我还记得时间范围，但在那一点上，她可能已经死了很多时间，＆＃34;辛西娅说。 \nErica＆＃39; ob告只会说她在内华达队徒步旅行。她的父母不会在几周内发现她的死亡事业 - 这花了几年时间和诉讼，让他们获得记录，并找出当天发生的事情的真相。\n 辛西娅表示，他们最终与该计划定居了一个未公开的金额，这些条件是他们可以自由地对其女儿的情况进行自由讲话的条件＆＃39;由于她的状态全天恶化，她已经被推动了埃里卡被迫继续徒步旅行。她后来证明了关于她的女儿＆＃39;遇到员工的十几岁的交战人员的痛苦。即使在埃里卡落下了刷子和岩石之后，她也没有收到近一小时的医疗帮助。\n Trek的偏远地点和一系列吹风机在呼吁他们的位置是指紧急直升机到达并将她带到所正式宣布死亡的医院需要几个小时，她的生活可能已经保存了。\n 辛西娅继续努力，遗憾和悲伤地对发生的事情并与其他在同样难以想象的位置联系起来。她的女儿没有犯罪，但死亡，但19年的死亡，辛西娅继续公开发言，支持行业范围的改革。\n 全国治疗学校和方案协会（Natsap） - 其善良的最大成员协会 - 代表国会听证会的行业出现，其中由立法者植入了关于保护和支票的立法者。\n Natsap＆＃39;今天的网站说，它随着时间的推移而改变了行业。它强调它具有道德标准，要求成员由其适当的州机构或国家认可机构许可，并由合格的临床医生监督治疗服务，尽管它并非认证设施本身。\n 竞选人员认为，目前的监督水平还不够。他们说，缺乏凝聚力的国家监测允许糟糕的演员在行业中迁移，并可以在新的名称下重新命名并从投诉中距离。 \n在他们建造的在线网络中，作为行业幸存者的人建立了建造的人，并提供全国各地的支持 - 汇集信息和资源，以跟踪涉嫌滥用的滥用和员工的旋转门。一个reddit论坛的主题有超过20,000名成员。\n   虽然近年来一些更具争议的计划和组织已关闭，但指控继续困扰该行业。许多故事和经验前居民向英国广播公司追讨的故事和经验有很多共同点 - 无论他们是几十年前还是在过去的几年内都有很多。\n 许多所描述的到达过程让他们感到沮丧和脱离。运输公司采取的人将该过程描述为迷失方向和令人恐惧。有些人包括性别虐待受害者，抱怨侵入性的条带搜索和考试。一个人被送往与性别困难的抑郁症犯有困难，呼吁经历了一个涂抹的试验，作为一个处女的年龄14岁。尽管没有物质滥用病史，但其他人认为他们的头部剃光和血液和药物测试。\n   一些主张目睹和经验丰富的做法，如孤立和克制，并说他们也有望惩罚和抑制他人。他们描述的许多系统都基于积极参与的水平，包括＆＃34;攻击治疗＆＃34;需要在群体成员面临并批评彼此的课程，以进展和获得基本特权。其他人描述了可以持续时间的任意体力劳动，集体惩罚和授权沉默的时期。\n 他们都描述了具有极端限制和与外界联系的极限和审查的压抑环境。许多人认为，他们的父母误导了他们注册他们的计划的现实，并描述了他们与家人之间的不信任的规则。一些对关系造成的持续损害，持久担心对他们的经历开放，即使在离开之后，因为害怕被送回或不相信。\n 有些人告诉英国广播公司，他们目睹了身体暴力，自我伤害和自杀的尝试，许多人知道在离开后夺走了自己的生活。其他随后被诊断出患有创伤后应激障碍等条件，并表示他们继续遭受长期的社会困难，包括在他人中信任，因为他们的经验。\n  2006年，记者Maia Szalavitz写了一本书，敦促父母寻求基于证据的儿童治疗，而不是诉诸行为修改设施。她的书从几十年前讲述了行业中使用的许多方法的起源，包括对抗组织治疗，包括争议和诋毁的计划。 \n改变倡导者说少女＆＃34;艰难的爱情＆＃34;第一次开始在20世纪80年代开始起飞的行业已经能够持续数十年的争议，部分因父母寻求帮助的问题周围的社会耻辱。青少年在系统内花费几年并每月学费，有时在数千人中，青少年并不罕见，可以快速安装。\n 许多人，包括Szalavitz，相信那些推荐的家庭可以利用或夸大恐惧的恐惧，因为药物滥用等问题，儿童将最终死亡或被监禁。她和凯特Truitt都是与前居民合作的临床心理学家和神经科学家，说这些设施所经历的创伤实际上可以延续或导致长期战斗与成瘾和虐待关系。\n 许多前居民，包括一些BBC发言，说他们最初将他们的治疗视为合理的甚至倡导别人派子女。有些人在反映了他们的经历后改变了他们对计划的看法。\n   Truitt博士比较了她在一些前居民中看到的创伤，以至于邪教或战俘的前成员所经历。她指出，因为青春期是这样一个关键的发展时期，他们的经历可能特别损害。\n ＆＃34;并且由于他们的特定创伤类型＆＃39; ve忍受的，大多数幸存者都没有感到安全寻求治疗，因为作为治疗提供者的人是肇事者，＆＃34;她告诉英国广播公司。\n  巴黎希尔顿透露，她已经逃离了一些其他展示士，然后她在犹他州派往普罗沃峡谷，并在她18岁之前持续了近一年。\n 这些纪录片这是巴黎，他们向同学汇编了同学，因为他们从涉嫌情绪和身体虐待的经历中公开，包括对单独监禁等惩罚的指控。 \nProvo Canyon仍然开放。将其寄到网站顶部的声明表示，它于2000年销往新所有者，并且在此期之前无法发表评论操作或患者体验。他们还说他们现在不使用像隐居或机械克制这样的方法。\n 希尔顿省＆＃39;纪录片已被观看近3000万次，并自发布以来她继续发声倡导。\n 这一角色标志着她们建立了她们名人品牌和业务帝国的角色的激烈偏离。虽然她的少年历史已经闻名于那些通过同一系统的人中所知，但他们说有人作为高调挺身而出，却有助于为这个问题带来可信度和认识。\n 社区内的人士表示，纪录片授权有些人首次发表谈论他们的经验。或者已被用来帮助别人，包括父母，了解他们的经历。\n   一些前居民在#BreakingCodesilence的想法下联合团结，参考被用作惩罚的强制社会孤立期，并作为某些设施中的控制方法。\n ＆＃34;许多这些程序中的一个规则是您可以在离开时＆＃39; t＆＃39;当您离开时，请参加任何人和＃39;所以，我们从未打算连接，＆＃34;与希尔顿派系的Katherine McNamara表示，在社交媒体上出现了群体。她和其他一些人现在正在共同努力，帮助提高意识，支持那些认为幸存者并倡导变革的人。\n 其他名人，包括巴黎杰克逊和纹身艺术家Kat Von D，已由纪录片提出的纪录片。 \nRapper Bhad Bhabie，Real Name Danielle Brogoli呼吁电视个性伯尔博士为派遣她和其他青少年陷入困境的美国大学秀的困扰。\n 追随另一家前客人提出的诉讼指控她被惩罚了报告了同样的治疗寄宿牧场Brogoli的工作人员被派遣的副工作人员被派遣。 BBC联系回答的设施先前否认了反对IT的指控并争议其账户。\n 菲尔麦格劳在接受采访时说，他伤心地听到Bregoli＆＃39; S被指不愉快的经历，但疏远了自己和他的节目从她的要求。\n  年轻人，曾经因为经验而与少女同行隔离，正在使用社交媒体来试图打破耻辱。有些人在平台上获得了巨大的追随者，如Tiktok告诉他们的故事。但这并不是没有个人风险的，而且在公开发言后，BBC已经看到法律信件发送到一个内容创造者。\n 丹尼尔已经获得了超过240,000个粉丝，从去年讲述了他和其他人的故事。他现在每天从其他人经历类似情况的情况下获得数十条邮件，并让父母联系他，说他们＆＃39;在看到他的视频后送孩子的计划。\n ＆＃34;如果我的15岁的自我知道人们在那里为我而战，我会感到如此松散，＆＃34;他说了这个运动。\n  在某些情况下，社交媒体一直是有形变化的工具。一个女人，阿曼达户主，使用Tiktok来传播对父母周围的指控的认识;在密苏里州的宗教寄宿牧场治疗女孩。数百万人看到了她的视频，最终官员关闭了学校。 \n户主在密苏里州的密苏里州结束宗教豁免，甚至在私人宗教设施的条件下停止，就像她的父母跑的那样的基本监督。她将经验描述为BBC AS＆＃34;非常宣传......知道可能在未来的孩子赢得＆＃39; T必须经过我们经历的东西＆＃34;并说她希望在刑事案件中提供证据。\n 希尔顿是一个谈话的一群人，他们在听证会上说服立法者在犹他州引入更好的保护 - 国家认为拥有美国陷入困境的青少年设施最大的密度。\n ＆＃34;我不知道我的噩梦是否会消失，但我知道有数百个孩子经历了这个，也许如果我阻止他们的噩梦，它会帮助我停下来， ＆＃34;她作证了。\n    但是，民主党人亚当·席克夫＆＃39;办公室的发言人确认了他正致力于更新并重新介绍旨在禁止和结束虐待虐待的立法，并增加国家监督这些设施。\n   ＆＃34;它没有变得更好，因为岁月，因为它＆＃39;只有更多的里程碑，＆＃34;辛西娅反映了。\n 自从她参加了向联邦监管推动的听证会，它已经好十年了十年。但反对所有赔率，她仍然有希望。\n 随着越来越多地提出的，辛西娅在去年的势头上被压势。 \n＆＃34;当我第一次开始在erica和＃39之后开始做工作时，那里有幸存者，但他们没有被倾听。 现在他们开始听取。＆＃34;  Kevin Ostajewski拍的巴黎希尔顿的图像。 其他图片提供，并提供盖丁库存。 所有这些都受版权。 ", "note_en": "As one of the most famous faces of the 2000s, people think they know the story of Paris Hilton. So, when the 40-year-old released a YouTube documentary about her life last year, many were shocked to learn about her decades-long struggle with trauma.\n Hilton tearfully recounted how she was woken up by strangers in her bedroom in the middle of the night as a teenager and forcibly taken across the country. She said her unanswered cries for help repeatedly play out in nightmares which make it difficult to sleep.\n Her story, though shocking, is not unique. Hilton is one of thousands of American children sent every year by their parents into a private network of &#34;tough love&#34; residential programmes and schools marketed at reforming their behaviour.\n   &#34;My parents got me kidnapped and dropped off in the middle of the mountains,&#34; 21-year-old Daniel says in a TikTok video watched more than a million times.\n As a teenager, Daniel suffered anxiety and depression. He was 15 and had recently come out as gay when he self-harmed so severely that he required hospital care. It was in hospital that he was shaken awake in the middle of the night by two men. They told him the process could be easy or hard - depending on how much he resisted. With little fight left in him, Daniel went with the pair. But when he asked a stranger if he could use a telephone to call his parents on a brief stop for food, he says the escorts threatened him with handcuffs.\n  Daniel was sent to a wilderness programme in Utah where he spent 77 days living outdoors, hiking miles a day on rations. He vividly remembers feeling cold, hungry and dirty for weeks on end and witnessing others attempt to run away and try to take their own lives. Like many others sent to wilderness programmes, he was then enrolled directly into a long-term facility - this time in Montana - where he would spend another 15 months.\n  The Troubled Teen Industry (TTI) has become an umbrella term for a wide scope of private residential programmes like these aimed at modifying adolescent behaviour. From boot camps to boarding schools, these facilities are marketed as treatment for a broad range of behavioural and mental health issues including eating disorders, drug use and defiance.\n The people who took Hilton and Daniel were from companies specially marketed to families concerned about how their children might react to being enrolled in a programme. These youth transportation services are well-advertised and often come recommended, with parents typically paying a few thousand dollars to have their children taken from their beds and securely dropped off across the country.\n Parents are sometimes referred to the industry by third parties after feeling they have exhausted other means of getting their children help. Programmes sell themselves on high levels of anecdotal success, with testimonials from families and students on their marketing materials and in online reviews describing them as transformative and even life-saving.\n But for years, other former residents have been painting a very different picture of their time within these facilities, including in lawsuits and criminal complaints, alleging emotional and physical abuse.\n  The BBC has spoken to 20 people who identify as troubled teen survivors, aged from 20 to their late 40s, about their experiences within the industry over the last few decades.\n  Although their individual backgrounds and reasons for being sent away differ, patterns emerge across their accounts and the hundreds more shared in TTI survivor support networks online.\n The size of the industry and its yearly turnover of teenagers across the US remains elusive because there is no federal regulator monitoring it.\n   The US Government Accountability Office was tasked with investigating allegations of neglect and abuse across the industry in 2007, but found it difficult to grasp the national picture due to irregular licensing rules at the state level and ambiguity surrounding the labels facilities use to describe themselves - like boot camps or therapeutic boarding schools.\n Their investigators found thousands of allegations of abuse and examined a number of deaths at behavioural programmes across the US and in American-owned businesses operating abroad. Their reports raised concerns about the level of training required of staff as well as what they described as deceptive and questionable marketing practices aimed at parents.\n  Cynthia Clark Harvey was one of them. Her daughter Erica was just 15 when she died of heatstroke and dehydration on her first full day in a wilderness programme in Nevada in 2002.\n  Cynthia remembers her daughter as a bright, thoughtful and athletic young girl who had always done well academically until she began suffering from mental health problems aged 14. Her struggles led her to become suicidal and begin experimenting with illegal drugs. When Erica was admitted to hospital and excluded from school, the family felt frightened and out of their depth.\n   At the time, the situation felt drastic. Erica had been doing better but her psychiatrist recommended that residential treatment could help her path to recovery.\n The programme her family chose was well-known and accredited. They felt reassured Erica was in safe hands and would grow from the experience. After weeks of deliberation and planning, they travelled to Nevada under the guise of a family trip with her younger sister. When the deception was revealed, Erica became scared and angry and refused to get out of the car. After a turbulent hours-long group therapy session with other families, she and the other children were taken away.\n This was the last time Cynthia and her husband ever saw their daughter alive. By the time they got back home to Arizona the following evening, there was already a message waiting on their answering phone telling them to call. They were told Erica had an accident and staff were performing CPR.\n &#34;I don&#39;t remember the time frame, but at that point she probably had been dead already for quite some time,&#34; Cynthia says.\n   Erica&#39;s obituary could only say that she died hiking in Nevada. Her parents would not find out her cause of death for weeks - and it took years and a lawsuit for them to get records and find out the truth of what happened that day.\n Cynthia says they eventually settled with the programme for an undisclosed amount on the condition they could speak freely about the circumstances of their daughter&#39;s death. She learned Erica had been pushed to keep hiking as her condition worsened throughout the day. She later testified to Congress about how her daughter&#39;s distress had been mistaken for teenage belligerence by staff. Even after Erica fell off the trail into brush and rocks, she did not receive medical help for almost an hour.\n The remote location of the trek and a series of blunders in calling help to their location meant it took hours more for an emergency helicopter to arrive and take her to hospital where she was officially declared dead, long past the point her life could have been saved.\n Cynthia continues to grapple with regret and grief over what happened and came to connect with other parents who found themselves in the same unimaginable position. No criminal charges were ever filed over her daughter&#39;s death but 19 years on, Cynthia continues to speak publicly in favour of industry-wide reform.\n The National Association of Therapeutic Schools and Programs (Natsap) - the largest membership association of its kind - appeared on behalf of the industry in the congressional hearings, where it was grilled by lawmakers about the protections and checks in place.\n Natsap&#39;s website today says it and the industry have changed over time. It emphasises that it has ethical standards in place and requires members to be licensed by their appropriate state agency or a national accrediting body and have therapeutic services overseen by a qualified clinician, though it does not accredit facilities themselves.\n Campaigners argue that current levels of oversight are not enough. They say the lack of cohesive national monitoring has allowed bad actors to move around the industry and can enable facilities to rebrand under new names and distance themselves from complaints.\n In online networks they have built, people who identify as survivors of the industry connect and offer support across the country - pooling information and resources to track alleged abuses and a revolving door of programmes and staff. One Reddit forum on the topic has more than 20,000 members alone.\n   While a number of the more controversial programmes and organisations have closed down in recent years, allegations continue to plague the industry. A lot of the stories and experiences former residents recounted to the BBC had a lot in common - whether they got out decades ago or within the last couple of years.\n Many described arrival processes that left them feeling degraded and dehumanised. Those taken by transport companies described the process as disorienting and frightening. Some, including sex abuse victims, complained of invasive strip searches and examinations. One person, who was sent due to struggles with depression stemming from gender dysphoria, recounted undergoing a smear test as a virgin aged 14. Others described having their heads shaved and having blood and drugs testing despite having no history of substance abuse themselves.\n   Some claim to have witnessed and experienced practices like isolation and restraint and say they were also expected to punish and restrain others. Many of the systems they described were based on levels where active participation, including in &#34;attack therapy&#34; sessions where group members are expected to confront and criticise one another, was required to progress and gain basic privileges. Others described arbitrary physical labour, collective punishments and periods of mandated silence which could last weeks.\n They all described repressive environments with extreme limits and censorship of their contact with the outside world. Many believe their parents were misled about the reality of the programmes they enrolled them in, and describe rules that seeded mistrust between them and their families. Some recounted ongoing damage to relationships and enduring fears of opening up about their experiences, even after leaving, for fear of being sent back or not being believed.\n Some told the BBC they witnessed physical violence, self-harm and suicide attempts and many know other residents who took their own lives after leaving. Others have subsequently been diagnosed with conditions like post-traumatic stress disorder and say they continue to suffer long-term social difficulties, including in trusting in others, because of their experience.\n  In 2006, journalist Maia Szalavitz wrote a book that urged parents to seek evidence-based treatment for children instead of resorting to behavioural modification facilities. Her book traces the origins of many of the methods used in the industry, including confrontational group therapy, to controversial and discredited programmes from decades ago.\n Advocates for change say the teenage &#34;tough love&#34; industry, which first began to take off in the 1980s, has been able to endure decades of controversy in part because of social stigma surrounding the issues why parents seek help. It is not uncommon for teenagers to spend years within the system and monthly tuition, sometimes in the thousands, can mount up fast.\n Many, including Szalavitz, believe those referring families can exploit or exaggerate fears children will end up dead or incarcerated because of issues like drug abuse. Both her and Dr Kate Truitt, a clinical psychologist and neuroscientist who works with former residents, say the trauma experienced at these facilities can actually perpetuate or lead to long-term battles with addiction and abusive relationships.\n Many ex-residents, including some the BBC spoke to, say they initially viewed their treatment as justified and even advocated for others to send their children. Some took years to change their opinion of their programme after they reflected on their experiences.\n   Dr Truitt compares the trauma she has seen in some former residents to that experienced by former members of cults or prisoners of war. She points out that their experiences can be particularly damaging as adolescence is such a critical time for development.\n &#34;And because of the type of specific trauma they&#39;ve endured, most survivors don&#39;t feel safe seeking out treatment, because the people who were the treatment providers are the perpetrators,&#34; she tells the BBC.\n  Paris Hilton revealed she had already run away from a number of other placements before she was taken to Provo Canyon in Utah and kept for almost a year before she turned 18.\n The documentary This is Paris shows her reuniting with classmates as they go public with their ongoing trauma from alleged experiences of emotional and physical abuse there, including allegations of punishments like solitary confinement.\n  Provo Canyon remains open. A statement pinned to the top of their website says it was sold to new owners in 2000 and it cannot comment on operations or patient experiences before this time. They also say they do not use methods like seclusion or mechanical restraint now.\n Hilton&#39;s documentary has been watched almost 30 million times and she has continued vocal advocacy since its release.\n This role marks a drastic departure from the persona she built her celebrity brand and business empire around. Although her teenage history was already known among those who went through the same systems, they say having someone as high-profile come forward has helped bring credibility and awareness to the issue.\n People within the community say the documentary has empowered some to speak out about their experience for the first time. or has been used to help others, including parents, understand what they went through.\n   Some former residents have united under the idea of #BreakingCodeSilence, in reference to the periods of mandated social isolation used as a punishment and as a method of control in some facilities.\n &#34;One of the rules in many of these programmes is that you couldn&#39;t take anyone&#39;s phone number or name when you left. So, we were never meant to connect,&#34; Katherine McNamara, who went to Provo with Hilton, says about the groups that have emerged on social media. She and some others are now working together on a non-profit to help raise awareness, support those who identify as survivors and advocate for change.\n Other celebrities, including Paris Jackson and tattoo artist Kat von D, have been inspired by the documentary to come forward.\n Rapper Bhad Bhabie, real name Danielle Bregoli, has called for television personality Dr Phil to apologise for sending her and other teenagers to troubled teen facilities on his popular US show.\n It came after another former guest filed a lawsuit alleging she had been punished for reporting an alleged sexual assault by a staff member at the same therapeutic boarding ranch Bregoli was sent to. The facility, which the BBC contacted for a response, has previously denied the allegations against it and disputed their accounts.\n Phil McGraw said in an interview he was sad to hear of Bregoli&#39;s alleged bad experience but distanced himself and his show from her claims.\n  Younger people, once isolated from their teenage peers because of their experience, are using social media to try and break the stigma. Some have gained huge followings on platforms like TikTok from telling their stories. But none of this is not without personal risk - the BBC has seen legal letters sent to one content creator after they spoke publicly.\n Daniel has gained more than 240,000 followers and millions of likes since he started telling his and other people&#39;s stories last year. He now gets dozens of messages every day from others who went through similar situations and has had parents contact him to say they&#39;ve reconsidered plans to send their children away after seeing his videos.\n &#34;If my 15-year-old self knew that people were out there fighting for me, I would have felt so relieved,&#34; he says about the movement.\n  In some cases, social media has been a tool for tangible change. One woman, Amanda Householder, used TikTok to spread awareness of allegations surrounding her parents&#39; treatment of girls at a religious boarding ranch they were running in Missouri. Millions viewed her videos and eventually officials closed the school.\n   Householder testified to end religious exemptions in the state of Missouri that stopped even basic oversight of conditions at private religious facilities like the one her parents ran. She described the experience to the BBC as &#34;very cathartic… knowing that maybe in the future kids won&#39;t have to go through what we went through&#34; and says she hopes to give evidence in their criminal case.\n Hilton was part of a group who spoke at a hearing to convince lawmakers to introduce better protections in Utah - the state thought to have the biggest density of troubled teen facilities in the US.\n &#34;I don&#39;t know if my nightmares will ever go away, but I do know that there are hundreds of thousands of kids going through this, and maybe if I stop their nightmares, it will help me stop mine,&#34; she testified.\n    But a spokesperson for Democratic Congressman Adam Schiff&#39;s office confirmed to the BBC that he is working to update and re-introduce legislation aimed at prohibiting and ending abuse at residential treatment centres and increasing national oversight of such facilities.\n   &#34;It doesn&#39;t get better as the years go on, because it&#39;s just more milestones that go by,&#34; Cynthia reflects.\n It&#39;s been well over a decade since she took part in hearings pushing for federal regulation. But against all odds, she remains hopeful.\n Cynthia has been emboldened by the momentum building over the last year as more and more have come forward.\n &#34;When I first started doing my work after Erica&#39;s death, there were survivors out there, but they were not being listened to. And now they&#39;re starting to get listened to.&#34;\n Images of Paris Hilton taken by Kevin Ostajewski. Other images were supplied and Getty Stock. All are subject to copyright.", "posttime": "2021-06-19 12:38:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,teens,治疗", "title": "陷入困境的美国青少年被艰难的爱情阵营创伤 ", "title_en": "Troubled US teens left traumatised by tough love camps", "transed": 1, "url": "https://www.bbc.com/news/world-us-canada-57442175", "via": "", "real_tags": ["美国", "teens", "治疗"]}]