[{"category": "", "categoryclass": "", "imagename": "5f6d3e02ac1eb7d9307f6941cc32dbe3.jpg", "infoid": 1001623, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，苹果发布了当前周期的最终MacBook更新。13英寸的MacBook Pro加入了3月的MacBook Air和2019年10月的16英寸MacBook Pro的行列。标题功能是更换键盘，否则MacOS笔记本电脑感觉就像是终于赶上了Windows10驱动的竞争对手。\n但苹果夺回Mac控制权的计划已经泄露。这将从下一轮MacBook开始。这将是过去十年来Mac最彻底的变化之一。\n更换英特尔处理器的过程已经开始。欢迎来到武器革命。\n由于对英特尔的依赖，苹果对包括MacBooks在内的Mac系列的开发控制较少。与iPhone和iPad不同，苹果设计和组织所有关键部件的制造，而MacOS硬件更多来自外部供应商。\n让我们暂时停留在MacBook上，因为有迹象表明，这些将是第一批感受到这场革命的Mac。目前，蒂姆·库克和他的团队都与英特尔处理器捆绑在一起。MacBook的任何更新都与英特尔的开发速度和发布时间表捆绑在一起。最重要的是，苹果的英特尔芯片是定制芯片，这意味着它们将总是落后于Windows10驱动的机器的发布时间表。\n对于一家对产品发布有相对严格的年度时间表的公司来说，新的MacBook是可以随时出现的通配符。当他们真的到来时，他们将在技术方面落后于曲线。\n苹果世界的iPhone和iPad都得益于AXX处理器和各自操作系统之间的紧密集成。苹果可以而且已经偏离了标准的ARM参考设计，以便在需要时支持更大的内核，这导致了更适合iPhone的硅，从而实现了更长的电池续航时间、更好的散热控制，以及可以运行更快和利用更多功率的应用。\n我们不要忘了，英特尔需要支持的合作伙伴数量和硬件配置远远超过MacOS需要处理的数量；因为有太多的合作伙伴，所以这并不总是可能的。另一方面，苹果可以将其处理器与将安装它们的硬件一起开发，由硬件和软件团队来回反馈更改以解决特定问题。\n在需要时提供更多电源…。更好的热性能…。*提高电池续航时间…。这是笔记本电脑的三个关键领域。当苹果控制自己的处理器时，它可以也将做出与Windows10驱动的竞争对手不同的选择。\n这将不是唯一提供的协同效应。苹果在iPhone和iPad内部运行着基于ARM的处理器。考虑到对iPad(尤其是iPad Pro)的推动越来越接近计算机的传统观点(请注意最近添加的正确的键盘和鼠标支持)；以及通过Catalyst在MacOS和iPadOS之间实现跨平台支持的第一步，您可以看到平台正在进入更近的轨道。\n这将极大地帮助运行相同架构的设备，甚至可能运行相同的AXX处理器。这两个平台不太可能完全合并，但代码和用户体验的交叉授粉将会增加。\n苹果的个人电脑阵容相对较小。你有MacBook Air和MacBook Pro笔记本电脑，台式机上有面向消费者的iMac和iMac Pro，还有Mac Pro，专为那些想要高得离谱的功率(和昂贵的轮子)的人准备的。所有这些机器的寿命都很长，预计使用多年。不会出现MacOS从一切Intel到一切ARM的“悬崖边缘”。\n过渡将随时间推移，这意味着对基于英特尔的计算机和软件的持续支持，以及本地ARM支持和模拟层，以便在基于ARM的计算机上运行基于英特尔的应用程序。毫无疑问，它会尽可能地平滑，而且毫无疑问，沿途会有颠簸。\n但最终的结果是，随着苹果不再受制于英特尔，完全控制其处理器的时机和能力，这是一个值得奋斗的目标。", "note_en": "This week saw  Apple release  the final MacBook update in the current cycle. The 13-inch MacBook Pro joins March’s MacBook Air and October 2019’s 16-inch MacBook Pro. The headline feature is the replacement of the keyboard, otherwise the  MacOS laptops feel like they are finally catching up with the Windows 10 powered competition.\n  But Apple’s plans to take back control of the Mac have leaked.  It’s going to start with the next cycle of MacBooks. And it is going to be one of the most radical changes to the Mac in the last decade.\n  The process to replace Intel’s processors has begun.  Welcome to the ARM revolution.\n       Thanks to the reliance on Intel, Apple has less control over the development of the Mac range, including the MacBooks. Unlike the iPhone and iPad, where Apple designs and organises the manufacturing of all the key components, more of the MacOS hardware comes from external suppliers.\n  Let’s stay with the MacBooks for the moment,  as indications are these will be the first Macs to feel the revolution. Right now,Tim Cook and his teams are tied to Intel processors. Any updates to the MacBook are tied towards Intel’s development speed and release schedule. On top of that, Apple’s Intel chips are custom chips which means they will always lag behind the release schedule of Windows 10 powered machines.\n    For a company that has a relatively regimented annual schedule for product launches, new MacBooks are wildcards that can show up at any time. When they do arrive, they are going to be behind the curve in terms of technology.\n    The iPhones and iPads of Apple’s world all benefit from the tight integration between the Axx processors and the respective operating systems. Apple can and has deviated away from the standard ARM reference designs to allow for larger cores where required, This leads to silicon that is far better suited to the iPhone, allowing for better battery life, improved thermal control, and applications which can run faster and leverage more power.\n  Let’s not forget that Intel has to support a number of partners and far more hardware configurations than MacOS has to deal; with so many parters that this is not always possible. Apple on the other hand can take its processors and develop them alongside the hardware they will be installed in, with hardware and software teams feeding changes backwards and forwards to solve specific problems.\n  More power when needed… better thermal performance… improved battery life… These are three areas that are key for laptops. When Apple takes control of its own processors it can and will make different choices compared to the Windows 10 powered competition.\n  This will not be the only synergy on offer. Apple has ARM-based processors running inside the iPhone and the iPad. Given the push towards the iPad (and especially the iPad Pro) as growing closer towards the traditional view of a computer (take note of the proper keyboard and mouse support recently added); and the first steps towards cross platform support between MacOS and iPadOS with Catalyst and you can see the platforms moving into closer orbits.\n  This would be helped immensely by the devices running the same architecture, perhaps even the same Axx processor. It’s unlikely that the two platforms will fully merge, but the cross-pollination of code and user experience will increase.\n    Apple’s personal computer line-up is relatively small. You have the MacBook Air and MacBook Pro laptops, the consumer focused iMac and iMac Pro on the desktop, and the Mac Pro for those looking for a ridiculous amount of power (and expensive wheels). All of these machines are long-lived with multiple years of expected use. There’s not going to be a ‘cliff-edge’ where MacOS goes from everything Intel to everything ARM.\n  The transition will be over time, and that means ongoing support for the Intel based machines and the software, as well as native ARM support and an emulation layer to run Intel based apps on the ARM powered machines.  No doubt it will be made as smooth as possible, and no doubt there will be bumps along the way.\n  But the end result, with Apple no longer beholden to Intel and in full control of the timing and capabilities of its processors is a goal worth fighting for.", "posttime": "2020-05-11 15:27:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,苹果,apple,macbook-pro,macbook", "title": "苹果泄密披露激进的新款MacBook Pro", "title_en": "Apple Leaks Reveal Radical New MacBook Pro", "transed": 1, "url": "https://www.forbes.com/sites/ewanspence/2020/05/09/apple-macbook-pro-macbook-air-mac-imac-air-intel-arm-change/", "via": "", "real_tags": ["app", "苹果", "apple", "macbook"]}, {"category": "", "categoryclass": "", "imagename": "a536f8a903505664c45a0c5d8cf71f69.jpeg", "infoid": 1001622, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "帝国理工学院的建模人员几天前发布了关闭世界经济的模型的源代码。它不是原始的模型代码，而是被交给志愿者程序员的原始源代码，他们重新编写了它，使其更具可读性。我过去曾对金融模型做过一些模型审查，但如果没有源代码，我将无法对帝国理工学院的模型进行全面审查。现在我们有了源代码(某种程度上)，我可以了。\n任何这样的模型在用于真正的政策决策之前，都应该经过独立的审查。政策分析充斥着模型，但从来没有人真正检查过它们。展望未来，卫生政策制定者在使用任何模型的结果提出任何后果的建议之前，应该要求并披露对任何模型的独立验证。\n通常，模型评审是很长的技术文档，但也会有总结部分。以下是我认为摘要应该是什么样子的。\n--在“报告9-非药物干预措施降低冠状病毒死亡率和医疗保健需求的影响”中使用了审查中的模型，以预测未减轻和减轻的预测。英国和美国冠状病毒造成的死亡人数和其他统计数据。在那份报告中，该模型被用来预测，如果没有强制的社会疏远政策，美国将有超过200万人死亡，英国将有超过50万人死亡。然而，该模型估计，如果采取特定的社会疏远政策，死亡人数将显著减少。\n在这篇综述中，我们检查了1)模型文档；2)模型实现；3)模型逻辑；4)代码正确性测试的有效性；5)与替代模型的基准比较；以及6)样本预测性能。在使用模型之前，这些类别中的任何一种的任何实质性缺陷都应该得到纠正。不幸的是，这种模式在每一类中都有严重的缺陷。\n1.文件：用于冠状病毒估计的模型与其作者在大约15年前的前两篇论文中在以前的学术工作中使用的模型相同：“遏制东南亚新出现的流感大流行的策略”和“减轻流感大流行的策略”，这两篇论文都发表在“自然”杂志上。每篇论文都有记录模型的技术附录。\n好的模型文档应该满足两个条件：1)文档应该足够详细，独立的、合格的建模人员应该能够从文档中重构结果，而不需要看到代码；2)代码应该实现文档中的内容。\n文档在两个方面都失败了。虽然有足够的细节来理解模型是如何工作的，但我们不能重建报告的数字，因为没有提供该模型用于冠状病毒大流行的新用途的文件。此外，我们没有得到原始源代码，并且提供的源代码没有用于生成报告估计的原始输入数据。因此，我们无法验证代码是否如文档所说的那样做，或者它是否产生了报告9：非药物干预(NPI)降低冠状病毒死亡率和医疗需求的影响中报告的估计，即在没有政府强制社会距离的情况下，美国超过200万人和英国超过50万人将死亡。\n不幸的是，我们没有原始源代码。我们有一些由帝国理工学院建模人员提供的代码，显然是用c编写的单个文件，然后由志愿者重新分解成更具可读性的代码，函数和文件被拆分，也是用c编写的。\n由于我们没有原始源代码，我们不能很明显地对其进行评估。但是，由于所提供的是原始源代码的清理版本，我们可以在合理的假设下对其进行评估，即原始源代码可能会有更多问题。\n虽然新版本中有许多项目可能会受到批评，但在本摘要中，我们强调广泛使用全局变量，特别是c语言结构来建模数据类型。全局变量和结构的使用使得程序逻辑很难遵循，并且它没有将数据与一般的程序算法隔离开来。这两种做法都会导致错误。难以遵循的逻辑会产生错误，即使是非常了解程序的程序员也会犯错误。而且，使用非常大量的全局可访问变量为数据在不经意间更改提供了机会。\n将类放入C++中是为了隐藏数据，并将类与操作类的函数相关联，这样数据结构就可以像对象一样工作。虽然帝国理工学院的程序员使用的是C++编译器，但他们没有利用它的任何面向对象的好处。至少，应该删除全局变量，并将结构更改为类，以便将程序使用和修改的大量数据与通用程序隔开，只允许特权函数修改这些数据。仅此微小的更改就会降低数据因程序逻辑中的错误而意外更改的可能性。一般来说，对于这种复杂的程序，应该大力考虑面向对象的编程技术。\n回到代码应该实现文档所说的内容这一点，例如，我们找不到重写的代码实现文档中的声明，即传染性参数被建模为伽马分布。它可能就在那里，但是代码中缺少注释和代码逻辑的一般错综复杂的性质使得这种说法很难验证。但在编写良好的代码中，应该很容易验证。\n随机数生成器的代码非常旧。它似乎是在20世纪80年代编写的，并且是从PASCAL或FORTRAN机器翻译过来的。现在有更好的随机数生成器可用。更新这部分代码将非常容易。\n结论：在使用模型之前应该重写代码，并且应该验证代码实现了模型文档中的内容。\n该模型基本上是对易感、传染病、恢复期(SIR)模型的离散时间微观模拟。标准SIR通常是在总体水平上制定的，而没有区分个人传染性、家庭人口结构、个人之间的距离等细节。在微观水平上制定模型的好处是可以直接进行社会距离实验。缺点是必须指定大量参数。不管怎样，如果模型的目标是量化社会疏远政策的效果，微观模拟方法似乎是实现SIR类型模型的合理方式。\n然而，无论是在微观层面还是宏观层面，这些模型的致命问题是它们假设代理人是僵尸。在僵尸电影中，无论有多少僵尸被受害者击中头部，僵尸总是不断出现。他们似乎没有注意到。同样，这些SIR模型中的特工，帝国理工学院的模型也不例外，总是以完全相同的方式行事，即使他们周围有大量的人在死去。然而，这一假设与流行病历史(包括当前的大流行)相矛盾，历史表明，人们为了在流行病中保护自己，会显著改变自己的行为。\n这些模型中的僵尸假设导致了一个错误的政策困境-要么我们接受数百万人的死亡，要么我们实施严格的政府限制，这可能会将预测的死亡人数减少75%。但这是一个无效的比较。社会疏远政策被比作是一种不可能也不会发生的僵尸替代方案。当人们观察到流行病时，他们会自己与社会保持距离。要真正有用，该模型应该比较如果人们内生的社会距离会发生什么，与如果政府施加额外限制会发生什么。由于它无法做到这一点，该模型无法帮助量化实际的权衡。\n我们所依赖的任何产品质量代码都应该始终具有一系列测试，以验证代码在不同的初始条件下是否提供了预期的结果。这些测试对于检查代码是否正确实现以及对代码的更改是否没有引入新错误非常重要。代码似乎没有这样的测试。\n尽管测试如此复杂的模型可能看起来很困难，但良好的测试对于获得对模型的信心是必要的。\n在判断输出模型时，重要的是实现替代基准模型。似乎还没有开发出这样的模型。然而，作为这项审查的一部分，我们实施了一个简单的基准来验证在完全不减轻的情况下由模型产生的死亡数字是否合理。\n帝国理工学院模型也坚持这些SIR型模型中最重要的假设，即感染的概率服从指数分布。通过从微观仿真中抽象出来，我们使用了一个简单的宏观SIR基准模型，在该模型中，指数分布假设暗示了R0与最终感染百分比之间的关系。使用该模型0.9%的死亡率，我们可以使用该关系来近似英国基准模型中的总死亡人数，并将其与报告9：非药物干预(NPIs)降低冠状病毒死亡率和医疗保健需求的影响表4中报告的模型估计进行比较。我们不应期望简单的宏观基准给出与微观版本相同的答案，但它们应该具有相同的数量级。\n从下表可以看出，帝国理工学院模型对英国在不同R0值的情况下死亡人数的估计是可信的，考虑到基准结果，这应该会让我们感到安慰，即使代码中有错误，该模型也可能给出合理的估计，至少对于不减轻的情况是这样。\n任何一个模型的酸性检验都是看它是否能成功地预测出样本。目前还没有证据表明该模型具有预测能力。然而，我们确实有一个自然的实验可以依靠。\n在针对冠状病毒的干预策略及其对瑞典医疗保健能力的估计影响中，该研究的作者重新实施了帝国理工学院的模型，并将其应用于瑞典。对模型文档和模型源代码(也是用c语言和GitHub编写的)的检查表明，这是同一个模型。瑞典版的模型清楚地预测了，如果瑞典遵循其宣布的自由放任的社会疏远政策，瑞典将发生的死亡人数，以及如果遵循与美国和英国类似的各种其他政策，这些死亡人数将减少多少。在论文图4的图表A中，到5月9日撰写本综述时，该模型预测，如果瑞典遵循其宣布的政策，将有大约10万人死亡，如果瑞典采取最严格的社会疏远政策，将有大约25K人死亡。5月9日，瑞典的实际死亡人数为3175人。因此，该模型大量高估了死亡人数。僵尸假设可能是问题所在。\n总体结论：不能依赖该模型来指导冠状病毒政策。即使文档、编码和测试问题得到修复，模型逻辑也存在致命缺陷，这从其糟糕的预测性能中可见一斑。", "note_en": "The Imperial College modelers released the source code a couple of days ago to the model that shut down the world economy. It&#39;s not the original model code but was rather original source code turned over to volunteer programmers who re-wrote it so that is more readable. I have done some model review of financial models in the past but without the source code I would not be able to do a full review of the Imperial College model. Now that we have the source code (sort of), I can.\n Any such model ought to have been independently reviewed before it is ever used for real policy decisions. Policy analysis is awash in models but no one ever really checks them. Going forward, health policy makers should ask for and disclose independent validation of any model before using its results to make recommendations of any consequence.\n Normally, model reviews are long technical documents but there would also be a summary section. Here&#39;s what I think a summary should have looked like.\n -----------------------------------------------------------------------------------  The model under review was used in “Report9 - Impact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand“ to predict unmitigated and mitigated forecasts of fatalities and other statistics in the U.K. and the US as a result of Covid-19. In that report, the model was used to predict that over 2 million deaths in the US and over 500K deaths in the UK would occur without mandated social distancing policies. However, the model estimates significant reductions in fatalities if specific social distancing policies are adopted.\n In this review, we examined 1) the model documentation; 2) the model implementation; 3) the model logic; 4) the effectiveness of code correctness tests; 5) benchmarking against alternative models; and 6) out of sample forecasting performance. Any material deficiency in any of these categories should be corrected before the model is used. Unfortunately, the model has serious defects in each category.\n 1. Documentation: The model used for the coronavirus estimation is the same its authors had used in previous academic work about 15 years ago in two previous papers: &#34;Strategies for containing an emerging influenza pandemic in Southeast Asia&#34; and &#34;Strategies for mitigating an influenza pandemic,&#34; both published in Nature. Each paper has a technical appendix that document the model.\n Good model documentation should satisfy two conditions: 1) the documentation should be detailed enough that an independent, properly qualified modeler should be able to reconstruct the results just from the documentation, without seeing the code; and 2) the code should implement what is in the documentation.\n The documentation fails on both fronts. Although there are enough details to understand how the model works, we cannot reconstruct the reported numbers since there was no documentation provided for the model&#39;s new use for the coronavirus pandemic. Moreover, we were not provided the original source code, and the source code that was provided does not have the original input data used to produce the reported estimates. We cannot verify, therefore, that the code does what the documentation says it does or that it produced the estimates reported in &#34;Report 9: Impact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand&#34; that over 2 million in the US and over 500K in the UK would die in the absence of government mandated social distancing.\n   Unfortunately, we do not have the original source code. What we do have is some code that was provided by the Imperial College modelers, in apparently a single file written in c, which was then re-factored by volunteers into more readable code, with functions and files broken up, also written in c.\n Since we don&#39;t have the original source code, we cannot evaluate it obviously. But since what has been provided is a cleaned up version of the original source, we can evaluate it under the reasonable hypothesis that the original source code would have had even more problems.\n Although there are many items in the new version that could be criticized, in this summary we emphasize the widespread use of global variables and in particular c-language structs to model data types. The use of global variables and structs makes the program logic very hard to follow and it does not isolate the data from general program algorithms. Both practices lead to bugs. Logic that is difficult to follow produces mistakes even by programmers who know the program well. And using a very large number of globally accessible variables opens up the opportunity for data to be changed inadvertently.\n Classes were put into C++ to hide the data and to associate classes with functions that operate on them, so that data structures can behave like objects. Although the Imperial College programmers were using a C++ compiler, they did not use any of its object-oriented benefits. At the very least, global variables should be eliminated and the structs should be changed to classes, so that the voluminous data used and modified by the program is walled off from the general program, with only privileged functions allowed to modify that data. Just this minor change would reduce the chance that data is accidentally changed by a mistake in the program logic. In general, object-oriented programming techniques should be strongly considered for a program of this complexity.\n Going back to the point that the code should implement what the documentation says, we could not find, for example, where the re-written code implements the claim in the documentation that the infectiousness parameter is modeled as a gamma distribution. It may be in there, but the dearth of comments in the code and the general convoluted nature of the code logic makes that claim difficult to verify. But in well-written code it should be easy to verify.\n The code for the random number generators is very old. It appears to have been written in the 1980s and machine translated from either Pascal or FORTRAN. Much better random number generators are available today. It would be very easy to update this section of the code.\n Verdict: The code should be re-written before the model is used and it should be validated that the code implements what is in the model documentation\n  The model is basically a discrete time microsimulation of an Susceptible, Infectious, Recovered (SIR) model. The standard SIR is often formulated at an aggregate level without differentiating the details of individual infectivity, household demographics, distance between individuals, etc. The advantage of formulating the model at a micro level is that social distancing experiments can be straightforwardly done. The disadvantage is that a large number of parameters must be specified. Nonethless, if the goal of the model is to quantify the effect of social distancing policies, the microsimulation approach seems a reasonable way to implement an SIR-type model.\n However, whether formulated at the micro or macro level, the fatal problem with these models is that they assume agents are zombies. In zombie films, the zombies always keep coming no matter how many zombies are shot in the head by their victims. They do not seem to notice. Similarly, agents in these SIR models, and the Imperial College model is no exception, always behave exactly the same way, even though huge numbers of people are dying all around them. That assumption, however, is contradicted by the history of epidemics (including the current pandemic) which shows that people alter their behavior significantly to protect themselves in an epidemic.\n The zombie assumption in these models leads to a false policy dilemma-either we accept millions of deaths or we institute draconian government restrictions that may reduce that predicted fatality number by 75%. But that is an invalid comparison. The social distancing policies are being compared to a zombie alternative that cannot happen and will not happen. People will social distance on their own when they observe an epidemic. To be really useful, the model should compare what would happen if people endogenously social distanced to what would happen if the government imposed additional restrictions. Since it cannot do that, the model cannot help quantify the actual tradeoffs.\n   Any production quality code that we rely on should always have a series of tests that verify that the code is giving expected results under different initial conditions. These tests are important to check whether the code is correctly implemented and also whether changes to the code did not introduce new bugs. The code seems to have no such tests.\n Although testing such a complicated model may seem difficult, good testing is necessary to gain confidence in the model.\n   In judging the output model, it is important to implement alternative benchmark models. No such models seem to have been developed. However, as part of this review we have a implemented a simple benchmark that validates whether the fatality numbers produced by the model in the unmitigated case are sensible.\n The most important assumption in these SIR type models, which the Imperial College model also maintains, is that the probability of being infected follows an exponential distribution. By abstracting away from the micro simulation we use a simple macro SIR benchmark model, in which the exponential distribution assumption implies a relation between R0 and the final percentage infected. Using the model&#39;s fatality rate of 0.9%, we can use that relationship to approximate what the total number of deaths should be in the benchmark model for the UK and compare it to the model estimates as reported in Table 4 of &#34;Report 9: Impact of non-pharmaceutical interventions (NPIs) to reduce COVID-19 mortality and healthcare demand.&#34; We should not expect the simple macro benchmark to give the same answer as the micro version, but they should be of the same order of magnitude.\n As can be seen in the table below, the Imperial College model&#39;s estimates of fatalities for the UK for various values of R0 in the unmitigated case are credible given the benchmark results , which should give us comfort that even if there are bugs in the code, the model is likely giving reasonable estimates, at least for the unmitigated case.\n   The acid test for any model is whether it can predict successfully out of sample. There has been no evidence offered of the model&#39;s ability to forecast. However, we do have a natural experiment to fall back on.\n In &#34;Intervention strategies against COVID-19 and their estimated impact on Swedish healthcare capacity,&#34; the authors of that study re-implemented the Imperial College model and applied it to Sweden. An examination of the model documentation and the model source code (also written in c and on github), shows it is the same model. The Swedish version of the model made clear short term predictions of the number of fatalities that would occur in Sweden if it followed its announced laissez-faire policy of social distancing and how much those fatalities would be reduced if various other policies were followed that are similar to those employed in the US and the UK. In chart A of figure 4 in the paper, by May 9 when this review was written, the model predicts about 100K deaths if Sweden followed its announced policy and about 25K deaths if it adopted the most stringent social distancing policies. On May 9, the actual number of fatalities in Sweden was 3,175 deaths. Thus, the model massively over-predicted fatalities. The zombie assumption is the likely problem.\n Overall conclusion: this model cannot be relied on to guide coronavirus policy. Even if the documentation, coding, and testing problems were fixed, the model logic is fatally flawed, which is evidenced by its poor forecasting performance.", "posttime": "2020-05-11 15:27:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流行病学,imperial,模型", "title": "国子监流行病学模式分析", "title_en": "Analysis of the Imperial College Epidemiological Model", "transed": 1, "url": "https://m.facebook.com/scarlett.strong.1/posts/252437219500976", "via": "", "real_tags": ["流行病学", "imperial", "模型"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001621, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于精通SQL的人来说，我得到的一个常见问题是，如果您完成了课程和全部150多个练习，此时您将对SQL有很强的掌握能力，并且可以轻松编写各种复杂的查询。然而，有效地使用数据库还有更多的内容--您可能会开始对数据库设计、性能、事务、锁定、日志记录、安全性、配置等话题感兴趣。或者，您可能想更深入地研究您正在使用的数据库的特定功能(例如，Microsoft SQL Server、MySQL、PostgreSQL等)。\n所以，我已经把我推荐的一些书和录像带整理了一个简短的清单。注意，大多数资源都集中在关系数据库上，因为它是我的掌舵人(我发现Postgres在紧要关头也可以成为一个非常棒的非关系数据库，这要归功于一些很棒的扩展)。好好享受吧！\n为了最大限度地利用您正在使用的数据库，特别是在性能方面，您需要更多地了解它是如何在幕后工作的。我推荐两个很棒的资源。\n这门课的讲师是卡内基梅隆大学(Carnegie Mellon University)的安迪·帕夫洛(Andy Pavlo)，他相当奇特，但总是很有趣(我相信他会认为开场白是一种恭维)，这是一门非常棒的数据库内部入门课程。所有讲座都可以在YouTube上获得，内容涵盖从索引到事务、日志记录以及如何实现不同的查询算法等方方面面。同样奇妙的是，你可以访问完整的课程课程，包括作业和项目，如果你想要一些动手练习的话，你可以自己完成这些作业和项目。\n我最近才开始学习这些讲座，但从我到目前为止看到的情况来看，它们和入门内容一样优秀。重点似乎特别放在介绍入门课程中引入的更严格的概念上。\n解释SQL性能的伟大之处在于，它只从一点理论开始(涵盖B树和索引的真正含义)，然后很快就进入了一个巨大的节奏，缓慢地、一点一滴地构建查询，然后查看并解释它们的执行计划。这样，您就对编写查询的不同方式如何改变执行计划建立了非常牢固的基础理解。它也与数据库无关，因此无论您使用的是Oracle还是MySQL等，这些概念都同样适用。\nSQL反模式涵盖了大约25种不同的所谓反模式，涉及数据库设计、查询编写以及软件开发堆栈。每个反模式都伴随着对它是什么的描述、您通常想要避免它的原因以及解决方案。我认为这是一本很棒的第一本书，适合那些对SQL和数据库设计都很熟悉的人，并且准备退一步，不仅反思数据库和查询设计的内容，而且反思数据库和查询设计的方式和原因-这会促使人们反思，例如，一个大查询是否真的应该写成几个较小的查询(第18章：意大利面查询)等等。如果你已经准备好迈出第一步，这是一个很好的选择。\n“SQL的艺术”是继SQL反模式之后的一本好书-从很多方面来说，它是抽象阶梯上的一个台阶，更多地反映了编写正确的SQL的策略和方法，这些策略和方法将经受住时间的考验(同时还引用了孙子的“孙子兵法”)。“SQL的艺术”是一本值得一读的书，在许多方面，它是抽象阶梯上的一个台阶，反映了更多关于编写经得起时间考验的正确SQL的策略和方法。如果这一切对你来说听起来有点太自命不凡--就像我刚开始那样--别担心，孙子的东西是保持在最低限度的，你基本上可以忽略它。正如我看到另一位评论家提到的那样，这不是一本烹饪书，它不会教你食谱，但它会让你成为一名更好的厨师--我认为这是一个很棒的表达方式。\n在我的职业生涯中，我广泛使用过两个数据库-PostgreSQL和SQL Server。因此，我只能分享这些建议。如果您对MySQL、Oracle等有什么推荐，请告诉我！\n虽然现在你会发现很多人说只要使用Postgres就行了，但不幸的是，关于如何管理PostgreSQL、如何安全地设置PostgreSQL、如何在生产中运行等方面的优秀指南并不多。不幸的是，这本书并没有完全解决这个问题--但它至少对你有所帮助。它介绍了如何执行一些核心数据库管理任务(设置用户、角色、备份和恢复)、psql和pgAdmin的使用，以及如何设置复制。如果这对您来说是一个新领域，这是一本让您开始使用PostgreSQL管理的好书。\nPostgreSQL的艺术是Postgres的主要贡献者Dimitri Fontaine写的一本伟大的书。我喜欢这本书的地方是它完全专注于PostgreSQL可以为您做什么，无论是在特殊的PostgreSQL特定数据类型方面、SQL增强方面、编写PL/pgSQL函数方面，还是使用内置的通知系统方面-本书没有试图向您展示ANSI方法。这本书让我对波斯格雷斯有了更深刻的欣赏。\nMicrosoft SQL Server是我广泛使用的第一个数据库，我第一次学习SQL是通过Itzik Ben-gan的T-SQL基础的早期版本。所以我真的很高兴在这里推荐T-SQL查询。这是一本内容丰富的大书，可能是整个书单中最高级的一本书。与你坐下来从头到尾阅读的东西相比，它真的更像是一本参考书。我个人发现，在以前的公司实现一些分析仪表板时，对于BI从业者来说，关于窗口函数和T-SQL的章节非常有价值。", "note_en": "For people who&#39;ve worked through  Mastery with SQL, a common question I get is &#34;What&#39;s next?&#34; If you completed the course and all 150+ exercises, at this point you&#39;ll have a very strong grasp of SQL and should be comfortable writing all sorts of complex queries. However, there&#39;s more to working with databases effectively - you might start to become interested in topics like database design, performance, transactions, locking, logging, security, configuration, and much more. Or you might want to dive deeper on the specific capabilities of the database you&#39;re using (e.g. Microsoft SQL Server, MySQL, PostgreSQL, etc.).\n  So, I&#39;ve put together a brief list of some of the books and videos I recommend. Note that most of the resources are focused around  relational databases since that&#39;s my wheelhouse (and I&#39;ve found that Postgres can be a pretty awesome  non-relational database in a pinch too thanks to some great extensions). Enjoy!\n    To get the most out of whatever database you&#39;re using, particularly when it comes to performance, you&#39;re going to want to understand more about how it works under the hood. There are two great resources that I recommend.\n     Taught by the rather peculiar but always funny  Andy Pavlo from Carnegie Mellon University (I&#39;m sure he&#39;d consider that opener a compliment), this is a fantastic first course in database internals. All lectures are fully available on YouTube, covering everything from indexes to transactions, logging, and how different query algorithms get implemented. What&#39;s fantastic as well is that you can access the full course curriculum, including the  assignments and projects which you can work along on your own if you want some hands-on practice.\n     I&#39;ve only recently started my way through these lectures, but from what I&#39;ve seen so far, they&#39;re equally as excellent as the starter content. The focus in particular seems to be on introducing a bit more rigor to concepts introduced in the introductory lectures.\n        What&#39;s great about  SQL Performance Explained is that it starts with just a little bit of theory (covering B-trees and what an index really is) and then very quickly jumps in to a great rhythm of slowly, bit by bit, building up queries and then looking at and explaining their execution plans. In this way, you build up a very strong foundational understanding of how the different ways you can write a query alter the execution plan. It&#39;s database agnostic as well, so the concepts apply equally regardless of whether you&#39;re using Oracle, MySQL, etc.\n      SQL Antipatterns covers 25 or so different so-called  antipatterns, across the spectrum of database design, query writing, and in to the software development stack. Each anti-pattern is accompanied by a description of what it is, why you generally want to avoid it, and a solution. I think it&#39;s a great first book for someone who is comfortable with both SQL and database design and is ready to take a first step back and reflect on not just the what, but the  how and  why of database and query design - prompting reflection on, for example, whether a big query should really be written as several smaller queries (Chapter 18: Spaghetti Query), etc. If you&#39;re ready to take that first step, this is a good one.\n      The Art of SQL is a great book to read after  SQL Antipatterns - in many ways, it&#39;s a step up the ladder of abstraction, reflecting more on strategies and approaches to writing correct SQL that will stand the test of time (and along the way making allusions to Sun Tzu&#39;s  The Art of War). If that all sounds a little bit too pretentious to you - as it did me, at first - don&#39;t worry, the Sun Tzu stuff is kept to a minimum and you can mostly ignore it. As I saw one other reviewer mention, this isn&#39;t a cookbook and it won&#39;t teach you recipes, but it will make you a better cook - I think that&#39;s a fantastic way to put it.\n    There are two databases that I&#39;ve worked extensively with in my career - PostgreSQL and SQL Server. So, I can only share recommendations for these. If you&#39;ve got any recommendations for MySQL, Oracle, etc.  let me know!\n      While you&#39;ll find a lot of people these days who say &#34;Just use Postgres&#34;, unfortunately, there aren&#39;t that many great guides on how to administer PostgreSQL well, how to set it up securely, how to run it in production, etc. Unfortunately, this book doesn&#39;t completely address that problem - but it does get you at least some of the way. It covers how to do some core database administrative tasks (setup users, roles, backup and restoring), use of psql and pgAdmin, and also how to setup replication. A good book to get you started with PostgreSQL administration if this is a new area for you.\n      The Art of PostgreSQL is a great book written by Dimitri Fontaine, a major contributor to Postgres. What I love about the book is its full focus on just what PostgreSQL can do for you, whether it be in terms of special PostgreSQL specific data types, SQL enhancements, writing PL/pgSQL functions, or using the built-in notification system - this book makes no attempt to show you the ANSI way. This book gave me a far deeper appreciation for Postgres.\n        Microsoft SQL Server was the first database I worked with extensively and I first learned SQL working through an earlier edition of Itzik Ben-gan&#39;s  T-SQL Fundamentals. So I&#39;m really happy to recommend here  T-SQL Querying. This is a big meaty book and is probably the most advanced book in the entire list. It&#39;s really closer to a reference vs something you sit down and read end-to-end. I personally found the chapters on window functions and T-SQL for BI practitioners to be invaluable when implementing some analytics dashboards at a previous company.", "posttime": "2020-05-11 15:04:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,书籍,sql", "title": "高级SQL和数据库书籍和资源", "title_en": "Advanced SQL and database books and resources", "transed": 1, "url": "https://www.neilwithdata.com/advanced-sql", "via": "", "real_tags": ["database", "数据库", "书籍", "sql"]}, {"category": "", "categoryclass": "", "imagename": "798aedf736dd5414ce322b1682d16198.jpeg", "infoid": 1001619, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Mac Pro Wheels Kit，让您的Mac Pro骑在轮子上。定制设计的不锈钢和橡胶轮子让您可以轻松地移动Mac Pro，无论它是从办公桌下面滑出来还是从工作室滑出来。\n需要安装。包括1/4英寸到4毫米的六角钻头，但还需要其他工具。用轮子替换Mac Pro脚部会使框架的高度增加大约一英寸。", "note_en": "Put your Mac Pro on wheels with the Mac Pro Wheels Kit. The custom-designed stainless steel and rubber wheels make it easy to move your Mac Pro around, whether sliding it out from under your desk or across your studio.\n  Installation required. A 1/4-inch to 4 mm hex bit is included, but additional tools are necessary. Replacing the Mac Pro feet with wheels adds approximately one inch to the height of the frame.", "posttime": "2020-05-11 14:42:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,apple,pro,mac", "title": "699美元的Apple Pro Wheels", "title_en": "$699 Apple Pro Wheels", "transed": 1, "url": "https://www.apple.com/shop/product/MX572ZM/A/apple-mac-pro-wheels-kit", "via": "", "real_tags": ["app", "apple", "pro", "mac"]}, {"category": "", "categoryclass": "", "imagename": "93c55817a879a74830e606ee64e9ce27.jpeg", "infoid": 1001617, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此功能尚未发布，因为它使用的是不稳定的VS代码API。此功能在VS代码的下一版本中可能会稳定。\n您可以直接编辑和保存.drawio.png文件。这些文件是完全有效的PNG图像，其中包含嵌入的Draw.io图表。每当您编辑这样的文件时，该文件的PNG部分都会保持最新。这允许您在GitHub上的自述文件中包含Draw.io图表！\n您可以使用Draw.io编辑器和XML文件打开相同的*.drawio文件。它们是同步的，因此您可以根据需要在它们之间切换。如果您想要使用查找/替换来重命名文本或VS代码的其他功能以加快图表创建/编辑过程，这是非常实用的。使用文件：重新打开.。命令在文本或Draw.io编辑器之间切换。您可以为同一文件打开多个编辑器。\nDraw.io-这个扩展依赖于Draw.io的巨大工作。它们的嵌入功能支持此扩展！此扩展捆绑了最新版本的Draw.io。\nTasks Statusbar：此扩展向状态栏添加按钮，以快速启动和终止任务。", "note_en": "This feature is not released yet as it uses unstable VS Code APIs. This feature might be stable in the next release of VS Code .\n You can directly edit and save  .drawio.png files.These files are perfectly valid png-images that contain an embedded Draw.io diagram.Whenever you edit such a file, the png part of that file is kept up to date.This allows you to include Draw.io diagrams in readme files on github!\n   You can open the same  *.drawio file with the Draw.io editor and as xml file.They are synchronized, so you can switch between them as you like it.This is super pratical if you want to use find/replace to rename text or other features of VS Code to speed up your diagram creation/edit process.Use the  File: Reopen With... command to toggle between the text or the Draw.io editor. You can open multiple editors for the same file.\n   Draw.io - This extension relies on the giant work of Draw.io. Their embedding feature enables this extension! This extension bundles a recent version of Draw.io.\n   Tasks Statusbar: This extension adds buttons to the status bar to quickly start and kill tasks.", "posttime": "2020-05-11 13:13:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,diagrams,文件", "title": "使用Draw.io在VS代码中创建图表", "title_en": "Create Diagrams in VS Code with Draw.io", "transed": 1, "url": "https://github.com/hediet/vscode-drawio", "via": "", "real_tags": ["代码", "diagrams", "文件"]}, {"category": "", "categoryclass": "", "imagename": "4bea9038b0329c1864957d6da2f149c0.jpg", "infoid": 1001616, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学长期与世界贸易和现代技术隔绝，古巴发展了一种强大的DIY工程师文化，他们将家居用品变成有用的发明。水泵马达推动自行车，干衣机被改装成椰子粉碎机。古巴艺术家欧内斯托·奥尔扎(Ernesto Orza)在过去的十年里一直在拍摄和收集其中的许多作品。在我们的科学星期三文章中阅读更多关于古巴发明的信息，共产主义如何将古巴变成黑客和DIY工程师的岛屿。", "note_en": "Science        Long walled off from world trade and modern technology, Cuba has developed a robust culture of DIY engineers who turn household items into useful inventions. Water pump motors propel bicycles, clothes dryers are repurposed into coconut shredders. Cuban artist Ernesto Orza has spent the last decade photographing and collecting many of these creations. Read more about Cuban inventions in our Science Wednesday piece,  How communism turned Cuba into an island of hackers and DIY engineers.", "posttime": "2020-05-11 13:12:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "diy,brilliant,古巴", "title": "古巴DIY工程师的奇特、辉煌和有用的发明(2015)", "title_en": "The bizarre, brilliant and useful inventions of Cuban DIY engineers (2015)", "transed": 1, "url": "https://www.pbs.org/newshour/science/bizarre-brilliant-useful-inventions-cuban-diy-engineers", "via": "", "real_tags": ["diy", "brilliant", "古巴"]}, {"category": "", "categoryclass": "", "imagename": "2d4007b3f20b24fa5c7822b2ecdfa423.jpeg", "infoid": 1001614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "⛵️Istio Resources🕸.。通过在GitHub上创建帐户，为askmeegs/Learning-istio开发做出贡献。", "note_en": "⛵️ Istio resources 🕸. Contribute to askmeegs/learn-istio development by creating an account on GitHub.", "posttime": "2020-05-11 12:50:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "istio", "title": "学习Istio：服务网格和Istio资源列表", "title_en": "Learn Istio: A Service Mesh and Istio Resource List", "transed": 1, "url": "https://github.com/askmeegs/learn-istio", "via": "", "real_tags": ["istio"]}, {"category": "", "categoryclass": "", "imagename": "84c93fd9078598a6904d04e243b3017f.jpg", "infoid": 1001613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这件事始于5月份我在夏威夷度假的时候。我以为我搬池边躺椅时扭伤了背部。回到家，我的背痛变得很厉害，我开始注意到腿上的神经痛。整整八天，我几乎不能在房子里爬来爬去。我的妻子和两个女儿给我起了个绰号叫“虫子”。45岁时，我的体型相当不错--狂热的自行车手、跑步运动员、举重运动员、瑜伽爱好者，脉搏都在50多岁。\n所以，当我的初级保健医生让我服用止痛药、神经阻滞剂和可的松的鸡尾酒时，感觉很奇怪。我甚至试过针灸。但随着我的背部在6月下旬开始好转，我开始感觉不舒服。我的胃很难受。瘦弱。睡不着。我瘦了10多磅。但我把这归因于一个月来服用过量的维柯丁，因为我一生都认为两种止痛药过量了。我的医生说我很健康，没有必要做任何血液测试。他大声想知道这一切是否都是我想出来的。\n工作又不是要把我逼疯。正好相反。作为西雅图初创公司Might AI的首席执行官，我进展顺利，玩得很开心。我们公司生产数据，为自动驾驶汽车和其他应用程序训练人工智能，正在积累新客户，建设新能力，交付更好的软件，并在竞争中取胜。我们变得嗡嗡作响。“连线”和英国“金融时报”报道了我们。有一种感觉是，我们不断壮大的团队可以做我们需要做的任何事情。士气高涨，我们的公司仍然足够小-45人左右-我可以和任何工作中的人聊天，谈论生活中除了工作之外的真实事情。\n不幸的是，我的非工作生活变得太真实了。通常我很擅长摆脱压力。当我心情低落或者办公室里的电风扇被狗屎砸到的时候，我会和我的妻子艾米，以及我们14岁的女儿安娜和11岁的埃尔西一起出去放松一下。我会放点音乐，或者骑自行车出去兜风。\n但这在今年夏天就不管用了。在办公室里，我为没有付出百分之百的努力而感到内疚。在家里-嗯，我是条虫子！在将近一个月的时间里，尽管我的背部正在好转，并且停用了所有的药物，但我感觉很糟糕，我撞到了墙上。7月26日，一个星期三，我结束了一天的会议，开车去了我知道的最不繁忙的急诊室-在市中心以东20英里的伊萨卡高地的瑞典医疗中心。\n几个小时后，我打电话给艾米，请她和我一起去。他们已经做了一系列测试，排除了明显的情况-尿路感染，硬膜外脓肿-有点像是在抓救命稻草。在电话里，我问临床心理学家艾米，她能不能想到我应该告诉医生的其他事情。“你告诉他们盗汗的事了吗？”她问道，肚子往下沉。我传递信息时急诊室医生脸上的表情应该是我的第一条线索。(盗汗是一些早期癌症的症状。)。他们抽了更多的血，并做了CT扫描。\n大约一个小时后，一位专门负责医院入院的医生加入了急诊室医生的行列，报告了他们的发现。随之而来的一幕在我的脑海里烙印着。他笨拙地向艾米和我作了自我介绍，我们都听不懂他的话。我轻轻地打断了他事先准备好的话，问他的名字，希望这能让他放心。\n事实并非如此。他接着解释说，我的肝脏、胰腺和胸部都有很多肿瘤。此外，他解释说，我有相当多的血液凝块，包括在我的心脏和肺。“什么是‘多’肿瘤？”我问过了。他看起来很沮丧，说他们10点以后就停止计数了。我以为他可能会哭，然后他开始胡说八道，说这可能只是糟糕的测试，或者可能是我感染了罕见的水传播有害生物感染。艾米开始哭起来，哭得很厉害。我陷入了无声的震惊，只是想让这家伙闭嘴离开。\n接下来的几个小时，测试和程序变得模糊不清。他们终于在凌晨2点左右停止了对我的指指点点。要解释我的感受几乎是不可能的，更不用说试图分享艾米的感受了。那天晚上我们两个都没睡着。外人走了，我终于可以哭了。我知道我不能完全理解这一切。但是一想到要把这个消息告诉安娜和埃尔西，一切都变得太真实了。安娜坚韧坚忍、内向、有条不紊、骨子里。不过，她14岁了，埃尔西是我们的天堂小天使。她活泼开朗，性格外向，广受爱戴，极富同情心，而且敏感。我只是无法想象她会接受这个消息，更不用说在没有她爸爸的情况下成长了。\n我的头都晕了。想到艾米让我热泪盈眶，因为我和她在追求两个雄心勃勃的事业的同时，为了养家糊口付出了如此之大的努力。我们彼此许诺，几年后，当女孩们去上大学时，我们会少工作，多旅行。艾米不应该失去那些梦想，也不应该失去她的同伴，就在我们正处于边缘的时候。然后我想到了我的爸爸妈妈。我妈妈会崩溃的。八年前，她的小儿子约书亚·保罗(JoShuah Paul)死于海洛因过量。我哭了又哭，艾米也是。\n周四我们又回来了。他们有相当多的事情要做-对癌症进行分类，衡量其进展，计划治疗。他们给我肝脏上的一个肿瘤做了活组织检查。他们在我的胆囊里植入了一个支架，立即缓解了我备份的肝脏。医务人员也在寻找癌症的次要影响。首先是血液凝块。几个医生检查了我的腿，说：“你的腿里有血栓的可能性几乎为零--它们看起来太健康了。”不过，我们来查一查。“。几个小时后，坏消息传来：我的左腿从臀部到脚踝都有血块，尽管谢天谢地没有完全闭塞。我的右腿从膝盖到脚踝都有血块。\n周四，我们花了大部分时间等待病理报告，玩了一场奇怪的心理游戏，试图说服自己这不是胰腺癌。我们不是傻瓜--我们可以看到总经理在列出替代方案时是如何视而不见的，也可以听到他们在讨论可能性时是如何表示异议的。可能是淋巴瘤--有肿大的淋巴结。可能是结肠癌-那是可以治疗的，对吧？但我们几乎不知道，官方的诊断结果会是我们那天最不关心的问题。\n当周四晚上10点钟声敲响时，我昏了过去。我白天和我最好的几个朋友聊过，但有点尴尬。我该怎么跟他们说呢？“嘿，我在医院里。我得了癌症。不确定是哪种。哦，还有一堆血块。但至少我会小便！“。我一直避免给我妈妈回电话。她已经打电话和发短信大约1000次了。我绝对没有准备好和她说话。我需要一个完整的计划。\n周五，医生们用一个紧急问题叫醒了我：他们在我的心脏右心室发现了一个乒乓球大小的血块。如果它松了，我会当场死亡，不管我是在急诊室还是在地下室。更糟糕的是，他们给我看了一张血块的图片，血块在一个已经松动的附件上摇摇晃晃，摇摇晃晃。每一次我的心跳，滴答作响的定时炸弹都摇摇晃晃。血块太大了，不能用真空吸出来，太危险了，不能一点一点地切开和取出，而且太大了，不能通过打破几根肋骨从侧面取出。不，取出它很紧急，需要打碎我的胸骨。今天。\n事件正在以令人眼花缭乱的速度发生。显然，我需要开始打一些电话-辞去Might AI首席执行官的职务，与我的母亲和其他直系亲属联系，提醒更多我最亲密的朋友。那是周五早上9点10分左右。强大的人工智能每周的运营会议将在10：15开始，所以我有很多电话要打。\n我一次给我们的董事会成员打了一个电话，把这个消息告诉了我联系到的人。他们每个人都很支持我，鼓励我请假，专注于恢复健康。我请求并得到了全力支持，任命我们的创始人兼首席技术官达林·纳胡达(Daryn Nakhuda)为临时首席执行官。这花了大约11分钟。9点21分，我打电话给达林，告诉他这个消息，问他是否愿意担任临时首席执行官。他非常镇定，支持他，并准备好挺身而出。我安排了9：35的全体员工视频会议。\n为什么要全力以赴？嗯，这显然是个大新闻，我想让大家一下子都听到。我想要原汁原味地分享它，投射出自信、悲伤和爱。为什么是视频？嗯，我承认，当我看到自己在笔记本电脑屏幕上的缩略图上穿着医院礼服，脖子上有一个他们在支架里摸索的开放伤口，手臂连接着几个静脉输液器和嘟嘟声的监视器时，我对这个选择有点后悔。\n我没有排练过，我也记不清我到底说了些什么。但这是我记忆中的要点：\n嘿，伙计们，你们中的很多人都知道我已经有几个星期身体不舒服了。嗯，几天前的晚上我住进了医院，以为他们会突发严重的膀胱炎之类的。不幸的是，事实证明，我得了癌症。看起来像是转移性的4期胰腺癌。我的肝脏、胰腺和胸部有广泛的肿瘤，还有相当多的血块。其中最严重的情况可能需要立即进行心内直视手术，以解决我心脏中的大血栓可能会在没有征兆的情况下导致即时死亡的可能性。\n显然，我爱我们的公司和我们的团队。我们在Might创造了一些非常特别的东西。只要看看我们最近的唱片合同，没有延迟交付，并用将增加多样性的人来壮大我们的团队。毫无疑问，在我看来，我们都会回顾这些职业生涯，认为这是我们一生中最美好的时光，是我们将在改变交通运输方面发挥重要作用的时代。\n我一直认为我的工作是你的仆人。现在是我休假的时候了，我要专注于我的健康。立即生效，达林是我们的首席执行官。请对他表示我们都知道他应得的尊重和支持。随着我们的成长，我们每个人都已经在以新的方式前进。这对达林和几乎所有其他人来说都变得更加真实。\n老实说，我的预后不是很好。到目前为止，和我交谈过的医生都说我的病是晚期的，晚期的，不治之症。别担心，我会找新医生的。我会离线，但这会让我准备好的时候回来，对你将完成的一切感到惊讶，这会让人感到更甜蜜。谢谢你给了我职业生涯中最大的荣誉，现在去让我感到骄傲吧！\n我可以看到很多泪水和震惊。这太突然了-对我的团队和我来说都是如此。接下来的周二，我拨通了达林·兰的第一次董事会会议。他当然做得很好。当我们解散时，每个人都祝我一切顺利。我们董事会的每一位成员都是杰出的个人，我们每个人都团结在一起。因此，即使披着风险投资的镀金盔甲，告别也是情绪化的。当我们挂断电话时，我意识到我绝对不再是首席执行官了。花了不到一周的时间。\n事实证明，他们认为我的肝脏和心脏太虚弱，不能冒险做手术切除那个巨大的凝块。这导致了三天的医院惰性，因为肿瘤学家和心脏病学家就该怎么做争论不休。第五天，艾米和几个医学博士朋友开始质疑医院的炼狱是否符合我的最大利益(医院送给我的礼物之一是肺炎！)，第六天，他们让我做了检查并送回了家。\n血块还在这里。我感觉不到。我的血压很好，血氧率99%，而且没有胸痛。但在我的脑海里，我知道它就在那里，我知道这意味着它随时可能脱离并杀死我。我总是试着让每一天都过得充实，但这枚达摩克利斯定时炸弹让我的女儿们更难说晚安了。\n我想打破常规。我打算战胜这个癌症。我想看每一场健身房运动会和足球比赛，看女孩子们的高中毕业典礼，送她们上大学，陪她们走过红毯。强大的人工智能有机会成为突破性人工智能领域的创新基准。我想帮助它成为融合人类和计算机认知的标准。我想和艾米一起享受(半)退休生活。我想成为一个更好的人，成为一个更好的父亲、儿子、兄弟、朋友，成为社会的贡献者。我真的很期待成为一名爷爷，接受所有的咕噜声--并把便便传给别人。\n第一步：战胜癌症。我已经开始化疗了。很多人告诉我，如果有人能战胜困难，那就是我。他们的用意是好的，我感谢他们投的信任票。我打算把我的每一盎司精力都用来证明一个例外。没有什么比在家里、工作中以及与朋友和家人一起重新坐上我迷人生活的驾驶座更让我高兴的了。\n第二步：做好心理准备，我可能打不过这一仗。4期胰腺癌的两年存活率不到5%-这还没有我的额外并发症。五年存活率为零。要成为这种分布的最后一部分，我需要保持积极，休息，并将压力降至最低。我需要无所畏惧地寻求帮助。这对我来说并不容易。\n第三步：找到一线希望，培养它们。我和艾米、安娜和埃尔西玩得很开心。我想为他们创造特别的回忆，成为一个榜样。\n最后：见鬼，也许我怪异的生活可以培养一些积极的社区动力。写这篇文章并不容易，一开始我是想让它保持私密性。但是一些亲密的朋友鼓励我分享它。如果我得到一个肥皂盒，这是我的小窍门：我们都是如此脆弱。每一天都很珍贵。我们生活中最重要的部分是我们所投资的人际关系。我当然有这种感觉，因为我的朋友和家人-“马特的军队”-让艾米和我被爱淹没，感觉就像一个强大的瀑布。", "note_en": "It started while I was on a Hawaiian vacation in May. I thought I’d just tweaked my back lifting a poolside lounge chair. Back home, my back pain became severe, and I started noticing nerve pain in my legs. For eight days I could barely crawl around the house. My wife and two daughters nicknamed me “the worm.” At 45, I’m in pretty good shape—avid cyclist, runner, weightlifter, yoga enthusiast with a resting pulse in the 50s.\n So it was weird when my primary care doctor put me on a cocktail of pain killers, nerve blockers, and cortisone shots. I even tried acupuncture. But as my back began to improve in late June, I started to feel off. Sick to my stomach. Weak. Couldn’t sleep. I lost more than 10 pounds. But I chalked this up to a month of too much Vicodin after a lifetime of thinking two Advil was excessive. My doctor said I was fit and healthy and that there was no need to run any blood tests. He wondered aloud if this was all in my head.\n It wasn’t like work was driving me crazy. Just the opposite. As the CEO of the startup Mighty AI in Seattle, I was on a roll and having a blast. Our company, which produces data to train artificial intelligence for self-driving cars and other applications, was racking up new customers, building new capabilities, shipping better software, and beating the competition. We were getting buzz.  WIRED and  The Financial Times wrote about us. There was a feeling that our growing team could do  anything we needed to. Morale was high, and our company was still small enough—45 people or so—that I could chat with anybody at work about real things in life besides work.\n  Unfortunately, my nonwork life was getting all too real. Usually I’m pretty good at unplugging from stress. When I’m feeling down or the shit is hitting the fan at the office, I unwind by hanging with my wife, Amy, and our daughters, Anna, 14, and Elsie, 11. I’ll play some music or go for a bike ride.\n But that stopped working this summer. At the office I felt guilty for not putting in 100 percent effort. At home—well, I was a worm! After nearly a month of feeling horrible despite my back getting better and being off all medications, I hit a wall. On July 26, a Wednesday, I finished my day’s meetings and drove myself to the least busy ER I know of—the one at Swedish Medical Center in the Issaquah Highlands, 20 miles east of downtown.\n  A couple hours later I called Amy and asked her to join me. They’d already done a bunch of tests and ruled out the obvious—urinary tract infection, epidural abscess—and were sort of grasping at straws. Over the phone, I asked Amy, who is a clinical psychologist, if she could think of anything else I should tell the doctors. “Have you told them about the night sweats?” she asked, her stomach sinking. The look on the ER doc’s face when I passed that on should have been my first clue. (Night sweats are a symptom of some early cancers.) They drew more blood and did a CT scan.\n  About an hour later, a doctor who specializes in hospital admissions joined the ER doc to report on their findings. The ensuing scene is seared into my brain. He introduced himself to Amy and me so awkwardly that we could not understand him. I gently interrupted his prepared remarks to ask his name, hoping this might put him at ease.\n  It didn’t. He went on to explain that I had many tumors in my liver, pancreas, and chest. In addition, he explained that I had quite a few blood clots, including in my heart and lungs. “What is ‘many’ tumors?” I asked. He looked defeated, saying they stopped counting after 10. I thought he might cry, and then he started in with some nonsense about how maybe it was all just bad tests, or maybe I had a rare water-borne pest infection. Amy began crying, hard. I went into silent shock and just tried to get this guy to shut up and leave.\n   The next few hours were a blur of tests and procedures. They finally stopped poking and prodding me at around 2 am. It’s kind of impossible to explain how I felt, let alone try to share how Amy felt. Neither of us slept that night. With outsiders gone, I was finally able to cry. I knew I couldn’t fully understand it all. But the thought of breaking the news to Anna and Elsie made it all too real. Anna is tough—stoic, introverted, methodical, deep-keeled. But still, she’s 14. Elsie is our little angel from heaven. She’s bubbly, extroverted, universally adored, extremely empathetic, and sensitive. I just couldn’t imagine her taking the news, let alone growing up without her daddy.\n My head was spinning. Thinking of Amy brought fresh tears to my eyes because she and I have worked so hard to raise a family while pursuing two ambitious careers. We had promised each other that in a few years, when the girls headed off to college, we’d work less and travel more. Amy didn’t deserve to lose those dreams, or her companion, just as we were on the brink. Then I thought of my mom and dad. My mom would break. She lost her youngest son, Joshuah Paul, to a heroin overdose eight years ago. I cried and cried, and so did Amy.\n Thursday we were right back at it. They had quite a lot to do—classify the cancer, measure its progress, plan treatment. They took a biopsy of one of the tumors on my liver. They surgically implanted a stent in my gall bladder, which immediately relieved my backed-up liver. The medical staff also looked for secondary impacts of the cancer. First among them was blood clots. A couple doctors examined my legs and said, “Slim to zero chance you have clots in your legs—they look too healthy. But let’s check.” A few hours later, bad news: My left leg had clots from my hip to my ankle, though thankfully not fully occlusive. My right leg had clots from knee to ankle.\n  We spent much of Thursday waiting for the pathology report, playing a weird mental game trying to convince ourselves it was anything but pancreatic cancer. We’re not dumb—we could see how the MDs looked away when listing alternatives and could hear how they demurred when discussing possibilities. Maybe it was lymphoma—there were swollen lymph nodes. Maybe it was colon cancer—that’s treatable, right? But little did we know that the official diagnosis would be the least of our concerns that day.\n When the clock struck 10 pm Thursday night, I passed out. I’d spoken with some of my best friends during the day, but it was a bit awkward. What was I supposed to tell them? “Hey, I’m in the hospital. I have cancer. Not sure what kind. Oh, and a bunch of clots. But at least I can pee!” I’d avoided calling my mom back. She’d phoned and texted about 1,000 times. I was definitely  not ready to speak with her. I needed a full plan.\n  On Friday the docs woke me with an urgent problem: They had found a blood clot the size of a Ping-Pong ball in my heart’s right ventricle. If it broke loose, I would die instantly, whether I was in an ER or my basement. To make matters worse, they showed me an image of the clot, and it was precariously wiggling on an already-loose attachment. Each time my heart beat, the ticking time bomb swayed precariously. The clot was too big to suck out with a vacuum, too risky to slice and remove bit-by-bit, and too large to remove from the side by breaking open a few ribs. Nope, removing it was urgent and would require cracking my sternum. Today.\n  Events were happening at a dizzying pace. Clearly I needed to start making some calls—to resign my role as Mighty AI CEO, to connect with my mom and other immediate family members, to alert more of my closest friends. It was around 9:10 Friday morning. Mighty AI’s weekly operations meeting would be getting started at 10:15, so I had a lot of calls to make.\n I phoned our board members one at a time, sharing the news with those I reached. Each of them was supportive and encouraged me to take a leave of absence to focus on getting healthy. I asked for and got full support to name our founder and CTO, Daryn Nakhuda, as Interim CEO. That took about 11 minutes. At 9:21 I called Daryn to share the news and ask if he were willing to serve as interim CEO. He was perfectly poised, supportive, and ready to step up. I scheduled a 9:35 all-hands video meeting.\n Why an all hands? Well, this was obviously big news, and I wanted everyone to hear it all at once. I wanted to share it raw and to project confidence, sorrow, and love. Why video? Well, I admit I regretted that choice a smidge when I saw myself in a thumbnail on my laptop screen with a hospital gown, an open wound at my neck where they’d fished in the stent, and arms connected to several IVs and beeping monitors.\n I hadn’t rehearsed, and I don’t remember exactly what I said. But here’s the gist of what I recall:\n Hey folks, many of you know I haven’t been feeling well for several weeks. Well, I checked myself into the hospital a couple nights ago, assuming they’d pop a bad bladder infection or something. Unfortunately, as it turns out, I have cancer. It looks like it’s metastatic, Stage 4 pancreatic cancer. I have extensive tumors in my liver, pancreas, and chest and quite a few blood clots. The worst of these may require immediate open-heart surgery to address the possibility that a large clot in my heart could cause instant death without warning.\n  Obviously I love our company and our team. We have created something really special here at Mighty. Just look at our recent record contract, having zero late deliverables, and growing our team with people who will add diversity. No doubt in my mind we will all look back on these professional years as the best in our lives, the epoch when we will have played a significant role in transforming transportation.\n I’ve always thought of my job as your servant. Now it’s time for me to take a leave of absence to focus on my health. Effective immediately, Daryn is our CEO. Please show him the respect and support we all know he deserves. Each of us was already stepping up in new ways as we grew. This just got all the more real for Daryn and pretty much everybody else, too.\n I gotta be honest, my prognosis isn’t great. So far, the doctors with whom I’ve spoken have said my disease is quite advanced, terminal, incurable. Don’t worry, I’ll be getting new doctors. I’ll be offline, but that will make it all the sweeter to come back when I’m ready and be amazed by all you will have accomplished. Thanks for giving me the greatest honor of my professional life, and now go make me proud!\n  I could see lots of tears and shock. It was so sudden—for my team and for me. The following Tuesday I dialed into the first board meeting Daryn ran. Of course he did great. As we disbanded, everyone wished me well. Every member of our board is a remarkable individual, and we’ve each bonded. So the goodbyes were emotional even wrapped in the plated armor of venture capital. As we hung up, I realized I was definitely no longer CEO. Took less than a week.\n   As it turns out, they decided my liver and heart were too weak to risk surgery to remove that huge clot. That led to three days of hospital inertia as the oncologists and cardiologists argued over what to do. On day five, Amy and a couple of MD friends started to question whether hospital purgatory was in my best interest (one of the hospital’s gifts to me was pneumonia!), and on day six they got me checked out and sent home.\n The clot is still here. I don’t feel it. My blood pressure is excellent, my oxygen rate 99 percent, and I have no chest pain. But in my mind I know it is there, and I know that means it could detach at any second and kill me. I’ve always tried to live each day to its fullest, but this Damoclean time bomb makes saying goodnight to my girls all the more difficult.\n  I want to beat the odds. I intend to beat this cancer. I want to be at every gym meet and soccer game, to see the girls’ high school graduations, send them off to college, walk them down the aisle. Mighty AI has a shot at becoming an innovation benchmark in the breakout AI field. I want to help it become the standard for blending human and computer cognition. I want to enjoy (semi-) retirement with Amy. I want to become a better person, father, son, brother, friend, and contributor to society. I’d really looked forward to being a grandpa and taking all the cooing—and passing on the pooing.\n   Step one: Beat cancer. I’ve started chemotherapy. Lots of people are telling me that if anybody can beat the odds, it’s me. They mean well, and I appreciate the votes of confidence. I intend to put every ounce of my energy into proving an exception. Nothing would make me happier than to get back in the driver’s seat of my charmed life at home, work, and with friends and family.\n  Step two: Prepare for the fact that I will probably  not beat this. The two-year survival rate for Stage 4 pancreatic cancer is under 5 percent—and that’s without the additional complications I have. The five-year survival rate is zero. To be part of the tail end of that distribution, I need to stay positive, rest, and minimize stress. I need to be unafraid to ask for help. This is not easy for me.\n Step three: Find the silver linings and nurture them. I’m having a blast with Amy, Anna, and Elsie. I want to create special memories for them and be a role model.\n Lastly: Heck, maybe my weird life can foster some positive community dynamics. It wasn’t easy to write this piece, and at first I did so intending to keep it private. But some close friends encouraged me to share it. If I get a soapbox, here’s my short shtick: We are all so fragile. Each day is precious. And the most important parts of our lives are the relationships we invest in. I certainly feel that way, as my friends and family—“Matt’s Army”—have Amy and me awash in love that feels like a mighty waterfall.", "posttime": "2020-05-11 11:45:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生命,life,艾米", "title": "我发现我的生命危在旦夕的那一天", "title_en": "The Day I Found Out My Life Was Hanging by a Thread", "transed": 1, "url": "https://www.wired.com/story/the-day-i-found-out-my-life-was-hanging-by-a-thread/", "via": "", "real_tags": ["生命", "life", "艾米"]}, {"category": "", "categoryclass": "", "imagename": "32ef8e84a0771d9aa2543c8c795676e6.jpg", "infoid": 1001612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月18日，德国国民埃德加德·齐巴特(Edgard Ziebat)正在从河内飞往伊斯坦布尔的途中，当天，在冠状病毒大流行之后，印度取消了所有往返土耳其的航班。\n德里更新：2020年5月11日02：36 IST一名40岁的德国男子在过去的54天里一直住在新德里英迪拉·甘地国际机场的过境区，他的故事与2004年史蒂文·斯皮尔伯格(Steven Spielberg)电影“终点站”(The Terminal)中汤姆·汉克斯(Tom Hanks)饰演的虚构人物维克多·纳沃斯基(Viktor Navorski)的故事没有什么不同。\n3月18日，德国国民埃德加德·齐巴特(Edgard Ziebat)正在从河内飞往伊斯坦布尔的途中，当天，在冠状病毒大流行之后，印度取消了所有往返土耳其的航班。四天后，印度停止了所有国际航班，然后在3月25日实施了全国封锁，目前计划持续到5月17日。\n据机场两名不愿透露姓名的安全官员透露，虽然当时还有其他滞留在机场的乘客，但对Ziebat来说，让事情变得复杂的是，他在自己的祖国有犯罪记录，因为他在外国，祖国拒绝拘留他。官员们补充说，印度也没有给他签证，因为他有犯罪记录。\n德国大使馆没有立即回复有关事态发展的电话和短信。\n上述一名警官表示，3月18日，Ziebat作为飞往伊斯坦布尔的过境乘客乘坐VietJet Air航班从越南降落在新德里，结果发现所有飞往他目的地的航班都被取消了。\n这名官员说，“在中转区逗留了大约一周后，机场当局通知了各自的大使馆，他们和另外四名滞留乘客是在不同的日期抵达德里的-两名来自斯里兰卡，一名来自马尔代夫和菲律宾。”\n“虽然其他人在相关大使馆的协助下被带去隔离，但德国大使馆的官员告诉印度移民局，齐巴特是他们国家的通缉犯，有几起针对他的袭击和其他罪行登记在案。因为他在异国他乡，他们没有接管他的监护权。德里警方和机场接线员Dial(德里国际机场有限公司)也被告知了这一情况。\n他补充说，由于印度没有给Ziebat发放签证，因为他有犯罪背景-在印度评估个人签证案件时会考虑刑事犯罪-他仍然没有被授权离开机场的中转区。在印度，一名国际旅客通常只能在过境停留一天，并且需要印度签证才能走出这个指定的空间，供过境的旅客使用。这位官员补充说，Ziebat也没有正式申请印度签证。\n在电影《终点站》中，纳沃斯基(汉克斯饰演)从虚构的东欧国家克拉科日亚抵达纽约约翰·F·肯尼迪机场，却发现内战爆发后美国不再承认克拉科日亚是一个独立国家，维克多既不被允许入境也不被允许回国，因为他现在是无国籍的。他继续在航站楼呆了九个月，因为他不能进入美国。\nZiebat也一直呆在航站楼，只带着他的行李。无论如何，该机场自3月22日以来一直没有正常交通，但正在运营货运航班和一些特殊疏散航班，目前正在参与大规模的遣返行动，在行动的第一周，大约1.5万名滞留在12个国家的印度人被带到印度各地的不同机场。\n据第二名机场官员称，在过去的54天里，Ziebat大部分时间都在阅读杂志和报纸，与朋友和家人通电话，在航站楼内一些仍在营业的快餐店吃饭，与客房和安检人员互动，在中转区散步，以及使用机场的洗手间和厕所。当局还向他提供了躺椅、蚊帐、牙膏、食物和其他基本必需品。\n“他告诉官员，他可以管理自己的开支。他睡在床上，长凳上，地板上，任何他想睡的地方。他独自一人在过境区，因为机场对乘客关闭，所以没有人使用它。“第二名警官说。\n“我们确认，目前有一名外国公民在德里机场国际航站楼的中转区，原因是没有往后转机的定期航班。及时向有关当局通报了这一情况。他们正在与外国公民对话，“德里国际机场有限公司(DIAL)的一位发言人说。\n上面引用的第二名警官说，大约在4月中旬，一些官员担心Ziebat的健康。“在这件事上，一些官员被派去会见齐巴特，他们发现他的身体和精神都很好。他互动得很清楚，而且神志清醒。还检查了闭路电视的录像，没有发现任何可疑的东西。其后，一些警务人员定期探访该名德国男子，与他互动，只为了解他的健康状况。“。\n第二名警官说，在这样的互动中，齐巴特曾表示，如果安排好旅行，他可以支付机票费用。“调查发现，他持有多个国家的签证。有关官员告诉他，只有在国际航班恢复后，他们才有可能将他遣送出境。“该官员补充说。\n上面引述的这名官员说，Ziebat被要求离开，去他想去的任何地方，但由于没有航班运营，他一直被困在那里。这位官员说：“大约一周前，也曾试图安排他乘坐救援航班前往(土耳其)安卡拉，但土耳其当局拒绝了这一提议，称该航班仅适用于土耳其国民或他们的永久居民。”", "note_en": "The German national, Edgard Ziebat, was on his way from Hanoi to Istanbul on March 18, the day India cancelled all flights to and from Turkey in the wake of the Covid-19 pandemic.\n  delhi  Updated: May 11, 2020 02:36 IST     A 40-year-old German man has been living in the transit area of New Delhi’s Indira Gandhi International airport for the past 54 days in a story not dissimilar to that of Viktor Navorski, the fictional character played by Tom Hanks in the 2004 Steven Spielberg film “The Terminal”.\n The German national, Edgard Ziebat, was on his way from Hanoi to Istanbul on March 18, the day India cancelled all flights to and from Turkey in the wake of the Covid-19 pandemic. Four days later, India stopped all international flights, and then, on March 25, imposed a national lockdown that is now scheduled to continue till May 17.\n While there were other stranded passengers at the airport at the time, what complicated things for Ziebat is that he has a criminal record in his home country, which has refused to take custody of him because he is at a foreign location, according to two security officers from the airport who asked not to be named. India, too, did not give him a visa because of his criminal record, the officers added.\n  There was no immediate response from the German embassy to calls and text messages regarding the development.\n On March 18, Ziebat landed in New Delhi from Vietnam in a VietJet Air flight  as a transit passenger to Istanbul , only to realise that all flights to his destination were cancelled, one of the officers cited above said.\n “After spending around a week in the transit area, with four other stranded passengers who arrived in Delhi on different dates — two from Sri Lanka and one each from the Maldives and the Philippines — airport authorities alerted their respective embassies,” the officer said.\n  “While others were facilitated by their embassies concerned and were taken for quarantine, officials from the German embassy informed the Indian bureau of immigration that Ziebat is a wanted criminal in their country with several cases of assault and other crimes registered against him. Since he was on a foreign land, they did not take his custody. The Delhi Police and airport operator DIAL (Delhi International Airport Limited) were also apprised of the situation,” the officer said.\n He added that because India did not give Ziebat a visa due to his criminal background — criminal offences are taken into consideration when assessing individual visa cases in India — he remains unauthorised to leave the airport’s transit area. In India, an international passenger can normally stay in transit for just one day, and requires Indian visa to step out of this designated space for travellers passing through the country. The officer added that Ziebat has also not formally applied for an Indian visa.\n In the film, The Terminal, Navorski (played by Hanks) arrives at New York’s John F. Kennedy airport from the fictional Eastern European country Krakozhia, only to discover that the US no longer recognises Krakozhia as an independent country after the outbreak of a civil war, and Viktor is not permitted to either enter the country or return home because he is now stateless. He goes on to stay in the terminal for nine months because he can’t enter the US.\n  Ziebat, too, has been staying in the terminal with only his luggage. The airport, in any case, has not opened to regular traffic since March 22, but is operating cargo flights and some special evacuation flights, and is currently involved in the massive repatriation exercise in which about 15,000 Indians stranded in 12 countries are being brought to different airports across India in the first week of the operation.\n According to the second airport official, Ziebat has mostly spent the last 54 days reading magazines and newspapers, talking to his friends and family over the phone, eating at some of the fast food outlets still in operation within the terminal, interacting with housekeeping and security staff, taking walks within the transit area, and using the airport’s washrooms and toilets. Authorities also provided him with a recliner, mosquito net, toothpaste, food and other basic essentials.\n “He told officials that he can manage his expenses. He sleeps on the beds, benches, on the floors, wherever he feels like. He is alone in the transit area as it is not being used because the airport is closed for passengers,” said the second officer.\n  “We confirm that a foreign national is currently in the transit area of the international terminal of Delhi airport due to non-availability of regular flight to transit onwards. Appropriate authorities were informed about this in good time. They are in dialogue with the foreign national,” a spokesperson for Delhi International Airport Limited (DIAL) said.\n  The second officer cited above said that around mid-April, some officials were worried about Ziebat’s health. “On this, some of the officials were sent to meet Ziebat and they found that he was fine, physically and mentally. He interacted clearly, and was in all his senses. CCTV footage was also checked, and nothing suspicious was found. Since then, some officers visit the German man regularly to interact with him just to get an idea of his well-being,” he added.\n  During such interactions, the second officer said, Ziebat had said that he can pay for his tickets if his travel is arranged. “It was found that he has visas of multiple countries. The officials concerned have told him that it will only be possible for them to send him away once international flights resume,” the officer added.\n  The officer quoted above said Ziebat was asked to leave and go wherever he wants, but since no flights are operational, he has been stranded. “About a week ago, attempts were also made to accommodate him on a relief flight to Ankara (Turkey) but Turkish authorities turned down the proposal stating that the flight was only for Turkish nationals or for their permanent residents,” the officer said.", "posttime": "2020-05-11 11:44:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德里,man,机场", "title": "一名德国男子自3月18日以来一直居住在德里机场", "title_en": "German man living at Delhi airport since March 18", "transed": 1, "url": "https://www.hindustantimes.com/delhi-news/german-man-living-at-delhi-airport-since-mar-18/story-VIJm8lsHTNxaws4mo99YDN.html", "via": "", "real_tags": ["德里", "man", "机场"]}, {"category": "", "categoryclass": "", "imagename": "03d1901353ccc32fd79e0ce8b9a69e48.jpg", "infoid": 1001609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "哈佛大学萨夫拉道德中心周一发布的一份报告估计，美国将需要每天对多达2000万人进行新型冠状病毒检测的能力，才能完全重新开放经济。\n该中心由一组经济、公共卫生、技术和伦理专家撰写的“大流行抗御路线图”详细说明了分阶段开放美国经济的计划。该计划的目标是在8月份之前全面重新开放经济，尽管它指出，具体的时间表可能会因地区而异。\n该报告主张对病毒采取测试、追踪和支持的隔离方法，而不是延长社会距离。该方法的主要步骤包括大幅加强冠状病毒检测，追踪检测呈阳性的接触者，以便他们也可以接受检测，以及隔离确诊病例。与此同时，该报告敦促积极开发疫苗。\n周三，美国对大约311,000人进行了病毒检测，这是美国在一天内进行的最多的检测。根据COVID跟踪项目的数据，自3月下旬以来，检测率通常徘徊在每天15万左右。\n哈佛全球卫生研究所(Harvard Global Health Institute)的研究人员周六发布了一份单独的报告，估计该国每天需要进行50万至70万次测试才能重启经济。\n与此同时，萨夫拉中心(Safra Center)估计，美国需要每天测试2%到6%的人口-或者说500万到2000万人-才能完全重新开放。\n报告写道：“我们不建议适度的TTSI，旨在补充集体检疫作为疾病控制的工具。”“相反，我们建议达到足够雄心勃勃的TTSI水平，以取代集体检疫作为疾病控制的工具。TTSI应该取代全职员工。“。\n许多公共卫生专家目前认为，在研制出疫苗之前，美国应该继续保持社会距离。一些哈佛大学的研究人员说，在2022年之前，社会疏远措施可能是必要的。\n萨夫拉中心的报告认为，通过使用TTSI计划，美国可以避免社会疏远方式可能导致的开放和关闭的间歇性循环。\n报告写道：“这使我们能够稳定地重新开放已经关闭的经济领域，保护我们的一线工人，并将病毒控制在可以有效管理和治疗的水平，直到我们找到疫苗。”\n报告认为，尽管实施这样的计划会有财务和后勤方面的困难，但社会距离最终会付出更高的代价。\n报告写道：“创建如此规模的测试所需的复杂供应链和交付链，将需要迅速协调自二战以来前所未有的商业活动。”但这样的检测和追踪项目(TTSI)的成本-两年内为500亿至3000亿美元-与继续进行集体隔离每月1000亿至3500亿美元的经济成本相比，相形见绌。\n政府教授丹妮尔·S·艾伦(Danielle S.Allen)是萨夫拉中心(Safra Center)的负责人，也是这份报告的主要作者。他在一份电子邮件声明中写道，实施大规模的TTSI项目对于让学校在今年秋天按时开学将是“至关重要的任务”。\n艾伦写道：“所有组织和企业都需要计划对运营进行改变，以适应和制度化在这种疾病仍在传播的背景下运营所必需的东西。”对于所有抵达的学生，包括国际学生，想必都有必要制定在抵达时进行隔离和/或检测的协议。\n报告承认，如果没有产业界、学术界和政府的协调，该计划不太可能成功。\n艾伦写道，萨夫拉中心一直在就其建议与许多政府官员联系。\n她写道：“我们一直在定期与白宫特别工作组、全国州长协会特别工作组、全国市长网络、两党国会议员以及疾控中心的工作人员进行沟通。”“作为第一步，我们真的希望看到疾控中心调整其指导方针，使指导方针既支持对有症状的个人的治疗测试，也支持疾病控制测试，包括对没有症状的个人的测试。”目前，指导意见只支持前者。“。\n-专职作家詹姆斯·S·比卡莱斯(James S.Bikales)可以通过james.bikales@thecrimson.com联系到。在Twitter@jamepdx上关注他。\n-专职作家凯文·R·陈(Kevin R.Chen)可以通过kevin.chen@thecrimson.com联系到。在Twitter@kchenx上关注他。", "note_en": "A report released Monday by Harvard’s Safra Center for Ethics estimates that the United States will need the capacity to test up to 20 million people per day for the novel coronavirus in order to fully reopen its economy.\n The center’s “Roadmap to Pandemic Resilience” — written by a group of economics, public health, technology, and ethics experts — details a plan to open up the U.S. economy in phases. The plan aims to fully reopen the economy by August, though it notes specific timelines may vary by region.\n The report advocates for a testing, tracing and supported isolation approach to the virus, rather than extended social distancing. The main steps of that approach entail dramatically ramping up coronavirus testing, tracing the contacts of those who test positive so they can also be tested, and isolating confirmed cases. All the while, the report urges aggressive vaccine development.\n The U.S. tested roughly 311,000 people for the virus Wednesday — the most tests it had conducted in a single day. Testing rates have typically hovered at around 150,000 per day since late March, according to the COVID Tracking Project.\n Researchers at the Harvard Global Health Institute released a separate report Saturday estimating that the country needs to perform between 500,000 to 700,000 tests per day to reopen the economy.\n The Safra Center, meanwhile, estimates the U.S. needs the capacity to test between 2 and 6 percent of the population — or between five and 20 million people — each day to fully reopen.\n “We do not propose a modest level of TTSI intended to supplement collective quarantine as a tool of disease control,” the report reads. “Rather we recommend a level of TTSI ambitious enough to replace collective quarantine as a tool of disease control. TTSI should replace stay-at-home.”\n Many public health experts are currently arguing that the U.S. should continue with social distancing until a vaccine is developed. Some Harvard researchers have said that social distancing measures may be necessary until 2022.\n The Safra Center’s report argues that by instead using a TTSI program, the U.S. could avoid intermittent cycles of opening up and shutting down that a social distancing approach may cause.\n  “It allows us to steadily reopen the parts of the economy that have been shut down, protect our frontline workers, and contain the virus to levels where it can be effectively managed and treated until we can find a vaccine,” the report reads.\n The report argues that though there will be financial and logistical difficulties in implementing such a plan, social distancing would ultimately be far costlier.\n “Creating the complex supply and delivery chains required for testing at this scale will require a rapid coordination of business activity unprecedented since World War II,” the report reads. “But the cost of such a testing and tracing, or TTSI, program—$50 to 300 billion over two years—is dwarfed by the economic cost of continued collective quarantine of $100 to 350 billion a month.”\n Government professor Danielle S. Allen, who directs the Safra Center and was the lead author on the report, wrote in an emailed statement that implementing large-scale TTSI programs will be “mission critical” to allowing schools to open on time this fall.\n “All organizations and businesses would need to plan for changes to operations to accommodate and institutionalize what’s necessary to operate in a context where a disease of this kind is still circulating,” Allen wrote. “For all arriving students, including international students, it would presumably be necessary to establish protocols for quarantine and/or testing upon arrival.”\n The report acknowledges that the plan is unlikely to succeed without the coordination of industry, academia, and government.\n Allen wrote that the Safra Center has been in contact with numerous government officials regarding its recommendations.\n “We have been communicating regularly with staff for the White House Task Force, staff for the National Governors Association Task Force, a national network of mayors, members of Congress in both parties, and staff at the CDC,” she wrote. “As a first step, we would really like to see the CDC adjust its guidance so that guidance supports both therapeutic testing for symptomatic individuals and also disease control testing, including of asymptomatic individuals. Currently the guidance supports only the former.”\n —Staff writer James S. Bikales can be reached at james.bikales@thecrimson.com. Follow him on Twitter @jamepdx.\n — Staff writer Kevin R. Chen can be reached at kevin.chen@thecrimson.com. Follow him on Twitter @kchenx.", "posttime": "2020-05-11 10:35:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,冠状病毒,病毒,估计,day", "title": "哈佛大学估计，美国每天需要2000万次冠状病毒检测才能重启经济", "title_en": "Harvard estimates U.S. Needs 20M Covid-19 Tests Per Day to Reopen Economy", "transed": 1, "url": "https://www.thecrimson.com/article/2020/4/23/safra-center-20-million-tests/", "via": "", "real_tags": ["大学", "冠状病毒", "病毒", "估计", "day"]}, {"category": "", "categoryclass": "", "imagename": "3e7cc934a8e975fea96a4ce363841d7f.jpg", "infoid": 1001608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，安全偏执狂一直警告说，任何与黑客单独相处超过几分钟的笔记本电脑都应该被认为受到了威胁。现在，一位荷兰研究人员已经演示了这种物理访问黑客是如何在一个超常见的组件中实现的：数百万台个人电脑中发现的英特尔迅雷端口。\n周日，埃因霍温理工大学研究员比约恩·鲁滕贝格透露了他称之为“雷霆间谍”的一种新攻击方法的细节。在2019年之前生产的支持迅雷的Windows或Linux PC上，他的技术可以绕过睡眠或锁定的电脑的登录屏幕，甚至可以绕过硬盘加密，以获得对电脑数据的完全访问权限。虽然他的攻击在许多情况下需要用螺丝刀打开目标笔记本电脑的箱子，但它没有留下入侵的痕迹，而且可以在几分钟内完成。这为安全行业所称的邪恶女佣攻击开辟了一条新的途径，任何可以在酒店房间里单独使用电脑的黑客都会受到威胁。鲁滕伯格说，没有简单的软件修复，只能完全禁用迅雷端口。\n鲁滕伯格说，邪恶女佣需要做的就是拧下背板，暂时连接一个设备，重新编程固件，重新连接背板，然后邪恶女佣就可以完全接触到笔记本电脑了。他计划在今年夏天的黑帽安全会议(Black Hat Security Conference)或可能取代笔记本电脑的虚拟会议上展示他的雷霆间谍研究成果。所有这些都可以在五分钟内完成。\n长期以来，安全研究人员一直对英特尔的迅雷接口持谨慎态度，认为这是一个潜在的安全问题。它提供更快的数据传输到外部设备的速度，部分原因是允许比其他端口更直接地访问计算机的内存，这可能会导致安全漏洞。例如，一组研究人员去年发现了一系列名为Thunderclap的迅雷组件的缺陷，表明将恶意设备插入电脑的Thunderbolt端口可以迅速绕过其所有安全措施。\n作为补救措施，这些研究人员建议用户利用迅雷的一项名为安全级别的功能，禁止访问不可信的设备，甚至在操作系统的设置中完全关闭迅雷。这将把易受攻击的端口变成一个纯粹的USB和显示端口。但Ruytenberg的新技术允许攻击者绕过这些安全设置，更改负责迅雷端口的内部芯片的固件，并更改其安全设置，以允许访问任何设备。这样做时，不会创建计算机操作系统可见的任何更改证据。\n埃因霍温理工大学(Eindhoven University Of Technology)密码学教授、鲁滕伯格的雷霆间谍研究顾问坦贾·兰格(Tanja Lange)表示，英特尔围绕这一点建造了一座堡垒。比约恩已经越过了他们所有的障碍。\n继去年的Thunderclap研究之后，英特尔还创建了一种名为内核直接内存访问保护(Kernel Direct Memory Access Protection)的安全机制，可以阻止鲁滕贝格的雷霆间谍攻击。但这种内核DMA保护在2019年之前制造的所有计算机中都缺乏，至今仍不是标准配置。事实上，很多2019年前生产的迅雷外设都与内核DMA保护不兼容。在他们的测试中，埃因霍温的研究人员没有发现任何具有内核DMA保护的戴尔机，包括2019年或更晚的那些，他们只能验证2019年或更晚的几款惠普和联想机型是否使用了内核DMA保护。运行苹果MacOS操作系统的电脑不受影响。Ruytenberg还发布了一个工具来确定您的计算机是否容易受到Thunderspy攻击，以及是否可能在您的计算机上启用内核DMA保护。\n鲁滕贝格的技术，如下面的视频所示，需要拧下笔记本电脑的底部面板才能接触到迅雷控制器，然后用SOP8夹子连接SPI编程器设备，SOP8夹子是一块设计用来连接控制器针脚的硬件。然后，SPI程序员重写芯片的固件-在Ruytenberg的视频演示中，这需要两分钟多一点-实质上是关闭了它的安全设置。\n鲁滕贝格说：我分析了固件，发现它包含控制器的安全状态。因此，我开发了一些方法，将该安全状态更改为无。因此，基本上禁用了所有安全性。然后，攻击者可以将设备插入Thunderbolt端口中，该端口会更改其操作系统以禁用其锁屏，即使它使用的是全磁盘加密也是如此。(#34；None。&#39；)因此基本上禁用了所有安全性。然后，攻击者可以将设备插入Thunderbolt端口，该端口会更改其操作系统以禁用其锁屏，即使它使用的是全磁盘加密。\n他说，鲁滕伯格在演示视频中展示的全面攻击只使用了价值约400美元的设备，但需要一个SPI编程器设备和一个200美元的外围设备，可以插入迅雷端口来执行绕过锁屏的直接内存攻击，就像鲁滕伯格使用的AKiTiPCIe扩展盒一样。但他认为，资金更充裕的黑客可以将整个设置构建到一个单独的小设备中，价格约为1万美元。Ruytenberg说，三个字母的代理机构将这个小型化是没有问题的。\n著名硬件安全研究员、SR Labs创始人卡斯滕·诺尔(Karsten Nohl)回顾了鲁滕贝格的工作，他表示，迅雷仍然是邪恶女佣可行的攻击方法，这一事实并不完全出乎意料。他说，考虑到它需要一定程度的复杂性和对受害者机器的物理访问，它也不应该吓坏太多的用户。尽管如此，他还是惊讶地发现，英特尔的安全级别可以如此轻松地被绕过。诺尔说，如果你要添加一个防止硬件攻击的身份验证方案，然后在不安全的硬件中实现它……这是解决硬件安全问题的错误方式。这是一种错误的保护感。\n鲁滕伯格说，他的雷霆间谍攻击也有一个侵入性较小的版本，但它需要用户在某个时候连接到电脑上的迅雷外围设备。为目标计算机设置为可信的迅雷设备包含一个64位代码，Ruytenberg发现他可以访问该代码并将其从一个小工具复制到另一个小工具。这样他就可以绕过目标设备的锁屏，甚至不需要打开箱子。鲁滕伯格说，这里并没有涉及到真正的密码学。&#34；你把号码复制过来。然而，只有当迅雷端口的安全设置被配置为允许可信设备的默认设置时，该版本的Thunderspy攻击才会起作用。\nRuytenberg在三个月前与英特尔分享了他的发现。当《连线》联系该公司时，该公司在一篇博客文章中做出回应，指出正如研究人员所说的那样，内核DMA保护可以防止攻击。这篇博文写道，虽然潜在的漏洞并不新鲜，但研究人员使用定制的外围设备演示了新的物理攻击媒介。(研究人员反驳说，该漏洞实际上是新的，他们的攻击只使用现成的组件。)对于所有系统，我们建议遵循标准的安全做法，英特尔补充说，包括仅使用受信任的外围设备和防止未经授权的物理访问计算机。\n在给“连线”的一份声明中，惠普表示，它通过Thunderbolt端口在大多数支持Sure Start Gen5及以上的惠普商用PC和移动工作站产品中提供了直接内存攻击的保护，其中包括自2019年初推出的系统。惠普公司还补充说，惠普的独特之处还在于，我们是唯一一家通过内置卡(PCI)和迅雷设备提供DMA攻击保护的[计算机制造商]。&#34；默认情况下启用通过迅雷防御DMA攻击。&#34；\n联想表示，它正在与我们的合作伙伴一起评估这项新研究，并将酌情与客户沟通。三星没有回复记者的置评请求。戴尔在一份声明中表示，担心这些威胁的客户应该遵循安全最佳实践，避免将未知或不受信任的设备连接到PC端口，并请有线电视联系英特尔以获取更多信息。当“连线”询问英特尔哪些计算机制造商使用其内核DMA保护功能时，它让我们返回到制造商那里。\n鲁滕伯格指出，他发现的缺陷延伸到了英特尔的硬件上，而不是仅仅通过软件更新就能修复的。他说，基本上，他们将不得不重新设计硅片。考虑到Ruytenberg发现了如何关闭这些设置，用户也无法更改操作系统中Thunderbolt端口的安全设置来防止攻击。他说，相反，偏执狂用户可能会想要在电脑的BIOS中完全禁用迅雷端口，尽管这样做的过程对于每台受影响的个人电脑来说都是不同的。除了在BIOS中禁用迅雷之外，用户还需要启用硬盘加密，并在计算机处于无人值守状态时将其完全关闭\n当然，在某些情况下，邪恶女佣袭击事件已经发生了多年。例如，Eclypimum等专注于固件的安全公司已经展示了利用BIOS漏洞对Windows机器进行5分钟物理访问黑客攻击的情况，而维基解密发布的Vault7版本包含了有关中央情报局(CIA)工具的信息，这些工具旨在通过物理访问技术攻击Mac固件。\n但这两种攻击都是基于可以修补的漏洞；中情局的攻击在2017年消息泄露时就被阻止了。另一方面，对于数百万台计算机来说，ThunderSpy仍然是未打补丁和不可打补丁的。这些机器的所有者现在可能需要升级到具有内核DMA保护的型号-或者在让他们的睡眠计算机无人看管时三思而后行。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Security paranoiacs have warned for years that any laptop left alone with a hacker for more than a few minutes should be considered compromised. Now one Dutch researcher has demonstrated how that sort of physical access hacking can be pulled off in an ultra-common component: The  Intel Thunderbolt port found in millions of PCs.\n On Sunday, Eindhoven University of Technology researcher Björn Ruytenberg  revealed the details of a new attack method he&#39;s calling Thunderspy. On Thunderbolt-enabled Windows or Linux PCs manufactured before 2019, his technique can bypass the login screen of a sleeping or locked computer—and even its hard disk encryption—to gain full access to the computer&#39;s data. And while his attack in many cases requires opening a target laptop&#39;s case with a screwdriver, it leaves no trace of intrusion, and can be pulled off in just a few minutes. That opens a new avenue to what the security industry calls an &#34;evil maid attack,&#34; the threat of any hacker who can get alone time with a computer in, say, a hotel room. Ruytenberg says there&#39;s no easy software fix, only disabling the Thunderbolt port altogether.\n &#34;All the evil maid needs to do is unscrew the backplate, attach a device momentarily, reprogram the firmware, reattach the backplate, and the evil maid gets full access to the laptop,&#34; says Ruytenberg, who plans to present his Thunderspy research at the Black Hat security conference this summer—or the virtual conference that may replace it. &#34;All of this can be done in under five minutes.&#34;\n   Security researchers have long been wary of Intel&#39;s Thunderbolt interface as a potential security issue. It offers  faster speeds of data transfer to external devices in part by allowing more direct access to a computer&#39;s memory than other ports, which can lead to security vulnerabilities. A collection of flaws in Thunderbolt components  known as Thunderclap revealed by a group of researchers last year, for instance, showed that plugging a malicious device into a computer&#39;s Thunderbolt port can quickly bypass all of its security measures.\n As a remedy, those researchers recommended that users take advantage of a Thunderbolt feature known as &#34;security levels,&#34; disallowing access to untrusted devices or even turning off Thunderbolt altogether in the operating system&#39;s settings. That would turn the vulnerable port into a mere USB and display port. But Ruytenberg&#39;s new technique allows an attacker to bypass even those security settings, altering the firmware of the internal chip responsible for the Thunderbolt port and changing its security settings to allow access to any device. It does so without creating any evidence of that change visible to the computer&#39;s operating system.\n  &#34;Intel created a fortress around this,&#34; says Tanja Lange, a cryptography professor at the Eindhoven University of Technology and Ruytenberg&#39;s advisor on the Thunderspy research. &#34;Björn has gotten through all their barriers.&#34;\n  Following last year&#39;s Thunderclap research, Intel also created a security mechanism known as Kernel Direct Memory Access Protection, which prevents Ruytenberg&#39;s Thunderspy attack. But that Kernel DMA Protection is lacking in all computers made before 2019, and is still not standard today. In fact, many Thunderbolt peripherals made before 2019 are incompatible with Kernel DMA Protection. In their testing, the Eindhoven researchers could find no Dell machines that have the Kernel DMA Protection, including those from 2019 or later, and they were only able to verify that a few HP and Lenovo models from 2019 or later use it. Computers running Apple&#39;s MacOS are unaffected. Ruytenberg is also  releasing a tool to determine if your computer is vulnerable to the Thunderspy attack, and whether it&#39;s possible to enable Kernel DMA Protection on your machine.\n  Ruytenberg&#39;s technique, shown in the video below, requires unscrewing the bottom panel of a laptop to gain access to the Thunderbolt controller, then attaching an SPI programmer device with an SOP8 clip, a piece of hardware designed to attach to the controller&#39;s pins. That SPI programmer then rewrites the firmware of the chip—which in Ruytenberg&#39;s video demo takes a little over two minutes—essentially turning off its security settings.\n  &#34;I analyzed the firmware and found that it contains the security state of the controller,&#34; Ruytenberg says. &#34;And so I developed methods to change that security state to &#39;none.&#39; So basically disabling all security.&#34; An attacker can then plug a device into the Thunderbolt port that alters its operating system to disable its lock screen, even if it&#39;s using full disk encryption.\n  The full attack Ruytenberg shows in his demo video uses only about $400 dollars worth of equipment, he says, but requires an SPI programmer device and a $200 peripheral that can be plugged into a Thunderbolt port to carry out the direct memory attack that bypasses the lockscreen, like the AKiTiO PCIe Expansion Box Ruytenberg used. But he argues that a better-funded hacker could build the entire setup into a single small device for around $10,000. &#34;Three-letter agencies would have no problem miniaturizing this,&#34; Ruytenberg says.\n The fact that Thunderbolt remains a viable attack method for evil maids isn&#39;t entirely unexpected, says Karsten Nohl, a well-known hardware security researcher and founder of SR Labs, who reviewed Ruytenberg&#39;s work. Nor should it freak out too many users, he says, given that it requires a certain level of sophistication and physical access to a victim machine. Still, he was surprised to see how easily Intel&#39;s &#34;security levels&#34; can be bypassed. &#34;If you&#39;re adding an authentication scheme against hardware attacks and then you implement it in unsecured hardware...that’s the wrong way to tackle a hardware security problem,&#34; says Nohl. &#34;It’s a false sense of protection.&#34;\n Ruytenberg says there&#39;s also a less invasive version of his Thunderspy attack, but it requires access to a Thunderbolt peripheral the user has plugged into their computer at some point. Thunderbolt devices set as &#34;trusted&#34; for a target computer contain a 64-bit code that Ruytenberg found he could access and copy from one gadget to another. That way he could bypass a target device&#39;s lockscreen without even opening the case. &#34;There&#39;s no real cryptography involved here,&#34; Ruytenberg says. &#34;You copy the number over. And that&#39;s pretty much it.&#34; That version of the Thunderspy attack only works, however, when the Thunderbolt port&#39;s security settings are configured to their default setting of allowing trusted devices.\n Ruytenberg shared his findings with Intel three months ago. When WIRED reached out to the company it responded in a blog post noting, as the researchers had, that Kernel DMA Protections prevent the attack. &#34;While the underlying vulnerability is not new, the researchers demonstrated new physical attack vectors using a customized peripheral device,&#34; the blog post reads. (The researchers counter that the vulnerability is in fact new, and their attack uses only off-the-shelf components.) &#34;For all systems, we recommend following standard security practices,&#34; Intel added, &#34;including the use of only trusted peripherals and preventing unauthorized physical access to computers.&#34;\n  In a statement to WIRED, HP said it offers protection against direct memory attacks via the Thunderbolt port in &#34;most HP Commercial PC and Mobile Workstation products that support Sure Start Gen5 and beyond,&#34; which includes systems that have launched since the beginning of 2019. &#34;HP is also unique in that we are the only [computer manufacturer] that provides protection against DMA attacks via internal card (PCI) and Thunderbolt devices,&#34; the company added. &#34;Protection from DMA attacks via Thunderbolt is enabled by default.&#34;\n  Lenovo said that it &#34;is assessing this new research along with our partners and will communicate with customers as appropriate.&#34; Samsung didn&#39;t respond to a request for comment. Dell said in a statement that &#34;customers concerned about these threats should follow security best practices and avoid connecting unknown or untrusted devices to PC ports,&#34; and referred WIRED to Intel for more information. When WIRED asked Intel which computer manufacturers use its Kernel DMA Protection feature, it referred us back to the manufacturers.\n Ruytenberg points out that the flaws he found extend to Intel&#39;s hardware, and can&#39;t be fixed with a mere software update. &#34;Basically they will have to do a silicon redesign,&#34; he says. Nor can users change the security settings of their Thunderbolt port in their operating system to prevent the attack, given that Ruytenberg discovered how to turn those settings off. Instead, he says that paranoid users may want to disable their Thunderbolt port altogether in their computer&#39;s BIOS, though the process of doing so will be different for every affected PC. On top of disabling Thunderbolt in BIOS, users will also need to enable hard disk encryption and turn their computers off entirely when they leave it unattended to be fully protected.\n  Evil maid attacks have, of course, been possible in some cases for years. Firmware-focused security companies like Eclypsium have demonstrated  five-minute physical access hacking of Windows machines using BIOS vulnerabilities, for instance, and WikiLeaks&#39; Vault7 release included information about  CIA tools designed to hack Macs&#39; firmware with physical access techniques.\n But both of those sorts of attacks are based on vulnerabilities that can be patched; the CIA&#39;s attack was blocked by the time news of it leaked in 2017. Thunderspy, on the other hand, remains both unpatched and unpatchable for millions of computers. The owners of those machines may now need to upgrade to a model that has Kernel DMA Protection in place—or think twice about leaving their sleeping computers unattended.\n   🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-05-11 10:12:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,黑客,flaws,安全", "title": "迅雷漏洞使数百万台PC暴露在亲身经历的黑客攻击之下", "title_en": "Thunderbolt Flaws Expose Millions of PCs to Hands-On Hacking", "transed": 1, "url": "https://www.wired.com/story/thunderspy-thunderbolt-evil-maid-hacking/", "via": "", "real_tags": ["漏洞", "黑客", "flaws", "安全"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近结束了找工作，我很高兴地说，我将加入一家由YC支持的名为“Heap”的初创公司。我想我应该分享一点我的求职经历，以防这些信息会让其他求职开发人员受益。我会仔细检查一下我申请的地方和每一份申请的结果。我还会谈到薪水、简历格式、编码挑战准备和面试等问题。我不想把这一切当作建议。相反，我希望这是一个数据点，其他求职开发人员可以用它来告知自己对求职的期望。\n从我填写第一份申请书到签署录用合同，我花了大约65天的时间寻找。我的搜索时间可能比平均搜索时间长，因为它与假期重叠。此外，在某些情况下，我故意放慢申请过程，这样我就可以有更多的时间准备面试。\n我想我投的申请书比大多数人都少。我一直倾向于专注于几家特定的公司，而不是发布10多个或100多个平庸的应用程序。我还专门申请了偏远或奥兰多的职位，所以我没有太多的选择。以下是我申请的地方和申请过程的结果：\n奥蒂斯：通过了第一次面试。在这个过程中没有继续下去。他们说我要的钱太多了。\nCarvana：做了第一次技术面试(没有编码挑战)。我觉得进展得很顺利。但最终还是没有继续前进。\nAutomattic：接近收到报价(结束他们的试验项目)，但退出流程以接受来自heap的报价。\nSquare：通过了第一次技术面试，但没有通过第二次。有关这一点的更多信息，请参见“编码挑战”。\nSuperGreat：在对公司有了更多了解并有太多选择要追求后，退出了招聘过程\n莫兹拉：我没有通过简历阶段。可能躲过了一劫，因为他们刚刚解雇了员工。\nReddit：通过了第一次技术面试。没有通过现场检查。有关这一点的更多信息，请参见“编码挑战”。\n灯笼：通过了第一次技术面试，在完成带回家的编码挑战之前退出，接受了堆中的提议。\n对于其中一些公司，我申请了一份非传统的品牌简历。例如，下面是我的Gradle简历和求职信的样子：\n顶部的标语实际上是他们公司使命的一个即兴小品，那就是“构建快乐的开发体验”。此外，他们的版式和颜色与他们网站上的一模一样。求职信也有类似的奇思妙想：\n据我所知，这些简历在我申请的公司都很受欢迎。Gradle的员工从来没有明确提到这些简历很突出，但我在Reddit、Carvana和Buzzfeed上确实收到了一些赞扬。因为我只在6份申请中使用了这些类型的简历，所以我想说，6份简历中有3份得到了热烈的赞扬，这是相当扎实的表现。\n我还通过递归中心申请了一些工作，他们推荐了一种更传统的简历格式。我最终接受的工作实际上是一份使用传统简历的工作。\n关于我的简历/工作经历，有一点要注意的是：我实际上在UniKey担任过短暂的产品经理。我有点担心那次经历会让一些人感到惊讶，并阻止我在几家公司继续前进。这是有可能发生的，但这似乎比我预期的要小得多。然而，我要说的是，我认为去年大部分时间担任领导/产品经理的工作确实削弱了我的编码技能。我确实发现我从事的编码挑战对解决我的编码手指上的一些锈迹很有帮助。接下来会有更多关于这一点的报道。\n我申请的一些公司利用编码挑战来筛选应聘者。因为我没有计算机科学学位，所以这些挑战有点吓人。为了做好准备，我经历了大约60个挑战，其中大部分都是在Leetcode上进行的。我还几乎完成了破解编码面试中关于数组的所有挑战。我几乎完全集中在数组类型的问题上(我的理解是这些是最常见的问题类型)，这让我在Reddit Onsite上感到很痛苦。\n当我申请Square时，我有一个有趣的决定：我实际上可以选择一个带回家的挑战，而不是一个更具算法风格的技术面试。我选择后者是因为我想挑战自己，也因为我不知道内部对最近面试过程中的变化的态度。我不想通过新的流程找到一份工作，也不想被认为是二等程序员，因为新的面试流程“不那么难”。\n有趣的是，我搞砸了第一次技术面试。事实上，面试官说，如果我在旧金山，他们很可能会马上把我带到现场。不幸的是，第二次面试进行得不够顺利，我没能继续到现场去。我认为这是一次有趣的经历，是技术采访反复无常的一个很好的具体例子，这是Xoogler的Moishe Lettwin在他的演讲中谈到的，他已经进行了250多次采访。2个。\n需要说明的是：我在这里不是在抱怨。如果我准备得更充分，对这类面试有更多的经验(那只是我整个职业生涯中的第三次这类面试)，我会在面试中做得更好，我不会讨厌那些用编程挑战来对应聘者进行排名的公司。衡量编程能力是很困难的，而编码挑战似乎是近似编程能力的一种明智的方式，特别是当您可以承受假阴性的时候。Square在提供面试表现反馈方面尤其出色，招聘人员发现我接受批评的态度真的令人耳目一新，并邀请我找个时间再面试一次。\n我想如果我再有6个星期的时间准备面试，我就会做得很好，足以收到一些额外的录取通知。但是，我对heap提供的服务非常满意，所以我没有费心花更多的时间做算法问题。\n说到堆，他们的采访编码挑战非常有趣和有趣。他们在选择问题方面做得很好，这些问题既需要一些算法/数据结构知识，又让人感觉像是您在工作中实际解决的问题。\n卡尔·纽波特(Cal Newport)创造了“职业资本”(Career Capital)这个词，我发现它是理解促进职业成长的行动的一个有用的比喻。在你真正找工作之前，很难对你的职业资本投资组合的相对价值有一个准确的看法。在经历了求职过程之后，我发现：\n在会议上演讲确实是发展你职业生涯的一种很好的方式。实际上，我在去年11月的一次会议上与Reddit的人见过面。他们对我的演讲印象深刻，这无疑帮助我获得了技术和现场面试的机会。\n这个博客在求职过程中确实派上了用场。当我在Automattic开始试验过程时，我很紧张地发现还有其他几个人在做试验项目，我担心会不会脱颖而出。然而，当我开始这个项目时，有几个人提到他们通过我的博客认识我，并说这是一个很好的博客。\n虽然我很高兴这个博客在求职过程中帮了我一点忙，但我认为我实际上在写作这一职业资本类别上投资过度了。有一段时间，我每周写一次。最近我做的比这少得多。我2020年的计划是发布8篇帖子，并更多地关注其他职业成长活动，比如提高我的算法/数据结构知识，做一些开源工作。在评估你的技能时，有很多人根本不看重博客。他们希望看到代码，这是可以理解的。\n在我职业生涯早期参加递归中心是一个伟大的决定。我在那里学到了很多东西，这当然使我成为一个更有吸引力、更有效率的员工。我在递归人员工作的公司进行了几次面试，甚至有一次面试官(出乎意料地)也是递归人员。RC与一些我不确定自己是否会发现的公司合作，这些公司正在做着整洁的事情，似乎拥有真正令人敬畏的文化。RC求职团队在求职过程中也给予了很大的帮助和鼓励。\n我用Reaction、Node和javascript做的所有3个小副项目都得到了真正的回报。实际上，我不能用柯特林参加我在希普的远程全天面试。我使用的是javascript，并且做得非常好。它也为我打开了做非Android工作的大门，这让我非常兴奋。\n我认为这是显而易见的，但我仍然会遇到对谈判感到不自在的人，所以我要说：我谈判了。我还价了最初的出价。我很高兴我这么做了。乔什·杜迪的演讲在这里很有帮助。这是我职业生涯中第二次使用他的框架进行薪资谈判。\n实际上我也申请了3个产品经理的职位。它们都没有捞出来。进入了一家公司的面试阶段，我认为进行得很顺利。显然，事情进行得不够顺利。我很高兴。我在我结束的地方很开心。[返回]。\n在谈话中，莱特文说，有一次，一位内部招聘人员捉弄了他们，给了他们自己的招聘方案。委员会投票决定不雇用招聘委员会的任何成员。莱特文还重复了他的同事史蒂夫·耶格(Steve Yegge)的一个想法，即对于任何在谷歌工作的人来说，你很容易在那里找到5个不会雇用那个人的人。他说所有这些都是为了配上一张幻灯片，上面写着“嘈杂”、“不准确”和“武断”，所有这些都是为了描述谷歌的面试过程。哎呀。言辞激烈。[返回]。\n顺便说一句，其中一个附带项目实际上是一个网络应用程序，它让我可以很容易地制作出这些品牌简历。[返回]", "note_en": "I wrapped up my job search recently, and I’m happy to say that I’ll be joining a YC-backed startup called  “Heap.” I thought I’d share a little bit about my job search in case the information may benefit other job-seeking devs. I’ll go over the pipeline of places I applied to and the result of each application. I’ll also talk about things like salary, resume formatting, coding challenge prep, and interviewing. I don’t intend any of this to be advice. Rather, I hope it’ll be a data point that other job-seeking devs  could use to inform their own expectations about their search.\n  From the first application I filled out till I signed an offer, my search took about 65 days. My search probably took longer than the average search because it overlapped with the holidays. In some cases, moreover, I intentionally slowed down the application process so that I could have more time to prep for interviews.\n     I suspect I put in less applications than most people. I’ve always preferred to focus on a few specific companies instead of putting out 10s or 100s of mediocre applications. I also applied exclusively to remote or Orlando-based positions, so I didn’t have a ton of options. Here are the places I applied and the outcome of the application process:\n Otis: Made it past the first interview. Didn’t continue in the process. They said I wanted too much money.\n  Carvana: Did the first technical interview (no coding challenge). Thought it went really well. Still didn’t wind up moving forward.\n  Automattic: Close to receiving an offer (wrapping up their trial project), but withdrew from the process to accept the offer from heap.\n Square: Made it past the first technical interview, but not past the second. More on this in  “Coding Challenges.”\n   Supergreat: Withdrew from hiring process after learning more about the company and having too many options to pursue\n Mozilla: Didn’t make it past the resume stage. May have dodged a bullet since they just  laid folks off.\n  Reddit: Made it past the first technical interview. Didn’t pass the onsite. More on this in  “Coding Challenges.”\n Lantern: Made it past the first technical interview, withdrew before completing the take-home coding challenge to accept offer at heap.\n  For some of these companies, I applied with a non-traditional, branded resume. For example, here’s what my Gradle resume and cover letter looked like:\n  The tagline at the top actually a riff on their company mission to “build joyful developer experiences.” The typography and colors, moreover, are identical to what they have on their website. The cover letter had similar fanciness:\n  From what I can tell, these resumes went over pretty well at the companies I applied to. The folks at Gradle never explicitly mentioned the resumes as standing out, but I did receive a few compliments at Reddit, Carvana, and Buzzfeed for them. Since I only used these types of resumes with 6 applications, I’d say glowing compliments on 3 out of 6 is pretty solid performance.\n I also applied to some jobs through  the Recurse Center, and they recommended a more traditional resume format. The job I ultimately took was actually one that used a traditional resume.\n One quick note about my resume/work history: I actually had a brief stint as a product manager at UniKey.  1 I was a bit worried that that experience would raise some eyebrows and keep me from moving forward with a few companies. That  could have happened, but it seemed to be much less of an issue than I expected. I will say, however, that I think working as a lead/product manager for much of last year did dull my coding skills. I definitely found the coding challenges I worked on helpful in working out some of the rust from my coding fingers. More on that next.\n  Some of the companies I applied to used coding challenges to sift through applicants. Since I don’t have a computer science degree, these challenges were a bit scary. To prepare, I went through about 60 challenges, most of which were on Leetcode. I also did nearly all the challenges on arrays from  Cracking the Coding Interview. I focused pretty much exclusively on array-type questions (my understanding is that these were most common question type), which hurt me in the Reddit onsite.\n I had an interesting decision as I was applying to Square: I actually could have chosen a take home challenge over a more algorithmic-style technical interview. I chose the latter because I wanted to challenge myself and because I didn’t know the internal attitudes about the recent change in the interview process. I didn’t want to get a job via the new process and be considered a second-class programmer because the new interview process “wasn’t as difficult.”\n Interestingly, I  crushed the first technical interview. In fact, the interviewer said if I was in San Fran, they probably would have just brought me onsite straight away. Unfortunately, the second interview didn’t go well enough for me to move on to the onsite. I thought this was an interesting experience that serves as a nice concrete example of the capriciousness of technical interviews, which is something that Moishe Lettvin, an Xoogler who’s conducted over 250 interviews discusses in  his talk.  2\n To be clear: I’m not complaining here. I could have done better on that interview if I’d prepared more and had a little more experience with that type of interview (that was only my third interview of that type in my entire career), and I’m not going to hate on companies that use coding challenges as a way to rank applicants. Measuring programming ability is hard, and coding challenges seem like a sane way of approximating programming ability, especially when you can afford to have false negatives. Square in particular was really great about providing feedback on interview performance, and the recruiter found my receptiveness to criticism really refreshing and invited me to interview again sometime.\n I think if I had another 6 weeks to prep for interviews, I could have done well-enough on them to receive some additional offers. However, I’m very happy with the offer from heap, so I didn’t bother spending more time doing algorithm problems.\n Speaking of heap, their coding challenge for their interviews was super interesting and fun. They did a great job of choosing problems that  both require some algo/data structure knowledge  and feel like problems you’d actually solve on the job.\n  Cal Newport coined the phrase “career capital,” and I’ve found it to be a useful metaphor for understanding actions that promote career growth. It’s hard to have an accurate view of the relative value of your career capital portfolio until you actually look for a job. After going through the job hunt process, I saw that:\n Speaking at conferences is indeed a great way to grow your career. I actually met the reddit folks at a conference I spoke at last November. They were impressed that I was speaking and that definitely helped me land the technical and onsite interviews.\n This blog did come in handy during the job hunt. When I started the trial process at automattic, I was nervous to find that there were several other folks working on trial projects and I was worried about standing out. However, when I started the project several people mentioned that they were familiar with me through my blog and said that it was a good blog.\n While I was happy this blog helped a bit during the job search, I think I’ve actually over-invested in writing as a career capital category. For a while, I was writing once a week. Lately I’ve done much less than that. My plan for 2020 is to publish 8 posts and to focus more on other career-growing activities like improving my algorithm/data structure knowledge and doing some open source work. There are lots of folks who don’t value blogs  at all when it comes to evaluating your skill. They, understandably, want to see  code.\n Attending the recurse center early in my career was a great decision. I learned a ton while I was there, which of course made me a more attractive hire and effective employee. I had several interviews at companies recursers worked at, and I even had one interview where the interviewer was also (unexpectedly) a recurser. RC works with companies that I’m not sure I would have discovered on my own, and those companies are doing neat things and seem to have really awesome cultures. The RC jobs team was also very helpful and encouraging during the job hunt process.\n All of the little side projects  3 I’ve done with react, node, and javascript really paid off. I actually couldn’t use Kotlin for my remote all-day interview at heap. I used javascript instead and did really well. It also opened up the door for me to do non-android work, which I’m really excited about.\n  I think this is obvious, but I still run into people who are uncomfortable negotiating, so I’ll say this: I negotiated. I countered the initial offer. I’m glad I did.  Josh Doody’s talk was helpful here. This is the second time in my career I’ve used his framework for salary negotiation.\n I actually did also apply to 3 product manager positions. None of them panned out. Made it to an interview stage at one company, and I thought it went quite well. Apparently, it didn’t go well enough. I’m glad. I’m happy where I wound up.   [return]\n At one point in the talk, Lettvin says that once an internal recruiter played a trick on them and gave them their own hiring packets. The committee voted not to hire anyone who was on the hiring committee. Lettvin also repeated an idea from his colleague Steve Yegge that for any person who is working at Google, you could easily find 5 people there who would not have hired that person. He said all of this to accompany a slide with the words “noisy,” “inaccurate,” and “arbitrary,” all of which were meant to describe the interview process at Google. Yikes. Strong words.   [return]\n One of those side projects, by the way, was actually a web app that allows me to crank out these branded resumes easily.   [return]", "posttime": "2020-05-11 09:50:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,求职,job,面试", "title": "我的职业生涯中期求职：求职开发人员的数据点", "title_en": "My Mid-Career Job-Hunt: A Data Point for Job-Seeking Devs", "transed": 1, "url": "https://www.philosophicalhacker.com/post/data-point-for-job-seeking-devs/", "via": "", "real_tags": ["开发", "求职", "job", "面试"]}, {"category": "", "categoryclass": "", "imagename": "53b536d7c590ea32aaf56f1ff1958c0f.jpeg", "infoid": 1001605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特朗普政府和半导体公司正寻求在美国启动新芯片工厂的开发，因为人们越来越担心依赖亚洲作为关键技术的来源。\n美国新一批尖端芯片工厂将重塑该行业，并标志着在许多渴望获得投资激励并参与强劲的地区供应链的美国公司向亚洲扩张数十年后，情况出现了180度大转弯。\n..。", "note_en": "The Trump administration and semiconductor companies are looking to jump-start development of new chip factories in the U.S. as concern grows about reliance on Asia as a source of critical technology.\n  A new crop of cutting-edge chip factories in the U.S. would reshape the industry and mark a U-turn after decades of expansion into Asia by many American companies eager to reap investment incentives and take part in a robust regional supply chain.\n...", "posttime": "2020-05-11 09:04:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,英特尔,包括,chip,亚洲", "title": "特朗普和包括英特尔在内的芯片制造商寻求半导体自给自足", "title_en": "Trump and Chip Makers Including Intel Seek Semiconductor Self-Sufficiency", "transed": 1, "url": "https://www.wsj.com/articles/trump-and-chip-makers-including-intel-seek-semiconductor-self-sufficiency-11589103002", "via": "", "real_tags": ["芯片", "英特尔", "包括", "chip", "亚洲"]}, {"category": "", "categoryclass": "", "imagename": "b0a98ea254c4200ceba8f3ab67141561.jpeg", "infoid": 1001603, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-拉丁美洲第二大航空公司Avianca Holdings AVT_p.CN周日申请破产，此前该公司未能在债券支付截止日期前完成支付，而其向哥伦比亚政府寻求冠状病毒援助的请求迄今未获成功。\n如果未能走出破产困境，总部位于波哥大的Avianca将成为全球首批因大流行而倒闭的主要航空公司之一，这场大流行已经使世界旅行陷入瘫痪。\n自3月下旬以来，Avianca一直没有定期运营客运航班，其2万名员工中的大多数人在危机中都是无薪度过的。\n“Avianca正面临我们百年历史上最具挑战性的危机，”Avianca执行长Anko van der Werff在新闻稿中称.。\n尽管Avianca在冠状病毒爆发之前就已经很疲软，但它的破产申请突显了航空公司面临的挑战，这些航空公司不能指望国家救援或此类救援来得足够快。Avianca仍希望得到政府救助。\n波哥大Casa de Bolsa经纪公司首席经济学家胡安·大卫·巴伦(Juan David Ballen)表示：“这一点都不令人意外。”“尽管该公司去年试图重组债务，但仍负债累累.”\nAvianca是仅次于荷兰皇家航空(KLM)的全球第二大持续运营的航空公司，2019年负债73亿美元。该航空公司在纽约申请破产保护，并表示在重组债务期间将继续运营。\n代表Avianca许多员工的工会哥伦比亚民用飞行员协会(ACDAC)表示，它支持这一举措。\nAvianca在21世纪初已经经历了破产，后来被玻利维亚出生的石油商人德国人Efromovich从破产中拯救出来。\nEfromovich积极发展Avianca，但也让航空公司背负着沉重的债务，直到去年在联合航空控股公司(UAL.O)领导的董事会政变中，他被赶出了航空公司。他仍然拥有该航空公司的多数股权。\nEfromovich周日对路透表示，他不同意申请破产的决定，他也没有参与申请破产。\n在Efromovich被赶下台后接手的管理层在今年的危机之前就已经专注于一项名为“Avianca 2021”的成本削减重组。\n关于其脆弱的财政状况的警告比比皆是。Avianca董事会主席罗伯托·克里特(Roberto Kriete)去年在与员工的一次会议上表示，该航空公司“破产了”。\n上个月，Avianca的会计师事务所毕马威(KPMG)表示，它对该航空公司一年后的生存能力有“很大的怀疑”。\nAvianca的股票周五在纽约收于88美分，而2014年的高点超过18美元。\n最紧迫的是，Avianca面临着周日到期的6500万美元债券偿付，分析师认为该航空公司无法满足这一要求。在支付这笔款项之前的几天里，标普将该航空公司的评级下调至CCC-级。\n航空公司高管在周日晚间的新闻发布会上证实，他们尚未支付这笔款项。\n范德韦尔夫最近几周发起了一场公关活动，以确保哥伦比亚政府的紧急援助，但截至周日，还没有一项援助实现。\nAvianca没有恢复运营的确切日期，因为其主要枢纽-哥伦比亚、萨尔瓦多和秘鲁-都已经关闭了空中交通，以抗击冠状病毒。该航空公司在出售5月下旬的机票后面临反弹，但在哥伦比亚延长冠状病毒封锁后不得不取消机票。\nAvianca还将关闭占该航空公司营收5%的秘鲁业务，并将在未来10天内裁员数百人。\nAvianca首席商务官Silvia Mosquera在谈到Avianca秘鲁时告诉记者：“在这段时间里，我们没有流动性来维持亏损的运营。”\n哥伦比亚的Avianca航空公司是Efromovich近年来第三家破产或倒闭的航空公司。巴西航空公司(Avianca Brasil)和阿根廷航空公司(Avianca阿根廷)去年因市场经济问题而不复存在。", "note_en": "(Reuters) - Avianca Holdings AVT_p.CN, Latin America’s second-largest airline, filed for bankruptcy on Sunday, after failing to meet a bond payment deadline, while its pleas for coronavirus aid from Colombia’s government have so far been unsuccessful.\n  If it fails to come out of bankruptcy, Bogota-based Avianca would be one of the first major carriers worldwide to go under as a result of the pandemic, which has crippled world travel.\n Avianca has not flown a regularly scheduled passenger flight since late March and most of its 20,000 employees have gone without pay through the crisis.\n “Avianca is facing the most challenging crisis in our 100-year history,” Avianca Chief Executive Anko van der Werff said in a news release.\n While Avianca was already weak before the coronavirus outbreak, its bankruptcy filing highlights the challenges for airlines that cannot count on state rescues or on such rescues coming fast enough. Avianca is still hoping for a government bailout.\n “This isn’t a surprise at all,” said Juan David Ballen, chief economist at Casa de Bolsa brokerage in Bogota. “The company was heavily indebted despite the fact it tried to restructure its debt last year.”\n Avianca, the second-oldest continually operating airline in the world after KLM (  AIRF.PA), had $7.3 billion in debts in 2019. The airline filed for Chapter 11 bankruptcy in New York and said it would continue operations while it restructured its debts.\n The Colombian Association of Civil Aviators (ACDAC), a union representing many Avianca employees, said it supported the move.\n Avianca already went through bankruptcy in the early 2000s, from which it was rescued by a Bolivian-born oil businessman, German Efromovich.\n Efromovich grew Avianca aggressively but also saddled the carrier with significant debt until he was ousted from the airline last year in a boardroom coup led by United Airlines Holdings Inc (  UAL.O). He still owns a majority stake in the carrier.\n  Efromovich told Reuters on Sunday that he disagreed with the decision to file for bankruptcy and that he was not involved in making it.\n  The management that took over after Efromovich’s ousting was already focused on a cost-cutting reorganization dubbed “Avianca 2021” before this year’s crisis.\n Warnings about its fragile finances abounded. Roberto Kriete, president of Avianca’s board, said last year in a meeting with employees that the airline was “broke.”\n Last month, Avianca’s accounting firm, KPMG, said it had “substantial doubts” about the carrier’s ability to exist a year from now.\n Avianca’s shares closed at 88 cents on Friday in New York, from a high of more than $18 in 2014.\n Most pressingly, Avianca was facing a $65 million bond payment due on Sunday that analysts did not think the airline was in a position to meet. S&amp;P downgraded the airline to CCC- status in the days leading up to that payment.\n Airline executives confirmed in a press call on Sunday night that they had not made the payment.\n Van der Werff had mounted a public relations campaign in recent weeks to secure emergency aid from Colombia’s government, but none had materialized as of Sunday.\n Avianca has no certain date to resume operations, as its main hubs - Colombia, El Salvador and Peru - have all shut down air traffic to fight the coronavirus. The carrier faced backlash after it sold plane tickets for late May only to have to cancel them when Colombia extended its coronavirus lockdown.\n  Avianca will also shut down its operations in Peru, which represents 5% of the airline’s revenue, and will lay off hundreds of employees within the next 10 days.\n “In this time, we do not have liquidity to sustain a loss-making operation,” Silvia Mosquera, Avianca’s chief commercial officer, told reporters regarding Avianca Peru.\n Colombia’s Avianca is the third of Efromovich’s airlines to go through bankruptcy or out of business in recent years. Airlines Avianca Brasil and Avianca Argentina ceased to exist last year because of economic troubles in their markets.", "posttime": "2020-05-11 08:49:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "avianca,america,航空公司", "title": "拉丁美洲第二大航空公司Avianca被Covid逼破产", "title_en": "Latin America's second-biggest airline, Avianca, driven to bankruptcy by Covid", "transed": 1, "url": "https://www.reuters.com/article/us-avianca-holding-bankruptcy/colombias-avianca-airline-files-for-bankruptcy-over-coronavirus-impact-idUSKBN22M0N1", "via": "", "real_tags": ["avianca", "america", "航空公司"]}, {"category": "", "categoryclass": "", "imagename": "03afc12532d5c091d390c3d57fa13246.jpg", "infoid": 1001602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "维生素D对健康的心理功能至关重要。研究表明，维生素D缺乏可能与抑郁症、季节性情感障碍和其他心理疾病有关。\n由普拉博沃·拉哈鲁苏纳(Prabowo Raharusuna)领导的一组印尼研究人员发表了一篇新的工作论文，显示在780例实验室确认的SARS-CoV-2病例样本中，冠状病毒死亡与维生素D不足或缺乏之间存在非常显著的关联。\n研究人员表示，这项研究的重点是确定冠状病毒感染患者的死亡模式，以及血清25(OH)D[维生素D]水平与死亡结果之间的可能联系。\n在患有既往疾病的老年和男性病例中，死亡的几率更高，而且维生素D水平低于正常水平。\n当考虑到年龄、性别和共病的影响时，维生素D状态与冠状病毒死亡率密切相关。\n这项研究增加了越来越多的科学文献，将维生素D与冠状病毒的严重程度联系起来。菲律宾达沃医生学院的Mark Alipio最近发布的一份报告发现，冠状病毒轻度病例的患者更有可能观察到正常的维生素D水平。具体地说，他估计，正常的维生素D水平将使出现轻微临床结果的几率增加约19.6倍。\n拉哈鲁苏纳的研究得出了类似的结论。科学家们估计，他们样本中的死亡几率对于维生素D不足的患者增加了13倍，对于维生素D缺乏的患者增加了19倍。此外，控制了其他已知的影响冠状病毒死亡率的影响，如年龄、性别和既往疾病，研究人员可能发现，维生素D缺乏的患者死于这种疾病的可能性仍然是10倍。根据一些估计，全球有超过10亿人缺乏或不足维生素D。\n作者得出结论，当控制年龄、性别和合并症时，维生素D状态与病例的冠状病毒死亡率结局密切相关。随机对照试验是必要的，以调查补充维生素D对冠状病毒结局的作用，并建立潜在的机制。\n研究人员明确表示，他们的发现只是正在进行的研究工作的一部分，数据可能会发生变化。然而，作为有效缓解或治疗这种疾病的一种可能方式，维生素D和冠状病毒之间的关系仍然引起科学界的兴趣。", "note_en": "Vitamin D is critical to healthy psychological functioning.  Research has shown that vitamin D deficiencies may be related to  depression,  seasonal affective disorder, and other psychological illnesses.\n  A team of Indonesian researchers led by Prabowo Raharusuna released a  working paper showing a significant association between COVID-19 deaths and vitamin D insufficiency or deficiency in a sample of 780 laboratory-confirmed cases of SARS-CoV-2.\n  &#34;This study focused on identifying patterns of mortality among patients infected with COVID-19 and the possible association between serum 25(OH)D [vitamin D] levels and mortality outcomes,&#34; state the researchers.\n  The odds of death were higher in older and male cases with preexisting conditions and lower than normal Vitamin D levels.\n  When accounting for the effects of age,  sex, and  comorbidity, vitamin D status is strongly related to COVID-19 mortality.\n  This research adds to a growing body of scientific literature linking vitamin D to COVID-19 severity. A recent  report released by Mark Alipio of Davao Doctors College in the Philippines found that normal vitamin D levels were more likely to be observed in patients with mild cases of COVID-19. To be specific, he estimated that normal vitamin D levels increase the odds of having a mild clinical outcome by approximately 19.6 times.\n  Raharusuna&#39;s study reached a similar conclusion. The scientists estimate that the mortality odds in their sample increase by a factor of 13 for patients who are vitamin D insufficient and 19 for patients who are vitamin D deficient. Moreover, controlling for other effects known to influence COVID-19 mortality rates such as age,  gender, and preexisting conditions, the researchers find that vitamin D-deficient patients are still 10 times more likely to die from the disease. By some  estimates, over a billion people worldwide are deficient or insufficient in vitamin D.\n  The authors conclude, &#34;When controlling for age, sex, and comorbidity, Vitamin D status is strongly associated with COVID-19 mortality outcome of cases. Randomized controlled trials are warranted to investigate the role of vitamin D supplementation on COVID-19 outcomes and to establish the underlying mechanisms.&#34;\n  The researchers make clear that their findings are part of an ongoing research effort and the data may be subject to change. Nevertheless, the relationship between vitamin D and COVID-19 continues to be of interest to the scientific community as a possible way to effectively mitigate or treat the disease.", "posttime": "2020-05-11 08:48:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维生素,冠状病毒,病毒,表明,suggests", "title": "研究表明维生素D缺乏与冠状病毒死亡之间存在联系", "title_en": "Research Suggests a Link Between Vitamin D Deficiency and Covid-19 Deaths", "transed": 1, "url": "https://www.psychologytoday.com/us/blog/social-instincts/202005/research-suggests-link-between-vitamin-d-deficiency-and-covid-19-deaths", "via": "", "real_tags": ["维生素", "冠状病毒", "病毒", "表明", "suggests"]}]