[{"category": "", "categoryclass": "", "imagename": "5429f3ca7682617909b86ac53c493e79.png", "infoid": 1003209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从去年在GitHub上重新开源MS-DOS 1.25&amp；2.0以来，我们已经收到了大量开源Microsoft Basic的请求。\n正如repo的自述文件中明确说明的那样，这些资源是1983年2月10日的8088汇编语言资源，并且出于历史参考和教育目的而开放源代码。这意味着我们不会接受以任何方式修改来源的PR。\n正在发布的GW-BASIC源代码的日期为1983年2月10日。那是很久以前的事了，所以让我来设定一个小小的历史视角：\n在这个来源被创造的那一周，“工作中的男人”凭借“Down Under”荣登美国和英国单曲排行榜榜首，达斯汀·霍夫曼主演了美国票房排行榜第一的电影“Tootsie”。1983年，《星球大战第六集-绝地归来》上映，《战争游戏》也上映了！艾米丽·布朗特、凯特·玛拉、乔纳·希尔、克里斯·海姆斯沃斯和亨利·卡维尔诞生了！罗纳德·里根(Ronald Reagan)是美国总统，玛格丽特·撒切尔(Margaret Thatcher)是英国首相。\n同年，Bjarne Stroustrup正在开发C++编程语言的第一个版本，ARPANET标准化TCP/IP。Borland发布了Turbo Pascal，由Anders Hejlsberg(后来加入微软，并创建了J++、C#和TypeScript)创建。\n1983年也是AT&amp；T发布Unix system V R1的那一年，BSD4.2也发布了，首次引入了伪终端(我们在2018年😁中引入了WindowsConPTY的前身)。\n我当时13岁，在没有完成作业或做家务的每一秒钟里，我都在当时最热门的家用计算机之一-BBC Micro Socket 32KB RAM(是的，总共32,768字节！)上写基本和汇编代码，它由MOS Technology 6502处理器驱动，运行速度高达2 MHz。不编程的时候，我通常在玩有史以来最具开创性的游戏之一：David Braben&Amp；Ian Bell的“精英”(Elite)。\n1983年，苹果公司推出了搭载1 MHz 6502处理器的Apple IIe，售价为1395美元(2020年为3500美元)。苹果还推出了第一款带有图形用户界面的商用电脑--苹果丽莎(Apple Lisa)。丽莎拥有惊人的1MB内存，运行着令人惊叹的摩托罗拉68000处理器，速度高达惊人的5 MHz，但它的售价为9,995美元(按2020年美元计算为25,000美元)，所以我所能做的就是透过我们镇上一家授权销售苹果产品…的电脑商店的窗户凝视着它。和梦想。\n1983年，微软发布了MS-DOS 2.0(这里是源代码)，以及用于IBMPc XT及其兼容机的GW-BASIC。\nGW-BASIC是从IBM的Advanced Basic/BASICA派生的BASIC解释器，它本身就是Microsoft Basic的移植。\n微软的各种基本实现可以追溯到比尔·盖茨和保罗·艾伦实现微软的第一个产品--牛郎星8800的基本解释器。\n在70年代末和80年代，微软的Basic被移植到许多OEM的特定平台和硬件需求，以及当时流行的几个处理器，包括8088、6502、6809、Z80和其他处理器。\n就像70年代和80年代的许多软件一样，就像MS-DOS的源代码一样，GW-BASIC的源代码是100%的汇编语言。\n当在当时的大型机和小型机上进行开发时，开发人员有时能够使用诸如FORTRAN、LISP、COBOL、RPG、CPL/BCPL、C等高级语言，但是这些语言的编译器通常非常昂贵，很少生成有效的代码，并且通常不适用于当时空间和性能受限的家用和个人计算机。\n在为早期的PC编写软件时，每一个字节和每一条指令都很重要，所以开发人员通常完全用汇编语言编写代码，只是为了能够将他们的软件物理地安装到可用的内存中，并能够访问计算机的资源和内部工作方式。\n因此，GW-BASIC的所有源代码都是纯汇编代码，在每个处理器/每个机器的基础上从核心/主源代码进行翻译。\n每个程序集源文件都包含一个标题，说明此由4.3版于10-Feb-83创建的转换。\n由于家用和个人计算机中使用的早期处理器的指令集体系结构(ISA)彼此之间没有显著差异，因此Microsoft能够从主实现的源代码中为端口生成大量代码。(唉，对不起，我们无法将ISA转换器开源。)。\n许多人问我们是否也可以为808x以外的处理器开源实现。唉，我们无法提供这些端口和/或定制的来源。\n我们希望您喜欢探索这张引人入胜的快照，了解软件开发在20世纪70年代和80年代初的辉煌、令人兴奋、令人兴奋的日子里是什么样子，当时“个人计算机”😁刚刚问世。\n非常感谢Amy、Julia Luison、Amanda Silver和我们出色的CELA团队的批准和帮助，他们发现、审查和开源了GW-Basic。", "note_en": "Since  re-open-sourcing MS-DOS 1.25 &amp; 2.0 on GitHub last year, we’ve received numerous requests to also open-source Microsoft BASIC.\n   These sources, as clearly stated in  the repo’s readme, are the 8088 assembly language sources from 10th Feb 1983, and are being open-sourced for historical reference and educational purposes. This means we will not be accepting PRs that modify the source in any way.\n  The GW-BASIC source code being published is dated Feb 10th 1983. That was quite a while ago, so just to set a little historical perspective:\n The week this source was created Men At Work topped the US and UK singles charts with “Down Under”, Dustin Hoffman starred in the #1 US box-office movie, “Tootsie”. In 1983, “Star Wars Episode VI – Return of the Jedi” was released, as was “War Games”! And, Emily Blunt, Kate Mara, Jonah Hill, Chris Hemsworth, and Henry Cavill, were born! Ronald Reagan was President of the USA, and Margaret Thatcher was the UK’s Prime Minister.\n That same year,  Bjarne Stroustrup was in the middle of developing the first version of  the C++ programming language,  ARPANET standardized  TCP/IP.  Borland announced  Turbo Pascal, created by  Anders Hejlsberg (who went on to join Microsoft, and create  J++,  C# and  TypeScript).\n 1983 was also the year AT&amp;T released  UNIX System V R1, and  BSD 4.2 was released, introducing the  pseudoterminal for the first time (the progenitor to  Windows’ ConPTY we introduced to Windows in 2018 😁)\n I was 13, and spent every spare second that I wasn’t finishing my homework or doing my chores, writing BASIC and assembly code on one of the hottest home computers of the time – the  BBC Micro sporting 32KB RAM (yes, 32,768   bytes, total!), powered by a  MOS Technology 6502 processor running at a BLAZING 2MHz. When not coding, I was usually playing one of the most groundbreaking games of all time: “ Elite” by  David Braben &amp;  Ian Bell.\n In 1983, Apple launched the 1MHz  6502-powered  Apple IIe for US$1,395 (&gt; $3,500 in 2020). Apple also launched the first commercially available computer with a GUI – the  Apple Lisa. The Lisa contained a staggering 1MB RAM, and ran the awesome  Motorola 68000 processor at an astounding 5MHz, but it cost $9,995 (&gt; $25,000 in 2020 dollars), so all I could do was peer at it through the window of the one computer store in our town authorized to sell Apple’s products … and dream.\n And, in 1983 Microsoft released MS-DOS 2.0 ( source here), and GW-BASIC for the  IBM PC XT and compatibles.\n  GW-BASIC was a BASIC interpreter derived from  IBM’s Advanced BASIC/BASICA, which itself was a port of  Microsoft BASIC.\n Microsoft’s various BASIC implementations can trace their origins all the way back to Bill Gates &amp; Paul Allen’s implementation of Microsoft’s first product – a  BASIC interpreter for the Altair 8800.\n During the late ’70s and 80s, Microsoft’s BASIC was ported to many OEM’s specific platform and hardware needs, and for several processors popular at that time, including the  8088,  6502,  6809,  Z80, and others.\n    Like much software from the 70s and 80s, and just like  the source for MS-DOS, the source code of GW-BASIC is 100% assembly language.\n  When developing on/for mainframes and minicomputers of the day, developers were sometimes able to use higher-level languages like FORTRAN, LISP, COBOL, RPG, CPL/BCPL, C, etc. but the compilers for such languages were often hugely expensive, rarely generated efficient code, and were generally unavailable for the space and performance constrained home and personal computers of the day.\n When writing software for early PCs, every single byte and every single instruction mattered, so developers often wrote code entirely in assembly language simply to be able to physically fit their software into the available memory, and to be able to access the computer’s resources and internal workings.\n Thus, all the source code for GW-BASIC is pure assembly code, translated on a per-processor/per-machine basis from core/master sources.\n  Each of the assembly source files contains a header stating  This translation created 10-Feb-83 by Version 4.3\n Since the Instruction Set Architecture (ISA) of the early processors used in home and personal computers weren’t spectacularly different from one another, Microsoft was able to generate a substantial amount of the code for a port from the sources of a master implementation. (Alas, sorry, we’re unable to open-source the ISA translator.)\n  Many have asked if we can also open-source implementations for processors other than the 808x. Alas, we’re unable to provide sources for these ports and/or customizations.\n  We hope you enjoy exploring this fascinating snapshot of what software development looked like during the glorious, exciting, heady days of the ’70s and early ’80s at the dawn of “the personal computer” 😁\n Many thanks to Amy,  Julia Luison,  Amanda Silver, and our awesome CELA team for their approval and help finding, reviewing, and open-sourcing GW-BASIC.", "posttime": "2020-05-22 08:01:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,microsoft,open,basic", "title": "Microsoft开源GW-Basic", "title_en": "Microsoft Open-Sources GW-Basic", "transed": 1, "url": "https://devblogs.microsoft.com/commandline/microsoft-open-sources-gw-basic/", "via": "", "real_tags": ["开源", "microsoft", "open", "basic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纽约州罗切斯特-已故的拉尔夫·贝尔(Ralph Baer)被称为家庭视频游戏之父，也是第一个为在电视上玩视频游戏申请专利的人。他花了40多年的时间创造、发明和改变了游戏的格局。这个强大的博物馆是世界视频游戏名人堂的所在地，它高兴地宣布，它已经收到了贝尔的家人捐赠的原型玩具和技术，这些玩具和技术展示了他的工作和他的创造性思维。这些物品增加了博物馆现有的贝尔材料收藏，其中包括他的个人文件和他发明的一个桌面工作站。\n“拉尔夫·贝尔是国防工业中一位非常成功的工程师，是家用视频游戏的鼻祖，最后是一位多产的电子玩具发明家。斯特朗公司国际电子游戏历史中心主任乔恩-保罗·戴森博士说：“他无限的好奇心、坚持不懈的干劲以及诱使新技术发挥最大游戏价值的诀窍使他的职业生涯如此成功。“这些品质是我们任何人都可能从效仿中受益的，所以强者为关心这些产品而感到自豪，并让我们得以一窥拉尔夫·贝尔的创作过程。我们感谢他的家人捐赠了它们。“。\n贝尔以其在视频游戏行业的工作而闻名，但除了在1972年创造了第一台家用游戏机Magnvox奥德赛外，贝尔还在玩具和手持电子游戏设计领域领导了成功的职业生涯，创造了配套游戏Simon和毛绒小熊TV Teddy，以及许多其他产品。这个收藏品包括数十件处于不同开发阶段的物品，包括一个Big Bird Talking Bank，Video Buddy互动系统，增强的GI Joe救援套装，Super Simon，以及各种其他物品或概念，包括会说话的贺卡，旋转嘉年华游乐设施，改装的毛绒动物，以及一部玩具电话。与博物馆现有的个人文件一起，它们为了解贝尔的设计过程提供了一个窗口。\n“我父亲小时候逃离了纳粹德国，在那之后，他一生中的大部分时间都在用不同的方式思考这个世界，并试图给这个世界带来更多的乐趣和奇思妙想。他是一股富有远见和创造力的力量，从未停止过学习、发明和修修补补-即使到了90多岁也是如此，“他的儿子、拉尔夫·H·贝尔信托公司(Ralph H.Baer Trust)受托人马克·W·贝尔(Mark W.Baer)说。“我很高兴-真的是欣喜若狂-我们有幸与强大的博物馆合作，现在让来宾和学者都能看到我父亲的作品，并从他的作品中获得灵感，为子孙后代提供灵感。”\n藏品中的一些物品将在2020年晚些时候被包括在即将到来的展览中，并可通过预约向研究人员提供。\nThe Strong是一个高度互动的、以收藏为基础的博物馆，致力于游戏的历史和探索。它是美国最大的历史博物馆之一，也是为家庭服务的领先博物馆之一。斯特朗收藏着世界上最大、最全面的与游戏相关的历史材料，是国际电子游戏历史中心、国家玩具名人堂、世界视频游戏名人堂、布莱恩·萨顿-史密斯图书馆和游戏档案馆、伍德伯里学校和美国游戏杂志的所在地。总而言之，这些活动促成了一系列多方面的研究、展览和其他解释性和教育性活动，服务于世界各地不同的受众，包括成人、家庭、儿童、学生、教师、学者、收藏家和其他人。", "note_en": "ROCHESTER, NY—The late Ralph Baer, known as the father of home video games and the first person to patent the idea of playing a video game on a television, spent more than four decades creating, inventing, and changing the landscape of play.  The Strong museum, home to the World Video Game Hall of Fame, is pleased to announce that it has received a donation of prototype toys and technologies from Baer’s family that showcase his work and his creative thinking. The items add to the museum’s existing collection of Baer materials, which includes his  personal papers and one of his desktop inventing workstations.\n  “Ralph Baer was a highly successful engineer in the defense industry, the progenitor of home video games, and lastly a prolific inventor of electronic toys. Such a successful career was made possible by his boundless curiosity, his incessant drive, and his knack for coaxing maximum play value out of new technologies,” says Jon-Paul Dyson, PhD, director of The Strong’s  International Center for the History of Electronic Games. “Those qualities are ones that any of us might benefit from emulating, and so The Strong is proud to care for these products and offer a glimpse in Ralph Baer’s creative process. We are grateful to his family for donating them.”\n  Baer is known for his work in the video game industry, but in addition to creating the Magnavox Odyssey in 1972, the first home console machine, Baer led a successful career in toy and handheld electronic game design, creating the matching game Simon and the plush bear TV Teddy, among many other products. This collection includes dozens of items in various stages of development, including a Big Bird Talking Bank, the Video Buddy interactive system, augmented GI Joe rescue set, Super Simon, along with various other pieces or concepts, including talking greeting cards, a twirling carnival ride, modified stuffed animals, and a toy phone. Together, along with the museum’s existing personal papers, they provide a window into Baer’s design process.\n  “My father escaped Nazi Germany as a child, and he spent much of his life after that thinking differently about the world and trying to introduce more fun and whimsy into it. He was a visionary and creative force who never stopped learning, inventing, and tinkering—even into his 90s,” says Mark W. Baer, his son and the Trustee of the Ralph H. Baer Trust. “I am pleased—over the moon really—that we have had the pleasure and honor of working with The Strong museum and now guests and scholars to The Strong will be able to view and take inspiration from my father’s work for generations to come.”\n  Some of the items in the collection will be included in an upcoming display later in 2020 and are available to researchers by appointment.\n      The Strong is a highly interactive, collections-based museum devoted to the history and exploration of play. It is one of the largest history museums in the United States and one of the leading museums serving families. The Strong houses the world’s largest and most comprehensive collection of historical materials related to play and is home to the International Center for the History of Electronic Games, the  National Toy Hall of Fame, the  World Video Game Hall of Fame, the Brian Sutton-Smith Library and Archives of Play, the Woodbury School, and the  American Journal of Play. Together, these enable a multifaceted array of research, exhibition, and other interpretive and educational activities that serve a diverse audience of adults, families, children, students, teachers, scholars, collectors, and others around the globe.", "posttime": "2020-05-22 07:28:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "家族,museum,游戏", "title": "强大的博物馆接受拉尔夫·贝尔家族的原型和项目", "title_en": "The Strong Museum Receives Prototypes and Projects from Family of Ralph Baer", "transed": 1, "url": "https://www.museumofplay.org/press/releases/2020/05/5977-the-strong-receives-donation-of-ralph-baer-materials", "via": "", "real_tags": ["家族", "museum", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "d5b15e15667f14cc161756e0e402e2c6.jpg", "infoid": 1003207, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "地球的磁场，对于保护地球上的生命免受太阳辐射的伤害至关重要，正在神秘地减弱。\n在过去的两个世纪里，地球的平均磁场强度几乎下降了10%，但是从非洲到南美都有一个很大的局部薄弱区域。\n被称为南大西洋异常的这一地区的磁场强度在过去50年里迅速缩小，就像该地区本身的增长和向西移动一样。\n在过去的五年里，在非洲西南部发展了第二个最低强度的中心，研究人员认为，这表明异常可能会分裂成两个独立的单元。\n欧洲航天局(ESA)数据、创新和科学集群(DISC)的科学家们正在使用来自ESA的卫星星座的数据来研究这一异常现象。\n群体卫星的设计目的是识别和精确测量构成地球磁场的不同磁信号。\n德国地球科学研究中心的于尔根·马兹卡博士说：过去十年来，南大西洋异常的新的东部极小值已经出现，近年来正在蓬勃发展。\n我们非常幸运，有Spot卫星在轨道上调查南大西洋异常的发展。现在的挑战是了解地球核心推动这些变化的过程。\n一种猜测是，磁场的减弱是地球走向磁极反转的迹象-南北磁极翻转。\n这种翻转不会立即发生，而是会在几个世纪的过程中发生，在此期间，全球将有多个南北磁极。\n在整个地球的历史上，这样的事件已经发生过很多次了，欧空局说，并指出，按照这些逆转发生的平均速度(大约每25万年)，我们早就应该这么做了。\n这就是说，航天局还指出，南大西洋出现的下降完全在被认为是正常波动水平之内。\n对于地面上的人来说，这种异常不太可能引起任何警报，但飞越该地区的卫星和其他航天器正在经历技术故障。\n由于该区域的磁场较弱，来自宇宙的带电粒子可以穿透到低地球轨道卫星飞行的高度。\n欧空局补充说，南大西洋异常起源的谜团尚未解开。\n然而，有一件事是肯定的：来自斯沃姆的磁场观测为人们提供了对地球内部鲜为人知的过程的令人兴奋的新见解。", "note_en": "Earth&#39;s magnetic field, which is vital to protecting life on our planet from solar radiation, is mysteriously weakening.\n On average the planet&#39;s magnetic field has lost almost 10% of its strength over the last two centuries, but there is a large localised region of weakness stretching from Africa to South America.\n  Known as the South Atlantic Anomaly, the field strength in this area has rapidly shrunk over the past 50 years just as the area itself has grown and moved westward.\n  Over the past five years a second centre of minimum intensity has developed southwest of Africa, which researchers believe indicates the anomaly could split into two separate cells.\n    European Space Agency (ESA) scientists from the Swarm Data, Innovation and Science Cluster (DISC) are using data from ESA&#39;s Swarm satellite constellation to study the anomaly.\n  Swarm satellites are designed to identify and precisely measure the different magnetic signals that make up Earth&#39;s magnetic field.\n  Dr Jurgen Matzka, from the German Research Centre for Geosciences, said: &#34;The new, eastern minimum of the South Atlantic Anomaly has appeared over the last decade and in recent years is developing vigorously.\n &#34;We are very lucky to have the Swarm satellites in orbit to investigate the development of the South Atlantic Anomaly. The challenge now is to understand the processes in Earth&#39;s core driving these changes.&#34;\n One speculation is that the weakening of the field is a sign that the Earth is heading for a pole reversal - in which the north and south magnetic poles flip.\n This flip doesn&#39;t happen immediately, but instead would occur over the course of a couple of centuries during which there would be multiple north and south magnetic poles all around the globe.\n &#34;Such events have occurred many times throughout the planet&#39;s history,&#34; said ESA, noting &#34;we are long overdue by the average rate at which these reversals take place (roughly every 250,000 years)&#34;.\n   That said, the space agency also noted that the dip occurring in the South Atlantic was &#34;well within what is considered normal levels of fluctuations&#34;.\n For people on the surface the anomaly is unlikely to cause any alarm, but satellites and other spacecraft flying through the area are experiencing technical malfunctions.\n Because the magnetic field is weaker in the region, charged particles from the cosmos can penetrate through to the altitudes that low-Earth orbiting satellites fly at.\n &#34;The mystery of the origin of the South Atlantic Anomaly has yet to be solved,&#34; added ESA.\n &#34;However, one thing is certain: magnetic field observations from Swarm are providing exciting new insights into the scarcely understood processes of Earth&#39;s interior.&#34;", "posttime": "2020-05-22 07:28:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "航天器,spacecraft,地球", "title": "卫星，航天器故障，地球磁场减弱", "title_en": "Satellites, spacecraft malfunction as Earth's magnetic field weakens", "transed": 1, "url": "https://news.sky.com/story/earths-magnetic-field-which-protects-us-from-solar-radiation-is-mysteriously-weakening-11992022", "via": "", "real_tags": ["航天器", "地球"]}, {"category": "", "categoryclass": "", "imagename": "24bb5b081b20c39c228b9c4f36bbc507.jpeg", "infoid": 1003206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FCF是用Typescript语言编写的一元函数控制流微库，旨在为IF、Switch和While等原生Javascript控制流语句提供功能和语义上的替代。\n像if或switch这样的关键字是命令性语句，通常必须组合到函数中才能赋予它们语义，例如：\n//错误的命令性(非语义)if(文档。VisibilityState=&#39；Visible&#39；){//使用可见文档}Else if(文档。VisibilityState=&#39；HIDDED&#39；){//处理隐藏文档}。\n//好一点.。具有语义函数const isDocumentVisible=()=&gt；document。VisibilityState=&#39；Visible&#39；const isDocumentHidden=()=&gt；文档。visibilityState=&#39；HIDDED&#39；//请注意，这里我们没有存储条件的值，//我们需要引入新的变量If(isDocumentVisible()){//用可见文档做事情}Else if(isDocumentHidden()){//用隐藏文档做事情}。\n使用FCF，我们可以以更具语义的方式编写程序流，保留其条件语句的值：\n从&#39；FCF&#39；常量checkIfApplicationIsActive=FCF导入FCF。IF(Value=&gt；Value=&#39；Visible&#39；)。然后(()=&gt；{//使用可见文档返回&#39；活动&#39；})。ELSE IF(值=&gt；值=&#39；隐藏&#39；)。则(()=&gt；{//使用隐藏文档RETURN&#39；STANDBY&#39；})//检查条件const{value}=checkIfApplicationIsActive。运行(文档。visibilityState)//匹配(&#39；Active&#39；|&#39；Standby&#39；)控制台的第一个`then`调用返回的值。LOG(值)。\n请注意，FCF是严格类型的，因此您可以通过以下方式在TypeScript中重写上面的示例：\n从&#39；fcf&#39；const checkIfApplicationIsActive=fcf//导入FCF使用`[string]`可以定义提供给&#39；run&#39；function//`string`是fcf.if对象保留的值。如果&lt；[字符串]，字符串&gt；(值=&gt；值=&#39；可见&#39；)。则(()=&gt；{//使用可见文档返回&#39；active&#39；})//`value`这里是`string`类型。ELSE IF(值=&gt；值=&#39；隐藏&#39；)。则(()=&gt；{//使用隐藏文档RETURN&#39；STANDBY&#39；})//检查条件const{value}=checkIfApplicationIsActive。运行(文档。visibilityState)//将为&#34；字符串&#34；控制台类型。LOG(值)\nconst greetUserByRole=FCF.。开关(USER=&gt；用户。角色)。箱子(&#39；POWER&#39；)。则(()=&gt；{控制台。日志(&#39；早上好，高级用户)})。箱子(底座)。则(()=&gt；{控制台。log(&#39；hello base user&#39；)})。默认(()=&gt；{控制台。log(&#39；hello，无论您是谁)})const Checkuser=FCF。IF(USER=&gt；USER。isLogging)。则(user=&gt；greetUserByRole。运行(用户))。Else(()=&gt；{控制台。Log(&#39；You Not Login&#39；)})Checkuser。运行({Role：&#39；power&#39；，isLogging：true})Checkuser。运行({Role：&#39；base&#39；，isLogging：true})Checkuser。运行({Role：&#39；power&#39；，isLogging：false})。\nselIf(fn：function|any)-添加必须后跟THEN调用的新条件。\nTHEN(fn：function)-将回调添加到上一个条件并设置Value属性。\nFCF。if(False)。则(()=&gt；{控制台。日志(您永远不会到这里)})。Else(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行()。\nFCF。if(True)。则(()=&gt；{控制台。日志(您永远不会到这里)})。ElseIf(False)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行()。\nFCF。如果(()=&gt；true)。则(()=&gt；{控制台。日志(您永远不会到这里)})。其他如果(()=&gt；false)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行()。\nFCF。如果(greeting=&gt；greeting=&#39；再见&#39；)。则(()=&gt；{控制台。日志(&#39；再见&#39；)})。其他如果(greeting=&gt；greeting=&#39；hello&#39；)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行(&#39；hello&#39；)。\nconst{value}=FCF。如果(greeting=&gt；greeting=&#39；再见&#39；)。然后(()=&gt；{return&#39；再见&39；})。其他如果(greeting=&gt；greeting=&#39；hello&#39；)。然后(()=&gt；{return&#39；hello&#39；})。运行(&#39；hello&#39；)控制台。log(值)//hello\nfcf.switch提供了一种替代原生Javascript switch语句的方法。它还标准化了默认的switch行为，避免了Break语句的需要：匹配的第一个case将避免对其他case求值。\nFCF。切换(问候=&gt；问候)。案例(&#39；你好&#39；)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。箱子(再见)。则(()=&gt；{控制台。日志(&#39；再见&#39；)})。默认(()=&gt；{控制台。日志(&#39；\\\\_(ツ)_/&#39；)})。跑(&#39；再见&#39；)。\nCASE(fn：function|any)-添加新案例，后面必须跟THEN调用。\nTHEN(fn：Function)-将回调添加到上一个Case调用，并可以设置Value属性。\nFCF。切换(问候=&gt；问候)。案例(&#39；你好&#39；)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。箱子(再见)。则(()=&gt；{控制台。日志(&#39；再见&#39；)})。默认(()=&gt；{控制台。日志(&#39；\\\\_(ツ)_/&#39；)})。跑(&#39；再见&#39；)。\n默认方法的工作方式类似于普通的switch语句：如果没有匹配的case，将调用默认方法。\nFCF。切换(问候=&gt；问候)。箱子(再见)。则(()=&gt；{控制台。日志(您永远不会到这里)})。默认(greeting=&gt；{控制台。log(问候语)})。运行(&#39；hello&#39；)。\nFCF。切换(问候=&gt；问候)。箱子(()=&gt；；#39；再见)。则(()=&gt；{控制台。日志(&#39；再见&#39；)})。案例(()=&gt；&#39；hello&#39；)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行(&#39；hello&#39；)\nFCF。切换(问候=&gt；问候)。案例(问候=&gt；问候=#39；再见&#39；)。则(()=&gt；{控制台。日志(&#39；再见&#39；)})。案例(greeting=&gt；greeting=&#39；hello&#39；)。则(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行(&#39；hello&#39；)。\nconst{value}=FCF。切换(问候=&gt；问候)。案例(问候=&gt；问候=#39；再见&#39；)。然后(()=&gt；{return&#39；再见&39；})。案例(greeting=&gt；greeting=&#39；hello&#39；)。然后(()=&gt；{return&#39；hello&#39；})。运行(&#39；hello&#39；)控制台。log(值)//hello。\nfcf.while为本机Javascript While语句提供了一种替代方法，它使用requestAnimationFrame或setImmediate来运行循环，从而使其在浏览器和节点中的行为标准化。\nDo(fn：function)-添加一个回调，当WhileFlow运行时将永远调用该回调。如果DO函数将返回FALSE，则会停止While流。\nBreak(fn？：function)-如果调用，它将停止While流。当流将停止时，它最终接受一个回调来调用。\nconst loggerFlow=FCF。While(True)。do(()=&gt；{控制台。日志(&#39；hello&#39；)})。run()//在1秒后停止While循环setTimeout(()=&gt；{loggerFlow.。Break()}，1000)。\nfcf//它将一直记录到文档。visibilityState=&#39；可见&#39；//否则它将被停止。而(()=&gt；文档。VisibilityState=&#39；可见&#39；)。do(()=&gt；{控制台。日志(&#39；hello&#39；)})。运行()。\nFCF。While(True)//它将只记录一次，然后停止While流。do(()=&gt；{控制台。log(&#39；hello&#39；)return false})。运行()\nconst greetUser=Fcf。开关(USER=&gt；用户。角色)。箱子(&#39；POWER&#39；)。则(()=&gt；{控制台。日志(&#39；早上好，高级用户)})。然后(底座)。则(()=&gt；{控制台。log(&#39；hello base user&#39；)})。默认(()=&gt；{控制台。log(&#39；hello base user&#39；)})fcf。While(True)。do(User=&gt；greetUser.。运行(用户))。运行(用户)", "note_en": "FCF is a Monadic Functional Control Flow Micro-Library for Javascript written in Typescript.It aims at providing a functional and semantic alternative to some native Javascript control flow statements like  if,  switch and  while.\n  Keywords like  if or  switch are imperative statements that normally must be combined to functions to give them a semantic meaning for example:\n // BAD imperative (non semantic) if  ( document . visibilityState  ===  &#39;visible&#39; )  {  // do stuff with visible document }  else  if ( document . visibilityState  ===  &#39;hidden&#39; )  {  // do stuff with hidden document }\n // a bit better... with a semantic functions const  isDocumentVisible  =  ( )  =&gt;  document . visibilityState  ===  &#39;visible&#39; const  isDocumentHidden  =  ( )  =&gt;  document . visibilityState  ===  &#39;hidden&#39; // notice that here that we didn&#39;t store the value of the conditions // for that we need to introduce new variables if  ( isDocumentVisible ( ) )  {  // do stuff with visible document }  else  if  ( isDocumentHidden ( ) )  {  // do stuff with hidden document }\n  With FCF we can write your program flow in a more semantic way retaining the value of its conditional statement:\n import  fcf  from  &#39;fcf&#39; const  checkIfApplicationIsActive  =  fcf  . if ( value  =&gt;  value  ===  &#39;visible&#39; )  . then ( ( )  =&gt;  {  // do stuff with visible document  return  &#39;active&#39;  } )  . elseIf ( value  =&gt;  value  ===  &#39;hidden&#39; )  . then ( ( )  =&gt;  {  // do stuff with hidden document  return  &#39;standby&#39;  } ) // check the condition const  {value }  =  checkIfApplicationIsActive . run ( document . visibilityState ) // the value returned by the first `then` call matched (&#39;active&#39;|&#39;standby&#39;) console . log ( value )\n Notice that FCF is strictly typed so you can rewrite the example above in typescript in this way:\n import  fcf  from  &#39;fcf&#39; const  checkIfApplicationIsActive  =  fcf  // with `[string]` you can define the type of arguments provided to the &#39;run&#39; function  // `string` is the value retained by the fcf.if object  . if &lt; [ string ] ,  string &gt; ( value  =&gt;  value  ===  &#39;visible&#39; )  . then ( ( )  =&gt;  {  // do stuff with visible document  return  &#39;active&#39;  } )  // `value` here is of type `string`  . elseIf ( value  =&gt;  value  ===  &#39;hidden&#39; )  . then ( ( )  =&gt;  {  // do stuff with hidden document  return  &#39;standby&#39;  } ) // check the condition const  {value }  =  checkIfApplicationIsActive . run ( document . visibilityState ) // will be of type &#34;string&#34; console . log ( value )\n  const  greetUserByRole  =  fcf  . switch ( user  =&gt;  user . role )  . case ( &#39;power&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;Good morning power user&#39; )  } )  . case ( &#39;base&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello base user&#39; )  } )  . default ( ( )  =&gt;  {  console . log ( &#39;hello whoever you are&#39; )  } ) const  checkUser  =  fcf  . if ( user  =&gt;  user . isLogged )  . then ( user  =&gt;  greetUserByRole . run ( user ) )  . else ( ( )  =&gt;  {  console . log ( &#39;you are not logged in&#39; )  } ) checkUser . run ( {  role:  &#39;power&#39; ,  isLogged:  true } ) checkUser . run ( {  role:  &#39;base&#39; ,  isLogged:  true } ) checkUser . run ( {  role:  &#39;power&#39; ,  isLogged:  false } )\n      elseIf(fn: function|any) - add a new condition that must be followed by a  then call\n then(fn: function) - add a callback to a previous condition and set the  value property\n         fcf  . if ( false )  . then ( ( )  =&gt;  {  console . log ( &#39;you will never get here&#39; )  } )  . else ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( )\n   fcf  . if ( true )  . then ( ( )  =&gt;  {  console . log ( &#39;you will never get here&#39; )  } )  . elseIf ( false )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( )\n   fcf  . if ( ( )  =&gt;  true )  . then ( ( )  =&gt;  {  console . log ( &#39;you will never get here&#39; )  } )  . elseIf ( ( )  =&gt;  false )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( )\n   fcf  . if ( greeting  =&gt;  greeting  ===  &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;goodbye&#39; )  } )  . elseIf ( greeting  =&gt;  greeting  ===  &#39;hello&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( &#39;hello&#39; )\n   const  {value }  =  fcf  . if ( greeting  =&gt;  greeting  ===  &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  return  &#39;goodbye&#39;  } )  . elseIf ( greeting  =&gt;  greeting  ===  &#39;hello&#39; )  . then ( ( )  =&gt;  {  return  &#39;hello&#39;  } )  . run ( &#39;hello&#39; ) console . log ( value )  // hello\n  fcf.switch provides an alternative to the native Javascript  switch statement.It normalizes also the default  switch behavior avoiding the need of  break statements: the first  case matched will avoid the evaluation of the others\n fcf  . switch ( greeting  =&gt;  greeting )  . case ( &#39;hello&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . case ( &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;goodbye&#39; )  } )  . default ( ( )  =&gt;  {  console . log ( &#39;¯\\\\_(ツ)_/¯ &#39; )  } )  . run ( &#39;goodbye&#39; )\n  case(fn: function|any) - add a new case that must be followed by a  then call\n then(fn: function) - add a callback to a previous  case call and can set the  value property\n      fcf  . switch ( greeting  =&gt;  greeting )  . case ( &#39;hello&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . case ( &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;goodbye&#39; )  } )  . default ( ( )  =&gt;  {  console . log ( &#39;¯\\\\_(ツ)_/¯ &#39; )  } )  . run ( &#39;goodbye&#39; )\n  The  default method works like for normal  switch statements: if no  case is matched the  default method will be called.\n fcf  . switch ( greeting  =&gt;  greeting )  . case ( &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;you will never get here&#39; )  } )  . default ( greeting  =&gt;  {  console . log ( greeting )  } )  . run ( &#39;hello&#39; )\n   fcf  . switch ( greeting  =&gt;  greeting )  . case ( ( )  =&gt;  &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;goodbye&#39; )  } )  . case ( ( )  =&gt;  &#39;hello&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( &#39;hello&#39; )\n   fcf  . switch ( greeting  =&gt;  greeting )  . case ( greeting  =&gt;  greeting  ===  &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;goodbye&#39; )  } )  . case ( greeting  =&gt;  greeting  ===  &#39;hello&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( &#39;hello&#39; )\n   const  {value }  =  fcf  . switch ( greeting  =&gt;  greeting )  . case ( greeting  =&gt;  greeting  ===  &#39;goodbye&#39; )  . then ( ( )  =&gt;  {  return  &#39;goodbye&#39;  } )  . case ( greeting  =&gt;  greeting  ===  &#39;hello&#39; )  . then ( ( )  =&gt;  {  return  &#39;hello&#39;  } )  . run ( &#39;hello&#39; ) console . log ( value )  // hello\n  fcf.while provides an alternative to the native Javascript  while statement.It normalizes its behavior in browsers and node using  requestAnimationFrame or  setImmediate to run loops\n   do(fn: function) - add a callback that will be called forever when the whileFlow is running. If a  do function will return  false the while flow will be stopped\n break(fn?: function) - if called, it will stop the while flow. It accepts eventually a callback to call when the flow will be stopped\n         const  loggerFlow  =  fcf  . while ( true )  . do ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( ) // stop the while loop after 1 second setTimeout ( ( )  =&gt;  {  loggerFlow . break ( ) } ,  1000 )\n   fcf  // it will log until the document.visibilityState === &#39;visible&#39;  // otherwise it will be stopped  . while ( ( )  =&gt;  document . visibilityState  ===  &#39;visible&#39; )  . do ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  } )  . run ( )\n   fcf  . while ( true )  // it will log only once and then stop the while flow  . do ( ( )  =&gt;  {  console . log ( &#39;hello&#39; )  return  false  } )  . run ( )\n   const  greetUser  =  fcf  . switch ( user  =&gt;  user . role )  . case ( &#39;power&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;Good morning power user&#39; )  } )  . then ( &#39;base&#39; )  . then ( ( )  =&gt;  {  console . log ( &#39;hello base user&#39; )  } )  . default ( ( )  =&gt;  {  console . log ( &#39;hello base user&#39; )  } ) fcf  . while ( true )  . do ( user  =&gt;  greetUser . run ( user ) )  . run ( user )", "posttime": "2020-05-22 06:59:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript,控制流,functional,fcf", "title": "一元函数控制流微库的JavaScript/TypeScript", "title_en": "Monadic Functional Control Flow Micro-Library for JavaScript/TypeScript", "transed": 1, "url": "https://github.com/GianlucaGuarini/fcf", "via": "", "real_tags": ["java", "控制流", "fcf"]}, {"category": "", "categoryclass": "", "imagename": "77e8317116fe72a1ef85fac4bf53d9cf.jpg", "infoid": 1003205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据报道，Magic Leap在裁员1000人并放弃消费者业务一个月后，获得了3.5亿美元的救命稻草。“商业内幕”(Business Insider)注意到了这一点，并得到了“信息”(The Information)的证实，首席执行官罗尼·阿博维茨(Rony Abovitz)向员工发了一封信，宣布了这笔资金，这笔资金来自。\n谁-更重要的是，为什么-还不清楚。一家关键的医疗保健公司可能会参与其中。无论如何，该公司正在撤回4月下旬发给员工的警告通知(大规模裁员的60天通知)。此举代表着该公司之前宣布的一轮大规模裁员的明显逆转。\n尽管有这样的变化，这家资金雄厚的增强现实公司似乎仍计划像之前宣布的那样，将所有重点转向企业-此举使其与微软(Microsoft)的全息镜头(HoloLens)等公司展开更直接的竞争。\nAbovitz写道：“我们在医疗保健、企业和国防交易方面取得了非常好的进展。”“随着这些交易的完成，我们将能够宣布它们.”\nMagic Leap称冠状病毒是4月份新闻的关键原因。但该公司并不完全是关门前消费者硬件的成功图景。尽管该公司在九轮融资中筹集了令人瞠目结舌的26亿美元，但其早期更多的是被炒作所定义，而不是公众的进步。在多年的预告视频之后，它的第一款设备最终还是有很多不尽如人意的地方。", "note_en": "Magic Leap has reportedly received a $350 million lifeline, a month after slashing 1,000 jobs and dropping its consumer business. Noted by  Business Insider and confirmed by The Information, CEO Rony Abovitz sent a note to staff announcing the funding, courtesy of unnamed current and new investors.\n The who — and more importantly, why — isn’t clear. A key healthcare company may be involved. Whatever the case, the company is withdrawing the WARN notice (a 60-day notification for large-scale layoffs) sent to staff in late April. The move represents an apparent reversal of the massive layoff round it previously announced.\n In spite of the change, it seems that the lavishly funded augmented reality company still plans to turn all of its focus to the enterprise, as previously announced — a move that puts it in more direct competition with the likes of Microsoft’s HoloLens.\n   “We are making very good progress in our healthcare, enterprise, and defense deals,” Abovitz writes. “As these deals close, we will be able to announce them.”\n Magic Leap cited COVID-19 as a key reason for April’s news. But the company wasn’t exactly the picture of consumer hardware success prior to the shutdown. In spite of raising an eye-popping  $2.6 billion across nine rounds, the company’s early days were defined far more by hype than public progress. After years of teaser videos, its first device ultimately left much to be desired.", "posttime": "2020-05-22 06:59:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,leap", "title": "显然，Magic Leap不顾一切地又筹集了3.5亿美元", "title_en": "Magic Leap has apparently raised another $350M, in spite of itself", "transed": 1, "url": "https://techcrunch.com/2020/05/21/magic-leap-has-apparently-raised-another-350-million-in-spite-of-itself/", "via": "", "real_tags": ["app", "leap"]}, {"category": "", "categoryclass": "", "imagename": "4dbc1445df2512748fa6bd7e1e145d45.jpeg", "infoid": 1003204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州大学董事会(University Of California Regents)周四投票决定停止使用SAT和ACT大学招生考试，重塑了美国最大、最负盛名的大学系统之一的大学招生制度，并对价值数十亿美元的大学招生考试行业造成了重大打击。\n一致通过的23票赞成、0票反对的投票结果批准了加州大学校长珍妮特·纳波利塔诺(Janet Napolitano)上个月提出的一项提案，该提案要求在未来五年内逐步取消考试，直到庞大的加州大学系统能够开发自己的考试。\n..。", "note_en": "The University of California board of regents voted Thursday to stop using the SAT and ACT college admissions exams, reshaping college admissions in one of the largest and most prestigious university systems in the country and dealing a significant blow to the multibillion-dollar college admission testing industry.\n  The unanimous 23-to-0 vote ratified a proposal put forward last month by UC President Janet Napolitano to phase out the exams over the next five years until the sprawling UC system can develop its own test.\n...", "posttime": "2020-05-22 06:53:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,停止使用,california,考试", "title": "加州大学将停止使用SAT，ACT", "title_en": "University of California Will Stop Using Sat, Act", "transed": 1, "url": "https://www.wsj.com/articles/university-of-california-will-stop-using-sat-act-11590099469", "via": "", "real_tags": ["大学", "停止使用", "考试"]}, {"category": "", "categoryclass": "", "imagename": "6c0341e391bf05c75b720fb7f505bcfc.jpeg", "infoid": 1003203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丝绸之路创始人罗斯·乌布利赫特(Ross Ulbricht)目前正在服刑，这是他被判双无期徒刑的第七年。支持者敦促特朗普总统释放罗斯。\n昨天，一张纽约自由罗斯广告牌的照片被发布在推特上。\n一块呼吁释放丝绸之路创始人罗斯·乌布利赫特的广告牌被拍到在纽约时代广场。\n昨天，一张广告牌的照片被发布在推特上，并在“自由罗斯”的说明文字旁边放了一张乌布利赫特的照片。呼吁释放乌布利赫特的网站-freeross.org-也在广告牌上，根据“ClemencyForRoss”推特账号，广告牌将在时代广场停留几个月。\n现年36岁的乌布利赫特于2013年因建立丝绸之路(Silk Road)而被捕入狱-这是一个黑暗的市场，允许用户使用比特币买卖非法毒品和伪造文件。\n该网站从2011年运营到2013年，据报道在被联邦调查局关闭之前获得了2.14亿美元的销售额。\n乌布利赫特目前正在纽约服刑两次无期徒刑，不得假释，此前他被判贩毒、犯罪企业、协助和教唆通过互联网分销毒品、电脑黑客和洗钱罪。\n一位“慷慨的支持者”为广告牌买单，freeross.org推特账号写道。它补充说，“没有#FreeRoss资金花在这上面。”\n乌布利赫特的案件引起了争议，密码领域的许多知名人士都呼吁释放他。\n乌尔布里克特入狱后不久就发起了一份宽大处理请愿书，声称对他的判决“充斥着滥用”。这份文件将提交给唐纳德·特朗普总统，要求在拥有30万个签名的情况下减轻乌布里克特的刑期。\n编者按：这篇文章的更新是为了澄清，丝绸之路在运行期间产生了2.14亿美元的销售额，而不是利润。\n有关于密码、区块链或Web3项目的新闻提示或内部信息吗？给我们发电子邮件：IPS@deccrypt.co。", "note_en": "Silk Road founder Ross Ulbricht is currently serving his seventh year of a double life sentence in prison. Supporters urge President Trump to &#34;Free Ross.&#34;\n   A photo of the &#34;Free Ross&#34; billboard in New York was yesterday posted on Twitter.\n A billboard calling for the release of Silk Road creator Ross Ulbricht has been photographed in New York’s Times Square.\n A photo of the billboard was yesterday   posted  on Twitter and features a picture of Ulbricht alongside the “Free Ross” caption. The website calling for Ulbricht’s release— freeross.org—is also on the billboard, which will   remain in Times Square for several months , according to the “ClemencyForRoss” Twitter account.\n   Ulbricht, 36, was arrested and imprisoned in 2013 for setting up Silk Road—a darknet market that allowed users to buy and sell illegal drugs and fake documents using  Bitcoin.\n The website ran from 2011 until 2013 and  reportedly  made  $214 million in sales before it was shut down by the FBI.\n Ulbricht is currently serving a double life sentence without parole in New York after being   found guilty  of drug trafficking, criminal enterprise, aiding and abetting the distribution of drugs over the internet, computer hacking and money laundering.\n A “ generous supporter” paid for the billboard, the freeross.org Twitter account  wrote . It added that “no #FreeRoss funds were spent on it.”\n    Ulbricht’s case has   caused controversy , and many high-profile figures in the crypto space have called for his release.\n A clemency   petition  was launched soon after Ulbrict’s imprisonment, alleging that his sentencing was “rife with abuse.” It will be sent to President Donald Trump asking for Ulbrict’s sentence to be reduced when it has 300,000 signatures.\n  Editor&#39;s note: This article was updated to clarify that the Silk Road generated $214 million in sales, not profits, during its run.\n Have a news tip or inside information on a crypto, blockchain, or Web3 project? Email us at:  tips@decrypt.co.", "posttime": "2020-05-22 06:53:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广告,app,出现,calling,广告牌", "title": "时代广场出现呼吁释放丝绸之路创始人的广告牌", "title_en": "Billboard calling for Silk Road founder’s release appears in Times Square", "transed": 1, "url": "https://decrypt.co/29763/billboard-calling-for-silk-road-founders-release-appears-in-times-square", "via": "", "real_tags": ["广告", "app", "出现", "calling", "广告牌"]}, {"category": "", "categoryclass": "", "imagename": "846b0c65821296bb90404ce02b7ce7f4.png", "infoid": 1003202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是为了成为史诗游戏的“像我是(二十五)岁的解释”版而设计的。或者，如果你想回到20世纪90年代，当时波托马克计算机系统公司(Potomac Computer Systems)成立的时候，“愚人史诗游戏”(Eic Games For Dummies)。相应地，技术术语和其他细节已被回避和简化。\n史诗游戏由蒂姆·斯威尼(Tim Sweeney)和马克·雷恩(Mark Rein)于1991年创立。斯威尼是首席执行官和大股东/控股股东，而腾讯拥有大约40%的股份。作为一家私营公司，Etic不公开披露其财务状况。然而，根据彭博社(Bloomberg)的说法，它在2018年(上一次融资时)的估值约为150亿美元，目前正在以“明显更高”的价格筹集更多资金。\n与Facebook、亚马逊、苹果、微软和谷歌价值6000亿至1.4万亿美元相比，Etic的估值并不算高。但对许多人来说，Etic有潜力成为世界上最大、最有影响力的科技公司之一。对于那些只知道“史诗”是热门视频游戏“堡垒之夜：皇室作战”标志的人来说，这似乎有些夸张。事实上，即使是“史诗”游戏的长期粉丝也可能会觉得这样的说法很奇怪，因为堡垒之夜在三年内创造的收入比“史诗”其他游戏在几乎几十年里创造的收入还要多。但在幕后，看起来史诗将越来越有可能成为社会数字未来的中心。\n这一潜力源于Etic的核心业务虚幻引擎的实力，该引擎已经被用来制作许多世界领先的游戏、电影和虚拟体验。当然，这包括Etic的Fortnite，它是全球玩得最多、利润最高的在线词汇之一。这款“游戏”的火爆程度不容错过。然而，它的成功使Etic迅速转型和扩大业务。这包括2018年史诗游戏商店的发布，2019年史诗在线服务的测试版发布和对社交视频应用Houseparty的收购，以及2020年史诗游戏出版的揭幕。Etic现在拥有350多万用户和23亿社交网络，是互联网上规模最大、增长最快的社交网络之一。\nEPIC日益增长的实力已经迫使媒体和娱乐业发生了巨大的变化。这包括迫使索尼(Sony)和微软(Microsoft)等蓝筹股巨头开放部分封闭的游戏生态系统，说服好莱坞传奇巨头允许他们的特许经营权混杂在一起，向世界展示曾经被认为只有“IRL”的体验，比如和朋友一起去听演唱会，只有在网上才有可能变得更好。\n但是，如果Etic成功地打造了它的“飞轮”，它将更戏剧性地重塑数字世界-从数据和隐私权，到新兴的技术标准，利润分配，以及人类工作和放松的方式。所有这些都对斯威尼对社会未来的长期愿景至关重要：Metaverse。\n这本入门读物的目的是引导读者了解史诗运动会的各个领域。具体地说，我们将详细介绍它为什么存在，它是如何运作的，它希望实现什么，为什么它很重要，以及它将如何加强整个史诗运动会。这第一部分的重点是虚幻引擎。其他的“史诗运动会盛事”可以在这里找到。\n游戏、虚拟世界和数字模拟都运行在基础代码或“引擎”上。它们管理从决策逻辑、规则和物理的处理(例如，按下X按钮，所以发射了子弹，从A点到B点，击中播放器2，等等)，到实时视频、声音制作、人工智能、内存和网络管理，等等。\n虽然每款游戏都需要引擎，但大多数游戏制造商(开发者和发行商)都是基于第三方引擎构建和运营他们的游戏。\n思考这个问题的一个好方法是考虑电影和电视节目。像漫威和迪士尼这样的公司不需要制造，更不用说设计、定制摄像机、编辑软件、数字存储等，就可以“制作”他们的电影和电视剧。取而代之的是，他们使用现成的设备、物理技术和由第三方专家设计的软件，例如Red Digital Cinema(相机)、Maya(计算机动画软件)和TechnicColor(色彩处理)。\n这种方法允许内容和制作公司只专注于他们最擅长的-字面上管理创作流程，如编写和选角，以及制作(拍摄)、发行(即营销，家庭视频销售)等。如果漫威或迪士尼需要制作真正需要的东西，他们可以只需构建这些东西，然后将其集成到现有软件中，等等。这里的一个例子是漫威专有的去老化技术。\n在简化的意义上，虚幻引擎是一套广泛的工具和技术，允许第三方产生虚拟体验，而不需要设计使它们“工作”所需的代码。事实上，他们甚至不需要知道他们是如何工作的。相反，开发人员可以只专注于创意。就像编剧不需要知道胶片是如何从相机捕捉到的，或者视频文件是如何在互联网上传输的一样。\n“…[虚幻引擎5]的更大目标是让内容创作者更有效率，这样你就可以用一个小团队开发下一代游戏，并在没有巨额预算的情况下产生令人难以置信的高质量结果。这项技术的局限性实际上只是游戏行业的问题之一。另一个是人们时间的限制和开发游戏的经济性，这对所有的游戏开发者来说都是一个限制因素。-蒂姆·斯威尼(Tim Sweeney)。\n然而，值得注意的是，游戏引擎套件的复杂性和范围远远超出了电影/电视的类比。捕获以单一顺序播放的视频帧比实时管理多人游戏的物理操作简单得多。此外，游戏引擎的技术能力在深度(例如图形有多好)和范围(例如添加AR、VR、实时语音转录)上都在不断增长。此外，这些增强功能需要在不破坏任何游戏或体验的情况下针对数百款游戏和多达数千种不同的设备进行部署。没有“更新虚幻，但只针对游戏X”。\n虚幻通常被认为最适合视觉丰富的游戏，特别是在游戏机/PC上玩的多人游戏。虚幻的大部分收入来自许可费，通常是收入的一个百分比(通常是5%)。这笔费用通常也可以预先买断。\nUnity比虚幻更容易使用，也更轻(即游戏文件可以更小)，但在技术上也有更多限制。这种权衡通常使它比虚拟现实更适合手机游戏，而且，在这一点上，它是手机游戏使用的主导引擎。这也意味着它也是整体上部署最广泛的发动机。重要的是，Unity不收取收入分成-你只需每月支付少量订阅费就可以使用该软件，类似于大多数设计软件，如Adobe Photoshop或Autodesk的AutoCAD。\nUnity还运营着一个移动广告网络，开发者无需查找、集成和管理第三方广告网络，就可以轻松地(即“拨动开关”)将其基于Unity的应用程序货币化，更不用说雇佣自己的广告销售队伍了。因此，他们可以更专注于游戏设计/创意。每个月，Unity在22亿台设备上投放230亿个广告。\n运营着世界上最大的数字游戏店面(Steam)的Valve也提供了Source Engine，但它并没有被广泛使用。亚马逊自2016年以来一直在运营LumberYard引擎，从Crytek的CryEngine购买了许可证，并将其分叉，但几乎没有看到它的用途。\n主要的出版商，如动视暴雪或Take-Two，通常使用专有引擎，而不是虚幻或Unity的引擎。\n这有几个原因。例如，主要发行商销售的大多数游戏都可以/将产生数亿甚至数十亿美元的收入。因此，虚幻的基于收入的许可费可能很快就会感觉“昂贵”，因此经常会有一种内源而不是版税的愿望。此外，这些发行商运营的游戏数量、巨大的收入和工程团队的规模意味着他们也有能力建造或开发专有引擎。事实上，许多人都有几个。\n主要出版商制造的引擎总体上没有像虚幻和Unity这样的专家那么强大。然而，后果很容易被夸大。虽然前沿的图形保真度或物理效果可以帮助区分游戏的发布营销，但游戏的成功是因为它们很有趣。此外，今天的收入模式主要依赖于持续的参与，而不是销售副本的能力。\n目前第八代游戏机中最畅销的游戏，2013年的侠盗猎车手：V，是为第七代游戏机量身定做并发布的。因此，它看起来比它卖得更好的几乎每一款AAA游戏都要“糟糕”得多。这很好！GTA：V之所以成功，是因为它有趣和多样化，而不是因为它在视觉上逼真地描绘了有组织的无政府主义犯罪。同样，全球玩得最多的AAA游戏，“我的世界”和“Roblox”，看起来就像21世纪初的游戏，而且大部分也可能是那个时候制造的。它们是关于创造，而不是模拟现实。\n此外，发行商引擎通常是专门为特定游戏或流派构建的。例如，动视暴雪每年都专注于改善“使命召唤”引擎的视觉效果和物理效果，但主要是为了相同的外观(粗暴的战争模拟)，固定的游戏风格(快速抽搐的第一人称射击游戏)和有限的设备数量(例如PC和控制台)。这并不是要降低这些改进的质量或易用性，但引擎的设计并不会超出它所需的体验，因为这不是必需的；使命召唤不需要大提琴阴影。因此，这些引擎可以提供特定的体验-足够接近虚幻可能实现的体验。\n此外，“虚幻”并不一定适合所有类型的游戏。即使是这样，一些开发人员也更喜欢对“引擎”代码进行更好的控制。在其他情况下，开发人员想要做的事情可能还没有得到虚幻的支持，因此他们宁愿自己构建它，而不是等待。\n许多出版商还谈到了在这样的关键技术上依赖第三方的战略风险。一些出版商认为，五年后，虚幻或Unity可能会突然提高他们的收入分担率。即使这些公司为老游戏提供“祖辈”价格，提价也会降低所有未来游戏的利润率。而且在开发过程中更换引擎的成本是巨大的(延误、预算增加、新招聘)。在其他情况下，开发人员可能想要或需要一些虚幻或Unity还不支持并且不能及时实现的东西。即使这些特性或功能已经计划好了，它们也可能会被取消或推迟。此外，虚幻的许可条款还意味着，在某些情况下，开发人员构建的技术或工具可以免费授权回虚幻，然后虚幻可以将这些创新提供给开发人员的竞争对手。\n虽然这些担忧是可以理解的，但在过去的15年里，第三方引擎的使用已经有了相当大的增长，今天即使是主要的出版商也在使用第三方引擎。例如，任天堂的2019年开关游戏，吉的精心制作的世界，使用了虚幻，就像Square Enix的王国之心3和最终幻想7翻拍一样。与此同时，动视暴雪的炉石是基于团结的。这类例外通常是由于时间限制、预算有限或游戏需求与发行商自己引擎的能力不匹配造成的。\n然而，更重要的是，大多数新成立的游戏工作室都在使用虚幻或Unity。对于像动视暴雪和任天堂这样几十年的老巨人来说，跟上领先的独立引擎是一回事。试图从头做起，同时还试图打造一款新的热门游戏，几乎是不可能的。\n唯一接近的公司是尼安蒂克公司。然而，尼安蒂克并没有构建一个像“虚幻”或“团结”这样的游戏引擎。事实上，精灵宝可梦Go运行在Unity平台上，“哈利波特：巫师联盟”也是如此。取而代之的是，Nitic提供了一套“真实世界”的平台工具，可以挂接到其他引擎上，并用于在其他引擎上构建。而且，这个平台也不是重新搭建的。2015年，Nitic从谷歌地图集团剥离出来，想必从前母公司那里获得了一份不可能购买的慷慨的长期技术许可证(当然，自那以后，它的技术已经积累了相当多)。此外，该公司的第一款热门游戏“精灵宝可梦Go”是基于历史上票房最高的媒体特许经营权的许可。\n“现在造一台发动机的成本是上亿美元，代表着几百人多年的劳动。你不能再建造一个只适用于一种游戏的引擎了。经济学是行不通的。“。-蒂姆·斯威尼(Tim Sweeney)。\n此外，值得注意的是，暴动游戏，世界上最受欢迎的AAA型游戏英雄联盟的制造商，决定使用虚幻为其备受期待的新射手，Valorant。Riot归腾讯所有，腾讯拥有Epic40%的股份，这一事实显然与这一决定有关。然而，Riot是一家成立近15年的高盈利、技术熟练的大型出版商。它完全有能力制造一台新发动机或改装一台旧发动机。因此，从他们完全拥有和运营的发动机转向虚幻引擎的决定是有启发意义的。\n随着视频游戏复杂性的增加，使用第三方引擎专家的动机/需求也在增加。\n在游戏的最初几十年里，大多数游戏都是专门为特定的设备设计的，比如专用的游戏机、超级任天堂或PlayStation。这使得引擎设计变得相当简单-例如，Square Enix知道其游戏将在其上运行多年的确切设备。随着时间的推移，出版商在两个平台(如PlayStation和Xbox)上发布图书变得很常见，但它们的技术硬件和输入设备大致相同。当然，个人电脑的难度要大得多，因为有几十家制造商，每家制造商都将自己的设备与不同的组件混合搭配，其中大部分每年都会发生变化。这就是为什么像虚幻这样的独立引擎首先服务于个人电脑市场。然而，这里的复杂性是由高性能要求管理的，这意味着绝大多数PC不能玩游戏。\n然而，今天，大多数游戏都渴望在尽可能多的平台上运行-并支持这些平台之间的交叉游戏。更重要的是，现在的平台比以往任何时候都多，有些平台不仅有多个版本(例如iPad v.iPad Air v.iPad Pro)，而且每年都会更新。这使得发动机设计变得相当困难。制作一款只在PlayStation3上运行的游戏是一回事，让它在PlayStation3和Xbox360上运行是另一回事，仍然支持PlayStation4、PlayStation5、Xbox One和Xbox Series X以及各代iPad、iPhone和安卓…是另一回事。并允许每个设备上的玩家相互玩耍。在虚幻平台上开发不仅可以让发行商将更多的时间集中在创意/制作上，还可以消除他们的游戏是否能在所有平台上都能很好地运行(并继续运行)的担忧，以及确保这一点的巨大成本/负担。\n作为一家被广泛部署的发动机专家，虚幻还受益于不断增加的独特反馈回路，这些回路扩大了其技术领先地位。\n如上所述，虚幻的许可条款还意味着，在某些情况下，由开发人员构建的技术或工具可以免费授权回虚幻。这意味着引擎受益于数千名开发人员的工作，而专有的发布者引擎最多只有几百个。此外，虚幻的工程团队可以获得数倍多的玩家/使用/性能数据，这反过来又允许更知情的开发和投资。\n尽管发行商的引擎通常足以满足他们设计的游戏，但这种方法仍然限制了创新、投资和质量。考虑这种反馈循环的最佳方式是将目光投向游戏以外的领域：\n许多人认为，就像手绘卡通和实际效果转向CGI一样，所谓的“实时虚拟制作”游戏引擎是动画和真人视频的未来。为此，2019年最大的两个视频发布，《狮子王》和《曼达洛人》，完全分别在Unity和Unreal上拍摄。这种技术转变的意义怎么估计都不为过。整个曼达洛人，从其未命名的冰雪世界，到沙漠星球内瓦罗和森林覆盖的沙根-以及其中的每一个布景-几乎都是在加利福尼亚州曼哈顿海滩的一个虚拟舞台上拍摄的。这对该剧以一半的电影预算和两倍以上的放映时间提供电影级视觉效果的能力至关重要。然而，它也提供了独特的电影灵活性。导演乔恩·法夫罗(Jon Favreau)对每一个镜头的元素都有完美的控制-随时提供完美的日落(和完美的位置云)。而且，他不需要根据绿幕支持的布景的外观来选择相机角度，而是可以在完全渲染的布景中移动，以实时拾取(和更改)真正完美的角度。考虑到COVID相关的旅行限制和片场人数，这里的好处特别大。\n随着虚幻在电影和电视领域的扩张，它也有望成为现场音乐/活动的领先者。“虚幻”也经营着迪士尼的“星球大战：银河边缘”主题公园的大部分景点。(值得注意的是，Etic的CTO Kim Libreri之前是卢卡斯电影公司的高级技术副总裁。)。例如，索尼音乐(Sony Music)已经宣布，它正在为基于虚幻的演唱会建立一个技术团队。这一举动特别能说明问题，因为索尼音乐的姊妹公司索尼互动娱乐拥有自己的游戏平台(PlayStation)和众多专有引擎。\n不真实也超出了娱乐的范畴。在过去的五年里，许多城市规划、建筑和汽车工程公司已经将他们的工作流程和设计转移到了虚幻引擎或Unity。这样不仅可以更轻松、更复杂地渲染它们的模型，而且还可以呈现基于它们的全功能模拟。例如，香港国际机场使用Unity来模拟客运量的变化。与此同时，建筑公司可以很容易地为潜在客户提供一种模型，这种模型实际上可以通过触摸屏、鼠标或VR耳机进行探索，或者在各种天气条件下进行测试。如果被选中，那么它的客户就可以使用同样的模型启动这家商店的数字复制品-甚至在物理版本开放之前就可以这样做。\n许多中学现在也将虚幻作为其课程的一部分(Epicc提供了基于学生设计Rube Goldberg机器、建设可持续城市、制作经典小说另类结局的动画等的课程计划者)。EPIC的游戏引擎甚至被美军用于模拟。\n虚幻公司业务的规模和范围意味着Etic可以投资于能力、技术和收购，这些对于只专注于创建或营销视频游戏的公司来说是不切实际的。\n此处的示例包括立方体运动(2020)、3Lside(2019)和Quixel(2019)。前两家公司在创造逼真的、通常是实时生产的数字人类方面处于领先地位。与此同时，Quixel创造了现实世界环境的“巨型”，可以很容易地适应这些环境，然后通过“虚幻”来构建。任何出版商都可以尝试在公司内部复制这些技术，或者收购竞争对手的初创公司。多么。\n..", "note_en": "This is designed to be an “Explain Like I’m (Twenty) Five” edition of Epic Games. Or if you want a throwback to the 1990s, when then-Potomac Computer Systems was founded, “Epic Games For Dummies”. Technical terms and other details have been eschewed and simplified accordingly.\n Epic Games was founded by Tim Sweeney and Mark Rein in 1991. Sweeney is the CEO and majority/controlling shareholder, while Tencent owns roughly 40%. As a private company, Epic does not publicly disclose its financials. However, it was valued at roughly $15B in 2018 (when it last raised capital) and is currently raising more at a “significantly higher” price,  per Bloomberg.\n Compared to Facebook, Amazon, Apple, Microsoft and Google, which are worth $600B to $1.4T, Epic’s valuation is modest. But to many, Epic has the potential to become one of the largest, most influential tech companies in the world. This might seem hyperbolic to those who know Epic only as the marker of the hit video game  Fortnite: Battle Royale. In fact, even long-time fans of Epic’s games might find such a pronouncement odd given  Fortnite has generated more revenue in three years than the rest of Epic has in almost as many decades. But behind the scenes, it looks increasingly likely that Epic will be at the very center of society’s digital future.\n This potential stems from the strength of Epic’s core business, the Unreal Engine, which is already used to produce many of the world’s leading games, movies and virtual experiences. This includes, of course, Epic’s  Fortnite, which is one of the most played and profitable online words globally. The popularity of this “game” is hard to miss. However, its success has enabled Epic to rapidly transform and expand its business. This includes the 2018 launch of Epic Games Store, the 2019 beta-release of Epic Online Services and acquisition of social video app Houseparty, and the 2020 unveiling of Epic Games Publishing. And with 350MM+ users and 2.3B social connections, Epic now operates one of the Internet’s largest and fastest growing social networks.\n Epic’s growing strength has already forced enormous change in the media and entertainment industry. This includes forcing blue chip giants like Sony and Microsoft to open up parts of their closed gaming ecosystems, convincing storied Hollywood giants to allow their franchises to intermingle, and showing the world that experiences once thought to be “IRL” only, like going to a concert with friends, had the potential to be even better when online-only.\n But if Epic is successful in building out its ‘flywheel’, it will even more dramatically reshape the digital world - from data and privacy rights, to emergent technical standards, the distribution of profits, and the very ways in which humans work and relax. And all of this is critical to Sweeney’s long-term vision of society’s future: the Metaverse.\n The purpose of this primer is to walk readers through each area of Epic Games. Specifically, we’ll detail why it exists, how it works, what it hopes to achieve, why it matters, and how it will strengthen Epic Games overall. This first part focuses on the Unreal Engine. The rest of the ‘Epic Games Prime’ can be found   here.\n  Games, virtual worlds, and digital simulation run on foundational code, or “engines”. These manage everything from the processing of decision logic, rules, and physics (e.g. the X button was pressed, so a bullet was fired, which traveled from point A to point B, hit player 2, etc.), to real-time visuals, sound production, artificial intelligence, memory and network management, and so forth.\n   While every game requires an engine, the majority of game makers (developers and publishers) build and operate their games based on a third-party engine.\n A good way to think about this is to consider movies and TV shows. Companies like Marvel and Disney don’t need to manufacture, let alone design, custom cameras, editing software, digital storage, etc., to “make” their films and TV series. Instead, they use off-the-shelf equipment, physical technologies, and software designed by third-party specialists, such as Red Digital Cinema (cameras), Maya (computer animation software), and Technicolor (color processing).\n This approach allows content and production companies to focus only on what they are best at — literally managing creative processes such as writing and casting, as well as production (filming), distribution (i.e. marketing, home video sales), etc. And should Marvel or Disney ever need something truly required for production, they could just build  that and then integrate it into existing software, etc. An example here is Marvel’s proprietary de-aging technologies.\n In a simplified sense, Unreal Engine is an extensive suite of tools and technology that allows third parties to produce virtual experiences without needing to engineer the code that’s needed to make them “work”. In fact, they need not even  know how they work. Instead, a developer can just focus on the creative. Just as a writer doesn’t need to know how film is captured from a camera, or how video files are streamed over the Internet.\n “...The bigger aim [with Unreal Engine 5] is to make content creators more productive, so that you can build next-generation games with a small team and produce incredibly high-quality results without a vast budget. The limitations of the technology are really only one of the game industry&#39;s problems. The other is the limits of people&#39;s time and the economics of building games, which is always a limiting factor for all game developers&#34;. -   Tim Sweeney\n Notably, however, the complexity and scope of a game engine suite goes far beyond the film/TV analogy. Capturing frames of video that are played back in a single order is far simpler than managing the physics of a multiplayer game in real time. In addition, the technical capabilities of a game engine are constantly growing in both depth (e.g. how good the graphics are) and range (e.g. adding AR, VR, live voice transcription). Furthermore, these enhancements need to be deployed against hundreds of games and up to thousands of different devices without breaking any games or experiences. There is no “update Unreal but only for Game X”.\n    Unreal is typically considered best for visually rich games, especially multiplayer ones played on consoles/PCs. Unreal makes most of its money via a licensing fee, typically as a percentage of revenues (usually 5%). This fee can typically be bought out upfront, too.\n Unity is easier than Unreal to use and lighter (i.e. game file sizes can be smaller) but also more technically limited. This tradeoff typically makes it a better fit than Unreal for mobile games, and, to this point, it’s the dominant engine used for mobile games. This also means it’s the most widely deployed engine overall, too. Importantly, Unity does not charge a revenue share — you only pay a small monthly subscription to use the software, similar to most design software such as Adobe Photoshop or Autodesk’s Autocad.\n Unity also operates a mobile ad network that allows developers to easily (i.e. “flip a switch”) monetize their Unity-based apps without a need to find, integrate, and manage third-party ad networks, let alone hire their own ad sales force. Accordingly, they can focus even more exclusively on just the game design/creative. Each month, Unity delivers 23 billion ads across 2.2 billion devices.\n Valve, which operates the world’s largest digital gaming storefront (Steam) also offers the Source engine, but it’s not widely used. Amazon has operated the Lumberyard engine since 2016, having bought a license from and forked Crytek’s CryEngine, but it has seen little use.\n   The major publishers, such as Activision Blizzard or Take-Two, typically use proprietary engines over those of Unreal or Unity.\n There are a few reasons for this. For example, most of the games sold by the major publishers can/will generate hundreds of millions or even billions in revenues. As a result, Unreal’s revenue-based licensing fee can quickly feel “expensive,” and thus there’s often a desire to insource versus royalty-out. In addition, the number of games these publishers operate, the enormity of their revenues, and the size of their engineering teams mean that they can also afford to build or develop a proprietary engine. In fact, many have several.\n The engines made by the major publishers are less capable overall than those of specialists like Unreal and Unity. However, the consequences are easy to overstate. While cutting edge graphical fidelity or physics can help differentiate a game’s release marketing, games succeed because they’re fun. Furthermore, revenue models today mostly depend on ongoing engagement, not the ability to sell a copy.\n The bestselling game of the current, eighth generation of consoles, 2013’s  Grand Theft Auto: V, was made for and released on the seventh. Accordingly, it looks much “worse” than almost every AAA game it has outsold. And that’s fine!  GTA:V succeeds because it’s fun and diverse, not because it’s a visually realistic portrayal of organized and anarchist crime. Similarly, the most played AAA games globally,  Minecraft and  Roblox, look like games from the early 2000s and could mostly have been made then, too. They’re about creation, not simulating reality.\n In addition, publisher engines are typically purpose-built for a specific game or genre. Each year, for example, Activision Blizzard focuses on improving  Call of Duty engine’s visuals and physics, but primarily for the same look (gritty war simulation), fixed style of gameplay (fast-twitch first person shooters) and limited number of devices (e.g. PC and console). This isn’t to diminish the quality or ease of these improvements, but the engine isn’t designed to stretch far beyond the experience it needs to generate because it isn’t required;  Call of Duty doesn’t need cel-shading. As a result, these engines can offer specific experiences that are close-enough to what Unreal might enable.\n In addition, Unreal is not necessarily the right fit for all types of games. And even when it is, some developers prefer greater control over the “engine” code. In other cases, what a developer wants to do might not yet be supported by Unreal, and thus they’d rather build it themselves than wait.\n  Many publishers also talk about the strategic risk of relying on a third party for such critical technology. In five years, some publishers argue, Unreal or Unity might suddenly increase their revenue share rates. Even if these companies offer “grandfathered” rates on old games, a price hike would cut the profit margins of all future games. And the cost of changing engines mid-development is enormous (delays, budget increases, new hiring). In other cases, a developer might want or need something that Unreal or Unity doesn’t yet support and won’t get to in time. And even if these features or capabilities are planned, they could be cancelled or delayed. Additionally, Unreal’s licensing terms also mean that in some cases technology or tools built by a developer are then freely licensed back to Unreal, which can then provide these innovations to the developer’s competitors.\n Though these concerns are understandable, usage of third-party engines has grown considerably in the last 15 years, and today even major publishers use third-party engines. For example, Nintendo’s 2019 Switch game,  Yoshi’s Crafted World, uses Unreal, as does Square Enix’s  Kingdom Hearts 3 and  Final Fantasy 7 Remake. Activision Blizzard’s  Hearthstone, meanwhile, is based on Unity. Such exceptions typically result from constrained timelines, limited budgets or a mismatch between what a game needs and the capabilities of the publishers’ own engines.\n More important, however, is the fact that the majority of newly formed game studios are using Unreal or Unity. It’s one thing for decades’ old giants like Activision Blizzard and Nintendo to keep up with the leading independent engines. Trying to do so from scratch while also trying to build a new hit game is nearly impossible.\n The only company to get close is Niantic. However, Niantic didn’t build a game engine like Unreal or Unity. In fact,  Pokémon Go runs on Unity, as does  Harry  Potter: Wizards Unite. Instead, Niantic offers a suite of “real world” platform tools that can hook into and be used to build atop other engines. Furthermore, this platform wasn’t built anew, either. In 2015, Niantic spun out of Google’s Maps group and presumably received an impossible-to-buy and generous long-term technology license from its former parent (though, of course, it has built up its technology considerably since). In addition, the company’s first hit game,  Pokémon Go, is based on a license from the highest-grossing media franchise in history.\n “The cost of building an engine now is hundreds of millions of dollars, representing the work of hundreds of people for many years. You can’t build an engine that’s just good for one type of game anymore. The economics don’t work”. -   Tim Sweeney\n In addition, it’s important to note that Riot Games, maker of the world’s most popular AAA game  League of Legends, decided to use Unreal for its highly anticipated new shooter,  Valorant. The fact that Riot is owned by Tencent, which owns ~40% of Epic, is obviously relevant to this decision. However, Riot is a highly profitable, technically skilled, and large publisher that’s close to 15 years old. It is fully capable of building a new engine or adapting an old one. The decision to shift from an engine they fully own and operate to Unreal is therefore instructive.\n   As the complexity of video games grows, the incentives/need to use a third-party engine  specialist are growing, too.\n For gaming’s first few decades, most games were purpose built for a specific device such as a dedicated arcade unit, Super Nintendo or PlayStation. This made engine design fairly simple - Square Enix, for example, knew the exact device its game(s) would run on for years. Over time, it became common for a publisher to release a title on two platforms (e.g. PlayStation and Xbox), but their technical hardware and input devices remained broadly similar. PCs were much more difficult, of course, as there were scores of manufacturers, each of which mixed-and-matched their devices with different components, most of which changed annually. This is why independent engines like Unreal first served the PC market. However, complexity here was managed by high performance requirements that meant the vast majority of PCs couldn’t play a game.\n Today, however, most games aspire to work on as many platforms as possible - and to support cross-play between these platforms. What’s more, there are more platforms than ever and several have not just multiple editions (e.g. iPad v. iPad Air v. iPad Pro), but refresh annually. This makes engine design considerably harder. It’s one thing to make a game that works just on PlayStation 3, another to have it work on PlayStation 3 and Xbox 360, and another still to support PlayStation 4 and PlayStation 5 and Xbox One and Xbox Series X and various generations of iPads, iPhones and Android… and allow players on each device to play with one another. Developing on Unreal not only allows a publisher to focus more of its time on creative/production but also eliminates the worry about whether their game will work (and continue to work) well across all platforms and the enormous cost/burden of ensuring so.\n As a widely deployed engine specialist, Unreal also benefits from an ever-growing number of unique feedback loops that expand its technical lead.\n As mentioned above, Unreal’s licensing terms also mean that in some cases technology or tools built by a developer are then freely licensed back to Unreal. This means that the engine benefits from the work of thousands of developers while proprietary publisher engines max out at a few hundred. In addition, Unreal’s engineering team gets access to multiple times more player/usage/performance data, which in turn allows for better informed development and investment.\n And although publisher engines are typically sufficient for the games they’re designed for, this approach nevertheless limits innovation, investment, and quality. The best way to consider this feedback loop is to look beyond gaming:\n Many believe that just as hand-drawn cartoons and practical effects shifted to CGI, so-called “real-time virtual production” game engines are the future of both animation and live action video. To this end, two of the biggest video releases of 2019,  The Lion King and  The Mandalorian, were shot entirely on Unity and Unreal respectively. This significance of this technological shift is hard to overestimate. The entirety of  The Mandalorian, from its unnamed ice world, to the desert planet Nevarro and the forested Sorgan — and every set within them — was almost exclusively shot on a single virtual stage in Manhattan Beach, California. This was critical to the show’s ability to offer film-grade visuals at half a film budget and more than twice the running time. However, it also offered unique cinemagraphic flexibility. Director Jon Favreau had perfect control over the elements of every shot — affording the perfect sunset (and perfectly positioned clouds) at any time. And rather than need to pick camera angles based on how a set looks backed by a greenscreen, he could literally move around the fully rendered set to pick (and change) the truly perfect angle in real time. The benefits here are particularly large given COVID-related restrictions on travel and the number of people on set.\n  And as Unreal expands in film and TV, it’s also expected to become a leader in live music/events, too. Unreal also runs much of Disney’s  Star Wars: Galaxy’s Edge theme park attraction. (Notably, Epic’s CTO, Kim Libreri, was previously SVP Technology at Lucasfilm.) Sony Music, for example, has  already announced it’s building a technology team for Unreal-based concerts. This move is particularly telling as Sony Music’s sister company Sony Interactive Entertainment has its own gaming platform (PlayStation) and numerous proprietary engines.\n  Unreal goes beyond entertainment, too. Over the past five years, a number of urban planning, architecture, and automotive engineering firms have shifted their workflows and designs to Unreal Engine or  Unity. This allows for not just easier and more sophisticated rendering of their models, but also the ability to present fully functional simulations based around them. For example, Hong Kong International Airport uses Unity to simulate changes in passenger volumes. An architectural firm, meanwhile, can easily offer a would-be client a model that can actually be explored via touchscreen, mouse, or VR headset, or tested under various weather conditions. And if selected, its client could then launch a digital replica of this store using this same model — and do so even before the physical version opens.\n Many secondary schools now use Unreal as part of their curricula, too (Epic offers  lesson planners based around students designing Rube Goldberg machines, building sustainable cities, animating alternate endings to classic novels, etc). Epic’s game engine is even used by the US military for simulations.\n  The scale and scope of Unreal’s business means that Epic can invest in capabilities, technologies, and acquisitions that are impractical for companies that focus only on creating or marketing a video game.\n Examples here include Cubic Motion (2020), 3Lateral (2019), and Quixel (2019). The first two companies are leaders in the creation of realistic, often produced-in-real-time digital humans. Quixel, meanwhile, creates “megascans” of real-world environments that can be easily adapted into and then built upon via Unreal.  Any publisher can try to replicate these sorts of technologies in house or buy competing startups. How\n......", "posttime": "2020-05-22 06:52:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,epic", "title": "史诗游戏入门(第一集)：史诗的飞轮与虚幻引擎", "title_en": "Epic Games Primer (Pt I): Epic's Flywheel and Unreal Engine", "transed": 1, "url": "https://www.matthewball.vc/all/epicprimer1", "via": "", "real_tags": ["游戏", "epic"]}, {"category": "", "categoryclass": "", "imagename": "b3eb19ce4448cdbfec2d85a17c907920.jpg", "infoid": 1003201, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在冠状病毒封锁期间，海滨度假似乎是一个遥远的记忆，但在首尔的江南区，海洋已经来到了这座城市。\n韩国最大的数字广告牌SMTOWN COEX大楼的LED正面出现了巨浪。在撞到屏幕表面之前，变形幻觉就出现了，使二维环绕显示看起来更像一个大水箱。\n这个模拟每小时恰好出现一分钟，如此逼真，看起来就像水要倒在穿过繁忙商业广场的人的头上一样。\n这个名为“波浪”的项目由d&#34；Strict设计，这是一家专门利用沉浸式技术创作公共艺术的公司。该项目从头到尾执行了四个月，其中包括三个月的数字设计工作，以确保达到预期的效果。\n我们希望创造压倒性的体验，d；Strict的业务发展总监李军(Jun Lee)表示。波浪本身是美丽和充满活力的，但我们选择它们作为我们的主题是因为它们唤起了舒适的感觉--这是现在非常需要的。\n社交媒体对这是放松还是压力意见不一。一位用户将它比作洗衣机的内部，而另一位用户沉思着说，它就像一片自我隔离的大海。\n屏幕尺寸为80x20米(262x66英尺)，是品牌广告、韩国流行音乐视频以及最近数字艺术装置的流行平台。\n该创意项目是d&#39；Strict为三星(Samsung)和LG等客户提供的包括商业工作和户外安装在内的产品组合中的最新成员。\n今年夏天，d&#39；Strict预计将在济州岛推出一个以艺术和科技为灵感的室内主题公园，除了其他变形空间外，还将有一个全息剧场。", "note_en": "Beachside vacations may seem like a distant memory during coronavirus lockdowns, but in Seoul&#39;s Gangnam District, the ocean has come to the city.\n  A giant wave has appeared on the LED façade of the city&#39;s SMTown COEX building, South Korea&#39;s biggest digital billboard. The anamorphic illusion rears up before crashing into the surface of the screen, making the two-dimensional wraparound display seem more like a large tank.\n Appearing for exactly one minute every hour, the simulation is so realistic it looks as if water is about to pour over the heads of people who pass through the busy commercial square.\n  Titled &#34;WAVE,&#34; the project was designed by d&#39;strict -- a firm that specializes in using immersive technology to create public art. The project took four months to execute from start to finish, including three months of digital design work to make sure it achieved the desired effect.\n &#34;We want to create overwhelming experiences,&#34; said Jun Lee, Business Development Director at d&#39;strict. &#34;Waves are beautiful and dynamic in themselves but we chose them as our subject because they evoke feelings of comfort -- which is much needed now.&#34;\n Social media split on whether it was relaxing or stressful. One user compared it to the inside of a  washing machine while another mused that it was like a  &#34;self quarantined sea.&#34;\n  The screen, measuring 80 by 20 meters (262 by 66 feet), is a popular platform for brand advertisements, K-pop videos, and more recently, digital art installations.\n The creative project is the latest addition to d&#39;strict&#39;s portfolio, which includes commercial work and outdoor installations, for clients such as Samsung and LG.\n This summer, d&#39;strict is expected to launch an art- and technology-inspired indoor theme park on Jeju Island, featuring a holographic theater among other anamorphic spaces.", "posttime": "2020-05-22 06:51:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "海浪,sweeps,屏幕", "title": "巨大的3D海浪席卷首尔江南区", "title_en": "Giant 3D wave sweeps over Seoul's Gangnam District", "transed": 1, "url": "https://www.cnn.com/style/article/3d-wave-in-seoul/index.html", "via": "", "real_tags": ["海浪", "sweeps", "屏幕"]}, {"category": "", "categoryclass": "", "imagename": "c0362738aabaae0dd047d0da564ce5ae.png", "infoid": 1003200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇帖子是GitHubbers关于提高生产力、效率等的ProTips系列的一部分。继续阅读，了解莎拉·弗弗斯的建议。\n我每天的大部分工作时间都花在编写代码和拉请求上。我喜欢构建东西，我喜欢你们都使用它们，所以我非常有动力将我的更改带到那里！我想和你们分享一个对我很有效的过程。\n有时，我的拉取请求太大，无法轻松查看，因为我的分支相对于基本分支包含了太多更改。我更喜欢打开较小的请求，而不是强迫我的团队费力地通过一千行代码，同时试图让他们记住所有事情并发现任何问题。较小的Pull请求往往合并得更快，因为它们更容易推理，因此审查者可以轻而易举地通过并充满信心地批准，而且因为它们与基本分支冲突的机会较小。\n然而，我的大脑不会考虑小的拉动请求！我有了一个想法，我想在它溜走之前将我的想法转换成代码-在我的编辑器中以黑绿色显示出来。能够将我的特性或错误修复记录在单个分支中，这有助于我确认它是否如我预期的那样工作，并允许我测试整个系统。我可以根据使用该数据模型的UI和端点是如何组合在一起的，来验证我选择的数据模型是否是一个好的数据模型。不幸的是，这种“一个分支中的一切”的方法与我希望向我的队友提供小的、容易审查的拉请求的愿望不一致，特别是在这些分支往往会变大的情况下。\n如果我试图从一开始就将我的代码拆分成单独的分支，我常常很难知道哪些代码在哪个分支中是有意义的。我发现自己花了太多的时间考虑我是否将承诺放在了正确的分支上，而不是考虑我正在构建的功能。我感觉它也阻碍了编码的创造性过程，不得不担心将代码整齐地划分为连贯的、易于审查的分支，而不是仅仅跟随功能开发的方向。\n我通过同时做这两种方法来协调这两种方法，但要按顺序进行：在单个分支中完成我最初的工作，而不是担心它会变得多大，然后再开设新的分支来梳理出可以单独完成的更小的原子工作。我可以使用Git Cherry-Pick将我的大分支中的一些部分拉到一个非常集中的小分支中，然后从那个小分支打开一个拉回我的存储库的默认分支的请求。随着每个较小的分支被合并，当我使用基分支中的最新代码更新我原来的大分支时，diff会变得越来越小，因为它的更多更改现在已经在基分支中了。我可以根据需要重复这个过程多次，直到原来的大分支不再那么大，以至于复查起来很痛苦。\n假设我想在博客中实现分类。这可能需要：用于添加新表和字段的数据库更改、用于在数据库适配器级别验证数据的逻辑、用于支持读/写/删除类别的新端点、允许您访问这些新端点的用户界面更改，最后是用于改善用户体验的JavaScript。我实现这样一个特性的方法是创建一个类似Add-Categories的分支，并在该分支中获取所有内容。我会添加足够的测试来确认我的方法正在做我期望它们做的事情，并通过在浏览器中签出来手动验证其他所有内容。分支的目的是作为一种尖峰，一个测试平台，用来验证我的实现是否正确。我可以为这个分支打开一个拉式请求，不是请求审查，也不是要合并，而是让我的团队自己尝试，看看我正在考虑的整体方法。\n一旦我对Add-Categories分支感到满意，我将返回到存储库的默认分支并启动一个新分支。我试着考虑在我的功能分支的任何部分落地之前必须发生的最低级别、最早的更改。在本例中，是数据库更改。没有这些，端点、UI和JavaScript就无关紧要了！\n我会打开一个类似CATEGORY-db的分支，并将所有相关工作从Add-Categories拉到其中。理想情况下，当我一直在处理添加类别时，我会进行原子提交，这样我就可以运行git挑剔命令来停止数据库更改。然而，情况并不总是如此，对于那些时候，我倾向于在gihub上打开我的添加类别拉取请求，然后转到“Files Changed”选项卡，在那里我可以很容易地将文本和文件块复制到ategory-db中的新提交中。\n将更改拉到完全专用于该更改的分支中有一个很好的副作用，那就是它会带来更好的测试覆盖率。如果我试图登陆我原来的Add-Categories分支，我需要确保它对数据库验证、端点、用户界面和JavaScript功能进行了良好的测试。我经常得到的测试代码大小至少是测试代码的两倍，所以测试真的会增加拉请求的大小！我不想要那种“这个测试真的值得增加吗，它会让差异变得更大”的精神压力，当我知道整个分支非常专注，不包含完全不同的想法时，那种内部斗争就会消失。\n我把我较小的分支机构视为将由我的团队彻底审查的分支机构，因此它们得到了很多润色。全面的拉取请求描述、测试覆盖范围以及对性能和用户体验的考虑非常重要。在本例中，我最初的Add-Categories分支将作为一个草案拉入请求开始，并保持这种状态，直到我完成了从中筛选出的所有较小分支的登陆。一旦Add-Categories足够小，因为它的足够部分已经落在不同的分支中，我将完成它的测试，更新Pull请求描述以反映分支的剩余内容，最后删除它的Draft状态，这样我的团队就会被ping以供审查。\n有时，以菊花链形式连接我的拉取请求会很有帮助。在创建CATEGORY-db分支之后，我想看看还没有在CATEGORY-db中的Add-Categories中还有哪些更改。查看原来的大分支中剩下的内容将让我决定它是否足够小，可以提交给代码审查，或者是否需要从它中取出另一个小分支。要查看剩余的更改，我将编辑GitHub上的添加类别拉取请求，将其基本分支从存储库的默认分支更改为CATEGORY-db。然后，在将结果推送到gihub之前，我可以检查add-ategories分支和git合并类别-db。这将更新我的Pull请求上显示的diff，以便现在在Category-db中的所有代码不再显示在add-Categories Pull请求中。\n也许添加类别对我来说仍然太大，不能让我的团队进行审查。新的数据验证可能是我拉到他们自己的分支机构的下一个部分。在CATEGORY-DB上，我可以创建一个新分支，比如CATEGORY-VALIDATIONS。我会重复前面的过程，在可能的情况下挑选相关的提交，否则从Add-Categories的Pull Request视图中批量复制代码。一旦将类别验证推送到GitHub，我就可以打开一个拉取请求，将CATEGORY-db作为基础，将CATEGORY-VALIDATIONS作为头分支。然后，我可以再次更新我的添加类别拉入请求，以便它的基本分支现在是类别验证，而不是类别数据库。这导致了菊花链效应，其中我的分支是：Main←CATEGORY-db←CATEGORY-Valiations←Add-Categories。\n%git branchadd-Categories//添加整个类别功能Category-db//添加数据库表*CATEGORY-VALIDATIONS//添加验证逻辑+testsmaster。\n像这样链接拉取请求的另一个好处是它解除了我的阻碍。也许Category-db还不能合并，因为它描述的数据库更改还没有发生，所以我的其他分支也不能合并。通过为单独的小分支机构打开许多拉式请求，我仍然可以专注于让我的团队对每个分支机构进行全面的测试和审查。通过确保测试通过并得到批准，我可以准备好要合并的每组更改，然后当Category-db准备好合并时，我将能够在短时间内获得几个分支，因为依赖于Category-db的分支已经通过了审查过程。\n一旦我的一个较小的分支被合并，我就可以更新基于它的拉取请求，而不是基于我的存储库的默认分支。因此，当我的CATEGORY-DB分支被合并时，我更新了CATEGORY-VALIDATIONS PULL请求，使其基本分支成为主要分支。最终，所有较小的分支都合并了，我剩下的只有一个拉取请求，也就是基于默认分支的原始Add-Categories请求。只是这一次，Add-Categories是一个合理的大小，我可以要求我的团队进行审查。至此，Add-Categories可能已经更改\n通过让我自己专注于用代码表达我的想法，而不是关注如何整洁地组织我的分支的具体细节，我能够更快地开发特性。通过稍后将一个大的特性分支拆分成许多较小的分支，我帮助我的团队确保我们正在合并经过良好审查的代码，并且我能够单独关注每个部分，以确保它经过了充分的测试。通过使用Git的分支和GitHub的Pull请求，我能够将这两种技术结合起来，有望改进为我和我的团队构建特性的过程。\n你在GitHub上有没有让你的日常生活更轻松的小贴士、小窍门或小窍门？请使用#GitHubProTips在社交媒体上与我们分享。", "note_en": "This post is a part of a series featuring protips from GitHubbers for improving productivity, efficiency, and more. Continue reading to learn about Sarah Vessels’s protips.\n  I spend most of my work day in code and pull requests. I like to build things and I like for y’all to use them, so I’m very motivated to get my changes out there! I want to share a process with you that’s worked well for me.\n Sometimes my pull requests get too big to easily review because my branch includes too many changes relative to the base branch. Instead of forcing my team to slog through a thousand lines of code, while trying to keep everything in their head and spot any problems, I prefer to open smaller pull requests. Smaller pull requests tend to merge faster, because they’re easier to reason about, so reviewers can breeze through and approve with confidence, and because they have less chance of conflicting with the base branch.\n However, my brain doesn’t think in terms of small pull requests! I get an idea, and I want to translate my idea to code before it slips away—get it all out in black-and-green in my editor. Being able to get my feature or bug fix written down in a single branch helps me confirm that it works as I expect and allows me to test the system as a whole. I can verify that the data model I’ve chosen is a good one based on how the UI and endpoints that use that data model come together. This everything-in-one-branch approach, unfortunately, is at odds with my desire to present my teammates with small, easily reviewable pull requests, especially as these branches tend to grow large.\n If I try to split my code into separate branches from the beginning, I often struggle with knowing which code makes sense in which branch. I find myself spending too much time thinking about whether I’m putting a commit in the right branch rather than thinking about the feature I’m building. I feel like it hinders the creative process of coding, too, having to worry about neatly dividing code into coherent, easy-to-review branches rather than just going with the flow of where feature development takes me.\n I reconcile the two approaches by doing them both, but sequentially: do my original work in a single branch, not worrying about how large it gets, and later open new branches to tease out smaller, atomic bits of work that can land separately. I can use  git cherry-pick to pull bits of my large branch into a very focused smaller branch, then open a pull request from that smaller branch back to the default branch of my repository. As each smaller branch gets merged, when I update my original large branch with the latest code from the base, the diff gets smaller and smaller, because more of its changes are now already in the base branch. I can repeat this process as many times as necessary until the original large branch is no longer so large that it’s a pain to review.\n  Say I want to implement categories in a blog. That might require: a database change to add a new table and field, logic to validate data at the database-adapter level, new endpoints to support reading/writing/deleting categories, user interface changes to allow you to hit those new endpoints, and finally JavaScript to improve the user experience. My approach to implementing such a feature would be to make a branch like  add-categories and get everything out in that branch. I would add just enough tests to confirm my methods are doing what I expect them to do, and verify everything else manually by checking things out in the browser. The branch would be intended as a kind of spike, a test bed to verify that my implementation is the right one. I could open a pull request for this branch, not to solicit reviews and not to be merged yet, but to let my team try things out themselves, and to see the overall approach that I’m thinking about.\n Once I’m happy with my  add-categories branch, I’ll go back to the default branch of my repository and start a new branch. I try to think about the most low-level, early change that has to happen before any part of my feature branch can land. In this example, it’s the database changes. Without those, the endpoints and the UI and the JavaScript don’t matter!\n I would open a branch like  category-db and pull all the relevant work from  add-categories into it. Ideally, while I had been working in  add-categories, I would have made atomic commits such that I could run  git cherry-pick commands to pull over just the database changes. That’s not always the case, though, and for those times, I tend to open my  add-categories pull request on GitHub and go to the “Files changed” tab, where I can easily copy chunks of text and files to paste into new commits in  category-db.\n One nice side effect of pulling out changes into branches that are dedicated entirely to that change is that it leads to better test coverage. If I were trying to land my original  add-categories branch, I would need to ensure it has good testing for the database validations, endpoints, user interface, and JavaScript functionality. I often end up with test code that is at least double the size of the code it’s testing, so tests really increase the size of a pull request! I don’t want that mental pressure of “is this test really worth adding, it’s going to make the diff so much bigger,” and that internal struggle goes away when I know the entire branch is very focused and doesn’t contain disparate ideas.\n I treat my smaller branches as the ones that are going to be reviewed thoroughly by my team, so they get lots of polish. Thorough pull request description, test coverage, as well as consideration for performance and user experience are important. My original  add-categories branch, in this example, would start as a  draft pull request and stay that way until I finished landing all the smaller branches that I teased out of it. Once  add-categories is small enough, because enough of its parts have landed in separate branches, I would round out its tests, update the pull request description to reflect the remaining contents of the branch, and finally drop its draft status so my team gets pinged for review.\n  Sometimes it can be helpful to “daisy-chain” my pull requests. After creating my  category-db branch, I like to see what changes remain in  add-categories that aren’t already in  category-db. Seeing what’s left in the original big branch will let me decide if it’s sufficiently small to submit it for code review, or if I need to pull out another small branch from it. To view the remaining changes it has, I would edit my  add-categories pull request on GitHub to change its base branch from the default branch of my repository to  category-db instead. Then I can check out the  add-categories branch and  git merge category-db before pushing the result up to GitHub. That updates the diff shown on my pull request such that all the code that’s now in  category-db no longer shows in the  add-categories pull request.\n Maybe  add-categories is still too large for me to be comfortable asking my team for review. The new data validations might be the next part I pull out to their own branch. While on  category-db, I could create a new branch, say  category-validations. I would repeat the process of before, cherry-picking relevant commits where possible, copying code wholesale from the pull request view of  add-categories otherwise. Once  category-validations has been pushed to GitHub, I can open a pull request with  category-db as the base and  category-validations as the head branch. Then I can once again update my  add-categories pull request so that its base branch is now  category-validations instead of  category-db. This results in a daisy-chain effect where my branches are:  main ←  category-db ←  category-validations ←  add-categories.\n % git branchadd-categories // adds the whole categories featurecategory-db // adds database table* category-validations // adds validation logic + testsmaster\n Another benefit of chaining pull requests like this is that it unblocks me. Maybe  category-db can’t be merged yet because the database change it describes hasn’t happened, so none of my other branches can be merged either. By opening many pull requests for separate small branches, I can still focus on getting each branch fully tested and reviewed by my team. I can get each set of changes ready to merge by making sure tests pass and they’ve been approved, then when  category-db is ready to merge, I’ll be able to land several branches in short order since the branches depending on  category-db have already gone through the review process.\n Once one of my smaller branches gets merged, I can update the pull request(s) that are based on it to instead be based on the default branch of my repository. So when my  category-db branch is merged, I update my  category-validations pull request so its base branch is the primary. Eventually, all the smaller branches have merged and all I have left is a single pull request again, the original  add-categories, based on the default branch. Only this time,  add-categories is a reasonable size for me to ask for review from my team. By this point,  add-categories has probably changed its purpose. Instead of adding the entire category feature, it may only be adding the finishing JavaScript touches to improve the user experience. I would update the pull request description to reflect this.\n  By letting myself focus on expressing my ideas in code, and not focusing on the nitty-gritty details of how to neatly organize my branches, I’m able to develop a feature more quickly. By later splitting a large feature branch into many smaller branches, I help my team ensure we’re merging well-reviewed code, and I’m able to give individual attention to each piece to make sure it’s fully tested. Using git’s branches and GitHub’s pull requests, I’m able to marry the two techniques to hopefully improve the process of building out a feature for both myself and my team.\n  Do you have a tip, trick, or hack that makes your daily life easier on GitHub? Share it with us on social media with  #GitHubProtips.", "posttime": "2020-05-22 06:51:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,黑客,protips,分支", "title": "GitHub ProTips-来自Sarah Vehicles的提示、技巧、黑客和秘密", "title_en": "GitHub Protips- Tips, tricks, hacks, and secrets from Sarah Vessels", "transed": 1, "url": "https://github.blog/2020-05-21-github-protips-tips-tricks-hacks-and-secrets-from-sarah-vessels/", "via": "", "real_tags": ["github", "黑客", "protips", "分支"]}, {"category": "", "categoryclass": "", "imagename": "28a2033deba6240907277c89059259ed.jpg", "infoid": 1003199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨天T-Mobile开玩笑说它今天将有一个新的非运营商公告，现在我们确切地知道是什么了。\nT-Mobile已经正式推出了Connecting Heroes，这是它去年首次宣布的一项倡议，作为其与Sprint合并的一部分。有了它，T-Mobile承诺在10年内为急救人员提供免费无线服务，T-Mo估计，如果所有的急救机构都签约，这将节省77亿美元。\nConnecting Heroes将为急救人员提供无限的通话、文本和智能手机数据。这包括免费的5G接入，以及1 GB的4G LTE移动热点数据，以及之后的3G速度。包括480p的流媒体视频，以及在美国、加拿大和墨西哥之间提供无限制通话和短信的Mobile Without Borders。\n急救人员可以选择升级他们的计划，每月15美元，获得20 GB的移动热点使用，无限制的短信和210+个国家和目的地的高达256Kbps的数据，外加通过Gogo的免费短信和飞行Wi-Fi。\nT-Mobile的“连接英雄”倡议对每个公共和非营利性组织、州和地方警察、消防和EMS急救人员都是开放的。如果您觉得符合条件，您可以在这里了解更多信息并开始注册过程。\n第一反应人员在正常情况下很重要，但在冠状病毒大流行期间尤其重要。由于我们中的许多人都在原地避难以抗击冠状病毒的传播，急救人员正在世界各地保护我们，冒着感染疾病的风险来保护我们所有人的安全。“连接英雄”计划是对此表示感谢的一种方式，很高兴看到T-Mo将使宣传活动持续10年，而不是更短的时间，比如直到大流行结束或类似的时候。“连接英雄”计划是对他们表示感谢的一种方式，看到T-Mo将把宣传持续10年，而不是更短的时间，比如流行病结束或类似的时候。", "note_en": "Yesterday T-Mobile teased that  it would have a new Un-carrier announcement for today, and now we know exactly what that is.\n T-Mobile has  officially launched Connecting Heroes, the initiative  it first announced last year as part of its merger with Sprint. With it, T-Mobile has pledged to give free wireless service to first responders over 10 years, which T-Mo estimates could save $7.7 billion if all first responder agencies sign up.\n Connecting Heroes will give unlimited talk, text, and smartphone data to first responders. That includes 5G access at no extra charge as well as 1GB of 4G LTE mobile hotspot data plus 3G speeds after that. Streaming video at 480p is included, as is Mobile Without Borders which offers unlimited calling and texting between the US, Canada, and Mexico.\n First responders can choose to upgrade their plan for $15 per month and get 20GB of mobile hotspot usage, unlimited texting and up to 256Kbps data in 210+ countries and destinations, plus free texting and in-flight Wi-Fi through Gogo.\n T-Mobile&#39;s Connecting Heroes initiative is open to every public and non-profit, state and local police, fire, and EMS first responders. If you feel that you qualify,  you can learn more and begin the signup process right here.\n First responders are important during normal times, but they&#39;re especially important during the coronavirus pandemic. As many of us are sheltering in place to fight the spread of COVID-19, first responders are out in the world protecting us and taking a risk that they might catch the disease to keep us all safe. The Connecting Heroes initiative is a way to thank them for that, and it&#39;s good to see that T-Mo will keep the promo running for 10 years rather than a shorter period, like through the end of the pandemic or something like that.", "posttime": "2020-05-22 06:36:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,5g,互联,connecting,mobile", "title": "T-Mobile互联英雄现已上线，首批响应者获得免费5G服务", "title_en": "T-Mobile Connecting Heroes Now Live, First Responders Get Free 5G Service", "transed": 1, "url": "https://www.phonedog.com/2020/05/21/t-mobile-connecting-heroes-free-unlimited-5g-first-responders", "via": "", "real_tags": ["免费", "5g", "互联", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "面向开发人员的实验性搜索引擎。搜索网络的精选子集：官方文档和社区驱动的资源。没有JS、Cookie、跟踪、外部请求或数据收集。", "note_en": "Experimental search engine for developers. Searches a curated subset of the web: official docs and community-driven sources. No JS, cookies, tracking, external requests or data collecting.", "posttime": "2020-05-22 06:17:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,面向,search,数据", "title": "Quickref-面向开发人员的搜索引擎", "title_en": "Quickref – A Search Engine for Developers", "transed": 1, "url": "https://quickref.dev/", "via": "", "real_tags": ["开发", "面向", "search", "数据"]}, {"category": "", "categoryclass": "", "imagename": "45075812a64d7d1f32eee6772c8b7b44.jpg", "infoid": 1003197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们对下雪有一定的预期。我们通常认为它会是白色的，但在南极洲沿海的部分地区，雪呈现出一种奇怪的亮绿色阴影。随着气候变暖对冰原的影响，我们可能会更多地看到这种颜色。\n南极洲不会变成巨型玛格丽塔。绿色是由微小的雪藻大量繁殖引起的。这些花朵覆盖了如此多的土地，以至于可以被卫星观测到。\n由英国剑桥大学和英国南极调查局的研究人员领导的一个团队利用卫星数据和实地观察绘制了绿藻地图，并预测了令人不安的绿色雪的未来增长。周三，他们在《自然·通讯》杂志上发表了他们的研究成果。\n绿色的雪沿着海岸出现。剑桥大学在周三的一份新闻稿中说，它们生长在较温暖的地区，那里的平均气温在南半球夏季的11月至2月略高于零摄氏度。\n附近的企鹅群似乎对藻类的繁殖起到了推动作用。我们最近了解到企鹅粪便会给科学家带来笑气问题。它还可以滋养藻类的生长。\n气候变化看起来将无意间影响到南极雪地的绿化。这篇论文的主要作者、剑桥大学植物学家安德鲁·格雷说，随着南极洲变暖，我们预测雪藻的总量将会增加，因为向地势更高的地方扩散将大大超过小岛上藻类斑块的损失。\n科学家们不仅仅是看到绿色。南极洲的部分地区看起来像一道彩虹。研究人员打算扩大他们的研究范围，将促成这一多彩景观的红色和橙色藻类水华包括在内。“白雪公主”不是。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "We have certain expectations of snow. We generally think it will be white, but in parts of coastal Antarctica the snow takes on a bizarre shade of bright green. It&#39;s a color we may be seeing more of as a   warming climate impacts the land of ice.\n Antarctica isn&#39;t turning into a giant margarita. The green is caused by blooms of microscopic snow algae. The blooms cover so much ground they can be observed by satellites.\n  A team led by researchers at the University of Cambridge in the UK and the British Antarctic Survey used satellite data and fieldwork observations to create a map of the green algae and predict future growth of the disconcerting green snow. They  published their work in the journal Nature Communications on Wednesday.\n The green snow appears along the coast. &#34;They grow in &#39;warmer&#39; areas, where average temperatures are just above zero degrees Celsius during the austral summer -- the Southern Hemisphere&#39;s summer months of November to February,&#34;  said the University of Cambridge in a release on Wednesday.\n  Nearby penguin colonies appear to play into the algal blooms. We recently learned   penguin feces can cause laughing-gas problems for scientists. It can also feed the growth of algae.\n Climate change looks like it will play into the inadvertent &#34;greening&#34; of Antarctic snow. &#34;As Antarctica warms, we predict the overall mass of snow algae will increase, as the spread to higher ground will significantly outweigh the loss of small island patches of algae,&#34;  said University of Cambridge plant scientist Andrew Gray, lead author of the paper.\n Scientists aren&#39;t just seeing green. Parts of Antarctica look like a rainbow. The researchers intend to expand their studies to include red and orange algal blooms that contribute to this multi-colored landscape. &#34;Snow white&#34; it isn&#39;t.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-22 06:17:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "南极洲,weird,藻类", "title": "由于气候变化，南极洲奇怪的绿色积雪将蔓延", "title_en": "Antarctica's weird green snow set to spread due to climate change", "transed": 1, "url": "https://www.cnet.com/news/antarcticas-weird-green-snow-set-to-spread-due-to-climate-change/", "via": "", "real_tags": ["南极洲", "weird", "藻类"]}, {"category": "", "categoryclass": "", "imagename": "0a4b49c1642b887877f2d42c17c5e56f.jpg", "infoid": 1003196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大米可以改变经济，省去一顿乏味的饭菜，还可以阻止冬季的吃水。有一件事它绝对、肯定做不到，那就是拯救一部湿了的手机。事实上，将手机浸泡在大米中会让问题变得更糟，特别是如果手机还在开机的话。\n和我们一起说：大米是一种食物，而不是一种工具。饭吃得好，电话饭吃得不好。\n好的，你还在这里，很好。让我们深入研究一下，为什么在你的手机湿了之后，直接把米饭、猫砂或干衣袋浸泡在水里，对你浸泡的手机没有任何帮助。\n在修复现代电子产品的水损坏方面，没有比iPad Rehab Repair服务公司的所有者杰莎·琼斯(Jessa Jones)更高的权威了。杰莎的整个维修生涯始于一部被幼儿困在马桶里的iPhone，后来被大锤解救出来。这让她下了一长串的兔子洞，到了现在她是水损坏和微焊专家的地方。琼斯在这个网站上写了一个维基指南来解开米饭和水的迷思，这是一个开始破解这个迷思的好地方：\n当手机碰到水时，腐蚀是瞬间发生的。有时腐蚀会击中重要部件，有时不会。如果我们拒绝打开手机，直到它在柜台上、米袋里或其他任何地方都干了，有时我们就会走运。如果我们把手机放在米袋里，我们认为是大米救了手机。但它没有！即使手机看起来正常工作，它也会有氧化的焊点，这些焊点会变得脆弱易碎。腐蚀将继续在手机内部蔓延。我们什么也没做，只是经历了暂时的运气。\n继续往下读，琼斯给出了真正的解决方案：拆卸手机，将其浸泡在酒精中，以置换水并松开少量腐蚀，然后擦洗。我们已经在一份指南中详细介绍了整个水毁修复程序。以下是简短的项目符号版本(如果您现在手持积水的手机，请阅读完整的指南，这是绝对不能依赖的)：\n如果你可以取下手机的电池，并且你可以看到它已经暴露在水中，那么就取下并更换电池。\n卸下逻辑板和其他似乎已腐蚀的部件(相机和显示器除外)，并将其浸泡在90%异丙醇中。\n这不是一个简短、简单的过程。此外，如果您的设备已经以某种方式防水，您可以通过打开它来破坏其密封性。如果你没有办法或时间来完成这个程序，或者付钱给有资质的维修店来做，你可以干脆把手机放在外面晾干，尽可能多地打开和暴露。\n简单地将设备晾晒出来就行了吗？比你想象的要好，而且肯定比米饭好。二手设备经销商Gazelle在2014年进行了一次手机浸泡测试，将一块湿海绵浸入七种材料中，并将其留在户外。\n在我们测试的七种选择中，干的、未煮熟的常规大米是最差的。它在24小时内吸收的水分最少，输给了硅胶、猫砂、粗麦粉、速溶燕麦片、经典燕麦片和方便米饭。\n瞪羚注意到，留在露天的海绵实际上最干燥，因此建议打开手机，在空气中烘干它的部件可能是最好的解决方案。这至少比大米更准确。\n“但你是iFixit，”你可能会说，“所以你偏向于把东西拆开，然后用铲子戳东西。”但我们远不是唯一一家试图反驳神奇大米的连锁电子邮件逻辑的出版物。你可以从“今日美国”、ZDNet、Fast Company和CNET找到最新的大米反驳。\nThe Verge至少追溯到了1946年，当时人们建议将大米、茶叶或牛皮纸作为保持相机设备干燥的一种临时方法，如果硅胶干燥剂不方便的话，可以将大米作为湿气修复神话的历史。“边缘报”(The Verge)至少可以追溯到1946年，当时人们建议用大米、茶叶或牛皮纸作为保持相机设备干燥的临时方法。2007年6月，“华盛顿邮报”的一名记者提出了这个想法，当时他把一部黑莓手机浸泡在马桶里，把它放在大米里，而手机并没有被毁掉(两者之间没有相关性)。他为这篇论文写了这篇文章，然后生产力博客Lifehacker发布了许多很多建议中的第一个，即大米和其他干货可以修复湿式电话。\n为了充分地、直截了当地披露信息，我和两名iFixit撰稿人之前曾为Lifehacker工作。我们中的一些人在帖子中写下了这个神话，或者把它告诉了朋友。我们知道，提出一种新石器时代的谷物作为先进技术问题的解决方案是多么有吸引力。我们很抱歉。\n让我告诉你，自从那些“米饭可能行得通！”以来，我已经走了多远！几天。几个月前，我带了一台Pixel C(一款完全被忽略的安卓平板电脑)去参加一个大会。我把它装进一个背包里，那个背包里还有一个水瓶。水瓶的盖子是一个复杂的锁东西。Pixel C几乎在每一面都有入口：麦克风、充电端口、扬声器。水进了屏幕，导致显示屏熄灭，或者至少是它的背光熄灭了(在明亮的灯光下，你可以非常微弱地看到界面)。\n几天前，我终于通过更换显示器修复了C。在这样做的过程中，我发现了水进入显示器的位置，以及它对显示控制器板造成的损坏。大米是如何从平板电脑内部粘合得很厉害的外部用真空吸回水分的呢？大米能扭转H2O造成的短路和电路损坏吗？\n我意识到，尽管这篇帖子明确反对在大米中放手机，但在某种程度上，我正在为将“湿手机”和“大米”捆绑在一起的网络搜索结果做出贡献。事情就是这样的。我们所能做的就是告诉像你这样的人，大米是一种食物，而不是一种工具，并请你把它传下去。当然，还要主动帮助人们真正修好手机。", "note_en": "Rice can transform an economy,  save a boring meal, and  stop winter drafts. One thing it absolutely, positively cannot do is save a wet cell phone. In fact, submerging your phone in rice makes the problem worse, especially if it’s still powered on.\n Say it with us:  Rice is a food, not a tool. Food rice good, phone rice bad.\n Okay, you’re still here, good. Let us delve into why submerging your phone rice—or kitty litter, or dessicant packets—right after it gets wet can’t do anything for your soaked phone.\n  There is no higher authority on repairing water damage to modern electronics than Jessa Jones, owner of  iPad Rehab repair service. Jessa’s entire repair career started with an iPhone trapped in a toilet by toddlers, freed by a sledgehammer. That led her down a long series of rabbit holes, to where she’s now a water damage and microsoldering expert. Jones wrote a wiki  guide to the rice-fixes-water myth on this very site, and it’s a good place to start busting the myth:\n Corrosion is instant when a phone hits water. Sometimes the corrosion hits important components, sometimes not. If we resist turning the phone on until it dries on the counter, in the rice bag, or anywhere else, sometimes we get lucky. If we had the phone in the rice bag, we  think the rice saved the phone. But it didn’t! Even if the phone seems to be working, it will have oxidized solder joints that are weakened and brittle. Corrosion will continue to spread inside the phone. We have done nothing but experienced temporary luck.\n  Read on and Jones gives the real solution: disassemble the phone, immerse it in alcohol to displace water and loosen bits of corrosion, and scrub. We’ve  detailed the entire water-damage repair procedure in a guide. Here’s the short, bulleted version (that you absolutely cannot rely on if you’re holding a water-logged phone right now, please  read the full guide):\n If you can remove your phone’s battery, and you can see it’s been exposed to water, remove and  replace the battery\n Remove the logic board and other parts that appear corroded (except the camera and display) and immerse them in 90% isopropyl alcohol.\n That’s not a short, easy procedure. Also, if your device is already waterproofed in some way, you can compromise its sealing by opening it up. If you don’t have the means or time to run through this procedure, or pay a qualified repair shop to do it, you can simply leave your phone out to dry, opened up and exposed as much as possible.\n  Will simply airing out the device work? Better than you think, and better than rice, for sure. Used-device reseller  Gazelle ran a phone soak test in 2014, immersing a wet sponge inside seven materials, as well as leaving it out in open air.\n Dry, uncooked conventional rice was the worst of the seven options we tested. It absorbed the least water in 24 hours, losing out to silica gel, cat litter, couscous, instant oatmeal, classic oatmeal and instant rice.\n Gazelle noted that the sponge left in open air actually dried the most, and so suggests that opening up a phone and drying its parts in air might be the best solution. Which is, at least, more correct than rice.\n “But you’re iFixit,” you might say, “so you’re biased in favor of tearing stuff apart and poking things with spudgers.” But we’re far from the only publication out there trying to counter the chain-email logic of magic rice. You can find latter-day rice rebuttals from  USA Today,  ZDNet,  Fast Company, and  CNET.\n The Verge tracked  the history of the rice-as-moisture-fix myth back to at least 1946, when rice, tea, or brown paper were suggested as a make-do way to keep camera equipment dry, if silica dessicant wasn’t handy. The idea was boosted by  a Washington Post reporter in June 2007, when he toilet-dunked a BlackBerry, put it in rice, and (with no correlation between the two) the phone wasn’t ruined. He wrote it up for the paper, and then productivity blog  Lifehacker posted the first of  many, many suggestions that rice and other dry goods could fix a wet phone.\n  In the interest of full, staring-at-the-floor disclosure, I and two iFixit writers previously worked for Lifehacker. Some of us wrote this myth in posts, or told friends about it. We know how appealing it is to suggest  a grain from the Neolithic era as the solution to an advanced technology problem. We’re sorry.\n Let me show you how far I’ve come since those “Rice might work!” days. I brought a Pixel C (an entirely ignored Android tablet) with me on a trip to a convention a few months back. I loaded it into a backpack, and that backpack also had a water bottle in it. The water bottle’s lid was a complicated locking thing. The Pixel C has a means of ingress on nearly every side: microphones, charging ports, speakers. Water got in, and killed the display, or at least its backlight (you could ever-so-faintly see the interface under bright lights).\n I finally got to fixing the C by replacing its display the other day. In doing so, I found where the water had gotten into the display, and the damage it had done to the display controller board. How would rice have been able to vacuum water back from outside the heavily glued insides of a tablet? Would rice have been able to reverse the short-circuiting and circuit damage wreaked by H2O?\n  I realize that, even with this post that is explicitly against putting phones in rice, I am contributing, in some way, to web search results that tie “wet phone” and “rice.” That’s just the way it is. All we can do is tell people like you that  rice is a food, not a tool, and ask you to pass it on. And, of course, offer to help people really fix their phone.", "posttime": "2020-05-22 06:16:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "用来,dinner,手机", "title": "米饭是用来吃饭的，不是用来修理的", "title_en": "Rice Is for Dinner, Not Repair", "transed": 1, "url": "https://www.ifixit.com/News/30047/rice-is-for-dinner-not-repair", "via": "", "real_tags": ["用来", "dinner", "手机"]}, {"category": "", "categoryclass": "", "imagename": "2d4602d5e5607de1290f2fb693d504ee.jpg", "infoid": 1003194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "运动员、奶牛都有严格的营养要求。“如果你稍微增加了蛋白质，或者减少了碳水化合物，你会看到牛奶产量下降，”基南系统公司的老板罗比·沃克(Robbie Walker)说。基南系统公司是一家生产饲料混合马车的爱尔兰公司。\n出于这个原因，该公司的最新产品已经数字化。在美国大型芯片制造商英特尔的帮助下，基南已经开发出一种可以连接到马车上的计算机。每天，该公司的营养师都会将牛群的饮食需求输入电脑。马车上的传感器称农民放入搅拌机的东西，并将其与食谱要求的东西进行比较。“这有点像做蛋糕，”沃克说。即使你很小心，你通常也会在一种配料中放得稍微多一点，或者另一种配料放得不够。\n收集到的数据通过移动电话网络传输给营养学家，营养学家可以分析任何偏离理想的动物喂养情况。一个大的偏差会触发一条短信给农民。较小的被注意到了，第二天的饲料组合进行了调整，以纠正任何可能悄悄进入的营养不足。\n基南并不是唯一一家试图将养牛电脑化的公司。另一家爱尔兰公司卡恩萨斯是希望利用计算机视觉来提高农家庭院生产率的几家初创公司之一。它使用摄像机跟踪牛舍和田野中的奶牛，依靠机器学习来分析图像。该公司老板大卫·亨特(David Hunt)说，这项技术足够敏感，可以追踪单个动物，如果一头牛没有在应该喂食的时候喂食，或者移动的方式表明它可能生病了，就会提醒农民。\n他说，目前，该公司主要致力于弗里斯安奶牛和荷斯坦奶牛，它们独特的标记“意味着它们基本上是行走的密码”，尽管他希望最终能扩展到其他品种。这项技术运作良好，足以说服嘉吉(Cargill)在2018年收购卡恩萨斯的少数股权。嘉吉是一家专注于农业的企业集团，也是美国最大的私营公司。\n另一种方法是将传感器放入奶牛体内。一家名为sma tec的奥地利公司已经开发出一种可以吞咽的传感器。它安置在网状结构内，这是牛的四个胃之一，在动物的余生中一直呆在那里，监测体温、运动和胃酸，并在牛靠近无线探测器时上传结果。\nsma tec的联合创始人斯特凡罗森克兰兹(Stefan Rosenkranz)说，当输入到机器学习算法中时，这些数据可以用来做各种事情。他们可以检测到动物何时处于发情期，并在产犊发生前15小时发现早期迹象。它们可以在疾病变得对人类观察者明显之前几天就能识别出来，从而可以及早治疗，抗生素的使用量减少了15%-30%。定于明年推出的一款新传感器将增加监测消化的能力。罗森克兰兹表示，销售额每年都在翻一番。世界上有2.78亿头奶牛，客户并不短缺。\n本文发表在印刷版的“技术季刊”栏目，标题为“明天的奶牛”。", "note_en": "L  athletes, dairy cows have exacting nutritional requirements. “If you’re slightly up on protein, or down on carbs, you’ll see a drop in milk production,” says Robbie Walker, the boss of Keenan Systems, an Irish firm which makes feed-mixing wagons.\n For that reason, the firm’s latest products have gone digital. With the help of Intel, a big American chipmaker, Keenan has developed a computer that can be attached to its wagons. Every day the firm’s nutritionists load the computer with the herd’s dietary requirements. Sensors on the wagon weigh what the farmer puts into the mixer and compare it with what the recipe calls for. “It’s a bit like making a cake,” says Mr Walker. “Even if you’re being careful, you usually put in a little too much of one ingredient, or not enough of another.”\n  The collected data are transmitted over the mobile-phone network to the nutritionists, who can analyse any deviations from the ideal in what the animals were fed. A big deviation triggers a text message to the farmer. Smaller ones are noted, and the feed mix for the following day tweaked to correct any nutritional deficits that might have crept in.\n Keenan is not the only firm trying to computerise cattle-farming. Cainthus, another Irish company, is one of several startups hoping to use computer vision to boost farmyard productivity. It uses cameras to track cows in barns and fields, relying on machine learning to analyse the images. The technology is sensitive enough, says David Hunt, the firm’s boss, to track individual animals, and to alert farmers if a cow is not feeding when it should be, or moving in a way that suggests it might be sick.\n For now, he says, the company is working mainly on Friesian and Holstein cows, whose distinctive markings “mean they’re basically walking   codes”, though he hopes to expand to other breeds eventually. The technology works well enough to have persuaded Cargill, an agriculture-focused conglomerate and America’s largest private company, to take a minority stake in Cainthus in 2018.\n An alternative approach is to put the sensors inside the cows themselves. An Austrian firm called sma tec has developed a sensor that can be swallowed. It lodges inside the reticulum, one of a cow’s four stomachs, and stays there for the rest of the animal’s life, monitoring body temperature, movement and stomach acidity, and uploading the results when the cow is near a wireless detector.\n When fed to machine-learning algorithms, says Stefan Rosenkranz, sma tec’s co-founder, those data can be used for all kinds of things. They can detect when animals are in heat, and spot the early signs of calving up to 15 hours before it happens. They can identify diseases several days before they become obvious to human observers, allowing early treatment and a 15-30% drop in antibiotic use. A new sensor, due out next year, will add the ability to monitor digestion. Sales are doubling every year, says Mr Rosenkranz. And with 278m dairy cows in the world, there is no shortage of customers.\n  This article appeared in the Technology Quarterly section of the print edition under the headline &#34;The cow of tomorrow&#34;", "posttime": "2020-05-22 05:48:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,ai", "title": "传感器和人工智能正在寻找进入谷仓的路", "title_en": "Sensors and AI are finding their way into the barnyard", "transed": 1, "url": "https://www.economist.com/technology-quarterly/2019/09/12/sensors-and-ai-are-finding-their-way-into-the-barnyard", "via": "", "real_tags": ["人工智能", "ai"]}]