[{"category": "", "categoryclass": "", "imagename": "8c791aae4c4a08cd6fe2e36ea624c3f2.jpg", "infoid": 1017360, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在YouTube和Instagram等平台上，社交工具糟糕透顶，特别是在创建者拥有自己的社区并与他们建立更深层次的关系方面。其他产品，如不一致，已经取得了一些成功，尽管不一致是在考虑不同的重点的情况下构建的，正在被灌输以解决问题。\n圆圈相信有更好的方法。这家总部位于纽约的初创公司在经过8个月的产品测试版测试后，今天正式面向创作者推出。该平台是自下而上设计的，旨在为创建者提供更好的社区建设和参与工具，同时还与创建者工具包中的其他典型软件集成。\n该公司的关键DNA是另一家总部位于纽约的初创公司，名为Teacable。Circle的三位创始人中有两位，Sid Yadav和Andrew Guttormsen，来自edtech平台，该平台帮助创业教师为他们的课程建立在线店面。Tachable在今年早些时候被卖给了Hotmart，据报道价格为25亿美元。Yadav是那里的产品副总裁，Guttormsen是增长和营销副总裁。他们的第三位联合创始人鲁迪·桑蒂诺(Rudy Santino)在之前的工作中认识了亚达夫。\n亚达夫是从Tachable分拆出来的，实际上他是从Sahil Lavingia的承包商开始的，Sahil Lavingia是GumRoad的创始人，我们上周刚刚谈到他推出了一个全新的种子基金。他兼职担任产品和设计顾问，这让他可以灵活地开始花时间思考新的产品想法。\n亚达夫说：“我一直知道，我的下一家初创公司将在[创造者]领域。”“我就是喜欢他们所做的一切，就是从他们喜欢做的事情中赚取收入。”\nTachable在创作者空间的一小部分中的快速增长教会了亚达夫创作者面临的一些关键挑战，以及需要解决哪些新产品才能帮助他们。与他的联合创始人一起，他招募了一群创建者，包括Smart Pactive Income的Pay Flynn和运营时事通讯Ness Labs的安妮-洛尔·勒坎夫(Anne-Laure Le Cunff)，以积极在Circle上建立社区，以证明他们的各种设计和产品决策。\n该平台的增长和潜在客户的参与引起了Notation Capital的注意，Notation Capital是一家总部位于纽约的预种子基金，上月底刚刚宣布了其第三只基金。Notation带领一轮150万美元的种子融资进入Circle，其中还包括Lavingia、Tachable创始人兼首席执行官安库尔·纳格帕尔、戴夫·安布罗斯、彼得·特雷德韦等人。\n越来越多的软件被设计用来帮助创作者创业。子堆栈当然在硅谷获得了最多的关注，它的平台主要是围绕电子邮件时事通讯订阅而设计的。与此同时，Pico一直专注于通过与大多数其他平台集成的CRM来构建更多创作者业务的基础设施。Patreon处理更多的球迷支付和收入约定。\nCircle可能最终会涉及到这些领域，但今天，我想成为你在时事通讯、博客帖子或Instragram之间发送所有创作者的目的地。这是创作者堆栈中聪明的一部分，加上早期客户强烈的热情和一大笔资金，似乎已经准备好在这个新兴的市场上留下印记。", "note_en": "Social tools are abysmal on platforms like YouTube and Instagram, particularly when it comes to creators owning their own communities and building deeper relationships with them. Other products like Discord have been used to some success, although Discord was built with a different focus in mind and is being hammered in to fix the problem.\n Circle believes there is a better way. The New York City-based startup officially launched today for creators following eight months of product beta testing. The platform is designed from the bottoms-up to offer better community building and engagement tools for creators, while also integrating with other software typical in the creator toolkit.\n   The key DNA for the company is another NYC-based startup called  Teachable. Two of Circle’s three founders, Sid Yadav and Andrew Guttormsen, hail from the edtech platform, which helps entrepreneurial teachers setup online storefronts for their classes.  Teachable was sold to Hotmart earlier this year for what was reported to be a quarter of a billion dollars. Yadav was VP of Product there, and Guttormsen was VP of Growth and Marketing. Their third co-founder, Rudy Santino, knew Yadav from previous work.\n  Yadav spun out of Teachable and  actually got his start as a contractor for Sahil Lavingia, the founder of Gumroad who we were just talking  about last week since he launched a brand new seed fund. He worked part-time as a product and design consultant, allowing him the flexibility to begin spending time thinking about new product ideas.\n  “I always knew that my next startup was going to be in [the creator] space,” Yadav said. “I just loved what they’re all about, which is about making an income from what they love doing.”\n Teachable’s rapid growth in a small slice of the creator space taught Yadav some of the key challenges that creators face, and what a new product needed to solve in order to help them. With his co-founders, he enlisted a group of creators including Pay Flynn at Smart Passive Income and Anne-Laure Le Cunff who operates a newsletter called Ness Labs to actively build communities on Circle to prove out their various design and product decisions.\n The growth of the platform and the engagement of potential customers attracted the attention of Notation Capital, a NYC-based pre-seed fund that  just announced its third fund late last month. Notation led a $1.5 million seed round into Circle, which also included Lavingia, Ankur Nagpal, the founder and CEO of Teachable, Dave Ambrose, Peter Treadway, among others.\n  There is a growing movement of software designed to help creators start their businesses.  Substack of course has gotten the most attention in Silicon Valley, with a platform designed mostly around email newsletter subscriptions.  Pico, meanwhile, has focused on building out more of the infrastructure of the creator business through a CRM that integrates with most other platform.  Patreon handles more of the payments and revenue engagement of fans.\n Circle may end up touching on those areas, but today, wants to be the destination where you send all of your creators in between newsletters or blog posts or Instragrams. It’s a smart part of the creator stack to play in, and with strong early customer enthusiasm and a chunk of funding, seems ready to make a mark in this burgeoning market.", "posttime": "2020-08-10 23:26:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "想要,community,创作者", "title": "\n创建者需要更好的社区工具。圆圈想要填补这一空白", "title_en": "\n\t\t\t\tCreators need better community tools. Circle wants to fill the gap\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/circle-community-tools-for-creators/", "via": "", "real_tags": ["想要", "community", "创作者"]}, {"category": "", "categoryclass": "", "imagename": "9b3dda4420a908792039cc09701477f1.jpg", "infoid": 1017359, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这引发了人们对谁可能收购TikTok并将其从岌岌可危的境地中拯救出来的大量猜测。到目前为止，媒体报道的主要竞争者是微软，多家媒体报道称，微软首席执行官萨蒂亚·纳德拉(Satya Nadella)与特朗普总统讨论了如何完成交易的大纲。特朗普表示，他希望买家向联邦政府支付某种形式的什一税，对于像微软这样的追求者来说，在合适的情况下，这一论点甚至可能是有意义的。\n然而，在过去的一周和周末，我们开始收到越来越多微软以外的名字，他们理应对此感兴趣。我们听到有人提到苹果，Twitter也被广泛讨论。软银(在愿景基金中拥有ByteDance的部分股份)一直有传言称将成为竞争者。谷歌此前曾在去年年底就可能收购这款应用进行过谈判，估计可能会留在这一组合中。据推测，私募股权公司也在嗅探这个机会。\n不过，事情是这样的：所有这一切--除了微软潜在的交易之外--似乎完全是烟雾弥漫。\n苹果积极否认对收购该公司有任何兴趣，这并不令人惊讶，因为它没有任何战略意义。其他所谓的追求者对他们公司“考虑所有战略机会”的典型公关甜言蜜语则较为冷淡。\n现在的情况是，TikTok是一项极其有价值的资产，潜在价值数百亿美元。但只有在该公司能够找到一些财力雄厚的买家愿意抬高价格的情况下，这个价值才是值得的。如果微软是唯一的追求者，那么TikTok的价格可能会低得令人震惊。\n那么，这笔交易的核心投资银行家们是怎么做的呢？他们将这笔交易传递给全国每个企业发展部门，并将信息泄露给记者，试图在其他部门宣传信息披露令(FOMO)，希望某个地方的董事会成员开始问，“嘿，我们为什么不深入研究一下这件事呢？”见鬼，我相信就连甲骨文也在考虑-他们有数据中心和“协同”潜力，其首席执行官萨夫拉·卡茨(Safra Catz)也是特朗普的主要支持者，可以驾驭即将到来的政策恶作剧。\n然而，这笔交易的现实是一样的：就是没有那么多公司可以考虑收购。Facebook面临反垄断，总部位于日本的软银(Softbank)面临外国公司的担忧(这正是TikTok处于这个位置的首要原因)。苹果不感兴趣，即使像Twitter这样的公司，尽管它们很受欢迎，也很有战略意义，但也没有现金。Twitter今天的市值还不到300亿美元-他们真的能负担得起，比方说，花一半的公司进行收购吗？ByteDance需要减记多少资产才能让Twitter合乎逻辑？\n这些关于利益的烟雾大多是为了推动微软达成公平交易。它的目的是鼓励他们提高出价，以免这些其他“追求者”中的一个潜在地感兴趣。然而，交易的时间(现在需要在几周内完成)和价格的范围实际上排除了今天所有买家，只剩下一个买家。\n因此，要当心银行家们在谈论TikTok。我们会得到一堆潜在收购者的名字。除非有确凿的证据表明人们对此深表兴趣，否则我将对所有传言保持怀疑。", "note_en": "That has led to massive speculation about who might purchase TikTok and save it from its precarious situation.  The leading contender so far in media reporting has been Microsoft, with multiple press reports indicating that  Microsoft CEO Satya Nadella has talked with President Trump about an outline of how a deal could be consummated. Trump has indicated he wants the buyer to pay some sort of tithe to the federal government,  an argument that might even make sense for a suitor like Microsoft in the right circumstances.\n   Over the past week and weekend though, we are starting to get more and more names outside of Microsoft who are supposedly interested. We’ve heard  Apple mentioned, and  Twitter has been discussed heavily. SoftBank (which  owns part of ByteDance in the Vision Fund) has  been rumored to be a contender. Google has  formerly been in talks about potentially buying the app late last year, and presumably could stay in the mix. And  private equity firms are also supposedly sniffing around the opportunity.\n Here’s the deal though: all of this — outside of Microsoft’s potential deal — seems completely like smoke.\n Apple has  actively denied any interest in buying the company, which shouldn’t be surprising as it makes no strategic sense whatsoever. Other supposed suitors have been more lukewarm with the typical PR blandishments that their companies “consider all strategic opportunities.”\n What’s going on is that TikTok is an extremely valuable property, potentially worth tens of billions of dollars. But it is only worth that value if the company can find a number of deep-pocketed buyers who are willing to bid the price up. If Microsoft is the only suitor, then TikTok’s price may well be shockingly low.\n So what do the investment bankers at the heart of the deal do? They run the deal around to every corporate development department in the country, and they leak the information to reporters to try to drum up FOMO in other departments all in the hope that a board member somewhere starts asking, “Hey, why aren’t we taking a deep look at this?” Heck, I’m sure even Oracle is taking a look — they have data centers and “synergy” potential, and its CEO Safra Catz is  a major Trump supporter as well and could navigate the coming policy shenanigans.\n Yet, the reality of the deal is the same: there just aren’t that many companies that can even consider an acquisition. Facebook is out on antitrust, Japan-headquartered Softbank is out on foreign company concerns (the very reason why TikTok is in this position in the first place). Apple isn’t interested, and even companies like Twitter, popular and strategic as they are, don’t have the cash. Twitter is worth less than $30 billion in market cap today — can they really afford to spend, say, half the company on an acquisition? How much of a writedown would ByteDance have to take to make Twitter a logical fit?\n Most of this smoke about interest is designed to push Microsoft to make a fair deal. It’s designed to encourage them to sweeten their offer, lest one of these other “suitors” potentially becomes interested. Yet, the timing of a deal (it needs to be done in a matter of weeks right now) and the scope of the price effectively precludes all but one buyer today.\n So, beware bankers talking TikTok. We’re going to get a bunch of names of potential acquirers. Unless there is hard evidence of deep interest, I am going to remain skeptical of all the rumors.", "posttime": "2020-08-10 23:25:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "银行家,bankers", "title": "\n当心银行家谈论TikTok", "title_en": "\n\t\t\t\tBeware bankers talking TikTok\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/beware-bankers-talking-tiktok/", "via": "", "real_tags": ["银行家", "bankers"]}, {"category": "", "categoryclass": "", "imagename": "e55463e7734ec7d8072e6811cb9f47ed.png", "infoid": 1017358, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "9摘要：一项跨越20年的研究证明，PDF对于在线阅读是有问题的。然而，它们仍然很流行，用户继续迷失在它们中。它们不利于阅读和导航，也不适合数字内容显示。\n雅各布·尼尔森(Jakob Nielsen)第一次写PDF文件是在1996年，也就是PDF发明三年后，人们永远不应该在网上阅读PDF文件。20多年后，我们的研究继续证明PDF对用户来说同样是有问题的。尽管有证据，但它们在网上展示内容的频率仍然太高了。\nPDF通常是大量的文本和图像。该格式专为打印而设计和优化。它本质上是不可访问的，阅读起来令人不快，在线导航也很麻烦。无论是时间还是用户行为的变化都没有软化我们在这个问题上的循证立场。即使20年后，PDF仍然不适合人类在数字空间消费。不要使用PDF来呈现可能也应该是网页的数字内容。\n1.线性和限定性。PDF文件通常是从计划打印的文档或在专注于打印的软件平台中创建的文档转换而来的。当使用这些工具创建PDF时，作者不太可能遵循适当的网页编写或可访问性指南。如果他们知道这些，他们很可能一开始就会创建一个网页，而不是PDF。其结果是，用户被占用许多屏幕的冗长的、不包含内容的大量文本和图像所困，无法快速找到答案，而且阅读起来也很乏味。与直接从文字处理或演示平台导出相比，创建编写良好、可访问的PDF需要做更多的工作。诸如颜色的使用、对比度、文档结构、标签等因素必须有意识地加以解决。\n2.不和谐的用户体验。PDF看起来与典型的网页完全不同。他们把用户从熟悉的环境中带到一个过时而笨拙的环境中。即使您的PDF看起来很流畅，并且您认为用户可以使用快捷键(如Control或Command+F)导航来查找信息，但请三思而行。最精致的PDF在网络浏览器中仍然显得格格不入，而且并不是所有用户都知道键盘快捷键。我们反复观察到，高级用户会陷入PDF文档中，无法通过这种方式找到信息。\n3.装车速度慢。虽然提供PDF导致用户浏览器或计算机崩溃的风险比过去几年要低，但在台式机和移动设备上加载PDF可能会极其缓慢。在最近的一项研究中，内部网上PDF格式的自助餐厅菜单花了近3分钟才下载完毕。在放弃任务之前，用户说，\n“我们在等…。我们在等…。大概在这个时候，我会说，我真的不在乎午餐吃什么。“。\n此外，如果用户被迫使用蜂窝数据而不是WiFi下载一个庞大的PDF，那么如果他们招致额外的费用，他们会不高兴的。\n4.里面塞满了绒毛。与普通网页相比，PDF往往缺乏真正的内容。当你构建一个网页时，你可以清楚地看到它有多长时间，以及用户必须滚动多远才能使用内容。组织和格式化数字内容的方法，如分块、使用项目符号、副标题、锚链接和手风琴，可以帮助用户高效地浏览和扫描可能包含他们在长篇副本中寻找的答案的部分。然而，在PDF中，这些技术并不总是被使用，内容创建者往往更喜欢内容的数量，而不是质量和格式。这导致了压倒性的冗长和空洞的PDF。\n5.造成迷失方向。因为PDF不是网页，所以它们不会像网站那样显示标准导航。用户经常很难确定自己所在的位置，以及如何返回到以前的位置。如果PDF在新的浏览器选项卡或窗口中打开，而用户没有注意到，他们会想知道为什么浏览器的后退按钮不起作用，以及如何返回。或者，如果PDF在相同的浏览器窗口或选项卡中打开，而用户没有注意到，他们会关闭窗口或选项卡，假设它实际上是在新的窗口或选项卡中打开的。然后他们将不得不重新开始他们的课程。在移动设备上，这个问题会加剧，因为关闭浏览器窗口以返回到您所在的前一个屏幕要麻烦得多。打开新选项卡或窗口的最佳情况是，用户注意到并关闭窗口，或者移动到另一个选项卡返回。让用户保持在同一选项卡或窗口中的最佳情况是，他们注意到Back按钮仍然处于活动状态，并使用它返回到上一页。因为我们不能依赖最好的情况，所以最好不要将用户带到浏览器中的PDF。如果有必要，可以进行上下文研究，以了解当打开新的选项卡或窗口时，您的用户是否会陷入PDF或单独的应用程序中。\n6.无法导航的内容群。大多数PDF文件没有内部导航；它们的迷你IA是完全隐藏的，人们没有快速的方法来(1)了解PDF中可用的内容类型；(2)在不滚动面前的所有内容的情况下获得有趣的部分。许多支持发布PDF而不是创建网页的人认为，可点击的目录可以解决这个问题，但事实并非如此。用户必须花费大量时间和精力在目录中搜索那些与他们的任务或信息需求相匹配的关键字。即使用户找到一个有希望的词，也可能会产生误导。我们观察到用户跳转到PDF的某一部分，结果发现它没有包含他们需要的信息，或者他们漏掉了所有乱七八糟的答案。然后，用户被迫将75页滚动回目录重试。\n7.适合纸张大小，而不是屏幕大小。PDF布局通常针对打印的纸张进行优化，而打印的纸张永远不会与用户浏览器窗口的大小和比例保持一致。无论他们是在台式机上还是在移动设备上查看PDF，用户都可以说“再见”来流畅地滚动，并向无法阅读的小字体问好。更不用说在移动设备上浏览PDF时必须在上下文之外进行挤压、缩放、斜视和滚动。用户还可以在浏览器窗口中演示PDF的试错行为。他们试图点击看起来可以点击的项目，结果却失望地发现它们不是。\n将信息隐藏在PDF中意味着大多数人不会阅读它。在我们最近对公司网站和内部网进行的几项可用性研究中，参与者并不欣赏PDF，直接跳过了它们。每当他们遇到PDF文件时，他们都会悲哀地抱怨，许多打开PDF文件的人很快就放弃了这些文件。以下是商务专业人士在测试公司网站的“关于我们”区域时的行为和语录。一位在小企业管理局网站上寻找信息的用户被困在PDF中。当她试图弄清楚政府到底做了什么时，她说，\n“我希望它能更多地谈论他们能为我做些什么。如果印刷品再大一点，那就真的很有帮助了。现在，我被困在PDF文件里了。“。\n另一名用户在寻找有关富国银行总部所在地的信息，结果被困在PDF中。他说：“我原以为它会出现在联系我们页面的底部，但它不在那里。”用户继续使用站点搜索，试图找到总部位置。在总部打字后，他被带到网站的历史部分。他点击了一个链接，上面写着，今天的富国银行，然后说，\n“也许今天在富国银行。突然间下载了一个PDF，哎呀！在这一点上，我会在谷歌上搜索一下。“\n“我不能忍受PDF在不同的窗口打开。它应该在同一浏览器中打开。“。\n“每次单击，都会打开一个新窗口或PDF。我很沮丧，因为护士们总是点击后退按钮，而我们想要回到之前的网页。“。\n“这些PDF中的信息已过时。所以你得到的东西不是最新的。他们只是没有把这些联系去掉。“。\n“我不知道他们(带有电子邮件签名模板的PDF)是否更新了。我不能自信地分享它。有时会有多个版本的PDF。“。\n“所有的PDF都很可怕。旧的表单太多了，版本控制非常困难。我们正开始将它们移动到数据库中，但首先必须对它们进行审计，并跟踪用户，询问他们是否还需要表单。我们将采用最常用的表格，并首先解决这些表格。“。\n“又一次，它似乎把我带到了很多PDF文档……我希望这些信息只会出现在搜索结果的顶部。”\n“这是一个SharePoint PDF。我更愿意以常规的网页形式看到这一切。“。\n“我不知道这是不是很常见，但当我寻找内容时，我发现它隐藏在PDF中。我更喜欢在网页上看到这一点，而不是进入PDF。这是我更喜欢内容的方式，而不是转换媒体的方式。“\n“我没想到它会是PDF文档。哦，哦，天哪。“。\n“我们遇到了PDF表单的问题。其他人必须下载表单才能按照我们希望的方式使用它。你必须下载它才能使用这些功能，所以我们必须在文档顶部指定我们的合作伙伴正在使用这些功能，而他们可能没有最新的PDF阅读器。“。\n“对于我们的文档，我们使用PDF，但人们需要一个可搜索的页面或一篇文章。我们做PDF已经有10年了，现在我们想知道如何才能让这些信息在网站上更有用、更容易搜索。我们每天都会收到关于文档的问题，99%的时间，我们都有答案，但它被藏在PDF中，人们不想在那里寻找它。或者，如果他们搜索我们拥有的东西，它不会出现在搜索结果中，因为它在PDF中。\n我们在许多其他研究中都有过类似的用户反应，包括对B2B和电子商务网站的测试，这些网站的用户抱怨网站以PDF格式(而不是在网页上)展示产品规格或客户成功故事。以下是一位客户的一句话，他避开了PDF格式的网站部分：\n鉴于PDF对于在线阅读的易用性较差，用户体验设计者应该避免完全使用PDF而倾向于在网页上呈现内容，或者在需要可打印PDF的情况下，使用HTML网关页。网关页面是从PDF中汇总关键点和关键信息的网页，然后它们为用户提供了下载完整PDF的选项，而不必在浏览器窗口中打开它，因为在浏览器窗口中不适合使用。PDF文件大小应尽可能小，以保持质量，同时允许快速下载。网站搜索和面向公众的搜索引擎应该索引并链接到门户页面，而不是直接链接到PDF。不幸的是，通过我们与客户的持续研究和内容合作，很明显HTML网关页面仍然不足以帮助用户避免或绕过PDF引起的问题。\nJakob在2001年6月发表的Alertbox文章《避免PDF用于屏幕阅读》基于我们近20年前所做的研究，提供了对PDF的早期分析。令人惊讶的是，当时和现在的差别并不大。是的，由于提供PDF，浏览器和计算机崩溃的情况减少了，但用户对PDF的敌意即使不是更多，也是一样多。人们对与PDF相关的可用性问题有着越来越高的期望值和更多的体验--不仅是在桌面上，现在在移动设备上也是如此。这篇文章在2010年的另一次更新发现了PDF的类似问题，这些问题在2001年和我们过去几年的最新一轮研究中都发现了。我们的新研究不断发现在线界面中的PDF存在同样的问题。是时候一劳永逸地结束有问题的PDF了。\n在我们的全天课程“编写引人入胜的数字拷贝”中，了解更多有关如何处理有问题的PDF以及如何制作有效的数字内容的信息。此外，一份全新的、深入的眼睛追踪报告-人们如何在线阅读：眼睛追踪证据-现在可以使用。", "note_en": "9    Summary: Research spanning 20 years proves PDFs are problematic for online reading. Yet they’re still prevalent and users continue to get lost in them. They’re unpleasant to read and navigate and remain unfit for digital-content display.\n    Jakob Nielsen first wrote about how  PDF files should never be read online in 1996 — only three years after PDFs were invented. Over 20 years later, our research continues to prove that PDFs are just as problematic for users. Despite the evidence, they’re still used far too often to present content online.\n PDFs are typically large masses of text and images. The format is intended and optimized for print. It’s inherently inaccessible, unpleasant to read, and cumbersome to navigate online. Neither time nor changes in user behavior have softened our evidence-based stance on this subject. Even 20 years later, PDFs are still unfit for human consumption in the digital space.  Do not use PDFs to present digital content that could and should otherwise be a web page.\n   1. Linear and limiting. PDF files are typically converted from documents that were planned for print or created in print-focused software platforms. When creating PDFs in these tools, it’s unlikely that authors will follow proper  guidelines for web writing or  accessibility. If they knew these, they’d probably just create a web page in the first-place, not a PDF. As a result, users get stuck with a long, noninclusive mass of text and images that takes up many screens, is unusable for finding a quick answer, and boring to read. There’s more work involved in creating a well-written, accessible PDF than simply exporting it straight from a word processing or presentation platform. Factors such as the use of color, contrast, document structure, tags, and much more must be intentionally addressed.\n 2. Jarring user experience. PDFs look completely different from typical web pages. They take users out of a familiar context and into one that is outdated and clunky. Even if your PDF looks slick and you think users will be able to navigate with shortcuts like  Control or  Command +  F to find information, think again. The most polished PDFs still look out of place in a web browser and not all users know  keyboard shortcuts. We’ve repeatedly observed advanced users get stuck in PDFs and fail to find information this way.\n 3. Slow to load. While the risk of crashing a user’s browser or computer by serving up a PDF is lower than in years past, PDFs can be excruciatingly slow to load both on desktop and mobile. In one recent study, a cafeteria menu housed in a PDF on an intranet took almost 3 minutes to download. Before giving up on the task, the user said,\n “And we’re waiting…we’re waiting… At about this time I’d say, I really don’t care what’s for lunch.”\n Additionally, if users are forced to download a hefty PDF using cellular data instead of WiFi, they won’t be happy if they incur extra charges, as a result.\n 4. Stuffed with fluff. PDFs tend to lack real substance, compared to regular web pages. When you’re building out a web page, you can visibly see how long it’s getting and how far users will have to scroll to consume the content. Methods of structuring and formatting digital content such as  chunking, using bullets, subheadlines, anchor links, and accordions help users efficiently skim and scan sections that may contain the answers they seek amid long-form copy. However, in PDFs, those techniques aren’t always used and content creators tend to favor quantity of content over quality and formatting. This leads to overwhelmingly long and inane PDFs.\n 5. Cause disorientation. Because PDFs aren’t web pages, they don’t show a standard navigation like a website would. Users often struggle to stay oriented with where they are, and how to get back to where they were before. If PDFs  open in a new browser tab or window, and users don’t notice, they’ll wonder why the browser’s back button doesn’t work and how to get back. Or, if the PDF opens in the same browser window or tab and the user doesn’t notice, they close the window or tab assuming it  did in fact open in a new one. They’ll then have to start their session all over again. On mobile this problem is exacerbated, as it’s much more cumbersome to close a browser window to get back to the previous screen you were on. The best case scenario for opening a new tab or window is that the user notices and closes out of the window, or moves to the other tab to get back. The best case scenario for keeping users in the same tab or window is that they notice the back button remains active, and use it to get back to the previous page. Since we can’t rely on best case scenarios, it’s best to not take users to a PDF within a browser at all. If you must, do contextual research to understand if your users get stuck in PDFs or separate applications when new tabs or windows open.\n 6. Unnavigable content masses. Most PDF files have no internal navigation; their  mini IA is completely hidden and people have no quick way of (1) understanding the type of content available in the PDF; and (2) getting to the interesting bits without scrolling through everything that comes before them. Many proponents of posting PDFs instead of creating web pages, think that a clickable table of contents will solve this issue, but it doesn’t. Users have to spend much time and effort scanning the table of contents for those keywords that match their task or information need. Even if users find a promising word, it may be misleading. We’ve observed users jump to a section of a PDF, only to find it doesn’t contain the information they needed or they miss the answer in all the fluff. The users are then forced to scroll 75-pages back to the table of contents to try again.\n 7. Sized for paper, not screens. PDF layouts are often optimized for a printed sheet of paper, which never aligns with the size and scale of the user&#39;s browser window. Regardless of whether they’re viewing the PDF on desktop or mobile, users can say “so long” to smooth scrolling and hello to tiny, unreadable fonts. Not to mention having to pinch, zoom, squint, and scroll around out of context to navigate a PDF on mobile. Users also demonstrate trial-and-error behavior with PDFs in browser windows. They try to click on items that  look clickable, only to disappointedly find out they’re not.\n   Burying information in PDFs means that most people won’t read it. Participants in several of our recent usability studies on corporate websites and intranets did not appreciate PDFs and skipped right over them. They complained woefully whenever they encountered PDF files and many who opened PDFs quickly abandoned them. Following are behaviors and quotes from business professionals testing the   About Us areas of corporate websites. One user looking for information on the Small Business Administration’s website got stuck in a PDF. While she was trying to figure out what exactly the administration did, she said,\n “I expect it to talk more about what they can do for me. If the print was bigger, that would be really helpful. Now, I’m stuck in a PDF.”\n  Another user was looking for information about where Wells Fargo was headquartered and got stuck in a PDF. He said, “I expected to see it at the bottom of the contact us page; it’s not there.” The user proceeded to use site search to try to find the headquarters location. After typing in  headquarters, he was taken to the history section of the website. He clicked on a link that said,  Wells Fargo Today, and said,\n “Maybe it’s in Wells Fargo today. All of a sudden that downloads a PDF, ew! At this point, I would just Google it.”\n   “I can’t stand that the PDFs open in a different window. It should open in the same browser.”\n “Every time you click, it opens a new window or PDF. I am frustrated because nurses always click the Back button and we want to go back to the previous web page.”\n “Information is outdated in those PDFs. So you’re getting stuff that isn’t current. They just haven’t taken those links off.”\n “I don’t know if they [a PDF with email-signature templates] are updated. I can’t confidently share it. Sometimes there are multiple versions of PDFs.”\n “All of the PDFs are horrible. There are so many old forms and version control is so difficult. We’re starting to move them into a database but first have to audit them and track down people to ask them if they still need the form. We’re taking the top-used forms and tackling those first.”\n “Again, it seems to be taking me to a lot of PDF documents...I was hoping the info would just be at the top of the search results.”\n  “It’s a SharePoint PDF. I would much rather see all of this in a regular webpage format.”\n “I don’t know if it’s common, but when I’m looking for content, I find it hidden in a PDF. I prefer to see that on a web page itself rather than going into PDFs. It’s the way I prefer the content rather than switching mediums.”\n “I didn’t think it would be a PDF document. Oh, oh, goodness.”\n “We’ve come across problems with PDF forms. Others have to download the form in order to use it the way we want them to use it. You have to download it to get the features to work, so we always have to specify at the top of our documents that our partners are using these and they might not have the latest PDF readers.”\n “For our documentation, we use PDFs, but people need a searchable page or an article. We’ve been doing PDFs for 10 years and now we’re wondering how we can make this information more usable and searchable on the site. We get questions every day about documentation and 99% of the time, we have the answer, but it’s buried in a PDF and people don’t want to have to look for it in there. Or, if they search for something we have, it doesn’t come up in search results because it’s in a PDF.\n We&#39;ve had similar reactions from users in many other studies, including tests of B2B and ecommerce websites where users complained about sites that presented product specs or customer success stories in PDF instead of on web pages. Here&#39;s a quote from a customer who shunned the parts of the site that were in PDF:\n   Given PDFs poor usability for online reading, user-experience designers should either avoid using PDFs altogether in favor of presenting content on web pages, or, in cases where a printable PDF is needed, use an  HTML gateway page. Gateway pages are web pages that summarize the key points and critical information from a PDF, and then they  offer users the option to download the full PDF without having to open it in a browser window, where it’s unfit for consumption. The PDF file size should be as small as possible to preserve quality, while allowing it to download quickly. Site search and  public-facing search engines should index and  link to the gateway page, never the PDF directly. Unfortunately, through our continued research and content work with clients, it’s become clear that HTML gateway pages still aren’t used nearly enough to help users avoid or circumvent the issues caused by PDFs.\n   Jakob’s Alertbox article from June 2001,  Avoid PDF for On-Screen Reading, provides an earlier analysis of PDFs based on the studies we did almost 20 years ago. Surprisingly, the difference between then and now is not much. Yes, there are fewer browser and computer crashes as a result of serving up PDFs, but just as much if not more user hostility toward PDF. People have ever-increasing expectations and more experience with the usability problems associated with PDFs — not only on desktop, but now on mobile too. Another update to this article in 2010 found similar problems with PDFs as those uncovered in both 2001 and in our most recent rounds of research over the past few years. Our new studies keep finding the same problems with PDFs in online interfaces. It’s time to put an end to problematic PDFs, once and for all.\n Learn more about how to address problematic PDFs and how to craft effective digital content in our full-day course,  Writing Compelling Digital Copy. Additionally, a brand new, in-depth eyetracking report,  How People Read Online: The Eyetracking Evidence is available now.", "posttime": "2020-08-10 23:24:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,unfit,pdf", "title": "20年后，PDF仍然不适合人类消费", "title_en": "PDF Still Unfit for Human Consumption, 20 Years Later", "transed": 1, "url": "https://www.nngroup.com/articles/pdf-unfit-for-human-consumption/", "via": "", "real_tags": ["人类", "unfit", "pdf"]}, {"category": "", "categoryclass": "", "imagename": "f707aa7ed610d2ae4c76e72da74d4e1f.jpg", "infoid": 1017357, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "I​1815年，在他制作他最著名的版画“大浪”的15年前，北井出版了三卷色情艺术。其中有一幅木刻版画，英文名为“渔夫妻子的梦”，日语名为“Tako to ama”，即“章鱼和贝壳潜水员”。它描绘了一名裸体女子仰面躺着，双腿张开，闭着眼睛，而一只巨大的红色章鱼在她身上表演。章鱼的狭缝眼睛在女子的双腿之间凸出，其吸吮的四肢缠绕着她扭曲的身体。第二只较小的章鱼将喙插入女子的嘴里，同时将一只细长的手臂尖端卷绕在她的左乳头上。在欧洲，这幅画被解读为强奸的场景，但评论家们没有读懂日语。在三具缠绕在一起的身体周围排列的文字中，贝壳潜水员惊呼道：“你这个可恶的章鱼！你吮吸我的子宫口让我喘不过气来！阿!。是的，…。我是…。那里!。用吸盘，吸盘！…。好了，好了！…。直到现在，男人们称章鱼为章鱼的是我！一只章鱼！…。你是怎么做到的？…。噢!。边界和边界消失了！我消失了！“。\n章鱼威胁边界。它的身体是一团无骨的软组织，没有固定的形状。即使是大型章鱼-最大的物种巨型太平洋章鱼，手臂跨度超过6米，体重100磅-也可以通过一个一英寸宽的开口，或者说大约眼睛大小。这一点，再加上它们相当的力量-一只成熟的雄性巨人太平洋章鱼可以用1600条吸盘每人举起30磅-意味着章鱼很难圈养。许多章鱼通过小洞逃出水族箱；众所周知，一些章鱼会掀开水族箱的盖子，有时会穿过干燥的地面，到邻近的水箱吃零食，或者到最近的排水口，也许还会从那里回到家。\n章鱼没有任何稳定的颜色或质地，可以根据周围环境随意变化：从几英尺远的地方就能看到一只伪装过的章鱼。像人类一样，他们有集中的神经系统，但在他们的情况下，大脑和身体之间没有明显的区别。章鱼的神经元散布在它的全身，其中三分之二在它的手臂上：每只手臂都能智能地行动，抓取，操纵和狩猎。(章鱼有手臂，没有触须：触须只有尖端有吸盘。鱿鱼和墨鱼有手臂和触须的组合。)。从进化论的角度来看，章鱼的智力是一种反常现象。章鱼与人类和其他聪明的动物(猴子、海豚、狗、乌鸦)之间的最后一个共同祖先，可能是存在于6亿年前的一种原始的、盲目的蠕虫状生物。其他在进化上与人类相距甚远的生物--龙虾、蜗牛、鼻涕、蛤蜊--在认知水平上的得分相当低。但是章鱼-在某种程度上还有它们的头足类近亲墨鱼和鱿鱼-阻碍了聪明的脊椎动物和头脑简单的无脊椎动物之间整齐的进化划分。他们是老练的问题解决者；他们学习并会使用工具；他们表现出模仿、欺骗的能力，还有一些人认为他们有幽默感。它们的能力到底有多精致，这是一个科学争论的问题：它们非常陌生，这使得章鱼很难研究。他们的智力和我们一样，完全不同于我们。章鱼是我们在地球上最接近于知道遇到聪明的外星人是什么样子的。\n彼得·戈弗雷·史密斯(Peter Godfrey-Smith)是一位哲学家和潜水员，多年来一直在野外研究章鱼和其他头足类动物，主要是在他的家乡悉尼海岸附近。在他看来，章鱼的疏离性提供了一个反思认知和意识本质的机会，而不是简单地从人类的例子中投射出来。由于章鱼与人类进化的距离，章鱼是“大型大脑和复杂行为进化的独立实验”。就我们能够与章鱼进行智能接触--了解章鱼并让它们了解我们--而言，这“不是因为有共同的历史，也不是因为亲缘关系，而是因为进化两次构建了大脑”。潜在的担忧是，我们和章鱼之间的进化鸿沟太大，以至于无法相互理解。在这种情况下，章鱼将会教给我们一些关于我们自己理解的极限的东西。\n章鱼是一种八臂软体软体动物。它的手臂上覆盖着吸盘，围绕着尖嘴呈放射状排列。它的进食方式是用一只胳膊抓住猎物，然后把猎物通过一条由起伏的吸盘组成的传送带送到嘴里--从这个意义上说，章鱼的手臂也可以被认为是它的嘴唇。它的手臂顶端安放着头部，头部包含大脑，有两只大眼睛，瞳孔水平，呈短划线状，就像打开的猫眼一样。\n章鱼到底有多聪明？一只章鱼有5亿个神经元，大约和一只狗一样多。(人类有一千亿个神经元。)。章鱼的大脑与身体的比例也很高，这是章鱼对自身认知进行“投资”的标志。但这些指标只是对动物智力的一个非常粗略的指导；神经元之间突触连接的数量和复杂性也是一个因素。(乌鸦和鹦鹉的大脑很小，但最近被证明非常聪明。)。而且，大脑与身体的比例没有考虑到章鱼大脑之外的大多数神经元。更重要的是，章鱼的大脑结构与我们人类的完全不同。即使是鸟和鱼也有大脑，它们与人类大脑的各个部分一一对应。但是章鱼的大脑是建立在完全不同的模型上的。\n由于与人脑的比较我们知之甚少，科学家们将章鱼的行为作为其认知力的最佳指示器。但在这里，研究人员经常对戈弗雷-史密斯所说的轶事报道和实验研究之间的“不匹配”感到沮丧。在实验室里，章鱼做得相当好：它们能导航迷宫，能用记忆解开简单的谜题，还能拧开罐子和儿童保护瓶来获取食物(章鱼也被拍到从里面打开果酱罐子)。然而，章鱼可能需要惊人的长时间才能训练出新的行为，一些研究人员认为这是它们认知能力有限的标志。早期关于章鱼智能的大部分工作都是在那不勒斯动物站完成的。1959年，哈佛大学科学家彼得·杜斯(Peter Dews)在那里训练了三只章鱼，让它们拉动杠杆获得一大块沙丁鱼。其中两只章鱼，阿尔伯特和伯特伦，以“相当一致”的方式拉动了操纵杆。但是第三个，查尔斯，会把他的胳膊固定在坦克的一侧，对杠杆施加很大的力，最终把它弄断，实验提前结束。Dews还报告说，查尔斯反复将一盏灯拉进他的水箱，他“有很大的倾向将水从水箱中喷出；特别是…。朝向实验者的方向“。“这种行为，”杜斯写道，“严重干扰了实验的顺利进行，而且是错误的(…)。显然与杠杆拉动不相容。他得出结论，他的实验是部分失败的。戈弗雷-史密斯说，这“用章鱼的行为概括了故事的大部分内容”。章鱼有很高的好奇心，而且有一种为了自己的目的而改变周围事物用途的诀窍。也许章鱼觉得有些任务很难学。或者他们只是有更好的事情要做。\n圈养的章鱼似乎意识到了它们的圈养；它们适应了这一点，但也抵制了它。当他们试图逃跑时(通常是这样)，他们往往会等待一段时间，因为他们没有被监视。章鱼故意用手臂堵住水箱中的阀门，从而淹没了实验室。在奥塔哥大学，一只章鱼经常向水族馆的灯泡喷射水柱，导致电力供应短路，因此不得不将其放回野外。宾夕法尼亚州米勒斯维尔大学(Millersville University)的头足类研究人员让·博尔(Jean Boal)报告说，他用解冻的鱿鱼在一排水箱里喂章鱼，而不是章鱼最喜欢的食物。回到第一个水箱，波尔发现里面的章鱼没有吃鱿鱼，而是用胳膊把它伸出来；看着波尔，它慢慢地穿过水箱，把鱿鱼推到排水沟里。(比亚里士多德更有同情心的观察家、公元3世纪的罗马修辞学家克劳迪乌斯·埃利亚努斯认为章鱼的主要特征是“恶作剧和狡猾”。)。\n做章鱼是什么感觉？有什么感觉吗？或者，章鱼就像戈弗雷-史密斯所说的那样，“只是一台生化机器，里面一片漆黑”？这种形式的问题--‘当蝙蝠是什么感觉？’托马斯·内格尔(Thomas Nagel)在1974年一篇极具影响力的论文中问道--这是对生物是否有意识的哲学速记。许多哲学家认为意识是一种要么全有要么全无的现象：你要么有意识，要么没有意识。人类有意识，也许黑猩猩和海豚也是如此。老鼠、蚂蚁和变形虫大概不会。要么全有要么全无的观点的部分动机是，很难想象意识在一定程度上被拥有。其他认知属性--比如记忆力、语言能力和解决问题的能力--是可以而且确实在不同生物和不同物种之间程度不同的东西。但很难看出意识是如何以这种方式变化的。正如戈弗雷-史密斯所说，“一只动物怎么可能在让自己感觉像是那只动物的过程中走到一半呢？”然而，如果意识是一种自然的东西，随着时间的推移而进化的东西，那么它似乎不太可能在进化的某个时候突然出现。\n戈弗雷-史密斯认为，从现象学的角度讲，章鱼处于一种混合状态：它的手臂一部分是自己的，一部分是其他的。正因为如此，章鱼有时被奉为心理学中“体验式认知”运动的吉祥物，根据这一运动，肉体通过约束和使某些动作成为可能，本身就是“智能的”。例如，人类行走的能力不仅仅是一个简单的自上而下的大脑控制问题，也是我们关节角度的功能；从这个意义上说，我们的身体编码了对智能行动至关重要的信息。毫无疑问，章鱼的肉身与我们的完全不同，理解章鱼的心灵需要我们掌握其特定的肉身形式。但是，从具身认知的角度来思考章鱼，可能会低估它的陌生性。虽然从限制和机会的角度来看待我们自己的身体是有意义的，但正如戈弗雷-史密斯所说，章鱼的身体是“千变万化的，完全有可能的”。即使是问身体对智能行为的贡献有多大，也是以大脑和身体之间的分离为前提的，这似乎不适用于章鱼。章鱼的身体充满了紧张：它不是由动物的思维部分控制的，而是它本身就是一种思维的东西。\n在思考章鱼的经历时，另一个奇怪之处与章鱼与颜色的关系有关。章鱼的皮肤是一个由像素状的色囊组成的分层屏幕，称为色团，这使得章鱼有可能随意改变自己的颜色，以匹配它的周围环境或威胁侵略者。这种所谓的模仿章鱼可以通过改变颜色和形状来模仿超过15种不同的动物，包括比目鱼、狮子鱼和海蛇。章鱼的颜色似乎也表明了它的情绪-一些章鱼在被人类长时间抚摸后变白，在交配后也是如此。章鱼产生的彩色显示可以包括精心设计的条纹和斑点图案、闪烁的环和波纹。\n.", "note_en": "I ​ 1815, 15 years before he made his most famous print,  The Great Wave, Hokusai published three volumes of erotic art. In one of them there is a woodcut print known in English as ‘The Dream of the Fisherman’s Wife’ and in Japanese as ‘ Tako to ama’, ‘Octopus and Shell Diver’. It depicts a naked woman lying on her back, legs spread and eyes closed, while a huge red octopus performs cunnilingus on her. The octopus’s slit eyes bulge between the woman’s legs and its suckered limbs wrap around her writhing body. A second, smaller octopus inserts its beak into the woman’s mouth while curling the thin tip of an arm around her left nipple. In Europe, the print was interpreted as a scene of rape, but the critics didn’t read Japanese. In the text arranged in the space around the three entwined bodies, the shell diver exclaims: ‘You hateful octopus! Your sucking at the mouth of my womb makes me gasp for breath! Ah! Yes … it’s … there! With the sucker, the sucker! … There, there! … Until now it was I that men called an octopus! An octopus! … How are you able? … Oh! Boundaries and borders gone! I’ve vanished!’\n  The octopus threatens boundaries. Its body, a boneless mass of soft tissue, has no fixed shape. Even large octopuses – the largest species, the Giant Pacific, has an arm span of more than six metres and weighs a hundred pounds – can fit through an opening an inch wide, or about the size of its eye. This, combined with their considerable strength – a mature male Giant Pacific can lift thirty pounds with each of its 1600 suckers – means that octopuses are difficult to keep in captivity. Many octopuses have escaped their aquarium tanks through small holes; some have been known to lift the lid of their tank, making their way, sometimes across stretches of dry floor, to a neighbouring tank for a snack, or to the nearest drain, and maybe from there back home to the sea.\n Octopuses do not have any stable colour or texture, changing at will to match their surroundings: a camouflaged octopus can be invisible from just a few feet away. Like humans, they have centralised nervous systems, but in their case there is no clear distinction between brain and body. An octopus’s neurons are dispersed throughout its body, and two-thirds of them are in its arms: each arm can act intelligently on its own, grasping, manipulating and hunting. (Octopuses have arms, not tentacles: tentacles have suckers only at their tips. Squid and cuttlefish have a combination of arms and tentacles.) In evolutionary terms, the intelligence of octopuses is an anomaly. The last common ancestor between octopuses on the one hand, and humans and other intelligent animals (monkeys, dolphins, dogs, crows) on the other, was probably a primitive, blind worm-like creature that existed six hundred million years ago. Other creatures that are so evolutionarily distant from humans – lobsters, snails, slugs, clams – rate pretty low on the cognitive scale. But octopuses – and to some extent their cephalopod cousins, cuttlefish and squid – frustrate the neat evolutionary division between clever vertebrates and simple-minded invertebrates. They are sophisticated problem solvers; they learn, and can use tools; and they show a capacity for mimicry, deception and, some think, humour. Just how refined their abilities are is a matter of scientific debate: their very strangeness makes octopuses hard to study. Their intelligence is like ours, and utterly unlike ours. Octopuses are the closest we can come, on earth, to knowing what it might be like to encounter intelligent aliens.\n Peter Godfrey-Smith is a philosopher and diver who has been studying octopuses and other cephalopods in the wild, mostly off the coast of his native Sydney, for years. The alienness of octopuses, in his view, provides an opportunity to reflect on the nature of cognition and consciousness without simply projecting from the human example. Because of their evolutionary distance from us, octopuses are an ‘independent experiment in the evolution of large brains and complex behaviour’. Insofar as we are able to make intelligent contact with them – to understand octopuses and have them understand us – it is ‘not because of a shared history, not because of kinship, but because evolution built minds twice over’. The potential worry is that the evolutionary chasm between us and the octopus is too great to make mutual intelligibility possible. In that case the octopus will have something to teach us about the limits of our own understanding.\n An octopus is an eight-armed, soft-bodied mollusc. Its arms are covered in suckers and arranged radially around a sharp-beaked mouth. It eats by catching prey with one of its arms and moving it through a conveyer belt of undulating suckers to its mouth – in that sense an octopus’s arms can also be thought of as its lips. On top of its arms rests its head, which contains its brain and features two large eyes with horizontal, dash-shaped pupils, like a cat’s eyes turned on their side. Behind the head is the octopus’s mantle, a large bulbous structure that contains its vital organs, including three hearts which pump blue-green blood. A tubular siphon is attached to the mantle, which the octopus uses variously for jet propulsion, respiration, excretion and inking predators. A full-grown octopus can range in size from the Giant Pacific, with its six-metre arm span, to the 2.5 centimetre-long  Octopus wolfi, which weighs less than a gram.\n Linnaeus called the octopus  singulare monstrum, ‘a unique monster’. Erik Pontoppidan, bishop of Bergen, in his  Natural History of Norway (1752), wrote about the Kraken, a giant octopus-like sea monster capable of dragging down ‘the largest man of war’ in its arms, or sucking it down in the whirlpool of its wake. A similar creature, the Akkorokamui, with huge eyes and the ability to amputate and regenerate its limbs, features in Ainu folklore, and is worshipped in Shinto shrines throughout Japan. Victor Hugo’s  Toilers of the Sea includes a long description of the octopus or ‘devil-fish’:\n If terror were the object of … creation, nothing could be imagined more perfect than the devil-fish … This irregular mass advances slowly towards you. Suddenly it opens, and eight radii issue abruptly from around a face with two eyes. These radii are alive: their undulation is like lambent flames … A terrible expansion! … Its folds strangle, its contact paralyses. It has an aspect like gangrened or scabrous flesh. It is a monstrous embodiment of disease … Underneath each of [its] feelers range two rows of pustules, decreasing in size … They are cartilaginous substances, cylindrical, horny and livid … A glutinous mass, endowed with a malignant will, what can be more horrible?\n Octopuses are indeed glutinous; according to Sy Montgomery, author of the splendid  Soul of an Octopus, the slime on an octopus’s skin feels like a cross between drool and snot. But the octopus’s will is far from malignant, at least when it comes to humans. Octopuses do occasionally attack people, giving a venomous nip or stealing an underwater camera when threatened or annoyed, but in general they are gentle, inquisitive creatures. (Fishermen, by contrast, often kill octopuses by biting out their brains, and in many countries they are eaten alive.) Octopuses encountering divers in the wild will frequently meet them with a probing arm or two, and sometimes lead them by the hand on a tour of the neighbourhood. Aristotle, mistaking curiosity for a lack of intelligence, called the octopus a ‘stupid creature’ because of its willingness to approach an extended human hand. Octopuses can recognise individual humans, and will respond differently to different people, greeting some with a caress of the arms, spraying others with their siphons. This is striking behaviour in an animal whose natural life cycle is deeply antisocial. Octopuses live solitary lives in single dens and die soon after their young hatch. Many male octopuses, to avoid being eaten during mating, will keep their bodies as far removed from the female as possible, extending a single arm with a sperm packet towards her siphon, a manoeuvre known as ‘the reach’.\n Just how clever are octopuses? An octopus has half a billion neurons, about as many as a dog. (A human has a hundred billion neurons.) Octopuses also have a high ratio of brain to body size, a sign of the ‘investment’ the animal makes in its own cognition. But these metrics are only a very rough guide to animal intelligence; the number and complexity of synaptic connections between neurons are also a factor. (Crows and parrots have small brains, but have recently been shown to be highly intelligent.) And the brain-to-body ratio does not take into account the majority of the octopus’s neurons that exist outside its brain. What’s more, the octopus’s brain has a structure completely distinct from that of our own. Even birds and fish have brains which exhibit a one-to-one correspondence with parts of the human brain. But the octopus’s brain is built on a different model entirely.\n Since a comparison with the human brain tells us so little, scientists turn to the octopus’s behaviour as the best indicator of its cognitive power. But here researchers are often frustrated by what Godfrey-Smith describes as a ‘mismatch’ between anecdotal reports and experimental studies. In the lab, octopuses do fairly well: they can navigate mazes, use memory to solve simple puzzles and unscrew jars and child-proof bottles to get food (octopuses have also been filmed opening jam jars from the inside). Yet it can take octopuses a surprisingly long time to be trained in new behaviours, which some researchers have taken as a sign of their cognitive limitations. Much of the early work on octopus intelligence was done at the Naples Zoological Station. In 1959, Peter Dews, a Harvard scientist, trained three octopuses there to pull a lever to obtain a chunk of sardine. Two of the octopuses, Albert and Bertram, pulled the lever in a ‘reasonably consistent’ manner. But the third, Charles, would anchor his arms on the side of the tank and apply great force to the lever, eventually breaking it and bringing the experiment to a premature end. Dews also reported that Charles repeatedly pulled a lamp into his tank, and that he ‘had a high tendency to direct jets of water out of the tank; specifically … in the direction of the experimenter’. ‘This behaviour,’ Dews wrote, ‘interfered materially with the smooth conduct of the experiments, and is … clearly incompatible with lever-pulling.’ He concluded that his experiment was a partial failure. Godfrey-Smith says this ‘encapsulates much of the story with octopus behaviour’. Octopuses have a high curiosity drive, and a knack for repurposing things around them for their own ends. Perhaps there are tasks that octopuses find it hard to learn. Or perhaps they just have better things to do.\n Captive octopuses appear to be aware of their captivity; they adapt to it but also resist it. When they try to escape, which is often, they tend to wait for a moment they aren’t being watched. Octopuses have flooded laboratories by deliberately plugging valves in their tanks with their arms. At the University of Otago, an octopus short-circuited the electricity supply – by shooting jets of water at the aquarium lightbulbs – so often that it had to be released back into the wild. Jean Boal, a cephalopod researcher at Millersville University in Pennsylvania, reported feeding octopuses in a row of tanks with thawed squid, not an octopus’s favourite food. Returning to the first tank, Boal found that the octopus in it hadn’t eaten the squid, but was instead holding it out in its arm; watching Boal, it slowly made its way across the tank and shoved the squid down the drain. (The third-century Roman rhetorician Claudius Aelianus, a more sympathetic observer than Aristotle, identified the octopus’s main characteristic as ‘mischief and craft’.)\n What does it feel like to be an octopus? Does it feel like anything at all? Or are octopuses, as Godfrey-Smith puts it, ‘just biochemical machines for which all is dark inside’? This form of question – ‘what is it like to be a bat?’ Thomas Nagel asked in a hugely influential paper in 1974 – is philosophical shorthand for asking whether a creature is conscious. Many philosophers think consciousness is an all or nothing phenomenon: you either have it or you don’t. Humans have it, as do perhaps chimps and dolphins. Mice, ants and amoebas presumably do not. Part of the motivation for the all or nothing view is that it is difficult to imagine consciousness being possessed in degrees. Other cognitive attributes – like memory, linguistic capacity and problem-solving ability – are the sorts of thing that can and do vary in degree from creature to creature, and species to species. But it is harder to see how consciousness can vary in that way. As Godfrey-Smith puts it, ‘how can an animal be halfway to having it feel like something to be that animal?’ Yet, if consciousness is a natural thing, something that evolved over time, it seems unlikely that it just popped up at some point in evolutionary history, fully formed.\n Godfrey-Smith starts with the conviction that consciousness is an evolved thing, and accepts the conclusion that it has more primitive precursors: that it comes in degrees after all. Consciousness – the possession of an ‘inner’ model of the ‘outer’ world, or the sense of having an integrated, subjective perspective on the world – is, on his view, just a highly evolved form of what he calls ‘subjective experience’. Many animals, Godfrey-Smith thinks, have some degree of subjective experience, even if it falls short of full-blown consciousness. He points to what the physiologist Derek Denton called the ‘primordial emotions’: thirst, lack of air, physical pain. These sensations intrude on our more complex mental processes, refusing to be dismissed. They hark back to a more rudimentary form of experiencing the world – a form, Godfrey-Smith thinks, that does not require a sophisticated inner model of the world. ‘Do you think,’ he asks, that pain, thirst or shortness of breath ‘ only feel like something because of sophisticated cognitive processing in mammals that has arisen late in evolution? I doubt it.’\n The case of animal pain underscores Godfrey-Smith’s point. Simple animals respond to physical harm with what appears to be distress, and there is experimental evidence that suggests that they feel pain, that physical harm feels bad for them. Zebrafish, injected with what is assumed to be a painful chemical, will prefer an otherwise less desirable environment if a painkiller is dissolved in the water. Similarly, chickens with leg injuries will choose a feed they don’t normally favour if it is laced with a painkiller. Insects do not appear to feel pain, carrying on as usual even after major injuries. But shrimp and crabs groom their injured parts, and do so less when they are given an anaesthetic. None of this is dispositive evidence that animals feel pain – but then it isn’t clear what would be. As Godfrey-Smith puts it, ‘you can still doubt that these animals feel anything, yes. But you can doubt that about your next-door neighbour.’ If even simple animals have rudimentary forms of consciousness or subjective experience, what might that feel like? What does it feel like to be an injured crab? Here Godfrey-Smith reaches for a metaphor proposed by the evolutionary theorists Simona Ginsburg and Eva Jablonka: white noise. Primitive consciousness, he writes, might be like ‘a crackle of metabolic electricity’, an ‘inchoate buzz’ that grows, with evolutionary time, in complexity and clarity.\n If consciousness comes in degrees, then where on the spectrum is the octopus? Octopuses almost certainly feel pain. They nurse and protect injured body parts, and don’t like to be touched near wounds. (Until recently, researchers operated on octopuses without anaesthetic, and much early work on them involved electric shocks. A 2010 EU directive on animal testing classifies cephalopods together with vertebrates because of their ‘ability to experience pain, suffering, distress and lasting harm’.) As well as feeling pain, octopuses have sophisticated sensory capacities: excellent eyesight, and acute senses of taste and smell. This, together with their large nervous systems and complex behaviour, makes it all but certain, in Godfrey-Smith’s view, that octopuses have rich subjective experience. But they may have even more than this. According to some theorists, notably Stanislas Dehaene, a particular kind of mental processing, the sort that involves completing novel tasks extended over time, not only goes hand in hand with human consciousness, but helps explain why humans are conscious. The octopus’s curiosity and adaptability to novel circumstances are, Godfrey-Smith suggests, ‘reminiscent’ of these paradigmatically human forms of cognition. If so, then being an octopus might be more like being a human than we have tended to think.\n The question of what subjective experience might be like for an octopus is complicated by the odd relationship between its brain and its body. An octopus’s arms have more neurons than its brain, about ten thousand neurons per sucker; the arms can taste and smell, and exhibit short-term memory. Each arm acts with considerable independence from the brain; even a surgically detached arm can reach and grasp, avoid painful stimuli, and change colour. (In  The Soul of an Octopus, Montgomery imagines an octopus testing human intelligence by seeing how many colour patterns our severed arms can produce in one second.) Yet an octopus’s brain can exert executive control, ‘pulling itself together’ when it needs to, for example when an octopus puts out only a single inquisitive arm to inspect a stranger.\n Godfrey-Smith suggests that the octopus is, phenomenologically speaking, in a hybrid situation: its arms are partly self, and partly other. Because of this, the octopus is sometimes held up as a mascot for the ‘embodied cognition’ movement in psychology, according to which the physical body, by constraining and making possible certain actions, is itself ‘intelligent’. The human ability to walk, for example, is not simply a matter of top-down brain control, but also a function of the angles of our joints; in this sense, our bodies encode information vital for intelligent action. There can be little doubt that an octopus’s embodiment is radically different from our own, and that understanding an octopus’s mind requires us to grasp its particular form of embodiment. But thinking about the octopus in terms of embodied cognition may undersell its strangeness. While it makes sense to think of our own bodies in terms of the constraints and opportunities they afford, the octopus’s body, as Godfrey-Smith says, is ‘protean, all possibility’. Even asking how much the body contributes to intelligent action presupposes a division between brain and body that seems not to apply to the octopus. The octopus’s body is pervaded by nervousness: it is not a thing controlled by the animal’s thinking part, but itself a thinking thing.\n A further oddity in thinking about octopus experience has to do with the creature’s relationship to colour. An octopus’s skin is a layered screen of pixel-like sacs of colour called chromatophores, which make it possible for an octopus to change its colour at will to match its surroundings or threaten an aggressor. The so-called mimic octopus can impersonate more than 15 different animals, including flounder, lionfish and sea snakes, by changing its colour and shape. An octopus’s colour also seems to indicate its mood – some octopuses turn white after being caressed for a long time by humans, as well as after mating. The chromatic displays produced by octopuses can include elaborate patterns of stripes and spots, flashing rings and waves of rippling \n......", "posttime": "2020-08-10 23:23:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "章鱼,octopus", "title": "做章鱼是什么感觉？", "title_en": "What's it like to be an Octopus?", "transed": 1, "url": "https://www.lrb.co.uk/the-paper/v39/n17/amia-srinivasan/the-sucker-the-sucker", "via": "", "real_tags": ["章鱼", "octopus"]}, {"category": "", "categoryclass": "", "imagename": "bf8748a6fc6af701d44760acf5667830.jpeg", "infoid": 1017355, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家美国最大的购物中心所有者一直在与亚马逊公司(Amazon.com Inc.)谈判，以接管境况不佳的百货商店留下的空间。许多零售商谴责亚马逊是购物中心行业最大的颠覆者。\n西蒙地产集团(Simon Property Group Inc.)。据知情人士透露，该公司一直在与亚马逊探讨将该地产所有者的一些锚定百货商店转变为亚马逊配送中心的可能性。亚马逊通常使用这些仓库来储存从书籍和毛衣到厨房用具和电子产品的一切……", "note_en": "The largest mall owner in the U.S. has been in talks with Amazon.com Inc., the company many retailers denounce as the mall industry’s biggest disrupter, to take over space left by ailing department stores.\n  Simon Property Group Inc. has been exploring with Amazon the possibility of turning some of the property owner’s anchor department stores into Amazon distribution hubs, according to people familiar with the matter. Amazon typically uses these warehouses to store everything from books and sweaters to kitchenware and electronics...", "posttime": "2020-08-10 23:22:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,商店,turning,百货商店", "title": "亚马逊考虑将西尔斯，J.C.Penney商店变成履约中心", "title_en": "Amazon Looks at Turning Sears, J.C. Penney Stores into Fulfillment Centers", "transed": 1, "url": "https://www.wsj.com/articles/amazon-and-giant-mall-operator-look-at-turning-sears-j-c-penney-stores-into-fulfillment-centers-11596992863", "via": "", "real_tags": ["亚马逊", "amazon", "商店", "turning", "百货商店"]}, {"category": "", "categoryclass": "", "imagename": "1a19830f6e036521ead5ddbd6f25b2b6.png", "infoid": 1017354, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "遇到申请人商标的消费者很可能会将该商标与苹果联系在一起。申请者标志由一个带有直角叶子的极简主义水果设计组成，很容易让人想起苹果著名的苹果标志，并创造出类似的商业印象，如下面的并排比较所示。\n以下是比较结果。如果Prepear在销售电脑、手机或手表，我实际上可以认为这是一个合理的反对意见。但它们是一款食谱应用程序。他们的标识显然看起来像一个梨，而不是苹果，他们的梨甚至看起来都不像苹果标识的梨。\n回到过去，苹果甚至没有对香蕉少年系列个人电脑采取法律行动，他们的标志是一个六色香蕉。", "note_en": "Consumers encountering Applicant’s Mark are likely to associatethe mark with Apple. Applicant’s Mark consists of a minimalisticfruit design with a right-angled leaf, which readily calls to mindApple’s famous Apple Logo and creates a similar commercialimpression, as shown in the following side-by-side comparison.\n Here’s the comparison. I could actually see this being a reasonable objection if Prepear were selling computers or phones or watches. But they’re a recipe app. Their logo clearly looks like a pear, not an apple, and their pear does not even look like an Apple-logo-like pear.\n Back in the old days Apple didn’t even pursue legal action against the  Banana Junior series of personal computers, and their logo was  a six-color banana.", "posttime": "2020-08-10 22:55:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,fighting", "title": "苹果正在争夺Prepear的梨形商标", "title_en": "Apple Is Fighting Trademark for Prepear's Pear-Shaped Logo", "transed": 1, "url": "https://daringfireball.net/linked/2020/08/09/apple-prepear", "via": "", "real_tags": ["apple", "苹果", "fighting"]}, {"category": "", "categoryclass": "", "imagename": "2f5e2a9402e5e347779e2f5cc4abe8bf.png", "infoid": 1017352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "贵公司有维基吗？如果让你猜一猜，你会说维基百科的百分比是多少：\n我会大胆猜测你的答案在25%以下。如果是这样的话，你是在说你公司超过75%的维基要么是无关紧要的，要么是没有使用过的，要么是完全不正确的。换句话说，你公司的维基的绝大多数充其量是没有用的，最坏的情况是，如果它给人们提供了不正确的信息，那么它就是积极有害的。\n这叫做维基腐烂。它正在世界各地的公司中蔓延，必须加以制止。\n如果你不得不重新开始呢？如果每年一次，您公司的维基中的所有内容都被删除，会怎么样？那就叫维基破产吧。以下是它可能出现的情况：\n告诉贵公司的每个人，2周后，所有维基内容都将被删除。让每个人都用这一周的时间来复制/备份/下载他们想要保留的任何页面。\n告诉每个人，他们现在可以继续创建维基页面，并且可以自由地重新创建他们认为重要的页面。\n对于所有意识到自己需要在第一步中没有想过要复制的内容的人，允许他们从第二步开始从你的备份中访问这些内容。但不要允许直接链接到该备份中的页面，否则你可能会冒着人们继续阅读备份的维基页面的风险。\n是的，这是一个巨大的痛苦，而且还会有几个星期，每个人都会对此发脾气。但是维基破产是我们杀死维基·罗特必须付出的代价。维基的破产确保了你的维基的绝大多数内容都是最新的和相关的，而且这是清除所有没人再关注过的问题的可靠方法。\n现在，让我们听听你讨厌它的所有理由。请在推特上告诉我这件事！", "note_en": "Does your company have a wiki? If you had to guess, what percentage of that wiki would you say is:\n  I’m going to take a wild guess that your answer is somewhere below 25%. If so, you’re saying that over 75% of your company’s wiki is either irrelevant, unused, or downright incorrect. In other words, the vast majority of your company’s wiki is at best not useful, and is at worst actively harmful if it’s giving people incorrect information.\n This is called Wiki Rot. It’s spreading in companies worldwide, and it must be stopped.\n What if you had to start over? What if, once a year, everything in your company’s wiki was deleted? Call it Wiki Bankruptcy. Here’s how it could go down:\n Tell everyone at your company that in 2 week, all wiki contents will be deleted. Let everyone take that week to copy/back up/download any pages they want to keep.\n  Tell everyone that they can now resume creating wiki pages, and are free to recreate the pages they thought were important.\n For all of the people who realize they need stuff that they didn’t think about copying in step 1, allow them to access it from your back up from step 2. But do not allow linking directly to pages in that back up, or else you run the risk of people just continuing to read the backed up wiki pages.\n Yes, it’s a huge pain, and there will be a couple weeks where everyone is grumpy about it. But Wiki Bankruptcy is the price we must pay to kill Wiki Rot. Wiki Bankruptcy ensures that the vast majority of your wiki will be up to date and relevant, and it’s a sure-fire way to clear out all the cruft nobody is ever looking at anymore.\n Now, let’s hear all the reasons why you hate it.  Tweet me about it!", "posttime": "2020-08-10 22:53:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维基百科,wiki", "title": "维基百科破产", "title_en": "Wiki Bankruptcy", "transed": 1, "url": "https://critter.blog/2020/08/10/wiki-bankruptcy/", "via": "", "real_tags": ["维基百科", "wiki"]}, {"category": "", "categoryclass": "", "imagename": "75e69b8a931580a7e52fda7f62dcb7dc.jpg", "infoid": 1017350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几十年里，越来越多的美国人接受了更健康的生活方式，其中包括更好的营养和定期锻炼。\n数据显示，人们的优先事项已经发生了一些变化，以反映出对自我护理和健康的更高重要性。\n2019年，据估计，超过20%的美国人属于健身房、健身房或健身俱乐部。事实上，据报道，自2008年以来，健身俱乐部会员人数增加了37%。\n与此同时，像Barry‘s BootCamp、Orange They Fitness和SoulCycle这样的品牌发现自己迎合了一群注重健康的布道者，他们让体育活动看起来既有趣又酷。\n健身房关门了，面对面的培训几乎是不可能的，寻找健身房设备需要愿意支付不小的钱。\n然而，在人们对健康和健康的关注似乎会被剥夺的时候，对这一领域的关注似乎比以往任何时候都要扩大。\n创新的媒体如雨后春笋般涌现，使人们能够更容易地保持活动，而不需要传统的手段和设备。\n教练已经上网，基于视频的锻炼成为新常态，高科技家庭健身房设备正在进入比以往任何时候都多的家庭。\n人们现在可以享受锻炼养生法，而不会像常规健身房那样带来不便，比如通勤或等待一件健身房设备变得可用。\n此前，50%的健身房常客在6个月后退出。当你通过应用程序或壁挂式设备获得实现目标的能力，而无需离开家时，对体育活动所涉及的认知就会改变，看起来负担会轻得多。\n此外，对于在家工作的人来说，这成为摆脱工作活动和外部义务的新出路，而不需要让自己暴露在拥挤的健身房带来的风险。\n不难想象，会有新的习惯被创造出来，驱使人们对健身目标保持更强的适应能力。\n从这个意义上说，目前的环境可能会给健康和健康行业带来一个拐点。这可能意味着更多的人变得更加活跃，并保持活跃。\n在有如此多的压力需要强调的时候，这可能是我们都可以庆祝的事情。", "note_en": "Over the last few decades, more and more Americans have embraced a healthier lifestyle that included better nutrition and regular exercise.\n  Data shows that people’s priorities have evolved a bit to reflect higher importance on self-care and wellness.\n  In 2019, it was  estimated that more than 20% of Americans belonged to a gym, fitness studio, or health club. In fact, since 2008, health club memberships have reportedly  increased by 37%.\n  Meanwhile, brands like Barry’s Bootcamp, Orange Theory Fitness, and SoulCycle found themselves catering to an audience of health-conscious evangelists that made physical activity look fun and cool.\n      Gyms closed, in-person training became nearly impossible to get, and finding gym equipment required a willingness to pay non-trivial amounts of money.\n   Yet, at a time when it would seem like people’s focus on health and wellness would be deprioritized, the attention to this space seems more amplified than ever.\n  Innovative mediums are sprouting up everywhere that enable people to more easily stay active, without the traditional means and equipment.\n    Trainers have gone online, video-based workouts are the new normal, and  high-tech home gym equipment is making its way into more homes than ever before.\n  People now have access to workout regimens without the inconvenience that exists with regular gyms, such as commuting or waiting for a piece of gym equipment to become available.\n  Previously, 50% of gym-goers  quit after 6 months. When you are empowered to achieve your goals through an app or wall-mounted unit and never have to leave your home, the perception of what physical activity involves shifts to look a lot less burdensome.\n  Furthermore, for people who are working from home, this becomes a new outlet from work activities and external obligations, without needing to exposure yourself to risks that come from being in a crowded gym.\n  It’s not difficult to envision new habits being created that drive people to remain more resilient with fitness goals.\n  To that extent, this current environment could produce an inflection point for the health and wellness industry. This could mean more people becoming more active and remaining active.\n  At a time when there is so much to be stressed about, this could be something we can all celebrate.", "posttime": "2020-08-10 22:53:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "健身,golden,健身房", "title": "这会是健身新黄金时代的开始吗？", "title_en": "Could This Be the Start of a New Golden Age of Fitness?", "transed": 1, "url": "https://www.forbes.com/sites/markhall/2020/08/10/golden-age-of-fitness/#44fc16b22dff", "via": "", "real_tags": ["健身", "golden", "健身房"]}, {"category": "", "categoryclass": "", "imagename": "3444f055360e2a334daa49fa894f5d86.jpg", "infoid": 1017349, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "物理学家长期以来一直试图了解周围世界的不可逆性，并将它的出现归功于时间对称的基本物理定律。根据量子力学，概念性时间反转的最终不可逆性需要极其复杂和不可信的场景，而这些场景不太可能在自然界中自发发生。物理学家之前已经证明，虽然在自然环境中时间可逆性是指数级的，但有可能设计一种算法，在IBM量子计算机中人为地将时间箭头反转到已知或给定的状态。然而，这个版本的反向时间之箭只包含了一种已知的量子态，因此与在视频上按下倒带来逆转时间流的量子版本相比。在一份新的报告中，物理学家A.V.列别捷夫和V.M.Vinokur以及美国和俄罗斯的材料、物理和先进工程学的同事们，在他们之前工作的基础上，开发了一种技术方法来逆转任意未知的时间演变。这份报告现已发表在《通信物理学》杂志(Communications Physical)上。(译者注：美国和俄罗斯的物理学家A.V.Lebedev和V.M.Vinokur以及他们在材料、物理和先进工程领域的同事们在之前工作的基础上，开发了一种技术方法来逆转任意未知的时间演变。这项技术工作将为通用通用算法及时倒退任意系统的时间演化开辟新的途径。这项工作只概述了时间反转的数学过程，没有实验实现。\n时间箭头起源于以相对于热力学第二定律的奇异路径表示时间方向，这意味着熵增长源于系统对环境的能量耗散。因此，科学家可以考虑与系统与环境的纠缠相关的能量耗散。以前的研究仅仅集中在时间之箭的量子观点和理解Landau-Neumann-Wigner假设的影响，以量化在IBM量子计算机上反转时间之箭的复杂性。在目前的工作中，科学家们建议使用有限温度下的热力学储存库来形成高熵随机浴来对给定的量子系统进行热化，并在实验上增加系统中的热无序或熵。然而，在实验上，IBM计算机不支持热化，这是目前提议的周期的第一步。\n理论上，热库的存在出人意料地使得在其他地方制备辅助(替代)量子系统的高温热态成为可能，该系统受相同的哈密顿量(与系统中所有粒子的动能和势能之和相对应的算符)支配。这使得列别捷夫和维诺库尔能够在数学上设计出一种反向时间演化的算符，来逆转给定量子系统中的时间动力学。\n该研究小组使用量子系统(混合态)的密度矩阵定义了未知量子态的普遍时间反转过程，以描述时间系统演化到其原始状态的反转。在实施时间反转箭头的同时，新系统的量子态可能仍然未知。与已知量子态的时间反转的先前协议相比，初始态也不必是纯粹不相关的状态，并且可以保持在混合态，并且与过去与环境的相互作用相关。研究小组注意到，系统中混合高熵状态的时间反转复杂性降低了。\nLebedev等人。利用S.Lloyd，Mohseni和Rebtrost之前详细描述的反转过程(LMR过程)来构建或绘制初始密度矩阵。LMR程序考虑了所讨论的系统和Ancilla的组合布置，以完成可逆计算。实验系统将配备一个热力学浴池，以使Ancilla热化，并为反向进化提供所需的状态。系统越热，就会变得越混乱。通过使用热源将辅助系统暴露在极高的温度下，Lebedev等人。矛盾的是，目的是用LMR公式通过实验观察初级系统的冷态和有序的过去。作者的理由是，通用时间反转算法可以反向运行计算，而不需要倒带到特定的量子态，只要该算法有助于将时间反转到其起始点。\n这项工作只概述了时间反转的数学分析，而没有具体说明实验实现。在进行时间反转的同时，所提出的系统继续保持其哈密顿量所支配的正向演化。未知量子态的时间反转的计算复杂度与系统的希尔伯特空间维数(抽象矢量空间)的平方成正比。为了在实践中实现这一点，实验系统将需要一个进化的自然系统。\nGonzalo Manzano等人。任意环境下的量子涨落定理：绝热和非绝热熵产生，物理评论X(2018)。DOI：10.1103/PhysRevX.8.031037", "note_en": "Physicists have long sought to understand the irreversibility of the surrounding world and have credited its emergence to the time-symmetric, fundamental laws of physics. According to  quantum mechanics, the final irreversibility of conceptual time reversal requires extremely intricate and implausible scenarios that are unlikely to spontaneously occur in nature. Physicists had previously shown that while time-reversibility is exponentially improbable in a natural environment—it is possible to design an algorithm to  artificially reverse a time arrow to a known or given state within an IBM quantum computer. However,  this version of the reversed arrow-of-time only embraced a known quantum state and is therefore compared to the quantum version of  pressing rewind on a video to &#34;reverse the flow of time.&#34;    In a new report now published in  Communications Physics, Physicists A.V. Lebedev and V.M. Vinokur and colleagues in materials, physics and advanced engineering in the U.S. and Russia,  built on their previous work to develop a technical method to reverse the temporal evolution of an arbitrary unknown  . The technical work will open new routes for general universal algorithms to send the temporal evolution of an arbitrary system backward in time. This work only outlined the mathematical process of time reversal without experimental implementations.\n    The arrow of time originates from expressing the direction of time in a singular route relative to the  second law of thermodynamics, which implies that  entropy growth stems from  energy dissipation of the system to the environment. Scientists can therefore consider energy dissipation relative to the system&#39;s entanglement with the environment. Previous research solely focused on the quantum viewpoint of the arrow of time and on understanding the effects of the  Landau-Neumann-Wigner hypothesis to quantify the complexity of reversing the arrow of time on an IBM quantum computer. In the present work, the scientists propose using a thermodynamic reservoir at finite temperatures to form a high-entropy stochastic bath to thermalize a given quantum system and experimentally increase thermal disorder or entropy in the system. However, experimentally, the IBM computers do not support thermalization, which forms the first step in the currently proposed cycle.\n    In theory, the presence of the thermal reservoir unexpectedly made it possible to prepare high-temperature thermal states of an auxiliary (alternative) quantum system elsewhere, governed by the same  Hamiltonian (an operator corresponding to the sum of kinetic energy and potential energies for all particles in the system). This allowed Lebedev and Vinokur to mathematically devise an operator of backward-time evolution to reverse the chronological dynamics in a given quantum system.\n    The team defined the universal time-reversal process of an unknown quantum state using the  density matrix of a quantum system (a mixed state); to describe reversal of the temporal system&#39;s evolution to return to its original state. The quantum state of the new system could remain unknown while implementing the arrow of time reversal. In contrast to the previous protocol of time reversal of a known quantum state, the initial state did not have to be of a purely uncorrelated state either and could remain in a mixed state and correlate to past interactions with the environment. The team noted reduced time-reversal complexity for a mixed high-entropy state in the system.\n  Lebedev et al. drew upon the  reversal procedure previously detailed by S. Lloyd, Mohseni and Rebentrost (LMR procedure) to construct or map the initial density matrix. The LMR procedure considered the combined arrangement of the system in question and  an ancilla to accomplish reversible computation. The experimental system will be equipped with a thermodynamic bath to thermalize the ancilla and provide the desired state for reverse evolution. The hotter the system, the more chaotic it would become. By using a heat reservoir to expose the auxiliary system to an extremely high temperature, Lebedev et al. paradoxically aim to experimentally observe the primary system&#39;s cold and ordered past using the LMR formula. The authors reason that a universal time reversal algorithm can run a computation in reverse, without a specific quantum state to rewind to, as long as the algorithm facilitates time reversal to its point of origin.\n    The work only outlined the mathematical analysis of time reversal without specifying experimental implementations. While exercising time reversal, the proposed system continued to maintain the forward evolution governed by its own Hamiltonian. The computational complexity of time reversal for an unknown quantum state was proportional to the square of the system&#39;s  Hilbert space dimension (an abstract vector space). To accomplish this in practice, the experimental system will require a natural system that evolves under an unknown Hamiltonian alongside thermalization, which quantum computers do not support, paired with universal quantum gates to achieve time reversal. As a result, practical implementation of this work will require an upgrade to existing quantum computers to meet the outlined requirements.\n    Lebedev et al. therefore aim to upgrade the existing design of quantum chips to achieve a set of interacting qubits (quantum bits) that can thermalize on-demand in a high-temperature environment. To accomplish this,  superconducting qubits can be coupled with a  transmission line where high-temperature thermal radiation will be fed to set the qubits to a high-temperature state. Thereafter, they will require a second set of qubits that can store a quantum state similar to the original set of qubits. When the original set of qubits are then experimentally thermalized to implement the joint LMR evolution, subsequent qubits will be able to undergo time-reversed dynamics under the same Hamiltonian to reach the original state. If accurately implemented, the proposed mechanism will also facilitate error-correction of an upgraded quantum computer to confirm its correct function. Lebedev et al. envision implementing the procedure on emergent computers with on-demand thermalized qubits.\n  In this way, Lebedev and Vinokur demonstrated the time reversal procedure of an unknown mixed quantum state. The process relies on performing the LMR protocol and the existence of an ancilla system, whose dynamics can be governed by the same Hamiltonian as the Hamiltonian of the reversed system. To accomplish the reversal procedure the LMR protocol will need to be applied sequentially to the joint state of the system and ancilla, prepared in a thermal state. The work developed a formula to highlight the number of cycles that should be repeated to reverse the state of a given system towards earlier states in the past. This number will depend on the system&#39;s complexity and how far back in time it is supposed to go. When implementing the time reversal protocol, the operation rate of the LMR procedure should be sufficiently high, to overrun the forward   evolution of the reversed system.        More information:\t\t\t\t\t\t\t\t\t\t\t\tA. V. Lebedev et al. Time-reversal of an unknown quantum state,  Communications Physics (2020).  DOI: 10.1038/s42005-020-00396-0\n    Gonzalo Manzano et al. Quantum Fluctuation Theorems for Arbitrary Environments: Adiabatic and Nonadiabatic Entropy Production,  Physical Review X (2018).  DOI: 10.1103/PhysRevX.8.031037", "posttime": "2020-08-10 22:52:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "量子态,reversal,时间", "title": "未知量子态的时间反转", "title_en": "Time-reversal of an unknown quantum state", "transed": 1, "url": "https://phys.org/news/2020-08-time-reversal-unknown-quantum-state.html", "via": "", "real_tags": ["量子态", "reversal", "时间"]}, {"category": "", "categoryclass": "", "imagename": "64e3be04b05001cecb5cda04ae127c8d.jpg", "infoid": 1017347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pen Test Partners在调查了一架最近被遗弃的飞机后向信息安全社区透露，Def Con波音747-400仍然使用软盘来加载关键的导航数据库。\n这一引人注目的事实出现在DEF Con对PTP&39；的亚历克斯·洛马斯的视频采访中，在采访中，这名男子亲自参观了一架747-400飞机、其航空电子设备舱和飞行甲板。\n尽管好奇的信息安全研究人员通常不会获得客机，但英国某家大型航空公司决定放弃其B744机队，给了Pen Test Partners一个独特的机会，在报废商家开始他们严峻的任务之前，登上一架飞机，四处走走。\n你知道，飞机本身就是非常昂贵的野兽，洛马斯一边在大型波音公司内部拍摄，一边说。即使你有世界上所有的意愿，航空公司和制造商也不会让你试飞一架飞机，因为[他们]不知道你会把它留在什么状态。\n洛马斯在视频(下面完整嵌入)中介绍了飞机的情况，并指出了导航数据库加载器。对于某个年份的读者来说，它看起来确实非常熟悉。\n洛玛斯指着软盘驱动器说，这个数据库必须每28天更新一次，这样你就可以知道工程师访问这个数据库需要多大的麻烦。软盘驱动器在正常操作时被藏在一个上了锁的面板后面。\n对埋在下层乘客甲板下面的航空电子设备舱进行了快速参观，发现了一系列服务器机房式的线路可更换部件和电缆，这促使洛马斯打破了许多好莱坞级的梦想，他说：你不能简单地把一对电线插到飞机后部，就能接触到所有这些东西。\n在随后针对DEF Con&39；虚拟与会者的问答环节(今年的黑客大会是在新冠肺炎的帮助下远程召开的)，Pen Test Partners首席执行官肯·门罗向洛马斯询问了航空信息安全研究人员感兴趣的问题。后者然后描述了各种航空专用的ARINC设备和连接标准，包括ARINC 664(...以太网，顶部有一些额外的服务质量层，以确保飞行关键设备可以相互通信)，如波音787和最新一代客机ARINC 629(实际上只用于[波音]777)，以及其他潜在的研究领域，包括VxWorks&39；实时操作系统(VxWorks&39；实时操作系统)。该标准还介绍了各种航空专用的ARINC设备和连接标准，包括顶部有一些额外的服务质量层的以太网，以确保关键飞行设备可以相互通信。最新一代的客机ARINC 629(实际上只用于[波音]777)，以及其他潜在的研究领域，包括VxWorks&39；实时操作系统\n从天空女王到废墟女王：英国航空公司砍掉了747架飞机，人们呆在家里。\n多读。\n然而，每个人都想知道答案的关键问题是，你是否可以利用飞行中的娱乐(IFE)作为攻击媒介，从廉价的座位黑进一架客机。洛马斯观察到：在我们特意寻找的地方，目前还没有发现乘客域系统(如IFE和控制域)之间的任何双向通信。信息服务领域的非军事区位于两者之间；在我看来，在两层隔离之间跳跃将是一件棘手的事情。\n这并没有阻止一些人的尝试，最著名的是一位来自苏格兰大学的信息安全研究人员，他在一次9小时的跨大西洋飞行开始时，使用了一种著名的喷雾技术来对抗IFE设备。幸运的是，他只成功地打开了自己的屏幕。\n有一个悠久而传奇的历史，原本过时的技术被保留下来，因为它们被建造成更大的东西，但工作正常，尤其是在皇家海军勘测船HMS Enterprise上。上一次出现在这些神圣的页面上是在几年前，当时美国海军邀请记者登上这艘军舰，当时北约在挪威举行了一次演习。企业号基于Windows ME的各种调查软件现在正在帮助贝鲁特的港口当局评估本月早些时候灾难性的硝酸铵爆炸造成的损失。®。\n研究人员可能感兴趣的是新的微软飞行模拟器(Microsoft Flight Simulator)，他们没有多余的747来进行一次试飞。经典SIM系列的最新版本将在一周多一点后发布，它将包括并支持使用ARINC 429兼容的导航数据集，这些数据集的类型与加载到波音747 3.5软盘上的完全相同。\n尽管模拟器软件读取和执行这些数据的逼真度可能无法与真实数据相提并论，但廉价访问真实数据集可以让人们深入了解进一步的研究领域--尽管波音787和华沙BIMPA 4U抵达的故事不太可能重演。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "DEF CON Boeing 747-400s still use floppy disks for loading critical navigation databases, Pen Test Partners has revealed to the infosec community after poking about one of the recently abandoned aircraft.\n  The eye-catching factoid emerged during a DEF CON video interview of PTP&#39;s Alex Lomas, where the man himself gave a walkthrough of a 747-400, its avionics bay and the flight deck.\n  Although airliners are not normally available to curious infosec researchers, a certain UK-based Big Airline&#39;s  decision to scrap its B744 fleet gave Pen Test Partners a unique opportunity to get aboard one and have a poke about before the scrap merchants set about their grim task.\n  &#34;Aircraft themselves are really expensive beasts, you know,&#34; said Lomas as he filmed inside the big Boeing. &#34;Even if you had all the will in the world, airlines and manufacturers won&#39;t just let you pentest an aircraft because [they] don&#39;t know what state you&#39;re going to leave it in.&#34;\n  While giving a tour of the aircraft on video (full embed below), Lomas pointed out the navigation database loader. To readers of a certain vintage it&#39;ll look very familiar indeed.\n    &#34;This database has to be updated every 28 days, so you can see how much of a chore this has to be for an engineer to visit,&#34; Lomas said, pointing out the floppy drive – which in normal operations is tucked away behind a locked panel.\n    A quick tour of the avionics bay, buried beneath the floor of the lower passenger deck, revealed a server-room-esque array of line replaceable units and cabling, prompting Lomas to bust lots of Hollywood-grade dreams by saying: &#34;You can&#39;t just clip into a pair of wires into the back of the aircraft and gain access to all of these.&#34;\n  In a subsequent Q&amp;A for DEF CON&#39;s virtual attendees (this year&#39;s hacking conference was done remotely thanks to COVID-19), Pen Test Partners chief Ken Munro asked Lomas about points of interest to aviation infosec researchers. The latter then described various aviation-specific ARINC equipment and connectivity standards, including ARINC 664 (&#34;...Ethernet with some extra quality-of-service layers on top to make sure flight-critical things can talk to each other&#34;)  as used in the Boeing 787 and the latest generation of airliners, ARINC 629 (&#34;really only used in the [Boeing] 777&#34;), and other potential areas of research interest including VxWorks&#39; real-time OS, which is used in a number of airliners&#39; internal networks.\n  From &#39;Queen of the Skies&#39; to Queen of the Scrapheap: British Airways chops 747 fleet as folk stay at home\n  READ MORE\n  The key question everyone wants to know the answer to, though, is whether you can hack an airliner from the cheap seats, using the in-flight entertainment (IFE) as an attack vector. Lomas observed: &#34;Where we&#39;ve gone deliberately looking, we&#39;ve not found, at this point, any two-way communication between passenger domain systems like the IFE and the control domain. There is the DMZ of the information services domain that sits between the two; to jump between two layers of segregation would be tricky in my view.&#34;\n  That hasn&#39;t stopped some people from trying, most notably an infosec researcher from a Scottish university who  deployed a well-known pentesting technique against IFE equipment at the start of a nine-hour transatlantic flight. Mercifully he only managed to KO his own screen.\n  There is a long and storied history of otherwise obsolete technologies being retained in use because they&#39;re built into something bigger and yet work well, not least aboard Royal Navy survey ship HMS  Enterprise. Last seen in these hallowed pages a couple of years ago when the Navy invited your correspondent aboard the warship during a NATO exercise in Norway,  Enterprise&#39;s  hotchpotch of Windows ME-based survey software is now helping port authorities in Beirut assess the damage caused by the disastrous ammonium nitrate explosion  earlier this month. ®\n    Of potential interest to researchers who don&#39;t have access to a spare 747 for a spot of pentesting is the new Microsoft Flight Simulator. Due for release in just over a week, the latest version of the classic sim franchise will include and support the use of ARINC 429-compatible navigation datasets, of the exact same type loaded into the 747 on a 3.5&#34; floppy.\n  While the fidelity of the simulator software reading and executing that data may not be comparable with the real thing, inexpensive access to a real dataset can offer insights into further research areas – though the tale of  the Boeing 787 and Warsaw&#39;s BIMPA 4U arrival is unlikely to be repeatable.\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-08-10 22:51:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,软盘,critical,飞行", "title": "波音747通过3.5英寸软盘接收关键软件更新", "title_en": "Boeing 747s receive critical software updates over 3.5“ floppy disks", "transed": 1, "url": "https://www.theregister.com/2020/08/10/boeing_747_floppy_drive_updates_walkthrough/", "via": "", "real_tags": ["软件", "软盘", "critical", "飞行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在20世纪70年代，美国科罗拉多州惠普的洛夫兰仪器事业部(LID)就是惠普许多计算创新的前沿。惠普在70年代早期是计算机化仪器仪表的领导者，从计算器到示波器，再到9825和9845系列这样的台式计算机。惠普为这些产品中的大多数都制造了自己的处理器。早期的计算机是基于我们之前提到的16位混合处理器。大约在同一时间，并且可以用来控制他们正在建造的各种硬件系统。它不需要像16位混合处理器那样的怪兽，而是一种更简单、便宜和非常快速的东西，它可以接口和控制HPIB卡、打印机等等。设计这样一个处理器的任务落在了拉里·鲍尔身上。\n结果是一种名为惠普纳米处理器的面向控制的处理器。在内部，它被赋予了标识符94332(或9-4332)，这不是最优雅的名字，但它是原始原型和模具上的东西。目标是使用惠普最初的7微米nMOS工艺(而不是新的5微米nMOS-II工艺)，以帮助节省成本，并迅速投入生产。\n最初的设计目标是5 MHz的时钟频率和在2个周期(400 Ns)内执行的指令。虽然早期的数据表已经删除了这一点，并用4 MHz和500 ns取而代之，但5 MHz的产量肯定不够高，4 MHz就足够了。\n纳米处理器很有趣，因为它特别不是一个面向算术的处理器，事实上，它甚至不支持算术。它有42条8位指令，以控制逻辑为中心。这些指令由16个8位寄存器、一个8位累加器和一个11位程序计数器支持。与外部世界的接口是通过11位地址总线、8位数据总线和7位起I/O总线作用的直接控制总线。纳米处理器既支持外部矢量中断，也支持外部矢量中断。以及比较、递增/递减(二进制和BCD)和补码。\nNanoProcessor需要一个简单的TTL时钟和3个电源，一个+12和+5VDC用于逻辑，一个-2VDC到-5VDC背栅偏置电压。这个偏置电压取决于制造变量，所以芯片到芯片的偏置电压并不总是相同的(目标是-5VDC)。每个芯片都经过测试，电压手写在芯片上。然后通过PCB上的一个电阻器设置电压。换掉一个NanoProcessor意味着你需要确保这个偏置电压是。\n如果您需要对ALU的支持，您可以在外部添加一个(可能使用一对‘181系列TTL)。即使使用外部ALU，纳米处理器的速度也非常快。1974年，纳米处理器的预计成本为15美元(或ALU为22美元)，但在1975年末，4 MHz版本(1820-1692)的成本为18美元，较慢的2.66 MHz版本(1820-1691)的成本为13美元。\n在1974年至1975年开发摩托罗拉6800的时候，摩托罗拉6800刚刚发布。6800也是一个8位处理器，采用NMOS工艺制造，最大时钟频率为1 MHz。6800的初始成本为360美元，降至175美元，然后随着6502从MOS发布，价格为69美元。到1976年，6800的价格只有36美元，但这仍然是纳米处理器成本的两倍。\n1974年12月的早期“幻灯片”(纸质版)介绍了纳米处理器的“为什么”和“如何”。“它的开发总成本预计只有25万美元(按2020年美元计算约为100万美元)。”这篇论文将纳米处理器的性能与6800进行了比较。这些比较相当令人惊叹。\n对于控制处理中断响应时间非常重要，NanoProcessor最多可以处理715 ns的中断，与6800的12usec相比。虽然NanoProcessor的时钟频率快4倍，但它的中断和指令的效率才是真正提供不同之处的地方。\n即使使用外部算术逻辑单元，与摩托罗拉的内部算术逻辑单元相比，纳米处理器的速度也要快一倍(这要归功于它的高得多的时钟频率)。\n与6800的1-10U相比，NanoProcessor上的所有指令都需要500 ns的执行时间。\n今天，我们根据游戏中的帧率或渲染时间进行基准测试，但你可以看到，基准测试在当时甚至很重要。处理器处理事情的速度决定了打印机的速度，或者它可以处理外部数据传入的速度。难怪纳米处理器在20世纪80年代末仍在制造，其中许多至今仍在使用，运行着各种惠普设备。\n非常感谢Larry Bower，他是NanoProcessor的项目负责人和设计师，他捐赠了几个原型、一套完整的掩膜和有关NanoProcessor的早期文档(以及其他一些好东西)。\n文档太早了，有很多手写部分，还有一些更正。如果不及早发现，这肯定是一件非常恼人的事情。甚至连工程师有时也会把左右手弄混", "note_en": "Back in the 1970’s the Loveland Instrument Division (LID) of HP in Colorado, USA was the forefront of much of HP’s computing innovation.  HP was a leader, and often THE leader in computerized instrumentation in the early 1970’s.  From things like calculators, to O-scopes to desktop computers like the 9825 and 9845 series.  HP made their own processors for most all of these products.  The early computers were based on the  16-bit Hybrid processor we talked about before.  At around the same time, in 1974, the HP LID realized they needed another processor, a control oriented processor that was programmable, and could be used to control the various hardware systems they were building.  This didn’t need to be a beast like the 16-bit Hybrids, but something simpler, inexpensive, and very fast, it would interface and control things like HPIB cards, printers, and the like.  The task of designing such a processor fell to Larry Bower.\n The result was a Control Oriented Processor called the HP nanoprocessor.  Internally it was given the identifier 94332 (or 9-4332), not the most elegant name, but its what was on the original prototypes and die.   The goal was to use HP’s original 7-micron NMOS process (rather then the new 5-micron NMOS-II process) to help save costs and get it into production quickly.\n   The original design goal was a 5MHz clock rate and instructions that would execute in 2 cycles (400ns).  The early datasheets have this crossed out and replaced with 4MHz and 500ns, yields at 5MHz must not have been high enough, and 4MHz was plenty.\n   The Nanoprocessor is interesting as it is specifically NOT an arithmetic oriented processor, in fact, it doesn’t even support arithmetic.  It has 42 8-bit instructions, centered around control logic.  These are supported by 16 8-bit registers, an 8-bit Accumulator and an 11-bit Program Counter.  Interface to the external world is via an 11-bit address bus, 8-bit Data bus and a 7-bit ‘Direct Control’ bus which functions as an I/O bus.  The nanoprocessor supports both external vectored interrupts and subroutines.  The instructions support the ability to test, set and clear each bit in the accumulator, as well as comparisons, increments/decrements (both binary and BCD), and complements.\n   The Nanoprocessor required a simple TTL clock, and 3 power supplies, a +12 and +5VDC for the logic and a -2VDC to -5VDC back gate bias voltage.  This bias voltage was dependent on manufacturing variables so was not always the same chip to chip (the goal would be -5VDC).  Each chip was tested the and voltage was hand written on the chip.  The voltage was then set by a single resistor on the PCB.  Swapping out a Nanoprocessor meant you needed to make sure this bias voltage was set correctly.\n If you needed support for an ALU you could add one externally (likely with a pair of ‘181 series TTL).  Even with an external ALU the Nanoprocessor was very fast.   The projected cost of a Nanoprocessor in 1974 was $15 (or $22 with an ALU),  In late 1975 this was $18 for the 4MHz version  (1820-1692) and $13 for the slower 2.66MHz version (1820-1691).\n At the time of its development in 1974-1975 the Motorola 6800 had just been announced. The 6800 was an 8-bit processor as well, made on a NMOS process, and had a maximum clock rate of 1MHz.  The initial cost of the 6800 was $360, dropping to $175, then $69 with the release of the 6502 from MOS.  By 1976 the 6800 was only $36, but this is still double what a Nanoprocessor cost\n  An early ‘slide deck’ (the paper version equivalent) from December 1974 sets out the What Why and How of the Nanoprocessor.  The total cost of its development was projected to be only $250,000 (around $1 million in 2020 USD).  The paper compares the performance of the Nanoprocessor to that of the 6800.  The comparisons are pretty amazing.\n  For control processing interrupt response time is very important, the Nanoprocessor can handle interrupts in a max of 715ns, compare that to 12usec for the 6800.   The clock rate of the Nanoprocessor is 4 times faster but the efficiency of its interrupts and instructions are what really provides the difference here.\n  Even using an external ALU compared to the Motorola’s internal ALU, the nanoprocessor is better then twice as fast (thanks here to its much higher clock frequency)\n  All instructions on the Nanoprocessor take 500ns to execute compared to the 1-10u for the 6800.\n Today we do benchmarks based on framerates in games, or render times, but you can see that benchmarks were even important back then.  How fast a processor could handle things determined how fast the printer could be, or how fast it could handle external data coming in.  It’s no wonder that the Nanoprocessor continued to be made into the late 1980’s and many of them are still in use today running various HP equipment.\n  A big thank you to Larry Bower, the project lead and designer of the Nanoprocessor, who donated several prototypes, a complete mask set, and very early documentation on the Nanoprocessor (amongst some other goodies)\n  Documentation so ealy it has many hand written parts, and some corrections.  This had to be a very annoying oops if it wasn’t caught early on.  Even Engineers get their left and right mixed up on occasion", "posttime": "2020-08-10 22:51:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "遗忘,hp,处理器", "title": "被遗忘的：惠普纳米处理器", "title_en": "The Forgotten Ones: HP Nanoprocessor", "transed": 1, "url": "http://www.cpushack.com/2020/08/09/the-forgotten-ones-hp-nanoprocessor/", "via": "", "real_tags": ["遗忘", "hp", "处理器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前几天我试着画伯特和厄尼，真的很难。我旁边就有他们的照片，但我的画简直令人难以置信地粗糙，更多的是“语言”而不是“视觉”，因为我描绘的是伯特和厄尼的关键方面，但照片看起来一点也不像他们。我知道画画很难-偶尔，我会坐一个小时画一个场景，要让它看起来像我看到的东西总是要做很多工作-但我没有意识到画卡通人物会这么难！\n这让我想起了统计课上的学生。当我让他们画一张数据散点图，或者画一些函数时，他们永远画不出一幅逼真的图画。它们的密度函数在尾部不是零，散点图中的散布与它们的标准差不匹配，E(y|x)不等于它们的回归线，等等。例如，当被要求绘制收入与收入之间的潜在散点图时，他们在x轴(大多数人的身高在60到75英寸之间)和让数据与回归线一致，而所有收入都不是负数方面存在困难。(是的，最好是按对数比例或其他方式建模，但这不是本练习的重点。)。\n不管怎么说，学生们就是不能把这些图表做好，这一直让我很沮丧。但我的伯特和厄尼的经历表明，我的想法是错误的。也许他们需要大量的练习才能画出逼真的函数和散点图。", "note_en": "I was trying to draw Bert and Ernie the other day, and it was really difficult. I had pictures of them right next to me, but my drawings were just incredibly crude, more “linguistic” than “visual” in the sense that I was portraying key aspect of Bert and Ernie but in pictures that didn’t look anything like them. I knew that drawing was difficult–every once in awhile, I sit for an hour to draw a scene, and it’s always a lot of work to get it to look anything like what I’m seeing–but I didn’t realize it would be so hard to draw  cartoon characters!\n This got me to thinking about the students in my statistics classes. When I ask them to sketch a scatterplot of data, or to plot some function, they can never draw a realistic-looking picture. Their density functions don’t go to zero in the tails, the scatter in their scatterplots does not match their standard deviations, E(y|x) does not equal their regression line, and so forth. For example, when asked to draw a potential scatterplot of earnings vs. income, they have difficulty with the x-axis (most people are between 60 and 75 inches in height) and having the data consistent with the regression line, while having all earnings be nonnegative. (Yes, it’s better to model on the log scale or whatever, but that’s not the point of this this exercise.)\n Anyway, the students just can’t make these graphs look right, which has always frustrated me. But my Bert and Ernie experience suggests that I’m thinking of it the wrong way. Maybe they need lots and lots of practice before they can draw realistic functions and scatterplots.", "posttime": "2020-08-10 22:50:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "逼真,realistic,函数", "title": "绘制逼真的图形", "title_en": "Sketching Realistic Graphs", "transed": 1, "url": "https://statmodeling.stat.columbia.edu/2005/12/26/making_realisti/", "via": "", "real_tags": ["逼真", "realistic", "函数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我计划创建一系列的博客文章，其中包括一些文献研究、各种数据结构的实现，以及我们在direcent.io中创建分布式数据存储的旅程。\n在我开始写这篇文章的6天后，事实证明，假阳性概率背后的数学是错误的，长达50年之久。您可以在这里阅读详细的解释。\n您可能会感到奇怪，为什么我一开始就写了一篇博客文章来解释Bloom filter，而我对如何创建分布式数据存储却毫无头绪？我的回答很简单：“我喜欢它背后的想法”。\n在我详细介绍Bloom Filters之前，我想先介绍一下我们的背景故事，它将帮助您理解为什么我们开始构建一些我们在空闲时间会喜欢的东西，而这些东西永远不会投入生产。\n我和我的朋友易卜拉欣(Ibrahim)总是对复杂的软件和分布式系统着迷-我们已经在一起工作了5年多(我们有个老伙计)，我们很幸运地为欧洲最大的电子商务公司工作。我们奋力拼搏，解决了分布式系统可以提供的许多不同问题。我们都搬到了英国剑桥，仍然在与分散的世界恶棍作战。\n让我们通过实现Bloom过滤器来探索概率数据结构的神秘之地。\nBloom filter是一种表示n个元素(也称为键)的集合$A={a_1，a_2，\\ldots，a_n}$以支持成员查询的方法。它是由Burton Bloom于1970年发明的，Marais和Bharat建议在Web上下文中使用它作为一种机制，用于识别哪些页面具有存储在CommonKnowledge服务器中的相关注释。1个。\n它是一种节省空间的概率数据结构，用于回答一个非常简单的问题：该元素是集合的成员吗？Bloom过滤器不存储实际元素，它只存储这些元素的成员身份。\n假阳性匹配是可能的，但假阴性是不可能的-换句话说，查询返回“可能在集合中”或“绝对不在集合中”。2不幸的是，这也意味着不能从Bloom filter中删除项(其他一些元素或元素组可能会散列到相同的索引)。\n由于其概率性质，布隆过滤器以牺牲空间和性能来换取准确性。这很像CAP定理，我们选择性能而不是准确性。\nBloom过滤器有一些有趣的用例。例如，可以将它们放在数据存储区的顶部。当查询某个键是否存在，而筛选器没有该键时，我们可以完全跳过查询数据存储。\n布隆过滤器背后的思想非常简单：分配一个$m$位的数组$v$，数组中的每个位最初设置为$0$，然后选择$k$独立的散列函数$h_1，h_2，…。，h_k$，每个范围为${1，…。，m}$。\n当将A$中的元素$a\\添加到过滤器时，位置$h_1(A)、h_2(A)、…。，$v$中的h_k(A)$被设置为$1$。简而言之，新元素由$k$个函数散列，并由$m$进行修改，导致$k$索引进入位数组。设置相应索引处的每个位。\n为了查询元素$b$的成员资格，我们检查索引$h_1(B)、h_2(B)、…处的位。，h_k(B)$，单位为$v$。如果它们中的任何一个是$0$，那么$b$肯定不在集合$A$中。否则，我们假设$b$在集合中，尽管也可能有其他元素或元素组散列到相同的索引。这称为假阳性。我们可以通过为最多$n$插入选择最佳值$m$和$k$来确定特定的误报概率。\n布隆过滤器最终到达所有位都已设置的点，这意味着每个查询都将指示成员身份，从而有效地使误报的概率为$1$。这样做的问题是，它需要数据集的先验知识，以便选择最佳参数并避免“过度填充”。3个。\n我们可以根据$n$和选定的误报概率$P_{fp}$推导出最优的$k$和$m$。\n\\[K=-\\frac{\\ln{P_{fp}{\\ln{2}}，m=-\\frac{n\\ln{P_{fp}{(\\ln2)^2}\\]如果您想了解上述公式是如何推导出来的，您可以访问此处。\n终于来了！现在是写些生锈的时候了。在写这篇博客的同时，我同时实现了Bloom过滤器。如果您不相信我，请检查以下命令：\n让我们继续讨论依赖项。只有一个依赖项，我们将使用它来创建$v$。\n我们将声明一个新的struct StandardBloomFilter来封装必需的字段$k$(散列函数的最佳数量)、$m$(位数组的最佳大小)、$v$(位数组)、散列函数和一个标记，以告诉RUST编译器我们的结构“拥有”一个T。\nPub struct StandardBloomFilter&lt；T：？大小已调整&gt；{位图：BitVec，Optimal_m：u64，Optimal_k：u32，散列器：[DefaultHasher；2]，_marker：PhantomData&lt；T&gt；，}。\n细心的读者会认为我在声明hashers数组时犯了错误，因为需要$k$独立的散列函数。这确实是故意的，原因如下：\n为什么要使用两个散列函数？Kirsch和Mitzenmacher在他们的论文中证明了使用两个散列函数$h_1(X)$和$h_2(X)$来模拟形式为$g_i(X)=h_1(X)+{i}{h_2(X)}$的附加散列函数可以有效地应用于Bloom Filter。这导致了较少的计算，并且在实践中潜在地减少了对随机性的需要。4该公式可能看起来类似于成对独立散列函数的使用。不幸的是，这两种技术之间没有正式的联系。\n我在前面提到过，Bloom过滤器有两个类似于标准集的操作：插入和查询。我们将使用类似构造函数的新方法实现这两个操作。\n实施T：？Size&gt；StandardBloomFilter&lt；T&gt；{pub FN new(Items_Count：usize，FP_Rate：f64)-&gt；self{//...snip}}。\nNew计算位图的大小($v$)和Optimal_k($k$)，然后实例化StandardBloomFilter。\n实施T：？SIZED&gT；StandardBloomFilter&lt；T&gt；{pub FN new(Items_Count：usize，fp_rate：f64)-&gt；self{Let Optimal_m=self：：bitmap_size(Items_count，fp_rate)；let Optimal_k=Self：：Optimal_k(Fp_Rate)；let hashers=[DefaultHasher：：New()，DefaultHasher：：New()]；StandardBloomFilter{bitmap：BitVec：：from_elem(Optimal_m as usize，false)，Optimal_m，Optimal_k，hashers，_mark：PhantomData，}}//...截取FN位图_SIZE(Items_Count：usize，FP_Rate：f64)-&gt；usize{let LN2_2=core：：f64：：consts：：ln_2*core：：f64：consts：：((-1.0f64*Items_Count as f64*fp_rate.ln())/ln2).ceil()as usize}fn Optimal_k(fp_rate：f64)-&gt；u32{((-1.0f64*fp_rate.ln())/core：：f64：：consts：：ln_2).ceil()as u32}//...snip}。\n这看起来真的很有希望！以$0.01$的误报率表示一组$1,000,000个项目的布隆过滤器只需要$9585059$位($~1.14mathm{MB}$)和7个散列函数。\n到目前为止，我们已经成功地构建了Bloom filter，现在是实现插入和包含方法的时候了。它们的实现非常简单，并且它们共享相同的代码来计算位数组的索引。\n实施T：？SIZED&gT；StandardBloomFilter&lt；T&gt；{//...snip pub FN INSERT(&amp；mut self，Item：&amp；T)，其中T：hash，{let(h1，h2)=sel.hash_kernel(Item)；对于0中的k_i。Sel.Optimal_k{let index=sel.get_index(h1，h2，ki as U64)；self.bitmap.SET(index，true)；}}pub fn包含(&amp；mut self，item：&amp；T)-&gt；bool，其中T：hash，{let(h1，h2)=sel.hash_kernel(Item)；对于0中的k_i。Sel.Optimal_k{let index=sel.get_index(h1，h2，k_i为U64)；if self.bitmap.get(Index).unwire()==false{return false；}}true}}。\n上面的方法依赖于我们还没有实现的另外两个方法：hash_kernel和get_index。Hash_kernel将是实际的“散列”发生的地方。它将返回$h_1(X)$和$h_2(X)$的散列值。\n实施T：？SIZED&gT；StandardBloomFilter&lt；T&gt；{//...snip FN hash_kernel(&amp；self，Item：&amp；T)-&gt；(U64，U64)其中T：hash，{let hasher1=&amp；mut self.hashers[0].clone()；let hasher2=&amp；mut self.hashers[1].clone()；item.hash(hasher.hasher1=&amp；mut self.hashers[0].clone()；let hasher2=&amp；mut self.hashers[1].clone()；item.hash。让hash2=hasher2.Finish()；(hash1，hash2)}}\n我们本可以使用$128$bit MurmurHash3，并返回较高的$64$bit作为hash1，返回较低的$64$bit作为hash2，但是为了使此实现更加简单(这就是Google Guava Bloom Filter实现目前的工作方式)，并且不依赖于任何其他依赖项，我决定继续使用DefaultHasher-参见SipHash。\n现在，是时候做最后的润色了。我们将通过使用$g_i(X)=h_1(X)+{i}{h_2(X)}$来模拟两个以上的散列函数来实现get_index。\n实施T：？Size&gt；StandardBloomFilter&lt；T&gt；{//...snip FN get_index(&amp；self，h1：u64，h2：u64，ki_i：u64)-&gt；usize{(h1.wrapping_add(Ki_I).wrapping_mul(H2)%self.Optimal_m)as usize}//...snip(&amp；self，h1：u64，h2：u64，ki_i：u64)-&gt；usize。\n我们刚刚实现了标准Bloom filter的一个快速变体，但是还缺少一件事--我们没有编写任何测试。\n#[cfg(Test)]mod test{use Super：：*；#[test]fn insert(){let mut bloom=StandardBloomFilter：：New(100，0.01)；bloom.insert(&#34；Item&#34；)；assert！(Bloom.Concludes(&#34；Item&#34；))；}#[test]fn check_and_insert(){let mut bloom=StandardBloomFilter：：New(100，0.01。断言！(！BLOOM.CONTAINS(&#34；Item_1&#34；))；Assert！(！BLOOM.CONTAINS(&#34；Item_2&#34；))；BLOOM.INSERT(&#34；Item_1&#34；)；Assert！(BLOOM.CONTAINS(&#34；Item_1&#34；))；}}。\n用户货物测试编译PLUM v0.1.2(/Users/onat.mercan/dev/plum)在0.99秒内完成测试[未优化+调试信息]目标运行target/debug/deps/plum-6fc161db530d5b36running 2测试：：❯...。OK测试测试：：CHECK_AND_INSERT...。OK测试结果：OK。2通过；0失败；0忽略；0测量；0过滤掉。\n我希望你喜欢读这篇文章，就像我喜欢写它一样！\n如果您发现代码有任何错误，您可以提交问题，或者更好的做法是提交拉取请求。", "note_en": "I am planning to create a series of blog posts that includes some literature research, implementation of various data structures and our journey of creating a distributed datastore in  distrentic.io.\n 6 days after I started to write this post, it is proved that the math behind false positive probability was wrong for 50 years  . You can read the detailed explanation  here.\n You might be wondering why I start with a blog post explaining the Bloom Filter while I don’t have single clue about how to create a distributed datastore? My answer is simple: “I like the idea behind it”.\n  Before I get into the details of the Bloom filters, I want to give our backstory that will help you understand  why we started building something we’d enjoy during our spare time that will never be production ready.\n  My friend Ibrahim and I are always fascinated by complex software and distibuted systems - We’ve been working together more than 5 years (we got old dude) and we were lucky enough to work for the largest e-commerce company in Europe. We battled our way solving many different problems that distributed systems can offer. We both moved to Cambridge, UK and still fighting against distributed world villains.\n  Let’s explore the mystic land of probabilistic data structures by implementing a Bloom Filter.\n  A Bloom filter is a method for representing a set $A = {a_1, a_2,\\ldots, a_n}$ of n elements (also called keys) to support membership queries. It was invented by  Burton Bloom in 1970 and was proposed for use in the web context by Marais and Bharat as a mechanism for identifying which pages have associated comments stored within a  CommonKnowledge server.   1\n It is a space-efficient probabilistic data structure that is used to answer a very simple question:  is this element a member of a set?. A Bloom filter does not store the actual elements, it only stores the  membership of them.\n False positive matches are possible, but false negatives are not – in other words, a query returns either “possibly in set” or “definitely not in set”.   2 Unfortunately, this also means  items cannot be removed from the Bloom Filter (Some other element or group of elements may be hashed to the same indices).\n Because of its nature of being probabilistic, the Bloom Filter trades space and performance for accuracy. This is much like the CAP theorem, we choose performance over accuracy.\n Bloom filters have some interesting use cases. For example, they can be placed on top of a datastore. When a key is queried for its existence and the filter does not have it, we can skip querying the datastore entirely.\n   The idea behind Bloom filter is very simple: Allocate an array $v$ of $m$ bits, each bit in the array is initially set to $0$, and then choose $k$ independent hash functions $h_1, h_2, …, h_k$, each with range ${1,…,m}$.\n   When an element $a \\in A$ is added to the filter, the bits at positions $h_1(a), h_2(a), …, h_k(a)$ in $v$ are set to $1$. In simpler words, the new element is hashed by $k$ number of functions and modded by $m$, resulting in $k$ indices into the bit array. Each bit at the respective index is set.\n   To query the membership of an element $b$, we check the bits at indices $h_1(b), h_2(b), …, h_k(b)$ in $v$. If any of them is $0$, then certainly $b$ is not in the set $A$. Otherwise, we assume that $b$ is in the set although it’s possible that some other element or group of elements hashed to the same indices. This is called a  false positive. We can target a specific probability of false positives by selecting an optimal value of $m$ and $k$ for up to $n$ insertions.\n  A Bloom filter eventually reaches a point where all bits are set, which means every query will indicate membership, effectively making the probability of false positives $1$. The problem with this is it requires a priori knowledge of the data set in order to select optimal parameters and avoid “overfilling”.   3\n  We can derive optimal $k$ and $m$ based on $n$ and a chosen probability of false positives $P_{FP}$.\n\\[k = -\\frac{\\ln{P_{FP}}}{\\ln{2}},m = -\\frac{n\\ln{P_{FP}}}{(\\ln2)^2}\\] If you want to learn about how the above formulae are derived, you might want to pay a visit  here.\n   Finally! It is time to write some  rust  . I am simultaneously implementing the bloom filter whilst writing this blog post. If you don’t believe me then check the below command:\n  Let’s continue with the dependencies. There is only one dependency and we will use it to create $v$.\n  We will declare a new  struct  StandardBloomFilter to encapsulate required fields $k$ (optimal number of hash functions), $m$ (optimal size of the bit array), $v$ (the bit array), hash functions and a marker to tell rust compiler that our  struct “owns” a  T.\n  pub  struct  StandardBloomFilter &lt; T :  ? Sized &gt;  {  bitmap :  BitVec ,  optimal_m :  u64 ,  optimal_k :  u32 ,  hashers :  [ DefaultHasher ;  2 ],  _ marker :  PhantomData &lt; T &gt; , }\n Careful readers will think that I made a mistake in the declaration of  hashers array because of the requirement of $k$ independent hash functions. It was indeed intentional here’s why:\n Why two hash functions? Kirsch and Mitzenmacher demonstrated in their paper that using two hash functions $h_1(x)$ and $h_2(x)$ to simulate additional hash functions of the form $g_i(x) = h_1(x) + {i}{h_2(x)}$ can be usefully applied to Bloom filters. This leads to less computation and potentially less need for randomness in practice.   4 This formula may appear similar to the use of pairwise indenpendent hash functions. Unfortunately, there is no formal connection between the two techniques.\n I mentioned earlier that the Bloom Filter has two operations like a standard set: insert and query. We will implement those two operations along with constructor-like  new method.\n impl &lt; T :  ? Sized &gt;  StandardBloomFilter &lt; T &gt;  {  pub  fn  new ( items_count :  usize ,  fp_rate :  f64 )  -&gt;  Self  {  // ...snip  } }\n new calculates the size of the  bitmap ($v$) and  optimal_k ($k$) and then instantiates a  StandardBloomFilter.\n impl &lt; T :  ? Sized &gt;  StandardBloomFilter &lt; T &gt;  {  pub  fn  new ( items_count :  usize ,  fp_rate :  f64 )  -&gt;  Self  {  let  optimal_m  =  Self :: bitmap_size ( items_count ,  fp_rate );  let  optimal_k  =  Self :: optimal_k ( fp_rate );  let  hashers  =  [ DefaultHasher :: new (),  DefaultHasher :: new ()];  StandardBloomFilter  {  bitmap :  BitVec :: from_elem ( optimal_m  as  usize ,  false ),  optimal_m ,  optimal_k ,  hashers ,  _ marker :  PhantomData ,  }  }  // ...snip  fn  bitmap_size ( items_count :  usize ,  fp_rate :  f64 )  -&gt;  usize  {  let  ln2_2  =  core :: f64 :: consts :: LN_2  *  core :: f64 :: consts :: LN_2 ;  (( - 1.0f64  *  items_count  as  f64  *  fp_rate .ln ())  /  ln2_2 ) .ceil ()  as  usize  }  fn  optimal_k ( fp_rate :  f64 )  -&gt;  u32  {  (( - 1.0f64  *  fp_rate .ln ())  /  core :: f64 :: consts :: LN_2 ) .ceil ()  as  u32  }  // ...snip }\n   This looks really promising! A Bloom Filter that represents a set of $1$ million items with a false-positive rate of $0.01$ requires only $9585059$ bits ($~1.14\\mathrm{MB}$) and 7 hash functions.\n We managed to construct a Bloom Filter so far and it is time to implement  insert and  contains methods. Their implementations are dead simple and they share the same code to calculate indexes of the bit array.\n  impl &lt; T :  ? Sized &gt;  StandardBloomFilter &lt; T &gt;  {  // ...snip  pub  fn  insert ( &amp; mut  self ,  item :  &amp; T )  where  T :  Hash ,  {  let  ( h1 ,  h2 )  =  self .hash_kernel ( item );  for  k_i  in  0 .. self .optimal_k  {  let  index  =  self .get_index ( h1 ,  h2 ,  k_i  as  u64 );  self .bitmap .set ( index ,  true );  }  }  pub  fn  contains ( &amp; mut  self ,  item :  &amp; T )  -&gt;  bool  where  T :  Hash ,  {  let  ( h1 ,  h2 )  =  self .hash_kernel ( item );  for  k_i  in  0 .. self .optimal_k  {  let  index  =  self .get_index ( h1 ,  h2 ,  k_i  as  u64 );  if  self .bitmap .get ( index ) .unwrap ()  ==  false  {  return  false ;  }  }  true  } }\n The above methods depend on two other methods that we haven’t implemented yet:  hash_kernel and  get_index.  hash_kernel is going to be the one where the actual “hashing” happens. It will return the hash values of $h_1(x)$ and $h_2(x)$.\n impl &lt; T :  ? Sized &gt;  StandardBloomFilter &lt; T &gt;  {  // ...snip  fn  hash_kernel ( &amp; self ,  item :  &amp; T )  -&gt;  ( u64 ,  u64 )  where  T :  Hash ,  {  let  hasher1  =  &amp; mut  self .hashers [ 0 ] .clone ();  let  hasher2  =  &amp; mut  self .hashers [ 1 ] .clone ();  item .hash ( hasher1 );  item .hash ( hasher2 );  let  hash1  =  hasher1 .finish ();  let  hash2  =  hasher2 .finish ();  ( hash1 ,  hash2 )  } }\n We could’ve used $128$ bit  MurmurHash3 and returned upper $64$ bit as  hash1 and the lower as  hash2 but to keep this implementation even simpler (this is how  Google Guava Bloom Filter implementation currently works) and not to rely on any other additional dependencies I decided to continue with  DefaultHasher - see  SipHash\n Now, it is time to make the final touch. We are going to implement  get_index by using $g_i(x) = h_1(x) + {i}{h_2(x)}$ to simulate more than two hash functions.\n impl &lt; T :  ? Sized &gt;  StandardBloomFilter &lt; T &gt;  {  // ...snip  fn  get_index ( &amp; self ,  h1 :  u64 ,  h2 :  u64 ,  k_i :  u64 )  -&gt;  usize  {  ( h1 .wrapping_add ( k_i ) .wrapping_mul ( h2 )  %  self .optimal_m )  as  usize  }  // ...snip\n  We’ve just finished implementing  a fast variant of a standard Bloom Filter but there is still one thing missing - We didn’t write any tests.\n  #[cfg(test)] mod  tests  {  use  super :: * ;  #[test]  fn  insert ()  {  let  mut  bloom  =  StandardBloomFilter :: new ( 100 ,  0.01 );  bloom .insert ( &#34;item&#34; );  assert ! ( bloom .contains ( &#34;item&#34; ));  }  #[test]  fn  check_and_insert ()  {  let  mut  bloom  =  StandardBloomFilter :: new ( 100 ,  0.01 );  assert ! ( ! bloom .contains ( &#34;item_1&#34; ));  assert ! ( ! bloom .contains ( &#34;item_2&#34; ));  bloom .insert ( &#34;item_1&#34; );  assert ! ( bloom .contains ( &#34;item_1&#34; ));  } }\n ❯ cargo  test Compiling plum v0.1.2  (/Users/onat.mercan/dev/distrentic/plum ) Finished  test  [unoptimized + debuginfo] target (s )  in 0.99s Running target/debug/deps/plum-6fc161db530d5b36running 2 tests test tests::insert ... ok test tests::check_and_insert ... ok test result: ok. 2 passed ; 0 failed ; 0 ignored ; 0 measured ; 0 filtered out\n I hope you’ve enjoyed reading this post as much as I enjoyed writing it!\n If you find anything wrong with  the code, you can  file an issue or, even better,  submit a pull request.", "posttime": "2020-08-10 22:49:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "bloom", "title": "让我们实现一个Bloom过滤器", "title_en": "Let’s implement a Bloom Filter", "transed": 1, "url": "https://onatm.dev/2020/08/10/let-s-implement-a-bloom-filter/", "via": "", "real_tags": ["bloom"]}, {"category": "", "categoryclass": "", "imagename": "d2e7d01c2da713e09d3ab0161254c969.jpg", "infoid": 1017343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity，在这里我们解开标题背后的数字。\n这是股票星期一，我们每周的开播节目追踪最新的重大新闻，谈论未来一周的情况，深入研究最近几轮融资，并考虑来自私人市场的更大的主题或叙事。你可以在推特上关注这部剧，我也可以在这里关注，别忘了看看上周五的那一集。\n今天早上的新闻有点多，但当然，我们不得不从过去几周最大的新闻开始：\n这是TikTok全天候：最近有消息称，在苹果公司(Apple)来了之后，Twitter可能会对TikTok感兴趣，而且在某种程度上，Twitter可能会成为潜在的追求者。重要的是，微软并没有完全锁定TikTok的退出。最近没有关于特朗普政府试图敲诈销售价格的决定是否会通过的消息。(它不会。)。\nTikTok最早可能在本周就其可能被迫出售一事起诉特朗普政府。\n大型科技公司的巨额财富只会不断增长，这意味着公开市场份额的上升是基于少数几家大型科技公司的业绩。\nExpert System筹集了2940万美元，Palmetto筹集了2900万美元，Silverfort筹集了3000万美元。同样大小的三发子弹怎么样？\n所有这一切和财报季基本上已经过去，科技公司总体上没有受到影响。因此，好时光还会持续一段时间。祝你一周愉快!。\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast where we unpack the numbers behind the headlines.\n This is  Equity   Monday, our weekly kickoff that tracks the latest big news, chats about the coming week, digs into some recent funding rounds and mulls over a larger theme or narrative from the private markets. You can follow the show on Twitter  here, and myself  here, and don’t forget to check out  last Friday’s episode.\n This morning was a bit of a grab-bag of news, but of course we had to start off with the biggest story from the past few week:\n It’s TikTok around the clock: News broke recently that Twitter  could be interested in TikTok after Apple came and somewhat went as a possible suitor. What matters is that Microsoft is not a full-lock on  TikTok’s   exit. No word lately on whether the Trump administration’s  decision to try to extort a chunk of the sale price will go through. (It won’t.)\n TikTok  may sue the Trump administration as early as this week over its possible forced sale.\n   The huge wealth of major tech companies  is only growing, meaning that a rising share of the public market run is based on a handful of big-tech results.\n  Expert System has  raised $29.4 million, while  Palmetto has  raised $29 million, and  Silverfort put  together a $30 million round. How’s that for three rounds of the same size?\n All that and earnings season is largely behind us, leaving tech companies generally unscathed. So, the good times will persist for a while yet. Have a great week!\n Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-08-10 22:23:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,tiktok,monday", "title": "\n股票周一：随着财报季开始结束，TikTok传奇仍在继续", "title_en": "\n\t\t\t\tEquity Monday: The TikTok saga rolls on as earnings season starts to wrap\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/equity-monday-the-tiktok-saga-rolls-on-as-earnings-season-starts-to-wrap/", "via": "", "real_tags": ["股票", "tiktok", "monday"]}, {"category": "", "categoryclass": "", "imagename": "0828fa000dcecac537c976883ad45fa8.jpg", "infoid": 1017342, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "库珀(2017年成为首席执行官)告诉我，该公司去年决定“专注于我们的实力”，并在2020年1月进行了“品牌重启”，以强调其创意主题内容的丰富性。与此同时，库珀表示，该公司对创造力的定义非常宽泛，分为动画、设计、插图、摄影、电影制作和写作等类别。\n“不是鲍勃·罗斯，”他说。“我喜欢鲍勃·罗斯，但这对创造力的定义非常狭隘。创意可以有很多不同的形式--艺术、设计、日志、创意写作。它可以是烹饪，也可以是手工艺。“。\n库珀补充说，到3月中旬，日使用量已经大幅上升，当时大流行导致了全美范围内广泛的社会疏远命令。这带来了一些挑战，特别是对于该公司在提供用户生成类的同时提供的更精致的Skill Share Originals。(例如，Originals包括由Victo Ngai教授的色彩大师班，由Shanell Martin教授的关于“发现你的创造性声音”的课程，以及由Susan Orlean教授的创意非虚构类课程。)。\n但当然，大流行也意味着，正如库珀所说，“更多的人在家里有更多的空闲时间，并正在寻找一种建设性的方式来度过这些时间。”事实上，该公司表示，自品牌更名以来，新的会员注册人数增加了两倍，现有会员观看的课程数量是原来的三倍。\nSkill share还在继续制作“原创”，向教练发送“一大箱装备”，然后远程监督拍摄。事实上，库珀表示，这为Originals团队“打开了一个全新的世界”，让他们“可以看到世界上我们可能不会派摄制组去拍摄的地方”。\n该公司现在有1200万注册会员，8000名教师和3万门课程-所有这些都可以通过每年99美元或每月19美元的费用进入。该公司还宣布，它已经筹集了6600万美元的新资金，由OMERS Growth Equity牵头，董事总经理萨尔·皮卡尔(Saar Pikar)将加入董事会。之前的投资者联合广场风险投资公司(Union Square Ventures)、阿玛西亚风险投资公司(Amasia Ventures。\n皮卡在一份声明中说：“Skill Share服务于专业创意人员和日常创意爱好者的需求，为在线学习市场提供了一个高度创新的价值主张。”我们期待着深化我们与Skill Share和我们的其他投资者的伙伴关系，以帮助马特·库珀和他的团队扩大公司的国际覆盖面，并帮助Skill Share实现其独特的在线学习方式的全部潜力。“。\n库珀补充说，该公司(此前筹集了4200万美元)2020年上半年的现金流为正，因此它筹集了新一轮资金，以投资于增长-特别是团队的Skill Share企业产品，该产品允许通用金融(GM Financial)、副主席、AWS、露露柠檬(Lululemon)、American Craates和Benefit等客户为员工提供Skill Share作为一项福利。\n库珀I也希望在国际上扩张。显然，三分之二的新会员注册来自美国以外，印度是Skill Share增长最快的市场，也就是“没有当地语言内容，没有当地语言教师”。虽然库珀计划在不久的将来继续专注于英语内容，但他指出，Skill Share还可以采取其他措施来鼓励全球观众，比如接受不同货币的付费，以及支持不同语言的字幕。\n他说：“仅仅是让这些国际用户更容易从该平台获得价值，我们预计这些国际市场就会出现戏剧性的增长。”", "note_en": "Cooper (who became CEO in 2017) told me that the company decided last year to “focus on our strength,” leading to a “brand relaunch” in January 2020 to emphasize the richness of its creativity-themed content. At the same time, Cooper said the company defines creativity very broadly, with classes divided into categories like animation, design, illustration, photography, filmmaking and writing.\n “It’s not  Bob Ross,” he said. “And I love Bob Ross, but that’s a very narrow definition of creativity. Creativity can come in lots of different forms — art, design, journaling, creative writing it can be culinary, it can be crafts.”\n  Cooper added that daily usage was already up significantly by mid-March, when the pandemic led to widespread social distancing orders across the United States. That created some challenges, particularly for the more polished  Skillshare   Originals that the company offers alongside its user-generated classes. (For example, Originals include a color masterclass taught by Victo Ngai, a class on “discovering your creative voice” taught by Shantell Martin and a creative nonfiction class by Susan Orlean.)\n But of course the pandemic also meant that, as Cooper put it, “A lot more people had a lot more free time at home and were looking for a constructive way to spend it.” In fact, the company said that since its rebranding, new membership sign-ups have tripled, with existing members watching three times the number of lessons.\n And Skillshare has continued producing Originals by sending instructors “a huge box of gear” and then supervising the shoot remotely. In fact, Cooper suggested that this has “opened up a whole new world” for the Originals team, allowing them to “look at parts of the world where we probably weren’t going to fly a camera crew to go shoot.”\n  The company now has 12 million registered members, 8,000 teachers and 30,000 classes — all accessible for $99 a year or $19 a month. And it’s announcing that it has raised $66 million in new funding led by OMERS Growth Equity, with managing director Saar Pikar joining the board of directors. Previous investors Union Square Ventures, Amasia Ventures, Burda Principal Investments and Spero Ventures also participated.\n “Skillshare serves the needs of professional creatives and everyday creative hobbyists alike, which presents a highly-innovative value proposition for the online learning market,” Pikar said in a statement. “We look forward to deepening our partnership with Skillshare, and our fellow investors, in order to help Matt Cooper and his team scale up the company’s international reach – and help Skillshare achieve the full potential of its unique approach to online learning.”\n Cooper added that the company (which had previously raised $42 million) was cashflow positive for the first half of 2020, so it raised the new round to invest in growth — particularly in the Skillshare for Teams enterprise product, which allows customers like GM Financial, Vice, AWS, Lululemon, American Crafts and Benefit to offer Skillshare as a perk for their employees.\n Cooper i also hoping to expand internationally. Apparently two-thirds of new member sign-ups are coming from outside the United States, with India as Skillshare’s fastest growing market, and that’s with “no local language content, no local language teachers.” While Cooper plans to remain focused on English content for the near future, he noted that there are other steps Skillshare can take to encourage global viewership, like accepting payments in different currencies and supporting subtitles in different languages.\n “Just by making it a little easier for those international users to get value from the platform, we expect to see dramatic growth in these international markets,” he said.", "posttime": "2020-08-10 22:22:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创意,focus", "title": "\n随着对创意技能的重新关注，在线学习公司Skill Share筹集了6600万美元", "title_en": "\n\t\t\t\tWith a renewed focus on creative skills, online learning company Skillshare raises $66M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/10/skillshare-new-funding/", "via": "", "real_tags": ["创意", "focus"]}]