[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1002268, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MongoDB是一个分布式文档数据库，它声称提供“当今任何可用的数据库中最强大的数据一致性、正确性和安全性保证”，具有“完整的ACID事务”。Jepsen评估了MongoDB版本4.2.6，发现即使在读写关注度最高的情况下，它也无法保持快照隔离。相反，Jepsen观察到读取偏差、循环信息流、重复写入和内部一致性违规。弱默认值意味着事务可能会丢失写入并允许脏读，甚至会降低数据库和集合级别上请求的安全级别。此外，快照读取关注点不能保证快照，除非与大多数写入关注点配对-即使对于只读事务也是如此。这些设计选择使MongoDB事务的安全使用变得复杂。这项工作是独立进行的，没有报酬，并根据杰普森道德政策进行。本报告中提到的MongoDB、Fauna和YuaByte之前都曾聘请Jepsen进行付费分析。\nMongoDB是流行的分布式文档数据库。它通过自主开发的共识协议提供复制，该协议的灵感来自RAFT，并且可以通过mongos跨分片分发数据。我们之前评估了MongoDB的2.4.3、2.6.7、3.4.0-rc3和3.6.4版本。\n我们关于MongoDB 3.6.4的最新报告集中于分片集合中的因果一致性和线性化。我们发现，分片集群似乎提供了针对单个文档的可线性化的读取、写入和比较并设置操作，只要用户在运行时使用的是可线性化的读取关注点和多数写入关注点。但是，任何较弱的写入关注度都会导致提交的写入丢失。MongoDB的默认写关注级别是(并保持)由单个节点确认，这意味着MongoDB可能会在默认情况下丢失数据。尽管写入问题文档没有明确说明这一点，但回滚文档声明：\n对于默认写入问题，如果主服务器在写入操作复制到任何辅助服务器之前停止，则可能会回滚数据。\n类似地，MongoDB的默认读取关注度允许中止读取：读取器可以观察到未完全提交的状态，并且在将来可能会被丢弃。正如读隔离一致性文档所指出的，“未提交的读操作是默认的隔离级别”。\n我们发现，由于这些弱缺省值，MongoDB的因果会话在缺省情况下不能保持因果一致性：用户需要同时指定写和读关注点多数(或更高)才能实际获得因果一致性。MongoDB解决了这个问题，说它正在按设计工作，并更新了他们的隔离文档，指出即使MongoDB提供了“客户端会话中的因果一致性”，但除非用户小心地同时使用读和写关注点多数，否则这一保证是站不住脚的。现在有一个详细的表显示了较弱的读写关注点提供的属性。\n奇怪的是，MongoDB在他们的MongoDB和Jepsen页面上没有提及这些发现。相反，该页只讨论通过结果，没有提到读取或写入问题，将实际报告隐藏在脚注中，并继续声称：\nMongoDB提供当今任何可用的数据库中最强的数据一致性、正确性和安全性保证。\n我们鼓励MongoDB在上下文中报告Jepsen的发现：虽然MongoDB确实提供了每个文档的线性化和具有最强设置的因果一致性，但它在大多数配置中也无法提供这些属性。我们认为用户可能想要知道，默认情况下，他们的数据库可能会丢失数据，但是MongoDB对我们工作的总结省略了对此行为的任何提及。\n那么，MongoDB是否提供“最强的数据一致性、正确性和安全性保证”呢？过去的工作表明，对于单个文档操作，答案是“是的；MongoDB以最强的设置提供了每个文档的线性化，但不是默认的”。然而，在2018年，MongoDB引入了多文档事务-仅限于一个分片内-并在2019年将这些事务扩展到多个分片。这些交易提供哪些安全属性？\nMongoDB主页自豪地宣传“全ACID交易”。Transaction页面声明MongoDB是“唯一完全结合了文档模型的功能和具有ACID保证的分布式系统架构的数据库”，CosmosDB、DynamoDB、FaunaDB、Oracle NoSQL、OrientDB、RavenDB、SAP HANA、YuaByte DB等公司也声称这一组合。\nmongodb架构指南承诺ACID事务“保持与您在传统数据库…中习惯的数据完整性保证相同的数据完整性保证”。MongoDB提供了“很强的设计一致性”，但没有提供更具体的声明。ACID白皮书澄清了MongoDB事务提供快照隔离：一个相当强大的模型，它构成了PostgreSQL等系统的一致性基准级别。白皮书称：\n…。快照读取隔离可确保在只读事务内执行的查询和聚合将针对跨分片群集的每个主副本的数据库的全局一致快照运行。\nMongoDB反复将快照隔离总结为“事务提供一致的数据视图，并强制执行全有或全无执行以维护数据完整性”。这是对快照隔离的简明而直观的总结，但我们应该注意，快照隔离下的“一致视图”可能仍然令人惊讶：正如Fekete、O‘Neil和O’Neil在2004年所写的那样，只读事务在快照隔离下可以观察到不可序列化的行为。快照隔离也不一定维护数据完整性：在他们1995年的论文Defining Snapshot Isolation中，Berenson、Bernstein等人提供了在快照隔离下其完整性约束可能被违反的应用程序示例-例如，由于写入偏差。\n我们使用Jepsen分布式系统测试库设计了一个测试套件，并使用它对MongoDB 4.2.6中的事务安全性进行了评估。我们的测试在9个Debian 9节点的集群上安装了MongoDB的官方Debian包。我们在LXC和EC2中都进行了测试；两者都表现出相似的行为。根据部署指导原则，我们构建了双分片集群，将分片和configsvr元数据系统都作为三节点副本集运行。所有9个节点都运行一个mongos实例，该实例充当分片MongoDB集群的前端。\n我们的测试工作负载涉及单个MongoDB集合中循环文档池的事务，每个文档包含单个整数数组。每个事务对这些文档执行一到四个操作：要么按primary key_id读取单个文档，要么(使用$PUSH)再次按_id将唯一整数附加到单个文档的值数组。我们按_id对集合进行了分片。\n使用与加州大学圣克鲁斯分校的Peter Alvaro合作开发的新交易分析工具Elle，Jepsen自动推断这些交易之间的依赖关系，并在该图中搜索循环以识别隔离异常。检查中止和中间读取以及其他非循环异常的其他技术。\n在其中一些测试中，我们引入了网络分区，旨在隔离MongoDB主节点。\n我们首先在没有事务的情况下运行测试以获得基线：每个Jepsen“事务”只执行一个读取或追加操作，而不使用会话或事务API。因为我们知道MongoDB会丢失任何设置小于多数的更新，并且在没有读取关注点的情况下表现出陈旧的读取可线性化，所以我们在客户端的数据库句柄上设置了写入关注点多数和读取关注点可线性化。生成的历史记录似乎与快照隔离一致。\n然后，我们将这些单个操作包装在事务中，出现了一个令人惊讶的行为：使用网络分区，事务似乎丢失了确认的写入。例如，考虑以下历史记录，其中在30秒内，对8个文档的更新被成功确认，然后消失。以下是阅读文档555的历史记录：\n客户端观察到一个单调增长的元素列表，直到[1 2 3 4 5 6 7]，此时列表重置为[]，并从[8]重新开始。这可能是MongoDB回滚的一个例子，这是“数据丢失”的一种花哨的说法。\n这很糟糕，但一个更微妙的问题出现了：我们到底为什么能够读取这些值？毕竟，Read Concerns Linizable应该只显示大多数确认(即不可持续)的写入。答案是一个令人惊讶但有文档记录的MongoDB设计选择：\n事务中的操作使用事务级别的读取关注点。也就是说，在集合和数据库级别设置的任何读取关注点在事务内都会被忽略。\n数据库社区的普遍看法是，MongoDB历来拒绝提高读写安全的默认级别，因为这样做会影响已经习惯了更快的、偶尔不安全的默认设置的生产用户，而且数据丢失可能不够严重，不足以保证更强的安全设置带来的延迟、吞吐量和资本支出的增加。MongoDB的研究人员在VLDB上报告说：\n…。当然，用户更喜欢使用readConcern级别的“多数”和writeConcern w：“多数”，因为每个人都想要安全。但是，当用户发现较强的一致性级别太慢时，他们会切换到使用较弱的一致性级别。这些决策通常基于业务需求和SLA，而不是细粒度的开发人员需求。正如我们在整篇文章中所讨论的那样，决定使用较弱的一致性级别在实践中通常是可行的，因为故障转移很少发生，并且故障转移造成的数据丢失通常很小。\n然而，交易是一个全新的功能，用户可能希望牺牲一些速度来换取更好的安全保证。合理的用户可能会期望事务的默认安全级别如承诺的那样提供快照隔离-或者，至少与用户已经从所涉及的数据库或集合请求的读取关注度相同。相反，没有显式读关注点的事务将数据库或集合级别的任何请求的读关注点降级为缺省的本地级别，这“不能保证数据已被写入大多数副本(即可能被回滚)”。\n因此：用户应该小心地对每个需要快照隔离的事务使用快照级别的读关注。文档确认：“Read Concerns‘Snapshot’从大多数提交的Data…的快照返回数据”这是有意义的，然后继续：“如果事务以写关注‘多数’提交”，则不是这样。具体而言：\n如果事务不使用写关注点“多数”进行提交，则“快照”读关注点不能保证读取操作使用了多数提交数据的快照。\n精明的读者可能会问，“拥有不提供快照隔离读取的快照读取关注点有什么意义？”更精明的读者在观察到一种模式后，可能会询问写入关注度的默认级别。\n如果事务级别的写入关注点和会话级别的写入关注点未设置，则事务级别的写入关注默认为客户端级的写入关注点。默认情况下，客户端级写入关注点为w：1。\n为了获得快照隔离，用户不仅必须小心地将每个事务的读关注点设置为快照，还必须将每个事务的写关注点设置为多数。\n令人惊讶的是，这甚至适用于只读事务。在此测试运行中，我们在单操作写事务上设置读关注点快照和写关注点多数，对于单操作读事务，仅设置读关注点快照。发生网络分区时，读取观察到的不同时间线：\n这些更新并没有完全丢失-写入1、5和6的事务超时，但它们对读取的影响既可见又不可见，这意味着这些时间线中至少有一个是中止读取的实例。\n这种行为可能令人惊讶，但是MongoDB值得称赞的是，这种行为的大部分都在事务文档中清楚地列出了。问题是，用户是否仔细阅读了该文档，而不是依赖于市场宣传，或者像“使用Read Concerns Snapshot意味着阅读提交的快照”这样的假设。我们可能还会问，是否可以期望用户记住将这些设置应用于需要这些设置的每个事务。毕竟，MongoDB提供了精确的数据库和集合级安全设置，因此用户可以假定与这些数据库或集合交互的所有操作都使用这些设置；当用户执行(可能)安全关键型操作时，忽略读写相关设置是令人惊讶的！\n在随后的测试中，我们对所有单操作读写使用读关注度可线性化和写关注度多数，对多操作事务使用读关注度快照和写关注度多数。在健康群集(例如，没有故障的群集)中，粗略测试似乎与快照隔离一致。\n然而，我们注意到，虽然MongoDB的主页显著地声称提供“全ACID事务”，但人们可能会认为这意味着事务是完全原子的、隔离的、一致的和持久的。事实并非如此：如前所述，快照隔离下的事务并不是完全隔离的。\n例如，考虑以下测试运行，它使用读关注点快照、写关注点多数，并且不涉及网络分区或其他外部故障。生成的历史似乎没有违反快照隔离，但仍然表现出循环的事务依赖关系，如下所示：\n一个事务将1附加到文档1047，并读取文档1045，发现它是空的。另一个将1附加到文档1045，并读取1047，发现它是空的。标记为RW的行表示这些读写反依赖关系。这些事务不可能是隔离的：如果第一个事务先隔离执行，则其对1047的写入对第二个事务是可见的，反之亦然。由于这些事务没有写入相同的文档，因此允许它们(在快照隔离下)并发执行。\n其他周期则更为复杂。例如，这里是一个由12个事务组成的集群，同样在MongoDB最强的安全设置下执行。这些事务中的每一个都(以各种方式)相互依赖。标记为WW的箭头显示写-写依赖关系，其中一个事务覆盖另一个事务的写入。具有WR的事务表现出写-读依赖关系：一个事务读取另一个事务的写。\n或者考虑一下这个由123个事务组成的集群，所有这些事务似乎都是在每个事务之前执行的，但也是在每个事务之后执行的。这个星团是“全酸”吗？也许吧，但如果是这样的话，我们必须承认，酸性中的“我”只意味着部分隔离，或者“完全”意味着略低于完全。\n这些异常现象并不少见。例如，这个历史记录每秒大约包含100个事务，我们识别出1,461个事务(总共13914个)具有循环依赖关系。大约10%的事务在正常运行期间出现异常，没有故障。\n重要的是要记住，仅仅因为我们可以在这个简单的工作负载中检测到异常，并不意味着这些异常对用户很重要。并发性可能足够低，因此在很大程度上不需要进行并发控制。可以证明某些事务集在快照隔离下可串行执行-例如，当它们的写入集相交时。其他的则表现出不可序列化的异常，但不违反应用程序级一致性约束。还有一些确实违反了约束，但还不够频繁，用户不会注意到或在意。对于这些目的，快照隔离就足够好了！\n当我们在测试中引入网络故障时，我们遇到(正如人们所预期的)各种客户端错误。MongoDB事务文档说：\n当事务中止时，事务中所做的所有数据更改都将被丢弃，而不会变得可见。例如，如果事务中的任何操作失败，事务将中止，事务中所做的所有数据更改都将被丢弃，而不会变得可见。1个。\n然而，反之亦然：一些事务错误消息似乎表明事务已中止，但事实并非如此。例如，TransactionConsulatorSteppingDown异常实际上可能意味着事务已提交。同样，命令失败，出现错误6(HostUnreacable)：&#39；无法初始化集合jepsendb.jepsencoll：：Reduced By：：Connection Rejected&#39；的写操作的目标器。我们在测试中反复遇到这些错误，结果发现它们的写入对于以后的读取是可见的。\n这不一定是错误-在任何分布式系统中，总会有一类错误指示成功或失败。但是，如果清楚地标记这些错误，或者提供文本指导，则会很有帮助。错误6，就像我们遇到的大多数错误一样，没有文档记录；官方文档中只剩下几个代码，谷歌也没什么可说的。完整的错误文档(可能带有代码指示确定故障与不确定故障的表)可以为错误消息提供一种实用的替代方案。\n在正确解释错误的情况下，我们发现网络分区可能会导致MongoDB复制事务的影响。尽管从未两次将相同的值附加到一个数组中，但我们反复观察到具有同一元素的多个副本的数组。例如，以此测试运行为例，它包含以下事务：\n这里，元素6在阅读文档436时出现了两次。这种重复提高了将6写入密钥436的事务发生在其他事务之前和之后的可能性；根据人们选择的解释(如果有的话)，所得到的历史也表现出G-Single和G2反依赖循环。即使在读关注点快照和写关注点占多数的情况下也会出现这种异常，这表明即使在最强的设置下，MongoDB事务也不提供快照隔离。\n此行为可能表明事务重试机制不正确-MongoDB将自动重试作为一项功能进行通告。为了确定重试机制是否有问题，我们尝试禁用它-结果发现MongoDB事务忽略了retryWrites设置，并且不管怎样都重试。我们不确定用户是否可以解决此问题。\n在这种情况下，使用读关注点快照和写关注点多数运行的测试执行了三个事务，具有以下依赖关系图：\n最上面的事务将2附加到文档79，紧随其后的是中间事务的附加5。我们可以推断这些写入按此顺序发生，因为观察到另一个事务(不是此周期的一部分)：\n在这些写入之后，底部事务将5附加到文档77，中间事务的读取77没有观察到这一点。但是，追加5对于最上面的事务是可见的！\n因为这个循环正好包含一个反依赖(RW)边缘，所以它很可能是Adya的G-Single异常(也称为读偏差)的一个例子。本质上，中间事务观察到逻辑上优先事务的部分(但不是全部)影响。快照禁止读取偏差。\n..", "note_en": "MongoDB is a distributed document database which claims to offer “among the strongest data consistency, correctness, and safety guarantees of any database available today”, with “full ACID transactions”. Jepsen evaluated MongoDB version 4.2.6, and found that even at the strongest levels of read and write concern, it failed to preserve snapshot isolation. Instead, Jepsen observed read skew, cyclic information flow, duplicate writes, and internal consistency violations. Weak defaults meant that transactions could lose writes and allow dirty reads, even downgrading requested safety levels at the database and collection level. Moreover, the  snapshot read concern did not guarantee snapshot unless paired with write concern  majority—even for read-only transactions. These design choices complicate the safe use of MongoDB transactions. This work was performed independently, without compensation, and conducted in accordance with the  Jepsen ethics policy. MongoDB, Fauna, and YugaByte, all mentioned in this report, have previously engaged Jepsen for paid analyses.\n MongoDB is a popular distributed document database. It offers  replication via a  homegrown consensus protocol which draws inspiration from  Raft, and can distribute data across shards via  mongos. We previously evaluated MongoDB at versions  2.4.3,  2.6.7,  3.4.0-rc3, and  3.6.4.\n Our most recent report on  MongoDB 3.6.4 focused on causal consistency and linearizability in sharded collections. We found that sharded clusters appeared to offer linearizable reads, writes, and compare-and-set operations against single documents, so long as users ran with  read concern  linearizable and  write concern  majority. However, any weaker level of write concern resulted in the loss of committed writes. MongoDB’s default level of write concern was (and remains) acknowledgement by a single node, which means MongoDB may lose data by default. Although the  write concern documentation does not make this clear, the  rollback documentation states:\n With the default write concern, data may be rolled back if the primary steps down before the write operations have replicated to any of the secondaries.\n Similarly, MongoDB’s default level of read concern allows aborted reads: readers can observe state that is not fully committed, and could be discarded in the future. As the  read isolation consistency docs note, “Read uncommitted is the default isolation level”.\n We found that due to these weak defaults, MongoDB’s causal sessions  did not preserve causal consistency by default: users needed to specify both write and read concern  majority (or higher) to actually get causal consistency. MongoDB  closed the issue, saying it was working as designed, and updated their  isolation documentation to note that even though MongoDB offers “causal consistency in client sessions”, that guarantee does not hold unless users take care to use both read and write concern  majority. A  detailed table now shows the properties offered by weaker read and write concerns.\n Curiously, MongoDB omitted any mention of these findings in their  MongoDB and Jepsen page. Instead, that page discusses only passing results, makes no mention of read or write concern, buries the actual report in a footnote, and goes on to claim:\n MongoDB offers among the strongest data consistency, correctness, and safety guarantees of any database available today.\n We encourage MongoDB to report Jepsen findings in context: while MongoDB  did appear to offer per-document linearizability and causal consistency with the strongest settings, it also  failed to offer those properties in most configurations. We think users might want to be aware that their database could lose data by default, but MongoDB’s summary of our work omits any mention of this behavior.\n  So, does MongoDB offer “among the strongest data consistency, correctness, and safety guarantees”? Past work suggests that for individual document operations, the answer is, “yes; MongoDB offers per-document linearizability with the strongest settings, but not by default”. However in 2018, MongoDB introduced  multi-document transactions—limited to within a shard—and in 2019, extended those transactions across shards. What safety properties do these transactions provide?\n The  MongoDB home page proudly advertises “full ACID transactions”. The  transactions page states that MongoDB is “the only database that fully combines the power of the document model and a distributed systems architecture with ACID guarantees,” a combination also claimed by  CosmosDB,  DynamoDB,  FaunaDB,  Oracle NoSQL,  OrientDB,  RavenDB,  SAP HANA,  YugaByte DB, et al.\n The  MongoDB architecture guide promises ACID transactions “maintain the same data integrity guarantees you are used to in traditional databases…”, and that MongoDB offers “strong consistency by design”, but offers no more specific claims. The  ACID whitepaper clarifies that MongoDB transactions offer  snapshot isolation: a reasonably strong model which constitutes the baseline level of consistency for systems like  PostgreSQL. The whitepaper states:\n … snapshot read isolation ensures queries and aggregations executed within a read-only transaction will operate against a globally consistent snapshot of the database across each primary replica of a sharded cluster.\n MongoDB  repeatedly  summarizes snapshot isolation as “transactions provide a consistent view of data, and enforce all-or-nothing execution to maintain data integrity”. This is a concise and intuitive summary of snapshot isolation, but we should note that a “consistent view” under snapshot isolation may still be surprising: as Fekete, O’Neil, and O’Neil  wrote in 2004, read-only transactions can observe nonserializable behavior under snapshot isolation. Nor does snapshot isolation necessarily maintain data integrity: in their  1995 paper defining snapshot isolation, Berenson, Bernstein, et al. provided examples of applications whose integrity constraints could be violated under snapshot isolation—for instance, due to write skew.\n  We designed a  test suite using the  Jepsen distributed systems testing library, and used it to evaluate transactional safety in MongoDB 4.2.6. Our tests installed MongoDB’s official Debian packages on clusters of nine Debian 9 nodes. We tested both in LXC and EC2; both exhibited similar behavior. As per the  deployment guidelines, we built  two-shard clusters, with both shards and the  configsvr metadata system running as three-node  replica sets. All nine nodes ran  an instance of  mongos, which serves as the frontend to sharded MongoDB clusters.\n Our  test workload involved transactions over a rotating pool of documents in a single MongoDB collection, each document containing a single array of integers. Each transaction  performed one to four operations over those documents: either reading a single document by primary key  _id, or appending (using  $push) a unique integer to a single document’s  value array, again by  _id. We  sharded the collection by  _id.\n Using  Elle, a new transaction analysis tool developed in collaboration with UC Santa Cruz’s  Peter Alvaro, Jepsen automatically inferred dependencies between these transactions, and searched for cycles in that graph to identify isolation anomalies. Additional techniques checked for aborted and intermediate reads, as well as other non-cyclic anomalies.\n During some of these tests, we introduced  network partitions, targeted to isolate MongoDB primary nodes.\n   We began by running our tests without transactions to get a baseline: each Jepsen “transaction” performed only a single read or append operation without using the session or transaction APIs. Since we know MongoDB loses updates with any setting less than  majority, and exhibits stale reads without read concern  linearizable, we set write concern  majority and read concern  linearizable  on the client’s  database handle. The resulting histories appeared consistent with snapshot isolation.\n We then wrapped those single operations in transactions, and a surprising behavior appeared: with network partitions, transactions appeared to lose acknowledged writes. For instance, consider  this history, where in 30 seconds, updates to eight documents were successfully acknowledged, then disappeared. Here is the history of reads for document 555:\n  Clients observed a monotonically growing list of elements until  [1 2 3 4 5 6 7], at which point the list reset to  [], and started afresh with  [8]. This could be an example of MongoDB  rollbacks, which is a fancy way of saying “data loss”.\n This is bad, but a more subtle question arises:  why were we able to read these values at all? After all, read concern  linearizable  is supposed to show only majority-acknowledged (i.e. durable) writes. The answer is a surprising— but documented—MongoDB design choice:\n Operations in a transaction use the transaction-level read concern. That is, any read concern set at the collection and database level is ignored inside the transaction.\n The received wisdom in the database community is that MongoDB has historically resisted raising the default level of read and write safety because doing so would impact production users who have become accustomed to faster, occasionally unsafe defaults, and because data loss might not be significant enough to warrant the increased latency, throughput, and capital expenditure entailed by stronger safety settings. MongoDB’s researchers  reported in VLDB that:\n … users would prefer, of course, to use readConcern level “majority” and writeConcern w:“majority”, since everyone wants safety. However, when users find stronger consistency levels to be too slow, they will switch to using weaker consistency levels. These decisions are often based on business requirements and SLAs rather than granular developer needs. As we argue throughout this paper, the decision to use weaker consistency levels often works in practice because failovers are infrequent and data loss from failovers is usually small.\n However, transactions are an entirely new feature, and users presumably  expect to trade off some speed in exchange for improved safety guarantees. A reasonable user might expect that the default safety levels for transactions provide, as promised, snapshot isolation—or, at the very least, the same level of read concern that the user has already requested from the databases or collections involved. Instead, transactions without an explicit read concern  downgrade any requested read concern at the database or collection level to a default level of  local,  which offers “no guarantee that the data has been written to a majority of replicas (i.e. may be rolled back).”\n So: users should be careful to use the  snapshot level of read concern with every transaction which requires snapshot isolation. The  documentation confirms: “Read concern ‘snapshot’ returns data from a snapshot of majority committed data…” which makes sense, and then continues: “ if the transaction commits with write concern ‘majority’”, which does not. Specifically:\n If the transaction does not use write concern “majority” for the commit, the “snapshot” read concern provides no guarantee that read operations used a snapshot of majority-committed data.\n “What is the point,” an astute reader might ask, “of having a  snapshot read concern which does not provide snapshot isolated reads?” An even more astute reader, having observed a pattern, might inquire about the  default level of write concern.\n If the transaction-level write concern and the session-level write concern are unset, transaction-level write concern defaults to the client-level write concern. By default, client-level write concern is w: 1.\n In order to obtain snapshot isolation, users must be careful not only to set the read concern to  snapshot for each transaction, but  also to set write concern for each transaction to  majority.\n Astonishingly, this applies even to  read-only transactions. In  this test run, we set read concern  snapshot and write concern  majority on single-operation write transactions, and for single-operation read transactions, set only read concern  snapshot. When a network partition occurred, reads observed divergent timelines:\n  These updates weren’t  lost exactly—the transactions which wrote 1, 5, and 6 timed out, but their effects being both visible and not visible to reads implies that at least one of these timelines was an instance of aborted read.\n This behavior might be surprising, but to MongoDB’s credit, most of this behavior is  clearly laid out in the transactions documentation. The question is whether users are closely reading that documentation, versus relying on marketing claims, or assumptions like “using read concern  snapshot means reading a committed snapshot”. We might also ask whether users can be expected to remember to apply these settings to every transaction which requires them. After all, MongoDB offers database and collection-level safety settings precisely so users can  assume all operations interacting with those databases or collections use those settings; ignoring read and write concern settings when users perform (presumably) safety-critical operations is surprising!\n  In subsequent tests, we used read concern  linearizable and write concern  majority for all single-operation reads and writes, and read concern  snapshot and write concern  majority for multi-operation transactions. In healthy clusters (e.g. without faults), cursory testing appeared consistent with snapshot isolation.\n However, we note that while MongoDB’s home page prominently  claims to offer “full ACID transactions”, which one might assume means that transactions are fully atomic, isolated, consistent, and durable. This is not exactly the case: transactions under snapshot isolation are not, as  previously noted, fully isolated.\n For example, consider  this test run, which used read concern  snapshot, write concern  majority, and did not involve network partitions or other exogenous faults. The resulting history does not appear to violate snapshot isolation, but nonetheless exhibits cyclic transaction dependencies, like the following:\n  One transaction appends 1 to document 1047, and reads document 1045, finding it empty. The other appends 1 to document 1045, and reads 1047, finding it empty. Lines marked  rw denote these read-write  anti-dependencies. These transactions cannot possibly be isolated: if the top transaction executed first, in isolation, its write to 1047 would have been visible to the second—and vice-versa. Since these transactions didn’t write to the same documents, they are allowed (under snapshot isolation) to execute concurrently.\n  Other cycles are more complex. Here, for instance, is a cluster of twelve transactions, again executed under MongoDB’s strongest possible safety settings. Each of these transactions depends (in various ways) on every other. Arrows labeled  ww show a write-write dependency, wherein one transaction overwrote another’s write. Those with  wr show a write-read dependency: one transaction read another’s write.\n Or consider this  cluster of 123 transactions, all of which appeared to execute before—but also after!—every other. Is this cluster “full ACID”? Perhaps, but if so, we must accept that the “I” in ACID means only  partial isolation, or “full” means somewhat less than full.\n  These anomalies are not rare.  This history, for example, contains roughly 100 transactions per second, and we identified 1461 transactions (out of 13914 total) with cyclic dependencies. Roughly 10% of transactions exhibited anomalies during normal operation, without faults.\n It’s important to remember that just because we  can detect anomalies in this simple workload doesn’t mean those anomalies  matter to users. Concurrency could be low enough that concurrency control is largely unnecessary. Some sets of transactions can be proven to execute serializably under snapshot isolation—e.g., when their write sets intersect. Others exhibit nonserializable anomalies, but don’t violate application-level consistency constraints. Still others  do violate constraints, but not frequently enough for users to notice or care. For these purposes, snapshot isolation is good enough!\n  When we introduced network failures into our tests, we encountered (as one would expect)  a variety of client errors. The MongoDB  transaction documentation says:\n When a transaction aborts, all data changes made in the transaction are discarded without ever becoming visible. For example, if any operation in the transaction fails, the transaction aborts and all data changes made in the transaction are discarded without ever becoming visible.  1\n However, the converse is not necessarily true:  some transaction error messages seem to indicate a transaction has aborted, but do not. For example, a  TransactionCoordinatorSteppingDown exception may actually mean the transaction has committed. Likewise,  Command failed with error 6 (HostUnreachable): &#39;unable to initialize targeter for write op for collection jepsendb.jepsencoll :: caused by :: Connection refused&#39; also appears to denote an indeterminate failure. We repeatedly encountered these errors in our tests, only to find that their writes were visible to later reads.\n This is not necessarily a  bug—there will always be a class of errors in any distributed system which could indicate either success or failure. However, it  is helpful when those errors are clearly marked, or offer textual guidance. Error 6, like most of the errors we encountered, is  undocumented; only a few codes  remain in the official docs, and Google has  little to say. Complete error documentation, perhaps with a table of which codes indicate determinate vs indeterminate failures, could offer a pragmatic alternative to error message haruspicy.\n  With errors interpreted correctly, we found that network partitions could cause MongoDB to duplicate the effects of transactions. Despite never appending the same value to an array twice, we repeatedly observed arrays with multiple copies of the same element. For example, take  this test run, which contained the following transaction:\n  Here, element 6 appeared twice in a read of document 436. This duplication raises the possibility that the transaction which wrote 6 to key 436 occurred both before  and after other transactions; depending on which (if any) interpretation one chooses, the resulting history also exhibits G-single and G2 anti-dependency cycles. This anomaly occurred even with read concern  snapshot and write concern  majority, which suggests that even at the strongest settings, MongoDB transactions do not provide snapshot isolation.\n This behavior could point to an improper transaction retry mechanism—MongoDB advertises  automatic retries as a feature. To identify whether the retry mechanism might be at fault, we attempted to disable it—only to discover that MongoDB transactions  ignore the  retryWrites setting, and  retry regardless. We are unsure if users can work around this behavior.\n  In  this case, a test running with read concern  snapshot and write concern  majority executed a trio of transactions with the following dependency graph:\n  The topmost transaction appended 2 to document 79, which was followed by the middle transaction’s append of 5. We can infer these writes took place in this order because another transaction (not part of this cycle) observed:\n  Following these writes, the bottom transaction appended 5 to document 77, which was  not observed by the middle transaction’s read of 77. However, that append of 5  was visible to the topmost transaction!\n Because this cycle contains exactly one anti-dependency (rw) edge, it’s likely  2 an example of  Adya’s G-single anomaly, also known as  read skew. In essence, the middle transaction observed some, but not all, effects of logically prior transactions. Read skew is prohibited by snapshot \n......", "posttime": "2020-05-16 01:43:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "mongodb,杰普森,jepsen,事务", "title": "杰普森：MongoDB 4.2.6", "title_en": "Jepsen: MongoDB 4.2.6", "transed": 1, "url": "http://jepsen.io/analyses/mongodb-4.2.6", "via": "", "real_tags": ["mongodb", "杰普森", "jepsen", "事务"]}, {"category": "", "categoryclass": "", "imagename": "74f8e4cb8f0ef2bac855a20b323f0b82.png", "infoid": 1002267, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "🤗自然语言处理是一个轻量级且可扩展的库，可以方便地共享和访问自然语言处理的数据集和评估指标。\n致力于大数据集：NLP自然将用户从RAM内存限制中解放出来，默认情况下，所有数据集都是在驱动器上进行内存映射的。\nNLP目前提供对约100个NLP数据集和约10个评估指标的访问，旨在让社区轻松添加和共享新的数据集和评估指标。\nNLP起源于令人惊叹的TensorFlow数据集的一个分支，HuggingFace团队非常感谢TensorFlow数据集团队构建了这个令人惊叹的库。有关NLP和TFD之间差异的更多详细信息，可以在NLP和TFD之间的主要差异一节中找到。\nNLP可以从PyPI安装，并且必须安装在虚拟环境中(例如venv或conda)。\n更新存储库时，应按如下方式升级NLP安装及其依赖项：\n如果您计划对PyTorch(1.0+)、TensorFlow(2.2+)或熊猫使用NLP，还应该安装PyTorch、TensorFlow或熊猫。\nimport NLP#打印所有可用的数据集打印(数据集。NLP中数据集的ID。list_Datasets())#加载数据集并打印训练集中的第一个示例teanDataset=nlp。LOAD_DATASET(&#39；TEAND&39；)PRINT(LOAD_DATASET[&#39；TEAND&39；][0])#列出所有可用的指标打印(指标。NLP中指标的ID。list_metrics())#加载指标QUAND_METRICS=nlp。Load_Metric(&#39；小队&#39；)\n现在，最好的NLP介绍是按照Google Colab中的教程进行操作，该教程位于以下位置：\n如果您熟悉伟大的TensorFlow数据集，以下是NLP和TFD之间的主要区别：\nNLP中的脚本不在库中提供，而是根据请求进行查询、下载/缓存和动态加载。\nNLP还以与数据集类似的方式提供评估指标，即使用统一API动态安装脚本。这样就可以访问基准数据集和基准指标对，例如，针对班组或胶水之类的基准。\nNLP的后端序列化基于Apache Arrow/Parquet，而不是TF Records，并利用Python数据类获取信息和具有一些不同特性的特性(我们大多不进行编码，并将原始数据尽可能多地存储在后端序列化缓存中)。\nNLP的面向用户的DataSet对象不是tf.data.Dataset，而是一个内置的与框架无关的DataSet类，其方法灵感来自我们在tf.data中的喜好(如map()方法)。它基本上包装了一个内存映射的箭头表缓存。\n与TensorFlow数据集类似，NLP是下载和准备公共数据集的实用程序库。我们不托管或分发这些数据集，不保证它们的质量或公平性，也不声称您拥有使用该数据集的许可证。您有责任确定您是否有权在数据集的许可下使用该数据集。\n如果您是数据集所有者，并且希望更新数据集的任何部分(描述、引用等)，或者不希望您的数据集包含在此库中，请通过GitHub问题联系。感谢您对ML社区的贡献！\n如果你有兴趣了解更多关于负责任的人工智能实践，包括公平，请参见谷歌人工智能负责任的人工智能实践。", "note_en": "🤗  nlp is a lightweight and extensible library to easily share and access datasets and evaluation metrics for Natural Language Processing (NLP).\n  Strive on large datasets:  nlp naturally frees the user from RAM memory limitation, all datasets are memory-mapped on drive by default.\n nlp currently provides access to ~100 NLP datasets and ~10 evaluation metrics and is designed to let the community easily add and share new datasets and evaluation metrics.\n nlp originated from a fork of the awesome   TensorFlow Datasets and the HuggingFace team want to deeply thank the TensorFlow Datasets team for building this amazing library. More details on the differences between  nlp and  tfds can be found in the section  Main differences between  nlp and  tfds.\n   nlp can be installed from PyPi and has to be installed in a virtual environment (venv or conda for instance)\n     When you update the repository, you should upgrade the nlp installation and its dependencies as follows:\n   If you plan to use  nlp with PyTorch (1.0+), TensorFlow (2.2+) or pandas, you should also install PyTorch, Tensorflow or pandas.\n     import  nlp # Print all the available datasets print( dataset. id  for  dataset  in  nlp. list_datasets()) # Load a dataset and print the first examples in the training set squad_dataset  =  nlp. load_dataset( &#39;squad&#39;) print( squad_dataset[ &#39;train&#39;][ 0]) # List all the available metrics print( metric. id  for  metric  in  nlp. list_metrics()) # Load a metric squad_metric  =  nlp. load_metric( &#39;squad&#39;)\n Now the best introduction to  nlp is to follow the tutorial in Google Colab which is here:\n  If you are familiar with the great  Tensorflow Datasets, here are the main differences between  nlp and  tfds:\n the scripts in  nlp are not provided within the library but are queried, downloaded/cached and dynamically loaded upon request\n nlp also provides evaluation metrics in a similar fashion to the datasets, i.e. as dynamically installed scripts with a unified API. This gives access to the pair of a benchmark dataset and a benchmark metric for instance for benchmarks like SQuAD or GLUE.\n the backend serialization of  nlp is based on Apache Arrow/Parquet instead of TF Records and leverage python dataclasses for info and features with some diverging features (we mostly don&#39;t do encoding and store the raw data as much as possible in the backend serialization cache)\n the user-facing dataset object of  nlp is not a  tf.data.Dataset but a built-in framework-agnostic dataset class with methods inspired by what we like in tf.data (like a map() method). It basically wraps a memory-mapped Arrow table cache.\n  Similarly to Tensorflow Dataset,  nlp is a utility library that downloads and prepares public datasets. We do not host or distribute these datasets, vouch for their quality or fairness, or claim that you have license to use the dataset. It is your responsibility to determine whether you have permission to use the dataset under the dataset&#39;s license.\n If you&#39;re a dataset owner and wish to update any part of it (description, citation, etc.), or do not want your dataset to be included in this library, please get in touch through a GitHub issue. Thanks for your contribution to the ML community!\n If you&#39;re interested in learning more about responsible AI practices, including fairness, please see Google AI&#39;s Responsible AI Practices.", "posttime": "2020-05-16 01:42:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拥抱,datasets,nlp", "title": "NLP：一个来自拥抱脸的新数据集和度量库", "title_en": "NLP: A new datasets and metrics library from Hugging Face", "transed": 1, "url": "https://github.com/huggingface/nlp", "via": "", "real_tags": ["拥抱", "datasets", "nlp"]}, {"category": "", "categoryclass": "", "imagename": "9d0450454c551c74df35396ba197f0fe.jpg", "infoid": 1002266, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在物理世界中，物体经常以有序的方式相互推开。想想看，在磁场的影响下，铁屑形成的对称图案，或者是正在练习社交距离的参观者的均匀间隔。\n当数学家观察数字线时，他们看到的是同一类型的趋势。他们看着表示正负计数的刻度线，感觉到一种将它们保持在相等间距的数值力量。这就好像，就像拥有广阔领地的美洲狮一样，整数之间的距离不能超过1个单位。\n数字线的间距是整个数论领域中发现的现象的最基本的例子。它在研究素数和不同类型方程的解之间的关系时突然出现。数学家可以通过量化它们之间的作用力来更好地理解这些重要的值。\n“具有数论意义的事物往往会相互推开。多伦多大学的雅各布·齐默曼(Jacob Tsimerman)说：“这就是排斥原理。”“我们试图获得排斥原理，并利用它们来获得各种其他结果。”\n数论中的许多重要工作都与排斥原理影响多项式、系数集合和升幂变量的方式有关。几十年来，数学家们一直试图确定在这种情况下斥力的确切大小。\n在12月下旬发布在网上的一份证明中，多伦多大学的韦塞林·迪米特罗夫(Vesselin Dimitrov)最终做到了这一点。\n剑桥大学的Péter Varjú在电子邮件中说：“这真的很壮观。”“Vesselin的想法是全新的，而且很漂亮。”\n迪米特罗夫解决的问题，被称为Schinzel-Zassenhaus猜想，是关于多项式的值的几何的。它预测，当你画出某些值时，它们会以精确的方式展开，看起来就像是在相互推开。迪米特罗夫的工作精确地量化了这种扩散，证明了猜想是正确的。它还提供了对数字似乎遵守的规律的新见解。\n齐默尔曼说：“根据我们对代数数字的理解，这一结果在地面上插上了一面旗帜。”\n在研究多项式时，数学家特别感兴趣的是它们的“根”，即使多项式等于零的变量的值。一个多项式的根和它的次数一样多，也就是它的最大指数的值一样多。因此x 2−4有两个根(2和−2)，而x 5−7 x 3+2 x 2−4 x−9有五个根。\n数学家想知道多项式的根是如何相互联系的。例如，当绘制图形时，某些多项式的根正好落在正多边形的顶点上-它们以精确的几何长度分开。数学家感兴趣的是寻找根之间其他更微妙的几何关系。\n“你能拿到什么样的图案？你能得到一些图案吗，或者这些图案有没有什么限制？“。剑桥大学的伊曼纽尔·布鲁拉德(Emmanuel Breuillard)说。\n迪米特罗夫解决的问题涉及到一族特别重要的表达式的根，称为割圆多项式。这些多项式不能分解成更小的多项式，但你可以用它们来构建其他多项式-它们就像多项式周期表中的元素。第一个也是最简单的割圆多项式是x−1，第二个是x+1，第十个是x4−x3+x2−x+1。然而，与元素周期表不同的是，割圆多项式的列表是永远不变的。\n分圆多项式的根遵循一种非常特殊的几何模式。要查看它，请从空的复平面开始，在该平面中，x轴绘制实数，y轴绘制虚数。然后在原点周围画一个半径为1的圆。这是单位圆。分圆多项式的根都在这个圆上。它们有着一个优雅的名字：“团结之根”。\n但是大多数多项式都是非割圆的，它们的根也不是单位根。这几乎是你能想出的任何系数、变量和指数的组合。\n1965年，Andrzej Schinzel和Hans Zassenhaus预测，割圆多项式和非割圆多项式的根的几何形状有非常特殊的不同。取任何第一个系数为1的非分圆多项式，画出它的根。有些人可能落在单位圈内，有些人就在单位圈内，还有一些人在单位圈外。Schinzel和Zassenhaus预测，每个非割圆多项式必须至少有一个根在单位圆之外，并且至少有一段最小距离。\n或者，用排斥力来表述辛泽尔-扎森豪斯猜想，它预测，非割圆多项式的最小根-可能落在单位圆内-有效地将其他根推到单位圆之外，就像磁铁相互推开一样。\n布鲁亚德说：“你可以把一个多项式的根想象成带负电的粒子，它们相互排斥，随着距离的增加，力会衰减。”\nSchinzel-Zassenhaus猜想甚至精确地定义了排斥力应该有多大。“它说有一种非常精确的、可量化的感觉，即根不可能都离单位圆很近，”齐默尔曼说。\n这个猜想的主要预测有一种物理方程式的感觉。它说，每个非割圆多项式都应该至少有一个根在单位圆之外，距离等于一个常数除以多项式的次数。该常量的精确值不是关键的，所以为了举例，假设它是0.1。如果我们有一个23次的非分圆多项式，这个猜想预测它在单位圆之外至少应该有一个根1/23。\n这是一个强有力的论断，但几十年来，数学家们只设法证实了猜想预测的较弱版本。\nSchinzel和Zassenhaus自己证明了每个非分圆多项式在单位圆外至少有一个1/4的根，提升到多项式的次数(1/4d)。由于分母中指数的存在，这个距离比猜想的距离小得多。\n在接下来的三十年里，数学家们对辛泽尔和扎森豪斯的工作进行了一系列的改进，但进展仍然不完整。数学家认为正确的距离应该是一个尺寸，但他们只能证明它至少是某个较小的尺寸。数学家们根本不知道辛泽尔-扎森豪斯猜想有多难解，他们甚至假设它完全可以解决。\n迪米特罗夫在电子邮件中说：“在找到解决方案之前，人们永远不会在一开始就知道(问题的)解决方案会变得多么简单或复杂。”\n通常，当一个突出的数学问题长期悬而未决时，这是因为数学家只是缺乏解决它所需的技术。尽管你可能梦想着飞向月球，但除非有人发明火箭，否则你是不会到达那里的。\n但事实证明，这个问题是不同的。“这项技术至少已经有40年的历史了，”齐默尔曼说。\n迪米特罗夫把一个关于多项式的根的大小的问题转化为一个关于与一个被称为幂级数的相关但不同类型的数学对象相关的值的大小的问题。幂级数就像一个多项式，只是有无限多项。\n芝加哥大学的弗兰克·卡莱加里(Frank Calegari)在电子邮件中说：“就像数学中经常发生的那样，关键的洞察力/突破是将两个看似不同的问题联系起来。”\n数学家习惯于在多项式和幂级数之间轻松地移动，并利用其中一个的性质来建立另一个的性质-但在迪米特罗夫之前的数学家们并没有想过用这种对应来解决辛泽尔-扎森豪斯猜想(Schinzel-Zassenhaus Conjection)。\n为了证明他想要证明的关于多项式的东西，迪米特罗夫需要相关的幂级数有一个特定的、本质的性质：所有的系数都需要是正整数或负整数(所以没有分数)。当迪米特罗夫开始这项工作时，没有明显的方法来保证这一点会发生。\n但在2019年11月，迪米特罗夫在“浏览代数组合学的几本书和几篇论文”时，意识到有一种方法可以拼凑出几个众所周知的定理，从而在非割圆多项式及其幂级数之间产生正确的关系。他取了一个非割圆多项式，找出它的根，把这些根提升到不同的幂，乘在一起，然后取那个乘积的平方根。然后，最后，基于这个平方根，他可以构造一个具有本质性质的幂级数。\n迪米特罗夫说：“我们取该产品的平方根，这对我来说是一个令人惊讶的把戏。”这一切都是如此出人意料和有益，以至于迪米特罗夫称这一事实是一个“小小的奇迹”。这使得他的证据中的下一步成为可能。\n迪米特罗夫证明了幂级数的系数是整数。它们在某种意义上总是“大”的--它们必须至少是1。正因为如此，与幂级数相关的其他值--它的“汉克尔行列式”--也必须很大。通过一系列仔细的论证，他证明了如果系数是整数，并且Hankel行列式很大，那么他开始的非割圆多项式的根之一也一定是大的。证明的大部分工作都是在严格地证明这种联系。\n“暗示系数不小意味着迪米特罗夫在寻找什么，这是相当微妙的。这不是直接推断出来的，“比萨Scuola Normen Superiore的翁贝托·赞尼尔(Umberto Zannier)说。\n迪米特罗夫证明了所有非分圆多项式的根必须至少是log2除以单位圆外多项式的次数的4倍，即(Log2)/(4d)。迪米特罗夫的结果符合Schinzel和Zassenhaus的预测，即距离是某个常数除以多项式的次数的函数。他找到了一种新颖的方法来组合数学家手头上已经有的工具，从而做到了这一点。\n赞尼尔说：“他发明了完全隐藏的证据模式。”“这些碎片已经被证实了，但这些碎片所依据的理论与辛泽尔-扎森豪斯毫无关系。”\n迪米特罗夫的证明解决了数论中关于多项式中出现的模式的主要问题之一。未来的工作可能会调整迪米特罗夫提出的比率。确切的值可能是分子中的log3，分母中多项式次数的5倍。但是对于数学家来说，常量的精确数值只是一个技术问题。比例是最重要的，从这个意义上说，迪米特罗夫准确地证实了辛泽尔和扎森豪斯的预测。\nBreuillard说：“这个结果非常清脆，这是可能的最好结果。”“不会有比现在更好的了。”\n更正：2020年5月14日，本文的前一个版本错误地陈述了Schinzel-Zassenhaus猜想的一个含义。这篇文章已作了相应的修改。", "note_en": "In the physical world, objects often push each other apart in an orderly way. Think of the symmetric designs formed by iron filings under the influence of a magnetic field, or the even spacing of parkgoers practicing social distancing.\n When mathematicians look at the number line, they see the same type of trend. They look at the tick marks denoting the positive and negative counting numbers and sense a kind of numerical force holding them in that equal spacing. It’s as though, like mountain lions with their wide territories, integers can’t exist any closer together than 1 unit apart.\n The spacing of the number line is the most basic example of a phenomenon found throughout the field of number theory. It crops up in the study of prime numbers and in the relationships between solutions to different types of equations. Mathematicians can better understand these important values by quantifying the force that acts between them.\n “Things with number-theoretic significance tend to push each other apart. The name for this is a repulsion principle,” said  Jacob Tsimerman of the University of Toronto. “We try to obtain repulsion principles and use them to get various other results.”\n A lot of important work in number theory has to do with the way a repulsion principle influences polynomials, collections of coefficients and variables raised to powers. And for decades, mathematicians have been trying to pin down the exact magnitude of the repulsion in this setting.\n In a proof posted  online in late December,  Vesselin Dimitrov of the University of Toronto finally did it.\n “It is truly spectacular,” said  Péter Varjú of the University of Cambridge over email. “Vesselin’s idea is completely new, and it is beautiful.”\n The problem Dimitrov solved, known as the Schinzel-Zassenhaus conjecture, is about the geometry of values of polynomials. It predicts that when you graph certain values, they’ll be spread out in an exact way, looking as if they’re pushing each other apart. Dimitrov’s work exactly quantifies this spreading out, proving the conjecture true. It also provides new insight into the laws that numbers seem to obey.\n “This result plants a flag in the ground in terms of our understanding of algebraic numbers,” Tsimerman said.\n  When studying polynomials, mathematicians are especially interested in their “roots,” the values of a variable that make the polynomial equal zero. A polynomial has as many roots as its degree, or the value of its largest exponent. So  x 2 − 4 has two roots (2 and −2), while  x 5 − 7 x 3 + 2 x 2 − 4 x − 9 has five roots.\n Mathematicians want to know how the roots of a polynomial relate to each other. For example, when graphed, the roots of some polynomials fall exactly on the vertices of regular polygons — they stand apart by an exact geometric length. Mathematicians are interested in finding other, more subtle geometric relationships between roots.\n “What kinds of patterns can you get? Can you get any patterns, or are the patterns somewhat restricted?” said  Emmanuel Breuillard of Cambridge.\n The problem that Dimitrov solved involves the roots of a particularly important family of expressions called the cyclotomic polynomials. These polynomials can’t be factored into smaller ones, but you can use them to build other polynomials — they’re like the elements in a periodic table of polynomials. The first and simplest cyclotomic polynomial is  x − 1, and the second is  x + 1. The tenth is  x 4 −  x 3 +  x 2 −  x + 1. Unlike the periodic table, however, the list of cyclotomic polynomials goes on forever.\n The roots of cyclotomic polynomials follow a very special geometric pattern. To see it, start with the empty complex plane, in which the  x-axis plots real numbers and the  y-axis plots imaginary ones. Then inscribe a circle with a radius of 1 around the origin. This is the unit circle. The roots of cyclotomic polynomials all lie on this circle. They bear an elegant name: “roots of unity.”\n  But most polynomials are non-cyclotomic, and their roots are not roots of unity. This is the case with almost any combination of coefficients, variables and exponents you could come up with.\n In 1965,  Andrzej Schinzel and  Hans Zassenhaus predicted that the geometry of the roots of cyclotomic and non-cyclotomic polynomials differs in a very specific way. Take any non-cyclotomic polynomial whose first coefficient is 1 and graph its roots. Some may fall inside the unit circle, others right on it, and still others outside it. Schinzel and Zassenhaus predicted that every non-cyclotomic polynomial must have at least one root that’s outside the unit circle and at least some minimum distance away.\n Or, to put the Schinzel-Zassenhaus conjecture in terms of repulsion, it predicted that the smallest roots of a non-cyclotomic polynomial — which might fall within the unit circle — effectively push other roots outside the unit circle, like magnets pushing each other away.\n “You can think of the roots of a polynomial as negatively charged particles that repel each other with a force that decays when the distance increases,” Breuillard said.\n The Schinzel-Zassenhaus conjecture even defined exactly how strong that repulsive force should be. “It says there’s a very precise, quantifiable sense in which the roots can’t all be very close to the unit circle,” Tsimerman said.\n  The conjecture’s main prediction has the feel of a physics equation. It says every non-cyclotomic polynomial should have at least one root that is outside the unit circle by a distance equal to a constant number divided by the degree of the polynomial. The exact value of that constant is not critical, so for the sake of an example, say it’s 0.1. If we had a non-cyclotomic polynomial of degree 23, the conjecture predicts that it should have a root at least .1/23 outside the unit circle.\n It’s a powerful statement, but for decades mathematicians only managed to confirm weaker versions of the conjecture’s prediction.\n Schinzel and Zassenhaus themselves proved that every non-cyclotomic polynomial has a root at least 1 over 4 raised to the degree of the polynomial (1/4  d) outside the unit circle. This distance is much smaller than the conjectured one due to the presence of an exponent in the denominator.\n Over the next three decades mathematicians made a series of improvements on Schinzel and Zassenhaus’ work, but the progress remained incomplete. Mathematicians thought the correct distance should be one size, but they could only prove it was at least some smaller size. Mathematicians had no idea how hard the Schinzel-Zassenhaus conjecture would be to solve, assuming it could even be solved at all.\n “One never ultimately knows at the outset how simple or complicated [a problem’s] solution will turn out to be — until that solution is found,” said Dimitrov over email.\n  Often when a prominent math problem remains open for a long time, it’s because mathematicians simply lack the techniques required to solve it. Dream as you might of flying to the moon, you’re not getting there until someone invents a rocket.\n But as it turned out, this problem was different. “The technology has been around for at least 40 years,” Tsimerman said.\n Dimitrov transformed a question about the size of roots of polynomials into a question about the size of values associated to a related but different type of mathematical object called a power series. A power series is like a polynomial, only with infinitely many terms.\n “As often happens in mathematics, the key insight/breakthrough was to connect two seemingly different problems,” said  Frank Calegari of the University of Chicago over email.\n Mathematicians are accustomed to moving easily between polynomials and power series and using properties of one to establish properties of the other — but mathematicians before Dimitrov didn’t think to use this correspondence to address the Schinzel-Zassenhaus conjecture.\n To prove what he wanted to prove about polynomials, Dimitrov needed the related power series to have a specific, essential property: All the coefficients needed to be positive or negative whole numbers (so no fractions). And when Dimitrov started this work, there was no obvious way to guarantee that would happen.\n But in November 2019, while “browsing through a few books and papers in algebraic combinatorics,” Dimitrov realized there was a way to cobble together a few well-known theorems to produce the right relationship between a non-cyclotomic polynomial and its power series. He took a non-cyclotomic polynomial, found its roots, raised those roots to different powers, multiplied them together, then took the square root of that product. Then, finally, based on that square root, he could construct a power series with the essential property.\n “This was a surprising trick to me, that we take the square root of that product,” said Dimitrov. It was all so unexpected and helpful that Dimitrov calls the fact that it works a “small miracle.” This enabled the next steps in his proof.\n Dimitrov proved that the coefficients of the power series are whole number integers. These are always “large” in a sense — they must be at least 1. Because of this, other values related to the power series — its “Hankel determinants” — also have to be large. Through a careful chain of argument, he proved that if coefficients are whole number integers and the Hankel determinants are large, then one of the roots of the non-cyclotomic polynomial he began with must also be large. Much of the work of the proof was in rigorously proving that connection.\n “The implication that the coefficients being not small implies what Dimitrov is seeking is quite subtle. It is not something that’s deduced in a direct way,” said  Umberto Zannier of Scuola Normale Superiore in Pisa.\n Dimitrov proved that all non-cyclotomic polynomials must have a root that’s at least log 2 divided by four times the degree of the polynomial outside the unit circle; that is, (log 2)/(4 d). Dimitrov’s result fulfills Schinzel and Zassenhaus’ prediction that the distance is a function of some constant value divided by the degree of the polynomial. And he did it by finding a novel way to combine tools that mathematicians already had on hand.\n “He invented the pattern of the proof, which was completely hidden,” said Zannier. “The pieces were already proved, but these pieces were lying in theories which a priori had nothing to do with Schinzel-Zassenhaus.”\n  Dimitrov’s proof solves one of the main problems in number theory about the patterns that appear within polynomials. Future work may tweak the ratio Dimitrov came up with. It’s possible that the exact values are, say, log 3 in the numerator and five times the degree of the polynomial in the denominator. But to mathematicians, the exact value of the constants is just a technicality. It’s the proportions that matter most, and in that sense, Dimitrov has precisely confirmed Schinzel and Zassenhaus’ prediction.\n “This result is very crisp and it’s the best possible result,” Breuillard said. “It’s not going to get any better than this.”\n Correction : May 14, 2020  A previous version of this article misstated one of the implications of the Schinzel-Zassenhaus conjecture. The article has been revised accordingly.", "posttime": "2020-05-16 01:12:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测量,measures,多项式", "title": "数学家测量多项式中的排斥力", "title_en": "Mathematician Measures the Repulsive Force Within Polynomials", "transed": 1, "url": "https://www.quantamagazine.org/new-math-measures-the-repulsive-force-within-polynomials-20200514/", "via": "", "real_tags": ["测量", "measures", "多项式"]}, {"category": "", "categoryclass": "", "imagename": "1aeb07306b3f82b3c21f0c9493a52f9a.jpg", "infoid": 1002265, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按：“经济学人”正在向我们的每日通讯“今日经济学人”的读者免费提供一些关于冠状病毒大流行的最重要的报道。要接收它，请在这里注册。有关我们的冠状病毒跟踪器和更多报道，请参阅我们的中心。\n在危机中速度更快。面对冠状病毒，疫苗制造商正在尽可能安全地偷工减料。抗病毒药物正在仓促进入临床试验。即便如此，还需要几个月的时间才能有任何东西可用。据记录，有29.7万人死亡，等待是痛苦的。但谨慎是至关重要的。医学史上充满了充满希望的治疗方法，经过测试，这些方法都不起作用，甚至造成伤害。\n许多政府希望拯救能更早到来，因为智能手机上有联系人追踪应用程序-尽管苹果和谷歌对这项技术的控制正在酝酿着一场争吵。这些应用程序可以用来自动化追踪与那些被诊断为冠状病毒感染者有过接触的人的艰难过程，这对跟踪病毒至关重要。从巴林和保加利亚到印度尼西亚和冰岛等国都开发了这样的应用程序。\n它们是一个很有吸引力的想法。然而，接触追踪应用程序也是一项未经测试的医学发明，将在没有新药受到的那种保障的情况下推出。不准确的信息可能会误导卫生官员和公民，其危害可能与任何失败的药物一样严重。政府应该谨慎行事。\n覆盖面是一个复杂的问题。流行病学家估计，如果大约60%的人使用应用程序，它们可能会很有用。然而，即使在普及率最高的欧洲，也只有76%的人拥有移动互联网订阅服务。这一数字在老年人中较低，老年人最容易受到冠状病毒的影响。最近的一项调查显示，只有不到一半的美国人会使用接触者追踪应用程序。\n准确性也是一个问题。这类应用程序旨在监听附近的手机，如果另一台设备足够近，就会注册联系人。然而，用来做到这一点的无线电信号的强度除了受距离的影响外，还受各种因素的影响。例如，人体会阻碍传输，这意味着口袋里的手机和手中的手机会有不同的表现。\n这可能会使校准系统变得困难-而一个错误将会产生后果。太敏感了，你就会冒着“假阳性”泛滥的风险：被认为是密切而重要的、实际上是遥远而无关紧要的接触。过于宽容，真正的病毒传播病例将不会被发现。\n此外，这些应用程序本身可能会改变人们的行为。一款过度安心的应用程序可能会刺激人们在安全之前出门。出于医疗原因和公民自由，必须权衡隐私和透明度。韩国公布了其接触追踪器发现的病例的详细摘要。最近病例的跃升与一名光顾同性恋夜总会的男子有关。由此产生的仇视同性恋的谩骂之流可能会阻止其他人与当局合作，无论是电子方式还是其他方式。\n包括英国、法国和德国在内的一些政府的努力因苹果和谷歌而变得复杂，这两家公司共同控制着地球上几乎每一部智能手机。这些公司已经将隐私作为优先事项，认为用户将是匿名的，信息将主要存储在设备上，而不是上传到中央存储库。这激怒了许多官员。他们说，集中化提供了优势。无论如何，硅谷的程序员为什么要否决医学专家和民选官员的决定呢？\n一般来说，政府担心科技巨头不负责任的权力是正确的。不过，在这种情况下，谷歌和苹果的谨慎做法是明智的。在大流行中，实验新的公共卫生应对措施，如大规模监测，应该谨慎行事，以防随后被证明有令人讨厌的副作用。有了高科技软件，谨慎就像药丸和药水一样有价值。。\n深入挖掘：有关冠状病毒大流行的最新报道，请注册我们的每日时事通讯“今日经济学人”，或访问我们的冠状病毒跟踪器和故事中心。\n这篇文章发表在印刷版的领袖栏目，标题为：第一，不伤害；", "note_en": "Editor’s note: The Economist  is making some of its most important coverage of the covid-19 pandemic freely available to readers of The Economist Today , our daily newsletter. To receive it, register  here. For our coronavirus tracker and more coverage, see our  hub\n E  faster in a crisis. Faced with covid-19, vaccine-makers are cutting as many corners as they safely can. Anti-viral drugs are being rushed into clinical trials. Even so, it will be months until anything is available. With 297,000 people recorded dead, the wait is agonising. But caution is crucial. Medicine’s history is full of promising treatments that, when tested, turned out not to work or even to cause harm.\n  Many governments hope salvation can come sooner, with contact-tracing apps on smartphones—even as a row brews over Apple’s and Google’s grip on the technology. These apps can be used to automate the difficult process of tracking down people who have been in contact with those diagnosed with covid-19, which is vital for keeping tabs on the virus. Countries from Bahrain and Bulgaria to Indonesia and Iceland have developed such apps.\n They are an attractive idea. Yet contact-tracing apps are also an untested medical invention that will be introduced without the sort of safeguards that new drugs are subjected to. Inaccurate information can mislead health officials and citizens in ways that can be as harmful as any failed drug. Governments should proceed with care.\n Coverage is one complication. Epidemiologists reckon that apps might be useful if around 60% of people use them. Yet even in Europe, where adoption is highest, only 76% of people have mobile-internet subscriptions. That number is lower among the elderly, the most vulnerable to covid-19. A recent survey suggested less than half of Americans would use a contact-tracing app.\n Accuracy is an issue, too. Such apps are designed to listen out for nearby mobile phones, registering a contact if another device comes close enough. Yet the strength of the radio signals used to do this is affected by all sorts of things besides distance. Human bodies impede transmission, for instance, meaning a phone in a pocket will behave differently from one in a hand.\n That could make it hard to calibrate the system—and a mistake would have consequences. Too sensitive, and you risk a deluge of “false positives”: contacts deemed close and significant that were actually distant and irrelevant. Too forgiving, and genuine cases of viral transmission will go undetected.\n Moreover, the apps themselves might change behaviour. An over-reassuring app could spur people to go out before it is safe. Privacy must be weighed against transparency, for medical reasons as well as for civil liberty. South Korea publishes detailed summaries of cases uncovered by its contact-tracers. A recent jump in cases was linked to a man who visited gay nightclubs. The resulting stream of homophobic invective could deter others from co-operating with the authorities, electronically or otherwise.\n The efforts of some governments, including those of Britain, France and Germany, have been complicated by Apple and Google, which between them hold sway over almost every smartphone on the planet. The firms have made privacy a priority, deeming that users will be anonymous and information stored mostly on devices rather than uploaded to central repositories. That has infuriated many officials. Centralisation offers advantages, they say. And in any case, why should coders in Silicon Valley overrule decisions made by medical experts and elected officials?\n  As a rule, governments are right to worry about the unaccountable power of the tech giants. In this case, though, Google’s and Apple’s cautious approach is sensible. In a pandemic, experimenting with novel public-health responses such as mass surveillance should be done carefully, in case it subsequently turns out to have nasty side-effects. With high-tech software, caution is as valuable as it is with pills and potions.  ■\n Dig deeper: For our latest coverage of the covid-19 pandemic, register for  The Economist Today, our daily  newsletter, or visit our  coronavirus tracker and story hub\n This article appeared in the Leaders section of the print edition under the headline &#34;First, do no harm&#34;", "posttime": "2020-05-16 01:12:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,app,联系人,rely,冠状病毒", "title": "不要依赖联系人跟踪应用程序", "title_en": "Don’t rely on contact-tracing apps", "transed": 1, "url": "https://www.economist.com/leaders/2020/05/16/dont-rely-on-contact-tracing-apps", "via": "", "real_tags": ["程序", "app", "联系人", "rely", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002264, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您知道您可以在Makefile中更改shell吗？这是真的。我在尝试通过设置shell来使用bash而不是默认的/bin/sh时发现了这一点。\n.ONESHELL：bash：shell：=bash bash：#注意：需要双美元符号，因为make替换$Variables export greeting=&#34；‘hola&#34；echo&#34；$${greeting}，bash！&#34；\n还有什么是可能的呢？我可以使用其他编程语言作为shell吗？可以在Makefile中编写内联Python吗？\n请注意，正在设置变量.ONESHELL。通常，让willevaluate在单独的shell中计算每个命令的值，这意味着在本例中，问候语将在第二行中未定义。按照姓氏以Davis-*开头的其他人的建议，将.ONESHELL添加到Makefile的顶部，并撰写有关make的博客，会导致make指令中的多行代码在对Python的单个调用中求值。\n将R内联写入Makefile怎么样？请注意添加的.SHELLFLAGS。默认情况下，make运行shell-c&#34；您的\\n脚本，\\n此处&#34；与R不兼容。要从R中的命令内联运行脚本，可以使用-e：\n现在，您可以编写将R和Python语言组合到单个文件🎉中的管道。\n数据分析管道通常具有冒险的用户依赖性。Docker让这一切变得容易得多，但是编写docker run…可能会很麻烦。如果我们可以让Docker也作为解释器和写命令在容器内以内联方式执行，会怎么样？\ndocker：.SHELLFLAGS=run--volume$(Shell Pwd)：/workdir--rm--workdir/workdir--entry point/bin/bash ubuntu-c docker：shell：=docker docker：echo&#34；hello，$$(uname-a)！&#34；\n再说一次，这是可能的。运行make docker将运行ECHO.。在运行Ubuntu的Dockertainer中。请注意--volume标志，它将挂载当前工作目录作为容器的工作目录，这意味着可以在您的本地文件系统和容器的本地文件系统之间读取/创建文件。所以构建构件可以在make指令之间共享。\n您好，Linux 453c728113d6 4.19.76-linuxkit#1 SMP Fri Apr 3 15：53：26 UTC 2020 x86_64 GNU/Linux！\n这是一次实验，目的是看看Make能做些什么。但它的动机是一个现实世界的问题：我经常需要组合跨编程语言和环境的工具来运行数据分析管道。我喜欢把事情自动化，Make是这样做的一个很好的工具。将所有内容内联起来更具可读性，并且将所有内容都放在一个文件中意味着我必须在更少的选项卡之间跳转才能理解管道本身。\n编写在Docker中执行的命令的能力意味着我不必花费更少的时间来弄清楚如何将一堆依赖项安装到单个容器中，这会随着依赖项数量的增加而变得越来越困难(特别是如果你在生物信息学工作的话)。\n注意：其中一些功能只适用于Make 4.+，这是我使用Homebrew安装的。这些示例在使用MacOS Catalina附带的make 3.x时不起作用。\n.ONESHELL：.SILENT：main：\\Python\\ruby\\R\\bash\\docker docker：.SHELLFLAGS=run--rm--entrypoint/bin/bash ubuntu-c docker：shell：=docker docker：echo&#34；hello，$$(uname-a)！&#34；python：shell：=python3 python：greeting=&#34；hello&#34；print(f&#。)ruby：.SHELLFLAGS：=-e ruby：shell：=ruby ruby：greeting=&#34；laba&#34；put&#34；#{greeting}，ruby！&#34；R：.SHELLFLAGS：=-e R：shell：=Rscript R：greeting=&#34；bonjour&#34；message(paste0(greeting，&#34；，R！&#34；))bash：.。*您好&#34；echo&#34；$${greeting}，bash！&#34；", "note_en": "Did you know that you can change the shell in a  Makefile? It’s true. I foundthis out when trying to use bash instead of the default  /bin/sh by setting SHELL.\n .ONESHELL : bash :  SHELL := bash bash :\t # note: the double dollar-sign is required because Make substitues $variables\t export  greeting = &#34;¡hola&#34;\t echo  &#34; $ ${greeting} , bash!&#34;\n  What else is possible? Can I use other programming languages as the shell? Isit possible to write in-line Python in a  Makefile?\n     Notice that there is a variable  .ONESHELL being set. Normally,  make willevaluate each command in a separate shell meaning that, in this example, greeting would be undefined in the second line. Adding  .ONESHELL to the topof your  Makefile, as recommended by  someone else whose last name begins withDavis-* and blogs about  make,causes multi-line code in the Make directive to be evaluated in a single callto Python.\n  What about writing R in-line in a Makefile? Note the addition of  .SHELLFLAGS.By default,  make runs  SHELL -c &#34;your\\nscript\\nhere&#34; which is not compatibleR. To run a script in-line from a command in R, you use  -e:\n   Now you can write a pipeline that combines R and Python in a single file 🎉\n  Data analysis pipelines often have adventurousdependencies. Docker made all of that a lot easier but writing  docker run ...can be cumbersome. What if we could make Docker the interpreter and writecommands to be executed inside the container in-line as well?\n docker :  .SHELLFLAGS = run --volume $(shell pwd):/workdir --rm --workdir /workdir --entrypoint /bin/bash ubuntu -c docker :  SHELL := docker docker :\t echo  &#34;hello,  $$ (uname -a)!&#34;\n Again, this is possible. Running  make docker will run  echo ... in a Dockercontainer running Ubuntu. Note the  --volume flag which will mount the currentworking directory as the container’s working directory meaning that files canbe read/created between your local filesystem and that of the container. Sobuild artifacts can be shared between make directives.\n hello, Linux 453c728113d6 4.19.76-linuxkit #1 SMP Fri Apr 3 15:53:26 UTC 2020 x86_64 x86_64 x86_64 GNU/Linux!\n  This started as an experiment to see what is possible with  make. But it wasmotivated by a real world problem: I often need to combine tools acrossprogramming languages and environments to run data analysis pipelines. I liketo automate things and  make is a great tool for doing so. Having everythingin-line is more readable and having everything in a single file means that Ihave to jump between fewer tabs to understand the pipeline itself.\n The ability to write commands that get executed in Docker means that I have tospend less time figuring out how to get a bunch of dependencies installed in asingle container which becomes increasingly difficult as the number ofdependencies increases (especially if you work in Bioinformatics).\n  note: Some of these features only work on  make 4.+ which I installedusing  Homebrew. These examples do not work using  make 3.xwhich is comes with macOS Catalina.\n .ONESHELL : .SILENT : main : \\ \tpython \\ \truby \\ \tR \\ \tbash \\ \tdocker docker :  .SHELLFLAGS = run --rm --entrypoint /bin/bash ubuntu -c docker :  SHELL := docker docker :\t echo  &#34;hello,  $$ (uname -a)!&#34; python :  SHELL := python3 python :\tgreeting  =  &#34;hello&#34;\tprint (f &#34;{greeting}, python!&#34; ) ruby :  .SHELLFLAGS := -e ruby :  SHELL := ruby ruby :\tgreeting  =  &#34;labas&#34;\tputs  &#34;#{greeting}, ruby!&#34; R :  .SHELLFLAGS := -e R :  SHELL := Rscript R :\tgreeting  =  &#34;bonjour&#34;\tmessage (paste0 (greeting,  &#34;, R!&#34; )) bash :  .SHELLFLAGS := -euo pipefail -c bash :  SHELL := bash bash :\t export  greeting = &#34;¡hola&#34;\t echo  &#34; $ ${greeting} , bash!&#34;", "posttime": "2020-05-16 01:11:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生成,polyglot,shell", "title": "多语言生成文件", "title_en": "Polyglot Makefiles", "transed": 1, "url": "http://agdr.org/2020/05/14/Polyglot-Makefiles.html", "via": "", "real_tags": ["生成", "polyglot", "shell"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002263, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "處理這個邀請時發生問題，我們正盡快修復.", "note_en": "處理這個邀請時發生問題，我們正盡快修復。", "posttime": "2020-05-16 01:11:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "语音,efficient,發生", "title": "部署在CPU上的高效实时文本语音转换系统", "title_en": "A highly efficient, real-time text-to-speech system deployed on CPUs", "transed": 1, "url": "https://ai.facebook.com/blog/a-highly-efficient-real-time-text-to-speech-system-deployed-on-cpus/", "via": "", "real_tags": ["语音", "efficient", "發生"]}, {"category": "", "categoryclass": "", "imagename": "d435bb146262405ab20396b9bba1db4c.png", "infoid": 1002262, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年可能是“桌面Linux”的一年，国内有如此多的工程师希望为开源项目做出贡献。\n让我们先来看看目前前四个发行版的桌面碎片有多深：\n根据上面的列表，我们有四个发行版和十几种桌面环境的总体风格！\n开发人员资源的碎片化是这个问题的核心，这些资源已经受到限制，并依赖于核心工作之外的奉献精神。来自单一实体的整合、重点和方向可以真正以桌面Linux的质量和精致推动发展。\n要让团队发挥作用，开发人员需要感觉自己是英雄。他们想要和用户一样的东西，他们是用户，他们从一开始就是“唯一”的用户。在某个阶段，他们决定参与进来，并开始投入时间、精力和情感来改进我们的项目。他们最需要的是支持和幸福。他们需要反馈和信息来理解错误或功能请求，当他们完成实现时，他们需要感觉到自己是英雄，他们确实是这样做的，这是他们真正在这里的部分原因。\n我可以向他们展示上个月有500人捐款，我可以转发电子邮件给团队，人们告诉我他们有多喜欢Linux Mint，我可以告诉他们他们正在发挥作用，但没有什么比直接与快乐的用户互动，看到第一手的人对你的工作感到高兴更好的了。我们的社区如何与我们的开发人员互动，对于他们的工作、他们的快乐和他们的动力来说都是关键。-克莱门特·勒菲博尔(Clement Lefebvre)，Linux铸币项目负责人。\nFlatpak已经开始向应用程序的单一分发机制这个方向迈进，但有人可能会说，这是碎片化的双重产物。\n在Chromebook和虚拟化/Web应用的世界里，定制和多种口味的需求正在减少-我们很好地保持了浏览器的平稳运行。", "note_en": "This could be the year for “Desktop Linux” with so many engineers at home looking to  contribute to open source projects.\n  Let’s start by looking at how deep the desktop fragmentation goes with  just the  top four distributions at this time:\n  Given the list above we have a four distributions and more than a dozen total flavours of a desktop environment!\n The fragmentation of developer resources which are already  constrained and rely on dedication outside of their core employment is central to this issue. Consolidation, focus and direction from a single entity  could really move the needle with the quality and polish of desktop linux.\n For a team to work, developers need to feel like heroes. They want the same things as users, they are users, they were “only” users to start with. At some stage they decide to get involved and they start investing time, efforts and emotions into improving our project. What they’re looking for the most is support and happiness. They need feedback and information to understand bugs or feature requests and when they’re done implementing something, they need to feel like heroes, they literally do, that’s part of the reason they’re here really.\n I can show them 500 people donated money last month, I can forward emails to the team where people tell me how much they love Linux Mint, I can tell them they’re making a difference but there’s nothing like interacting directly with a happy user, seeing first-hand somebody be delighted with what you worked on. How our community interacts with our developers is key, to their work, to their happiness and to their motivation. — Clement Lefebvre, leader of the Linux Mint project.\n Flatpak have started the initiative to move in this direction of single distribution mechanism for apps, but one could argue this is a biproduct of fragmentation.\n In a world of Chromebooks and virtualized/web apps, the need for customization and multiple flavours is dwindling — we are good with the browser running smoothly.", "posttime": "2020-05-16 01:10:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,桌面", "title": "桌面Linux-单个发行版的情况", "title_en": "Desktop Linux – The Case for a Single Distro", "transed": 1, "url": "https://medium.com/@robsandhu/desktop-linux-the-case-for-a-single-distro-2dac8b2b8c8e", "via": "", "real_tags": ["linux", "桌面"]}, {"category": "", "categoryclass": "", "imagename": "f48afa019cf540f0f8cacd12dd6c57bb.jpeg", "infoid": 1002261, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如今，GraphQL无处不在。从Facebook最初对GraphQL的使用，到一些更时髦的用途，比如数据库，GraphQL受到了如此多的开发人员的喜爱，以至于我们开始在最初没有人会想到的领域使用GraphQL。\n每种技术都有它理想的用例，它可以工作的用例，它完全不适合的用例，以及介于两者之间的所有用例。作为开发人员，我们希望为这项工作选择合适的工具，这意味着了解我们的用例，并考虑哪些技术可能最适合它。这包括技术本身的特性，但也包括我们对它的熟悉程度、它周围的社区等等。\n最近，我花了一些时间思考GraphQL最闪亮的地方。我们可以称它为“图形甜蜜点”。\n任何接近中间的东西都是我认为GraphQL最合适的地方。至于圈子的外部，我认为GraphQL可以使用，但也许它并没有从同样的优势中受益。也许我们可以把它看作是不同的层次。\n在我们探讨这些层次之前，让我先说清楚一点：即使GraphQL的某些用法超出了所谓的“甜蜜点”，也不意味着它们是完全无效的，它主要意味着您可能会得到更少的好处，或者必须投资更多的工具来使其更合适。这也可能意味着我刚刚落后于时代；)。\nGraphQL的第一层使用案例是将其用作支持多个客户端的内部API。这是Facebook最初的用例，我们可以预期GraphQL会针对它进行优化。那么，那个用例到底是什么呢？\n我们对我们希望在应用程序中使用的数据与它们所需的服务器查询之间的差异感到沮丧。[来源]。\n在GraphQL之前，丹尼尔·雅各布森(Daniel Jacobson)也强调了类似的担忧。丹尼尔的文章仍然是我最喜欢的一些文章：\nRESTAPI非常擅长以通用方式处理请求，它建立了一组规则，允许大量已知和未知的开发人员轻松使用API提供的服务。\n在这个模式中，每个人都知道如何行事，它可以是令人难以置信的强大。API提供者建立了一组规则，API使用者必须遵守这些规则才能从API获得他们想要的东西。太完美了，对吧？在许多情况下，答案显然是肯定的。但在其他情况下，随着我们的世界规模扩大，人们消费数字内容和服务的方式数量继续扩大，这种一刀切的模式可能会达不到要求。[来源]。\n在这两种情况下，GraphQL都可以被视为解决API提供者和客户成长烦恼的一种解决方案，因为当用例由一刀切的API提供支持，并试图被SSKD(用Daniel的话说，是为数不多的已知开发人员)所使用时，GraphQL可以被视为一种解决方案。\nGraphQL允许不同的客户端以不同的方式使用服务器的可能性，将服务器模式与客户端使用它的方式解耦。对我来说，这是你想要考虑选择GraphQL的主要原因。\n这意味着您在使用“一刀切”的API时确实有些困难。你可能不会。例如，如果您的API主要公开公共的、未经验证的静态数据，那么客户端的灵活性可能不值得失去网络缓存，也可能不需要GraphQL执行引擎的开销。\n如果我们处理具有易失性数据的经过身份验证的API，并且多个设备/客户端/UI以不同的方式使用它，我认为GraphQL是在公司规模上解决OSFA问题的一种很好的方法。让我们移到第二层去吧。\n第二层是认为GraphQL非常合理和良好的用法，但可能不是出于非常特定于GraphQL的原因。\n第一个示例是单个前端客户端通过API与GraphQL对话。如今，JAMStack风格的应用程序更加流行。\n对于单个客户端，不存在临时端点和管理特定于客户端的服务器端资源的问题。这些应用程序喜欢GraphQL，因为它不一定是独一无二的或与生俱来的东西：\n这些都是伟大的东西。我之所以将此使用上下文包括在第二层而不是第一层，是因为在单个客户端用例中，可能需要也可能不需要完整GraphQL平台的开销。\n我们上面列出的东西也不需要专门来自GraphQL。许多其他API样式允许您使用模式或API描述，其中一些风格有很好的工具，在设计API时，倾听客户端用例应该始终是最重要的。\n尽管如此，GraphQL仍然是一个很好的选择，因为它确实将许多这些优点结合在一起，成为一个伟大的、即用即用的软件包，并且所有这些都是明确规定的。与其他需要开发人员选择最佳工具、规范和最佳实践的API样式相比，正确使用GraphQL要容易得多。现在只有一个客户端并不意味着你以后不会遇到与支持多个内部客户端相关的问题，这将使采用GraphQL成为一种面向未来的好方法(不过，很难提前知道这些事情)。\n我认为属于第二层的另一个用例是公共GraphQL API。同样用Daniel Jacobson的话说，就是处理LSUD(大量未知开发人员)的API。一方面，GraphQL似乎非常适合这个用例。它使得处理大量不同的客户端用例比必须为所有这些用例构建定制资源或定制RPC调用要容易得多。事实上，我们可以将其视为允许任何客户端基于模式创建自己的服务器端资源。另一方面，当GraphQL在考虑到特定客户的情况下定义其可能性时，它会大放异彩。许多公共API必须保持更通用的东西，以允许这么多未知的客户端找到他们需要的东西，并发明我们从一开始就没有想到的东西。\n要使第三方开发人员能够构建有趣的集成，您需要设计一个API，该API不需要假设数据将如何使用。来源。\n虽然这无论如何都不会使GraphQL成为公共API的坏选择，但它确实意味着它迫使服务器以更通用的方式公开用例，这是GraphQL API在内部场景中通常试图避免的。话虽如此，到最后，正如我最近在推特上写的那样，如果客户喜欢处理GraphQL并要求第三方提供商提供它，那么GraphQL是否是完美的公共API可能甚至无关紧要。\n第二层是目前我们看到的GraphQL实现数量最多的地方。很可能是因为第一级环境是在项目/公司生命周期较晚的时候出现的问题。\n第三层用于有趣的用例，但我发现GraphQL与其他现有选项相比几乎没有优势。\n其中之一是服务到服务的通信。正如我在#34；中提到的，GraphQL是东西服务通信的最佳选择吗？&#34；，服务调用通常需要针对单个用例进行充分优化，而查询引擎的开销很少是值得的。当像GRPC、Twirp和Thrift这样的工具存在时，在我看来，您需要一个非常好的理由不使用这些经过验证的工具，而使用GraphQL。\n另一种是直接与数据库交互。开发人员喜欢GraphQL查询语言，但它从来没有打算成为一种通用的、功能强大的数据库查询语言。似乎很难为它辩护，而且它越来越受欢迎，开发人员也越来越熟悉它。\n同样，这并不意味着这些用例是完全无效的。即使在第三层，我们也可以明确决定使用GraphQL。这样做的好例子可能是一致性(已在其他领域使用GraphQL)、内部专业知识(团队是GraphQL方面的专家)，甚至是开发人员的幸福感。这些东西更难衡量，而且在很大程度上取决于特定的场景。\n那么，这一切的意义是什么呢？我认为我们的问题离GraphQL甜蜜点越远，我们就越需要思考为什么我们要选择它作为我们的选择工具。GraphQL虽然是一个非常强大的想法，但也带来了一些复杂性。理想情况下，我们希望这种复杂性成为我们明确做出的权衡，因为我们知道GraphQL以一种很好的方式解决了手头的问题。\n然而，令人惊讶的是，由于GraphQL作为单一规范带来了如此多的优势，它对许多人来说是一个有吸引力的选择，尽管有时并不需要它的核心属性。这是许多生态系统和社区可以学习的东西。\n如果你喜欢这篇文章，你可能会喜欢我刚刚发布的生产准备好的GraphQL书！", "note_en": "GraphQL is everywhere these days. From Facebook&#39;s original usage of it to some more funky usages like  databases, GraphQL is loved by so many developers that we are starting to use it in areas nobody would&#39;ve thought of initially.\n Every technology has its use cases for which it is ideal, for which it can work, for which it plain sucks, and everything in between. As developers, we want to pick the right tool for the job, which means understanding our use case and think about what tech might work best for it. This includes the features of the technology itself, but also how familiar we are with it, the community around it, and much more.\n I recently spent some time thinking about where GraphQL shines most. We could call it the  GraphQL &#34;Sweet Spot&#34;.\n  Anything close to the middle is where I think GraphQL is a perfect fit. Going towards the exterior of the circle, it&#39;s where I think GraphQL  can be used, but maybe it doesn&#39;t benefit from the same advantages. Maybe we can think of it as different &#34;tiers&#34;.\n Before we explore these tiers let me make something clearer:  even if certain usages of GraphQL are outside the so-called &#34;Sweet Spot&#34;, it doesn&#39;t mean they are completely invalid It mostly means you might get less of its benefits, or have to invest more tooling to make it more appropriate. It might also mean I&#39;m just behind the times ;).\n  Tier one use cases for GraphQL is using it as an  internal API for supporting  multiple clients. This is the original Facebook use case and we can expect GraphQL to be optimized for it. So what&#39;s that use case exactly?\n We were frustrated with the differences between the data we wanted to use in our apps and the server queries they required.  [Source]\n Pre-GraphQL, similar concerns were highlighted by  Daniel Jacobson. Daniel&#39;s articles are still some of my favorites out there:\n REST APIs are excellent at handling requests in a generic way, establishing a set of rules that allow a large number of known and unknown developers to easily consume the services that the API offers.\n In this model, everyone knows how to behave and it can be incredibly powerful. The API providers establish a set of rules and the API consumers must adhere to those rules to get what they want from the API. It is perfect, right? In many cases, the answer is obviously yes. But in other cases, as our world scales and the number of ways for people to consume digital content and services continues to expand, this one-size-fits-all model is likely to fall short.  [Source]\n In both these cases, GraphQL can be seen as a solution to growing pains API providers and clients have when the use cases are powered by a One-Size-Fits-All API and trying to be consumed by a SSKD (Small Set of Known Developers, in Daniel&#39;s words).\n GraphQL allows different clients to consume server possibilities in different ways, decoupling the server schema from how clients use it. To me, this is the main reason you would want to look into choosing GraphQL.\n This implies you  do have pains associated with a One-Size-Fits-All API. You might not. For example, if your API exposes mainly public, unauthenticated, static data,  maybe the client flexibility is not worth losing network caching and maybe the overhead of the GraphQL execution engine is not needed.\n If we deal with authenticated APIs with volatile data and multiple devices/clients/UIs consume it in different ways, I think GraphQL is a  great way to tackle the OSFA problem, at a company scale. Let&#39;s move on to tier two.\n  Tier two is what a consider very reasonable, and good usages of GraphQL, but maybe not for reasons that are very  specific to GraphQL.\n The first example is a  single frontend client talking GraphQL through an API. Even more popular these days with  JAMStack style applications.\n With a single client, the concerns of ad-hoc endpoints and managing client-specific server-side resources are not present. These applications love GraphQL for things that are not necessarily unique or inherent to it:\n  These are all great things. The reasons why I include this usage context in tier two and not tier one is that because in a single client use case, the overhead of a full GraphQL platform may or may not be needed.\n None of the things we listed above need to come from specifically from GraphQL either. A lot of other API styles allow you to use a schema or API description, some of them have great tools, and listening to client use cases should always be on the forefront when designing an API.\n With that said, what makes GraphQL still a great choice is that it does bring a lot of these advantages together as a great, ready-to-use package, and all of it is specified. It&#39;s a lot easier to do GraphQL the right way compared to some other API styles that require individual developers to pick the best tools, specifications, and best practices. Having a single client now also doesn&#39;t mean you don&#39;t expect to have the problems associated with supporting multiple internal clients later on, which would make adopting GraphQL a good way of future-proofing (It&#39;s hard to know these things ahead of time though).\n Another use case that I consider as tier two is a  public GraphQL API. In Daniel Jacobson&#39;s terms again, an API dealing with a LSUD (Large Set of Unknown Developers). On one end, GraphQL seems like the perfect fit for this use case.  It makes handling a ton of different client use cases much easier than having to build custom resources or custom RPC calls for all of them. In fact, we can kind of think of it as allowing any client to create their own server-side resources based on a schema. On the other end, GraphQL shines when it defines its possibilities with specific clients in mind. A lot of public APIs have to keep things more generic to allow so many unknown clients to find what they need and to invent things we did not think of in the first place.\n  To empower third-party developers to build interesting integrations, you need to design an API that makes no assumptions about how the data is going to be used.  Source\n While that does not make GraphQL a bad choice for a public API by any means, it does mean it forces the server to expose use cases in a more generic way, something that GraphQL APIs usually try to avoid in internal scenarios. With that said, in the end,  as I recently tweeted about, it might not even matter if GraphQL is the perfect public API or not if clients enjoy dealing with it and demand it from 3rd party providers.\n Tier two is where we see actually the most amount of GraphQL implementations these days. Most likely because the tier one context is a problem that comes much later in the life of a project/company.\n  Tier three is for interesting use cases but where I find GraphQL provides little to no advantages over other existing options.\n One of those is service-to-service communication. As I covered in  &#34;Is GraphQL a great choice for east-west service communication?&#34;, service calls often need to be quite optimized for a single use case, and the overhead of a query engine is rarely something that is worth it. When things like gRPC, Twirp, and Thrift exist, it seems to me you would need a very good reason to not use these proven tools and go with GraphQL.\n The other one is interacting directly with databases. Developers love the GraphQL query language, but it was never meant to be a generic, powerful query language for databases. It seems it is quite hard to make a case for it, besides the fact it is getting popularity and developers are getting more and more familiar with it.\n Again, this doesn&#39;t mean these use cases are completely invalid. Even at tier three we can make an explicit decision of using GraphQL. Good examples of reasons to do so might be for consistency (Using GraphQL already in other areas), internal expertise (The team are experts at GraphQL), or even developer happiness. Things that are harder to measure and will depend a lot on specific scenarios.\n  So what&#39;s the point of all this? I think the furthest away our problem is from the GraphQL Sweet Spot, the more we need to think about  why we want to pick it as our tool of choice. GraphQL, while a really powerful idea, brings some complexity along. Ideally we want that complexity to be a  tradeoff we explicitly make because we know GraphQL solves the problem at hand in a great way.\n It is amazing though, that because GraphQL brings so many advantages as a single specification, it is an attractive pick to many even though its core properties are sometimes not needed. Something many ecosystems and communities could learn from.\n If you&#39;ve enjoyed this post, you might like the  Production Ready GraphQL book, which I have just released!", "posttime": "2020-05-16 01:10:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "graphql,sweet", "title": "GraphQL的甜蜜点", "title_en": "The GraphQL Sweet Spot", "transed": 1, "url": "https://productionreadygraphql.com/blog/2020-05-14-sweetspot", "via": "", "real_tags": ["graphql", "sweet"]}, {"category": "", "categoryclass": "", "imagename": "5166fa751c231e3cf0309dc0c6464d3d.png", "infoid": 1002260, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即使人们没有听说过软件即服务(SaaS)，他们也很有可能使用过软件即服务(SaaS)。\n这就是SaaS在数字资产世界中如此强大的原因。\nSaaS业务模式的收入依赖于定期订阅。订户基本上是付费租赁托管在云中的软件。这意味着没有实体副本或许可协议，使客户能够难以置信地轻松访问您的服务。\n如果操作得当，投资者会喜欢SaaS商业模式。经常性的收入流使这种商业模式充满了黄金，这也是SaaS公司往往比大多数其他在线企业获得更高估值的主要原因。\nSaaS公司更难估值，因为它有更多的活动部件。我们的SaaS评估指南全面概述了应使用的评估方法。\n在这篇文章中，我们将把焦点缩小到定价模型，并讨论为什么这值得特别关注。\n拥有人们需要使用的产品创造了无限潜力的机会。无论是企业对企业(B2B)还是企业对客户(B2C)，SaaS业务模式都可以做到这一点。\n无论你的客户群是什么，总有一件事在他们的思想前沿…\n证明软件价格合理往往是阻止客户订阅的主要症结所在。如果你的服务刚进入市场，而且你还没有完全站稳脚跟，这一点尤其正确。\n让客户尽可能容易地看到你提供的服务的价值是一种强有力的说服策略。一些SaaS公司在其定价中提供“免费增值”级别，允许有限的免费使用。\n每个人都喜欢免费的东西。让这些客户走进这扇门，这样就更容易追加销售他们。这只是公司将实施的众多战略之一。\n把好的软件和好的营销结合起来，自然会提高你的利润。提高净利润是提高SaaS估值的头号途径。\n但选择正确的定价模式还有更多的事情要做，因为买家希望看到SaaS公司的运营是可持续的。\n定价结构是客户获取成本(CAC)和客户终身价值(LTV)的直接贡献者。这两个指标在决定您的业务是否成功方面都非常重要。\n虽然在企业开始交易后改变模式是可能的，但在第一次就把它弄对要容易得多。完全改变定价结构可能会疏远你已经拥有的客户。理想情况是低CAC和高LTV。这不仅是成功所需要的，也是让你的SaaS公司获得更高价格的原因。这两件事往往是齐头并进的。\n即使您现在还没有考虑出售SaaS业务，像出售一样实施操作程序也会帮助您取得成功。\n要度过初创阶段并进入高速增长阶段，人们需要签约成为付费客户。为了确保尽可能多的人这样做，尽早获得正确的定价模型是很重要的。有相当多的选择，我们的目标是看看哪一个最适合你。\n根据定义，软件是高度可定制的。这在设计、功能和特性方面打开了无限的可能性。\n当你把这一点与大量的营销技巧结合起来，就会产生令人难以置信的各种可能性。\n同样需要指出的是，由于这两个因素，对别人有效的方法可能不适用于你。定价结构应该在最大化利润和便于客户理解之间找到平衡。\n有了一个合理的模型，稍微调整价格就可以看到这对净利润、CAC、LTV和流失的影响。提高价格的想法对许多初创公司来说是一个令人望而生畏的想法。\nSaaS公司的使命目标应该是让人们的任务变得更容易。无论是使公司的营销渠道自动化，还是让会计服务的记账变得更容易。向用户证明你的价值就是让他们成为忠实的客户。\n如果你的软件帮助一家公司成长，那么拥有同样成长的定价模式可能是有益的。如果一家较大的公司需要使用更多的功能，那么向他们收取更高的费用是有意义的。如果他们赚的钱越多，那么他们就有可能愿意为质量支付更高的价格。\n拥有一家SaaS公司是一个不断听取用户反馈和实施更新的循环。这些更新改进了您的软件，从而增加了价值。\n2014年，当他们转向在线流媒体时，他们提供了被称为“标准”的单级定价，价格为7.99美元。随着用户群的增长，他们在更多的内容上进行了投资，并认为这证明了涨价是合理的。\n快进五年到2019年，他们现在提供三级定价，标准价格现在为12.99美元。\n在SaaS商业世界中，类似的例子比比皆是。不过，当然也有这样做效果不佳的情况。但是，通过倾听客户的意见并实施一种定价模式，让你和你的客户都能从中获得更多，这算得上是双赢。\n不再赘述，我们将深入讨论不同类型的定价模型，并讨论它们如何影响SaaS业务模式，进而影响估值。\n正如前面提到的，成立一家公司，就像你正在努力退出一样，通常会让事情运行得更顺利。早点进入这种思维方式比当你变得更加成熟时要有益得多。在早期阶段开始的客户通常会更加理解。随着用户的增加，事情变得更难改变。\n虽然不是严格意义上的定价模型，但我们认为将此作为讨论的一部分是很重要的。\n它经常与其他定价结构一起使用。例如，Basecamp是一款面向远程团队的项目管理和通信软件，它提供了“个人”级别。\n这个免费版本对项目数量、用户数量和存储空间都有限制。这使得客户，特别是来自小企业的客户，可以免费使用该软件。如果你相信这个软件会证明它对人们的价值，那么说服他们购买就变得更容易了。\n最基本的流行模式是统一费率定价。非常不言而喻的是，公司使用他们的服务将收取单次费用。\n这意味着每个支付订阅费的人都可以使用该软件提供的所有服务。这是一种一刀切的方法，把所有的客户都放在同一个计划上。\n该模型的简单性意味着它是最容易实现的。这是一种每个客户都会熟悉的格式。这与电子商务商店之间的唯一区别是，您的SaaS产品的客户不会为直接拥有该产品付费。取而代之的是，他们按月或按年付费，只要他们愿意，就可以使用该产品。\nBasecamp使用统一费率定价。每月支付99美元，你就可以完全访问他们的软件。\n这种方法的美妙之处在于它的简单性。人们很容易就能清楚地看到他们付钱的目的。他们不必担心做什么或不需要什么功能，因为它是作为一个包提供的。\n正因为如此，很多初创公司在刚开始的时候就使用这种模式。当您第一次将您的软件投放市场时，它可能还不是成品。还会有更多的想法在酝酿之中。有一些东西可以让你启动和运行，这可以说很多。\n大公司需要与当地小企业相同的功能吗？功能越多，价格就越高，这是很自然的，但要让客户满意就变得更加困难了。\n继续使用统一费率定价意味着你将错失利润。向不仅赚取更多利润，而且将使用更多软件的客户收取更高费用的能力成为一个挑战。\n分级定价的目的是为每个人提供一些东西。这是最受欢迎的型号之一，大多数人都会熟悉的。\n这就是公司根据您需要的功能数量提供不同定价的地方。它甚至可能从免费增值水平开始，然后通过不同的计划提高价格。\n实施这种定价模式的公司是搜索引擎优化工具Ahrefs。他们提供四种计划，从每月99美元的“精简版”开始，一直到每月999美元的代理版。\n尽管较低的定价可能看起来很贵，但Ahrefs将自己打造成了市场领先者之一，因此他们可以利用自己的品牌收取更高的价格。\n这个系统的好处是显而易见的。分级定价可以根据客户的需求创建套餐，从而使您的利润最大化。\n通常会看到三个级别的定价，低、中、高，但事实并非如此。可以根据与您的软件相关的内容来创建层。只有当层级没有通过易于理解的功能明确定义时，定价模型才会成为问题。\n在签约之前，人们会想知道他们的钱能得到什么。如果他们不能将自己归类到付款计划中，那么在他们有机会成为客户之前，你就有失去他们的风险。\n另一种非常流行的SaaS定价模式是按用户定价。如果更多的人想要加入这个计划，那么它的成本就会更高。\n项目管理工具monday.com使用这种定价策略。5个用户的基本套餐每月费用为39美元，10个用户的费用增加到79美元，并且一直扩展到200多个用户。\n定价不一定是线性的，用户翻一番并不总是意味着价格翻一番。\n如果您的软件是在B2B领域销售的，则此系统往往工作得最好，因为包可以根据团队的大小进行定制。客户还可以很容易地确定他们应该使用什么支付计划，以及何时需要扩展。\n与其他模式相比，这种模式的缺点可能会鼓励人们更多地“欺骗”系统。多个人使用一次登录来逃避支付更高的费用可能是值得注意的。\n如果客户使用您的服务较多，则成本会增加，如果使用较少，则成本会下降。基于使用的定价模型就是基于这种简单的理念。\n这是一种在SaaS业务中并不经常出现的定价模式。它主要用于对API、带宽、处理的交易或使用的数据进行收费的平台。\n随着越来越受欢迎，越来越多的企业正在想方设法使这种模式适应他们的战略。例如，社交媒体工具对预定的帖子收费，会计解决方案按发票收费，以及其他相关服务。\n基于云的SaaS业务通常根据客户使用存储的需求采用阶梯定价。\n例如，谷歌允许其用户访问15 GB的存储空间。如果用户想要更多的存储空间，他们将需要额外付费。\nDropbox是另一个使用按存储定价模式的公司。公司给你2 GB的免费存储空间，在此之后，需要额外存储的用户需要支付一定的费用。\n这是一种聪明的商业模式，适用于所有希望鼓励客户在存储限制上进行升级的软件或服务公司。\n前面提到的所有定价模式都可以免费或打折试用您的SaaS产品。\n它们起到了诱惑者的作用，欢迎潜在客户尝试您的软件，而前期风险很小，甚至没有风险。审判的时间长短不一，有些持续几天，而另一些则长达一个月。\n希望人们认识到您的软件的质量，并看到支付要价的价值。\n一些公司将采用一种策略，即如果用户在试用日期结束前没有取消试用，试用将自动进入全额付费订阅。如果这是您要实施的内容，请确保您遵守当地政府和您决定使用的支付处理机的规定。\n在决定免费或折扣试验是可行的选择之前，应该设置跟踪，以便可以监控成功情况。\n每月经常性收入(MRR)和年度经常性收入(ARR)是两个选项，但大多数情况下首选其中一个。\n顾名思义，ARR意味着向客户提供为期一年的订阅费。\nSaaS公司只提供年度订阅的情况很少见。如果是这样的话，通常是在B2B市场，在那里合同得到了更广泛的使用。\n这是因为你可能会错过一大笔收入。大多数新客户将不愿承诺订阅为期一年的服务。这一点尤其正确，因为它需要更高的入门价格。\nARR和MRR结合在一起是司空见惯的。月度订阅将更多地进行营销，但有时也会提供年度订阅。为了使它更具吸引力，它通常会以折扣价出售，例如，11英镑的价格是12个月。\n一旦你开始建立忠诚的客户基础，这个优惠可能会变得对人们更有吸引力。如果他们是老用户，为什么不享受折扣呢？\n当涉及到跟踪指标时，预先获得一笔付款确实会让事情变得更容易。然而，放松不应该优先于收入。\nMRR不仅是大多数SaaS公司的首选，也是购买SaaS公司的投资者的首选。\n这是因为MRR更准确地反映了贵公司的经营状况。更容易绘制成功图表。虽然ARR的指标可以细分为几个月，但拥有月度收入可以更容易地跟踪您对系统进行的任何调整的结果。\n它对顾客也更有吸引力。他们不受一年计划的束缚，只要他们需要，他们可以承诺多久。虽然这可能会增加流失，但也会增加订户数量。\n让我们快速讨论一下转移能力，以及将业务转移给买方…的最大敌人。贝宝。\n如果你的盘子里没有足够的东西，你使用的支付处理平台是需要警惕的。\n把你所有的信任都寄托在像贝宝这样大的公司上似乎是个不错的主意，但在出售你的公司时，这可能会带来问题。\n记住，当你出售你的公司时，你将把一切都转移给新的所有者。这可能包括源代码、员工和任何域。然而，并不总是考虑付费用户的转移。\n贝宝(PayPal)使得通过支付门户从一个人转移到另一个人变得非常困难。你最不希望发生的事情就是引发任何破坏收购的问题。在运营SaaS公司时，应该考虑其他支付处理商，或者至少应该使您处理支付的能力多样化。\n如果你读了这篇文章，它会让你思考你的SaaS业务值多少钱，那么这将是给你的。\n我们有一个免费的评估工具，它是为SaaS业务而设计的。给它一些你的指标，它会仔细考虑所有东西，然后才会吐出根据多年行业经验得出的估值。\n或者，也许你想进行一次真正的谈话，讨论一下你可以做出什么样的退出？我们有一个商业分析师团队，你可以安排与他们的通话，他们已经帮助价值数百万美元的企业计划了改变人生的退出。\n他们明白，评估SaaS业务不是非黑即白。如果你还没有做好出售的准备，他们可以告诉你他们的想法，甚至可以为你指引正确的方向。\n如果您准备退出，那么请通过我们的销售页面提交您的业务。\n可能只有一位投资者在等着给你一个你不能拒绝的出价。", "note_en": "Even if people haven’t heard of software as a service (SaaS), chances are they have used one.\n That’s what makes SaaS such a powerhouse in the world of digital assets.\n The  SaaS business model relies on recurring subscriptions for its income. Subscribers pay to essentially lease software that is hosted in the cloud. This means there are no physical copies or license agreements, making it incredibly easy for customers to access your service.\n If done correctly, investors love the SaaS business model. The recurring revenue stream makes the business model one that is full of gold, and is the main reason why SaaS companies tend to fetch a higher valuation than most other online businesses.\n A SaaS company is more difficult to value as there are more moving parts. Our  SaaS valuation guide provides a comprehensive overview of the valuation method that should be used.\n In this article, we’re going to narrow down the focus to pricing models, and discuss why this deserves special attention.\n  Having a product that people need to use creates the opportunity for endless potential. Whether that’s business to business (B2B) or business to customer (B2C), the SaaS business model can do it all.\n Whatever your customer base is, there’s always one thing at the forefront of their thoughts…\n  Justifying the price of the software is often the main pinch point preventing customers from subscribing. This is particularly true if your service is new to the market and you haven’t fully established yourself yet.\n  Making it as easy as possible for customers to see value in the service you’re providing is a powerful persuasion tactic. Some SaaS companies provide a “freemium” level to their pricing which allows a restricted level of free use.\n Everyone likes something for free. Getting these customers in through the door then makes it easier to upsell them. This is just one of the many strategies that companies will implement.\n  Combining good software with good marketing will naturally start to boost your profits. Higher net profit is the number one way to  increase a SaaS valuation.\n But there’s also more to choosing the correct pricing model, as buyers like to see that SaaS companies are operating sustainably.\n The pricing structure is a direct contributor to the customer acquisition cost (CAC) and the customer lifetime value (LTV). Both of these metrics are hugely important in deciding whether your business is successful.\n While it is possible to change a model after a business begins trading, it’s a lot easier to get it right the first time. Completely changing the pricing structure risks alienating the customers you already have. The ideal scenario is a low CAC and a high LTV. This is not only what’s needed to be successful, but is also what values your SaaS company at a higher price. These two things often come hand in hand.\n Even if you’re not thinking about  selling your SaaS business just yet, getting operating procedures implemented as if you were will help you to succeed.\n Getting through the start-up and into the hyper-growth phase requires people to sign up to become paid customers. To ensure as many people do that as possible, it’s important to get the correct pricing model in place early. With a fair few choices, we’re aiming to look at which one will work best for you.\n  Software by definition is highly customizable. This opens up endless possibilities regarding design, function, and features.\n When you combine this with an arsenal of marketing tricks, it makes for a mind-boggling number of possibilities.\n It’s also pertinent to mention that due to both of these factors, what works for someone else might not work for you. A pricing structure should find the balance between maximizing profit and being easy for customers to understand.\n  With a sound model in place, slightly tweaking prices will allow you to see how that affects net profit, CAC, LTV, and churn. The idea of increasing the price is a daunting one for many startups.\n  The mission objective of a SaaS company should be to make tasks easier for people. Whether that’s automating a company’s marketing funnel or making bookkeeping easier for accounting services. Proving your worth to a user is what turns them into loyal customers.\n If your software helps a company grow, it might be beneficial to have a pricing model that also grows. If a bigger company needs to use more features then it makes sense to charge them more. Chances are if they’re making more money, then they’re willing to pay more for quality.\n  Owning a SaaS company is a constant cycle of listening to user feedback and implementing updates. These updates improve your software so that value can increase.\n  When they made the move to online streaming in 2014, they offered a single tier of pricing known as “standard” for $7.99. As their user base grew they invested in more content and felt this justified a price increase.\n Fast forward five years to 2019 and they now offer three tiers of pricing, the standard of which is now available for $12.99.\n   There are examples like this throughout the SaaS business world. Although, there are of course cases where this hasn’t worked so well. But by listening to your customers and implementing a pricing model that allows both yourself and your customers to get more out of it counts as a win-win.\n  Without further ado, we’re going to get into the different kinds of pricing models and discuss how they affect a SaaS business model and in turn the valuation.\n As mentioned before, setting up a company as if you’re working towards an exit often leads to things running smoother. Getting into this way of thinking early is a lot more beneficial than when you become more established. Customers who start in the early stages are usually a lot more understanding. Things become more difficult to change as you get more users.\n  While not strictly a pricing model of its own, we feel it’s important to include this as part of the discussion.\n  It is often used in conjunction with other pricing structures. For example, Basecamp, a project management and communication software for remote teams, offers a “personal” level.\n This free version has limits on the number of projects, users, and storage. This allows customers, particularly those from small businesses, to use the software for free. If you believe the software will prove its worth to people, then persuading them to buy becomes easier.\n      The most basic of the popular models is flat rate pricing. Pretty self-explanatory, companies will charge a single fee to use their service.\n This means that everyone who pays the subscription cost gets to use all the services that the software provides. It’s a one size fits all method that puts all customers on the same plan.\n The simplicity of this model means it is the easiest to implement. It’s a format that every customer will be familiar with. The only difference between this and an eCommerce store is that customers of your SaaS product are not paying to own the product outright. Instead, they pay a monthly or annual subscription to use the product for as long as they desire.\n Basecamp makes use of flat rate pricing. For $99 a month you get full access to their software.\n The beauty of this method is its simplicity. It’s easy for people to see exactly what they’re paying for. They don’t have to worry about what features they do or don’t need because it comes as one package.\n Because of this, a lot of startups use this model when they first begin. When you first put your software out into the market it’s probably not going to be the finished article. There will be many more ideas in the pipeline. A lot can be said for having something that gets you up and running.\n  Will a large company need the same features as a small local business? It’s only natural that the price increases as more features are added, but keeping customers happy becomes more difficult.\n Continuing to use flat rate pricing means that you’ll be missing out on profit. The ability to charge customers more who not only make more profit but will be using more of the software becomes a challenge.\n      Tiered pricing aims to offer something for everyone. One of the most popular models, it’s something most people will be familiar with.\n This is where companies offer different pricing based on the number of features you require. It might even begin with a freemium level before scaling up in price through different plans.\n A company that implements this pricing model is the search engine optimization tool Ahrefs. They offer four plans that start with a “lite” version for $99 a month, all the way up to an agency version for $999 a month.\n Although the lower tier of pricing may seem expensive, Ahrefs built themselves up to be one of the market leaders, and as such they can use their brand to charge more.\n The benefit of this system is obvious. Tiered pricing can maximize your profit by creating packages based on the customer’s needs.\n  It’s common to see three levels of pricing, low, medium, and high, but this doesn’t have to be the case. Tiers can be created based on what relates to your software. The pricing model only becomes a problem when the tiers are not clearly defined by easy to understand features.\n People will want to know what they’re getting for their money before they sign up. If they can’t categorize themselves in one of the payment plans then you risk losing them before they even had the chance to become a customer.\n      Another hugely popular SaaS pricing model is per user pricing. If more people want to be added to the plan then it’s going to cost more.\n The project management tool Monday.com uses this pricing strategy. For five users the basic package costs $39 a month, for ten users this increases to $79, and this scales all the way up to 200 plus users.\n The pricing doesn’t have to be linear, doubling the users doesn’t always mean doubling the price.\n This system tends to work best if your software is marketed in the B2B space, as packages can be tailored to the size of a team. It’s also easy for customers to work out what payment plan they should be on as well as when they need to scale up.\n  The downsides of this model can encourage people to “cheat” the system more than the other models. Multiple people using a single log-in to get around paying a higher fee might be something to watch out for.\n       If customers use more of your service, the cost increases, and if less, the cost goes down. The usage-based pricing model is based on this straightforward philosophy.\n It is a pricing model that doesn’t appear often in SaaS businesses. It is mostly used for platforms charging for API, bandwidth, processed transactions, or used data.\n  Increasing in popularity, more businesses are finding ways to adapt this model into their strategy. Social media tools, for example, are charging for scheduled posts, accounting solutions charge per invoice, and other related services.\n      Cloud-based SaaS businesses often use tiered pricing based on the customers’ need to use storage.\n Google, for example, allows its users to access 15GB of storage. If a user wants more storage, they will need to pay extra.\n Dropbox is another example of a company using the per-storage pricing model. The company allows you 2GB of free storage, after which users who want extra storage pay a certain fee.\n It is a smart business model and is suitable for all software or service companies that want to encourage customers to upgrade on the storage limit.\n      It’s possible for all of the aforementioned pricing models to offer a free or discounted trial of your SaaS product.\n These act as an enticer, welcoming potential customers into trying your software with little or no upfront risk. Trials can vary in length, some lasting a few days while others up to a month.\n The hope is that people recognize the quality of your software and see value in paying the asking price.\n Some companies will employ a tactic where a trial automatically runs into a full paying subscription if not canceled by the user before the end of the trial date. If this is something you implement, make sure you adhere to the regulations of the local government and the payment processor you decide to use.\n Before deciding on whether free or discounted trials are a viable option, tracking should be set up so the success can be monitored.\n     Monthly recurring revenue (MRR) and annual recurring revenue (ARR) are the two options but one is largely preferred.\n  Exactly as it sounds, ARR means offering the customer one payment that covers subscription for a year.\n It’s rare to see a SaaS company only offer an annual subscription. If it does it’s usually in the B2B marketplace where contracts are more widely used.\n This is because you are potentially missing out on a large amount of revenue. Most new customers will be unwilling to commit to a year-long subscription. This is especially true as it requires a higher entry price.\n It’s commonplace to see ARR combined with MRR. A monthly subscription will be marketed more but an annual subscription is sometimes also offered. To make this more appealing it will often be offered at a discounted price, twelve months for the price of eleven for example.\n Once you start building up a loyal customer base this offer might become more appealing to people. If they’re a regular user then why not get the discount?\n Getting one payment upfront does make things easier when it comes to tracking metrics. However, ease shouldn’t be prioritized over revenue.\n  MRR is the preferred choice of billing for not just most SaaS companies but also the investors that  purchase SaaS companies.\n This is because MRR is a more accurate representation of how your company is doing. It is easier to chart success. While metrics from ARR can be broken down into months, having monthly revenue makes it easier to track the results of any tweaks you make to the system.\n It’s more appealing to the customers too. They aren’t tied down to a one year plan, they can commit for as long as they need. While this may increase churn it also increases the subscriber count.\n Let’s talk about transfer-ability real quick, and the worst enemy of transferring your business to a buyer…Paypal.\n  As if there wasn’t enough on your plate, the payment processing platform you use is something to be wary about.\n  It might seem like a good idea to put all your trust in a company as big as PayPal, but it can cause problems when selling your company.\n Remember, when you sell your company you will be transferring everything over to the new owner. This might include source code, employees, and any domains. However, what’s not always thought about is the transfer of the paying subscribers.\n PayPal makes it very difficult to transfer over a payment portal from one person to another. The last thing you want is to cause any issues that derail a takeover. Other payment processors should be considered when running a SaaS company, or at least you should diversify your ability to process payments.\n  If you read this article and it got you thinking about how much your SaaS business was worth then this will be for you.\n We have a free  valuation tool that has been designed with SaaS businesses in mind. Feed it some of your metrics and it will chew over everything before spitting out a valuation derived from years of industry experience.\n Or, maybe you want to have an actual conversation about what kind of exit you could make? We have a team of business analysts that you can  schedule a call with that has helped millions of dollars worth of businesses plan life-changing exits.\n They understand that valuing a SaaS business is not black and white. They can talk you through their thinking and can even guide you in the right direction if you’re not quite ready for a sale.\n If you are ready to move towards an exit then submit your business through our  sales page.\n There just might be an investor waiting to make you an offer you can’t refuse.", "posttime": "2020-05-16 01:08:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "定价,pricing,客户", "title": "SaaS定价模型及其对估值的影响", "title_en": "SaaS Pricing Models and How They Affect Valuation", "transed": 1, "url": "https://empireflippers.com/saas-pricing-models/", "via": "", "real_tags": ["定价", "pricing", "客户"]}, {"category": "", "categoryclass": "", "imagename": "e5f4b3601470c3c2c0bf5b655ef773d3.png", "infoid": 1002258, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的自学课程包括专业设计的材料、引人入胜的演示、动手实验练习，以及联系弹性专家来帮助您培养和保留新技能。只要你有互联网连接，它们都可以在任何地方使用。", "note_en": "Our self-paced courses include expertly designed materials, engaging demos, hands-on lab exercises, and access to Elastic experts to help you build and retain new skills. And they’re all available anywhere you have an internet connection.", "posttime": "2020-05-16 01:06:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,麋鹿,elk,课程", "title": "免费的麋鹿基础在线课程", "title_en": "Free ELK fundamentals on-line courses", "transed": 1, "url": "https://www.elastic.co/training/free", "via": "", "real_tags": ["免费", "麋鹿", "elk", "课程"]}, {"category": "", "categoryclass": "", "imagename": "99e27aa03ab32404230991e5241933a1.jpg", "infoid": 1002257, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一篇关于好奇Chrome扩展是什么的文章。\n“扩展是自定义浏览体验的小型软件程序。它们使用户能够根据个人需求或偏好定制Chrome功能和行为。它们建立在HTML、JavaScript和CSS等Web技术之上。“。信源。\n一个Chrome扩展是HTML，CSS和JavaScript，它是GitHub上的一个小的自含式网站演示源代码。\nChrome Web Store是您查找和安装扩展的地方。除了少数边缘情况外，这是安装扩展模块的唯一方式。\n在这里，您可以看到开发者模式已经打开，我已经加载了一个加载未打包的本地扩展。\nChrome网络商店不能方便地按下载量最多或最星级的用户订购。\n谷歌搜索键盘快捷键-向谷歌搜索结果添加键盘快捷键，例如Tab，然后按Alt-Enter在新页面中打开搜索结果。必需品-我一直都在用这个。\nuBlock Origin和GitHub源是一个很好的网站广谱拦截器，包括过滤“恶意软件”-将用户置于安装广告软件风险中的网站等。\n找优惠券的蜂蜜。不知道它能不能用--我在试。1000万+用户155k星。\n这是我目前最感兴趣的领域，所以我专注于这个领域，看看写一个Chrome扩展对我的业务是否有用。\n如何制作Chrome扩展-YouTube和源代码是对Chrome扩展的极好且深入的介绍。我在这里的评论中包括了一些亮点，主要是因为如果我将来忘记了这一点，我会昏迷地回到这篇文章：-)。\n最初，扩展程序会显示一个警告框，然后继续统计每个网页上的“熊”这个词。它通过在扩展和页面之间传递消息来实现这一点。\n//popup.js//向文档添加事件监听器//等待一切加载文档。addEventListener(&#39；DOMContentLoaded&#39；，function(){//只有一个按钮(查找熊))，所以这是一种懒惰的查找文档的方式。querySelector(&#39；按钮&#39；)。addEventListener(&#39；click&#39；，onclick，false)函数onclick(){//查找当前活动选项卡打开的Chrome。制表符。query({currentWindow：true，active：true}，function(Tab){//向我们的内容选项卡发送消息-由content.js函数Chrome接收。制表符。sendMessage(选项卡[0]。id，&#39；hi&#39；)})}，false)。\n//content.js//当发送消息时，我们将获得此处调用的此函数//将此消息警告出Chrome。运行时。OnMessage。addListener(function(Request){alert(Request)})。\n所以这很棒，因为content.js脚本可以访问页面中的所有内容。\n//content.js Chrome。运行时。OnMessage。addListener(function(request，sender，sendResponse){const re=new RegExp(&#39；Bear&#39；，&#39；gi&#39；)const matches=document。DocumentElement。innerHTML。匹配(重新)sendResponse({count：matches.。长度})})\n//popup.js文档。addEventListener(&#39；DOMContentLoaded&#39；，function(){文档。querySelector(&#39；按钮&#39；)。addEventListener(&#39；click&#39；，onclick，false)函数onClick(){chrome。制表符。query({currentWindow：true，active：true}，function(Tabs){//第三个参数setCount是从content.js端Chrome调用//sendResponse时调用的。制表符。sendMessage(选项卡[0]。id，&#39；hi&#39；hi&#39；，setCount)})}函数setCount(Res){const div=document。createElement(&#39；div&#39；)div.。textContent=`${res.。Count}Bears`文档。身体。appendChild(Div)}}，false)。\n在访问了3个页面之后，扩展可以使用背景脚本列出我访问的每个页面上的熊的数量。\n扩展浏览器视频的Pluralsight有一个从Azure门户网站删除重要信息的示例。\nGitHub上的源代码-有趣的是，由于商标侵权，它在Chrome网上商店上不可用。啊，围墙花园的乐趣，我会在下面谈到。可以下载适合本地使用的解包版本。\n我喜欢叫弹出窗口，弹出窗口，而不是像这个视频中的作者那样叫弹出窗口。\n提交UI似乎有缺陷，因为它既不喜欢activeTab的权限，也不喜欢davemateer.com网站的权限(说它太宽了)。也许我只能做其中的一个。\n实际上，大约5分钟后，它似乎变成了橙色(待审的文本)。没有收到我预料到的电子邮件。它花了大约18个小时进行审查，并被拒绝。我再次尝试了更好的图标，更好的描述，更窄的权限，只访问我的网站，而不是activeTab。它再次被拒绝，并发出了相同的消息。这似乎是一个自动化的过程，我不想再往前推了。\n扩展示例是查看源代码以查找您想要做的事情的好地方。\nWebAssembly看起来可以工作，但是谁知道你是否能把它放到网上商店里。\n不，看起来不像，而且谷歌显然是在屏蔽被混淆的代码。\n我在创建自己的扩展时遇到的最大问题是推到Chrome网络商店，任由他们摆布。我的企业更适合在服务器上工作。", "note_en": "This is a write up of  being curious as to what Chrome Extension’s are.\n   “Extensions are small software programs that customize the browsing experience. They enable users to tailor Chrome functionality and behavior to individual needs or preferences. They are built on web technologies such as HTML, JavaScript, and CSS.”  source\n    A Chrome Extension is HTML, CSS and JavaScript ie  it is a little self contained website  Demo source on GitHub\n   Chrome Web Store is where you find and install extensions. This is the only way to install extensions  except for a few edge cases\n    Here you can see  Developer Mode is turned on and I’ve loaded a  Load unpacked local extension.\n    The  Chrome Web Store doesn’t make it easy to order by the most downloaded or the most starred.\n  Google Search Keyboard Shortcuts - adds keyboard shortcuts to Google search results eg Tab, then Alt-Enter to open search result in new page. Essential - I use this all the time.\n    uBlock Origin and  GitHub source is a  good wide spectrum blocker for websites including filtering ‘badware’ - sites that put users at risk on installing adware etc..\n    Honey for finding coupons. No idea if it works - am trying it. 10m+ users 155k stars.\n  This is the area I’m most interested in at the moment, so I focussed in on this domain to see if writing a Chrome Extension would be useful in my business.\n   How To Make Chrome Extensions - YouTube and  Source Code is an excellent and in-depth introduction into Chrome extensions. I’ve included some of the highlights here with comments, mainly so if I forget this in the future, I came coma back to this article :-)\n Initially the extension puts up an alert box, then goes on to Count the word Bear on each webpage. It does this by passing messages between the extension and the page.\n // popup.js // add Event Listener to the document // wait for everything to load document . addEventListener ( &#39; DOMContentLoaded &#39; ,  function  ()  {  // only 1 button (find bears) so this is the lazy way to find it  document . querySelector ( &#39; button &#39; ). addEventListener ( &#39; click &#39; ,  onclick ,  false )  function  onclick  ()  {  // looking for the current active tab open  chrome . tabs . query ({ currentWindow :  true ,  active :  true },  function  ( tabs )  {  // sending a message to our content tab - received by content.js function  chrome . tabs . sendMessage ( tabs [ 0 ]. id ,  &#39; hi &#39; )  })  }  },  false )\n    // content.js // when a message is sent we will get this function called here  // alert this message out chrome . runtime . onMessage . addListener ( function  ( request )  {  alert ( request ) })\n  So this is great as the content.js script has access to everything in the page.\n // content.js chrome . runtime . onMessage . addListener ( function  ( request ,  sender ,  sendResponse )  {  const  re  =  new  RegExp ( &#39; bear &#39; ,  &#39; gi &#39; )  const  matches  =  document . documentElement . innerHTML . match ( re )  sendResponse ({ count :  matches . length }) })\n  // popup.js document . addEventListener ( &#39; DOMContentLoaded &#39; ,  function  ()  {  document . querySelector ( &#39; button &#39; ). addEventListener ( &#39; click &#39; ,  onclick ,  false )  function  onclick  ()  {  chrome . tabs . query ({ currentWindow :  true ,  active :  true },  function  ( tabs )  {  // third argument setCount is called when  // sendResponse is called from the content.js side  chrome . tabs . sendMessage ( tabs [ 0 ]. id ,  &#39; hi &#39; ,  setCount )  })  }  function  setCount  ( res )  {  const  div  =  document . createElement ( &#39; div &#39; )  div . textContent  =  ` ${ res . count }  bears`  document . body . appendChild ( div )  }  },  false )\n     After visiting 3 pages, the extension can list the number of bears on each page I visited using a background script.\n  Pluralsight Extending the Browser video has an example on redacting out important information from the Azure Portal.\n   source code on GitHub - interestingly it is not available on the chrome webstore because of a trademark infringement. Ah, the joys of walled gardens, which I’ll get to below. Can download an unpacked version fine for local use.\n I like to call popups, popups, not popouts as the authors do in this video.\n      The submission UI seemed buggy in that it didn’t like both the permissions of activeTab and the davemateer.com website (said it was too broad). Maybe I had to do one or the other.\n  Actually it seemed to turn orange (the pending review text) after around 5 minutes. No emails received which I would have expected. It took about 18 hours to be reviewed and was rejected. I tried again with better icons, better description and a narrower permission of only my website instead of activeTab as well. It was rejected again with the same message. It seems this is an automated process, and I didn’t want to push forward anymore.\n   Extension samples is a good place to look into source code for things you want to do.\n  It looks like WebAssembly can work but who knows if you could get it into the web store.\n  No it doesn’t look like it and google is apparently blocking code that is obfuscated.\n    The biggest problem I have on creating my own extensions is pushing to the Chrome Web Store and  being at their mercy. My ventures are more suited to being on a server.", "posttime": "2020-05-16 01:05:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrom,开发,chrome,extension,扩展", "title": "Chrome扩展的-我最喜欢的是什么，以及如何开始开发", "title_en": "Chrome Extension's – what are my favourites and how to get started developing", "transed": 1, "url": "https://davemateer.com/2020/05/11/chrome-extensions-beginners-guide", "via": "", "real_tags": ["chrom", "开发", "chrome", "extension", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "14d244d0a5dc22b47b6ae91754b207c9.jpg", "infoid": 1002256, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索伦托说，它认为这种标记为STI-1499的抗体在其庞大的人类抗体库中筛选的数十亿个候选抗体中脱颖而出，因为它有能力完全阻断SARS-CoV-2的尖峰蛋白与人类细胞靶标受体的相互作用。这意味着它可以防止病毒附着在宿主的健康细胞上，而这正是导致孵化和感染的原因。\n抗体效力的性质意味着，索伦托目前认为，它将是它正在开发的鸡尾酒中包含的第一种抗体，这种鸡尾酒将由大量不同的抗体组成，这些抗体显示出阻止尖峰蛋白附着的功效，以便提供多种保护途径，即使病毒在人与人之间传播或在同一人内传播时发生变异，这些途径也能保持有效。研究人员目前正在努力回答的一大悬而未决的问题是，SARS-CoV-2到底有多大的突变性，因为许多冠状病毒，如普通感冒，表现出变异很快的趋势，使得长效治疗和治疗方法很难开发。\n索伦托的COVID-Shield旨在通过不同抗体的有效混合来解决这一问题，这些抗体提供对不同毒株的保护，但该公司表示，它还将自行开发STI-1499抗体，作为一种专门的独立疗法。该公司已经在与监管机构讨论如何加快这种潜在疗法的开发，并正在提高产能，目标是在寻求FDA批准其使用的同时生产多达100万剂。\n绝对值得注意的是，没有任何治疗方法或疫苗可能是治疗SARS-CoV-2或冠状病毒的“灵丹妙药”，但这仍然是一个有希望的发展，在它经历临床试验和治疗开发和监管过程时仍然值得关注。", "note_en": "Sorrento says it believes this antibody, which is labelled STI-1499, stood out among billions of candidates it has been screening from its extensive human antibody library for its ability to completely block the interaction of the SARS-CoV-2’s spike protein with a human cell target receptor. That means it prevents the virus from attaching to the host’s healthy cell, which is what leads to incubation and infection.\n The nature of the antibody’s efficacy means that Sorrento currently believes it will be the first antibody to be included in the cocktail it is developing, which will be made up of a large number of different antibodies that show efficacy in blocking the attachment of the spike protein, in order to provide multiple avenues of protection that are designed to remain effective even if the virus mutates in transmission from person to person, or within the same individual. One of the big outstanding questions that researchers are working on answering currently is just how mutagenic SARS-CoV-2 actually is, as many coronaviruses like the common cold show a tendency to mutate pretty quickly, rendering long-lasting cures and treatments difficult to develop.\n Sorrento’s COVID-SHIELD is meant to address this through a potent mix of different antibodies that provide protection against different strains of the virus, but the company says it also will be pursuing development of the STI-1499 antibody on its own as a dedicated, standalone therapy. The company is already in discussion with regulators about how to expedite development of that potential treatment, and is ramping its production capacity as well with the goal of producing as many as one million doses at the same time it pursues FDA approval for its use.\n It’s definitely worth cautioning that no treatment or vaccine is likely to be a “magic bullet” in treating SARS-CoV-2 or COVID-19, but this is still a promising development, and one to watch as it undergoes clinical trials and the therapeutic development and regulatory process.", "posttime": "2020-05-16 00:51:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,coronavirus,冠状病毒,lab,抗体", "title": "索伦托在临床前实验室实验中发现可100%阻断病毒感染的冠状病毒抗体", "title_en": "Sorrento Finds a Coronavirus Antibody That Blocks Viral Infection 100% in Preclinical Lab Experiments", "transed": 1, "url": "https://techcrunch.com/2020/05/15/sorrento-finds-a-coronavirus-antibody-that-blocks-viral-infection-100-in-preclinical-lab-experiments/", "via": "", "real_tags": ["病毒", "冠状病毒", "lab", "抗体"]}, {"category": "", "categoryclass": "", "imagename": "19c5057ed9ff4312300d23cf147af756.png", "infoid": 1002255, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一个位置更新密码可确保更改在使用该密码的所有存储库中生效。\n您可以查看组织或存储库机密的上次更新时间，从而更容易定期轮换机密", "note_en": "Updating a secret in one location ensures that the change takes effect in all repositories that use the secret\n You can view when an organization or repository secret was last updated, making it easier to rotate secrets regularly", "posttime": "2020-05-16 00:50:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,操作,actions,机密", "title": "GitHub操作：组织级别机密", "title_en": "GitHub Actions: Org level secrets", "transed": 1, "url": "https://github.blog/changelog/2020-05-14-organization-secrets/", "via": "", "real_tags": ["github", "操作", "actions", "机密"]}, {"category": "", "categoryclass": "", "imagename": "106c065e1e5e8355f3ffe493f4161598.png", "infoid": 1002254, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OpenTPOD是一个一体式开源工具，供非专家创建自定义深度神经网络对象检测器。它的设计目的是降低进入门槛，并促进使用最先进的深度学习方法的自定义对象检测的端到端创作工作流。\n一键训练/微调目标检测深度神经网络，包括SSD MobileNet、更快的RCNN Inception和更快的RCNN ResNet，使用Tensorflow(带或不带GPU)。\n这项研究得到了国家科学基金的资助，项目编号为CNS-1518865。英特尔、沃达丰、德国电信、Verizon、Crown Castle、Seagate、VMware、MobiledgeX、InterDigital和Conklin Kistler家族基金都提供了额外的支持。", "note_en": "OpenTPOD is an all-in-one open-source tool for nonexperts to create custom deepneural network object detectors. It is designed to lower the barrier of entryand facilitates the end-to-end authoring workflow of custom object detectionusing state-of-art deep learning methods.\n  One-click training/fine-tuning of object detection deep neural networks,including SSD MobileNet, Faster RCNN Inception, and Faster RCNN ResNet, usingTensorflow (with and without GPU).\n         This research was supported by the National Science Foundation (NSF) under grantnumber CNS-1518865. Additional support was provided by Intel, Vodafone, DeutscheTelekom, Verizon, Crown Castle, Seagate, VMware, MobiledgeX, InterDigital, andthe Conklin Kistler family fund.", "posttime": "2020-05-16 00:50:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,opentpod,对象", "title": "CMU的OpenTPOD：创建无需编码的深度学习对象检测器", "title_en": "CMU's OpenTPOD: Create Deep Learning Object Detectors Without Coding", "transed": 1, "url": "https://github.com/cmusatyalab/opentpod", "via": "", "real_tags": ["深度学习", "opentpod", "对象"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002253, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们马上把好消息传出去吧。我们的延期已经批准了！\n仅供参考，最新提交的文件已获批准。在解决了最初的违规行为后，向更广泛的开发社区道歉，因为没有提供更具可操作性的拒绝https://t.co/b7Au7Mjppn🙇PushBullet。\n-Simeon.__proto__(@DotProto)2020年5月14日。\n对于那些担心失去PushBullet功能的人(以及担心失去扩展功能的我们来说)，现在一切都恢复正常了。这是个好消息，我们很高兴听到。\n我们希望我们之前的帖子受到的关注能给其他可能正在为来自谷歌的类似模糊反馈而苦苦挣扎的扩展开发者带来更好的反馈。\n我们没有预料到我们上一篇帖子受到的关注程度。所有这些关注都导致我们的问题得到了解决。这对我们有好处。目前还不清楚这种关注是否会帮助其他正在与类似的含糊拒绝作斗争的开发商。不过，我们希望它能有所帮助。\n一个很好的结果是，如果当前的Chrome扩展审查和反馈过程由于当前过程受到的批评而被重新审视，那将是一个很好的结果。这将意味着我们得到的大量支持使所有扩展开发人员都受益。\n我们相信@DotProto和Google的其他人，当他们表达了改善向开发者提供的反馈扩展的愿望时，我们相信他们是这样做的。我希望已经显示出的压倒性的社会支持将给他们所需的影响力，推动他们朝着更好的方向迈进。", "note_en": "Let’s get the good news out there right away. Our extension has been approved!\n FYI the latest submission has been approved. Apologies to Pushbullet for the rejection after addressed the original violation &amp; to the broader dev community for not providing more actionable rejections 🙇 https://t.co/b7Au7Mjppn\n— Simeon.__proto__ (@DotProto)  May 14, 2020\n For those worried about losing Pushbullet’s functionality (and for us worried about losing our extension), things are back to normal now. This is great news and we are happy to hear it.\n We hope the attention our previous post received results in better feedback for other extension developers that may be struggling with similar vague feedback from Google.\n We didn’t expect anywhere near the level of attention our previous post received. All of that attention resulted in our issue being resolved. This is good for us. It is not yet clear if the attention will help other developers that are struggling with similar vague rejections. We hope it does help though.\n A great outcome would be if the current Chrome extension review and feedback process was revisited as a result of the criticism the current process has received. This would mean the outpouring of support we received benefits all extension developers.\n We believe @DotProto and others at Google when they express their desire to improve the feedback extension developers are provided. I hope the overwhelming community support that has been shown will give them the influence they need to push for steps in a better direction.", "posttime": "2020-05-16 00:50:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chrom,chrome,扩展", "title": "PushBullet：我们的Chrome扩展是安全的", "title_en": "Pushbullet: Our Chrome Extension Is Safe", "transed": 1, "url": "https://blog.pushbullet.com/2020/05/15/our-extension-is-safe/", "via": "", "real_tags": ["chrom", "chrome", "扩展"]}]