[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073885, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于丹佛的初创公司在一轮种子融资中筹集了约500万美元，六个月后，该公司就获得了这笔资金。Nomad的联合创始人PJ O’Neil和Matt Thelen在分别离开Opendoor和Twilio后创办了公司。奥尼尔是Opendoor的总经理，塞伦是Twilio的业务运营总监。\nNomad成立于2020年，其目标是消除小型租赁房产所有者的风险和财务不确定性。如今，它为租房业主及其居民提供了多种金融产品。该公司的旗舰产品是为夫妻出租物业业主（主要是DIY房东）提供租金保证，旨在让这些房东即使在动荡的市场条件下也能获得更多确定性。\n奥尼尔说：“我们通过减少不必要的空置成本来帮助这些租房业主实现收入最大化。当有抵押贷款和其他费用需要支付时，空置成本很难承受。”。\n在2021，游牧民族说，它增长了“8倍”，或700%年一年，处理超过1000万美元的租金和担保的房屋组合价值超过2亿5000万美元。它的团队也从现在的12人增加到了40人，平台上有1000多个客户，包括业主和居民。\n去年，该公司也进入了凤凰城市场，将目光投向罗利，然后是北卡罗来纳州夏洛特。它还为租赁业主增加了更多金融产品，如预付租金、终身居民奖励和经纪服务，让客户在其支持下购买、销售、租赁和管理。\n具体来说，除了保证租金，Nomad的核心产品中还嵌入了一种金融产品，允许业主通过申请最多六个月的预付租金来利用他们未来的租金收入。他们的想法是，他们可以用这些资金做一些事情，比如升级他们的房产，或者投资另一处租赁房产。\nNomad还希望通过将租房者定位为首次购房者来帮助他们。例如，它向信贷机构报告按时支付的租金，以帮助租户建立信用。如果一个人选择使用Nomad购买第一套住房，它还提供回扣，以弥补关闭成本。\nNomad首席执行官奥尼尔（O’Neil）表示：“我们的目标是让所有参与其中的人，从DIY租赁的业主和居民，到物业经理、房地产经纪人和维修专业人士，都能更好地享受租赁服务。”。\n该公司计划今年利用新资本再雇佣几十名员工，并在未来24个月内将其地理足迹扩大到多达10个新市场。它还计划继续投资技术，并与当地房地产经纪人、物业经理、贷款人和服务专业人士合作。\nNomad的投资者自然是看涨的。Kickstart Fund、Peterson Ventures和Range Ventures也参与了融资。\nSVB Capital的管理合伙人Beau Laskey在一份书面声明中表示：“Nomad创造了一种独特的产品，可以改变单户租赁市场的房东-租户体验。”。\nRange Ventures的克里斯·埃里克森（Chris Erickson）是第一位进入Nomad和共同创建的公寓名单的人，他认为独户租赁市场正在经历重大转变。\n他通过电子邮件写道：“我们正在关注数十亿美元的机构资本被部署到该领域，以及首次购房者越来越被拒之门外。”。“我们相信，Nomad将使住宅夫妻出租房业主在华尔街房东进入的情况下保持竞争力，并将使其居民成为首次购房者。”", "note_en": "The raise comes just six months after the Denver-based startup raised about $5 million in a seed round of funding. Nomad’s co-founders PJ O’Neil and Matt Thelen started the company after leaving their respective roles at Opendoor and Twilio. O’Neil was a general manager at Opendoor and Thelen was director of business operations at Twilio.\n Founded in 2020, Nomad’s goal is to remove risk and financial uncertainty for small-time rental property owners. Today, it offers several financial products for both rental owners and their residents. Its flagship product is guaranteed rent for mom-and-pop rental property owners (primarily DIY landlords), which is designed to give these landlords more certainty even in turbulent market conditions.\n  “We help these rental owners maximize what they earn by reducing unnecessary vacancy costs that are painful to bear when there’s a mortgage and other expenses to cover,” said O’Neil.\n In 2021,   Nomad  said it grew “8x,” or 700% year over year, processed over $10 million of rent and guaranteed rent for a portfolio of homes valued in excess of $250 million. It also has grown its team from 12 to 40 today and has more than 1,000 customers on its platform, including owners and residents.\n Last year, the company also entered the Phoenix market, and is eyeing Raleigh and then Charlotte, North Carolina, next. It also added more financial products for rental owners such as rent advance, rewards for tenured residents and brokerage services that give its customers a way to buy, sell, rent and manage with its support.\n Specifically, in addition to guaranteeing rent, Nomad has a financial product embedded in its core offering that allows property owners to tap into their future rental income by requesting up to six months of rent advance. The thinking is they can use the funds to do things like make upgrades to their property, or to invest in another rental property.\n  Nomad also wants to help renters by positioning them to be first-time homebuyers. For example, it reports on-time rent payments to credit agencies to help tenants build their credit. It also offers rebates to cover closing costs if one chooses to buy their first home using Nomad.\n “Our goal is to make renting better for everyone involved, from DIY rental property owners and residents to property managers, real estate agents and maintenance professionals,” said O’Neil, who serves as Nomad’s CEO.\n The company plans to use its new capital to hire dozens more employees this year and expand its geographical footprint to up to 10 new markets over the next 24 months. It also plans to continue to invest in its technology and partner with local real estate agents, property managers, lenders and service professionals.\n Nomad’s investors are, naturally, bullish. Kickstart Fund, Peterson Ventures and Range Ventures also participated in the financing.\n  “Nomad has created a unique product that transforms the landlord-tenant experience for the single-family rental market,” said Beau Laskey, managing partner at SVB Capital, in a written statement.\n Chris Erickson from Range Ventures, who wrote the first check into Nomad and co-founded Apartment List, believes the  single-family rental market is going through a major shift.\n “We are watching as billions of dollars in institutional capital is being deployed in the space and as first-time homebuyers are increasingly getting locked out of owning a home,” he wrote via email. “We believe Nomad will enable residential mom-and-pop rental property owners to remain competitive amidst the entrance of Wall Street landlords and will empower its residents to become first-time homeowners.”", "posttime": "2022-02-17 17:42:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "位于,based,nomad", "title": "总部位于丹佛的Nomad是一家为小业主、租房者和潜在购房者提供金融服务的初创公司，它筹集了2000万美元的a系列贷款", "title_en": "Denver-based Nomad, a startup that offers financial services for small-time landlords, renters, and potential home buyers, raises a $20M Series A", "transed": 1, "url": "https://techcrunch.com/2022/02/16/nomad-closes-on-20m-to-transform-the-landlord-tenant-experience/", "via": "", "real_tags": ["位于", "based", "nomad"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073884, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，Valve发布了蒸汽甲板的CAD文件，这样任何人都可以3D打印自己的系统外壳，但是没有零件的外壳又有什么用呢？今天，我们在零件方面得到了一些消息：Valve正在履行其承诺，通过与iFixit的合作，销售蒸汽甲板的更换零件，允许用户在家里自行维修。作为iFixit和#39之一的快乐所有者；I&#39；我觉得这是个好消息。\n&#34;iFixit将是蒸汽甲板更换零件的授权卖方之一，以及阀门索引VR套件和#34的更换零件；Valve在今天的Steam更新中写道&#34;我们仍在敲定细节，并将很快分享更多信息&#34;\n如果你跳到iFixit&#39；s零件店&#39；我会找到各种各样的游戏系统组件和其他小工具，从旧iPod到Dyson真空吸尘器。蒸汽甲板和索引为&#39；在iFixit和#39；s商店还没有，但听起来是这样的#39；我会在蒸汽甲板后不久更换#39；让我们开始吧。如果你不知何故折断了一根模拟棒或是融化了一个扳机，iFixit显然将是Valve提供替代品的多个地方之一。\n除此之外，Valve还向iFixit发送了一个蒸汽甲板拆卸视频，您可以在下面观看。\n操纵杆可拆卸，无需焊接，这是一个很大的优点，因此，如果操纵杆漂移出现，它&#39；这并不是一场巨大的考验\n你只需要一把十字螺丝刀和一个塑料短棍就可以完成整个拆卸过程（假设你&#39；也不想拆下屏幕）\n我很欣赏iFixit在拆开电子产品并记录如何修复它们时的深度，尤其是当它意味着我可以专注于在Steam Deck上测试游戏，而不是自己打开它时。我们&#39；我们目前正在PC Gamer上回顾Steam Deck，2月25日将有更多关于它的报道。", "note_en": "Last week Valve released the  CAD files for the  Steam Deck so that anyone can 3D-print their own system shell, but what good is a shell without the parts to put in it? Today we got some news on the parts front: Valve is following through on its promise to sell replacement parts for the Steam Deck, allowing users to do their own repairs at home, through a partnership with iFixit. As the happy owner of one of iFixit&#39;s fantastic toolkits, I&#39;d say this is very good news.\n  &#34;iFixit will be one of the authorized sellers of Steam Deck replacement parts – as well as replacement parts for the Valve Index VR kit,&#34; Valve wrote in  an update on Steam today. &#34;We are still hammering out the details, and will be sharing more info on this soon.&#34;\n  If you hop over to iFixit&#39;s  parts store you&#39;ll find a variety of components on sale for game systems and other gadgets, from old iPods to Dyson vacuums. The Steam Deck and Index aren&#39;t in iFixit&#39;s store yet, but it sounds like that&#39;ll change not too long after the Steam Deck&#39;s launch. If you somehow snap off an analog stick or melt a trigger, iFixit will be one of apparently multiple places Valve will offer replacements.\n   On top of that news, Valve sent iFixit a Steam Deck to disassemble for a teardown video, which you can watch below.\n     The joysticks being removable with no soldering is a big plus, so if joystick drift ever crops up, it&#39;s not a huge ordeal to replace\n You can do the whole disassembly with just a Phillips screwdriver and a plastic spudger (assuming you&#39;re not also trying to remove the screen)\n I appreciate how deep iFixit goes when taking electronics apart and documenting how to repair them, especially when it means I can focus on testing games on the Steam Deck rather than opening it up myself. We&#39;re currently reviewing the Steam Deck at PC Gamer and will have more to say about it on February 25th.", "posttime": "2022-02-17 17:40:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "域名,valve,ifixit", "title": "阀门与iFixit合作，在iFixit上销售蒸汽甲板和阀门索引VR的替换零件。通用域名格式", "title_en": "Valve partners with iFixit to sell replacement parts for Steam Deck and Valve Index VR on iFixit.com", "transed": 1, "url": "https://www.pcgamer.com/valve-is-partnering-with-ifixit-to-sell-steam-deck-replacement-parts", "via": "", "real_tags": ["域名", "valve", "ifixit"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073882, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter不是&#39；t限制加密爱好者使用比特币支付小费。这家社交网络扩大了其小费选项，允许创作者添加他们的以太坊地址。如果你&#39；如果你在另一种主要加密货币的藏匿处，你应该更容易表示支持。\n该扩展还增加了对三种支付服务的支持，包括易货、Paga和Paytm。你可以通过访问某人&#39；她在Twitter上的个人资料。如果你想收到提示并且至少18岁，你可以选择编辑你的个人资料并启用提示。\n如果你不是&#39；我对比特币的热情不如前Twitter首席执行官杰克·多尔西（Jack Dorsey）。不过，在某些方面，支付服务支持更有用。易货、Paga和Paytm在印度、尼日利亚和其他移动支付蓬勃发展的国家很有用。推特&#39；s的举措不仅让更多的人得到小费，而且让数字创作者在某些国家的运营更加实用——他们&#39；我知道他们的观众可以做出贡献。\n由于您的隐私偏好，此内容不可用。在此处更新设置，然后重新加载页面以查看它。\nEngadget推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果你通过其中一个链接购买东西，我们可能会获得会员佣金。\n由于您的隐私偏好，此内容不可用。在此处更新设置，然后重新加载页面以查看它。", "note_en": "Twitter isn&#39;t limiting crypto fans to  tipping with Bitcoin. The social network has  expanded its tipping options to let creators add their Ethereum address. If you&#39;re sitting on a stash of that other major cryptocurrency, it should be easier to show your support.\n The expansion also adds support for a trio of payment services, including Barter, Paga and Paytm. You can send tips by visiting the Tips icon in someone&#39;s Twitter profile. If you want to receive tips and are at least 18 years old, you can choose to edit your profile and enable tips.\n  Ethereum support is helpful if you aren&#39;t quite as  enthusiastic about Bitcoin as former Twitter chief Jack Dorsey. In some ways, though, the payment service support is more useful. Barter, Paga and Paytm are useful in India, Nigeria and other countries where mobile payments thrive. Twitter&#39;s move not only lets more people tip, but makes it more practical for digital creators to operate in certain countries — they&#39;ll know their audiences can contribute.\n This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2022-02-17 17:36:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "比特币,地址,addresses,支付", "title": "Twitter扩展了小费选项，允许创造者添加以太坊地址和比特币地址，并增加了对Paytm和其他支付服务的支持", "title_en": "Twitter expands tipping options to let creators add Ethereum addresses, along with bitcoin addresses, and adds support for Paytm and other payment services", "transed": 1, "url": "https://www.engadget.com/twitter-etherium-tipping-194023316.html", "via": "", "real_tags": ["比特币", "地址", "addresses", "支付"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073881, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安大略省警方和加拿大皇家骑警命令所有受监管的金融公司停止为34个加密钱包的任何交易提供便利，这些钱包与该国卡车司机领导的抗议活动有关。\n联邦警察机构与加拿大金融交易和报告分析中心（FINTRAC）合作，正在调查支持长达数周的抗议加拿大疫苗授权的加密货币捐款。根据加拿大总理贾斯汀·特鲁多（Justin Trudeau）援引的《紧急状态法》（Emergencies Act），抗议活动现在被视为非法，这是该法自1988年通过以来的第一次。\n卡车司机在一月2019冠状病毒疾病开始时就开始抗议，加拿大政府要求所有入境者都要接种CVID-19疫苗。卡车司机封锁了加拿大几个省份的国际桥梁和过境点。\n根据顺序，该列表包括29个比特币地址、一个以太坊地址、一个卡达诺地址、一个以太坊经典地址、一个莱特币地址和一个莫奈罗地址。周三早些时候，该命令的副本在Twitter上流传。Cointdesk证实了它的真实性。\n捐赠者已经向这些地址发送了20多个BTC，价值超过87万美元（约合110万加元）。此前收到900多万美元的GoFundMe账户被暂停后，捐赠者转而使用加密货币。\n《紧急状态法》旨在解决抗议者的财务问题。副总理克里斯蒂娅·弗里兰与特鲁多一起发言时说，银行可以立即冻结或暂停与卡车司机有关的银行账户，无需法庭命令，也无需担心民事责任。\nCointdesk是关于加密货币、数字资产和货币未来的新闻和信息领域的领导者，是一家致力于最高新闻标准并遵守严格编辑政策的媒体机构。Cointdesk是数字货币集团的独立运营子公司，该集团投资加密货币和区块链初创公司。作为其薪酬的一部分，包括编辑部员工在内的某些Cointdesk员工可能会以股票增值权的形式获得DCG股权的风险敞口，该等股票增值权将在多年期内授予。Cointdesk记者不允许直接购买DCG的股票。\n通过注册，您将收到有关Cointdesk产品更新、活动和营销的电子邮件，并且您同意我们的服务条款和隐私政策。", "note_en": "The Ontario Provincial Police and Royal Canadian Mounted Police ordered all regulated financial firms to cease facilitating any transactions from 34 crypto wallets tied to funding trucker-led protests in the country.\n The federal police agencies, working with the Financial Transactions and Reports Analysis Centre of Canada (FINTRAC), are investigating cryptocurrency donations supporting the weeks-long protest against Canada’s vaccine mandate. The protests are now deemed illegal under the  Emergencies Act invoked by Canadian Prime Minister Justin Trudeau for the first time since the law was passed in 1988.\n  The truck drivers began their protest near the end of January against international travel restrictions imposed by the Canadian government, which requires all entrants to the country to be vaccinated against COVID-19. The truckers blocked international bridges and border crossings in several Canadian provinces.\n The list consists of 29 Bitcoin addresses, one Ethereum address, one Cardano address, one Ethereum Classic address, one Litecoin address and one Monero address, according to the order. A copy of the order was circulating on Twitter earlier on Wednesday. CoinDesk confirmed its authenticity.\n Donors have sent more than 20 BTC to the addresses, worth over $870,000 (CA$1.1 million). The donors turned to cryptocurrencies after the GoFundMe account that had previously received more than $9 million was suspended.\n The Emergencies Act was set to take aim at protester finances.  Speaking alongside Trudeau, Deputy Prime Minister Chrystia Freeland said banks can immediately freeze or suspend bank accounts tied to the truckers without a court order and without fear of civil liability.\n  The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of  stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG.\n  By signing up, you will receive emails about CoinDesk product updates, events and marketing and you agree to our  terms of services and  privacy policy.", "posttime": "2022-02-17 17:34:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,钱包,wallets,加拿大", "title": "加拿大当局已命令受监管的金融公司停止34个加密钱包的交易，这些钱包价值超过87万美元，与资助“自由护航”有关", "title_en": "Canadian authorities have ordered regulated financial firms to cease transactions from 34 crypto wallets, worth over $870K, tied to funding the “Freedom Convoy”", "transed": 1, "url": "https://www.coindesk.com/policy/2022/02/16/canada-sanctions-34-crypto-wallets-tied-to-trucker-freedom-convoy/", "via": "", "real_tags": ["交易", "钱包", "wallets", "加拿大"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073879, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify正在进行更多的播客收购。该公司今天宣布，将收购Chartable和Podsights两家最著名的播客营销和广告归属公司。交易价格尚未披露，但这是该公司今年在一系列音频购买中进行的首次重大收购。\nPodsights和Chartable都允许播客和网络在节目中加入标签，用于跟踪谁听了广告、是否听到广告以及听到广告后是否采取了行动。Spotify表示，它计划在播客之外使用Podsights的技术，并将其引入“Spotify平台的全范围，包括音乐、视频广告和显示广告中的音频广告”。这项可图表化的收购似乎更多地针对播客本身，而不是广告商，尤其是因为它的智能链接等技术。\nSpotify写道：“这些工具将使出版商更容易将受众洞察转化为行动，并扩大其听众群，同时最终发展其业务。”。\n这项交易对该公司来说尤其关键，因为它试图让自己的广告平台成为音频方面最好、最强大的平台。如果它想让每个人都通过自己的市场购买广告，那么它需要技术来更好地查明谁在听这些广告，以及他们在听这些广告后在做什么。与此同时，营销分析对于想要确保预算支出合理的节目创作者来说至关重要。这项交易既有助于创作者，也有助于广告商，这两个团体都能发现需求，并希望诉诸法律。\nSpotify近年来一直在疯狂收购播客，涉及广告技术、有声读物和顶级创意人才。去年，该公司收购了Whooshkaa、Podz、Findaway和Locker Room，以提供和推广更多的语音内容，此前该公司于2020年底收购了主要的播客广告平台Megaphone。与此同时，Spotify一直在招募主要的人才和节目来投放广告，包括乔·罗根的播客，以及Gimlet、Parcast和Ringer。\n通过注册，您同意我们的隐私声明，欧洲用户同意数据传输政策。", "note_en": "Spotify is making more podcast acquisitions. The company  announced today it’s acquiring both Chartable and Podsights — two of the most prominent podcast marketing and ad attribution companies. The deal price hasn’t been disclosed, but this marks the first major acquisition the company has made this year in a long line of audio purchases.\n Both Podsights and Chartable allow podcasters and networks to include tags in their shows that are used to track who listened, if they heard an ad, and whether they took action upon hearing it. Spotify says it plans to use Podsights’ technology outside podcasting and will bring it to the “full scope of the Spotify platform, including audio ads within music, video ads, and display ads.” The Chartable acquisition appears to be more directed toward podcasters themselves rather than advertisers, particularly because of its technology like  SmartLinks.\n “These tools will make it easier for publishers to turn audience insights into action and expand their listenership while ultimately growing their businesses,” Spotify writes.\n This deal is particularly critical for the company as it tries to make its ad platform the best and most powerful in audio. If it wants everyone to purchase ads through its marketplace, then it needs technology to better figure out who’s listening to those ads and what they’re doing after hearing them. At the same time, marketing analytics are critical for show creators who want to ensure they’re spending their budgets well. This deal helps both creators and advertisers, two groups Spotify needs and wants to court.\n Spotify has been on a podcasting acquisition spree in recent years, spanning across advertising technology, audiobooks, and top creative talent. Last year, the company bought  Whooshkaa,  Podz,  Findaway, and  Locker Room to offer and promote more spoken audio content, which followed its purchase of  the major podcast ad platform Megaphone in late 2020. At the same time, Spotify has been scooping up major talent and shows to run ads on, including  Joe Rogan’s podcast, as well as  Gimlet,  Parcast, and  The Ringer.\n By signing up, you agree to our  Privacy Notice and European users agree to the data transfer policy.", "posttime": "2022-02-17 17:23:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "播客,acquiring,广告", "title": "Spotify正在收购Chartable和Podsights这两家播客分析公司，这两家公司允许播客和网络在节目中添加标签来跟踪听众", "title_en": "Spotify is acquiring Chartable and Podsights, two podcast analytics companies that let podcasters and networks include tags in shows to track listeners", "transed": 1, "url": "https://www.theverge.com/2022/2/16/22937826/spotify-podsights-chartable-acquisitions-podcast-marketing-platforms?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["播客", "acquiring", "广告"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073878, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在为Windows 11带来新的触摸手势、开始菜单文件夹、重新设计的任务管理器，以及更多的改进。今天，测试人员可以使用Windows 11的新版本，其中充满了新功能，看起来它们将显著提高Windows 11的整体可用性。\n新的“开始菜单”文件夹将允许Windows 11用户将“开始菜单”的固定部分自定义为文件夹。你可以将一个应用拖动到另一个应用上，创建一个文件夹，然后可以在文件夹中重新排列应用并将其删除。重命名文件夹的功能将在未来的测试版本中出现，但考虑到Windows 11在启动时没有很多方法来调整菜单设计，在“开始”菜单上看到更多的定制是件好事。\n如果你一直喜欢Windows 8中的手势，那么微软很快就会在Windows 11中推出五种新的触摸手势，这将使平板电脑的使用变得更简单。第一个功能是在任务栏上向上滑动以打开“开始”菜单，向下滑动以再次关闭它。您还可以在“开始”菜单上的“锁定”、“所有应用”和“推荐/更多”之间滑动。\n第三个新的触摸手势可以让你从任务栏右下角滑动以显示快速设置菜单——如果你需要快速切换飞行模式或访问蓝牙设置，这很有用。启动通知中心的动画也得到了改进，面向触摸的应用程序中有一个新的全屏抓取器，可以阻止你从平板电脑屏幕边缘意外滑动。微软还表示，在纵向和横向之间旋转设备会变得“更快”和“更灵敏”\n微软在Windows 11中的新快照布局功能也得到了改进，允许你将应用程序拖动到窗口顶部，并显示所有可以使用的布局。微软也在改进其聚焦功能，加入了一个“请勿打扰”模式。它使快速关闭通知变得容易得多，因此您只能看到优先级通知或警报通知。\n实时字幕将很快嵌入Windows 11，可以通过Winkey+CTRL+L快捷方式访问。现场字幕将使聋哑人或听力障碍者受益匪浅，但也可供任何人使用，并将在设备上根据包含音频的任何内容自动生成。字幕可以在窗口中浮动，也可以显示在屏幕的顶部或底部。这看起来对Windows 11的可访问性有很大的改进。\n其他改进包括在Windows 11任务栏上拖放的功能。这是首次发布时缺失的一大部分，因此Windows 11用户将很高兴看到这一回归。微软还在文件资源管理器中更容易查看OneDrive存储，并改进了快速访问功能，使您可以锁定文件和文件夹。\n为了降低个人电脑的能耗，微软还在Windows 11的电源设置中更改睡眠和关机的默认值。只有当你清洁安装Windows 11时，你才能看到这些新设置，但未来的新PC可能会附带更积极的睡眠/屏幕关闭选项。\n最后但并非最不重要的一点是，Windows 11中任务管理器的重新设计现在是正式的。它包括一个新的命令栏和一个黑色主题，以及一个可以限制应用程序消耗系统资源的效率模式。\n和往常一样，这些新的Windows 11功能目前只在测试中，这意味着其中一些功能可能会在2022年的每月更新中出现。微软刚刚发布了Windows 11的第一次大更新，该公司透露，它不会等待每年只推出一次新功能。", "note_en": "Microsoft is bringing new touch gestures, Start menu folders, a redesigned Task Manager, and lots more improvements to Windows 11. A new build of Windows 11 is  available to testers today, and it’s full of new features that look like they will significantly improve the usability of Windows 11 overall.\n The new Start menu folders will allow Windows 11 users to customize the pinned section of the Start menu into folders. You drag an app on top of another to create a folder, and you can rearrange apps within folders and remove them. The ability to rename folders is coming in future test builds, but it’s good to see more customization on the Start menu, given Windows 11 launched without many ways to tweak the menu design.\n   If you’ve always been a fan of the gestures in Windows 8, Microsoft is bringing five new touch gestures to Windows 11 soon that will make using tablets a little easier. The first is the ability to swipe up on the taskbar to bring up the Start menu and swipe down to dismiss it again. You’ll also be able to swipe between pinned, all apps, and recommended / more on the Start menu.\n The third new touch gesture lets you swipe from the bottom right of the taskbar to show the Quick Settings menu — useful if you need to toggle airplane mode quickly or access Bluetooth settings. The animations for bringing up the Notification Center have also been improved, and there’s a new full-screen gripper in touch-oriented apps that will stop you accidentally swiping from the edges of a tablet screen. Microsoft also says rotating your device between portrait and landscape orientation is getting “snapper” and “more responsive.”\n   Microsoft’s new Snap Layouts feature in Windows 11 is also getting improved, allowing you to drag an app to the top of a window and reveal all the layouts you can use. Microsoft is also improving its Focus feature to include a Do Not Disturb mode. It makes it a lot easier to quickly silence notifications, so you only see priority ones or ones for alarms.\n Live Captions will soon be built into Windows 11, accessible from a Winkey + CTRL + L shortcut. Live Captions will greatly benefit people who are deaf or hard of hearing, but they’re also available for anyone to use and will be automatically generated on-device from any content that includes audio. Captions can float in a window or be displayed at the top or bottom of a screen. This looks like a great accessibility improvement to Windows 11.\n     Other improvements on the way include the ability to drag and drop on the Windows 11 taskbar. This was a big missing part of the initial launch, so Windows 11 users will be happy to see this return. Microsoft is also making it easier to see your OneDrive storage within File Explorer and improving the Quick Access feature to let you pin files as well as folders.\n In a push to reduce energy consumption on PCs, Microsoft is also changing the default values for sleep and screen off in the power settings in Windows 11. You’ll only see these new settings if you clean install Windows 11, but new PCs in the future will presumably ship with more aggressive sleep / screen off options.\n   Last but not least, the Task Manager redesign in Windows 11 is now official. It includes a new command bar and a dark theme, alongside an efficiency mode that lets you limit apps from consuming system resources.\n As always, these new Windows 11 features are only in testing right now, which means some of them will likely show up in monthly updates throughout 2022. Microsoft just delivered  Windows 11’s first big update, and the company revealed it won’t wait to bring new features just once a year.", "posttime": "2022-02-17 17:21:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,windows,设计,发布,微软", "title": "微软发布了一个新的Windows 11预览版，带有可定制的开始菜单、五种新的触摸手势、实时字幕、任务管理器重新设计等等", "title_en": "Microsoft releases a new Windows 11 Preview build with a customizable Start menu, five new touch gestures, Live Captions, Task Manager redesign, and more", "transed": 1, "url": "https://www.theverge.com/2022/2/16/22937573/microsoft-windows-11-start-menu-folders-new-touch-gestures-features?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["microsoft", "windows", "设计", "发布", "微软"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073876, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周的论文来自2021年初的一次会议（SIGCOMM 2021）。我也在尝试一种新的论文评论格式，非常感谢您的想法。这些论文评论可以每周发送到你的收件箱，也可以订阅Atom订阅源。一如既往，请随时在Twitter上发表反馈或建议！\n《解除绑定的纽带：将IP与web服务和套接字分离以实现CDN级别的强大寻址灵活性》中的研究描述了CloudFlare将网络概念（主机名和套接字）与IP地址分离的工作。\n通过将主机名和套接字与地址分离，CloudFlare的基础设施可以快速更改为给定主机提供流量的机器，以及每个主机上运行的服务——作者称这种方法为寻址敏捷性。\n本文指出，减少IP地址的使用是将IP地址与主机名分离的最初动机。作者认为，CDN不一定需要大量IP地址才能运行——这与“大型CDN已经获得了大量IP地址：在撰写本文时，Cloudflare拥有170万个IPv4地址，Akamai拥有1200万个，Amazon AWS拥有超过5100万个！”的事实形成了对比\n传统上，许多CDN使用大量IP，因为它们的体系结构（如下图所示）将入口点和出口点放在公共互联网上——入口点接收来自客户端的请求，而出口点向缓存上的源服务器发出请求，但却错过了“什么是源服务器”上的这些文档有帮助。为了让这些机器可以访问，它们需要公共IP地址。\n其他因素可能会增加CDN的IP地址使用率。CDN可以将特定IP绑定到主机名，从而在CDN服务的主机名数量和CDN需要的地址数量之间建立关系。此外，CDN服务器通常在网络套接字上有一个上限，网络连接有用于连接的读/写缓冲区，以及一个名为sk_buff的内核数据结构。更多信息请点击这里，因此，客户机使用量的增加也会转化为更多的机器（以及相关的IP地址）。\n主机名到地址绑定控制主机名（如www.micahlerner.com）如何映射到可以服务请求的IP地址/计算机\n地址到套接字绑定控制机器上运行的服务。作为网络套接字的参考，我非常喜欢Beej的网络编程服务客户端请求指南。\n首先，本文描述了CloudFlare如何通过更改称为策略的配置来快速、动态地更新主机名到地址绑定——DNS服务器接收策略，并使用它们来决定为给定主机名返回哪些IP地址。\n一个示例策略允许主机名映射到从一组候选主机（称为池）中随机选择的IP地址。使用策略而不是从主机名到IP地址的固定映射与其他部署形成对比，在其他部署中，更改主机名到IP地址的映射在操作上既复杂又容易出错。\n通常一个服务在一组固定的端口上接收流量——这种方法有几个缺点，包括每个套接字都有开销（意味着在每台机器上可以运行固定数量的服务），并且不可能在同一台机器上运行两个端口重叠的服务而不造成复杂性。本文指出了一种方法，使用INADDR_ANY（此处为相关文档），允许一个套接字接收发送到机器上所有接口的数据包。这种方法并非没有缺点，比如可能会带来安全问题——如果内部流量与外部流量进入同一个套接字，内部服务可能会意外地响应外部请求。（因为它们不能重复使用同一个端口）。\n为了应对这些挑战，CloudFlare的系统引入了可编程套接字查找。CloudFlare博客提供了更多背景信息，使用BPF eBPF/BPF在过去的论文评论中出现过几次，我非常喜欢Julia Evans关于这个主题的这篇文章。（作为实现的一部分，作者构建了sk_查找，这里还有一个greta教程。）。这种方法基于规则在内核内部路由流量。一个示例规则可以将客户端流量路由到并行运行的同一服务的不同实例，每个实例都有一个单独的套接字。\n本文讨论了解决敏捷性问题所带来的许多性能和安全优势——重要的是，这些优势在其他重要系统指标没有明显变化的情况下可用！\n首先，分离主机名到地址和地址到套接字绑定允许CloudFlare CDN。本文指出，这种方法也可以转移到外部部署，但需要注意几点。使用更少的IP进行操作。地址不再需要保留供特定主机名使用，机器现在可以有更多的套接字。更少的IP地址会影响成本并降低进入壁垒——论文指出，主要云提供商拥有的IP空间价值不超过5亿美元（如果不是更多的话）。\nCloudFlare继续使用的IP地址也变得更易于管理。将IP地址动态分配给主机名将使机器（以及相关地址）脱机的操作任务变成了从提供给客户端的池中删除地址的问题。\n此外，论文中描述的随机化方法（池中的IP地址响应DNS查询而返回）可以实现更好的负载平衡。\n虽然本文讨论了寻址灵活性提供的可扩展性优势，但也讨论了限制地址使用之外的其他影响——例如，该方法可以帮助抵御拒绝服务攻击。\n如果某个特定地址受到攻击，则该地址的流量可以是blackholed CloudFlare在Blackhole路由上的参考。如果某个主机名受到攻击，则该主机名的通信量将均匀分布在地址池中的计算机上。", "note_en": "This week’s paper is from a conference earlier in 2021 (SIGCOMM 2021). I’m also trying out a new format for the paper reviews, your thoughts are greatly appreciated.These paper reviews can  be delivered weekly to your inbox, or you can subscribe to the  Atom feed. As always, feel free to reach out on  Twitter with feedback or suggestions!\n   The research in  The Ties that un-Bind: Decoupling IP from web services and sockets for robust addressing agility at CDN-scale describes CloudFlare’s work to decouple networking concepts (hostnames and sockets) from IP addresses.\n  By decoupling hostnames and sockets from addresses, CloudFlare’s infrastructure can quickly change the machines that serve traffic for a given host, as well as the services running on each host - the authors call this approach  addressing agility.\n  The paper notes  reducing IP address use as the initial motivation for decoupling IP addresses from hostnames. The authors argue that CDNs don’t necessarily need large numbers of IP addresses to operate - this is in contrast with the fact that, “large CDNs have acquired a massive number of IP addresses: At the time of this writing, Cloudflare has 1.7M IPv4 addresses, Akamai has 12M, and Amazon AWS has over 51M!”\n Traditionally, many CDNs use large numbers of IPs because their architecture (shown in the figure below) places entry and exit points on the public internet - entry points receive requests from clients, while exit points make requests to origin servers on cache miss    These docs on “What is an origin server?” are helpful. . For these machines to be reachable, they need public IP addresses.\n  Other factors can increase a CDN’s IP address usage. CDNs may bind specific IPs to hostnames, creating a relationship between the number of hostnames served by the CDN and the number of addresses the CDN requires. Furthermore, CDN servers normally have an upper bound on networking sockets   Network connections have read/write buffers for connections, as well as a kernel data structure called   sk_buff. More info  here. , so increased client usage also translates into more machines (and associated IP addresses).\n   Hostname-to-address bindings control how hostnames (like  www.micahlerner.com) map to IP addresses/machines that can serve requests\n Address-to-socket bindings control how services running on machines   For a reference on network sockets, I have really enjoyed  Beej’s Guide to Networking Programming  service client requests.\n First, the paper describes how CloudFlare can quickly and dynamically update  hostname-to-address bindings by changing configurations called  policies - DNS servers ingest  policies and use them to decide which IP addresses to return for a given hostname.\n  One example policy allows hostnames to map to IP addresses randomly chosen from a set of candidates (called a  pool). Using  policies instead of fixed mappings from hostnames to IP addresses is in contrast with other deployments, where changing  hostname-to-IP address mappings is both operationally complex and error-prone.\n  Normally a service receives traffic on a fixed set of ports - this approach has several downsides, including that each socket has overhead (meaning a fixed number of services can run on each machine) and it isn’t possible to run two services with overlapping ports on the same machine without complications   The paper notes one approach, using  INADDR_ANY (relevant documentation  here), that allows one socket to receive packets sent to all interfaces on a machine. This approach doesn’t come without its downsides, like potentially introducing security issues - if internal traffic goes to the same socket as external traffic, an internal service could accidentally respond to external requests.  (as they can’t re-use the same port).\n  To addresses these challenges, CloudFlare’s system introduces  programmable socket lookup   The CloudFlare blog has more background  here. , using BPF   eBPF/BPF have come up a few times in past paper reviews, and I really like  this post from Julia Evans on the topic.  (as part of the implementation, the authors built   sk_lookup   There is also a greta tutorial  here. ). This approach routes traffic inside of the kernel based on rules. An example rule could route client traffic to different instances of the same service running side-by-side, with a separate socket for every instance.\n   The paper discusses a number of performance and security benefits that  addressing agility provides - importantly, these benefits are available with no discernible change to other important system metrics!\n First, decoupling  hostname-to-address and  address-to-socket bindings allows the CloudFlare CDN   The paper notes that the approach is transferable to external deployments as well, with a few caveats.  to operate with fewer IPs. Addresses no longer need to be reserved for use by a specific host name and machines can now have significantly more sockets. Fewer IP addresses impacts cost and lowers barrier to entry - the paper notes that the IP space owned by the major cloud providers is worth north of 500 million USD (if not more).\n The IP addresses that CloudFlare does continue to use are also become easier to manage. Dynamically allocating IP addresses to hostnames turns the operational task of taking machines (and the associated addresses) offline into a matter of removing addresses from the pool provided to clients.\n Furthermore, the randomization approach described (where IP addressess from a pool are returned in response to DNS queries) by the paper results in better load balancing.\n  While the paper discusses the scalability benefits  addressing agility provides, it also discusses other implications beyond limiting address use - as an example, the approach can help with Denial of Service attacks.\n If a specific address is under attack, the traffic to that address can be blackholed   CloudFlare’s reference on blachole routing  here. . If a hostname is under attack, the traffic to that hostname will be distributed evenly across machines in the address pool.", "posttime": "2022-02-17 17:11:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "服务,ip,地址", "title": "将IP与服务和套接字分离以提高解决灵活性", "title_en": "Decoupling IP from services and sockets for addressing agility", "transed": 1, "url": "https://www.micahlerner.com/2022/01/13/the-ties-that-un-bind-decoupling-ip-from-web-services-and-sockets-for-robust-addressing-agility-at-cdn-scale.html", "via": "", "real_tags": ["服务", "ip", "地址"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073874, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通过将超细电极植入癫痫患者的颞叶，研究人员可以可视化大脑区域的活动。\n大多数小学生可能已经知道三个苹果加两个苹果加起来就是五个苹果。然而，在这样的计算过程中，大脑中发生了什么仍然是个未知数。波恩大学和图宾根大学目前的研究揭示了这个问题。\n研究人员受益于波恩大学医院癫痫科的一个特色。它专门研究癫痫患者大脑的外科手术。在一些患者中，癫痫发作总是起源于大脑的同一区域。为了精确定位这个缺陷区域，医生在病人体内植入了几个电极。这些探针可以用来精确地确定痉挛的起源。此外，单个神经元的活动可以通过接线来测量。\n五名女性和四名男性参与了这项研究。他们将电极植入所谓的大脑颞叶，以记录神经细胞的活动。同时，参与者必须完成简单的算术任务&#34;我们发现不同的神经元在加法时比减法时兴奋；波恩大学医院癫痫科的Florian Mormann教授解释道。\n并非有些神经元只对a&#34有反应+&#34; 签名和其他仅适用于a&#34-&#34; 标志：&#34；即使我们用文字代替了数学符号，效果仍然是一样的，&#34；埃丝特·库特（Esther Kutter）解释道，她正在莫尔曼教授（Prof.Mormann&#39）攻读博士学位；美国的研究小组&#34;例如，当受试者被要求计算&#39；5和3&#39；，他们添加的神经元重新开始活动；鉴于&#39；7减4和39；他们的减法神经元做到了&#34;\n这表明发现的细胞实际上编码了一个数学指令。因此，大脑活动非常准确地显示了受试者目前正在计算什么样的任务：研究人员给细胞喂食#39；将活动模式转换为自学计算机程序。同时，他们告诉软件受试者目前是在计算一个和还是一个差。在这个训练阶段之后，当算法遇到新的活动数据时，它能够准确地识别在哪个计算操作期间记录了这些数据。\n来自丁宾根大学的Andreas Nieder教授和Mormann教授一起监督了这项研究。34;我们从猴子的实验中知道，特定于某些计算规则的神经元也存在于它们的大脑中，&#34；他说&#34;然而，在人类身上，几乎没有这方面的数据&#34; 在分析过程中，两个工作组遇到了一个有趣的现象：研究的大脑区域之一是所谓的海马旁皮质。在那里，研究人员也发现了在加法或减法过程中特别放电的神经细胞。然而，当总结时，不同的加法神经元在同一个算术任务中交替活跃。打个比方，这就好像计算器上的加号键在不断地改变它的位置。减法也是如此。研究人员还将其称为&#34；动态编码&#34;\n&#34;这项研究标志着我们朝着更好地理解我们最重要的符号能力之一迈出了重要的一步，即用数字计算；莫曼强调。来自波恩和图宾根的两个研究小组现在希望确切地调查所发现的神经细胞在其中扮演的角色。基金：\n出版物：Esther F.Kutter、Jan Bostroem、Christian E.Elger、Andreas Nieder、Florian Mormann：《人脑算术规则处理的神经元代码》；当代生物学；内政部：https://doi.org/10.1016/j.cub.2022.01.054联系人：\n大脑中的一些神经元——在加法任务中特别活跃，而在减法任务中则特别活跃。\n在这项研究中，将微型电极植入五名女性和四名男性的大脑中，以测量单个神经元的活动。", "note_en": "Using ultrafine electrodes - implanted in the temporal lobes of epilepsy patients, researchers can visualize the activity of brain regions.\n    Most elementary school children probably already know that three apples plus two apples add up to five apples. However, what happens in the brain during such calculations is still largely unknown. The current study by the Universities of Bonn and Tübingen now sheds light on this issue.\n The researchers benefited from a special feature of the Department of Epileptology at the University Hospital Bonn. It specializes in surgical procedures on the brains of people with epilepsy. In some patients, seizures always originate from the same area of the brain. In order to precisely localize this defective area, the doctors implant several electrodes into the patients. The probes can be used to precisely determine the origin of the spasm. In addition, the activity of individual neurons can be measured via the wiring.\n  Five women and four men participated in the current study. They had electrodes implanted in the so-called temporal lobe of the brain to record the activity of nerve cells. Meanwhile, the participants had to perform simple arithmetic tasks. &#34;We found that different neurons fired during additions than during subtractions,&#34; explains Prof. Florian Mormann from the Department of Epileptology at the University Hospital Bonn.\n It was not the case that some neurons responded only to a &#34;+&#34; sign and others only to a &#34;-&#34; sign: &#34;Even when we replaced the mathematical symbols with words, the effect remained the same,&#34; explains Esther Kutter, who is doing her doctorate in Prof. Mormann&#39;s research group. &#34;For example, when subjects were asked to calculate &#39;5 and 3&#39;, their addition neurons sprang back into action; whereas for &#39;7 less 4,&#39; their subtraction neurons did.&#34;\n This shows that the cells discovered actually encode a mathematical instruction for action. The brain activity thus showed with great accuracy what kind of tasks the test subjects were currently calculating: The researchers fed the cells&#39; activity patterns into a self-learning computer program. At the same time, they told the software whether the subjects were currently calculating a sum or a difference. When the algorithm was confronted with new activity data after this training phase, it was able to accurately identify during which computational operation it had been recorded.\n Prof. Andreas Nieder from the University of Tübingen supervised the study together with Prof. Mormann. &#34;We know from experiments with monkeys that neurons specific to certain computational rules also exist in their brains,&#34; he says. &#34;In humans, however, there is hardly any data in this regard.&#34; During their analysis, the two working groups came across an interesting phenomenon: One of the brain regions studied was the so-called parahippocampal cortex. There, too, the researchers found nerve cells that fired specifically during addition or subtraction. However, when summing up, different addition neurons became alternately active during one and the same arithmetic task. Figuratively speaking, it is as if the plus key on the calculator were constantly changing its location. It was the same with subtraction. Researchers also refer to this as &#34;dynamic coding.&#34;\n &#34;This study marks an important step towards a better understanding of one of our most important symbolic abilities, namely calculating with numbers,&#34; stresses Mormann. The two teams from Bonn and Tübingen now want to investigate exactly what role the nerve cells found play in this.   Funding:\n  Publication: Esther F. Kutter, Jan Bostroem, Christian E. Elger, Andreas Nieder, Florian Mormann: Neuronal codes for arithmetic rule processing in the human brain; Current Biology; DOI:  https://doi.org/10.1016/j.cub.2022.01.054  Contact:\n  Some neurons in the brain - become active specifically in addition tasks, others in subtraction.\n  For the study, tiny electrodes were implanted in the brains - of five women and four men to measure the activity of individual neurons.", "posttime": "2022-02-17 17:06:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经元,active,研究", "title": "有些神经元在加法时是活跃的，有些神经元在减法时是活跃的", "title_en": "Some neurons are active when adding, others when subtracting", "transed": 1, "url": "https://www.uni-bonn.de/en/news/028-2022", "via": "", "real_tags": ["神经元", "active", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073873, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "蜱虫不仅仅是一种不便。在美国、加拿大和欧洲，莱姆病等危险且可能致命的蜱传播疾病正在上升，对任何在户外工作或重新创造的人构成威胁。生物化学与化学系助理教授莫妮卡·古利亚·努斯领导的一项研究合作；内华达大学里诺校区的分子生物学为蜱开发了突破性的基因编辑，通过减少蜱作为疾病和病原体转变的载体，可以减轻这种公共卫生关注。\n该研究团队的最新发现发表在iScience杂志上，这是一项新的协议，允许在蜱虫胚胎阶段进行基因编辑，此前人们认为这是不可能的。\nGulia Nuss实验室由农业、兽医和兽医学系助理教授Andrew Nuss参与了这项研究；来自内华达大学里诺校区的牧草科学和他的实验室，以及滨州州立大学传染病动力学中心和马里兰大学生物科学和生物技术研究所的研究人员。这项研究是由美国国立卫生研究院资助的，该项目得到了内华达大学里诺校区内华达生物信息学中心的进一步帮助。\n在这项研究中，研究人员使用两种方法成功地用CRISPR-Cas9对蜱进行了靶向基因破坏：胚胎注射和受体介导的卵巢货物转导（ReMOT Control），这是一种节肢动物基因编辑的劳动强度较低的方法，最早由宾夕法尼亚州立大学的合作者Jason Rasgon在昆虫中开发。\n虽然莱姆病是最常见的蜱传播疾病，但在美国，至少有20种不同的感染由蜱传播。每年诊断出30多万例莱姆病新病例，新病例数量和发现蜱的地区都在增加。\n2019年获得该大学早期职业创新者奖的古利亚·努斯说：“蜱是一种公共卫生公害。它们传播许多病原体，可导致人类、伴生动物和野生动物患病。”。“我们需要在分子水平上了解蜱的生物学。如果我们更好地了解[蜱]载体，我们可以找到新的方法来管理蜱和蜱传播疾病，无论是通过杀螨剂、疫苗还是药物开发。”\nGulia Nuss的工作引起了国会成立的蜱传疾病工作组的注意，她邀请她在2021年12月8日的最新会议上发表她的公众影响力研究和开创性的发现。她称这是一次“伟大的经历”，她可以详细阐述他们正在开发的方法如何在蜱虫研究领域带来新的重大发展。\n古利亚·努斯说：“这是蜱虫首次在基因水平上进行任何方式的修改，因此委员会对此非常感兴趣。”。“委员会成员希望更多地了解[我们小组的]工作，以及这如何适用于蜱传疾病研究的不同领域。”\nGulia Nuss和Andrew Nuss的实验室共同开发了蜱基因编辑的胚胎注射方案。有了这项新的发展，研究人员可以开始编辑基因组中的任何基因，让他们能够提出以前无法回答的问题。例如，当编辑或删除某些基因时，他们可以检查蜱虫发生了什么，以及这种改变是否以对人类无害的方式干扰病原体的发展。\n这一发现并非没有挑战。Gulia Nuss描述的一项重大斗争是开发一种注射蜱卵的方法。蜱之所以独特，是因为它们在卵上涂上了大量的蜡，而且在研究人员成功注入胚胎而不杀死卵之前，必须清除这些蜡。马里兰大学的Robert Harrell和昆虫胚胎注射专家的协作对于寻找蜱胚胎合适的注射条件是很重要的。\n农业学院院长比尔·佩恩（Bill Payne）说：“莫妮卡和她的合作者通过在基因水平上修改蜱虫来降低莱姆病的发病率，为我们在这所大学开展的开创性研究提供了一个很好的例子，这些研究对公共卫生问题产生了真正的影响。我们非常感谢他们加入我们的团队。”，生物科技及；自然资源。\n这个解决方案是在Harrell与内华达大学里诺校区合作访问期间进行的，在这期间，他、Gulia Nuss和Andrew Nuss考虑蜱生物学和蜱中的腺体，产生蜡并覆盖其中的卵。他们假设，如果他们能移除腺体，他们的蜡问题就会得到解决。古利亚·努斯说，这最终是正确的，导致了“技术突破”。\n安德鲁·努斯（Andrew Nuss）说，从其他人过去的遗传转化研究中学习对他们最终的突破起到了巨大的作用。他说，通过观察哪些有效，哪些无效，他们的实验室获得了有价值的见解，为他们的研究提供了信息。\nGulia Nuss希望，随着他们的实验室继续开发这些方法，他们将在大学以外的其他实验室可以轻松使用它们的地方得到足够的发展。有了更多研究人员的专业知识和合作努力，蜱虫研究可以取得更多进展，最终减少蜱传播疾病的威胁。", "note_en": "Ticks are more than an inconvenience. Dangerous and potentially fatal tick-borne diseases such as Lyme disease are on the rise in the United States, Canada and Europe, posing threats to anyone who works or recreates outdoors. A research collaboration led by Monika Gulia-Nuss, assistant professor in the  Department of Biochemistry &amp; Molecular Biology at the University of Nevada, Reno, has developed ground-breaking gene-editing for ticks that could mitigate this public health concern by decreasing the ability of ticks to be a vector for disease and pathogen transition.\n  The research team’s latest discovery, published in  iScience Journal, is a new protocol that allows gene editing at the embryo stage in ticks, previously thought to be impossible.\n    The Gulia-Nuss lab was joined in this research by Andrew Nuss, assistant professor in the  Department of Agriculture, Veterinary &amp; Rangeland Sciences and his lab from the University of Nevada, Reno, along with researchers from The Pennsylvania State University’s Center for Infectious Disease Dynamic and University of Maryland’s Institute for Bioscience and Biotechnology Research. The research was funded by the National Institutes of Health and the project was further assisted by the Nevada Bioinformatics Center at the University of Nevada, Reno.\n  In this study, the researchers successfully carried out targeted gene disruption in ticks with CRISPR-Cas9 using two methods: embryo injection and Receptor-Mediated Ovary Transduction of Cargo (ReMOT Control), a less labor-intensive method of gene-editing in arthropods first developed in insects by collaborator Jason Rasgon at Penn State.\n    While Lyme disease is the most common tick-borne disease, there are at least 20 different infections that are transmitted by ticks in the U.S. More than 300,000 new cases of Lyme disease are diagnosed each year, and the number of new cases and the areas where ticks are found are increasing.\n  “Ticks are a public health nuisance. They transmit many pathogens that can cause diseases in humans, companion animals and wild animals,” said Gulia-Nuss, a recipient of the University’s Early Career Innovator Award in 2019.  “We need to understand the biology of ticks on a molecular level. If we understand the [tick] vectors better, we can find new ways to manage ticks and tick-borne diseases as well, either through acaricide, vaccines or drug development.”\n    Gulia-Nuss’s work has attracted the attention of the Congressionally established  Tick-Borne Disease Working Group, which invited her to present her public-impact research and pioneering findings at their most recent meeting on Dec. 8, 2021. She described this as a “great experience” where she could elaborate on how the methods they are developing can lead to new and significant developments in the tick research space.\n  “This is the first time ticks have been modified in any way on the genetic level, so that was really interesting for the committee,” said Gulia-Nuss. “The committee members wanted to hear more about [our group’s] work and how this could be applicable to different areas of tick-borne disease research.”\n  Together Gulia-Nuss’ and Andrew Nuss’ labs are the first to develop the embryo injection protocol for gene editing for ticks. With this new development, researchers can start editing any gene in the genome, allowing them to ask questions that were not possible to answer before. For example, when editing or removing certain genes, they can examine what happens to the tick and if this alteration interferes with the pathogen development in a way that makes it harmless to humans.\n  The discovery did not come without its challenges. A major struggle that Gulia-Nuss described was developing a way to inject tick eggs. Ticks are unique because they put a large amount of wax on their eggs, and that wax must be removed before the researchers can successfully inject the embryo without killing the egg. Collaboration with Robert Harrell, of the University of Maryland and an expert in insect embryo injections, was important for finding appropriate injection conditions for tick embryos.\n  “By modifying ticks at a genetic level to try to reduce the incidence of Lyme disease, Monika and her collaborators provide an excellent example of the kind of groundbreaking research we do at this University to have real impact on a public health issue. We’re grateful to have them on our team,&#34; said Bill Payne, dean, College of Agriculture, Biotechnology &amp; Natural Resources.\n  The solution came about during a collaborative visit by Harrell to the University of Nevada, Reno, during which he, Gulia-Nuss and Andrew Nuss considered tick biology and a gland in ticks that produces the wax and covers the eggs in it. They hypothesized that if they could remove the gland, their wax problem would be solved. This ended up being correct, resulting in a “technological breakthrough,” Gulia-Nuss said.\n  Andrew Nuss said learning from others’ past research on genetic transformation played a huge role in their eventual breakthrough. He said that by looking at what has and hasn’t worked, their labs gained valuable insight that informed their research.\n  Gulia-Nuss hopes that as their labs continue to develop these methods, they will evolve enough where other labs outside of the University can easily use them. With the expertise and collaborative efforts of more researchers, more progress can be achieved in tick research, eventually reducing the tick-borne disease threat.", "posttime": "2022-02-17 17:03:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "疾病,editing,研究", "title": "抗击蜱传疾病的基因编辑取得突破", "title_en": "Gene-editing breakthrough made in the battle against tick-borne diseases", "transed": 1, "url": "https://www.unr.edu/nevada-today/news/2022/tick-transformation-breakthrough", "via": "", "real_tags": ["疾病", "editing", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073871, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2022年2月16日由何塞·阿尔梅达、詹姆斯·多昂、维尼修斯·弗拉加、朱塞利诺·朱塞利诺、大卫·李、凯尔·波特、拉斐尔·泰勒斯出版\n我们想介绍Flight SQL，这是Apache Arrow社区开发的一种新的客户机-服务器协议，用于与SQL数据库交互，该数据库使用内存中的Arrow列格式和Flight RPC框架。\nFlight SQL旨在提供与JDBC和ODBC等现有API大致相似的功能，包括执行查询；制作事先准备好的报表；以及获取有关支持的SQL方言、可用类型、已定义表等的元数据。然而，通过构建ApacheArrow，Flight SQL使客户端可以轻松地与Arrow本机数据库进行对话，而无需转换数据。通过使用Flight，它提供了一种有线格式的高效实现，该格式支持即时加密和身份验证等功能，同时允许进一步优化，如并行数据访问。\n虽然它可以直接用于数据库访问，但不能直接替代JDBC/ODBC。相反，Flight SQL作为一个具体的有线协议/驱动程序实现，可以支持JDBC/ODBC驱动程序，并减少数据库的实现负担。\n虽然像JDBC和ODBC这样的标准几十年来一直为用户提供良好的服务，但它们对于希望使用Apache Arrow或柱状数据的数据库和客户机来说是不够的。在这种情况下，基于行的API（如JDBC或PEP 249）需要转换数据，而对于本身是列式的数据库，这意味着数据必须转换两次，一次是为了在API中以行的形式呈现数据，一次是为了让使用者将数据返回到列中。与此同时，虽然ODBC等API确实提供了对结果缓冲区的批量访问，但这些数据仍必须复制到Arrow阵列中，以便与Turbodbc等项目实现的更广泛的Arrow生态系统一起使用。Flight SQL旨在摆脱这些中间步骤。\nFlight SQL意味着数据库服务器可以实现一个标准接口，该接口从一开始就是围绕Apache Arrow和列数据设计的。就像Arrow提供标准内存格式一样，Flight SQL使开发人员无需设计和实现全新的wire协议。如前所述，Flight已经实现了一些功能，比如在线加密和请求认证，而数据库不需要重新实现这些功能。\n对于客户端，Flight SQL提供了对查询结果的批量访问，而无需从其他API或格式转换数据。此外，通过将wire协议的实现工作推进到Flight和Flight SQL库中，需要为每种客户机语言或驱动程序编写的代码就更少了。通过使用Flight Underground，客户机和服务器可以合作实现优化，比如并行数据访问，这是Flight本身的最初目标之一。数据库可以将多个“端点”返回给Flight SQL客户端，然后客户端可以并行地从所有端点提取数据，从而使数据库后端能够水平扩展。\nFlight SQL充分利用了Flight RPC框架及其可扩展性，通过Protobuf定义了额外的请求/响应消息。我们将简要地介绍一下飞行SQL协议，但是C++和java已经实现了管理这项工作的客户端。完整的协议可以在GitHub上找到。\n客户端通过GetSchema RPC方法（获取响应的模式）或GetFlightInfo RPC方法（执行请求）发送请求。\n请注意，虽然Flight SQL是作为Apache Arrow 7.0.0的一部分发布的，但它仍在开发中，详细的文档即将发布。然而，实现已经在C++和java中已经提供，它提供了一个低级别的客户端，可以使用以及可以实现的服务器骨架。\n对于那些感兴趣的人来说，源代码中提供了一个包装Apache Derby的服务器实现和一个包装SQLite的服务器实现。还提供了一个演示客户端的简单CLI。最后，我们可以看一个执行查询和获取结果的简单示例：\nflight:：FlightCallOptions呼叫_options；//执行查询，获取描述如何获取结果的FlightInfo std:：cout&lt&lt&#34;执行查询：&#39&#34;  &lt&书信电报；标志_query&lt&lt&#34;&#39;&#34;  &lt&书信电报；std：：endl；箭头_ASSIGN _或_RAISE（std:：unique _ptr&lt；FlightInfo&gt；FlightInfo&gt；FlightInfo，客户端-&gt；执行（调用_选项，标记_查询））；//为（const flight:：FlightEndpoint&amp；endpoint:flight_info-&gt；endpoints（））按顺序获取每个分区（尽管这可以并行完成）{//这里我们假设每个分区都位于我们最初查询的同一台服务器上，但通常情况下并非如此：服务器可能会在我们必须连接的多台//其他服务器之间分割查询结果。//端点中的&#34；票证&#34；对客户端来说是不透明的。服务器使用它来//确定要返回的查询结果。箭头_ASSIGN _或_RAISE（自动流，客户端-&gt；DoGet（调用选项，endpoint.ticket））；//将所有结果读入箭头表，尽管我们可以在记录//批到达时迭代处理它们，以及std:：shared_ptr&lt；箭头：表格&gt；桌子箭头_RETURN_NOT_OK（流-&gt；ReadAll（&amp；table））；标准：cout&lt&lt&#34;读一个分区：&#34&lt&书信电报；std：：endl；标准：cout&lt&书信电报；表-&gt；ToString（）&lt&书信电报；std:：endl；}\n与PyODBC等现有库相比，Arrow Flight已经快了20倍（约00:21:00）。Flight SQL将把这些性能优势打包成一个标准接口，供客户机和数据库实现。\n预计将进一步完善和扩展协议。这项工作的一部分是使在飞行SQL上实现像JDBC这样的API成为可能；JDBC驱动程序正在积极开发中。虽然这再次引入了数据转换的开销，但这意味着通过实现Flight SQL，数据库可以让本机客户端和传统客户端都可以访问它自己。未来的其他改进可能包括Python绑定、ODBC驱动程序等。\n对于任何有兴趣参与其中的人，无论是作为贡献者还是采用者，请联系邮件列表或加入GitHub上的讨论。", "note_en": "Published   16 Feb 2022     By José Almeida, James Duong, Vinicius Fraga, Juscelino Junior, David Li, Kyle Porter, Rafael Telles\n  We would like to introduce Flight SQL, a new client-server protocol developed by the Apache Arrow community for interacting with SQL databases that makes use of the Arrow in-memory columnar format and the Flight RPC framework.\n Flight SQL aims to provide broadly similar functionality to existing APIs like JDBC and ODBC, including executing queries; creating prepared statements; and fetching metadata about the supported SQL dialect, available types, defined tables, and so on.By building on Apache Arrow, however, Flight SQL makes it easy for clients to talk to Arrow-native databases without converting data.And by using  Flight, it provides an efficient implementation of a wire format that supports features like encryption and authentication out of the box, while allowing for further optimizations like parallel data access.\n While it can be directly used for database access, it is not a direct replacement for JDBC/ODBC. Instead, Flight SQL serves as a concrete wire protocol/driver implementation that can support a JDBC/ODBC driver and reduces implementation burden on databases.\n   While standards like  JDBC and  ODBC have served users well for decades, they fall short for databases and clients which wish to use Apache Arrow or columnar data in general.Row-based APIs like JDBC or  PEP 249 require transposing data in this case, and for a database which is itself columnar, this means that data has to be transposed twice—once to present it in rows for the API, and once to get it back into columns for the consumer.Meanwhile, while APIs like ODBC do provide bulk access to result buffers, this data must still be copied into Arrow arrays for use with the broader Arrow ecosystem, as implemented by projects like  Turbodbc.Flight SQL aims to get rid of these intermediate steps.\n Flight SQL means database servers can implement a standard interface that is designed around Apache Arrow and columnar data from the start.Just like how Arrow provides a standard in-memory format, Flight SQL saves developers from having to design and implement an entirely new wire protocol.As mentioned, Flight already implements features like encryption on the wire and authentication of requests, which databases do not need to re-implement.\n For clients, Flight SQL provides bulk access to query results without having to convert data from another API or format.Additionally, by pushing the work of implementing the wire protocol into the Flight and Flight SQL libraries, less code has to be written for each client language or driver.And by using Flight underneath, clients and servers can cooperate to implement optimizations like parallel data access,  one of the original goals of Flight itself.Databases can return multiple “endpoints” to a Flight SQL client, which can then pull data from all of them in parallel, enabling the database backend to horizontally scale.\n  Flight SQL makes full use of the Flight RPC framework and its extensibility, defining additional request/response messages via  Protobuf.We’ll go over the Flight SQL protocol briefly, but C++ and Java already implement clients that manage much of this work.The full  protocol can be found on GitHub.\n  The client sends the request via the GetSchema RPC method (to get the schema of the response) or the GetFlightInfo RPC method (to execute the request).\n               Note that while Flight SQL is shipping as part of Apache Arrow 7.0.0, it is still under development, and detailed documentation is forthcoming.However, implementations are already available in C++ and Java, which provide a low-level client that can be used as well as a server skeleton that can be implemented.\n For those interested, a  server implementation wrapping Apache Derby and  one wrapping SQLite are available in the source.A  simple CLI demonstrating the client is also available. Finally, we can look at a brief example of executing a query and fetching results:\n flight :: FlightCallOptions  call_options ; // Execute the query, getting a FlightInfo describing how to fetch the results std :: cout  &lt;&lt;  &#34;Executing query: &#39;&#34;  &lt;&lt;  FLAGS_query  &lt;&lt;  &#34;&#39;&#34;  &lt;&lt;  std :: endl ; ARROW_ASSIGN_OR_RAISE ( std :: unique_ptr &lt; flight :: FlightInfo &gt;  flight_info ,  client -&gt; Execute ( call_options ,  FLAGS_query )); // Fetch each partition sequentially (though this can be done in parallel) for  ( const  flight :: FlightEndpoint &amp;  endpoint  :  flight_info -&gt; endpoints ())  {  // Here we assume each partition is on the same server we originally queried, but this  // isn&#39;t true in general: the server may split the query results between multiple  // other servers, which we would have to connect to.  // The &#34;ticket&#34; in the endpoint is opaque to the client. The server uses it to  // identify which part of the query results to return.  ARROW_ASSIGN_OR_RAISE ( auto  stream ,  client -&gt; DoGet ( call_options ,  endpoint . ticket ));  // Read all results into an Arrow Table, though we can iteratively process record  // batches as they arrive as well  std :: shared_ptr &lt; arrow :: Table &gt;  table ;  ARROW_RETURN_NOT_OK ( stream -&gt; ReadAll ( &amp; table ));  std :: cout  &lt;&lt;  &#34;Read one partition:&#34;  &lt;&lt;  std :: endl ;  std :: cout  &lt;&lt;  table -&gt; ToString ()  &lt;&lt;  std :: endl ; }\n   Compared to existing libraries like PyODBC,  Arrow Flight is already as much as 20x faster (~00:21:00).Flight SQL will package these performance advantages into a standard interface, ready for clients and databases to implement.\n Further protocol refinements and extensions are expected.Some of this work is to make it possible to implement APIs like JDBC on top of Flight SQL; a JDBC driver is being actively worked on.While this again introduces the overhead of data conversion, it means a database can make itself accessible to both Arrow-native clients and traditional clients by implementing Flight SQL.Other improvements in the future may include Python bindings, an ODBC driver, and more.\n For anyone interested in getting involved, either as a contributor or adopter, please reach out on the  mailing list or join the discussion on  GitHub.", "posttime": "2022-02-17 16:53:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "database,数据库,arrow,flight", "title": "Apache Arrow Flight SQL：加速数据库访问", "title_en": "Apache Arrow Flight SQL: Accelerating Database Access", "transed": 1, "url": "https://arrow.apache.org/blog/2022/02/16/introducing-arrow-flight-sql/", "via": "", "real_tags": ["database", "数据库", "arrow", "flight"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073870, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Melody是一种设计用于编译并与正则表达式保持1-1关系的语言，同时更具可读性和可维护性。\nmelody[选项]&lt；路径&gt；选项：-f，--file&lt；文件&gt；写入输出文件-n，-无颜色打印输出，无颜色-V，-版本打印版本信息-h，-帮助打印帮助信息\nof-在一个数字或一个范围之后，在一个要匹配的序列之前使用，例如5 of&#34；A&#34；；，等价于正则表达式{5}\nto-用于创建一个范围（作为量词或字符范围），例如5到9，相当于regex{5,9}if在of或[5-9]之前\n捕获-用于打开捕获或命名捕获块，相当于regex（…）\nsome-与of一起用于表示一个或多个模式，相当于regex+", "note_en": "Melody is a language designed to compile to and maintain a 1-1 relationship with regular expressions, while being more readable and maintainable.\n                     melody [OPTIONS]  &lt;PATH &gt;OPTIONS: -f, --file  &lt;FILE &gt; write to an output file -n, --no-color print output with no color -V, --version print version information -h, --help print  help information\n  of - used after a number or a range and before a sequence to be matched, e.g.  5 of &#34;A&#34;;, equivalent to regex  {5}\n to - used to create a range (either as a quantifier or as a character range), e.g.  5 to 9, equivalent to regex  {5,9} if before an  of or  [5-9] otherwise\n capture - used to open a  capture or named  capture block, equivalent to regex  (...)\n     some - used with  of to express 1 or more of a pattern, equivalent to regex  +", "posttime": "2022-02-17 16:52:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,language,用于", "title": "Melody–编译为正则表达式的语言", "title_en": "Melody – a language that compiles to regular expressions", "transed": 1, "url": "https://github.com/yoav-lavi/melody", "via": "", "real_tags": ["编译", "language", "用于"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073869, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "##我们在Linux/Ubuntu 18.04上进行了测试首先安装Python 3.6+（建议使用Anaconda）。导出PYTHONPATH=。#构建虚拟环境（推荐）。python-m venv-venv-source-venv/bin/activate#安装要求。pip安装-U pip安装Cython numpy==1.19.1pip安装火炬==1.9.0#火炬&gt；=1.9.0建议的PIP安装-r要求。txtsudo apt安装-y sox libsox-fmt-mp3bash mfa_usr/install_mfa。sh#安装强制对准工具\n@文章{ren2021portaspeech，标题={PortaSpeech:可移植和高质量生成文本到语音}，作者{Ren，Yi和Liu，Jinglin和Zhao，Zhou}，期刊={神经信息处理系统的进展}，卷={34}，年份={2021}\n@文章{liu2021diffsinger，title={Diffsinger:通过浅层扩散机制进行声音合成}，作者{Liu，Jinglin and Li，Chengxi and Ren，Yi and Chen，Feiyang and Liu，Peng and Zhao，Zhou}，期刊{arXiv预印本arXiv:2105.02446}，卷{2}，年份{2021}", "note_en": "## We tested on Linux/Ubuntu 18.04.   ## Install Python 3.6+ first (Anaconda recommended). export PYTHONPATH=.  # build a virtual env (recommended).python -m venv venv source venv/bin/activate  # install requirements.pip install -U pippip install Cython numpy==1.19.1pip install torch==1.9.0   # torch &gt;= 1.9.0 recommendedpip install -r requirements.txtsudo apt install -y sox libsox-fmt-mp3bash mfa_usr/install_mfa.sh   # install forced alignment tool\n      @article{ ren2021portaspeech,  title=  {PortaSpeech: Portable and High-Quality Generative Text-to-Speech },  author=  {Ren, Yi and Liu, Jinglin and Zhao, Zhou },  journal=  {Advances in Neural Information Processing Systems },  volume=  {34 },  year=  {2021 }}\n  @article{ liu2021diffsinger,  title=  {Diffsinger: Singing voice synthesis via shallow diffusion mechanism },  author=  {Liu, Jinglin and Li, Chengxi and Ren, Yi and Chen, Feiyang and Liu, Peng and Zhao, Zhou },  journal=  {arXiv preprint arXiv:2105.02446 },  volume=  {2 },  year=  {2021 } }", "posttime": "2022-02-17 16:51:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "huggingface,high,安装", "title": "NATSpeech：通过HuggingFace演示实现高质量的文本到语音", "title_en": "NATSpeech: High Quality Text-to-Speech Implementation with HuggingFace Demo", "transed": 1, "url": "https://github.com/NATSpeech/NATSpeech", "via": "", "real_tags": ["high", "安装"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2022年1月22日这是我的惯例：每次我进入一家二手书店，我都会直接去理科，寻找旧的电脑手册。它们很难找到，因为一旦它们停止使用特定的设备或软件，主人往往会把它们扔掉。手册对大多数人来说也不是最吸引人的读物，这增加了手册的稀有性；躺在海滩上时，很少有人愿意阅读IBM AS/400的旧手册。\n然而，把旧手册当作无用的纸堆，这对它们是一种严重的伤害。诚然，它们中的许多都很糟糕或完全无聊，但有些已经成熟，已经被遗忘了技术知识和高质量的设计。旧手册的作者通常比现在的科技作家享有更多的编辑资源，并且更加谨慎地编写手册和指南，因为他们无法承受出版时出现的严重错误。\nZX Spectrum用户指南（1984）是一本色彩斑斓、摇尾乞怜的书，用高度直观的说明指导新手。\n让我如此着迷的是，它们记录了应用计算机科学的历史。这让整个领域，包括科技通信，都有了过去的相似之处。我们不要忽视这一点：在一个初创企业似乎在模糊或不存在的基础上创造新事物的行业，阅读有关旧软件的文章提醒我们，确实有一个巨人，我们已经爬上了他的肩膀。\n这是一次令人谦卑的经历，但不仅仅是敬畏地看着昔日的荣耀。让我列出一些在阅读不太过时的手册时不断获得的见解：\n在过去，技术作者几乎孤立地编写文档，周围是复杂而类似孤立的企业文化。从人类学的角度来看，旧手册就像部落的手工艺品。由此产生的文档显示出令人惊讶的丰富设计和内容模式，比谷歌搜索堆栈交换问题和向条状文档鞠躬的时代更令人耳目一新。\n最初的Macintosh手册（1984）使用了精彩的插图来解释复杂的概念和过程。里面几乎没有文字。\n我们今天使用的大部分技术都是基于大学和研究实验室发明的技术。例如，C编程语言，也称为K&amp；《来自作者的R》发表于70年代，但仍被认为是技术写作的最佳范例。事实上，C语言仍然是最流行的编程语言之一。从这个意义上说，旧手册是常青的知识，可以阻止我们一次又一次地重新发明轮子。\nK&amp；R从第一页的一个例子开始。它的简洁和动手精神启发了几代科技作家。\n由于旧的手册无法通过超链接解决问题，它们通常比现代网络文档更加独立，而现代网络文档永远不完整，生活在一种永久的、无定形的维基状态中。当前的文档害怕吓唬通过谷歌登陆并渴望解决方案的用户；旧文献没有这样的疑虑，当需要时，它们会乐于深入研究概念和理论。这是一种完全不同的心态，更像是学校教师的心态，而不是社区管理者的心态。\nMS-DOS 6.22手册（1994）包含了以水果命名的目录的半幽默例子。开玩笑的笑话很常见。\n在旧电脑手册中有一种现代医生常常缺乏的平静。古老的手册花时间和空间来解释事物，而且解释的速度是当今罕见的。今天的程序员通过文档疯狂地控制着+Fing，打开几十个标签来搜索答案的片段。我并不是说我们现在使用文档的方式本质上更糟；相反，我的意思是，在敏捷商店里制作的文档还不成熟的时代，旧文档可能是质量的灯塔。我们要拥抱慢医生吗？\n《麦金塔圣经》（Macintosh Bible，第六版，1996年）中关于字体的章节很难忘记，这要归功于它悠闲的漫游系统和第三方字体。它厚颜无耻，令人愉快；为什么我们现在这么认真？我不知道。\n出于上述所有原因，我认为收集和阅读旧的计算机手册是一件好事，也是技术作家必须做的事。阅读过去的软件和硬件不仅能给我带来过去美好的回忆，还能帮助我成为一名更好的技术作家。\n你也可以从今天开始下载PDF版本的旧手册。以下链接包含许多旧手册和计算书籍：", "note_en": "Jan. 22, 2022   It’s my ritual: every time I enter a secondhand bookshop, I go straight to the  Sciences section and search for old computer manuals. They’re very hard to come by, as their owners tend to throw them away once they stop using a particular device or piece of software. Manuals also happen not to be the most engaging read for most people, which adds to their rarity; few want to peruse an old IBM AS/400 handbook while laying at the beach.\n Disregarding old manuals as useless piles of paper does them a grave disservice, though. Many of them are admittedly awful or outright boring, but some are ripe with forgotten tech lore and high-quality design. The writers of old manuals often enjoyed more editorial resources than tech writers are used to today, and produced handbooks and guides with greater care, because they couldn’t afford gross inaccuracies to go to press.\n  The ZX Spectrum User Guide (1984) is a colourful, tail-wagging joy of a book that guides newbies with highly visual instructions.\n What makes old manuals so fascinating to me is that they document the history of applied computer science. This gives the entire field, including tech comms, the resemblance of a past. Let’s not dismiss that: in a sector where startups seem to build new things on top of blurry or nonexistent foundations, reading about old software reminds us that there’s indeed a giant upon whose shoulders we’ve climbed.\n It’s a humbling experience, but there’s more to it than just looking in awe at the old glory. Let me list some of the insights I keep getting when reading not-so-obsolete manuals:\n In the old days, technical writers produced documentation in near isolation, surrounded by complex and similarly isolated corporate cultures. From an anthropological perspective, old manuals are like tribal artefacts. The resulting docs show surprisingly rich design and content patterns, more refreshing than we’re used to in the age of googling for Stack Exchange questions and of bowing to Stripe docs.\n  The original Macintosh manual (1984) uses brilliant illustrations to explain complex concepts and procedures. There’s very little text in it.\n Most of the tech we use today is based on technology invented in universities and research labs. For example,   The C Programming Language , also known as K&amp;R from its authors, was published in the 70s, but is still considered a prime example of technical writing. The C language, in fact, is still one of the most popular programming languages. Old manuals, in this sense, are evergreen knowledge that can prevent us from reinventing the wheel over and over again.\n  K&amp;R starts with an example right on the first page. Its succinctness and hands-on spirit has inspired several generations of tech writers.\n As old manuals couldn’t hyperlink their way out of trouble, they’re usually more self-contained than modern web documentation, which, never being complete, lives in a perennial, amorphous state of  wikiness. Current docs are afraid of scaring users who land via Google and crave for  solutions; old documentation has no such qualms, and happily delves into concepts and theory when the need arises. It’s an entirely different frame of mind, more akin to that of school teachers than to that of community managers.\n  The MS-DOS 6.22 manual (1994) contains semi-humorous examples of directories named after  fruits. Tongue-in-cheek jokes were common.\n There’s a  calmness in old computers manuals that modern docs often lack. Old handbooks took their time and space to explain things, and did so at a pace that’s rare to find nowadays. Today’s programmers furiously  Control+Fing through docs, opening tens of tabs in search for fragments of an answer. I’m not saying that the way we consume docs now is inherently worse; rather, I’m suggesting that old docs could be a beacon of quality in an age of half-baked docs made in agile shops. Shall we embrace  slow docs?\n  The chapter about fonts of The Macintosh Bible, 6th Ed. (1996) is hard to forget thanks to its leisurely walk through system and third-party fonts. It’s cheeky and delightful; why are we so serious now? I don’t know.\n For all the reasons I’ve just stated above, I think that collecting and reading old computer manuals is a good thing to do, and a must for technical writers. Reading about the software and hardware of yore not only brings me good memories of days past: it also helps me be a better technical writer.\n You too can start today by downloading PDF versions of old handbooks. The following links contain numerous old manuals and computing books:", "posttime": "2022-02-17 16:48:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,阅读,read,手册", "title": "我收集并阅读旧电脑手册", "title_en": "I collect and read old computer manuals", "transed": 1, "url": "https://passo.uno/why-collect-read-old-computer-manuals/", "via": "", "real_tags": ["电脑", "阅读", "read", "手册"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073867, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个新系列的第一部分中，Jay向我们展示了如何设置分布式端口生成器（Distributed Ports Builder，简称dpb）。在介绍了基本知识和一些需要避免的常见缺陷之后，我们将了解如何下载一组distfiles以供脱机机器使用，以及如何将distfiles目录从一个版本整齐地传送到下一个版本，避免过多和不必要的下载。\n本周，Jay向我们介绍了通过编译自定义内核可能实现的功能，然后向我们展示了如何编辑内核配置文件，再次避免常见的陷阱，并了解我们&#39；我们在变。最后，我们将介绍如何重新编译和安装新内核。\n紧跟着上周&#39；在第三部分中，我们学习了一些内核代码的工作原理，然后Jay向我们展示了如何修改它以改变字体，向控制台添加彩色渐变背景，改变光标的形状，等等！\n随着Jay查看键盘布局和wscons代码，本周又有更多内核黑客攻击。今天，我们&#39；我们将改变我们的按键映射，并为数字键盘找到新的用途！\n在本系列的第五部分中，我们了解了一些softraid代码，调整了RAID-1镜像集的性能，并设置了无密码磁盘加密。\n本周，随着我们将注意力从严格审查内核代码转移到更抽象的磁盘分区概念上，情况发生了轻微的变化。如果你认为磁盘标签只是一盒软盘中的粘性粘合剂，那么don&#39；别担心！我们&#39；我掩护你！\n被SSL搞糊涂了？唐&#39；我不知道你的企业社会责任从你的X509？试图从几个不同的在线指南中拼凑出你需要的信息，但发现它们都会让你朝着稍微不同的方向出发？创建了一个自签名证书，它看起来很好，但在安装到手机上时却失败得很惨？唐&#39；别担心！杰伊感受到了你的痛苦，并为你找到了答案&#39；我一直在寻找！\n远程访问一台服务器是一回事，但在一组分布式机器上运行不同的图形应用程序似乎是另一回事。跨越架构和操作系统的界限对Jay来说不是问题，他甚至还向我们展示了如何在混音中加入音频。\n我们通过实践来学习，但在这个过程中，我们有时会搞得一团糟。如果从头开始重新安装OpenBSD看起来像一场噩梦，那么本周&#39；s分期付款只为你准备！经过八周的实验，Jay向我们展示了全新的开始如何确保系统干净，避免升级问题，合理的磁盘分区，快速的备份和恢复，以及良好的降级能力！\n在本系列文章的最后，Jay介绍了OpenBSD中一些很少使用的功能，这些功能实际上非常有用。", "note_en": "In the first installment of this new series, Jay shows us how to set up the Distributed Ports Builder, or dpb. After covering the basics, and a few common pitfalls to avoid, we then see how to download a set of distfiles for use on off-line machines, as well as how to carry your distfiles directory neatly from one release to the next, avoiding excessive and unwanted downloads.\n    This week, Jay runs us through what we might achieve by compiling a custom kernel, then shows us how to edit the kernel configuration files, once again avoiding common pitfalls and understanding the options that we&#39;re changing. Finally we cover how to re-compile and install the new kernel.\n    Hot on the heels of last week&#39;s custom kernel configuration, in this third installment we learn how some of the kernel code works, and then Jay shows us how to modify it to change fonts, add a colored gradient background to the console, change the shape of the cursor, and more!\n    More kernel hacking this week, as Jay looks at keyboard layouts and the wscons code. Today, we&#39;ll be changing our key mappings around and finding new uses for the numeric keypad!\n    In the fifth installment of the series, we learn a bit about the softraid code, tweak performance of our RAID-1 mirror set, and set up passwordless disk encryption.\n    This week sees a slight change of gear, as we move our focus away from strictly reviewing kernel code and look at the more abstract concepts of disk partitioning. If you thought a disk label was just a sticky adhesive in a box of floppies, don&#39;t worry! We&#39;ve got you covered!\n    Confused by SSL? Don&#39;t know your CSR from your X509? Tried to piece together the information you need from several different on-line guides, but found that they all send you off in a slightly different direction? Created a self-signed certificate that looks fine but fails miserably when installed on your cell phone? Don&#39;t worry! Jay feels your pain, and has the answers you&#39;ve been searching for!\n    Remote access to a single server is one thing, but seemlessly running different graphical applications across a distributed set of machines is quite another. Crossing architecture and operating system boundaries is no problem for Jay, and he even shows us how to throw audio into the mix too.\n    We learn things by doing them, but in the process we sometimes make a mess. If re-installing OpenBSD from scratch seems like a nightmare, then this week&#39;s installment is just for you! After eight weeks of experiments, Jay shows us how a fresh start ensures a clean system and avoids upgrade woes, with sensible disk partitioning, quick backup and restore, and the ability to downgrade thrown in for good measure!\n    To conclude this ten-part series, Jay looks at some rarely used features of OpenBSD that are actually quite useful.", "posttime": "2022-02-17 16:46:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "鲁莽,guide,jay", "title": "OpenBSD的鲁莽指南", "title_en": "A Reckless Guide to OpenBSD", "transed": 1, "url": "https://www.exoticsilicon.com/jay/reckless_guide_to_openbsd/", "via": "", "real_tags": ["鲁莽", "guide", "jay"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073865, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多因素身份验证（Multi-factor Authentication，简称MFA，有时也称为2FA）是保护您的Office 365帐户不受试图访问它们的攻击者攻击的绝佳方法。作为第二种保护形式，以及密码，它提供了验证试图登录的用户真实身份的过程中的另一个步骤。有很多MFA选项，包括短信、一次性密码（OTP）和应用程序的推送通知。虽然这些方法的目的是提供额外的保护，但攻击者也开始寻找方法来破坏本应增强安全性的做法。在这种情况下，我们正在研究MFA疲劳，重点是当前的攻击向量推送通知垃圾邮件。我们将描述什么是MFA疲劳，它是如何执行的，并详细说明it专业人员在其组织内检测和缓解疲劳的步骤。\nGoSecure Titan实验室根据最近的调查，利用MFA疲劳攻击确定了新的威胁向量。我们的团队还发现，使用这种技术进行的攻击数量显著增加。\n在野外，积极性很高且已知存在威胁的参与者正在积极使用这种方法渗透Office 365帐户并危害整个组织。随着基于应用程序的身份验证机制越来越多地被采用，作为一种更安全的用户身份验证方式（相对于短信或电话），预计这种趋势在未来会增长，甚至会受到微软本身的鼓励。\n术语“MFA疲劳”是指通过多个账户中的MFA应用程序，用户在一天中收到大量通知或提示，以执行登录或批准不同的操作。这不应该与“密码疲劳”混淆，在这种情况下，用户必须记住多个帐户或事件的密码或PIN码的数量太多。MFA疲劳和密码疲劳确实有一个相似的主题，即用户“疲惫不堪”（或被流量淹没），并将开始将安全最佳实践放在一边，变得粗心大意，使他们的组织和帐户处于危险之中。\n如前所述，MFA可以使用多种介质对用户进行身份验证，例如SMS消息或电话，其中用户通过预先配置的电话号码验证其身份。一次性密码或OTP是另一种通过生成以固定时间间隔更新的密码来验证用户身份的方法。另一种选择是从应用程序推送通知。这是我们将重点关注的身份验证方法，因为它使攻击者能够执行推送通知垃圾邮件攻击。\n这种技术很简单，因为它只需要攻击者在尝试登录受害者帐户时手动甚至自动发送重复推送通知。使用的凭证可以通过暴力强制、密码重复使用或喷洒获得。一旦攻击者获得有效凭据，他们将重复执行推送通知垃圾邮件，直到用户批准登录尝试并允许攻击者访问该帐户。这通常是因为用户被通知分散了注意力或不知所措，在某些情况下，它可能被误解为错误或与其他合法身份验证请求混淆。\n这种攻击之所以特别有效，不是因为所涉及的技术，而是因为它针对的是MFA的人为因素。许多MFA用户不熟悉这种类型的攻击，也不理解他们批准的是欺诈性通知。其他人只是想让它消失，根本不知道自己在做什么，因为他们一直在批准类似的通知。他们无法通过“通知过载”来发现威胁。\n幸运的是，通过检查登录日志，可以直接从Azure门户检测到这种类型的攻击。我们强烈建议IT专业人士采取以下步骤：\n在监控下，您将看到登录日志，其中记录了有关用户登录和资源的信息。\n然后，通过无法获取拒绝的MFA推送通知列表来过滤登录状态。\n推送通知垃圾邮件应在成功列下为false，且MFA被拒绝；用户拒绝了结果详细信息下的身份验证。\nAzure日志分析还可以用于分析搜索此类行为的查询。这样的查询可以检索大量信息，用于检测这些攻击：\n签名\n此查询应检索上个月找到的条目，并可进行自定义，以检索更多结果，或根据搜索结果创建警报规则。\n如果Azure Sentinel正在使用，那么狩猎查询也可以应用于捕获、警报，甚至通过实现游戏本来响应匹配来减轻这些攻击。在Azure Sentinel搜索查询存储库中可以找到一些示例。\n有很多方法可以减轻这种类型的攻击。在这里，我们将重点介绍其中的一些功能，以便M365管理员可以选择任何适合他们需要的功能。我们将重点关注推送通知，因为密码复杂性规则和密码重用缓解措施应该已经到位。\n保护您的Microsoft 365帐户免受此攻击的一种有效方法是配置多因素身份验证服务的默认限制。这些限制（默认和最大）可以在Azure资源管理器文档中找到。\n通过使用Microsoft Authenticator的电话登录验证方法，用户可以帮助防止意外访问其帐户。在这种情况下，将生成一个唯一的两位数数字，并且必须在两侧进行确认。这对于攻击者来说是很难妥协的，因为攻击者会在手机中看到一个必须猜测的号码（攻击者无权访问）。只有攻击者才知道该号码，要批准访问，用户必须从三个选项中选择一个号码。这样会减少批准上述访问的可能性。在这里，您可以了解更多有关这种验证方法的信息。\n这是一个激进的举措，但也是一个快速的解决方案，因为它将禁止使用推送通知作为验证方法。以下是进行此更改的步骤：\n在“服务设置”页面的“验证选项”下，清除“通过移动应用程序通知”复选框。\n正如我们在本文中所讨论的，MFA疲劳是一个真正的问题，它可能会危及Microsoft Office 365帐户，但有许多方法可以保护我们自己免受MFA疲劳和当前推送通知垃圾邮件攻击的增加。要了解更多关于GoSecure Titan实验室的最新更新和研究，请定期查看此博客，并在Twitter和LinkedIn上关注GoSecure。", "note_en": "Multi-factor Authentication or MFA (sometimes referred as 2FA) is an excellent way to protect your Office 365 accounts from attackers trying to gain access to them. As a second form of protection, along with passwords, it supplies another step in the process to verify the real identity of the user trying to log in. There are many MFA options including SMS, One Time Passwords (OTP) and push notifications from an app. And while the intent of these methods is to provide extra protection, attackers have also begun to look for ways to compromise what should be a security enhancing practice. In this case, we are examining MFA Fatigue by focusing on a current attack vector—Push Notification Spamming. We’ll describe what MFA fatigue is, how it is carried out and detail the steps for IT professionals to detect and mitigate it within their organizations.\n   GoSecure Titan Labs identified new threat vectors using MFA Fatigue attacks based on recent investigations. Our team has also observed a significant increase in the number of attacks performed using this technique.\n In the wild, highly motivated and known threat actors are  actively using this kind of method to penetrate Office 365 accounts and compromise entire organizations. As app-based authentication mechanisms are being adopted increasingly as a safer way to authenticate a user (versus SMS or phone call) it is expected that this tendency will grow in the future, even be encouraged by  Microsoft itself.\n   The term “MFA Fatigue” refers to the overload of notifications or prompts via MFA applications, in multiple accounts, that the user receives during the day to perform logins or approve different actions. It should not be confused with “ Password Fatigue” in which the user is overwhelmed with the number of passwords or PINs they must remember for multiple accounts or events. MFA Fatigue and Password Fatigue do share a similar theme, that the user is “fatigued” (or overwhelmed by volume) and will start setting security best practices aside and become careless, putting their organization and their accounts in danger of compromise.\n As previously mentioned, MFA can use a diverse set of mediums to authenticate the user, such as SMS messages or phone calls where the user authenticates their identity via a pre-configured phone number. One Time Password or OTP is another way to verify the user’s identity by generating a passcode that is updated in fixed time intervals. Another choice is push notifications from an app. This  is the authentication method we are going to be focusing on, as it enables an attacker to perform a  push notification spamming attack.\n   This technique is simple as it only requires the attacker to manually, or even automatically, send repeated push notifications while trying to log into the victim’s account. The credentials used could be obtained via brute forcing, password reuse or spraying. Once the attacker obtains valid credentials, they will perform the push notification spamming repeatedly until the user approves the login attempt and lets the attacker gain access to the account. This usually happens because the user is distracted or overwhelmed by the notifications and, in some cases, it can be misinterpreted as a bug or confused with other legitimate authentication requests.\n This attack is particularly effective not because of the technology involved, but because it targets the human factor of MFA. Many MFA users are not familiar with this type of attack  and would not understand they are approving a fraudulent notification. Others just want to make it disappear and are simply not aware of what they are doing since they approve similar notifications all the time. They can’t see through the ‘notification overload’ to spot the threat.\n    Luckily, this type of attack can be detected directly from the  Azure portal by inspecting the  Sign-in Logs. We highly recommend that IT professionals take the following steps:\n Under the  Monitoring you will find  Sign-in Logs, where the information about user’s sign-ins and resources are logged.\n Then filter the sign-in  Status by  Failure to obtain a list of MFA push notifications denied.\n   Push notifications spamming should be  false under the Succeed column and  MFA denied; user declined the authentication under Result detail.\n   Azure Log Analytics can also be used to analyze the queries in search of this kind of behavior. A query like this can retrieve a lot of information that can be used to detect these attacks:\n SigninLogs \r| where TimeGenerated &gt;= ago(31d) \r| where ResultType == 500121 \r| where Status has &#34;MFA Denied; user declined the authentication&#34;\n This query should retrieve the entries found in the last month and can be customized to retrieve even more results or  create alert rules to be notified based on the results of searches.\n If Azure Sentinel is in use, then hunting queries can be applied to also catch, alert and even mitigate these attacks by implementing  playbooks in response to matches. Some examples can be found in the  Azure Sentinel hunting queries repository.\n   There are many ways to mitigate this type of attack. Here, we are going to highlight some of them so that M365 administrators can choose whatever fits their needs. We are going focus on push notifications, since password complexity rules and password reuse mitigations should already be in place.\n   One effective way to protect your Microsoft 365 accounts against this attack is to configure the default limits of the Multi-Factor Authentication service. These limits, both default and maximum, can be found in  Azure Resource Manager documentation.\n   A user can help prevent inadvertent access to their account by using the Microsoft Authenticator’s phone sign-in verification method. In this scenario, a unique two-digit number is generated and must be confirmed on both sides. This is very hard for an attacker to compromise since the attacker is shown a number that must be guessed in the phone (which the attacker doesn’t have access to). Only the attacker will know the number and to approve access, the user would have to pick a number out of three options. This way it will diminish the possibilities of approving said access.  Here you can learn more about this verification method.\n    This is a radical move, but a quick solution as will disable the use of push notification as a  verification method. These are the steps to make this change:\n On the  Service Settings page, under  verification options, and clear the  Notification through mobile app checkbox.\n   As we discussed in this post, MFA Fatigue is a real concern with potential implications to compromise Microsoft Office 365 accounts, but there are many ways to protect ourselves from MFA Fatigue and the current rise in Push Notification Spamming attacks. To learn more about GoSecure Titan Labs latest updates and research, check this blog regularly and follow GoSecure on  Twitter and  LinkedIn.", "posttime": "2022-02-17 16:32:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,mfa", "title": "当前针对Microsoft Office 365用户的MFA疲劳攻击活动", "title_en": "Current MFA fatigue attack campaign targeting Microsoft Office 365 users", "transed": 1, "url": "https://www.gosecure.net/blog/2022/02/14/current-mfa-fatigue-attack-campaign-targeting-microsoft-office-365-users/", "via": "", "real_tags": ["microsoft", "mfa"]}]