[{"category": "", "categoryclass": "", "imagename": "69a79a1e0ea19316b2ac4dd0400387fc.jpg", "infoid": 1066522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Eric Dahan是开放影响力的联合创始人兼首席执行官，是第一个拥抱了影响者营销的机构之一。\n  Peloton只是社会在越来越数码数字世界中融入客户体验的各个方面的一个例子。无论是考虑一家新餐厅要查看，一部电影要查看还是购买产品，大多数人都会在做出最终决定之前查看评论。他们希望社会证明作为质量和相关的指标。\n  影响因素是这种对社会验证的渴望的自然副产品，而作为社会渗透客户的旅程，创作者已成为验证和信任的重要来源。实际上，社会验证是建立的社交平台，因此我们如何在线获得相关性的重要组成部分 - 以及社会的更深入的整合正在改变品牌和数字创作者之间的动态。\n  品牌赞助是创造者的圣杯，希望在线影响货币化。据透明表报告称，品牌伙伴关系仍然是大多数数字创造者的1号收入来源。\n 然而，数字创建者有更多的货币化选项可供选择，感谢Patreon，Affiliate平台，付费内容平台和平台收入分担，使得在不依赖品牌赞助的情况下更容易赚取生活。\n  您是否与一个有才华的个人或代理商合作，帮助您找到并保留更多用户？回复我们的调查，帮助我们找到最佳启动增长营销人员！\n  因此，创作者正在多样化他们的收入流，这对于一些创造者来说，这使他们能够更具选择他们与之合作的品牌。更重要的是，创造者并不依赖于一个渠道或一种形式的收入。 \nYouTube创作者可能拥有最多的收入，通常结合品牌赞助，订阅模式，联盟交易，提示/捐赠，他们的品牌产品和收入份额。但是，重要的是要注意，并非所有货币化选项都适用于每个创建者。但是，有了这么多选择来选择，作为数字创造者的生活比以往任何时候都更容易获得。\n  广告收入分享：广告是在线创建者最传统的收入形式。使用此模型，广告注入创建者的内容，并根据印象提供一定比例的收入。但是，收入拆分可以根据平台而变化，一些平台有特定的门槛创作者必须在参加广告收入分担之前击中。\n 联盟营销：与广告或品牌赞助类似，联盟营销是根据销售的产品份额份额的协议。当创建者有博客，网站或YouTube帐户时，这种安排通常最佳。联盟链接允许影响者主动选择他们想要谈论并赚取的产品，而不是等待品牌交易来实现。 ", "note_en": "Eric Dahan is co-founder and CEO of  Open Influence, one of the first agencies to embrace influencer marketing.\n  Peloton is just one example of how social is being integrated into every aspect of the customer experience in an increasingly digital world. Whether it’s considering a new restaurant to check out, a movie to see or a product to buy, most people look at reviews before making a final decision. They want social proof as an indicator of quality and relevance.\n  Influencers are a natural byproduct of this desire for social validation, and as social permeates the customer journey, creators have become an essential source of validation and trust. Indeed, social validation is what social platforms are built on, so it’s a significant component of how we derive relevance online — and the deeper integration of social is changing the dynamic between brands and digital creators.\n  Brand sponsorships are the holy grail for creators hoping to monetize their online influence. According to an  eMarketer report, brand partnerships are still the No. 1 source of revenue for most digital creators.\n However, digital creators have a lot more monetization options to choose from, thanks to Patreon, affiliate platforms, paid content platforms and platform revenue sharing, making it easier to earn a living without relying so heavily on brand sponsorships.\n  Have you worked with a talented individual or agency who helped you find and keep more users?  Respond to our survey and help us find the best startup growth marketers!\n  As a result, creators are diversifying their revenue streams, which, for some creators, allows them to be more selective about the brands they work with. What’s more, creators aren’t reliant on just one channel or one form of revenue.\n YouTube creators probably have the most diversified revenue, often combining brand sponsorships, subscription models, affiliate deals, tipping/donations, their line of branded products and revenue share. However, it’s important to note that not all monetization options apply to every creator. But with so many options to choose from, making a living as a digital creator is more accessible than ever.\n  Ad revenue sharing: Advertising is the most traditional form of revenue for online creators. With this model, ads are injected into and around the creator’s content, and they make a certain percentage of revenue based on impressions. However, the revenue split can vary based on the platform, and some platforms have a specific threshold creators must hit before they can participate in ad revenue sharing.\n Affiliate marketing: Similar to advertising or a brand sponsorship, affiliate marketing is an agreement for a share of revenue based on products sold. This kind of arrangement generally works best when the creator has a blog, website or YouTube account. Affiliate links allow the influencer to proactively choose the products they want to talk about and earn from, rather than having to wait for a brand deal to come their way.", "posttime": "2021-06-18 01:16:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "提示,brands,收入", "title": "5个想要成功的品牌提示，以便在流行营销的新时代成功 ", "title_en": "\n\t\t\t\t5 tips for brands that want to succeed in the new era of influencer marketing\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/5-tips-for-brands-that-want-to-succeed-in-the-new-era-of-influencer-marketing/", "via": "", "real_tags": ["提示", "brands", "收入"]}, {"category": "", "categoryclass": "", "imagename": "988071a61ad46a636d446c5f364a43dd.jpg", "infoid": 1066521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "因此，已经启动了许多初创公司来解决这种差距，现在，较大的公司也在进入磨损。\n Gusto，它开始与SMBS的薪水，此后扩展到员工登机，保险，福利和其他人力资源产品，今天宣布它正在收购Ardius，这是一个旨在自动化税务合规性的初始税收税收税。\n  基于洛杉矶的公司由Joshua Lee于2018年成立，他们以前在会计公司Ey曾多于十多年。该交易条款未披露，Ardius将作为独立业务运行，与整个团队过渡到Gusto。\n 这里的策略很简单：大多数R＆amp; D Credits需要工资单件，已经存储在Gusto的记录系统中的数据。它目前的化身中的ardius旨在挖掘多个工资管理数据提供商并提取该数据并将其转换为可验证的税务文件。通过这种界面，公司可以自动为Gusto广泛的客户自动做到这一点。\n Joshua Reeves，Gusto的联合创始人和首席执行官表示，该收购符合公司的长期关注客户和简单性。 “我们希望汇集技术，伟大的服务，[和]使政府更简单，”他说。 “在某些方面，我们正在做的很多东西 - 使工资单更简单，使医疗保健更简单，使PPP [贷款]和税收抵免更简单 - 只是让这些事情正常工作。”该公司可能会建立这样的功能，但他指出的是，“上市时间”是制造恒星第一次收购的关键点。\n 同事伦敦，联合创始人和首席产品官员表示，“我们一直在看这个空间很长一段时间，因为它有点连接到我们建立一种自以为是的产品的原始产品原则之一，”他说。在作为人力资源复杂的空间中，“我们希望在那里并成为顾问，而不仅仅是一个工具。这只是一个如此优秀的例子，您可以使用我们已经拥有的工资数据，只需几天点击即可在几天内完成，从而获得商业的真正重要的现金流。“他指出，税收抵免是“长期以来一直在路线图的东西。”\n Gusto与超过100个第三方服务合作，它集成在其平台之上。 Reeves强调，虽然Ardius是Gusto的一部分，但所有公司都可以直接与产品竞争的公司 - 将继续进入平台数据。该公司在其发布中指出，Boast.ai，Clarus，Neo.tax和TaxTaker只是与今天融合的其他一些税务产品。 \n当然，ardius只是在R＆amp; D和经济发展税收信贷空间中出现的竞争对手之一。我最后一次在2020年为其种子循环进行的主体传输，刚刚在3月份筹集了6000万美元的资金，由SignalFire领导。与此同时，我去年也熟悉的Neo.tax筹集了550万美元。\n  Reeves是关于关注的乐观，空间是奖金和舞会的潜在竞争。当涉及到R＆amp; D税收抵免时，“无论是什么创造更多的可访问性，我们都是一个粉丝，”他说。 “很大，有更多的意识，因为它仍然坦率地利用了。”他强调，Gusto能够提供比空间中的其他竞争对手的数据和软件更具垂直整合的解决方案。\n 虽然大流行尤其袭击了SMB，但往往缺乏大型公司在危机中幸存下来的金融，而Gusto实际上将其业务扩大，因为新公司发芽了。 Reeves表示，该公司在最后一家财政年度将其客户群增长50％，该公司于4月结束。他说，它“在经济危机中处于健康大流行和经济危机中，是薪水和医疗保健的事情非常重要，”他说。 Gusto推出了一项帮助SMB收集政府的PPP贷款。\n 该公司的主要业务基础位于旧金山，丹佛和纽约市，公司拥有不断增长的偏远工人，包括Ardius船员，他们将保持在洛杉矶。虽然Reeves在未来的收购上贬低，但Gusto专注于向员工和企业的综合金融健康平台扩大，可能会暗示未来的额外收购。 ", "note_en": "So a number of startups have been launched to solve that gap, and now, larger companies are entering the fray as well.\n Gusto, which started off with payroll for SMBs and has since expanded into employee on-boarding, insurance, benefits, and other HR offerings, today announced that it is acquiring  Ardius, a startup designed to automate tax compliance particularly around R&amp;D tax credits.\n  The Los Angeles-based company was founded by Joshua Lee  in 2018, who previously had worked for more than a decade at accounting firm EY. Terms of the deal were not disclosed, and Ardius will run as an independent business with the entire team transitioning to Gusto.\n The strategy here is simple: most R&amp;D credits require payroll documentation, data that is already stored in Gusto’s system of record. Ardius in its current incarnation was designed to tap into a number of payroll data providers and extract that data and turn it into verifiable tax documents. With this tie-up, the companies can simply do that automatically for Gusto’s extensive number of customers.\n Joshua Reeves, co-founder and CEO of Gusto, said that the acquisition falls in line with the company’s long-term focus on customers and simplicity. “We want to bring together technology, great service, [and] make government simpler,” he said. “In some ways, a lot of stuff we’re doing — make payroll simpler, make healthcare simpler, make PPP [loans] and tax credits simpler — just make these things work the way they’re intended to work.” The company presumably could have built out such functionality, but he noted that “time to market” was a crucial point in making Ardius the company’s first acquisition.\n Tomer London, co-founder and chief product officer, said that “we’ve been looking at this space for a long time because it kind of connects to one of our original product principles of building a product that is opinionated,” he said. In a space as complicated as HR, “we want to be out there and be an advisor, not just a tool. And this is just such a great example of where you can take the payroll data that we already have and in just a few clicks and in a matter of a few days, get access to really important cash flow for a business.” He noted that tax credits is “something that’s been on our roadmap for a long time.”\n Gusto works with more than 100 third-party services that integrate on top of its platform. Reeves emphasized that while Ardius is part of Gusto, all companies — even those who might compete directly with the product — will continue to have equal access to the platform’s data. In its release, the company pointed out that Boast.ai, Clarus, Neo.Tax, and TaxTaker are just some of the other tax products that integrate with Gusto today.\n Of course, Ardius is just one of a number of competitors that have popped up in the R&amp;D and economic development tax credit space. MainStreet,  which I last profiled in 2020 for its seed round, just raised $60 million in funding in March led by SignalFire. Meanwhile, Neo.tax,  which I also profiled last year, has raised a total of $5.5 million.\n  Reeves was sanguine about the attention the space is garnering and the potential competition for Ardius. When it comes to R&amp;D tax credits, “whatever creates more accessibility, we’re a fan of,” he said. “It’s great that there’s more awareness because it’s still under-utilized frankly.” He emphasized that Gusto would be able to offer a more vertically-integrated solution given its data and software than other competitors in the space.\n While the pandemic particularly hit SMBs, who often lacked the financial wherewithal of larger companies to survive the crisis, Gusto actually expanded its business as new companies sprouted up. Reeves said the company grew its customer base 50% in its last fiscal year, which ended in April. It “turns out in a health pandemic and in an economic crisis, things like payroll and accessing health care are quite important,” he said. Gusto  launched a program to help SMBs collect the government’s stimulus PPP loans.\n The company’s main bases of operation are in San Francisco, Denver and  New York City, and the company has a growing contingent of remote workers, including the Ardius crew, who will remain based in LA. While Reeves demurred on future acquisitions, Gusto’s focus on expanding to a comprehensive financial wellness platform for both employees and businesses would likely suggest that additional acquisitions may well be in the offing in the future.", "posttime": "2021-06-18 01:16:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "扩展,acquisition", "title": "Gusto首次采购，购买亚当乌斯扩展到研发税收抵免 ", "title_en": "\n\t\t\t\tGusto makes first acquisition, buying Ardius to expand into R&D tax credits\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/gusto-makes-first-acquisition-buying-ardius-to-expand-into-rd-tax-credits/", "via": "", "real_tags": ["扩展"]}, {"category": "", "categoryclass": "", "imagename": "7a6c969c8cfc75549e4bff5f075a0096.jpeg", "infoid": 1066520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个故事专门用于内幕订阅者。成为一个内幕，现在开始阅读。\n  三年来，直到他的出发，这1月，西蒙迈克伦担任刀片通信总监，该城市航空启动今年早些时候公布的估值超过8亿美元。他的工作在那段时间内很大程度上是你对公司发言人的期望 - 除了西蒙迈凯伦没有实际存在的事实。\n 在Insider试图验证麦克拉伦＆＃39;刀片首席执行官Rob Wiesenthal在接受采访时承认，迈凯轮是他和他的同事发明的制作角色，以及Wiesenthal在与新闻网点的电话交谈中伪装成迈凯轮。该仪式持续多年，据杜绝了众多的记者，并包括在麦克拉伦周围的令人费解的公共戏剧。这一切都没有真实。\n  迈凯轮在刀片电子邮件地址之外没有实质上在线存在，这是去年12月创建的推特帐户，以及去年11月创建的中型档案。他的个人网站创建了这一月，通过代理商登记，他使用了1966年照片的英国赛车司机Graham Hill跨过他的账户来代替一个简介图片。\n 仍然，自2018年的虚荣博览会上表观亮相以来，麦克拉伦被各种新闻网点视为真正的人类。担任公司的刀片的制度声音＆＃39;遵守联邦法规，医疗供应班车和与东汉普顿镇的谈判，迈凯轮被纽约时报引用，纽约邮政，遏制，华盛顿邮报，福克斯业务和CNN。\n 麦克拉伦＆＃39;最近的官方新闻稿似乎已于2020年11月发出，就像刀片开始寻找外部表示一样。但他的声音继续以短，自以为是博客帖子的形式生活，称为＆＃34;西蒙麦克拉伦＆＃39;奇怪的内容，＆＃34;这款刀片于10月20日开始向其电子邮件列表的订阅者发送。十二个星期，迈凯轮 - 在刀片和＃39; s标志下 - 在一些大流行问题上称重，包括搬到迈阿密，会见缩大，并光顾纽约。餐馆。\n  6月份，内幕试图在威斯彻斯特电话号码中达到迈凯轮，他以前曾经曾在2020年8月推出的内幕记者，并被宣传到2019年的刀片推特账户上的迈凯轮。该电话是回答Lee Gold，Blade＆＃39;员工主任。 \n询问为什么他回答麦克拉伦＆＃39;金说，＆＃34;我安排了西蒙的时间表。＆＃34;他补充说，他曾在谋面迈凯轮，尽管迈凯轮在上刀片的工作人员不再，＆＃34;他有时会做一些自由职业者为我们作为代言人＆＃34;\n 黄金同意安排与迈凯轮进行面试，要求内幕通过电子邮件发送请求。在一个后续电话中，金子说，他在几个月内看到了麦克拉伦，并将电子邮件发给麦克拉伦＆＃39; s的地址已经反弹回来。然后他似乎阻止了这个记者＆＃39; s号码。他拒绝再次达成，以回答有关迈凯轮的进一步问题。\n     不久之后，知情人从罗布·威森塔尔，谁考上发明了迈凯轮接到了一个电话。他描述了创建虚假的人物角色和进行蒙混过关接受记者采访的小企业之间的共同实践的做法。\n ＆＃34;作为一家小公司，每个人都必须穿多个帽子。何时适合发言人回应新闻查询，而不是首席执行官，因为我们没有发言人，我们使用了假名，＆＃34; Wiesenthal说。他声称，除了迈凯伦＆＃39;姓名和身份外，发言人总是讲述了真相。 ＆＃34;在2020年夏天，作为一家私营公司，我们使用新闻查询假名停止，我们现在有一个代表我们的外部公司，我们向任何感觉欺骗的人道歉。＆＃34;\n Wiesenthal表示，迈凯轮角色最初开始作为一个小型未经训练的团队的解决方案。 ＆＃34;我＆＃39; m是唯一会与新闻发言的人，除非通过我的电子邮件。我们只是没有发言人，人们不得不穿多个帽子，＆＃34;他说。 ＆＃34;有没有被两面三刀意图。很多人都想要一个发言人的名字，这是一个不适合首席执行官说话。还有很多人没有关于如何与新闻发言的培训。有很多小公司已经做到了这一点并继续这样做，但在某个方面，你大得多，我们过量了。＆＃34;\n Wiesenthal表示，麦克拉伦＆＃39;作为博主和通讯作家的职业是一名中学项目，它是脱离大流行的二级项目，部分是为了保持刀片＆＃39; S营销和创意团队忙碌。\n ＆＃34;在黑暗的日子里，我真的认为它让人去，＆＃34; Wiesenthal说。 ＆＃34;我们有几个星期的时间在锁上时没有飞行。但人们想参与并让人们与我们的传单进行工作和沟通，我们会说，＆＃39;飞往机场。＆＃39;因此，我们写了什么样的生活在城市＆＃34有趣的事情。 \n一位前索尼行政和终身纽约人，WIENENTHAL作为华纳音乐的首席运营官，于2015年推出刀片。该公司，描述了自己作为＆＃34;城市空中移动平台＆＃34;经纪人在直升机和特许喷气机上的航班，吸引了重量级的投资，如Barry Diller和David Geffen在公开上通过与今年早些时候合并。它现在在纳斯达克交易。\n Spac协议与迈凯轮恰逢迈克伦＆＃39;官方退出刀片。在2021年1月，公司拍摄了通信公司ICR的几周后，刀片向订阅者发出了一个不寻常的信，解释了迈凯轮将离开公司，并部分地与他一起参加通讯不再遵守刀片＆＃39;试图编辑他的观点。\n ＆＃34;我们生活在一个唯一的偏光时间，＆＃34;声明说。 ＆＃34;如此，尽管我们喜欢西蒙麦克拉伦＆＃39;他的奇怪内容和他独特的看法，在这一天和他的年龄，曾经是一个帝豪纽约人，这两方面都是西蒙和公司决定它＆＃39;我们最好的是，我们将他的每周通讯从刀片交给他。＆＃34;\n     这封信引用了迈凯轮解释他不再是刀片的适当发言人。 ＆＃34;我的每周发货对我或读者没什么兴趣，除非他们创造情感笑声或可能烦恼，有时，幸福甚至意外的敌意。我很欣赏平台刀片给了我，但我处在我的生活中，我对刀片或其合作伙伴的兴趣很小，削弱了我的散文，以避免任何读者可能被我的观点引发。在过去的几周里，刀片＆＃39;编辑过程已经创造了梅尔巴吐司的文学等效物。简单地说，我的观点不受谈判。＆＃34;\n Wiesenthal表示，麦克拉伦周围的戏剧似乎是岩石离开开始作为一个＆＃34;里面的笑话和＃34;公司中的创意团队。\n 无论他是否存在，麦克拉伦肯定是关于一件事的钱：1月份，他预测关于众所周知的公众人物的故事假装是2021年他们不会大的人。\n ＆＃34;鉴于我们离开总统创建的巨型空白，新闻网点将旨在报告的故事。媒体愿意覆盖的故事是多么无关紧要？＆＃34;他写了。 ＆＃34;嗯，考虑一下。你在过去的72小时内阅读了多少个故事关于Alec Baldwin＆＃39;妻子的据称假西班牙语口音？是的，那个＆＃39;＆＃39;一个有资格获得＆＃39的故事;在折叠之上＆＃39; 2021年的状态。＆＃34; \n注册Insider的通知！ 及时了解您想要了解的内容。  点击“注册”，您同意从Insider以及其他合作伙伴提供的营销电子邮件以及接受我们的服务条款和隐私政策。 ", "note_en": "This story is available exclusively to Insider subscribers.  Become an Insider and start reading now.\n  For three years until his departure this January, Simon McLaren served as the director of communications for Blade, the urban aviation startup that went public earlier this year at a valuation of more than $800 million. His work in that time was largely what you&#39;d expect of a company spokesperson — except for the fact that Simon McLaren doesn&#39;t actually exist.\n After Insider sought to verify McLaren&#39;s identity, Blade CEO Rob Wiesenthal admitted in an interview that McLaren was a made-up persona invented by him and his colleagues, and that Wiesenthal masqueraded as McLaren in telephone conversations with news outlets. The ruse lasted for years, duped numerous journalists, and included a puzzling public drama around McLaren&#39;s purported departure from Blade. None of it was real.\n  McLaren has no substantial online presence outside of  a Blade email address, a  Twitter account created last December, and  a Medium profile created last November. His  personal website, created this January, was registered through a proxy, and he uses a 1966 photo of British racing driver Graham Hill across his accounts in place of a profile picture.\n Still, McLaren has been treated as a real human by a variety of news outlets since his apparent debut in the pages of  Vanity Fair in 2018. Serving as the institutional voice of Blade in stories about the company&#39;s compliance with federal regulations, medical supply shuttles, and negotiations with the town of East Hampton, McLaren has been quoted by the  New York Times, the  New York Post,  Curbed, the  Washington Post,  Fox Business, and  CNN .\n McLaren&#39;s most recent  official press release appears to have been sent out in November 2020, just as Blade began searching for outside representation. But his voice continued to live on in the form of short, opinionated blog posts, called &#34;Simon McLaren&#39;s Curious Content,&#34;  that Blade began sending to subscribers of its email list in October 2020. For twelve weeks, McLaren — under Blade&#39;s logo — weighed in on a number of pandemic issues, including  moving to Miami,  meeting over Zoom, and  patronizing New York restaurants.\n  In June, Insider attempted to reach McLaren at a Westchester phone number that he had previously used to call an Insider reporter for  an August 2020 interview, and had been  publicized as belonging to McLaren on the Blade Twitter account in 2019. The call was answered by Lee Gold, Blade&#39;s chief of staff.\n Asked why he was answering McLaren&#39;s phone, Gold said, &#34;I schedule for Simon as well.&#34; He added that he had met McLaren in person and that even though McLaren was no longer on staff at Blade, &#34;he sometimes will do some freelancing for us as a spokesperson.&#34;\n Gold agreed to schedule an interview with McLaren, asking Insider to send a request via email. In a follow-up call, Gold said he hadn&#39;t seen McLaren in months and that an email to McLaren&#39;s address had bounced back. He then appeared to block this reporter&#39;s number. Reached again, he declined to answer further questions about McLaren.\n     Soon after, Insider received a call from Rob Wiesenthal, who admitted to inventing McLaren. He described the practice of creating false personas and conducting interviews with reporters under false pretenses as a common practice among small companies.\n &#34;As a small company, everyone has to wear many hats. When it was appropriate for a spokesman to respond to a press inquiry, rather than the CEO, given that we did not have a spokesman, we used the pseudonym,&#34; Wiesenthal said. He claimed that, with the exception of McLaren&#39;s name and identity, the spokesman always told the truth. &#34;In the summer of 2020, as a private company we stopped using the press inquiry pseudonym and we now have an outside firm representing us, and we apologize to anyone who feels deceived when we used a pseudonym.&#34;\n The McLaren persona initially started out as a solution to a small, untrained team, Wiesenthal said. &#34;I&#39;m the only person who would speak to the press, unless by email directed by me. We just did not have a spokesperson and people had to wear many hats,&#34; he said. &#34;There was no intention of being duplicitous. A lot of people wanted a name for a spokesman, and it was just not appropriate for a CEO to speak. And a lot of people didn&#39;t have training on how to speak with the press. There are a lot of small companies that have done this and continue to do this, but at a certain point you outgrow it, and we outgrew it.&#34;\n Wiesenthal said McLaren&#39;s career as a blogger and newsletter writer was a secondary project that evolved out of the pandemic, in part to keep Blade&#39;s marketing and creative teams busy.\n &#34;During the dark days of Covid, I really think it kept people going,&#34; Wiesenthal said. &#34;We had weeks where nothing was flying during the lockdown. But people wanted to engage and get people to work and communicate with our flyers, we weren&#39;t going to say, &#39;Fly to the airport.&#39; So we wrote interesting things about what life was like in the city.&#34;\n  A former Sony executive and lifelong New Yorker, Wiesenthal stepped down as the chief operating officer of Warner Music to launch Blade in 2015. The company, which describes itself as an &#34;urban air mobility platform&#34; and brokers flights on helicopters and chartered jets, attracted investments from heavyweights like Barry Diller and David Geffen before going public by merging with a    SPAC  earlier this year. It now trades on the Nasdaq.\n The SPAC deal coincided with McLaren&#39;s official exit from Blade. In January 2021, just a few weeks after the company tapped the communications firm ICR to announce the merger, Blade sent out an unusual letter to subscribers explaining that McLaren would be leaving the company, and taking the newsletter with him, in part because he could no longer abide Blade&#39;s attempts to edit his views.\n &#34;We are living in a uniquely polarizing time,&#34; the statement said. &#34;As such, despite how much we enjoy Simon McLaren&#39;s Curious Content and his unique perspective on what it&#39;s like to be a diehard New Yorker in this day and age, both Simon and the Company have decided that it&#39;s best that we part ways and transition his weekly newsletter from Blade to him.&#34;\n     The letter quoted McLaren explaining that he was no longer an appropriate spokesperson for Blade. &#34;My weekly dispatches have little interest to me or my readers unless they create emotion — laughter or perhaps annoyance, and at times, happiness or even unexpected animus. I appreciate the platform Blade has given me, but I am at the point in my life where I have little interest in Blade, or its partners, bleaching my prose in an effort to avoid any readers potentially being triggered by my views. Over the past few weeks, Blade&#39;s editing process has created the literary equivalent of melba toast. Simply put, my views are not subject to negotiation.&#34;\n Wiesenthal said the drama around McLaren&#39;s seemingly rocky departure started as an &#34;inside joke&#34; among the company&#39;s creative team.\n Whether he exists or not, McLaren was certainly on the money about one thing: In January, he predicted that stories about well known public figures pretending to be someone they were not would be big in 2021.\n &#34;Given the giant void created by our departing president, news outlets will be starving for stories to report on. How inconsequential a story will the media be willing to cover?&#34; he wrote. &#34;Well, consider this. How many stories have you read in the past 72 hours about the allegedly fake Spanish accent of Alec Baldwin&#39;s wife? Yes, that&#39;s a story that will qualify for &#39;above the fold&#39; status in 2021.&#34;\n  Sign up for notifications from Insider! Stay up to date with what you want to know.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2021-06-18 01:09:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "用于,uber,刀片", "title": "刀片，用于直升机和特许喷气式飞机的优步，有一个假发言人三年 ", "title_en": "Blade, the Uber for Helicopters and Chartered Jets, Had a Fake Spokesperson for Three Years", "transed": 1, "url": "https://www.businessinsider.com/blade-helicopter-had-fake-spokesperson-2021-6", "via": "", "real_tags": ["用于", "uber", "刀片"]}, {"category": "", "categoryclass": "", "imagename": "d1b732061598b01ef4211f2b2b9d009e.jpeg", "infoid": 1066519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1986年，传奇的摇滚乐队女王发布了一首询问问题：＆＃34;谁想永远活着？＆＃34;\n 由于最近的一项调查，我们现在至少知道这个问题的答案，至少是美国成年人。\n 德克萨斯大学的科学家发现，调查了900多人，只有33％的美国成年人会采取一个不朽的药丸，如果存在。该研究发表于老龄化研究杂志。\n 根据年龄，大学的研究人员将受访者分为三组。一组是年轻人，年龄在18至29岁之间，另一组年龄为72岁的老年人，第三组由平均年龄为88的个人组成。\n 每个团体都达成了大多数共识，他们不想永远活着。然而，在最年轻的群体和最古老的群体中，他们更愿意的年龄差异是＆＃34;冷冻＆＃34;由理论不朽丸。\n  ＆＃34;年轻老年人和老年人表示，他们更愿意在年龄较大的年龄永久生活，而不是年轻的成年人，＆＃34;该研究报道。\n 最年轻的群体有最多的人，称他们想要永远活着，34％的人说他们会采取一个不朽的药丸。另外40％的人表示，他们不会拿一个，26％的人说他们不确定。 \n中间集团看到愿意永远居住的人略有略低，32％的人说他们会占用药丸，43％的人说他们不会。一四分之一的受访者表示他们不确定。\n 最古老的群体看到了最少数对永生感兴趣的人，只有24％的人表示他们同意拿走药丸。超过一半 -  59％ - 说他们不会接受它，只有17％的人说他们不确定。\n 他们的优选年龄群体之间的差异表明，如果他们可以选择更接近目前年龄的年龄，个人可能会更为开放。\n 沿着性别线路出现的反应的差异也有更多的人说他们会比女性服用药丸。\n 根据美国疾病控制和预防中心，美国成年人的目前平均寿命为78.7岁，女性平均地生活更长时间。\n ＆＃34;如果生命延伸治疗是可用的有效停止老化的可用，年轻人可能会使用这种待遇，以避免达到老年人所说他们宁愿永远活着的年龄，而＃34;研究确定了。\n  如果您通过本文中的推荐链接购买某些内容，可以赔偿微软和合作伙伴。 \n在新窗口中打开打开外部站点在新窗口中打开外部站点 ", "note_en": "In 1986, legendary rock band Queen released a song asking the question: &#34;Who wants to live forever?&#34;\n Thanks to a recent survey, we now know the answer to that question, at least among US adults.\n Scientists at the  University of Texas found that of more than 900 people surveyed, only 33 per cent of US adults would take an immortality pill, if one existed. The study was published in the   Journal of Aging Studies.\n Researchers from the university separated respondents into three groups, based on age. One group was younger people, between the ages of 18 and 29, another group of senior citizens whose average age was 72, and a third group made up of individuals whose average age was 88.\n Each of the groups reached a majority consensus that they would not want to live forever. However, among the youngest group and oldest group there were differences in what age they would prefer to be &#34;frozen&#34; at by a theoretical immortality pill.\n  &#34;Younger-old and older-old adults indicated that they would prefer to live permanently at an older age than younger adults,&#34; the study reported.\n The youngest group had the largest number of individuals saying they would want to live forever, with 34 per cent saying they would take an immortality pill. Another 40 per cent said they would not take one, and 26 per cent said they were unsure.\n The middle group saw slightly fewer people willing to live forever, with 32 per cent saying they would take the pill, and 43 per cent saying they would not. A quarter of the the respondents said they were unsure.\n The oldest group saw the fewest number of those interested in eternal life, with only 24 per cent saying they would agree to take the pill. More than half – 59 per cent – said they would not take it, with only 17 per cent saying they were unsure.\n The differences between the groups for their preferred age to be “frozen” at suggests that individuals may be more open to immortality if they can choose an age closer to their current age.\n Differences in responses emerged along gender lines as well, with more men saying they would take the pill than women.\n The current average life expectancy for US adults is 78.7 years according to the US Centres for Disease Control and Prevention, with women living longer on average.\n &#34;If a life extension treatment were to become available that effectively stopped ageing, young adults may be likely to use such a treatment to avoid reaching the ages at which older cohorts say they would prefer to live forever,&#34; the study determined.\n  Microsoft and partners may be compensated if you purchase something through recommended links in this article.\n          Opens in a new window  Opens an external site  Opens an external site in a new window", "posttime": "2021-06-18 01:08:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人会,opt,年龄", "title": "新研究：只有33％的人会选择不朽 ", "title_en": "New Study: Only 33% Would Opt For Immortality", "transed": 1, "url": "https://www.msn.com/en-gb/health/medical/only-a-third-of-americans-want-to-live-forever-with-men-more-likely-than-women-to-take-e2-80-98immortality-pill-e2-80-99/ar-AAKPVLq", "via": "", "real_tags": ["人会", "opt", "年龄"]}, {"category": "", "categoryclass": "", "imagename": "92d680c051b0b3eef98904d3d007e442.jpg", "infoid": 1066518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您从多边形链接购买某些东西，Vox Media可能会获得佣金。看看我们的道德声明。\n CAPCOM游戏如同诉诸于周五提交的新诉讼，据称在游戏中广泛使用未经许可的受版权保护的照片，以便建造环境，细节，甚至在环境中，甚至是生化危机4标志。\n Designer Judy A.JuRacek于周五在康涅狄格州法院提出了初步投诉。在诉讼中，她声称Capcom来自她的受版权保护的书籍，表面，多个游戏中的照片，包括生化危机4，Devil May Cry和其他Capcom游戏。 juracek拍摄自己的1,200张纹理照片的集合;根据本书的描述，本书旨在用于艺术家，建筑师和设计师的“视觉研究”。它最初于1996年发表。该系列附带了一张图像的CD-ROM  - 但JURATEK表示，她要求人们通过直接联系她来授予她的商业用途。 JuRacek在诉讼中表示，Capcom从未联系过她的许可证。\n JURACEK指出至少80张在CAPCOM游戏中使用的不同场景，超过100页文档。在诉讼中呼出的一个例子是关于雄心危机4标志中使用的破碎玻璃纹理。\n   jureack说她拍摄了意大利玻璃照片。 “难以想象的是，JuRacek将在意大利拍摄破碎的玻璃和室内豪宅门设计，Capcom艺术家将在徽标和室内设计中重现相同的破碎玻璃，没有JuRacek的照片，”她说在诉讼中。\n 在100多页的支持案例文件中，JURACEK指出，据称在CAPCOM的游戏中使用了200多个她的照片实例。这包括从大理石纹理到华润雕塑细节的所有内容，这些细节都在Capcom游戏中识别和丰富。\n   JURACEK的一部分的证据来自2020年CAPCOM数据违规行为，这发生于11月。在这种泄漏中，雄心邪恶的村庄的发射计划是过早揭示的，据CapCom表示，已经损害了数十万人的个人信息，包括客户，股东和雇员。据报道，CAPCOM在攻击中获得了赎金说明，在线信息泄露之前。该信息包括一些“用于雄性危机和其他游戏中使用的艺术品的高分辨率图像，”Juracek说。 \n“CapCom Hacked文件中至少一个图像的文件名与[曲面] CD-ROM上使用的文件名相同，”她称。诉讼显示了一个金属纹理，在JURACEK的CD-ROM上标记为“ME009”，并在CAPCOM文件夹中标记相同。\n   在诉讼中，JURACEK指出，Capcom最近被指控复制荷兰电影制片人Richard Raphorst的怪物设计，为新的雄性危机村比赛。在球迷联系他的据称被偷走的设计中发现了据称被盗的设计，从他的电影弗兰肯斯坦的军队成为村庄的螺旋桨前锋坏人的基础，他告诉Eurogamer。\n juRacek的律师要求法院授予她的赔偿金额达到1200万美元的版权侵权。她还在寻求“假版权管理和版权管理的删除：”每次使用的照片的2500美元至25,000美元的损害。\n CAPCOM代表告诉多边形，该公司是“意识到诉讼”，并“不进一步发表评论”。 juRacek的律师没有回应多边形的申请，了解更多信息。 ", "note_en": "If you buy something from a Polygon link, Vox Media may earn a commission. See our  ethics statement.\n Capcom games like   Resident Evil 4  and   Devil May Cry allegedly used unlicensed copyrighted photos extensively in its games to build out environments, details, and even the  Resident Evil  4 logo, according to a new lawsuit filed Friday.\n Designer Judy A. Juracek filed her initial complaint in a Connecticut court on Friday. In the lawsuit, she alleged that Capcom used photos from her copyrighted book,  Surfaces, in multiple games, including  Resident Evil  4,  Devil May Cry, and other Capcom games.  Surfaces is a collection of 1,200 photographs of textures that Juracek photographed herself; the book is intended to be used for “visual research” for artists, architects, and designers,  according to the book’s description. It was originally published in 1996. The collection comes with a CD-ROM of the images — but Juracek said she requires people to license images from her for commercial use by contacting her directly. Juracek said in the lawsuit that Capcom never contacted her for a license.\n Juracek pointed out at least 80 photographs that are used in different scenarios across Capcom’s games, with more than 100 pages of documentation. One instance called out in the lawsuit is regarding a shattered glass texture used in the  Resident Evil 4 logo.\n   Juracek said she took the photo of glass in Italy. “It is hard to imagine that Juracek would take a photo of shattered glass in Italy and interior mansion door design and that Capcom artists would reproduce the exact same pattern of shattered glass in a logo and interior design without benefit of Juracek’s photographs,” she said in the lawsuit.\n In more than 100 pages of supporting case documents, Juracek pointed out more than 200 instances of her photographs allegedly being used in Capcom’s games. This includes everything from marbled textures to ornate sculptural details that are recognizable and abundant in Capcom games.\n   Part of Juracek’s evidence comes from the  2020 Capcom data breach, which happened in November. In that leak,   Resident Evil Village’s launch plans were prematurely revealed, and personal information for hundreds of thousands of people had been compromised, including customers, shareholders, and employees, Capcom said. Capcom reportedly received a ransom note in the attack, before information was leaked online. That information included some “high resolution images of artwork used in Resident Evil and other games,” Juracek said.\n “The file names for at least one of the images from the Capcom hacked files are the same file names as those used on the [ Surfaces] CD-ROM,” she alleged. The lawsuit shows a metal texture that was labeled “ME009” on Juracek’s CD-ROM, and labeled the same in the Capcom folders.\n   In the lawsuit, Juracek noted that Capcom was also  recently accused of copying Dutch filmmaker Richard Raaphorst’s monster designs for the new  Resident Evil Village game. Raaphorst found out about the allegedly stolen design after fans contacted him about one of the characters from his film  Frankenstein’s Army being the basis for Village’s propeller-headed bad guy, Sturm,  he told Eurogamer.\n Juracek’s lawyers are asking the court to award her up to $12 million in damages on a count of copyright infringement. She’s also seeking damages for “false copyright management and removal of copyright management:,” $2,500 to $25,000 for each used photograph.\n A Capcom representative told Polygon that the company is “aware of the lawsuit” and has “no further comment.” Juracek’s lawyer has not responded to Polygon’s request for more information.", "posttime": "2021-06-18 01:08:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "摄影,摄影师,sued,capcom", "title": "Capcom由摄影师起诉，声称他们在没有许可的情况下使用了80张照片 ", "title_en": "Capcom Sued By Photographer Claiming They Used 80 of Her Photos Without Licensing", "transed": 1, "url": "https://www.polygon.com/22519568/resident-evil-4-copyright-infringement-lawsuit-capcom", "via": "", "real_tags": ["摄影", "摄影师", "sued", "capcom"]}, {"category": "", "categoryclass": "", "imagename": "515e9dfb5089a9d83ec887c02fa81eb6.jpg", "infoid": 1066517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌周四表示，通过在铁锈编程语言中写作部分操作系统和＃39;核心，可以将核心的现代化努力提高Linux安全性，这是一个可以将互联网和智能手机的安全性的现代化努力来增加Linux安全性。\n 如果该项目成功，它＆＃39; ll可以添加以锈蚀的新元素添加到Linux的核心，称为内核。这种变化将标志着＆＃39; s成为谷歌和＃39; S Android和Chrome操作系统以及互联网的巨大条件的主要技术和文化转变。\n   Miguel Ojeda，大型强子撞机粒子加速器使用并在编程语言安全性上使用的书面软件，正在为Linux内核编写RUDER的软件。谷歌正在支付合同，该合同正在通过互联网安全研究小组进行扩展，这是一个非营利组织，即＆＃39; S也更容易通过Let＆＃39加密工作来保护网站通信。\n 将Rust模块添加到Linux内核将通过关闭一些用于黑客的途径来提高安全性，可以用于攻击电话，计算机或服务器。由于它于1991年推出，Linux仅以强大但旧的C编程语言编写。该语言于1972年开发，比当代编程语言更容易受到影响。\n Linux的更好安全是为每个人而不是黑客的好消息。除了Android和Chrome ISES之外，Google服务如YouTube和Gmail还依赖于运行Linux的服务器。它还为亚马逊和Facebook提供动力，并且是云计算服务的夹具。\n 如果Linux内核领导人将容纳生锈，则＆＃39; t清除。 Linux的创始人Linus Torvalds表示，如果Linux冠军的RUDER证明它的价值，他会打开变更。 Ojeda提出了13项更改，以便在Linux中允许Linux中的生锈模块开始。\n 谷歌已经采取了一些早期步骤，使其可以使用RUDUX And​​roid。在Linux内核项目的最高级别获得购买意味着许多其他软件项目也可以受益。 \nGoogle凭借Linux项目开始生锈的Linux社区程序员。 ＆＃34;社区已经完成并继续为Linux内核构建系统添加Rust支持，并继续做好很好的工作，＆＃34;谷歌在博客帖子中说。\n  锈，由Firefox Maker Mozilla开发，现在由独立的Rust Foundation经营，使软件更安全地写入内存。黑客可以利用内存问题，隐藏在界限内存区域中的恶意额外代码。程序员正在构建软件时，对这些问题和其他问题进行防锈检查。它是＆＃39; S是最受欢迎的编程语言，五年在堆栈溢出＆＃39;年度开发人员调查中运行。\n ＆＃34; rort代表当前可用的C和C ++的最佳替代品，＆＃34; Microsoft＆＃39;安全团队于2019年结束。该团队表示，Rust将在70％的重要安全问题中阻止内存问题。由于软件正在构建时，rust＆＃39; s检查时，安全并在软件运行时牺牲性能的费用。\n Linux在Rust项目上的目标ISN＆＃39; t替换所有Linux＆＃39; s c代码，而是改善选择性和新零件。\n ＆＃34;对于可预见的未来，我们计划专注于某些安全关键组件和司机，＆＃34; Josh AAS表示，谁运行ISRG＆＃39; s prossimo项目将关键互联网软件移动到内存安全软件。驱动程序是操作系统模块，可控制像打印机，网络适配器和图形芯片等特定设备。\n 谷歌ISN＆＃39; t放在Linux和Rust上的唯一赌注。它有自己的内存安全语言，go和一个名为uchsia的新操作系统，在它的巢穴中心智能屏幕中使用了一个名为uchsia＆＃39;\n ＆＃34;谷歌拥有各种其他投资语言，工具和平台，＆＃34;一家公司发言人说。 ＆＃34;拥有多种解决方案相关但不一定重叠的问题允许交叉授粉良好的想法被重用。＆＃34; ", "note_en": "Google said Thursday it&#39;s funding a project to increase  Linux security by writing parts of the operating system&#39;s core in the  Rust programming language, a modernization effort that could bolster the security of the internet and  smartphones.\n If the project succeeds, it&#39;ll be possible to add new elements written in Rust into the heart of Linux, called the kernel. Such a change would mark a major technological and cultural shift for an open-source software project that&#39;s become foundational to Google&#39;s Android and Chrome operating systems as well as vast swaths of the internet.\n   Miguel Ojeda, who&#39;s written software used by the  Large Hadron Collider particle accelerator and worked on programming language security, is being contracted to write software in  Rust for the Linux kernel. Google is paying for the contract, which is being extended through the  Internet Security Research Group, a nonprofit that&#39;s also made it easier to  secure website communications through the  Let&#39;s Encrypt effort.\n Adding Rust modules to the Linux kernel would improve security by closing some avenues for hackers can use to attack phones, computers or servers. Since it was launched in 1991, Linux has been written solely in the powerful but old  C programming language. The language was developed in 1972 and is more vulnerable to hacks than contemporary programming languages.\n Better security for Linux is good news for everyone but hackers. In addition to the Android and Chrome OSes, Google services like YouTube and Gmail all rely on servers running Linux. It also powers Amazon and Facebook, and is a fixture in  cloud computing services.\n It isn&#39;t clear if Linux kernel leaders will accommodate Rust. Linus Torvalds, the founder of Linux, has said he&#39;s  open to change if  Rust for Linux champions prove its worth. Ojeda has proposed 13  changes needed to allow Rust modules in Linux to get things started.\n Google already has taken some early steps to make it possible to  use Rust for Linux Android. Getting buy-in at the highest levels of the Linux kernel project means many other software projects could benefit, too.\n Google credits the Linux community programmers who began the Rust for Linux project. &#34;The community had already done and continues to do great work toward adding Rust support to the Linux kernel build system,&#34; Google said in a blog post.\n  Rust, which was developed by Firefox maker  Mozilla and is now run by the independent  Rust Foundation, makes it safer for software to write to memory.  Hackers can exploit memory problems, hiding malicious extra code in out-of-bounds memory areas. Rust checks for those and other problems when programmers are building their software. And it&#39;s been the  most loved programming language for five years running in Stack Overflow&#39;s annual developer survey.\n &#34;Rust represents the  best alternative to C and C++ currently available,&#34; Microsoft&#39;s security team concluded in 2019. The team said Rust would have prevented memory problems at fault in 70% of its significant security issues. And because Rust&#39;s checks happen while software is being built, the safety doesn&#39;t come at the expense of performance when the software is running.\n The goal of the Linux on Rust project isn&#39;t to replace all of Linux&#39;s C code but rather to improve selective and new parts.\n &#34;For the foreseeable future we plan to focus on certain security critical components and drivers,&#34; said Josh Aas, who runs ISRG&#39;s Prossimo project to move critical Internet software to memory safe software. Drivers are operating systems modules that control specific devices like printers, network adapters and graphics chips.\n Google isn&#39;t placing its only bets on Linux and Rust. It&#39;s got its own memory-safe language, Go, and a  new operating system called Fuchsia it&#39;s begun  using in its Nest Hub smart screen.\n &#34;Google has a variety of other investments in languages, tools, and platforms,&#34; a company spokesman said. &#34;Having multiple solutions to related but not necessarily overlapping problems allows for a cross pollination of good ideas to be reused.&#34;", "posttime": "2021-06-18 01:08:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linux,rust,google,操作系统,谷歌", "title": "谷歌表示，它正在为一个项目提供资金来增加Linux安全性，通过在Rust中写作操作系统的核心 ", "title_en": "Google says it is funding a project to increase Linux security by writing parts of the operating system's core in Rust", "transed": 1, "url": "https://www.cnet.com/news/google-backed-linux-project-could-make-android-chrome-os-harder-to-hack/", "via": "", "real_tags": ["linux", "rust", "google", "操作系统", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到这一天，随处可到达的程序员现在熟悉的熟悉电动板Cutoutdogs。坐着 - 永远的警报 - 甚至最长的会话，从未分心和虚构的自由。真正的软件行业欠爪子 - 块营销部门的杰克和不知数。已经报道了来自大学赛游戏业务的一些超级赛事，充气性玩具是纸板狗作为追踪的纸箱 - 但对于我的口味，他们似乎呈现了永久性的惊人，以某种方式导致我怀疑我有一个悬垂的方法指针或一些这样的。其他人试图使用现场鹦鹉，金雀鱼想象中的六英尺高的白色兔子 - 但是一些令人讨厌的哈希表箱的微妙的鹦鹉来谈论回来的鹦鹉，一只金鱼谁在临界审议的相反方向上游泳 - 或空椅子 - 缺乏必要的专心重点，让我解释我的女性果然后玩网攻击。 Microsoft Inc提供动画狗（Orgod禁止，跳舞纸夹）的努力，作为屏幕横杆，这一直令人失望。除非您在帕斯卡写作，否则避免贵重犬（特别是较小的品种）。 Shitzu＆＃39; s和哈巴狗为面向对象的代码。由于Thay最讨厌的是避免的yappy狗 - 在文献中被报道，在文献中被报告为在检测到OFF-BY-ONE错误和错位括号时尤其占用。拉布拉多的平静面孔 - 或者对于一些公鸡百合 - 符合稳定影响的需求。平静，了解风度和漂亮的下垂耳朵。有些人会声称，德国人对警觉性更好地让圆形错误 -  offersprefer在代码中怀疑种族条件的灰狗。 BIAS91：演练：高效的协作测试Dichter92：两套眼睛：编码检查如何提高软件质量和省钱HART82：设计和代码演练的有效性IBM76：代码阅读，结构性演练和检查LEMOS79：结构化步行 - 通过教授COBOL编程LEMOS80：讨论和函授测量学生＆＃39;对结构性步行的态度McGinnis90：演练的影响使用第三代和第四代编程语言的程序正确性 ", "note_en": "To this day, programmers everywhere have the by now familiarcardboard cutoutdogs. Sitting - forever alert - never distracted and virtuallymaintenance free throughout even the longest sessions. Trulythe software industry owes a lot to Jake and the unsungheroes at the Poochie-Chunks marketting department. It has been reported from some of the racier parts of thecomputer games business that inflatable sex toys aresupplanting the cardboard dog as the Walkthroughee ofchoice - but for my tastes, they seem to present alook of perpetual suprise which somehow leads me to suspectthat I have a dangling pointer or some such. Others have attempted to use live Parrots, Goldfishor imaginary six-foot tall white rabbits - but somehowexplaining the subtleties of an unwrapped hash tablelookup to a Parrot that talks back, a Goldfish whois swimming in the opposite direction at the criticalmoment - or an empty chair - lacks the necessarydisciplinary focus to keep me explaining my coderather then playing net-hack. Efforts by Microsoft Inc to provide an animated dog (orGod forbid, a Dancing Paper-Clip) as an on-screenWalkthroughee have been disappointingly ineffective. Unless you are writing in Pascal, steer clear of Poodles(especially the smaller breeds). Shitzu&#39;s and Pugs arepoor for Object-Oriented code. Yappy dogs in generalare to be avoided since thay are at best annoying -and have been reported in the literature as being particularlypoor at detecting off-by-one errors and misplaced parentheses. The calm face of a Labrador - or for some, a CockerSpaniel - fits the need for a steadying influence. A calm,understanding demeanor and nice, droopy ears. Some will claim that GermanShepherds are better for alertness to subtle rounding errors - othersprefer a Greyhound where race conditions are suspected in the code.  Bias91: Walkthroughs: Efficient Collaborative Testing Dichter92: Two Sets of Eyes: How Code Inspections Improve Software Quality and Save Money Hart82: The Effectiveness of Design and Code Walkthroughs IBM76: Code Reading, Structured Walkthroughs, and Inspections Lemos79: An implementation of structured walk-throughs in teaching COBOL programming Lemos80: Discussion and correspondence measuring student&#39;s attitudes towards structured walk-throughs McGinnis90: The impact of walkthroughs on program correctness using third and fourth generation programming languages", "posttime": "2021-06-18 01:07:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "镂空,cutout,演练", "title": "纸板镂空狗（2003） ", "title_en": "Cardboard Cutout Dog (2003)", "transed": 1, "url": "https://www.sjbaker.org/humor/cardboard_dog.html", "via": "", "real_tags": ["镂空", "cutout", "演练"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "#clone克隆存储库git clone \\ https：//github.com/round-robin-books/gente-kafka.git #start Kafka Docker-Compose Up ", "note_en": "# clone the repository\t\t\t\t\t\t\tgit clone \\\t\t\t\t\t\t\t\thttps://github.com/round-robin-books/gently-kafka.git\t\t\t\t\t\t\t\t\t\t\t\t\t\t# start kafka\t\t\t\t\t\t\tdocker-compose up", "posttime": "2021-06-18 01:07:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "书籍,children,kafka", "title": "我写了一个儿童书籍/插图的Apache Kafka指南 ", "title_en": "I wrote a children's book / illustrated guide to Apache Kafka", "transed": 1, "url": "https://gentlydownthe.stream/", "via": "", "real_tags": ["书籍", "children", "kafka"]}, {"category": "", "categoryclass": "", "imagename": "e93e4263fe77e8c25e1d95a7616f8877.png", "infoid": 1066514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Eurazeo Leads系列F ROUNT，将公司的估值提高到超过20亿美元\n  San Mateo，CAIF。 -  2011年6月17日 - 图1917年6月17日 - 图表技术领导者Neo4J®今天宣布一系列Funding Round，作为欧洲州（RF：PA）参与来自GV的3.25亿美元投资的一部分（以前的Google Ventures ）。今天的交易代表了私人数据库公司的最大投资，并将Neo4J的估值提高到超过20亿美元。\n  现有的投资者一个高峰（自2018年以来的投资者），Crandum（自2014年以来为投资者），格林桥合作伙伴（自2016年以来为投资者），以及新投资者DTCP和Lightrock也参加了参与。\n   Emil Eifrem，Neo4J的首席执行官和联合创始人，以更广泛的数据库市场的拐点为特色，并欢迎投资合作伙伴Eurazeo，GV，DTCP和Lightrock。\n  “数据库构成了企业软件中最大的单一市场，增长以新一代的数据库为中心，以前所未有的方式解决了今天的数据挑战，”EIFREM表示。 “这是数据库中的神奇时间，为少数世代公司提供了少数世代公司作为更广阔的景观中的领导者。 Neo4J是这些公司之一，今天数据库空间中的录制交易表明，我们的新和现有的投资者分享了这一信念。“\n  根据Gartner，＆＃34;到2025年，图表技术将在80％的数据和分析创新中使用，高于2021年的10％，促进了整个企业的快速决策。“资料来源：Gartner，2021年的数据和分析的最高趋势，Rita Sallam等，2月16日2月16日。\n  信任超过800名企业客户，包括Adobe，Astrazeneca，eBay，Levi Strauss＆amp; Co.，UBS，Volvo Cars和Walmart，Neo4J是世界上最广泛的图形数据库。 \n使用超过75％的财富100，Neo4j的图形数据平台使得全球最大的连接数据应用程序的关键任务工作负载能够。\n  Neo4J的市场领导层沿着几件轴加速。今天的资金燃料公司的产品创新提供了图表技术，远远超过数据科学，机器学习，云部署和实时性能的最苛刻的客户需求。\n    Cloud Portfolio  - 提供多云服务的组合，可以一直到最大的全球企业为各个开发人员提供服务，提供无与伦比的灵活性，敏捷性和任何规模的性能。\n  图表数据科学 - 通过增强的机器学习模型为智能应用程序的新时代供电，以根据关系解锁另外的无法实现的预测。\n  市场覆盖范围 - 扩大Neo4J的全球足迹，并越来越多的互补技术和专家服务提供商的生态系统，以提供完整的解决方案并加速客户的成功。\n  Nathalie Kornhoff-Brüls是Eurazeo成长团队的董事总经理，已被任命为Neo4J董事会。\n  “很明显，从多级全球供应链越来越多地相互联系，从多级全球供应链到无处不在的流程自动化。还可以清楚地留下无法数字化，分析和可视化这种互连的业务，“Kornhoff-Brüls说。 “我们选择投资NEO4J，因为它正在塑造数据和分析如何在企业及以后所需的数据。该公司的技术领导力，全球开发人员社区和世界级客户群 - 结合了一个不断扩大的全球生态系统 - 独特的Neo4J，继续定义和引导图表数据库类别。我们不能被埃米尔和他的团队选择作为合作伙伴，并期待利用Eurazeo的全球平台为公司的前进之旅。“ \n总部埃里克·埃克诺德兰德和汤姆·赫姆德欢迎Neo4J到GV投资组合，在名为Neo4J的博客帖子中：寻求更好的数据感。\n  “Tom Hulme和我很高兴欢迎团队向投资组合欢迎，加入建立企业未来的其他数据库公司。 Neo4J在愿景中坚定不移，多年来，我钦佩Emil的勇气和不懈的奉献，以构建和福音指数图数据库，“GV普通伙伴埃里克诺德兰德说。\n  作为图形类别创建者，Neo4J在其技术生态系统上建立了全球社区数百和数千人的高技能应用程序和数据科学家。这些从业者正在构建广泛的应用程序，无法由关系或其他NoSQL数据库提供服务，这些数据库需要在比例下进行数字化数据。例子包括确定机票的价格实时，暴露负责网络攻击的复杂刑事网络以及洗钱活动。\r Neo4J被认可为Forrester Wave™：图表数据平台，Q4 2020。在引用的12图数据平台提供商中，Neo4J在当前产品和策略类别中实现了最高分数。\n  有关Neo4J资金公告意味着客户，开发人员社区和数据库行业的更多信息，请查看Emil Eifrem的博客文章，Neo4J在数据库历史中提高了最大的资金。\n    Neo4j是图表数据库技术的领导者。作为世界上最广泛的图形数据库，我们帮助全球品牌 - 包括康卡斯特，美国宇航局，瑞银和沃尔沃汽车 - 揭示和预测人，流程和系统如何相互关联。使用这种关系 - 首先方法，用Neo4J构建的应用程序，包括分析和人工智能，欺诈检测，实时建议和知识图形等连接数据挑战。在neo4j.com上了解更多信息。\n    Eurazeo是一家领先的全球投资集团，在管理层的资产中有多元化的投资组合，包括来自第三方的160亿欧元，投资于超过450家公司。凭借其相当大的私募股权，房地产和私人债务专业知识，欧洲欧洲欧洲央行伴随着各种规模的公司，通过近300名专业人士的承诺支持他们的发展，并通过为全球市场提供深入的部门专业知识，以及负责任和稳定的立足点转型增长。其坚实的机构和家庭股东基地，无力的财务结构，无结构债务，灵活的投资地平线使欧洲景观能够长期支持其公司。\n  Eurazeo在巴黎设有办事处，纽约，圣保罗，首尔，上海，新加坡，伦敦，卢森堡，法兰克福，柏林和马德里，并在Eureoxt Paris上列出。 \n©2021 Neo4J，Inc。，NeoTechnology®，Neo4J®，Cypher®，Neo4J®Bloom™和Neo4J®Aura™是Neo4j，Inc。的注册商标或商标所有其他商标由各自的公司拥有。 ", "note_en": "Eurazeo Leads Series F Round, Raising the Company’s Valuation to Over $2 Billion\n  SAN MATEO, Calif. – June 17, 2021 –  Neo4j®, the leader in graph technology, announced today a Series F funding round as part of a $325 million investment led by  Eurazeo (RF:PA) with participation from  GV (formerly Google Ventures). Today’s transaction represents the largest investment in a private database company and raises Neo4j’s valuation to over $2 billion.\n  Existing investors  One Peak (an investor since 2018),  Creandum (an investor since 2014), and  Greenbridge Partners (an investor since 2016), as well as new investors  DTCP and  Lightrock, also participated.\n   Emil Eifrem, Neo4j’s CEO and Co-Founder, characterized the news as an inflection point in the broader database market and welcomed investment partners Eurazeo, GV, DTCP, and Lightrock.\n  “Databases constitute the largest single market in enterprise software, with growth centered in new generations of databases that address today’s data challenges in unprecedented ways,” said Eifrem. “This is a magical time in databases, presenting an opportunity for a handful of generational companies to emerge as leaders in the broader landscape. Neo4j is one of these companies, and today’s record-breaking transaction in the database space demonstrates that our new and existing investors share this belief.”\n  According to Gartner, &#34;By 2025, graph technologies will be used in 80% of data and analytics innovations, up from 10% in 2021, facilitating rapid decision making across the enterprise.” Source: Gartner, Top Trends in Data and Analytics for 2021, Rita Sallam et al., 16 Feb 2021.\n  Trusted by more than 800 enterprise customers, including  Adobe,  AstraZeneca,  eBay,   Levi Strauss &amp; Co.,  UBS,  Volvo Cars, and  Walmart, Neo4j is the world’s most widely deployed graph database.\n  Used by more than  75% of the Fortune 100, Neo4j’s graph data platform enables mission-critical workloads for the world’s largest connected data applications.\n  Neo4j’s market leadership is  accelerating along several axes. Today’s funding fuels the company’s product innovation to provide graph technology that  far exceeds the most demanding customer requirements across data science, machine learning, cloud deployment, and real-time performance.\n    Cloud portfolio – Delivering a portfolio of multi-cloud services that can serve individual developers all the way through to the largest global enterprises, offering unmatched flexibility, agility, and performance at any scale.\n  Graph data science – Powering a new era of intelligent applications with enhanced machine learning models to unlock otherwise unattainable predictions based on relationships.\n  Market reach – Expanding Neo4j’s global footprint, and growing the company’s ecosystem of complementary technologies and expert service providers, in order to deliver complete solutions and accelerate customer success.\n  Nathalie Kornhoff-Brüls is a Managing Director in the growth team of Eurazeo and has been appointed to the Neo4j Board of Directors.\n  “It is clear that the world is becoming increasingly interconnected, from multi-level global supply chains to ubiquitous automation of processes. It is also clear that businesses who are unable to digitize, analyze, and visualize this interconnectedness will be left behind,” said Kornhoff-Brüls. “We chose to invest in Neo4j because it is shaping the future of how data and analytics will need to be implemented in the enterprise and beyond. The company’s technology leadership, global developer community, and world-class customer base – combined with an ever-expanding global ecosystem – uniquely position Neo4j to continue to define and lead the graph database category. We couldn’t be prouder to have been chosen as a partner by Emil and his team, and look forward to leveraging Eurazeo’s global platform for the company’s journey ahead.”\n  General Partners  Erik Nordlander and  Tom Hulme welcomed Neo4j to the GV portfolio, in a  blog post titled Neo4j: A Quest to Make Better Sense of Data.\n  “Tom Hulme and I are excited to welcome the team to the portfolio, joining other database companies that are building the future of the enterprise. Neo4j has been steadfast in its vision, and I admire Emil’s grit and tireless dedication over the years to build and evangelize graph databases,” said Erik Nordlander, General Partner at GV.\n  As the graph category creator, Neo4j has built a global community of hundreds and thousands of highly skilled application developers and data scientists around its technology ecosystem. These practitioners are building wide-ranging applications, unable to be served by relational or other NoSQL databases, which require digitizing connections in data at scale. Examples include determining the price of an airline ticket in real time, exposing complex criminal networks responsible for cyber attacks, and money laundering activity.\r Neo4j is recognized as a Leader in The Forrester Wave™: Graph Data Platforms, Q4 2020. Of the 12 graph data platform providers cited, Neo4j achieved the highest scores in the current offering and strategy categories.\n  For more information about what Neo4j’s funding announcement means to its customers, the developer community, and the database industry, view Emil Eifrem’s blog post,  Neo4j Raises the Largest Funding Round in Database History.\n    Neo4j is the leader in graph database technology. As the world’s most widely deployed graph database, we help global brands – including  Comcast,  NASA,  UBS, and  Volvo Cars – to reveal and predict how people, processes, and systems are interrelated. Using this relationships-first approach, applications built with Neo4j tackle connected data challenges such as  analytics and artificial intelligence,  fraud detection,  real-time recommendations, and  knowledge graphs. Find out more at  neo4j.com.\n    Eurazeo is a leading global investment group, with a diversified portfolio of €23 billion in Assets Under Management, including €16 billion from third parties, invested in over 450 companies. With its considerable private equity, real estate and private debt expertise, Eurazeo accompanies companies of all sizes, supporting their development through the commitment of its nearly 300 professionals and by offering deep sector expertise, a gateway to global markets, and a responsible and stable foothold for transformational growth. Its solid institutional and family shareholder base, robust financial structure free of structural debt, and flexible investment horizon enable Eurazeo to support its companies over the long term.\n  Eurazeo has offices in Paris, New York, Sao Paulo, Seoul, Shanghai, Singapore, London, Luxembourg, Frankfurt, Berlin and Madrid and is listed on Euronext Paris.\n          © 2021 Neo4j, Inc., Neo Technology®, Neo4j®, Cypher®, Neo4j® Bloom™ and Neo4j® Aura™ are registered trademarks or a trademark of Neo4j, Inc. All other marks are owned by their respective companies.", "posttime": "2021-06-18 01:07:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "neo4j", "title": "Neo4J培养了325米系列F. ", "title_en": "Neo4j raises $325M series F", "transed": 1, "url": "https://neo4j.com/press-releases/neo4j-announces-seriesf-funding/", "via": "", "real_tags": ["neo4j"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "音频工作组已将Web Audio API发布为W3C推荐。 本说明书描述了用于在Web浏览器或Web应用程序中直接创建，整形和处理音频的高级Web API。  使用API标准化和部署为Web浏览器和其他设备和平台的免版税功能，桌面和移动设备上，使用Web Audio API创建声音已成为可靠，广泛可用，内置的功能，消除了需求 安装插件或下载单独的应用程序。 您可以在新闻稿中阅读更多。 ", "note_en": "The  Audio Working Group has published  Web Audio API as a W3C Recommendation. This specification describes a high-level Web API for creating, shaping, and processing audio directly in a Web browser or in web applications.\n With the API standardized and deployed as a royalty-free feature in Web browsers and other devices and platforms, both on desktop and mobile, creating sound with the Web Audio API has become a dependable, widely available, built-in capability, eliminating the need to install plugins or download separate applications. You may read more in our  Press Release.", "posttime": "2021-06-18 01:07:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "audio,web", "title": "Web Audio API是W3C推荐 ", "title_en": "Web Audio API Is a W3C Recommendation", "transed": 1, "url": "https://www.w3.org/blog/news/archives/9093", "via": "", "real_tags": ["audio", "web"]}, {"category": "", "categoryclass": "", "imagename": "9fab2a12cd244163506de0601600bcaf.jpeg", "infoid": 1066512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每个论坛碎片包含9亿个关系和182百万个节点。该人员碎片包含30亿人和他们之间的160亿个关系。\n  “100台机器不酷。你知道什么很酷？一万亿的关系。“\n 我并不是说有人实际说出了这些确切的话语，但我很确定我们都认为他们。那是一个月前，当我们决定尝试并建立曾经存在的最大的图形数据库。\n   当我们推出Neo4J面料时，我们还创建了在FOSDem 2020呈现的概念基准证据。\n 它表明，对于1TB数据库，吞吐量和延迟随着它分布在的碎片数量而直线地改善。更多的碎片，更性能。\n  结果看起来很好，并确认我们对缩放图形数据库的方法非常了解。开发面料继续使其成为Neo4J的一个组成部分。\n 创建并改进了新技术（服务器端路由是一个很好的例子），也适用于非结构设置。 \n但是，来自FOSDEM的1TB数据集总是唠叨我们。 1TB至少是那么大，至少是Neo4J。我们经常具有10TB或更大的生产设置，虽然它们在大型机器上运行，但Neo4j展现得很好。\n 我们并没有真正需要解决方案;我们需要一个真正大数据库的解决方案。这就是我们创造了面料的原因，但我们还没有找到它的极限。\n 那个规模是什么？一年前，我们建造了40台机器的集群，他们效果很好。前往100台机器似乎没有挑战。数十亿个节点，也许？嗯，数十亿个节点与几TB数据相同。\n 此外，图形模式的丰富性来自节点之间的关系，而不是节点本身。记住：我们正试图看到我们可以推动neo4j，不仅让自己感觉或看起来不错。\n 每一个现在都会出现同样的讨论，并且变得明显，我们正在寻找一个机遇，一个避雷针，将我们在一个现实的目标。\n 事实证明，我们最大的在线开发人员会议，该机会是2021年6月17日的节点。\n  我们决定，我们需要向世界展示我们谈论规模时的意思。不仅仅是Neo4J水平缩放时可以保留甚至提高性能，但显示我们仍然可以在仍然保持性能时进行多远。 \n我们将需要更大的数字。需要注意的东西。不是数百台机器或数十亿节点。\n   你甚至在哪里找到一个带有万亿关系的数据库？使用生产设置将出现物流问题 - 数据传输本身将是复杂的，更不用说混淆数据，因此可以适合公共视图。我们需要从已知模型生成它。我们知道我们需要从数据模型开始，因为它会给我们机器的数量和大小，我们运行的查询，以及我们创建的测试。简而言之，从数据模型开始，以获得它需要的努力。\n LDBC是一个很好的候选人。它是一个包含人，论坛和帖子的社交网络。它很容易理解和解释，我们非常熟悉它。我们决定了30亿人，超越了地球上最大的社交网络。选择了社交连接程度，以便该人员碎片将出现850GB，每个论坛碎片都会以250GB来到250GB，每个人都有约900万个关系。为了获得1万亿的关系，我们需要大约1110个论坛碎片，每个人都是自己的机器。\n  这是1110个论坛碎片，加上冗余的更多信息，每个都需要有一个为它生成的商店。\n 我们还想要连接到10,100和所有碎片的3个面料代理，以了解系统尺度如何随数据尺寸的增长。并且，随着时钟滴答作响，我们需要一个计划来协调所有这些机器。\n 这一切都是关于管理风险。我们预期，如果麻烦发现我们，它是在商店生成期间或在网络中严重发出故障的东西。事实证明，我们就是一半。\n   一个是举办碎片的大量机器。另一个正在生成碎片数据，我们知道需要并行发生，因此也需要协调大量机器。 \n我们需要一个两步的方法。第一步将是全尺寸的商店，而是少数NEO4J进程。这将让我们测试并行商店创建，发电机，从桶到分片的存储器，也测试延迟测量客户端的MVP。\n 它不会对我们的编排工具（以后来）对任何压力进行压力，并允许我们专注于为我们的概念证明正确地接线。事情很好地锻炼身体，我们都有所有的作品。一切似乎都在一起工作，现在我们可以屏住呼吸并获得第二阶段 - 全尺寸。\n 剩下两周后，我们搬到第二步：我们拔出了所有的挡块并支撑了影响。\n 提到的第一个问题是AWS实例配置开始在左右800台机器时不可预测地失败。一些侦探工作导致发现我们对我们的AWS帐户有一个vcore限制，这些账户没有让我们创建任何机器。 AWS支持迅速提升，我们继续创建实例只会达到更严重的限制：\n “我们目前没有足够的x1e.4xlarge容量，具有支持”GP2“卷。我们的系统将致力于提供额外的容量。“\n 唔。看起来亚马逊缺乏容量。这让我们留下了两个选择。要么用于多个可用性区域或较小的实例类型。我们决定多AZ的复杂性和未知数，所以我们现在做了更小的实例，如果表现是一个问题，我们稍后会处理它。到达全部的实例是最重要的目标。\n 使用较小的实例执行了诀窍，第二天我们拥有1129个碎片的全部或跑步。延迟测量演示应用程序几乎准备就绪，因此我们决定拍摄一些测量以查看我们的立场。 \n完整的面料代理，指向所有1129个碎片的一个，是时机。 Neo4j日志文件没有任何相关的错误消息，只是超时。没有GC暂停，没有防火墙错位;常规嫌疑人都没有责备。每个单独的碎片正常响应，并且面料代理也没有显示任何问题。它花了一个晚上的调查工作，发现这个问题是DNS查询限制。随着AWS文件指出：\n “亚马逊提供DNS服务器每秒每个弹性网络接口（ENI）执行每秒1024个数据包的限制。亚马逊提供DNS服务器拒绝超过此限制的任何流量。“\n 是的。这应该这样做。我们的Fabric配置正在使用碎片的DNS名称，因此我们在我们提交的每个查询上立即到达了该限制。解决方案非常简单 - 只需使DNS条目静态在结构实例上，不再依赖于DNS（/ etc / hosts ftw）。\n 这是我们必须克服的最后一个限制。我们的初始延迟编号看起来非常好，我们决定没有理由转移到更大的实例类型，这也有助于保持成本合理。\n 总的来说，我们在按一下按钮时，我们建立了允许我们的工具，以设置1129个碎片群托管280 TB数据，3小时内的3个面料代理。耶！它只需要16天到达那里。\n 我们剩下的时间清除配置和查询，并尝试延迟测量应用程序。我们还在图表本身上播放，创建了新的Ad-hoc查询，以获得使用如此大的设置。\n     我们不想创建一个纯粹的演示程序，因此我们决定通过使用万亿图表存储库尝试自己（在不同的尺度）上运行Setup（以不同的尺度）运行设置。记得要注意你的AWS账单♥！ \n这只是长途旅程的第一步。 我们有很多工作要做，以了解大图数据库的表现方式，网络变化如何聚合为噪音以及我们应该如何改进系统以超出我们为此演示所实现的数字。 ", "note_en": "Each forum shard contains 900 million relationships and 182 million nodes. The person shard contains 3 billion people and 16 billion relationships between them.\n  “100 machines isn’t cool. You know what’s cool? One trillion relationships.”\n I’m not saying that someone actually uttered these exact words, but I’m pretty sure we all thought them. That was a month ago, when we’d decided to try and build the biggest graph database that has ever existed.\n   When we introduced  Neo4j Fabric, we also created a  proof of concept benchmark that was presented at FOSDEM 2020.\n It showed that, for a  1TB database, throughput and latency  improve linearly with the number of shards that it’s distributed across. More shards, more performance.\n  The results looked good and confirmed that we had a very good understanding of the approach to scaling a graph database. Development of Fabric continued toward making it an integral part of Neo4j.\n New technologies were created and improved upon (server-side routing is a good example) and made useful for non-Fabric setups as well.\n But, that 1TB dataset from FOSDEM was always nagging us.  1TB is not that big, at least for Neo4j. We routinely have production setups with 10TB or more and, although they run on considerably large machines, Neo4j scales up pretty well.\n We didn’t really need a solution for that; we needed a solution for  really big databases. That’s why we had created Fabric, but we hadn’t found its limit yet.\n And what would that scale be? A year ago we built clusters of 40 machines, and they worked out pretty well. Going to 100 machines didn’t seem that much of a challenge. Billions of nodes, perhaps? Well, billions of nodes is the same as a few TB of data.\n Plus, the  richness of a graph schema comes from relationships between nodes, not the nodes themselves. Remember: We’re trying to see how far we can push Neo4j, not just make ourselves feel or look good.\n Every now and then the same discussion would come around, and it was becoming clear that we were looking for an opportunity, a lightning rod, that would ground us in a realistic goal.\n Turns out, that opportunity was  NODES 2021 on June 17, our biggest online developer conference.\n  We decided that we needed to show the world what we mean when we talk about scale. Not  just that Neo4j can retain or even improve performance when scaled horizontally, but to show how far we can go while still retaining performance.\n We’re going to need bigger numbers. Something that demands attention. Not hundreds of machines or billions of nodes.\n   Where do you even find a database with a trillion relationships? Using a production setup would present logistics problems — the data transfer itself would be complicated, not to mention obfuscating the data so it’s appropriate for public view.  We’ll need to generate it for ourselves, from a known model. And we knew we needed to start with the data model, since that would give us the number and size of machines, the queries we’d run, and the tests we’d create.  In short, start with the data model to get a sense of the effort it would take.\n LDBC is a good candidate. It is a social network that contains people, forums, and posts. It’s easy to understand and explain and we are very familiar with it. We decided on  3 billion people, surpassing the largest social network on the planet. The degree of social connectivity was chosen so that the person shard would come out 850GB, and every forum shard would come at 250GB with about 900 million relationships each.  To get to the target of 1 trillion relationships we’d need about  1110 forum shards in total, each its own machine.\n  That’s 1110 forum shards, plus a few more for redundancy, each of which will need to have a store generated for it.\n We also wanted 3  Fabric proxies connecting to 10, 100 and all the shards to see how the system scales as data sizes grow. And, with the clock ticking, we needed a plan to orchestrate all these machines.\n It was all about managing risk. We expected that, if trouble found us, it would be either during store generation or something glitching badly in the network. As it turned out, we were half right.\n   One was the  large number of machines that would host the shards. The other was generating the shard data, which we knew needed to happen in parallel and would, therefore, also need orchestrating a lot of machines.\n We needed a two-step approach. The first step would be full-sized stores but a small number of Neo4j processes. That would let us test the parallel store creation, the generators, the installation of the stores from the buckets to the shards, and also test the MVP of the latency-measuring client.\n It wouldn’t put any stress on our orchestration tools (that would come later), and allows us to focus on getting everything wired properly for our proof of concept. Things worked out pretty well, and we had all the pieces in place. Everything seemed to work together, and now we could hold our breath and go for the second phase — full size.\n With two weeks left, we moved to step two:   We pulled out all the stops and braced for impact.\n The first issue that came up was that AWS instance provisioning started failing unpredictably at around 800 machines. Some detective work led to discovering that we have a vCore limit on our AWS account that didn’t let us create any more machines. AWS Support lifted it promptly and we continued creating instances only to hit a more serious limitation:\n “We currently do not have sufficient x1e.4xlarge capacity in zones with support for ‘gp2’ volumes. Our system will be working on provisioning additional capacity.”\n Hmm. It would seem   Amazon had run out of capacity. This left us with two options. Either go for multiple Availability Zones or for smaller instance types. We decided that there’s more complexity and unknowns going for multi AZ, so we’d do smaller instances for now and, if performance was a problem, we’d deal with it later. Getting to the full number of instances was the most important goal.\n Using smaller instances did the trick, and the next day we had the full contingent of 1129 shards up and running. The latency measuring demo app was almost ready so we decided to take some measurements to see where we stand.\n  The complete fabric proxy, the one pointing to all 1129 shards, was timing out. Neo4j log files didn’t have any relevant error messages, just the timeouts. No GC pauses, no firewall misconfigurations; none of the usual suspects were to blame. Each individual shard was responding normally, and the Fabric proxy didn’t show any problems either. It took an evening of investigative work to find that the issue was   DNS query limiting. As AWS documentation points out:\n “Amazon provided DNS servers enforce a limit of 1024 packets per second per elastic network interface (ENI). Amazon provided DNS servers reject any traffic exceeding this limit.”\n Yup. That should do it. Our Fabric configuration was using DNS names for the shards, so that limit was reached immediately on every query we submitted. The solution was quite simple — just make the DNS entries static on the Fabric instance and no longer depend on DNS ( /etc/hosts FTW).\n And that was the last limit we had to overcome. Our initial latency numbers were looking very nice and we decided there was no reason to move to larger instance types, which would also help keep the costs reasonable.\n Overall, we had build tools that allowed us, at the press of a button, to set up a  1129 shard cluster hosting 280 TB of data, with 3 Fabric proxies, in under 3 hours. Yay! And it took us only 16 days to get there.\n We spent the rest of the time fine-tuning the configurations and the queries, and trying out the latency measuring app. We also played around with the graph itself, created new ad-hoc queries to get a feel of working with such a large setup.\n     We didn’t want to create a pure demo-ware, so we decided to make everything public under the ASL, you can try to run the setup yourself (at different scales) by using the   trillion-graph repository. Just remember to watch your AWS bill 💸!\n   This is just the first step in a long journey. We have a lot more work to do to understand how large graph databases behave, how network variations aggregate as noise and how we should improve the system to scale beyond the numbers we achieved for this demo.", "posttime": "2021-06-18 01:06:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,创建,creating", "title": "在创建世界上最大的图表数据库的幕后 ", "title_en": "Behind the Scenes of Creating the World’s Biggest Graph Database", "transed": 1, "url": "https://medium.com/neo4j/behind-the-scenes-of-creating-the-worlds-biggest-graph-database-cd22f477c843", "via": "", "real_tags": ["数据库", "database", "创建", "creating"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CloudFlare在全球范围内提供巨大的DNS速度，它们有一个设计精心设计的控制面板，用于管理DNS托管，并将其与优质免费服务合并，您可以获得强大而非常吸引博主托管解决方案，适用于博主，WEBSHOP业主以及拥有的任何人网站。然而，大多数人都忽略了CloudFlare，以安全为名，每天都会阻止数百万个有效的用户访问CloudFlare在其托管服务中注册的网站。\n 在DNS设置的控制面板中，您可以选择一个名为＆＃34;防火墙＆＃34;，在该选项中，有一个名为＆＃34;安全级别＆＃34;\n  默认情况下，它设置为＆＃34;中等＆＃34;这意味着许多人将被您的网站封锁非常讨厌和耗时的CAPTCHA。此选项的问题是在免费服务中无法禁用它。您实际上必须支付企业版，这是每个域每个域的200美元，以便禁用该功能。即使您将设置设置为最低可用价值，它基本上是关闭的，您的许多访客仍将被阻止。\n   验证码可能看起来有害，但往往重复几次显示不同的谜题来解决。当您单击图片时，已插入了许多费用效果，并且图片在才能替换为另一张照片之前，图片大约需要3-4秒。这个过程非常烦人，很多人都将只是离开你的网站。\n 对互联网隐私的需求正在迅速增长，每天越来越多的人正在签署世界各地的VPN服务。 CloudFlare默认情况下，这些服务通常被阻止，这是一个严重的问题。\n 在这里＆＃39;是youtube上的一个例子，如果您使用VPN服务和Firefox的反跟踪插件，它可以是多么烦人的烦恼。\n  CloudFlare在人们面前抛出的验证解决方案绝对无关的情况与安全性无关，它永远不会阻止任何邪恶意图的人，以实现他们想要的任何东西。专业黑客有巨大的僵尸网络，僵尸网络，由数千名受损的计算机全球，具有非常不同的IP地址。 CloudFlare无法使用愚蠢的CAPTCHA保护您的网站，他们唯一可以做的是阻止和哈拉哈拉维斯重视隐私访问您的网站。如果您重视访问者，您需要了解这一点。 \n无论您需要提供什么，没有人都愿意填写讨厌的CAPTCHA才能访问您的网站。随着CloudFlare的迅速增长，就像迅速一样迅速抵制使用CloudFlare DNS托管解决方案的网站。\n 看看CloudFlare Mitm攻击Firefox插件的块。如果您使用CloudFlare，则此插件将完全阻止您的网站，并且它是一个强烈推荐的插件。\n  CloudFlare的另一个非常严重的问题是，它们是与他们的CDN（内容交付网络）服务充当MITM（中间人），其中他们在其他内容中，将您的网站内容缓存并显示给您的访客。如果你＆＃39;重新运行一个普通网站，就像博客一样，人们从来没有真正访问你的网站，他们＆＃39; ll只是从cloudflare获得内容。然而，这不是严重的问题，严重的问题是他们为所有使用他们服务的人提供了SSL连接，以便他们成为中间人的方式。在CloudFlare服务器之后，您的连接只会加密，直到CloudFlare服务器只能清晰的文本。连接在浏览器和CloudFlare之间进行加密，如果网站具有SSL证书，则在CloudFlare和网站之间进行加密，但在CloudFlare之间的通信仍然完全可见。\n 您可以通过去使用CloudFlare＆＃39; s ssl连接的任何网站来检查。检查网站的证书。你＆＃39; ll注意到它＆＃39; s cloudflare证书，而不是您的网站上的证书＆＃39;实际访问的网站。\n  想象一下b作为你的浏览器，也是web服务器。在正常的通信流中，它看起来像这样：\n  当您使用SSL连接访问网站时，浏览器（B）检查加密证书，如果验证，则在浏览器（B）和Web服务器之间建立加密连接。现在想象一下，我们在浏览器和Web服务器之间设置另一台计算机。\n  在此设置中，中间（C）和WebServer中的计算机都具有SSL证书。当您的浏览器请求加密连接到网站时，它会从中间的计算机中获取证书，在这种情况下，在这两个情况下建立加密通信。然后中间的计算机与Web服务器相同，并且在中间和Web服务器中的计算机之间建立加密连接。但是，中间的电脑现在看到了。 \n让＆＃39; s说你点击网站上的东西。 ＆＃34;点击＆＃34;在SSL通信中加密并发送到计算机，然后中间的计算机解密通信并查看＆＃34;单击＆＃34;，然后再次加密通信并将其发送到Web服务器再次解密通信以便提供＆＃34的内容;点击＆＃34;\n 所以你真的希望Cloudflare抢夺网站和访客或客户之间的沟通吗？即使在Web服务器上运行SSL证书，CloudFlare也能看到一切。\n 您需要了解用户，访问者访问您的网站，挂锁图标误导了错误状态，误导与您的网站的连接是安全的。用户相信，当他们看到挂锁图标时，将拥有一个安全的端到端隧道到您的网站，而他们不知不觉地将隧道到CloudFlare，谁在到达您的网站之前看到所有的TRAFIC。\n  这意味着在没有访问者的同意或知识的情况下，正在向CloudFlare披露敏感数据。\n   如果您正在寻找DDOS缓解，基本上使用它在网络级别提供的任何提供商 - 它真的没有必要访问HTTP流量以缓解攻击。此外，Don＆＃39; t跑apache  - 它＆＃39;令人遗憾的是易受各种低带宽攻击的攻击。\n 一个非详尽的＆＃34;真实和＃34;缓解提供者（请注意，我没有提出任何特定的建议）：\n  您＆＃39; ll想要避免任何HTTM特定的（因为它将容易出现与CloudFlare相同的隐私问题），并仅选择第3/4层缓解。另一种选择，如果您＆＃39;以更大的规模运行，是购买缓解设备并刚刚设置自己的缓解基础设施。这不会便宜，需要一些严重的连接，但超越某个点＆＃39; ll更具成本效益。如果您正在寻找WAF，请在自己的后端服务器和/或LoadBalancer上运行一个。真的，没有好处做到这一点。甚至类似于Modsecurity的东西也将涵盖各种问题。 \n如果你＆＃39;重新寻找节省带宽：不要打扰。目前，交通费用几乎没有任何内容，并通过拥有其他提供商缓存您的资产越来越突出所有用户的隐私（和潜在安全性），节省了几美元。如果您发现流量昂贵，您应该查找不同的提供商 - 一些提供商（如AWS）令人惊叹的过度充电。\n 如果你＆＃39;重新寻找更好的性能：CloudFlare并不是为了开始＆＃39;在那里的非静态资产的额外跳跃，并且根据您的服务器和用户的位置，它实际上可以减慢速度。如果您的表现对毫秒至关重要 - 而且机会是，它是＆＃39; t  - 查看提供符号的托管提供商。\n 如果您＆＃39;重新寻找DNS托管：大量选择。许多提供商免费提供，如果您举办它们，飓风电气无论您托管，如果您需要SLA，那么＆＃39; S RAGE4和53号公路。几乎每个DNS托管提供商都使用ANYCAST 。\n 如果您＆＃39;重新查找魔术SSL / TLS：使用CADDY HTTPS://caddyserver.com/，它是一个HTTPD，它将通过Let＆＃39加密自动为您设置和续订证书，以及大大简化TLS配置。它基本上零努力＆＃39;\n 试图将其外包给第三方（如CloudFlare＆＃39; s＆＃34; hoseral ssl / tls＆＃34; docto）击败了这一点 - 这意味着第三方可以看到所有的流量，一直都在提供a虚假的安全感给您的用户。他们看到了挂锁，但他们的交通不是固定的端到端。\n   如果您想阻止浏览器中的CloudFlare网站，您可以通过Firefox插件（称为Block CloudFlare插件）这样做\n   如果您有任何意见或更正，请随时向我发送电子邮件。此外，如果您发现此内容有用，请考虑支持帕勒顿 ", "note_en": "CloudFlare delivers great DNS speeds worldwide and they have a really well designed control panel for managing DNS hosting, combine that with a premium free service and you get a powerful and very attracting DNS hosting solution for bloggers, webshop owners, and anyone else who owns a website. However, what most people overlook is that CloudFlare, in the name of security, every day blocks millions of valid users from visiting the websites that CloudFlare has registered in their hosting service.\n In the control panel for DNS setup you have an option called &#34;Firewall&#34;, and within that option there is a setting called &#34;Security level&#34;.\n  By default it is set to &#34;Medium&#34;, which means that a lot of people will be blocked from your website by a very annoying and time consuming CAPTCHA. And the problem with this option is that it  cannot be disabled in the free service. You actually has to pay for the Enterprise edition, which is more that 200 dollars a month per domain, in order to disable the feature. Even if you set the setting to the lowest available value in the free service, which is  Essentially off, many of your visitors will still be blocked.\n   The CAPTCHA may look harmless enough, but often it gets repeated several times displaying different puzzles to solve. Many times a fadeout effect has been inserted when you click on a picture and the picture takes about 3-4 seconds before it vanishes only to be replaced by yet another picture. The process is extremely annoying and many people will simply leave your website.\n The demand for privacy on the Internet is growing rapidly and every day more and more people are signing up for VPN services around the world. These services are often blocked by default by CloudFlare and this is a serious problem.\n Here&#39;s an example on YouTube on how annoying it can be if you&#39;re using a VPN service and an anti-tracking plug-in for Firefox:\n  The CAPTCHA solution that CloudFlare throws in the face of people has absolutely nothing to do with security and it will never block anyone with an evil intent from achieving whatever they want on your website. Professional hackers has huge botnets to work from, botnets consisting of thousands of compromised computer world wide with very different IP addresses. There is no way CloudFlare can protect your website with their stupid CAPTCHA, the only thing they can do is to block and harrash people who value privacy from visiting your website. You need to understand this well if you value your visitors.\n Nobody wants to fill out an annoying CAPTCHA just to visit your website, no matter what you have to offer. And just as rapidly growing as CloudFlare is, just as rapidly do people boycott websites that are using the CloudFlare DNS hosting solution.\n Take a look at the  Block Cloudflare MITM Attack Firefox plug-in. This plug-in will block your website completely if you&#39;re using CloudFlare and it is a highly recommended plug-in.\n  Another very serious problem with CloudFlare is that they act as a  MITM (man-in-the-middle) with their CDN (content delivery network) service in which they, amongst other things, cache your website content and display that to your visitors. If you&#39;re running a normal website, like a blog, many times people will never actually visit your website, they&#39;ll just get the content from CloudFlare. However, this is not the serious problem, the serious problem is that they provide SSL connections for all who use their service in a way that they become a man-in-the-middle. Your connection is only really encrypted up until the CloudFlare servers, after that the connection can simply be clear text. The connection is encrypted between the browser and CloudFlare, and between CloudFlare and the website if the website has a SSL certificate, but the communication in-between remains completely visible to CloudFlare.\n You can check this by going to any website that uses a CloudFlare&#39;s SSL connection. Check the certificate for the website. You&#39;ll notice that it&#39;s a CloudFlare certificate and not a certificate for the website you&#39;re actually visiting.\n  Imagine B as your browser and S as the webserver. In a normal communication flow it would look like this:\n  When you visit a website with a SSL connection, your browser (B) checks the encryption certificate and if it validates, an encrypted connection is established between your browser (B) and the webserver (S). Now imagine that we setup another computer in between your browser and the webserver.\n  In this setup both the computer in the middle (C) and the webserver has a SSL certificate. When your browser requests an encrypted connection to the website, it gets the certificate from the computer in the middle, in this case CloudFlare, then an encrypted communication is established between these two. Then the computer in the middle does the same with the webserver, and an encrypted connection is established between the computer in the middle and the webserver. However, the computer in the middle now sees everthing.\n Let&#39;s say you click on something on the website. The &#34;click&#34; gets encrypted in the SSL communication and send to the computer, then the computer in the middle decrypts the communication and sees the address of the &#34;click&#34;, it then encrypts the communication again and sends it to the webserver, which again decrypts the communication in order to deliver the content of your &#34;click&#34;.\n So do you really want CloudFlare to snatch the communication between your website and your visitors or customers? CloudFlare will be able to see everything even when you have a SSL certificate running on your webserver.\n You need to understand that users, the visitors to your website, are being mislead by the padlock icon that falsely state that the connection to your website is secure. Users believe, when they see the padlock icon, that the have a secure end-to-end tunnel to your website, while they unwittingly have a tunnel to CloudFlare, who sees all the trafic before it reaches your website.\n  It means that sensitive data is being disclosed to CloudFlare without the consent or knowledge of your visitors.\n   If you&#39;re looking for DDoS mitigation, use basically any of the providers that offer it on a network level - it&#39;s really not necessary to have access to HTTP traffic to mitigate attacks. Also, don&#39;t run Apache - it&#39;s notoriously vulnerable to various low-bandwidth attacks.\n A non-exhaustive list of &#34;real&#34; mitigation providers (note that I am not making any particular recommendations):\n  You&#39;ll want to avoid anything HTTP-specific (as it will be prone to the same privacy issues as CloudFlare), and opt for layer 3/4 mitigation only. Another option, if you&#39;re running at a larger scale, is to purchase mitigation appliances and just set up your own mitigation infrastructure. This will not be cheap and require some serious connectivity, but beyond a certain point it&#39;ll be more cost-effective. If you&#39;re looking for a WAF, run one on your own backend server(s) and/or loadbalancer(s). There&#39;s no benefit to doing this remotely, really. Even something relatively simple like ModSecurity will cover a wide array of problems.\n If you&#39;re looking to save bandwidth: don&#39;t bother. Traffic costs virtually nothing nowadays, and saving a few dollars by having another provider cache your assets hardly outweighs having the privacy (and potentially security) of all your users compromised. If you find traffic to be expensive, you should probably look for a different provider - some providers (like AWS) notoriously overcharge for it.\n If you&#39;re looking for better performance: CloudFlare doesn&#39;t really provide that to begin with. There&#39;s an extra hop for non-static assets, and depending on the location of your server and users, it can actually slow things down. If your performance is really critical to the millisecond - and chances are, it isn&#39;t - look into hosting providers that offer anycast.\n If you&#39;re looking for DNS hosting: plenty of options. Many providers offer it for free if you host with them, Hurricane Electric offers it for free regardless of where you are hosted, and if you need an SLA, there&#39;s Rage4 and Route 53. Pretty much every DNS hosting provider uses anycast.\n If you&#39;re looking for magic SSL/TLS: Use Caddy  https://caddyserver.com/, which is a HTTPd that will automatically set up and renew certificates for you through  Let&#39;s Encrypt, as well as greatly simplifying TLS configuration. It&#39;s essentially zero-effort.\n Trying to outsource this to a third party (like CloudFlare&#39;s &#34;Universal SSL/TLS&#34; does) defeats the point - it means that the third party can see all of your traffic, all the while providing a false sense of security to your users. They see the padlock, but their traffic is not secured end-to-end.\n   If you want to block CloudFlare websites in your browser you can do so by the Firefox plug-in called  Block CloudFlare plug-in\n   If you have any comments or corrections please feel free to email them to me. Also, if you found this content useful consider supporting me on  Patreon", "posttime": "2021-06-18 01:06:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远离,stay,cloudflare", "title": "远离CloudFlare ", "title_en": "Stay Away from Cloudflare", "transed": 1, "url": "https://unixsheikh.com/articles/stay-away-from-cloudflare.html", "via": "", "real_tags": ["远离", "stay"]}, {"category": "", "categoryclass": "", "imagename": "40dbfbdf464bcedef0dc1e8c5d95d125.jpg", "infoid": 1066510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，萨尔瓦多政府通过了一项法律，接受比特币作为美元的法律招标。该国每年收到60亿美元的汇款 - 近四分之一的国内生产总值 - 希望比特币的交易成本较低，可能会增加几个百分点。\n  该举措首先由该国总统Nayib Bukele提出，他表示，除了促进汇款费用之外，比特币计划还会吸引投资，并为居民提供储蓄的途径，其中约70％是unbank。 （Bukele没有说什么，但彭博会报道的是，他和他的政党成员多年来拥有比特币。）将Cryptocurry添加到名单并不是一个简单的任务，而且新法律给出了一个简单的任务这个国家只是三个月的全国范围内推出了这个计划。没有任何国家使用比特币或任何其他加密货币作为法律投标，挑战比比皆是。为了解决这些问题，萨尔瓦多转向世界银行和国际货币基金组织的援助;后者目前正在考虑来自该国的13亿美元的融资请求。\n 国际货币基金组织提供了对萨尔瓦多的比特币举措的守卫评估，发言人格里·赖斯在新闻发布会上说，“采用比特币作为法律招标提出了许多需要非常仔细分析的宏观经济，财务和法律问题。”\n 世界银行不太慷慨。 “我们致力于以多种方式帮助萨尔瓦多，包括货币透明度和监管流程，”世界银行发言人告诉路透社。 “虽然政府确实对比特币进行了援助，但这不是世界银行可以支持环境和透明度缺点的东西。”\n    换句话说，比特币的能源需求及其在洗钱，逃税和其他非法计划中使用的易用性使得加密货币成为世界银行的眼睛。\n   世界银行和国际货币基金组织的其他原因可能是埃尔瓦多的出价持怀疑态度，以便使用比特币。技术挑战并不微不足道。对于一个，比特币相对于美元的价格具有高度挥发性。如果比特币的价格在几个小时内波动10％，你如何在比特币中的价格如何？也许答案是你没有。在El Zonte的“比特币海滩”中，萨尔瓦多，比特币使用的比特币使用相对普遍，商家仍然以美元的价格价格，汇率设定在购买时。这种方法似乎是El Salvadoran政府正在服用的东西，但它将比特币变得更像是令牌而不是真正的货币。其次，比特币交易可以令人惊奇地慢。每个必须由矿工验证，矿工只能处理交易块，而不是单独的。因此，对于购买比特币进行确认，双方必须等待块完成。目前，一个街区需要大约10分钟才能添加到区块链中，但在El Zonte，一位商家表示，在大约两分钟内在她的本地应用中确认了交易。各种项目正在努力提高交易速度，但它们尚未适当的比特币的一部分。\n 最后，虽然比特币交易可能廉价甚至自由，但他们倾向于收取给他们的费用。不需要费用，但他们确实诱使矿工验证交易。另外，萨尔瓦多人是否希望交换他们的比特币，也有与之相关的费用。因此，虽然该举措可以节省汇款费用，但运行约3％，而系统则不会是无成本的。 \n萨尔瓦多仍然可以从世界银行或国际货币基金组织的帮助下拉动移动，但它将是更具挑战性的。 时钟正在滴答。 除非企业无需访问所需的技术，否则他们将在2021年9月7日之前接受比特币。 ", "note_en": "Last week, El Salvador’s government  passed a law to accept bitcoin as legal tender alongside the US dollar. The country receives $6 billion in remittances per year—nearly a quarter of its gross domestic product—and the hope is that bitcoin’s lower transaction costs could boost that amount by a few percentage points.\n  The move was first proposed by the country’s president, Nayib Bukele, who said he hoped that in addition to facilitating lower remittance fees, the bitcoin plan would attract investment and provide an avenue for savings for residents, about 70 percent of whom are unbanked. (What Bukele didn’t say, but what Bloomberg has  reported, is that he and members of his political party have owned bitcoin for years.) Adding the cryptocurrency to the roster isn’t a simple task, though, and the new law gives the country just three months to roll the plan out nationwide. No country has ever used bitcoin or any other cryptocurrency as legal tender, and challenges abound. To address those concerns, El Salvador turned to the World Bank and the International Monetary Fund for assistance; the latter is currently considering a $1.3 billion  financing request from the country.\n The IMF offered a guarded assessment of El Salvador’s bitcoin move, with spokesperson Gerry Rice saying at a  press briefing, “Adoption of bitcoin as legal tender raises a number of macroeconomic, financial, and legal issues that require very careful analysis.”\n The World Bank was less generous. “We are committed to helping El Salvador in numerous ways, including for currency transparency and regulatory processes,” a World Bank spokesperson told  Reuters. “While the government did approach us for assistance on bitcoin, this is not something the World Bank can support given the environmental and transparency shortcomings.”\n    In other words, bitcoin’s  energy demands and its ease of use in money laundering, tax evasion, and other illegal schemes makes the cryptocurrency a no-go in the eyes of the World Bank.\n   There are other reasons the World Bank and the IMF may be skeptical of El Salvador’s bid to use bitcoin. The technical challenges aren’t insignificant. For one, bitcoin’s price relative to the dollar has been highly volatile. How do you price a dozen eggs in bitcoin if the price of bitcoin fluctuates 10 percent in a few hours? Perhaps the answer is that you don’t. In the “Bitcoin Beach” of El Zonte, El Salvador, where bitcoin use is relatively widespread, merchants  still price their goods in dollars, and the exchange rate is set at the time of purchase. That approach  appears to be what the El Salvadoran government is taking, but it treats bitcoin more as a token than a true currency.   Second, bitcoin transactions can be notoriously slow. Each must be verified by miners, and miners only process blocks of transactions, not individual ones. So for a purchase in bitcoin to be confirmed, both parties have to wait for the block to be completed. Currently, one block takes about 10 minutes to be added to the blockchain, though  in El Zonte, one merchant said transactions are confirmed in her local app in about two minutes. Various projects are working to improve the transaction speed, but they’re not part of bitcoin proper yet.\n Lastly, while bitcoin transactions could be inexpensive or even free, they do tend to have a fee attached to them. Fees aren’t required, but they do entice miners to verify a transaction. Plus, should Salvadorans want to exchange their bitcoin for dollars, there are charges associated with that, too. So while the move could save on remittance fees, which run about 3 percent, the system won’t be costless.\n El Salvador could still pull off the move without help from the World Bank or the IMF, but it will be that much more challenging. And the clock is ticking. Unless businesses don’t have access to the technology required, they’ll have to accept bitcoin by September 7, 2021.", "posttime": "2021-06-18 00:30:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "比特币,下降,bank,法律", "title": "世界银行抨击比特币，下降，帮助萨尔瓦多的加密货目 ", "title_en": "World Bank slams bitcoin, declines to help El Salvador’s cryptocurrency plan", "transed": 1, "url": "https://arstechnica.com/tech-policy/2021/06/world-bank-slams-bitcoin-declines-to-help-el-salvadors-cryptocurrency-plan/", "via": "", "real_tags": ["比特币", "下降", "bank", "法律"]}, {"category": "", "categoryclass": "", "imagename": "96dbf4e0ec5ae30f4059f4962e8c38d6.png", "infoid": 1066509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，微软和Bethesda确认，星际域将在明年完全来到Xbox系列X / S和PC。虽然这种独家交易被微软自微软自获暗示和重视许多人的暗示和严重疑问。Subs公司的母公司，该公告仍然是PlayStation 5个业主希望发挥即将发挥的悲伤新闻空间史诗。 Bethesda营销和通信Pete Hines高级副总裁表示，他肯定可以了解PS5业主必须感受到的。在周三与GameSpot的视频采访中，他向PS5业主提供了同情和道歉，对此移动感到不满。\n ＆＃34;我不知道如何淘汰消费者和Playstation 5球迷的担忧，除了说i＆＃39; Ma Playstation 5玩家也是＆＃39;在那个控制台和那里的游戏玩游戏39; S＆＃39; M继续播放它，＆＃34; Hines说。 ＆＃34;但如果你想玩Starfield [它＆＃39; s] xbox和pc。对不起。我只能说的是，我道歉，因为我敢于对人们令人沮丧，但是在那里令人沮丧，但是在那里，我不是一个整个我能做的。＆＃34;\n  与此同时，Hines似乎表明Xbox Cloud Gaming可以为Don＆＃39; T有一个Xbox或游戏PC来通过＆＃34访问Starfield的玩家提供一种方法。＆＃34; Hines提到了Xbox首席菲尔斯宾塞＆＃34;谈到了它们如何展开展开，我们希望扩展到......希望将Xbox游戏带到Don＆＃39; t拥有s或x甚至a的人PC但想玩我们＆＃39;重新带到游戏通行证。＆＃34; ＆＃39;最近宣布的宣布计划将Xbox Cloud Gaming扩展到许多智能电视和通用Web浏览器，如Chrome，Safari和Edge等Xbox Cloud Gaming。\n    Hines还表示Starfield＆＃39; S的排他性可以帮助其开发人员专注于游戏体验，而不是与其他平台的兼容性。 ＆＃34;我在这里告诉你，任何[开发人员]会告诉你这个，[当]你去更少的平台，你的发展变得更加精简，＆＃34;他说。 ＆＃34;您＆＃39;重新担心，＆＃39;嗯，这盒子如何与该框之间的工作如何...＆＃39;我们＆＃39;重新在该盒子上，所以它只需要在PC上的[和]上运行。狭隘的焦点总是有助于...＆＃34;\n    那个陈述呼应评论Bethesda Producer Todd霍华德本周在他说＆＃34的时候向电报罗德·霍华德致敬对于那些系统。＆＃34;\n 在那次采访中，霍华德也说他有＆＃34;一点点＆＃34;关于没有PS5版的Starfield的预订。 ＆＃34;你永远不想把人留出去，吧？＆＃34;但霍华德还建议Xbox云游戏手段＆＃34;我们看到它实际上越来越开放，使人们能够通过游戏通行证和其他事情 - 他们玩游戏的能力不会去下。它急剧上升......我只想说我希望每个人都有能力以某种方式扮演它。＆＃34;\n  10月回到10月，霍华德说这是＆＃34;很难想象＆＃34;像即将推出的过长的滚动仪一样，vi是Microsoft＆＃39的平台。但是，在微软之前，在3月份最终确定了Bethesda的收购之前，霍华德录取了两家公司Hadn＆＃39; T完全讨论了任何多平台发布协议的细节。 ＆＃34;我们已经完成了所有这些，诚实，＆＃34;他当时说。 ", "note_en": "This week, Microsoft and Bethesda confirmed that  Starfield will be  coming exclusively to Xbox Series X/S and PC next year. And while that kind of exclusivity deal had been  hinted at and  heavily suspected by many since  Microsoft&#39;s $7.5 billion acquisition of Bethesda&#39;s parent company, the announcement still came as sad news for PlayStation 5 owners hoping to play  the upcoming space epic. Bethesda Senior Vice President of Marketing and Communications Pete Hines said he can certainly understand how PS5 owners must feel. In  a video interview with GameSpot Wednesday, he offered his sympathy and an apology to PS5 owners upset about the move.\n &#34;I don&#39;t know how to allay the concerns of consumer and PlayStation 5 fans other than to say I&#39;m a PlayStation 5 player as well and I&#39;ve played games on that console and there&#39;s games I&#39;m going to continue to play on it,&#34; Hines said. &#34;But if you want to play  Starfield [it&#39;s] Xbox and PC. Sorry. All I can say is I apologize because I&#39;m certain that that&#39;s frustrating to folks, but there&#39;s not a whole lot I can do about it.&#34;\n  At the same time, Hines seemed to suggest that Xbox Cloud Gaming could provide a way for players who don&#39;t have an Xbox or a gaming PC to access  Starfield through the &#34;Xbox ecosystem.&#34; Hines mentioned that Xbox chief Phil Spencer &#34;has talked about how they&#39;re looking to expand that and... looking to bring Xbox games to folks who don&#39;t own a Series S or X or even a PC but want to play the games that we&#39;re bringing to Game Pass.&#34; That&#39;s an apparent reference to  Microsoft&#39;s recently announced plans to expand Xbox Cloud Gaming to many Smart TVs and generic web browsers like Chrome, Safari, and Edge.\n    Hines also said  Starfield&#39;s exclusivity could help its developers focus on the gameplay experience rather than compatibility with additional platforms. &#34;I&#39;m here to tell you, and any [developer] will tell you this, [when] you go to fewer platforms, your development gets more streamlined,&#34; he said. &#34;You&#39;re not worrying about, &#39;Well, how does it work on this box versus how does it work on that box...&#39; We&#39;re not making it on that box, so it just needs to run as well as possible on this one [and] on a PC. A narrow focus always helps...&#34;\n    That statement echoes comments Bethesda producer Todd Howard  made to The Telegraph this week, when he said that &#34;by focusing on those platforms [Xbox and PC], you really get to lean in a lot on making it the best it can be for those systems.&#34;\n In that interview, Howard also said he had &#34;a little bit&#34; of reservation about not having a PS5 version of  Starfield. &#34;You don’t ever want to leave people out, right?&#34; But Howard also suggested that Xbox Cloud Gaming means &#34;we see it actually opening up more and more and more so that people’s ability to play our games—via Game Pass and other things—their ability to play our games doesn’t go down. It goes up dramatically... I will just say I want everybody to have the ability to play it in some fashion.&#34;\n  Back in October, Howard  said it was &#34;hard to imagine&#34; a game like the upcoming  Elder Scrolls VI being exclusive to Microsoft&#39;s platforms. But that was before Microsoft&#39;s acquisition of Bethesda was  finalized in March, at a time when Howard admitted the two companies hadn&#39;t fully discussed the details of any multiplatform publishing agreements. &#34;We haven&#39;t gone through all of that, to be honest,&#34; he said at the time.", "posttime": "2021-06-18 00:29:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "vp,xbox", "title": "Bethesda vp为Starfield缺席PS5提供道歉 ", "title_en": "Bethesda VP offers apology for Starfield’s absence on PS5", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/bethesda-vp-offers-apology-for-starfields-absence-on-ps5/", "via": "", "real_tags": ["vp", "xbox"]}, {"category": "", "categoryclass": "", "imagename": "5ac13ea09f2a094c69a891d482f9d85d.jpg", "infoid": 1066508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌声称Tau家族“跨越”现有云VM。该系统具有各种配置，每个VM高达60Vcpus，每个VCPU为4GB内存。网络带宽高达32 Gbps，它们可以与各种不同的网络连接存储器耦合。\n “各行业的客户正在处理更加苛刻和数据密集型的工作量，并寻找加速性能和降低成本的战略方式，”Google Cloud Ceo Thomas Kurian在新闻稿中表示。 “我们与AMD这样的关键战略合作伙伴的工作使我们能够拓宽我们的产品，并为客户提供最优惠的商业关键申请 - 所有在行业中最清洁的云端。”\n   谷歌已经签署了一些高调客户的早期试用，包括Twitter，Snap和Doit。\n “在正确的价格点的高性能是我们努力服务全球公共对话的关键考虑因素”Twitter Platform Lead Nick Tornow在博客文章中表示。 “我们被初始测试兴奋，显示了两位数性能改进的潜力。我们正在与Google Cloud进行合作，更深入地评估价格和性能的优惠，以便通过使用新的Tau VM系列来实现。“\n  TAU VMS将于今年第四季度到达谷歌云。该公司已将该系统开放到客户预先注册的客户。定价取决于配置。例如，32VCPU VM Sporting 128GB RAM将达到每小时1.35美元。 ", "note_en": "Google claims the Tau family “leapfrogs” existing cloud VMs. The systems come in a variety of configurations, ranging up to 60vCPUs per VM, and 4GB of memory per vCPU. Networking bandwidth goes up to 32 Gbps, and they can be coupled with a variety of different network attached storage.\n “Customers across every industry are dealing with more demanding and data-intensive workloads and looking for strategic ways to speed up performance and reduce costs,” Google Cloud CEO Thomas Kurian said in a press release.  “Our work with key strategic partners like AMD has allowed us to broaden our offerings and deliver customers the best price performance for compute-heavy, business-critical applications– all on the cleanest  cloud in the industry.”\n   Google has already signed up some high-profile customers for an early trial, including Twitter, Snap and DoIT.\n “High performance at the right price point is a critical consideration as we work to serve the global public conversation,” Twitter Platform Lead Nick Tornow said  in a blog post. “We are excited by initial tests that show potential for double digit performance improvement. We are collaborating with Google Cloud to more deeply evaluate benefits on price and performance for specific compute workloads that we can realize through use of the new Tau VM family.”\n  The Tau VMs will be arriving for Google Cloud in Q3 of this year. The company has already opened the system up to clients for pre-registration. Pricing is dependent on the configuration. For example, a 32vCPU VM sporting 128GB RAM will run around $1.35 an hour.", "posttime": "2021-06-18 00:29:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "虚拟机,google,谷歌,announces,客户", "title": "谷歌宣布基于EPYC的TAU虚拟机 ", "title_en": "\n\t\t\t\tGoogle announces EPYC-based Tau virtual machines for Cloud\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/17/google-announces-epyc-based-tau-virtual-machines-for-cloud/", "via": "", "real_tags": ["虚拟机", "google", "谷歌", "announces", "客户"]}]