[{"category": "", "categoryclass": "", "imagename": "37afc438b2f3446ab90026a8f94ac2b6.jpg", "infoid": 1071999, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美丽的可视化正在推动数字世界的日新月异。如今，可视化对于帮助您脱颖而出非常重要。可视化在吸引观众的注意力和培养他们对内容的浓厚兴趣方面发挥着重要作用。好消息是有一些工具可以使可视化更容易创建、更易于访问和更易于共享。更重要的是，它们可以帮助您在各种设备上用各种数据讲述故事。在本文中，我们编写了一份完整的指南，介绍如何使用繁荣来改进您的工作。使用 Flourish 创建漂亮的 HTML 可视化可以帮助您实现您的要求。我们建议 Flourish 生成最佳可视化效果，并帮助您在数以千计的可视化效果中脱颖而出。蓬勃发展是一个令人难以置信的工具。它有很多标准图表可供选择，以及一些关于加载和便捷交互的附加动画。有一些很棒的内置颜色范围可供选择，也可以构建自己的颜色范围。 Flourish 中还有大量的自定义功能。这些好处有助于使可视化更加有效和有影响力。 Flourish 与其他工具的区别尤其明显，因为它提供了一些您在其他任何地方都找不到的图表。您还可以在几分钟内轻松自定义这些图表。这将节省您的时间并帮助您获得更好更快的结果。有许多数据可视化工具可用，但我们的第一个建议是 Flourish。为什么？这是因为在处理您的数据时，Flourish.studio 提供了一个在线且始终可访问的帮助系统，以指导您完成整个过程。\n您会在页面的右下角看到一个巨大的问号。单击它将引导您进入提示、技巧和技巧的数据库。 Flourish.studio 使您能够注册您的帐户。通过在 Flourish 上注册。您将获得很多关于如何创建和存储可视化的权力。当您第一次登录 Flourish.studio 时，您会看到一个带有以下选项的小菜单： 从这个菜单中，您可以创建一个单一的可视化（其中有很多）或一系列的可视化，这些可视化组合起来告诉一个数据驱动的故事。这是您的仪表板，因此如果您已经创建了可视化，它们也会出现在此处。当您访问繁荣.studio 的站点 (https://flourish.studio) 时，您将看到一个非常广泛的可视化模板可视化库，其中包含可用的可视化模板。对于初学者来说，这可能令人生畏或困惑。重要的是，您对可视化数据集的方式有所了解。 Flourish.studio 的创建者选择了可视化优先的方法。可视化使演示数据易于查找和共享。它向您展示了数据应该如何格式化。\n这是显示最终 HTML 可视化效果的绝佳工具。因此，如果您对可视化的最终结果感到紧张，请不要担心。您将获得预览，以便您更好地了解结果。此屏幕上有许多不同的选项可用于调整可视化效果。您可以进入许多不同的设置，例如显示多少信息、数据如何显示以及它的外观。对参数进行更改时，可视化会立即反映这些更改。在数据面板上，您可以手动更改数据或以各种格式上传数据。值得注意的是，这可以替换或补充在线文件中已有的信息。根据您制作的可视化类型，您提供的数据将采用不同的格式。例如，繁荣.studio 将接受可用于创建制图基元的 geoJSON 文件，并且它们可以被可视化。当数据表中存在数据时，您可以选择应在右侧屏幕上看到哪些列。您所做的任何调整都将显示在选项下方的预览中。收到所需的设计后，该过程的最后一步是共享可视化。 “导出和发布”按钮允许您共享您的工作。与他人分享您的工作也将帮助您获得进一步修改设计的建议和建议。与付费版本产品相比，该工具的免费版本非常有限。\nFlourish.studio 使您能够将可视化存储在静态图像文件中。您可以在屏幕上或打印中使用它们，或者将可视化集成到您的博客或其他具有交互式组件的在线资源中。 Flourish.studio 构建嵌入代码以插入到您的 HTML 源代码中以及一个 URL 以与您团队的其他成员共享您的内置可视化。", "note_en": "Beautiful visualizations are advancing the digital world day by day. Today, visualizations are important to help you stand out. Visualizations play a great role in capturing the audience’s attention and developing their keen interest in the content.\n The good news is that there are tools that can make visualizations easier to create, more accessible, and more shareable. What’s more is that they can help you tell stories with all kinds of data, across all kinds of devices.\n In this article, we’ve composed a complete guide on how you can use flourish to improve your work.\n Creating beautiful HTML visualizations with Flourish can help you achieve your requirements. We recommend Flourish to produce the best visualizations and help you stand out among thousands of visualizations.\n  Flourish is an incredible tool. It has a good selection of standard charts, as well as some additional animation on loading and handy interactivity. There are some great built-in color ranges to choose from, as well as the possibility to build your own. There’s also a good deal of customization in Flourish. These benefits help in making visualizations more effective and impactful.\n Flourish particularly sets itself apart from other tools as it provides several charts that you won’t find anywhere else. You can also customize these charts within a few minutes without any hassle. This will save you time and help you get better and quicker results.\n  There are many data visualization tools available but our first recommendation is Flourish. Why? It’s because when working with your data, Flourish.studio provides an online and always accessible help system to guide you through the process.\n You will see an enormous question mark on the bottom right-hand side of the page. Clicking that will lead you to a database of hints, tips, and tricks.\n  Flourish.studio enables you to register your account. By registering on Flourish. You will be provided with a lot of authority over how you create and store your visualizations.\n When you first log in to Flourish.studio, you’ll see a little menu with the following options:\n    From this menu, you may create either a single visualization (of which there are many) or a series of visualizations that are grouped to tell a data-driven story.\n This is your dashboard, so if you’ve already created visualizations, they’ll appear here as well.\n  When you go to flourish.studio’s site ( https://flourish.studio), you will be presented with a very extensive visual gallery of the visualization templates that it has available. This can be intimidating or confusing for beginners. It is important that you have some sense of the sort of way you would like to visualize your dataset.\n The creators of Flourish.studio have chosen a visualization-first approach. Visualizations make demo data easy to find and share. It shows you how data should be formatted.\n This is a great tool for showing what your final HTML visualizations will look like. So if you’re tense about the final outcome of your visualization, then don’t worry. You will be provided with a preview so you can have a better idea of your results.\n  There are many different options available on this screen to adjust the visualization. You can go into a lot of different settings such as how much information is shown, how the data is displayed, and the way it looks. When making changes to the parameters, the visualization immediately reflects those changes.\n  On the data panel, you may make manual changes to your data or upload it in a variety of formats. It’s worth noting that this can either replace or supplement the information already in the online file. The data you provide will be formatted differently depending on the type of visualization you’re making.\n For instance, flourish.studio will accept a geoJSON file that may be used to create cartographic primitives and they can be visualized.\n When data is present in the data table, you can select which columns should be seen on the right-hand screen. Any adjustments you make will be seen in the preview below your options.\n  Once you’ve received your desired designs, the final step in the process is to share the visualization. The “Export &amp; publish” button allows you to share your work. Sharing your work with others will also help you take suggestions and recommendations for modifying your designs further.\n      The free version of the tool is quite limited as compared to the paid version offerings.\n  Flourish.studio enables you to store the visualization in static image files. You can use them on-screen or in print, or to integrate the visualization into your blog or other online sources with interactive components.\n Flourish.studio builds embedded code to insert into your HTML source as well as a single URL to share your built-in visualization with other members of your team.", "posttime": "2021-08-08 02:20:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,html,beautiful", "title": "创建漂亮的 HTML 可视化", "title_en": "Creating Beautiful HTML Visualizations", "transed": 1, "url": "https://tiiny.host/blog/creating-beautiful-html-visualizations-with-flourish-a-complete-guide/", "via": "", "real_tags": ["可视化", "html", "beautiful"]}, {"category": "", "categoryclass": "", "imagename": "5d3284724a0534b587aef52cf9d2be09.jpg", "infoid": 1071998, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 Axios AM/PM 让您忙碌的日子变得更简单。在短短 5 分钟内了解新功能及其重要性。订阅 Axios Closer 以深入了解当天的商业新闻和趋势以及它们为何如此重要订阅 Axios Markets 以获取最新的市场趋势和经济见解。免费注册。通过 Axios Sports 尽情享受推动体育世界发展的统计数据和故事。免费注册。使用 Axios Login 从硅谷和 DC 获取我们对技术的明智看法。免费注册。通过 Axios Sneak Peek 获取新白宫的内幕指南。免费注册。通过 Axios Denver 获取影响您家乡的最重要故事的每日摘要\n通过 Axios Des Moines 获取影响您家乡的最重要故事的每日摘要 通过 Axios Twin Cities 获取影响您家乡的最重要故事的每日摘要 通过 Axios Tampa Bay 获取影响您家乡的最重要故事的每日摘要 获取每日摘要与 Axios Charlotte 一起了解影响您家乡的最重要故事 及时了解影响阿肯色州西北部的最重要和最有趣的故事，由当地记者撰写 这张单张幻灯片 — 用软银首席执行官孙正义的黄色潦草标记 —捕捉到这个时代对科技初创公司超大规模扩张的欣喜若狂，并伴随着极低的利率：大局：大量涌现的人在妄想的增长前景和盈利道路上追逐站不住脚的估值，几乎没有考虑基础业务和市场的现实结构体。\n华尔街日报记者艾略特·布朗和莫琳·法雷尔在撰写美味的新书“我们的崇拜”时发现了这张幻灯片，该书记录了 WeWork 日间饮酒联合创始人、前首席执行官兼首席执行官亚当·诺伊曼的诡计和羞辱蛇油推销员。 “当他考虑对 WeWork 进行更大的投资时，”作者写道，“孙正义将 WeWork 已经雄心勃勃的财务预测推向了商业历史上前所未有的领域。在与诺依曼的会面中，他草拟了一个价值 10 万亿美元的公司的愿景。”为了让 WeWork 上市，软银让高盛在一份同样由作者获得的宣传片中显得非常克制。高盛银行家包括上面显示的条形图（“你通往 1 万亿美元的道路”），它“既符合诺伊曼对巨额估值的渴望，又符合他对简单视觉效果的喜爱。”在这本书的封面上，商业记者查尔斯·杜希格 (Charles Duhigg) 称其为“骗子如何被称为有远见的人”的画像。头发狂野的诺依曼——一个将电视布道者的狂热与龙舌兰酒和大麻结合在一起的大喊大叫者，再加上赤脚漫步曼哈顿等怪癖——最终将他的孩子赶下了金融悬崖：WeWork 的兴衰是由力量的碰撞促成的：这位以魅力、肆无忌惮的乐观主义和精明的推销术为特征的人遇到了整个金融体系，准备好让他陷入困境。\n“如果泡沫多的风险投资部门不那么痴迷于寻找古怪和有远见的创始人，”作者继续说道，“WeWork 可能仍然只占据布鲁克林和曼哈顿下城的一小部分建筑物。”作者告诉我，COVID 关闭破坏了他们的报告旅行计划。但事实证明，当他们被困在家里时，与戏剧中的关键人物交谈会更容易，而不是试图在咖啡店见到他们并获得他们的信任。 《华尔街日报》交易团队的 Maureen Farrell 告诉我，在 We Work 传奇期间，有多少资本被摧毁是可怕的：“在这个大量资金追逐下一个伟大创意的时代，这让人们愿意没有制衡.”报道风险投资并现在撰写 SPAC 热潮的艾略特·布朗说，诺伊曼让“聪明人去做愚蠢的事情”：“Theranos 是一位有魅力的企业家，他编造数字来欺骗投资者。这是一位使用实数的有魅力的企业家——但是让他们自欺欺人。”", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   This single slide — marked up in the yellow scrawl of SoftBank CEO Masayoshi Son — captures this era&#39;s euphoria over the hyper-scaling of tech startups, combusting with extremely low interest rates:\n The big picture: Cash gushers chase indefensible valuations on delusional growth prospects and paths to profitability, with little regard for the reality of the underlying business and market structure.\n The slide was uncovered by Wall Street Journal reporters  Eliot Brown and  Maureen Farrell as they wrote the delicious new book &#34; The Cult of We,&#34; chronicling the wiles and humiliation of Adam Neumann, WeWork&#39;s day-drinking co-founder, former CEO, and chief snake-oil salesman.\n &#34;As he pondered a bigger investment in WeWork,&#34; the authors write, &#34;Son pushed WeWork&#39;s already ambitious financial projections into territory unprecedented in business history. During a meeting with Neumann, he scribbled out a vision for a company worth $10 trillion.&#34;\n  SoftBank made Goldman Sachs look downright restrained in a pitch deck, also obtained by the authors, to take WeWork public.\n Goldman bankers included the bar chart shown above (&#34;Your Path to $1 Trillion&#34;), which &#34;played to both Neumann&#39;s hunger for a giant valuation and his affinity for simple visuals.&#34;\n On the book&#39;s cover, business journalist  Charles Duhigg calls it a portrait &#34;of how grifters came to be called visionaries.&#34;\n The wild-haired Neumann — a yeller who combined a televangelist&#39;s frenzy with  tequila and weed, plus quirks that included strolling Manhattan barefoot — eventually drove his baby off a financial cliff:\n The rise and fall of WeWork was enabled by a collision of forces: a man characterized by charisma, unbridled optimism, and astute salesmanship met an entire financial system primed to fall under his spell.\n &#34;Had a frothy venture capital sector not been so obsessed with the search for eccentric and visionary founders,&#34; the authors continue, &#34;WeWork might still occupy only a smattering of buildings in Brooklyn and lower Manhattan.&#34;\n  The authors told me that COVID shutdown had sunk their reporting travel plans. But it turned out to be easier to talk to key players in the drama when they were stuck at home, rather than trying to meet them and gain their trust in a coffee shop.  Maureen Farrell, who&#39;s on The Journal&#39;s Deals team, told me it&#39;s scary how much capital was destroyed during the We Work saga:\n &#34;In this era of so much money chasing the next great idea, it makes people willing to not have the checks and balances.&#34;\n Eliot Brown, who covered venture capital and now writes about the SPAC frenzy, said Neumann got &#34;smart people to do dumb things&#34;:\n &#34; Theranos was a charismatic entrepreneur making up numbers to trick investors. This was a charismatic entrepreneur using real numbers — but getting them to delude themselves.&#34;", "posttime": "2021-08-08 02:19:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wework,axios", "title": "WeWork 图书：10 吨海市蜃楼", "title_en": "WeWork Book: The $10T Mirage", "transed": 1, "url": "https://www.axios.com/10-trillion-mirage-wework-book-0ee98f74-5370-419e-81ea-e0914bdc0f00.html", "via": "", "real_tags": ["wework", "axios"]}, {"category": "", "categoryclass": "", "imagename": "4a6e5e848df8e8a946c3057c990c25af.jpg", "infoid": 1071997, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在布鲁克林公园坡的清晨街道上，两个 9 岁男孩之间爆发了一场大喊大叫。他们礼貌地讨论万智牌的优点：来自游戏最新系列万智牌起源的聚会卡，并在一个阳光明媚的夏日里以不合理的音量在一个以双倍婴儿车和三倍浓缩咖啡而闻名的社区中这样做，而且，尤其是在上午 8 点 30 分，这里很安静。一小群人聚集在一起——其他年龄在 7 到 12 岁之间的玩家挤到最前面，以便他们可以看到所有的大惊小怪。他们想看看有问题的魔法卡，恶魔契约。这张牌说了什么会引起如此愤怒？ “欧文很烂”？在你的回合开始时，选择一个没有被选中的——万智牌的目的是将你对手的生命值从20点降至零——并且不输。玩家使用他们自己制作的一副牌，这些牌可以通过 15 张牌补充包或通过交易和谈判获得。牌组中充满了从你手上施展的神话野兽和法术，是否包含（或不包含）卡牌取决于玩家。这里我们有一张新牌，上面印有“你输了游戏”的字样。更奇怪的是，Origins 是一个核心系列——每年夏天推出一次的特殊卡片系列，通常比游戏的其他三个年度版本更简单。像恶魔契约这样的卡是元。它在您玩游戏时讨论正在玩的游戏。大多数万智牌比赛都以致命的生物攻击或牌库中的牌用完而告终。恶魔契约是一个更容易获得的强力卡牌，它避开了游戏的典型结构。这对任何玩家来说都非常重要，尤其是那些第一次涉足万智牌的玩家。但它象征着游戏的创造者《海岸奇才》在接近游戏设计的方式上的一次进化飞跃：万智牌正在拥抱神秘而复杂的事物，就在大门外。起源将是游戏的最后一个核心系列，任何玩家都需要手持的想法不再是万智牌行军命令的一部分。 “我们奖励情报。我们奖励好奇心。我们发现，当你阅读一张你不理解的卡片时，你会想要去理解它，”万智牌的首席设计师马克·罗斯沃特 (Mark Rosewater) 说。\n罗斯沃特去年在奇才队的网站上写了一篇长篇文章，概述了为什么每年为“初学者”设置的概念从根本上是有缺陷的，这引起了轰动。新玩家不应该在任何时候都感到舒服，而不是一年一次吗？另外，如果核心系列真的是针对初学者的，那么这个系列对于有经验的投石者来说毫无价值，而且这也是一大群观众。所以决定终止核心集，但这又带来了另一个问题。 Magic 一直在同一个发行周期内运作：一个核心系列，然后是三个独立但相关的发行版。这三集在业内被称为“街区”，发生在同一个地点，讲述了一个值得三部曲的故事。然后它又回到了另一个基本上没有故事的核心系列。罗斯沃特写道，从现在开始，每年将包含两个双人组。罗斯沃特说：“把核心套餐想象成一种冰糕，用来分餐总是很好的。” “所以多年来，我们一直在愚弄他们，但我们了解到的事实恰恰相反。人们并不害怕不了解一切。”随着时间的推移，核心系列变得更加复杂，包括罕见的经典卡牌重印和推动魔法信封的新卡牌，比如前面提到的恶魔契约。 “渐渐地，核心系列开始感觉像是定期扩展，”罗斯沃特说。 “我们的目标不是在复杂性上过于沉重。有些套装会比其他套装简单，让人们喘口气。我们不需要去核心系列来喘口气。”至于起源，Rosewater 想为核心系列举办一场维京葬礼。 “这不是核心套装！里面有很多不同的游戏机制，我们访问了 10 个不同的地方，”他说。 “ Origins 非常注重故事。我们全神贯注于故事，所以我们决定，让我们了解角色是谁。” Origins 通过印刷卡片来为自己讲述故事。其 10 个“神话稀有”插槽中的 5 个——比稀有更稀有的牌——专门用于来自万智牌多元宇宙的角色，我们稍后会看到更多，比如妮莎，森林冠军，以及不情愿的治疗师——死灵法师莉莲娜维斯。在 Origins 中，我们在孩提时代就遇到了他们。它们一开始是在你控制下的低等生物，当正确的触发器被激活时，你将卡片翻转过来以显示它们变成鹏洛客，相当于万智牌皇室。例如，莉莲娜的牌会在你的另一个生物死亡时翻转，因为莉莲娜在她不小心杀死了自己的兄弟时自己转向了黑暗艺术。是的，Origins 的设计空间包括在另一张万智牌的背面打印整张万智牌。 Origins 感觉不像是“核心系列时代”的结束，而更像是对万智牌互动方式的新方法实验的开始，Rosewater 会自豪地回顾这一点。当然，还有那些双面牌，虽然这不是第一次实施这个想法，但这是第一次将两种类型的牌——生物和鹏洛客——合二为一。与此同时，一些卡牌，比如 Keral Keep 修道院院长，是与你套牌中的其他法术以及游戏中的其他“区域”相互作用的生物。例如，在德州扑克之类的游戏中，有你的手，每个人都看到的牌，以及没人看到的牌组。这三个都是区域。万智牌包含更多——放逐中的牌、等待“变形”的面朝下的牌等——并且艾博特同时与多个互动。然而，最大的补充是许多生物都配备了新的“声望”能力，如果它们对你的对手造成伤害，这会使它们变得更强大。在这与 Liliana 等角色的变形之间，Origins 作为一套反映了 Origins 作为万智牌历史上的一个时刻。这是关于成长。\n但是，即使是这第四个打破壁垒的新增内容也无法与 Rosewater 提到的新玩家的狂热痴迷和好奇心相提并论。我在一家儿童游戏设计工作室工作，这意味着我身边有比大多数人一生中遇到的更多的万智牌玩家，他们都玩这款游戏不到几年。它在孩子们中非常受欢迎，他们既精明到可以从父母那里骗取 4 美元买一个助推器，又足够聪明，知道将你的大脑与其他人的大脑对抗是一件非常有趣的事情。例如，当一个破获的 Origins 包产生一个 Nissa 时，每个年轻玩家都会停止他们正在做的事情并在几英尺外出现。神话稀有牌会引起嫉妒，但主要是庆祝。这个双面谜将每个人聚集在一起，即使他们并不完全确定自己看到了什么。当我无意中让两个孩子互相攻击时，就会出现这种心态。恶魔契约也是秘稀，我向这些男孩提出的问题很简单：如果你在补充包中拿到这张牌，你会把它放在你的套牌中吗？随着战斗的进行，我想象着罗斯沃特脸上挂着灿烂的笑容。他是Wizards Of The Coast 网站和他的问答Tumblr 页面Blogatog 上的多产作家，在那里他尽可能与粉丝互动。他回答了他们的设计问题，暗示了未来的系列，并且不羞于讨论他作为设计师的失败。 “很久以前，我去找我的老板说我想变得更加透明，”他说。 “我的想法是——我们非常擅长制作游戏。如果我们教育观众如何制作一款好游戏，他们就会学会尊重制作一款好游戏的要素，并会想要购买它们。这股涨潮对我们有好处。” MaRo——Rosewater 在万智牌社区中的昵称——如果这些孩子提出关于恶魔契约的任何问题，他们可能会很乐意回答，几周后，他们就会得到他们想要的所有答案。但是没有时间了。他们的好奇心被点燃了。两个男孩一直在对方的喉咙里，直到他们有了一个想法：如果在必须选择第四个选项——你输掉比赛的那个——之前，你的套牌包括某种摧毁恶魔契约的方法怎么办？另一个男孩想了想，也同意了，列出了万智牌 22 年历史中符合要求的牌。一个女孩补充说，其他卡可以将恶魔契约送回你的手上，从而在你决定再次使用它时重置时钟。很快，每个人都在谈论深奥的策略，讨论持续了几个小时，直到一位最初的旁观者有胆量问我是否愿意与她交易。她有一个关于甲板的疯狂想法。", "note_en": "A shouting match has broken out on the early morning streets of Park Slope, Brooklyn between two 9-year-old boys.\n    They’re politely discussing the merits of a  Magic: The Gathering card from the game’s newest set,  Magic Origins, and doing so at an unreasonable volume for a sunny summer day in a neighborhood known for its double-wide strollers, triple-shot espressos, and, especially at 8:30 a.m., its quiet. A small crowd gathers—other players ages 7 to 12, pushing their way to the front so they can see what all the fuss is about. They want to see the  Magic card in question,   Demonic Pact. What does this card say that would summon such outrage? “Owen sucks”?\n      At the beginning of your turn, choose one that hasn’t been chosen—\n The object of  Magic: The Gathering is to knock your opponent’s life points from 20 to zero—and also not losing. Players use a deck of cards they’ve built themselves, the collection of which are acquired in 15-card booster packs or via trades and negotiations. Decks are full of mythical beasts and spells, cast from your hand, and the inclusion (or not) of cards is up to the player.\n   Here we have a new card that literally has the words “you lose the game” printed on it. Stranger still,  Origins is a core set—a special collection of cards that comes once every summer and is usually constructed to be less complex than the game’s three other annual editions. A card like Demonic Pact is meta. It discusses the game being played as you are playing the game. Most  Magic matches end with a fatal creature attack or running out of cards in your deck. Demonic Pact, a powerful card in a more accessible set, eschews the typical constructs of the game.\n   That’s a lot for any player to take in, especially one dipping their toe into  Magic for the first time. But it symbolizes an evolutionary leap in the way Wizards Of The Coast , the game’s creator, is approaching game design:  Magic is embracing the arcane and complicated, right out of the gate.  Origins will be the game’s last core set, and the idea that any player would need their hand held is no longer part of  Magic’s marching orders.\n “We reward intelligence. We reward curiosity. And we’ve found that when you read a card you don’t understand, you  want to understand it,” said Mark Rosewater,  Magic’s head designer.\n  Rosewater made waves last year when he penned a   lengthy post on Wizards’ website, outlining why the notion of an annual set for “beginners” was fundamentally flawed. Shouldn’t new players feel comfortable jumping in at any moment, not just once a year? Plus, if core sets are truly beginner focused, this set would hold no value to experienced card-slingers, and that’s a large chunk of the audience.\n So the decision was made to terminate core sets, but this posed another problem.  Magic has operated within the same release cycle for its entire existence: one core set followed by three separate but related releases. These three sets, known in the industry as a “block,” take place in the same location and tell a trilogy-worthy story. Then it’s back to another, largely story-less core set. From now on, Rosewater wrote, each year would contain two duologies.\n  “It was always nice to think of core sets as a sort of sorbet, dividing the meal,” Rosewater said. “So for many years, we dumbed them down, but what we learned is correct is the exact opposite. People aren’t afraid of not understanding everything.”\n   Over time, core sets became more complex, including rare reprints of classic cards and new cards that pushed the magical envelope, like the aforementioned Demonic Pact. “Little by little, core sets started to feel like regular expansions,” Rosewater said. “Our goal is not to be super weighty with complexity. Some sets will be less complex than others, breathers for people. We don’t need to go to a core set to have that breather.”\n And as for  Origins, Rosewater wanted to give core sets a viking funeral. “It’s not a core set! There are a bunch of different gaming mechanics in it, and we visit 10 different places,” he says. “ Origins is very focused on story. We are all-in on story, so we decided, let’s learn who the characters are.”\n  Origins does this by printing cards that tell stories unto themselves. Five of its 10 “mythic rare” slots—cards that are rarer than rare—are devoted to characters from  Magic’s multiverse that we’ll see more of later on, like Nissa, the champion of the forest, and the reluctant healer-turned-necromancer Liliana Vess. In  Origins, we meet them as kids. They start as lowly creatures under your control and, when the proper trigger is activated, you flip the card over to reveal their transformation into a planeswalker, the equivalent of  Magic royalty. Liliana’s card, for example, flips when another one of your creatures dies, as Liliana herself turned to the dark arts when she accidentally killed her own brother. Yes, the design space for  Origins includes printing an entire  Magic card on the back of another  Magic card.\n   Origins feels less like the end of the “core-set era” and more like the start of an experiment with novel approaches to the ways  Magic cards interact, something Rosewater would look back on with pride. There are those two-sided cards, of course, and while it’s not the first time this idea has been implemented, it is the first time two types of cards—creatures and planeswalkers—have been combined into one. Meanwhile, some cards, like Abbot Of Keral Keep, are creatures that interact with other spells in your deck, as well as other “zones” in the game. In something like Texas Hold ’Em, for example, there’s your hand, the cards seen by everyone, and the deck seen by none. All three are zones.  Magic contains a whole lot more—cards in exile, face-down cards waiting to be “morphed,” etc.—and Abbot interacts with several at once. The big addition, though, are the many creatures equipped with the new “Renown” ability, which makes them stronger if they do damage to your opponent. Between that and the metamorphoses of characters like Liliana,  Origins as a set mirrors  Origins as a moment in  Magic history. It’s about growth.\n But even these fourth wall-shattering additions are no match for the rabid obsession and curiosity of new players that Rosewater alluded to. I work at a game design studio for kids, which means I’m surrounded by more  Magic players than most people encounter in their lifetime, all of whom have played the game for less than a few years.   It’s hugely popular among children who are both savvy enough to weasel 4 bucks out of their parents for a booster pack and smart enough to know it’s a ton of fun to pit your brain against someone else’s.\n  When a cracked  Origins pack yields a Nissa, for example, every young player stops what they’re doing and materializes a few feet away. Mythic rares are cause for jealousy but mostly celebration. This double-sided enigma brings everyone together, even if they’re not entirely sure what they’re seeing. That mentality arises when I inadvertently pit two kids against one another. Demonic Pact is a mythic rare as well, and the question I posed to these boys was a simple one: If you got this card in a booster pack, would you put it in your deck?\n As the fight raged on, I imagined Rosewater looking on with a big smile on his face. He is a prolific writer on the Wizards Of The Coast website and at his Q&amp;A Tumblr page,   Blogatog, where he interacts with fans whenever possible. He answers their design questions, drops hints about future sets, and is not shy about discussing his failures as a designer.\n   “Long ago, I went to my bosses and said I wanted to be more transparent,” he said. “My thinking was—we are very good at making games. If we educate audiences on what makes a good game, they will learn to respect what goes into making a good game and will want to buy them. This rising tide will be good for us.”\n  MaRo—Rosewater’s nickname in the  Magic community—would probably happily field any questions these kids have about Demonic Pact if they asked, and in a few weeks, they’d have all the answers they’re wanted. But there’s no time for that. Their curiosity has been ignited.\n  Both boys remain at each other’s throats until one has an idea: What if your deck included some way to destroy Demonic Pact before the fourth option—the one where you lose the game—had to be chosen? The other boy thinks, and agrees, listing off cards from  Magic’s 22-year history that fit the bill. A girl adds that other cards could send Demonic Pact back to your hand, thus resetting the clock when you decided to play it again. Soon, everyone is talking deep strategy, and the discussion continues for a few hours until one of the initial onlookers has the guts to ask if I would trade it to her. She has a crazy idea for a deck.", "posttime": "2021-08-08 02:19:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "聚会,magic,游戏", "title": "22 年来，万智牌：聚会是有史以来最聪明的（2015 年）", "title_en": "22 years in, Magic: The Gathering is the brainiest it’s ever been (2015)", "transed": 1, "url": "http://www.avclub.com/article/22-years-magic-gathering-brainiest-its-ever-been-224197", "via": "", "real_tags": ["聚会", "magic", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "9fd6286abe7526a3b5300e46203f7c88.jpg", "infoid": 1071995, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第二季度的收益周期正在推进，这意味着您谦逊的 Exchange 工作人员一直在与许多上市公司 CEO 通电话，为您带来重要的趋势和注意事项。为此，今天我们将检查 Appian、Paycom 和 BigCommerce。之后，我们将看看新鲜材料，这些材料将支持我们最近深入 BNPL 世界和初创公司竞争。所以，今天有一个抓包，希望能装满好东西！让我们从阿皮安开始。当许多公司正在努力使用其低代码技术构建应用程序时，我开始了解该公司处于大流行中。当时 Appian 的价值约为今天的一半。 （您可以在此处阅读该公司的第二季度报告。）从那时起，该公司继续推动云计算，放缓服务收入的流失，转而支持高利润的 SaaS 收入。它不是唯一一家执行相关转型的公司。但就我们今天的目的而言，我想谈谈我们在 2020 年的大部分时间里都在研究的基本低代码工作之后会发生什么。 Appian 宣布将在其第二季度收益的同时收购流程采矿公司 Lana Labs。什么是流程挖掘？谢谢你的提问。流程挖掘是一种软件技术，用于在公司内部查找可以自动化的流程。为您的公司购买 RPA 服务固然很好，但如果您不知道可以自动化什么，您可能最终无法获得全部价值。对于 Appian 而言，所有这些都很重要，因为该公司现在拥​​有流程挖掘、RPA 和低代码工具，可帮助公司在一个屋檐下创建应用程序。在实践中，这些部件与流程挖掘一起工作，识别要自动化的事物，然后由 RPA 和其他形式的自动化（人工智能、人类）采用的工作流程使公司能够更好地以高效的顺序进行运营。我向 Appian 首席执行官 Matt Calkins 询问了工作流和应用程序之间的区别。他说他们几乎是一回事。这使得低代码世界变得更加令人信服。企业真正需要多少应用程序，我一直想知道。关于公司可能需要自动化多少工作流的相同问题感觉不同。感觉还有很多很多的可能性。所以，一个更大的 TAM。\n更新我对低代码的想法，如果软件方法比简单地构建更多应用程序更能帮助公司数字化其运营和自动化死记硬背的任务，那么这种动态使我更加看好软件方法。转到 BigCommerce，这个开放式 SaaS 电子商务平台已经有几个季度表现不错，尽管 Shopify 的全球知名度不断提高，但收入增长普遍加速。这也是上市一周年，所以我花了几分钟和 CEO Brent Bellm 聊了聊他在那一年学到的东西，以及上市是否值得。 （你可以在这里阅读该公司的第二季度报告。）他说是的。他提出了两个让我想分享的公司上市的案例。它们加起来使 BigCommerce 实现了更快的增长，尽管贝尔姆警告说，不可能将源自以下因素的增长与对公司近期业绩做出贡献的其他因素分开。公信力：成为一家财务公开的上市公司可以培养市场信心。初创公司有一个尴尬的习惯，即经常死亡。上市公司远没有如此。这意味着客户更有可能信任一家公司，这可能会增加其获得交易的机会。更重要的是，现在合作伙伴对 BigCommerce 更有信心，根据 Bellm 的说法，它是公开的，有助于推动更多的合作伙伴关系和增长。增加关注：我以为我理解上市的这个要素，但贝尔姆扩大了我的视野。当然，上市是一个品牌活动。但这就是我认为这个特殊边缘结束的地方。相反，首席执行官解释说，例如，现在当他的公司做一件事情时，分析师社区必须注意。因此，与初创公司相比，BigCommerce 作为一家上市公司更容易留在公众视线中。从某种意义上说，这增加了环境市场噪音。贝尔姆告诉 The Exchange，上市对他的公司来说“非常积极”。独角兽，请注意。然后是Paycom。这个聊天主要是关于两个方面的人才。首先，Paycom 与其他所有公司都面临着同样竞争激烈的技术人才市场。但值得注意的是，尽管远离传统的技术中心，但它所需要的人才供应紧张。值得注意的是，Paycom 总部位于俄克拉荷马州。 （您可以在此处阅读该公司的第二季度报告。）\n但当今的人才市场及其普遍紧张正在以另一种方式影响 Paycom：这家人力资源技术公司销售的软件可帮助公司确保和留住人才。根据公司首席执行官查德·里奇森的说法，这些企业正在受益于公司在完成所有吸引人才的工作后更加注重不让人才流失。事实证明，劳动力市场也变得与风险投资市场非常相似。里奇森说，今天你必须在几天内面试完某人后做出是否雇用某人的选择。在你有更多时间之前。就像今天的风投被迫在几天而不是几周和几个月内削减支票一样。 Splitit 的首席执行官布拉德·帕特森 (Brad Paterson) 表示，初创公司 BNPL 市场仍然充满希望。 Splitit 允许客户使用他们当前的信用卡进行分期付款。所以它是传统信贷和BNPL的混合体。 （SplitIt 的 Crunchbase 页面在这里。）Paterson 自愿对 BNPL 初创公司的当前市场发表评论，在聊了很多关于 Square-Afterpay 的交易之后，我想了解他为什么小公司能够在庞然大物中生存进入他们的市场。在一封电子邮件中，帕特森认为有很多因素，他称之为“平均购买价格、分期付款计划的长度、行业垂直服务等”。将保护空间中的边距。由于 BNPL 解决方案可以“超越小额购买”，该领域的初创公司将有空间。或许更好的问题是消费者信用和结账还有多少工作要做。这听起来更像是一个无限的问题空间，而不仅仅是 BNPL 工具本身。回到我们之前关于创业竞争的工作，Hustle Fund 的 Elizabeth Yin 发送了一份我想分享的笔记清单。当我们讨论成为初创公司市场领先者的重要性时，我们主要讨论的是市场空间，即年轻公司试图将不同各方联系起来的领域。\n在叫车服务中，这就是司机和乘客。食品配送更加复杂，有配送司机、消费者和食品生产企业。你明白了。 Per Yin，满足于较低级别的市场份额“通常真的很难”。她继续说道：市场的价值通常会随着供需双方的增加而增加。例如，Airbnb 上的更多房源 + 客户。更多优步司机和乘客。等等。事实上，在很多情况下，这是唯一的价值。因此，如果您是市场上的第 3 位或第 4 位，那么保留率是一个很大的潜在问题，因为您必须问自己什么才能使您的供需方不会叛逃到第 1 位或第 1 位. 2 播放器具有更大的网络？这就是为什么您倾向于看到市场合并的原因。对于早期的支持者来说，通过收购第一或第二市场，他们最终可能会做得很好，但最终可能与支持第一或第二市场的结果相差一两个数量级。出于这个原因，如果已经有几个市场具有良好的开端，早期投资者往往会回避支持新参与者。尹还回答了我们的问题创业市场竞争通常会产生具有少数领先参与者的市场，并且由于市场份额低而导致较小的进入者被淘汰，因此缺乏其他竞争对手。她补充了一个关于资本影响的有趣观点：总的来说，是的，但投资者也在这种现象中发挥作用。一旦几家公司开始运作，投资者往往会向这些最初的领导者投入更多资金，而其他人则倾向于回避支持竞争对手。一旦资金涌入一个空间，真正成为问题的就是客户获取成本——CAC 会被顶级公司推高。 （随着食品配送公司的兴起，我们看到了这一点）。这就是为什么你不能真的很容易地引导一家市场公司——你买不起客户。从某种意义上说，这是对创业世界中的王者统治问题的回答。在许多情况下，风投并不会决定谁会获胜，但资本的影响确实会影响市场世界的结果。现在，在我们开始认可第一支愿景基金如何分配资金之前，让我们停下来！ 😂", "note_en": "The Q2 earnings cycle is powering along, which means that your humble Exchange crew have been on the phone with a number of public-company CEOs working to bring you the trends and notes that matter. To that end, today we’re going to check in on Appian, Paycom and BigCommerce.\n After that we’ll peek at fresh material that will bolster our recent dives  into the BNPL world and  startup competition. So, a grab bag today, and hopefully one full of goodies!\n Let’s start with  Appian. I got to know the company midpandemic when a  host of companies were hammering away, building apps using its low-code tech. At the time Appian was worth about half of what it is today. (You can read the company’s Q2 report  here.)\n Since then the company has continued its cloud push, slowing shedding services revenues in favor of high-margin SaaS incomes. It’s not the only company executing a related transformation. But for our purposes today I want to talk about what comes after the basic low-code work that we spent much of 2020 digging into.\n Appian announced that it is buying process mining firm  Lana Labs in conjunction with its second-quarter earnings. What’s process mining? Thanks for asking. Process mining is a software technique for finding processes inside of companies that  can be automated. It’s all well and good to buy an RPA service for your company, but if you don’t know what you can automate, you might not wind up getting full value.\n All this matters in the case of Appian as the company now has process mining, RPA and low-code tooling to help companies create applications under a single roof. In practice the parts work together with process mining identifying things to automate, a workflow that is then taken up by RPA and other forms of automation — AI, human — to allow companies to better get their operations in efficient order.\n I asked Appian CEO  Matt Calkins about the difference between workflows and apps. He said that they are pretty much the same thing. This makes the low-code world a bit more grokable. How many apps could corporations really need, I’ve always wondered. The same question regarding how many workflows that companies may need to automate feels different. It feels like there’s many, many more possibilities. So, a bigger TAM.\n Updating my thinking about low-code, this dynamic makes me more bullish on the software method if it’s more in service of helping companies digitize their operations and automate rote tasks than simply building more apps.\n Turning the page to  BigCommerce, the open-SaaS e-commerce platform has had a good few quarters, posting generally accelerating revenue growth despite Shopify’s rising global profile. It also just marked its first anniversary  since going public, so I spent a few minutes with CEO  Brent Bellm to chat about what he’s learned in that year, and if going public was worth it. (You can read the company’s Q2 report  here.)\n It was, he said. He made two cases for taking companies public that I wanted to share. They add up to faster growth at BigCommerce, though Bellm cautioned that it was impossible to disaggregate growth stemming from the following factors from other elements that contributed to his company’s recent performance.\n  Credibility: Being a public company with open finances can breed in-market confidence. Startups have an awkward habit of dying somewhat often. Public companies far less so. This means that customers are more likely to trust a company, perhaps boosting its chances of securing deals. Even more, partners are more confident in BigCommerce now that it is public, per Bellm, helping drive more partnerships and growth.\n Increased attention: I thought that I understood this element of going public, but Bellm expanded my perspective. Of  course going public is a branding event. But that’s where I thought this particular edge wrapped up. Instead, the CEO explained that now when his company does  a thing the analyst community has to pay attention, for example. So it’s easier for BigCommerce to stay in the public eye as a public company than when it was a startup. Call it boosted ambient market noise, in a good sense.\n Bellm told The Exchange that going public was “overwhelmingly positive” for his company. Unicorns, take note.\n Then there was  Paycom. This chat was mostly about talent in two ways. First, Paycom is dealing with the same competitive tech talent market as every other company. But notably it’s seeing a tight supply of the talent it needs despite being far from traditional technology hubs. Paycom is based in Oklahoma, notably. (You can read the company’s Q2 report  here.)\n But the talent market and its general tightness today is impacting Paycom in another way: The HR-tech company sells software that helps companies secure and retain talent. Those businesses, per the company’s CEO Chad Richison, are benefiting from companies’ putting more focus on not letting talent go after they went through all the work of getting them aboard.\n Also the labor market has become very similar to the venture capital market, it turns out. Richison said that today you have to make a choice on whether to hire someone after you interview them within a few days. Before you had more time. Just like VCs today are forced to cut checks in days instead of weeks and months.\n   Hope remains for the startup BNPL market, per  Brad Paterson, the CEO of  Splitit. Splitit allows customers to use their current credit cards to make installment payments. So it’s a mix of traditional credit and BNPL. (SplitIt’s Crunchbase page is  here.)\n Paterson volunteered to provide comment on the current market for BNPL startups, and after  chatting much about the Square-Afterpay deal, I wanted to get his take on why smaller companies are going to be able to survive behemoths charging into their market.\n In an email, Paterson argued that a wealth of factors, what he described as “average purchase price, length of installment plan, industry vertical serviced, etc.” will protect margins in the space. And that as BNPL solutions can “extend beyond smaller purchases,” there will be room for startups in the space.\n Perhaps the better question is how much more work there is to do with consumer credit and checkout. That sounds much more like an infinite problem space than just BNPL tooling itself.\n  Returning to our  earlier work regarding startup competition,  Elizabeth Yin of  Hustle Fund sent in a list of notes that I want to share. When we were discussing the importance of being a leading player in markets for startups, we were mostly discussing the marketplace space, areas where young companies are trying to connect different parties.\n In ride-hailing, that’s drivers and riders. Food delivery is even more complex, with delivery drivers, consumers and food-generative business establishments. You get the idea. Per Yin, being content with lower-tier market share is “generally really tough.” She continued:\n The value of a marketplace usually increases as both the supply and demand sides increase. E.g., more listings + customers on Airbnb. More drivers and riders on Uber. Etc. In fact, in many cases, that is the  sole value.\n So, if you’re No. 3 or No. 4 in the market, retention is a big potential concern, because you have to ask yourself what will enable you to keep your supply and demand sides from defecting to the No. 1 or No. 2 player that has a larger network? This is why you tend to see consolidation of marketplaces.\n For early backers, they may still end up doing fine via an acquisition to No. 1 or No. 2, but it may end up being a magnitude or two off from the outcome of backing the No. 1 or No. 2 marketplace. For this reason, if there are already a couple of marketplaces that have a strong head start, early-stage investors tend to shy away from backing a new player.\n Yin also answered our question ​​startup marketplace competition generally yielding markets with a small number of leading players, and a dearth of other competitors as smaller entrants are chased out due to low market share. She added an interesting perspective regarding the impact of capital:\n In general, yes, but investors also play a role in this phenomenon. Once a couple of companies get going, investors tend to pour more into those initial leaders AND others tend to shy away from backing competitors. And once money floods a space, it’s really customer acquisition costs that become an issue — CAC gets driven up by the top companies. (We saw this with the rise in food delivery companies). This is why you can’t really bootstrap a marketplace company very easily — you can’t afford to acquire customers.\n This is, in a sense, an answer to the question about kingmaking in the startup world. VCs are not deciding who wins in many cases, but the impact of capital really can skew results in the marketplace world. Now, let’s stop before we start endorsing how the first Vision Fund disbursed capital! 😂", "posttime": "2021-08-08 01:32:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,code", "title": "低代码之后是什么？而且，你为什么要公开？", "title_en": "\n\t\t\t\tWhat’s after low-code? And, why should you go public?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/07/whats-after-low-code-and-why-should-you-go-public/", "via": "", "real_tags": ["代码", "code"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在团队评估今天的活动时，漫游车继续探索杰泽罗陨石坑。美国宇航局毅力号火星车首次尝试在火星上收集岩石样本并将其密封在样本管中后发送到地球的数据表明，在最初的采样活动中没有收集到岩石。火星车携带 43 个钛样品管，正在探索杰泽罗陨石坑，在那里它将收集岩石和风化层（破碎的岩石和灰尘）的样本，以便将来在地球上进行分析。 “虽然这不是我们所希望的‘一杆进洞’，但开辟新天地总是存在风险，”华盛顿美国宇航局科学任务理事会副局长 Thomas Zurbuchen 说。 “我相信我们有合适的团队来解决这个问题，我们将坚持不懈地寻求解决方案，以确保未来的成功。” Perseverance 的采样和缓存系统在其 7 英尺长（2 米长）的机械臂末端使用一个空心取芯钻头和一个冲击钻来提取样本。来自漫游车的遥测数据表明，在其第一次取芯尝试中，钻头和钻头按计划啮合，取芯后，样品管按预期处理。 “采样过程从头到尾都是自主的，”美国宇航局南加州喷气推进实验室坚持不懈的表面任务经理杰西卡塞缪尔斯说。 “将探针放入收集管后发生的步骤之一是测量样品的体积。如果样品在管内，探针没有遇到预期的阻力。” Perseverance 任务正在组建一个响应小组来分析数据。早期的一个步骤是使用位于机械臂末端的 WATSON（用于操作和工程的广角地形传感器）成像器来拍摄钻孔的特写照片。一旦团队对发生的事情有了更好的了解，就能够确定何时安排下一次样本收集尝试。\n“最初的想法是，空管更有可能是因为岩石目标在取芯过程中没有按照我们预期的方式做出反应，不太可能是采样和缓存系统的硬件问题，”Perseverance 项目经理 Jennifer Trosper 说。喷气推进实验室。 “在接下来的几天里，团队将花更多时间分析我们拥有的数据，并获取一些额外的诊断数据，以支持了解空管的根本原因。” NASA 之前在火星上的任务在样本收集和其他活动中也遇到了令人惊讶的岩石和风化层特性。 2008年，凤凰号任务对“粘性”且难以移动到机载科学仪器的土壤进行了采样，导致多次尝试才取得成功。好奇心钻进了比预期更硬、更脆的岩石中。最近，洞察号着陆器上的热探测器，被称为“鼹鼠”，未能按计划穿透火星表面。 “从一开始，我就一直在执行每一次火星探测器任务，这个星球总是教会我们我们不知道的事情，”特罗斯珀说。 “我发现的一件事是，在复杂的第一次活动中出现并发症并不罕见。” Perseverance 目前正在探索两个地质单元，其中包含 Jezero Crater 最深和最古老的裸露基岩层和其他有趣的地质特征。第一个单元，称为“火山口地面断裂粗糙”，是 Jezero 的地面。相邻的单元名为“Séítah”（在纳瓦霍语中意为“在沙子中”），也有火星基岩，也是山脊、层状岩石和沙丘的所在地。最近，毅力科学团队开始使用来自 Ingenuity Mars Helicopter 的彩色图像来帮助侦察具有潜在科学兴趣的区域并寻找潜在的危险。 Ingenuity 于 8 月 4 日星期三完成了第 11 次飞行，在其当前位置向下飞行约 1,250 英尺（380 米）处，以便为塞塔南部地区的项目提供空中侦察。当毅力号返回着陆点时，火星车的最初科学探索将完成，跨越数百个太阳（或火星天）。到那时，毅力将行驶 1.6 到 3.1 英里（2.5 到 5 公里），并且可能已经装满了多达八个样品管。接下来，毅力号将向北，然后向西，前往第二次科学活动的地点：杰泽罗火山口的三角洲地区。三角洲是杰泽罗火山口内古老河流和湖泊汇合的扇形遗迹。该地区可能特别富含碳酸盐矿物。在地球上，这些矿物可以保存古代微观生命的化石迹象，并与生物过程有关。\nPerseverance 在火星上的任务的一个关键目标是天体生物学，包括寻找古代微生物生命的迹象。火星车将描绘这颗行星的地质和过去的气候特征，为人类探索这颗红色星球铺平道路，并成为收集和保存火星岩石和风化层的第一个任务。随后的 NASA 任务与 ESA（欧洲航天局）合作，将向火星发送航天器，从地表收集这些密封样本并将其送回地球进行深入分析。 Mars 2020 Perseverance 任务是美国宇航局月球到火星探索方法的一部分，其中包括阿尔忒弥斯登月任务，这将有助于为人类探索这颗红色星球做准备。 JPL 由加利福尼亚州帕萨迪纳市的加州理工学院为 NASA 管理，负责建造和管理 Perseverance 漫游车的运营。", "note_en": "The rover continues to explore Jezero Crater while the team assesses today’s activities.\n  Data sent to Earth by NASA’s Perseverance rover after its first attempt to collect a rock sample on Mars and seal it in a sample tube indicate that no rock was collected during the initial sampling activity.\n The rover carries 43 titanium  sample tubes and is exploring Jezero Crater, where it will be gathering samples of rock and regolith (broken rock and dust) for future analysis on Earth.\n “While this is not the ‘hole-in-one’ we hoped for, there is always risk with breaking new ground,” said Thomas Zurbuchen, associate administrator of NASA’s Science Mission Directorate in Washington. “I’m confident we have the right team working this, and we will persevere toward a solution to ensure future success.”\n Perseverance’s Sampling and Caching System uses a hollow coring bit and a percussive drill at the end of its 7-foot-long (2-meter-long)  robotic arm to extract samples. Telemetry from the rover indicates that during its first coring attempt, the drill and bit were engaged as planned, and post-coring, the sample tube was processed as intended.\n “The sampling process is autonomous from beginning to end,” said Jessica Samuels, the surface mission manager for Perseverance at NASA’s Jet Propulsion Laboratory in Southern California. “One of the steps that occurs after placing a probe into the collection tube is to measure the volume of the sample. The probe did not encounter the expected resistance that would be there if a sample were inside the tube.”\n The Perseverance mission is assembling a response team to analyze the data. One early step will be to use the WATSON (Wide Angle Topographic Sensor for Operations and eNgineering) imager – located at the end of the robotic arm – to take close-up pictures of the borehole. Once the team has a better understanding of what happened, it will be able to ascertain when to schedule the next sample collection attempt.\n “The initial thinking is that the empty tube is more likely a result of the rock target not reacting the way we expected during coring, and less likely a hardware issue with the Sampling and Caching System,” said Jennifer Trosper, project manager for Perseverance at JPL. “Over the next few days, the team will be spending more time analyzing the data we have, and also acquiring some additional diagnostic data to support understanding the root cause for the empty tube.”\n Previous NASA missions on Mars have also encountered surprising rock and regolith properties during sample collection and other activities. In 2008, the Phoenix mission sampled soil that was “sticky” and difficult to move into onboard science instruments, resulting in multiple tries before achieving success. Curiosity has drilled into rocks that turned out to be harder and more brittle than expected. Most recently, the heat probe on the InSight lander, known as the “mole,” was unable to penetrate the Martian surface as planned.\n “I have been on every Mars rover mission since the beginning, and this planet is always teaching us what we don’t know about it,” said Trosper. “One thing I’ve found is, it’s not unusual to have complications during complex, first-time activities.”\n  Perseverance is currently exploring two geologic units containing Jezero Crater’s deepest and most ancient layers of exposed bedrock and other intriguing geologic features. The first unit, called the “Crater Floor Fractured Rough,” is the floor of Jezero. The adjacent unit, named “Séítah” (meaning “amidst the sand” in the Navajo language), has Mars bedrock as well, and is also home to ridges, layered rocks, and sand dunes.\n Recently, the Perseverance science team began  using color images from the Ingenuity Mars Helicopter to help scout for areas of potential scientific interest and to look for potential hazards. Ingenuity completed its 11th flight Wednesday, Aug. 4, traveling about 1,250 feet (380 meters) downrange of its current location so that it could provide the project aerial reconnaissance of the southern Séítah area.\n The rover’s initial science foray, which spans hundreds of sols (or Martian days), will be complete when Perseverance returns to its landing site. At that point, Perseverance will have traveled between 1.6 and 3.1 miles (2.5 and 5 kilometers) and may have filled up to eight of its sample tubes.\n Next, Perseverance will travel north, then west, toward the location of its second science campaign: Jezero Crater’s delta region. The delta is the fan-shaped remains of the confluence of an ancient river and a lake within Jezero Crater. The region may be especially rich in carbonate minerals. On Earth, such minerals can preserve fossilized signs of ancient microscopic life and are associated with biological processes.\n  A key objective for Perseverance’s mission on Mars is  astrobiology, including the search for signs of ancient microbial life. The rover will characterize the planet’s geology and past climate, pave the way for human exploration of the Red Planet, and be the first mission to collect and cache Martian rock and regolith.\n Subsequent NASA missions, in cooperation with ESA (European Space Agency), would send spacecraft to Mars to collect these sealed samples from the surface and return them to Earth for in-depth analysis.\n The Mars 2020 Perseverance mission is part of NASA’s Moon to Mars exploration approach, which includes  Artemis missions to the Moon that will help prepare for human exploration of the Red Planet.\n JPL, which is managed for NASA by Caltech in Pasadena, California, built and manages operations of the Perseverance rover.", "posttime": "2021-08-08 01:17:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国宇航局,nasa,火星,美国,mars", "title": "美国宇航局的火星探测器未能收集到第一个样本", "title_en": "NASA's Mars Rover Fails to Collect Its First Sample", "transed": 1, "url": "https://www.jpl.nasa.gov/news/nasas-perseverance-team-assessing-first-mars-sampling-attempt", "via": "", "real_tags": ["美国宇航局", "nasa", "火星", "美国", "mars"]}]