[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1035204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据悉，鲍里斯·约翰逊(Boris Johnson)计划在十年内禁止销售新的汽油和柴油车，有报道称，这一禁令将提前五年实施。\n在此之前，英国首相在2月份将截止日期从2040年改为2035年。\n根据英国《金融时报》的一篇报道，约翰逊预计将于下周在一系列新的环境政策中宣布这一措施。该报道将这一消息归因于行业和白厅消息来源。\n英国政府希望这项政策将激发英国电动汽车市场的活力，并帮助该国实现其气候目标，包括到2050年将温室气体排放降至净零。\n科学家、学者和活动家敦促政府和企业更加雄心勃勃，呼吁他们努力将气候恢复到尽可能安全的水平。\n周五，环保活动人士签署了一封信，声明：“气候危机现在已经到来。无论我们多快地实现零排放，气候危机的可怕影响都不会消失。…。因此，无论完成得有多快，单靠减排是不够的。\n汽车制造商和贸易商协会的数据显示，尽管电动汽车越来越受欢迎，需求比去年翻了一番多，但电动汽车仍仅占英国上月购买的新车的7%左右。\n该组织此前曾呼吁政府承诺为购买电动汽车提供重大的长期激励措施，并为充电基础设施设定固定目标，理由是更高的价格和对充电的担忧正在压低销量。\n根据该报的报道，预计从明年开始，政府将为充电基础设施提供约5亿GB的资金。\n据报道，约翰逊一直在制定一项10点计划，以启动低碳经济，并使英国走上到2050年实现净零排放的目标。国际社会施加压力，要求约翰逊作为下一届联合国气候危机峰会Cop26的东道主制定一份详细的计划，该峰会被推迟到明年11月。\n与此同时，在乔·拜登(Joe Biden)赢得美国大选后，工党一直在向英国政府施压，要求其通过提出一项数十亿英镑的“绿色复苏”计划，加大英国应对气候紧急情况的努力。\n此前还有批评称，尽管卡梅伦承诺将把环境放在后科维德时代战略的核心位置，但英国没有为应对气候危机的努力提供足够的资金。\nIPPR智库的研究发现，政府只投入了应对气候紧急情况和日益严重的自然威胁所需资金的12%。", "note_en": "Boris Johnson is understood to be planning to ban the sale of new petrol and diesel cars within a decade, with reports that the ban will be brought forward by five years.\n It follows the prime minister moving the cut-off date from 2040 to 2035 in February.\n Johnson is expected to announce the measure amid a raft of new environmental policies next week, according to a report in the Financial Times, which attributes the news to industry and Whitehall sources.\n The government hopes the policy will energise the market for electric cars in the UK and help the country achieve its climate targets, including reducing emissions of greenhouse gases to net zero by 2050.\n Scientists, academics and campaigners have urged governments and businesses to be more ambitious, calling on them to work to “restore the climate” to as safe a level as possible.\n Environmental activists signed a letter on Friday,  stating: “The climate crisis is here now. No matter how quickly we reach zero emissions, the terrible impacts of the climate crisis will not just go away … As such, no matter how quickly it is done, solely cutting emissions is not enough.”\n Despite rising popularity, with  demand more than doubling over the last year, electric cars still only make up around 7% of new vehicles bought in the UK last month, figures from the Society of Motor Manufacturers and Traders show.\n The organisation has previously called for the government to commit to significant long-term incentives for electric vehicle purchase and to set fixed targets on charging infrastructure, arguing that higher prices and concerns about charging are keeping sales down.\n The government is expected to provide around £500m funding for charging infrastructure from next year, according to the newspaper’s report.\n Johnson has been reportedly putting together a 10-point plan to jump-start the low-carbon economy and set the country on track to meet the target of net zero emissions by 2050, amid international pressure to produce a detailed plan as host of the  next UN summit on the climate crisis, Cop26, which was postponed to next November.\n Meanwhile, following Joe Biden’s electoral victory in the US, the Labour party has been  pressing the government to intensify Britain’s efforts to tackle the climate emergency by bringing forward a multibillion pound “green recovery” plan.\n The news also follows criticism that the UK is  not adequately funding its efforts to fight the climate crisis, despite the prime minister’s promises to put environment at centre of post-Covid strategy.\n Research by the IPPR thinktank found the government is investing only 12% of the funds needed to tackle the climate emergency and the growing threat to nature.", "posttime": "2020-11-15 07:55:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "柴油,expected,英国", "title": "英国预计从2030年起禁止销售新的汽油和柴油汽车", "title_en": "UK expected to ban sale of new petrol and diesel cars from 2030", "transed": 1, "url": "https://www.theguardian.com/environment/2020/nov/14/uk-expected-to-ban-sale-of-new-petrol-and-diesel-cars-from-2030", "via": "", "real_tags": ["柴油", "expected", "英国"]}, {"category": "", "categoryclass": "", "imagename": "b55e14861cdbf17143082cd123f3cee7.jpg", "infoid": 1035203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你为另一个新账户创建密码时，你可能会遇到一些熟悉的规则，这些规则旨在让黑客更难进入：使用大写字母、数字和特殊字符。然而，卡内基梅隆大学的研究人员表示，这些要求并不会让你的密码变得更强。\n洛里·克兰诺(Lorrie Cranor)是芝加哥大学网络实验室可用安全与隐私实验室(CyLab Usable Security And Privacy Laboratory)的主任，她说她的团队有一个更好的方法，网站可以用它来提示你创建更安全的密码。在用户创建了至少10个字符的密码后，计价器会开始给出建议，比如用斜杠或随机字母打破常用单词，使你的密码更强。\n这些建议将密码强度计量器与其他提供估计密码强度的计量器区分开来，这些计量器通常使用颜色。这些建议来自克雷诺团队看到的人们在实验室进行的实验中设置密码时所犯的常见错误。\n实验室发现，许多密码的问题之一是，它们通过了所有的安全检查，但仍然很容易被猜到，因为我们大多数人遵循相同的模式。数字?。您可能会在末尾添加一个1&34；。大写字母？您可能会使它成为密码中的第一个密码。那特殊人物呢？经常有感叹号。\nCMU的密码仪将为加强ILoveYou2！&34；这样的符合标准要求的密码提供建议。该计时器还会根据你输入的内容提供其他建议，比如提醒你不要使用名字，或者建议你在密码中间加上特殊字符。\n在一项实验中，用户在系统上创建密码，只需输入10个字符。然后，系统使用实验室的密码强度计对密码进行评级，并为更强的密码提供量身定制的建议。测试对象能够想出安全的密码，他们最多可以在五天后回忆起这些密码。它比向用户显示预设的规则列表或简单地禁止已知的坏密码(我正在看着你的星球大战)效果更好。\n克雷诺和他的合著者约书亚·谭(Joshua Tan)、卢乔·鲍尔(Lujo Bauer)和尼古拉斯·克里斯汀(Nicolas Christin。该团队希望其工具能在未来被网站制作者采用。\n同时，克兰诺说，创建和记住安全密码的最好方法是使用密码管理器。这些措施并未被广泛采用，而且也有一些取舍。尽管如此，它们允许您为每个帐户创建一个随机的、唯一的密码，并且它们会为您记住您的密码。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "When you create a password for yet another new account, you&#39;ll probably encounter familiar rules designed to make it harder for hackers to get in: Use capital letters, numbers and special characters. These requirements, however, don&#39;t  make your password stronger,  researchers at Carnegie Mellon University say.\n Lorrie Cranor, director of the CyLab Usable Security and Privacy Laboratory at CMU, says her team has a better way, a meter that websites can use to prompt you to create more-secure passwords. After a user has created a password of at least 10 characters, the meter will start giving suggestions, such as breaking up common words with slashes or random letters, to make your password stronger.\n   The suggestions set the password strength meter apart from other meters that provide an estimated password strength, often using colors. The suggestions come from common pitfalls Cranor&#39;s team has seen people make when they set up passwords during experiments run by the lab.\n One of the problems with many passwords is that they tick all the  security checks but are still easy to guess because most of us follow the same patterns, the lab found. Numbers? You&#39;ll likely add a &#34;1&#34; at the end. Capital letters? You&#39;ll probably make it the first one in the password. And special characters? Frequently exclamation marks.\n CMU&#39;s password meter will offer advice for strengthening a password like &#34;ILoveYou2!&#34; -- which meets the standard requirements. The meter also offers other advice based on what you type in, such as reminding you not to use a name or suggesting you put special characters in the middle of your password.\n   In an experiment, users created passwords on a system that simply required them to enter 10 characters. Then the system rated the passwords with the lab&#39;s password strength meter and gave tailored suggestions for stronger passwords. Test subjects were able to come up with  secure passwords that they could recall up to five days later. It worked better than showing users preset lists of rules or simply banning known bad passwords (I&#39;m looking at you &#34;StarWars&#34;).\n Cranor and co-authors Joshua Tan,  Lujo Bauer and  Nicolas Christin will present their latest password findings on Thursday at the  ACM Conference on Computer and Communications Security, which is being held virtually. The team hopes its tools will be adopted by website makers in the future.\n In the meantime, Cranor says the best way to create and remember secure passwords is to  use a password manager. Those aren&#39;t widely adopted, and they come with some trade-offs. Nonetheless, they allow you to create a random, unique password for each account, and they remember your passwords for you.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-11-15 07:38:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "密码,创建,secure", "title": "有没有更好的方法来创建安全密码？", "title_en": "Is There a Better Way to Create Secure Passwords?", "transed": 1, "url": "https://www.cnet.com/news/rules-for-strong-passwords-dont-work-researchers-find-heres-what-does/", "via": "", "real_tags": ["密码", "创建", "secure"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035201, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "请将新条目或更正后的条目发送到&lt；gnunet-Developers@gnu.org&gt；。如果可以，请将它们格式化为BibTeX；有关示例，请参阅我们的BibTeX源代码页面。如果可能的话，记得包括网址：离线论文没那么有用。\nGnunetbib的源代码在Git中。有关更多信息，请参见gnunetbib CGIT页面。要为这个BibTeX查看器做贡献，请阅读TODO以了解可能的起点。\n提交时，请尽量与我们在gnunetbib.bib中的条目格式匹配。我们的工具不能在任意的Bibtex上工作，而且手动清洁条目会大大延迟我们的工作。", "note_en": "Please send new or corrected entries to     &lt;gnunet-developers@gnu.org&gt;  .  If you can, please format them as BibTeX; see our  BibTeX source page for examples.    Remember to include URLs if possible:  offline papers are less useful.\n  The source code to gnunetbib is in Git. See  the gnunetbib cgit page for more information. To contribute to this BibTeX viewer, read  TODO for possible starting points.\n  When submitting, please try to match the format of our entries in gnunetbib.bib. Our tools do not work on arbitrary bibtex, and hand-cleaning entries can significantly delay us.", "posttime": "2020-11-15 07:33:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,技术,papers,bibtex", "title": "网络技术论文选集", "title_en": "Selected Papers in Meshnetworking", "transed": 1, "url": "https://bib.gnunet.org/", "via": "", "real_tags": ["论文", "技术", "papers", "bibtex"]}, {"category": "", "categoryclass": "", "imagename": "921924649fc9193dad50add64344f7d6.jpg", "infoid": 1035200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你想把它作为每周五下午1点的电子邮件时事通讯。PT，一定要在这里报名。\n前亚马逊仓库工人起诉公司，指控在疫情期间未能向工人提供个人防护用品。\n前亚马逊仓库员工Christian Smalls今日对该公司提起诉讼，指控亚马逊在新冠肺炎疫情期间未能向黑人和拉丁裔员工提供个人防护装备。\n这起集体诉讼指控亚马逊未能妥善保护其仓库工人，并违反了纽约市人权法以及联邦和州法律的规定。\n斯莫尔斯在一份声明中说：“我是一名忠诚的员工，我把我的一切都献给了亚马逊，直到我被无礼地解雇，就像昨天的垃圾一样被扔到一边，因为我坚持让亚马逊保护其敬业的员工不受新冠肺炎的伤害，”斯莫尔斯在一份声明中说。“我只是想让亚马逊为工人提供基本的防护装备，并对工作场所进行消毒。”\n骑士基金会、苏尔德纳基金会和康卡斯特NBC环球公司向黑人创新中心投入了210万美元。该计划旨在支持黑人企业家，并增加迈阿密和全美黑人创始人的数量。这笔钱将用于投资者教育，促进创始人和投资者之间的撮合会议，为创始人提供课程等。\n陈·扎克伯格倡议组织的前雇员雷·霍尔加多最近向加州公平就业和住房部提交了种族歧视申诉。霍尔加多是黑人，从2018年9月到2020年8月在CZI工作。\n霍尔加多的控诉称：“尽管CZI发表了社会正义的言论，但它对黑人员工来说并不是一个友好的环境。”“黑人员工工资过低，价值被低估，增长机会被剥夺，被边缘化。想要在组织内晋升的黑人员工被拒之门外，并被贴上过于自信或咄咄逼人的标签，而非黑人员工则受到青睐和鼓励。当黑人员工将这些担忧传达给CZI领导层时，CZI做出了防御性的回应，未能解决根本问题。CZI完全未能为其黑人员工‘建立一个更包容、更公正、更健康的未来’。\n这位发言人说：“虽然我们认真对待任何歧视指控，并将在这里这样做，但这名前雇员的具体指控之前是在内部提出的，经过独立调查，发现是没有根据的。”陈·扎克伯格倡议致力于为CZI团队的所有成员提供公平的待遇、机会和晋升机会。我们不容忍任何形式的歧视，句号。\n食品配送公司DoorDash今天提交了上市文件。这是一份很长的文件，所以我拿出了与Dei和劳动相关的项目。\nDoorDash表示，尽管从未发布过多样性报告，但它致力于在S-1中实现多样性和包容性。\n在DoorDash，我们致力于在我们的公司、我们的行业和我们服务的城市发展包容性社区，并赋予其权力。我们相信，多样化和包容性的劳动力对于帮助我们吸引和留住发展业务所需的人才至关重要。我们还相信，如果我们放大那些不总是被倾听的人的声音，当每个人都有“谈判桌前的空间”，以及工具、资源和成功的机会时，我们将成为一家更成功的公司。\nDoorDash的3279名员工中没有一人加入工会，这似乎也让他们感到自豪：\n我们的员工中没有一个是由工会代表的。我们没有经历过任何停工，我们相信我们的员工关系很牢固。\nDoorDash和其他零工经济公司一样，也在准备在其他州推行类似22号提案的立法：\n因此，2020年加州投票倡议的通过可能会对我们的运营结果产生不利影响。此外，我们运营的其他几个州可能正在考虑通过类似于2020年加州投票倡议的立法，我们预计这将增加我们在这些司法管辖区与Dasher相关的成本，并可能对我们的运营结果产生不利影响。\nSpora Health为黑人和有色人种推出了类似于One Medical的初级保健提供者网络。\nSpora Health创始人兼首席执行官丹·米勒在接受TechCrunch采访时表示：“公平的医疗体系在美国从未有过，尤其是对黑人而言，这就是我们的目标。”\nSpora Health最近完成了一轮120万美元的种子融资，是一家为黑人和有色人种提供初级保健的公司。最初，Spora Health正在采取远程医疗的方式，但最终计划开设实体店。\nLyft总裁约翰·齐默(John Zimmer)本周在Lyft的收益报告中表示：“展望未来，加州22号提案的胜利是一项里程碑式的成就，对司机、我们的行业和更广泛的Lyft社区来说都是一次重大胜利。”他说：“这项运动之所以成功，是因为它最终反映了司机的意愿和优先考虑的事项。超过12万名司机报名参加了通过22号提案的努力-他们集会，他们自愿，他们分享他们的故事。选民们看到了这一点，并与他们站在一起。我们期待着继续与全国各地的政策制定者对话。“。\n与优步类似，Lyft也在寻求在全国范围内探索类似的立法。在财报电话会议上，Lyft首席执行官洛根·格林(Logan Green)表示，22号提案为其他州提供了一个模式。\n优步和Lyft都提交了一份请愿书，要求对加州司法部长泽维尔·贝塞拉(Xavier Becera)提起的案件进行重审。上个月，一家上诉法院维持了下级法院的一项裁决，该裁决将迫使优步和Lyft将司机归类为员工。但现在22号提案已经通过，优步和Lyft希望法院决定禁令是否仍然合适。\n与此同时，优步和Lyft可能仍将在加州面临工人分类的诉讼，因为最近通过的提案不能追溯适用。然而，根据彭博社(Bloomberg Law)的说法，这些法律选择将是有限的，损害赔偿将受到限制。\n在一份联合声明中，人权观察组织和国际特赦组织称第22号提案是对零工工人权利的“毁灭性打击”。\n任何工人都不应该面临剥削或其他虐待的工作条件，但许多基于应用程序的工人却是如此。我们敦促以APP为基础的公司使其工资和劳动政策和做法与国际人权和劳工标准接轨。我们敦促加州政府探索其他法律途径，追究尊重工人权利的公司的责任。最后，我们敦促美国国会和美国劳工部保护基于APP的工人的权利，例如通过立法和监管行动，帮助确保最低生活工资、带薪病假和探亲假，以及工人的疾病和伤害补偿。", "note_en": "If you want this as an email newsletter every Friday at 1 p.m. PT,  be sure to sign up here.\n Former Amazon warehouse worker sues company alleging failure to provide PPE to workers during pandemic\n Christian Smalls, a former Amazon warehouse employee,  filed a lawsuit against the company today alleging Amazon failed to provide personal protective equipment to Black and Latinx workers during the COVID-19 pandemic.\n  The class action suit alleges Amazon failed to properly protect its warehouse workers and violated elements of New York City’s human rights law, as well as federal and state laws.\n “I was a loyal worker and gave my all to Amazon until I was unceremoniously terminated and tossed aside like yesterday’s trash because I insisted that Amazon protect its dedicated workers from COVID-19,” Smalls said in a statement. “I just wanted Amazon to provide basic protective gear to the workers and sanitize the workplace.”\n  The Knight Foundation, Surdna Foundation and Comcast NBCUNiversal  put $2.1 million into the Center for Black Innovation. The plan is to support Black entrepreneurs and increase the number of Black founders in Miami and throughout the U.S. The money will go toward investor education, facilitating matchmaking sessions between founders and investors, offering courses to founders and more.\n   Ray Holgado, a former employee of the Chan Zuckerberg Initiative,  recently filed a racial discrimination complaint with the California Department of Fair Employment and Housing. Holgado, who is Black, worked at CZI from September 2018 through August 2020.\n “Despite its social justice rhetoric, CZI is not a welcoming environment for Black employees,” Holgado’s complaint states. “Black employees are underpaid, undervalued, denied growth opportunities, and marginalized. Black employees who want to advance within the organization are shut down and labeled as too assertive or aggressive, while non-Black employees are favored and encouraged. When Black employees have communicated these concerns to CZI leadership, CZI has responded defensively and failed to address the underlying issues. CZI has utterly failed to ‘build a more inclusive, just, and healthy future’ for its Black employees.”\n  “While we take any allegation of discrimination seriously and will do so here, this former employee’s specific allegations were previously raised internally, independently investigated, and found to be unsubstantiated,” the spokesperson said. “The Chan Zuckerberg Initiative is committed to fair treatment, access, and advancement for all members of the CZI team. We do not tolerate discrimination of any kind, full stop.”\n  Food delivery company DoorDash filed its paperwork to go public today. It’s a long document, so I’ve pulled out the relevant items related to DEI and labor.\n DoorDash says it’s committed to diversity and inclusion in its S-1, despite never having released a diversity report\n At DoorDash, we are committed to growing and empowering inclusive communities in our company, our industry, and the cities we serve. We believe that a diverse and inclusive workforce is critical to helping us attract and retain the talent necessary to grow our business. We also believe we will be a more successful company if we amplify the voices of those who have not always been heard, and when everyone has ‘room at the table’ and the tools, resources, and opportunities to succeed.\n DoorDash also seems to be proud of the fact that none of its 3,279 employees have unionized:\n None of our employees are represented by a labor union. We have not experienced any work stoppages, and we believe that our employee relations are strong.\n DoorDash, like other gig economy companies, is also gearing up to pursue Prop 22-like legislation in other states:\n As such, the passage of the 2020 California ballot initiative is likely to have an adverse impact on our results of operations. In addition, several other states where we operate may be considering adopting legislation similar to the 2020 California ballot initiative, which we would expect to increase our costs related to Dashers in such jurisdictions and could also adversely impact our results of operations.\n   Spora Health launched its One Medical-like primary care provider network for Black people and people of color.\n “An equitable healthcare system has never existed in America, especially for Black folks and that is the goal,” Spora Health  founder and CEO Dan Miller told TechCrunch.\n Spora Health, which recently closed a $1.2 million seed round, is a primary care provider for Black people and people of color. Initially, Spora Health is taking a telemedicine approach, but eventually plans to open physical locations.\n  “As we look to the future, the win on Proposition 22 in California was a landmark achievement and a major victory for drivers, our industry and the broader Lyft community,”  Lyft President John Zimmer said in Lyft’s earnings report this week. “The campaign was successful because it ultimately reflected the desires and priorities of drivers. More than 120,000 drivers signed up to be part of the effort to pass Prop 22 – they rallied, they volunteered, they shared their stories. Voters saw that and stood in solidarity with them. We look forward to continuing our conversations with policymakers across the country.”\n Similar to Uber, Lyft is also looking to explore similar legislation across the country. On the earnings call, Lyft CEO Logan Green said Prop 22 provides a model for other states.\n  Uber and Lyft both filed a petition for rehearings in the case brought forth by California Attorney General Xavier Becerra. Last month, an appeals court upheld a lower court ruling that would force Uber and Lyft to classify their drivers as employees. But now that Proposition 22 has passed, Uber and Lyft want the court to determine if the injunction is still appropriate.\n Meanwhile, Uber and Lyft will likely still face lawsuits over worker classification in California since the recently-passed proposition can not be applied retroactively. According to Bloomberg Law,  those legal options, however, will be limited and damages will be capped.\n  In a joint statement, the Human Rights Watch and Amnesty International called Prop 22 a “devastating blow to the rights” of gig workers.\n  No worker should face exploitative or otherwise abusive work conditions, but many app-based workers do. We urge app-based companies to bring their wage and labor policies and practices in line with international human and labor rights standards. We urge the government of California to explore other legal avenues for holding companies accountable for respecting workers’ rights. Finally, we urge the United States Congress and the United States Department of Labor to protect the rights of app-based workers, such as through legislative and regulatory action that helps ensure a living wage, paid sick and family leave, and workers’ compensation for illness and injury.", "posttime": "2020-11-15 07:11:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,零工,capital", "title": "\n人力资本：亚马逊和CZI面临劳资纠纷，拜登承诺零工得到更好的保护", "title_en": "\n\t\t\t\tHuman Capital: Amazon and CZI face labor disputes as Biden promises gig workers better protections\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/14/human-capital-amazon-and-czi-face-labor-disputes-as-biden-promises-gig-workers-better-protections/", "via": "", "real_tags": ["亚马逊", "amazon", "零工", "capital"]}, {"category": "", "categoryclass": "", "imagename": "1131540fdbd0f6af382dd8cc1bb834ff.jpeg", "infoid": 1035199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国国家航空航天局正式批准SpaceX乘员龙太空舱和猎鹰9号火箭定期往返国际空间站。该机构已经签署了SpaceX乘员运输系统的人类等级认证计划，使其成为NASA自近40年前航天飞机以来第一个获得载人任务认证的航天器。\n“这一认证里程碑是NASA和SpaceX取得的令人难以置信的成就，突显了我们可以与商业行业合作取得的进步。”\n在过去的几年里，SpaceX公司必须通过在地面上进行大量测试和完成演示飞行来证明其系统是有效的。今年5月，埃隆·马斯克(Elon Musk)领导的公司成功地将宇航员鲍勃·本肯(Bob Behnken)和道格·赫尔利(Doug Hurley)送到国际空间站进行Demo-2飞行。几个月后，“龙”号机组人员与同一批宇航员一起坠入大西洋，结束了这项历史性的任务--这是自2011年最后一次航天飞机任务以来首次从美国本土发射的载人飞行。\n除了Demo-2飞行，SpaceX还必须完成大量其他测试，包括确保机组人员龙的降落伞系统正常工作的测试。该公司还不得不对太空舱的中止引擎和发射逃生系统进行测试，以确保他们能够在升空过程中遇到紧急情况时为宇航员提供从火箭中逃生的机会。\n既然机组人员龙和猎鹰9号系统已经通过认证，NASA和SpaceX就可以开始专注于未来的飞行，这些飞行将把更多的宇航员送入轨道。美国国家航空航天局(NASA)人类探索与行动任务理事会副局长凯西·卢德斯(Kathy Lueders)表示：\n“认证使我们从设计和测试阶段进入工作的机组轮换阶段，但我们不会停止确保每一次飞行，包括NASA的太空一号任务，都会以我们为我们的宇航员提供的最佳系统所投入的同样严格的态度来对待。”\n美国宇航局宇航员迈克尔·霍普金斯、维克多·格洛弗和香农·沃克，以及日本宇宙航空研究开发机构的宇航员野口宗一，将在国际空间站执行为期6个月的任务。NASA和SpaceX最初的目标是万圣节发射，但他们的新目标发射日期是11月14日，从NASA肯尼迪航天中心的发射综合体39A发射。", "note_en": "NASA has officially  approved the SpaceX Crew Dragon capsule and Falcon 9 rocket for regular astronaut flights to and from the International Space Station. The agency has  signed the Human Rating Certification Plan for SpaceX’s crew transportation system, making it the first spacecraft NASA has certified for manned missions since the space shuttle nearly 40 years ago.\n  “This certification milestone is an incredible achievement from NASA and SpaceX that highlights the progress we can make working together with commercial industry.”\n SpaceX had to prove that its system works by conducting numerous tests on the ground and completing demo flights over the past few years. The Elon Musk-led company successfully  flew astronauts Bob Behnken and Doug Hurley to the ISS back in May for the Demo-2 flight. A couple of months later, Crew Dragon  splashed down in the Atlantic Ocean with the same astronauts onboard, bringing the historic mission — it was the first crewed flight that launched from US soil since the final space shuttle mission in 2011 — to a close.\n In addition to the Demo-2 flight, SpaceX had to complete a plethora of other tests, including ones to make sure that Crew Dragon’s  parachute system works. The company also had to put the capsule’s  abort engines and  launch escape system through their paces to make sure they can provide astronauts an escape from the rocket in case of an emergency during ascent.\n Now that the Crew Dragon and Falcon 9 system has been certified, NASA and SpaceX can start focusing on future flights that’ll carry more astronauts to orbit. Kathy Lueders, associate administrator for NASA’s Human Exploration and Operation Mission Directorate, said:\n “Certification moves us from the design and test phase into the crew rotation phase of our work, but we will not stop making sure every flight, including NASA’s Space Crew-1 mission, will be approached with the same rigor we have put into making this the best system it can be for our astronauts.”\n The first Crew Dragon operational flight will ferry NASA astronauts Michael Hopkins, Victor Glover and Shannon Walker, as well as JAXA astronaut Soichi Noguchi, to the ISS for a six—month mission. NASA and SpaceX originally  aimed for a Halloween launch, but their new target launch date is November 14th from Launch Complex 39A at NASA’s Kennedy Space Center.", "posttime": "2020-11-15 07:07:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太空,美国,nasa,spacex,officially", "title": "美国国家航空航天局已经正式认证SpaceX公司可以进行太空飞行。", "title_en": "NASA has officially certified SpaceX for operational space flights", "transed": 1, "url": "https://www.engadget.com/nasa-certifies-spacex-crew-dragon-falcon-9-astronaut-flights-124026445.html", "via": "", "real_tags": ["太空", "美国", "nasa", "spacex"]}, {"category": "", "categoryclass": "", "imagename": "825a0da53f43a7fb1d970ba4d73fd453.jpg", "infoid": 1035198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "答：在加利福尼亚州圣克鲁斯，一个名叫迈克·庞德史密斯(Mike Pondsmith)的人为当时遥远的未来--2020年--做了一个预言。\n这是一个充满科技的未来。他设想了令人眼花缭乱的数据-网络空间的狂风，巨大的全息视频屏幕，生物工程小麦动力的地铁车辆，以及随处可见的五颜六色的网络光学眼睛的微光。在他的未来，一些民众遭受了一种被他称为“技术休克”的痛苦--无法应对技术对他们生活的入侵。\n他称这一愿景为赛博朋克。赛博朋克2020是他在1988年创建赛博朋克专营权时想象的世界的第二版。现在有50本书，5000多页，充满了细节，这无疑是小说中最广泛和最挑剔的想象世界之一。在主题和细节上，它给人的感觉就像今天的非虚构作品。\n如果你没有听说过庞德史密斯和他的作品，那是因为他所处的环境可能是另一个现实：一个蓬勃发展但仍然非常小众的桌面游戏媒介。作为R.Talsorian Games的创始人和首席设计师，他设计了几个特许经营的游戏。R.Talsorian Games是美国最著名的黑人拥有和运营的桌面游戏公司之一。但《赛博朋克：黑暗未来的角色扮演游戏》是他的代表作，有点像《地下城与龙》，用剑和魔法换来了硅片和网络空间。庞德史密斯最喜欢用一种方式来总结这一类型的本质：“这是‘让我们假装’，有规则。”\n现在，随着一款改编自庞德史密斯毕生作品的新视频游戏的推出，更多的观众终于可以很好地了解庞德史密斯这段时间以来一直在想象的东西。预计将于12月10日上映的赛博朋克2077是最近记忆中最令人期待的游戏之一。预告片描绘了一个破旧的、复古的未来主义游乐场，一个杂乱无章的世界，细节密布，充斥着暴力和混乱。粉丝和评论家对看似无穷无尽的玩家选择(玩家可以定制自己的生殖器)和长达数十个小时的沉浸式、见鬼的游戏玩法感到兴奋。这部电影的主演是基努·里夫斯(Keanu Reeves)的数字肖像，饰演约翰尼·西尔弗汉德(Johnny Silverhandd)，一位摇滚明星革命者，穿着战术背心，皮裤，飞行员太阳镜，还有一只金属手臂。\n现年60多岁的庞德史密斯一直穿着自己的赛博朋克制服：黑色皮夹克，黑色牛仔裤，摩托车靴，镜片。今天，在西雅图郊区的家中，他穿着黑色T恤，戴着普通眼镜。我们谈论Zoom是合适的，这是一种现在无处不在的远程呈现技术，1982年在Blade Runner中感觉到了未来主义。\n“写作，”庞德史密斯告诉我，“就像吃了一磅面团、一整根意大利香肠、几磅马苏里拉奶酪和一堆香料，然后吐出一个披萨。”要让一个不真实的世界感觉真实，需要做大量的工作。\n八年来，波兰视频游戏开发商CD Projekt Red同样致力于让庞德史密斯的世界在屏幕上感觉真实的任务。2012年，当制片厂第一次就改编赛博朋克一事与R.Talsorian Games联系时，庞德史密斯访问了华沙总部，他开玩笑说，这次行动由“四个人和一只山羊”组成。相反，庞德史密斯遇到了一个雄心勃勃的团队，他们正朝着现在的方向发展--成为欧洲最有价值的游戏公司之一。\n就像之前的桌面游戏一样，《赛博朋克2077》就科技在社会中的地位提出了严肃的问题。这款游戏的导演兼制片厂负责人亚当·巴多夫斯基(Adam Badowski)在谈到他对庞德史密斯核心主题的理解时说：“科技有点像这个世界的魔力。”它“赋予那些拥有它的人巨大的权力。”政府、企业和超级富豪都把它作为一种手段，以保持自己在食物链顶端的地位，同时统治社会，压低个人。但是，如果强大的技术落入那些希望利用它为自己、为个人自由和独立而战、迎头痛击自己的恐惧的个人手中，该怎么办？\nPondsmith说，经过多年的发展，人们对细节的关注近乎疯狂，结果“看起来它已经从我的大脑中消失了。”\n作为一名心理学家和一名美国空军军官，庞德史密斯一生中的前18年都在军队中穿梭。这给了他一个年轻人非同寻常的全景视角，以及快速适应他发现自己所处的任何环境的能力。他的想象力也很丰富。他开始沉迷于故事，越能传达信息越好：艾萨克·阿西莫夫(Isaac Asimov)的科幻小说，罗伯特·A·海因莱恩(Robert A.Heinlein)的少年小说，埃德加·赖斯·巴罗斯(Edgar Rice Burroughs)的巴苏姆。\n在80年代大部分时间定居在圣克鲁斯之前，他在加州大学戴维斯分校(UC Davis)学习心理学和平面设计。他是一个魅力十足的极客，他承认自己患有“过度个性”的痛苦。在乐队壮大之前，他听了皇后乐队的歌，仔细阅读了漫威漫画的页面，并梦想成为卢卡斯电影公司的布景和道具设计师。他也玩过《地下城与龙》，不过他对游戏本身的兴趣远不及他的一位玩家--他未来的妻子、R.Talsorian Games的业务经理丽莎(Lisa)--大。\n在当地的游戏和五金店里，他买了一款科幻角色扮演游戏，名为《旅行者》(Traveller)；对其巨大黑匣子的触觉记忆将永远留在他的脑海中。他非常喜欢这项运动，以至于他开始摆弄它，就像摆弄一辆心爱的汽车一样。很快，他创建了自己的桌面游戏，并担任视频游戏的平面设计师。在加州大学(University Of California)经营一家排字商店期间，他筹集了500美元，出版了他的第一本书《梅克顿》(Mekton)。这款游戏的灵感来自日本漫画和动漫，游戏中充斥着巨大的怪物战斗机器。紧随其后的是一部古怪的一次性电影--《来自外层空间的青少年》。他突然发现自己经营着自己的桌面游戏公司，有一群作家、插画家和设计师急于帮助他实现自己遥不可及的愿景。\n后来庞德史密斯发现了赛博朋克的流派。他喜欢雷德利·斯科特(Ridley Scott)执导的《银翼杀手》(Blade Runner)中悬而未决的问题和模棱两可的说法--软件能有灵魂。就像一场精彩的桌面游戏一样，这部电影留下了很多想象空间。庞德史密斯随后狼吞虎咽地读完了沃尔特·乔恩·威廉姆斯的《硬连线》，这是一部以一辆汽车显然是自动驾驶的形象开头的小说。\n赛博朋克很适合庞德史密斯，他自己也喜欢做出遥不可及的预测。“他似乎总是比我们其他人领先几年，”赛博朋克写作团队的前成员威尔·莫斯(Will Moss)说。“我记得我坐在他在阿普托斯的房子里。他举着一本平装书，邀请我们所有人想象一个每个人都带着一台那么大的电脑的世界。现在很明显，但在那个年代，当一台‘便携式’电脑的大小和重量相当于一个装满石头的行李箱时，这是一个相当令人兴奋的想法，我们都认为它是最纯粹的科幻小说。“。\n和现在一样，庞德史密斯当时的技巧是完全释放他的想象力，然后通过研究磨练他的想法，这通常意味着审问神经外科医生或陆军护理人员，或者开车去拉斯维加斯试验一堆自动武器。赛博朋克充斥着像《银翼杀手》这样的电影所无法容纳的那种挑剔的细节，这种科幻小说不厌其烦地解释说，引用一本原始资料书的话，“一架温彻斯特458Magnum Super X…。直接从枪口发射4712英尺磅的能量(超过前500码就会下降到1200英尺磅)。\n当R.Talsorian Games发布最初的赛博朋克时，这一类型作为一个整体，保持了新开箱硬件的诱惑力。在小说、电影、漫画书等作品中，艺术家们都在挖掘人们对本世纪人工智能、半机械人、视频游戏和互联网等美丽新世界的兴奋和焦虑。这项运动的鼻祖、作家威廉·吉布森(William Gibson)对年轻人的神经系统似乎与他们玩的电子游戏互动的方式着迷。毫不奇怪，阅读他的处女作《神经漫游者》中的迷幻技术就像重新连接了你的大脑。\n但这一流派并不意味着科技可以解决世界上所有的道德和社会弊病。相反，它描绘了一个反乌托邦的愿景，无处不在的技术是破坏和压迫的可怕工具，而灵巧的黑客是与腐败势力作斗争的勇士-亡命之徒。黑客这个词本身似乎带有一丝朋克叛逆的味道，其隐含的老练与粉碎和割断的外延形成了鲜明对比。最终，这场最初的文学运动感觉像是一场社会运动，一种完全懂数字的反主流文化。\n最近，这一类型的电影重新流行起来，比如《黑镜》(Black Mirror)、《西部世界》(Westworld)、《机器人先生》(Mr Robot)、《上传》(Upload)和《改变碳》(Alternated Carbon)；还有《升级》(Upgrade)、《攻壳机动队》(Ghost In The Shell)、《银翼杀手2049》(Blade Runner 2049)和《阿丽塔：战斗天使》(Alita：Batch Angel)等电影；这也就不足为奇了。无论是在新闻上还是在街头，这不就是赛博朋克的前辈们所设想的世界吗？让人瞠目结舌的应用程序从我们的大脑中挖掘数据；黑客活动家、网络恐怖分子、散布组织的机器人；大型科技公司(Big Tech)监控我们的行动；面部识别公司Clearview AI搜索我们的社交媒体照片。\n庞德史密斯承认，在2020年的大部分时间里，阅读一本赛博朋克资源手册会让人感到宾至如归。巧合的是，他早期的幻觉也描绘了一场毁灭性的空中瘟疫和血红色的天空。“我的朋友和家人之间流传着一个笑话，‘好吧，迈克，事情就像你描述的那样，’ ，”他说。“ ‘Think Happy Things.’ ”当我们在7月份交谈时，黑人生命也是重要的抗议活动正在全国范围内肆虐。他说：“我们有很多人觉得情况已经失控，他们无法影响自己的命运。”“我认为赛博朋克在很多方面表达了这种挫折感。”\n随着今年国内动乱的爆发，强大的技术被派往监控和镇压。美国海关和边境保护局用军用无人机监视抗议者。活动人士担心，警方正在使用面部识别技术，并通过模拟蜂窝塔的黄貂鱼设备(IMSI捕手)拦截智能手机通信。\n但是，正如赛博朋克预测的那样，在对抗监控方面，一些技术也成为了得心应手的武器。抗议者加密短信，匿名照片，在智能手机上收听警方扫描应用程序的实时音频，或者在去年香港骚乱的情况下，向监控摄像头和警察照射激光指示器。黑客劫持了警方的无线电频率；他们获得了执法机构269千兆字节的数据，包括警方和联邦调查局的报告，一个名为分布式否认秘密的组织在其网站上发布了这些报告。今年2月，新闻头条宣布了一款看起来像赛博朋克的超声波手镯，用户可以将麦克风卡在智能扬声器中。\n庞德史密斯说：“我们正在想方设法利用科技来解放我们自己。”“想想这部手机吧。你可以用这部手机来八卦。你可以用这部手机说谎。你可以用这部手机讲一些非常棒的笑话。你可以用这部手机揭露腐败、不平等和不良行为。重要的是，我们要积极思考如何使用它，它如何影响我们的生活和我们的社会，并从中学习。“。\n在悲观情绪基本上弥漫在更广泛的流派中，赛博朋克透露庞德史密斯是一个乐观主义者-至少相对来说是这样。用他自己的话说，这款游戏告诉玩家“抓住方向盘，窃取权力，打破腐败分子的束缚，击毙他们派来粉碎你的暴徒”--并有可能让“黑暗的未来”变得更加光明。或者，就像他更平淡地告诉我的那样，“如果你想要一个更好的未来，你最好振作起来，去实现它。”庞德史密斯猜测，正是这种含蓄的信息让这款游戏在一开始就大受欢迎。\n在他的作品中，庞德史密斯最终致力于娱乐，而不是说教。他说：“游戏是玩乐的玩具。”即便如此，他知道游戏和任何故事一样，可以影响我们与世界的关系。“几乎每个故事都会让你问自己，我该如何融入这个故事？”我会怎么做？我能成为英雄吗？ 。\n当我们交谈的时候，庞德史密斯还没有玩《赛博朋克2077》的最终版本。但他告诉我，他从玩这场未完成的游戏中得到了乐趣。他喜欢细读游戏中的世界，窃听游戏中的居民--一个漫步在他自己创造的世界里的业余爱好者。“我四处走动。我会去我不该去的地方。我站在街角。\n“这真是太棒了，因为有些时候会有人路过。他们正在进行一场真正的对话。我在监听。就像我在真正的街道上一样。我在想，嗯，这不关我的事，…。但这听起来确实是一个有趣的故事。“。突然间，庞德史密斯又觉得受到了启发。“我在想，嗯。也许我可以把这个加到披萨里。“。\n我们想听听你对这篇文章的看法。提交一封信给编辑，或者写信给letts@theatlantic.com。", "note_en": "A , in Santa Cruz, California, a man named Mike Pondsmith laid out a prophecy for the then-distant future—the year 2020.\n It was a future teeming with tech. He envisioned the dizzying data-winds of cyberspace, gigantic holographic video screens, bioengineered wheat-powered metro cars, and, everywhere you looked, the gleam of polychrome cyberoptic eyes. In his future, some of the populace suffered from an affliction he dubbed “technoshock”—an inability to cope with technology’s incursions into their lives.\n   He called that vision Cyberpunk. Cyberpunk 2020 was the second edition of the world he’d imagined in 1988, when he created the Cyberpunk franchise. Now filling 50 books comprising more than 5,000 pages crammed with minutiae, it’s surely one of the most extensively and fastidiously imagined worlds in fiction. And in its themes and particulars, it can feel startlingly like nonfiction today.\n If you haven’t heard of Pondsmith and his work, it’s because he operates in what may as well be an alternate reality: the thriving but still terrifically niche medium of tabletop games. As the founder and lead designer of R. Talsorian Games, one of the most prominent Black-owned and -operated tabletop-game companies in the country, he has designed several franchises. But  Cyberpunk: The Roleplaying Game of the Dark Future is his magnum opus, sort of like Dungeons &amp; Dragons, with the swords and sorcery swapped for silicon and cyberspace. Pondsmith’s favorite way of summing up the essence of the genre: “It’s ‘let’s pretend,’ with rules.”\n    Now a much wider audience is finally getting a good look at what Pondsmith has been imagining this whole time, with a new video game adapted from his life’s work. Due out on December 10, Cyberpunk 2077 is one of the most lustfully anticipated games in recent memory. Trailers depict a seedy, retro-futuristic playground, a sprawling world dense with detail and packed with violence and mayhem. Fans and reviewers are excited about seemingly endless player choice (players can customize their genitals) and dozens of hours of immersive, do-whatever-the-hell-you-want game play. It stars  a digital likeness of Keanu Reeves as Johnny Silverhand, a rock-star revolutionary who sports a tactical vest, leather pants, aviator sunglasses, and a metal arm.\n  Pondsmith, now in his 60s, has been known to wear his own cyberpunk uniform: black leather jacket, black jeans, motorcycle boots, mirror shades. Today, at home in the suburbs of Seattle, he’s in a black T-shirt and regular spectacles. It’s fitting that we’re speaking over Zoom, the kind of now-ubiquitous telepresence technology that felt futuristic in  Blade Runner in 1982.\n   “Writing,” Pondsmith tells me, “is a lot like basically eating a pound of dough, a whole pepperoni, a couple of pounds of mozzarella, and a bunch of spices, then throwing up a pizza.” It takes a lot of work to make an unreal world feel real.\n For eight years, the Polish video-game developer CD Projekt Red has likewise been consumed with the task of making Pondsmith’s world feel authentic on-screen. In 2012, when the studio first contacted R. Talsorian Games about adapting Cyberpunk, Pondsmith paid a visit to the Warsaw headquarters expecting the operation, he has joked, to consist of “four guys and a goat.” Instead, Pondsmith met a team with epic ambitions, well on the way to becoming what it is now—one of the most valuable gaming companies in Europe.\n Like the tabletop games before it, Cyberpunk 2077 asks serious-minded questions about the place of technology in society. “Technology is sort of like the magic of this world,” the game’s director and the head of studio, Adam Badowski, says of his understanding of Pondsmith’s core themes. It “grants massive amounts of power to those who possess it. Governments, corporations, and the ultrarich all use it as a means of keeping their place at the top of the food chain, while dominating society and keeping down the individual. But what if powerful technology gets into the hands of individuals who wish to use it to fight for themselves, for their personal freedom and independence, to take their fears head-on?”\n  After years of development featuring an attention to detail verging on the maniacal, the result, Pondsmith said, “looked like it had walked out of my brain.”\n a psychologist and a U.S. Air Force officer, Pondsmith spent the first 18 years of his life shuttling around with the military. It gave him an uncommonly panoramic perspective for a young person, and the ability to quickly adapt to whatever surroundings he found himself in. His imagination roved widely too. He became addicted to stories, the more transporting the better: Isaac Asimov’s science fiction, Robert A. Heinlein’s juvenile novels, Edgar Rice Burroughs’s  Barsoom series.\n    Before settling in Santa Cruz for much of the ’80s, he studied psychology and graphic design at UC Davis. He was a charismatic geek, afflicted, he admits, with “an excess of personality.” He listened to Queen before the band was big, pored over the pages of Marvel comics, and dreamed of working as a set-and-prop designer for Lucasfilm. He also played Dungeons &amp; Dragons, though he was much less interested in the game itself than in one of his fellow gamers, his future wife and R. Talsorian Games’ business manager, Lisa.\n  At his local games and hardware store, he picked up a science-fiction role-playing game called Traveller; the tactile memory of its hefty black box would stay with him. He enjoyed the game so much that he started tinkering with it, as one would with a beloved car. Soon he was creating his own tabletop games and working as a graphic designer on video games. While running a typesetting shop at the University of California, he raised $500 and published his first title, Mekton. The game was inspired by Japanese comics and anime, and populated by giant monster-fighting machines. It was followed by an oddball one-off called Teenagers From Outer Space. He suddenly found himself running his own tabletop-games company, with a crew of writers, illustrators, and designers eager to help him realize his far-fetched visions.\n  Then Pondsmith discovered the genre of cyberpunk. He loved the unanswered questions and ambiguities of Ridley Scott’s  Blade Runner—could software have a soul? Like a good tabletop game, the film left a whole lot to the imagination. Pondsmith then devoured Walter Jon Williams’s  Hardwired, a novel that begins with the image of a car apparently driving itself.\n  Cyberpunk suited Pondsmith, who himself enjoyed making far-out predictions. “He always seemed a few years ahead of the rest of us,” says Will Moss, a former member of the Cyberpunk writing team. “I remember sitting in his house in Aptos. He was holding up a paperback book and inviting us all to imagine a world in which everyone carried a computer that size. Obvious now, but in those days, when a ‘portable’ computer was the size and weight of a suitcase full of rocks, this was a fairly mind-blowing idea, and we all thought it was purest science fiction.”\n Pondsmith’s technique, then as now, was to let his imagination fully off the leash and then hone his ideas with research, which usually meant interrogating a neurosurgeon or an Army paramedic, or driving to Vegas and trying out a bunch of automatic weapons. Cyberpunk was dense with just the kinds of finicky details that films like  Blade Runner couldn’t accommodate, the type of sci-fi that goes to the trouble of explaining, to quote one sourcebook, that “a Winchester 458 Magnum Super X … delivers 4,712 foot-pounds of energy direct from the muzzle (that drops off to 1,200 ft-lbs past the first 500 yards).”\n    when R. Talsorian Games released the original Cyberpunk, the genre as a whole held the seductive allure of freshly unboxed hardware. In novels, films, comic books, and more, artists were tapping into the excitement and anxieties about the century’s brave new worlds of artificial intelligence, cyborgs, video games, and the internet. The granddaddy of the movement, the writer William Gibson, was fascinated by the way young people’s nervous systems seemed to interact with the video-arcade games they played. It’s no surprise that reading the psychedelic technobabble of his debut novel,  Neuromancer, is like having your brain rewired.\n But the genre didn’t suggest that tech would solve all the moral and social ills of the world. Instead, it laid out a dystopian vision in which ubiquitous tech was an awesome tool of disruption and oppression, and the nimble-fingered hacker was a warrior-outlaw battling corrupt forces. The word  hacker itself seems to carry a whiff of punk rebellion, its implied sophistication contrasting with a denotation of smashing and severing. Eventually, what began as a literary movement felt like a social one, an entire digitally savvy counterculture.\n  Lately, the genre’s gotten a reboot, with shows such as  Black Mirror,  Westworld,  Mr. Robot,  Upload, and  Altered Carbon; films such as  Upgrade,  Ghost in the Shell,  Blade Runner 2049, and  Alita: Battle Angel; and countless other media offering their take on the clash between technology and human nature. And no wonder. In the news and on the streets, isn’t this the world envisioned by cyberpunk’s progenitors? Eye-transfixing apps mining our minds for data; hacktivists, cyberterrorists, division-sowing bots; Big Tech monitoring our movements;  the facial-recognition company Clearview AI scouring our social-media photos.\n Much of 2020, Pondsmith admits, would feel right at home in the pages of a Cyberpunk sourcebook. His early visions, coincidentally, also featured a devastating airborne plague and blood-red skies. “The running joke among my friends and family is, ‘Okay, Mike, it’s turning out the way you described it,’ ” he said. “ ‘Think happy thoughts.’ ” When we spoke in July, Black Lives Matter protests were raging across the country. “We’ve got a lot of people who feel like it’s out of control and they cannot affect their own destiny,” he said. “I think cyberpunk is in a lot of ways an articulation of that frustration.”\n   As civil unrest erupted this year, powerful technologies were marshaled to monitor it and tamp it down. U.S. Customs and Border Protection surveilled protesters with a military-grade drone. Activists feared that police were using facial-recognition technology and intercepting smartphone communications with cellular-tower-impersonating stingray devices (IMSI-catchers).\n    But, as cyberpunk predicted, some tech also became handy weapons in the fight against surveillance. Protesters encrypted texts, anonymized photographs, tuned in to  live audio feeds on smartphone police-scanner apps—or, in the case of the unrest in Hong Kong last year, shone laser pointers at surveillance cameras and police officers alike. Hackers  hijacked police-radio frequencies; they obtained 269 gigabytes of law-enforcement agencies’ data, including police and FBI reports, which a group known as  Distributed Denial of Secrets published on its website. In February, headlines announced the creation of a  cyberpunk-looking ultrasonic bracelet that would allow users to jam the microphones in smart speakers.\n  “We are finding ways to utilize technology to free ourselves,” Pondsmith said. “Think about this phone. You can use this cellphone to gossip. You can use this cellphone to tell lies. You can use this cellphone to tell some really great jokes. You can use this cellphone to expose corruption, inequality, bad behavior. What’s important is that we actively think about how we use it, how it affects our lives and our societies, and learn from it.”\n Amid the pessimism that largely permeates the broader genre, Cyberpunk reveals Pondsmith to be something of an optimist—at least relatively speaking. In his own words, the game tells players to “grab the wheel, steal the power, break the strangleholds of the corrupt and gun down the thugs they sent to crush you”—and potentially make the “Dark Future” a brighter one. Or, as he told me more prosaically, “if you want a better future, you’d better get off your butt and make it.” It was that implicit message, Pondsmith guesses, that made the game a hit in the first place.\n  In his work, Pondsmith ultimately sets out to entertain, not preach. “A game is a toy for having fun,” he said. Even so, he knows that a game, like any story, can affect how we relate to the world. “Almost every story invites you to ask yourself,  How would I fit into this story? What would I do? Could I be the hero? ”\n When we spoke, Pondsmith still hadn’t played a final version of Cyberpunk 2077. But he told me he got a kick out of playing sections of the unfinished game. He enjoyed just perusing the in-game world, eavesdropping on its inhabitants—a flaneur strolling through his own creation. “I walk around. I go where I’m not supposed to go. I stand on street corners.\n “It’s great, because there are moments where somebody walks by. And they’re having a real conversation. And I listen in. Just as I would on a real street. I’m thinking,  Well, it’s not my business … but it does sound like an interesting story.” And suddenly, Pondsmith is feeling inspired again. “I’m thinking,  Hmm. Maybe I can add this to the pizza.”\n    We want to hear what you think about this article.  Submit a letter to the editor or write to letters@theatlantic.com.", "posttime": "2020-11-15 07:02:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,未来,playing", "title": "预测未来的角色扮演游戏", "title_en": "The Role-Playing Game That Predicted the Future", "transed": 1, "url": "https://www.theatlantic.com/magazine/archive/2020/12/mike-pondsmith-cyberpunk-2077/616924/", "via": "", "real_tags": ["游戏", "未来", "playing"]}, {"category": "", "categoryclass": "", "imagename": "929129761bcc1a9135facc8d8297c163.jpeg", "infoid": 1035196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "布鲁塞尔(路透社)-Alphabet GOOGL.O首席执行官桑达尔·皮查伊(Sundar Pichai)已经就一份泄露的内部文件向欧洲行业负责人蒂埃里·布雷顿(Thierry Breton)道歉，该文件提出了一些策略，以对抗欧盟对互联网公司的严格新规，并游说反对欧盟专员。\n根据欧盟委员会(European Commission)的一份声明，皮查伊和布雷东周四晚间在视频电话会议上交换了意见，这是今年以来的第三次。\n这一呼吁是在谷歌的一份内部文件概述了一项为期60天的战略之后发出的，该战略旨在通过让美国的盟友反击布雷顿来攻击欧盟推动新规则的努力。\n这通电话是在文件泄露之前由谷歌发起的。布雷东在通话中把泄露的文件拿给皮查伊看。\n他说：“我对此并不感到惊讶。我又不是没见过世面。我认为这有点过时了……“布雷顿在周五的一次在线会议上告诉英美新闻协会，他在空中挥舞着这份文件。\n“无论如何，是的，我和桑达尔进行了讨论……。我告诉了他我必须告诉他的事情……他道歉了。(我告诉他)如果你需要告诉我什么，我的大门永远为你敞开。“他说。\n另一位知情人士表示，皮查伊为这份文件公布的方式道歉，他表示，他没有看到这份文件，也没有批准。他表示，如果他看到专门针对谷歌的语言和政策，他将直接与Breton接触。\n谷歌发言人Al Verney在一份声明中说：“我们的在线工具在封锁期间一直是许多人和企业的生命线，谷歌致力于继续创新和建立服务，为后COVID时代的欧洲经济复苏做出贡献。”\n这起事件突显了科技公司对拟议中的欧盟规则的激烈游说，这些规则可能会阻碍它们的业务，并迫使它们改变运营方式。\n他告诉皮查伊：“互联网不能再是‘狂野西部’了：我们需要清晰透明的规则、可预测的环境以及平衡的权利和义务。”\n布雷顿将于12月2日与欧盟竞争事务专员玛格丽特·维斯特格(Margrethe Vestager)一起宣布新的规则草案，即数字服务法案(Digital Services Act)和数字市场法案(Digital Markets Act)。\n这些规定将为看门人--拥有市场支配力的网络公司--列出一份应做和不该做的清单，迫使它们与竞争对手和监管机构共享数据，不得不公平地推广其服务和产品。\n欧盟反垄断专员玛格丽特·维斯特格(Margrethe Vestager)在过去三年里对谷歌处以总计82.5亿欧元(约合97亿美元)的罚款，原因是谷歌滥用市场力量偏袒其购物比较服务、Android移动操作系统和广告业务。\n布雷东告诉皮查伊，他将增加欧盟通过把关平台遏制不公平行为的权力，这样互联网不仅会让少数公司受益，也会让欧洲的中小企业和企业家受益。\n他告诉皮查伊：“欧洲的立场是明确的：欧洲大陆欢迎任何人--只要他们尊重我们的规则。”", "note_en": "BRUSSELS (Reuters) - Alphabet   GOOGL.O  CEO Sundar Pichai has apologised to Europe&#39;s industry chief Thierry Breton over a leaked internal document proposing tactics to counter the EU&#39;s tough new rules on internet companies and lobby against the EU commissioner.\n  Pichai and Breton exchanged views in a video-conference call late on Thursday, the third this year, according to a statement from the European Commission.\n The call came after a Google internal document outlined a 60-day strategy to attack the European Union’s push for the new rules by getting U.S. allies to push back against Breton.\n The call was initiated by Google before the document was leaked. Breton brought up the leaked document and showed it to Pichai during the call.\n  “I was not surprised. I’m not naive. I thought it was a bit old fashioned...,” Breton told the Anglo-American Press Association in a online meeting on Friday, waving the document in the air.\n “In any case, yes I had a discussion with Sundar... I told him what I had to tell him....he apologised. (I told him) If you need to tell me something, my door will always be open,” he said.\n Pichai apologised for the way the document came out, which he said he had not seen or sanctioned, saying that he would engage directly with Breton if he sees language and policy that specifically targets Google, another person familiar with the call said.\n   “Our online tools have been a lifeline to many people and businesses through lockdown, and Google is committed to continuing to innovate and build services that can contribute to Europe’s economic recovery post-COVID,” spokesman Al Verney said in a statement.\n The incident underlines the intense lobbying by tech companies against the proposed EU rules, which could impede their businesses and force changes in how they operate.\n   “The Internet cannot remain a ‘Wild West’: we need clear and transparent rules, a predictable environment and balanced rights and obligations,” he told Pichai.\n Breton will announce new draft rules known as the Digital Services Act and the Digital Markets Act together with European Competition Commissioner Margrethe Vestager on Dec. 2.\n  The rules will set out a list of do’s and don’ts for gatekeepers - online companies with market power - forcing them to share data with rivals and regulators and not to promote their services and products unfairly.\n EU antitrust chief Margrethe Vestager has levied fines totalling 8.25 billion euros ($9.7 billion) against Google in the past three years for abusing its market power to favour its shopping comparison service, its Android mobile operating system and its advertising business.\n Breton told Pichai that he would increase the EU’s power to curb unfair behaviour by gatekeeping platforms, so that the Internet does not just benefit a handful of companies but also Europe’s small- and medium-sized enterprises and entrepreneurs.\n “Europe’s position is clear: everyone is welcome on our continent – as long as they respect our rules,” he told Pichai.", "posttime": "2020-11-15 06:45:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,ceo", "title": "谷歌CEO为文件道歉，欧盟布雷顿警告互联网不是狂野西部", "title_en": "Google CEO Apologises for Document, EU's Breton Warns Internet is Not Wild West", "transed": 1, "url": "https://www.reuters.com/article/us-eu-alphabet-tech/google-ceo-apologises-for-document-eus-breton-warns-internet-is-not-wild-west-idUSKBN27T1CX", "via": "", "real_tags": ["谷歌", "google", "ceo"]}, {"category": "", "categoryclass": "", "imagename": "b33388e071f22f8cd1a292ad0a188bf6.png", "infoid": 1035195, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "傅立叶变换是一种用于各种不同事物的工具。这是对傅里叶变换功能的解释，以及它可能有用的一些不同方式。以及你如何用它做漂亮的东西，比如这个东西：\n我将解释动画是如何工作的，并在此过程中解释傅里叶变换！\n我们暂时不讲数学和方程式。它背后有一堆有趣的数学知识，但最好从它的实际用途开始，以及为什么你想首先使用它。如果你想知道更多关于如何做到这一点，下面有一些进一步的阅读建议！\n简而言之，傅里叶变换是一种将某物分解成一串正弦波的方法。和往常一样，这个名字来自很久以前的一个叫傅立叶的人。\n让我们从一些简单的例子开始，然后逐步提高。首先，我们来看看波浪--随着时间的推移重复出现的模式。\n这里的波浪形可以分成正弦波。也就是说，当我们把这两个正弦波相加时，我们就得到了原来的波。\n傅里叶变换是一种方法，我们可以得到组合的波，然后把每个正弦波都取出来。在这个例子中，只需查看原始的Wave，您几乎可以在头脑中做到这一点。\n为什么？事实证明，现实世界中的很多东西都是基于这些正弦波相互作用的。我们通常称它们为波的频率。\n最明显的例子是声音--当我们听到声音时，我们听不到曲折的线条，但我们能听到组成声音的正弦波的不同频率。\n能够在电脑上将它们分开，可以让我们了解一个人实际上听到了什么。我们可以理解声音的高低，或者弄清楚它是什么音符。\n我们也可以用这个过程来处理那些看起来不像是由正弦波组成的波。\n它可能看起来不像，但它也可以被分成正弦波。\n这一次我们需要很多这样的模型--从技术上讲，需要无限的数量才能完美地代表它。当我们把越来越多的正弦波加起来时，图案就越来越接近我们开始时的方波。\n从视觉上看，你会注意到实际上前几个正弦波才是最大的不同之处。随着滑块的一半，我们得到了波浪的大致形状，但它完全是摇摆的。我们只需要剩下的小的来让摇摆变得平坦。\n当你听到电波时，你会听到声音变得更低，因为我们正在移除较高的频率。\n对于任何重复的行，此过程都是这样工作的。试一试，试着画你自己的！\n移动滑块查看当我们添加更多正弦波时，它如何越来越接近您的绘图。\n再说一次，除了额外的摆动，这个波看起来非常相似，只有一半的正弦波。\n事实上，我们可以利用这样一个事实，即这波浪潮与我们的优势非常相似。通过使用傅立叶变换，我们可以得到声音的重要部分，并只存储这些部分，以得到与原始声音非常接近的结果。\n我们能做的是把它表示成一串正弦波。然后我们可以忽略较小的频率来压缩声音。我们的最终结果不会是一样的，但它听起来会很像一个人。\n这基本上就是MP3所做的，只是它们在保留和丢弃哪些频率方面更加聪明。\n所以在这种情况下，我们可以使用傅立叶变换来理解波的基本性质，然后我们可以用它来进行压缩。\n好了，现在让我们更深入地研究傅里叶变换。下一部分看起来很酷，但也让您更好地理解了傅里叶变换的作用。但大部分看起来都很酷。\n一开始，我说它会把东西分成正弦波。问题是，它产生的正弦波不仅是规则正弦波，而且是3D正弦波。你可以称它们为复杂的正弦波。或者仅仅是螺旋形的(#34；#34；#34；)。\n如果我们从侧面看，它们看起来像正弦波。不过，从正面看，这些看起来就像圆圈。\n到目前为止，我们所做的一切只需要规则的2D正弦波。当我们对2D波进行傅里叶变换时，复杂的部分被抵消了，所以我们最终只能得到正弦波。\n但是我们可以使用3D正弦波来做一些有趣的事情，如下所示：\n嗯，我们可以把这幅画想象成3D形状，因为它在时间上移动的方式。如果你想象一个人在画一只手，这三个维度代表了他们的铅笔尖在那个时刻的位置。X和y维度告诉我们位置，然后时间维度就是那一刻的时间。\n现在我们有了3D图案，我们不能用规则的2D正弦波来表示它。不管我们加起来多少个2D正弦波，我们永远也得不到3D的东西。所以我们需要一些其他的东西。\n我们可以使用的是之前的3D螺旋正弦波。如果我们把这些加起来，我们就可以得到看起来像我们的3D图案的东西。\n记住，当我们从前面看这些波浪时，它们看起来像圆圈。一个圆围绕另一个圆旋转的图案叫本轮。\n和以前一样，我们只需要几个圆圈就可以很好地近似我们的模式。因为这是一个相当简单的形状，所以最后几个形状只是让边缘变得更锋利一点。\n所有这些都适用于任何绘画，真的！现在是你玩弄它的机会了。\n同样，你会看到，对于大多数形状，我们只需用一小部分圆圈就可以很好地近似它们，而不是保存所有的点。\n我们能把这个用于真实数据吗？嗯，我们可以的！实际上，我们有另一种称为SVG的数据格式，对于我们倾向于创建的形状类型，它可能做得更好。所以就目前而言，这真的只是为了做一些很酷的小玩意儿。\n你知道傅里叶变换也可以用在图像上吗？事实上，我们一直都在使用它，因为这就是JPEG的工作方式！我们正在把同样的原理应用到图像上--把一些东西分解成一串正弦波，然后只存储重要的部分。\n现在我们正在处理图像，我们需要一种不同类型的正弦波。我们需要一些东西，无论我们有什么图像，我们都可以把这些正弦波加在一起，回到我们最初的图像。\n要做到这一点，我们的每个正弦波也将是图像。我们现在的图像不是线条的波浪，而是黑白部分。为了表示波浪的大小，每幅图像都会有或多或少的对比度。\n我们也可以用它们以同样的方式表示彩色，但现在让我们先从黑白图像开始。为了表现无色图像，我们需要一些水平波图像，\n仅靠水平和垂直图像本身并不足以代表我们得到的图像类型。我们还需要一些额外的数字，你可以把这两个数字相乘。\n如果我们拍摄这些图像，将它们的对比度调整到合适的量，然后把它们加在一起，我们就可以创建任何图像。\n让我们从这个字母开始吧。它很小，但我们需要它小一点，否则我们最终会看到太多其他图片。\n随着我们添加越来越多的这样的图像，我们最终得到的是与实际图像越来越接近的东西。但我想你会看到这里的模式，因为我们只对其中的几个进行了合理的近似。\n图像被分成8x8个块，每个块被单独拆分。我们使用一组频率来确定每个像素的亮或暗程度，然后再使用另外两组颜色，一组用于红绿，另一组用于蓝黄。我们为每个块使用的频率数决定了JPEG的质量。\n这是一张真实的JPEG图像，放大后我们可以看到细节。当我们调整质量水平时，我们可以看到这一过程的发生。\n傅立叶变换是一种可以让我们把某物分解成其频率的东西。\n我们也可以用它们来制作带有一堆圆圈的很酷的动画。\n这只是一些应用程序的皮毛而已。傅里叶变换是一个非常强大的工具，因为将事物分解成频率是非常基本的。它们被用于很多领域，包括电路设计、手机信号、磁共振成像(MRI)和量子物理！\n我跳过了这里的大部分数学内容，但如果你对它的基本原理感兴趣，这里有一些问题可以用来指导你的研究：\n连续时间傅里叶变换和离散时间傅里叶变换有什么不同？\n你如何对整首歌进行傅里叶变换？(而不是只有一个音符。)。\n傅里叶变换的互动指南一篇很棒的文章，更深入地研究了所发生的数学问题。\n但是什么是傅里叶变换呢？一个视频介绍。3Blue1Brown的一段很棒的YouTube视频，也从音频的角度解释了傅里叶变换的数学。\n数学与艺术的故事：创建傅里叶级数调和圆可视化另一篇文章解释如何使用外轮画一条路径，从线性代数的角度解释。\n我叫杰兹！我全职在旧金山湾区的一家搜索公司工作，业余时间我喜欢做这样的游戏和互动代码！\n这个网页是开源的，你可以在GitHub上查看代码！如果你有任何反馈，或者想问任何问题，请随时给我发电子邮件到Fourier[at]jezzamon[dot]com，或者在Twitter上发一条推文给我。\n如果你想看到更多我的作品，请查看我的主页，如果你想看看我接下来做了什么，你可以关注我的推特账号@jezzamonn！", "note_en": "Fourier transforms are a tool used in a whole bunch of different things. This is an explanation of what a Fourier transform does, and some different ways it can be useful. And how you can make pretty things with it, like this thing:\n  I&#39;m going to explain how that animation works, and along the way explain Fourier transforms!\n   We&#39;re going to leave the mathematics and equations out of it for now. There&#39;s a bunch of interesting maths behind it, but it&#39;s better to start with what it actually does, and why you&#39;d want to use it first. If you want to know more about the how, there&#39;s some further reading suggestions below!\n  Put simply, the Fourier transform is a way of splitting something up into a bunch of sine waves. As usual, the name comes from some person who lived a long time ago called Fourier.\n Let’s start with some simple examples and work our way up. First up we&#39;re going to look at waves - patterns that repeat over time.\n   This wavy pattern here can be split up into sine waves. That is, when we add up the two sine waves we get back the original wave.\n  The Fourier transform is a way for us to take the combined wave, and get each of the sine waves back out. In this example, you can almost do it in your head, just by looking at the original wave.\n Why? Turns out a lot of things in the real world interact based on these sine waves. We usually call them the wave&#39;s frequencies.\n The most obvious example is sound – when we hear a sound, we don’t hear that squiggly line, but we hear the different frequencies of the sine waves that make up the sound.\n    Being able to split them up on a computer can give us an understanding of what a person actually hears. We can understand how high or low a sound is, or figure out what note it is.\n We can also use this process on waves that don&#39;t look like they&#39;re made of sine waves.\n   It might not look like it, but it also can be split up into sine waves.\n  We need a lot of them this time – technically an infinite amount to perfectly represent it. As we add up more and more sine waves the pattern gets closer and closer to the square wave we started with.\n     Visually, you&#39;ll notice that actually the first few sine waves are the ones that make the biggest difference. With the slider halfway, we have the general shape of the wave, but it&#39;s all wiggly. We just need the rest of the small ones to make the wigglyness flatten out.\n When you listen to the wave, you&#39;ll hear the sound get lower, because we&#39;re removing the higher frequencies.\n This process works like that for any repeating line. Give it a go, try drawing your own!\n   Move the slider to see how as we add more sine waves, it gets closer and closer to your drawing\n Again, aside from the extra wigglyness, the wave looks pretty similar with just half of the sine waves.\n We can actually use the fact that the wave is pretty similar to our advantage. By using a Fourier transform, we can get the important parts of a sound, and only store those to end up with something that&#39;s pretty close to the original sound.\n   What we can do instead is represent it as a bunch of sine waves. Then we can compress the sound by ignoring the smaller frequencies. Our end result won&#39;t be the same, but it&#39;ll sound pretty similar to a person.\n  This is essentially what MP3s do, except they&#39;re more clever about which frequencies they keep and which ones they throw away.\n So in this case, we can use Fourier transforms to get an understanding of the fundamental properties of a wave, and then we can use that for things like compression.\n Ok, now let&#39;s dig more into the Fourier transform. This next part looks cool, but also gives you a bit more understanding of what the Fourier transform does. But mostly looks cool.\n  Now at the start, I said it splits things into sine waves. The thing is, the sine waves it creates are not just regular sine waves, but they’re 3D. You could call them &#34;complex sinusoids&#34;. Or just &#34;spirals&#34;.\n  If we take a look from the side, they look like sine waves. From front on, though, these look like circles.\n  So far everything we’ve been doing has only required the regular 2D sine waves. When we do a Fourier transform on 2D waves, the complex parts cancel out so we just end up with sine waves.\n But we can use the 3D sine waves to make something fun looking like this:\n   Well, we can think of the drawing as a 3D shape because of the way it moves around in time. If you imagine the hand being drawn by a person, the three dimensions represent where the tip of their pencil is at that moment. The x and y dimensions tell us the position, and then the time dimension is the time at that moment.\n  Now that we have a 3D pattern, we can&#39;t use the regular 2D sine waves to represent it. No matter how many of the 2D sine waves we add up, we&#39;ll never get something 3D. So we need something else.\n What we can use is the 3D spiral sine waves from before. If we add up lots of those, we can get something that looks like our 3D pattern.\n Remember, these waves look like circles when we look at them from front on. The name for the pattern of a circle moving around another circle is an epicycle.\n    Like before, we get a pretty good approximation of our pattern with just a few circles. Because this is a fairly simple shape, all the last ones do is make the edges a little sharper.\n All this applies to any drawing, really! Now it’s your chance to play around with it.\n    Again, you&#39;ll see for most shapes, we can approximate them fairly well with just a small number of circles, instead of saving all the points.\n Can we use this for real data? Well, we could! In reality we have another data format called SVG, which probably does a better job for the types of shapes we tend to create. So for the moment, this is really just for making cool little gifs.\n    Did you know Fourier transforms can also be used on images? In fact, we use it all the time, because that&#39;s how JPEGs work! We&#39;re applying the same principles to images – splitting up something into a bunch of sine waves, and then only storing the important ones.\n Now we&#39;re dealing with images, we need a different type of sine wave. We need to have something that no matter what image we have, we can add up a bunch of these sine waves to get back to our original image.\n To do that, each of our sine waves will be images too. Instead of a wave that&#39;s a line, we now have images with black and white sections. To represent the size of a wave, each image will have more or less contrast.\n We can also use these to represent color in the same way, but let&#39;s start with black-and-white images for now. To represent colorless images, we need some horizontal wave images,\n    By themselves, just horizontal and vertical images aren&#39;t enough to represent the types of images we get. We also need some extra ones that you get by multiplying the two together.\n    If we take the images, adjust their contrast to the right amount, and then add them up we can create any image.\n Let&#39;s start with this letter &#39;A&#39;. It&#39;s pretty small, but we need it to be small otherwise we&#39;ll end up with too many other images.\n  As we add more and more of these images, we end up with something that becomes closer and closer to the actual image. But I think you&#39;ll see the pattern here, as we get a reasonable approximation with just a few of them.\n    The image gets broken up into 8x8 chunks, and each chunk gets split up separately. We use a set of frequencies to determine how light or dark each pixel is, and then another two sets for the color, one for red-green, and another for blue-yellow. The number of frequencies that we use for each chunk determines the quality of the JPEG.\n Here&#39;s a real JPEG image, zoomed in so we can see the details. When we play with the quality levels we can see this process happen.\n    Fourier transforms are things that let us take something and split it up into its frequencies.\n   And we can also use them to make cool looking animations with a bunch of circles\n This is just scratching the surface into some applications. The Fourier transform is an extremely powerful tool, because splitting things up into frequencies is so fundamental. They&#39;re used in a lot of fields, including circuit design, mobile phone signals, magnetic resonance imaging (MRI), and quantum physics!\n  I skipped most of the math stuff here, but if you&#39;re interested in the underlying principles of how it works, here are some questions you can use to guide your research:\n What&#39;s the difference between a continuous time Fourier transform and a discrete time Fourier transform?\n  How do you do a Fourier transform of a whole song? (Rather than just a single note.)\n   An Interactive Guide To The Fourier TransformA great article that digs more into the mathematics of what happens.\n But what is the Fourier Transform? A visual introduction.A great Youtube video by 3Blue1Brown, also explaining the maths of Fourier transforms from an audio perspective.\n A Tale of Math &amp; Art: Creating the Fourier Series Harmonic Circles VisualizationAnother article explaining how you can use epicycles to draw a path, explained from a linear algebra perspective.\n    I&#39;m Jez! Full time I work at a  search company in the Bay Area, and in my spare time I like making games and interactive code things like this!\n This webpage is open-source, you can check out the code on  GitHub! If you have any feedback or want to ask any questions, feel free to email me at  fourier [at] jezzamon [dot] com, or shoot me a tweet on  Twitter.\n If you want to see more of my work, check out my  homepage, and if you want to see what I&#39;m making next, you can follow my Twitter account,  @jezzamonn!", "posttime": "2020-11-15 06:41:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变换,introduction,图像", "title": "傅里叶变换互动式导论", "title_en": "An Interactive Introduction to Fourier Transforms", "transed": 1, "url": "http://www.jezzamon.com/fourier/index.html", "via": "", "real_tags": ["变换", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这里有一些地方可以帮助你回答你最常被问到的问题\r关于维修、零配件和手册。\n标题说明了一切，这是收集器列表、数据列表、\r分类列表、邮件分发列表和论坛。\r如果你想买或卖计算器，那就参考分类的\r列表、邮件分发列表和论坛部分。\n已经有100多万个人电脑用户下载了Calc98，这是我们广受欢迎的免费工程，\r用于Windows的科学和金融计算器。该计算器包括以下功能\r统计，使用不同的基数(二进制、八进制、十六进制和基数n)，\r公制单位换算以及物理属性和常量。它有金融功能。\r包括投资、贷款和抵押贷款的计算。它还可以计算时间函数\r并具有秒表功能和RPN(反向波兰符号)。它在Microsoft Windows上运行\r(WindowsNT、Windows95/98/ME、Windows2000/XP)和WindowsCE(掌上电脑)。\n以下是一些非常有趣和非常常见的信息\r我拥有的台式机。\n这是我在《冬春时节》上发表的一篇关于电子显示屏的文章\r1997国际计算器\r收藏家。", "note_en": "Here are places that will help you with your most frequently asked questions \r concerning repairs, spare parts, and manuals.\n      The title says it all, this is a collection of Collector Lists, Data Lists,\r Classified Lists, Mail Distribution Lists, and Forums. \r  If you are wanting to buy or sell a calculator then reference the Classified\r Lists, Mail Distribution Lists, and Forums section.\n    Over a million PC users have already downloaded Calc98, our popular free engineering, \r scientific and financial calculator for Windows. The calculator includes functions for \r statistics, use of different number bases (binary, octal, hexadecimal and base-n), \r metric units conversions and physical properties and constants. It has financial functions \r including investment, loan and mortgage calculations. It also calculates time functions \r and has a stopwatch feature and RPN (Reverse Polish Notation). It runs on Microsoft Windows \r (WindowsNT, Windows95/98/ME, Windows2000/XP) and WindowsCE (Pocket PC).\n    Here is some information on some very interesting and some very common\r desktops that I own.\n        This is my article on Electronic Displays that appeared in the Winter-Spring\r 1997  International Calculator\r Collector.", "posttime": "2020-11-15 06:17:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "计算器,calculator", "title": "计算器参考", "title_en": "The Calculator Reference", "transed": 1, "url": "http://www.vcalc.net/index.html", "via": "", "real_tags": ["计算器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035193, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果推出MacOS Big Sur之后，几乎立刻就出现了服务器问题，导致用户无法在电脑上运行第三方应用。虽然人们很快就在Twitter上找到了解决办法，但也有人提出了一些与该问题相关的隐私问题。\n嗨，苹果用户：如果你现在遇到在Mac上运行应用程序挂起的问题，我用Little Snitch解决了这个问题。它信任连接到https://t.co/FzIGwbGRan，拒绝该连接修复它，因为OCSP是一个软故障。(断开互联网也可以修复。)。Pic.twitter.com/w9YciFltrb。\n-杰夫·约翰逊(@rapcatsoft)2020年11月12日。\nOCSP代表在线证书状态协议1。顾名思义，它用于验证证书的有效性，而无需下载和扫描大型证书吊销列表。MacOS使用OCSP来确保开发者证书在应用程序启动之前没有被吊销。\n正如杰夫·约翰逊在上面的推文中解释的那样，如果MacOS无法联系到苹果的OCSP响应器，它就会跳过检查，无论如何都会启动应用程序--这基本上是一种失效开放行为。问题是苹果的响应器没有掉下来；它是可以到达的，但变得非常慢，这阻止了软故障触发和放弃检查。\n显然，这一机制要求MacOS在应用推出前与苹果取得联系。公众突然意识到苹果的问题带来了这一事实，这引发了一些隐私问题，安全研究员杰弗里·保罗2(Jeffrey Paul 2)的一篇帖子在Twitter上非常流行。他声称。\n在当前版本的MacOS中，当你运行它时，操作系统会向苹果发送你运行的每个程序的散列(唯一标识符)。\n更糟糕的是，OCSP经常使用HTTP--我说的是端口80上的老旧的纯文本HTTP，而不是HTTPS的垃圾。这通常有一个很好的理由，当OCSP服务用于Web浏览器时，这一点就变得特别明显：防止循环。如果您使用HTTPS通过OCSP检查证书，则还需要使用OCSP检查HTTPS连接的证书。这意味着要打开另一个HTTPS连接，以此类推。\n当然，虽然OCSP不强制加密，但它确实要求服务器对响应进行签名。这仍然不能解决最初的担忧，即任何在你的网络上安装流量分析器的人都可能逃避你打开的每一个应用程序，以及当你打开它的时候。\n了解了一些OCSP基础知识后，就会出现更多的问题。OCSP是关于检查证书的；为什么这与发送您运行的应用程序的散列有什么关系？MacOS真的在每次启动时计算每个可执行文件的散列吗？大号的怎么样？这将需要相当长的时间；有没有可能没有人注意到呢？也许哈希值只计算一次(例如，第一次运行应用程序时)，然后将其存储在某个地方。但我并不信服，我认为这些说法需要更多的研究。\n捕获OCSP请求与设置HTTP代理或启动Wireshark一样简单。没有HTTPS意味着没有加密，没有证书锁定，没有任何问题。我在打开Firefox时捕获了以下请求。\n我还应该补充的是，在关闭Firefox并再次打开它之后，没有人提出任何请求。这是合理的，并且表明证书检查不是在每次启动时执行，而是在一段时间内没有执行之后才执行。\n该请求是一个非常简单的GET，它将有效负载包含为Base64编码的字符串。可以很容易地将实际的二进制数据转储到一个文件中：\n我们获得了一个80字节长的有效负载，它看起来一点也不像散列。果不其然，它不是。我们可以使用OpenSSL从二进制文件中提取可读信息。\nOCSP请求数据：版本：1(0x0)申请者列表：证书ID：散列算法：SHA1颁发者名称散列：3381D1EFDB68B085214D2EEFAF8C4A69643C2A6C颁发者密钥散列：5717EDA2CFDC7C98A110E0FCBE872D2CF2E31754序列号：06C794216C7A930。\n很明显，MacOS上的Trustd服务不会发送你启动的应用的哈希信息。相反，它只是发送有关某些证书的信息--正如我们在了解OCSP是什么之后肯定会预料到的那样。\n嗯，这并不能解决问题，不是吗？如果每个应用程序都有一个唯一的证书，那么仍然可以创建一个表，将每个序列号与相应的应用程序关联起来，因此这仍然是一个隐私问题。让我们来看看是不是这样。\n首先，我想确定这些信息来自哪个证书。我使用苹果的CoDesign实用程序从Firefox应用程序中提取证书，以便查找匹配的数据。\n该命令将创建几个名称为cosign0、cosign1等的文件。第一个文件是叶证书，而其他文件则属于证书链，直至根证书。CoDesign 0应该是我们正在寻找的，我们可以再次使用OpenSSL来提取有关它的一些信息。\n证书：数据：版本：3(0x2)序列号：488521955867797808(0x6c794216c7aa930)签名算法：sha256WithRSAEncryption颁发者：CN=开发者ID认证机构，OU=苹果认证机构，O=苹果公司，C=美国有效期不早：5月8日19：08：58 2017GMT不在：5月9 19：08：58 2022GMT主题：uid=43AQ936H96，CN=开发者ID。\n检查我们获得的序列号(0x6c794216c7aa930)，并将其与OCSP请求的有效负载进行比较。我们找到火柴了！这证明OCSP请求实际上发送了有关应用程序开发人员证书的信息。\n“那又怎样？”你可能会问。嗯，开发者证书对于每个应用程序来说并不是唯一的。再说一次，不要轻信我的话。雷鸟说：我们可以通过检查Mozilla的另一款应用的证书来快速验证这一点。\n证书：数据：版本：3(0x2)序列号：488521955867797808(0x6c794216c7aa930)签名算法：sha256WithRSAEncryption颁发者：CN=开发者ID认证机构，OU=苹果认证机构，O=苹果公司，C=美国有效期不早：5月8日19：08：58 2017GMT不在：5月9 19：08：58 2022GMT主题：uid=43AQ936H96，CN=开发者ID。\n这与Firefox使用的证书完全相同(当然！)。因此，杰弗里·保罗的分析并不十分准确--至少在这几个方面(强调我的观点)是不准确的。\n当你运行操作系统时，它会向苹果发送你运行的每个程序的散列(唯一标识符)。\n[IP地址]允许使用具有以下标题的表：日期、时间、计算机、ISP、城市、州、应用程序散列。\n[这意味着苹果知道]你在那里打开哪些应用程序，以及打开的频率。他们知道你什么时候在朋友家用Wi-Fi打开Premiere，也知道你什么时候在去另一个城市的旅途中打开酒店的Tor浏览器。\nMacOS确实发出了一些关于这些应用的开发者证书的不透明信息，从隐私的角度来看，这是一个相当重要的区别。\n我想澄清一些可能是这种误解的根源。事实上，有一种情况是MacOS实际上可以向苹果发送可执行文件的哈希，那就是当GateKeeper在第一次启动时检查苹果的服务器上是否存在公证票证，以防票证没有钉在应用程序3上。\n这与OCSP无关。它在特定情况下发生，检查通过位于api.apple-cloudkit.com的安全(HTTPS)端点执行。在此过程中，会向用户显示一个带有进度条的弹出窗口。\n在Apple的OCSP响应器中断期间，您可能已经了解到，您可以通过几种方式阻止OCSP请求，其中最流行的是Little Snitch 4和编辑您的/etc/hosts文件。就我个人而言，我不建议这样做，因为这会阻止一个重要的安全功能发挥作用。\n现在你已经知道了实际情况，如果你认为这个功能比在你的系统上运行潜在的未被检测到的恶意软件更会危及你的隐私，那就继续吧。否则，就别费心了。\n如果你使用MacOS Big Sur，拦截OCSP可能不是那么简单。然而，在抱怨阴谋之前，请记住，普通用户通常不能完全理解和评估禁用计算机上如此复杂和微妙的安全功能的影响。\n不，MacOS不会在你每次运行你的应用程序时向苹果发送这些应用程序的哈希。\n你应该知道，MacOS可能会传输一些关于你运行的应用程序的开发者证书的不透明信息。此信息在您的网络上以明文形式发送。\n您可能不应该使用Little Snitch或在Hosts文件中阻止ocsp.apple.com。", "note_en": "Apple’s launch of macOS Big Sur was almost immediately followed by server issues which prevented users from running third-party apps on their computers. While a workaround was soon found by people on Twitter, others raised some privacy concerns related to that issue.\n  Hey Apple users:  If you&#39;re now experiencing hangs launching apps on the Mac, I figured out the problem using Little Snitch.  It&#39;s trustd connecting to  https://t.co/FzIGwbGRan  Denying that connection fixes it, because OCSP is a soft failure.  (Disconnect internet also fixes.)  pic.twitter.com/w9YciFltrb\n— Jeff Johnson (@lapcatsoftware)  November 12, 2020\n   OCSP stands for Online Certificate Status Protocol  1. As the name implies, it is used to verify the validity of a certificate without having to download and scan large certificate revocation lists. macOS uses OCSP to make sure that the developer certificate  hasn’t been revoked before an app is launched.\n As Jeff Johnson explains in his tweet above, if macOS cannot reach Apple’s OCSP responder it skips the check and launches the app anyway - it is basically a fail-open behaviour. The problem is that Apple’s responder didn’t go down; it was reachable but became extremely slow, and this prevented the soft failure from triggering and giving up the check.\n It is clear that this mechanism requires macOS to  contact Apple before an app is launched. The sudden public awareness of this fact, brought about by Apple’s issues, raised some privacy concerns and a post from security researcher  Jeffrey Paul  2 became very popular on Twitter. He claims that\n In the current version of the macOS, the OS sends to Apple a hash (unique identifier) of each and every program you run, when you run it.\n  To make things worse, it is common for OCSP to use HTTP - I’m talking about  good old  plaintext HTTP on port 80, none of that HTTPS rubbish. There is usually a good reason for this, that becomes especially clear when the OCSP service is used for web browsers: preventing loops. If you used HTTPS for checking a certificate with OCSP then you would need to also check the certificate for the HTTPS connection using OCSP. That would imply opening another HTTPS connection and so on.\n Of course while OCSP does not mandate encryption, it does require that responses are signed by the server. This still doesn’t solve the initial concern that anyone with a traffic analyzer on your network could evasdrop every app you open and when you open it.\n  Knowing some OCSP basics, more questions arise. OCSP is about checking certificates; why should this have anything to do with sending out   hashes of apps you run? Does macOS really compute the hash of each executable at each launch? What about very large ones? That would take a significant amount of time; is it possible that nobody noticed? Maybe the hash is computed only once (e.g. the first time you run the app) and it is stored somewhere. But I’m not convinced and I think these claims needs more research.\n Capturing a OCSP request is as easy as setting up an HTTP proxy or starting Wireshark. No HTTPS means no encryption, no certificate pinning, no problems whatsoever. I captured the following request while opening Firefox.\n  I should also add that after closing Firefox and opening it again, no requests were made. This is reasonable, and indicates that certificate checking isn’t performed at each launch but only after it hasn’t been performed for a certain period of time.\n The request is a very simple GET that contains the payload as a base64-encoded string. The actual binary data can be easily dumped to a file:\n  We obtain an 80-byte-long payload that looks nothing like a hash. Sure enough, it isn’t. We can use OpenSSL to extract readable information from the binary file.\n  OCSP Request Data: Version: 1 (0x0) Requestor List: Certificate ID: Hash Algorithm: sha1 Issuer Name Hash: 3381D1EFDB68B085214D2EEFAF8C4A69643C2A6C Issuer Key Hash: 5717EDA2CFDC7C98A110E0FCBE872D2CF2E31754 Serial Number: 06C794216C7AA930\n It is clear that the  trustd service on macOS doesn’t send out a hash of the apps you launch. Instead, it just sends information about some certificate - as we would certainly expect after understanding what OCSP is in the first place.\n Well, this does not solve the problem, does it? If each app has a unique certificate, then it would still be possible to create a table that associates each serial number to the corresponding app, and thus this would still be a privacy concern. Let’s check if this is the case.\n  First of all I would like to determine from which certificate this information comes from. I used Apple’s  codesign utility to extract certificates from the Firefox app in order to look for matching data.\n  This command results in several files being created with names  codesign0,  codesign1, etc. The first one is the leaf certificate, while others belong to the certificate chain up until the root.  codesign0 should be what we are looking for, and once again we can use OpenSSL to extract some info about it.\n  Certificate: Data: Version: 3 (0x2) Serial Number: 488521955867797808 (0x6c794216c7aa930) Signature Algorithm: sha256WithRSAEncryption Issuer: CN=Developer ID Certification Authority, OU=Apple Certification Authority, O=Apple Inc., C=US Validity Not Before: May 8 19:08:58 2017 GMT Not After : May 9 19:08:58 2022 GMT Subject: UID=43AQ936H96, CN=Developer ID Application: Mozilla Corporation (43AQ936H96), OU=43AQ936H96, O=Mozilla Corporation, C=US ...\n Check the serial number we got ( 0x6c794216c7aa930) and compare it with the payload of the OCSP request. We have a match! This proves that OCSP requests actually send out information about the app developer certificate.\n  “So what?” you might ask. Well, developer certificates aren’t unique for each app. Once again, don’t take my word for it. We can quickly verify this by checking the certificate of a different app from Mozilla, say Thunderbird.\n  Certificate: Data: Version: 3 (0x2) Serial Number: 488521955867797808 (0x6c794216c7aa930) Signature Algorithm: sha256WithRSAEncryption Issuer: CN=Developer ID Certification Authority, OU=Apple Certification Authority, O=Apple Inc., C=US Validity Not Before: May 8 19:08:58 2017 GMT Not After : May 9 19:08:58 2022 GMT Subject: UID=43AQ936H96, CN=Developer ID Application: Mozilla Corporation (43AQ936H96), OU=43AQ936H96, O=Mozilla Corporation, C=US ...\n That’s exactly the same certificate used for Firefox (of course it is!). So Jeffrey Paul’s analysis isn’t quite accurate - at least for what concerns these parts (emphasis mine).\n The OS sends to Apple a hash (unique identifier) of each and every program you run, when you run it.\n [An IP address] allows for a table that has the following headings:Date, Time, Computer, ISP, City, State,  Application Hash\n [This means that Apple knows] what apps you open there, and how often. They know when you open Premiere over at a friend’s house on their Wi-Fi, and they know when you open Tor Browser in a hotel on a trip to another city.\n macOS does actually send out some opaque information about  the developer certificate of those apps, and that’s quite an important difference on a privacy perspective.\n  I would like to clarify something that is probably at the root if this misunderstanding. In fact, there exists a situation where macOS can actually send Apple the hash of an executable, and that is when  Gatekeeper checks if a notarization ticket exists on Apple’s servers upon first launch, in case the ticket isn’t stapled to the app  3.\n This has nothing to do with OCSP. It happens under specific circumstances and the check is performed via a secure (HTTPS) endpoint located at  api.apple-cloudkit.com. During this process, a pop-up with a progress bar is shown to the user.\n  As you probably have already learned during Apple’s OCSP responder outage, you can block OCSP requests in several ways, the most popular ones being Little Snitch  4 and editing your  /etc/hosts file. Personally, I wouldn’t suggest doing that as it prevents an  important security feature from working.\n Now that you know the actual facts, if you think your privacy is put at risk by this feature more than having potential undetected malware running on your system, go ahead. Otherwise, don’t bother.\n If you use macOS Big Sur, blocking OCSP might not be as trivial. Before crying conspiracy, however, keep in mind that common users are generally not able to fully understand and evaluate the impact of disabling such a complex and delicate security feature on their computer.\n  No, macOS  does not send Apple a hash of your apps each time you run them.\n You should be aware that macOS  might transmit some opaque information about the developer certificate of the apps you run. This information is sent out in clear text on your network.\n You shouldn’t probably block  ocsp.apple.com with Little Snitch or in your hosts file.", "posttime": "2020-11-15 06:17:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apple,苹果,记录,log,证书", "title": "苹果真的会记录你运行的每一款应用吗？技术面貌", "title_en": "Does Apple really log every app you run? A technical look", "transed": 1, "url": "https://blog.jacopo.io/en/post/apple-ocsp/", "via": "", "real_tags": ["apple", "苹果", "记录", "log", "证书"]}, {"category": "", "categoryclass": "", "imagename": "ea03d2192e2e1b7566b5fd4faf71d711.jpg", "infoid": 1035192, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "博士生卡米拉·戈麦斯(Camila Gomez)在实验室里模仿了塔塔钢铁(Tata Steel)高炉的冷却过程，发现最好用更温暖的水降温。在平轧成所需厚度的板坯后进行红热冷却是一项相当精细的操作。博士生卡米拉·戈麦斯(Camila Gomez)在她的实验室里模仿了塔塔钢铁(Tata Steel)高炉的冷却过程，并了解到使用更温暖的水可以更好。\n在IJmuiden的塔塔钢铁公司的高炉里，温度在1200摄氏度左右的厚钢板坯从大约20厘米厚的板坯到只有几厘米厚的板坯，分不同阶段进行平轧。在几秒钟内，这些厚板必须冷却到可以卷成一个巨大的厕纸卷的程度。\n卡米拉·戈麦斯(Camila Gomez)解释说，为了冷却钢材，厚板会在水流很高的情况下通过。落在钢材上的水开始沸腾，并迅速从材料中吸收热量。板坯冷却的准确速度和均匀程度将决定材料的最终特性，因此这是一个相当微妙的过程。\n在轧制过程中，钢板的长度从20米增长到200多米，这也是为什么它们的移动速度增加了十倍。最后，钢材以每小时近80公里的速度通过水柱；由于冷却过程是以极高的速度进行的，因此很难在工厂进行研究。\n尽管如此，为了更好地调整工业流程以适应新型钢的生产，准确地了解钢表面附近的冷却水发生了什么是很重要的。因此，出生于阿根廷并在10岁时移民到西班牙的戈麦斯，在NWO、塔塔钢铁和TU/e的合作下被要求进行一项测试，以详细分析冷却水与热钢接触后如何开始沸腾。\n戈麦斯说，到目前为止，只有一些实验是用静止的、移动缓慢的装置进行的。我们现在已经在双子座的实验室里建立了一套装置，可以让我们在水柱下以每小时近30公里的速度移动一块滚烫的钢材，同时我们可以用高速摄像机在接近地表的地方进行记录。为此，她使用了一种所谓的内窥镜，相当于用来对身体进行内部医疗检查的内窥镜，她把它放在了水柱里。\n她发现，冷却水可以与温度不低于900度的钢材接触。这是一个谜，因为你会认为水会迅速升温到300摄氏度，之后就会以爆炸性的方式蒸发。我们现在已经看到，蒸汽泡的形成确实发生在局部，但这些气泡随后会内爆，因为冷水落在它们上面。这一过程每秒发生多达4万次--只有当你以高帧速率记录并逐个研究这些图像时，你才能检测到这一过程。\n就她而言，这一发现是她博士项目最伟大的科学成果。然而，最重要的是，还有另一项可能具有严重实际意义的发现。当表面由于持续的局部蒸汽爆炸而没有均匀冷却时，就会导致缺陷和钢材质量下降。因此，你想要尽可能均匀地冷却钢材。我们的测量表明，变暖可以让你在钢材上方形成一个稳定的水蒸汽层。诚然，这会放慢进程，但它确实会产生更好的结果。\n当戈麦斯将水温从25度提高到60度时，她能够在她的测试装置中将钢材进一步冷却50度，而不会进入不稳定的区域。她说，这些知识对钢铁制造商来说可能很有价值，因为温度可以很容易地调整，而不必改变整条生产线。引用：用温水冷却烧红的钢(2020年11月9日)，从https://phys.org/news/2020-11-cooling-red-hot-steel.html检索到。\n本文档受版权保护。除为私人学习或研究的目的而进行的任何公平交易外，未经书面许可不得复制任何部分。提供的内容仅供参考。", "note_en": "Ph.D. student Camila Gomez mimicked the cooling process of Tata Steel&#39;s blast furnaces in the lab and found out that it&#39;s better to cool with warmer water.    Cooling red-hot   after it has been flat-rolled into slabs of the desired thickness is a rather delicate operation. Ph.D. candidate Camila Gomez copied the cooling process of Tata Steel&#39;s blast furnaces in her lab, and learned that using warmer water can be better.\n  In the blast furnaces at Tata Steel in IJmuiden, thick slabs of steel with a temperature of around 1200 degrees Celsius are flat-rolled in various stages from slabs with a thickness of approximately 20 centimeters to just a few centimeters. Within a few seconds, these slabs have to be cooled to such an extent that they can be rolled into something resembling a huge toilet paper roll.\n  In order to cool the steel, the slabs pass underneath water flowing at high  , Camila Gomez explains. &#34;The water that falls on the steel starts to boil and rapidly extracts heat from the material. The exact speed and uniformity with which the slab cools will determine the material&#39;s eventual characteristics, so it&#39;s a rather delicate process.&#34;\n    During the rolling process, the steel slabs grow in length from 20 to more than 200 meters, which is also why the speed at which they move increases ten-fold. &#34;At the end, the steel passes through the jets of water at a speed of almost 80 kilometers per hour; since the cooling process thus takes place at an extremely high speed, it&#39;s difficult to study it at the factory.&#34;\n   Still, in order to better adjust the industrial process to the production of new types of steel, it&#39;s important to know exactly what happens to the cooling water near the steel&#39;s surface. So Gomez, who was born in Argentina and emigrated in Spain at the age of 10, was asked within a collaboration between the NWO, Tata Steel and TU/e to make a test setup to analyze in detail how the cooling water starts to boil once it comes into contact with hot steel.\n  &#34;Until now, there had been only experiments using stationary and slow-moving setups,&#34; Gomez says. &#34;We&#39;ve now built a setup in the lab in Gemini that allows us to move a piece of hot steel underneath a jet of water at a speed of almost 30 kilometers per hour as we make recordings close to the surface using high-speed cameras.&#34; She used a so-called borescope for this, comparable to an endoscope for internal medical examination of the body, which she placed in the jets of water.\n    She found that the cooling water can come into contact with steel with a temperature of no less than 900 degrees. &#34;That was a kind of mystery, because you would expect the water to heat up rapidly to 300 degrees, after which it evaporates in an explosive manner. We&#39;ve now seen that vapor bubble formation does indeed occur locally, but that these bubbles subsequently implode because the cold water falls down on them. That occurs up to 40,000 times per second—a process you can detect only when you record at a high frame rate and study those images one by one.&#34;\n  That discovery is the greatest scientific result of her doctoral project, as far as she&#39;s concerned. However, on top of that, there is another discovery that might have serious practical implications. When the surface does not cool uniformly due to constant local vapor explosions, it results in imperfections and steel of lesser quality. &#34;Therefore, you want to cool the steel as evenly as possible. Our measurements show that warmer   allows you to create a stable water vapor layer above the steel. Admittedly, that slows down the   process, but it does produce a better result.&#34;\n  When Gomez raised the water temperature from 25 to 60 degrees, she was able to cool the steel in her test setup a further 50 degrees without entering the unstable regime. This is knowledge that could be of high value to steel manufacturers, she says, since the   temperature can be easily adjusted without having to alter the entire production line.           Citation: Cooling red-hot steel with warm water (2020, November 9) retrieved 14 November 2020 from https://phys.org/news/2020-11-cooling-red-hot-steel.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2020-11-15 06:17:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "钢材,steel", "title": "用温水而不是冷水冷却红热钢材可提高钢材质量", "title_en": "Cooling red-hot steel with warm rather than cold water improves steel quality", "transed": 1, "url": "https://phys.org/news/2020-11-cooling-red-hot-steel.html", "via": "", "real_tags": ["钢材", "steel"]}, {"category": "", "categoryclass": "", "imagename": "714466f98fdc569cf4ea2798163142b8.jpeg", "infoid": 1035191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "分析显示，在检测呈阳性的患者中，在3个月内确诊的人数几乎翻了一番。", "note_en": "Analysis shows nearly twice as many diagnoses over 3 months among those testing positive", "posttime": "2020-11-15 05:54:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "患者,patients,阳性", "title": "研究称18%的Covid患者后来被诊断为精神疾病", "title_en": "Study Claims 18% of Covid Patients Later Diagnosed with Mental Illness", "transed": 1, "url": "https://www.irishtimes.com/news/health/study-claims-18-of-covid-patients-later-diagnosed-with-mental-illness-1.4405310", "via": "", "real_tags": ["患者", "patients", "阳性"]}, {"category": "", "categoryclass": "", "imagename": "e4d87fcd4fd381146b3511ea336bd34d.jpeg", "infoid": 1035189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为Facebook Inc.。和推特公司(Twitter Inc.)。对未经证实的总统选举舞弊指控采取了更强硬的立场，这两个平台上的知名保守派都以愤怒和频繁的反驳作为回应：跟我聊聊吧。\n根据谷歌和分析公司App Annie的数据，这个2018年推出的倾向于自由意志主义的社交网络在上周的大部分时间里都是安卓和苹果设备上下载量最大的应用。它的领导人将其设想为硅谷巨头之外一个专注于言论自由的替代品。\n..。", "note_en": "As Facebook Inc. and Twitter Inc. have taken a harder line against unsubstantiated claims of a stolen presidential election, prominent conservatives on both platforms have responded with anger and a frequent retort: Follow me on Parler.\n  Launched in 2018, the libertarian-leaning social network was the most downloaded app on both Android and Apple devices for most of last week, according to data from Google and analytics firm App Annie. Its leaders envision it as a free-speech-focused alternative to the giants of Silicon Valley.\n...", "posttime": "2020-11-15 05:49:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "家族,backed", "title": "在美世家族的支持下，帕勒在FB，Twitter上为保守党Mad服务", "title_en": "Parler, Backed by Mercer Family, Makes Play for Conservatives Mad at FB, Twitter", "transed": 1, "url": "https://www.wsj.com/articles/parler-backed-by-mercer-family-makes-play-for-conservatives-mad-at-facebook-twitter-11605382430", "via": "", "real_tags": ["家族", "backed"]}, {"category": "", "categoryclass": "", "imagename": "f2128df097420969b0d968a9f2af72fb.jpg", "infoid": 1035188, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你想了解更多关于Microsoft Azure上的CUTUS，请阅读这篇关于Azure Database for PostgreSQL上的Hyperscale(CATUS)的文章。\n跳过导航当我今年在FOSDEM的Postgres研发室做开场演讲时，其中一个问答问题是：“Postgres的Ctes开源扩展进展如何？”答案是，很多。自从FOSDEM以来，Marco Slot和我一直在博客上谈论Citus9.2如何在Postgres上加速大规模HTAP工作负载，Citus9.3发行说明，以及Citus9.4中的新特性。\n现在是时候了解一下Citus9.5开放源码版本中的所有新内容了。\n附注：如果您刚接触CITUS并想知道它是什么，简短的答案是CUTUS是Postgres的扩展，它将Postgres转换为分布式数据库-跨多个节点分布您的数据和查询。CATUS以开源、内部企业软件的形式提供，在云中以Hyperscale(CATUS)的形式提供，这是Azure上托管Postgres数据库服务的内置部署选项。\n如果您喜欢列表，在CitHub开放源码资源库中有一个更长的列表，其中包含47个修复和改进的更改日志，其中包含CTURS v9.5.0。\nCitus9.5中新增功能的高级概述包括以下8个方面：\n赛图斯9.5是Postgres 13发布后发布的第一个版本的赛图斯。因此，我们在Citus9.5中添加了对PostgreSQL13的支持，这样您就可以利用所有最新的Postgres特性。\nPostgres 13中一些值得注意的特性包括许多查询性能改进；索引性能改进(考虑：更快、更小的索引)；索引的并行清理；基于磁盘的散列聚合(这意味着内存不足错误更少)；以及使用并列获取前10个。Postgres 13中还有一些甜蜜的性能提升，这要归功于Postgres查询规划器和分区的改进。\n您可以在我们的CUTUS下载页面上找到更新的安装说明，该页面现在包括Citus9.5和Postgres 13包。\nCATUS通过为每个CITUS工作节点打开多个Postgres连接并同时在所有分片上操作来并行化命令。通过使用多个连接，CITUS有效地支持任何类型的Postgres命令的并行性。COPY命令在很大程度上得益于CITUS的并行性：使您能够利用所有CITUS工作节点的计算、内存和网络带宽，从而显著提高复制性能。\n这种方法的一个缺点是Postgres中的连接是一种稀缺资源--当您的应用程序向CITUS分布式数据库发送许多命令时，这可能会导致大量连接到CITUS工作节点。\nCitus9.3 使用一种称为“自适应连接管理”( )的技术解决了这个问题， 会自动限制分布式Postgres查询的每个工作节点的连接总数。\n在CATUS 9.5中，我们扩展了这一逻辑，使其也适用于分布式CITUS表上的复制命令。这意味着您现在可以同时运行数百个复制命令，而不会有出错的风险，也不会有导致重大性能损失的风险。\n在未来，更好的消息是，我们团队中的一位Postgres提交者Andres Freund已经在Postgres 14中提供了大量的连接可伸缩性改进 。然而，由于Postgres 14中的这些连接可伸缩性改进要到2021年秋天才能实现，Citus9.5中新的自适应复制连接管理应该会对您非常有用。\n你们中的许多人都要求这个特性，我们很高兴能在Citus9.5中推出这个特性。\n当使用Ctes分发Postgres数据库时，您需要做出的一个重要早期决定是：“您的分发列是什么？”(有些人还将“分发栏”称为“分发键”或“分片键”。如果您仍在学习分片，并且仍在决定您的分发列应该是什么，那么有关选择分发列的文档是一个很好的资源。)\n分发列是您在创建_Distributed_table时需要做出的一个重要选择，但是--当您第一次开始时--最佳分发列并不总是一目了然。\n而且，因为您不一定需要分发所有Postgres表(您可能会选择将一些表作为本地Postgres表保留在Citus协调器节点上)，所以有时候是否分发一个表并不是一目了然的。\n你们中的许多人都要求使用CATUS函数将分布式表转换回本地Postgres表(当然，并保留所有数据)。有点像CREATE_DISPLATED_TABLE的简单ctrl-Z组合键。从Citus9.5开始，我们现在添加了一个名为UNDISTRIBUTE_TABLE的函数，它可以将分布式表转换回本地表。\n例如，现在只需两个简单的步骤即可更改CITUS分发列(也称为分发密钥)：\n--创建按键分区的分布表。\n创建表项(user_id bigint，key text，value jsonb not null，main key(user_id，key))；\n选择CREATE_DISTRIBTED_TABLE(&#39；Items&#39；，&#39；Key&#39；)；\n--实际上，最好使用用户ID，这样我就可以有效地连接其他按用户ID分配的表。\n选择UNDISTRIBUTE_TABLE(&#39；项目&#39；)；\n选择CREATE_DISTRIBTED_TABLE(&#39；Items&#39；，&#39；user_id&#39；)；\n存储过程调用委派是在多租户应用程序中加速存储过程的一种强大技术，因为存储过程允许CITUS在单个网络往返过程中将整个过程调用委派给一个工作节点。\n我们的解决方案架构师发现，存储过程只对CUTUS引用表进行操作是很常见的。他们告诉我们，能够在CITUS数据库集群中所有工作节点上的引用表的所有副本之间实现这些过程调用的负载平衡将是非常有用的-这有效地代表了扩展CITUS数据库的一种新方式。\n将来，我们希望能够自动委派和负载平衡过程调用，但目前我们启用了负载平衡，允许您将分布式函数与引用表放在同一位置，并将TASK_ASSIGNMENT_POLICY设置为循环。\n使用这种技术，只要存储过程只从引用表中读取数据，您就可以水平地扩展存储过程中的计算工作。这种技术的可伸缩性特征类似于Postgres中的读副本，但没有所有缺点(例如，您仍然可以写入，并且仍然可以获得读写一致性)。\n我们希望大多数使用CITUTS的用户都会对这一新功能感到满意。\n当您为分布式查询运行EXPLAIN ANALYE时，CITUS会显示它在查询工作节点上的一个碎片时获得的EXPLAIN ANALYE输出。其中一个分片上的查询可能比其他分片上的查询慢得多，在这种情况下，EXPLAIN ANALYSE输出在过去根本解释不了太多。\n从Citus9.5开始，我们总是显示最慢的任务。当您将CITUS.EXPLAIN_ALL_TASKS设置为ON时，我们还会按执行时间对任务进行排序。\n在过去的6个月里，我们的CUTUS开源团队显著改进了早期捕获错误的程序。(1)根据我们的观察，在合并新功能后的几周内发现了许多错误，因此我们将发布流程正式化。(2)我们开始更好地利用 SQLancer等自动化工具。以及(3)我们重新调整了现有自动化测试的用途，以应用于新的场景。作为这些努力的结果--结合使用Hyperscale(Ctes)的Postgres新客户的经验，他们正在以新的方式锻炼CITUS-我们发现了一些新的微妙的错误。所以我们暂停了通常的发布周期，专注于修复尽可能多的错误。 最终，我们修复了超过25个问题。\n在Citus9.5中，我们决定处理一个重构项目--我们从CitusS中删除了一个称为任务跟踪器的组件，从而减少了代码库的大小。任务跟踪器基于 中的HadoopTaskTracker，是在每个工作节点上运行的任务调度器。任务跟踪器执行器通过这些任务调度器调度复杂的重新分区联接。\n任务跟踪器方法在处理间歇性故障和避免某些网络往返方面有一些理论上的好处。然而，实施并没有得到很好的优化。而Hadoop Marco(他有这方面的历史)告诉我，我们没有改进它是因为架构上的缺陷：像 一样，任务跟踪器不适合分布式事务。\n在2020年初的PostgresCitus9.2版本中，我们更改了重新分区联接逻辑，开始使用新的PostgresCitus自适应执行器，它封装了我们多年来在 服务器上运行并行、分布式事务的许多知识。因此，受Hadoop启发的任务跟踪器已经过时，是时候说再见了！\n删除任务跟踪器代码意味着我们能够从组成CUTUS开源引擎的大约140k行C代码中删除大约7k行代码。因此，我们需要维护的代码更少，错误更少，测试执行速度更快，新开发人员可以了解的简化代码库，以及更快的调试周期。\n在Citus9.3的博客文章中，我们提到了另一个特性的副作用，CATUS分布式表现在可以完全位于CATUS协调器节点上。这意味着所有的分片都可以位于CATUS协调器节点上，并且Postgres查询将会正常工作。\nCitus9.5修复了一些错误，并为该功能添加了更多自动化测试。我们认为这种在单个节点上运行分布式CATUS集群的能力对测试非常有用，我们希望您能就我们将来是否应该将其作为一个完全受支持的特性提供反馈。\n如果您想要获得预览，可以运行以下SQL命令。运行这些命令后，可以在单个服务器上创建分布式表。\n--将协调员添加到组为0的元数据。\n选择MASTER_ADD_NODE(&#39；协调员.hostname&#39；，5432，GroupID：=0)；\n\n--将协调员添加到组为0的元数据。\nSELECT MASTER_SET_NODE_PROPERTY(&#39；LOCALHOST&#39；，5432，&#39；HALD HARDS&#39；，TRUE)；\n许多小的改进加起来就是很大的进步(或者，解决问题，行动更快)\n我们的CITUS开源团队(也就是内部的“CUTUS引擎团队”)继续为不断改进CITUS的用户体验、性能和可靠性所做的工作而惊叹不已。在下一版的西图斯中，还有更令人兴奋的事情要做。\n如果您有数据密集型应用程序(或快速增长的多租户SaaS应用程序)，并希望横向扩展Postgres，CUTUS开源文档确实是一个很好的入门位置，其中包括实时分析应用程序、多租户应用程序和时序工作负载的教程。而且因为CATUS是开放源码的，所以下载CITUS包来试用也很容易。现在有了Postgres 13支持！\n一定要加入我们的西图斯·斯拉克，参加关于西图斯的社区讨论。\n如果你有兴趣阅读更多来自我们团队的帖子，请注册我们的每月时事通讯，并将最新内容直接发送到你的收件箱。", "note_en": "If you want to learn more about Citus on Microsoft Azure, read this  post about Hyperscale (Citus) on Azure Database for PostgreSQL.\n    Skip navigation            When I gave the kickoff talk in the Postgres devroom at FOSDEM this year, one of the Q&amp;A questions was: “what’s happening with the Citus open source extension to Postgres?” The answer is, a lot. Since FOSDEM, Marco Slot and I have blogged about how  Citus 9.2 speeds up large-scale htap workloads on Postgres, the  Citus 9.3 release notes, and  what’s new in Citus 9.4.\n  Now it’s time to walk through everything new in the Citus 9.5 open source release.\n  Side-note: If you’re new to Citus and are wondering what it is, the short answer is that  Citus is an extension to Postgres that transforms Postgres into a distributed database—distributing your data and your queries across multiple nodes. Citus is available as  open source, as on-prem enterprise software, and in the cloud as  Hyperscale (Citus), a built-in deployment option for the  managed Postgres database service on Azure.\n    If you like bullets, there is a much longer bulleted list of 47 fixes and improvements in the  CHANGELOG for Citus v9.5.0 in the  Citus open source GitHub repo.\n  A high-level overview of what’s new in Citus 9.5 encompasses these 8 buckets:\n        Citus 9.5 is the first version of Citus to come out after the  Postgres 13 release. So we added support for PostgreSQL 13 into Citus 9.5, so you can take advantage of all the  latest Postgres features.\n  Some of the notable features in Postgres 13 include the many query performance improvements; index performance improvements (think: faster and smaller indexes); parallel vacuuming of indexes; disk-based hash aggregation, which means fewer out of memory errors; and  FETCH FIRST 10 WITH TIES. There are also some sweet performance gains in Postgres 13 due to improvements in the Postgres query planner &amp; also to partitioning.\n    You can find updated installation instructions on our  Citus download page that now include the Citus 9.5 and Postgres 13 packages.\n    Citus parallelizes commands by opening multiple Postgres connections per Citus worker node and operating on all the shards simultaneously. By using multiple connections, Citus efficiently supports parallelism for any type of Postgres command. The  COPY command benefits from the parallelism of Citus in a big way: enabling you to utilize the compute, memory, and network bandwidth of all of the Citus worker nodes, thereby improving COPY performance significantly.\n  A downside of this approach is that  connections in Postgres are a scarce resource—and when your application sends many commands to the Citus distributed database, this can lead to a very large number of connections to the Citus worker nodes.\n  Citus 9.3 addressed this using a technique called “adaptive connection management”,  which automatically limits the total number of connections per worker node for distributed Postgres queries.\n  In Citus 9.5, we have expanded this logic to also work for  COPY commands on distributed Citus tables. That means you can now run hundreds of  COPY commands simultaneously without the risk of running into errors, without the risk of incurring significant performance penalties.\n  In the future, the even better news is that one of the  Postgres committers on our team, Andres Freund, has delivered substantial  connection scalability improvements into Postgres 14. However, since these connection scalability improvements in Postgres 14 won’t be available until autumn of 2021, the new adaptive connection management for  COPY in Citus 9.5 should prove quite useful to you.\n    Many of you have requested this feature and we’re so happy to roll this out in Citus 9.5.\n  When distributing your Postgres database with Citus, one of the important early decisions you need to make is: “what will your distribution column be?” (Some people also refer to the “distribution column” as a “distribution key” or a “sharding key.” If you’re still learning about sharding and still deciding what your distribution column should be, the documentation on  choosing the distribution column is a great resource.)\n  The distribution column is an important choice you need to make when you  create_distributed_table, and yet—when you first get started—it’s not always immediately obvious what the best distribution column is.\n  And because you don’t necessarily need to distribute all of your Postgres tables (you might choose to leave a few of the tables as local Postgres tables on the Citus coordinator node), well, sometimes it’s not immediately obvious whether to distribute a table at all.\n  So many of you have asked for a Citus function to turn a distributed table back into a local Postgres table (and keep all the data, of course.) Sort of like an easy ctrl-Z for  create_distributed_table. As of Citus 9.5, we have now added a function called  undistribute_table that turns a distributed table back into a local table.\n  For instance, you can now  change a Citus distribution column (aka the distribution key) in two simple steps:\n  -- create a distributed table partitioned by key\n CREATE  TABLE  items  ( user_id  bigint ,  key  text ,  value  jsonb  not  null ,  primary  key  ( user_id ,  key ));\n SELECT  create_distributed_table ( &#39;items&#39; ,  &#39;key&#39; );\n\n -- actually, it&#39;s better to use user ID such that I can efficiently join with other tables distributed by user ID\n SELECT  undistribute_table ( &#39;items&#39; );\n SELECT  create_distributed_table ( &#39;items&#39; ,  &#39;user_id&#39; );\n    Stored procedure call delegation is a powerful technique for speeding up stored procedures in multi-tenant applications because stored procedures allow Citus to delegate the whole procedure call to a worker node in a  single network round trip.\n  Our solutions architects discovered it is quite common for stored procedures to operate only on Citus reference tables. And they told us it would be useful to be able to load-balance those procedure calls across all the copies of the reference table(s) on all the worker nodes in a Citus database cluster—which effectively represents a new way of scaling the Citus database.\n  In the future, we’d like to be able to delegate and load-balance procedure calls automatically, but for now we enabled load-balancing by allowing you to co-locate your distributed function with a reference table and  SET task_assignment_policy to &#39;round-robin&#39;.\n    With this technique, you can horizontally scale the compute work in the stored procedure as long as the stored procedure only reads from reference tables. The scalability characteristics of this technique are similar to that of read replicas in Postgres, but without all the downsides (e.g. you can still write, and you can still get read-your-writes consistency).\n    We expect most of you who use Citus will be happy about this new feature.\n  When you run  EXPLAIN ANALYZE for a distributed query, Citus shows the  EXPLAIN ANALYZE output it gets when querying one of the shards on the worker node. It could happen that the query is much slower on one of the shards than on others, in which case the  EXPLAIN ANALYZE output did not explain much at all in the past.\n  As of Citus 9.5, we always show the slowest task instead. When you set  citus.explain_all_tasks to on, we also sort the tasks by execution time.\n    Over the past 6 months, our Citus open source team has significantly improved our procedures for catching bugs early. (1) We formalized our release process based on observations that many bugs were found in the weeks immediately after merging a new feature. (2) We started making better use of automated tools such as  SQLancer. And (3) we repurposed existing automated tests to apply to new scenarios. As a result of these efforts—combined with learnings from new Postgres customers using  Hyperscale (Citus) who were exercising Citus in new ways—we discovered some new and subtle bugs. So we took a pause from our usual release cycle and focused on fixing as many bugs as we could. In the end, we fixed over 25 issues.\n      In Citus 9.5, we decided to tackle a refactoring project—and we reduced the size of our code base by removing a component called the task tracker from Citus. The task tracker was based on  TaskTracker in Hadoop and was a task scheduler that ran on each worker node. The task tracker executor scheduled complex re-partition JOINs via these task schedulers.\n  The task tracker approach has some theoretical benefits for handling intermittent failure and avoiding some network round trips. However, the implementation was not well-optimized. And Marco (who has the history on this item) tells me we did not improve it because of an architectural shortcoming: Like Hadoop, task tracker is not suitable for distributed transactions.\n  In early 2020 in the  Citus 9.2 release, we changed our re-partition join logic to starting using the new  Citus adaptive executor, which encapsulates much of what we had learned over the years about running parallel, distributed transactions across Postgres servers. Hence, the Hadoop-inspired task tracker had become obsolete and it was time to say goodbye!\n  Removing the task tracker code meant we were able to remove ~7k lines of code from the ~140k lines of C code that make up the Citus open source engine. As a result we have less code to maintain, fewer bugs, faster test execution, a simplified codebase for new developers to learn about when they are onboarding, and faster debugging cycles too.\n    In the  Citus 9.3 blog post, we mentioned that as a side-effect of another feature, Citus distributed tables can now sit entirely on the Citus coordinator node. This means all the shards can sit on the Citus coordinator node and your Postgres queries will just work.\n  Citus 9.5 fixes a few bugs and adds more automated testing for this feature. We think this ability to run a distributed Citus cluster on a single node could be super useful for testing purposes, and we’d love your feedback about whether we should make this a fully supported feature in the future.\n  If you want to get a sneak preview, you can run the following SQL commands. After you run these commands, you can create distributed tables on a single server.\n  -- add coordinator to the metadata with group 0\n SELECT  master_add_node ( &#39;coordinator.hostname&#39; ,  5432 ,  groupid  : =  0 );\n\n -- add coordinator to the metadata with group 0\n SELECT  master_set_node_property ( &#39;localhost&#39; ,  5432 ,  &#39;shouldhaveshards&#39; ,  true );\n  Many small improvements that add up to a lot (or, Fix things and move faster)\n  Our Citus open source team (aka the “Citus engine team” internally) continues to wow with their ongoing work to keep improving the user experience, the performance, and the reliability of Citus. And there’s even more exciting things to come in the next release of Citus.\n  If you have a data-intensive application (or a multi-tenant SaaS application that is growing fast) and are looking to scale out Postgres, the  Citus open source documentation is a really good place to get started and includes tutorials for real-time analytics apps, multi-tenant applications, and time series workloads. And because Citus is open source, it’s easy to  download Citus packages to try things out, too. Now with Postgres 13 support!\n  And be sure to join our  Citus Slack to participate in the community discussion about Citus.\n    If you’re interested in reading more posts from our team, sign up for our monthly newsletter and get the latest content delivered straight to your inbox.", "posttime": "2020-11-15 05:49:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgres,extension,citus", "title": "Postgres的Citus9.5扩展有什么新功能", "title_en": "What's new in the Citus 9.5 extension to Postgres", "transed": 1, "url": "https://www.citusdata.com/blog/2020/11/14/citus-9-5-whats-new/", "via": "", "real_tags": ["postgres", "extension", "citus"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1035187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Chakra UI是一个简单、模块化且可访问的组件库，它为您提供了构建Reaction应用程序所需的构建块。\n花更少的时间编写用户界面代码，花更多的时间为您的客户打造出色的体验。\n\n我们的维护人员投入了他们的时间、精力和心血来确保Chakra UI不断变得更好。通过向我们的集体🙏捐款来支持我们。\n脉轮让每个人保持一致，在没有摩擦的情况下工作。工程师和设计师使用相同的语言。\n开始。\n想要一位Chakra UI核心团队成员在您的下一次活动中发言吗？邀请我们为您的与会者创造一次难忘的、引人入胜的体验。\n邀请我们发言", "note_en": "Chakra UI is a simple, modular and accessible component library that gives you the building blocks you need to build your React applications.\n   Spend less time writing UI code and more time building a great experience for your customers.\n \n   Our maintainers devote their time, effort, and heart to ensure Chakra UI keeps getting better. Support us by donating to our collective 🙏\n Chakra keeps everyone aligned and working without friction. Engineers and designers using the same language.\n Get Started\n Want a Chakra UI core team member to speak at your next event? Invite us to create a memorable and engaging experience for your attendees.\n Invite us to speak", "posttime": "2020-11-15 05:49:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,程序,ui,时间", "title": "Chakra UI v1发布-快速构建可访问的Reaction应用程序", "title_en": "Chakra UI v1 Released – Build accessible React apps with speed", "transed": 1, "url": "https://chakra-ui.com/#", "via": "", "real_tags": ["发布", "程序", "ui", "时间"]}]