[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1013319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天对AMD来说是一个大日子，因为该公司希望将其强大的7 nm Zen2处理器架构的覆盖范围扩展到更多的细分市场。在过去的一年里，我们看到Zen 2在服务器(EPYC 7xx2)、HEDT工作站(ThreadRipper 3000/ThreadRipper Pro 3000)、消费台式机(Ryzen 3000)和笔记本电脑(Ryzen 4000)市场掀起了波澜。Zen 2系列的最新扩展是针对消费台式机市场的Ryzen 4000处理器。虽然这可能有点令人困惑，因为AMD已经有了基于Zen2的Ryzen 3000系列来处理台式机任务，但这些处理器没有集成的显卡核心。这使他们在英特尔处理器面前处于劣势，英特尔处理器也包括能够正常工作、内容创作和一些轻型游戏的集成GPU。这些新的AMD Ryzen 4000台式机处理器现在还集成了Radeon Vega图形引擎(最多具有8个内核)，这将使它们对希望提供台式机而不增加包括独立GPU的成本的系统构建商具有吸引力。\n可以把这些新的Ryzen 4000插槽AM4台式机处理器想象成AMD&#39；已经发布的Ryzen 4000笔记本电脑CPU的增强版，但具有更快的基时钟和升压时钟，以及更快的台式机GPU时钟。您可以在这里阅读我们对Ryzen 4000的全面概述。由于更高的TDPS和更大、更宽容的台式机散热带来的额外散热空间，AMD能够负担得起周围的时钟。\nAMD提供两个不同系列的Ryzen 4000台式机处理器。有三款65瓦的处理器，包括Ryzen 3 4300G、Ryzen 5 4600G和Ryzen 7 4700G。旗舰Ryzen 7 4700G提供8核/16线程、3.6 GHz/4.4 GHz的基本/升压时钟、12MB高速缓存和8个2100 MHz的Vega内核。\n菜单上还有三款35瓦的处理器--Ryzen 3 4300GE、Ryzen 5 4600GE和Ryzen 7 4700GE，它们的基本硬件配置与G&34；型号相同，但CPU/GPU时钟略低，以降低功耗。\n以旗舰Ryzen 74700G为例，AMD正在将该芯片直接与英特尔的酷睿i7-9700(Coffee Lake-S)进行竞争。这是一个有趣的对比，因为AMD，1)没有选择较新的Corei7-10700(Comet Lake-S)，2)Corei7-9700是一个8核/8线程处理器。因此，8核/16线程的Ryzen 74700G自然会在多线程基准测试中击败它。AMD声称，当使用集成GPU时，Ryzen 7 4700G在1080p游戏基准中处于至高无上的地位。\n如果说Ryzen 4000G/4000GE是AMD对消费者台式机市场的最新攻势，那么Ryzen Pro 4000也希望在商业领域掀起类似的浪潮。与所有AMD的“Pro”处理器一样，Ryzen Pro 4000系列包括一个专用的安全处理器，并支持AMD Memory Guard全系统内存加密。AMD还承诺18个月的“计划软件稳定性”和24个月的处理器保证可用性，这对其商业客户来说至关重要。\n如你所料，Ryzen Pro 4000G(65W)和Ryzen Pro 4000GE(35W)的规格(内核/高速缓存计数、CPU/GPU时钟)基本上与消费者台式机相当。\n针对入门级市场，AMD还推出了新的Athlon Gold 3150G、Athlon Gold 3150GE和Athlon Silver 3050GE处理器。在这三个处理器中，前者是最强大的，它采用4核/4线程设计，最大CPU时钟为3.9 GHz，板载RADEON显卡核心。\n在过去的几个月里，AMD一直如火如荼，发布了大量基于其Zen2架构的新处理器。我们不仅看到了时钟更快的EPYC处理器，而且该公司还推出了更高性能的Ryzen 3000XT处理器以及Ryzen Threadriper Pro 3000。据我们所知，Ryzen 4000/Ryzen Pro 4000将是AMD Zen 2架构转向Zen 3的最后几个主要版本之一。Zen 3将为AMD的下一代7 nm+处理器提供动力，首批产品将于今年晚些时候发布。", "note_en": "Today is a big day for  AMD, as the company looks to spread the reach of its powerful 7nm Zen 2 processor architecture to additional segments. We’ve seen Zen 2 make waves in the server (EPYC 7xx2), HEDT workstation (Threadripper 3000/ Threadripper Pro 3000), consumer desktop (Ryzen 3000), and the laptop ( Ryzen 4000) markets over the past year. The latest extensions of the Zen 2 family are Ryzen 4000 processors targeting the consumer desktop market.  Although it may be a little confusing, since AMD already has the  Zen 2-based Ryzen 3000 family to handle desktop duties, but those processors don’t have integrated graphics cores. This puts them at a disadvantage to Intel processors, which also include integrated GPUs that are capable of regular productivity work, content creation and some light gaming. These new AMD Ryzen 4000 desktop processors now also integrate Radeon Vega graphics engines (with up to 8 cores), which will make them attractive to system builders that want to offer desktop machines without the added cost of including a discrete GPU.\n    Think of these new Ryzen 4000 socket AM4 desktop processors as juiced-up versions of AMD&#39;s already announced Ryzen 4000 laptop CPUs, but with faster base and boost clocks, as well as faster GPU clocks for desktop PCs. You can  read our extensive overview of Ryzen 4000 here. AMD can afford to crank up the clocks all around thanks to higher TDPs and the additional thermal headroom that come with the larger, more forgiving thermals of a desktop form-factor.\n  AMD is offering its Ryzen 4000 desktop processors in two distinct families. There’s a trio of 65-watt processors that include the Ryzen 3 4300G, Ryzen 5 4600G, and the Ryzen 7 4700G. The flagship Ryzen 7 4700G offers 8 cores/16 threads, base/boost clocks of 3.6GHz/4.4GHz, 12MB cache, and 8 Vega cores clocked at 2100MHz.\n   Also on the menu are three 35-watt processors -- Ryzen 3 4300GE, Ryzen 5 4600GE, and the Ryzen 7 4700GE – which share the same basic hardware configurations as the &#34;G&#34; models, but with slightly lower CPU/GPU clocks to reduce power consumption.\n   Using the flagship Ryzen 7 4700G as an example, AMD is pitting this chip directly against Intel’s Core i7-9700 (Coffee Lake-S). It’s an interesting comparison given that AMD, 1) didn’t opt for the newer Core i7-10700 (Comet Lake-S), and 2) the Core i7-9700 is an 8-core/8-thread processor. So naturally, the 8-core/16-thread Ryzen 7 4700G absolutely clobbers it in multi-threaded benchmarks. AMD claims that the Ryzen 7 4700G reigns supreme in 1080p gaming benchmarks when using the integrated GPU as well.\n    If Ryzen 4000G/4000GE is AMD’s latest assault on the consumer desktop market, Ryzen Pro 4000 is looking to make similar waves in the business sector. Like all of AMD’s “Pro” processors, the Ryzen Pro 4000 family includes a dedicated security processor and support for  AMD Memory Guard full system memory encryption. AMD also promises 18 months of “planned software stability” and 24 months of guaranteed availability for the processors, which is critical for its business customers.\n   As you might expect, specs (core/cache counts, CPU/GPU clocks) for the Ryzen Pro 4000G (65W) and Ryzen Pro 4000GE (35W) largely line up with their consumer desktop counterparts.\n  To address entry-level markets, AMD has also introduced new Athlon Gold 3150G, Athlon Gold 3150GE and Athlon Silver 3050GE processors. Of those three processors the former is the most potent, rocking a 4-core/4-thread design with a maximum CPU clock of 3.9GHz and an on-board Radeon graphics core.\n  AMD has been on a tear over the past few months, releasing numerous new processors based on its Zen 2 architecture. Not only did we see faster-clocked EPYC processors, but the company introduced  more performant Ryzen 3000XT processors along with Ryzen Threadripper Pro 3000. From what we can tell, Ryzen 4000/Ryzen Pro 4000 will be among the last &#34;major&#34; releases for AMD&#39;s Zen 2 architecture as it pivots towards Zen 3. Zen 3 will power AMD&#39;s next-generation 7nm+ processors, and the first products are  on track to launch later this year.", "posttime": "2020-07-22 01:05:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "性能,台式,desktop,amd", "title": "AMD为台式PC带来Ryzen 4000 Renoir处理器的强大功能和性能", "title_en": "AMD Brings Power And Performance Of Ryzen 4000 Renoir Processors To Desktop PCs", "transed": 1, "url": "https://hothardware.com/news/amd-ryzen-4000g-ryzen-4000-pro-zen-2", "via": "", "real_tags": ["性能", "台式", "desktop", "amd"]}, {"category": "", "categoryclass": "", "imagename": "cbf67ce9df345a6998d430913af825f1.jpg", "infoid": 1013318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌的Nest Hub和Nest Hub Max智能显示器击败了亚马逊，成为第一个获得官方支持的流媒体Netflix内容。从今天开始，你可以通过谷歌主页或助手应用程序链接你的Netflix订阅，在谷歌Nest品牌的智能显示屏上观看其内容。在那之后，你可以呼叫谷歌助手播放特定的节目，或者直接说“嘿，谷歌，打开Netflix。”然后，您可以在任一Nest Hub型号上通过触摸屏手动滚动界面。\n谷歌还在Nest Hub Max上为Netflix实现了一个利用其摄像头的手势。(较小的Nest Hub没有摄像头。)。您可以通过查看显示屏并举手暂停或恢复播放。\n在智能显示器上获得Netflix支持对谷歌来说意义重大。如果你想要YouTube支持和谷歌与Photos和助手的广泛集成，Nest Hub和Nest Hub Max已经是你购买的显示器。Nest Hub Max现在还支持谷歌的Meet和Duo应用程序的视频聊天。现在，Netflix提供了比亚马逊的Echo Show和Facebook门户网站更多的优势。\n亚马逊的显示器很可能会在某个时候获得Netflix的支持，但Echo Show不会获得对Google Cast的支持。正如谷歌向The Verge证实的那样，你可以开始在你的iOS或Android手机上观看Netflix视频，然后点击Netflix应用程序上的CAST按钮，就可以在你的电视上观看该视频。\n无论是Nest Hub的7英寸显示屏，还是Nest Hub Max的10英寸显示屏，都不会带来最逼真的观看体验。但是，如果你想在更多的地方观看你最喜欢的Netflix节目和电影，这是一个让谷歌的显示屏比以往任何时候都更具吸引力的重大更新。", "note_en": "Google’s  Nest Hub and  Nest Hub Max smart displays have beaten Amazon in being the first to get official support for streaming Netflix content. Starting today, you can link your Netflix subscription through the Google Home or Assistant app to watch its content on your Google Nest-branded smart display. After that, you can call out to the Google Assistant to play a particular show, or just say “Hey Google, open Netflix.” You can then scroll through the interface manually via the touchscreen on either Nest Hub model.\n Google has also implemented a gesture for Netflix on the Nest Hub Max that takes advantage of its camera. (The smaller Nest Hub lacks a camera.) You can pause or resume playback by looking at the display and holding up your hand.\n Getting Netflix support on smart displays is huge for Google. The Nest Hub and Nest Hub Max are already the displays to buy if you want YouTube support and broad Google integration with Photos and the Assistant. The Nest Hub Max also now has  video chat support for Google’s Meet and Duo apps. Now, Netflix offers yet another advantage over  Amazon’s Echo Show and  Facebook Portal.\n It’s likely that Amazon’s displays will gain Netflix support at some point, but what the Echo Show won’t get is support for Google Cast. As Google confirmed to  The Verge, you will be able to start watching a Netflix video on your iOS or Android phone, then hit the Cast button on the Netflix app to stream that video on your TV.\n Neither the Nest Hub’s 7-inch nor Nest Hub Max’s 10-inch displays will make for the most immersive viewing experience. But if you want to watch your favorite Netflix shows and movies in more places, this is a stellar update that makes Google’s displays more appealing than ever.", "posttime": "2020-07-22 01:04:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,nest,netflix", "title": "谷歌的Nest Hub和Nest Hub Max智能显示器现在正式支持Netflix", "title_en": "Google's Nest Hub and Nest Hub Max smart displays now have official support for Netflix", "transed": 1, "url": "https://www.theverge.com/2020/7/21/21331709/netflix-app-available-now-google-nest-hub-max-smart-display?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["google", "谷歌", "nest", "netflix"]}, {"category": "", "categoryclass": "", "imagename": "2875cb55f1b02c51e5ef36c5ce98b3e1.jpeg", "infoid": 1013316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于你可以获得的东西和你可以保留的东西之间的区别的冗长而错综复杂的寓言。\n解说员：我被这里完全不必要的千言万语迷住了，所以如果你不想读关于已故君主的愚蠢故事，你可以跳到最后一节，开始是“请你好吗”。我不会生气的。\n假设你是一个前工业化岛国的国王。你有希望保住一个辉煌的帝国，但辉煌的帝国是历史上的鳄梨：每个人都想要一个，而且它们的到期日不可预测，如果你太频繁地追逐它们，你会难以支付租金。不管怎么说，既然地球上71%是水，既然你是一个前工业化岛国的国王，这里的第一个很好的选择就是建造很多木船。\n问题是，所有其他希望建立一个辉煌帝国的国家都有同样的想法。而且你是唯一一个是孤岛的人。而且你已经砍掉了你所有的树。在生态赶上你之前，岛国帝国都是充满乐趣和游戏的。\n你可以从巴尔干地区采购木材，那里还没有人恨你，但途中有一半的国王并不是你的忠实粉丝。最重要的是，它很贵，而且你付不起房租。所以你想出了一个更好的计划。忘掉巴尔干的树林吧，你有美国，最新和最伟大的殖民地，它只是简单地布满了木材。这么多木头。让你的造船工人告诉你，那些新英格兰的白松构成了一根巨大的桅杆。既然可以免费得到殖民者的牛奶，为什么还要买巴尔干奶牛呢？\n你宣布美国最大的树木是国王(也就是你)的财产，然后派测量员在那些合适的树上留下记号，直到你可以来收集为止。\n对国王来说，美国殖民时期的财富似乎是一种资产，但资产的价值总是与时间、空间或财产的其他方面有关。一些值得深思的问题：\n在1861年至2012年期间，意大利里拉被多次兑换成面包，但之后就没有了。\n津巴布韦元在80年代比美元更有价值，尽管有些年份面包可能要花100亿新西兰元，有些日子可能连面包都没有。(津巴布韦在2009年完全停止使用自己的货币，在其他外币中使用美元)。\n当你快要死的时候，黄金可能一文不值，水可能很值钱。\n“买你能买得起的最大的房子”是2005年的流行建议。但是，如果你看不到30年后的未来，你怎么知道你能负担得起多少钱呢？\n如果你欠银行一百万美元，那你就有麻烦了。如果你欠银行10亿美元，银行就有麻烦了。\n铝土矿原本是一种一文不值的矿石，直到几位化学家找到了从其中提炼铝的方法。然后，它的价值增长速度远远快于比特币。\n回到殖民地。国王的法律遭到藐视。如此藐视，以至于用至少一英尺宽的松木地板变得流行起来。事实证明，如果权力要求-但不能强制执行-某件事，证明这一点就成了一种不可抗拒的喜悦。\n殖民地的反弹真正开始于1766年左右，当时新罕布夏州州长决定实际上开始执行。一些NH人被抓，松树暴动随之而来。很难确定你(国王)后来所说的美英战争是从什么时候开始的，但现在你知道为什么他们总是在上面挂着松树的旗帜了。\n所有的树上都有数不清的财富还没有被砍伐，但是除非你能控制你的要求，否则这些财富不是你的。它可能根本就不存在。新英格兰的树木不是国王的财产，它们是任何拥有控制权的人的财产。\n法国和西班牙的关系有些敏感，但当谈到扰乱英国正在做的任何事情时，他们总是愿意聊天。乔治国王通过七年战争(1756-1763)成功地将法国的影响力踢出了北美，迫使法国人在控制路易斯安那州领土几十年后于1762年撤离，使其大部分处于西班牙的微弱影响之下。法国和西班牙酝酿了一个恶作剧的计划，将火药装进美国人的口袋作为回报。\n路易斯安那州的领土面积约为法国或西班牙的四倍，密西西比河入海口的港口自然控制着西部地区的贸易，因为通往大西洋的航运通道是关键。有人可能会说这是有价值的。\n西班牙以相对便宜和悄悄的方式将土地还给了法国，只要他们承诺不会把它给其他任何人。\n和英国一样，西班牙当时也很难支付房租。更糟糕的是，乔治有攻击横渡大西洋的西班牙车队的爱好。可能是为了交房租。\n拿破仑，一个有着全球帝国野心的魁梧小伙子，希望重新夺回路易斯安那州的领土，重新建立一个大西洋帝国。但是你不知道吗，国王就是太不会付房租了。一定是他们的爱好。他决定在1800年卖掉它，为与英国的一场全新的战争筹集一些资金。\n最终，路易斯安那州的领地以2.61亿美元的价格售出。这个很便宜。这是梅尔·吉布森离婚的一半。鲁珀特·默多克(Rupert Murdoch)的离婚本可以支付路易斯安那州十个领地的费用。我想知道律师买了什么。\n为什么要卖这么便宜的东西呢？为什么他们不珍视那些看起来如此有价值的东西呢？土地是那里最有价值的东西之一。婴儿潮一代的谚语说，他们不会再制造更多的东西了。\n杰斐逊总统不想谈判出售，因为这意味着法国有权留在那里，并准备开战以防止法国的强大影响。他派门罗去巴黎谈判解决方案，如果英国不能达成协议完善他的战前清单，后备计划将与英国谈判休战。\n西班牙，尽管他们要求不要落入非法国人手中，但他们太无能为力了，无法抵抗。\n“路易斯安那州卖给美国的交易三次无效；如果是法国财产，波拿巴在没有法国商会同意的情况下，在宪法上不能转让；如果是西班牙财产，他根本不能转让；如果西班牙有收回权，他的出售一文不值。”\n当然，这笔交易并不是一文不值，它发生了，支票也结清了。售价真的只够阻止一个小小的全球事件(或者半个好莱坞离婚)。控制权从西班牙割让给法国，一个月后又从法国割让给美国。费迪南德七世抽泣着宣布，无论如何，这完全是他想要的。\n与此同时，拿破仑计划与英国开战，但英国决定先开战，西班牙说“为什么不”并加入了英国的阵营。在这期间，美国与英国(再次)开战，英国人一路游行到华盛顿特区烧毁白宫，只是为了证明一个也许你在这里得到了辛酸的观点。\n好吧，好吧。比特币：这就像交叉拟合，但你甚至不需要锻炼。\n我们美利坚合众国人民，为了形成更完美的联邦，建立正义，确保国内安宁，提供共同防御，促进公共福利，并确保我们自己和我们的子孙后代获得自由的祝福，为美利坚合众国颁布和制定这部宪法。\n仔细想想这些话，它们不是偶然出现的。如果有帮助，请记住，制定者不是按点击付费的。\n土地和其他一些硬资产时断时续都有价值。钱？这一切都是装出来的。期票。借条。它的背后是什么并不重要，重要的是管理它的供应的机构的纪律，以及它必须在政府控制的范围内偿还债务和税收的公用事业。\n美元之所以有价值，是因为美国政府对一些东西征税，比如土地，如果你不缴纳这些税，他们会在诉诸其他手段(相信阿尔·卡彭)之前给你写一些刻薄的信(相信我)。这些税是用美元支付的。你仅仅拥有美元并不能让它们变得有价值。美元之所以不值钱，是因为它们有黄金、白银或贝壳作后盾。美元之所以有价值，是因为政府想要收回它们。\n作为交换，美国政府机构尽其所能确保美国人、他们的财产和美元(作为稳定的储值库)的声誉得到维护。这就是宪法序言的内容。其结果是，每个人都想要一些美元，因为他们需要这些美元向政府支付，这样政府就可以保护我们免受生存风险。作为一个不错的红利，美元受到了足够的尊重，即使是外国人也相信美国说“我们对它有好处”。记住，津巴布韦人使用美元。\n比特币的价值是虚构的，就像货币一样。但是，即使有比特币领域的治理，也没有比特币领域的资产。税收不是用比特币支付的。没有联邦存款保险公司，只有四处盗走一百万美元的黑客。当民族国家认为比特币令人讨厌时，比特币的枪是什么？是匿名的吗？来自创建PRISM的同一个政府，然后使用心灵魔法*让每个人都忘记PRISM？请。你可能认为，需要比小国更强大的力量才能运行的加密货币可以躲过雷达，但不知何故，我认为不会无限期。毕竟，成为下一个大的东西将意味着它对美元的威胁，你真的认为美国政府会耸耸肩说“谢天谢地比特币从庞氏新奇变成了将完全篡夺我们辛辛苦苦创造的霸权的东西吗？”我想我们今天只能到此为止了。“。(如果你这么想，那就卖掉你的比特币，买一个想象力吧。)。\n你可以用比特币向政府缴纳税单的那一天，可能就是你可以高枕无忧的日子。在此之前，亲爱的比特币持有者，你确实有一些有价值的东西，就像路易斯安那州的领土有价值一样。但在这个1800年的比喻中，是什么让你如此确信自己是美国人呢？\n*我说的心灵魔力是指，2013年，美国政府等了大约一个月，让每个人都回到关于厕所、旗帜、足球、乔治王子的出生或其他人们认为令人信服的无用争吵上。\n写这篇文章是为了好玩，因为我有一些作家试图写一些重要的东西。我试着挑除了郁金香以外的任何东西。如果比特币的方式太以美国为中心，我很抱歉，我知道比特币困扰着我们所有人。", "note_en": "A long and convoluted allegory about the difference between what you can acquire and what you can keep.\n  Unspoiler: I got carried away by a totally unnecessary thousand words here so if you don’t feel like reading silly stories about dead monarchs you can skip to the last section that begins “Would you please.” I won’t be mad.\n  Suppose you are the king of a pre-industrial island nation. You have hopes of hanging on to a glorious empire, but glorious empires are history’s avocados: Everyone wants one and they have unpredictable expiration dates, and if you go after them too often you’ll have trouble paying the rent. Anyway since 71% of the earth is water, and since you are the king of a pre-industrial island nation, a good first checkbox here is to build a lot of wooden boats.\n Problem is, all the other nations with hopes of a glorious empire had the  same idea. Also you’re the only one that’s an island. Also you already cut down all your trees. Island nation empires are all fun and games until ecology catches up to you.\n  You could source timber from the Balkans where nobody hates you yet, but half the kings in the way are not big fans.  On top of that it’s costly, and you’re having trouble paying the rent. So you come up with a better plan. Forget the Balkan wood, you’ve got America, the latest and greatest colony, which is just plain replete with wood. So much wood. And those New England white pines make a mighty mast, let your shipbuilders tell you. Why buy the Balkan cow when you can get the colonist milk for free?\n You decree that the largest trees in America are property of the king (that’s you), and send surveyors to leave a mark on those suitable trees, until you can come collecting.\n  The American colonial riches  appeared like an asset to the king, but the value of an asset is always in relation to something else, in time, space, or possession. Some to ponder:\n Italian lira were exchanged for many a bread loaf between 1861 and 2012, but not after.\n The Zimbabwean dollar was more valuable than the US dollar in the 80’s, though some years bread might cost you Z$10 billion, and some days there might not be any bread. (Zimbabwe stopped using their own currency altogether in 2009 and uses the US dollar, among other foreign currencies).\n   Gold can be worthless and water worth quite a lot, when you’re about to die.\n “Buy the biggest house you can afford” was popular advice in 2005. but  how do you know how much you can afford, if you cannot see 30 years into the future?\n If you owe the bank a million dollars, you have a problem. If you owe the bank a billion dollars, the bank has a problem.\n Bauxite was a worthless ore until a couple chemists figured out how to get aluminum out of it. Then its value increased way faster than bitcoin.\n  Back to the colonies. The king’s law was flouted. So flouted that it became popular to have pine floors at least a foot wide. Turns out if the powers that be require — but cannot enforce — something, it becomes an irresistible delight to prove it.\n Backlash back at the colonies  really began circa 1766, when the New Hampshire governor decided to actually start enforcement. Some NH folk were caught pine-handed, and the Pine Tree Riot ensued. It’s hard to pinpoint the beginning of what you (the king) will later call the  American-English war, but now you know why they kept flying flags with pine trees on them.\n   There’s untold wealth in all the trees not yet cut down, but unless you can assert control over your claims, that wealth is not yours. It might as well not exist at all. The trees of New England are not an asset to the king, they are an asset to whoever has control.\n  France and Spain had something of a touchy relationship but they’re always willing to have a chat when it comes to disrupting whatever Great Britain is doing. King George successfully kicked French influence out of North America with the Seven Years War (1756–1763), forcing the French to evacuate the Louisiana territory after several decades of holding it, leaving it mostly under Spain’s weak influence, in 1762. France and Spain  hatched naughty plans to stuff American pockets with gunpowder in return.\n  The Louisiana territory is about four times the size of France or Spain, and the port at the mouth of the Mississippi naturally controlled trade in the western territories, since shipping access to the Atlantic is key. One might call this valuable.\n  Spain gave the land, relatively cheaply and quietly, back to France, as long as they promised not to give it to anybody else.\n Like Great Britain, Spain at the time had trouble paying the rent. And what’s worse, George had made a hobby of attacking trans-Atlantic Spanish convoys. Probably for rent money.\n Napoleon, a strapping lad with ambitions of a global empire, hoped to regain the Louisiana territory to re-establish an Atlantic empire. But wouldn’t you know it, kings are just so bad at paying rent.  Must be their hobbies. He decided to sell it in 1800 to shore up some funds for an all-new war with England.\n In the end the Louisiana territory was sold for $261 million. This is cheap. This is half as much as Mel Gibson’s divorce. Rupert Murdoch’s divorce could have paid for ten Louisiana territories. I wonder what the lawyers bought.\n  Why sell something for so cheap? Why didn’t they value something that seemed so worthwhile? Land is one of the most valuable things out there. They aren’t making any more of it, goes the boomer adage.\n  President Jefferson didn’t want to negotiate a sale because it implied that France had a right to be there at all, and was prepared to go to war to prevent a strong french influence. He sent Monroe to Paris to negotiate a settlement with back-up plans to negotiate a truce with England if they didn’t reach a deal to round out his pre-war checklist.\n Spain, even though they asked for it to not fall into non-French hands, were too powerless to resist.\n “The sale of Louisiana to the United States was trebly invalid; if it were French property, Bonaparte could not constitutionally alienate it without the consent of the French Chambers; if it were Spanish property, he could not alienate it at all; if Spain had a right of reclamation, his sale was worthless.”\n Of course the sale wasn’t worthless, it happened and the check cleared. The sale price was really just enough to stop a tiny global incident (or half a Hollywood divorce). Control was ceded from Spain to France and then one month later from France to the USA. Ferdinand VII, sniffling, declared that this was totally what he wanted anyway.\n Meanwhile  Napoleon made plans to go to war with Britain, but Britain decided to go to war first, and Spain said “why not” and joined Britain’s side. In the middle of that the  US goes to war with Britain (again) and the British marched all the way to Washington D.C. to burn down the white house just to prove a point that maybe you are getting the poignancy of, here.\n   Okay fine. Bitcoin: It’s like cross-fit but you don’t even have to work out.\n  We the people of the United States, in order to form a more perfect union, establish justice, insure domestic tranquility, provide for the common defense, promote the general welfare, and secure the blessings of liberty to ourselves and our posterity, do ordain and establish this Constitution for the United States of America.\n Think hard about these words, they are not there by accident. If it helps, remember that the framers were not paid by the click.\n  Land and some other hard assets have value, on and off. Money? It’s all make believe. Promissory notes. IOUs. What its backed by doesn’t matter, what matters is the discipline of the body that manages its supply and the utility it has to pay off debts and taxes within the spheres of government control.\n American dollars have value because the US Government taxes things, like land, and if you do not pay those taxes they will send you mean letters (trust me) before resorting to other means (trust Al Capone). You pay these taxes in US dollars. You just  having dollars does not make them valuable. And dollars are not valuable because they are backed by gold or silver or sea shells. What makes dollars valuable is that the government wants them back.\n In exchange, the American government apparatus exerts all the influence it can to ensure that Americans, their possessions, and the reputation of the dollar (as a stable store of value) are upheld. This is what the preamble to the Constitution is about. The result is that everyone wants some dollars because they need them to pay the government so it can protect us from existential risks. As a nice bonus, the US dollar is respected well enough that even foreigners trust when the US says “we’re good for it.” Remember, Zimbabweans use the U.S. dollar.\n Bitcoin value is make-believe just like money. But even though there is bitcoin-sphere governance, there are no bitcoin-sphere assets. Taxes are not paid in bitcoin. There is no FDIC, only hackers that lift a million here and there. And when nation-states decide its a nuisance, what are the guns of bitcoin?  It’s anonymity? From the same government that created  PRISM and then used mind-magic* to make everyone forget about PRISM? Please. You may think crypto-currencies that require more power than a small country to run can fly under the radar, but somehow I think not indefinitely. After all, becoming the next big thing would mean its a threat to the American dollar, do you really think the US Gov will shrug and say  “shucks bitcoin went from a ponzi-novelty to something that will totally usurp this hegemony we worked so hard to make. Guess we’ll have to call it a day.” (If you think this, sell your Bitcoin and buy an imagination.)\n The day you can pay tax bills to a government in Bitcoin is probably the day you can rest easy. Until then dear Bitcoin holders, you do have something of value, just like the Louisiana territory has value.  But in this 1800’s metaphor, what makes you so sure you’re America?\n  * by mind magic I mean the US government waited like a month for everyone to get back to useless bickering about toilets, flags, football, the birth of Prince George, or whatever else people thought was compelling in 2013.\n This was written for fun because I’ve got writers block trying to write about something important. I tried to pick anything but tulips. Sorry if its way too US-centric, I know bitcoin afflicts us all.", "posttime": "2020-07-22 01:01:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,guns,西班牙", "title": "《比特币之枪》(2017)", "title_en": "The Guns of Bitcoin (2017)", "transed": 1, "url": "https://medium.com/@simon.sarris/the-guns-of-bitcoin-1f779309a718", "via": "", "real_tags": ["比特币", "guns", "西班牙"]}, {"category": "", "categoryclass": "", "imagename": "491e865d86f43ebe214a7933370f816e.png", "infoid": 1013315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在Mozilla，我们希望Web能够运行高性能的应用程序，这样用户和内容作者就可以选择Web平台的安全性、代理性和开放性。许多高性能应用程序的一个基本低级构建块是共享内存多线程。这就是为什么在2016年向JavaScript和WebAssembly交付共享内存是如此令人兴奋的原因。这在线程之间提供了极快的通信。\n然而，我们也希望网络不受攻击者的攻击。根据Spectre的说法，确保用户的安全是最重要的，这就是为什么共享内存和高分辨率定时器在2018年初被有效禁用的原因。不幸的是，使用高分辨率定时器可以显著提高频谱攻击的效率。并且这样的定时器可以用共享存储器创建。(这是通过让一个线程在紧密循环中递增共享内存位置来实现的，另一个线程可以将其作为纳秒精度计时器进行采样。)。\n从根本上说，要使Spectre攻击起作用，攻击者和受害者需要驻留在同一进程中。与计算机上的大多数应用程序一样，浏览器过去使用单个进程。这将允许两个开放的站点，例如攻击者和受害者。例如，对彼此的数据以及浏览器可能保存的其他数据(如书签或历史记录)进行频谱攻击。浏览器早已成为多进程浏览器。随着Chrome的站点隔离和Firefox的Project裂变，浏览器将把每个站点隔离到它自己的进程中。这要归功于网络平台改进后的同源政策。\n遗憾的是，出于以下原因，将每个站点隔离到其自己的进程中仍然是不够的：\n同源策略有许多漏洞，其中两个漏洞强烈地启发了我们在设计过程中的想法：attacker.example可以将任意受害者.example资源提取到attacker.example的进程中，例如，通过&lt；img&gt；元素。\n由于Document.domain的存在，最小隔离边界是站点(大致是网站主机的方案和可注册域)，而不是来源(大致是网站的方案、主机和端口)。\n在这一点上，我们不知道是否可以跨所有平台将每个站点隔离到其自己的进程中。在移动设备上，这仍然是一项具有挑战性的努力。虽然这可能不是一个长期的问题，但我们更倾向于一种解决方案，允许在不久的将来在移动设备上恢复共享内存。\n我们需要解决上述问题以恢复共享内存和高分辨率计时器。因此，我们一直致力于开发一种满足以下要求的系统：\n它允许网站将自己与攻击者进程隔离，从而保护自己免受进程内高精度计时器的攻击。\n如果一个网站想要使用这些高性能的功能，它还需要处理-将自己与受害者隔离开来。特别是，这意味着它必须放弃从任何站点获取任意子资源的能力(例如，通过&lt；img&gt；元素)，因为这些资源最终都在同一进程中。相反，它只能从同意的来源获取跨来源的资源。\n它允许浏览器在单个进程中运行整个网站，包括所有框架和弹出窗口。这对于保持Web平台跨设备的一致性系统非常重要。\n它允许浏览器在其自己的进程中运行每个参与源(即，不是站点)。这是跨设备的理想终端状态，因此设计不要阻止这一点非常重要。\n该系统保持向后兼容性。我们不能要求数十亿个网站重写它们的代码。\n由于这些要求，系统必须提供选择加入机制。我们不能禁止网站获取跨源子资源，因为这不会向后兼容。遗憾的是，限制Document.domain也不能向后兼容。更重要的是，允许网站通过&lt；iframe&gt；元素嵌入跨来源文档，并让这些跨来源资源在没有选择加入的情况下最终出现在同一进程中，这是不安全的。\n我们与WHATWG社区中的其他人一起设计了一组满足这些要求的标头。\n跨域开放策略标头允许您处理-将自己与攻击者隔离。它还具有理想的效果，即如果攻击者在弹出窗口中打开您的全局对象，则他们无法访问您的全局对象。这可以防止XS泄漏和各种导航攻击。即使您不打算使用共享内存，也要采用此标头！\n值为Required-Corp的Cross-Origin-Embedder-Policy标头告诉浏览器仅允许此文档从同意的网站获取跨源子资源。从技术上讲，其工作方式是那些跨域资源需要指定值为CrossSource的Cross-Origin-Resource-Policy标头以表示同意。\n如果为具有相同来源和要求公司值的顶层单据分别设置了跨域开户策略和跨域嵌入器策略题头，则：\n还将跨域-嵌入器-策略设置为Required-Corp的任何子体文档都将是跨域隔离的。(不设置它会导致网络错误。)。\n这些文档打开的任何弹出窗口要么是跨来源隔离的，要么与这些文档没有直接关系。这就是说，不能通过window.opener或等效物直接访问(也就是说，它们就好像是使用rel=#34；noopener&34；创建的一样)。\n跨源隔离的文档可以访问JavaScript和WebAssembly中的共享内存。它将只能与同一“选项卡”及其弹出窗口中的同源文档和专用工作者共享内存(从技术上讲，同源代理位于单个浏览上下文组中)。它还可以访问可用的最高分辨率性能。now()。显然，它将无法访问功能文档.domain。\n这些标头确保来源之间相互同意的方式使浏览器可以自由地将整个网站放入单个进程中，或将每个来源放入自己的进程中，或者介于两者之间。虽然按来源进程是理想的，但这在所有设备上并不总是可行的。因此，将所有东西都纳入到这些一个或多个过程中，同意是一个像样的中间立场。\n我们创建了一个安全后盾，以便能够处理新的跨进程攻击。并且使用了一种避免为了保持web兼容而必须完全禁用共享存储器的方法。\n结果是Firefox的JSExecutionManager。这使我们能够控制不同JavaScript上下文的执行。JSExecutionManager可用于通过后台选项卡限制CPU和电源使用。使用JSExecutionManager，我们创建了一个动态开关(about：config中的dom.workers.Serialized-SAB-Access)，它可以防止所有共享内存的JavaScript线程并发运行代码，从而有效地执行这些线程，就像在单核计算机上一样。由于使用共享内存创建高分辨率计时器需要两个线程同时运行，因此此开关可在不中断网站的情况下有效阻止创建高分辨率计时器。\n默认情况下，此开关处于关闭状态，但在发生新的跨进程攻击的情况下，我们可以快速将其打开。有了这一转换作为后盾，即使考虑到未来不太可能出现的最坏情况，我们也可以自信地在跨来源的孤立网站中启用共享内存。\n非常感谢巴斯·舒腾和卢克·瓦格纳为这篇文章所做的贡献。而且，没有特别的顺序，非常感谢Nika Layzell，汤姆·董，Valentin Gosu，Eden Chuang，Jens Manuel Stutte，Luke Wagner，Bas Schouten，Neha Kochar，Andrew Sutherland，Andrew Overholt，蔡欣宜(蔡信义)，Perry酱，Steve Fink，Mike Conca，Lars Thomas Hansen，Jeff Walden，Junior Hsu，Selena Deckelmann和Eric Rescorla", "note_en": "At Mozilla, we want the web to be capable of running high-performance applications so that users and content authors can choose the safety, agency, and openness of the web platform. One essential low-level building block for many high-performance applications is shared-memory multi-threading. That’s why it was so exciting to  deliver shared memory to JavaScript and WebAssembly in 2016. This provided extremely fast communication between threads.\n However, we also want the web to be secure from attackers. Keeping users safe is paramount, which is why shared memory and high-resolution timers were effectively  disabled at the start of 2018, in light of  Spectre. Unfortunately, Spectre-attacks are made significantly more effective with high-resolution timers. And such timers can be created with shared memory. (This is accomplished by having one thread increment a shared memory location in a tight loop that another thread can sample as a nanosecond-resolution timer.)\n  Fundamentally, for a Spectre attack to work, an attacker and victim need to reside in the same process. Like most applications on your computer, browsers used to use a single process. This would allow two open sites, say  attacker.example and  victim.example, to Spectre-attack each other’s data as well as other data the browser might keep such as bookmarks or history. Browsers have long since become multi-process. With Chrome’s Site Isolation and Firefox’s  Project Fission, browsers will isolate each  site into its own process. This is possible due to the web platform’s retrofitted  same-origin policy.\n Unfortunately, isolating each site into its own process is still not sufficient for these reasons:\n The same-origin policy has a number of holes, two of which strongly informed our thinking during the design process: attacker.example can fetch arbitrary  victim.example resources into  attacker.example’s process, e.g., through the  &lt;img&gt; element.\n Due to the existence of  document.domain, the minimal isolation boundary is a site (roughly the scheme and  registrable domain of a website’s host) and not an  origin (roughly a website’s scheme, host, and port).\n At this point, we don’t know if it’s feasible to isolate each site into its own process across all platforms. It is still a challenging endeavor on mobile. While possibly not a long-term problem, we would prefer a solution that allows reviving shared memory on mobile  soon.\n  We need to address the issues above to revive shared memory and high-resolution timers. As such, we have been working on a system that meets the following requirements:\n It allows a website to process-isolate itself from attackers and thereby shield itself from intra-process high-resolution timer attacks.\n If a website wants to use these high-performance features, it also needs to process-isolate itself from victims. In particular, this means that it has to give up the ability to fetch arbitrary subresources from any site (e.g., through an  &lt;img&gt; element) because these end up in the same process. Instead, it can only fetch cross-origin resources from consenting origins.\n It allows a browser to run the entire website, including all of its frames and popups, in a single process. This is important to keep the web platform a consistent system across devices.\n It allows a browser to run each participating origin (i.e., not site) in its own process. This is the ideal end state across devices and it is important for the design to not prevent this.\n The system maintains backwards compatibility. We cannot ask billions of websites to rewrite their code.\n Due to these requirements, the system must provide an opt-in mechanism. We cannot forbid websites from fetching cross-origin subresources, as this would not be backwards compatible. Sadly, restricting  document.domain is not backwards compatible either. More importantly, it would be unsafe to allow a website to embed cross-origin documents via an  &lt;iframe&gt; element and have those cross-origin resources end up in the same process without opting in.\n   Together with others in the WHATWG community, we  designed a set of headers that meet these requirements.\n The   Cross-Origin-Opener-Policy header allows you to process-isolate yourself from attackers. It also has the desirable effect that attackers cannot have access to your global object if they were to open you in a popup. This prevents  XS-Leaks and various navigation attacks. Adopt this header even if you have no intention of using shared memory!\n The   Cross-Origin-Embedder-Policy header with value  require-corp tells the browser to only allow this document to fetch cross-origin subresources from consenting websites. Technically, the way that this works is that those cross-origin resources need to specify the   Cross-Origin-Resource-Policy header with value  cross-origin to indicate consent.\n  If the  Cross-Origin-Opener Policy and  Cross-Origin-Embedder-Policy headers are set for a top-level document with the  same-origin and  require-corp values respectively, then:\n Any descendant documents that also set  Cross-Origin-Embedder-Policy to  require-corp will be cross-origin isolated. (Not setting it results in a network error.)\n Any popups these documents open will either be cross-origin isolated or will not have a direct relationship with these documents. This is to say that there is no direct access through  window.opener or equivalent (i.e., it’s as if they were created using  rel=&#34;noopener&#34;).\n A document that is cross-origin isolated will have access to shared memory, both in JavaScript and WebAssembly. It will only be able to share memory with same-origin documents and dedicated workers in the same “tab” and its popups (technically, same-origin agents in a single  browsing context group). It will also have access to the highest-resolution  performance.now() available. Evidently, it will not have access to a functional  document.domain.\n The way these headers ensure mutual consent between origins gives browsers the freedom to put an entire website into a single process or put each of the origins into their own process, or something in between. While process-per-origin would be ideal, this is not always feasible on all devices. So having everything that is pulled into these one-or-more processes consent is a decent middle ground.\n  We created a safety backstop to be able to deal with novel cross-process attacks. And used an approach that avoids having to disable shared memory entirely to remain web compatible.\n The result is Firefox’s   JSExecutionManager. This allows us to regulate the execution of different JavaScript contexts with relation to each other. The  JSExecutionManager can be used to throttle CPU and power usage by background tabs. Using the  JSExecutionManager, we created a dynamic switch ( dom.workers.serialized-sab-access in  about:config) that prevents all JavaScript threads that share memory from ever running code concurrently, effectively executing these threads as if on a single-core machine. Because creating a high-resolution timer using shared memory requires two threads to run simultaneously, this switch effectively prevents the creation of a high-resolution timer without breaking websites.\n By default, this switch is off, but in the case of a novel cross-process attack, we could quickly flip it on. With this switch as a backstop, we can feel confident enabling shared memory in cross-origin isolated websites even when considering unlikely future worst-case scenarios.\n  Many thanks to Bas Schouten and Luke Wagner for their contributions to this post. And also, in no particular order, many thanks to Nika Layzell, Tom Tung, Valentin Gosu, Eden Chuang, Jens Manuel Stutte, Luke Wagner, Bas Schouten, Neha Kochar, Andrew Sutherland, Andrew Overholt, 蔡欣宜 (Hsin-Yi Tsai), Perry Jiang, Steve Fink, Mike Conca, Lars Thomas Hansen, Jeff Walden, Junior Hsu, Selena Deckelmann, and Eric Rescorla for their help getting this done in Firefox!", "posttime": "2020-07-22 01:00:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,恢复,reviving,共享内存", "title": "安全恢复共享内存", "title_en": "Safely Reviving Shared Memory", "transed": 1, "url": "https://hacks.mozilla.org/2020/07/safely-reviving-shared-memory/", "via": "", "real_tags": ["内存", "恢复", "reviving", "共享内存"]}, {"category": "", "categoryclass": "", "imagename": "8358f94e85807b8cb63d445f6702262a.jpeg", "infoid": 1013313, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "全国各地大学的数学家停止了与美国各地警察部门的合作。\n6月15日的一封信寄给了行业杂志“美国数学学会通知”，宣布了抵制行动。\n通常，数学家与警察部门合作建立算法，进行建模工作，并分析数据。\n根据6月15日提交给美国数学学会通知的一封信，几位著名的学术数学家希望切断与美国各地警察部门的联系。这封信是在针对警察暴行的广泛抗议活动几周后收到的，并已激励其他1500多名研究人员加入抵制行动。\n这些数学家敦促其他研究人员停止所有与预测性警务软件相关的工作，其中广泛包括任何使用历史数据来帮助预测未来犯罪、潜在犯罪者和受害者的数据分析工具。这项技术应该利用概率来帮助警察部门定制他们的社区覆盖范围，这样它就可以让警察在正确的时间出现在正确的地点。\n作者在信中写道，考虑到美国警察的结构性种族主义和残暴，我们认为数学家不应该以这种方式与警察部门合作。为种族主义做一个科学的表象实在太容易了。请加入我们的行列，承诺不与警方合作。此时此刻，这是我们作为一个社区所能做的最起码的事情。\n其中一些数学家包括凯西·奥尼尔(Cathy O&39；Neil)，她是畅销书“数学毁灭的武器”(Weapons Of Math Deployment)的作者，该书概述了这封信所反对的算法偏见。还有哥伦比亚数学家费德里科·阿迪拉(Federico Ardia)，目前在旧金山州立大学任教，他以使数学领域多样化而闻名。\n在这封信上签名的华盛顿大学数学系副教授贾亚德夫·阿特里亚(Jayadev Atriya)告诉“大众力学”(Popular Mechanical)，这是我们中的许多人意识到存在已久的现实的时刻。我们中的许多人认为，清楚地表明我们作为数学家在这些问题上的立场是非常重要的。\n此内容是从YouTube导入的。您可以在他们的网站上找到不同格式的相同内容，也可以找到更多信息。\n电子前沿基金会，一个非营利性的数字权利组织，将预测性警务定义为执法部门使用数学分析来识别和威慑潜在的犯罪活动。\n这可以包括统计或机器学习算法，这些算法依赖于详细记录过去犯罪的时间、地点和性质的警方记录，以预测未来是否、何时、何地和谁可能犯下违法行为。从理论上讲，这应该有助于当局更明智地使用资源，并花费更多时间在他们认为会产生更高犯罪率的某些社区进行治安。\n预测警务与面部识别技术不是一回事，面部识别技术更多地是在犯罪发生后用来试图识别肇事者。警方可能会一起使用这些技术，但它们从根本上是不同的。\n例如，如果预测警务软件显示一家酒吧在凌晨2点出现犯罪率上升。周六晚上，警察局可能会在那里部署更多警察。如果那里确实发生了犯罪，该部门可能会使用面部识别技术来筛选监控录像，以找到并识别个人。\n根据加州圣莫尼卡的非营利性智库兰德公司(RAND Corporation)2013年的一次研究简报，预测性警务由四个部分组成(如上图所示)。在前两个步骤中，研究人员收集和分析有关犯罪、事件和罪犯的数据，以做出预测。从那里，警方根据预测进行干预，通常在特定时间以增加某些地点的资源的形式进行干预。理想情况下，第四步是减少犯罪。\n作者指出，执法机构应该评估干预的直接影响，以确保不会立即出现明显的问题。机构还应该通过检查收集的数据、执行额外的分析并根据需要修改操作来跟踪较长期的变化。\n在许多情况下，预测性警务软件本应成为一种工具，以增强面临预算危机的警察部门，而警察人数较少，无法覆盖一个地区。如果警察能够在特定的时间针对特定的地理区域，那么他们就可以提前拨打911电话，甚至可能降低犯罪率。\n但在实践中，这项技术的准确性受到了质疑-它甚至被称为种族主义。\n数学家与预见性警务保持距离的部分动机可以追溯到2016年8月的一次研讨会，该研讨会倡导数学家参与警察部门的工作。\n由国家科学基金会资助的罗德岛州普罗维登斯市布朗大学数学计算与实验研究所(ICERM)为20至25名研究人员举办了研讨会。总部位于加利福尼亚州圣克鲁斯的科技公司PredPol是合作伙伴之一，该公司向美国各地的部门开发和销售预测警务工具。\n根据活动的通知，为期一周的项目包括与普罗维登斯警察局合作。小团队专注于真实犯罪和警务数据的实际问题，集思广益，以数学方法和模型来帮助警察，甚至在必要时创建代码来实现想法。\n活动组织者当时表示，他们完全预计将形成持久的合作，研讨会结束后，项目的工作将继续进行。\n华盛顿大学数学系教授克里斯托弗·霍夫曼(Christopher Hoffman)也在这封信上签名，他告诉大众机械(Popular Mechanical)，机构的买入与他和他的同事们有关。他说，当一家大型机构这么做时，就像是在说，这是我们作为一个社区所重视的东西。\n阿特里亚说，在关于预测性警务的研讨会之前，他参加了ICERM的研讨会，并表达了他当时的担忧。他说，数学家不应该建造这种软件，也不应该对其进行投资。他指出，研究人员有时在该软件中既有智力上的利害关系，也有经济上的利害关系。\n我们一直是这些真正有问题的机构的一部分，现在是我们反思和决定的时候了，我们不会作为一个社区这样做，我们不会与正在杀人的组织合作。\n研究人员对PredPol提出了特别的质疑，这家备受瞩目的公司帮助举办了ICERM研讨会，在信中声称其技术制造了种族主义反馈循环。换句话说，他们认为该软件无助于预测未来的犯罪，反而强化了警官的偏见。\n不过，PredPol首席执行官布莱恩·麦克唐纳告诉“大众机械”杂志，PredPol从不使用逮捕数据，因为这可能存在警官偏见。他说，相反，该公司只使用受害者自己向警方报告的数据。因此，如果你的车被破门而入，你可以打电话给警察，告诉他们关于犯罪类型、地点和时间的信息。他说，警察可能会通过电话获取这些信息，或者让你填写一张在线表格。\n哈弗福德学院(Haverford College)数学助理教授、信件签字人塔里克·奥加布(Tarik Aougab)告诉大众机械(Popular Mechanical)，保留PredPol模型中的逮捕数据不足以消除偏见。\n奥加布说，预测性警务的问题在于，它不仅仅是个别官员的偏见。有一种巨大的结构性偏见在起作用，除了其他因素外，它可能会将轻微的商店盗窃或使用假钞(这最终导致乔治·弗洛伊德被谋杀)视为一种犯罪，警方应该首先对此做出回应。\n此内容是从{embed-name}导入的。您可以在他们的网站上找到不同格式的相同内容，也可以找到更多信息。\n他说，一般来说，有很多人不会报警，我认识的很多人都不会报警，因为他们有理由担心当警察到来时会发生什么事，因为他们有理由害怕警察到来时可能会发生的事情。我认识很多人，其中很多人都不会报警，他说，因为他们有理由害怕警察到来时可能会发生的事情。他说，如果警察真的来了，他们有理由害怕可能会发生的事情。\n这个想法在软件的实际工作方式上重新浮出水面。正如2019年2月的一篇副报道所报道的那样，PredPol使用了一种用于预测地震余震的统计建模方法。\n麦克唐纳说，同样的方法也适用于犯罪预测，因为这两个问题都有需要解决的地点和时间因素。然而，“罪恶故事”呼应了奥加布的担忧，即一些犯罪被漏报或未上报，这意味着外部影响可能会扭曲时间和地点数据。\n麦克唐纳说，PredPol目前大约有50名客户。作为背景，美国大约有18000个警察部门。但阿特里亚说，一个更好的衡量标准来自PredPol自己的网站：每33个美国人中就有一个受到该软件的保护。他说，这些数字看起来如此不同，是因为该国一些最大的警察部门正在使用这项技术。\n当然，PredPol并不存在于泡沫中。2011年，洛杉矶警察局开始使用名为洛杉矶战略提取和恢复(LASeR)的预测性警务软件，最终于2019年4月停止使用。\n霍夫曼说，[洛杉矶警察局]对此进行了调查，发现几乎无法对该软件的有效性做出任何结论。我们甚至不知道这对警察在哪里巡逻有影响。\n与此同时，阿特里亚说，纽约市警察局使用了三种不同的预测警务工具：Azavea、Keystats和PredPol，以及可以追溯到2013年的内部预测警务算法。\n在芝加哥，官员们一直在使用一个名为战略主题列表的内部数据库，直到去年11月，该部门停止使用该数据库。据阿特里亚称，兰德公司发现，这份名单包括了自2013年以来在芝加哥被捕或采集指纹的每一个人。\n芝加哥监察长办公室1月份的一份声明指出，这项技术的一些主要问题包括：风险分数和等级的不可靠性；宣誓人员培训不当；缺乏对内部和外部访问的控制；受PTV风险模型影响的干预，这些模型可能会给逮捕带来负面后果，但不会导致定罪；以及缺乏维持PTV模型的长期计划。\n就在几周前，圣克鲁斯警察局禁止使用预测性警务工具。早在2011年，该部门就开始了一个预测性警务试点项目，旨在缓解那些在该市大幅削减警察预算时被服务电话淹没的警察的压力。\n虽然圣克鲁斯警察局对这项技术的彻底禁令可能受到了最近“黑人生命也是命”抗议活动的影响，但该部门早在2017年就已经暂停了这项技术。\n警察局长安迪·米尔斯(Andy Mills)告诉“洛杉矶时报”(Los Angeles Times)，如果预测性警力被用来与社区合作解决问题，而不是纯粹的执法，那么它可能会有效。\n米尔斯告诉“洛杉矶时报”，当你回首往事时，你会尝试不同的东西，然后才会学到东西。你说，天哪，那是一个我没有看到的盲点。我认为未来我们可以防止这种情况发生的方法之一是与社区成员坐下来说，这是我们有兴趣使用的东西。告诉我们你对这件事的看法。你担心什么？\n不过，霍夫曼表示，我们无法知道这项技术在美国到底有多普及。他说，人们很难获得关于谁在使用这款软件以及他们用它做什么的信息。\n数学家们表示，阿特里亚希望表明，他们的抵制不仅仅是理论上的担忧。但如果这项技术继续存在，至少应该有一些实施指导方针。他们有一些要求，但大多归结为透明度和社区认同的概念。\n专家们应该积极主动地参与到审计过程中来，利用数学来防止权力的滥用。\n数学家应该与社区团体、监督委员会和其他组织合作，如“人工智能中的黑人”和“数据4黑人生活”，开发出替代压迫和种族主义做法的方法。\n开设数据科学课程的学术部门应该实施学习成果，以解决此类工具的伦理、法律和社会影响。\n阿特里亚说，自从这封信上线以来，至少有1500名其他研究人员通过谷歌表格签约。他对这种回应表示欢迎。\n他说，我认为预见性警务永远不应该存在，特别是当它让人们付出生命代价的时候。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息。\n此评论区由第三方创建和维护，并导入到此页面。你可以在他们的网站上找到更多信息。", "note_en": "Mathematicians at universities across the country are halting collaborations with police departments across the U.S.\n A June 15  letter was sent to the trade journal  Notices of the American Mathematical Society,   announcing the   boycott.\n Typically, mathematicians work with police departments to build  algorithms, conduct modeling work, and analyze data.\n   Several prominent academic mathematicians want to sever ties with police departments across the U.S., according to a letter submitted to  Notices of the American Mathematical Society on June 15. The letter arrived weeks after widespread protests against police brutality, and has inspired over 1,500 other researchers  to join the boycott.\n These mathematicians are urging fellow researchers to stop all work related to predictive policing software, which broadly includes any data analytics tools that use historical data to help forecast future crime, potential offenders, and victims. The technology is supposed to use probability to help police departments tailor their neighborhood coverage so it puts officers in the right place at the right time.\n  &#34;Given the structural racism and brutality in U.S. policing, we do not believe that mathematicians should be collaborating with police departments in this manner,&#34; the authors write in the  letter. &#34;It is simply too easy to create a &#39;scientific&#39; veneer for racism. Please join us in committing to not collaborating with police. It is, at this moment, the very least we can do as a community.&#34;\n Some of the mathematicians include Cathy O&#39;Neil, author of the popular  book  Weapons of Math Destruction, which outlines the very algorithmic bias that the letter rallies against. There&#39;s also Federico Ardila, a Colombian mathematician currently teaching at San Francisco State University, who is known for his  work to diversify the field of mathematics.\n &#34;This is a moment where many of us have become aware of realities that have existed for a very long time,&#34; says Jayadev Athreya, associate professor at the University of Washington&#39;s Department of Mathematics who signed the letter, told  Popular Mechanics. &#34;And many of us felt that it was very important to make a clear statement about where we, as mathematicians, stand on these issues.&#34;\n  This content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  The Electronic Frontier Foundation, a nonprofit digital rights group,  defines predictive policing as &#34;the use of mathematical analytics by law enforcement to identify and deter potential criminal activity.&#34;\n That can include statistical or machine learning algorithms that rely on police records detailing the time, location, and nature of past crimes in a bid to predict if, when, where, and who may commit future infractions. In theory, this should help authorities use resources more wisely and spend more time policing certain neighborhoods that they think will yield higher crime rates.\n Predictive policing is not the same thing as facial recognition technology, which is more often used after a crime is committed to attempt to identify a perpetrator. Police may use these technologies together, but they are fundamentally different.\n For example, if predictive policing software shows that a bar sees heightened crime at 2 a.m. on Saturday nights, a police department might deploy more officers there. If and when a crime  does occur there, the department might use facial recognition technology to sift through surveillance footage feeds to find and identify the individual.\n  According to a 2013  research briefing from the RAND Corporation, a nonprofit think tank in Santa Monica, California, predictive policing is made up of a four-part cycle (shown above). In the first two steps, researchers collect and analyze data on crimes, incidents, and offenders to come up with predictions. From there, police intervene based on the predictions, usually taking the form of an increase in resources at certain sites at certain times. The fourth step is, ideally, reducing crime.\n &#34;Law enforcement agencies should assess the immediate effects of the intervention to ensure that there are no immediately visible problems,&#34; the authors note. &#34;Agencies should also track longer-term changes by examining collected data, performing additional analysis, and modifying operations as needed.&#34;\n In many cases, predictive policing software was meant to be a tool to augment police departments that are facing budget crises with less officers to cover a region. If cops can target certain geographical areas at certain times, then they can get ahead of the 911 calls and maybe even reduce the rate of crime.\n But in practice, the accuracy of the technology has been contested—and it&#39;s even been called racist.\n      Part of the impetus behind the mathematicians&#39; move to distance themselves from predictive policing dates back to an August 2016  workshop that advocated for mathematicians&#39; involvement with police departments.\n The Institute for Computational and Experimental Research in Mathematics (ICERM) at Brown University in Providence, Rhode Island—which is funded by the National Science Foundation—put on the workshop for 20 to 25 researchers. PredPol, a Santa Cruz, California-based technology firm that develops and sells predictive policing tools to departments across the U.S., was one of the partners.\n According to a  notice for the event, the one-week program included work alongside the Providence Police Department. Small teams focused on real problems with real crime and policing data to brainstorm mathematical methods and models that could help the officers, even &#34;creating code to implement ideas as necessary.&#34;\n  The event organizers said at the time that they &#34;fully anticipate that lasting collaborations will be formed, and that work on the projects will continue after the workshop ends.&#34;\n Christopher Hoffman, a professor at the University of Washington&#39;s Department of Mathematics who also signed the letter, tells  Popular Mechanics that the institutional buy-in concerned him and his colleagues. &#34;When a large institute does that, it&#39;s like saying &#39;this is something that we, as a community, value,&#39;&#34; he says.\n Athreya says that he attended an ICERM workshop prior to the one on predictive policing and voiced his concerns at the time. Mathematicians should not be building this software, or investing in it, he says, noting that the researchers have, at times, both an intellectual and financial stake in the software.\n &#34;We have been a part of these really problematic institutions, and this is a moment for us to reflect and decide that we&#39;re not going to do this as a community, we&#39;re not going to collaborate with organizations that are killing people.&#34;\n      The researchers take particular issue with PredPol, the high-profile company that helped put on the ICERM workshop, claiming in the letter that its technology creates racist feedback loops. In other words, they believe that the software doesn&#39;t help to predict future crime, but instead reinforces the biases of the officers.\n But CEO Brian MacDonald tells  Popular Mechanics that PredPol never uses arrest data, &#34;because that has the possibility for officer bias.&#34; Instead, he says, the company only uses data that victims have reported to police, themselves. So if your car has been broken into, you might call the police to give them information about the type of crime, the location, and the timing. Police officers might take this information over the phone, or have you fill out an online form, he says.\n Tarik Aougab, an assistant professor of mathematics at Haverford College and letter signatory, tells  Popular Mechanics  that keeping arrest data from the PredPol model is not enough to eliminate bias.\n &#34;The problem with predictive policing is that it&#39;s not merely individual officer bias,&#34; Aougab says. &#34;There&#39;s a huge structural bias at play, which amongst other things might count minor shoplifting, or the use of a counterfeit bill, which is what eventually precipitated the murder of George Floyd, as a crime to which police should respond to in the first place.&#34;\n This content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  &#34;In general, there are lots of people, many whom I know personally, who wouldn&#39;t call the cops,&#34; he says, &#34;because they&#39;re justifiably terrified about what might happen when the cops do arrive.&#34;\n That idea resurfaces in how the software actually works. As a February 2019  Vice  story reports, PredPol uses a statistical modeling method used to predict earthquake aftershocks.\n MacDonald says that the same approach works in predicting crime because &#34;both of these problems have a location and time element for which to be solved.&#34; However, the  Vice story echoes Aougab&#39;s concern that some crimes go underreported or unreported, meaning that outside influences could skew the time and location data.\n   MacDonald says that PredPol has about 50 customers at the moment. For context, there are about  18,000 police departments in the U.S. But Athreya says a better metric comes from PredPol&#39;s own website: one in 33 Americans are protected by the software. He says that the figures seem so divergent because some of the largest police departments in the country are using the technology.\n Of course, PredPol doesn&#39;t exist in a bubble. In 2011, the LAPD began using predictive policing software called the Los Angeles Strategic Extraction and Restoration (LASER), which it eventually  stopped using in April 2019.\n &#34;The [Los Angeles Police Department] looked into this, and found almost no conclusion could be made about the effectiveness of the software,&#34; Hoffman says. &#34;We don&#39;t even really know if it makes a difference in where police are patrolling.&#34;\n Meanwhile, the New York City Police Department uses three different predictive policing tools: Azavea, Keystats, and PredPol, as well as its own in-house predictive policing algorithms that date back to 2013, Athreya says.\n     In Chicago, officers used an in-house database called the &#34;Strategic Subject List&#34; until last November, when the department  decommissioned its use. &#34;The RAND corporation found that this list included every single person arrested or fingerprinted in Chicago since 2013,&#34; according to Athreya.\n A January  statement from Chicago&#39;s Office of the Inspector General noted that some of the major issues with the technology included: &#34;the unreliability of risk scores and tiers; improperly trained sworn personnel; a lack of controls for internal and external access; interventions influenced by PTV risk models which may have attached negative consequences to arrests that did not result in convictions; and a lack of a long-term plan to sustain the PTV models.&#34;\n Just a few weeks ago, the Santa Cruz Police Department  banned the use of predictive policing tools. Back in 2011, the department began a predictive policing pilot project that was meant to ease the strain on officers who were swamped with service calls at a time when the city was slashing police budgets.\n While the Santa Cruz Police Department&#39;s outright ban on the technology might&#39;ve been influenced by recent Black Lives Matter protests, the department had already placed a moratorium on the technology back in 2017.\n Police Chief Andy Mills told the  Los Angeles Times that predictive policing could have been effective if it had been used to work together with the community to solve problems, rather than &#34;to do purely enforcement.&#34;\n &#34;You try different things and learn later as you look back retrospectively,&#34; Mills told the  LA  Times. &#34;You say, &#39;Jeez, that was a blind spot I didn’t see.&#39; I think one of the ways we can prevent that in the future is sitting down with community members and saying, &#39;Here&#39;s what we are interested in using. Give us your take on it. What are your concerns?&#39;\n Still, Hoffman says there&#39;s no way to know just how prevalent the technology is in the U.S. &#34;It&#39;s very difficult for people to get information about who is using this software and what are they using this for,&#34; he says.\n  Athreya wants to make it clear that their boycott is not just a &#34;theoretical concern.&#34; But if the technology continues to exist, there should at least be some guidelines for its implementation, the mathematicians say. They have a few demands, but they mostly boil down to the concepts of transparency and community buy-in.\n  Experts should participate in that audit process as proactive way to use mathematics to &#34;prevent abuses of power.&#34;\n Mathematicians should work with community groups, oversight boards, and other organizations like  Black in AI and  Data 4 Black Lives to develop alternatives to &#34;oppressive and racist&#34; practices.\n Academic departments with data science courses should implement learning outcomes that address the &#34;ethical, legal, and social implications&#34; of such tools.\n Since the letter went live, at least 1,500 other researchers have signed on through a  Google Form, Athreya says. And he welcomes that response.\n &#34;I don&#39;t think predictive policing should ever exist,&#34; he says, &#34;especially when it’s costing people their lives.&#34;\n  This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n   This commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "posttime": "2020-07-22 00:37:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数学家,mathematicians,警察", "title": "为什么数以百计的数学家抵制预测性警察", "title_en": "Why Hundreds of Mathematicians Are Boycotting Predictive Policing", "transed": 1, "url": "https://www.popularmechanics.com/science/math/a32957375/mathematicians-boycott-predictive-policing/", "via": "", "real_tags": ["数学家", "警察"]}, {"category": "", "categoryclass": "", "imagename": "7c10bbfcc0cdd4c65bf2d07e797b08a8.jpg", "infoid": 1013312, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在有了一个新的筹款平台，名为Project Bento，由厨师兼餐厅老板马库斯·萨缪尔森(Marcus Samuelsson)(最出名的是红公鸡哈莱姆区背后的厨师)、德里克·埃文斯(Derek Evans)(马库斯·萨缪尔森集团(Marcus Samuelsson Group)首席执行官)和Sage Digital(一家为评论员、厨师和其他专家创建工具以发布内容和建立追随者的初创公司)创建的。\nSamuelsson告诉我，他已经在与Sage Digital合作，在这个平台上创建一个存在的平台。然后他提到了哈莱姆服务，这是一年一度的哈莱姆EatUp节日的今年版本-Samuelsson和他的团队在大流行期间重新设计了这一活动，作为非营利性组织对抗粮食不安全的筹款电视节目。\n但是，Samuelsson说，当他调查可用于管理在线筹款的选项时，他对任何可用的选项都不太满意。\n“我们非常考虑我们的需求--我们在建设什么，我们希望消费者如何利用它，”他说。\n因此，Sage Digital团队最终在创业公司现有平台的基础上，在七八周内完成了“便当计划”(Project Bento)。Sage首席执行官萨米尔·阿罗拉(Samir Arora)表示，除了允许非营利组织筹集资金(无需支付平台费用)、发布内容、在社交媒体上推广和跟踪他们的活动外，该平台还包括管理赞助和匹配捐赠者的工具。\n萨缪尔森说，这种快速的发展完美地证明了“什么是企业家精神”。到目前为止，Project Bento已经为哈莱姆服务筹集了超过35万美元，还有480万美元给Project Bento Fund(阿罗拉将其描述为一个“全新的非营利性组织，其目的是为平台上的活动创造匹配的资金”)。\n已经有其他几个活动直播，以及其他平台上员工救济筹款活动的链接，但Project Bento也在接受其他希望在该平台上筹款的非营利性组织的申请。Samuelsson说，他希望这个网站能成为一个可以将许多这样的活动聚集在一起的地方。\n萨缪尔森说：“不仅在哈莱姆区，而且在全国各地，都有一些社区需要一场运动，他们需要联系起来。”“(本托项目)将继续，因为筹集资金和连接社区的需求将继续存在。”", "note_en": "Now there’s a new fundraising platform called  Project Bento, created by chef and restauranteur Marcus Samuelsson (best known as the chef behind Red Rooster Harlem), Derek Evans (CEO of the Marcus Samuelsson Group) and the team at  Sage Digital (a startup  creating tools for reviewers, chefs and other experts to publish content and build a following).\n Samuelsson told me that he’d already been working with  Sage Digital   to create a presence on the platform. Then he mentioned Harlem Serves Up, this year’s version of the annual Harlem EatUp festival — Samuelsson and his team reinvented the event during the pandemic as  as a fundraising telethon for nonprofits fighting food insecurity.\n  But, Samuelsson said that when he surveyed the options available to manage the online fundraising, he wasn’t quite satisfied with any of the available options.\n  “We were thinking very much about our needs — what were we building, how do we want consumers to utilize it,” he said.\n So the Sage Digital team ended up building Project Bento in seven or eight weeks, on top of the startup’s existing platform. Sage CEO Samir Arora said that along with allowing nonprofits to collect funds (without having to pay a platform fee), publish content, promote on social media and track their campaigns, the platform also includes tools for managing sponsorships and matching donors.\n The rapid development, Samuelsson said, was a perfect demonstration of “what entrepreneurship is.” Thus far, Project Bento has been used to raise more than $350,000 for  Harlem Serves Up, as well as $4.8 million for the  Project Bento Fund (which Arora described as a “completely new nonprofit whose purpose is to create matching funds” for campaigns on the platform).\n There are several other campaigns live already, as well as links to employee relief fundraisers on other platforms, but Project Bento is also accepting applications from other nonprofits that want to fundraise on the platform. Samuelsson said he wants the website to be a place that can bring many of these campaigns together.\n “There are communities not just in Harlem, but across the country, that need a campaign, they need to connect,” Samuelsson said. “[Project Bento] will continue because that need, raising money and connecting a community, will continue.”", "posttime": "2020-07-22 00:36:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "筹款,fundraising,平台", "title": "\n厨师Marcus Samuelsson与Sage Digital合作推出便当项目筹款平台", "title_en": "\n\t\t\t\tChef Marcus Samuelsson teams up with Sage Digital to launch Project Bento fundraising platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/marcus-samuelsson-project-bento/", "via": "", "real_tags": ["筹款", "平台"]}, {"category": "", "categoryclass": "", "imagename": "b9a15a6592567c3bf89861233258c27b.jpg", "infoid": 1013311, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "佩顿·卡尔(Peyton Carr)是创始人、企业家及其家人的财务顾问，帮助他们进行规划和投资。他是Keystone Global Partners的董事总经理。\n在接下来的部分中，我将揭示许多首次集中持股的股东头脑中存在的集中持股“致富”迷思的事实，并说明为什么考虑更大程度的多元化是审慎的。\n继续阅读，了解更多关于多元化的好处，发现有多少公司股票可能太多而无法持有，以及当涉及到多元化战略时，你有哪些选择。\n在考虑保持集中仓位时，有几个铁的事实需要牢记：\n这是一个显而易见的事实，但并不是所有的股票都是苹果或AMZN。亨德里克·贝森宾德(Hendrik Bessembinder)发表的研究发现，表现最好的4%的上市公司解释了自1926年以来整个美国股市的回报。其余96%的股票整体表现与美国国库券相当。自1926年以来，58%的股票在其一生中都未能击败一个月期国库券。40%的罗素3000(美国最大的3000家上市公司的指数)。自1980年以来，它们的价值从峰值至少缩水了70%。\n尽管如此，基础广泛的股票每年的回报率超过9%，超过了大多数其他资产类别，最终归功于排名前4%的股票。尽管不能保证任何人都能在未来的前4%中挑出任何一个，但多元化将保证你将拥有前4%的股份。\n即使你持有的集中股票将是另一只AAPL/AMZN，这两只股票在其一生中的某个时候都经历了90%以上的跌幅。大多数投资者将无法有信心并保持投资，特别是如果集中的股票推动了他们投资组合的大部分回报和净值。有时，灾难性的下滑是行业的一种功能，或者是与公司本身关系不大的生存威胁。其他时候，这完全与公司有关，与外部因素无关。\n任何新IPO进入前4%的几率只比你在轮盘赌上命中幸运数字的几率略高一点。但是，你的投资组合的成功和实现长期财务目标的可能性是你想要推动的吗？\n过度波动可能会损害回报。注意下面的例子，它显示了低波动率的多元化投资组合与高波动率的集中投资组合之间的比较。尽管简单平均收益相同，但下方的低波动率投资组合的表现明显好于高波动率投资组合。\n除了数学上的原因，波动性的意外激增可能会导致价格大幅下跌。波动性增加了投资者情绪反应和做出糟糕投资决定的机会。稍后我将介绍行为金融学方面的内容。降低你的投资组合波动性可以像增加你的投资组合多样化一样简单。\n罗素3000指数代表了美国最大的3000家上市公司，与所有单一股票95%以上的波动性相比，该指数的波动性较低。那么，你会因为波动性较低而放弃多少回报呢？\n根据Northern Trust Research的数据，罗素3000指数5.96%的年化平均回报率比中值股票5.23%的回报率高出0.73%。此外，拥有罗素3000，而不是单一的股票，消除了灾难性亏损情景的可能性-超过20%的股票在20年的时间框架内平均每年亏损超过10%。\n如果这确立了避免过度集中投资组合是重要的，那么多少股票才是太多呢？那你们应该以什么价格出售呢？\n我们认为任何股票头寸或风险敞口超过投资组合的10%都是集中头寸。没有确切的数字，但适当的集中度取决于几个因素，如你的流动性需求、整体投资组合价值、风险偏好和较长期的财务计划。然而，在10%以上，该单一头寸的回报和波动性可能开始主导投资组合，使你面临高度的投资组合波动性。\n你投资组合中的公司“股票”通常只占你对公司整体财务敞口的一小部分。想想你的其他可能的风险敞口来源，比如限制性股票、RSU、期权、员工股票购买计划、401K、其他股权薪酬计划，以及你目前和未来与公司成功相关的工资流。在大多数情况下，实现你的财务目标的谨慎途径涉及到一个多元化的投资组合。\n抛开事实不谈，保持公司股票的集中仓位比采取更慎重的方法更具诱惑力。像扎克伯格和贝佐斯这样的象征性例子往往会让沉闷的现实理论黯然失色，很难辩驳通过押注于自己而变得极其富有的可能性。换句话说，你的情绪可以战胜你。\n但你的目标-而不是你的情绪-应该推动你的投资策略和关于你股票的决定。你的投资组合和其中的公司股票应该被用作实现这些目标的工具。\n因此，首先，我们将深入研究影响我们决策的行为心理学。\n为什么这么难摇呢？这是人类的自然倾向。我懂了。我们有强烈的动力使我们的偏见合理化，并且不相信我们容易受到它们的影响。\n依附于你的公司是很常见的，因为毕竟，那只股票让你变得富有，或者有可能让你变得富有。通常情况下，出售和多元化是一个艰难但更理性的决定。\n大量的研究已经为投资和心理之间的关系提供了洞察力。许多未被认识到的心理障碍和行为偏差可能会影响你持有集中股票，即使数据显示你不应该持有。\n理解这些偏见在决定如何处理你的股票时会很有帮助。这些行为偏差很难发现，更难克服。然而，意识是第一步。这里有几个更常见的行为偏见，看看是否有适用于你的：\n熟悉度偏差：熟悉度可能是为什么这么多创始人愿意集中持有自己公司股票的原因。人们很容易混淆对自己公司的熟悉和股票的安全性。在股票市场上，熟悉度和安全性并不总是相关的。一家伟大的(安全的)公司有时会有危险的高估股价，而糟糕的公司有时会有严重低估的股价。这不仅仅是关于公司的质量，而是公司质量和股票价格之间的关系，决定了一只股票在未来是否可能表现良好。\n另一种表现方式是，当一位创始人在股市投资方面经验较少，只持有他们公司的股票时。他们可能会认为市场比他们的公司有更多的风险，而实际上，这通常比只持有他们的个人头寸更安全。\n过度自信：当每个投资者持有一只股票的仓位过于集中时，他们都表现出过度自信。创始人可能会相信他们的公司；毕竟，它已经取得了足够的成功，可以上市了。这种信心可能会错放在股票中。创始人通常不愿出售他们的股票，如果股票一直在上涨，因为他们相信股票还会继续上涨。如果股票已经抛售，情况正好相反，他们相信股票会回升。通常情况下，当创始人与公司关系如此密切时，要做到客观是一件很有挑战性的事情。他们通常认为自己拥有独特的信息，知道股票的“真实”价值。\n锚定：一些投资者会将他们的信念锚定在他们过去经历过的事情上。如果集中的股票价格下跌，投资者可能会锚定他们的信念，认为这只股票值得最近更高的价值，而不愿出售。这只股票之前的价值并不是其实际价值的指标。实际价值是买家和卖家交换股票时的当前价格，同时纳入了目前所有可用的信息。\n禀赋效应：许多投资者倾向于对他们目前拥有的资产进行更高的估值，而不是根本不拥有。这使得销售变得更加困难。检查禀赋效应的一个很好的方法是问问自己：“如果我没有持有这些股票，我今天会以这个价格购买它们吗？”如果你今天不愿意以这个价格购买股票，很可能意味着你只是因为禀赋效应而持有股票。\n有趣的是，我们来看看宜家效应的研究，该研究表明，人们对自己制造的东西的重视程度超过了它的潜在价值。\n当以这种方式框定时，投资者可以更有目的地决定是继续持有集中股票还是抛售。有时，这些偏见很难发现，这就是为什么有第二个人、副驾驶或顾问是有帮助的。\n祝贺那些在贵公司拥有集中股票头寸的人；这是来之不易的，很可能代表着一笔物质财富。要知道，当涉及到管理集中库存时，没有“正确”的答案。每种情况都是独一无二的，因此必须与专业人士讨论特定于您的情况的选择。\n首先要有一个财务计划，包括你想要实现的具体投资目标。一旦你对你想要实现的目标有了清晰的认识，你就可以用新的眼光来看待事实，并更深入地认识到持有公司股票集中头寸的危险与多元化的好处，考虑到理性决策和投资行为所涉及的所有影响和机会。\n大多数个人都明白，他们可以简单而直接地出售股权，但还有多种其他策略。其中一些机会可能在最大限度地减少税收方面做得更好，或者在实现预期的风险或回报方面做得更好。有些人可能会想，什么时候是卖出的最佳时机。我将在本系列的最后一篇文章中介绍这些主题。", "note_en": "Peyton Carr is a financial advisor to founders, entrepreneurs and their families, helping them with planning and investing. He is a managing director of  Keystone Global Partners.\n  In the following section, I reveal the facts of the concentrated stock “get rich” myths that reside in the minds of many first-time concentrated stock owners, and I show why it is prudent to consider greater diversification.\n Keep reading to learn more about the benefits of diversification, discover how much company stock is likely too much to hold, and the options you have when it comes to diversifying strategically.\n   There are several hard facts to keep in mind in contemplating maintaining a concentrated position:\n It’s stating the obvious, but not all stocks are AAPL or AMZN. Hendrik Bessembinder published research that found the  best performing 4% of listed companies explained the returns for the entire U.S. stock market since 1926. The remaining 96% of stocks collectively matched the performance of U.S. Treasury bills. Since 1926, 58% of stocks have failed to beat one-month Treasury bills over their lifetimes. Forty percent of all Russell 3000 (an index of the 3000 largest publicly traded companies in the U.S.) have lost at least 70% of their value from their peak since 1980.\n Despite all this, broad-based equities have returned 9%+ a year, beating most other asset classes, ultimately due to the top 4% of stocks. Although there is no guarantee anyone can single out any of the top 4% going forward, diversification will guarantee you will own the top 4%.\n Even if the concentrated stock you own will be another AAPL/AMZN, both stocks have experienced declines of 90%+ at some point throughout their lifetimes. Most investors would not be able to have conviction and stay invested, especially if that concentrated stock was driving the majority of their portfolio returns and net worth. Sometimes catastrophic declines are a function of the industry or existential threats that have little to do with the company itself. Other times, it has everything to do with the company and nothing to do with external factors.\n The odds of any new  IPO   being among the top 4% is just slightly better than hitting your lucky number on the roulette wheel. But is your investment portfolio success and the odds of achieving your long-term financial goals something you want to spin the wheel on?\n  Excess volatility can harm returns. Note the example below that shows the comparison between a low-volatility diversified portfolio versus a high-volatility concentrated portfolio. Despite the same simple average return, the low-volatility portfolio below materially outperforms the high-volatility portfolio.\n  Beyond the math, unexpected spikes in volatility can cause significant price declines. Volatility increases the chances that an investor reacts emotionally and makes a poor investment decision. I’ll cover the behavioral finance aspect of this later. Lowering your portfolio volatility can be as simple as increasing your portfolio diversification.\n The Russell 3000, an index representing the 3,000 largest U.S.-based publicly traded companies, has lower volatility when compared against 95%+ of all single stocks. So, how much return do you give up for having lower volatility?\n According to Northern Trust Research, the 5.96% annualized average return of the Russell 3000 is 0.73% more than the 5.23% return of the median stock. Additionally, owning the Russell 3000, rather than a single stock, eliminates the likelihood of catastrophic loss scenarios — more than 20% of shares averaged a loss of more than 10% per year over a 20-year time frame.\n If this establishes that the avoidance of overly concentrated portfolios is important, how much stock is too much? And at what price should you sell?\n  We consider any stock position or exposure greater than 10% of a portfolio to be a concentrated position. There is no hard number, but the appropriate level of concentration is dependent on several factors, such as your liquidity needs, overall portfolio value, the appetite for risk and the longer-term financial plan. However, above 10% and the returns and volatility of that single position can begin to dominate the portfolio, exposing you to high degrees of portfolio volatility.\n The company “stock” in your portfolio often is only a fraction of your overall financial exposure to your company. Think about your other sources of possible exposure such as restricted stock, RSUs, options, employee stock purchase programs, 401k, other equity compensation plans, as well as your current and future salary stream tied to the company’s success. In most cases, the prudent path to achieving your financial goals involves a well-diversified portfolio.\n  Facts aside, maintaining a concentrated position in your company stock is far more tempting than taking a more measured approach. Token examples like Zuckerberg and Bezos tend to outshine the dull rationale of reality, and it’s hard to argue against the possibility of becoming fabulously wealthy by betting on yourself. In other words, your emotions can get the best of you.\n But your goals — not your emotions — should be driving your investment strategy and decisions regarding your stock. Your investment portfolio and the company stock(s) within it should be used as tools to achieve those goals.\n So first, we’ll take a deep dive into the behavioral psychology that influences our decision-making.\n   Why is it so hard to shake? This is a natural human tendency. I get it. We have a strong impetus to rationalize our biases and not believe we are vulnerable to being influenced by them.\n Becoming attached to your company is common, since after all, that stock has made you, or has the potential of making you wealthy. More often than not, selling and diversifying is the tough, but more rational decision.\n Numerous studies have furnished insights into the correlation between investing and psychology. Many unrecognized psychological barriers and behavioral biases can influence you to hold concentrated stock even when the data shows that you should not.\n Understanding these biases can be helpful when deciding what to do with your stock. These behavioral biases are hard to spot and even harder to overcome. However, awareness is the first step. Here are a few more common behavioral biases, see if any apply to you:\n Familiarity bias: Familiarity is likely why so many founders are willing to hold concentrated positions in their own company’s stock. It is easy to confuse the familiarity with your own company with the safety in the stock. In the stock market, familiarity and safety are not always related. A great (safe) company sometimes can have a dangerously overvalued stock price, and terrible companies sometimes have terrifically undervalued stock prices. It’s not just about the quality of the company but the relationship between the quality of a company and its stock price that dictates whether a stock is likely to perform well in the future.\n Another way this manifests is when a founder has less experience with stock market investing and has only owned their company stock. They may think the market has more risk than their company when in actuality, it is usually safer than holding just their individual position.\n Overconfidence: Every investor is exhibiting overconfidence when they hold an overly concentrated position in an individual stock. Founders are likely to believe in their company; after all, it already achieved enough success to IPO. This confidence can be misplaced in the stock. Founders often are reluctant to sell their stock if it has been going up since they believe it will continue to go up. If the stock has sold off, the opposite is true, and they are convinced it will recover. Often, it is challenging for founders to be objective when they are so close to the company. They commonly believe that they have unique information and know the “true” value of the stock.\n Anchoring: Some investors will anchor their beliefs to something they experienced in the past. If the price of the concentrated stock is down, investors may anchor their belief that the stock is worth its recent previous higher value and be unwilling to sell. This previous value of the stock is not an indicator of its real value. The real value is the current price where buyers and sellers exchange the stock while incorporating all presently available information.\n Endowment effect: Many investors tend to place a higher value on an asset they currently own than if they did not own it at all. It makes it harder to sell. An excellent way to check for the endowment effect is to ask yourself: “If I did not own these shares, would I purchase them today at this price?” If you are not willing to purchase the shares at this price today, it likely means you are only holding onto the shares because of the endowment effect.\n A fun spin on this is to look into the  IKEA effect study, which demonstrates that people assign more value to something that they made than it is potentially worth.\n When framed this way, investors can make more intentional decisions on whether to continue holding concentrated stock or selling. At times, these biases are hard to spot, which is why having a second person, a co-pilot, or an advisor, is helpful.\n  Congratulations to those of you with a concentrated stock position in your company; it is hard-earned and likely represents a material wealth. Understand, there is no “right” answer when it comes to managing concentrated stock. Each situation is unique, so it is essential to speak with a professional about options specific to your situation.\n It starts with having a financial plan, complete with specific investment goals that you want to achieve. Once you have a clear picture of what you want to accomplish, you can look at the facts in a new light and gain a deeper appreciation for the dangers of holding a concentrated position in company stock versus the benefits of diversification, considering all of the implications and opportunities involved in rational decision-making and investment behavior.\n  Most individuals understand they can simply and directly sell their equity, but there are a variety of other strategies. Some of these opportunities may be far better at minimizing taxes or better at achieving the desired risk or return profile. Some might wonder what the best timing is to sell. I will cover these topics in the final article of the series.", "posttime": "2020-07-22 00:36:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "是否,worth,股票", "title": "\n你的净资产是否与你公司的成功联系得太紧密了？", "title_en": "\n\t\t\t\tIs your net worth too closely tied to your company’s success?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/is-your-net-worth-too-closely-tied-to-your-companys-success/", "via": "", "real_tags": ["是否", "worth", "股票"]}, {"category": "", "categoryclass": "", "imagename": "919817f628dd26f80884cec5ada74592.jpg", "infoid": 1013310, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "朱利安·夏皮罗(Julian Shapiro)是BellCurve.com的创始人，这是一个成长营销团队，为初创企业提供高级成长方面的培训，帮助招聘高级成长营销人员，并寻找经过审查的成长机构。他还在Julian.com上撰文。\n这就是你如何跟上增长营销策略的最新动态--带着在其他地方很难找到的建议。\n我们的社区由初创公司创始人和成长型公司负责人组成。您可以通过加入Demand Curve的营销培训计划或其松弛小组来参与。\n一般来说，保留现有客户比关闭新客户效率高得多。您需要一个系统来帮助您识别哪些用户有流失的风险。这样，你就可以在他们离开之前主动联系他们。\n或者，比如说，公司规模至少有50人-这反映了他们的向上销售潜力？\n您可以将这些来自多个来源的信息缝合在一起，例如条纹、Mixpanel、Crunchbase和对讲机。然后，设置警报，一旦有人落入这些桶中，就通知您的团队。\n然后用一些个人的东西来赢回他们的热情。这可能是一个很高的杠杆，让他们打电话来发现是什么让他们留在身边。", "note_en": "Julian Shapiro is the founder of  BellCurve.com, a growth marketing team that trains startups in advanced growth, helps hire senior growth marketers and finds vetted growth agencies. He also writes at  Julian.com.\n  This is how you stay up-to-date on growth marketing tactics — with advice that’s hard to find elsewhere.\n Our community consists of startup founders and heads of growth. You can participate by joining Demand Curve’s  marketing training program or its  Slack group.\n     Generally, it’s far more efficient to keep a current client than it is to close a new one. You’ll want a system to help you identify which users are at risk of churning. This way, you can proactively reach out to them before they leave.\n   Or, say, has a company size of at least 50 people — reflecting their upselling potential?\n    You can stitch this information together from multiple sources like Stripe, Mixpanel, Crunchbase and Intercom. Then, set up an alert to notify your team once someone falls into these buckets.\n Then reach out with something personal to win back their enthusiasm. It can be high leverage to get them on the phone to uncover what’s keeping them around.", "posttime": "2020-07-22 00:36:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "逆转,robust,营销", "title": "\n创建强大的流失逆转系统", "title_en": "\n\t\t\t\tCreating a robust churn-reversal system\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/creating-a-robust-churn-reversal-system/", "via": "", "real_tags": ["逆转", "robust", "营销"]}, {"category": "", "categoryclass": "", "imagename": "8cd9fb30ef8ce5696dd617bea5bdce2b.jpg", "infoid": 1013309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着天花在他周围蔓延，乔治·伯纳德·雷诺兹(George Bernard Reynolds)在波斯(现在的伊朗)的沙地上搜寻石油。这位英国地质学家钻探了七年，但一无所获。最后，他的金融家说，受够了：是时候解雇员工，拆除设备，回家了。相反，雷诺兹继续钻探。在1908年5月26日凌晨，他撞上了一个喷井。这是中东的第一个大型石油发现，但肯定不是最后一个。石油将很快改变该地区的经济，丰富其统治家族，并吸引更多的外国影响。\n一个世纪后，随着世界各国采用更清洁的能源，另一个巨大的变化即将到来。石油需求见顶可能还需要数年时间，但新冠肺炎已经让中东和北非尝到了未来的滋味。随着各国进入封锁状态，黑色材料的价格直线下降。该地区的能源出口国今年的石油收入预计将是2019年的一半左右；预计他们的经济将萎缩7.3%。即使病毒消退，供应过剩也可能会压低价格。面对不再增加的预算，阿拉伯国家必须适应。\n他们面临的挑战令人望而生畏(见文章)。以阿尔及利亚为例，该国需要油价超过每桶100美元才能使政府收支平衡。指标布兰特原油价格略高于40美元。因此，阿尔及利亚政府在5月份表示将把预算削减一半。几乎破产的石油出口大国伊拉克的情况也好不到哪里去。即使像阿曼和科威特这样稳定的生产国也入不敷出。沙特阿拉伯，世界上最大的石油出口国，几个月来一直在消耗其现金储备。原本打算平稳过渡到不那么油腻的经济的资金现在支撑着这个旧的石油国家。\n整个地区都将感受到影响。埃及出口的石油很少，但超过250万的公民在石油资源丰富的国家工作。汇款占其总额的9%。随着石油收入下降，其中一些工作岗位消失，埃及也将受到影响。约旦、黎巴嫩和巴勒斯坦领土也是如此，它们长期以来一直依赖海湾地区来吸收失业群众。这些国家还依赖产油国作为客户。约旦和黎巴嫩约三分之一的出口商品销往石油资源丰富的国家，这些国家将富有的游客送回国内。科威特人、沙特人和阿联酋人约占黎巴嫩游客消费的三分之一。\n好消息是，许多阿拉伯国家已经计划让他们的经济摆脱对石油的依赖。名为“2030愿景”的改革计划旨在解放私营部门，雇佣更多女性，削减补贴，并投资于非石油行业。坏消息是，这些州的进展太慢了。一些人已经削减了他们臃肿的官僚机构，并削减了补贴。沙特阿拉伯最近将其增值税提高了两倍。但公共部门仍是该地区的主要雇主。尽管各方都在谈论多元化，但海湾地区的经济仍然围绕着石油展开。现在，阿拉伯领导人谈到了一波私有化浪潮，以带来新的收入。他们在等什么呢？\n部分原因在于，这些改革将是痛苦的，在经济不景气时会更加艰难。但今天的危机也为建设充满活力、可持续的经济和代议制政府提供了机会。统治者再也承担不起用无所事事的公共部门工作和免费服务来换取忠诚了。沙特阿拉伯的穆罕默德·本·萨勒曼(Muhammad Bin Salman)等领导人提出的计划正在撕毁社会契约。沙特人想知道，为什么他不卖掉他价值5.5亿美元的游艇，而是提高税收。整个地区的愤怒情绪都在增长。在过去的一个世纪里，阿拉伯人一直被辱骂的领导人统治着，他们囤积了他们国家的财富。现在这些领导人要求他们的人民做出牺牲，在这件事上几乎没有给他们发言权。这是持续动乱和残酷镇压的秘诀。如果阿拉伯统治者想要公民支付他们的费用，他们将需要开始获得他们的同意。。\n这篇文章发表在印刷版的领导者版块，标题为&#34；将会有痛苦&#34；", "note_en": "A  and bandits, as smallpox spread around him, George Bernard Reynolds searched the sands of Persia (now Iran) for oil. The British geologist drilled for seven years—and found little. Finally his financiers said enough was enough: it was time to dismiss the staff, dismantle the equipment and come home. Instead Reynolds kept drilling. And in the early morning hours of May 26th 1908, he struck a gusher. It was the first big petroleum find in the Middle East, but certainly not the last. Oil would soon transform the region’s economies, enrich its ruling families and attract more foreign influence.\n A century later another big change is coming, as countries around the world adopt cleaner sources of energy. Peak demand for oil may still be years away, but covid-19 has given the Middle East and north Africa a taste of the future. Prices of the black stuff plummeted as countries went into lockdown. The region’s energy exporters are expected to earn about half as much oil revenue this year as they did in 2019; the   reckons their economies will shrink by 7.3%. Even when the virus recedes, a glut of supply will probably keep prices down. Faced with budgets that no longer add up, Arab states must adapt.\n  The challenge they face is daunting (see  article). Take Algeria, which needs the price of oil to be over $100 a barrel for its government’s books to balance. The price of Brent crude, a benchmark, is just over $40. So in May the Algerian government said it would cut its budget by half. Things are no better in Iraq, a big oil exporter, which is nearly broke. Even stable producers such as Oman and Kuwait are living beyond their means. Saudi Arabia, the world’s biggest oil exporter, has been burning through its cash reserves for months. Money that was meant to smooth the kingdom’s transition to a less oily economy is now propping up the old petrostate.\n The effects will be felt across the region. Egypt exports little oil, but over 2.5m of its citizens work in oil-rich countries. Remittances are worth 9% of its  . As oil revenues fall and some of those jobs disappear, Egypt will suffer, too. The same is true of Jordan, Lebanon and the Palestinian territories, which have long relied on the Gulf to absorb their jobless masses. These countries also count on oil producers as customers. Around a third of exports from Jordan and Lebanon go to oil-rich states, which send back wealthy tourists. Kuwaitis, Saudis and Emiratis account for about a third of tourist spending in Lebanon.\n The good news is that many Arab countries have plans to wean their economies off oil. Reform programmes with fancy names like “Vision 2030” aim to unleash the private sector, employ more women, cut subsidies and invest in non-oil industries. The bad news is that these states are moving too slowly. Some have cut their bloated bureaucracies and pared back subsidies. Saudi Arabia recently tripled its value-added tax. But the public sector is still the region’s main employer. Despite talk of diversification, the Gulf’s economies continue to revolve around oil. Now Arab leaders speak of a wave of privatisations to bring in new revenue. What have they been waiting for?\n Part of the answer is that these reforms will be painful and are harder in bad times. But today’s crisis also provides a chance to build vibrant, sustainable economies and representative governments. Rulers can no longer afford to buy loyalty with do-nothing public-sector jobs and free services. The plans put forward by leaders like Saudi Arabia’s Muhammad bin Salman are tearing up the social contract. Saudis wonder why he doesn’t sell his $550m yacht instead of raising taxes. Anger is growing across the region. For the past century Arabs have been ruled by abusive leaders who hoarded their country’s wealth. Now these leaders are asking their people to make sacrifices and giving them little say in the matter. That is a recipe for continuing unrest and brutal suppression. If Arab rulers want citizens to pay their way, they will need to start earning their consent.  ■\n This article appeared in the Leaders section of the print edition under the headline &#34;There will be pain&#34;", "posttime": "2020-07-22 00:33:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国家,oil,石油", "title": "将会有痛苦-随着石油价格的下降，阿拉伯国家无法平衡他们的收支平衡", "title_en": "There will be pain – With oil cheap, Arab states cannot balance their books", "transed": 1, "url": "https://www.economist.com/leaders/2020/07/18/with-oil-cheap-arab-states-cannot-balance-their-books", "via": "", "real_tags": ["国家", "oil", "石油"]}, {"category": "", "categoryclass": "", "imagename": "6b60cb1a2ee5bcc92e6338f7b339eb4b.jpg", "infoid": 1013308, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "环顾四周，他们意识到，没有一种金融产品能与他们花了最后一段职业生涯为其打造的这一代消费者对话，因此他们决定将其作为下一个项目。\n“我们的见解是，个人与金钱的关系是微妙的，是一种情绪化的关系。大多数金融应用程序没有被大众采用，因为它们很严格，缺乏同理心，而且在不知不觉中被认为是在评判，这就是为什么它们经常被下载然后被忽视的原因，“马德拉在一份声明中说。\n这是一款集个人财务监控、奖励和礼物以及社交购物应用于一体的应用程序。\n“我们在Snap学到的一件事是，如果你想接触到大众，你需要改变创建应用程序的方式。这必须是毫不费力的，“马德拉说。“它必须是自动的，也必须是社交的，所以我们希望打造一款集这一切于一身的应用。”\n一旦用户下载了Meemo，并将他们的主银行账户或信用卡连接到这款应用程序，Meemo就会让该用户深入了解他们的消费历史和潜在的回报。\n对于大多数用户来说，最初的体验将是通过礼品卡。事实证明，送礼是达卡和马德拉认为的公司发展的秘诀(尽管让人们在得到金钱或免费物品的情况下使用某些东西很难说是火箭科学)。\n还有两人认为会打平的社会因素。Meemo通过收集朋友的购买历史并与你分享，提供来自朋友的推荐和社会认可。\n一旦用户下载了Meemo并拥有他们的交易历史，这款应用程序就会显示出用户花钱最多的地方。然后，他们可以给朋友们寄去他们最喜欢的餐厅的礼品卡。最终的目标是让餐厅补贴送礼部分，让他们的购物者充当直接营销渠道。\n商店只有走进商店才能看到谁收到了礼物。Meemo希望做的是根据用户的购买情况收集他们的购物行为档案，并向他们提供折扣，让他们去那些他们可能不经常光顾的地方，但这些地方与他们的消费者档案相匹配。\n支持该公司的投资者包括萨马资本(Saama Capital)、Greycroft、Monashees和Sierra Ventures，以及个人投资者阿米特·辛哈尔(Amit Singhal)、汉斯·董(Hans Dong)，以及来自谷歌(Google)和Snap的连续创业者和联合创始人的同事。\n马德拉和达卡第一次见面是在谷歌搜索上，后来他们在Snap的旧金山办事处工作。这支球队还包括罗布森·阿劳霍和兰维尔·库纳尔这样的老朋友。\n萨玛资本(Saama Capital)管理合伙人阿什·利拉尼(Ash Lilani)在一份声明中表示：“我们非常高兴能支持达卡和马德拉在Meemo创建一款新时代的金融应用，这款应用将把改善的财务管理与当今这一代人更深入的社会参与结合起来。”“凭借达卡和马德拉过去组建才华横溢的团队和打造病毒式产品的经验，我们相信Meemo有机会成为这一领域的领先者。”\n根据一份声明，该公司的名字取自葡萄牙语单词“MIMO”，意思是深情款待。它可以在iOS和Android上下载。", "note_en": "Looking around they realized there was no financial product that spoke to the generation of consumers they’d spent the last bit of their professional lives working to build for, so they decided it would be their next project.\n “Our insight is that an individual’s relationship with money is a delicate and an emotional one. Most financial apps are not adopted by the masses because they are strict, lack empathy, and are unconsciously perceived as judgmental, which is why they are often downloaded and then ignored,” said Madeira, in a statement.\n   It’s a combination of a personal financial monitoring, rewards and gifting, and social shopping app all rolled into one.\n “One of the things we learned at snap if you want to reach the masses you need to change how you create an app. It has to be effortlessly,” said Madeira. “It has to be automatic and social as well so we want to build an app that is all of that combined.”\n Once a user downloads Meemo and connects their main bank account or credit card to the app, Meemo will give that person insights into their spending history and potential rewards.\n For most users, the initial experience will be through a gift card. Gifting, it turns out is what Dakka and Madeira think will be the secret sauce for the company’s growth (although getting people to use something if they’re being given money or free stuff is hardly rocket science).\n There’s also the social element which the two men think will be a draw as well. Meemo provides recommendations and social validation from friends by harvesting their buying history and sharing it with you.\n Once a user downloads Meemo and has the history of their transactions, the app will surface the places where user’s spend the most money. They can then send gift cards to their friends for their favorite restaurants. The goal, eventually, is to get restaurants to subsidize the gifting portion and have their shoppers act as a direct marketing channel.\n  Shops won’t be able to see who’s getting the gifts until they come into the store. What Meemo hopes to do is gather a profile of a user’s shopping behavior based on their purchases and offer them discounts to places that they may not frequent as often, but match their consumer profile.\n Backing the company are investors including Saama Capital, Greycroft, monashees, and  Sierra Ventures   along with individual investors  Amit Singhal,    Hans Tung,   and serial entrepreneurs and the co-founders’ colleagues from Google and Snap.\n Madeira and Dakka first met working on  Google   Search and went on to found Snap’s San Francisco office. And the team is rounded out by long-time friends like Robson  Araújo and Ranveer Kunal.\n “We are very excited to back Dakka and Madeira in their creation of a new age finance app at Meemo that will combine improved financial management with deeper social engagement for today’s generation”, said Ash Lilani, Managing Partner at Saama Capital, in a statement. “With Dakka and Madeira’s past experience of assembling talented teams and building viral products, we believe Meemo has an opportunity to become a leader in this space”.\n The company’s name is taken from a Portuguese word “mimo”, which means an affectionate treat, according to a statement. It’s available to download on  iOS and  Android.", "posttime": "2020-07-22 00:12:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "产品,social,meemo", "title": "\n结合社交购物奖励和个人理财应用，前Snap产品大师推出Meemo", "title_en": "\n\t\t\t\tCombining social shopping rewards and personal finance apps, ex-Snap product gurus launch Meemo\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/combining-social-shopping-rewards-and-personal-finance-apps-ex-snap-product-gurus-launch-meemo/", "via": "", "real_tags": ["产品", "social", "meemo"]}, {"category": "", "categoryclass": "", "imagename": "3638ecddbbcea9663d05aae2d936b5af.jpg", "infoid": 1013306, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "商务社交网站LinkedIn将在全球范围内裁员约960人，此前该网站受到冠状病毒大流行期间招聘员工减少的公司的打击。\n此次裁员将影响到包括英国在内的全球约6%的公司员工。\n首席执行官瑞安·罗斯斯基(Ryan Roslansky)在一条信息中表示，这是该公司唯一计划的裁员。\n微软旗下的LinkedIn在全球30多个城市设有办事处，员工1.6万人。\n这家总部设在加利福尼亚州的公司被雇主用来寻找合适的求职者，被员工用来寻找新的工作。\n我们的人才解决方案业务继续受到影响，因为包括我们在内的更少的公司需要以与以前相同的数量招聘。\n罗兰斯基表示：我想让你知道，这是我们唯一计划的裁员。\n近几个月来，世界各地的公司已经裁员数万人，因为他们正在努力应对冠状病毒导致的需求减少的影响。\n本周到目前为止，印度最大的航空公司IndiGo宣布将裁员10%，英国零售商玛莎百货(Marks&Amp；Spencer)宣布裁员950人。\n罗兰斯基表示，爱尔兰、英国和澳大利亚的员工已经开始就这对他们工作的潜在影响进行咨询。\n世界其他地区的工作人员将在接下来的几天和几个月里了解到对他们的影响。\n他补充说，LinkedIn将投资于业务的其他部分，这将带来一些就业机会，该公司将与受今日声明影响的员工合作，探索这些机会。", "note_en": "Business networking site LinkedIn is to cut about 960 jobs worldwide after being hit by firms recruiting fewer staff amid the coronavirus pandemic.\n The cuts will affect about 6% of the company&#39;s workforce across the globe, including the UK.\n In a message, chief executive Ryan Roslansky said these were the only layoffs the firm was planning.\n  Microsoft-owned LinkedIn has offices in more than 30 cities around the world and employs 16,000 people.\n  The firm, which is based in California, is used by employers to find suitable candidates for jobs and by employees to search for new jobs.\n  &#34;Our Talent Solutions business continues to be impacted as fewer companies, including ours, need to hire at the same volume they did previously.&#34;\n  &#34;I want you to know these are the only layoffs we are planning,&#34; Mr Roslansky said.\n In recent, months companies worldwide have shed tens of thousands of jobs, as they struggle to tackle the effects of reduced demand caused by coronavirus.\n So far this week India&#39;s biggest airline IndiGo has said it will cut 10% of its staff and UK retailer Marks &amp; Spencer has announced 950 job losses.\n Mr Roslansky said employees in Ireland, the UK, and Australia had already begun consultation about the potential impact on their jobs.\n Staff in other parts of the world would find out about the impact on them over the coming days and months.\n He added that LinkedIn would be investing in other parts of the business which would result in some job creation and the firm would &#34;work with employees impacted by today&#39;s announcement to explore these opportunities&#34;.", "posttime": "2020-07-22 00:09:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全球,linkedin", "title": "LinkedIn将在全球范围内裁员960人", "title_en": "LinkedIn to cut 960 jobs worldwide", "transed": 1, "url": "https://www.bbc.com/news/business-53484764", "via": "", "real_tags": ["全球", "linkedin"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013305, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "许多语言通过调用必须具有特定名称的函数来开始运行您的程序。在C语言(以及许多C派生语言)中，这只称为main()；在Go中，它是它的main.main()(主包中的main()函数)。众所周知，Python不需要任何这样的函数，即使您创建了一个名为main()的函数，它也不会自动调用。最近我读到“为什么Python没有主函数？”(VIA)，其中提出了一个关于为什么会这样的讨论。然而，我有一种稍微不同的方式来解释这种情况。\nPython不需要main()函数的核心原因是它的执行模型(特别是针对导入时发生的情况)的组合，而且在正常情况下，您可以通过(隐式)导入单个Python代码文件来启动Python程序。因此，让我们来看看这些部分的每一个部分。\n在许多语言中，函数、类等东西是由解释器或编译器在解析源文件时重新创建(定义)的。在Python中，情况并非如此；相反，defand class是可执行语句，它们在执行时定义类和函数(其中，这是元类工作的部分原因)。当Python导入某些内容时，它只是执行文件中的所有内容(或者更一般的导入)。当执行的是defand class语句时，您将获得函数和类。当执行的是常规代码时，会发生更复杂的事情，包括条件导入或在正确条件下动态调用函数。或者，您可以编写一个完整的程序，在导入文件时内联运行。\n然而，Python在这里并不像看起来那么独特。在程序开始正常执行之前(例如，go有init()函数)，许多语言都有一些工具可以在程序开始加载之前运行任意代码。Python与这些语言的不同之处在于，Python通常通过加载和执行特定的单个文件来启动程序。因为Python只执行一个文件，所以它清楚地知道什么代码以什么顺序运行，并且该文件中的代码很容易控制发生的事情。在某种意义上，Python可以通过让您提供一个任意命名的文件来偷偷地选择一个任意命名的文件，而不是选择一个任意命名的函数作为(名义上)执行的开始位置。\n(编译语言传统上有一种模型，在该模型中，来自一堆单独文件的代码全部堆叠在一起。在Python中，您可以通过这种方式将多个文件聚合到一个共享名称空间中；无论如何，您必须导入它们，所有内容都从某个初始文件开始。)。\n这个很好的模型出现故障并需要解决的地方是，如果您运行的包带有python-m...&39；，其中Python实际上没有您正在执行的单个文件(否则它必须使__init__.py具有双重功能)。正如官方文档s__main__-顶级脚本环境(VIA)中所述，Python采用任意约定，从包中加载__main__.pyfile，并或多或少地将其声明为执行起始点。\nPS：与最初文章的观点相反，我强烈建议您使用main()函数，因为保持您的程序可导入有很大的好处。", "note_en": "Many languages start running your program by calling a function ofyours that must have a specific name. In C (and many C derivedlanguages), this is just called  main(); in Go, it&#39;s  main.main()(the  main() function in the  main package). Python famouslydoesn&#39;t require any such function, and won&#39;t automatically call afunction called  main() even if you create it. Recently I read Why doesn’t Python have a main function?( via),which puts forward one discussion for why this is so. However, I havea somewhat different way of explaining this situation.\n The core reason that Python doesn&#39;t require a  main() function is acombination of its execution model (specifically for what happens whenyou import something) and that under normal circumstances you startPython programs by (implicitly) importing a single file of Python code.So let&#39;s look at each of these parts.\n In many languages things like functions, classes, and so on arecreated (defined) by the interpreter or compiler as it parses thesource file. In Python, this is not quite the case; instead,   defand  class are executable statements,and they define classes and functions when they execute (among otherthings, this is part of  why metaclasses work).When Python imports something, it simply executes everything in thefile (or the import more generally). When what&#39;s executed is  defand  class statements, you get functions and classes. When what&#39;sexecuted is regular code, you get more complicated things happening,including conditional imports or calling functions on the fly underthe right conditions. Or you can write an entire program that justruns inline, as the file is imported.\n  However, Python is not quite as unique here as it might look. Manylanguages have some facility to run arbitrary code early on as theprogram is &#39;loading&#39;, before the program starts normal execution(Go has  init() functions, for example). Where Python is differentfrom these languages is that Python normally starts a program byloading and executing a specific single file. Because Python isonly executing a single file, it&#39;s unambiguous what code is run inwhat order and it&#39;s straightforward for the code in that file tocontrol what happens. In a sense, rather than picking an arbitrarilynamed function for where execution (nominally) starts, Python isable to sneakily pick an arbitrarily named file by having you provideit.\n (Compiled languages traditionally have a model where code from a bunchof separate files is all sort of piled up together. In Python, you can&#39;treally aggregate multiple files together into a shared namespace thisway; one way or another, you have to  import them and everything startsfrom some initial file.)\n Where this nice model breaks down and needs a workaround is if yourun a package with &#39; python -m ...&#39;, where Python doesn&#39;t reallyhave a single file that you&#39;re executing (or it&#39;d have to make __init__.py serve double duty). As covered in the officialdocumentation&#39;s   __main__ — Top-level script environment ( via),Python adopts the arbitrary convention of loading a  __main__.pyfile from your package and declaring it more or less the point whereexecution starts.\n  PS: contrary to  the original article&#39;s views, I strongly suggest that you have a  main() function, because there are significant benefits to keeping your program importable.", "posttime": "2020-07-22 00:09:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,main,函数", "title": "探究为什么Python不需要“main”函数", "title_en": "An exploration of why Python doesn't require a 'main' function", "transed": 1, "url": "https://utcc.utoronto.ca/~cks/space/blog/python/WhyNoMainFunction", "via": "", "real_tags": ["python", "main", "函数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每次做出体系结构/设计决策时，您都会关闭设计中的选项，并限制程序的更改选项。设计是平衡当前需求(需求)和未来可能的更改请求。\n您的主要目标是满足当前需求，并保留尽可能多的开放选项以适应未来的更改。如果您预感到将来会收到X功能的请求并进行相应的设计，则可能会发生两种情况：\n2-请求从来没有来过，你最终得到了一个与你目前的需求无关的不合标准的设计，这是你的耻辱。\n因为第二件事更有可能发生，所以你避免犯新手错误，即为你不确定的事情进行设计。\n设计是关于平衡两件事：满足当前的需求和保留尽可能多的选择。您希望保持灵活性，而针对预感进行设计会给您的程序带来不必要的约束。\n因此，选择易于扩展的设计，而不是构建一个可能永远不会实现的功能。\n在本系列的前一篇文章中，我们讨论了我们作为软件开发人员的角色。除了编写代码，我们的工作是提供价值。\n能够提供价值的最重要前提是了解我们的用户需要什么。与最终用户的沟通很重要，因为作为软件的创建者，我们往往对我们制造的产品有不正确的想法。\n有许多功能和可用性方面对我们来说是显而易见的，但对用户来说却并非如此。对我们来说看起来清晰直观的事情，对那些……。嗯，谁不是这个产品的创造者呢？与用户沟通并了解他们对我们产品的喜恶之处是制定正确解决方案的重要部分。\n诚然，我们没有那么多机会这样做，但如果有可以与用户交谈的情况，那就去争取吧。如果这根本不可能，那就和你的产品所有者成为最好的朋友，并定期得到反馈。\n请记住，很少有比构建一个解决了错误问题的伟大产品更令人难过的事情了。\n我知道这可能不适用于你，但我们的职业中有很多人都在加班。在软件开发人员中，为了提供额外的功能而忽略家人、朋友和个人生活是相当普遍的。\n我知道在特殊场合你可能需要在办公室多呆几个小时，每个人都会这样。但是，长期持续忽视你生活的其他方面是不可能的。\n我们都是人，培养人际关系和爱好的需要是我们自身不可或缺的一部分。在我们周围有一个健康的人际关系网络不仅让我们更快乐，而且还能帮助我们生产出更高质量的工作。从长远来看，一个快乐、休息良好、有其他爱好的人往往会过得更好。\n并不是说极端的牺牲就能让你永远成为明星员工。迟早你会筋疲力尽，你的人际关系也会恶化，如果这是唯一重要的事情，这最终会影响你的工作效率。\n所以，花时间滋养重要的东西吧。你的工作稍后还会在那里，在接下来的几十年里，你可能会换几次工作。押注于可持续增长，滋养你生活的方方面面。\n谢谢你的阅读，我希望你学到了一两个新东西，或者至少有了新的想法。\n与朋友和同事分享这篇文章。感谢您帮助我联系到可能会觉得此信息有用的人。\n您可以在推荐书单中找到有用的书籍来继续投资您的承运人。\n给我发一封有问题、评论或建议的电子邮件(它在关于我的页面上)。来吧，别害羞！", "note_en": "Every time you make an architectural/design decision, you close options in your design and constrain your program’s options for change. Designing is balancing the current needs (requirements) with possible future change requests.\n Your main goal is to satisfy the current requirements and leaving as many open options as possible to accommodate future changes. If you get a hunch that in the future you will get a request for X feature and design to accommodate that, two things can happen:\n  2- The request never came, and you end up with a subpar design that doesn’t relate to your current requirements, shame on you.\n Because the second thing is more likely to happen, you avoid making the rookie mistake of designing for things you are not sure will come later.\n Design is about balancing two things: satisfying current requirements and leaving open as many options as possible. You want to keep flexibility, and designing for hunches poses unnecessary constraints in your program.\n So go for designs that are easy to extend and don&#39;t build towards a feature that might never come.\n  In a previous article in this series, we talked about our role as software developers. Our job, above writing code, is to provide value.\n The most important prerequisites for being able to provide value is to know what our users need. Communication with end-users is important because as the creators of the software, we tend to have skewed ideas about the products we make.\n There are many features and usability aspects that are obvious for us, but not for the users. Things that for us seem clear and intuitive can be difficult for people who... well, who didn&#39;t create the product. Communicating with users and understanding what they love and what they hate about our products is an important part of crafting the right solution.\n It&#39;s true that we don&#39;t have those many chances to do this, but if there is a situation where you can talk to a user go for it. If it&#39;s not possible at all, become best buddies with your product owner and get regular feedback.\n Remember that there are few things as sad as building a great product that solves the wrong problem.\n   I know this might not apply to you, but our profession is full of people who work a ton of extra hours. Neglecting family, friends and personal life in order to ship that extra feature is quite common among software developers.\n I know you might need to stay in the office for a couple of extra hours on special occasions, it happens to everyone. But continuous neglect of other aspects of your life is impossible to sustain in the long term.\n We are human beings, and the need to cultivate relationships and hobbies is an integral part of who we are. Having a network of healthy relationships around us not only makes us happier, but it also helps us produce better quality work. A happy and well-rested person with other interests tends to fare better in the long run.\n It&#39;s not that extreme sacrifices will make you a star employee forever. Sooner or later you will burn out and your relationships will deteriorate, something that will ultimately impact your productivity if that&#39;s the only thing that matters.\n So, spend time nourishing what matters. Your job will still be there later, and you will probably switch jobs several times in the following decades. Bet for sustainable growth and nourish all the aspects of your life.\n   Thank you for reading, I hope you learned one or two new things or at least got something new to think about.\n  Share this article with friends and colleagues. Thank you for helping me reach people who might find this information useful.\n  You can find helpful books to continue investing in your carrer in the  recommended reading list.\n Send me an email with questions, comments or suggestions (it&#39;s in the  About Me page). Come on, don&#39;t be shy!", "posttime": "2020-07-22 00:08:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,希望,设计", "title": "我希望在开始编程时就知道的事情，第6部分(2019年)", "title_en": "Things I wish I had known when I started programming, Part 6 (2019)", "transed": 1, "url": "https://www.brainstobytes.com/advice-for-new-developers-or-things-i-wish-i-had-known-when-i-started-programming-part-6/", "via": "", "real_tags": ["编程", "希望", "设计"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上行请求超时", "note_en": "upstream request timeout", "posttime": "2020-07-22 00:08:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,学习,learning,上行", "title": "机器学习提供更好的开发人员体验", "title_en": "Machine Learning for a Better Developer Experience", "transed": 1, "url": "https://netflixtechblog.com/machine-learning-for-a-better-developer-experience-1e600c69f36c", "via": "", "real_tags": ["开发", "学习", "learning", "上行"]}, {"category": "", "categoryclass": "", "imagename": "97a1b52f1fc60ddb762a651627ae1d44.png", "infoid": 1013302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超越锂离子电池是高能量密度、低成本和大规模储能应用的有前途的候选电池。然而，主要的挑战在于开发合适的电极材料。在这里，我们通过二维多层VoPO4-石墨烯异质结构的界面应变工程，展示了一种用于超Li+离子(Na+，K+，Zn2+，Al3+)可逆插层的新型零应变阴极。原位表征和理论计算揭示了阳离子在体积变化不大的二维多层异质结构中的可逆插层机制。当用作K+离子电池的正极时，我们获得了160mA  h g−1的高比容量和~570 W h kg−1的大能量密度，呈现出迄今报道的最好的性能。此外，所制备的2D多层异质结构还可作为高性能Na+、Zn2+和Al3+离子电池的正极材料。这项工作预示着利用2D材料的应变工程应用于先进的储能应用是一种很有前途的策略。\n可再生能源的快速发展引发了对大规模、高性价比、高能量密度固定式储能系统的巨大需求1.近年来，超锂离子电池(LIB)得到了广泛的研究，包括钠离子电池(SIB)、钾离子电池(PIB)、锌离子电池(ZIB)和铝离子电池(AIB)2、3、4、5.Na、K、Zn和Al是地壳中丰富的金属元素，远远超过锂离子电池(LIB)、钠离子电池(SIB)、钾离子电池(PIB)、锌离子电池(ZIB)和铝离子电池(AIB).。与锂基化学相似，Na和K具有合适的氧化还原电位，使SIB和PIB具有高终端电压和潜在的高能量密度(补充图1b)。特别是，由于多电子转移反应，ZIBs和AIBs由于其优越的理论体积能量密度而具有吸引力(补充图11c)。尽管有这些有希望的方面，但由于缺乏合适的电极材料5、6、7，这些Beyond-Libs的发展一直受到阻碍。\n基于插层机制的层状材料因其稳定的循环性能和高倍率性能而在碱金属离子电池中得到了特别的研究，这得益于离子在其大的层间走廊中的有效和简单的插层化学8。LIBS中使用的第一种层状电极材料是过渡金属二硫化物，如M.Stanley Whittingham于1976年9，10年开发的TiS 2。后来，John Goodaly和他的同事在1980年报道了一种层状过渡金属氧化物LiCoO2及其变种，至今仍在继续。包括Beyond-Libs。在插层电极中，具有优良的长循环性能的零应变电极材料因其在客体离子插入和引出过程中晶格参数变化可以忽略不计(&lt；1%)而备受关注。这一优点对于满足Beyond-LIBS的长期循环要求至关重要，然而，据我们所知，到目前为止很少有人达到这一要求12、13、14。与Li+(0.76 ä)、Na+(1.02 ä)和K+(1.38 ä)相比，Na+和K+的离子半径要大得多(补充图11D)。二价Zn2+和三价Al3+与主体晶格的静电/库仑相互作用明显强于一价离子。所有这些因素都限制了离子在主体晶格中的可逆插入和扩散，导致电极材料的体积膨胀过大，导致电极的倍率能力迟缓，循环寿命短。\n由层状前驱体剥离而成的二维分子纳米片在电化学储能方面得到了广泛的认可。通过最近开发的剥离和组装策略，不同的纳米片相互垂直组装形成了二维多层异质结构，作为很有前途的层状储能材料15，16，17，18。最近已经展示了几个典型的锂和钠储存材料，包括磷烯/石墨烯，MnO2/石墨烯，掺Ti 0.87O2/N的石墨烯和MoS2/石墨烯19，20，21，22等，其中包括磷烯/石墨烯，MnO2/石墨烯，Ti0.87O2/N掺杂石墨烯和MoS2/石墨烯19，20，21，22。考虑到相邻纳米片之间的大的层间走廊在理论上适用于各种金属离子的插层，因此研究K+、Zn2+、Al3+等锂以外离子的二维多层异质结构具有重要的意义。然而，在层状结构中，垂直于层的膨胀可能会引起相变，甚至在主体晶格上插入离子时导致结构坍塌。这对于基于大体积和多价金属离子的Beyond-Libs来说要严重得多。二维异质结产生了不同寻常的性质和现象，受益于\n大块层状VOPO4·2H2O晶体的SEM图像。剥离的VOPO4纳米薄片的透射电镜图像。插图显示了剥离纳米片悬浮液中的廷德尔光散射效应。C重新堆积的VOPO4纳米薄片的SEM图像。VOPO-4-石墨烯的三维SEM和E-TEM图像。VOPO4-石墨烯的F截面HRTEM图像显示了交替堆积的VOPO4(VP)和改性石墨烯(G)纳米片的多层结构。GHAADF-STEM图像及相应的VOPO-4-石墨烯元素图谱。VOPO4-石墨烯的H SAED图显示了VOPO4(VP)和改性石墨烯(G)纳米片的面内反射。VOPO4·2H2O、VOPO4纳米片和VOPO4-石墨烯的I-拉曼光谱。J，k分布来自100个单独的扫描，显示由于VoPO4-石墨烯异质结构的界面应变引起的平均位移。比较了VOPO4·2H2O、VOPO4纳米片和VOPO4-石墨烯的0 0 1 X射线衍射峰。VOPO4纳米薄片和VOPO4-石墨烯的峰值强度分别提高了102倍和104倍。体相VOPO4·2H2O、VOPO4纳米片和VOPO4-石墨烯中不同的重新堆积和层间距离的示意图。\n在传统的程序中，纳米片状悬浮液被冷冻干燥，以产生自重新堆叠的VOPO4纳米片的片状纳米片状(图2c)。虽然厚度比块状材料薄得多，但重新堆积的纳米薄片仍然存在活性表面的大幅下降。在这项工作中，通过将VOPO4纳米薄片限制在石墨烯层之间，合理地设计了一种二维多层异质结构。用阳离子聚合物聚(二烯丙基二甲基氯化铵)(PDDA)修饰石墨烯，得到带正电的性质20、21、22、31。由于静电的吸引，这两个带相反电荷的纳米片自组装成面对面堆积的二维多层异质结构。根据假设的面积匹配模型，VOPO4纳米片和改性石墨烯之间的最佳质量比可以从理论上估计为~11.4(补充图10中)。在这两个纳米片的悬浮液以这个比例混合后立即诱导絮凝(补充图3a)。收集了絮凝产物，估计石墨烯的含量为~10 wt%(补充图11)。在对照实验中，将VOPO4和氧化石墨烯的悬浮液混合后获得了稳定的悬浮液，这两种悬浮液都是带负电荷的纳米片(补充图3b)。这清楚地表明，在所得到的2D多层异质结构中，VoPO4和石墨烯纳米片通过静电吸引结合在一起。2D多层VoPO 4-石墨烯异质结构显示出由皱缩的薄层组成的3D多孔结构(图2d，e)。侧视图SEM图像(补充图512)显示了VOPO4-石墨烯的多层异质结构。横截面的HRTEM图像(图2f)进一步表明，薄层是堆积的VOPO4和石墨烯薄片的多层结构。高角环形暗场扫描透射电子显微镜(HAADF-STEM)图像和相应的元素图谱表明，VOPO4和石墨烯纳米片分布均匀(图2g)。选区电子衍射(SAED)图案显示了VOPO4和石墨烯纳米片的面内衍射环(图12h)。这些都清楚地表明，VOPO4和石墨烯纳米片被组装成具有逐层图案的多层异质结构。\n由于VOPO4和石墨烯之间的面内晶格间距不匹配，可能会有显著的界面应变从VOPO4-石墨烯界面传播到VOPO4纳米片中。最近的研究表明，可以通过拉曼光谱32、33探测到面内应变。对二维VOPO4-石墨烯多层异质结构的拉曼光谱分析(图2I)表明，VOPO4与石墨烯的D带和G带具有相同的特征。为了评估二维VOPO4-石墨烯多层异质结构中的应变，对VOPO4的对称O-P-O和V=O伸缩模式(910-1050 cm−1)进行了包括100多个单独扫描的统计拉曼光谱作图(图2J，k)。剥离后，观察到了VOPO4纳米薄片这两种伸缩模式的拉曼光谱红移。然而，当石墨烯堆积在VOPO4纳米片上时，观察到O-P-O的~15 cm−1和V=O的~3 cm−1的明显蓝移，这支持了VOPO4纳米片上存在界面诱导的压缩应变。此外，应变(δ)可以由下式近似计算。\n其中ω是拉曼位移，Δω是拉曼峰34的变化。以O-P-O模型为例，测得二维VOPO4-石墨烯多层异质结构的应变为~4.0%。基于密度泛函理论(DFT)的计算\n为了比较，还研究了K+离子插入和提取时重新堆叠的VoPO4纳米片的结构演变(补充图16和图3d)。除了峰位移动外，在K+-离子插入和提取时还清楚地发现了不对称的峰演化，表明是两相反应(图3e)。放电过程后仍检测到初始的001峰，表明K+离子在纳米片内的插入不足。重新堆积的VOPO_4纳米片层间距离的演化如图3f所示。K+离子注入后出现一个新的峰，层间距增加约0.75 nm，体积变化为136%，远大于二维VOPO4-石墨烯多层异质结构的体积变化。此外，在K+离子插入的第二个循环中，0 0 1峰逐渐消失，并形成了另一个层间距减小为0.6 2 nm的新峰，这可能意味着重新堆积的VOPO4纳米片的初始层状结构的退化。为了证实这一假设，将重新堆积的VOPO4纳米片和二维VOPO4-石墨烯多层异质结构进一步充放电50次。如补充图17所示，二维VOPO4-石墨烯多层异质结构的充放电分布在不同的循环中重叠。然而，重新堆积的VOPO4纳米片在最初的几个循环后极化显著增加，放电平台消失，伴随着明显的容量衰减(补充图318)。循环后，二维VOPO4-石墨烯多层异质结构的001峰仍然保持不变，表明结构稳定性优异(补充图19.)。相反，重新堆积的VOPO4纳米片没有观察到001峰。这些结果证明了在K+离子的重复插层/脱插层过程中，重新堆积的VOPO4纳米片层状结构的崩塌(补充图520)。相反，具有限制在石墨烯层之间的VOPO4纳米片的2D多层异质结构。\n.", "note_en": "Beyond-lithium-ion batteries are promising candidates for high-energy-density, low-cost and large-scale energy storage applications. However, the main challenge lies in the development of suitable electrode materials. Here, we demonstrate a new type of zero-strain cathode for reversible intercalation of beyond-Li + ions (Na +, K +, Zn 2+, Al 3+) through interface strain engineering of a 2D multilayered VOPO 4-graphene heterostructure. In-situ characterization and theoretical calculations reveal a reversible intercalation mechanism of cations in the 2D multilayered heterostructure with a negligible volume change. When applied as cathodes in K +-ion batteries, we achieve a high specific capacity of 160 mA h g −1 and a large energy density of ~570 W h kg −1, presenting the best reported performance to date. Moreover, the as-prepared 2D multilayered heterostructure can also be extended as cathodes for high-performance Na +, Zn 2+, and Al 3+-ion batteries. This work heralds a promising strategy to utilize strain engineering of 2D materials for advanced energy storage applications.\n     The rapid development of renewable energy resources has triggered tremendous demands in large-scale, cost-efficient and high-energy-density stationary energy storage systems  1. In this regards, beyond-lithium-ion batteries (LIBs) are recently extensively investigated, including sodium-ion batteries (SIBs), potassium-ion batteries (PIBs), zinc-ion batteries (ZIBs), and aluminum-ion batteries (AIBs)  2, 3, 4, 5. Na, K, Zn, and Al are abundant metallic elements in the earth crust, far exceeding Li (Supplementary Fig.  1a). Similar to Li-based chemistry, the Na and K have suitable redox potentials, endowing SIBs and PIBs with high terminal voltages and potentially high energy densities (Supplementary Fig.  1b). In particular, the ZIBs and AIBs are attractive for their superior theoretical volumetric energy densities because of the multi-electron transfer reactions (Supplementary Fig.  1c). Despite these promising aspects, the development of these beyond-LIBs has been impeded by the lack of suitable electrode materials  5, 6, 7.\n Layered materials, based on an intercalation mechanism, have been particularly studied in alkali metal-ion batteries for their stable cyclability and high rate capability, benefitting from effective and simple intercalation chemistry of ions into their large interlayer galleries  8. The first layered electrode materials used in LIBs was transition metal disulfides, such as TiS 2, developed by M. Stanley Whittingham in 1976  9, 10. Later, in 1980, John Goodenough and co-workers reported a layered transition metal oxide, LiCoO 2, and variants of which are still being used in the majority of smart phone batteries today  11. Since then, the layered materials have received major research interests as the intercalation electrodes for rechargeable batteries, including beyond-LIBs. Among the intercalation electrodes, zero-strain electrode materials with excellent long cycling performance have attracted great attention due to their negligible lattice parameter change (&lt;1%) during guest ion insertion and extraction. This merit is crucial to meet the long-term cycling requirement of beyond-LIBs, however, has rarely been achieved thus far, to the best of our knowledge  12, 13, 14. Compared with Li + (0.76 Å), Na + (1.02 Å) and K + (1.38 Å) have much larger ionic radii (Supplementary Fig.  1d). Divalent Zn 2+ and trivalent Al 3+ typically exhibit stronger electrostatic/Coulombic interactions with the host lattices than the monovalent ions. All these factors have restricted the reversible insertion and diffusion of ions into host lattices and induced huge volume expansion of the electrode materials, leading to a sluggish rate capability and short cycle life.\n Two-dimensional (2D) molecular nanosheets produced from exfoliation of their layered precursors have been well recognized in electrochemical energy storage. Through the recently developed exfoliation and assembly strategy, vertical assembly of different nanosheets on top of each other generates 2D multilayered heterostructures as promising layered materials for energy storage  15, 16, 17, 18. Several typical examples have been demonstrated recently for Li and Na storage, including phosphorene/graphene, MnO 2/graphene, Ti 0.87O 2/N-doped graphene and MoS 2/graphene  19, 20, 21, 22. Considering the large interlayer galleries between adjacent nanosheets are theoretically applicable for intercalation of various metal ions, it is of great interest to investigate the 2D multilayered heterostructures for beyond-Li ions such as K +, Zn 2+, and Al 3+. However, in layered structures, an expansion perpendicular to the layers may induce phase change and even structural collapse upon ion intercalation on the host lattice. This is much more serious for beyond-LIBs based on bulky and multivalent metal ions. 2D heterostructures yield unusual properties and phenomena, benefiting from the synergistic properties of different 2D materials via high-quality heterointerfaces  15, 16, 23. Strain engineering at the interfaces is an efficient approach to control the properties of 2D materials, which has been widely demonstrated in electronics and catalysis  24, 25, 26. Only recently, an observation was reported that interface strain engineering of 2D carbon-MoS 2 heterostructured nanosheets could control the electrochemical reactivity of MoS 2 for Li insertion  27. Theoretical calculations indicated the possibility of tunable Li storage of 2D transition metal carbides via strain engineering  28, 29. Based on these pioneering results, it is expected the interface strain of 2D heterostructures could accommodate the intercalation of these beyond-Li + ions for a highly stable cycle life.\n Here, we report that interface strain engineering of 2D multilayered heterostructure produces a zero-strain cathode for reversible intercalation of beyond-Li + ions such as Na +, K +, Zn 2+, Al 3+. A reversible intercalation mechanism with a negligible volume change during charge and discharge processes has been demonstrated. Consequently, high-performance SIBs, PIBs, ZIBs, and AIBs are obtained in terms of high specific capacity, large energy density, and long-term cycling stability.\n A 2D VOPO 4-graphene multilayered heterostructure was utilized as a proof-of-concept layered material for our design (Fig.  1). VOPO 4 nanosheets were first synthesized by intercalation and exfoliation of bulk layered VOPO 4·2H 2O crystals (Supplementary Fig.  2). Then, the 2D VOPO 4-graphene multilayered heterostructures were obtained through a self-assembly process of the VOPO 4 and graphene nanosheets (Supplementary Fig.  3). For comparison, the VOPO 4 nanosheets were freeze-dried, and nanoflakes of restacked VOPO 4 nanosheets were also prepared. When applied as cathodes in beyond-LIBs, the restacked VOPO 4 nanoflakes gradually collapsed after cycling due to the severe volume change. In contrast, the 2D multilayered VOPO 4-graphene heterostructures could enable long-term cycling stability for reversible intercalation of various cations (Na +, K +, Zn 2+, and Al 3+).\n The 2D multilayered heterostructure is prepared by self-assembly between VOPO 4 nanosheets and graphene. However, freeze-drying of suspensions of VOPO 4 nanosheets produces lamellar restacked nanoflakes. As electrode materials for intercalation of Na +, K +, Zn 2+, and Al 3+ cations, the restacked nanoflakes show poor cycling performance due to the severe volume change and gradually collapsed structure after several cycles. In contrast, the 2D multilayered VOPO 4-graphene heterostructure could effectively alleviate the large volume expansion and maintain superior structural stability during the repeated intercalation/deintercalation of various cations, thus enabling long-term capability.\n The bulk VOPO 4·2H 2O crystals are platelet chunks composed of tightly stacked layers (Fig.  2a and Supplementary Fig.  4). After treated with acrylamide solution, the layered platy morphology was retained (Supplementary Fig.  5). An increased basal spacing of 0.91 nm, larger than that of VOPO 4·2H 2O (0.74 nm), suggests the intercalation of acrylamide (Supplementary Fig.  6). Consequently, the VOPO 4 nanosheets were obtained by exfoliation of the intercalated VOPO 4-acrylamide. The intercalation-exfoliation protocol produced uniform VOPO 4 nanosheets with several hundreds of nanometers in size and a thickness of ~4 nm (Supplementary Fig.  7), corresponding to ~6 monolayers of VOPO 4. Transmission electron microscopy (TEM) observation revealed an ultrathin sheet-like morphology of the obtained VOPO 4 nanosheets (Fig.  2b and Supplementary Fig.  8). Zeta-potential measurements showed a negative value of –(45 ± 8) mV for the VOPO 4 nanosheets, which should be ascribed to the reduction of V 5+ during the exfoliation process (Supplementary Fig.  9)  30. The surface charges enabled a stable dispersion of VOPO 4 nanosheets with a noticeable Tyndall light scattering (inset of Fig.  2b). Although no surfactant was added during the exfoliation process, the suspension was highly stable for several months.\n a SEM image of bulk layered VOPO 4·2H 2O crystals.  b TEM image of exfoliated VOPO 4 nanosheets. The inset shows the Tyndall light-scattering effect in suspensions of exfoliated nanosheets.  c SEM image of restacked VOPO 4 nanoflakes.  d SEM and  e TEM images of VOPO 4-graphene.  f Cross-section HRTEM image of VOPO 4-graphene showing the multilayered structure of alternately restacked VOPO 4 (VP) and modified graphene (G) nanosheets.  g HAADF-STEM image and corresponding elemental mapping of VOPO 4-graphene.  h SAED pattern of VOPO 4-graphene showing the in-plane reflections of both VOPO 4 (VP) and modified graphene (G) nanosheets.  i Raman spectra of VOPO 4·2H 2O, VOPO 4 nanoflakes and VOPO 4-graphene.  j,  k Distribution from 100 individual scans showing average shifts due to interface strain of VOPO 4-graphene heterostructures.  l Comparison of 001 XRD peaks of VOPO 4·2H 2O, VOPO 4 nanoflakes and VOPO 4-graphene. The peak intensities of VOPO 4 nanoflakes and VOPO 4-graphene was multiplied by 10 2 and 10 4 times, respectively.  m Schematic illustration of the different restacking and interlayer distances in bulk VOPO 4·2H 2O, VOPO 4 nanoflakes and VOPO 4-graphene.\n In a conventional procedure, the nanosheet suspension was freeze-dried to produce lamellar nanoflakes of self-restacked VOPO 4 nanosheets (Fig.  2c). Although the thickness is much thinner than the bulk chunks, the restacked nanoflakes still suffer from massively decreased active surfaces. In this work, a 2D multilayered heterostructure was rationally designed by confining the VOPO 4 nanosheets between graphene layers. The graphene was modified with a cationic polymer, poly (diallyldimethylammonium chloride) (PDDA), resulting in a positively charged nature  20, 21, 22, 31. Due to electrostatic attraction, these two oppositely charged nanosheets self-assembled into a face-to-face stacked 2D multilayered heterostructure. An optimized mass ratio between the VOPO 4 nanosheets and modified graphene could be theoretically estimated as ~11.4 based on a hypothesized area-matching model (Supplementary Fig.  10). A flocculation was induced immediately after mixing the suspensions of these two nanosheets in this ratio (Supplementary Fig.  3a). The flocculated product was collected, and the content of graphene was estimated to be ~10 wt% (Supplementary Fig.  11). In a control experiment, a stable suspension was obtained after mixing suspensions of the VOPO 4 and graphene oxide, both of which are negatively charged nanosheets (Supplementary Fig.  3b). This clearly indicates that the VOPO 4 and graphene nanosheets were held together by electrostatic attraction in the resulting 2D multilayered heterostructure. The 2D multilayered VOPO 4-graphene heterostructure show a 3D porous structure composed of crumpled thin layers (Fig.  2d, e). A side-view SEM image (Supplementary Fig.  12) indicates a multilayered heterostructure of VOPO 4-graphene. The HRTEM image (Fig.  2f) of the cross-section further reveals that the thin layers are multilayered structures of stacked VOPO 4 and graphene sheets. The high-angle annular dark-field scanning transmission electron microscope (HAADF-STEM) image and the corresponding elemental mapping indicate the uniform distribution of VOPO 4 and graphene nanosheets (Fig.  2g). The selected-area electron diffraction (SAED) pattern exhibits the in-plane diffraction rings of both VOPO 4 and graphene nanosheets (Fig.  2h). These clearly demonstrate that the VOPO 4 and graphene nanosheets were assembled into a multilayered heterostructure with a layer-by-layer pattern.\n Due to the mismatch of the in-plane lattice spacing between VOPO 4 and graphene, a significant interface strain was possibly propagated into the VOPO 4 nanosheets from the VOPO 4-graphene interfaces. Recent studies showed that in-plane strain can be probed through Raman spectroscopy  32, 33. Raman spectroscopy analysis (Fig.  2i) of the 2D VOPO 4-graphene multilayered heterostructure showed the identical signatures of VOPO 4 together with the D-band and G-band of graphene. To assess the strain in the 2D VOPO 4-graphene multilayered heterostructure, statistical Raman spectroscopy mapping (Fig.  2j, k) comprising over 100 individual scans was performed on the symmetric O–P–O and V=O stretching modes of VOPO 4 (910–1050 cm −1). After exfoliation, red shifts of Raman bands of these two stretching modes were observed for the VOPO 4 nanosheets. However, clear blue shifts of ~15 cm −1 for O–P–O and ~3 cm −1 for V=O were observed when the VOPO 4 nanosheets were stacked with graphene, supporting the presence of interface-induced compressive strain on the VOPO 4 sheets. Furthermore, the strain ( δ) can be approximatively calculated by\n  in which  ω is the Raman shift and Δω is the change of Raman peak  34. Taking the O–P–O model as an example, a strain of ~4.0% was determined in the 2D VOPO 4-graphene multilayered heterostructures. Density functional theory (DFT) calculations based on VOPO 4–VOPO 4 and VOPO 4-graphene bilayers were performed to investigate the lattice strains induced by the interface in the heterostructures. As shown in Supplementary Fig.  13, we observed shortened P–O and V–O bond lengths from 1.597 and 1.550 Å in VOPO 4–VOPO 4 bilayers to 1.594 and 1.548 Å in VOPO 4-graphene bilayers. The lattices (a × b) of VOPO 4 were optimized to be 6.212 × 6.212 Å. The lattice strain ( δ) for VOPO 4-graphene is defined as\n  A lattice strain ( δ) of 3.2% can be estimated in VOPO 4-graphene, which is consistent with the result based on the Raman analysis.\n The XRD patterns of the VOPO 4·2H 2O, VOPO 4 nanoflakes and 2D VOPO 4-graphene multilayered heterostructure are shown in Fig.  2l and Supplementary Fig.  14. All three materials are layered VOPO 4 structures with dominant 00l peaks. The bulk VOPO 4·2H 2O showed an interlayer distance of ~0.74 nm. The shifted 001 peaks resulted in a decreased interlayer separation of ~0.66 nm for the VOPO 4 nanoflakes and the 2D VOPO 4-graphene multilayered heterostructure. The significantly different intensities of 001 peaks imply the stacking density of VOPO 4 in these layered structures, which can be roughly estimated based on the Scherrer formula. Consequently, the 2D VOPO 4-graphene multilayered heterostructures exhibited an average restacking thickness of ~15 nm (Fig.  2m), which is much smaller than that of bulk VOPO 4·2H 2O (~400 nm) and VOPO 4 nanoflakes (~50 nm). These results strongly confirm that limited number of VOPO 4 sheets were confined and stabilized between the graphene nanosheets, resulting in a 2D VOPO 4-graphene multilayered heterostructure with interface strain.\n  Taking potassium as an example, the intercalation mechanism of the 2D VOPO 4-graphene multilayered heterostructure was first investigated. In situ XRD measurements of the 2D VOPO 4-graphene multilayered heterostructure cathodes were conducted during charge/discharge cycles (Supplementary Fig.  15 and Fig.  3a). A large irreversible capacity was possibly due to the protons in the structure, as elucidated by the previous studies  35, 36, 37. No new peaks or asymmetric variations were observed, indicating a topotactic one-phase reaction in the 2D VOPO 4-graphene multilayered heterostructure cathode during cycling. The 001 peak was observed during the charge/discharge processes, demonstrating the well-maintained 2D multilayered heterostructure. However, it gradually shifted to lower 2 θ values upon discharge (potassium intercalation) and reversed back to the original value after charge (potassium de-intercalation), which can be attributed to the continuous lattice volume variations during cycling (Fig.  3b). Interlayer distances were calculated from the 001 peaks during the charge/discharge cycles with reversible lattice breathing (Fig.  3c). The corresponding volume change was calculated to be only 2.0%, comparable to the reported zero-strain electrode materials for PIBs  13, 38. Such a small volume change in the crystal structure guarantees a long-term cycling stability.\n Typical charge/discharge profiles and in-situ XRD patterns of  a VOPO 4-graphene and  d VOPO 4 nanoflakes as cathodes for PIBs. Enlarged in-situ XRD patterns from 11° to 15° of  b VOPO 4-graphene and  e VOPO 4 nanoflakes. The interlayer distance of  c VOPO 4-graphene and  f VOPO 4 nanoflakes calculated from XRD patterns during the charge/discharge processes of PIBs.  g Ex-situ V 2p XPS of VOPO 4-graphene in initial, discharged and charged states.  h Schematic illustration of proposed reversible intercalation mechanism of K + ions for the 2D VOPO 4-graphene multilayered heterostructure.\n For comparison, the structural evolution of the restacked VOPO 4 nanoflakes upon K +-ion insertion and extraction was also examined (Supplementary Fig.  16 and Fig.  3d). In addition to the peak shifting, asymmetric peak evolution was clearly identified upon K +-ion insertion and extraction, suggesting a two-phase reaction (Fig.  3e). The initial 001 peak was still detected after the discharge process, indicating an insufficient insertion of K + ions within the nanoflakes. The evolution of the interlayer distance of restacked VOPO 4 nanoflakes is shown in Fig.  3f. A new peak with an increased interlayer distance of ~0.75 nm was observed after K +-ion insertion, resulting in a volume change of 136%, which is much larger than that of 2D VOPO 4-graphene multilayered heterostructure. Moreover, during the second cycle of K +-ion insertion, the 001 peak gradually disappeared and another new peak with a decreased interlayer distance of ~0.62 nm was formed, which may imply the degradation of the initial layered structure of restacked VOPO 4 nanoflakes. In order to confirm this hypothesis, the restacked VOPO 4 nanoflakes and 2D VOPO 4-graphene multilayered heterostructure were further charged/discharged for 50 cycles. As shown in Supplementary Fig.  17, the charge/discharge profiles of the 2D VOPO 4-graphene multilayered heterostructure overlapped at different cycles. However, the polarization of restacked VOPO 4 nanoflakes significantly increased and the discharge plateau vanished after the initial several cycles, accompanied by obviously decayed capacity (Supplementary Fig.  18). After cycling, the 001 peak of the 2D VOPO 4-graphene multilayered heterostructure was still maintained, indicating the outstanding structural stability (Supplementary Fig.  19). In contrast, no 001 peak was observed for the restacked VOPO 4 nanoflakes. These results prove the collapse of the layered structure of restacked VOPO 4 nanoflakes during the repeated intercalation/de-intercalation of K + ions (Supplementary Fig.  20). In contrast, the 2D multilayered heterostructures with VOPO 4 nanosheets confined between graphene layers\n......", "posttime": "2020-07-22 00:07:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "异质,heterostructures,石墨", "title": "纳米工程2D层状异质结构改进的超锂储能", "title_en": "Nanoengineered 2D layered heterostructures for improved beyond-Li energy storage", "transed": 1, "url": "https://www.nature.com/articles/s41467-020-17014-w", "via": "", "real_tags": ["异质", "石墨"]}]