[{"category": "", "categoryclass": "", "imagename": "5dec48d96483c4cd6b5cd20d75c7493c.jpg", "infoid": 1014428, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从载有两名宇航员的“龙”号机组人员从地球表面发射升空并将NASA宇航员道格·赫尔利(Doug Hurley)和鲍勃·本肯(Bob Behnken)送入轨道以来，已经过去了近两个月。现在，该回家了。\n到目前为止，SpaceX建造的乘员航天器的这次试飞自5月30日发射以来几乎没有任何瑕疵。这艘宇宙飞船被机组人员命名为奋进号，在前往国际空间站的途中平稳飞行，并在那里停靠，没有发生任何事故。在过去的两个月里，它的太阳能电池板表现良好。在轨道上，赫尔利和本肯-他们进行了四次太空行走，帮助在空间站外安装新电池-为NASA的任务做出了贡献。\n现在，美国国家航空航天局希望机组人员回家，并完成试飞的最后一个关键目标，安全地溅落在海洋中。名义上，这定于8月2日(星期日)下午举行。\n最终的目标日期和时间将在周三的返程飞行准备情况评估中选定，该评估将同时考虑航天器的健康状况和天气。在佛罗里达州周围，墨西哥湾和大西洋都有七个可能的飞溅区。在天气标准中，风速低于每小时16.5公里，海面平静，降雨概率低。\n关于在哪里溅落的决定将在脱离码头前大约六个小时做出，但是否真正脱离码头的最终决定可能要到起飞前的最后几分钟才会做出。根据选择的溅落地点，机组人员在脱离对接后需要6到30个小时才能返回地球。\n机组人员龙将执行两次非常短的燃烧以脱离空间站，然后将有四次稍微长一点的燃烧，以将奋进号移得更远，开始回家的旅程。在此期间，NASA和SpaceX将继续监测溅落地点的天气，如果情况恶化，将决定等待24至48小时再进行一次着陆尝试。\n当最终决定承诺着陆时，“龙”号太空舱将脱下它的后备箱，进行脱轨燃烧。在再入过程中，“龙”号将面临高达1,950°C的温度，依靠其前向隔热罩吸收这些极端条件。\n一旦进入较低的大气层，太空舱的降落伞将在地球表面上方5.5公里处展开，随后主要降落伞将在大约2公里的高度展开。溅落后，赫尔利和本肯将根据海况在“龙”号内停留30到60分钟，然后“Go Searcher”号和“Go Navigator”回收船将飞船吊到主甲板上。\n在船上进行初步检查后，在大多数情况下，机组人员将登上直升机飞往卡纳维拉尔角。在陆地上，他们将乘坐美国国家航空航天局(NASA)的飞机，将他们带到休斯顿他们家附近的艾灵顿球场(Ellington Field)。然后，最后，他们将完成一段时间的飞行。", "note_en": "Nearly two months have passed since a Crew Dragon spacecraft carrying two astronauts  blasted off the face of the Earth and delivered NASA astronauts Doug Hurley and Bob Behnken into orbit. Now, it&#39;s time to come home.\n So far, this test flight of the SpaceX-built crew spacecraft has gone nearly flawlessly since its May 30 launch. Named  Endeavour by its crew, the spaceship flew smoothly on its way to the International Space Station, where it docked without incident. During the last two months, its solar panels have held up well. And while on orbit, Hurley and Behnken—who performed four spacewalks to help install new batteries outside the station—contributed to NASA&#39;s mission.\n  Now, NASA would like the crew to come home and complete the final, key objective of the test flight, splashing down safely in the ocean. Nominally, this is scheduled for the afternoon of Sunday, August 2.\n A final target date and time will be selected on Wednesday, during a &#34;Return Flight Readiness Review,&#34; which will consider both the health of the spacecraft and weather. There are seven potential splashdown zones for Dragon around the state of Florida, in both the Gulf of Mexico and Atlantic Ocean. Among the  criteria for weather are winds less than 16.5km/hour, calm seas, and a low probability of rainfall.\n A decision on where to splash down will come about six hours before undocking, but a final call on whether to actually undock may not be made until the final minutes before departure. Depending on the splashdown location chosen, it will take between six and 30 hours for the crew to return to Earth after undocking.\n Crew Dragon will perform two very short burns to separate from the station, and then there will be four slightly longer burns to move  Endeavour farther away and begin the journey home. During this time, NASA and SpaceX will continue to monitor weather in the splashdown location, and if conditions deteriorate a decision will be made to wait 24 to 48 hours for another landing attempt.\n When a final decision is made to commit to a landing, the Dragon capsule will shed its trunk and perform a deorbit burn. During the reentry process Dragon will be subjected to temperatures as high as 1,950°C, relying on its forward heat shield to absorb these extreme conditions.\n  Once in the lower atmosphere, the capsule&#39;s drogue parachute will deploy at about 5.5km above the planet&#39;s surface, followed by the main parachutes at an altitude of about 2km. After splashing down, Hurley and Benhken will remain inside Dragon for 30 to 60 minutes, depending on sea states, before either the  Go Searcher and the  Go Navigator recovery ship hoists the spacecraft onto its main deck.\n After an initial checkout on the ship, in most scenarios, the crew will board a helicopter to fly to Cape Canaveral. On land, they will take a NASA plane that will bring them to Ellington Field, near their homes in Houston. And then, finally, they will be done flying for a while.", "posttime": "2020-07-27 22:58:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,允许,dragon,机组人员", "title": "如果天气允许，船员龙可能会在本周从太空返回", "title_en": "Crew Dragon likely to return from space this week—weather permitting", "transed": 1, "url": "https://arstechnica.com/science/2020/07/crew-dragon-likely-to-return-from-space-this-week-weather-permitting/", "via": "", "real_tags": ["太空", "允许", "dragon", "机组人员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014427, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-华尔街日报周一援引知情人士的话报道，Alphabet公司的谷歌将把员工留在家里至少到明年7月。\n据报道，首席执行长桑达尔·皮查伊(Sundar Pichai)上周在他担任主席的一个内部高管小组进行辩论后，亲自做出了这一决定。(https://on.wsj.com/32XuX)。\n谷歌早些时候曾表示，最早将于今年6月开始在全球重新开设更多办事处，但大多数谷歌员工可能会在家工作到今年年底。\n我们的目标是为用户创造一个安全和吸引人的地方，让他们在兴趣和激情上建立联系。为了改善我们的社区体验，我们暂停了文章评论。同时，我们欢迎您的反馈，帮助我们提升体验。", "note_en": "(Reuters) - Alphabet Inc&#39;s Google will keep its employees home until at least next July, the Wall Street Journal reported on Monday, citing people familiar with the matter.\n Chief Executive Officer Sundar Pichai made the decision himself last week after debate among an internal group of top executives that he chairs, according to the report. (https://on.wsj.com/32XuX\n   Google had earlier said it would begin reopening more offices globally as early as June this year, but most Google employees would likely work from home until the end of this year.\n   Our goal is to create a safe and engaging place for users to connect over interests and passions. In order to improve our community experience, we are temporarily suspending article commenting.  In the meantime, we welcome your feedback to help us enhance the experience.", "posttime": "2020-07-27 22:58:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,华尔街,谷歌,员工,employees", "title": "在大流行期间，谷歌将把员工留在家里直到2021年夏天：华尔街日报", "title_en": "Google to keep employees home until summer 2021 amid pandemic: WSJ", "transed": 1, "url": "https://finance.yahoo.com/news/google-keep-employees-home-until-132255425.html", "via": "", "real_tags": ["google", "华尔街", "谷歌", "员工", "employees"]}, {"category": "", "categoryclass": "", "imagename": "b3c28f6b4158a592fdaa24e4460b15eb.jpg", "infoid": 1014426, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "香农·法利(Shannon Farley)是快速前进(Fast Forward)的联合创始人兼执行董事，该公司是一家面向社会影响初创企业的技术加速器。\n本着更快达到规模影响的精神，如果你想把你改变世界的想法转化为科技非营利组织，我们总结了我们的五大经验教训，并牢记在心。我们摘自科技非营利组织的行动手册，这是一本创建具有社会影响力的初创企业的免费指南，我们借鉴了科技非营利组织的经验，他们的工作改变了他们的行业。\n你有个大主意。你已经发现了一个你忍不住想要解决的社会问题，你认为你可能就是有了一个改变世界的、由技术驱动的解决方案。但是，如果不深入了解您所服务的社区，您就无法解决您确定的问题。不这样做是失败的秘诀。如果你还没有经历过这个问题，那就找一位曾经经历过这个问题的联合创始人。然后，去见其他对这个问题有第一手经验的人。用以用户为中心的视角采访这些人，让他们有洞察力和机会展示自己。\n要在行动中看到这一点，请考虑Upsolve，即破产法第7章的TurboTax，帮助低收入美国人从严重的金融危机中恢复过来。在他们的用户研究阶段，联合创始人向实体法律援助组织索要他们的等待名单，并在人们因债务诉讼而寻求帮助的法律援助诊所分发他们的卡。这些策略使Upsolve能够考虑广泛的视角样本，并从用户的角度深入理解问题。不要吝啬这一点--你的用户研究应该启发和启发你最初的产品想法。\n现在，是时候通过试用最低可行产品(MVP)来检验你的产品想法了，MVP是一款产品的早期版本，它可以很容易地了解你的用户。你的MVP不需要是一个完全充实的产品。在Upsolve的案例中，这是一个物理空间，他们在现实生活中帮助用户申请破产。对你的MVP进行一次小规模的试验，以确认、否认或改变你的假设。一旦您已经试用MVP足够长的时间，并且确信您有一个可行的解决方案，那么就到了构建测试版产品的时候了。\n要构建您的测试版产品或几乎即将推出的产品，请利用现有的技术解决方案来解决您的新用例--不要从头开始。对于Upsolve来说，它是一种Typeform，一种在线即插即用的表单。从网站和通信工具等技术性较低的产品，到应用程序开发工具、数据库和API等技术性较强的产品，将现有的技术构建块拼凑在一起将降低您的启动成本，并最终使您的产品更容易维护。随着您的解决方案面世，在您继续测试、改进和迭代以更紧密地服务于您的使命的同时，将用户反馈构建到您的产品中。\n作为一家科技非营利组织，有一系列非常独特的优势，当利用这些优势时，我们喜欢称之为非营利柔道。一个重要的非营利性柔道策略是与其他组织、资助者和公司建立一致的合作伙伴关系，创建互利关系，推动科技非营利性组织的可持续性，并增加用户获取。\n以CareerVillage.org为例，它为数百万得不到服务的年轻人提供众包职业建议。在最初的几年里，招募志愿者和筹款都占用了创始团队的大量时间。但当他们了解到财富500强公司正在为他们的员工寻找简单且可扩展的志愿服务计划时，一个解决方案出现了。CareerVillage.org建立了一个以公司员工志愿服务为中心的可持续的“赚取收入”收入模式。\n这项非营利性柔道已经成为该组织快速发展的主要驱动力。双赢。科技非营利组织攻略挖掘了非营利组织可以利用的更多战略优势，并分享了非营利性柔道的现实世界例子。与其进入你的科技非营利性旅程，想象一场艰苦的战斗，不如通过利用它带来的独特机会来扭转局面。\n为了实现你的使命，找到那些相信你的事业并能帮助你实现目标的人。\n最重要的是，尽早找到一位互为补充的联合创始人，他要么是技术专家，要么是问题专家。联合创始人填补彼此的空白，分配工作，为团队奠定坚实的基础。\n接下来，专注于雇佣有才华、有使命的人(他们确实存在！)。他们可以帮助您构建和扩展。这并不意味着一旦你有了资金就尽可能多地招聘员工-学生免费阅读平台CommonLit付出了惨痛的代价才学会了这一点。在赢得400万美元的拨款后，创始人米歇尔·布朗(Michelle Brown)在40天内竞相招聘了15人。事后，布朗意识到，你不能把人当成个人来雇，你必须雇一个团队。为您的组织提供动力的个人将定义它会变成什么样子。明智地选择。\nImpact是一家科技非营利性组织的真正北方。在你开始创造影响之前，你必须弄清楚你的“谁”和你的“为什么”，或者分销伦理。分销伦理是Medc Mobile创始人Josh Nesbit共享的框架，它的概念是，决定您要帮助的人以及他们为什么需要您的帮助是一种道德立场-并将影响您作为一个组织所做的一切。\n当Nesbit首次推出Medc Mobile时，该组织正在与实地组织合作实施医疗保健工具。在这样做的过程中，他为已经拥有人力和财力的当地合作伙伴提供了工具。内斯比特意识到这个框架并不能反映他的道德立场--他想帮助那些最不容易获得医疗服务的人。这一认识帮助他重新调整了组织的重点，重新定义了产品愿景，以服务于最需要的人。从那时起，Medc Mobile一直在构建开源工具，使分散的社区卫生工作者网络能够提供有效的最后一英里医疗服务。它产生了巨大的影响：去年，医疗移动支持了一个由27477名卫生工作者组成的全球网络，该网络为他们的社区提供了1100多万项服务。\n随着你的成长，要有意识地衡量你的影响力。通过将您的工作与您想要为世界创造的价值保持一致，影响度量决定了您组织的架构。这是一个重要的实践，它不仅将你的产出集中在你的任务上，而且还帮助你通过资金和合作伙伴关系为你的工作筹集支持。", "note_en": "Shannon Farley is co-founder and executive director at  Fast Forward, a tech accelerator for social impact startups.\n  In the spirit of reaching impact at scale faster, we rounded up our top five lessons to take to heart if you want to turn your world-changing idea into a tech nonprofit. Distilled from  The Tech Nonprofit Playbook, a free guide to starting a social impact startup, we drew from the learnings of tech nonprofits whose work has transformed their sectors.\n  You have a big idea. You’ve identified a social problem you can’t help but try to fix, and you think you just might have a world-changing, tech-driven solution. But you can’t solve the issue you’ve identified without a deep understanding of the community you’re serving. Not doing so is a recipe for failure. If you haven’t lived the problem, bring on a co-founder who has. Then, go meet others who have firsthand experience with the problem. Interview these individuals with a user-centered lens to allow insights and opportunities to reveal themselves.\n  To see this in action, consider  Upsolve, the TurboTax for chapter 7 bankruptcy, helping low-income Americans recover from crippling financial crises. During their user research phase, the co-founders asked brick and mortar legal aid organizations for their waitlists, and passed out their cards in legal aid clinics where people were seeking help around debt lawsuits. These strategies enabled Upsolve to consider a broad sample of perspectives and develop a deep understanding of the problem from the users’ point of view. Don’t skimp on this — your user research should inspire and inform your initial product idea.\n  Now, it’s time to put your product idea to the test by piloting a minimum viable product, or MVP — an early version of a product that surfaces learnings about your users with little effort. Your MVP needn’t be a fully fleshed-out product. In Upsolve’s case, it was a physical space where they helped users file for bankruptcy in real life. Run a small-scale pilot of your MVP to confirm, deny or alter your hypothesis. Once you’ve piloted your MVP for enough time that you’re confident you have a viable solution, it’s time to  build a beta product.\n To build your beta product, or an almost ready-to-launch product, leverage existing tech solutions to address your new use case — don’t start from scratch. For Upsolve, it was a Typeform, an online plug-and-play form. From less technical products like website and communication tools, to more technical ones like app development tools, databases and APIs, piecing together existing tech building blocks will drive your startup costs down and ultimately make it easier to maintain your product. With your solution out in the world, build user feedback into your product as you continue testing, refining and iterating to more closely serve your mission.\n  Being a tech nonprofit comes with a pretty unique set of advantages that, when leveraged, are what we like to call  nonprofit judo. A critical nonprofit judo tactic is forging aligned partnerships with other organizations, funders and companies to create mutually beneficial relationships that drive sustainability for your tech nonprofit and increase user acquisition.\n Take  CareerVillage.org, which crowdsources career advice for millions of underserved youth. For the first few years, recruiting volunteers and fundraising each took a lot of the founding team’s time. But a solution arose when they learned that Fortune 500 companies were looking for easy and scalable volunteering programs for their employees. CareerVillage.org built a sustainable “earned income” revenue model centered around volunteering engagements for corporate employees.\n This nonprofit judo has become a major driver of the organization’s rapid growth. Win-win. The Tech Nonprofit Playbook digs into more strategic advantages nonprofits can leverage, and shares real-world examples of nonprofit judo. Rather than going into your tech nonprofit journey imagining an uphill battle, turn the scenario around by tapping into the unique opportunities it presents.\n  To achieve your mission,  find the people who believe in your cause and can help you get there.\n Most importantly, find a complementary co-founder early on who is either technical or an issue expert. Co-founders fill in each other’s gaps, distribute the work and build a strong foundation for the team.\n Next, focus on hiring talented, mission-driven people (they exist!) who can help you build and scale. This doesn’t mean hiring as many people as possible once you have the funding for it — something CommonLit, the free reading platform for students, learned the hard way. After winning a $4 million grant, founder Michelle Brown raced to hire 15 people in 40 days. After the fact, Brown realized that you cannot hire people as individuals, you must hire a team. The individuals powering your organization will define what it becomes. Choose wisely.\n  Impact is a tech nonprofit’s true north. Before you can get down to creating impact, you have to figure out your “who” and your “why,” or distribution ethics. Distribution ethics, the framework shared by  Josh Nesbit,   founder of  Medic Mobile, is the concept that deciding  who you are going to help and  why they need your help over others is an ethical stance — and will impact everything you do as an organization.\n When Nesbit first launched  Medic Mobile,   the organization was implementing healthcare tools in partnership with on-the-ground organizations. In doing so, he was providing tools to local partners who already had human and financial capital. Nesbit realized this framework wasn’t reflective of his moral stance — he wanted to help those with the  least access to medical care. This realization helped him refocus the organization and redefine its product vision to serve those most in need. Since then, Medic Mobile has been building open-source tools that enable a decentralized network of community health workers to deliver effective last-mile healthcare. And it has made a huge impact: Last year, Medic Mobile supported a global network of 27,477 health workers, which provided more than 11 million services for their community.\n As you grow, be intentional about how you measure your impact. Impact measurement dictates your organization’s architecture by aligning your work with the value you want to create for the world. It’s a critical practice that not only centers your output around your mission, but helps you raise support for your work through funding and partnerships.", "posttime": "2020-07-27 22:57:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "社会,lessons,组织", "title": "\n从创办社会影响力初创公司的创始人那里学到的五个关键教训", "title_en": "\n\t\t\t\tFive key lessons from founders who launched social impact startups\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/five-key-lessons-from-founders-who-launched-social-impact-startups/", "via": "", "real_tags": ["社会", "lessons", "组织"]}, {"category": "", "categoryclass": "", "imagename": "17fc0b65066fe60754f721ca374b8e44.jpg", "infoid": 1014425, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在2018年，SAP以80亿美元现金收购了Qualtrics，就在这家规模较小的公司即将上市之前。在交易前后与两家公司的首席执行官聊天时，他们对合并相当兴奋。从那以后，SAP更换了首席执行官。\n该交易所探索初创企业、市场和资金。你可以每天早上在Extra Crunch上阅读它，或者每周六获得Exchange时事通讯。\n当时，这笔交易不仅在商界掀起了波澜，还帮助犹他州的创业场景声名鹊起。(80亿美元的交易产生了影响。)。\n目前对剥离想法的评论似乎是围绕着释放价值的想法进行的，即如果SAP能够让Qualtrics的大量股票上市，市场可能会给这些股票一个好价格。因此，SAP将保留的Qualtrics价值将获得隐性价值，可能会提振其自身股票的价值。CNBC援引伯恩斯坦研究公司(Bernstein Research)的分析师的话阐述了这一观点。伯恩斯坦研究公司表示，它认为“许多SAP投资者并不完全了解Qualtrics”，剥离可能“至少在更好地理解其价值方面有所帮助”。\nQualtrics值多少钱？如果我们能够理解这一点，我们就会知道目前关于剥离的评论是否有意义。因此，今天上午，让我们提醒自己，Qualtrics即将进行首次公开募股(IPO)的规模有多大，它可能值多少钱，自那以来它增长了多少，以今天超高的软件估值计算，它可能值多少钱。\nSAP是否支付了过高的价格？成交了吗？让我们来看看Qualtrics在2020年会是什么样子。\n在SAP从公开市场窃取之前，Qualtrics在公开市场上寻找每股18至21美元的价格，对该公司的估值约为39亿至45亿美元。显然，考虑到这家总部位于犹他州的公司当时的火爆程度，SAP必须支付高通股票的价格才能完成交易。\nQualtrics拥有增长和利润，这两样东西结合在一起创造了越来越多的市场价值。以下是当时Qualtrics的一些关键数字：", "note_en": "SAP    paid $8 billion in cash for Qualtrics back in 2018, right before the smaller firm was set to go public. Chatting with the CEOs of both companies around the time of the deal, they were  pretty pumped about the combination. Since then, SAP has  swapped CEOs.\n  The Exchange explores startups, markets and money. You can read it  every morning on Extra Crunch, or get  The Exchange newsletter every Saturday.\n  At the time, the deal not only made waves within the business realm, it also helped put Utah’s startup scene on the map. (An $8 billion deal makes an impact.)\n Current commentary on the spin-out idea seems to rotate on the idea of unlocking value, that if  SAP   can float a good chunk of  Qualtrics’   shares, the market may give that equity a good price. And, then, the value of Qualtrics that SAP will retain will gain implicit value, perhaps boosting the value of its own shares. Making the point,  CNBC quoted analysts from Bernstein Research, which said it believes “many SAP investors do not fully understand Qualtrics,” and that the spin-out might “help at least as it relates to better understanding its value.”\n What  is Qualtrics worth? If we can understand that, we’ll know if the current commentary regarding the spin-out makes sense. So this morning, let’s remind ourselves how big  Qualtrics   was heading into its IPO, what it might have been worth, how much it has have grown since and what that might be worth at today’s super-high software valuations.\n Did SAP overpay? Did it get a deal? Let’s find out what Qualtrics might look like in 2020.\n  Before SAP stole it from the public markets, Qualtrics  was looking for $18 to $21 per share on the public markets, valuing the company at around $3.9 billion to $4.5 billion. SAP had to pay up for Qualtrics stock, obviously, to get the deal done given how hot the Utah-based firm was at the time.\n Qualtrics had growth and profits, two things that combine to create lots and lots of market value. Here are some key Qualtrics numbers from the time:", "posttime": "2020-07-27 22:56:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipo,spinning,qualtrics", "title": "\n为什么SAP要通过IPO剥离Qualtrics？", "title_en": "\n\t\t\t\tWhy is SAP spinning Qualtrics out via an IPO?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/why-is-sap-spinning-qualtrics-out-via-an-ipo/", "via": "", "real_tags": ["ipo", "spinning", "qualtrics"]}, {"category": "", "categoryclass": "", "imagename": "2095d91ce13c936e996972e87597b3a1.jpg", "infoid": 1014424, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容如果您从Verge链接购买内容，Vox Media可能会赚取佣金。请参阅我们的道德声明。\n关于OnePlus的最新款手机OnePlus Nord似乎要回归本源，人们议论纷纷。这个品牌最初是通过以低得多的价格提供与竞争对手旗舰产品类似的规格而成名的。但多年来，它的价格一直在攀升，目前的GB 599/699美元OnePlus 8和GB 799/899美元8 Pro与更老牌的竞争对手相差不远。\n因此，对于起价379 GB(约合484美元)的OnePlus Nord来说，很容易让人觉得OnePlus正在回归本源。但由于其旗舰手机无处可去，中端手机Nord反而是OnePlus扩大产品阵容的下一步。OnePlus正在步入一个新时代，而不是回到旧时代。\n这意味着OnePlus不得不做出一些艰难的决定，决定它希望所有手机都拥有哪些功能，以及希望哪些功能是旗舰手机的独家功能。这是一种平衡的行为。去掉太多，你就只剩下一部没人应该买的手机了。但如果留得太多，你最终会得到OnePlus过去喜欢给自己的手机贴上标签的那个“旗舰杀手”。只是现在OnePlus有了自己的旗舰手机，有被卷入交叉火力的风险。\nOnePlus Nord在欧洲有两种型号：一种是GB 379/欧元399，内存8 GB，存储空间128 GB；另一种是我一直在使用的设备，价格为GB 469/欧元499，内存为12 GB，存储空间为256 GB。在印度，还有一款价格较低的机型，内存为6 GB，存储空间为64 GB。目前还没有在美国全面发布的计划。\n理论上，一加与Nord相比，与8相比做出的最大妥协是它的处理器。Nord由中端高通骁龙765G驱动，这比8和8Pro中的骁龙865低了一步。但在处理器选择之外，8的大部分功能都跳到了Nord上。\n对我来说最令人兴奋的是，这意味着Nord仍然拥有1080p的OLED显示屏，刷新率为90 Hz，但它也拥有与8相同的4800万像素主摄像头传感器，并支持低于6 GHz的5G。Nord甚至获得了几个有趣的额外功能，比如第二个拥有超宽视野的自拍相机和第四个用于感测深度的后置相机。\n这些规格让它听起来像是一款非常相似的手机，但他们没有告诉你的是，就个人而言，Nord给人的感觉就像是一款低端设备。例如，Nord的屏幕是扁平的，所以它没有制造商们喜欢的那种明显的曲线，它的背部更有塑胶感。(它有灰色和蓝色两种颜色可供选择。)。我不会说它感觉“便宜”，但它肯定更实用。这听起来很消极，但我真的很喜欢Nord的简单设计。它在手中的位置很好，它的设计也不会妨碍我-例如，我从来没有一次发现自己意外地触摸到了曲面显示器的两边。不过，如果能在这里看到耳机插孔就好了，而且这里也没有防尘或防水的官方IP评级。\n我对从Nord得到的电池续航时间很满意。考虑到我现在呆在家里的时间，这一点很难衡量(我也把时间花在连接4G而不是5G的手机上)，但即使我每天都在看YouTube视频，浏览Twitter，通过Slake和WhatsApp与同事和朋友保持联系，我两次充电的平均屏幕时间在8到10个小时之间。北冰洋轻而易举地撑过了我的一天，我想在正常使用的情况下，它会延伸到下一天。因此，一加显然不想因为其更便宜的设备而在电池续航时间上妥协。\n和OnePlus8一样，它没有无线充电功能，但你可以支持OnePlus的Warp Charge 30T快速充电标准。在手机开机的情况下，我发现它可以在25分钟内从0充电到50%，在不到一个小时的时间里就可以达到100%。\n你不必购买OnePlus旗舰设备就能获得可爱的90 Hz高刷新率显示屏，这很棒，但当与不太强大的处理器搭配使用时，它的表现就不那么好了。当你在应用程序抽屉等相对简单的东西上滚动时，它会显得丝滑流畅，但如果你试着滚动一些更密集的东西，比如Twitter无穷无尽的视频和图片，Nord的屏幕就无法与OnePlus 8的流畅度相提并论。它仍然比60 Hz的显示屏要好，但与我们在旗舰手机上看到的快速刷新显示屏相比，它是不一样的。\n除此之外，我真的很喜欢“北方人”的屏幕。它变得可爱而明亮，五颜六色，而且它的显示屏内指纹扫描仪也无可挑剔。这是一个大屏幕，但手机的小边框意味着手机本身对我来说并不太大。不过，我不希望它再大一点。\n令人遗憾的是，这款手机的音质跟不上。这里有一个向下发射的扬声器，这意味着没有立体声。虽然声音足够响亮，但就是没有太多的低音或生活气息。这是你以较低的价格做出的妥协。\n到目前为止，我一直在谈论OnePlus为其旗舰设备保留了哪些功能，以及它希望所有手机都拥有哪些功能。但相机在这里更难归类，因为它们从来都不是OnePlus的核心优势之一。他们一直都很好，但在班上从来都不是最好的。好消息是，Nord的摄像头与OnePlus8差不多，而且它还有几个自己的有趣功能。\nOnePlus Nord内置了很多摄像头硬件。背面有四个摄像头：4800万像素的主摄像头，800万像素的超广角摄像头，200万像素的微距摄像头和500万像素的深度传感器。前面有两个：一个是3200万像素的主摄像头，另一个是具有105度视野的800万像素的超宽相机，后者是Nord独有的。\n在白天，我认为你会得到与Nord 8非常相似的质量照片。有时它比OnePlus8增加了一点饱和度，但在大多数情况下，很难区分它们，包括给人拍照时。\n广角拍摄则是另一回事，因为分辨率降低了。在这个价格下，这感觉是一个适当的权衡，总的来说，我很高兴它在这里，而不是根本没有广角相机。广角自拍相机尤其如此，这是我希望在更多手机上看到的功能。较低的分辨率使照片看起来更柔和，我还发现自拍相机总体上让我的脸变得奇怪地明亮(尽管Nord远不是唯一能做到这一点的智能手机)。不过总体而言，广角相机是拍摄团体照片的一个很好的补充。\n在我的经验中，设备背面的另外两个摄像头更像是一个喜忧参半的包。我很难用微距相机拍出清晰的照片，多亏了深度感应相机，肖像照片有了一些改进，但并不完美，在这张照片中，我被室友左上角的头发弄糊涂了。如果可以选择，我更希望有一个像我们在OnePlus8Pro上看到的单一长焦镜头，但我猜OnePlus想把它留在最高端的手机上。\n微光性能类似于OnePlus 8，也就是说，它可以接受，但没有什么令人惊叹的地方。\n因此，就像它的90 Hz屏幕一样，Nord有很多摄像头硬件，但它似乎没有发挥出绝对的优势。但中档手机很少出现这种情况，Nord与售价高出200美元的OnePlus 8处于类似的水平，这是一个很好的成就。\nNord是一款非常坚固的中档手机，但并不完美。它的规格很好，有广泛的摄像头阵列和一个大的高刷新率显示屏。但在现实中，它并没有从所有这些硬件中获得最大的好处。它的处理器不能一直最大限度地发挥屏幕的作用，相机的性能最终只能是正常的，而不是出色的。不过，在这个价格下，这些都不是交易的破坏者，我也不会说Nord在任何一个领域都表现不佳。\n选择一部中档手机通常是一个选择战斗的问题。您可以选择对您来说最重要的功能，因为没有一款中档手机可以提供所有这些功能。然而，当谈到北欧时，要用简单的术语来描述它的妥协就有点困难了。它太全面了，这意味着没有严重的陷阱，但也没有哪一个领域是它出类拔萃的。\n这不一定是坏事，只是让你很难毫无保留地向任何一群人推荐这款手机。另一方面，这也意味着我可以向几乎任何人推荐它，但有一些小小的警告。这是一款不错的中档手机，但它不能做到一加旗舰手机所能做到的一切。", "note_en": "Skip to main content                                                                                                                If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n    There’s been a lot of talk about how OnePlus seems to be going back to its roots with its latest phone, the OnePlus Nord. This is a brand that first made a name for itself by offering similar specs to competing flagships at a much lower price. But over the years, its prices have crept up and up, and its current £599 / $699 OnePlus 8 and £799 / $899 8 Pro aren’t far off its more established competitors.\n So it’s easy for the OnePlus Nord, with its starting price of £379 (around $484), to make it seem like OnePlus is going back to its roots. But since its flagship phones aren’t going anywhere, the midrange Nord is instead the next step in OnePlus expanding its lineup. OnePlus is stepping into a new era, not returning to an old one.\n That means OnePlus has had to make some tough decisions about which features it wants all its phones to have and which it wants to keep exclusive for its flagships. It’s a balancing act. Remove too much, and you’re left with a phone that no one should buy. But keep too much, and you end up with the very same “ flagship killer” that OnePlus liked to label its phones as back in the day. Only now OnePlus has flagship phones of its own that are at risk of getting caught in the crossfire.\n There are  two models of the OnePlus Nord available in Europe: a £379 / €399 model with 8GB of RAM and 128GB of storage, and the device that I’ve been using, which costs £469 / €499 and has 12GB of RAM and 256GB of storage. In India, there’s an additional less-expensive model with 6GB RAM / 64GB storage. There are currently no plans for a full release in the US.\n  On paper, the single biggest compromise OnePlus has made with the Nord compared to the 8 is its processor. The Nord is powered by a midrange Qualcomm Snapdragon 765G, which is a step down from the Snapdragon 865 found in the 8 and 8 Pro. But outside of its processor choice, most of the 8’s features have made the jump to the Nord.\n Most exciting for me is that this means the Nord still has a 1080p OLED display with a 90Hz refresh rate, but it’s also got the same 48-megapixel main camera sensor as the 8 and support for sub-6GHz 5G. The Nord even gets a couple of fun extras, like a second selfie camera with an ultrawide field of view and a fourth rear camera for sensing depth.\n  These specs make it sound like a very similar phone, but what they don’t tell you is that, in person, the Nord feels like a lower-tier device. The Nord’s screen is flat, for example, so it doesn’t have that tell-tale curve that manufacturers are so fond of, and its back is more plastic-feeling. (It’s available in either gray or blue.) I wouldn’t say it feels “cheap,” but it’s certainly more utilitarian. That sounds like a negative, but I really like the simplicity of the Nord’s design. It sits nicely in the hand, and its design doesn’t get in the way — not once did I find myself accidentally touching the sides of a curved display, for example. It would have been nice to see a headphone jack here, though, and there’s also no official IP rating for dust or water resistance.\n I was happy with the battery life I got from the Nord. This is something that’s harder to gauge given the amount of time I’m spending at home right now (and I also spent my time with the phone connected to 4G rather than 5G), but even with my days filled with watching YouTube videos, browsing Twitter, and keeping in contact with colleagues and friends over Slack and WhatsApp, I was averaging anywhere between eight and 10 hours of screen time between charges. The Nord easily lasted through my day, and I think under normal use it would stretch into the next. So clearly OnePlus doesn’t want to compromise on battery life for its cheaper device.\n Like the OnePlus 8, there’s no wireless charging, but you do get support for OnePlus’ Warp Charge 30T fast-charging standard. With the phone turned on, I found it could charge from 0 to 50 percent in 25 minutes and hit 100 percent in just under an hour.\n  It’s great that you don’t have to buy a flagship OnePlus device to get one of its lovely 90Hz high refresh rate displays, but it doesn’t perform as well when paired with a less powerful processor. It’s silky smooth when you’re scrolling through something relatively simple like the app drawer, but try scrolling through something more intensive like Twitter’s endless videos and images, and the Nord’s screen can’t match the smoothness of the OnePlus 8’s. It’s still better than a 60Hz display, but it doesn’t match what we’ve seen from fast refresh displays on flagship phones.\n Otherwise, I really liked the Nord’s screen. It gets lovely and bright, it’s colorful, and I can’t fault its in-display fingerprint scanner. It’s a big screen, but the phone’s small bezels mean that the phone itself wasn’t too large for me. I wouldn’t like it to be any bigger, however.\n It’s a shame that the phone’s audio quality doesn’t keep up. There’s a single downward-firing speaker here, which means no stereo sound. And while it gets plenty loud enough, there’s just not much bass or life to it. It’s a compromise you make by paying a lower price.\n  So far, I’ve been talking about which features OnePlus has kept for its flagship devices and which it wants all its phones to have. But cameras are harder to categorize here because they’ve never been one of OnePlus’ core strengths. They’ve been good but never best in class. The good news is that the Nord’s cameras are in a similar ballpark to the OnePlus 8, and it also gets a couple of interesting features all of its own.\n There’s a lot of camera hardware packed into the OnePlus Nord. On the back, there are four cameras: a 48-megapixel main camera, an 8-megapixel ultrawide angle camera, a 2-megapixel macro camera, and a 5-megapixel depth sensor. Then there are two on the front: a main 32-megapixel camera, and an 8-megapixel ultrawide with a 105-degree field of view, the latter of which is exclusive for the Nord.\n In daylight, I think you get very similar quality photos to the 8 with the Nord. Sometimes it adds a little more saturation than the OnePlus 8 did, but for the most part, it’d be hard to tell them apart, including when taking pictures of people.\n  Wide-angle shots are a different story because of the drop in resolution. It feels like an appropriate trade-off at this price, and on balance, I’m glad it’s here rather than not getting a wide-angle camera at all. That’s especially true of the wide-angle selfie camera, which is a feature I’d like to see on more phones. The lower resolution gives photos a softer appearance, and I also found the selfie camera in general oddly brightened my face (though the Nord is far from the only smartphone to do this). Overall though, the wide-angle camera is a great addition for taking photos of groups.\n The other two extra cameras on the back of the device were more of a mixed bag in my experience. I struggled to get sharp photos using the macro camera, and while there was some improvement to portrait shots thanks to the depth-sensing camera, it wasn’t perfect and managed to get confused by the hair on the top left of my flatmate’s head in this shot. Given the choice, I’d much rather have a single telephoto lens like we saw on the OnePlus 8 Pro, but I guess OnePlus wants to keep that for its highest-end phone.\n  Low-light performance is similar to the OnePlus 8, which is to say that it’s acceptable but nothing amazing.\n  So like in the case of its 90Hz screen, the Nord has a lot of camera hardware, but it doesn’t seem to get the absolute best out of it. But that’s rarely the case for a midrange phone, and the fact that the Nord is in a similar league to the OnePlus 8, which costs the equivalent of $200 more, is a good achievement.\n  The Nord is a really solid midrange phone, but it’s not perfect. It’s well-specced, with a wide array of cameras and a big high refresh rate display. But in reality, it doesn’t get the most out of all this hardware. Its processor can’t get the most out of its screen all of the time, and camera performance only ends up being okay rather than excellent. None of these are dealbreakers at this price, though, and I wouldn’t say the Nord outright underperforms in any one area.\n Picking a midrange phone is normally a matter of choosing your battles. You pick the features that are most important to you because no midrange phone is going to offer all of them. When it comes to the Nord, however, it’s a little harder to put its compromises into simple terms. It’s too well-rounded, meaning there are no serious pitfalls, but there’s also no single area where it excels.\n That’s not a bad thing necessarily, it just makes it a little hard to unreservedly recommend this phone to any one group of people. On the flip side, it also means that I can, with some minor caveats, recommend it to almost anyone. It’s a good midrange phone, but it can’t do everything a OnePlus flagship can.", "posttime": "2020-07-27 22:48:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "5g,相机,手机,nord", "title": "OnePlus Nord评论：90 Hz OLED显示屏，低于6 GHz的5G，强大的电池，但其CPU可以拖住手机，尽管有多个镜头，但相机表现平平", "title_en": "OnePlus Nord review: 90Hz OLED display, sub-6GHz 5G, and great battery, but its CPU can hold the phone back and the camera is mediocre despite multiple lenses", "transed": 1, "url": "https://www.theverge.com/21337235/oneplus-nord-review-specs-features-camera-performance-battery-life-90hz-screen-oled?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["5g", "相机", "手机", "nord"]}, {"category": "", "categoryclass": "", "imagename": "6498a6584feb672f1f3fd14728d9528a.jpg", "infoid": 1014422, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "消费者技术协会(Consumer Technology Association)的一个新工作组将Facebook、微软等公司聚集在一起，为未来的健康危机制定计划。\n随着美国继续努力控制新冠肺炎疫情，一个由科技和医疗保健组织组成的广泛联盟正联合起来，希望帮助这个国家为下一场疫情做好准备。\n周一，消费技术协会(Consumer Technology Association)启动了公共卫生技术倡议(Public Health Tech Initiative)，这是一个工作组，成员包括知名的CTA成员，包括微软、Facebook和飞利浦，以及CVS Health、美国心脏病学会(American College of心脏ology)和纽约最大的医疗保健提供商诺斯韦尔健康(Northwell Health)等医疗保健公司。该小组的目标是研究在当前危机期间技术是如何部署的-无论是成功的还是失败的-并为未来的公共卫生紧急情况制定一套建议。它计划制作一份包含初步调查结果的白皮书，然后与政策制定者合作实施拟议的改革。\n我们听说了大流行带来的一些问题。缺乏获得护理的机会。缺乏获取技术的途径。…。CTA负责数字健康的副总裁雷内·卡西(Rene Quashie)表示：我们听说，我们的一些公共卫生当局没有准备好获得完整和准确的数据。所有这些加在一起让我们认为，考虑到我们的会员是谁，我们实际上可以做一些有意义的事情来解决这个问题。\n微软全球首席医疗官大卫·罗(David Rhew)博士将与奥巴马总统政府国土安全部(Department Of Homeland Security)前首席医疗官亚历山大·加尔扎(Alexander Garza)博士共同主持该小组，加尔扎博士现任中西部大型医疗保健系统SSM Health的首席医疗官。\n在许多方面，该组织正试图完成政府迄今无法做到的事情：制定一个统一的战略，在公共卫生紧急情况下部署技术。苹果(Apple)和谷歌(Google)等巨头都有专门的资源来开发联系人追踪应用，但联邦政府让各州决定使用哪种工具，导致全国的采用率微不足道。与此同时，由于医疗记录工具拼凑而成的系统并不总是说同一种语言，在医疗系统之间传输患者数据充其量也是笨拙的。\n目前在圣路易斯流行病特别工作组任职的加尔扎说，这确实显示了美国医疗保健和公共卫生的分散性质。了解技术如何帮助简化数据流不仅对政府有利，而且对许多不同的群体都是有利的。\nCTA的成员已经有了很多在危机期间如何使用他们的技术的例子。例如，微软一直在与世界各国政府合作，提供云基础设施并访问其人工智能工具，作为寻找疫苗的一部分。它的医疗聊天机器人成为疾病控制和预防中心症状跟踪器的基础，并已被国际上的急救人员用于大规模筛查。自美国埃博拉疫情爆发初期以来，Facebook一直在向与地方政府合作的研究人员提供社区移动模式的数据。该倡议的另一成员Doctor on Demand一直是爆炸性虚拟医疗市场的关键参与者。\n但该组织有意将其成员范围扩大到包括医疗保健行业和其他地方的声音。我们组成的这个团队的独特之处在于，它不仅仅是科技公司，Rhew说。我们正在谈论的是医疗保健提供者、付款人、其他个人和组织从所有不同的角度看待这个问题。你需要用360度的眼光来看待这个问题。\nCTA的特别工作组当然不是第一个此类工作组。白宫在3月份协调了一项针对当前危机的类似努力，但也以失败告终，早期成员退出，而且就如何在该组织内部制造裂痕问题上缺乏一致意见。加尔扎承认，该组织最艰巨的任务之一将是确定如何适当地扩大其工作范围，以产生最大影响。他特别感兴趣的问题包括虚拟医疗的兴起，可穿戴设备用于跟踪患者的潜力，以及从患者接受检测到结果发送给卫生当局的信息流动方式。但他知道还有无穷无尽的其他问题需要探索。\n我们可以为此写一本百科全书。加尔扎说，你必须挑选两三件足够广泛和足够重要的事情来做。这可能很有挑战性。", "note_en": "Power   A new working group from the Consumer Technology Association brings together Facebook, Microsoft and more to plan for future health crises.\n     As the U.S. continues its struggle to control the COVID-19 pandemic, a broad coalition of tech and health care organizations are banding together in hopes of helping the country prepare for the next one.\n  On Monday, the Consumer Technology Association launched the Public Health Tech Initiative, a working group that includes prominent CTA members, including Microsoft, Facebook and Philips, as well as health care players like CVS Health, the American College of Cardiology, and Northwell Health, New York&#39;s largest health care provider. The goal of the group is to study how technology has been deployed — both successfully and unsuccessfully — during the current crisis and develop a set of recommendations for future public health emergencies. It plans to produce a white paper with its initial findings and then work with policymakers on implementing proposed changes.\n  &#34;We heard about some of the issues from the pandemic. The lack of access to care. Lack of access to technology. … We were hearing that some of our public health authorities didn&#39;t have ready access to complete and accurate data,&#34; said Rene Quashie, vice president of digital health at CTA. &#34;All of those things combined together just made us think that given who our members were, we could actually do something to address this in a meaningful way.&#34;\n  Dr. David Rhew, global chief medical officer of Microsoft, will co-chair the group, along with Dr. Alexander Garza, former chief medical officer at the Department of Homeland Security under President Obama and the current chief medical officer of SSM Health, a large health care system in the Midwest.\n The group is, in many ways, trying to accomplish what the government has been so far unable to do: develop a unified strategy for deploying technology in a public health emergency. Giants like Apple and Google have dedicated resources to building contact-tracing apps, but the federal government has left it to the states to decide which tool to use, leading to  paltry adoption rates across the country. Transferring patient data between health systems, meanwhile, remains clunky at best due to a  patchwork system of medical record tools that don&#39;t always speak the same language.\n &#34;It really shows the fragmented nature of health care and public health within the U.S.,&#34; said Garza, who currently serves on St. Louis&#39; pandemic task force. &#34;Understanding how tech can help streamline data flows would be advantageous, not just for the government, but for a lot of different groups.&#34;\n  CTA&#39;s members already have plenty of examples of ways their technology has been used during the crisis. Microsoft, for one, has been working with governments around the world, providing cloud infrastructure and access to its AI tools as part of the search for a vaccine. Its health care chatbot became the  basis of the Centers for Disease Control and Prevention&#39;s symptom tracker and has been used by first responders internationally for large-scale screening. Facebook has been  feeding data about communities&#39; mobility patterns to researchers working with local governments since the early days of the outbreak in the U.S. And Doctor on Demand, another member of the initiative, has been a key player in the  exploding virtual health market.\n But the group was deliberate in reaching beyond its own membership to include voices from the health care industry and elsewhere. &#34;What was unique about this group we put together is it wasn&#39;t just tech companies,&#34; Rhew said. &#34;We&#39;re talking about health care providers, payers, other individuals and organizations looking at this from all different angles. You need that 360-degree look at this problem.&#34;\n CTA&#39;s task force certainly isn&#39;t the first of its kind. A similar effort focused on the current crisis and coordinated by the White House in March  stumbled, with early members dropping out and a lack of agreement about what to focus on creating fissures within the group&#39;s ranks. Garza acknowledged that one of the group&#39;s hardest tasks will be determining how to properly scope its work for maximum impact. He&#39;s particularly interested in looking at issues like the rise of virtual care, the potential for wearable devices to be used to track patients, and the way information flows from the moment a patient gets tested to the moment their results get sent to health authorities. But he knows there are endless other issues to explore.\n  &#34;We could write an encyclopedia about this. You have to pick the two or three things that are broad enough and important enough to work on,&#34; Garza said. &#34;That can be challenging.&#34;", "posttime": "2020-07-27 22:47:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,facebook,微软,技术,technology", "title": "消费者技术协会发起公共卫生技术倡议，这是一个包括微软和Facebook在内的工作组，将从大流行中吸取教训", "title_en": "Consumer Technology Association launches the Public Health Tech Initiative, a working group including Microsoft and Facebook that will learn from the pandemic", "transed": 1, "url": "https://www.protocol.com/cta-microsoft-facebook-health-initiative", "via": "", "real_tags": ["microsoft", "facebook", "微软", "技术"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014421, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你知道最糟糕的是什么吗？骨折。我在YouTube上看了太多山地自行车视频，在我当地的自行车道上第一次跳过之后，我开始意识到我的热情和信心远远超过了我的技能。在跳跃，撞到一棵树，飞过栏杆，直接落在小径下4米处的左肩后，我现在的锁骨(锁骨)骨折了。\n住在英国，我们有公共医疗保障，所以我哥哥直接开车送我去急诊室。X光检查很快证实我的锁骨折断成两半，但显然没什么可做的。他们给了我一个吊带，告诉我需要服用几天止痛药，并为我预订了第二天的骨折诊所。在骨折诊所，我和一位专科医生一起看X光片，他告诉我下一个十周的生活会是什么样子。在这一点上，我的胳膊几乎不能动了。我的肩膀有西瓜那么大，而且变黄了。像这样的十个星期。他妈的。\n我是一名软件开发人员。主要是ASP.NET和C#的东西。这意味着我住在Visual Studio…中。整天，每天。你有没有试过单手VS？试试看。这是可以做的，但并不容易。最难的事情之一是键盘快捷键。特别是Alt+Enter组合键。我的手很大，但即使是我也只能用右手挣扎。幸运的是，大多数功能都可以通过上下文菜单或UI的其他部分使用。\nVS的奇妙之处在于几乎所有的键盘快捷键都是可重新映射的。我以前从来没有想过这是一种可访问性功能，但它真的是一种可访问性功能。我一直拒绝更改不必要的键盘快捷键，因为我打算有一天再次开始使用两只手臂，但这在我工作和支付账单的工具中都是可用的，这真是太棒了。\n作为一名开发人员，我的大部分工作都是基于Web的，所以在考虑可访问性时，我倾向于考虑让视力有障碍的人(盲人和部分视力障碍者)可以访问这些东西。确保站点与屏幕阅读器一起工作，并确保控件和文本具有足够的大小和对比度，这通常是许多辅助功能工作的重点。还有一些事情，比如不要让TAP目标离得太近，这既是出于移动友好性的考虑，也是出于可访问性的考虑。\n因为我的大部分工作都是为了网络，所以我不会开发很多广泛使用键盘快捷键的软件。如果我未来的工作中确实有键盘快捷键，我肯定会考虑身体有限制的人如何使用它们。\n我不知道键盘快捷键可访问性的“官方”指南是什么(或者是否有任何指南！)，但在康复的最后几周里，我一直在思考我会很感激的指南。\n单手快捷键：首选单手可达的快捷键。大多数快捷键由一个修改键(Shift、Alt、Ctrl、Win、Cmd)和另一个“普通”键组成。尽量使“正常”键保持在修饰符的合理范围内。Shift和Ctrl通常在键盘两侧都有键，因此可以与这些键配对的键更多。请注意，虽然Alt显示在空格键的两侧，但右手键是AltGr。它们实际上是两个不同的关键点，因此在映射快捷键时请记住这一点。\n可重新映射：将所有默认键盘快捷键设置为单手操作并不总是合理的。对于身体健全的用户来说，一些单手快捷键实际上可能比需要双手的快捷键更不舒服或更方便。那很好，而且迎合你的主要人群也是个好主意。允许用户重新映射这些快捷键也是一个好主意。它不只是一个可访问性功能，它对于那些喜欢定制一切的人来说是非常棒的。\n提供替代方案：提供一个允许用户重新映射其键盘快捷键的界面并不总是可行的。也许没有预算，或者项目的范围根本不允许这样做。在这些情况下，为更复杂或伸展手指的快捷键提供替代方案是简单快捷的。它不一定是所有的快捷键，但是对于常用的两只手更舒服的快捷键，可以考虑增加单手快捷键。\n就这样。不要太花哨也不要太技术性。如果不确定键盘快捷键是否符合这些指导原则，只需用一只手试试！想象一下，每次需要快捷方式…时都必须这样做。您很快就会知道它是否可以访问。", "note_en": "You know what really sucks? Breaking bones. I’d been watching too many mountain biking videos on YouTube and after the first jump on a ride at my local bike trails, I came to realise that my enthusiasm and confidence far outweighed my skill. After over-jumping the jump, hitting a tree, flying over the bars and landing directly on my left shoulder 4 metres down the trail, I now have a broken clavicle (collar bone).\n Living in the UK, we have public health care, so my brother drove me straight to Accident and Emergency. An x-ray soon confirmed that I’d snapped my collar bone in two, but apparently there’s not very much to be done. They gave me a sling, told me I’d need to take some pain killers for a few days, and booked me in at the fracture clinic for the following day. At the fracture clinic I go through the x-rays with a specialist doctor while he tells me about the next ten weeks of my life are going to be like. At this point I can barely move my arm. My shoulder’s the size of a water melon and turning yellow. Ten weeks like this. Shit.\n I work as a software developer. Mainly ASP.NET and C# stuff. This means I live in Visual Studio… all day, everyday. Have you ever tried to work in VS one handed? Give it a try. It can be done but it’s not easy. One of the hardest things are keyboard shortcuts. Alt+Enter especially. I’ve got big hands, but even I struggle with that one using only my right hand. Luckily most functionality is available through context menus or through other parts of the UI.\n A fantastic thing about VS is that nearly all keyboard shortcuts are remappable. I’d never thought of this as an accessibility feature before, but it really is. I’ve resisted changing anymore keyboard shortcuts than strictly necessary, as I’m intending to start using both arms again one day, but it’s fantastic that this is available in a tool that I rely on to work and pay the bills.\n The majority of my work as a developer is web based, so when considering accessibility I tend to think about making things accessible for those with visual impairments; the blind and the partially sighted. Ensuring that the site works with screen readers and making sure controls and text have sufficient size and contrast is where a lot of accessibility effort is generally focused. There’s also things like not making tap targets not too close together, which is as much a mobile friendliness consideration as an accessibility consideration.\n As most of my work is for the web, I don’t develop very many piece of software that utilise keyboard shortcuts extensively. If any of my future work does incorporate keyboard shortcuts, I’m certainly going to be considering how people with physical restrictions will be able to use them.\n I don’t know what the “official” guidelines for keyboard shortcut accessibility are (or whether there are any guidelines!), but during the last few weeks of convalescence I’ve thought about the guidelines that I’d appreciate.\n  Single handed shortcuts: Prefer shortcut keys that can be reached with a single hand. Most shortcuts are comprised of a modifier key (Shift, Alt, Ctrl, Win, Cmd) along with another “normal” key. Try to keep the “normal” key within reasonable reach of the modifier. Shift and Ctrl  usually have keys on both sides of the keyboard, so more keys can be paired with these. Note that although Alt appears on both sides of the space bar, the right hand key is AltGr. They are actually two different keys, so keep that in mind when mapping shortcuts.\n  Remappable: It’s not always reasonable to make all the default keyboard shortcuts single-handed. It’s also likely that for able bodied users, some single handed shortcuts may actually be less comfortable or convenient than shortcuts that require both hands. That’s fine, and it’s a good idea to cater to your primary demographic. It’s also a good idea to allow users to remap these shortcuts. It’s not simply an accessibility feature, it’s great for the types that love to customise everything.\n  Provide alternatives: Providing an interface to allow users to remap their keyboard shortcuts isn’t always feasible. Maybe there’s no budget, or the scope of the project simply doesn’t allow for it. In these cases it’s simple and quick to provide alternatives to more complex or finger-stretching shortcuts. It doesn’t have to be every shortcut, but for commonly used shortcuts that are more comfortable with two hands, consider adding single-handed alternatives.\n That’s it. Nothing fancy or too technical. If in doubt about whether a keyboard shortcut complies with these guidelines, just try it with one hand! Imagine having to do that every time you require that shortcut… you’ll soon figure out whether it’s accessible or not.", "posttime": "2020-07-27 22:46:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "锁骨,accessibility,快捷键", "title": "用折断的锁骨欣赏平易近人", "title_en": "Appreciating accessibility with a broken collar bone", "transed": 1, "url": "https://erresen.github.io/csharp/dotnet/accessibility/shortcuts/visualstudio/2020/07/26/appreciating-accessibility.html", "via": "", "real_tags": ["锁骨", "快捷键"]}, {"category": "", "categoryclass": "", "imagename": "d879870f551800a806e3e1376030a309.jpg", "infoid": 1014420, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我在日本住了快十二年了，我还不习惯这个可怕的夏天。在高温和令人窒息的湿度之间，在7月和8月走进户外，感觉就像在一个副视频锅里慢慢煮熟一样。随着似乎没完没了的雨季即将结束，我不需要太多的鼓励就可以呆在家里。\n我认为我对日本夏日的看法并不特别特别，这可能就是为什么索尼决定在其首架internal-startup-incubator-slash-crowdfunding-platform.航班上推出Reon Pocket的原因。First Flight之前已经推出了FES E Ink手表、Huis智能家居通用遥控器和Wena手腕模块化智能手表等产品。现在我们有了Reon Pocket，只能用可穿戴空调来形容，我一直在测试它。\nReon Pocket是一款相当薄的手掌大小的白色塑料设备，通过USB-C充电，并通过蓝牙连接到您的iOS或Android手机。它看起来绝对像是索尼的小玩意儿。背部有一个硅胶衬垫，你可以按在皮肤上，Reon Pocket利用帕尔蒂埃效应通过吸收和释放热量来冷却或加热自己。你可以用手持设备，但最广泛推广的使用案例包括购买索尼的特殊V领背心，在内侧背部有一个口袋，让设备放在肩胛骨之间。\n这款应用非常简单，可以让你直接控制Reon Pocket的温度设置。有三个级别的冷却或变暖，加上一个额外的增压模式，限制在两分钟内，并控制“风扇”的速度。你还可以设置自动模式，每当你用自己的电源按钮而不是使用应用程序打开设备时，自动模式就会启动。充电一次可持续约2-3小时，具体取决于您的设置强度。\n这款设备只有80克重，所以除了降温和保暖效果外，当你把它穿在汗衫里时，它并不会真的感觉到什么，而且它不会在另一层衣服下面突出出来。然而，一旦汗衫穿上就有点尴尬-你需要把它放进口袋里，这是很难做到的，因为你的手放在背后很难做到这一点。也许随着练习会变得容易些。\n那么，它是怎么工作的呢？索尼的营销表明，它可以将你的身体表面温度降低13摄氏度，例如从36摄氏度(96华氏度)到23摄氏度(73.4华氏度)。我可以相信在接触点的情况是这样的，但正如索尼自己的图片所显示的那样，这种影响在整个身体显然没有那么明显。\n今天我戴着Reon Pocket去一英里外的一家超市吃午饭。气温只有30摄氏度(86华氏度)，所以我们还没有完全进入东京夏天的秋千，但湿度达到了80%-这仍然是那种通常很快就会把我弄得汗流浃背的散步。我确实发现，一般说来，Reon Pocket改进了一些问题，即使是在最低的冷却设置下也是如此。当我回到家的时候，我肯定还在流汗，但是当你真的在外面炎热的时候，凉爽的感觉确实会有所不同。\n基本上，Reon Pocket做的就是任何冰冷的小物体拿在皮肤上时会做的事情。你仍然会觉得自己处在一个炎热、汗流浃背的环境中，但你会拿到你能拿到的东西。\n对我个人来说，我不确定每周轮换一次设备专属的索尼背心的麻烦是否值得。但我已经在家工作了近十年，2020年的夏季服装几乎全是多伦多猛龙T恤。如果我的工作涉及日常通勤和职业装，就像日本各地数千万人的情况一样，我认为Reon Pocket可能更有意义。事实上，我可能只会把它当做一个袖珍小玩意儿，在必要时充当局部的冷暖器。\nReon Pocket目前仅在日本发售。这款设备本身的售价为13000日元(122美元)，内衣(有白色和米色可供选择)每件售价1800日元(17美元)。如果你想进口，这个应用程序可以用英文。", "note_en": "I’ve lived in Japan for nearly twelve years, and I’m still not used to the awful summers. Between the high temperatures and suffocating humidity, stepping outside in July and August feels like being slowly cooked in a sous vide pot. As a seemingly interminable rainy season comes to an end, I’m not going to need much encouragement to stay home.\n I don’t think my opinion on Japanese summers is particularly unusual, which is probably why Sony decided to go ahead with the Reon Pocket through its First Flight internal-startup-incubator-slash-crowdfunding-platform. First Flight has previously led to products like the  FES E Ink watch, the  Huis smart home universal remote, and the  Wena Wrist modular smartwatch. Now we have the Reon Pocket, which can only be described as a wearable air conditioner, and I’ve been testing it out.\n The Reon Pocket is a fairly slim palm-sized white plastic device that charges over USB-C and connects to your iOS or Android phone with Bluetooth. It definitely looks like a Sony gadget. There’s a silicone pad on the back that you can press against your skin, and the Reon Pocket uses the  Peltier effect to cool or warm itself up by absorbing and releasing heat. You can use it handheld, but the most widely promoted use cases involves buying Sony’s special V-neck undershirts with a pocket on the inner back to keep the device resting between your shoulder blades.\n   The app is pretty simple and gives you direct control over the Reon Pocket’s temperature settings. There are three levels of cooling or warming, plus an additional boost mode that’s limited to two minutes and a control for the speed of the “fan.” You can also set automatic modes that kick in whenever you turn the device on with its own power button rather than using the app. It lasts around 2-3 hours on a charge, depending on the intensity of your settings.\n The device only weighs about 80 grams, so beyond the cooling and warming effects it doesn’t really feel noticeable when you’re wearing it in the undershirt, and it doesn’t stick out beneath another layer of clothing. It is, however, a little awkward to insert it once the undershirt is on — you need to get a good fit in the pocket, which is hard to do with your hands behind your back. Maybe it gets easier with practice.\n So, how does it work? Sony’s marketing suggests that it can reduce your body surface temperature by 13°C, for example from 36°C (96°F) to 23°C (73.4°F). I can believe that that’s the case at the point of contact, but the effect is clearly much less pronounced across the whole body, as Sony’s own pictures show.\n   I wore the Reon Pocket while walking to a supermarket about a mile away for lunch today. The temperature was only 30°C (86°F), so we’re not quite into the swing of a Tokyo summer just yet, but the humidity was pushing 80 percent — this is still the kind of walk that would normally turn me into a puddle of sweat soon enough. I did find, generally, that the Reon Pocket improved matters somewhat, even on its lowest cooling setting. I was definitely still sweating by the time I got home, but the cooling sensation does make a difference while you’re actually out there in the heat.\n Basically, the Reon Pocket does what you’d expect any small, cold object to do when held against your skin. You’re still going to feel like you’re in a hot, sweaty environment, but you’ll take what you can get.\n   For me personally, I’m not sure the hassle of dealing with a weekly rotation of device-exclusive Sony undershirts would be worth it. But I’m in a position where I’ve been working from home for nearly a decade and my 2020 summer wardrobe consists almost exclusively of Toronto Raptors t-shirts. If I worked a job that involved a daily commute and business clothing, as is the case for tens of millions of people across Japan, I think the Reon Pocket could make more sense. As it is, I’d probably just use it as a pocket gadget that can act as a localized cooler or warmer in a pinch.\n The Reon Pocket is  out now exclusively in Japan. It costs 13,000 yen ($122) for the device itself, and the undershirts (available in white or beige) are 1,800 yen ($17) each. The app does work in English, if you’re looking to import.", "posttime": "2020-07-27 22:46:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "索尼,wearable,pocket", "title": "索尼的穿戴式空调相当酷", "title_en": "Sony’s wearable air conditioner is pretty cool", "transed": 1, "url": "https://www.theverge.com/2020/7/22/21333837/sony-reon-pocket-hands-on-wearable-air-conditioner-japan", "via": "", "real_tags": ["索尼", "wearable", "pocket"]}, {"category": "", "categoryclass": "", "imagename": "0e5959d65ee6fbb389da2e8f9dc5f268.png", "infoid": 1014419, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "音频深度伪造是商业妥协计划的新前沿，并正成为犯罪分子欺骗性获得公司资金的更常见途径。Nisos最近调查并获得了一种原始的企图深度假合成音频，该合成音频用于针对一家科技公司的欺诈企图。深度假的形式是该公司据称的首席执行官发来的语音信箱信息，要求一名员工回电“敲定一笔紧急的商业交易”。收件人立即认为可疑，没有联系这个号码，而是将其转给了他们的法律部门，结果攻击没有成功。\nNisos调查了潜在攻击者使用的电话号码，并确定这是一项没有所有者注册信息的VOIP服务。它很可能只是被简单地收购并用作这次诈骗企图的“燃烧器”。虽然没有与该号码关联的实际语音信箱消息，但出于法律原因，我们没有尝试与该电话号码的所有者进行实时联系。\nNisos使用名为Spectrum3d的音频谱图工具分析了深度伪造的语音邮件音频记录。为了发现任何异常，我们立即注意到谱图中的高点反复出现(见下图)。我们最初怀疑深度假冒的创建者使用多个通道上播放的音频来帮助掩盖声音。\n图1：深伪音频的频谱分析，显示了音高和音调的主要不一致。\n此外，我们还注意到音频非常不稳定，与类似的人类语音记录不一致。当我们改变音频速度并以1.2速度播放时，音频听起来更像是标准的文本到语音系统。最有趣的是，当我们放大声音以检测任何背景噪音时，我们找不到任何痕迹，这进一步表明这是被操纵的音频。\n然后，我们将深伪语谱图分析结果与一段类似录音中的正常人声结果进行了比较。我们可以立即看到音调和音调是如何更加平滑的，以及检测微弱背景噪音的能力。\n图2：“正常”人类声音的语谱图分析，显示出更一致的音调和语调。\n我们无法确定用于创建此深度伪的确切软件或语音模型，因为我们需要访问攻击者其他深度伪音频文件的足够大的样本(我们可能需要数十(如果不是数百)个文件，这假设攻击者制作的不仅仅是这个文件)。然而，我们注意到演员必须克服几个复杂的因素，才能创造出更真实的深度假音频：\n在实际情况下(通话的音调、背景噪音和通话原因)安排音频传送呼叫，在这种情况下，该人员不会觉得需要回电。\n上述场景中的攻击者很可能利用了大多数手机/VOIP服务提供商提供的功能，即绕过振铃选项并使用`#`键直接进入语音邮件的能力。\n深度假合成音频技术在刑事欺诈中最著名的使用是2019年9月发生的一起涉及一家英国能源公司的事件。据报道，犯罪分子使用模仿语音的软件模仿这位英国高管的演讲，并欺骗他的下属将数十万美元汇到一个秘密账户。\n这家公司的总经理相信他的老板在打电话，于是奉命将超过24万美元电汇到匈牙利的一个账户。1个。\n赛门铁克(Symantec)安全研究人员在2月份报告了三起针对私人公司的音频深度假冒案件，通过冒充该公司首席执行官的声音。据报道，犯罪分子从电话会议、YouTube、社交媒体更新甚至TED演讲中获得的音频中训练机器学习引擎，模仿公司老板的声音模式。\n他们制作了复制CEO声音的音频深度假，并打电话给财务部门的高级成员，要求紧急发送资金。没有关于这些是哪些公司的额外报道，这些技术是否成功，或者赛门铁克是否能够自己获得深度假货的录音。\n如果没有对音频的实际数字捕获和额外的取证分析，目前还不清楚这些尝试是否真的是深度伪造的合成操纵音频。无论如何，产生合成音频的能力扩展了电子罪犯的工具箱，罪犯最终仍然必须有效地使用社会工程策略来诱使某人采取行动。\n罪犯和潜在的更广泛的民族国家行为者也相互学习，所以随着这些备受瞩目的案件获得更多的恶名和成功，我们预计会有更多的非法行为者审判它们，并向其他铺平道路的人学习。\n此外，随着深度假货变得更容易制作或购买，以及音频(和视频)合成操作的质量提高，我们预计这些电子犯罪利用会得到更广泛的部署。如果诈骗行动需要使用完全伪造的视频或音频才能产生最大影响，而且它值得花费金钱和资源，就会使用它。然而，Nisos的研究人员还没有看到将这种类型的深伪轻松外包给单个人或大规模生产的能力。\n我们的研究人员联系了几个深度虚假的渠道，在那里我们询问了这种类型的攻击媒介，参与者不确定这样的事情在不久的将来是否可能发生。音频深度伪造的中心问题不仅与捕捉人的语气有关，还与捕捉特定的言语举止有关。然而，未来的场景可能会成为现实，类似于Yandex反向图像搜索(但针对语音)的工具可以用来收集大量样本，然后建立和训练一个模型，帮助将源语音转换为目标语音。\n如果员工在语音信箱(或任何音频)指示中感觉到可疑情况，他们可以采取的最直接行动是直接使用已知号码回电，并让他们接通电话。\n深伪技术还不够复杂，不足以模仿与某人的整个电话通话。此外，该公司还可以使用不为公众所知的信息或演员无法轻易回答的谈话要点，进行一系列“挑战性问题”，以审查在线个人的身份。\n这一诈骗计划是一种商业电子邮件泄露(更复杂、更人工智能开发的版本)，通常攻击者会假扮成一家公司的高级管理人员，让更容易受到影响的“较低级别”员工向银行账户汇款。\n我们预计，深度伪造的音频将是一系列社会工程尝试的第一步，目的是让员工将钱电汇到特定地点。钓鱼电子邮件、额外的电话，甚至声称授权采取行动的深度虚假视频，都可能被用来进一步推进犯罪计划。\n深伪音频也可能用于上述所列原因之外的其他原因。例如，犯罪分子可以留下虚假信息，指示员工提供对公司的网络或物理访问，从而允许攻击者轻松危害公司的网络或物理资产。\n这项新兴但迅速崛起的技术的出现突显了公司必须开发包含这些措施的安全实践的紧迫性。任何时候发生不寻常的事件，当然当涉及大型金融交易时，员工都应该接受培训，向高级管理人员提出挑战性问题。", "note_en": "Audio deepfakes are the new frontier for business compromise schemes and are becoming more common pathways for criminals to deceptively gain access to corporate funds. Nisos recently investigated and obtained an original attempted deepfake synthetic audio used in a fraud attempt against a technology company. The deepfake took the form of a voicemail message from the company’s purported CEO, asking an employee to call back to “finalize an urgent business deal.” The recipient immediately thought it suspicious and did not contact the number, instead referring it to their legal department, and as a result the attack was not successful.\n Nisos investigated the phone number the would-be attacker used and determined it was a VOIP service with no owner registration information. It was likely simply acquired and used as a “burner” for this fraud attempt only. While there was no actual voicemail message associated with the number, we made no attempt for live contact with the owner of the phone number for legal reasons.\n   Nisos analyzed the deepfake voicemail audio recording with an audio spectrogram tool called Spectrum3d. Looking to detect any anomalies, we immediately noticed the highs spiking repeatedly in the spectrogram (see graphic below). We initially suspected the deepfake creator used audio playing over on multiple channels to help mask the voice.\n Graphic 1: Spectrogram analysis of the deepfake audio, displaying major inconsistencies in pitch and tone.\n We additionally noticed the audio was very choppy and not consistent with a similar human voice recording. When we altered the audio speed and played back at 1.2 speed, the audio then sounded more like a standard text to speech system. Most interesting, when we amplified the sound to detect any background noise we were unable to find any traces, which further indicated this was manipulated audio.\n We then compared the deepfake spectrogram analysis with results of a &#34;normal&#34; human voice on a similar recording. We can immediately see how the pitch and tone is more smoothed out, as well as the ability to detect faint background noise.\n Graphic 2: Spectrogram analysis of ‘normal’ human voice, displaying more consistent pitch and tone.\n We were unable to determine the exact software or voice model used to create this deepfake as we would have required access to a large enough sample of the attacker’s other deepfake audio files (we would likely need tens if not hundreds of files, and this assumes the attacker made more than just this one). However, we note several complicating factors an actor would have to overcome to create a more realistic deepfake audio:\n Staging the call for audio delivering in a realistic scenario (tone of the person talking, background noise and reason for the call) in which the person wouldn’t feel the need to call the person back.\n It is likely the attacker in this scenario above utilized a feature most cell/VOIP service providers offer, which is the ability to bypass the ring option and go straight into the voice mail using the `#` key.\n   The most famous use of deep fake synthetic audio technology in criminal fraud was a September 2019 incident involving a British energy company. The criminals reportedly used voice-mimicking software to imitate the British executive’s speech and trick his subordinate into sending hundreds of thousands of dollars to a secret account.\n The managing director of this company, believing his boss was on the phone, followed orders to wire more than $240,000 to an account in Hungary. 1\n Symantec security researchers reported in February on three cases of audio deepfakes used against private companies by impersonating the voice of the business’s CEO. 2 The criminals reportedly trained machine learning engines from audio obtained on conference calls, YouTube, social media updates and even TED talks, to copy the voice patterns of company bosses.\n They created audio deepfakes replicating the CEO’s voice and called senior members of the finance department to ask for funds to be sent urgently. There was no additional reporting on which companies these were, whether the techniques were successful, or whether Symantec was able to obtain recordings of the deepfakes themselves.\n Without actual digital capture of the audio, and additional forensics analysis, it is unclear whether these attempts were in fact deepfake synthetic manipulated audio. Regardless, the ability to generate synthetic audio extends an e-criminal’s toolkit and the criminal at the end of the day still has to effectively use social engineering tactics to induce someone into taking an action.\n Criminals and potentially broader nation state actors also learn from each other, so as these high-profile cases gain more notoriety and success, we anticipate more illicit actors trying them and learning from others who have paved the way.\n Additionally, as deepfakes become easier to create or purchase, and the quality of synthetic manipulation -both audio (and video)- increases, we anticipate wider deployment of these e-crime exploits. If a fraud operation requires the use of a completely fake doctored video or audio for maximum impact, and it is worth the money and resources, it will be used. However, Nisos researchers have not seen the ability to easily outsource this type of deepfake for single individual or mass production.\n Our researchers have contact with a few deepfake channels where we asked about this type of attack vector and participants were unsure something like this would be possible in the near future. The central issue with audio deepfakes has to do with capturing not only the person’s tone but also specific speech mannerisms. Future scenarios will likely materialize, however, where tools similar to a Yandex reverse image search (but for voice) could be used to gather numerous samples and then build and train a model that could help convert the source voice into the target voice.\n   The most immediate action an employee can take, if they sense something suspicious in a voicemail (or any audio) instruction, is to call the person back directly using a known number and get them on the line.\n Deepfake technology is not sophisticated enough to mimic an entire phone call with someone. Additionally, the company can exercise a series of ‘challenge questions’ using information that is not publicly known or conversation points that an actor could not readily answer, to vet the identity of the individual on the line.\n This fraud scheme is a form of a business email compromise (a more sophisticated and AI-developed version) where typically the attacker will pretend to be a senior executive at a company and get a more susceptible ‘lower-level’ employee to send money to a bank account.\n We would anticipate a deepfake audio would be the first step in a series of social engineering attempts to get an employee to wire money to a specific location. Phishing emails, additional phone calls, or even deepfake videos purporting to authorize an action could be used in furtherance of the criminal scheme.\n Deepfake audio may also be used for reasons ancillary to the ones listed above. For example, criminals can leave fake messages instructing employees to provide network or physical access to the company, allowing attackers to easily compromise the network or physical assets of the company.\n The availability of this nascent but rapidly-emerging technology emphasizes the criticality with which companies must develop security practices that encompass these measures. Any time an unusual incident occurs, and certainly when large financial transactions are involved, employees should be trained to ask challenge questions to senior executives.", "posttime": "2020-07-27 22:45:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "音频,synthetic", "title": "合成音频Deepfakes的兴起", "title_en": "The Rise of Synthetic Audio Deepfakes", "transed": 1, "url": "https://www.nisos.com/white-papers/rise_synthetic_audio_deepfakes", "via": "", "real_tags": ["音频", "synthetic"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014418, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这将是一个基于结构化正则表达式和USAM实验的UNIX shell。", "note_en": "This is going to be a UNIX shell based around  Structural Regular Expressions and the  usam experiment.", "posttime": "2020-07-27 22:44:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,shell,正则表达式", "title": "怪异的Shell-结构正则表达式Unix Shell生锈", "title_en": "Weird Shell – Structural Regular Expressions Unix Shell Made in Rust", "transed": 1, "url": "https://git.sr.ht/~tudor/rwsh", "via": "", "real_tags": ["rust", "shell", "正则表达式"]}, {"category": "", "categoryclass": "", "imagename": "e6d32a0fbf5f47feda8d01e6f5cd8cb6.jpg", "infoid": 1014417, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，尖端窃听技术的清单稳步增长：窃听、窃听电话、墙上的窃听器-甚至从建筑物的玻璃上弹射激光来窃听里面的对话。现在添加另一个用于音频间谍的工具：房间里从窗户可以看到的任何灯泡。\n以色列内盖夫本古里安大学和魏茨曼科学研究所的研究人员今天公布了一项新的远程窃听技术，他们称之为喇叭。他们说，只要有一台笔记本电脑和不到1000美元的设备--只需一台望远镜和一个400美元的光电传感器--任何人都可以通过观察这些微小的振动，实时监听数百英尺外的房间里的任何声音。通过测量这些振动引起的灯泡光输出的微小变化，研究人员表明，间谍可以获得足够清晰的声音，足以辨别对话的内容，甚至可以识别一段音乐。\n本·纳西(Ben Nassi)说，房间里的任何声音都可以从房间里恢复出来，不需要侵入房间里的任何东西，也不需要侵入房间里的任何设备。本·纳西是本-古里安公司的安全研究员，他与同事雅伦·皮鲁廷(Yaron Pirutin)和鲍里斯·扎多夫(Boris Zadov)共同开发了这项技术，并计划在8月份的黑帽安全会议上公布他们的发现。你只需要把一个悬挂的灯泡对准视线，就是这个。\n在他们的实验中，研究人员在距离目标办公室灯泡约80英尺的地方放置了一系列望远镜，并将每个望远镜的目镜放在Thorlabs PDA100A2光电传感器的前面。然后，他们使用模数转换器将来自该传感器的电信号转换为数字信息。当他们在遥远的房间里播放音乐和语音录音时，他们将他们的设置收集的信息输入笔记本电脑，笔记本电脑分析读数。\n研究人员发现，灯泡对声音的微小振动-他们测量到的移动幅度只有几百微米-登记为他们的传感器通过每个望远镜接收到的光的可测量变化。在通过软件处理信号以滤除噪音后，他们能够以惊人的保真度重建房间内的声音录音：例如，他们展示了，他们可以足够好地再现唐纳德·特朗普(Donald Trump)总统的一段演讲的可听片段，足以被谷歌的云语音API(Cloud Speech API)转录。他们还制作了一张甲壳虫乐队的录音，让它足够清晰，以至于名字调子应用Shazam可以立即识别出来。\n尽管如此，这项技术还是有一些局限性。在他们的测试中，研究人员使用了一个悬挂的灯泡，目前还不清楚安装在固定灯或天花板灯具上的灯泡是否会振动到足以产生相同类型的音频信号。他们在演示中使用的语音和音乐录音也比普通人类对话的声音更大，演讲者将音量调到了最大。但研究小组指出，他们也使用了相对便宜的光电传感器和模数转换器，本来可以升级到更昂贵的，以获得更安静的对话。LED灯泡的信噪比大约是白炽灯泡的6.3倍，是荧光灯的70倍。\n尽管有这些警告，斯坦福大学的计算机科学家和密码学家丹·博内赫(Dan Boneh)认为，研究人员的技术仍然代表着一种重要的、具有潜在实用价值的新形式，他称之为旁路攻击--一种利用无意中的信息泄露来窃取机密的攻击。Boneh说，这是侧向通道的一种很好的应用。即使这需要一个悬挂的灯泡和高分贝，它仍然是超级有趣的。这仍然是第一次证明这是可能的。攻击只会变得更好，未来的研究只会随着时间的推移而改进这一点。\n在北卡罗来纳州立大学的尤瓦尔·埃洛维奇(Yuval Elovici)和无处不在的RSA加密系统的共同发明人阿迪·沙米尔(Adi Shamir)的建议下，该研究小组并不是第一个证明意外的声波现象可以导致窃听的人。研究人员多年来一直知道，激光从目标的窗户上反弹可以让间谍接收到里面的声音。2014年，另一组研究人员表明，即使恶意软件无法访问智能手机的麦克风，受攻击智能手机的陀螺仪也可以接收到声音。之前最接近Lamphone的技术是麻省理工学院、微软和Adobe的研究人员在2014年所说的视觉麦克风：通过分析通过望远镜拍摄的视频，房间里的一个物体会产生振动，比如一袋薯片或一株室内植物，这些研究人员能够重建语音和音乐。这项技术在2014年被麻省理工学院(MIT)、微软(Microsoft)和Adobe的研究人员称为视觉麦克风：通过分析通过望远镜拍摄的视频，房间里的物体会产生振动，比如一袋薯片或一株室内植物。\n但纳西指出，这项基于视频的技术虽然用途更广，因为它不需要在房间里看到灯泡，但它需要在录制视频后使用软件对其进行分析，以便将在物体上观察到的微妙振动转换为它所拾取的声音。相比之下，Lamphone可以实现实时间谍活动。由于振动物体本身就是光源，光电传感器可以用简单得多的视觉数据来捕捉振动。\n纳西认为，这可能会使喇叭在间谍活动中的使用比以前的技术更实用。他说，当你真正实时使用它时，你可以实时回应，而不是失去机会。\n尽管如此，纳西说，研究人员公布他们的发现并不是为了让间谍或执法部门受益，而是为了让监视双方都清楚地知道什么是可能的。他表示：我们希望提高人们对这种攻击媒介的认识。我们不是在玩提供工具的游戏。\n虽然不太可能成为这项技术的目标，但它也很容易预防。只需盖上任何悬挂的灯泡，或者更好的做法是，拉上窗帘。如果你疑神疑鬼地担心这类间谍游戏，希望你已经在那些窗户上安装了防震装置，以防止用激光麦克风窃听。并清扫了你的房子寻找窃听器。并从你的手机和电脑上取下了麦克风。毕竟，在一个连灯泡都有耳朵的时代，偏执狂的工作永远不会完成。\n不能出去抗议吗？以下是如何在家中提供帮助的方法。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🎧事情听起来不太对劲？查看我们最喜欢的无线耳机、音棒和蓝牙扬声器", "note_en": "The list of sophisticated eavesdropping techniques has grown steadily over years: wiretaps, hacked phones, bugs in the wall—even  bouncing lasers off of a building&#39;s glass to pick up conversations inside. Now add another tool for audio spies: Any light bulb in a room that might be visible from a window.\n Researchers from Israeli&#39;s Ben-Gurion University of the Negev and the Weizmann Institute of Science today revealed a new technique for long-distance eavesdropping they call &#34; lamphone.&#34; They say it allows anyone with a laptop and less than a thousand dollars of equipment—just a telescope and a $400 electro-optical sensor—to listen in on any sounds in a room that&#39;s hundreds of feet away in real-time, simply by observing the minuscule vibrations those sounds create on the glass surface of a light bulb inside. By measuring the tiny changes in light output from the bulb that those vibrations cause, the researchers show that a spy can pick up sound clearly enough to discern the contents of conversations or even recognize a piece of music.\n &#34;Any sound in the room can be recovered from the room with no requirement to hack anything and no device in the room,&#34; says Ben Nassi, a security researcher at Ben-Gurion who developed the technique with fellow researchers Yaron Pirutin and Boris Zadov, and who plans to present their findings at the Black Hat security conference in August. &#34;You just need line of sight to a hanging bulb, and this is it.&#34;\n  In their experiments, the researchers placed a series of telescopes around 80 feet away from a target office&#39;s light bulb, and put each telescope&#39;s eyepiece in front of a Thorlabs PDA100A2 electro-optical sensor. They then used an analog-to-digital converter to convert the electrical signals from that sensor to digital information. While they played music and speech recordings in the faraway room, they fed the information picked up by their set-up to a laptop, which analyzed the readings.\n   The researchers found that the tiny vibrations of the light bulb in response to sound—movements that they measured at as little as a few hundred microns—registered as a measurable changes in the light their sensor picked up through each telescope. After processing the signal through software to filter out noise, they were able to reconstruct recordings of the sounds inside the room with remarkable fidelity: They showed, for instance, that they could reproduce an audible snippet of a speech from President Donald Trump well enough for it to be transcribed by Google&#39;s Cloud Speech API. They also generated a recording of the Beatles&#39; &#34;Let It Be&#34; clear enough that the name-that-tune app Shazam could instantly recognize it.\n  The technique nonetheless has some limitations. In their tests, the researchers used a hanging bulb, and it&#39;s not clear if a bulb mounted in a fixed lamp or a ceiling fixture would vibrate enough to derive the same sort of audio signal. The voice and music recordings they used in their demonstrations were also louder than the average human conversation, with speakers turned to their maximum volume. But the team points out that they also used a relatively cheap electro-optical sensor and analog-to-digital converter, and could have upgraded to a more expensive one to pick up quieter conversations. LED bulbs also offer a signal-to-noise ratio that&#39;s about 6.3 times that of an incandescent bulb and 70 times a fluorescent one.\n  Regardless of those caveats, Stanford computer scientist and cryptographer Dan Boneh argues that the researchers&#39; technique still represents a significant and potentially practical new form of what he calls a &#34;side channel&#34; attack—one that takes advantage of unintended leakage of information to steal secrets. &#34;It&#39;s a beautiful application of side channels,&#34; Boneh says. &#34;Even if this requires a hanging bulb and high decibels, it’s still super interesting. And it’s still just the first time this has been shown to be possible. Attacks only get better, and future research will only improve this over time.&#34;\n  The research team, which was advised by BGU&#39;s Yuval Elovici and Adi Shamir, the coinventor of the ubiquitous RSA encryption system, isn&#39;t the first to show that unexpected sonic phenomena can enable eavesdropping. Researchers have known for years that a laser bounced off a target&#39;s window can allow spies to pick up the sounds inside. Another group of researchers showed in 2014 that the  gyroscope of a compromised smartphone can pick up sounds even if the malware can&#39;t access its microphone. The closest previous technique to lamphone is what MIT, Microsoft, and Adobe researchers in 2014 called a  &#34;visual microphone&#34;: By analyzing video recorded via telescope of an object in a room that picks up vibrations—a bag of potato chips or a houseplant, for instance—those researchers were able to reconstruct speech and music.\n  But Nassi points out that the video-based technique, while far more versatile since it doesn&#39;t require a bulb to be visible in the room, requires analysis of the video with software after it&#39;s recorded to convert the subtle vibrations observed in an object into the sounds it picked up. Lamphone, by contrast, enables real-time spying. Since the vibrating object is itself a light source, the electro-optical sensor can pick up vibrations in far simpler visual data.\n That could make lamphone significantly more practical for use in espionage than previous techniques, Nassi argues. &#34;When you actually use it in real time you can respond in real time rather than losing the opportunity,&#34; he says.\n  Still, Nassi says the researchers are publishing their findings not to enable spies or law enforcement, but to make clear to those on both sides of surveillance what&#39;s possible. &#34;We want to raise the awareness of this kind of attack vector,&#34; he says. &#34;We’re not in the game of providing tools.&#34;\n As unlikely as being targeted by this technique is, it&#39;s also easy to forestall. Just cover any hanging bulbs, or better yet, close the curtains. And if you&#39;re paranoid enough to be concerned about this sort of spy game, hopefully you&#39;ve already used  anti-vibration devices on those windows to prevent eavesdropping with a laser microphone. And  swept your house for bugs. And  removed the microphones from your phone and computer. After all, in an era when even the light bulbs have ears, a paranoiac&#39;s work is never done.\n   Can’t go out and protest?  Here’s how to help from home\n    👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🎧 Things not sounding right? Check out our favorite  wireless headphones,  soundbars, and  Bluetooth speakers", "posttime": "2020-07-27 22:43:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "通过观察,eavesdrop,灯泡", "title": "间谍可以通过观察灯泡的振动来窃听", "title_en": "Spies Can Eavesdrop by Watching a Light Bulb's Vibrations", "transed": 1, "url": "https://www.wired.com/story/lamphone-light-bulb-vibration-spying/", "via": "", "real_tags": ["通过观察", "eavesdrop", "灯泡"]}, {"category": "", "categoryclass": "", "imagename": "e66014ace81d57b6aa26d06460b07d05.jpg", "infoid": 1014416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "星期三应该是历史性的一天。Facebook、亚马逊、苹果和谷歌旗下Alphabet的首席执行官马克·扎克伯格(Mark Zuckerberg)、杰夫·贝佐斯(Jeff Bezos)、蒂姆·库克(Tim Cook)和桑达尔·皮查伊(Sundar Pichai)将出席众议院反垄断小组委员会的会议。听证会原定于周一举行，现已改至下午12点。美国东部时间，正如Axios在周六上午首次报道的那样。\n延误应归咎于日程安排冲突。周四宣布，已故民主党众议员、民权领袖约翰·刘易斯(John Lewis)将于周一在国会圆形大厅安葬。刘易斯上周死于胰腺癌。\n为我们的编辑订阅CNET Now时事通讯，精选当天最重要的新闻。\n经过几个月的筹备，反垄断听证会的目标是让科技界四位最有权势的首席执行官为垄断行为的指控辩护。在过去的一年里，这四家科技巨头都面临着立法者和监管机构的审查，就在不久前，他们对硅谷的看法要积极得多。现在，官员们对这些公司在市场上日益增长的主导地位表示担忧，这可能会压制竞争。\n众议院司法委员会主席杰罗尔德·纳德勒(Jerrold Nadler)和反垄断委员会主席大卫·西西林(David Cicilline)在一份联合声明中表示，自去年6月以来，该小组委员会一直在调查少数数字平台的主导地位，以及现有反垄断法和执法的充分性。考虑到这些公司在美国人的生活中扮演着核心角色，它们的首席执行官们的诚恳是至关重要的。正如我们从一开始就说过的那样，他们的证词对我们完成这项调查至关重要。\n在1月份的一次委员会听证会上，规模较小的科技公司抱怨科技巨头的不公平商业行为。Sonos首席执行官帕特里克·斯宾塞告诉立法者，谷歌试图限制他的公司的创新，并希望了解Sonos未来的产品计划。Sonos起诉谷歌，声称该公司窃取了其无线扬声器技术。PopSockets首席执行官大卫·巴尼特(David Barnett)抨击亚马逊忽视了他几个月来提出的关于假货的问题，恐吓他降低价格。\n斯宾塞说：这些公司中存在着如此强大的主导力量，即使是像我们这样规模的公司，你也会觉得别无选择。\n让所有四位首席执行官都出现在委员会面前的过程并不是没有戏剧性的。Cicilline在5月份威胁要传唤贝佐斯出席反垄断听证会，此前他向贝佐斯发出了一封公开公开信，要求他作证，贝佐斯同意在6月份出庭。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Wednesday should be a historic day.  Mark Zuckerberg,  Jeff Bezos,  Tim Cook and Sundar Pichai -- the CEOs of  Facebook,  Amazon, Apple and Google-owned Alphabet -- are   scheduled to sit before the House Judiciary Subcommittee on Antitrust. The hearing, which was  initially scheduled for Monday,  has been rescheduled for 12 p.m. ET, as Axios  first reported on Saturday morning.\n A scheduling conflict was to blame for the delay. The late John Lewis, a Democratic representative and civil rights leader who died last week of pancreatic cancer, will lie in state in the Capitol Rotunda on Monday,  it was announced on Thursday.\n  Subscribe to the CNET Now newsletter for our editors&#39; picks of the most important stories of the day.\n Months in the making, the antitrust hearing aims to have four of the most powerful CEOs in tech defend accusations of monopolistic behaviors. All four tech giants have faced scrutiny over the past year from lawmakers and regulators, who not too long ago looked at Silicon Valley in a far more positive light. Now officials are raising concerns about these companies&#39; growing dominance in the market, which could be squashing competition.\n &#34;Since last June, the subcommittee has been investigating the dominance of a small number of digital platforms and the adequacy of existing antitrust laws and enforcement,&#34; House Judiciary Committee Chairman Jerrold Nadler and Antitrust Subcommittee Chairman David Cicilline said in a joint statement. &#34;Given the central role these corporations play in the lives of the American people, it is critical that their CEOs are forthcoming. As we have said from the start, their testimony is essential for us to complete this investigation.&#34;\n During a   committee hearing in January, smaller tech firms complained about unfair business practices from the tech giants. Sonos CEO Patrick Spence told lawmakers that Google tried to restrict his company&#39;s innovations and wanted insights into Sonos&#39; future product plans. Sonos   sued Google, claiming the company stole its wireless speaker technology. David Barnett, CEO of PopSockets, blasted Amazon for ignoring issues about counterfeit that he&#39;d raised for months, bullying him to lower his prices.\n &#34;There&#39;s such a dominant power that exists with these companies that really even as a company of our size you feel like you have no choice,&#34; Spence said.\n The process of getting all four CEOs in front of the committee was not without drama. Cicilline in May threatened to   subpoena Bezos to appear at the antitrust hearing after sending an   open letter to Bezos calling for his testimony.  Bezos agreed to appear in June.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-07-27 22:14:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "库克,rust,贝佐斯,反垄断,bezos", "title": "扎克伯格、贝佐斯、库克和皮查伊反垄断听证会改期至周三", "title_en": "Zuckerberg, Bezos, Cook and Pichai antitrust hearing rescheduled for Wednesday", "transed": 1, "url": "https://www.cnet.com/news/zuckerberg-bezos-cook-and-pichai-antitrust-hearing-rescheduled-for-wednesday/", "via": "", "real_tags": ["库克", "rust", "贝佐斯", "反垄断", "bezos"]}, {"category": "", "categoryclass": "", "imagename": "d11ac2d67f3995fcba4e48f7a6a42b01.jpg", "infoid": 1014415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当然，野村做到了。最后的产品看起来和听起来都很棒；见鬼，就连盒子都很不错。如果我幸运的话，我每年都会看到一款消费性硬件产品，它似乎相当有能力颠覆一个行业，而野村的定制声音配置文件就符合这一要求。但这家公司之所以独一无二，还有另一个原因。作为Hax加速器的毕业生，这家创业公司大约在去年这个时候宣布了NuraNow。\n硬件即服务(Hardware as a Service，HAAS)在IT/企业领域是一个流行的概念已经有一段时间了，但在消费者类别中仍然相当少见。首先，硬件订阅提供了一种考虑购买的新范式。对于像美国这样的国家来说，这是一个巨大的提升，因为美国多年来一直在让消费者摆脱对合同型智能手机的依赖。\n野村欣然接受了这个机会，这并不令人大吃一惊。支持者HAX/SOSV是该模式的支持者已经有一段时间了。我去过他们在深圳的办事处几次，似乎总是提到哈斯的话题。\n在最近的一次电子邮件交流中，普通合伙人邓肯·特纳(Duncan Turner)将Haas描述为“与客户保持联系并向他们追加销售新功能的绝佳方式”。最重要的是，对于初创公司来说，经常性收入对于利用风险资本扩大业务规模至关重要(这将有助于吸引更广泛的投资者)。哈斯商学院的员工流失率通常很低(更容易签订长期合同)。", "note_en": "Nura managed, of course. And the final product looked and sounded great; hell, even the box was nice. If I’m lucky, I see a consumer hardware product once or twice a year that seems reasonably capable of disrupting an industry, and Nura’s custom sound profiles fit that bill. But the company was unique for another reason. A graduate of  the HAX accelerator, the startup announced NuraNow roughly this time last year.\n Hardware as a service (HaaS) has been a popular concept in the IT/enterprise space for some time, but it’s still fairly uncommon in the consumer category. For one thing: a hardware subscription presents a new paradigm for thinking about purchases. And that is a big lift in a country like the U.S., which spent years weaning consumers off contract-based smartphones.\n That Nura jumped at the chance shouldn’t be a big surprise. Backers HAX/SOSV have been proponents of the model for some time now. I’ve visited their Shenzhen offices a few times, and the topic of HaaS always seems to come up.\n In a recent email exchange, General Partner  Duncan Turner   described HaaS as “a great way to keep in contact with your customers and up sell them on new features. Most importantly, for start-ups, recurring revenue is critical for scaling a business with venture capital (and will help appeal to a broad set of investors). HaaS often has a low churn (as easier to put onto long-term contracts).”", "posttime": "2020-07-27 22:13:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "消费,startups,野村", "title": "\n风投和初创企业考虑将Haas模式用于消费设备", "title_en": "\n\t\t\t\tVCs and startups consider HaaS model for consumer devices\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/vcs-and-startups-consider-haas-model-for-consumer-devices/", "via": "", "real_tags": ["消费", "startups", "野村"]}, {"category": "", "categoryclass": "", "imagename": "d2e7d01c2da713e09d3ab0161254c969.jpg", "infoid": 1014414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity，在这里我们解开标题背后的数字。\n这是股票星期一，我们每周的开播节目追踪最新的重大新闻，谈论未来一周的情况，深入研究最近几轮融资，并考虑来自私人市场的更大的主题或叙事。你可以在推特上关注这部剧，我也可以在这里关注，别忘了看看上周五的那一集。\n标题：SAP正剥离部分Qualtrics，Dave泄露客户数据，亚洲市场涨跌互见美国共享开绿。密码和黄金同时上涨，标志着这一时刻是熔毁的。\n高通(Qualtrics)的消息是上周末拥堵事件中声音最大的一次，几年前，SAP收购了这家总部位于犹他州的科技巨头。即使在首次公开募股后，SAP也将保留多数股权，但该计划应该会给Qualtrics更大的自由，而SAP对其保留的小公司的股份也会有更好的估值。当然，这是如果剥离进展顺利的话。\n戴夫的泄密情况看起来很糟糕，他将测试更多新生的金融科技财产在遭受这种入侵时会发生什么。\n展望未来，这是一个巨大的收益周。我们将看到来自亚马逊、苹果、Alphabet、Facebook和其他公司的结果。\n最后，鉴于高股价给大公司提供了比以往任何时候更多的弹药，我们在公开市场上处于令人兴奋的领域。让我们看看在窗户关闭之前他们能做些什么。\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast where we unpack the numbers behind the headlines.\n This is Equity Monday, our weekly kickoff that tracks the latest big news, chats about the coming week, digs into some recent funding rounds and mulls over a larger theme or narrative from the private markets. You can follow the show on Twitter  here, and myself  here, and don’t forget to check out  last Friday’s episode.\n  Headlines: SAP is  spinning out part of Qualtrics, Dave  leaked customer data, Asian markets were mixed while US shared opened green. Cryptos and gold are up at the same time, marking the moment as a melt-up.\n The  Qualtrics news was the loudest note from the weekend’s jam, coming a few years after  SAP bought the Utah-based tech giant. SAP will retain a majority stake even after the debut, but the plan should give Qualtrics more freedom, and SAP a better valuation for the piece of the smaller company that it retains. That’s if the spin-out goes well, of course.\n Dave’s  leak looks bad, and will test what happens to more nascent fintech properties when they endure this sort of breach.\n Looking ahead, this is a  huge earnings week. We’ll see results from Amazon, Apple, Alphabet, Facebook, and others.\n Closing, we’re in exciting territory on the public markets given that high share prices are giving big companies more ammunition than ever. Let’s see what they can get done with it before the window closes.\n Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-07-27 22:13:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股票,星期一,monday,qualtrics", "title": "\n股票星期一：SAP，Qualtrics，哦，天哪，我们很兴奋", "title_en": "\n\t\t\t\tEquity Monday: SAP, Qualtrics, and oh boy are we excited\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/equity-monday-sap-qualtrics-and-oh-boy-are-we-excited/", "via": "", "real_tags": ["股票", "星期一", "monday", "qualtrics"]}, {"category": "", "categoryclass": "", "imagename": "e0a0463090a5596069c149d7681d639e.jpeg", "infoid": 1014411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旧金山-谷歌(Google)将让员工至少呆到明年7月，这将使这家搜索引擎巨头成为第一家在面对冠状病毒大流行时正式确定如此延长时间表的美国大公司。\n这一举措将影响谷歌母公司Alphabet Inc.约20万名全职和合同制员工的几乎所有人，并肯定会向其他已安排员工最快在明年1月返回的科技巨头施压。\n..。", "note_en": "SAN FRANCISCO—Google will keep its employees home until at least next July, making the search-engine giant the first major U.S. corporation to formalize such an extended timetable in the face of the coronavirus pandemic.\n  The move will affect nearly all of the roughly 200,000 full-time and contract employees across Google parent Alphabet Inc., and is sure to pressure other technology giants that have slated staff to return as soon as January.\n...", "posttime": "2020-07-27 22:03:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,coronavirus,冠状病毒,谷歌,病毒", "title": "在冠状病毒大流行期间，谷歌将把员工留在家里直到2021年夏天", "title_en": "Google to Keep Employees Home Until Summer 2021 Amid Coronavirus Pandemic", "transed": 1, "url": "https://www.wsj.com/articles/google-to-keep-employees-home-until-summer-2021-amid-coronavirus-pandemic-11595854201", "via": "", "real_tags": ["google", "冠状病毒", "谷歌", "病毒"]}]