[{"category": "", "categoryclass": "", "imagename": "a7f8d0b84ff3d3fca16977dd541367fa.png", "infoid": 1010077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "并不是所有的超级英雄都穿斗篷，但今年阿德里安·纽维已经决定穿上他的斗篷。\n红牛著名的设计天才决定给他2020年的赛车配上一级方程式赛车工程师所说的斗篷。\n这是在梅赛德斯的领导下进行的，梅赛德斯在2017年引入了这种空气动力学部件，至今仍在运行。\n追随梅赛德斯领跑的不仅仅是红牛。雷诺和赛点在2020年也都有新的或更新的斗篷。\n一支车队是选择了披肩，还是选择了替代设备，尽管不同，但设计的目的是相似的，这可能会对赛车的操控方式产生重大影响，并最终决定谁可能在今年的锦标赛上脱颖而出。\n我是神秘的空气动力学家。我在F1车队的设计部工作。我要解释一下F1赛车前部这些鲜为人知但却很关键的设备有什么重要之处。\n斗篷就是我们所说的位于汽车鼻子正下方的长而平的车身部分。\n那些没有披风的团队选择了所谓的风向标，这是因为它挂在鼻子下面的形状。J Vane解决方案的著名采用者是法拉利(Ferrari)和哈斯(Haas)，而该领域的其余公司都选择了这两款车型中的一小部分。\n这两个空气动力学装置执行的工作大致相似，但它们的工作方式有一些微妙之处，这可能会对汽车的操控和性能产生重大影响。\n这些装置之所以有趣，是因为它们构成了一个更大的气流系统的一部分，该系统旨在管理和操纵名为Y250涡流的东西，这可以说是过去十年F1赛车上的关键空气动力学现象。\n2009年，F1引入了旨在增加超车的规则。自那以后，这些规定已经做出了重大改变，包括让汽车变得更宽、更快。但有一个关键特征贯穿始终。\n规则规定，在离开赛车中心250 mm的第一个位置，前翼的空气动力学中立部分。除此之外，规则允许更多的自由，前翼的空气动力载荷更大。\n从中立部分切换到机翼的一部分，团队可以根据空气动力学效果塑造机翼的一部分，这意味着在这个250毫米的点上压力会有突然的变化。\n要想了解这里发生了什么，想想在空中向前行驶的汽车。或者，从汽车的角度来看，空气正向它袭来。\n空气击中机翼的中性中心部分和外部产生下压力的部分之间的过渡点，这将空气推入一个开瓶器，在一个小龙卷风般的特征中螺旋前进，我们称之为漩涡。这是250日元的漩涡，以与汽车中心线的距离命名。\n这个漩涡--在同一点从前翼两侧流出--非常强大，对前翼后面发生的几乎所有事情都有影响。\nY250涡旋开始与之相互作用的第一个特征之一是斗篷或J叶片，这取决于安装的是哪一个。\n现在，记住所有的空气都在绕着250日元的涡旋旋转。这是在车中间向下行驶的空气。\n这些空气撞击到斗篷或J叶片的边缘，并产生第二个漩涡，这次是以相反的方向旋转。\n这样做的原因是，它做的下一件事就是钻到地板下面。在这里，它会触发一些类似于连锁反应的东西。\n斗篷或J叶片产生的第二个涡流产生的低压力与车身的第二个区域相互作用-前轮后面和侧舱前面的区域中的小挥动和叶片，即司机坐着的两侧。这就是众所周知的驳板区域。\n这里的所有车身碎片现在都开始脱落它们自己的漩涡，每个漩涡也都在车底下面。它们一起产生巨大的下压力，通过加速汽车底部的空气并产生大量的低压，这会将汽车吸向赛道。\n就在好望角涡旋这样做的同时，我们的老朋友Y250涡旋正坐在船板脚的上方，通过前面提到的扇形和叶片向下推动空气。\n在这样做的过程中，它为这一区域的许多漩涡增加了动力，使它们旋转得更快，并产生了更大的下压力。\n然后，Y250继续向下游行驶，现在大部分能量都是从它身上提取的，并绕过了汽车的侧舱。\n与汽车后部的扩散器以及前翼和后翼一起，这一系列组合的涡流-由前翼的Y250涡流开始，并由好望角涡流增强，进而与斜板涡流相互作用-是汽车上产生下压力的主要区域之一，因此正确处理是至关重要的。\n这就是为什么赛车的这一部分有如此多的精心设计，因为每个车队都试图最大限度地利用可用的下压力。\n优化Y250和斗篷或J叶片涡流的强度和位置对于最大限度地利用汽车的这一部分至关重要。\n使它们尽可能坚固通常是有益的，这样它们就可以驱动地板前面产生下压力的结构。\n去年，我曾写过车队在前翼采用的不同方法--法拉利(Ferrari)和梅赛德斯(Mercedes)拥护的内侧负载方法和舷外负载的梅赛德斯(Mercedes)。但我们没有讨论的一个因素是这些因素对250日元涡旋强度的影响。\n内侧加载的前翼，比如法拉利，会夸大距离机翼中部250 mm的转换点的压力差异。\n这将加强250日元的漩涡，并可能是为什么大多数球队-即使是红牛和梅赛德斯-他们的前翼保留了略有不同的哲学-在一定程度上在本赛季朝着这个方向前进的原因之一。\n最重要的是，您需要平衡漩涡的强度，以便它们可以保持在最佳位置。\n如果Y250涡旋太强，它可能会将斗篷/J风叶涡拉出，远离挡板。如果Y250太弱，它可能会被拉到地板下，把扳手扔进我们微调的涡流系统的工作中。\n要创造一辆真正驾驭良好的汽车，涡流的一致定位是至关重要的。\n无论汽车是在侧风中行驶，还是在弯道上翻滚，还是在路缘上颠簸，重要的是每个涡流都要尽可能地靠近最佳位置。否则，赛车的下压力和抓地力将从一个角落改变到另一个角落，一圈又一圈。\n这是司机讨厌的一件事，因为这会影响他们对汽车性能的信心和信任，并使他们更难从汽车中获得最大利益。正是在这里，海角与J风向标的一些利弊开始显现。\n由于J叶片与机头相连的方式，它天生就有很多垂直的表面。\n这些都是很好的缓解侧风的影响，通过拉直气流，并使其与汽车前进的方向对齐。这有助于防止250日元的涡旋以这样或那样的方式被吹走，使其保持在同一地点。\n另一方面，斗篷可以更容易地进一步向前安装在鼻子上。通过尽可能靠近Y250涡旋最初形成的点，它能够更早地影响该涡旋的位置，在来不及拉回它之前阻止它漂移得太高或太宽。\n每种策略之间的差异是微妙的，当开始研究时，一种策略相对于另一种策略的优势可能不会立即明显。\n最好的解决方案只有在几个月甚至几年的开发之后才会变得明朗，而且对于不同的汽车很可能是不同的。\n我当然不会说知道哪辆车一定会给你最快的赛车。然而，今年围场的观点似乎确实倾向于海角。\n这将是令人着迷的，看看梅赛德斯，红牛，和其他斗篷十字军发现自己今年拥有比他们的J风向标运动对手更好的操控汽车。\n如果他们这样做了，预计在不太遥远的将来会看到一辆红色的车穿着斗篷抵达大奖赛。", "note_en": "Not all superheroes wear capes, but this year Adrian Newey has decided to don his.\n Red Bull&#39;s renowned design genius has decided to fit his 2020 car with what engineers in Formula 1 call a &#39;cape&#39;.\n This is following a lead by Mercedes, who introduced this aerodynamic component in 2017, and still run it today.\n And it&#39;s not just Red Bull following Mercedes&#39; lead, either. Renault and Racing Point both have new or updated capes in 2020, too.\n Whether a team has chosen to fit a cape - or alternative devices which, although different, are designed to do a similar job - could have significant consequences for the way cars handle and, ultimately, who might come out on top in this year&#39;s championship.\n I am the secret aerodynamicist. I work in the design department of an F1 team. And I&#39;m going to explain what&#39;s so important about these little-known but key devices at the front of F1 cars.\n    The &#39;cape&#39; is what we call the long flat piece of bodywork that is located just under the car&#39;s nose.\n Those teams who don&#39;t have a cape instead opt for what is known as a &#39;J vane&#39;, so called because of the shape it takes as it hangs under the nose. Notable adopters of the &#39;J vane&#39; solution are Ferrari and Haas, while the remainder of the field have gone for a little bit of both.\n These two aerodynamic devices perform a broadly similar job, but there are some subtleties in the way they work which could have significant consequences for the car&#39;s handling and performance.\n These devices are interesting because they form part of a larger air-flow system designed to manage and manipulate something called the y250 vortex, which is arguably the key aerodynamic phenomenon on F1 cars of the last decade.\n   In 2009, F1 introduced rules aimed at trying to increase overtaking. Significant changes have been made to the regulations since then, including making the cars wider and much faster. But one key feature has remained throughout.\n The rules designate an aerodynamically neutral section of the front wing for the first 250mm out from the centre of the car. Outboard of that, the rules allow more freedom and the front wings become more aerodynamically loaded.\n The switch from a neutral section into a part of the wing that teams can shape for aerodynamic effect means there is a sudden change of pressure at this 250mm point.\n To try to understand what&#39;s happening here, think about the car driving forwards through the air. Or, from the perspective of the car, the air is coming towards it.\n The air hits the transition point between the neutral central section of the wing and the downforce-creating parts outside it, and this sets the air off into a corkscrew, spiralling along in a little tornado-like feature which we call a vortex. This is the y250 vortex, named for the distance from the centre-line of the car at which it is created.\n This vortex - which streams off both sides of the front wing at the same point - is very powerful and has an effect on pretty much everything that happens behind the front wing.\n   One of the first features that the y250 vortex starts to interact with is either the cape, or the J vane, depending on which is fitted.\n Now, remember all the air is rotating around the y250 vortex. This is driving air downwards in the middle of the car.\n This air hits the edge of the cape or J vane and creates a second vortex, this time rotating in the opposite direction.\n  The reason for this is that the next thing it does is go under the floor. Here, it triggers something a bit like a chain reaction.\n The low pressure from this second vortex created by the cape or J vanes interacts with a second area of bodywork - the little flicks and vanes in the area behind the front wheels and ahead of the sidepods, either side of where the driver is sitting. This is known as the &#39;barge-board area&#39;\n All the pieces of bodywork here now start to shed their own vortices, each of which also goes under the floor of the car. Together, they generate an enormous amount of downforce, by speeding up the air under the car and creating a large amount of low pressure, which sucks the car towards the track.\n At the same time as the cape vortices are doing this, our old friend the y250 vortex is sitting up above the bargeboard foot, driving air downwards through the aforementioned flicks and vanes.\n In doing so, it adds power to the many vortices in this area, making them spin faster and creating even more downforce.\n The y250 then continues its journey downstream, much of the energy extracted from it now, and heads around the sidepods of the car.\n  Along with the diffuser at the rear of the car and the front and rear wings, this combined series of vortices - started by the y250 vortex at the front wing, and enhanced by the cape vortex, in turn interacting with the bargeboard vortices - is one of the major downforce generating areas on the car, so it is vital to get it right.\n This is why there is such a proliferation of elaborate designs in this part of the car, as each team tries to maximise the downforce available.\n   Optimising the strength and position of the y250 and the cape or J vane vortices is crucial to getting the most out of this part of the car.\n Making them as strong as possible is typically beneficial so that they can drive the downforce-generating structures at the front of the floor.\n Last year I wrote about the   different approaches teams had taken to front wings  - the &#39;inboard-loaded&#39; approach championed by Ferrari and the &#39;outboard-loaded&#39; of Mercedes. But one factor we didn&#39;t discuss was the effect of these on the y250 vortex strength.\n An inboard-loaded front wing, such as on the Ferrari, will exaggerate the difference in pressure at the transition point 250mm from the middle of the wing.\n This will strengthen the y250 vortex and could be a part of the reason why most teams - even Red Bull and Mercedes, whose front wings retain a slightly different philosophy - have headed in this direction to some degree for this season.\n On top of this, you need to balance the strength of the vortices so that they can remain in their optimal positions.\n If the y250 vortex is too strong, it can pull the cape/J vane vortex out, away from the bargeboards. If the y250 is too weak, it can get pulled down, under the floor, throwing a spanner into the works of our finely tuned vortex system.\n   To create a car that really handles well, consistent positioning of the vortices is vital.\n Regardless of whether the car is driving through crosswinds, rolling around corners, or bumping over kerbs, it is important that each vortex stays as close to the optimal position as possible. Otherwise, the amount of downforce, and hence grip, the car has will change from corner to corner, and lap to lap.\n This is one thing drivers hate because it affects their confidence and trust in what the car will do, and makes it harder for them to extract the most from the car. It is here that some of the pros and cons of the cape verses the J vane start to emerge.\n The J vane inherently has lots of vertical surfaces by virtue of the way it is attached to the nose.\n These are great at mitigating some of the effects of crosswinds by straightening out the airflow and aligning it with the direction in which the car is heading. This helps to prevent the y250 vortex from being blown one way or another, keeping it in the same spot.\n On the other hand, the cape can more easily be mounted further forwards on the nose. By being as close as possible to the point where the y250 vortex is first formed, it is able to influence the position of that vortex sooner, stopping it from drifting too high or too wide before it is too late to pull it back.\n The differences between each strategy are subtle and the advantage of one over the other may not be immediately obvious when starting research.\n The best solution will become clear only after months or even years of development and could well be different for different cars.\n I certainly wouldn&#39;t claim to know which one will definitely give you the fastest racing car. However, opinion in the paddock this year does appear to be leaning towards the cape.\n It will be fascinating to see whether Mercedes, Red Bull, and the other caped crusaders find themselves with better handling cars than their J vane-sporting rivals this year.\n If they do, expect to see a red car arriving at a grand prix wearing a cape in the not-too-distant future.", "posttime": "2020-07-06 16:06:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,空气,aerodynamicist,汽车", "title": "方程式1 2020：神秘的空气动力学家-斗篷是关键吗？", "title_en": "Formula 1 2020: The secret aerodynamicist – are capes the key?", "transed": 1, "url": "https://www.bbc.co.uk/sport/formula1/51739796", "via": "", "real_tags": ["2020", "空气", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "79727ce052cae77b8446596feb732cb5.jpg", "infoid": 1010076, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转搜索奇特星系地图集是Halton Arp在1966年制作的奇特星系目录。该地图集共有338个星系，最初由加州理工学院于1966年出版。该目录的主要目标是展示星系中发现的不同类型的特殊结构的例子的照片。[1]。\nARP意识到星系形成螺旋形或椭圆形的原因还不是很清楚。他认为特殊的星系是小实验，天文学家可以用它们来理解扭曲螺旋或椭圆星系的物理过程。有了这本地图集，天文学家就有了一个特殊星系的样本，他们可以对其进行更详细的研究。这本地图集并没有提供天空中每个特殊星系的完整概览，而是提供了在附近星系中观察到的不同现象的例子。\n因为在出版时人们对造成不同形状的物理过程知之甚少，所以地图集中的星系是根据它们的外观进行分类的。天体1-101是个别特殊的旋涡星系或明显有小伴星的旋涡星系。天体102-145是椭圆形和椭圆形的星系。既不是椭圆形也不是螺旋形的单个或一组星系被列为对象146-268。天体269-327是双星系。最后，简单地不适合上述任何类别的对象被列为对象332-338。大多数天体最为人所知的是它们的其他名称，但也有少数星系最为人所知的是它们的Arp数(如Arp 220)。\n今天，导致阿尔普地图集中所见奇特现象的物理过程被认为已经被很好地理解了。大量的天体被解释为相互作用的星系，包括M51(Arp 85)、Arp 220和触角星系(NGC 4038/NGC 4039或Arp 244)。有几个星系只是简单的矮小星系，它们没有足够的质量来产生足够的引力来使星系形成任何凝聚结构。NGC1569(Arp210)是地图集中一个矮小星系的例子。其他一些星系是射电星系。这些天体包含活跃的星系核，它们会产生强大的气体射流，称为射电射流。地图集包括附近的射电星系M87(Arp 152)和半人马座A(Arp 153)。\n星表中存在的许多特殊的星系团被解释为星系合并，尽管Arp驳斥了这一观点，相反，声称明显的星系团是抛射的主要例子。[2]他在《看见红色》(1998)中写道：\n对我来说，奇特星系地图集的全部教训是，星系通常是喷出的物质。合并的狂热似乎是基于粗略地看一眼星系而做出的第一个猜测。[.]。奇特星系地图集包含一类非常有趣的星系，叫做螺旋星系，在臂端有同伴(较小的星系)。他们是怎么到那里的？当然不是偶然的碰撞，也不是合并过程的开始，这是用来解释银河系外领域一切的流行说法。[2]。\n这些星系大多是矮小星系或定义不清的螺旋星系(命名为Sm)，它们的表面亮度较低(即单位面积发射的光很少)。低表面亮度的星系实际上是相当常见的。唯一的例外是NGC2857(Arp1)，它是一个SC旋涡星系(这意味着它有一个明确的结构，旋臂松散缠绕，有一个微弱但清晰的核心)。[3]。\n这一类包含旋臂看起来是分段的旋涡星系。一些旋臂部分可能看起来是分离的，因为旋臂上的尘埃带遮挡了旋臂的星光。由于螺旋臂中存在明亮的星团(或不连续的明亮星团链)，其他螺旋臂可能看起来是分段的。\n通常，大多数螺旋星系包含两个定义清晰的旋臂，或者它们只包含模糊的丝状螺旋结构。具有三个清晰旋臂的星系很少见。\n包括麦哲伦螺旋在内的单臂螺旋星系也很罕见。在这种情况下，单个旋臂实际上可能是由与另一个星系的引力相互作用形成的(就像大麦哲伦星云本身一样，尽管它不是星表的成员)。\n这些星系中的旋臂具有不对称的外观。一条螺旋臂可能看起来比另一条要亮得多。在Arp生产的照相底片上，明亮的手臂看起来会很暗或很重。虽然这些星系中的大多数(如M101和NGC6946)都是简单的不对称螺旋星系，但NGC6365是一对相互作用的星系，其中一个星系是侧视的，只是碰巧位于另一个面对面星系的螺旋臂可以看到的地方。[5]。\n这些星系看起来像一个伸展的S形(或者像微积分中使用的积分符号)。有些天体，如IC167，[6]只是普通的螺旋星系，从不寻常的角度观察。其他天体，如UGC10770，是相互作用的星系对，它们的潮汐尾巴看起来类似于螺旋臂。[7]。\n这些螺旋星系中的许多可能正在与视野中的低表面亮度星系相互作用。然而，在某些情况下，可能很难确定伴星是否在物理上靠近螺旋星系，或者伴星是前景/背景源还是位于螺旋星系边缘的源。\n同样，这些螺旋星系中的许多可能正在与伴生星系相互作用，尽管一些已识别的伴生星系可能是前景/背景源，甚至是单个星系中的明亮星团。\n这类星系几乎总是明显的相互作用源。其中最著名的是漩涡星系(M51；Arp85)，它由一个螺旋星系NGC5194与一个较小的椭圆星系NGC5195相互作用组成。这种相互作用扭曲了两个星系的形状；在更大的螺旋星系中，螺旋臂图案得到了增强，在两个星系之间形成了一座恒星和气体的桥梁。这类星系中的许多其他星系也通过桥梁相连。\n就像拥有高表面亮度伴星的螺旋星系一样，这些螺旋星系中的大多数都是明显相互作用的系统。在许多图像中都可以看到潮汐尾巴和桥梁。\n这些天体与有椭圆伴星的螺旋星系非常相似。所有的星系都有一些特征，比如潮汐尾巴和潮汐桥，它们都是通过引力相互作用形成的。\n根据对这些天体的描述，Arp最初似乎认为椭圆星系正在推开伴生星系中的旋臂。然而，由于相互作用，潮汐螺旋臂实际上可能看起来扭曲了。其中一些被排斥的旋臂位于旋涡星系与椭圆星系的相反一侧。模拟表明，这些特征仅通过引力相互作用就可以形成，不需要排斥力。\n这是另一类大多数物体是相互作用的星系。正如类别名称中所指出的，螺旋星系看起来很混乱。ARP最初将一些椭圆星系描述为排斥星系。\nARP认为这类椭圆星系是从它们的核中喷出物质的。很多图片都可以这样解读。然而，这些物体实际上是其他现象的混合体。例如，NGC2914(Arp 137)只是一个有微弱旋臂的螺旋星系[14]，而NGC4015(Arp 138)是一对相互作用的星系，其中一个星系是边缘螺旋星系。[15]一些天体，例如NGC2444和NGC2445(Arp 143)，是包含环状星系的系统，当一个星系(在这些例子中是椭圆星系)穿过另一个星系的盘时产生环状星系。这个通道产生一个引力波，气体首先向内坠落，然后向外传播，形成环状结构。[16]。\nArp将这类星系称为既不是螺旋形也不是椭圆形的星系。虽然他没有用无定形这个词来描述这些星系，但这是对这些星系最好的描述。\n这些星系中的许多要么是相互作用的星系，要么是两个较小星系合并后的残余物。相互作用过程将产生各种潮汐特征，如潮汐尾巴和潮汐桥，这些潮汐特征可能会在前驱星系的盘和核合并后持续很长时间。虽然潮汐尾巴被描述为几种不同的视觉现象(反尾)，但它们都是同一现象的表现。\n如上所述，这些环状星系可能是在伴星系穿过环状星系时形成的。这种相互作用会产生一种波动效应，首先将物质吸引到中心，然后使其在环形内向外传播。[16]。\n这些星系似乎正在从它们的核心向外喷射物质。喷水机本身看起来就像是从软管里喷出的水。在IC803(Arp 149)和NGC7609(Arp 150)的情况下，喷流只是相互作用的星系产生的无定形结构的一部分。然而，在Arp 151和Messier 87(Arp 152)中，喷流是从活动星系核中超大质量黑洞周围的环境中喷出的电离气体。[25][26]这些喷流有时被称为相对论喷流或射电喷流，它们是同步辐射的强大来源，特别是在无线电波长。\n这类星系的特点是暗尘带遮蔽了星系盘的一部分。所有这些星系都是两个星系合并的产物。NGC520(Arp157)是中期合并的最好例子之一，两个前驱星系的盘已经合并在一起，而核却没有。半人马座A(Arp 153)和NGC 1316(Arp 154)都是有效的椭圆形星系，具有不寻常的尘埃带；它们的运动学和结构表明它们最近经历了合并事件。NGC4747(Arp159)可能只是一个边缘螺旋星系，有着明显的暗尘带。[29][29]。\n这些天体中的细丝可能代表星系相互作用产生的潮汐尾巴。许多星系是两个螺旋星系合并形成一个椭圆星系的残余物。然而，NGC3414(Arp162)似乎只是一个不同寻常的S0星系，相对于它的凸起大小来说，它的圆盘非常小。[4]NGC4670(Arp163)是一个具有极强恒星形成活动的蓝色致密矮星系；[31]它显然太小了，不可能像这个样本中的其他合并残余物那样是两个螺旋星系的合并残余物，尽管它可能参与了小得多的相互作用。\n所有这些天体都是与引力相互作用有关的星系。这些反尾是由两个星系之间的引力相互作用引起的潮汐特征，就像Arp星表中描述的类似特征一样。梅西耶32(Arp 168)是一个与仙女座星系相互作用的矮小星系，[4]就属于这一类(尽管在Arp的照片中很难看到弥漫反尾)。\n这是另一类包含由引力相互作用产生潮汐尾巴的星系。这些潮汐尾巴比天体167-172中的潮汐尾巴更窄，定义更清楚。\n此类别包含不同类型的对象的混合。就像有弥漫细丝的星系或有反尾的星系一样，这类星系中的一些已经参与了相互作用，而这些细丝是由这些相互作用产生的潮汐特征。然而，其他的来源仅仅是具有微弱旋臂的单个旋涡星系，Arp将其描述为丝状星系。\n这些物体中的许多喷射物似乎是由引力相互作用产生的潮汐特征。在某些情况下(比如Arp199中的NGC5544和NGC5545)，抛射星系显然是一个侧视的螺旋星系，恰好与另一个星系的核心排成一条直线。\n这一类别中的几乎所有对象都在相互作用或最近经历过相互作用。NGC3712(Arp203)是个例外，它只是一个低表面亮度的螺旋星系。[47]。\n这类星系要么有不规则的结构(不规则)，要么有显著的尘埃带(吸收)，要么有颗粒状的外观(分辨率)。这一类包括由潮汐相互作用扭曲的相互作用的星系、附近的矮小不规则星系和具有异常大量气体的螺旋星系的混合。\n这些相邻的环路是星系间引力相互作用形成的结构的另一种表现。其中一些源由几乎完成合并过程的星系组成；相邻的环圈仅仅是相互作用的残余物。在这类天体中有Arp220，它是天空中研究最深入的超发光红外星系之一。\n这些星系中有许多是合并后的残余物。无定形旋臂是碰撞后留下的潮汐碎片。\n这些是具有壳状结构的星系。一些壳结构已被确认为最近合并的结果。然而，在其他情况下，外壳结构可能代表S0星系的外盘。在一些复杂的情况下，有光环或壳层的星系是一个与另一个星系相互作用的S0星系；在这样的系统中，壳层的起源可能很难确定。\n虽然对这类天体的描述暗示着星系正在分离，但这些星系中的大多数正在合并。许多物体都有非常明显的潮汐尾巴和桥梁，它们是相互作用的结果。大多数天体都处于合并过程的早期阶段，星系似乎仍然有不同的核心和不同的(尽管扭曲的)圆盘。在这类星系中最引人注目的是触角星系(NGC4038和NGC4039，Arp244)和MICE星系(NGC4676，Arp242)。\n然而，并非所有这些天体都是相互作用的星系。这些星系中有几个仅仅是邻近的不规则结构的矮星系。\n这些物体看起来是一系列没有连贯结构的不规则团块。这些天体中有许多仅仅是附近的矮小星系。这些天体中有一些是相互作用的星系，而另一些则是一小群星系。在这两种情况下，许多组成星系都是不规则星系。两个或更多这样的不规则星系的叠加很容易看起来像一个更大的不规则星系，这就是为什么奇特星系地图集(和其他星表)经常将这些对和组归类为单个物体。\nARP最初将这些星系称为双星系，但其中许多源都不止是两个星系。有些天体由相互作用的星系组成，而另一些源实际上是一组星系。不同之处在于，相互作用的星系将会被扭曲，而成组的星系只是简单地相互引力捆绑在一起，但彼此之间的距离不一定足够近，从而引发重大的结构变化。\n除了NGC5679(Arp274)之外，所有这些星系都是相互作用的星系对，它可能是一个相互作用的星系三胞胎。[113]这里描述的连接臂是在相互作用的星系之间形成的潮汐桥特征。这些桥梁是在星系相互作用的早期形成的。\n与无定形星系部分列出的许多天体不同，组成这些天体的相互作用的星系仍然可以相互区分。\n此类别包含对象的奇怪混合。其中两个天体是边缘盘状星系，附近有较小的伴星系。其中两个物体由潮汐桥梁连接。最后两个物体可能只是远距离地相互作用。\n虽然包括在双星系类别中，但这些天体中的许多都是单独的星系。风效应指的是外观，而不是实际检测到的高速气体(如在M82中发现的)。在某些情况下，外观可能是交互作用的结果。在其他情况下，特别是NGC3981(Arp289)，微弱的扩展发射可能与星系本身的内在性质有关，而不是与其他物体的相互作用。[4]。\n这些系统中的长丝很可能是潮汐尾巴或桥梁，它们是星系之间引力相互作用的结果。\nARP在他的地图集中没有给出对象298-310的子分类。这些天体大多是相互作用的星系对。\n业余天文学家兼偶尔撰稿人梅纳德·皮特尔特雷(Maynard Pittendreigh)编制了一份最亮的Arp星系列表，这些星系最容易被典型的业余天文学家看到。名单上的星系可以肉眼观察，不需要特殊的摄影或成像设备。这些措施包括：\n奇特星系的Arp地图集，编年史和观测指南，威尔曼-贝尔公司。(2006年)ISBN978-0-943396-76-7。\n由NASA/IPAC河外数据库提供的奇特星系地图集。检索日期为2006-07-03、2006-07-12、2006-07-14、2006-07-16、2006-07-17、2006-07-18、2006-07-19、2006-07-20、2006-07-24、2006-07-25、2006-07-26、2006-07-27、2006-07-31、2006-08-02、2006-08-08、2006-08-10、2006-08-13。\nNASA/IPAC河外数据库关于单个Arp天体的一般信息检索。检索日期为2006-07-03、2006-07-12、2006-07-14、2006-07-16、2006-07-17、2006-07-18、2006-07-19、2006-07-20、2006-07-24、2006-07-25、2006-07-26、2006-07-27、2006-07-31、2006-08-02、2006-08-08、2006-08-10、2006-08-13。\n^Arp，Halton(1966)。奇特星系的地图集。加利福尼亚州帕萨迪纳：加州理工学院。(网络版，包括Arp的原始表格数据和PDF链接)。\n^a b Halton Arp，看红：红移，宇宙学和学术科学，蒙特利尔(1998年8月)，第14页，61-62，72,104-105ISBN：0-9683689-0-5。\n^a b c d e f g h i j k l m n A.Sandage，J.Bedke(1994)。卡内基星系地图集。华盛顿特区：华盛顿卡内基研究所。ISBN电话：0-87279-667-1。\nA.B.R.Lynds，A.Toomre(1976)。关于环状星系的解释：双环系II Hz4&#34；。天体物理学杂志。209：328-388。密码：1976ApJ.209..382L。10.1086/154730。\nNGC 4651：雨伞星系。每日天文图片。2010年4月17日从原件存档。\n书名/作者声明：by by C.。(2010年8月13日)。Arp286：处女座三重奏。每日天文图片。太空总署。", "note_en": "Jump to navigation  Jump to search  The   Atlas of Peculiar Galaxies is a  catalog of  peculiar galaxies produced by  Halton Arp in 1966. A total of 338 galaxies are presented in the atlas, which was originally published in 1966 by the  California Institute of Technology. The primary goal of the catalog was to present photographs of examples of the different kinds of peculiar structures found among galaxies.  [1]\n   Arp realized that the reason why galaxies formed into  spiral or  elliptical shapes was not well understood. He perceived peculiar galaxies as small &#34;experiments&#34; that astronomers could use to understand the physical processes that distort spiral or elliptical galaxies. With this atlas, astronomers had a sample of peculiar galaxies that they could study in more detail. The atlas does not present a complete overview of every peculiar galaxy in the sky but instead provides examples of the different phenomena as observed in nearby galaxies.\n Because little was known at the time of publication about the physical processes that caused the different shapes, the galaxies in the atlas are sorted based on their appearance. Objects 1–101 are individual peculiar spiral galaxies or spiral galaxies that apparently have small companions. Objects 102–145 are elliptical and elliptical-like galaxies. Individual or groups of galaxies with neither elliptical nor spiral shapes are listed as objects 146–268. Objects 269–327 are double galaxies. Finally, objects that simply do not fit into any of the above categories are listed as objects 332–338. Most objects are best known by their other designations, but a few galaxies are best known by their Arp numbers (such as  Arp 220).\n Today, the physical processes that lead to the peculiarities seen in the Arp atlas are thought to be well understood. A large number of the objects have been interpreted as  interacting galaxies, including  M51 (Arp 85),  Arp 220, and  the Antennae Galaxies (NGC 4038/NGC 4039, or Arp 244). A few of the galaxies are simply  dwarf galaxies that do not have enough  mass to produce enough  gravity to allow the galaxies to form any cohesive structure.  NGC 1569 (Arp 210) is an example of one of the dwarf galaxies in the atlas. A few other galaxies are  radio galaxies. These objects contain  active galactic nuclei that produce powerful jets of gas called  radio jets. The atlas includes the nearby radio galaxies  M87 (Arp 152) and  Centaurus A (Arp 153).\n Many of the peculiar associations present in the catalogue have been interpreted as  galaxy mergers, though Arp refuted the idea, claiming, rather, that apparent associations were prime examples of ejections.  [2] He writes in &#34;Seeing Red&#34; (1998):\n For me, the whole lesson of the  Atlas of Peculiar Galaxies was that galaxies are generally ejected material. The merger mania seems to be a first guess based on a cursory look at galaxies. [...] The  Atlas of Peculiar Galaxies contained a very interesting class of galaxies called spirals with companions (smaller galaxies) on the ends of arms. How had they gotten there? Certainly not by accidental collisions or by the beginning of a merger process, which is fashionably used to &#34;explain&#34; everything in the extragalactic realm.  [2]\n          These are mostly dwarf galaxies or poorly defined spiral galaxies (with the designation Sm) that have low surface brightnesses (i.e. they emit little light per unit area). Low surface brightness galaxies are actually quite common. The exception is  NGC 2857 (Arp 1), which is an Sc spiral galaxy (which means that it has a definite structure with loosely wound spiral arms and a faint but well-defined nucleus).  [3]\n         This category contains spiral galaxies with arms that appear to be segmented. Some spiral arm segments may appear detached because dust lanes in the spiral arms obscure the arms&#39; starlight. Other spiral arms may appear segmented because of the presence of bright star clusters (or discontinuous chains of bright star clusters) in the spiral arms.\n    Usually, most spiral galaxies contain two clearly defined spiral arms, or they contain only fuzzy filamentary spiral structures. Galaxies with three well-defined spiral arms are rare.\n     One-armed spiral galaxies, including  Magellanic spirals, are also rare. In this case, the single spiral arm may actually be formed by a gravitational interaction with another galaxy (as with the  Large Magellanic Cloud itself, although it is not a member of the catalog).\n     The spiral arms in these galaxies have an asymmetric appearance. One spiral arm may appear to be considerably brighter than the other. In the photographic plates produced by Arp, the bright arm would look dark or &#34;heavy&#34;. While most of these galaxies (such as  M101 and  NGC 6946) are simply asymmetric spiral galaxies,  NGC 6365 is an interacting pair of galaxies where one of the two galaxies is viewed edge-on and just happens to lie where the spiral arm for the other face-on galaxy would be visible.  [5]\n    These are galaxies that look like a stretched-out S shape (or like the integral sign used in  calculus). Some objects, such as  IC 167,  [6] are simply ordinary spiral galaxies viewed from an unusual angle. Other objects, such as  UGC 10770, are interacting pairs of galaxies with tidal tails that look similar to spiral arms.  [7]\n    Many of these spiral galaxies are probably interacting with the low surface brightness galaxies in the field of view. In some cases, however, it may be difficult to determine whether the companion is physically near the spiral galaxy or whether the companion is a foreground/background source or a source on the edge of the spiral galaxy.\n     Again, many of these spiral galaxies are probably interacting with companion galaxies, although some of the identified companion galaxies may be foreground/background sources or even bright star clusters within the individual galaxies.\n     Galaxies in this category are almost always clearly interacting sources. The most famous of these objects is  the Whirlpool galaxy (M51; Arp 85), which is composed of a spiral galaxy  NGC 5194 that is interacting with a smaller elliptical galaxy  NGC 5195. The interaction has distorted the shape of both galaxies; the spiral arm pattern has been enhanced in the larger spiral galaxy, and a bridge of stars and gas has formed between the two galaxies. Many of the other galaxies in this category are also connected by bridges.\n    Like the spiral galaxies with high surface brightness companions, most of these spiral galaxies are clearly interacting systems. Tidal tails and bridges are visible in many of the images.\n      These objects are very similar to the spiral galaxies with elliptical companions. All of the galaxies have features such as tidal tails and tidal bridges that have formed through gravitational interaction.\n    Based on the description of these objects, it appears that Arp originally thought that the elliptical galaxies were pushing away spiral arms in companion galaxies. However, the tidal spiral arms may actually look distorted because of the interaction. Some of these &#34;repelled&#34; spiral arms are on the opposite side of the spiral galaxy from the elliptical galaxy. Simulations have shown that such features can be formed through gravitational interactions alone; no repelling forces are needed.\n      This is another category in which the majority of objects are interacting galaxies. As noted in the category name, the spiral galaxies look perturbed. Arp originally described some of the elliptical galaxies as repelling.\n       Arp thought that the elliptical galaxies in this category were ejecting material from their nuclei. Many of the pictures could be interpreted that way. However, these objects are actually a mixture of other phenomena. For example,  NGC 2914 (Arp 137) is merely a spiral galaxy with faint spiral arms,  [14] and  NGC 4015 (Arp 138) is an interacting pair of galaxies where one galaxy is an edge-on spiral galaxy.  [15] Some objects, such as  NGC 2444 and  NGC 2445 ( Arp 143), are systems that contain &#34;ring galaxies&#34;, which are created when one galaxy (the elliptical galaxies in these examples) passes through the disk of another. This passage causes a gravitational wave in which gas first falls inward and then propagates outward to form the ring structure.  [16]\n     Galaxies in this category are referred to by Arp as galaxies that are neither spiral nor elliptical in shape. Although he does not use the term &#34;amorphous&#34; to describe these galaxies, it is the best description of these galaxies.\n Many of these galaxies are either interacting galaxies or galaxies that are the remnants of the merger of two smaller galaxies. The interaction process will produce various tidal features, such as tidal tails and tidal bridges, that may last well after the progenitor galaxies&#39; disks and nuclei have merged. Although the tidal tails are described as several different visual phenomena (&#34;counter-tails&#34;, &#34;filaments&#34;, &#34;loops&#34;), they are all manifestations of the same phenomena.\n   As noted above, these ring galaxies may have formed when a companion galaxy passed throughthe ring galaxy. The interaction would produce a wave effect that would first draw matter into the center and then cause it to propagate outward in a ring.  [16]\n     These are galaxies that appear to be ejecting material outwards from their nuclei. The &#34;jets&#34; themselves look similar to water spraying out of a hose. In the case of  IC 803 (Arp 149) and  NGC 7609 (Arp 150), the jets are simply part of the amorphous structure produced by the interacting galaxies. In  Arp 151 and  Messier 87 (Arp 152), however, the jets are ionized gas that has been ejected from the environment around supermassive  black holes in the galaxies&#39;  active galactic nuclei.  [25]  [26] These jets, sometimes called  relativistic jets or radio jets, are powerful sources of  synchrotron radiation, especially at  radio wavelengths.\n      Galaxies in this category feature dark dust lanes that obscure part of the disk of the galaxy. All of these galaxies are the products of two galaxies merging.  NGC 520 (Arp 157) is one of the best examples of an intermediate-stage merger, where the two progenitor galaxies&#39; disks have coalesced together but the nuclei have not.  Centaurus A (Arp 153) and  NGC 1316 (Arp 154) are both effectively elliptical galaxies with unusual dust lanes; their kinematics and structure indicate that they have undergone merging events recently.  NGC 4747 (Arp 159) may be nothing more than an edge-on spiral galaxy with a significantly dark dust lanes.  [29]\n    The filaments in these objects may represent tidal tails from galaxy interactions. Many of the galaxies are the remnants of the mergers of two spiral galaxies to form a single elliptical galaxy. However,  NGC 3414 (Arp 162) appears to be merely an unusual  S0 galaxy with a very small disk relative to its bulge size.  [4]  NGC 4670 (Arp 163) is a  blue compact dwarf galaxy with extremely strong  star formation activity;  [31] it is clearly too small to be the merger remnant of two spiral galaxies like the other merger remnants in this sample, although it may have been involved in a much smaller interaction.\n    All of these objects are galaxies involved in gravitational interactions. These counter-tails are tidal features caused by the gravitational interactions between two galaxies, just like similar features described in the Arp catalog.  Messier 32 (Arp 168), a  dwarf galaxy interacting with the  Andromeda Galaxy,  [4] is included in this category (although the &#34;diffuse counter-tail&#34; is very difficult to see in Arp&#39;s photograph).\n    This is another category containing galaxies with tidal tails produced by gravitational interactions. These tidal tails are narrower and better defined than the tidal tails in objects 167–172.\n      This category contains a mixture of different types of objects. Like the galaxies with diffuse filaments or galaxies with counter-tails, some of the galaxies in this category have been involved in interactions, and the filaments are tidal features created by those interactions. Other sources, however, are simply individual spiral galaxies with faint spiral arms that are described as &#34;filaments&#34; by Arp.\n     The ejecta in many of these objects appear to be tidal features created by gravitational interactions. In some cases (such as for  NGC 5544 and  NGC 5545 in  Arp 199), the &#34;ejecta&#34; are clearly a spiral galaxy viewed edge-on that happens to line up with another galaxy&#39;s nucleus.\n Almost all of the objects in this category are interacting or have recently undergone interactions.  NGC 3712 (Arp 203) is an exception; it is merely a low surface brightness spiral galaxy.  [47]\n     Galaxies in this category have either irregular structures (irregularities), notable dust lanes (absorption), or a grainy appearance (resolution). This category contains a mix of interacting galaxies distorted by tidal interactions, nearby dwarf irregular galaxies, and spiral galaxies with unusual large amounts of gas.\n     These adjacent loops are another manifestation of the structures formed by gravitational interactions between galaxies. Some of these sources consist of galaxies that have nearly completed the merger process; the &#34;adjacent loops&#34; are merely the remnants of the interaction. Among the objects in this category is  Arp 220, one of the best-studied  ultraluminous infrared galaxies in the sky.\n     Many of these galaxies are merger remnants. The &#34;amorphous spiral arms&#34; are the tidal debris that remains after the collision.\n     These are galaxies with shell-like structures. Some shell structures have been identified as the results of recent mergers. [   citation needed] In other cases, however, the shell structure may represent the outer disk of an  S0 galaxy. In some complicated cases, the galaxy with the rings or shells is an S0 galaxy interacting with another galaxy; the origins of the shells in such systems can be difficult to determine.\n       Although the description of the objects in this category implies that the galaxies are separating apart, most of these galaxies are merging. Many of the objects have very pronounced tidal tails and bridges that have formed as a consequence of the interaction. Most objects are in the early stages of the merging process, where the galaxies still appear to have distinct nuclei and distinct (albeit distorted) disks. Among the most notable galaxies in this category are the  Antennae Galaxies (NGC 4038 and NGC 4039, Arp 244) and the  Mice Galaxies (NGC 4676, Arp 242).\n However, not all of these objects are interacting galaxies. A few of these galaxies are simply nearby dwarf galaxies with irregular structure.\n      These are objects that appear to be a series of irregular clumps with no coherent structure. Many of these objects are simply nearby  dwarf galaxies. Some of these objects are interacting galaxies, while others are small  groups of galaxies. In both cases, many of the constituent galaxies are irregular galaxies. The superposition of two or more such irregular galaxies can easily look like a single larger irregular galaxy, which is why the  Atlas of Peculiar Galaxies (and other catalogs) often classify these pairs and groups as single objects.\n    Arp originally referred to these galaxies as &#34;double galaxies&#34;, but many of these sources are more than two galaxies. Some of the objects consist of  interacting galaxies, whereas other sources are actually  groups of galaxies. The difference is that interacting galaxies will be distorted, whereas galaxies in groups are simply gravitationally bound to each other but not necessarily close enough to each other to induce major structural changes.\n   All of these galaxies are interacting pairs of galaxies except for  NGC 5679 (Arp 274), which may be an interacting galaxy triplet.  [113]The connected arms described here are tidal bridge features that form between interacting galaxies. These bridges form early during galaxy interactions.\n     Unlike many of the objects listed in the  amorphous galaxies section, the interacting galaxies that comprise these objects are still distinguishable from each other.\n     This category contains an odd mixture of objects. Two of the objects are edge-on disk galaxies with smaller companion galaxies nearby. Two of the objects are connected by tidal bridges. The last two objects may simply be interacting with each other over long distance.\n     Although included in the double galaxies category, many of these objects are individual galaxies. The &#34;wind effects&#34; refer to the appearance, not the actual detection of high-velocity gas (such as is found in  M82). In some cases, the appearance may be the result of interaction. In other cases, particularly  NGC 3981 (Arp 289), the faint, extended emission may be related to the intrinsic nature of the galaxy itself and not interactions with other objects.  [4]\n     The long filaments in these systems are probably tidal tails or bridges that have been produced as the result of the gravitational interaction between the galaxies.\n      Arp did not give a subclassification for objects 298–310 in his atlas. These objects are mostly interacting galaxy pairs.\n              Maynard Pittendreigh, an amateur astronomer and occasional writer, has compiled a list of the brightest Arp Galaxies that are most easily viewed by typical amateur astronomers. The galaxies on the list can be observed visually and do not require special photographic or imaging equipment. These include:\n      J. Kanipe, D. Webb  The Arp Atlas of Peculiar Galaxies, A Chronicle and Observer&#39;s Guide, Willmann-Bell Inc. (2006)  ISBN  978-0-943396-76-7\n  Atlas of Peculiar Galaxies courtesy of the NASA/IPAC Extragalactic Database. Retrieved on 2006-07-03, 2006-07-12, 2006-07-14, 2006-07-16, 2006-07-17, 2006-07-18, 2006-07-19, 2006-07-20, 2006-07-24, 2006-07-25, 2006-07-26, 2006-07-27, 2006-07-31, 2006-08-02, 2006-08-08, 2006-08-10, 2006-08-13.\n NASA/IPAC Extragalactic Database General information retrieval on individual Arp objects. Retrieved on 2006-07-03, 2006-07-12, 2006-07-14, 2006-07-16, 2006-07-17, 2006-07-18, 2006-07-19, 2006-07-20, 2006-07-24, 2006-07-25, 2006-07-26, 2006-07-27, 2006-07-31, 2006-08-02, 2006-08-08, 2006-08-10, 2006-08-13.\n     ^   Arp, Halton (1966).   Atlas of Peculiar Galaxies. Pasadena, California: California Institute of Technology .   (online version, including Arp&#39;s original tabular data, and PDF link)\n ^     a     b  Halton Arp,  Seeing Red: Redshift, Cosmology and Academic Science, Aperion, Montreal (August 1998), pp. 14, 61-62, 72, 104-105   ISBN  0-9683689-0-5\n  ^     a     b     c     d     e     f     g     h     i     j     k     l     m     n   A. Sandage, J. Bedke (1994).  Carnegie Atlas of Galaxies. Washington, D.C.: Carnegie Institution of Washington.  ISBN   0-87279-667-1.\n            ^     a     b   R. Lynds, A. Toomre (1976). &#34;On the interpretation of ring galaxies : the binary ring system II Hz4&#34;.  Astrophysical Journal.  209: 328–388.  Bibcode: 1976ApJ...209..382L.  doi: 10.1086/154730.\n                           ^    &#34;NGC 4651: The Umbrella Galaxy&#34;.   Astronomy Picture of the Day.  Archived from the original on 17 April 2010 .\n                                                                                       ^   Nemiroff, R.; Bonnell, J., eds. (13 August 2010).  &#34;Arp 286: Trio in Virgo&#34;.   Astronomy Picture of the Day.  NASA.", "posttime": "2020-07-06 15:59:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "星系,peculiar", "title": "奇特星系地图集", "title_en": "Atlas of Peculiar Galaxies", "transed": 1, "url": "https://en.wikipedia.org/wiki/Atlas_of_Peculiar_Galaxies", "via": "", "real_tags": ["星系", "peculiar"]}, {"category": "", "categoryclass": "", "imagename": "a39fa6b490216b4cc62184b3848879ae.jpg", "infoid": 1010074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位奥斯卡奖得主因为塞尔吉奥·里昂的意大利西部片配乐而闻名，他还为“使命”、“天堂影院”和“可恶的八人组”制作了声音和音乐。\n奥斯卡获得者恩尼奥·莫里康(Ennio Morricone)去世，他令人难以忘怀的、创造性的配乐熟练地突出了塞尔吉奥·里昂(Sergio Leone)执导的意大利西部片中酝酿的、没有对话的紧张气氛。他享年91岁。\n这位意大利作曲家创作了500多部电影-其中7部是为他的同胞莱昂纳多创作的，他们在小学时相遇。上周，这位意大利作曲家在跌倒导致股骨骨折后出现并发症，在罗马去世。\n莫里康是罗马土生土长的居民，他的第一件乐器是小号。莫里康凭借昆汀·塔伦蒂诺(Quentin Tarantino)的“可恨的八人”(2015)获得奥斯卡奖，他还因特伦斯·马利克(Terence Malick)的“天堂的日子”(1978)、罗兰·约菲(Roland Joffe)的“使命”(1986)、布莱恩·德·帕尔马(Brian De Palma)的“贱民”(1987)、巴里·莱文森(Barry Levinson)的“巴格西”(Bugsy)和朱塞佩·托纳托雷(Giuseppe Tornatore)的“玛莲娜”(2000)获得提名。\n被称为“大师”的他还因“对电影音乐艺术的宏伟和多方面的贡献”在2007年获得了奥斯卡荣誉奖(由克林特·伊斯特伍德颁发)，他获得了11项大卫·迪·多纳泰罗奖(David Di Donatello Awards)，这是意大利电影的最高荣誉。\n莫里康成熟、动人的声音丰富了里昂的低预算拍摄--“一大堆美元”(1964)、“再多几美元”(1965)、“好人、坏人和丑陋的人”(1966)--这三位主演曾在“西部”(1968)和“笨蛋达克”(1971)中出演过。\n1989年去世的莱昂内尔曾说，“音乐是不可或缺的，因为我的电影实际上可以说是无声电影，对话的意义相对较小，所以音乐比对话更强调行动和情感。”“我让他在拍摄前写音乐，真的是作为剧本本身的一部分。”\n莫里康将精力集中在一种乐器上--比如“好的”、“坏的和丑陋的”中的小号独奏，或者“使命”中在郁郁葱葱的虔诚背景下腾空而起的双簧管--丰富了他的贡献。\n这位作曲家喜欢电吉他和犹太人竖琴的声音，并使用口哨、教堂钟声、鞭子、郊狼的嚎叫、啁啾的小鸟、滴答滴答的钟声、枪声和女性的声音来为乐谱添加与典型录音室编排不相关的质感。\n“各种声音都可以用来表达情感…。这是由现实的声音组成的音乐，“他说。\n莫里康还最后一次与莱昂纳多合作拍摄禁酒令时代的故事“曾几何时在美国”(1984)，并与托纳托雷合作了大约12次，其中包括奥斯卡最佳外语片获得者“天堂影院”(1988)。\n他不喜欢“意大利西部面条”这个词，并指出他在这一流派中的工作只代表了他职业生涯的一小部分。\n这是显而易见的，因为他出色的作品包括与其他著名导演的合作，如吉洛·庞特科沃(1966年的“阿尔及尔战役”)、唐·西格尔(1970年的“萨拉妹妹的两头骡子”)、贝尔纳多·贝尔托鲁奇(1976年的1900年)、约翰·布尔曼(1977年的“驱魔者2：异教徒”)、爱德华·莫利纳罗(1978年的“笼子”)、约翰·卡彭特(1982)。“把我绑起来！”、弗兰科·泽菲雷利(1990年的“哈姆雷特”)、沃尔夫冈·彼得森(1993年的“火线上”)、迈克·尼科尔斯(1994年的“狼”)和沃伦·比蒂(1998年的布尔沃斯)。\n有人问他，但他从未为导演伊斯特伍德(Eastwood)拍过一部电影，他说这一决定令他后悔，并错失了拍摄斯坦利·库布里克(Stanley Kurick)的“发条橙”(1971)的机会，因为里昂坚持说，这位作曲家太忙于完成他的一部电影(他没有)。\n他为1981年BBC电视剧“大卫·劳埃德·乔治的一生与时代”创作的主题曲“奇迈”在国际上大受欢迎，他还凭借“贱民”的配乐获得了格莱美奖。\n塔伦蒂诺是他的铁杆粉丝，他在“杀死比尔”系列电影“被解放的姜戈”和“无耻混蛋”中使用了他的一些作品。在2016年1月的一次采访中，莫里康说与导演合作“仇恨8”是“完美的……。因为他没有给我任何提示，没有指导方针。\n我在昆汀·塔伦蒂诺不知情的情况下写下了这首曲子，当我录制它的时候，他来到了布拉格，非常高兴。所以这次合作是建立在信任的基础上的，对我来说也是一种极大的自由。“。\n2018年11月，他在一次采访中强烈批评塔伦蒂诺和美国电影艺术与科学学院(Academy Of Motion Picture Arts&Amp；Sciences)，该采访发表在德国版的《花花公子》上，但莫里康否认发表了贬低他的言论，并威胁要起诉。\n恩尼奥·莫里康于1928年11月10日出生在永恒之城的一个居民区。他的父亲马里奥是一名小号手，而小号是这个年轻人演奏的第一件乐器。他从6岁开始创作音乐。\n当他大约8岁时，莫里康在小学时第一次见到了里昂(两人在20多年的时间里没有再联系过)。他就读于圣塞西莉亚音乐学院，师从意大利主要作曲家戈夫雷多·彼得拉西(Goffredo Petrassi)。\n莫里康为广播剧作曲，并在专门为电影创作音乐的管弦乐队演奏。“这些分数大多非常难看，我相信我可以做得更好，”他在2001年的一次采访中说。…说：“战后，意大利的电影业相当兴旺。但是这些新的现实主义电影没有很棒的音乐。我需要钱，我想写电影配乐会是一件好事。“。\n他与马里奥·兰扎(Mario Lanza)、保罗·安卡(Paul Anka)、查尔斯·阿兹纳布尔(Charles Aznavour)、切特·贝克(Chet Baker)等人在RCA担任录音室编曲，并与导演卢西亚诺·萨尔斯(Luciano。当Salce需要为他1961年的电影Il Federale找一位作曲家时，他聘请了莫里康。\n随后又有十几部电影接踵而至，里昂在拍摄他的第一部西部片时，让莫里康投入了一大笔钱。(导演和作曲家分别被标榜为鲍勃·罗伯逊(Bob Robertson)和丹·萨维奥(Dan Savio)，目的是让越来越厌倦本土西部片的意大利观众相信，这部电影是好莱坞的产物。)。\n莫里康说：“随着时间的推移，他作为导演，我作为作曲家，我们进步了，在我看来，曾经在美国达到了最好的水平。”", "note_en": "Renowned for scoring Sergio Leone’s spaghetti Westerns, the Oscar winner also produced the sounds and music for &#39;Days of Heaven,&#39; &#39;The Mission,&#39; &#39;Cinema Paradiso&#39; and &#39;The Hateful Eight.&#39;\n Ennio Morricone, the Oscar winner whose haunting, inventive scores expertly accentuated the simmering, dialogue-free tension of the spaghetti Westerns directed by Sergio Leone, has died. He was 91.\n The Italian composer, who scored more than 500 films — seven for his countryman Leone after they had met as kids in elementary school — died in Rome following complications from a fall last week in which he broke his femur.\n A native and lifelong resident of Rome whose first instrument was the trumpet, Morricone won his Oscar for his work on Quentin Tarantino’s  The Hateful Eight (2015) and also was nominated for his original scores for Terrence Malick’s  Days of Heaven (1978), Roland Joffe’s  The Mission (1986), Brian De Palma’s  The Untouchables (1987), Barry Levinson’s  Bugsy (1991) and Giuseppe Tornatore’s  Malena (2000).\n Known as “The Maestro,” he also received an honorary Oscar in 2007 (presented by Clint Eastwood) for his “magnificent and multifaceted contributions to the art of film music,” and he collected 11 David di Donatello Awards, Italy’s highest film honors.\n Morricone’s ripe, pulsating sounds enriched Leone’s low-budget shoot-’em-ups  A Fistful of Dollars (1964),  For a Few Dollars More (1965),  The Good, the Bad and the Ugly (1966) — those three starred Eastwood —  Once Upon a Time in the West (1968) and  Duck, You Sucker (1971).\n “The music is indispensable, because my films could practically be silent movies, the dialogue counts for relatively little, and so the music underlines actions and feelings more than the dialogue,” Leone, who died in 1989, once said. “I’ve had him write the music before shooting, really as a part of the screenplay itself.”\n  Morricone’s spare focus on one instrument — like the trumpet solo in  The Good, the Bad and the Ugly, or the oboe, which soared over a lushly reverent backdrop in  The Mission — enriched his contributions.\n The composer loved the sound of the electric guitar and the Jew’s harp and employed whistles, church bells, whips, coyote howls, chirping birds, ticking clocks, gunshots and women’s voices to add textures to scores not associated with the typical studio arrangement.\n “All kinds of sounds can be useful to convey emotion … it’s music made up of the sound of reality,” he said.\n Morricone also teamed with Leone one last time on the Prohibition-era tale  Once Upon a Time in America (1984) and partnered about a dozen times with Tornatore, including on  Cinema Paradiso (1988), winner of the Oscar for best foreign-language film.\n He did not like the term “spaghetti Western” and noted that his work in that genre represented just a fraction of his career.\n That is obvious, as his brilliant body of work includes collaborations with other notable directors like Gillo Pontecorvo (1966’s  The Battle of Algiers), Don Siegel (1970’s  Two Mules for Sister Sara), Bernardo Bertolucci (1976’s  1900), John Boorman (1977’s  Exorcist II: The Heretic), Edouard Molinaro (1978’s  La Cage aux Folles), John Carpenter (1982’s  The Thing), William Friedkin (1987’s  Rampage), Brian De Palma (1987’s  The Untouchables), Pedro Almodovar (1989’s  Tie Me Up! Tie Me Down!), Franco Zeffirelli (1990’s  Hamlet), Wolfgang Petersen (1993’s  In the Line of Fire), Mike Nichols (1994’s  Wolf) and Warren Beatty (1998’s  Bulworth).\n He was asked but never scored a film for Eastwood the director, a decision he said he regretted, and missed out on a chance to do Stanley Kubrick’s  A Clockwork Orange (1971) when Leone insisted that the composer was too busy finishing up one of his films (he wasn’t).\n His theme, “Chi Mai,” for the 1981 BBC drama  The Life and Times of David Lloyd George became an international hit, and he received a Grammy for his  Untouchables score.\n Tarantino, a big fan, used some of his compositions for the  Kill Bill films,  Django Unchained and  Inglourious Basterds. In a January 2016  interview, Morricone said working with the director on  Hateful Eight was “perfect ... because he gave me no cues, no guidelines.\n “I wrote the score without Quentin Tarantino knowing anything about it, then he came to Prague when I recorded it and was very pleased. So the collaboration was based on trust and a great freedom for me.”\n In November 2018, he came out as highly critical of Tarantino and the Academy of Motion Picture Arts &amp; Sciences in an interview that was published in the German edition of  Playboy, but Morricone denied making the disparaging remarks and threatened to sue.\n Ennio Morricone was born on Nov. 10, 1928, in a residential area of the Eternal City. His father, Mario, was a trumpet player, and the trumpet was the first instrument the youngster played. He began writing music at age 6.\n When he was about 8, Morricone first met Leone in elementary school (the two would not connect again for more than two decades). He attended the Santa Cecilia Conservatory, where he studied under Goffredo Petrassi, a major Italian composer.\n Morricone composed music for radio dramas and played in an orchestra that specialized in music written for films. “Most of these scores were very ugly, and I believed I could do better,” he said in a 2001 interview. “After the war, the film industry was quite strong here in Italy … but these new realistic movies didn’t have great music. I needed money, and I thought it would be a good thing to write film scores.”\n He worked with Mario Lanza, Paul Anka, Charles Aznavour, Chet Baker and others as a studio arranger at RCA and with director Luciano Salce on a number of plays. When Salce needed a composer for his 1961 movie  Il Federale, he hired Morricone.\n About a dozen other films followed, and Leone, doing his first Western, put Morricone to work on  Fistful of Dollars. (The director and composer were billed as Bob Robertson and Dan Savio, respectively, in a bid to convince Italian moviegoers, who were growing weary of home-grown Westerns, that the film was a product of Hollywood.)\n “Gradually over time, he as a director and me as a composer, we improved and reached our best, in my opinion, in  Once Upon a Time in America,” Morricone said.", "posttime": "2020-07-06 15:40:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,逝世,morricone", "title": "多产的意大利电影作曲家恩尼奥·莫里康逝世，享年91岁", "title_en": "Ennio Morricone, Prolific Italian Composer for the Movies, Dies at 91", "transed": 1, "url": "https://www.hollywoodreporter.com/news/ennio-morricone-dead-prolific-italian-composer-was-91-858358", "via": "", "real_tags": ["电影", "逝世", "morricone"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "检查列表通常是任何新客户入职或生产版本的首选策略。GoThroughList允许您将所有检查表保存在一个位置以供跟踪，还可以存储它们的历史行为以便改进和更正。\n了解更多。\n核对表帮助我在后端系统的流水线生产流水线方面提供了帮助。这提供了对基础工作的一些见解，并有助于消除一些多余的步骤。\n由于核对表和它带来的透明度，我们能够无所畏惧地更快地行动。\n我在GoThroughList上设置了入职核对表，我必须说它帮助我减少了入职时间，也减少了文档中的一些杂乱。\n是的，支持嵌套核对表。但我们建议根据标签进行细分，以便更好地洞察数据。", "note_en": "Check-lists are generally a go-to strategy for any new client onboarding or a production release. GoThroughList allows you to keep all your\r Check-lists in one place for tracking purpose and also stores their historical behavior for improvements and corrections.\n  Learn More\n               Check-lists have helped me in stream-lining production pipeline for my backend systems. \r This gives some insights into ground work and helps elemintate some of redundant steps.\n  We are able to move faster fearlessly due to check-lists and transparency it brings in pipeline.\n  I have setup onboarding checklist on GoThroughList, and I must say it have helped me reduce onboarding time and also reduce some of clutter lying in docs.\n                Yes nested check-lists are supported. But we recommend breaking down based on tags so that there can be better insights in data.", "posttime": "2020-07-06 15:40:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设置,setup,核对表", "title": "GoThroughList-设置您的核对表", "title_en": "GoThroughList – Setup Your CheckLists", "transed": 1, "url": "http://gothroughlist.com/", "via": "", "real_tags": ["设置", "setup", "核对表"]}, {"category": "", "categoryclass": "", "imagename": "5c0c88eddfacab7cd2919fb3e59cfffc.jpg", "infoid": 1010072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "夏尔马正在通过QorQl Pvt.Ltd收购Raheja QBE，他拥有这家公司的多数股权，Paytm拥有其余股份。Raheja QBE是一家专门为个人的健康、住房、车辆提供保险服务的公司，还提供商业财产和工伤保护，由Prism Johnson(51%)和QBE Australia(49%)所有。这两家实体表示，作为协议的一部分，QorQl将收购Raheja QBE的100%股份。\nPaytm的服务每月有数千万印度人使用，该公司表示，此次收购将有助于其在印度“实现一般保险服务的民主化”。\nPaytm总裁阿米特·纳亚尔(Amit Nayyar)在一份声明中表示，Raheja QBE的“强大的管理团队将帮助我们加快将保险带给印度广大人口的旅程，目标是创建一家拥有创新和负担得起的保险产品的科技驱动、多渠道的一般保险公司。”\n在印度，目前全国13亿人口中只有一小部分人可以获得保险，一些分析师表示，数字公司在将这些服务带给大众方面可能被证明是至关重要的。根据评级机构ICRA的数据，截至2017年，保险产品覆盖的人口不到3%。\n根据世界银行(World Bank)的数据，印度人的平均年收入约为2100美元。ICRA估计，在那些购买了保险产品的印度人中，2017年他们在保险产品上的花费不到50美元。\n近年来，数十家初创企业和老牌银行推出了赢得这一市场的产品。对于经营着包括数字银行和在线贷款在内的一系列业务的Paytm来说，保险香包可能会很好地适合其整体服务。\nPrism Johnson董事总经理维贾伊·阿加瓦尔(Vijay Aggarwal)在一份声明中表示：“此举将通过利用Paytm提供的庞大客户基础和创新产品，帮助保险业务扩大到新的高度。”", "note_en": "Sharma is acquiring  Raheja QBE through QorQl Pvt. Ltd, a firm in which he owns majority stake with Paytm owning the remainder. Raheja QBE, which offers insurance services to cover an individual’s health, home, vehicles, and also provides protection on commercial properties, and workplace injuries, is owned by Prism Johnson (51%) and QBE Australia (49%.) QorQl is acquiring 100% of Raheja QBE as part of the agreement, the two entities said.\n Paytm, whose services are used by tens of millions of Indians each month, said the acquisition will help it “democratize general insurance services” in the country.\n  Raheja QBE’s “strong management team will help us accelerate our journey of taking insurance to the large population of India with the aim to create a tech-driven, multi-channel general insurance company with innovative and affordable insurance products,” said Amit Nayyar, President of Paytm, in a statement.\n In India only a fraction of the nation’s 1.3 billion people currently have access to insurance and some analysts say that digital firms could prove crucial in bringing these services to the masses. According to rating agency ICRA, insurance products had reached less than 3% of the population as of 2017.\n An average Indian makes about $2,100 in a year, according to World Bank. ICRA estimated that of those Indians who had purchased an insurance product, they were spending less than $50 on them in 2017.\n In recent years, scores of startups and established banks have launched products to win this market. For Paytm, which runs a range of businesses including a digital bank and online lending, sachets of insurance could fit well in its overall offerings.\n “This move will help the insurance business scale up to new heights by leveraging the large customer base and innovative products offered by Paytm,” said Vijay Aggarwal, Managing Director of Prism Johnson, in a statement.", "posttime": "2020-07-06 15:21:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "raheja,vijay,paytm", "title": "\nPaytm，Vijay Shekhar Sharma将以7600万美元收购Raheja QBE", "title_en": "\n\t\t\t\tPaytm, Vijay Shekhar Sharma to acquire Raheja QBE for $76M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/06/paytm-vijay-shekhar-sharma-to-acquire-raheja-qbe-for-76m/", "via": "", "real_tags": ["raheja", "vijay", "paytm"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们是开放目录-如果您错过提供商或内容，请发送电子邮件至add@scrapingworld.com", "note_en": "We are an open directory - if you miss provider or content, send us an email to add@scrapingworld.com", "posttime": "2020-07-06 15:21:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,目录,directory", "title": "scrapingworld.com-抓取目录：组件、提供程序、知识库", "title_en": "Scrapingworld.com – Scraping Directory: components, providers, knowledge base", "transed": 1, "url": "https://www.scrapingworld.com", "via": "", "real_tags": ["程序", "目录", "directory"]}, {"category": "", "categoryclass": "", "imagename": "8f5174e29d0614f47accb046d0f9738a.jpeg", "infoid": 1010069, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个关于如何不花一分钱的故事，使用三个预计到达时间(ETA)服务而不是一个。一切都是基于我在Godee项目担任后端开发人员的个人经验。Godee是一个初创项目，提供在线预订公交车座位的服务。您可以在此处找到有关此项目的更多信息：\nGodee是一项公共交通服务。乘坐Godee的公交车比东南亚常见的摩托车更方便，比出租车更便宜。这个基于APP的系统允许用户找到合适的路线，选择时间，预订座位，并在线支付乘车费用。而Godee的问题之一就是严重影响用户体验的交通拥堵。用户厌倦了等待，并对试图猜测公交车到达时间感到恼火。因此，为了使通勤更方便，需要服务来计算公交车的大约到达时间，也就是预计到达时间。\n从零开始开发ETA至少需要一年时间。因此，为了加快这一过程，Godee决定实现Google Distance Matrix API工具。后来，他们开发了自己的Pifia微型服务。\n随着时间的推移，业务在增长，用户群也在增加。我们在Google Distance Matrix API中遇到了请求增加的问题。\n因为每个请求都是收费的，Google API每月提供10.000次免费查询，之后每1.000次查询收费20美元，当时我们每月大约有150,000次请求。\n我的导师对此非常不满。并表示系统应该每30分钟更换一次现金以存储预计到达时间。当时，系统每隔3秒向Google API发送请求以获取最新数据。然而，这样的兑现算法效率不高，因为小型巴士被困在车流中。所以距离每十分钟才改变一次。还有另一个细微差别。例如，五个用户请求关于同一总线的信息，这是相同的请求。缓存解决了这类问题。\n缓存起作用了，但自从Godee进一步增长并面临同样的问题后不久-查询数量再次增加。\n决定用OSRM取代Google API。基本上，OSRM是一种基于ETA构建路线的服务(这是一个粗略但简短的描述，如果您需要详细信息，这里是链接)。\n开放源码路由机(Open Source Routing Machine，简称OSRM)是针对道路网络中最短路径的高性能路由引擎的C++实现。\nOSRM有一个问题：它建立路由并计算ETA，而不考虑流量。为了解决这个问题，我开始寻找能够提供城市指定区域交通信息的服务。在这里，交通部提供了我需要的数据。在对文档进行了一些研究之后，我编写了一个小代码，它每30分钟获取一次交通信息。为了将交通信息上传到OSRM，我用./osrm-contract data.osrm--Segment-Speed-file updates.csv命令编写了一个小脚本(这里有更多详细信息)。\n数学时间：每半小时就有一个请求到这里来获取交通信息这是每小时两个请求，也就是说，一天是48个请求(24*2=48)，一个月大约是≈1.488(48*31=1.488)一年17.520。是的，我们这里有这些免费的要求，15年就够了。\n初步测试表明，该服务运行良好，但存在一个问题，这里给出的交通信息是“胡言乱语”，数据与OSRM格式不匹配。为了匹配信息，您需要在这里使用另一个服务进行地理编码+OSRM(用于获取地图上的点)。这大约是每月450.000个请求。后来，由于请求数量超过可用限制，OSRM被放弃。我们没有放弃，启用了Here Distance Matrix API，并临时删除了Google Distance Matrix API。这里的逻辑很简单：我们将坐标从A点发送到B点，并获得公交车到达时间。\n在我们将所有东西安装到测试服务器上并开始检查之后，我们收到了来自测试人员的第一个反馈。他们说，ETA读取的时间不正确。我们开始寻找问题，查看日志(我们使用data dog记录日志)、日志，测试表明一切都运行得很好。我们决定更详细地询问这个问题，结果发现，如果汽车在交通中停留15分钟，预计到达时间也会显示相同的时间。我们认为这是因为缓存存储了原始时间，并且在30分钟内不进行更新。\n我们开始寻找问题，一开始我们检查了Here距离矩阵API(名为We Go Here)网页版的数据，一切正常，我们收到了相同的ETA。这个问题也在谷歌地图服务上进行了检查。没有任何问题。服务本身就显示了这个预计到达时间。我们向测试员和企业解释了一切，他们接受了一切。\n我们的团队领导建议连接另一个ETA服务，并返回Google API作为备份选项，并使用切换服务的逻辑编写代码(如果请求超过空闲请求数，则需要切换)。\nval=getCount()//获取getMax()&lt；=val{//检查使用的服务的免费请求数限制newService=switchService/如果达到限制，切换服务返回newService(From，To)//给出新服务的逻辑\n我们找到了下面的Mapbox服务，连接并安装了它，它就可以工作了。因此，我们的预计到达时间有：\n“这里”-每月250,000次免费请求Google-10,000次免费请求/月Mapbox-100,000次免费请求/月。\n总是寻找替代方案，有时会发生这样的情况，企业不想为这项服务付钱，于是拒绝了。作为一名在这项服务上辛勤工作的开发人员，您应该将任务真正投入使用。本文描述了我们如何尝试连接更多服务以免费使用ETA，因为该企业不想为该服务付费。\n附注：作为一名开发人员，我相信如果工具做得很好，并且做得很好，那么您就可以为工具的服务付费(或者找到开源项目：D)。", "note_en": "This is a story on how to not spend even a penny by using three ETA (estimated time of arrival) services instead of one. Everything is based on my personal experience working as a back-end developer at GoDee project. GoDee is a start-up project that offers booking seats on a bus online. You could find more information about this project here:\n   GoDee is a public transportation service. Bus transportation by GoDee is more convenient than motorbikes common for Southeast Asia and cheaper than a taxi. The app-based system allows users to find an appropriate route, select the time, book the seat, and pay for the ride online. And one of the problems of GoDee is traffic jams that severely impact the user experience. Users get tired of waiting and get annoyed by trying to guess the bus arrival time. So, to make the commuting more convenient, it needed service to calculate the bus’s approximate arrival time, aka ETA.\n Developing ETA from scratch would take at least a year. So, to speed up the process, GoDee decided to implement the Google Distance Matrix API tool. Later they developed their own Pifia micro-service.\n   Over time, the business grew, and the user base increased. We encountered a problem with increasing requests in the Google Distance Matrix API.\n  Because every request costs money, Google API provides 10.000 free queries per month, after which every 1.000 queries are charged $20. At that time, we had about 150,000 requests per month.\n My mentor was very dissatisfied with that. And said that system should change cashing to store ETA every 30 minutes. At that time, the system sent requests to the Google API every 3 seconds to get fresh data. However, such a cashing algorithm wasn’t efficient, since minibuses were stuck in traffic. And so the distance only changed once every ten minutes. There was another nuance. For example, five users are asking for information about the same bus, and this is the same request. The cache solved this type of problem.\n   The cache worked, but not for long since GoDee grew even further and faced the same problem — the number of queries has increased again.\n It was decided to replace the Google API with OSRM. Basically, OSRM is a service for building a route based on ETA (this is a rough but the short description, if you need details, here is the  link).\n The Open Source Routing Machine or OSRM is a C++ implementation of a high-performance routing engine for the shortest paths in road networks.\n OSRM has one problem: it builds routes and calculates ETA without taking traffic into account. To solve this problem, I started looking for services that can provide information about traffic in the specified part of the city. HERE Traffic was providing the data I needed. After a little study of the documentation, I wrote a small code that gets traffic information every 30 minutes. And to upload traffic information to OSRM, I wrote a small script with the command  ./osrm-contract data.osrm --segment-speed-file updates.csv (more details  here).\n Math time: every half of the hour, there is a request to HERE to get traffic information this are two requests per hour, that is, a day is 48 requests (24 * 2 = 48) and a month is about ≈ 1.488 (48*31 = 1.488) a year 17.520. Yes, we have these free requests from HERE for 15 years would be enough.\n  Preliminary tests showed that the service works perfectly, but there is a problem, HERE gives traffic information in “gibberish” and the data does not match the OSRM format. In order for the information to fit, you need to use another service HERE for geocoding + OSRM (for getting points on the map). This is approximately 450.000 requests per month. Later, OSRM was abandoned because the number of requests exceeded the free limit. We didn’t give up and enabled the HERE Distance Matrix API and temporarily removed the Google Distance Matrix API. The logic HERE is simple: we send coordinates from point A to point B and get the bus arrival time.\n  After we installed everything on the test server and started checking, we received the first feedback from the testers. They said that ETA reads the time incorrectly. We started looking for the problem, looked at logs (we used Data dog for logs), logs, and tests showed that everything works perfectly. We decided to ask about the problem in a little more detail, and it turned out that if the car is in traffic for 15 minutes, ETA shows the same time. We decided that this is because of the cache because it stores the original time and does not update it for 30 minutes.\n We started looking for the problem, at the beginning we checked the data on the web version of the HERE Distance Matrix API (which is called we go here), everything worked fine, we received the same ETA. This problem was also checked on the google map service. There was no problem. The services themselves show this ETA. We explained everything to testers and businesses, and they accepted everything.\n Our team lead suggested connecting another ETA service and returning the Google API as a backup option and writing code with the logic of switching services (the switch was needed if the requests pass the free number of requests).\n  val = getCount() // getting the number of queries used  if getMax() &lt;= val { // checking for the limit of free requests for the service used newService = switchService(s) // // if the limit is reached, switch the service return  return newService(from, to) // giving the logic of the new service\n We found the following Mapbox service, connected it, installed it, and it worked. As a result, our ETA had:\n “Here” — 250,000 free requests per month Google — 10,000 free requests per month Mapbox — 100,000 free requests per month\n  Always look for alternatives, sometimes it happens that the business doesn&#39;t want to pay the money for the service and refuses it. As a developer who has worked hard on the service, you should bring the task to real use. This article describes how we were trying to connect more services for the free use of ETA because the business did not want to pay for the service.\n P.S. As a developer, I believe that if the tool is good and does its job well, then you can pay for the tool’s services (or find Open source projects :D).", "posttime": "2020-07-06 15:01:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,free,服务", "title": "如何使用3项免费ETA服务每月免费处理超过35万次请求", "title_en": "How to process more than 350K requests per month free using 3 free ETA services", "transed": 1, "url": "https://blog.maddevs.io/how-to-make-three-paid-eta-services-one-free-6edc6affface", "via": "", "real_tags": ["免费", "free", "服务"]}, {"category": "", "categoryclass": "", "imagename": "c5c5ede7180a004ad5f4cd05a72b8e42.jpeg", "infoid": 1010068, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这场已导致全球50多万人死亡的大流行已经过去了六个月，现在似乎是时候更新我们对新冠肺炎传播方式的了解了。由239名科学家组成的小组本周将发表一封公开信，呼吁世界卫生组织考虑到空气传播是新冠肺炎传播的一个重要因素。一个由200多名科学家组成的小组表示，世卫组织太不愿意更新官方对传播的看法，这种观点淡化了空气传播的风险。如果该组织确实更新了其观点，其影响将是巨大的，需要对现有的遏制病毒的努力进行重大调整。\n世界卫生组织和疾病预防控制中心继续声称，当涉及到新冠肺炎时，普通公众要担心两种传播方式。一种是吸入附近感染者的飞沫，另一种是触摸被病毒污染的表面，然后触摸你的眼睛、鼻子或嘴巴。现在，这组来自32个国家的科学家表示，世卫组织需要认识到，病毒在封闭空间的空气中挥之不去，也可以通过这种方式感染人。尽管科学家们承认这种冠状病毒不是容易通过空气传播的麻疹，但风险是真实存在的，特别是在通风不良的房间和像公共交通这样的狭小空间。\n目前，世卫组织表示，空气传播实际上只是插管等医疗程序后的一个令人担忧的因素。该组织感染预防委员会的成员表示，虽然它可以发挥一些作用，但并不是真正意义重大，预防措施将是不可行的。世卫组织感染控制技术负责人贝尼德塔·阿莱格兰齐博士告诉“纽约时报”：“特别是在过去的几个月里，我们已经多次表示，我们认为空气传播是可能的，但肯定没有确凿甚至明确的证据支持。”“对此存在强烈的争论。”\n然而，一些科学家坚持认为，世卫组织忽视了最新的研究，部分原因是官僚问题使该组织在面对新证据时很难改变做法。他们说，有很多例子，包括屠宰场和餐馆的感染，表明空气传播是一个真正令人担忧的问题。一位在信上签名的专家向泰晤士报解释说，问题的一部分是世卫组织依赖于医院的研究，这些研究表明空气中几乎没有病毒。但在其他建筑中，“空气交换率通常要低得多，允许病毒在空气中积累。”\n在这场大流行中，世卫组织被指责适应新证据的速度太慢，这并不是第一次。最臭名昭著的例子是，人们在公共场所和其他人周围时应该遮住鼻子和嘴巴的建议得到了多么缓慢的支持。人们也迟迟没有意识到从没有症状的人那里传播的重要性。\n像您这样的读者使我们的工作成为可能。帮助我们继续提供您在其他地方找不到的报道、评论和批评。\n加入Slate Plus。\n会合", "note_en": "Six months into a pandemic that has killed more than half a million people around the world, it seems it may be time to update what we know about how COVID-19 is transmitted. A group of 239 scientists  will publish an open letter this week calling on the World Health Organization to take into account that airborne transmission is a significant factor in how COVID-19 spreads. A group made up of more than 200 scientists say the WHO is being too reluctant to update the official view on transmission that downplays the risk of airborne transmission. If the organization does update its view, the implications would be huge and would require a major adjustment to existing efforts to contain the virus.\n    The WHO and the Centers for Disease Control and Prevention continue to claim that when it comes to COVID-19, the general public has to worry about two types of transmission. One involves inhaling droplets from an infected person who is close by and the other involves touching a surface that is contaminated with the virus and then touching your eyes, nose or mouth. Now this group of scientists from 32 countries say the WHO needs to recognize that the virus lingers in the air in closed spaces and can also infect people that way. Although the scientists acknowledge that the coronavirus isn’t measles that can easily transmit through the air, the risk is real,  particularly in poorly ventilated rooms and confined spaces like public transportation.\n        For now, the WHO has said airborne transmission is really only a factor of concern after medical procedures such as intubations. Members of the organization’s infection prevention committee have said that while it could play some role it was not truly significant and measures to guard against it would be unfeasible. “Especially in the last couple of months, we have been stating several times that we consider airborne transmission as possible but certainly not supported by solid or even clear evidence,” Dr. Benedetta Allegranzi, the WHO’s technical lead on infection control,  tells the New York Times. “There is a strong debate on this.”\n    Some scientists though insist that the WHO is  ignoring the latest research in part due to bureaucratic issues that make it difficult for the organization to shift gears when faced with new evidence. They say there are plenty of examples, including infections in slaughterhouses and restaurants, that show airborne transmission is a real concern. One expert who signed the letter explained to the Times that part of the problem is that the WHO relies on studies from hospitals that show there is little virus in the air. But in other buildings “the air-exchange rate is usually much lower, allowing virus to accumulate in the air.”\n  This is hardly the first time in this pandemic that the WHO has been accused of being too slow to adapt to new evidence. The most notorious example of this is how slow it was to back the suggestion that people should cover their nose and mouth while out in public and around other people. It has also been slow to recognize the importance of transmission from people who do not have symptoms.\n  Readers like you make our work possible. Help us continue to provide the reporting, commentary, and criticism you won’t find anywhere else.\n  Join Slate Plus\n   Join", "posttime": "2020-07-06 15:01:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,科学家,coronavirus,冠状病毒,呼吁", "title": "数百名科学家呼吁世卫组织认识到冠状病毒在空气中传播的风险", "title_en": "Hundreds of Scientists Call on WHO to Recognize Coronavirus Airborne Risk", "transed": 1, "url": "https://slate.com/news-and-politics/2020/07/scientists-call-who-recognize-coronavirus-airborne-risk.html", "via": "", "real_tags": ["病毒", "科学家", "冠状病毒", "呼吁"]}, {"category": "", "categoryclass": "", "imagename": "6a12042182198387f002afbe21938793.jpg", "infoid": 1010067, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与其他旅游和交通相关业务一样，优步的叫车业务也受到了新冠肺炎疫情的负面影响，因为全美各地都有就地避难所的订单。然而，按需送货的人数有所增长，人们依靠优步Eats(Uber Eats)等服务足不出户就能拿到食物。根据优步上一份收益报告，优步的叫车总预订量有所下降，但其外卖服务在第一财季的总销售额增长了54%。\n根据之前的报道，优步今年早些时候曾提出收购另一家按需送货服务公司GrubHub，但在交易失败后，优步与PostMates进行了接洽。彭博社(Bloomberg)报道称，优步和Postmate实际上断断续续地交谈了大约四年，但大约一周前，谈判变得更加激烈。\n在与优步的谈判陷入僵局后，GrubHub最终被Just Eat Takeway以73亿美元的交易收购。\nPostmate的估值为24亿美元，比GrubHub小。该公司于2019年2月提交上市申请，但因市场状况“起伏不定”而决定暂缓上市。\n如果这笔交易获得通过，美国外卖市场的主要竞争对手将是优步Eats/PostMates vs GrubHub/Takeaway vs DoorDash。\n在其他国家，像Grab这样的公司也开始建设按需送货服务，以弥补叫车预订减少造成的损失。例如，Grab对印尼(其主要市场)和其他东南亚国家的在家订单做出了回应，将叫车司机重新部署到食品和必需品的按需送货上。", "note_en": "Like other travel- and transportation-related businesses, Uber’s ride-hailing segment has been negatively impacted by the COVID-19 pandemic, due to shelter-in-place orders throughout the United States. On-demand delivery, however, has grown, with people relying on services like  Uber Eats   to get food without leaving their homes. According to its last earnings report, Uber’s ride-hailing gross bookings dropped, but its food delivery service  saw gross sales growth of 54% during its first fiscal quarter.\n According to previous reports, Uber  made an offer to buy Grubhub, another on-demand delivery service, earlier this year, but after that deal fell through, it approached Postmates. Bloomberg reports that Uber and  Postmates   have actually talked on and off for about four years, but negotiations became more intense about a week ago.\n  Grubhub ended up being acquired by Just Eat Takeway in a deal worth $7.3 billion after its negotiations with Uber stalled.\n  With a valuation of $2.4 billion, Postmates is a smaller company than Grubhub. The company filed to go public in  February 2019, but decided to hold off because of  “choppy market” conditions.\n If the deal goes through, the main competitors in the American food delivery market would be Uber Eats/Postmates versus Grubhub/Takeaway versus DoorDash.\n In other countries, companies like Grab have also begun building out their on-demand delivery services to make up for losses from fewer ride-hailing bookings. For example, Grab responded to stay-at-home orders in Indonesia (its main market) and other Southeast Asian countries by re-deploying ride-hailing drivers to on-demand deliveries for food and essential items.", "posttime": "2020-07-06 14:07:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "报道,reportedly,优步", "title": "\n据报道，优步同意以26.5亿美元收购Postmate", "title_en": "\n\t\t\t\tUber reportedly agrees to acquire Postmates for $2.65 billion\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/05/uber-reportedly-agrees-to-acquire-postmates-for-2-65-billion/", "via": "", "real_tags": ["报道", "优步"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010065, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天的许多大公司都是软件垄断企业，他们免费赠送自己的产品以获得垄断地位，然后一旦获胜就做最可怕的事情。(以前，以前。)。我们能为此做些什么吗？\n不幸的是，“你就是产品”是一种流行的商业模式，这是有原因的：没有它们，像Facebook这样的企业将真的很难支撑。\nFacebook向用户收费无异于自杀，因为它的全部卖点就是每个人都在使用它，而“每个人”都讨厌付钱。在美国，Facebook每人的广告收入超过25美元(来源)。你能想象如果他们试图向人们收取每年25美元的费用而不是广告吗？\n即使在边际上，任何让Facebook用户付出代价的事情都会降低其剩余用户的价值--这是一个负面的反馈循环。用户为其他用户创造价值的任何其他网站也是如此，比如Twitter、Craigslist、Yelp或维基百科(Wikipedia)。(这些最受欢迎的网站都是停滞不前的，这不是偶然的！)。\n事实上，这是网络效应和低边际成本的根本问题。如果一家公司想要保持网络效应，他们需要尽可能多的用户。如果他们的边际成本很低，那么获得用户最简单的方法就是免费赠送产品。要做到这一点，他们必须得到其他人的支付。当他们开始从别人那里得到报酬时，他们不可避免地会开始优先考虑那个人的利益。\n从历史上看，对于其他网络效应企业，我们已经通过几种不同的方式解决了这个问题：\n到目前为止，对于科技垄断企业来说，人们似乎主要关注分拆-例如Instagram/Whatsapp的Facebook-但标准化在过去似乎产生了更好的结果。(与国家电网相比，我更喜欢电子邮件和网络)我很有兴趣看到更多关于这个选项的探索！", "note_en": "Many large companies today are software monopolies that give their product away for free to get monopoly status, then do  the  most  horrible  things  once  they’ve  won. ( Previously,  previously.) Can we do anything about this?\n Unfortunately, “you’re the product” is a popular business model for a reason: businesses like Facebook would be really hard to support without them.\n Facebook would be suicidal to charge its users money, because its entire selling point is that everyone uses it, and “everyone”  hates paying money. In the US, Facebook makes over $25 per person on ads ( source). Can you imagine if instead of ads they tried to charge people $25 a year?\n Even on the margin, anything that costs Facebook users also makes it less valuable for its remaining users—it’s a negative feedback loop. The same goes for any other site where users create value for other users, like Twitter or Craigslist or Yelp or Wikipedia. (It’s not an accident that these are some of the most stagnant popular websites!)\n In fact, this is a fundamental problem with  network effects and low marginal costs. If a company wants to maintain a network effect, they need as many users as possible. If their marginal cost is low, then the easiest way to get users is to give the product away. To do that, they have to get paid by someone else. And when they start getting paid by someone else, they’ll inevitably start prioritizing that person’s interests.\n Historically with other network-effect businesses, we’ve addressed this in a few different ways:\n  So far for tech monopolies, people seem to be focused mostly on breakups—e.g. Facebook from Instagram/Whatsapp—but standardization seems to have produced much better outcomes in the past. (I like email and the Web a lot more than National Grid&amp;mldr) I’d be interested to see more exploration of that option!", "posttime": "2020-07-06 13:30:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "应对,effect", "title": "我们应该如何应对网络效应垄断？", "title_en": "What should we do about network-effect monopolies", "transed": 1, "url": "https://www.benkuhn.net/nwe/", "via": "", "real_tags": ["应对", "effect"]}, {"category": "", "categoryclass": "", "imagename": "af7bdb2d0332f806183572bd064208a2.png", "infoid": 1010064, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据一位知情人士透露，优步(Uber Eats)的所有者优步(Uber)批准以约26.5亿美元的价格全股票收购规模较小的餐厅外卖竞争对手Postmate，证实了彭博社(Bloomberg)和其他公司早些时候的报道。结果是：在监管部门批准后，当交易完成时，优步Eats将获得一些市场份额，但这可能不会改变竞争中的游戏规则……。\n记者、科技投资者和高管喜欢认为自己处于世界的中心。本周，根据Twitter上的对话，他们短暂地感觉到他们是这样的。\n几个月来，少数直言不讳的风险资本家一直在抨击记者：1)淡化今年早些时候的冠状病毒，2)通常只是可怕的交通寻求者，世界会更好……", "note_en": "Uber, owner of Uber Eats, approved an all-stock takeover of smaller restaurant-food delivery rival Postmates for around $2.65 billion, according to a person with knowledge of the situation, confirming earlier reports from Bloomberg and others. The upshot: Uber Eats will gain some market share when the deal closes following regulatory approval, but it likely won’t be a game changer in the race to...\n    Reporters, tech investors and executives like to think they are at the center of the world. And this week, based on conversations on Twitter, it briefly felt like they were.\n For months, a handful of outspoken venture capitalists have been attacking journalists for 1) downplaying coronavirus earlier this year and 2) just generally being horrible traffic-seekers the world would be better ...", "posttime": "2020-07-06 13:29:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,支付,postmates,世界", "title": "优步/Postmate的交易意味着DoorDash在一些市场的整合不需要支付任何费用", "title_en": "Uber/Postmates deal meant DoorDash pays nothing for consolidation in some market", "transed": 1, "url": "https://www.theinformation.com/briefings/69d499", "via": "", "real_tags": ["交易", "支付", "postmates", "世界"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010063, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您的终端可以显示颜色，但大多数比较工具不能很好地利用它。通过突出显示更改，icdiff可以在不妨碍您的情况下向您显示相似文件之间的差异。这对于识别和理解现有线路中的微小更改特别有帮助。icdiff的目标不是试图成为所有情况下的不同替代品，而是成为一种你可以接触到的工具，以便更好地了解当它与diff相比突然变得显而易见时发生了什么变化。curl-s https://raw.githubusercontent.com/jeffkaufman/icdiff/release-1.9.2/icdiff\\|sudo tee/usr/local/bin/icdiff&gt；/dev/NULL\\&amp；&amp；sudo chmod Ugo+rx/usr/local/bin/icdiff#或使用pip安装：pip install icdiff#or(ubuntu≥17.10；debian≥9)：sudo apt-get install icdiff#or(仅限mac，取决于自制软件)：BREW更新", "note_en": "Your terminal can display color, but most  diff tools don&#39;tmake good use of it. By highlighting changes,  icdiff canshow you the differences between similar files without getting in theway. This is especially helpful for identifying and understandingsmall changes within existing lines. Instead of trying to be a  diff replacement for allcircumstances, the goal of  icdiff is to be a tool you canreach for to get a better picture of what changed when it&#39;s notimmediately obvious from  diff. curl -s https://raw.githubusercontent.com/jeffkaufman/icdiff/release-1.9.2/icdiff \\ | sudo tee /usr/local/bin/icdiff &gt; /dev/null \\ &amp;&amp; sudo chmod ugo+rx /usr/local/bin/icdiff# Or install with pip:pip install icdiff# Or (ubuntu ≥ 17.10; debian ≥ 9):sudo apt-get install icdiff# Or (mac only, depends on  homebrew):brew update &amp;&amp; brew install icdiff", "posttime": "2020-07-06 13:11:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "并排,side,icdiff", "title": "Icdiff：并排突出显示的命令行差异", "title_en": "Icdiff: Side-by-side highlighted command line diffs", "transed": 1, "url": "https://www.jefftk.com/icdiff", "via": "", "real_tags": ["并排", "side", "icdiff"]}, {"category": "", "categoryclass": "", "imagename": "cff2e44458ce5eb8666856244a7f8bc1.jpg", "infoid": 1010062, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PimEyes是一个强大的人脸搜索引擎，可以帮助你在互联网上找到自己的脸。PimEyes只关注脸部。图像的构图和颜色并不重要。我们的引擎不比发型，重要的是五官。它支持各种场景-例如，验证人们的访问权限，保护隐私不受欺诈者或未经授权的照片使用的影响。\n上传的照片必须包含一个人的脸。每张照片上的脸都必须清晰可见。\n每次PimEyes遇到与你要找的面孔相似的面孔时，都会获得溢价并收到一封电子邮件通知。\n当我们找到和你相似的面孔就拿到报告。这很简单。是免费的。\n了解更多。\n最佳搜索结果仅对高级会员可用。使用高级访问，您将提高搜索质量并解锁所有结果。\n获得溢价", "note_en": "PimEyes is a powerful face search engine that will help you find your face in the Internet. PimEyes focuses only on faces. Composition and colors of the image are not important. Our engine does not compare haircut, only facial features matter. It supports various scenarios - for example, authenticate people for access, protect privacy against scammers or unauthorized photo usage.\n Uploaded photos must contain faces of  one person. Face on every photo must be  clearly visible.\n                                                                        Get premium and receive an  e-mail notification every time PimEyes come across the face similar to one you are looking for.\n  Get the report when we find face similar to yours. It’s simple. It’s free.\n  Learn more\n The best search results are available only for premium members. With premium access you will improve quality of search and unlock all results.\n  Get premium", "posttime": "2020-07-06 12:52:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上传,upload,面孔", "title": "PimEyes：上传你的照片，查找你的脸部图像出现在网上的哪里", "title_en": "PimEyes: Upload Your Photo and Find Where Your Face Image Appears Online", "transed": 1, "url": "https://pimeyes.com/", "via": "", "real_tags": ["上传", "upload", "面孔"]}, {"category": "", "categoryclass": "", "imagename": "8833c1f9f343acbc41c3d370490bc1ac.jpg", "infoid": 1010061, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "幼年大白鲨的胃部竞赛表明，它们花大量时间在海底巡逻觅食。\n背鳍划破海面的图像是标志性的。但是，研究澳大利亚海岸外幼年大白鲨的胃部竞争的科学家们在了解到这种捕食者似乎花了大量时间在海底巡逻时，大吃一惊。\n它们的饮食以鱼为主，这对幼年白鲨来说并不出乎意料。我们发现的最重要的猎物物种是东澳大利亚鲑鱼。\n悉尼大学研究生理查德·格兰杰。他和他的团队对50多条幼年白鲨的胃内容物进行了分类，这些幼年白鲨在被旨在保护游泳者的防鲨网缠住后死亡。\n总体而言，令人意想不到的发现是底栖鱼的多样性和重要性。像观星者这样把自己埋在沙子里的东西，它们看起来都很奇怪。还有扁平头。还有黄貂鱼。\n事实上，人们对大白鲨饮食的细节并没有很好的了解。正如格兰杰指出的那样，鲨鱼在世界各地都受到保护。因此，大多数研究人员通过化学标记来估计他们的饮食，他们可以通过采集少量皮肤样本来合乎道德地获得这些标记。这些测量表明捕食者在食物链的哪个层面上进食，而不是真正构成它们食物的动物。\n有相当多的证据表明许多不同的动物，所以即使是肉食动物，杂食动物，草食动物…。根据特定的营养平衡自行选择不同的猎物或食物。\n格兰杰希望，通过进一步了解幼年白鲨喜欢吃什么，他可以开始拼凑出它们是如何以及为什么做出捕食性选择的。这项研究发表在“海洋科学前沿”杂志上。[Richard Grainger等人，幼年白鲨(Carcharodon Carcharas)的食物组成和营养生态位宽度变异性]。\n了解和预测鲨鱼何时可能在某些地区更为丰富将是所有这一切的最终目标。\n避免或减轻人与鲨鱼的冲突意味着要了解鲨鱼的营养目标。如果研究人员能够预测鲨鱼可能在何时何地捕猎，他们就可以更好地保护人类不被咬伤-以及鲨鱼不被杀死。", "note_en": "The stomach contests of young great white sharks showed that they spend a lot of time patrolling the sea floor for meals.\n The image of a dorsal fin cutting through the sea surface is iconic. But scientists studying the stomach contests of young great white sharks off the coast of Australia were in for a surprise when they learned that the predators seem to spend a lot of time patrolling the sea floor.\n  &#34;They have a predominantly fish-based diet, which is not unexpected for juvenile white sharks. The most important prey species we identified was Eastern Australian salmon.&#34;\n  University of Sydney graduate student Richard Grainger. He and his team sorted through the stomach contents of more than fifty juvenile white sharks that died after being entangled in shark exclusion nets meant to protect swimmers.\n  &#34;The overall unexpected finding was just the diversity and importance of bottom dwelling fishes. Things like stargazers, which bury themselves in the sand, they&#39;re quite strange looking fish. And flathead. But also stingrays.&#34;\n  People actually did not have a good idea of the particulars of great white shark diets. As Grainger points out, the sharks enjoy protections throughout the world. So most researchers estimated their diets through the chemical markers that they can ethically access by taking small skin samples. These measurements indicate at what level of the food chain the predator is feeding, but not the actual critters that make up their meals.\n  &#34;There&#39;s quite a lot of evidence that lots of different animals, so even carnivores, omnivores, herbivores…self-select different prey or food based on a particular balance of nutrients.&#34;\n  Grainger hopes that by further understanding what juvenile white sharks like to eat, he can begin to piece together how and why they make their predatory choices. The study was published in the journal  Frontiers in Marine Science. [Richard Grainger et al,  Diet Composition and Nutritional Niche Breadth Variability in Juvenile White Sharks (Carcharodon carcharias)]\n  &#34;Understanding and predicting when sharks might be more abundant in certain areas would be an ultimate end goal of all of this.&#34;\n  Avoiding or mitigating human-shark conflicts means understanding the sharks&#39; nutritional goals. And if researchers can anticipate where and when sharks are likely to spend their time hunting, they can better protect humans from getting bitten—and sharks from getting killed.", "posttime": "2020-07-06 12:16:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大白鲨,great,鲨鱼", "title": "年轻的大白鲨在地板上吃东西", "title_en": "Young Great White Sharks Eat Off the Floor", "transed": 1, "url": "https://www.scientificamerican.com/podcast/episode/young-great-white-sharks-eat-off-the-floor/", "via": "", "real_tags": ["大白鲨", "great", "鲨鱼"]}, {"category": "", "categoryclass": "", "imagename": "0cec07aa4b58b441247d9503a718f74f.jpg", "infoid": 1010060, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这不是莉迪亚第一次玩弄信用了。该公司已经与Banque Casino合作，允许用户在100欧元到1000欧元之间借款。但这项功能仅限于短期信贷，因为您必须分三期偿还所有费用。\n这一次，你可以借更多的钱，而且你有更多的时间偿还贷款。当涉及到利益时，莉迪亚会尽量做到透明。而且不收手续费或提前还款。\n与第一款信贷产品相比，你不能马上借钱。你在应用程序中申请贷款，并在24小时内得到答复。如果你接受这个提议，你有七天的时间改变主意--这是法国的监管要求。然后你会收到你账户上的钱。\n通过提供两种不同的信贷产品，Lydia希望涵盖更多的用例。如果发生意想不到的事情(你的笔记本电脑坏了，你必须预订紧急航班，等等)，你可以在几秒钟内借到多达1000欧元。\n你在你的Lydia账户上收到钱，你可以立即开始使用虚拟卡、Apple Pay、Google Pay、Samsung Pay、Lydia的借记卡或Lydia的P2P支付。\n即时信用额度的费用相当高，因为你需要支付3.13%的利息和6.90至19.90欧元的一次性费用才能立即收到这笔钱，这取决于你借了多少钱。\n如果你计划大笔购买，但你可以等一周，你可以通过年轻的信贷提供新的信贷服务。这并不是青年信贷第一次与另一家金融科技初创公司合作提供集成信贷产品。例如，n26还在法国的Young Credit提供信贷额度。\nLydia最初是一款P2P支付应用，在欧洲拥有350万用户。它最近筹集了由腾讯牵头的4500万美元融资。这家初创公司现在想要建立一个金融产品市场。而将Young Credit整合到这款应用程序中似乎符合这一战略。", "note_en": "This isn’t the first time  Lydia   is playing around with credit. The company  already partnered with Banque Casino to let users borrow between €100 and €1,000. But that feature was limited to short-term credit as you had to reimburse everything over three installments.\n This time, you can borrow more money and you have more time to pay back your loan. Lydia will try to be as transparent as possible when it comes to interests. And there’s no fee in case or early repayment.\n  Compared to the first credit product, you can’t borrow money instantly. You apply for a loan in the app and get an answer within 24 hours. If you accept the offer, you have seven days to change your mind — it’s a regulatory requirement in France. You then receive money on your account.\n By offering two different credit products, Lydia wants to cover more use cases. If something unexpected happens (your laptop broke down, you have to book an emergency flight, etc.), you can borrow as much as €1,000 in just a few seconds.\n You receive the money on your Lydia account and you can start using it instantly using a virtual card, Apple Pay, Google Pay, Samsung Pay, Lydia’s debit cards or Lydia’s peer-to-peer payments.\n Fees on instant credit lines are pretty high as you pay 3.13% in interests and a one-time fee of €6.90 to €19.90 to receive the money instantly depending on how much you borrow.\n If you’re planning a big purchase but you can wait a week, you can go through the new credit offering with  Younited Credit  . This isn’t the first time Younited Credit offers an integrated credit product with another fintech startup. For instance, N26  also offers credit lines with Younited Credit in France.\n Lydia started as a peer-to-peer payment app with 3.5 million users in Europe. It recently raised a  $45 million funding round led by Tencent. The startup now wants to build a marketplace of financial products. And integrating Younited Credit in the app seems in line with that strategy.", "posttime": "2020-07-06 12:16:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "信贷,credit,lydia", "title": "\n利迪亚与青年信贷公司合作扩大信贷供应", "title_en": "\n\t\t\t\tLydia expands credit offering in partnership with Younited Credit\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/05/lydia-expands-credit-offering-in-partnership-with-younited-credit/", "via": "", "real_tags": ["信贷", "credit", "lydia"]}]