[{"category": "", "categoryclass": "", "imagename": "bba1712f2d6f70278ff0108ed690ebf8.png", "infoid": 1014028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上周，欧盟法院(CJEU)裁定，由于担心美国政府获取欧盟个人数据，监管个人数据从欧盟向美国转移的新欧盟-美国隐私盾牌(EU-US Privacy Shield)无效。依赖欧盟-美国隐私盾牌的公司现在必须有一个具有足够隐私保护的替代基础，才能将个人数据转移到美国。这不会影响GitHub对开发者隐私的承诺，也不会影响我们全球隐私实践的实力。我们对这项裁决的回应集中在为我们的用户和客户提供不间断的跨大西洋开发者协作支持，包括跨境转移个人数据。\n在裁决之前，GitHub一直依赖欧盟-美国隐私盾牌(EU-US Privacy Shield)和瑞士-美国隐私盾牌框架(Swiss-US Privacy Shield Framework)来处理从欧盟、英国和瑞士传输的开发商和客户的个人数据。应客户要求，我们还根据标准合同条款(SCCS)为客户提供了数据传输方面的重叠保护。SCC-根据CJEU的最新裁决仍然有效-是传输个人数据的实体之间的合同承诺，对它们具有约束力，以保护此类数据的隐私和安全。\n根据新裁决，GitHub现在依靠SCC为我们所有的开发人员和客户建立必要的数据保护，这反映在我们更新的客户数据保护条款和隐私声明中。无论我们是代表我们的客户充当处理器，还是承担数据控制员的义务，我们都有机制支持来自欧洲经济区、英国和瑞士的个人数据的持续流动。\nGitHub继续为我们所有的开发者和客户提供高标准的隐私保护，包括根据欧盟的一般数据保护条例(GDPR)对全球所有GitHub用户实施严格的个人隐私保护，无论他们来自哪个国家或地点(请参阅我们的隐私声明，了解GitHub的全球隐私实践)。这些现有的承诺超出了SCC的要求，我们的透明度报告还为开发人员和客户增加了透明度，并注意到GitHub如何负责任地处理合法授权的政府数据请求。\n我们认识到监管框架的更多变化是意料之中的，并将一如既往地保持与要求的协调，以便我们可以迅速对我们的合规实践进行任何必要的调整，并继续维护国际开发人员合作。GitHub为我们向世界各地的开发人员和客户提供的通知、选择、透明度、责任、安全性、数据完整性和追索权感到自豪。我们致力于在我们开展业务的任何地方遵守适用的数据隐私法，并将根据未来的任何发展继续推进对开发人员和客户的保护。", "note_en": "Last week, the Court of Justice of the European Union (CJEU)  ruled the  EU-US Privacy Shield, a mechanism governing personal data transfers from the EU to the US, is invalid due to concerns about US government access to EU personal data. Companies that relied on the EU-US Privacy Shield now must have an alternative basis with sufficient privacy protections to be able to transfer personal data to the United States. This does not affect GitHub’s commitment to developer privacy or the strength of our global privacy practices. Our response to this ruling is focused on providing uninterrupted support for trans-Atlantic developer collaboration for our users and customers, including the transfer of personal data across borders.\n Prior to the ruling, GitHub had relied on the EU-US Privacy Shield and Swiss-US Privacy Shield frameworks for processing developers’ and customers’ personal data transferred from the EU, the UK, and Switzerland. Upon request, we also provided customers with overlapping protections under  Standard Contractual Clauses (SCCs) for data transfer. SCCs—which remain valid under the latest CJEU ruling—are contractual commitments between entities transferring personal data, binding them to protect the privacy and security of such data.\n In compliance with the new ruling, GitHub is now relying on SCCs to establish necessary data protection for  all of our developers and customers, as reflected in our updated customer data protection terms and Privacy Statement. Regardless of whether we are acting as a processor on behalf of our customers or taking on the obligations of a data controller, we have the mechanisms in place to support continued flows of personal data from the European Economic Area, the UK, and Switzerland.\n GitHub continues to provide a high standard of privacy protection to all our developers and customers, including the application of stringent individual privacy protections under the European Union’s General Data Protection Regulation (GDPR) to all GitHub users worldwide, regardless of their country of origin or location (see our Privacy Statement for  GitHub’s Global Privacy Practices). These existing commitments go beyond the requirements of the SCCs, and our  transparency reporting also gives developers and customers added transparency and notice about how GitHub responsibly handles legally authorized government requests for data.\n We recognize additional changes to the regulatory framework are to be expected, and, as always, will remain attuned to requirements so we can quickly make any necessary adjustments to our compliance practices and continue to safeguard international developer collaboration. GitHub is proud of the levels of notice, choice, transparency, accountability, security, data integrity, and recourse we provide to our developers and customers worldwide. We are committed to complying with the applicable data privacy laws wherever we do business, and we will continue to advance our protections for developers and customers based on any future developments.", "posttime": "2020-07-25 04:07:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,开发人员,trans,客户", "title": "保护跨大西洋开发人员协作", "title_en": "Safeguarding trans-Atlantic developer collaboration", "transed": 1, "url": "https://github.blog/2020-07-23-safeguarding-trans-atlantic-developer-collaboration/", "via": "", "real_tags": ["开发", "开发人员", "trans", "客户"]}, {"category": "", "categoryclass": "", "imagename": "c5ec5319a04dfc92c41cbda8e46f8318.jpg", "infoid": 1014027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份新的报告称，谷歌几年来一直在收集从Android手机收集的应用程序使用数据，以开发和推进自己的竞争应用程序。\n据“信息报”报道，这个名为Android Lockbox的项目收集敏感的Android用户数据，供谷歌内部使用，至少从2013年开始生效。\n消息人士告诉“信息报”，一个追踪谷歌第一方应用全球使用情况的内部团队也利用第三方应用的密码箱数据向高管展示谷歌服务与竞争对手相比表现如何。这些数据本月早些时候在印度使用，谷歌计划在印度推出TikTok的竞争对手应用程序。\n这些信息是通过谷歌移动服务(Google Mobile Services)收集的，谷歌移动服务是谷歌、Chrome、Gmail、Google Drive和谷歌地图等应用程序和API的集合，这些应用程序和API通常预装在Android中。\n谷歌在接受“信息报”采访时表示，它确实会获取其他Android开发者应用程序的使用数据，但只能通过一个API获取，该API自2014年以来也向第三方开发者开放。然而，虽然API允许开发者访问安装了他们的应用程序的手机的信息，但谷歌对全球范围内广泛的Android手机池有更广泛的洞察力。\n谷歌的一名代表告诉“信息报”，API没有获得任何关于应用内活动的信息，我们收集的这些数据是向用户披露的，并可由用户控制，但没有评论谷歌如何利用这些数据或任何其他数据来研究或开发其他应用的竞争对手。\n如果信息公司的指控属实，反垄断监管机构可能会向谷歌提出一大堆问题。\n正如我们在Ars这里所解释的那样，反垄断法不仅仅是关于垄断的。它还涉及一大堆根据法律被认为是反竞争的行为。利用你作为世界上最大的公司之一的实力来挤压那些最终可能成为可行的、严肃的竞争对手的初创企业，是这些反竞争行为之一，监管机构不喜欢这样做。\n美国最大的四家科技公司-谷歌(Alphabet)、亚马逊(Amazon)、苹果(Apple)和Facebook-目前都在接受州、联邦和国际的反垄断调查，调查这些公司是否-如果是的话，在多大程度上-通过卑鄙的非法策略增长和维持其市场力量。\n尤其是Facebook，因为使用竞争对手数据的方式几乎与新报告指责谷歌的方式完全相同，而受到了密切关注。这家社交巨头使用它收购的名为Onavo的VPN重新定向通过Facebook服务器的流量，在那里可以记录和分析流量。这些数据让Facebook看到了哪些竞争对手的应用程序越来越受欢迎，这样它就可以收购这些初创公司或推出竞争对手。\nSnapchat就是这些竞争对手之一。去年秋天，有报道称，Snap保留了一份名为“伏地魔计划”(Project Voldemort)的档案，记录了Facebook最初试图收购它，后来在收购失败后，复制Snapchat的关键功能。\n人们普遍认为，美国调查人员也在调查苹果如何利用iOS应用商店的数据为自己的软件开发提供信息。在Spotify去年对苹果提起诉讼后，欧盟也在调查苹果对其第一方应用程序的特权方式。", "note_en": "Google for several years has collected app-usage data collected from Android phones to develop and advance its own competing apps, a new report alleges.\n The project, called Android Lockbox, &#34;collects sensitive Android user data&#34; for use within Google and has been in effect since at least 2013,  The Information reports.\n An internal team that tracks the worldwide usage of Google&#39;s first-party apps &#34;also has used Lockbox data on third-party apps to show executives how Google services were performing compared to rivals,&#34; sources told The Information. The data was used earlier this month in India, where Google planned to roll out a competitor app to TikTok.\n The information is collected through Google Mobile Services, the  collection of apps and APIs such as Google, Chrome, Gmail, Google Drive, and Google Maps that usually comes pre-installed with Android.\n Google told The Information that it does access usage data on other Android developers&#39; apps but only through an API that has also been available to third-party developers since 2014. While the API grants developers access to information about phones on which their apps are installed, however, Google has much wider insight into the broad pool of all Android phones globally.\n A Google representative told The Information, &#34;The API doesn&#39;t obtain any information about in-app activity and our collection of this data is disclosed to and controllable by users&#34; but did not comment on how Google uses that or any other data to research or develop competitors to other apps.\n  If The Information&#39;s allegations are accurate, antitrust regulators are likely to have a whole lot of questions for Google.\n As we here at Ars have  explained before, antitrust law isn&#39;t just about monopolies. It&#39;s also about a broad bucket of behaviors that are considered  anticompetitive under the law. Using your power as one of the biggest companies in the world to put the squeeze on start-ups who could eventually become viable, serious competitors is one of those anticompetitive behaviors, and regulators don&#39;t like it.\n Four of the biggest US tech firms—Alphabet (Google), Amazon, Apple, and Facebook—are all under a bevy of state, federal, and international antitrust probes at this moment, investigating whether—and, if so, to what extent—those companies grew and maintained their market power through underhanded, unlawful tactics.\n Facebook in particular has been scrutinized for using data on competitors in almost exactly the way the new report accuses Google of doing. The social giant used a VPN it acquired, called Onavo, to redirect traffic through Facebook servers, where it could be logged and analyzed. That data let Facebook see what competition apps were growing in popularity so that it could then either buy out those start-ups or launch competitors.\n One of those competitors was Snapchat. Last fall, reports surfaced that Snap for several years kept  a dossier, called Project Voldemort, documenting Facebook&#39;s attempts first to acquire it and later, after acquisition didn&#39;t work, to copy Snapchat&#39;s key features.\n US investigators are also widely assumed to be probing the way in which Apple can  leverage data from the iOS App Store to inform its own software development. The EU is also probing the way Apple privileges its first-party apps after Spotify last year  filed a complaint against the company.", "posttime": "2020-07-25 03:44:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,android,reportedly", "title": "据报道，谷歌窥探Android数据以获得相对于第三方应用的优势", "title_en": "Google reportedly peeks into Android data to gain edge over third-party apps", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/android-user-data-gives-google-edge-over-third-party-apps-report-says/", "via": "", "real_tags": ["google", "谷歌", "android"]}, {"category": "", "categoryclass": "", "imagename": "9a6ef081ce6dbbc4eff2441bed45f0fe.jpg", "infoid": 1014026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在选择缩放背景之前需要弄清楚的一件事是：这些幻灯片中究竟包含了哪些信息？\nPlexo Capital的创始管理合伙人洛·托尼(Lo Toney)对希望筹集资金的创始人有一些建议：在精心制作推销资料时，要像产品经理一样思考。托尼曾在Zynga、耐克(Nike)和eBay帮助塑造产品，目前在投资基金和初创公司的Plexo Capital担任全科医生和有限合伙人。他做了大量的推销，而且自己也得到了推销，这就是为什么我们邀请他参加2020年初的TechCrunch。\nToney说：“产品管理的框架与早期投资者和早期投资者在缺乏大量数据的情况下使用的策略非常相似.”“他们的想法真的很像产品经理来评估机会。”\n打造一个坚实的推销台对于寻求风险投资的初创公司的成功至关重要。然而，投资者平均每张幻灯片花费的时间不到4分钟，有些人甚至告诉你，你的时间只有你的一半(所以要么快点说，要么选择你最喜欢的幻灯片)。即使你有能力证明你是下一个斯利普，如果你扼杀了数字背后的故事，你也可能失去获得所需资金的潜力。\n托尼说，采用产品经理的心态有助于完善这个故事的外观和感觉。\n“这个故事不是你的产品。这不是你的公司，也不是企业家。这是当你的产品解决了你的客户的问题后，你的客户的世界会变得更好，“他说，引用了GV的里克·克劳伊(Rick Klau)的话。\n在实际行动中，托尼将框架分解为四张关键幻灯片：问题、市场、解决方案，当然还有团队。\n首先，大多数投资者表示，他们希望看到你试图解决的问题出现在高处。托尼也不例外。\n“我喜欢看到企业家首先描述期望的结果，然后在实现期望结果的过程中遇到哪些障碍？”他问。与产品经理类似，创始人可以说明在特定问题上执行解决方案可能遇到的不同挑战。", "note_en": "One thing to figure out before you pick out a Zoom background: what information actually goes into those slides?\n Lo Toney,   founding managing partner at Plexo Capital, has advice for founders looking to raise money: think like a product manager while crafting your pitch deck. Toney has helped shape products at Zynga, Nike and eBay, and currently serves as both a GP and an LP at  Plexo Capital,   which invests in funds and startups. He’s done a ton of pitching and gotten pitched himself, which is why we invited him to  TechCrunch Early Stage 2020.\n “The framework of product management is very similar to the same playbook used by an early-stage investor and early-stage investors in the absence of an abundance of data,” Toney said. “They’re really thinking very similar to a product manager to evaluate an opportunity.”\n Crafting a solid pitch deck is critical to the success of a startup seeking venture capital. Investors, however, spend less than  four minutes on average per deck, and some even tell you that you have half that much time (so either talk fast or pick your favorite slides). Even if you have the business to prove that you’re the next Stripe, if you butcher the story behind the numbers, you could lose the potential to get the capital you need.\n Toney said adopting a product manager mindset helps refine what that story looks and feels like.\n “The story is not your product. It’s not your company, and it’s not the entrepreneur. It’s how your customer’s world is going to be better when your product has solved their problem,” he said, quoting Rick Klau from GV.\n In action, Toney broke down the framework into four key slides: problem, market, solution and, of course, team.\n  First up, most investors say they want to see the problem you’re trying to solve up high. Toney is no different.\n “I like to see an entrepreneur describing the desired outcome first, and then what are some of those roadblocks that come along the way to that desired outcome?” he asked. Similar to a product manager, founders could illustrate the different challenges that could come to executing a solution on a specific problem.", "posttime": "2020-07-25 03:43:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "产品经理,toney,产品", "title": "\nLo Toney的产品经理攻略-沥青甲板的成功", "title_en": "\n\t\t\t\tLo Toney’s product manager playbook for pitch deck success\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/24/lo-toneys-product-manager-playbook-for-pitch-deck-success/", "via": "", "real_tags": ["产品经理", "toney", "产品"]}, {"category": "", "categoryclass": "", "imagename": "83e9ad8e68e0d2f066cea70e892f2d54.png", "infoid": 1014024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "FreightWaves是一家面向全球货运市场的每日媒体流媒体网络和数据提供商，该公司周五表示，已通过两轮融资筹集了3700万美元。\n据该公司称，这家总部位于田纳西州查塔努加的初创公司的SaaS平台Sonar为运输和物流提供商、托运人、金融交易员和分析师提供数据、情报和分析，这样他们就可以在风险敞口和定价方面做出数据驱动的决定。\n该公司在一份书面声明中表示，凯恩合伙基金(Kayne Partners Fund)在其中一轮融资中处于领先地位，为增长机会提供了3000万美元的资本，另外700万美元来自4月份的一位未披露姓名的投资者。自2016年成立以来，这两轮新融资使FreightWaves总共筹集了7500万美元的资本。Crunchbase的数据显示，FreightWaves的上一次风险融资是在2019年2月，那是由8VC牵头的2100万美元的B轮融资。\nFreightWaves表示，Kayne Partners的投资是少数非控制性投资，该基金的管理合伙人兼成长股权联席主管Nishita Cummings将加入董事会。\n卡明斯在一份书面声明中说：“FreightWaves的声纳SaaS解决方案已经开始重新定义物流领域的决策方式，我们期待着支持团队扩大整个货运领域的客户越来越依赖于成功管理日常运营的产品套件。”\n该公司为价值9.6万亿美元的全球物流业提供流媒体和数据，计划将额外的资本用于产品开发和潜在的战略收购。FreightWaves首席执行官克雷格·富勒(Craig Fuller)在一份书面声明中表示，今年，它从快速规模模式转向可持续增长。\n富勒表示：“尽管新冠肺炎对我们的一些收入流产生了影响，但我们正在加速超过我们的盈利目标，并正在加强我们业务模式的强劲基本面。”2019年上半年，像FreightWaves LIVE这样的社区和活动占我们收入的50%以上。由于新冠肺炎迫使我们取消了5月份的FreightWaves直播，我们无法举办半年一次的活动，并对营收造成了重大影响。\n他补充说：“对我们来说，好消息是我们一直在建立一个过头的流媒体电视网络，能够将FreightWaves的现场内容和体验转化为虚拟格式。”", "note_en": "FreightWaves, a daily media streaming network and data provider for the global freight market, said Friday it has raised $37 million in two rounds of funding.\n  The Chattanooga, Tennessee-based startup’s SaaS platform, SONAR, provides data, intelligence and analysis to transportation and logistics providers, shippers, financial traders and analysts, so they can make data-driven decisions on exposure and pricing, according to the company.\n Kayne Partners Fund led one of the rounds, providing $30 million in capital for growth opportunities, while the other $7 million came from an undisclosed investor back in April, the company said in a written statement. The two new rounds give FreightWaves a total of $75 million in capital raised since its inception in 2016. FreightWaves’ last venture raise was in February 2019, a  $21 million Series B round led by  8VC, according to Crunchbase data.\n FreightWaves said Kayne Partners’ investment was a minority, noncontrol investment and that the fund’s managing partner and co-head of growth equity,  Nishita Cummings, will join its board.\n “FreightWaves’ SONAR SaaS solution has already begun to redefine how decisions are made in the logistics space, and we look forward to supporting the team in expanding a product suite that customers throughout the freight landscape increasingly rely on to successfully manage daily operations,” Cummings said in a written statement.\n The company, which provides streaming media and data to the  $9.6 trillion global logistics industry, plans to use the additional capital on product development and potential strategic acquisitions. This year, it pivoted from a rapid scale model to sustainable growth,  Craig Fuller, FreightWaves’ CEO said in a written statement.\n “Even though COVID-19 had an impact on some of our revenue streams, we are accelerating past our profitability targets and are reinforcing strong fundamentals in our business model,” Fuller said. “Community and events like FreightWaves LIVE were more than 50 percent of our revenue in the first half of 2019. With COVID-19 forcing us to cancel FreightWaves LIVE in May, we weren’t able to host our bi-annual event and experienced a significant impact to top-line revenues.\n “The good news for us is that we had been building an over-the-top streaming TV network that was able to carry the FreightWaves LIVE content and experience into a virtual format,” he added.", "posttime": "2020-07-25 03:42:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "融资,funding,freightwaves", "title": "FreightWaves是一家面向全球货运市场的媒体流媒体网络和数据提供商，该公司在两轮融资中筹集了3700万美元，使融资总额达到7500万美元", "title_en": "FreightWaves, a media streaming network and data provider for the global freight market, raises $37M in two rounds of funding bringing the total raised to $75M", "transed": 1, "url": "https://news.crunchbase.com/news/kayne-partners-backs-freightwaves-with-30m-for-growth/", "via": "", "real_tags": ["融资", "funding"]}, {"category": "", "categoryclass": "", "imagename": "99e8415d3f51ef41a4d45b96b8f5a98e.jpg", "infoid": 1014023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的研究发现，仅仅几条网上餐厅的负面评论就可以提前确定一家餐厅收到了多少长期评论。\n本月早些时候发表在“应用地理学”期刊论文上的这项研究还发现，社区的家庭收入中位数会影响餐馆的评级。\n论文主要作者、俄亥俄州立大学(Ohio State University)城市与区域规划助理教授本山康之(Yasuyuki Motoyama)说，“这些网络平台宣传自己是不偏不倚的，但我们发现事实并非如此。”\n“按照这些平台的运作方式，受欢迎的餐厅变得更受欢迎，一些最初评分较低的餐厅可能会停滞不前。”\n这项研究评估了俄亥俄州富兰克林县Yelp和TripAdvisor网站对每个网站约3000家餐厅的评论。富兰克林县是哥伦布和俄亥俄州立大学的所在地，也是20多家连锁餐厅的总部所在地。之前的研究发现，食品行业认为该地区的消费者偏好是对更广泛的美国市场的试金石。\n研究人员收集了2019年5月发布的餐厅评论，然后按评级和地理位置分析了这些评论。他们考虑了每个社区的人口统计数据，并根据家庭收入记录了每个社区的社会经济状况。\n研究发现，Yelp和TripAdvisor等网站上评论数量较少的餐厅获得低评级的可能性更高。\n这篇论文的合著者、俄亥俄州立大学城市与区域规划助理教授卡里姆·亚瑟(Kareem Usher)说：“一家餐厅收到的评论越多，该餐厅的平均评级就越高。”“但这也有影响：如果一家餐厅最初收到的评论之一来自一名不满意的顾客，而人们后来检查了这一点，并根据那一条评论认为‘我不想去那里’，那么对这家餐厅的评论就会减少。”\n对于获得正面评价或大量评论的餐厅来说，情况正好相反：更多的人可能会评论这些餐厅，从而提高了一家餐厅的平均评级更高的可能性。\n研究发现，17.6%的餐厅只有一到四条评论，在Yelp上的评分很低。但对于那些评论在5到10次之间的人来说，这一比例下降到了9.3%。在TripAdvisor上，那些有1到4条评论的人有5.6%的可能性会有糟糕的评论，而那些有5到10条评论的人会下降到0.6%。\n研究人员还发现，富兰克林县几个最贫穷社区的餐厅往往在网站上得不到评级。然而，研究人员没有发现社区的社会经济或种族构成与那里餐馆的平均评级之间存在直接联系。\nMotoyama警告说，这项研究有一些限制：它是在一个县进行的，未来的工作可能会扩大到包括全国其他地区。高级多变量分析只能使用Yelp数据，因为TripAdvisor中的大多数关键信息都丢失了。研究人员也没有分析评论的内容，这可能会提供关于偏见的额外线索。\n但是，他说，这项研究确实表明，在线评论网站可以对一家餐厅的成败产生重大影响，并建议，或许这些网站可以制定更公平的政策。\n他说：“也许这些在线平台可以在一家餐厅获得一定数量的评论之前不发表评论-比如，10条或更多。”“如此一来，如果有两三位顾客对某一特定体验非常不满，他们就不会直接决定餐厅的成败。”", "note_en": "Just a few negative online restaurant reviews can determine early on how many reviews a restaurant receives long-term, a new study has found.\n  The study, published earlier this month in the journal  Papers in Applied Geography, also found that a neighborhood’s median household income affected whether restaurants were rated at all.\n  “These online platforms advertise themselves as being unbiased, but we found that that is not the case,” said  Yasuyuki Motoyama, lead author of the paper and an  assistant professor of     city and regional planning  at The Ohio State University.\n  “The way these platforms work, popular restaurants get even more popular, and restaurants with some initial low ratings can stagnate.”\n  The study evaluated reviews in Franklin County, Ohio, from the websites Yelp and Tripadvisor of about 3,000 restaurants per website. Franklin County, home to Columbus and Ohio State, is also home to the headquarters of more than 20 restaurant chains. Previous research has found that the food industry considers consumer preferences in the area to be a litmus test for the broader U.S. market.\n  The researchers collected reviews for restaurants published in May 2019, then analyzed those reviews by rating and geographic location. They considered demographics for each neighborhood, and noted the socioeconomics of each neighborhood, too, based on household income.\n  The study found that restaurants with a smaller number of reviews on sites like Yelp and TripAdvisor had higher likelihood of a low rating.\n  “The more reviews a restaurant received, the higher the average rating of the restaurant,” said  Kareem Usher , co-author of the paper and an assistant professor of city and regional planning at Ohio State. “But this has implications: If one of the first reviews a restaurant receives comes from a dissatisfied customer, and people check that later and think ‘I don’t want to go there’ based on that one review, then there will be fewer reviews of that restaurant.”\n  The opposite is true for restaurants that receive positive reviews or a large number of reviews: More people are likely to review those restaurants, improving the likelihood that a restaurant’s average rating will be higher.\n  The study found that 17.6 percent of restaurants with only one to four reviews received a low rating on Yelp. But that decreased to 9.3 percent for those with between five and 10 reviews. On Tripadvisor, those with one to four reviews had a 5.6 percent probability of having a poor review, going down to 0.6 percent for those with five to 10 reviews.\n  Researchers also found that restaurants in several of the poorest neighborhoods in Franklin County tend not to be rated on the sites. However, the researchers did not find a direct link between a neighborhood’s socioeconomics or racial makeup and the average rating of the restaurants there.\n  Motoyama cautioned that the study had some limits: It was conducted in one county, and future work could expand to include other areas around the country. The high level multivariate analysis could only use the Yelp data, as the majority of key information in Tripadvisor was missing. The researchers also did not analyze the content of the reviews, which could offer additional clues about bias.\n  But, he said, the study does indicate that online review sites can have significant effects on a restaurant’s success or failure – and suggests that, perhaps, the sites can set up policies that might be more fair.\n  “Maybe these online platforms can withhold reviews until a restaurant gets a certain number of reviews – say, 10 or more,” he said. “That way if there are two or three customers who are very dissatisfied with a particular experience, they are not directing the restaurant’s success or failure.”", "posttime": "2020-07-25 03:42:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可能,online,评论", "title": "早期一些负面的在线评论可能会伤害一家餐厅", "title_en": "A few negative online reviews early on can hurt a restaurant", "transed": 1, "url": "https://news.osu.edu/how-a-few-negative-online-reviews-early-on-can-hurt-a-restaurant/", "via": "", "real_tags": ["可能", "online", "评论"]}, {"category": "", "categoryclass": "", "imagename": "74a79981b06f9530fc20c805b9791846.jpg", "infoid": 1014022, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么我们不计划运营20公里以下的航班，为什么这是一件好事。\n“城市空中机动性”的概念在大多数人的脑海中根深蒂固。这是一种未来主义的飞行汽车，在城市中跳跃，也许是从花园起飞，然后在当地的商店停留，然后把孩子们送到学校。\n从曼哈顿下城到纽约中央车站，或者从慕尼黑的英国花园到总站，这不仅不切实际(一个城市需要数百个着陆台)，而且实际上也不会节省你任何时间，因为你可能需要往返垂直机场以及办理登机手续。\n相反，我们开始做一些不同的事情。不同于大多数人对电动空气移动性的期望，也不同于我们绝大多数竞争对手。\n有了300公里(186英里)的里程，我们将能够专注于用高速交通连接整个地区，而不是试图说服你，我们比乘坐地铁或自行车穿越市中心更快。\n事实上，与“城市空中出租车”的想法相反，我们认为在我们的网络中只会有少数几条短于20公里(12英里)的路线。\n这听起来可能令人惊讶，所以我选择了两个例子来说明电动垂直起降飞行是如何最有效地部署的。\n瑞士得天独厚，交通便利，火车准点，还有许多美丽的地方可去。然而，即使拥有世界级的基础设施，从我的家乡苏黎世到达这些目的地所需的时间仍然比预期的要长得多。\n乘坐全电动Lilium Jet将使我和苏黎世的其他人能够更快地完成这些旅程，价格与推出时的头等舱火车票相当，投入运营几年后更便宜。\n但机会并不止步于此。因为空中交通服务不需要昂贵的陆上基础设施，如连接每个点的道路或铁路，我们可以迅速创建一个拥有数百条(如果不是数千条)路线选择的网络，将主要城镇连接起来，创造显著的经济影响，更好的土地利用，以及更多接触工业、文化，当然还有自然的机会。\n一个只有20个着陆点的系统将创造大约200条潜在的路线和10000公里的高速连接(假设站点之间的距离为50公里)。这是整个法国高速TGV铁路网的三倍，而成本只有法国高速TGV铁路网的一小部分。\n而且，由于我们不必修建每公里成本轻易超过2000万美元的轨道，我们也可以连接较小的社区，通过调整连接频率来满足需求。\n通过改造现有的基础设施，如机场，直升机机场，甚至停车场的屋顶，在不到五年的时间里，就有真正的机会实现一个可能看起来像这样的网络。\n同样的论点也适用于旧金山和旧金山湾区。虽然它以其经济活动，无与伦比的创造力和被自然美景包围而闻名，但它也是一个拥有许多中心的大城市地区，受到交通繁忙和高房价的困扰。\n如果我们可以改变这一点，用高速的全电动旅行会怎么样？今天，在旧金山湾区内外旅行是一项挑战，但Lilium服务有可能显著缩短旅行时间。假设你从恩巴卡迪罗附近的某个地方开始你的旅行，旅行时间可能是这样的：\n如果我们想象一下，你在帕洛阿尔托的办公室工作，你现在可以选择住在海沃德(5分钟飞行，25美元)、旧金山市中心(10分钟飞行，50美元)，甚至圣拉斐尔(15分钟飞行，70美元)。\n或者你想逃到太浩湖度个长周末？乘坐Lilium Jet不到一个小时，发射时的费用约为250美元，不久的将来会更少。这可能不是你每个周末都会做的事情，但为你节省三个小时的单程旅行很可能会让偶尔的旅行变得值得。\n在旧金山市中心，有很多地方可以建造一个垂直港口，从码头到停车场，再到现有交通枢纽的屋顶，不一而足。而且，有了地区性的出行方式，我们只需一两个垫子就可以有效地为整个市中心提供服务。\n在硅谷，我们可以看到垂直港口提供通往家庭和公司校园的高速连接，使用班车、叫车和微型移动性进行最后一英里的旅行。这些设施可以放置在高速公路旁边或海湾旁边，这样我们就可以通过将航班安排在水上或繁忙的交通干道上方，将对地面的影响降至最低。\n例如，在加利福尼亚州帕洛阿尔托，具有多式联运最后一英里连通性的高吞吐量垂直港口可能是什么样子。\n然而，我们的愿景不仅仅是一个城市。我们希望创建一个连接小城镇和城市的区域网络，减轻我们高度拥堵的城市的压力，通过更分散的增长帮助释放数十亿美元的土地价值，进而改善我们的生活方式。\n最近的一项研究表明，不到750公里(466英里)的高速连接可以产生价值数千亿美元的经济机会。上面的未来网络图提供的连接量是这个数字的10倍以上，每年的旅客吞吐量为数百万人，但建设成本仅为2.5亿至3.5亿美元-与建设数百公里高速地面交通轨道通常花费的数百亿美元相比，这只是一个零头，因为我们不需要土地和材料。\n将这一愿景变成现实意味着要搁置一些关于这种交通方式可能是什么样子的更具异国情调的想法，转而专注于让它变得负担得起、可实现、可接近和可接受。\n我们开发了一种模块化且经济实惠的基础设施方法，使网络能够快速扩展。我们的详细成本计算显示，一个5000平方米(53.8K平方英尺)的垂直港口，有一个起降空间和七个停车位，可以在地面建造，只需1000万美元，每年将能够处理100-150万名旅客。\n在许多情况下，我们可以快速升级较小的地区性机场的现有基础设施，以更低的成本创建连接。\n而且，通过排除20公里以下的航班，我们避免了需要在每个方向穿越我们的城市，这意味着我们可以以对社区干扰最小的方式部署Lilium服务，仔细选择我们的垂直港口位置，以将任何影响降至最低。\n例如，现有的运输走廊，如现有的铁轨，可以用作Lilium航班的路线，有助于将地面噪音足迹降至最低。来源：GeoData©swisstopo。\n虽然仍有工作要做，以定义着陆制度和空中交通管理，以允许更高的航班频率，但您可以在我们的网站上阅读更多关于我们拟议的服务的信息，而我们对基础设施的方法在这里进行了详细介绍。在接下来的几个月里，我们还将分享更多关于我们独特的飞机概念如何提供低噪音足迹的信息，使其能够进入建成区，而不会增加当地的噪音水平。", "note_en": "Why we don’t plan to operate flights under 20km, and why that’s a good thing.\n  The idea of ‘urban air mobility’ is pretty well ingrained in most people’s minds. It’s futuristic flying cars that hop around a city, perhaps taking off from a garden, before stopping at the local shops and then   dropping the kids off at school .\n  Taking a short hop from Lower Manhattan to Grand Central Station in New York, or from the English Garden in Munich to the main station, is not only impractical (you’d need hundreds of landing pads in one city) but it won’t actually save you any time as you’ll likely need to travel to and from the vertiport as well as check-in for your journey.\n  Instead, we set out to do something different. Different from what most people expect from electric air mobility and different from the vast majority of our competitors.\n With a range of up to 300km (186 miles), we’ll be able to focus on connecting entire regions with high-speed transport, rather than trying to persuade you that we’re quicker than a crosstown journey on an underground train or bike.\n In fact, contrary to the idea of ‘urban air taxis’ we think there will only ever be a handful of routes in our network that are shorter than 20km (12 miles).\n That might sound surprising, so I’ve picked two examples to illustrate how electric VTOL flight might be deployed most effectively.\n   Switzerland is blessed with excellent transport connections, a punctual train service and many beautiful places to go. And yet, even with world-class infrastructure, it still takes considerably longer than expected to reach these destinations from my home town of Zurich.\n Traveling with the all-electric Lilium Jet would allow me and others in Zurich to complete these journeys significantly faster and at a price that would be comparable to a first-class train ticket at launch, and cheaper a few years into operations.\n  But the opportunity doesn’t stop there. Because an air mobility service doesn’t require expensive land-based infrastructure like roads or rails connecting each point, we can rapidly create a network with hundreds, if not thousands of route options, linking up major towns and cities to create significant economic impact, better land use, and increased access to industry, culture and, of course, nature.\n A system with only 20 landing sites would create around 200 potential routes and 10,000km of high speed connectivity (assuming 50km distance between sites). That’s   three times  the entire French high speed TGV rail network for a fraction of the cost.\n And since we don’t have to build tracks that can easily cost more than   $20m+ per kilometer , we can connect smaller communities too, adapting the frequency of connection to match the demand.\n By adapting existing infrastructure  like airports, heliports, or even the roof of a parking garage, there’s a genuine opportunity to implement a network that could look like this, in less than five years.\n    The same argument applies to San Francisco and the Bay Area. While it’s known for its economic activity, its matchless creativity and for being surrounded by natural beauty, it’s also a large urban area with many centers, plagued by heavy traffic and high house prices.\n What if we could change that, with high speed, all-electric travel? Today, traveling in and around the Bay Area is a challenge, but a Lilium service has the potential to improve journey times significantly. Assuming you start your journey somewhere around the Embarcadero, travel times could look something like this:\n  If we imagine for a moment that you work in an office in Palo Alto, you could now choose to live in Hayward (5 min flight, $25), downtown San Francisco (10 min flight, $50), or even San Rafael (15 min flight, $70).\n Or maybe you want to escape to   Lake Tahoe  for a long weekend? That would be less than an hour on a Lilium Jet, at a cost of around $250 at launch and less in the near future. It might not be something you’d do every weekend, but saving you three hours each way might well make it worthwhile for an occasional trip.\n There are many sites that could host a vertiport in downtown San Francisco, ranging from piers to parking lots and the rooftops of existing transport hubs. And, with a regional approach to travel, we could effectively service the entire downtown area using just one or two pads.\n In the Valley we could see vertiports providing high-speed connections to homes and corporate campuses, using shuttles buses, ride-hailing and micro-mobility for last mile travel. These could be placed alongside highways or next to the Bay, allowing us to minimize any ground impact by routing flights over the water, or above busy traffic arteries.\n An example of what a high-throughput vertiport, with intermodal last-mile connectivity, could look like in Palo Alto, CA\n Our vision isn’t just about one city though. We want to create a regional network that connects smaller towns and cities and takes the pressure off our highly-congested cities, helping to unlock billions of dollars of land value through more distributed growth, in turn improving the way we live.\n  A recent   study  showed that less than 750km (466 miles) of high speed connectivity could generate economic opportunities worth hundreds of billions of dollars. The prospective network map above delivers more than 10 times that amount of connectivity, with throughput for millions of passengers each year, and yet would only cost in the order of $250 to $350 million to construct - a fraction of the tens of billions it typically costs to build a few hundred kilometers of high speed ground transportation tracks as we don’t need the land and material.\n  Bringing this vision to life means parking some of the more   exotic  ideas about what this form of transport might look like and instead focusing on making it affordable, achievable, accessible and acceptable.\n We have developed a  modular and affordable approach to infrastructure that will enable networks to scale fast. Our detailed costings show that a 5,000 sqm vertiport (53.8k sqft), with one take off and landing space and seven parking bays, could be built at ground level for as little as $10m, and would be capable of handling 1-1.5 million passengers each year.\n  In many cases we could rapidly upgrade the existing infrastructure at smaller, regional airports, creating a connection for even less.\n And, by ruling out flights under 20km, we avoid needing to traverse our cities in every direction, meaning we can deploy the Lilium service in the least intrusive way for communities, choosing our vertiport locations carefully to minimize any impact.\n An example of how existing transport corridors, such as existing rail tracks, could be used as routes for Lilium flights, helping to minimize noise footprint at ground level . Credit:  geodata © swisstopo\n While there is still work to be done to define landing regimes and air traffic management that allow for a higher frequency of flights, you can read more about our proposed service   on our website , while our approach to infrastructure is detailed   here . We’ll also be sharing more information in the coming months about how our unique aircraft concept can deliver a low noise footprint, allowing it to access built-up areas without adding to local noise levels.", "posttime": "2020-07-25 03:41:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "lilium,jet,连接", "title": "Lilium Jet：为什么我们不计划运营20公里以下的航班", "title_en": "Lilium Jet: Why we don’t plan to operate flights under 20km", "transed": 1, "url": "https://lilium.com/newsroom-detail/why-regional-air-mobility", "via": "", "real_tags": ["lilium", "jet", "连接"]}, {"category": "", "categoryclass": "", "imagename": "c256219d6b44635c5c6443576a0c4225.jpg", "infoid": 1014020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Flipkart公司周四宣布，该公司推出了Flipkart Wholesale，这是一个面向小型零售商和kirana商店的电子商务平台。作为此次发布的一部分，该公司反向收购了这家美国零售巨头的印度批发子公司沃尔玛印度私人有限公司(Wal-Mart India Private Limited)。沃尔玛印度业务首席执行官萨米尔·阿加瓦尔(Sameer Aggarwal)将继续担任一段时间，然后转到沃尔玛的另一个职位。Flipkart Wholesale被定位为一个电子商务门户，供小贸易商和中小企业在线购买商品，并为企业提供信贷。\nFlipkart Wholesale将由Flipkart高级副总裁阿达什·梅农(Adarsh Menon)领导，他自2015年以来一直在该公司工作，在此之前，他曾在印度斯坦联合利华担任过十多个不同的职位。Flipkart说，“收购沃尔玛印度业务后，其员工将加入Flipkart集团，总部团队将在明年整合。”\n本月早些时候，沃尔玛牵头向Flipkart投资12亿美元，对这家电商平台的估值为249亿美元。沃尔玛拥有Flipkart的多数股权，2018年沃尔玛以160亿美元收购了Flipkart。\n该公司表示，Flipkart Wholesale将于8月份推出。这项服务似乎与信实的JioMart直接竞争，后者也在努力吸引小店主和基拉那商店。Flipkart表示，它将首先在Wholesale的杂货和时尚领域开始。“数以千计的基拉那已经与Flipkart合作，以增强他们的业务和收入流，”梅农说，他指的是与该公司合作送货最后一英里的店主。本月早些时候，该公司与一些商店合作，提供“触感体验”，让顾客预览他们必须在网上购买的产品；这是在2月份宣布的，距离封锁只有几周时间，所以目前还不清楚Flipkart是否履行了这些合作关系。\n沃尔玛印度运营着Best Price，这是一家拥有28家门店和一个电子商务平台的批发超市连锁店，沃尔玛声称，这两家超市都为超过150万家零售商提供服务。Flipkart经营着超市，这是一个杂货配送平台。今年6月，有报道称，该公司正寻求扩展到按需送货业务，与Dunzo和Swiggy等公司展开竞争。据报道，该公司正依靠收购物流公司Shadowfax来实现这一目标。", "note_en": "Flipkart has launched Flipkart Wholesale, an e-commerce platform for small retailers and kirana shops, the company  announced on Thursday. As a part of the launch, the company has reverse-acquired Wal-Mart India Private Limited, the US retail giant’s Indian wholesale arm. Sameer Aggarwal, CEO of Walmart’s India operations, will continue in his role for some time, before moving to a different role at Walmart. Flipkart Wholesale is being pitched as an e-commerce portal for small traders and MSMEs to acquire goods online, and to provide credit to businesses.\n Flipkart Wholesale will be led by Adarsh Menon, a senior vice president at Flipkart who has been at the company since 2015, before which he served in various roles at Hindustan Unilever for over a decade. “With the acquisition of the Walmart India business, its employees will join the Flipkart Group and the home office teams will integrate over the next year,” Flipkart said.\n  Earlier this month, Walmart  led a US$1.2 billion investment into Flipkart, valuing the e-commerce platform at US$24.9 billion. Walmart owns a majority stake in Flipkart, which it  purchased for US$16 billion in 2018.\n   Flipkart Wholesale will launch in August, the company said. The service seems to be in direct competition with Reliance’s JioMart, which is also  trying to woo small storeowners and kirana shops. Flipkart said it will initially start in the grocery and fashion segments on Wholesale. “Thousands of kiranas have already partnered with Flipkart to enhance their business and income streams,” Menon said, referring to storeowners who  partner with the company for last mile delivery. Earlier this month, the company partnered with some shops to offer “touch and feel experiences”,  giving customers previews of products that they would have to purchase online; this was announced in February, mere weeks before the lockdown, so it’s unclear if Flipkart has followed through on these partnerships.\n Wal-Mart India operates Best Price, a chain of wholesale supermarkets with 28 stores and an e-commerce platform, both of which, Wal-Mart claims, serve over 1.5 million retailers. Flipkart operates Supermart, a grocery delivery platform. In June, it was  reported that the company was looking to expand to on-demand delivery, competing with the likes of Dunzo and Swiggy. The company is reportedly relying on its acquisition of logistics company Shadowfax to this end.", "posttime": "2020-07-25 03:19:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "flipkart,wholesale", "title": "Flipkart收购沃尔玛印度批发部门并推出面向小商户的电子商务服务Flipkart Wholesale与JioMart竞争", "title_en": "Flipkart buys Walmart's Indian wholesale arm and launches Flipkart Wholesale, an e-commerce service for small traders, to compete with JioMart", "transed": 1, "url": "https://www.medianama.com/2020/07/223-flipkart-wholesale-walmart/", "via": "", "real_tags": ["flipkart", "wholesale"]}, {"category": "", "categoryclass": "", "imagename": "482b6a5a9b21c3912586005fb551c978.jpg", "infoid": 1014018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管五角大楼此前曾宣布解散有关不明飞行物(UFO)的项目，但报道显示情况并非如此。不明飞行物项目显然驻留在美国海军情报办公室内。\n参议院委员会上个月发布的一份报告介绍了美国即将到来的一年的情报支出。在报告中，提到了一个身份不明的空中现象工作队。它的任务是标准化收集和报告有关不明原因的飞行器。这项任务是关于收集可能与敌对的外国政府有关的情报。UAPTF将评估他们对美国军事资产和设施构成的威胁。\n情报特别委员会认识到联合APTF获得的一些信息的敏感性。然而，它仍然要求特别工作组每六个月提交一份报告。国家情报总监、国防部长和其他相关机构负责人将监督这份报告。\n《纽约时报》还注意到参与该特别工作组的退休官员。前参议院多数党领袖哈里·里德(Harry Reid)希望该项目能够从其他世界收集车辆的证据。尽管如此，该项目的主要重点仍然是关注任何其他国家获得可能对美国利益构成威胁的新飞机的情况。\n本月，共和党参议员马尔科·卢比奥(FL)表达了让海军情报部门准备一份公开报告的兴趣。参议院情报特别委员会代理主席在接受CBS4采访时强调，我们的军事基地和我们正在进行军事演习的地方上空都有东西飞过。参议员卢比奥补充说，我们不知道这些东西是什么，它们不是美国的项目，这使它们成为真正的安全问题。\n当吉姆·德费德(Jim DeFede)问到谁将调查这件事时，卢比奥参议员回答说，它隶属于海军情报办公室(Office Of Naval Intelligence)。他解释说，这种不明的空中现象主要影响了海军。\n早在2017年12月，《纽约时报》就率先爆料了五角大楼秘密UFO情报计划的相关新闻。它追踪了国防部6000亿美元年度预算中损失的2200万美元。据报道，预算中几乎不可能的一大部分流向了先进航空航天威胁识别计划(Advanced AerSpace Threat Identify Program)。\n在独家报道中，纽约时报详细介绍了这个神秘的政府项目是如何在当时的内华达州参议员哈里·里德(Harry Reid)的支持下于2007年开始的。据报道，分配的预算流向了罗伯特·毕格罗(Robert Bigelow)经营的一家航空航天研究实体，他是亿万富翁商人，也是参议员的老朋友。\n先进的航空威胁识别计划已经制作了关于报告的飞机目击事件的文件。特别工作组报告并详细说明了一架飞机似乎在以非常高的速度移动，没有明显的推进迹象。它还指出，飞机在没有明显升力的情况下盘旋。\n该出版物获得了一系列合同。它揭示了2008年至2011年近2200万美元的国会预算。据报道，这笔资金流向了毕格罗航空航天公司，与分包商和研究人员合作，研究和评估不明飞行物构成的威胁。\n©2017 Science Times.com保留所有权利。未经许可，请勿复制。科学时代通向世界的窗口。", "note_en": "Although the Pentagon has previously announced that they disbanded programs concerning unidentified flying objects (UFO), reports show that it is not the case. UFO programs apparently reside within the  Office of Naval Intelligence.\n  A  Senate committee report last month presents the country&#39;s intelligence expenditures for this upcoming year. In the report, an Unidentified Aerial Phenomenon Task Force was mentioned. It is tasked &#34;to standardize collection and reporting&#34; regarding unexplained aerial vehicles. This task is about gathering intelligence that might be related to &#34;adversarial foreign governments.&#34; The UAPTF will assess &#34;the threat they pose to U.S. military assets and installations.&#34;\n      The Select Committee on Intelligence recognizes the sensitivity of some information obtained by the UAPTF. However, it still requires the task force to submit a report every six months. The Director of National Intelligence, the Secretary of Defense, and other relevant agency heads will be overseeing the report.\n  The New York Times also noted retired officials involved in the task force. Former Senate majority leader Harry Reid hopes that the program could gather proof of &#34;vehicles from other worlds.&#34; Although, its main focus remains on keeping an eye on any other nation that gets its hands on new aircraft that could pose a threat to US interests.\n  This month, Republican Senator Marco Rubio (FL) expressed interest in having naval intelligence prepare a public report.  In an interview with CBS4, the Senate Select Committee on Intelligence&#39;s acting chairman emphasized that &#34;we have things flying over our military bases and places where we&#39;re conducting military exercises.&#34; Sen. Rubio added that we don&#39;t know what these things are and that they&#39;re not projects of the United States, making them genuine security concerns.\n  When Jim DeFede asked who would be looking into the matter, Sen. Rubio answered that it is under the Office of Naval Intelligence. He explained that this &#34;unidentified aerial phenomenon&#34; has mostly affected the navy.\n    Back in December 2017,  The New York Times first broke the news about the Pentagon&#39;s secret  UFO Program. It has tracked $22 million lost in the $600 billion annual Defense Department budgets. The near-impossible chunk of the budget reportedly went to the Advanced Aerospace Threat Identification Program.\n      In the exclusive report, The New York Times detailed how the mysterious government program began in 2007 with support from then-Nevada Senator Harry Reid. The allotted budget reportedly went to an aerospace research entity run by a Robert Bigelow, billionaire businessman and a longtime friend to the senator.\n  The Advanced Aerospace Threat Identification Program has produced documentation on reported aircraft sightings. The task force reports and details an aircraft seemingly moving &#34;at very high velocities with no visible signs of propulsion.&#34; It also noted aircraft that &#34;hovered with no apparent means of lift.&#34;\n    The publication obtained a series of contracts. It shed light on a congressional budget of almost $22 million from 2008 to 2011. The funding reportedly went to Bigelow Aerospace, working with subcontractors and researchers to study and assess the threats posed by the unidentified flying objects.\n         ©2017 ScienceTimes.com All rights reserved. Do not reproduce without permission. The window to the world of  science times.", "posttime": "2020-07-25 02:56:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不明飞行物,ufo,情报", "title": "五角大楼不明飞行物小组将向公众披露部分调查结果", "title_en": "Pentagon's UFO Unit to Disclose Some of Its Findings to the Public", "transed": 1, "url": "https://www.sciencetimes.com/articles/26600/20200724/pentagons-ufo-unit-disclose-findings-public.htm", "via": "", "real_tags": ["不明飞行物", "ufo", "情报"]}, {"category": "", "categoryclass": "", "imagename": "1830f2841f15bda96d08818171370e1a.jpg", "infoid": 1014017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据发表在“科学报告”上的一项研究，已经灭绝的非洲鳄鱼物种Checchiai可能与今天存活的美洲鳄鱼物种有密切的亲缘关系。这些发现表明，鳄鱼可能是在中新世晚期(1100万-500万年前)从非洲迁徙到美洲的。在这一发现之前，尚不清楚鳄鱼是通过假想的跨大西洋航行从非洲到达美洲，还是反之亦然。Massimo Delfino和他的同事使用CT成像技术重新检查了储存在罗马萨皮恩扎大学地球科学博物馆的Checchiai的头骨，这是1939年在利比亚的As Sahabi发现的。作者发现了几种新的头骨结构，包括切氏鳄吻中部的一个突起，这在其他任何非洲鳄鱼中都没有发现，但在四种现存的美洲鳄鱼-中间鳄鱼(C.moreleti)、尖吻鳄鱼(C.acutus)和菱形鳄鱼(C.Rhombifer)的头骨上存在这种突出物。这表明跳棋鳄鱼与美洲鳄鱼在进化上有密切的亲缘关系。\n对物种间进化关系的进一步分析表明，跳跳鳄可能与今天在北美和南美洲发现的四种鳄鱼属于同一谱系的一部分。切奇埃鳄鱼的遗骸可以追溯到大约700万年前，而美国最古老的鳄鱼--已经灭绝的镰刀鳄鱼的遗骸，可以追溯到大约500万年前。基于这些发现，作者提出从澳大拉西亚经非洲向西迁徙到美洲。更多信息：Massimo Delfino等人，旧非洲化石为美洲鳄鱼的起源提供了新的证据，科学报告(2020)。电话：10.1038/s4159820-68482-5", "note_en": "The extinct African crocodile species  Crocodylus checchiai may be closely related to American crocodile species alive today, according to a study published in  Scientific Reports. The findings suggest that crocodiles may have migrated from Africa to America during the Late Miocene epoch (11-5 million years ago).    Prior to this discovery it was unclear whether crocodiles reached the Americas from Africa, via a hypothesized transatlantic voyage, or vice-versa. Massimo Delfino and colleagues used CT imaging to re-examine a skull of C. checchiai stored at the Earth Sciences museum MUST of Sapienza University of Rome, that was discovered in 1939 in As Sahabi, Libya. The authors identified several new skull structures including a protrusion in the middle of the snout of C. checchiai that had not been identified on any other African crocodile   but that is present on the skulls of the four living American crocodile species  Crocodylus intermedius,  C. moreleti,  C. acutus and  C. rhombifer. This shared   indicates a close evolutionary relationship between C. checchiai and American crocodiles.\n  Further analyses of the evolutionary relationships between species suggest that C. checchiai may be part of the same lineage as the four crocodile species found in North and South America today. The remains of C. checchiai have been dated to around seven million years ago while the oldest remains of an American crocodile, the extinct C. falconensis, have been dated to around five million years ago. Based on these findings, the authors propose that   reached America by migrating westwards from Australasia via Africa.        More information:\t\t\t\t\t\t\t\t\t\t\t\tMassimo Delfino et al, Old African fossils provide new evidence for the origin of the American crocodiles,  Scientific Reports (2020).  DOI: 10.1038/s41598-020-68482-5", "posttime": "2020-07-25 02:56:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "非洲,african,鳄鱼", "title": "古老的非洲头骨揭示了美洲鳄鱼的起源", "title_en": "Ancient African skull sheds light on American crocodile origins", "transed": 1, "url": "https://phys.org/news/2020-07-ancient-african-skull-american-crocodile.html", "via": "", "real_tags": ["非洲", "african", "鳄鱼"]}, {"category": "", "categoryclass": "", "imagename": "8dfcccfc41b9c9fee495e003207d5595.jpeg", "infoid": 1014016, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在议员们就如何进一步帮助境况不佳的美国经济争论不休之际，埃隆·马斯克(Elon Musk)希望看到只包括直接付款。\n周五，负责数万名员工工资的亿万富翁首席执行官在推特上表示，另一项政府刺激计划并不符合人民的最佳利益。\n相反，特斯拉首席执行官暗示，任何后续的经济努力都应该是对消费者的直接付款。(特朗普政府成员本周表示，另一轮直接付款很可能会发生。)。\n他批评美国的经济救助努力之际，正值该国未能遏制冠状病毒爆发，导致创纪录的失业率和经济绝望。每周600美元的失业救济金，加上第一笔1200美元的直接现金支付，在很大程度上拯救了数百万美国人，使其免于跌入贫困线以下。工资保护法案贷款还帮助300多万小企业员工避免裁员。\n但这些措施将于本周到期，高盛预测，到8月份，11%的失业率可能会在资金耗尽后激增。\n航空公司和其他在特定立法中获得特别拨款和贷款的行业，随着余波的继续，也可能会裁员。这很可能是马斯克批评特殊利益的根源。\n马斯克在推特上写道，这些都被塞到了带有特殊利益专项拨款的鳃上，但没有具体说明批评是针对现有立法还是目前正在国会山权衡的选项。包括特朗普总统在内的共和党人提议削减工资税，作为第二轮援助的一部分，该援助不太可能包括在最终法案中。\n马斯克说，政府的目标应该是让人民的幸福最大化。给每个人钱可以让他们决定什么符合他们的需要，而不是立法这种生硬的工具，这会产生自私自利的特殊利益。\n考虑到这位高管与特朗普新建立的同志情谊，马斯克的批评尤其尖锐。当特斯拉在美国的主要汽车工厂被加州迫使停产时，特朗普站在了马斯克一边。\n数千名低于该公司55000美元工资中值的特斯拉员工(监管文件中披露了这一数字)可能受益于失业奖金和1200美元的救济金。特斯拉人力资源公司不顾州政府的命令开业，他告诉员工，他们不会被迫返回，但可能会失去福利。\n周三，特斯拉公布了其有史以来最成功的财务季度之一，实现利润1.04亿美元，帮助其股价延续了长达一个月的涨势。与此同时，特斯拉宣布与德克萨斯州特拉维斯县和当地一个学区达成一项协议，提供数千万美元的税收减免，以换取在奥斯汀附近建立工厂。\n推特用户纷纷关注马斯克的推文，提醒他们特斯拉在内华达州、纽约等地发展业务时享受的政府福利，马斯克最终认定推特烂透了。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。\n形成一条X的两条交叉线。它指示一种关闭交互或取消通知的方式。", "note_en": "As  lawmakers spar over how to further aid the ailing United States economy, Elon Musk would like to see only direct payments be included.\n &#34;Another government stimulus package is not in the best interests of the people imo,&#34; the billionaire CEO, responsible for tens of thousands of workers&#39; paychecks,  said on Twitter Friday.\n Instead, Tesla&#39;s CEO suggested, any follow-up economic efforts &#34;should just be direct payments to consumers.&#34; (Another round of direct payments  is likely to happen, members of the Trump administration said this week).\n His criticism of the US economic bailout efforts comes as the country fails to contain the coronavirus outbreak, leading to record levels of unemployment and economic despair. A $600 weekly unemployment bonus coupled with the first $1,200 direct cash payment have largely been credited with  saving millions of Americans from falling below the poverty line. Paycheck Protection Act loans also  helped over 3 million employees of small businesses avoid layoffs.\n   But those measures are set to expire this week, and by August Goldman Sachs  predicts that the 11% unemployment rate is  likely to surge after funding runs out.\n Airlines and other industries that got special grants and loans in specific legislation may also lay off workers as fallout continues. That&#39;s likely the stem of Musk&#39;s criticism of special interests.\n &#34;These are jammed to gills with special interests earmarks,&#34; Musk tweeted, without specifying if the critique was of existing legislation or the options currently being weighed on Capital Hill. Republicans including President Trump have proposed a payroll tax cut as part of a second round of aid which isn&#39;t likely to be included in a final bill.\n &#34;Goal of government should be to maximize the happiness of the people,&#34; Musk said. &#34;Giving each person money allows them to decide what meets their needs, rather than the blunt tool of legislation, which creates self-serving special interests.&#34;\n   The criticisms by Musk are especially poignant given the executive&#39;s  newfound camaraderie with Trump, who sided with Musk as Tesla&#39;s main US car factory was forced to cease production by California.\n   Thousands of Tesla workers who fall below the company&#39;s median $55,000 salary — a number disclosed in regulatory filings — likely benefitted from unemployment bonuses and the $1,200 payment. As the company opened against state orders, Tesla HR told workers they wouldn&#39;t be forced to return, but may lose benefits.\n  On Wednesday, Tesla reported one of its most successful financial quarters ever, posting a profit of $104 million and helping its stock continue a months-long winning streak. In the same breath, Tesla announced a deal with Travis County in Texas and a local school district for  tens of millions of dollars in tax breaks in exchange for building its factory near Austin.\n   As Twitter users piled on to Musk&#39;s tweets with  reminders of the government benefits Tesla has used to grow its business in Nevada, New York and more, Musk eventually decided that &#34;twitter sucks.&#34;\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n        Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2020-07-25 02:34:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,刺激,musk,马斯克", "title": "埃隆·马斯克(Elon Musk)说，出于“特殊利益”，他不支持再推出一项政府刺激计划。他的44,000名员工中的大多数可能都从中受益。", "title_en": "Elon Musk says he doesn't support another government stimulus because of 'special interests.' Most of his 44,000 employees likely benefitted from it.", "transed": 1, "url": "https://www.businessinsider.com/elon-musk-stimulus-relief-update-should-only-include-direct-payments-2020-7", "via": "", "real_tags": ["埃隆·马斯克", "刺激", "musk", "马斯克"]}, {"category": "", "categoryclass": "", "imagename": "fff60c7c449456cdeda7d81a58054cc1.jpg", "infoid": 1014015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在TechCrunch早期虚拟会议的第一天，Ali Partovi和我们一起讨论了初创企业招聘工程师的最佳实践。这是一个他非常关心的话题：帕托维是Neo的联合创始人兼首席执行官，Neo是一家旨在将年轻工程师与经验丰富的行业老兵一起加入社区的企业。[…]", "note_en": "On day one of TechCrunch’s Early Stage virtual conference, Ali Partovi joined us to discuss best practices for startups looking to hire engineers. It’s a subject that’s near and dear to his heart: Partovi is co-founder and CEO of Neo, a venture aimed at including young engineers in a community alongside seasoned industry vets. The […]", "posttime": "2020-07-25 02:34:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,ali,企业", "title": "\nNeo的Ali Partovi谈招聘早期创业工程师的最佳实践", "title_en": "\n\t\t\t\tNeo’s Ali Partovi on best practices for hiring early-stage startup engineers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/24/neos-ali-partovi-on-best-practices-for-hiring-early-stage-startup-engineers/", "via": "", "real_tags": ["创业", "ali", "企业"]}, {"category": "", "categoryclass": "", "imagename": "9c6a44ebf1d9f0aabc80dc3fae69f52a.jpg", "infoid": 1014014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司正牵头向一家名为Promise的公司投资950万美元，该公司将推出一项结合睡眠训练和补充剂的产品，推出一种“整体”睡眠健康解决方案。\n根据Prote的估计，三分之一的美国成年人睡眠不足，该公司首席执行官南希·拉马穆尔蒂表示，新冠肺炎疫情只会让问题变得更糟。\nProte的创始人兼首席执行官Ramamurthi在一份声明中表示：“Prote的目标是帮助解决疾控中心认定的公共健康危机-睡眠不足-提供一个真正更全面、更个性化的解决方案，”Prote的创始人兼首席执行官拉马穆尔蒂(Ramamurthi)在一份声明中表示。Prote将最好的天然、安全、基于证据的睡眠补充剂与消费者传统上无法获得的专家行为指导结合在一起。现在，多亏了远程医疗的日益普及，睡眠辅导可以在网上进行。“。\n根据该公司的一份声明，来自Prote的睡眠指导服务是由董事会认证的健康和健康教练在临床心理学家和行为睡眠医学专家的指导下提供的。\nRamamurthi说，临床验证是公司业务的核心组成部分。事实上，该公司目前正在通过临床试验运行其配方，以证明其有效性。她说，这是该公司不需要采取的额外步骤，因为这些补充剂都经过了临床试验，支持使用这些成分作为睡眠疗法的治疗方法。“这还不包括它们被使用了数千年，”拉马穆尔蒂说。\nProte是在消费者健康合资工作室Redesign Health内孵化的，将利用以Snoop Dogg的Casa Verder为首的投资者的新资本来促进其销售和营销努力，并继续其研究和开发活动。\n虽然睡眠辅助设备对于一家专注于大麻的投资公司来说似乎是一个奇怪的市场，但卡萨维德的合伙人卡兰·瓦德加表示，这对该公司来说是一项高度战略性的投资。\n“(大麻)也是一种投入，它的使用案例将超越人们对大麻的耻辱看法，”Whera说。“它的核心是一家帮助我们瞄准这种睡眠流行病的公司。我们认为，CBD和大麻在解决这一问题方面可以发挥重要作用，这是传统产品无法做到的。“\n因此，随着投资者关注大麻植物的各种化学成分，并试图梳理出更广泛的健康和保健应用，对Prote的投资表明大麻行业已经成熟。“我们正开始转变对这项业务的看法。它不一定要是核心的、特定的大麻产品，“Whera说。\nRamamurthi说，她的公司稍后将探索大麻类化合物在补充剂中的应用。她说：“随着我们继续我们的产品开发过程，我们正在考虑的一件事是CBD。”“CBD是减轻压力和焦虑的有效成分之一，而压力和焦虑是人们睡不着觉的主要原因之一。”\nProte的研究得到了一个科学顾问委员会的支持，委员会成员包括梅奥诊所(Mayo Clinic)综合健康和福祉主任亚当·珀尔曼(Adam Perlman)博士，以及北卡罗来纳州退伍军人医疗中心(VA Medical Center)临床心理学家和委员会认证的睡眠医学专家艾莉森·西伯恩(Allison Siebern)博士。\n在美国，睡眠是一个健康问题，人们对此知之甚少，却忽视了它，这是有原因的。根据Prote的数据，大约90%的初级保健医生将他们对睡眠对身体影响的理解评为“差到一般”，每4.3万名美国人中只有一名获得董事会认证的睡眠专家。\n注册了Prote‘s服务的顾客可以选择五种睡眠配方中的一种，每瓶39.99美元，或者订阅10%的折扣。该公司表示，新用户还可以免费咨询适当的睡眠教练30分钟。\nProte睡眠产品的五个版本包括由GABA、缬草根提取物、雷公藤叶提取物、阿什瓦甘达根和叶提取物制成的核心睡眠产品；包括褪黑激素的睡眠和恢复产品；在核心睡眠产品中添加L-茶氨酸的镇静药片；以及包括浓缩葡萄提取物的透明产品；最后是添加锌、维生素C、B6和D的免疫产品。", "note_en": "The firm is leading a $9.5 million investment into a company called  Proper, which is launching with a combination of sleep coaching and supplements, pitching a “holistic” sleep health solution.\n One-third of US adults don’t get enough sleep according to Proper’s estimates, and the company’s chief executive, Nancy Ramamurthi, says that the COVID-19 epidemic has only made the problem worse.\n  “Proper aims to help solve what the CDC has identified as a public health crisis – insufficient sleep — with a truly more holistic and personalized solution,” said Ramamurthi, founder and CEO of Proper, in a statement. “Proper has combined the best of natural, safe, evidence-based sleep supplements with expert behavioral coaching, which consumers have not traditionally been able to access. Now, thanks to the increasing popularity of telehealth, sleep coaching can be delivered online.”\n The sleep coaching services from Proper are provided by board-certified health and wellness coaches under the guidance of a clinical psychologist and behavioral sleep medicine specialist, according to a statement from the company.\n Ramamurthi said that clinical validation is a core component of the company’s business. Indeed, the company is currently running its formulations through a clinical trial to prove their efficacy. It’s an additional step that the company doesn’t need to take, she said, because the supplements have all been studied with clinical trials supporting the use of the ingredients as treatments for sleep therapy. “That’s in addition to them being used for thousands of years,” said Ramamurthi.\n Proper was incubated within the consumer health venture studio  Redesign Health and will use the new capital from investors led by Snoop Dogg’s Casa Verde to boost its sales and marketing efforts and continue its research and development activities.\n While sleep aids may seem like a strange market for a cannabis-focused investment firm, Casa Verde partner Karan Wadhera says it’s a highly strategic investment for the firm.\n “ [Cannabis] is an input as well and its use case will go beyond how people think of cannabis stigmatically,” Wadhera said. “At its core, [Proper] is a company that’s helping us target this sleep epidemic. We think CBD and cannabis at large can play a big role in addressing that in a way that traditional products haven’t been able to.”\n The investment in Proper, then, points to a maturation of the cannabis industry, as investors look at the various chemical components of the cannabis plant and try to tease out a broader range of health and wellness applications. “We are starting to shift how we think about the business. It doesn’t have to be a core, specific cannabis product,” Wadhera said.\n  Ramamurthi says that her company will be exploring applications for cannabinoids in its supplements later. “ As we continue our product development process one of the things we are looking at is CBD,” she said. “CBD is one of the more effective ingredients at reducing stress and anxiety and stress and anxiety are one of the main reasons why people can’t get to sleep.”\n Proper’s studies are supported by a scientific advisory board that includes Dr. Adam Perlman, the director of integrative health and wellbeing at the Mayo Clinic, and Dr. Allison Siebern, a clinical psychologist and board-certified sleep medicine specialist at the VA Medical Center in North Carolina.\n There’s a reason why sleep is so poorly understood and ignored as a health issue in America. Around 90 percent of primary care physicians rate their understanding of sleep’s impact on the body as “poor to fair” and there’s only one board-certified sleep specialist for every 43,000 Americans, according to Proper’s data.\n Customers who sign up for  Proper’s service can select one of five sleep formulations available for $39.99 per bottle or for a subscription with a ten percent discount. New users also get a free 30-minute consultation with a Proper sleep coach, the company said.\n The five versions of Proper’s sleep products include a core sleep product made from GABA, valerian root extract, rafuma leaf extract, and ashwagandha root and leaf extract; a sleep and restore product that includes melatonin; a calming pill with L-theanine added to the core sleep product; and a clarity product that includes concentrated grape extracts; and, finally, an immunity product with added zinc, vitamin C, B6, and D.", "posttime": "2020-07-25 02:33:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "狗狗,dogg,睡眠", "title": "\n史努比狗狗的卡萨维德进入睡眠空间，支持纽约的专有公司", "title_en": "\n\t\t\t\tSnoop Dogg’s Casa Verde gets into the sleep space, backing NY-based Proper\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/24/snoop-doggs-casa-verde-gets-into-the-sleep-space-backing-ny-based-proper/", "via": "", "real_tags": ["狗狗", "dogg", "睡眠"]}, {"category": "", "categoryclass": "", "imagename": "521e8bacdb671cfc93a00ec35c3260be.jpg", "infoid": 1014013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔尔·夏皮罗(Joel Shapiro)博士是凯洛格管理学院(Kellogg School Of Management)数据分析临床副教授，负责凯洛格分析咨询实验室(Kellogg‘s Analytical Consulting Lab)。Joel也是领先的销售业绩管理软件提供商Varicent的首席分析官。\nVirtue创始人兼首席执行官里德·布莱克曼(Reid Blackman)博士与公司合作，将道德风险缓解纳入新兴技术产品的开发、部署和采购。他也是安永(Ernst&amp；Young)人工智能顾问委员会的创始成员。\n今天的数据和分析领导者肩负着用数据创造价值的重任。考虑到他们的技能和权限，他们在组织上也处于独特的地位，可以负责带头开展道德数据实践。缺乏可操作、可扩展和可持续的数据伦理框架会增加不良商业行为、违反利益相关者信任、损害品牌声誉、监管调查和诉讼的风险。\n以下是首席数据官/科学家和首席分析官(CDAO)在创建自己的道德数据和业务实践框架时应该采用的四个关键实践。\nCDAO必须识别并执行分析的经济机会，而机会也伴随着风险。无论数据的使用是内部的(例如，提高客户保留率或供应链效率)，还是内置到面向客户的产品和服务中，这些领导者都需要明确识别并降低与使用数据相关的损害风险。\n开始建立符合道德的数据实践的一个很好的方法是指望现有的组织(如数据治理委员会)建立一个数据道德框架，这些组织已经解决了隐私、合规和网络风险问题。道德框架与现有的基础设施相衔接，增加了成功和有效采用的可能性。或者，如果不存在这样的机构，则应成立一个新的机构，由组织内部的相关专家组成。数据伦理管理机构应负责将数据伦理原则正式化，并将这些原则用于开发中或已部署的产品或流程。\n所有分析和人工智能项目都需要数据收集和分析策略。合乎道德的数据收集至少必须包括：在收集人们的数据时确保知情同意，确保合法遵守，如遵守GDPR，匿名个人身份信息，使其不能被合理地反向工程以揭示身份和保护隐私。\n其中一些标准，如隐私保护，并不一定有必须达到的硬性标准。CDAO需要在道德上明智的做法和他们的选择如何影响业务结果之间进行适当的平衡。然后，必须将这些标准转化为产品经理的职责，而产品经理又必须确保一线数据收集者按照这些标准行事。\nCDAO还必须在算法伦理和透明度方面表明立场。例如，人工智能驱动的搜索功能或推荐系统是否应该努力实现最大的预测准确性，为用户真正想要的提供最佳猜测？微细分，将结果或推荐限制在其他“相似的人”过去点击过的内容，这符合道德吗？向某些第三方提供实际上不是可预测的、但能实现利润最大化的结果或建议，这合乎道德吗？多大程度的算法透明度是合适的，用户关心多少？一份强有力的道德蓝图需要系统和谨慎地解决这些问题，而不是将这些决定推给缺乏做出这些决定所需培训和经验的个别数据科学家和技术开发人员。\n部门和产品经理需要指导如何预测不公平和有偏见的结果。仅仅由于数据收集不平衡就可能出现不平等和偏见-例如，对100,000名男性面孔和5,000名女性面孔进行培训的面部识别工具可能会因性别而有所不同。CDAO必须帮助确保平衡和代表性的数据集。\n其他偏见不那么明显，但同样重要。2019年，苹果卡(Apple Card)和高盛(Goldman Sachs)被指在向男性提供比女性更高的信贷额度时存在性别偏见。尽管高盛(Goldman Sachs)坚持认为，信用-而不是性别-是信贷决策的驱动因素，但从历史上看，女性获得信贷的机会较少，这一事实可能意味着该算法有利于男性。\n为了缓解不平等，CDAO必须帮助技术开发人员和产品经理同样驾驭公平的含义。虽然计算机科学文献提供了无数公平的度量和定义，但在缺乏与业务经理和外部专家的协作的情况下，开发人员无法合理地选择其中一种，因为业务经理和外部专家可以提供对数据最终如何使用的深入上下文理解。一旦选择了公平标准，还必须将它们有效地传达给数据收集者，以确保遵守。\nCDAO通常通过以下两种方式之一构建分析能力：通过卓越中心，为整个组织提供服务，或者更分布式的模式，让数据科学家和分析投资致力于特定的功能领域，如营销、财务或运营。无论组织结构如何，识别道德风险的过程和准则都必须清楚地传达和适当地激励。\n通过建立数据伦理机构与部门和团队之间的联系，明确建立责任。这可以通过让每个部门或团队指定自己的“道德卫士”来监督道德问题来实现。拥护者需要能够将担忧提升到数据伦理机构，该机构可以就缓解策略提供建议，例如增加现有数据、提高透明度或创建新的目标函数。\n通过围绕数据和人工智能道德的教育和培训，确保团队之间的定义和流程一致。\n通过促进内部团队之间的协作和分享来自其他领域的实例和研究，拓宽团队在如何识别和补救道德问题方面的视角。\n创造激励措施--财务或其他认可--以建立重视道德风险识别和缓解的文化。\nCDAO负责数据的战略使用和部署，以通过新产品推动收入，并创造更大的内部一致性。今天，太多的业务和数据领导者试图通过简单地权衡决策出现时的利弊来“保持道德”。这种短视的观点造成了不必要的声誉、财务和组织风险。正如数据的战略方法需要数据治理计划一样，良好的数据治理也需要道德计划。简而言之，良好的数据治理就是合乎道德的数据治理。", "note_en": "Joel Shapiro, JD, Ph.D., is  Clinical Associate Professor of Data Analytics at the Kellogg School of Management, where he runs Kellogg’s Analytical Consulting Lab. Joel is also Chief Analytics Officer of  Varicent, a leading sales performance management software provider.\n Reid Blackman, Ph.D., founder and CEO of  Virtue, works with companies to integrate ethical risk mitigation into the development, deployment and procurement of emerging technology products. He is also a founding member of Ernst &amp; Young’s Artificial Intelligence Advisory Board.\n  Today’s data and analytics leaders are charged with creating value with data. Given their skill set and purview, they are also in the organizationally unique position to be responsible for spearheading ethical data practices. Lacking an operationalizable, scalable and sustainable data ethics framework raises the risk of bad business practices, violations of stakeholder trust, damage to a brand’s reputation, regulatory investigation and lawsuits.\n Here are four key practices that chief data officers/scientists and chief analytics officers (CDAOs) should employ when creating their own ethical data and business practice framework.\n   The CDAO must identify and execute on the economic opportunity for analytics, and with opportunity comes risk. Whether the use of data is internal — for instance, increasing customer retention or supply chain efficiencies — or built into customer-facing products and services, these leaders need to explicitly identify and mitigate risk of harm associated with the use of data.\n A great way to begin to build ethical data practices is to look to existing groups, such as a data governance board, that already tackles questions of privacy, compliance and cyber-risk, to build a data ethics framework. Dovetailing an ethics framework with existing infrastructure increases the probability of successful and efficient adoption. Alternatively, if no such body exists, a new body should be created with relevant experts from within the organization. The data ethics governing body should be responsible for formalizing data ethics principles and operationalizing those principles for products or processes in development or already deployed.\n  All analytics and AI projects require a data collection and analysis strategy. Ethical data collection must, at a minimum, include: securing informed consent when collecting data from people, ensuring legal compliance, such as adhering to GDPR, anonymizing personally identifiable information so that it cannot reasonably be reverse-engineered to reveal identities and protecting privacy.\n Some of these standards, like privacy protection, do not necessarily have a hard and fast level that must be met. CDAOs need to assess the right balance between what is ethically wise and how their choices affect business outcomes. These standards must then be translated to the responsibilities of product managers who, in turn, must ensure that the front-line data collectors act according to those standards.\n CDAOs also must take a stance on algorithmic ethics and transparency. For instance, should an AI-driven search function or recommender system strive for maximum predictive accuracy, providing a best guess as to what the user really wants? Is it ethical to micro-segment, limiting the results or recommendations to what other “similar people” have clicked on in the past? And is it ethical to include results or recommendations that are not, in fact, predictive, but profit-maximizing to some third party? How much algorithmic transparency is appropriate, and how much do users care? A strong ethical blueprint requires tackling these issues systematically and deliberately, rather than pushing these decisions down to individual data scientists and tech developers that lack the training and experience to make these decisions.\n  Division and product managers need guidance on how to anticipate inequitable and biased outcomes. Inequalities and biases can arise due simply to data collection imbalances — for instance, a facial recognition tool that has been trained on 100,000 male faces and 5,000 female faces will likely be differently effective by gender. CDAOs must help ensure balanced and representative data sets.\n Other biases are less obvious, but just as important. In 2019, Apple Card and Goldman Sachs were accused of gender bias when extending higher credit lines to men than women. Though Goldman Sachs maintained that creditworthiness — not gender — was the driving factor in credit decisions, the fact that women have historically had fewer opportunities to build credit likely meant that the algorithm favored men.\n To mitigate inequities, CDAOs must help tech developers and product managers alike navigate what it means to be fair. While computer science literature offers myriad metrics and definitions of fairness, developers cannot reasonably choose one in the absence of collaborations with the business managers and external experts who can offer deep contextual understanding of how data will eventually be used. Once standards for fairness are chosen, they must also be effectively communicated to data collectors to ensure adherence.\n  CDAOs often build analytics capacity in one of two ways: via a center of excellence, in service to an entire organization, or a more distributed model, with data scientists and analytics investments committed to specific functional areas, such as marketing, finance or operations. Regardless of organizational structure, the processes and rubrics for identifying ethical risk must be clearly communicated and appropriately incentivized.\n  Clearly establishing accountability by creating linkages from the data ethics body to departments and teams. This can be done by having each department or team designate its own “ethics champion” to monitor ethics issues. Champions need to be able to elevate concerns to the data ethics body, which can advise on mitigation strategies, such as augmenting existing data, improving transparency or creating a new objective function.\n Ensuring consistent definitions and processes across teams through education and training around data and AI ethics.\n Broadening teams’ perspectives on how to identify and remediate ethical problems by facilitating collaborations across internal teams and sharing examples and research from other domains.\n Creating incentives — financial or other recognitions — to build a culture that values the identification and mitigation of ethical risk.\n CDAOs are charged with the strategic use and deployment of data to drive revenue with new products and to create greater internal consistencies. Too many business and data leaders today attempt to “be ethical” by simply weighing the pros and cons of decisions as they arise. This short-sighted view creates unnecessary reputational, financial and organizational risk. Just as a strategic approach to data requires a data governance program, good data governance requires an ethics program. Simply put, good data governance is ethical data governance.", "posttime": "2020-07-25 02:33:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "道德,drafting,数据", "title": "\n起草道德数据实践蓝图的四个步骤", "title_en": "\n\t\t\t\tFour steps for drafting an ethical data practices blueprint\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/24/four-steps-for-an-ethical-data-practices-blueprint/", "via": "", "real_tags": ["道德", "drafting", "数据"]}, {"category": "", "categoryclass": "", "imagename": "039ca72490087f3267b3ec90cb8db5d9.jpg", "infoid": 1014012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊(Amazon.com)创始人杰夫·贝佐斯(Jeff Bezos)在2008年创业学校(Startup School)发表演讲", "note_en": "Jeff Bezos, Founder of Amazon.com, speaks at Startup School 2008", "posttime": "2020-07-25 02:32:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "创业,贝佐斯,bezos,jeff", "title": "杰夫·贝佐斯在创业学校(2008)", "title_en": "Jeff Bezos at Startup School (2008)", "transed": 1, "url": "https://youtu.be/6nKfFHuouzA", "via": "", "real_tags": ["创业", "贝佐斯", "bezos", "jeff"]}, {"category": "", "categoryclass": "", "imagename": "5ef764dda2763a0098663ebd479d4506.png", "infoid": 1014011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你曾经尝试过提供地理位置服务(例如，根据用户IP地址定义用户国家/地区)，那么你很可能听说过MaxMind。\nMaxMind-可能是提供Geo IP数据库和服务的最佳公司之一。\n然而，也有一些限制：如果你正在做一个副业，很可能你不想为地理定位服务支付额外的$。在这种情况下，MaxMind提供GeoLite2数据库，但是您将负责在您的服务器上托管此数据库并定期更新数据库。您还需要确保您的项目符合MaxMind&#39；的许可。\n在这个特定的示例中，我需要一个简单的地理位置服务，它将在可嵌入的javascript代码中使用(类似于Google Analytics或其他跟踪服务)，因此响应时间相当关键。\n在我的第一次尝试中，我尝试使用无服务器框架在AWS Lambda上托管简单的地理位置函数(该函数使用MaxMind GeoLite2数据库)。然而，我很快意识到响应时间和我预期的不一样--平均响应时间在200毫秒到500毫秒之间。所以我开始寻找其他选择。\n因此，我想，如果我不能在AWS Lambda上托管它，我还可以在哪里托管我的无服务器功能？我尝试的下一项服务是Cloudflare Workers。我创建了一个简单的函数来测试响应时间，它确实令人印象深刻-平均在30ms到80ms之间，与AWS相比，我的性能几乎提高了10倍。\n然而，这个解决方案有一个非常重要的警告--由于一些运行时限制，MaxMind GeoLite2数据库不能在Cloudflare Workers上运行。\n然后我想-嘿，等一下，因为Cloudflare提供DDoS保护服务，他们可能会在Cloudflare Workers中提供一些有趣的功能。在浏览了他们的文档之后，我意识到函数中的request对象可以访问cf对象，该对象包含一些关于访问者的有用信息，包括访问者所在的国家！\n这正是我正在寻找的，在几十行代码中，我启动并运行了我的地理定位功能。\n如果您以前没有使用过Cloudflare，您需要在Cloudflare.com注册并进入Workers目录。", "note_en": "If you ever tried to make a Geo-location service (e.g. define a user country based on user IP address), most likely you heard about  MaxMind.\n MaxMind - is probably one of best companies who provides Geo IP databases and services.\n However, there is a number of limitations: if you&#39;re making a side-project, most likely you do not want to pay extra $$$ for geolocation services. And for this case MaxMind offers GeoLite2 database, however you&#39;ll be in charge of hosting this database on your server and making regular updates of the database. You also need to make sure your project is compliant with MaxMind&#39;s License.\n  In this particular example, I needed a simple geo-location service which will be used in embeddable javascript code (similar to Google Analytics or other tracking service), so the response time is quite crucial.\n In my first attempt I tried to use Serverless framework to host simple geo-location function on AWS Lambda (this function uses MaxMind GeoLite2 database). However, I quickly realized that the response time isn&#39;t what I&#39;ve expected - on average the response took somewhere between from 200ms to 500ms. So I started looking for other options.\n So, I thought - if I could not host it on AWS Lambda, where else I could host my serverless function? The next service I tried - is  Cloudflare Workers. I created a simple function to test the reponse time, and it was really impressive - on average it was between from 30ms to 80ms, I&#39;ve got almost x10 better performance in comparison to AWS.\n However, this solution had one really big caveat - MaxMind GeoLite2 database does not work on Cloudflare Workers due to some runtime limitations.\n  And then I thought - hey, wait a second, as Cloudflare provides DDoS protection services, they might provide some interesting features in Cloudflare Workers. And after exploring their documentation, I realized that the  Request object in function have an access to  cf object, which contains some useful information about the visitor, including visitor&#39;s country!\n That&#39;s exactly what I was looking for, within a few dozens of lines of code I got my geolocation function up and running.\n  If you haven&#39;t worked with Cloudflare before, you need to signup at  Cloudflare.com and go to Workers directory.", "posttime": "2020-07-25 02:32:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "定位,geolocation,服务", "title": "我做了一个简单的地理定位服务", "title_en": "I made a simple geolocation service", "transed": 1, "url": "https://maxkostinevich.com/blog/serverless-geolocation/", "via": "", "real_tags": ["定位", "服务"]}]