[{"category": "", "categoryclass": "", "imagename": "ad0300951505e2513230092f49b390e6.jpg", "infoid": 1072352, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“把你的手机收起来”已经成为一个经常被忽视的常见短语。尽管想活在当下，但我们往往会在力所能及的范围内做相反的事情。我们在节日的家庭聚餐中拿出手机拍照，在约会中途或看电影时发送短信或更新我们的社交媒体资料。同时，我们经常被电子邮件或电话通知被动地打断。显然，与我们的智能手机互动会影响我们的体验。但是，即使我们不与智能手机互动——当它们就在附近时，我们的智能手机会影响我们吗？在最近的研究中，我们调查了仅在附近拥有自己的智能手机是否会影响认知能力。在两个实验室实验中，近 800 人完成了旨在测量其认知能力的任务。在一项任务中，参与者同时完成数学问题并记住随机字母。这测试了他们在从事复杂的认知任务时跟踪任务相关信息的能力。在第二个任务中，参与者看到一组形成不完整模式的图像，并选择最能完成模式的图像。这项任务测量“流体智力”，即人们推理和解决新问题的能力。这两项任务的表现都受个人可用心理资源的影响。我们的干预很简单：在完成这些任务之前，我们要求参与者将手机放在他们面前（面朝下放在办公桌上），将它们放在口袋或包里，或者将它们留在另一个房间。重要的是，所有手机都关闭了声音警报和振动功能，因此参与者不会被通知打扰。结果令人震惊：将手机放在另一个房间时完成这些任务的人表现最好，其次是将手机放在口袋里的人。排在最后的是那些电话放在办公桌上的人。当参与者的手机关闭时，我们看到了类似的结果：当他们的手机在附近时，人们的表现最差，而当他们不在一个单独的房间时，表现最好。因此，仅仅将智能手机放在办公桌上会导致个人认知能力出现轻微但具有统计学意义的损害——与睡眠不足的影响相当。这种认知能力对于帮助我们学习、推理和发展创意至关重要。通过这种方式，考虑到数十亿智能手机用户在他们的生活中无数时刻都在使用设备，即使对认知能力的影响很小也可能会产生很大的影响。这意味着在这些时刻，即使我们不使用智能手机，智能手机的存在也会对我们思考和解决问题的能力产生不利影响。即使我们不看它们。即使他们面朝下。即使它们完全断电。为什么智能手机如此分散注意力，即使它们没有对我们发出嗡嗡声或鸣叫声？智能手机的成本与其收益密不可分。智能手机提供的巨大价值，作为将我们彼此联系起来并连接到世界上几乎所有集体知识的个人枢纽，必然将它们定位为与我们日常生活的无数方面相关的重要内容。认知心理学研究表明，人类学会自动关注与他们习惯相关的事物，即使他们专注于不同的任务。例如，即使我们积极参与谈话，当有人在房间里喊我们的名字时，我们也会转过头来。同样，父母会自动关注婴儿的哭声。我们的研究表明，在某种程度上，我们智能手机的存在就像我们的名字的声音——它们不断地呼唤我们，对我们的注意力施加引力。如果您曾经感受到“幻影嗡嗡声”，那么您天生就知道这一点。试图阻止或抵制这种拉力会损害我们的认知能力。那么，令人心酸的是，这意味着当我们成功地抑制了关注智能手机的冲动时，我们实际上可能会破坏我们自己的认知能力。\n你受影响吗？最有可能的。想想你最近参加的会议或讲座：有人把智能手机放在桌子上吗？想想你上次去看电影、和朋友出去、看书或玩游戏是什么时候：你的智能手机在附近吗？在所有这些情况下，仅仅让您的智能手机在场可能会损害您的认知功能。我们的数据还显示，智能手机存在的负面影响对于在衡量其与手机的连接强度的衡量标准中排名靠前的人最为明显——也就是说，那些强烈同意诸如“我很难通过没有手机的正常一天”和“放弃手机一天对我来说会很痛苦。”在人们继续越来越依赖手机的世界中，期望这种影响变得更强大和更普遍是合乎逻辑的。我们显然不是第一个注意到智能手机潜在成本的人。想一想与边开车边打电话或发短信，或边走路边发短信相关的死亡人数。即使在您忙于做其他事情时听到电话铃声也会加剧您的焦虑。知道我们错过了一条短信或电话会导致我们走神，这会影响需要持续关注的任务的表现并破坏我们的乐趣。除了这些与认知和健康相关的后果之外，智能手机可能会损害我们的社交功能：在社交体验中将智能手机拿出来会分散您的注意力，并使他们不那么愉快。然而，考虑到所有这些成本，我们必须考虑智能手机提供的巨大价值。在一天的过程中，您可能会使用智能手机与朋友、家人和同事取得联系；在线订购产品；查看天气；交易股票；阅读 HBR；导航到新地址等等。显然，智能手机提高了我们的效率，使我们能够节省时间和金钱、与他人联系、提高工作效率并保持娱乐。那么我们如何解决智能手机成本和收益之间的这种紧张关系呢？智能手机有不同的用途。在某些情况下，我们的智能手机提供了一个关键价值，例如当它们帮助我们与我们想要见面的人取得联系时，或者当我们使用它们来搜索可以帮助我们做出更好决策的信息时。这些都是让我们的手机就在附近的好时机。但是，与其让智能手机接管我们的生活，不如让我们重新掌控自己的生活：当我们的智能手机不是直接必需的，并且在认知上完全可用很重要时，留出一段时间将它们收起来——在另一个房间——可以很有价值。考虑到这些发现，学生、员工和 CEO 们可能希望通过定义他们计划与手机分开的时间窗口来最大限度地提高他们的生产力，让他们能够完成需要更深入思考的任务。此外，要求员工在会议期间不要使用手机可能还不够。我们的工作表明，在没有电话的情况下召开会议会更有效，可以提高注意力、提高功能以及提出创造性解决方案的能力。更广泛地说，只需将智能手机（远）放在远处，我们都可以在日常生活中变得更加投入和认知熟练。", "note_en": "“Put your phone away” has become a commonplace phrase that is just as often dismissed. Despite wanting to be in the moment, we often do everything within our power to the contrary. We take out our phones to take pictures in the middle of festive family meals, and send text messages or update our social media profiles in the middle of a date or while watching a movie. At the same time, we are often interrupted passively by notifications of emails or phone calls. Clearly, interacting with our smartphones affects our experiences. But can our smartphones affect us even when we aren’t interacting with them — when they are simply nearby?\n  In  recent research, we investigated whether merely having one’s own smartphone nearby could influence cognitive abilities. In two lab experiments, nearly 800 people completed tasks designed to measure their cognitive capacity. In one task, participants simultaneously completed math problems and memorized random letters. This tests how well they can keep track of task-relevant information while engaging in a complex cognitive task. In the second task, participants saw a set of images that formed an incomplete pattern, and chose the image that best completed the pattern. This task measures “fluid intelligence,” or people’s ability to reason and solve novel problems. Performance on both of these tasks is affected by individuals’ available mental resources.\n  Our intervention was simple: before completing these tasks, we asked participants to either place their phones in front of them (face-down on their desks), keep them in their pockets or bags, or leave them in another room. Importantly, all phones had sound alerts and vibration turned off, so the participants couldn’t be interrupted by notifications.\n  The results were striking: individuals who completed these tasks while their phones were in another room performed the best, followed by those who left their phones in their pockets. In last place were those whose phones were on their desks. We saw similar results when participants’ phones were turned off: people performed worst when their phones were nearby, and best when they were away in a separate room. Thus, merely having their smartphones out on the desk led to a small but statistically significant impairment of individuals’ cognitive capacity — on par with effects of  lacking sleep.\n  This cognitive capacity is  critical for helping us learn, reason, and develop creative ideas. In this way, even a small effect on cognitive capacity can have a big impact, considering the billions of smartphone owners who have their devices present at countless moments of their lives. This means that in these moments, the mere presence of our smartphones can adversely affect our ability to think and problem-solve — even when we aren’t using them. Even when we aren’t looking at them. Even when they are face-down. And even when they are powered off altogether.\n  Why are smart phones so distracting, even when they’re not buzzing or chirping at us? The costs of smartphones are inextricably linked to their benefits. The immense value smartphones provide, as personal hubs connecting us to each other and to virtually all of the world’s collective knowledge, necessarily positions them as important and relevant to myriad aspects of our everyday lives. Research in cognitive psychology shows that humans learn to  automatically pay attention to things that are habitually relevant to them, even when they are focused on a different task. For example, even if we are actively engaged in a conversation, we will turn our heads when  someone says our name across the room. Similarly, parents automatically attend to the  sight or  sound of a baby’s cry.\n  Our research suggests that, in a way, the mere presence of our smartphones is like the sound of our names — they are constantly calling to us, exerting a gravitational pull on our attention. If you have ever felt a “ phantom buzz” you inherently know this. Attempts to block or resist this pull takes a toll by impairing our cognitive abilities. In a poignant twist, then, this means that when we are  successful at resisting the urge to attend to our smartphones, we may actually be undermining our own cognitive performance.\n  Are you affected? Most likely. Consider the most recent meeting or lecture you attended: did anyone have their smartphone out on the table? Think about the last time you went to the movies, or went out with friends, read a book, or played a game: was your smartphone close by? In all of these cases, merely having your smartphone present may have impaired your cognitive functioning.\n  Our data also show that the negative impact of smartphone presence is most pronounced for individuals who rank high on a measure capturing the strength of their connection to their phones — that is, those who strongly agree with statements such as “I would have trouble getting through a normal day without my cell phone” and “It would be painful for me to give up my cell phone for a day.” In a world where people continue to increasingly rely on their phones, it is only logical to expect this effect to become stronger and more universal.\n  We are clearly not the first to take note of the potential costs of smartphones. Think about the number of fatalities associated with  driving while talking on the phone or texting, or of  texting while walking. Even hearing your phone ring while you’re busy doing something else can  boost your anxiety. Knowing we have missed a text message or call leads our minds to wander, which can  impair performance on tasks that require sustained attention and  undermine our enjoyment. Beyond these cognitive and health-related consequences, smartphones may impair our social functioning: having your smartphone out can  distract you during social experiences and make them less enjoyable.\n  With all these costs in mind, however, we must consider the immense value that smartphones provide. In the course of a day, you may use your smartphone to get in touch with friends, family, and coworkers; order products online; check the weather; trade stocks; read HBR; navigate your way to a new address, and more. Evidently, smartphones increase our efficiency, allowing us to save time and money, connect with others, become more productive, and remain entertained.\n  So how do we resolve this tension between the costs and benefits of our smartphones?\n  Smartphones have distinct uses. There are situations in which our smartphones provide a key value, such as when they help us get in touch with someone we’re trying to meet, or when we use them to search for information that can help us make better decisions. Those are great moments to have our phones nearby. But, rather than smartphones taking over our lives, we should take back the reins: when our smartphones aren’t directly necessary, and when being fully cognitively available is important, setting aside a period of time to put them away — in another room — can be quite valuable.\n  With these findings in mind, students, employees, and CEOs alike may wish to maximize their productivity by defining windows of time during which they plan to be separated from their phones, allowing them to accomplish tasks requiring deeper thought. Moreover, asking employees not to use their phones during meetings may not be enough. Our work suggests that having meetings without phones present can be more effective, boosting focus, function, and the ability to come up with creative solutions. More broadly, we can all become more engaged and cognitively adept in our everyday lives simply by putting our smartphones (far) away.", "posttime": "2021-08-10 01:21:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,思维,影响,nearby,智能手机", "title": "将智能手机放在身边会影响您的思维", "title_en": "Having Your Smartphone Nearby Takes a Toll on Your Thinking", "transed": 1, "url": "https://hbr.org/2018/03/having-your-smartphone-nearby-takes-a-toll-on-your-thinking", "via": "", "real_tags": ["手机", "思维", "影响", "nearby", "智能手机"]}, {"category": "", "categoryclass": "", "imagename": "26db2545b75996c7b349aed4d3068373.jpg", "infoid": 1072351, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "心怀不满的 Conti 分支机构在进行攻击时泄露了该团伙的培训材料，其中包括有关勒索软件操作员之一的信息。 Conti Ransomware 操作作为勒索软件即服务 (RaaS) 运行，其中核心团队管理恶意软件和 Tor 站点，而招募的附属机构则执行网络漏洞和加密设备。作为这种安排的一部分，核心团队赚取赎金的 20-30%，而附属公司赚取其余部分。今天，一名安全研究人员分享了一个由愤怒的 Conti 分支机构创建的论坛帖子，该分支机构公开泄露了有关勒索软件操作的信息。该信息包括 Cobalt Strike C2 服务器的 IP 地址和一个 113 MB 的档案，其中包含大量用于进行勒索软件攻击的工具和培训材料。该附属公司表示，他们发布了这些材料，因为作为攻击的一部分，他只获得了 1,500 美元，而团队的其他成员正在赚取数百万美元，并承诺在受害者支付赎金后获得巨额赔偿。 “我把他们的钴服务器的 ip 地址和培训材料的类型合并给你。1500 美元是的，当然，他们招募吸盘并将钱分给他们，男孩们得到了受害者支付时他们会告诉他们的东西，”该附属机构在一个流行的俄语黑客论坛上发帖。附在上述帖子中的是 Cobalt Strike 信标配置的图像，其中包含勒索软件团伙使用的命令和控制服务器的 IP 地址。\n在安全研究员 Pancak3 的推文中，建议每个人都阻止这些 IP 地址，以防止来自该组织的攻击。在随后的帖子中，该附属公司共享了一个包含 111 MB 文件的档案，其中包括黑客工具、俄文手册、培训材料和据称在执行 Conti 勒索软件攻击时提供给附属公司的帮助文档。一位安全研究人员与 BleepingComputer 分享了此提取文件夹的屏幕截图。我们被告知它包含有关部署 Cobalt Strike 的手册、用于转储 NTLM 哈希的 mimikatz 以及许多其他填充了各种命令的文本文件。已经分析过档案的高级英特尔的 Vitali Kremez 告诉 BleepingCompter，培训材料与活跃的 Conti 案例相匹配。 “我们可以根据我们的活跃案例进行确认。这个剧本与我们现在看到的 Conti 的活跃案例相匹配，”Kremez 在一次对话中告诉 BleepingComputer。 “总的来说，它是来自 AZ 的 Conti 勒索软件“渗透测试”团队背后渗透测试操作的圣杯。其影响是巨大的，允许新的渗透测试勒索软件操作员逐步提高他们的渗透测试技能以应对勒索软件。” “此次泄密还显示了他们勒索软件组织的成熟度，以及他们在针对全球公司时的复杂、细致和经验。”\n“它还提供了大量的检测机会，包括专注于 AnyDesk 持久性和 Atera 安全软件代理持久性以在检测中存活的小组。”这种泄漏说明了勒索软件即服务操作的脆弱性，因为一个不满意的附属机构可能会导致攻击中使用的精心培育的信息和资源的暴露。最近，美国政府宣布其正义奖励计划现在正在接受有关针对美国关键基础设施的外国恶意网络活动的提示，并可能为提供有用信息提供 1000 万美元的奖励。此外，通过该计划的奖励可能会以加密货币匿名完成，这可能会激励低收入的附属机构攻击其他网络犯罪分子。 21 年 8 月 6 日更新：一位消息人士告诉 BleepingComputer，康蒂在得知他正在通过推广不同的身份不明的附属计划从他们的运营中挖走业务后，禁止了渗透测试人员。", "note_en": "A disgruntled Conti affiliate has leaked the gang&#39;s training material when conducting attacks, including information about one of the ransomware&#39;s operators.\n The Conti Ransomware operation is run as a ransomware-as-a-service (RaaS), where the core team manages the malware and Tor sites, while recruited affiliates perform network breaches and encrypt devices.\n As part of this arrangement, the core team earns 20-30% of a ransom payment, while the affiliates earn the rest.\n Today, a security researcher shared a forum post created by an angry Conti affiliate who publicly leaked information about the ransomware operation. This information includes the IP addresses for Cobalt Strike C2 servers and a 113 MB archive containing numerous tools and training material for conducting ransomware attacks.\n  The affiliate said they posted the material as he was only paid $1,500 as part of an attack, while the rest of the team are making millions and promising big payouts after a victim pays a ransom.\n &#34;I merge you their ip-address of cobalt servers and type of training materials. 1500 $ yes, of course, they recruit suckers and divide the money among themselves, and the boys are fed with what they will let them know when the victim pays,&#34; the affiliate posted to a popular Russian-speaking hacking forum.\n Attached to the above post are images of Cobalt Strike beacon configurations that contain the IP addresses for command and control servers used by the ransomware gang.\n In a tweet by security researcher Pancak3, it is advised that everyone block those IP addresses to prevent attacks from the group.\n  In a subsequent post, the affiliate shared an archive containing 111 MB of files, including hacking tools, manuals written in Russian, training material, and help documents that are allegedly provided to affiliates when performing Conti ransomware attacks.\n A security researcher shared a screenshot of this extracted folder with BleepingComputer. We were told it contains a manual on deploying Cobalt Strike, mimikatz to dump NTLM hashes, and numerous other text files filled with various commands.\n  Advanced Intel&#39;s Vitali Kremez, who had already analyzed the archive, told BleepingCompter that the training material matches active Conti cases.\n &#34;We can confirm based on our active cases. This playbook matches the active cases for Conti as we see right now,&#34; Kremez told BleepingComputer in a conversation.\n &#34;By and large, it is the holy grail of the pentester operation behind the Conti ransomware &#34;pentester&#34; team from A-Z. The implications are huge and allow new pentester ransomware operators to level up their pentester skills for ransomware step by step.&#34;\n &#34;The leak also shows the maturity of their ransomware organization and how sophisticated, meticulous and experienced they are while targeting corporations worldwide.&#34;\n &#34;It also provides a plethora detection opportunities including the group focus on AnyDesk persistence and Atera security software agent persistence to survive detections.&#34;\n This leak illustrates the vulnerability of ransomware-as-a-service operations, as a singly unhappy affiliate could lead to the exposure of carefully cultivated information and resources used in attacks.\n Recently the United States government announced that its Rewards for Justice program is now accepting tips on foreign malicious cyberactivity against U.S. critical infrastructure, with a potential  $10 million reward for helpful information.\n Additionally, rewards through this program may be done anonymously in cryptocurrency, which could incentivize low-paid affiliates to turn on other cybercriminals.\n Update 8/6/21: A source told BleepingComputer that Conti banned the pentester after learning he was poaching business away from their operation by promoting a different unidentified affiliate program.", "posttime": "2021-08-10 01:20:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,泄露,conti", "title": "愤怒的 Conti 勒索软件附属机构泄露了团伙的攻击手册", "title_en": "Angry Conti ransomware affiliate leaks gang's attack playbook", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/angry-conti-ransomware-affiliate-leaks-gangs-attack-playbook/", "via": "", "real_tags": ["软件", "泄露", "conti"]}, {"category": "", "categoryclass": "", "imagename": "1af1b07046405fdcbe398446d8b23597.jpg", "infoid": 1072350, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马萨诸塞州公共卫生官员的新数据显示，在冠状病毒突破性感染后死亡的完全接种疫苗的人中，绝大多数都有潜在的疾病，使他们更有可能患上重症。此外，根据州公共卫生部的新数据，马萨诸塞州疫苗突破病例死亡的中位年龄为 82.5 岁。湾州有 100 例突破性病例死亡，占所有完全接种疫苗的人数的 0.002%，即每 100,000 名接种疫苗的居民中约有两人死亡。该州已有超过 430 万人接种了疫苗。在 100 例突破性病例死亡中，据报道，这些病例中有 73% 有潜在疾病，使他们更可能患上严重疾病。总体而言，有 395 例突破性住院治疗，占所有完全接种疫苗者的 0.009%。在 395 次住院治疗中，据报道这些患者中有 57% 有潜在疾病。波士顿大学传染病专家戴维森·哈默 (Davidson Hamer) 表示，这一新数据与其他国家的突破性病例数据相当。哈默说：“病情严重到需要住院治疗的突破性病例通常是老年人和有基础疾病且免疫功能低下的人。” “因此，现在需要真正小心的是老年人、有基础疾病的人和免疫功能低下的人。”\n由于传染性更高的三角洲变异体的传播，最近几周马萨诸塞州的突破性病例一直在增加。该州上周报告称，有 7,737 名完全接种疫苗的人的 COVID-19 检测呈阳性，一周内增加了 1,364 例，或平均每天 195 例。 7,737 例突破性病例占马萨诸塞州 430 万完全接种疫苗的人的 0.18%。 DPH 在一份声明中说：“马萨诸塞州的突破性病例非常少，住院或死亡的人数甚至更少。” “所有可用数据继续支持美国使用的所有 3 种疫苗都对所有已知的 COVID-19 变体引起的严重疾病和死亡具有高度保护作用。保护自己和亲人的最佳方法是接种疫苗。” South Shore Health 传染病主任托德·埃勒林 (Todd Ellerin) 说，突破性感染导致的死亡“非常罕见”。 “但当它发生时，通常是老年人或免疫功能低下的人，”埃勒林说，并强调说，“疫苗表明它对老年人具有极强的保护作用。”美国国家过敏和传染病研究所所长安东尼·福奇博士周日在“与媒体见面”上说，那些免疫功能低下并接种了疫苗的人“可能一开始就没有得到很好的反应”。\n担任拜登总统首席医疗顾问的福奇说：“对于这些人，我强烈支持尽快让他们接受额外的注射。”福奇说，根据疫苗随时间推移的有效性数据，老年人可能会在其他人群之前接种疫苗。", "note_en": "New data from Massachusetts public health officials reveals that a significant majority of fully vaccinated people who died after a coronavirus breakthrough infection had underlying conditions that made them more likely to have a severe case.\n Also, the median age of Massachusetts vaccine breakthrough cases who died has been 82.5 years, according to the new data from the state Department of Public Health.\n There have been  100 breakthrough case deaths in the Bay State, which is 0.002% of all fully vaccinated individuals, or about two for every 100,000 residents who got their shots. More than 4.3 million people in the state have been fully vaccinated.\n Of the 100 breakthrough case deaths, 73% of these cases were reported to have underlying conditions that made them more likely to have severe disease.\n   Overall, there have been  395 breakthrough hospitalizations, which is 0.009% of all fully vaccinated individuals. Of the 395 hospitalizations, 57% of these patients were reported to have underlying conditions.\n This new data is comparable to the data of breakthrough cases in other countries, said Davidson Hamer, a Boston University specialist in infectious diseases.\n “The breakthrough cases that are sick enough to be hospitalized is generally older people and those with underlying conditions and who are immunocompromised,” Hamer said. “So the people who need to be really careful right now is older people and  those who have underlying conditions and those who are immunocompromised.”\n Breakthrough cases have been rising in Massachusetts in recent weeks amid the spread of the more highly contagious delta variant.\n The state last week reported that  7,737 fully vaccinated people have tested positive for COVID-19, a jump of 1,364 cases in one week, or a daily average of 195 cases.\n   The 7,737 breakthrough cases is 0.18% of the 4.3 million fully vaccinated people in Massachusetts.\n “Breakthrough cases in Massachusetts are incredibly low, and those hospitalized or who have died are even lower,” the DPH said in a statement. “All available data continue to support that all 3 vaccines used in the US are highly protective against severe disease and death from all known variants of COVID-19. The best way to protect yourself and your loved ones is to get vaccinated.”\n Deaths from breakthrough infections is “very uncommon,” said Todd Ellerin, director of infectious diseases at South Shore Health.\n “But when it happens, it’s usually those who are elderly or immunocompromised,” Ellerin said, stressing, “The vaccine has shown that it’s been extremely protective in the elderly.”\n   Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, said on “Meet The Press” Sunday that  those who are immunocompromised and got vaccinated, “likely never got a good response to begin with.”\n “For those individuals, I am strongly in favor of getting them that additional shot as soon as possible,” said Fauci, who serves as chief medical adviser to President Biden.\n Those who are elderly will likely get a booster before other groups, Fauci said, based on data of the vaccine’s effectiveness over time.", "posttime": "2021-08-10 01:20:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,coronavirus,数据", "title": "MA 冠状病毒突破性死亡：73% 有潜在疾病，中位年龄 82", "title_en": "MA coronavirus breakthrough deaths: 73% had underlying conditions, median age 82", "transed": 1, "url": "https://www.bostonherald.com/2021/08/08/massachusetts-coronavirus-breakthrough-deaths-73-had-underlying-conditions-median-age-was-82-5/", "via": "", "real_tags": ["病毒", "冠状病毒", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072348, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "bpftrace 是一个新的 Linux 开源跟踪器，用于分析生产性能问题和故障排除软件。许多公司都在使用它，包括 Netfilx、Facebook、Red Hat、Shopify 等。它由 Alastair Robertson 创建，Alastair Robertson 是一位才华横溢的英国开发人员，曾在各种编码比赛中获胜。 Linux 已经有许多性能工具，但这些工具通常是基于计数器的并且可见性有限。例如，iostat(1) 或监控代理可能会告诉您平均磁盘延迟，但不会告诉您此延迟的分布。分布可以揭示多种模式或异常值，其中任何一种都可能是导致性能问题的真正原因。 bpftrace 适用于这种分析：将指标分解为分布或每个事件的日志，并创建新的指标以了解盲点。您可以通过单行程序或脚本使用 bpftrace，它附带了许多预先编写的工具。这是一个示例屏幕截图：跟踪 PID 181 的读取延迟分布，并将其显示为 2 的幂直方图：# bpftrace -e &#39;kprobe:vfs_read /pid == 30153/ { @start[tid] = nsecs ; }kretprobe:vfs_read /@start[tid]/ { @ns = hist(nsecs - @start[tid]);删除(@start[tid]); }&#39;附加2个探针...^C@ns:[256, 512) 10900 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ |[512, 1k) 18291 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@|[1k, 2k) 4998 |@@@@@@@@@@@@@@|[2k, 4k) 57 | |[4k, 8k) 117 | |[8k, 16k) 48 | |[16k, 32k) 109 | |[32k, 64k) 3 | |此示例检测了数千个可用事件之一。如果您遇到一些奇怪的性能问题，可能有一些 bpftrace one-liner 可以解决这个问题。对于大型环境，此功能可以帮助您节省数百万美元。对于较小的环境，它可以更有用地帮助消除延迟异常值。我之前写过关于 bpftrace 与其他跟踪器的文章，包括 BCC（BPF 编译器集合）。 BCC 非常适合罐装的复杂工具和代理。 bpftrace 最适合短脚本和临时调查。在这篇文章中，我将总结 bpftrace 语言、变量类型、探针和工具。 bpftrace 使用 BPF（伯克利数据包过滤器），这是一种处理虚拟指令集的内核执行引擎。近年来，BPF 得到了扩展（又名 eBPF），以提供一种安全的方式来扩展内核功能，并已成为系统工程中的热门话题，在上届 Linux Plumber 会议上至少有 24 场关于 BPF 的演讲。 BPF 在 Linux 内核中，bpftrace 是开始使用 BPF 进行可观察性的最佳方式。\n有关如何安装它，请参阅 bpftrace INSTALL 指南，并获取最新版本：0.9.1 刚刚发布。对于 Kubernetes 集群，还有用于运行它的 kubectl-trace。探针指定要检测的事件，过滤器是可选的，可以根据布尔表达式过滤事件，动作是运行的小程序。探针是 BEGIN，一个特殊的探针，它运行在程序的开头（如 awk）。没有过滤器。该操作是一个 printf() 语句。这使用 kretprobe 来检测 sys_read() 内核函数的返回。如果 PID 是 181，一个特殊的映射变量 @bytes 被填充一个 log2 直方图函数，返回值是 sys_read()。这会生成 PID 181 的返回读取大小的直方图。您的应用程序是否进行了大量 1 字节读取？也许可以优化。这些是相关的探针库。当前支持的类型是（将添加更多类型）： 如果您不熟悉这个术语：动态检测（又名动态跟踪）是一种超能力，它使您无需重新启动即可跟踪正在运行的二进制文件中的任何软件功能。这可以让您深入了解任何问题。但是，它公开的函数不被视为稳定的 API，因为它们可以从一个软件版本更改为另一个软件版本。因此静态检测，其中事件点被硬编码并成为稳定的 API。写bpftrace程序时，尽量先用静态类型，再用动态类型，这样你的程序会更稳定。带有“@”前缀的变量使用 BPF 映射，其行为类似于关联数组。它们可以通过以下两种方式之一进行填充：\n学习 bpftrace 的一个好方法是通过 one-liners，我把它变成了 one-liners 教程。该教程涵盖以下单行： 1. 列出探针 bpftrace -l &#39;tracepoint:syscalls:sys_enter_*&#39;2。 Hello world bpftrace -e &#39;BEGIN { printf(&quot;hello world\\n&quot;) }&#39;3.文件打开 bpftrace -e &#39;tracepoint:syscalls:sys_enter_open { printf(&quot;%s %s\\n&quot;, comm, str(args-&gt;filename)) }&#39;4.系统调用按进程 bpftrace -e &#39;tracepoint:raw_syscalls:sys_enter { @[comm] = count() }&#39;5. read() 字节的分布 bpftrace -e &#39;tracepoint:syscalls:sys_exit_read /pid == 18644/ { @bytes = hist(args-&gt;retval) }&#39;6. read() 字节的内核动态跟踪 bpftrace -e &#39;kretprobe:vfs_read { @bytes = lhist(retval, 0, 2000, 200) }&#39;7.计时 read()s bpftrace -e &#39;kprobe:vfs_read { @start[tid] = nsecs } kretprobe:vfs_read /@start[tid]/ { @ns[comm] = hist(nsecs - @start[tid]);删除(@start[tid]) }&#39;8.计数进程级事件 bpftrace -e &#39;tracepoint:sched:sched* { @[name] = count() } interval:s:5 { exit() }&#39;9.配置 CPU 内核堆栈 bpftrace -e &#39;profile:hz:99 { @[stack] = count() }&#39;10.调度程序跟踪 bpftrace -e &#39;tracepoint:sched:sched_switch { @[stack] = count() }&#39;11.块 I/O 跟踪 bpftrace -e &#39;tracepoint:block:block_rq_complete { @ = hist(args-&gt;nr_sector * 512) }&#39; 除了单行程序，bpftrace 程序还可以是多行脚本。 bpftrace 附带了其中 28 个作为工具： tools# ls *.btbashreadline.bt dcsnoop.bt oomkill.bt syncsnoop.bt vfscount.btbiolatency.bt execsnoop.bt opensnoop.bt syscount.bt vfsstat.btbiosnoop.btper get bt tcpaccept.bt writeback.btbitesize.bt killsnoop.bt runqlat.bt tcpconnect.bt xfsdist.btcapable.bt load.bt runqlen.bt tcpdrop.btcpuwalk.bt mdflush.bt statsnoop.bt 与他们的性能使用 tdiagnosbtrans 使用问题和一般故障排除，它们还提供了另一种学习 bpftrace 的方法：通过示例。 tools# cat -n biolatency.bt 1 /* 2 * biolatency.bt 块 I/O 延迟作为直方图。 3 * 对于 Linux，使用 bpftrace、eBPF。 4 * 5 * 这是同名 bcc 工具的 bpftrace 版本。 6 * 7 * 版权所有 2018 Netflix, Inc. 8 * 根据 Apache 许可证获得许可，版本 2.0（“许可证”）9 * 10 * 2018 年 9 月 13 日 Brendan Gregg 创建了这个。 11 */ 12 13 BEGIN 14 { 15 printf(&quot;Tracing block device I/O... Hit Ctrl-C to end.\\n&quot;); 16 } 17 18 kprobe:blk_account_io_start 19 { 20 @start[arg0] = nsecs; 21 } 22 23 kprobe:blk_account_io_done 24 /@start[arg0]/ 25 26 { 27 @usecs = hist((nsecs - @start[arg0]) / 1000); 28 删除(@start[arg0]); 29 } 30 31 END 32 { 33 清除（@start）； 34 } 它简单易读，而且足够简短，可以包含在幻灯片中。此版本使用内核动态跟踪来检测 blk_account_io_start() 和 blk_account_io_done() 函数，并将它们之间以 arg0 为键的时间戳传递给每个函数。 kprobe 上的 arg0 是该函数的第一个参数，对于这些参数是 struct request *，其内存地址用作唯一标识符。\n*_example.txt 文件中还提供了这些工具的屏幕截图，我在其中准确解释了我们所看到的内容。例如：tools# more biolatency_example.txtDemolatency of biolatency，Linux BPF/bpftrace 版本。这会跟踪块 I/O，并将延迟显示为 2 的幂直方图。例如：# biolatency.btAttaching 3 probes...Tracing block device I/O...按Ctrl-C 结束。^C@usecs:[256, 512) 2 | |[512, 1K) 10 |@ |[1K, 2K) 426 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @@@@@@@@@@@@@@@@@@@@|[2K, 4K) 230 |@@@@@@@@@@@@@@@@@@@@@@@ @@@@@ |[4K, 8K) 9 |@ |[8K, 16K) 128 |@@@@@@@@@@@@@@@ |[16K, 32K) 68 |@@@@@ @@@ |[32K, 64K) 0 | |[64K, 128K) 0 | |[128K, 256K) 10 |@ |跟踪时，这表明 426 块 I/O 的延迟在 1K 到 2Kusecs（1024 到 2048 微秒）之间，在 1 到 2 毫秒之间。还有两种模式可见，一个在 1 到 2 毫秒之间，另一个在 8 到 16 毫秒之间：这听起来像是缓存命中和缓存未命中。还有 10 个 I/O 延迟为 128 到 256 毫秒：异常值。其他工具和仪器，如 biosnoop.bt，可以更清楚地了解这些异常值。[...] 有时在尝试理解这些工具时直接切换到示例文件是最有效的，因为输出可能是不言而喻的（按设计！）。在 /man/man8 下还有每个工具的手册页。它们包括关于输出字段的部分，以及工具的预期开销。 # nroff -man man/man8/biolatency.8biolatency(8) 系统管理员手册 biolatency(8)NAME biolatency.bt - 块 I/O 延迟作为直方图。使用 bpftrace/eBPF.SYNOPSIS biolatency.btDESCRIPTION 该工具将块设备 I/O（磁盘 I/O）中花费的时间（延迟）总结为 2 的幂直方图。这允许研究分布，包括模式和异常值。通常有两种模式，一种用于设备缓存命中，另一种用于缓存未命中，可以通过此工具显示。延迟异常值也将显示。[...] 编写所有这些手册页是开发这些工具中最不有趣的部分，在某些情况下，编写工具的时间比开发工具所需的时间长，但很高兴看到最终结果.由于 eBPF 已经合并到内核中，所以大部分工作都放在 BCC 前端，它提供了一个 BPF 库和 Python、C++ 和 lua 接口来编写程序。我已经在 BCC/python 中开发了很多工具，虽然在 BCC 中编码很冗长，但效果很好。如果您正在解决性能问题，bpftrace 更适合您拥有的所有一次性自定义查询。如果您正在编写具有许多命令行选项的工具或使用 Python 库的代理，您将需要考虑使用 BCC。\n以下是 Netflix 将如何使用这些：在性能团队中，我同时使用两者：BCC 用于开发其他人可以轻松使用的罐头工具，以及用于开发代理；和 bpftrace 用于临时分析。比如说，在网络工程团队中，他们一直在使用 BCC 来开发满足他们需求的代理。安全团队最感兴趣的是 bpftrace，它可以快速检测零日漏洞。对于开发人员团队：我希望他们会在不知道的情况下通过我们正在构建的自助服务 GUI（Vector）使用这两者，并且偶尔可能会通过 ssh 连接到一个实例并运行一个固定工具或临时 bpftrace one-liner。今年我还出版了一本涵盖 bpftrace 的书：BPF 性能工具：Linux 系统和应用程序可观察性，由 Addison Wesley 出版，其中包含许多新的 bpftrace 工具。感谢 Alastair Robertson 创建 bpftrace，感谢 bpftrace、BCC 和 BPF 社区在过去五年中所做的所有工作。你可以在这里发表评论，但我不能保证你的评论会永远留在这里：我可能会在某个时候切换评论系统（例如，如果disqus添加广告）。由 Disqus 提供支持的评论", "note_en": "bpftrace is a new open source tracer for Linux for analyzing production performance problems and troubleshooting software. It is used by and has had contributions from many companies including Netfilx, Facebook, Red Hat, Shopify, and others. It was created by Alastair Robertson, a talented UK-based developer who has previously won various coding competitions.\n Linux already has many performance tools, but these are often counter-based and have limited visibility. For example, iostat(1), or a monitoring agent, may tell you your average disk latency, but not the distribution of this latency. Distributions can reveal multiple modes, or outliers, either of which may be the real cause of your performance problems. bpftrace is suited for this kind of analysis: decomposing metrics into distributions or per-event logs, and creating new metrics for visibility into blind spots.\n You can use bpftrace via one-liners or scripts, and it ships with many prewritten tools. Here is an example screenshot: tracing the distribution of read latency for PID 181, and showing it as a power-of-two histogram:\n #  bpftrace -e &#39;kprobe:vfs_read /pid == 30153/ { @start[tid] = nsecs; }kretprobe:vfs_read /@start[tid]/ { @ns = hist(nsecs - @start[tid]); delete(@start[tid]); }&#39;Attaching 2 probes...^C@ns:[256, 512) 10900 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ |[512, 1k) 18291 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@|[1k, 2k) 4998 |@@@@@@@@@@@@@@ |[2k, 4k) 57 | |[4k, 8k) 117 | |[8k, 16k) 48 | |[16k, 32k) 109 | |[32k, 64k) 3 | |\n This example instrumented one of many thousands of available events. If you have some weird performance problem, there&#39;s probably some bpftrace one-liner that can shed light on it. For large environments, this ability can help you save millions. For smaller environments, it can be of more use helping eliminate latency outliers.\n I  previously wrote about bpftrace vs other tracers, including  BCC (BPF Compiler Collection). BCC is great for canned complex tools and agents. bpftrace is best for short scripts and ad hoc investigations. In this post I&#39;ll summarize the bpftrace language, variable types, probes, and tools.\n bpftrace uses BPF (Berkeley Packet Filter), an in-kernel execution engine that processes a virtual instruction set. BPF has been extended (aka eBPF) in recent years for providing a safe way to extend kernel functionality, and has become a hot topic in systems engineering, with at least 24 talks on BPF at the last Linux Plumber&#39;s conference. BPF is in the Linux kernel, and bpftrace is the best way to get started using BPF for observability.\n See the bpftrace  INSTALL guide for how to install it, and get the latest version:  0.9.1 was just released. For Kubernetes clusters, there is also  kubectl-trace for running it.\n   The probe specifies what events to instrument, the filter is optional and can filter down the events based on a boolean expression, and the action is the mini program that runs.\n   The probe is  BEGIN, a special probe that runs at the beginning of the program (like awk). There&#39;s no filter. The action is a  printf() statement.\n   This uses a kretprobe to instrument the return of the sys_read() kernel function. If the PID is 181, a special map variable  @bytes is populated with a log2 histogram function with the return value  retval of sys_read(). This produces a histogram of the returned read size for PID 181. Is your app doing lots of 1 byte reads? Maybe that can be optimized.\n  These are libraries of probes which are related. The currently supported types are (more will be added):\n  If you&#39;re new to this terminology: dynamic instrumentation (aka dynamic tracing) is the superpower that lets you trace any software function in a running binary without restarting it. This lets you get to the bottom of just about any problem. However, the functions it exposes are not considered a stable API, as they can change from one software version to another. Hence static instrumentation, where event points are hard-coded and become a stable API. When you write bpftrace programs, try to use the static types first, before the dynamic ones, so that your programs are more stable.\n   Variables with a &#39;@&#39; prefix use BPF maps, which can behave like associative arrays. They can be populated in one of two ways:\n           A great way to learn bpftrace is via one-liners, which I turned into the  one-liners tutorial. That tutorial covers the following one-liners:\n 1. Listing probes bpftrace -l &#39;tracepoint:syscalls:sys_enter_*&#39;2. Hello world bpftrace -e &#39;BEGIN { printf(&#34;hello world\\n&#34;) }&#39;3. File opens bpftrace -e &#39;tracepoint:syscalls:sys_enter_open { printf(&#34;%s %s\\n&#34;, comm, str(args-&gt;filename)) }&#39;4. Syscall counts by process bpftrace -e &#39;tracepoint:raw_syscalls:sys_enter { @[comm] = count() }&#39;5. Distribution of read() bytes bpftrace -e &#39;tracepoint:syscalls:sys_exit_read /pid == 18644/ { @bytes = hist(args-&gt;retval) }&#39;6. Kernel dynamic tracing of read() bytes bpftrace -e &#39;kretprobe:vfs_read { @bytes = lhist(retval, 0, 2000, 200) }&#39;7. Timing read()s bpftrace -e &#39;kprobe:vfs_read { @start[tid] = nsecs } kretprobe:vfs_read /@start[tid]/ { @ns[comm] = hist(nsecs - @start[tid]); delete(@start[tid]) }&#39;8. Count process-level events bpftrace -e &#39;tracepoint:sched:sched* { @[name] = count() } interval:s:5 { exit() }&#39;9. Profile on-CPU kernel stacks bpftrace -e &#39;profile:hz:99 { @[stack] = count() }&#39;10. Scheduler tracing bpftrace -e &#39;tracepoint:sched:sched_switch { @[stack] = count() }&#39;11. Block I/O tracing bpftrace -e &#39;tracepoint:block:block_rq_complete { @ = hist(args-&gt;nr_sector * 512) }&#39;\n   Apart from one-liners, bpftrace programs can be multi-line scripts. bpftrace ships with 28 of these as tools:\n   tools#  ls *.btbashreadline.bt dcsnoop.bt oomkill.bt syncsnoop.bt vfscount.btbiolatency.bt execsnoop.bt opensnoop.bt syscount.bt vfsstat.btbiosnoop.bt gethostlatency.bt pidpersec.bt tcpaccept.bt writeback.btbitesize.bt killsnoop.bt runqlat.bt tcpconnect.bt xfsdist.btcapable.bt loads.bt runqlen.bt tcpdrop.btcpuwalk.bt mdflush.bt statsnoop.bt tcpretrans.bt\n Apart from their use with diagnosing performance issues and general troubleshooting, they also provide another way to learn bpftrace: by example.\n   tools#  cat -n biolatency.bt 1 /* 2 * biolatency.bt Block I/O latency as a histogram. 3 * For Linux, uses bpftrace, eBPF. 4 * 5 * This is a bpftrace version of the bcc tool of the same name. 6 * 7 * Copyright 2018 Netflix, Inc. 8 * Licensed under the Apache License, Version 2.0 (the &#34;License&#34;) 9 * 10 * 13-Sep-2018 Brendan Gregg Created this. 11 */ 12 13 BEGIN 14 { 15 printf(&#34;Tracing block device I/O... Hit Ctrl-C to end.\\n&#34;); 16 } 17 18 kprobe:blk_account_io_start 19 { 20 @start[arg0] = nsecs; 21 } 22 23 kprobe:blk_account_io_done 24 /@start[arg0]/ 25 26 { 27 @usecs = hist((nsecs - @start[arg0]) / 1000); 28 delete(@start[arg0]); 29 } 30 31 END 32 { 33 clear(@start); 34 }\n It&#39;s straightforward and easy to read, and short enough to include on a slide. This version is using kernel dynamic tracing to instrument the blk_account_io_start() and blk_account_io_done() functions, and passes a timestamp between them keyed on arg0 to each. arg0 on kprobe is the first argument to that function, which for these is the struct request *, and its memory address is used as a unique identifier.\n  Screenshots from these tools is also provided in *_example.txt files, where I explain exactly what we are seeing. For example:\n tools#  more biolatency_example.txtDemonstrations of biolatency, the Linux BPF/bpftrace version.This traces block I/O, and shows latency as a power-of-2 histogram. For example:# biolatency.btAttaching 3 probes...Tracing block device I/O... Hit Ctrl-C to end.^C@usecs:[256, 512) 2 | |[512, 1K) 10 |@ |[1K, 2K) 426 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@|[2K, 4K) 230 |@@@@@@@@@@@@@@@@@@@@@@@@@@@@ |[4K, 8K) 9 |@ |[8K, 16K) 128 |@@@@@@@@@@@@@@@ |[16K, 32K) 68 |@@@@@@@@ |[32K, 64K) 0 | |[64K, 128K) 0 | |[128K, 256K) 10 |@ |While tracing, this shows that 426 block I/O had a latency of between 1K and 2Kusecs (1024 and 2048 microseconds), which is between 1 and 2 milliseconds.There are also two modes visible, one between 1 and 2 milliseconds, and anotherbetween 8 and 16 milliseconds: this sounds like cache hits and cache misses.There were also 10 I/O with latency 128 to 256 ms: outliers. Other tools andinstrumentation, like biosnoop.bt, can shed more light on those outliers.[...]\n Sometimes it can be most effective to switch straight to the example file when trying to understand these tools, since the output may be self evident (by design!).\n  There are also man pages for every tool, under /man/man8. They include sections on the output fields, and expected overhead of the tool.\n #  nroff -man man/man8/biolatency.8biolatency(8) System Manager&#39;s Manual biolatency(8)NAME biolatency.bt - Block I/O latency as a histogram. Uses bpftrace/eBPF.SYNOPSIS biolatency.btDESCRIPTION This tool summarizes time (latency) spent in block device I/O (disk I/O) as a power-of-2 histogram. This allows the distribution to be studied, including modes and outliers. There are often two modes, one for device cache hits and one for cache misses, which can be shown by this tool. Latency outliers will also be shown.[...]\n Writing all these man pages was the least fun part of developing these tools, and in some cases tool longer to write than the tool took to develop, but it&#39;s nice to see the final result.\n  Since eBPF has been merging in the kernel, most effort has been on the  BCC front-end, which provides a BPF library and Python, C++, and lua interfaces for writing programs. I&#39;ve developed a lot of  tools in BCC/python, and it works great, although coding in BCC is verbose. If you&#39;re hacking away at a performance issue, bpftrace is better for all the one-off custom queries you have. If you&#39;re writing a tool with many command line options, or an agent that uses Python libraries, you&#39;ll want to consider using BCC.\n Here&#39;s how these will be used at Netflix: on the performance team, I use both: BCC for developing canned tools that others can easily use, and for developing agents; and bpftrace for ad hoc analysis. On, say, the network engineering team, they have been using BCC to develop an agent for their needs. The security team are most interested in bpftrace for quick ad hoc instrumentation for detecting zero day vulnerabilities. And for the developer teams: I expect they&#39;ll use both without knowing it via the self-service GUIs we are building (Vector), and occasionally may ssh onto an instance and run a canned tool or ad hoc bpftrace one-liner.\n   I also have a book coming out this year that covers bpftrace:  BPF Performance Tools: Linux System and Application Observability, to be published by Addison Wesley, and which contains many new bpftrace tools.\n Thanks to Alastair Robertson for creating bpftrace, and the bpftrace, BCC, and BPF communities for all the work over the past five years.\n    You can comment here, but I can&#39;t guarantee your comment will remain here forever: I might switch comment systems at some point (eg, if disqus add advertisements).\n comments powered by  Disqus", "posttime": "2021-08-10 01:19:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全面,introduction,bpftrace", "title": "Bpftrace 的全面介绍", "title_en": "A Thorough Introduction to Bpftrace", "transed": 1, "url": "https://www.brendangregg.com/blog/2019-08-19/bpftrace.html", "via": "", "real_tags": ["全面", "bpftrace"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072347, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个小集合是从迅速消亡的 Geocities 中保存下来的，Archive Team 正在拼命地工作以保存历史档案。请考虑访问我们的网站并帮助我们收集、教育和写作。", "note_en": "This small collection was saved from the rapidly dying Geocities, which  Archive Team is working desperately to save for a historical archive. Please consider visit our site and helping us with collecting, education, and writing.", "posttime": "2021-08-10 01:19:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "construction,保存", "title": "��正在施工🚧", "title_en": "Under Construction", "transed": 1, "url": "http://www.textfiles.com/underconstruction/", "via": "", "real_tags": ["保存"]}]