[{"category": "", "categoryclass": "", "imagename": "7cd66533883de31cbd06515f596cbc86.png", "infoid": 1069440, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该项目的目的是开发 EATX 外形的开源 Amiga 2000 PCB。什么是EATX？它是一种 ATX 变体，允许使用更深的 PCB，尺寸为 12 x 13 英寸（305 x 330 毫米）。这些被称为扩展 ATX 或 EATX（请参阅企业电子设备托架规范）。 Zorro II 卡的长度和 Amiga 2000 上的丰富组件使 EATX 成为该项目的最佳选择。 Amiga 2000 有一对一的电路板更换项目，但都没有改变布局以满足当前的外形标准。此外，Amiga 2000 使用了不再商业制造的连接器和定制部件。这通常需要从现有机器中取出零件。因此，该项目将在可能的情况下仅使用主动支持的组件。除了新的主板更换选项外，我相信无处不在的 EATX 标准将为 Amiga 作为爱好者和复古计算选项带来额外的兴趣。在撰写本文时，Amiga 操作系统仍在积极开发和支持。此外，还有大量现有软件和硬件附加选项的数据库和一个非常活跃的社区。我目前正在 Amiga 2000 EATX 上运行 Supra Wordsync SCSI 卡、Commodore A2630 加速器和 Pi HDMI 视频卡。可以在屏幕上看到 AIBB。我让 Amiga 2000 EATX 运行几个小时玩游戏和运行内存测试没有问题。所有外部端口都按预期工作。将 Amiga 2000 Rev 6.2 原理图输入 KiCad，包括所有已知的 A2000 Rev 6.x PCB 更新。查看此信息以确保在组装 Amiga 2000 EATX 系统时获得顺畅和愉快的体验。它将回答许多问题，并告知您 Amiga 2000 EATX PCB、各种 Amiga 插件卡等的物理要求。DB23 视频连接器已被移除，取而代之的是 HD15 连接器。该项目的目标之一是避免使用非市售部件。 D-Sub 23 连接器就是一个典型的例子。它们不在流行的电子供应商处备货。因此，更改为广泛使用的 HD15 连接器。模拟红色、绿色、蓝色、HSYNC 或 COMPSYNC（跳线可选）和 VSYNC 使用 VGA 标准引脚输出配置提供。不提供其他外部视频端口信号。任何 VGA 电缆都可用于向支持 15KHz 标准的 VGA 显示器或转换盒提供视频信号。\n原来的 256Kx4 DRAM 已被单个 SRAM 取代。 2000 EATX 永久配置为识别 1MB 芯片 ram 并需要 Fatter Agnus (MOS 8372A)。目前不支持其他 Agnus 修订版。 Amiga 的左/右 RCA 插孔已被 3.5 毫米立体声音频插孔取代。在内部，支持任何 Amiga 兼容双密度磁盘驱动器或正确配置的 Gotek 软盘模拟器。最多可以将两个内部磁盘驱动器连接到内部软盘连接器。外部磁盘驱动器端口已被移除。 16 位 ISA 插槽的数量已减少到三个。这样做是为了在板上提供额外的空间。与 Amiga 2000 相比，通过 Bridgeboard 对 ISA 卡的支持没有变化。内部（地狱）串行端口已被删除。外部串行端口与所有信号一起存在。出于显而易见的原因，有必要相对于彼此移动组件。 Zorro 插槽占据插槽位置 1-5，与前 3 个位置的 ISA 插槽重叠。视频槽位在板卡的第六槽位。 CPU 插槽占据位置 7。可以同时填充每个插槽位置。支持 ATX 24 针电源，-5V 通过电压调节器在板上供电。不支持原装 Amiga 2000 电源。\n可以通过 Amiga 键盘上的 CTRL-Amiga-Amiga 或通过 EATX 计算机机箱上的重置开关重置计算机。实时时钟 (RTC) 已更改为 RTC-62423。该 RTC 内置晶体，无需调整。在Amiga中，RTC由4条地址线和4条数据线读写。不幸的是，这种总线连接的 RTC 没有直接的“现代”替代品。因此，这是必须获得的传统 IC 之一。它很容易在出售这些类型的传统 IC 的地方买到。键盘、操纵杆、鼠标、并行和串行端口都存在并且功能与它们在 Amiga 2000 中一样。并行、串行、鼠标和操纵杆端口分别是堆叠的 DB9 和 DB25 连接器。 Amiga 键盘端口仍然是 DIN5 连接器。目前，Kickstart ROM 仍然是原始的 27C400。这些不再制造，但很容易找到。此外，这允许使用原始 Commodore Kickstart 掩码 ROM。修订版 1.2 为自定义 Kickstart ROM 添加了对 1MB (27C800) 和 2MB (27C160) EPROM 的支持。如果没有特别提及某些内容，您应该期望它在功能或组件上与原始 A2000 相同。 kr239 - 用于 Amiga 500 DRAM 更换项目的灵感以及用于该项目中使用的修改的 LIV2 和 texneus DarrenHD - Amiga 3000 视频插槽支架适配器的图片和测量值 - https://eab.abime.net/showthread.php?t =106928", "note_en": "The purpose of this project is to develop an open source Amiga 2000 PCB in the EATX form factor. What is EATX? It is an ATX variant that allows slightly deeper PCBs, measuring 12 x 13 inches (305 × 330 mm). These are referred to as Extended ATX, or, EATX (see  Enterprise Electronics Bay Specification). The length of Zorro II cards and the abundance of components on the Amiga 2000 makes EATX the best choice for this project.\n There are one-to-one board replacement projects for the Amiga 2000, but none to change the layout to meet current form factor standards. In addition, the Amiga 2000 made use of connectors and custom parts that are no longer commercially manufactured. This often requires parts to be pulled from existing machines. As such, this project will make use of only actively supported components when possible.\n In addition to a new board replacement option, I believe the ubiquitous EATX standard will bring additional interest to the Amiga as a hobbyist and retro-computing option. At the time or writting this, the Amiga operating system is still actively developed and supported. In addition, there is a substantial database of existing software and hardware add-on options and a very active community.\n     I am currently running a Supra Wordsync SCSI card, a Commodore A2630 accelerator, and a  Pi HDMI video card on the Amiga 2000 EATX. AIBB can be seen on the screen. I allowed the Amiga 2000 EATX to run for several hours playing games and running memory tests without issue. All the external ports are working as expected.\n   Enter Amiga 2000 Rev 6.2 schematics into KiCad, including all known A2000 Rev 6.x PCB updates.\n  Review  this information to ensure a smooth and happy experience when assembling an Amiga 2000 EATX system. It will answer many questions and inform you as to the physical requirements of the Amiga 2000 EATX PCB, various Amiga plug in cards, etc.\n       The DB23 video connector has been removed in favor of the HD15 connector. One of the goals of this project is to avoid parts that are not commercially available. The D-Sub 23 connector is a prime example. They are not stocked at popular electronic supply houses. Thus, the change to the widely available HD15 connector. Analog red, green, blue, HSYNC or COMPSYNC (jumper selectable), and VSYNC are supplied using the VGA standard pin out configuration. Other external video port signals are not supplied. Any VGA cable can be used to supply the video signal to a VGA monitor or conversion box supporting the 15KHz standard.\n    The original 256Kx4 DRAMs have been replaced by a single SRAM. The 2000 EATX is permanently configured to recognize 1MB chip ram and requires Fatter Agnus (MOS 8372A). Other Agnus revisions are not supported at this time.\n  The left/right RCA jacks of the Amiga have been replaced by a 3.5mm stereo audio jack.\n  Internally, any Amiga compatable double density disk drive or properly configured Gotek floppy emulator is supported. Up to two internal disk drives may be connected to the internal floppy connector. The external disk drive port has been removed.\n  The number of 16 bit ISA slots has been reduced to three. This was done to provide additional space on the board. Support for ISA cards via a Bridgeboard is unchanged from the Amiga 2000.\n  The internal (infernal) serial port has been removed. The external serial port is present with all signals.\n  For obvious reasons, it was necessary to move components relative to one another. Zorro slots occupy slot positions 1-5, overlapping with ISA slots in the first 3 positions. The video slot occupies the sixth slot position on the board. The CPU slot occupies position 7. It is possible to have every slot position populated simultaneously.\n  ATX 24-pin power supplies are supported with -5V being supplied on board via a voltage regulator. The original Amiga 2000 power supply is not supported.\n  The computer can be reset via CTRL-Amiga-Amiga on an Amiga keyboard or via the reset switch found on EATX computer cases.\n  The real time clock (RTC) has been changed to the RTC-62423. This RTC has a built in crystal and does not need adjustment. In the Amiga, the RTC is written and read by 4 address and 4 data lines. Unfortunately, there are no direct &#34;modern&#34; replacements for this type of bus connected RTC. As such, this is among the legacy IC&#39;s that must be obtained. It is readily available where these type of legacy IC&#39;s are sold.\n   The keyboard, joystick, mouse, parallel, and serial ports are all present and function as they did in the Amiga 2000. The parallel, serial, mouse, and joystick ports are stacked DB9 and DB25 connectors, respectively. The Amiga keyboard port remains a DIN5 connector.\n    For now, the Kickstart ROM remains the original 27C400. These are no longer made, but are easy to find. In addition, this allows the use of an original Commodore Kickstart mask ROM. Revision 1.2 added support for 1MB (27C800) and 2MB (27C160) EPROMs for custom Kickstart ROMs.\n  If something is not specifically mentioned, you should expect it to be unchanged in function or component from the original A2000.\n          kr239 - for the Amiga 500 DRAM replacement project inspiration and LIV2 and texneus for the modifications used in this project\n   DarrenHD - Pics and measurements of the Amiga 3000 video slot bracket adapter -  https://eab.abime.net/showthread.php?t=106928", "posttime": "2021-07-24 19:08:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "eatx,amiga", "title": "Amiga 2000 EATX PCB", "title_en": "Amiga 2000 EATX PCB", "transed": 1, "url": "https://github.com/jasonsbeer/Amiga-2000-ATX", "via": "", "real_tags": ["eatx", "amiga"]}, {"category": "", "categoryclass": "", "imagename": "c4e8d5f35d685a2d2d954ac8bf82b9fa.png", "infoid": 1069439, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "事实证明，当谈到计算机时，这句 16 世纪的名言仍然非常适用。毕竟，在大多数操作系统上，进程都有一个“命令行”组件，它允许（启动）父进程将信息传递给子进程。这个新创建的进程可以访问命令行，这可能会根据在命令行上找到的内容更改其进程流。这个概念是构成“计算机”的核心：它能够执行一组指令、程序，接受各种输入。尽管它在计算中发挥着基本作用，但对于命令行上可以找到的各个部分的称呼似乎没有达成一致。有些人认为命令行参数、参数、选项、标志、开关是一回事，有些人则有不同的含义。这篇文章将使用以下术语：整个行是命令行，它由命令行参数（用空格分隔）组成。虽然都是参数，但它们有不同的作用：例如，第一个参数通常是被调用的进程 - 或者，如果您在命令提示符中，这将是命令。在上面的例子中，后面跟着更多的参数。更具体地说，前三个是命令行选项，通常以特殊字符开头。在这三个选项中，前两个是开关，因为它们不需要进一步的输入，而第三个是一个标志，因为它后面是进一步的参数，这些参数是这个参数的“输入”。选项 char 是用作命令行选项前缀的字符。在 Windows 上，这通常是正斜杠 (/)，在类 Unix 系统上，主要使用连字符 (-)。这是惯例而非规则：因为命令行由正在执行的程序解析，开发人员可以完全自由地定义应该以什么格式传递参数。公约很难。计算历史告诉我们，如果没有标准化，事情往往会以混乱结束——这当然适用于命令行。命令行解析实践缺乏标准化导致用户混淆：很容易混淆不同的实践，导致执行不成功和很多挫折。为了帮助用户，一些程序被设计为接受多种约定。一个常见的例子是接受正斜杠和连字符作为选项字符，这将在下一节中更详细地讨论。另一个混淆源是可用的不同字符编码。这导致了旧程序（通常只接受 ASCII）和新程序（现在通常接受 UTF-8 或 Unicode）之间的各种兼容性问题。一些程序试图通过过滤掉某些字符或将特定字符转换为 ASCII 等价物来解决这些不兼容性。\n这导致了某些程序将各种不同的命令行参数视为一个相同的情况。您可以将此类实例称为同义命令行，因为尽管传递给流程的数据不同，但它们的执行和结果是相同的。虽然能够以不同的方式表达相同的命令可能对某些用户有所帮助，但它往往会使检测和预防工作更加困难。大多数威胁检测软件（AV、EDR 等）将监控进程执行，并寻找可能表示恶意使用的命令行参数。由于攻击者希望不被发现，他们可能会利用命令行的灵活性来逃避检测。这可能包括从绕过基于关键字的检测的小调整到全面的命令行混淆以隐藏原始命令。命令行级别混淆的一个很好的例子是 Daniel Bohannon 的优秀作品 DOSfuscation [1, 2]，它特别关注 Windows 命令行提示符 CMD。即使正在执行的 CMD &#39;理解&#39;并执行混淆的命令，它对人类来说可能看起来难以理解，并且监控软件也很可能被蒙在鼓里。同义命令行的现象超出了 DOSfuscation，因为它适用于更多程序，而不仅仅是 CMD。这里的主要区别在于，您不仅会愚弄命令行提示符，还会愚弄正在执行的程序本身。正如稍后将展示的，虽然 DOSfuscation 工作可能会在检测软件使用的记录器中以未混淆的形式结束，但同义的命令行参数不会。为了看到这一点，我们现在将仔细研究可能导致同义命令行的五种不同方法。考虑 Windows 可执行文件 ping。由于该程序是原始 Unix 版本的移植，帮助页面建议命令行选项应使用连字符作为选项字符，例如 ping -n 0 127.0.0.1。这与大多数其他使用正斜杠的 Windows 原生命令行工具不一致。大概是为了帮助困惑的用户，该程序还接受正斜杠作为选项字符：ping /n 0 127.0.0.1 也可以工作。大多数使用连字符的内置 Windows 可执行文件也接受正斜杠，但反之则不然。例如，命令 find /i keyword 将显示包含单词“keyword”的所有文件，而 find -i keyword 将导致错误。\n尽管正斜杠和连字符是最常见的可用选项，但有些程序支持更多的选项字符。 certutil 恰好接受连字符、斜线和斜线的大多数 Unicode 表示，例如除法斜线 (0x2215) 和分数斜线 (0x2044) [3]。正如我们将在其他变体中看到的那样，可执行文件很少记录这些替代命令行选项，这意味着您会偶然、“蛮力”或通过逆向工程找到它们。另一种方法是用类似的字符替换命令行中的其他字符（即除了选项字符之外）。尤其是当您考虑整个 Unicode 范围时，在 ASCII 范围内也发现了许多字母变体，某些进程可能接受这些变体。 Unicode 包含一个间距修饰字母范围 (0x02B0 - 0x02FF) [4]，其中包括 ˪、ˣ 和 ˢ 等字符。一些命令行解析器将它们识别为字母并将它们分别转换回 l、x 和 s。一个例子是 reg，它将 reg export HKCU out.reg 和 reg eˣport HKCU out.reg 视为相等。事实证明，有更多 Unicode 范围包含某些程序接受的字符。同样，有时可以在命令行中插入额外的字符，这些字符将被执行程序忽略。例如，某些可执行文件可能会删除不可打印的字符，同时也可能会过滤掉某些可打印的字符。例如，Windows 事件日志工具 wevtutil 似乎接受在随机位置插入某些范围内的 Unicode 字符的命令行。因此，执行 wevtutil gli hardwareevents 和 wevtutil gࢯli hardwareevents 将产生完全相同的输出，尽管后者在第一个参数的中间包含一个阿拉伯字母。\n由于命令行提示的标准输入有时不支持可用于此技术的字符（例如，因为它们不可打印），您可能必须使用字节表示法插入字符。从截图中可以看出，在这种情况下，字符被正确地传递给了进程。在保持流程完整的同时操纵命令行的另一种方法是插入引号。尽管这听起来像是先前技术的一个子集，但这里的要求是引号成对出现。您可能熟悉在参数周围加上引号的概念。以 dir &quot;c:\\windows\\&quot; 为例，由于缺少空格，它实际上与 dir c:\\windows\\ 相同。大多数程序都接受这个约定。鲜为人知的是，大多数程序在任意位置接受引号：命令 dir c:\\&quot;win&quot;d&quot;&quot;ow&quot;s&quot; 也可以使用。只要每个参数的引号数是偶数并且后面的引号不超过两个，大多数程序似乎都接受这一点。值得注意的是，在命令提示符中使用引号可能很棘手，因为它们通常在将引号传递给底层程序之前自己处理引号。例如，在 cmd 中解决此问题的一种方法是将每个引号加倍，因此要获得如上所示的等效执行，您必须运行 netsh ad&quot;&quot;vfi&quot;&quot;rewall show currentprofile state。插入和替换字符后，我们还需要尝试删除字符。一些应用程序允许为其他冗长的命令行选项提供“速记”，从而更容易输入它们。这是基于 Unix 的工具中的一个众所周知的概念（例如 grep -i 关键字与 grep --ignore-case 关键字），但在 Windows 上则不然。然而，一些程序接受缩短的版本。一些程序采用与 Unix 类似的方法并接受单字母版本（例如 cmdkey /l 与 cmdkey /list），有些程序接受其他缩写版本（例如 wevtutil gli 与 wevtutil get-loginfo），而其他程序则采用“通配符方法” &#39;。这方面的一个例子是 PowerShell，它的许多关键字允许您在关键字 [5] 的末尾省略一个或多个字符。成功执行 powershell /encodedcommand ZQBjAGgAbwAgACIASQB0ACAAdwBvAHIAawBzACEAIgA= 后跟 13 种不同速记的示例。\n也许除了最短的变体 /e 之外，在我看来，接受这些速记方法对很少人有帮助，但它确实使事情变得更加复杂和不可预测。例如，PowerShell 只接受缩短的版本，前提是它不会导致另一个命令之间的歧义。出于这个原因，关键字/noprofile 的最短变体是/nop，因为/no 会与例如/noexit 发生冲突。除了这种“通配符方法”之外，PowerShell 在某些情况下也接受首字母缩略词，因此尽管屏幕截图中没有显示，/ec 也可以用作 /encodedcommand 的简写。如前几节所述，处理命令行参数没有标准。有些程序非常严格，而有些程序会非常努力地将给出的任何内容变成它可以理解的内容。找出特定程序的命令行行为也是有问题的：帮助页面通常只指定传递参数的“首选”方式（方法 1 和 5），通常从不描述如何处理意外字符（方法 2-4 ）。确定这一点的最准确方法似乎是逆向工程。但是，这是一项非常耗时的活动，尤其是当您考虑到某些程序的复杂性时。因此，更实用的方法是简单地使用不同的字符重复尝试所有绕过技术并比较结果。这种方法的概念验证实现 [6] 使我们能够快速分析所描述的五种行为中的哪一种。可以在 GitHub 项目页面上找到对 PoC 的更详细解释、其基本假设和警告。出于本文的目的，PoC 用于分析 40 多个经常用于攻击的内置 Windows 可执行文件。注：1) 使用 Windows 10 2004 版进行分析；2) 对于每个 Windows 可执行文件，仅使用一个特定的命令 - 其他命令可能会导致不同的结果；3) 用星号 (*) 表示的条目针对的是命令-line 参数接受每个变化。例如，在 nslookup -querytype=ALL (...) 的情况下，PoC 发现无论插入什么字符，都会返回预期的输出。事实证明，nslookup 会忽略命令行选项（在本例中为 -q）的第一个字母之后的所有字母，这意味着可能的排列数量几乎是无限的。每个测试的可执行文件的完整报告，包括测试的命令和找到的字符，可以在 GitHub [6] 上找到。\n了解所有这些使我们能够退后一步，从威胁搜寻的角度审视命令行行为。如果你想用特定的命令行参数检测程序的执行，同义的命令行参数会带来问题。例如，编写 Sigma 规则 [7] 来检测指定 urlcache 和 f 参数的 certutil 执行可以表示为： 问题很明显：如果攻击者使用 -urlcache、/urᴸcache、/₞urlcache 或 /url&quot;cach &quot;e - 或者更糟的是，一个组合：-₞u₞rᴸ&quot;c₞a₞ch&quot;e，该命令仍然有效，但上述规则不会影响行为。将所有变体添加到规则中不是一种选择，因为结合各种绕过技术将导致数千甚至数百万个排列。 certutil -f -urlcache -split https://wietze.github.io/robots.txt output.txt 混淆版本的成功执行示例。可能尝试的第一个潜在解决方案是使规则更通用。例如，解决选项字符问题，我们可以将选项字符排除在定义之外：虽然这似乎解决了选项字符问题，但它创建了一个新的问题。查找 urlcache 而不是 /urlcache 不太可能导致很多误报，但是，只查找 f 而不是 /f 可能会产生误报。第二种可能的解决方案是使用更巧妙的匹配选项。许多提供寻找流程执行功能的 EDR 工具往往仅限于简单的“字符串包含”式功能，如上述示例中所示。有些允许正则表达式，但这似乎仍然很少见。尽管 Sigma 支持正则表达式值，但在 30 个支持的后端中似乎只有 7 个实际实现了它。虽然这并不一定意味着其他 23 个平台不支持它，但至少表明它可能不是一条明显的下降路径。供应商可能对提供此选项犹豫不决的一个关键原因首先是性能：正常的编译正则表达式的复杂度为 O(n)，但通过递归扩展，可以创建永远不会结束计算的正则表达式。 Sigma 项目也不鼓励使用正则表达式 [8]。\n对于那些支持正则表达式的工具，可以解决选项字符问题（假设您将 [-/\\\\] 替换为所有选项字符的列表）：正则表达式还可以帮助有效地捕获速记关键字。不幸的是，由于选项和排列的大小，字符插入和替换通常是不可行的。解决这些类型的混淆永远不会是无懈可击的。需要更具弹性的方法。为避免落入隧道视觉检测工程的陷阱，您可以采取一些措施来实现强大的威胁搜寻过程。首先，确保规则被合理地定义为“广泛”，捕捉所有可能的变化，同时考虑到误报的潜在增加。提供的 PoC [6] 可用于查找您的规则可能允许的变化。其次，标准化监控工具的输出也可能是有益的。如果您的数据在最终进入分析平台之前在管道中进行处理，请考虑添加一个单独的字段，将所有特殊字符转换为 ASCII 等效字符并去除所有非字母数字值（以去除引号和选项字符）。在此字段上运行您的规则可能会有更高的命中率。此外，使用数据分析来检测混淆尝试本身。查看包含在您的 IT 资产中使用率较低的字符的流程命令行，比较字符密度级别，甚至只是查找包含非 ASCII 字符的命令行参数并从那里开始工作。\n还要确保您的重点比单独的流程字符串更广泛。在可能的情况下，关注命令行试图实现的实际行为，例如文件创建、注册表更改或网络连接。例如，与其试图捕获所有可能的恶意 wevtutil 命令，不如寻找写入意外位置的 wevtutil（系统信息发现？[9]）或检查事件 ID 1102 的事件日志（指标删除？[10]） ]）。最后，请记住，不可能在 100% 的时间内检测到 100% 的不良情况 - 但是，您检测到的越多，攻击者就越难以完全被忽视。因此，考虑到上述因素将使您更近一步。 “欲听从者，必知指挥”，懂指挥者，必知察。", "note_en": "It turns out that when it comes to computers, this sixteenth-century quote still very much applies. After all, on most operating systems, processes have a ‘command line’ component, which allows the (initiating) parent process to pass on information to the child process. The command line is accessible to this newly created process, which may change its process flow based on what is found on the command line. This concept is at the core of what makes ‘the computer’: its ability to execute a set of instructions, programs, taking input of sorts.\n Despite its fundamental role in computing, there doesn’t appear to be agreement on what to call the various parts that can be found on command lines. Some consider command-line arguments, parameters, options, flags, switches to be one and the same, to some they have different meanings. This post will be using the following terminology:\n  The line in its entirety is the command line, which is comprised of command-line  arguments (separated by spaces). Although all are arguments, they have different roles: for example, the first argument is typically the  process that is being called - or, if you are within a command prompt, this would be the  command. In the above example it is followed by more arguments. More specifically, the first three are command-line  options, which typically start with a special character. Of these three options, the first two are  switches because they don’t require further input, whereas the third is a  flag because it is followed by further arguments that are ‘inputs’ for this argument.\n The  option char is the character that is used as a prefix on command-line options. On Windows this is typically the forward slash ( /), on Unix-like systems hyphens ( -) are predominantly used. This is rather by convention than by rule: because the command line is parsed by the program being executed, developers are completely free in defining in what format arguments should be passed.\n Conventions are hard. Computing history has taught us that without standardisation, things tend to end in chaos - and that certainly applies to command lines.\n  The lack of standardisation in command-line parsing practices has caused confusion amongst users: it is easy to mix up the different practices, leading to unsuccessful executions and much frustration. In an attempt to help users, some programs have been designed to accept multiple conventions. A common example of this is accepting both forward slashes and hyphens as option char, as will be discussed in more detail in the next section.\n Another source of confusion is the different character encodings that are available. This has caused all sorts of compatibility issues between old programs (typically only accepting ASCII) and newer programs (nowadays often accepting UTF-8 or Unicode). Some programs attempt to fix these incompatibilities by filtering out certain characters or converting specific characters to ASCII equivalents.\n This has led to a situation in which some programs treat a variety of different command-line arguments as one and the same. You could call such instances  synonymous command lines, since despite the data passed to the process is different, their execution and outcome is identical.\n  Although being able to express the same command in different ways may be of help to some users, it tends to make detection and prevention efforts harder. Most threat detection software (AV, EDR, and so on) will monitor process executions, and look for command-line arguments that may be indicative of malicious usage. As attackers will want to go undetected, they may take advantage of the flexibility of the command line in an attempt to evade detection. This may range from small tweaks to bypass keyword-based detection, to full-blown command-line obfuscation to hide the original commands.\n A good example of obfuscation on command-line level is the the excellent work of Daniel Bohannon, DOSfuscation [ 1,  2], which specifically focusses on the Windows command-line prompt CMD. Even though the executing CMD ‘understands’ and executes the obfuscated commands, it may look unintelligble to humans, and monitoring software is also likely to be kept in the dark.\n The phenomenon of synonymous command-lines goes beyond DOSfuscation, as it applies to many more programs than just CMD. The key difference here being that you wouldn’t just be fooling the command-line prompt, but the executing program itself. As will be shown later, whilst DOSfuscation efforts may end up in unobfuscated form in the recorders used by detection software, the synonymous command-line arguments will not.\n  To see this in action, we will now take a closer look at five different methods that can cause synonymous command lines.\n  Consider the Windows executable  ping. Because the program is a port of the original Unix version, the help page suggests command-line options should use a hyphen as option char, e.g.  ping -n 0 127.0.0.1. This is inconsistent with most other, Windows-native command-line tools, which use forward slashes. Presumably in an attempt to help confused users, the program also accepts the forward slash as option char:  ping /n 0 127.0.0.1 will work as well.\n Most built-in Windows executables that work with hyphens also accept forward slashes, but the reverse is not true. The command  find /i keyword for example will show all files containing the word ‘keyword’, while  find -i keyword will result in an error.\n Although forward slashes and hyphens are the most common available options, some programs support even more option chars.  certutil happens to accept hyphens, slashes, and most Unicode representations of slashes, such as the division slash (0x2215) and fraction slash (0x2044) [ 3].\n As we will see with the other variants, executables rarely document these alternative command-line options, meaning that you will find out about them either by chance, ‘brute force’ or through reverse engineering.\n  Another approach is to replace other characters (i.e. other than the option char) in the command line with similar characters. Especially when you consider the entire Unicode range, there are many variations of letters also found in the ASCII range that some processes may accept.\n Unicode contains a range for  Spacing Modifier Letters (0x02B0 - 0x02FF) [ 4], which includes characters such as ˪, ˣ and ˢ. Some command-line parsers recognise these as letters and convert them back to l, x and s respectively. An example of this is  reg, which treats  reg export HKCU out.reg and  reg eˣport HKCU out.reg as equal.\n  As it turns out, there are more Unicode ranges containing characters that are accepted by some programs.\n  In a similar vein, it is sometimes possible to insert extra characters into command lines that will be ignored by the executing program. Some executables may remove non-printable characters for example, whilst also certain printable characters may be filtered out.\n Windows Event Logs tool  wevtutil for instance seems to accept command lines that have Unicode characters from certain ranges inserted at random places. So executing  wevtutil gli hardwareevents and  wevtutil gࢯli hardwareevents will result in the exact same output, despite the latter containing an Arabic letter in the middle of the first argument.\n  Because the characters that can be used for this technique are sometimes unsupported on the stdin of command-line prompts (e.g. because they are non-printable), you may have to insert the character using byte notation. As can be seen in the screenshot, in this case the character is passed correctly to the the process.\n  Another way of manipulating a command line whilst keeping the process flow intact is by inserting quotes. Although this may sound like a subset of the previous technique, a requirement here is that the quotes come in pairs.\n You are probably familiar with the concept of putting quotes around arguments. Take  dir &#34;c:\\windows\\&#34; for example, which is effectively the same as  dir c:\\windows\\ due to the lack of spaces. Most programs accept this convention. Less well known is that most programs accept quotes in arbitrary places: the command  dir c:\\&#34;win&#34;d&#34;&#34;ow&#34;s&#34; will also work. As long as the number of quotes per argument is even and there are no more than two subsequent quotes, most programs seem to accept this.\n  It is worth noting that working with quotes in command prompts can be tricky, as they typically handle quotes themselves before passing it on to the underlying program. A way to work around this in  cmd for example is to double every quote, so to get the equivalent execution as shown above, you would have to run  netsh ad&#34;&#34;vfi&#34;&#34;rewall show currentprofile state.\n  Having inserted and replaced characters, what remains for us to try is removing characters. Some applications allow ‘shorthands’ for otherwise lengthy command-line options, making it easier to type them out.\n This is a well-known concept in Unix-based tools (e.g.  grep -i keyword vs  grep --ignore-case keyword), but on Windows less so. Nevertheless, some programs accept shortened versions. Some programs take a similar approach to Unix and accept a one-letter version (e.g.  cmdkey /l vs  cmdkey /list), some accept an otherwise abbreviated version (e.g.  wevtutil gli vs  wevtutil get-loginfo), whilst others take a ‘wildcard approach’. An example of this is PowerShell, which for many of its keywords allows you to leave off one or more characters at the end of the keyword [ 5].\n An example of the successful execution of  powershell /encodedcommand ZQBjAGgAbwAgACIASQB0ACAAdwBvAHIAawBzACEAIgA= followed by 13 different shorthands.\n Perhaps apart from the shortest variant  /e, it seems to me that very few people are helped by accepting these shorthands whilst it does make things more complicated and unpredictable. For example, PowerShell only accepts shortened versions if it doesn’t cause ambiguity between another command. For this reason the keyword  /noprofile’s shortest variant is  /nop, because  /no would clash with e.g.  /noexit. Next to this ‘wildcard approach’, PowerShell in some cases also accepts acronyms, so despite not shown in the screenshot,  /ec would also work as a shorthand for  /encodedcommand.\n  As mentioned in the previous sections, there is no standard when it comes to handling command-line arguments. Some programs are very strict, whereas some programs will try very hard to turn whatever it is given into something it can understand. Finding out for a particular program what its command line behaviour is, is problematic too: help pages usually only specify the ‘preferred’ way of passing arguments (methods 1 and 5) and typically never describe how unexpected characters are treated (methods 2-4).\n The most accurate way to determine this seems to be reverse engineering. However, this is a very time-consuming activity, especially when you take the complexity of some of the programs into account. A more pragmatic approach is therefore to simply try all bypass techniques repeatedly with different characters and compare the results.\n A proof-of-concept implementation of this approach [ 6] allows us to quickly analyse which of the five described behaviours apply. A more detailed explanation of the PoC, its underlying assumptions and caveats can be found on the GitHub project page.\n For the purposes of this post, the PoC was used to analyse over 40 built-in Windows executables often seen being used in attacks.\n  Notes:1) Windows 10 version 2004 was used for the analysis;2) For each Windows executable only a single, specific command was used - other commands may result in different outcomes;3) Entries denoted with an asterisk (*) targeted a command-line argument that accepted  every variation. In the case of  nslookup -querytype=ALL (...) for example, the PoC found that the expected output was returned regardless of what character was inserted. It turns out that  nslookup ignores all letters after the first letter of a command-line option ( -q in this case), meaning the number of possible permutations is nearly infinite.\n Full reports for each tested executable, including the tested commands and the found characters, can be found on GitHub [ 6].\n  Knowing all this allows us to take a step back and look at command-line behaviour from a threat-hunting perspective.\n If you want to detect executions of programs with specific command-line arguments, synonymous command-line arguments pose a problem. For example, writing a Sigma rule [ 7] to detect  certutil executions with the  urlcache and  f arguments specified could be expressed as:\n  The problem is immediately clear: if an attackers uses  -urlcache,  /urᴸcache,  /₞urlcache or  /url&#34;cach&#34;e - or even worse, a combination:  -₞u₞rᴸ&#34;c₞a₞ch&#34;e, the command will still work, but the above rule will not pick up the behaviour. Adding all variants to the rule is not an option, as combining the various bypass techniques will result in thousands if not millions of permutations.\n An example of the successful execution of an obfuscated version of  certutil -f -urlcache -split https://wietze.github.io/robots.txt output.txt.\n The first potential solution one may try is to make the rule a bit more generic. For example, solving the option char problem, we could leave the option char out of the definition:\n  Whilst this may appear to solve the option char problem, it created a new one. Looking for  urlcache instead of  /urlcache is unlikely to cause many false positives, however, looking for just  f instead of  /f is likely to generate false positives.\n A second potential solution would be to use more clever matching options. Many EDR tools that provide functionality to hunt for process executions tend to be limited to simple ‘string contains’-esque features such as expressed in the above examples. Some allow regular expressions, but this still seems to be rare. Although Sigma supports regex values, only 7 of the 30 supported backends appear to actually implement it. Whilst this does not necessarily mean the 23 other platforms do not support it, it at least suggests it may not be an obvious path to go down. A key reason vendors may be hesitant to provide this option in the first place is performance: a normal, compiled regular expression has a complexity of  O(n), but through recursion extensions it is possible to create regexes that will never end evaluating. The Sigma project also discourages the use of regexes [ 8].\n For those tools that do support regular expressions, it is possible to work around the option char problem (assuming you replace  [-/\\\\] with a list of all option chars):\n  Regexes may also help efficiently capture shorthand keywords. Unfortunately, character insertion and substitution this is typically not feasible due to the size of options and permutations.\n Working around these types of obfuscation is never going to be watertight. More resilient methods are needed.\n  To avoid falling into the trap of tunnel visioned detection engineering, there are a few things you can do to achieve robust threat hunting processes.\n First of all, make sure rules are defined as ‘broadly’ as they reasonably can be, catching all possible variations, whilst taking into account the potential increase of false positives. The presented PoC [ 6] can be used to find variations your rule may allow for.\n Secondly, standardising your monitoring tool’s output may be beneficial too. If your data is processed in a pipeline before it ends up in your analytics platform, consider adding a separate field that converts all special characters to ASCII equivalents and strips all non-alphanumeric values (to get rid of quotes and option chars). Running your rules over this field might have a higher hit rate.\n Furthermore, use data analytics to detect the obfuscation attempt itself. Look at process command lines that contain characters with a low prevalence across your IT estate, compare character density levels, or even simply look for command-line arguments that contain non-ASCII characters and work from there.\n Also make sure your focus is broader than process strings alone. Where possible, focus on the actual behaviour that the command line is trying to achieve, such as file creations, registry changes or network connections. For example, rather than trying to capture all possibly malicious  wevtutil commands, it may be better to look for  wevtutil writing to unexpected locations (system information discovery? [ 9]) or checking the event log for event ID 1102 (indicator removal? [ 10]).\n Finally, bear in mind that it won’t be possible to detect 100% of the badness 100% of the time - however, the more you you  can detect, the harder you are making it for an attacker to go completely unnoticed. And as such, taking the above into account will get you one step closer.\n “ He who wishes to be obeyed must know how to command”, and he who knows how to command will know how to detect.", "posttime": "2021-07-24 19:07:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,命令行,command", "title": "Windows 命令行混淆", "title_en": "Windows Command-Line Obfuscation", "transed": 1, "url": "https://www.wietzebeukema.nl/blog/windows-command-line-obfuscation", "via": "", "real_tags": ["windows", "命令行", "command"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069438, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN 订阅者为您带来的这篇文章 LWN.net 的订阅者使这篇文章——以及围绕它的一切——成为可能。如果您欣赏我们的内容，请购买订阅并让下一组文章成为可能。 7 月 4 日，Rust for Linux 项目发布了另一个版本的补丁集，增加了对内核语言的支持。该项目似乎已经准备好考虑进入主线。不过，也许一个更大的问题仍然存在：内核开发社区是否为 Rust 做好了准备？那部分似乎仍然悬而未决。 Miguel Ojeda 已被聘用全职从事该项目，他发布了补丁集；在求职信中，他列出了自 4 月份发布 RFC 补丁集以来的一些更改和更新。特别是，在失败时调用 panic!() 的分配已被替换。已经为内核项目创建了 alloc crate 的修改版本，尽管计划是让更改进入上游项目，以便最终可以删除自定义版本。顺便说一句，添加修改后的 crate 的补丁显然太大了绝杀档案，尽管它确实出现在 LWN 档案中。他说，在内核设施的 Rust 抽象方面取得了更多进展，包括“红黑树、引用计数对象、文件描述符创建、任务、文件、io 向量……”，以及对驱动程序支持的补充。除此之外，Android Binder 进程间通信机制的 Rust 驱动程序具有更多功能，并且正在开发用于某些 Raspberry Pi 型号上可用的硬件随机数生成器的驱动程序。但是缺乏“真正的”车手是 4 月份的症结之一，这次又被提出来了。 Christoph Hellwig 表示，如果这是发布的意图，他强烈反对合并代码。在求职信中，Ojeda 说补丁集正在添加到 linux-next，并且他确认正在提交合并。 Hellwig 希望看到 Rust 在被包含之前证明自己：[...] 首先证明它确实有用。有用的将是像 nvme 这样的真实驱动程序或 USB 主机控制器驱动程序，它实际上可以工作并显示出优于现有驱动程序的优势。在它显示出如此有用之前，它只会拖累其他人。 Ojeda 指出 Binder 驱动程序是一个“非平凡的模块”，“已经在工作”，但承认真正的硬件驱动程序是一个重要的（并且目前还没有）。但是，求职信列出了一些对该项目感兴趣或已经参与其中的组织，Ojeda 认为这也有助于证明该项目：从某种意义上说，我们已经开始让下游用户和其他感兴趣的用户产生兴趣。各方表示支持。然而，其他人则更加保守，只有在我们处于主线时才会开始投资它，即如果已经做出是否使用 Rust 的决定。但是，Greg Kroah-Hartman 说，由于一些不同的原因，Binder“驱动程序”并不是一个很好的例子。它缺少一个相当大的功能（binderfs），但它也几乎没有帮助展示 Rust 将如何与内核的其余部分相适应。和以前一样，他强烈建议做一些有助于解决内核开发人员对 Rust 的一些问题的工作：并不是说它没有用途，而是 Binder 和内核其余部分之间的交互非常小且具体. 几乎没有人会再写的东西。请在一个真正的驱动程序上工作，以帮助证明或反驳这一切都能正常工作。有很多悬而未决的问题需要解决，当你做这样的事情时，你会遇到这些问题。\nRust 证明自己的主题也出现在 ksummit-discuss 邮件列表上的一个线程中。 6 月底，Ojeda 在今年的 Linux PlumbersConference 上提出将 Rust for Linux 作为 Kernel Summit 赛道的技术主题。 7 月 6 日，Linus Walleij 回复，同意这是一个应该讨论的话题。他指出，内核开发人员已经需要关注很多语言（例如 C、汇编、Make、Bash、Perl、Python 等），所以他心中的一个问题是 Rust 将带来什么值得添加到列表中。该消息引发了关于 Rust 如何适合以及实验将走向何方的讨论。内核开发人员显然有些担心必须了解 Rust 才能继续开发内核。Ojeda 试图在一定程度上减轻这些担忧，但承认大多数内核开发人员最终需要了解该语言。 Ojeda 说，目前，该项目的目的是与希望向其子系统添加 Rust API 的维护者合作。这将在内核中引导对 Rust 的支持，并有助于缓解 Leon Romanovsky、JamesBottomley 和其他。 Romanovsky 担心在具有两种语言的驱动程序的系统中进行重构，尤其是跨子系统重构。 Bottomley 建议 Rust 代码的审阅者会更少，所以 bug 更容易溜进来：由于我们现在的大多数 CVE 类型问题通常是编程错误，缺乏审阅可能会导致编程错误类型错误的增加，这些错误不是被禁止的更安全的内存模型。在短期内，这些都是需要解决的问题，但目标是让 Rust 知识在内核开发人员中得到更广泛的传播。正如 Ojeda 所说：毕竟，如果我们要将 Rust 作为内核中的第二语言，我们应该尝试在合理的时间范围内让尽可能多的人加入，至少在某种程度上是这样。正如 Laurent Pinchart 指出的那样，这是一个重要的观点，需要在讨论中更明确地强调：[...] 在内核中采用 Rust 作为第二语言不仅仅是一个影响有限的技术决定，也是一个过程决定这将为大多数内核开发人员学习 Rust 创造条件。这是否应该和将会发生是我们正在辩论的问题，但无论结果如何，正确地表达问题并广泛地了解其含义是很重要的。当然，还有很多技术障碍需要清除。这些领域之一是 Linux 驱动程序模型和随之而来的对象生命周期处理。 Roland Dreier 建议像 devres（即管理设备资源）这样的接口可以避免很多他在驱动程序中看到的关于生命周期管理的问题，特别是错误路径，但它没有被广泛采用。 Walleij 不同意它没有被广泛使用，但完全不确定 Rust 开关是否更好：我认为这是一个巨大的成功，人们只需要学习更多。但是，如果学习更好行为的更简单的方法是洗牌整个棋盘并用 Rust 编写的驱动程序替换它，我不知道？也许？对于 Kroah-Hartman 来说，在 Rust 中看到内核的真实驱动程序将有助于弄清楚这些问题将如何在语言中解决。有一些难题需要解决：这将是“有趣的” Rust 工作的一部分，它必须弄清楚如何将我们当前在驱动程序模型中拥有的引用计数对象映射到 Rust 控制的对象并保持一切正确同步。对于普通代码，内存被分配给一个特定对象（结构设备）但还被另一个对象（cdev）引用的事实。像这样的 devm_* 用户似乎没有意识到这里发生了两个单独的对象生命周期，因为交互有时很微妙。我很期待 Rust 实现将如何处理所有这些，因为我不知道。\n还有一个问题是所有这些导致了哪里。 Walleij 想知道内核（即驱动程序）的“叶节点”是否实际上是从展示语言优势的角度出发的最佳位置。他还在 4 月份的长篇消息中询问了这一点。他的部分问题是决定从驱动程序开始是否是出于其他原因：如果首先做设备驱动程序的整个基本原理是战略性的，不一定会给该设备驱动程序子系统带来任何好处，而是作为试验场和试验场，那么该战略需要明确并被每个人理解。因此，虽然我们理解 Rust 作为所有这些 $UPSIDES 首先做设备驱动程序纯粹是战略性的，对吗？我认为也提到了如果它没有解决就可以撤回整个事情的能力？他还询问了用 Rust 编写整个子系统的问题。这将需要将 Rust API 暴露给内核中其他地方的 C 代码。它也有可能允许在内核中向越来越多的 Rust 演进：如果我们想在 Rust 中*编写*一个子系统，那么它当然会以另一种方式：Rust 需要将 API 暴露给 C。我假设宏伟的愿景是在那之后，Rust 将一次吃掉 Linux。如果它证明比 C 更好，那就是。 Ojeda 说，虽然可以将 Rust API 暴露给系统的 C 部分，但他不建议这样做。问题是 C 调用者失去了 Rust 带来的很多好处：一般来说，我会避免将 Rust 子系统暴露给 C。当然，这是可能的，并且它在*实现*中为您提供了 Rust 的优势子系统。然而，由于必须公开一个 C API，你将失去更丰富的类型系统的大部分优势，以及 Rust 作为一种语言为子系统的消费者带来的保证。类似地，约翰内斯·伯格询问是否用 Rust 替换子系统的部分，但将驱动程序留在 C 中——有效地与现有计划相反。 Ojeda 再次表示这是可能的，但告诫不要失去 Rust 功能和保证。此外，有些架构此时没有 Rustcompiler 可用，因此现在考虑基于 Rust 的子系统可能还为时过早。该项目的最终目标并不完全清楚。如果所有的 Linux 驱动程序都是用 Rust 编写的，那么仍然会有很多重要的部分运行不安全的 C；如果 Rust 同时证明自己，下一步是否会取代那些？但在这种情况下，“证明自己”的实际含义也不清楚。学习一门具有所有不同行为、怪癖和特质的新语言，对于已经在维护现有内核代码中处理相当多的复杂性的开发人员来说是一个非常大的要求。更不用说在已有功能的基础上提供新功能的额外复杂性。两个线程（和其他地方）的评论者似乎相当普遍的怀疑态度可能源于这种学习负担。将 Rust 添加到内核需要大量工作，对于很多不同的人来说，除了承诺之外，没有明确和明显的好处，只有用 Rust 编写的整个内核才能真正完全实现。 幸运的是，该项目可以提供一些明确的“胜利” “在早期，这清楚地展示了该语言的潜力和在像内核这样的大型复杂代码库上增量使用的能力。没有它，项目可能很难在“生锈”内核的目标上取得很大进展。\n（登录发表评论）&gt; Ojeda 试图在一定程度上减轻这些恐惧，但确实承认大多数内核开发人员最终需要了解该语言。我认为这是指这封电子邮件：https://lwn.net/ml/ksummit-discuss/CANiq72=LrxpE_2WmdDdb5...基本上它似乎是在说如果项目成功，最终结果应该是，如果你想要更改具有 Rust 绑定的 API，那么您需要了解这些 Rust 绑定，以便您也可以调整它们。这很有意义，如果您更改破坏其他内核代码的内核代码，那么您需要修复其他代码。但它确实清楚地说明了这个项目的范围以及承诺这个项目的决定有多大。为什么在 LWN 文章中如此偏向于谈论 Rust？我的意思是，这个补丁集可能（希望）永远不会合并，它的 lwn 文章与发布的版本一样多。在这里发现了多少重要的补丁集到 v2+（并且有机会登陆）？这是一个关于内核项目未来的基本决定；它似乎值得多看一看。借调。有史以来最重要的变化之一。请继续在更多报道而不是更少方面犯错。你不喜欢的偏见是我喜欢的偏见。有些人想要改善 Linux 环境。他们的努力可能会被拒绝，因为他们最终不符合合理的进入标准。这无关紧要。相关的是他们有一个与大多数其他改进工作完全不同的目标，并且相信它足以花费资源（时间、金钱等）。如果他们失败了，那么这种失败将影响未来的努力，包括 Rust 以外的语言。很好的答案，谢谢！最重要的是，Rust 可能会给 Linux 内核带来新的开发人员，否则他们不会接触它。 Rust 是一种适销对路的编程语言，C 是传统语言。从任何现代编程语言切换到 C 感觉就像进入了雷区。从用户空间到内核开发时更是如此。\n&gt; 从任何现代编程语言切换到 C 感觉就像进入了雷区。从用户空间到内核开发时更是如此。确切地。 C有很多footguns。 C++ 有更多的脚步声。你可以用 C++ 编写漂亮、干净、简洁的代码……但你无法避免它们——尤其是当编译器开发人员每年向语言中添加越来越多的代码时。 Rust 不会试图从语言中删除footguns（实际上，当您对内核进行编程时这基本上是不可能的），而是尝试确保它们中的每一个都被标记为不安全。这就是为什么从理论上讲，驱动程序听起来是最有希望移植到 Rust 的原因：它们通常是由硬件人员编写的，他们没有判断所有这些步枪的经验。并且，希望 API 可以提供给他们，允许他们在默认的、安全的、Rust 中编写驱动程序。但是如果你将内核的核心重写为 Rust ......收益会小得多：你越接近核心数据结构的黑暗魔法，就会有更多的内在脚步。这也是为什么为真正的硬件实现真正的驱动程序是一个重要的里程碑：某些讨厌的脚步声存在于内核中，因为它们是与硬件交互的固有特性，很高兴看到甚至移植一个驱动程序需要多大的胶水代码。如果胶水代码比实际的驱动程序代码多，这很好（它最终会与所有驱动程序共享，所以这没什么大不了的），但是如果驱动程序本身充满了许多不安全的块，那么整个练习就会变成有点无意义。 Rust 并没有试图彻底删除footguns 是不正确的。一些 C++ 步炮，尤其是继承自或建立在 C 兼容性基础上的 C++ 步炮（即使它们不一定是 C 中的步炮）是被遗忘的过去的遗物。例如，为什么允许“char” _either_ 有符号或无符号并且由实现来选择？因为当时的硬件千差万别。快进到 21 世纪，没有人希望他们在他们使用的 CPU 上拥有更快的 Rust i8 和 u8。那不是一回事。所以，如果你想要 i8 你就要求 i8，如果你想要 u8 你就要求 u8，因此你不能因为得到一种不是你想象的类型而大吃一惊。同样，为什么有符号整数在溢出时有未定义的行为？古代硬件以多种方式表示负数。因此，为了最大的兼容性，C 无法指定会发生什么。也许应该说平台定义，现在太晚了。很好，但是今天可用的每个平台都有二进制补码算法，所以这没有用。 Rust 可以预先说明这一点。调试造成恐慌！如果您溢出，如果错误一直存在到 Production ，您将获得二进制补码算法并祝您好运。如果您明确_想要_包装或饱和算术（后者在音频中尤其有意义），您可以在 Rust 中请求它们，无论是用于一个操作（例如饱和加法）还是作为变量的类型，您都会得到您想要的要求，没有恐慌，编译器为这种情况生成了良好的优化代码。但是，即使没有消除溢出的“未定义行为”的脚步。有时编译器变得更好，我们不再需要说明可以推断出什么。 C 和 C++ 都有一对一元增量运算符。他们是步兵。 b++ 和 ++b 都比 b += 1 的输入要少一些，但是它们将很多出错的机会挤进了这么少的字符中。为什么是其中两个？因为 C 和 C++ 使这些一元运算符具有结果以及它们的赋值效果，即使您很少需要它，并且结果是不同的。在 Rust 中，一元增量不存在，其他赋值运算符没有结果（严格来说，它们的结果是空元组），如果你的意思是 a = b; b+= 1 你可以这样写，如果你的意思是 b+= 1; a = b 你可以这样写。别担心，现代编译器很聪明，你不会因为输入稍微多一点而得到更慢的代码。有时同时明确问题范围。 Rust 缺少 C 和 C++ 的“volatile”关键字，我之前曾详细讨论过。该关键字可能是错误的。它在 Unix 中的用途在 Rust 中作为一组名为 volatile_read 和 volatile_write 的编译器内部函数存在（一组因为它们有不同的大小，事实证明你的硬件知道你是写了一个 32 位整数还是两个 16 位整数整数到内存），并且它在 C 或 C++ 中被错误地滥用的许多事情今天在这些语言中被明确禁止，因为它们无法工作。所以在实践中，Rust 的 volatile_read/ volatile_write 和 C++ volatile 关键字之间的差距只是你通过没有那种类型限定符而避免的。除了与 unsafe 关键字本身相关的事情（例如调用不安全的函数），我相信 Rust 只允许你在不安全的代码中做 3 件事，而你在安全代码中是不允许做的。您可以取消引用原始指针。您可以访问联合中的字段。你可以改变静态。就这样。这些确实是潜在的枪支（谁知道原始指针指向什么，如果有的话；也许联合中的那个字段不是其中包含有效数据的字段；嘿，另一个线程正在读取该静态变量，似乎在更改它）像一个坏主意）但这是一个比你预期的要小得多的集合。 &gt; 也许应该说平台定义，现在太晚了。为什么为时已晚？正确的程序将保持正确，而错误的程序（他们的作者认为是正确的！）将变得真正正确。\n事实上，这正是应该发生的事情：未定义的行为使实现者许可不捕获某些难以诊断的程序错误。它还确定了可能符合语言扩展的领域：实现者可以通过提供官方未定义行为的定义来扩充语言（强调我的）。签名溢出被声明为“未定义”没有......", "note_en": "This article brought to you by LWN subscribers Subscribers to LWN.net made this article — and everything that surrounds it — possible. If you appreciate our content, please  buy a subscription and make the next set of articles possible.\n   On July 4, the  Rust for Linux project postedanother version of its patch set adding support for the language to thekernel. It would seem that the project feels that it is ready to be considered formerging into the mainline. Perhaps a bigger question lingers, though: is the kerneldevelopment community ready for Rust? That part still seems to be up in the air.\n  Miguel Ojeda, who has been hired to  work onthe project full-time, posted the patch set; in the cover letter, he listed anumber of changes and updates since the  RFC patchset was  posted back in April. Inparticular, the allocations that would call  panic!() when theyfailed have beenreplaced. A modified version of the   alloc crate has been created for thekernel project, though the plan is for the changes to work their wayinto the upstream project so that the customized version can eventually be dropped.Incidentally, the patch adding the modified crate was  apparentlytoo large for the lore archive, though it does  showup in the LWN archive.\n There is more progress on Rust abstractions for kernel facilities,including &#34; red-black trees, reference-counted objects, filedescriptor creation, tasks, files, io vectors...&#34;, he said, as wellas additions for driver support. Beyond that, theRust driver for the  Android Binder interprocesscommunication mechanism has more features and there is ongoing work on a driver forthe hardware random-number generator available on some Raspberry Pi models.\n But the lack of a &#34;real&#34; driver was one of the sticking points back inApril, and it was raised again this time. Christoph Hellwig  said that he wasstrongly against merging the code if that was the intent of the posting.In the cover letter, Ojeda said that the patch set was being added to linux-next, andhe  confirmedthat it is being submitted for merging. Hellwig wants to see Rust proveitself before being included: [...] prove it actually is useful first. Whereuseful would be a real-life driver like say nvme or a usb hostcontroller driver that actually works and shows benefits over theexisting one. Until it shows such usefulness it will just drageveryone else down.\n Ojeda pointed at the Binder driver as a &#34; non-trivial module&#34;that &#34; is already working&#34;, but acknowledged that a realhardware driver is an important (and, as yet, missing) piece. But the coverletter listed a number of organizations that are interested in or involved withthe project already, and Ojeda believes that is also something that ishelping to prove the project: It is &#34;proven&#34; in the sense we are already starting to get usersdownstream and other interested parties have shown support. However, others are more conservative and will only start investinginto it if we are in mainline, i.e. if the decision of having Rust ornot is already taken.\n But the Binder &#34;driver&#34; is not really a good example to use for a few differentreasons, Greg Kroah-Hartman  said. It ismissing a fairly large piece of functionality (binderfs) for one thing, but it also doeslittle to help show how Rust will fit in with the rest of the kernel. Asbefore, he strongly recommended working on something that would help clearup some of the questions that kernel developers have about Rust: Not to say that it doesn&#39;t have its usages, but the interactions betweenbinder and the rest of the kernel are very small and specific.Something that almost no one else will ever write again. Please work on a real driver to help prove, or disprove, that this allis going to be able to work properly. There are huge unansweredquestions that need to be resolved that you will run into when you dosuch a thing.\n  The theme of Rust proving itself was also present in a thread on the ksummit-discuss mailinglist. At the end of June, Ojeda  proposedRust for Linux as a technical topic for the Kernel Summit track at thisyear&#39;s  Linux PlumbersConference. On July 6, Linus Walleij  replied, agreeing that it was a topic that should be discussed. He noted that thereare already quite a few languages that kernel developers need to beup on (e.g. C, assembly, Make, Bash, Perl, Python, ...), so a question inhis mind is what Rust will bring to the table that makes it worth adding tothe list.\n That message started the ball rolling on a discussion of how Rust fits—andwhere the experiment leads. There is clearly some concern among kerneldevelopers about having to know Rust to continue working on the kernel.Ojeda tried to allay those fears to a certain extent, but did acknowledgethat most kernel developers would eventually need to understand thelanguage. For now, the intent is for the project to work withmaintainers that want to add a Rust API to their subsystem, Ojeda  said.That will bootstrap support for Rust within the kernel and will help alleviate some ofthe concerns expressed by   Leon Romanovsky, JamesBottomley, and others.\n Romanovsky was worried about refactoring, especially cross-subsystemrefactoring, in a system with drivers in both languages. Bottomleysuggested that there would be fewer reviewers for the Rust code, so bugscould more easily slip in: Since most of our CVE type problems are usuallyprogramming mistakes nowadays, the lack of review could contribute toan increase in programming fault type bugs which aren&#39;t forbidden bythe safer memory model.\n In the near term, those are problems that will need to be dealt with, butthe goal is to get to a point where Rust knowledge is more widespread amongkernel developers. As Ojeda  putit: After all, if we are going to have Rust as a second language in thekernel, we should try to have as many people on board as possible, atleast to some degree, within some reasonable time frame.\n As Laurent Pinchart  pointedout, that is an important point and one that needs to be more clearlyhighlighted in the discussion: [...] adopting Rust asa second language in the kernel isn&#39;t just a technical decision withlimited impact, but also a process decision that will create arequirement for most kernel developers to learn Rust. Whether thatshould and will happen is what we&#39;re debating, but regardless of theoutcome, it&#39;s important to phrase the question correctly, with a broadview of the implications.\n There are, of course, plenty of technical hurdles that need to be clearedas well. One of those areas is the Linux driver model and theobject-lifetime handling that goes along with it. Roland Dreier  suggestedthat interfaces like  devres(i.e. managed device resources) could have avoided a lot of problems thathe has seen in drivers regarding lifetime management, and error paths in particular, butthat it has not been adopted widely. Walleij  disagreedthat it hasn&#39;t been widely used, but is not at all sure that a Rust switch is better: I think it&#39;s a formidable success, people just need to learn to do it more. But if an easier path to learn better behaviours is to shuffle the wholechessboard and replace it with drivers written in Rust, I don&#39;t know?Maybe?\n For Kroah-Hartman, seeing real drivers in Rust for the kernel would help clear up how these problems are going to be solved in the language.There are some difficult problems that will need to be tackled: This is going to be the &#34;interesting&#34; part of the rust work, where ithas to figure out how to map the reference counted objects that wecurrently have in the driver model across to rust-controlled objects andkeep everything in sync properly. For the normal code, the fact that the memory was assigned to onespecific object (the struct device) but yet referenced from anotherobject (the cdev). devm_* users like this do not seem to realize thereare two separate object lifecycles happening here as the interactionsare subtle at times. I am looking forward to how the rust implementation is going to handleall of this as I have no idea.\n There is also the question of where all of this leads. Walleij  wonderedwhether the &#34;leaf nodes&#34; of the kernel (i.e. drivers) are actually the best place to startfrom the perspective of showing the benefits of the language. He also  askedabout that in a lengthy message back in April. Part of his question iswhether thedecision to start with drivers was made for other reasons: If the whole rationale with doing device drivers first is strategic,not necessarily bringing any benefits to that device driversubsystem but rather serving as a testing ground and guineapig, then that strategy needs to be explicit and understoodby everyone. So while we understand that Rust asall these $UPSIDES doing device drivers first is purelystrategic, correct? I think the ability to back out the wholething if it wasn&#39;t working out was mentioned too?\n He also asked about writing whole subsystems in Rust. That would entail exposingRust APIs to C code elsewhere in the kernel. It would also potentially allowan evolution toward more and more Rust in the kernel: If we want to *write* a subsystem in Rust then of course it willgo the other way: Rust need to expose APIs to C. And I assumethe grand vision is that after that Rust will eat Linux, one pieceat a time. If it proves better than C, that is.\n Ojeda  saidthat while it is possible to expose Rust APIs to the C part of the system,he does not recommend it. The problem is that the C callers lose much ofthe benefit that Rust brings to the table: In general, I would avoid exposing Rust subsystems to C. It is possible, of course, and it gives you the advantages of Rust inthe *implementation* of the subsystem. However, by having to expose aC API, you would be losing most of the advantages of the richer typesystem, plus the guarantees that Rust bring as a language for theconsumers of the subsystem.\n In a similar vein, Johannes Berg  askedabout replacing parts of a subsystem with Rust, but leaving the drivers inC—the reverse of the existing plan, effectively. Once again, Ojeda  saidthat its possible, but cautioned about losing Rust features andguarantees. In addition, there are architectures where there is no Rustcompiler available at this point, so it may be premature to be looking atRust-based subsystems.\n  The project&#39;s eventual goal is not entirely clear. If all of the Linux drivers were written in Rust, there would still be lotsof big important pieces that are running unsafe C; is the next step toreplace those if Rust proves itself in the meantime? But it is alsounclear what &#34;proves itself&#34; actually means in this context.\n Learning a new language, with all of its different behaviors,quirks, and idiosyncrasies,is a pretty big ask for developers who are already juggling a fair amountof complexity in maintaining the existing kernel code. Not to mention the addedcomplexity of providing new functionality on top of what&#39;s already there. Theskepticism that seems fairly prevalent from commenters in both threads (andelsewhere) likely stems from that learning burden.\n Adding Rust to the kernel requires a lot of work, for a lot ofdifferent people, without a clear and obvious benefit beyond promises thatcan only truly be fully fulfilled with a whole kernel written in Rust.With luck, the project can provide some clear &#34;wins&#34; in the early goingthat clearly demonstrate both the potential of the language and an abilityto be utilized incrementally on a large and complex code base like thekernel. Without that, it may be difficult for the project to progress veryfar in the goal of &#34;rustifying&#34; the kernel.\n     ( Log in to post comments)\n  &gt; Ojeda tried to allay those fears to a certain extent, but did acknowledge that most kernel developers would eventually need to understand the language.  I think this is referring to this email:  https://lwn.net/ml/ksummit-discuss/CANiq72=LrxpE_2WmdDdb5...  Basically it seems to be saying that if the project is a success the end result should be, if you want to change APIs which have Rust bindings, then you need to understand those Rust bindings so you can adjust them as well.  Which makes a lot of sense, if you change kernel code which breaks other kernel code, then you need to fix that other code. But it does make clear the scope of this project and how big a decision it is to commit to this.\n  Why such a bia in LWN articles to talk about rust? I mean, this patchset, that will probably (hopefuly) never get merged, has as many lwn articles as versions published. How many important patchsets got to a v2+ (and with a chance to land) were uncovered here?\n This is a fundamental decision about the future of the kernel project; it seems worthy of more than one detailed look.\n Seconded. One of the most important changes ever considered. Please continue to err on the side of more coverage rather than less.\n  The bias that you do not like is a bias that I like.  There are people that want to improve the Linux environment. Their effort might be rejected because they end up not meeting the reasonable entry criteria. And that is not relevant.  What is relevant is that they have a goal that is quite different to most other improvement efforts, and believe in it enough to spend resources (time, money, etc). And if they fail, then that failure will inform future efforts, including languages other than Rust.\n Excellent answer, thank you! On top of that Rust may bring new developers to Linux kernel who would not touch it otherwise. Rust is a marketable programming language, C is legacy. Switching from any modern programming language to C feels like going to a minefield. Even more so when going from userspace to kernel development.\n &gt; Switching from any modern programming language to C feels like going to a minefield. Even more so when going from userspace to kernel development. Exactly. C have lots of footguns. C++ have  even more footguns. You can write nice, clean, concise code in C++… but you can&#39;t avoid them — especially when compiler developers add more and more of them to the language each year.\n Rust doesn&#39;t try to remove footguns from the language (indeed, when you are programming the kernel that&#39;s basically impossible) but tries to make sure each and every one of them is marked as  unsafe.\n That&#39;s why driver sounds, in theory, most promising thing to port to Rust: they are often written by hardware guys, who are not experienced with judging all these footguns. And, also, hopefully, API can be presented to them which allows them to write drivers in default, safe, Rust.\n  But if you rewrite core of kernel into Rust… gains would be much smaller: the closer to the dark magic of core data structures you come the more  inherent footguns would be there.\n And that&#39;s also why implementing real driver for real hardware is important milestone: certain nasty footguns live in kernel because they are inherent to interaction with hardware and it would be nice to see how large the glue code would be needed to even port one driver. It&#39;s fine if there would be more glue code than actual driver code (it would, eventually, be shared with all drivers so it&#39;s not a big deal), but if the driver itself would be peppered with numerous  unsafe blocks then the whole exercise would become a bit pointless.\n It&#39;s not true that Rust doesn&#39;t try to outright remove footguns.  Some of the C++ footguns, especially C++ footguns inherited from, or founded upon C compatibility (even if they weren&#39;t necessarily footguns in C) are relics of a forgotten past. For example, why is &#34;char&#34; allowed to be _either_ signed or unsigned and it&#39;s up to the implementation to choose? Because the hardware at the time varied. Fast forward to the 21st century and nobody wishes they had whichever of Rust&#39;s i8 and u8 is faster on the CPU they&#39;re using. That isn&#39;t a thing. So, if you want i8 you ask for i8 and if you want u8 you ask for u8, and you thus can&#39;t blow your foot off by getting a type that isn&#39;t what you thought it would be.  Likewise, why do the signed integers have undefined behaviour on overflow? Ancient hardware represented negative numbers in several ways. So, for maximum compatibility C can&#39;t specify what happens. Maybe it should have said platform defined, too late now. Great, but every platform available today has two&#39;s complement arithmetic, so this serves no purpose. Rust gets to just say this up front. Debug builds panic! if you overflow, if the mistake survives until Production you get two&#39;s complement arithmetic and good luck with that. If you explicitly _want_ wrapping, or saturating arithmetic (the latter especially could make sense in audio), you can ask for them in Rust, either for one operation (e.g. a saturating addition) or as the type of a variable and you get what you asked for, no panics, the compiler produces good optimised code for this case. But even if not the footgun of &#34;Undefined behaviour&#34; for overflow is banished.  Sometimes compilers got better and we no longer need to spell out what can be inferred. C and C++ both have the pair of unary increment operators. They are footguns. Both b++ and ++b are a bit less typing than b += 1 but they squeeze a lot of opportunity for mistakes into so few characters. Why two of them? Because C and C++ make these unary operators have a result as well as their assignment effect, even though you rarely need it, and the results are different. In Rust the unary increments don&#39;t exist, and the other assignment operators do not have a result (strictly, their result is the empty tuple), if you mean a = b; b+= 1 you can write that, and if you mean b+= 1; a = b you can write that instead. Don&#39;t worry, a modern compiler is smart, you don&#39;t get slower code just because it was slightly more typing.  Sometimes the problem scope was meanwhile clarified. Rust lacks C and C++&#39;s &#34;volatile&#34; keyword which I&#39;ve talked about before at some length. That keyword is probably a mistake. The thing it was intended for in Unix exists in Rust as a set of compiler intrinsics named volatile_read and volatile_write (a set because they come in different sizes, it turns out your hardware knows whether you wrote a 32-bit integer or two 16-bit integers to memory), and many of the things it was mistakenly abused to do in C or C++ are specifically outlawed in those languages today because they can&#39;t work. So in practice the gap between Rust&#39;s volatile_read/ volatile_write and C++ volatile keyword is just footguns you avoided by not having that type qualifier.  Aside from things related to the unsafe keyword itself (e.g. calling unsafe functions) I believe Rust only lets you do 3 things in unsafe code that you weren&#39;t anyway allowed to do in safe code. You can dereference a raw pointer. You can access fields in a union. You can mutate statics. That&#39;s all. Those are indeed potential footguns (who knows what, if anything, that raw pointer is pointing at; maybe that field in the union isn&#39;t the one with valid data in it; hey, another thread is reading that static variable, changing it seems like a bad idea) but that&#39;s a much smaller set than you might have expected.\n &gt; Maybe it should have said platform defined, too late now. Why is it too late? Correct programs would stay correct and incorrect programs (which their authors perceive as correct!) would become truly correct.\n In fact his is  exactly  what was supposed to happen:  Undefined behavior gives the implementor license not to catch certain program errors that are difficult to diagnose. It also identifies areas of possible conforming language extension:  the implementor may augment the language by providing a definition of the officially undefined behavior (emphasis mine).\n Signed overflow was declared “undefined” no\n......", "posttime": "2021-07-24 18:31:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,rust", "title": "用于 Linux Redux 的 Rust", "title_en": "Rust for Linux Redux", "transed": 1, "url": "https://lwn.net/Articles/862018/", "via": "", "real_tags": ["linux", "rust"]}, {"category": "", "categoryclass": "", "imagename": "87e36d4a62e14082e08a95be63666f87.png", "infoid": 1069437, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周我有两件特别重要的事情要展示！不是 Steam Deck 级别的大，但我认为还是很酷的。 🙂 首先，David Redondo 和 Kai Uwe Broulik 实现了电源配置文件功能！这允许您指定计算机应如何平衡能源使用与性能。您可以随时使用电池和亮度小程序切换模式，并且您可以配置在插入或拔出电源线时自动使用哪个配置文件。当使用 Linux Kernel 5.12 或更高版本时，该功能将在 Plasma 5.23 中可用，并且支持它的较新计算机。接下来，Plasma 5.20 中引入的新 Kickoff 启动器菜单进行了巨大的代码修改，修复了许多错误，提高了性能和可访问性，收紧了用户界面，并添加了一些常见的功能。修复：页脚中的电源/会话项目或侧边栏中的项目的长文本不再被忽略；相反，布局水平延伸以容纳它们使用箭头键导航搜索结果列表不再丢弃第一次击键您现在可以选择是对所有应用程序视图使用列表还是网格，而不仅仅是收藏夹类别 Pin 按钮具有已添加，因此您现在可以根据需要将其打开——就像您可以为系统托盘、数字时钟和 KRunner 做的一样\n非常感谢诺亚戴维斯完成这个彻底的改变！它将在 Plasma 5.23 中发布。现在可以更改系统监视器中的传感器标签并提供自定义文本（David Redondo，Plasma 5.23）系统设置登录屏幕页面的同步功能现在也同步您的屏幕排列，以便登录屏幕 UI 正确定位在您的所有物理屏幕上（Aleix Pol Gonzalez，Plasma 5.23）：Dolphin 上下文菜单中的“开始幻灯片”菜单项现已翻译（Yuri Chornoivan，Gwenview 21.08）如果故意固定，打开数字时钟小程序的设置对话框不再关闭小程序的弹出窗口打开 (David Redondo, Plasma 5.22.3) 系统托盘扩展弹出窗口中的网格项目现在总是完全像素对齐，因此它们不会变得模糊 (Derek Christ, Plasma 5.22.4) 在桌面项目的上下文菜单中，按当子菜单打开时，用于在“移至垃圾箱”和“删除”之间切换的 shift 键现在可以工作（Derek Christ，Plasma 5.22.4）\n桌面文件在文件名中包含大写字符的应用程序的全局快捷方式现在可以正常工作，并且它们在“系统设置快捷方式”页面中的条目现在总是显示正确的图标（David Redondo，Plasma 5.22.4）带有嵌入链接的 Plasma 通知现在使用链接颜色来自 Plasma 主题而不是应用程序配色方案，修复了在这些不同的情况下的错误，例如应用 Breeze Twilight 主题时 (Kai Uwe Broulik, Plasma 5.22.4) Unsplash Picture of the Day 壁纸配置页面中的类别列表现在按字母顺序排序，而不是半随机排序（Arnaud Vergnet，Plasma 5.22.4）在 KRunner 中显示的来自使用 Plasma 浏览器集成的浏览器的网站图标现在在使用高 DPI 比例因子时非常清晰（Kai Uwe Broulik， Plasma 5.22.4) 打开系统设置用户反馈页面不再短暂地使 Discover 出现在任务管理器中 (Plasma 5.23) 在 Plasma Wayland 会话中，glob所有快捷方式再次工作，而否则会窃取焦点（在 X11 上）的弹出窗口打开（Andrey Butirsky，Plasma 5.33）现在每个 Dolphin 的缩放级别都有与其相关联的不同图标大小；不再会改变缩放级别有时会导致网格的大小发生变化，但图标保持相同的大小（Eugene Popov，Dolphin 21.12）\n当使用显示桌面效果时，使用自适应透明度功能的面板现在进入透明模式（David Edmundson，Plasma 5.22.4）在 Discover 中浏览应用程序列表时，应用程序来源的图标现在显示在按钮内还列出了源的名称（我：Nate Graham，Plasma 5.23）：标题栏中的问号按钮现在默认为对话框窗口隐藏（我：Nate Graham，Plasma 5.23）Plasma 日历小部件上的事件指示器点并且无论您使用何种配色方案或 Plasma 主题，数字时钟弹出窗口现在都更加明显（Carl Schwan，Framework 5.85）基于 Kirigami 的应用程序的“关于”页面现在显示“参与”链接，将您带到 https ://community.kde.org/Get_Involved（Felipe Kinoshita，Frameworks 5.85）：请记住，这个博客只涵盖了冰山一角！我没有时间关注其开发的大量 KDE 应用程序在这里没有展示，我也没有提到后端重构、改进的测试覆盖率和其他通常不面向用户的更改。如果您想了解更多信息，请查看 https://planet.kde.org/，在那里您可以找到其他 KDE 贡献者的博客文章，详细介绍了他们正在做的工作。看看 https://community.kde.org/Get_Involved 发现如何成为真正重要的项目的一部分。每个贡献者都对 KDE 产生了巨大的影响；你不是机器中的数字或齿轮！您也不必已经是程序员。我刚开始的时候不是。试试吧，你会喜欢的！我们不咬人！", "note_en": "This week I have two particularly large things to present! Not  Steam Deck levels of large, but still pretty cool, I think. 🙂\n First of all, David Redondo and Kai Uwe Broulik implemented the  power profiles feature! This allows you to specify how your computer should balance energy use against performance. You can switch modes at any time using the Battery and Brightness applet, and you can configure which profile gets used automatically when plugging or unplugging the power cord. The feature will be available in Plasma 5.23 with a newer computer that supports it when using Linux Kernel 5.12 or greater.\n   Next, the new Kickoff launcher menu that was introduced in Plasma 5.20  has received a gigantic code overhaul which fixes many bugs, improves performance and accessibility, tightens up the user interface, and adds a few commonly requested features. Among the fixes:\n Long text for  the power/session items in the footer or  items in the sidebar is no longer ever elided; instead the layout stretches horizontally to accommodate them\n Using the arrow keys to navigate the search results list  no longer discards the first keystroke\n        You  can now choose whether to use a list or a grid for all app views, not just the Favorites category\n A Pin button has been added, so you can now pin it open if you like–just like you can do for the System Tray, Digital Clock, and KRunner\n   Big thanks to Noah Davis for completing this exhaustive change! It will be released in Plasma 5.23.\n    Sensor labels in System Monitor  can now be changed and given custom text (David Redondo, Plasma 5.23)\n The System Settings Login Screen page’s synchronization feature  now syncs your screen arrangement as well, so that the login screen UIs are positioned properly on all your physical screens (Aleix Pol Gonzalez, Plasma 5.23):\n     The “Start a Slideshow” menu item in Dolphin’s context menu  is now translated (Yuri Chornoivan, Gwenview 21.08)\n Opening the Digital Clock applet’s settings dialog  no longer closes the applet’s popup if it has been deliberately pinned open (David Redondo, Plasma 5.22.3)\n    The grid items in the System Tray’s expanded popup  are now always perfectly pixel-aligned so they will not become blurry (Derek Christ, Plasma 5.22.4)\n  In the context menu for desktop items, pressing the shift key to switch between “Move to Trash” and “Delete”  now works when a sub-menu is open (Derek Christ, Plasma 5.22.4)\n Global shortcuts for apps whose desktop files have uppercase characters in their filenames  now work properly, and  their entries in the System Settings Shortcuts page now always display the correct icons (David Redondo, Plasma 5.22.4)\n Plasma Notifications with embedded links  now use the link color from the Plasma theme rather than the application color scheme, fixing bugs in cases where these differed such as when the Breeze Twilight theme is applied (Kai Uwe Broulik, Plasma 5.22.4)\n Category lists in the Unsplash Picture of the Day wallpaper’s configuration page  are now sorted alphabetically, rather than semi-randomly (Arnaud Vergnet, Plasma 5.22.4)\n Website Favicons displayed in KRunner that come from a browser using Plasma Browser Integration  are now nice and crisp when using a high DPI scale factor (Kai Uwe Broulik, Plasma 5.22.4)\n Opening the System Settings User Feedback page  no longer briefly makes Discover appear in the Task Manager (Plasma 5.23)\n In the Plasma Wayland session,  global shortcuts once again work while popups that would otherwise steal focus (on X11) are open (Andrey Butirsky, Plasma 5.33)\n     Every one of Dolphin’s zoom levels now has a different icon size associated with it; no longer will changing the zoom level sometimes cause the size of the grid to change but the icons stay the same size (Eugene Popov, Dolphin 21.12)\n Panels using the Adaptive Transparency feature  now enter transparent mode when the Show Desktop effect is in use (David Edmundson, Plasma 5.22.4)\n   When browsing app lists in Discover, the icon of the source that the app comes from  is now displayed inside the button that also lists the name of the source (me: Nate Graham, Plasma 5.23):\n    The question mark button in the titlebar  is now hidden by default for dialog windows (me: Nate Graham, Plasma 5.23)\n   Event indicator dots on the Plasma Calendar widget and the Digital Clock popup  are now more visible no matter what color scheme or Plasma theme you’re using (Carl Schwan, Frameworks 5.85)\n Kirigami-based apps’ “About” pages  now display a “Get Involved” link that takes you to  https://community.kde.org/Get_Involved (Felipe Kinoshita, Frameworks 5.85):\n   Keep in mind that this blog only covers the tip of the iceberg! Tons of KDE apps whose development I don’t have time to follow aren’t represented here, and I also don’t mention backend refactoring, improved test coverage, and other changes that are generally not user-facing. If you’re hungry for more, check out  https://planet.kde.org/, where you can find blog posts by other KDE contributors detailing the work they’re doing.\n  Have a look at  https://community.kde.org/Get_Involved to discover ways to be part of a project that really matters. Each contributor makes a huge difference in KDE; you are not a number or a cog in a machine! You don’t have to already be a programmer, either. I wasn’t when I got started. Try it, you’ll like it! We don’t bite!", "posttime": "2021-07-24 18:30:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kde,现在", "title": "本周 KDE：电源配置文件和更精美的 Kickoff", "title_en": "This week in KDE: Power profiles and a more polished Kickoff", "transed": 1, "url": "https://pointieststick.com/2021/07/23/this-week-in-kde-power-profiles-and-a-more-polished-kickoff/", "via": "", "real_tags": ["kde", "现在"]}, {"category": "", "categoryclass": "", "imagename": "4d1cd705c86a0441d676aeb20499fe81.jpg", "infoid": 1069436, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今晚 Adam Barth 将带我们参观 Google 的新操作系统 Fuchsia。我们将看到一些事情是如何在幕后工作的，并写下...", "note_en": "Tonight Adam Barth will take us on a tour of Google's new operating System, Fuchsia.  We'll get to see how some things work under the hood as well as write o...", "posttime": "2021-07-24 18:30:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,fuchsia,adam", "title": "Fuchsia 操作系统之旅", "title_en": "A Tour of the Fuchsia Operating System", "transed": 1, "url": "https://www.youtube.com/watch?v=gIT1ISCioDY", "via": "", "real_tags": ["操作系统", "fuchsia", "adam"]}]