[{"category": "", "categoryclass": "", "imagename": "4ceec076126f66b7fb9d3c1d8687d6cd.png", "infoid": 1006211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "利用集成I/O，利用自定义CPU、GPU和固态硬盘的强大功能，重写PlayStation控制台的功能规则。\n支持触觉反馈、自适应触发器和3D音频技术，体验更深层次的游戏体验。", "note_en": "Harness the power of a custom CPU, GPU, and SSD with Integrated I/O that rewrite the rules of what a PlayStation console can do.\n    Discover a deeper gaming experience with support for haptic feedback, adaptive triggers and 3D Audio technology.", "posttime": "2020-06-12 06:07:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "playstation,功能", "title": "PlayStation 5", "title_en": "Playstation 5", "transed": 1, "url": "https://www.playstation.com/en-us/ps5/", "via": "", "real_tags": ["功能"]}, {"category": "", "categoryclass": "", "imagename": "20d9656b23a349fa2dc02ab7f91b2de2.png", "infoid": 1006210, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索尼终于公布了PlayStation5的外观。在近一个小时的PS5游戏发布后，索尼在今天PS5现场活动期间对其进行了调侃，随后透露了硬件设计。PS5控制台采用黑白相间的设计，与包装盒中将包含的新控制器相匹配。\nPS5垂直站立，就像Xbox系列X主要是为放置而设计的一样，它将包括两个版本：一个是4K蓝光驱动器，另一个是纯数字版。由于移除了光驱，不带光驱的PS5机型看起来比普通机型要薄很多。\n驱动器的移除应该意味着PS5的数字版也更便宜了，但索尼还没有提到价格。索尼只是在直播过程中透露了这一设计，但该公司尚未提供PS5的两个变种的定价和发布日期。\n就像Xbox系列X一样，PS5可以垂直或水平放置在电视或显示器下面。索尼已经建造了一个支架，可以用于任何方向，该公司正在为PS5的数字版使用一个看起来略有不同的支架。PS5的顶部似乎还包括散热的通风口，前面有USB-A和USB-C端口。\n索尼还为PS5制作了一系列配件，包括DualSense充电站、新的高清摄像头、Pulse 3D无线耳机和媒体遥控器。索尼尚未宣布其任何配件的定价，也没有宣布它们是否都将与新的PS5游戏机一起发布。\n在索尼公布PS5硬件设计的几个月前，微软在2019年12月公布了其下一代游戏机Xbox Series X类似PC的外观。\n索尼和微软一样，近几个月来一直在慢慢提供有关下一代PS5的更多信息。这款游戏机将在假日季上市，由八核AMD Zen 2CPU和定制的基于AMD rDNA2的GPU驱动。索尼在3月份宣布了PS5的规格，定制的AMD芯片将在CPU和GPU上使用可变频率提供10.28万亿次浮点的功率。\n索尼还在使用专有的SSD解决方案来提高游戏的加载时间。固态硬盘将提供825 GB的存储和5.5 GB/s的性能。索尼要求所有游戏都安装在内部固态硬盘上，以利用读取速度。EPIC Games最近提供了一个在PS5上运行的令人惊叹的虚幻5技术演示，展示了电影般的8K资产和动态灯光效果的加载。PS5还将支持8K显卡、120 Hz刷新率的4K显卡和3D音频。\n索尼还在4月7日发布了PS5的DualSense控制器。该控制器具有自适应触发器、触觉反馈和一个新的创建按钮，该按钮旨在共享游戏内容。与该公司的DualShock控制器一样，D-pad和按钮将保留在控制器的上半部分，而其两个模拟棒将位于底部。DualSense还将有一个中央安装的触摸板和一个重新设计的位于触摸板两边的灯条。\nPS5还将支持目前存在的4000多款PlayStation4游戏中的“绝大多数”。索尼在3月份表示：“我们预计向后兼容的游戏将在PS5上以更高的频率运行，这样它们就可以从更高或更稳定的帧率和潜在的更高分辨率中受益。”育碧已经表示，刺客信条瓦尔哈拉将在这个假日季登陆PlayStation5。", "note_en": "Sony is finally revealing what the PlayStation 5 looks like. After nearly an hour of PS5 game announcements, Sony revealed the hardware design after teasing it for the duration of its PS5 live event today. The PS5 console includes a white-and-black design to match the new controller that will be included in the box.\n The PS5 stands vertically, like the Xbox Series X is primarily designed to be placed, and will include two versions: one with a 4K Blu-ray drive and a pure Digital Edition. The PS5 variant without the optical drive looks substantially thinner than the regular model, thanks to the removal of the drive.\n   The removal of the drive should mean the Digital Edition of the PS5 is cheaper, too, but Sony hasn’t mentioned price just yet. Sony simply revealed the design during its live stream, but the company hasn’t provided pricing or release dates for either variants of the PS5.\n Just like the Xbox Series X, the PS5 can be placed vertically or horizontally underneath a TV or monitor. Sony has built a stand that works for either orientation, and the company is using what looks like a slightly different stand for the Digital Edition of the PS5. The top of the PS5 unit also appears to include vents for heat dissipation, with USB-A and USB-C ports at the front.\n  Sony has also created a  number of accessories for the PS5, including a DualSense charging station, a new HD camera, a Pulse 3D wireless headset, and a media remote. Sony has not yet announced pricing for any of its accessories, or whether they will all launch alongside the new PS5 consoles.\n Sony’s PS5 hardware design reveal comes months after Microsoft revealed the PC-like look of its next-gen console, the Xbox Series X, all the way  back in December 2019.\n   Sony, like Microsoft, has been slowly providing more information about its next-gen PS5 in recent months. The console will arrive in the holiday season and is powered by an eight-core AMD Zen 2 CPU and a custom AMD RDNA 2-based GPU.  Sony announced the PS5 specs in March, and the custom AMD chips will provide 10.28 teraflops of power using variable frequencies on both the CPU and GPU.\n Sony is also using a proprietary SSD solution to boost load times for games. The SSD will provide 825GB of storage and 5.5GB/s of performance.  Sony is requiring that all games be installed to the internal SSD to make use of the read speeds. Epic Games recently provided a  stunning Unreal 5 tech demonstration running on the PS5, showing off the loading of cinematic 8K assets and dynamic lighting effects. The PS5 will also support 8K graphics,  4K graphics at a 120Hz refresh rate, and 3D audio.\n   Sony also announced  the PS5’s DualSense controller on April 7th. The controller features adaptive triggers, haptic feedback, and a new create button that’s designed to share gameplay content. Like the company’s DualShock controllers, the D-pad and buttons will remain on the top half of the controller while its two analog sticks will be on the bottom. The DualSense will also have a center-mounted touchpad and a redesigned light bar that sits on each side of the touchpad.\n The PS5 will also support an “ overwhelming majority” of the more than 4,000 PlayStation 4 titles that exist today. “We’re expecting backward compatible titles will run at a boosted frequency on PS5 so that they can benefit from higher or more stable frame rates and potentially higher resolutions,”  Sony said in March. And Ubisoft has already said that   Assassin’s Creed Valhalla is headed to the PlayStation 5 this holiday season.", "posttime": "2020-06-12 06:07:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "playstation5,playstation,ps5", "title": "PlayStation5", "title_en": "The PlayStation 5", "transed": 1, "url": "https://www.theverge.com/2020/6/11/21212989/ps5-playstation-5-console-announcement-design-hardware-specs-sony", "via": "", "real_tags": ["ps5"]}, {"category": "", "categoryclass": "", "imagename": "4fc5d4e170dbb00b2ad759751c8a3e62.png", "infoid": 1006209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "收购将使GitLab成为第一个同时提供覆盖引导和行为模糊测试的安全解决方案。\n加利福尼亚州旧金山-2020年6月11日-DevOps生命周期的单一应用程序GitLab今天宣布，它已经收购了Peach Tech和Fuzzit，前者是一家专门从事协议模糊测试和动态应用安全测试(DAST)API测试的安全软件公司，后者是一款提供覆盖引导测试的连续模糊测试解决方案。这些收购将增加完全成熟的测试解决方案，包括协议模糊、API模糊、Dast API测试和覆盖引导模糊测试。这使得GitLab的DevSecOps提供了第一个同时提供覆盖引导和行为模糊测试技术的安全解决方案，以及第一个真正的DevSecOps平台，将模糊测试转移到了GitLab CI/CD环境中。\nGitLab首席执行官Sid Sijbrand dij说：“我们相信GitLab在单一平台上为整个DevOps生命周期提供了同类最佳的工具。将Peach Tech和Fuzzit的模糊技术引入GitLab的安全解决方案中，将为我们的用户提供更强大、更全面的应用安全测试体验，同时使他们能够将安全转移到左边。这同时简化了他们的工作流程，并在开发、安全和运营团队之间建立了协作。“。\n在开放源码软件(OSS)继续呈指数级增长，组织推动零信任模式的时代，随着潜在威胁和漏洞将可用的攻击面扩展到即使是最大的企业也没有时间和资源来有效评估其安全态势的程度，企业安全担忧也在增长。模糊测试(有时称为模糊测试)是向程序提供错误输入以查找可能被利用的错误、崩溃和故障的过程。成功的应用程序安全测试自动化与“左移”DevSecOps方法相结合，使开发和安全团队能够及早、频繁地进行测试，并在管理和降低组织的总体安全风险方面进行协作。将覆盖引导和行为模糊测试添加到DevSecOps工具链可帮助组织查找漏洞和弱点，传统的应用程序安全测试和质量保证(QA)测试技术经常遗漏这些发现，因为这些发现可能与已知漏洞(例如CVE ID)没有直接关联。\n一旦Peach Tech和Fuzzit技术完全集成，GitLab安全客户将不再需要依赖独立的Fuzz测试解决方案来满足其应用程序安全测试需求。取而代之的是，他们将拥有一个完全集成的安全解决方案，从安全测试的自动DevOps部署到漏洞管理和补救。此外，这些收购将使GitLab通过扩展Peach Tech的Dast API安全引擎和Fuzzit的崩溃关联技术，加快交互式应用程序安全测试(IAST)的路线图。\n“为GitLab的用户提供最好的安全测试工具是GitLab的DevSecOps核心任务的关键，”桃子科技创始人兼首席执行官迈克尔·埃丁顿(Michael Eddington)说。Peach Tech技术的集成扩展了GitLab的安全左移功能，使安全和DevSecOps的未来成为今天所有GitLab用户的现实。\nFuzzit创始人兼首席执行官叶夫根尼·帕茨说：“完全集成Fuzzit将使GitLab成为第一个在CI/CD流水线内本地提供连续覆盖引导模糊测试的安全解决方案。Fuzzit对多个覆盖引导的Fuzzer的支持与其碰撞分析和关联技术相结合，将为GitLab用户的DevSecOps增加一项重要功能。“。\n随着Peach Tech和Fuzzit技术被整合到GitLab的DevSecOps平台中，GitLab将进一步加快其应用程序安全测试路线图，为开发人员带来发现、修复和补救安全漏洞和弱点的本地无缝体验。\nGitLab为您的应用程序提供准确、自动和持续的评估，使用户能够主动识别漏洞和弱点，将安全风险降至最低。GitLab的安全阶段被编织到DevOps周期中，以允许用户调整安全测试和流程，而不是作为额外的步骤或工具。\n请访问GitLab网站并观看视频概述，了解有关GitLab安全策略和方向的更多信息，以及了解GitLab如何使您的组织采用DevSecOps最佳实践的更多信息。在2020年Gartner应用安全测试魔力象限报告(AST)中，GitLab被定位为利基参与者。\nGitLab的公开手册包括一个收购部分，其中概述了公司在公司发展方面采取的透明方法，从分享目标公司简介到列出它向团队提供的财务激励。\nGitLab是一个从头开始构建的DevOps平台，作为单个应用程序，用于DevOps生命周期的所有阶段，使产品、开发、QA、安全和运营团队能够同时处理同一项目。GitLab在DevOps生命周期中提供单个数据存储、一个用户界面和一个权限模型。这使得团队可以通过更高效的协作和更集中的精力来显著缩短周期时间。GitLab建立在开放源码的基础上，利用数千名开发人员和数百万用户的社区贡献，不断提供新的DevOps创新。从初创企业到全球企业，包括Ticketmaster、捷豹路虎、纳斯达克、Dish Network和康卡斯特在内的100,000多家组织相信GitLab能够更快地交付优秀的软件。GitLab是世界上最大的全远程公司，在超过65个国家和地区拥有超过1250名团队成员。\nGit是软件自由保护协会的商标，我们对GitLab的使用正在获得许可", "note_en": "Acquisitions will make GitLab the first security solution to offer both coverage-guided and behavioral fuzz testing\n SAN FRANCISCO, CALIFORNIA — June 11, 2020 - Today  GitLab, the single application for the DevOps lifecycle, announced it has acquired Peach Tech, a security software firm specializing in protocol fuzz testing and dynamic application security testing (DAST) API testing, and Fuzzit, a continuous fuzz testing solution providing coverage-guided testing. These acquisitions will add fully-mature testing solutions including protocol fuzzing, API fuzzing, DAST API testing, and coverage-guided fuzz testing. This makes GitLab’s DevSecOps offering the first security solution to offer both coverage-guided and behavioral fuzz testing techniques as well as the first true DevSecOps platform to shift fuzz testing left with these new offerings being made available within the GitLab CI/CD environment.\n “We believe GitLab provides best-in-class tools for the complete DevOps lifecycle on a single platform,” said Sid Sijbrandij, CEO of GitLab. “Bringing the fuzzing technologies of Peach Tech and Fuzzit into GitLab’s security solutions will give our users an even more robust and thorough application security testing experience while enabling them to shift security left. This simultaneously simplifies their workflows and creates collaboration between development, security, and operations teams.”\n In an era where open source software (OSS) continues to exponentially gain momentum and organizations push towards a zero-trust model, enterprise security concerns grow as potential threats and vulnerabilities extend the available attack surface to a point where even the largest businesses do not have the time nor resources to effectively assess their security posture.  Fuzz Testing, sometimes referred to as fuzzing, is the process of providing bad inputs to a program to find bugs, crashes, and faults that could be exploited. Successful automation of application security testing combined with a “shift left” DevSecOps approach empowers development and security teams to test early and often, as well as collaborate in managing and lowering the organization’s overall security risk. The addition of both coverage-guided and behavioral fuzz testing into the DevSecOps toolchain helps organizations find vulnerabilities and weaknesses traditional application security testing and quality assurance (QA) testing techniques often miss as these findings may not be directly tied to a known vulnerability (e.g. CVE IDs).\n Once Peach Tech and Fuzzit technologies are fully-integrated, GitLab Secure customers will no longer need to depend on standalone fuzz testing solutions to meet their application security testing needs. Instead, they will have a fully-integrated security solution, from  Auto DevOps deployment of security testing to vulnerability management and remediation. Furthermore, these acquisitions will allow GitLab to accelerate its roadmap for interactive application security testing (IAST) by extending Peach Tech’s DAST API security engine and Fuzzit’s crash correlation technology.\n “Providing GitLab users with the best security testing tools is key to GitLab&#39;s DevSecOps core mission,&#34; said Michael Eddington, Peach Tech founder and CEO. &#34;The integration of Peach Tech’s technologies expands GitLab&#39;s shift security left capabilities making the future of security and DevSecOps a reality today for all GitLab users.&#34;\n “Fully integrating Fuzzit will make GitLab the first security solution that provides continuous coverage-guided fuzz testing natively within the CI/CD pipeline,&#34; said Yevgeny Pats, Fuzzit founder and CEO. &#34;Fuzzit&#39;s support for multiple coverage-guided fuzzers combined with its crash analysis and correlation technology will add an important capability to the DevSecOps for GitLab users.”\n With the Peach Tech and Fuzzit technologies being incorporated into GitLab’s DevSecOps platform, GitLab will further accelerate its application security testing roadmap to bring developers a native and seamless experience for discovering, fixing, and remediating security vulnerabilities and weaknesses.\n GitLab provides accurate, automated, and continuous assessment of your applications, which enables users to proactively identify vulnerabilities and weaknesses to minimize security risk. GitLab’s Secure stage is woven into the DevOps cycle to allow users to adapt security testing and processes, not as an additional step nor tool.\n Please visit the  GitLab website and watch the  video overview for more information regarding GitLab’s security strategy and direction as well as to learn more about how GitLab enables your organization to adopt  DevSecOps best practices. GitLab was positioned as a Niche Player in the  2020 Gartner Magic Quadrant report for Application Security Testing (AST).\n GitLab’s public handbook includes an  acquisition section which outlines the transparent approach the Company takes on Corporate Development, from sharing a target company profile through to listing the financial incentives it offers to teams.\n  GitLab is a DevOps platform built from the ground up as a single application for all stages of the DevOps lifecycle enabling Product, Development, QA, Security, and Operations teams to work concurrently on the same project. GitLab provides a single data store, one user interface, and one permission model across the DevOps lifecycle. This allows teams to significantly reduce cycle time through more efficient collaboration and enhanced focus. Built on Open Source, GitLab leverages the community contributions of thousands of developers and millions of users to continuously deliver new DevOps innovations. More than 100,000 organizations from startups to global enterprises, including Ticketmaster, Jaguar Land Rover, NASDAQ, Dish Network, and Comcast trust GitLab to deliver great software faster. GitLab is the world&#39;s largest all-remote company, with more than 1,250 team members in more than 65 countries and regions.\n  GIT is a trademark of Software Freedom Conservancy and our use of &#39;GitLab&#39; is under license", "posttime": "2020-06-12 06:00:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "收购,acquires,gitlab", "title": "GitLab收购Peach Tech和Fuzzit", "title_en": "GitLab acquires Peach Tech and Fuzzit", "transed": 1, "url": "https://about.gitlab.com/press/releases/2020-06-11-gitlab-acquires-peach-tech-and-fuzzit-to-expand-devsecops-offering.html", "via": "", "real_tags": ["收购", "acquires", "gitlab"]}, {"category": "", "categoryclass": "", "imagename": "1667035beeca3226eedc97aee5a06817.png", "infoid": 1006208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MDN网络文件学习区(LA)于2015年首次启动，目的是提供与常规MDN参考和指南材料相对应的有用内容。MDN传统上是针对网络专业人士的，但我们经常得到反馈，我们的很多观众发现MDN太难理解了，而且它缺乏对基本主题的覆盖。\n快进5年后，学习领域的材料广受欢迎。它号称每月约有350万至400万的页面浏览量；略低于MDN Web Docs月网页流量的10%。\n在这一点上，学习领域做得很好。很多人用它来研究客户端的web技术，它的松散结构、不固执己见、模块化的性质使得你可以很容易地按照自己的节奏挑选主题。老师们喜欢它，因为它很容易包含在他们自己的课程中。\n然而，在年初，这方面有两个我们想要改进的缺点：\n我们得到了很大的反馈，我们的用户想要一种更固执己见、更有条理的方法来学习Web开发。\n我们没有包括任何关于客户端工具的信息，比如Web开发人员工作场所广泛使用的JavaScript框架、转换工具和部署工具。\n看看上面链接的前端开发人员途径-你会发现它为学习前端web开发提供了一个清晰的结构。如果你想成为一名前端开发人员，这是我们对你应该如何入门的看法。例如，在进入框架和其他类似工具之前，您应该真正学习普通的HTML、CSS和JavaScript。可访问性应该放在您所做的所有事情的最前面和中心位置。(所有学习区域部分都尽量遵循辅助功能最佳实践)。\n虽然包含的内容并不是完全详尽的，但它提供了您需要的基本信息，以及您自己查找其他信息的信心。\n这条道路从清楚地说明所教授的科目、必备知识和从哪里获得帮助开始。之后，我们将提供一些关于如何设置最小编码环境的有用背景读物。这将允许您完成您将遇到的所有示例。我们解释什么是Web标准，Web技术如何协同工作，以及如何有效地学习和获得帮助。\n在整个过程中，我们的目标是提供明确的方向-您现在在哪里，您下一步要学习什么，以及为什么。我们提供足够的评估来为您提供挑战，并确认您已准备好进入下一节。\nMDN的目标是记录原生Web技术-浏览器支持的技术。我们不倾向于记录构建在本机Web技术之上的工具，因为：\n该工具的创建者倾向于制作他们自己的文档资源，因此重复这样的内容将是浪费精力，并且会让社区感到困惑。\n库和框架往往比原生Web技术更改得更频繁。使文档保持最新需要大量的工作。唉，我们没有带宽来执行定期的大规模测试和更新。\nMDN被视为中立的文档提供商。许多人认为记录工具是对中立性的背离，特别是对于Facebook或Google等主要参与者创建的工具而言。\n因此，我们希望记录这样的工具，这让一些人感到惊讶。那我们为什么要这么做呢？嗯，这里的词是实用主义。我们希望提供人们在网络上建立网站和应用程序所需的信息。客户端框架和其他工具无疑是其中的一部分。忽略整个生态系统的这一部分看起来很愚蠢。因此，我们选择提供工具“基本要素”的子集-足够的信息来理解工具，并在基本级别上使用它们。我们的目标是让您有信心自己查找更先进的信息。\n在工具和测试学习区域主题中，我们提供了以下新模块：\n了解客户端Web开发工具：介绍可用的不同类型的客户端工具，以及如何使用命令行安装和使用工具。本节提供包管理器速成课程。它包括如何设置和使用典型工具链的演练，从增强代码编写体验到部署应用程序。\n理解客户端JavaScript框架：这是客户端框架的有用基础，我们的目标是回答诸如“为什么使用框架？”、“它们解决了什么问题？”以及“它们与普通JavaScript有什么关系？”之类的问题。我们在一些最流行的框架中为读者提供了一个基本的教程系列。在撰写本文时，这包括Reaction、Ember和Vue。\nGit和GitHub：使用指向Github指南的链接，我们汇编了一份Git和GitHub基础知识的速成指南，打算在以后编写我们自己的指南集。\n其意图不仅仅是止步于此，并宣称美联储的学习之路已经结束。我们总是对改进我们的材料感兴趣，以使其保持最新，并使其对有抱负的开发人员尽可能有用。如果这是我们的观众想要的，我们有兴趣扩大我们的报道范围。例如，我们的框架教程从一开始就相当通用，允许我们将它们用作试验台，同时为读者提供一些直接的价值。\n出于上述原因，我们不想只复制工具供应商提供的材料。相反，我们想要倾听，找出学习前端web开发的最大痛点是什么。我们想看看你们在哪些方面需要更多的报道，并扩大我们的材料以适应需要。我们希望介绍更多客户端JavaScript框架(我们已经有了一个Svelte教程)，更深入地介绍了其他工具类型(如转换工具、测试框架和静态站点生成器)，以及其他内容。\n为了使我们能够做出更明智的选择，我们将非常感谢您的帮助。如果您对我们应该在MDN Web Docs上介绍的工具或Web技术有一个很好的想法，或者您认为一些现有的学习材料需要改进，请告诉我们详细信息！要做到这一点，最好的方法是：\n这就把我们带到了尽头。感谢您的阅读，以及您选择分享的任何反馈。\n我们将利用它来帮助改进我们的教育资源，帮助下一代网络开发人员学习创建更好的未来网络所需的技能。", "note_en": "The  MDN Web Docs Learning Area (LA) was first launched in 2015, with the aim of providing a useful counterpart to the regular MDN reference and guide material. MDN had traditionally been aimed at web professionals, but we were getting regular feedback that a lot of our audience found MDN too difficult to understand, and that it lacked coverage of basic topics.\n Fast forward 5 years, and the Learning Area material is well-received. It boasts around 3.5–4 million page views per month; a little under 10% of MDN Web Docs’ monthly web traffic.\n At this point, the Learning Area does its job pretty well. A lot of people use it to study client-side web technologies, and its loosely-structured, unopinionated, modular nature makes it easy to pick and choose subjects at your own pace. Teachers like it because it is easy to include in their own courses.\n However, at the beginning of the year, this area had two shortcomings that we wanted to improve upon:\n We’d gotten significant feedback that our users wanted a more opinionated, structured approach to learning web development.\n We didn’t include any information on client-side tooling, such as JavaScript frameworks, transformation tools, and deployment tools widely used in the web developer’s workplace.\n   Take a look at the Front-end developer pathway linked above  — you’ll see that it provides a clear structure for learning front-end web development. This is our opinion on how you should get started if you want to become a front-end developer. For example, you should really learn vanilla HTML, CSS, and JavaScript before jumping into frameworks and other such tooling. Accessibility should be front and center in all you do. (All Learning Area sections try to follow accessibility best practices as much as possible).\n While the included content isn’t completely exhaustive, it delivers the essentials you need, along with the confidence to look up other information on your own.\n The pathway starts by clearly stating the subjects taught, prerequisite knowledge, and where to get help. After that, we provide some useful background reading on how to set up a minimal coding environment. This will allow you to work through all the examples you’ll encounter. We explain what web standards are and how web technologies work together, as well as how to learn and get help effectively.\n   Throughout the pathway we aim to provide clear direction — where you are now, what you are learning next, and why. We offer enough assessments to provide you with a challenge, and an acknowledgement that you are ready to go on to the next section.\n  MDN’s aim is to document native web technologies — those supported in browsers. We don’t tend to document tooling built on top of native web technologies because:\n The creators of that tooling tend to produce their own documentation resources.  To repeat such content would be a waste of effort, and confusing for the community.\n Libraries and frameworks tend to change much more often than native web technologies. Keeping the documentation up to date would require a lot of effort. Alas, we don’t have the bandwidth to perform regular large-scale testing and updates.\n MDN is seen as a neutral documentation provider. Documenting tooling is seen by many as a departure from neutrality, especially for tooling created by major players such as Facebook or Google.\n Therefore, it came as a surprise to some that we were looking to document such tooling. So why did we do it? Well, the word here is  pragmatism. We want to provide the information people need to build sites and apps on the web. Client-side frameworks and other tools are an unmistakable part of that. It would look foolish to leave out that entire part of the ecosystem. So we opted to provide coverage of a subset of tooling “essentials” — enough information to understand the tools, and use them at a basic level. We aim to provide the confidence to look up more advanced information on your own.\n  In the  Tools and testing Learning Area topic, we’ve provided the following new modules:\n Understanding client-side web development tools: An introduction to the different types of client-side tools that are available, how to use the command line to install and use tools. This section delivers a crash course in package managers. It includes a walkthrough of how to set up and use a typical toolchain, from enhancing your code writing experience to deploying your app.\n Understanding client-side JavaScript frameworks: A useful grounding in client-side frameworks, in which we aim to answer questions such as “why use a framework?”, “what problems do they solve?”, and “how do they relate to vanilla JavaScript?” We give the reader a basic tutorial series in some of the most popular frameworks. At the time of writing, this includes  React,  Ember, and  Vue.\n Git and GitHub: Using links to Github’s guides, we’ve assembled a quickfire guide to Git and GitHub basics, with the intention of writing our own set of guides sometime later on.\n  The intention is not just to stop here and call the FED learning pathway done. We are always interested in improving our material to keep it up to date and make it as useful as possible to aspiring developers. And we are interested in expanding our coverage, if that is what our audience wants. For example, our frameworks tutorials are fairly generic to begin with, to allow us to use them as a test bed, while providing some immediate value to readers.\n  We don’t want to just copy the material provided by tooling vendors, for reasons given above. Instead we want to listen, to find out what the biggest pain points are in learning front-end web development. We’d like to see where you need more coverage, and expand our material to suit. We would like to cover more client-side JavaScript frameworks (we have already got a Svelte tutorial on the way), provide deeper coverage of other tool types (such as transformation tools, testing frameworks, and static site generators), and other things besides.\n  To enable us to make more intelligent choices, we would love your help. If you’ve got a strong idea abou tools or web technologies we should cover on MDN Web Docs, or you think some existing learning material needs improvement, please let us know the details! The best ways to do this are:\n  So that draws us to a close. Thank you for reading, and for any feedback you choose to share.\n We will use it to help improve our education resources, helping the next generation of web devs learn the skills they need to create a better web of tomorrow.", "posttime": "2020-06-12 05:59:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,web,工具", "title": "MDN Web Docs前端开发人员学习途径", "title_en": "The MDN Web Docs Front-end developer learning pathway", "transed": 1, "url": "https://hacks.mozilla.org/2020/06/introducing-the-mdn-web-docs-front-end-developer-learning-pathway/", "via": "", "real_tags": ["开发", "web", "工具"]}, {"category": "", "categoryclass": "", "imagename": "46235a682e178500d11e2b225e3c7a81.jpg", "infoid": 1006205, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HCA Healthcare是世界上最富有的连锁医院之一。在过去的两年里，它的利润超过了70亿美元。它价值360亿美元。2019年，该公司向首席执行官支付了2600万美元。\n但随着冠状病毒席卷全国，HCA的员工一再抱怨公司没有为护士、医疗技术人员和清洁人员提供足够的防护装备。上个月，HCA高管警告称，如果他们不同意冻结工资和其他让步，他们将解雇数千名护士。\n几周前，HCA从联邦政府获得了约10亿美元的救助资金，这是在大流行期间稳定医院的努力的一部分。\nHCA是一长串财力雄厚的医疗保健公司之一，这些公司接受了数十亿美元的纳税人资金，但正在裁员或削减数万名医生、护士和低薪工人的工资。许多公司继续向高管支付数百万美元的薪酬，尽管一些高管已经采取了适度的减薪。\n纽约时报分析了美国60家最大连锁医院的税务和证券申报文件，这些连锁医院通过联邦CARE法案中的经济刺激计划总共获得了超过150亿美元的紧急资金。\n这些医院-包括HCA和Tenet Healthcare等上市巨头，梅奥诊所(Mayo Clinic)等精英非营利组织，以及拥有数千张床位和数十亿现金的地区性连锁店-总共坐拥数百亿美元的现金储备，本应帮助它们度过一场意想不到的风暴。在他们披露财务状况的最近一年里，他们总共向每个连锁店的五名薪酬最高的官员奖励了约8.74亿美元。\n在这些连锁医院中，至少有36家已经裁员、休假或降低了员工的工资，因为他们在大流行期间试图省钱。\n行业官员辩称，休假和减薪允许医院在大流行耗尽收入的情况下继续提供基本服务。\n但这些富裕医院的十几名员工在接受采访时表示，他们的雇主给一线员工带来了最沉重的经济负担，包括低薪的餐厅工作人员、看门人和护理助理。他们说，减薪和休假使得医务人员更难做好自己的工作，迫使他们在更短的时间内治疗更多的患者。\n甚至在冠状病毒席卷美国，迫使医院停止提供有利可图的非必要手术和其他服务之前，许多规模较小的医院就处于财务边缘。今年3月，立法者试图通过一项庞大的联邦经济刺激计划来解决这一问题，其中包括卫生与公众服务部(Department Of Health And Human Services)向医院发放拨款1750亿美元。", "note_en": "HCA Healthcare is one of the world’s wealthiest hospital chains. It earned more than $7 billion in profits over the past two years. It is worth $36 billion. It paid its chief executive $26 million in 2019.\n But as the coronavirus swept the country, employees at HCA repeatedly complained that the company was not providing adequate protective gear to nurses, medical technicians and cleaning staff. Last month, HCA executives warned that they would lay off thousands of nurses if they didn’t agree to wage freezes and other concessions.\n A few weeks earlier, HCA had received about $1 billion in bailout funds from the federal government, part of an effort to stabilize hospitals during the pandemic.\n HCA is among a long list of deep-pocketed health care companies that have received billions of dollars in taxpayer funds but are laying off or cutting the pay of tens of thousands of doctors, nurses and lower-paid workers. Many have continued to pay their top executives millions, although some executives have taken modest pay cuts.\n The New York Times analyzed tax and securities filings by 60 of the country’s largest hospital chains, which have received a total of more than $15 billion in emergency funds through the economic stimulus package in the federal CARES Act.\n The hospitals — including publicly traded juggernauts like HCA and Tenet Healthcare, elite nonprofits like the Mayo Clinic, and regional chains with thousands of beds and billions in cash — are collectively  sitting on tens of billions of dollars of cash reserves that are supposed to help them weather an unanticipated storm. And together, they awarded the five highest-paid officials at each chain about $874 million in the most recent year for which they have disclosed their finances.\n At least 36 of those hospital chains have laid off, furloughed or reduced the pay of employees as they try to save money during the pandemic.\n Industry officials argue that furloughs and pay reductions allow hospitals to keep providing essential services at a time when the pandemic has gutted their revenue.\n But more than a dozen workers at the wealthy hospitals said in interviews that their employers had put the heaviest financial burdens on front-line staff, including  low-paid cafeteria workers, janitors and nursing assistants. They said pay cuts and furloughs made it even harder for members of the medical staff to do their jobs, forcing them to treat more patients in less time.\n Even before the coronavirus swept America, forcing hospitals to stop providing lucrative nonessential surgery and other services, many smaller hospitals were on the financial brink. In March, lawmakers sought to address that with a vast federal economic stimulus package that included $175 billion for the Department of Health and Human Services to hand out in grants to hospitals.", "posttime": "2020-06-12 05:28:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "得到,bailouts,医院", "title": "医院得到了救助，数千人被迫休假，同时向首席执行官支付了数百万美元", "title_en": "Hospitals Got Bailouts and Furloughed Thousands While Paying C.E.O.s Millions", "transed": 1, "url": "https://www.nytimes.com/2020/06/08/business/hospitals-bailouts-ceo-pay.html", "via": "", "real_tags": ["得到", "bailouts", "医院"]}, {"category": "", "categoryclass": "", "imagename": "065dcf5a87c8b29475e3b45b4a395723.png", "infoid": 1006204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们正在发布一个API，用于访问OpenAI开发的新AI模型。与大多数为一种用例设计的人工智能系统不同，API今天提供了一个通用的“文本输入，文本输出”界面，允许用户在几乎任何英语任务上尝试它。您现在可以申请访问权限，以便将API集成到您的产品中，开发全新的应用程序，或者帮助我们了解这项技术的优势和局限性。\n给定任何文本提示，API将返回文本完成，尝试匹配您给出的模式。你只需向它展示几个你希望它做什么的例子，就可以对它进行编程；它的成功程度通常取决于任务的复杂程度。API还允许您通过对您提供的示例的数据集(无论大小)进行培训，或者从用户或标签员提供的人工反馈中学习，来磨练特定任务的性能。\n我们设计的API既简单易用，又足够灵活，使机器学习团队的工作效率更高。事实上，我们的许多团队现在都在使用API，这样他们就可以专注于机器学习研究，而不是分布式系统问题。如今，API使用GPT-3系列中的权重运行模型，速度和吞吐量都有许多改进。机器学习的发展非常迅速，我们正在不断升级我们的技术，以便我们的用户保持最新。\n这一领域的进展速度意味着人工智能经常出现令人惊讶的新应用，既有积极的，也有消极的。我们将针对明显有害的使用案例终止API访问，例如骚扰、垃圾邮件、激进化或占星术。但我们也知道，我们无法预测这项技术可能带来的所有后果，所以我们今天将以私人测试版而不是普遍提供的形式推出，构建工具来帮助用户更好地控制我们的API返回的内容，并研究语言技术的安全相关方面(如分析、减轻和干预有害偏见)。我们将分享我们所学到的知识，以便我们的用户和更广泛的社区能够构建更多具有人类积极性的人工智能系统。\n除了作为帮助我们支付追求使命成本的收入来源外，API还推动我们更加关注通用人工智能技术-推进技术，使其可用，并考虑其在现实世界中的影响。我们希望API将大大降低生产有益的AI驱动产品的门槛，从而产生今天很难想象的工具和服务。\n对探索API感兴趣吗？加入Algolia、Quizlet和Reddit等公司以及米德尔伯里研究所(Midlebury Institute)等机构的研究人员参与我们的私人测试版。\n归根结底，我们最关心的是确保人工通用智能造福每个人。我们认为开发商业产品是确保我们有足够资金取得成功的方法之一。\n我们还认为，在世界上安全部署强大的人工智能系统将很难做到正确。在发布API时，我们正在与我们的合作伙伴密切合作，看看人工智能系统在现实世界中使用时会出现什么挑战。这将有助于指导我们的努力，以了解部署未来的人工智能系统将如何进行，以及我们需要做些什么来确保它们对每个人都是安全和有益的。\n我们这样做的主要原因有三个。首先，将技术商业化有助于我们为正在进行的人工智能研究、安全和政策努力买单。\n其次，API底层的许多模型都非常大，需要大量的专业知识来开发和部署，这使得它们的运行成本非常高。这使得除了较大的公司之外，任何人都很难从底层技术中受益。我们希望API将使功能强大的AI系统更容易为较小的企业和组织所访问。\n第三，API模型使我们能够更容易地应对技术的滥用。由于我们的模型的下游用例很难预测，因此通过API发布它们并随着时间的推移扩大访问比发布开放源码模型更安全，因为在开源模型中，如果发现有有害的应用程序，访问将无法调整。\n鉴于您之前所说的关于GPT-2的内容，OpenAI将具体对API的滥用做些什么？\n我们将终止API的使用访问-对人们造成身体或精神伤害的情况，包括但不限于骚扰、故意欺骗、激进化、占星术或垃圾邮件；随着我们在实践中获得更多操作API的经验，我们预计将扩大和完善这些类别。\n我们还在对API提供的模型的潜在滥用进行研究，包括通过我们的学术访问计划与第三方研究人员合作。\n到目前为止，我们一直在与我们单独审查的用户进行私人测试版，这进一步降低了误用的可能性，同时我们更好地理解了API的含义和局限性。\nOpenAI将如何减轻API提供的模型的有害偏见和其他负面影响？\n减轻有害偏见等负面影响是一个极其重要的全行业难题。最终，我们的API模型确实显示出偏差(如GPT-3论文中所示)，这些偏差有时会出现在生成的文本中。我们的API模型还可能以我们还没有想到的方式造成危害。以下是我们为解决这些问题而采取的步骤：\n我们正在与用户一起制定使用指南，以帮助他们相互学习，并在实践中缓解这些问题。\n我们正在与用户密切合作，深入了解他们的使用案例，并开发工具来标记和干预有害偏见的表现。\n我们正在对有害的偏见和更广泛的公平和代表性问题进行研究，这将有助于为我们与用户的工作提供信息。\n随着时间的推移，我们的目标是彻底了解API的潜在危害，并不断改进我们的工具和流程，以帮助将其降至最低。\n我们将努力分享我们所学到的知识，这样别人才能受益。我们也希望看到其他AI开发人员也这样做，因为偏见是AI开发中的集体行动问题。", "note_en": "We’re releasing an API for accessing new AI models developed by OpenAI. Unlike most AI systems which are designed for one use-case, the API today provides a general-purpose “text in, text out” interface, allowing users to try it on virtually any English language task. You can now  request access in order to integrate the API into your product, develop an entirely new application, or help us explore the strengths and limits of this technology.\n   Given any text prompt, the API will return a text completion, attempting to match the pattern you gave it. You can &#34;program&#34; it by showing it just a few examples of what you&#39;d like it to do; its success generally varies depending on how complex the task is. The API also allows you to hone performance on specific tasks by training on a dataset (small or large) of examples you provide, or by learning from human feedback provided by users or labelers.\n We&#39;ve designed the API to be both simple for anyone to use but also flexible enough to make machine learning teams more productive. In fact, many of our teams are now using the API so that they can focus on machine learning research rather than distributed systems problems. Today the API runs models with weights from the  GPT-3 family with many speed and throughput improvements. Machine learning is moving very fast, and we&#39;re constantly upgrading our technology so that our users stay up to date.\n  The field&#39;s pace of progress means that there are frequently surprising new applications of AI, both positive and negative. We will terminate API access for obviously harmful use-cases, such as harassment, spam, radicalization, or astroturfing. But we also know we can&#39;t anticipate all of the possible consequences of this technology, so we are launching today in a private beta rather than general availability, building tools to help users better control the content our API returns, and researching safety-relevant aspects of language technology (such as analyzing, mitigating, and intervening on harmful bias). We&#39;ll share what we learn so that our users and the broader community can build more human-positive AI systems.\n In addition to being a revenue source to help us  cover costs in pursuit of  our mission, the API has pushed us to sharpen our focus on general-purpose AI technology — advancing the technology, making it usable, and considering its impacts in the real world. We hope that the API will greatly lower the  barrier to producing beneficial AI-powered products, resulting in tools and services that are hard to imagine today.\n Interested in exploring the API? Join companies like  Algolia,  Quizlet, and  Reddit, and researchers at institutions like the  Middlebury Institute in our  private beta.\n   Ultimately, what we  care about most is ensuring artificial general intelligence benefits everyone. We see developing commercial products as one of the ways to make sure we have enough funding to succeed.\n We also believe that safely deploying powerful AI systems in the world will be hard to get right. In releasing the API, we are working closely with our partners to see what challenges arise when AI systems are used in the real world. This will help guide our efforts to understand how deploying future AI systems will go, and what we need to do to make sure they are safe and beneficial for everyone.\n  There are three main reasons we did this. First, commercializing the technology helps us pay for our ongoing AI research, safety, and policy efforts.\n Second, many of the models underlying the API are very large, taking a lot of expertise to develop and deploy and making them very expensive to run. This makes it hard for anyone except larger companies to benefit from the underlying technology. We’re hopeful that the API will make powerful AI systems more accessible to smaller businesses and organizations.\n Third, the API model allows us to more easily respond to misuse of the technology. Since it is hard to predict the downstream use cases of our models, it feels inherently safer to release them via an API and broaden access over time, rather than release an open source model where access cannot be adjusted if it turns out to have harmful applications.\n What specifically will OpenAI do about misuse of the API, given what you’ve previously said about GPT-2?\n We will terminate API access for use-cases that cause physical or mental harm to people, including but not limited to harassment, intentional deception, radicalization, astroturfing, or spam; as we gain more experience operating the API in practice we expect to expand and refine these categories.\n We are also conducting research into the potential misuses of models served by the API, including with third-party researchers via our  academic access program.\n So far, we have been conducting the private beta with users who we’ve individually vetted, which further reduces the odds of misuse while we get a better understanding of the implications and limitations of the API.\n How will OpenAI mitigate harmful bias and other negative effects of models served by the API?\n Mitigating negative effects such as harmful bias is a hard, industry-wide issue that is extremely important. Ultimately, our API models do exhibit biases (as shown in the  GPT-3 paper) that will appear on occasion in generated text. Our API models could also cause harm in ways that we haven’t thought of yet. Here are the steps we’re taking to address these issues:\n We&#39;re developing usage guidelines with users to help them learn from each other and mitigate these problems in practice.\n We are working closely with users to deeply understand their use cases and develop tools to label and intervene on manifestations of harmful bias.\n We’re conducting our own research into harmful bias and broader issues in fairness and representation, which will help inform our work with our users.\n Our goal over time is to develop a thorough understanding of the API’s potential harms, and continually improve our tools and processes to help minimize them.\n We&#39;ll seek to share what we learn, so that others can benefit. We also hope to see other AI developers do the same, as bias is a  collective action problem in AI development.", "posttime": "2020-06-12 05:27:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "openai,api", "title": "OpenAI API", "title_en": "OpenAI API", "transed": 1, "url": "https://openai.com/blog/openai-api/", "via": "", "real_tags": ["openai", "api"]}, {"category": "", "categoryclass": "", "imagename": "1944b26d5086f6a7febde021536a3899.jpg", "infoid": 1006203, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州圣克拉拉，2020年6月11日-今天，英特尔宣布吉姆·凯勒因个人原因辞职，从2020年6月11日起生效。英特尔感谢凯勒先生在过去两年中帮助他们继续推进英特尔产品领导力的工作，并祝愿他和他的家人未来一切顺利。不过，英特尔高兴地宣布，凯勒先生已同意担任顾问六个月，以协助过渡。\n英特尔在其技术、系统架构和客户集团(TSCG)内部拥有一支经验丰富的技术领导团队，由TSCG集团总裁兼首席工程官文卡塔(Murthy)博士和Renduchintala博士领导。作为这一过渡的一部分，将进行以下领导层变动，立即生效：\nNetSpeed系统公司前首席执行官兼创始人、英特尔可配置知识产权和机箱集团现任领导人桑达里·米特拉(Sundari Mitra)将领导一个新成立的IP工程集团，专注于开发一流的IP。\n吉恩·斯库特里(Gene Scuteri)是半导体行业一位卓有成效的工程领导者，他将领导至强和网络工程部。\nDaaman Hejmadi将重新领导客户工程组，专注于片上系统(SoC)执行和设计下一代客户端、设备和芯片组产品。Hejmadi拥有二十多年的经验，领导团队在英特尔内外提供先进的SoC。\n英特尔经验丰富的领导者Navid Shahriari将继续领导制造和产品工程小组，该小组专注于提供全面的投产前测试套件和组件调试能力，以实现高质量、大批量的制造。\n英特尔祝贺Sundari、Gene、Daaman和Navid开始我们世界级工程组织的下一阶段，并期待着执行我们令人兴奋的产品路线图。", "note_en": "SANTA CLARA, Calif., June 11, 2020 – Today, Intel announced that Jim Keller has resigned effective June 11, 2020, due to personal reasons. Intel appreciates Mr. Keller’s work over the past two years helping them continue advancing Intel’s product leadership and they wish him and his family all the best for the future. Intel is pleased to announce, however, that Mr. Keller has agreed to serve as a consultant for six months to assist with the transition.\n Intel has a vastly experienced team of technical leaders within its Technology, Systems Architecture and Client Group (TSCG) under the leadership of Dr. Venkata (Murthy) Renduchintala, group president of TSCG and chief engineering officer. As part of this transition, the following leadership changes will be made, effective immediately:\n Sundari Mitra, the former CEO and founder of NetSpeed Systems and the current leader of Intel’s Configurable Intellectual Property and Chassis Group, will lead a newly created IP Engineering Group focused on developing best-in-class IP.\n Gene Scuteri, an accomplished engineering leader in the semiconductor industry, will head the Xeon and Networking Engineering Group.\n Daaman Hejmadi will return to leading the Client Engineering Group focused on system-on-chip (SoC) execution and designing next-generation client, device and chipset products. Hejmadi has over two decades of experience leading teams delivering advanced SoCs both inside and outside of Intel.\n Navid Shahriari, an experienced Intel leader, will continue to lead the Manufacturing and Product Engineering Group, which is focused on delivering comprehensive pre-production test suites and component debug capabilities to enable high-quality, high-volume manufacturing.\n Intel congratulates Sundari, Gene, Daaman and Navid as we begin the next phase of our world-class engineering organization and look forward to executing on our exciting roadmap of products.", "posttime": "2020-06-12 05:11:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,离开,keller", "title": "吉姆·凯勒将离开英特尔", "title_en": "Jim Keller to Depart Intel", "transed": 1, "url": "https://newsroom.intel.com/news-releases/changes-intels-technology-systems-architecture-client-group/", "via": "", "real_tags": ["英特尔", "离开", "keller"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近在一篇关于用户界面变化的帖子中提到，Twitter最新的收益报告中包含了这样一个重磅炸弹：\n我们将修复破碎的窗口和令人困惑的部分，比如.@Name语法和@Reply规则，我们知道这些规则会抑制使用，并将人们赶走。\n这里有一个有趣的问题。UI是硬的。你不能只在屏幕上按下一个按钮，就可以在任何给定的时间使用每一个可以想象到的功能。有些功能只有所谓的“高级用户”才会感兴趣，所以它们只能靠口碑传播，有些微妙之处。一些您试图使其不可见和启发式的功能。添加一些功能只是为了解决一个有影响力的用户的问题。有些特征啊是很偶然的。\n因此，一个足够成熟、受欢迎和有趣的产品往往会积累一小堆隐藏的功能，有时没有文档记录，甚至没有得到官方承认。我想说这实际上是一件好事！使用一段时间的东西绝对应该经常用一个新的诀窍来奖励你-表面下的知识会让你感觉自己参与到了你正在使用的东西中，并让你总体上感觉更深。\n困难的部分是取得平衡。在这个范围的一端，你有记事本这样的工具，其中唯一的复活节彩蛋是按F5插入当前时间。在另一端有像vim这样的工具，它只由复活节彩蛋组成。\nTwitter的问题之一是，它有点太倾向于Vim的天平了。它看起来是一项非常简单的服务，但这些不起眼的140个字符多年来充斥着各种功能，它们的互动方式并不总是显而易见的。规则是有的，一旦你了解了，这些规则通常是有意义的，但也真的很容易忽视它们。\n下面是我所知道的关于Twitter的所有不明显的事情。可以把它看作是那些在Twitter上看不到眼球的人的参考，也是这些隐藏功能如何堆积起来的一个例子。我还提供了几个关于礼仪的笔记，因为我认为这与社交平台的形状有很大关系。\n推文限制为140个Unicode字符，这意味着即使是星际平面字符(如表情符号)也只能算作一个。\n推文中可能包含换行符，而且似乎没有多少行的限制。\n在tweet中间，会保留空格字符串(例如多个空格)。不过，连续两个以上的换行数将减少到只有两个。\n任何与链接稍有相似的内容都会被破坏成一些http://t.co/asdf链接缩短的垃圾。在某些情况下，例如在谈论域名时，这可能会使推文变得更长。你可以通过在最后一个点周围粘贴一个看不见的字符，比如U+200D零宽拼接器来克服这个问题，这样它看起来就不再像一个域名了。\n在官方客户端中，链接显示为未损坏，但没有协议，并且被截断为大约20个字符。例如，指向本文的链接显示为eev.ee/Blog/2016/02/2…。。然而，至少在网络Twitter上，复制粘贴保留了完整的链接，包括协议。\n请注意，Twitter的域名知识并不是详尽的-它会链接“google.com”，但不会链接“eev.ee”。\n出于基于SMS的根的考虑，Twitter支持通过在tweet中键入命令来执行几个命令。特别是，如果您以单词d或m或dm开始tweet，则第二个单词将被视为用户名，而tweet的其余部分将被DM发送给该用户。推特“dm me if you…”会代替DM如果你..。发送给用户@me。\n由多人管理的账户，如支持账户或政客账户，有时在tweet上签名时会后跟作者姓名的首字母^。这对推特来说没有特别的意义。\n您不能在您的显示名称或简历中使用星体平面字符(包括大多数表情符号)；它们将被无声地剥离。但是，您可以使用其他符号或Dingbats块中的任何内容，并且其中许多字符在Web Twitter上使用彩色字形呈现。在手机和其他移动客户端上，结果可能会有所不同。\n一条tweet可以“提到”其他用户，这只是意味着在tweet中的某个地方包含他们的@Handle。这将通知每个提到的用户这条推文。\n你可以回复tweet，这些tweet会把它们串在一起。一条推文只能有一个父代(或没有父代)，但可以有任意数量的回复。因此，Twitter上的一切都被安排到一些树中，树的根是一条没有回应任何东西的新推文，回复从那里分叉出来。\n以提及开头的推文(即第一个字符是@，后面紧跟现有用户名)将不会出现在您的Web Twitter个人资料中。它仍然会出现在“有回复”的页面上。它还会出现在你在Android Twitter上的个人资料中，Twitter不会将回复与不回复分开。\n“提及”只能是现有的用户名。如果“foo”不是用户名，那么@foo就不会被提及，提及的任何规则都不适用。\n一条以提及开头的推文不会出现在任何关注你的人的时间线上，除非他们也关注你提到的第一个人。也就是说，如果你在tweet上发@foo@bar heya，它只会出现在同时关注你和@foo的人的时间线上。\n如果您将其他字符放在第一个@之前，前面的规则将不再适用，您的推文将显示给所有追随者。所以.@foo@bar heya将对每个人都可见(并显示在您的Web个人资料中)。这就是所谓的“点回复”。圆点实际上并不特殊；它只是一个易于键入且不引人注目的字符。我喜欢使用→或\\。有些人更喜欢把提及的内容放在最后，产生heya@foo@bar。\n在推文中间加点回复并不是绝对必要的，但有时它对消除歧义很有用。如果你回复@foo，并想说一些关于@bar的事情，它会显示为“foo”bar非常棒，这有点难读。加一个点使@foo.@bar对推特而言没有任何作用，但可以清楚地表明，@bar是句子的主语，而不是被谈话的人。\n最后一个可见性问题：如果一条推文出现在你的时间表上，因为它以提到你关注的某人开始，那么它回复的推文也会出现，即使它本身不会出现。\n假设有三个用户：A、B和C。您关注B和C，但不关注A。用户A发了一条tweet，B回复它(@A酷！)。这两条推文都不会出现在你的时间线上-A不会出现，因为你不会关注A，B不会出现，因为它以提到你不关注的人开始。然后C回复B的推文，这条推文把提到B放在第一位(见下文)。B和C的推文现在都将出现在你的时间线上-C的出现是因为它以提到你确实关注的人开始，而B的出现是为了上下文。\n换句话说，即使一条推文最初没有出现在你的时间表上，它也可能会因为第三方的行为而稍后出现。\n回复必须在某个地方提到它回复的推文的作者。如果你回复一条推文并删除作者的@Handle，它将成为新的顶级推文，而不是回复。你可以在一些客户端上看到这一点，比如Android Twitter：有“回复(显示名称)”文本表示这是回复，如果删除@Handle，该文本就会消失。\n前面的规则有一个例外：如果您回复自己，则不必包含您自己的@Handle，即使客户默认包含@Handle。(如果你回复的是你自己的一条推文，而这条推文已经以一些提及开头，那么这些推文就会被预先填充，而不是你自己的@Handle。)。所以，如果你想说一些跨越多条推文的话，你可以继续回复自己，然后删除@Handle。(这有时被称为“推特风暴”。)。\n每当你就某件事发布多条推文时，这样做真的是个好主意。否则，后来偶然发现其中一条推文的人将不知道背景是什么，而且如果不在你的个人资料上滚动多长时间，就无法找到它。\n如果你回复了自己，但在开头留下了@账号，第一条推文会出现在你的个人资料中，但其他推文不会出现，因为它们是以提及开始的。另一方面，让整个推特风暴出现在你的个人资料上可能会让人有点困惑--个别的推文会以相反的顺序出现，因为推文不会出现在个人资料上。至少在网络推特上，跟帖会有一个“查看对话”链接，暗示他们正在回复。\n无论哪种方式，回复仍然会出现在你的追随者的时间线上。即使回复以你的@账号开始，它们仍然会以提到你的追随者都关注的某个人开始：谢谢你！\n有人告诉我，许多第三方客户端不支持在没有您的句柄的情况下回复您自己，API文档也没有提到这是一项功能。但我也被告知，只有第一方客户才会要求你在回复中提到某人才能联系起来，而第三方客户会很高兴地将任何事情与任何事情联系起来。(我记得当Web Twitter允许这样做的时候，所以我完全相信API现在仍然允许这样做。)。如果你不使用官方客户端，我想试一试，看看会发生什么。\n前面的规则也适用于给别人回复更长时间的情况。回复他们一次，然后用下一条推文回复你自己(并删除你自己的@Handle)。你最终会得到三条推文，全部串在一起。\n这一点甚至更重要，因为Twitter以某种随意的顺序显示对一条推文的回复，将“重要的”推文冒泡到顶部。如果你写了一个很长的回复，然后把它分成三条推文，都回复了同一条原始推文，那么对于任何阅读这条帖子的人来说，它们很可能会显示为一团乱七八糟的东西。如果你让每条推文都回复前一条推文，它们肯定会保持有序。\n回复推文也会预先填充推文中提到的任何人的@Handle。回复转发会额外填充转发者的@句柄。原始作者的@句柄总是出现在最前面。在某些情况下，删除其中的一些是礼貌的；您只需要原始作者的@句柄就可以回复。(在不断通知几个第三方的同时，积累了多次提及，然后只与一个人进行了长时间的对话，这种情况并不少见。或者，您可能想要删除转发公共帐户的锁定帐户的@句柄，以保护他们的隐私。)。\nPrefilling@Handles是在客户端完成的，因此一些客户端的行为略有不同。特别是，我见过一些人回复他们自己的回复给别人(为了把更长的想法串连起来)，并在第二个回复的开头以他们自己的@Handle结束！你可能不想这样，因为现在第二个回复一开始就提到了你所有的追随者都关注的人-你自己！-所以这两条推文都会出现在你的追随者的时间表上。\n在官方客户端(至少是Web和Android)，长时间的tweet会在你的时间线上折叠。只有第一条推文和最后两条推文可见。如果你对某件事有很多话要说，最好把重要的部分放在这三条推文中的一条，让你的追随者真正看到它们。这是将你的推文串在一起是礼貌的另一个原因-这可以让人们避免被你的推文风暴淹没他们的时间表。\n有时，在您的时间线上可以看到同一对话的多个“分支”。例如，如果A发了几条tweet，B和C都回复了，而您关注了这三条微博，那么您将分别看到B的回复和C的回复。客户对此处理得不是特别好，可能会变得有点杂乱无章，同一条根推文会出现多次。\n因为官方客户把一个帖子当作一个单独的单元来对待，所以你可以通过回复来有效地“撞上”你自己的tweet。你的回复是新的，所以它会出现在你的追随者的时间表上；但客户端也会将第一条推文作为上下文包括在帖子中，而不考虑它的年龄。\n当查看一条推文时，官方客户端可能不会按时间顺序显示回复。通常情况下，“最好”的回复会被推到最上面。“最佳”完全由推特决定，但似乎效果相当不错。\n如果你回复自己，你自己的回复通常会首先出现，但这是不能保证的。如果你想链接到别人的长tweet链，最安全的方法是链接到帖子中的最后一条tweet，因为只有一条明确的父母tweet可以追溯到开头。这也使读者不必通过第三方的可怕回复来挖掘。\n如果用@foo heya回复一条推文，并且@foo后来将他们的账号重命名为@quux，这条推文将保留其主题，即使它不再提到父母推文的作者。但是，您的回复现在将显示在您的个人资料中，因为它不是以现有用户的句柄开始的。请注意，这意味着对于非追随者来说，通过搜索对你旧名字的回复，可以相当容易地弄清楚你的账户重命名为什么。\n即使某些tweet被隐藏(要么是因为您阻止了某些参与者，要么是因为他们的帐户设置为私有)，帖子也会被保留。这些推文不会出现在你面前，但对它们的任何可见回复都会出现。\n如果一个帖子中间的一条推文被删除(或者作者的账号被删除)，该帖子就会在这一点上中断。在查看家长时，对删除的推文的回复将不可见，在查看已删除的回复时，家长也将不可见。\n您可以通过在推文中包含指向推文的链接来引用推文，这会使被引用的推文出现在您下面的一个小方框中。这就是当你添加评论时，转发按钮的作用：它会像往常一样发推文，但第一条推文的URL会添加到后端。\n这不会创建回复，也不会成为引用的推文的一部分。如果您想这样做，您不能使用转发/引用按钮。你必须回复这条推文，手动添加一个指向它的链接，并确保提到作者。\n当您引用一条tweet时，作者会收到通知；但是，与转发不同，当人们喜欢或转发您的引用时，他们不会收到通知(除非您也提到了他们)。如果你不想通知作者，你可以截屏(尽管这不能让他们删除tweet)或使用URL缩短器(尽管这不能让他们通过屏蔽你来明显地禁用引用)。\n点赞或转发别人的推文通常会通知转发者。回复转发将预先填充转发者和原作者的@句柄。然而，如果你在网络推特上点击这条推文，转发者就会“被遗忘”，这两条规则都不适用。然而，在Android Twitter上情况并非如此！\n你可以通过查看这条推文的顶部来判断会发生什么：如果有小的“被…转发”文本，它将被视为转发，指定的转发者将收到通知或被包括在内。\n由于Twitter的性质，一条推文在短时间内同时出现在许多人的时间表上并吸引许多类似的回复是很常见的。在给出你的两美分之前，检查一下对一条受欢迎的推文或一条受欢迎的人的推文的现有回复是有礼貌的。\n在两个人之间的谈话中插嘴通常被认为是不礼貌的，特别是当他们似乎比你更了解对方的时候，特别是如果你是在敌对的情况下。在无数情况下，这可能或多或少是合适的，而且没有硬性规定。你是一个路人，无意中听到两个人在街上说话，你应该照做。\n一些未被认出的回复你的人-特别是那些没有跟上你的人，或者在谈话中回复你的人，或者特别傲慢或令人厌恶的人-经常被称为真正的“兰多”(Rando)。\n当你为了批评某人而引用或公开提及某人时，要意识到你是在把他们暴露给你所有的追随者，其中一些人可能急于争辩。如果你有很多追随者，你可能会无意中邀请了一堆狗屎。\n标签是#字符后跟一定数量的非空格字符。据传闻，它们似乎被限制在服务器端不超过100个字符，但我还没有找到任何关于这方面的文档。\n到底哪些字符可能会出现在标签中，这有点不一致，而且至少悄悄地改变了一次。\n标签的唯一真正意义在于，你可以在客户端点击它们，直接跳转到搜索结果。请注意，搜索#foo只能找到#foo，但是搜索foo会同时找到foo和#foo。\n标签可以出现在“趋势”小部件中，但任何其他常规文本也可以。\n没有理由在你的推文中标记一堆随意的词。没有人在推特上搜索#有趣。这样做会让你看起来像是一个脱离实际的营销者，尝试得太多太努力了。\n人们有时确实会将标签用作“旁观者”或“情绪”，但在这种情况下，标签并不是用来搜索的，而使用标签的真正意义在于链接颜色会将其与正文相抵消。\nTwitter还支持“现金标签”，即以$为前缀，通常是股票代码。我之所以知道这一点，只是因为它让shell和Perl代码看起来很傻。\n您可以明确包括一组最多四张图像、一段视频或一次投票。您不能在一条推文中合并这些内容。品牌™可以使用其他几个嵌入式小玩意儿。\n如果您包含图像或视频，您将失去24个字符的写作空间，因为指向图像/视频的直接链接将自动添加到您的推文的末尾。这是为了纯文本客户端，例如通过短信使用Twitter的人，这样他们就可以看到有附件，并可能在浏览器中查看。\n图像通常会变得有损。动画GIF将被重新编码为H.264视频，即使在这样的情况下-例如小的动画像素艺术-这会破坏图像并生成比原始文件更大的视频。(在这些情况下，将原始GIF放大到更大的大小可以在一定程度上遏制质量的损失。)。\n静态GIF、JPEG或不透明PNG将被重新编码为相当低质量的JPEG。这使得Twitter非常不适合分享数字艺术或截图。这也会导致文本图像非常嘈杂，因为它们每次都会被多次重新上传和重新编码。\n具有Alpha通道的PNG将保持不变，这使其成为非照片图像的常用技巧。确切的启发式方法尚不清楚；我已经添加了一个全不透明的alpha通道，并尝试将单个像素设置为99%不透明，但都无济于事。我被告知，至少有一个完全透明的像素就足以避免被JPEG缠绕。\n附件有三种不同大小的。tweet中内联显示的视图是https://pbs.twimg.com/media/something.jpg.。单击或点击单个图像时显示的较大视图为.jpg：Large。据我所知，第三个视图实际上并未在任何地方使用，它是某物.jpg：orig。尽管有这个名字，但这不一定是原始上传的图片，但它可以比大尺寸更大。\n包含民意测验不会附加链接，但奇怪的是，您仍然会丢失24个字符。这可能是一个客户端漏洞，但它在网络和Android以及Twitter上都会发生。\n备选客户端最初可能不支持新媒体类型。特别是，使用TweetDeck的人在民意调查启动后经常会感到困惑，因为TweetDeck只显示了推文文本，没有迹象表明曾经有过民意调查。一些第三方客户仍然不支持民调。考虑提及。\n..", "note_en": "I mentioned recently, buried in  a post about  UI changes, that Twitter’s latest earnings report  included this bombshell:\n We are going to fix the broken windows and confusing parts, like the .@name syntax and @reply rules, that we know inhibit usage and drive people away\n There’s an interesting problem here.  UI is hard. You can’t just slap a button on the screen for every feature that could conceivably be used at any given time. Some features are only of interest to so-called “power users”, so they’re left subtle, spread by word-of-mouth. Some features you try to make invisible and heuristic. Some features are added just to solve one influential user’s problem. Some features are, ah, accidental.\n A sufficiently mature, popular, and interesting product thus tends to accumulate a small pile of hidden features, sometimes not documented or even officially acknowledged. I’d say this is actually a  good thing! Using something for a while should absolutely reward you with a new trick every so often — that below-the-surface knowledge makes you feel involved with the thing you’re using and makes it feel deeper overall.\n The hard part is striking a balance. On one end of the spectrum you have tools like Notepad, where the only easter egg is that pressing F5 inserts the current time. On the other end you have tools like vim, which consist exclusively of easter eggs.\n One of Twitter’s problems is that it’s tilted a little too far towards the vim end of the scale. It looks like a dead-simple service, but those humble 140 characters have been crammed full of features over the years, and the ways they interact aren’t always obvious. There are rules, and the rules generally make sense once you know them, but it’s also really easy to overlook them.\n Here, then, is a list of all the non-obvious things about Twitter that I know. Consider it both a reference for people who aren’t up to their eyeballs in Twitter, and an example of how these hidden features can pile up. I’m also throwing in a couple notes on etiquette, because I think that’s strongly informed by the shape of the platform.\n  Tweets are limited to 140  Unicode characters, meaning that even astral plane characters (such as emoji) only count as one.\n  Tweets may contain newlines, and there doesn’t seem to be any limit to how many.\n In the middle of a tweet, strings of whitespace (e.g. multiple spaces) are preserved. However, more than two  consecutive newlines will be reduced to only two.\n Anything remotely resembling a link will be mangled into some  http://t.co/asdf link-shortened garbage. In some cases, such as when talking about a domain name, this can make the tweet  longer. You can defeat this by sticking an invisible character, such as U+200D  ZERO  WIDTH  JOINER, around the final dot so it no longer looks like a domain name.\n In official clients, links are shown unmangled, but without the protocol and truncated to about 20 characters. The link to this article, for example, shows as  eev.ee/blog/2016/02/2…. However, at least on Web Twitter, copy-pasting preserves the link in full, including protocol.\n Note that Twitter’s knowledge of domains is not exhaustive — it will link “google.com” but not “eev.ee”.\n For the sake of its  SMS-based roots, Twitter supports performing several commands by typing them  in a tweet. In particular, if you start a tweet with the word  d or  m or  dm, the second word will be treated as a username, and the rest of the tweet will be  DM’d to that user. Tweeting “dm me if you…” will instead  DM  if you... to user  @me.\n Accounts managed by multiple people, such as support accounts or politicians’ accounts, sometimes sign tweets with a  ^ followed by the author’s initials. This has no special significance to Twitter.\n You cannot use astral plane characters (which includes most emoji) in your display name or bio; they will be silently stripped. However, you  can use anything from the  Miscellaneous Symbols or  Dingbats blocks, and many of these characters are rendered with color glyphs on Web Twitter. Results may vary on phones and in other clients.\n  A tweet can “mention” other users, which just means including their  @handle somewhere in the tweet. This will notify every mentioned user of the tweet.\n You can reply to tweets, which threads them together. A tweet can only have one parent (or no parent), but any number of replies. Everything on Twitter is thus arranged into a number of trees, where the root of the tree is a new tweet not responding to anything, and replies branch out from there.\n A tweet that  begins with a mention — that is, the very first character is  @ and it’s immediately followed by an extant username — won’t appear on your profile on Web Twitter. It’ll still appear on the “with replies” page. It’ll also appear on your profile on Android Twitter, which doesn’t separate replies from not.\n A “mention” can only be an existing username. If “foo” is not the name of a user, then  @foo is not a mention, and none of the rules for mentions apply.\n A tweet that begins with a mention won’t appear on the timelines of anyone who follows you,  unless they also follow the first person you mention. That is, if you tweet  @foo @bar heya, it’ll only appear on the timelines of people who follow both you and  @foo.\n If you put some other character before the first  @, the previous rule no longer applies, and your tweet will appear to all your followers. So  .@foo @bar heya will be visible to everyone (and show on your Web profile). This is called “dot-replying”. The dot isn’t actually special; it’s just an easy-to-type and unobtrusive character. I like to use  → or  \\. Some people prefer to put the mentions at the end instead, producing  heya @foo @bar.\n Dot-replying in the middle of a tweet is not strictly necessary, but sometimes it’s useful for disambiguation. If you’re replying to  @foo, and want to say something  about  @bar, it would come out as  @foo @bar is pretty great, which is a little difficult to read. Adding a dot to make  @foo .@bar doesn’t do anything as far as Twitter is concerned, but can make it clear that  @bar is the subject of a sentence rather than a person being talked to.\n One last visibility wrinkle: if a tweet appears in your timeline because it begins with a mention of someone you follow, the tweet it replies to will also appear, even if it wouldn’t have on its own.\n Consider three users: A, B, and C. You follow B and C, but not A. User A makes a tweet, and B replies to it ( @A cool!). Neither tweet will appear on your timeline — A’s won’t because you don’t follow A, and B’s won’t because it begins with a mention of someone you don’t follow. Then C replies to B’s tweet, which puts the mention of B first (see below).  Both B’s and C’s tweets will now appear on your timeline — C’s appears because it begins with a mention of someone you do follow, and B’s appears  for context.\n In other words, even if a tweet doesn’t appear on your timeline initially, it may show up  later due to the actions of a third party.\n A reply  must, somewhere, mention the author of the tweet it’s replying to. If you reply to a tweet and delete the author’s  @handle, it’ll become a new top-level tweet rather than a reply. You can see this in some clients, like Android Twitter: there’s “replying to (display name)” text indicating it’s a reply, and that text disappears if you delete the  @handle.\n There is one exception to the previous rule: if you’re replying to  yourself, you don’t have to include your own  @handle, even though clients include it by default. (If you’re replying to a tweet of your own that already begins with some mentions, those will be prepopulated, rather than your own  @handle.) So if you want to say something that spans multiple tweets, you can just keep replying to yourself and deleting the  @handle. (This is sometimes called a “tweetstorm”.)\n It’s a really good idea to do this whenever you’re making multiple tweets about something. Otherwise, someone who stumbles upon one of the tweets later will have no idea what the context was, and won’t be able to find it without scrolling back however long on your profile.\n If you reply to yourself but leave your  @handle at the beginning, the first tweet will appear on your profile, but the others won’t, because they start with a mention. On the other hand, letting the entire tweetstorm appear on your profile can be slightly confusing — the individual tweets will appear in reverse order, because tweets don’t appear threaded on profiles. On Web Twitter, at least, the followups will have a “view conversation” link that hints that they’re replies.\n Either way, the replies will still appear on your followers’ timelines. Even if the replies begin with your  @handle, they still begin with a mention of someone your followers all follow: you!\n I’m told that many third-party clients don’t support replying to yourself without your handle included, and the  API documentation doesn’t mention that it’s a feature. But I’m  also told that  only first-party clients require you to mention someone in a reply in order to thread, and that third-party clients will merrily thread anything to anything. (I remember when Web Twitter allowed that, so I totally believe the  API still does.) If you don’t use the official clients, I guess give it a whirl and see what happens.\n The previous rule also applies when making longer replies to someone else. Reply to them once, then reply to  yourself with the next tweet (and remove your own  @handle). You’ll end up with three tweets all threaded together.\n This is even more important, because Twitter shows the replies to a single tweet in a somewhat arbitrary order, bubbling “important” ones to the top. If you write a very long response and break it across three tweets, all replying to the same original tweet, they’ll probably show as an incoherent jumble to anyone reading the thread. If you make each tweet a reply to the previous one, they’re guaranteed to stay in order.\n Replying to a tweet will also prefill the  @handle of anyone mentioned in the tweet. Replying to a retweet will additionally prefill the  @handle of the person who retweeted it. The original author’s  @handle always appears first. In some cases, it’s polite to remove some of these; you only need the original author’s  @handle to make a reply. (It’s not uncommon to accumulate multiple mentions, then end up in an extended conversation with only one other person, while constantly notifying several third parties. Or you may want to remove the  @handle of a locked account that retweeted a public account, to protect their privacy.)\n Prefilling  @handles is done client-side, so some clients have slightly different behavior. In particular, I’ve seen a few people who reply to their own reply to someone else (in order to thread a longer thought), and end up with  their own  @handle at the beginning of the second reply! You probably don’t want that, because now the second reply begins with a mention of someone all of your followers follow — yourself! — and so both tweets will appear on your followers’ timelines.\n In official clients (Web and Android, at least), long threads of tweets are collapsed on your timeline. Only the first tweet and the last  two tweets are visible. If you have a lot to say about something, it’s a good idea to put the important bits in one of those three tweets where your followers will actually see them. This is another reason it’s polite to thread your tweets together — it saves people from having their timelines flooded by your tweetstorm.\n Sometimes, it’s possible to see multiple “branches” of the same conversation on your timeline. For example, if A makes a few tweets, and B and C both reply, and you follow all three of them, then you’ll see B’s replies and C’s replies separately. Clients don’t handle this particularly well and it can become a bit of a clusterfuck, with the same root tweet appearing multiple times.\n Because official clients treat a thread as a single unit, you can effectively “bump” your own tweet by replying to it. Your reply is new, so it’ll appear on your followers’ timelines; but the client will also include the first tweet in the thread as context, regardless of its age.\n When viewing a single tweet, official clients may not show the replies in chronological order. Usually the “best” replies are bumped to the top. “Best” is entirely determined by Twitter, but it seems to work fairly well.\n If you reply to yourself, your own replies will  generally appear first, but this is not guaranteed. If you want to link to someone else’s long chain of tweets, it’s safest to link to the  last tweet in the thread, since there can only be one unambiguous trail of parent tweets leading back to the beginning. This also saves readers from digging through terrible replies by third parties.\n If reply to a tweet with  @foo heya, and  @foo later renames their account to  @quux, the tweet will retain its threading even though it no longer mentions the author of the parent tweet. However, your reply will now appear on your profile, because it doesn’t begin with the handle of an existing user. Note that this means it’s fairly easy for a non-follower to figure out what you renamed your account to, by searching for replies to your old name.\n Threads are preserved even if some of the tweets are hidden (either because you’ve blocked some participants, or because they have their accounts set to private). Those tweets won’t appear for you, but any visible replies to them will.\n If a tweet in the  middle of a thread is deleted (or the author’s account is deleted), the thread will break at that point. Replies to the deleted tweet won’t be visible when looking at the parent, and the parent won’t be visible when looking at the replies.\n You can  quote tweets by including a link to them in your tweet, which will cause the quoted tweet to appear in a small box below yours. This is what the retweet button does when you add a comment: it tweets what you typed as normal, but with the first tweet’s  URL added to the end.\n This  does not create a reply and will not be part of the quoted tweet’s thread. If you want to do that, you can’t use the retweet/quote button. You have to reply to the tweet, manually include a link to it,  and be sure to mention the author.\n When you quote a tweet, the author is notified; however, unlike a retweet, they won’t be notified when people like or retweet your quote (unless you also mention them). If you don’t want to notify the author, you can take a screenshot (though this doesn’t let them delete the tweet) or use a  URL shortener (though this doesn’t let them obviously disable a quote by blocking you).\n Liking or retweeting someone else’s retweet will generally notify the retweeter. Replying to a retweet will prefill the  @handle of the retweeter as well as the original author. However, if you click on the tweet on Web Twitter, the retweeter is “forgotten” and neither rule applies. This isn’t the case on Android Twitter, though!\n You can tell what will happen by looking at the top of the tweet: if there’s small “Retweeted by …” text, it’s treated as a retweet, and the named retweeter will be notified or included.\n Due to the nature of Twitter, it’s common for a tweet to end up on many people’s timelines simultaneously and attract many similar replies within a short span of time. It’s polite to check the existing replies to a popular tweet, or a tweet from a popular person, before giving your two cents.\n It’s generally considered rude to barge into the middle of a conversation between two other people, especially if they seem to know each other much better than you know them, and especially if you’re being antagonistic. There are myriad cases where this may be more or less appropriate, and no hard and fast rules. You’re a passerby overhearing two people talking on the street; act accordingly.\n Someone unrecognized who replies to you — especially someone who doesn’t follow you, or who is replying to the middle of a conversation, or who is notably arrogant or obnoxious — is often referred to as a “rando”.\n When you quote or publicly mention someone for the sake of criticizing them, be aware that you’re exposing them to all of your followers, some of whom may be eager for an argument. If you have a lot of followers, you might inadvertently invite a dogpile.\n  Hashtags are a  # character followed by some number of non-whitespace characters. Anecdotally, they seem to be limited server-side to 100 characters, but I haven’t found any documentation on this.\n Exactly  which characters may appear in a hashtag is somewhat inconsistent, and has quietly changed at least once.\n The only real point to hashtags is that you can click on them in clients to jump directly to search results. Note that searching for  #foo will only find  #foo, but searching for  foo will find both  foo and  #foo.\n Hashtags can appear in the “trending” widget, but so can any other regular text.\n There is no reason to tag a bunch of random words in your tweets. No one is searching Twitter for  #funny. Doing this makes you look like an out-of-touch marketer who’s trying much too hard.\n People do sometimes use hashtags as “asides” or “moods”, but in this case the tag isn’t intended to be searched for, and the real point of using a hashtag is that the link color offsets it from the main text.\n Twitter also supports “cashtags”, which are prefixed with a  $ instead and are generally stock symbols. I only even know this because it makes shell and Perl code look goofy.\n   You may explicitly include a set of up to four images  or a video  or a poll. You cannot combine this within a single tweet. Brands™ have access to a handful of other embedded gizmos.\n If you include images or a video, you will lose 24 characters of writing space, because a direct link to the images/video will be silently added to the end of your tweet. This is for the sake of text-only clients, e.g. people using Twitter over  SMS, so they can see that there’s an attachment and possibly view it in a browser.\n Images will generally be made lossy. An animated  GIF will be re-encoded to an h.264 video, even in cases — such as small animated pixel art — where this destroys the image and produces a video bigger than the original file. (In these cases, scaling the original  GIF up to a larger size can somewhat curb the loss in quality.)\n A static  GIF,  JPEG, or opaque  PNG will be re-encoded as a fairly low-quality  JPEG. This makes Twitter fairly unsuitable for sharing digital art or screenshots. It also leads to extremely noisy images of text as they get re-uploaded many times over and re-encoded each time.\n A  PNG with an alpha channel will be left intact, making it a common trick for non-photographic images. The exact heuristic is unclear; I’ve added an all-opaque alpha channel and also tried making a single pixel 99% opaque, to no avail. I’m told that having at least one fully transparent pixel is enough to avoid being put through the  JPEG wringer.\n Attached have three different sizes. The view shown inline in a tweet is  https://pbs.twimg.com/media/something.jpg. The larger view shown when clicking or tapping an individual image is  something.jpg:large. A third view, not actually used anywhere to my knowledge, is  something.jpg:orig. Despite the name, this is not necessarily the original uploaded image, but it can be larger than the  large size.\n Including a poll will not append a link, but curiously, you’ll still lose 24 characters. It’s possible this is a client bug, but it happens in both Web and Android Twitter.\n Alternative clients may not support new media types at first. In particular, people who used TweetDeck were frequently confused right after polls were launched, because TweetDeck showed only the tweet text and no indication that a poll had ever been there. Some third-party clients still don’t support polls. Consider mentionin\n......", "posttime": "2020-06-12 05:03:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,失踪,missing,回复", "title": "推特的失踪手册", "title_en": "Twitter’s Missing Manual", "transed": 1, "url": "https://eev.ee/blog/2016/02/20/twitters-missing-manual/", "via": "", "real_tags": ["推特", "失踪", "missing", "回复"]}, {"category": "", "categoryclass": "", "imagename": "3e06cdc4b58c04a3dd6f5f0280d11727.jpg", "infoid": 1006201, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网(CNN)一名前缉毒局发言人周四在法庭上承认，他假扮成中央情报局(CIA)特工，精心策划了一项计划。\n加里森·肯尼斯·考特尼，44岁，周四上午在弗吉尼亚州东区联邦法院承认欺诈指控。\n根据他的认罪，他承认欺骗公职人员和公司，让他们相信他与中央情报局合作，并最终诈骗了十几家公司超过400万美元。\n考特尼采取了非同寻常的措施来说服公职人员和公司，让他们相信他为中央情报局(CIA)卧底工作，包括向这些公司暗示，他是由总统或司法部长等高级官员建立的美国国防和情报机密特别工作组的特工。\n他有时表示，该计划是为了支持非洲的特种部队。但检察官表示，该项目并不存在。\n检察官补充说，当某些人质疑或怀疑考特尼的合法性时，他会错误地指控他们是代表外国情报机构的间谍，以诋毁他们的声誉。\n考特尼使用像Alpha214这样的代号，在一个敏感的隔间信息设施(SCIF)举行会议，伪造据称由司法部长签署的文件和其他合同，甚至向政府官员通报，让他们相信他与中央情报局(CIA)的关系。\n所有的文件都是你为了制造机密节目的假象而创建的吗？格雷迪法官利亚姆·O&39；格雷迪在周四的认罪听证会上问考特尼。\n检察官在他的认罪书中说，考特尼在不知情的情况下使用了六名未具名的公职人员作为他的道具。在这样做的过程中，他利用这些官员来确认他的合法性，包括指示他的受害者与这些公职人员交谈，以核实他的说法。但考特尼确切地告诉了这些官员应该说些什么。\n考特尼因此给受害者造成了一种假象，即政府官员已经独立证实了他的说法，而实际上，根据考特尼的冒犯陈述，这些官员只是在呼应考特尼提供给他们的错误信息。\n他的认罪文件显示，他说服两家公司雇佣了一名公职人员的成年子女，作为延续他的计划的一种方式。法庭诉讼中没有提到公职人员和公司的名字。\n考特尼还一度说服官员们在安全的政府设施内与受害者会面，从而加深了真实性的假象。\n在一项非同寻常的声明中，考特尼还表示，一个外国情报组织试图用蓖麻毒素毒死他。\n他的认罪文件显示，他从未被蓖麻毒素毒死，并因与蓖麻毒素无关的普通健康问题入院治疗，也没有任何其他形式的中毒或任何针对他的生命企图，他的认罪文件显示，他曾因普通健康问题入院治疗，与蓖麻毒素无关，也没有任何其他形式的中毒或任何针对他的生命企图。\n他承认，这样做的目的是让公司相信，他可以帮助公司获得政府对雇用他和其他人的补偿。\n更正：此故事已更新，以反映考特尼没有创建自己的SCIF。它还更新了有关费用的更多信息。", "note_en": "(CNN)A former Drug Enforcement Administration spokesman admitted in court on Thursday to creating an elaborate scheme where he posed as a covert CIA agent.\n Garrison Kenneth Courtney, 44, pleaded guilty to a fraud charge in Eastern District of Virginia&#39;s federal court Thursday morning.\n He admitted to duping public officials and companies into believing he worked with the CIA and ultimately defrauded a dozen companies of more than $4 million, according to his plea.\n   Courtney took extraordinary steps to convince public officials and companies he was working for the CIA undercover, including by implying to the companies he was a secret agent on a classified US defense and intelligence &#34;task force&#34; that had been established by top officials like the president or the attorney general, according to his statement of offense.\n At times, he said the program was to support special operations forces in Africa. But the program didn&#39;t exist, prosecutors said.\n  &#34;When certain individuals would question or doubt Courtney&#39;s legitimacy, he would falsely accuse them of being spies on behalf of foreign intelligence services in a bid to discredit them,&#34; prosecutors added.\n Courtney used code names like &#34;Alpha214,&#34; held meetings in a sensitive compartmented information facility, or SCIF, faked documents supposedly signed by the attorney general and other contracts, and even briefed public officials to speak to companies to convince them of his ties to the CIA.\n &#34;All the documents had been created by you to create the illusion of the classified program?&#34; Judge Liam O&#39;Grady asked Courtney at his plea hearing on Thursday.\n  Prosecutors in his plea said Courtney used six unnamed public officials his &#34;unwitting props.&#34; In doing so, he used the officials to confirm his legitimacy, including by directing &#34;his victims to speak with these public officials to verify his claims.&#34; But the officials were told exactly what to say by Courtney.\n &#34;Courtney thereby created the false appearance to the victims that the government officials had independently validated his story, when in fact the officials merely were echoing the false information fed to them by Courtney,&#34; according to his statement of offense.\n He convinced two companies to hire a public official&#39;s adult child as a way to perpetuate his scheme, his plea documents said. The public officials and companies are not named in the court proceedings.\n At one point, Courtney also he convinced the officials to meet with his victims &#34;inside secure government facilities, thereby furthering the false appearance of authenticity.&#34;\n In one extraordinary claim, Courtney also said a foreign intelligence group had tried to poison him with ricin.\n &#34;He was never poisoned with ricin, and had been admitted to the hospital for ordinary health issues having nothing to do with ricin, any other form of poisoning, or any attempt on his life,&#34; his plea documents said.\n   The intention, he admitted, was to get companies to believe he could help the companies get government reimbursements for hiring him and others.\n CORRECTION: This story was updated to reflect Courtney did not create his own SCIF. It has also been updated with additional information on the charges.", "posttime": "2020-06-12 05:03:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发言人,spokesman,官员", "title": "前DEA发言人承认在400万美元诈骗计划中冒充中情局秘密特工", "title_en": "Ex-DEA spokesman admits posing as covert CIA agent in $4M fraud scheme", "transed": 1, "url": "https://www.cnn.com/2020/06/11/politics/dea-cia-fraud/index.html", "via": "", "real_tags": ["发言人", "spokesman", "官员"]}, {"category": "", "categoryclass": "", "imagename": "4d578919ca5a3082d7da0475dd2ad0e9.jpg", "infoid": 1006200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2018年5月以来，国际空间站上有一个名为冷原子实验室(CAL)的微型冰箱大小的设施，能够将真空中的原子冷却到绝对零度以上百亿分之一度的温度。无论出于何种目的，它都是已知宇宙中最冷的地方之一。根据发表在《自然》杂志上的一项新研究，科学家们刚刚在太空中首次用它创造了一种罕见的物质状态。\n玻色-爱因斯坦凝聚体，有时被称为物质的第五种状态，是气态的原子云，它们不再像单个原子那样行为，而开始像集体一样行为。它们通常被称为BEC，最早是在95年前由阿尔伯特·爱因斯坦(Albert Einstein)和萨蒂扬德拉·纳特·博斯(Satyendra Nath Bose)预测的，但科学家们首次在实验室观察到它们是在25年前。\n在制造BEC时，一般的想法是将原子(在CAL、Rb和K的情况下)注入到超冷室中，以减缓它们的速度。然后，在房间里用带电的线圈创建一个磁阱，它与激光和其他工具一起使用，将原子移动到致密的云层中。这项新研究的主要作者、NASA喷气推进实验室的物理学家大卫·阿维林(David Aveline)说，在这一点上，原子“有点相互模糊”。\n要使用BEC进行实验，您需要调低或释放磁阱。拥挤的原子云将会膨胀，这很有用，因为BEC需要保持低温，气体在膨胀时往往会冷却。但是，如果BEC中的原子相距太远，它们的行为就不再像凝聚体了。这就是近地轨道的微重力发挥作用的地方。Aveline说，如果你试图增加地球上的体积，重力只会将BEC云中心的原子拉到陷阱的底部，直到它们溢出，扭曲凝析油或完全摧毁它。但在微重力下，CAL中的工具可以将原子保持在一起，即使陷阱的体积增加了。这使得凝析油的寿命更长，这反过来又允许科学家们比他们在地球上研究它的时间更长(最初的演示持续了1.118秒，尽管目标是能够探测到长达10秒的云层)。\n虽然这只是第一步，但CAL实验有朝一日可能会让BEC成为超灵敏仪器的基础，这些仪器可以探测来自宇宙中一些最神秘的现象的微弱信号，比如引力波和暗能量。从更实际的角度来看，Aveline相信团队的工作可以为更好的惯性传感器铺平道路。“应用范围从加速计和地震仪到陀螺仪，”他说。\n与此同时，研究人员可以玩弄CAL，Aveline将其描述为一个“旋钮系统”，为原子实验创造独特的条件。该团队现在知道它可以在太空中产生玻色-爱因斯坦凝聚体。下一步是调整设置，看看旋钮转到11时会发生什么，可以这么说。", "note_en": "On board the International Space Station since May 2018 is a mini-fridge-size facility called the Cold Atom Lab (CAL), capable of chilling atoms in a vacuum down to temperatures one ten billionth of a degree above absolute zero. It is, for all intents and purposes, one of the coldest spots in the known universe. And according to a  new study published in Nature, scientists have just used it to create a rare state of matter for the first time ever in space.\n  Bose-Einstein condensates, sometimes called the fifth state of matter, are gaseous clouds of atoms that stop behaving like individual atoms and start to behave like a collective. BECs, as they’re often called, were first predicted by Albert Einstein and Satyendra Nath Bose over 95 years ago, but they were first observed in the lab by scientists just 25 years ago.\n   The general idea when making a BEC is to inject atoms (in the case of CAL, rubidium and potassium) into an ultra-cold chamber to slow them down. A magnetic trap is then created in the chamber with an electrified coil, which is used along with lasers and other tools to move the atoms into a dense cloud. At this point the atoms “kind of blur into one another,” says David Aveline, a physicist at NASA’s Jet Propulsion Laboratory, and the lead author of the new study.\n  To run experiments using a BEC, you need to turn down or release the magnetic trap. The cloud of crowded atoms will expand, which is useful because BECs need to stay cold, and gases tend to cool off as they expand. But if the atoms in a BEC get too far apart, they no longer behave like a condensate. This is where the microgravity of low Earth orbit comes into play. If you try to increase the volume on Earth, says Aveline, gravity will just pull the atoms in the center of the BEC cloud down to the bottom of the trap until they spill out, distorting the condensate or ruining it entirely. But in microgravity, the tools in the CAL can hold the atoms together even as the trap’s volume increases. That makes for a longer-lived condensate, which in turn allows scientists to study it longer than they could on Earth (this initial demonstration ran for 1.118 seconds, although the goal is to be able to detect the cloud for up to 10 seconds).\n    Though only a first step, the CAL experiment could one day allow BECs to form the basis of ultra-sensitive instruments that detect faint signals from some of the universe’s most mysterious phenomena, like gravitational waves and dark energy. From a more practical perspective, Aveline believes the team’s work could pave the way for better inertial sensors. “The applications range from accelerometers and seismometers to gyroscopes,” he says.\n  In the meantime, the researchers get to play around with CAL, which Aveline describes as a system of “knobs to turn,” to create unique conditions for experimenting with atoms. The team now knows it can create Bose-Einstein condensates in space. The next step is tweaking the settings to see what happens to them when the knobs are turned to 11, so to speak.", "posttime": "2020-06-12 04:46:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,科学家,制造,bose,原子", "title": "科学家首次在太空制造玻色-爱因斯坦凝聚体", "title_en": "Scientists Have Made Bose-Einstein Condensates in Space for the First Time", "transed": 1, "url": "https://www.technologyreview.com/2020/06/11/1003263/scientists-made-bose-einstein-condensates-in-space-first-time-iss/", "via": "", "real_tags": ["太空", "科学家", "制造", "bose", "原子"]}, {"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1006199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为以前被称为认知抽查的项目的一部分，我不得不回答的最难的问题之一是：“我怎么知道要写下什么？”\n写下任何占用大脑内存的东西，不管它看起来是否相关或有趣。如果你发现你经常这样做，考虑一下你可能有一个你不知道的秘密目标。\n你的笔记和作者的文字之间的对应性越小越好。复制/粘贴只需要很少甚至不需要参与，整个章节的解释需要大量的替代理论。\n把你读过的东西写下来(/听到/等等)可以提高你的记忆力和理解力，但代价是打乱了阅读的流程。写下一件事会让你更容易重新发现这一件事，代价是让你已经拥有或将要写下的每一件事都变得更难找到。哦，边看书边做这个权衡的算术是非常昂贵的，而且需要了解未来。\n我想给您一个简单的核对表，用来确定何时保存一条信息。不幸的是，我从来没有开发过一个。有一些显而易见的问题，比如“这对我来说有趣吗(出于任何原因)？”还有“这是作者论点的关键吗？”，但他们始终没有摆脱我正在丢失某一天可能有用的信息的挥之不去的感觉，特别是我在做肤浅的研究(这意味着相信作者的话)，而不是深入的(这意味着要做我自己的模型)。\n找出要写下什么最有帮助的一件事是注意到我的阅读速度变慢了，这通常意味着要么有一个特定的事实需要从短期存储转移到长期存储，要么我需要考虑一些事情。不管它们的实际重要性如何，这些类别中的东西都需要记录下来并加以考虑，因为它们感知到的重要性就是消耗资源，而30秒写下一些东西来重新获得这些资源是一种很好的交易，即使我再也不会使用这些信息。如果我有一个建议的话，那就是“学会识别需要你注意的东西的微妙拖累。”\n一个显而易见的问题是“我该如何做到这一点呢？”在回答这个问题时，我是一个平庸的人，因为我没有开始学习这项技能，我只是注意到我正在做这件事。但对于这个普通的课程，我发现最好的做法是让自己处于一种非常确定自己没有阻力的状态(通过彻底的大脑倾倒)，做一些研究，并注意阻力何时发展。\n但当然，如果我的“这很重要，把它记录下来”的感觉与实际重要的东西相符，那就更好了。这里真正的问题是“对什么重要？”当我在做基于书籍的评论时，答案充其量是“这本书的论文”，正如前面所讨论的那样，这给了作者巨大的权力来控制叙事。但当我将框架切换到回答一组特定的问题时，这几乎变得微不足道了。只要我头脑中有一个非常明确的目标，我的潜意识就会做大部分的工作。\n然而，这并不是一个完全的解决方案，因为有一大片区域被贴上了“以我不知道的东西为导向”的标签。例如，现在我想问一些关于大萧条的具体问题，以及它能告诉我们什么关于即将到来的经济危机，但我觉得我知道的还不够。很难对拼凑起来的论文进行定位：你通常需要具有连贯叙述的书籍，然后再寻找其他方法来消除作者的框架。就像很多事情一样，这是通过变元来解决的。“我想对大萧条有足够的了解，以至于我有一个框架来询问与当前危机有何相似之处”，这足以让我评估不同的“关于大萧条的顶级书籍”名单，并找出其作者最符合我目标的那一本(这是FiveBooks上的那本，这种情况似乎比偶然发生的次数要多得多)。\n我在开场白中提到“失去流量”是做笔记的一种成本，但我实际上并不相信这是一种成本。打破心流也意味着打破作者对你的束缚，独立思考。我注意到“这个断裂点的流量是多少？”之间存在着相当好的线性关系。以及“这能让我为自己思考多少，得出多少新奇的结论呢？”复制/粘贴约会中发生的事件不会中断流程，但也不会激发太多思考。写下你关于似乎丢失的信息的问题，或者对事实的另一种解释，需要的时间要长得多。\n这就引出了我的另一点：对于深度阅读，复制粘贴几乎总是做错了。即使是简单的释义也比复制/粘贴需要更多的参与。尽管如此，不要盲目崇拜这一点：说简单事实的方法只有这么多，而语法练习实际上并不会教会你任何关于这个主题的东西。\n所以，我列出了一个非常令人不满意的清单，告诉你在阅读学习的时候应该写些什么。我希望能帮上忙。", "note_en": "One of the hardest questions I’ve had to answer as part of  the project formerly known as epistemic spot checks is: “how do I know what to write down?”\n     Write down anything that’s taking up mental RAM, whether it seems related or interesting or not. If you find you’re doing this a lot, consider you might have a secret goal you don’t know about.\n The less 1:1 the correspondence between your notes and the author’s words the better. Copy/pasting requires little to no engagement, alternate theories for the explanations spread over an entire chapter require a lot.\n   Writing down a thing you’ve read (/heard/etc) improves your memory and understanding, at the cost of disrupting the flow of reading. Having written a thing down makes that one thing easier to rediscover, at the cost of making every other thing you have or will ever write down a little harder to find. Oh, and doing the math on this tradeoff while you’re reading is both really costly and requires knowing the future.\n I would like to give you a simple checklist for determining when to save a piece of information. Unfortunately I never developed one. There are obvious things like “is this interesting to me (for any reason)?” and “is this key to the author’s argument?”, but those never got rid of the nagging feeling that I was losing information I might find useful someday, and specifically that I was doing shallow research (which implies taking the author’s word for things) and not deep (which implies making my own models).\n The single most helpful thing in figuring out what to write down was noticing when my reading was slowing down, which typically meant either there was a particular fact that needed to be moved from short to long term storage, or that I needed to think about something. Things in these categories need to be written down and thought about regardless of their actual importance, because their perceived importance is eating up resources, and 30 seconds writing something down to regain those resources is a good trade even if I never use that information again. If I have one piece of advice, it’s “learn to recognize the subtle drag of something requiring your attention.”\n An obvious question is “how do I do that though?”. I’m a mediocre person to answer this question because I didn’t set out to learn the skill, I just noticed I was doing it. But for things in this general class, the best thing I have found to do is get yourself in a state where you are very certain you have no drag (by doing a total brain dump), do some research, and pay attention to when drag develops.\n But of course it’s much better if my sense of “this is important, record it” corresponds with what is actually important. The real question here is “Important to what?” When I was doing book-based reviews, the answer at best was “the book’s thesis”, which as   previously discussed  gives the author a huge amount of power to control the narrative. But this became almost trivial when I switched the frame to answering a specific set of questions. As long as I had a very clear goal in mind, my subconscious would do most of the work.\n This isn’t a total solution though, because of the vast swath of territory labeled “getting oriented with what I don’t know”. For example right now I want to ask some specific questions about the Great Depression and what it can tell us about the upcoming economic crisis, but I don’t feel I know enough. It is very hard to get oriented with patchwork papers: you typically need books with cohesive narratives, and then to find other ways to undo the authors’ framing. Like a lot of things, this is solved by going meta. “I want to learn enough about the Great Depression that I have a framework to ask questions about parallels to the current crisis” was enough to let me evaluate different “Top Books about the Great Depression” lists and identify the one whose author was most in line with my goals (it was the one on   fivebooks , which seems to be the case much more often than chance).\n I mentioned “losing flow” as a cost of note taking in my opening, but I’m not actually convinced that’s a cost. Breaking flow also means breaking the author’s hold on you and thinking for yourself. I’ve noticed a pretty linear correlation between “how much does this break flow?” and “how much does this make me think for myself and draw novel conclusions?”. Copy/pasting an event that took place on a date doesn’t break flow but doesn’t inspire much thought. Writing down your questions about information that seems to be missing, or alternate interpretations of facts, takes a lot longer.\n Which brings me to another point: for deep reading, copy pasting is almost always Doing It Wrong. Even simple paraphrasing requires more engagement than copy/pasting. Don’t cargo cult this though: there’s only so many ways to say simple facts, and grammar exercises don’t actually teach you anything about the subject.\n So there is my very unsatisfying list of how to know what to write down when you’re reading to learn. I hope it helps.", "posttime": "2020-06-12 04:46:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学习,reading,需要", "title": "当你阅读学习的时候，你应该写下什么？", "title_en": "What to write down when you’re reading to learn", "transed": 1, "url": "https://acesounderglass.com/2020/06/10/what-to-write-down-when-youre-reading-to-learn/", "via": "", "real_tags": ["学习", "reading", "需要"]}, {"category": "", "categoryclass": "", "imagename": "eb0822a4e52e05149bbf41487bb3681a.jpg", "infoid": 1006197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿-推特(Twitter)屏蔽了一段向乔治·弗洛伊德(George Floyd)提出版权要求致敬的特朗普竞选视频，此举加剧了这家社交媒体平台与其最广泛追随者之一的美国总统之间的紧张关系。\n该公司在@TeamTrump账号发布的一段视频上贴上了标签，上面写道，“该媒体已被禁用，以回应版权所有者的索赔。”这段视频仍然在唐纳德·特朗普总统的YouTube频道上播放，其中包括弗洛伊德的照片，弗洛伊德的死在一开始就引发了广泛的抗议。\nTwitter在一份声明中表示：“根据我们的版权政策，我们会对版权所有者或其授权代表向我们发出的有效版权投诉做出回应。”\n这段3分45秒的剪辑是和平游行和警察拥抱抗议者的照片和视频的蒙太奇剪辑，其间穿插着一些焚烧建筑物和破坏公物的场景，配上温和的钢琴音乐和特朗普的讲话。\n这是推特对特朗普采取的最新行动，特朗普威胁要报复社交媒体公司。", "note_en": "WASHINGTON - Twitter has blocked a Trump campaign video tribute to George Floyd over a copyright claim, in a move that adds to tensions between the social media platform and the U.S. president, one of its most widely followed users.\n The company put a label on a video posted by the @TeamTrump account that said, “This media has been disabled in response to a claim by the copyright owner.” The video was still up on President Donald Trump’s YouTube channel and includes pictures of Floyd, whose death sparked widespread protests, at the start.\n “Per our copyright policy, we respond to valid copyright complaints sent to us by a copyright owner or their authorized representatives,” Twitter said in a statement.\n The three minute and 45 second clip is a montage of photos and videos of peaceful marches and police officers hugging protesters interspersed with some scenes of burning buildings and vandalism, set to gentle piano music and Trump speaking.\n It’s the latest action that Twitter has taken against Trump, who has threatened to retaliate against social media companies.", "posttime": "2020-06-12 04:45:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,版权,blocks,特朗普", "title": "推特屏蔽特朗普竞选视频，原因是未知的“版权主张”", "title_en": "Twitter blocks Trump campaign video over unknown 'copyright claim'", "transed": 1, "url": "https://www.usatoday.com/story/news/politics/2020/06/05/twitter-blocks-trump-campaign-video-tribute-george-floyd/3153176001/", "via": "", "real_tags": ["推特", "版权", "blocks", "特朗普"]}, {"category": "", "categoryclass": "", "imagename": "63a3a8aed338e06b11b8f195bda16aa5.jpg", "infoid": 1006196, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当这些非常大的反垄断调查由政府进行时，它们是保密的，因为政府询问了很多关于企业运营方式的问题，并要求提供非公开的数据和非公开的战略思考。像这样的大调查可能会持续数年。这意味着受影响的消费者和纳税人对正在发生的事情一无所知。他们不知道故事是什么。他们不知道政府的危害论是什么，市场被扰乱的是什么，原因是什么。\n这一切都是完全正常的。调查就是这样进行的。但我认为，在社会上讨论我们想要如何治理我们的国家，以及如果更多的人了解正在发生的事情，我们想如何监管不同的行业或应用法律，这可能是健康的。因此，这篇论文实际上是试图与更广泛的公众，特别是对政策感兴趣的人分享我认为最可信的危害理论。\n他们什么都做。他们拥有广告商使用的工具，他们拥有处理竞价和将竞标发送到网络的中介机构，选择中标的竞标。然后把有创意的内容交给出版商，发布在出版商的网站上，衡量发生了什么，然后付钱给每个人。\n如果广告商在谷歌网站上做广告，比如在YouTube上，或者在搜索上，或者在谷歌的许多其他网站上做广告，也会使用同样的工具链。因此，谷歌既是绝大多数搜索广告的运行渠道，也是很多搜索广告的目的地。\n有一些所谓的围墙花园目的地，比如Facebook和亚马逊。Facebook有很多页面，他们也出售这些页面上的空间。你去找他们，他们要多少钱你付多少钱，你就会在Facebook页面上看到你的广告。这是一个封闭的空间，Facebook在这里知道谁是消费者，知道他们喜欢什么，知道他们的朋友是谁，知道很多信息。同样，亚马逊也知道我买的所有东西。\n但是，如果广告商想要进入我们所说的开放网络-也就是说成千上万的网站，人们可能会去那里阅读他们最喜欢的电影，或者如何更有效地编发，或者烧烤小贴士等等-他们不是一个封闭的、有围墙的花园。而这就是谷歌拥有投放广告的工具的地方。\n现在，一个问题是，这些当事人没有任何其他地方可以去寻找广告投放工具。垂直整合的展示广告销售商通常不会竞相在其物业之外投放广告。此外，谷歌现在拥有90%的广告商和出版商使用的工具，以及超过50%的买卖平台。这使得开放网络上的广告商和出版商几乎没有可以与谷歌一样赚钱的竞争对手的选择。为什么他们不能赚钱呢？因为谷歌的行为已经将他们排除在外，以至于他们没有规模，也没有数据。大量的个人数据使谷歌能够有针对性地投放广告，这意味着他们可以轻松地出价超过小型竞争对手的低价出价。更多的竞争往往会提高这些价格。所以这是一个问题：当你有集中度和市场力量时，出版商的选择更少。\n第二个问题是，像“纽约时报”或“华尔街日报”这样的出版商实际上是在与谷歌竞争。他们的网站与谷歌的资产展开竞争。想一想新闻、航班或购物--谷歌有很多消费者可以去的地方，其他公司也可以去。如果我是Yelp，我必须使用这套工具在我的网站上投放广告，我可能会相当担心谷歌对这些工具的控制，会让我相对于他们自己的资产处于不利地位。他们希望最好的、价格最高的广告投向他们自己的房产，而不是他们的竞争对手。\n“多年来，谷歌在这个市场上收购了许多参与者，并利用技术优势和合同兼容性来引导和强迫广告商和出版商使用谷歌的工具.”\n我们在白皮书中描述的是，多年来，谷歌在这个市场购买了许多参与者，然后利用兼容性、技术兼容性和合同兼容性，来引导和强迫广告商和出版商使用谷歌的工具。例如，如果你想在YouTube上投放广告，你必须使用谷歌的需求方平台。如果你想在谷歌旗下的YouTube上投放广告，根本没有办法使用竞争对手。\n作为消费者，这个问题会渗透到我们身上吗？我们是不是在某种程度上输了？\n是的，确实如此。当广告价格较高时，其中一部分就会转化为商品和服务的价格。如果获得客户的成本是1美元，而不是50美分，那么作为产品制造商，我将有更高的成本，我将把这一成本转嫁给消费者，至少部分转嫁给消费者。\n我认为，几乎更重要的危害是，当一个实体考虑在互联网上建立一个由广告资助的业务时。比方说，我要开一个影评网站，我会用广告来资助它。人们会来我的网站看电影，我会给他们看广告，这将是我的生意。如果我收到的广告价格低于我在竞争激烈的市场中收到的价格，这将对该业务产生非常重大的收入影响。这些企业开始变少了，他们不会投资，不会扩张，因为他们实际上没有赚到消费者希望他们拥有的钱，从消费者看重这些内容的意义上来说，这就是为什么她在网站上看广告的原因。\n的确如此。在这篇论文中，我们从谷歌在搜索领域占据主导地位的地方开始，关于这一点来自哪里，还有一系列完整的问题。但可以肯定的是，谷歌收购了当时拥有的资产，收购了更多的广告技术业务，并利用这些业务来增加其市场力量。\n搜索领域的市场力量-几乎是搜索领域的垄断-可以用来要求广告商使用其他谷歌工具。例如，如果您想要协调显示广告活动和搜索广告活动，Google可以要求使用其工具来设计搜索活动，然后同一工具也可以计划显示活动。或者，如果广告商想要查看数据-谁点击了，谁购买了，试图分析回报率等等-这些数据和分析只能在谷歌数据中心内完成，如果你想要与广告活动中的所有其他数据结合起来，那么你就必须使用谷歌中心。一旦你带着这些数据进入谷歌中心，你就只能做一些特定的事情，比如你的分析和计划下一次活动，如果你使用谷歌工具使用谷歌服务来做这件事的话。\n您在报纸上提到，谷歌将在其Chrome浏览器中屏蔽第三方cookie，Chrome浏览器是世界上最大的浏览器。这被认为是隐私的胜利，但你认为这实际上是谷歌将其他想做数字广告的人拒之门外的另一种方式。\n如果你对隐私的定义是你不想看到有针对性的广告，那么消除第三方cookie不会做到这一点。消除第三方cookie意味着，谷歌是唯一一家可以根据你在网络上所做的一切来开发关于每个人的超级个人资料的公司。如果你登录Chrome，他们可以看到你的活动；他们可以阅读你的Gmail；他们可以查看你在谷歌航班上购物的假期。如果你有一部安卓手机，他们会知道你的位置信息、压力、你的旅行速度、你可能乘坐的交通工具，等等。\n他们跟踪、收集并购买了网络上每个人的大量个人资料，如果这些资料属于垄断者，这意味着数字广告只有通过持有所有数据的垄断者才能有效。\n“关于你的信息可以在25家不同的广告技术公司之间传递，也可以在谷歌的25个部门之间传递。很难知道哪个更好，哪个更安全。我知道哪一个更便宜--有竞争的那个。“。\n我们需要解释的是，关于你的信息可以在25家不同的广告技术公司之间传递，也可以在谷歌的25个部分之间传递。哪一个更好，哪个更安全？这很难知道。我知道哪一种更便宜--有竞争的那一种。而且从刺激他们想在互联网上消费的内容的意义上来说，这对消费者也更好。\n假设我开办了一家遛狗服务，我想给它做广告。如果我知道谁养了狗，我就可以只给那些人做广告。我愿意付更多的钱，而且我必须发送更少的广告，这些广告对接收它们的人来说是有用的广告。拥有关于谁养狗的信息的一方能够提取所有的盈余。因此，有一个完全了解信息的中介机构，这是一个瓶颈，可以提取所有的利润，这降低了新生企业的创业和发展能力。\n那么问题来了，消费者想要什么？他们不想要有针对性的广告吗？那你就不能有广告技术行业了。他们想要有针对性的广告，让发送它的企业受益，比如遛狗者或纽约时报吗？这将需要广告技术市场的竞争。\n联邦政府和州政府显然正在处理一起针对谷歌的反垄断案件。据“纽约时报”报道，他们主要关注数字广告业务，但也在关注搜索业务。当涉及到谷歌在搜索领域的垄断时，有什么理由认为谷歌违反了法律？\n搜查案最初是由欧盟委员会追查的，所以我们有很多关于这方面的信息。当谷歌第一次开始其搜索引擎货币化的道路时，它寻求了相当多的独家合同。例如，成为iPhone上的独家搜索引擎，在美国在线(AOL)等门户网站上，在新闻集团(News Corporation)等资产上。\n在转向移动的过程中，谷歌还开发了Android，并在Android合同中包括了许多默认设置和捆绑，这样他们的浏览器和搜索引擎就会出现在Android手机的前面的显眼位置，而其他任何东西都必须由用户安装在不太显眼的位置。谷歌还有一份名为“反分叉合同”的合同，该合同禁止目前销售Android手机的任何人制造自己版本的Android。比方说，三星希望使用免版税、开源的安卓基础代码来制造三星安卓。如果他们用自己的操作系统、自己的商店、自己的一套应用程序等等做到这一点，如果他们卖的是三星Android手机，他们就会违反谷歌Android的合同。他们将不得不停止销售谷歌手机。这是一个非常大的商业风险说，“哦，我要启动我自己的一个，在我自己的操作系统上。但如果新产品不起作用，我就没有收入了，因为我不能一直卖谷歌手机。“。\n这份合同很可能会阻止那些了解操作系统工作原理的人进入，并阻止操作系统的竞争，而这反过来又是搜索和浏览器的障碍。\n如果联邦政府实际上正处于针对谷歌的反垄断行动的开始阶段，我们应该期待公开看到什么？\n他们说他们会在夏天提出申诉，这真的很快。因此，这显然是一件值得关注的事情。然后各州可能也会在某个时候提出申诉，很可能是在那之后。然后我们再看看那些投诉说什么，他们声称是什么样的反竞争行为。或者，也许联邦政府没有提出申诉，但他们达成了和解。他们说，“嗯，这是我们不喜欢的六件事，但你已经改变了你的行为，所以这弥补了输掉的竞争，我们不会提起诉讼。”", "note_en": "When these very big antitrust investigations are being undertaken by the government, they are confidential, because the government’s asking lots of questions about the way businesses run and asking for data that’s not public and strategic thinking that’s not public. A big investigation like this could last for years. And that means that the people who are the consumers affected and the taxpayers affected don’t have any knowledge of what’s happening. They don’t have a sense of what the story is. They don’t have a sense of what the government’s theory of harm is and what markets were disrupted and why.\n    That’s all completely normal. That’s how these investigations work. But I think it can be healthy for discussions in society about how we want to run our country and how we want to regulate different sectors or apply the law if more people understand what’s going on. So the paper’s really an attempt to share what I think the most plausible theories of harm are with the broader public, and people particularly interested in policy.\n  They do everything. They own the tool that the advertiser uses, they own the intermediaries that handle bidding and sending bids to networks, selecting the winning bid. Then getting that creative content to the publisher, posted on the publisher’s site, measuring what happened, and paying everybody.\n That same chain of tools would be used if the advertiser were advertising on a Google site—on YouTube, for example—or on search or on one of Google’s many other properties. So Google is both the channel through which the vast majority of search advertising is run as well as the destination for a lot of it.\n There are what are called walled-garden destinations like Facebook and Amazon. Facebook has a bunch of pages and they also sell the space on those pages. You go to them, you pay whatever money they ask and you get your ad on a Facebook page. That’s an enclosed space where Facebook knows who the consumer is, knows what they like, who their friends are, lots of information. Similarly, Amazon knows everything I’ve bought.\n  But if an advertiser wants to go to what we call the open web—that is to say the many, many thousands of websites where people might go to read about their favorite movies or how to braid their hair more effectively or grilling tips or whatever—they are not a closed, walled garden. And that’s the place where Google has these tools to place ads.\n Now, one issue is that those parties don’t have any place else to go for ad placement tools. Vertically integrated sellers of display ads are not generally competing to place ads outside their properties. Further, Google now has 90% of the tools used by advertisers and publishers and more than 50% of the platforms that buy and sell. This leaves both advertisers and publishers on the open web with very little choice of competitors that can monetize at the same level as Google. Why can’t they monetize? Because Google’s conduct has excluded them to the point where they don’t have the scale and don’t have the data.  Large amounts of personal data allow Google to target its ads and that means they can easily outbid the low price bid by small rivals. More competition would tend to raise those prices. So that’s one issue: the publishers have less choice when you have concentration and market power.\n The second issue is that the publishers like the  New York Times or the  Wall Street Journal are actually competing with Google. Their sites compete with Google’s properties. Think about news or flights or shopping—any of the many things where Google has a place the consumer could go and so do other companies. If I’m Yelp and I have to use this set of tools to get advertising onto my site, I might be quite concerned that Google in its control of those tools, is disadvantaging me vis-a-vis their own properties. They’d like the best ads at the highest prices to go to their own properties and not to their rivals.\n  “Google has purchased many participants in this marketplace over the years and used technological and contractual compatibility to steer and coerce advertisers and publishers to use Google’s tools.”\n What we describe in the paper is that Google has purchased many participants in this marketplace over the years and then has used compatibility, technological and contractual compatibility, to steer and coerce advertisers and publishers to use Google’s tools. For example, you have to use a Google demand-side platform if you wish to place an ad on YouTube. There just isn’t a way to use a competitor if you want to place your ad on YouTube, which is owned by Google.\n Does this issue trickle down to us as consumers? Are we losing out in some way?\n Yes, it does. When the price of ads is higher, some of that is passed through into the price of goods and services. If acquiring a customer costs me a dollar instead of 50 cents, then I, as the manufacturer of the product, am going to have a higher cost and I’m going to pass that through to consumers, at least in part.\n I think almost a more important harm is when an entity is thinking about setting up an ad-funded business on the internet. Say I’m going to open up a site that reviews movies and I’m going to fund that with ads. People will come to my site and read about movies and I’ll show them ads, and that will be a business for me. If I receive a lower price for those ads than I would in a competitive market that’s a very substantial revenue impact for that business. Fewer of those businesses will start to begin with, they won’t invest, they won’t expand, because they’re not actually earning the money that consumers would like them to have, in the sense that the consumer values that content so that’s why she’s on the site looking at the ad.\n  It does. In the paper we start at the point where Google has dominance in search, and there’s a whole other set of issues about where that came from. But certainly Google takes properties that it has at the time, acquires more businesses in ad tech, and uses those to increase its market power.\n The market power in search—an almost virtual monopoly in search—can be used to require advertisers to employ other Google tools. For example, if you want to have a display ad campaign and a search ad campaign that are coordinated, Google can require use of its tools to design on a search campaign, and then that same tool also plans the display campaign. Or if an advertiser wants to look at the data—who clicked, who bought, try to analyze rates of return and so on—that data and that analysis can only be done inside the Google Data Hub and if you want to combine with all the other data that come out of your advertising campaign, then you have to use the Google Hub. Once you’re in the Google Hub with that data, you then are only able to do certain things, like your analytics and planning the next campaign, if you do it with Google tools using Google services.\n You mentioned in the paper that Google is going to be blocking third-party cookies in its Chrome browser, which is the biggest browser in the world. This has been presented as a victory for privacy, but you suggest actually it’s another way for Google to shut out other people who want to do digital advertising.\n If your definition of privacy is that you don’t want to see targeted ads, then elimination of the third-party cookie is not going to do that. What the elimination of third-party cookie means is that Google is the only one who can develop a super-profile on everybody, based on everything you do on the web. They can see your activities if you’re logged into Chrome; they can read your Gmail; they can look at what vacations you’re shopping for on Google Flights. If you’ve got an Android phone, they have location information, pressure, how fast you are traveling, what kind of conveyance you are likely in, and so forth.\n They have tracked, collected, and bought an enormous profile about each person on the web and that profile, if it belongs to a monopolist, means that digital advertising is only effective if done through the monopolist who holds all the data.\n “Information about you can be passed among 25 different ad tech companies or it can be passed among 25 parts of Google. It&#39;s hard to know which is better or safer. I know which is cheaper—the one where there’s competition.”\n We need to explain that the information about you can be passed among 25 different ad tech companies or it can be passed among 25 parts of Google. Which one of those is better or safer? That’s hard to know. I know which one of them is cheaper—the one where there’s competition. And it’s also better for consumers in the sense of stimulating the content that they want to consume on the internet.\n Suppose that I start up a dog-walking service and I want to advertise it. If I know who owns a dog, then I can advertise just to those people. I am willing to pay more and I have to send fewer ads, and they’re useful ads to the people who receive them. The party that holds the information about who has a dog is able to extract all of that surplus. So there’s an intermediary with a complete knowledge of the information that is the bottleneck and can extract all the profit, which reduces the ability of nascent businesses to start and grow.\n So the question then is, what do consumers want? Do they want no targeted advertising? Well, then you can’t have an ad tech industry. Do they want targeted advertising that benefits the business that’s sending it, like the dog walker or the  New York Times? That would require competition in the ad tech market.\n The federal governments and state governments are apparently working on an antitrust case against Google.  According to the  New York Times, they’re focusing primarily on the digital advertising business, but they’re also looking at search. What is the argument that Google is violating the law when it comes to its monopoly in search?\n The search case was first pursued by the European Commission, so we have lots of information about that. When it first started down the path of monetizing its search engine, Google pursued quite a few exclusive contracts. To be the exclusive search engine on the iPhone, for example, on portals like AOL and on properties like News Corporation.\n Google also, in the move to mobile, developed Android and included a lot of defaults and bundling in the Android contract so that their browser and search engine were on the front of the Android phone in a prominent place, and anything else would have to be installed by the user in a less prominent location. Google also had a contract called the anti-forking contract which prevented anybody who was currently selling an Android handset from making their own version of Android. Let’s say Samsung had wanted to make Samsung Android using the royalty free, open source Android base code. If they had done that with their own operating system, their own store, their own set of apps and so on, if they had sold a Samsung Android phone, they would have been out of compliance with the Google Android contract. They would have had to stop selling Google phones. That’s a very big business risk to say, “Oh, I’m going to start up one of my own, on my own operating system. But if that new product doesn’t work I will have no revenue because I cannot keep selling the Google phones.”\n That contract likely blocked entry by those who understood how operating systems work and prevented competition in the operating system, which in turn was then the barrier to search and the browser.\n If the federal government is in fact in the beginning stages of antitrust action against Google, what should we expect to see publicly?\n They’ve said that they’re going to file a complaint in the summer, which is really quick. So that would be obviously something to watch. And then the states are going to presumably file a complaint also at some juncture, probably after that. So then we will see what those complaints say, what kind of conduct they allege as being anti-competitive. Or perhaps the federal government doesn’t file a complaint, but they settle. They say, “Well, here are the six things we didn’t like, but you’ve changed your behavior, and so therefore that’s remedied the lost competition and we’re not going to bring a case.”", "posttime": "2020-06-12 04:28:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,rust,case", "title": "针对谷歌的反垄断案", "title_en": "The antitrust case against Google", "transed": 1, "url": "https://insights.som.yale.edu/insights/the-antitrust-case-against-google", "via": "", "real_tags": ["谷歌", "google", "rust", "case"]}, {"category": "", "categoryclass": "", "imagename": "6e32d6e6f95f61e42d10d823c6799b54.jpg", "infoid": 1006194, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开发人员编写测试以确保正确性，并允许安全地进行未来的更改。然而，随着功能数量的增加，测试的数量也在增加。考试是一把双刃剑。一方面，编写良好的测试捕获错误并维护程序的稳定性，但随着代码库的增长，大量测试会阻碍可伸缩性，因为它们需要很长时间才能运行，并增加间歇性测试失败的可能性。软件项目通常要求在合并到MASTER之前通过所有测试。这增加了所有开发人员的开销。间歇性的测试失败加剧了问题的恶化。间歇性失败的一些原因是数据库中的不稳定性HTTP连接/模拟随机生成器将状态泄露给其他测试：测试每次都会自己通过，但其他测试会根据顺序而失败。不幸的是，不能完全消除间歇性失败的测试，并且随着代码库的增长，发生间歇性失败的可能性也会增加。它们使已经很慢的测试套件变得更慢，因为现在您必须重试它们，直到它们通过为止。我并不是说不应该编写测试。质量保证、性能监控和通过及早捕获错误(而不是在生产中)来加速开发的好处大于坏处。不过，我们可以作出改善。因此，我的团队开始了使我们的持续集成(CI)更稳定、更快的旅程。我将分享动态分析系统来选择我们实现的测试，然后是我们探索过但决定不采用的其他方法。考试选择给我的生活带来了欢乐。我希望我能给你们带来同样的快乐。ShopifyTests的测试问题阻碍了这里的开发人员的工作效率。我们的单片式存储库的测试套件：每年有超过150,000个测试以20-30%的大小增长，在数百个码头容器上并行运行大约需要30-40分钟。每个拉请求都需要通过所有测试。开发人员要么等待测试，要么为上下文切换付出代价。在我们一年两次的调查中，构建稳定性和速度是一个反复出现的话题。所以我们的开发人员清楚地感觉到了这个问题。用测试解决这个问题关于优化代码的博客文章/文章/研究论文很多，不幸的是，关于测试的文章很少。事实上，我们了解到优化测试是不现实的，因为纯粹的数量和增长。我们还了解到，对于许多公司来说，这是一个未知的领域。随着我们研究的进展，很明显，正确的解决方案是只运行与代码更改相关的测试。对于充分利用语言灵活性的大型动态类型Ruby代码库来说，这是一个挑战。此外，Rails中的元编程以及代码库中影响应用程序行为的其他非Ruby文件(例如YAML、JSON和JavaScript)加剧了这一困难。什么是动态分析？动态分析本质上就是记录每个方法调用。我们运行每个测试并跟踪调用图中的所有文件。一旦有了调用图，我们就创建一个测试映射：对于每个文件，我们都会找到哪些测试在其调用图中包含该文件。通过查看哪些文件已被修改、添加、删除或重命名，我们可以查找需要运行的测试。您可以签出Rotcope和Tracepoint来记录Ruby应用程序的调用图。为什么要使用动态分析？Ruby是一种动态类型的语言，我们不能使用静态分析检索依赖图。因此，我们不知道代码的相应测试。在铁路1上运行Ruby动态分析的同时。它很慢，生成调用图是计算密集型的，而且我们不能对每一个PR都运行它。取而代之的是，我们对每个部署的委托运行动态分析。映射可能滞后于HEAD生成的映射滞后于主服务器的头部，因为它是异步运行的。要解决此问题，我们将运行至少满足以下条件之一的所有测试：根据当前分支的代码更改在当前分支上添加或修改上一次生成的映射的头部和当前分支的头映射测试之间添加或修改的测试3。存在无法跟踪的文件在调用图上存在无法跟踪的非Ruby文件，如YAML、JSON等。我们向Rails添加了自定义补丁，以跟踪其中一些补丁。例如，我们修补了I18n：：Backend类以跟踪YAML中的转换文件。对于尚未跟踪的文件更改，我们会运行每一个测试。元编程混淆调用路径我们在已知目录中添加了现有的元编程，并在文件路径上添加了全局规则以确定要运行哪些测试。我们不鼓励通过冰糕和其他链接进行新的元编程。一些失败的测试将不会被捕获动态分析生成的映射可能会与最新的主文件过期，有时失败的测试不会被选中并合并到主文件中。为了绕过这个问题，我们运行完整的测试套件e", "note_en": "Developers write tests to ensure correctness and allow future changes to be made safely. However, as the number of features grows, so does the number of tests. Tests are a double-edged sword. On one hand, well-written ones catch bugs and maintain a program’s stability, but as the code base grows, a high number of tests impedes scalability because they take a long time to run and increase the likelihood of intermittently failing tests. Software projects often require all tests to pass before merging to master. This adds overhead to all developers. Intermittently failing tests worsen the problem. Some causes of intermittently failing tests aretiminginstability in the databaseHTTP connections/mockingsrandom generatorstests that leak state to other tests: the test passes every single time by itself, but fails other tests depending on the order.Unfortunately, one can’t fully eradicate intermittently failing tests, and the likelihood of them occurring increases as the codebase grows. They make already slow test suites even slower, because now you have to retry them until they pass.I’m not implying that one shouldn’t write tests. The benefits of quality assurance, performance monitoring, and speeding up development by catching bugs early instead of in production outweigh its downsides. However, improvements can be made. My team thus embarked on a journey of making our continuous integration (CI) more stable and faster. I’ll share the dynamic analysis system to select tests that we implemented, followed by other approaches we explored but decided against. Test selection sparks joy in my life. I wish that I can bring the same joy to you.Problems with Tests at ShopifyTests impede developers’ productivity here. The test suite of our monolithic repository:has over 150,000 testsis growing by 20-30% in size annuallytakes about 30-40 min to run on hundreds of docker containers in parallel.Each pull request requires all tests to pass. Developers have to either wait for tests or pay for the price of context switching. In our bi-annual survey, build stability and speed is a recurring topic. So this problem is clearly felt by our developers.Solving the Problem with TestsThere’s an abundance of blog posts/articles/research papers on optimizing code, unfortunately few on tests. In fact, we learned that it’s unrealistic to optimize tests because of the sheer quantity and growth. We also learned that this is an uncharted territory for many companies.As our research progressed, it became apparent that the right solution was to only run the tests related to the code change. This was challenging for a large, dynamically typed Ruby codebase that makes ample use of the language flexibility. Furthermore, the difficulty was exacerbated by metaprogramming in Rails as well as other non-Ruby files in the code base that affect how the application behaves, for example, YAML, JSON, and JavaScript.What Is Dynamic Analysis?Dynamic analysis, in essence, is logging every single method call. We run each test and track all the files in the call graph. Once we have the call graphs, we create a test mapping: for every file, we find what tests have that file in its call graph. By looking at what files have been modified, added, removed, or renamed, we can look up the tests we need to run.You can check out Rotoscope and Tracepoint to record call graphs for Ruby applications.Why Use Dynamic Analysis?Ruby is a dynamically typed language, we can’t retrieve a dependency graph using static analysis. Thus, we don’t know the corresponding tests for the code.Downsides of Running Dynamic Analysis on Ruby on Rails1. It’s Slow.It’s computationally intensive to generate the call graphs, and we can’t run it for every single PR. Instead, we run dynamic analysis on every deployed commit.2. Mapping Can Lag Behind HEADThe generated mapping lags behind the head of the master because it runs asynchronously. To solve this problem, we run all tests that satisfy at least one of the following criteria:added or modified on the current branchadded or modified between the head of the last generated mapping and current branch headmapped tests per current branch’s code change3. There Are Untraceable FilesThere are non-Ruby files such as YAML, JSON, etc. that can’t be traced on the call graph. We added custom patches to Rails to trace some of them. For example, we patched the I18n::Backend class to trace the translation files in YAML. For changes to files that haven’t been traced, we run every single test.4. Metaprogramming Obfuscates Call PathsWe added existing metaprogramming in a known directory and added glob rules on the file path to determine which tests to run. We discourage new metaprogramming through Sorbet and other linters.5. Some Failing Tests Won’t Be CaughtThe generated mapping from dynamic analysis can get out of date with the latest master, and sometimes failing tests won’t get selected and get merged to master. To circumvent the issue, we run the full test suite every deploy and automatically disable any failing test, so other developers won’t be blocked from shipping their code. The full test suite runs asynchronously. Pull requests can get merged before the full test suite completes.Automatic disabling of failing tests sounds counterintuitive to many people. From what we observed, the percentage of pull requests with failing tests being merged to the master branch is about 0.06%. We also have other mechanisms to mitigate the risks, such as canary deploys and type checking using Sorbet. The code owners of the failing tests are notified. We expect developers to fix or remove the failures without blocking future deploys.How Was the Dynamic Analysis Rolled Out?In the experimentation phase of the new dynamic analysis system, the test-selection pipeline ran in parallel with the pipeline that runs the full test suite for each new PR. The recall of the new test selection pipeline was measured. Out of all the failing tests, we measured if the new pipeline selects the same failing tests. We didn’t care about the tests that pass because it’s only the failing tests that cause trouble.We measured our results using three metrics.Failure RecallWe define recall as the percentage of legitimately failing tests, excluding intermittently failing tests, that our system selected. We want this to be as close as possible to 100%. It’s hard to measure this accurately because of the occurrence of intermittently failing tests. Instead, we approximate the recall by looking at the number of consistently failing tests merged into master.After two months that the project has been active, out of the 8,360 commits that were merged, we’ve only failed to detect five failing tests that landed on master. We also managed to resolve most of the root causes of those missed failures, so the same problems don’t repeat in the future.We achieved a 99.94% recall.Speed ImprovementThe overall selection rate, the ratio of selected tests over total number of tests, is about 60%:Percentage of selected test files per buildAbout 40% of builds run fewer than 20% of tests. This shows that many developers will significantly benefit from our test selection system:Percentage of builds that selected fewer than 20% of all testsCompute TimeIn total, we’re saving about 25% compute time. This is measured by adding up the time spent preparing and running tests on every docker container in a build, and averaging that across all builds. It didn’t decrease more because a significant chunk of computing time is still used for setting up containers, databases, and pulling caches. Note that we’re also adding compute time by running the dynamic analysis for every deployed commit on master. We estimate that this will undo some, but not all of the infrastructure cost savings.Other Approaches We ExploredPrior to choosing dynamic analysis, we explored other approaches but ultimately ruled them out.Static AnalysisTo determine a dependency graph, we briefly explored using Sorbet, but this would only be possible if the entire code base was converted to strict Sorbet type. Unfortunately, the code base is only partially in strict Sorbet type and too big for my team to convert the rest.Machine LearningIt’s possible to use machine learning to find the dependency graph. Facebook has an excellent research paper [PDF] on it. We chose dynamic analysis at Shopify because we’re not sure if we have enough data to make the prediction, and we want to choose an approach that’s deterministic and reproducible.More Machines for TestsWe tried adding more machines for the test suite. Unfortunately, the performance didn’t increase linearly as we scaled horizontally. In fact, tests on average take longer as we increase the number of machines past a certain number. Increasing machines doesn’t reduce intermittently failing tests and it increases the possibility of failing connections to sidecars, thus increasing test retries.Benefits of Running Fewer TestsThere are three major benefits of selectively running tests:Developers get faster feedback from tests.The likelihood of encountering intermittently failing tests decreases, and. Thus, it increases the speed of developers further.CI costs less.Skepticism about Dynamic Analysis/Test SelectionBefore the feature was rolled out, many developers were skeptical that it would work. Frankly, I was one of them. Many people voiced their doubts both privately and openly. However, much to my surprise, after it went live, people were silent. On average, developers request running the full test suites on under 2% of the pull requests.If you’re in a similar situation, I hope our experience helps you. It’s hard for developers to embrace the idea that some tests won’t be run when the importance of tests is ingrained in our heads.If this sounds like the kind of problems you'd enjoy solving, come work for us. Check out the Software Development at Shopify (Expression of Interest) career posting and apply specifying an interest in Developer Acceleration.  ", "posttime": "2020-06-12 04:10:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "测试,joy", "title": "运行更少的测试来激发快乐", "title_en": "Spark Joy by Running Fewer Tests", "transed": 1, "url": "https://engineering.shopify.com/blogs/engineering/spark-joy-by-running-fewer-tests", "via": "", "real_tags": ["测试", "joy"]}, {"category": "", "categoryclass": "", "imagename": "a850ee7002ca5d143fb927be2191c136.png", "infoid": 1006192, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此次发布是朝着最终代表整个行业对VR和AR开放标准的支持迈出了一大步。Facebook基于Android的Oculus Quest单机版还包括对OpenXR的“原型”支持，Rift也有望获得对应用编程接口(API)的支持。个人电脑和基于Android的VR系统仍然存在重大差异，但OpenXR的更广泛支持总体上应该会让开发人员更容易通过单一API瞄准更多平台。\nValve的一份声明解释说：“有了OpenXR，开发者将第一次能够以一种允许他们跨越无数类型的硬件和软件平台的方式构建他们的内容。”多亏了Khronos集团和OpenXR的许多成员(AMD、ARM、Etic、Facebook、谷歌、HTC、微软、NVIDIA、高通、Unity、Valve等)的广泛努力，VR现在有了一个统一的API，使开发商能够将通用的VR支持带到他们的应用程序中。“。\nValve将发布对1.0.9 OpenXR版本的初始支持，开发者预览可以通过右击Steam库中的SteamVR Beta，选择属性，单击Betas选项卡，然后选择“Beta-SteamVR Beta Update”进入SteamVR Beta。\n我们对初始支持的定义是，SteamVR目前通过了95%的一致性测试。这意味着现在是开始测试的时候了，“Valve解释说。SteamVR的OpenXR实现在Windows上支持D3D11，在Windows和Linux上支持Vulkan。在Windows上对D3D12的支持正在进行中。“。\n伊恩·汉密尔顿(Ian Hamilton)是一名驻南加州的记者，也是UploadVR的执行主编。他从2015年开始全职负责虚拟现实业务，从2012年开始负责Oculus虚拟现实业务。他感兴趣的是创造VR和AR硬件和软件的人，他们的动机，以及这项工作对那些在模拟空间花费大量时间的人有什么影响。如果你有信息要传递给他，你可以在Twitter、Facebook或通过电子邮件给他发一条直接消息。", "note_en": "The release is a big step toward what should ultimately represent industry-wide support for an open standard in VR and AR. Facebook’s Oculus Quest Android-based standalone also  includes “prototype” support for OpenXR and Rift is also expected to gain support for the application programming interface (API) as well. There are still significant differences between PCs and Android-based VR systems, but the broader support of OpenXR should generally make it easier for developers to target more platforms with a single API.\n “With OpenXR, for the first time, developers will be able to build their content in a way that will allow them to span the myriad types of hardware and software platforms,” a  statement from Valve explains. “Thanks to The Khronos Group and the extensive hard work of OpenXR’s many members (AMD, ARM, Epic, Facebook, Google, HTC, Microsoft, NVIDIA, Qualcomm, Unity, Valve, and many more) VR now has a consolidated API to enable developers to bring universal VR support to their applications.”\n Valve is releasing initial support for the 1.0.9 OpenXR release and the developer preview can be accessed by opting into the SteamVR Beta by right-clicking SteamVR in your Steam library, selecting properties, clicking the betas tab and select ” beta – SteamVR Beta Update.”\n “Our definition of initial support is that SteamVR is currently passing 95% of conformance tests. This means now is the time to start testing things,” Valve explains. “SteamVR’s OpenXR implementation supports D3D11 on Windows, and Vulkan on both Windows and Linux. Support for both D3D12 on Windows is on the way.”\n   Ian Hamilton is a journalist based in Southern California and managing editor at UploadVR. He&#39;s covered VR full-time since 2015 as well as Oculus VR since 2012. He is interested in the people creating VR and AR hardware and software, their motivations, and how that work affects the people who spend significant time in simulated space. If you have information to pass along you can send him a direct message on Twitter, Facebook or via email.", "posttime": "2020-06-12 04:09:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,openxr,releases,支持", "title": "Value发布OpenXR预览版，OpenXR是VR和AR的开放标准", "title_en": "Valve releases preview of OpenXR, an open standard in VR and AR", "transed": 1, "url": "https://uploadvr.com/valve-openxr-steamvr-beta", "via": "", "real_tags": ["发布", "openxr", "releases", "支持"]}]