[{"category": "", "categoryclass": "", "imagename": "f9080d1935624c7f40c694cd5375e932.jpg", "infoid": 1067966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌已将主要隐私变化延迟到其Chrome浏览器，推回计划阻止第三方cookie，直到2023年底，确定如何保护用户，同时为网络发布者提供一种方式来赚钱。\n 去年，搜索巨头表示它会阻止世界＆＃39; S最广泛使用的浏览器接受叫做第三方cookie的短信，这些cookie有助于广告商，发布者和数据经纪人的个人资料，以帮助广告商针对您的目标广告。更改将防止广告商从后来向您的其他网站上显示减肥计划的广告，以防止您访问节食网站。\n   周四，谷歌推动了近两年的推动，允许自己更多的时间开发和测试保留第三方cookie的隐私替代方案，以及网站采取更改。该公司表示，它延迟了更改，将谷歌呼叫其隐私沙箱的哪些调整集合，为广告商和网络上的其他人进行了更好的课程。\n ＆＃34;我们需要以负责任的步伐移动，允许足够的时间讨论正确的解决方案和出版商以及广告业，以迁移他们的服务，＆＃34; Chrome Engineering Director Vinay Goel在博客帖子中说。 ＆＃34;这很重要，避免危害支持自由提供内容的许多网络发布商的商业模式。＆＃34;\n 延迟在强化硅谷巨头压力来修复互联网互联网上。像欧洲的法律和加州消费者隐私法案（CCPA）瞄准谷歌和其他公司想要微调他们提供的广告的数据收集。广告科技产业并不是永远改变课程，因为有人对Chrome的任何人不满意而有富裕的替代品。\n 所有Chrome＆＃39; S顶级竞争对手，包括Apple＆＃39; S Safari，Mozilla＆＃39; S Firefox，Microsoft＆＃39; S Edge and Brave软件＆＃39; s勇敢，在停止跟踪时比谷歌在停止跟踪中采取更具侵略的措施。如果您想坚持Chrome，浏览器扩展如Ghostery，Duckduckgo，Privacy Badger和Ublock Origin，旨在阻止跟踪器。\n 谷歌的一部分＆＃39;首先推动其计划的理由是，移动太快将鼓励跟踪公司使用的饼干跟踪方法而不是饼干。一种这样的方法，指纹识别，使用跟踪器来收集浏览器配置详细信息，例如您的版本＆＃39;重新使用和哪些字体＆＃39; ve下载了。具有足够的这些细节，跟踪器可以准确识别您。 \n谷歌认为，在这个阶段阻止了第三方饼干对使用网络的人来说实际上是糟糕的，因为它驱使跟踪公司涵盖指纹等方法。 ＆＃34;与cookie不同，用户无法清除其指纹，因此无法控制其信息是如何收集或使用的。我们认为这是一个可持续的长期投资，＆＃34; Goel在CNET的声明中说。\n  网站也移动到其他跟踪方法，如需要登录免费内容。这为它们提供了一个非常特定的标识符，用于分析您的行为，并可能与其匹配您的其他网站上的活动。\n 浏览器Don＆＃39; t块第一方cookie，由您网站的运营商设置为您＆＃39;重新访问或广告商提供广告。第一方Cookie帮助您在电子商务购物车中记住的任务，或者让您登录后续访问。但是，对于第三方Cookie阻止的一个广告技术解决方法是将与网站联系起来使用他们的第一方权限。\n 第一方cookie也是谷歌的棘手问题。它具有像搜索和youtube一样的巨型网站，让它设置第一方cookie。它还拥有一个大型在线广告业务，可以从Google＆＃39; cookie和跟踪信息中受益。其他广告公司不具有那种特权的状态，这就是欧洲委员会对谷歌开设反垄断调查的原因，据报道还在审查谷歌和＃39; S Cookie方法。\n 但Goel否认谷歌将获得优势。 ＆＃34;隐私沙箱技术不会对谷歌和＃39;广告产品或谷歌＆＃39;自己的网站，＆＃34提供优惠待遇或优势他告诉CNET。的确，谷歌致力于＆＃34;没有用于谷歌广告产品的数据优势＆＃34;在英国＆＃39;竞争和市场管理局开始调查谷歌广告科技竞争问题。\n 除了最终逐步淘汰第三方饼干外，谷歌正在努力致力于联合学习的队列学习，或絮状物，与广告与大群人相匹配，而不是个人。有了它，浏览器监视您的浏览历史记录，并将您的数千人组成，其中具有与队列相似的行为。注意到，注意到特定的队列正在访问一种类型的网站，然后可以向其他网站上的其他成员展示广告。\n 弗洛夫有其批评者。勇敢反对絮状物，与Vivaldi浏览器一样。电子前沿基金会是一种数字版权非营利组织，说弗洛夫是一个＆＃34;可怕的想法。＆＃34; Mozilla得出结论，弗洛夫让网站＆＃34;学到很多关于你的努力，而不是今天需要消耗。＆＃34; \n谷歌也正在制定絮凝物。 它计划将反馈纳入更改和新一轮测试。 ", "note_en": "Google has delayed a major privacy change to its   Chrome browser, pushing back a plan to  block third-party cookies until late 2023 as it determines how to protect users while providing web publishers a way to make money.\n Last year,  the search giant said it would prevent the world&#39;s most widely used browser from accepting the snippets of text called third-party cookies that help advertisers, publishers and data brokers profile you to help advertisers target ads toward you. The change would prevent an advertiser that recorded your visit to a dieting website from later showing you ads for weight loss programs on other sites, for example.\n   On Thursday, Google pushed that move out by nearly two years, allowing itself more time to develop and test privacy-preserving alternatives to third-party cookies, and for websites to adopt the changes. The company said it had delayed the change, part of a collection of adjustments to what Google calls its  Privacy Sandbox, to chart a better course for advertisers and everyone else on the web.\n &#34;We need to move at a responsible pace, allowing sufficient time for public discussion on the right solutions and for publishers and the advertising industry to migrate their services,&#34; Chrome Engineering Director Vinay Goel said in a blog post. &#34;This is important to avoid jeopardizing the business models of many web publishers which support freely available content.&#34;\n The delay comes amid intensifying pressure on Silicon Valley giants to fix the internet&#39;s privacy problem. Laws like  Europe&#39;s GDPR and the  California Consumer Privacy Act (CCPA) target the data collection that Google and other companies want for fine tuning the advertisements they deliver. The ad tech industry doesn&#39;t have forever to change course because anyone dissatisfied with Chrome&#39;s pace has abundant alternatives.\n All Chrome&#39;s top rivals, including  Apple&#39;s Safari,  Mozilla&#39;s Firefox,  Microsoft&#39;s Edge and  Brave Software&#39;s Brave, take more aggressive measures at stopping tracking than Google. If you want to stick with Chrome, browser extensions like  Ghostery,  DuckDuckGo,  Privacy Badger and  uBlock Origin, are designed to block trackers.\n One part of Google&#39;s rationale for pushing back its plan is that moving too fast will encourage tracking companies to use sneakier tracking methods than cookies. One such method, fingerprinting, uses trackers to gather browser configuration details, such as the version you&#39;re using and which fonts you&#39;ve downloaded. With enough of those details, trackers can identify you accurately.\n Google believes blocking third-party cookies at this stage is actually bad for people using the web because it drives tracking companies to covert approaches such as fingerprinting. &#34;Unlike cookies, users cannot clear their fingerprint, and therefore cannot control how their information is collected or used. We don&#39;t think that&#39;s a sustainable long term investment,&#34; Goel said in a statement to CNET.\n  Websites also are moving to other tracking methods like requiring logins for free content. That provides them a very specific identifier for profiling your behavior and potentially matching it to your activity on other sites that know it.\n Browsers don&#39;t block first-party cookies, which are set by the operator of the website you&#39;re visiting or advertisers contributing ads. First-party cookies help with tasks like remembering what&#39;s in your e-commerce shopping cart or keeping you logged in for subsequent visits. One ad tech workaround for third-party cookie blocking, though, is to tie in with websites to use their first-party privileges.\n First-party cookies also are a thorny issue for Google. It has giant websites like search and YouTube that let it set first-party cookies. It also has a big online advertising business that can benefit from Google&#39;s cookies and tracking information. Other advertising companies don&#39;t have that privileged status, which is why the  European Commission opened an antitrust investigation on Google&#39;s ad technology and the US  Justice Department reportedly also is examining Google&#39;s cookie approach.\n Goel denied that Google will get an edge, though. &#34;Privacy Sandbox technologies will not give preferential treatment or advantage to Google&#39;s advertising products or to Google&#39;s own sites,&#34; he told CNET. Indeed,   Google committed to &#34; no data advantage for Google advertising products&#34; after the UK&#39;s Competitions and Markets Authority   started investigating Google ad-tech competition issues.\n In addition to eventually phasing out third-party cookies, Google is working on a technology called  federated learning of cohorts, or FLOC, that matches ads to large groups of people, rather than individuals. With it, the browser monitors your browsing history and groups you with thousands of others with similar behavior into a cohort. Advertisers, noticing that a particular cohort is visiting a type of website, can then show ads to other members of that cohort on other sites.\n FLOC has its critics.  Brave opposes FLOC, as does the  Vivaldi browser. The Electronic Frontier Foundation, a digital rights nonprofit, says  FLOC is a &#34;terrible idea.&#34; And  Mozilla concluded FLOC lets sites &#34;learn a lot about you with far less effort than they would need to expend today.&#34;\n Google is working on revisions to FLOC, too. It plans to incorporate feedback for changes and a new round of testing.", "posttime": "2021-06-24 21:23:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,发布,延迟,delay", "title": "谷歌将延迟计划从2022年初到2023年初阻止第三方Cookie，找到保护隐私的方法而不伤害依赖于依赖于依赖的发布者 ", "title_en": "Google will delay plans to block third-party cookies from early 2022 to late 2023, to find ways to protect privacy without hurting ad-dependent publishers", "transed": 1, "url": "https://www.cnet.com/news/google-delays-chromes-cookie-blocking-privacy-plan-by-nearly-2-years/", "via": "", "real_tags": ["google", "谷歌", "发布", "延迟", "delay"]}, {"category": "", "categoryclass": "", "imagename": "2660fca2ffa5b2be2e260e5322018dd8.png", "infoid": 1067965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您的企业在哪里采用AI采用曲线？采取我们的AI调查来了解。\n JW Player，一家主要企业和出版公司的视频流和分析平台，从LLR合作伙伴提供了一系列资金的一系列资金中筹集了1亿美元。\n 在2005年推出，JW Player最初是一个开源产品，继续为YouTube的早期版本提供电源。虽然JW Player没有长期开源，但是在非商业用途的创意公众许可下提供，它已成为顶级数字视频播放器之一，拥有ViaCom，Zoom，Newegg和标签等企业和媒体客户蜂师。\n  纽约的公司索赔10亿人口每月观看JW播放器供电的视频，跨越27亿台设备。\n  根据互动广告局（IAB）的数据，Digital广告收入仅飙升了12.2％至美国去年仅为1400亿美元。数字视频广告，专门地看到了最高的增长，增加了20.6％至超过260亿美元。为帮助，JW Player提供了一个HTML5视频播放器，使公司能够在任何网站上嵌入他们的视频（使用广告），其中包含软件开发套件（SDK），用于将JW播放器添加到其本地移动应用程序。此外，该公司还提供其他工具，如“物品匹配”，它自动将相关视频插入JW播放器网络的相关在线文章中。\n 此外，营销人员和广告商喜欢为所有花费的视频和广告证明，并优化事物以最大限度地提高投资回报 - 这是数据进入磨损的地方。 JW Player为地表实时视频活动提供分析，例如哪些视频是最受欢迎的，以及对视频在不同平台和设备上进行的洞察的见解。\n  在现在之前，JW Player筹集了约4600万美元，最新的现金注入公司现已充分利用蓬勃发展的数字视频市场，这有助于其过去的“记录视频流增长和强大的盈利能力”年。同样，公开交易的JW Player竞争对手Bistgove在2020年3月开始的12个月期间在12个月期间看到了其估值三倍 - 似乎是繁荣的数字视频经济。 \n最新的资金也在JW Player首次收购的高跟鞋上进行了热烈的，这是在上个月抢购的黄路队以扩展到Live和按需视频流中，包括数字版权管理（DRM）。 在此次收购的日子宣布后，JW Player指出了拉丁美洲和亚太地区的“材料上涨和销售涌入”，亚太地区的秘密。  VidtureBeat＆＃39; S使命是成为技术决策者的数字城市广场，以获得有关转型技术和Transact的知识。您网站提供有关数据技术和策略的基本信息，以指导您的领导您的组织。 我们邀请您成为社区的成员，访问：门控思想领导者内容和对我们奖化事件的折扣访问，如转换2021：了解更多  成为会员 ", "note_en": "Where does your enterprise stand on the AI adoption curve? Take our  AI survey to find out.\n JW Player, a video streaming and analytics platform for major enterprise and publishing companies, has raised $100 million in a series E round of funding from LLR Partners.\n Launched in 2005, JW Player was initially an open source product which went on to power one of the early versions of YouTube. While JW Player is no long open source, instead being  offered under a creative commons license for non-commercial use, it  has emerged as one of the top digital video players, with enterprise and media customers such as Viacom, Zoom, Newegg, and Tag Heuer.\n  The New York-based company claims 1 billion people view a JW Player-powered video each month, spanning 2.7 billion devices.\n  According to data from the Interactive Advertising Bureau (IAB), digital advertising revenue surged 12.2% to nearly $140 billion in the U.S. alone last year. Digital video advertising, specifically, saw the highest growth, rising 20.6% to more than $26 billion. To help, JW Player serves an HTML5 video player that enables companies to embed their videos (replete with ads) on any website, with software development kits (SDKs) for adding JW Player to their native mobile apps. Additionally, the company offers other tools such as “article matching,” which automatically inserts relevant videos into relevant online articles across the JW Player network.\n Moreover, marketers and advertisers like to justify all those video and ad dollars spent, and optimize things to maximize the return on its investments — which is where data enters the fray. JW Player offers analytics to surface real-time video activity, such as which videos are proving most popular, as well as insights on how videos are performing across different platforms and devices.\n  Prior to now, JW Player had  raised around $46 million, and with its latest cash injection the company is now well-positioned to capitalize on a booming digital video market which has helped it attain “record video streaming growth and strong profitability” over the past year. Similarly, publicly-traded JW Player  rival Brightcove saw its valuation triple in the 12-month period starting in March 2020 — the digital video economy, it seems, is thriving.\n The latest funding also comes hot on the heels of JW Player’s first ever acquisition, after it  snapped up Vualto last month to extend its reach into live and on-demand video streaming, including digital rights management (DRM). In the days after this acquisition was announced, JW Player noted a “material uptick and influx of sales,” particulary across Latin America and Asia-Pacific regions.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-06-24 21:23:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "player,llr,视频", "title": "JW Player，ViaCom等主要公司使用的视频流和分析服务，从LLR合作伙伴提高了100万系列 ", "title_en": "JW Player, a video streaming and analytics service used by major companies like Viacom, raises $100M Series E from LLR Partners", "transed": 1, "url": "https://venturebeat.com/2021/06/24/video-streaming-and-analytics-platform-jw-player-raises-100m/", "via": "", "real_tags": ["player", "llr", "视频"]}, {"category": "", "categoryclass": "", "imagename": "b501e5ad995a04e0aa52715715882710.jpg", "infoid": 1067964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于渴望甜食猪肉球的3％，可能是停止饮酒的时间\n  英国狂欢者被要求他们最喜欢的宿醉治疗，有一些坦率的奇怪的结果。\n 在调查中调查的那些由Tabasco Sauce的制造商委托，宣称，一份完整的英式早餐是迄今为止他们最喜欢处理沉重之夜的后果的方式，32％的人缩小了竖起大拇指。\n 面向击败头痛的讲台和毛茸茸的舌头被强烈的咖啡（26％）填充，它在近死热中将培根三明治（25％）狭窄地缩短了培根三明治（25％）。\n   其他旧收藏夹也非常出色，热黄油烤面包在13％的13％上注册了一个可敬的九九。豆类上的豆豆和炒鸡蛋分别达到了第十四和第十四次，每年11％。\n     剩下的疼痛减少的伎俩，有些人可能会被贬低到年轻的繁荣，如＆＃34;一个能量饮料＆＃34;那里，其中六分之有15％，或＆＃34;草莓奶昔＆＃34;，这是第19次最受欢迎的8％。\n 但是，必须询问七分之七百分之七十九年的思想的正确性，他们在第22位将鸡肉周梅宁放置在第22位，一个士兵的咸味和营养丰富的煮沸的鸡蛋之一。 \n3％的受访者建议与宿醉的一天应该最好地开始用甜味和酸猪球（第30次）显然患有由酒精以外的东西引起的宿醉。可能破裂。\n  还有人建议最好不要在没有帮助的情况下面对一只眼睛后面的混蛋，其中62％的人要求暗示处理它的最佳方式是＆＃34;与早午餐见面的朋友。＆＃34 ;\n  同一朋友可能帮助您进入该状态的可能性最初可能导致44％的受访者表示，他们喜欢解剖前一天晚上的事件，这将是一个很好的讨论早午餐的主题。\n 事实上，76％的被问及的人说，第二天与朋友一起吃饭有时比夜晚更好。这是对英国的悲惨起诉书，如果在类似折磨的朋友的Sullen公司在Sullen Company中努力努力，这是一个令人悲伤的刺激性的习惯比让你在那里的晚上更有趣。\n 结果肯定会抬起眉毛关于人们在Covid锁定期间做的事情，直到最近，他们一直在一夜之间被严格地普通话，正如与朋友在一起的话，以便在之后讨论它。\n 登记册只能承担调查结果反映了过去18个月左右过去18个月的一定程度的一般性思考。虽然我们毫无疑问，我们刚刚通过的强迫隔离的漫长时期不会被彼一，但从长时间沉思的宿醉性质以及你更愿意正在经历它们的人。\n     Google于周四介绍了开源项目的统一漏洞架构，继续其目前的运动来围起开源软件的安全性。 \n模式定义了数据库的结构。它＆＃39;数据库中对象的蓝图，它通知如何查询和交换数据。\n  尚未命名的漏洞互换架构旨在通过提供常见的交换格式来实现难以连接电流，碎片漏洞数据库的空白。它旨在以与实际使用的打开源包生态系统的命名和版本控制约定相匹配的方式强制执行软件版本规范。\n  继续阅读\n  Roam的条约最终在灰烬中：O2裂缝，加入竞争对手，为欧盟的重型用户添加数据漫游费用\n     我们在公共汽车的一侧没有看到它。英国听到Brexit公民投票结果的五年，O2已经成为英国的最后一个网络，以便为其客户重新推出欧洲的漫游费用。\n  对于其薪酬每月划桨者，超过25GB的每千兆字节现在将以每GB 3.50英镑收费。\n  在发送给客户的消息中，运营商写道：“由于您的每月英国数据津贴超过25GB，您仍然可以在欧洲区域使用您的数据。但它现在受到25GB的漫游限制。一旦您达到此限制，您将收取额外费用的3.50英镑/ GB。“ \n继续阅读\n  容器是来自Hyperscale-Land的游客。当你邀请他们时，他们应该尊重你的方式\n     注册辩论欢迎来到最新的注册辩论，其中作家讨论技术主题，而您 - 读者 - 选择获胜的论点。格式很简单：我们提出了一项动议，议案的论点将于周一和周三营运这个议案，以及周二和星期四的论点。\n  在本周期间，您可以在使用嵌入式民意调查中支持您支持的投票，选择您是否有利于或反对运动。最终得分将于星期五公布，揭示了对抗或反对争论最受欢迎。它＆＃39;这取决于我们的作家，让你说服他们投票。\n  继续阅读\n  令人痛苦地等待Windows 11的发射的粉丝已经被视为今天的一点举报＆＃39;大事事件，与微软结尾给我们所有......手指？\n  ＆＃34;窗户，＆＃34感觉＆＃39;劝告微软。基于Vista和Windows 8，我们＆＃39; D必须说我们＆＃39;重新获得即将发生的厄运感。或许我们应该感到蓬松......就像云一样。毕竟，这是微软旅行的方向。 \n继续阅读  英国看门狗罚款Biz£130万英镑用于40,000+直接营销呼叫，以选择退出的人  颜色外套被指控撒谎，粗鲁和咄咄逼人，并挂在冷酷的受害者身上  基于East Sussex的家庭改善Biz面临罚款130,000英镑，用于向上升900,000名未经请求的营销呼吁，该营销呼吁已注册电话偏好服务（TPS）。  2019年8月1日至去年3月31日在2019年至3月31日之间制作了近970,000个连接的呼叫，其中有超过452,000人的办公室（ICO），其中超过452,000名以TPS注册 或企业相同的。  ICO表示，当毫无戒心的冷呼叫伤亡人员收到超过50名投诉时，它将其倾向于公司＆＃39; 这包括重复呼叫，告诉公司不再与他们联系。  继续阅读 \n铁路压力集团呼吁英国政府在新的氢气动力列车后面抛出其重量，以帮助现有的滚动股，并在轨道上恢复全国＆＃39。\n  铁路行业协会（RIA） - 它可以追溯到140多年来追溯到其成员繁忙的蒸汽洛杉矶 - 希望政府支持试点项目，以测试氢的可行性不仅是作为一种清洁的燃料来源而是如此一种提升经济增长的方法。\n  ＆＃34;氢火车将对常规电气化一起发挥至关重要的作用 - 随着英国希望在2050年，＆＃34开发净零经济性。在简短的笔记中说RIA。\n  继续阅读\n  Cheeky服装公司法国连接，也被称为FCUK，已成为勒索软件的最新受害者，与一个帮派理解与Revil相关联，通过选择私人内部数据。\n  在1972年由现任首席执行官Stephen Marks成立，法国联系在采用Not-Exte-rude-uments口号＆＃34; fcuk＆＃34;在2000年代初的广告中。最初成立为中市女性＆＃39; S时尚品牌，自从展开到男装，手表，洗漱用品，甚至眼镜。\n  可悲的是，攻击者可以理解与Revil Ransomware Gang相关，无需这样的光学增强功能，以发现公司的安全漏洞＆＃39; S后端系统。结果，它们与一套内部公司数据进行了＆＃39。 \n继续阅读\n  在无状态环境中部署最终的状态代码是A＆＃39;棘手的业务＆＃39; IDC Guru Opines.\n     领先的分析师警告大型非技术公司在Kubernetes中进行数据库部署，将这种方法作为企业称为“新兴技术”。\n  虽然开发人员可能需要灵活性和敏捷性，但无状态容器乐队承诺，Carl Olofson，Research副总裁，Data Management Software，IDC宣传了企业部署的谨慎。\n  经验丰富的数据库专家在Postgres Vision 2021会议上发表演讲，说：“你真的需要确保你使用完全成立的功能。你想要保守。 Kubernetes是开源的，所以更新和测试和所有这些都在提交到熄灭的计时器时遵循相当慢的正式过程。 Kubernetes仍在发展迅速。喜欢任何技术：如果你试图将你的企业致力于在新兴技术上运行的功能，那么你正在接受一些风险。“\n  继续阅读\n  允许云PABX，VPN和数据共享，以便当地人可以参与跨国工作流程 \n印度的电信部在希望他们成为一个更具吸引力的离岸外离岸目的地的规则。修订后的规则使呼叫中心和类似企业可以使用云中的资源，并且作为全球客户服务组织的一部分，更容易运作。\n  更改的核心允许印度称之为“其他服务提供商”（OSPS） - 一个术语，描述通过语音传播的任何业务 - 使用联网资源，同时删除大量繁文缛节。\n  以前的安排意味着这些公司发现它难以作为全球运营的一部分工作，因为它们被迫在印度内使用电信基础设施，以提供详细的技术模式，以解释他们作为繁重注册过程的一部分进行路由呼叫的详细技术模式，并且无法分享近海实体的数据。\n  继续阅读\n  英国的广告看门狗给了一个社会距离，自由的手工消毒拍摄到一个坚定的营销，它声称可以清除导致Covid-19呼吸系统疾病的冠状病毒的空气。\n  Go-Vi Eradicator 19的在线广告声称在分开的第二次中Zap Zap两次 - 如果是真的，那么不应该嗅到。障碍是，在广告标准权威（ASA）的某人。\n  监管机构佩戴了戴着薄壁的戴上掩盖，戴着制造商＆＃39所声称它被“证明摧毁了冠状病毒细胞”，并希望了解更多关于这个“空气净化系统”，它被声称，已经通过独立测试了实验室。 \n继续阅读  Google Drive云存储储物柜的神秘“安全更新”将断开某些文件的链接  管理员给予整个月的一个月。 明智地选择 - 在7月23日之后，用户赢得了＆＃39; t被告知发生了什么＆＃39;正在发生什么  Google已建议其工作区生产力套件的管理员设置，以提高其驱动器云存储储物柜的安全性，但修复程序将断开某些文件的链接。  AD Giant对Workspace Admins的咨询没有提到更新的原因，除了说这是一个增强。  提供的小细节提供了“更新”更改某些Google驱动器文件和文件夹的URL。 新链接包括文件的URL中的资源密钥。“  继续阅读 \n注册 - 对科技界的独立新闻和意见。 部分情况出版 ", "note_en": "For the 3% who craved sweet and sour pork balls, it might be time to stop drinking\n  British revellers have been asked for their favourite hangover cures, with some frankly bizarre results.\n Those polled in the survey, which was commissioned by the makers of Tabasco sauce, declared that  a full English breakfast was by far  their favourite way of dealing with the consequences of a heavy night, with 32 per cent giving it the thumbs-up.\n The podium places for confronting a thumping headache and a furry tongue were filled out by strong coffee (26 per cent), which narrowly edged out bacon sandwiches (25 per cent) into third in a near dead heat.\n   Other old favourites also featured highly, with hot buttered toast registering a respectable ninth on 13 per cent. Beans on toast and scrambled eggs reached thirteenth and fourteenth respectively on 11 per cent each.\n     Of the remaining pain-reduction ploys, some could be put down to youthful exuberance, such as &#34;an energy drink&#34;, which came sixth with 15 per cent, or &#34;a strawberry milkshake&#34;, which was the 19th most popular response on 8 per cent.\n But questions must be asked as to the rightness of mind of the seven per cent of boozers who contrived to place chicken chow mein in 22nd place, one above the splendidly savoury and nutritious boiled egg with soldiers.\n   The 3 per cent of respondents who suggested a day with a hangover should best be started with sweet and sour pork balls (30th) are clearly suffering from a hangover caused by something other than alcohol. Possibly crack.\n  It was also suggested that it is better not to face up to a bastard behind the eyes without help, with 62 per cent of those asked suggesting that the best way of dealing with it was &#34;meeting friends for brunch.&#34;\n  The likelihood that those very same friends probably helped you get into that state in the first place is probably what led 44 per cent of respondents to say they enjoyed dissecting the events of the night before, which would be a good subject to discuss over the brunch.\n Indeed, 76 per cent of those questioned said that meeting to eat with friends the following day was sometimes better than the night out itself. It is a sad indictment of Britain&#39;s socialising habits if struggling with a hangover in the sullen company of similarly afflicted friends is more fun than the evening that got you there.\n The results will certainly raise eyebrows about what people have been doing during the COVID lockdown as until very recently, going for a night out at all was strictly verboten, as was meeting up with friends to discuss it afterwards.\n The Register can only assume the results of the survey reflect a certain level of wishful thinking over the past 18 months or so on the part of those polled. Although we have no doubt the lengthy period of enforced isolation we have all just been through would not be mutually exclusive from a prolonged contemplation of the nature of hangovers and who you would prefer to be experiencing them with.\n     Google on Thursday introduced a unified vulnerability schema for open source projects, continuing its current campaign to shore up the security of open source software.\n  A schema defines the structure of a database. It&#39;s a blueprint for the objects within the database and it informs how data can be queried and exchanged.\n  The as-yet-unnamed  vulnerability interchange schema aspires to bridge gaps that make it difficult to connect current, fragmented vulnerability databases by providing a common interchange format. It aims to enforce software version specification in a way that matches the naming and versioning conventions that open source package ecosystems actually use.\n  Continue reading\n  Treaty of Roam finally in ashes: O2 cracks, joins rivals, adds data roaming charges for heavy users in EU\n     We didn&#39;t see this on the side of a bus. Five years to the day that Britain heard the results of the Brexit referendum, O2 has caved as the last of the UK&#39;s Big Four networks to re-introduce roaming charges in Europe for its customers.\n  For its pay monthly punters, each gigabyte of data over 25GB will now be charged at £3.50 per GB.\n  In a message sent to customers, the carrier wrote: “As your monthly UK data allowance is over 25GB, you can still use your data in our Europe Zone. But it’s now subject to a Roaming Limit of 25GB. Once you’ve reached this limit you’ll be charged an additional cost of £3.50/GB.”\n  Continue reading\n  Containers are visitors from hyperscale-land. They should respect your ways when you invite them in\n     Register Debate  Welcome to the latest Register Debate in which writers discuss technology topics, and you – the reader – choose the winning argument. The format is simple: we propose a motion, the arguments for the motion will run this Monday and Wednesday, and the arguments against on Tuesday and Thursday.\n  During the week you can cast your vote on which side you support using the embedded poll, choosing whether you&#39;re in favor or against the motion. The final score will be announced on Friday, revealing whether the for or against argument was most popular. It&#39;s up to our writers to convince you to vote for their side.\n  Continue reading\n  Fans eagerly awaiting the emission of Windows 11 have been treated to a teaser of today&#39;s big event, ending with Microsoft giving us all... the finger?\n  &#34;Feel what&#39;s next for Windows,&#34; exhorts Microsoft. Based on Vista and Windows 8, we&#39;d have to say we&#39;re getting a sense of impending doom. Or perhaps we should be feeling fluffy… like a cloud. Which, after all, is the direction of travel for Microsoft.\n  Continue reading\n  UK watchdog fines biz £130k for 90,000+ direct marketing calls to folk who had opted out\n  Colour Coat accused of lying, being rude and aggressive, and hanging up on cold-call victims\n     A home improvement biz based in East Sussex is facing a fine of £130,000 for making upwards of 900,000 unsolicited marketing calls to individuals and businesses that had enrolled on the Telephone Preference Service (TPS).\n  Colour Coat of St Leonards-on-Sea made almost 970,000 connected calls between 1 August 2019 and 31 March last year, the Information Commissioner&#39;s Office (ICO) found, of which more than 452,000 were to folk or entities registered with TPS or the corporate equivalent.\n  The  ICO said it was tipped off to the company&#39;s practices when it received more than 50 complaints from unsuspecting cold-call casualties. This included repeated calls to people that told the company not to contact them again.\n  Continue reading\n  A railway pressure group is calling on the UK government to throw its weight behind a new fleet of hydrogen-powered trains to help modernise existing rolling stock and get the nation&#39;s transport policy back on track.\n  The  Railway Industry Association (RIA) – which can trace its roots back more than 140 years to when its members were busy building steam locos – wants government to support pilot projects to test the viability of hydrogen not only as a clean source of fuel but as a way to boost economic growth.\n  &#34;Hydrogen trains will have a vital role to play – alongside conventional electrification – as the UK looks to develop a Net Zero economy by 2050,&#34; said the RIA in a briefing note.\n  Continue reading\n  Cheeky clothing firm French Connection, also known as FCUK, has become the latest victim of ransomware, with a gang understood to be linked to REvil having penetrated its back-end - making off with a selection of private internal data.\n  Founded in 1972 by current chief executive Stephen Marks, French Connection made a name for itself when it adopted the not-actually-rude-honest slogan &#34;FCUK&#34; in its advertising in the early 2000s. Originally founded as a mid-market women&#39;s fashion brand, the company has since expanded into menswear, watches, toiletries, and even glasses.\n  Sadly, attackers understood to be related to the REvil ransomware gang needed no such optical enhancements to spot a security vulnerability in the company&#39;s back-end systems. As a result, they&#39;ve made off with a trove of internal company data.\n  Continue reading\n  Deploying the ultimate stateful code in a stateless environment is a &#39;tricky business&#39; IDC guru opines\n     A leading analyst has warned big, non-tech companies against database deployments in the Kubernetes, dubbing the approach as “emerging technology” for enterprises.\n  While developers might want the flexibility and agility the stateless container orchestrator promised, Carl Olofson, research vice president, data management software, IDC urged caution with enterprise deployments.\n  Speaking at the  Postgres Vision 2021 conference this week, the seasoned database expert said: “You really need to make sure you&#39;re using functions that are well established. You want to be conservative. Kubernetes is open source, so the updates and the testing and all that, follows a rather slow formal process from the time that submission comes to the timer that goes out. Kubernetes is still rapidly evolving. Like any technology: if you&#39;re trying to commit your enterprise to functions that run on an emerging technology, then you are accepting some risks.”\n  Continue reading\n  Allows cloud PABXs, VPNs, and data sharing, so that locals can participate in multinational workflows\n     India’s department of telecommunications has tweaked some rules in the hope they make the nation a more attractive offshoring destination. The revised rules make it possible for call centres and similar businesses to use resources in the cloud, and more easily operate as part of global customer service organisations.\n  The core of the changes is permitting what India calls “other service providers” (OSPs) — a term that describes any business conducted remotely by voice — to use networked resources, while removing plenty of red tape.\n  Previous arrangements meant such companies found it hard to work as part of a global operation, as they were forced to use telecoms infrastructure within India, to provide detailed technical schemas explaining how they routed calls as part of an onerous registration process, and could not share data with offshore entities.\n  Continue reading\n  The UK’s advertising watchdog has given a socially distanced, liberally hand-sanitised slap to a firm marketing a gizmo it claimed could clear the air of the coronavirus that causes the COVID-19 respiratory disease.\n  The online ad for the Go-Vi Eradicator 19 claimed to zap both airborne and surface nasties in a split second – which if true, should not be sniffed at. Snag is, someone at the Advertising Standards Authority (ASA)  did.\n  The regulator took a close mask-wearing look at the manufacturer&#39;s claim that it was “proven to destroy Coronavirus cells” and wanted to know more about this “air purification system” that, it was claimed, had been tested by independent laboratories.\n  Continue reading\n  Mysterious ‘security update’ to Google Drive cloud storage locker will break links to some files\n  Admins given a whole month to sort it out. Choose wisely — after July 23rd, users won&#39;t be told what&#39;s happening\n     Google has advised administrators of its Workspace productivity suite that it’s set to improve security of its Drive cloud storage locker, but that the fix will break links to some files.\n  The ad giant’s advisory to Workspace admins doesn’t mention the reason for the update, other than saying it’s an enhancement.\n  The little detail offered states that the update “changes the URLs for some Google Drive files and folders. The new links include a resource key in a file’s URL.”\n  Continue reading\n  The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2021-06-24 21:22:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上衣,english", "title": "“全英文”上衣英国宿醉固化调查 ", "title_en": "“Full English” tops UK hangover-cure survey", "transed": 1, "url": "https://www.theregister.com/2021/06/24/hangover_survey/", "via": "", "real_tags": ["上衣", "english"]}, {"category": "", "categoryclass": "", "imagename": "d1c9a8316ab781e63c8621e2b669c3b8.jpg", "infoid": 1067962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我不确定他们在首尔的Hyundai HQ自助餐厅喂它们，但无论是什么，它的工作。这些过去几年的韩国汽车制造商一直在热门条纹，在设计，建立质量或效率方面上涨了董事会的游戏。 2022 Tucson混合交叉又是另一个支持该声明，提供夏普的外观，有趣的内部和38英里/ 100km）的数据点，仅为29,050美元。\n Tucson于2004年首次出现在交叉时代的曙光上。对于这一代，现代延长了北美市场的Tucsons的翼展，为108.5英寸（2,756毫米）。总长度仍然是可管理的182.3英寸（4,630毫米），宽度为73.4英寸（1,864毫米），高度为65.6英寸（1,666毫米）。如此，汽车＆＃39;造型是主观的，但在这种情况下，我认为设计总监Sangyup Lee＆＃39; S团队做了一个不错的工作。他们＆＃39;重新召集大分风格＆＃34;参数动态。＆＃34;在前面，日间运行灯融入了现代格栅的侧面，在后方有独特的尾灯，让我提醒我一些福特野马mach-e。\n  普通的Tucsons由2.5L发动机提供动力，今年晚些时候在此后的插件混合动力Tucson提供动力，但今天我们＆＃39;只关注Not-Plug-in Hybrid。这采用1.6L涡轮增压的四缸汽油直喷引擎，其自身几乎与更大的发动机一样强大，并且更多的扭矩，提供180 HP（134kW）和195磅-CT（264nm）。但由于它的一个混合动力车，它还获得了59 HP（44.2千瓦），195年LB-FT（264nm）电动机的好处，即＆＃39;从1.5 kWh离子聚合物电池喂食。它与曾经，它并不像只加上电动机和内燃机的总输出一样简单（因为它们赢得了＆＃39;同时制造峰值电源），但总产量为226 HP（169 kW）和258磅（350nm）。\n 全轮驱动是Tucson混合动力车上的标准版，六速自动变速器也是如此。燃油效率是令人印象深刻的38英里MPG，尽管限量装饰落到37 MPG（6.4L / 100km）。 ＆＃39;由于一些NVH改进，包括声学挡风玻璃和更好的轮子衬垫。\n 如果不起眼，那么道路的方式是完全可以接受的。在一周的过程中，我平均36.5 mpg（6.4 l / 100km）而不尝试，这正是我想要的混合交叉。 Tucson Hybrid将是我通过蜿蜒的峡谷路爆炸的首选，但为学校运行或通勤＆＃39;难以破坏乘坐舒适和效率的水平。\n  我宁愿对我与图森＆＃39的内饰有多感到惊讶。一个分裂级别的破折号缠绕在门上 - 我第一次在上一代奥迪A8和信息娱乐系统和主开关系统和主开关面板上突出的东西，从上层突出，直到划分。一个10.25英寸的数字主仪器显示器设置为驾驶员前部划线的较低级别（限制尺寸;较小的修剪级别使用较小的显示器进行。和主要仪表板的UI主题提供相当数量的定制，以及64种不同颜色的环境LED照明。\n 在中央控制台上，您＆＃39; ll找到了传输的按钮控制，基本上与Sonata混合中的相同。在那里有一个体面的储物口袋，我们的汽车配备了手机的无线充电垫。 \n自从Hyundai位于Tucson Hybrid＆＃39; S锂离子电池，在后排座椅上，作为非混合动力版本-38.8立方英尺（1,098升）的货物室内的货物室。使用，或74.5立方英尺（2,109升），后座折叠。谈到后排座位，归功于较长的轴距，如果你坐在那里，你有41.3英寸（1,049毫米）的腿室，比你坐在前面的话，0.2英寸（5毫米）。\n  我确实有一个投诉，它＆＃39; s的电容面板，寿命在信息娱乐系统下方。你必须用它来改变卷或改变气候控制，但是没有触觉反馈，甚至在一周之后，如果我想让它更温暖，更冷，更响亮，甚至不得不看看小组。或更安静。旋钮或实际的物理按钮将有很长的路要解决这个问题。但除此之外，信息娱乐系统（10.25英寸触摸屏如果您参加37,350美元的Tucson Hybrid Limited，或者如果您不使用8英寸的单位）是不可告知的。\n 高级驾驶员辅助系统（ADAS）的标准包包括自适应巡航控制和车道保持;前进碰撞警告和紧急制动（将识别行人和骑自行车者以及汽车）;交界处和后交通警惕;和盲点监控，包括主仪器面板上的视频显示屏，当您激活转弯信号时，侧面＆＃39;盲点。有限的装饰还增加了后应急制动，以及停车传感器和摄像机。\n 如果我印象深刻，我就是。虽然我认为爱好者仍然倾向于Mazda CX-30驱动器，大多数人都aren＆＃39; t爱好者，以及一些仍然优先考虑燃油效率。如果这听起来像你和你＆＃39;重新寻找高效的紧凑型交叉在30,000-40,000美元之间，你可以做到比考虑Tucson混合的程度。 ", "note_en": "I&#39;m not sure what they feed them at the Hyundai HQ cafeteria in Seoul, but whatever it is, it&#39;s working. The Korean automaker has been on a hot streak these past few years, having upped its game across the board, whether that&#39;s in design, build quality, or efficiency. The 2022 Tucson Hybrid crossover is yet another data point to support that claim, offering sharp looks, an interesting interior, and 38 mpg (6.2 L/100km), starting at just $29,050.\n The Tucson first appeared back at the dawn of the crossover era in 2004. For this generation, Hyundai has lengthened the wheelbase of Tucsons destined for the North American market to 108.5 inches (2,756 mm). Overall length is still a manageable 182.3 inches (4,630 mm), with a width of 73.4 inches (1,864 mm) and a height of 65.6 inches (1,666 mm). As ever, a car&#39;s styling is subjective, but in this case I think design director SangYup Lee&#39;s team did a decent job. They&#39;re calling the faceted style &#34;Parametric Dynamics.&#34; At the front, the daytime running lights are incorporated into the sides of the Hyundai grille, and at the rear there are distinctive taillights that remind me somewhat of the Ford Mustang Mach-E.\n  Normal Tucsons are powered by a 2.5L engine, and there&#39;s a plug-in hybrid Tucson due later this year, but today we&#39;re only concerned with the not-plug-in Hybrid. This uses a 1.6 L turbocharged four-cylinder gasoline direct-injection engine, which on its own is almost as powerful as the bigger engine as well as being more torquey, providing 180 hp (134kW) and 195 lb-ft (264 Nm). But since it&#39;s a hybrid, it also gets the benefit of a 59 hp (44.2 kW), 195 lb-ft (264 Nm) electric motor that&#39;s fed from a 1.5 kWh lithium-ion polymer battery. As ever, it&#39;s not quite as simple as just adding the total outputs of the electric motor and internal combustion engine together (since they won&#39;t both make peak power at the same time), but total output is 226 hp (169 kW) and 258 lb-ft (350 Nm).\n All-wheel drive is standard on the Tucson Hybrid, as is a six-speed automatic transmission. Fuel efficiency is an impressive 38 mpg across the board, although the Limited trim drops to 37 mpg (6.4 L/100km) combined. It&#39;s relatively quiet on the move, thanks to some NVH improvements, including an acoustic windshield and better wheel liners.\n On-road manners were perfectly acceptable, if unremarkable. Over the course of a week I averaged 36.5 mpg (6.4 L/100km) without trying, which is exactly what I want from a hybrid crossover. The Tucson Hybrid wouldn&#39;t be my first choice for a blast through a sinuous canyon road, but for the school run or commute it&#39;s hard to fault the level of ride comfort and efficiency.\n  I was rather surprised with how taken I was with the Tucson&#39;s interior. A split-level dash wraps around to the doors—something I first saw on the previous-generation Audi A8—and the infotainment system and main switchgear panel project down from the upper level, bisecting the dash. A 10.25-inch digital main instrument display is set into the lower level of the dash in front of the driver (in Limited trim; the lesser trim levels make do with a smaller display). And a fair amount of customization is available in terms of the UI theme of the main instrument panel, as well as 64 different colors of ambient LED illumination.\n On the center console you&#39;ll find the pushbutton controls for the transmission, which are basically the same as in the  Sonata Hybrid. There&#39;s a decent array of storage pockets, and our car was equipped with a wireless charging pad for your phone.\n Since Hyundai located the Tucson Hybrid&#39;s lithium-ion battery under the rear seats, there&#39;s as much cargo room in the back as the non-hybrid version—38.8 cubic feet (1,098 L) with the rear seats in use, or 74.5 cubic feet (2,109 L) with the rear seats folded flat. Speaking of rear seats, thanks to the longer wheelbase, if you sit back there you&#39;ve got 41.3 inches (1,049 mm) of leg room, 0.2 inches (5 mm) more than if you sat in the front.\n  I do have one complaint, and it&#39;s the capacitive panel that lives just below the infotainment system. You have to use this to change the volume or alter the climate control, but there&#39;s no haptic feedback, and even after a week I still had to look at the panel if I wanted to make it warmer, colder, louder, or quieter. Knobs or actual physical buttons would go a long way to resolving that. But other than that, the infotainment system (10.25-inch touchscreen if you go for the $37,350 Tucson Hybrid Limited, or an 8-inch unit if you don&#39;t) is unobjectionable.\n The standard package of advanced driver assistance systems (ADAS) includes adaptive cruise control and lane keeping; forward collision warning and emergency braking (which will recognize pedestrians and cyclists, as well as cars); junction and rear cross-traffic alerts; and blind spot monitoring, including a video display on the main instrument panel that shows you that side&#39;s blind spot when you activate a turn signal. The Limited trim also adds rear emergency braking, as well as parking sensors and cameras.\n If I sound impressed, I am. While I think enthusiasts will still prefer the way the  Mazda CX-30 drives, most people aren&#39;t enthusiasts, and some who are still prioritize fuel efficiency. If that sounds like you and you&#39;re looking for an efficient compact crossover between $30,000-$40,000, you could do a lot worse than to consider the Tucson Hybrid.", "posttime": "2021-06-24 20:41:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tucson,hybrid,混合", "title": "Hyundai的2022 Tucson Hybrid是一个迷人和高效的交叉 ", "title_en": "Hyundai’s 2022 Tucson Hybrid is a charming and efficient crossover", "transed": 1, "url": "https://arstechnica.com/cars/2021/06/hyundais-2022-tucson-hybrid-is-a-charming-and-efficient-crossover/", "via": "", "real_tags": ["tucson", "hybrid", "混合"]}, {"category": "", "categoryclass": "", "imagename": "a34bf04b0f5b5fbf23c7e2edfc882e0d.jpg", "infoid": 1067961, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它是公司最大的垂直特定基金 - 相当多。\n Andreessen Horowitz的2018 Crypto Fund迎来了3亿美元的LP承诺及其第二基金，该基金于去年四月封闭，速度为515万美元。新的多亿美元基金不仅展示了机构支持者如何对加密货币更加舒适，而且还如何在管理层中的资产如何迅速膨胀，以与其他深层储备的公司竞争，包括永远的虎全球。\n  LPS可能不太谨慎，因为在直接上市的第一批交易时，在COINBASE的股权等同于约112亿美元后，仍有机会迫使加密，尽管股票最近几个月在加密市场有超过30％压缩。\n 一些公司的其他主要加密赌注包括今年春季达到75亿美元的NBA顶级射门制造商实验室。 BlockChain基础设施启动DFINTY在九月举行的95亿美元估值。去年，该公司领导了一个unis的系列，这是一个被预先是国内生态系统的主要球员。除了股权投资之外，A16Z还对货币博士们造成了重大赌注。\n 新人上个月的早期报告报告A16Z是针对20亿美元的加密基金，并且在最近几周大多数加密货币潜水之前，他们已经卸下了一些加密控股。\n  Crypto Fund III将继续由GPS Chris Dixon和Katie Haun管理，但该公司还开始在Crypto垂直周围旋转更强大的管理团队。\n Anthony Albanese，他去年从纽约证券交易所加入该公司，已被任命为该司的COO。此前曾担任现任乔·贝登和全球区块链商务委员会主席的高级顾问，将是A16z Crypto的全球政策负责人。 Rachael Horwitz还将作为A16z Crypto的经营合作伙伴领先的营销和通信而推出;作为Coinbase的第一个通信VP之后离开Goog​​le。 \n其他人也以咨询能力为单位，包括企业家亚历克斯价格以及几个可能是一个有助于监管机动的人，包括法案汉语，原委员会，以及最近担任秘书长的布伦特麦克林斯 国际事务的财政部。 ", "note_en": "It’s the firm’s largest vertical-specific fund ever — by quite a bit.\n Andreessen Horowitz’s 2018 crypto fund ushered in $300 million of LP commitments and its second fund, which it closed in April of last year, clocked in at $515 million. The new multi-billion dollar fund not only showcases how institutional backers are growing more comfortable with cryptocurrencies, but also how Andreessen Horowitz’s assets under management have been quickly swelling to compete with other deep-pocketed firms including the ever-prolific Tiger Global.\n  LPs are likely far less wary to take a chance on crypto after Andreessen Horowitz’s stake in Coinbase equated to some $11.2 billion at the time of the direct listing’s first trades, though the stock has slid back some 30% in recent months as the crypto market has shrunk.\n Some of the firm’s other major crypto bets include NBA Top Shot maker Dapper Labs which  hit a $7.5 billion valuation this spring. Blockchain infrastructure startup  Dfinity raised at a $9.5 billion valuation this past September. Last year, the firm  led the Series A of Uniswap, which is poised to be a major player in the Ethereum ecosystem. In addition to equity investments, a16z has also made major bets on the currencies themselves.\n An earlier report from  Newcomer last month reported a16z was targeting a $2 billion crypto fund and that they had already unloaded some of their crypto holdings before most cryptocurrencies took a major dive in recent weeks.\n  Crypto Fund III will continue to be managed by GPs Chris Dixon and Katie Haun, but the firm has also begun spinning out a more robust management team around the crypto vertical.\n Anthony Albanese, who joined the firm last year from the NYSE, has been appointed COO of the division. Tomicah Tillemann, who previously served as a senior advisor to now-President Joe Biden and as chairman of the Global Blockchain Business Council, will be a16z Crypto’s Global Head of Policy. Rachael Horwitz is also coming aboard as an Operating Partner leading marketing and communications for a16z crypto; leaving Google after a stint as Coinbase’s first VP of Communications as well.\n A couple other folks are also coming on in advisory capacity, including entrepreneur Alex Price and a couple others who will likely be a tad helpful in regulatory maneuverings including Bill Hinman, formerly of the SEC, and Brent McIntosh, who recently served as Under Secretary of the Treasury for International Affairs.", "posttime": "2021-06-24 20:40:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "fund,crypto,加密", "title": "Andreessen Horowitz Triples在BlockChain初创公司中，带有大量的22亿美元的Crypto Fund III ", "title_en": "\n\t\t\t\tAndreessen Horowitz triples down on blockchain startups with massive $2.2 billion Crypto Fund III\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/andreessen-horowitz-triples-down-on-blockchain-startups-with-massive-2-2-billion-crypto-fund-iii/", "via": "", "real_tags": ["fund", "crypto", "加密"]}, {"category": "", "categoryclass": "", "imagename": "334bd300bf9539401622965e5139a3f2.jpg", "infoid": 1067960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Taptap Send，它提供从八个国家到15个国家的“免费”移动汇款服务，筹集了1340万美元，这将使用它将继续扩大其客户的范围和服务。\n 15个接收者国家包括世界上最贫穷的国家，这是最艰难的服务，以及与其中一些最贫困人口的新兴市场 - 刚果博士，马里和马达加斯加，而八个发起者国家也包括其中一些来自这些国家的人们移民的共同点 - 英国，比利时，加拿大，法国和意大利。\n  A系列由Canaan Partners和Reid Hoffman联合主导，其他未命名的投资者也参与。\n 有很多公司在西欧等美国或地区这样的国家推出和建立服务：那里有很多钱，以及具有允许他们投资新技术的收入的大量消费者和企业并简单地做更多。当然，这并不意味着其他，富裕的人口统计数据不存在，或者也不需要新技术;但为他们建造通常不太有利可图，更有风险。\n Taptap发送是在尝试使用这方面探讨技术承诺的初创公司之一，并以观点为支付这种趋势。该公司的商业模式通过收取任何佣金或转移的任何其他费用，反而使削减外汇。它从头开始建立了整个技术堆栈，并说这可以让它通过较低的汇率，通常低于可能为同一市场的其他人员。在此之上，这里的比例经济在这里：有更好的速率将推动更多的用户，这反过来可能并不意味着更好的边缘，而是更高的交易和整体回报。\n 该起始是一个以前为联合国工作的发展经济学家Michael Faye的第三个创业郊游。在Taptap发送之前，Fay创立了Giveridirectly和Segovia。在每个企业中，他试图采取同样的方法：建立金融技术，改善居住在新兴市场的人。 GivedInectly（仍然强大）为慈善捐款做了这一点 - 这是一个非政府组织，即设立捐赠活动，其中个人和大企业可以贡献，接收国人民可以通过移动货币转移直接获得资金。塞戈维亚（由皇家代理银行收购）为B2B使用案例进行了这一点 - 它建立了一个移动货币转移的服务，其他汇款公司可以通过API来为其企业提供为业务供电。\n Taptap发送可以被认为是在空间中的Faye的帽子伎俩，以乘以帮助人们的汇款概念，并将其作为C2C业务建立：旨在派遣人们“回到家”钱的个人。 \n“Taptap发送正在利用移动货币和其他配送网络的这种结构变化，为客户提供最快，最优惠的客户服务，”他在面试中告诉TechCrunch。\n 在一起，跨境汇款是一个大量的市场，当您考虑既定渠道时，每年价值约5400亿美元，以更为“非正式的”方法（可以通过一个人从一个国家旅行的人乘坐货币而像多数）其他）估计是几乎相同的大小。事实上，它们也是更有价值的，甚至外国直接投资：世界银行已跟踪汇款超过2019年捐赠的资金。\n 移动技术在此方面发挥了重要作用，使得送达和收到金钱的既容易，但也打开了糟糕的演员潜在的开发，捕养了为便利性使用服务而捕获的人清楚地清除实际定价如何崩溃。\n 出于这个原因，联合国设定了汇款定价和佣金的目标，对于任何公司的3％，汇款和佣金不高于总送达的3％ - 以确保球员在体积上更关注的方式和更少的利润率。 Taptap发送说，它是公开致力于该目标的空间中唯一的公司（它尚未击中它，似乎）。\n 该公司尚未披露其大小或客户的许多数字，但Faye告诉我在去年的总体增长5倍，并发布了毛利率。 “即使发生了所有事情，你确实看到了这种大规模的数字化增加，”他对Covid-19及其对业务的影响。他的空间中的大量竞争也不仅仅是西联汇款和金钱等公司，而且很多汇总汇率，汇率较小，世界汇款等等，还有更多没有“汇款”的名字。 。 “这很容易看看汇款，并说它拥挤，但是在Facebook之前缩放或社交网络之前是视频会议，”他说。\n  “该公司有一个细微且强大的策略，迈克尔已经建立到他们进入的每个市场中的最低价格提供商。随着世界迅速转向数字钱包和电子货币，它为汇款公司创造了一个机会，通过直接向那些钱包发送资金来创造更加神奇的经验，“迦南普通合伙人Brendan Dickinson指出。 “Taptap发送尽可能多地节省客户，因此，几乎总是市场上最便宜的玩家。所有这一切都使得经济上可行的汇款 - 而且这样做，扩大了所发送的总市场和汇款数量。这种方法与客户强烈谐波，因为Taptap发送的大量增长已经为90 +％有机。“ ", "note_en": "Taptap Send, which provides a “free” mobile money transfer service from eight countries to 15 others, has raised $13.4 million, money that it will be using to continue expanding its scope and the services that it provides to its customers.\n The 15 receiver countries include some of the poorest countries in the world that are the hardest to service, plus emerging markets with some of the poorest populations — DR Congo, Mali, and Madagascar among them — while the eight originator countries include some of the most common places to which people from these countries emigrate — United Kingdom, Belgium, Canada, France and Italy among them.\n  The Series A was co-led by Canaan Partners and Reid Hoffman, with other unnamed investors also participating.\n There is a reason that a lot of companies launch and build services in countries like the U.S. or regions like Western Europe: there is a lot of money there, and specifically consumers and businesses with the kind of income that allows them to invest in new technologies and simply to do more. Of course, that doesn’t mean that other, less wealthy demographics don’t exist, or don’t also need new technology; but building for them is usually less lucrative and more risky.\n Taptap Send is among the startups that is trying to approach the promise of tech with this in mind, and with a view to bucking that trend. The company’s business model works by way of charging no commission or any other fees for transfers, instead making a cut on foreign exchange. It has built its whole tech stack from the ground up and says that this lets it pass on lower exchange rates to its customers, typically lower than others that might be serving the same markets. On top of this, there is an economy of scale principle at play here: having better rates will drive more users, which in turn might not mean better margins but a higher volume of transacting and more returns overall.\n The startup is the third entrepreneurial outing for Michael Faye, a development economist who previously worked for the United Nations. Before Taptap Send, Fay founded  GiveDirectly and  Segovia. In each business, he’s tried to take the same approach: building financial technology to improve the lot of people living in emerging markets. GiveDirectly (still going strong) did this for philanthropic donations — it’s an NGO that sets up donation campaigns where individuals and big businesses can contribute, and people in receiving countries can directly get the funding via mobile money transfers. Segovia (acquired by  Crown Agents Bank) did this for B2B use cases — it built a mobile-money-transfer-as-a-service, which other money transfer companies could use to power their businesses, by way of an API.\n Taptap Send can be thought of as Faye’s hat trick in the space, taking the bigger concept of remittances used to help people, and building it as a C2C business: aimed at individuals who are sending people “back home” money to live on.\n “Taptap Send is taking advantage of this structural change in mobile money and other distribution networks to offer what we hope is the fastest and best price service to customers,” he told TechCrunch in an interview.\n Taken together, cross-border remittances is a massive market, worth some $540 billion annually when you consider the established channels, with more “informal” methods (which can be as analogue as passing money via a person making a trip from one country to the other) estimated to be of nearly the same size. They are also, in fact, more valuable even than foreign direct investment: the  World Bank has tracked that remittances overtook the money donated by states in 2019.\n Mobile technology has played a big part in that, making it easier both to send and receive money, but it’s also opened the door to a lot of potential exploitation by bad actors, preying on people who might use a service for convenience and not be fully clear on how the actual pricing breaks down.\n For that reason, the UN has set a goal for remittance pricing and commissions to be no higher for any company than 3% of the total sent — one way to ensure that players focus more on volume and less on margins. Taptap send says that it’s the only company in the space that has publicly committed to that goal (it has yet to hit it, it seems).\n The company is not yet disclosing many numbers on its size or customers served but Faye tells me business overall grew 5x in the last year, and is posting a gross profit. “Even with everything happening you did see this massive increase in digitization,” he said of Covid-19 and its impact on business. He’s also undeterred by the vast amounts of competition in the space, which includes not just companies like Western Union and Money Gram but lots and lots of smaller remittance startups like Remitly, World Remit, and many more without the word “remit” in their names. “It’s easy to look at remittance and say it’s crowded, but so was video conferencing before Zoom or social networking before Facebook,” he said.\n  “The company has a nuanced, yet powerful strategy that Michael has put into place to allow [it] to be the lowest-cost provider in every market they enter. As the world rapidly shifts toward digital wallets and e-money, it creates an opportunity for remittance companies to create an even more magical experience by sending funds directly to those wallets,” noted Brendan Dickinson, a general partner at Canaan. “Taptap Send gives as much of cost savings as possible to the customer, and as a result, is almost always the cheapest player in the market. All of that makes it economically viable to send smaller remittances – and in doing so, expands the total market and volume of remittances sent. This approach is strongly resonating with customers, as Taptap Send’s massive growth has been 90+% organic.”", "posttime": "2021-06-24 20:40:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,money,汇款", "title": "Taptap发送获得13.4米，旨在获得价格有意识的新兴市场用户的无费用 ", "title_en": "\n\t\t\t\tTaptap Send gets $13.4M for a no-fee money transfer service aimed at price-conscious emerging market users\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/taptap-send-gets-13-4m-for-a-no-fee-money-transfer-service-aimed-at-price-conscious-emerging-market-users/", "via": "", "real_tags": ["获得", "money", "汇款"]}, {"category": "", "categoryclass": "", "imagename": "cb12c162f0ecd3fa3e3a2d69aa20d251.jpg", "infoid": 1067959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天签证后几个月的举动已经放弃了收购格子，另一个受欢迎的开放银行创业。最初，签证计划花费53亿美元获得美国的启动。但该公司必须在进入监管墙后呼出收购。\n TINK提供单个API，以便客户可以从自己的应用程序和服务连接到银行帐户。例如，您可以利用TINK的API访问帐户语句，定期发起付款，获取银行信息并刷新此数据。\n  虽然银行和金融机构现在都必须提供由于欧盟支付服务指令PSD2而提供开放的银行界面，但没有单一标准。 TINK融合了3,400家银行和金融机构。\n App开发人员可以使用同一API呼叫与各种金融机构的银行账户互动。正如您可能已经猜到的那样，它大大简化了采用开放银行功能。\n 300银行和Fintech Startups使用Tink的API访问第三方银行信息 - 客户包括PayPal，BNP Paribas，美国运通和Lydia。总体而言，TINK覆盖欧洲的2.5亿银行客户。\n 基于瑞典斯德哥尔摩，渗透运营应在收购后常用。签证计划保留品牌和管理团队。\n 根据CrunchBase数据，Tink已从黎明首都，欧洲景观，HMI首都，洞察力合作伙伴，PayPal Ventures，Creades，Charecore Capital等人中筹集了超过3亿美元。 \n“在过去的十年里，我们在欧洲的领先开放的银行平台上，我们已经无情地建立了努力，我们对整个团队创造在一起的整个团队，”Tink Co-Forder and Ceo DanielKjellén说 陈述。 “我们建立了令人难以置信的事情，同时我们只划伤了表面。”  “加入签证，我们将能够比以往任何时候都更快地移动。 签证是下一阶段的Tink旅程的完美合作伙伴，我们对这款员工，客户和金融服务的未来带来了令人难以置信的兴奋。“ ", "note_en": "Today’s move comes a few months after Visa abandoned its acquisition of  Plaid, another popular open banking startup. Originally, Visa planned to spend $5.3 billion to acquire the American startup. But the company had to call off the acquisition after running into a  regulatory wall.\n Tink offers a single API so that customers can connect to bank accounts from their own apps and services. For instance, you can leverage Tink’s API to access account statements, initiate payments, fetch banking information and refresh this data regularly.\n  While banks and financial institutions now all have to offer open banking interfaces due to EU’s Payment Services Directive PSD2, there’s no single standard. Tink integrates with 3,400 banks and financial institutions.\n App developers can use the same API call to interact with bank accounts across various financial institutions. As you may have guessed, it greatly simplifies the adoption of open banking features.\n 300 banks and fintech startups use Tink’s API to access third-party bank information — clients include PayPal, BNP Paribas, American Express and Lydia. Overall, Tink covers 250 million bank customers across Europe.\n Based in Stockholm, Sweden, Tink operations should continue as usual after the acquisition. Visa plans to retain the brand and management team.\n According to  Crunchbase data, Tink has raised over $300 million from Dawn Capital, Eurazeo, HMI Capital, Insight Partners, PayPal Ventures, Creades, Heartcore Capital and others.\n “For the past ten years we have worked relentlessly to build Tink into a leading open banking platform in Europe, and we are incredibly proud of what the whole team at Tink has created together,” Tink co-founder and CEO Daniel Kjellén said in a statement. “We have built something incredible and at the same time we have only scratched the surface.”\n “Joining Visa, we will be able to move faster and reach further than ever before. Visa is the perfect partner for the next stage of Tink’s journey, and we are incredibly excited about what this will bring to our employees, customers and for the future of financial services.”", "posttime": "2021-06-24 20:39:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "获得,acquire,银行", "title": "签证以获得开放银行平台的态度超过20亿美元 ", "title_en": "\n\t\t\t\tVisa to acquire open banking platform Tink for more than $2 billion\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/visa-to-acquire-open-banking-platform-tink-for-more-than-2-billion/", "via": "", "real_tags": ["获得", "acquire", "银行"]}, {"category": "", "categoryclass": "", "imagename": "e3edf8588c82e1ab7ef1432749a7f758.jpg", "infoid": 1067958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Andreessen Horowitz正在推出一款多亿美元的基金，以投资于挥发性生态系统＆＃39;第39页的投注将与互联网一样有影响力。\n 由Marc Andreessen和Ben Horowitz成立的硅谷风险投资公司宣布周四宣布其新的22亿美元的加密货币基金。它计划在跨越区间和数字资产启动中部署该资本。\n  ＆＃34;此基金的规模与我们面前的机会的大小表示：Crypto不仅是财务的未来，而且与初期的互联网一样，有望改变我们生活的所有方面，＆＃ 34; Katie Haun和Chris Dixon，在博客帖子中说道，逃跑的合作伙伴＆reessen＆＃39; cryptocurrency group。\n 公司＆＃39;在三年前推出的第一个密码专注的基金，在现在被称为＆＃34; Crypto冬天。＆＃34;那一年，比特币的价值在2017年的高度升高了大约80％。最新基金也出现在比特币的另一个看跌时刻。\n 世界＆＃39;原来的加密货币从4月份高达60,000美元以来大约一半的价值。本周单独，它＆＃39;轨道损失20％。亨恩和迪克森指出了资产类＆＃39; S波动性，而且说＆＃34;价格可能会波动，但创新继续增加每个周期。＆＃34;\n ＆＃34;我们认为，下一波计算创新将由加密，＆＃34驱动;合作伙伴写道，补充说他们＆＃39;重新＆＃34;关于加密＆＃39;＆＃34;\n 该公司已知为Facebook，Instagram，Lyft和Pinterest等公司的早期投注。 Andreessen Horowitz于2013年通过Coinbase首次进入数字资产空间。Coinbase今年通过直销上市公开，并从中市时间高出50％。 \nAndreessen Horowitz也是Facebook支持数字货币项目天秤座的早期投资者，现称为DIEM，已经经历了一系列的重塑和面临全球监管机构的反对。\n 该公司在Opeansea和Dapper Lab等公司中有股份，推动了最近的NFT热潮，并表示计划专注于＆＃34;分散金融。＆＃34;也被称为＆＃34; defi，＆＃34;用于描述传统金融应用的术语，如贷款或银行，建立在比特币的相同技术上。该公司表示计划持有这些加密投资十年或更长时间。\n 这些数字资产投资是由前司法部检察官和迪克森的合作伙伴，在加入Andreessen Horowitz之前创立并跑了两项初创企业的伙伴。 Haun帮助推出了司法部和第39位的加密政府任务组，并在第一个高调的加密货币和与丝绸之路上工作。\n Andreessen Horowitz还宣布了一系列新员工，包括前证券和交流总监BILL HINMAN，他将作为咨询伙伴加入公司。 Rachael Horwitz领导了Twitter，Google和Facebook的通信，加入作为操作伙伴。 ", "note_en": "Andreessen Horowitz is launching a multibillion-dollar fund to invest in a volatile ecosystem it&#39;s betting will be as influential as the internet.\n The Silicon Valley venture capital firm, founded by Marc Andreessen and Ben Horowitz, announced its new $2.2 billion cryptocurrency-focused fund on Thursday. It plans to deploy that capital across blockchain and digital asset start-ups.\n  &#34;The size of this fund speaks to the size of the opportunity before us: crypto is not only the future of finance but, as with the internet in the early days, is poised to transform all aspects of our lives,&#34; Katie Haun and Chris Dixon, partners who run Andreessen&#39;s cryptocurrency group, said in a blog post.\n The company&#39;s first  crypto-focused fund was launched three years ago, during what&#39;s now known as &#34;crypto winter.&#34; That year, the value of bitcoin cratered roughly 80% from the highs in 2017. The latest fund also comes at another  bearish moment for bitcoin.\n The world&#39;s original cryptocurrency has lost roughly half its value since the high near $60,000 in April. This week alone, it&#39;s on track for a 20% loss. Haun and Dixon noted the asset class&#39;s volatility, and said &#34;prices may fluctuate but innovation continues to increase through each cycle.&#34;\n &#34;We believe that the next wave of computing innovation will be driven by crypto,&#34; the partners wrote, adding that they&#39;re &#34;radically optimistic about crypto&#39;s potential.&#34;\n The firm is known for early bets on companies like  Facebook, Instagram,  Lyft and  Pinterest. Andreessen Horowitz made its first move into the digital asset space through  Coinbase in 2013. Coinbase went public via a direct listing this year, and is down roughly 50% from its listing day high.\n  Andreessen Horowitz is also an early investor in Facebook-backed digital currency project libra, now known as diem, which has gone through a series of rebranding and faced opposition from global regulators.\n The firm has  stakes in companies like OpeanSea and Dapper Labs, powering the recent NFT boom and said it plans to focus on &#34;decentralized finance.&#34; Also known as &#34;defi,&#34; the term used to describe traditional finance applications, like lending or banking, built on the same technology that underlies bitcoin. The firm said it plans to hold these crypto investments for a decade or more.\n These digital asset investments are being driven by partners Haun, a former Justice Department prosecutor, and Dixon, who founded and ran two start-ups before joining Andreessen Horowitz. Haun helped  launch the Justice Department&#39;s first government task force for crypto and worked on the first high-profile cryptocurrency-related case, Silk Road.\n Andreessen Horowitz also announced a wave of new hires for the fund, including former Securities and Exchange Director Bill Hinman, who will join the firm as an advisory partner. Rachael Horwitz, who led communications at Twitter, Google and Facebook, joined as an operating partner.", "posttime": "2021-06-24 20:32:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "加密,horowitz", "title": "Andreessen Horowitz为其第三基金筹集了2.2亿美元，专注于加密初创公司和加密货币 ", "title_en": "Andreessen Horowitz raises $2.2B for its third fund focused on crypto startups and cryptocurrencies", "transed": 1, "url": "https://www.cnbc.com/2021/06/24/andreessen-horowitz-launches-2point2-billion-crypto-fund.html", "via": "", "real_tags": ["加密", "horowitz"]}, {"category": "", "categoryclass": "", "imagename": "3b34b7790bb0976ad103ec965cce9157.jpg", "infoid": 1067957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Speedy Cloud Data Warehouse Startup Firebolt Analytics Inc.正在看起来像一个非常热门的前景，确实在一个全方位的一轮资金中降落1.27亿美元后。\n 新投资者黎明首都和K5全球LED系列赛季，与天使投资者和以前投资者等投资者，如Zeev Ventures，TLV合作伙伴，贝塞尔风险伙伴和角度创立，迄今为止将扣除率筹集成164亿美元。\n 该一轮仅仅七个月才能在公司系列的一个资金之后，似乎验证其云数据仓库的索赔比其竞争对手快100倍。\n Firebolt正在进行更多已建立的云播放器，如雪花Inc.以及传统的内部部署数据仓库，这些数据仓库是硬件和软件的组合，这些硬件和软件统一来自多个来源的数据并对它执行查询。\n Firebolt的云数据仓库专为对大型数据集的极快分析而设计。该公司审议它可以为在Tberabytes或甚至是卑鄙的信息上进行的查询提供的副本性能，这归功于其能够比替代数据仓库服务快高达182倍的数据。\n 该公司解释说，它的快速表现来自许多电源云数据仓库的内部开发技术。它们包括定制，基于成本的优化器，调整结构化查询语言查询其用户输入以提高其速度。它还使用称为稀疏索引的技术来减少查询检索的不必要数据量，从而消除了多余的计算。\n Firebolt承诺的几乎实时查询完成对许多企业来说都非常有用。用于分析大数据集的团队通常仅根据性能约束查询该信息的小子集。通过给予这些团队来查询整个数据集，它说，Firebolt可以提供更准确和详细的见解。这是因为它更快的性能意味着分析更多数据变得更经济和实用。 \nFirebolt平台的另一个优点是该公司表示，它专门与开发人员建造。它允许通过应用程序编程接口和软件开发套件来100％对平台进行编程控制，这使得根据其致辞，可以更轻松地创建丰富的数据应用程序。\n Firebolt的数据仓库可作为在Amazon Web服务上运行的软件服务提供的软件服务，根据他们使用的计算，存储和网络资源的成本收取的客户，以及年度订阅费。\n 与公司产品的相似之处和更新的雪花的相似性在两种服务之间不可避免地绘制了比较，但Firebolt首席执行官Eldad Farkash（如图所示，右边的首席运营官Saar Bitner）告诉SilicOnangle，他没有专注于任何个人竞争对手。相反，他表示，该公司只是专注于解决最具挑战性的客户问题。\n “分析产业有一个值差距，”他说。 “数据仓库具有丰富的功能和高级服务，但它们往往缺乏某些工作负载所需的性能。目前通过缺乏数据仓库的灵活性的单一目的技术满足了这些需求。我们认为Firebolt可以是客户选择的数据仓库，因为我们能够做两者。“\n Farkash声称Firebolt的平台足够快，足够强大，它将推动数据仓库，从内部商业智能用例中推广，以便为更广泛的数据密集型应用提供电量。他指出，新类型的数据应用正变得越来越普遍，需要更高的性能，不可通过其他服务随时获得。\n “随着数据卷的增长和数据使用增长，应用程序的性能问题显着强化，”Farkash表示。 “即使他们的表现现在没问题，许多公司已经在寻找一个接下来，因为他们的数据商店随着时间的推移而形成性能问题。”\n 首席执行官解释说，许多Firebolt的客户非常“技术前进”工程团队，运行现代数据堆栈，建立需要提供交互式分析的数据应用。 \n自以前的资金回合以来，该公司声称自犯规犯了很大的牵引力。在过去的六个月里，它已经将员工向100增加了一倍，并表示今天它计划在未来12个月内再次加倍。它还吸引了关键人员，如Looker Data Sciences Inc.创始人Keenan Rice，他们将前进。此外，该公司还谈到了“利益爆炸性增长”并声称添加了一些世界上一些“最先进的科技公司”作为客户。\n 但是，这是值得注意的，这是那个浮动器没有提供任何稳定的收入增长或客户收购，但Farkash坚持生长是真实的。\n “Firebolt每周增加新客户，其中一些非常大，”他说。“虽然是我们在使用中看到的增长，特别是我们的平台上的计算资源的增长更重要。一旦在生产中成功部署了初始用例，将在组织中使用Firebolt在新团队和用例中使用。这验证了客户在我们的平台中看到的价值。“\n 展望未来，Farkash表示，今天的资金将有助于Firebolt利用它所说的是“服务不足”的需求，对大数据的更多数据密集型应用和互动分析。\n “我们打算使用资金继续扩大公司的所有领域，并专注于工程和上市队伍，”他说。 “另一个投资领域正在建立伪力和技术合作伙伴之间的一体化，该伙伴构成了我们客户与我们的客户合作的现代数据堆栈。我们在2022年投资批量来推出Firebolt作为一个完全自助式平台，以便更多客户与我们的平台合作。“\n  通过加入我们的立方体俱乐部和专家Cube活动社区来表达您对我们的使命。加入包括亚马逊网络服务的社区，很快就是Amazon.com首席执行官Andy Jassy，Dell Technologies创始人兼首席执行官Michael Dell，英特尔首席执行官Pat Gelsinger和更多的灯饰和专家。\n 我们在6月16日举行了我们的第二次云启动展示。单击此处加入免费和打开启动展示事件。 \n我们真的想收到你的来信。 谢谢你花时间阅读这篇文章。 期待在活动和Thecube俱乐部见到您。 ", "note_en": "Speedy cloud data warehouse startup  Firebolt Analytics Inc. is looking like a very hot prospect indeed after landing $127 million in an all-equity round of funding.\n New investors Dawn Capital and K5 Global led the Series B round, with participation from angel investors and previous investors such as Zeev Ventures, TLV Partners, Bessemer Venture Partners and Angular Ventures, bringing Firebolt’s total amount raised to $164 million so far.\n The round comes just seven months after the company’s  Series A funding, appearing to validate its claims that its cloud data warehouse is 100 times faster than those of its rivals.\n Firebolt is taking on more established cloud players such as Snowflake Inc. as well as traditional on-premises data warehouses, which are a combination of hardware and software that unify data from multiple sources and execute queries on it.\n Firebolt’s cloud data warehouse is designed for extremely rapid analysis of large data sets. The company reckons it can provide subsecond performance for queries carried out on terabytes or even petabytes of information, thanks to its ability to crunch data up to 182 times faster than alternative data warehouse services.\n The company explains that its fast performance is derived from a number of internally developed technologies that power its cloud data warehouse. They include a customized, cost-based optimizer that tweaks Structured Query Language queries its users enter to improve their speed. It also uses a technique called sparse indexing to reduce the amount of unnecessary data that queries retrieve, thereby eliminating superfluous computations.\n The almost real-time query completion that Firebolt promises can be very helpful for many enterprises. Teams that work to analyze large data sets typically only query a small subset of that information because of performance constraints. By giving those teams to query their entire data sets, Firebolt can provide more accurate and detailed insights, it says. That’s because its faster performance means it becomes more economical and practical to analyze more data.\n Another advantage of the Firebolt platform is that the company says it’s built specifically with developers in mind. It allows 100% programmatic control of the platform via application programming interfaces and software development kits, which makes it much easier to create rich data applications based on it, the company asserts.\n Firebolt’s data warehouse is available as a software-as-a-service offering that runs on Amazon Web Services, with customers charged based on the cost of the compute, storage and networking resources they use, plus an annual subscription fee.\n The similarities with company’s products and those of the better-known Snowflake have inevitably drawn comparisons between the two services, but Firebolt Chief Executive Eldad Farkash (pictured, right, alongside Chief Operating Officer Saar Bitner) told SiliconANGLE that he isn’t focused on any individual competitor. Rather, he said the company is just concentrating on solving the most challenging customer problems.\n “The analytics industry has a value gap,” he said. “Data warehouses have rich capabilities and a high level of service, but they often lack the performance necessary for certain workloads. These needs are currently met by single-purpose technologies that lack the flexibility of data warehouses. We believe that Firebolt can be the data warehouse of choice for customers because we are capable of doing both.”\n Farkash claims that Firebolt’s platform is fast enough and powerful enough that it will push data warehousing to evolve from internal business intelligence use cases to power a much wider range of data-intensive applications. He pointed out that new kinds of data applications are becoming more common and require a higher level of performance that is not readily available through other services.\n “As data volumes grow and data usage grows, performance problems for applications intensify significantly,” Farkash said. “Even if their performance is fine for now, many companies are already looking for what’s next as they realize they’ll face performance problems as their data stores grow over time.”\n The CEO explained that many of Firebolt’s customers are very “tech-forward” engineering teams that run modern data stacks, building data applications that need to provide interactive analytics.\n The company claims to have made strong traction since its previous funding round. In the last six months it has doubled its employee headcount to 100 and said today it has plans to double that again in the next 12 months. It has also attracted key personnel such as Looker Data Sciences Inc. founder Keenan Rice, who will head up its U.S. operations going forward. In addition, the company spoke of “explosive growth in interest” and claimed to have added some of the world’s “most sophisticated tech companies” as customers.\n It’s notable, though, that Firebolt didn’t provide any solid numbers on revenue growth or customer acquisition, but Farkash insisted the growth is real.\n “Firebolt adds new customers every week, some of which are very large,” he said.”What’s even more important though is the growth we see in usage, specifically consumption of compute resources on our platform by existing customers. Once an initial use case has been successfully deployed in production, the use of Firebolt spreads within an organization to new team and use cases. That validates the value customers see in our platform.”\n Looking ahead, Farkash said today’s funding will help Firebolt to capitalize on what it says is the “underserved” demand for more data-intensive applications and interactive analytics on big data.\n “We intend on using the funding to continue to expand all areas of the company with a specific focus on engineering and our go-to-market team,” he said. “Another area of investment is building the integration between Firebolt and the technology partners which make up the modern data stack that our customers work with. We’re investing heavily to launch Firebolt as a fully self-service platform in 2022 to allow more customers to work with our platform.”\n  Show your support for our mission by joining our Cube Club and Cube Event Community of experts. Join the community that includes Amazon Web Services and soon to be Amazon.com CEO Andy Jassy, Dell Technologies founder and CEO Michael Dell, Intel CEO Pat Gelsinger and many more luminaries and experts.\n We are holding our second cloud startup showcase on June 16.  Click here to join the free and open Startup Showcase event.\n  We really want to hear from you. Thanks for taking the time to read this post. Looking forward to seeing you at the event and in theCUBE Club.", "posttime": "2021-06-24 20:31:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "全球,data,firebolt", "title": "Birebolt Analytics建立了云数据仓库，旨在快速分析大型数据集，由黎明首都和K5全球推出12700万系列B ", "title_en": "Firebolt Analytics, which builds a cloud data warehouse designed for rapid analysis of large data sets, raises $127M Series B led by Dawn Capital and K5 Global", "transed": 1, "url": "https://siliconangle.com/2021/06/24/firebolt-analytics-raises-127m-grow-super-fast-cloud-data-warehouse/", "via": "", "real_tags": ["全球", "data", "firebolt"]}, {"category": "", "categoryclass": "", "imagename": "96f7c5607c501b888b6e746a99e84f1d.png", "infoid": 1067956, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有意义的是一个快速发展的教育技术公司，为小学提供早期扫盲评估软件。使用我们的产品，K-5学生可以大声读入移动设备，生成用于读取指令的关键数据，否则将手动收集。这节省了教师大量时间，为年轻读者推动了关键干预决策。我们目前为200,000多名学生提供服务，以及我们的客户是几个美国最大的学区，包括橙县公立学校和斯波坎公立学校。\n  技能：Python，Amazon Web服务（AWS）我们正在寻找高级全堆栈软件工程师，以便在明确的网络服务和核心评估处理系统上采取重要的技术所有权。您将在定义技术路线图和扩展系统以处理我们的快速用户增长中的主导作用。我们使用AWS，Python，Django，Redis和Postgres，但不需要特定于此堆栈的体验。在早期启动时自主和积极地经过的经验是一个大的加号。其他漂亮的漂亮致命包括信号处理，音频数据分析，机器学习和自动语音识别的经验。\n  我们使用Python，亚马逊Web服务，Pulumi，Docker，Git，Django，Redis，Circleci和Postgres。我们每天都收到巨大的嘈杂，通常是来自幼儿的幼儿的音频数据不良。使用自动语音识别和人类转录的组合，我们的软件将其转换为小学教师的清洁，可操作的信息。改进和扩展本评估处理管道弥补了我们的工程工作的大部分。 ", "note_en": "Literably is a fast-growing education technology company that provides early literacy assessment software to elementary schools. Using our product, K-5 students can read out loud into a mobile device, generating key data for reading instruction that would otherwise be collected manually. This saves teachers enormous amounts of time and drives critical intervention decisions for young readers. We currently serve over 200,000 students, and among our customers are several of America&#39;s largest school districts, including Orange County Public Schools and Spokane Public Schools.\n  Skills:  Python, Amazon Web Services (AWS) We are looking for a senior full-stack software engineer to take significant technical ownership over Literably&#39;s web services and core assessment processing system. You will play a leading role in both defining the technical roadmap and scaling the system to handle our rapid user growth. We work with AWS, Python, Django, Redis, and Postgres, but specific experience with this stack is not required. Prior experience operating autonomously and proactively at early stage startups is a big plus. Other nice-to-haves include experience with signal processing, audio data analysis, machine learning, and automated speech recognition.\n  We work with Python, Amazon Web Services, Pulumi, Docker, Git, Django, Redis, CircleCI, and Postgres. We receive huge volumes of noisy, often poorly-articulated audio data from young children in real classrooms every day. Using a combination of automated speech recognition and human transcription, our software converts this into clean, actionable information for elementary school teachers. Improving and scaling this assessment processing pipeline makes up the bulk of our engineering work.", "posttime": "2021-06-24 20:31:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,软件工程师,工程师,ik12,技术", "title": "典型（IK12 W13）正在聘请高级软件工程师（遥控器） ", "title_en": "Literably (IK12 W13) Is Hiring a Senior Software Engineer (Remote)", "transed": 1, "url": "https://www.workatastartup.com/jobs/43782", "via": "", "real_tags": ["软件", "软件工程师", "工程师", "ik12", "技术"]}, {"category": "", "categoryclass": "", "imagename": "688a5f3e3760b4bed7ff166ffcd10686.jpg", "infoid": 1067955, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移动运营商EE将在1月份将新客户收取额外的额外费用，以便在欧洲使用他们的手机。  2021年7月7日的加入或升级的人每天将每天收取2英镑，以便在2022年1月的47名欧洲目的地中使用他们的津贴。  这是英国第一届英国运营商，以便在12月底签署Brexit贸易协议以来重新引入该指控。  自2017年以来，欧盟国家的移动网络未被允许向客户收取额外费用在其他欧盟国家的手机。  有一些＆＃34;公平使用＆＃34; 例如，限制，您无法从罗马尼亚获得手机合同，然后在意大利全年使用它。  在2021年1月，ee，O2，三和沃达丰所有人都表示他们没有计划重新引入漫游费用，尽管Brexit给他们这样做了。  ee周四表示，介绍收费和＃34;支持投资进入我们英国客户服务和领先的英国网络＆＃34; \n但是，它不会向英国客户收取额外费用在爱尔兰共和国使用手机。  旅行到47个受影响国家的客户将能够购买30天的通行证，以在国外使用他们的家庭关税。 这些费用取决于哪些关税客户正在开启。  但是，它仅仅是添加A＆＃34;公平使用＆＃34; 每月25GB的数据盖，不会向客户收取更多使用他们在欧盟的手机。  公平使用限制是正常的，当英国仍然是欧盟的一部分时，允许。 从下个月开始，三个将使其公平使用限额从20GB每月到12GB。  与欧盟的贸易协议贸易协议表示，双方都会鼓励运营商＆＃34;透明和合理的价格＆＃34; 为了漫游，但它没有禁止收费。  政府＆＃39; S指南鼓励在欧洲旅行的人们与他们的移动运营商一起检查，以了解任何漫游费用。 ", "note_en": "Mobile operator EE will charge new customers extra to use their mobile phones in Europe from January.\n Those joining or upgrading from 7 July 2021 will be charged £2 a day to use their allowances in 47 European destinations from January 2022.\n  It is the first UK operator to reintroduce the charges since the Brexit trade deal was signed at the end of December.\n Since 2017, mobile networks in EU countries have not been allowed to charge customers extra to use their phones in other EU countries.\n There are some &#34;fair use&#34; limits, for example, you cannot get a mobile phone contract from Romania and then use it all year round in Italy.\n In January 2021, EE, O2, Three and Vodafone all stated they had  no plans to reintroduce roaming charges, despite Brexit giving them the option to do so.\n EE said on Thursday that introducing the charges would &#34;support investment into our UK based customer service and leading UK network&#34;.\n However, it will not charge UK customers extra to use their phones in the Republic of Ireland.\n Customers travelling to the 47 affected countries will be able to buy 30-day passes to use their home tariff abroad. The cost of those will depend on which tariff customers are on.\n   However, it is merely adding a &#34;fair use&#34; data cap of 25GB a month and will not charge customers more to use their phones in the EU.\n Fair use limits are normal and were allowed when the UK was still part of the EU. From next month, Three will be reducing its fair use limit from 20GB a month to 12GB.\n The UK&#39;s trade deal with the EU says that both sides will encourage operators to have &#34;transparent and reasonable rates&#34; for roaming, but it did not ban charges.\n The  government&#39;s guidelines encouraged people traveling in Europe to check with their mobile operators to find out about any roaming charges.", "posttime": "2021-06-24 20:31:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "欧洲,reintroduce", "title": "在Brexit之后重新引入欧洲的数据漫游费用 ", "title_en": "EE to reintroduce data roaming charges in Europe, following Brexit", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-57595913", "via": "", "real_tags": ["欧洲"]}, {"category": "", "categoryclass": "", "imagename": "6194d89551c0d7baff14beff97b4b1ce.jpeg", "infoid": 1067954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本公司在信息技术法案下也可能责任，并在其提供安全港口，由于不合规，因此不太可能适用于其\n 意识到这件事的官员说，端到端加密消息申请信号不符合新的社交媒体和中介指导方针。他们补充说，该公司在信息技术法案下，在信息技术法案下，提供了安全港，这不太可能适用于其。\n 该官员表示，该公司在新的准则下没有与政府分享合规官的详细信息。\n 信号是一个重要的社交媒体中介，因为它在该国拥有超过500万用户。\n  新的准则还授权信号和WhatsApp等公司，以共享消息的第一个发起者的详细信息。 WhatsApp已挑战与新指南相关的条款，说这是与端到端加密的赔率。\n “信号并未遵守指南。自媒体服务本质上的重要社交媒体中介机构不得不遵守，因此，IMESSage等服务不会属于可追溯性条款，“官方要求匿名。\n  至少有八个缔约方在几个高法庭中争论了新规则，称他们超出了他们制定的信息技术法案的范围。 \nTwitter也面临政府未能遵守新的准则。指导方针授权社交媒体公司任命合规官员，节头官员和申诉制定官员。\n Signal在3月份在Apple App Store上下载最下载，因为WhatsApp面临的隐私问题。它是星期一在Google Play商店上下载最下载的应用之一。\n Namrata Maheshwari，加密政策研究员，现在访问，数字民权组织，表示信号不能符合可追溯性要求，而不会削弱端到端加密。 “例如，信号的端到端加密目前具有一个名为”转发保密“的隐私增强功能，这确保了无法跟踪其平台上的消息链。” Maheshwari表示，如果信号被迫改变其服务以遵守“这些非法，不成比例的规则”，它将为其印度的许多用户破坏隐私和安全性。 “主要问题仍然是，这些规则包含对消息服务的不明确规定，以促进破坏加密的监测，并实现潜在的滥用和选择性申请 - 这是印度法院裁定的疑虑。”\n     关闭 ", "note_en": "The company is also likely to be liable under the Information Technology Act and the provision of safe harbour in it is unlikely to be applicable to it due to the non-compliance, they added\n End-to-end encrypted messaging application Signal is not in compliance with the new social media and intermediary guidelines, officials aware of the matter said. The company is also likely to be liable under the Information Technology Act and the provision of safe harbour in it is unlikely to be applicable to it due to the non-compliance, they added.\n The officials said the company has not shared the details of a compliance officer with the government under the new guidelines.\n Signal is a significant social media intermediary as it has over five million users in the country.\n  The new guidelines also mandate companies such as Signal and WhatsApp to share the details of the first originator of a message. WhatsApp has challenged the clause related to the new guidelines saying it is at odds with end-to-end encryption.\n “Signal has not complied with the guidelines. Services like iMessage do not fall under the traceability clause since the significant social media intermediaries in the nature of messaging services have to comply,” said an official, requesting anonymity.\n  At least eight parties have contested the new rules in several high courts, saying they are beyond the scope of the Information Technology Act they have been formulated under.\n Twitter, too, has faced off with the government over its failure to comply with the new guidelines. The guidelines mandate social media companies to appoint compliance officers, nodal officers, and grievance redressal officers.\n Signal became the most downloaded on the Apple App Store in March as WhatsApp faced privacy concerns. It was one of the most downloaded apps on Google Play Store on Monday.\n Namrata Maheshwari, Encryption Policy Fellow, Access Now, a digital civil rights organisation, said Signal cannot comply with the traceability requirement without weakening end-to-end encryption. “For example, Signal’s end-to-end encryption currently has a privacy-enhancing feature called ‘forward secrecy’ which ensures that the chain of a message on its platform cannot be tracked.” Maheshwari said if Signal is forced to change its service to comply with “these unlawful, disproportionate rules”, it would undermine privacy and security for its many users in India. “The main problem remains that these rules contain an unclear mandate on messaging services to facilitate surveillance that undermines encryption and enables potential misuse and selective application--which are concerns now being adjudicated by Indian courts.”\n     Close", "posttime": "2021-06-24 20:30:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,应用程序,app,加密", "title": "消息传递应用程序信号不符合新规则，在印度官员说 ", "title_en": "Messaging app Signal not in compliance with new rules, say officials in India", "transed": 1, "url": "https://www.hindustantimes.com/india-news/messaging-application-signal-not-in-compliance-with-new-rules-say-officials-101624508925464.html", "via": "", "real_tags": ["程序", "应用程序", "app", "加密"]}, {"category": "", "categoryclass": "", "imagename": "7c2dafa88a6d7eb2af050d9ea9525453.jpg", "infoid": 1067953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Qantas Captain和Co-Pilot暂时留下了＆＃34;无能为力＆＃34;和＃34;空气喘气＆＃34;在三年前的令人恐惧的五月发生意义，新的航空安全报告揭晓。\n 澳大利亚运输安全局于周四发布的报告揭示了有关Express Freighters澳大利亚飞机的令人不安的细节，2018年8月15日从布里斯班到墨尔本旅行。\n 当小心闪烁时，船员随着氧气掩囊而加入氧气面罩，并且飞机开始紧急下降。\n 但在血统初始部分期间，Qantas波音737-376的船长被留下了＆＃34;暂时无能为力＆＃34;和＆＃34;呼吸和喘息着呼吸＆＃34;根据该报告，通过对来自面具的呼吸氧气供应增加的反应。\n  然后，5月日由共同飞行员宣布，也称为第一官，该飞机开始转移到堪培拉机场。\n  ＆＃34;第一官，他们以前讨论过的感觉不适，观察到船长向前瘫倒了，憔悴和喘气，＆＃34;阿斯布说。\n ＆＃34;第一局官员回忆起在这一集中检查船长，但没有收到回复。＆＃34; \n收盘院称为空中交通管制，要求在抵达堪培拉时出席急救服务，飞机安全降落。\n 报告指出，AT＆＃34;没有点＆＃34;这次飞行员都在同一时间丧失态度。\n 调查鉴定了母线的间歇闪烁着灯，过热信号器可能是由于右翼体过热检测系统的电故障。\n ＆＃34;在下降期间，船长选择氧气掩模的紧急流动导致气态氧气摄取，导致其临时无效，＆＃34;报告阅读。\n  ＆＃34;经营飞行机组人员进行了适当的非正常清单，但由于机翼体过热检测系统的故障，过热指示无法整流，＆＃34;报告阅读。\n ＆＃34;飞机喷射系统中的隔离阀的附加故障防止了右翼体压力管道的隔离。\n ＆＃34;这导致了机组人员进一步进行故障排除，在此期间驾驶室空气供应减少。 \n＆＃34;与普通驾驶室泄漏率高，减少的气流也减少了机舱压力。＆＃34;  登陆后，船长和第一官通过救护车运往医院进行医学评估。  发生后的医学测试和评估没有识别飞行的持久影响。  在事件发生后检查期间，Qantas工程师鉴定了＆＃34;一系列可维护性问题＆＃34; 使用飞机机身驾驶室排水阀，机身门密封，以及辅助动力单元管道的光泽密封，影响飞机保持机舱压力的容量。  根据该报告，Qantas建议ATSB IT注入维护变更，以避免将来类似的事件。 ", "note_en": "A Qantas captain and co-pilot were left temporarily &#34;incapacitated&#34; and &#34;gasping for air&#34; during a terrifying mayday incident three years ago, a new aviation safety report has revealed.\n The Australian Transport Safety Bureau report released on Thursday shed disturbing details about an Express Freighters Australia aircraft, which was travelling from Brisbane to Melbourne on August 15, 2018.\n The crew donned oxygen masks when a caution light flickered, and the aircraft started an emergency descent.\n But during the initial part of the descent, the captain of the Qantas Boeing 737-376 was left &#34;temporarily incapacitated&#34; and &#34;gagging and gasping for breath&#34; by a reaction to the increased supply of breathing oxygen from the mask, according to the report.\n  A mayday was then declared by the co-pilot, also known as the first officer, and the aircraft started a diversion to Canberra Airport.\n  &#34;The first officer, cognisant that they had previously discussed feeling unwell, observed the captain slumped forward, gagging and gasping for air,&#34; the ATSB said.\n &#34;The first officer recalled checking on the captain during this episode but not receiving a response.&#34;\n  The captain radio called air traffic control, requesting the attendance of emergency services upon arrival at Canberra where the aircraft landed safely.\n The report noted that at &#34;no point&#34; were both pilots incapacitated at the same time.\n The investigation identified intermittent flickering of the master caution light and overheat annunciator were likely due to an electrical fault in the right wing-body overheat detection system.\n &#34;During the descent, the captain selected emergency flow on the oxygen mask resulting in an ingestion of gaseous oxygen, causing their temporary incapacitation,&#34; the report read.\n  &#34;The operating flight crew conducted the appropriate non-normal checklist, however the overheat indication could not be rectified due to the fault in the wing-body overheat detection system,&#34; the report read.\n &#34;An additional fault with an isolation valve in the aircraft pressurisation system prevented isolation of the right wing-body pressure duct.\n &#34;This led the crew to conduct further troubleshooting during which the cabin air supply was reduced.\n &#34;In conjunction with a higher than normal cabin leak rate, the reduced airflow also lessened the cabin pressure.&#34;\n After landing, both the captain and first officer were transported to hospital via ambulance for medical assessment.\n  Post‑occurrence medical testing and assessments did not identify lasting effects from the flight.\n  During inspections after the incident, Qantas engineers identified &#34;a range of serviceability issues&#34; with the aircraft fuselage cabin drain valves, fuselage door seal, and the auxiliary power unit duct bellow seal that affected the capacity for the aircraft to hold cabin pressure.\n According to the report, Qantas advised ATSB it incorporated maintenance changes to avoid similar incidents in the future.", "posttime": "2021-06-24 20:30:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "qantas,crew,飞机", "title": "Qantas船员在可怕的5月日事件中离开了“喘气” ", "title_en": "Qantas crew left 'gasping for air' in scary mayday incident", "transed": 1, "url": "https://www.nzherald.co.nz/travel/qantas-crew-left-gasping-for-air-in-scary-mayday-incident-aviation-safety-report-reveals/XXIH3HKUURTZW3RKP5AY7HYIRY/", "via": "", "real_tags": ["qantas", "crew", "飞机"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067950, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尝试全数字访问，了解为什么超过100万读者订阅FT  选择购买审判订阅$ 1持续4周，您将在审判结束后每月收费91美元  4周接收无限的优质数字访问FT＆＃39; S值得信赖，获奖的商业新闻  礼品文章 - 每月分享最多10条与家人，朋友和同事 ", "note_en": "Try full digital access and see why over 1 million readers subscribe to the FT\n  Select  Purchase a Trial subscription for $1 for 4 weeks   You will be billed $91 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2021-06-24 20:24:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子表格,tyranny,订阅", "title": "电子表格的暴政 ", "title_en": "The Tyranny of Spreadsheets", "transed": 1, "url": "https://www.ft.com/content/18db20d8-7726-43e2-87f1-c5861ad3dff5", "via": "", "real_tags": ["电子表格", "tyranny", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "0002c9cbff32ba88baa2420b669a6c66.jpg", "infoid": 1067949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PCMAG编辑器独立选择和审查产品。如果您通过联盟链接购买，我们可以赚取佣金，帮助支持我们的测试。学到更多。\n     Peloton已从跑步机产品中取出了免费功能 - 刚刚运行的能力。相反，该公司要求所有者支付每月订阅以获取该功能，尽管它说它＆＃39; s再次允许刚刚运行选项。\n 鉴于胎面+一旦售价为4,295美元，它听起来很荒谬。但是佩罗顿的跑步机没有普通的运动机器。该公司还通过订阅服务销售跑步机的视频锻炼计划，每月可以花费39美元。\n 刚刚逃跑的删除与上个月发布的自愿召回，在机器对多个儿童造成伤害之后胎面+和胎面产品。作为响应，Peloton创建了一个锁定功能，以防止未经授权访问设备。但是，刚刚运行的费用是牺牲的，这一旦坐在胎面+屏幕上的虚拟按钮。\n 在一份声明中，Peloton告诉PCMAG＆＃34;在我们正在进行的工作中，以确保我们的产品更加安全，作为我们与CPSC（消费产品安全委员会）合作的自愿回忆，我们释放了胎面锁，四位数密码为了防止未经授权的访问，保护胎面+。“”公司表示。 “不幸的是，没有Peloton会员的胎面锁尚未提供，这意味着没有订阅的胎面+所有者无法访问此时无法访问。”\n 仍然，Peloton说它＆＃39; s＆＃34;在更新到胎面锁的更新，让我们允许我们制作胎面锁，只需在没有Peloton会员的情况下运行，＆＃34;没有阐述。\n jennifer强大的刚刚经过跑步的头条新闻，一个胎面+所有者在Peloton Facebook集团上发布。她于2019年1月买了一台机器。但经过几个月后，她在比洛顿的运动方案中失去了兴趣。相反，她开始在她的胎面+上使用“刚刚运行”功能，这根本不需要订阅。它只是让她像普通跑步机一样在机器上运行。 \n“遗憾的是，在没有Peloton会员的情况下，”刚刚运行“不再可以访问，”Peloton客户支持的电子邮件告诉强大，他们将其发布到Facebook上。\n “如果没有会员资格，我们如何再使用自行车或胎面？！他们基本上只是纸质重量！“她写了。\n 她的职位已经引发了愤怒和支持Peloton决定删除免费功能。 “你买了3,000美元的跑步机，然后购买了[IT]后，他们用”软件更新“，他们停止它从工作到支付39.99美元/月？听起来像是盗窃和勒索卫匠给我，“在推特上写了一个用户。\n 其他客户正在质疑为什么任何人都会在没有会员资格购买的Peloton。 “我被认为人们在不使用课程的情况下使用Peloton的想法。不是那种Peloton大多是什么？“写了一个用户以响应强大的帖子。\n    缺乏清晰度是令人沮丧的Peloton客户，如Brianna Wu，视频游戏开发商和前国会候选人，他还宣传了拆除了非订阅者的运行功能。\n “我希望Peloton在这里做正确的事情，”她告诉PCMag。 “因为他们的长期成功铰链，所以他们的感觉是他们提供了良好的价值。如果人们害怕他们的3,000美元的投资将最终会造成一笔纸牌，我们通过借口不帮助Peloton。“\n 与此同时，强势尚未在上周在她的胎面+机器上运行。她没有购买每月订阅的计划。 \n“如果Peloton将引用安全是不使用它的问题，我完全不同意，”她告诉PCMag。 “这就像买车然后制造商在您支付使用安全气囊之前无法使用。”  本通讯可能包含广告，交易或联盟链接。 订阅时事通讯表明您同意我们的使用条款和隐私政策。 您可以随时取消订阅新闻稿。 ", "note_en": "PCMag editors select and review products  independently. If you buy through affiliate links, we may earn commissions, which help support our testing.  Learn more.\n     Peloton has removed a free feature from its treadmill products—the ability to just run. Instead, the company is requiring owners to pay for a monthly subscription to get the function, though it says it&#39;s working to once again allow the Just Run option.\n It sounds absurd, given that the  Tread+ once sold for $4,295. But the treadmills from Peloton are no ordinary  exercise machines. The company also sells video exercise programs for the treadmills through a subscription service, which can cost $39 a month.\n The removal of Just Run is related to a  voluntary recall it issued last month for the Tread+ and Tread product after the machines caused injuries to multiple children. In response, Peloton created a locking feature to prevent unauthorized access to the equipment. But the change came at the expense of Just Run, which once sat as a  virtual button on the Tread+ screen.\n In a statement, Peloton told PCMag that &#34;in our ongoing work to ensure our products are even safer, as part of our voluntary recall in collaboration with CPSC (Consumer Product Safety Commission), we released Tread Lock, a four digit passcode to secure Tread+ against unauthorized access,” the company said. “Unfortunately, Tread Lock is not yet available without a Peloton Membership, which means Tread+ owners without a subscription cannot access Just Run at this time.”\n Still, Peloton says it&#39;s &#34;working on updates to Tread Lock that will allow us to make Tread Lock and Just Run available without a Peloton Membership,&#34; without elaborating.\n The demise of Just Run made headlines after Jennifer Strong, a Tread+ owner, posted about it on the Peloton Facebook group. She bought her machine in January 2019. But after a few months, she lost interest in the exercise programs from Peloton. Instead, she began using the “Just Run” function on her Tread+, which didn’t require a subscription at all. It simply let her run on the machine like a normal treadmill.\n   “Unfortunately at this time, ‘Just Run’ is no longer accessible without a Peloton membership,” an email from Peloton’s customer support told Strong, who posted it to Facebook.\n “How is this even possible that we cannot use the bike or tread anymore without a membership?! They’re basically just paperweights now!” she wrote.\n Her post has since sparked both anger and support over Peloton’s decision to remove the free feature. “You buy a $3,000 treadmill, then after you’ve purchased [it], with a ‘software update’ they stop it from working until you pay them $39.99/mo? Sounds like Theft and  Ransomware to me,”  wrote one user on Twitter.\n Other customers are questioning why anyone would buy a Peloton without a membership. “I’m baffled by the idea people use the Peloton without using the classes. Isn’t that what Peloton is mostly founded upon?” wrote one user in response to Strong’s post.\n    The lack of clarity is frustrating Peloton customers such as Brianna Wu, a video game developer and former Congressional candidate, who also  publicized the removal of the Just Run feature for non-subscribers.\n “I want Peloton to do the right thing here,” she told PCMag. “Because their long-term success hinges on people feeling like they provide a good value. If people are scared their $3,000 investment is going to end up a paperweight, we don’t help Peloton by excusing that.”\n In the meantime, Strong hasn’t been able to run on her Tread+ machine for the last week. And she has no plans on purchasing a monthly subscription.\n “If Peloton is going to cite safety is the issue for not using it I completely disagree,” she told PCMag. “That’s like buying a car and then the manufacturer making it not usable until you pay to use the airbags.”\n This newsletter may contain advertising, deals, or affiliate links. Subscribing to a newsletter indicates your consent to our  Terms of Use and  Privacy Policy. You may unsubscribe from the newsletters at any time.", "posttime": "2021-06-24 19:48:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,特色,axes,peloton", "title": "Peloton轴免费“刚刚运行”特色，从跑步机上，将其砖块用于非订阅者 ", "title_en": "Peloton Axes Free 'Just Run' Feature From Treadmill, Bricking It for Non-Subscribers", "transed": 1, "url": "https://www.pcmag.com/news/peloton-axes-free-just-run-feature-from-treadmill-bricking-it-for-non-subscribers", "via": "", "real_tags": ["免费", "特色", "axes", "peloton"]}]