[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我们开始使用Repl.it时，我们开始着手消除开始编程的所有障碍。这也意味着要避开障碍，让您尽可能快地编写代码。作为其中的一部分，在很长一段时间内，您可以在没有用户帐户的情况下开始在Repl.it上编码。\n我们预计，向宇宙提供免费的、不受约束的计算将是一件具有挑战性的事情。尽管如此，我们没有退缩，并强调要在沙箱、安全和反滥用工具方面进行创新，而且我们在这方面取得了很大成功。今天，Repl.it是互联网上最大的开放计算平台，在这个平台上，你不需要信用卡，甚至不需要账户就可以开始执行。我们运行150,000个并发容器，是去年运行的10倍。\n我们也有自己的战争故事，比如我们不得不与试图出售我们网站上的DDoS攻击以换取比特币的黑暗网络黑客作战。幸运的是，谷歌的reCAPTCHA提供了巨大的帮助，对Boting的防御使我们有可能继续发展，并免费提供我们的服务。\n遗憾的是，今年早些时候，谷歌让我们大吃一惊，他们将对再验证码收费。当然，这对他们来说是有商业意义的，但对于像我们这样的初创公司，以我们的运营规模运营，这意味着我们必须向他们支付比我们每月收入更高的费用。\n使站点容易受到Boting和攻击，导致花费大量时间打击滥用行为并冒着中断的风险。\n逐步淘汰匿名体验，并将我们的努力和工具集中在保护登录用户体验上。\n我们决定选择后者，希望您能继续支持我们，并创建一个帐户。除了注册所需的5分钟外，这样做只有一个好处。我们不收集太多数据，我们尊重用户隐私。你还将解锁许多在匿名体验中对你来说看不见的功能：\n谷歌只给了我们一个月的时间，所以我们必须迅速行动。以下是未来几周的预期变化：\n我们将把我们的语言页面(/Languages/{lang_name})转换为基本的REPL，滥用的机会有限。这样一来，如果你习惯了使用Repl.it来尝试一些代码，你可以在不登录的情况下继续这样做。\nRun，你可以访问命令行应用程序的url终结点将重定向到repl。Run本身就是匿名的，这使得它成为没有验证码的攻击载体。\n我们仍然致力于开放和即时--这两个原则使Repl.it变得特别。我很高兴能在里面看到你！", "note_en": "When we started Repl.it, we set out to remove all friction from getting started with programming. That also meant getting out of the way and letting you code as quickly as possible. As part of that, and for a long time, you could start coding on Repl.it without a user account.\n We anticipated that giving free unfettered compute to the universe would be challenging. Still we didn&#39;t flinch and made it a point to innovate on sandboxing, security, and anti-abuse tools, and we&#39;ve been largely successful at that. Today, Repl.it the largest open compute platform on the internet, one where you don&#39;t need a credit card or even an account to start executing. We run 150,000 concurrent containers, which is 10x what we used to run last year.\n We have our fair share of war stories, like when we had to battle dark-web hackers trying to sell DDoS attacks from our site for Bitcoin. Luckily reCAPTCHA from Google was a massive help, protecting against botting made it possible for us to continue to grow and offer our services for free.\n Sadly, earlier this year, Google surprised us that they&#39;re going to be charging for reCAPTCHA. Of course, it makes business sense for them, but for a startup like ours, operating at the scale we operate at, it meant that we have to pay them more than we make in monthly revenue .\n  leave the site vulnerable to botting and attacks resulting in an immense amount of time spent fighting abuse and risking outages\n phase out the anonymous experience and focus our efforts and tools on securing the logged-in user experience\n We decided to go with the latter, and we hope you&#39;ll stick with us and create an account. Beyond the 5 minutes it takes to sign up, there is only an upside to doing so. We don&#39;t collect much data, and we respect user privacy. You&#39;re also going to unlock many features that were invisible for you in the anonymous experience:\n    Google gave us only one month to move off, so we&#39;re going to have to move fast. Here are the changes to expect in the upcoming few weeks:\n We&#39;ll transition our language pages ( /languages/{lang_name}) to a barebones REPL with limited opportunity for abuse. That way if you&#39;re used to using Repl.it to try out just a bit of code, you can continue to do that without logging in\n repl.run, the url endpoint you could access command-line apps will redirect to the repl. repl.run is inherently anonymous, which makes it an attack vector without captcha\n We remain committed to openness and instantness -- two principles that have made Repl.it special. I am thrilled to see you on the inside!", "posttime": "2020-11-06 08:06:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "匿名,anonymous,攻击", "title": "ReCAPTCHA与匿名体验", "title_en": "reCAPTCHA and the Anonymous Experience", "transed": 1, "url": "https://blog.repl.it/anon", "via": "", "real_tags": ["匿名", "anonymous", "攻击"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家们发现了迄今最有力的证据，证明从Covid病毒中康复的人如果再次遭遇病毒，可能会更快、更有效地防御感染。\n纽约洛克菲勒大学(Rockefeller University)的研究人员发现，免疫系统不仅记住了病毒，而且在感染过去后提高了保护性抗体的质量，使身体有能力在病毒第二次入侵时发动迅速而有力的攻击。\n该研究的资深作者、洛克菲勒大学分子免疫学主任米歇尔·努森茨韦格(Michel Nussenzweig)说：“这是一个非常好的消息。”“人们的期望是，在大量病例中，人们应该能够产生快速的抗体反应并抵抗感染。”\n目前还不清楚免疫系统的记忆力会持续多久，但努森茨威格说，它可能会在几年内提供一些保护。这一发现可能解释了为什么到目前为止，被证实的病毒再次感染相当罕见。\n当人们感染冠状病毒时，免疫系统会发起多管齐下的攻击。一种形式的保护来自T细胞，它寻找并摧毁受感染的细胞，从而阻止病毒的传播。第二个方面涉及B细胞，它将抗体释放到血液中。抗体会附着在病毒上，并从一开始就阻止它入侵细胞。\n一旦感染过去，免疫系统就会停止工作，但它会通过储存所谓的记忆T细胞和记忆B细胞来记住病毒。如果病毒卷土重来，这些机构会立即采取行动。\n许多研究表明，冠状病毒的第一波抗体在几个月后就会减弱，这引发了人们可能很快就会失去免疫力的担忧。在对87名冠状病毒患者的研究中，美国研究人员证实，抗体水平下降，在6个月内降至峰值水平的约五分之一，但他们认为，这可能不会有太大影响。\n当研究人员检查免疫系统的记忆时，他们注意到，在感染6个月后，记忆B细胞产生的抗体已经进化成更强大的抗体。这些经过高度磨练的抗体可以在再次感染后的几天内释放出来，而不是像初次感染那样需要几周时间才能积聚起来。\n科学家们进一步证明，微量的冠状病毒，或非活跃病毒颗粒的蛋白质片段，潜伏在患者的肠道中，显然有助于维持免疫系统的记忆。病毒的残留物被认为是无害的。\nNussenzweig说：“带回家的教训是，感染病毒的人在6个月后会有持久的B细胞记忆反应，抗体可以中和病毒，而且可以很好地发挥作用。”他补充说，这可能意味着在病毒站稳脚跟之前将其消灭。“我们不知道任何保护措施会持续多久，但可能真的会很长。这可能需要数年时间。“。\n没有参与这项研究的伦敦帝国理工学院(Imperial College London)免疫学教授查尔斯·邦汉姆(Charles Bangham)表示，这项研究表明，“如果你再次接触病毒，你很有可能会对病毒产生更快的免疫反应”。他说：“这还有待证明，它具有保护性，但你有理由相信它会产生一些有益的效果。”\n伦敦大学学院(University College London)免疫学教授阿恩·阿克巴尔(Arne Akbar)说：“这对所有感染过冠状病毒的人来说都是个好消息。”他说，免疫系统就像一支军队，一旦威胁结束，就会撤退，但仍在为未来的入侵做好准备。“你希望迅速重新组建军队，这就是这些研究人员所发现的。”", "note_en": "Scientists have found the strongest evidence yet that people who recover from Covid may mount a much faster and more effective defence against the infection if they encounter the virus again.\n Researchers at Rockefeller University in New York found that the immune system not only remembered the virus but improved the quality of protective antibodies after an infection had passed, equipping the body to unleash a swift and potent attack if the virus invaded a second time.\n “It’s very good news,” said Michel Nussenzweig, the head of molecular immunology at Rockerfeller and a senior author of  the study. “The expectation is that people should be able to produce a rapid antibody response and resist infection in a large number of cases.”\n It is unclear how long the immune system’s memory might last, but Nussenzweig said it could potentially provide some protection for years. The discovery may explain why verified re-infections from the virus are so far quite rare.\n When people are infected with coronavirus, the immune system launches a multi-pronged attack. One form of protection comes from T cells, which seek and destroy infected cells, and so prevent the virus from spreading. A second front involves B cells, which release antibodies into the blood. Antibodies latch on to the virus and stop it from invading cells in the first place.\n  Once the infection has passed, the immune system stands down, but it remembers the virus by storing so-called memory T cells and memory B cells. Should the virus return, these are immediately called to action.\n Many studies have shown that the first wave of antibodies to coronavirus  wane after a few months, raising concerns that people may lose immunity quickly. In their study of 87 coronavirus patients, the US researchers confirmed that antibodies wane, falling to about a fifth of their peak level over six months, but this may not matter too much, they believe.\n When the researchers examined the immune system’s memory, they noticed that six months after infection the antibodies made by memory B cells had evolved to become more potent. These highly honed antibodies could be unleashed within days of re-infection, rather than taking a couple of weeks to build up, as seen in primary infections.\n The scientists went on to show that tiny amounts of coronavirus, or protein fragments from inactive virus particles, lurked in patients’ intestines and apparently helped to maintain the immune system’s memory. The remnants of the virus are not thought to be harmful.\n “The take-home lessons are that people who have been infected, six months later have persistent B cell memory responses with antibodies that can neutralise the virus and can do it very well,” Nussenzweig said. That could mean wiping out the virus before it takes hold, he added. “We don’t know how long any protection will last, but it might be a really long time. It could be years.”\n   Charles Bangham, a professor of immunology at Imperial College London, who was not involved in the study, said the work suggested there was “a very good chance that if you’re re-exposed, you’ll make a brisker immune response” to the virus. “It remains to be proved that it’s protective, but you would be reasonably confident it would have some beneficial effect,” he said.\n Arne Akbar, a professor of immunology at University College London, said: “This is good news for everybody who has been sick with coronavirus.” He said the immune system was like an army that stands down once the threat is over, but remains prepared for a future invasion. “You want the army to be generated again very quickly, and this is what these researchers have found.”", "posttime": "2020-11-06 08:05:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,免疫,immune,病毒", "title": "科学家称，感染后Covid免疫反应更快、更强", "title_en": "Covid immune response faster and stronger post-infection, scientists say", "transed": 1, "url": "https://www.theguardian.com/world/2020/nov/05/covid-immune-response-much-faster-and-stronger-post-infection-coronavirus-scientists-say", "via": "", "real_tags": ["科学家", "免疫", "immune", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "93b9d90b7813ad929c234747ca633bc9.png", "infoid": 1033473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您一直在关注最新的Linux发行版，您一定已经注意到，大多数流行的Linux发行版都不再支持32位。Arch Linux、Ubuntu、Fedora，每个人都放弃了对这个旧架构的支持。\n但是，如果您随身携带的老式硬件仍然需要恢复，或者您想要将其用于某些用途，该怎么办呢？不用担心，对于您的32位系统，仍然有几个选项可供选择。\n在本文中，我试图编译一些最好的Linux发行版，它们将在未来几年继续支持32位平台。\n这个列表与我们之前针对旧笔记本电脑的Linux发行版列表略有不同。即使是64位的电脑，如果是在2010年前发布的，也可以被认为是旧的。这就是为什么那里列出的一些建议包括现在只支持64位的发行版。\n根据我的知识和发现，这里提供的信息是正确的，但如果你发现不是这样的，请在评论区告诉我。\n在您继续之前，我想您知道如何检查您的计算机是32位还是64位。\nDebian是32位系统的绝佳选择，因为他们在最新的稳定版本中仍然支持它。在撰写本文时，最新的稳定版本Debian 10“buster”提供了32位版本，并支持到2024年。\n如果你是Debian的新手，值得一提的是，你在他们的官方维基上获得了关于所有东西的可靠文档。所以，这应该不是一个开始的问题。\n您可以浏览可用的安装程序来安装它。然而，在您继续之前，我建议您在安装Debian之前，除了参考其安装手册之外，还要参考需要记住的事项列表。\n如果你只是想快速启动一台设备进行一些临时工作，Slax是一个令人印象深刻的选择。\n它是基于Debian的，但它的目标是成为一个便携和快速的选择，意味着可以通过USB设备或DVD运行。你可以从他们的网站上免费下载32位ISO文件，或者购买预装Slax的可重写DVD/加密光盘。\n当然，这并不意味着要取代传统的桌面操作系统。但是，是的，您确实得到了以Debian为基础的32位支持。\n又一个令人印象深刻的基于Debian的发行版。Antix通常被认为是一个非system d的发行版，它在轻量级安装的同时注重性能。\n它非常适合任何旧的32位系统。给你一个概念，它只需要256MB内存和2.7 GB的存储空间。不仅安装简单，而且用户体验既面向新手，也面向经验丰富的用户。\n您应该获得基于Debian最新稳定分支的最新版本。\nOpenSUSE是一个独立的Linux发行版，也支持32位系统。尽管最新的常规版本(Leap)不提供32位图片，但滚动发布版(Tumbleeed)确实提供了32位图片。\n如果你是新人，那将是一种完全不同的体验。不过，我建议您详细说明应该使用OpenSUSE的原因。\n它主要面向开发人员和系统管理员，但您也可以作为普通桌面用户使用它。值得注意的是，OpenSUSE并不是要在老式硬件上运行--所以你必须确保你至少有2 GB的内存、40+GB的存储空间和双核处理器。\nEmmabuntus是一个有趣的发行版，旨在通过32位支持延长硬件的寿命以减少原材料的浪费。作为一个团体，他们还参与向学校提供计算机和数字技术。\n它提供了两个不同的版本，一个基于Ubuntu，另一个基于Debian。如果你想要更长的32位支持，你可能会选择Debian版本。这可能不是最好的选择，但如果你想在这个过程中支持他们的事业，这是一个不错的选择，因为有一些预配置的软件可以让Linux学习体验变得容易，并提供32位支持。\nNixOS是另一个支持32位系统的独立Linux发行版。它专注于提供一个可靠的系统，在该系统中，包相互隔离。\n这可能不是直接面向普通用户的，但它是一个基于KDE的可用发行版，具有独特的包管理方法。你可以在它的官方网站上了解更多关于它的功能。\n如果您是一位经验丰富的Linux用户，并且正在寻找32位Linux发行版，那么Gentoo Linux应该是一个很好的选择。\n如果需要，您可以通过Gentoo Linux的包管理器轻松地配置、编译和安装内核。不仅限于它的可配置性(这一点广为人知)，您还可以在较旧的硬件上运行它，而不会出现任何问题。\n即使你不是一个有经验的用户，并且想试一试，只要通读一下安装说明，你就会经历一次冒险。\nDevuan是另一个不受系统限制的发行版。从技术上讲，它是Debian的一个分支，只是没有系统和鼓励Init自由。\n对于普通用户来说，它可能不是一个非常流行的Linux发行版，但如果你想要一个无系统的发行版和32位支持，Devuan应该是一个很好的选择。\nVoid Linux是一个由志愿者独立开发的有趣的发行版。它的目标是成为一个通用操作系统，同时提供一个稳定的滚动发布周期。它将RUnit作为init系统，而不是systemd，并为您提供了多种桌面环境的选项。\n它有一个非常令人印象深刻的最低要求规格，只有96MB的RAM与奔腾4(或同等)芯片配对。试试看！\nQ4OS是另一个基于Debian的发行版，专注于提供最低限度和快速的桌面用户体验。它也恰好是我们列表中最好的轻量级Linux发行版之一。它以32位版本的三一台式机为特色，你可以在64位版本上找到KDE等离子支持。\n与void Linux类似，Q4OS也运行在至少128MB的RAM和300 MHz的CPU上，需要3 GB的存储空间。对于任何老式硬件来说，这应该是绰绰有余的。所以，我想说，你绝对应该试一试！\n如果你有一个稍微不错的配置(不是完全老式的，而是老的)，MX Linux将是我个人推荐的32位系统。它也恰好是最适合每种类型用户的Linux发行版之一。\n总的来说，MX Linux是一个非常棒的基于Debian的轻量级和可定制的发行版。您可以选择KDE、XFCE或FLuxbox(这是它们自己的桌面环境，适用于较旧的硬件)。你可以在他们的官方网站上探索更多关于它的信息，然后试一试。\nFunToo是一个基于Gentoo的社区开发的Linux发行版。它的重点是为您提供Gentoo Linux的最佳性能，以及一些额外的包来为用户提供完整的体验。有趣的是，这个开发实际上是由Gentoo Linux的创建者Daniel Robbins领导的。\n当然，如果您是Linux的新手，那么您在这里的体验可能并不是最好的。但是，它确实支持32位系统，并且在许多较旧的英特尔/AMD芯片组上运行良好。在它的官方网站上探索更多关于它的信息，看看你是否想尝试一下。\n我把重点放在了基于Debian的发行版和一些独立发行版上。不过，如果你不介意长期支持，只想得到一个32位支持的镜像，你也可以尝试任何基于Ubuntu18.04的发行版(或任何官方版本)。\n在写这篇文章的时候，他们只剩下几个月的软件支持了。因此，我避免提到这是主要的选择。但是，如果你喜欢基于Ubuntu18.04的发行版或它的任何一种风格，你确实有LXLE、Linux Lite、Zorin Lite 15和其他官方风格的选择。\n尽管大多数基于Ubuntu的现代桌面操作系统已经放弃了对32位的支持。你还有很多选择。\n您希望在32位系统上安装什么？请在下面的评论中告诉我你的想法。", "note_en": "If you’ve been keeping up with the latest  Linux distributions, you must have noticed that 32-bit support has been dropped from  most of the popular Linux distributions. Arch Linux, Ubuntu, Fedora, everyone has dropped the support for this older architecture.\n But, what if you have vintage hardware with you that still needs to be revived or you want to make use of it for something? Fret not, there are still a few options left to choose from for your 32-bit system.\n In this article, I’ve tried to compile some of the best Linux distributions that will keep on supporting 32-bit platform for next few years.\n   This list is a bit different from  our earlier list of Linux distributions for old laptops. Even 64-bit computers can be considered old if they were released before 2010. This is why some suggestions listed there included distros that only support 64-bit now.\n The information presented here are correct as per my knowledge and findings but if you find otherwise, please let me know in the comment section.\n Before you go on, I suppose you know  how to check if you have a 32 bit or 64 bit computer.\n    Debian is a fantastic choice for 32-bit systems because they still support it with their latest stable release. At the time of writing this, the latest stable release  Debian 10 “buster” offers a 32-bit version and is supported until 2024.\n If you’re new to Debian, it is worth mentioning that you get solid documentation for everything on their  official wiki. So, it shouldn’t be an issue to get started.\n You can browse through the  available installers to get it installed. However, before you proceed, I would recommend referring to the list of  things to remember before installing Debian in addition to its  installation manual.\n    If you just want to quickly boot up a device for some temporary work, Slax is an impressive option.\n It is based on Debian but it aims to be a portable and fast option that is meant to be run through USB devices or DVDs. You can download the 32-bit ISO file from their website for free or purchase a rewritable DVD/encrypted pendrive with Slax pre-installed.\n Of course, this isn’t meant to replace a traditional desktop operating system. But, yes, you do get the 32-bit support with Debian as its base.\n    Yet another impressive Debian-based distribution. AntiX is popularly known as a systemd-free distribution which focuses on performance while being a lightweight installation.\n It is perfectly suitable for just about any old 32-bit system. To give you an idea, it just needs 256 MB RAM and 2.7 GB storage space at the very least. Not just easy to install, but the user experience is focused for both newbies and experienced users as well.\n You should get the latest version based on Debian’s latest stable branch available.\n    openSUSE is an independent Linux distribution that supports 32-bit systems as well. Even though the latest regular version (Leap) does not offer 32-bit images, the rolling release edition (Tumbleweed) does provide 32-bit image.\n It will be an entirely different experience if you’re new. However, I suggest you to go through the  reasons why you should be using openSUSE.\n It is mostly focused for developers and system administrators but you can utilize it as an average desktop user as well. It is worth noting that openSUSE is not meant to run on vintage hardware — so you have to make sure that you have at least 2 GB RAM, 40+ GB storage space, and a dual core processor.\n    Emmabuntus is an interesting distribution that aims to extend the life of the hardware to reduce waste of raw materials with 32-bit support. As a group they’re also involved in providing computers and digital technologies to schools.\n It offers two different editions, one based on Ubuntu and the other based on Debian. If you want a longer 32-bit support, you may want to go with the Debian edition. It may not be the best option, but with a number of pre-configured software to make the Linux learning experience easy and 32-bit support, it is a decent option if you want to support their cause in the process.\n    NixOS is yet another independent Linux distribution that supports 32-bit systems. It focuses on providing a reliable system where packages are isolated from each other.\n This may not be directly geared towards average users but it is a KDE-powered usable distribution with a unique approach to package management. You can learn more about its  features from its official website.\n    If you’re an experienced Linux user and looking for a 32-bit Linux distributions, Gentoo Linux should be a great choice.\n You can easily configure, compile, and install a kernel through package manager with Gentoo Linux if you want. Not just limited to its configurability, which it is popularly known for, you will also be able to run it without any issues on older hardware.\n Even if you’re not an experienced user and want to give it a try, simply read through the  installation instructions and you will be in for an adventure.\n    Devuan is yet another systemd-free distribution. It is technically a fork of Debian, just without systemd and encouraging  Init freedom.\n It may not be a very popular Linux distribution for an average user but if you want a systemd-free distribution and 32-bit support, Devuan should be a good option.\n    Void Linux is an interesting distribution independently developed by volunteers. It aims to be a general purpose OS while offering a stable rolling release cycle. It features runit as the init system instead of systemd and gives you the option of several  desktop environments.\n It has an extremely impressive minimum requirement specification with just 96 MB of RAM paired up with Pentium 4 (or equivalent) chip. Try it out!\n    Q4OS is another Debian-based distribution that focuses on providing a minimal and fast desktop user experience. It also happens to be one of the  best lightweight Linux distributions in our list. It features the  Trinity desktop for its 32-bit edition and you can find KDE Plasma support on 64-bit version.\n Similar to Void Linux, Q4OS also runs on a bare minimum of at least 128 MB RAM and a 300 MHz CPU with a 3 GB storage space requirement. It should be more than enough for any vintage hardware. So, I’d say, you should definitely try it out!\n     If you’ve got a slightly decent configuration (not completely vintage but old), MX Linux would be my personal recommendation for 32-bit systems. It also happens to be one of the  best Linux distributions for every type of user.\n In general, MX Linux is a fantastic lightweight and customizable distribution based on Debian. You get the option to choose from KDE, XFCE or Fluxbox (which is their own desktop environment for older hardware). You can explore more about it on their official website and give it a try.\n   Funtoo is a Gentoo-based community-developed Linux distribution. It focuses on giving you the best performance with Gentoo Linux along with some extra packages to make the experience complete for users. It is also interesting to note that the development is actually led by Gentoo Linux’s creator  Daniel Robbins.\n Of course, if you’re new to Linux, you may not have the best experience here. But, it does support 32-bit systems and works well across many older Intel/AMD chipsets. Explore more about it on its official website to see if you want to try it out.\n   I focused the list on Debian-based and some Independent distributions. However, if you don’t mind long term support and just want to get your hands on a 32-bit supported image, you can try any Ubuntu 18.04 based distributions (or any official flavour) as well.\n At the time of writing this, they just have a few more months of software support left. Hence, I avoided mentioning it as the primary options. But, if you like Ubuntu 18.04 based distros or any of its flavours, you do have options like  LXLE,  Linux Lite,  Zorin Lite 15, and other official flavours.\n Even though most modern desktop operating systems based on Ubuntu have dropped support for 32-bit support. You still have plenty of choices to go with.\n What would you prefer to have on your 32-bit system? Let me know your thoughts in the comments below.", "posttime": "2020-11-06 08:05:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,distributions", "title": "您可以在古代32位计算机上使用的Linux发行版", "title_en": "Linux Distributions You Can Rely on for Your Ancient 32-Bit Computer", "transed": 1, "url": "https://itsfoss.com/32-bit-linux-distributions/", "via": "", "real_tags": ["linux"]}, {"category": "", "categoryclass": "", "imagename": "c1acc44b2ae98fc9049497a4b03751c8.jpg", "infoid": 1033472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "预计将成为首款苹果Silicon Mac核心的芯片--A14X；A14X；，可能在下一次苹果发布会前几天完成了基准测试。\n据称，A14X的CPU基准显示，其1.80 GHz处理器的涡轮增压能力达到3.10 GHz，这是有史以来第一个超过3 GHz的定制苹果硅片。它是一款8核处理器，采用大到小的配置。GPU结果显示，处理器将包含8 GB的RAM。\nA14X；的单核基准得分为1634分，而A12Z为1118分。A14在单核测试中得了1583分，预计单核测试结果在普通机型和普通机型之间不会有太大变化。\nA14X；的多核基准得分为7220分，而A12Z为4657分。A14的多核性能得分为4198，这意味着A14X在Geekbench测试套件所关注的各种环境中的性能都有显著提升。额外的RAM和显卡功能使这一结果比标准iPhone处理器高得多。\n相比之下，搭载英特尔酷睿i9处理器的16英寸MacBook Pro单核测试得分为1096，多核测试得分为6869。这意味着所谓的A14X&34；比现有的MacBook Pro产品有显著的优势。\n据报道，这项基准测试是用Geekbench 5在一台未知设备上进行的。目前尚不清楚这一基准是不是真实的，AppleInsider也无法确切地核实信息的出处。\n如果准确的话，这些测试是一个很好的迹象，表明搭载苹果硅片的Mac电脑将会有性能提升。苹果预计将在11月10日的发布会上发布一款13英寸的MacBook Air、13英寸的MacBook Pro和16英寸的MacBook Pro。\nAppleInsider与会员有合作关系，通过会员链接购买的产品可能会赚取佣金。这些合作关系不会影响我们的编辑内容。", "note_en": "The chip expected to be at the core of the first  Apple Silicon Mac — the &#34;A14X&#34; — may have been benchmarked just days before the next Apple event.\n  The alleged CPU benchmarks for the &#34;A14X&#34; show a 1.80GHz processor capable of turbo-boosting to 3.10GHz marking this the first custom Apple Silicon to ever clock above 3GHz. It is an 8-core processor with big-little arrangement. The GPU results show 8GB of RAM will be included with the processor.\n The single-core benchmark for the &#34;A14X&#34; scored 1634 vs the  A12Z at 1118. The A14  scored 1,583 points for single-core tests, which is expected as single-core results shouldn&#39;t change much between the regular and &#34;X&#34; models.\n The multi-core benchmark for the &#34;A14X&#34; scored 7220 vs the A12Z at 4657. The A14 scored 4198 for multi-core, which means the &#34;A14X&#34; delivers a marked increase in performance in the sorts of environments that the GeekBench test suite focuses on. The additional RAM and graphics capabilities boost this result much higher than the standard  iPhone processor.\n For comparison, a  16-inch MacBook Pro with the Intel Core-i9 processor scores 1096 for single and 6869 for multi-core tests. This means the alleged &#34;A14X&#34; outperforms the existing MacBook Pro lineup by a notable margin.\n The benchmark testing was reportedly performed with Geekbench 5 on an unknown device. It is unknown if this benchmark is real, and  AppleInsider was unable to verify the provenance of the information with certainty.\n If accurate, the tests are a good indication of the performance gains a Mac with Apple Silicon will have. Apple is expected to announce a 13-inch  MacBook Air,  13-inch MacBook Pro, and 16-inch MacBook Pro during the November 10 &#34;One More Thing&#34;  event.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2020-11-06 08:03:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,apple,基准,bionic,处理器", "title": "据称，A14X Bionic在Apple Silicon Mac发布会前几天进行了基准测试", "title_en": "A14X Bionic allegedly benchmarked days before Apple Silicon Mac event", "transed": 1, "url": "https://appleinsider.com/articles/20/11/05/a14x-bionic-allegedly-benchmarked-days-before-apple-silicon-mac-event", "via": "", "real_tags": ["发布", "apple", "基准", "bionic", "处理器"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1033471, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过多年来对开放获取的强烈抵制，学术出版商基本上接受并推广了这一想法，确保了他们35%-40%的利润率能够持续下去。鉴于这种对开放获取的最初希望的颠覆，人们想出了其他方式来提供免费和无摩擦的知识获取--其中大部分是由世界各地的纳税人支付的。一种是预印本，研究人员越来越多地使用预印本来广泛传播他们的研究结果，而不需要担心付款或看门人的问题。另一种是通过网站提供对大量学术论文的即时访问--即所谓的影子图书馆。其中最著名的是由Alexandra Elbakyan创建的Sci-Hub。在撰写本文时，Sci-Hub声称拥有7900万篇论文。\n即使是能够通过机构订阅获得出版物的学者，也往往更喜欢使用Sci-Hub，因为它要简单得多，速度也快得多。在这方面，Sci-Hub不断受到学术出版商的指责，强调他们的产品在为图书馆提供服务方面做得不是很好，图书馆需要支付昂贵的订阅费才能访问。因此，Sci-Hub成为学术出版商的头号敌人也就不足为奇了，尤其是领先的爱思唯尔公司(Elsevier)。德国网站Netzpoltik发现了出版商正在采取的最新方法，以应对这个不方便但非常成功的竞争对手，以及其他影子图书馆。它的核心是学术网络安全倡议(SNSI)，该倡议是由爱思唯尔和其他大型出版商在今年早些时候创立的。NetzPoltik解释说，我们的想法是跟踪和分析对图书馆的每一次访问，因为安全：\n爱思唯尔正在为使用安全技术升级图书馆而奔走。在由爱思唯尔两位高级经理主持的题为《网络安全景观--保护学术基础设施》的SNSI网络研讨会上，一位发言人建议出版商开发自己的代理或代理插件，以便图书馆访问更多(使用)数据(开发或补贴低成本代理或现有代理的插件)。\n在分析引擎的帮助下，不仅可以更好地缩小访问范围，还可以记录生物特征数据(例如，打字速度)或明显的使用模式(例如，药学专业的学生突然对天体物理学感兴趣)。任何关于这款软件是否也可以用来对付影子库的怀疑--如果不是主要的话--都被下一位演讲者打消了。一位前FBI分析师和IT安全顾问谈到了与使用Sci-Hub相关的安全风险。\n由于学术出版商无法在易用性或便利性上与Sci-Hub竞争，他们正在尝试旧的安全风险角度--早期传统软件公司也曾使用这个角度来对抗开源软件。是的，他们说，科学中心/开源似乎是免费的、更好的，但想想…可怕的安全风险吧。SNSI主网站上的一个常见问题解答解释了为什么Sci-Hub被认为是一个安全风险：\nSCI-Hub可能属于国家支持的演员类别。它托管着被盗的研究论文，这些论文是从出版商平台上窃取的，通常使用窃取的用户凭证。据《华盛顿邮报》报道，美国司法部目前正在调查Sci-Hub创始人亚历山德拉·埃尔巴卡扬(Alexandra Elbakayan)与俄罗斯情报机构之间的联系。如果这项调查有实质内容，那么使用Sci-Hub访问研究论文可能会产生更广泛的影响，而不仅仅是访问隐藏在付费墙后面的内容。\n正如《华盛顿邮报》那篇文章发表时Techdirt指出的那样，没有证据表明埃尔巴基安与俄罗斯情报机构之间有任何联系。事实上，人们很难不认为，这起调查仅仅是学术出版商发出同样毫无根据的指控，并要求采取行动的结果。《研究信息》(Research Information)上的一篇文章提供了更多细节，说明除了访问付费墙后面的内容之外，还有哪些更广泛的后果：\n在Sci-Hub的具体案例中，学术内容(期刊文章和书籍)是通过各种方法非法获取的，例如滥用合法登录凭据访问主要大学的安全计算机网络，以及通过劫持合法用户的代理凭据来方便校外远程访问大学计算机系统和数据库。这些行动导致进入大学网络的大门被打开，Sci-Hub，可能还有其他机构，可以通过这个网络访问其他有价值的机构数据库，如人事和医疗记录、专利信息和授权细节。\n但在这种情况下，事情不是这样运作的。Sci-Hub使用的合法用户凭证--通常是那些认为论文应该被广泛使用的学者很乐意借给他们的--纯粹是为了访问系统中的文章。它们不提供对其他有价值的机构数据库的访问--当然也不会提供人员和医疗记录等敏感信息--除非这些数据库是由彻头彻尾的白痴设计的。这纯粹是危言耸听，而这种进一步的说法是荒谬的：\n此类活动威胁到学术交流生态系统和学术记录的完整性。SCI-Hub没有动机确保被访问的研究文章的准确性，没有动机确保研究符合道德标准，也没有动机在出现问题时撤回或更正。\nSCI-Hub只是为每个人提供免费、无障碍地访问学术出版商现有文章的机会。这些文章仍然像它们第一次出现时一样准确和合乎道德。指责Sci-Hub通过提供普遍接入来威胁学术交流生态系统，这是荒谬的。这也暴露了传统出版商对不受控制地传播公共资助的人类知识的态度，这是他们真正害怕的，也是他们用新的SNSI运动攻击的。\n感谢您阅读这篇科技泥土文章。这几天有这么多事情争相吸引大家的注意力，我们真的很感谢您抽出时间来参加我们的活动。我们每天都在努力工作，为我们的社区提供高质量的内容。\nTechash是为数不多的真正独立的媒体机构之一。我们背后没有一家大公司，我们在很大程度上依赖我们的社区来支持我们，在这个时代，广告商对赞助小型独立网站越来越不感兴趣--特别是像我们这样一个不愿在报道和分析方面出手相向的网站。\n虽然其他网站已经求助于付费墙、注册要求和越来越烦人的/侵入性广告，但我们一直保持Techash对任何人开放和可用。但为了继续这样做，我们需要你们的支持。我们为读者提供了各种各样的方式来支持我们，从直接捐款到特别订阅和酷商品--每一点都有帮助。谢谢。", "note_en": "After many years of fierce resistance to  open access, academic publishers have largely embraced -- and extended -- the idea, ensuring that their  35-40% profit margins live on. In the light of this subversion of the original hopes for open access, people have come up with other ways to provide free and frictionless access to knowledge -- most of which is paid for by taxpayers around the world. One is  preprints, which are increasingly used by researchers to disseminate their results widely, without needing to worry about payment or gatekeepers. The other is through sites that have taken it upon themselves to offer immediate access to large numbers of academic papers -- so-called &#34;shadow libraries&#34;. The most famous of these sites is  Sci-Hub, created by Alexandra Elbakyan. At the time of writing,  Sci-Hub claims to hold 79 million papers.\n Even academics with access to publications through their institutional subscriptions often prefer to use Sci-Hub, because it is so much simpler and quicker. In this respect, Sci-Hub stands as a constant reproach to academic publishers, emphasizing that their products aren&#39;t very good in terms of serving libraries, which are paying expensive subscriptions for access. Not surprisingly, then, Sci-Hub has become Enemy No. 1 for academic publishers in general, and the leading company  Elsevier in particular. The German site Netzpolitik has spotted the latest approach being taken by publishers to tackle this inconvenient and hugely successful rival, and other shadow libraries. At its heart lies the  Scholarly Networks Security Initiative (SNSI), which was founded by Elsevier and other large publishers earlier this year. Netzpolitik explains that the idea is to  track and analyze every access to libraries, because &#34;security&#34;:\n Elsevier is campaigning for libraries to be upgraded with security technology. In a SNSI webinar entitled &#34;Cybersecurity Landscape -- Protecting the Scholarly Infrastructure&#34;, hosted by two high-ranking Elsevier managers, one speaker recommended that publishers develop their own proxy or a proxy plug-in for libraries to access more (usage) data (&#34;develop or subsidize a low cost proxy or a plug-in to existing proxies&#34;).\n With the help of an &#34;analysis engine&#34;, not only could the location of access be better narrowed down, but biometric data (e.g. typing speed) or conspicuous usage patterns (e.g. a pharmacy student suddenly interested in astrophysics) could also be recorded. Any doubts that this software could also be used -- if not primarily -- against shadow libraries were dispelled by the next speaker. An ex-FBI analyst and IT security consultant spoke about the security risks associated with the use of Sci-Hub.\n Since academic publishers can&#39;t compete against Sci-Hub on ease of use or convenience, they are trying the old &#34;security risk&#34; angle -- also used by traditional software companies against open source in the early days. Yes, they say, Sci-Hub/open source may  seem free and better, but think of the terrible security risks… An FAQ on the main SNSI site provides an &#34;explanation&#34; of  why Sci-Hub is supposedly a security risk:\n Sci-Hub may fall into the category of state-sponsored actors. It hosts stolen research papers which have been harvested from publisher platforms often using stolen user credentials. According to the Washington Post, the US Justice Department is currently investigating the founder of Sci-Hub, Alexandra Elbakayan, for links between her and Russian Intelligence. If there is substance to this investigation, then using Sci-Hub to access research papers could have much wider ramifications than just getting access to content that sits behind a paywall.\n As Techdirt pointed out when that Washington Post article came out, there is no evidence of any connections between Elbakyan and Russian Intelligence. Indeed, it&#39;s hard not to see the investigation as simply the result of whining academic publishers making the same baseless accusation, and demanding that something be &#34; done&#34;.  An article in Research Information provides more details about what those &#34;wider ramifications than just getting access to content that sits behind a paywall&#34; might be:\n In the specific case of Sci-Hub, academic content (journal articles and books) is illegally harvested using a variety of methods, such as abusing legitimate log in credentials to access the secure computer networks of major universities and by hijacking &#34;proxy&#34; credentials of legitimate users that facilitate off campus remote access to university computer systems and databases. These actions result in a front door being opened up into universities&#39; networks through which Sci-Hub, and potentially others, can gain access to other valuable institutional databases such as personnel and medical records, patent information, and grant details.\n But that&#39;s not how things work in this context. The credentials of legitimate users that Sci-Hub draws on -- often gladly &#34;lent&#34; by academics who believe papers should be made widely available -- are purely to access articles held on the system. They do not provide access to &#34;other valuable institutional databases&#34; -- and certainly not sensitive information such as &#34;personnel and medical records&#34; -- unless they are designed by complete idiots. That is pure scaremongering, while this further claim is just ridiculous:\n Such activities threaten the scholarly communications ecosystem and the integrity of the academic record. Sci-Hub has no incentive to ensure the accuracy of the research articles being accessed, no incentive to ensure research meets ethical standards, and no incentive to retract or correct if issues arise.\n Sci-Hub simply provides free, frictionless access for everyone to existing articles from academic publishers. The articles are still as accurate and ethical as they were when they first appeared. To accuse Sci-Hub of &#34;threatening&#34; the scholarly communications ecosystem by providing universal access is absurd. It&#39;s also revealing of the traditional publishers&#39; attitude to the uncontrolled dissemination of publicly-funded human knowledge, which is what they really fear and are attacking with the new SNSI campaign.\n  Thank you for reading this Techdirt post. With so many things competing for everyone’s attention these days, we really appreciate you giving us your time. We work hard every day to put quality content out there for our community.\n Techdirt is one of the few remaining truly independent media outlets. We do not have a giant corporation behind us, and we rely heavily on our community to support us, in an age when advertisers are increasingly uninterested in sponsoring small, independent sites — especially a site like ours that is unwilling to pull punches in its reporting and analysis.\n While other websites have resorted to paywalls, registration requirements, and increasingly annoying/intrusive advertising, we have always kept Techdirt open and available to anyone. But in order to continue doing so,  we need your support. We offer a variety of ways for our readers to support us, from direct donations to special subscriptions and cool merchandise — and every little bit helps. Thank you.", "posttime": "2020-11-06 08:02:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,free,访问", "title": "为了阻止免费获取知识，出版商希望图书馆员害怕", "title_en": "To Prevent Free Access to Knowledge, Publishers Want Librarians to Be Afraid", "transed": 1, "url": "https://www.techdirt.com/articles/20201029/04034145611/to-prevent-free-frictionless-access-to-human-knowledge-publishers-want-librarians-to-be-afraid-very-afraid.shtml", "via": "", "real_tags": ["免费", "free", "访问"]}, {"category": "", "categoryclass": "", "imagename": "09b83b21d8780256c786a014a2572e2b.jpg", "infoid": 1033470, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ARM在解决便携式设备之外的问题已经有一段时间了。今天，该公司提供自动驾驶汽车、通信、边缘计算以及各种智能手机和平板电脑。然而，该公司将ARM笔记本电脑上的Windows这一新兴市场留给了高通(Qualcomm)的骁龙(Snapgon)。不过，用不了多久，ARM就在本周推出了自己的笔记本处理器Cortex-A78c。\n智能ARM Cortex-A78c是在用于智能手机和平板电脑的Cortex-A78的基础上构建的，但经过定制，可提供在笔记本和其他类型的个人电脑上运行的工作负载所需的性能。ARM表示，搭载Cortex-A78c的笔记本电脑将提供全天电池续航能力，但也能够运行要求苛刻的应用程序，如专业生产力套件和游戏。\nCortex-A78c最高支持八核Dynamiq群集(每个核256 KB或512 KB L2)，运行频率高达3.30 GHz，并配备高达8 MB的L3高速缓存，以最大限度地提高单线程性能以及在具有大数据集的应用程序中的性能。为了进一步提高性能，新的CPU增加了监听过滤器，并可以配置切片以优化计时。此外，Cortex-A78c还具有先进的安全功能，例如指针身份验证(PAC)，旨在降低面向返回编程(ROP)和面向跳转编程(JOP)攻击的可能性。ARM还建议将其Cortex-A78c与其最新的马里-G78图形集群搭配使用，以确保游戏的出色性能。\nCortex-A78c最多搭载8个大的Cortex-A78内核，带有所有性能提升的调谐功能，并省略了小的Cortex-A55内核，自然会以功耗换取性能。然而，考虑到CPU是为拥有大容量电池的笔记本电脑设计的，这样的权衡是完全合理的。\n在很大程度上，Cortex-A78c与高通(Qualcomm)的骁龙8cx和8cx Gen 2非常相似，这两款机型都配备了8个Big Kryo 495内核以及最先进的Adreno 680/690显卡。与此同时，了解ARM和高通(Qualcomm)最新推出的笔记本电脑与苹果(Apple)即将推出的笔记本电脑片上系统(System-on-Chip)相比会有何不同，这将是一件特别有趣的事情。\nARM的Cortex-A78c的发布意味着，开发者要么已经可以使用它作为SIP核心，要么即将可以使用。尽管我们可能在讨论最新的处理技术，但开发人员并未透露此设计针对的是哪些节点。与此同时，第一批由Cortex-A78c驱动的SoC最早将在一年后上市，所以至少在2022年上半年之前，不要指望基于Cortex-A78c的笔记本电脑。\nARM宣布这一消息的时机看起来恰到好处。微软即将在ARM平台上的Windows 10中启用x64仿真，因此后者将能够运行现有的所有应用程序(另一个问题是这种仿真运行得有多好)。此外，微软实际上是在Windows 10中加倍支持ARM，发布了微软团队和专门针对ARM SoC进行优化的Visual Studio，并扩展了App Assue计划，将Windows 10包括在ARM 64位设备上。因此，当Cortex-A78c驱动的SoC和笔记本电脑投放市场时，Windows on ARM软件生态系统将比现在好得多。\n与此同时，ARM必须确保其拥有8个高性能内核的Dynamiq集群能够在Windows 10下正常运行。此外，为了提供良好的性能，并与利用图形处理的游戏和应用程序兼容，ARM将不得不为其最新的GPU开发合适的Windows 10、Chrome OS和Linux驱动程序。图形处理器开发商在驱动程序上花费了大量资源，并与独立软件供应商(ISV)合作，因此ARM也将不得不这么做。\n如果NVIDIA获准收购ARM，Cortex-A78c或其后继者可能配备GeForce GPU内核，并利用这家总部位于圣克拉拉的公司的驱动程序，但目前SoC开发者将不得不坚持使用ARM的马里。\n与此同时，ARM在其Cortex-A78c新闻稿中明显不关注软件，这是一个合乎逻辑的决定，因为该公司不仅要押注于ARM上的Windows 10，还要押注于谷歌(Google)的Chrome OS和其他操作系统。\nCortex-A78c显然为ARM打开了一些新的大门，使各种没有自己CPU核心的SoC开发者能够在笔记本电脑设计方面与高通(Qualcomm)的骁龙8cx及其后继者展开竞争。毫无疑问，将有更多高端ARM SoC用于笔记本电脑，以对抗高通(Qualcomm)的骁龙(Snapgon)以及低功耗的x86处理器，这对市场是件好事。\n但是，将CPU设计甚至实际的SoC推出只是工作的一部分。ARM将不得不为其Cortex-A78c和马里显卡提供软件支持，而其合作伙伴可能不得不为PC制造商开发某种基于ARM的参考设计，以确保快速上市。\n还有待观察的是，ARM的哪个合作伙伴会真正授权Cortex-A78c在一个新兴且相对较小的市场上对抗强大的高通(Qualcomm)。\nARM向个人电脑的扩张对该公司来说是一个自然的过程，但要挑战AMD和英特尔绝对不是一件容易的事。但ARM似乎有一个有趣的支持者：苹果向基于ARM的SoC转型。\n苹果一直有自己的战略，考虑到全球的主要趋势，但从来没有考虑过其他公司的计划，也没有与他们保持一致。为此，苹果的转型和ARM的扩张显然是两件不相关的事情。然而，苹果可能在不经意间帮助了Windows on ARM计划。\n每季度售出约400万台Mac电脑，苹果可以向软件开发商保证，数千万台Mac电脑将在几年后运行ARM SoC。因此，独立软件开发商将非常倾向于针对苹果的SoC和ARM来优化他们的产品。虽然苹果高度定制的ARM内核与ARM自己的内核没有多大关系，但它们仍然共享一个共同的架构。\n2020年第三季度，苹果占据了个人电脑销量的8.5%，加之这些将是基于ARM的系统。因此，如果高通和其他ARM合作伙伴在PC SoC方面取得了一定的成功，ARM架构将在超过10%的PC中使用，这一份额足以让软件制造商考虑到。这就是说，ARM的Cortex-A78c恰到好处。", "note_en": "Arm has been addressing devices above and beyond portables for a while now. Today the company has offerings for autonomous vehicles, communications, edge computing, and all kinds of smartphones and tablets. Yet, the company left the emerging market of Windows on Arm laptops to Qualcomm&#39;s Snapdragon. Not for long though as this week Arm  introduced its own processor for laptops, the Cortex-A78C.\n  The  Arm Cortex-A78C is built on the foundation of the Cortex-A78 for smartphones and tablets, but is customized to offer the performance required for workloads that are run on notebooks and other types of personal computers. Arm says that Cortex-A78C-powered laptops will offer all-day battery life, but will also be capable of running demanding applications, such as professional productivity suites as well as games.\n  The Cortex-A78C supports up to eight-core DynamIQ clusters (with 256 KB or 512 KB L2 per core) operating at up to 3.30 GHz and comes with up to 8 MB L3 cache to maximize single-threaded performance as well as performance in applications with large datasets. To further improve performance, the new CPU features an increased snoop filter and can configure slicing to optimize timings. In addition, the Cortex-A78C features advanced security capabilities, such as Pointer Authentication (PAC) that is designed to reduce possibility of Return-Orientated-Programming (ROP) and Jump-Orientated-Programming (JOP) attacks. Arm also recommends pairing its Cortex-A78C with its latest Mali-G78 graphics clusters in a bid to ensure great performance in games.\n  By packing up to eight &#39;big&#39; Cortex-A78 cores with all the performance-enhancing tunings and omitting &#39;little&#39; Cortex-A55 cores, the Cortex-A78C naturally trades power consumption for performance. Yet, considering the fact that the CPU is designed for laptops with huge batteries, such a trade off is completely justified.\n   To a large degree, the Cortex-A78C resembles Qualcomm&#39;s Snapdragon 8cx and 8cx Gen 2 that also feature eight &#39;big&#39; Kryo 495 cores as well as the state-of-the-art Adreno 680/690 graphics. Meanwhile, it will be particularly interesting to learn how the latest laptop offerings from Arm and Qualcomm will compare to Apple&#39;s upcoming system-on-chips for its notebooks.\n  The announcement of Arm&#39;s Cortex-A78C means that it is either already available to developers as a SIP core, or is about to become available. The developer does not disclose which nodes it targets with this design, though we are probably talking about the latest process technologies. Meanwhile, the first SoCs powered by the Cortex-A78C will be available a year from now at the earliest, so do not expect Cortex-A78C-based notebooks till at least the first half of 2022.\n  The timing of Arm&#39;s announcement looks just right. Microsoft is about to enable  x64 emulation in Windows 10 on Arm platforms, so the latter will be able to run all applications that are out there (another question is how well this emulation works). Furthermore, Microsoft is actually doubling down on support of Arm in Windows 10 by releasing Microsoft Teams and Visual Studio optimized specifically for Arm SoCs as well as expanding its App Assure program to include Windows 10 on Arm 64-bit devices. As a result, by the time Cortex-A78C-powered SoCs and laptops hit the market, Windows on Arm software ecosystem will be considerably better than it is today.\n   At the same time, Arm will have to ensure that its DynamIQ clusters with eight high-performance cores work properly under Windows 10. In addition, in a bid to provide decent performance and compatibility with games and applications that take advantage of graphics processing, Arm will have to develop proper Windows 10, Chrome OS, and Linux drivers for its latest GPUs. Developers of graphics processors spend tremendous resources on drivers and work with ISVs (independent software vendors), so Arm will have to do the same as well.\n If Nvidia is allowed to acquire Arm, the Cortex-A78C or its successors could be paired with GeForce GPU cores and take advantage of drivers from the Santa Clara-based company, but for now SoC developers will have to stick to Arm&#39;s Mali.\n Meanwhile, Arm was prominently software-agnostic in its Cortex-A78C press release, which is a logical decision as the company has to bet not only on Windows 10 on Arm, but also on Google&#39;s Chrome OS and other operating systems.\n  The Cortex-A78C clearly opens some new doors to Arm and enables various SoC developers without their own CPU cores to compete against Qualcomm&#39;s Snapdragon 8cx and its successors for notebook designs. Without any doubts, it is good for the market that there will be more high-end Arm SoCs for laptops to fight against Qualcomm&#39;s Snapdragon as well as low-power x86 processors.\n  But getting CPU design and even actual SoCs out the door is only a part of the job. Arm will have to take care of software support for its Cortex-A78C as well as Mali graphics, whereas its partners will probably have to develop some kind of Arm-powered reference designs for PC makers to ensure quick time to market.\n What remains to be seen is which of Arm&#39;s partners will actually license the Cortex-A78C to fight against might Qualcomm on an emerging and a relatively small market.\n  Arm&#39;s expansion to PCs is a natural process for the company, yet it is definitely not going to be easy to challenge AMD and Intel. But Arm seems to have an interesting supporter in its endeavor: Apple&#39;s transition to its own Arm-based SoCs.\n  Apple has always had its own strategy that considered major global trends, but never took into account plans of other companies or was aligned with them. To that end, it is obvious that Apple&#39;s transition and Arm&#39;s expansion are unrelated events. Yet, Apple could inadvertently help Windows on Arm initiative.\n Selling around 4 million Macs every quarter, Apple can guarantee software developers that tens of millions of Macs will run Arm SoCs several years down the road. As a result, ISVs will be very inclined to optimize their products for Apple&#39;s SoCs in particular and Arm in general. While Apple&#39;s highly-custom Arm cores have little to do with Arm&#39;s own cores, they still share a common architecture.\n Apple commanded  8.5% of PC sales in Q3 2020 and overtime these will be Arm-based systems. Therefore, if Qualcomm and other Arm partners are even moderately successful with their PC SoCs, the Arm architecture will be in over 10% of PCs, a share that is significant enough for software makers to take it into account. That said, Arm is just on time with its Cortex-A78C.", "posttime": "2020-11-06 08:02:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,电脑,目光,laptops,arm", "title": "ARM将目光投向笔记本电脑：Corest-A78c PC处理器发布", "title_en": "Arm Looks to Laptops: Cortex-A78C Processor for PCs Announced", "transed": 1, "url": "https://www.tomshardware.com/news/arm-looks-to-laptops-cortex-a78c-processor-for-pcs-announced", "via": "", "real_tags": ["发布", "电脑", "目光", "laptops", "arm"]}, {"category": "", "categoryclass": "", "imagename": "12a615e33186192203e20d300c4eccff.jpg", "infoid": 1033469, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州库比蒂诺--11月6日(星期五)凌晨5点开始。PST、iPhone 12 Pro Max和iPhone 12 mini将在苹果商店应用程序apple.com上，以及通过苹果授权经销商和部分运营商向客户提供预订。这两款机型都提供了智能手机中最多的5G频段，1 iPhone 12 Pro Max配备了最先进的专业相机系统和iPhone有史以来最大的显示屏，而iPhone 12 Mini是世界上最小、最薄、最轻的5G智能手机，采用了边缘到边缘的显示屏，将iPhone 12的先进技术压缩到了令人愉快的紧凑尺寸中。IPhone 12机型还引入了MagSafe，提供无线充电和一个全新的配件生态系统，可以轻松连接到iPhone上。从明天开始，顾客还可以在线订购HomePod mini，这是HomePod家族的最新成员。HomePod mini是一款功能强大的智能扬声器，提供身临其境的360度音频体验、Siri的智能和智能家居功能-所有这些都只需99美元的实惠价格。\nIPhone 12 Pro Max和iPhone 12 mini将于11月13日(星期五)开始在商店发售，并将于11月13日(星期五)送达顾客，HomePod mini将从11月16日(星期一)开始发售。\nIPhone 12 Pro Max为那些想要最大限度利用iPhone的用户打破了创新的界限。Super Retina XDR显示屏增加到6.7英寸2，同时保持了与iPhone 11 Pro Max几乎相同的尺寸，是iPhone有史以来最大的显示屏，也是近350万像素的最高分辨率。IPhone 12 Pro Max采用了全新的精密平面设计，配有华丽的外科级别不锈钢表带和精密研磨的哑光玻璃背面，并有四种令人惊叹的表面-石墨、银色、金色和太平洋蓝。IPhone 12 Pro Max配备了业界领先的IP68评级，可承受6米深的水中长达30分钟3，并配备了新的陶瓷盾牌前盖，跌落性能提高了4倍，4这提供了iPhone有史以来最大的耐用性跃升。\n全新的iPhone 12 Pro Max配备了iPhone有史以来最好的相机系统，拥有120度视野的超宽相机和65毫米焦距的长焦相机，将总光学变焦范围从4倍增加到5倍。这款新的宽摄像头引入了传感器移位OIS，这是智能手机第一次实现更好的图像稳定性，拥有更快的ƒ/1.6光圈，47%的传感器，更大的1.7μm像素，使照片和视频的微光性能提高了87%，这是iphone有史以来最大的收益。当结合A14仿生，iPhone 12 Pro Max带来了令人印象深刻的计算摄影功能，如夜间模式，深度融合，智能HDR 3，HDR视频捕捉与杜比视觉，5和全新的Apple ProRAW 6，创造性地控制颜色，细节和动态范围。新的LiDAR扫描仪在微光下自动对焦速度提高6倍，解锁夜间模式人像，并带来更逼真的增强现实(AR)体验。\n这款5.4英寸的iPhone 12 mini 7是世界上最小、最薄、最轻的5G智能手机，它采用了漂亮的新设计，充满了创新的新功能。IPhone 12 mini有五种令人惊叹的表面处理-蓝色、绿色、黑色、白色和(产品)红色8-iPhone 12 Mini将iPhone 12的所有技术融入到令人愉快的紧凑尺寸中，同时仍提供令人印象深刻的大尺寸和身临其境的Super Retina XDR显示屏。IPhone 12 mini还采用了新的陶瓷盾牌前盖，比以往任何智能手机玻璃都要坚硬，并提供行业领先的IP68防水性能。\nIPhone12迷你配备了功能强大的新双摄像头系统，配备了扩展的超宽摄像头和新的七元素镜头宽摄像头，ƒ/1.6光圈，这是苹果手机有史以来最快的，在微光照片和视频方面改善了27%。A14 Bionic是智能手机中速度最快的芯片，能够在iPhone 12 mini上实现有意义的新计算摄影功能，包括所有摄像头上的Smart HDR 3、Night模式和Deep Fusion等，同时提供超长的电池续航时间。在智能手机中提供最高质量的视频，iPhone 12 mini还支持4K高达30fps的杜比视觉HDR视频捕捉。\n只有3.3英寸高的HomePod mini配备了创新技术和先进的软件，提供了令人难以置信的丰富和详细的声学体验。HomePod mini旨在与苹果音乐、播客、电台以及未来几个月的其他流行音乐服务合作。多个HomePod迷你扬声器一起工作，将音乐和播客流传输到多个房间，通过在同一个房间放置两个音响，就可以为一个宽敞的音响舞台创建一对立体声音响。凭借Siri的智能，HomePod mini为iPhone客户提供了个性化和深度集成的体验。Siri可以识别谁在说话\n1984年，苹果推出了Macintosh，给个人技术带来了革命性的变化。如今，苹果凭借iPhone、iPad、Mac、Apple Watch和Apple TV引领世界创新。苹果的五个软件平台-iOS、iPadOS、MacOS、WatchOS和TVOS-在所有苹果设备上提供无缝体验，并为人们提供突破性的服务，包括App Store、Apple Music、Apple Pay和iCloud。苹果的10万多名员工致力于制造世界上最好的产品，并致力于让世界变得比我们发现的更好。\n数据计划是必需的。5G、千兆位LTE、VoLTE和Wi-Fi呼叫在选定的市场和通过选定的运营商提供。速度是基于理论吞吐量和不同的现场条件和载体。有关5G和LTE支持的详细信息，客户可以联系他们的运营商或访问apple.com/iphone/cell。\nIPhone 12 Pro Max的显示屏有圆角。当按矩形测量时，屏幕对角线为6.68英寸。实际可视面积较小。\nIPhone12Pro Max和iPhone12mini都是防溅、防水和防尘的，并在受控的实验室条件下进行了测试，根据国际电工委员会的标准60529(最大深度为6米，最长可达30分钟)，其评级为IP68。防飞溅、防水和防尘不是永久性的条件，正常磨损可能会导致耐磨性降低。不要试图给湿的iPhone充电；清洁和烘干说明请参阅用户指南。液体损坏不在保修范围内。\n该声明基于iPhone 12 Pro陶瓷盾牌前盖，与上一代iPhone相比。\nApple ProRAW将在iPhone 12 Pro和iPhone 12 Pro Max的未来iOS 14更新中提供。\nIPhone12 mini的显示屏有圆角。当按矩形测量时，屏幕对角线为5.42英寸。实际可视面积较小。\n每种(产品)红色购买的收益的一部分将捐给全球抗击艾滋病基金。从现在起到2020年12月31日，这些收益将用于全球基金新冠肺炎的响应。\n价格包括30美元的AT&amp；T-Mobile、Sprint或Verizon即时折扣。需要通过运营商激活。\nVerizon折价优惠：超过24个月。需要激活、符合条件的无限服务计划以及以旧换新iPhone 8或更高版本。有关完整条款，请参阅特殊承运人优惠PDF。\nAT&amp；T折价优惠：超过30个月。需要激活、符合条件的无限数据套餐，并直接与AT&amp；T的iPhone 8或更新版本进行折价。有关完整条款，请参阅特殊承运人优惠PDF。\nT-Mobile/Sprint折价优惠：需要激活和折价符合条件的设备。T-Mobile/Sprint提供的150美元虚拟预付费万事达卡。有关完整条款，请参阅特殊承运人优惠PDF。\n苹果卡每月分期付款适用于某些苹果产品，并受信用审批和信用额度的限制。有关合格产品的更多信息，请参阅https://support.apple.com/kb/HT211204。在美国电话电报公司(AT&amp；T；)、T-Mobile、斯普林特(Sprint)或威瑞森(Verizon)等全国性运营商的苹果商店购买iPhone，都需要激活iPhone。根据信誉，苹果卡以外的苹果卡每月分期付款的可变年利率从10.99%到21.99%不等。截至2020年4月1日的利率。税费和运费不包括在苹果卡的月度分期付款中，按标准的购买年率计算。有关更多信息，请参阅Apple Card客户协议。要访问和使用Apple Card的所有功能，消费者必须在iOS 12.4或更高版本的iPhone上将Apple Card添加到钱包中。进入设置&&gt;常规&&gt;软件更新，更新至最新版本的iOS或iPadOS。点击下载，然后点击安装。适用于美国的合格申请者。苹果卡由高盛银行美国盐湖城分行发行。\n折价价格会有所不同，可以基于折价设备的条件、年份和配置，也可以在在线折价和店内折价之间有所不同。折价价值可能适用于新购买，可能需要新购买才能获得额外的折价价值。增值税可以按新购商品的全额征收。顾客必须年满18岁。苹果或其以旧换新合作伙伴保留以任何理由拒绝或限制任何以旧换新交易的权利。店内折价要求出示政府颁发的有效照片ID(当地法律可能要求保存此信息)。来自苹果或苹果折价合作伙伴的附加条款可能适用。", "note_en": "Cupertino, California — Starting Friday, November 6, at 5 a.m. PST, iPhone 12 Pro Max and iPhone 12 mini will be available to customers for pre-order on  apple.com, the Apple Store app, and through Apple Authorized Resellers and select carriers. With both models offering the most 5G bands on any smartphone, 1 iPhone 12 Pro Max features the most advanced pro camera system and the largest display ever on an iPhone, while iPhone 12 mini is the smallest, thinnest, and lightest 5G smartphone in the world with an edge-to-edge display, packing the advanced technology of iPhone 12 into a delightfully compact size. iPhone 12 models also introduce MagSafe, offering wireless charging and an all-new ecosystem of accessories that easily attach to iPhone. Starting tomorrow, customers can also place online orders for HomePod mini, the newest addition to the HomePod family. HomePod mini is a powerful smart speaker that delivers an immersive 360-degree audio experience, the intelligence of Siri, and smart home capabilities — all at the great price of $99.\n  iPhone 12 Pro Max and iPhone 12 mini will be available in stores and arriving to customers beginning Friday, November 13, and HomePod mini will be available beginning Monday, November 16.\n    iPhone 12 Pro Max  pushes the boundaries of innovation for users who want the most out of iPhone. The Super Retina XDR display increases to an expansive 6.7 inches 2 while keeping a nearly identical size to iPhone 11 Pro Max, for the largest display ever on an iPhone and the highest resolution with nearly 3.5 million pixels. iPhone 12 Pro Max has a new, sophisticated flat-edge design that features a gorgeous surgical-grade stainless steel band paired with a precision-milled matte glass back and is available in four stunning finishes — graphite, silver, gold, and pacific blue. iPhone 12 Pro Max comes with an industry-leading IP68 rating to withstand water submersion up to 6 meters for up to 30 minutes 3 and features the new Ceramic Shield front cover, with a 4x increase in drop performance, 4 which provides the biggest jump in durability ever on iPhone.\n    Featuring the best camera system ever shipped in an iPhone, the all-new iPhone 12 Pro Max boasts an Ultra Wide camera with a 120-degree field of view and a 65 mm focal length Telephoto camera that increases the total optical zoom range from 4x to 5x. The new Wide camera introduces sensor-shift OIS, a first for smartphones, for even better image stabilization, and with a faster ƒ/1.6 aperture, 47 percent larger sensor, and bigger 1.7μm pixels, enables an 87 percent increase in low-light performance for photos and videos, the biggest gain ever for iPhone. When combined with A14 Bionic, iPhone 12 Pro Max brings to life impressive computational photography features like Night mode, Deep Fusion, Smart HDR 3, HDR video capture with Dolby Vision, 5 and the all-new Apple ProRAW 6 for creative control over color, detail, and dynamic range. And a new LiDAR Scanner delivers 6x faster autofocus in low light, unlocks Night mode portraits, and brings more realistic augmented reality (AR) experiences.\n    The smallest, thinnest, and lightest 5G smartphone in the world, the 5.4-inch  iPhone 12 mini 7 introduces a beautiful new design packed with innovative new capabilities. Available in five stunning finishes — blue, green, black, white, and (PRODUCT)RED 8 — iPhone 12 mini fits all the technology of iPhone 12 into a delightfully compact size while still delivering an impressively large and immersive edge-to-edge Super Retina XDR display. iPhone 12 mini also features the new Ceramic Shield front cover, tougher than any smartphone glass ever made, and offers industry-leading IP68 water resistance.\n    iPhone 12 mini features a powerful new dual-camera system with an expansive Ultra Wide camera and the new seven-element lens Wide camera with an ƒ/1.6 aperture, the fastest ever on an iPhone, for a 27 percent improvement in low-light photos and videos. A14 Bionic, the fastest chip in a smartphone, enables meaningful new computational photography features on iPhone 12 mini, including Smart HDR 3, Night mode and Deep Fusion on all cameras, and more, while delivering great battery life. Offering the highest quality video in a smartphone, iPhone 12 mini also supports HDR video capture with Dolby Vision at 4K up to 30 fps.\n    At just 3.3 inches tall,  HomePod mini is packed with innovative technologies and advanced software to deliver an incredibly rich and detailed acoustic experience. HomePod mini is designed to work with Apple Music, podcasts, radio stations, and, in the coming months, additional popular music services. Multiple HomePod mini speakers work together to stream music and podcasts to multiple rooms, and by placing two in the same room, a stereo pair can be created for a wide soundstage. With the intelligence of Siri, HomePod mini delivers a personalized and deeply integrated experience for iPhone customers. Siri can identify who is speaking and tailor music and podcasts to their preferences, and respond to personal requests, like accessing messages, calendar appointments, and more. When listening to music on iPhone, customers can simply bring their device close to HomePod mini and seamlessly hand off the music without missing a beat. HomePod mini makes controlling smart home accessories easier than ever, and a new Intercom feature offers a quick and easy way for family members to connect with each other at home. HomePod mini is designed from the ground up to keep personal information private and secure.\n    Unprecedented carrier offers are available directly from Apple Store locations and Apple Store online, and customers who purchase iPhone 12 Pro Max, iPhone 12 mini, and HomePod mini have even more options to safely get their new products directly from Apple. Tailored purchase options offered online, by phone, or in store include chat sessions with an Apple Specialist, which start online and finish with contactless delivery; visiting select Apple Store locations for a one-on-one session with a Specialist; and pickup options for in-store, curbside, same-day delivery, or Express storefront.\n          Apple revolutionized personal technology with the introduction of the Macintosh in 1984. Today, Apple leads the world in innovation with iPhone, iPad, Mac, Apple Watch, and Apple TV. Apple’s five software platforms — iOS, iPadOS, macOS, watchOS, and tvOS — provide seamless experiences across all Apple devices and empower people with breakthrough services including the App Store, Apple Music, Apple Pay, and iCloud. Apple’s more than 100,000 employees are dedicated to making the best products on earth, and to leaving the world better than we found it.\n  Data plan is required. 5G, Gigabit LTE, VoLTE, and Wi-Fi calling are available in select markets and through select carriers. Speeds are based on theoretical throughput and vary based on site conditions and carrier. For details on 5G and LTE support, customers can contact their carrier or visit  apple.com/iphone/cellular.\n The display on iPhone 12 Pro Max has rounded corners. When measured as a rectangle, the screen is 6.68 inches diagonally. Actual viewable area is less.\n iPhone 12 Pro Max and iPhone 12 mini are splash-, water-, and dust-resistant, and were tested under controlled laboratory conditions and have a rating of IP68 under IEC standard 60529 (maximum depth of 6 meters up to 30 minutes). Splash, water, and dust resistance are not permanent conditions and resistance may decrease as a result of normal wear. Do not attempt to charge a wet iPhone; refer to the user guide for cleaning and drying instructions. Liquid damage is not covered under warranty.\n Claim is based on iPhone 12 Pro Ceramic Shield front cover compared with the previous-generation iPhone.\n  Apple ProRAW will be available in a future iOS 14 update for iPhone 12 Pro and iPhone 12 Pro Max.\n The display on iPhone 12 mini has rounded corners. When measured as a rectangle, the screen is 5.42 inches diagonally. Actual viewable area is less.\n A portion of the proceeds from every (PRODUCT)RED purchase goes to the Global Fund to fight AIDS. From now until December 31, 2020, those proceeds will go to the Global Fund’s COVID‑19 response.\n Price includes a $30 AT&amp;T, T-Mobile, Sprint, or Verizon instant discount. Requires activation with carrier.\n Verizon Special Trade-in Offer: Over 24 months. Requires activation, eligible unlimited service plan, and trade-in of iPhone 8 or newer. For full terms, see  Special Carrier Offers PDF.\n AT&amp;T Special Trade-in Offer: Over 30 months. Requires activation, eligible unlimited data plan, and trade-in directly with AT&amp;T of iPhone 8 or newer. For full terms, see  Special Carrier Offers PDF.\n T-Mobile/Sprint Special Trade-in Offer: Requires activation and trade-in of eligible device. $150 virtual prepaid Mastercard from T-Mobile/Sprint. For full terms, see  Special Carrier Offers PDF.\n  Apple Card Monthly Installments is available for certain Apple products and is subject to credit approval and credit limit. See  https://support.apple.com/kb/HT211204 for more information about eligible products. iPhone activation is required on iPhone purchases made at an Apple Store with one of these national carriers: AT&amp;T, T-Mobile, Sprint, or Verizon. Variable APRs for Apple Card other than Apple Card Monthly Installments range from 10.99 percent to 21.99 percent based on creditworthiness. Rates as of April 1, 2020. Taxes and shipping are not included in Apple Card Monthly Installments and are subject to the standard purchase APR. See the  Apple Card Customer Agreement for more information. To access and use all the features of Apple Card, customer must add Apple Card to Wallet on an iPhone with iOS 12.4 or later. Update to the latest version of iOS or iPadOS by going to Settings &gt; General &gt; Software Update. Tap Download, then Install. Available for qualifying applicants in the United States. Apple Card is issued by Goldman Sachs Bank USA, Salt Lake City Branch.\n Trade-in values vary and can be based on the condition, year, and configuration of the trade-in device, and may also vary between online and in-store trade-in. Trade-in value may be applied toward new purchase, and new purchase may be required to receive additional trade-in values. Sales tax may be assessed on full value of new purchase. Customers must be at least 18 years old. Apple or its trade-in partners reserve the right to refuse or limit any trade-in transaction for any reason. In-store trade-in requires presentation of a valid, government-issued photo ID (local law may require saving this information). Additional terms from Apple or Apple’s trade-in partners may apply.", "posttime": "2020-11-06 08:02:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "iphone,max", "title": "IPhone 12 Pro Max、iPhone 12 mini和HomePod mini周五接受订购", "title_en": "iPhone 12 Pro Max, iPhone 12 mini, and HomePod mini available to order Friday", "transed": 1, "url": "https://www.apple.com/newsroom/2020/11/iphone-12-pro-max-iphone-12-mini-and-homepod-mini-available-to-order-friday/", "via": "", "real_tags": ["iphone", "max"]}, {"category": "", "categoryclass": "", "imagename": "7e6e8f1effad6884ed444792c11d24b0.jpg", "infoid": 1033468, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在唐纳德·特朗普(Donald Trump)总统谎称在总统大选中获胜的一晚之后，Facebook在Facebook和Instagram的顶部添加了一条通知，称目前还没有赢家。\n当天晚上早些时候，推特和脸书都选择给特朗普发来的一条信息贴上标签，这条信息在两个平台上都是一样的，上面写道：“我们崛起了，但他们试图窃取选举。”我们绝不会让他们这么做的。投票结束后不能投票！“。推特还对这条推文设置了分享限制。\n早期的选举结果对总统来说是有希望的，但一些关键的州仍在计票，包括佐治亚州、宾夕法尼亚州、密歇根州和威斯康星州。这项工作不涉及额外的投票，而是处理已经正式投票但尚未统计的前所未有的邮寄选票激增。\n一旦特朗普总统开始过早宣布获胜，我们就开始在Facebook和Instagram上发布通知，称投票仍在统计中，没有预测获胜者。我们还将使用此信息自动将标签应用于两位候选人的帖子。Pic.twitter.com/tuGGLJkwcy。\n-Facebook新闻编辑室(@fbnewsroom)2020年11月4日。\n记者联系到推特请其置评，推特提到了该公司@Safety账户在限制措施实施后不久发布的一条推文。这条推文写道：“我们在@realDonaldTrump的一条推文上发出了警告，因为他对选举做出了潜在的误导性声明。”“这项行动符合我们的公民诚信政策。”\n在Twitter的限制下，用户必须点击一个警告框才能看到出现在订阅源和主页上的推文，并且不能点赞或回复推文。转发仅限于“引用推文”功能，用户只能用自己的评论分享这条消息。\n特朗普总统在Facebook上发布了同样的消息，该平台在帖子上添加了一个标签，指出投票仍在统计中，并将用户引导到Facebook的选举信息中心。Facebook尚未采取任何措施阻止该帖子在其网络内的传播。\n在这两个平台上的另一条信息中，特朗普似乎暗示了未来的声明，而没有过早宣布胜利。他说：“我今晚将发表声明。大获全胜！“。帖子上写着。这两家电视网都没有对第二条帖子采取行动。\n推特(Twitter)和脸书(Facebook)在9月份都采取了明确的政策，反对过早宣布胜利，这些政策似乎已经按照当时的规定得到了应用。自9月17日以来，推特的虚假信息政策已经掩盖了过早宣称的胜利，使它们有资格被版主删除。Facebook的做法更为有限：它表示，将在涉及选举的帖子上贴上标签，并将观众重定向到权威信息。Facebook还对选举相关帖子的有偿推广进行了限制，以确保候选人不能利用该公司的广告网络来宣传这些帖子。\n当天早些时候，推特(Twitter)对特朗普的一名竞选工作人员施加了类似的限制。竞选活动负责人迈克·罗曼(Mike Roman)曾在推特上发帖，指控费城存在广泛的选民欺诈行为，并附上了后来被该市地区检察官贴上误导性标签的视频。\n地方检察官办公室告诉记者：“网上散布的错误信息导致拨打选举特别工作组热线的电话比投票站发生的实际事件还要多。”\n美国东部时间11月4日凌晨3：32更新：在Facebook和Instagram上各自的feed顶部添加了有关计票通知的新信息。", "note_en": "After a night in which President  Donald Trump falsely claimed victory in the presidential election, Facebook has  added a notification at the top of Facebook and Instagram feeds saying there was — as yet — no winner.\n Earlier in the night, both Twitter and Facebook chose to label a message — identical on both platforms — from Trump reading, “We are up BIG, but they are trying to STEAL the Election. We will never let them do it. Votes cannot be cast after the Polls are closed!” Twitter also placed sharing restrictions on the tweet.\n  Early returns were promising for the president, but a number of pivotal states are still counting votes, including Georgia, Pennsylvania, Michigan, and Wisconsin. This work does not involve additional votes being cast, but instead deals with the unprecedented surge of mail-in ballots that have been officially cast but not yet counted.\n Once President Trump began making premature claims of victory, we started running notifications on Facebook and Instagram that votes are still being counted and a winner is not projected. We&#39;re also automatically applying labels to both candidates’ posts with this information.  pic.twitter.com/tuGGLJkwcy\n— Facebook Newsroom (@fbnewsroom)  November 4, 2020\n Reached for comment, Twitter referred to  a tweet from the company’s @safety account shortly after the restrictions were put in place. “We placed a warning on a Tweet from @realDonaldTrump for making a potentially misleading claim about an election,” the tweet reads. “This action is in line with our  Civic Integrity Policy.”\n Under Twitter’s restrictions, users must click through a warning box to see the tweet when it appears in feeds and homepages, and cannot like or reply to the tweet. Retweets are limited to the “quote tweet” function, where users can only share the message with their own commentary.\n President Trump posted the same message to Facebook, where the platform added a label to the post noting that votes are still being counted and directing users to Facebook’s election information center. Facebook has not taken any measures to block the spread of the post within its network.\n In a separate message on both platforms, Trump seemed to hint at a future announcement without going so far as to prematurely announce victory. “I will be making a statement tonight. A big WIN!”  the post reads. Neither network has taken action against this second post.\n Both Twitter and Facebook adopted explicit policies against premature victory announcements in September, and the policies seem to have been applied as they were laid out at the time. Since September 17th,  Twitter’s misinformation policy has covered premature claims of victory, making them eligible to be removed by moderators.  Facebook’s approach is more limited: it said it would label posts involving the election and redirect viewers to authoritative information. Facebook also placed restrictions on paid promotion of election-related posts, ensuring that candidates can’t use the company’s ad network to boost the claims.\n Earlier in the day, Twitter had  placed similar restrictions on a member of Trump’s campaign staff. Mike Roman, the campaign’s director of election day activities, had posted tweets alleging widespread voter fraud in Philadelphia, together with video that was later labelled as misleading by the city’s district attorney.\n “Misinformation being spread online has driven more calls to the Election Task Force hotline than actual incidents at polling sites,” the district attorney’s office told reporters.\n Updated November 4th, 3:32AM ET:  Added new information about vote-counting notifications on Facebook and Instagram at the top of their respective feeds.", "posttime": "2020-11-06 08:02:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,twitter,选举", "title": "Facebook和Twitter采取措施限制总统的虚假选举声明", "title_en": "Facebook, Twitter take steps to limit the president’s false election claims", "transed": 1, "url": "https://www.theverge.com/2020/11/4/21548736/twitter-facebook-throttle-trump-tweet-election-theft", "via": "", "real_tags": ["facebook", "twitter", "选举"]}, {"category": "", "categoryclass": "", "imagename": "f377c0dd1106166b208cfe036363906f.png", "infoid": 1033467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年夏天，我们得到了一个新的星球大战假日特辑的消息，这部特辑将于今年晚些时候播出。更准确地说，是乐高星球大战假日特价。周四上午，迪士尼+发布了预告片，让我们第一次真正看到了计划中的生活日盛会。\n最早的星球大战假日特辑于1978年在美国电视上播出，是一部令人困惑的真人和动画的结合，韩和朱伊造访了卡西克(显然是伍基人的家乡)来庆祝生命日。根据大多数人的说法，这对演员和工作人员来说并不是一次特别积极的经历，更不用说观众了，他们看到了莫斯艾斯利酒吧里的比·亚瑟(Bea Arthur)照看酒吧，她用假发上的一个洞给别人倒了一杯酒。\n乐高星球大战假日特辑看起来更连贯一些，但同样古怪。雷伊和BB-8似乎找到了西斯全息眼镜，或者其他某种魔法水晶，开始了一次穿越时间的旅行，遇到了来自整个时间线的角色。但因为这是《乐高星球大战》，所以这一切都是开玩笑的--如果有可能的话，那就是用注塑的塑料头来绘制特征。因此，有人开玩笑说凯洛·任总是赤裸上身，韩先开枪打格里多，迪士尼+制作的一张海报上有一只新手，裹在蝴蝶结里，上面写着达斯·维德写给卢克·天行者的字条。", "note_en": "During the summer, we got news of a new  Star Wars Holiday Special that was going to air later this year. Well, a  Lego Star Wars Holiday Special, to be more accurate. And on Thursday morning, Disney+ released a trailer, giving us our first actual glimpse at the planned  Life Day extravaganza.\n The original  Star Wars Holiday Special aired on American TV in 1978 and was a confusing mix of live action and animation that saw Han and Chewie visit Kashyyyk (the Wookie homeworld, obviously) to celebrate Life Day.  By most accounts, it was  not a particularly positive experience for the cast and crew, not to mention the audience, who were greeted with the sight of Bea Arthur tending bar in the Mos Eisley Cantina,  where she pours someone a drink through a hole in their wig.\n The  Lego Star Wars Holiday Special looks a little more coherent but no less wacky. It seems that Rey and BB-8 find a Sith holocron, or some other kind of magic crystal, and begin a journey through time, meeting characters from throughout the timeline. But because this is Lego Star Wars, it&#39;s all done firmly tongue in cheek—if that&#39;s possible with an injection-molded plastic head where the features are painted on. So there are jokes about Kylo Ren always being topless, about Han shooting Greedo first, and one of the posters Disney+ made features a new hand, wrapped in a bow, with a note from Darth Vader to Luke Skywalker.", "posttime": "2020-11-06 07:46:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "星球大战,star,特辑", "title": "乐高星球大战假日特辑看起来和听起来一样古怪", "title_en": "The Lego Star Wars Holiday Special looks as wacky as it sounds", "transed": 1, "url": "https://arstechnica.com/gaming/2020/11/expect-zaniness-in-the-lego-star-wars-holiday-special/", "via": "", "real_tags": ["星球大战", "star", "特辑"]}, {"category": "", "categoryclass": "", "imagename": "d21eb266490823ba4f66c3aae1fae71c.jpg", "infoid": 1033466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加州选民决定允许优步(Uber)和其他零工经济公司继续将员工视为独立承包商，这对活动人士和立法者造成了沉重打击，并为这些公司在全美重新制定劳动法铺平了道路。\n周二，该州选民以压倒性多数通过了22号提案，使这些公司不受去年通过的一项新劳动法的约束。因此，该州的司机将不被归类为雇员，但可以利用有限的医疗保健条款，并将获得最低工资。\n这一胜利为美国各地出台类似立法铺平了道路。投行考恩(Cowen)的研究显示，美国多达17个州正在考虑如何监管零工经济。\n布兰代斯大学(Brandeis University)海勒社会政策与管理学院(Heller School For Social Policy And Management)院长戴维·韦尔(David Weil)教授表示：“加州肯定会鼓励他们尝试这种策略，以此作为保护其商业模式的一种方式。”“我认为很明显，他们选择了尝试不同的公共政策工具，以便让自己继续免除雇主的责任。”\n加州的判决是在经过几个月的激烈竞选后做出的，零工公司的支出比对手高出约10美元和1美元。\n“我的心情很沉重，”Cherri Murphy在周三发布在Twitter上的一段视频中说，他是一名拼车司机，也是零工崛起组织的活动家。他说：“这些公司花费超过2亿美元进行企业虚假信息和欺骗性的运动，以操纵我们的民主进程，并继续剥削劳动人民。这是一种亵渎，是一种罪过。“。\n其他在美国各地关键市场动员起来的零工公司的反对者承认，他们遭遇了惨痛的失败，但他们仍抱有希望，认为如果华盛顿发生权力更迭，劳工运动将重新焕发活力。\n威廉·菲茨杰拉德(William Fitzgerald)曾在谷歌工作，后来成为零工团体的竞选协调员。他说：“这永远是一场漫长的斗争。”“三年前，人们说你不能组织零工。现在你有了一个基础广泛的联盟。民主党候选人中的所有人都是零工。“\n然而，在加利福尼亚州，迫在眉睫的战斗已经基本结束：加利福尼亚州总检察长办公室表示，他们仍在“审查”结果，以确定如何继续进行针对优步(Uber)和Lyft的工人分类诉讼。在这起诉讼中，如果22号提案失败，该州几乎肯定会胜诉。\n在马萨诸塞州，州总检察长已就工人分类问题起诉优步(Uber)和Lyft--该案不会受到加州裁决的影响。其他措施可能会在纽约、俄勒冈州、华盛顿州、新泽西州和伊利诺伊州发挥作用。\n作为回应，这些公司试图与工会采取和解的语气，此前22号提案(Prop 22)的竞选活动引发了高度分歧，但遭到了网上恶性争执和对违规行为的指控。\n莱夫特总裁约翰·齐默对美联社说：“我们准备与劳工领袖和其他人合作，继续为工人建立更强大的安全网。”\nDoorDash首席执行官托尼·徐(Tony Xu)说，他的公司“放眼未来，放眼全国”。\n优步首席执行官达拉·科斯罗沙希(Dara Khosrowshahi)在投票前告诉英国“金融时报”，22号提案的通过将开启优步与各州积极合作的进程，以避免它在加州看到的旷日持久的法庭诉讼。他说：“如果可以的话，我想少花点时间在法庭上。”“我认为，我们将利用这一点作为我们在当地开展的对话的提纲。”\n前劳工部官员韦尔(Weil)表示，这场斗争现在可能取决于国家立法。例如，公平劳动标准法案(Fair Labor Standards Act)对什么是雇员-雇主关系做出了自己的定义，可以凌驾于州法律之上。一周前，优步推动了与其业务相关的豁免。韦尔表示，乔·拜登(Joe Biden)政府可能对提议的改变不那么友好。\n韦尔说：“该法案可能仍然会让优步和Lyft以及这类平台承担雇主的义务。”“这当然是有可能发生的，我相信这些公司不会忽视这一点。”\n但总部位于纽约市的独立司机协会(Independent Drivers Guild)的莫伊拉·芒茨(Moira Muntz)表示，她认为，至少在美国颁布更广泛的法律改革之前，现在关注代表权问题而不是就业地位可能是对工人最有利的。\n她说：“我们会鼓励全国各地的州立法者注意加州发生的事情，现在就采取措施，让零工有权讨价还价签订劳动合同。”“州立法机构有权建立工会，有权为零工工人集体讨价还价。我们敦促他们这样做，而且要尽快做到这一点。“。\n该工会是颇具影响力的机械师工会(Machinist Union)的一部分，它能够就拼车司机在应用程序中提供小费选项进行谈判，后来谈判出每小时27.86美元的最低工资，扣除费用后为17.22美元。\n相比之下，根据优步(Uber)有争议的一项研究，22号提案承诺的最低15.61美元的最低时薪可能会低至每小时5.61美元，考虑到费用和等待时间(这些费用和等待期是没有支付的)。\n在接下来的几周里，加州数十万拼车司机的这种计算将从理论变成现实。批评人士说，这些新的条件可能提供了迄今为止最强大的竞选工具。菲茨杰拉德说，“我们渴望在月底看到收据。”\n©2020金融时报有限公司。所有权利不得以任何方式重新分发、复制或修改。", "note_en": "California voters’ decision to let Uber and other gig-economy companies continue to treat their workers as independent contractors has dealt a crushing blow to campaigners and legislators and paved the way for the companies to remake labor laws across the US.\n Voters in the state overwhelmingly approved Proposition 22 on Tuesday, exempting the companies from a new employment law passed last year. As a result, drivers in the state will not be classed as employees but can draw upon limited healthcare provisions and will earn a minimum rate of pay.\n The victory paves the way for similar legislation to be put in place across the US where, according to research from the investment bank Cowen, as many as 17 states are considering how to regulate the gig economy.\n “California will certainly embolden them to try this kind of gambit as a way of protecting their business model,” said Professor David Weil, dean of the Heller School for Social Policy and Management at Brandeis University. “I think it’s clear that they have chosen to try different instruments of public policy to allow themselves to continue to be exempted from employer responsibilities.”\n California’s verdict came after months of fiery campaigning, with gig companies able to outspend the opposition by a ratio of about $10 to $1.\n “My heart is heavy,” said Cherri Murphy, a rideshare driver and activist from Gig Workers Rising, in a video response posted on Twitter on Wednesday. “These corporations spent over $200 million on a corporate misinformation, deceptive campaign to rig our democratic process and to continue their exploitation of working people. It is a blasphemy and a sin.”\n Other opponents of the gig companies who have mobilized in key markets across the US admitted a painful defeat but held out hope that the labor movement would be re-energized if there is a change of power in Washington.\n “It was always going to be a long fight,” said William Fitzgerald, a former Google worker turned campaign coordinator for gig worker groups. “Three years ago, people said you couldn’t organize gig workers. Now you’ve got a broad-based coalition. The whole top of the Democratic ticket all stood with gig workers.”\n  In California, though, the immediate battle is mostly over: the office of California’s state attorney general said it was still “reviewing” the result to determine how to proceed in its ongoing worker classification lawsuit against Uber and Lyft, in which, had Prop 22 failed, the state was almost certainly going to win.\n  In Massachusetts, the state’s attorney general has sued Uber and Lyft over worker classification—a case that will be unaffected by California’s decision. Other measures could come into play in New York, Oregon, Washington state, New Jersey, and Illinois.\n In response, the companies have tried to strike a conciliatory tone with unions, following a highly divisive Prop 22 campaign that was marred by vicious online sparring and accusations of foul play.\n “We’re ready to work with labor leaders and others to continue to build a stronger safety net for workers,” said John Zimmer, Lyft’s president, speaking to the Associated Press.\n Tony Xu, DoorDash’s chief executive, said his company was “looking ahead and across the country.”\n Dara Khosrowshahi, Uber’s chief executive, told the Financial Times prior to the vote that Prop 22’s passing would begin a process of Uber proactively working with states, seeking to avoid the prolonged court battles it has seen in California. “I’d like to spend less time in court if I can help it,” he said. “I think we are going to use this as an outline for a dialog that we have on a local basis.”\n Weil, a former labor department official, said the fight could now hinge on national legislation. The Fair Labor Standards Act, which offers its own definition of what entails an employee-employer relationship, could override state laws, for example. A week ago, Uber pushed to carve out exemptions related to its business. A Joe Biden administration, suggested Weil, might be less amiable to the suggested changes.\n “The Act could still be something that would subject Uber and Lyft, and those kinds of platforms, to obligations as an employer,” Weil said. “That could certainly happen, and I’m sure that’s not lost on those companies.”\n But Moira Muntz, from the New York City-based Independent Drivers Guild, said she believed workers would perhaps now be best served by focusing attention on matters of representation rather than employment status—at least until such time when a broader reform of the law in the US is enacted.\n “We would encourage state legislators all over the country to take notice of what happened in California, and take steps now to give gig workers the right to bargain for a labor contract,” she said. “State legislatures have the power to create a right to unionize, the right to collectively bargain for gig workers. We are urging them to do so and to do so quickly.”\n The guild, part of the influential Machinists Union, was able to negotiate rideshare drivers a tipping option within the apps and later a $27.86 an hour minimum wage, $17.22 after expenses.\n By contrast, Prop 22’s promise of a $15.61 minimum could, according to one Uber-disputed study, come out as low as $5.61 an hour, after factoring in expenses and waiting periods, which are unpaid.\n Such calculations will move from theory to reality for hundreds of thousands of rideshare drivers across California in the coming weeks. Those new conditions, critics say, may provide the most powerful campaigning tool yet. “We’re eager to see the receipts at the end of the month,” Mr. Fitzgerald said.\n © 2020 The Financial Times Ltd.  All rights reserved Not to be redistributed, copied, or modified in any way.", "posttime": "2020-11-06 07:46:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,lyft", "title": "优步和Lyft将重新制定美国劳动法", "title_en": "Uber and Lyft in driving seat to remake US labor laws", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/11/uber-and-lyft-in-driving-seat-to-remake-us-labor-laws/", "via": "", "real_tags": ["美国", "lyft"]}, {"category": "", "categoryclass": "", "imagename": "b43c7a37c1b77f831b18c79cdd60b73e.jpg", "infoid": 1033465, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今晚，英国人将在全国各地燃起篝火和精心制作的烟花表演来庆祝盖伊·福克斯日，这也是为什么这一天也被称为篝火之夜。庆祝活动的不利之处在于，这种结合会暂时将大量额外的颗粒物倾倒到空气中。众所周知，这对能见度有不利影响，但科学家们也怀疑，每年篝火堆积的烟尘水平升高可能会导致云层结冰。根据发表在“地球物理研究杂志：大气”上的一篇新论文，情况似乎并非如此。\n对于那些不熟悉英国庆祝活动的人来说，盖伊·福克斯是1605年臭名昭著的火药阴谋的一员，该阴谋的天主教成员密谋炸毁英国上议院，试图暗杀新教国王詹姆斯·I·福克斯，当时他正守卫着藏匿的炸药，公众通过点燃篝火来庆祝国王的生还。福克斯和他的同谋于次年1月被处决。就在执行死刑的前几天，议会通过了11月5日纪念日法案(又名感恩节法案)，使这一天成为一年一度的庆祝活动。\n最初以极端的反天主教情绪为标志的庆祝活动的性质随着几个世纪的发展而演变。焚烧盖伊·福克斯的肖像最终成为一种普遍做法--这种做法在BBC电视剧《神探夏洛克·福尔摩斯》(Sherlock Holmes)第三季的高潮中被刻画得令人难忘。在第三季中，福尔摩斯和华生挫败了一个现代阴谋，以完成火药阴谋的开始。\n这并不是第一个调查篝火之夜潜在不利影响的研究。由弗朗西斯·波普(Francis Pope)领导的伯明翰大学(University Of The Birmingham)科学家在2015年进行的一项研究调查了空气中所有这些额外的烟雾和碎片是如何影响能见度的。他们之所以选择诺丁汉进行研究，是因为诺丁汉附近有监测站：一个用于监测能见度，另一个用于监测空气污染物。他们使用了13年(2000-2012年)跟踪天气和空气污染的数据集，并寻找与篝火之夜同时出现的能见度显著下降的情况。\n结果：平均而言，盖伊·福克斯之夜的能见度降低了25%。在诺丁汉这样的城市地区，人口越密集，人均篝火就越多，他们发现能见度降低了60%。\n云中结冰是很自然的，但高浓度的污染物--例如灰尘、真菌或细菌--会产生过冷的水滴，导致云层结冰。利兹大学(University Of Leeds)的本杰明·默里(Benjamin Murray)是这项新研究的合著者，他表示，这反过来可能会对气候产生重大影响，可能会为二氧化碳水平上升提供某种缓冲，或者放大这些影响。\n默里告诉《科学》杂志，含有冰和过冷水混合物的云可能会缓冲二氧化碳的影响，但缓冲的量是高度不确定的，部分取决于云的过程，比如气溶胶颗粒上的冰的形成。(译者注：云中含有冰和过冷水的混合物可能会缓冲二氧化碳的影响，但缓冲的量非常不确定，部分取决于云过程，比如气溶胶颗粒上的冰形成)。云层对气候变暖的反应是我们预测人类排放一定数量的二氧化碳时，地球将变暖的主要不确定性之一。因此，我们需要了解云过程，比如气溶胶颗粒上的冰形成，以改进我们的预测。\n盖伊·福克斯(Guy Fawkes)的篝火通常是用废木等燃料点燃的--通常含有防腐剂和油漆，具体取决于回收地点--花园垃圾(树枝、树叶、植物茎等)、旧报纸和纸板，以及偶尔的塑料或橡胶物品。由此产生的燃烧气溶胶甚至在太空中都能看到。默里和他的同事们假设，考虑到这些更高水平的气溶胶，他们应该能够在篝火之夜期间探测到更多的大气中形成冰核的粒子浓度。\n穆雷说，冰核粒子对冷云的性质有很大的影响，但我们对哪些气溶胶粒子类型会产生有效的冰核粒子的了解还处于初级阶段。在做这些实验之前，我们只是不知道在篝火之夜(烟灰是一种重要的类型)上产生的气溶胶粒子类型是否在与含有过冷液态水的一类重要云层相关的条件下形成了冰核。\n但在2016年11月和2017年11月通宵采集利兹大学地球与环境学院阳台上的气溶胶浓度后，他们并没有发现这一点。默里说，尽管我们看到烟尘和其他气溶胶颗粒浓度大幅增加，但我们没有观察到冰核颗粒浓度的变化。这告诉我们，篝火之夜产生的颗粒可能对云中结冰并不重要。\n波普等人。建议每年短暂地暴露在篝火中不应该对人类造成太多严重的健康不良影响。(然而，考虑到能见度降低，特别是在高度潮湿的条件下，深夜司机在庆祝了一整晚后回家可能会有风险。)。相比之下，默里和他的同事们强调，尽管篝火之夜对冰核没有贡献，但它仍然是一件重大的污染事件。默里说，煤烟会以不同的方式影响气候，对人类健康也有负面影响。然而，这不太可能阻止英国人民庆祝一个有数百年历史的传统。", "note_en": "Tonight, people in Great Britain will celebrate Guy Fawkes Day with bonfires and elaborate fireworks displays across the country, which is why it&#39;s also known as Bonfire Night. The downside of the festivities is that the combination temporarily pours a lot of extra particulates into the air. This is known to have an adverse effect on visibility, but scientists also suspected that elevated levels of soot that accumulates from the annual bonfires could contribute to creating ice in clouds. According to  a new paper published in the Journal of Geophysical Research: Atmosphere, this doesn&#39;t seem to be the case.\n For those not familiar with this British celebration, Guy Fawkes was a member of the infamous Gunpowder Plot of 1605, whose Catholic members conspired to blow up the British House of Lords in an attempt to assassinate the Protestant King James I. Fawkes was caught guarding the cache of explosives, and the public celebrated the king&#39;s survival by lighting bonfires. Fawkes and his fellow conspirators were executed the following January. Just days before the executions, Parliament passed the Observance of 5th November Act (aka the &#34;Thanksgiving Act&#34;), making the day an annual celebration.\n Originally marked by extreme anti-Catholic sentiment, the nature of the celebrations evolved over the centuries. It eventually became common practice to burn Guy Fawkes in effigy—a practice memorably depicted in the climax of a season 3 episode of the BBC&#39;s  Sherlock Holmes series (&#34; The Empty Hearse&#34;), in which Holmes and Watson foil a modern-day plot to finish what the Gunpowder Plot had started.\n  This is not the first study to investigate the potential adverse impacts of Bonfire Night. A  2015 study by scientists at the University of Birmingham, led by Francis Pope, examined how all that extra smoke and debris in the air impacts visibility. They  chose Nottingham for their study because it had nearby monitoring stations: one to monitor visibility and the other to monitor air pollutants. They used datasets tracking weather and air pollution over a 13-year period (2000-2012) and looked for any marked decreases in visibility coinciding with Bonfire Night.\n The results: on average, there was a 25-percent reduction in visibility associated with Guy Fawkes Night. And in urban locations like Nottingham, where the denser population translates into more bonfires per capita, they found as much as a 60-percent reduction in visibility.\n It&#39;s quite natural for ice to form in clouds, but a high concentration of pollutants—dust, fungus, or bacteria, for instance—can give rise to supercooled water droplets that cause clouds to freeze. That, in turn, could have significant implications for the climate, according to Benjamin Murray of the University of Leeds, a co-author of the new study, possibly providing a buffer of sorts against rising CO 2 levels—or, alternatively, amplifying those effects.\n  &#34;Clouds which contain a mixture of ice and supercooled water probably buffer the effects of CO 2, but the amount of buffering is highly uncertain and in part depends on cloud processes like ice formation on aerosol particles,&#34; Murray told Ars. &#34;It is the response of clouds to warming that is one of the major uncertainties to our projections of how much the planet will warm for a given amount of CO 2 emitted by humans. Hence, we need to understand cloud processes, like ice formation on aerosol particles, in order to improve our predictions.&#34;\n The Guy Fawkes bonfires are typically set with fuels like waste wood—often containing preservatives and paints, depending on where it was salvaged—garden waste (branches, leaves, plant stems, etc.), and old newspapers and cardboard, as well as the occasional plastic or rubber items. The resulting &#34;combustion aerosol&#34; can even be seen from space. Murray and his colleagues hypothesized that, given those higher levels of aerosols, they should be able to detect more ice-nucleating particle concentrations in the atmosphere during Bonfire Night.\n  &#34;Ice nucleating particles have a dramatic impact on the properties of cold clouds, but our knowledge of which aerosol particle types make effective ice nucleating particles is in its infancy,&#34; said Murray. &#34;Before doing these experiments, we simply did not know if the types of aerosol particles produced on Bonfire Night (soot being an important type) nucleated ice under conditions relevant for an important class of cloud containing supercooled liquid water.&#34;\n But after pulling all-nighters in November 2016 and November 2017—sampling aerosol concentrations from the balcony of the Leeds University School of Earth and Environmental building—that&#39;s not what they found. &#34;Despite seeing massive increases in soot and other aerosol particle concentrations, we did not observe a change in the ice nucleating particle concentrations,&#34; said Murray. &#34;This showed us that the particles produced on bonfire night are probably not important for making ice in clouds.&#34;\n Pope et al. suggested that brief annual exposure to the bonfires shouldn&#39;t result in too many seriously adverse health effects in human beings. (It can, however, be risky for late-night drivers heading home after a long night of celebrating, given the reduced visibility—especially in highly humid conditions.) By contrast, Murray and his colleagues emphasized that even though it doesn&#39;t contribute to ice nucleation, Bonfire Night remains a major pollution event. &#34;The soot will impact climate in different ways and also has negative implications for human health,&#34; said Murray. That&#39;s unlikely to keep the people of Great Britain from celebrating a centuries-old tradition, however.", "posttime": "2020-11-06 07:46:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "结冰,guy,篝火", "title": "研究：盖伊·福克斯篝火不是云中结冰的因素", "title_en": "Study: Guy Fawkes bonfires aren’t a factor in ice formation in clouds", "transed": 1, "url": "https://arstechnica.com/science/2020/11/study-guy-fawkes-bonfires-arent-a-factor-in-ice-formation-in-clouds/", "via": "", "real_tags": ["结冰", "guy", "篝火"]}, {"category": "", "categoryclass": "", "imagename": "3a7524718f1bd0b24c448f27289b8270.jpg", "infoid": 1033464, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在秘鲁南部的考古遗址Wilamaya Patjxa，考古学家挖掘出了一具年轻女子的骨架，她的人用包括抛射点在内的猎人工具包埋葬了她。这一发现促使加州大学戴维斯分校(University Of California Davis)考古学家兰德尔·哈斯(Randall Haas)和他的同事们仔细研究了来自美洲各地的其他更新世和早期全新世猎人。\n他们的研究结果可能表明，女性猎人并不像我们想象的那么罕见。这反过来提醒我们，性别角色在每种文化中并不总是一样的。\n哈斯和他的同事们写道：“伴随[人们]死亡的物品往往是那些在他们生前陪伴他们的物品。”9000年前，当一名年轻女子在现在的秘鲁南部去世时，她的人民用至少六个石矛头埋葬了她，这种石矛头被用来猎杀鹿和维库尼亚(羊驼的亲戚)等大型猎物。这些尖端似乎与一把石刀、锋利的石片、刮刀工具和用于晒黑的赭石捆绑在一起。\n这些工具整齐地堆放在这名女子的腿边，哈斯和他的同事们说，这些工具看起来就像是被装在一个早已分崩离析的袋子里，把工具留在了后面。这位年轻女子的大部分骨头也已经屈服于时间。剩下的只有几块头骨碎片，她的牙齿，她大腿骨的两端(股骨)，以及她小腿的几块骨头。\n为了帮助鉴定死者的性别，考古学家通常会观察骨盆、颌骨、眼窝(眼眶)和其他骨骼的形状。但对于Wilamaya Patjxa的年轻女子来说，这些骨头中的大多数都没有在数千年的埋葬中幸存下来。相反，哈斯和他的同事分析了她的牙釉质样本。\n牙釉质中含有一种名为釉原蛋白的蛋白质，它首先在牙釉质的形成过程中起着重要作用。产生这些蛋白质的基因位于X和Y染色体上，每个版本略有不同。因此，基因上为女性的人与基因上为男性的人的釉原蛋白略有不同。古代猎人牙齿釉质中的蛋白质有明显的女性特征，没有Y染色体的痕迹。\n这位来自Wilamaya Patjxa的猎人是一名年轻女子，手持一项通常与男性联系在一起的活动工具。如果人们埋葬的物品是他们在生活中使用的物品，那么这就提出了一些问题。\n在其他古代女性被投射点埋葬的遗址，考古学家们很快就想出了其他解释，比如认为女性曾把抛射点当做刀子来使用的想法。然而，这位年轻女子的背包里有一把真刀，所以她似乎不太可能为同样的目的携带六个弹头。她的工具包看起来很像之前研究人员推测的旧石器时代猎人可能携带的东西。这很难用其他方式解释：这位年轻女子很可能是一名猎人。\n历史上的大多数时期都充斥着女性潜入军队、潜入船员或进入其他男性主导的职业的故事。因为这些故事是如此不同寻常，它们实际上最终揭示了关于谁应该“打仗”、航行或狩猎的社会规范。但考古学家也发现了古代文化中女性作为战士的证据，从维京人到古代蒙古游牧民族。这些发现引发了人们的疑问：在这些文化中，女性是否经常与男性并肩作战，或者这些特定的女性是特殊的还是不寻常的。\n这位来自Wilamaya Patjxa的猎人提出了一个类似的问题：她是证明了这一规则的例外吗？还是她的埋葬表明(至少在一些古代文化中)女性有时是猎人？为了帮助回答这个问题，哈斯和他的同事们寻找了其他被狩猎工具埋葬的古人。在美洲各地考古遗址发表的论文中，他们在18个不同的地点发现了27人：16名男性和11名女性。\n几千年后，有时很难判断某人是与物品一起埋葬的，还是以另一种方式进入坟墓的。在离Wilamaya Patjxa猎人不远的地方，一名男子被埋葬，身上有两个抛射点。其中一人躺在地上触摸他的小臂的一块，另一人被发现在他的骨盆附近。考古学家不能确定这些点是他的私人工具还是他的死因。\n尽管有类似这个例子的警告，但令人惊讶的是，有这么多明显的女性出现在这份名单上。哈斯和他的同事们写道：“女性参与早期的大型动物狩猎很可能不是小事。”他们认为，在整个古代美洲，可能有多达三分之一到一半的女性曾积极参与狩猎。\n这一说法可能会引发一些争论，特别是因为它表明美洲更新世和全新世早期的人可能与现代狩猎采集者有着截然不同的性别角色。在几乎所有的现代狩猎采集社会中，男人打猎，女人采集植物食物和照看孩子。但哈斯和他的同事们的研究提醒我们，文化规范因地而异，因时而异。\n大多数狩猎-采集群体以他们的方式分工，因为妇女经常照顾年幼的孩子。对于男人来说，狩猎所需的长距离旅行会更容易，而且当你怀着哭泣的婴儿时，很难偷偷溜到鹿身上。\n根据Wilamaya Patjxa的动物骨骼，维库尼亚和塔鲁卡(鹿的近亲)等大型猎物对该社区的生存极其重要。在这种情况下，狩猎可能是一项全副武装的活动。哈斯和他的同事还提出，让社区的其他成员在父母追捕孩子的同时照看孩子，可能会解放更多的女性，让他们把培根带回家--在这种情况下，就是鹿肉。\n换句话说，女性是否狩猎或战斗可能取决于社会因素，而不是生物因素。", "note_en": "At Wilamaya Patjxa, an archaeological site in southern Peru, archaeologists unearthed the skeleton of a young woman whose people buried her with a hunters’ toolkit, including projectile points. The find prompted University of California Davis archaeologist Randall Haas and his colleagues to take a closer look at other Pleistocene and early Holocene hunters from around the Americas.\n Their results may suggest that female hunters weren’t as rare as we thought. And that, in turn, reminds us that gender roles haven’t always been the same in every culture.\n  “The objects that accompany [people] in death tend to be those that accompanied them in life,” Haas and his colleagues wrote. And when one young woman died 9,000 years ago in what is now southern Peru, her people buried her with at least six stone spear tips of a type used in hunting large prey like deer and vicuña (a relative of the alpaca). The points seem to have been bundled along with a stone knife, sharp stone flakes, scraping tools, and ocher for tanning hides.\n Those tools lay neatly stacked together beside the woman’s legs, and Haas and his colleagues say it looks as if they’d been packed in a bag that had long since disintegrated, leaving the tools behind. Most of the young woman’s bones have also succumbed to time. All that remains are a few fragments of skull, her teeth, the ends of her thigh bones (femurs), and a few pieces of the bones of her lower legs.\n To help identify a dead person’s sex, archaeologists usually look at the shape of the pelvis, the jawbone, the eye sockets (orbits), and other skeletal clues. But for the young woman of Wilamaya Patjxa, most of those bones hadn’t survived millennia of burial. Instead, Haas and his colleagues analyzed samples of her tooth enamel.\n Tooth enamel contains proteins called amelogenins, which play a role in forming the enamel in the first place. The genes that produce these proteins are located on the X and Y chromosomes, and each version is slightly different. As a result, people who are genetically female have slightly different amelogenins than people who are genetically male. The proteins in the ancient hunter’s tooth enamel had a distinctly female signature, with no trace of the Y chromosome version.\n The hunter from Wilamaya Patjxa is a young woman with the tools of an activity usually associated with men. If the objects people are buried with are the objects they used in life, then that raises some questions.\n At other sites where ancient women have been buried with projectile points, archaeologists have been quick to come up with other explanations, such as the idea that women had used the points as knives. This young woman had an actual knife in her pack, however, so it doesn’t seem very likely that she’d have carried six projectile points for the same purpose. And her toolkit looks a lot like the sort of thing previous researchers had theorized that Paleolithic hunters might have carried. It’s hard to explain that in any other way: this young woman was probably a hunter.\n  Most periods of history are dotted with stories of women who sneaked into the military, onto ships’ crews, or into other male-dominated professions. Because those stories are so unusual, they actually end up shedding light on social norms about who is “supposed” to fight, sail, or hunt. But archaeologists have also found evidence of women as warriors in ancient cultures, from the Vikings to  ancient Mongolian nomads. Those finds have raised questions about whether women often fought alongside men in these cultures, or whether these particular women were special or unusual.\n The hunter from Wilamaya Patjxa raises a similar question: was she the exception that proved the rule, or does her burial suggest that (in at least some ancient cultures) women were sometimes hunters? To help answer that question, Haas and his colleagues looked for other ancient people who had been buried with hunting tools. In published papers from archaeological sites across the Americas, they found 27 people at 18 different sites: 16 men and 11 women.\n After thousands of years, it’s sometimes hard to tell whether someone was buried with an object or if it ended up in the grave another way. Not far from the Wilamaya Patjxa hunter, a man was buried with two projectile points. One lay touching a piece of his lower arm, and another was found in the vicinity of his pelvis. Archaeologists can’t be sure if those points were his personal tools or the cause of his death.\n Despite caveats like this example, the fact that so many apparent women turned up on that list is surprising. “Female participation in early big-game hunting was likely nontrivial,” wrote Haas and his colleagues. They suggest that as many as a third to half of women across the ancient Americas may have been actively involved in hunting.\n  That claim is probably going to spark some debate, especially since it suggests that Pleistocene and early Holocene people in the Americas may have had very different gender roles than modern hunter-gatherers. In nearly all modern hunter-gatherer societies, men do the hunting and women gather plant foods and care for children. But Haas and his colleagues&#39; study reminds us that cultural norms vary from place to place and across time.\n Most hunter-gatherer groups divide labor the way they do because women are often caring for young children. It would have been easier for men to travel the longer distances required for hunting—plus it’s hard to sneak up on a deer while you’re carrying a crying baby.\n Based on animal bones at Wilamaya Patjxa, large game like vicuña and taruca (a relative of deer) were extremely important to the community’s survival. In that case, hunting may have been an all-hands-on-deck activity. Haas and his colleagues also suggest that letting other members of a community keep an eye on the kids while the parents hunted might have freed more women up to bring home the bacon—or venison, in this case.\n In other words, whether women hunted or fought probably depended on social factors, not biological ones.", "posttime": "2020-11-06 07:45:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "古老,big,女性", "title": "这位古老的大型猎人是一位女性。", "title_en": "This ancient big-game hunter was a woman", "transed": 1, "url": "https://arstechnica.com/science/2020/11/this-ancient-big-game-hunter-was-a-woman/", "via": "", "real_tags": ["古老", "big", "女性"]}, {"category": "", "categoryclass": "", "imagename": "affd0fe7f290ba7bf542417ea6993368.jpg", "infoid": 1033463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周三，Ars报道称，有人从一个钱包里转移了近10亿美元的比特币，该钱包可能与丝绸之路犯罪集市有关。现在我们知道了这个神秘的派对是谁：美国司法部(US Department Of Justice)，它在2013年关闭了丝绸之路(Silk Road)，并随后将其创始人罗斯·乌布利赫特(Ross Ulbricht)终身监禁。\n“2015年，丝绸之路创始人被成功起诉，留下了一个价值10亿美元的悬而未决的问题。钱到哪里去了？“。美国检察官大卫·安德森(David Anderson)在一份新闻稿中表示。“今天的没收投诉至少在一定程度上回答了这个悬而未决的问题。其中10亿美元的犯罪收益现在掌握在美国手中。“。\n丝绸之路(Silk Road)和乌布利赫特(Ulbricht)是互联网历史上最受欢迎和最成功的网络犯罪人物之一。这项服务是在匿名的Dark Web上托管的，将毒品、假身份证以及几乎任何其他可以想象到的非法商品或服务的卖家和买家聚集在一起。美国律师在周四提交的一份民事起诉书中写道，当时有数千家经销商和“远远超过10万名买家”。文件称，丝绸之路创造了超过950万比特币的收入，并从这些超过60万比特币的销售中收取佣金。\n周四的控诉发生在乌布利赫特被定罪并被判处两个无期徒刑外加40年监禁五年之后。美国国税局(Internal Revenue Service)刑事调查部门协助追查这一错综复杂的计划，以迷惑收益的接受者。两天前，区块链分析人士注意到，有人从一个从丝绸之路收到比特币的账户中转移了69369个比特币(价值约9.75亿美元)。这个钱包自2015年以来一直保持安静，是世界第四大钱包。\n起诉书中有趣的细节听起来像是直接从犯罪小说中走出来的，起诉书中说，一个名叫X的神秘黑客负责将缴获的比特币从丝绸之路金库转移出来。\n根据调查，个人X能够侵入丝绸之路，并在未经授权的情况下非法进入丝绸之路，从而从丝绸之路窃取非法加密货币，并将其转移到个人X控制的钱包中。根据调查，Ulbricht得知了个人X的网络身份，并威胁个人X将加密货币归还给Ulbricht。\n这名身份不明的黑客既没有归还也没有花掉比特币。取而代之的是，个人X在周二与旧金山的联邦检察官办公室签署了一份同意和没收协议，同意将资金移交给政府。\n起诉书详细说明了Ulbricht花了多长时间来混淆资金转移，以及最终揭开比特币真正来源的法医专业知识。\nSilk Road使用所谓的“平底杯”来处理比特币交易，其方式旨在阻止通过区块链追踪个人交易。根据丝绸之路维基的网页，丝绸之路的玻璃杯“通过一系列复杂的、半随机的虚拟交易来支付所有款项。”。。这使得你的付款几乎不可能与离开网站的任何硬币联系起来。“。换句话说，如果买家在丝绸之路上付款，转杯就会模糊买家的比特币地址和卖家的比特币地址之间的任何联系--即使买家和卖家的比特币地址都是已知的，使用区块链追踪交易中涉及的资金踪迹也是徒劳的。丝绸之路实施这类“大酒杯”的唯一作用，就是协助洗钱犯罪所得。“。\n今年早些时候，联邦当局利用第三方比特币归属公司分析了丝绸之路执行的交易。他们聚焦于54笔交易，这些交易将70411.46BTC转移到两个特定的钱包-1BADznNF3W1gi47R65MQs754KB7zTaGuYZ和1BqjKsYuLEUE9Y5WzdbzCtYzCiQgHqtPN。当时比特币的价值约为35.4万美元。2013年4月，这两个钱包把69,471.082201比特币汇到了第三个钱包--1HQ3Go3ggs8pFnXu HVHRytPCq5fGG8Hbhx。\n两年后，第三个钱包将101枚比特币(当时价值2.37万美元)送到了无照加密货币交易所BTC-e，该交易所的创始人于2017年因被控参与价值40亿美元的比特币洗钱而被捕。剩下的比特币一直留在钱包里，直到本周被查封。\n协助调查的区块链分析公司提供了更多细节，并附上了显示账户流动的下图。\n据《纪事报》报道，美国国税局刑事调查特别探员凯利·R·杰克逊在一次新闻发布会上说：“犯罪所得不应该留在窃贼手中。”“通过CI在追踪资金方面的(刑事调查)专业知识，我们能够追踪到非法资金。”", "note_en": "On Wednesday, Ars reported that someone had transferred  close to $1 billion in bitcoin out of a wallet likely associated with the Silk Road crime bazaar. Now we know who that mystery party is: the US Department of Justice, which in 2013 shut down Silk Road and went on to put its founder, Ross Ulbricht, behind bars for life.\n “The successful prosecution of Silk Road’s founder in 2015 left open a billion-dollar question. Where did the money go?” US Attorney David Anderson said in a  news release. “Today’s forfeiture complaint answers this open question at least in part. $1 billion of these criminal proceeds are now in the United States’ possession.”\n Silk Road and Ulbricht were among the most popular and successful online crime figures in Internet history. Hosted on the anonymous Dark Web, the service brought together sellers and buyers of drugs, fake IDs, and just about any other kind of illicit good or service imaginable. There were thousands of dealers and “well over 100,000 buyers,” US attorneys wrote in a  civil complaint filed on Thursday. The document said that Silk Road generated revenue of over 9.5 million bitcoin and collected commissions from these sales of more than 600,000 bitcoin.\n Thursday&#39;s complaint came five years after Ulbricht was convicted and sentenced to two life terms plus 40 years. The Internal Revenue Service Criminal Investigation arm assisted in tracking down the intricate scheme to obfuscate the recipients of the proceeds. The seizure came two days after blockchain analysts noticed someone had  transferred 69,369 BTC—worth about $975 million—out of an account that had received them from Silk Road. The wallet, which remained quiet since 2015, was the world’s fourth biggest.\n  In intriguing details that sound like they’re straight out of a crime novel, the complaint said that a mysterious hacker identified only as Individual X was responsible for transferring the seized bitcoin out of Silk Road coffers.\n “According to the investigation, Individual X was able to hack into Silk Road and gain unauthorized and illegal access to Silk Road and thereby steal the illicit cryptocurrency from Silk Road and move it into wallets that Individual X controlled. According to the investigation, Ulbricht became aware of Individual X’s online identity and threatened Individual X for return of the cryptocurrency to Ulbricht.”\n The unknown hacker didn’t return or spend the bitcoin. Instead, Individual X on Tuesday signed a Consent and Agreement to Forfeiture with the US Attorney’s office in San Francisco agreeing to turn over the funds to the government.\n The complaint details the lengths Ulbricht took to obfuscate the transfer of the funds and the forensic expertise that finally unraveled the true origins of the bitcoin.\n Silk Road used a so-called “tumbler” to process Bitcoin transactions in a manner designed to frustrate the tracking of individual transactions through the Blockchain. According to the Silk Road wiki web page‚ Silk Road’s tumbler “sends all payments through a complex‚ semi-random series of dummy transactions‚ . . . making it nearly impossible to link your payment with any coins leaving the site.” In other words‚ if a buyer makes a payment on Silk Road, the tumbler obscures any link between the buyer’s Bitcoin address and the vendor’s Bitcoin address where the Bitcoins end up—making it fruitless to use the Blockchain to follow the money trail involved in the transaction‚ even if the buyer’s and vendor’s Bitcoin addresses are both known. The only function served by Silk Road’s implementation of such “tumblers” is to assist with the laundering of criminal proceeds.”\n Earlier this year, federal authorities used a third-party bitcoin attribution company to analyze transactions executed by Silk Road. They zeroed in on 54 transactions that transferred 70,411.46 BTC to two particular wallets—1BADznNF3W1gi47R65MQs754KB7zTaGuYZ and 1BBqjKsYuLEUE9Y5WzdbzCtYzCiQgHqtPN. The bitcoin was valued at about $354,000 at the time. In April 2013, those two wallets sent 69,471.082201 BTC to a third wallet—1HQ3Go3ggs8pFnXuHVHRytPCq5fGG8Hbhx.\n Two years later, this third wallet sent 101 bitcoin, worth $23,700 at the time, to BTC-e, an unlicensed cryptocurrency exchange whose founder  was arrested in 2017 on allegations that he committed $4 billion worth of bitcoin laundering. The remaining bitcoin stayed in the wallet until this week&#39;s seizure.\n Blockchain analysis firm Chainalysis, which assisted in the investigation, provided  additional details along with the following graphic showing the account flow.\n “Criminal proceeds should not remain in the hands of the thieves,” said Internal Revenue Service Criminal Investigation Special Agent in Charge Kelly R. Jackson in a news release, according to the Chronicle. “Through CI’s [Criminal Investigation] expertise in following the money, we were able to track down the illicit funds.”", "posttime": "2020-11-06 07:44:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "比特币,丝绸之路,seized", "title": "联邦调查局刚刚查封了丝绸之路价值10亿美元的比特币", "title_en": "The feds just seized Silk Road’s $1 billion stash of bitcoin", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/11/feds-seize-1-billion-in-bitcoin-from-silk-road-drug-marketplace/", "via": "", "real_tags": ["比特币", "丝绸之路", "seized"]}, {"category": "", "categoryclass": "", "imagename": "29dc4bc60f6354ad4555ae472b457d63.jpg", "infoid": 1033462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "火箭实验室周四表示，它将首次尝试回收其电子火箭的第一级，下一次任务定于11月中旬发射升空。\n这一步骤是在火箭实验室进行了一系列测试之后进行的，在这些测试期间，火箭实验室一直在朝着全面恢复的方向发展。在早些时候的测试中，工程师们在最大载荷下展开了第一级的降落伞，并收集了早些时候两枚火箭返回墙体时的数据，这就是该公司所说的以超音速再入大气层的高热量和高压力。\n该公司创始人彼得·贝克(Peter Beck)在与记者的电话会议上表示，他不确定公司将从海洋中捞到什么。他承认，这可能是一个几乎完好无损的第一阶段，也可能是一个冒烟的树桩。他说，这次测试的关键是收集有关降落伞系统的数据。\n一年多前，贝克宣布了该公司开始使用小型电子火箭的计划，称其目标是在面对客户需求的情况下，有效地将这种火箭的产量提高一倍。他说：我们看到生产交货时间越来越短，现在每30天就有一个舞台从工厂出来。但说真的，我们远远跟不上客户的需求。\n他的工程师们制定了一项计划，按照计划，第一级将像往常一样在80公里的高空发射，并与电子第二级分离，然后使用反作用控制系统推进器重新调整飞行器的方向，以便重返大气层，发动机部分领先。与SpaceX的猎鹰9号火箭不同，电子火箭的9个第一级发动机不会点火。(SpaceX是唯一一家成功恢复第一阶段的公司。)。\n当电子火箭下降到大气层以下时，一个减速伞将展开，随后是一个主降落伞。如果一切顺利，火箭应该会以低于10米每秒的速度坠入海洋。\n至少这是我们的计划。即将到来的任务名为“返回发送者”，该公司随后将从海洋中打捞出这辆车，并将其送回其在新西兰的工厂，看看第一阶段处于什么状态。\n贝克说，降落伞不是做对的小事。每当你以略低于音速的速度扔掉一块布料时，它总是有点有趣。一旦我们把它带回工厂，我就不会再紧张了。\n贝克说，该公司可能不得不对Electron的硬件和软件进行微调，这应该会改善未来的恢复工作。一旦该公司能够将第一级带回完整，最后一步将是使用直升机在空中抓住车辆-这将避免海洋对车辆的水损害。该公司已经成功地练习了这一动作，用直升机捕获了一个模拟火箭级。\n他说：我敢肯定，在隔热罩和各种零碎的东西上会有大量的工作要做，我们需要把这些东西做好，才能把它做好，我敢肯定，会有大量的工作要花在隔热罩上，以及各种零碎的东西上，而这些都是我们需要做好的。当我们拿到的东西处于我们真正关心的不会被淋湿的情况下时，我们会开始把直升机带进来。\n这可能需要几次飞行，但该公司有很多商业任务可以测试这项技术。贝克说，电子公司安装降落伞、隔热、反应控制系统和其他措施的有效载荷能力的成本只有15公斤左右。\n返回发送者号任务将把30颗小卫星送入不同轨道，为期两周的发射窗口将于11月15日开启。近距离回收尝试将在距离发射场约400公里的太平洋进行。", "note_en": "Rocket Lab said Thursday it will attempt to recover the first stage of its Electron rocket for the first time with its next mission, scheduled for liftoff in mid-November.\n This step follows a series of tests during which Rocket Lab has been building toward a full stage recovery. During these earlier tests, engineers have deployed parachutes from the first stage at maximum loads and collected data as two earlier rockets returned through &#34;the wall,&#34; which is what the company calls the high heat and pressure of reentry at supersonic velocity.\n The company&#39;s founder, Peter Beck, said during a conference call with reporters that he was not sure what the company would fish out of the ocean. It could be a nearly intact first stage or, he admitted, &#34;a smoldering stump.&#34; The key with this test, he said, was to gather data about the parachute system.\n  Beck announced the company&#39;s plans to begin using its small Electron rocket a little more than a year ago, saying the goal was to effectively double production of the vehicle in the face of customer demand. &#34;We&#39;re seeing the production delivery times get smaller, and a stage is rolling out of the factory every 30 days now,&#34; he said. &#34;But really, we&#39;re just nowhere close to keeping up with the demand from our customers.&#34;\n His engineers developed a plan whereby the first stage would launch and separate from the Electron second stage, as normal, at an altitude of 80km and then use reaction control system thrusters to reorient the vehicle for reentry, with the engine section leading the way. Unlike with SpaceX&#39;s Falcon 9 rocket, the nine first-stage engines on Electron will not fire. (SpaceX is the only company to successfully recover a first stage.)\n As the Electron rocket descends lower into the atmosphere, a drogue parachute will deploy, followed by a main parachute. If all goes well, the rocket should splash into the ocean traveling less than 10 meters per second.\n That is the plan, at least. With the upcoming mission, named &#34;Return to Sender,&#34; the company will then recover the vehicle from the ocean and return it to its factory in New Zealand to see what condition the first stage is in.\n &#34;Parachutes are not trivial things to get right,&#34; Beck said. &#34;Whenever you throw out a piece of fabric at just slightly under the speed of sound, it&#39;s always a little bit interesting. I&#39;ll stop being nervous once we get it back in the factory.&#34;\n The company will likely have to fine-tune Electron&#39;s hardware and software, Beck said, and this should improve future recovery efforts. Once the company is able to bring the first stage back whole, the final step will be catching the vehicle mid-air, using a helicopter—this will avoid water damage to the vehicle from the ocean. The company has already successfully practiced this maneuver by capturing a mock rocket stage with a helicopter.\n &#34;I&#39;m sure there&#39;s going to be a ton of work on heat shields and on various bits and pieces that we&#39;ll need to get right,&#34; he said. &#34;When we&#39;ve reached the point where we have something that&#39;s in a condition that we actually care that it doesn&#39;t get wet, we&#39;ll start bringing the helicopter in.&#34;\n This may take several flights, but the company has plenty of commercial missions upon which to test this technology. Beck said the cost to Electron&#39;s payload capacity to incorporate a parachute, heat shielding, reaction control systems, and other measures is only about 15 kilograms.\n The &#34;Return to Sender&#34; mission will deliver 30 small satellites into various orbits, and the two-week launch window opens on November 15. The down-range recovery attempt will take place about 400km from the launch site, in the Pacific Ocean.", "posttime": "2020-11-06 07:44:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "火箭,lab", "title": "火箭实验室即将尝试第一级回收", "title_en": "Rocket Lab is about to attempt a first-stage recovery", "transed": 1, "url": "https://arstechnica.com/science/2020/11/rocket-lab-is-about-to-attempt-a-first-stage-recovery/", "via": "", "real_tags": ["火箭", "lab"]}, {"category": "", "categoryclass": "", "imagename": "9ad7d707869b73744ccd7636de51df03.jpg", "infoid": 1033460, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，苹果开始为支持的设备推出iOS 14.2、iPadOS 14.2、twOS 14.2和watchOS 7.1。IOS和iPadOS的最后一次更新是在10月22日的iOS 14.1。\n根据发布说明，新版iOS和iPadOS增加了100个新的表情符号，包括动物、食物、面孔、家居用品、乐器、性别包容的表情符号等等。所有iPhone和iPad的控制中心都有一个新的Shazam按钮。两年多前被苹果收购的Shazam，通过设备中的麦克风收听歌曲，以算法识别歌曲。在收购之前，它还被用作一种音频二维码，用于在电视广告等活动中进行营销活动。\nAirPods还有一些相关的改变，包括可变电池充电以延长电池寿命(苹果已经在其他设备上实现了这一点)，以及在音量过高到足以导致听力损害的时候发出通知。苹果在最初发布iOS14时就承诺了这一点。\n最后，还有8张新的墙纸(分别用于深色和浅色模式)，新的HomePod功能和优化，以及大量的错误修复和其他次要功能和更改。\n苹果手表的升级版本--watchOS 7.1--也伴随着今天发布的iOS和iPadOS。它在俄罗斯和韩国增加了对更多健康跟踪功能的支持，引入了与iOS/iPadOS相同的耳机音量通知，并修复了几个错误。\n超过100个新的表情符号，包括动物、食物、面孔、家居用品、乐器、性别包容的表情符号等等。\n放大镜可以探测附近的人，并使用iPhone 12 Pro和iPhone 12 Pro Max中包含的LiDAR传感器报告他们的距离。\n优化AirPods电池充电，通过减少AirPods充满电所花费的时间来减缓电池老化速度\n支持使用iPhone、iPad、Apple Watch、AirPod和CarPlay的HomePod和HomePod mini的内部通信。\n能够将HomePod连接到Apple TV 4K以实现立体声、环绕立体声和杜比Atmos音频。\n可选择向参与的公共卫生机构提供有关暴露通知的统计数据，但不指明您的身份。\n尝试输入密码时，锁定屏幕上的键盘可能会错过触摸。\n某些用户无法在Apple Watch和iPhone之间同步锻炼GPS路线或健康数据。\n使用iPhone迁移从iCloud备份恢复iPhone或将数据传输到新iPhone时禁用暴露通知。\n超过100个新的表情符号，包括动物、食物、面孔、家居用品、乐器、性别包容的表情符号等等。\n使用iPad Pro 12.9英寸(第四代)和iPad Pro 11英寸(第二代)附带的LiDAR传感器，放大镜可以探测附近的人并报告他们的距离\n摄像机中的场景检测使用智能图像识别来识别场景中的对象，并自动改进iPad Air(第四代)上的照片。\n摄像头中的Auto FPS会在录制视频时自动降低帧速率，以改善微光捕捉效果并优化iPad Air(第4代)上的文件大小。\n优化AirPods电池充电，通过减少AirPods充满电所花费的时间来减缓电池老化速度。\n支持使用iPhone、iPad、Apple Watch、AirPod和CarPlay的HomePod和HomePod mini的内部通信。\n能够将HomePod连接到Apple TV 4K以实现立体声、环绕立体声和杜比Atmos音频。\n尝试输入密码时，锁定屏幕上的键盘可能会错过触摸。\n增加了当您的耳机音频电平可能影响您的听力时收到通知的功能。\n在韩国和俄罗斯的Apple Watch Series 4或更高版本上添加对ECG应用程序的支持\n修复了一些Apple Watch Series 6用户在抬起手腕时屏幕可能变黑的问题。\n此外，苹果还发布了修复了错误的twOS 14.2，修复了iOS14不支持的iPhone的iOS12.4.9，以及对之前的twOS Apple TV设备进行了较小的更新。所有更新都应在支持的设备上立即在全球范围内提供。", "note_en": "Today, Apple began rolling out iOS 14.2, iPadOS 14.2, tvOS 14.2, and watchOS 7.1 for supported devices. The last update to iOS and iPadOS was  iOS 14.1 on October 22.\n The new versions of iOS and iPadOS add 100 new emoji, which include &#34;animals, food, faces, household objects, musical instruments, gender-inclusive emoji, and more,&#34; according to the release notes. iPhones and iPads got a new Shazam button in the control center. Shazam, which Apple acquired just over two years ago, identifies songs algorithmically by listening to them with the microphones in the devices. Before the acquisition, it was also used as a sort of audio QR code for marketing activations during TV commercials and the like.\n There are also some AirPods-related changes, including variable battery charging to preserve battery longevity (something Apple has already implemented in other devices) and notifications that let you know when your volume level is high enough to cause hearing damage. Apple promised this with iOS 14 when it initially launched.\n Finally, there are eight new wallpapers (for dark and light mode, each), new HomePod features and optimizations, and a ton of bug fixes and other minor features and changes.\n An update for Apple Watches—watchOS 7.1—also accompanies today&#39;s iOS and iPadOS releases. It adds support for more health tracking features in Russia and Korea, introduces the same headphone volume notification as in iOS/iPadOS, and fixes a couple of bugs.\n  Over 100 new emoji, including animals, food, faces, household objects, musical instruments, gender-inclusive emoji, and more\n  Magnifier can detect people nearby, and report their distance using the LiDAR sensor included in iPhone 12 Pro and iPhone 12 Pro Max\n  Optimized battery charging for AirPods to slow the rate of battery aging by reducing the time your AirPods spend fully charged\n   Intercom support with HomePod and HomePod mini using iPhone, iPad, Apple Watch, AirPods, and CarPlay\n Ability to connect HomePod to Apple TV 4K for stereo, surround sound, and Dolby Atmos audio\n Option to provide statistics about Exposure Notifications, without identifying you, to participating Public Health Authorities\n  The keyboard on the Lock Screen could miss touches when trying to enter the passcode\n         Workout GPS routes or Health data are prevented from syncing between Apple Watch and iPhone for some users\n   Exposure Notifications is disabled when restoring iPhone from iCloud Backup or transferring data to a new iPhone using iPhone Migration\n  Over 100 new emoji, including animals, food, faces, household objects, musical instruments, gender-inclusive emoji, and more\n  Magnifier can detect people nearby and report their distance using the LiDAR sensor included in iPad Pro 12.9-inch (4th generation) and iPad Pro 11-inch (2nd generation)\n Scene Detection in Camera uses intelligent image recognition to identify objects within a scene and automatically improves the photo on iPad Air (4th generation)\n Auto FPS in Camera automatically reduces the frame rate when recording video to improve low-light capture and to optimize file size on iPad Air (4th generation)\n Optimized battery charging for AirPods to slow the rate of battery aging by reducing the time your AirPods spend fully charged\n  Intercom support with HomePod and HomePod mini using iPhone, iPad, Apple Watch, AirPods, and CarPlay\n Ability to connect HomePod to Apple TV 4K for stereo, surround sound, and Dolby Atmos audio\n  The keyboard on the Lock Screen could miss touches when trying to enter the passcode\n  Adds the ability to be notified when your headphone audio level could impact your hearing\n Adds support for the ECG app on Apple Watch Series 4 or later in the Republic of Korea and Russia\n   Fixes an issue where the screen may be dark on wrist raise for some  Apple Watch Series 6 owners.\n Additionally, Apple released tvOS 14.2 with bug fixes, iOS 12.4.9 with bug fixes for iPhones not supported by iOS 14, and a minor update for pre-tvOS Apple TV devices. All updates should be available today globally on supported devices.", "posttime": "2020-11-06 07:44:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,壁纸,wallpapers,iphone", "title": "IOS 14.2带来了新的表情符号和壁纸，修复了一长串错误", "title_en": "iOS 14.2 is here with new emoji and wallpapers, long list of bug fixes", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/11/ios-14-2-is-here-with-new-emoji-and-wallpapers-long-list-of-bug-fixes/", "via": "", "real_tags": ["ios", "壁纸", "iphone"]}]