[{"category": "", "categoryclass": "", "imagename": "f8567c0fe8d2ffa140fc1c47254af1c1.jpg", "infoid": 1071718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注册 CNN 的 Wonder Theory 科学通讯。通过有关迷人发现、科学进步等的新闻探索宇宙。 （美国有线电视新闻网）在西伯利亚北极深处发现冰冻的洞穴狮子幼崽看起来像是睡着了，轻轻一碰可能会唤醒她。幼崽的金色皮毛上沾满了泥土，但除此之外都完好无损。她的牙齿、皮肤、软组织和器官都被制成木乃伊，但都完好无损。自从她上次闭上眼睛大约 28,000 年以来，她的爪子仍然锋利到足以刺破一位正在研究这个非凡的——而且前所未有的——永久冻土保存标本的科学家的手指。西伯利亚辛巴，绰号斯巴达，是两只洞穴狮宝宝之一——曾经在北半球广泛漫游的已灭绝的大型猫科动物——于 2017 年和 2018 年由猛犸象牙猎人在俄罗斯远东的塞缪利亚赫河畔发现.最初，人们认为这两只幼崽是兄弟姐妹，因为它们被发现相距仅 15 米（49 英尺），但一项新的研究发现它们的年龄相差约 15,000 年。根据无线电碳定年法，鲍里斯，作为已知的第二只幼崽，已有 43,448 岁。 “斯巴达可能是迄今为止发现的保存最完好的冰河时代动物，除了皮毛有点皱巴巴之外，几乎没有受损。她甚至还保留了胡须。鲍里斯的受损程度更大一些，但仍然很好，”洛夫说Dalen 是瑞典斯德哥尔摩古遗传学中心进化遗传学教授，也是一项关于幼崽的新研究的作者。研究称，两只幼崽死亡时只有 1 或 2 个月大。目前尚不清楚它们是如何死亡的，但达伦和包括俄罗斯和日本科学家在内的研究小组表示，没有迹象表明它们被捕食者杀死。\n计算机断层扫描显示他们的骨骼有颅骨损伤、肋骨脱臼和其他扭曲。 “考虑到它们的保存，它们肯定很快就被掩埋了。所以它们可能死于泥石流，或者掉进永久冻土的裂缝中，”达伦说。 “由于季节性解冻和冻结，永久冻土形成大裂缝。”在上一个冰河时代，西伯利亚并不是今天的空地。猛犸象、苔原狼、熊、长毛犀牛、野牛和赛加羚羊，以及洞穴狮——今天生活的非洲狮的一个稍大的亲戚——漫游。不知道洞狮如何适应严酷的高纬度地区的生活，这里的季节变化快、风大、冬天寒冷、黑暗。该研究发表在第四纪杂志上，发现洞穴狮子的外套与非洲幼狮的外套相似但不完全相同。冰河时代的幼崽长着厚厚的毛皮底毛，这可能有助于它们适应寒冷的气候。近年来，曾在俄罗斯草原上游荡的许多已灭绝动物的木乃伊遗骸——毛犀牛、百灵、洞熊、犬科小狗——经常被猎人发现，他们使用高压炸毁隧道。将水管压入永久冻土层主要是为了寻找长而弯曲的猛犸象牙。象牙贸易有利可图——如果有争议的话——象牙被象牙雕刻师和收藏家视为象牙的替代品。像该研究的合著者兼西伯利亚主要城市雅库茨克科学院研究员瓦列里·普洛特尼科夫 (Valery Plotnikov) 等俄罗斯科学家陪伴并与长牙猎人建立了工作关系，他们从永久冻土的泥土和冰中发现了惊人的发现。\n“在 2017 年，......我在冰洞里和他们一起工作，”普洛特尼科夫在伦敦自然历史博物馆上个月发布的播客中说道。 “天气很冷，很危险，工作也很辛苦，环境很糟糕，蚊子很多，”他补充说，在与象牙猎人一起度过的一个月里，他减掉了 10 公斤（22 磅）。但他建立的关系产生了科学上的财富，普洛特尼科夫说他遇到了洞穴狮子幼崽、狼头和一系列木乃伊猛犸象。气候危机也发挥了作用。温暖的夏季——北极变暖的速度是全球平均水平的两倍——削弱了永久冻土层并延长了象牙狩猎季节。 “这些天肯定有更多的发现。主要原因是对猛犸象牙的需求增加，这意味着更多的人在永久冻土中寻找。但气候变化也有贡献，使融化（以及实地工作）季节更长， ”达伦通过电子邮件解释道。科学家们必须先测试冷冻的遗骸是否有传染病，例如炭疽病，在他们详细检查它们之前，这些疾病可能处于休眠状态，尽管达伦说这些遗骸不太可能含有古老的病原体。幼崽的性别通过CT扫描和基于遗传的性别确定得到确认。达伦说，下一步将是对斯巴达的 DNA 进行测序，这可以揭示洞狮的进化历史、种群规模及其独特的遗传特征。", "note_en": "Sign up for CNN&#39;s Wonder Theory science newsletter.   Explore the universe with news on fascinating discoveries, scientific advancements and more.\n (CNN)Found frozen deep in the Siberian Arctic, the cave lion cub looks like she&#39;s asleep and one touch might  awaken her.\n The cub&#39;s golden fur is matted with mud but otherwise undamaged. Her teeth, skin, soft tissue and organs are mummified but all intact. Some 28,000 years since she last closed her eyes, her claws are still sharp enough to prick the finger of one of the scientists who are studying this remarkable -- and unprecedented -- permafrost-preserved specimen.\n The Siberian Simba, nicknamed Sparta, was one of two baby cave lions -- extinct big cats that used to roam widely across the northern hemisphere -- found in 2017 and 2018 by mammoth tusk hunters on the banks of the Semyuelyakh River in Russia&#39;s Far East.\n     Initially, it was thought the two cubs were siblings, as they were found just 15 meters (49 feet) apart, but a new study found that they differ in age by around 15,000 years. Boris, as the second cub is known, is 43,448 years  old, according to radio carbon dating.\n   &#34;Sparta is probably the best preserved Ice Age animal ever found, and is more or less undamaged apart from the fur being a bit ruffled. She even had the whiskers preserved. Boris is a bit more damaged, but still pretty good,&#34; said Love Dalen, a professor of evolutionary genetics at the Centre for Palaeogenetics in Stockholm, Sweden, and an author of a new study on the cubs.\n  Both cubs were just 1 or 2 months old when they perished, the study said. It&#39;s not clear how they died, but Dalen and the research team -- which includes Russian and Japanese scientists -- said there were no signs of them being killed by a predator.\n  Computed tomography scans showed skull damage, dislocation of ribs, and other distortions in their skeletons.\n &#34;Given their preservation they must have been buried very quickly. So maybe they died in a mudslide, or fell into a crack in the permafrost,&#34; Dalen said. &#34;Permafrost forms large cracks due to seasonal thawing and freezing.&#34;\n During the last Ice Age, Siberia wasn&#39;t the empty place it is today. Mammoths, tundra wolves, bears, woolly  rhinoceroses, bison and saiga antelopes roamed, along with cave lions -- a slightly bigger relative of African lions that live today.\n It&#39;s not known how the cave lion adapted to life in the harsh high latitudes, with its rapid changes of season, strong winds and cold, dark winters.\n The  study, published in the journal Quaternary, found that the cave lions&#39; coat was similar but not identical to that of an African lion cub. The Ice Age cubs had a long thick fur undercoat that might have helped them adapt to the cold climate.\n  The mummified remains of a number of extinct animals -- a  woolly rhino,  a  lark, a  cave bear,  a canine puppy -- that once roamed the Russia steppe have been found in recent years, often by hunters, who blast tunnels using high-pressure water hoses into the permafrost primarily in search of long curvy mammoth tusks. There is a lucrative -- if controversial -- trade in the tusks, which are prized by ivory carvers and collectors as an alternative to elephant ivory.\n Russian scientists like Valery Plotnikov, a co-author of the study and a researcher at the Academy of Sciences in Yakutsk, Siberia&#39;s main city, have  accompanied and developed working relationships with the tusk hunters, who unearth astonishing finds from the permafrost&#39;s mud and ice.\n &#34;In 2017, ... I worked with them in the hole, the ice cave,&#34; Plotnikov said on a  podcast produced by the Natural History Museum in London that was released last month.\n &#34;It&#39;s very cold, very dangerous and very hard to work, terrible conditions, many mosquitoes,&#34; he added, saying he lost 10 kilos (22 pounds) in the month he spent with the tusk hunters. But the relationships he forged have generated a scientific bonanza, with Plotnikov saying he&#39;s come across the cave lion cubs, a wolf head and a family of mummified mammoths.\n   The climate crisis has also played a role. Warmer summers -- the Arctic is warming two times faster than the global average -- have weakened the permafrost layer and lengthened the tusk-hunting season.\n &#34;There are definitely more finds being made these days. The main reason is the increased demand for mammoth ivory, meaning more people are out searching in the permafrost. But climate change also contributes, making the melting (and thus field work) season longer,&#34; Dalen explained via email.\n   The scientists have to test the frozen remains for infectious diseases, such as anthrax, that can lay dormant before they examine them in detail, although Dalen said that it was unlikely that the remains harbor ancient pathogens. The sex of the cubs was confirmed by CT scan and genetic-based sex determination.\n Dalen said that the next step would be to sequence the DNA of Sparta, which could reveal the evolutionary history of the cave lion, the population size and its unique genetic features.", "posttime": "2021-08-06 14:18:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发现,frozen", "title": "在西伯利亚发现的保存完好的洞穴狮子幼崽已有 28,000 年的历史", "title_en": "Perfectly preserved cave lion cub found frozen in Siberia is 28,000 years old", "transed": 1, "url": "https://www.cnn.com/2021/08/05/world/frozen-cave-lion-cubs-siberia-scn/index.html", "via": "", "real_tags": ["发现", "frozen"]}, {"category": "", "categoryclass": "", "imagename": "7f2da5c408ae8be1605238538d50e1c1.jpg", "infoid": 1071717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "参议员 Mark Warner (D-Va.) 和 Rob Portman (R-Ohio) 周四提交了一项竞争性修正案，对参议院基础设施法案的加密货币条款进行了较早的修正案。 CoinDesk 获得了该修正案的副本，其范围有限，仅不包括工作量证明挖掘，或允许个人控制提供访问数字资产的私钥的硬件或软件的销售。在周四晚上的一条推文中，总部位于华盛顿特区的智库硬币中心的执行董事杰里布里托称该修正案是“灾难性的”。他补充说：“它对软件开发人员没有任何帮助。荒谬！”特定于加密货币的条款将为基础设施改善筹集 280 亿美元，用于 1 万亿美元，但一直存在争议，短暂地阻碍了整个基础设施法案。参议员 Ron Wyden (D-Ore.)、Cynthia Lummis (R-Wyo.) 和 Pat Toomey (R-Pa.) 在周四早些时候提出了他们的修正案，以确保矿工、节点运营商、开发商和其他非托管加密行业参与者获得豁免来自加密税收报告条款。拜登政府此前曾在周四晚间在推特上分享的一份声明中支持它所谓的“妥协”，并归因于白宫副新闻秘书安德鲁·贝茨。怀登在推特上说，竞争性修正案“为最具气候破坏性的加密技术形式提供了一个政府批准的安全港，称为工作量证明。推进这项修正案对气候和创新来说都是错误的。”\n同样，Lummis 发推文说，“我们的修正案保护矿工以及硬件和软件开发商。另一个没有。选择是明确的。”更新（UTC 时间 2021 年 8 月 6 日 02:48）：增加白宫对 Warner-Portman-Sinema 修正案的支持；怀登回应。注册后，您将收到有关 CoinDesk 产品的电子邮件，并且您同意我们的条款和条件以及隐私政策。披露 作为有关加密货币、数字资产和货币未来的新闻和信息的领导者，CoinDesk 是一家致力于实现最高新闻标准并遵守一套严格的编辑政策的媒体机构。 CoinDesk 是 Digital Currency Group 的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "Senators Mark Warner (D-Va.) and Rob Portman (R-Ohio) submitted a competing amendment on Thursday to an earlier amendment to the Senate infrastructure bill’s cryptocurrency provision.\n The amendment, a copy of which was obtained by CoinDesk, is limited in scope, excluding only proof-of-work mining, or the selling of hardware or software that permits individuals to control private keys that provide access to digital assets.\n In a tweet Thursday evening, Jerry Brito, the executive director of the Washington, D.C.-based think tank Coin Center called the amendment &#34;disastrous.&#34; He added: &#34;And it does nothing for software devs. Ridiculous!&#34;\n The crypto-specific provision would raise $28 billion toward $1 trillion in infrastructure improvements but has been  contentious, briefly holding up the entire infrastructure bill.\n Senators Ron Wyden (D-Ore.), Cynthia Lummis (R-Wyo.) and Pat Toomey (R-Pa.)  proposed their amendment earlier Thursday to ensure miners, node operators, developers and other non-custodial crypto industry participants are exempt from the crypto tax reporting provision.\n The Biden administration formerly supported what it called the &#34;compromise&#34; in a  statement shared on Twitter late Thursday and attributed to White House Deputy Press Secretary Andrew Bates.\n Wyden  tweeted that the competing amendment &#34;provides a government-sanctioned safe harbor for the most climate-damaging form of crypto tech, called proof-of-work. It would be a mistake for the climate and for innovation to advance this amendment.&#34;\n Similarly, Lummis  tweeted that, &#34;Our amendment protects miners as well as hardware and software developers. The other does not. The choice is clear.&#34;\n  UPDATE (Aug. 6, 2021, 02:48 UTC):  Adds White House support for Warner-Portman-Sinema amendment; Wyden response.\n By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n   Disclosure The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2021-08-06 13:22:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法案,house,修正案", "title": "参议员华纳和波特曼提出了一项基础设施法案修正案，仅将加密矿工排除在经纪人定义之外；白宫表示支持", "title_en": "Senators Warner and Portman propose an amendment to infrastructure bill that only excludes crypto miners from broker definition; White House shows support", "transed": 1, "url": "https://www.coindesk.com/senator-who-wrote-controversial-crypto-tax-rule-proposes-modest-revision", "via": "", "real_tags": ["法案", "house", "修正案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最近正在帮助我妈妈使用 Microsoft Sharepoint 共享文件。该文件是包含一些 Word 文档的 zip 存档。我们上传了文件并向收件人发送了一个共享链接。他们单击了链接，但无法使用这些文件。事实证明，该链接不是下载文件，而是打开一个在线文件浏览器，该浏览器导航到 zip 文件中。这引起了混乱，因为用户不明白文件的在线视图与在您的计算机上保存文件不同。这在在线文件领域很常见。所以我开始思考：我们如何才能构建出不会持续让人们感到困惑的软件？上下文很重要。如果您在计算机上打开一个文件夹，它与在 Web 浏览器界面中打开它不同，也与在手机上打开它不同。在计算机中，很大程度上取决于上下文。文件就是一个很好的例子。它们是现代计算的基石，人们在许多不同的环境中处理文件。文件浏览器视图是我们行业的标志。任何使用过带有 GUI（图形用户界面）的计算机的人都知道文件浏览器是什么样的。它看起来与经典 Windows 中的相同，中间是文件列表，左侧通常是一些常见文件夹。在任何你找到文件的地方，你最终都会遇到一个看起来很熟悉的文件浏览器。虽然它们看起来相同，但它们的行为并不相同。某些文件浏览器可以创建、编辑和保存文件。有些只能显示它们。有些只能处理某些类型的文件。有些甚至不会显示正确的列表。这通常是平台限制。用文件做某事。用户需要将文件从一个文件浏览器移动到另一个文件浏览器。对于用户来说，这是令人困惑的。我们有这么多不同的浏览器是一件坏事吗？有没有办法简化和精简这个支离破碎的系统？我认为查看这些问题很重要，因为每一个新的文件浏览器和每一个新的上下文都会让人们更难知道它应该如何工作。它使我们的用户孤立，并将他们保留在一个较小的生态系统中。写于 05/08/2021", "note_en": "I was recently helping my mother share a file using Microsoft Sharepoint. The file was a zip archive containing a few word documents. We uploaded the file and sent a share link to the recipient. They clicked the link and was unable to use the files. It turned out that rather than downloading the file, the link opens an online file browser that navigates into the zip. This caused confusion because the the user did not understand that a online view of the files is not the same as having the files on your computer.\n This is common in the world of online files. So I started to wonder:  How can we build software that does not continuously confuse people?\n  Context matters. If you open a folder on your computer, it is different than opening it in a web browser interface and it is different than opening it on your phone. In computers a lot depends on context. Files are a great example of this. They are a building block of modern computing and there are many different contexts where people work with files.\n The file browser view is iconic to our industry. Anyone who has used a computer with a GUI (Graphical User Interface) knows what a file browser looks like. It looks the same as it did in classic Windows, with a list of files in the centre and often some common folders on the left. Any place that you find files, you will eventually encounter a file browser that looks familiar.\n While they look the same, they do not act the same. Some file browsers can create, edit and save files. Some can only show them. Some can only work with certain types of files. Some wont even show the correct list. This is often a platform limitation. To do something with a file. users need to move the files from one file browser to a different one. To a user this is confusing.\n Is it a bad thing that we have so many different browsers? Are there ways to simplify and streamline this fragmented system? I think its important to look at these questions since every new file browser and every new context makes it harder for people to know how it all should work. It silos our users and keeps them within a smaller ecosystem.\n   Written 05/08/2021", "posttime": "2021-08-06 13:21:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "question,文件", "title": "开放性问题：我们如何修复文件？", "title_en": "Open Question: How Can We Fix Files?", "transed": 1, "url": "https://www.schroer.ca/2021/08/05/file-browsers/", "via": "", "real_tags": ["question", "文件"]}, {"category": "", "categoryclass": "", "imagename": "51304a0f61aa85c1bb44bfa765f4f9dd.jpg", "infoid": 1071713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "参议院 1.2 万亿美元的两党基础设施​​法案提出了一项全国测试计划，该计划将允许政府收集司机的数据，以便向他们收取每英里的旅行费用。新收入将有助于为公路信托基金提供资金，该基金目前主要依靠燃油税来支持全国的公路和公共交通。根据该提案，政府将通过智能手机应用程序、其他车载设备、汽车制造商、保险公司、加油站或其他方式收集有关驾驶员行驶里程的信息。目前，该计划只是一项测试工作——政府将招募驾驶商用和乘用车的志愿者——但这个想法仍然引发了对政府跟踪人们私人数据的担忧。 Demand Progress 的政策顾问肖恩·维特卡 (Sean Vitka) 表示：“看到一项似乎依赖政府对车辆位置的大规模监视才能发挥作用的计划的进展令人担忧。”参议员罗恩·怀登 (Ron Wyden) 是一位著名的监视批评家，他喜欢一种可以定期读取里程但不会跟踪驾驶员位置的程序。 Wyden 发言人 Keith Chu 在一封电子邮件中说：“他反对所有导致对个人车辆进行持续位置跟踪的方法，但支持有创意的飞行员寻找其他解决方案。” “参议员 Wyden 还认为，在采用永久性 [车辆行驶里程，或 VMT，提案] 之前，有必要对隐私问题进行更多研究和监督。”该法案将设立一个咨询委员会来指导该计划，其中包括代表州交通部门和卡车运输行业的官员以及数据安全和消费者隐私专家。随着为期四年的试点计划的进行，交通和财政部还必须让国会了解他们如何维护志愿者的隐私以及每英里收费的想法如何影响低收入司机。不过，维特卡表示，这个概念可能会使美国人的私人数据面临风险。 “我们已经知道政府无法保证这样的数据安全，这也是政府维护一个庞大的美国民众旅游信息数据库是个坏主意的另一个原因。”\n一段时间以来，政府一直在关注驾驶费，以向公路信托基金提供所需的收入。该账户长期以来一直缺乏收入来支持联邦在高速公路上的支出，迫使财政部一直不得不转移资金。形势如此严峻，以至于国会预算办公室 (CBO) 预计，如果目前的燃油税仍然存在，而高速公路和公共交通项目的资金随着通货膨胀率的增加而增加，那么该基金在 2022 年至 2031 年之间可能会短缺近 2000 亿美元。 .为了增加收入，CBO 建议使用 VMT 模型甚至电动汽车提高燃油税或制定新税，但鉴于数量很少，后者不太可能产生很多钱。 Chu还表示，随着越来越多的司机开始使用电动汽车，Wyden不想让电动汽车变得更加昂贵。据报道，在制定基础设施法案之前，Wyden 担任主席的参议院财政委员会正在辩论仅通过卡车运输 VMT 税来支付新项目的想法，这引起了行业代表的强烈反对。参议员在经过长时间的谈判后于 8 月 1 日提出的该法案还提供了其他尚未被关注的提案。它将特别禁止在所有 Amtrak 列车上使用电子烟。该条款是在今年早些时候众议院和参议院交通委员会通过的一项法案之后做出的，该法案将把美铁的禁烟政策纳入联邦法律。该立法由代表华盛顿特区的民主党人 Del. Eleanor Holmes 和特拉华州的民主党参议员 Tom Carper 提出。这个故事已经更新，以澄清参议员罗恩怀登在里程跟踪计划上的立场。等待！在您开始新的一天之前，问问自己：如果没有 The Intercept，您刚刚阅读的故事由其他新闻媒体制作的可能性有多大？考虑一下没有 The Intercept 的媒体世界会是什么样子截距。谁会让党内精英对他们宣称的价值观负责？如果我们的记者没有及时报道，还有多少秘密战争、误判和反乌托邦技术会被隐藏起来？我们所做的报道对民主至关重要，但它并不容易、廉价或有利可图。 The Intercept 是一家独立的非营利新闻媒体。我们没有广告，所以我们依靠我们的会员——35,000 名，而且还在不断增加——来帮助我们对有权势的人负责。加入很简单，不需要花很多钱：您只需每月 3 美元或 5 美元即可成为永久会员。这就是支持您所依赖的新闻所需要的全部内容。成为会员", "note_en": "The Senate’s $1.2 trillion bipartisan infrastructure bill proposes a national test program that would allow the government to collect drivers’ data in order to charge them per-mile travel fees. The new revenue would help finance the Highway Trust Fund, which currently depends mostly on fuel taxes to support roads and mass transit across the country.\n Under the proposal, the government would collect information about the miles that drivers travel from smartphone apps, another on-board device, automakers, insurance companies, gas stations, or other means. For now, the initiative would only be a test effort — the government would solicit volunteers who drive commercial and passenger vehicles — but the idea still raises concerns about the government tracking people’s private data.\n  “It’s concerning to see the advancement of a plan that appears to depend on the government’s mass surveillance of vehicles’ location simply to function,” said Sean Vitka, policy counsel at Demand Progress.\n Sen. Ron Wyden, D-Ore., a well-known critic of surveillance, favors a type of program that may periodically read mileage but wouldn’t track drivers’ locations.\n “He is opposed to all approaches that lead to the persistent location tracking of personally owned vehicles, but supports creative pilots to find other solutions,” Wyden spokesperson Keith Chu said in an email. “Senator Wyden also believes more study and oversight of privacy issues is necessary before a permanent [vehicle miles traveled, or VMT, proposal] is adopted.”\n The bill would establish an advisory board to guide the program that would include officials representing state transportation departments and the trucking industry as well as data security and consumer privacy experts. As the four-year pilot initiative goes on, the Transportation and Treasury departments would also have to keep Congress informed of how they maintain volunteers’ privacy and how the per-mile fee idea could affect low-income drivers.\n Still, Vitka said the concept could put Americans’ private data at risk. “We already know the government is unable to keep data like this secure, which is another reason why the government maintaining a giant database of travel information about people in the United States is a bad idea.”\n The government has had its eyes for a while now on a driving fee to provide needed revenue to the Highway Trust Fund. The account has long lacked revenue to support federal spending on highways, driving the Treasury Department to consistently have to transfer money. The situation is so dire that the Congressional Budget Office, or CBO, has projected that the fund  could be short nearly $200 billion between 2022 and 2031 if current fuel taxes remain in place while funding for highway and mass transit projects increases with the rate of inflation.\n To increase revenues, the CBO suggested raising fuel taxes or enacting new taxes using the VMT model or even on electric vehicles, though the latter wouldn’t be likely to generate much money given how few there are. Chu also said that Wyden doesn’t want to make electric vehicles more expensive as more drivers begin to use them.\n Leading up to the infrastructure bill, the Senate Finance Committee, which Wyden chairs, was reportedly debating the idea of a  trucking-only VMT tax to pay for new projects, prompting fierce opposition from industry representatives.\n The bill, which senators introduced August 1 after long negotiations, also offers other proposals that have flown under the radar. It would specifically ban using e-cigarettes on all Amtrak trains.\n That provision follows the passage earlier this year in the House and Senate transportation committees of a bill that would enshrine Amtrak’s nonsmoking policy in federal law. The legislation was introduced by Del. Eleanor Holmes, a Democrat who represents Washington, D.C., and Democratic Sen. Tom Carper of Delaware.\n  This story has been updated to clarify Sen. Ron Wyden’s position on mileage-tracking programs.\n Wait! Before you go  on about your day, ask yourself: How likely is it that the story you just read would have been produced by a different news outlet if The Intercept hadn’t done it?Consider what the world of media would look like without The Intercept. Who would hold party elites accountable to the values they proclaim to have? How many covert wars, miscarriages of justice, and dystopian technologies would remain hidden if our reporters weren’t on the beat?The kind of reporting we do is essential to democracy, but it is not easy, cheap, or profitable. The Intercept is an independent nonprofit news outlet. We don’t have ads, so we depend on our members — 35,000 and counting — to help us hold the powerful to account. Joining is simple and doesn’t need to cost a lot: You can become a sustaining member for as little as $3 or $5 a month. That’s all it takes to support the journalism you rely on.  Become a Member", "posttime": "2021-08-06 12:07:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法案,bill,政府", "title": "基础设施法案可以使政府能够跟踪司机的旅行数据", "title_en": "Infrastructure Bill Could Enable Government To Track Drivers' Travel Data", "transed": 1, "url": "https://theintercept.com/2021/08/05/infrastructure-bill-travel-data-cars-privacy/", "via": "", "real_tags": ["法案", "bill", "政府"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 PDF 摘要：给定一张椅子的图片，我们能否提取椅子的 3D 形状，为其合理的关节和动作制作动画，并在其原始图像空间中进行原位渲染？上述问题促使我们设计一种自动化方法来提取和操作单个图像中的铰接对象。与之前在对象操作方面的工作相比，我们的工作超越了二维操作并专注于可铰接对象，从而为可能的对象变形引入了更大的灵活性。我们方法的流程首先从输入图像重建和细化感兴趣对象的 3D 网格表示；利用语义部分分割信息预测其控制关节；获得的对象 3-D 网格然后通过非刚性变形进行动画处理，并渲染以在其原始图像空间中执行原位运动。定量评估是对单个图像的 3-D 重建进行的，这是一项与我们的管道相关的既定任务，我们的结果明显超过了 SOTA 的结果。广泛的视觉结果也证明了我们方法的适用性。", "note_en": "Download PDF  Abstract: Given a picture of a chair, could we extract the 3-D shape of the chair,animate its plausible articulations and motions, and render in-situ in itsoriginal image space? The above question prompts us to devise an automatedapproach to extract and manipulate articulated objects in single images.Comparing with previous efforts on object manipulation, our work goes beyond2-D manipulation and focuses on articulable objects, thus introduces greaterflexibility for possible object deformations. The pipeline of our approachstarts by reconstructing and refining a 3-D mesh representation of the objectof interest from an input image; its control joints are predicted by exploitingthe semantic part segmentation information; the obtained object 3-D mesh isthen rigged \\&amp; animated by non-rigid deformation, and rendered to performin-situ motions in its original image space. Quantitative evaluations arecarried out on 3-D reconstruction from single images, an established task thatis related to our pipeline, where our results surpass those of the SOTAs by anoticeable margin. Extensive visual results also demonstrate the applicabilityof our approach.", "posttime": "2021-08-06 12:06:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "对象,object", "title": "对象唤醒：3D 对象重建，单个图像的动画", "title_en": "Object Wake-Up: 3-D Object Reconstruction, Animation from a Single Image", "transed": 1, "url": "https://arxiv.org/abs/2108.02708", "via": "", "real_tags": ["对象", "object"]}]