[{"category": "", "categoryclass": "", "imagename": "208deb5df7d6ed57b49ccc7b2d9aa464.jpg", "infoid": 1031832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "罗珀说，这是一项巨大的责任，对美国军队的未来有着巨大的影响，随着军方空中和太空司令部的优先事项发生变化，收购将需要强调“以当今技术、趋势和威胁所需的速度”开展工作。\n根据空军的一份报告，罗珀上个月在空军协会2020年虚拟空中、空间和网络会议上告诉观众，空军采购未来的关键将是敏捷性和灵活性。“如果你看看我们今天生活的这个世界，我们必须是敏捷的，”罗珀告诉观众。“对我们来说，有太多可能的未来，我们无法选择一个，并建立一支准备击败它的力量。”\n当Roper在12月16-17日参加TechCrunch的Sessions：Space活动时，这种情绪应该会给新技术开发人员价值600亿美元的关注理由。\n罗珀把重点放在了他所说的数字工程上，以在国防部内部创造制造能力，并为21世纪的战场开发新的防御能力和进攻武器。\n作为负责采购、技术和后勤事务的空军助理部长，以及负责空军内部研发、测试、生产和现代化工作的空军秘书和总参谋长的首席顾问，罗珀着眼于军队在迎接下一个千年战场的挑战方面的前进方向。这位助理部长是空军负责采购、技术和后勤事务的助理部长，也是空军部长和参谋长的首席顾问，负责空军内部的研发、测试、生产和现代化工作。\n在罗珀看来，这可能包括武器化人工智能、持久性无人机，甚至是经过基因编辑的生物武器或人类增强技术的存在，他在9月份的演讲中告诉他的虚拟观众。\n对于罗珀来说，当务之急是找到一种方法，让军方的创新速度快于消费技术-与军方同行相比，私营公司享受的官僚限制的缺乏，使得这项任务变得更加复杂。\n罗珀在9月份的演讲中说：“我们必须拥有战略灵活性的最后一个领域是能够计算机化或虚拟化关于我们的开发和生产、组装，甚至系统维护的一切，这样我们才能最终摆脱现实世界的专制，将学习和反馈带入数字世界。”\n空军已经在其硬件系列上转向数字优先的设计，它的下一代空中优势飞机的设计、组装和测试已经取得了巨大的胜利-旨在取代FA-18大黄蜂。\n罗珀在经历了漫长而传奇的军事生涯后，来到了他在空军的职位。他之前曾担任五角大楼战略能力办公室的创始主任。上海合作组织成立于2012年，旨在设想现有政府和商业系统的新应用。在他任职期间，罗珀将上海合作组织的预算从5000万美元增加到15亿美元。\n在该计划下，罗珀开发了新概念，如超高速火炮、多用途导弹、智能手机导航武器、大数据传感、3D打印系统、战斗机头像和战斗机分散的蜂拥而至的微型无人机。\n罗珀关于美国在21世纪作战场景中需要竞争的能力的远见的广度很可能是我们讨论的主题之一-以及罗珀认为初创企业在开发这些技术方面所扮演的角色。\n这些捐款可以通过参与AFVentures等项目来实现，AFVentures向各公司支付了近8亿美元，用于空军的飞车项目和国家的太空发射计划。\n罗珀在9月份告诉他的听众：“这就是我们如何通过从根本上改变我们构建和获取系统的方式以及我们与谁一起构建系统，为我们的部队提供在本世纪不可预测的、快速发展的创新战场上取胜所需的能力，这样无论我们的对手未来做什么，我们都将拥有超越并取胜的敏捷性。”“然后，我们将更快地创新，更快地适应，最终保持领先，颠覆并取胜。”\n要想听到罗珀对空军技术创新未来的看法，你可以抓住门票独家观看这次会议(以及许多其他会议)现场直播(视频点播)，与改变航天行业的创新者建立网络，发现最炙手可热的早期公司，了解如何为你的航天公司获得拨款，招聘人才，甚至找工作。\n11月13日之前，只需125美元就能获得一张早班票。我们还为团体、学生、在职军人/政府雇员以及希望让自己的创业公司获得额外知名度的早期空间初创公司创始人提供折扣。", "note_en": "It’s a huge responsibility that has massive implications for the future of the American military, and as the priorities for the military’s air and space command shift, Roper says that acquisitions will require an emphasis on working “at a pace that today’s technology, trends and threats require.”\n The keys to the future of Air Force acquisitions will be agility and flexibility, Roper told an audience last month  at the Air Force Association 2020 Virtual Air, Space and Cyber Conference, according to an Air Force report. “If you look at the world in which we live today, we must be agile,” Roper told the audience. “There are too many possible futures for us to pick one and build a force that’s geared to defeat it.”\n  That sentiment should give developers of new technologies $60 billion worth of reasons to pay attention when Roper joins us at  TechCrunch’s Sessions: Space event this December 16-17.\n Roper has placed an emphasis on what he calls digital engineering to create internal manufacturing capabilities within the Department of Defense and develop new defensive capabilities and offensive weaponry for a 21st century battlefield.\n As the Assistant Secretary of the Air Force for Acquisition, Technology and Logistics — and principal adviser to the secretary and chief of staff of the Air Force for R&amp;D, test, production and modernization efforts within the Air Force — Roper has a view into where the military is racing ahead to meet the challenges of the battlefield of the next millennium.\n In Roper’s view that could encompass the presence of weaponized artificial intelligence, persistent drones or even genetically edited bioweapons or human augmentation, he told his virtual audience in that September presentation.\n For Roper, the first order of business is to find a way to get the military innovating faster than consumer technologies — a task made that much more complicated by the lack of bureaucratic constraints private companies enjoy compared to their military counterparts.\n “The last area that we have to have strategic agility is in being able to computerize or virtualize everything about our development and production, assembly, even sustainment of systems, so that we can finally get past the tyranny of the real world and take learning and feedback into the digital one,” Roper said in his September address.\n The Air Force is already turning to digital-first design with its  eSeries of hardware, which has already notched a huge win with the design, assemblage and testing of its Next Generation Air Dominance aircraft — designed to replace the FA-18 Hornet.\n Roper comes to his position in the Air Force after what has already been a long and storied career in the military. He previously served as the founding director in the Pentagon’s Strategic Capabilities Office. First created in 2012, the SCO was designed to imagine new applications for existing government and commercial systems. During his tenure, Roper grew the budget of the SCO from $50 million to $1.5 billion.\n Under the program Roper developed new concepts like hypervelocity artillery, multipurpose missiles, smartphone-navigating weapons, big-data-enabled sensing, 3D printed systems, fighter avatars and fighter-dispersed swarming microdrones.\n The breadth of Roper’s vision about the capabilities that the U.S. will need to compete in a 21st century combat scenario will likely be one of the subjects we discuss — as well as the role Roper sees for startups in developing those technologies.\n Those contributions could come through participation in programs like  AFVentures, which paid out nearly $800 million to companies for programs like the Air Force’s flying car program, as well as the nation’s space launch program.\n “This is how we provide our forces the capabilities they’ll need to win on the unpredictable, rapidly evolving innovation battlefield in this century by fundamentally changing how we build and acquire systems and with whom we build them, so that no matter what our adversaries do in the future, we will have the agility to overmatch and win,” Roper told his audience in September. “Then we will innovate faster, we will adapt quicker and ultimately stay ahead to disrupt and win.”\n To hear Roper’s thoughts on the future of the Air Force’s technological innovations, you can  grab a ticket to get exclusive access to watch this session (along with many others) live (with access to video on demand), network with the innovators changing the space industry, discover the hottest early-stage companies, learn how to score grants for your space company, recruit talent or even find a job.\n Get an early-bird ticket for just $125 until November 13. And we have  discounts available for groups,  students,  active military/government employees and for  early-stage space startup founders who want to give their startup some extra visibility.", "posttime": "2020-10-29 09:46:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打算,force,空军", "title": "\n空军打算如何花掉600亿美元的研发预算？", "title_en": "\n\t\t\t\tHow is the Air Force looking to spend its $60 billion R&D budget?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/how-is-the-air-force-looking-to-spend-its-60-billion-rd-budget/", "via": "", "real_tags": ["打算", "force", "空军"]}, {"category": "", "categoryclass": "", "imagename": "cd5b73a74b2b0de22bab4f1bf3c9813a.jpeg", "infoid": 1031831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Jackery销售我分别评估过的Explorer 1000便携式发电站和SolarSaga 100W太阳能电池板，但它也将它们与发电站捆绑在一起(1599.97美元)，并将其中两块太阳能电池板捆绑在太阳能发电机组合中，这就是我测试的内容。便携式发电站的零售价为999.99美元，虽然它是最好的产品，而且容量更小、价格更实惠的机型也更多。电站本身提供1002Wh内置锂电池，额定功率1000W，额定浪涌功率2000W。它有两个USB-C输出，一个标准USB，一个直流电端口，就像你在汽车仪表盘上看到的那样，还有三个标准交流插座。它有一个集成的手柄，坚固的塑料外壳和一个内置的LCD显示屏，可以显示包括电池充电状态和输出信息在内的信息。\n在充满电的情况下，Explorer 1000可以为你的标准iPhone充电多达100次，或者为MacBook Pro充电多达8次。它可以为电烤架供电50分钟，也可以为小冰箱供电长达66小时。它可以通过墙上插座(7小时充满电)或汽车插座(14小时)充电，但它也可以与2倍SolarSaga电池板配对，在大约8小时的直射阳光下充满电-几乎和你把它插到家里的插座上充电一样快(如果只使用一个插座，需要两倍的时间，或大约17个小时)。\n至于太阳能电池板，每个零售价为299.99美元，为了更好的便携性，它们对折成两半，并具有集成的口袋和支架，便于电缆存储，在任何地方都很容易安装。每种方式都不到10磅，它们提供USB-C和USB-A两种直接输出，无需任何电池或电源即可为设备充电。然而，值得注意的是，它们不是防水的，所以在恶劣天气下使用时应该谨慎一些。\nJackery便携式电站是便携性、实用性和耐用性的完美结合。就移动设备的电量而言，它的内置电源可以让你续航数天，尽管搭载了巨大的电池，但它的重量只有相对便携的22磅(约合22磅)。内置输出选项的范围意味着你几乎可以连接到你能想到的任何电子设备，三个交流插座意味着如果你想把精力花在运营一个轻型户外厨房上，你可以同时为多个电器供电-尽管在那种耗电量下不会持续很长时间。\nJackery的Explorer系列具有耐用和吸引人的(只要任何通用设备都是如此吸引人的)外部抗冲击塑料外壳，他们肯定觉得自己不需要小心翼翼地对待。显示屏清晰易读，可一目了然地提供您所需的所有信息，包括备用电量、所连接设备的功耗，以及插入电源时的充电信息。\n许多充电选项也非常方便，这就是SolarSaga 100W窗格的用武之地。这些折叠板的大小约为折叠式露营侧桌大小，并集成了手柄，便于携带。它们还被坚固的聚碳酸酯外壳保护在外面，面板可以抵抗高温，以实现最大的耐用性。它们附带用于连接USB A和USB C设备的输出转换器电缆，可与Power Station附带的适配器配合使用，以便相互串联或单独充电。\n在后面你会发现可调节的支架，它允许你在一系列位置上将面板朝向太阳的角度，以最大限度地吸收能量。在这些设备和探索者发电站之间，您可以在短短几分钟内轻松设置好您自己的全移动式太阳能发电站所需的一切。\n在实际使用中，Jackery Explorer 1000便携式电站提供了如此多的后备电源，以至于很难通过一般测试来全部使用。你真的必须插入像我的Blendtec搅拌机这样的电器才能产生凹痕，即使这样，我也得到了大约12个小时或更长的使用时间。这是一个很好的解决方案，可以在露营旅行中将一些有选择的电网设备(如电视、小冰箱或投影仪)离网，而且在家里有这样的设备是一件令人惊叹的事情，因为在家里，有自己的备份选项可以让你度过一个高效的工作日，还是与家人保持联系，这是一件令人惊叹的事情。\nSolarSaga面板是对探索者的一个令人惊叹的补充，真正把它变成你自己的迷你绿色能源发电站。例如，即使你不相信将家里改用太阳能的费用和必要性，比如使用特斯拉的Powerwall，这也是一个很好的方式，可以在能源成本方面有效地为后院的冷却器“免费”供电，或者在你离开电网数天的情况下延长探索者在旅行中的使用寿命。这是一个很好的方式，可以在能源成本方面有效地为后院的冷却器供电，或者在你离开电网数天的情况下延长Explorer的使用寿命。", "note_en": "Jackery sells the  Explorer 1000 Portable Power Station and  SolarSaga 100W Solar Panels I reviewed separately, but it also bundles them together in a pack ($1,599.97) with the power station and two of the panels in a  Solar Generator combo, which is what I tested. The Portable Power Station retails for $999.99, though it’s the top of the line offering and there are more affordable models with less capacity. The station itself offers a 1002Wh internal lithium battery, and 1000W rated power with 2000W surge power rating. IT has two USB-C outputs, one standard USB, one DC port like you’d find in your car dash, and three standard AC outlets. It has an integrated handle, a tough plastic exterior and a built-in LCD display for information including battery charge status and output info.\n The Explorer 1000, on a full charge, can provide up to 100 charges for your standard iPhone, or up to eight charges of a MacBook Pro. It can power an electric grill for 50 minutes, or a mini fridge for up to 66 hours. It can be recharged via a wall outlet (fully charges in seven hours) or a car outlet (14 hours), but it can also be paired up with the 2x SolarSaga panels for a full recharge in around eight hours of direct sun exposure — almost as fast as you’d charge it plugging it into an outlet at home (it takes double the time, or around 17 hours, when using just one).\n  As for the solar panels, they each retail for $299.99, and fold in half for greater portability, and feature integrated pockets and stands for cable storage and easy setup anywhere. Each ways less than 10 lbs, and they offer both USB-C and USB-A direct output for charging up devices without any battery or power station required. It’s worth noting that they’re not waterproof, however, so you should exercise some caution when using them in inclement weather.\n   The Jackery Portable Power Station is a perfect blend of portability, practicality and durability. Its internal powerhouse will keep you going for days in terms of mobile device power, and it weighs only a relatively portable 22 lbs, despite packing in a massive battery. The range of output options built-in mean you can connect to just about any electronically-powered device you can think of, and three AC outlets mean you can power multiple appliances at once if you want to spend your juice on running a lightweight outdoor kitchen — albeit not for a super long time at that kind of power draw.\n Jackery’s Explorer series features durable and attractive (insofar as any utility device is ever that attractive) exterior impact-resistant plastic housings, and they definitely feel like they don’t need to be treated with kid gloves. The display is legible and clear, and provides all the info you need at a glance in terms of reserve power, and power expenditure for connected devices, as well as charging info when plugged in.\n  The many charging options are also super convenient, and that’s where the SolarSaga 100W panes come in. These fold up to roughly the size of a folding camp side table, and have integrated handles for even easier carrying. They’re also protected outside by a tough polycarbonate shell, and the panels are resistant to high temperatures for max durability. They come with included output converter cables for connecting to USB A and USB C devices, and can be used with the adapter included with the Power Station to charge that either in tandem with one another, or on their own.\n Around back you’ll find adjustable kickstands, which allow you to angle the panels towards the sun across a range of positions for maximum energy absorption. Between these and the Explorer Power Station you have everything you need to set up your own fully mobile solar energy power generation station in just a few minutes and with minimal effort.\n   In actual use, the Jackery Explorer 1000 Portable Power Station provides so much backup power that it was hard to expend it all through general testing. You really do have to plug appliances like my Blendtec blender in to make a dent, and even then I got roughly 12 hours of usage or more out of it. This is a great solution for taking some selective on-grid equipment off-grid while on camping trips, like a TV, small fridge or a projector, and it’s an amazing thing to have at home just in case of power outages, where having your own backup options can make the difference between getting through a productive workday or staying in touch with family.\n The SolarSaga panels are an amazing complement to the Explorer, and truly turn this into your own mini green energy power generation station. Even if you’re not convinced on the expense and necessity of converting your home to solar power, using something like Tesla’s Powerwall, for instance, this is a nice way to power a cooler in the backyard effectively for “free” when it comes to energy costs, or to extend the useful life of the Explorer on trips when you’re away from the grid over the course of multiple days.", "posttime": "2020-10-29 09:46:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太阳能,solar,设备", "title": "\nJackery的太阳能发电系统可以帮助您收集和储存足够的电力，以满足离网必需品的需求", "title_en": "\n\t\t\t\tJackery’s solar generator system helps you collect and store more than enough juice for off-grid essentials\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/jackerys-solar-generator-system-helps-you-collect-and-store-more-than-enough-juice-for-off-grid-essentials/", "via": "", "real_tags": ["太阳能", "solar", "设备"]}, {"category": "", "categoryclass": "", "imagename": "5d02ef52281851a393f1579ef5c28ccf.jpg", "infoid": 1031830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但是，这个AI基础设施可以赋能的下一波功能是什么呢？希比亚想找出答案。\n今天的Hebbia是一家初创公司，但实际上是一个产品工作室，一种由乔治·西沃尔卡(一名斯坦福大学的博士生，目前正在休假)和其他三名斯坦福人工智能研究人员和工程师创立的人工智能想法的草图。该小组使用当今可用的新的深度学习技术和模型，正试图突破知识图、语义分析和人工智能最终可以为人类生产力所做的事情的界限。\n西维尔卡从目睹他的朋友们在知识经济中工作的经历中受到启发，开始专注于这个领域。“我的很多同龄人…。每个人都进入这些白领工作，他们坐在那里，整天只是阅读大量的信息，“西维尔卡说。“人们成为银行分析师，从美国证券交易委员会的表格中挖掘出一两行信息，或者上法学院，或者成为法律分析师，做同样的事情…。(他们)只是陷入了这些文字墙的泥潭，陷入了无法理解的雪崩般的信息之中。“。\n他和他的团队想要做的是通过构建搜索、分析和总结工具来帮助你理解自己的个人知识世界，从而提高人类的生产力。“我们的想法是，Hebbia正在构建这些用于思考的生产力工具，以增强您的工作方式。它们实际上控制着你每天必须处理的信息输入和输出，“西沃尔卡说。\n这是一个雄心勃勃的愿景，所以他们必须从某个地方开始。他们的第一个产品，也是让我对这一愿景感到兴奋的，是一个Chrome插件，它已经处于私人测试版，今天将更广泛地向世界发布(注意：它目前还没有在Chrome商店上市)。这个插件升级了Chrome的搜索功能，超越了单纯的文本模式匹配，开始理解你的查询实际上是什么，以及如何根据页面上的文本来回答你的查询。以下是TechCrunch上该插件的演示：\n例如，你可以在维基百科页面上按Ctrl-F，然后问“这个人住在哪里？”该插件可以确定您正在询问位置，并开始在该页面上突出显示包含相关信息的文本。它是人工智能，而且是相当不错的测试版人工智能，所以当然，你的体验现在可以也将会是不一致的。但随着Hebbia调整其模型并提高对文本的理解，人们希望浏览器搜索能够完全转变，成为一个巨大的生产力提升。\n西沃尔卡在某种程度上是早期的神童。他十几岁时就在NASA工作，两年半后从斯坦福大学的学士学位毕业，一年多一点的时间就完成了硕士学位，并在被赫比亚拦下之前开始攻读博士学位。\nHebbia的愿景在最初几个月就已经吸引了风投们的注意。Flodgate的Ann Miura-Ko领导了一轮110万美元的种子期前融资，海军拉维坎特、彼得·泰尔、凯文·哈茨、迈克尔·费尔蒂克和科里·利维也加入了这轮融资。\n西沃尔卡指出，他们的Ctrl-F产品目前是公司的主要关注点，并充当了一种进入知识图谱和个人生产力提供的更大潜力的门户。“这是计算机所能做的最后前沿之一，”西沃尔卡说，他指出，通过将数据数字化并使其更容易处理，计算已经给许多领域带来了革命性的变化。有了Ctrl-F，“这只是一项基准技术，[我们]只是触及了我们可以用它做什么的皮毛。”", "note_en": "But what is the next wave of functionality that this AI infrastructure can empower?  Hebbia wants to find out.\n Hebbia   today is a startup but really a product studio, a sort of sketchpad for AI ideas founded by George Sivulka (a PhD student from Stanford currently on leave) and a mélange of three other Stanford AI researchers and engineers. The group, using the new deep learning techniques and models available today, is trying to push the boundaries of what knowledge graphs, semantic analysis and AI can ultimately do for human productivity.\n   Sivulka was inspired to focus on this domain from witnessing his friends’ experiences working in the knowledge economy. “A lot of my peers … everyone goes into these white-collar jobs where they’re sitting down and just reading immense quantities of information all day,” Sivulka said. “People become banking analysts and dig through SEC forms for one or two lines of information, or go to law school or become legal analysts and do the same thing… [They’re] just bogged down by these walls of text, by this like avalanche of information that is impossible to make sense of.”\n  What he and his team want to do is supercharge human productivity by building search, analysis and summarization tools that can help you make sense of your own, personal universe of knowledge. “The idea is that Hebbia is building these productivity tools for thought that augment the way you do work. They’re things that actually control the information input and outputs that you have to deal with every day,” Sivulka said.\n It’s an ambitious vision, so they had to start somewhere. Their first product, which is what got me excited about the vision, is a Chrome plugin that’s been in private beta and is being released to the world more broadly today (note: it’s still unlisted in the Chrome Store for now). The plugin upgrades the search functionality in Chrome to go beyond mere text pattern matching to begin to comprehend what your query actually  is and how it might be answered given the text on a page. Here’s a demo of the plugin on TechCrunch:\n  So, for instance, you could Ctrl-F on a Wikipedia page and ask “Where did this person live?” and the plugin can determine that you are asking for locations and begin to highlight text on that page with relevant information. It’s AI, and pretty beta AI at that, so of course, your experience can and will be inconsistent right now. But as Hebbia tunes its models and improves its understanding of text, the hope is that browser search can be completely transformed and become a massive productivity boost.\n Sivulka is something of an early wunderkind. He worked at NASA as a teenager, and graduated from his bachelor’s at Stanford in 2.5 years, finishing his master’s a bit more than a year later, and started a PhD before getting waylaid by Hebbia.\n Hebbia’s vision has already attracted the notice of VCs in just its early months. Ann Miura-Ko at Floodgate led a $1.1 million pre-seed round that was joined by Naval Ravikant, Peter Thiel, Kevin Hartz, Michael Fertik and Cory Levy.\n Sivulka notes that their Ctrl-F product is the main focus for the company right now, and acts as a sort of gateway into the larger potential that knowledge graphs and personal productivity offer. “This is one of the final frontiers of what computers can do,” Sivulka said, noting that computation has already revolutionized many fields by digitizing data and making it easier to process. With Ctrl-F, “this is a baseline technology, [we’re] just scratching the surface of what we can do with this.”", "posttime": "2020-10-29 09:46:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,ctrl,理解", "title": "\nHebbia希望通过更好的人工智能使Ctrl-F(或Command-F)真正有用", "title_en": "\n\t\t\t\tHebbia wants to make Ctrl-F (or Command-F) actually useful through better AI\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/hebbia-wants-to-make-ctrl-f-or-command-f-actually-useful-through-better-ai/", "via": "", "real_tags": ["人工智能", "ctrl", "理解"]}, {"category": "", "categoryclass": "", "imagename": "1515259fdb2f9d8774687fb67055e2ba.jpg", "infoid": 1031827, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "史密斯买得起。2018年，就在SAP即将上市之前，他将总部位于犹他州普罗沃的Qualtrics以80亿美元的价格出售给了SAP。今年早些时候，SAP宣布计划将Qualtrics分拆为上市公司。\n除了爵士，他还得到了Vivint Smart Home竞技场，美国国家篮球协会(NBA)G联赛球队盐湖城之星，以及AAA棒球子公司盐湖蜜蜂的管理。史密斯是从米勒家族手中买下这些房产的，米勒家族经营这些房产已经有30多年了。\n史密斯为能买下他多年来支持的特许经营权而欣喜若狂。我和我的妻子对有机会带领球队走向遥远的未来感到绝对的谦卑和兴奋-特别是在NBA有最伟大的球迷的情况下。犹他州的犹他爵士及其首府是米勒夫妇巨大的爱心、慷慨和投资的受益者。我们期待着在他们毕生努力的基础上再接再厉。“他在一份声明中说。\n这笔交易正在等待NBA理事会的批准，但一旦批准，史密斯将拥有对专营权的完全决策权。\nQualtrics是一家制造客户调查工具的公司，成立于2002年，在两年前将公司出售给SAP之前，从Accel、Insight Partners和Sequoia等公司筹集了超过4亿美元。\n史密斯并不是第一位收购篮球队的科技亿万富翁。他加入了马克·库班和前微软首席执行官史蒂夫·鲍尔默的行列，前者在同年以57亿美元的价格收购了达拉斯小牛，后者在同年将Broadcast以57亿美元的价格卖给了雅虎。鲍尔默在2014年以20亿美元的价格收购了洛杉矶快船。", "note_en": "Smith can afford it. He sold  Qualtrics,   which is based in Provo, Utah, in 2018  to SAP for $8 billion just before the startup was about to go public. Earlier this year,  SAP   announced plans to spin out Qualtrics as a public company.\n In addition to The Jazz, he’s also getting Vivint Smart Home Arena, the National Basketball Association (NBA) G League team Salt Lake City Stars and management of the Triple-A baseball affiliate Salt Lake Bees. Smith is buying the properties from the Miller family, who have run them for more than three decades.\n   Smith was over the moon about being able to buy into a franchise he has supported over the years. “My wife and I are absolutely humbled and excited about the opportunity to take the team forward far into the future – especially with the greatest fans in the NBA. The Utah Jazz, the state of Utah, and its capital city are the beneficiaries of the Millers’ tremendous love, generosity and investment. We look forward to building upon their lifelong work,” he said in a statement.\n The deal is pending approval of the NBA Board of Governors, but once that happens, Smith will have full decision-making authority over the franchise.\n Qualtrics, which makes customer survey tools, was founded in 2002 and raised more than $400 million from firms like Accel, Insight Partners and Sequoia before selling the company two years ago to SAP.\n Smith is not the first tech billionaire to buy a basketball team. He joins Mark Cuban, who bought the Dallas Mavericks in 1999 after  selling Broadcast.com to Yahoo for $5.7 billion that same year, and former Microsoft CEO  Steve Ballmer, who bought the Los Angeles Clippers in 2014 for $2 billion.", "posttime": "2020-10-29 09:45:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "犹他,ceo,史密斯", "title": "\n高通首席执行官瑞安·史密斯斥资16亿美元收购犹他爵士多数股权", "title_en": "\n\t\t\t\tQualtrics CEO Ryan Smith is buying majority stake in the Utah Jazz for $1.6B\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/qualtrics-ceo-ryan-smith-is-buying-majority-stake-in-the-utah-jazz-for-1-6b/", "via": "", "real_tags": ["犹他", "ceo", "史密斯"]}, {"category": "", "categoryclass": "", "imagename": "02938c32df71c2163a825026ea2dc2b7.jpg", "infoid": 1031826, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据该公司称，其他现有投资者增加了投资，包括NEA、8VC和Prologis Ventures。新的投资者包括Henry Crown and Company和Evolv Ventures。\n该公司自动化配送场的目标并没有像其他公司正在追求的更面向公众的机器人出租车那样受到同样的关注。但对实现这一目标的公司来说，这可能同样具有影响力和潜在的有利可图。配送场是货物从长途卡车向仓库过渡的地方，最终是消费者。这些经济活动的中心依赖于人类使用柴油动力的庭院卡车来完成重复性的手工任务。在美国大约有40万个配送场，这个数字让人对机会的潜在规模有了一个概念。\n这家位于科罗拉多州戈尔德市的初创公司(前身为Azevtec)开发了一个由三部分组成的系统，其中包括一辆自动电动堆场卡车、管理运营的软件和现场基础设施。整个系统自动化堆场操作的手动方面，包括在堆场周围移动拖车以及往返装卸码头。该系统还可以连接和拆卸拖车，连接和断开拖车刹车线，并监控拖车位置。\nOuttrider吹捧其电动和自动驾驶系统的双重好处。该公司指出，其电动堆场卡车是自动驾驶的理想选择，因为它们减少了维护，降低了运营成本，并提供了可靠的清洁电力。该公司创始人兼首席执行官安德鲁·史密斯(Andrew Smith)表示，新冠肺炎造成的中断突显了对这种自动化配送场技术的需求。\n目前拥有110名员工的Outtrider已经完成了“多个”试点项目，包括与佐治亚-太平洋公司的一个试点项目，并自2月份脱离隐形状态以来扩大了客户基础。", "note_en": "Other existing investors increased their investments, including NEA, 8VC and Prologis Ventures, according to the company. New investors included Henry Crown and Company and Evolv Ventures.\n The company’s aim to automate distribution yards doesn’t get the same kind of attention as the more public-facing robotaxis that other companies are pursuing. But it could be as impactful and potentially lucrative to the company that pulls it off. Distribution yards are where goods make the transition from long-haul trucks to warehouses, and eventually the consumer. These hubs of economic activity rely on humans to make repetitive, manual tasks using diesel-powered yard trucks. There are some 400,000 distribution yards located in the United States, a number that provides an idea of the potential size of the opportunity.\n  The Golden, Colorado startup previously known as Azevtec developed a three-part system that includes an autonomous electric yard truck, software to manage the operations and site infrastructure. The total system automates the manual aspect of yard operations, including moving trailers around the yard as well as to and from loading docks. The system can also hitch and unhitch trailers, connect and disconnect trailer brake lines and monitor trailer locations.\n  Outrider touts the dual benefits of its electric and autonomous system. The company notes that its electric yard trucks are ideal for autonomy due to their reduced maintenance, lower operating costs and reliable clean power. Andrew Smith, the company’s founder and CEO, says disruptions caused by COVID-19 has highlighted the need for this kind of automated distribution yard technology.\n Outrider, which now employs 110 employees, has completed “multiple” pilot programs, including one with Georgia-Pacific, and expanded its customer base since coming out of stealth in February.", "posttime": "2020-10-29 09:45:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "技术,bring", "title": "\nOtrider筹集6500万美元将其自主技术带到分销场", "title_en": "\n\t\t\t\tOutrider raises $65 million to bring its autonomous tech to distribution yards\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/outrider-raises-65-million-to-bring-its-autonomous-tech-to-distribution-yards/", "via": "", "real_tags": ["技术", "bring"]}, {"category": "", "categoryclass": "", "imagename": "f3a2275648e9ffe2cdacc3e6d58288ba.png", "infoid": 1031825, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这家总部位于赫尔辛基的公司表示，它在大流行期间受益，甚至在2020年4月受益，因为人们对自动化和应用程序的需求呈爆炸式增长。该公司表示，目前其平台在全球拥有7万名客户，包括麦当劳、迪士尼、Expedia、PicsArt、Flo、Jam City和Discord。\n首席执行官阿纳托利·沙里富林(Anatoly Sharifulin)在一份声明中表示：“AppFollow帮助团队了解你的用户和竞争对手的情绪，找出你的潜在客户如何搜索应用程序，并利用这些知识让你的应用程序更引人注目，当然，还可以跟踪你的KPI，比如下载量和收入，以确保一切都在控制之中。”\nNauta Capital的尤金·克鲁格洛夫(Eugene Kruglov)说：“我们非常高兴能与Nauta Capital在这轮融资中合作。目前的投资者以及我们的一些客户都参与了这轮融资，这证明我们的方向是正确的，可以成为有效应用管理的市场标准。“。\n该公司在9个国家雇佣了65名员工，所有人都在远程工作。该公司将利用这笔投资加强其在美国和欧洲的存在，聘请销售和营销部门的副总裁级别的高管，并使他们的平台多样化。", "note_en": "The Helsinki-headquartered company says it benefitted during the pandemic and even in April 2020 as the desire for automation and apps exploded. It says it now has 70,000 clients on its platform globally, including McDonald’s, Disney,  Expedia,    PicsArt,   Flo, Jam City and Discord.\n CEO Anatoly Sharifulin said in a statement: “ AppFollow   helps teams understand sentiment, both for your users and competitor’s, figure out how your potential customers search for apps and use this knowledge to make your app more visible and, of course, follow on your KPIs like downloads and revenues to be sure that all is under control.”\n  Eugene Kruglov of  Nauta Capital   said: “We are extremely delighted to partner with Nauta Capital on this round. And having both of current investors and as well some of our customers to participate in the round proves that we are on the right direction to become the market standard for effective app management.”\n The company, which employs 65 people across nine countries, all working remotely, will use the investment to strengthen its presence in the U.S. and Europe, hire VP-level executives in sales and marketing, and diversify their platform.", "posttime": "2020-10-29 09:45:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nauta,应用程序", "title": "\n应用管理初创公司AppFollow筹集500万美元首轮融资，由Nauta Capital牵头", "title_en": "\n\t\t\t\tApp management startup AppFollow raises $5M Series A round led by Nauta Capital\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/app-management-startup-appfollow-raises-5m-series-a-round-led-by-nauta-capital/", "via": "", "real_tags": ["nauta", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "f345caea3c885292115bbe7abb618767.jpg", "infoid": 1031824, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "然而，随着Spotify进军播客领域，这一地位现在正被撼动到完全不同的领域，这引发了许多问题，即Spotify应该、也可以在监督其平台上的内容方面发挥什么作用。现在，人们对谁本质上在其平台上获得了一个平台一片哗然。\n这个问题在最后一天得到了突显，当时，有着自由意志主义倾向的高薪播客乔·罗根(Joe Rogan)让亚历克斯·琼斯(Alex Jones，因InfoWars出名，他自己的播客在2018年与YouTube等公司一起从Spotify上被删除)参加他的节目，时间漫无边际地持续了三个小时，引发了人们对Spotify如何让一个臭名昭著的错误信息提供者获得聚光灯和麦克风的轩然大波。\n喜剧演员蒂姆·狄龙(Tim Dillon)也参与了这场对话，对话涵盖了相当广泛的主题，共同的主题是当今最具争议性的话题，背后未经证实(或反证)的故事被作为事实呈现，当然还有卑鄙的民主党人(DEM)。\n罗根几次试图驳斥或证明他们所报道的一些故事和主张。例如，早些时候，当琼斯开始谈论民主党人如何落入游说者的口袋时(据他所说，特朗普并不是)，罗根实时拨打网络链接，显示这一点并不是很清楚，AT&amp；T承认向特朗普的前律师迈克尔·科恩支付费用，以帮助推进自己与特朗普及其政府的关系。\n“我只是想给你一个格式塔分析，”琼斯咆哮着回应…。然后，他为贾里德·库什纳(Jared Kushner)辩护。“他碰到的每一样东西都会变成金子。”(除了，看起来，这个，这个，嗯，实际上可能还有很多其他的东西。)。\n谈话转到了其他一些话题上，比如民主党人如何故意试图让经济崩溃，让特朗普难看，以及一场关于疫苗有效性的讨论，细节上非常模糊(在一个已经持怀疑态度的人手中，其中可能有足够的线索，很可能是完全放弃新冠肺炎的公共卫生倡议的引爆点)。\n让亚历克斯·琼斯在大流行期间散布反Vaxxer阴谋是站不住脚的。如果你想了解脊髓灰质炎疫苗是如何起作用的，就去找一个他妈的真正的专家@joerogan，而不是某个折磨桑迪·胡克(Sandy Hook)家庭的没有医学背景的反社会分子。Https://t.co/NceSDUwwXa。\n目前，Spotify没有对此公开回应。我们已经尝试与该公司联系，以获得对有关该节目的问题的回应，如果有消息，我们会及时更新。我们已经几个小时什么都没有了，几个月前问过同样问题的一位同事也没有得到回复。所以我们不会屏息以待。\n值得注意的是，虽然Spotify详细说明了如何举报其平台上的非法音乐曲目或露骨的歌词，但它从未概述过其在播客方面的内容政策。\n而且从表面上看，该公司一直在采取一些拖延的策略来更直接地面对问题。\nBuzzFeed今天公布了该公司法务官霍拉西奥·古铁雷斯(Horacio Gutierrez)从今天开始泄露的一份备忘录，这份备忘录似乎是在为公司在发布有争议的播客(尤其是这个)方面的立场辩护，允许主持人自由选择他们想要的客人，而不是回应公众的强烈抗议，而是将问题提交给信安公司进行调查。\n他写道：“如果团队成员对我们平台上的任何内容有担忧，你应该鼓励他们向信安公司报告，因为他们是我们团队负责审查内容的专家。”“然而，重要的是，他们不会仅仅因为他们在网上读到的东西就标记一条内容。断章取义是很常见的。“。\n关于有争议的内容的要点似乎突显了Spotify是如何坚持作为一个中立的平台，而不是一个积极的策展人的立场：“Spotify一直是一个创意表达的地方，”古铁雷斯写道。“在我们的平台上拥有不同的声音和观点是很重要的。”\n他随后指出，如果播客符合Spotify的内容政策-没有明确说明是什么-那么嘉宾就不会被禁止：“我们不会禁止特定的个人成为其他人节目的嘉宾，因为这一集/节目符合我们的内容政策。”\n他在结束时指出，“我们理解，不是所有人都会同意我们平台上的每一条内容。不过，我们确实希望您能帮助您的团队了解我们作为平台的角色，以及我们在决策时所采取的谨慎态度。“。\n今年夏天早些时候，当罗根以一笔据报道价值1亿美元的独家交易来到Spotify时，人们感到不安-这一事件首次引入了Spotify将如何处理内容争议的问题。这并不奇怪，因为罗根已经引起了争议，例如，他如何使用被LGBQT社区成员认为是跨性别恐惧症的污言秽语(这个问题一直没有消失)。现在，随着抵制威胁的出现，这些问题再次出现。\n嗨@Spotify@SpotifyUSA我是一个超级用户，如果你继续支持乔·R*g*n，而他邀请亚历克斯·琼斯传播阴谋论，我绝对会取消，并把我所有的时间都花在鼓励其他人取消。Https://t.co/OVnc0x5dmm。\n这是否真的会削弱其用户基础，这确实引发了很多问题，比如公司的形象是如何改变的，而且到目前为止，Spotify在其平台上的内容方面得到了相对容易的突破。它一直在优化独家名称和将它们推向市场的速度(并为吹嘘的权利支付大笔资金)，考虑到这些名称实际上在做什么，以及这可能会产生什么影响。\n一个值得思考的有趣角度是，如果其他知名主持人强烈反对Spotify的编辑地位，他们是否会放弃。另一个问题是，这是否(或何时)会引起当权者的注意。\n就在今天，Facebook、Twitter和谷歌的高管被带到参议院，就他们平台上的偏见、他们的员工如何对待内容审核，以及他们是否对这些内容负责等问题被带到参议院。我不知道今天的证词会有多有效或有多大影响，但首先，也许是时候把Spotify也包括在名单上了。", "note_en": "That position, however, is being jolted into quite different territory now with its move into podcasting, which is raising lots of questions over what role  Spotify   should and could play in overseeing the content on its platform. Now people are in an uproar of who, essentially, gets a platform on its platform.\n That issue was highlighted in the last day, when  Joe Rogan   — the highly paid podcaster with a libertarian bent — brought on Alex Jones (of InfoWars fame, whose own podcast was  removed from Spotify, along with YouTube and others, in 2018) on to his show for a meandering three hours, leading to an uproar over how Spotify is giving a spotlight and microphone to an infamous purveyor of misinformation.\n  The conversation, which also featured comedian Tim Dillon, covered a pretty wide range of topics, with the common themes being today’s most controversial topics, unproven (or disproven) stories behind them presented as fact, and of course the dastardly Dems.\n Rogan made a few attempts at refuting or standing up some of the stories and claims that they covered. Early on, for example, when Jones started to talk about how the Democrats are in the pocket of the lobbyists (while Trump was not, according to him), Rogan called up web links in real time, showing that this isn’t quite so clear, with AT&amp;T admitting to paying Trump’s former lawyer Michael Cohen fees, to help advance its own position with Trump and his administration.\n “I was just trying to give you a Gestalt analysis,” Jones growled in response… He then went into a defense of Jared Kushner. “Everything he touches he turns to gold.” (Except, it seems,  this,  this, and well, maybe many other things, actually.)\n The conversation veered on to a number of other topics, such as how the Democrats were intentionally trying to crash the economy to make Trump look bad, and a discussion, very the foggy on details, of the effectiveness of vaccines (foggy, but probably enough strands of which, in the hands of a person already skeptical, may well be the tipping point to dismissing Covid-19 public health initiatives altogether).\n Letting Alex Jones spread anti-vaxxer conspiracies during a pandemic is indefensible. If you want to understand how the polio vaccine works, talk to an actual fucking expert  @joerogan not some sociopath with no medical background who tortured Sandy Hook families.  https://t.co/NceSDUwwXa\n For now, Spotify is not saying anything in response to this publicly. We’ve tried to reach out to the company to get a response to questions about the show, and we will update if we hear back. We’ve had nothing for hours, and a colleague who asked the same questions months ago never heard back either. So we’re not holding our breath.\n Notably, while Spotify has  detailed how to report illegal musical tracks or explicit lyrics on its platform, it has never outlined its content policies when it comes to podcasting.\n And from the looks of it, the company has been using some delaying tactics in facing up to the problem more directly.\n BuzzFeed today has  published a leaked memo from the company’s legal officer Horacio Gutierrez, from today, which appears to defend the company’s position on publishing controversial podcasts (not this one in particular), giving hosts the freedom to have whichever guests they want, and not responding to public outcry but to refer issues to Trust &amp; Safety to investigate.\n “If a team member has concerns about any piece of content on our platform, you should encourage them to report it to Trust &amp; Safety because they are the experts on our team charged with reviewing content,” he wrote. “However, it’s important that they aren’t simply flagging a piece of content just because of something they’ve read online. It’s all too common that things are taken out of context.”\n Bulleted talking points about controversial content seem to underscore how Spotify is sticking to a position of being a neutral platform, not a proactive curator: “Spotify has always been a place for creative expressions,” Gutierrez wrote. “It’s important to have diverse voices and points of view on our platform.”\n He then noted that if a podcast complies with Spotify’s content policies — it doesn’t make clear what those are — then guests are not banned: “We are not going to ban specific individuals from being guests on other people’s shows, as the episode/show complies with our content policies.”\n He noted in closing that “we appreciate that not all of you will agree with every piece of content on our platform. However, we do expect you to help your teams understand our role as a platform and the care we take in making decisions.”\n People were upset back when Rogan came to Spotify in an exclusive, reportedly $100 million, deal earlier this summer — an event that first  introduced the question of how Spotify would handle content controversies. No surprise there, since Rogan was already courting controversy over, for example, how he uses slurs considered to be transphobic by members of the LGBQT community (an issue that has  not gone away). Now those questions are coming up again, along with boycotting threats.\n Hi  @Spotify  @SpotifyUSA I am a super-user and I will absolutely cancel and spend all my time online encouraging other people to cancel if you keep backing Joe R*g*n while he invites Alex Jones on to spread conspiracy theories.  https://t.co/OVnc0x5dmm\n Whether this actually makes a dent in its user base, it does raise lots of questions about how the profile of the company is changing, and that Spotify has been given a relatively easy break when it comes to content on its platform up to now. It’s been optimising for exclusive names and speed to market in getting them (and paying big bucks for the bragging rights), over considering what those names are actually doing, and what impact that could have.\n One interesting angle to ponder is whether other high-profile hosts might bail if they feel strongly about Spotify’s editorial position. Another is whether (or when) this will catch the eye of the Powers That Be.\n Just today, executives from Facebook,  Twitter   and  Google   are being  brought before the Senate with questions about bias on their platform and how their staff approaches content moderation, and whether they are liable for that content. I don’t know how effective or impactful today’s testimony will be, but for a start, maybe it’s time they start including Spotify in that list, too.", "posttime": "2020-10-29 09:45:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "罗根,rogan,spotify", "title": "\n乔·罗根、亚历克斯·琼斯和Spotify的中立幻觉", "title_en": "\n\t\t\t\tJoe Rogan, Alex Jones and Spotify’s illusion of neutrality\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/joe-rogan-alex-jones-and-spotifys-illusion-of-neutrality/", "via": "", "real_tags": ["罗根", "rogan", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "64d9d05f72ec3937f35458802755489b.jpg", "infoid": 1031823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这将是一个充满讽刺意味的举动，因为推动结束反竞争做法似乎在已经主导科技行业的最大公司之间创造了更激烈的竞争，而不是在那些老牌公司和更灵活的初创公司之间。\n据英国“金融时报”报道，苹果对搜索技术重新产生兴趣的迹象可以从对最新版iOS 14 iPhone操作系统的细微而重大的改变，以及苹果用于搜索网络和优化搜索功能的蜘蛛工具活跃度的增加两个方面找到。\n现在，当用户在iOS 14的主屏幕上输入查询时，苹果会显示自己的搜索结果，并直接链接到网站。就背景而言，这一行为已经为人们所知，因为人们已经看到iOS测试版中出现了这一功能。早在8月份，Coywolf的乔恩·亨肖(Jon Henshaw)就注意到，苹果爬虫上的搜索量正在上升。\n英国“金融时报”援引消息人士的话说，这一变化标志着苹果内部搜索发展的重大变化，并可能成为更广泛地进军搜索领域的基础。\n这家总部位于加利福尼亚州库比蒂诺的公司当然拥有专业知识。不到三年前，谷歌逮捕了谷歌搜索负责人约翰·詹南德雷亚(John Giannandrea)，人们普遍认为这是为了巩固苹果在人工智能和通过Siri进行语音搜索方面的基础。由于苹果的内部组织方式，詹南德雷亚不太可能会全身心地投入到潜在的“搜索产品”和Siri上。但他可能会将自己的专业知识提供给一个单独开发功能的团队，这是有可能的。\n任何搜索工具的开发都将是苹果占领搜索市场的第三种方式，由于两家公司签订了一份利润丰厚的合同(这也是司法部对谷歌所谓的围绕搜索的反竞争活动进行调查的核心内容)，苹果现在将谷歌作为默认的搜索服务。市场上仅有的其他主要搜索服务依赖于微软的必应(Bing)来支持他们的搜索结果。\n虽然这些迹象确实表明了活动的实际上升，但苹果的爬虫活动可能有一个解释，它对企业的恶作剧没有那么严重，更符合苹果相当明确的目标。\n虽然苹果在搜索领域与谷歌展开直接竞争的故事成为头条新闻，但Siri获得了更多的搜索请求，更多地成为苹果与谷歌(Google)或微软必应(Microsoft Bing)等搜索服务之间的对话者，这也可以合理地解释活动增加的原因。这种去中介化是谷歌几年前就开始的事情，多年来甚至已经修改和扩大，以打击Siri的类似行为。\n这在一定程度上可以归结为语义。我们所说的“搜索引擎”是指“人们在其中输入查询的网站”，还是指一个语音助手，它会介入到带有自己来源的白标网页结果中。减少像谷歌这样的怪物在你自己的平台上的品牌存在对任何竞争对手来说都是一个强大的动力，无论领域是什么。\n让Siri成为一站式商店可能会让苹果在监管规定下被迫在iOS自注册流程中允许搜索提供商选择。不过，这对谷歌没有任何帮助，谷歌向苹果支付了数十亿美元，因为iOS用户的价值远远高于其业务中的任何其他移动网络用户。谷歌方面表示，当人们有选择的时候，无论如何他们都会选择谷歌。让Siri成为搜索领域的夸夸其谈者的另一个原因或许是苹果的强劲表现。\nTechCrunch已经联系苹果请其发表评论，并将在我们收到回复时更新。", "note_en": "That would be a move rife with irony as the push for an end to anti-competitive practices is seemingly creating greater competition among the largest companies which already dominate the technology industry rather than between those established companies and more nimble upstarts.\n Signs of Apple’s resurgent interest in search technologies can be found in both a subtle but significant change to the latest version of the iOS 14 iPhone operating system and increasing activity from Apple’s spidering tools that are used to scour the web and refine search functionality, the Financial Times reported.\n Apple is now showing its own search results and linking directly to websites when users type queries from its home screen in iOS 14. For context, this is a behavior that has been known for a while as people have seen the feature pop up in beta versions of iOS. And the search volume being up on Apple’s crawler is something that Jon Henshaw of Coywolf  had noted back in August.\n Sources cited by the Financial Times said that the change marked a significant step-change in Apple’s in-house search development and could be the basis for a broader push into search.\n The Cupertino, California-based company certainly has the expertise. A little less than three years ago it nabbed  Google’s   head of search,  John Giannandrea,   in what was widely seen as an attempt to shore up Apple’s foundations in artificial intelligence and voice search via Siri. Because of the way that Apple is organized internally, it’s unlikely that Giannandrea will be devoting full-time effort to both a potential “search product” and  Siri  . But it’s within the realm of possibility that he could be lending his expertise to a team working on a separate feature.\n Any development of a search tool would be a third way for Apple to capture search, which now uses Google as its default search service thanks to a lucrative contract between the two (one that’s also at the heart of a Justice Department inquiry into Google’s purported anti-competitive activities around search). The only other major search services on the market rely on Microsoft’s Bing to power their results.\n  While the signs do point to an actual uptick in activity, there could be an explanation for Apple’s crawler activity that’s less heavy on corporate skunkworks skulduggery and more in line with goals that Apple’s stated pretty clearly.\n While the story about Apple getting into direct competition with Google on search makes for a great headline, the uptick in activity could be explained equally as rationally by Siri getting more search queries and being more of an interlocutor between Apple and search services like Google or Microsoft’s Bing. This disintermediation is something that Google began years ago and has even modified and expanded over the years to combat the same kind of behavior from Siri.\n Some of this comes down to semantics. By “search engine” do we mean “a web site that people type queries into” or do we mean a voice assistant that steps in to white-label web results with its own sourcing. Cutting down on the brand presence of a monster like Google on your own platform is a powerful motivator for any competitor, no matter the space.\n Making Siri a one-stop shop could inoculate Apple in the scenario where they are forced to  enable a search provider choice in the iOS onboarding flow by regulation. It won’t do anything to help Google though, which pays Apple billions because iOS users are worth way more than any other mobile web users to its business. Google, for its part, says that when people have a choice they still pick Google anyway. Perhaps another reason why making Siri the search equivalent of an overtalker is the strong play for Apple.\n TechCrunch has reached out to Apple for comment and will update when we hear back.", "posttime": "2020-10-29 09:44:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,google,苹果,谷歌,搜索", "title": "\n苹果搜索爬虫的活动可能标志着谷歌的竞争对手，或者是让Siri成为一站式商店的竞标", "title_en": "\n\t\t\t\tApple search crawler activity could signal a Google competitor, or a bid to make Siri a one-stop shop\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/onering/", "via": "", "real_tags": ["apple", "google", "苹果", "谷歌", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "785ba040e8863fa046a906c094fc5842.jpg", "infoid": 1031822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索菲·奥尔科恩是硅谷阿尔科恩移民法的创始人，也是2019年全球法律专家奖的创始人，她的获奖作品是“加州年度企业家移民服务律师事务所”。她将人们与拓展他们生活的业务和机会联系起来。", "note_en": "Sophie Alcorn is the founder of  Alcorn Immigration Law in Silicon Valley and 2019 Global Law Experts Awards’ “Law Firm of the Year in California for Entrepreneur Immigration Services.” She connects people with the businesses and opportunities that expand their lives.", "posttime": "2020-10-29 09:44:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "兴趣,sophie,科恩", "title": "\n亲爱的苏菲：对于有兴趣换工作的E-2签证持有者，有什么升级选择吗？", "title_en": "\n\t\t\t\tDear Sophie: Any upgrade options for E-2 visa holders interested in changing jobs?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/dear-sophie-any-upgrade-options-for-e-2-visa-holders-interested-in-changing-jobs/", "via": "", "real_tags": ["兴趣", "sophie", "科恩"]}, {"category": "", "categoryclass": "", "imagename": "2a45258fee3defbb5c616b46c11580e8.jpg", "infoid": 1031821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这款应用是由Hello Mobile于2017年推出的，Hello Mobile是一家鲜为人知的虚拟蜂窝运营商，搭乘T-Mobile的网络。True的网站说，它已经筹集了1400万美元的种子资金，并在推出后不久就声称拥有50多万用户。\n但该应用程序其中一个数据库的仪表盘在没有密码的情况下暴露在互联网上，任何人都可以阅读、浏览和搜索数据库-包括私人用户数据。\n总部位于迪拜的网络安全公司SpiderSilk的首席安全官Mossab Hussein发现了暴露的仪表板，并向TechCrunch提供了细节。BinaryEdge是一家针对暴露的数据库和设备的搜索引擎，该公司提供的数据显示，仪表板至少从9月初就暴露了。\nTrue首席执行官布雷特·考克斯(Bret Cox)证实了安全漏洞，但没有回答我们的具体问题，包括该公司是否计划将安全漏洞告知用户，或者是否计划根据州数据泄露通知法向监管机构披露这一事件。\n该仪表板包含2月份以来的每日服务器日志，其中包括用户的注册电子邮件地址或电话号码、用户之间的私人帖子和消息的内容，以及用户最近已知的地理位置，这可以识别用户在哪里或曾经去过哪里。仪表板还暴露了用户上传的电子邮件和电话联系人，True用这些联系人与应用程序中的已知朋友进行匹配。\nTechCrunch通过创建一个测试账户并要求侯赛因提供只有我们才知道的数据，例如用于注册账户的电话号码，证实仪表板正在返回真实的用户数据。\n侯赛因说，仪表板还泄露了账户访问令牌，可以用来侵入和劫持任何用户的账户。这些账户访问令牌看起来像一行随机的字母和数字，但可以让用户登录到应用程序，而不必每次都输入他们的登录详细信息。使用我们的测试帐户，Hussein从仪表板找到了我们的访问令牌，并使用它访问了我们的帐户，并在我们的提要上发布了一条消息。\n仪表板还暴露了一次性登录码，True将其发送到帐户的相关电子邮件地址或电话号码，而不是存储密码。\nTrue说，删除一个帐户“将立即从我们的服务器上删除您的所有内容”，但删除我们的测试帐户并不会删除我们的私人消息、帖子和照片，仍然可以从仪表板中进行搜索。\n侯赛因告诉TechCrunch：“这是任何组织都可能出错的又一个例子，即使是那些以隐私为中心的组织也是如此。”“它突显了不仅要建立安全的应用程序和网站，而且要确保在其内部程序中嵌入适当的数据安全措施的重要性。”\n侯赛因还发现了一个暴露的数据库仪表盘，属于“匿名社交网络”Blind，员工们倾向于公开披露他们公司的渎职和不当行为。\n您可以使用Signal和WhatsApp安全地与作者联系：+1 646-755-8849。", "note_en": "The app was launched in 2017 by Hello Mobile, a little-known virtual cell carrier that piggybacks off T-Mobile’s network. True’s website says it has raised $14 million in seed funding, and  claimed more than half a million users shortly after its launch.\n But a dashboard for one of the app’s databases was exposed to the internet without a password, allowing anyone to read, browse and search the database — including private user data.\n Mossab Hussein, chief security officer at Dubai-based cybersecurity firm SpiderSilk, found the exposed dashboard and provided details to TechCrunch. Data provided by BinaryEdge, a search engine for exposed databases and devices, showed the dashboard was exposed since at least early September.\n   Bret Cox, chief executive at True, confirmed the security lapse but did not answer our specific questions, including if the company planned to inform users of the security lapse or if it planned to disclose the incident to regulators under state data breach notification laws.\n The dashboard contained daily server logs dating back to February, and included the user’s registered email address or phone number, the contents of private posts and messages between users, and the user’s last known geolocation, which could identify where a user was or had been. The dashboard also exposed the email and phone contacts uploaded by the user, which True uses to match with known friends in the app.\n  TechCrunch confirmed the dashboard was returning real user data by creating a test account and asking Hussein to provide data that only we would know, such as the phone number used to register the account.\n Hussein said that the dashboard was also leaking account access tokens, which could be used to hack into and hijack any user’s account. These account access tokens look like a line of random letters and numbers, but keep the user logged into the app without having to enter their login details every time. Using our test account, Hussein found our access token from the dashboard, and used it to access our account and post a message on our feed.\n The dashboard also exposed one-time login codes, which True sends to an account’s associated email address or phone number instead of storing passwords.\n True says deleting an account “will immediately remove all of your content from our servers,” but deleting our test account did not remove our private messages, posts and photos, and could still be searched from the dashboard.\n “This is another example of how mistakes can happen at any organization, even those that are privacy-centric,” Hussein told TechCrunch. “It highlights the importance of not only building secure applications and websites, but also ensuring that proper data security measures are embedded within their internal procedures.”\n  Hussein also found  an exposed database dashboard belonging to Blind, the “anonymous social network,” favored by employees to  publicly disclose malfeasance and wrongdoing at their companies.\n  You can contact the author with tips securely using Signal and WhatsApp to: +1 646-755-8849.", "posttime": "2020-10-29 09:44:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,social", "title": "\n承诺“保护你的隐私”的社交网络应用程序True暴露了私人信息和用户位置", "title_en": "\n\t\t\t\tTrue, the social networking app that promises to ‘protect your privacy,’ exposed private messages and user locations\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/true-social-app-privacy-exposed-data/", "via": "", "real_tags": ["程序", "social"]}, {"category": "", "categoryclass": "", "imagename": "d56b12f3ade3e857a79673098ddcfcfa.jpg", "infoid": 1031820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Adobe表示，这一预测也相当于一个季度两年的增长，并指出2019年的增长仅为13%。\n如果消费者接受新一轮刺激检查，全国大部分地区的实体店再次关闭，以应对进一步的冠状病毒爆发，数字可能会更高。在这种情况下，预计消费者将在网上额外消费110亿美元，使总销售额超过2000亿美元，同比增长47%。\n通常，在线购物季从黑色星期五的销售开始-这是对实体店线下销售活动的数字对应。这将影响到网购星期一的销售，因为消费者会在网上寻找当面购物时找不到特价商品的商品。\n多年来，各个销售活动之间的界限开始变得模糊。例如，网购转移到了感恩节，然后延伸到了网购星期一。\n今年，Adobe Analytics预计所谓的“网络周”(感恩节至网络星期一)将转变为“网络月”。\n这将在一定程度上受到11月前两周开始的大幅假日折扣的推动，这将是黑色星期五假期周末和网络星期一期间降价幅度最大的一次。\nAdobe Analytics还预测，从11月1日到11月21日，在线销售额每天将超过20亿美元，然后从11月22日到12月3日，将增加到每天30亿美元。\n黑色星期五的在线销售额预计将同比增长39%，达到100亿美元，而网购星期一将成为今年最大的在线购物日，销售额达到127亿美元，同比增长35%。\n电视和家电的最好交易将继续在黑色星期五，而玩具和家具最好的交易将在11月29日(星期日)到来，也就是网络星期一的前一天。Adobe表示，体育用品将在12月13日迎来最好的交易，电子产品将在12月18日迎来最好的交易。\n与前几年一样，移动设备在电子商务支出中的贡献率将越来越大，2020年美国消费者在智能手机上的支出将比2019年多281亿美元，同比增长55%。\n规模较小的零售商(每年在线收入为1000万至5000万美元)也将从增加的在线活动中受益。与收入超过10亿美元的大型零售商相比，他们的在线收入将有更大的增长(107%)，后者将增长84%。\n由于一些美国消费者今年可能不会去看望家人，与疫情爆发前的几年相比，Adobe Analytics预测，美国人在从零售商直接递送给他们原本会亲眼看到的人的礼物上的支出将增加18%。但消费者对为快速送货支付更多费用不感兴趣-64%的人表示，他们不会为更快的服务付费。这意味着零售商将需要继续就他们的免费送货截止日期进行明确的沟通。\n网购和实体店提货(BOPIS)的趋势也将激增。随着许多零售商增加路边提货选项，BOPIS的订单将比去年增加40%，并将增长到圣诞节前一周提供该选项的零售商订单的50%。\n由于这场大流行，Adobe Analytics预计所有假日顾客中将有9%是净新的在线购物者。转化率也将增加，为+13%，而收入将增加+33%。然而，平均订单价值将持平。\n可能使这些预测复杂化的一个因素是美国大选。在前几个选举年，在线销售在选举结果公布后受到影响。他们在2016年大选后第二天下跌了14%，在2018年中期选举后第二天下跌了6%。根据Adobe Analytics的数据，26%的消费者表示，选举结果将影响他们的假日支出。\n用于做出这些预测的数据来自Adobe Analytics，该公司今天分析了美国零售网站的1万亿访问量。该公司表示，这包括1亿个SKU和美国100家最大零售商中的80家。", "note_en": "The forecast is also equal to two years of growth in one season, Adobe says, noting that the increase in 2019 was just 13%.\n   If consumers receive another round of stimulus checks and physical stores are again shut down in large parts of the country to address further coronavirus outbreaks, the figures could go even higher. In that case, consumers would then be expected to spend an additional $11 billion online, bringing total sales to more than $200 billion, or a 47% year-over-year increase.\n   Typically, the online shopping season began with Black Friday sales — a digital counterpart to the offline sales events taking place in physical stores. This would then bleed into Cyber Monday sales, as consumers looked online for the items they couldn’t find deals on when shopping in person.\n  Over the years, the lines between the individual sales events began to blur. Online shopping shifted to Thanksgiving Day, for example, and then stretched past Cyber Monday.\n This year, Adobe Analytics expects the so-called “Cyber Week” (Thanksgiving through Cyber Monday) to turn into “Cyber Months.”\n  This will be driven, in part, by significant holiday discounting that begins the first two weeks of November, building up to the deepest price cuts over the Black Friday holiday weekend and Cyber Monday.\n Adobe Analytics also predicts online sales will surpass $2 billion every day from November 1 through November 21, and will then increase to $3 billion per day from November 22 through December 3.\n Black Friday online sales are projected to climb 39% year-over-year, to $10 billion, while Cyber Monday becomes the biggest online shopping day of the year, with $12.7 billion in sales, a 35% year-over-year jump.\n  The best deals for TVs and appliances will continue to be on Black Friday, while the best deals for toys and furniture will arrive on Sunday, November 29 — the day before Cyber Monday. Sporting goods will see their best deals on December 13 and electronics on December 18, Adobe says.\n As in previous years, mobile will claim an ever-larger contributor chunk of e-commerce spending, with U.S. consumers spending $28.1 billion more on their smartphones in 2020 than in 2019, a 55% year-over-year increase.\n Smaller retailers ($10 million-$50 million in annual online revenue) will also benefit from the increased online activity. They’ll see a larger (107% increase) boost to their online revenue than larger retailers with $1 billion-plus in revenue, which will see an 84% increase.\n As some U.S. consumers may not be traveling to see family this year, compared with pre-pandemic years, Adobe Analytics predicts Americans will spend 18% more on gifts that are directly delivered from the retailer to people they would have otherwise seen in person. But consumers are not interested in paying more for expedited shipping — 64% said they won’t pay for a speedier service. That means retailers will need to continue to clearly communicate about their free shipping cut-off dates.\n  The trend toward buying online and picking up in store (BOPIS) will surge, too. With the addition of curbside pickup options from many retailers, BOPIS will see 40% more orders than last year and will grow to represent 50% of all orders from retailers offering the option in the week before Christmas.\n Due to the pandemic, Adobe Analytics expects 9% of all holiday customers to be net new online shoppers. Conversion rates will increase as well, at +13%, while revenue will increase +33%. Average order value, however, will remain flat.\n  One factor that could complicate these predictions is the U.S. election. In previous election years, online sales were impacted after the outcome was known. They dropped 14% the day after the 2016 election, and 6% the day after the 2018 midterms. According to Adobe Analytics, 26% of consumers said the election’s outcome would impact their holiday spending.\n The data used to make these predictions is sourced from Adobe Analytics, which today analyzes one trillion visits to U.S. retail sites. This includes 100 million SKUs and 80 of the 100 largest retailers in the U.S., the company says.", "posttime": "2020-10-29 09:44:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,销售额,holiday", "title": "\n美国今年在线假日销售额将达到1890亿美元，比2019年增长33%", "title_en": "\n\t\t\t\tUS online holiday sales to reach $189B this year, up 33% from 2019\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/us-online-holiday-sales-to-reach-189b-this-year-up-33-from-2019/", "via": "", "real_tags": ["美国", "销售额", "holiday"]}, {"category": "", "categoryclass": "", "imagename": "39e613d48dd4e32cfb8b1bc2baacf389.jpg", "infoid": 1031819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这番言论是在公司第三季度财报电话会议上回答分析师提问时发表的，平息了曼利之前的言论助长的猖獗猜测，即这家汽车制造商计划加入一个有望成为拥挤的新类别。底特律自由新闻报(Detroit Free-Press)最先报道了这些评论。\n曼利说：“我确实看到市场上会有一款电动公羊皮卡，我会请你再关注一段时间，我们会告诉你确切的时间。”曼利没有提供更多细节。\n菲亚特克莱斯勒周三公布，第三季度营收为258亿欧元，调整后收益为22.8亿欧元，这得益于北美的强劲销售，以及该公司在今年早些时候因新冠肺炎疫情而陷入困境后重新实现盈利。\n今天的消费者已经买不到电动皮卡了。随着通用汽车(GM)和福特(Ford)等一些初创企业和传统汽车制造商开始生产电动卡车并向消费者交付，这种情况将在未来18个月内发生变化。由亚马逊(Amazon)、贝莱德(BlackRock)、考克斯汽车(Cox Automotive)和T.Rowe Price Associates Inc.支持的电动汽车制造商Rivian的目标是成为第一家将电动皮卡推向市场的公司。该公司于7月份开始在其位于伊利诺伊州Normal的工厂运营一条试点生产线，为2021年夏天将其皮卡和SUV推向市场做准备。Rivian表示，其R1T电动皮卡将于2021年6月开始交付。R1S电动SUV将于2021年8月开始交付。\n与此同时，传统汽车制造商福特(Ford)将在位于Rouge Complex的一家耗资7亿美元的新工厂生产其最畅销的F-150的电动版本。初创公司Lordstown Motors通过与特殊目的收购公司DiamondPeak Holdings Corp.的合并上市，该公司在6月份公布了一款皮卡原型。\n通用汽车和特斯拉的电动皮卡要到2022年才会上市。通用汽车在10月份公布了一款电动GMC悍马皮卡，将于2021年开始预购。GMC悍马皮卡将于2022年交付。这款外观未来主义的电动特斯拉CyberTruck于11月在加利福尼亚州霍桑的特斯拉设计中心亮相，预计要到2022年底才能投入生产。", "note_en": "The remarks, made in response to an analyst question during the company’s third-quarter earnings call, puts to rest rampant speculation, which was fueled by previous comments from Manley, that the automaker was planning to join what promises to become a crowded new category. The Detroit Free-Press was the  first to report the comments.\n “I do see that there will be an electrified Ram pickup in the marketplace, and I would ask you just to stay tuned for a little while and we’ll tell you exactly when that will be,” Manley said without providing additional details.\n  Fiat Chrysler reported Wednesday  adjusted earnings of €2.28 billion ($2.7 billion) on €25.8 billion of revenue in the third quarter, driven by strong sales in North America and putting the company back in the black after struggles earlier this year due to the COVID-19 pandemic.\n  Electric pickup trucks aren’t available to consumers today. That will change in the next 18 months as a number of startups and legacy automakers such as GM and Ford begin to produce and deliver electric trucks to consumers. Rivian, the electric automaker backed by Amazon, BlackRock, Cox Automotive and T. Rowe Price Associates Inc., is aiming to become the first to bring an EV pickup truck to market. The company started in July to run a pilot production line at its factory in Normal, Illinois, in preparation to bring its pickup truck and SUV to market in summer 2021. Rivian has said deliveries of its R1T electric pickup truck will  begin in June 2021. Deliveries of the R1S electric SUV will start in August 2021.\n Meanwhile, legacy automaker Ford is going to produce an electric version of its top-selling F-150 at a new $700 million plant at the Rouge complex. Startup Lordstown Motors, which went public through its merger with special-purpose acquisition company DiamondPeak Holdings Corp.,  revealed a pickup truck prototype in June.\n Electric pickups from GM and Tesla won’t arrive until 2022. GM revealed in October an electric GMC Hummer pickup truck that will be available for pre-ordering in 2021. The GMC Hummer pickup will be available for delivery in 2022. The futuristic-looking electric Tesla Cybertruck, which was  unveiled in November at the Tesla Design Center in Hawthorne, California, isn’t expected to go into production until late 2022.", "posttime": "2020-10-29 09:44:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电动,chrysler", "title": "\n菲亚特克莱斯勒计划将一款公羊电动皮卡推向市场", "title_en": "\n\t\t\t\tFiat Chrysler plans to bring a Ram electric pickup truck to market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/fiat-chrysler-plans-to-bring-an-ram-electric-pickup-truck-to-market/", "via": "", "real_tags": ["电动", "chrysler"]}, {"category": "", "categoryclass": "", "imagename": "4b0d9a1354bde52099a912d9a0e55ae9.jpg", "infoid": 1031817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据英国“金融时报”报道，苹果对搜索技术的兴趣与日俱增，甚至可能正在研发一款与谷歌竞争的产品。\n最明显的变化是，在iOS14中，当你在主屏幕上输入查询时，苹果现在会显示自己的结果。此外，苹果网络爬虫的活跃度似乎有所增加。\n这里可能有更多的机会，因为美国司法部已经起诉谷歌，称其在搜索领域存在反竞争行为。然而，这并不一定意味着苹果和谷歌很快就会在搜索领域正面交锋--这可能只是苹果Siri语音助手收到更多搜索请求的迹象。\n乔·罗根(Joe Rogan)、亚历克斯·琼斯(Alex Jones)和Spotify的中立幻想-Spotify在乔·罗根(Joe Rogan)将InfoWars的亚历克斯·琼斯(Alex Jones)请到他的节目后面临批评。\n苹果通过更新版本的剪辑关注TikTok一代-更新带来了急需的垂直视频支持，允许分享到TikTok和其他社交应用的“故事”功能。\n品牌安全、广告欺诈和广告质量方面的专家DoubleVerify筹集了3.5亿美元-DoubleVerify的技术可以检测欺诈、可看性和品牌安全。\nOtrider筹集了6500万美元，将其自动技术引入配送场地-这家初创公司已经建立了一个由三部分组成的系统，其中包括一辆自动电动堆场卡车、管理运营的软件和场地基础设施。\n午餐盒筹集了2000万美元，帮助餐厅建立自己的点餐体验-首席执行官纳贝尔·阿拉姆吉尔(Nabeel Alamgir)表示，如果餐厅能够自己处理更多的在线订单(而不仅仅是依赖送货应用)，他们将赚更多的钱，同时还能与最忠实的顾客保持直接关系。\n随着风险资本的反弹，风险债务的情况如何？-尽管风险资本重新创下新的纪录，但其鲜为人知的兄弟企业似乎无法与过去几年的业绩相提并论。\n拉丁美洲移动增长的当前和即将到来的趋势-拉丁美洲是世界上增长最快的移动市场之一。\n亲爱的索菲：对于有兴趣换工作的E-2签证持有者，有什么升级选择吗？-这是另一版索菲·阿尔科恩的专栏，回答了关于在科技公司工作的移民问题。\n(提醒：Extra Crunch是我们的会员计划，旨在使初创企业的信息民主化。您可以在这里注册。)。\n高通首席执行官莱恩·史密斯正在以16亿美元收购犹他爵士的多数股权--史密斯在2018年以80亿美元的价格将高通出售给思爱普。\n根据Adobe Analytics的一项新预测，今年美国在线假日销售额将达到1890亿美元，比2019年增长33%。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Apple has a growing interest in search technology and might even be working on a product to compete with Google,  according to The Financial Times.\n  The most visible change is the fact that in iOS 14, Apple is now showing its own results when you type queries in the home screen. In addition, there seems to be an increase in activity from Apple’s web crawler.\n There may be more of an opportunity here as the  U.S. Justice Department has sued Google over what it claims are anticompetitive behaviors around search. However, this doesn’t necessarily mean Apple and Google will soon be going head-to-head in search — it could just be a sign that Apple’s Siri voice assistant is getting more search queries.\n  Joe Rogan, Alex Jones and Spotify’s illusion of neutrality — Spotify is facing criticism after Joe Rogan brought Alex Jones of InfoWars onto his show.\n  Apple eyes the TikTok generation with an updated version of Clips — The update brings much-needed support for vertical videos, allowing for sharing to TikTok and the “Stories” feature in other social apps.\n  DoubleVerify, a specialist in brand safety, ad fraud and ad quality, raises $350M — DoubleVerify’s technology can detect fraud, viewability and brand safety.\n Outrider raises $65M to bring its autonomous tech to distribution yards — The startup has built a three-part system that includes an autonomous electric yard truck, software to manage the operations and site infrastructure.\n Lunchbox raises $20M to help restaurants build their own ordering experiences — CEO Nabeel Alamgir said that if restaurants can handle more online orders themselves (rather than just relying on delivery apps), they’ll make more money while also maintaining a direct relationship with their most loyal customers.\n  As venture capital rebounds, what’s going on with venture debt? — While venture capital is back setting new records, it appears that its lesser-known sibling won’t be able to match the past few years’ results.\n Current and upcoming trends in Latin America’s mobile growth — Latin America is home to one of the fastest-growing mobile markets in the world.\n Dear Sophie: Any upgrade options for E-2 visa holders interested in changing jobs? — Another edition of Sophie Alcorn’s column answering immigration questions about working at technology companies.\n (Reminder: Extra Crunch is our membership program, which aims to democratize information about startups.  You can sign up here.)\n  Qualtrics CEO Ryan Smith is buying majority stake in the Utah Jazz for $1.6B — Smith sold Qualtrics to SAP for $8 billion in 2018.\n US online holiday sales to reach $189B this year, up 33% from 2019 — That’s according to a new forecast from Adobe Analytics.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-10-29 09:43:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,crunch", "title": "\nDaily Crunch：苹果似乎对搜索很感兴趣", "title_en": "\n\t\t\t\tDaily Crunch: Apple seems pretty interested in search\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/daily-crunch-apple-search/", "via": "", "real_tags": ["apple", "苹果", "crunch"]}, {"category": "", "categoryclass": "", "imagename": "04d2ae25302b895bf14267da287b55a1.jpg", "infoid": 1031816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "搭载着离开地球的最新电子运载火箭的是Planet公司的九颗“超级鸽子”卫星，这是新一代的观测飞船，使该公司能够提供越来越大比例的表面的频繁更新的图像。\n佳能的CE-SAT-IIB是一个演示飞船，展示了“一个装有超高灵敏度相机的中型望远镜，可以拍摄地球的夜间图像”，还有一些较小的望远镜，用于更普通的观察。与星球共乘是由搭乘发射专家太空飞行组织的。\n发射原定于上周进行，但当时被搁置，因为“一些传感器正在返回我们想要进一步调查的数据。”幸运的是，后备发射日期并不短缺，而且定在今天进行新的尝试。\n一切都在名义上进行，卫星已经在路上，起飞大约一小时后就可以到达。\n这是自火箭实验室在7月份失去有效载荷后短暂停飞以来的第二次发射-不是因为任何闪耀的爆炸，而是因为在它可以到达预期的轨道之前，由于电气故障而相当优雅地关闭了。\n幸运的是，该公司的快速调查意味着他们在不到一个月后就准备好了飞行。\n顺便说一句，所有这些和更多的东西都将在12月份的TC Sessions：Space 2020上讨论，火箭实验室的创始人兼首席执行官彼得·贝克(Peter Beck)将加入我们的行列。", "note_en": "Aboard the latest Electron launch vehicle to leave the Earth were nine of  Planet’s   “SuperDove” satellites, the newer generation of observation craft that allow that company to provide frequently updated imagery of an increasingly large proportion of the surface.\n Canon’s   CE-SAT-IIB is a demonstration craft, showing off “a middle-size telescope  equipped with an ultra-high sensitivity camera to take night images of the Earth,” along with some smaller ones for more ordinary observation. The rideshare with Planet was organized by launch rideshare specialists Spaceflight.\n  The launch was originally scheduled for last week but stood down at the time because “ some sensors are returning data that we want to look into further.” Fortunately there was no shortage of backup launch dates, and today was set for the new attempt.\n Everything proceeded nominally and the satellites were on their way and able to be reached about an hour after takeoff.\n  This is the second launch since Rocket Lab was briefly grounded following the loss of a payload in July — not to any flashy explosion but to a rather graceful shutdown due to an electrical fault before it could reach the desired orbit.\n  Fortunately the company’s quick investigation meant they were ready to fly less than a month later.\n Incidentally, all that and more will be on the table for discussion at  TC Sessions: Space 2020 in December, where Rocket Lab founder and CEO Peter Beck will be joining us.", "posttime": "2020-10-29 09:43:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,火箭,observation", "title": "\n火箭实验室第15次商业任务成功发射10颗对地观测卫星", "title_en": "\n\t\t\t\tRocket Lab successfully launches 10 Earth observation satellites in 15th commercial mission\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/rocket-lab-successfully-launches-10-earth-observation-satellites-in-15th-commercial-mission/", "via": "", "real_tags": ["商业", "火箭"]}, {"category": "", "categoryclass": "", "imagename": "3fc79dcdcce079318da7a0a10eb6da1f.jpg", "infoid": 1031814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一年多来，该公司一直在谈论生产一种电动运输面包车。福特在2019年4月宣布，计划在2021年之前向欧洲市场销售一款全新的全电动运输系统。然后在今年春天，福特表示，从2022年车型年开始，它还将为北美市场生产和销售全电动版本的货运面包车。\n电动运输货车是福特到2022年在电气化方面投资超过115亿美元的一部分，更具体地说，这是一项追逐商业客户的战略。\n将商用面包车纳入其电动汽车战略的决定与北美的销售和该公司对未来增长的展望有关。运输面包车和福特F-150是我们行业最重要、销量最大的两款商用车，首席执行官吉姆·法利(Jim Farley)周三在与分析师举行的财报电话会议上表示。\n他说：“我们在福特拥有‘工作’，这些电动汽车将是真正的工作车辆，非常有能力，具有独特的数字服务和空中能力，以提高我们重要商业客户的生产率和正常运行时间。”“我们相信，全电动商用面包车和皮卡--两个最大的可寻址利润池和商用皮卡--的潜在市场将是巨大的，我们将直接抓住这个机会。”\n这一声明被塞进了公司第三季度的收益中，这超出了华尔街的预期。福特周三公布，营收为375亿美元，净利润为24亿美元。福特表示，预计2020年全年调整后息税前利润(EBITDA)为正，扭转了此前提供的黯淡前景。", "note_en": "The company has been talking about producing an electric Transit van for more than a year now. Ford announced in April 2019 plans to sell an  all-electric Transit for the European market by 2021. Then this spring, Ford said it would also produce and sell an all-electric version of the cargo van for the North American market starting with the 2022 model year.\n The electric Transit cargo van is part of Ford’s more than $11.5 billion investment in electrification through 2022, and more specifically, a strategy to go after commercial customers.\n  The decision to include commercial vans in its EV strategy is linked to sales in North America and the company’s outlook on future growth. The Transit van and the Ford F-150 are the two most important,  highest volume commercial vehicles in our industry, CEO Jim Farley said during an earnings call Wednesday with analysts.\n “We own ‘work’ at Ford and these electric vehicles will be true work vehicles, extremely capable and with unique digital services and over-the-air capabilities to improve the productivity and uptime of our important commercial customers,” he said. “W e believe the addressable market for a fully electric commercial van and pickup — the two largest addressable profit pools and commercial — are going to be massive and we’re going straight at this opportunity.”\n  The announcement was tucked inside the company’s third-quarter earnings, which crushed Wall Street expectations. Ford reported Wednesday net income of $2.4 billion on $37.5 billion in revenue. Ford said it expects a positive full year 2020 adjusted earnings before interest and taxes, reversing a dimmer outlook it had previously provided.", "posttime": "2020-10-29 09:43:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,运输,reveal", "title": "\n福特将在11月展示其全电动运输面包车", "title_en": "\n\t\t\t\tFord will reveal its all-electric Transit van in November\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/28/ford-will-reveal-its-all-electric-transit-van-in-november/", "via": "", "real_tags": ["福特", "运输", "reveal"]}]