[{"category": "", "categoryclass": "", "imagename": "6164c4993bd86fc13540748cb722bd4e.png", "infoid": 1068675, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Keyboardio正在为Kickstarter提供键盘型号100的资金！ 一个键盘，就像你一样 ", "note_en": "Keyboardio is raising funds for The Keyboardio Model 100 on Kickstarter!  A keyboard that works the way you do", "posttime": "2021-06-30 01:37:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "键盘,keyboardio", "title": "键盘型号100 ", "title_en": "The Keyboardio Model 100", "transed": 1, "url": "https://www.kickstarter.com/projects/keyboardio/model-100", "via": "", "real_tags": ["键盘"]}, {"category": "", "categoryclass": "", "imagename": "40c7c3aacde1ba6d5a3e44a562c58935.jpg", "infoid": 1068674, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个新的报告发现，社交网络仍然无法解决关于Covid-19的在线错误信息传播。\n  来自全球公民组织Avaaz的初步研究表明Facebook，Instagram，Twitter和YouTube并未阻止在大流行期间共享虚假谣言。\n 自全球卫生危机开始以来，所有平台都承诺有关冠状病毒的可靠信息在其平台上共享。\n   但随着欧洲面临着可能的第三波感染，Avaaz说＆＃34;没有＆＃34;大科技公司正在有效地遏制Covid-19的蔓延。\n ＆＃34;它的疲惫不堪，但是，没有一个技术平台，遏制污染他们平台的有毒谎言，＆＃34;卢卡·尼科特拉说，Avaaz竞选总监。\n 世界卫生组织（WHO）先前已经警告过Covid-19＆＃34; infodemast＆＃34;这威胁要破坏对健康危机的全球反应。\n Avaaz呼吁社交网络和欧盟，以类似的方式解决Covid-19错误信息，以与气候变化类似。 \n＆＃34;我们迫切需要一个＆＃39;巴黎的不诚实协议＆＃39;，＆＃34;尼科特拉说，＆＃34;但这要求大型技术平台同意具有有意义承诺和可衡量行动的强大实践准则。＆＃34;\n  欧洲委员会的副总裁VõraJourová支持来自Avaaz的电话。\n ＆＃34;我们必须有工具可以惩罚参与的人可以被证明[传播不现实]，＆＃34; Jourova周四推文。\n Eurolews联系了Facebook  - 它也拥有Instagram  -  Twitter和YouTube＆＃39;谷歌的父母公司，以回复该研究。\n   在他们的研究中，Avaaz发现了240件关于Covid-19的事实检查的错误信息，它正在Facebook，Instagram，Twitter和YouTube上传播。\n 据报道，此内容已被人喜欢，共享，并评论超过280万次。\n ＆＃34;大四科技平台未能在本研究中研究的37％的Covid-19 Disinformation含量样本行事，＃34; Avaaz补充道。 \n总体而言，Youtube被认为是Avaaz表示，您是最糟糕的社交网络，即在该研究分析的youtube上超过92％的误差中没有采取行动。\n Twitter也令人沮丧，未能解决AVAAZ发现的74％的Covid-19 Falsities，而Facebook（27％）和Instagram（7％）也忽略了一些错误信息。\n   视频共享平台表示，此前表示它禁止了关于提出A＆＃34的冠状病毒的内容;严重危害危害的风险＆＃34;或者由世卫组织和当地卫生当局提供的矛盾的医疗信息。\n ＆＃34; Youtube在平台上有禁止有害和误导医疗或健康相关内容的长期政策，＆＃34;发言人告诉欧洲武贸州。\n ＆＃34;我们继续迅速采取行动，以更新与Covid-19相关的政策，以更好地满足我们在YouTube上看到的挑战。除了去除违规内容外，我们还提出了权威信息，为用户提供了额外的上下文。＆＃34;\n Avaaz指出，事实上检查视频是＆＃34;更困难＆＃34;而不是acce-checking的书面帖子或图像，但是Youtube已经有了＆＃34;充足的时间＆＃34;找到解决方案。\n Youtube表示，他们的团队已经删除了超过90万个视频与＆＃34相关的视频;危险或误导性的Covid-19医疗信息。＆＃34; \nFacebook还表示，它分享了＆＃34的目标;减少了误导的传播＆＃34;，并批评了新的研究。\n ＆＃34; Avaaz的分析没有考虑到我们从Facebook和Instagram中删除的超过1800万件内容，以违反我们的Covid-19以来自大流行开始以来的疫苗错误信息政策;一家公司发言人表示。\n ＆＃34;我们还标有我们的事实网络检查合作伙伴的1.67亿件Covid-19内容额定假。＆＃34;\n ＆＃34;没有像我们这样的节目的玩具书，我们不断努力改进它，＆＃34;发言人补充道。\n Avaaz＆＃39;研究发现，Facebook上的Covid-19错误信息已收到比任何其他平台更有互动。\n   以前为他们的算法引用了社交网络，推荐给用户的新内容和主题，并旨在将它们保留在平台上。\n 以前的研究表明，这些算法还推动了社交媒体用户，旨在纳入含有危险的阴谋理论和错误信息的内容。 \n但Avaaz的报告还发现，科技公司没有以不同语言同样地解决错误信息。  报告称，未采取近一半（49％）的事实上检查的MISINOMAGANGS以主要的非英式欧式语言的误导内容。  Avaaz说，这与英语相比，只有29％的Covid-19错误信息没有解决。  本集团表示，大多数关于意大利人（84％）和葡萄牙语（62％）的Covid-19的错误信息尚未采取行动。  与此同时，西班牙语和德国发言人在线最受保护，分别缺乏缺乏20％和21％的错误内容的措施。  Twitter表示，在欧洲欧元的声明中，他们正在加快他们全球努力去除Covid-19错误信息。  ＆＃34;尽可能通过可靠，权威的健康信息，在推特上很容易访问，这是我们在全球大流行的中间的优先级，＆＃34; 一家公司发言人表示。 \n＆＃34;自Covid-19开始以来，我们已经扩大并提高了我们对这些努力的投资。 我们已经删除了超过22,400名推文，并挑战全球1170万个帐户。＆＃34;  Avaaz还指出，Twitter和YouTube的偏好是消除错误信息，而不是标记它，可能会成为言语自由的风险。 ", "note_en": "Social networks are still failing to tackle the spread of online misinformation about COVID-19, a new report has found.\n  Preliminary research from global civic organisation Avaaz suggests that Facebook, Instagram, Twitter, and YouTube have not prevented the sharing of false rumours during the pandemic.\n Since the start of the global health crisis, all platforms have pledged that reliable information about the coronavirus is shared on their platforms.\n   But as Europe faces a possible third wave of infections, Avaaz says that &#34;none&#34; of the big tech companies are effectively curbing the spread of COVID-19 disinformation.\n &#34;It&#39;s exhausting to keep saying this, but none of the tech platforms are doing enough to curb the toxic lies polluting their platforms,&#34; said Luca Nicotra, Campaign Director at Avaaz.\n The World Health Organization (WHO) has previously warned about a COVID-19 &#34;infodemic&#34; that threatens to undermine the global response to the health crisis.\n Avaaz has called on social networks, and the European Union, to tackle COVID-19 misinformation in a similar way to climate change.\n  &#34;We urgently need a &#39;Paris Agreement for Disinformation&#39;,&#34; said Nicotra, &#34;but that requires the Big Tech platforms to agree on a strong Code of Practice that has meaningful commitments and measurable action.&#34;\n  Věra Jourová, the European Commission&#39;s Vice-President for Values and Transparency, has supported the calls from Avaaz.\n &#34;We must have tools to punish those whose involvement can be proven [of spreading disinformation],&#34; Jourova tweeted on Thursday.\n Euronews has contacted Facebook -- which also owns Instagram -- Twitter, and YouTube&#39;s parent company Google for a response to the study.\n   In their study, Avaaz found 240 pieces of fact-checked misinformation about COVID-19 that were spreading on Facebook, Instagram, Twitter, and Youtube.\n This content had reportedly been liked, shared, and commented on more than 2.8 million times.\n &#34;The big four tech platforms are failing to act on 37% of the COVID-19 disinformation content sample studied in this research,&#34; Avaaz added.\n Overall, YouTube was found to be the worst social network for acting on COVID-19 misinformation, Avaaz said, where over 92% of the misinformation on YouTube analysed by the study had not been acted on.\n Twitter also fared poorly, failing to tackle 74% of the COVID-19 falsities found by Avaaz, while Facebook (27%) and Instagram (7%) had also neglected to remove some misinformation.\n   The video-sharing platform said previously stated that it banned content about the coronavirus that posed a &#34;serious risk of egregious harm&#34; or contradicted medical information given by the WHO and local health authorities.\n &#34;YouTube has long-standing policies prohibiting harmful and misleading medical or health-related content on the platform,&#34; a spokesperson told Euronews.\n &#34;We have continued to act quickly to update our policies related to COVID-19 to better meet the challenges we are seeing on YouTube. In addition to removing violative content, we raise up authoritative information to provide users with additional context.&#34;\n Avaaz noted that fact-checking videos is &#34;more difficult&#34; than fact-checking written posts or images, but said YouTube had had &#34;ample time&#34; to find a solution.\n YouTube said their teams had removed more than 900,000 videos related to &#34;dangerous or misleading COVID-19 medical information.&#34;\n   Facebook has also stated that it shares the goal of &#34;reducing the spread of misinformation&#34;, and has criticised the new study.\n &#34;Avaaz’s analysis does not take into account the more than 18 million pieces of content that we’ve removed from Facebook and Instagram for violating our COVID-19 and vaccine misinformation policies since the beginning of the pandemic,&#34; said a company spokesperson.\n &#34;We’ve also labeled more than 167 million pieces of COVID-19 content rated false by our network of fact checking partners.&#34;\n &#34;There is no playbook for a program like ours and we’re constantly working to improve it,&#34; the spokesperson added.\n Avaaz&#39;s study found that COVID-19 misinformation on Facebook had received more interactions than on any other platform.\n   Social networks have previously been cited for their algorithms, which recommend new content and topics to users and aim to keep them on the platforms.\n Previous studies have said that these algorithms also push social media users towards content containing dangerous conspiracy theories and misinformation.\n But the report by Avaaz has also found that tech companies are not tackling misinformation equally in different languages.\n Nearly half (49%) of fact-checked misinformation content in major non-English European languages is not acted upon, the report claimed.\n That compares to English, where only 29% of COVID-19 misinformation is not tackled, Avaaz said.\n  The group said that most of the misinformation spreading about COVID-19 in Italian (84%) and Portuguese (62%) had not been actioned.\n Meanwhile, Spanish and German speakers were most protected online with measures lacking for only 20% and 21% of false content, respectively.\n In a statement to Euronews, Twitter said that they were accelerating their worldwide efforts to remove COVID-19 misinformation.\n &#34;Making certain that reliable, authoritative health information is easily accessible on Twitter has been a priority long before we were in the midst of a global pandemic,&#34; said a company spokesperson.\n &#34;Since the beginning of COVID-19, we’ve expanded and increased our investment in those efforts. We’ve removed more than 22,400 Tweets and challenged 11.7 million accounts worldwide.&#34;\n Avaaz also noted that the preference of Twitter and Youtube to remove misinformation, rather than label it, could become a risk to freedom of speech.", "posttime": "2021-06-30 01:36:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "巴黎,paris,avaaz", "title": "“我们迫切需要”巴黎的诽谤协议“” ", "title_en": "“We urgently need a 'Paris Agreement for Disinformation' “", "transed": 1, "url": "https://www.euronews.com/2021/06/24/social-networks-still-failing-to-tackle-covid-19-misinformation-report-claims", "via": "", "real_tags": ["巴黎", "paris", "avaaz"]}, {"category": "", "categoryclass": "", "imagename": "9c2eec3d8fa75e7979ed5d98ceb85036.png", "infoid": 1068673, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个裸骨树震动码域，其可以适用于定位特定用例。  （我制作了这个cosi＆＃39; m编写一个单独的codemod进行迁移i＆＃39; m工作。迁移删除了一堆随机助手函数 - 现在eslint抱怨，我需要删除。因此 这棵树震动了codemod。）  现有的解决方案非常花哨的裤子，并尝试瞄准一切，并要求复杂的设置。 我只想将一个众所周知的东西瞄准树木摇晃。 （alletlist与校舍）。  尽可能小（仍然是＆＃34;正确的＆＃34;这赢了你使用的东西，但可能不会摆脱你不使用的一切。）  这并不是＆＃39;我刚刚摇晃着一切（对不起！），但获得大部分常见情况（即，足以在针对特定的事情时使用） ", "note_en": "This is a bare-bones tree shaking codemod that can be adapted for targeting specific use cases.\n (I made this cos i&#39;m writing a seperate codemod for a migration I&#39;m working on. The migration removes callsites to a bunch of random helper functions - which now eslint complains about, and I need to remove. Hence this tree shaking codemod.)\n Existing solutions are very fancy pants and try and target everything and require complex setups. I want to only target a known setof things to tree shake away. (allowlist vs denylist).\n  small as possible (while still being &#34;correct&#34;. This won&#39;t shake away things you use, but may not shake away everything you don&#39;t use.)\n  This doesn&#39;t shake  everything away just yet (sorry!), but gets most of the common cases (i.e. enough to be used when targeting a specific thing)", "posttime": "2021-06-30 01:36:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,javascript,java,treeshaker,瞄准", "title": "微小的沿reeshaker：javascript树在200行代码中摇晃 ", "title_en": "Tiny Treeshaker: JavaScript tree shaking in 200 lines of code", "transed": 1, "url": "https://github.com/magicmark/tiny-treeshaker", "via": "", "real_tags": ["代码", "java", "瞄准"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068672, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spacetime改变冲击波来自巨大的中子恒星坠入黑洞数百万年前\n    当生活作为天体物理学家的时刻就像在巴士站闲逛一样。你等待一个灾难性的宇宙活动，以通过时空的织物送冲击波，然后两次跳一次。\n 科学家开始以艾伯特爱因斯坦预期的时空搜寻措施后，美国和欧洲的引力波探测器已经检测到两个中子恒星的第一个信号撞到了数亿光年的黑洞。\n   “我们正在谈论比已经吞噬的太阳更大的物质，”卡迪夫大学的重力勘探学院弗里安·雷蒙德博士说。 “我们希望中子恒星被撕裂和切碎，因为那么有很多机会有趣的物理，但我们认为这些黑洞足够大，以至于他们吞下了中子恒星的整体。”\n 由美国激光干涉仪重力波天文台（Ligo）的第一个碰撞，被称为GW200105的碰撞，以2020年1月5日记录的数据。事件释放的引力波提示，由于阳光落入黑洞，所以中子星两次大幅涌入黑洞比太阳更大九倍。以光速移动，这些引力波，在宇宙中竞争时挤压和拉伸时空，将达到900米的时间才能到达地球。\n  十天之后，意大利的Ligo和处女座重力波检测器记录了第二个不同的信号，命名为GW200115，当中子星比太阳撞入黑洞的中子星50％，比太阳更大的速度更大。该事件甚至比第1BN光年的第一个更远。详情发布在天体物理期刊字母中。\n 当恒星到达他们的生活结束时，黑洞和中子恒星是留下的东西，在他们自己的重力下崩溃。在某些情况下，他们诞生为一对，在二进制星系中，其中一个星轨道另一个星星。中子恒星是已知宇宙中最具异国情调的物品之一。测量20英里的宽，它们具有外壳和晶体核心。它们是如此密集，即一茶匙中子明星的重量和珠穆朗玛峰一样多。 \n引力波一直穿过地球，但时刻的颤抖太微妙地检测，除非它们被极度大量物体之间的碰撞触发。 科学家们报道了2016年从两个黑洞的碰撞中的重力波的首次检测，并且已经从中子星兼并的斑点波。 从中子恒星录制重力波首先击中黑洞。  “通过这些活动，我们已经完成了黑洞和中子恒星中可能的合并的图片，”伊利诺伊州西北大学的研究生蔡斯金博说。 “这并不意味着没有引用波浪没有新发现。 在那里有很多预期的引力波来源，我们尚未发现，从迅速旋转中子恒星从迅速旋转中的中子恒星突出，我相信宇宙可以让我们惊喜的方法。“ ", "note_en": "Spacetime-altering shock waves came from massive neutron stars crashing into black holes millions of years ago\n    There are moments when life as an astrophysicist is like hanging around at the bus stop. You wait ages for a cataclysmic cosmic event to send shock waves through the fabric of spacetime and then two come along at once.\n Years after scientists began their search for quivers in spacetime anticipated by  Albert Einstein, gravitational wave detectors in the US and Europe have detected the first signals from two neutron stars crashing into black holes hundreds of millions of light years away.\n   “We are talking about objects that have more mass than the sun that have been gobbled up,” said Dr Vivien Raymond at Cardiff University’s  Gravity Exploration Institute. “We would like for the neutron stars to be ripped apart and shredded because then there’s a lot of opportunity for interesting physics, but we think these black holes were big enough that they swallowed the neutron stars whole.”\n The first collision, called GW200105, was spotted in data recorded on 5 January 2020 by the US Laser Interferometer Gravitational-Wave Observatory (Ligo). Gravitational waves unleashed by the event suggest that a neutron star twice as massive as the sun fell into a black hole nine times more massive than the sun. Moving at the speed of light, these gravitational waves, which squeeze and stretch spacetime as they race across the universe, would have taken 900m years to reach Earth.\n  Ten days later, Ligo and the Virgo gravitational wave detector in Italy recorded a second distinct signal, named GW200115, that was produced when a neutron star 50% more massive than the sun crashed into a black hole six times more massive than the sun. The event was even more distant than the first at 1bn light years away. Details are published in  The Astrophysical Journal Letters.\n Black holes and neutrons stars are what is left behind when stars reach the end of their lives and collapse under their own gravity. In some cases they are born as a pair, in binary star systems where one star orbits another. Neutron stars are among the most exotic objects in the known universe. Measuring 20 miles wide they have crusts and crystalline cores. They are so dense that a teaspoon of neutron star weighs as much as Mount Everest.\n  Gravitational waves pass through Earth all the time, but the shudders in spacetime are too subtle to detect unless they are triggered by collisions between extremely massive objects. Scientists reported the  first detection of gravitational waves from the collision of two black holes in 2016 and have since spotted waves from  neutron star mergers. Recording gravitational waves from neutron stars hitting black holes marks another first.\n “With these events, we’ve completed the picture of possible mergers amongst black holes and neutron stars,” said Chase Kimball, a graduate student at Northwestern University in Illinois. “That doesn’t mean that there are no new discoveries to be made with gravitational waves. There are plenty of expected gravitational wave sources out there that we’ve yet to detect, from continuous waves from rapidly rotating neutron stars to bursts from nearby supernovae, and I’m sure the universe can find ways to surprise us.”", "posttime": "2021-06-30 01:36:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "星形,waves,黑洞", "title": "从地球上检测到的星形黑洞的引力波 ", "title_en": "Gravitational waves from star-eating black holes detected on Earth", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/29/gravitational-waves-from-star-eating-black-holes-detected-on-earth", "via": "", "real_tags": ["星形", "waves", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "a27ab0c126d9518cb35c8759cf288cd8.png", "infoid": 1068671, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索尼宣布它已在Housemarque＆＃39; S往返于年轻PlayStation 5控制台上的最高型材专用之一后获得了芬兰独立开发人员房马马马塔克。 Housemarque历史悠久地与索尼控制台，追溯到2007年和＃39; Super Stardust HD上的Super Stardust HD，并通过PS4推出突出突发resogun运行。 Housemarque也是2017 PS4双棒射击射线Nex Machina的工作室，ars＆＃39; Sam Machovech当时在他的年度比赛中致敬。在一个非索尼控制台上的最后一个高等优惠的游戏是2008年＆＃39; s的小记忆高尔夫：它在Xbox 360上发了推送。＆＃34;它很难想象一个没有来自拥有优惠品的游戏机平台，＆＃34; PlayStation Studios负责人Hermen Hulst在与华盛顿邮报采访中说。 ＆＃34;他们创造的游戏与我们所拥有的一切都如此不同，所以我喜欢我们能提供的经验的多样性。＆＃34;\n 还与华盛顿邮报，Housemarque联合创始人和董事总经理Ilari Kuittinen表示，索尼在谈判之前也在谈判时收购工作室。 Kuittinen还表示，索尼向小团队提供了援助，该团队开发了代理人，这为以前为更简单的街机射击者闻名的工作室的工作室代表了3D勘探和高端生产价值。\n    赫斯特说，鉴于收购，符合收购，但＆＃34显然，他们将希望扩展其大约80人的工作室;显然他们不会成为一个巨大的500人团队 - 这不是目标。＆＃34;索尼没有披露在购买时购买的金额。\n 索尼＆＃39;最后一个主要的博彩收购是2019年购买蜘蛛侠开发商失眠症2.29亿美元。同时，微软，最近在贝塞斯达软工上花了数十亿岁才能在Scooping Speconauts 2 Studio Double Fine和其他几个独立工作室，包括亡灵实验室（腐烂状态），游乐场（Forza Horizo​​ n），忍者理论（Hellblade），和强制游戏（我们很高兴）。\n 霍尔特说，他对英国GQ说道，他并没有看到索尼参与An＆＃34;军备赛＆＃34;两个控制台制造商尽可能多地保护多个独家工作室。 ＆＃34;我们＆＃39;对我们带来的开发人员来说，＆＃39非常有选择。他说。 ＆＃34;我总是在寻找具有类似一套价值观，类似的创造性野心的人，与我们的团队一起工作，我们可以进一步投资并帮助成为创造者的团队。它＆＃39;不喜欢我们＆＃39;重新解决，只是做随机收购。他们非常非常有针对性的团队获得我们所知的团队。＆＃34;\n ＆＃34;随着[索尼]的支持及其支持我们的工作室系列，我们可以真正成长到业内人士中，并展示了软房，没有限制，＆＃34; Kuittinen在宣布收购的博客文章中写道。 ＆＃34;我们迫不及待地想向大家展示即将到来的几年将在商店中，我们希望迎来更持久的回忆和下一个四分之一世纪和超越的令人振奋的标题。＆＃34; ", "note_en": "Sony has  announced that it has acquired Finnish indie developer Housemarque just two months after  the launch of Housemarque&#39;s  Returnal as one of the highest-profile exclusives on the young PlayStation 5 console.  Housemarque has a long history with Sony consoles, dating back to 2007&#39;s   Super Stardust HD on the then-new PlayStation 3 and running through  PS4 launch standout  Resogun. Housemarque is also the studio behind the 2017 PS4 twin-stick shooter  Nex Machina, which Ars&#39; Sam Machkovech  gave an honorable mention in his Games of the Year list at the time. The last Housemarque game on a non-Sony console was 2008&#39;s little-remembered  Golf: Tee it Up on the Xbox 360. &#34;It’s pretty hard to imagine a launch of a PlayStation platform without there being something from Housemarque,&#34; Hermen Hulst, the head of PlayStation Studios, said in  an interview with The Washington Post. &#34;The games they create are just so different from everything else we’ve got, so I love the diversity of the experiences that we’re able to offer.&#34;\n Also speaking to The Washington Post, Housemarque co-founder and Managing Director Ilari Kuittinen said Sony was in talks to acquire the studio even before  Returnal was released. Kuittinen also said that Sony offered assistance to the small team developing  Returnal, which represented a turn toward 3D exploration and high-end production values for a studio previously known for simpler arcade shooters.\n    Hulst said Housemarque will be looking to expand its approximately 80-person studio in light of the acquisition but that &#34;obviously they’re not going to be a giant 500-man team—that’s not the goal.&#34; Sony is not disclosing the amount spent on the Housemarque purchase.\n Sony&#39;s last major gaming acquisition was the  2019 $229 million purchase of  Spider-Man developer Insomniac. Microsoft, meanwhile, recently  spent billions on Bethesda Softworks a few years after  scooping up  Psychonauts 2 studio Double Fine and  several other indie studios, including Undead Labs ( State of Decay), Playground Games ( Forza Horizon), Ninja Theory ( Hellblade), and Compulsion Games ( We Happy Few).\n Speaking to British GQ, Hulst said he doesn&#39;t see Sony engaging in an &#34;arms race&#34; where both console-makers try to secure as many exclusive studios as possible. &#34;We&#39;re very selective about the developers that we bring in,&#34; he said. &#34;I&#39;m always looking for people that have a similar set of values, similar creative ambitions, and work very well with our team that we can further invest in and help grow as creators. It&#39;s not like we&#39;re going around and just making random acquisitions. They’re very, very targeted acquisitions of teams that we know well.&#34;\n &#34;With the backing of [Sony] and its family of studios supporting us, we can truly grow into our place in the industry and show what Housemarque can create with no limitations,&#34; Kuittinen  wrote in a blog post announcing the acquisition. &#34;We can’t wait to show everyone what will be in store in the upcoming years, and we hope to usher in more lasting memories and exhilarating titles for the next quarter century and beyond.&#34;", "posttime": "2021-06-30 00:54:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,购买,purchases,工作室", "title": "在成功的PS5首次亮相之后，索尼购买了往返开发人员高等教室 ", "title_en": "Sony purchases Returnal developer Housemarque after successful PS5 debut", "transed": 1, "url": "https://arstechnica.com/gaming/2021/06/sony-purchases-returnal-developer-housemarque-after-successful-ps5-debut/", "via": "", "real_tags": ["开发", "购买", "purchases", "工作室"]}]