[{"category": "", "categoryclass": "", "imagename": "a82f25a1c31ae93dbc383b1030770cf8.png", "infoid": 1003848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "艾尔·里斯和杰克·特劳特在“定位：为你的头脑而战”一书中向我们介绍了广告中常用的品牌和产品定位的基本概念。\n但那是在20世纪80年代出版的，在知识上留下了一些空白。虽然里斯和特劳特的概念仍然是基本的，但并没有真正将它们付诸实践的方法。\n阿普丽尔是一个定位大师，顾问、作家和主旨演讲者。在科技界从事了20多年的营销工作后，在她丰富的产品定位经验的推动下，她决定填补定位知识的空白。\n她的书，显然很棒！(亚马逊英国；亚马逊美国)，详细介绍了定位产品的10个步骤流程，任何企业家或营销商都可以遵循。\n大约一年前，我非常自然地第一次看到了四月的书。我发现它非常有用，所以我知道我必须尽快面试她。\n我想听一个能说明产品定位价值的故事，同时也能让我深入了解如何用邓福德的方式来定位产品。\n我得到的这个是完美的：从来没有公开过，充满了细节，有趣，令人印象深刻(10亿美元的收入！)，而且非常有洞察力。\n这次我要在文章末尾去掉几个链接。它们包括一个四月的模板，以及一个由一家使用这种方法定位产品的真实公司发布的示例。\n这是一个非常古老的故事，我以前没有讲过，但它真的很巧妙。\n对于大多数初创企业来说，产品的想法都是基于我所说的定位论文。所以，你有一个想法，比如我想要建立更好的电子邮件，或者，就像这个故事一样，我们想要建立一个更好的数据库。\n当时，关系数据库都是很大、很复杂的东西，您必须安装在服务器上。您需要一个管理员，他们需要大量的资源，而且很难安装、很难设置和很难使用。这是很久以前的事了，我们正处于智能移动设备的早期(我们实际上处于笔记本电脑等技术的早期)。\n我们的想法是创建一个允许您使用SQL编程的数据库(就像您在大型数据库中一样)，不过我们要做的是占用空间小，两次单击安装，不需要管理员，那种您可以在PC上运行的数据库。我们的想法是把它作为电子表格的替代品卖给人们。\n我们把它设想为商业生产力软件。你可以把这个东西放在你的PC或笔记本电脑上，如果你必须操作一些数据和编写结构化查询，但你不想用Excel电子表格格式来做，你可以使用我们的东西。\n我们认为这很酷(我们是超级技术人员)，我们通过与一些现有客户交谈来验证这个想法，这些客户大多也是超级技术人员。每个人都去了，听起来很酷！\n我们发布了这个产品，我们把它作为一个小的独立数据库出售。虽然我们真的把它定位为生产力软件，但它是Excel的替代品。\n我们推出了这款产品，并围绕它开展了营销活动，将其投放市场，但我们并没有卖得很多。结果发现没有人想要它。我们卖出了几百本，但这些东西只卖100美元一支，所以我们需要卖几千本。而且，我们没有卖出数千台，所以看起来有点失败。\n几个月后，我们决定停止使用这种产品，因为它很难闻。\n我是团队的初级成员，担任产品营销的角色。我的老板对我说，接下来我要你给我们的客户打个电话，我们只有几百个，但如果你能弄到100个左右就太好了。只要试探一下他们对产品的所作所为，看看如果我们停止使用产品，他们会不会生气。\n现在，该产品不是SaaS，它是您在计算机上安装的独立软件，因此我们没有任何客户使用数据。我们知道我们的销量不是很高，所以我们怀疑人们也没有太多地使用它-但我们并不确定，我们也不想让每个人在我们告诉他们我们要关闭产品时都会生气。所以我们想我们应该先给他们打个电话，看看每个人都在做什么，然后我们再评估一下每个人会有多生气。\n我拿到了顾客名单，开始给每个人打电话。我有一个月没做别的事了，如果幸运的话，我现在每天有三到四次谈话。在第一周结束时(在大约15-20个人之后)，我发现几乎每个电话都是一样的：\n我：你好，我是4月份，我是从WATCOM公司打来的电话，我想知道你们使用这种产品的情况。\n我：是的，是的，让我调出我的记录。是的，您是在1月10日买的。\n他们：哦，对了！是啊，我是说看起来很酷。我们买了它，我们玩了一会儿，但后来我们并没有真正用上它。\n我有这么多这样的谈话，所以我在想，这没什么大不了的，我们想让这款产品停用，但甚至没有人知道他们有它。\n但是后来我的客户电话号码是21。我让那家伙接电话，他说：哦！那个东西！太神奇了，简直像变魔术一样！\n他的故事是，他让所有的销售人员都带着笔记本电脑(这是给你的销售人员一台笔记本电脑的早期)，他们过去常常到外地去。他说，他的问题是，他所有的销售人员都到外地去，但该公司的订单系统是内部的，运行着这个大型的甲骨文数据库。他的推销员会去外地接订单，把它写在纸上，然后他们会回到办公室，手动将订单输入他们的数据库。\n他说，有时他们会犯错误，或者他们会错误地引用订单，或者错过一条信息，最终不得不与客户来回来回三四次才能把订单做好。\n他所做的是将我们的SQL数据库放在笔记本电脑上，因为占用的空间非常小，可以放在笔记本电脑的小内存空间中，而且它与他在总部的Oracle数据库兼容。我们的客户编写了一个小程序，这样他们就可以在与客户在一起时在笔记本电脑上接受订单。然后，他们返回到办公室插件，自动与总部的大型甲骨文数据库同步。\n我觉得这很奇怪，这不是我们做这个产品的目的。但是我没有勇气告诉那个家伙我们要终止这款产品，所以我把它写了下来，并不断地打电话给更多的客户。\n我又打了一大堆电话，大多数情况下，其他人都没有用它做任何事情。\n但后来我找到了另一个人，他也在做同样的事情。这有点不同，因为他有现场服务代表，而不是销售人员。尽管如此，现场服务代表需要做一些笔记并跟踪事情，因此他们再次将数据库放在笔记本电脑或移动设备上。同样，当代表回到总部时，这些数据将与大型Oracle数据库同步。\n我最终打了100个电话，我有六七个人把我们的数据库放在某种移动设备上，让他们不在总部的团队能够做一些事情，然后他们可以把总部的数据同步到一个更大的SQL数据库上。\n我回到我当时的老板和高管团队那里，我喜欢好消息和坏消息。好消息是，我打了一百个电话，我知道人们在用这个产品做什么，绝大多数人不使用它，不喜欢它，如果我们关掉它，也不会有一丝悲伤。但是，我有这一小撮异类在以一种我们从未预料到的方式使用这款产品，当我们关闭它时，他们会非常失望。\n这在内部引发了一场讨论，我们如何才能将这个数据库重新定位为完全不同的东西，并成功地将其作为另一个东西销售。\n我们做到了，我们对它进行了重新定位，这样它就不再是与excel竞争的桌面生产力软件，而是一个可嵌入的移动设备数据库。\n好消息是，当时移动设备可嵌入数据库的竞争并不激烈。然而，也有一些人建造了自己的东西，试图完成我们所做的同样的事情。\n这需要业务上完全不同的转变。我们采取了不同的定价模式：我们不再一次销售一个数据库，我们将根据客户的销售队伍有多大，一次销售数百份。我们需要改变我们进入市场的路线，我们以前是从我们的网站上一次销售一份，但这将需要一名销售人员去与IT部门和销售主管交谈，以解释这件事是关于什么的。\n在一笔更大的交易中，这些交易从每笔100美元增加到了潜在的数千美元的收入。\n它最初的想法是，我们可以简单地用不同的方式讲述这个故事。\n我们必须弄清楚产品会变成什么样子，因为我们已经了解了旧产品(Excel)具有竞争力的可比性，但我们现在知道，对于我们最满意的客户来说，Excel不是可比性的。只有不高兴的客户才会把我们比作Excel，而现在高兴的客户根本不把我们当成Excel的替代品。\n我们满意的客户将我们与他们为数据存储构建的临时脚本相提并论，这些脚本安装在笔记本电脑上，可以与甲骨文同步。他们目前的解决方案非常复杂，而且是自主开发的。\n所以我们的第一步是看这个新的场景：我们有一个新的可比性；因此，我们有不同的有趣的功能。我们满意的客户喜欢我们，因为我们的SQL与他们的总部数据库兼容，而且我们的数据库占用的空间足够小，不会占用太多硬盘。\n这意味着他们可以把它放在资源非常有限的笔记本电脑或移动设备上，然后派人去实地考察。\n所以，它从洞察谁喜欢我们的东西开始，为什么喜欢我们的东西。这让我们想到了不同的竞争对手，因此，不同的关键功能，以及我们可以为客户提供的不同价值。\n然后，我们选择了不同的目标客户，最后，我们将我们的市场类别从商业生产力软件转向了用于移动设备的嵌入式数据库。\n我认为这个故事的结果是它变得很酷。我们最初这样做是为了测试，所以我们一开始雇佣了一名销售人员来计算定价。我们卖了一些特价商品，然后我们雇佣了越来越多的销售人员，产品开始疯狂销售。\n最终，我们被硅谷的一家大型数据库公司收购，产品继续卖啊卖啊卖。该产品今天仍然存在(请看这里：SAP SQL Anywhere)，并且仍然用作移动设备的嵌入式数据库。\n据我所知，在它的巅峰时期，它的收入是10亿美元。我们差一点就把产品扼杀了！想象一下，如果我没有进行这些对话，而是我们刚刚做了一项调查，问我，嘿，你喜欢这玩意儿吗？我们会拿回结果，我会说95%的用户认为它很愚蠢，他们不喜欢它。\n它们最终都是偶然的发现对话，因为我的目标不是问他们我们可以构建的新功能，或者您知道在客户电话中会做的任何正常事情，我的目标实际上是弄清楚他们是否在使用它，如果是的话，他们在做什么，以及这对业务的关键程度有多高，我的目标是找出他们是否在使用它，如果是这样，他们在做什么，这对业务的关键程度有多高。\n这是在我们甚至还不知道客户发现是什么之前，所以这是偶然的，但我们获得的洞察力就像是一次客户发现电话。它使我们基本上能够经历一个定位流程，就像我在我的书中概述的定位流程(亚马逊英国；亚马逊美国)。\n哈哈。重要的是要强调，我当时是初级的，虽然这是基于我收集到的洞察力，但从那时起，我就不是那个人了。这是一个重大的商业决定，而且很大程度上是首席执行官的决定。与整个团队的贡献相比，我做出的小小贡献是微不足道的，但重大的战略转变就是这样。\n美国的营销人员通常是在一个地方，用来展示洞察力，或者教育团队的其他成员，让他们了解客户在做什么，以及我们听到了什么。但是，如果你要做出改变，整个团队都必须加入进来并做出决定。\n市场营销无法靠自己做到这一点，因此，作为我现在为客户提供咨询服务的顾问，我不会做定位练习，除非我们能获得代表，而且通常情况下，整个高管团队都在房间里。这是因为，如果我不能说服销售人员、客户成功或首席执行官相信这是一件好事，这是不可能发生的。\n我们不能在泡沫中做这些事情，要想实现商业战略的重大转变，必须让每个人都走到一起。\n这是我非常、非常、非常的第一个产品，这个产品现在作为SAP的一部分一直存在。最初的公司是从加拿大滑铁卢大学剥离出来的，公司名为WATCOM。\nWATCOM最终被Sybase收购，当时我认为Sybase是世界上最大的数据库提供商之一。几年后，Sybase被SAP收购，由于我们的授权与他们的授权非常契合，他们为我们提供了充足的资金，在某种程度上让我们不为所动。\n在那之后，我们继续疯狂增长，因为我们处于移动设备崛起的正确时机-每台设备都需要我们整洁的嵌入式数据库。\n我和我的团队发现有一件事特别有用，那就是竞争性比较的想法。你介意也讲一下吗？\n所以，竞争性的可比性对我来说也是一个小小的突破。说实话，我不是从市场营销起步的，但最终我管理了一个庞大的营销团队(大学毕业两年后，他妈的阿普丽尔是如何领导一个全球营销团队的)，所以我上了很多营销课程，读了很多营销书籍，因为我觉得我必须迎头赶上。\n我发现有一件事很有趣，那就是定位是一个基础性的营销概念，但我们似乎没有这样做的方法论。\n很长一段时间以来，我一直认为那真的很有趣。而且，我试图建立一种方法论，将定位分解为碎片，然后有一个将其重新组装起来的过程。\n显然，有竞争力的替代方案是定位的关键。如果不知道你和谁相比，你就不能知道你的独特价值是什么。\n但在很长一段时间里，我一直在以一种典型的方式思考竞争性比较：当有人问你谁是你的竞争对手时，你往往会想到其他和你一样做软件的供应商。\n然而，在B2B市场中，你实际竞争的往往是一个电子表格，你的目标客户目前正在使用它来解决问题。\n(见鬼：在她的书中，阿普丽尔使用了一个客户简单地使用Excel或雇佣实习生来做你的产品所做的工作的例子。如果您将您的产品与类似的软件进行比较，但您的客户正在使用实习生手动操作，那么您没有进行正确的比较。)。\n我第一次得出这个结论时，我读了很多克莱顿·克里斯滕森(Clayton Christensen)和“待做的工作”(Jobs To Do)理论。这让我想到，公司雇佣你的产品是为了做一份工作，而这份工作并不总是显而易见的。\n你真的得找个有竞争力的替代方案。毕竟，如果我不明白我真正的竞争对手是谁，那么我就不明白我的产品有什么独特之处，因为我不知道我在和谁比较。如果你不把这件事搞清楚，你的整个定位就会错。\n谢谢!。您现在已订阅-我们只会在发布新的采访时与您联系。", "note_en": "Al Ries and Jack Trout in &#39; Positioning: The Battle for Your Mind&#39; introduced us to the fundamental concepts of brand and product positioning commonly used in advertising.\n But that was published in the 1980s and left something of a gap in knowledge. While Ries and Trout&#39;s concepts are still fundamental, there wasn&#39;t really a method for putting them into action.\n  April is a positioning &#39;guru&#39;, consultant, author, and keynote speaker. After more than 20 years in marketing in the tech world, and fueled by her many experiences of positioning product, she decided to fill the positioning knowledge gap.\n Her book, Obviously Awesome!  (  Amazon UK ;   Amazon USA ), details a 10 step process for positioning a product that any entrepreneur or marketer can follow.\n I first came across April&#39;s book very naturally about a year ago. I found it so useful that I knew I had to interview her for How the F*ck as soon as possible.\n I wanted to hear a story that would illustrate the value of product positioning, but one that also gives insight into &#39;how&#39; to position a product the Dunford way.\n The one that I got was perfect: Never publicly told before, full of details, fun, impressive ($1 billion in revenue!), and super insightful.\n I&#39;m going to drop a couple of links at the end of the article this time. They include one of April&#39;s templates, and an example published by a real company who used this method to position their product.\n    This one&#39;s a really old story, one I haven&#39;t told before, but it&#39;s really neat.\n With most start-up&#39;s, the idea for a product is based on what I would call a positioning thesis. So, you have an idea for something like &#39;I want to build better email&#39; or, like in the case of this story, we wanted to build a better database.\n At the time, relational databases were all big, complex things that you had to install on a server. You needed an administrator, they took a lot of resources, and they were very difficult to install, difficult to set up, and difficult to use. This story was a long time ago, and we were in the early days of smart mobile devices (we were actually in the early days of technology like laptops).\n We had this idea that we would create a database that allowed you to program in SQL (like you would in a big database) except that we were going to make a low footprint, two-click install, doesn&#39;t need an administrator, kind of database that you could run on a PC. The idea was that we were gonna sell it to people as an alternative to a spreadsheet.\n We envisioned it as &#39;business productivity software&#39;. You would put this thing on your PC or laptop, and if you had to manipulate some data and write structured queries, but you didn&#39;t want to do it in Excel spreadsheet format, you could use our thing.\n We thought that was cool (we were super techy) and we validated the idea by talking to some of our existing customers who were, for the most part super techies, too. Everybody went &#39;yeah, that sounds cool!&#39;.\n    We released the product, and we were selling it as this little standalone database. Although we were really positioning it as productivity software that was an alternative to Excel.\n We launched the product and ran marketing campaigns around it, put it out in the market, and   we did not  sell very many. It turned out that nobody wanted it. We sold a couple hundred copies, but we were only selling these things for $100 a pop, so we&#39;d needed to sell thousands of them. And, we weren&#39;t selling thousands of them, so it looked like a bit of a failure.\n A few months in we decided we were gonna have to &#39;end-of-life&#39; the product because it was a stinker.\n    I was junior on the team, in a product marketing role. My boss said to me next &#34;I want you to call our customers, we&#39;ve only got a couple hundred of them, but it would be great if you could get a hold of around 100 of them. Just feel them out for what they&#39;re doing with the product and see if they&#39;re gonna be mad if we end-of-life it.&#34;\n Now, this product was not SaaS, it was a standalone software that you installed on your computer, so we didn&#39;t have any customer usage data. We knew we weren&#39;t selling very many, so we had the suspicion that people also weren&#39;t using it all that much - but we didn&#39;t know for sure, and we didn&#39;t want everyone to get angry if we told them that we were gonna turn the product off. So we thought we should call them first and see what everyone&#39;s doing and then we&#39;ll gauge how mad everyone&#39;s gonna be.\n I got the list of customers, and I started calling everybody. I didn&#39;t do anything else for a month, and I&#39;m having three-four conversations a day if I&#39;m lucky. At the end of the first week (after about 15-20 people) I found that almost every call went the same:\n  Me: &#34;Hi, I&#39;m April, I&#39;m calling from company WATCOM and I just wanted to know about your usage of this product.&#34;\n  Me: &#34;Yes, yes, you did, let me pull up my records. Yes you bought it on the 10th of January.&#34;\n Them: &#34;Oh yeah! Yeah, I mean it seemed cool. We bought it, we fooled around with it for a little bit, but then we didn&#39;t really use it.&#34;\n  I had so many of these conversations, so I was thinking &#39;yeah, this is gonna be no big deal, we want to end-of-life this product and no one even knows they have it.&#39;\n But then I had customer call number 21. I get the guy on the phone and he says: &#34;Oh! That thing! It&#39;s amazing, it&#39;s like magic!&#34;\n     His story was that he had all these salespeople with laptops (this was the early days of giving your salesperson a laptop) which they used to go out in the field. He says that his problem is that all his salespeople go out in the field, but the company&#39;s order system is in-house and runs this big Oracle database. His salesmen would go out in the field to take an order, write it down on paper and then they would come back to the office to manually enter the order into their database.\n He said that sometimes they&#39;d make a mistake or they&#39;d misquote the order or miss a piece of information and end up having to go back and forth with the customer three or four times before they get the order right.\n    What he was doing was putting our SQL database on the laptop, because the footprint was so small it fitted on the laptop&#39;s small memory space, and it was compatible with his Oracle database back at headquarters. Our customer wrote a small program so that they could take the order on their laptop while they were with the customer. They&#39;d then come back to the office plug-in and automatically sync up with the big Oracle database at headquarters.\n  I thought &#39;that&#39;s weird, that is not what we built this product to do&#39;. But I didn&#39;t have the guts to tell the guy we were going to end the product and so I wrote it down and kept calling more customers.\n I did a whole bunch more calls and for the most part, all the other people were not using it for anything.\n But then I got another guy who was doing the exact same thing. It was a little bit different in that he had field service reps rather than salespeople. Still, the field service reps needed to take some notes and track things and so again they had put the database on the laptop or mobile device. Again that data would be synced with the large Oracle database when the rep got back to headquarters.\n I ended up doing a hundred calls, and I had six or seven that were putting our database on some kind of mobile device to enable their teams who were not at headquarters to do stuff and then they could sync that up back at headquarters to a bigger SQL database.\n    I go back to my boss at the time and the executive team, and I&#39;m like &#39;good news and bad news&#39;. Good news is that I made a hundred calls I know what people are doing with the product, and the vast majority don&#39;t use it, don&#39;t like it, and aren&#39;t gonna be one bit sad if we turn it off. But, I&#39;ve got this handful of outliers that are using this product in a way we never expected, and they&#39;re going to be very disappointed when we turn it off.\n That sparked a conversation internally about how we could we reposition this database into something completely different and sell it successfully as this other thing.\n We did it, we repositioned it so that instead of being desk productivity software that competes with excel, it would be an embeddable database for mobile devices.\n The good thing was that there was not a lot of competition for &#39;embeddable database for mobile devices&#39; at the time. However, there were people building homegrown things trying to accomplish the same thing that we did.\n    It required a completely different shift in the business. We made a different pricing model: we were no longer selling it one database at a time, we were gonna sell hundreds of copies at a time depending on how big the customer&#39;s salesforce was. We needed to change our route to market, we were previously selling it one copy at a time from our website, but this was going to require a salesperson to go and talk to IT and the head of sales to explain what this thing was about.\n The deals went from $100 a pop to potentially thousands of dollars of revenue in a bigger deal.\n    It started out with the idea that we could simply tell the story in a different way.\n We had to work through what the product was becoming, because we had had an understanding of the competitive comparable for the old product (Excel), but we knew that now, for our most happy customers Excel was not the comparable. Just the unhappy customers were comparing us to Excel, and now the happy customers didn&#39;t see us as an Excel alternative at all.\n What our happy customers were comparing us to were the makeshift scripts that they&#39;d built for data storage, that sits on a laptop and can sync back to Oracle. Their current solutions were very complicated and homegrown.\n So our first step was to look at this new scenario: we have a new comparable; therefore, we have different features that are interesting. Our happy customers loved us because we had SQL that was compatible with their headquarters database, and our database was low footprint enough that it didn&#39;t take up too much hard disk.\n This meant that they could put it on a very resource-constrained laptop or a mobile device and send people out in the field.\n So, it started with insight into who loved our stuff and why. That got us to thinking about different competitive comparables and, therefore, different key features and, therefore, the different value we could deliver to the customer.\n We then chose different customers to target and, finally, we shifted our market category away from &#39;business productivity software&#39; to an &#39;embeddable database for mobile devices&#39;.\n      I think the result of that story is where it gets cool. We did this as a test originally, so we started out by hiring one salesperson to figure out the pricing. We sold some deals and, then we hired more and more salespeople, and the product started selling like crazy.\n    Eventually, we got acquired by a huge database company in Silicon Valley, and the product continued to sell and sell and sell. That product still exists today (look at it here:   SAP SQL anywhere ) and is still used as an embeddable database for mobile devices.\n At its peak, is my understanding, that it was making $1 billion in revenue. And we had almost killed the product! Imagine if I hadn&#39;t had had those conversations and instead we had just done a survey saying &#39;hey do you like this thing&#39;. We would have got the results back, and I would have said 95% of users think it&#39;s stupid and they don&#39;t like it.\n      They ended up being very much discovery conversations by accident because my goal was not to ask them about new features we could build or you know any of the normal things you would do on a customer call, my goal really was to figure out if they were using it, and if so what were they doing and how business-critical was that.\n This was before we even knew what customer discovery was, so it was by accident but the insight that we got was just like a customer discovery call. It enabled us to essentially walk through a position process just like the positioning process I outline in my book (  Amazon UK ;   Amazon USA )\n      Ha. It&#39;s important to highlight that I was junior at this time, and although it was based on the insight I had gathered, from there on, it was not me. This was a significant business decision, and very much the CEO&#39;s. My little contribute contribution was kind of minor when compared to the whole team&#39;s contribution, but big strategic shifts are like that.\n Us marketers are often in a place to shine a light on insight or to educate the rest of the team on what the customers are doing and what we are hearing. But, the whole team has to get on board and make the decision if you&#39;re gonna make a shift.\n Marketing doesn&#39;t get to do that on their own and so, as a consultant now with my clients, I don&#39;t do a positioning exercise unless we can get representation, and usually, it&#39;s the whole executive team in the room together. That&#39;s because if I can&#39;t convince sales, customer success, or the CEO that it&#39;s a good thing to do, it ain&#39;t gonna happen.\n We don&#39;t get to do these things in a bubble it&#39;s gotta be everybody coming together if there is going to be a big shift in business strategy.\n    There was my very, very, very first product and that product lives on now as part of SAP. The original company was a spin-out from the University of Waterloo here in Canada, the company was called   WATCOM.\n WATCOM was eventually acquired by a Sybase which, at the time, was I think one of the biggest database providers in the world. Years later, Sybase was acquired by SAP, and because our mandate fit so nicely under theirs, they funded us well and kind of left us alone.\n After that, we just continued to grow like crazy because we were at the right time for the rise of mobile devices – our neat embeddable database was needed on every device.\n  One thing my team and I found particularly useful was that idea of competitive comparables. Would you mind going into that, too?\n  So, the competitive comparable was a bit of a breakthrough for me too. To tell you the truth, I didn&#39;t start out in marketing, but I ended up running a big marketing team (  How the F*ck:  April led a global marketing team two years out of college), and so I did a lot of marketing courses and read a lot of marketing books because I felt like I had to catch up.\n One of the things that I found intriguing was this idea that positioning was a foundational marketing concept and yet we didn&#39;t seem to have a methodology for doing it.\n I thought that was really interesting for the longest time. And, I was trying to build a methodology that would break positioning into pieces and then have a process for putting it back together.\n Clearly, a competitive alternative is a key thing in positioning. You can&#39;t know what your distinctive value is without knowing who you&#39;re compared against.\n    But for a long time, I was thinking about competitive comparison in a typical way: when someone says &#39;who is your competitor&#39; you tend to think of other providers out there that do software just like yours.\n However, in B2B markets, often the thing you are actually competing against is something like a spreadsheet that your target customer is using to solve the problem at the moment.\n (How the F*ck: In her book April uses the example of a customer simply using Excel or hiring an intern to do the job your product does. If you compare your product against similar software, but your customer is using an intern to do in manually, you aren&#39;t making the right comparison.)\n I first came to this conclusion when I was reading a lot of Clayton Christensen and jobs to be done theory. It got me thinking about the idea that companies hire your product to do a job, and that job is not always obvious.\n You&#39;ve really got to nail the competitive alternative. After all, if I don&#39;t understand who my real competitive alternative is then, I don&#39;t understand what&#39;s unique about my offering because I don&#39;t know who I&#39;m comparing to. If you don&#39;t nail this, your whole positioning will be wrong.\n Thank you! You&#39;re now subscribed - we will only contact you when a new interview is released.", "posttime": "2020-05-27 05:51:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,产品,reposition", "title": "我帮助重新定位了一款数据库产品，该产品后来获得了10亿美元的收入", "title_en": "I helped reposition a database product that went on to make $1B in revenue", "transed": 1, "url": "https://www.thefxck.com/interviews/product-positioning-april-dunford", "via": "", "real_tags": ["数据库", "database", "产品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003847, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您在自定义目录中安装了“我的世界地下城”，则有机会卸载“我的世界”地下城启动器和/或游戏将删除整个父目录和其中的所有内容。\n在卸载任何东西之前，请确保“我的世界地下城”启动器至少使用Bootstrap 166或更高版本。您可以在设置&gt；关于&gt；Bootstrap中查看此信息。\n我一直在网上读到这个错误会导致整个磁盘被擦除，但事实并非如此。因此，我想更详细地说明这个错误是关于什么的，以及我们在听到第一个报告后大约30分钟内发布的修复程序是什么：\n当玩家在地下城安装对话框中选择了一个自定义的安装位置时，地下城启动器选择了该位置，并且天真地认为只有由地下城启动器编写的文件才会驻留在那里。因此，在卸载启动程序时，卸载逻辑将简单地删除该安装位置文件夹，从而不会在磁盘上留下由启动程序创建的程序文件的痕迹。\n我们没有考虑到玩家选择的自定义位置中也可能有属于其他程序的文件。不幸的是，我们在测试中没有发现这一点。所以这个错误只会影响那些为地下城选择了一个自定义安装位置的玩家，那里还有其他的程序文件，然后试图卸载地下城启动器。\n我们在听到第一个报告(引导程序版本166及更高版本)后不久发布的修复程序是只删除地下城安装位置下启动器知道的文件夹。\n我们对此可能给玩家带来的不便深表歉意，并肯定会将此作为改进我们质量保证过程的学习经验。\n我在我的固态硬盘上安装了“我的世界地下城”启动器和我所有的游戏，它不让我在相同的地方安装游戏，所以我卸载了启动器，这样我就可以把它安装在我的C盘上了，但是它抹去了我整个游戏的固态硬盘！", "note_en": "If you have installed Minecraft Dungeons in a  custom directory, there is a chance uninstalling Minecraft Dungeons Launcher and/or the game will remove the entire parent directory and everything in it.\n Before uninstalling anything, please ensure the Minecraft Dungeons Launcher atleast uses Bootstrap version 166 or higher. You can check this at  Settings &gt; About &gt; Bootstrap.\n I&#39;ve been reading online that this bug was causing entire disks to be wiped out, which was not necessarily the case. So I&#39;d like to clarify what the bug was about in more detail, and what is the fix we released within around 30 minutes after hearing the first report:\n When a player selected a custom &#34;Install Location&#34; in the Dungeons installation dialog, the Dungeons Launcher was taking that location and naively considering that only files written by the Dungeons Launcher would live there. Thus, when uninstalling the Launcher, the uninstall logic would simply delete that &#34;Install Location&#34; folder, to leave no traces of program files created by the Launcher on disk.\n We didn&#39;t consider that the custom location chosen by players could also have files belonging to other programs in it. And unfortunately, we didn&#39;t catch that in tests. So the bug would only impact players who had selected a custom install location for Dungeons where other program files also exist, then tried to uninstall the Dungeons Launcher.\n The fix we released soon after hearing about the first report (which is in Bootstrap version 166 and up) is to delete only the folders that the Launcher knows about, under the Dungeons install location.\n We are very sorry for the inconvenience this might have caused to players and will surely take this as a learning experience for improving our quality assurance process.\n I had the Minecraft Dungeons launcher installed on my SSD with all my games, it wouldn&#39;t let me install the game in the same place so I uninstalled the launcher so I could install it on my C drive but it wiped out my entire games SSD!", "posttime": "2020-05-27 05:51:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卸载,wipes,程序", "title": "Launcher在卸载时擦除整个SSD", "title_en": "Launcher wipes entire SSD when uninstalling", "transed": 1, "url": "https://bugs.mojang.com/browse/MCL-14107", "via": "", "real_tags": ["卸载", "wipes", "程序"]}, {"category": "", "categoryclass": "", "imagename": "2d941c8240e4beb4b0fec72db0fb86bf.jpg", "infoid": 1003845, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我喜欢IT技术连接：https://www.youtube.com/channel/UCy0tKL1T7wFoYcxCe0xjN6Q Patreon：https://www.patreon.com/agingwheels商品：https://.", "note_en": "I like it Technology Connections: https://www.youtube.com/channel/UCy0tKL1T7wFoYcxCe0xjN6Q Patreon: https://www.patreon.com/agingwheels Merchandise: https://...", "posttime": "2020-05-27 05:35:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,figaro,https", "title": "日产菲加罗-灵感来自日本的复古敞篷车[视频]", "title_en": "Nissan Figaro – Retro-inspired convertible from Japan [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=HE2dKZ492TA", "via": "", "real_tags": ["日本", "figaro", "https"]}, {"category": "", "categoryclass": "", "imagename": "4645b4c0568fe413d109202574ecaa93.jpg", "infoid": 1003842, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“这是病毒的报复，”伦敦卫生与热带医学院(London School Of Hygiene And Tropical Medicine)院长彼得·皮奥特(Peter Piot)博士说。“我让他们的生活变得困难。现在他们想要抓住我。“。\n现年71岁的皮奥特博士是抗击埃博拉和艾滋病的传奇人物。但是新冠肺炎差点杀了他。\n“一周前，我不可能做这个采访，”他最近在他伦敦的餐厅里通过Skype说，他身后有一幅马蹄莲的油画。“10分钟后，我还是喘不过气来。”\n皮奥特博士在经历了一段病毒猎人生涯后，遗憾地回首往事，他说自己误判了猎物，成为了猎物。\n“我低估了这一点--它会以多快的速度传播。我的错误是认为它就像SARS，范围相当有限。或者说它就像流感一样。但两者都不是。“。\n1976年，作为比利时安特卫普热带医学研究所(Institute Of Tropical Medicine)的病毒学研究生，皮奥特博士是调查扎伊尔扬布库(现在的刚果民主共和国)一场神秘病毒性出血热的国际团队的一员。\n为了避免给该镇蒙上污名，研究小组成员以附近一条河流的名字将病毒命名为“埃博拉”。\n后来，在20世纪80年代，他是证明这种在非洲被称为“苗条”的消瘦疾病是由导致其他地方年轻男同性恋者死亡的同一种病毒引起的科学家之一。\n1991年至1994年，他担任国际艾滋病协会(International AIDS Society)主席，然后担任联合国艾滋病(U.N.AIDS)--联合国抗艾滋病项目--的第一任主任。\n这些专业知识使他对新的冠状病毒构成的危险保持着敏锐的警觉。1月下旬，他和他的妻子，人类学家海蒂·拉尔森(Heidi Larson)去新加坡参加了一个医学会议，一周前新加坡出现了第一例病例。在那里，在世界卫生组织宣布这种新出现的病毒为国际关注的突发公共卫生事件的当天，他接受了当地电视台的即兴采访。\n“我们开始禁止在我们的行为中握手。我们出去吃饭是因为我们喜欢好吃的食物，但我们开始对‘埃博拉肘部’表示敬意。“。\n3月初，他和伦敦卫生与热带医学院(London School Of Hygiene And Tropical Medicine)疫苗信心项目负责人拉森博士一起去了波士顿。她在TedMed上发表了一场关于破坏疫苗接种活动的谣言的TedMed演讲，他被问到了100个关于病毒的问题。\n79：“我是不是应该担心我会抓到新冠肺炎？彼得，你有多担心？“。\n他建议说：“我会尽我所能避免被感染，因为你不知道个人的结果。”\n尽管那一周在波士顿地区举行的医学会议变成了超级传播者活动，但皮奥特博士几乎毫无疑问没有在那里受到感染。\n回到伦敦的家中，他向30到250名听众发表了讲话，参加了一个50人的生日派对，并在伦敦或剑桥的五家餐厅共进晚餐或喝酒。\n“我的惯用作案手法，”他说。除了避免握手，他没有采取特别的预防措施。“我真的不知道我是在哪里感染的。”\n虽然当时已经有许多确诊病例，但英国直到3月23日才正式进入封锁状态，当时确认的死亡人数为335人。相比之下，皮奥特博士和他的妻子从16日开始在家工作。\n“我的第一反应是，‘哦，我希望不是Covid。’”\n“它像一辆公交车一样冲击着我。极度疲惫，就像你身体里的每个细胞都很疲惫。我的头皮非常敏感--海蒂一碰它就疼。这是一种神经症状。“。\n这是一种新的感觉。他说，尽管他在蚊子肆虐的气候中度过了所有的时间，但“我一生中从未患过重病。”他经常慢跑，看起来很健康，他开玩笑说，“这是我成年后第一次一个月不喝酒。”\n另一方面，拉森博士在旅行中经历了一连串的热带疾病：脑型疟疾、戊型肝炎、伤寒和登革热。\n“我知道彼得感受到的很多症状--疼痛时你如何保持头部，在房间里走动就会感到多么疲惫。”所以，如果他要水或其他什么东西，我就放下手中的活，马上就拿到了。当你身体不舒服时，时间是一种不同的体验--每一分钟都很重要。“。\n当时，几乎不可能进行检测；可用的为数不多的试剂盒是为医院保留的。\n3月26日，他终于通过一位私家医生找到了一个。结果是阳性的，他的发烧持续高烧。\n3月31日，气温达到了104华氏度，他开始感到困惑。他和妻子去了伦敦皇家医院的急诊室。\n虽然他没有感到呼吸急促，但他的血氧饱和度只有84%，低得危险。X光显示两个肺中的液体呈细菌性肺炎的模式。\n他说，他的血液测试“真的很糟糕”。他的C-反应蛋白(表示炎症)和D-二聚体(表示血液凝块形成)的水平都非常高。\n“我立刻从医生变成了病人，”他说。给他上了氧气，然后用轮床送他上楼。\n“就在那时，它击中了我的胃，”拉森博士说。在他接受评估时，她被允许留下来，但不能冒险上楼。\n正常情况下，英国的国民医疗服务医院“和印度的公交车一样拥挤，”拉森博士说。“但他们有一场宣传活动说，‘除非你已经到了最后11个小时，否则不要来医院’，所以医院几乎是空的。”\n“但当我看到彼得乘坐那辆手推车穿过两扇门时--我和我们在塞拉利昂认识的埃博拉家属有同样的感觉：他们把亲人藏起来，因为他们知道可能再也见不到他们了，因为他们不想在情感上与他们分离。”\n皮奥特博士说，一开始，他太疲惫了，以至于无动于衷。他要求一间单人房，但被告知是为没有检测呈阳性的人预留的，以保护他们。他和另外三名男子被关在一个20乘22英尺的房间里，一个卫生间。\n“他们称NHS为‘伟大的均衡器’，”他说。“食物是棒棒糖和土豆泥，太难吃了。我的室友打呼噜很厉害。“。\n拉森医生当晚回家听到南非著名艾滋病研究者吉塔·拉姆吉博士刚刚因新冠肺炎去世的消息。拉姆吉博士是皮奥特博士学校的名誉教授，在生病之前曾在那里主持过一次研讨会。\n“她和我一样大，我突然有一种强烈的感觉，‘这可能会发生在我身上’，”拉森博士说。\n“你所能做的就是躺在那里想，‘我希望情况不会变得更糟。’”\n他接受了静脉注射抗生素和高流量氧气，每两个小时就被叫醒一次，检查他的a、血压和其他生命体征。\n“我特别担心自己不会戴上呼吸机，”他说。“呼吸机可以拯救生命，但也会造成很大的伤害。一旦你感染了埃博拉病毒，你的存活几率就和埃博拉病毒的存活几率一样，大约是三分之一。“。\n每天，他都会与拉森医生或他的成年子女交谈。他确实有机会看了他妻子推荐的关于西西里侦探“蒙塔巴诺探长”的BBC新连续剧的几集。\n“如果这发生在手机之前，你能想象那种孤独吗？”他说。“这就像是在监狱里。听着，我知道我享有特权，我知道我不会像纳尔逊·曼德拉那样被困在这里27年。但这个世界缩小到了必需品。你满脑子想的都是：‘我的呼吸怎么样？’“。\n皮奥特博士说，最后，他的血氧饱和度达到了92%。他於四月八日出院。\n“他们想给我叫辆出租车，但我拒绝了，我想呼吸伦敦现在没有污染的空气。”\n“这令人震惊，就像斯德哥尔摩综合症一样，”他在谈到自己的生还时说。“坦率地说，当我回到家时，我开始哭泣。太感人了。“。\n在医院出院之前，他的病毒检测呈阴性。但现在，另一件事正在发生--一种延迟的免疫反应。\n“渐渐地，我变得呼吸急促，”他说。“我们住在一栋三层楼的老乔治亚式房子里，我好不容易才上楼。”\n她最近自己的病毒抗体检测呈阳性，尽管她的病情非常轻微，她不确定什么时候达到顶峰。她有两次严重的头痛，第一次是在3月下旬，第二次是在4月中旬。第二次，她也有发痒的红眼睛，这是一种罕见的但公认的症状，可能表明是通过眼睛感染的。\n4月15日，皮奥特医生的心跳开始加速到每分钟165次。他的血氧百分比又降到了80%左右。\n他和拉森医生去了大学学院医院，在那里他做了胸部X光检查。\n这一次，两边没有明显的细菌团块，“我的肺里到处都是浸润的东西，它们真的是一团糟。这叫‘组织性肺炎’。“。\n他解释说，整个肺部长得像一束束葡萄的小囊泡正在渗出信号蛋白--他正在经历一场“细胞因子风暴”。它们将贪婪的白细胞吸引到气囊之间的空隙中，因此它们可能会阻止氧气通常进入他的红细胞的路径。\n“我的祖父在第一次世界大战期间曾在战壕中作战--在佛兰德斯的那些罂粟田里，”皮奥特博士说。“他说最糟糕的是休假回家--然后意识到你必须回去做什么。”\n但是，给他吸氧住院可能是徒劳的-他的肺正在“僵硬”，可能无法吸收。\n取而代之的是，专门治疗难治性肺炎的乔安娜·波特(Joanna Porter)医生给他静脉注射类固醇以减少炎症，同时使用抗凝剂来防止他的心房纤颤导致的血块。\n英国的NHS官僚机构禁止她讨论皮奥特医生的治疗，尽管他得到了他的许可。他仍在她的照顾之下。上周，PET扫描、CT扫描和支气管镜检查显示，他的部分肺部尚未完全清除。“而且，”他补充说，“告诉你的美国观众：所有这些昂贵的测试都是免费的，NHS是免费的。”他一直是全民医保的推动者。\n类固醇似乎有效，但服用时间过长可能会产生副作用，包括肌肉萎缩、骨骼虚弱和糖尿病。\n他说，他的余生可能不得不服用抗凝剂，而且他的部分肺部可能会永久留下疤痕。\n他说：“如果你在身患重病时得了这种细胞因子风暴，你就完蛋了。”“但是我有三个阶段--先是发烧，然后需要氧气，然后是暴风雨。”\n“人们认为，有了新冠肺炎，1%的人死亡，其余的人只是得了流感。事情没有那么简单--整个事情都在中间。“。\n“他们只说，‘休息吧！休息一下！休息吧！“。那不是我的堡垒。把我推到海滩上坐是惩罚。“。\n“但我做了一点。我正在与CEPI合作研发疫苗，“他补充道，他指的是流行病准备创新联盟，这是一个成立于2017年的联盟，目的是创造针对传统疫苗公司不投资的新疾病甚至未来疾病的疫苗。\n“我曾面临死亡，”他说。“1976年，当我们从病人身上抽血时，防护装备还是个笑话。我逃过了一次直升机事故。但这次不同。我认为面对死亡并幸存下来是一件好事--它迫使你思考什么是必要的，谁是必要的。“。\n“我现在用佛兰芒语，我们称之为‘ervaringsdeskundige’--一个‘体验专家’。”被安排进顾问小组的人不是因为你研究过一种疾病，而是因为你经历过这种疾病。那就是我。现在我在想我的余生该做些什么。“", "note_en": "“This is the revenge of the viruses,” said Dr. Peter Piot, the director of the London School of Hygiene and Tropical Medicine. “I’ve made their lives difficult. Now they’re trying to get me.”\n Dr. Piot, 71 years old, is a legend in the battles against Ebola and AIDS. But Covid-19 almost killed him.\n “A week ago, I couldn’t have done this interview,” he said, speaking recently by Skype from his London dining room, a painting of calla lilies behind him. “I was still short of breath after 10 minutes.”\n Looking back, ruefully, on being brought down by a virus after a life as a virus-hunter, Dr. Piot said he had misjudged his prey and had become the hunted.\n “I underestimated this one — how fast it would spread. My mistake was to think it was like SARS, which was pretty limited in scope. Or that it was like influenza. But it’s neither.”\n In 1976, as a graduate student in virology at the Institute of Tropical Medicine in Antwerp, Belgium, Dr. Piot was  part of the international team that investigated a mysterious viral hemorrhagic fever in Yambuku, Zaire, now the Democratic Republic of Congo.\n To avoid stigmatizing the town, team members named the virus “Ebola” after a nearby river.\n Later, in the 1980s, he was one of the scientists who proved that the wasting disease known as “slim” in Africa was caused by the same virus that was killing young gay men elsewhere.\n From 1991 to 1994, he was president of the International AIDS Society, and then the first director of U.N.AIDS, the United Nations’ anti-H.I.V. program.\n That expertise made him keenly alert to the danger posed by the new coronavirus. In late January, he and his wife,  Heidi Larson, an anthropologist, went to a medical conference in Singapore, which had had its first case a week earlier. While there, he gave an impromptu  interview to local television on the day the World Health Organization  declared the emerging virus a public health emergency of international concern.\n  “We started banning handshaking from our behavior. We went out to eat because we like good food, but we started giving the ‘Ebola elbow.’”\n In early March, he went to Boston with Dr. Larson, who heads  the Vaccine Confidence Project at the London School of Hygiene and Tropical Medicine. She  gave a TedMed talk about rumors that damage vaccination campaigns, and he was asked  100 questions about the virus.\n No. 79: “Should I be worried that I’m going to get Covid-19? How worried are you, Peter?”\n He advised: “I would do everything I can to avoid becoming infected as you don’t know individual outcomes.”\n Although medical conferences in the Boston area that week were  turning into super-spreader events, Dr. Piot almost undoubtedly did not get infected there.\n  Back home in London, he spoke to audiences of 30 to 250, attended a 50-person birthday party and had dinner or drinks in five restaurants in London or Cambridge.\n “My usual modus operandi,” he said. Aside from avoiding hand shakes, he took no particular precautions. “I really don’t know where I was infected.”\n Although there were then already many confirmed cases, Britain did not officially go into lockdown  until March 23, when there were  335 confirmed deaths. Dr. Piot and his wife, by contrast, began working from home on the 16th.\n “My immediate thought was, ‘Oh, I hope it’s not Covid.’”\n “It hit me like a bus. Extreme exhaustion, like every cell in your body is tired. And my scalp was very sensitive — it hurt if Heidi touched it. That’s a neurological symptom.”\n It was a new feeling. Despite all the time he has spent in mosquito-riddled climes, “I’d never been seriously ill in my life,” he said. A regular jogger and apparently healthy he joked, “This is the first time in my adult life I didn’t drink wine for a month.”\n  Dr. Larson, on the other hand, has survived a fusillade of tropical diseases in her travels: cerebral malaria, hepatitis E, typhoid and dengue.\n “I knew how a lot of the symptoms Peter had felt — how you hold your head when it hurts, how fatigued you get just moving across the room. So if he asked for water, or anything, I dropped what I was doing and got it immediately. Time is a different experience when you’re not well — every minute matters.”\n At the time, it was almost impossible to get tested; the few kits available were reserved for hospitals.\n On March 26, he finally found one through a private doctor. It was positive, and his fever kept rising.\n On March 31, it hit 104 degrees and he began feeling confused. He and his wife went to the emergency room of the Royal London Hospital.\n  Although he did not feel short of breath, his oxygen saturation was only 84 percent, dangerously low. An X-ray showed fluid in both lungs in a pattern that suggested bacterial pneumonia.\n His blood tests “were really bad,” he said. His levels of C-reactive protein, which indicate inflammation, and of D-Dimer, which indicate blood clots forming, were both very high.\n “I instantly changed from doctor to patient,” he said. He was put on oxygen and sent upstairs on a gurney.\n “That was when it hit me in the stomach,” Dr. Larson said. She had been allowed to stay while he was assessed but could not venture upstairs.\n Normally Britain’s National Health Service hospitals “are as crowded as Indian buses,” Dr. Larson said. “But they had a campaign saying, ‘Don’t come to the hospital unless you’re in the 11th hour,’ so it was almost empty.”\n “But when I saw Peter go through the double doors on that cart — I had the same feeling as the Ebola families we knew in Sierra Leone: They were hiding their relatives because they didn’t want to be separated from them emotionally, knowing they might never see them again.”\n At first, Dr. Piot said, he was so exhausted he was apathetic. He asked for a single room, but was told they were reserved for people who had not tested positive, for their protection. He was put in a 20-by-22-foot room, one bathroom, with three other men.\n “They call the N.H.S. ‘the great equalizer,’” he said. “The food was bangers and mash — awful. And my roommates snored a lot.”\n  Dr. Larson went home that night to  hear on the news that Dr. Gita Ramjee, a well-known South African AIDS researcher, had just died of Covid-19. Dr. Ramjee was an honorary professor at Dr. Piot’s school and had led a symposium there before falling ill.\n “She was my age, and I suddenly felt an acute sense of ‘it could happen to me,’” Dr. Larson said.\n “All you can do is lie there thinking, ‘I hope it’s not going to get worse.’”\n He got intravenous antibiotics and high-flow oxygen, and was roused every two hours for checks on his a blood pressure and other vital signs.\n  “I was particularly anxious that I not be put on a ventilator,” he said. “Ventilators can save lives, but they can also do a lot of harm. Once you’re on one, your chances of surviving are the same as of surviving Ebola — about one third.”\n  Every day, he talked to Dr. Larson or his grown children. He did get to watch episodes of a new BBC series about a Sicilian detective, “ Inspector Montalbano,” that his wife recommended.\n “If this had happened before cellphones, can you imagine the loneliness?” he said. “It’s like being in prison. Look, I know I’m privileged, and I know I’m not going to be stuck here for 27 years like Nelson Mandela. But the world shrinks to the essentials. All you can think is: ‘How is my breathing going?’”\n Finally, Dr. Piot said, his oxygen saturation came up to 92 percent. He was discharged on April 8.\n “They wanted to call me a taxi, but I said no, I wanted to breathe the now non-polluted air in London.”\n “It was a shock, like Stockholm syndrome,” he said of his survival. “When I got home, frankly, I started crying. It was so emotional.”\n Before the hospital released him, he had tested negative for the virus. But now something else was going on — a delayed immune reaction.\n “Gradually, I became short of breath,” he said. “We live in an old Georgian house, with three floors, and I had a hard time getting upstairs.”\n She recently tested positive for antibodies to the virus herself, although her illness was so mild that she’s not sure when it peaked. She had two bouts of bad headaches, the first in late March and the second in mid-April. The second time, she also had itchy red eyes, which are  a rare but recognized symptom and may indicate  infection through the eyes.\n On April 15, Dr. Piot’s heart started to race to 165 beats a minute. The percentage of his blood oxygen dropped to the mid-80s again.\n He and Dr. Larson went to the University College Hospital where he had a chest X-ray.\n This time, instead of distinct bacterial masses on each side, “my lungs were full of infiltrates, and they were a real mess. It’s called ‘ organizing pneumonia.’”\n The tiny sacs that grow like bunches of grapes throughout the lungs, he explained, were oozing signaling proteins — he was having a “cytokine storm.” Those drew voracious white blood cells into the spaces between the air sacs so they threatened to block the paths oxygen normally takes to his red blood cells.\n “My grandfather fought in the trenches in World War I — in those poppy fields in Flanders,” Dr. Piot said. “He said the worst part was going home on leave — and then realizing what you had to go back to.”\n But hospitalizing him on oxygen might have been fruitless — his lungs were “stiffening” and perhaps unable to absorb it.\n Instead, Dr. Joanna Porter, who specializes in difficult pneumonias, put him on an intravenous steroid to reduce the inflammation, along with an anticoagulant to prevent blood clots from his atrial fibrillation.\n Britain’s N.H.S. bureaucracy forbade her from discussing Dr. Piot’s treatment, though he gave his permission. He is still under her care. Last week, a PET scan, CT scan and bronchoscopy showed that parts of his lungs have not completely cleared. “And,” he added, ever the universal health care booster, “tell your American audience: All these expensive tests are free from the N.H.S.”\n The steroids appear to be working, but taking them for too long can have side effects, including muscle wasting, weakening of bones and diabetes.\n  He may have to take anticoagulants for the rest of his life, he said, and parts of his lungs may permanently be scarred.\n “If you get this cytokine storm while you’re acutely ill, you’re finished,” he said. “But I had three stages — first fever, then needing oxygen, and now the storm.”\n “People think that, with Covid-19, 1 percent die and the rest just have flu. It’s not that simple — there’s this whole thing in the middle.”\n “All they say is, ‘Rest! Rest! Rest!’ That’s not my forté. Pushing me to sit on the beach is punishment.”\n “But I’m doing a little. I’m working with CEPI on vaccines,” he added, referring to the  Coalition for Epidemic Preparedness Innovations, an alliance formed in 2017 to create vaccines against new and even future diseases that traditional vaccine companies don’t invest in.\n “I’ve faced death,” he said. “In 1976, when we were drawing blood from patients, protective gear was a joke. And I escaped a helicopter accident. But this was different. I think facing death and surviving it is a good thing — it forces you to think about what is essential, who is essential.”\n “I’m now in Flemish what we call an ‘ervaringsdeskundige’ — an ‘experience expert.’ Someone who is put on an advisory panel not because you’ve studied a disease, but because you’ve lived it. That’s me. And now I’m thinking about what to do with the rest of my life.”", "posttime": "2020-05-27 05:04:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,virus,可能", "title": "病毒猎人瀑布是他低估的病毒的猎物", "title_en": "A Virus-Hunter Falls Prey To a Virus He Underestimated", "transed": 1, "url": "https://www.nytimes.com/2020/05/26/health/coronavirus-peter-piot.html?referringSource=articleShare", "via": "", "real_tags": ["病毒", "virus", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003841, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去，我们已经写过关于JavaScript的垃圾收集、文档对象模型(DOM)，以及如何在V8中实现和优化所有这些内容。不过，Chromium中并不是所有的东西都是JavaScript，因为嵌入了V8的浏览器及其Blink渲染引擎的大部分都是用C++编写的。JavaScript可用于与DOM交互，然后由呈现管道处理该DOM。因为DOM周围的C++对象图与Javascript对象纠缠在一起，Chromium团队在几年前就转而使用称为OilPan的垃圾收集器来管理这种内存。OilPan是一个用C++编写的垃圾收集器，用于管理C++内存，它可以使用跨组件跟踪连接到V8，跨组件跟踪将纠结的C++/JavaScript对象图视为一个堆。这篇文章是Oilpan一系列博客文章中的第一篇，这些文章将概述Oilpan语言及其C++API的核心原理。在这篇文章中，我们将介绍一些受支持的特性，解释它们如何与垃圾收集器的各个子系统交互，并深入研究在清扫器中并发回收对象。最令人兴奋的是，OilPan目前在Blink中实现，但将以垃圾收集库的形式迁移到V8。我们的目标是让所有V8嵌入者和更多的C++开发人员都可以轻松地使用C++垃圾回收。OilPan实现了标记-清除垃圾收集器，其中垃圾收集分为两个阶段：标记在哪里扫描托管堆中的活动对象，以及在哪里清理托管堆上的死对象被回收。在V8中引入并发标记时，我们已经介绍了标记的基础知识。简单地说，扫描所有对象中的活动对象可以看作是图的遍历，其中对象是节点，对象之间的指针是边。遍历从寄存器、本机执行堆栈(从现在起我们将称之为堆栈)和其他全局变量的根开始，如下所述。在这方面，C++与JavaScript没有什么不同。不过，与JavaScript不同的是，C++对象是静态类型的，因此不能在运行时更改其表示形式。使用OilPan管理的C++对象利用这一事实，并通过访问者模式提供指向其他对象(图中的边)的指针的描述。描述油底壳对象的基本模式如下：class final：public GarbageCollect&lt；LinkedNode&gt；{public：LinkedNode(LinkedNode*Next，int value)：Next_(Next)，value_(Value){}void Trace(Visitor*Visitor)const{Visitor-&gt；Trace(Next_)；}Private：Member&lt；LinkedNode&gt；Next_；int value_；}；LinkedNode*CreateNodes(){LinkedNode*First_Node=MakeGarbageCollect&lt；LinkedNode&&gt;(nullptr，1)；LinkedNode*Second_Node=MakeGarbageCollect&lt；LinkedNode&gt；(First_Node，2)；return Second_Node；}。\n在上面的示例中，LinkedNode由OilPan管理，如从GarbageCollect&lt；LinkedNode&gt；继承所示。当垃圾回收器处理对象时，它通过调用该对象的Trace方法来发现传出指针。类型成员是语法上类似于STD：：SHARED_PTR的智能指针，后者由Oilspan提供，用于在标记期间遍历图形时保持一致状态。所有这些都使OilPan能够精确地知道指针驻留在其托管对象中的什么位置。狂热的读者可能会注意到并且可能会害怕，在上面的示例中，first_node和Second_node被保留为堆栈上的原始C++指针。Oilspan不添加使用堆栈的抽象，仅依靠保守的堆栈扫描在处理根时查找指向其托管堆的指针。这是通过逐字迭代堆栈并将这些字解释为指向托管堆的指针来实现的。这意味着OilPan不会对访问堆栈分配的对象施加性能损失。相反，它将成本转移到垃圾收集时间，在那里它保守地扫描堆栈。集成在呈现器中的Oilpan会尝试延迟垃圾收集，直到它达到保证没有有趣堆栈的状态。由于Web是基于事件的，并且执行是由事件循环中的处理任务驱动的，因此这样的机会非常多。Blink是一个拥有大量成熟代码的大型C++代码库，因此也支持：通过混合和对此类混合(内部指针)的引用实现多重继承。在执行构造函数期间触发垃圾回收。通过被视为根的持久智能指针使非托管内存中的对象保持活动状态。覆盖顺序(例如，矢量)和关联(例如，集合和映射)容器的集合，具有集合背景的压缩。\n请继续关注另一篇博客文章，详细介绍油底锅打标的工作原理。对于这篇文章，我们", "note_en": "In the past we have  already  been  writing about garbage collection for JavaScript, the document object model (DOM), and how all of this is implemented and optimized in V8. Not everything in Chromium is JavaScript though, as most of the browser and its Blink rendering engine where V8 is embedded are written in C++. JavaScript can be used to interact with the DOM that is then processed by the rendering pipeline. Because the C++ object graph around the DOM is heavily tangled with Javascript objects, the Chromium team switched a couple of years ago to a garbage collector, called  Oilpan, for managing this kind of memory. Oilpan is a garbage collector written in C++ for managing C++ memory that can be connected to V8 using  cross-component tracing that treats the tangled C++/JavaScript object graph as one heap. This post is the first in a series of Oilpan blog posts which will provide an overview of the core principles of Oilpan and its C++ APIs. For this post we will cover some of the supported features, explain how they interact with various subsystems of the garbage collector, and do a deep dive into concurrently reclaiming objects in the sweeper. Most excitingly, Oilpan is currently implemented in Blink but moving to V8 in the form of a  garbage collection library. The goal is to make C++ garbage collection easily available for all V8 embedders and more C++ developers in general.  Oilpan implements a  Mark-Sweep garbage collector where garbage collection is split among two phases:  marking where the managed heap is scanned for live objects, and  sweeping where dead objects on the managed heap are reclaimed. We’ve covered the basics of marking already when introducing  concurrent marking in V8. To recap, scanning all objects for live ones can be seen as graph traversal where objects are nodes and pointers between objects are edges. Traversal starts at roots which are registers, native execution stack (which we will call stack from now on), and other globals, as described  here. C++ is not different to JavaScript in that aspect. In contrast to JavaScript though, C++ objects are statically typed and thus cannot change their representation at runtime. C++ objects managed using Oilpan leverage this fact and provide a description of pointers to other objects (edges in the graph) via visitor pattern. The basic pattern for describing Oilpan objects is the following: class   final  :  public GarbageCollected &lt;LinkedNode &gt;  {    public :    LinkedNode (LinkedNode * next ,  int value )  :  next_ (next ) ,  value_ (value )  { }    void  Trace (Visitor * visitor )  const  {   visitor -&gt; Trace (next_ ) ;    }    private :   Member &lt;LinkedNode &gt; next_ ;    int value_ ;   } ;    LinkedNode *  CreateNodes ( )  {   LinkedNode * first_node  = MakeGarbageCollected &lt;LinkedNode &gt; ( nullptr ,  1 ) ;   LinkedNode * second_node  = MakeGarbageCollected &lt;LinkedNode &gt; (first_node ,  2 ) ;    return second_node ;   }\n In the example above,  LinkedNode is managed by Oilpan as indicated by inheriting from  GarbageCollected&lt;LinkedNode&gt;. When the garbage collector processes an object it discovers outgoing pointers by invoking the  Trace method of the object. The type  Member is a smart pointer that is syntactically similar to e.g.  std::shared_ptr, which is provided by Oilpan and used to maintain a consistent state while traversing the graph during marking. All of this allows Oilpan to precisely know where pointers reside in its managed objects. Avid readers probably noticed  and may be scared that  first_node and  second_node are kept as raw C++ pointers on the stack in the example above. Oilpan does not add abstractions for working with the stack, relying solely on conservative stack scanning to find pointers into its managed heap when processing roots. This works by iterating the stack word-by-word and interpreting those words as pointers into the managed heap. This means that Oilpan does not impose a performance penalty for accessing stack-allocated objects. Instead, it moves the cost to the garbage collection time where it scans the stack conservatively. Oilpan as integrated in the renderer tries to delay garbage collection until it reaches a state where it’s guaranteed to have no interesting stack. Since the web is event based and execution is driven by processing tasks in event loops, such opportunities are plentiful. Oilpan is used in Blink which is a large C++ codebase with lots of mature code and thus also supports: Multiple inheritance through mixins and references to such mixins (interior pointers). Triggering garbage collection during executing constructors. Keeping objects alive from non-managed memory through  Persistent smart pointers which are treated as roots. Collections covering sequential (e.g. vector) and associative (e.g. set and map) containers with compaction of collection backings.\n  Stay tuned for a separate blog post on how marking in Oilpan works in detail. For this article we assume marking is done and Oilpan has discovered all reachable objects with the help of their  Trace methods. After marking all reachable objects have their mark bit set. Sweeping is now the phase where dead objects (those unreachable during marking) are reclaimed and their underlying memory is either returned to the operating system or made available for subsequent allocations. In the following we show how Oilpan’s sweeper works, both from a usage and constraint perspective, but also how it achieves high reclamation throughput. The sweeper finds dead objects by iterating the heap memory and checking the mark bits. In order to preserve the C++ semantics, the sweeper has to invoke the destructor of each dead object before freeing its memory. Non-trivial destructors are implemented as finalizers. From the programmer’s perspective, there is no defined order in which destructors are executed, as the iteration used by the sweeper does not consider construction order. This imposes a restriction that finalizers are not allowed to touch other on-heap objects. This is a common challenge for writing user-code that requires finalization order as managed languages generally do not support order in their finalization semantics (e.g. Java). Oilpan uses a Clang plugin that statically verifies, among many other things, that no heap objects are accessed during destruction of an object: class    :  public GarbageCollected &lt;GCed &gt;  {    public :    void  DoSomething ( ) ;    void  Trace (Visitor * visitor )  {   visitor -&gt; Trace (other_ ) ;    }    ~ GCed ( )  {   other_ -&gt; DoSomething ( ) ;  // error: Finalizer &#39;~GCed&#39; accesses    // potentially finalized field &#39;other_&#39;.    }    private :   Member &lt;GCed &gt; other_ ;   } ;\n For the curious: Oilpan provides pre-finalization callbacks for complex use cases that require access to the heap before objects are destroyed. Such callbacks impose more overhead than destructors on each garbage collection cycle though and are only used sparingly in Blink.  Now that we have covered the restrictions of destructors in a managed C++ environment, it is time to look at how Oilpan implements and optimizes the sweeping phase in more detail. Before diving into details it is important to recall how programs in general are executed on the web. Any execution, e.g., JavaScript programs but also garbage collection, is driven from the main thread by dispatching tasks in an  event loop. The renderer, much like other application environments, supports background tasks that run concurrently to the main thread to aid processing any main-thread work. Starting out simple, Oilpan originally implemented stop-the-world sweeping which ran as a part of the garbage collection finalization pause interrupting executing of the application on the main thread:  For applications with soft real-time constraints the determining factor when dealing with garbage collection is latency. Stop-the-world sweeping may induce a significant pause time resulting in user-visible application latency. As the next step to reduce latency, sweeping was made incremental:  With the incremental approach, sweeping is split up and delegated to additional main-thread tasks. In the best case, such tasks are executed completely in  idle time, avoiding interfering with any regular application execution. Internally, the sweeper divides work into smaller units based on a notion of pages. Pages can be in two interesting states:  to-be-swept pages that the sweeper still needs to process, and  already-swept pages that the sweeper already processed. Allocation only considers already-swept pages and will refill local allocation buffers (LABs) from free lists that maintain a list of available memory chunks. For getting memory from a free list the application will first try to find memory in already-swept pages, then try to help processing to-be-swept pages by inlining the sweeping algorithm into allocation, and only request new memory from the OS in case there is none. Oilpan has used incremental sweeping for years but as applications and their resulting object graphs grew bigger and bigger, sweeping started to impact application performance. To improve over incremental sweeping we started leveraging background tasks for concurrent reclamation of memory. There are two basic invariants used to rule out any data races between background tasks executing the sweeper and the application allocating new objects: The sweeper only processes dead memory which is by definition not reachable by the application. The application only allocates on already-swept pages which are by definition not being processed by the sweeper anymore.\n Both invariants ensure that there should be no contender for the object and its memory. Unfortunately, C++ heavily relies on destructors which are implemented as finalizers. Oilpan enforces finalizers to run on the main thread to assist developers and rule out data races within the application code itself. To solve this issue, Oilpan defers object finalization to the main thread. More concretely, whenever the concurrent sweeper runs into an object that has a finalizer (destructor), it pushes it onto a finalization queue that will be processed in a separate finalization phase, which is always executed on the main thread also running the application. The overall workflow with concurrent sweeping looks like this:  Since finalizers may require accessing all of the object’s payload, adding the corresponding memory to the free list is delayed till after executing the finalizer. If no finalizers are executed, the sweeper running on the background thread immediately adds the reclaimed memory to the free list.  Background sweeping has shipped in Chrome M78. Our  real-world benchmarking framework shows a reduction of main thread sweeping time by 25%-50% (42% on average). See a selected set of line items below.  The remainder of time spent on the main thread is for executing finalizers. There’s ongoing work on reducing finalizers for heavily-instantiated object types in Blink. The exciting part here is that all these optimizations are done in application code as sweeping will automatically adjust in the absence of finalizers. Stay tuned for more posts on C++ garbage collection in general and Oilpan library updates specifically as we move closer to a release that can be used by all users of V8.", "posttime": "2020-05-27 05:02:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,性能,performance,对象", "title": "面向C++·V8的高性能垃圾回收", "title_en": "High-performance garbage collection for C++ · V8", "transed": 1, "url": "https://v8.dev/blog/high-performance-cpp-gc", "via": "", "real_tags": ["c++", "性能", "对象"]}, {"category": "", "categoryclass": "", "imagename": "c52c7d632ee06179dfce56409eb006ee.png", "infoid": 1003840, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可靠性--他们的网络出现过几次故障。但自那以后，它们一直相当稳定。\n支持-他们非常了解客户的痛点。即使是他们的免费层支持也是有帮助的。\n他们从未扼杀过任何现有的服务。即使是不受欢迎的产品仍然存在，尽管不鼓励客户使用它们。\n计算成本-有时我觉得我们需要云经济学博士来计算AWS账单，特别是使用Lambda、API Gateway、Cloudwatch。\n使用奇怪名称或首字母缩写的服务太多。跟踪他们可能会变得很麻烦。", "note_en": "Reliability - There have been a few incidents where their network was down. But they have been quite stable since.\n   Support - They understand customer pain points very well. Even their free tier support is helpful.\n  They have never killed any existing service. Even deprecated ones are still around though customers are discouraged from using them.\n  Calculating costs - Sometimes I feel we need a PhD in Cloud Economics to calculate AWS bill especially with Lambda, API Gateway, Cloudwatch.\n Too many services with weird names or acronyms. Keeping track of them can become cumbersome.", "posttime": "2020-05-27 05:02:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,azure,客户", "title": "AWS VS Azure VS Google Cloud", "title_en": "AWS vs. Azure vs. Google Cloud", "transed": 1, "url": "https://dev.to/ben/aws-vs-azure-vs-google-cloud-4bn9", "via": "", "real_tags": ["google", "azure", "客户"]}, {"category": "", "categoryclass": "", "imagename": "1c71e21d17c4f25f3944e16358a79558.jpg", "infoid": 1003839, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "媒体亚马逊在周三的年度股东大会之前采取了积极行动-在至少8名仓库员工死于新冠肺炎之后，投资者计划在股东大会上要求公司解决工人安全问题-向当地新闻媒体推送一个包裹，以促进公司的健康和安全努力。\n虽然大多数电视新闻专业人士对将亚马逊提供的内容作为新闻播出的想法嗤之以鼻，但全国至少有11家电视台在他们的新闻广播中播放了某种形式的套餐。这个包-你可以在这里查看亚马逊提供给新闻台的脚本-是由亚马逊发言人托德·沃克(Todd Walker)制作的。只有一家电视台，托莱多ABC附属公司WTVG承认沃克是亚马逊的员工，而不是新闻记者，内容来自亚马逊。其他将亚马逊提供的内容作为新闻包播放的电视台包括：\n蓝田NBC旗下WVVA的新闻总监韦斯·阿姆斯特德(Wes Armstead)在回应有关该电视台为何播放该套餐的置评请求时告诉Courier，“我不知道这个套餐是由亚马逊提供的。”阿姆斯特德说，“我们会确保这种情况不会再发生。”\n其他电视台-以及亚马逊-的新闻总监在发布时间前没有回复记者的置评请求。一旦我们得到答复，我们会立即更新这篇报道。\n最新消息：亚马逊回应称，视频和脚本已发布给Business Wire，其他许多公司为媒体机构制作的内部内容也是如此。", "note_en": "Media    Amazon is taking proactive action ahead of Wednesday’s annual shareholders meeting—at which  investors plan on demanding the company address worker safety issues after at least eight warehouse employees have died of COVID-19—by pushing a package to local news outlets that promotes the corporation’s health and safety efforts.\n  While most TV news professionals have  scoffed at the idea of running Amazon-provided content as news, at least 11 stations across the country ran some form of the package on their news broadcasts. The package—you can view the script Amazon provided to news stations  here—was produced by Amazon spokesperson Todd Walker. Only one station, Toledo ABC affiliate WTVG, acknowledged that Walker was an Amazon employee, not a news reporter, and that the content had come from Amazon. Other stations that ran the Amazon-provided content as a news package include:\n  In response to a request for comment on why the station ran the package, Wes Armstead, news director of the Bluefield NBC affiliate WVVA, told  COURIER, “I was not aware the package was provided by Amazon.” Armstead said, “We’ll make sure it doesn’t happen again.”\n News directors of the other stations—and Amazon—did not respond to requests for comment by publication time. We’ll update the story as soon as we get a reply.\n UPDATE: Amazon responded by stating the video and script were published to Business Wire as are many other companies’ in-house produced content for media organizations.", "posttime": "2020-05-27 04:47:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,细分,tv", "title": "当地电视台推出了同样的亚马逊脚本细分市场", "title_en": "Local TV Stations Pushed the Same Amazon-Scripted Segment", "transed": 1, "url": "https://couriernewsroom.com/2020/05/26/11-local-tv-stations-that-pushed-amazon-scripted-segment/", "via": "", "real_tags": ["amazon", "亚马逊", "细分", "tv"]}, {"category": "", "categoryclass": "", "imagename": "620ee8052525b40436c16557e31ca7e6.jpg", "infoid": 1003838, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "3月中旬，随着世界上大部分人退回家中，名人助力的电子学习平台大师班开始注意到，遇到其广告的人往往会全程观看。\n正如该公司联合创始人亚伦·拉斯穆森(Aaron Rasmussen)解释的那样，这证明了该公司所谓的“预告片”的有效性--与管弦乐乐谱的起伏形成对比的光亮点，不仅是对其“在线教育可以是美丽的、可以是电影的”这一论点的表达，也是对著名已知数量的重新介绍。\n该公司首席营销官大卫·施里伯(David Schriber)表示：“如果有人看你的电影超过几秒钟，那就是一个巨大的胜利。”\n当然，诱人广告是一门科学。“它真的有一种形式，”拉斯穆森说，“通过一个笑话和一个积累，一个有时很痛苦的敏感时刻，然后与预告片的上升部分形成对比，让我们进入到，‘我是某某，这是我的大师班。’”他说，“这是一个敏感的时刻，有时是痛苦的，然后与预告片的上升部分形成反差，‘我是某某，这是我的大师班。’”\n拉斯穆森离开后创办了自己的电子学习公司Outlier，Master Class接受了他带头的整容方式。他说：“我想让它看起来像是你有一个漂亮的盒子来装一件珠宝，你打开盒子，在黑色天鹅绒里，假设有一对耳环。”“那只是两只耳环，但周围都是这样的华丽场面。”\nMaster Class成立于2015年，声称拥有鲍勃·伊格尔(Bob Iger)、安娜·温图尔(Anna Wintour)、鲁保罗(RuPaul)和塞雷娜·威廉姆斯(Serena Williams)，以及另外80名左右的艺术和工业巨头，他们都来自各自领域，在马丁·斯科塞斯(Martin Scorsese)的讲座中传授智慧和诀窍。马丁·斯科塞斯(Martin Scorsese)的讲座大约是一部电影的长度，正如你可能猜到的那样，他也在教授大师班。\n这一想法是为了赋予虚拟教育与HBO赋予三摄像机情景喜剧的威望相同的光泽，以及TED演讲给机场书籍带来的威望。现在，有些被俘虏的观众每月在该平台上花费的时间增加了两倍，一项名为“今日之日”(Today‘s The Day)的促销活动，以及上周宣布的又一笔1亿美元的私人投资，大师班抓住了这个时机。\n大师班结合了流媒体电视的制作价值(和成本)、名人的诱惑力和能言善辩的自我完善精神，旨在教授某些抽象概念--“创造力”、“自我表现”、“创业精神”--尽管有些课程涉及的是扑克或法式糕点基础等更多的经验主义追求。\n“我们的消费者在每个班级都抓住了这个比喻，”施里伯说。“如果托马斯·凯勒说的是烹饪，那他也是在教你生活。如果多丽丝·卡恩斯·古德温说的是领导力和总统历史，那她就是在教授生活。“。\n施里伯将上述消费者描述为“30多岁的人，他们渴望做更多的事情，他们对自己有职业生涯这一事实很敏感，他们不再接受结构化教育，他们甚至可能会因为同龄人对某些学科了解得更多而感到不安全。”\n去年夏天，当他辞去耐克负责全球品牌体验的副总裁一职，加入大师班团队时，他看到一家公司已经完善了社交媒体营销艺术，但其五花八门的教练组合“让我们拥有了50个不同的品牌”。\n因此，他试图简化教师招聘过程，这一过程更多地面向明星影响力，而不是学生。\n他发现，人们想要关于个人理财和谈判的课程。他说，这让大师班找到了一位“有点不太可能的讲师”：前联邦调查局人质谈判代表克里斯·沃斯(Chris Voss)，他的课程是今年最受关注的课程之一。该公司的一位发言人说，沃斯的课程是完成波比·布朗(Bobbi Brown)的化妆和美容课程的用户最常去的地方，而那些从斯蒂夫·库里(Steph Curry)的篮球课开始的用户最常选择观看戈登·拉姆齐(Gordon Ramsay)的下一个课程。\nMaster Class的另一位联合创始人、现任首席执行官大卫·罗吉尔(David Rogier)表示：“我认为过去10年发生的情况是，我们已经变成了多连字符。”“对我自己来说，我是一名企业家，但我也喜欢鱼缸，我喜欢徒步旅行，我喜欢拍照。”\n现在，大师班拒绝了10个人中有9个将自己标榜为潜在讲师的人。施里伯说，原因是“因为他们不是从业者。”\nMaster Class拒绝透露其教师是如何获得薪酬的，尽管有报道称，他们会收到一笔预付基本工资，以及出售给他们课程的订阅的收入份额。\n“对于我们的每一位讲师来说，”罗吉尔先生说，教授大师班的决定“来自于想要帮助人们的地方”。你和我们在一起永远赚不到那么多钱。如果你只做一份代言协议，你会赚很多钱。“。\n大师班的目标是大流行后的后代。施里伯说，“我们正在努力思考，我们的课程是一直存在的东西。”\n“有趣的是，不断有人进来，你知道，我们不得不雇佣大量的人，等等。他们会问，‘你们的四年计划是什么？’我会说，‘好吧，我来告诉你我们的百年计划是什么。我们会把它倒退到96年前，我们会回到前四年，但百年计划是，100年后，应该有一群人捕捉到世界上最伟大的知识--结晶它，传播它，这就是我的目标。但同时，100年后，我们今天制造的东西也应该经得起考验。他们应该当之无愧。所以当人们回过头来看，你知道，那个时代谁是最伟大的歌手？克里斯蒂娜·阿奎莱拉的名字会出现。我对音乐非常着迷，我从来没有亲眼见过这样的事情。她简直令人难以置信。嗯，令人惊讶的是，它会说：她试图传递她的知识，这里就是你可以看到的地方，“拉斯穆森说。\n普利策奖得主、总统传记作家多丽丝·卡恩斯·古德温(Doris Kearns Goodwin)开设的“领导力”课程得益于一定程度的临界距离，迪士尼董事长鲍勃·伊格尔(Bob Iger)或康泰纳仕(CondéNast)艺术总监兼“时尚”(Vogue)主编安娜·温图尔(Anna Wintour)就同一主题开设的课程更多地吸引了一种发生这种事情的房间里的偷窥狂，比如艾格回忆了他向史蒂夫·乔布斯(Steve Jobs)推荐迪士尼收购皮克斯(Pixar)的那一刻，或者温图尔相当可疑地透露，\n你在学习吗？还是你玩得很开心？这是罗吉尔先生完全拒绝的二进制。\n“我认为这是一个神话，我们得到了它，特别是在一开始，当我们开始这样做的时候，人们问我，你是受过教育的，还是娱乐的？”他回忆说。“我认为这是一个错误的选择。为什麽教育不能也是娱乐性的呢？“。\n如果说其他电子学习初创公司已经将自己定位为面对面教学的替代品，那么Master Class恰好位于教育学和娱乐学的交汇点上，利用其名人点名和极简主义的设计来培养用户和他们的教师之间的友好感。\n成立12年的非营利性教育机构可汗学院(Khan Academy)的创始人萨尔曼·汗(Salman Khan)也注意到今年的流量有所上升。但他将大师班的观众与他自己的观众区分开来。他说，“这将解决你的中上阶层或富裕”消费者的问题。“我们的宪章非常不同。我们希望创造最好的学习材料，让整个地球都能接触到。“\nUdemy for Business的总裁达伦·希姆库斯(Darren Shimkus)说，“这个领域有许许多多采取不同方法的参与者。”Udemy for Business是一家电子学习初创公司，号称拥有超过15万门预先录制的课程，由大约5.7万名志愿教师授课。就像可汗学院(Khan Academy)一样，该学院的教师和学生注册人数比正常情况下“高出5到10倍”，Udemy在今年早些时候经历了一场新的活动热潮。\n“这几乎就像是未来10年的变化和增长被压缩到大约一个月，”Shimkus先生说。“我们原本预计到2030年的变化，实际上我们现在正在看到，也就是2020年4月。”\n41岁的帕特里克·马汉(Patrick Mahan)在肯塔基州列克星敦拥有一家广告公司，他说，“这几乎就像是你坐在起居室里和这些人交谈，或者更像是单向交谈。”他第一次遇到大师班是在去年为父亲寻找圣诞礼物时。\n然后是Facebook和Twitter上的定向广告，这促使马汉购买了自己的订阅。“在过去的几年里，我一直在想，伙计，我很愿意做这件事，我只是希望我们有更多的时间。我想，有时候你得小心你的愿望。“。\n现在，经过两个多月的隔离，马汉发现自己“像Netflix一样”狂热地观看大师课程，至少部分原因是该节目似乎从这位流媒体重量级人物那里借来了眨眼和错过的间歇期。\n经营一家教育咨询公司的卡内莎·贝纳德(Kanesha Baynard)同样对该平台利用娱乐观看惯例的能力印象深刻。\n贝纳德第一次看到多产节目制作人尚达·里梅斯(Shonda Rhimes)的大师班广告是在电视编剧上。在加州洛斯阿尔托斯的家人的庇护下，这个项目已经成为缓刑和充实的来源。“如果我在做饭，我可以把它穿上，因为没有人想在我做饭的时候进厨房，因为他们不想帮忙，”她说。“这太棒了，因为这样我就可以看”大师班“了。”\n大师班的方法并不是没有怀疑者，他们想知道大师们是否不是自己能力的理想叙述者。(“我们不是大学的替代品，”罗吉尔告诉我。)\n“这些人不是老师，”科尔·斯特芬森(Cole Steffensen)说，他从事数字营销工作，同时追求单口喜剧演员的职业生涯。“这是一句可怕的谚语，不会做的人就是教书。但事实恰恰相反：在外面做事的人不一定就是好老师。“。\n今年早些时候，斯特芬森的母亲给了他一笔大师班的订阅费；隔离区为他提供了写作的机会，所以他参加了亚伦·索尔金(Aaron Sorkin)和大卫·塞达里斯(David Sedaris)授课的课程。他说：“对我来说，这感觉非常TedTalk-y，人们说了非常深刻的事情，但可能没有太多可行的步骤。”“你是大卫·塞达里斯，告诉我该对我的出版商说些什么。我没有出版商。“", "note_en": "In mid-March, as much of the world withdrew into their homes, the celebrity-powered e-learning platform MasterClass began to notice that people who encountered its advertisements were often watching them in full.\n This was a testament to the efficacy of what the company calls its “trailers” — glossy spots, set against the rise and fall of an orchestral score, that function as not only an expression of its thesis that “online education can be beautiful and cinematic,” as Aaron Rasmussen, a co-founder, explained, but also as reintroductions to illustrious known quantities.\n “For someone to watch your film for more than just a few seconds is a big victory,” said David Schriber, the company’s chief marketing officer.\n Of course, seductive advertising is a kind of science. “There really is a format to it,” said Mr. Rasmussen, “with a joke and a buildup, a sensitive moment that’s sometimes painful, then the contrast to the rising end of the trailer that brings us into, ‘I’m so-and-so, and this is my MasterClass.”\n While Mr. Rasmussen has since left to start his own e-learning company, Outlier, MasterClass has embraced the cosmetic approach he spearheaded. “I wanted it to look like when you have a beautiful box for a piece of jewelry, and you open the box and, in the black velvet, let’s say there’s a pair of earrings,” he said. “Those are only two earrings, but there’s all this sort of pomp and circumstance around it.”\n  Founded in 2015, MasterClass lays claim to Bob Iger, Anna Wintour, RuPaul and Serena Williams, plus another 80 or so other titans of art and industry, all of whom impart wisdom and know-how from their respective fields in lectures that run about the length of a film by Martin Scorsese, who, as you might have guessed, teaches a MasterClass, too.\n The idea is to accord virtual education the same sheen of prestige that HBO bestowed upon the three-camera sitcom and that TED Talks brought to the airport book. With a somewhat-captive audience now spending twice as many minutes each month on the platform; a  promotional campaign called “Today’s the Day”; and another $100 million in private investment announced last week, MasterClass has seized its moment.\n In combining the production value (and cost) of streaming television, the lure of celebrity and the silver-tongued spirit of self-improvement, MasterClass is oriented toward teaching certain abstract concepts — “creativity,” “self-expression,” “entrepreneurship” — even as some courses address more empirical pursuits like poker or the fundamentals of French pastries.\n “Our consumers seize the metaphor in every class,” said Mr. Schriber. “If Thomas Keller is talking about cooking, he’s also teaching you about life. If Doris Kearns Goodwin is talking about leadership and presidential history, she’s teaching about life.”\n  Mr. Schriber described the aforementioned consumer as a “30-something who aspires to do something more, who is sensitive to the fact that they have a career, they’re not in structured education anymore and they might even be feeling insecure that their peers know a little bit more about certain subjects.”\n When he left his post as Nike’s Vice President of Global Brand Experience to join the MasterClass team last summer, he saw a company that had perfected the art of social media marketing but whose variegated portfolio of instructors “made us 50 different brands.”\n  As a result, he sought to streamline the process of teacher recruitment, which had been geared more toward star power than student.\n The people, he found, wanted classes about personal finance and negotiation. This led MasterClass to a “somewhat unlikely instructor,” he said: The former FBI hostage negotiator Chris Voss, whose course has been one of the most-watched this year. A company spokesperson said Mr. Voss’s class was the most common destination for users who’ve completed Bobbi Brown’s course on makeup and beauty, while those who start with Steph Curry’s lesson in basketball most often elect to watch Gordon Ramsay next.\n “I think what’s happened over the last 10 years is we’ve become multi-hyphenate,” said David Rogier, MasterClass’s other co-founder and current chief executive. “For myself, I’m an entrepreneur, but I also love fish tanks and I love to hike and I take pictures.”\n   Now, MasterClass rejects nine out of 10 people who pitch themselves as potential instructors. The reason, Mr. Schriber said, “is that they’re not a practitioner.”\n  MasterClass declined to share how its instructors are compensated, though reports say they receive a base pay up front and a revenue share of subscriptions sold to their classes.\n “For every single one of our instructors,” Mr. Rogier said, the decision to teach a MasterClass “comes from a place of wanting to help people. You’re never going to earn as much money with us. You’re going to earn tons more if you just do an endorsement deal.”\n MasterClass is aiming for post-pandemic posterity. “We’re trying to think about our classes being something that’s here for all time,” Mr. Schriber said.\n “It’s funny, people kept coming in, and you know, we’re having to hire a ton of people, et cetera. And they would be like, ‘What’s your four-year plan?’ And I would say, ‘Well, I’ll tell you what our hundred-year plan is. And we’ll wind it back 96 years and we’ll get to the first four years, but the hundred year plan is, 100 years from now, there should be a group of people capturing the knowledge of the world’s greatest — crystallizing it, and disseminating it, that’s my goal. But also, 100 years from now, the things we make today should hold up. They should be worthy of that. So when people look back in time and say, you know, who is the greatest singer of that era? Christina Aguilera’s name is going to come up. I’m huge into music, and I’ve never seen anything like that in person. She’s just absolutely unbelievable. Well, what’s amazing is, it’ll say: And she tried to pass on her knowledge and here’s where you can see it,” Mr. Rasmussen said.\n  A class on the subject of “leadership” by the Pulitzer-winning presidential biographer Doris Kearns Goodwin benefits from some degree of critical distance, where courses on the same topic by Disney chairman Bob Iger or Condé Nast artistic director and Vogue editor Anna Wintour appeal more to a kind of in-the-room-where-it-happens voyeurism, such as Mr. Iger recounting the moment he pitched Steve Jobs on Disney acquiring Pixar, or when Ms. Wintour reveals, rather suspiciously, that she doesn’t notice the outfits of job applicants she interviews.\n Are you learning? Or are you having fun? It’s a binary Mr. Rogier rejects altogether.\n “I think there’s this myth and we got it, especially in the beginning, when we began this, people ask me, are you education, or are you entertainment?” he recalled. “I think that’s a false choice. Why can’t education also be entertaining?”\n If other e-learning start-ups have positioned themselves as alternatives to in-person schooling, MasterClass sits neatly at the intersection of pedagogy and entertainment, leveraging its celebrity roll call and minimalist design to foster a sense of amity between users and their instructors.\n Salman Khan, the founder of Khan Academy, the 12-year-old education nonprofit, also noticed an uptick in traffic this year. But he distinguishes the MasterClass audience from his own. “That’s going to solve your upper-middle class or affluent” consumer, he said. “Our charter is very different. We want to create the best learning materials that you can make accessible to the  entire planet.”\n “There are lots and lots of players in this space who take various approaches,” said Darren Shimkus, the president of Udemy for Business, an e-learning start-up which boasts over 150,000 prerecorded courses taught by some 57,000 voluntary instructors. Like Khan Academy, whose teacher and student registrations are “five to 10 times” greater than normal, Udemy is experiencing a new groundswell of activity in the early part of this year.\n “It’s almost like the next 10 years of change and growth is being compressed into about a month,” said Mr. Shimkus. “Change we would have expected by 2030 we’re actually seeing now, in April 2020.”\n “It’s almost like you’re sitting in your living room having a conversation with these people, or more of a one-way conversation,” said Patrick Mahan, 41, who owns an advertising agency in Lexington, Ky., and first encountered MasterClass when looking for a Christmas gift last year for his father.\n Then came the targeted advertisements on Facebook and Twitter, which drove Mr. Mahan to purchase his own subscription. “The last few years I’ve always been like, man, I would love to do this, I just wish we had more time. Sometimes you’ve got to be careful what you wish for, I guess.”\n Now, more than two months into quarantine, Mr. Mahan finds himself binge-watching Masterclasses “like Netflix,” owing at least in part to the blink-and-you-miss-it intervals between lessons the program appears to have borrowed from the streaming heavyweight.\n Kanesha Baynard, who runs an educational consulting business, was similarly impressed by the platform’s ability to exploit the conventions of recreational viewing.\n Ms. Baynard first encountered a MasterClass ad for the prolific showrunner Shonda Rhimes on TV writing. Sheltered with her family in Los Altos, Calif., the program has become a source of both reprieve and enrichment. “If I’m cooking dinner, I can put it on, because no one wants to come into the kitchen when I’m cooking because they don’t want to help,” she said. “Which is great, because then I can watch MasterClass.”\n The MasterClass approach is not without its skeptics, who wonder if the masters might not be ideal narrators of their own prowess. (“We are not a replacement for college,” Mr. Rogier told me.)\n “These people are not teachers,” said Cole Steffensen, who works in digital marketing while pursuing a career as a stand-up comic. “It’s that awful saying, people who can’t do, teach. But the opposite is also true: people who are out there doing stuff don’t necessarily make good teachers.”\n Earlier this year, Mr. Steffensen was gifted a MasterClass subscription by his mother; quarantine provided an occasion for him to work on his writing, so he took classes taught by Aaron Sorkin and David Sedaris. “It felt very TedTalk-y to me, with people saying really profound things, but maybe not a lot of actionable steps,” he said. “You’re David Sedaris, telling me what I should be saying to my publisher. I don’t  have a publisher.”", "posttime": "2020-05-27 04:46:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抓紧,seizing,课程", "title": "大师班正在抓紧时机", "title_en": "MasterClass is seizing its moment", "transed": 1, "url": "https://www.nytimes.com/2020/05/25/style/masterclass-secrets.html", "via": "", "real_tags": ["抓紧", "seizing", "课程"]}, {"category": "", "categoryclass": "", "imagename": "72539732323d2807d3961b9f798992dc.jpg", "infoid": 1003837, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面是这篇文章附带的阴影玩具的截图。单击以查看全尺寸。该阴影玩具可在以下网址找到：https://www.shadertoy.com/view/tsBBWW。\n当你看到一张照片真实感的图像，有人说它是“光线跟踪”的，他们的意思可能是它是“路径跟踪”的。\n路径跟踪可能需要相当多的数学运算，并且需要非常注意细节，但它可以生成一些非常棒的图像。\n不过，有趣的是。你可以扔掉很多形式主义，但仍然可以得到极好的结果。\n这是这一系列博客文章的前提。目标是让你进行路径跟踪，让你玩耍，享受乐趣，创作艺术，而不必担心积分，PDF和图形的存在问题：“圆周率还是不圆周率？”不幸的是，这意味着我们的图像可能需要更长的时间来渲染，并且可能并不完全“正确”，但是您可以在以后感兴趣的时候学习更复杂的技术。\n渲染是一项艺术和创造性的工作，所以现在让我们忽略一些细节。我们不是在制作地面真实感渲染器，我们只是在享受制作酷渲染的乐趣。\nShaderTool是一个网站，可以让你用一种类似c的语言编写叫做GLSL的小程序，这些小程序在你的GPU(而不是CPU)上为图像中的每个像素运行。ShaderToy使用WebGL，但会为您管理除像素着色器之外的所有内容。\n这些程序的输入非常有限，包括像素坐标、帧号、时间和鼠标位置，并且只给出一种颜色作为输出。\n尽管很简单，人们还是做了令人惊叹的事情，比如制作了一个可玩的末日级别1。\nShaderTool是由演示人员创建的，演示人员是那些举办聚会和竞赛的人，他们制作能产生令人印象深刻的音频和视觉效果的非常小的可执行文件。\n除了演示人员，shadertoy.com还经常有专业的和业余的游戏开发人员、图形研究人员、电影工作者以及其他各种各样的人光顾。\n这是一个很好的玩耍和学习的地方，因为它可以让你不用大惊小怪地潜入水中。我在那里学到的东西太多了，有时会让我难以置信。…。各种各样的数学技巧，图形技术，自动微分的双数，光线行进立体几何，我甚至在2013年做过实时光线跟踪。实时光线跟踪对世界来说似乎是新事物，但演示编剧正在对Comodore 64这样的设备进行实时光线跟踪，并且已经这样做了几年或几十年。我们其余的人只是在迎头赶上！\n在这些文章中，我们将在shadertoy中进行路径跟踪，因为这样做非常容易。你应该去那里，创建一个账户，四处看看一些阴影玩具。ShaderTool在Chrome或Firefox中效果最好。\n要开始，请在登录后，单击右上角的“新建”按钮以创建新的着色器。迎接您的应该是类似于以下内容的内容：\n继续为着色器命名-名称必须是全局唯一的！-以及至少一个标记和说明。所有这些都是必需的，以便您可以单击“提交”并对着色器执行初始保存。\n提交着色器后，提交按钮将变为保存按钮，您可以继续下一步。\n路径跟踪是光线跟踪的一种，这意味着我们将从每个像素向世界发射一条射线。对于每条单独的光线，我们将查看它击中了什么，并使用该信息为我们的像素赋予颜色。对每个像素独立地这样做，我们就可以得到最终的图像。\n因此，进行路径跟踪的第一步是计算每个像素的光线。光线有起点和方向，所以我们需要计算光线的起点和方向。\n光线将从相机位置开始(您可以将其视为眼睛位置)，它将拍摄相机前面一个假想矩形上的像素，穿过这些像素，然后进入场景，看看它们击中了什么。\n我们将使这个像素矩形在x和y轴上从-1到+1，现在我们将使它在z轴上有1个单位的距离。我们将假定摄影机位于原点(0，0，0)。我们的目标是计算每个像素在此矩形上的3D点，然后计算光线从原点到该3D点的方向。\n我们将首先计算每个像素在x和y轴上从0到1的百分比。我们将在红色和绿色通道中显示它，以确保我们做得正确。\n将下面的代码放在右侧的代码框中，然后单击播放按钮(屏幕截图中的红色圆圈)查看结果。\n从这张图中我们可以看到(0，0)在左下角，颜色是黑色。当像素向右移动时，它们会变得更红，这表明x轴向右移动。随着像素的增加，它们变得更绿，这表明y轴向上。\n像这样将值可视化是调试着色器玩具着色器的一种很好的方法。通常的图形调试器和调试技术在执行WebGL或使用shadertoy时不可用，因此如果您遇到问题，这种“printf”样式的调试是查看正在发生的事情的最佳方式。\n现在我们的屏幕百分比从0到1，我们希望将其从-1更改为1，这样它实际上只是虚构像素矩形上的x和y坐标。\n我们现在可以看到屏幕中间是黑色的，向右转会使像素变得更红，而向上则会使像素变得更绿。但是，向左和向下并不会改变颜色，只会使其保持黑色。这是因为颜色在显示之前被钳制到0到1之间，使得所有负数都只是零。\n如果你想要确保负值在那里，而且它真的不只是零，你可以把绝对值想象成这样。\n好的，现在我们有了射线目标在虚构像素矩形上的x，y位置。我们可以将z位置设为1，因为我们希望它离我们有1个单位的距离，这就为我们的光线提供了一个目标。现在，我们希望获得从相机位置(原点)到此光线目标的规格化向量。这就给了我们光线方向，我们可以可视化该光线，以验证它看起来是否合理。\n这有点微妙，但当你从屏幕中心向右移动时，像素变得更红，变成了紫色。当你从中心往上走，像素变得更绿，变得更蓝。这表明我们的射线方向似乎是合理的。当我们在x轴上向右移动时，归一化的射线方向也开始偏离直线，并且在x轴上指向更右、更正的方向。y轴和绿色也是如此。\n从中心向左向下移动，蓝色变暗，但由于x和y轴再次为负值，所以没有显示红色和绿色。\n如果您玩弄光线目标的z坐标，您可以通过移动虚构的像素矩形来放大或缩小相机，从而使光线方向或多或少发生明显的变化，但我们稍后会更多地讨论这一点。\n屏幕上几乎恒定的蓝色是由于光线方向的正z值。所有的光线都指向前方，这是我们所期待的。\n我们已经成功计算出射线的起始位置和方向，准备开始向世界发射射线了！\n接下来，我们想要使用这些光线来实际渲染一些几何体。要做到这一点，我们需要一些函数来告诉我们光线是否与形状相交，以及相交发生在光线的多远处。\n我们将使用函数“TestSphereTrace”和“TestQuadTrace”来处理光线相交和球体相交，以及光线相交和矩形相交(四边形)。很抱歉没有在这里以复制/粘贴的格式将它们放在帖子中。当我试图将它们放入代码块时，WordPress会出现故障，但它们在最终的着色器玩具中。\n您还可以找到其他光线与对象相交函数。我改编自Christer Ericson的书“实时碰撞检测”(https://www.amazon.com/Real-Time-Collision-Detection-Interactive-Technology/dp/1558607323)，)，如果你用谷歌搜索的话，网上有一堆。光线行进还可以用作光线与对象相交的数值方法，从而使您拥有更丰富的形状、无限重复的对象等。\n无论如何，我们将针对由多个对象组成的场景测试光线，并为每个对象赋予不同的颜色，而不是为每个像素的颜色使用光线方向。我们在GetColorForRay函数中执行此操作。\n我们在屏幕上看到了一些不错的东西，但在进行路径跟踪之前，我们还有很长的路要走。\n如果查看最终着色器玩具中的代码，则仅当光线与形状相交且相交距离比hitInfo.dist更近时，TestSphereTrace和TestQuadTrace才返回true。在第一次执行任何类型的光线跟踪(路径跟踪或其他类型)时，经常会犯的一个错误是接受光线击中的第一个对象，但实际上您希望测试所有对象并保留最接近的击中。\n如果只找到第一个命中，而不是最近的命中，那么蓝色球就会消失，因为灰色四边形的光线测试在蓝色球之前进行，即使它更远。\n您可能注意到，在最后一张图像中球体被拉伸。这是因为我们虚构的像素矩形是正方形(它在x和y轴上从-1到+1)，而我们呈现的图像不是正方形。这使得图像被水平拉伸。\n解决此问题的方法是在x轴上增大虚像素矩形，或者在y轴上缩小它，以便虚像素矩形上的宽度与高度的比率与我们渲染的图像中的宽度与高度之比相同。(=。我要缩小y轴。下面是要使用的新mainImage函数。添加了第10行到第12行来解决该问题。\n我之前说过，虚构的像素矩形将在1个单位之外，但如果我们将距离变小，就等同于缩小相机或增大视场。如果我们把距离调大，就相当于放大或缩小视场。\n结果是，像素矩形距离为1个单位时，您可以看到90度的视野。\n用于计算特定视场距离的公式位于下面新的mainImage函数的第7行，并在第11行使用。\n我们往前走时c_FOV Degrees是90度，但这里是120度。\n如果你把视野调得太宽，你会开始在边缘得到扭曲。这也是摄像机经历的一个深刻的话题，我们不会深入探讨，但我想确保你们知道这一点。通过将FOV设置为非常大的值(如360度或720度)，您可以获得一些真正有趣的渲染效果！\n现在我们可以向世界发射射线了，我们终于准备好进行一些路径跟踪了！\n要做着色，我们需要光源，而我们的光源将只是有发光的物体，也就是发光的物体。\n对于这篇文章，我们只做漫反射灯光着色，这意味着没有闪亮的反射。我们可能会在本系列的下一篇文章中做闪亮的反射，但现在我们只做漫反射。\n路径跟踪在此设置中的工作方式非常简单。我们将从黑色开始一个像素的颜色，从白色开始使用“吞吐量”颜色，然后我们将按照以下规则向世界发射一条射线：\n当光线击中对象时，会将发射*吞吐量添加到像素的颜色上。\n当光线击中物体时，吞吐量乘以物体的反照率，这会影响未来发射光的颜色。\n当光线击中对象时，光线将以随机方向反射，光线将继续(更多信息将在一秒钟内提供)。\n当光线未命中所有对象或达到N射线反弹时，我们将终止。(在该着色器玩具中n=8，但可以针对速度与正确性调整该值)。\n“吞吐量”的概念乍看起来可能很奇怪，但随着复杂性的增加，请考虑一下这些场景：\n一束光线打到一个白色的球上，反弹出来，然后打到一束白光上。像素应该是白色的，因为白色的球是由白光照亮的。\n一束光线打到一个红色的球上，反弹回来，然后打到同样的白光上。像素应该是红色的，因为红色的球是由白光照亮的。\n光线打到白色球上，反弹到红色球上，反弹到白光上。像素应该是红色的，因为白色的球是由白光点亮的红色球点亮的。\n当光线从曲面反弹时，该光线的所有未来照明都将乘以该曲面的颜色。\n这些简单的规则就是获得柔和阴影、反弹照明、环境光遮挡以及在路径跟踪器中“自动”显示您看到的所有其他很酷的东西所需的全部。\n我说光线随机反弹，但有两种不同的处理方法：\n在正常的正半球中随机反弹，然后用点乘以吞吐量(newRayDir，faceNormal)。这是漫反射照明的余弦θ术语。\n或者，在曲面法线的余弦加权半球方向上随机反弹。这对余弦θ项使用重要性抽样，是更好的方法。\n要做#2，我们所需要做的就是获得一个“球面上的随机点”(也称为随机单位向量)，将其添加到法线上，然后将结果规格化。这么简单真是太好了。\n您可能想知道如何在着色器中生成随机数。有很多方法可以处理它，但我们将如何做到这一点。\n首先，我们将根据像素位置和帧编号初始化当前像素的随机种子，以便每个像素获得不同的随机数，并使每个像素在每帧获得不同的随机数。\n然后，我们可以将这些函数放在mainImage函数之上，该函数接受rngState并对其进行修改，然后生成一个随机数。\n要实现我们前面描述的路径跟踪规则，我们将更改一些内容…。\n将光线与对象测试从GetColorForRay移动到名为TestSceneTrace的新函数中。这使我们可以将场景测试逻辑与我们将要执行的迭代反弹光线跟踪分开。\n添加反照率和发射矢量3到命中信息，并在我们与物体相交时设置这两个字段。这是对象材质数据。\n当我们运行着色器玩具时，我们看到了类似上面的东西，但是我们看到的特定点在每一帧周围移动，因为随着时间的推移是随机的。\n这可能看起来不太好，但我们现在真的很接近了。我们只需要让像素显示它们的平均值，而不是只显示单个值。\n为了平均像素值，我们需要使我们的着色器变成一个多过程着色器。\n第一步是再通过一次。单击“image”选项卡旁边的+号，然后选择“Buffer A”\n将所有内容从图像选项卡移动到BUF A选项卡。在图像选项卡中，为纹理“iChannel0”选择“Buffer A”，并将此代码放入以读取和显示缓冲区A中的像素。\n在“buf A”选项卡中，也为纹理“iChannel0”选择“Buffer A”，这样我们就可以从最后一帧读取缓冲区A的像素，以平均到当前帧的输出。现在我们只需在下面添加第27、28、29行，将所有像素平均在一起！\n经过5分钟的渲染，结果看起来相当嘈杂，像素太亮太裁剪了，这不是一个很好的场景，但实际上我们现在正在跟踪路径！你甚至可以看到一些整齐的灯光效果，比如你如何看到红色球旁边的墙上有一些红色，因为它反射了光线。球体也投射了一些好看的阴影。\n我们可以稍微清理一下场景，制作一些类似康奈尔盒子的东西，并在5分钟后完成渲染。\n现在，当光线错过场景并飞入空洞时，我们会停止光线跟踪，它隐含地表示场景外的空洞是黑色的。与其让我们的背景是黑色，不如让它成为一个环境。\n在“buf A”选项卡中，选择纹理iChannel1的森林立方体贴图，然后将第19行添加到下面的GetColorForRay()。\n在30秒内，它看起来和之前的5分钟渲染一样嘈杂。5分钟的渲染看起来非常糟糕，因为场景中既有非常暗的地方，也有非常亮的地方。场景中不同位置的照明条件越不相同，产生的噪波就越多。此外，较小的较亮的灯光会比较大的较暗的灯光产生更多的噪音。\n学习更复杂的路径跟踪技术(如直接光采样，也称为下一事件估计)会使这不是真的，但我们的目标是在此路径跟踪器中易于理解，而不是收敛速度。\n但是，您可能会注意到，在渲染场景时，shadertoy报告为60fps，这意味着场景渲染受到vsync的限制。如果可以，渲染速度将超过60fps，因此收敛速度会更快，但它不能。\n有一个用于Chrome的着色玩具插件，你可以安装它来帮助它，你可以告诉它每帧最多绘制64张图，这真的有助于它更快地收敛。我用的是一台使用了5年的游戏笔记本电脑，里面装有NVIDIA 980M GPU，我马上就得到了这个全屏渲染，它融合得相当好！单击它可以全屏查看。\n获得铬的着色玩具插件的另一种选择是每帧只为像素发射N条光线，并对其进行平均，然后将其放入平均缓冲区。这比使用多个着色器在一帧中传递N次效率更高，因为当在着色器内迭代时，对象位于内存、缓存等位置。这意味着您的图像将在相同的时间内收敛更多。\n制作这张图片的阴影玩具包含了本文讨论的所有内容，位于：https://www.shadertoy.com/view/tsBBWW。\n尝试使用路径跟踪器，创建不同的场景，并修改代码以获得其他视觉效果。\n如果你能做点什么，我很想看看！你可以在推特上找到我@Atrix256。\n在这个系列中，很快还会有3到4篇帖子，内容涉及各种主题，包括景深和波克、闪亮的反射、抗锯齿和雾/烟。我们甚至还不是sRGB正确的！这些东西会显着改善形象，所以敬请关注。\n彼得·雪莉的“一个周末的光线追踪”(现在是免费的pdf)https://www.realtimerendering.com/raytracing/Ray%20Tracing%20in%20a%20Weekend.pdf。\n不过，路径跟踪不一定只用于逼真的渲染。下面是我制作的蒸汽波风格的风格化路径跟踪着色器玩具。", "note_en": "Below is a screenshot of the shadertoy that goes with this post. Click to view full size. That shadertoy can be found at:  https://www.shadertoy.com/view/tsBBWW\n When you see a photorealistic image that someone says is “ray traced” what they likely mean is that it is “path traced”.\n Path tracing can be pretty heavy on math and require a lot of attention to detail, but it can make for some really great images.\n Funny thing though. You can throw out a lot of the formalism and still get superb results.\n That is the premise of this series of blog posts. The goal is to get you path tracing and to let you play around, have fun, create art, without having to worry about integrals, PDFs and the existential question of graphics: “To pi or not to pi?”. Unfortunately that means that our images may take longer to render, and may not be exactly “correct”, but you can learn the more complicated techniques later when and if you are interested.\n Rendering is an artistic and creative endeavor, so lets ignore some of the details for now. We are not making a ground truth renderer, we are just having fun making cool renderings.\n   Shadertoy is a website that lets you write small programs in a c-like language called GLSL which are ran for every pixel in an image, on your GPU (not CPU). Shadertoy uses WebGL but manages everything except the pixel shader(s) for you.\n These programs have very limited input including pixel coordinate, frame number, time, and mouse position, and give only a color as output.\n Despite the simplicity, people have done amazing things, like making a playable level of doom 1.\n    Shadertoy was founded by demosceners which are people that have parties &amp; competitions to make very small executables that generate impressive audio and visuals.\n Besides demosceners, shadertoy.com is frequented by professional and hobbyist game developers, graphics researchers, people who work in movies, and all sorts of other people as well.\n It’s a great place to play and learn because it lets you dive in without a lot of fuss. I have learned so much there it boggles my mind sometimes… all sorts of math tricks, graphics techniques, dual numbers for automatic differentiation, ray marching solid geometry, and I even did real time ray tracing back in 2013. Real time ray tracing may SEEM new to the world, but demo sceners are doing real time ray tracing on things like the comodore 64 and have been doing so for years or decades. The rest of us are just catching up!\n In these articles we are going to be doing path tracing in shadertoy because it’s very easy to do so. You should head over there, create an account and look around a bit at some of the shadertoys. Shadertoy works best in chrome or firefox.\n    To get started, after you log in, click on the “new” button in the upper right to create a new shader. You should be greeted by something that looks like this:\n  Go ahead and give the shader a name – the names must be globally unique! – as well as at least one tag, and a description. All of those are required so that you can click “Submit” and do the initial save for your shader.\n  After you have submitted your shader, the submit button will turn into a save button, and you will be good to go onto the next step.\n  Path tracing is a type of ray tracing, which means we are going to shoot a ray into the world out of every pixel. For each individual ray, we are going to see what it hits and use that information to give a color to our pixel. Doing that for every pixel independently gives us our final image.\n So, the first step to doing path tracing is to calculate the rays for each pixel. A ray has a starting point and a direction, so we are going to need to calculate where the ray starts, and what direction it is going in.\n The ray is going to start at the camera location (you could think of this as the eye location), and it’s going to shoot at pixels on an imaginary rectangle in front of the camera, go through those pixels, and go out into the scene to see what they hit.\n  We are going to make this rectangle of pixels be from -1 to +1 on the x and y axis, and for now we’ll make it be 1 unit away on the z axis. We’ll say the camera is at the origin (0,0,0). Our goal is to calculate the 3d point on this rectangle for each pixel, then calculate the direction of the ray from the origin to that 3d point.\n We’ll start by calculating each pixel’s percentage on the x and y axis from 0 to 1. We’ll show that in the red and green channel to make sure we are doing it correctly.\n Put this code below in the code box in the right and click the play button (circled red in the screenshot) to see the results.\n   We can see from this picture that (0,0) is in the lower left, where the color is black. As the pixels go to the right, they get more red, which shows us that the x axis goes to the right. As the pixels go up, they get more green, which shows us that the y axis goes upward.\n Visualizing values like this is a great way to debug shadertoy shaders. The usual graphics debuggers and debugging techniques are not available when doing webgl, or when using shadertoy, so this “printf” style debugging is the best way to see what’s going on if you are having problems.\n Now that we have screen percentage from 0 to 1, we want to change it to being from -1 to 1 so that it’s actually just the x and y coordinate on the imaginary pixel rectangle.\n   We can see now that it’s black in the middle of the screen, and going to the right makes the pixels more red while going up makes the pixels more green. However, going left and down doesn’t change the color at all and just leaves it black. This is because colors are clamped to be between 0 and 1 before being displayed, making all negative numbers just be zero.\n if you wanted to make sure the negative values were down there, and it really wasn’t just zero, you could visualize the absolute value like this.\n   Ok so now we have the x,y location of the ray target on the imaginary pixel rectangle. We can make the z location be 1 since we want it to be 1 unit away, and that gives us a target for our ray. We now want to get a NORMALIZED vector from the camera position (the origin) to this ray target. That gives us our ray direction and we can visualize that ray to verify that it looks somewhat reasonable.\n   it’s a little subtle, but as you go right from the center of the screen, the pixels get more red and become a purpleish color. As you go up from the center, the pixels get more green and become a little more teal. This shows us that our ray directions seem sensible. As we move right on the x axis, the normalized ray direction also starts deviating from straight ahead and points more to the right, more positively on the x axis. Similarly for the y axis and the green color.\n Going left and down from center, the blue gets darker, but no red and green show up due to the x and y axis being negative values again.\n If you play around with the z coordinate of the ray target, you can make the ray direction changes more or less obvious due to basically zooming in or out the camera by moving the imaginary pixel rectangle, but we’ll talk more about that in a little bit.\n The nearly constant blue color on the screen is due to the positive z value of the ray direction. All of the rays are aiming forward, which is what we’d expect.\n We have successfully calculated a ray starting position and direction, and are ready to start shooting rays into the world!\n  Next we want to use these rays to actually render some geometry. To do this we need functions that will tell us whether a ray intersects a shape or not, and how far down the ray the intersection happens.\n We are going to use the functions “TestSphereTrace” and “TestQuadTrace” for ray intersection vs sphere, and ray intersection vs rectangle (quad). Apologies for not having them in a copy/pastable format here in the post. WordPress malfunctions when I try to put them into a code block, but they are in the final shader toy.\n There are other ray vs object intersection functions that you can find. I adapted these from Christer Ericson’s book “Real-Time Collision Detection” ( https://www.amazon.com/Real-Time-Collision-Detection-Interactive-Technology/dp/1558607323), and there a bunch on the net if you google for them. Ray marching can also be used as a numerical method for ray vs object intersection, which lets you have much richer shapes, infinitely repeating objects, and more.\n Anyhow, instead of using the ray direction for the color for each pixel, we are going to test the ray against a scene made up of multiple objects, and give a different color to each object. We do that in the GetColorForRay function.\n   We see some things on the screen which is nice, but we have a ways to go yet before we are path tracing.\n If you look at the code in the final shadertoy, TestSphereTrace and TestQuadTrace only return true if the ray intersects with the shape AND the intersection distance is closer than hitInfo.dist. A common mistake to make when first doing any kind of raytracing (path tracing or other types) is to accept the first thing a ray hits, but you actually want to test all objects and keep whichever hit is closest.\n If you only kept the first hit found, not the closest hit, the blue ball would disappear, because the ray test for the grey quad comes before the blue ball, even though it’s farther away.\n   You probably noticed that the spheres were stretched in the last image. The reason for that is that our imaginary pixel rectangle is a square (it’s from -1 to +1 on the x and y axis), while the image we are rendering is not a square. That makes the image get stretched horizontally.\n The way to fix this is to either grow the imaginary pixel rectangle on the x axis, or shrink it on the y axis, so that the ratio of the width to the height is the same on the imaginary pixel rectangle as it is in our rendered image. I’m going to shrink the y axis. Here is the new mainImage function to use. Lines 10 through 12 were added to fix the problem.\n    I said before that the imaginary pixel rectangle would be 1 unit away, but if we make that distance smaller, it’s the same as zooming the camera out or increasing the field of view. If we make that distance larger, it’s the same as zooming the camera in or decreasing the field of view.\n It turns out that having the pixel rectangle be 1 unit away gives you a field of view of 90 degrees.\n The formula for calculating the distance for a specific field of view is on line 7 of the new mainImage function below and is used on line 11.\n  We are going to leave c_FOVDegrees at 90 degrees as we move forward, but here it is at 120 degrees\n  If you make the FOV too wide, you’ll start getting distortion at the edges. That’s a deep topic that cameras experience too that we won’t go into but I wanted to make sure you knew about that. You can get some real interesting renders by setting the FOV to really large values like 360 or 720 degrees!\n  Now that we can shoot rays into the world, we are finally ready to do some path tracing!\n To do shading we’ll need light sources, and our light sources will just be objects that have emissive lighting, aka glowing objects.\n For this post we are only going to do diffuse light shading, which means no shiny reflections. We’ll do shiny reflections probably in the very next post in this series, but for now we’ll just do diffuse.\n   How path tracing works in this setup is pretty simple. We’ll start out a pixel’s color at black, a “throughput” color at white, and we’ll shoot a ray out into the world, obeying the following rules:\n When a ray hits an object, emissive*throughput is added to the pixel’s color.\n When a ray hits an object, the throughput is multiplied by the object’s albedo, which affects the color of future emissive lights.\n When a ray hits an object, a ray will be reflected in a random direction and the ray will continue (more info in a sec)\n We will terminate when a ray misses all objects, or when N ray bounces have been reached. (N=8 in this shadertoy, but you can tune that value for speed vs correctness)\n  The concept of “throughput” might seem strange at first but think of these scenarios as they increase in complexity:\n A ray hits a white ball, bounces off and hits a white light. The pixel should be white, because the white ball is lit by white light.\n A ray hits a red ball, bounces off and hits the same white light. The pixel should be red because red ball is lit by white light.\n A ray hits a white ball, bounces off and hits a red ball, bounces off and hits a white light. The pixel should be red because the white ball is lit by the red ball being lit by the white light.\n When a ray bounces off a surface, all future lighting for that ray is multiplied by the color of that surface.\n These simple rules are all you need to get soft shadows, bounce lighting, ambient occlusion, and all the rest of the cool things you see show up “automagically” in path tracers.\n I said that the ray bounces off randomly but there are two different ways to handle this:\n Bounce randomly in the positive hemisphere of the normal and then multiply throughput by dot(newRayDir, surfaceNormal). This is the cosine theta term for diffuse lighting.\n Or, bounce randomly in a cosine weighted hemisphere direction of the surface normal. This uses importance sampling for the cosine theta term and is the better way to go.\n To do #2, all we need to do is get a “random point on sphere” (also known as a random unit vector), add it to the normal, and normalize the result. It’s nice how simple it is.\n You are probably wondering how to generate random numbers in a shader. There are many ways to handle it, but here’s how we are going to do it.\n First, we are going to initialize a random seed for the current pixel, based on pixel position and frame number, so that each pixel gets different random numbers, and also so that each pixel gets different random numbers each frame.\n   Then, we can toss these functions above our mainImage function, which take the rngState in, modify it, and generate a random number.\n  To implement the path tracing rules we previously described, we are going to change some things…\n Move the ray vs object tests from GetColorForRay into a new function called TestSceneTrace. This lets us separate the scene testing logic from the iterative bounce raytracing we are going to do.\n Add albedo and emissive vec3’s to hit info and set both fields whenever we intersect an object. This is the object material data.\n   When we run the shadertoy we see something like the above, but the specific dots we see move around each frame due to being random over time.\n This might not look great but we are really close now. We just need to make pixels show their average value instead of only a single value.\n  To average the pixel values We are going to need to make our shader into a multipass shader.\n The first step is to make another pass. Click the + sign next to the “image” tab and select “Buffer A”\n    Move everything from the image tab to the Buf A tab. In the image tab, select “Buffer A” for texture “iChannel0” and put this code in to read and show pixels from Buffer A.\n    In the “Buf A” tab, also select “Buffer A” for texture “iChannel0” so that we can read Buffer A’s pixel from last frame, to average into the current frame’s output. Now we just add lines 27, 28, 29 below to average all the pixels together!\n   After 5 minutes of rendering, the result looks pretty noisy, pixels are too bright and clip, and it isn’t a great scene, but we are in fact path tracing now! You can even see some neat lighting effects, like how you see some red on the wall next to the red ball, due to light reflecting off of it. The spheres are casting some nice looking shadows too.\n We can clean up the scene a little bit, make something like a cornell box and get this render after 5 minutes\n    Right now when a ray misses the scene and flies out into the void, we stop raytracing, which implicitly is saying that the void outside the scene is black. Instead of having our background be black, let’s have it be an environment.\n In the “Buf A” tab choose the forest cube map for texture iChannel1 and then add line 19 to GetColorForRay() below.\n     In 30 seconds it looks about as noisy as the previous 5 minute render did. The 5 minute render looks so much worse because the scene has both very dark places and very bright places. The more different the lighting conditions are in different places in a scene, the more noise you will have. Also, smaller brighter lights will cause more noise than larger dimmer lights.\n Learning more sophisticated path tracing techniques (like direct light sampling, also known as next event estimation) makes this not be true, but we are aiming for understandability in this path tracer, not convergence speed.\n But, you might notice that as your scene is rendering, shadertoy is reporting 60fps, meaning that the scene rendering is being limited by vsync. The rendering would go faster than 60fps if it could, and so would converge faster, but it can’t.\n There’s a shadertoy plugin for chrome that you can install to help this, and you can tell it to do up to 64 draws per frame, which really helps it converge more quickly. I’m on a ~5 year old gaming laptop with an nvidia 980m gpu in it, and I got this full screen render in a minute, which has converged pretty nicely! Click on it to view it full screen.\n   An alternative to getting the shadertoy plugin for chrome is to just shoot N rays out for the pixel each frame, and average them, before putting them into the averaged buffer. That is more efficient than doing the multiple shader passes N times a frame since things are in the memory cache etc when iterating inside the shader. That means your image will converge more in the same amount of time.\n  The shadertoy that made this image, that contains everything talked about in this post, is at:  https://www.shadertoy.com/view/tsBBWW\n Try playing around with the path tracer, making a different scene, and modifying the code for other visual effects.\n If you make something, I’d love to see it! You can find me on twitter at  @Atrix256\n There are going to be 3 or 4 more posts in this series that will be coming pretty quickly, on a variety of topics including depth of field and bokeh, shiny reflections, anti aliasing and fog/smoke. We also are not even sRGB correct yet! These things will improve the image significantly so stay tuned.\n  Peter Shirley’s “Ray Tracing in One Weekend” (now a free PDF)  https://www.realtimerendering.com/raytracing/Ray%20Tracing%20in%20a%20Weekend.pdf\n Path tracing doesn’t only have to be used for realistic rendering though. Below is a stylized path tracing shadertoy I made, in vaporwave style.", "posttime": "2020-05-27 04:46:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "摄影,着色,shadertoy,光线", "title": "休闲着色玩具路径跟踪1：基本摄影机，漫反射，发射", "title_en": "Casual Shadertoy Path Tracing 1: Basic Camera, Diffuse, Emissive", "transed": 1, "url": "https://blog.demofox.org/2020/05/25/casual-shadertoy-path-tracing-1-basic-camera-diffuse-emissive/", "via": "", "real_tags": ["摄影", "着色", "shadertoy", "光线"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1003836, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“每日斯多葛学派”最近的一篇文章讨论了听到坏消息的负面影响-比如海啸摧毁了一个村庄，或者在另一个国家发生了恐怖袭击。\n文章说，这些事件太可怕了，它们消耗了我们的注意力、同情和宁静。\n除了为受害者感到难过-担心同样的事情可能会发生在你身上-你没有能力产生积极的影响。听到这个消息只会让人分心。\n“但是，”你可能会争辩说，“新闻上的一切并不都是围绕悲剧展开的。”我要知道世界上发生了什么事！“。\n你最后一次看新闻并想“谢天谢地我看到了”是什么时候。让我去采取行动吧。“？\n如果是这样的话，你到底从新闻里得到了什么呢？严重吗？结果呢？当然不会被告知任何重要的事情。\n大多数时候，看新闻和看泽西海岸一样有用。你看它是为了关闭你的大脑和主线的愤怒。\n如果你想把你的空闲时间花在看新闻上，那也没问题。我不是要你永远关掉它。但不要自欺欺人-看新闻是一种休闲活动，而不是一种富有成效的追求。\n我过去几乎每晚都收看电视节目。我会看财经新闻，然后转到一家主要的电视网，然后在晚上剩下的时间里让谈话负责人在背景中播放。\n但在2016年大选周期的某个时候，我注意到我总是对福克斯新闻(Fox News)或CNN上看到的东西感到不安。所以我关掉了它，眼睁睁地看着自己的幸福感大大增加。\n我再也不坐下来看新闻了。在我的公寓里从来没有开过(我甚至没有有线电视)。我很少看新闻网站，也不听脱口秀节目。我已经两年多没有看到任何负面后果了！\n如果你决定不看新闻，你会有很多空闲时间。这里有四个信息来源，它们可以有效地利用你的时间，不会让你的血压飙升。\n书籍要想继续出版，就必须卖出几本。要想持续销售不变的东西的拷贝，那东西必须非常好。\n每日新闻会用毫无意义的细节让你应接不暇，比如总统的疯狂推文，或者女王在皇室婚礼上穿的衣服-传记中不包括这种胡言乱语。\n它们不可能包罗万象，这对读者是有利的。\n挑选一位你想了解的历史人物，并阅读他或她的传记。它可以是一位总统(或第一夫人)，一位商业偶像，一名运动员-基本上任何你感兴趣的人。\n我最喜欢的两本传记是沃尔特·艾萨克森的“本杰明·富兰克林：美国生活”和罗恩·切尔诺的“泰坦”。\n历史背景。不描述当时世界上正在发生的事情，很难讲出一个人的故事。\n这些信息具有广泛的适用性。你将在生活中面临挑战。了解一个成功人士是如何应对类似挑战的是一个有用的工具。\n从历史中吸取的教训也可以广泛应用于当前的事件。了解不同情况是如何发展的(选举、战争、经济衰退、公共卫生问题、技术发展等)。帮助您今天做出更明智的决策。而且，当历史事件适用于某个特定的人时，阅读这些事件会变得更加有趣.。\n如果你把每晚一小时的新闻换成一小时的传记阅读，一年之内你会读很多传记。你也不会体验到肖恩·汉尼提或雷切尔·麦道引起的愤怒。\n如果你想把晚上的时间都花在看电视上，用纪录片代替新闻总是一个不错的选择。\n一小时的新闻节目将涵盖十个不同的主题，而一部纪录片通常会更深入地探讨一个主题。\n花6分钟在10个不同的科目上意味着你可能什么都没学到。但是，将注意力集中在一个主题上一个小时意味着你可能会带着一些有用的信息离开。\n与传记相比，纪录片更具争议性，可能会激怒你。但它们与新闻的不同之处在于，在你按下Play之前，你对你得到的是什么有一个像样的想法。\n你可以把会让你热血沸腾的纪录片传下去。但新闻报道的火力很猛，往往太快了，你躲不开。\n你可能还会在地铁前度过夜晚，但看一部纪录片可能会对你有帮助：\n计划好你的下一次假期。看看美国国家公园的自由单人或肯·伯恩斯系列。\n了解历史或任何新话题。看看“战争迷雾”或“寿司二郎之梦”吧。\n学习新话题可以提高你的情景适应能力--这是你下次参加社交活动时更多的谈话武器。\n听别人的故事会增加你的智力谦逊--这是一种让世界变得更美好的品质。\n适应性和智力谦逊都是自我完善的关键。这些品质都不是通过看新闻培养出来的。\n我的许多谈话都转向时事。我利用这些对话作为一个漏斗，将我的时间集中在重要的问题上。\n普通人不会告诉你他们在福克斯新闻或CNN上听到的一切。\n如果你克制住不看新闻，你就可以有效地利用其他所有人作为你的时事废话过滤器。\n然后，你可以对他们提到的主题做一些有针对性的(希望是客观的)研究，并决定是否值得进一步关注，也许最终会得出一个意见。\n如果有一件事是我们中太多人忘记的，那就是你不需要有自己的观点。你可以说，“我对此知之甚少，而且我真的不在乎。”\n好吧，我承认这是在调情，但这是我的建议。\n每周一次--可能是在周六或周日--拿一份当地报纸。\n跳过任何与国际或国内新闻相关的内容(出于上面列出的原因)，直接阅读与你所在社区相关的文章。\n也许有开发商提议建造一个会扰乱当地生态系统的小区。这可能会激怒你，但不同的是你可以做些什么。\n通过阅读这篇文章，你可以了解到镇议会会议讨论这一问题的日期、时间和地点，你可以参加。这是有目的的愤怒，而不是为了愤怒而愤怒。\n或者你可以找到一篇关于当地一户人家在火灾中失去房屋的文章。这是一场多么可怕的灾难，可能会让你心痛。但这与听说海啸摧毁了数千英里外的一个村庄是不同的。\n这篇文章可能会告诉你如何帮助你。它可能会告诉你去哪里给家人放衣服或玩具。它甚至可能会告诉你这家人是谁，让你有机会给他们做一顿晚餐，或者给他们提供一个住宿的地方。\n地方新闻可以抓住新闻应该是什么的精髓-信息性、可操作性和简洁性。它应该是有用信息的震撼，而不是持续不断的混乱。\n并不是所有的新闻都是无用的。并不是所有的新闻都会滋生愤怒和仇恨。但是，技术带来的持续不断的新闻循环需要一个即使是警方审讯员也可能缺乏的狗屎过滤器。\n消费信息的目的是让你有所行动--不管这些是具体的指示，还是仅仅是未来决策的框架。\n目前的新闻并没有勾选那个框。从别处获取您的信息。远离有意识的无意识。", "note_en": "A recent passage in  The Daily Stoic discussed the negative impact of hearing bad news – something like a tsunami destroying a village, or a terrorist attack in another country.\n These events are terrible, said the passage, and they consume our attention, sympathy, and serenity.\n  Aside from feeling bad for the victims –and worrying the same thing might happen to you – you’re powerless to make a positive impact. Hearing the news is merely a distraction.\n “But,” you might argue, “everything on the news doesn’t revolve around tragedies. I need to know what’s going on in the world!”\n  When was the last time you watched the news and thought, “ thank God I saw that. Let me go take action.”?\n  If that’s the case, what’re you actually getting from the news? Aggravated? Wound up?  Certainly not informed about anything important.\n Most of the time, watching the news is as useful as watching The Jersey Shore. You’re watching it to turn off your brain and mainline outrage.\n It’s fine if you want to spend your free time watching the news. I’m not telling you to shut it off forever. But don’t fool yourself –   watching the news is a leisure activity, not    a productive pursuit  .\n I used to tune in almost every night. I would watch financial news then flip to one of the major networks and have the talking heads playing in the background the rest of the evening.\n But sometime during the 2016 election cycle, I noticed I was always wound up about something I saw on Fox News or CNN. So I turned it off and watched my well-being increase tremendously.\n I  never sit down to watch the news anymore. It’s  never on in my apartment (I don’t even have cable). I rarely read news websites, and I don’t listen to talk shows. And I haven’t seen one negative consequence in more than two years!\n If you decide to stop watching the news,you’ll have a lot of free time. Here are four information sources that   are a productive use of your time and won’t send your blood pressure skyrocketing.\n  For books to remain in print, they have to sell copies. To continuously sell copies of something that doesn’t change, that thing has to be pretty damn good.\n Where the daily news will overwhelm you with pointless details –  like the president’s crazy tweets, or what the queen wore to the royal wedding –biographies don’t include this fluff.\n They simply can’t include everything, and that is to the reader’s benefit.\n Pick a historical figure you want to learn about and read his or her biography. It could be a president (or first lady), a business icon, an athlete – basically anyone you find interesting.\n Two of my favorite biographies were  Benjamin Franklin: An American Life by Walter Isaacson, and  Titan by Ron Chernow.\n  Historical context. It’s hard to tell a story about a person without describing what was happening in the world at that time.\n This information is broadly applicable. You will face challenges in life. Knowing how a successful person approached similar challenges is a useful tool.\n Lessons from history can also be broadly applied to present events. Knowing how different situations developed(elections, wars, economic downturns, public health issues, technology development, etc.) helps you to make better informed decisions today. And it’soften more interesting to read about historical events as they applied to a specific person.\n If you swap one hour of news every night for  one hour of biography reading, you’ll read a lot of biographies in a year. And you won’t experience the feeling of outrage induced by Sean Hannity or Rachel Maddow.\n  If you want to spend your evening watching TV, replacing the news with a documentary is always a good choice.\n Where a one-hour news program will cover ten different topics, a documentary usually dives deeper into one.\n Six minutes spent on ten unique subjects means you probably didn’t learn anything. But one hour of focused attention on a single subject means you’ll probably walk away with some useful information.\n More so than a biography, documentaries can be controversial and may aggravate you. But they differ from the news in that you have a decent idea of what you’re getting before you press play.\n You can pass on the documentaries that will boil your blood.   But the news shoots aggravation in rapid fire, often too quick for you to dodge.\n You might still be spending your evening in front of the tube, but watching a documentary could help you:\n Plan your next vacation. Check out  Free Solo or the  Ken Burns series on the US National Parks.\n  Learn about history or any new topic. Check out  The Fog of War or  Jiro Dreams of Sushi.\n Learning about new topics increases your  situational adaptability - it’s more conversation ammo at your next social event.\n Hearing other people&#39;s stories increases your   intellectual humility – a quality that makes the world a better place.\n Both adaptability and intellectual humility are crucial for self-improvement. Neither of those qualities are developed by watching the news.\n  Many of my conversations drift toward current events. I use these conversations as a funnel to focus my time on important issues.\n Normal people won’t give you a rundown of everything they heard on Fox News or CNN.\n  If you refrain from watching the news, you can effectively use everyone else as your current events bullshit filter.\n Then you can do some focused ( hopefully objective) research on the topics they mention and decide if it warrants further attention, and maybe eventually an opinion.\n If there’s one thing that too many of us forget, it’s that you aren’t required to have an opinion. It’s perfectly fine to say, “I don’t know enough about it, and I really don’t care to.”\n  Okay I admit this is flirting with the line, but here’s what I recommend.\n Once a week – probably on Saturday or Sunday – pick up a copy of your local newspaper.\n Skip past anything related to world or national news ( for reasons listed above).Go straight to the articles that pertain to your community.\n Maybe a developer is proposing building a subdivision that will disrupt the local ecosystem.   This might outrage you, but the difference is you can do something about it.\n By reading the article, you can learn the date, time, and location of the town council meeting to discuss the issue, and you can attend.  It’s outrage with a purpose, not outrage for the sake of outrage.\n Or maybe you find an article about a local family who lost their house in a fire. What a terrible disaster this is, and it probably pains your heart. But it&#39;s different from hearing about the tsunami destroying a village thousands of miles away.\n The article will probably tell you how to help. It might tell you where to drop off clothing or toys for the family. It might even tell you who the family is, giving you the opportunity to make them a dinner or offer them a place to stay.\n Local news can capture the essence of what news should be – informative, actionable, and brief. It should be a jolt of useful information, not a constant drip of chaos.\n  All news isn’t useless. All news doesn’t breed anger and hate. But the constant news cycle enabled and perpetuated by technology requires a bull shit filter that even a police interrogator may lack.\n The purpose of consuming information is to give you something to act upon – whether those are concrete instructions or  simply a framework for making future decisions.\n The news as it stands doesn’t check that box. Get your information elsewhere.   Move away from the conscious unconscious.", "posttime": "2020-05-27 04:45:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "新闻,watching", "title": "别再看新闻了", "title_en": "Stop Watching the News", "transed": 1, "url": "https://josephcwells.com/blog/better-than-news", "via": "", "real_tags": ["新闻", "watching"]}, {"category": "", "categoryclass": "", "imagename": "9b6bb24edcdf01aa22b9cbbb8f8b0ec7.jpg", "infoid": 1003835, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌(Google)首席执行官桑达尔·皮查伊(Sundar Pichai)周二告诉员工，这家搜索巨头的目标是在7月6日重新开放办公室，供想要亲自回来的员工使用。他说，回报将是渐进的，从10%左右的产能建设开始。该公司的目标是在9月份之前将产能提高到30%。\n皮查伊表示，对于那些希望继续在家工作的人，公司将允许员工花费高达1000美元购买设备和家具，如站立式办公桌和显示器。\n谷歌对员工重返工作场所的呼声更高，而其他科技巨头则在兜售永久的远程办公选择。就在皮查伊对员工发表上述言论的几天前，Facebook首席执行官马克·扎克伯格表示，这家社交网络巨头将允许一些员工永久在家工作。他表示，在未来5到10年内，Facebook大约一半的员工可能会在异地工作。推特本月早些时候也发布了类似的声明。首席执行长杰克·多尔西(Jack Dorsey)上周也将这一政策范围扩大到了他的另一家公司-移动支付公司Square。\n有关远程办公政策的讨论突显出，在新型冠状病毒迫使全球办公室史无前例地关闭之后，全球最大的科技公司正在重新评估自己的业务方式。皮查伊此前曾表示，大多数员工将在2020年剩余的时间里远程工作。\n谷歌正在进行大规模的办公室扩张，包括对其位于加利福尼亚州山景城的本已庞大的总部进行重大扩建。该公司还在加州圣何塞投资一个大型校园，并在纽约市投资一座翻新的建筑。皮查伊上周告诉“连线”杂志，远程工作不会影响这些项目。\n在所有情况下，我都希望我们需要物理空间将人们聚集在一起，绝对是这样。他表示：我们未来有很多增长计划。因此，即使有一些路线修正，我认为我们现有的足迹也不会是问题所在。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "Google CEO Sundar Pichai told employees Tuesday that the search giant is targeting July 6 to reopen offices for workers that want to come back to in person. The return will be gradual, starting at about 10% building capacity, he said. The company aims to ramp up to 30% capacity by September.\n For people who want to continue working from home, Pichai said the company will allow employees to expense up to $1,000 for equipment and furniture, such as standing desks and monitors.\n Google has been more vocal about employees returning to the workplace while other tech giants have touted permanent telecommuting options. Pichai&#39;s remarks to staff come days after Facebook CEO  Mark Zuckerberg said the social networking giant will allow some employees to  work from home permanently. He said about half of Facebook&#39;s workforce could be remote over the next five to 10 years. Twitter made a  similar announcement earlier this month. CEO  Jack Dorsey also  extended the policy to his other company, mobile-payments firm Square, last week.\n The discussion of remote-working policies underscores how the world&#39;s largest tech companies are reevaluating their approach to business after  the novel coronavirus forced unprecedented office shutdowns across the globe. Pichai had previously said most employees will work remotely for the rest of 2020.\n Google is in the midst of big office expansions, including major additions to its already sprawling headquarters in Mountain View, California. The company is also investing in a large campus in San Jose, California, and a renovated building in New York City. Pichai  told Wired last week that remote working won&#39;t impact those projects.\n &#34;In all scenarios I expect us to need physical spaces to get people together, absolutely. We have a lot of growth planned ahead,&#34; he said. &#34;So even if there is some course correction, I don&#39;t think our existing footprint is going to be the issue.&#34;\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-27 04:45:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,开放,reopening,员工", "title": "谷歌将于7月6日开始重新开放办公室", "title_en": "Google to begin reopening offices July 6", "transed": 1, "url": "https://www.cnet.com/news/google-to-begin-reopening-offices-july-6-will-let-employees-expense-1000-for-equipment-while-telecommuting/", "via": "", "real_tags": ["google", "谷歌", "开放", "reopening", "员工"]}, {"category": "", "categoryclass": "", "imagename": "e0909cd72b4c4e528e967191fa9a5468.jpg", "infoid": 1003834, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前Windows部门负责人Steven Sinofsky为微软在20世纪90年代和21世纪初对开源的战争提供了一些背景和辩护。\n针对有关微软总裁兼首席法律顾问布拉德·史密斯(Brad Smith)承认其公司对开源的攻击已将其置于历史错误一边的新闻报道，辛诺夫斯基发布了一系列推文作为回应。\n捕捉到微软以前的开源方法的最著名的引言来自微软前首席执行官史蒂夫·鲍尔默(Steve Ballmer)。\n在谈到开源许可时，鲍尔默在2001年将Linux称为毒瘤，而微软联合创始人比尔·盖茨则表示，GPL(GNU通用公共许可证)吞噬了像Pac-Man这样的专有软件。\n在微软将SQL Server移植到Linux后，鲍尔默表示，他不再将Linux视为癌症，但他坚称，他的类比在当时是正确的，与开源开战让微软赚了一大笔钱。\n史密斯是微软(Microsoft)反开源战争期间的顶级律师，他承认微软错了，但表示现在已经改变了。他指出，微软收购了GitHub，并在代码共享网站上开展了开源活动。\n辛诺夫斯基有一本全新的新书，详细描述了微软在监管Windows和Office期间遇到的反垄断和安全问题。现在，辛诺夫斯基试图围绕微软的新态度及其对开源的旧敌意进行一些背景分析。\n随着微软的关注点从Windows PC转移到云中的Azure和Office，微软如今已经拥护开源。但辛诺夫斯基列举了微软当时的做法可以理解的原因，以及它的模式是如何在1999-2000年被软件即服务(Software-as-a-service)颠覆的，Linux比Windows更适合软件即服务，后来谷歌的基础设施也更适合这种模式。\n辛诺夫斯基对微软的辩护充实了盖茨在2001年对GPL的解释，即GPL使得商业公司不可能使用任何一项工作，也不可能在任何一项工作的基础上再接再厉。\n辛诺夫斯基说，微软是建立在软件是知识产权的原则上的，对微软、IBM、谷歌和苹果采用的各种软件和硬件方法进行了区分。\n他提到了Basic编程语言和Altair Basic解释器，这是比尔·盖茨和微软联合创始人保罗·艾伦在20世纪70年代为业余爱好者在裸机上编程而开发的第一款产品。顺便说一句，微软上周将1983年的GW-Basic解释器作为历史软件产品开源。\n辛诺夫斯基写道，微软成立时，时代不同。没有网络分发。事实上，分发软件是要花钱的，他说，他指的是与谷歌在云中分发广告支持软件的方式相比，分发软件的额外成本，苹果如何将其软件与硬件捆绑在一起，以及IBM如何将其软件与咨询费结合起来。\n在微软成立初期，盖茨和艾伦迎合的是购买DIY硬件的业余爱好者，就像今天的开发人员购买Raspberry Pi和类似的运行在基于Linux的免费操作系统的单板电脑一样。\n业余爱好者喜欢它。他们非常喜欢它，愿意免费互相寄送磁带(纸带)。那就是著名的公开信写成的时候，辛诺夫斯基写道。\n1976年，盖茨写了一封愤怒的信给计算机爱好者，指责他们窃取了Altair Basic，并抱怨说经销商在赚钱，而微软没有。\n硬件必须付费，但软件是可以共享的。盖茨写道，谁会在乎从事这项工作的人是否能拿到钱呢？\n这位未来的亿万富翁慈善家当时梦想着微软能盈利，他抱怨说，他和艾伦花在创建特定于芯片的Basic迭代上的时间达到了4万美元-但到目前为止，微软收到的版税不到每小时2美元。\n什么样的业余爱好者可以花三个工年来编程，找出所有的错误，记录他的产品，然后免费分发呢？事实是，除了我们之外，没有人在业余爱好软件上投入大量资金。我们已经编写了6900个BASIC，并且正在编写8080个APL和6800个APL，但是几乎没有动力将这个软件提供给业余爱好者。最直接的是，你做的事情是偷窃。\n辛诺夫斯基认为，自由开放源码软件(FOSS)对微软的打击最大的是服务器上的Linux。\n首先，Linux只是在互联网上做了很多WinNT没有做的事情(几乎所有人都说现在仍然没有)。他写道，运行成本更低，可伸缩性更好。\n在某种程度上，商业客户并不关注成本，而是更愿意与公司打交道。这就解释了2000年来企业Windows服务器的兴起。本质上，客户表示，如果他们要在服务器上安装软件，他们更愿意付费。\n在那之后，谷歌出现了在自己的数据中心运行开放源码代码，而没有重新分发自由/开源软件。\n正是这一点颠覆了竞争格局，让微软无能为力。微软的业务是以分发软件为基础的。所有的开源许可证都是为了说明这一点而编写的。如果您使用[软件]并分发，那么您分发了*一切*。&#34；\n今天，有一种蓬勃发展的模式，即[公司]以谷歌的方式使用开源，或者在一个项目的基础上创建[业务]，维持与OSS的关系。但是，要理解心意的改变，应该在创造了最初的观点并允许改变的背景下这样做。", "note_en": "Former Windows Division chief Steven Sinofsky has offered some context and a defense for Microsoft&#39;s war on open source in the 1990s and early 2000s.\n Sinofsky has fired off a  series of tweets in response to news reports about Microsoft president and chief legal counsel Brad Smith&#39;s  admission that his company&#39;s attack on open source had put it on the &#34;wrong side of history&#34;.\n    The most famous quote capturing Microsoft&#39;s previous approach to open source was from former Microsoft CEO Steve Ballmer.\n Referring to open-source licensing, Ballmer in 2001 called Linux a &#34;cancer&#34; while Microsoft co-founder Bill Gates said the GPL (GNU General Public License)  gobbled up proprietary software like Pac-Man.\n After Microsoft ported SQL Server to Linux, Ballmer  said he no longer saw Linux as a cancer, but he maintains his analogy was right for the time and that going to war with open source made Microsoft a &#34;ton of money&#34;.\n   Smith, a top lawyer at Microsoft during its war on open source, admitted the company was wrong but said it had now changed, pointing to its acquisition of GitHub and the company&#39;s open-source activities on the code-sharing site.\n Now Sinofsky, who has a  new book detailing Microsoft&#39;s antitrust and security problems during his years overseeing Windows and Office, has attempted to put some context around Microsoft&#39;s new attitude and its old antagonism to open source.\n   Microsoft today has espoused open source as its focus shifts from Windows PCs to Azure and Office in the cloud. But Sinofsky outlines reasons why Microsoft&#39;s approach at the time was understandable – and how its model was upended by software-as-a-service in 1999-2000, to which Linux was better suited than Windows, and later Google&#39;s infrastructure.\n Sinofsky&#39;s defense of Microsoft fleshes out Gates&#39; explanation of GPL in 2001 that it &#34;makes it impossible for a commercial company to use any of that work or build on any of that work&#34;.\n &#34;Microsoft was founded on the principle that software was intellectual property,&#34; Sinofsky says, making distinctions between the various approaches to software and hardware adopted by Microsoft, IBM, Google, and Apple.\n He points to the BASIC programming language and the Altair BASIC interpreter, the first product from Bill Gates and fellow Microsoft co-founder Paul Allen, which they created in the 1970s for hobbyists to program on bare metal. Incidentally, Microsoft  open-sourced the 1983 GW-BASIC interpreter last week as a historical software artifact.\n &#34;Times were different when Microsoft started,&#34; Sinofsky writes. &#34;There was no network distribution. In fact it cost money (COGS) to distribute software,&#34; he said, referring to the additional cost of distributing software compared with the way Google distributes its ad-backed software in the cloud, how Apple ties its software to hardware, and how IBM coupled its software with consultancy fees.\n In the very early days of Microsoft, Gates and Allen were catering to hobbyists who bought DIY hardware, much like today&#39;s developers who buy Raspberry Pi and similar single-board computers that run on free, Linux-based operating systems.\n &#34;Hobbyists loved it. They loved it so much they were willing to send tapes (paper tapes) around to each other for free. That&#39;s when the famous &#39;Open Letter&#39; was written,&#34; Sinofsky wrote.\n In 1976 Gates  penned an angry letter to computer hobbyists, accusing them of stealing Altair BASIC and complaining that resellers of it were making money while Microsoft was not.\n &#34;Hardware must be paid for, but software is something to share. Who cares if the people who worked on it get paid?&#34; Gates wrote.\n The future billionaire philanthropist, then dreaming of Microsoft becoming profitable, complained that the time he and Allen had spent to create chip-specific iterations of BASIC amounted to $40,000 – yet the royalties Microsoft had received to date amounted to less than $2 an hour.\n &#34;What hobbyist can put three man-years into programming, finding all bugs, documenting his product and distribute it for free? The fact is, no one besides us has invested a lot of money in hobby software. We have written 6900 BASIC, and are writing 8080 APL and 6800 APL, but there is very little incentive to make this software available to hobbyists. Most directly, the thing you do is theft.&#34;\n Sinofsky argues that where free and open source software (FOSS) hit Microsoft hard was Linux on the server.\n &#34;First, Linux just did a bunch of stuff on the internet than WinNT did not do (and by almost all accounts still does not). It cost less to run and scaled better,&#34; he writes\n &#34;To some degree, biz customers did not focus on costs but preferred to have backing of a company to deal with. That explains the rise of enterprise Windows servers from 2000. Essentially customers said if they were going to &#39;install&#39; software on &#39;servers&#39; they preferred to pay.&#34;\n After that, Google came along running open-source code on its own data centers without ever redistributing FOSS.\n  &#34;That&#39;s what upended the competitive dynamic and caught Microsoft unable to respond. Microsoft&#39;s business was based on distributing software. All the open-source licenses were written to account for that. If you used the [software] and distributed then you distributed *everything*.&#34;\n &#34;Today there&#39;s a thriving model of [companies] using open source the Google way or building on a project creating a [business] maintaining the OSS relationship. But to understand a change of heart should do so in the context that created the initial view and allowed for the change.&#34;", "posttime": "2020-05-27 04:44:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,windows,微软,开源,首席", "title": "前Windows首席执行官：这就是微软向开源发动战争的原因", "title_en": "Ex-Windows chief: Here's why Microsoft waged war on open source", "transed": 1, "url": "https://www.zdnet.com/article/ex-windows-chief-heres-why-microsoft-waged-war-on-open-source/", "via": "", "real_tags": ["microsoft", "windows", "微软", "开源", "首席"]}, {"category": "", "categoryclass": "", "imagename": "a842a1db26ab46b19a6940a332c4d895.jpeg", "infoid": 1003832, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个五年计划中，腾讯将把重点放在云计算、人工智能、区块链技术和物联网等领域，以及支持这些领域的基础设施，如先进的服务器、超级计算机、数据中心和5G移动网络。", "note_en": "The five-year plan will have Tencent focus on fields that include cloud computing, artificial intelligence, blockchain technology and the Internet of Things, as well as the infrastructure to support them like advanced servers, supercomputers, data centres and 5G mobile networks.", "posttime": "2020-05-27 04:27:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "腾讯,tencent,领域", "title": "腾讯将投资700亿美元建设新的数字基础设施", "title_en": "Tencent to invest US$70B in new digital infrastructure", "transed": 1, "url": "https://www.scmp.com/tech/big-tech/article/3086162/tencent-invest-us70-billion-new-digital-infrastructure-backing", "via": "", "real_tags": ["腾讯", "tencent", "领域"]}, {"category": "", "categoryclass": "", "imagename": "46bb5f38b3a969b877ca18b5a056dac2.jpg", "infoid": 1003831, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着企业重新开张，人们纷纷前往海滩和公园，你可能已经看到过新闻照片或视频，这些照片或视频似乎显示，人们挤在密集的人群中，乐于忽视社交距离准则。但这些照片可能会产生误导，这要归功于相机技巧。\n摄影师在拍摄人群时喜欢的一种相当常见的技术是使用变焦或长焦镜头。这压缩了图片的前景和背景，使每个人看起来都更接近。例如，户外摄影指南在一篇关于人群照片的文章中写道，300 mm的镜头“压缩了人群，使其看起来更大但更紧凑，创造出更有活力、更放大的照片。”\n当你在看新闻照片时，这意味着什么(更不用说推特上那些因过早重新开放而羞愧国家的帖子)：那张“人群”的照片实际上可能是散布在海滩或公园周围的人，其实并不是真的很拥挤。\n这种技术可以被用来故意误导，但它也是一种方便的方式，可以在人群中显示许多人，而不会让他们都以不同的大小出现，并且中间有很大的空间。我想要澄清的是，使用这种技术的摄影师并不一定是想要对你撒谎；他们用这种方式拍摄场景可能还有另一个原因。例如，一位报纸编辑指出，一张被广泛分享的海滩重新开放照片的摄影师“用长镜头拍摄了这张照片…因为她想尽可能多地了解海滩，以准确地描绘场景。”不管是好是坏，这是射杀人群的常用技巧。\n这里的航拍照片是同一个海滩，同一天，由同一位摄影师拍摄，与本页顶部的那张一样。看到航拍左下角的红白相间的伞了吗？好的，很好。现在找一条红色的毯子，上面中间有一把深绿色的伞。\n现在向上滚动，看看另一张照片中的那两把雨伞。(红白相间的伞在照片的中心，深绿色的伞在相机附近。)。\n从这张原始照片中，你会得到这样的想法，绿色雨伞的人正对着深蓝色的毛巾。从空中俯瞰，很明显他们在相当远的地方。考虑到大多数人的身高在5到6英尺之间，你可以用日光浴来衡量-人们是保持6英尺的距离吗？在大多数情况下，要多得多。\n为了进一步了解不同的相机镜头长度如何改变人群的外观，景观设计师杰夫·卡特勒(Jeff Cutler)用几个不同的镜头拍摄了当地的海滩，以准确显示每个人看到的东西。\n这个相机技巧也适用于视频：正如其中一个回复中指出的那样，这条推文中的一个是一个特别令人震惊的例子。马里兰州海洋城的这条木板路“人满为患”吗？在一个地方，不戴面具的人肯定比可能明智的人多，但相机镜头夸大了密度：\n看看录像带，你自己数一数。婴儿车里的男人出现在0点03分，看起来就像是站在前景中静止不动的女人的肩膀上：\n.但是当剪辑切断的时候-20步13秒后-他仍然在她后面.。\n这些误导性的人群镜头是我们重新开放时的一个问题，因为人们很紧张。我们很多人都试图避开人群，这些照片让我们的邻居看起来像是忽视了身体距离的规则。也许他们中的一些人是，但情况可能并不像照片显示的那样可怕。\n这是另一个例子，当规则要求桌子之间的距离超过通常的距离时，一家餐厅重新开业。一张照片似乎表明规则没有得到遵守；另一张从另一个角度(由餐厅提供)的照片则讲述了一个不同的故事。\n与此同时，这些照片和视频为我们在社交媒体上相互争执提供了素材，加剧了紧张局势。如果感染没有随着重新开放而上升-也许是因为人们在郊游时保持谨慎并保持适当的距离-你知道有人会挖出这些照片来声称一切都很拥挤，反正一切都很好。", "note_en": "As businesses reopen and people take to the beaches and parks, you’ve probably seen news photos or video that appear to show people packed into dense crowds, blithely ignoring social distancing guidelines. But these photos can be misleading, and it’s thanks to a camera trick.\n  A fairly common technique  photographers favor when shooting crowds is to use a zoom or telephoto lens. This   compresses the foreground and background of a picture, making everybody look like they are closer together. For example, in an article on crowd photos   Outdoor Photography Guide writes that a 300mm lens “compresses the crowd and makes it look larger yet more compact, creating more vibrant, more amplified photos.”\n What this means as you’re looking at news photos (not to mention Twitter threads shaming states for reopening too early): that photo of a “crowd” may actually be of people scattered around the beach or park that isn’t really crowded at all.\n    This technique can be used to deliberately mislead, but it’s also just a handy way of showing many people in a crowd without having them all appear at different sizes and with a lot of space in-between. I want to be clear that a photographer who uses this technique is not  necessarily trying to lie to you; there may be another reason why they photographed the scene the way they did. For example, one newspaper editor   pointed out that the photographer of a much-shared beach reopening shot “shot the photo...with a long lens because she wanted to get as much of the beach as she could to accurately depict the scene.” For better or worse, it’s a common technique for shooting crowds.\n     The aerial photo here is of the same beach, on the same day, by the same photographer, as the one at the top of this page. See the red and white umbrella in the lower left of the aerial shot? Okay, good. Now find the red blanket with dark green umbrella at the top center.\n Now scroll up and look at those two umbrellas in the other shot. (The red and white umbrella is in the center of the photo, the dark green one near the camera.)\n  From that original shot, you’d get the idea that the green umbrella people are right up against the dark blue towel. From the aerial view,  it’s clear that they’re quite far away. Considering that most people are between five and six feet tall, you can use sunbathers for scale—are people staying six feet apart? In most cases, far more.\n For a further tutorial on how different camera lens lengths can change the appearance of a crowd, landscape architect Jeff Cutler   photographed a local beach with several different lenses to show exactly what each one sees.\n   This camera trick works with video, too: The one in   this tweet is an especially egregious example, as pointed out in   one of the replies. Is this boardwalk in Ocean City, Maryland “packed”? There are definitely more maskless people in one place than is probably wise, but the camera lens exaggerates the density:\n   Watch the video and count for yourself. The man in the baby carrier appears at 0:03 and seems like he’s just over the shoulder of the woman standing still in the foreground:\n   ...but by the time the clip cuts off—20 steps and 13 seconds later—he’s still behind her.\n   These misleading crowd shots are a problem as we reopen because people are nervous. A lot of us are trying to avoid crowds and these shots make it look like our neighbors are ignoring rules about physical distancing. Maybe some of them are, but the situation is probably not as dire as the photos show.\n Here’s another example, of a restaurant that reopened when rules required that tables be separated from each other by more than the usual distance. A photo appears to show that the rules aren’t being followed; a photo from another angle (supplied   by the restaurant) tells a different story.\n   Meanwhile, these photos and videos give us fodder to argue with each other on social media, driving tensions ever-higher. If infections  don’t rise with reopening—perhaps because people are being cautious during their outings and maintaining proper distance—you know someone’s going to dig up these photos to claim that everything was crowded and things turned out just fine anyway.", "posttime": "2020-05-27 04:27:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "具有,misleading,照片", "title": "如何识别具有误导性的人群照片", "title_en": "How to Spot a Misleading Crowd Photo", "transed": 1, "url": "https://vitals.lifehacker.com/how-to-spot-a-misleading-crowd-photo-1843679750", "via": "", "real_tags": ["具有", "照片"]}, {"category": "", "categoryclass": "", "imagename": "1d1860b75bcd646733d1f7c544bea3df.jpg", "infoid": 1003830, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已经确定了最新的分销协议，与Hulu达成了一项协议，即将推出的服务将向迪士尼拥有的流媒体服务的订户提供。\n这项安排遵循了Hulu上之前存在的针对Showtime、HBO、Starz等付费频道的“附加”模式的基本框架。它将允许Hulu近3100万订户中的大多数通过Hulu的基本或广告支持的层以及SVOD/Live TV捆绑添加HBO Max。在这笔交易之前，WarnerMedia与Charge Communications、YouTube TV、谷歌(Google)和苹果(Apple)在5月27日HBO Max推出之前发布了一系列类似的声明。\n绝大多数现有的“Hulu上的HBO”订户将免费使用这项流媒体服务，每月零售费为15美元。新的和现有的Hulu订户将可以通过Hulu直接订阅HBO Max，月费同样是15美元。\n随着发行日的临近，WarnerMedia也采取了另一步试图刺激订阅，通过其新的合作伙伴平台向HBO Max提供每月12美元的价格。这是HBO历史上的一个重大发展，其独立的流媒体服务HBO Now于2015年上市。由于对“最惠国”的担忧，这可能会全面降低费用，前HBO母公司时代华纳(Time Warner)，然后是华纳媒体(WarnerMedia)，基本上避免了折扣定价。当时的主流观点是，定价需要传达电视网的威望感官。这一概念在很大程度上已经被互联网分发所取代，HBO Max售价15美元，处于流媒体频谱的高端。\nHulu的交易还突显了一个事实，即流媒体的崛起已经让传统的竞争产生了不同的看法。迪士尼在包括直接面向消费者的流媒体在内的许多业务中都是WarnerMedia的直接竞争对手，它于2019年完全控制了Hulu。华纳传媒当时将其在Hulu的10%股权出售给了迪士尼。在前几年，从Hulu运营13年的早期开始，WarnerMedia的部门就向Hulu提供节目，其网络通过Hulu的实况捆绑分发。\nHulu不断增长的订户数量，包括其Live产品，目前已拥有340万付费客户，将作为迪士尼下周四季度收益报告的一部分进行更新。\nWarnerMedia表示，其目标是到2025年全球拥有7500万至9000万订户。该公司去年秋天表示，它将集成在AT&amp；T；平台上，包括DirecTV，这将使其在推出时拥有坚实的基础。", "note_en": "has set its latest distribution deal for  , setting an agreement with Hulu for the forthcoming   service to be available to subscribers to the Disney-owned streaming service.\n The arrangement follows the basic outline of the “add-on” model that had previously existed on Hulu for premium channels like Showtime, HBO, Starz, etc. It will allow a majority of Hulu’s nearly 31 million subscribers to add HBO Max through Hulu’s basic or ad-supported tiers as well as its SVOD/live TV bundle. The deal follows a flurry of similar announcements by WarnerMedia with Charter Communications, YouTube TV, Google and Apple ahead of the May 27 launch of HBO Max.\n  The vast majority of existing “HBO on Hulu” subscribers will get free access to the streaming service, which will retail for $15 a month. New and existing Hulu subscribers will be able to subscribe to HBO Max directly through Hulu for that same $15 monthly rate.\n  As launch day approaches, WarnerMedia has also taken another step to try to goose subscriptions, offering HBO Max for $12 a month via its new partner platforms. That is a significant development in the history of HBO, whose stand-alone streaming service, HBO Now, hit the market in 2015. Because of “most-favored nation” concerns that could have lowered fees across the board, former HBO parent Time Warner and then WarnerMedia and   largely avoided discount pricing. The prevailing sentiment at the time was that pricing needed to convey the prestige sensibility of the network. That notion that has largely been superseded by internet distribution, and at $15 HBO Max is at the top end of the streaming spectrum.\n The Hulu deal also highlights the fact that the rise of streaming has cast traditional rivalries in a different light. Disney, a direct competitor with WarnerMedia in many businesses, including direct-to-consumer streaming, took full control of Hulu in 2019. WarnerMedia sold its 10% stake in Hulu to Disney at that point. Over prior years, since early in Hulu’s 13-year run, units of WarnerMedia have supplied programming to Hulu and its networks are distributed via Hulu’s live bundle.\n Hulu’s rising subscriber numbers, including its live offering, which now has 3.4 million paying customers, will be updated as part of Disney’s quarterly earnings report next Thursday.\n  WarnerMedia has said it is targeting 75 million to 90 million subscribers globally by 2025. The company last fall said it would be integrated on AT&amp;T platforms, including DirecTV, which will give it a substantial base at launch.", "posttime": "2020-05-27 04:26:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "max,hulu", "title": "HBO MAX与Hulu签约", "title_en": "HBO Max Pacts with Hulu", "transed": 1, "url": "https://deadline.com/2020/05/hbo-max-pacts-with-hulu-racking-up-another-distribution-deal-before-launch-1202923597/", "via": "", "real_tags": ["max", "hulu"]}]