[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073416, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们身体中的大多数肌肉只对传入的神经信号做出反应，这些信号必须触发每个肌肉细胞收缩或放松。但心肌是不同的。触发心肌收缩的脉冲从一个肌肉细胞传递到相邻的肌肉细胞，从而产生有节奏的收缩波。这是如此彻底地建立在系统中，以至于培养皿中的一片心肌细胞将开始自发收缩。\n现在，研究人员利用心脏细胞的一些独特特性，制造了一种只靠糖为动力的游动机器鱼。当他们试图打造心脏时&#39；它相当于一个起搏器，但事实证明它并不需要：肌肉细胞的正确排列使鱼能够自发地游泳。\n从某种意义上说，描述这种新型机器鱼的论文是对我们控制干细胞发育能力不断增强的致敬。这篇论文的研究人员来自哈佛大学，他们决定用心肌细胞为机器人提供动力。几年前，这意味着在分离和培养心肌细胞之前，从实验动物身上解剖出一个心脏。\n对于机器鱼来说，干细胞更好。那&#39；这是因为干细胞更容易进行基因操作，也更容易生长成一个统一的群体。因此，该团队从人类干细胞群体开始，并经历了指导其发育所需的过程，从而形成心肌细胞。\n这些细胞的薄层被放置在一片薄薄的明胶中，明胶将细胞固定在&#34的两侧；鱼&#34；（两边各一片）。鱼的中心是灵活的，所以右侧肌肉的收缩会把尾巴拉向右侧，对侧也是如此。通过左右交替收缩，鱼会把尾巴从一边拉到另一边，推动它向前。除此之外，这条鱼还有一个很大的背#34；财务和#34；里面有一个浮力装置，可以让野兽保持直立，防止它下沉。整个过程的动力来源于将其放入含有糖的溶液中，心肌细胞会吸收糖。\n也许正是因为这种简单性，这个机器人如此耐用，以至于它在建造之后能够游泳三个多月。一开始表现不错，但随着心肌细胞更好地整合到连贯的肌肉中，第一个月的表现有所改善。最终，这条鱼每秒能游超过一个身长。在这种速度下，机器人每单位肌肉质量的效率非常高，它的游泳速度比实际的鱼快。\n帮助机器鱼得以生存的因素之一是#39；在上图中，任何一种控制电路都不存在，这使得它的效率非常显著。研究人员实际上测试了许多控制肌肉的方法，但最终发现最简单的方法是最好的。\n控制肌肉的第一次尝试依赖于一点基因工程。通常由神经脉冲触发的离子流入会触发肌肉收缩。但研究人员已经发现了一些蛋白质，它们充当光激活的离子通道，在特定波长的光下会产生离子流入。因此，研究人员设计了一侧细胞对红光敏感，另一侧细胞对蓝光敏感。这种方法效果很好，可以让红色和蓝色交替闪烁，让鱼向前游动。\n研究人员尝试的第二种方法是受心脏结构的启发，心脏中包含一组细胞，通过触发从那里传播的收缩来充当起搏器。研究人员形成了一个心脏细胞球作为起搏器，并制作了一个连接心脏细胞和侧翼肌肉的细胞桥。从起搏器细胞开始的离子流入可能会扩散到肌肉，导致收缩。\n这在一定程度上起到了作用，但结果是次要的。研究人员发现，这两块肌肉相互调节节奏；这是宫缩。\n心肌细胞也有拉伸受体。对细胞拉得太多，受体就会被激活并触发收缩。结果证明，这为侧翼肌肉提供了一种内置的协调性。当右侧的一个细胞收缩时，它会导致另一侧的细胞伸展。一旦达到临界点，左侧的拉伸感受器就会触发肌肉收缩，拉伸右侧。然后，这段时间重新开始了循环。\n这不会&#39；t无限期地工作，两块肌肉最终会失去同步。那&#39；此时起搏器可以帮助他们恢复正常的周期。\n总的来说，这远比有用的东西更令人印象深刻（除非你是那种只对有用的东西印象深刻的人）。没有&#39；毕竟，在很多情况下，机器人都需要在糖溶液中游动。但是，研究人员能够找出如何利用这些细胞的基本生物学特性来制造一台有效的机器，这一事实当然符合我对“令人印象深刻”的定义。", "note_en": "Most muscles in our bodies only act in response to incoming nerve signals, which have to trigger each individual muscle cell to contract or relax. But heart muscle is different. The impulses that trigger contraction in heart muscle are passed from one muscle cell to its neighbors, leading to a rhythmic wave of contractions. This is so thoroughly built into the system that a sheet of heart muscle cells in a culture dish will start contracting spontaneously.\n Now, researchers have taken advantage of some of the unique properties of cardiac cells to build a swimming robot fish powered by nothing but sugar. And while they tried to craft the heart&#39;s equivalent of a pacemaker, it turned out not to be needed: the right arrangement of muscle cells got the fish swimming spontaneously.\n  In some ways, the paper describing the new robot fish is a tribute to our growing ability to control stem cell development. The researchers behind the paper, based at Harvard, decided to use cardiac muscle cells to power their robot. A couple of years ago, this would have meant dissecting out a heart from an experimental animal before isolating and growing its cardiac cells in culture.\n For the robot fish, stem cells were better. That&#39;s because stem cells are easier to genetically manipulate, and they are easier to grow into a uniform population. So, the team started with a population of human stem cells and went through the process needed to direct their development so they would form cardiac muscle cells.\n    A thin layer of these cells was placed inside a thin slice of gelatin, which held the cells in place on the flanks of the &#34;fish&#34; (one slice on either side). The center of the fish was flexible, so a contraction of the muscle on the right flank would pull the tail to the right, and the same would work for the opposite side. By alternating left and right contractions, the fish would pull its tail from side to side, propelling it forward. Beyond that, the fish had a large dorsal &#34;fin&#34; that contained a buoyancy device to keep the beast oriented upright and prevent it from sinking. The whole thing was powered by putting it in a solution with sugar, which the cardiac muscle cells would absorb.\n Perhaps because of this simplicity, the robot was so durable that it was able to swim for well over three months after its construction. Performance was decent at first but improved over the first month as the cardiac cells better integrated into a coherent muscle. Ultimately, the fish was able to travel more than a body length per second. At that pace, the robot was remarkably efficient—per unit of muscle mass, its swimming speed was better than that of actual fish.\n  One of the things that helped enable the robot fish&#39;s efficiency is notable by its absence in the photo above: any sort of control circuitry. The researchers actually tested a number of ways of controlling the muscles but ultimately found that the simplest option was the best.\n The first attempt to control the muscles relied on a bit of genetic engineering. Muscles are triggered to contract by the influx of ions, normally triggered by nerve impulses. But researchers have identified some proteins that act as light-activated ion channels, which will create an influx of ions in response to specific wavelengths of light. So, the researchers engineered the cells on one flank to be sensitive to red light and those on the other sensitive to blue. This worked well, allowing alternating flashes of red and blue light to swim the fish forward.\n    The second method the researchers tried was inspired by the structure of the heart, which contains a cluster of cells that acts as a pacemaker by triggering a contraction that spreads from there. The researchers formed a ball of cardiac cells to act as a pacemaker and made a bridge of cells that connected the cardiac cells to the flank muscles. The influx of ions that started in the pacemaker cells could spread to the muscles, driving a contraction.\n This worked to a degree but turned out to be of secondary importance. The two muscles, the researchers discovered, paced each other&#39;s contractions.\n Cardiac muscle cells also have stretch receptors. Pull on the cell too much, and the receptor will be activated and trigger a contraction. This turned out to provide a built-in coordination for the flank muscles. As one right side contracted, it caused the cells on the opposite side to stretch. Once they hit a critical point, the stretch receptors on the left side would trigger that muscle to contract, stretching the right. That stretch then restarted the cycle.\n This wouldn&#39;t work indefinitely, and the two muscles would eventually go out of synch. That&#39;s when the pacemaker could help get them back into a regular cycle.\n Overall, this is far more impressive than useful (unless you&#39;re the sort who&#39;s only impressed by useful things). There aren&#39;t a lot of situations that call for a robot to swim through a solution of sugar, after all. But the fact that researchers were able to figure out how to use the basic biological properties of these cells to craft an effective machine certainly fits my definition of impressive.", "posttime": "2022-02-15 12:50:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,heart,细胞", "title": "游泳机器人跳动的心脏", "title_en": "The beating heart of a swimming robot", "transed": 1, "url": "https://arstechnica.com/science/2022/02/the-beating-heart-of-a-swimming-robot/", "via": "", "real_tags": ["机器人", "heart", "细胞"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073415, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周日晚上最具视觉吸引力的超级碗广告之一是马修·麦康纳（Matthew McConaughey）饰演的宇航员。这则广告以麦康纳在太空中发现他在热气球中的形象开始。\n&#34;它&#39；现在不是逃跑的时候，是&#39；是时候参与了&#34；麦康纳说，他的气球穿过绿色的乡村、城市景观和婚礼&#34;因此，当其他人关注元宇宙和火星时，让&#39；让我们留在这里，恢复我们的。新边疆，它是&#39；火箭科学。它&#39；就在这里&#34;\n这则广告以#TeamEarth（团队地球）标签结尾，显然是被Salesforce收购的，目的是为了提升其作为一家为人类和我们的星球谋福利的公司的形象。顾问们显然认为Salesforce做到这一点的最佳方式是羞辱那些对太空感兴趣并投资太空的亿万富翁。这很有意思，因为Salesforce首席执行官马克·贝尼奥夫是SpaceX的投资者，他说；太空是我们应该投资的一个巨大类别&#34;\n撇开这种不真诚不谈，这则广告在超级碗期间播出，并选择太空探索作为其目标，这一事实应该告诉我们一些关于目前公众对火箭和亿万富翁的性情。\n亿万富翁焦虑情绪的上升趋势在去年达到顶峰，这是私人太空飞行的分水岭。在过去的半个世纪里，超过95%的人类太空飞行都是由政府宇航员乘坐政府设计和资助的飞行器进行的。从这一点来看，未来半个世纪中，95%的人类太空飞行（如果不是更多的话）将在私人建造的飞行器上进行。\n然而，公众并没有将私人太空飞行的兴起视为太空的民主化，也没有将其视为一件好事。更确切地说，公众已经看到理查德·布兰森爵士骑着他的维珍银河火箭去太空，杰夫·贝佐斯骑着他的蓝色起源火箭去太空，埃隆·马斯克骑着。。。埃隆没有&#39；我真的不想亲自去太空。\n许多美国人对马斯克、贝佐斯和其他亿万富翁如此富有感到不安；这些美国人认为亿万富翁对太空的迷恋是&#34；男孩们在他们的玩具里&#34；或者逃离地球的努力；他们担心富人在地球燃烧的时候玩火箭。Salesforce广告利用了所有这些挫折。\n但另一位亿万富翁骑过马斯克&#39；s火箭：贾里德·艾萨克曼，他是Shift4支付处理公司的创始人，也是一名飞行员。艾萨克曼很清楚这种挫折感。去年，他购买并指挥了历史上第一次私人轨道太空飞行，名为Inspiration4。在这次“龙之队”飞行中，艾萨克曼邀请了一位癌症幸存者、一位科学家教育家和一位幸运的抽奖得主加入他的行列，同时为圣裘德儿童筹集了2亿多美元；s研究医院。\n周一，艾萨克曼宣布，他非常享受这种体验，因此他将购买更多的SpaceX飞行器进入轨道的飞行。其中两个将登上“神龙号”载人飞船，第三个将是SpaceX&#39上的首次载人航天飞行；这是星际飞船。艾萨克曼称这项倡议为&#34；北极星计划&#34;\n第一次飞行将不早于2022年11月从肯尼迪航天中心发射。它将搭载艾萨克曼&#39；s的商业伙伴斯科特·波提特和SpaceX工程师莎拉·吉利斯和安娜·梅农。在此期间&#34；黎明和#34；任务中，四人将乘坐一条机组龙飞行，并试图打破地球轨道任务的高度记录。这一纪录是由双子座11号在1966年创造的，全长1379公里（856.9英里）。这项任务将使宇航员能够测试更高的辐射环境，当然，从半个世纪前阿波罗任务以来最崇高的角度看地球。双子座11号的指挥官皮特·康拉德（Pete Conrad）称从那里可以看到&#34；太棒了&#34;\n黎明号任务还将进行太空行走，一名或多名宇航员穿着由脐带连接到“龙”号载人飞船的套装，冒险走出减压舱。这些宇航服将是宇航员在执行“龙”号载人任务时所穿的现有压力服的升级版。\n艾萨克曼说，他想利用这样的私人任务来进一步探索太空。他以宇航服为例。他说，在电影中，宇航员很快穿上宇航服，冲出一个气闸。那&#39；这不是它目前的工作方式；美国国家航空航天局的宇航员通常会在走出空间站前花数小时穿上宇航服并减压&#34;如果我们能找到一种加速EVA过程的方法，这将具有真正的价值，&#34；艾萨克曼说。\n让&#39；让我们诚实点。北极星任务的发生是因为贾里德·艾萨克曼很富有，真的想再次回到太空。再一次。再一次。但他似乎也决心利用这些任务将太空飞行从罕见、超昂贵和笨重转变为频繁、低成本和流线型。他想看到成百上千的人在太空生活和工作，他分享了埃隆·马斯克&#39；他设想有朝一日在火星上建立定居点。\n&#34;我们只想看到进步&#34；他说&#34;美国军队曾经送过我们的邮件。如果它继续这样下去，我们可能不会&#39；I don’我现在没有能力在接到一个小时通知后步行到机场，然后花几百美元飞到奥兰多去看迪士尼世界&#34;\n艾萨克曼也理解导致Salesforce广告播出的强烈反对。在接受Ars采访时，他说他认真对待这一责任。他想让公众理解为什么进入太空对许多原因都很重要，比如获取太空中的自然资源，以便我们能够在地球上保护它们。\n&#34;我&#39；我很清楚这一点，&#34；他说&#34;它从一开始就是励志故事的重要组成部分。我没有忘记，如果SpaceX和商业航天行业想要实现他们的目标，包括登上火星，它&#39；在这一过程中，它将得到很多公众的支持。它&#39；重要的是要传达这样一个信息：我们&#39；我们努力在太空中完成任务是很重要的，而且在地球上绝对会有真正的好处&#34;", "note_en": "One of the most visually appealing Super Bowl advertisements on Sunday night starred Matthew McConaughey dressed as an astronaut.  The advertisement begins with suggestive images of McConaughey in space only to find him in a hot air balloon.\n &#34;It&#39;s not time to escape, it&#39;s time to engage,&#34; McConaughey says as his balloon traverses green countryside, cityscapes, and a wedding. &#34;So while the others look to the Metaverse and Mars, let&#39;s stay here and restore ours. The new frontier, it ain&#39;t rocket science. It&#39;s right here.&#34;\n The ad ends with a hashtag, #TeamEarth, and was evidently bought by Salesforce to burnish its image as a company working for the good of humanity and our planet. Consultants apparently convinced Salesforce the best way to do this was by shaming billionaires who are interested in and investing in space. Which is interesting, given that Salesforce CEO Marc Benioff is an investor in SpaceX  and has said, &#34;Space is a huge category that we should invest in.&#34;\n This insincerity aside, the fact that this advertisement ran during the Super Bowl and chose space exploration as its target should tell us something about the present public temperament toward rockets and billionaires.\n The rising tide of billionaire angst has peaked during the last year—a watershed moment for private spaceflight. During the last half-century, more than 95 percent of human flights into space have been undertaken by government astronauts on government-designed and funded vehicles. From this point forward, it seems likely that 95 percent of human spaceflights over the next half-century, if not more, will take place on privately built vehicles by private citizens.\n But the public has not perceived the rise of private spaceflight as the democratization of space, however, or as a good thing. Rather, the much public has seen Sir Richard Branson riding his Virgin Galactic rocket to space, Jeff Bezos riding his Blue Origin rocket to space, and Elon Musk riding ... well Elon doesn&#39;t really seem all that personally driven to go space.\n    Many Americans are upset that Musk, Bezos, and other billionaires are so damned rich; these Americans see the billionaire infatuation with space as &#34;boys in their toys&#34; or an effort to escape the planet Earth; and they worry that the rich people are playing with rockets while the planet burns. The Salesforce ad taps into all of this frustration.\n But another billionaire has ridden on Musk&#39;s rocket: Jared Isaacman, who is the founder of the Shift4 payment-processing company and also a pilot. And Isaacman is well aware of this frustration. Last year, he purchased and commanded the first private orbital spaceflight in history,  dubbed Inspiration4. For this Crew Dragon flight, Isaacman invited a cancer survivor, a scientist-educator, and one lucky raffle winner to join him, all while raising more than $200 million for St. Jude Children&#39;s Research Hospital.\n  On Monday, Isaacman announced that he enjoyed the experience so much that he is purchasing three more flights on SpaceX vehicles into orbit. Two will be aboard the Crew Dragon spacecraft, and the third will be the first human spaceflight on SpaceX&#39;s Starship vehicle. Isaacman is calling this initiative the &#34; Polaris Program.&#34;\n The first flight will launch no earlier than November 2022 from Kennedy Space Center. It will carry Isaacman&#39;s business partner Scott Poteet and SpaceX engineers Sarah Gillis and Anna Menon. During this &#34;Dawn&#34; mission, the four will fly inside a Crew Dragon and seek to break the altitude record for an Earth-orbit mission. That record is 1,379 km (856.9 miles) and was set by Gemini 11 in 1966. The mission will allow the astronauts to test a higher-radiation environment and, of course, see the Earth from the loftiest perspective since the Apollo missions a half-century ago. The commander of Gemini 11, Pete Conrad, called the view from up there &#34;utterly fantastic.&#34;\n  The Dawn mission will also conduct a spacewalk, with one or more of the astronauts venturing outside the depressurized capsule in suits linked by umbilicals to the Crew Dragon spacecraft. These suits will be an upgraded version of the current pressure suits that astronauts wear during ascent and entry of Crew Dragon missions.\n    Isaacman said he wants to use private missions like this to further the exploration of space. He cited spacesuits as an example. In the movies, he said, astronauts quickly don a spacesuit and run out an airlock. That&#39;s not how it presently works; NASA astronauts typically spend hours putting on their spacesuits and depressurizing before going outside the space station. &#34;If we can figure out a way to expedite the EVA process, that will have real value,&#34; Isaacman said.\n Let&#39;s be honest. The Polaris missions are happening because Jared Isaacman is rich and really wants to go back to space again. And again. And again. But he also seems determined to use these missions to move spaceflight from rare, ultra-expensive, and cumbersome to frequent, lower-cost, and streamlined. He wants to see hundreds and then thousands of people living and working in space, and he shares Elon Musk&#39;s vision of one day establishing a settlement on Mars.\n &#34;We only want to see progress,&#34; he said. &#34;The US Army once delivered our mail. If it had continued to stay that way, we probably wouldn&#39;t have the ability now to walk up to an airport with like an hour notice and fly down to Orlando to see Disney World for a few hundred dollars.&#34;\n  Isaacman also understands the kind of backlash that led to the broadcast of the Salesforce ad. In an interview with Ars, he said he takes this responsibility seriously. He wants the public to understand why going into space is important for myriad reasons, such as obtaining natural resources in space so that we can preserve them on Earth.\n &#34;I&#39;m very aware of it,&#34; he said. &#34;It was an important component of the Inspiration4 story from the beginning. It is not lost on me that if SpaceX and the commercial space industry want to achieve their objectives, including getting to Mars, it&#39;s going to take a lot of public support along the way. It&#39;s important to deliver a message that what we&#39;re trying to accomplish in space is important and will absolutely have a real benefit back here on Earth.&#34;", "posttime": "2022-02-15 12:43:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "太空,亿万富翁,billionaires", "title": "也许把亿万富翁送上太空并不是件坏事", "title_en": "Maybe—just maybe—sending billionaires into space isn’t such a bad thing", "transed": 1, "url": "https://arstechnica.com/science/2022/02/maybe-just-maybe-sending-billionaires-into-space-isnt-such-a-bad-thing/", "via": "", "real_tags": ["太空", "亿万富翁"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073414, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "《地平线：禁地西部》的这篇评论包含了尽可能少的剧透，并留下了大部分剧集&#39；第一场比赛也完好无损。\n任何对新的PlayStation独家游戏《地平线：禁地西部》的评论都可能为该游戏辩护&#39；只要列出有多少东西可以看和做，这就是伟大。更独特的生物群落。更强烈的怪物。更多的遍历模式。更多的武器，更多的陷阱，更多的能力。更不用说建立在2017个原创性的地平线上的更大的阴谋赌注：零曙光。\n但对我来说，这部续集不是作为一个要点列表，而是作为众多杰出设计师、工程师、作家、艺术家和动画师努力的综合，令人难忘。H:FW可能是我见过的最伟大的AAA游戏冒险，因为它的所有部分以明显和微妙的方式结合在一起。\n我热烈地回忆起我第一次看比赛的情景&#39；美国名义上的西部禁区开放，充满了视觉和游戏的可能性。该地区&#39；我的PlayStation 5所能呈现的范围，包括田野、山峦和过去时代的神秘残骸。每个像素看起来都画得很精确；这一场景融合了河流景观的深蓝和日落时浓郁的橙色光芒。\n然后是&#34；摄像机&#34；她转过身来，瞄准了剧中的英雄阿洛伊，她的脸实时呈现出比以往任何时候都更生动的细节和更精细的动画。她不得不与一位脾气暴躁的大祭司抗争，由此产生的对话是角色扮演游戏的胜利。阿洛伊和#39；作为一名拯救世界的战士，我的自信在幽默和内心中同样闪耀，我不能&#39；I don’想象不到敲击&#34；跳过对话&#34；按钮我想，我想成为这个英雄。\n谈话结束后，我环顾了一片开阔的风景。一个目标清晰地标记在游戏地图上，但当我把地图放进口袋时，许多其他地标都清晰可见。特别是，我在一个陡峭的悬崖顶上看到了一座被摧毁了一半的建筑，它的周围巧妙地放置了几处黄色标记。我想我想去那里。所以我做到了。\n我爬了起来，爬了上去，想出了一些简单的穿越难题，然后到达了这座山顶堡垒的顶端。我眺望下面广阔的世界，到处都是熟悉的、崭新的机器恐龙。这些野兽需要驯服、诱捕和杀戮，在收集了一些有希望的宝藏后，我点击了&#34；拉佩尔和#34；按下按钮，大幅降低自己，开始狩猎。\n游戏反复引导玩家进入精彩的发现时刻。有时，这些时刻被厚颜无耻地隐藏在地图的一个角落里，那里有一个令人惊讶的洞穴，里面充满了谜题和情节展示。有时这些发现发生在H:FW&#39；这是一片广袤的平原，在那里，令人难忘的鬼鬼祟祟和陷阱怪兽遭遇战在令人惊叹的、布满天空的过去文明遗迹旁上演。\n每次比赛&#39；我发现自己停了下来，看看这些碎片是如何无缝地结合在一起的，然后离开时留下了深刻的印象。迄今为止，还没有一款开放世界冒险游戏能如此有效地修复这一类型；这就是膨胀和漫无目的的问题。H:FW有机地引导玩家完成几十个小时的故事，而不是朝着一个主要目标飞奔。", "note_en": "This review of  Horizon: Forbidden West includes as few spoilers as possible—and leaves most of the series&#39; first game unspoiled, as well.\n   Any review of new PlayStation-exclusive game  Horizon: Forbidden West could make a case for the game&#39;s greatness simply by listing how much stuff there is to see and do. More unique biomes. More intense monsters. More modes of traversal. More weapons, more traps, more abilities. Not to mention greater plot stakes that build on the fantastic foundation of the 2017 original,   Horizon: Zero Dawn.\n But for me, this sequel is memorable less as a bullet-point list and more as a synthesis of the efforts of so many brilliant designers, engineers, writers, artists, and animators.  H:FW is perhaps the greatest triple-A gaming adventure I have ever seen because of how all its parts fit together in ways both obvious and subtle.\n   I warmly recall the first time I saw the game&#39;s titular Forbidden West region open up, full of visual and gameplay possibilities. The region&#39;s fields, mountains, and enigmatic wreckage of a bygone era stretched out as far as my PlayStation 5 could render. Every pixel looked precisely painted; the scene combined the deep blues of a river-riven landscape and the rich orange glow of a sunset.\n Then the &#34;camera&#34; swung around to aim at series hero Aloy, her face rendered in real time with more telling details and finer animation than ever before. She had to contend with a cantankerous high priest, and the resulting conversation was a triumph of gaming role play. Aloy&#39;s confidence as a world-saving warrior shone through in equal parts humor and heart, and I couldn&#39;t imagine tapping the &#34;skip dialogue&#34; button.  I want to be this hero, I thought.\n    After that conversation, I looked around a wide-open landscape. One objective was clearly marked on an in-game map, yet plenty of other landmarks were visible when I put the map in my pocket. In particular, I saw a half-destroyed building at the top of a steep cliff—and it had a couple of yellow markings subtly placed around it.  I want to go there, I thought. So I did.\n I clambered, climbed, figured out mild traversal puzzles, and reached the top of this mountaintop fortress. I looked out on the wide world below, covered with familiar and brand-new robo-dinosaurs. Those beasts would need taming, trapping, and killing—and after collecting some promising treasure, I tapped a &#34;rappel&#34; button to dramatically lower myself and begin the hunt.\n   The game repeatedly leads players into brilliantly staged moments of discovery. Sometimes these moments are cheekily hidden in a corner of the map that features a surprising cavern filled with puzzles and plot reveals. Sometimes the discoveries take place on  H:FW&#39;s wide-open plains, where memorable sneak-and-trap monster encounters play out next to the stunning, sky-filling relics of a past civilization.\n Every time the game&#39;s unique mélange clicked, I found myself pausing to examine how the pieces fit together seamlessly—and coming away impressed. No open-world adventure game has ever done so much to fix the genre&#39;s issues of bloat and aimlessness.  H:FW organically leads players through dozens of hours of stories instead of barreling toward a single primary goal.", "posttime": "2022-02-15 12:41:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,地平线,forbidden", "title": "《地平线：禁地西部》是有史以来最伟大的游戏续集之一", "title_en": "Horizon: Forbidden West is one of the greatest game sequels of all time", "transed": 1, "url": "https://arstechnica.com/gaming/2022/02/horizon-forbidden-west-is-one-of-the-greatest-game-sequels-of-all-time/", "via": "", "real_tags": ["游戏", "地平线", "forbidden"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073413, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者\n这些行动是在国防部将作战行动向西移动340英里至波兰边境的利沃夫之际采取的。与此同时，盟国和美国情报机构警告说，俄罗斯军队可能即将发动袭击。\n与此同时，随着外交局势恶化，美国从该国撤出大使馆工作人员和机密材料。根据《华尔街日报》审查的一份内部通讯，56名大使馆工作人员和大使馆的机密材料于周日抵达杜勒斯国际机场。\n在周一的一份声明中，美国国务卿安东尼·布林肯表示，由于俄罗斯军队集结的“急剧加速”，国防部正在暂时搬迁大使馆。\n布林肯补充说：“大使馆将继续与乌克兰政府保持联系，协调在乌克兰的外交接触。我们还将继续进行密集的外交努力，以减少危机。”。\n美国重申了对乌克兰的支持，周一，布林肯与乌克兰总统德米特罗·库列巴进行了会谈，并向他保证，美国将继续支持乌克兰的长期经济稳定和安全。", "note_en": "Written by\r\r\r       The State Department has instructed staff to destroy computer workstations, phone systems and networking equipment as it relocates the U.S. embassy in the country, the  Wall Street Journal reported Monday.\n The actions were taken as the department moves operations 340 miles west to Lviv, on the border of Poland, and comes amid warnings from allies and U.S. intelligence agencies that an attack by Russian forces may be imminent.\n It comes as the U.S. withdraws embassy staff and classified material from the country as the diplomatic situation deteriorates. According to one internal communication reviewed by the Wall Street Journal, 56 embassy workers and the embassy’s classified material arrived at Dulles International Airport on Sunday.\n In a statement on Monday, Secretary of State Anthony Blinken said the department was temporarily relocating the embassy due to the “dramatic acceleration” in the buildup of Russian forces.\n “The Embassy will remain engaged with the Ukrainian government, coordinating diplomatic engagement in Ukraine.  We are also continuing our intensive diplomatic efforts to deescalate the crisis,” Blinken added.\n The U.S. has reiterated its support for Ukraine, and on Monday Blinken spoke with his Ukrainian counterpart, Dmytro Kuleba, and assured him that the U.S. would continue to support Ukraine’s long-term economic stability and security.", "posttime": "2022-02-15 12:38:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下令,department,大使馆", "title": "国务院下令销毁基辅大使馆的IT设备", "title_en": "State Department orders destruction of IT equipment at Kyiv embassy", "transed": 1, "url": "https://www.fedscoop.com/state-department-orders-destruction-of-it-equipment-at-kyiv-embassy/", "via": "", "real_tags": ["下令", "大使馆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073412, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这项备受争议的反加密法案伪装成一项儿童安全倡议，称为“挣到它”法案，但它拒绝死亡。该法案的一个新版本最近从一个温暖、浅浅的坟墓中钻了出来，并于周四在参议院司法委员会的声音表决中获得通过。现在，重新提出的法案将进入参议院。\n正如宣传的那样，该法案将删除一些长期保留的第230条保护措施。特别是，这意味着一家公司可能会对第三方上传到其系统的儿童性虐待材料（或CSAM）承担法律责任。支持该法案的人声称，取消这些保护将迫使互联网公司在识别和报告CSAM材料的真正问题方面发挥更积极的作用。如果该法案在国会两院获得通过，这些公司可能会面临一系列诉讼。民主党参议员理查德·布卢门塔尔（Richard Blumenthal）与共和党参议员、特朗普·拉基·林赛·格雷厄姆（Trump lackey Lindsey Graham）共同发起了该法案，他声称该法案“非常简单，就是关于科技公司是否应该为其同谋对儿童的性虐待和性剥削负责。”\n但这一描述只讲述了故事中一个看似有限的方面。公民自由组织和数字权利组织纷纷表示反对该法案，声称该法案将撤销对互联网用户的隐私保护，并激励互联网公司进行危险程度的监视和审查，远远超出CSAM材料的权限。\n“让我们说清楚，”电子前沿基金会在一份声明中说，“新的IT法案将为一个由私营公司运营的庞大的新的监视系统铺平道路，这将回扫全球人们使用的技术中最重要的隐私和安全特征。”该法案还可能对端到端加密系统产生巨大影响，而端到端加密系统在主要的消息服务中已变得越来越常见。\n该法案对隐私保护的削减可能会影响到所有人，但对LGBTQ社区构成了特别强大的威胁，他们的帖子被不成比例地错误标记为性内容。批评人士警告说，《挣IT法案》可能会效仿特朗普时代对FOSTA-SESTA进行的前230条修改，这对LGBTQ社区和性工作者产生了重大负面影响。\n《为未来而战》的导演埃文·格里尔在一份声明中说：“挣钱法案是我整个职业生涯中看到的最糟糕、最危险的互联网立法之一，这说明了很多。”\n在接受《华盛顿邮报》采访时，布卢门塔尔表示，《僵尸赚取IT法案》将阻止加密成为提供商对CSAM材料承担责任的“唯一证据”，但他补充说，该法案也不会提供完全豁免加密。据报道，Blumenthal将加密豁免称为“免出狱卡”换句话说，Blumenthal表示，不能仅仅因为公司使用加密技术就因为CSAM而起诉公司，但他承认，公司不能声称无法查看加密通信免除了他们的责任。可以\n令人欣慰的是，根据民主与发展中心（Center for Democracy&amp；科技首席执行官亚历山德拉·里夫·吉文斯（Alexandra Reeve Givens）表示，包括民主党人科里·布克（Cory Booker）和共和党人迈克·李（Mike Lee）在内的一批参议员表达了担忧，并敦促对该法案进行修改。\n关心此事的互联网用户已经明确表达了他们对“挣到钱”法案的看法。数字权利组织“为未来而战”最近上传了一份反对该法案的请愿书，截至撰写时，该请愿书已累积了近60万个签名。与此同时，包括民主与技术中心、ACLU和Access Now在内的60多个组织联合致函参议员迪克·德宾和查克·格拉斯利。\n这些组织写道：“通过让提供商承担大幅扩大的责任，该法案将使平台承载用户生成内容的风险大大增加。”。“这些责任威胁可能会导致提供商完全停止托管用户内容。另一方面，继续托管用户生成内容的提供商可能会有更多动机对在线言论进行过度审查，”尤其是LGBTQ用户。尽管“挣到钱”法案的支持者不断依赖该法案对儿童网络安全的好处，但人权组织认为，该法案实际上会增加保护儿童的难度。\n上一次立法者试图在2020年通过多个版本的《挣IT法案》，但在遭遇隐私团体的类似抵制后失败。当时，Singal等保护隐私的公司威胁说，如果这项法律获得通过，它们将干脆停止在美国的运营。", "note_en": "The controversial anti-encryption bill masquerading as a child safety initiative known as the   EARN IT Act refuses to die. A new version of the bill recently clawed its way out of a warm, shallow grave and   passed the Senate Judiciary Committee on a voice vote on Thursday. Now, the   reintroduced bill will head to the Senate floor.\n  The bill, as advertised, would remove some long-held Section 230 protections. In particular, it would mean that a company can be found legally liable for child sexual abuse material (or CSAM) that’s uploaded to their systems by third parties.  Those in favor of the bill claim removing these protections will force internet companies to take a more active role in identifying and reporting the real problem of CSAM material. If passed by both houses of Congress, the bill could potentially open these companies up to a flurry of lawsuits. Democratic Senator Richard Blumenthal, who co-sponsored the bill with Republican Senator and Trump   lackey Lindsey Graham, claimed the bill “is very simply about whether tech companies should be held responsible for their complicity in the sexual abuse &amp; exploitation of children.”\n     But that description only tells one, deceptively limited side of the story. Civil liberty and digital rights groups have spoken out in droves against the bill, claiming it would roll back privacy protections for internet users and incentivize internet companies to engage in dangerous levels of surveillance and censorship far exceeding the purview of CSAM material.\n  “Let’s be clear,” the Electronic Frontier Foundation said in a   statement, “The new EARN IT Act would pave the way for a massive new surveillance system, run by private companies, that would roll back some of the most important privacy and security features in technology used by people around the globe.” The bill could also have huge   implications for the end-to-end encryption systems which have become more common in major messaging services.\n   The bill’s whittling away of privacy protections could potentially affect everyone but poses a particularly powerful threat to the LGBTQ community whose posts are disproportionately   mislabeled as sexual content. The EARN IT act, critics warn, would potentially follow in the footsteps of previous Trump-era Section 230 changes FOSTA-SESTA, which had a significant negative   impact on the LGBTQ community and sex workers.\n   “The EARN IT Act is one of the most poorly conceived and dangerous pieces of Internet legislation I have seen in my entire career, and that’s saying a lot,” Fight for the Future’s Director, Evan Greer said in a   statement\n In an   interview with the Washington Post, Blumenthal said the zombie EARN IT Act would prevent encryption from being the “sole evidence” of a providers’ liability for CSAM material but added the bill would not offer total exemption encryption either. Blumenthal reportedly referred to encryption exemption as a “get-out-of-jail-free card.” In other words, Blumenthal is saying that a company can’t be sued over CSAM just because they use encryption but he’s admitting that companies won’t be able to claim that their inability to see into encrypted communications exempts them from liability. Okay.\n  Somewhat reassuringly, the new bill may still undergo some changes before it’s voted on in the Senate according to Center for Democracy &amp; Technology CEO Alexandra Reeve Givens, who   said a collection of senators, including Democrats Cory Booker and Republican Mike Lee voiced concerns and urged changes to the bill.\n Concerned internet users have made their opinion about the EARN IT Act clear. A petition opposing the bill was recently uploaded by the digital rights group Fight for the Future and has   amassed nearly 600,000 signatures at the time of writing. Meanwhile, more than 60 organizations including the Center for Democracy and Technology, the ACLU, and Access Now, jointly sent a   letter to senators Dick Durbin and Chuck Grassley.\n  “By opening providers up to significantly expanded liability, the bill would make it far riskier for platforms to host user-generated content,” the organizations wrote. “Those liability threats could cause providers to stop hosting user content altogether. On the other hand, providers that do continue to host users generated content would potentially have more of an incentive to engage in overbroad censorship of online speech,” particularly of LGBTQ users. And while EARN IT proponents continually fall back on the bill’s supposed boon for child safety online, rights groups argue the bill would actually make it  more difficult to protect children.\n  The last time lawmakers attempted to push through   several   versions of the EARN IT act back in 2020 but failed after facing similar pushback from privacy groups. At the time, privacy-preserving companies like Singal   threatened to simply cease operating in the U.S. if the law was passed.", "posttime": "2022-02-15 12:36:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法案,encryption", "title": "反加密法案通过参议院司法委员会：60多个组织公开反对这项新法案，该法案可能威胁加密并刺激加强监控：", "title_en": "Anti-Encryption Bill Passes Senate Judiciary Committee: Over 60 organizations spoke out against the new bill which could threaten encryption and incentivize increased surveillance:", "transed": 1, "url": "https://gizmodo.com/earn-it-anti-encryption-bill-passes-senate-committee-1848515670", "via": "", "real_tags": ["法案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073411, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "德克萨斯州总检察长肯·帕克斯顿周一起诉梅塔，指控这位Facebook家长未经用户同意非法收集生物特征数据。\n该诉讼提出的索赔与Facebook去年以6.5亿美元和解的集体诉讼案类似。\nFacebook在11月宣布将关闭识别用户的面部识别系统；照片上的脸。\n德克萨斯州总检察长肯·帕克斯顿周一对Meta提起诉讼，指控Facebook的父母未经用户同意，非法收集用户的生物特征数据。\n该诉讼提出的索赔与Facebook去年以6.5亿美元和解的集体诉讼案类似。该案指控Facebook侵犯了伊利诺伊州&#39；生物特征信息隐私法，通过存储关于人的数据#39；在未经他们同意的情况下使用其照片标签建议工具。\nFacebook在11月宣布将关闭其面部识别系统，该系统可以识别照片中的人脸，并建议用户对其进行标记。该公司表示，将删除超过10亿人的个人面部识别模板。\n德克萨斯州&#39；诉讼称Facebook未能获得用户，违反了州法律#39；知情同意收集其生物特征数据，以及未能在合理时间内销毁该数据。该诉讼称Facebook侵犯了德克萨斯人的权利，他们甚至没有使用社交媒体巨头&#39；因为该公司据称在上传到其网站的照片上收集了面部识别码，无论这些照片是否是Facebook用户。\n在诉讼中，德克萨斯州指控Facebook在未经同意的情况下捕获面部识别数据数十亿次，违反了法律。\n州政府可以对德克萨斯州的每一项违规行为处以高达25000美元的民事处罚；根据该诉讼，生物识别码的获取或使用法案适用于非法收集生物识别码、向第三方披露该数据以及未能及时销毁该数据。\n该州还指控Facebook侵犯了该州#39；美国《欺骗贸易行为法》通过误导消费者，并要求对每一次违反该法的行为额外处以1万美元的民事罚款。\n帕克斯顿在周一的新闻发布会上表示，罚款总额可能达到数十亿美元。\n德克萨斯州声称，虽然Facebook在营销其标签建议工具，但用户并没有完全意识到，通过接受或拒绝标签，他们在帮助培训该公司#39；它的人工智能系统将继续识别这些面孔。\n原告指控Facebook&#39；德克萨斯州的违规行为使德克萨斯人面临个人信息被盗的风险。\n&#34;与其他识别码不同，比如社保号码，在被盗或盗用时可以更改，生物识别码是永久的，&#34；西装上写着&#34;一旦一个生物识别码被捕获，一个坏的行为人就可以为受害者的其他人访问并利用该识别码#39；这就是生活&#34;", "note_en": "Texas Attorney General Ken Paxton sued Meta on Monday, alleging the Facebook parent illegally collected biometric data on users without their consent.\n The suit makes claims similar to those made in a class action case Facebook settled for $650 million last year.\n Facebook announced in November it would shut down its facial-recognition system that recognizes users&#39; faces in photos.\n Texas Attorney General Ken Paxton  filed a lawsuit against  Meta on Monday, alleging the Facebook parent illegally collected biometric data on users without their consent.\n The suit makes claims similar to those made in a class action case Facebook  settled for $650 million last year. That case alleged Facebook violated Illinois&#39; Biometric Information Privacy Act by storing data about people&#39;s faces without their consent for its photo-tag suggestion tool.\n  Facebook announced in November it would  shut down its facial-recognition system that identified faces in photos and suggested that users tag them. The company said it would delete individual facial-recognition templates for more than 1 billion people.\n Texas&#39;  lawsuit claims Facebook violated state law by failing to gain users&#39; informed consent to collect their biometric data, as well as failing to destroy that data in a reasonable period of time. The suit claims Facebook violated rights of Texans who did not even use the social media giant&#39;s services, because the company allegedly collected facial identifiers on photos uploaded to its site whether those pictured were Facebook users or not.\n In the suit, Texas alleged Facebook violated the law by capturing facial-recognition data without consent billions of times.\n The state can enforce a civil penalty of up to $25,000 per violation of Texas&#39; Capture or Use of Biometric Identifier Act for each unlawful collection of a biometric identifier, disclosure of that data to a third-party and failure to destroy the data in a timely manner, according to the suit.\n The state also alleges Facebook violated the state&#39;s Deceptive Trade Practices Act by misleading consumers and asked for an additional $10,000 civil penalty for each violation of that law.\n  Paxton said at a press conference Monday that the total penalties could tally in the billions of dollars.\n Texas claims that while Facebook marketed its tag-suggestion tool, users did not fully realize that by accepting or rejecting tags, they were helping to train the company&#39;s artificial intelligence system to continue to recognize those faces.\n The plaintiffs charge that Facebook&#39;s violations left Texans at risk of having their personal information stolen.\n &#34;Unlike other identifiers, such as Social Security numbers, which can be changed when stolen or misappropriated, biometric identifiers are permanent,&#34; the suit said. &#34;Once a biometric identifier is captured, a bad actor can access and exploit the identifier for the rest of the victim&#39;s life.&#34;", "posttime": "2022-02-15 12:33:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,ag", "title": "德克萨斯州AG起诉Facebook涉嫌未经同意收集面部识别数据", "title_en": "Texas AG sues Facebook for allegedly collecting facial recognition data without consent", "transed": 1, "url": "https://www.cnbc.com/2022/02/14/texas-sues-facebook-parent-meta-over-facial-recognition-privacy.html", "via": "", "real_tags": ["facebook", "ag"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073410, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "联邦调查局和国土安全部周一警告执法部门、军方和其他负责监督美国关键基础设施的人员，要做好准备，应对俄罗斯可能发动的网络攻击，以及可能入侵乌克兰的行为。\n在周一下午的电话会议上，国家最高网络安全官员向州和地方政府机构及网络安全人员通报了情况，警告他们注意网络上俄罗斯活动的迹象。联邦官员还敦促那些接到电话的人大幅降低举报可疑活动的门槛。\n官员们说，俄罗斯可能随时开始入侵乌克兰，军事行动还可能伴随着针对乌克兰和美国网络的网络攻击。官员们强调，美国认为俄罗斯对乌克兰的入侵可能始于空袭和导弹袭击，并伴随着网络行动。\n两名接听电话的人告诉雅虎新闻，他们对有多少接听电话的人似乎不知道举报可疑网络活动的流程感到震惊。\n“这是最基本的问题：如何以及向谁报告网络上的可疑活动？”一个人说。“人们现在不知道该做什么，这是一个真正的失败。”\n官员们说，他们目前看到俄罗斯对美国执法网络的扫描有所增加，并敦促提高警惕。\n俄罗斯进攻的网络部分很可能在空中轰炸或导弹袭击之前开始，并可能在整个冲突期间持续下去。\n一名官员表示，美国一直在与乌克兰合作，加强其基础设施网络，防止俄罗斯可能的网络攻击，并将继续这样做，以应对全面攻击。\n联邦调查局和国土安全部网络官员在周一的电话会议上敦促参与者修补所有系统，并敦促他们报告任何异常情况，无论有多小。他们说，他们的目标是能够探测到美国网络内部可能表明俄罗斯活动的最小地震。这将有助于国土安全部和联邦调查局确定受影响的网络，并协助做出回应。领导此次通话的官员还强调，政府和其他网络安全人员需要制定一个计划，以防他们的网络受到攻击或破坏。\n几份情报公告在通话前发出，其中一份日期为1月23日，由国土安全部情报与分析办公室发布，标题为“警告俄罗斯入侵乌克兰时可能对美国进行网络攻击”\n“我们评估俄罗斯将考虑发起对本国的网络攻击，如果它认为美国或北约对俄罗斯可能入侵乌克兰的威胁会威胁到其长期国家安全，”公告说。“俄罗斯拥有一系列攻击性网络工具，可以用来对付美国网络——从低级拒绝服务到针对关键基础设施的破坏性攻击。然而，我们评估，俄罗斯在国内实施破坏性或破坏性网络攻击的门槛可能仍然很高，我们没有采取行动。”尽管过去有网络间谍活动和潜在的预先部署行动，但被观察到的莫斯科直接对美国的关键基础设施实施此类网络攻击。\"\n&#34;当前乌克兰军事升级的演变性质&#39；俄罗斯的边界以及莫斯科和华盛顿之间正在进行的对话可能会影响俄罗斯&#39；美国的行动，包括针对美国的选项，以及#34；它说。\n在周一的通话中，官员们表示，美国目前看到俄罗斯关于乌克兰的虚假信息和错误信息有所增加。联邦调查局和国土安全部发布了一份关于虚假信息增加的情报公告。他们还向与会者发送了其他情报公告、咨询和技术指标，这些信息与俄罗斯此前成功对美国网络进行的网络攻击有关。", "note_en": "The Federal Bureau of Investigation and the Department of Homeland Security on Monday warned law enforcement, military and others charged with overseeing critical U.S. infrastructure to be prepared for potential Russian cyberattacks in conjunction with a  possible invasion of Ukraine.\n During a Monday afternoon conference call,  the nation’s top cybersecurity officials briefed state and local government agencies and cybersecurity personnel, warning them to look out for signs of Russian activity on their networks. The federal officials also urged those on the call to dramatically lower their threshold for reporting suspicious activity.\n A Russian invasion of Ukraine could begin at any time, the officials said, and the military action is also likely to be accompanied by cyberattacks targeting both Ukrainian and U.S. networks. Officials underscored that the U.S. believes Russia’s invasion of Ukraine is likely to begin with aerial bombings and missile attacks and in conjunction with cyber operations.\n Two people who were on the call told Yahoo News that they were alarmed by how many people on the call appeared not to know the process for reporting suspicious cyberactivity.\n “This is the most basic thing: How and to who do you report suspicious activity on your network?” one person said. “That people don&#39;t know what to do at this point is just a real failure.”\n Officials said they are currently seeing an uptick in Russian scanning of U.S. law enforcement networks and urged a heightened state of vigilance.\n The cyber component of the Russian offensive is likely to begin just before an aerial bombing or missile attacks and would be likely to continue throughout the conflict.\n The U.S. has been working  with Ukraine to harden its infrastructure networks from likely Russian  cyberattacks and will continue to do so  as it braces for an all-out assault, one official said.\n  FBI and DHS cyber officials urged participants on Monday’s call to patch all systems and urged them to report anything unusual, no matter how small. Their goal is to be able to detect the smallest of tremors inside U.S. networks that might indicate Russian activity, they said. This will help DHS and the FBI to identify the impacted networks and assist in a response. The officials leading the call also stressed the need for government and other cybersecurity personnel to have a plan in place in the event their network is targeted or compromised.\n  Several intelligence bulletins were sent out ahead of the call, including one dated Jan. 23 from DHS’s Office of Intelligence and Analysis titled “Warning of Potential for Cyber Attacks Targeting the United States in the Event of a Russian Invasion of Ukraine.”\n “We assess that Russia would consider initiating a cyberattack against the Homeland if it perceived a US or NATO response to a possible Russian invasion of Ukraine threatened its long-term national security,” the bulletin states. “Russia maintains a range of offensive cyber tools that it could employ against US networks — from low-level denials-of-service to destructive attacks targeting critical infrastructure. However, we assess that Russia&#39;s threshold for conducting disruptive or destructive cyberattacks in the Homeland probably remains very high and we have not observed Moscow directly employ these types of cyberattacks against US critical infrastructure — notwithstanding cyber espionage and potential prepositioning operations in the past.”\n  &#34;The evolving nature of the current military escalation on Ukraine&#39;s border and ongoing dialogue between Moscow and Washington could influence Russia&#39;s actions, including options for targeting the United States,&#34; it states.\n During Monday’s call, officials said the U.S. is currently seeing an uptick in Russian disinformation and misinformation about Ukraine. The FBI and DHS sent out an intelligence bulletin on the increase in disinformation. They also sent participants on the call other intelligence  bulletins and advisories and technical indicators associated with previous successful Russian cyberattacks against U.S. networks.", "posttime": "2022-02-15 12:30:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,俄罗斯,美国联邦调查局,fbi,网络", "title": "独家报道：美国联邦调查局和国土安全部警告美国官员，俄罗斯可能发动与入侵乌克兰有关的网络攻击", "title_en": "Exclusive: FBI and DHS warn U.S. officials of possible Russian cyberattacks linked to invasion of Ukraine", "transed": 1, "url": "https://www.yahoo.com/news/exclusive-fbi-and-dhs-warn-us-officials-of-possible-russian-cyber-attacks-linked-to-invasion-of-ukraine-220516786.html", "via": "", "real_tags": ["美国", "俄罗斯", "美国联邦调查局", "fbi", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073409, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本月早些时候，一名自称“灰帽”的黑客想出了如何欺骗以太坊伸缩解决方案乐观主义者，使其有效打印出无限量的以太。\n软件工程师杰伊·弗里曼（Saurik online）没有利用这一漏洞。相反，他向乐观主义的开发团队报告了这个问题，后者向他支付了200万美元的漏洞赏金。\n弗里曼最出名的可能是他在Cydia上的工作，Cydia是一家为越狱iPhone开发的应用商店。然而，最近他一直在寻找区块链上的漏洞。\n根据弗里曼网站上的一份细分数据，他在研究所谓的“纳米支付协议”时发现了这个小故障\n乐观主义就是其中之一。它们允许用户发送少量加密信息，而交易费用很低，尽管需要进行安全权衡。\n与Wormhole等区块链桥梁类似，该平台制造了仅存在于乐观主义网络上的替代以太代币。\n用户首先将他们的ETH锁在智能合约中作为抵押品，以接收他们的代币，该代币是借条的两倍。\n与链上交易（几乎即时）相比，这些代币可以更快、更便宜地进行交易，这使乐观成为扩展以太坊的潜在“第二层”（L2）解决方案。\n当乐观主义者想要兑现他们的借条时，他们必须先等一周，他们的“真正的”以太代币才能发行。\n弗里曼在乐观主义者的代码中发现了一个漏洞，该漏洞迫使智能合约删除自身并将相关信息返回给发送者。\n乐观主义的“自毁”功能将crypto返回给发送者，但保留了相关的链外信息。\n这可能会被用来欺骗智能合约，使其在故障中循环——从而创造出无限的“第2层”加密。\n该漏洞产生的乙醚是假的，但弗里曼表示，它可能会对更广泛的加密生态系统造成严重破坏。\n弗里曼写道：“有了无限制的白条供应，你可以去L2上运行的每一家分散化交易所，扰乱它们的经济，购买大量其他代币，同时让连锁店的本币贬值。”。\n这些安全漏洞被称为溢出漏洞。早在2010年（比特币还是婴儿的时候），就有人利用该代码创造了1840亿比特币。\n正如中本聪（Satoshi Nakamoto）预期的那样，它用软叉重置区块链，并将其返回到2100万BTC的硬编码限制。\n有趣的是，弗里曼说，以太坊区块链探索者以太扫描公司的人在去年圣诞节前夕偶然发现了这个漏洞，但可能还没有意识到它的潜力。\n“坦率地说，感觉好像有人注意到了这个漏洞——看到Etherscan在合同被破坏后保持了平衡——甚至玩了一会儿，但没有意识到它是可利用的。”\n弗里曼认为，加密的“高风险”性质意味着破坏安全性的漏洞不应该首先被部署。\n我&#39；d错过了周四的确认，但@bobanetwork决定额外向我支付（最高）10万美元的臭虫奖金，这是对我的以太坊L2臭虫的总奖励&#34；肆无忌惮的乐观&#34；——$2,100,042! （…我认为这可能真的创造了一个新纪录？）https://t.co/VvoOD0VgLB\n-杰伊·弗里曼（索里克）（@saurik）2022年2月13日\n弗里曼指出，他有时会“回避”以“权力下放或安全的基本问题”来协助区块链项目，因为这些技术的核心原则“不能是事后思考的”\n“这些东西太重要了，不能迅速发布，也不能在现场调整设计，”他写道（我们的重点）。\n“然而，我们看到一个又一个加密项目试图将其核心设计的成本外部化，让人们只能得到间接补偿，而不是建立一个围绕数学家、经济学家和安全专家的团队。”", "note_en": "A self-styled “grey hat” hacker figured out how to trick Ethereum scaling solution Optimism into effectively printing unlimited Ether earlier this month.\n Software engineer Jay Freeman (who goes by Saurik online) didn’t leverage the exploit. Instead, he reported the issue to Optimism’s dev team, who paid him a $2-million bug bounty.\n Freeman is probably best known for his work on  Cydia, the app store for jailbroken iPhones. However, more recently he’s been looking for bugs on blockchains.\n According to a  breakdown on Freemans’ website, he discovered the glitch while looking into so-called “nano payment protocols.”\n Optimism is one of these protocols. They allow users to send  small amounts of crypto with little transactions fees, albeit with security tradeoffs.\n Similarly to  blockchain bridges like Wormhole, the platform mints alternative Ether tokens that exist only on Optimism’s network.\n Users first lock their ETH inside a smart contract as collateral to receive their tokens, which double as IOUs.\n These tokens can be then be transacted quicker and cheaper compared to on-chain transactions (almost instantly), which makes Optimism a potential “layer 2” (L2) solution for scaling Ethereum.\n When Optimism users want to cash out their IOUs, they must  first wait one week before their “real” Ether tokens are released.\n  Freeman discovered a glitch in a section of Optimism’s code which forces smart contracts to delete themselves and return related Ether to the sender.\n Optimism’s “SELFDESTRUCT” function returned crypto to the sender but kept their related off-chain Ether IOUs.\n This could be exploited to trick smart contracts into  looping through the glitch — thus minting infinite “layer 2” crypto.\n The Ether created by the bug was counterfeit but Freeman suggested it could wreak havoc across the wider crypto ecosystem.\n “With your unbounded supply of IOUs, you could go to every decentralized exchange running on the L2 and mess with their economies, buying up vast quantities of other tokens while devaluing the chain’s own currency,” wrote Freeman.\n These security flaws are  known as overflow bugs. Back in 2010 (when Bitcoin was still a baby), someone  exploited the code to mint 184 billion BTC.\n It took a soft fork to reset the blockchain and return it to its hardcoded limit of 21 million BTC, as  Satoshi Nakamoto intended.\n  Interestingly, Freeman said someone from Ethereum blockchain explorer Etherscan had stumbled across the bug before, on Christmas Eve last year, but  may not have realized its potential.\n “It frankly felt like someone had noticed the bug — seeing that Etherscan left the balance in place after the contract was destroyed — and even played with it a bit but hadn’t realized it was exploitable.”\n Freeman believes that the “high stakes” nature of crypto means bugs that undermine security shouldn’t make it to deployment in the first place.\n I&#39;d missed the confirmation of this on Thursday, but  @bobanetwork had decided to additionally extend to me their (maximum) $100k bug bounty payout, making the total reward for my Ethereum L2 bug–&#34;Unbridled Optimism&#34;–$2,100,042! (…I think this might actually set a new record?)  https://t.co/VvoOD0VgLB\n— Jay Freeman (saurik) (@saurik)  February 13, 2022\n  Freeman noted that he sometimes “balks” at assisting blockchain projects with “basic issues of decentralization or security,” as those core tenets of the technology which “can’t be afterthoughts.”\n “This stuff is too important to be  releasing quickly and adjusting the design in the field,” he wrote (our emphasis).\n “And yet, we see crypto project after crypto project trying to externalize the cost of their  core design to people being only indirectly compensated, rather than building a team around mathematicians, economists, and security experts.”", "posttime": "2022-02-15 12:25:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "打印,漏洞,黑客,ve", "title": "黑客本可以打印无限量的“以太”，但却选择了200万美元的漏洞赏金", "title_en": "Hacker could've printed unlimited 'Ether' but chose $2M bug bounty instead", "transed": 1, "url": "https://protos.com/ether-hacker-optimism-ethereum-layer2-scaling-bug-bounty/", "via": "", "real_tags": ["打印", "漏洞", "黑客", "ve"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073408, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我会为你节省一点时间；DR：如果你喜欢第一个游戏，而且它的前景听起来不错，那就停止阅读，开始玩吧。然而，如果你在寻找不同的东西，这绝对不是。作为“下一代”的展示，这是一个令人困惑的组合，华丽的图形和十年前的游戏玩法概念，还没有被赋予如此多的新涂层（不同于游戏中的其他所有人）。\n地平线：禁地西部（以下简称HFW）是一个足够大的游戏，当我开始整理这篇评论时，已经有20多个小时了，我甚至还没有遇到评论指南警告不要包含的东西。当我完成介绍时，我意识到我以为的介绍实际上只是介绍的介绍；现在我明白了，在那一刻，我才刚刚开始真正的介绍，15个小时后就来到了比赛现场。\n但我已经超越了自己。HFW是《地平线：零黎明》（Horizon:Zero Dawn）的续集。这是一款PS4旗舰游戏，来自游击队游戏，采用了育碧软件（Ubisoft）开创并定期重复的现已为人熟知的开放世界方案。看地图，去一个兴趣点，解锁新任务和收藏品，让你进入地图的下一部分，冲洗并重复大约100个小时。\n然而，尽管开放世界的疲劳早在2017年就开始了，但原版游戏提供了一些新鲜的东西——主要是因为一个高度原创的背景和故事。人们想探索广阔的世界，不仅仅是为了从列表中勾选事物，而是因为他们访问过的每个地方或战胜的敌人都为这一惊人丰富而完整的传说增添了新的趣闻。\n游击队的诀窍是在大揭露之后继续让这个故事变得有趣：人类基本上已经毁灭了自己，留下了一个人工智能来管理被摧毁的地球的地形——一个自我毁灭的人工智能，以及人类与机器之间脆弱的平衡。在揭示了数千年的历史、阿洛伊作为系统设计师克隆人的身份，以及她战胜了流氓AI元素冥府之后，还有什么可能的惊喜？\n我将避开破坏者，但我只想说，故事仍在继续，也许没有像原著那样沉着，但范围扩大了，令人满意，回答了许多问题，证实了许多猜测。它以非常非常长的时间和令人震惊的分散注意力的方式实现了这一点。\n必须马上说HFW看起来非常惊人。世界是美丽的，巨大的，多样的。有十几次，我停在一些我作为正常过程的一部分到达的远景，想着“现在这是标题图像”，半小时后，我发现了另一个更惊人的景象。\n从部落城镇到许多自然生物群落和废墟，你所经过的每一个环境都有令人信服的细节呈现。有趣的是，“现代”地区感觉最假。我在PS5上以“性能”模式玩这个游戏，它的目标是更高的帧速率，而不是4K分辨率，4K分辨率增加了一些细节，但对可玩性来说是致命的。即使在1080p，有时我也几乎无法相信我所看到的（我的意思是相反的：它非常可信）。绘制距离和真实的雾和灯光特别可爱。\n如果你能等一下在PS5上玩这个，我推荐你。我没有在PS4上玩过，但我认为它会不那么令人愉快，因为在我看来，图形和加载时间都很短。\n这些角色也是我见过的最好的，除了《战神》之外——但那部游戏的演员阵容要有限得多。在HFW中，你有几十到几百个NPC四处游荡，提供任务，遭到攻击，等等，它们都被渲染得非常好。与你聊天的人从事工作或购买物品都是高度个性化的，即使在区域内也是如此。而你一路上旅行的角色比任何其他游戏中的主要角色都要详细。\n为使未来成为一个多样化的地方而投入的关怀水平也很容易让人欣赏。在游戏的每一个环节都可以找到各种各样的人：阳光普照的平原上，人们穿着树叶，除了苗条的体型外，没有任何其他倾向……可能是因为他们大部分时间都花在园艺上，而不是像Chainscrap的那些喝啤酒的粗壮矿工那样。诚然，家族和生活方式之间存在偏见，但没有人基于种族、性别或年龄进行歧视。我会说，部落色彩和风格偶尔会让我感觉不对劲，但我不知道我在这里是否过于敏感。当然，这是科幻幻想的洞穴居住者的东西，但我会把它留给其他人（Eurogamer的Malindy Hatfield扬起眉毛）来讨论它是否感觉不合适。\n可悲的是，图形才是“下一代”的起点和终点。游戏的其他方面，虽然比以往任何时候都要多，表现得更好，但几乎正是我们在开放世界游戏中玩了十多年的东西。\n（不过，我要感谢开发者们提供了广泛而精细的可访问性和难度选项。不管我怎么批评，这款游戏是一个令人印象深刻、令人兴奋的世界，任何人都应该能享受它，他们为此做了很多。）\n为了让你初步了解玩HFW的感觉，有17类任务。\n当然，你通常的“主要”和“次要”任务，但也包括“差事”、“合同”和自我分配的“工作”、叛军藏身地和营地（单独追踪）、战斗挑战、狩猎地点等等。\n地图上到处都是代表各种机器龙出没的图标，你需要收集这些图标，以便随时制作和改进你想要的十几种武器——这取决于你所在地区的主导元素、你的装甲加成、你选择的升级路径等等。\n然后是古老的遗址，到处都是推块和平台，在N64游戏中就在家里；被称为坩埚的未来主义地下城，主要是线性障碍课程，赋予你新的恐龙黑客能力；数十个附加任务，可以获得技能点和新物品（一些有用，很多多余）；必备的桌面游戏中的游戏与收藏品。甚至有人尝试过一种卡丁车赛车，在荒原上驰骋，向你的赛车同伴们狂轰滥炸，收集新的武器和提速之类的皮卡车。\n无论你走到哪里，任务和地标都像入侵的红芽一样席卷大地。似乎每个角落都有商队遭到袭击，一位亲人失踪，一座城镇受到威胁，山上的光芒令人担忧。阿洛伊愉快地同意帮助所有人，尽管世界末日是一个艰难的最后期限。\n它有助于每一次互动和每一次探索都得到充分和相当好的表达和行动；虽然经常是“到这里来与之战斗”，但这些都有名字、面孔和后果的优势，不管它们多么短暂。我帮助一个小镇上热爱树叶的农民击退了一些袭击者，他们找到了制造武器所需的一些金属，如果我听说过的话，这是一次从RPG廉价品箱中寻找武器的任务。但我喜欢它，因为我喜欢这位厌倦了世界的镇长，他看起来和听起来都像一个真正的花花公子，他即席哲学地讲述了他镇上居民死后种植的白花的意义，并在这一切结束时向我鞠了一躬（可怕的）。\n有几十种这样的体验，每一种体验都像下一种一样可以跳过，但每一种体验都给出了一个只有在大多数其他游戏中才会提到的细节级别。它们可能不是特别原创，甚至写得不好，但它们的内容丰富到了惊人的程度。我想公平地说，这似乎也是下一代的功能。（其他一些开放世界的游戏，如《刺客信条：瓦尔哈拉》在一定程度上做到了这一点，但它并没有像这里那样登陆。）\n当然，在《战神》中，每一个任务都很重要——但在这里，我发现，我们有了几十年来一直在忍受的终极且大大改进的次要任务形式。你不会接受社区委员会的命令，把软体动物的碎屑或浣熊尾巴交给一个不知名的冒险家协会。你在帮助这个人，他的真实面容和匹配的声音让他看起来像一个真实的角色，找出他妻子发生了什么。感觉不一样，即使基本上是一样的“杀死8只地窖里的老鼠”。\n也就是说，对于那些觉得上一场游戏没完没了的部族战争和熟悉的RPG冲突难以忍受的人来说，这里还有很多。禁地西部有什么？戏主要的任务也有“侧任务综合症”：无论你在哪里需要完成重要的任务，总有一些军长或市长想让你先清除那些偷牛贼，或者驱逐对手，或者从废墟中取回什么东西。\n这并不是说这些都不好，就像其他的一样，它们表现得很好，细节也很详细，尽管写得很冷淡，但它们总是有一种“来吧，让我们继续吧！”一些镇里的长老们又开始了两分钟的谈话，讨论这个满头火焰的外地人是如何不尊重他们的传统的……但是尊敬的Makito，我们的人民需要这样那样……等等等等。就像一个网络电视节目（以及原版游戏，以及大多数开放世界游戏），HFW在很大一部分内容之间一次讲述一个令人愉快的主要故事。\n然而，我对此感到恼火的部分原因是我在时间压力下回顾了比赛。这不是一个一次玩四个小时的游戏，而是45分钟：坐下来，完成你附近的任务，朝着下一个主要故事目标取得一些进展，收获一些小动物，升级你的弓，然后关掉它，去吃晚饭。你可能会连续一年这样做，而且永远不会没有事情可做。当你花太多时间在游戏中时，你马上就会开始觉得时间很糟糕。\n我发现自己对HFW失去耐心的地方，尽管它很漂亮，但却是陈旧的人工智能、战斗和推进系统。\n人工智能真的很令人失望，它让你想起了你想体验的任何一代人中最愚蠢的人类和野生动物。卫兵们从半盲的机器人到鹰眼杀人机器，然后再回来；盟军有死亡的愿望，但有无限的健康；小动物们争先恐后地把自己扔到你的机器马脚下，当它遇到一块无法跨过的鹅卵石时，机器马每40英尺就会停下来一次。机器恐龙虽然简单，但至少作为野生怪物令人信服。\n战斗更具战略意义，而非战术意义，因为在开始的一、两次投篮或偷袭之后，它会让人感觉草率而混乱。这有时可能很有趣，但无法锁定敌人，以及许多来袭攻击的持续时间和影响范围（以及它们来自屏幕外的习惯）都非常长，这意味着你需要花费大量时间在战场上盲目地旋转，然后转来转去进行几次突击。当你瞄准时，很难判断你瞄准的发光物体是一个薄弱点还是仅仅是一个普通的发光点——当你试图精确射击时，你失去了所有的周边视觉，另一个敌人将你蒙蔽。幸运的是，只要你没有被射中（这种情况确实发生），你就相当耐用。\n在这场比赛中，提高几乎是所有的统计数据：无论你有多好，几个小时后你都不会有机会使用你的发令弓，因为它的基础伤害太低了。武器和装甲的改进都是“数量增加”：+10%冰伤害，+12%等离子防御，等等。\n你投资的技能树非常传统：数字和情景技能的混合，比如一次射出三支箭或暂时造成更多的元素伤害。我很少在游戏中使用这些技能，因为在混乱的战斗中，我不记得装备在什么武器上，甚至不记得如何激活我选择的“英勇激增”，这是一种终极技能。我意识到这听起来很不合时宜，但对我来说，这更像是一个拥有太多工具却没有明确好处的问题。有一支超级箭我可以隐形射出，这很好，但在与老板的战斗中，它并没有什么用处。相反地，当你很少能在一个强大的敌人身上获得足够的打击，使其在被击打之前变得有价值时，投资近战似乎同样毫无价值。所以你必须是一个多面手，最终选择瘫痪。\n在整个游戏中，有一种老派游戏“逻辑”与下一代的视觉效果相冲突的感觉。任务有严格的定义和脚本，不需要或不允许开箱思考。真的没有按自己的方式做事的自由——几乎所有事情都只有一种方式。虽然你有很多可选的活动，但这些活动没有选择。\n从这些方面来看，HFW感觉非常像我们已经玩了20年的游戏，它是一套经过验证的、令人愉快的（如果疲劳的话）游戏元素的最终和最伟大的版本。\n对我来说，这是对下一代游戏的警告，我们在新的自由度、交互性、人工智能和其他方面听到了很多，但到目前为止，我们收到的大多是同样的老东西，上面有一层非常吸引人的油漆。当然，图形是受欢迎的——它使角色更真实，世界更令人信服。但游戏还是一样。\n也就是说，这是一个有趣的游戏，是一个原创的粉丝们会喜欢的实质性的嬉戏。然而，随着每个月或两个月都会有大型游戏问世，我希望有一款游戏能够超越它的前辈，不仅仅是在范围和视觉丰富性上，而是在创意和有价值的游戏体验上。", "note_en": "I’ll save you a little time with a  TL;DR: If you liked the first game, and the prospect of a  lot more of it sounds good, stop reading and start playing. If you’re looking for something different, however, this definitely ain’t it. And as a showcase of the “next generation” it’s a baffling mix of gorgeous graphics and decade-old gameplay concepts that haven’t been given so much as a fresh coat of face paint (unlike everyone else in the game).\n Horizon: Forbidden West (hereafter referred to as HFW) is a game large enough that by the time I’d started putting together this review, more than 20 hours into it, I had not yet even encountered the things the review guidelines warned against including. When I finished the intro, I realized that what I  thought was the intro was actually just the intro to the intro; now I see that at that moment, I was only just beginning the real intro, and after 15 hours had arrived at  The Game.\n   But I’m getting ahead of myself. HFW is the sequel to Horizon: Zero Dawn, a PS4 flagship title from Guerilla Games that adopted the now familiar open-world scheme pioneered and repeated regularly by Ubisoft. Look at the map, go to a point of interest, unlock new quests and collectibles to get you to the next part of the map, rinse and repeat for about a hundred hours.\n Yet in spite of the open-world fatigue already setting in back in 2017, the original game provided something fresh — largely because of a highly original setting and story. People  wanted to explore the vast world, not simply to check things off a list, but because every location they visited or enemy they overcame added new tidbits to the surprisingly rich and complete lore.\n The trick Guerilla had to pull off was to continue to make that story interesting after the big reveal: that humanity had essentially destroyed itself, leaving behind an AI to manage the terraformation of the ruined Earth — an AI that self-destructed, along with the fragile balance of mankind with machines. After the revelation of thousands of years of history, of Aloy’s identity as a clone of the system’s designer, and her victory over the rogue AI element Hades, what possible surprises could remain?\n  I’ll steer clear of spoilers, but suffice it to say that the story continues, perhaps without  quite the aplomb of the original but with an expanded and satisfying scope that answers many questions and confirms many speculations. And it does so at great, great length and with a truly stupefying amount of distractions.\n   It has to be said right off the bat that HFW looks phenomenal. The world is beautifully sculpted, large and varied. A dozen times I stopped at some vista I’d arrived at as part of the normal course of things, thinking “now  this is the header image,” before finding another even  more amazing view half an hour later.\n Each environment you travel through is convincingly rendered in extreme detail, from tribe towns to the many natural biomes and ruins. Funnily enough it’s the “modern” areas that feel the fakest. I played the game on PS5 in “Performance” mode, which aims for a higher frame rate, rather than the 4K resolution, which added a bit of detail but was fatal to playability. Even at 1080p, sometimes I could barely believe what I was seeing (by which I mean the opposite: that it was very believable). The draw distance and realistic fog and lighting are particularly lovely.\n If you can wait to play this on PS5, I’d recommend it. I didn’t play on PS4 but I expect it will be considerably less enjoyable, given how large a role the graphics and short load times played in my opinion of the game.\n The characters too are the best I’ve seen, with the possible exception of God of War — but that game had a much more limited cast. In HFW, you have dozens — hundreds — of NPCs wandering around, offering quests, getting attacked, and so on, and they’re all extremely well rendered. The people you chat with to take on jobs or buy items are all highly individual even within regions. And the characters you travel with along the way are more detailed than the  main characters just about any other game.\n  The level of care put into making the future a diverse place is also easy to appreciate. All different kinds of folks are to be found in every part of the game: the sunny plains peopled by frond-wearing leafniks don’t tend toward anything but a slimmer body type… probably because they spend most of their time gardening, compared with the beefy beer-swilling miners of Chainscrape. Bigotry is on display between clans and lifestyles, to be sure, but no one discriminates based on race, gender or age. I will say the tribal paint and style occasionally rubbed me the wrong way, but I don’t know if I’m being oversensitive here. It’s sci-fi fantasy cave-dweller stuff, to be sure, but I’ll leave it to others ( Eurogamer’s Malindy Hatfield raises an eyebrow) to discuss whether it feels inappropriate.\n Sadly, the graphics are really where the “next generation” thing starts and ends. The other aspects of the game, while more  numerous and better  rendered than ever before, are almost exactly what we’ve been playing in open world games for a decade and more.\n (However, I would like to thank the developers for the wide and granular set of accessibility and difficulty options. Whatever my criticisms, the game is an impressive and exciting world that should be able to be enjoyed by anyone, and they’ve done a lot to make that possible.)\n   To give you a starting idea of what it’s like to play HFW, there are  17 categories of quests.\n Your usual “main” and “side” quests, sure, but also “errands,” “contracts”  and self-assigned “jobs,” rebel hideouts and camps (tracked separately), combat challenges, hunting sites… the list goes on.\n The map is littered with icons representing the haunts of various robosaurs, which you’ll need to harvest in order to craft and improve the dozen or so weapons you’ll want to have on hand at all times — depending on the dominant element of the region you’re in, your armor’s bonuses, your chosen upgrade path, etc.\n Then there are the ancient ruins, full of block-pushing and platforming that would be right at home in an N64 game; the futuristic dungeons known as Cauldrons, which are largely linear obstacle courses that grant you new dino-hacking abilities; dozens of side quests that grant skill points and new items (some useful, many redundant); the requisite tabletop game-within-a-game with collectible pieces. There’s even an attempt at a sort of kart racer, riding through the wastelands blasting away at your fellow racers and collecting pickups like new weapons and speed boosts.\n Everywhere you go, quests and landmarks spring up like the invasive red sprouts taking over the land. It seems around every corner some caravan has been attacked, a loved one is missing, a town threatened, a glow in the hills feared. Aloy cheerfully agrees to help everyone despite a hard deadline being placed on the end of the world.\n It helps that every interaction and every quest is fully and quite well voiced and acted; while frequently a matter of “go here and fight this,” these have the advantage of names and faces and consequences, however fleeting. I helped a small town of the leaf-loving farmers fight off some raiders after locating some metal they needed to make weapons, a quest out of the RPG bargain bin if I ever heard of one. But I enjoyed it because I liked how the world-weary town chief, who looked and sounded like a real dude, extemporized philosophically about the meaning of the white flowers his townsfolk plant when they die, and gave me his (terrible) bow at the end of it all.\n There are dozens and dozens of such experiences, each one as skippable as the next, but each also given a level of detail that would only be gestured at in most other games. They may not be particularly original, or even well written, but they’re fleshed out to a remarkable degree. I suppose it’s only fair to say that this does also seem like something of a next-generation feature. (Some other open-world games, like Assassin’s Creed: Valhalla, have done this to some degree but it hasn’t landed the way it does here.)\n  Sure, in God of War every quest would actually  matter — but here I find we have the ultimate and much improved form of the side quests we’ve been enduring for decades. You’re not taking orders from a community board and turning the mollusc scrapings or raccoon tails in to a faceless Adventurer’s Guild. You’re helping  this guy, whose realistic face and matching voice make him seem like an actual character, find out what happened to his wife. It feels different, even if it’s fundamentally the same “kill 8 were-rats in the cellar” fare.\n That said, for those who found the last game’s interminable clan warfare and familiar RPG conflicts unbearable, be warned there’s a  lot more of it here. What’s in the Forbidden West? Drama! The main quest suffers from side quest syndrome as well: Wherever you need to accomplish something significant, there’s some warchief or mayor who wants to you clear out those robo-cattle rustlers first, or oust a rival, or retrieve the whatsit from the ruins.\n  It’s not that these are all bad, exactly — like the others, they’re well acted and detailed, though indifferently written — but there’s a constant sense of “come on, let’s get on with it!” as yet another two-minute conversation begins between some town elders on how this flame-haired outlander doesn’t respect their traditions…but honored Makito, our people need such and such… and so on and so forth. Like a network TV show (and the original game, and most open-world games), HFW doles out its enjoyable main story beats a handful at a time between large portions of filler.\n Part of my annoyance at this, however, is down to the fact that I was reviewing the game under time pressure. This is not a game to play four hours at a time, but 45 minutes: sit down, finish that side quest you’re near, make some progress toward the next main story goal, harvest a few critters and upgrade your bow, then shut it down and go to dinner. You could probably do that for a year straight and never run out of things to do. It’s when you spend too long in the game at once you start seeing the time suck for what it is.\n   Where I found myself losing my patience with HFW, despite its beauty, was in the stale AI, combat and progression systems.\n The AI really is disappointing, recalling the dumbest humans and wildlife of any generation you’d like to sample. Guards go from half-blind automatons to eagle-eyed killing machines and back; allies have a death wish but unlimited health; the critters compete to throw themselves under the feet of your robotic steed, which itself stops short every 40 feet when it encounters a pebble it can’t step over. The robotic dinos are at least convincing as wild monsters, though simple.\n Combat is more strategic than tactical, since after the opening gambit of taking a pot shot or two or a sneak attack, it feels sloppy and chaotic. That can sometimes be fun, but the inability to lock onto an enemy and the extremely large durations and areas of effect of many incoming attacks (and their habit of coming from offscreen) mean you spend a lot of time blindly rolling around the battlefield before spinning around to take a few potshots. When you take aim, it can be very hard to tell whether the glowing thing you’re aiming at is a weak spot or just plain glowing — and while you’re trying to take a precise shot, you lose all peripheral vision and another enemy blindsides you. Fortunately you’re quite durable as long as you don’t get one-shotted (which does happen).\n Improving in this game is almost all stats: No matter how good you are, you won’t stand a chance with your starter bow after a few hours because its base damage is too low. Improvements to weapons and armor are all “number go up”: +10% ice damage, +12% plasma defense, and so on.\n  The skill tree you invest in is very traditional: a mix of numbers and situational skills like firing three arrows at once or temporarily doing more elemental damage. I rarely used these skills in my playthrough as in the chaos of combat I couldn’t remember which was equipped on what weapon or even how to activate my selected “valor surge,” a sort of ultimate. I realize that sounds very noobish, but to me it’s more a question of having too many tools with unclear benefits. It’s nice to have a super-arrow I can shoot from stealth, but it’s less than useless in a boss fight. Conversely, investing in melee seems equally worthless when you rarely can get enough hits off on a tough enemy to make it worthwhile before being slapped across the landscape. So you have to be a generalist, and end up having choice paralysis.\n And throughout the game there’s a sense of old-school gaming “logic” clashing with the next-gen visuals. Missions are rigidly defined and scripted, no out of the box thinking wanted or allowed. There’s really no freedom to do things your own way — there’s almost always one way to do everything. And though you have many optional activities, those activities have no options.\n In these ways HFW feels very much like the games we’ve all been playing for 20 years, the final and grandest version of a proven and enjoyable, if tired, set of gameplay elements.\n To me this is a warning for the next generation of gaming, which we hear a lot about in terms of new levels of freedom, interactivity, AI and other aspects, but so far have received mostly the same old thing with a highly attractive coat of paint on top. The graphics are welcome, for sure — it makes the characters more real, the world more convincing. But the game remains the same.\n That said, it’s a fun game and a substantial romp that fans of the original will love. With huge games coming out every month or two, however, I hope that one will come along that one-ups its predecessors not simply in scope and visual richness, but in ideas and rewarding gameplay.", "posttime": "2022-02-15 12:17:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,地平线,forbidden", "title": "《地平线：禁地西部》是即将离任的游戏一代的最终老板", "title_en": "\n\t\t\t\t‘Horizon: Forbidden West’ is the final boss of the outgoing gaming generation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/horizon-forbidden-west-is-the-final-boss-of-the-outgoing-gaming-generation/", "via": "", "real_tags": ["游戏", "地平线", "forbidden"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073407, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Blackyte是一家勒索软件即服务（RaaS）公司，将其勒索软件基础设施出租给他人，以换取一定比例的勒索收益。这伙人在2021年7月开始开发软件漏洞，瞄准全球范围内的企业受害者。虽然Blackyte取得了一些初步成功——安全研究人员追踪了针对美国制造业、医疗保健业和建筑业的攻击。，欧洲和澳大利亚——几个月后，网络安全公司Trustwave发布了一个免费解密工具，允许Blackyte受害者免费恢复他们的文件，这帮人遭遇了一场灾难。该组织过于简单的加密技术让一些人相信勒索软件是业余爱好者的作品；勒索软件下载并执行相同的密钥来加密AES中的文件，而不是每个会话的唯一密钥。\n尽管遭遇了这一挫折，但似乎BlackByte的行动已经卷土重来。在周五发布的警报中，联邦调查局和特勤局（USSS）警告称，勒索软件团伙危害了多家美国和外国企业，包括“至少”三次针对美国关键基础设施的攻击，尤其是政府设施、金融服务以及食品和农业领域。\n该咨询提供了妥协的指标，以帮助网络捍卫者识别黑字节入侵，只是在勒索软件集团声称已经加密属于旧金山49 ER的网络之前几天发布的。在超级碗的前一天，BlackByte泄露了一些声称被盗的文件，从而披露了这次攻击。\nEmsisoft的勒索软件专家兼威胁分析师布雷特·卡洛（Brett Callow）告诉TechCrunch，虽然BlackByte不是最活跃的RaaS行动，但在过去几个月里，它一直在稳步增加受害者。然而，他补充说，由于美国政府最近对勒索软件行为者采取了行动，该团伙可能会采取谨慎的做法。\n“FBI和USSS顾问表示，Blackyte已被部署在至少三个美国关键基础设施部门，包括政府部门。有趣的是，该团伙的泄密网站上没有列出此类组织，这可能表明这些组织支付了费用，没有数据被过滤，或者Blackyte选择不发布他说：“对过滤出来的数据进行过滤。”最后的选择并非不可能：自从REvil成员被捕以来，这些团伙似乎对公布数据变得更加谨慎，尤其是在美国组织的情况下。\"\n卡洛说，虽然所有迹象都表明Blackyte总部位于俄罗斯，但因为像REvil这样的勒索软件的编码不是为了加密使用俄语或独联体语言的系统的数据，这“不应被视为是由总部位于俄罗斯或独联体的个人实施的攻击”\n他补充说：“附属机构可能与管理RAA的个人不在同一个县。”。“他们可以驻扎在任何地方——包括美国。”", "note_en": "BlackByte is a ransomware-as-a-service (RaaS) operation that leases out its ransomware infrastructure to others in return for a percentage of the ransom proceeds. The gang emerged in July 2021 when it began exploiting software vulnerabilities to target corporate victims worldwide. While BlackByte had some initial success — security researchers tracked attacks against manufacturing, healthcare and construction industries in the U.S., Europe and Australia — the gang hit a rough patch months later when cybersecurity firm Trustwave released a free decryption tool that allowed BlackByte victims to recover their files for free. The group’s simplistic encryption techniques led some to believe that the ransomware was the work of amateurs; the ransomware downloaded and executed the same key to encrypt files in AES, rather than unique keys for each session.\n Despite this setback, it appears the BlackByte operation is back with a vengeance. In  an alert posted on Friday, the FBI and the Secret Service (USSS) warned that the ransomware gang had compromised multiple U.S. and foreign businesses, including “at least” three attacks against U.S. critical infrastructure, notably government facilities, financial services and in food and agriculture.\n  The advisory, which provides indicators of compromise to help network defenders identify BlackByte intrusions, was released just days before the ransomware gang claimed to have encrypted the network belonging to the San Francisco 49ers. BlackByte disclosed the attack the day before the Super Bowl by leaking a small number of files it claims to have been stolen.\n Brett Callow, a ransomware expert and threat analyst at Emsisoft, tells TechCrunch that while BlackByte isn’t the most active RaaS operation, it’s been steadily racking up victims over the past few months. However, he adds that due to  recent action by the U.S. government against ransomware actors, the gang might be taking a cautious approach.\n “The FBI and USSS advisory states that BlackByte has been deployed in attacks on at least three U.S. critical infrastructure sectors, including government. Interestingly, no such organizations are listed on the gang’s leak site, which could indicate that those organizations paid, that no data was exfiltrated or that BlackByte chose not to release the exfiltrated data,” he said. “That final option is not unlikely: since the arrests of members of REvil, the gangs seem to have become more cautious about releasing data, and especially in the case of U.S. organizations.”\n Callow said that while all signs suggest BlackByte is based in Russia, since the ransomware, like  REvil, is coded not to encrypt the data of systems that use Russian or CIS-languages — that “shouldn’t be taken to mean the attack was carried out by individuals based in Russia or the CIS.”\n  “Affiliates may not be located in the same county as the individuals who run the RaaS,” he added. “They could be based anywhere — including the U.S.”", "posttime": "2022-02-15 12:15:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,警告,warns", "title": "FBI警告Blackyte勒索软件瞄准了我们的关键基础设施", "title_en": "\n\t\t\t\tFBI warns BlackByte ransomware is targeting US critical infrastructure\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/blackbyte-critical-infrastructure-ransomware/", "via": "", "real_tags": ["软件", "警告", "warns"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073406, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一份宣布诉讼的新闻稿称，Facebook在用户上传的照片和视频中储存了数以百万计的生物识别码。司法部长帕克斯顿说，Facebook利用用户的个人信息“发展其帝国，获得历史性的暴利”\n帕克斯顿在一份声明中说：“Facebook将不再利用人们和他们的孩子，以牺牲个人安全和福祉为代价牟利。”。“这是大科技欺骗商业行为的又一个例子，必须停止。我将继续为德克萨斯人的隐私和安全而战。”\nMeta的一位发言人在一封电子邮件中告诉TechCrunch，“这些说法毫无道理，我们将积极为自己辩护。”\n诉讼指控Facebook通过隐瞒其行为的性质欺骗了公众，使用该应用的德克萨斯人忘记了Facebook从照片和视频中捕获生物特征信息的事实。它还声称，在没有提供进一步背景的情况下，用户不知道Facebook正在向进一步利用它的其他实体披露用户的个人信息。\n“Facebook经常未能在合理的时间内销毁收集的生物识别码，使德克萨斯人的福祉、安全和保障面临越来越大的风险，”诉讼写道。“Facebook为了自身的商业利益而有意捕获生物特征信息，以培训和改进其面部识别技术，从而创造出一种强大的人工智能设备，它可以覆盖世界各地，甚至可以诱捕那些有意避免使用Facebook服务的人。”\n2021年11月，Meta宣布它正在脸谱网上关闭脸部识别系统，并且不再自动识别照片和视频中的用户。它还表示，作为此次关闭的一部分，它将删除超过10亿个人脸识别模板。但德克萨斯州官员要求Meta为其调查保留这些数据，这可能会推迟系统的全面关闭。\n这不是Meta第一次因面部识别行为而面临法律诉讼。去年3月，Facebook因违反伊利诺伊州一项旨在保护该州居民免受侵犯隐私行为侵害的法律而被勒令支付6.5亿美元。该法律《生物识别信息隐私法》（Biometric Information Privacy Act，简称BIPA）是一项强有力的州措施，近年来，它让科技公司陷入困境。针对Facebook的诉讼于2015年首次提起，指控Facebook在未经同意的情况下使用面部识别在照片中为人添加标签的做法违反了州法律。\n根据加州联邦法院的最终和解裁决，160万伊利诺伊州居民获得了至少345美元。最终的数字比Facebook在2020年提出的5.5亿美元高出1亿美元，法官认为这是不够的。Facebook在2019年禁用了自动面部识别标签功能，让它选择加入，并解决了伊利诺伊州集体诉讼中的一些隐私批评。\n6.5亿美元的和解足以对任何一家正常的公司产生重大影响，但Facebook拒绝了这一点，因为FTC在2019年对这家社交媒体巨头的隐私问题进行调查后，做出了创纪录的50亿美元罚款。\n德克萨斯州的新诉讼表明，广泛的隐私法不仅会对Meta的运营产生重大影响，还会对所有大型科技公司的做法产生重大影响。在过去几年里，一系列诉讼指控微软、谷歌和亚马逊在未经明确同意的情况下利用用户的面部训练面部识别系统，违反了法律。", "note_en": "A press release announcing the lawsuit alleges that Facebook has been storing millions of biometric identifiers contained in photos and videos uploaded by users. Attorney General Paxton says that Facebook exploited the personal information of users “to grow its empire and reap historic windfall profits.”\n “Facebook will no longer take advantage of people and their children with the intent to turn a profit at the expense of one’s safety and well-being,” Paxton said in a statement. “This is yet another example of Big Tech’s deceitful business practices and it must stop. I will continue to fight for Texans’ privacy and security.”\n  A spokesperson from Meta told TechCrunch in an email that “these claims are without merit and we will defend ourselves vigorously.”\n The lawsuit alleges that Facebook deceived the public by concealing the nature of its practices and that Texans who used the app were oblivious to the fact that Facebook was capturing biometric information from photos and videos. It also alleges, without providing further context, that users were unaware that Facebook was disclosing users’ personal information to other entities who further exploited it.\n “Facebook often failed to destroy collected biometric identifiers within a reasonable time, exposing Texans to ever-increasing risks to their well-being, safety and security,” the  lawsuit reads. “Facebook knowingly captured biometric information for its own commercial benefit, to train and improve its facial recognition technology, and thereby create a powerful artificial intelligence apparatus that reaches all corners of the world and ensnares even those who have intentionally avoided using Facebook services.”\n In November 2021, Meta  announced it was shutting down its Face Recognition system on Facebook, and would no longer automatically identify opted-in users in photos and videos. It also said it would delete over a billion individual facial recognition templates as part of this shutdown. But Texas officials asked Meta to preserve this data for its investigation, likely delaying the system’s full closure.\n  This isn’t the first time that Meta has faced legal action for its facial recognition practices. Last March, Facebook was ordered to  pay $650 million for running afoul of an Illinois law designed to protect the state’s residents from invasive privacy practices. That law, the  Biometric Information Privacy Act (BIPA), is a powerful state measure that’s tripped up tech companies in recent years. The suit against Facebook was first filed in 2015, alleging that Facebook’s practice of tagging people in photos using facial recognition without their consent violated state law.\n  Following the ruling,1.6 million Illinois residents received at least $345 under the final settlement ruling in California federal court. The final number was $100 million higher than the  $550 million Facebook proposed in 2020, which a judge deemed inadequate. Facebook  disabled the automatic facial recognition tagging features in 2019, making it opt-in instead and addressing some of the privacy criticisms echoed by the Illinois class-action suit.\n A $650 million settlement would have been enough to significantly impact any normal company, but Facebook brushed it off as it did with the FTC’s  record-setting $5 billion penalty in 2019 following its probe into the social media giant’s privacy issues.\n The new Texas lawsuit shows that widespread privacy laws could have a significant impact not only on Meta’s operations but also on all big technology companies’ practices. In the past years, a cluster of lawsuits has accused Microsoft, Google and Amazon of breaking laws when users’ faces were used to train their facial recognition systems without explicit consent.", "posttime": "2022-02-15 12:13:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,司法部长,attorney", "title": "德克萨斯州司法部长就Facebook的面部识别技术对Meta提起诉讼", "title_en": "\n\t\t\t\tTexas attorney general files lawsuit against Meta over Facebook’s facial recognition technology\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/texas-attorney-general-files-lawsuit-against-meta-over-facebooks-facial-recognition-technology/", "via": "", "real_tags": ["facebook", "司法部长", "attorney"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073405, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从畏缩和有效性的角度来看，以下是超级碗最好（和最差）的科技广告。\n一个二维码像DVD屏幕保护程序一样在黑屏上来回跳动，在明亮的颜色中循环，同时播放一首普通的科技歌曲。\n我掏出手机扫描二维码，因为为什么不呢？我的朋友在房间的另一头喊道：“别这么做！可能是病毒！或者更糟的是，加密！”\n果然，二维码打开了我手机上的Coinbase网站，为新用户提供15美元的免费比特币，无需购买。根据Coinbase首席产品官Surojit Chatterjee的说法，该广告非常受欢迎，Coinbase体验到了前所未有的流量。\n@coinbase的流量比我们多&#39；我曾经遇到过这样的情况，但我们的团队齐心协力，只需限制交通几分钟。我们现在回来了，准备好迎接你们了https://t.co/ZUJqRlnZPH.我很谦卑地见证了这一切#瓦格米\n显然，这则广告是有效的，因为他们的网站因所有流量而崩溃。但是，你知道，由于网站崩溃，他们不得不失去一些分数。\n我也不相信“与其说加密，不如说我们决定……给你一些”的营销策略。和任何投资一样，知道你在投资什么可能是一件好事！当然，你必须参与市场才能掌握它，但同样令人困惑的是，这些加密广告中没有一个真正解释了他们希望消费者投资什么。\n复古美学其实有点酷。反弹的二维码是一种风险，但我记得这个广告比其他任何广告都生动，所以它奏效了。但二维码会将你引导到一个包含报价信息的网站，而这个网站有点令人生畏。Coinbase在网站上写道“WAGMI”，这是crypto bro的俚语，意思是“我们会成功的”，意思是“我们是不会在几年内破产并导致许多人亏损的初创公司之一。”但是说WAGMI可能意味着害怕你是NGMI？\n另一个加密货币交换平台，总部位于巴哈马的FTX上个月又筹集了4亿美元的资金，估值达到320亿美元。其中一部分预算必须用于营销，那么为什么不雇佣著名的暴躁鬼拉里·大卫来拍摄他的第一个超级碗广告呢？\n广告的前提是，这位“抑制你的热情”的明星对一切都持怀疑态度，以至于错过了一些伟大的投资——他告诉爱迪生，他的灯泡是NGMI（不是直接引用），当你只能把盘子放在淋浴间时，使用洗碗机是没有意义的（恶心）。\n拉里·大卫不懂密码，所以这意味着这个新兴行业一定非常非常非常好。\n据《纽约时报》报道，FTX和广告公司dentsuMB在决定这一概念之前考虑了80个脚本，将分散金融定位为一种灯泡式创新。然后，在与《宋飞正传》联合创作者拍摄了四天之后，这则广告花了280个小时进行编辑，将7.5个小时的片段浓缩为60秒——然后，他们又花了200个小时为自己的广告制作挑逗。\n总而言之，你必须尊重我的努力（另外，拉里·大卫是我最喜欢的问题）。但该死。这是一个投入大量时间和金钱的广告，它不会教你任何关于加密如何工作的知识。\n还有另一个营销预算过高的加密交换，加密。com对FTX采取了类似的方法。他们想要明星的力量，他们想让观众相信加密货币只是科技的自然下一步。但他们对天赋的选择对体育迷来说可能更为熟悉。在30秒的时候，勒布朗·詹姆斯告诉自己一个更年轻的版本：“如果你想创造历史，你就得自命不凡。”然后，加密。com徽标出现在屏幕上。\n我们喜欢在电视上看到体育明星。但这则广告告诉我们的加密技术比Coinbase和FTX还少。再说一次，这则广告的成本可能比FTX的广告要低，充斥着服装、布景变化和特效。\n我想更多地了解这里涉及的物理知识。勒布朗是怎么回到过去的？会告诉他年轻的自己关于密码打破我们目前的时间表，使勒布朗从来没有成为NBA，这意味着佛罗里达州南部从未有一个成功的职业体育队在二十一世纪？这么多问题。\nFacebook不仅将其品牌更名为Meta，还将虚拟现实耳机的品牌从Oculus Quest（他们收购的虚拟现实公司的名称）更名为Meta Quest。\n这则广告令人困惑和沮丧。基本上，一些电子动画师——他们在Chuck E.Cheese那样的地方一起工作——失去了工作，不能再出去玩了。但通过使用Meta Quest 2，他们可以忘记生活中的挑战，在公司的社交聚会应用程序Horizon Worlds中一起成为无腿化身。\n如果目标是品牌识别，那好吧。但广告的结尾有点像，“你对现实世界不满意吗？试试metaverse！”而且，《地平线世界》远没有广告所说的那么光鲜，所以它的独创性还差一点。\n为了展示其Pixel 6手机，谷歌与超级巨星Lizzo合作，突出其真实色调功能。\n“从我还是个孩子的时候起，我的每一张年鉴照片都被拍得很糟糕，”一个声音在一张朋友穿着毕业服的照片上讲述——照片的背景是那些肤色最深的人。\n然后，谷歌展示了其“真实色调”功能拍摄的照片，该功能使用计算摄影技术正确曝光不同肤色的人的照片。照片很华丽，Lizzo唱着一首未发布的歌曲。\n他们的广告中有一首新的利佐歌曲。引用TechCrunch自己的安妮·桑德斯（Annie Saunders）的话，“我没有看超级碗，但我确实在Instagram上看到了Lizzo的像素广告，Lizzo所做的一切都是对的和好的。”\n这里真的没有什么可畏缩的，但你可以说谷歌在智能手机业务中的市场份额与苹果相比，对他们来说有点畏缩。\n麦莉·赛勒斯和她的教母多莉·帕顿联手，在两个30秒的广告中为T-Mobile的5G网络做广告。在第一则广告中，多莉·帕顿（Dolly Parton）出现在PSA中，敦促人们从AT&amp；为了他们的手机。然后，她打电话给麦莉，敦促她用自己的声音保存手机。在下一个广告中，我们看到麦莉在录音室里唱出了真挚的歌词，比如“让我们为手机做吧/他们为你做了那么多”。引用她的话，她甚至还系上了“T-Mobile”腰带，同时穿着黑色外套和皮手套。\n我很注意，因为我觉得多莉·帕顿和麦莉·塞勒斯很有趣。他们可能会抨击其他网络据称更糟糕的5G覆盖率，但嘿，本着足球的精神，去铲球之类的。\n在Uber Eats上，你可以订购锡箔纸、海绵和蜡烛等家居必需品，而不仅仅是食物。因此，广告向我们展示了当詹妮弗·柯立芝、格温妮丝·帕特洛、特雷弗·诺亚和尼古拉斯·布劳恩等名人对什么是食物或什么不是食物感到困惑时会发生什么。\n我现在知道，在Uber Eats的紧要关头，我可以买到锡箔纸。但这感觉就像是在掩盖一个营销“哎呀”，比如当他们推出Uber Eats时，他们应该选择一个包含他们所说的“吃”和“不吃”的名称\n他们使用了卡彭的歌曲“哦不”，大约一年前，这首歌在TikTok上走红。利用一种不再相关的趋势来吸引年轻观众有点畏缩。\n自从智能家居、语音控制设备发布以来，亚马逊不得不缓解消费者反复出现的恐惧：Alexa在看我吗？她知道的太多了吗？如果她变得太强大怎么办？\n但是，亚马逊决定向数百万观众展示如果Alexa能读懂你的心思会发生什么。当女演员斯嘉丽·约翰逊从《周六夜现场》中醒来时，她坐在丈夫科林·乔斯特旁边，亚历克斯读到了他的心思，并订购了强力漱口液。当约翰逊想让乔斯特停止说话时，亚历克斯启动了他们的大声搅拌器。\n最终，乔斯特和约翰逊决定读心设备最终会很糟糕，但是……我猜广告的目的是娱乐，而不是解释产品的功能？尽管如此，乔斯特还是成功地让他的智能设备打开了电视，这确实展示了Alexa的一些不那么可怕的技能。这是因为她能读懂你的心思，她实际上并没有读懂你的心思……对吧？\n广告有点搞笑！但是，嘲笑亚马逊的广告是一种畏缩。我们要把这件事带到这里来，这是我们的错。\n亚马逊嘲笑说，Prime Video将成为周四晚间足球赛的独家主场，这标志着亚马逊和NFL之间11年协议的第一年。\n从9月15日开始，球迷们可以在Prime Video上观看周四晚上的足球比赛。很清楚！很短！这是一则专门面向球迷的广告，猜猜谁在看超级碗？球迷们！\n“在下赛季之前，我们必须生活在一个没有比赛的世界里，”画外音告诉我们，而有人因为足球后抑郁而留起了巨大、难以驾驭的胡子。贝丝，还有其他运动！", "note_en": "On scales of cringe and effectiveness, here are the Super Bowl’s best (and worst) tech ads.\n    A QR code bounced around the black screen like a DVD screensaver, cycling through bright colors while a generic techno song played.\n I pulled out my phone to scan the QR code, because why not — my friend yelled from across the room, “Don’t do it! It could be a virus! Or worse, crypto!”\n Sure enough, the QR code opened the Coinbase website on my phone, offering $15 in free Bitcoin for new users with no purchase necessary. According to Coinbase Chief Product Officer Surojit Chatterjee, the ad was so popular that Coinbase experienced  more traffic than it’s ever encountered.\n @coinbase just saw more traffic than we&#39;ve ever encountered, but our teams pulled together and only had to throttle traffic for a few minutes. We are now back and ready for you at  https://t.co/ZUJqRlnZPH. Humbled to have been witness to this.  #WAGMI\n  Clearly the ad was effective because their website crashed from all the traffic. But since, you know, the website crashed, they have to lose some points.\n I’m also not sold on the “Instead of talking about crypto, we decided to just… give you some” marketing tactic. Like any investment, knowing what you’re investing in is probably a good thing! Sure, you have to engage in the market to get a grasp on it, but also, it’s baffling that none of these crypto commercials actually explained what it is that they want consumers to invest in.\n  The retro aesthetic is actually kind of cool. The bouncing QR code was a risk, but I remember this ad more vividly than any others, so it worked. But the QR code directs you to a  website with the offer information, and that website is a bit cringe. Coinbase writes “WAGMI” on the site, which is crypto-bro slang for “we are gonna make it,” which means, “we are one of the startups that isn’t going to burn out in a few years and cause many people to lose money.” But maybe saying WAGMI implies a fear that you’re NGMI?\n     Yet another cryptocurrency exchange platform, the Bahamas-based FTX reached a  $32 billion valuation last month after raising another $400 million in funding. Some of that budget has to go to marketing, so why not hire the famous curmudgeon Larry David to film his first Super Bowl commercial?\n The premise of the commercial is that the “Curb Your Enthusiasm” star is so skeptical of everything that he’s missed out on some great investments — he tells Edison that his lightbulb is NGMI (not a direct quote), and that using a dishwasher doesn’t make sense when you can just put the dishes in the shower (gross).\n Larry David doesn’t understand crypto, so that means this emerging industry must be  pretty, pretty, pretty good.\n  According to The New York Times, FTX and ad agency dentsuMB considered  80 scripts before deciding on this concept, which positions decentralized finance as a light bulb-like innovation. Then, after four days of filming with the “Seinfeld” co-creator, the ad took 280 hours to edit, condensing 7.5 hours of footage into 60 seconds — then, they spent another 200 hours to create teasers for their ad.\n All in all, you gotta respect the effort (plus, Larry David is my problematic fave). But damn. That’s a lot of time and money to go into an ad that doesn’t teach you anything about how crypto works.\n      Yet another crypto exchange with an exorbitant marketing budget, Crypto.com took a similar approach to FTX. They wanted star power, and they wanted to convince viewers that cryptocurrency is just a natural next step for technology. But their choice of talent was maybe more familiar for sports fans. In the 30-second spot, LeBron James tells a younger version of himself that “if you want to make history, you gotta call your own shots.” Then, a Crypto.com logo appears on the screen.\n  We like to see sports stars on TV. But this ad told us even less about crypto than Coinbase and FTX did. Then again, this ad probably cost way less than FTX’s ad, rife with costumes and set changes and special effects.\n  I want to know more about the physics involved here. How did LeBron go back in time? Will telling his younger self about crypto rupture our current timeline so that LeBron never made the NBA, meaning that South Florida never had a successful professional sports team in the twenty-first century? So many questions.\n     Not only did Facebook rebrand to Meta, but they also rebranded their VR headset from the Oculus Quest — the name of the VR company they  acquired — to just the Meta Quest.\n The ad is confusing and depressing. Basically, some animatronic musicians — who work together at a Chuck E. Cheese-like place — lose their jobs and can’t hang out anymore. But by using their Meta Quest 2, they can forget about life’s challenges and be legless avatars together in  Horizon Worlds, the company’s social gathering app.\n  If the goal is brand recognition, well okay then. But the ad comes off kind of like, “Are you unsatisfied with the real world? Try the metaverse!” Also, Horizon Worlds is nowhere near as polished as the ad makes it seem, so minus points for ingenuity.\n      To showcase its Pixel 6 phone, Google collaborated with superstar Lizzo to highlight its Real Tone feature.\n “Every single yearbook photo of mine has been terribly shot since I was a kid,” a voice narrates over a picture of friends in graduation garb — those with the darkest complexions blend into the background of the photo.\n Then, Google shows photos taken with its Real Tone feature, which uses  computational photography technology to properly expose photos of people with varying skin tones. The photos are gorgeous, displayed while Lizzo sings an unreleased track.\n  They got a new Lizzo song in their commercial. To quote TechCrunch’s own Annie Saunders, “I did not watch the Super Bowl, but I did see Lizzo’s Pixel ad on Instagram, and everything Lizzo does is Right and Good.”\n  There’s really nothing cringe here, but you could say Google’s market share in the smart phone business compared to Apple is a little cringe for them.\n     Miley Cyrus and her godmother Dolly Parton teamed up to advertise T-Mobile’s 5G network in a series of two 30-second spots. In the first ad, Dolly Parton appears in a PSA, urging people to switch over from AT&amp;T or Verizon for the sake of their phones. Then, she calls Miley, urging her to use her voice to save the phones. In the next ad, we see Miley belting out heartfelt lyrics like “let’s do it for the phones/they do so much for you” in a recording studio. She even belts, quote, “T-Mobile” while wearing a black blazer and leather gloves.\n   I paid attention, because I think Dolly Parton and Miley Cyrus are fun. They might have punched down at other networks’ allegedly worse 5G coverage, but hey, in the spirit of football, go for that tackle or something.\n      On Uber Eats, you can order home essentials like tinfoil, sponges and candles — not just food. So, the ad shows us what happens when celebrities like Jennifer Coolidge, Gwyneth Paltrow, Trevor Noah and Nicholas Braun get confused about what is or is not food.\n  I now know that I can get tinfoil in a pinch on Uber Eats. But this feels like it’s covering up a marketing “oopsie,” like maybe when they launched Uber Eats, they should’ve chosen a name that would encompass what they refer to as both “eats and not eats.”\n  They used the song “ Oh No” by Capone, which went viral on TikTok about a year ago. It’s kind of cringe to appeal to a younger audience by leveraging a trend that is no longer relevant.\n     Since the release of smart home, voice-controlled devices, Amazon has had to mitigate a recurring fear among consumers: is Alexa watching me? Does she know too much? What if she becomes too powerful?\n But, Amazon decided to show an audience of millions of viewers what would happen if Alexa could read your mind. When actress Scarlett Johansson wakes up next to her husband, Colin Jost from “Saturday Night Live”, Alexa reads his mind and places an order for extra-strength mouth wash. When Johansson wants Jost to stop talking, Alexa activates their loud blender.\n  Ultimately, Jost and Johansson decide that mind-reading devices would ultimately be bad, but… I guess the point of the commercial is to entertain, not to explain what the product does? Jost does successfully ask his smart device to turn on the TV, though, which does display some of Alexa’s less-terrifying skills. It’s because it’s  like she can read your mind, she doesn’t  actually read your mind … right?\n  The ad was kind of funny! But laughing at an advertisement made by Amazon is cringe. We are bringing the cringe here, it’s our fault.\n  Amazon teased that Prime Video will become the  exclusive home for Thursday night football, marking the first year of an 11-year deal between Amazon and the NFL.\n  Starting September 15, fans can watch Thursday night football games exclusively on Prime Video. It’s clear! It’s short! It’s an advertisement specifically geared toward the audience of football fans, and guess who watches the Super Bowl? Football fans!\n  “We have to live in this world without games all the way until next season,” the voiceover tells us while someone grows a huge, unruly beard due to his post-football depression. Bestie, other sports exist!", "posttime": "2022-02-15 12:06:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,科技,bowl", "title": "以下是2022年超级碗最佳和最差的科技广告", "title_en": "\n\t\t\t\tHere are the best and worst 2022 Super Bowl tech ads\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/super-bowl-2022-ads-for-tech-companies/", "via": "", "real_tags": ["广告", "科技", "bowl"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073403, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两位女性创始人姚珍妮（Jeanny Yao）和王米兰达（Miranda Wang）已经在这个问题上工作了五年多。\n他们现在已经在一系列a融资中筹集了1100万美元，该融资由远景合伙人牵头，Valo Ventures和Bemis Associates参与；早期的投资者包括SOSV、槲寄生和TIME Ventures。Novoloop还与Bemis Associates合作，后者生产高性能外套中的接缝胶带等服装粘合解决方案。\nNovoloop正着手将塑料废料转化为高性能化学品和材料。该公司表示，它已经开发了一种名为ATOD的专有工艺技术™ （加速热氧化分解）。该公司声称，这将聚乙烯（当今使用最广泛的塑料）分解成化学积木，可以合成高价值产品。\n第一款产品将是Oistre™, 一种热塑性聚氨酯（TPU），用于鞋类、服装、体育用品、汽车和电子产品。Novoloop声称，它的碳足迹比传统TPU小46%。\nNovoloop联合创始人兼首席执行官Miranda Wang在一份声明中说：“塑料不会很快消失，所以我们需要创新，以缩小生产和再利用之间的差距。经过多年的技术发展，我们很高兴宣布有高素质的投资者和合作伙伴支持将这项急需的技术商业化。”\n“真正迫使我们领导这轮投资的是Novoloop找到了适合产品市场的产品，”Envisioning Partners合伙人June Cha说。“Novoloop已经证明，即使在其早期阶段，Oistre在市场上也有广泛的应用。”\n王在电话中对我说：“聚乙烯塑料是最常用的包装材料，但很难通过化学方法改变、分解并变成有用的东西。我们基本上通过采用一种新的化学方法来氧化聚乙烯来解决这个问题。”\n她说：“其他所有人都在将塑料废料聚乙烯转化为化石燃料储备。但对我们来说，我们的方法是直接将聚乙烯废料转化为一个步骤……因此，这基本上绕过了许多步骤和化学过程，否则人们会将其转化为石油或天然气。”。\n诺沃洛普的竞争对手包括巴斯夫、科思卓、路博润和亨斯迈。这些公司生产基于原始化石燃料的TPU。如今，约99%的TPU是处女。换句话说，这是一个准备颠覆的巨大行业。", "note_en": "The two female founder scientists, Jeanny Yao and Miranda Wang, have been working for over five years on this problem.\n They have now raised $11 million in a Series A financing led by Envisioning Partners, with participation from Valo Ventures and Bemis Associates; earlier investors that joined the round included SOSV, Mistletoe and TIME Ventures. Novoloop is also partnering with Bemis Associates, which makes apparel bonding solutions such as seam tapes, which can be found in high-performance outerwear.\n  Novoloop is setting out to transform plastic waste into high-performance chemicals and materials. The company says it has developed a proprietary process technology it calls ATOD™ (Accelerated Thermal Oxidative Decomposition). It claims that this breaks down polyethylene (the most widely used plastic today) into chemical building blocks that can be synthesized into high-value products.\n The first product will be Oistre™, a thermoplastic polyurethane (TPU) for use in footwear, apparel, sporting goods, automotive and electronics. Novoloop claims this has a carbon footprint that is up to 46% smaller than conventional TPUs.\n Novoloop co-founder and CEO Miranda Wang said in a statement: “Plastics are not going away anytime soon, so we need to innovate to close the gap between what is produced and what is repurposed. After years of technology development, we’re thrilled to announce backing by high-caliber investors and partners to commercialize this much-needed technology.”\n “What really compelled us to lead the investment round is that Novoloop has found product-market fit,” said June Cha, partner of Envisioning Partners. “Novoloop has proven that Oistre has a wide range of applications in the market even at their early stage.”\n  Speaking to me over a call, Wang added: “Polyethylene plastic is the most common packaging used but is extremely hard to chemically change and break apart and turn into useful things. We cracked this by essentially adopting a new chemical approach to oxidise this polyethylene.”\n “Everybody else is turning this plastic waste polyethylene into fossil fuel reserves. But for us, our approach is to directly take the polyethylene waste and convert it in one step… So this essentially bypasses many steps and chemistries that would otherwise happen if people were to take it back into oil or into gas,” she said.\n Competitors to Novoloop include BASF, Covestro, Lubrizol and Huntsman. These are companies that make virgin fossil fuel-based TPU. About 99% of TPUs are virgin today. In other words, this is a giant industry ready for disruption.", "posttime": "2022-02-15 12:01:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "循环,worked,聚乙烯", "title": "Novoloop表示，他们已经研究出如何对塑料垃圾进行循环利用，并为A系列筹集了1100万美元", "title_en": "\n\t\t\t\tNovoloop says it’s worked out how to upcycle plastic waste, raises $11M Series A\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/novoloop-says-its-worked-out-how-to-upcycle-plastic-waste-raises-11m-series-a/", "via": "", "real_tags": ["循环", "worked", "聚乙烯"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073402, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着地图的数字化，你可能会依赖MapQuest来帮助绘制到达目的地的最快路线。讽刺的是，Homebrew的Hunter Walker上周在推特上说，有些人还记得打印MapQuest的页面，“那些人不知道我在说什么。”\n无论你属于哪一个阵营，Proxi都希望在2022年地图制作方面给你所有的感觉。这家总部位于西雅图的初创公司正在开发地理空间软件，旨在通过让用户创建个人导航地图，与谷歌地图（Google Maps）和Yelp等公司竞争。\n这一代人真正的战斗是那些在开车去某处之前记得打印地图导航的人；坐满了被丢弃的书页的后座\n该公司的想法源于Proxi联合创始人梅琳达·豪伊（Melinda Haughey）在2020年发布的“不给糖就捣蛋”众包地图。在全球大流行期间，具有情报背景的工程师豪伊想弄清楚人们在哪里设置了糖果射门，这样她的孩子就可以在附近安全地玩“不给糖就捣蛋”了。\n她说：“我在当地的Facebook家长群上注意到，人们只是列出了他们的地址，考虑到我的背景，我想，‘这太愚蠢了，没人能真正使用它。’”。“我考虑了如何处理这些地址，所以我使用了一系列不同的工具将它们拼凑在一起，并发布了一个表格，供人们添加糖果。”\n从她的小社区开始，最终在西雅图地区的2300户家庭中传播开来。它甚至出现在当地新闻和《早安美国》上\n然而，通过这一过程，豪伊意识到地图绘制过程“是一场噩梦”，“普通人无法接触到”，她说。\n在人们开始向她寻求帮助制作地图后，她联系了Chelsey Roney，她是一位大学的朋友，曾多次创业，并有过成功的经历。她向Chelsey Roney寻求帮助，以实现让地图制作变得超级简单的愿景。\nProxi是一款免费的无代码工具，用于制作可嵌入社交媒体账户、网站和应用程序的自定义交互式地图。该公司的一些早期用户——包括西雅图新闻台King 5、在西雅图黑人旅行的制作公司、活动协调员、影响者和美食博客——正在用最喜欢的聚会、餐馆和景点的地图取代listicles。\n豪伊说，与其他地图服务不同，用户可以在地图上建立自己的品牌，并创建自定义图标。\n她补充说：“我们通过实验了解到，当人们能从视觉上看到他们的关系时，他们更有可能皈依并真正去那些地方。”。“管理员很快就能收到一个深入的分析仪表板，在这里他们可以了解谁在访问地图、他们在地图上花费了多长时间、点击了哪些点，以及谁在点击方向和自定义URL。”\n为了让这些新功能发挥作用，豪伊和罗尼在格雷厄姆&amp；沃克（该公司告诉我，这是他们第一次领先一轮），参加的有Techstars、Madrona先锋基金、Pack VC、Tacoma风险基金、FAM Fund、KIG和一群天使投资者。\nProxi于2021年年中推出，从那时起，它开始获得前面提到的强劲动力。在加入Techstars后，豪伊和罗尼决定寻求额外的资金，以快速扩大规模并开展营销活动。\n他们计划以四种方式使用它：雇佣关键员工，在西雅图和奥斯汀增加密度，让更多人制作地图，探索消费者应用程序的概念。\n到目前为止，全世界已经绘制了大约500张地图。有趣的用例一直在创建婚礼路线和镇上最好的游乐场地图。在西雅图和奥斯汀的重点地区，豪伊和罗尼希望扩大250张地图的范围，人们可以在地图上定期与当地人或游客分享推荐信息。\n豪伊说：“我们要想脱颖而出，真正打造人们所关心的东西，一个方法就是与创作者保持密切联系。”。“我们将以深思熟虑和合乎道德的方式构建这些功能，并确保为人们创造良好的用户体验。”", "note_en": "As maps went digital, you might have relied on MapQuest to help plot the fastest route to your destination. Ironically, Homebrew’s Hunter Walker  tweeted last week that there are some people who remember printing off pages from MapQuest and “those who have no idea what I’m talking about.”\n Whichever one of those camps you fall into,  Proxi wants to give you all the feels when it comes to map-making for 2022. The Seattle-based startup is developing geospatial software aimed at taking on the likes of Google Maps and Yelp by enabling users to create personal navigation maps.\n  the true battle of the generations is people who remember printing off Mapquest directions before driving somewhere &amp; a backseat full of discarded pages\n   The idea for the company stemmed from Proxi co-founder Melinda Haughey’s crowdsourced map for trick-or-treating that went viral in 2020. Amid the global pandemic, Haughey, an engineer with a background in intelligence, wanted to figure out where people had set up candy shoots so trick-or-treating could be done by her child safely in the neighborhood.\n  “I noticed on my local Facebook group for parents that people were just listing their addresses, and given my background, I thought, ‘this is so dumb, nobody’s gonna actually be able to use this,’” she said. “I thought about what I could do with these addresses, so I used a bunch of different tools to cobble them together and published a form for people to add their candy shoots.”\n What started out in her small neighborhood ended up going viral with 2,300 homes in the Seattle area. It was even featured on the local news and “Good Morning America.”\n However, by going through that process, Haughey realized that the map-building process “was a nightmare” and “not accessible to everyday people,” she said.\n After people started asking her for help to make maps, she reached out to Chelsey Roney, a friend from college who was a multi-time entrepreneur with prior exits, to work toward a vision of making map-making super easy.\n Proxi is a free, no-code tool for making custom, interactive maps that can be embedded into social media accounts, websites and apps. Some of the company’s early users — including Seattle news station King 5, production company  Traveling While Black in Seattle, event coordinators, influencers and foodie bloggers — are replacing listicles with maps of favorite hangouts, restaurants and places to see and be seen.\n And, unlike other map services, users can put their own branding on the maps and create custom icons, Haughey said.\n  “We’ve learned through experimentation that people are more likely to convert and actually go to those places when they can visually see where they are in relation,” she added. “Admins will shortly be able to receive an in-depth analytics dashboard where they can understand who’s visiting a map, how long they’re spending there, what points were clicked on and who’s clicking the directions and the custom URL.”\n To get those new features going, Haughey and Roney raised $1.2 million in an oversubscribed pre-seed round, led by Graham &amp; Walker (the firm told me this was their first time leading a round), with participation from Techstars, Madrona Pioneer Fund, Pack VC, Tacoma Venture Fund, FAM Fund, KIG and a group of angel investors.\n Proxi launched in mid-2021, which is when it started picking up that hard traction mentioned earlier. After enrolling in Techstars, Haughey and Roney decided to seek additional capital to scale quickly and run marketing campaigns.\n They plan to use it in four ways: make key hires, grow in density in both Seattle and in Austin, get more people making maps and explore the concept of a consumer app.\n So far, around 500 maps have been created across the world. Interesting use cases have been creating wedding routes and maps of the best playgrounds in town. In the focus areas of Seattle and Austin, Haughey and Roney want to expand the 250 maps where people are actively sharing recommendations regularly with their local area or with travelers.\n “One way that we’re going to be able to stand out and really build something that people care about is by staying really close with creators,” Haughey said. “We’re going to build the features really thoughtfully and ethically and make sure that we are creating a great user experience for people.”", "posttime": "2022-02-15 11:58:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "making,地图", "title": "Proxi正在让数字地图更酷", "title_en": "\n\t\t\t\tProxi is making digital maps cooler\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/proxi-is-making-digital-maps-cooler/", "via": "", "real_tags": ["making", "地图"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073401, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "想知道如何在这种情况下招募人才吗？我们有一个会议。努力寻找适合产品市场的产品？我们掩护你。想知道a系列电影的理想制作流程吗？我们比你领先一步。\nTechCrunch早期阶段是大流行开始以来我们的第一次面对面活动，我们非常高兴能回到观众和演讲者的同一个房间（当然，我们已经采取了充分的预防措施）。\n这种形式在大多数TC活动中都是独一无二的，因为我们的演讲者围绕他们的主题进行演讲（所有与会者都将从这些会议中获得成绩单和视频资源），然后将大部分时间用于观众提问；答：我们还将举行圆桌会议，重点讨论筹资、运营等问题，创始人可以在圆桌会议上相互交流，以解决早期初创企业目前面临的一些最大挑战。\n这将是一个令人难以置信的活动，我们非常激动地与大家分享议程：\n一旦第一张多米诺骨牌倒下，其余的骨牌就不可避免地跟着倒下。但说到早期筹款，这并不像轻敲手指那么简单。红杉的Jess Lee将向您介绍如何让第一位投资者加入，这通常会让其他投资者对与您合作的前景感到兴奋。\n从科学家演变为创始人（由梅菲尔德赞助）、Janice Chen（猛犸生物科学）、Ursheet Parikh（梅菲尔德）和Diego Rey（终点健康）\n你是如何从博士学位到创业公司创始人和其他职位的？在本次会议上，猛犸生物科学联合创始人；CTO Janice Chen和Endpoint Health联合创始人；CSO Diego Rey加入Mayfield的Ursheet Parikh，分享他们从自己的科学家到创始人的成长历程中获得的经验。学习如何从工作台走到床边，利用科学突破拯救生命，创业公司如何与行业巨头建立富有成效的合作伙伴关系，等等。\n通过顾客对你的产品的喜爱来验证你的想法，可能是作为早期创始人在情感和智力上最费力的部分之一。GV的特里·伯恩斯（Terri Burns）曾是Twitter和Venmo的运营商，后来成为了风投。她将阐述寻找产品市场适合度的基本原理，包括流程、反馈循环和适应性。\n如果使用得当，压力可能是一种无价的武器。阿斯特斯克创始人埃利奥特·托马诺一生都在向媒体讲述创业公司的故事。他将详细介绍记者对新闻的看法，如何吸引他们的注意力，以及如何长期拥有这段关系。\n筹款的环境充满了泡沫。创业公司在很长一段时间以来第一次在a轮加薪中拥有足够的筹码。听取Stellation Capital创始人彼得·博伊斯二世（Peter Boyce II，曾是General Catalyst的合伙人）关于如何在A系列融资期间获得最佳条件、最佳投资者以及最终最佳长期成功的演讲。\n在公司建设的早期阶段打造品牌至关重要，但往往被忽视和误解。品牌不仅仅是一个标志和一个网站；这个故事反映了你的价值观和愿景，引导着每一个接触点和交流，激发了联系和情感。品牌是参与式的，所以你可以在发布时创造自己的品牌故事，但其他人会随着你的成长而定义它。学习开发一个引人注目的品牌故事的基本要素，该故事在支持公司发展的同时赢得人心。\n一个诱人的广告是创业公司成功筹资的基础。再配上一个结构良好的球场平台，你就可以开始比赛了。在这个互动环节中，Emergency Capital的Lotti Siniscalco将通过观众提交的真实创业宣传资料，分享什么唱，什么不唱，为什么唱。\n当涉及到云业务的构建和扩展时，各个阶段的领导者都想知道“典型”和“同类最佳”是什么样子——尽管它们是世界上最有用的金融数据点，但私人市场金融基准仍然是最难以捉摸的。为了弥合这一差距，请加入Bessemer合作伙伴Mary D'Onofrio，她将分享权威的基准统计数据和定性见解，帮助那些希望达到新高度的公司，重点关注ARR从100万美元到1000万美元的增长\n投资者喜欢基于务实策略的不切实际的目标。Felicis Ventures的Aydin Senkut和Viviana Faga将解释如何考虑早期客户，如何扩大人才库，以及如何平衡可能的计划和不可能的梦想。\nY Combinator是最负盛名的加速器，从YC起步的成功校友比我们想象的要多。就创业板而言，这是相对无与伦比的。听取YC合作伙伴和招生负责人道尔顿·考德威尔关于如何增加你被YC录取的机会，以及如何优化你在YC的时间，让你的公司获得成功。\n赚钱需要钱，但在增长营销上的明智支出不仅可以改变你的底线，还可以改变你的长期生存能力。听听迪菲的话。vc的Brian Rothenberg是TaskRabbit和EventBrite的市场营销和增长负责人，他研究如何最大限度地利用营销资金。\n在创业创纪录的一年里，伴随着巨大的辞职，几乎每一家创业公司都面临人才短缺。听取格雷洛克的格伦·埃文斯（Glen Evans，前Slack、Facebook和谷歌）关于如何优化招聘流程、如何发现和开发人才以及接近候选人的最佳实践的意见。\n在本次会议上，Nutanix联合创始人兼前首席执行官、DevRev联合创始人兼首席执行官Dheeraj Pandey与Mayfield MD Navin Chaddha一起分享了他将Nutanix打造成一家收入超过10亿美元的上市公司，以及在疫情期间推出DevRev的经验教训。了解如何从第一天开始构建分布式团队，这是点燃社区和利用产品引领增长的剧本，等等。\n为梅菲尔德（RejaveBATRA）（梅菲尔德）和Manny Medina（外展）建立“最后一家公司”的基础\n当涉及到公司大楼时，有些东西是无法改造的——它们必须从一开始就安装到位。与外展联合创始人兼首席执行官曼尼·梅迪纳（Manny Medina）和梅菲尔德（Mayfield）的拉吉耶夫·巴特拉（Rajeev Batra）一起参加本次会议，他们分享了从外展开始到标志性旅程的见解，包括在构建移情表演文化、将DEI嵌入你的DNA、优秀品类设计的剧本等方面的经验教训。\n随着越来越多的SaaS初创公司转向基于使用情况的定价，旧的策略手册变得越来越没有用处。OpenView的凯尔·波亚（Kyle Poyar）可以讲述如何在没有与之前的SaaS公司相同的基准、里程碑和战略的情况下发展业务。\nTC早期阶段将于4月14日举行，我们很高兴能将所有这些精彩内容现场呈现给您！在我们售罄和价格上涨之前，现在就拿好你的票！", "note_en": "Wondering how to recruit talent in this landscape? We’ve got a session for it. Struggling to find product market fit? We’ve got you covered. Curious about the ideal process for raising a Series A? We’re one step ahead of you.\n TechCrunch Early Stage marks our first in-person event since the pandemic started, and we’re absolutely thrilled to be back in the same room as our audience and speakers (with full precautions taken, of course).\n  The format is unique to most TC Events, in that our speakers are giving presentations around their topics (all attendees will get transcripts and visual assets from those sessions) and then dedicating the majority of their time to audience Q&amp;A. We’ll also have roundtables focused on fundraising, operations and more where founders can chat amongst themselves to resolve some of the biggest challenges facing early-stage startups today.\n It’s going to be an incredible event, and we’re more than excited to share the agenda with you:\n   Once the first domino falls, the rest inevitably follow. But when it comes to early fundraising, it’s not as simple as a tap of the finger. Sequoia’s Jess Lee will talk you through how to get that first investor on board, which will more often than not get other investors excited about the prospect of working with you.\n Evolving from Scientist to Founder (Sponsored by Mayfield) Janice Chen (Mammoth Biosciences), Ursheet Parikh (Mayfield) and Diego Rey (Endpoint Health)\n How do you go from PhD to startup founder and beyond? In this session, Mammoth Biosciences co-founder &amp; CTO Janice Chen and Endpoint Health co-founder &amp; CSO Diego Rey join Mayfield’s Ursheet Parikh to share learnings from their own scientist-to-founder growth journeys. Learn how to go from bench to bedside and leverage scientific breakthroughs to save lives, how startups can ink productive partnerships with industry behemoths, and more.\n  Validating your idea, through customer love for your product, may be one of the most emotionally and intellectually taxing parts of being an early-stage founder. GV’s Terri Burns, former operator (Twitter and Venmo) turned VC, will lay out the fundamentals of finding product market fit, including processes, feedback loops, and adaptability.\n  When wielded properly, press can be an invaluable weapon. ASTRSK founder Elliot Tomaeno has spent his life telling startups’ stories to the press. He’ll break down how journos think about news, how to get their attention and how to own the relationship in the long term.\n  The fundraising landscape is frothy. Startups, for the first time in a long time, have plenty of leverage going into their Series A raise. Hear from Peter Boyce II, founder of Stellation Capital (former partner at General Catalyst) on how to get the best terms, with the best investors for your startup, and ultimately the best long-term success, during your Series A fundraise.\n  Building your brand at the early stages of company building is critical, but often overlooked and misunderstood. A brand is more than a logo and a website; it’s the story that reflects your values and vision, guides every touchpoint and communication, and sparks connection and emotion. Brands are participatory, so you create your own brand story at launch, but others define it as you grow. Learn the building blocks of developing a compelling brand story that wins hearts and minds while supporting your company’s growth.\n  An enticing pitch is foundational to a startup’s chance of successful fundraising. Pair that with a well-constructed pitch deck and you’re off to the races. In this interactive session, Emergence Capital’s Lotti Siniscalco will look through real startup pitch decks submitted by the audience to share what sings, what doesn’t and why.\n  When it comes to building and scaling a cloud business, leaders at all stages wonder what “typical” and “best-in-class” look like — and, while they’re some of the most helpful financial data points in the world, private market financial benchmarks remain some of the most elusive. To bridge this gap, join Bessemer partner Mary D’Onofrio as she shares definitive benchmarking statistics and qualitative insights for companies looking to scale to new heights, focusing on growth from $1 to $10 million of ARR\n  Investors love unrealistic goals based on pragmatic strategies. Felicis Ventures’ Aydin Senkut and Viviana Faga will explain how to think about your early customers, the path to expanding that pool and how to balance the possible plan with the impossible dream.\n  Y Combinator is the most prestigious accelerator out there, with more successful alumni who started out at YC than we care to count. As far as startup launchpads go, it’s relatively unmatched. Hear from YC partner and head of Admissions Dalton Caldwell on how to increase your chances of getting accepted to YC and how to optimize your time there to set your company up for success.\n   It takes money to make money, but smart spending on growth marketing can make a world of difference not only to your bottom line, but to your long-term viability. Hear from defy.vc’s Brian Rothenberg, who led marketing and growth for TaskRabbit and EventBrite, on how to make the most of your marketing dollars.\n  Coming off of a record year for startups combined with the Great Resignation, nearly every startup is facing a shortage of talent. Hear from Greylock’s Glen Evans (former Slack, Facebook and Google) on how to optimize the recruiting and hiring process, how to find and develop talent and the best practices for closing candidates.\n  In this session, Dheeraj Pandey, co-founder and former CEO of Nutanix and co-founder and CEO of DevRev, joins Mayfield MD Navin Chaddha to share his learnings from building Nutanix into a public company with over a billion dollars in revenue, as well as launching DevRev during the pandemic. Learn how to build distributed teams from day one, the playbook for igniting community and leveraging product-led growth, and more.\n Setting the Foundation for Built-to-Last Companies (Sponsored by Mayfield) Rajeev Batra (Mayfield) and Manny Medina (Outreach)\n When it comes to company building, some things can’t be retrofitted — they have to be set in place from day one. Join this session with Outreach co-founder and CEO Manny Medina and Mayfield’s Rajeev Batra as they share insights from Outreach’s inception to iconic journey, including lessons learned on building an empathetic performance culture, embedding DEI into your DNA, the playbook for great category design and more.\n  As more SaaS startups move toward usage-based pricing, the old playbook becomes less and less useful. OpenView’s Kyle Poyar can talk through how to grow your business without all the same benchmarks, milestones and strategies as the SaaS companies who’ve come before.\n TC Early Stage is happening on April 14 and we’re excited to bring all of this great content to you live and in-person!  Grab your tickets now before we sell out and prices increase!", "posttime": "2022-02-15 11:54:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "旧金山,techcrunch,learn", "title": "以下是四月在旧金山TechCrunch早期学习的内容。", "title_en": "\n\t\t\t\tHere’s what you’ll learn at TechCrunch Early Stage in San Francisco this April\t\t\t", "transed": 1, "url": "https://techcrunch.com/2022/02/14/heres-what-youll-learn-at-techcrunch-early-stage-in-san-francisco-this-april/", "via": "", "real_tags": ["旧金山", "learn"]}]