[{"category": "", "categoryclass": "", "imagename": "7cf484ceeae6bc7fc2161eddc603cd15.jpg", "infoid": 1012244, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有时，编写Haskell就像与编译器发生争执。你给它推理，它就会检查它是否有瑕疵。如果它认为它找到了一个，它会告诉你所有关于它的事情。然后，你必须仔细检查它告诉你的内容，并找出它的确切抱怨是什么。我刚才表达得不好吗？还是我真的错了？或者，在非常偶然的情况下，编译器只是脾气暴躁，您必须解决这个问题。当然，如果你真的对GHC没有接受你的合理论证的计划感到不安，你可以去告诉它的父母。\nHaskell的类型系统非常棒，但它没有的一件事是递归类型，这是其他一些类型系统所没有的，我指的是直接从它们自身构造的类型。递归类型在Haskell中是被禁止的。\n比方说，我们想要创建一个递归类型T=可能T。官方介绍性的Haskell对此的回答是，不能直接这样做，但是可以很容易地创建一个包含可能T的类型T，有时称为“Newtype wrapper”。就像这样：\n很简单。但我们能做得比这更好吗？我们能创建一个实际上等于T的类型吗？我们可以创建禁止的递归类型吗？\ntype关键字为类型创建别名，别名不能是递归的，因为它们最终必须引用实际类型。\n类型族是奇怪的东西。它们不完全是“真正的”类型，但也不只是类型的别名，因为它们不需要完全解析。实际上，您可以在一个模块中声明类型族，将其作为真实类型使用，然后在另一个模块中定义该族的实际实例。\n不过，遗憾的是，GHC不允许我们实际使用该实例。它拒绝了T和T可能是同一类型的明显证据：\n类型族T，其中T=可能T证明：：T：~：可能T证明=反射\nExample.hs：10：9：错误：·Reduce堆栈溢出；简化以下类型时大小=201：t。\n这是为什么？这是因为GHC不能只接受别人告诉它的东西，而是没完没了地试图“减少”(即扩大)T=也许T=也许T(可能T)等等，当它达到安全极限时就放弃。您可以将其视为一种智力黑洞，或者编译器的“信息危机”：如果它开始检查您的递归类型的奇怪秘密，它将迷失在无限深渊中，直到内置的应急机制在漩涡中扭曲200次后将其唤醒(如果您愿意，您可以更改这个数字，甚至让它永远运行)。\n结果是，我们可以构造一个类型T和一个适当的(非底层)证明值T：~：可能是T，我们只需要谨慎。关键是确保GHC永远不会遇到深不可测的约束T~也许T，因为它会立即陷入对其无穷无尽的思考中。\n相反，我们准备了一个既无害又更通用的引理，然后使用TypeApplications扩展仔细地将其专门化以得到我们想要的可怕结论，从而避免了任何类型的推理：\n型族A p q其中A()x=可能(Ax())引理：：for all x.。(A()x)：~：可能(A x())引理=Refltype T=A()()证明：：T：~：可能T证明=引理@()。\n实际上，构建和解构T的值也需要类似的谨慎。诀窍是，我们不让GHC推断类型。我们不能让GHC去思考，因为一想到坏事就会让它发疯。相反，我们手工应用所有类型。以下是完整的程序，包括所有必要的扩展：\n{-#language RankNTypes，TypeApplications，TypeOperators，TypeFamilies，UnecidableInstances，AllowAmbiguousTypes#-}模块main where import Data.Type.Equalitytype family A p q其中A()x=可能(A x())引理：：for all x。(A()x)：~：可能(A x())引理=Refltype T=A()()证明：：T：~：可能T证明=引理@()Convert1：：for all a B.a：~：b-&gt；a-&gt；bConvert1 refl=idConvert2：：for all a B.a：~：B-&gt；b-&gt；aconvert2 refl=idtConvert1：：t-。TtConvert2=Convert2@T@(可能T)Proof Nothing：：TNothing=tConvert2$Nothing@Tust：：t-&gt；tJust x=tConvert2$Just@T xcount：：t-&gt；Intcount t=case tConvert1 t of Nothing-&gt；0 Just t&#39；-&gt；Succ$count t&#39；T3：TT3=Just$Just Nothingmain：：IO。\n这个程序定义了一个真正的递归类型T=可能T，构造它的一个值，然后解构该值。(它确实可以正确打印“3”。)。另一方面，这比仅仅使用我们应该使用的…的新型要复杂得多", "note_en": "Sometimes, writing Haskell is like having an argument with the compiler. You give it your reasoning, and it checks it over for flaws. And if it thinks it finds one, it will tell you all about it. You then have to look over what it told you, and figure out exactly what its complaint is.  Did I just express myself badly? Or am I actually wrong? Or, very occasionally, the compiler is just being petulant and you have to work around it. Of course, if you’re  really upset about GHC not accepting your perfectly reasonably argued program, you can  go tell its parents.\n Haskell’s type system is pretty great, but one thing it doesn’t have, that some other type systems do have, is  recursive types, by which I mean, types directly constructed from themselves. Recursive types are forbidden in Haskell.\n Let’s say we want to create a recursive type  T = Maybe T. The official introductory Haskell answer to this is that one cannot do this directly, but one can easily create a type  T that  contains  Maybe T, sometimes called a “newtype wrapper”. Like this:\n  Simple enough. But can we do better than this? Can we create a type  T that is actually equal to  Maybe T?  Can we create the forbidden recursive type?\n    The  type keyword creates an  alias for a type, and aliases cannot be recursive as they must eventually refer to an actual type.\n   Type families are strange things. They’re not quite “real” types, but neither are they mere aliases for types, as they don’t have to be fully resolved. Indeed you can declare a type family in one module, use it all over as if it were a real type, and then define the actual instances of that family in another module.\n Sadly, though, GHC won’t let us actually use the instance. It rejects the obvious proof that  T and  Maybe T are the same type:\n type family T where T = Maybe Tproof :: T :~: Maybe Tproof = Refl\n Example.hs:10:9: error: • Reduction stack overflow; size = 201 When simplifying the following type: T\n Why is this? It’s because GHC can’t just accept what it’s been told, and instead endlessly tries to “reduce” (that is, expand)  T = Maybe T = Maybe (Maybe T) etc, giving up when it reaches a safety limit. You can think of it as a kind of intellectual black hole, or an “infohazard” for the compiler: if it ever starts examining the strange secrets of your recursive type, it will get lost in the infinite abyss, until a built-in emergency mechanism kicks it awake after it’s twisted in the vortex 200 times (you can change this number if you want, or even let it run forever).\n It turns out we  can construct a type  T together with a proper (non-bottom) proof value of  T :~: Maybe T, we just have to be discreet. The key is to make sure GHC never comes across the unfathomable constraint  T ~ Maybe T, because it will immediately become ensnared in the contemplation of its endlessness.\n Instead, we prepare a lemma that is both harmless and more general, and then carefully specialise it to get the terrifying conclusion we want, using the  TypeApplications extension, thus avoiding the need for any kind of inference:\n type family A p q where A () x = Maybe (A x ())lemma :: forall x. (A () x) :~: Maybe (A x ())lemma = Refltype T = A () ()proof :: T :~: Maybe Tproof = lemma @()\n Actually constructing and deconstructing values of  T will require a similar circumspection. The trick is, we don’t let GHC infer types. We musn’t let GHC  think, because thinking about the bad thing leads it to madness. Instead, we apply all types by hand. Here’s the full program, including all the necessary extensions:\n {-# LANGUAGE RankNTypes, TypeApplications, TypeOperators, TypeFamilies, UndecidableInstances, AllowAmbiguousTypes #-}module Main whereimport Data.Type.Equalitytype family A p q where A () x = Maybe (A x ())lemma :: forall x. (A () x) :~: Maybe (A x ())lemma = Refltype T = A () ()proof :: T :~: Maybe Tproof = lemma @()convert1 :: forall a b. a :~: b -&gt; a -&gt; bconvert1 Refl = idconvert2 :: forall a b. a :~: b -&gt; b -&gt; aconvert2 Refl = idtconvert1 :: T -&gt; Maybe Ttconvert1 = convert1 @T @(Maybe T) prooftconvert2 :: Maybe T -&gt; Ttconvert2 = convert2 @T @(Maybe T) proofnothing :: Tnothing = tconvert2 $ Nothing @Tjust :: T -&gt; Tjust x = tconvert2 $ Just @T xcount :: T -&gt; Intcount t = case tconvert1 t of Nothing -&gt; 0 Just t&#39; -&gt; succ $ count t&#39;t3 :: Tt3 = just $ just $ just nothingmain :: IO ()main = putStrLn $ show $ count t3\n This program defines a truly recursive type  T = Maybe T, constructs a value of it, and then deconstructs that value. (It does indeed correctly print “3”.) On the other hand, it’s  much more complicated than just using a newtype like we’re supposed to…", "posttime": "2020-07-16 18:08:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "haskell,类型", "title": "禁用的Haskell类型", "title_en": "Forbidden Haskell Types", "transed": 1, "url": "https://semantic.org/post/forbidden-haskell-types/", "via": "", "real_tags": ["haskell", "类型"]}, {"category": "", "categoryclass": "", "imagename": "7a7ec247915b7d1818b85c60b14b7a0b.jpg", "infoid": 1012243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司在由三家公司共同牵头的一轮融资中获得了2050万GB(2570万美元)：Target Global，RTP Global(前身为Ru-Net的俄罗斯公司)和Autotech Ventures。新投资者Channel 4 Ventures和Rider Global，以及之前的支持者Cherry Ventures，BP Ventures，Partech，Version One和Forward Partners都参与了进来。Drover没有披露其估值。到目前为止，它已经筹集了2750万GB的资金。\n首席执行官兼创始人菲利克斯·勒施纳(Felix Leuschner)在接受采访时表示，该计划是用这笔钱继续投资于该公司用来调整价格和为个人提供个性化报价的技术，并招聘更多人才，为更多扩张做好准备。Drover成立于英国，今年早些时候在法国开业。从理论上讲，汽车在哪里销售和使用都是游戏，Drover到目前为止的增长似乎表明，它是驶向新领域的有力候选者。\n这是因为尽管在过去的几个月里，由于新冠肺炎的原因，经济大幅下滑，但可能是因为其灵活的模式(适合于在你不知道即将发生什么的时候)，路虎看到了业务的增长。Leuschner表示：“自三年前推出以来，5月和6月是我们有记录以来表现最好的两个月。”他补充称，该公司的业务继续大幅加速，收入同比翻了一番。“当你是一家成长型初创公司时，每个月都应该是最好的月份，但我们看到的加速甚至超过了这一点。”\n目前，汽车拥有量正在经历一个有趣的阶段。就在不久前，许多人还认为，世界上的优步(Uber)与其他交通创新相结合，如自动驾驶、改进的公共和公共交通模式、按需租赁以及电动自行车和滑板车等新车，都将使个人更容易完全放弃传统的私家车-其想法是，合在一起，它们将提供足够经济、方便和环保的组合，使购买和维护汽车变得过时。\n从长远来看，这个想法可能仍然有一定的意义(请原谅我的双关语！)，但当前的事件让它陷入了困境：新冠肺炎疫情意味着人们更多地呆在家里，当他们真的外出时，许多人都会主动避免分享空间或触摸他人触摸过的表面的交通方式。\n“我们认为这将导致汽车的复兴，”Leuschner说-这一事实得到了其投资者的呼应。\nRTP Global合伙人安东·因舒廷在一份声明中表示：“Drover为拥有汽车提供了一种有吸引力且负担得起的选择，事实证明，在最近的新冠肺炎危机期间，Drover非常强劲，订户预订量创下历史新高。”我们完全赞同Felix关于Drover成为汽车即服务市场未来欧洲领先者的愿景，并在A系列和B系列融资方面为该公司提供支持。“。\n但是，即使没有全球卫生大流行，也有许多信号表明，无论如何，“破坏”可能不是一个快速和无缝的过渡。我们离真正的自动驾驶汽车还有很长的路要走(你知道，那些预计会如此昂贵和难以维护的汽车，大多数人不会拥有它们，而是会订阅服务，供人驾驶)。世界上的优步实际上还没有理清他们的单位经济状况。滑板车可能会很危险。等。\n不管是好是坏，所有这些都让我们回到了私家车，以及尝试以不同的方式向个人提供私家车的机会，为Drover这样的公司打开了大门，让那些可能已经开始完全放弃拥有汽车的想法，但还没有完全放弃使用私家车的人。\nLeuschner说，目标人群是二三十岁的人，他们有一定的可支配收入买车，如果事实证明比租赁Drover一个月的最低使用量便宜(Drover似乎是Drover的主要竞争对手)，他们更有可能热衷于支付增加拥有量的溢价，而不是放弃总拥有成本。\n其他公司以前也曾试图解决订阅汽车市场的问题，也把重点放在了那些希望汽车使用期超过一小时、一天甚至一周，但又不想付钱直接拥有汽车或陷入长期租赁的客户身上。\n其中之一-美国的Fair-看起来特别有希望，大牌创始人从软银(Softbank)等公司筹集了数亿美元的股权和债务。但它最终面临着一场壮观的内爆，无法正确的商业模式。\nLeuschner争辩说，虽然Drover听起来可能和Fair是同一款车，但它实际上是一款非常不同的车。首先，该公司约三分之二的库存来自经销商、原始设备制造商和其他分销汽车的公司。\n他们将Drover作为另一个渠道，部分是为了使分销多样化，部分是作为一种利用无法通过其他渠道销售的库存的方式。剩下的三分之一被Drover收购，这意味着作为车辆的所有者，这家初创公司在这些车辆上获得了更高的利润率，但也意味着初创公司的风险更高-这也是Drover的技术发挥作用的领域之一。\n“这对我们来说是一场优化比赛，”勒施内尔说。“当你有开放的库存时，你会获得更好的利润率，但也会有更大的风险。”我们正处于这样的境地，我们知道什么是最适合我们客户基础的工具，我们有大量的数据和交易历史。在这些情况下，我们愿意承担一定的风险和更高的利润率结构。“。\n另一个关键的不同之处在于，Drover也只专注于私人，而不是致力于职业司机的订阅。这意味着这些用户的业务减少，一些汽车租赁公司认为这是拼车平台需求下降的连锁反应，并没有对Drover产生影响。\n尽管如此，这仍然是一个巨大的市场，有很多增长机会。他说，在线汽车销售仍然只占英国总销售额的1%，远远低于20%的零售商品销售率(一个原因可能是显而易见的：门票越大，人们就越有可能想要亲眼看到商品)。所有这一切都在逐渐转变-尤其是因为越来越多的知名公司加入进来，并在这个过程中提供了更多的合法性和保障，这也为Drover这样的公司打开了大门。\n塔吉特全球(Target Global)合伙人本·卡明斯基(Ben Kaminski)在一份声明中表示：“通过同步利用正在进行的数字化和按需趋势，费利克斯和他的团队已做好充分准备，将积极从传统汽车零售商手中夺取市场份额。”“这笔新的注资是对Drover背后的团队和技术的证明，Drover正在向更好的方向扰乱汽车拥有模式。随着Drover计划在整个欧洲继续扩大规模，我们很高兴能提供我们的支持。“。\nAutotech Ventures的总经理Daniel Hoffer在他自己的声明中补充道：“在仔细研究了欧洲格局之后，我们相信Drover对轻资产方法实现的下一代客户体验的独特关注有可能彻底改变欧洲人与汽车拥有的关系。在强劲执行力的支撑下，由于新冠肺炎和经济衰退推动的地面交通领域消费者偏好的变化，路虎公司有望变得更加强大。", "note_en": "The company has picked up £20.5 million ($25.7 million) in a round of funding co-led by three firms:  Target Global, RTP Global (the Russian company formerly known as ru-Net) and Autotech Ventures. New investors Channel 4 Ventures and Rider Global, as well as previous backers Cherry Ventures, BP Ventures, Partech, Version One and Forward Partners all also participated.  Drover   is not disclosing its valuation. It’s raised £27.5 million to date.\n The plan, CEO and founder Felix Leuschner said in an interview, is to use the money to continue investing in the technology it uses to calibrate prices and personalise offers for individuals, as well as to hire more talent and gear up for more expansion. Founded in the UK, Drover opened France earlier this year. In theory, wherever cars are sold and used is game, and Drover’s growth to date seems to point to it being a strong candidate for driving ahead to new frontiers.\n  That’s because despite the huge drop in the economy in the last several months because of COVID-19, perhaps because of its flexible model (fitting for when you don’t know what is coming around the corner) Drover has seen business go up. “May and June have been our best two months on record for us since launching three years ago,” said Leuschner, who added that it is continuing to see an acceleration in the business, doubling in revenues year on year. “Every month should be the best month when you’re a growing startup, but we’ve seen acceleration even beyond that.”\n Car ownership is going through an interesting phase at the moment. It was not that long ago when many people believed that the Ubers of the world, combined with other innovations in transportation like autonomous driving, improved public and communal transport models, on-demand rentals and new vehicles like electric bikes and scooters, would all combine to make it easier for individuals to forego traditional private car ownership altogether — the idea being that collectively, they would provide an economical, convenient and eco-friendly enough mix to make buying and maintaining a car obsolete.\n That idea might still have some mileage longer term (excuse the pun!), but current events have thrown it for a loop: the COVID-19 pandemic has meant that people are staying at home a lot more, and when they do go out, many are proactively eschewing transportation forms that involve sharing space or touching surfaces that others have touched.\n “We think this will lead to a renaissance for cars,” Leuschner said — a fact echoed by its investors.\n “Drover offers an attractive and affordable alternative to car ownership, which has proven to be extremely robust during the recent COVID-19 crisis with record high subscriber bookings,” said Anton Inshutin, partner at RTP Global, in a statement. “We fully share in Felix’s vision for Drover as the future European leader in the car-as-a-service market, and offered our support to the company in both Series A and Series B financings.”\n But even without a global health pandemic, there were a number of signals that pointed to the fact that “disruption” might not have been a quick and seamless transition anyway. We’re a long way off from actual autonomous cars (you know, the ones that are predicted to be so expensive and tricky to maintain that most will not own them but will subscribe to services to be driven around). The Ubers of the world haven’t actually sorted out their unit economics. Scooters can be dangerous. Etc.\n For better or worse, all of that brings us back to private cars, and the opportunity to play around with different ways of providing these to individuals, opening the door to companies like Drover to tap those who may have started to part with the idea of owning a car outright, but have yet to let go of the idea of using a private car altogether.\n Target demographics, Leuschner said, are people in their 20s and 30s who have some disposable income for a car and are more likely to be keen to pay the premium on incremental ownership to forego total cost of ownership, if it proves to be cheaper than leasing for the one-month minimum of usage on Drover (which appears to be Drover’s main competitor).\n  Others have attempted to tackle the subscription car market before, also focusing on customers that want to have the use of cars for more than just an hour or a day or even a week but don’t want to pay out to own them outright or get locked into long leases.\n One of those —  Fair in the US — looked to be especially promising with big-name founders raising  hundreds of millions of dollars in equity and debt from companies including Softbank. But it ultimately faced a  spectacular implosion, unable to get the business model right.\n Leuschner contends that while Drover might sound like the same model as Fair, it’s actually a very different vehicle on the inside. For starters, some two-thirds of its inventory is sourced from dealerships, OEMs and others that distribute cars.\n They use Drover as another channel, in part to diversify distribution, and in part as a way of tapping stock that it’s not able to sell through other channels. The remaining one-third is bought in by Drover, which means that the startup gets better margins on those vehicles as the owner of the vehicles, but also means higher risk for the startup — one of the areas where Drover’s technology comes into play.\n “It’s an optimisation game for us,” said Leuschner. “When you have open inventory you get a better margin but more risk. We are at that point where we know what the best vehicles are for our customer base and we have a lot of data and trading history. We’re comfortable taking some risk and higher margin structure in those cases.”\n Another key difference is that Drover is also only focusing squarely on private individuals, rather than working on subscriptions for professional drivers. That has meant that the drop off in business from those users, which some car leasing companies have seen as a knock-on effect from the fall in demand on ridesharing platforms, hasn’t had an impact for Drover.\n It’s nonetheless a big market with many opportunities for growth. Online car sales are still only one percent of all sales in the UK, he said, which is far below the rate of sales for retail goods at 20% (one reason that might be obvious: the bigger the ticket, the more likely people will want to see the goods in person). All of that is gradually shifting — not least because more recognised names are coming into the fold, and providing more legitimacy and guarantees in the process, and that opens the door to companies like Drover, too\n “By tapping into ongoing digitalisation and on-demand trends in tandem, Felix and his team are well poised to aggressively seize market share from traditional car retailers,” said Ben Kaminski, partner at Target Global, in a statement. “This new capital injection is a testament to both the team and the tech behind Drover which is disrupting the car-ownership model for the better. We’re excited to offer our support as Drover continues to scale throughout Europe.”\n Daniel Hoffer, MD at Autotech Ventures added in his own statement: “After studying the European landscape closely, we believe that Drover’s unique focus on a next-generation customer experience enabled by an asset-light approach has the potential to revolutionize how Europeans relate to car ownership. Bolstered by strong execution, Drover is poised to emerge stronger as a result of COVID-19 and recession-driven changes to consumer preferences in the ground transportation domain.”", "posttime": "2020-07-16 17:09:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "drover,汽车", "title": "\n英国Drover筹集2600万美元将其汽车订阅市场带到欧洲", "title_en": "\n\t\t\t\tUK’s Drover raises $26M for to take its car subscription marketplace to Europe\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/uks-drover-raises-26m-for-to-take-its-car-subscription-marketplace-to-europe/", "via": "", "real_tags": ["drover", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Python的icklemodule是序列化和反序列化对象的一种非常方便的方法。它不需要模式，可以处理任意的Python对象。但它也有问题。这篇文章简要解释了这些问题。\n有些人会告诉你永远不要用泡菜，因为它不好。我不会走那么远的。我要说的是，只有当你对泡菜的九个缺点没有意见的时候，才可以使用泡菜：\n泡菜可以是手工制作的，当你解开泡菜时会有恶意的影响。因此，您永远不应该取消挑选您不信任的数据。\n不安全不是因为Pickle包含代码，而是因为它们通过调用在Pickle中命名的构造函数来创建对象。任何可调用的对象都可以用来代替您的类名来构造对象。恶意的Pickles将使用其他Python可调用函数作为“构造函数”。例如，危险的Pickle可能执行“os.system(‘rm-rf/’)”，而不是执行“Models.MyObject(17)”。UnPickler无法区分“Models.MyObject”和“os.system”。这两个都是它可以解析的名称，产生它可以调用的东西。UnPickler按照Pickle的指示执行它们中的任何一个。\n更多细节，包括一个例子，请参见Supaken的帖子Dangerin Python的标准库。\n因为泡菜存储对象的结构，所以当它们未泡菜时，它们的结构与您泡菜时的结构相同。这听起来像是一件好事，也正是泡菜的设计初衷。但是，如果您的代码在制作泡菜的时间和使用它的时间之间发生了变化，则您的对象可能与您的代码不一致。对象仍将具有由旧代码创建的结构，但它们将使用新代码运行。\n例如，如果您在制作泡菜后添加了一个属性，则泡菜中的对象将不具有该属性。您的代码将预期该属性，从而导致问题。\nPickles的最大便利在于它们将序列化您的对象具有的任何结构。创建序列化结构不需要额外的工作。但这也带来了自身的问题。您真的希望将日期时间序列化为日期时间吗？或者作为iso8601字符串？你没有条件：他们会是约会时间。\n您不仅不必指定序列化形式，还不能指定它。\nPickle是隐式的：它们序列化对象中的所有内容，甚至是您不想序列化的数据。例如，您可能有一个属性是您不想序列化的计算缓存。Pickle没有一种方便的方式跳过该属性。\n更糟糕的是，如果您的对象包含不能进行PICLE的属性，比如打开的文件对象，PICLE不会跳过它，它会坚持尝试PICLE，然后抛出异常。\n泡菜存储对象的整个结构。当PICLE模块创建您的对象时，它不会调用您的__init__方法，因为对象已经创建。\n这可能会令人惊讶，因为没有任何其他地方的对象是不调用__init__而产生的。这里的逻辑是，在制作泡菜的进程中首次创建对象时，已经调用了__init__。\n但是您的__init__方法可能会执行一些重要的工作，比如打开fileobject。您的未酸洗对象将处于与您的__init__方法不一致的状态。或者，您的__init__可能会记录有关正在创建的对象的信息。未酸洗的对象不会出现在日志中。\nPickles是特定于Python的，并且只能被其他Python程序使用。这并不是严格意义上的，你可以找到其他语言的包可以使用Pickle，但是它们很少。它们自然会局限于跨语言通用列表/字典对象结构，在这一点上，您也可以只使用JSON。\nPickle是一个二进制数据流(实际上是抽象执行引擎的指令)。如果将泡菜作为纯文件打开，则无法读取其内容。知道泡菜中有什么的唯一方法是使用泡菜模块来加载它。这可能会使调试变得困难，因为您可能无法在PICLE文件中搜索您感兴趣的数据：\n函数和类是Python中的一级对象：您可以将它们存储在列表、字典、属性等中。Pickle将很乐意序列化包含函数和类等可调用对象。但它不会将代码存储在Pickle中，而只存储函数或类的名称。\nPickle不是一种移动或存储代码的方式，尽管它们看起来像是一种方式。当您取消挑选数据时，函数的名称用于查找正在运行的进程中的现有代码。\n与其他序列化技术相比，PICLE可能会很慢，正如BenFrederickson在Don‘t PickleYour Data中所展示的那样。\n其中一些问题可以通过向您的类添加特殊方法来解决，如__getstate__或__Reduce__。但是，一旦您沿着这条路开始，您也可以使用另一种序列化方法，该方法从一开始就没有这些缺陷。\n有很多其他方法可以序列化对象，从普通的JSON到更时髦的替代方法，如棉花糖、猫、协议缓冲区等等。\n我对其中任何一个都没有强烈的推荐。正确的答案取决于你问题的细节。甚至可能是泡菜。\n名称是必填项。电子邮件或Web为必填项。电子邮件不会显示，我不会给您发送垃圾邮件。您的网站不会被搜索引擎编入索引。", "note_en": "Python’s  picklemodule is a very convenient way to serialize and de-serialize objects. It needsno schema, and can handle arbitrary Python objects. But it has problems. Thispost briefly explains the problems.\n Some people will tell you to never use pickle because it’s bad. I won’t gothat far. I’ll say, only use pickle if you are OK with its nine flaws:\n     Pickles can be hand-crafted that will have malicious effects when youunpickle them. As a result, you should never unpickle data that you do nottrust.\n The insecurity is not because pickles contain code, but because they createobjects by calling constructors named in the pickle. Any callable can be usedin place of your class name to construct objects. Malicious pickles will useother Python callables as the “constructors.” For example, instead of executing“models.MyObject(17)”, a dangerous pickle might execute “os.system(‘rm -rf /’)”.The unpickler can’t tell the difference between “models.MyObject” and“os.system”. Both are names it can resolve, producing something it can call.The unpickler executes either of them as directed by the pickle.\n More details, including an example, are in Supakeen’s post Dangersin Python’s standard library.\n  Because pickles store the structure of your objects, when they are unpickled,they have the same structure as when you pickled them. This sounds like a goodthing and is exactly what pickle is designed to do. But if your code changesbetween the time you made the pickle and the time you used it, your objects maynot correspond to your code. The objects will still have the structure createdby the old code, but they will be running with the new code.\n For example, if you’ve added an attribute since the pickle was made, theobjects from the pickle won’t have that attribute. Your code will be expectingthe attribute, causing problems.\n  The great convenience of pickles is that they will serialize whateverstructure your object has. There’s no extra work to create a serializationstructure. But that brings problems of its own. Do you really want yourdatetimes serialized as datetimes? Or as iso8601 strings? You don’t have achoice: they will be datetimes.\n Not only don’t you have to specify the serialization form, you can’t specifyit.\n  Pickles are implicit: they serialize everything in your objects, even datayou didn’t want to serialize. For example, you might have an attribute that isa cache of computation that you don’t want serialized. Pickle doesn’t have aconvenient way to skip that attribute.\n Worse, if your object contains an attribute that can’t be pickled, like anopen file object, pickle won’t skip it, it will insist on trying to pickle it,and then throw an exception.\n  Pickles store the entire structure of your objects. When the pickle modulerecreates your objects, it does not call your __init__ method, since the objecthas already been created.\n This can be surprising, since nowhere else do objects come into being withoutcalling __init__. The logic here is that __init__ was already called when theobject was first created in the process that made the pickle.\n But your __init__ method might perform some essential work, like opening fileobjects. Your unpickled objects will be in a state that is inconsistent withyour __init__ method. Or your __init__ might log information about the objectbeing created. Unpickled objects won’t appear in the log.\n  Pickles are specific to Python, and are only usable by other Python programs.This isn’t strictly true, you can find packages for other languages that can usepickles, but they are rare. They will naturally be limited to the cross-languagegeneric list/dict object structures, at which point you might as well just useJSON.\n  A pickle is a binary data stream (actually instructions for an abstractexecution engine.) If you open a pickle as a plain file, you cannot read itscontents. The only way to know what is in a pickle is to use the pickle moduleto load it. This can make debugging difficult, since you might not be able tosearch your pickle files for data you are interested in:\n   Functions and classes are first-class objects in Python: you can store themin lists, dicts, attributes, and so on. Pickle will gladly serialize objectsthat contain callables like functions and classes. But it doesn’t store thecode in the pickle, just the name of the function or class.\n Pickles are not a way to move or store code, though they can appear to be.When you unpickle your data, the names of the functions are used to findexisting code in your running process.\n  Compared to other serialization techniques, pickle can be slow as BenFrederickson demonstrates in Don’t pickleyour data.\n  Some of these problems can be addressed by addingspecial methods to your class, like __getstate__ or __reduce__. But onceyou start down that path, you might as well use another serialization methodthat doesn’t have these flaws to begin with.\n  There are lots of other ways to serialize objects, ranging from plain-oldJSON to fancier alternatives like  marshmallow,  cattrs,  protocol buffers, andmore.\n I don’t have a strong recommendation for any one of these. The right answerwill depend on the particulars of your problem. It might even be pickle...\n Name is required. Either email or web are required. Email won&#39;t be displayed and I won&#39;t spam you. Your web site won&#39;t be indexed by search engines.", "posttime": "2020-07-16 17:08:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "九大,pickle,对象", "title": "泡菜的九大缺陷", "title_en": "Pickle’s Nine Flaws", "transed": 1, "url": "https://nedbatchelder.com/blog/202006/pickles_nine_flaws.html", "via": "", "real_tags": ["九大", "pickle", "对象"]}, {"category": "", "categoryclass": "", "imagename": "466ede9d0a4df808df9d47e628dab701.jpeg", "infoid": 1012241, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数以千计的公司将面临在美国服务器上存储欧盟居民信息的限制，此前欧盟最高法院裁定，此类转移使欧洲人暴露在美国政府的监视之下，没有“可起诉的权利”对此提出质疑。\n周四，欧洲法院(European Court Of Justice)做出了出人意料的裁决，宣布一项广泛使用的欧盟-美国数据传输协议无效，这是隐私活动人士的一次胜利，他们长期以来一直表示，美国的监控做法应该使其没有资格存储欧洲.", "note_en": "Thousands of companies will face restrictions on storing information about European Union residents on U.S. servers, after the bloc’s top court ruled that such transfers exposed Europeans to American government surveillance without “actionable rights” to challenge it.\n  The surprise ruling Thursday from the European Court of Justice, which invalidates a widely used EU-U.S. data-transfer agreement, is a victory for privacy activists who have long said that the U.S.’s surveillance practices should make it ineligible to store European...", "posttime": "2020-07-16 17:08:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,最高法院,top", "title": "欧盟最高法院以监控为由限制向美国转移个人数据", "title_en": "EU’s Top Court Restricts Personal-Data Transfers to U.S., Citing Surveillance", "transed": 1, "url": "https://www.wsj.com/articles/eus-top-court-restricts-personal-data-transfers-to-u-s-citing-surveillance-concerns-11594888385", "via": "", "real_tags": ["美国", "最高法院", "top"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个面向有经验的C++开发人员的Rust编程语言的简短广告。作为一个广告，它只会激起您的胃口，请参考其他资源以获得精美的印刷品。\nfn main(){let mut xs=vec！[1，2，3]；let x：&amp；I32=&amp；xs[0]；xs.ush(92)；println！(&#34；{}&#34；，*x)；}。\n此程序创建一个32位整数的向量(std：：Vector&lt；int32_t&gt；)，引用第一个元素x，再将一个数字压入向量，然后使用x。程序是错误的：扩展向量可能会使对元素的引用无效，而*x可能会取消对悬挂指针的引用。\n错误[E0502]：无法将Xs作为可变变量借入，因为它也是作为不可变借入的--&gt；src/main.rs：4：5 let x：&amp；I32=&amp；Xs[0]；--此处出现不可变借入xs.ush(92)；^可变借入出现在此处println！(X)；-稍后在此处使用的不可变借入。\nRUST编译器跟踪每段数据的别名状态，并禁止潜在别名数据的突变。在本例中，x和xs别名为堆中向量存储中的第一个整数。\nUse CrossBeam：：Scope；Use Parking_Lot：：{Mutex，MutexGuard}；fn main(){let mut counter=Mutex：：New(0)；Scope(|s|{for_in 0..。10{s.spawn(|_|{for_in 0..。10{let mut Guard：MutexGuard&lt；I32&gt；=Counter.lock()；*Guard+=1；}})；}}).unwire()；let Total：&amp；mut I32=Counter.get_mut()；println！(&#34；Total={}&#34；，*total)}。\n该程序创建一个受互斥锁保护的整数计数器，派生10个线程，从每个线程开始递增计数器10次，并打印总数。\nCOUNTER变量驻留在堆栈上，指向这些堆栈数据的指针与其他线程共享。线程必须锁定互斥锁才能进行递增。打印总数时，计数器将绕过互斥锁读取，而不会进行任何同步。\n该程序的美妙之处在于，它依赖于几个微妙的推理来保证正确性，每个推理都由编译器进行检查：\n子线程不会转义Main函数，因此可以从其堆栈中读取计数器。\n当我们在没有互斥锁的情况下读取总计数时，子线程将已经终止。\n如果这些约束中的任何一个被打破，编译器就会拒绝代码，不需要使用std：：shared_ptr来防御性地确保内存不会在您的脚下释放。\n如果你喜欢你所看到的，这里有两本我推荐给你深入了解铁锈的书：", "note_en": "This is a short ad of a  Rust programming language targeting experienced C++ developers.Being an ad, it will only whet your appetite, consult other resources for fine print.\n fn  main ()  {  let  mut  xs  =  vec! [ 1 ,  2 ,  3 ];  let  x :  &amp; i32  =  &amp; xs [ 0 ];  xs .push ( 92 );  println! ( &#34;{}&#34; ,  * x ); }\n This program creates a vector of 32-bit integers ( std::vector&lt;int32_t&gt;), takes a reference to the first element,  x, pushs one more number onto the vector and then uses  x.The program is wrong: extending the vector may invalidate references to element, and  *x might dereference a danging pointer.\n  error[E0502]: cannot borrow xs as mutable because it is also borrowed as immutable --&gt; src/main.rs:4:5 let x: &amp;i32 = &amp;xs[0]; -- immutable borrow occurs here xs.push(92);  ^^^^^^^^^^^ mutable borrow occurs here println!(x); - immutable borrow later used here\n Rust compiler tracks aliasing status of every piece of data and forbids mutations of potentially aliased data.In this example,  x and  xs alias the first integer in the vector’s storage in the heap.\n use  crossbeam :: scope ; use  parking_lot ::{ Mutex ,  MutexGuard }; fn  main ()  {  let  mut  counter  =  Mutex :: new ( 0 );  scope (| s |  {  for  _  in  0 .. 10  {  s .spawn (| _ |  {  for  _  in  0 .. 10  {  let  mut  guard :  MutexGuard &lt; i32 &gt;  =  counter .lock ();  * guard  +=  1 ;  }  });  }  }) .unwrap ();  let  total :  &amp; mut  i32  =  counter .get_mut ();  println! ( &#34;total = {}&#34; ,  * total ) }\n This program creates an integer counter protected by a mutex, spawns 10 threads, increments the counter 10 times from each thread, and prints the total.\n The  counter variable lives on the stack, and a pointer to these stack data is shared with other threads.The threads have to lock the mutex to do the increments.When printing the total, the counter is read bypassing the mutex, without any synchronization.\n The beauty of this program is that it relies on several bits of subtle reasoning for correctness, each of which is checked by compiler:\n Child threads don’t escape the  main function and so can read  counter from its stack.\n  Child threads will have terminated by the time we read  total out of  counter without mutex.\n If any of these constraints is broken, the compiler rejects the code.There’s no need for  std::shared_ptr just to defensively make sure that the memory isn’t freed under your feet.\n  If you like what you see, here are two books I recommend for diving deeper into Rust:", "posttime": "2020-07-16 17:07:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,生锈,向量", "title": "两个美丽的生锈节目", "title_en": "Two Beautiful Rust Programs", "transed": 1, "url": "https://matklad.github.io//2020/07/15/two-beautiful-programs.html", "via": "", "real_tags": ["rust", "生锈", "向量"]}, {"category": "", "categoryclass": "", "imagename": "d5a1e64c45b96beba33f722604734720.png", "infoid": 1012239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "乔什·斯坦(Josh Stein)在过去16年里一直是一名投资者，作为一名年轻的运营商加入了DFJ公司，在公司的队伍中一路晋升，最终与董事总经理埃米莉·梅尔顿(Emily Melton)一起，成为该公司最资深的成员，该公司去年更名为门槛风险投资公司(Threshold Ventures)。斯坦，他是Box的董事会成员，参加了[…]", "note_en": "Josh Stein has been an investor for the past 16 years, joining the firm DFJ as a young operator, rising through its ranks, and ultimately, along with fellow managing director Emily Melton, becoming the most senior member of the firm, which was last year renamed Threshold Ventures. Stein, who sat on Box’s board for the […]", "posttime": "2020-07-16 16:48:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,斯坦,moment", "title": "\n风险投资家乔希·斯坦(Josh Stein)谈到了权力动态：“我不认为这对投资者来说是一个扭曲胡须的时刻。”", "title_en": "\n\t\t\t\tVC Josh Stein talks power dynamics: ‘I don’t think this has been a mustache-twisting moment for investors’\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/vc-josh-stein-talks-power-dynamics-i-dont-think-this-has-been-a-mustache-twisting-moment-for-investors/", "via": "", "real_tags": ["风险投资", "斯坦", "moment"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012238, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8年前，我写了一本关于计算系统性能的书“系统性能：企业与云”(Systems Performance：Enterprise and the Cloud)，今年我很高兴能出版第二版。第一版很成功，卖出了超过10000册，成为许多公司的必读或推荐读物(甚至在工作描述中也提到了)。感谢大家的支持。我收到的反馈认为它很有用，不仅可以学习性能，还可以展示计算机的内部工作方式：这是所有工程师的基本知识。\n第二版增加了关于bpf、bcc、bpftrace、perf和ftrace的内容，主要删除了Solaris，对Linux和云计算进行了大量更新，并包括一般的改进和添加。它是由比第一版更有经验的我自己写的，包括我在Netflix担任高级性能工程师的6年经验。这个版本还经过了一个由30多名工程师组成的新的技术审查团队的改进。\n从第一版到现在有多大的变化？这很难说，但很容易想象。作为示例，下面显示了第6章，CPU，其中黑色文本来自第一版，彩色文本是更新(这是我用来在文本更改时向审阅者显示的配色方案；从最旧的更改到最新的更改：黄、绿、水、蓝、紫、红)：\n下面是整本书的3.1兆字节的jpg格式。(请注意，这些可视化并不是最终的，因为我仍在进行更新。而且这不会突出显示图形和复制-编辑更改。)。\n这本书将于2020年11月由艾迪森·韦斯利(Addison Wesley)出版，约800页。它已经在亚马逊网站上列出了。\n一年前，我发布了BPF性能工具：Linux系统和应用程序可观察性。在某种程度上，系统性能是第一卷，而BPF性能工具是第二卷。Sysperf提供了模型、理论、体系结构、可观察性工具(传统工具和跟踪工具)、实验工具和调优的平衡覆盖。“BPF工具”一书只关注BPF跟踪工具，并简要概述了体系结构和传统工具。\n你应该买哪本书？当然，两者都有。：-)因为它们都是绩效书，所以它们之间有一些重叠，但不是很多。我认为Sysperf有更广泛的受众：它是任何人学习性能和计算机内部知识的手册。BPF工具书将满足那些希望跳到前面并运行高级工具以获得一些快速胜利的人。\n有关更多信息，包括显示在哪里购买该书的链接，请参阅其网站：系统性能：企业与云，第2版。\n你可以在这里发表评论，但我不能保证你的评论会永远留在这里：我可能会在某个时候切换评论系统(例如，如果Disqus添加广告)。\n由Disqus提供支持的评论", "note_en": "Eight years ago I wrote  Systems Performance: Enterprise and the Cloud (aka the &#34;sysperf&#34; book) on the performance of computing systems, and this year I&#39;m excited to be releasing the second edition. The first edition was successful, selling over 10k copies and becoming required or recommended reading at many companies (and even mentioned in  job descriptions). Thanks to everyone for their support. I&#39;ve received feedback that it is useful, not just for learning performance, but also for showing how computers work internally: essential knowledge for all engineers.\n The second edition adds content on BPF, BCC, bpftrace, perf, and Ftrace, mostly removes Solaris, makes numerous updates to Linux and cloud computing, and includes general improvements and additions. It is written by a more experienced version of myself than I was for the first edition, including my six years of experience as a senior performance engineer at Netflix. This edition has also been improved by a new technical review team of over 30 engineers.\n How much has changed since first edition? It&#39;s hard to say, but easy to visualize. As an example, the following shows Chapter 6, CPUs, where black text is from the first edition and colored text are the updates (this is a color scheme I use to show reviewers when text was changed; from oldest changes to newest: yellow, green, aqua, blue, purple, red):\n  Here is the  entire book as a 3.1 Mbyte jpg. (Note that these visualizations are not final as I&#39;m still making updates. And this doesn&#39;t highlight figure and copy-edit changes.)\n The book will be released in November 2020 by Addison Wesley, and will be around 800 pages. It&#39;s already listed on  Amazon.com.\n A year ago I announced  BPF Performance Tools: Linux System and Application Observability. In a way, Systems Performance is volume 1 and BPF Performance Tools is volume 2. Sysperf provides balanced coverage of models, theory, architecture, observability tools (traditional and tracing), experimental tools, and tuning. The BPF tools book focuses on BPF tracing tools only, with brief summaries of architecture and traditional tools.\n Which book should you buy? Both, of course. :-) Since they are both performance books there is a little overlap between them, but not much. I think sysperf has a wider audience: it is a handbook for anyone to learn performance and computer internals. The BPF tools book will satisfy those wishing to jump ahead and run advanced tools for some quick wins.\n For more information, including links showing where to buy the book, please see its website:  Systems Performance: Enterprise and the Cloud, 2nd Edition.\n    You can comment here, but I can&#39;t guarantee your comment will remain here forever: I might switch comment systems at some point (eg, if disqus add advertisements).\n comments powered by  Disqus", "posttime": "2020-07-16 16:46:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,performance,工具", "title": "系统性能：企业与云，第2版", "title_en": "Systems Performance: Enterprise and the Cloud, 2nd Edition", "transed": 1, "url": "http://www.brendangregg.com/blog/2020-07-15/systems-performance-2nd-edition.html", "via": "", "real_tags": ["性能", "工具"]}, {"category": "", "categoryclass": "", "imagename": "20e06ace50dd066e9b236bb61fedd7e8.png", "infoid": 1012237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "#ECJ：关于欧盟-美国数据保护盾牌提供的保护是否足够的决定无效，但@EU_Commission关于将个人数据转移到第三国建立的处理器的标准合同条款的决定有效#Facebook#Schrems pic.twitter.com/BgxGAvuq3T。\n这起案件-俗称Schrems II(指的是隐私权活动家和律师Max Schrems，他最初的投诉支撑了这一传奇故事)-有着悠久而错综复杂的历史。简而言之，它涉及与人们的数字数据相关的两个截然不同的法律制度之间的冲突：一方面是美国的监控法，另一方面是欧洲的数据保护和隐私。\n更具说服力的是，美国对数字监控的优先考虑-正如2013年美国国家安全局(NSA)泄密者爱德华·斯诺登(Edward Snowden)的爆料所揭示的那样；并在FISA(外国情报监视法案)第702条允许的数据捕获权力的广度上-与赋予公民隐私权和数据保护权的欧洲基本权利直接冲突。\nSchrems II案件还直接涉及Facebook，同时对欧盟公民数据可以进行多大规模的数据处理具有更广泛的影响。\n具体的问题是围绕Facebook(和许多其他公司)在美国处理地区用户数据所使用的欧洲数据传输机制的合法性问题，该机制被称为标准合同条款(SCC)。\n施雷姆斯在2015年底对Facebook使用SCC的做法提出了挑战，当时他向爱尔兰的数据监管机构更新了早些时候就与美国政府大规模监控做法有关的同一数据传输问题提出的投诉。\n他要求爱尔兰数据保护委员会(DPC)暂停Facebook使用SCC。相反，监管机构决定将他和Facebook告上法庭，称其担心整个机制的合法性。爱尔兰法官随后将大量微妙的法律问题提交给欧洲最高法院，这将我们带到了今天。值得注意的是，Facebook多次试图阻止向法院提交信息，但均以失败告终。\n爱尔兰高等法院的移交还引发了对欧盟委员会(European Commission)一项名为欧盟-美国隐私盾牌(EU-US Privacy Shield)的旗舰数据传输协议的质疑。这取代了一项名为安全港的长期欧盟-美国数据传输协议，该协议在Schrems早些时候也提出挑战后，于2015年被CJEU否决。(因此，Schrems II。)\n因此，与此案相关的部分预期与欧洲最高法官是否会选择就隐私盾(Privacy Shield)的合法性进行权衡有关。隐私盾是一种数据传输框架，目前已有5300多家公司使用。而欧盟委员会几年前才开始实施。\n批评这一安排的人士坚称，它并没有解决美国监控和欧盟数据保护之间的根本冲突-近年来，随着特朗普政府的上台，隐私盾牌的位置看起来越来越不稳定。\n在这一事件中，CJEU站在了批评人士一边，这些批评者长期以来一直认为隐私盾牌相当于猪身上的口红。对于欧盟委员会(European Commission)来说，今天肯定不是好日子(昨天它在法庭上就另一件事也经历了非常糟糕的一天)。我们联系了欧盟行政部门就Schrems II发表评论，一位发言人告诉我们，它将在中午举行新闻发布会。\n突如其来：欧盟法院刚刚宣布欧盟和美国之间的隐私盾牌数据共享系统无效，原因是美国的监听范围过大。此处提供所有详细信息：https://t.co/xN4HKhZaBT#PRISM#FISA702#隐私#PrivacyShield#SCC#GDPR#CJEU。\n隐私盾牌也受到了单独的法律挑战-在该案中的原告(La Quadrature Du Net)辩称，该机制侵犯了欧盟的基本权利，没有为欧盟公民的数据提供足够的保护。那个案子现在已经没有意义了。\n在SCC方面，CJEU没有对该机制本身提出异议-但法官认为，数据管制员有义务对数据将被获取的国家提供的数据保护进行评估。如果该级别不等于欧盟法律规定的级别，则控制器有法律义务暂停数据传输。\n这还意味着，欧盟监管机构(如爱尔兰的DPC)有明确的义务暂停通过SCC向数据保护不足的第三国传输数据。这是Schrems一开始就要求爱尔兰监管机构做的事情。\n目前尚不清楚Facebook等使用SCC将欧盟公民数据带到美国的公司还有什么替代方案，因为法官以在美国缺乏对欧盟公民数据的保护为由，宣布Privacy Shield无效。美国的监控法阻碍了他们的数据流。\n在一份声明中，兴高采烈的施雷姆斯在评论这一裁决时说：“我对这一判决感到非常高兴。乍一看，法院似乎在所有方面都跟随我们。这对爱尔兰民主党和Facebook是一个彻底的打击。很明显，如果美国企业想要继续在欧盟市场上发挥作用，美国将不得不认真修改他们的监控法。“", "note_en": "#ECJ: the Decision on the adequacy of the protection provided by the EU-US Data Protection Shield is invalidated, but  @EU_Commission Decision on standard contractual clauses for the transfer of personal data to processors established in third countries is valid  #Facebook  #Schrems  pic.twitter.com/BgxGAvuq3T\n The case — known colloquially as Schrems II (in reference to privacy activist and lawyer,  Max Schrems,   whose original complaints underpin the saga) — has a long and convoluted history. In a nutshell it concerns the clash of two very different legal regimes related to people’s digital data: On the one hand US surveillance law and on the other European data protection and privacy.\n Putting a little more meat on the bones, the US’ prioritizing of digital surveillance — as revealed by the 2013 revelations of NSA whistleblower,  Edward Snowden;   and writ large in the breadth of data capture powers allowed by Section 702 of FISA (Foreign Intelligence Surveillance Act) — collides directly with European fundamental rights which give citizens rights to privacy and data protection.\n The Schrems II case also directly concerns  Facebook,   while having much broader implications for how large scale data processing of EU citizens data can be done.\n At specific issue are questions of legality around a European data transfer mechanism used by Facebook (and many other companies) for processing regional users’ data in the US — called Standard Contractual Clauses (SCCs).\n Schrems challenged Facebook’s use of SCCs at the end of 2015, when he updated an earlier complaint on the same data transfer issue  related to US government mass surveillance practices with Ireland’s data watchdog.\n He asked the Irish Data Protection Commission (DPC) to suspend Facebook’s use of SCCs. Instead the regulator decided to take him and Facebook to court, saying it had concerns about the legality of the whole mechanism. Irish judges then referred a large number of nuanced legal questions to Europe’s top court, which brings us to today. It’s worth noting Facebook  repeatedly  tried and  failed to block the reference to the Court of Justice.\n The referral by the Irish High Court also  looped in questions over a flagship European Commission data transfer agreement, called the EU-US Privacy Shield. This replaced a long standing EU-US data transfer agreement called Safe Harbor which was struck down by the CJEU in  2015 after an earlier challenge also lodged by Schrems. (Hence Schrems II.)\n So part of the anticipation associated with this case has related to whether Europe’s top judges would choose to weigh in on the legality of Privacy Shield — a data transfer framework that’s being used by  more than 5,300 companies at this point. And which the European Commission only put in place  a handful of years ago.\n Critics of the arrangement have maintained it does not resolve the fundamental clash between US surveillance and EU data protection — and in recent years, with the advent of the Trump administration, the Privacy Shield has looked increasingly  precariously placed.\n In the event the CJEU has sided with critics who have long maintained Privacy Shield is the equivalent of lipstick on a pig. Today is certainly not a good day for the  European Commission   (which also had a  very bad day in court yesterday on a separate matter). We reached out to the EU executive for comment on Schrems II and a spokesman told us it will be holding a press briefing at noon.\n BREAKING: The EU&#39;s Court of Justice has just invalidated the &#34;Privacy Shield&#34; data sharing system between the EU and the US, because of overreaching US surveillance. All details available here:  https://t.co/xN4HKhZaBT  #PRISM  #FISA702  #Privacy  #PrivacyShield  #SCCs  #GDPR  #CJEU\n Privacy Shield had also been under  separate legal challenge — with the complainant in that case (La Quadrature du Net) arguing the mechanism breaches fundamental EU rights and does not provide adequate protection for EU citizens’ data. That case is now moot.\n On SCCs, the CJEU has not taken issue with the mechanism itself — but judges impress the obligation on data controllers to carry out an assessment of the data protection afforded by the country where the data is to be taken. If the level is not equivalent to that offered by EU law then the controller has a legal obligation to suspend the data transfers.\n This also means EU regulators — such as Ireland’s DPC — have a clear obligation to suspend data transfers that are taking place via SCCs to third countries where data protections are not adequate. Which was what Schrems had asked the Irish regulator to do in the first place.\n It’s not immediately clear what alternative exists for companies such as Facebook that are using SCCs to take EU citizens’ data to the US, given judges have invalidated Privacy Shield on the grounds of the lack of protections afforded to EU citizens data in the country. US surveillance law is standing in the way of their data flows.\n Commenting on the ruling in a statement, a jubilant Schrems said: “I am very happy about the judgment. At first sight it seems the Court has followed us in all aspects. This is a total blow to the Irish DPC and Facebook. It is clear that the US will have to seriously change their surveillance laws, if US companies want to continue to play a role on the EU market.”", "posttime": "2020-07-16 16:26:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,最高法院,top,欧盟", "title": "\n欧洲最高法院推翻欧盟-美国旗舰数据传输机制", "title_en": "\n\t\t\t\tEurope’s top court strikes down flagship EU-US data transfer mechanism\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/16/europes-top-court-strikes-down-flagship-eu-us-data-transfer-mechanism/", "via": "", "real_tags": ["美国", "最高法院", "top", "欧盟"]}, {"category": "", "categoryclass": "", "imagename": "1d81c6ea2672487b3be0b0a98215703f.jpg", "infoid": 1012236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "用186个乐高的齿轮建造一个长长的轮系。使用了许多不同类型的乐高齿轮。好好享受吧！灵感来自丹尼尔·德·布鲁因的“宇宙中最大的齿轮.", "note_en": "Building a long gear train using 186 Lego gears. Many different types of Lego gears are used. Enjoy! Inspired by Daniel de Bruin's \"universe's biggest gear r...", "posttime": "2020-07-16 16:04:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "乐高,googol,丹尼尔", "title": "使用乐高齿轮进行固特异：1减价[视频]", "title_en": "Making a Googol:1 Reduction with Lego Gears [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=QwXK4e4uqXY", "via": "", "real_tags": ["乐高", "googol", "丹尼尔"]}, {"category": "", "categoryclass": "", "imagename": "0bbaebf8891832b64159eed83692d2b8.jpg", "infoid": 1012234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在豪尔赫·路易斯·博尔赫斯(Jorge Luis Borges)短短12页的故事中，这位著名作家在巨大的记忆迷宫和拥有无限记忆能力的后果的背景下玩弄着无限。\n1942年6月7日，在第二次世界大战改变了惯例的情况下，这是一个和往常一样的星期天。“国家报”(La Nación)的头版报道了英国的进攻，并继续轰炸鲁尔的德国工业区。在同一页上，人们可以读到日本舰队在中途岛造成的伤亡，以及英国步兵坦克袭击沙漠中的德军阵地。报纸的第五和第六页，在Eno的“水果盐”(一种助消化产品，每瓶售价70美分)和Fernet Branca(一种带朋友回家应该带回家的饮料)的广告间隙，讲述了门多萨一场没有受害者的地震，并宣布轮胎工厂可以开始恢复旧轮胎。在体育方面，阿根廷青年队在晋级英超联赛的征程中以4比1击败了阿尔西纳竞技队(Sportivo Alsina)，娱乐版面以每座1.5美元的价格宣传了一部由奥利维亚·德·哈维兰(Olivia De Havilland)和亨利·方达(Henry Fonda)主演的新电影。\n1942年6月7日，根据La Nación的说法，这一天和其他任何一天都一样，只是艺术和文学版块上出现了一篇短篇小说，这篇短篇小说将把这一期报纸变成了一份历史性的文件。本周日副刊的第一页是斯特凡·茨威格(Stefan Zweig)的故事；第二页是埃内斯托·萨巴托(Ernesto Sabato)的一篇赞扬伽利略的文章；第三页几乎隐藏在人们的视线中，首次出现了豪尔赫·路易斯·博尔赫斯(Jorge Luis Borges)的不朽短篇小说“纪念的富内斯”(Funes The Memous)，配上亚历杭德罗·西里奥(Alejandro Sirio)的插图。\n“纪念富内斯”讲述了来自弗雷·本托斯(Fray Bentos)的农民艾雷诺·富内斯(Ireneo Funes)的沧桑，他从马上摔下来，头部猛烈撞击，用令人难以置信的技能-或者可能是诅咒-完全记住了一切，恢复了意识。\nNosotros，de un vistazo，percibimos tres Copas en una Mesa；Funes，todos los vástagos y racimos y Frutos que comprende una Parra。SABía las formas de las nubes australes del Amanecer del 30 de abril de 1882 y Podía comparlas en el Recuerdo con las Vetas de un library o en意大利面española que sólo había Mirado una vez y con las líneas de la esuma que un Remo Levantóen el Río Nero la víSpera de la ACCIón del Quebracho。\n我们一下子就看到桌子上放着三个杯子；富内斯会看到一棵葡萄树上所有的嫩芽、花簇和果实。他知道1882年4月30日黎明时分南方云层的形状，并能在记忆中将它们与一本西班牙封面上只见过一次的条纹相提并论，也能与奎布拉乔战役前夕里奥黑人的桨在泡沫上激起的漩涡相提并论。]。\n豪尔赫·路易斯·博尔赫斯(Jorge Luis Borges，1899-1986)在他的著作中深入探讨哲学和科学的重要问题，受到了普遍的好评。在博尔赫斯的手中，无限的主题要么是一个包含宇宙的点(“阿列夫”)，一个坚不可摧的迷宫(“两个国王和两个迷宫”)，一个永远重复的图书馆(“巴别塔图书馆”)，一个细分为无数可能性的故事(“岔路花园”)，或者是一幅非常详细的帝国地图，以至于它最终拥有帝国本身的大小(“严谨的科学”)。在“纪念的富内斯”(Funes The Memosous)中，博尔赫斯的故事只有12页，最终作为“菲西奥内斯”(Ficciones，1944)的一部分出版。博尔赫斯再次在一个同样引人入胜的背景下玩弄无限：巨大的记忆迷宫，以及拥有无限记忆能力的后果。\n富内斯第一次被提到是在詹姆斯·乔伊斯的讣告中，1941年发表在“南方”杂志上的“关于乔伊斯的片段”。在那里，博尔赫斯带着一定程度的讽刺说，要直读像乔伊斯的“尤利西斯”这样的“怪物”-一部40万字的都柏林一天的重现-需要另一个能够记住无数细节的怪物。讣告的奇怪之处在于，博尔赫斯几乎没有提到乔伊斯或他的作品，而是描述了他当时正在撰写的故事的主人公爱雷诺·富内斯(Ireneo Funes)。\nENTERRE losobras que no he escito ni escribiré(pero que de alguna manera me retifican，siquiera miseriosa y rudimental)hay un relato de unas Ocho Diez páGinas cuyo funuso Diez páginas cuyo funuso se titiula“Funes el Memorioso”(“Funes el Memorioso”)：“Funes el Memorioso”。。。。德尔Comadrito mágico de mi cuento Cabe afirmar que es un前体de los Superhombres，un Zaratustra subburo y parcio；lo不可分割es que es un monstruco。Lo他记录了一个连续的讲演las cutrecientas mil palabras de ulise exigiría monstrucos análogos。\n[在我没有写过也永远不会写的作品中(但这不知何故证明了我是合理的，无论我是多么神秘和简陋)，有一个短篇小说，大约有八到十页长，它丰富的草稿叫做“纪念的富内斯”。。。关于我故事中的魔术比喻，我可以说，他是超人的前身，是郊区残缺不全的查拉图斯特拉；不可否认的是，他是一个怪物。我之所以记住他，是因为要直截了当、不间断地阅读尤利西斯的四十万字，也需要类似的怪兽。]。\n博尔赫斯在“菲西奥内斯”第二部分“诡计”的序言中指出，“纪念富内斯”是对失眠的长篇比喻。事实上，在故事接近尾声时，他提到富内斯发现很难入睡，因为睡觉就是从世界上分心。博尔赫斯在美国发表的一篇采访中详细介绍了他在自己的不眠之夜(可能是在阿德罗圭昆塔酒店一个潮湿的夏夜)构思Funes的方式：\n当我失眠的时候，我试着忘记我自己，忘记我的身体，忘记我身体的位置，忘记床，忘记家具，忘记酒店的三个花园，忘记桉树，忘记书架上的书，忘记村子里所有的街道，忘记车站，忘记农舍。因为我忘不了，所以我一直保持清醒，睡不着觉。然后我对自己说，让我们假设有一个人无法忘记他所看到的一切，众所周知，这发生在詹姆斯·乔伊斯身上，他可能在一天内带来了“尤利西斯”，在这一天里发生了成千上万的事情。我想到了一个无法忘记那些事件的人，他最终被自己无限的记忆冲走了。一言以蔽之，那个支离破碎的流氓就是我，或者说是我为文学目的而盗取的形象，但这与我自己的失眠相对应。\n在第一个千年的文献中已经提到了具有惊人记忆力的人，特别是在老普林尼的“自然历史”(自然历史)中，这是一种百科全书，在37本书中描述了从地理、科学和技术到古罗马的农业、草药和昆虫的一切。在第七卷第24章关于记忆的主题中，普林尼提到波斯国王居鲁士，他知道他所有士兵的名字；西皮略，他知道罗马所有人的名字；皮罗斯国王的大使西尼亚斯，他在抵达罗马后仅一天就知道了所有罗马参议员的名字；米特里达斯·尤帕托，他用他的帝国所说的22种语言主持司法；西蒙尼德斯，记忆法的发明者；或者希腊人查玛达斯，他会背诵。\n普林尼认为拥有非凡的记忆力是一种福气。事实上，他在第七卷第24章一开始就说：“记忆是生活中最需要的恩惠，很多人都因此而声名远扬，所以很难说出谁在这方面做得最好，这是生活中最需要的恩惠。”(“记忆是人生最需要的恩赐，很难说谁在这方面做得最好，有那么多人因此而声名鹊起)”，他这样写着：“记忆是人生最需要的恩惠，很难说谁在这方面做得最好，有那么多人因此而声名鹊起。”\n普林尼还描述了记忆的脆弱性，他认为，记忆可能会全部或部分由于疾病、伤害甚至恐慌而丢失。作为一个例子，他讲述了一个人在被石头击中后失去了命名字母的能力，以及另一个人在从屋顶上摔下来后忘记了某些人的故事。他还提到了演说家梅萨拉·科维纳斯(Messala Corvinus)，他甚至连自己的名字都记不起来了。\n众所周知，博尔赫斯着迷于百科全书和“自然历史”(也许是历史上第一部百科全书)，事实上，他在“追忆的富内斯”中提到了这一点：富内斯向叙述者(博尔赫斯)索要任何拉丁文文本，博尔赫斯要求普林尼百科全书的第七卷和奎切拉的“同义词库”，就像这样，一旦发现一个人不能，卢布就会大失所望。然而，在他们的下一次会议上，富内斯用完美的拉丁语嘲弄地朗诵了一句话来欢迎博尔赫斯：“ut nihil non iisdem Verbis redderetur auditum”(字面意思是：“听过的东西都不能用同样的话重复”)。\n通过富内斯，博尔赫斯和普林尼一样进入了记忆领域，尽管他的反应在一个关键方面与罗马人不同：普林尼认为拥有惊人的记忆能力是一种美德，而博尔赫斯的眼光则超越了这一点，并认为非凡的记忆力可能会成为一种诅咒。富内斯在故事进行到一半时说：\nMás recuerdos tengo yo solo que Los que Habrán tenido todos los hombres desque el Mundo es mundo.。。。。我的记忆，先生，这是科莫和巴苏拉的Vaciadero de basura。\n仅我一人的记忆就比世界存在以来所有人的记忆都要多。。。。先生，我的记忆就像垃圾堆。]。\n鉴于其历史意义，普林尼的故事具有不可否认的价值。然而，要判断他们的真实性是不可能的，事实上，“自然历史”中描述的人物似乎更像是传奇人物，而不是真实人物(或许更能激起博尔赫斯的好奇心)。这在很大程度上是因为普林尼的许多描述都是基于口口相传的信息，在讲述过程中不可避免地发生了变化。例如，当普利尼在第七卷第21章描述惊人视力的情况时，他写道，荷马的“伊利亚特”是用如此小的剧本写成的，整个手稿可以用坚果壳来概括；他还提到了一个叫斯特拉博的人，他能认出135英里外的物体，在布匿战争期间，他能看到甚至数清停靠在西西里海角上迦太基的敌舰。\n第一个记录在案的非凡记忆力案例是所罗门·谢列舍夫斯基(Solomon Shereshevskii)，他从20世纪20年代开始由著名的俄罗斯心理学家亚历山大·卢里亚(Alexander Luria)进行研究。正如Luria在他的书“记忆家的思想：一本关于巨大记忆的小书”(The Mind of a Mememonist：A Little Book About a Mememonist)中所写的那样，主题S(他提到舍列舍夫斯基是为了保护自己的名字)与其他所有人不同，如果他想忘记什么，就必须付出努力。谢列舍夫斯基拥有非常强的通感--不同感官之间的一种不由自主的联系，比如把数字和颜色联系起来--这给他的记忆赋予了更丰富的内容，从而使他的记忆更容易被回忆起来。这些联想，以及简单助记法的使用，让谢列舍夫斯基在第一次听到数字和字母多年后，就能记住它们的长序列。在研究舍列舍夫斯基30多年后，Luria承认他无法找到S.记忆的极限，考虑到它不是来自于一个业余爱好者，而是来自他那个时代最重要的心理学家之一，这是一个令人惊讶的说法。\n谢列舍夫斯基和富内斯之间有明显的相似之处，尽管前者是基于他的通感训练他的记忆，而后者记忆一切都是完全自然的。然而，博尔赫斯不太可能知道卢里亚的作品，因为卢里亚在1968年才出版了他的书(英文版)，比博尔赫斯写下富内斯的故事晚了25年多。\n“纪念富内斯”也展示了尼采的影响力(正如罗克珊娜·克里梅尔在一篇有趣的文章中所描述的那样)；特别是，博尔赫斯称富内斯是“超人的前身，一个郊区的、不完整的查拉图斯特拉(Zarathustra)”。在一篇关于遗忘重要性的精彩文章中，尼采写道：\n试想一个最极端的例子，一个没有健忘能力的人，他该死地看到自己无处不在；这样的人将不再相信自己的存在，不再相信自己，将看到一切在动荡的粒子中四分五裂，迷失在这股形成的洪流中；就像赫拉克利特的真正学生一样，最终他几乎不敢动一根手指。所有的行动都需要遗忘，正如所有有机体的存在不仅需要光明，也需要黑暗。\n博尔赫斯对心灵的迷恋(在这种哲学背景下，我再次使用“心灵”而不是“大脑”，尽管我没有对两者进行区分)可能来自他的父亲，一位律师和心理学教授，他把他介绍给了威廉·詹姆斯(William James)等作家，许多人认为威廉·詹姆斯是现代心理学之父。在他最重要的著作之一“心理学原理”(1890年)中，詹姆斯这样描述记忆：\n如果我们什么都记得，在大多数情况下，我们应该像什么都不记得一样生病。。。。“矛盾的结果是，记住的一个条件是我们应该忘记。如果不是完全忘记了大量的意识状态，不是瞬间忘记了大量的状态，我们就完全记不起来了。“。\n与富内斯、谢列舍夫斯基和尼采的关系令人着迷。例如，Luria写道，Shereshevskii“在逻辑组织方面相当无能”。博尔赫斯反过来说，富内斯。\n您的位置：我也知道&gt;地区&gt;法国&gt;瑞士法郎&gt;葡萄牙语&gt;索斯佩克，罪过禁运，没有时代可言。\n毫不费力地学会了英语、法语、葡萄牙语、拉丁语。然而，我怀疑他的思考能力不是很强。]。\n再说一遍：我不是指乔伊斯、普林尼、卢里亚、尼采和詹姆斯，而是要质疑博尔赫斯故事的原创性。相反，这些平行著作提供了哲学和科学基础，博尔赫斯可能在此基础上找到了他的部分灵感。撇开博尔赫斯是否知道卢里亚的研究--我相信不知道--的问题不谈，我不禁注意到，他在短篇小说的背景下对待一个像记忆这样复杂的话题时表现出的不可思议的清晰度。\n回到富内斯和其他具有非凡记忆力的人身上，我们必须提到博尔赫斯本人，他可以用西班牙语、英语、德语和盎格鲁-撒克逊语以及其他语言引用整段文字。尽管失明可能导致了他令人难以置信的记忆(没有被视觉刺激分心，他可以像他之前的德莫克里特一样，专注于他的思想和记忆的溪流)，但博尔赫斯年轻时意识到，他会像他的父亲一样失去视力，这让他在还能看到的时候，对知识进行了不朽的追求。玛丽亚·科达玛(他的遗孀)记得，在她与博尔赫斯的第一次相遇中，他让她找一本书的节选。这位作家说，这段片段在书中间附近的奇数页上。小玉开始随机阅读一页，令人惊讶的是，博尔赫斯引导她到了正确的一页，尽管他已经失明多年，正如他在第一页上草草写下的那样，在1916年，也就是与小玉相遇的几十年前，他读过这本书。\n罗德里戈·奎恩·奎罗加(Rodrigo Quian Quiroga)是莱斯特大学系统神经科学中心主任。他是“博尔赫斯与记忆”、“神经编码原理”、“脑电图成像大脑功能”和“健忘机”的作者。", "note_en": "In Jorge Luis Borges&#39;s story of barely 12 pages, the celebrated writer plays with the infinite in a context of vast labyrinths of memory and the consequences of having an unlimited capacity to remember.\n   June 7, 1942, was a Sunday like any other amid the altered routine of the Second World War. The front page of the newspaper La Nación reported on the British onslaught, which continued with a bombing campaign over the German industrial area in the Ruhr. On the same page, one could read about the casualties inflicted on the Japanese fleet at Midway and about British infantry tanks’ attacking German positions in the desert. Pages five and six of the paper, in between advertisements for Eno’s “Fruit Salt” (a digestive aid selling at 70 cents per vial) and Fernet Branca (a beverage that should be brought home as one brings a friend), give an account of an earthquake without victims in Mendoza and announce that tire factories can start restoring used tires. In sports, Argentinos Juniors beat Sportivo Alsina by four goals to one in their campaign to reach the premier league, and the entertainment pages promote Pirates of the Caribbean, in Technicolor, and a new movie starring Olivia de Havilland and Henry Fonda at $1.50 a seat.\n  June 7, 1942, a day like any other according to La Nación, except for a short story appearing in the Arts and Letters section that would turn this issue of the newspaper into a historic document. The first page of this Sunday supplement features a story by Stefan Zweig; the second page contains an essay by Ernesto Sabato praising Galileo; and on the third page, almost hidden in plain sight, for the first time appears “Funes the Memorious,” Jorge Luis Borges’s monumental short story, with an illustration by Alejandro Sirio.\n “Funes the Memorious” tells the vicissitudes of Ireneo Funes, a peasant from Fray Bentos, who after falling off a horse and hitting his head hard recovers consciousness with the incredible skill — or perhaps curse — of remembering absolutely everything.\n  Nosotros, de un vistazo, percibimos tres copas en una mesa; Funes, todos los vástagos y racimos y frutos que comprende una parra. Sabía las formas de las nubes australes del amanecer del 30 de abril de 1882 y podía compararlas en el recuerdo con las vetas de un libro en pasta española que sólo había mirado una vez y con las líneas de la espuma que un remo levantó en el Río Negro la víspera de la acción del Quebracho.\n [We, at a stroke, perceive three cups lying on a table; Funes would see all the shoots and clusters and fruit comprised by a vine. He knew the shapes of the southern clouds at dawn on April 30, 1882, and could compare them in his memory with the streaks on a book of Spanish cover that he had seen only once and with the swirls on the foam raised by an oar in the Río Negro on the eve of the battle of the Quebracho.]\n  Jorge Luis Borges (1899–1986) has received universal acclaim for the depth with which he approached matters of philosophic and scientific import in his writings. In Borges’s hands, the topic of infinity comes alive either as a point that contains the universe (“The Aleph”), impregnable labyrinths (“The Two Kings and the Two Labyrinths”), a library that is eternally repeated (“The Library of Babel”), stories that subdivide into innumerable possibilities (“The Garden of Forking Paths”), or an imperial map so perfectly detailed that it ends up having the size of the empire itself (“Of Rigor in Science”). In “Funes the Memorious,” a story of barely 12 pages that was eventually published as part of “Ficciones” (1944), Borges again plays with the infinite in a context no less fascinating: the vast labyrinths of memory and the consequences of having an unlimited capacity to remember.\n Funes is first mentioned in an obituary of James Joyce, “A Fragment on Joyce,” published in 1941 in the magazine Sur. There, with some measure of sarcasm, Borges says that to read straight through a “monster” like Joyce’s “Ulysses” — a 400,000-word reconstruction of a single day in Dublin — requires another monster able to remember an infinite number of details. The strange thing about the obituary is that Borges barely refers to Joyce or his work and instead describes Ireneo Funes, the main character of the story he was writing at the time.\n  Entre las obras que no he escrito ni escribiré (pero que de alguna manera me justifican, siquiera misteriosa y rudimental) hay un relato de unas ocho o diez páginas cuyo profuso borrador se titula “Funes el memorioso”. . . . Del compadrito mágico de mi cuento cabe afirmar que es un precursor de los superhombres, un Zaratustra suburbano y parcial; lo indiscutible es que es un monstruo. Lo he recordado porque la consecutiva y recta lectura de las cuatrocientas mil palabras de  Ulises exigiría monstruos análogos.\n [Among the works that I have not written and will never write (but that somehow justify me, in however mysterious and rudimentary a way) there is a short story, some eight to ten pages long, whose copious draft is entitled “Funes the Memorious.” . . . Of the magical  compadrito of my story I can state that he is a precursor to supermen, a suburban, incomplete Zarathustra; what cannot be denied is that he is a monster. I have remembered him because a straight, uninterrupted reading of  Ulysses’s four hundred thousand words would require similar monsters.]\n In the preface to “Artifices,” the second part of “Ficciones,” Borges argues that “Funes the Memorious” is a long metaphor of insomnia. In fact, toward the end of the story he mentions that Funes found sleeping difficult, because to sleep is to get distracted from the world. Borges gives more details on the way he conceived Funes during his own sleepless nights (perhaps during a sticky summer night at the  quinta in Adrogué), in an interview published in the United States:\n When I suffered from insomnia I tried to forget myself, to forget my body, the position of my body, the bed, the furniture, the three gardens of the hotel, the eucalyptus tree, the books on the shelf, all the streets of the village, the station, the farmhouses. And since I couldn’t forget, I kept on being conscious and couldn’t fall asleep. Then I said to myself, let us suppose there was a person who couldn’t forget anything he had perceived, and it’s well known that this happened to James Joyce, who in the course of a single day could have brought out “Ulysses,” a day in which thousands of things happened. I thought of someone who couldn’t forget those events and who in the end dies swept away by his infinite memory. In a word that fragmentary hoodlum is me, or is an image I stole for literary purposes but which corresponds to my own insomnia.\n Already in the literature of the first millennium there are references to people with prodigious memory, particularly in the “ Naturalis historia” (Natural History) of Pliny the Elder, a sort of encyclopedia that in 37 books describes everything from the geography, science, and technology to the agriculture, medicinal herbs, and insects of ancient Rome. In chapter 24 of book VII, on the topic of memory, Pliny mentions king Cyrus of Persia, who knew the names of all his soldiers; Scipio, who knew the names of all in Rome; Cineas, king Pyrrhus’s ambassador, who learned the names of all the Roman senators just one day after arriving in Rome; Mithridates Eupator, who administered justice in the 22 languages spoken in his empire; Simonides, inventor of mnemonics; or Charmadas the Greek, who could recite by heart any book from a library as though he were reading it.\n Pliny considers it a blessing to possess an extraordinary memory. In fact, he starts chapter 24 of book VII saying: “Memoria necessarium maxime vitae bonum cui praecipua fuerit, haut facile dictu est, tam multis eius gloriam adeptis [As to memory, the boon most necessary for life, it is not easy to say who most excelled in it, so many men having gained renown for it].”\n  Pliny also describes the fragility of memory, arguing that it can be lost, in whole or in part, due to illness, injury, and even panic. As an example he tells the story of a man who lost the capacity to name letters after being struck by a stone, and of another who forgot certain people after falling from a roof. He also mentions Messala Corvinus, the orator, who lost recollection of even his own name.\n Borges, it is known, was fascinated by encyclopedias and by the “Naturalis historia” (perhaps the first encyclopedia in history), which in fact he mentions in “Funes the Memorious”: Funes asks the narrator (Borges) for any Latin text, and Borges obliges with volume VII of Pliny’s encyclopedia and Quicherat’s “Thesaurus,” just so the rube will be rudely disappointed upon finding out that one cannot learn such a complicated language using only a book and a dictionary. On their next meeting, however, Funes welcomes Borges by reciting, mockingly, in perfect Latin: “ut nihil non iisdem verbis redderetur auditum” (which, literally translated, means: “Nothing that has been heard can be repeated with the same words”).\n Through Funes, Borges, just like Pliny, enters the realm of memory, though his reaction differs from the Roman’s in a crucial regard: while Pliny considers it a virtue to have a prodigious capacity to remember, Borges looks beyond and argues that an extraordinary memory can become a curse. Says Funes, midway through the story:\n Más recuerdos tengo yo solo que los que habrán tenido todos los hombres desde que el mundo es mundo. . . . Mi memoria, señor, es como un vaciadero de basura.\n [I alone have more memories than all men may have ever had since the world exists. . . . My memory, sir, is like a rubbish heap.]\n Given their historical significance, Pliny’s stories are of undeniable value. It is, nonetheless, impossible to judge their veracity, and in fact the characters described in the “Naturalis historia” seem more legendary than real (perhaps arousing Borges’s curiosity even more). To a large extent this is due to the fact that many of Pliny’s descriptions are based on word-of-mouth information, inevitably altered in the telling. For example, when he describes cases of astonishing eyesight in chapter 21 of book VII, Pliny writes that Homer’s “Iliad” was written in such small script that the complete manuscript could fit in a nutshell; he also mentions a man called Strabo, who could recognize objects 135 miles away and who, during the Punic Wars, could sight and even count the enemy ships docked in Carthage from a promontory in Sicily.\n  The first properly documented case of extraordinary memory is that of Solomon Shereshevskii, studied by the celebrated Russian psychologist Alexander Luria starting in the 1920s. As Luria reports in his book “ The Mind of a Mnemonist: A Little Book about a Vast Memory,” subject S. (as he refers to Shereshevskii to protect his name), unlike everyone else, had to make an effort if he wished to forget something. Shereshevskii possessed a very strong synesthesia — an involuntary link between different senses, like associating numbers with colors — that gave his memories a much richer content and thus made them easier to recollect. These associations, as well as the use of simple mnemonics, allowed Shereshevskii to remember long sequences of numbers and letters many years after first hearing them. After studying Shereshevskii for more than 30 years, Luria confessed his inability to find a limit to S.’s memory, a surprising statement considering that it comes not from an amateur but from one of the foremost psychologists of his time.\n  There are clear parallels between Shereshevskii and Funes, despite the fact that the former trained his memory based on his synesthesia while for the latter to remember everything was completely natural. It is, however, unlikely that Borges knew of Luria’s work, since Luria published his book (in English) only in 1968, more than 25 years after Borges wrote the story of Funes.\n “Funes the Memorious” shows Nietzsche’s influence as well (as Roxana Kreimer describes in an interesting essay); in particular, Borges calls Funes “a precursor to supermen, a suburban, incomplete Zarathustra.” In a brilliant piece on the importance of forgetting, Nietzsche writes:\n Imagine the most extreme example, a human being who does not possess the power to forget, who is damned to see becoming everywhere; such a human being would no longer believe in his own being, would no longer believe in himself, would see everything flow apart in turbulent particles, and would lose himself in this stream of becoming; like the true student of Heraclitus, in the end he would hardly even dare to lift a finger. All action requires forgetting, just as the existence of all organic things requires not only light, but darkness as well.\n Borges’s fascination with the mind (in this philosophical context I again use “mind” rather than “brain,” though I make no distinction between the two) probably came from his father, a lawyer and psychology professor who introduced him to authors such as William James, considered by many to be the father of modern psychology. In “The Principles of Psychology” (1890), one of his foremost works, James says this about memory:\n If we remembered everything, we should on most occasions be as ill off as if we remembered nothing. . . . “The paradoxical result [is] that one condition of remembering is that we should forget. Without totally forgetting a prodigious number of states of consciousness, and momentarily forgetting a large number, we could not remember at all.”\n The relation to Funes, Shereshevskii, and Nietzsche is fascinating. Luria, for example, writes that Shereshevskii “was quite inept at logical organization.” Borges, in turn, says that Funes\n había aprendido sin esfuerzo el inglés, el francés, el portugués, el latín. Sospecho, sin embargo, que no era muy capaz de pensar.\n [had effortlessly learned English, French, Portuguese, Latin. I suspect, however, that he was not very capable of thinking.]\n Again: I do not refer to Joyce, Pliny, Luria, Nietzsche, and James so as to question the originality of Borges’s story. On the contrary, these parallel writings provide a philosophical and scientific foundation on which Borges may have found part of his inspiration. Leaving aside the issue of whether Borges knew of Luria’s studies or not — I believe not — I cannot help noticing the uncanny lucidity with which he treats a topic as complex as memory in the context of a short story.\n Going back to Funes and other people with extraordinary memory, we must mention Borges himself, who could quote whole passages in Spanish, English, German, and Anglo-Saxon, among other tongues. Though it is possible that blindness may have contributed to his incredible memory (not being distracted by visual stimuli, he could focus, like Democritus before him, on his thoughts and the stream of his remembrance), Borges’s youthful realization that he, like his father, would lose his eyesight took him on a monumental quest for knowledge while he could still see. María Kodama [his widow] remembers that, on one of her first encounters with Borges, he asked her to find an excerpt from a book. The fragment, the writer said, was on an odd-numbered page near the middle of the book. Kodama started to read a page at random and Borges, amazingly, guided her to the right page even though he had been blind for many years and — as he jotted on the first page — had read the book in 1916, decades before this encounter with Kodama.\n  Rodrigo Quian Quiroga is Director of the Centre for Systems Neuroscience at the University of Leicester. He is the author of “ Borges and Memory,” “ Principles of Neural Coding,” “ Imaging Brain Function with EEG,” and “ The Forgetting Machine.”", "posttime": "2020-07-16 15:02:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "风云,memorious,记忆", "title": "《追忆风云》等超凡记忆案例(2019)", "title_en": "“Funes the Memorious” and Other Cases of Extraordinary Memory (2019)", "transed": 1, "url": "https://thereader.mitpress.mit.edu/borges-memory-funes-the-memorious/", "via": "", "real_tags": ["风云", "memorious", "记忆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "嗨!。是的，自从我在这里发帖以来已经有一段时间了，是的，我已经有一段时间没有积极地研究FreeBSD的无线堆栈了。生活已经..。嗯，生活。我在2015年开始了ath10k端口。我没想到要花5年时间，但我们到了。自2015年以来，我的生活发生了很大变化，我在2015年做的很多事情都有一段时间没有乐趣了。但是星辰已经排成一条直线，这又是一件有趣的事，所以我就来了。这就是现在的情况。First Up-If_Run。这是Ralink(现在的联发科)11abgn USB驱动程序，用于他们在联发科收购之前生产的产品。一位名叫Ashish Gupta的贡献者出现在efnet的#FreeBSD-wifi IRC频道上，开始致力于11n对if_run的支持，他让它达到了基础工作的程度-我拿着它跑了足够多的时间，获得了20 MHz的11n支持。原来我有几个合适的网卡可以用来测试，嗯，就这样发生了。我非常高兴阿什什来了，让11n在另一个NIC上工作。IF_RUN TODO列表(欢迎任何人参与)：我们需要通过固件接口让11n TX聚合工作-看起来Linux驱动程序拥有我们需要的所有位，而且它不需要Net80211中的重传支持。如果我们正确设置描述符，固件将完成所有操作。\n下一位是Net80211。所以，net80211有基本的11ac位，即使人们认为它不在那里。它还不知道MU-MIMO流，但如果驱动程序和管理域支持它，它将成为基本的11ac AP和STA。\n然而，随着我实现更多的ath10k端口，我发现越来越多真正需要在net80211中的位丢失了。\n硬件在硬件/固件中执行A-MPDU和A-MSDU解封，将单独解密和解封的帧推送到驱动程序。它支持原生WiFi和802.3(以太网)封装，目前我们只支持原生WiFi。(注-Net80211也支持802.3；一旦驱动程序着陆，我将尝试使用它。)。\n我添加了对使用ath10k提供的A-MPDU/A-MSDU帧处理解密卸载的支持(这里根本没有PN/MIC，都是在固件/硬件中完成的！)。这样我们就可以减少交通堵塞。然而，当我最后一次尝试这一点时，接收吞吐量显然很糟糕。我还添加了A-MSDU卸载支持，其中我们不会丢弃具有相同接收802.11序列号的A-MSDU帧。然而.。\n原来，我的Mac在11ac的A-MPDU中做A-MSDU，而net80211接收A-MPDU重新排序正在忠实地丢弃所有具有相同接收802.11序列号的A-MSDU帧。因此，TCP只会看到大量的数据包丢失，并以一种巨大的方式降低吞吐量。实现此功能需要在重新排序队列中缓冲A-MPDU子帧中的所有A-MSDU帧，而不是丢弃它们，然后将它们重新排序，就像它们是单个帧一样。\n因此，我修改了接收重新排序逻辑，以重新排序mbuf的队列，而不是mbuf，并打补丁以允许将多个mbuf排队，只要它们被适当地标记为单个A-MPDU子帧中的A-MSDU。现在接收通信量速率是它应该在的位置(&gt；300mbit UDP/TCP。)。哟。\n我不想在Atheros 11abgn驱动程序中实现完全的U-apsd支持，因为它需要大量的驱动工作才能正确完成，但在net80211中实际的U-apsd协商支持要容易得多。如果NIC支持U-apsd卸载(就像ath10k一样)，那么我只需适当地填充WME QoS字段，并调用驱动程序来通知它们U-apsd的更改。\n目前，Net80211；不支持用于请求明确QoS要求的客户端的Add-TS/Del-TS方法。\n有一组net80211状态仍然是全局的，而不是按VAP的。这在旧世界是有道理的-在驱动程序或Net80211端执行操作的NIC是在软件中驱动的，而不是在固件中驱动的，所以像当前通道&#34；、&#34；短/长前导&#34；等都是全局状态。然而，后来的NIC将各种事情卸载到固件中，现在可以开始做一些有趣的事情，比如扫描的后台频道切换，STA和P2P-AP/P2P-STA之间的后台频道切换。因此，应该针对每个VAP而不是全局保留许多状态，以便为给定的VAP设置正确的标志和IE。\n我已经开始将此状态迁移到每个VAP字段，而不是全局字段，但它显示了第二个缺点-因为它是全局的，我们没有明确跟踪每个通道的这些内容。好的，这需要更多的解释。\n假设您使用的是2 GHz信道，您需要确定是否关心11n、11g或11b客户端。如果您只查看和服务11n客户端，那么您应该使用较短的插槽时间、较短的前同步码，并且不需要RTS/CTS保护来与11n之前的客户端进行互操作。\n11g客户端不需要与11b互操作，只需要11n-因此它不需要RTS/CTS。它仍然可以使用短前导码和短时隙时间。但11n客户端需要互操作，因此它需要将保护模式切换到传统模式-并且它将执行RTS/CTS保护。\n在这一点上，11G保护开始生效；每个人都执行RTS/CTS保护，并且较长的前导/时隙时间开始生效。\n现在-这是VAP的属性，还是通道的属性？从技术上讲，它是频道的财产。如果该通道上的任何VAP看到11b或11g客户端，则所有VAP都需要转换到更新保护模式。\n我将所有这些迁移到每个VAP，但我保留了当前使用它的所有驱动程序的全局状态。ath10k驱动程序现在使用Per-VAP状态进行上述操作，极大地简化了操作(并完成了驱动程序中的TODO项！)\n我收到了来自Bjorn和Geramy的一堆反馈和拉请求，指出了ath10k中的锁顺序/死锁问题。我正在慢慢地处理它们；从Linux到FreeBSD的直接转换显示了我们的锁定以及驱动程序线程运行方式/时间的不同之处。改天我会对此大喊大叫的。\n加密密钥编程是使用固件调用编程的，但net80211目前希望它们同步完成。如果不将net80211的锁更改为全部为SX锁，我们就无法在net80211密钥更新中睡觉(老实说，我认为这是一个糟糕的解决方案，因为它掩盖了诚实地说应该是异步的非异步代码。)。无论如何，它和节点更新都是使用延迟调用完成的-但这需要我获取加密密钥内容的完整副本。事实证明，net80211可以非常快速地回收密钥内容-包括隐藏在ieee80211_节点中的密钥。这修复了密钥重新编程和删除-它有时会向固件发送垃圾。哎呦。\n那么下一步是什么呢？嗯，我想让ath10k车手落地！在我可以这样做之前，在net80211和驱动程序中还有一大堆事情要做。\n是的，我添加了-但仅限于FCC。我没有将它们添加到所有其他监管领域代码中。这是大量的工作，因为这个文件是如何实现的，我喜欢这里的帮助。\n我希望确保我们至少可以支持关联到MU-MIMO AP。我认为ath10k在固件中做到了这一点，但是我们需要支持IE通知。\n现在，net80211将在添加节点或发送密钥更新之后立即传输帧-它假设驱动程序在返回之前已经完成了更新。对于软件驱动的网卡，如11ac之前的Atheros芯片，这是正确的，但对于所有基于USB和更新固件的设备，这肯定不适用。\n特别是对于ath10k，如果您尝试在固件中没有节点的情况下传输帧，整个传输路径就会挂起。哎呦。所以我已经修复了这个问题，所以如果固件不知道节点，但是……我们就不能将帧排队了。\n..。一旦创建了节点，net80211将以主机映射模式发送关联响应。这意味着第一个关联响应不会到达关联客户端。因为net80211还不做这种流量缓冲，所以我将在密钥更新和节点添加/删除期间缓冲帧，以确保不发送或丢弃任何内容。\n有一堆我们不需要或不使用的死代码，以及一些定义Linux mac80211/nl80211位的兼容位，它们应该位于net80211中。我将把这些转换成net80211方法，并从ath10k中删除linux-y位。然后，比约恩制作linuxkpi wifi垫片的工作只需将调用转换成我将添加的net80211API位，而不必在linuxkpi中使用完整的wifi方法。\n。。换工作、改变关系、生孩子、拿到绿卡、买房子、还清旧房东公司的旧债，这些都会给你的生活机器带来麻烦。好的一面是，入侵FreeBSD和WiFi支持再次变得有趣起来，而且我实际上又一次能够彻夜睡眠，所以……。开始了！\n如果你有兴趣帮忙，我一直在更新网上80211/司机的待办事项列表，网址是：https://wiki.freebsd.org/WiFi/TodoStuff。我想要一些帮助，即使是在小事上！", "note_en": "hi!  Yes, it&#39;s been a while since I posted here and yes, it&#39;s been a while since I was actively working on FreeBSD&#39;s wireless stack. Life&#39;s been .. well, life. I started the ath10k port in 2015. I wasn&#39;t expecting it to take 5 years, but here we are. My life has changed quite a lot since 2015 and a lot of the things I was doing in 2015 just stopped being fun for a while.  But the stars have aligned and it&#39;s fun again, so here I am.  Here&#39;s where things are right now.  First up - if_run. This is the Ralink (now mediatek) 11abgn USB driver for stuff that they made before Mediatek acquired them. A contributor named Ashish Gupta showed up on the #freebsd-wifi IRC channel on efnet to start working on 11n support to if_run and he got it to the point where the basics worked - and I took it and ran with it enough to land 20MHz 11n support. It turns out I had a couple of suitable NICs to test with and, well, it just happened. I&#39;m super happy Ashish came along to get 11n working on another NIC.  The if_run TODO list (which anyone is welcome to contribute to):   we need to get 11n TX aggregation working via the firmware interface - it looks like the Linux driver has all the bits we need and it doesn&#39;t need retransmission support in net80211. The firmware will do it all if we set up the descriptors correctly.\n   Next up - net80211. So, net80211 has basic 11ac bits, even if people think it&#39;s not there. It doesn&#39;t know about MU-MIMO streams yet but it&#39;ll be a basic 11ac AP and STA if the driver and regulatory domain supports it.\n  However, as I implement more of the ath10k port, I find more and more missing bits that really need to be in net80211.\n    The hardware does A-MPDU and A-MSDU de-encapsulation in hardware/firmware, pushing up individual decrypted and de-encapsulated frames to the driver. It supports native wifi and 802.3 (ethernet) encapsulation, and right now we only support native wifi. (Note - net80211 supports 802.3 as well; I&#39;ll try to get that going once the driver lands.)\n  I added support to handle decryption offload with the ath10k supplied A-MPDU/A-MSDU frames (where there&#39;s no PN/MIC at all, it&#39;s all done in firmware/hardware!) so we could get SOME traffic. However, receive throughput just plainly sucked when I last poked at this. I also added A-MSDU offload support where we wouldn&#39;t drop the A-MSDU frames with the same receive 802.11 sequence number. However...\n  It turns out that my mac was doing A-MSDU in A-MPDU in 11ac, and the net80211 receive A-MPDU reordering was faithfully dropping all A-MSDU frames with the same receive 802.11 sequence number. So TCP would just see massive packet loss and drop the throughput in a huge way. Implementing this feature requires buffering all A-MSDU frames in an A-MPDU sub-frame in the reordering queue rather than tossing them, and then reordering them as if they were a single frame.\n  So I modified the receive reordering logic to reorder queues of mbufs instead of mbufs, and patched things to allow queuing multiple mbufs as long as they were appropriately stamped as being A-MSDUs in a single A-MPDU subframe .. and now the receive traffic rate is where it should be (&gt; 300mbit UDP/TCP.) Phew.\n    I didn&#39;t want to implement full U-APSD support in the Atheros 11abgn driver because it requires a lot of driver work to get it right, but the actual U-APSD negotiation support in net80211 is significantly easier. If the NIC supports U-APSD offload (like ath10k does) then I just have to populate the WME QoS fields appropriately and call into the driver to notify them about U-APSD changes.\n  Right now net80211 doesn&#39;t support the ADD-TS / DEL-TS methods for clients requesting explicit QoS requirements.\n    There are a bunch of net80211 state which was still global rather than per-VAP. It makes sense in the old world - NICs that do things in the driver or net80211 side are driven in software, not in firmware, so things like &#34;the current channel&#34;, &#34;short/long preamble&#34;, etc are global state. However the later NICs that offload various things into firmware can now begin to do interesting things like background channel switching for scan, background channel switching between STA and P2P-AP / P2P-STA. So a lot of state should be kept per-VAP rather than globally so the &#34;right&#34; flags and IEs are set for a given VAP.\n  I&#39;ve started migrating this state into per-VAP fields rather than global, but it showed a second shortcoming - because it was global, we weren&#39;t explicitly tracking these things per-channel. Ok, this needs a bit more explanation.\n  Say you&#39;re on a 2GHz channel and you need to determine whether you care about 11n, 11g or 11b clients. If you&#39;re only seeing and servicing 11n clients then you should be using the short slot time, short preamble and not require RTS/CTS protection to interoperate with pre-11n clients.\n    The 11g client doesn&#39;t need to interoperate with 11b, only 11n - so it doesn&#39;t need RTS/CTS. It can use short preamble and short slot time still. But the 11n client need to interoperate, so  it needs to switch protection mode into legacy - and it will do RTS/CTS protection.\n   At this point the 11g protection kicks in; everyone does RTS/CTS protection and long preamble/slot time kicks in.\n  Now - is this a property of a VAP, or of a channel? Technically speaking, it&#39;s the property of a channel. If any VAP on that channel sees an 11b or 11g client,  ALL VAPs need to transition to update protection mode.\n  I migrated all of this to be per-VAP, but I kept the global state for literally all the drivers that currently consume it. The ath10k driver now uses the per-VAP state for the above, greatly simplifying things (and finishing TODO items in the driver!)\n         I&#39;ve had a bunch of feedback and pull requests from Bjorn and Geramy pointing out lock ordering / deadlock issues in ath10k. I&#39;m slowly working through them; the straight conversion from Linux to FreeBSD showed the differences in our locking and how/when driver threads run. I will rant about this another day.\n    The encryption key programming is programmed using firmware calls, but net80211 currently expects them to be done synchronously. We can&#39;t sleep in the net80211 crypto key updates without changing net80211&#39;s locks to all be SX locks (and I honestly think that&#39;s a bad solution that papers over non-asynchronous code that honestly should just be made asynchronous.) Anyway, so it and the node updates are done using deferred calls - but this required me to take complete copies of the encryption key contents. It turns out net80211 can pretty quickly recycle the key contents - including the key that is hiding inside the ieee80211_node. This fixed up the key reprogramming and deletion - it was sometimes sending garbage to the firmware. Whoops.\n     So what&#39;s next? Well, I want to land the ath10k driver! There are still a whole bunch of things to do in both net80211 and the driver before I can do this.\n    Yes, I added it - but only for FCC. I didn&#39;t add them for all the other regulatory domain codes. It&#39;s a lot of work because of how this file is implemented and I&#39;d love help here.\n     I&#39;d like to make sure that we can at least support associating to a MU-MIMO AP. I think ath10k does it in firmware but we need to support the IE notifications.\n    Right now net80211 will transmit frames right after adding a node or sending a key update - it assumes the driver is completing it before returning. For software driven NICs like the pre-11ac Atheros chips this holds true, but for everything USB and newer firmware based devices this definitely doesn&#39;t hold.\n For ath10k in particular if you try transmitting a frame without a node in firmware the whole transmit path just hangs. Whoops. So I&#39;ve fixed that so we can&#39;t queue a frame if the firmware doesn&#39;t know about the node but ...\n  ... net80211 will send the association responses in hostap mode once the node is created. This means the first association response doesn&#39;t make it to the associating client. Since net80211 doesn&#39;t yet do this traffic buffering, I&#39;ll do it in ath10k- I&#39;ll buffer frames during a key update and during node addition/deletion to make sure that nothing is sent OR dropped.\n    There&#39;s a bunch of dead code which we don&#39;t need or don&#39;t use; as well as some compatibility bits that define Linux mac80211/nl80211 bits that should live in net80211. I&#39;m going to turn these into net80211 methods and remove the Linux-y bits from ath10k. Bjorn&#39;s work to make linuxkpi wifi shims can then just translate the calls to the net80211 API bits I&#39;ll add, rather than having to roll full wifi methods inside linuxkpi.\n     .. job changes, relationship changes, having kids, getting a green card, buying a house and paying off old debts from your old hosting company can throw a spanner in the life machine. On the plus side, hacking on FreeBSD and wifi support are fun again and I&#39;m actually able to sleep through the night once more, so ... here goes!\n  If you&#39;re interested in helping out, I&#39;ve been updating the net80211/driver TODO list here:  https://wiki.freebsd.org/WiFi/TodoStuff . I&#39;d love some help, even on the small things!", "posttime": "2020-07-16 15:02:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "freebsd,驱动程序", "title": "我又回到了FreeBSD无线堆栈和802.11ac的工作中", "title_en": "I'm back into the grind of FreeBSD's wireless stack and 802.11ac", "transed": 1, "url": "https://adrianchadd.blogspot.com/2020/07/im-back-into-grind-of-freebsds-wireless.html", "via": "", "real_tags": ["freebsd", "驱动程序"]}, {"category": "", "categoryclass": "", "imagename": "b65694dc9fd9e5e95de6557de3059536.jpg", "infoid": 1012232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Monzo最初在2019年推出了Monzo Plus的一个版本，这是一个不同寻常的(也是非常公开的)失误，但五个月后，它可以重新开始，据报道，在这个过程中，Monzo分配了大部分团队成员。Monzo Plus第二版随后被开发出来，据报道，借用英国首相鲍里斯·约翰逊(Boris Johnson)的一句话说，它是“烤箱准备好了”，但在冠状病毒大流行之后，它却被深度冻结。新款Monzo Plus提供了大量的旅行福利，但随着世界大部分地区的旅行限制和封锁政策，产品市场适合性突然变得不理想。\n进入新的Monzo Plus，这是一种与更传统的打包银行账户不同的防大流行偏差。Monzo Plus的第三次尝试更类似于付费软件升级，而不是像许多其他银行和金融技术公司那样，每月花费5 GB，而不是像许多其他银行和金融技术公司那样，捆绑销售一系列原本可能单独向上销售的福利，如旅行或小工具保险或额外的返现和商家折扣。想一想SaaS模式和有线电视模式，在这种模式下，你通常会为一系列频道付费，包括那些你可能从未看过的频道，尽管Monzo并不排除未来推出打包的银行账户产品，可能会按照最初的计划进行。\n用这家挑战者银行自己的话说，从今天开始逐步推出的Monzo Plus新产品，旨在让客户“全面了解财务状况，控制自己的资金”，并包括一系列额外的、有时是超级用户的功能，该行认为一定比例的客户会乐意为这些功能付费。\n其中包括第三方银行账户聚合、虚拟借记卡、自定义交易类别、电子表格导出和信用评分更新。Monzo Plus客户还可以从他们高达2000 GB的余额中赚取利息，还有一些更传统的福利，例如合作伙伴商家的折扣和在国外免收400 GB的提款费用。\nMonzo最近招聘的首席产品官Mike Hudack告诉TechCrunch：“我认为很明显，我们已经尝试了几次，但都没有奏效。”“我认为这有很多原因，但我认为我们作为一个组织需要吸取的最大教训是，我们需要兑现Monzo的承诺，创造出真正经过打磨(和)深思熟虑的东西，这将为客户创造大量价值。这也是人们对我们的期望。“。\n哈达克说，在2月份全职工作并在11个月前为这家新成立的银行提供咨询后，产品团队决定花很多时间试图理解为什么人们一开始就喜欢Monzo。“为什么人们要用我们？他们为什么要参加呢？从研究中可以很清楚地找到答案，我们给人们更多的能见度和对他们的钱的控制权。事情真的就这么简单，“他说。\n在尝试将我框架中的SaaS模式引入个人银行业务时，哈达克表示，很明显，世界上有值得付费的软件，他看不出为什么银行会有不同之处，特别是像Monzo这样既像金融机构一样像软件公司一样运作的银行。\n他辩称：“这款软件有可能真正有意义地改变人们与财务的关系，帮助他们更好地管理自己的资金，并帮助他们，你知道的，存钱买房，存钱付首付，并理解信贷状况良好，可以获得抵押贷款。”“我认为这是一个价值包，非常有说服力，是我们可以在市场上独一无二地提供的那种东西。我认为这是我们要做的一件重要的事。再一次，它在人们已经喜欢我们的东西上加倍下注。“\n“我认为你会发现这件事的其中一件事是它在手中感觉很好。喜欢它的一切，它的互动，你感觉它的方式。对于人们来说，这是一个完美的提议，我认为我们过去可以做得更好，如果你允许我这么说的话。“", "note_en": "In an uncharacteristic ( and very public) misstep, Monzo originally launched a version of Monzo Plus in 2019, only to can it five months later and go back to the drawing board, reportedly dispensing much of the team in the process. Monzo Plus version two was then developed and reportedly “oven ready,” to borrow a phrase from British Prime Minister Boris Johnson, only for it to be placed in the deep freeze after the coronavirus pandemic took hold. The new Monzo Plus was heavy on travel perks, but with travel restrictions and lockdown policies in much of the world, product-market fit was abruptly left wanting.\n Enter the  new new Monzo Plus, a  pandemic-proof deviation from the more traditional packaged bank account. Costing £5 per month, rather than bundle a host of perks that might otherwise be up-sold individually, such as travel or gadget insurance or additional cash-back and merchant discounts, as many other banks and fintechs do, this third Monzo Plus attempt is more akin to a paid-for software upgrade. Think a SaaS model versus cable TV where you typically pay for a bunch of channels, including ones you probably never watch, although Monzo isn’t ruling out a packaged bank account product in the future, perhaps along the lines of the one it originally had planned.\n  In the challenger bank’s own words, the new Monzo Plus offering being rolled out gradually from today is designed to give customers “full financial visibility and control over their money” and includes a host of additional and sometimes power-user features that it thinks a proportion of customers will be happy to pay for.\n These include third-party bank account aggregation, virtual debit cards, custom transaction categories, spreadsheet export and credit score updates. Monzo Plus customers can also earn interest on their balances of up to £2,000, and there are a number of more traditional perks, such as discounts at partner merchants and £400 of fee-free withdrawals abroad.\n “I think it’s very obvious that we’ve tried this a few times and it hasn’t worked out,” Mike Hudack, Monzo’s  recently recruited chief product officer, tells TechCrunch. “I think there are a lot of reasons for that, but I think the biggest lesson for us as an organisation to take away is that we need to fulfill Monzo’s promise of creating something really polished [and] well thought through, which creates a lot of value for customers. And that’s what people expect from us.”\n After being brought on full-time in February and consulting for the upstart bank 11 months prior, Hudack says the product team decided to spend a lot of time trying to understand why people love Monzo in the first place. “Why do people use us? Why do they participate? And the answer is very clear from [the] research, we give people more visibility and control over their money. It’s really that simple,” he says.\n On trying to bring what I frame as a SaaS model to consumer banking, Hudack says it’s clear that there is software in the world that is worth paying for and he doesn’t see any reason why that should be different for a bank, especially one like Monzo that acts like a software company as much as it does a financial institution.\n “This software has the potential to really meaningfully change people’s relationship with their finances and help them manage their money better, and help them, you know, save towards a house and and save towards the downpayment and understand that the credit is in good shape to get that mortgage,” he argues. “And I think that is a package of value, which is super compelling and the sort of thing that we can provide fairly uniquely in the market. I think that’s an important thing for us to do. And again, it doubles down on something that people already love us for.”\n The  new new Monzo Plus, in its chief product officer’s own (on the record) words\n  “The first thing we’re doing is we’re giving people tons of visibility over their other bank accounts within Monzo. If you think about the thing that people say about us, giving people ‘visibility and control over their money,’ we think that in order to do that, we have to bring all your accounts in, you have to be able to see everything in the app.\n “I’ve had this set up in the app for a long time. I think it changes your relationship with Monzo; it becomes more of a financial hub. And it gets further to fulfilling our mission. And it’s incredibly easy to set up, you just go, you tap a few times, you fast switch between apps and then you’ve got it. And this, again, is building on part of our redesign in terms of being able to swipe back and forth between accounts very easily.”\n  “The next thing we’re doing in order to give people more control is we’re giving them disposable card numbers. So the ability to just go in to Uber, to Netflix, and use a different physical card. If you’re transacting somewhere else where you think you might have to delete the card number later, I think that’s a very powerful thing, but also if you lose your physical card, all your subscriptions, keep working forever.”\n  “Customers have been asking for custom categories, [and] for more powerful budgeting features. Custom categories give the ability to split individual transactions across multiple categories. And then there are people who really want to go to town with budgeting. This is something that I used to do, that I no longer have enough time for. But I used to export everything, put it in Google Sheets, build charts and graphs and sit down with my wife and drive her crazy with our monthly burn rate and what we’re doing and that we’re spending, you know, an absolutely absurd amount of money on Ubers every month. And there’s a set of people who love this, who really want this and who find value in the budgeting features that we offer in the app, but really want to geek out on this. And for them, we’re now doing auto exporting to Google Sheets. In real time, you can go in and you can do whatever you want there.\n “And I think this, combined with connected accounts, combined with custom categories, the ability to split transactions across multiple categories, and the ability to keep your subscriptions going or turn off a subscription at any point, together gives people a huge amount of additional control over their money.”\n   “The other part of this, which I think is incredibly important, is we have this really iconic hot coral card. And, you know, I think it’s a big part of our growth story. And, you know, to a certain degree, Monzo is fashion, you go to a pub, you pull out your credit card, you tap it and people know that you’re part of the tribe. And so it was an incredibly huge challenge for us to figure out how to build on that [and] give people a premium card that lives up to that promise of hot coral. And we spent so much time on this, we went to so many card manufacturers, created a huge number of different prototypes and samples, the amount of time that we’ve spent passing different versions back and forth. And the thing that has come out of that, I think is absolutely beautiful. As beautiful and more beautiful than the coral card. I’ve had in my wallet now for weeks, and it’s just, it’s beautiful. Like it glints in the sunlight, you kind of move it around, and it’s holographic. And you see it kind of three dimensions, the light just shimmering off of it. And it has taken first position in my wallet. You pull it out and go to a restaurant and people just comment on it. And I think that that’s going to be a huge thing for people as well.”\n  “I think that if you put all this together, you’ve got a really beautiful picture, but we’re also offering people interest on their balance, incredibly competitive interest at this point. We’re adding to the full picture of your finances by adding regular credit tracking. And then we’re helping people save on a regular basis more powerfully by doing advanced roundup, supercharging the roundups and then additional fee-free cash abroad on cash deposits and offers.\n “I think that one of the things that you’ll find about this is it feels good in the hand. Like everything about it, the interactions, the way that you feel it. It’s a polished, complete proposition for people in a way that I think that we could have done better in the past, if you’ll allow me to say that.”", "posttime": "2020-07-16 14:40:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,monzo", "title": "\nMonzo推出新的Monzo Plus，提供希望用户愿意付费的软件功能", "title_en": "\n\t\t\t\tMonzo launches new Monzo Plus with software features it hopes users will want to pay for\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/15/monzo-plus/", "via": "", "real_tags": ["软件", "monzo"]}, {"category": "", "categoryclass": "", "imagename": "e7117e2db671fcdebcea09e106639103.png", "infoid": 1012230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我很高兴宣布SWIFT服务器生态系统的一个新开源项目-SWIFT服务生命周期。服务生命周期是一个SWIFT软件包，旨在帮助服务器应用程序(也称为服务)管理其启动和关闭顺序。\n大多数服务都有启动和关闭工作流逻辑，这一逻辑通常对故障很敏感，很难正确处理。启动序列包括初始化线程池、运行数据迁移、预热缓存和其他形式的状态初始化等操作，然后再接收流量或接受事件。关闭顺序包括释放占用文件描述符的资源或其他系统资源，如果清除不正确，这些资源可能会泄漏。\n今天，服务器应用程序和框架必须自己找到解决需求的方法，这很容易出错。为了使事情更安全、更容易，服务生命周期以一种安全、可重用和与框架无关的方式对这一常见需求进行了编码。它可以与任何服务器框架集成，也可以直接集成在服务器应用程序的Main中。\n推荐的使用该库的方式是在服务器应用程序的Main中创建一个ServiceLifeccle实例，并向其注册LifecycleTasks。在调用Start函数时，ServiceLifeccle将按照这些任务的注册顺序启动它们。\n缺省情况下，ServiceLifeccle还注册一个捕获int和term的信号处理程序，这两个信号是现代部署平台中用来传递关闭请求的典型信号。一旦捕获到信号，关闭序列就开始了，LifecycleTasks会以与注册顺序相反的顺序关闭。\n//导入包。导入生命周期//初始化`Lifecycle`容器。var lifecycle=ServiceLifecycle()//注册应用程序退出时应该关闭的资源。/本例中，我们注册了一个SwiftNIO`EventLoopGroup`//，并传递了关机时调用的`syncShutdownGracfully`函数。设eventLoopGroup=MultiThreadedEventLoopGroup(number OfThread：System.。coreCount)生命周期。registerShutdown(名称：&#34；eventLoopGroup&#34；，。同步(eventLoopGroup。syncShutdownGracally)//注册应用程序启动时应启动//和应用程序退出时应关闭的另一个资源。/在本例中，我们注册了一个人为的`DatabaseMigrator`//，并传递了启动时调用的`Migrate`函数//和关机时调用的`shutdown`函数。让Migrator=DatabaseMigrator(eventLoopGroup：eventLoopGroup)生命周期。注册(名称：&#34；Migrator&#34；，启动：。异步(迁移程序。迁移)、关闭：。异步(迁移程序。关机))//启动应用程序。/使用`register`函数传入的启动处理程序//将按照注册顺序调用。生命周期。start(){错误在//启动完成处理程序中//如果发生启动错误，如果let error=error{logger.。错误(&#34；启动\\(自身)☠️：\\(错误)&#34；)}其他{记录器。信息(&#34；\\(SELF)已成功启动🚀&#34；)}}//等待应用程序退出/这是一个阻塞操作，通常会等待`Signal`。//`Signal`可以在`lifecycle.init`处配置，默认为`INT`和`TERM`。//使用`register`或`registerShutdown`函数传入的关机处理程序//将按照与注册顺序相反的顺序调用。生命周期。等待()。\n源代码是可用的，我们鼓励来自开源社区的贡献。如果您有反馈、问题或想要讨论该项目，请随时在SWIFT论坛上聊天。如果您想报告错误，请使用GitHub问题跟踪器。我们期待着与您合作，并帮助推动行业迈向更好、更安全的编程未来。", "note_en": "It is my pleasure to announce a new open source project for the Swift server ecosystem,  Swift Service Lifecycle. Service Lifecycle is a Swift package designed to help server applications, also known as services, manage their startup and shutdown sequences.\n  Most services have startup and shutdown workflow-logic which is often sensitive to failure and hard to get right. Startup sequences include actions like initializing thread pools, running data migrations, warming up caches, and other forms of state initialization before taking traffic or accepting events. Shutdown sequences include freeing up resources that hold on to file descriptors or other system resources that may leak if not cleared correctly.\n Today, server applications and frameworks must find ways to address the need on their own, which could be error prone. To make things safer and easier, Service Lifecycle codifies this common need in a safe, reusable and framework-agnostic way. It is designed to be integrated with any server framework or directly in a server application’s  main.\n  The recommended way of using this library is creating a  ServiceLifecycle instance in your server application’s  main, and register  LifecycleTasks with it. Upon calling the  start function,  ServiceLifecycle will start these tasks in the order they were registered.\n By default,  ServiceLifecycle also registers a  Signal handler that traps  INT and  TERM , which are typical  Signals used in modern deployment platforms to communicate shutdown request. The shutdown sequence begins once the  Signal is captured, and the  LifecycleTasks are shut down in the reverse order they have been registered in.\n  // Import the package. import  Lifecycle // Initialize the `Lifecycle` container. var  lifecycle  =  ServiceLifecycle () // Register a resource that should be shut down when the application exits. // // In this case, we are registering a SwiftNIO `EventLoopGroup` // and passing its `syncShutdownGracefully` function to be called on shutdown. let  eventLoopGroup  =  MultiThreadedEventLoopGroup ( numberOfThreads :  System . coreCount ) lifecycle . registerShutdown (  name :  &#34;eventLoopGroup&#34; ,  . sync ( eventLoopGroup . syncShutdownGracefully ) ) // Register another resource that should be started when the application starts // and shut down when the application exits. // // In this case, we are registering a contrived `DatabaseMigrator` // and passing its `migrate` function to be called on startup // and `shutdown` function to be called on shutdown. let  migrator  =  DatabaseMigrator ( eventLoopGroup :  eventLoopGroup ) lifecycle . register (  name :  &#34;migrator&#34; ,  start :  . async ( migrator . migrate ),  shutdown :  . async ( migrator . shutdown ) ) // Start the application. // // Start handlers passed using the `register` function // will be called in the order they were registered in. lifecycle . start ()  {  error  in  // start completion handler  // if an startup error occurred you can capture it here  if  let  error  =  error  {  logger . error ( &#34;failed starting  \\( self )  ☠️:  \\( error ) &#34; )  }  else  {  logger . info ( &#34; \\( self )  started successfully 🚀&#34; )  } } // Wait for the application to exit // // This is a blocking operation that typically waits for a `Signal`. // The `Signal` can be configured at `lifecycle.init`, and defaults to `INT` and `TERM`. // Shutdown handlers passed using the `register` or `registerShutdown` functions // will be called in the reverse order they were registered in. lifecycle . wait ()\n   The  source is available, and we encourage contributions from the open source community. If you have feedback, questions or would like to discuss the project, please feel free to chat on the  Swift forums. If you would like to report bugs, please use  the GitHub issue tracker. We look forward to working with you, and helping move the industry forward to a better, safer programming future.", "posttime": "2020-07-16 14:39:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "swift,service,启动", "title": "Swift.org-SWIFT服务生命周期简介", "title_en": "Swift.org – Introducing Swift Service Lifecycle", "transed": 1, "url": "https://swift.org/blog/swift-service-lifecycle/", "via": "", "real_tags": ["swift", "service", "启动"]}, {"category": "", "categoryclass": "", "imagename": "a237f593fe6ab2634bbe4b1aeeea5424.jpg", "infoid": 1012229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "到2020年7月15日乔恩·勒萨奇(Jon LeSage)，下午1：00的CDT核能对通过核聚变重新成为公用事业部门的强大竞争对手寄予厚望，但在获得监管部门批准之前，它一直需要大量投资和几年的开发。高密度等离子体聚焦(DPF)可以更快地打开核聚变被采用的大门，而且在经济上是可行的。\n总部位于新泽西州米德尔塞克斯的劳伦斯维尔等离子体物理公司，简称LPPFusion，可能很快就会在通过DPF过渡到核聚变方面走在前列。\n到目前为止，利用超高功率激光和微波发生器、粒子束、巨型超导磁体系统和其他先进技术的昂贵的大型实验设备已经成为核聚变项目的标准。但它是相当昂贵的，而且在测试和开发过程中有几年的时间。其中最大的聚变项目之一是法国南部正在建设的巨型国际环型实验反应堆(ITER)。它现在的估计成本超过400亿美元。\nDPF正在为一个精简、低成本的聚变未来打开大门，并再次为核能作为一种智能能源获得更多支持。这发生在当前的技术--核裂变--失去支持数年之后。\n在物理学家埃里克·勒纳(Eric Lerner)的领导下，LPPFusion团队在2016年取得了里程碑式的成功，其设备达到了28亿摄氏度的离子温度，这是迄今为止所有实验中达到的最高温度。勒纳被认为是在核聚变中使用等离子体的全球领先专家之一。结果表明，这比太阳中心的温度高出200多倍，是法国ITER预计最高温度的15倍以上。\nLPPFusion提高了标准，即将创造足以实现净能源发电的条件--即总发电量减去发电站辅助服务的消耗。到目前为止，这是在实验室投资的700万美元的小预算下完成的，并得到了几个专注的合作者的支持。勒纳和他的团队说，他们已经提高了DPF技术的性能，并接近为净能源发电创造足够的条件-这是获得该技术支持的另一个有说服力的论点。\n它的发电机使用的是氢-硼，而不是标准的氘-氚燃料。氢-硼不会产生任何放射性废物，可以利用无限的燃料供应。它还提供了将聚变能直接转化为电能的可能性。\n虽然2011年日本福岛第一核电站灾难后，核电失去了支持，但作为利用核电的解决方案，核聚变获得了越来越多的支持，目前正在提出的一个论点是，核电站的运行能力远远高于可再生能源、能源或煤炭和天然气等化石燃料。倡导者提出的另一个观点是，核聚变提供了一致、稳定的能源-而不是面临间歇性天气条件的风能和太阳能。\n核聚变有令人印象深刻的倡导者，如微软创始人比尔·盖茨和挪威石油和天然气公司Equinor。但总体而言，包括风能、水能和太阳能在内的可再生能源是核能的主要竞争对手。\n美国能源情报署(U.S.Energy Information Administration)报告称，2019年，核能占美国电力的20%；其次是可再生能源，占17%。天然气以38%的比例领先，煤炭以23%的比例紧随其后。\n与使用激光和微波的更昂贵的聚变发电机相比，发电厂的建设可能是DPF的另一个竞争优势。它的氢-硼聚变发电厂将提供小机组规模、低投资成本、低燃料成本和高水平的安全。据估计，与现有的传统和替代能源技术相比，DPF技术可以将发电成本降低10倍或更多。\n自20世纪60年代以来，DPF技术以各种形式存在。它已经被世界各地的几个大学和政府实验室用于等离子体物理领域的研究。它也被用作X射线和中子的来源。\n倡导者希望DPF将成为核聚变的桥梁，以达到政府法规和财政支持者推动发展所需的支持水平-并成为领先的替代能源发电厂来源。", "note_en": "By  Jon LeSage - Jul 15, 2020, 1:00 PM CDT     Nuclear power has high hopes of coming back as a serious competitor in the utility sector through nuclear fusion, but it’s been requiring massive investments and several more years of development before it wins regulatory approval. Dense plasma focus (DPF)  could open the door to fusion being adopted much faster and for being economically feasible.\n Middlesex, NJ-based Lawrenceville Plasma Physics, Inc., known as LPPFusion, may soon be leading the way in transitioning over to nuclear fusion through DPF.\n So far, expensive, large-scale experimental facilities utilizing ultra-high power lasers and microwave generators, particle beams, giant superconducting magnet systems and other advanced technologies, has been the norm for nuclear fusion projects. But it&#39;s quite costly and has several years built into the testing and development process. One of the largest of these fusion projects has been the giant International Torus Experimental Reactor (ITER) under construction in southern France. It now has an estimated cost of over $40 billion.\n DPF is opening the door to a streamlined, low-cost fusion future — and for gaining more support once again for nuclear as a smart power source to tap into. That comes years after the current technology, nuclear fission, lost support.\n Headed by physicist Eric Lerner, who’s considered one of the leading global experts on plasma use in nuclear fusion, the LPPFusion team achieved landmark success in 2016 when its device reached an ion temperature of 2.8 billion degrees, by far the highest temperature achieved on any experiment so far. That came out to be over 200 times hotter than the center of the sun and more than 15 times the projected maximum temperature for the ITER in France.\n  LPPFusion has raised the bar and is coming close to creating conditions sufficient to achieve net energy generation — which levels out gross electricity generation minus the consumption of power stations&#39; auxiliary services. So far, that’s been done on a small budget of $7 million that the lab has invested, with the support of a few dedicated collaborators. Lerner and team say they’ve raised the performance of its DPF technology, and are close to creating conditions sufficient for net energy generation — another persuasive argument in gaining support for the technology.\n Its power generator is tapping into hydrogen-boron instead of the standard deuterium-tritium fuel. Hydrogen-boron doesn’t generate any radioactive waste, and taps into an unlimited supply of fuel. It also offers the possibility of direct conversion of fusion energy into electricity.\n While nuclear power lost support after Japan’s Fukushima Daiichi nuclear disaster in 2011, nuclear fusion has been gaining support as the solution for tapping into the power.  One argument being made is that nuclear power plants operate at much higher capacity than renewable energy sources or fossil fuels such as coal and natural gas. Another point made by advocates is that nuclear fusion offers a consistent, steady energy source — versus wind and solar facing intermittent weather conditions.\n Nuclear fusion has impressive advocates such as  Microsoft founder Bill Gates and Norwegian oil and gas company Equinor. But overall, renewable energy sources including wind, hydro, and solar, is the main competitor to nuclear.\n The U.S. Energy Information Administration reported that in 2019, nuclear made up 20 percent of electricity in America; followed by renewables at 17 percent. Natural gas leads the way at 38 percent, followed by coal at 23 percent.\n  Construction of the power plants could be another competitive advantage of DPF over more costly fusion power generators using lasers and microwave. Its hydrogen-boron fusion power plants would offer a small unit size, low investment cost, low fuel cost, and a high level of safety. Estimates predict that the DPF technology could reduce the cost of producing electricity by 10 times or more compared to existing conventional and alternative energy technology.\n DPF technology has existed in various forms since the 1960s. It’s been utilized in several university and government laboratories around the world for research in the field of plasma physics. It’s also being used as a source of X-rays and neutrons.\n Advocates hope that DPF will become the bridge for nuclear fusion to reach the level of support needed to advance from government regulations and financial backers — and become the leading alternative energy power plant source.", "posttime": "2020-07-16 14:39:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "核聚变,lab", "title": "小型实验室在核聚变技术上取得重大突破", "title_en": "Small Lab Makes Big Breakthrough in Nuclear Fusion Tech", "transed": 1, "url": "https://oilprice.com/Alternative-Energy/Nuclear-Power/Small-Lab-Makes-Big-Breakthrough-In-Nuclear-Fusion-Tech.html", "via": "", "real_tags": ["核聚变", "lab"]}, {"category": "", "categoryclass": "", "imagename": "b5e25f8da70391bb062d6facc4be277b.jpg", "infoid": 1012226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter的内部系统失控于劫持了近12个高调账户的攻击者手中，这一入侵事件引发了人们对这个影响力越来越大的平台安全的严重担忧。\n最初的妥协迹象出现在加州时间下午1点左右，当时被劫持的账户-属于副总统乔·拜登(Joe Biden)、埃隆·马斯克(Elon Musk)、比尔·盖茨(Bill Gates)和其他拥有数百万或数千万粉丝的人-开始发出大量信息，试图诈骗人们将加密货币转移到攻击者控制的钱包。\n在大规模收购狂潮开始约七个小时后发布的一条推文中，Twitter官员表示，攻击者似乎通过欺骗或以其他方式说服员工交出凭据来控制局面。\n这条推文说：“我们检测到了我们认为是由一些人发起的协同社会工程攻击，这些人成功地将我们的一些员工作为目标，可以访问内部系统和工具。”“我们知道，他们利用这一访问权限，代表他们控制了许多高度可见(包括经过验证)的账户和推特。我们正在调查他们可能进行了哪些其他恶意活动，或者他们可能获取了哪些信息，我们将在这里分享更多信息。“。\n我们知道他们使用这个访问权限来代表他们控制许多高度可见(包括经过验证)的帐户和推文。我们正在调查他们可能进行了哪些其他恶意活动，或者他们可能获取了哪些信息，我们将在这里分享更多信息。\n一旦Twitter得知收购消息，公司人员就封锁了这些账户，并删除了这些推文。推特的推文没有解释为什么马斯克的账户在之前的推文被删除后发布了欺诈性的推文。\n这一妥协引发了严重的国家安全担忧，因为它有可能播下恐慌和混乱的种子。在几乎控制了Twitter账户的情况下，袭击者可能劫持了属于特朗普总统或政府机构的人，所做的事情比重演已经持续多年的加密货币骗局糟糕得多。推特最终遏制了大规模的妥协，但只是在社交媒体网站几个小时内源源不断地涌出大量诈骗信息之后。\n主板发布的一篇文章援引未透露姓名的黑客的话并证实了屏幕截图，称攻击者通过向Twitter内部人士支付费用获得了访问权限。这篇帖子接着显示了一个控制Binance账户的小组，Binance是一家加密货币交易所，其Twitter人物被劫持。\n其他广为流传的截图显示了据称是Twitter管理工具的截图。虽然截图尚未得到证实，但Twitter多次删除其中两张截图，并终止了最初发布截图的人的账户。黑客和安全人员表示，他们认为这是可信的。下面显示两个初始屏幕截图：\n除了名人、商界领袖、政界人士的Twitter账户外，阿德里安·拉莫(Adrian Lamo)的Twitter账户周三也在类似情况下遭到入侵。拉莫是一名黑客，以高调的攻击行为和告发切尔西·曼宁(Chelsea Manning)而闻名，于2018年去世。\n同为黑客的朋友Lucky225在拉莫去世后(在他父亲的祝福下)一直控制着这个账户。他说，Twitter在加州时间上午11点23分向他发送了账户的密码重置确认码，大约在第一个公开的入侵迹象出现前90分钟。尽管没有输入密码，Lucky225(他说是他的本名)还是收到了一封电子邮件，通知他有一台新设备第一次登录到了LAMO账户。\n幸运的是，Lucky225表示，他能够重新控制该账户，因为虽然黑客更改了与该账户相关的电子邮件地址，但他们未能更改电话号码。Lucky225说，他使用这个电话号码重新获得了控制权。然后，一个奇怪的、目前无法解释的转折是，拉莫的朋友说，晚上8：30，他发现账户再次被劫持-或者至少是部分被劫持-当时Twitter再次给他发电子邮件，说双因素身份验证刚刚被关闭。\n“奇怪的是……。Lucky225在一条短信中告诉我，“Lucky225在一条短信中告诉我，它丢弃了一些单词，并缩写了一些单词。”今天，当我恢复账户时，密码是在PW Manager中随机生成的。“但当我使用它登录时，它显示帐户已锁定。然后想让我更改密码才能继续，但我实际上不让我这么做，因为电子邮件显然已经更改了。“。\n他说，Twitter可能是第二次收购的幕后黑手，因为公司员工错误地认为账户仍然被攻破。另一种可能性是，黑客不知何故利用几个第三方应用程序中的漏洞，通过OAuth协议，获得了访问Lamo账户的权限，从而设法强行进入。\nLucky225说，他怀疑攻击者攻击Lamo的账号是因为它的账号@6，这个账号只有一个字符，是许多黑客梦寐以求的。他不确定是否同样的黑客对LAMO和名人账户的劫持负责，但他表示，两次绕过2FA和密码控制的能力表明，LAMO账户被接管的幕后黑手控制着内部Twitter系统。\nTwitter的一位女发言人表示，除了推文中的信息外，公司没有什么可补充的。\nTwitter账户持有者应该遵循通常的安全指南来锁定账户。该建议包括使用强密码(账户独有，使用骰子字或字母、数字和特殊字符随机生成)，2FA，并启用Twitter的密码重置保护，该保护要求用户在更改密码短语之前提供附加信息。鉴于这些措施在周三被绕过，它们可能还不够。", "note_en": "Twitter lost control of its internal systems to attackers who  hijacked almost a dozen high-profile accounts, in a breach that raises serious concerns about the security of a platform that’s growing increasingly influential.\n The first signs of compromise occurred around 1 PM California time when hijacked accounts—belonging to Vice President Joe Biden, Elon Musk, Bill Gates, and other people with millions or tens of millions of followers—started pumping out messages that tried to scam people into transferring cryptocurrency to attacker-controlled wallets.\n In a  tweet issued about seven hours after the mass takeover spree began, Twitter officials said the attackers appeared to take control by tricking or otherwise convincing employees to hand over credentials.\n “We detected what we believe to be a coordinated social engineering attack by people who successfully targeted some of our employees with access to internal systems and tools,” the tweet said. “We know they used this access to take control of many highly-visible (including verified) accounts and Tweet on their behalf. We’re looking into what other malicious activity they may have conducted or information they may have accessed and will share more here as we have it.”\n We know they used this access to take control of many highly-visible (including verified) accounts and Tweet on their behalf. We’re looking into what other malicious activity they may have conducted or information they may have accessed and will share more here as we have it.\n Once Twitter learned of the takeovers, company personnel locked down the accounts and removed the tweets. Twitter’s tweet thread didn’t explain why Musk’s account posted fraudulent tweets after previous ones had been deleted.\n The compromise raises serious national security concerns because of the potential it had to sow panic and chaos. With control of virtually Twitter account, the attackers could have hijacked those belonging to President Trump or government agencies and done much worse than replay a cryptocurrency scam that has been going on for years. Twitter eventually contained the mass compromise but only after a flood of scam messages steadily flowed out of the social media site over several hours.\n An  article posted by Motherboard, citing unnamed hackers and corroborating screenshots, said the attackers gained access by paying a Twitter insider. The post went on to show a panel controlling the account of Binance, a cryptocurrency exchange whose Twitter personna was hijacked.\n Other screenshots that circulated widely showed what purportedly were screenshots of Twitter administrative tools. While the screenshots haven’t been confirmed, Twitter repeatedly took two of them down and terminated the account of a person who initially posted them. Hackers and security people said they considered them plausible. The two initial screenshots appear below:\n    Besides those of celebrities, business leaders, politicians, the Twitter account of  Adrian Lamo—a hacker known for high-profile exploits and for turning in Chelsea Manning and who  died in 2018—was also compromised on Wednesday under similar circumstances.\n Fellow hacker and friend Lucky225, who has had control of the account since Lamo’s death (with the blessing of his father), said Twitter sent him both a password reset confirmation code for the account at 11:23 AM California time, about 90 minutes before the first public signs of a breach. Despite not entering the code, Lucky225 (his legal name, he says) then received an email notifying him a new device had logged into the Lamo account for the first time.\n  In stroke of luck, Lucky225 said he was able to regain control of the account because while the hackers had changed the email address associated with the account, they failed to change the phone number. Lucky225 said he used the phone number to regain control. Then, in a strange and currently unexplained twist, Lamo’s friend said that at 8:30 PM he discovered the account had again been hijacked—or at least partially so—when Twitter emailed him again to say two-factor authentication had just been turned off.\n  “What&#39;s weird.. the password (which was just randomly generated in PW manager today when I recovered the account earlier) still works,” Lucky225 told me in a text message that dropped and abbreviated some words. “But when I use it to login it says account&#39;s locked. And then wants me to change my pw to continue but won&#39;t actually let me do that since email was apparently changed.”\n He said it’s possible that Twitter is behind the second takeover because company employees mistakenly believed the account was still compromised. Another possibility is that hackers somehow managed to force their way back in by exploiting a vulnerability in several third-party apps that, through the OAuth protocol, had permission to access the Lamo account.\n Lucky225 said he suspects attackers targeted Lamo’s account for its handle—@6—which at a single character, is highly coveted by many hackers. He’s not sure if the same hackers were responsible for the hijackings of both the Lamo and celebrity accounts, but he said the ability to twice bypass 2FA and password controls suggests whoever is behind the Lamo account takeover had control of internal Twitter systems.\n A Twitter spokeswoman said the company had nothing to add beyond the information in the tweet thread.\n Twitter account holders should follow the usual security guidance to lock down accounts. The advice includes using a strong password (unique to the account, randomly generated using either  dice words or letters, numbers, and special characters), 2FA, and to turn on Twitter&#39;s password reset protection, which requires users to provide additional information before a passphrase can be changed. Given that those measures were bypassed on Wednesday, they may not be enough.", "posttime": "2020-07-16 13:54:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,比特币,控制权,lost,账户", "title": "Twitter内部系统的控制权被诈骗比特币的黑客夺走", "title_en": "Twitter lost control of its internal systems to Bitcoin-scamming hackers", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/07/twitter-lost-control-of-its-internal-systems-to-bitcoin-scamming-hackers/", "via": "", "real_tags": ["黑客", "比特币", "控制权", "lost", "账户"]}]