[{"category": "", "categoryclass": "", "imagename": "637b8b8da3ded855095d9074db77cd18.jpg", "infoid": 1009338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特别报道麻省理工学院已经将其被高度引用的数据集下线，该数据集训练人工智能系统潜在地使用种族主义、厌女症和其他有问题的术语来描述人。\n本周，在《登记册》向美国超级学院发出警告后，该数据库被删除。麻省理工学院还敦促研究人员和开发人员停止使用训练库，并删除任何副本。我们真诚地道歉，一位教授告诉我们。\n由该大学建造的训练集已被用于教授机器学习模型，以自动识别和列出静止图像中描述的人和对象。例如，如果您向其中一个系统显示公园的照片，它可能会告诉您快照中显示的儿童、成人、宠物、野餐范围、草地和树木。然而，由于麻省理工学院在组装训练集时漫不经心的做法，这些系统也可能会将女性贴上妓女或婊子的标签，并用贬义性的语言将黑人和亚洲人贴上标签。该数据库还包含标有C字的女性生殖器的特写照片。\n因此，应用程序、网站和其他依赖于使用麻省理工学院数据集训练的神经网络的产品可能最终会在分析照片和相机镜头时使用这些术语。\n有问题的培训库是8000万个微小图像，它创建于2008年，目的是帮助生产先进的物体检测技术。本质上，它是一个巨大的照片集合，上面的标签描述了照片中的内容，所有这些都可以输入神经网络，教他们将照片中的模式与描述性标签联系起来。因此，当训练好的神经网络显示一辆自行车时，它可以准确地预测快照中是否存在一辆自行车。它之所以被称为“小图像”，是因为图书馆里的图片足够小，足以让2000年代末和2010年代初的计算机视觉算法消化。\n今天，微型图像数据集与更知名的ImageNet训练集一起用于对计算机视觉算法进行基准测试。然而，与ImageNet不同的是，到目前为止，还没有人仔细检查过微型图像是否有问题的内容。\n硅谷隐私初创公司UnifyID的首席科学家维奈·普拉布(Vinay Prabhu)和爱尔兰都柏林大学学院(University College Dublin)的博士生阿贝巴·比尔哈尼(Abeba Birhane)仔细研究了麻省理工学院的数据库，发现了数千张贴着针对黑人和亚洲人的种族主义诽谤的图片，以及用来描述女性的贬义性词汇。他们在提交给定于明年举行的计算机视觉会议的一篇论文[印刷前的PDF]中透露了他们的发现。\n该数据集保存了超过7930万张图片，这些图片是从谷歌图片中抓取的，排列在7.5万多个类别中。一个较小的版本，有220万张图片，可以从麻省理工学院计算机科学和人工智能实验室(CSAIL)的网站上搜索和在线阅读。周一，在El Reg提醒数据集的创建者注意Prabhu和Birhane的工作后，这种可视化以及完整的可下载数据库被从CSAIL网站上删除。\n关键问题是，例如，数据集包括标有N字的黑人和猴子的照片；穿比基尼或抱着孩子的女人标有妓女的照片；解剖学的一部分标有粗俗术语；等等-不必要地将日常图像与诽谤和攻击性语言联系起来，并在未来的人工智能模型中烘焙偏见和偏见。\nCSAIL的电气工程和计算机科学教授安东尼奥·托拉尔巴(Antonio Torralba)表示，实验室根本不知道这些令人不快的图片和标签存在于数据集中。“很明显，我们应该对他们进行人工筛查，”他告诉“纪事报”(The Register)。“对此，我们表示诚挚的歉意。事实上，我们已经使数据集离线，这样就可以删除有问题的图像和类别。“。\n然而，CSAIL在其网站上的一份声明中表示，数据集将永久离线，因为图像太小，无法手动检查和手工过滤。该实验室还承认，它自动从互联网上获得了这些图像，而没有检查图书馆是否摄入了任何冒犯性的照片或语言，并敦促人们删除自己的数据副本：\n已经引起我们注意的是，微小图像数据集包含一些贬义性的术语，如类别和攻击性图像。这是自动数据收集过程依赖于来自WordNet的名词的结果。我们对此深表关切，并向可能受到影响的人表示歉意。\n数据集太大(8000万张图像)，图像太小(32x32像素)，人们很难在视觉上识别其内容。因此，人工检查即使可行，也不能保证可以完全去除攻击性图像。\n因此，我们决定正式撤回该数据集。它已离线，不会重新上线。我们要求社区将来不要使用它，并删除可能已经下载的数据集的任何现有副本。\n托拉尔巴教授告诉了我们更多关于图书馆是如何构建的：获得了一个巨大的单词列表-包括贬义性术语-然后编写代码，使用这些单词在网络上搜索图像，并将这些单词组合在一起。结果是一个包含原始互联网材料的数据集。\n托拉尔巴教授说：“这个数据集包含53,464个不同的名词，它们是直接从WordNet上复制过来的。”托拉尔巴教授指的是普林斯顿大学的英语单词数据库，这些单词被分组到相关的集合中。然后，使用当时可用的过滤器，这些图片被用来自动从互联网搜索引擎下载相应名词的图片，以收集8000万张图片。“\n20世纪80年代中期，认知心理学创始人之一乔治·阿米蒂奇·米勒(George Armitage Miller)领导下的普林斯顿认知科学实验室建立了Wordnet。“米勒痴迷于词语之间的关系，”普拉布告诉我们。“数据库本质上映射了单词之间的关联方式。”\n例如，猫和狗这两个词比猫和伞关系更密切。不幸的是，WordNet中的一些名词是种族主义俚语和侮辱。现在，几十年后的今天，随着学者和开发人员将数据库用作方便的英语单词竖井，这些术语困扰着现代机器学习。\n“当你在构建巨大的数据集时，你需要某种结构，”Birhane告诉El Reg。“这就是为什么WordNet是有效的。它为计算机视觉研究人员提供了一种对图像进行分类和标记的方法。既然你可以使用WordNet，为什么还要自己去做呢？“。\n作为一系列单词，Wordnet本身可能没有那么有害，尽管当它与图像和人工智能算法结合时，可能会产生令人不安的后果。Birhane说：“(WordNet)项目的目的就是映射彼此相近的单词。”但是，当你开始将图像与这些词语联系起来时，你就是在把一张真人的照片放在一起，并将它们与使刻板印象永久化的有害词语联系在一起。“。\nImageNet也有同样的问题，因为它也是使用WordNet进行注释的。一项名为ImageNet Roulette的实验允许人们将照片提交给由ImageNet训练的神经网络，该神经网络将使用数据集中的标签来描述图像。不出所料，人们向系统提供了最让他们着迷的快照：他们的自拍。当软件用种族主义和攻击性的标签描述他们时，一些人感到震惊。\n这个图像识别轮盘赌充满了乐趣和游戏。直到它给你贴上强奸嫌疑犯、离婚者或种族诽谤的标签。\n多读。\n这些巨型数据集中有问题的图像和标签的比例很小，很容易将它们视为异常而置之不理。然而，Prabhu和Birhane认为，如果这些材料被用来训练现实世界中使用的机器学习模型，那么它们可能会导致真正的伤害。\n他们在论文中写道：“缺乏对规范数据集的批判性参与，对妇女、种族和少数民族，以及处于社会边缘的弱势个人和社区产生了不成比例的负面影响。”\n这些群体在人工智能训练数据集中往往没有得到很好的代表；这就是为什么面部识别算法难以识别女性和深色皮肤的人的原因。今年早些时候，底特律一名黑人男子被面部识别软件误认为窃贼嫌疑人，随后被警方错误逮捕。这也是为什么一种有争议的人工智能算法，从低分辨率的照片中生成高分辨率的图像，将巴拉克·奥巴马的模糊照片变成比布莱克更高加索的人。\nBirhane说：“人们不会考虑这些模型将如何应用，或者它可以用来做什么。”他们只会想‘哦，这是我能做的一件很酷的事’。但当你开始更深入地思考时，你会开始发现所有这些阴险的目的，并看看这些危害是如何显现的。“。\n像ImageNet和8000万个微小图像这样的巨型数据集也经常是在没有得到人们明确同意的情况下从Flickr或Google Images上刮照片来收集的。与此同时，Facebook聘请了一些演员，他们同意将自己的脸用于一个数据集，该数据集旨在教授软件检测计算机生成的伪造图像。\n普拉布和比尔哈恩说，社交网络的做法是个好主意，尽管他们指出，学术研究不太可能有资金来支付演员在训练场的主演费用。他们说：“我们承认没有完美的解决方案来创建理想的数据集，但这并不意味着人们不应该尝试创建更好的数据集。”\n两人建议在专注于对象识别的数据集中模糊人的脸，仔细筛选图像和标签以删除任何攻击性材料，甚至使用真实的合成数据进行训练系统。他们说：“你不需要包括种族诽谤、色情图片或儿童照片。”做好科学工作和遵守道德标准并不是相互排斥的。“。\nThe Register-独立于科技界的新闻和观点。情况发布的一部分", "note_en": "Special report MIT has taken offline its highly cited dataset that trained AI systems to potentially describe people using racist, misogynistic, and other problematic terms.\n  The database was removed this week after  The Register alerted the American super-college. MIT also urged researchers and developers to stop using the training library, and to delete any copies. &#34;We sincerely apologize,&#34; a professor told us.\n  The training set, built by the university, has been used to teach machine-learning models to automatically identify and list the people and objects depicted in still images. For example, if you show one of these systems a photo of a park, it might tell you about the children, adults, pets, picnic spreads, grass, and trees present in the snap. Thanks to MIT&#39;s cavalier approach when assembling its training set, though, these systems may also label women as whores or bitches, and Black and Asian people with derogatory language. The database also contained close-up pictures of female genitalia labeled with the C-word.\n  Applications, websites, and other products relying on neural networks trained using MIT&#39;s dataset may therefore end up using these terms when analyzing photographs and camera footage.\n  The problematic training library in question is 80 Million Tiny Images, which was created in 2008 to help produce advanced object detection techniques. It is, essentially, a huge collection of photos with labels describing what&#39;s in the pics, all of which can be fed into neural networks to teach them to associate patterns in photos with the descriptive labels. So when a trained neural network is shown a bike, it can accurately predict a bike is present in the snap. It&#39;s called Tiny Images because the pictures in library are small enough for computer-vision algorithms in the late-2000s and early-2010s to digest.\n  Today, the Tiny Images dataset is used to  benchmark computer-vision algorithms along with the better-known ImageNet training collection. Unlike  ImageNet, though, no one, until now, has scrutinized Tiny Images for problematic content.\n  Vinay Prabhu, chief scientist at UnifyID, a privacy startup in Silicon Valley, and Abeba Birhane, a PhD candidate at University College Dublin in Ireland, pored over the MIT database and discovered thousands of images labelled with racist slurs for Black and Asian people, and derogatory terms used to describe women. They revealed their findings in a paper [ pre-print PDF] submitted to a computer-vision conference due to be held next year.\n    The dataset holds more than 79,300,000 images, scraped from Google Images, arranged in 75,000-odd categories. A smaller version, with 2.2 million images, could be searched and perused online from the website of MIT’s Computer Science and Artificial Intelligence Lab (CSAIL). This visualization, along with the full downloadable database, were removed on Monday from the CSAIL website after  El Reg alerted the dataset&#39;s creators to the work done by Prabhu and Birhane.\n  The key problem is that the dataset includes, for example, pictures of Black people and monkeys labeled with the N-word; women in bikinis, or holding their children, labeled whores; parts of the anatomy labeled with crude terms; and so on – needlessly linking everyday imagery to slurs and offensive language, and baking prejudice and bias into future AI models.\n    Antonio Torralba, a professor of electrical engineering and computer science at CSAIL, said the lab wasn&#39;t aware these offensive images and labels were present within the dataset at all. “It is clear that we should have manually screened them,” he told  The Register. “For this, we sincerely apologize. Indeed, we have taken the dataset offline so that the offending images and categories can be removed.”\n  In a  statement on its website, however, CSAIL said the dataset will be permanently pulled offline because the images were too small for manual inspection and filtering by hand. The lab also admitted it automatically obtained the images from the internet without checking whether any offensive pics or language were ingested into the library, and it urged people to delete their copies of the data:\n  It has been brought to our attention that the Tiny Images dataset contains some derogatory terms as categories and offensive images. This was a consequence of the automated data collection procedure that relied on nouns from WordNet. We are greatly concerned by this and apologize to those who may have been affected.\n The dataset is too large (80 million images) and the images are so small (32 x 32 pixels) that it can be difficult for people to visually recognize its content. Therefore, manual inspection, even if feasible, will not guarantee that offensive images can be completely removed.\n We therefore have decided to formally withdraw the dataset. It has been taken offline and it will not be put back online. We ask the community to refrain from using it in future and also delete any existing copies of the dataset that may have been downloaded.\n  Prof Torralba told us a little more on how the library was constructed: a huge list of words – including derogatory terms – was obtained and then code was written to search the web for images using these words, and combine the lot. The result was a dataset containing raw internet material.\n  “The dataset contains 53,464 different nouns, directly copied over from WordNet,&#34; Prof Torralba said referring to Princeton University&#39;s database of English words grouped into related sets. &#34;These were then used to automatically download images of the corresponding noun from internet search engines at the time, using the available filters at the time, to collect the 80 million images.”\n  WordNet was built in the mid-1980s at Princeton&#39;s Cognitive Science Laboratory under George Armitage Miller, one of the founders of cognitive psychology. “Miller was obsessed with the relationships between words,” Prabhu told us. “The database essentially maps how words are associated with one another.”\n  For example, the words cat and dog are more closely related than cat and umbrella. Unfortunately, some of the nouns in WordNet are racist slang and insults. Now, decades later, with academics and developers using the database as a convenient silo of English words, those terms haunt modern machine learning.\n  “When you are building huge datasets, you need some sort of structure,” Birhane told  El Reg. “That’s why WordNet is effective. It provides a way for computer-vision researchers to categorize and label their images. Why do that yourself when you could just use WordNet?”\n  WordNet may not be so harmful on its own, as a list of words, though when combined with images and AI algorithms, it can have upsetting consequences. “The very aim of that [WordNet] project was to map words that are close to each other,&#34; said Birhane. &#34;But when you begin associating images with those words, you are putting a photograph of a real actual person and associating them with harmful words that perpetuate stereotypes.”\n  ImageNet has the same problems, too, as it was also annotated using WordNet. An experiment dubbed  ImageNet Roulette allowed people to submit photos to a neural network trained from ImageNet that would describe the images using labels from the dataset. Unsurprisingly, people fed the system snaps that fascinated them the most: their selfies. Some were shocked when the software described them using racist and offensive labels.\n  This image-recognition roulette is all fun and games... until it labels you a rape suspect, divorcee, or a racial slur\n  READ MORE\n  The fraction of problematic images and labels in these giant datasets is small, and it’s easy to brush them off as anomalies. Yet this material can lead to real harm if they’re used to train machine-learning models that are used in the real world, Prabhu and Birhane argued.\n  “The absence of critical engagement with canonical datasets disproportionately negatively impacts women, racial and ethnic minorities, and vulnerable individuals and communities at the margins of society,” they wrote in their paper.\n  These groups are often not well represented in AI training datasets; it’s the reason why facial-recognition algorithms struggle with identifying women and people of darker skin. A Black man in Detroit was  wrongfully arrested by cops after being mistaken for a suspected thief by facial-recognition software earlier this year. It’s also the reason why a  controversial AI algorithm that generates high-resolution images from low-resolution snaps turned a blurry photo of Barack Obama into someone more Caucasian than Black.\n  “People don’t think about how these models are going to applied or what it could be used for,&#34; said Birhane. &#34;They just think ‘oh, here’s this cool thing I can do’. But when you start thinking deeper, you will start to find all these insidious purposes and see how these harms manifest.”\n  Giant datasets like ImageNet and 80 Million Tiny Images are also often collected by scraping photos from Flickr or Google Images without people’s explicit consent. Meanwhile, Facebook  hired actors who agreed to have their faces used in a dataset designed to teach software to detect computer-generated faked images.\n  Prabhu and Birhane said the social network&#39;s approach was a good idea, though they noted academic studies are unlikely to have the funding to pay actors to star in training sets. “We acknowledge that there is no perfect solution to create an ideal dataset, but that doesn’t mean people shouldn’t try and create better ones,” they said.\n  The duo suggested blurring people’s faces in datasets focused on object recognition, carefully screening the images and labels to remove any offensive material, and even training systems using realistic synthetic data. “You don’t need to include racial slurs, pornographic images, or pictures of children,&#34; they said. &#34;Doing good science and keeping ethical standards is not mutually exclusive.” ®\n         The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2020-07-02 02:25:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大数据,ai,apologizes,数据", "title": "麻省理工学院道歉，永久拉下线下的巨大数据集，教会AI系统使用种族主义、歧视女性的污蔑", "title_en": "MIT Apologizes, Permanently Pulls Offline Huge Dataset That Taught AI Systems To Use Racist, Misogynistic Slurs", "transed": 1, "url": "https://www.theregister.com/2020/07/01/mit_dataset_removed/", "via": "", "real_tags": ["大数据", "ai", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注册我们的第一期特别版时事通讯，每天都可以获得冠状病毒大流行的最新消息。\n美国已经购买了全球几乎全部的瑞德韦尔(Redesivir)，这是一种可以加速感染冠状病毒的患者康复的抗病毒药物。\n卫生与公共服务部部长本周早些时候宣布了一项协议，在9月份之前从Gilead Sciences获得大量药物，允许美国医院购买。\n阿扎尔在一份声明中说：“特朗普总统达成了一项令人惊叹的协议，以确保美国人能够获得新冠肺炎的第一个授权治疗药物。”\n他说：“在可能的范围内，我们希望确保任何需要重新治疗的美国患者都能得到治疗。特朗普政府正在尽我们所能更多地了解新冠肺炎的救命疗法，并确保美国人民获得这些选择。“。\nHHS表示，它获得了50多万个疗程的药物。\n“这是吉列德7月份预计产量(94200个疗程)的100%，是8月份产量(17.49万个疗程)的90%，是9月份产量(23.28万个疗程)的90%，此外还有临床试验的拨款。”\n这家制药商周一表示，Remdesivir将为拥有私人医疗保险的典型患者支付3120美元，并补充说，私人保险患者的每剂费用约为520美元。\n据华尔街日报报道，较短、更常见的疗程将花费3120美元，而较长的疗程将花费5720美元。\n据Euronews报道，这种抗病毒药物是欧洲药品管理局(European Medicines Agency)批准的唯一一种治疗冠状病毒患者的药物。\n新闻媒体援引英国研究人员的话报道，另一种被发现对冠状病毒患者有效的药物是类固醇地塞米松，它可以将病情最严重的患者的死亡人数减少高达三分之一。\n利物浦大学高级访问研究员安德鲁·希尔博士告诉英国“卫报”：“他们已经获得了(瑞德韦尔)的大部分药物供应，所以欧洲没有什么可供选择的。”\n“这是首个获批的重大药物，准入机制在哪里？我们又一次排在了队伍的后面，“他说。\n希尔补充说，英国仍然可以通过所谓的强制许可获得redesivir，这凌驾于该公司的知识产权之上。\n据英国“卫报”报道，这将允许英国从孟加拉国或印度的仿制药公司购买产品，在这些国家，吉利德的专利没有得到承认。", "note_en": "Sign up for our   special edition newsletter to get a daily update on the coronavirus pandemic.\n    The US has bought almost the entire global supply of remdesivir, the anti-viral drug that can speed the recovery of  patients infected with the coronavirus.\n Health and Human Services Secretary announced earlier this week an agreement to secure large quantities of the medication from Gilead Sciences until September, allowing US hospitals to buy it.\n “President Trump has struck an amazing deal to ensure Americans have access to the first authorized therapeutic for COVID-19,” Azar said in a statement.\n “To the extent possible, we want to ensure that any American patient who needs remdesivir can get it. The Trump Administration is doing everything in our power to learn more about life-saving therapeutics for COVID-19 and secure access to these options for the American people.”\n HHS said it secured more than 500,000 treatment courses of the drug.\n “This represents 100 percent of Gilead’s projected production for July (94,200 treatment courses), 90 percent of production in August (174,900 treatment courses), and 90 percent of production in September (232,800 treatment courses), in addition to an allocation for clinical trials,” it said.\n Remdesivir will cost $3,120 for the typical patient with private health insurance, the drugmaker said Monday, adding that it will cost hospitals about $520 per dose for privately insured patients.\n The shorter, more common course of treatment would work out to $3,120, while the longer duration would cost $5,720,  the Wall Street Journal reported.\n  The anti-viral drug is the only one approved by the European Medicines Agency to treat coronavirus patients,  according to Euronews.\n Another drug found to have an effect on coronavirus patients is the steroid dexamethasone, which reduces the number of deaths in the most severely ill patients by up to a third, the news outlet reported, citing British researchers.\n “They’ve got access to most of the drug supply [of remdesivir], so there’s nothing for Europe,” Dr. Andrew Hill, senior visiting research fellow at Liverpool University,  told the UK’s Guardian.\n “This is the first major approved drug, and where is the mechanism for access? Once again we’re at the back of the queue,” he said.\n Hill added the UK could still get its hands on remdesivir through what is known as a compulsory license, which overrides the intellectual property rights of the company.\n That would allow the UK to purchase from generic companies in Bangladesh or India, where Gilead’s patent is not recognized, the Guardian reported.", "posttime": "2020-07-02 02:24:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,病毒,coronavirus,美国,药物", "title": "美国购买几乎全球所有冠状病毒药物redesivir的库存", "title_en": "US buys nearly all global stock of coronavirus drug remdesivir", "transed": 1, "url": "https://nypost.com/2020/07/01/us-buys-nearly-all-global-stock-of-coronavirus-drug-remdesivir/", "via": "", "real_tags": ["冠状病毒", "病毒", "美国", "药物"]}, {"category": "", "categoryclass": "", "imagename": "f9e619de87544fdf98b8308fb6944572.jpg", "infoid": 1009336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在它被废弃了，但很多网站都是建立在闪存技术之上的。\n基本的HTML技术没有为设计者提供足够的工具和方法来表达他们的想法，而通常用来制作动画和交互式演示文稿的Flash走进了Web。\n对于想要做web-flash的设计师来说，网站是呼吸新鲜空气的好去处。你能想象到的一切都是可能的-从复杂的互动动画到3D。\n灵感的主要来源是thefwa.com，在网站上添加FWA标签是一种荣幸。\n听起来不错，对吧？但是闪电侠后来怎么样了呢？嗯，简而言之，它是不安全的，它的加载很重，Apple Effect和HTML5。\n不幸的是，我不能给你提供任何链接，因为你不能打开它们，闪存技术现在已经死了。\n现在很难想象，但就在不久前，flash还是互联网的一大部分-网站、游戏、横幅，我认为超过50%的设计师组合都是建立在flash之上的。", "note_en": "Now it’s abandoned, but a lot of websites were built on FLASH technologies.\n  Basic HTML technologies didn’t provide enough tools and methods for designers to express their ideas and FLASH which was used commonly to create an animation and interactive presentations stepped into the Web.\n  For designers who wanted to do web — FLASH websites were the breath of fresh air. Everything you can imagine was possible — from complex interactive animations to 3D.\n  The main source of inspiration was thefwa.com and it was an honor to add an FWA label on a website.\n  Sounds good, right? But what happened with FLASH then? Well, briefly it wasn’t secure, it was heavy to load, Apple effect and HTML5.\n  Unfortunately, I can’t provide any links to you, because you can’t open them, FLASH technology is deadly dead right now.\n  It’s hard to imagine right now but FLASH was a big part of the internet not so far ago — websites, games, banners and I think that more than 50% of all designers portfolio was built on FLASH.", "posttime": "2020-07-02 02:24:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,dark,flash", "title": "网络黑暗时代", "title_en": "Web Dark Ages", "transed": 1, "url": "https://pavellaptev.github.io/web-dark-ages/", "via": "", "real_tags": ["网络", "dark", "flash"]}, {"category": "", "categoryclass": "", "imagename": "95e8a856e91c2324de01cfb61fd615ea.png", "infoid": 1009334, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Spotify宣布正在将Duo计划扩展到包括美国在内的55个市场。简而言之，Spotify Duo是一项针对没有家庭的夫妇的双重计划，他们必须居住在相同的物理地址。\n如果你想要Spotify Premium服务，家庭账户的吸引力是显而易见的-个人Spotify Premium账户的价格为9.99美元/月，而覆盖6个人的家庭账户的价格为14.99美元/月。Duo位于两者之间，价格为12.99美元/月--在很大程度上，它是“没有家庭的简单家庭”，提供的账户总数较少，也没有父母控制。\n新的Duo计划还提供了一个名为Duo Mix的功能，旨在根据合作伙伴对Duo计划的偏好提供双方都喜欢的播放列表。混音是自动生成的，它的整体节奏可以通过轻触移动设备上的冷或乐观的图标来改变。\n人工生成的播放列表上的每一首歌都包括其品味来源的伴侣的个人资料图片-因此，如果你仍然无法在音乐上达成一致，你至少可以明确地针对责任方，当你永远不会放弃你、谁让狗出来了，或者一些奇怪的独立民歌开始播放时，你可以至少明确地找出负有责任的一方。(#34；Who Leat the Dog Out，&#34；Who Low the Dog Out，&#34；Who Low the Dog Out，&#34；)或者一些奇怪的独立民谣开始播放时。\n一些媒体对Duo的号召力表示惊讶--将其描述为解决了一个很少有人面临的问题。但如果你假设顾客会遵守Spotify的实际限制(无论对错)，这个计划就更有意义。Spotify Duo和Spotify Family都要求所有计划成员居住在相同的物理地址。\n两人家庭是2019年美国最大的单一群体；当三人到六人的家庭加在一起时，总数仅略多一些，为35.9%。很有可能，许多Spotfiy家庭成员会欺骗一些人，并将非居民朋友或家庭成员包括在他们的账户中。但对于那些循规蹈矩的人来说，Duo对数百万潜在客户来说是一场胜利--即使这只是一次2美元的胜利。", "note_en": "Today, Spotify  announced that it is expanding its Duo plan to 55 markets, including the United States. In a nutshell, Spotify Duo is a dual plan for couples—who must reside at the same physical address—without a family.\n If you want Spotify Premium service, the appeal of a family account is obvious—individual Spotify Premium accounts go for  $9.99/mo apiece, while a family account that covers up to six people goes for  $14.99/mo. Duo sits in between the two at $12.99/mo—for the most part, it&#39;s simply Family without the family, offering fewer total accounts and no parental controls.\n The new Duo plan also comes with a feature called  Duo Mix, intended to provide mutually enjoyable playlists based on the preferences of both partners on a Duo plan. The mix is automatically generated, and its overall tempo can be changed by tapping &#34;chill&#34; or &#34;upbeat&#34; icons on a mobile device.\n Each song on the artificially generated playlist includes the profile picture of the partner whose tastes it was generated from—so if you still can&#39;t agree on music, you can at least definitively target the responsible party when &#34; Never Gonna Give You Up,&#34; &#34; Who Let The Dogs Out,&#34; or some strange indie  folk song starts playing.\n  Some outlets have expressed surprise at Duo&#39;s appeal— characterizing it as &#34;solving a problem few people face.&#34; But the plan makes a lot more sense if you assume—rightly or wrongly—that customers will follow Spotify&#39;s actual restrictions. Both Spotify Duo and Spotify Family require all plan members to live at the same physical address.\n Two-person households were the largest single group in the United States in 2019; when combined, households of between three and six persons were only slightly larger at 35.9 percent total. In all likelihood, many Spotfiy Family members &#34;cheat a little&#34; and include a non-residential friend or family member in their account. But for those who play by the rules, Duo is a win—even if it&#39;s only a $2 win—for millions of potential customers.", "posttime": "2020-07-02 02:05:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "提供,duo,spotify", "title": "为情侣提供的Spotify Duo比标准的家庭计划便宜", "title_en": "Spotify Duo for couples is cheaper than the standard family plan", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/spotify-duo-for-couples-is-cheaper-than-the-standard-family-plan/", "via": "", "real_tags": ["提供", "duo", "spotify"]}, {"category": "", "categoryclass": "", "imagename": "3f8b764dbb0d98caf6e52f769d91c3f3.jpg", "infoid": 1009332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该交易所每天都在关注初创企业和私人市场，以获得额外的Crunch订户；使用代码交换获得完全访问权限，并将订阅优惠25%。\n新的系列提升了Lemonade的预期价值，这对Root、Kin、MetroMile、Hippo等保险科技初创公司来说是一个福音。如果Lemonade被迫降低定价，那么当它的同龄人去筹集更多资本时，它们的估值可能会面临压力。但随着Lemonade指出，市场将为其股权承担更高的价格，对于寻求以数字优先的方式重建保险产品的初创公司来说，这是一个好日子。\n今天上午，让我们计算出Lemonade的新估值区间，将其与该公司最终的非公开估值进行比较，看看我们是否能理解为什么股市可能会在新价格支撑该公司。在那之后，我们将分享一些来自人们关于IPO的笔记，以及他们对IPO的看法，只是为了好玩。\nLemonade打算像以前一样出售1100万股票，因此该公司的目标不是要支付更大规模的股票。按照新的价格区间，Lemonade将出售价值2.86亿美元至3.08亿美元的股票，新价格区间的高端比其预期的第一个IPO定价区间(2.53亿美元至2.86亿美元)多出数千万股。\n该公司有两个估值区间：一个不包括承销商可以选择的IPO价格购买的165万股，另一个包括这些股票。如果没有额外的股本，Lemonade的目标估值为14.3亿至15.4亿美元；包括额外的股本，Lemonade的价值为14.7亿至15.8亿美元。", "note_en": "The Exchange   is a daily look at startups and the private markets for Extra Crunch subscribers; use code EXCHANGE to get full access and  take 25% off your subscription.\n  The new range boosts  Lemonade’s   expected value, a boon for insurtech startups like  Root,  Kin,  MetroMile,  Hippo and others. Had Lemonade been forced to reduce its pricing, the valuations of its contemporaries could have come under pressure when they went to raise more capital. But with Lemonade noting that the market will bear a higher price for its equity, it’s a good day for startups looking to rebuild insurance products in a digital-first manner.\n This morning, let’s work out the Lemonade’s new valuation range, compare it to the company’s final private valuation and figure out if we can understand why the stock market may support the company at its new price. After that, we’ll share a few notes from folks about the IPO and how they think it might go, just for fun.\n  Lemonade intends on selling 11 million shares as before, so the company is not targeting a larger bloc of shares to disburse. At its new price range, Lemonade will sell shares worth between $286 million and $308 million, a few dozen million more at the top end of its new range than it had anticipated with its first IPO pricing interval ($253 million and $286 million).\n The company has two valuation ranges: one without the 1.65 million shares its underwriters may purchase at its IPO price if they choose, and one including those shares. Without the extra equity, Lemonade is aiming at a $1.43 billion to $1.54 billion valuation; including the extra equity, Lemonade is worth $1.47 billion to $1.58 billion.", "posttime": "2020-07-02 02:04:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipo,unicorn,lemonade", "title": "\n保险科技独角兽Lemonade在首次公开募股(IPO)前提高IPO区间", "title_en": "\n\t\t\t\tInsurtech unicorn Lemonade raises IPO range ahead of debut\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/01/insurtech-unicorn-lemonade-raises-ipo-range-ahead-of-debut/", "via": "", "real_tags": ["ipo", "unicorn", "lemonade"]}, {"category": "", "categoryclass": "", "imagename": "184d10d924ed82ce6e771c91ad51cc73.jpg", "infoid": 1009331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司之所以能够推出这些定期更新，是因为它现在不仅可以更新汽车的信息娱乐系统，而且几乎可以更新部署到构成现代车辆的各种计算机系统中的每一行代码。正因为如此，该公司现在还能够将它一直在谈论的几项功能推向市场。\n其中一项功能--也许也是今天活动的关键公告--是宝马计划的更新，用于订阅特定的硬件功能，这些功能可能已经内置在你的车里，比如加热座椅或高级驾驶辅助系统，但你在买车时并没有激活这些功能。宝马谈论这一点已经有一段时间了，但现在它正在将这一点变成现实。这意味着，如果你没有购买加热座椅和方向盘，例如，你的新宝马现在可能会为你提供三个月的免费试用，然后你基本上可以在一段时间内购买这一功能的订阅。\n一位公司发言人在今天的新闻发布会上说：“无论这辆宝马是新的还是二手的，我们都为客户提供了最大的灵活性和安心，让他们在选择和使用宝马可选设备时感到放心。”因此，当涉及到您的可选设备时，任何时候都可以提供灵活的优惠、立即可用、更简单的预订和易于使用的选择。我们在20多年前就已经开始联网了，自2014年以来，我们的Connected Drive商店已经上线，那里的数字服务已经可以预订了。“。\n不过，这些都是非常重要的信息娱乐功能。现在，宝马将允许您按需和空中启用车辆功能和可选设备。该公司开始提供一些功能，比如具有停下来走功能的主动巡航控制系统，远光灯助手，以及进入宝马图标之声运动(BMW IconicSound Sports)。随着时间的推移，这家汽车制造商将为这一阵容增加新的功能。\n令人惊讶的是，对于汽车制造商来说，在汽车中安装一些硬件往往更容易，成本也更低，即使它没有被激活，只是因为它消除了生产过程的复杂性。不过，宝马谈论的许多功能都是软件和硬件的结合。\n这里的新功能是可以在短时间内只订阅某些功能。一位发言人说：“在不久的将来，我们不仅可以在这里增加更多功能，而且我们还可以为临时预订的客户增加更大的灵活性，这样我们就可以预订三年、一年甚至更短的时间，比如几个月。”\n该公司还指出，这也将给购买二手车的人带来更大的灵活性。值得一提的是，Apple CarPlay支持最初也是新款宝马的一项订阅功能，每年收费80美元。不过，该公司的客户对此并不十分满意，并于去年12月推翻了这一决定。不过，这真的让人感觉像是小打小闹的司机，因为宝马的竞争对手都没有为此收费。看看司机对额外的订阅服务会有什么反应会很有趣，但现在的焦点更多地是方便功能，而这些功能通常是你购买新车时的一个选择，所以我猜这不会是一个太大的问题。\n宝马今天展示的其他新的和更新的数字服务包括对苹果新的“汽车钥匙”(BMW Digital Key)的支持，以及更新后的宝马个人助理(BMW Personal Assistant)。其中一些新的助手功能更具装饰性，以及它是如何在车载显示器上展示的。但这里有一个很棒的新功能，例如，它是一种适用于你的汽车的IFTTT，你可以很容易地对它进行编程，让它在你进入公司的停车场时自动摇下车窗，这样你就可以很容易地扫描你的徽章来打开吊杆门。\n其他更新包括新的宝马地图(BMW Maps)，这是该公司的内置GPS系统，该公司称这是一次“重大飞跃”。这项基于云的服务现在可以更快地找到路线，拥有更细粒度的交通数据，还包括为你找到停车位的能力-而且停车功能本身是基于该公司在整个车队中聚合传感器数据所做的大量工作，该车队已经覆盖了德国近99%的高速公路系统，并每天以高清模式绘制一次地图。\n谈到地图，仍在推出混合动力汽车的宝马公司今天还宣布，其混合动力车队将使司机更容易找到充电站，当他们进入欧洲80个城市的低排放区时，将自动切换到电动驾驶，并随着时间的推移支持更多城市。\n“数字技术属于宝马的核心--因为硬件和软件对高档车同等重要，”宝马管理委员会主席奥利弗·齐普斯(Oliver Zipse)说。我们的使命是将先进的数字技术与最卓越的产品相结合，以提高我们客户的体验，并进一步推动乐趣。“", "note_en": "The company is able to launch these regular updates because it is now able to not just update the car’s infotainment system but virtually every line of code that’s deployed to the various compute systems that make up a modern vehicle. And because of this, the company is now also able to bring a couple of features to market that it has long talked about.\n One of those features — and maybe the key announcement from today’s event — are updates to BMW program for subscribing to specific hardware features that are may already be built into your car, like heated seats or advanced driver assistance systems, but that you didn’t activate when you bought the car. BMW has talked about this for a while, but it is now making this a reality. That means if you didn’t buy the heated seats and steering wheel, for example, your new BMW may now offer you a free three-month trial and you can then essentially buy a subscription for this feature for a set amount of time.\n   “We offer maximum flexibility and peace of mind to our customers when it comes to choosing and using their optional equipment in their BMWs, whether this BMW is new or used,” a company spokesperson said during today’s press event. “So flexible offers, immediate availability, simpler booking and easy usability for choice, at any time, when it comes to your optional equipment. We already started connectivity over 20 years ago and since 2014, we are online with our Connected Drive Store, where digital services can already be booked.”\n Those were very much infotainment features, though. Now, BMW will let you enable vehicle functions and optional equipment on demand and over the air. The company started offering some features like active cruise control with stop and go functionality, a high beam assistant and access to the  BMW IconicSounds Sport. The carmaker will add new features to this line-up over time.\n Surprisingly, it’s often easier and cheaper for car manufacturers to build some hardware into cars, even if it is not activated, simply because it removes complexity from the production process. A lot of the features that BMW is talking about consist of a combination of software and hardware, though.\n What’s new here is the ability to only subscribe to some features for a short time. “In the near future, we will not only be able to add more functions here, but we will also be able to add even more flexibility for our customers with temporary bookings so booking of options for three years, for one year, or even shorter periods of time, like a few months,” a spokesperson said.\n  The company also notes that this will give somebody who buys a used car a lot more flexibility, too. It’s worth noting that Apple CarPlay support was also originally a subscription feature in new BMWs, costing $80 a year. The company’s customers were not very happy about this, though, and the company reversed that decision last December. That really felt like nickel-and-diming drivers, though, since none of BMW’s competitors charged for this. It’ll be interesting to see how drivers will react to additional subscription services, but the focus now is more on convenience features that would usually be an option when you buy a new car, so my guess is that this will be less of an issue.\n Among the other new and updated digital services the company showcased today is support for  Apple’s new ‘Car Keys,’ which BMW brands as the BMW Digital Key, as well as an updated BMW Personal Assistant. Some of these new Assistant features are more cosmetic and about how it is showcased on the in-car display. But one nifty new Assistant feature here, for example, is a kind of IFTTT for your car, where you can easily program it to automatically roll down your windows when you enter your company’s parking garage, for example, so that you can easily scan your badge to open the boom gate.\n  Other updates include the new BMW Maps, the company’s built-in GPS system, which the company described as a ‘major leap.’ This cloud-based service can now find routes faster, has more granular traffic data and also includes the ability to find parking spaces for you — and that parking feature itself is based on a lot of work the company is doing in aggregating sensor data from across its fleet, which already covers and maps close to 99% of the German highway system once a day in HD.\n  Talking about maps, the company, which is still in the middle of the roll-out of its hybrid-electric vehicles, BMW also today announced that its hybrid fleet will make it easier for drivers to find charging stations and will automatically switch to electric driving when they enter  low-emission zones in 80 European cities, with support for additional cities coming over time.\n “Digital technologies belong to the core of BMW – because hardware and software are of equal importance for premium cars,” said Oliver Zipse, the Chairman of the Board of Management of BMW. “Our mission is to integrate advanced digital technologies with highest product excellence to enhance our customers’ experience and driving pleasure even more.”", "posttime": "2020-07-02 02:04:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "想卖,sell,宝马", "title": "\n宝马想卖给你你汽车功能的订阅费", "title_en": "\n\t\t\t\tBMW wants to sell you subscriptions to your car’s features\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/01/bmw-wants-to-sell-you-subscriptions-to-your-cars-features/", "via": "", "real_tags": ["想卖", "sell", "宝马"]}, {"category": "", "categoryclass": "", "imagename": "5c93be6b6c87e8ace40a1e443fe7bebe.jpg", "infoid": 1009330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新闻自由倡导者在“我的世界”创建了一个虚拟图书馆，绕过压迫国家的审查制度，存放被审查的期刊和文章。这个虚拟空间是新闻自由组织“记者无国界”和“我的世界”设计公司BlockWorks合作创建的。因为“我的世界”在很多地方都没有被屏蔽--至少现在还没有--它是一种巧妙的方式，可以确保即使是那些生活在专制政权下的人也可以访问。\n这个名为“未经审查的图书馆”收藏了新闻自由指数中所有180个国家的信息，以及俄罗斯和越南等因新闻审查而臭名昭著的国家的展厅。BlockWorks表示，五个国家的记者看到自己的作品被禁后，可以在各自国家的展厅里重新发表文章，这让他们有机会向世界通报当地的情况。\n展厅里还有一些区域纪念那些保持沉默的记者，包括阮文戴(Nguyen Van Dai)、尤利娅·别列佐夫斯卡娅(Yulia Beerezovskaia)，以及据称是在沙特王储穆罕默德·本·萨勒曼(Mohammad Bin Salman)的授意下被残忍谋杀的沙特记者贾迈勒·卡舒吉(Jamal Khashoggi)。\n图书馆被放置在一个虚拟的小岛上，周围环绕着树木繁茂的蕨类植物和郁郁葱葱的花园，适合这样一个重要的地标，承担着如此艰巨的任务。恰如其分的是，它是以新古典主义风格设计的，由来自16个国家的24名建筑商安排的1250万个街区组成，目前容纳了200多本书。这使得它和它的雄心壮志一样具有世界性。它就像21世纪的亚历山大图书馆，只是不太可能意外起火。\n在设计上很难屏蔽--未经审查的图书馆从根本上讲是关于访问的。因此，它的结构方式使得政府很难(嗯哼)阻止。例如，该空间的内容不是在线索引的，因此不能轻易地从本地搜索结果中过滤掉。然而，一旦一个政权得到了这个项目的消息，他们就可以-而且很可能会-阻止托管该项目的服务器。\n然而，用户总是可以通过虚拟专用网(VPN)访问，或者可以下载地图并离线浏览图书馆。下载了地图的用户也可以在网上传播。即使“我的世界”被禁止，它也总是可以从Torrent网站上被盗版。因为只要还有人愿意托管和分享，互联网上几乎没有什么好东西会真正消亡。", "note_en": "Free press advocates have created a virtual library in Minecraft that bypasses censorship in oppressive countries to house censored journals and articles. The virtual space was created as a collaboration between the freedom-of-the-press organization,  Reporters Without Borders, and a Minecraft design company,  BlockWorks. Because Minecraft isn&#39;t blocked in many places — at least, not yet — it&#39;s an ingenious way to ensure access even for those living under repressive regimes.\n The Uncensored Library, as it&#39;s called, houses information on all 180 countries in the press freedom index, as well as exhibition halls on countries notorious for their press censorship, like Russia and Vietnam. BlockWorks says that journalists across five countries who&#39;ve seen their works banned were able to republish their articles in the exhibition halls for their respective countries, giving them a chance to inform the world about the situation on the ground.\n There are also areas in the exhibition halls honoring journalists who have been silenced, including Nguyen Van Dai, Yulia Beerezovskaia, and Jamal Khashoggi, the Saudi journalist who was brutally murdered, allegedly at the behest of Saudi Arabia&#39;s Crown Prince, Mohammad Bin Salman.\n  The library has been placed on a virtual island and is surrounded by topiary ferns and lush gardens befitting such an important landmark with so grave a task. Fittingly, it&#39;s designed in the Neoclassical style, consists of 12.5 million blocks arranged by 24 builders from 16 countries, and currently houses more than 200 books. That makes it as cosmopolitan as its ambitions. It&#39;s like a Library of Alexandria for the 21st century, except less likely to accidentally go up in flames.\n  Hard to block by design – The Uncensored Library is fundamentally about access. So it&#39;s structured in a way that makes it hard for governments to (ahem) block. The contents of the space aren&#39;t indexed online, so they cannot be easily filtered out of local search results, for instance. Though, once a regime gets word of this project, they can — and likely, will — block the servers it&#39;s hosted on.\n Users can always get access via virtual private networks (VPNs), however, or can download the map and explore the library offline. Users who&#39;ve downloaded the map can also spread it online. And even if Minecraft is banned, it can always be pirated from a torrent site. Because almost nothing good on the internet ever really dies as long as there&#39;s still someone out there willing to host and share it.", "posttime": "2020-07-02 02:03:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "现在,home,记者", "title": "我的世界现在是审查新闻的虚拟图书馆的故乡", "title_en": "Minecraft Is Now Home To a Virtual Library of Censored Journalism", "transed": 1, "url": "https://www.inputmag.com/culture/minecraft-is-now-home-to-a-virtual-library-of-censored-journalism-uncensored-library-blockworks-reporters-without-borders", "via": "", "real_tags": ["现在", "home", "记者"]}, {"category": "", "categoryclass": "", "imagename": "c94cb44bac0b155cad9e923137017c79.png", "infoid": 1009328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "App2Container允许您将现有应用程序集装箱化，并在用于监控、操作和软件交付的单一工具集上实现标准化。集装箱化使您能够统一运行应用程序所需的基础设施和技能集，从而节省基础设施和培训成本。\n将应用程序集装化需要您确定应用程序依赖项、网络端口配置和软件交付流程，以便构建和部署容器映像。这些任务可能是手动的、耗时的，而且容易出错。App2Container分析您的应用程序并自动生成容器镜像，该镜像配置了ECS或Kubernetes的正确依赖项、网络配置和部署说明。\nApp2Container允许您轻松地在云上部署配置了正确的网络和安全配置的现有应用程序。\n客户迁移到AWS的一个重要动机是有机会从传统的基于服务器的工作负载转变为云本地工作负载。这可以提供一个经济高效、可扩展的解决方案，在实现公共云的优势方面大有裨益。使传统工作负载现代化是Ensono为使用公共云的客户提供的云转型解决方案的核心。AWS App2Container(A2C)以一种可重复、可靠的方式极大地简化了工作负载集装箱化过程，从而缩短了迁移时间，并使我们的客户直接受益。在我们的A2C之旅中，AWS团队一直是积极和支持的盟友，我们期待着在转变更多客户端工作负载时密切合作。\n通过AWS App2Container(A2C)快速集装箱化遗留工作负载的能力是通过现代化降低总拥有成本的重大机遇。不进行优化的迁移不会产生客户在迁移到云时所寻求的好处。A2C使企业能够轻松地将工作负载转移到集装箱化环境中，从而提供更高的性能和可扩展性，并加快上市时间。A2C是这一领域的游戏规则改变者。\nDXC的应用程序容器即服务利用AWS App2Container(A2C)快速、经济高效地将运行在Windows和Linux服务器上的传统应用程序包装起来。使用A2C允许DXC实施集装箱化最佳实践，确保容器安全并针对性能进行优化。\nAWS App2Container(A2C)使AWS Partner Network(APN)高级咨询合作伙伴Cognizant能够利用AWS为Containers提供的广泛服务，大规模推动应用程序现代化。Cogizant使用A2C来缩短实现将遗留.NET和Java业务应用迁移到云并将其现代化的业务价值的时间。\n埃森哲AWS业务部(AABG)和埃森哲的云业务在整体容器解决方案的战略、设计和实施方面拥有广泛的背景。我们深厚的技能和丰富的经验使我们能够与AWS合作，利用AWS App2Container将AWS的应用程序集装箱化产业化。\n作为AWS合作伙伴，我们对AWS App2Container(A2C)提供给我们的新功能感到非常兴奋，这些新功能可以帮助我们的客户迈出实现旧式应用程序现代化的第一步，而无需任何重构。我们的许多客户不知道从哪里开始进行容器化，而A2C提供了一种一流的、规范的方法来快速将ASP.NET和Java应用程序从传统的基于VM的托管迁移到容器。使用AWS CLI的工程师和解决方案架构师会发现A2C CLI非常熟悉和直观。文档很清楚，涵盖了Linux和Windows应用服务器的容器。A2C的一个关键功能是能够作为独立的工作节点运行，以非侵入性方式将工作负载集装箱化，而无需在生产服务器上安装潜在的破坏性代理。A2C还支持Amazon ECR、ECS和EKS，因此企业可以快速查看和测试托管在云中的传统应用。使用Kubernetes的团队可以使用kubectl在现有的Amazon EKS或自我管理的Kubernetes集群(使用A2C生成的deployment.yaml)上启动容器化应用程序。A2C甚至支持在组管理服务帐户(Group Managed Service Account，GMSA)下运行集装化工作负载，这是一个将Windows应用集装化的高级概念，我们的团队惊喜地发现A2C支持它。\n简而言之，A2C是一种简单而规范的方式，可以迈出实现遗留应用程序现代化的第一步，而不需要任何重构。任何运行旧式ASP.NET和/或Java应用程序的商店都应将A2C视为简化和加快其在AWS上的应用程序现代化之旅的关键工具。", "note_en": "App2Container allows you to containerize your existing applications and standardize on a single set of tooling for monitoring, operations, and software delivery. Containerization allows you to unify infrastructure and skill sets needed to operate your applications, saving on both infrastructure and training costs.\n  Containerizing applications requires you to identify application dependencies, network port configurations, and software delivery processes in order to construct and deploy a container image. These tasks can be manual and time consuming as well as error prone. App2Container analyzes your applications and automatically generates a container image that is configured with the correct dependencies, network configurations, and deployment instructions for ECS or Kubernetes.\n  App2Container allows you to easily deploy an existing application on the cloud that is provisioned with the correct networking and security configurations.\n        A big motivator for client migrations to AWS is the opportunity to shift away from traditional server-based workloads and become cloud-native. This can provide a cost-effective, scalable solution that goes a long way towards delivering on the benefits of public cloud. Modernizing traditional workloads sits at the heart of Ensono’s Cloud Transformation solution for clients using public cloud. AWS App2Container (A2C) greatly simplifies the process of containerizing workloads in a repeatable, reliable way that reduces migration time and directly benefits our clients. The AWS team have been pro-active and supportive allies in our journey with A2C and we look forward to working together closely as we transform more client workloads.\n  The ability to rapidly containerize legacy workloads via AWS App2Container (A2C) represents a significant opportunity to reduce total cost of ownership through modernization. Migration without optimization does not yield the benefits that customers seek when migrating to the cloud. With minimal effort, A2C enables businesses to move workloads to containerized environments, providing enhanced performance and scalability and accelerating time to market. A2C is a game changer in this space.\n  DXC’s Application Containerization-as-a-Service leverages AWS App2Container (A2C) to quickly and cost-effectively containerize legacy applications running on Windows and Linux servers. Using A2C allows DXC to enforce containerization best practices ensuring containers are secure and optimized for performance.\n  AWS App2Container (A2C) enables Cognizant, an AWS Partner Network (APN) Premier Consulting Partner, to drive application modernization at scale by leveraging the broad services offered by AWS for Containers. Cognizant uses A2C to reduce the time to realize the business value of migrating and modernizing legacy .NET and Java business applications to the cloud.\n  The Accenture AWS Business Group (AABG) and Accenture’s cloud practice have an extensive background with the strategy, design and implementation of holistic container solutions. Our deep skills and broad experience uniquely position us to collaborate with AWS to leverage AWS App2Container for industrializing the containerization of applications to AWS.\n  As an AWS Partner, we are very excited for the new capabilities that AWS App2Container (A2C) gives us, to help our customers take the first steps towards modernizing legacy applications without the need for any refactoring. Many of our customers don&#39;t know where to start with containerization, and A2C provides a first-class, prescriptive path to quickly move ASP .net and Java applications from legacy VM-based hosting to containers. Engineers and Solutions Architects who use the AWS CLI, will find the A2C CLI to be familiar and intuitive. The documentation is clear, and covers containerizing both Linux and Windows application servers.  One key feature of A2C is its ability to be run as a standalone worker node, to containerize workloads in a non-intrusive fashion, without the need for installing potentially disruptive agents on production servers. A2C also supports Amazon ECR, ECS, and EKS, so that businesses can quickly see and test their legacy apps hosted in the cloud. Teams using Kubernetes can use kubectl to launch the containerized application on an existing Amazon EKS or self-managed Kubernetes cluster using A2C generated deployment.yaml. A2C even supports running containerized workloads under a Group Managed Service Account (gMSA), which is an advanced concept for containerizing Windows apps that our team was pleasantly surprised to find A2C supports.\n  In short, A2C is an easy and prescriptive way to take the first steps towards modernizing legacy applications, without the need for any refactoring. Any shop running legacy ASP.NET and/or Java applications should consider A2C as a critical tool to streamline and accelerate their application modernization journey on AWS.", "posttime": "2020-07-02 02:02:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "aws,应用程序", "title": "AWS App2Container", "title_en": "AWS App2Container", "transed": 1, "url": "https://aws.amazon.com/app2container/", "via": "", "real_tags": ["aws", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "2542785cfe6717d90ce290f87dc2934d.jpg", "infoid": 1009327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当詹姆斯·梅纳德(James Maynard)三岁时，一位健康访客来到他位于伦敦东北部切姆斯福德(Chermsford)的家中，检查他的发展情况。这样的探视对幼儿来说是例行公事，评估员带领他通过了一系列标准的测试。只有一个问题：梅纳德认为他们很愚蠢。\n因此，当她给他一个形状排序任务时，他故意将形状按令人惊讶的顺序排列，然后详细解释为什么他的解决方案比她的更有趣。当她问他玩具农场里的牛是什么动物时，他的母亲吉尔·梅纳德(Gill Maynard)在一封电子邮件中写道，“他真的很喜欢告诉她这是‘绵羊’，并观察她的反应。”当他认为评估已经进行了足够长的时间后，他宣布评估已经结束，并拿出了他的乐高积木。\n吉尔·梅纳德(Gill Maynard)在接受采访时说：“这是非常令人难忘的--一个三岁的孩子摧毁了这个可怜的女人。”\n评估员告诉他母亲詹姆斯缺乏纪律。“如果他继续这样下去，他在学校会有真正的问题，”她说。\n类似的事件在梅纳德的学校生活中屡见不鲜。有一次，他的物理老师使用了一种评分标准，梅纳德认为这很荒谬：没有解释或单位的正确答案只得三分之一的分。为了表示抗议，梅纳德只写了答案，全部答对，得分33%。“我想老师可能已经受够我了，”他说。\n“我绝对是那些烦人的孩子中的一员，他们会说‘为什么？为什么？为什么？“。一直都是，“梅纳德说。在他的学生时代，他“想做自己的事情，或者至少想要为事情找理由。”\n因此，也许并不令人惊讶的是，在2013年，作为一名刚刚获得博士学位的人，26岁的梅纳德在博士后导师警告他不要回答他想要解决的问题时，只是耸耸肩，这个问题是关于质数(那些只能被1及其本身整除的整数)的最核心问题之一。\n梅纳德当时在蒙特利尔大学的导师安德鲁·格兰维尔(Andrew Granville)回忆道：“我有点像是对他说，‘我希望你不要全职工作，因为我真的很有信心，你会失败的。’”\n但梅纳德“仍然有勇气，”蒙特利尔大学的迪米特里斯·库库洛普洛斯(Dimitris Koukoulopoulos)说，“他只是坐下来说，‘好吧，让我试试这个想法，看看会有什么结果。’”\n牛津大学的本·格林(Ben Green)说，他需要的是一个定理，这个定理“促使数学家们对质数之间的间距进行了重大的重新评估”。梅纳德现在是牛津大学的一名教授。\n梅纳德被有关质数的问题所吸引，这些问题简单到可以向高中生解释，但又很难，足以让数学家们难倒几个世纪。他说：“简单和基本之间的对比，(和)仍然完全神秘之间的对比，对我来说是非常非常吸引人的。”\n这样的问题很多，但现在比梅纳德出现之前要少。因为他早期的成功不是昙花一现，而是关于质数和相关结构的一系列发现中的第一个。现在他的博士学位已经过去七年了，梅纳德已经被认为是世界上领先的数字理论家之一。\n格林说，他在成为一名世界上受人尊敬的数学家的过程中经历了“非常陡峭的上升轨迹”。\n格兰维尔正在写一本关于解析数论的书，他抱怨梅纳德大大放慢了他的进步。“因为他，我不得不多加150页，”格兰维尔说。\n今年1月，在丹佛举行的联合数学会议上，我与梅纳德坐在一起，他前来领取弗兰克·纳尔逊·科尔数论奖(Frank Nelson Cole Award In Number They)。虽然这一奖项正式授予一篇著名的论文，但在梅纳德的案例中，奖项委员会忍不住引用了三篇论文，这三篇论文都出现在顶级数学期刊上。\n他只为他的丹佛之行安排了一天半的时间，但尽管我们在他从英国抵达后仅仅一个小时就见过面，他的脚步还是充满了活力。“我还在兴奋呢，”他笑着说，他那张狭长的孩子气的脸张得更大了。“时差还没有影响到我。”在我们谈话的过程中，他笑容满面，除了他必须摆姿势拍照的时候。“人们说我不知何故无法在照片中露出合适的笑容，”他做了个咬牙切齿的鬼脸说。\n如果时间允许，梅纳德计划在城市里漫步拍照。几年前，他开始摄影是为了感觉自己与他出差的许多城市更有联系，但这已经变成了一种痴迷。他说：“我夏天去了香港，黎明时分我要徒步旅行，拿着三脚架拍照。”尽管他通常不是个早起的人。\n梅纳德一直都有这种强迫症，小时候他经历了不同的恐龙、地质学和天文学阶段。他说：“我非常不擅长对事物有适度的兴趣。”“不知何故，我必须对它着迷，否则我会完全放弃它。”\n他的父亲克里斯·梅纳德(Chris Maynard)说，一旦梅纳德对一个主题产生兴趣，他往往不会停止，直到他的能力达到极限。“但他的数学还没到那个地步。我认为，从某种意义上说，这就是他的动力所在。“。\n尽管梅纳德家的其他人都以人文学科为导向-他的父母是语言教师，他的兄弟学习历史-但他总是发现自己走上了提供最多数学的道路。他说：“考虑到我当时的感受，在每个阶段，我都觉得这是显而易见的下一步。”\n在牛津大学研究生院时，他非凡的数学能力变得显而易见。他的导师罗杰·希思-布朗(Roger Heath-Brown)说，到了博士学习的后半段，他们的会面感觉更像是合作，而不是指导。“我以前从来没有和研究生有过这种感觉，”他说。\n当梅纳德离开牛津前往蒙特利尔大学进行为期一年的博士后研究时，他已经开始考虑一种潜在的方法来理解质数之间的差距。通常，沿着数字线走出去，质数就会变得越来越少。但在某些方面，它们的行为也像是随机数的集合，所以数学家们预计它们的间距通常会比平均水平近得多或远得多。数学中最著名的问题之一是孪生素数猜想，该猜想假设有无限多对素数只相差2，如11和13。\n梅纳德怀疑，使用大约10年前的一篇论文中描述的过滤质数的方法，可能在理解质数间隙方面取得进展。虽然数学家们已经仔细研究了这种方法，但梅纳德认为应该有可能从这种方法中提取更多的果汁。他说：“我一直在做计算和计算，我不断地得到这些小信号，这表明有一些东西需要理解和发现。”“不知何故，我完全被它迷住了，我真的想继续下去，直到我能想出一种方法来解释我看到的东西。”\n他的博士后导师格兰维尔劝阻梅纳德不要走这条路。格兰维尔说：“我真的不完全相信他的所作所为有可能奏效。”但是“詹姆斯从来没有因为我的怀疑而退缩，事实上，他只是笑了笑。”\n在梅纳德早期的探索中，数论世界发生了一次地震事件。一位名为张一堂(音译)的鲜为人知的数学家证明了，这不完全是孪生素数猜想，而是第二好的事情：他证明了有无限多对素数至多相隔有限的距离(准确地说，是7000万对)。这一发现为张赢得了立竿见影的荣誉，形式包括多份工作邀请(包括一份来自加州大学圣巴巴拉分校(University of California，Santa Barbara)的工作，他现在在那里任教)，邀请讲座，新闻故事，甚至是一部纪录片。\n与此同时，梅纳德继续致力于自己的方法来理解素数差距，大约六个月后，在灵光一现的情况下，他提出了一种完全独立的、比张的方法更强大的方法-它建立了无限多对素数最多相差600个。梅纳德的方法不仅适用于素数对，还适用于三倍数、四倍数和更大的集合(每个集合有不同的界限)。斯坦福大学的Kannan Soundararajan说：“这个结果看起来令人惊讶，太好了，简直不像是真的。”\n事实上，当梅纳德第一次意识到这一点时，他的兴奋之后很快就出现了一波恐惧，认为他错过了一些明显的错误。幸运的是，他说，“当我突然害怕我的结果是错误的时候，我觉得自己的工作效率更高了。…。没有什么比恐惧更能激励我了。“。\n格兰维尔坚持让梅纳德在写下他的结果时把每一个细节都写清楚。“没人会相信你，因为没人听说过你，”他告诉梅纳德。“你必须把这篇文章写得很好，没有人能和你争辩。”\n在这个过程接近尾声的时候，发生了一件可能很容易让一位年轻数学家感到恐惧的事情：梅纳德和格兰维尔私下了解到，另一位数学家在相同的时间框架内得出了基本上相同的结果。而且不是普通的数学家，而是现代最多产和最受尊敬的数学家之一-加州大学洛杉矶分校的菲尔兹奖牌获得者特伦斯·陶。这个问题引起了陶渊明的注意，当时他和其他数学家组成了一个大规模的合作，以减少张的证明中7000万的界限。\n当陶渊明得知一位鲜为人知的26岁的年轻人证明了同样的事情时，他一直对自己的新结果感到相当自豪。“老实说，从他写出来的方式来看，他的结果实际上比我要干净，”陶说。“他证明了略微更有力的说法。”陶渊明大方地避免宣布自己的工作，以避免让这样一位年轻数学家的成就黯然失色，因为他知道，如果他和梅纳德联合撰写一篇论文，许多数学家会认为陶渊明已经完成了大部分创造性工作。\n很容易想象另一个时间表，在这个时间线上，张在梅纳德之后6个月而不是之前6个月证明了他的结果(在这种情况下，陶渊明的探索可能会被推迟，或者干脆被阻止)。那么所有的荣誉都将属于梅纳德，而不是张。但梅纳德对事情的发展并不感到羡慕。“当张证明他的结果时，我非常兴奋，”他说。“我得到的主要快乐是从解决问题中获得的。所以我真的没有想太多，‘哦，要是我做这件事稍微不一样就好了。’“。\n梅纳德经常选择不戴眼镜从家里漫步到办公室。这种温和的模糊有助于他专注于数学，但有时也会导致他从他的伴侣埃莉诺·格兰特(Eleanor Grant)身边走过，而没有认出她。牛津的一名医生格兰特说：“有一次，他认为他看到了我，他真的非常非常自豪地看到了我，然后跑到这个长得一点也不像我的人跟前。”\n梅纳德在这一点和其他几个方面都符合心不在焉的教授的刻板印象。例如，他几乎总是穿着相同风格的衣服，一件开领的白色衬衫和牛仔裤。“我显然不是最注重时尚的人，”他在一封电子邮件中写道。(有一次，作为一个恶作剧，所有参加他的一次演讲的数学家都穿着梅纳德的制服出现了。)。\n但他也掩盖了许多关于内向数学家的陈词滥调。同事们称他热情、爱开玩笑、性格外向。在大流行之前，他每天午饭后都会带着自己的咖啡豆去上班，并为其他数字理论家煮咖啡。希思-布朗说，几年前，当他在伯克利的数学科学研究所度过一个学期时，他与另外两名年轻数学家共同居住的房子是“派对屋”(尽管梅纳德将其称为“以数学家的标准衡量的派对屋”)。\n格兰维尔说，由于梅纳德的存在，许多新一代的数字理论家更具社会性。“他在某种程度上是团队的中心。”\n在梅纳德证明了他关于素数之间小间隙的定理后，数学家们急忙将他的见解应用到其他问题上。但到目前为止，这样做的最大成功来自梅纳德本人，他想出了如何解决巨大的质数差距，比之前75多年来没有看到重大进展的估计有所改善。格兰维尔说，梅纳德将他的方法适应于这种新的情景“是我在数论中见过的最聪明的把戏之一”。\nSoundarajan在谈到梅纳德关于素数差距大小的结果时说：“我想说，任何人都会很高兴在他们的职业生涯中证明了两个这样的定理。”“他是在刚读完研究生之后才做这件事的，这一点是相当了不起的。”\n在一个令人不安的小缺口故事的呼应中，陶渊明再次在大致相同的时间得出了大致相同的结果(尽管这一次他与格林和另外两名合著者合作)。从那时起，梅纳德和陶渊明得出类似结果的倾向就成了数论界的笑柄。一两年后，当陶渊明解决了另一个长期存在的数论问题时，他说：“我记得当时非常偏执，只是问安德鲁(格兰维尔)，‘我真的希望詹姆斯这次没有再抢我的便宜。’”\n从那时起，梅纳德向数论界提供了充分的证据，证明他不仅仅是世界上最著名的数学家之一的克隆。例如，去年，他和库库洛普洛斯解决了一个有近80年历史的问题，名为达芬-谢弗猜想(Duffin-Schaeffer Conjection)，该猜想询问哪些无限的分母集合产生的分数在逼近无理数方面做得很好。“这只是…某一地区的圣杯。在很长一段时间内都是近似值，“Granville说。\n几年前，梅纳德解决了可能是关于质数的终极问题，这个问题很容易陈述，但很难证明，他证明了无限多的素数没有任何7(或者你可以选择的任何其他数字)。虽然如果你看的是小数字，不带7的数字是很多的，但是当你开始看，比如说，1000位数字时，它们几乎是稀有的，所以要想证明这个稀疏的数字集合包含无限多的质数并不是一件简单的事情。希思-布朗说：“这是人们很长时间以来一直在疑惑的事情，但还没有人接近于证明这一点。”\n这个问题在10个以外的其他基地都是有意义的，梅纳德首先提出了一个非常大的基地的证据。基数越大，证明这类定理就越容易，因为如果你所在的基数有一百万个不同的数字，而不是只有0到9，那么像“没有7”这样的限制就会产生较小的影响。格兰维尔说，梅纳德对大型基地的证明“非常优雅”。\n但是梅纳德开始痴迷于用普通的10进制证明他的定理。“从数学角度看，以10为基数有点武断，但…。这是每个人在日常生活中通常谈论的基地，“他说。\n从100万的基数开始，他不断减少基数，先是减到5000，然后是1000，然后是100。“这几乎成了我自己的一场游戏，关于我能想出一个多么复杂的论点，”他说。“这几乎就像这些投注机或这些在线游戏，每次都会给你一点内啡肽的打击。”\n他在12垒被困了很长一段时间-这段时间足以让他担心最终的目标会逃脱。但最终他到了10垒。他说：“我非常高兴能拖着自己冲过终点线，然后宣布胜利。”\n梅纳德必须发明各种各样的新点子才能到达10垒。“这显示了他作为一名数学家的绝对、非凡、强大的力量，”格兰维尔说。\n这一贡献和其他贡献在数字理论家中引起了能量和期待的嗡嗡声。希思-布朗说：“我不确定目前解析数理论中还有谁能产生更多的兴奋。”\n“人们在想，‘他下一步会做什么？’”他说。“一切似乎都有可能。”", "note_en": "When  James Maynard was three, a health visitor came to his home in Chelmsford, just northeast of London, to check on his development. Such visits were routine for young children, and the assessor led him through a standard battery of tests. There was just one problem: Maynard thought they were stupid.\n So when she gave him a shape-sorting task, he intentionally put the shapes in a surprising order, then explained at length why his solution was more interesting than hers. And when she asked him what kind of animal the cow in his toy farm was, “he really enjoyed telling her that it was ‘sheep-sheep’ and watching her reaction,” wrote his mother, Gill Maynard, in an email. When he decided the assessment had gone on long enough, he declared it finished and pulled out his Legos.\n “It was pretty memorable — a three-year-old demolishing this poor woman,” Gill Maynard said in an interview.\n The assessor told his mother that James lacked discipline. “He’ll have real problems in school if he goes on like this,” she said.\n Similar episodes cropped up throughout Maynard’s school years. There was the time when his physics teacher used a grading rubric Maynard thought was ridiculous: Correct answers without explanations or units earned only a third of the points. In protest, Maynard wrote the answers only, got them all correct, and scored 33%. “I think the teacher was probably pretty fed up with me,” he said.\n “I was definitely one of those annoying kids who would say ‘Why? Why? Why?’ all the time,” Maynard said. He went through his school years “wanting to do my own thing, or at least wanting justifications for things.”\n So perhaps it’s not surprising that in 2013, as a newly minted Ph.D., the 26-year-old Maynard simply shrugged when his postdoctoral adviser warned him off the problem he wanted to pursue, one of the most central questions about prime numbers (those whole numbers divisible only by 1 and themselves).\n  “I kind of said to him, ‘I hope you won’t work on this full time, because I’m really pretty confident you’re going to fail,’” recalled  Andrew Granville, Maynard’s mentor at the University of Montreal at the time.\n But Maynard “still had the courage,” said  Dimitris Koukoulopoulos of the University of Montreal, “and just sat down and said, ‘OK, let me try this idea and see where it takes me.’”\n Where it took him was a  theorem that “prompted a major reevaluation” of how mathematicians think about the spacing between prime numbers, said  Ben Green of the University of Oxford, where Maynard is now a professor.\n Maynard is drawn to questions about prime numbers that are simple enough to explain to a high school student but hard enough to stump mathematicians for centuries. “There’s something very, very appealing to me about the contrast between being simple and fundamental, [and] still being just completely mysterious,” he said.\n There’s an abundance of such questions, but fewer now than before Maynard appeared on the scene. For his early success was not a flash in the pan, but the first in a series of discoveries about prime numbers and related structures. Now seven years past his doctorate, Maynard is already considered one of the world’s leading number theorists.\n He has had a “very steep upward trajectory in becoming a world-respected mathematician,” Green said.\n Granville, who is writing a book on analytic number theory, complained that Maynard has greatly slowed his progress. “I’ve had to add about 150 extra pages because of him,” Granville said.\n  I sat down with Maynard in January at the Joint Mathematics Meetings in Denver, where he had come to receive the Frank Nelson Cole Prize in Number Theory. While this prize is officially awarded for a single notable paper, in Maynard’s case the prize committee couldn’t resist citing three papers, all of which appeared in top mathematics journals.\n He had allocated only a day and a half for his Denver trip, but although we met just an hour after he’d arrived from the U.K., there was a spring in his step. “I’m still going on adrenaline,” he said, with a grin that broadened his narrow, boyish face. “The jetlag hasn’t hit me yet.” He smiled readily during our conversation, except when he had to pose for a snapshot. “People say I’m somehow unable to produce a suitable smile in photos,” he said, with a toothy grimace.\n Time permitting, Maynard planned to wander the city taking photographs. He took up photography a few years ago to feel more connected to the many cities he visits for work, but it has turned into an obsession. “I went to Hong Kong in the summer and I was hiking out to take pictures with a tripod at dawn,” he said, even though normally he’s anything but a morning person.\n  Maynard has always had this obsessive streak, and as a child he passed through distinct dinosaur, geology and astronomy phases. “I’m very bad at being moderately interested in things,” he said. “I somehow have to be obsessive about it or I drop it entirely.”\n Once Maynard becomes interested in a subject, he tends not to stop until he has reached the limit of his abilities, said his father, Chris Maynard. “But he’s not reached that point in mathematics yet. I think that’s, in a sense, what drives him.”\n Even though everyone else in Maynard’s family was oriented toward the humanities — his parents are language teachers and his brother studied history — he always found himself on the path that offered the most mathematics. “At each stage, it just felt like the obvious next step, given how I was feeling at the time,” he said.\n In graduate school at Oxford, his extraordinary mathematical strength became apparent. By the second half of his doctoral studies, said his adviser,  Roger Heath-Brown, their meetings felt more like collaborations than a mentorship. “I’ve never had that feeling with a research student before,” he said.\n By the time Maynard left Oxford for a one-year postdoctoral fellowship at the University of Montreal, he had started mulling over a potential approach to understanding the gaps between prime numbers. As a rule, primes get scarcer as you go out along the number line. But in some ways they also behave like a collection of random numbers, so mathematicians expect them to often be spaced much closer or farther than average. One of the most famous questions in mathematics is the twin primes conjecture, which posits that there are infinitely many pairs of primes that differ by only 2, like 11 and 13.\n  Maynard suspected that it might be possible to make progress on understanding prime gaps using a method for filtering primes described in a paper from about a decade earlier. While mathematicians had already studied the method closely, Maynard thought it should be possible to extract still more juice from it. “I kept doing calculations and computations, and I kept on getting these sort of small signals that there was something there to be understood and discovered,” he said. “I somehow got completely obsessed by it, and I really wanted to keep on going until I could come up with a way of explaining what I’d seen.”\n Granville, his postdoctoral adviser, discouraged Maynard from pursuing this path. “I didn’t really entirely believe it could possibly work, what he was doing,” Granville said. But “James was never really put off by me being very skeptical, in fact — he just laughed at it.”\n Early in Maynard’s explorations, a seismic event occurred in the number theory world. An obscure mathematician named  Yitang Zhang proved, not quite the twin primes conjecture, but the next best thing: He  showed that there are infinitely many pairs of primes that are at most a bounded distance apart (70 million, to be precise). The finding won Zhang instant glory, in the form of multiple job offers (including one from the University of California, Santa Barbara, where he is now on the faculty), invited lectures,  news stories and even a  documentary.\n Meanwhile, Maynard kept working on his own approach to understanding prime gaps, and about six months later, in a flash of insight, he came up with a completely independent, more powerful approach than Zhang’s — it  established that there are infinitely many pairs of primes that differ by at most 600. And Maynard’s approach applied not just to pairs of primes, but to triples, quadruples and bigger collections (with different bounds for each). “The result seemed kind of amazing and too good to be true,” said  Kannan Soundararajan of Stanford University.\n And indeed, when Maynard first figured it out, his euphoria was quickly followed by a wave of fear that he had missed some obvious error. Fortunately, he said, “I feel like I work much more productively when suddenly I get terrified that my result is wrong. … Nothing motivates me quite as much as fear.”\n Granville insisted that Maynard nail down every detail as he wrote up his result. “Nobody’s going to believe you, because nobody’s ever heard of you,” he told Maynard. “You have to write this so well that nobody can argue with you.”\n  Near the end of the process, something happened that might easily strike terror into the heart of a young mathematician: Maynard and Granville learned privately that another mathematician had come up with essentially the same result, in the same time frame. And not just any mathematician, but one of the most prolific and highly regarded mathematicians of the modern era — Fields medalist Terence Tao, of the University of California, Los Angeles. The problem had caught Tao’s eye when he and other mathematicians formed a  massive collaboration to reduce the 70-million bound in Zhang’s proof.\n Tao had been feeling quite proud of his new result when he learned that a little-known 26-year-old had proved the same thing. “And to be honest, the way he wrote it up, he actually had a cleaner result than I did,” Tao said. “He proved slightly stronger statements.” Tao generously refrained from announcing his own work to avoid overshadowing the achievement of such a young mathematician, knowing that if he and Maynard wrote a joint paper, many mathematicians would assume that Tao had done the lion’s share of the creative work.\n It’s easy to imagine an alternative timeline in which Zhang proved his result six months after Maynard instead of six months before (in which case Tao’s explorations would presumably have been delayed or simply forestalled). All the glory would then have accrued to Maynard instead of Zhang. But Maynard doesn’t feel envy at how things played out. “When Zhang proved his result, I was just completely excited,” he said. “The main joy I get is from solving the problem. And so I really didn’t think too much at all about, ‘Oh, if only I had done this slightly differently.’”\n  Maynard often chooses to stroll from home to office without wearing his glasses. The gentle blurring helps him focus on mathematics, but it has sometimes led him to walk right past his partner, Eleanor Grant, without recognizing her. “And there was one time when he thought he saw me and was really, really proud that he’d seen me, and kind of ran up to this person who didn’t look anything like me,” said Grant, a doctor in Oxford.\n Maynard conforms to the stereotype of the absent-minded professor in this and a handful of other ways. For instance, he nearly always wears the same style of clothing, an open-collared white shirt and jeans. “I’m obviously not the most fashion-orientated person,” he wrote in an email. (Once, as a prank, all the mathematicians attending one of his talks showed up wearing the Maynard uniform.)\n But he also belies many of the clichés about introverted mathematicians. Colleagues call him warm, fun-loving and outgoing. Pre-pandemic, he brought his own coffee beans to work and brewed coffee for the other number theorists every day after lunch. And when he spent a semester at the Mathematical Sciences Research Institute in Berkeley a few years ago, the house he shared with two other young mathematicians was the “party house,” Heath-Brown said (though Maynard qualified that to “a party house by mathematician standards”).\n Many of the new generation of number theorists are more social because of Maynard, Granville said. “He’s kind of the center of the group.”\n After Maynard proved his theorem about small gaps between primes, number theorists hastened to apply his insights to other problems. But the biggest success in doing so, to date, has come from Maynard himself, who figured out how to address  large prime gaps as well, improving upon estimates that had previously seen no significant progress in more than 75 years. Maynard’s adaptation of his method to this new scenario “was one of the cleverest tricks I’ve ever seen in number theory,” Granville said.\n  “I would say that anybody would be happy to have proved two theorems of this type over the course of their career,” Soundararajan said of Maynard’s results on small and large prime gaps. “The fact that he did it after he’d just finished grad school is quite remarkable.”\n In a disconcerting echo of the small-gaps story, Tao once again came up with roughly the  same result at roughly the same time (though on this occasion he collaborated with Green and two other co-authors). Since then, Maynard and Tao’s tendency to come up with similar results has become a running joke in the number theory community. When Tao solved another  long-standing number theory problem a year or two later, “I remember being very paranoid,” he said, “and just asking Andrew [Granville], ‘I really hope James hasn’t scooped me again this time.’”\n Since then, Maynard has given the number theory community ample proof that he is more than just a clone of one of the most famous mathematicians in the world. Last year, for instance, he and Koukoulopoulos  settled a nearly  80-year-old question called the Duffin-Schaeffer conjecture that asks which infinite collections of denominators produce fractions that do a good job of approximating irrational numbers. “It’s just been the holy grail in a certain area of … approximation for a long time,” Granville said.\n And a few years ago, Maynard tackled perhaps the ultimate easy-to-state but hard-to-prove question about prime numbers,  proving that there are infinitely many primes that don’t have any 7s (or any other digit you might choose). While numbers without any 7s are plentiful if you’re looking at small numbers, they are almost vanishingly rare when you start looking at, say, 1,000-digit numbers, so showing that this sparse number set contains infinitely many primes is no simple matter. “This is something that people have wondered about for a long, long time, and no one got anywhere close to proving,” Heath-Brown said.\n This question makes sense in other bases besides 10, and Maynard started by coming up with a proof for very large bases. The bigger the base, the easier it is to prove a theorem of this sort, since if you’re in a base with, say, a million different numerals instead of just 0 to 9, a restriction like “no 7s” has a smaller impact. Maynard’s proof for large bases was “very elegant,” Granville said.\n But Maynard became obsessed with proving his theorem in ordinary base 10. “Base 10 is somewhat arbitrary from a mathematical point of view, but … it’s the base that everyone talks about normally in daily life,” he said.\n Starting with base 1,000,000, he kept reducing the base, first to 5,000, then 1,000, then 100. “It became almost a game with myself about how sophisticated an argument could I come up with,” he said. “It was almost like these betting machines or these games online that give you a little endorphin hit each time.”\n  He got stuck on base 12 for a long time — long enough to worry that the final goal would elude him. But eventually he made it to base 10. “I was very happy to just about drag myself over the line and then declare victory,” he said.\n Maynard had to invent all kinds of new ideas to get to base 10. “This shows his utter, extraordinary, powerful strength as a mathematician,” Granville said.\n This contribution and the rest have created a buzz of energy and anticipation among number theorists. “I’m not sure there’s anyone else in analytic number theory at the moment that I would think is generating more excitement,” Heath-Brown said.\n “People are wondering, ‘What’s he going to do next?’” he said. “Everything seems possible.”", "posttime": "2020-07-02 02:01:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "问题,theorist,梅纳德", "title": "解决最难、最简单问题的数论家", "title_en": "A Number Theorist Who Solves the Hardest Easy Problems", "transed": 1, "url": "https://www.quantamagazine.org/james-maynard-solves-the-hardest-easy-math-problems-20200701/", "via": "", "real_tags": ["问题", "theorist", "梅纳德"]}, {"category": "", "categoryclass": "", "imagename": "297be0db6f2dcc9f5d7b42160cba89df.jpg", "infoid": 1009325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就目前而言，这就是全部了。你知道哪个网站应该在这个名单上吗？\n提交吧！", "note_en": "That&#39;s all of them - for now. Know a site that should be on this list?\n Submit it!", "posttime": "2020-07-02 02:00:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,website", "title": "异想天开的网站俱乐部", "title_en": "The Whimsical Website Club", "transed": 1, "url": "https://whimsical.club/", "via": "", "real_tags": ["网站", "website"]}, {"category": "", "categoryclass": "", "imagename": "d357a1132584544d1d85210dbd6678ca.jpg", "infoid": 1009324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国参议院正在推进对强大加密构成威胁的立法，强加密是数字安全的基石。\n虽然支持这项法案的参议员们可能是出于好意，但他们对这项提案的影响却被严重误导了。他们将这项法案命名为消除滥用和猖獗忽视互动技术法案(GAIN IT Act)。加密可确保我们的信息(从敏感的财务和医疗细节到电子邮件和短信)受到保护。但是，“赚取IT法案”将为政府行为者开辟一条广阔的道路，严重破坏强大的加密，使我们的信息处于危险之中。这就是为什么Mozilla加入其他几十个互联网健康和公民社会组织的行列，呼吁美国国会对“赚取IT法案”投反对票。\n在遏制在线儿童性虐待材料(CSAM)的幌子下，该法案威胁到在线安全以及为用户生成内容提供便利的平台。它要求在线平台做出选择，要么做出选择，要么放弃让互联网成为创作者充满活力的环境的法律保护。“最佳做法”将由司法部长威廉·巴尔(William Barr)领导的一个未经选举产生的委员会决定，似乎有可能阻碍强大的加密。人权、言论自由、数字隐私和安全的倡导者都同意，这项立法是解决真正问题的严重误导的尝试。我们需要确保国会认识到“赚取IT法案”是错误的解决方案，并投票反对该法案。除了对加密的偷袭外，“赚取IT法案”还威胁到第230条，这项法律保护平台对其用户发布的内容承担特定类型的责任。自1996年以来，第230条通过遏制法律行动的威胁，鼓励了互联网的增长。但“赚取IT法案”将创建一个未经选举产生的委员会，由执法部门主导，由司法部长巴尔领导，为在线平台和服务编写定义不清的“最佳实践”，并将其迅速纳入法律。虽然对现行法律责任制度的改革可能值得考虑，但将空白支票交给律政司并不是进行这些改革的正确方法。“赚取IT法案”的支持者拒绝在提案文本中增加对加密的保护，也拒绝将其置于委员会“最佳实践”的范围之外，明确表示该法案实际上只是一种偷偷摸摸的方式，目的是进行一场被误导的反对加密的战争。更重要的是，该委员会将由司法部长巴尔领导，巴尔有进行非法大规模监控的历史，他已经明确表示，他希望获得一个政府密钥来破解加密，这让他有更多的筹码向平台施压，要求破解加密。\n我们都同意剥削儿童是可怕的，但“赚取IT法案”是一个危险的提议，对开放的互联网弊大于利。在提交给国会的请愿书上签名，反对这种隐蔽的加密攻击。", "note_en": "The U.S. Senate is advancing legislation that creates a threat to strong encryption, the bedrock of digital security.\n While the senators championing the bill, which they’ve named the Eliminating Abusive and Rampant Neglect of Interactive Technologies Act (EARN IT Act), may have good intentions, they are seriously misguided about the impact of their proposal.   Encryption ensures our information, from our sensitive financial and medical details to emails and text messages, is protected. But the EARN IT Act will create a broad path for government actors to seriously undermine strong encryption, putting our information at risk.  That’s why Mozilla is joining dozens of other internet health and civil society organizations in calling on the U.S. Congress to vote no on the EARN IT Act.\n    Under the guise of curbing online child sexual abuse material (CSAM), the bill threatens online security as well as the platforms that facilitate user generated content. It asks online platforms to make the choice between potentially onerous “best practices” – which will be determined by an unelected commission headed by Attorney General William Barr and seem likely to obstruct strong encryption – or giving up the legal protections that have made the internet a vibrant environment for creators.   Advocates for human rights, free speech and digital privacy and security all agree that this legislation is a seriously misguided attempt to address a real problem. We need to make sure that Congress sees that the EARN IT Act is the wrong solution and votes against the bill.   In addition to a sneak attack on encryption, the EARN IT Act also threatens Section 230, the law that protects platforms from certain kinds of liability for content posted by their users.  Since 1996, Section 230 has encouraged internet growth by keeping the threat of legal action at bay. But the EARN IT Act would create an unelected commission, dominated by law enforcement and led by Attorney General Barr, to write ill-defined “best practices” for online platforms and services that would be fast-tracked into law. While reforms to the current liability regime may be worth considering, handing a blank check to the Attorney General is not the right approach to those reforms.   Supporters of the EARN IT Act have refused to add protection for encryption in the text of the proposal, or to place it outside the scope of the commission’s “best practices,” making it clear that the bill is actually just a sneaky way to pursue a misguided war against encryption. What’s more, the commission would be led by Attorney General Barr, who has a history of conducting illegal mass surveillance and who has made it clear that he wants a government key to break encryption, giving him even more leverage to pressure platforms to break encryption.\n We all agree that child exploitation is horrific, but the EARN IT Act is a risky proposition that would do more harm than good to the open internet.   Sign the petition to Congress opposing this veiled attack on encryption.", "posttime": "2020-07-02 02:00:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "赚取,earn,法案", "title": "反对“赚取IT”法案", "title_en": "Oppose the Earn IT Act", "transed": 1, "url": "https://foundation.mozilla.org/en/campaigns/oppose-earn-it-act/", "via": "", "real_tags": ["赚取", "earn", "法案"]}, {"category": "", "categoryclass": "", "imagename": "b793bd083f603740c73e15ae44a479cd.png", "infoid": 1009323, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我也很幸运早早地阅读了@Coding_Career，我完全被打动了！这是我刚开始从事开发工作时希望拥有的那本书。\n我希望我换工作的时候有这本书。它帮助你了解你应该利用哪些技能，并真正鼓励你不要低估自己！\n指向高价值博客文章的链接已经让这本书物有所值，更不用说肖恩提供的令人惊叹的洞察力和背景了。必须购买#CodeNewbies希望打入或高级工程师寻求增长！\n哇!。在“编程职业手册”中分享的知识和经验的巨大财富怎么夸张都不为过。我喜欢肖恩能够将自己的经历和他在他人职业生涯中观察到的东西概括为有助于他人提升自己职业生涯的原则。五星级⭐。\n对于那些寻求程序员职业建议，但厌倦了被告知必须做X或永远不做Y的人，肖恩分享了他在这些有时势不可挡的水域中航行的个人经验和知识，希望你能找到一些有用的东西。这就像你口袋里有一位体贴的大哥！(如果你在手机上阅读)。\n我喜欢他提供的关于职业倦怠的信息，因为这是新开发人员在职业生涯早期遇到的最大障碍之一。Shawn包含了许多来自其他内容创建者的精彩资源和图表的链接。关于谈判的部分是我在职业生涯早期就可以用到的。\n肖恩谈到了经验丰富的工程师和管理人员通过艰苦的方式学到的东西，或者通过已经制作出来的东西--但方式是所有经验层次的人都能接触到。直到现在才有人谈论的事情！\n我正在通读swyx的@Coding_职业生涯，我真的印象深刻。这本书很厚，但读起来很清淡。对于进入这个行业的人来说，有很多有用的背景信息。\n这本书可以取名为“Hacker News：The Good Parts”(这本书的书名可能是最好的，我是真心的)&“黑客新闻”，所有基于经验的职业成功建议，没有一句有毒的废话。\n我该怎么办？告诉我该怎么做！关于如何成为一名程序员，没有一个正确的答案，更不用说一个快乐而成功的程序员了。然而，有数以千计的故事是关于人们如何自己破解编码职业的！肖恩已经把他的故事组合在一起，并提供了大量实用的现实世界的建议！忠告最棒的地方是什么？你不必吃药。编程职业手册是一本精彩的集合，它收集了哪些工作有效，哪些工作可能不适合您！无论你是编程新手还是像我一样的老程序员，这些指导方针和策略都可以融入到你的编程生活和职业生涯中--学习如何成为一名伟大的程序员永远不会太晚！", "note_en": "I was also lucky enough to read @Coding_Career early and I was thoroughly blown away! It’s the book I wish I had when I started my dev career.\n I wish I had this book when I was switching jobs. It helps you understand what skills you should leverage and really encourages you not underlevel yourself!\n The links to high-value blog posts already make the book worth it, never mind the amazing insight and context provided by Shawn. Must buy for #CodeNewbies looking to break in or senior engineers looking to grow!\n Wow! The immense wealth of knowledge and experience shared in &#34;The Coding Career Handbook&#34; cannot be overstated. I love how Shawn is able to take his own experience and what he&#39;s observed in the careers of others and generalize it to principles that will help others level up their own careers. 5 stars ⭐⭐⭐⭐⭐\n For anyone looking for career advice as a coder but is tired of being told they have to do X or never do Y. Shawn is sharing his personal experiences and knowledge of navigating these sometimes overwhelming waters in the hopes you might find something useful. It&#39;s like having a caring big brother in your pocket! (if you read on your phone)\n I love that he included information about burnout as this is one of the biggest hurdles new developer encounter early in their career. Shawn has included links to many wonderful resources and graphs from other content creators. The section on negotiation is one I could have used early on in my career.\n Shawn talks about things that experienced engineers and managers learn &#34;the hard way&#34; or by having &#34;already made it&#34; -- but in a way that is accessible for people at all levels of experience. Things that NO ONE talks about, until now!\n I’m reading through swyx’s @Coding_Career and I’m genuinely impressed. It’s very dense but reads very lightly. Lots of useful context for someone coming into the industry.\n The book could&#39;ve been called (and I mean this in the best possible way, I really do) &#34;Hacker News: The Good Parts.&#34; All the experience-based advice for career success, none of the toxic nonsense.\n What should I do? Just tell me what to do! There&#39;s no One Right Answer for how to become a coder, much less a happy and &#34;successful&#34; one. What there is, however, are thousands of stories of how folks have cracked the coding career themselves! Shawn has put together his story, with a ton of practical and pragmatic real world advice! The great thing about advice? You don&#39;t have to take it. The Coding Career Handbook is a wonderful collection of what&#39;s worked and what may not work for you! These are guidelines and tactics that you can incorporate into your coding life and career whether you&#39;re a code newbie or a code oldie like me - it&#39;s never too late to learn how to be a great programmer!", "posttime": "2020-07-02 01:59:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "职业,career,职业生涯", "title": "编码职业手册", "title_en": "Coding Career Handbook", "transed": 1, "url": "https://www.learninpublic.org/?from=Hacker%20News", "via": "", "real_tags": ["职业", "career", "职业生涯"]}, {"category": "", "categoryclass": "", "imagename": "d67866f29c1ff54fc44836d16a794007.jpg", "infoid": 1009322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，美国的医生几乎没有试图挽救早产儿的生命，但有一个痛苦的父母可以求助的地方-科尼岛的一个杂耍节目。克莱尔·普伦蒂斯(Claire Prentice)写道，在这里，一个人拯救了数千人的生命，并最终改变了美国医学的进程。\n20世纪初，前往科尼岛的游客可以看到一些非同寻常的景点。从菲律宾运来的一个部落，侏儒村庄，由包括双方退伍军人在内的1000名士兵重演布尔战争，以及不畏死亡的过山车。但从1903年到1943年的40年间，美国首屈一指的游乐园也是一场真正的生死之争的家园，在海浪边上演。\n马丁·科尼的婴儿孵化器设施是科尼岛最受欢迎的展品之一。入口处上方的牌子上写着“全世界都爱一个婴儿”。在里面，早产儿在一群敬业的医务人员的照顾下，为自己的生命而战。去看婴儿，你付了25美分。一道护栏防止参观者过于接近孵化器中的微小人物。\n为什么早产儿，现在应该在新生儿病房里照顾的人，被展示成娱乐节目呢？\n负责展览的人是马丁·科尼(Martin Couney)，他被称为孵化器医生-尽管他在杂耍表演中执业，但他的操作是尖端的。\nCouney雇佣了一组住在现场的护士和奶妈，还有两名当地医生。\n在当时的美国，许多医生认为早产儿在基因上处于劣势，他们的命运是上帝的事。如果不进行干预，绝大多数早产婴儿注定会死亡。\n科尼不太可能是医学上的先驱。他既不是一所名牌大学的教授，也不是一家教学医院的外科医生。他是一名德裔犹太移民，受到医疗机构的冷落，被许多人谴责为自我宣传者和江湖骗子。\n但对于他救下的孩子的父母，以及蜂拥而至观看他的节目的数百万人来说，他是一个奇迹创造者。\n克莱尔·普伦蒂斯(Claire Prentice)将于5月24日(星期二)上午11点做客BBC第四电台“玻璃下的生活”。\n克莱尔·普伦蒂斯(Claire Prentice)是“科尼岛奇迹”(Miracle At Coney Island)一书的作者。\nCouney使用的孵化器是直接从欧洲进口的最新型号-法国当时是早产儿护理方面的世界领先者，而美国落后了几十年。\n每个孵化器都超过5英尺(1.5米)高，由钢铁和玻璃制成，用腿站立。外面的热水器向婴儿睡觉用的细网床下面的管道供应热水，而恒温器则调节温度。另一根管道将新鲜空气从大楼外输送到保温箱，首先通过悬浮在防腐剂或含药水中的吸收性羊毛，然后通过干燥的羊毛，过滤杂质。在顶部，一个带有旋转风扇的烟囱状装置将排出的空气向上吹出孵化器。\n照顾早产儿的费用很高。1903年，在Couney的设施中照顾每个婴儿每天的费用约为15美元(现在是405美元或277 GB)。\n但是Couney没有向父母收取一分钱的医疗费-公众支付。它们的数量如此之多，以至于Couney轻松支付了他的运营成本，向他的员工支付了丰厚的工资，并有足够的剩余资金开始策划更多的展览。随着时间的推移，这些使Couney成为了一个有钱人。\nCouney认为他的工作不仅是拯救早产儿的生命，还代表他们进行倡导。他发表演讲，背诵那些早产并取得伟大成就的名人的名字，如马克·吐温、拿破仑、维克多·雨果、查尔斯·达尔文和艾萨克·牛顿爵士。\n他在科尼岛维持了40年的设施，并于1905年在大西洋城建立了类似的设施，他也一直经营到1943年。多年来，他把他的节目带到了其他游乐园，以及美国各地的世界博览会和博览会。\n虽然他在美国成名致富，但他是在欧洲第一次尝到了表演演员的滋味。1897年，他在伯爵宫殿的维多利亚时代展览上展出了孵化器，它们轰动一时。仅开幕当天就有约3600人参观了这场展览，英国医学杂志“柳叶刀”(The Lancet)对此给予了热情洋溢的评价。\n次年，Couney在内布拉斯加州奥马哈举行的跨密西西比和国际博览会上首次在美国亮相。感觉到像他这样的人在美国展出的巨大机会，那里总是有博览会或世博会在哪里举行，Couney移民了。\n从1903年开始，科尼岛是他的主要基地，但他根据工作需要在全国各地旅行。\n1907年，他的妻子生下了一个女儿，希尔德加德，早产6周，体重只有3磅-希尔德加德后来接受护士培训，加入了她父亲的生意。\n1950年考利去世，享年80岁。“纽约时报”以讣告纪念他的逝世。\nCouney的技术在当时是先进的，包括他对母乳的重视和对卫生的严格要求。但他的一些方法是非传统的。大多数医院医生认为，应该将与早产儿的接触保持在最低限度，以降低感染的风险。但是Couney鼓励他的护士们把婴儿从保育箱里抱出来拥抱和亲吻他们，相信他们是对爱的回应。\n科尼急于与科尼岛更古怪的元素保持距离，他强调他的设施是一家微型医院，而不是一个杂耍景点。护士们穿着上浆的白色制服。他和医生们都穿着西装，上面穿着医生的白大褂。\n孵化器设施总是被擦洗得一尘不染。科尼雇了一名厨师为他的奶妈准备有营养的饭菜。如果有人被发现抽烟、喝酒或在热狗上吃零食，他会立即解雇他们。\n然而，科尼本人并不反对采用一些表演者的策略。他指示护士们给婴儿穿上几个尺码太大的衣服，以致于无法强调他们有多小。在他们裹着的衣服中间系了一个大蝴蝶结，进一步增加了效果。\n尽管他的工作挽救了生命，但儿童慈善机构、医生和卫生官员指责这位孵化器医生剥削婴儿，并通过展示他们的生命来危及他们的生命。经常有人试图关闭他。\n但是随着时间的推移，Couney拯救生命的记录和他明显的真诚，开始吸引主流医学世界的支持者。1914年，当科尼在芝加哥展出时，他遇到了当地的儿科医生朱利叶斯·赫斯(Julius Hess)，他后来被称为美国新生儿学之父。这是一段终生友谊的开始，也是一段重要的职业关系的开始。这两个人在1933/34年的芝加哥世界博览会上一起经营着一个婴儿孵化器设施。\n一些医生开始将婴儿送到Couney，这最终是对婴儿在他的设施中接受的护理质量的默许。\n在他近半个世纪的职业生涯中，他声称拯救了近6500名婴儿，成功率为85%。\n马丁·科尼是个令人难以置信的人，他应该因他的所作所为而出名。\n然而，美国的医院在为早产儿建立自己的专用设施方面进展缓慢。在科尼将他的节目带到科尼岛36年后，东海岸的第一个人于1939年抵达纽约。\n在一篇回顾1939年Couney在“纽约客”漫长职业生涯的文章中，传奇记者A·J·利布林指出：在这一领域没有足够经验的医生和护士可供选择。把早产儿当作私人病人照顾是非常昂贵的。妈妈的牛奶…每天6美元。租用保育箱和病房，氧气，医生一天看几次，三班倒护士每天15美元。\n纽约最好的医学头脑想不出一个可行的模式来拯救这些脆弱的婴儿。然而，40年前，一位几乎没有经验的欧洲年轻移民就是这样做的。\n今天，Couney的遗产正在接受医生的重新检查，许多Couney的婴儿都自豪地为他辩护。\n卡罗尔·博伊斯·海尼施1942年早产，被带到科尼在新泽西州大西洋城的展览上。马丁·科尼是个令人难以置信的人。他应该因他的所作所为而出名。他救了我们数千人，她说。她仍然有一条粉色珠子制成的身份项链，上面用白色珠子写着她的名字，这是她在孵化器设施中得到的。\n另一个婴儿贝丝·艾伦(Beth Allen)1941年在布鲁克林早产三个月，她说，没有其他人主动提出要做任何事情来拯救我。当一位医生建议她的父母带她去科尼岛时，她的母亲拒绝了，坚称她的女儿是个怪胎。科尼来到医院，说服她的父母让他照顾她。每年父亲节，她的父母都会带她去看康尼。1950年，当他去世时，他们参加了他的葬礼。她说：如果没有马丁·科尼，我就不会有这样的生活。\n纽约科恩儿童医学中心(Cohen Children‘s Medical Center of New York)和诺斯韦尔健康公司(Northwell Health)的新生儿服务部主任理查德·尚勒博士(Dr.Richard Schanler)指出，今天，展示早产儿并向参观者收费是不道德的。但你必须回想一下那段时间，他说。\n如今，当新技术问世时，我们会进行随机对照试验。他们当时并没有这样做，所以这些节目是展示使用孵化器…的好处的一种方式。我们对康尼和他所做的工作感激不尽。\n订阅BBC新闻杂志的电子邮件时事通讯，将文章发送到你的收件箱。", "note_en": "For years doctors in the US made little attempt to save the lives of premature babies, but there was one place distressed parents could turn for help - a sideshow on Coney Island. Here one man saved thousands of lives, writes Claire Prentice, and eventually changed the course of American medical science.\n In the early years of the 20th Century, visitors to Coney Island could see some extraordinary attractions. A tribe transported from the Philippines, &#34;midget villages&#34;, a re-enactment of the Boer War by 1,000 soldiers including veterans from both sides, and death-defying roller coaster rides. But for 40 years, from 1903 to 1943, America&#39;s premier amusement park was also home to a genuine life-and-death struggle, played out beside the surf.\n Martin Couney&#39;s Infant Incubator facility was one of Coney Island&#39;s most popular exhibits. &#34;All the World Loves a Baby&#34; read a sign above the entrance. Inside, premature babies fought for their lives, tended by a team of dedicated medical staff. To see the babies, you paid 25 cents. A guard-rail prevented visitors getting too close to the tiny figures encased in incubators.\n Why were premature babies, who would now be cared for in a neonatal ward, displayed as entertainment?\n  The man who ran the exhibit was Martin Couney, dubbed &#34;the incubator doctor&#34; - and although he practised in the sideshows, his operation was cutting-edge.\n  Couney employed a team of nurses and wet nurses who lived onsite, along with two local physicians.\n  In America, many doctors at the time held the view that premature babies were genetically inferior &#34;weaklings&#34; whose fate was a matter for God. Without intervention, the vast majority of infants born prematurely were destined to die.\n Couney was an unlikely medical pioneer. He wasn&#39;t a professor at a great university or a surgeon at a teaching hospital. He was a German-Jewish immigrant, shunned by the medical establishment, and condemned by many as a self-publicist and charlatan.\n But to the parents of the children he saved, and to the millions of people who flocked to see his show, he was a miracle-worker.\n    Claire Prentice presents  Life Under Glass on BBC Radio 4 on Tuesday 24 May at 11:00\n  Claire Prentice is the author of a book about Martin Couney,  Miracle at Coney Island\n  The incubators Couney used were the latest models, imported directly from Europe - France was then the world leader in premature infant care with the US lagging several decades behind.\n Each incubator was more than 5ft (1.5m) tall, made of steel and glass, and stood on legs. A water boiler on the outside supplied hot water to a pipe running underneath a bed of fine mesh on which the baby slept, while a thermostat regulated the temperature. Another pipe carried fresh air from outside the building into the incubator, first passing through absorbent wool suspended in antiseptic or medicated water, then through dry wool, to filter out impurities. On top, a chimney-like device with a revolving fan blew the exhausted air upwards and out of the incubators.\n Caring for premature babies was expensive. In 1903, it cost about $15 a day ($405 or £277 today) to care for each baby in Couney&#39;s facility.\n But Couney did not charge the parents a penny for their medical care - the public paid. They came in such numbers that Couney easily covered his operating costs, paid his staff a good wage and had enough left over to begin planning more exhibits. In time, these made Couney a wealthy man.\n    Couney saw his job as not only to save the lives of the premature babies, but also to advocate on their behalf. He gave lectures reciting the names of famous men who had been born prematurely and gone on to achieve great things, such as Mark Twain, Napoleon, Victor Hugo, Charles Darwin, and Sir Isaac Newton.\n He maintained his facility for 40 years at Coney Island, and set up a similar one at Atlantic City in 1905, which he also ran until 1943. Over the years he took his show to other amusement parks, and to World&#39;s Fairs and Expositions across America.\n Although he made his name and his fortune in America, it was in Europe that Couney got his first taste of life as a showman. In 1897 he exhibited incubators at the Victorian Era Exhibition in Earls Court and they were a huge hit. Some 3,600 people visited the show on opening day alone, and the British medical journal, The Lancet, gave it a glowing write-up.\n The following year, Couney made his American debut at the Trans-Mississippi and International Exposition in Omaha, Nebraska. Sensing the huge opportunities for someone like him to exhibit in America, where there was always a fair or an expo taking place somewhere, Couney immigrated.\n From 1903, Coney Island was his main base but he travelled around the country as work demanded.\n    1907 His wife gives birth to a daughter, Hildegarde, born six weeks premature, weighing just 3lb - Hildegarde later trained as a nurse and joined her father&#39;s business\n 1950 Couney dies at the age of 80. His death is marked with an obituary in the New York Times\n  Couney&#39;s techniques were advanced for the time, including his emphasis on breast milk and his strictness about hygiene. But some of his methods were unconventional. Most hospital doctors believed that contact with premature babies should be kept to a minimum to reduce the risk of infection. But Couney encouraged his nurses to take the babies out of the incubators to hug and kiss them, believing they responded to affection.\n Eager to distance himself from Coney Island&#39;s more freakish elements, Couney stressed that his facility was a miniature hospital, not a sideshow attraction. The nurses wore starched white uniforms. He and the doctors wore suits topped with physician&#39;s white coats.\n The incubator facility was always scrubbed spotlessly clean. Couney employed a cook to prepare nutritious meals for his wet nurses. If any were discovered smoking, drinking alcohol or snacking on a hot dog, he would fire them immediately.\n  Yet Couney was not averse to adopting a few showman&#39;s tactics himself. He instructed the nurses to dress the babies in clothes several sizes too large to emphasize how small they were. A big bow tied around the middle of their swaddling clothes further added to the effect.\n Despite his life-saving work, children&#39;s charities, physicians and health officials accused the incubator doctor of exploiting the babies and endangering their lives by putting them on show. There were regular attempts to shut him down.\n  But as time passed, Couney&#39;s track record of saving lives, and his evident sincerity, began to attract supporters from the world of mainstream medicine. In 1914, while exhibiting in Chicago, Couney met a local paediatrician, Julius Hess, who would go on to become known as the father of American neonatology. It was the beginning of a lifelong friendship and an important professional relationship. The two men ran an infant incubator facility together at the 1933/34 Chicago World&#39;s Fair.\n Some physicians began sending babies to Couney, a tacit acknowledgement at last of the quality of care the babies received in his facility.\n In a career spanning nearly half a century he claimed to have saved nearly 6,500 babies with a success rate of 85%.\n Martin Couney was an incredible man - he should be famous for what he did\n Hospitals in the US were slow to establish their own dedicated facilities for premature babies, though. The first on the Eastern seaboard arrived in New York in 1939, 36 years after Couney brought his show to Coney Island.\n In an article reflecting on Couney&#39;s long career in the New Yorker in 1939, the legendary journalist A J Liebling noted: &#34;There are not enough doctors and nurses experienced in this field to go around. Care of prematures as private patients is hideously expensive... six dollars a day for mother&#39;s milk… rental of an incubator and hospital room, oxygen, several visits a day by a physician, and fifteen dollars a day for three shifts of nurses.&#34;\n The best medical minds in New York couldn&#39;t come up with a workable model to save these vulnerable babies. Yet, 40 years earlier, a young immigrant from Europe with little in the way of experience had done just that.\n Today Couney&#39;s legacy is being re-examined by doctors, and many of Couney&#39;s &#34;babies&#34; speak proudly in his defence.\n Carol Boyce Heinisch was born prematurely in 1942 and taken to Couney&#39;s exhibit in Atlantic City, New Jersey. &#34;Martin Couney was an incredible man. He should be famous for what he did. He saved thousands of us,&#34; she says. She still has the identity necklace made of pink beads, with her name in white beads, which she was given in the incubator facility.\n  &#34;Nobody else was offering to do anything to save me,&#34; says another of the babies, Beth Allen, who was born three months premature in Brooklyn in 1941. When a physician suggested her parents take her to Coney Island, her mother refused, insisting her daughter wasn&#39;t &#34;a freak&#34;. Couney came to the hospital and persuaded her parents to let him care for her. Every Father&#39;s Day, her parents took her to see Couney. When he died, in 1950, they attended his funeral. &#34;Without Martin Couney I wouldn&#39;t have had a life,&#34; she says.\n Today it would be considered unethical to exhibit premature babies and charge fairgoers to see them, notes Dr Richard Schanler, director of Neonatal Services at Cohen Children&#39;s Medical Center of New York and Northwell Health. &#34;But you have to think back to that time,&#34; he says.\n &#34;Nowadays when new technology comes out we do randomised controlled trials. They didn&#39;t do those back then so the shows were a way of demonstrating the benefit of using incubators… We owe a lot to Couney and the work he was doing.&#34;\n Subscribe to the  BBC News Magazine&#39;s email newsletter  to get articles sent to your inbox.", "posttime": "2020-07-02 01:59:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "男子,saved,couney", "title": "一名男子拯救了一代早产儿(2016)", "title_en": "One man saved a generation of premature babies (2016)", "transed": 1, "url": "https://www.bbc.co.uk/news/magazine-36321692", "via": "", "real_tags": ["男子", "saved", "couney"]}, {"category": "", "categoryclass": "", "imagename": "0adefa74dc15520fa547a940e9f1e2cc.jpeg", "infoid": 1009321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "约翰·史密斯在最近的一个星期三很早就开始购物，几天没停过。\n他参观了一个汽车供应点，在那里他给他的手推车装上了更换的转向灯操纵杆、紧急频闪灯和其他20多种物品。他跳到一家家居用品商家那里，买了另外10件东西，包括木质相框、地址牌匾、毛巾架和邮箱。他从一家销售芬兰等地流行的婴儿睡箱的网站订购了每种婴儿捆绑包中的一种，从大约80美元到近500美元不等。\n..。", "note_en": "John Smith started shopping early on a recent Wednesday and didn’t stop for days.\n  He visited an auto-supply site where he loaded his cart with a replacement turn-signal lever, emergency strobe light and two dozen other items. He hopped over to a home-goods merchant for another 10 items including wood picture frames, address plaques, a towel rack and mailbox. He ordered one of every kind of baby bundle, ranging from about $80 to nearly $500, from a site that sells infant sleeping boxes popular in places such as Finland.\n...", "posttime": "2020-07-02 01:59:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "留下,shopper,婴儿", "title": "留下数千辆在线购物车的神秘购物者是谁？", "title_en": "Who Is the Mystery Shopper Leaving Behind Thousands of Online Shopping Carts?", "transed": 1, "url": "https://www.wsj.com/articles/who-is-the-mystery-shopper-leaving-behind-all-those-online-shopping-carts-11593617464", "via": "", "real_tags": ["留下", "shopper", "婴儿"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1009319, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于安装Fedora的笔记本电脑和工作站，我们希望以透明的方式向用户提供文件系统功能。我们希望添加新功能，同时减少处理磁盘空间不足等情况所需的专业知识。Btrfs通过设计哲学很好地适应了这一角色，让我们将其作为默认设置。\n对于新安装，Fedora桌面版/Spin变体将在默认情况下切换到使用Btrfs作为文件系统。从这些变体派生的实验室继承了此更改，其他版本可能会选择加入此更改。\n此更改基于安装程序的自定义分区Btrfs预设。它已经经过7年的良好测试了。\n挂载于/的当前分区VG/root LV和挂载于/home的VG/home LV。这些是单独的文件系统卷，具有单独的可用/已用空间。\n建议对挂载在/上的根子卷和挂载在/home上的HOME子卷进行分区。子卷没有大小，它们的作用主要像目录一样，空间是共享的。\n未更改的/boot将是一个较小的ext4卷。需要单独的引导来引导dm-crypt sysroot安装；无论sysroot是否加密，保持布局不变都比较简单。将不会有自动快照/回滚。\n如果您选择加密数据，仍然会像现在一样使用Luk(dm-crypt)(只是使用了Btrfs而不是LVM+ext4)。上游的工作是为Btrf提供原生加密，一旦准备就绪，将在未来的Fedora版本中提出不同的更改建议。\n上面的详细描述就是提案。它的目的是成为一种极简主义和透明的开关。它也与Fedora 16的建议(和接受)相同。以下优化改进了建议，但不是关键的。它们对大多数用户也是透明的。总体思路是先同意基本提案，然后再将其视为增强功能。\n优势：可以包含在快照和回滚机制中。GRUB对Btrfs的稳定支持已超过10年。\n范围：取决于引导加载程序和安装程序团队的审查和批准。blivet应该使用mkfs.btrfs--Mixed。\n优势：通过减少写入放大，节省空间并显著延长基于闪存的介质的使用寿命。在某些情况下，它可能会提高性能。\n范围：取决于安装人员团队的审查和批准，以增强anaconda以使用mount-o compress=zstd执行安装，然后为每个目录设置适当的XATTR。只有通过基于rsync、rpm或unsquashfs的安装创建目录后，才能设置XATTR。\n优势：更容易从快照、回滚和发送/接收中排除它们。(Btrfs快照不是递归的，它在嵌套的子卷上停止。)。\n作用域：蟒蛇已经知道如何做到这一点，只需更改kickstart以添加额外的子卷(减去~/中的子卷即可。GNOME盒需要增强才能检测用户主目录是否在Btrfs上，并创建~/.local/share/gnome-box/images/作为子卷。\n红帽在许多方面都很好地支持费多拉。但Fedora已经与上游密切合作，并依赖于上游。这将是其中之一。这是这项建议的一个重要考虑因素。确保它得到支持对社区有利害关系。如果Fedora拒绝Btrf，RedHat将永远不会支持它。软呢帽必然需要是第一个，并提出有说服力的理由，即它比其他选择解决了更多的问题。功能所有者毫不犹豫地相信它是这样的。\nBtrfs社区的用户在过去十年的大部分时间里都在大规模使用它。自2014年以来，它一直是openSUSE(和SUSE Linux Enterprise)的默认设置，Facebook在其数据中心将其用于所有操作系统和数据卷的时间几乎与此相当。Btrfs是一个成熟的、易于理解且经过战斗测试的文件系统，可用于桌面/容器和服务器/云使用案例。我们确实有Btrfs文件系统的开发人员维护和支持Fedora中的代码，其中一个是更改所有者，因此固定在Btrfs上的问题可以快速解决。\nDM-Thin(精简资源调配)：[问题#152仍然发生，因为默认情况下安装程序赢得了资源调配。用户仍需要手动干预才能识别和解决问题。在DM-Thin上增长文件系统时，池会过度使用，文件系统大小成为幻想：它们加起来不等于可用物理存储总量。已用空间和可用空间的真实情况仅由精简池知道，CLI和GUI程序没有为此做好准备。像rpm空闲空间检查或GNOME磁盘空间警告这样的集成点也必须进行调整。\nDM-VDO：尚未合并，并且不像在/var/lib/flatpaks/上使用chattr+c在Btrfs上有选择地启用每个目录和每个文件那样简单。\nBtrfs解决了需要解决的问题，对用户几乎没有副作用或陷阱。它有更多我们可以立即、透明地利用的功能：压缩、完整性和IO隔离。许多Btrfs特性和优化可以根据目录或文件有选择地选择，例如压缩和nodatacow，而不是作为一个打开或关闭的层。\n如果Btrfs不是默认文件系统，则没有承诺，也没有理由进行任何UI/UX集成。有一些想法可以让某些功能变得可发现：选择性压缩；systemd-homed可以利用btrfs在线调整大小或近期计划的本地加密，这可以使将未加密的家庭实时转换为加密的家庭成为可能；以及系统快照和回滚。\n此功能的主要目标是在很大程度上对用户透明。它不需要或不期望用户学习新命令，也不需要进行特殊的维护程序。\nFedora中将启用被认为稳定且默认情况下上游启用的全套Btrfs功能。软呢帽是一个社区项目。Fedora内部支持什么取决于社区决定在资源方面提出什么。\n就GUI和CLI中的导航而言，子卷的行为类似于目录，例如cp、mv、du、所有者/权限和SELinux标签。它们还共享空间，就像目录一样。\n子卷是独立的文件树，有自己的POSIX命名空间，有自己的inode池。这意味着索引节点编号在Btrfs卷上重复。信息节点仅在给定子卷内是唯一的。子卷有自己的st_dev，因此如果您使用stat file，它会报告一个引用该文件所在子卷的设备值。这也意味着不能在子卷之间创建硬链接。从这个角度来看，子卷开始看起来更像一个单独的文件系统。但是子卷共享大多数其他树，因此它们不是真正独立的文件系统。它们也不会阻止设备。\n存储设备可能会松散，从而导致数据损坏导致EIO(输入/输出错误)，而不是导致应用程序混乱，并且无法复制到备份和归档中。\n复杂的存储设置是.。复杂、简单、高效的文件系统复制，包括增量备份，使用btrfs发送和btrfs接收。\n将为现有的Btrfs用户提供文档，以便将他们的设置改造为默认Btrfs安装的设置(基础和任何批准的选项)。\n今天，执行自定义分区安装；将方案下拉菜单更改为Btrfs；单击蓝色的Automatic Create Partitions；并安装。Feddora 31，32，Rawhide，在x86_64和ARM上。\n已用空间和空闲空间的实用程序(CLI和GUI)应该具有相同的行为。不需要特殊命令。\n当/home是绑定挂载时，updatedb不会索引/home，这也会影响rpm-ostree安装，包括SilverBlue。\nGNOME用法：使用多个btrfs子卷时数字不正确这不是btrfs特定的，在一个大的ext4；#34；卷中也会发生这种情况。\nGNOME BOAKS，RFE：在btrfs/home上使用&#39；nocoo&#39；选项创建qco2这是特定于btrfs的，建议对GNOME BOX和virt-manager进行优化。\n严格地说，用户不需要阅读任何文档。但将会有一些Fedora文档来帮助推动这项工作。\nman 5 btrfs包含：装载选项、功能、交换文件支持、校验和算法等man btrfs包含btrfs子命令的概述manbtrfs；子命令&&gt;将显示该子命令的手册页。\n注意：btrfs命令将接受子命令名的开头部分，只要它不是模棱两可的。以下是等效命令：btrfs子卷快照btrfssub snap btrfs su sn。\n你会发现你自己的惯例。在论坛和列表上写出完整的命令可能更好，但是也许有些人不知道这个有用的快捷方式？\n版权所有©2020 Red Hat，Inc.。还有其他人。版权所有。如有意见或疑问，请与我们联系。\nFedora项目由社区维护和推动，并由红帽公司赞助。这是一个社区维护的站点。红帽不对内容负责。", "note_en": "For laptop and workstation installs of Fedora, we want to provide file system features to users in a transparent fashion. We want to add new features, while reducing the amount of expertise needed to deal with situations like  running out of disk space. Btrfs is well adapted to this role by design philosophy, let&#39;s make it the default.\n       Fedora desktop edition/spin variants will switch to using Btrfs as the filesystem by default for new installs. Labs derived from these variants inherit this change, and other editions may opt into this change.\n The change is based on the installer&#39;s custom partitioning Btrfs preset. It&#39;s been well tested for 7 years.\n Current partitioning  vg/root LV mounted at  / and a  vg/home LV mounted at  /home. These are separate file system volumes, with separate free/used space.\n Proposed partitioning  root subvolume mounted at  / and  home subvolume mounted at  /home. Subvolumes don&#39;t have size, they act mostly like directories, space is shared.\n Unchanged  /boot will be a small ext4 volume. A separate boot is needed to boot dm-crypt sysroot installations; it&#39;s less complicated to keep the layout the same, regardless of whether sysroot is encrypted. There will be no automatic snapshots/rollbacks.\n If you select to encrypt your data, LUKS (dm-crypt) will be still used as it is today (with the small difference that Btrfs is used instead of LVM+Ext4). There is upstream work on getting native encryption for Btrfs that will be considered once ready and is subject of a different change proposal in a future Fedora release.\n  The detailed description above is the proposal. It&#39;s intended to be a minimalist and transparent switch. It&#39;s also the same as was  proposed (and  accepted) for Fedora 16. The following optimizations improve on the proposal, but are not critical. They are also transparent to most users. The general idea is agree to the base proposal first, and then consider these as enhancements.\n  Advantage: Makes it possible to include in a snapshot and rollback regime. GRUB has stable support for Btrfs for 10+ years.\n Scope: Contingent on bootloader and installer team review and approval. blivet should use  mkfs.btrfs --mixed.\n  Advantage: Saves space and significantly increase the lifespan of flash-based media by reducing write amplification. It may improve performance in some instances.\n Scope: Contingent on installer team review and approval to enhance anaconda to perform the installation using  mount -o compress=zstd, then set the proper XATTR for each directory. The XATTR can&#39;t be set until after the directories are created via: rsync, rpm, or unsquashfs based installation.\n  Advantage: Makes it easier to excluded them from snapshots, rollbacks, and send/receive. (Btrfs snapshotting is not recursive, it stops at a nested subvolume.)\n Scope: Anaconda knows how to do this already, just change the kickstart to add additional subvolumes (minus the subvolume in  ~/. GNOME Boxes will need enhancement to detect that the user home is on Btrfs and create  ~/.local/share/gnome-boxes/images/ as a subvolume.\n   Red Hat supports Fedora well, in many ways. But Fedora already works closely with, and depends on, upstreams. And this will be one of them. That&#39;s an important consideration for this proposal. The community has a stake in ensuring it is supported. Red Hat will never support Btrfs if Fedora rejects it. Fedora necessarily needs to be first, and make the persuasive case that it solves more problems than alternatives. Feature owners believe it does, hands down.\n The Btrfs community has users that have been using it for most of the past decade at scale. It&#39;s been the default on openSUSE (and SUSE Linux Enterprise) since 2014, and Facebook has been using it for all their OS and data volumes, in their data centers, for almost as long. Btrfs is a mature, well-understood, and battle-tested file system, used on both desktop/container and server/cloud use-cases. We do have developers of the Btrfs filesystem maintaining and supporting the code in Fedora, one is a Change owner, so issues that are pinned to Btrfs can be addressed quickly.\n   dm-thin (thin provisioning): [ Issue #152 still happens, because the installer won&#39;t over provision by default. It still requires manual intervention by the user to identify and resolve the problem. Upon growing a file system on dm-thin, the pool is over committed, and file system sizes become a fantasy: they don&#39;t add up to the total physical storage available. The truth of used and free space is only known by the thin pool, and CLI and GUI programs are unprepared for this. Integration points like rpm free space checks or GNOME disk-space warnings would have to be adapted as well.\n dm-vdo: is not yet merged, and isn&#39;t as straightforward to selectively enable per directory and per file, as is the case on Btrfs using  chattr +c on  /var/lib/flatpaks/.\n Btrfs solves the problems that need solving, with few side effects or pitfalls for users. It has more features we can take advantage of immediately and transparently: compression, integrity, and IO isolation. Many Btrfs features and optimizations can be opted into selectively per directory or file, such as compression and nodatacow, rather than as a layer that&#39;s either on or off.\n  If Btrfs isn&#39;t the default file system, there&#39;s no commitment, nor reason to work on any UI/UX integration. There are ideas to make certain features discoverable: selective compression; systemd-homed may take advantage of either Btrfs online resize, or near-term planned native encryption, which could make it possible to live convert non-encrypted homes to encrypted; and system snapshot and rollbacks.\n   The primary goal of this feature is to be largely transparent to the user. It does not require or expect users to learn new commands, or to engage in peculiar maintenance rituals.\n The full set of Btrfs features that is considered stable and enabled by default upstream will be enabled in Fedora. Fedora is a community project. What is supported within Fedora depends on what the community decides to put forward in terms of resources.\n   Subvolumes behave like directories in terms of navigation in both the GUI and CLI, e.g.  cp,  mv,  du, owner/permissions, and SELinux labels. They also share space, just like a directory.\n  A subvolume is an independent file tree, with its own POSIX namespace, and has its own pool of inodes. This means inode numbers repeat themselves on a Btrfs volume. Inodes are only unique within a given subvolume. A subvolume has its own st_dev, so if you use  stat FILE it reports a device value referring to the subvolume the file is in. And it also means hard links can&#39;t be created between subvolumes. From this perspective, subvolumes start looking more like a separate file system. But subvolumes share most of the other trees, so they&#39;re not truly independent file systems. They&#39;re also not block devices.\n   Storage devices can be flaky, resulting in data corruption Corrupt data results in EIO (input/output error), instead of resulting in application confusion, and isn&#39;t replicated into backups and archives\n   Complex storage setups are... complicated Simple and efficient file system replication, including incremental backups, with  btrfs send and  btrfs receive\n         Documentation will be provided for existing Btrfs users to &#34;retrofit&#34; their setups to that of a default Btrfs installation (base plus any approved options).\n  Today Do a custom partitioning installation; change the scheme drop-down menu to Btrfs; click the blue &#34;automatically create partitions&#34;; and install. Fedora 31, 32, Rawhide, on x86_64 and ARM.\n    Utilities for used and free space, CLI and GUI, are expected to behave the same. No special commands are required.\n  updatedb does not index /home when /home is a bind mount Also can affected rpm-ostree installations, including Silverblue.\n GNOME Usage: Incorrect numbers when using multiple btrfs subvolumes This isn&#39;t Btrfs specific, happens with &#34;one big ext4&#34; volume as well.\n GNOME Boxes, RFE: create qcow2 with &#39;nocow&#39; option when on btrfs /home This is Btrfs specific, and is a recommended optimization for both GNOME Boxes and virt-manager.\n        Strictly speaking no documentation is required reading for users. But there will be some Fedora documentation to help get the ball rolling.\n   man 5 btrfs contains: mount options, features, swapfile support, checksum algorithms, and more  man btrfs contains an overview of the btrfs subcommands  man btrfs &lt;subcommand&gt; will show the man page for that subcommand\n NOTE: The btrfs command will accept an initial part of a subcommand name, as long as it is not ambiguous. These are equivalent commands:  btrfs subvolume snapshot  btrfs sub snap  btrfs su sn\n You&#39;ll discover your own convention. It might be preferable to write out the full command on forums and lists, but then maybe some folks don&#39;t learn about this useful shortcut?\n  Copyright © 2020 Red Hat, Inc. and others. All Rights Reserved. For comments or queries, please  contact us.\n  The Fedora Project is maintained and driven by the community and sponsored by Red Hat. This is a community maintained site. Red Hat is not responsible for content.", "posttime": "2020-07-02 01:58:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "更改,btrfsbydefault,btrfs", "title": "更改/BtrfsByDefault", "title_en": "Changes/BtrfsByDefault", "transed": 1, "url": "https://fedoraproject.org/wiki/Changes/BtrfsByDefault", "via": "", "real_tags": ["更改", "btrfs"]}]