[{"category": "", "categoryclass": "", "imagename": "3456088d4a4e83119110c7300c71b46d.jpg", "infoid": 1070184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新船长从甲板上跳下来，穿好衣服，在水中冲刺。作为一名前救生员，当他直奔这对在停泊的游钓者和海滩之间游泳的夫妇时，他一直盯着受害者。 “我认为他认为你溺水了，”丈夫对妻子说。他们一直在互相泼水，她也曾尖叫过，但现在他们只是站在沙洲上，齐颈深。 “我们很好;他在做什么？”她问，有点生气。 “我们很好！”丈夫大喊大叫，挥手挥手让他离开，但他的船长继续努力游泳。 “移动！”当他在震惊的业主之间冲刺时，他咆哮着。就在他们身后，不到 10 英尺远，他们 9 岁的女儿正在溺水身亡。在船长的怀里安全地浮出水面，她泪流满面，“爹地！”这位船长怎么知道——从 50 英尺远的地方——父亲无法从 10 英尺外识别出什么？溺水并不是大多数人所期望的猛烈的、急促的求救。船长经过专家和多年经验的培训，可以识别溺水。另一方面，父亲通过看电视了解了溺水是什么样子。如果您花时间在水面上或附近（提示：这就是我们所有人），那么您应该确保您和您的船员知道每当人们进入水中时要寻找什么。直到她泪流满面地喊了一声“爸爸”，她才出声。作为前海岸警卫队救援游泳运动员，我对这个故事一点也不感到惊讶。溺水几乎总是一个看似安静的事件。戏剧性的条件（电视）让我们准备寻找的挥手、泼水和大喊在现实生活中很少见。本能的溺水反应——由 Francesco A. Pia 博士命名，是人们为了避免在水中实际或感知到的窒息而采取的措施。而且它看起来并不像大多数人所期望的那样。几乎没有溅水，没有挥手，也没有大喊大叫或任何形式的求助。要了解水面溺水是多么安静和平淡，请考虑以下问题：这是导致 15 岁及以下儿童（紧随车辆事故）意外死亡的第二大原因——在大约 750 名儿童中明年会淹死，其中大约 375 人会在父母或其他成年人 25 码范围内淹死。根据疾病预防控制中心的数据，在 10% 的溺水事件中，成年人实际上会看着孩子这样做，而不知道它正在发生。溺水看起来不像溺水——Dr. Pia 在海岸警卫队的 On Scene 杂志的一篇文章中这样描述了本能的溺水反应：“除非在极少数情况下，溺水的人在生理上无法呼救。呼吸系统是为呼吸而设计的。语音是次要或叠加的功能。呼吸必须在言语发生之前完成。溺水者的嘴巴交替地沉入水面，再出现在水面之上。溺水者的嘴在水面上方的时间不足以让他们呼气、吸气和呼救。当溺水者的嘴在水面以上时，随着嘴巴开始下沉到水面以下，他们会快速呼气和吸气。溺水的人不能挥手求救。大自然本能地迫使它们横向伸展手臂并压在水面上。压在水面上可以让溺水的人利用他们的身体，这样他们就可以把嘴从水里抬起来呼吸。在整个本能溺水反应中，溺水者无法自主控制手臂动作。从生理上讲，溺水者在水面上挣扎，无法停止溺水并进行自主运动，例如挥手求救、走向救援人员或伸手去拿一件救援设备。\n从本能溺水反应的开始到结束，人们的身体在水中保持直立，没有任何支撑性踢腿的迹象。除非由训练有素的救生员救出，否则这些溺水者只能在淹没前 20 到 60 秒在水面上挣扎。”这并不意味着一个大喊救命的人没有真正的麻烦——他们正在经历水中的窘迫。在本能溺水反应之前并不总是出现，水中的窘迫不会持续很长时间——但与真正的溺水不同，这些受害者仍然可以协助自己的救援。他们可以抓住救生索、投掷戒指等。因此，如果一名船员落水并且一切正常——不要太确定。有时，某人溺水的最常见迹象是他们看起来不像是溺水。他们可能只是看起来像是在踩水，抬头看着甲板。一种确定方法？问他们：“你还好吗？”如果他们能回答——他们可能是。如果他们回以茫然的目光，您可能只有不到 30 秒的时间才能找到他们。父母——孩子们在水中玩耍会发出声音。当他们安静下来时，您可以找到他们并找出原因。", "note_en": "The new captain jumped from the deck, fully dressed, and sprinted through the water. A former lifeguard, he kept his eyes on his victim as he headed straight for the couple swimming between their anchored sportfisher and the beach. “I think he thinks you’re drowning,” the husband said to his wife. They had been splashing each other and she had screamed but now they were just standing, neck-deep on the sand bar. “We’re fine; what is he doing?” she asked, a little annoyed. “We’re fine!” the husband yelled, waving him off, but his captain kept swimming hard. ”Move!” he barked as he sprinted between the stunned owners. Directly behind them, not 10 feet away, their 9-year-old daughter was drowning. Safely above the surface in the arms of the captain, she burst into tears, “Daddy!”\n        How did this captain know—from 50 feet away—what the father couldn’t recognize from just 10? Drowning is not the violent, splashing call for help that most people expect. The captain was trained to recognize drowning by experts and years of experience. The father, on the other hand, had learned what drowning looks like by watching television. If you spend time on or near the water (hint: that’s all of us) then you should make sure that you and your crew know what to look for whenever people enter the water. Until she cried a tearful, “Daddy,” she hadn’t made a sound. As a former Coast Guard rescue swimmer, I wasn’t surprised at all by this story. Drowning is almost always a deceptively quiet event. The waving, splashing, and yelling that dramatic conditioning (television) prepares us to look for is rarely seen in real life.\n    The Instinctive Drowning Response—so named by Francesco A. Pia, Ph.D., is what people do to avoid actual or perceived suffocation in the water. And it does not look like most people expect. There is very little splashing, no waving, and no yelling or calls for help of any kind. To get an idea of just how quiet and undramatic from the surface drowning can be, consider this: It is the No. 2 cause of accidental death in children, ages 15 and under (just behind vehicle accidents)—of the approximately 750 children who will drown next year, about 375 of them will do so within 25 yards of a parent or other adult. According to the CDC, in 10 percent of those drownings, the adult will actually watch the child do it, having no idea it is happening. Drowning does not look like drowning—Dr. Pia, in  an article in the Coast Guard’s  On Scene magazine, described the Instinctive Drowning Response like this:\n      “Except in rare circumstances, drowning people are physiologically unable to call out for help. The respiratory system was designed for breathing. Speech is the secondary or overlaid function. Breathing must be fulfilled before speech occurs.\n Drowning people’s mouths alternately sink below and reappear above the surface of the water. The mouths of drowning people are not above the surface of the water long enough for them to exhale, inhale, and call out for help. When the drowning people’s mouths are above the surface, they exhale and inhale quickly as their mouths start to sink below the surface of the water.\n Drowning people cannot wave for help. Nature instinctively forces them to extend their arms laterally and press down on the water’s surface. Pressing down on the surface of the water permits drowning people to leverage their bodies so they can lift their mouths out of the water to breathe.\n Throughout the Instinctive Drowning Response, drowning people cannot voluntarily control their arm movements. Physiologically, drowning people who are struggling on the surface of the water cannot stop drowning and perform voluntary movements such as waving for help, moving toward a rescuer, or reaching out for a piece of rescue equipment.\n From beginning to end of the Instinctive Drowning Response people’s bodies remain upright in the water, with no evidence of a supporting kick. Unless rescued by a trained lifeguard, these drowning people can only struggle on the surface of the water from 20 to 60 seconds before submersion occurs.”\n      This doesn’t mean that a person that is yelling for help and thrashing isn’t in real trouble—they are experiencing aquatic distress. Not always present before the Instinctive Drowning Response, aquatic distress doesn’t last long—but unlike true drowning, these victims can still assist in their own rescue. They can grab lifelines, throw rings, etc.\n        So if a crew member falls overboard and everything looks OK—don’t be too sure. Sometimes the most common indication that someone is drowning is that they don’t look like they’re drowning. They may just look like they are treading water and looking up at the deck. One way to be sure? Ask them, “Are you all right?” If they can answer at all—they probably are. If they return a blank stare, you may have less than 30 seconds to get to them. And parents—children playing in the water make noise.  When they get quiet, you get to them and find out why.", "posttime": "2021-07-29 21:27:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "溺水,drowning", "title": "溺水不像溺水 (2013)", "title_en": "Drowning Doesn’t Look Like Drowning (2013)", "transed": 1, "url": "https://slate.com/technology/2013/06/rescuing-drowning-children-how-to-know-when-someone-is-in-trouble-in-the-water.html", "via": "", "real_tags": ["溺水", "drowning"]}, {"category": "", "categoryclass": "", "imagename": "9f33eb2e797b81f79d610b22e621b466.png", "infoid": 1070183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我读过的一篇更奇怪的专栏文章中，《纽约时报》再次选择授权反对远程工作的力量，由一家律师事务所的联合创始人经营一篇令人难以忍受的专栏文章。如果您想对一个主题给出平衡的看法，那么熨平板正是您不会给予空间的东西，讲述一群律师在 2020 年 5 月被迫回到办公室的故事。它包括一些令人难以置信的轶事 - 鼓励员工开车进来，因为他们“希望 [workers] 开车上班并支持 [他们的] 许多能源部门客户”，匿名客户据称嫉妒他们的亲自办公室 - 读起来完全像发表的东西特别是因为《纽约时报》实际上无法让记者获得反远程工作的研究意见。就好像组织本身希望人们回到办公室，但找不到这样做的证据，因此转向他们的意见页面，用轶事废话来证明它的合理性。如果《纽约时报》还没有聘请“重返工作岗位”时事通讯撰稿人，有人可能会说我是偏执狂：这个职位虽然有可能就这个问题提供一个平衡的观点，但已经通过使用“回到工作岗位”来进行行政宣传。工作”的短语。虽然看似天真，但这句话表明，每个在家工作的人都在用笔记本电脑度假而不是在工作，只有回到我们宽敞漂亮的办公室，我们才能再次充分工作，并看到“面对面交流。”我一直警告你的这场文化战争取决于这样一个事实，即这些人中的许多人找不到真正的理由回到办公室。有问题的律师事务所根据整整五个星期的时间来观察它是否有效（显然，有几位律师已经加入了！），自豪地吹嘘“能源、健康领域的公司如何护理和技术......在私人谈话中嫉妒地称赞[他们]的决定。”然而，这是高管阶层正在抽出的燃料——一家大的、成功的律师事务所回到办公室，还有更多的人希望回到办公室被残忍地沉默，甚至可以说， “取消”是因为说人们应该能够远程工作。撰写这篇专栏文章的人还说，这些公司“害怕被股东怀疑，担心重新开放办公室可能会出现问题。”而且，当然，他们创造了创纪录的一年，这证明远程工作很愚蠢，而且他们很聪明。我想明确一点，这正是一场文化战争的开始——某个有权势的人暗示他们正受到一种非特定力量的压迫，通常是因为做了一些对权力比他们弱的特定群体来说很糟糕的事情。人们与他们结盟是因为他们对其他事情并不特别生气，并且将任何涉及某人被取消或压迫的事情视为他们必须跳入的事情。在许多情况下，这些人也有很大的权力和关系，并且正在做一些糟糕的事情，因为他们想做。这一切听起来像是一个阴谋，但我真的相信，就像我们有公司大胆声称他们“永远远程”一样，我们将拥有一些“永远面对面”的公司。他们会将那些不去办公室的人描述为懒惰或特权——那些关心“把事情做好”的人将成为通勤到办公室并做他们在家做的相同工作的人人，也出现在每个人都假装做笔记但实际上在看 Twitter 的会议中。\n“重返工作岗位”运动正在获得动力，因为它听起来不错，并且隐约地与 COVID-19 的结束有关（目前还没有结束）。这也是有钱的高管们喜欢听到的话，因为办公室里没有人，他们觉得人们只是在家里闲逛，而不是当他们在办公室时，一个从来没有人闲逛的地方，尤其是不是我。华尔街日报的“老板希望你回到办公室”。就像，现在”是这种宣传的另一部分，将远程工作视为一种福利，而不是一种有效的工作方式，引用抵押贷款公司总裁 Mat Ishbia 的话说：“我不需要一厢情愿-今年早些时候上市的 UWM Holdings Corp. 总裁兼首席执行官马特·伊什比亚 (Mat Ishbia) 说。 “我从来没有在这件事上动摇过。我们在一起更好。如果您拥有令人惊叹的文化，以及能够一起协作和工作的优秀人才，您就会希望他们一起在办公室工作。”自然地，他们的玻璃门描述了一种成功的文化，在这种文化中，伟大的人合作，描述了“承保环境 [即] 相当有害”，“容易被欺负的职位”，更令人担忧的是，将他们描述为“不是一个公司，它是一种邪教 [标点符号和语法]他们的]，在那里他们“......以工作/生活平衡的方式卖给你，而你却没有（每天起床和磨练 11 小时是不道德的）。”我想（引用《华尔街日报》的文章）“他的员工几乎没有反对全职回归”的原因是因为他的公司欺负他们的员工。这当然以重返工作岗位的哨声结束——“他们正在等待公司领导，”他说。 “他们不想做出决定。当你是领导者时，你实际上必须做出决定。”最后，我们有专业版的“好吧，有人不得不说！”来自一个显然对他的文化一无所知或不在乎的人，由一位非常自在的记者支持，确保有适当的“有毒文化[没有]工作/生活平衡[和]对你一整天进行微观管理的领导者，”引用和研究花了我几分钟的时间才找到。这是工作场所的联合宣传 - 将管理视为为了他们的“文化”和“成功”而努力让人们重新团结在一起，媒体和其他人高兴地引用他们而没有批评，因为这是一个更可口的故事告诉他们的广告商和股东。五三银行在文章中声称他们不可能成为一家出色的远程工作公司，”通过说人们无法跟踪一个部门对另一个部门说的话，并且项目因人员分散而陷入停顿是合理的，而且问题是远程工作，而不是组织不擅长。关于这些大公司的大故事有很多，因为他们的高管正在积极推动一种叙事来支持他们对办公室的愚蠢的老派幻想。 CenterPoint 首席执行官 Dave Lesar 告诉该杂志，办公室“促进了我们员工之间的更大协作，并使我们能够执行新的长期增长战略”，此时记者决定停止思考并继续前进。\n虽然这篇文章 - 就像他们一直做的那样 - 最终进入了假装远程工作有时是好的领域，但偏远地区的研究和护理量充其量是脆弱的。在大多数情况下，与期刊一样，它主要将远程作为对规范的对立面——这是回到办公室——而不是可行的替代方案。远程的整个框架是使用那些因为不允许在家工作而辞职的人的经典统计数据完成的 - 并且很少（如果有的话）将这些公司视为异常值以外的任何其他公司。我一再说过，这是一代人的事情，我坚持。虽然作者在这种情况下可能很年轻，但他背后的编辑力量和文章的主题都是老一辈和高管。行政教派希望将人们推回办公室，并故意将自己塑造成远程工作自由需求的受害者，证明重返办公室对他们不参与或不得不处理后果的文化有好处的。这些文章的存在不是为了讲述一个真实的故事，而是为了帮助打压白领，让他们根据虚假的轶事废话回到办公室。这种宣传来自一个管理精英，他们觉得自己失去了对工人的控制，这是他们最初让他们留在办公室的唯一原因。如果没有办公室，员工可能会开始质疑他们是否得到了公平的交易，或者评估他们的经理和队友是否真的做了任何事情。在办公室，将公司问题归咎于个人失败要容易得多——但当你在家时，作为一名员工，你更容易客观地看待事情。", "note_en": "In one of the more bizarre op-eds I’ve ever read, the New York Times  again chose to empower the forces against remote work, running  an insufferable op-ed by the co-founder of a law firm. The screed is exactly the thing you  don’t give space to if you’re looking to give a balanced view on a subject, telling the tale of a group of lawyers that were forced back to the office in  May 2020. It includes some incredible anecdotes - workers encouraged to drive in as they “wanted [workers] driving to work and supporting [their] many energy-sector clients,” anonymous clients that allegedly were jealous of their in-person office - and reads entirely like something that was published specifically because the New York Times couldn’t actually get a reporter to have a researched opinion that was anti-remote work.\n It’s almost as if the organization itself wants people to return to the office but can’t find the evidence to do so and thus has turned to their opinion page to justify it with anecdotal bullshit. One might say I’m paranoid if the Times was not also hiring a  “Back to Work” newsletter writer:\n  This position, while potentially able to provide a balanced view on the subject, is already steeped in executive propaganda by using the “back to work” phrase. While seemingly innocent, the phrase suggests that everyone working from home has been on some sort of vacation with their laptop rather than doing work, and that only by returning to our big, beautiful offices can we fully work again, and see “the value of face-to-face communication.”\n This culture war that I’ve been warning you about hinges on the fact that many of these people cannot find a real justification to go back to the office. The law firm in question justifies their decision to not go remote based on an entire five weeks of seeing if it’d work (and, apparently, several lawyers  had already been going in!), proudly boasting about how “companies in energy, health care and tech….jealously applauded [their] decision in private conversations.”\n Nevertheless, this is the fuel that the executive class is pumping out - that a big, successful law firm went back to the office and that there are  many more people that wish to go back to the office being cruelly silenced, one might even say, “canceled” for saying that people should be able to work remotely. The person writing this op-ed also says that these companies “feared being second-guessed by stockholders and worried about problems that could arise from reopening offices.” And, of course they had a record year, which proves that remote work is stupid, and they are smart.\n I want to be clear that this is exactly how a culture war begins - someone powerful intimates that they are being oppressed by a non-specific force, usually for doing something that sucks for a specific group of people that have less power than they do. People ally with them because they are non-specifically mad at other things and see anything that involves someone being cancelled or oppressed as something that they must jump into. In many cases, these people also have a great deal of power and connections and are doing something shitty because they want to do it.\n  This all sounds like a conspiracy, but I truly believe, just as we’ve had companies boldly claim they’re “remote forever,” that we’re going to have a few that are “in-person forever.” They will frame those that don’t go to the office as lazy or privileged - that those that care about “getting shit done” are going to be the ones that commute into the office and do the same work they’d do at home in person, and also appear in meetings where everyone is pretending to be taking notes but really looking at Twitter.\n  The “back to work” movement is gaining momentum because it  sounds nice, and it’s vaguely connected to the end of COVID-19 (which is currently very much not over). It’s also something that well-moneyed executives love to hear, because without people in an office, they feel like people are just at home dicking around, as opposed to when they’re in the office, a place where nobody dicks around ever, especially not me. The Wall Street Journal’s “ The Boss Wants You Back in the Office. Like, Now” is yet another piece of this propaganda that frames remote work as a perk rather than an efficient way to do work, quoting Mat Ishbia, the president of a mortgage company, saying:\n “I don’t need to be wishy-washy,” said Mat Ishbia, president and CEO of United Wholesale Mortgage, which went public as  UWM Holdings Corp. earlier this year. “I have never wavered on this. We are better together. If you have an amazing culture, and great people that collaborate and work together, you want them in the office together.”\n Naturally,  their glassdoor describes a winning culture where great people collaborate, describing an “ Underwriting environment [that is] is fairly toxic,” “ easily bulliable positions,” and more worryingly describes them as “ NOT A FIRM ITS A CULT [punctuation and grammar theirs],” where they “…sell you on a work/life balance and you have none (rise and grind 11 hr days is not ethical).” I imagine the reason that (quoting the Journal article) “there has been little resistance from his staff to returning full-time” is because his company bullies their people. And it of course ends with the return-to-work dog whistle -\n “They’re waiting for companies to lead,” he said. “They don’t want to make a decision. When you’re the leader, you actually have to make a decision.”\n Finally, we have the professional version of “ well somebody had to say it!” from a guy who clearly either has no idea or doesn’t give a shit about his culture, backed by a reporter who was quite comfortable making sure there was appropriate photography of the “ toxic culture [with] no work/life balance [and] leaders who micromanage your entire day,” quotes and research that took me a manner of minutes to find.\n This is workplace copaganda - framing management as virtuously trying to get people back together for the sake of their “culture” and “success,” with the media and others happily quoting them without critique because it’s a much more palatable story to tell their advertisers and shareholders. Fifth Third Bank claims in the article that they can’t be a great company working remotely,” justifying it by saying that people can’t track of what one department is saying to another, and that projects ground to a halt because people were distributed, and that the problem was remote work, not that the organization was bad at it.\n There are so many of these big picture stories about these large companies because their executives are actively pushing a narrative to back up their stupid old-school delusions about the office. CenterPoint CEO Dave Lesar told the journal that in-office “promotes greater collaboration between our employees, and positions us to execute on our new long-term growth strategy,” at which point the reporter decided to stop thinking about it and move on.\n While the article - as they always do - eventually moves into the realm of pretending that remote work can sometimes be good, the volume of research and care that goes toward the remote side is flimsy at best. In most cases, as with the journal, it mostly frames remote as a counterpoint to the norm - which is returning to the office - versus a viable alternative. The entire framing of remote is done using the classical statistics of people who will quit their jobs because they’re not allowed to keep working from home - and is rarely, if ever, frames these companies as anything other than outliers.\n I have repeatedly said that this is a generational thing, and I stand by it. While the writer, in this case, may be young, the editorial forces behind him and the subjects of the article are all older generations and executives. The executive sect wants to push people back into the office and intentionally frame themselves as victims of a liberal demand for remote work, justifying the return to the office as good for a culture that they do not participate in or have to do deal with the consequences of. These articles do not exist to tell an actual story, but to help suppress white-collar workers, and make them return to the office based on spurious, anecdotal bullshit.\n This propaganda is coming from a management elite that feels themselves losing control of workers, which is the only reason that they had them in the office in the first place. Without the office, workers might begin to question whether they’re getting a fair deal, or evaluate whether their managers and teammates actually do anything. In the office, it’s much easier to instill company problems as a personal failing - but when you’re at home, it’s significantly easier for you as a worker to view things objectively.", "posttime": "2021-07-29 21:27:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "文化,culture,办公室", "title": "异地文化大战打响，高管抽“复工”宣传", "title_en": "Remote Culture War Has Begun, Executives Pumping Out \"Back to Work\" Propaganda", "transed": 1, "url": "https://ez.substack.com/p/the-remote-culture-war-has-begun", "via": "", "real_tags": ["文化", "culture", "办公室"]}, {"category": "", "categoryclass": "", "imagename": "f4a83f0d2a4de6b5bb74ac470893f75c.png", "infoid": 1070181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "没有代码是编写安全可靠的应用程序的最佳方式。什么都不写；无处部署。这只是一个示例应用程序，但可以想象它做任何你想做的事情。添加新功能也很容易：虽然您还没有做任何事情，但现在是部署应用程序的时候了。通过运行以下命令，您可以完全无处部署您的应用程序。就这么简单。当需要扩展应用程序时，您所要做的就是：", "note_en": "No code is the best way to write secure and reliable applications. Write nothing; deploy nowhere.\n    This is just an example application, but imagine it doing anything you want. Adding new features is easy too:\n         While you still have not done anything it&#39;s time to deploy your application. By running the following command you can deploy your application absolutely nowhere.\n  It&#39;s that simple. And when it comes time to scale the application, all you have to do is:", "posttime": "2021-07-29 21:26:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,安全可靠,secure,应用程序", "title": "编写安全可靠的应用程序的最佳方式。什么都不写；无处部署。", "title_en": "The best way to write secure and reliable apps. Write nothing; deploy nowhere.", "transed": 1, "url": "https://github.com/kelseyhightower/nocode", "via": "", "real_tags": ["程序", "安全可靠", "secure", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "a644dd4b9f48f4d10ccc3e922203fa44.jpg", "infoid": 1070180, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我正在使用罗技 K380 蓝牙键盘在我的 iPhone 上的 Obsidian iOS 应用程序中输入这篇文章，我感觉自己就像一个 90 年代的计算机黑客。不够？怎么样：我只是通过 Termius iOS 应用程序使用 Tailscale SSH 连接到家庭网络上的 Raspberry Pi，以重新启动 YouTube-playlist-to-podcast-feed Docker 容器。不要误会我的意思——其他东西也很神奇，尤其是尾鳞。但是这个键盘到电话的功能很重要。你有点忘记了你的手机是一台电脑，就个人而言。相反，它通常只是社交媒体噩梦的载体。考虑到在手机应用程序与网站（在台式机/笔记本电脑上）上做一些半艰巨的事情（例如办理登机手续）之间的选择，我总是选择后者。应用程序中总是缺少一些东西，如果你真的想把所有东西都弄得很繁琐，我通常会这样做，无论如何他们都会把你踢到一个蹩脚的网页视图中。所以，在任何旅行中，我通常都是笔记本电脑的携带者。只是，这一次，我不想。首先，我的 alu-min-i-um 便携式计算机非常笨重，我坚信我们只能在这次航行中随身携带。更糟糕的是，我最近发现将笔记本电脑屏幕打开超过 45 度会导致死机黑屏。这对天才来说是件好事，如果他们愿意沉迷于 2016 年 MBP（我很怀疑）。但我确实希望能够在这次旅行中为我的书进行编辑。你永远不知道什么时候灵感会来（通常，对我来说，大约在午夜，当我已经上床睡觉时），虽然我是相当快的拇指打字员，但我只是感觉不到手机键盘上的流动感.幸运的是，我们把这个蓝牙小可爱藏在壁橱里。我购买了它作为送给 Carly 的礼物，这样她就可以随时随地写东西（这与我在这里谈论的需求非常相似）。我们在求爱初期就广泛讨论了对移动键盘书写工具的需求，我们甚至想到了自己构建它的想法（提示：我仍然在考虑这个想法）。\n我们并不孤单。看看 FreeWrite 产品，尽管它几乎完全符合我们的梦想产品（全尺寸键盘、类似电子墨水的屏幕和超长的电池寿命），但不知何故不太适合我。大多数情况下，是计算器大小的屏幕（以及可感知的笨重尺寸）让我感到害怕。我们想要一些可以放在钱包或口袋里的东西。现在这款蓝牙键盘不适合放在口袋里，但它也非常便宜，足以让我在丢失它或洒上啤酒时不会感到沮丧。所以，我想我会在这次旅行中尝试一下。我被卖了。在这件事上打字很有趣，我想我会把它带到更多地方。除了像 Tailscale 和 Termius 这样的东西，我可以把我的智能手机当作我真正电脑的哑终端。卡莉还没有尝试过键盘，但我抱有希望。她现在正在看着我轻敲，我认为这是一个需要一段时间才能开始的礼物。同时，我将继续考虑将键盘作为计算机，无论是在 eBay 上搜索 Commodore VIC-20，查看最新的 Raspberry Pi 400 键盘计算机，或勾勒出我们尚未实现的“用于写作的 Kindle”。在后一项上，我也将 ReMarkable 2 视为潜在的获胜者，但缺少键盘和缺少背光使我望而却步……目前。如果他们完全跟踪掉车分析，我现在就要为我的所作所为道歉。如果你愿意，你可以继续重新定位我。总有一天你会得到我。", "note_en": "I&#39;m typing this post on my iPhone in the  Obsidian iOS app using a  Logitech K380 Bluetooth keyboard and I feel like a 90s computer hacker.\n Not enough? How about this: I just SSH&#39;ed into a  Raspberry Pi on my home network using  Tailscale via the  Termius iOS app to restart a  YouTube-playlist-to-podcast-feed Docker container.\n Don&#39;t get me wrong -- the other stuff is pretty magical, too, especially Tailscale. But this keyboard-to-phone takes the cake.\n    You kinda forget that your phone is a computer, personally-speaking. Instead, it&#39;s usually just a vehicle for social media nightmares. Given the choice between doing something semi-arduous, like checking in for a flight, on a phone app vs the website (on a desktop/laptop), I always choose the latter. Somethings always missing from the app, and if you really want to get all fiddly, which I usually do, they kick you out to a crappy webview anyway.\n So, I&#39;m usually a laptop-bringer on any trip. Except, this time, I didn&#39;t want to. Firstly, my alu-min-i-um portable computer is just plain heavy and bulky, and I was adamant that we were going carry-on only on this voyage. Even more damning, I recently discovered that opening the laptop screen beyond 45 degrees results in the black screen of death. That&#39;s something for the Geniuses, if they&#39;re willing indulge an admittedly long in the tooth 2016 MBP (I&#39;m doubtful).\n But I did want to be able to work on edits for my book on this trip. You never know when inspirations gonna strike (usually, for me, around midnight, when I&#39;ve already gone to bed), and while I&#39;m reasonably fast thumb-typist, I just don&#39;t feel the flow feels on the phone keyboard.\n Luckily, we had this little Bluetooth cutie tucked away in a closet. I&#39;d purchased it as a gift for Carly, so that she could write stuff on the go (very much the same need I&#39;m talking about here). We&#39;d extensively discussed the need for a mobile keyboard writing thingie early in our courtship, and we even entertained the idea of building it ourselves (hint: I&#39;m still entertaining this idea).\n We&#39;re not alone. See the  FreeWrite products, which somehow don&#39;t quite fit the bill for me, despite almost exactly delivering on our dream product (full-sized keyboard, e-ink-like screen, and supreme battery life). Mostly it&#39;s the calculator-sized screen (and the perceived bulky size) that&#39;s scaring me away. We want something that you can keep in a purse or a pocket.\n Now this Bluetooth keyboard doesn&#39;t fit in a pocket, but it&#39;s also pretty darn cheap, enough so that I&#39;m not going to be devastated if I lose it or spill a beer on it.\n So, I thought I&#39;d give it a try this trip. And I&#39;m sold. It&#39;s legit fun to type on this thing and I think I&#39;m going to bring it with me more places. Along with things like Tailscale and Termius, I can treat my smart phone as a dumb terminal to my real computers.\n Carly still hasn&#39;t given the keyboard a try, but I&#39;m holding out hope. She&#39;s watching me tap-tap away right now, and I think this is a gift that just takes a while to kick in.\n And, meanwhile, I&#39;m going to keep thinking about keyboards-as-computers, whether that&#39;s scouring eBay for Commodore VIC-20s, ogling over the latest  Raspberry Pi 400 keyboard-computer, or sketching out our still-yet-to-be-realized &#34;Kindle for writing.&#34;\n On the latter item, I&#39;m also ogling the  ReMarkable 2 as an potential winning entrant, but the lack of keyboard and the lack of backlight are keeping me away... for now. If they&#39;re tracking dropped cart analytics at all, I&#39;m just going to apologize now for what I&#39;ve been doing. You can keep retargeting me if you&#39;d like. You&#39;ll get me one day.", "posttime": "2021-07-29 21:26:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,智能手机,phone,键盘", "title": "智能手机、哑终端", "title_en": "Smart Phone, Dumb Terminal", "transed": 1, "url": "https://www.charlieharrington.com/smart-phone-dumb-terminal/", "via": "", "real_tags": ["手机", "智能手机", "phone", "键盘"]}, {"category": "", "categoryclass": "", "imagename": "56f34d0a0b4e3a7514cfb4da05bb22b5.png", "infoid": 1070179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上图展示了所谓的“两便士宿醉”。这是一个在谷歌上越来越常见的术语，它声称描述了一种廉价的维多利亚时代的宿舍，在这种房子里，与支付床位的费用相比，穷人可以更划算地获得住所和过夜的休息。花费四便士或五便士。这个想法是，作为报酬，穷人将被允许睡觉，一次几个人，披​​在一根绳子上，绳子悬在一个房间的胸前。在过去的几年里，人们普遍接受这样的地方确实存在，在谷歌图片搜索中搜索“twopenny hangover”这个词会发现至少有四张不同的图片，据说描绘了一些例子。这幅从远处看是最详细和最清晰的，实际上是 1978 年肖恩康纳利 / 迈克尔克莱顿雀跃电影《火车大劫案》的剧照，背景设定在 1850 年代中期的伦敦；其他人已被拉入下面的画廊。其中两个乍一看非常相似，仔细观察时可以看出它们描绘了一种截然不同的住宿。据我所知，“双便士宿醉”一词（有时在网络资源中被破坏，成为“便士宿醉”）起源于乔治·奥威尔，他在其极具影响力的《巴黎和伦敦的大跌》（1933）中，这本书是根据他自己在大萧条时期生活在贫困边缘的经历写成的——写到在两便士宿醉时，房客在长凳上排成一排；他们面前有一根绳子，他们靠在绳子上，好像靠在栅栏上。一个男人，幽默地称为贴身男仆，在早上五点剪断绳子。奥威尔并没有声称自己曾参观过这种类型的旅馆。他的详细信息来自一位线人，一位他称为 Bozo 的伦敦路面艺术家，尽管他说他知道巴黎有“类似”的地方。此外，你会注意到，他对这些地方使用的系统的描述实际上与《火车大劫案》中的娱乐不符，因为奥威尔很清楚这些地方的男人睡在坐姿上，只是向前倾身支撑他们的上半身在绳子上。几年前在 2016 年 BBC 的系列节目“维多利亚时代的贫民窟”中对这种住宿进行了重建，其中“一组 15 名年龄在 10 至 59 岁之间的志愿者被运回维多利亚时代的伦敦，因为他们在那里生活和工作了三个星期。再现了伦敦东区贝斯纳尔格林臭名昭著的老尼科尔贫民窟。”可以在这个系列的视频预告片中一瞥，11 秒。将相同的基本故事追溯到 19 世纪，我们接下来需要注意另一个非常著名的帐户，Jacob Riis 的另一半如何生活，这是一位社会改革家撰写的关于 1880 年代纽约市贫困线以下生活的书。里斯的书出版于 1890 年，尤其以他用来说明它的闪光照片而著称。作者用整整一章的篇幅介绍了这座城市的“廉价旅馆”，并描绘了从相对健康的每晚 25 美分的各种房产向下发展的过程，在这些房产中，“客人”至少可以期待自己的床，脆弱的隔断，经过 15 美分的潜水，居民在肮脏的铺位上睡了四层深，直到 10 美分的房产，Riis 观察到，“用于放置卧铺者衣服的储物柜消失了。不再需要它了。达到了流浪者限制，没有什么可以锁定的，一般来说，除了房客。”在 10 美分的房子下面是另一种类型的机构，每晚收费 7 美分，其中提供的“床”是一条串在两块“粗木”之间的帆布条。所有这些地方确实存在，Riis 亲自拜访了它们，但他补充说，他听说有传言说可能还会找到一种更便宜的住所，尽管“据我所知，从来没有引进到这个国家。”这是“曾经在某些古老的乡村城镇中被实践过的东西，如果报道真实的话”[他的意思是欧洲城镇]，在那里\n“床”的代表是横跨房间的晾衣绳，睡觉的人用腋窝挂在上面，每晚一分钱。早上，老板只是简单地解开一端的绳子，让它随负载一起走，把他们叫醒；无疑是一种节省劳力的装置，并且非常成功地达到了预期的目的。他对此类房屋运作方式的描述与我们电影中所展示的那种地方最接近，也与一般的“两便士宿醉”互联网比喻最接近。 尽管如此，里斯听说过的晾衣绳接头经营着一个和网络传奇的民宿没什么区别。它们的成本只有一半，而不是每天早上“切断”绳子（这看起来很浪费绳子），它只是解开后一点特别有趣，因为德国档案馆确实提供了两张图片——一张是图画可以追溯到 1909 年之前，另一张照片可能可以追溯到 1929 年或 1930 年。但这两张照片显示的场所非常类似于奥威尔对“两便士宿醉”的描述——包括坐在长凳上的卧铺——而不是晾衣绳的房子。这幅画显然来自著名的德国社会主义者爱德华·富克斯 (Eduard Fuchs) 的六卷本 Illustrierte Sittengeschichte vom Mittelalter bis zur Gegenwart，对那个时期的习俗和文化进行了探索。这张照片显然显示了处于萧条时期的“紧急避难所”中的失业者——网上出现的几个版本声称它是在汉堡拍摄的，布鲁曼 1985 年的学校教科书《魏玛德国：德国 1918-1933》印有标题：“这些1930 年冬天，男人们付钱让他们在温暖的房间里‘在线上’睡觉。绳子在他们睡觉时把他们撑起来。需要做更多的工作来追踪这些图像的来源，并希望至少确认其中的一些细节。我特别怀疑这幅画，因为虽然图像说明将它与自 1886 年以来确实在德国运作的救世军联系起来，但它非常类似于维多利亚时代晚期英国插图报纸中使用的那种风格，我不确定同样的风格在德国是否同样普遍。但关键似乎是，如果像这样的机构是 Riis 掌握的谣言的来源，那么这些谣言似乎让他们比实际情况更不舒服，更绝望。到目前为止，您会注意到，我们只能追溯到 1880 年代，而据我所知，Riis 所指的故事无法在早于 1880 年代的报告中追溯;例如，在英国在线报纸档案馆中搜索“twopenny hangover”一词的尝试，只得到了 1930 年代对奥威尔著作的引用。亨利·梅休 (Henry Mayhew) 的四卷本《伦敦劳工与伦敦贫民》（1851 年）是根据对数百名线人多年的采访汇编而成的，并且仍然是有关维多利亚时代伦敦工人阶级生活的不竭信息源泉，专门用了一个部分虽然他描述了各种不同类型的机构，并列举了许多恐怖事件——使用他从已倒闭的国王十字天花医院购买的床位建立四间宿舍的人可能是最糟糕的是——他没有提到任何至少没有为居住者提供床铺的地方，无论多么虱子。然而，有一个文学描述类似于我们一直在考虑的地方类型，其历史可以追溯到 1830 年代，这是出现在狄更斯的《匹克威克论文》中的一段话。当然，狄更斯是一位经验丰富的报社记者，对低俗生活有着长期的兴趣，关于这本书在多大程度上应该被视为现实主义的一个例子，有相当多的文献——但是，虽然它没有，所以据我所知，下面描述的那种机构确实存在于乔治亚时期晚期的伦敦，仔细阅读表明，狄更斯著名的畅销书可能以某种方式促成了雅各布的谣言半个世纪后，里斯听到了；请注意每天早上绳索如何“解开”以终止睡眠者休息的详细重复。此外，这段话在术语上与奥威尔的非常相似，以至于它也可能是“两便士宿醉”的灵感来源。然而请注意——这里和以前一样——描述的睡眠安排只是表面上类似于火车大劫案中的图像。\n这里的演讲者是 Pickwick 的 cockney 男仆 Sam Weller，他解释说，在他生命的一个低谷，他被迫“住了两周没有家具的小屋”：“是的——滑铁卢桥的干拱。不错的睡觉的地方——距离所有公共办公室都在十分钟的步行路程内——除非有任何反对意见，那就是环境太通风了。我在那里看到了一些奇怪的景点。 “啊，我想你知道了，”皮克威克先生说，神情相当感兴趣。 “视线，先生，”韦勒先生继续说道，“就像‘穿透你仁慈的心，从另一边出来。你在那里看不到常规的waygrants；相信他们，他们比这更了解。年轻的乞丐，男的和女的，因为在这个行业中没有崛起，有时会在那里住下；但通常是那些疲惫不堪、挨饿、无家可归的创造者在他们孤独的地方的黑暗角落里滚来滚去——可怜的生物无法达到两便士的绳索。 “先生，那条两便士的绳子，”韦勒先生回答说，“只是一间廉价的住处，那里的床每晚两便士。” “保佑你的清白，先生，不是这样，”山姆回答。 &#39;ven the Lady and gen&#39;l&#39;m&#39;n as keep the hot-el first start business,他们过去常常在地板上铺床；但这不会不惜一切代价，“因为相反”要适度地睡一觉，房客们过去常常在那里躺半天。所以现在他们有两根绳子，大约相距六英尺，三根绳子离地板，直接穿过房间；床是由粗麻布片铺成的，铺在“床单”上。 “嗯，”韦勒先生说，“这个计划的好处是显而易见的。”每天早上六点钟，他们松开绳索一端，房客倒下。结果是，被彻底唤醒，他们安静地起床，然后走开！\n我们需要注意，我认为，在这段话和我们感兴趣的互联网比喻之间有一些明确的比较，这确实表明它们之间存在某种联系。早上起来第一件事就是松开绳子；它在小时结束时被撤消；这样做的目的是将睡眠者毫不客气地放在地板上，以便他们醒来并离开房屋。最后，我认为值得报告一个由 Casebook 的贡献者之一进行的实际实验，Casebook 是一个在线论坛，专门讨论 1880 年代开膛手杰克谋杀案和伦敦东区。这位听说过两便士宿醉故事的作家试图为自己重新创造这种体验——结果很有趣（在此进行了修正以纠正拼写和错别字）：在我第一次在绳索上度过的第一个晚上之后，我可以说......很不舒服。抱歉，还没有照片，因为昨晚只有我一个人在家。我首先试着站着睡觉，面对绳子，双臂悬在上面。那只持续了大约3分钟。我觉得这种方法最不可能，因为除了支撑身体的绳索之外，没有任何东西，你就不能留在上面。如果你能够入睡，你的腿会变得跛行，你会跌倒。接下来，我试着面对绳子坐着，双臂悬垂。这种方法是可行的，但前提是你很累。用这种方法你发现的第一件事是，除非你的手臂和绳子之间有一大块卷起来的材料，否则你的手臂会比你先入睡。接下来，我试着将前额放在绳索上向前倾。这比其他两个尝试要舒服得多，我可以这样睡觉。这就像把你的头靠在你面前的桌子上——或者在校车的靠背上，正如我听到一个人所说的那样。缺点是如果绳子上的人多，有人挪动它，你就会掉下来。最后，我试着向后靠在绳子上，双臂悬在上面。这个位置实际上很好地支撑了我的身体，但不是我的头。到目前为止，它仍然是最好的位置，我实际上睡了大约一个小时。\n总之，我认为我们可以说的是，也许我们实际上并不需要两便士宿醉的第一手资料来了解它所具有的力量。即使是对这样一个地方的二手描述，也会在脑海中创造一个非常生动的视觉形象，一个立即明显“退化”的形象。我强烈怀疑，正是这一点解释了现代“两便士宿醉”比喻的流行，当然，这也是为什么为火车大劫案设计布景的人选择描绘披在晾衣绳上的穷人肮脏的房间。很明显，这些人是最低等的。我们立刻明白，他们已经深入维多利亚社会的深处。描绘同一群人倒在长凳上，头靠在用绳索支撑的手臂和肘部上，不会如此戏剧化或有影响力。鉴于这些结果和这些观察，我确实想知道对狄更斯的名言“双便士绳”的朦胧回忆是否可能不是我们正在探索的比喻的起源。让我们记住，它发表在整个 19 世纪最畅销的小说之一中，狄更斯本人用它来迷惑匹克威克先生。可能是这句话去掉了皮克威克论文与一张粗糙的麻袋床的联系，在读者的脑海中创造了一个如此生动的形象——一个随后被想象填充和详细描述的形象？如果有人告诉你有人睡在“两便士绳”上，你的脑海中会浮现出什么样的画面？鉴于此类房屋明显缺乏第一人称的描述，我很想建议这可能解释了雅各布·里斯在 1880 年代在美国听到的谣言——但与更早的“旧国家”有关——实际上开始了。在头脑中创造的画面的纯粹生动性同样可能是我们在火车大劫案中如此震撼的富有想象力的重建的原因 - 以及“两便士宿醉”互联网比喻，用现代重建或重新利用在确实存在的各种旅馆中拍摄的图像，使今天的互联网浏览器相信这种旅馆实际上非常普遍。我说诱惑。我不确定。但在我承认 21 世纪流行的“两便士宿醉”概念有任何事实依据之前，我当然希望看到新的、当代的证据。", "note_en": "The image above shows a recreation of what is supposed to be a “ twopenny hangover“. It’s a term increasingly commonly found on Google, and it purports to describe a type of cheap Victorian-era doss-house in which indigents could secure shelter and rest for the night more cost-effectively than by paying the cost of a bed, which typically cost fourpence or fivepence. The idea was that, in exchange for the payment, the poor would be allowed to sleep, several men at a time, draped over a rope that had been suspended across a room at chest level.\n Acceptance that such places actually existed has become widespread over the past few years, and a look at a   Google Image search for the term “twopenny hangover” shows at least four different pictures that supposedly depict examples. This one, which is by a distance the most detailed and explicit, is actually a still from a 1978 Sean Connery/Michael Crichton caper,   The Great Train Robbery, which is set in the London of the middle 1850s; the others have been pulled into the gallery below. Two of these, which seem pretty similar at first glance, can be seen to depict a rather different sort of lodging house when they’re examined closely.\n   So far as I can tell, the term “twopenny hangover” (sometimes corrupted, in online sources, to become the “ penny hang“) originates with George Orwell, who – in his highly influential  Down and Out in Paris and London (1933), a book which was based on his own experience of living on the margins of poverty during the Great Depression – wrote that\n  at the Twopenny Hangover, the lodgers sit in a row on a bench; there is a rope in front of them, and they lean on this as though leaning over a fence. A man, humorously called the valet, cuts the rope at five in the morning.\n  Orwell did not claim to have visited a lodging house of this sort himself; his details came from an informant, a London pavement artist he called Bozo, though he said he was aware of “similar” places in Paris. You’ll note, in addition, that his description of the system used in such places does not actually match the recreation in  The Great Train Robbery, since Orwell was clear that men in these establishments slept in a sitting position and merely leaned forward to support their upper bodies on the rope. A reconstruction of this sort of lodging featured some years ago in the 2016 BBC series “The Victorian slum”, in which “a group of 15 volunteers aged between 10 and 59 are transported back to Victorian London as they spend three weeks living and working in a recreation of the notorious Old Nichol slum in Bethnal Green in London’s East End.” It can be glimpsed  in this video trailer for the series, 11 seconds in.\n Tracing the same basic story back to the 19th century, we next need to notice another very well-known account,  How the Other Half Lives by  Jacob Riis, which is a book by a social reformer about life below the poverty line in the New York City of the 1880s. Riis’s book was published in 1890 and is especially notable for the flash photographs that he took to illustrate it. The author includes an entire chapter on the “cheap lodging houses” of the city, and delineates the downward progression from varied from relatively salubrious 25–cent-a-night properties, where “guests” could at least expect their own bed, flimsily partitioned, down through 15–cent dives where the residents slept four deep on filthy bunks, to 10–cent properties, where, Riis observes, “the locker for the sleeper’s clothes disappears. There is no longer need of it. The tramp limit is reached, and there is nothing to lock up, save, on general principle, the lodger.”\n  Below the 10 cent houses there was a further sort of establishment which charged seven cents a night in which the “bed” provided was a strip of canvas strung between two “rough timbers”. All these places did exist, and Riis visited them himself, but he adds a note to the effect that he has heard it rumoured that a cheaper sort of lodging might also be found, though “so far as I am informed, it has never been introduced in this country.” This was something that “use to be practiced, if reports spoke truly, in certain old-country towns” [he means European ones], where\n the “bed” was represented by clothes-lines stretched across the room upon which sleepers hung by the arm-pits for a penny a night. In the morning the boss woke them up by simply untying the line at one end and letting it go with its load; a labour-saving device certainly, and highly successful in attaining the desired end.\n   His description of the way such houses operated is the closest match we have to the sort of place shown in our film still, and to the “twopenny hangover” internet trope in general\n Nonetheless, the clothes-line joints that Riis had heard of operate a little differently to the lodging houses of internet legend. They cost only half as much, and instead of the rope being “cut” each morning (which would seem pretty wasteful of rope), it is merely untied\n  This latter point is particularly interesting in that German archives do offer two images – one a drawing dating to before 1909, and the other a photograph that might, possibly, date to 1929 or 1930. But both these images show establishments that very closely resemble Orwell’s description of a “twopenny hangover” – complete with sleepers seated at a bench – rather than a clothes-line house.\n The drawing  apparently comes from the well-known German socialist Eduard Fuchs’s six-volume  Illustrierte Sittengeschichte vom Mittelalter bis zur Gegenwart, an exploration of the customs and culture of the period. The photograph apparently shows jobless men in a depression-era “emergency shelter” – several of the versions that appear online  claim it was taken in Hamburg, and Brooman’s 1985 school textbook  Weimar Germany: Germany 1918-1933 prints it with the caption: “These men have paid to sleep ‘on the line’ in a warm room during the winter of 1930. The rope holds them up while they sleep.” More work would need to be done to trace both these images to their source and, hopefully, confirm at least some of these details. I have some doubts about the drawing in particular, because, while the image caption associates it with the Salvation Army,  which had indeed operated in Germany since 1886, it very closely resembles the sort of style used in late Victorian-era British illustrated newspapers, and I’m not sure if the same style was equally common in Germany. But the key point seems to be that, if establishments like this were the source of the rumours that Riis got hold of, those rumours seem to have made them less comfortable and more desperate than they actually were.\n Thus far, you’ll note, we’ve got no further back than the 1880s, and the stories that Riis refers to can’t, so far as I have been able to establish, be traced in reports that date any earlier than that; an attempt to search for the term “twopenny hangover” in the online British Newspaper Archive, for instance, produced nothing but 1930s references to Orwell’s book. Henry Mayhew, whose four-volume  London Labour and the London Poor (1851) was compiled from years’ worth of interviews with hundreds of informants, and remains an inexhaustible fount of information concerning the lives of the working classes of Victorian London,  devotes a section of his work to lodging houses, but while he describes a variety of different kinds of establishments, and lists plenty of horrors – the man who set up four doss-houses using beds he’d purchased from the defunct Kings Cross Smallpox Hospital is probably the worst – he makes no mention of any place that did not at least provide its occupants with beds, however lice-ridden. There is, however, one  literary account of something resembling the type of place we’ve been considering, and which dates as far back as the 1830s, and this is a passage that appears in Dickens’s  The Pickwick Papers.\n Dickens, of course, was an experienced newspaper reporter with a longstanding interest in low-life, and there is quite an extensive literature on the extent to which this book should be seen as an example of realism – but, while it has not, so far as I can say, been shown that the sort of establishment described below really did exist in the London of the late Georgian period, a close reading suggests it might be possible that Dickens’s famous and best-selling account somehow contributed to the rumours that Jacob Riis heard half a century later; note the telling repetition of the detail of how the rope was “undone” each morning to terminate the sleepers’ rest. In addition, this passage bears such strong similarities in terms of its terminology to Orwell’s that it may have been an inspiration for the “twopenny hangover” as well. Yet note – here as before – that the sleeping arrangements described only very superficially resemble the situation shown in the image from  The Great Train Robbery.\n  The speaker here is Pickwick’s cockney manservant, Sam Weller, who explains that, at one low point in his life, he was forced to take “unfurnished lodgin’s for a fortnight”:\n ‘Yes – the dry arches of Waterloo Bridge. Fine sleeping-place – within ten minutes’ walk of all the public offices – only if there is any objection to it, it is that the sitviation’s rather too airy. I see some queer sights there.’\n ‘Ah, I suppose you did,’ said Mr. Pickwick, with an air of considerable interest.\n ‘Sights, sir,’ resumed Mr. Weller, ‘as ‘ud penetrate your benevolent heart, and come out on the other side. You don’t see the regular waygrants there; trust ’em, they knows better than that. Young beggars, male and female, as hasn’t made a rise in the profession, takes up their quarters there sometimes; but it’s generally the worn-out, starving, houseless creators as roll themselves in the dark corners o’ them lonesome places – poor creatures as ain’t up to the twopenny rope.’\n  ‘The twopenny rope, sir,’ replied Mr. Weller, ‘is just a cheap lodgin’ house, where the beds is twopence a night.’\n  ‘Bless your innocence, sir, that ain’t it,’ replied Sam. ‘Ven the lady and gen’l’m’n as keeps the hot-el first begun business, they used to make the beds on the floor; but this wouldn’t do at no price, ‘cos instead o’ taking a moderate twopenn’orth o’ sleep, the lodgers used to lie there half the day. So now they has two ropes, ’bout six foot apart, and three from the floor, which goes right down the room; and the beds are made of slips of coarse sacking, stretched across ’em.’\n  ‘Well,’ said Mr. Weller, ‘the adwantage o’ the plan’s hobvious. At six o’clock every mornin’ they lets go the ropes at one end, and down falls the lodgers. Consequence is, that being thoroughly waked, they get up wery quietly, and walk away!‘\n We need to note here, I think, that there are a couple of clear comparisons between this passage and the internet trope we’re interested in that do suggest to me there’s some connection between them. A rope is let go first thing in the morning; it’s undone at the top of the hour; and the purpose of doing so is to deposit sleepers unceremoniously on the floor, so that they wake up and vacate the premises.\n Finally, I think it’s worth reporting on a practical experiment that was tried by one of the contributors to Casebook, an online forum devoted to the Jack the Ripper murders and the East End of London in the 1880s. The writer, who had heard the story of the twopenny hangover,  attempted to recreate the experience for himself – with interesting results (amended here to correct spelling and typos):\n After my first night on the ropes, I can say…..man that was uncomfortable. Sorry, no pictures yet, because I was the only one home last night.\n I first tried to sleep standing up, facing the rope with my arms hanging over it. That only lasted about 3 minutes. I find this method most improbable, because without anything other than the rope supporting the body you cannot stay on it. If you were ever able to get to sleep, your legs would go limp and you’d fall off.\n Next, I tried sitting facing the rope, arms hanging over. This method would be possible, but only after you are very tired. The first thing you find out with this method is that, unless you have a large rolled-up piece of material between your arms and the rope, your arms will fall asleep before you do.\n Next, I tried leaning forward with my forehead on the rope. This was much more comfortable that the other two tries, and I could sleep this way. It’s the same as resting your head on the desk in front of you – or the seat-back on the school bus, as I heard one person put it. The drawback is that if there are more people on the rope and someone moves it, you will fall off.\n Last, I tried leaning back against the rope with my arms hanging over it. This position actually supported my body very well, but not my head. It was by far still the best position, and I actually slept for about an hour.\n What I think we  can say, in conclusion, is that maybe we don’t actually need a first-hand account of a twopenny hangover to understand the power that it holds. Even a second-hand description of such a place creates a very vivid, visual image in the mind’s eye, one that’s immediately and obviously “degraded”. It’s this, I strongly suspect, that explains the popularity of the modern “twopenny hangover” trope, and it is also, surely, why the people who designed the sets for  The Great Train Robbery chose to depict indigents draped over a clothes line in a filthy room. It’s instantly apparent that these men are the lowest of the low. We understand at once that they have plumbed the depths of Victorian society. Depicting the same group of men slumped at a bench, their heads resting on arms and elbows supported by ropes, would not be remotely so dramatic or impactful.\n  Given these outcomes and these observations, I do wonder whether hazy recollection of Dickens’s telling phrase “twopenny rope” may not be the origin of the trope that we’re exploring. It was published, let’s remember, in one of the best-selling novels of the whole nineteenth century, and it was shown by Dickens himself to befuddle Mr Pickwick. Might it be that this phrase, stripped of its  Pickwick Papers association with a rough sacking bed, created just such a vivid image in its readers’ minds – one that was subsequently filled in and detailed by imagination? What sort of picture would  your mind conjure if you were told that someone slept on a “twopenny rope”?\n Given the apparent lack of first-person descriptions of such houses, I am very tempted to suggest that this might explain how the rumours that Jacob Riis heard in the US in the 1880s – but associated with the “old country” some time earlier – actually got started. The sheer vividness of the picture that’s created in the mind’s eye might, equally, be responsible for the imaginative reconstruction we have been so struck by in  The Great Train Robbery – and for the “twopenny hangover” internet trope which, illustrated with modern reconstructions or repurposed images taken in the sorts of lodging houses that actually did exist, persuades browsers of the internet today that such lodgings actually were quite common.\n I say tempted. I’m not certain. But I’d certainly want to see fresh, contemporary evidence before I conceded that the popular 21st century conception of the “twopenny hangover” had any basis in fact.", "posttime": "2021-07-29 21:25:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "便士,twopenny,绳子", "title": "两便士宿醉", "title_en": "The Twopenny Hangover", "transed": 1, "url": "https://mikedashhistory.com/2021/05/19/the-twopenny-hangover/", "via": "", "real_tags": ["便士", "twopenny", "绳子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070178, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "背景 新描述的 SARS-CoV-2 谱系 C.37 最近根据其在南美国家的高流通率和刺突蛋白中存在的关键突变，被世界卫生组织（WHO）归类为感兴趣的变体（Lambda 变体）。这种突变对中和抗体的感染性和免疫逃逸的影响是完全未知的。方法 我们进行了假型病毒中和试验，并使用来自智利圣地亚哥两个中心的医护人员 (HCW) 的血浆样本确定了 Lambda 变体对感染性和免疫逃逸的影响，他们接受了灭活病毒疫苗 CoronaVac 的两剂方案.结果我们观察到由 Lambda 刺突蛋白介导的感染性增加，甚至高于 D614G（谱系 B）或 Alpha 和 Gamma 变体。与野生型（谱系 A）相比，Lambda 变体的中和作用降低了 3.05 倍，而 Gamma 变体降低了 2.33 倍，Alpha 变体降低了 2.03 倍。结论我们的结果表明，存在于感兴趣的 Lambda 变体的刺突蛋白中的突变会增加对 CoronaVac 引发的中和抗体的感染性和免疫逃逸。这些数据强化了这样一种观点，即在 SARS-CoV-2 高传播国家的大规模疫苗接种活动必须伴随着严格的基因组监测，以便识别携带尖峰突变的新分离株和免疫学研究，旨在确定这些突变对免疫逃逸和免疫逃逸的影响。疫苗突破。 ANID 智利通过 Fondecyt 拨款编号 1190156 (RS-R.)、1211547 (FV-E.) 和 1181656 (AG) 为作者提供支持 我确认已遵循所有相关的道德准则，并且任何必要的 IRB 和/或道德委员会批准均已获得已获得。为所述研究提供批准或豁免的 IRB/监督机构的详细信息如下：\n该研究方案得到了智利大学医学院伦理委员会（项目编号 0361-2021 和编号 096-2020）和 Clinica Santa Maria（项目编号 132604-21）的批准。所有参与者都签署了知情同意书，并且他们的样本是匿名的。已获得所有必要的患者/参与者同意，并已存档适当的机构表格。我了解所有临床试验和任何其他前瞻性干预研究必须在 ICMJE 批准的注册中心注册，例如 ClinicalTrials.gov。我确认手稿中报告的任何此类研究已注册并提供试验注册 ID（注意：如果发布回顾性注册的前瞻性研究，请在试验 ID 字段中提供声明，解释为什么未提前注册该研究） .我已遵循所有适当的研究报告指南，并上传了相关的 EQUATOR Network 研究报告清单和其他相关材料作为补充文件（如果适用）。", "note_en": "Background The newly described SARS-CoV-2 lineage C.37 was recently classified as a variant of interest by the WHO (Lambda variant) based on its high circulation rates in South American countries and the presence of critical mutations in the spike protein. The impact of such mutations in infectivity and immune escape from neutralizing antibodies are entirely unknown.\n Methods We performed a pseudotyped virus neutralization assay and determined the impact of the Lambda variant on infectivity and immune escape using plasma samples from healthcare workers (HCW) from two centers in Santiago, Chile who received the two-doses scheme of the inactivated virus vaccine CoronaVac.\n Results We observed an increased infectivity mediated by the Lambda spike protein that was even higher than that of the D614G (lineage B) or the Alpha and Gamma variants. Compared to the Wild type (lineage A), neutralization was decreased by 3.05-fold for the Lambda variant while it was 2.33-fold for the Gamma variant and 2.03-fold for the Alpha variant.\n Conclusions Our results indicate that mutations present in the spike protein of the Lambda variant of interest confer increased infectivity and immune escape from neutralizing antibodies elicited by CoronaVac. These data reinforce the idea that massive vaccination campaigns in countries with high SARS-CoV-2 circulation must be accompanied by strict genomic surveillance allowing the identification of new isolates carrying spike mutations and immunology studies aimed to determine the impact of these mutations in immune escape and vaccines breakthrough.\n    ANID Chile supports the authors through Fondecyt grants numbers 1190156 (R.S-R.), 1211547 (F.V.-E.) and 1181656 (A.G.)\n  I confirm all relevant ethical guidelines have been followed, and any necessary IRB and/or ethics committee approvals have been obtained.\n  The details of the IRB/oversight body that provided approval or exemption for the research described are given below:\n The study protocol was approved by the Ethics Committee of the Faculty of Medicine at Universidad de Chile (Projects No 0361-2021 and No 096-2020) and Clinica Santa Maria (Project No132604-21). All participants signed the informed consent, and their samples were anonymized.\n All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.", "posttime": "2021-07-29 21:25:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免疫,immune,注册", "title": "感兴趣的新型 SARS-CoV-2 变体 Lambda 的感染性和免疫逃逸", "title_en": "Infectivity and immune escape of the new SARS-CoV-2 variant of interest Lambda", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2021.06.28.21259673v1", "via": "", "real_tags": ["免疫", "immune", "注册"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2009 年 7 月 程序员如此不喜欢会议的一个原因是他们的日程安排与其他人不同。会议花费更多。有两种类型的日程安排，我将其称为经理日程安排和制造商日程安排。经理的日程安排是禁止的。它体现在传统的约会簿中，每天都被切成一小时的时间间隔。如果需要，您可以为单个任务安排几个小时，但默认情况下，您每小时都会更改您正在做的事情。当你以这种方式利用时间时，与某人见面只是一个实际问题。在您的日程安排中找到一个空位，预订它们，您就完成了。大多数有权势的人都在经理的日程安排上。这是命令的时间表。但是还有另一种使用时间的方式，这在程序员和作家中很常见。他们通常喜欢以至少半天为单位来使用时间。以小时为单位，你不能很好地编写或编程。这几乎是开始的时间。当您按照制造商的时间表进行操作时，会议就是灾难。一个单独的会议可以吹一整个下午，把它分成两部分，每个部分都太小而无法做任何困难的事情。另外，你必须记得参加会议。这对于经理日程上的某个人来说没有问题。接下来的一个小时总会有事情发生；唯一的问题是什么。但是，当制造商日程表上的某个人开会时，他们必须考虑一下。对于制造商日程表上的某个人来说，开会就像抛出一个例外。它不仅会导致您从一项任务切换到另一项任务；它会改变您的工作模式。我发现一次会议有时会影响一整天。一个会议通常至少要吹半天，一个上午或一个下午就分手。但除此之外，有时还会产生连锁效应。如果我知道下午会被打破，我就不太可能在早上开始一些雄心勃勃的事情。我知道这听起来可能过于敏感，但如果您是制造商，请考虑您自己的情况。一想到一整天都可以自由工作，完全没有约会，您的精神会不会振作起来？嗯，这意味着当你不这样做时，你的精神会相应地沮丧。雄心勃勃的项目顾名思义就是接近你能力的极限。士气的小幅下降足以杀死他们。每种类型的时间表都可以正常工作。当他们相遇时就会出现问题。由于大多数有权势的人都按照经理的时间表运作，如果他们愿意，他们可以让每个人以他们的频率产生共鸣。但是更聪明的人会克制自己，如果他们知道为他们工作的一些人需要很长时间才能工作。我们的情况很不寻常。几乎所有的投资者，包括我认识的所有 VC，都按照经理的时间表运作。但是 Y Combinator 按照制造商的时间表运行。 Rtm、Trevor 和我这样做是因为我们总是这样做，而 Jessica 也这样做，主要是因为她已经与我们保持同步。如果开始有更多像我们这样的公司，我不会感到惊讶。我怀疑创始人可能越来越能够抵制或至少推迟转变为经理，就像几十年前他们开始能够抵制从牛仔裤转向西装一样。我们如何设法在 maker 的日程安排上为这么多初创公司提供建议？通过使用经典设备在 maker 的办公时间内模拟经理的日程安排。每周我都会留出好几次时间去见我们资助的创始人。这些时间段是在我工作日结束时，我编写了一个注册程序，以确保给定办公时间内的所有约会都集中在最后。因为他们是在我一天结束的时候来的，所以这些会议永远不会中断。 （除非他们的工作日和我的工作日同时结束，否则会议可能会打断他们，但既然是他们预约的，那对他们来说肯定是值得的。）在繁忙的时期，办公时间有时会很长，他们压缩了一天，但他们从不打断它。上世纪 90 年代，当我们在自己的初创公司工作时，我开发了另一种划分一天的技巧。我以前每天从晚餐到凌晨 3 点左右编程，因为晚上没有人可以打扰我。然后我会睡到上午 11 点左右，然后进来工作直到晚餐，我称之为“商业活动”。我从来没有想过这些，但实际上我每天有两个工作日，一个在经理的日程表上，一个在制造商的日程表上。当你按照经理的时间表运作时，你可以做一些你永远不想在制造商的时间表上做的事情：你可以有推测性的会议。你可以遇见某人只是为了互相了解。如果你的日程安排中有空位，为什么不呢？也许结果是你们可以以某种方式互相帮助。硅谷（以及整个世界，就此而言）的商界人士一直在进行投机性会议。如果你在经理的日程安排上，他们实际上是免费的。它们是如此常见，以至于提出它们时有独特的语言：例如，说你想“喝咖啡”。但是，如果您在制造商的日程安排中，那么推测性会议的成本会非常高。这让我们陷入了困境。每个人都假设，像其他投资者一样，我们按照经理的时间表运行。所以他们把我们介绍给他们认为我们应该见面的人，或者给我们发一封电子邮件，建议我们喝杯咖啡。这时候我们有两个选择，都不是一个好办法：我们可以和他们见面，浪费半天的工作；或者我们可以尽量避免与他们见面，并可能冒犯他们。直到最近，我们自己都不清楚问题的根源。我们只是理所当然地认为我们不得不破坏我们的日程安排或冒犯他人。但是现在我已经意识到发生了什么，也许还有第三种选择：写一些东西来解释这两种类型的日程安排。也许最终，如果经理的时间表和制造商的时间表之间的冲突开始被更广泛地理解，问题就会变得不那么重要。我们这些在制造商时间表上的人愿意妥协。我们知道我们必须举行一些会议。我们只要求经理日程表上的人了解成本。感谢 Sam Altman、Trevor Blackwell、Paul Buchheit、Jessica Livingston 和 Robert Morris 阅读本文的草稿。有关的：", "note_en": "July 2009  One reason programmers dislike meetings so much is that they&#39;re ona different type of schedule from other people. Meetings cost themmore.  There are two types of schedule, which I&#39;ll call the manager&#39;sschedule and the maker&#39;s schedule. The manager&#39;s schedule is forbosses. It&#39;s embodied in the traditional appointment book, witheach day cut into one hour intervals. You can block off severalhours for a single task if you need to, but by default you changewhat you&#39;re doing every hour.  When you use time that way, it&#39;s merely a practical problem to meetwith someone. Find an open slot in your schedule, book them, andyou&#39;re done.  Most powerful people are on the manager&#39;s schedule. It&#39;s theschedule of command. But there&#39;s another way of using time that&#39;scommon among people who make things, like programmers and writers.They generally prefer to use time in units of half a day at least.You can&#39;t write or program well in units of an hour. That&#39;s barelyenough time to get started.  When you&#39;re operating on the maker&#39;s schedule, meetings are adisaster. A single meeting can blow a whole afternoon, by breakingit into two pieces each too small to do anything hard in. Plus youhave to remember to go to the meeting. That&#39;s no problem for someoneon the manager&#39;s schedule. There&#39;s always something coming on thenext hour; the only question is what. But when someone on themaker&#39;s schedule has a meeting, they have to think about it.  For someone on the maker&#39;s schedule, having a meeting is likethrowing an exception. It doesn&#39;t merely cause you to switch fromone task to another; it changes the mode in which you work.  I find one meeting can sometimes affect a whole day. A meetingcommonly blows at least half a day, by breaking up a morning orafternoon. But in addition there&#39;s sometimes a cascading effect.If I know the afternoon is going to be broken up, I&#39;m slightly lesslikely to start something ambitious in the morning. I know thismay sound oversensitive, but if you&#39;re a maker, think of your owncase. Don&#39;t your spirits rise at the thought of having an entireday free to work, with no appointments at all? Well, that meansyour spirits are correspondingly depressed when you don&#39;t. Andambitious projects are by definition close to the limits of yourcapacity. A small decrease in morale is enough to kill them off.  Each type of schedule works fine by itself. Problems arise whenthey meet. Since most powerful people operate on the manager&#39;sschedule, they&#39;re in a position to make everyone resonate at theirfrequency if they want to. But the smarter ones restrain themselves,if they know that some of the people working for them need longchunks of time to work in.  Our case is an unusual one. Nearly all investors, including allVCs I know, operate on the manager&#39;s schedule. But  Y Combinatorruns on the maker&#39;s schedule. Rtm and Trevor and I do because wealways have, and Jessica does too, mostly, because she&#39;s gotteninto sync with us.  I wouldn&#39;t be surprised if there start to be more companies likeus. I suspect founders may increasingly be able to resist, or atleast postpone, turning into managers, just as a few decades agothey started to be able to resist switching from jeansto suits.  How do we manage to advise so many startups on the maker&#39;s schedule?By using the classic device for simulating the manager&#39;s schedulewithin the maker&#39;s: office hours. Several times a week I set asidea chunk of time to meet founders we&#39;ve funded. These chunks oftime are at the end of my working day, and I wrote a signup programthat ensures all the appointments within a given set of office hoursare clustered at the end. Because they come at the end of my daythese meetings are never an interruption. (Unless their workingday ends at the same time as mine, the meeting presumably interruptstheirs, but since they made the appointment it must be worth it tothem.) During busy periods, office hours sometimes get long enoughthat they compress the day, but they never interrupt it.  When we were working on   our own startup, back in the 90s, I evolvedanother trick for partitioning the day. I used to program fromdinner till about 3 am every day, because at night no one couldinterrupt me. Then I&#39;d sleep till about 11 am, and come in andwork until dinner on what I called &#34;business stuff.&#34; I never thoughtof it in these terms, but in effect I had two workdays each day,one on the manager&#39;s schedule and one on the maker&#39;s.  When you&#39;re operating on the manager&#39;s schedule you can do somethingyou&#39;d never want to do on the maker&#39;s: you can have speculativemeetings. You can meet someone just to get to know one another.If you have an empty slot in your schedule, why not? Maybe it willturn out you can help one another in some way.  Business people in Silicon Valley (and the whole world, for thatmatter) have speculative meetings all the time. They&#39;re effectivelyfree if you&#39;re on the manager&#39;s schedule. They&#39;re so common thatthere&#39;s distinctive language for proposing them: saying that youwant to &#34;grab coffee,&#34; for example.  Speculative meetings are terribly costly if you&#39;re on the maker&#39;sschedule, though. Which puts us in something of a bind. Everyoneassumes that, like other investors, we run on the manager&#39;s schedule.So they introduce us to someone they think we ought to meet, orsend us an email proposing we grab coffee. At this point we havetwo options, neither of them good: we can meet with them, and losehalf a day&#39;s work; or we can try to avoid meeting them, and probablyoffend them.  Till recently we weren&#39;t clear in our own minds about the sourceof the problem. We just took it for granted that we had to eitherblow our schedules or offend people. But now that I&#39;ve realizedwhat&#39;s going on, perhaps there&#39;s a third option: to write somethingexplaining the two types of schedule. Maybe eventually, if theconflict between the manager&#39;s schedule and the maker&#39;s schedulestarts to be more widely understood, it will become less of aproblem.  Those of us on the maker&#39;s schedule are willing to compromise. Weknow we have to have some number of meetings. All we ask from thoseon the manager&#39;s schedule is that they understand the cost.       Thanks to Sam Altman, Trevor Blackwell, Paul Buchheit, Jessica Livingston,and Robert Morris for reading drafts of this.     Related:", "posttime": "2021-07-29 21:25:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "时间表,schedule,会议", "title": "制造商的时间表，经理的时间表（2009）", "title_en": "Maker's Schedule, Manager's Schedule (2009)", "transed": 1, "url": "http://www.paulgraham.com/makersschedule.html", "via": "", "real_tags": ["时间表", "schedule", "会议"]}, {"category": "", "categoryclass": "", "imagename": "723bc61bd5ee86aa782f85a923eeab18.png", "infoid": 1070176, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一年里，由于资本市场的意外反弹，Zerodha 的客户群增加了两倍多，显着增加了我们平台上的并发用户数量以及它们在后台众多系统上产生的流量和负载。就上下文而言，在 2020 年 1 月，我们每天处理 2 多万笔零售交易。到2020年4月，它已经上升到7+百万。今天，它上升到 12+ 百万。我们的用户群从去年的 2+ 百万增加到 6+ 百万。我们从未预见到我们在十年内缓慢且可预测地增长的客户群会在不到一年的时间内增加两倍。也不是我们曾经尝试过这样做。然而，当它确实发生时，我们能够调整我们的软件、基础设施和组织，而对我们的堆栈只有名义上的影响，并且技术和基础设施成本的增加可以忽略不计。这包括由于 2020 年的 Covid 封锁，我们的 1000 多名员工几乎在一夜之间就过渡到全职远程工作。与此同时，我们去年有 30 名成员的技术团队现在已经达到 31 名。媒体和社交媒体对增长的狂热在商业领域引起了相当大的兴趣，并且有许多疑问：我们如何管理我们的系统和成本以应对资本市场活动的隔夜爆炸？这篇文章是关于我们在 Zerodha 使用的现实生活实践的各种笔记，以及来自该行业的许多第一手见解，对我们来说，这些都是关于如何不运营技术组织的重要教训。这些说明表明，技术组织及其系统应对未来不确定性和极端波动的能力可以植根于常识第一原则。这些原则可以增加事物在适当的、几乎是偶然的时刻自然而然地落入正确位置的几率。这里的许多因素更人性化，更哲学而不是技术，这些笔记也是如此。并不是说这些是普遍适用的，但由于它们对我们有用，因此也可能对其他人有用。与往常一样，阅读这些轶事时应该对上下文和所涉及的权衡有健康和理性的认识。\n事实上，“打样”是一种边缘矛盾。软件可以迅速变化并很快过时。就像物理对象一样，闪亮的新软件可以使旧软件看起来过时，偏向技术决策并显着改变其未来的准备情况。矛盾的是，当一个人缩小一点时，软件在很长一段时间内几乎没有变化。半个世纪以来的 C 语言仍然被广泛使用，并且在句法或语义上几乎没有变化，新的语言继续大量借用它。与 SQL 相同。与函数式和面向对象编程等范式相同；同步和异步网络通信； RPC 和 IPC；内核; RDBM 和基于行和列的数据建模；列表、字典和地图；等等……虽然计算概念很少变化且缓慢，但它们的具体化身和表现形式可能会迅速变化，并时时流行。多年来变得无聊的东西突然可以重新发明并再次流行起来，例如在服务器端呈现 HTML 并将结果通过网络发送到浏览器（！），或共享中的无状态“功能”（程序）环境（还记得 /*.php 和 /cgi-bin/?）。软件趋势往往具有惊人的周期性。让我想起科幻系列黑暗中的一句话“开始是结束，结束是开始”，卡兰在看了一集后随意地试图冒充他自己。他实际上并没有，但正如俗话所说，“All Threads Digress To Karan”。这种基本的认识，即计算概念与其特定实现不同，很少发生变化，这是构建更有可能为未来做好准备的系统的第一步。重要的是要了解软件的过去和现在的格局，以了解什么是真正的新事物，什么是旧的，以及影响技术决策的重要因素。在评估技术时，无论是 Javascript 框架还是全新的技术，我们都以此作为衡量标准。例如，我们决定在 2018 年将我们的移动应用程序移植到 Flutter（在两周内编写了一个快速原型之后），当时 Flutter 还处于 alpha 阶段——经过计算的风险得到了很好的回报。在构建某些东西时，知道何时何地划清界限是很困难的。开发人员——我当然是这样——倾向于无休止地调整系统，使它们进入“完美”状态，以消除不完整感； “还没准备好。再多一点”。这种感觉永远不会真正消失，但通过实践和成败的生产经验，可以凭直觉判断出什么东西已经足够好，可以通过所有实际方式进行交付。此外，在瞬息万变的商业环境中，追求“完美”状态可能是一件傻事。在像资本市场这样受到严格监管的行业中，监管可能会突然出现并在一夜之间改变企业的运营方式，迫使软件在几乎没有时间计划的情况下进行重构和重写。例如，在 2020 年年中，印度资本市场监管机构规定了大约四个星期的最后期限，以彻底改变在此之前在交易平台上出售股票的方式。曾经是当用户单击卖出按钮时发送到交易所的实时交易，现在需要在由称为存管机构的市场机构运营的外部网关上获得基于 PIN 的授权。毋庸置疑，这迫使在几乎没有时间进行测试的情况下，通过关键的实时金融系统进行一系列重大的级联更改。销售证券的 UI 和 UX 必须在跨网络的交易平台、移动平台和构建在我们系统之上的多个外部平台上进行更改。不仅如此，数以百万计的用户需要登录到这个外部网关来设置他们的 PIN 并在短时间内了解这个全新的流程。此后不久，法规再次发生变化，除了 PIN 之外，还为此网关引入了新的 SMS OTP。紧接着，另一项法规改变了这些授权的有效性，迫使跨系统进行更多更改。虽然这些符合散户投资者的利益，但对于开发商来说，在令人难以置信的紧迫期限内，它们是极具风险的变化。因此，在许多环境中，务实不是一种选择，而是一种必要。\n这种实用主义必须在核心特性和功能、代码质量可扩展性、运行和服务其功能的稳定性、市场条件、法律法规以及定义明确且不太可能快速变化的 API/UI 规范之间取得适当的平衡.这里的 API/UI 是在抽象意义上使用的。它可以表示命令行界面、文件或有线格式、网络调用、RPC 或 ABI——任何在与其他系统交互时做出某些承诺的层。关注界面设计给我们带来了意想不到的好处。当业务需求以意想不到的方式发生变化时，系统必须不可避免地重构或重写时，通常，唯一的一线希望是一个稳定的 API 规范，它保持与其他系统的兼容性，允许在不危及依赖项的情况下交换某些东西。稳定的 API 在同一程序的不同部分之间、不同系统之间，甚至组织中的整个部门之间建立了一定程度的关注分离——良好的旧模块化，通常错误地与微服务混为一谈。这通常意味着组织中的一个部门可以采取一次计划中的打击而不是同时进行多个打击，这是我们已经做过无数次的事情，如果多个部门和他们使用的重叠系统不是模块化的，这是不可能的够了。内部 API 和架构可以轻松更改和替换是一种常见的误解，这通常会导致内部 API 和集成的设计没有得到通常面向公众的 API 的关注和关注。随着内部系统变得复杂，深思熟虑的集成成为技术债务的可能性非常高。因此，尽早尝试使 API 规范尽可能正确非常重要，即使对于内部系统也是如此。常识性的软件设计、架构和服务分离可以产生远远超出性能优势的意想不到的好处。我在 Zerodha 最喜欢的例子是 Kite Connect，我们的 HTTP/JSON API 平台允许在我们的基础设施上构建成熟的交易和投资平台。整个 2013 年和 2014 年，在我们技术团队的早期，我们都忙于将组织内部的事物数字化，主要是编写 Python 脚本来自动化平凡的手动流程。建立交易平台甚至不是一个想法。 2014 年的某个时候，我们的 OMS（订单管理系统）供应商推出了一个基于网络的白标交易平台，我们可以将其提供给我们的用户。基于网络的交易平台是一个很小的利基市场，只有 Windows 的桌面交易平台主导了这个行业。当我亲眼看到它时，我对 Web 应用程序所传递的内容感到震惊。如果我没记错的话，它的突出特点是 IE6 不再是 2014 年的要求 &amp;mldr。我们突然决定我们需要构建一个可用的基于 Web 的交易平台。一项关键的、计划外的举措，最终将 Zerodha 转变为一家成熟的技术公司。当时我们的技术团队只有大约四五个人，我们之前都没有构建交易平台的经验，更不用说熟悉资本市场或金融了。幸运的是，OMS 供应商在 OMS 引擎之上有一组类似 SOAP 的 HTTP/XML API。这将为交易平台的买卖功能提供动力。在接下来的几周内，我将尝试了解文档记录不佳的 API 中高度不一致的路由和命名约定，将调用一一包装到 Python Web 服务器中具有一致字段名称的 HTTP/JSON 调用中。编写这个中间件以将供应商的怪异隐藏在我们愿意使用的一致 API 背后是有意义的。当然，这需要与供应商之间的几个月来回实际使上游 API 处于可用状态，然后进行数年的跟进以进行增量改进。这个新的 API 规范易于使用、理解，并且有足够的文档记录，让 Vivek 开始将它集成到他基于我的 UI“设计”开始构建的 Angular Web 前端中。我们正在发挥作用。 “风筝”这个名字暗示着操作简单、重量轻，可以达到隐喻的高度。\n大约在同一时间，我们开始意识到行业中必须存在高质量的终端用户软件，生态系统才能发展壮大，无论我们是否构建了它。虽然我们每天都看到印度推出了许多创新的最终用户应用程序，但由于繁琐的繁文缛节和由于百年行业的传统和总体现状而导致的极高进入壁垒，资本市场却一无所获。例如，直到 2017 年，由于法规不允许在线开户，用户必须打印、签署和快递约 40 页的表格才能在经纪商处开立账户。谁愿意在这样的行业中进行试验！在印度创办一家经纪公司过去（现在仍然如此）极其复杂，而邀请创新的唯一方法就是帮助技术人员摆脱繁文缛节，在现有经纪公司的基础上再接再厉。巧合的是，我们发现 Kite 的 API 是通用且清晰的，足以在其上构建任何交易平台，而不仅仅是 Kite。作为开发人员，我们对一组干净的、有据可查的 API 感到兴奋，这对行业来说是陌​​生的。希望最终会有人在它之上构建，我们将其命名为 Kite Connect，设计了一个类似 OAuth 的身份验证流程，编写了更好的文档，并围绕此构建了一个自助服务开发者门户，而 Kite 本身正在建设。需要注意的是，这样的事情只会发生在技术决策权掌握在技术人员手中的组织中。当 smallcase 向我们提出建立主题投资平台的建议时，这个疯狂的、自发的副项目很快就取得了成果。我们给了他们 Kite Connect API 密钥，帮助他们获得监管批准，并从我们赚取的微薄利润中获得种子资金。曾经煞费苦心地在我们这里开设账户进行投资和交易的用户现在只需单击一下即可登录 smallcase。我们会处理合法性、合规性、财务流程，当然还有底层技术和基础设施，smallcase 可以专注于构建他们的平台。这启动了我们的金融科技投资基金 Rainmatter，而 Kite Connect API 成为“经纪即平台”(BaaP) 产品，面向希望在用户入职仍需要签署和运送 40 多页的情况下构建定制金融平台的公司。鉴于行业的这种状态，投入时间和精力，更不用说设想一个带有开发人员门户的 API 平台可能没有意义。但是，Kite Connect 不是计划中的，它是良好 API 设计的一个偶然的副作用。今天，有许多应用程序和几家公司建立在 Kite Connect 之上。我们通过其 API 无缝集成了我们所有的最终用户投资和交易应用程序，以及多个内部系统。它是我们业务和产品战略的重要组成部分的基础。有趣的是，风筝连接平台本身就是一个有利可图的垂直领域。所有这一切使我们能够启动 Rainmatter 基金会，Zerodha 已将其大部分利润用于资助环境保护工作。当我努力阅读和理解我几周前编写的代码时，我哭了笑（🥲 我们在技术团队中最喜欢的新表情符号，它准确地捕捉了广泛的开发人员情绪）——“我为什么要这样做？我在想什么？”。想象一下在进入复杂系统时必须阅读、解析和在精神上编译别人的代码的认知负担。聪明的软件需要聪明的代码是一种误解。是否有单行嵌套Python 代码中的列表推导式和 lambdas 与它生成的最终软件的智能和实用性无关。然而，此类密码对代码库的可读性和可维护性有很强的影响，影响其未来的发展。未来的软件准备好，它的源代码在未来应该很容易被它自己的作者和未来的维护者阅读和解析，无论他们是谁。自相矛盾的是，原始作者自己往往最终成为未来开发人员的软件的心智模型。写随着时间的推移而枯竭。这花了很长时间才沉入其中，但是当它发生时，它改变了我编写代码的方式并扼杀了我对神奇的多层抽象的迷恋d 聪明。开发人员易于掌握和处理的简单、几乎是愚蠢的、明确的代码的价值怎么强调都不为过。同样，编写解释开发人员意图的注释，为什么要在程序中完成某事，比解释什么的注释更有价值，这些注释是明确的、不言自明的代码无论如何都会做的。\n在 Zerodha 的代码审查中，我们标记了“聪明的代码”，虽然功能强大，但其他人不易阅读和理解。这些代码审查会议让团队中的任何人都可以参加，无论他们的主要项目是什么，这有助于我们在开始不时偏离这些最佳实践时保持自我检查。可能会有宇宙的大统一理论，生命意义的发现，与智能外星生物的接触，然后才会有一个准确估算软件开发复杂性和时间线的框架。我只是半开玩笑。令人震惊的是，软件时间表的错误通常是多么可笑——忘记大型政府项目，但在报告或复选框中添加一个新的数字来改变特定的 UI 行为。我们估计需要数天的事情可能需要数周甚至数月。在我写这一段的时候，我进入了调试、测试和回滚的第四天，这个看起来微不足道的更改我估计需要几个小时。就其本身而言，这种变化是微不足道的，但由于涉及的多个系统的细微差别和某些业务流程的时间安排，它引入的微妙边缘情况的数量我们无法预见。与代码相比，软件复杂性和时间线估计往往受到依赖关系、业务和用户行为中无数微妙之处的阻碍。实际上，与弄清楚要写什么，然后处理所写内容的所有意外副作用相比，编写代码通常只需要一小部分时间。重要的是要意识到这一事实并积极将其纳入项目计划，为具有讽刺意味的意外延迟留出足够的空间。不幸的是，通常负责软件开发时间表的非技术决策者很少理解这一点。技术债务是不可避免的。债务越老，就越难摆脱。在快速开发和迭代软件以满足功能目标和截止日期的组织中，几乎没有时间暂停、重构、以正确的方式做事，为技术债务铺平道路。在一个季度内错过一个功能（是的，这听起来很荒谬，我们知道每个季度有 X 个“功能”作为目标的组织）可能意味着失去竞争优势，对吧？这是一个神话。组织经常高估他们持续发布的功能的重要性（并低估他们没有发布的功能的重要性）。事实上，不是不断添加“功能”和不断变化的软件在其未来就绪的前景中起着重要作用。提高现有软件的质量和性能本身就是一个重要的隐含“功能”，这是许多人都失去的事实。我们定期推迟发布新功能，以减缓和清理技术债务。不幸的是，在许多组织中，此类技术决策通常不在开发人员手中（第 8 节中的哭声）。 7.1.不要修复没有损坏的东西，而是修复可能很快损坏的东西。我们的交易平台 Kite 的第一个版本是用 Python 编写的。当它在 2015 年推出时，它的并发用户只有不到一千。今天，在任何特定时刻都有超过一百万。 2016 年发布了版本 2，一个重要的重构，2017 年发布了版本 3，一个完全重写的版本。在这些版本之间，我们用尽了 Python 性能优化的可能途径，并用 Go 重写了整个后端。 Angular 前端很快就变得难以维护，在 Vue 中被废弃并重写。最初用原生代码编写的 Kite 移动应用程序（成为多代码库维护难题），然后是 React Native（成为性能难题），第三次被废弃，取而代之的是在 Flutter 中重写。这些决定对我们来说效果非常好。\n另一个例子是ticker，该组件每秒向最终用户传输数千万个实时市场数据包。在过去的六年里，随着我们越来越擅长编写 Go 并且我们开始感觉到imp ......，它已经被重构和重写了至少五次。", "note_en": "Over the last year, owing to the unexpected rally in capital markets, Zerodha’s customer base has more than tripled, significantly increasing the number of concurrent users on our platforms along with the traffic and load they generate on numerous systems in the background. For context, in January 2020, we were handling 2+ million retail trades daily. In April 2020, it had risen to 7+ million. Today, it goes up to 12+ million. Our user base is now at 6+ million users, up from 2+ million last year.\n We never foresaw that our client base that grew slowly and predictably over ten years would triple in less than a year. Not that we ever attempted to do so either. However, when it did happen, we were able to adapt our software, infrastructure, and organisation with only a nominal impact on our stack and only a negligible increase in technology and infrastructure costs. This includes transitioning 1000+ of our employees to full time remote work pretty much overnight owing to the Covid lockdowns in 2020. Meanwhile, our tech team that was 30 members strong last year now stands at 31.\n The media and social media frenzy around the growth in business has piqued considerable interest, and there have been numerous queries along the lines of:\n How did we manage our systems and costs to cope with the overnight explosion in capital markets activity?\n This post is an assortment of notes on the real life practices that we employ at Zerodha, and many first hand insights from the industry, which, to us, have been great lessons on how not to run technology organisations.\n These notes demonstrate that the ability of a technology organisation and its systems to cope with future uncertainties and extreme volatility can be rooted in common sense first principles. Such principles can increase the odds of things falling into the right places naturally at opportune, almost serendipitous moments. A number of factors here are more human, more philosophical than technical, and so are these notes. It is not to say that these are universally applicable, but as they have worked for us, they may work for others too.\n As always, these anecdotes should be read with a healthy and rational awareness of context and the trade-offs involved.\n  In fact, “proofing” is borderline oxymoronic. Software can change rapidly and become obsolete in no time. Just like with physical objects, shiny new software can make older software look dated, biasing technical decision-making and significantly altering its future readiness.\n Paradoxically, little changes in software over long periods of time when one zooms out a little. Half a century old C language is still widely used and has changed little syntactically or semantically, and new languages continue to borrow heavily from it. Same with SQL. Same with paradigms like functional and object oriented programming; synchronous and asynchronous network communication; RPC and IPC; kernels; RDBMs and row and column based data modelling; lists, dictionaries, and maps; and on and on … While computing concepts change rarely and slowly, their specific avatars and manifestations can change rapidly and go in and out of fashion. What had become boring over the years can suddenly be re-invented and be in vogue again, like rendering HTML server-side and sending the results to the browser over the wire (!), or stateless “functions” (programs) in a shared environment (remember /*.php and /cgi-bin/?).\n Software trends tend to be surprisingly cyclical. Reminds me of the quote  “The beginning is the end and the end is the beginning” from the sci-fi series Dark, which  Karan casually tried to pass off as his own after watching just one episode. He didn’t actually, but as the saying goes,  “All Threads Digress To Karan”.\n This fundamental realisation, that computing concepts seldom change unlike their specific implementations, is the first step to building systems that have better odds of being future ready. It is important to understand the past and present landscapes of software to gain perspective on what really is new and what is old, important factors that influence technical decisions. We use this as a yardstick when evaluating technologies, be it a Javascript framework or an entirely new technology. For instance, our decision to port our mobile applications to Flutter in 2018 (after writing a quick prototype in it over two weeks) when Flutter was alpha—a calculated risk that has paid off really well.\n  Knowing when and where to draw the line when building something is hard. Developers—I certainly do—have the tendency to tweak systems endlessly to get them into a “perfect” state to ween off a sense of incompleteness;  “It’s not ready yet. Just a bit more”. This feeling never really goes away, but with practice and make-and-break production experience, it becomes possible to intuit the point where something is good enough to be shipped by all practical means. Also, in rapidly changing business environments, chasing a “perfect” state may be a fool’s errand. In a heavily regulated industry like the capital markets, regulations can come out of the blue and change how businesses operate overnight, forcing software to be refactored and rewritten with little time to plan.\n For example, in mid 2020, the Indian capital markets regulator gave a deadline of about four weeks to completely change how equities were sold on trading platforms up until that point. What used to be a realtime transaction that was sent to the exchanges when users clicked on a sell button now required a PIN based authorisation on an external gateway operated by market institutions known as depositories. Needless to say, this forced a series of significant cascading changes through critical realtime financial systems with little time to test. The UI and UX of selling securities had to change on the trading platform across web, both mobile platforms, and multiple external platforms built on top of our systems. Not only that, millions of users needed to be onboarded onto this external gateway to setup their PINs and be educated of this entirely new flow on short notice.\n Shortly thereafter, the regulation changed yet again to introduce a new SMS OTP to this gateway in addition to the PIN. And right after that, another regulation changed the validity of these authorisations forcing even more changes across systems. While these were in the interest of retail investors, to developers, they were extremely risky changes on unbelievably tight deadlines. Thus, in many environments, being pragmatic is not a choice but a necessity.\n Such pragmatism has to continuously hit the right balance between core features and capabilities, code quality extensibility, stability to run and serve its function, market conditions, laws and regulations, and also, a well defined API/UI spec that is unlikely to change rapidly. API/UI here is used in an abstract sense. It can mean a command line interface, a file or wire format, or network calls, RPCs, or ABI—any layer that lays down certain promises when it comes to interactions with other systems. Paying attention to interface design has yielded us wildly unexpected benefits.\n  When a system has to be inevitably refactored or rewritten when business requirements change in unexpected ways, often, the only silver lining is a stable API spec that maintains compatibility with other systems, allowing something to be swapped out without jeopardizing its dependents. A stable API establishes a level of separation of concern between different parts of the same program, between different systems, and even between whole departments in an organisation—good old modularity which is commonly, incorrectly, conflated with microservices. It can often mean that one department in an organisation can take one planned hit rather than several at the same time, something that we have done countless times, something that would not have been possible if multiple departments and the overlapping systems they use were not modular enough.\n It is a common misconception that internal APIs and architectures can be easily changed and replaced, which often results in the design of internal APIs and integrations not getting the same care and attention that public facing APIs usually get. The probability of poorly thought out integrations becoming technical debt as internal systems grow complex is very high. It is thus important to try and get the API spec as right as possible early on, even for internal systems.\n  Common sense software design, architecture, and separation of services can yield unexpected benefits far beyond performance wins. My favorite example at Zerodha is  Kite Connect, our HTTP/JSON API platform that allows building full fledged trading and investment platforms over our infrastructure.\n  All through 2013 and 2014 in the early days of our tech team, we were busy digitising things inside the organisation, mostly writing Python scripts to automate mundane manual processes. Building a trading platform was not even a thought. Sometime in 2014, our OMS (Order Management System) vendor came out with a white label web based trading platform that we could offer to our users. Web based trading platforms were a tiny niche and Windows-only desktop trading platforms dominated the industry. When I saw it first hand, I was shocked by what passed for a web application. If I remember correctly, its standout feature was that IE6 was no longer a requirement &amp;mldr in 2014. We abruptly decided that we needed to build a usable web based trading platform. A pivotal, unplanned move that would eventually transform Zerodha into a full fledged technology firm.\n  There were only about four or five of us in the tech team at that point, and none of us had any prior experience building a trading platform let alone any familiarity with capital markets or finance. Thankfully, the OMS vendor had a set of SOAP-like HTTP/XML APIs on top of the OMS engine. This is what would power the buy and sell functions of the trading platform. I would spend the next several weeks trying to understand the highly inconsistent route and naming conventions in the poorly documented API, wrapping the calls one by one into HTTP/JSON calls with consistent field names in a Python web server. It made sense to write this middleware to hide vendor weirdness behind a consistent API that we would be comfortable working with. Of course, it would then take months of back and forth with the vendor to actually get the upstream APIs to be in a usable state, followed by years of follow ups for incremental improvements.\n This new API spec was easy to use, understand, and was documented enough for  Vivek to start integrating it into the Angular web frontend he had started building based on my UI “design”. We were winging it. The name “Kite” implied something simple and light weight to operate, something that could reach metaphorical heights.\n  Around the same time, we had started realising that good quality end user software had to exist in the industry for the ecosystem to grow, whether or not we built it. While we were seeing numerous innovative end user applications launch by the day in India, capital markets was seeing none of it thanks to thick red tapes and the extremely high entry barrier owing to the legacy of a century old industry and status quo in general. For example, up until 2017, a user had to print, sign, and courier a ~40 page form to open an account with a brokerage as online account opening was not permitted by regulations. Who would want to experiment in an industry like that! It was (and still is) extremely complex to start a brokerage firm in India and the only way to invite innovation would have been to help technologists cut through the red tape and build on top of existing brokerage firms.\n Coincidentally, it occurred to us that the APIs for Kite were generic and clear enough to build any trading platform on top of it, not just Kite. As developers, we were excited by essentially a clean set of well documented APIs, something that was alien to the industry. In hopes that eventually there would be people who would come build on top of it, we named it Kite Connect, designed an OAuth-like authentication flow, wrote better documentation, and built a self-service developer portal around this, while Kite itself was being built. It is important to note that something like this could only happen in organisations where technical decision-making powers are in the hands of technical people.\n This wild, spontaneous side project very quickly bore fruits when  smallcase approached us with a proposal to build a thematic investment platform. We gave them Kite Connect API keys, help with regulatory approvals, and seed funding from the modest profits we were making. Our users who had painstakingly opened accounts with us to invest and trade could now login to smallcase with a single click. We would handle the legalities, compliance, financial processes, and of course the underlying technology and infrastructure, and smallcase could focus on building their platform.\n  This kickstarted  Rainmatter, our fintech investment fund, and the Kite Connect APIs became a “Brokerage as a Platform” ( BaaP) offering to companies that wanted to build bespoke financial platforms at a time where user onboarding still required signing and couriering 40+ pages. Given this state of the industry, investing time and effort, let alone envisioning an API platform complete with a developer portal may not have made sense. But, Kite Connect was not planned, it was a fortuitous side effect of good API design.\n Today, there are numerous applications and several companies built on top of Kite Connect. We dog-food it heavily integrating all our end user investment and trading apps, and several internal systems seamlessly via its APIs. It is the foundation on top of which significant parts of our business and product strategy are built. Amusingly, the Kite Connect platform on its own is a profitable vertical. All this has enabled us to start the  Rainmatter Foundation, where Zerodha has committed a significant portion of its profits to fund environmental conservation efforts.\n   I  cry-smile (🥲 our new favorite emoji in tech team that accurately captures a wide range of developer emotions) when I struggle to read and make sense of code I wrote just a few weeks ago— “Why did I do this? What was I thinking?&#34;. Imagine the cognitive burden of having to read, parse, and mentally compile somebody else’s code when getting into complex systems. It is a misconception that clever software needs clever code. Whether or not there are single-line nested list comprehensions and lambdas in Python code has no bearing on the cleverness and utility of the final software it produces. However, such cryptograms have a strong bearing on how readable and maintainable a codebase is, affecting its future development.\n Software that is to be future ready, its source code should be easily read and parsed in the future by its own authors and future maintainers, whoever they may be. Paradoxically, the original authors themselves often end up in the shoes of future developers as the mental models of the software they wrote deplete with time. It took a long time for this to sink in, but when it did, it changed the way I wrote code and killed my fascination for magical multi-layered abstractions and cleverness. The value of simple, almost dumb, explicit code that is easy for a developer to pick up and work on cannot be overstated. In the same vein, writing comments that explain the intention of the developer,  why something is being done in a program, is significantly more valuable than the comments that explain the  what, which explicit, self-explanatory code will do anyway.\n In our code reviews at Zerodha, we flag “clever code” that, while functional, is not easy for others to read and understand. These code review sessions where anyone in the team can participate irrespective of their primary projects help us keep ourselves in check when we start straying from these best practices from time to time.\n  There may be a grand unified theory for the universe, the discovery of the meaning of life, contact with intelligent extraterrestrial beings, before there will be a framework for accurately estimating software development complexity and timelines. I am only half joking. It is mind blowing how comically wrong software timelines generally are—forget large government projects, but the addition of a single new number on a report or a checkbox that changes a certain UI behaviour. Things that we estimate to take days can take weeks or even months.\n As I write this paragraph, I am into the fourth day of debugging, testing, and rolling back what seemed like a trivial change that I estimated to take a few hours. On its own, the change is trivial, but the number of subtle edge cases it introduced because of the nuances of multiple systems involved and the timings of certain business processes, we could not foresee.\n Software complexity and timeline estimation is often hindered by the countless subtleties in dependencies and business and user behaviour, than code. In reality, writing code often takes only a fraction of the time compared to figuring out what to write, and then dealing with all the unexpected side effects of what has been written. It is important to be conscious of this fact and actively factor it into project plans, leaving enough room for unexpected delays that are ironically expected. Unfortunately, this is seldom understood by non-technical decision makers who are often in charge of software development timelines.\n  Technical debt is inevitable. The older the debt, the harder it is to get rid of it. In organisations that develop and iterate software rapidly to meet feature goals and deadlines, there is little time to pause, refactor, do things the right way, paving the way to technical debt. That one missed feature in a quarter (yes, as absurd as it sounds, we know of organisations that have X “features” per quarter as a goal) could mean losing competitive advantage, right? This is a myth. Organisations often overestimate the importance of the features they continuously ship (and underestimate the importance of features they don’t ship). In fact, not constantly adding “features” and changing software plays an important role in its prospects of being future ready. That improving the quality and performance of existing software in itself is an important implicit “feature” is a fact lost on many. We regularly delay shipping new features to slow down and clean up technical debt. Unfortunately, in many organisations, such technical decisions are often not in the hands of developers (cries in  Section 8).\n 7.1. Don’t fix what is not broken, but fix what might soon break.\n The first version of Kite, our trading platform, was written in Python. When it was launched in 2015, there were barely a thousand concurrent users on it. Today, there are way more than a million at any given moment. Version 2, a significant refactor, was launched in 2016, and version 3, a complete rewrite, was launched in 2017. Between these versions, we exhausted possible avenues of performance optimization in Python and rewrote the whole backend in Go. The Angular frontend which became a pain to maintain very quickly was scrapped and rewritten in Vue. The Kite mobile applications that were originally written in native code (became a multi-codebase maintenance headache), then React Native (became a performance headache), were scrapped for a third time and replaced with a rewrite in Flutter. These decisions have worked out amazingly well for us.\n Another instance is ticker, the component that streams tens of millions of real time market data packets every second to end users. It has been refactored and rewritten at least five times in the last six years as we got better at writing Go and as we started sensing imp\n......", "posttime": "2021-07-29 21:24:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "做好,common,软件", "title": "用常识扩展 #2：为未来做好准备", "title_en": "Scaling with common sense #2: Being future ready", "transed": 1, "url": "https://zerodha.tech/blog/being-future-ready-with-common-sense/", "via": "", "real_tags": ["做好", "common", "软件"]}, {"category": "", "categoryclass": "", "imagename": "40ad528f096488ded54334772fe65eed.png", "infoid": 1070175, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "KeyCastr 需要访问 macOS Accessibility API 才能接收您的按键事件并广播您感兴趣的按键。在较新版本的 macOS (10.15+) 上，系统偏好设置应用程序中的安全和隐私下有一个新的输入监控菜单，并且 KeyCastr 会在您第一次运行时自动出现在那里。只需解锁此菜单并选中 KeyCastr 旁边的框即可启用它。在旧版本的 macOS 上，或者如果由于某种原因应用程序没有出现在输入监控菜单下（或者如果您想预先启用它），那么您可以手动将其添加到辅助功能菜单中的应用程序列表中。要将 KeyCastr 添加到列表中，请单击 + 按钮并从文件系统中选择 KeyCastr。如果 KeyCastr 已经在列表中，则单击 - 按钮并再次添加 KeyCastr 以确保选择了正确的应用程序。如果您想显示的不仅仅是修饰键，请确保选中“显示所有按键”复选框。或者，取消选中此框以仅显示修饰键（例如 ⇧ ⌃ ⌥ ⌘）\n默认位置在显示器的左下角。要修改显示的击键位置，请单击并拖动文本，如下所示：", "note_en": "KeyCastr requires access to the macOS Accessibility API in order to receive your key events and broadcast the keystrokes you are interested in.\n On newer versions of macOS (10.15+) there is a new Input Monitoring menu under Security &amp; Privacy within the System Preferences app, and KeyCastr will appear there automatically the first time you run it. Simply unlock this menu and check the box next to KeyCastr to enable it.\n  On older versions of macOS, or if for some reason the app doesn&#39;t appear under the Input Monitoring menu (or if you want to pre-enable it) then you may manually add it to the list of apps in the Accessibility menu.\n  To add KeyCastr to the list click the  + button and select KeyCastr from the file system.\n If KeyCastr is already in the list, then click the  − button and add KeyCastr again to be certain that the right application is chosen.\n  Make sure to check the &#34;Display all keystrokes&#34; checkbox if you would like to display more than just the modifier keys.\n Alternatively, keep this box unchecked to only display modifier keys (e.g. ⇧ ⌃ ⌥ ⌘)\n   The default position is on the bottom left of your display. To modify the position of displayed keystrokes, click and drag the text like so:", "posttime": "2021-07-29 21:24:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,可视化,open,keycastr", "title": "KeyCastr – 开源按键可视化工具", "title_en": "KeyCastr – Open-source keystroke visualizer", "transed": 1, "url": "https://github.com/keycastr/keycastr", "via": "", "real_tags": ["开源", "可视化", "open", "keycastr"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070174, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下载 PDF 摘要： 同质量的一组观测值的算术平均值通常被认为是最具代表性的观测值。在最熟悉的惯性时刻，有几个论据支持这种选择。但是，这是什么意思？在这篇笔记中，我们提出了 Kolmogorov-Nagumo 的观点，即算术平均是一系列特殊函数的特例，二次和几何平均值是其他一些情况。 Themedian 不属于此类函数。 Kolmogorov-Nagumo 解释对于算术平均而言是最有说服力和最确定的解释，但其本质归结为这样一个事实，即该平均只是一种抽象，仅在其数学设置中才有意义。书目工具 代码和数据相关论文 关于 arXivLabs arXivLabs 是一个框架，允许合作者直接在我们的网站上开发和共享新的 arXiv 功能。与 arXivLabs 合作的个人和组织都接受并接受了我们的开放、社区、卓越和用户数据隐私价值观。 arXiv 致力于这些价值观，并且只与遵守这些价值观的合作伙伴合作。有一个可以为 arXiv 社区增加价值的项目的想法吗？了解有关 arXivLabs 以及如何参与的更多信息。", "note_en": "Download PDF  Abstract: The arithmetic average of a collection of observed values of a homogeneouscollection of quantities is often taken to be the most representativeobservation. There are several arguments supporting this choice the moment ofinertia being the most familiar. But what does this mean? In this note, we bring forth the Kolmogorov-Nagumo point of view that thearithmetic average is a special case of a sequence of functions of a specialkind, the quadratic and the geometric means being some of the other cases. Themedian fails to belong to this class of functions. The Kolmogorov-Nagumointerpretation is the most defensible and the most definitive one for thearithmetic average, but its essence boils down to the fact that this average ismerely an abstraction which has meaning only within its mathematical set-up.\n      Bibliographic Tools      Code &amp; Data      Related Papers       About arXivLabs   arXivLabs is a framework that allows collaborators to develop and share new arXiv features directly on our website.\n  Both individuals and organizations that work with arXivLabs have embraced and accepted our values of openness, community, excellence, and user data privacy. arXiv is committed to these values and only works with partners that adhere to them.\n  Have an idea for a project that will add value for arXiv&#39;s community?   Learn more about arXivLabs and   how to get involved.", "posttime": "2021-07-28 04:49:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "意思,arxivlabs", "title": "“意思”到底是什么意思？", "title_en": "What Does the \"Mean\" Really Mean?", "transed": 1, "url": "https://arxiv.org/abs/2003.01973", "via": "", "real_tags": ["意思", "arxivlabs"]}, {"category": "", "categoryclass": "", "imagename": "d7a62db8c46ef73f9082e3753930fd7d.jpg", "infoid": 1070173, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "了解如何使用 NFL 提供的时间序列数据来发现对许多球员表现指标的宝贵见解 - 以及如何应用相同的方法来提高您的梦幻联盟球队、您对比赛的了解或您的观看体验 - 全部使用 PostgreSQL 、标准 SQL 和免费提供的扩展。时间序列数据无处不在，令我们惊讶的是，包括职业体育界。在 Timescale，我们一直在寻找有趣的方式来展示时间序列数据的扩展范围。股票、加密货币、物联网和基础设施指标数据是相对常见且被广泛理解的时间序列数据场景。在任何一天前往 Twitter，搜索 #timeseries 或 #TimescaleDB，您一定会发现有关使用 Prometheus 等工具进行高频交易或大规模可观察性数据的问题。你可以想象当我们遇到 NFL 大数据碗时我们的兴奋，这是一年一度的比赛，鼓励数据科学界使用历史球员位置和比赛数据来创建机器学习模型。 NFL 真的可以访问每场常规赛 NFL 比赛的 18+ 百万行详细比赛数据吗？作为背景，美国国家橄榄球联盟 (NFL) 是美国橄榄球职业体育联盟，NFL 赛季紧随其后的是数以千万计的人，最终以一年一度的超级碗（吸引了 1 亿 + 全球观众，无论是为了比赛）或用于广告）。每场 NFL 比赛都是一系列“比赛”，其中两支球队试图得分并阻止另一支球队得分。每场比赛大约有 200 场比赛，常规赛期间每周最多有 15 场比赛。大量的数据，但没有什么是不可管理的。因此，乍一看，足球比赛指标可能不会立即跳出任何特别的东西。\n所有 NFL 球员都配备了 RFID 芯片，用于跟踪球员的位置、速度和各种其他指标，团队使用这些指标来识别趋势、降低风险并持续优化。 NFL 开始跟踪和存储场上每位球员、每次比赛、每场比赛的数据。因此，我们现在可以非常详细地分析一场比赛是如何展开的，不同球员在每次比赛中加速的速度有多快，以及比赛的结果。逐场比赛指标的传统观点是“距离和距离”以及比赛的结果（获得的码数，是否有得分等）。使用 NFL 的数据集，我们能够在整个比赛中以 100 毫秒的间隔挖掘大约 100 个数据点，以查看速度、距离、参与的球员等等。这不是普通的数据。这是时间序列数据。时间序列数据是在时间间隔内收集的一系列数据点，使我们能够跟踪随时间的变化。在 NFL 数据集的情况下，我们有时间序列数据来表示比赛如何变化，包括球员在场上的位置、球的位置、球员在场上的相对加速度等多得多。时间序列数据很快就会出现，有时每秒生成数百万个数据点（阅读更多关于时间序列数据的信息）。由于信息量和信息量巨大，时间序列数据的查询和分析已经很复杂，这就是我们构建 TimescaleDB 的原因，这是一个多节点、PB 级、完全免费的时间序列关系数据库。我们不能错过使用 TimescaleDB 查看 NFL 数据集的机会，探索我们可以更深入地观察球员表现的方法，希望能提供有关下赛季整体球员表现的见解。继续阅读以了解有关 NFL 数据集以及如何开始使用它的更多信息，以及一些示例查询以快速启动您的分析。它们可以帮助您从游戏中获得更多乐趣。如果您想开始使用 NFL 数据，您可以启动一个完全托管的 TimescaleDB 服务：创建一个帐户以免费试用 30 天。本文后面的说明将带您了解如何摄取数据并开始使用它进行分析。\n如果您不熟悉时间序列数据，或者只是有一些关于数据集的问题，请加入我们的公共 Slack 社区，在那里您可以找到 Timescale 团队成员和数以千计的时间序列爱好者，我们很乐意为您提供帮助。在过去的几年里，NFL 和 Kaggle 在 NFL 大数据碗上进行了合作。目标是使用历史数据来回答预定类型的问题，通常会生成一个机器学习模型，可以帮助预测常规赛期间某些比赛的结果。尽管 2020/2021 比赛已经结束，但他们提供的上一赛季的样本数据集仍然可供下载和分析。 2020/2021赛季的比赛侧重于传球防守效率；因此，数据集中只有进攻和防守“组织者”的跟踪数据可用。不包括进攻或防守边锋数据。 （您可以阅读有关去年获奖者的更多信息。）出于本博客文章和随附教程的目的，我们将使用 NFL 提供的示例数据。这些数据来自 2018 NFL 赛季，并以 CSV 文件的形式提供，包括比赛特定数据和参与传球“进攻”部分的每个球员的每周跟踪数据。下一季的比赛参与者将可以访问新的每周游戏数据。这些数据本质上也是非常相关的，这意味着 SQL 是开始收集价值的绝佳媒介——不需要 Jupyter notebook、其他数据科学特定语言（如 Python 或 R）或其他工具集。如果您想跟随 - 或重新创建！ - 我们在下面经历的查询，按照我们的教程设置表，摄取数据，并开始在 TimescaleDB 中分析数据。对于那些不熟悉 TimescaleDB 的人来说，它是建立在 PostgreSQL 之上的，所以你会发现我们所有的查询都是标准的 SQL。如果您了解 SQL，您就会知道如何在此处完成所有操作。 （我们提供的一些更高级的查询示例需要我们新的、高级的超函数，它预装在任何 Timescale Forge 实例中。）我们在随附的教程中提供了将数据集摄取到 TimescaleDB 所需的步骤，所以我们赢了不要在这里讨论。\n比赛：关于常规赛每场比赛的所有相关数据，包括日期、球队、时间和地点球员：关于每个球员的信息，包括他们效力的球队和他们最初的大学比赛：关于每次传球的丰富数据游戏。有用的字段包括击球、对发生的比赛的描述、混战线和总进攻码数等细节。周 [1-17]：对于本赛季的每一周，NFL 都会提供一个新的 CSV 文件，其中包含每个球员的跟踪数据，每次比赛（此数据的传球次数）。有趣的字段包括每次比赛中每隔几百毫秒的 X/Y 位置数据（相对于足球场）、球员加速度以及所采取路线的“类型”。 （在我们的教程中，这些数据被导入到跟踪表中，总共有近 2000 万行时间序列数据。）除了 NFL 数据集，我们还提供了一些来自 Wikipedia 的额外数据，其中包括每个项目的比赛得分和体育场条件。游戏，您可以将其作为教程的一部分加载。对于其他时间序列数据库，可能很难将您的时间序列数据与您手头可能拥有的任何其他数据结合起来（请参阅我们的 TimescaleDB 与 InfluxDB 比较以供参考）。因为 TimescaleDB 是具有时间序列超能力的 PostgreSQL，它支持 JOINS，因此您想要添加任何额外的关系数据以进行更深入的分析，只需一个 SQL 查询即可。在我们的例子中，我们能够将 NFL 的逐场比赛数据与每个体育场的天气数据结合起来。准备好数据后，NFL 组织者的世界就在您的指尖，让我们开始吧！\n年复一年，在 StackOverflow 调查中，我们看到 SQL 被列为最受开发人员欢迎的语言之一。然而，有时我们可能会认为，从关系数据中获得洞察力的唯一方法是使用强大的数据分析工具和语言进行查询、创建数据框并使用专门的回归算法，然后才能做任何富有成效的事情。通常感觉 SQL 仅用于在应用程序中获取和存储数据，我们需要将分析的“繁重工作”留给更成熟的工具。不是这样！ SQL 可以使用其中最好的来处理数据！让我们看第一个简单的例子。对于第一个示例，我们将查询跟踪表（所有 17 周比赛的球员移动数据）并加入比赛表以确定每场比赛每个球员位置的码数。结果可让您快速了解每场比赛中不同位置跑了多少码。您可以稍后使用它来比较特定球员，以了解他们与总码数或多或少的比较情况。 WITH total_position_yards AS ( SELECT sum(dis) position_yards, POSITION, gameid FROM tracking t GROUP BY POSITION, gameid)SELECT avg(position_yards), position, game_dateFROM game gINNER JOIN total_position_yards tpy ON g.game_id = tpy.gameidWHERE POSITION IN (&#39; &#39;,&#39;RB&#39;,&#39;WR&#39;,&#39;TE&#39;)GROUP BY game_date, POSITION;随着赛季的进行和球员受伤（或被交易），了解哪些球员有更多的比赛经验会很有帮助，而不是那些在赛季大部分时间都坐在场边的球员。拥有更多上场时间的球员通常能够为比赛的结果做出贡献。\n此查询查找任何进攻中的所有球员，并计算他们参与的总传球次数，按总传球次数降序排列。 WITH snap_events AS (--创建一个过滤播放事件的表格以仅显示快速播放--并显示玩家团队信息 SELECT DISTINCT player_id, t.event, t.gameid, t.playid, CASE WHEN t.team = &#39;离开&#39; THEN g.visitor_team WHEN t.team = &#39;home&#39; THEN g.home_team ELSE NULL END AS team_name FROM tracking t LEFT JOIN game g ON t.gameid = g.game_id WHERE t.event IN (&#39;snap_direct&#39;,&#39;ball_snap &#39;))-- 计算这些事件并过滤结果以仅在玩家处于进攻状态时显示数据--在进攻时SELECT a.player_id, pl.display_name, COUNT(a.event) AS play_count, a.team_nameFROM snap_events aLEFT JOIN play p ON a.gameid = p.gameid AND a.playid = p.playidLEFT JOIN player pl ON a.player_id = pl.player_idWHERE a.team_name = p.possessionteamGROUP BY a.player_id, pl.display_name, a.team_name ORDER BY play_count DESC;如果您熟悉美式足球，您可能知道球员会根据比赛条件在比赛内外被替换。在某些情况下，更强壮、更大的球员可能会玩，而在其他情况下，速度更快、更敏捷的球员可能会玩。然而，四分卫是场上最“重要”的球员，而且往往比其他人打得更多。但是，通过省略四分卫，我们可以更深入地了解所有其他位置的球员。 WITH snap_events AS (--创建一个过滤播放事件的表格以仅显示快速播放--并显示玩家团队信息 SELECT DISTINCT player_id, t.event, t.gameid, t.playid, CASE WHEN t.team = &#39;离开&#39; THEN g.visitor_team WHEN t.team = &#39;home&#39; THEN g.home_team ELSE NULL END AS team_name FROM tracking t LEFT JOIN game g ON t.gameid = g.game_id WHERE t.event IN (&#39;snap_direct&#39;,&#39;ball_snap &#39;))-- 计算这些事件并过滤结果以仅显示球员在进攻时的数据--在进攻时SELECT a.player_id, pl.display_name, COUNT(a.event) AS play_count, a.team_name, pl.&quot;position&quot; FROM snap_events aLEFT JOIN play p ON a.gameid = p.gameid AND a.playid = p.playidLEFT JOIN player pl ON a.player_id = pl.player_idWHERE a.team_name = p.possessionteam AND pl.&quot;position&quot; != &#39;QB &#39;GROUP BY a.player_id, pl.display_name, a.team_name, pl.&quot;position&quot; ORDER BY play_count DESC;所以，现在我们可以看到一个赛季中进攻最多的非四分卫：我们可以通过从跟踪表中提取特定数据并在其上分层查询以进行关联来开始更深入一些。一项可能对您的分析有所帮助的信息是了解哪些四分卫在传球过程中最常被解雇。在足球中，“解雇”对进攻来说是一种消极的表现，经常被解雇的四分卫在整体上的表现往往较差。\n一旦你了解了这些球员，你就可以扩展你的分析，看看他们是否因特定类型的比赛（散弹枪阵型）被解雇更多，或者是否在比赛的特定季度（可能是第四节，因为进攻线更累，或者球队在比赛后期往往落后，必须更频繁地传球）。像这样的查询可以快速向您展示更有可能被解雇的四分卫，尤其是当他们打一支防守强队时。首先，我们想根据每个四分卫在常规赛期间参与的传球总数找到他们的擒杀百分比。为此，我们通过在公共表表达式上分层来处理跟踪数据，以便每个查询都可以建立在先前的结果之上。首先，我们为每个四分卫 (qb_plays) 选择所有比赛的不同列表。我们执行 SELECT DISTINCT... 的原因是因为跟踪表为每个玩家、每个游戏保存了多个条目。对于每个四分卫，每次比赛我们只需要一行。有了这个结果，我们就可以计算每个四分卫的总上场次数 (total_qb_plays)，每个四分卫上场的总比赛次数 (qb_games)，最后是四分卫的传球次数是导致擒杀的一部分（麻袋）。有了这些数据，我们最终可以查询所有值，进行百分比计算，并按总袋数对其进行排序。 WITH qb_plays AS ( SELECT DISTINCT ON (POSITION, playid, gameid) POSITION, playid, player_id, gameid FROM tracking t WHERE POSITION = &#39;QB&#39;),total_qb_plays AS (SELECT count(*) play_count, player_id FROM qb_plays GROUP BY player_id), qb_games AS ( SELECT count(DISTINCT gameid) game_count, player_id FROM qb_plays GROUP BY player_id),sacks AS ( SELECT count(*) sack_count, player_id FROM play p INNER JOIN qb_plays ON p.gameid = qb_plays.gameid AND p.plays = qb_play .playid WHERE p.passresult = &#39;S&#39; GROUP BY player_id)SELECT play_count, game_count, sack_count, (sack_count/play_count::float)*100 sack_percentage, display_name FROM total_qb_plays tqpINNER JOIN qb_games qgFT ON tqp_ids_erg. s ON s.player_id = qg.player_idINNER JOIN player ON tqp.player_id = player.player_idORDER BY sack_count DESC NULLS 最后；当然，有一些四分卫似乎总是有办法避免被解雇。\n到目前为止，我们展示的查询很有趣，有助于为整个赛季的不同球员提供洞察力——但如果你仔细观察，它们都是常规的 SQL 语句。然而，检查一个赛季的 NFL 跟踪数据与典型的时间序列数据不同。我们想要执行的大多数查询都需要以某种方式检查所有 2000 万行。这是为时间序列分析构建的工具，即使数据不是典型的时间序列数据，也可以显着提高您检查数据的能力并同时节省资金。我们注意到我们经常需要构建从跟踪表开始的查询，按特定玩家、位置和游戏过滤数据。部分原因是游戏表没有列出参与特定游戏的所有玩家。因此，我们需要交叉引用跟踪表以识别参与任何给定比赛的球员。我们演示的第一个示例查询——“每场比赛每个位置的平均码数”——就是一个很好的例子。查询首先按位置对每场比赛的所有码数求和。这意味着在进行任何其他分析之前，必须读取并聚合跟踪中的每一行。扫描这 2000 万行是非常无聊、重复且缓慢的工作——尤其是与我们想要进行的分析相比！在我们的小型测试实例上，“平均码数”查询大约需要 8 秒才能运行。我们可以增加实例的大小（这将花费我们更多的钱），或者我们可以更聪明地查询数据（这将花费我们更多的时间）。\n相反，我们可以使用连续聚合来预先聚合我们一遍又一遍查询的数据，这减少了 TimescaleDB 每次运行查询时需要做的工作量。 （连续聚合就像 PostgreSQL 物化视图。有关更多信息，请查看我们的连续聚合文档。） CREATE MATERIALIZED VIEW player_yards_by_game_WITH (timescaledb.continuous) ASSELECT player_id, position, gameid, time_bucket(INTERVAL &#39;1 day&#39;, &quot;time&quot;) AS bucket, SUM(dis) AS yardsFROM 跟踪 tGROUP BY player_id, position, gameid, bucket;运行此查询并创建连续聚合后，我们可以稍微修改第一个查询，将其用作我们的基础表。 WITH total_position_yards AS ( SELECT sum(yards) position_yards, POSITION, gameid FROM player_yards_by_game t GROUP BY POSITION, gameid)SELECT avg(position_yards), position, game_dateFROM game gINNER JOIN total_position_yards tpy ON g.game_id = tpy.gameid = tpy.gameidW &#39;,&#39;RB&#39;,&#39;WR&#39;,&#39;TE&#39;)GROUP BY game_date, POSITIONORDER BY game_date, position;我们得到相同的结果，但现在查询运行时间为 100 毫秒 - 快 800 倍！最后，我们对数据挖掘得越多，就越发现我们需要（或想要）专门针对时间序列数据分析调整的函数来回答我们想问的问题类型。正是针对这种分析，我们构建了 TimescaleDB 超函数，TimescaleDB 中的一系列 SQL 函数，可以更轻松地以更少的代码行操作和分析 PostgreSQL 中的时间序列数据。\nNFL 数据集是一个很好的百分位数用例。能够快速找到比某个队列表现更好或更差的球员真的很强大。例如，我们将使用我们之前创建的相同连续聚合（总码数、每场比赛、每名球员）来查找每场比赛按位置移动的总码数中位数。 WITH sum_yards AS (--将位置添加到表中以允许稍后对其进行分组 SELECT a.player_id, display_name, SUM(yards) AS yards, p.position, gameid FROM player_yards_by_game a LEFT JOIN player p ON a.player_id = p .player_id GROUP BY a.player_id, display_name, p.position, gameid)--求每个位置类型的均值和中位数SELECT position, mean(percentile_agg(yards)) AS mean_yards, approx_percentile(0.5, percentile_agg(yards)) AS medium_yardsFROM sum_yardsWHERE POSITION IS NOT nullGROUP BY positionORDER BY mean_yards DESC;最后，我们可以在这个百分位查询的基础上找到在每个位置上跑动超过该位置所有其他球员 95% 的球员。对于某些位置，例如外接手或自由安全，这可以帮助我们找到能够在整场比赛中始终如一地跑动场地的“异常”球员——并进行比赛！ WITH sum_yards AS (--向表中添加位置以允许稍后按它分组 SELECT a.player_id, display_name, SUM(yards) AS yards, p.position FROM player_yards_by_game a LEFT JOIN player p ON a.player_id = p.player_id GROUP BY a.player_id, display_name, p.position),position_percentile AS ( SELECT POSITION, approx_percentile(0.95, percentile_agg(yar ......", "note_en": "Learn how to use time-series data provided by the NFL to uncover valuable insights into many player performance metrics – and ways to apply the same methods to improve your fantasy league team, your knowledge of the game, or your viewing experience - all with PostgreSQL, standard SQL, and freely available extensions.\n Time-series data is everywhere, including, much to our surprise, the world of professional sports. At Timescale, we&#39;re always looking for fun ways to showcase the expanding reach of time-series data.  Stock,  cryptocurrency,  IoT, and  infrastructure metrics data are relatively common and widely understood time-series data scenarios. Head to Twitter on any given day, search for  #timeseries or  #TimescaleDB, and you&#39;re sure to find questions about high-frequency trading or massive scale observability data with tools like Prometheus.\n You can imagine our excitement, then, when we happened upon the  NFL Big Data Bowl, an annual competition that encourages the data science community to use historical player position and play data to create machine learning models.\n Did the NFL   really give access to 18+ million rows of detailed play data from every regular season NFL game?\n   For background, the National Football League (NFL) is the US professional sports league for American football, and the NFL season is followed by tens of millions of people, culminating in the annual Super Bowl (which attracts 100M+ global viewers, whether for the game or for the commercials).\n Each NFL game takes place as a series of “plays,” in which the two teams try to score and prevent the other team from scoring. There are approximately 200 plays per game, with up to 15 games a week during the regular season. A healthy amount of data, but nothing unmanageable.\n So, at first glance, football game metrics might not immediately jump out as anything special.\n  All  NFL players are equipped with RFID chips that track players’ position, speed, and various other metrics, which teams use to identify trends, mitigate risks, and continuously optimize.  The NFL started tracking and storing data for every player on the field, for every play, for every game.\n As a result, we now have access to a very detailed analysis of exactly how a play unfolded, how quickly various players accelerated during each play, and the play’s outcome. A traditional view of play-by-play metrics is “down and distance” and the result of the play (yards gained, whether or not there was a score, and so on). With the NFL’s dataset, we&#39;re able to mine approximately 100 data points at 100-millisecond intervals throughout the play to see speed, distance, involved players, and much more.\n This isn’t ordinary data.  This is time-series data. Time-series data is a sequence of data points collected over time intervals, giving us the ability to track changes over time. In the case of the NFL’s dataset, we have time-series data that represents how a play changes, including the locations of the players on the field, the location of the ball, the relative acceleration of players in the field of play, and so much more.\n Time-series data comes at you fast, sometimes generating millions of data points per second ( read more about time-series data). Because of the sheer volume and rate of information, time-series data can already be complex to query and analyze, which is why we built  TimescaleDB, a multi-node, petabyte-scale, completely free relational database for time-series.\n We couldn&#39;t pass up the opportunity to look at the NFL dataset with TimescaleDB, exploring ways we could peer deeper into player performance in hopes of providing insights about overall player performance in the coming season.\n Read on for more information about the  NFL’s dataset and how you can start using it, plus some sample queries to jumpstart your analysis. They may help you get more enjoyment out of the game.\n If you’d like to get started with NFL data, you can spin up a fully managed TimescaleDB service: create an account to  try it for free for 30 days. The instructions later in this post will take you through how to ingest the data and start using it for analysis.\n If you’re new to time-series data or just have some questions you’d like to ask about the dataset,  join our public Slack community, where you’ll find Timescale team members and thousands of time-series enthusiasts, and we’ll be happy to help you.\n  Over the last few years, the NFL and Kaggle have collaborated on the  NFL Big Data Bowl. The goal is to use historical data to answer a predetermined genre of questions, typically producing a machine learning model that can help predict the outcome of certain plays during regular season games.\n Although the 2020/2021 contest is over, the sample dataset they provided from a prior season is still available for download and analysis. The 2020/2021 competition focused on pass play defense efficiency; therefore, only the tracking data for offensive and defensive &#34;playmakers&#34; is available in the dataset. No offensive or defensive linemen data is included. (You can read more about  last year’s winners.)\n   For the purposes of this blog post and accompanying tutorial, we will use  the sample data provided by the NFL. This data is from the 2018 NFL season and is available as CSV files, including game-specific data and week-by-week tracking data for each player involved in the &#34;offensive&#34; part of the pass play. Contest participants in the next season of the contest will have access to new weekly game data.\n This data is also very relational in nature, which means that SQL is a great medium to start gleaning value – without the need for Jupyter notebooks, other data science specific languages (like Python or R), or additional toolsets.\n If you want to follow along - or recreate! - the queries we go through below,  follow our tutorial to set up the tables, ingest data, and start analyzing data in TimescaleDB. For those unfamiliar with TimescaleDB, it’s built on PostgreSQL, so you’ll find that all of our queries are standard SQL. If you know SQL, you’ll know how to do everything here. (Some of the more advanced query examples we provide require our new, advanced hyperfunctions, which come pre-installed with any  Timescale Forge instance.)\n  We&#39;ve provided the steps needed to ingest the dataset into TimescaleDB in the  accompanying tutorial, so we won’t go into that here.\n  Games: all relevant data about each game of the regular season, including date, teams, time, and location\n Players: information on each player, including what team they play for and their originating college\n Plays: a wealth of data about each pass play in the game. Helpful fields include the down, description of the play that happened, line of scrimmage, and total offensive yardage, among other details.\n Week [1-17]: for each week of the season, the NFL provides a new CSV file with the tracking data of every player, for every play (pass plays for this data). Interesting fields include X/Y position data (relative to the football field) every few hundred milliseconds throughout each play, player acceleration, and the &#34;type&#34; of a route that was taken. (In our tutorial, this data is imported into the  tracking table and totals almost 20 million rows of time-series data.)\n In addition to the NFL dataset, we also provide some extra data from Wikipedia that includes game scores and stadium conditions for each game, which you can load as part of the tutorial. With other time-series databases, it can be difficult to combine your time-series data with any other data you may have on hand (see  our TimescaleDB vs. InfluxDB comparison for reference).\n Because TimescaleDB is PostgreSQL with time-series super powers, it supports JOINS, so any extra relational data you want to add for deeper analysis is just a SQL query away. In our case, we’re able to combine the NFL’s play-by-play data along with weather data for each stadium.\n Once you have the data ready, the world of NFL playmakers is at your fingertips, so let’s get started!\n  Year after year, we see SQL listed as one of the most popular languages among developers on the  StackOverflow survey. Sometimes, however, we can be lured into thinking that the only way to gain insights from relational data is to query it with powerful data analytics tools and languages, create data frames, and use specialized regression algorithms before we can do anything productive.\n SQL, it often feels, is only useful for getting and storing data in applications and that we need to leave the &#34;heavy lifting&#34; of analysis to more mature tools.\n Not so! SQL can data munge with the best of them! Let&#39;s look at a first, quick example.\n  For this first example, we&#39;ll query the  tracking table (the player movement data from all 17 weeks of games) and join to the  game table to determine the number of yards per player position, per game.\n The results give you a quick overview of how many yards different positions ran throughout each game. You could use this later to compare specific players to see how they compared, more or less yards, to that total.\n WITH total_position_yards AS (\tSELECT sum(dis) position_yards, POSITION, gameid FROM tracking t \tGROUP BY POSITION, gameid)SELECT avg(position_yards), position, game_dateFROM game gINNER JOIN total_position_yards tpy ON g.game_id = tpy.gameidWHERE POSITION IN (&#39;QB&#39;,&#39;RB&#39;,&#39;WR&#39;,&#39;TE&#39;)GROUP BY game_date, POSITION;\n  As a season progresses and players get injured (or traded), it&#39;s helpful to know which of the available players have more playing experience, rather than those that have been sitting on the sideline for most of the season. Players with more playing time are often able to contribute to the outcome of the game.\n This query finds all players that were on the offense for any play and counts how many total passing plays they have been a part of, ordered by total passing plays descending.\n WITH snap_events AS (-- Create a table that filters the play events to show only snap plays-- and display the players team information SELECT DISTINCT player_id, t.event, t.gameid, t.playid, CASE WHEN t.team = &#39;away&#39; THEN g.visitor_team WHEN t.team = &#39;home&#39; THEN g.home_team ELSE NULL END AS team_name FROM tracking t LEFT JOIN game g ON t.gameid = g.game_id WHERE t.event IN (&#39;snap_direct&#39;,&#39;ball_snap&#39;))-- Count these events &amp; filter results to only display data when the player was-- on the offensiveSELECT a.player_id, pl.display_name, COUNT(a.event) AS play_count, a.team_nameFROM snap_events aLEFT JOIN play p ON a.gameid = p.gameid AND a.playid = p.playidLEFT JOIN player pl ON a.player_id = pl.player_idWHERE a.team_name = p.possessionteamGROUP BY a.player_id, pl.display_name, a.team_nameORDER BY play_count DESC;\n  If you’re familiar with American football, you might know that players are substituted in and out of the game based on game conditions. Stronger, larger players may play in some situations, while faster, more agile players may play in others.\n Quarterbacks, however, are the most “important” players on the field, and tend to play more than others. However, by omitting quarterbacks, we can get a deeper insight into players across all other positions.\n WITH snap_events AS (-- Create a table that filters the play events to show only snap plays-- and display the players team information SELECT DISTINCT player_id, t.event, t.gameid, t.playid, CASE WHEN t.team = &#39;away&#39; THEN g.visitor_team WHEN t.team = &#39;home&#39; THEN g.home_team ELSE NULL END AS team_name FROM tracking t LEFT JOIN game g ON t.gameid = g.game_id WHERE t.event IN (&#39;snap_direct&#39;,&#39;ball_snap&#39;))-- Count these events &amp; filter results to only display data when the player was-- on the offensiveSELECT a.player_id, pl.display_name, COUNT(a.event) AS play_count, a.team_name, pl.&#34;position&#34;FROM snap_events aLEFT JOIN play p ON a.gameid = p.gameid AND a.playid = p.playidLEFT JOIN player pl ON a.player_id = pl.player_idWHERE a.team_name = p.possessionteam AND pl.&#34;position&#34; != &#39;QB&#39;GROUP BY a.player_id, pl.display_name, a.team_name, pl.&#34;position&#34;ORDER BY play_count DESC;\n So, now we can see the non-quarterbacks who are on offense the most in a season:\n   We can start to go a little deeper by extracting specific data from the  tracking table and layering queries on top of it to make correlations. One piece of information that might be helpful in your analysis is knowing which quarterbacks are sacked most often during passing plays. In football, a “sack” is a negative play for the offense, and quarterbacks who get sacked more often tend to be lower performers overall.\n Once you know those players, you could expand your analysis to see if they are sacked more on specific types of plays (shotgun formation) or maybe if sacks occur more often in a specific quarter of the game (maybe the fourth quarter because the offensive line is more tired, or the team tends to be behind late in games and must pass more often).\n Queries like this can quickly show you quarterbacks that are more likely to get sacked, particularly when they play a strong defensive team.  To get started, we wanted to find the sack percentage of each quarterback based on the total number of pass plays they were involved in during the regular season. To do that we approached the tracking data by layering on Common Table Expressions so that each query could build upon previous results.\n First, we select the distinct list of all plays, for each quarterback ( qb_plays). The reason we do a  SELECT DISTINCT… is because the tracking table holds multiple entries for each player, for each play. We just need one row for each play, for each quarterback.\n With this result, we can then count the number of total plays per quarterback ( total_qb_plays), the total number of games each quarterback played ( qb_games) and then finally the number of pass plays the quarterback was a part of that resulted in a sack ( sacks).\n With that data in hand, we can finally query all of the values, do a percentage calculation, and order it by the total sack count.\n WITH qb_plays AS (\tSELECT DISTINCT ON (POSITION, playid, gameid) POSITION, playid, player_id, gameid \tFROM tracking t \tWHERE POSITION = &#39;QB&#39;),total_qb_plays AS (\tSELECT count(*) play_count, player_id FROM qb_plays\tGROUP BY player_id),qb_games AS (\tSELECT count(DISTINCT gameid) game_count, player_id FROM qb_plays \tGROUP BY player_id),sacks AS (\tSELECT count(*) sack_count, player_id \tFROM play p\tINNER JOIN qb_plays ON p.gameid = qb_plays.gameid AND p.playid = qb_plays.playid\tWHERE p.passresult = &#39;S&#39;\tGROUP BY player_id)SELECT play_count, game_count, sack_count, (sack_count/play_count::float)*100 sack_percentage, display_name FROM total_qb_plays tqpINNER JOIN qb_games qg ON tqp.player_id = qg.player_idLEFT JOIN sacks s ON s.player_id = qg.player_idINNER JOIN player ON tqp.player_id = player.player_idORDER BY sack_count DESC NULLS last;\n   Of course, there are a few quarterbacks that always seem to have a way of avoiding a sack.\n    So far, the queries we&#39;ve shown are interesting and help provide insights to various players throughout the season – but if you were looking closely, they&#39;re all regular SQL statements.\n Examining a season of NFL tracking data isn&#39;t like typical time-series data, however. Most of the queries we want to perform need to examine all 20 million rows in some way.\n This is where a tool that&#39;s been built for time-series analysis, even when the data isn&#39;t typical time-series data, can significantly improve your ability to examine the data and save money at the same time.\n  We noticed that we often needed to build queries that started with the  tracking table, filtering data by specific players, positions, and games. Part of the reason is that the  play table doesn&#39;t list all of the players who were involved in a particular play. As a result, we need to cross-reference the  tracking table to identify the players who were involved in any given play.\n The first example query we demonstrated - “average yards per position, per game” - is a good example of this. The query begins by summing all yards, by position, for each game.\n This means that every row in  tracking has to be read and aggregated  before we can do any other analysis. Scanning those 20 million rows is pretty boring, repetitive, and slow work – especially compared to the analysis we want to do!\n On our small test instance, the &#34;average yards&#34; query takes about 8 seconds to run. We could increase the size of the instance (which will cost us more money), or we could be smarter about how we query the data (which will cost us more time).\n Instead, we can use continuous aggregates to pre-aggregate the data we&#39;re querying over and over again, which reduces the amount of work TimescaleDB needs to do every time we run the query. (Continuous aggregates are like PostgreSQL materialized views. For more info, check out our  continuous aggregates docs.)\n CREATE MATERIALIZED VIEW player_yards_by_game_WITH (timescaledb.continuous) ASSELECT player_id, position, gameid, time_bucket(INTERVAL &#39;1 day&#39;, &#34;time&#34;) AS bucket, SUM(dis) AS yardsFROM tracking tGROUP BY player_id, position, gameid, bucket;\n After running this query and creating a continuous aggregate, we can modify that first query just slightly, using this as our basis table.\n WITH total_position_yards AS (\tSELECT sum(yards) position_yards, POSITION, gameid FROM player_yards_by_game t \tGROUP BY POSITION, gameid)SELECT avg(position_yards), position, game_dateFROM game gINNER JOIN total_position_yards tpy ON g.game_id = tpy.gameidWHERE POSITION IN (&#39;QB&#39;,&#39;RB&#39;,&#39;WR&#39;,&#39;TE&#39;)GROUP BY game_date, POSITIONORDER BY game_date, position;\n We get the same result, but now the query runs in 100ms -  800x faster!\n  Finally, the more we dug into the data, the more and more we found we needed (or wanted) functions specifically tuned for time-series data analysis to answer the types of questions we wanted to ask.\n It is for this kind of analysis that we built  TimescaleDB hyperfunctions, a series of SQL functions within TimescaleDB that make it easier to manipulate and analyze time-series data in PostgreSQL with fewer lines of code.\n  The NFL dataset is a great use case for  percentiles. Being able to quickly find players that perform better or worse than some cohort is really powerful.\n As an example, we&#39;ll use the same continuous aggregate we created earlier (total yards, per game, per player) to find the median total yards traveled by position for each game.\n WITH sum_yards AS (--Add position to the table to allow for grouping by it later SELECT a.player_id, display_name, SUM(yards) AS yards, p.position, gameid FROM player_yards_by_game a LEFT JOIN player p ON a.player_id = p.player_id GROUP BY a.player_id, display_name, p.position, gameid)--Find the mean and median for each position typeSELECT position, mean(percentile_agg(yards)) AS mean_yards, approx_percentile(0.5, percentile_agg(yards)) AS median_yardsFROM sum_yardsWHERE POSITION IS NOT nullGROUP BY positionORDER BY mean_yards DESC;\n   Finally, we can build upon this percentile query to find players at each position that run more than 95% of all other players at that position. For some positions, like wide receiver or free safety, this could help us find the “outlier” players that are able to travel the field consistently throughout a game – and make plays!\n WITH sum_yards AS (--Add position to the table to allow for grouping by it later SELECT a.player_id, display_name, SUM(yards) AS yards, p.position FROM player_yards_by_game a LEFT JOIN player p ON a.player_id = p.player_id GROUP BY a.player_id, display_name, p.position),position_percentile AS (\tSELECT POSITION, approx_percentile(0.95, percentile_agg(yar\n......", "posttime": "2021-07-28 04:49:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破解,幻想,nfl,数据", "title": "使用 Postgres 破解 NFL 数据（也许会赢得你的幻想选秀）", "title_en": "Hack NFL data using Postgres (and maybe win your fantasy draft)", "transed": 1, "url": "https://blog.timescale.com/blog/hacking-nfl-data-with-postgresql-timescaledb-and-sql/", "via": "", "real_tags": ["破解", "幻想", "nfl", "数据"]}, {"category": "", "categoryclass": "", "imagename": "6a083f754db3a5ea2c63ccf55839db94.png", "infoid": 1070170, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿特区——电子前沿基金会 (EFF) 对美国邮政局及其检查机构提起了《信息自由法》(FOIA) 诉讼，以寻求有关在街头抗议之前秘密梳理社交媒体用户在线帖子的秘密计划的记录，引发担心会影响互联网用户的隐私和表达活动。据媒体报道，在一项名为 Internet Covert Operations Program 的计划中，美国邮政检查局 (USPIS) 的分析师，美国邮政局的执法部门，对社交媒体用户创建的大量数据进行了分类，以监视他们的言论和分享报告。互联网用户在 Facebook、Twitter、Parler 和 Telegraph 上的帖子很可能被监控程序清除。 USPIS 尚未披露有关该计划的详细信息或任何记录，以回应 EFF 的 FOIA 请求，该请求要求提供有关监视计划的创建和运作的信息。除了这些记录外，EFF 还在寻求有关该计划的政策和对所收集信息的分析的记录，以及与包括国土安全部 (DHS) 在内的其他联邦机构就该计划收集的社交媒体内容的使用进行交流的记录. “我们正在提起 FOIA 诉讼，以阐明邮政服务为何以及如何监控在线言论。这起诉讼旨在保护抗议权，”EFF 公共利益法律研究员休斯顿戴维森说。 “政府从未解释过这种监视的法律依据。我们正在请求法院命令 USPIS 披露有关此言论监控计划的详细信息，这威胁到宪法对言论自由和隐私的保障。”媒体报道显示，一份日期为 3 月 16 日的政府公告已分发到国土安全部的国营安全威胁中心，提醒执法机构，USPIS 分析人员监视了“有关计划于 2021 年 3 月 20 日在国际和国内发生的抗议活动的重大活动”。公告称，当天计划在全国各地举行抗议活动，并在 Parler、Telegram、Twitter 和 Facebook 上分享地点和时间。 “监视和收集人们的社交媒体活动令人不寒而栗，并压制了言论自由，”EFF 高级职员律师亚伦·麦基 (Aaron Mackey) 说。 “当人们认为自己的言论受到监控并可能被用来针对他们时，就会进行自我审查。政府搜索人们社交媒体账户的努力是对我们公民自由的威胁。”", "note_en": "Washington D.C.—The Electronic Frontier Foundation (EFF) filed a Freedom of Information Act (FOIA)  lawsuit against the U.S. Postal Service and its inspection agency seeking records about a covert program to secretly comb through online posts of social media users before street protests, raising concerns about chilling the privacy and expressive activity of internet users.  Under an initiative called Internet Covert Operations Program, analysts at the U.S. Postal Inspection Service (USPIS), the Postal Service’s law enforcement arm, sorted through massive amounts of data created by social media users to surveil what they were saying and sharing, according to  media  reports. Internet users’ posts on Facebook, Twitter, Parler, and Telegraph were likely swept up in the surveillance program.  USPIS has not disclosed details about the program or any records responding to EFF’s FOIA request asking for information about the creation and operation of the surveillance initiative. In addition to those records, EFF is also seeking records on the program’s policies and analysis of the information collected, and communications with other federal agencies, including the Department of Homeland Security (DHS), about the use of social media content gathered under the program.  “We’re filing this FOIA lawsuit to shine a light on why and how the Postal Service is monitoring online speech. This lawsuit aims to protect the right to protest,” said Houston Davidson, EFF  public interest legal fellow. “The government has never explained the legal justifications for this surveillance. We’re asking a court to order the USPIS to disclose details about this speech-monitoring program, which threatens constitutional guarantees of free expression and privacy.”  Media reports revealed that a  government bulletin dated March 16 was distributed across DHS’s state-run security threat centers, alerting law enforcement agencies that USPIS analysts monitored “significant activity regarding planned protests occurring internationally and domestically on March 20, 2021.” Protests around the country were planned for that day, and locations and times were being shared on Parler, Telegram, Twitter, and Facebook, the bulletin said.  “Monitoring and gathering people’s social media activity chills and suppresses free expression,” said Aaron Mackey, EFF senior staff attorney. “People self-censor when they think their speech is being monitored and could be used to target them. A government effort to scour people’s social media accounts is a threat to our civil liberties.”", "posttime": "2021-07-28 04:48:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,计划,sues", "title": "EFF 起诉美国邮政服务以获取有关隐蔽社交媒体间谍计划的记录", "title_en": "EFF Sues US Postal Service for Records About Covert Social Media Spying Program", "transed": 1, "url": "https://www.eff.org/press/releases/eff-sues-us-postal-service-records-about-covert-social-media-spying-program", "via": "", "real_tags": ["美国", "计划", "sues"]}, {"category": "", "categoryclass": "", "imagename": "2955f0593d41a97fc7aed4c41301c8fb.jpeg", "infoid": 1070169, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软公布了 6 月季度的数据，好于预期。收入增长 21% 至 461.5 亿美元，是有史以来最高的季度收入。该公司第四财季每股收益为 2.17 美元。分析师平均预期收益为每人 1.92 美元", "note_en": "The June-quarter numbers are in for Microsoft, and they are better than expected.Revenue jumped 21% to $46.15 billion, its highest quarterly revenue total ever.The company reported per-share earnings of $2.17 in its fiscal fourth quarter. Analysts, on average, were expecting earnings of $1.92 a", "posttime": "2021-07-28 04:47:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,创纪录,reports,季度", "title": "微软报告创纪录的收入，超出预期", "title_en": "Microsoft Reports Record Revenue, Topping Expectations", "transed": 1, "url": "https://www.wsj.com/livecoverage/earnings-apple-google-microsoft/card/ny1IVKHWgjNMQAQze0Rr", "via": "", "real_tags": ["microsoft", "微软", "创纪录", "reports", "季度"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070167, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这篇文章中，我计划展示 polyBLEPS 的效果并实现一个简短的示例程序，该程序使用此方法生成带限波形，以期减少混叠。此外，还有一些其他可用方法的简短概述。这篇文章是在 Jupyter Notebook 中编写的。Notebook 可作为 .html 或 .ipnyb 使用。在减法合成中，我们希望从具有大量“谐波含量”的波形开始，然后我们可以使用滤波器和效果“雕刻掉”这些波形。这通常意味着锯齿波或方波。相比之下，正弦波的“谐波含量”很少。事实上，它的可能性最小，而且非常基本，可以将其视为任何其他信号的构建块。其中\\(x\\)，在音频的上下文中，是我们的时间参数，\\(L\\) 是方波周期，注意\\(n\\) 被定义为仅是奇数整数（推导）。 #Setup import numpy as np import scipy import scipy.signal import matplotlib.pyplot as plt import ipywidgets as widgets L = 1 / 10 ; # 1 周期 0.1s =&gt; 10Hz Fs = 1000 # 采样（稍后解释） t = np . linspace ( 0 , 1 , Fs ) # 1sec with 10000 samples signal = scipy .信号 。 square ( t * ( 2 * np . pi / L )) # 10Hz 方波 ps = np . abs ( np . fft . fft ( 信号 )) ** 2 # 功率谱频率 = np . fft 。 fftfreq (signal .size, d = 1 / Fs) # 绘图频率 #Plot idx = np . argsort ( freqs ) fig , ax = plt .子图 () ax 。轴。 set_ticks ( np . arange ( 1 / L , 100 , 1 / L )) ax . set_xlim ( 0 , 100 ) ax 。 set_title ( &quot;%d Hz 方波的频谱&quot; % ( 1 / L )) ax 。 set_xlabel (&quot;Hz&quot;) ax 。 plot ( freqs [ idx ], np . sqrt ( ps [ idx ]), &quot;.-&quot; ) 上图显示了 10Hz 方波的频谱。由此我们可以看到构成方波的各个正弦波。最强的峰值是频率为 10Hz（通常称为基波）的正弦波。下一个峰值可以在 30Hz 处看到，这意味着我们在 30Hz 处有一个正弦波，但幅度较低。下一个峰值为 50Hz，下一个峰值为 70Hz，等等。请注意，峰值在 \\(\\frac{1}{L}\\) (20Hz, 40Hz, ...) 的偶数倍处丢失，并且有在 \\(\\frac{1}{L}\\) (10Hz, 30Hz, ...) 的不均匀倍数处达到峰值，正如 \\eqref{fourierSeriesSquare} 中所描述的那样。\n理论上，这些峰值一直出现到无限高的频率！但是，在数字世界中处理信号时，必须以特定的时间间隔对信号进行采样，因此在出现混叠之前，信号频率是有限制的。当我们试图捕获的信号的频率高于采样频率的一半时，就会发生混叠。当这种情况发生时，我们不能再完美地表示信号。它被扭曲了。奈奎斯特定理说，要通过采样完美地捕获信号，采样频率必须至少是信号中最高频率的两倍。为了说明混叠，我们可以查看以 40Hz 采样的正弦波。频率为 15Hz 的正弦波将在频谱中的 15Hz 处具有峰值。但是 25Hz 的正弦波高于采样频率一半的阈值，并且会出现混叠。我们可以看到，这意味着信号的频率“折叠”并似乎在频率上下降，落在 15Hz 左右而不是 25Hz，从而错误地表示信号。 def fft_spectrum ( t , signal , Fs ): &quot;&quot;&quot;函数帮助绘制频率响应&quot;&quot;&quot; ps = np . abs ( np . fft . fft ( 信号 )) ** 2 # 功率谱频率 = np . fft 。 fftfreq (signal .size, d = 1 / Fs) # 绘图的频率 idx = np . argsort ( freqs ) return ( freqs [ idx ], ps [ idx ]) def sin_fft ( freq , Fs ): L = 1 / freq ; # 1 周期 0.1s =&gt; 10Hz Fs = Fs # 采样数 t = np 。 linspace ( 0 , 1 , Fs ) # 1sec with Fs samples signal = np 。 sin ( t * ( 2 * np . pi / L )) # 1/L Hz 正弦波返回 fft_spectrum ( t , signal , Fs ) #Plot！血小板子图 fig ， ax = plt 。子图 ( 2 , sharex = True ) ax [ 0 ] 。轴。 set_ticks ( np . arange ( 10 , 100 , 5 )) ax [ 0 ] 。 set_xlim (0, 20) ax [1]。 set_xlabel (&quot;Hz&quot;) #15 Hz freqs , ps = sin_fft ( 15 , 40 ) ax [ 0 ] 。 plot ( freqs , np . sqrt ( ps )) ax [ 0 ] 。 set_title (“%d Hz 方波的频谱”% (15)) #25 Hz freqs , ps = sin_fft ( 25 , 40 ) ax [ 1 ] 。绘图 (freqs, np.sqrt (ps)) ax [1]。 set_title ( &quot;%d Hz 方波的频率频谱&quot; % ( 25 )) 由此我们可以想象，试图表示一个在无限高频率处具有峰值的方波可能会成为一个挑战。但是为什么原始方波示例中没有混叠？在那种情况下，与方波的周期相比，我们的采样率设置得相当高。较高频率的峰值非常小，以至于混叠的影响几乎可以忽略不计。但是，如果我们希望允许具有更短周期的方波（导致更高的基频），这可能会成为一个问题，并将由于混叠而产生的数字信号引入不需要的内容和噪声。\n出于音频目的，通常使用 44.1kHz 的采样率。这意味着我们可以表示频率高达 20kHz 的音频，这超过了人耳所能接收的频率。但是存在混叠的风险，高于 20k kHz 的频率会“折回”并在可听范围内引入新的不需要的频率。如何避免混叠？ 信号需要进行带宽限制。这意味着要表示的信号不需要具有高于采样率一半的频率成分（或至少这种成分具有低幅度）。通过麦克风录制真实世界的音频时，几乎肯定会遇到高于采样率的频率。为了避免混叠，使用低通滤波器来确保较高的频率足够低，从而限制信号频带，从而避免混叠。当以数字方式生成波形时，我们需要确保也是如此。限制无法采样的较高频率。有多种方法可以帮助防止波形混叠。常用方法包括 这 3 种技术被称为准带限，因为它们不能完美地消除混叠。然而，它们仍然有助于显着减少混叠效应。下面是对过采样、加法合成技术和 BLEP 技术的快速概述。 BLEP 技术是我的项目最感兴趣的技术之一，似乎最适合我的需求。我没有机会深入研究其他技术。以下是有关其他 BLITS 和 BLAMPS 的更多信息的一些提示：\n在这里，信号只是以足够高的频率采样，不会出现混叠或混叠的影响可以忽略不计。音频通常以 44.1kHz 采样，如果我们希望捕获具有高成分频率的信号，我们必须确保采样率是最高成分频率频率的两倍。但这可能意味着计算机必须完成更多工作，这可能是一个问题，尤其是对于实时应用程序。使用上面方波的傅立叶级数表达式（方程 \\eqref{fourierSeriesSquare}），我们可以通过手动执行组成频率的求和并在到达奈奎斯特频率时简单地停止来生成信号的每个样本。这将使我们尽可能接近表示方波，而不会出现由混叠引起的错误探测频率。 def added_square ( N , freq = 10 , Fs = 1000 ): L = 1 / freq ; # 周期 Fs = Fs # # 采样数 t = np . linspace ( 0 , 1 , Fs ) # 1sec with Fs samples signal = np 。数组 ([ 0 ] * len ( t ), float ) for i in range ( 1 , len ( t )): t0 = t [ i ] for n in range ( 1 , N + 1 ): 信号 [ i ] += 4/np。 pi * \\ 1 / ( 2 * n - 1 ) * np . sin ( 2 * ( 2 * n - 1 ) * np . pi * t0 / L ) return ( t , signal ) def plot_additive_square ( N , freq , Fs ): L = 1 / freq ;打印（“最高组成频率：%g Hz”\\%（（（2*N-1）*np.pi/L）/（np.pi）））t，信号=additive_square（N，freq，Fs）plt .图 ( figsize = ( 14 , 3 )) plt .子图 (1, 2, 1) plt。 plot ( t , 信号 , &quot;.-&quot; ) plt.标题（“%d Hz 处的附加方波 \\n \\ 具有 %d 项，在 %d Hz 处采样” % ( freq , N , Fs )) plt 。 xlabel (&quot;time [s]&quot;) freqs, ps = fft_spectrum (t, signal, Fs) plt.子图 (1, 2, 2) plt。绘图（频率，np。sqrt（ps））plt。标题（“方波频谱在 %d Hz \\n \\ 与 %d 项，在 %d Hz 处采样” % ( freq , N , Fs )) plt . xlabel ( &quot;频率 [Hz]&quot; ) plt . xlim(0, 120) 小部件。交互 ( plot_additive_square , \\ N = widgets . IntSlider ( min = 1 , max = 7 , step = 1 , value = 3 ),\\ freq = widgets . fixed ( 18 ), Fs = widgets . fixed ( 200 )) &gt; 最高成分频率：90 Hz 在上图中，我们可以看到在 200Hz 下采样的 N 值不同的附加方波。我们还有这个波的频谱。当我们增加 N 时，峰值会以均匀的间隔出现。但是一旦我们达到采样频率 (100Hz) 的一半，不规则的峰值就会开始出现，这会导致非谐波声音（不太适合制作音乐）。所以我们可以在穿过奈奎斯特频率之前简单地停在 N 的值处，在这种情况下 \\(N = 3\\)。当以 44.1kHz 采样时，我们希望生成基频为 420kHz 的方波，在这种情况下，N 将为 \\(N = 53\\)。根据情况，对于实时应用程序中的每个样本可能需要执行过多的迭代。一种常见的方法是使用加法合成预先生成不同频率的所需波形，并将生成的样本存储在波表中，然后可以在运行时查找。但这需要预先计算和内存。该方法利用了从方波的低值到方波的高值的步进在理论上是瞬时的这一事实。因此，无论主方波设置为什么周期或频率，执行跳跃的波部分将始终相同。在数字情况下，这意味着这一步只能在采样率允许的情况下尽可能尖锐并具有尽可能多的频率。\n诀窍是让此步骤的版本受带宽限制。然后可以将此“BLEP”替换到具有太陡步的天真生成的波形区域（不考虑混叠），从而避免更高的频率。由于 BLEP 需要以不连续性为中心，我们需要能够提前预测几个样本何时发生阶跃，或者只是稍微延迟信号。可以使用上述加法合成或通过模拟对通过低通滤波器发送的脉冲的影响来生成这些步骤。 BLEP 方法的发展是所谓的 polyBLEP。这里给出了带限阶跃函数的多项式近似。这允许快速计算带限步长并且不需要内存查找。这种近似是通过数学解释将阶跃函数通过低通滤波器的过程得出的。 Valimaki 和 Huovilainen 在他们的论文中描述了这个过程。三角波可以用作低通滤波的函数，这是因为它的频率响应具有 sinc^2 的形状。三角波函数由下式给出，三角脉冲的频率响应可用于使用卷积改变方波。方波与三角脉冲卷积。在此过程中，三角脉冲得到积分。常量 \\(\\frac{1}{2}\\) 项是为了确保连续性。这是多项式限带步骤。要应用于原始生成波形的实际校正由 BLEP 残差给出。也就是说，从 BLEP 中减去输入脉冲。我们得到 $$f_{polyBLEP}(t) = \\begin{cases}\\frac{t^2}{2} + t + \\frac{1}{2} \\, , \\text{when} \\, -1 \\leq t \\leq 0 \\newlinet - \\frac{t^2}{2} + \\frac{1}{2} \\, , \\text{when} \\, 0 \\lt t \\leq 1\\end{cases} \\, .$$\n在程序中实现这一点意味着我们需要一些逻辑来找到不连续性，然后应用更正。我们需要提前知道我们的不连续性何时出现才能应用校正，但由于波形是周期性的，这应该不会太困难。下面是在 polyBLEPS 的帮助下生成方波校正的示例。 # PolyBLEP by Tale # http://www.kvraudio.com/forum/viewtopic.php?t=375517 #（由我改编）#double t = 0.; // 0 &lt;= t &lt; 1 #double dt = freq / sample_rate; def poly_blep ( t , dt ): &quot;&quot;&quot;对天真生成的波形中给出的不连续性进行 polyblep 校正。dt = freq/Fs &quot;&quot;&quot; if (t &lt; dt): # 0 &lt;= t &lt; 1 t /= dt ; # 2 * (t - t^2/2 - 0.5) 返回 t + t - t * t - 1 elif ( t &gt; 1. - dt ): # -1 &lt; t &lt; 0 t = ( t - 1. ) / dt ; # 2 * (t^2/2 + t + 0.5) return t * t + t + t + 1 else : # 0 否则返回0 def poly_square ( t , dt , aa ): naive_square = 0 if t &lt;= 0.5 : naive_square = 1 ;如果 t &gt; 0.5 : naive_square = - 1 ; if aa : #with polyBlep 校正。 #一个用于上升，一个用于下降（0.5） return naive_square + poly_blep ( t , dt ) \\ - poly_blep (( t + 0.5 ) % 1 , dt ) else : return naive_square t = 0 Fs = 3520 f0 = 240 dt = f0 / Fs out_no_aa = np .数组 ([ 0 ] * Fs , float ) out_aa = np 。 array ([ 0 ] * Fs , float ) # 使锯齿波 f0 次 t = np . linspace ( 0 , f0 , Fs ) for i in range (0, len (t)): t_tmp = t [ i ] % 1 out_no_aa [ i ] = poly_square ( t_tmp , dt , 0 ) out_aa [ i ] = poly_mpt , dt , 1 ) t = np 。 linspace ( 0 , 1 , Fs ) #f0 次在 1 秒内 signal_no_aa = out_no_aa signal_aa = out_aa 我们可以通过查看频率响应来了解这对混叠的影响。 ＃阴谋！血小板图 ( figsize = ( 16 , 20 )) plt .子图 (4, 2, 1) plt。 plot ( t , signal_aa , &quot;.-&quot; ) plt. title (&quot;Square with polyBLEP&quot;) plt . xlabel ( &quot;time [s]&quot; ) plt 。 xlim ( 0 , 0.05 );血小板ylim (-2, 2) plt。子图 (4, 2, 2) plt。 plot ( t , signal_no_aa , &quot;.-&quot; ) plt。标题（“没有 polyBLEP 的正方形”） plt 。 xlabel ( &quot;time [s]&quot; ) plt 。 xlim ( 0 , 0.05 );血小板ylim ( - 2 , 2 ) freqs , ps = fft_spectrum ( t , signal_aa , Fs ) plt.子图 (4, 2, 3) plt。绘图（频率，np。sqrt（ps），“.-”）plt。标题（“polyBLEP 的频率响应”） plt 。 xlabel ( &quot;频率 [Hz]&quot; ) plt . xlim (0, 2000) plt。 ylim ( 0 , 400 ) freqs , ps = fft_spectrum ( t , signal_no_aa , Fs ) plt.子图 (4, 2, 4) plt。绘图（频率，np。sqrt（ps），“.-”）plt。标题（“没有 polyBLEP 的频率响应”） plt 。 xlabel ( &quot;频率 [Hz]&quot; ) plt . xlim (0, 2000) plt。 ylim ( 0 , 400 ) 我们有它。在没有 polyBLEPS 的信号中，我们看到了很多不需要的频率。任何高度在 150 或以下的峰都可以被认为是混叠（除了最后一个峰）。使用 polyBLEP 校正调整信号时，我们看到混叠显着减少！下面是两个视频，您可以在其中听到 polyBLEPS 的效果。这里使用了 22050 的采样率。音量警告！\n返回顶部", "note_en": "In this post I plan to show the effects of polyBLEPS and implement a short example program that uses this method to generate bandlimited waveforms, in the hopes of reducing aliasing. In addition, there is also a short overview of some other available methods.\n This post was written in the Jupyter Notebook.Notebook is available as  .html or as  .ipnyb.\n  In subtractive synthesis we want to start from waveforms which have a lot of &#34;harmonic content&#34;, which we then can &#34;sculpt away&#34; using filters and effects.This usually means sawtooth-waves or square-waves.\n In contrast, a sine-wave has very little &#34;harmonic content&#34;.In fact, it has the least possible and is so fundamental that it can be seen as the building block of any other signal.\n   where  \\(x\\), in the context of audio, is our time parameter and  \\(L\\) is the square waves period, note that  \\(n\\) is defined to be only odd integers ( derivation).\n  #Setup import  numpy  as  np import  scipy import  scipy.signal import  matplotlib.pyplot  as  plt import  ipywidgets  as  widgets L  =  1 / 10 ;  # 1 period 0.1s =&gt; 10Hz Fs  =  1000  # samples to take (explained later) t  =  np . linspace ( 0 , 1 , Fs )  # 1sec with 10000 samples signal  =  scipy . signal . square ( t * ( 2 * np . pi / L ))  # 10Hz square wave ps  =  np . abs ( np . fft . fft ( signal )) ** 2  # power spectrum freqs  =  np . fft . fftfreq ( signal . size ,  d = 1 / Fs )  # freqs for plot #Plot idx  =  np . argsort ( freqs ) fig ,  ax  =  plt . subplots () ax . xaxis . set_ticks ( np . arange ( 1 / L ,  100 ,  1 / L )) ax . set_xlim ( 0 , 100 ) ax . set_title ( &#34;Frequency spectrum for  %d  Hz square wave&#34;  % ( 1 / L )) ax . set_xlabel ( &#34;Hz&#34; ) ax . plot ( freqs [ idx ],  np . sqrt ( ps [ idx ]), &#34;.-&#34; )\n  The figure above shows the frequency spectrum of a square wave at 10Hz. From this we can see the individual sin-waves that make up the square wave. The strongest peak is a sin-wave with frequency 10Hz (which usually is referred to as the fundamental). The next peak can be seen at 30Hz, meaning we have a sin-wave at 30Hz but with a lower amplitude. The next peak is at 50Hz, and the next after that at 70Hz, etc. Note that the peaks are missing at even multiples of  \\(\\frac{1}{L}\\) (20Hz, 40Hz, ...) and have peaks at uneven multiples of  \\(\\frac{1}{L}\\) (10Hz, 30Hz, ...), just as it was described in \\eqref{fourierSeriesSquare}.\n In theory these peaks keep showing up all the way up to infinitely high frequencies!\n But, when dealing with signals in the digital world, where signals must be sampled at specific time intervals, there is a limit on signal frequencies before we get  aliasing.\n  Aliasing occurs when the signal we are trying to capture has a frequency which is higher than half the sample frequency. When this occurs we can no longer perfectly represent the signal. It has been distorted. The Nyquist theorem says that to perfectly capture a signal through sampling, the sampling frequency must be at least twice that of the highest frequency in the signal.\n To illustrate aliasing we can look at a sin-wave sampled at 40Hz. A sin-wave with a frequency of 15Hz will have its peak at 15Hz in the frequency spectrum. But a sin-wave at 25Hz is above the threshold of half the sampling frequency and will be aliased. We can see that this means that the frequency of the signal &#34;folds&#34; and appears to go back down in frequency, landing at around 15Hz instead of 25Hz, thus incorrectly representing the signal.\n def  fft_spectrum ( t ,  signal ,  Fs ):  &#34;&#34;&#34;function to help plotting frequency responses&#34;&#34;&#34;  ps  =  np . abs ( np . fft . fft ( signal )) ** 2  # power spectrum  freqs  =  np . fft . fftfreq ( signal . size ,  d = 1 / Fs )  # freqs for plot  idx  =  np . argsort ( freqs )  return  ( freqs [ idx ],  ps [ idx ]) def  sin_fft ( freq ,  Fs ):  L  =  1 / freq ;  # 1 period 0.1s =&gt; 10Hz  Fs  =  Fs  # # of samples to take  t  =  np . linspace ( 0 , 1 , Fs )  # 1sec with Fs samples  signal  =  np . sin ( t * ( 2 * np . pi / L ))  # 1/L Hz sin-wave  return  fft_spectrum ( t ,  signal ,  Fs )  #Plot!  plt . subplots  fig ,  ax  =  plt . subplots ( 2 ,  sharex = True )  ax [ 0 ] . xaxis . set_ticks ( np . arange ( 10 ,  100 ,  5 ))  ax [ 0 ] . set_xlim ( 0 , 20 )  ax [ 1 ] . set_xlabel ( &#34;Hz&#34; )  #15 Hz  freqs ,  ps  =  sin_fft ( 15 ,  40 )  ax [ 0 ] . plot ( freqs ,  np . sqrt ( ps ))  ax [ 0 ] . set_title ( &#34;Frequency spectrum for  %d  Hz square wave&#34;  % ( 15 ))  #25 Hz  freqs ,  ps  =  sin_fft ( 25 ,  40 )  ax [ 1 ] . plot ( freqs ,  np . sqrt ( ps ))  ax [ 1 ] . set_title ( &#34;Frequency spectrum for  %d  Hz square wave&#34;  % ( 25 ))\n  From this we can imagine that trying to represent a square wave, which has peaks at infinitely high frequencies can become a bit of a challenge. But why was there no aliasing in the original square-wave example? In that case our sample rate was set to be quite high compared to the period of the square wave. The peaks for the higher frequencies are so small that the effect of aliasing is pretty much negligible.\n But if we want to allow square-waves with shorter periods (resulting in a higher fundamental frequency), this can be a problem and introduce unwanted content and noise to our digital signal that arises because of aliasing.\n For audio purposes the sampling rate of 44.1kHz is often used. This means that we can represent audio with frequencies up to 20kHz, that is more than what the human ear can pick up. But with aliasing there is risk that higher frequencies than 20k kHz &#34;fold&#34; back and introduce new unwanted frequencies in the audible range.\n  How can aliasing be avoided?The signal needs to be Bandlimited. This means that the signal to be represented needs to have no frequency content higher than half the sample rate (or at least that such content has low amplitude).\n When recording audio of the real world through a microphone it will almost certainly encounter frequencies which are higher than the sample rate. To avoid aliasing, a lowpass filter is used to make sure that the higher frequencies are sufficiently low, making the signal band limited and thus avoiding aliasing.\n When digitally generating waveforms we need to make sure this is also the case. Limit the higher frequencies that can not be sampled. There are multiple methods which can help prevent waveforms from being aliased. Common methods include\n  The 3 techniques are called quasi-bandlimited, since they do not eliminated aliasing perfectly. They do however, still help reduce the aliasing effects significantly.\n Below is a quick overview of the oversampling, additive synthesis techniques and BLEP techniques. The BLEP technique was the one of greatest interest for my project and seemed to fit my needs the best.\n I did not get a chance to dive into the other techniques very much. Here are some pointers for for more info on the other ones BLITS and BLAMPS:\n    Here the signal is simply sampled at a high enough frequency that no aliasing occurs or that the effects of aliasing are negligible. Audio is generally sampled at 44.1kHz and if we wish to capture a signal that has high constituent frequencies we must make sure that the sample rate is twice the frequency of the highest constituent frequency. But this can mean that a lot more work has to be done by the computer and might be a problem, especially for realtime applications.\n  Using the fourier series expression for a square-wave above (equation \\eqref{fourierSeriesSquare}) we can generate each sample of the signal by manually performing the summation of the constituent frequencies and simply stopping when arriving at the Nyquist frequency. This will get us as close as possible to representing a square-wave without having wrong sounding frequencies caused by aliasing.\n def  additive_square ( N ,  freq = 10 ,  Fs = 1000 ):  L  =  1 / freq ;  # period  Fs  =  Fs  # # of samples to take  t  =  np . linspace ( 0 , 1 , Fs )  # 1sec with Fs samples  signal  =  np . array ([ 0 ]  *  len ( t ),  float )  for  i  in  range ( 1 ,  len ( t )):  t0  =  t [ i ]  for  n  in  range ( 1 ,  N + 1 ):  signal [ i ]  +=  4 / np . pi  * \\  1 / ( 2 * n - 1 ) * np . sin ( 2 * ( 2 * n - 1 ) * np . pi * t0 / L )  return  ( t ,  signal ) def  plot_additive_square ( N ,  freq ,  Fs ):  L  =  1 / freq ;  print ( &#34;Highest constituent frequency:  %g  Hz&#34; \\  %  ((( 2 * N - 1 ) * np . pi / L ) / ( np . pi ))  )  t ,  signal  =  additive_square ( N ,  freq ,  Fs )  plt . figure ( figsize = ( 14 , 3 ))  plt . subplot ( 1 , 2 , 1 )  plt . plot ( t ,  signal ,  &#34;.-&#34; )  plt . title ( &#34;Additive square-wave at  %d  Hz \\n   \\  with  %d  terms, sampled at  %d  Hz&#34;  %  ( freq ,  N ,  Fs ))  plt . xlabel ( &#34;time [s]&#34; )  freqs ,  ps  =  fft_spectrum ( t ,  signal ,  Fs )  plt . subplot ( 1 , 2 , 2 )  plt . plot ( freqs ,  np . sqrt ( ps ))  plt . title ( &#34;Frequency spectrum of square-wave at  %d  Hz \\n   \\  with  %d  terms, sampled at  %d  Hz&#34;  %  ( freq ,  N ,  Fs ))  plt . xlabel ( &#34;frequency [Hz]&#34; )  plt . xlim ( 0 , 120 ) widgets . interact ( plot_additive_square , \\  N = widgets . IntSlider ( min = 1 , max = 7 , step = 1 , value = 3 ),\\  freq = widgets . fixed ( 18 ), Fs = widgets . fixed ( 200 )) &gt;  Highest  constituent  frequency :  90  Hz\n  In the figure above we can see an additive square-wave with different values for N sampled at 200Hz. We also the frequency spectrum for this wave. Peaks show up at even intervals as we increase N. But as soon as we hit half of the sampling frequency (100Hz) irregular peaks start to show up, which would cause a non harmonic sound (Not so good for making music). So we can simply stop at the value for N right before crossing the Nyquist frequency, in this case  \\(N = 3\\).\n When sampling at 44.1kHz and we want to generate a square wave with a fundamental at 420kHz N in this case would be  \\(N = 53\\). Depending on the circumstance this might be too many iterations to perform for each sample in a realtime application.\n A common approach is to use additive synthesis to generate the wanted waveforms beforehand for different frequencies and store the resulting samples in a wavetable which can then be looked up during runtime. But this requires precomputation and memory.\n   This method uses the fact that the step from the low value of the square wave and the high value of the square wave is theoretically instantaneous. So no matter what period or frequency the main square-wave is set to, the part of the wave that does the jump will be always be the same. In digital situation this means that this step can only be as sharp and have as many frequencies as the sample rate allows.\n The trick is to have a version of this step that is bandlimited. This &#34;BLEP&#34; can then be substituted in into areas of a naively generated waveform (not taking aliasing into account) that have too steep of a step, thus avoiding the higher frequencies. Since the BLEP will need to be centered around the discontinuity we will need to be able to predict ahead for a few samples when the step will occur, or simply delaying the signal a bit.\n These steps can be generated using additive synthesis, described above or by simulating the effect on an impulse being sent through a lowpass filter.\n   A development on the BLEP method is the so called polyBLEP. Here a polynomial approximation is given for the band limited step function. This allows for quick calculation of the band limited step and does not require memory lookups.\n This approximation is arrived at by mathematically interpreting the process of putting a step function through a lowpass-filter. Valimaki and Huovilainen describe the process in their  paper. The triangular wave can be used as a function for lowpass filtering, this because its frequency response has the shape of sinc^2. The triangular wave function is given by,\n  The frequency response of the triangular pulse can be applied to alter a square wave using convolution. The square wave is convolved with the triangular pulse. During this process the triangular pulse gets integrated.\n  The constant  \\(\\frac{1}{2}\\)-terms are there to ensure continuity. This is the polynomial Band-Limited stEP.The actual correction that is to be applied to a naively generated waveform is given by the BLEP residual. That is, the input impulse subtracted from the BLEP. We get\n $$f_{polyBLEP}(t) = \\begin{cases}\\frac{t^2}{2} + t + \\frac{1}{2} \\, , \\text{when} \\, -1 \\leq t \\leq 0 \\newlinet - \\frac{t^2}{2} + \\frac{1}{2} \\, , \\text{when} \\, 0 \\lt t \\leq 1\\end{cases} \\, .$$\n Implementing this in a program means we need some logic to find the discontinuities and then apply the correction. We will need to know in advance when our discontinuities show up in order to apply the correction, but since the waveforms are periodic this should not be too difficult.\n Below is an example of generating a square wave corrected with the help of polyBLEPS.\n # PolyBLEP by Tale # http://www.kvraudio.com/forum/viewtopic.php?t=375517 # (adapted a bit by me) #double t = 0.; // 0 &lt;= t &lt; 1 #double dt = freq / sample_rate; def  poly_blep ( t ,  dt ):  &#34;&#34;&#34;gives the polyblep correction for a   discontinuity given in a naively generated waveform.  dt = freq/Fs  &#34;&#34;&#34;  if  ( t  &lt;  dt ):  # 0 &lt;= t &lt; 1  t  /=  dt ;  # 2 * (t - t^2/2 - 0.5)  return  t + t  -  t * t  -  1  elif  ( t  &gt;  1.  -  dt ):  # -1 &lt; t &lt; 0  t  =  ( t  -  1. )  /  dt ;  # 2 * (t^2/2 + t + 0.5)  return  t * t  +  t + t  +  1  else :  # 0 otherwise  return  0 def  poly_square ( t ,  dt ,  aa ):  naive_square  =  0  if  t  &lt;=  0.5 :  naive_square  =  1 ;  if  t  &gt;  0.5 :  naive_square  =  - 1 ;  if  aa :  #with polyBlep correction.  #one for the raise and one for the fall (at 0.5)  return  naive_square  +  poly_blep ( t ,  dt ) \\  -  poly_blep (( t + 0.5 )  %  1 ,  dt )  else :  return  naive_square t  =  0 Fs  =  3520 f0  =  240 dt  =  f0 / Fs out_no_aa  =  np . array ([ 0 ] * Fs ,  float ) out_aa  =  np . array ([ 0 ] * Fs ,  float ) # make sawtooth wave f0 times t  =  np . linspace ( 0 , f0 , Fs ) for  i  in  range ( 0 , len ( t )):  t_tmp  =  t [ i ]  %  1  out_no_aa [ i ]  =  poly_square ( t_tmp ,  dt ,  0 )  out_aa [ i ]  =  poly_square ( t_tmp ,  dt ,  1 ) t  =  np . linspace ( 0 , 1 , Fs )  #f0 times in 1 second signal_no_aa  =  out_no_aa signal_aa  =  out_aa\n We can see the effect this has on aliasing by looking at the frequency response.\n #Plot! plt . figure ( figsize = ( 16 , 20 )) plt . subplot ( 4 , 2 , 1 ) plt . plot ( t ,  signal_aa ,  &#34;.-&#34; ) plt . title ( &#34;Square with polyBLEP&#34; ) plt . xlabel ( &#34;time [s]&#34; ) plt . xlim ( 0 , 0.05 );  plt . ylim ( - 2 , 2 ) plt . subplot ( 4 , 2 , 2 ) plt . plot ( t ,  signal_no_aa ,  &#34;.-&#34; ) plt . title ( &#34;Square without polyBLEP&#34; ) plt . xlabel ( &#34;time [s]&#34; ) plt . xlim ( 0 , 0.05 );  plt . ylim ( - 2 , 2 ) freqs ,  ps  =  fft_spectrum ( t ,  signal_aa ,  Fs ) plt . subplot ( 4 , 2 , 3 ) plt . plot ( freqs ,  np . sqrt ( ps ), &#34;.-&#34; ) plt . title ( &#34;Frequency response with polyBLEP&#34; ) plt . xlabel ( &#34;frequency [Hz]&#34; ) plt . xlim ( 0 , 2000 ) plt . ylim ( 0 , 400 ) freqs ,  ps  =  fft_spectrum ( t ,  signal_no_aa ,  Fs ) plt . subplot ( 4 , 2 , 4 ) plt . plot ( freqs ,  np . sqrt ( ps ), &#34;.-&#34; ) plt . title ( &#34;Frequency response without polyBLEP&#34; ) plt . xlabel ( &#34;frequency [Hz]&#34; ) plt . xlim ( 0 , 2000 ) plt . ylim ( 0 , 400 )\n   There we have it. In the signal without polyBLEPS we see a lot of unwanted frequencies. Any peaks with a height around 150 or below could be considered aliasing (except for maybe at the last peak). When adjusting the signal using the polyBLEP correction we se a dramatic reduction in aliasing!\n Below are two videos where you can hear the effects of the polyBLEPS. Here a sample rate of 22050 was used. VOLUME WARNING!\n     Go Top", "posttime": "2021-07-28 04:46:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模拟,analog,频率", "title": "虚拟模拟合成器：带限波形", "title_en": "Virtual Analog Synthesizer: Bandlimited Waveforms", "transed": 1, "url": "http://peter.mcevoy.se/blog/synth2-bl-osc.html", "via": "", "real_tags": ["模拟", "analog", "频率"]}, {"category": "", "categoryclass": "", "imagename": "e81d9c7467d139529d91f36e1e91ec3b.jpg", "infoid": 1070165, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果今天向开发者发布了 iOS 15 beta 4 和 iPadOS 15 beta 4。这些更新继续对有争议的 Safari 重新设计、iPadOS 主屏幕上播客的新小部件选项等进行更改。下面我们将汇总 iOS 15 和 iPadOS 15 beta 4 中的所有更改。iOS 15 beta 4 的版本号为 19A5307g。开发人员可以通过“设置”应用从 Beta 3 更新。只需打开“设置”应用程序，选择“常规”，然后选择“软件更新”。如果您没有立即看到 iOS 15 beta 4，请继续检查，因为更新仍在推出。 iOS 15 也可供公共测试版用户使用，但本周没有向这些用户发布新的测试版。下一个 iOS 15 公开测试版可能会在今天晚些时候或明天发布，但下周发布也不是不可能的。如果您发现 iOS 15 测试版 4 或今天 Apple 的其他新测试版有任何变化，请在下面的评论或 Twitter @9to5Mac 上告诉我们。请继续阅读，因为我们汇总了迄今为止发现的所有内容。 iPadOS 15 beta 4 中的 Safari 包含大量更改，包括与两周前 macOS Monterey beta 3 附带的设计类似的新设计。 iOS 15 beta 4 还包括对 Safari 的许多更改，包括： 重新加载按钮位于 URL 旁边，不再隐藏在长按后面 当点击网站时标签栏会最小化\n长按 URL 栏以找到“显示书签”选项 将小部件堆栈添加到主屏幕时，“智能旋转”的新图标 在 iOS 15 开发者测试版 4 中，快捷方式有一个新的“返回主屏幕”操作 – 这长期以来一直受到社区的要求，很高兴看到！ pic.twitter.com/8E3ZB7FIYX 设置应用程序中的新通知图标，以及在屏幕共享或屏幕镜像时禁用通知的切换锁定屏幕上的相机图标已被调整以删除快门按钮您正在阅读 9to5Mac — 日复一日地发布有关 Apple 及其周边生态系统新闻的专家。请务必查看我们的主页以获取所有最新消息，并在 Twitter、Facebook 和 LinkedIn 上关注 9to5Mac 以了解最新消息。不知道从哪里开始？查看我们的独家故事、评论、操作方法，并订阅我们的 YouTube 频道", "note_en": "Apple today has released iOS 15 beta 4 and iPadOS 15 beta 4 to developers. The updates continue to make changes to the controversial Safari redesign, a new widget option for Podcasts on the iPadOS home screen, and more. Head below as we roundup all of the changes in iOS 15 and iPadOS 15 beta 4.\n  iOS 15 beta 4 features the build number of 19A5307g. Developers can update from beta 3 via the Settings app. Simply open the Settings app, choose General, then choose Software Update. If you don’t see iOS 15 beta 4 immediately, keep checking as the update is still rolling out.\n iOS 15 is also available to public beta users, but no new beta has been released to those users this week. It’s possible that the next iOS 15 public beta build is released later today or tomorrow, but a release next week is not out of the question.\n If you spot any changes in iOS 15 beta 4, or the other new betas from Apple today, let us know in the comments below or on  Twitter @9to5Mac. Read on as we round up everything we’ve found so far.\n   Safari in iPadOS 15 beta 4 includes a host of changes, including a new design that is similar to what came with macOS Monterey beta 3 two weeks ago.\n  iOS 15 beta 4 includes a number of changes to Safari as well including:  the reload button is next to the URL and no longer hidden behind a long-press\n The tab bar minimizes when it gets in your way while tapping on a website\n Long press on the URL bar to find an option to “Show Bookmarks”\n  New icon for “Smart Rotate” when adding a widget stack to your Home screen\n Shortcuts has a new “Return to Home Screen” action in iOS 15 developer beta 4 – this has been long requested from the community and is great to see!  pic.twitter.com/8E3ZB7FIYX\n   New icon for Notifications in the Settings app, as well as a toggle for disabling notification when Screen Sharing or Screen Mirroring\n The camera icon on the lock screen has been tweaked to remove the shutter button\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-07-28 04:45:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,apple,safari,ipad,发布", "title": "Apple 在 iOS/iPad OS 15 Beta 4 中再次调整了 Safari UI", "title_en": "Apple tweaks the Safari UI again in iOS/iPad OS 15 Beta 4", "transed": 1, "url": "https://9to5mac.com/2021/07/27/whats-new-in-ios-15-beta-4-safari-changes-focus-tweaks-and-more/", "via": "", "real_tags": ["ios", "apple", "safari", "ipad", "发布"]}]