[{"category": "", "categoryclass": "", "imagename": "208184305cd917825f20c9b89381f14e.jpg", "infoid": 1008736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)-绿色地毯的山丘从英国萨默塞特郡的马里兰农场延伸出来，1833年，一个名叫丹尼尔·巴伯(Daniel Barber)的人在那里开始制作农家奶酪。近200年过去了，他的家族理发师的农舍生意依然蒸蒸日上，现在是世界上历史最悠久的切达干酪制造商。\n巴伯农庄董事总经理贾尔斯·巴伯(Giles Barber)是丹尼尔·巴伯(Daniel Barber)的曾孙，他说，我们所在的山谷是英国最肥沃、使用量最大的奶制品产区之一。\n我们有很多小农场，其中大部分仍为个体家庭所有。15英里外就是切达村，早期的奶酪制造者用石灰岩洞穴和峡谷作为天然冰箱。(虽然村子给切达奶酪起了个名字，但历史学家说，这种奶酪风格是在当地发展起来的。)。\n今天，巴伯农庄是少数几家被允许销售标有西乡农庄切达奶酪的生产商之一，这是一种受保护的原产地指定(PDO)，有严格的要求。在制作巴伯1833切达奶酪时，巴伯的生产者使用了这位19世纪的创始人会认识到的许多技术，这是一种包括在PDO中的奶酪。\n牛奶来自附近的牛群。奶酪凝乳仍然是手工翻转的。巴伯农庄避开了冻干培养的便利，保留了一系列传统培养物，即能将牛奶中的天然乳糖转化为可口乳酸的细菌菌株。\n在一个工业化生产、全球化食品的时代，理发师的农舍回忆起风味和传统更具地域性的时代。\n但即使是丹尼尔·巴伯在1833年第一次销售奶酪时，他也在帮助推动英国的食品体系走向现代。他不可能知道这一点，但他的浓郁醇厚的切达干酪正准备利用移民、技术和传统进行全球扩张。\n在萨默塞特郡乡村地区成立巴伯农庄两个世纪后，切达干酪是世界上最受欢迎的奶酪之一。事情是这样发生的。\n田园风光的萨默塞特地区是巴伯农庄和切达尔村的所在地，至少从12世纪起就开始生产奶酪，但早期的奶酪与今天的切达奶酪几乎没有什么共同之处。\n这需要创新--包括引进沉重的木制芝士压榨机和烹饪舞台--才能让现代切达干酪爱好者更熟悉一些东西。\n佛蒙特大学(University Of Vermont)奶酪科学家、“奶酪与文化：奶酪及其在西方文明中的地位”(Cheese and Culture：A History of Cheese and It It in Western Civilization)一书的作者保罗·金德斯泰特(Paul Kindstedt)说，基础技术在18世纪末就已经到位。这些改造提高了奶酪的质量和耐用性，生产出的奶酪更容易在远离原始农庄的地方出售。\nKindstedt说，英国所有的农业都开始以向伦敦市场运送产品为导向，包括奶酪。这需要在当时的背景下开发为长途运输而设计的奶酪。\n由此得到的奶酪水分较低。它的大小也更大，这使得奶酪不太容易损坏。\n萨默塞特奶酪制造商并不是唯一一家调整产品以适应运输的制造商，但到了18世纪末，他们击败了柴郡的竞争对手，主宰了伦敦的奶酪商店。\nKindstedt说，切达干酪成了首选奶酪。它是为市场设计的，也是为运输而设计的。\n当殖民移民分散在世界各地时，他们带来了英国的奶酪制作传统。\nKindstedt说，无论英国人走到哪里，切达干酪都占主导地位。Kindstedt解释说，在北美，许多移民来自制作切达奶酪的西部国家和东英吉利等奶酪制造地区。\n为了在新的地方谋生，他们决定从国内购买经过市场测试的产品。\n他说，移民只会简单地称来自旧国家、家乡的奶酪，在新国家也叫同样的名字。\n不久，来自殖民地和美国的切达奶酪的流行动摇了英国奶酪制造的基础。1875年，美国向英国出口了1亿磅奶酪。Kindstedt说，美国成为英国的奶酪供应国，基本上摧毁了英国的奶酪制造业务。\n不仅仅是美国。Kindstedt说，加拿大最终取代美国成为英国最大的奶酪供应国。他解释说，澳大利亚和新西兰也成为英国奶酪的主要供应国，这也是它的切达干酪。\n虽然切达干酪在许多前英国殖民地都有重要的遗产，但在曾经由英国控制的全球大部分地区，它远不是普遍的最爱。\nKindstedt认为，切达干酪的不同受欢迎程度在一定程度上反映了前殖民地原住民流离失所的程度。\n美国、加拿大、澳大利亚和新西兰--殖民主义压倒了土著居民，他说。人们对英式奶酪的偏好是现成的，当时他们统治着建立起来的殖民地。(肯德斯泰特指出，在讲法语的加拿大，人们对法式奶酪的偏好仍然非常强烈。)(Kindstedt指出，在讲法语的加拿大，人们对法式奶酪的偏好仍然非常强烈。)(Kindstedt指出，在讲法语的加拿大，人们对法式奶酪的偏好仍然非常强烈。)\n印度有着悠久的新鲜奶酪传统，比如Paneer，但帝国统治并没有说服这个国家喜欢切达干酪。Kindstedt说，切达干酪只是在最近才在印度获得了市场份额。\n在另一个前英国殖民地肯尼亚，奶酪在饮食中仍然只占很小的一部分。(在亚裔和非洲裔中常见的乳糖不耐受不是问题。陈年切达奶酪和其他硬的陈年奶酪一样，乳糖含量非常低。)。\nKindstedt解释说，(在这些国家)英国人只是极少数，土著居民占绝大多数，所以英国人对奶酪的热爱并没有像在美国和加拿大那样被广泛接受。\n贾尔斯·巴伯(Giles Barber)的后代制作的陈年奶酪现在在英国各地的商店和美国的全食超市(Whole Foods)都有销售。\n在英国，切达奶酪仍然是最受欢迎的奶酪。它也是加拿大奶酪的首选。\n但在澳大利亚，切达干酪长期以来一直在输给其他品种。虽然工厂制造的切达奶酪在新西兰统治了几十年，但许多规模较小的奶酪制造商已经转向了不同的奶酪。\n在美国，切达正式失去了它的地位。2006年，美国的意大利式生产，如马苏里拉奶酪，绕过了包括切达干酪在内的美式奶酪。除了2009年的短暂下滑外，马苏里拉一直位居榜首。\n对于丹尼尔·巴伯(Daniel Barber)来说，切达干酪在美国销量下降的催化剂可能比去全食超市(Whole Foods)：冷冻披萨(Whole Foods：冷冻披萨)更陌生。\n“切达奶酪：美国最具标志性的奶酪之旅”一书的作者、奶酪店主戈登·埃德加(Gordon Edgar)说，并不是切达干酪减少了，而是有更多预制的冷冻食品在市场上出现了。“切达干酪：通往美国心脏地带之旅”(Cheddar：A Journey to the Centre of America)一书的作者戈登·埃德加(Gordon Edgar)说，并不是切达干酪减少了，而是预制的冷冻食品更多了。\n冷冻食品货架上的许多新奇食品都是用马苏里拉奶酪填充、覆盖和填充的。而且它们并不是威胁切达奶酪统治地位的唯一创新。由于许多人出于道德或健康原因寻找乳制品替代品，素食奶酪一直在上升。\n这些创新是在所有切达干酪生产国经过几十年的工业化之后出现的，这些国家生产了许多切达干酪和类似切达干酪的加工奶酪，与巴伯的陈年版本相去甚远。\n埃德加说，切达干酪一直是为了提高效率而制造的。作为美国和其他地方农业项目的一部分，它是尽可能高效地向人们提供廉价蛋白质的一个非常重要的部分。\n但是，虽然最早的切达是为运输而生产的，但它们仍然有一种深度和细微差别，这让它们与普通的现代版本相去甚远。追逐这种原汁原味的奶酪制造商，从美国到英国乃至更远的地方，都让手工切达奶酪再次声名鹊起。\n近年来，埃德加看到了更多的布面切达干酪，这有助于开发出比浸蜡或塑料的奶酪更浓郁的味道。布扎切达干酪在美国已经完全灭绝了，我想英国只有三家生产商，他说。\n现在，如果你环顾四周，你会发现用布包裹的切达干酪可能比以往任何时候都多。这是一个迹象，表明奶酪制造商正在提升传统和工艺，有效地倒退了切达干酪的时间表和历史逻辑。\n通过这样做，奶酪制造商放弃了帮助切达奶酪统治一些奶酪市场这么长时间的一些效率。\n他们的收获对任何品尝手工切达干酪的人来说都是显而易见的，他们的时间和劳动力密集型生产导致了不同地区不同的细微差别的味道。\n西村农场的切达干酪味道鲜美，甜美可口，而新英格兰版本的切达干酪则以辛辣苦涩的味道和长久的陈年而备受赞誉。这就是奶酪贩子所说的地形，一种非常独特的地方味道。\n埃德加说，这一过程的低效有一个好处。它带给你的是味道上非常特别的东西。", "note_en": "(CNN) —  Green-carpeted hills roll away from Maryland Farm in Somerset, England, where a man named Daniel Barber began making farmstead cheese in 1833. Nearly 200 years later, his family&#39;s Barber&#39;s Farmhouse business is still going strong, now the oldest cheddar-maker in the world.\n &#34;The valley we&#39;re in here is one of the most fertile and densely used dairy areas in the UK,&#34; says Barber&#39;s Farmhouse managing director Giles Barber, who is Daniel Barber&#39;s great-great-great-grandson.\n  &#34;We&#39;ve got many small farms, and most of them are still owned by individual families.&#34; Fifteen miles away is the village of Cheddar itself, where early cheese makers used limestone caves and gorges as natural refrigerators. (While the village gave cheddar cheese a name, historians say the cheese style developed regionally.)\n Today, Barber&#39;s Farmhouse is one of a small handful of producers allowed to sell cheese labeled West Country Farmhouse Cheddar, a Protected Designation of Origin (PDO) with strict requirements. When making their Barber&#39;s 1833 cheddar cheese, a cheese that&#39;s included in the PDO, Barber&#39;s producers use many techniques that the 19th-century founder would have recognized.\n  Milk comes from nearby dairy herds. Cheese curds are still turned over by hand. Eschewing the convenience of freeze-dried cultures, Barber&#39;s Farmhouse maintains a collection of traditional cultures, strains of bacteria that convert milk&#39;s natural lactose into flavorful lactic acid.\n In an era of industrially produced, globalized food, Barber&#39;s Farmhouse recalls a time when flavors and traditions were more regional.\n But even when Daniel Barber first sold cheese in 1833, he was helping to nudge Britain&#39;s food system towards the modern day. He couldn&#39;t have known it, but his tangy, mellow cheddar was poised for a global expansion that leveraged immigration, technology and tradition.\n Two centuries after Barber&#39;s Farmhouse was founded in rural Somerset, cheddar is among the most popular cheeses in the world. Here&#39;s how it happened.\n    The bucolic Somerset region, home to both Barber&#39;s Farmhouse and Cheddar village, has produced cheese since at least the 12th century, but that early cheese had little in common with today&#39;s cheddar.\n It took innovation -- including the introduction of heavy, wooden cheese presses and a cooking stage -- to make something more familiar to modern cheddar-lovers.\n &#34;The basic technology comes in place by the late 1700s,&#34; says Paul Kindstedt, a cheese scientist at the University of Vermont and the author of &#34;Cheese and Culture: A History of Cheese and its Place in Western Civilization.&#34; Those adaptations increased quality and durability, producing a cheese that was easier to sell a long way from the original farmstead.\n &#34;All of English agriculture begins to be oriented around shipping products, including cheese, to the London market,&#34; Kindstedt says. &#34;That required developing cheeses that were designed for long-distance shipping in the context of the time.&#34;\n The resulting cheese was lower in moisture. It was also larger in size, which made the cheese less vulnerable to damage.\n  Somerset cheese-makers weren&#39;t the only ones adapting their products to shipping, but by the late 1700s they edged out competitors from Cheshire to dominate London cheese shops.\n &#34;Cheddar becomes the cheese of choice,&#34; says Kindstedt. &#34;It was designed for the market and designed for shipping.&#34;\n   And as colonial immigrants scattered across the world, they brought English cheese-making traditions with them.\n &#34;Wherever the English go, cheddar reigns,&#34; says Kindstedt. In North America, Kindstedt explains, many immigrants came from cheese-making regions such as the West Country and East Anglia that made cheddar-style cheese.\n Striving to make a living in a new place, they decided on market-tested products from back home.\n &#34;Immigrants would simply call cheeses from the old country, the homeland, the same names in the new country,&#34; he says.\n Before long, the popularity of cheddar cheese from colonies and the United States shook the foundations of cheese-making back in Britain. In 1875, the US exported 100 million pounds of cheese to the UK. &#34;The United States become the supplier of cheese to England, and basically destroyed the cheese-making business in England,&#34; says Kindstedt.\n It&#39;s not just the United States. Kindstedt said that Canada eventually displaced the US as England&#39;s number one cheese supplier. &#34;Australia and New Zealand also become major suppliers of English cheese, and it&#39;s cheddar, cheddar, cheddar,&#34; he explains.\n    While cheddar has an important legacy in many former British colonies, it&#39;s far from a universal favorite in the vast portion of the globe once controlled by the United Kingdom.\n Kindstedt believes the varied popularity of cheddar reflects, in part, the extent of displacement of native peoples in former colonies.\n &#34;America and Canada, Australia and New Zealand -- the colonization overwhelmed the Indigenous population,&#34; he says. &#34;The preference for English-style cheese came ready-made with the people who then dominated the colonies that were set up.&#34; (In French-speaking Canada, Kindstedt notes, there&#39;s still a very strong preference for French-style cheeses.)\n  India has a long tradition of fresh cheeses such as paneer, but imperial rule didn&#39;t convince the country to love cheddar. It&#39;s only recently that cheddar has gained ground in India, Kindstedt says.\n In Kenya, another former British colony, cheese remains a very small part of the diet. (Lactose intolerance, which is common among people of Asian and African descent, is not the issue. Aged cheddar, like other hard, aged cheeses, is very low in lactose.)\n &#34;The English were a tiny minority [in those countries] and the Indigenous people were a vast majority, so the English love of cheese did not translate to a broad acceptance the way it did in the United States and Canada,&#34; Kindstedt explains.\n   Aged cheeses made by the descendants of Giles Barber are now sold in shops across the UK and at Whole Foods stores in the United States.\n In the UK, cheddar remains the most popular cheese. It&#39;s Canada&#39;s cheese of choice, as well.\n But in Australia, cheddar has long been losing ground to other varieties. While factory-made cheddar dominated New Zealand for decades, many smaller cheesemakers have turned to different cheeses.\n And in the United States, cheddar&#39;s officially lost its perch. In 2006, US Italian-style production, such as mozzarella, bypassed &#34;American-style&#34; cheeses, which include cheddar. Aside from a brief slip in 2009, mozzarella has stayed on top.\n The catalyst for cheddar&#39;s fall in the US would have been even more alien to Daniel Barber than a trip to Whole Foods: frozen pizza.\n &#34;It&#39;s not that cheddar declined, it&#39;s that there are more pre-made frozen foods,&#34; says Gordon Edgar, a cheesemonger and the author of &#34;Cheddar: A Journey to the Heart of America&#39;s Most Iconic Cheese.&#34;\n Many of the novel foods in the frozen food aisle come stuffed, topped and filled with mozzarella. And they&#39;re not the only innovations threatening the dominance of cheddar cheese. As many look for dairy alternatives for ethical or health reasons, vegan cheeses have been on the rise.\n   Those innovations come after decades of increasing industrialization in all cheddar-making countries, which have produced many cheddars and cheddar-like processed cheeses that are a far cry from Barber&#39;s aged version.\n &#34;Cheddar is something that was always made for efficiency,&#34; says Edgar. &#34;As a part of agriculture programs in the United States and elsewhere, it was a very important part of getting cheap protein to people as efficiently as possible.&#34;\n But while the earliest cheddars were produced for shipping, they still had a depth and nuance that sets them far apart from generic modern versions. Chasing that original taste, cheesemakers from the United States to the United Kingdom and beyond have returned artisanal cheddar cheese to prominence once again.\n In recent years, Edgar has seen more cloth-bound cheddar, which helps develop richer flavor than cheese that&#39;s dipped in wax or plastic. &#34;Cloth-bound cheddar was completely extinct in the United States, and I think there were only three producers in England,&#34; he says.\n &#34;Now, if you look around, there&#39;s probably more cloth-bound cheddar than ever before.&#34; That&#39;s a sign that cheese-makers are elevating tradition and craft, effectively rolling back the timeline -- and the historic logic -- of cheddar cheese.\n By doing that, cheese-makers give up some of the efficiency that helped cheddar rule some cheese markets for so long.\n What they gain is obvious to anyone savoring a piece of artisanal cheddar, whose time- and labor-intensive production results in nuanced flavors that vary by region.\n West Country Farmhouse Cheddar is savory-sweet, while New England versions are prized for a sharp, bitter taste and long aging. It&#39;s what cheesemongers call terroir, a deeply particular taste of place.\n &#34;There&#39;s a beauty in the inefficiency of the process,&#34; said Edgar. &#34;What it gives you is something that&#39;s very special in terms of flavor.&#34;", "posttime": "2020-06-28 23:18:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帝国,empire,奶酪", "title": "切达帝国：奶酪超级大国的崛起", "title_en": "Cheddar empire: Rise of a cheese superpower", "transed": 1, "url": "https://www.cnn.com/travel/article/cheddar-cheese-history/index.html", "via": "", "real_tags": ["帝国", "empire", "奶酪"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自2012年左右以来，微软一直在推动无GUI运行Windows Server的概念，并通过PowerShell管理一切。我记得年复一年地坐在无数的TechED/Ignite会议上，我所能看到的是到处都是蓝色的PowerShell命令提示符。不再有向导和表单，基于MMC和GUI的管理突然成为过去。只需看看服务器核心、WinPE、Nano、PS Remoting、Windows SSH服务器、恢复控制台和紧急管理服务。甚至连System Center都是PowerShell的前端。如今，一切似乎都是文本模式。\n总体而言，这是一个好消息，与前几代Windows相比有了很大的改进，但如果您需要创建或编辑PowerShell、CMD脚本或某个配置文件，该怎么办？\n哎呀，看起来你完蛋了。看来雷蒙德忘了在sysadmin的工作中包括最关键的工具--一个简单的文本模式编辑器。微软是怎么回事？\n那么，有没有第三方的替代方案呢？是的，而且有而且相当多！不幸的是，没有一个是完美的，而且大多数都是陈旧的，没有人维护。这篇文章的目的是对任何可用的东西进行一次盛大的参观。\n请注意，在整篇文章中，我将反复提到“便携式”编辑器，对我来说，这意味着可以在USB笔驱动器或网络共享上随身携带的单个.exe文件。我也为64位Windows版本哭得很厉害，因为我经常在WinPE和其他无法使用syswow64的环境中工作。\n首先，让我们从通过管道间众所周知的最明显的选择开始。如果您搜索Windows控制台编辑器，VIM和Emacs自然会首先出现，这些编辑器不需要任何介绍或赞扬。我每天使用vim，偶尔使用Emacs。从我记事起，这两款手机就有Windows接口，而且在质量和稳定性方面绝对名列前茅。问题是，这两个都是完全陌生的，对于典型的Windows用户来说根本无法使用，学习曲线相当陡峭。此外，至少对Emacs而言，可移植性受到了很大影响。这两个编辑器都有数百个支持文件，而且都很大。Emacs.exe二进制文件的大小高达83MB，为了以防万一，zip文件包含其中的两个。整个解压的文件夹大小为400MB。\n幸运的是，Vim要好得多，您可以从包中提取单个vim.exe二进制文件并使用它，没有太多抱怨。\n当谈到VI和Emacs时，很难不提到一些更有历史意义的版本。Emacs的弟弟MicroEmacs从最早的时候就可以在Windows上使用了。我不打算尝试链接到任何一个特定的，因为有这么多的味道。\nVim小哥VI也有不同的形状和形式。我们来看几个。\n史蒂维是一个非常特殊的例子。有传言说，这个编辑器在Windows NT本身的开发中起到了至关重要的作用，或者从NT诞生之初就一直作为私有SDK的一部分使用。如果你曾经看过Windows的源代码，我打赌你可能会发现它埋藏在里面。因为它是由雷蒙德的人搬运的，所以质量应该是相当好的。不幸的是，自述文件声明“这是一个没有经过充分测试的不完整的VI。根据维基百科的历史注释，Stevie port to Amiga已经被Bram Moolenaar用作VIM的基本源代码。\n一个特别有趣的例子是Watcom编译器套件中的VI编辑器。它有非常好的TUI，可以从MS-DOS编辑器中得知，语法突出显示和在线帮助。Windows上可用的最好的VI版本之一。小的，便携的，到处都是方便的编辑器。这可能是我在WinPE或Server Core上工作时的主要TO文本编辑器。不幸的是不太为人所知。我希望它能获得一些它应得的人气。\n多亏了Federico Bianchi刚刚了解到有一个到Windows的BusbyBox端口，它同时具有32位和64位版本，100%可移植为一个单一的EXE文件！最重要的是，它包含一个能够理解窗口大小调整和Win32路径的vi编辑器。我会把这个留在身边。太棒了，忙得不可开交！作为最后的想法，我希望他们也包括Nano。\n我不希望这篇文章都是关于VI和Emacs的克隆。让这个漂亮的颜色菜单成为更多本地Windows/DOS编辑器的一部分，至少远离核心按键和Unix。\n对于主题的改变，让我们看看SemWare TSE Pro，它最初是DOS和OS/2的QEDIT编辑器。它拥有人们能想象到的文本模式编辑器的最先进功能。包括可调整大小的窗口、十六进制编辑器、宏和拼写检查器。我真希望我能在日常生活中使用它。不幸的是，TSE有一些缺点，它缺乏可移植的版本，安装也不是很麻烦。目前还没有x64版本，但是作者正在研究它。TSE不是免费的，许可证是45美元，但它允许你在任何需要的机器上安装。\n下一个是简短的。它曾经在它自己的时代非常流行，并引发了相当多的追随者，因为有无数的编辑都是“简约风格”的。这是一个不错的基于小控制台的文本编辑器。它有两个版本，基本版(免费)和专业版(付费)。Pro版本支持拆分成多个windows regexp和unicode。不幸的是，它的售价为每个用户120美元，而且没有64位版本或便携版本。\n还有一个叫做悲伤的Brief的开源克隆。翻阅手册，它有一套非常令人印象深刻的功能，包括120美元的窗口功能和宏。不幸的是，由于大量的DLL和其他文件，它相当不可移植。如果有人想要的话，可以做64位版本。\n当我们谈论更便宜的选项时，有Kinesics文本编辑器(又名工具包)。“如果你在谷歌上搜索，它更广为人知，完全免费，安装后你可以找到一个x64二进制文件！例如，这使得它具有一定的可移植性，并且能够在WinPE中运行。直到最近，这个编辑器还没有64位版本，所以我没有机会在实践中使用它，但TUI似乎有一个很好用的好用(F1或鼠标右键单击会带来菜单)。它似乎没有任何先进的功能，但它非常稳定，并积极维护。坦率地说，这就是在控制台上进行编辑的关键所在。它实际上可能就是缺少的Windows控制台编辑器。\n另一个是最低利润。它是完全开源的，在窗口和文本模式下都支持很多平台。它有很多有趣的功能，比如语法突出显示、拼写检查和菜单。它不容易移植，因为它需要大量自己脚本语言的文件。默认情况下没有Win64构建，但是可以使用Mingw64构建。我还发现屏幕刷新有点时髦。\n让我们来看看有些广为人知的FTE。这是一个非常好的文本编辑器，可以在很多平台上使用，比如QNX、OS/2，当然还有Windows。它有漂亮的TUI，拆分窗口，语法高亮显示，折叠，书签和HTML创作工具等。总体来说，令人敬畏的编辑器只有在TSE上做不到。对NT控制台的支持从1997年开始提供。我最近修复了几个错误，并构建了一个64位便携式版本。\n人们也不能忘记Borland Turbo C IDE。显然，作为常规编辑器的IDE有一个开源克隆，名为SETEdit。它是一个多平台编辑器，具有MS-DOS风格的窗口和菜单。语法突出显示宏和所有常规功能。看起来DOS版本可以在你编码时播放MP3歌曲。有一个使用BCPP创建的本机WinNT版本。要在Windows上运行，您需要安装DOS版本，然后覆盖DOS EXE文件WIN NT EXE。编辑器绝对令人敬畏，不幸的是，目前它不能以可移植的方式工作，并且没有x64二进制代码。然而，由于它是开源的，它很可能是可以制作的。\n当谈到MS-DOS风格的窗口时，诺顿司令官就像文件管理器一样浮现在脑海中。有一个专门为Windows构建的软件--Far Manager。由WinRAR的作者编写，最初是共享软件，但自2007年以来一直在BSD许可下发布。FAR确实附带了一个内置的文本编辑器，因此这里有它的特色。它得到了积极的支持和开发，而且因为它是完全为Windows设计的，所以在本文的所有应用程序中，它可能是最稳定和最值得信赖的。我通常不经常使用它，但当我需要从Windows控制台做更多繁重的工作时，我确实会在周围放一份它的副本。默认情况下是64位二进制文件，但不幸的是，FAR很难使其可移植，因为它附带400个文件。\n当谈到诺顿指挥官克隆时，让我们不要忘记午夜指挥官，它确实有一个非官方的本地Windows控制台版本，名为mcwin32。与FAR类似，MC有一个非常好的内置文本编辑器。总体而言，MC看起来要好得多，但是因为它是多平台的，而不是特定于Windows的，并且没有官方支持，所以我不太信任它的日常使用。\n当谈到Unix的话题时，让我们来谈谈GNU Nano。在它的原生环境中，它是非常受欢迎和稳定的编辑器，这使得它成为文本模式控制台的完美选择。不幸的是，Windows端口缺少相当多，特别是在调整窗口大小或处理文件名等方面。官方版本看起来像融合了Cygwin，mingw，pdcurses和其他可怕的东西。Mingw/MSYS附带的版本不可移植，到目前为止，我尝试手动构建静态Windows二进制文件失败了。不幸的是，Nano的前身UW Pico从来没有控制台终端Windows端口。Pine的作者决定使其成为半图形应用程序，具有自己的窗口、菜单和按钮。对皮科和纳诺来说都是个悲伤的故事。希望有一天有人能开发出100%的原生Windows端口。\n另一个带有Windows控制台端口的非vi和非emacs Unix编辑器是jed。坦率地说，我在过去使用Jed的次数不多，尽管我在90年代使用过它。这是JED编辑器的原始网页。它似乎确实有菜单和多窗口。不幸的是，它看起来不像是很容易制作成便携图像的。\n另一个更晦涩难懂的编辑器是ED-NT，它是DEC EDT克隆。不幸的是，似乎完全死了，无人维护。资源仍然可以通过Archive.org获得，所以如果有人想在Windows上使用EDT编辑器，也许仍然可以照看。\n在通过Archive.org浏览晦涩难懂的内容时，人们还可以提到ZABED，更具体地说是Z95，它是一个32位的控制台版本。我对编辑器一无所知，尽管有pdf手册可用，但我有点太懒了，不想广泛使用它。可能有点太老了，太不知名了，不适合日常使用。\n也许对一个凡人来说更默默无闻的是赫斯林编辑，也就是那个。它基于VM/CMS编辑器XEDIT。我曾在90年代初短暂地使用过VM/CMS和XEDIT，但我从未如此喜欢过它。作为本机Win32二进制文件传入。不容易移植，因为它需要一些额外的文件。也没有64位二进制，但源代码可用。\n多亏了安德烈亚斯·科尔，我了解到了X2程序员编辑器，它也有NT控制台版本。这个编辑器看起来很不错，有广泛的帮助，语法突出显示等。不幸的是，我以前从来没有用过这个编辑器。最后一个版本是在2008年发布的，虽然时间不长，但遗憾的是此后一直没有更新。我希望作者继续维护它。\n安德烈亚斯还提到了个人编辑器，名为PE32和PE64。看起来像是专门为Windows设计和开发的维护良好和稳定的编辑器。64位版本真的很酷，但是编辑器似乎不是便携的，40美元的许可证可能会阻止我在需要它的环境中专业地使用它。尽管如此，看起来还是像是一位非常优秀的编辑！\n另一个发现是E3编辑器。很有趣的东西。它是用汇编语言编写的，可以在许多操作系统上使用，包括DOS和Windows。看起来它仍然保持着2016年发布的上一个版本。它通过重命名或链接主可执行文件来支持多种模式，Wordstar、Emacs、Vi、Pico和Nedit。它绝对是便携的，因为它不需要任何额外的文件，而且可执行文件只有20KB(以emacs为例！)。不幸的是，由于汇编器的原因，我认为短期内不会有64位版本。总体而言，把这个留在身边看起来真的很酷。\n一个非常酷的最后一刻发现是公共领域的TDE--汤姆森-戴维斯编辑器。它在2007年发布不久，拥有16位32位DOS和32位Windows控制台可执行文件。它有DOS风格的菜单、语法突出显示、可调整大小的窗口和一系列其他功能。看起来是个非常好用的编辑器。我不知道我是怎么错过的。因为源代码是可用的，所以我能够进行x64构建。这真的是未经测试的，所以使用风险自负！\n还有一个最近推出的名为Aurora的查找共享软件编辑器。我过去从来没有机会用过它，但在快速旋转后，我爱上了它。文本模式的用户界面感觉就像是它自己的窗口操作系统！Win32端口最初适用于DOS、Unix和OS/2，是相对较新的端口。不幸的是，它不再得到维护，甚至不再出售。这是非常可悲的，因为编辑非常酷。我希望作者可能愿意发布源代码，这样它就可以得到维护。\n多亏了理查德·威尔斯，我了解了OSPlus文本编辑器。这是一个非常酷的小编辑器，有Borland风格的TUI和多窗口。它似乎没有任何高级功能，但它确实有一个内置的计算器，并允许WAV和MID的背景播放。还允许使用Microsoft Office转换器将各种格式(如Word、Write或RTF)转换为文本。如果您需要在文本控制台上阅读基于Word的文档，则非常酷。遗憾的是，该应用程序似乎不再进行维护。我猜如果运气好的话，64位版本可以用Mingw64或MSVC编译。\n最近也学到了HT。它更适合用作二进制/exe/十六进制编辑器和分析器。不过，它似乎有一个出色的纯文本编辑器，带有HTML和C语法突出显示。它没有非常高级的功能，但有一点很突出，那就是非常详细的更改日志，很像Photoshop History。它会向您显示具体更改了哪些内容以及更改的顺序。在对一些重要文件进行大量编辑时，这是相当酷的。最新版本是2015年的，是100%便携的单机可执行文件。不幸的是，没有x64，但我想用Mingw64构建一个应该很容易。\n只是在新鲜的“重新发现”-微软编辑器。该编辑器是Mark Zbikowski将Z编辑器移植到MS-DOS的Win32端口。它与微软C++作为M、MEP和OS/2 SDK作为SDKED一起被广泛使用。令人震惊的是，看起来Windows NT从最早甚至更早的时候就有了控制台模式的文本编辑器。Win32控制台模式MEP.EXE包含在Windows NT预发行CD中以及后来的官方Windows NT/2000 SDK中，隐藏在人们的视线中。只有当Microsoft将此编辑器包含在Windows本身中时，世界才会完全不同。我最近把它从SDK中挖掘出来，并在这里提供。这里还有其他版本(包括x64)。有一篇专门的博客文章是关于这件事的。\n与许多商业编辑器一样，Z有一个开放源码版本，名为K_Edit。它是用C++和Lua编写的从头开始的现代重新实现。它只构建在64位Windows上，可能没有其他版本。到今天为止，K的作者还没有提供现成的二进制文件，但是我能够自己制作一个。\n读者Tbrdlph向我推荐了一位名叫TextaDepartment的相当新鲜的编辑。它是跨平台的，既有GUI编辑器，也有TUI编辑器。Windows控制台版本使用Curses，但它执行得非常好。它有一种现代程序员文本编辑器的外观和感觉，带有语法突出显示、行号等。由于zip存档附带了400多个文件，所以它相当不便于移植。此外，似乎没有Windows 64位版本，尽管有一个针对Linux的版本。这个应用程序似乎维护得很好，最新版本是从2018年1月开始发布的！\n读者安德烈亚斯·科尔(Andreas Kohl)提到了SlickEdit，这是DOS、OS/2和Windows控制台的文本模式编辑器(在Visual SlickEdit窃取它的名字之前)。根据该公司员工的说法，一些Windows NT团队成员使用OS/2版本的编辑器来开发他们的操作系统。早期，SlickEdit CTO前往雷德蒙德，将应用程序移植到一个几乎无法正常工作的NT控制台系统，以便开发人员可以使用本地开发环境。SlickEdit很可能是Windows NT的第一个商业应用程序。它有386、Alpha、MIPS和PowerPC版本。我希望能拿到旧的评估复印件。到目前为止，我得到了这样的截图：\n最后但并非最不重要的是，这个街区的新成员是Micro。它是一个适用于所有平台(包括Windows)的现代编辑器。它看起来真的很酷，似乎有来自Sublime Text或Atom等编辑器的所有最新便利设施。多窗口、语法突出显示，甚至它自己内置的用于运行子shell的终端仿真器。Micro是100%可移植的，并且以单个x64exe文件的形式提供。它有10MB大小，但我认为值得保留。不幸的是，它没有内置的文件浏览器。是的，有插件，但是我不知道怎么用。Windows样式路径名似乎也有问题。然而，我真的很高兴最近开发了一个新的编辑器。它很有可能成为未来缺失的Windows文本模式编辑器！绝对值得关注。\n有了这个积极的消息，是时候结束了。总而言之，目前还没有完美的Windows文本模式编辑器。我希望有一天微软能站出来提供一个。同时，我通常会继续使用OpenWatcom VI和Far Manager。对于那些不想学习VI的人来说，Kinesics Kit可能在短期内是最完美的编辑器，在未来可能是最完美的编辑器。我也希望有人能用原生Win32API做一个很好的GNU Nano移植，而不用去pdcurses和cygwin。\n感谢您的所有建议！我有没有忘记或错过任何编辑？请告诉我，我会立即将其添加到列表中！注意：请不要包括在Cygwin下工作的编辑器。", "note_en": "Since 2012 or so Microsoft is pushing concept of running Windows Server headless without GUI and administering everything through PowerShell. I remember sitting through countless TechEd / Ignite sessions year after year and all I could see were blue PowerShell command prompts everywhere. No more wizards and forms, MMC and GUI based administration is suddenly thing of a past. Just take a look at Server Core, WinPE, Nano, PS Remoting, Windows SSH server, Recovery Console and Emergency Management Services. Even System Center is a front end for PowerShell. Nowadays everything seems to be text mode.\n This overall is good news and great improvement since previous generations of Windows, but what if you need to create or edit a PowerShell, CMD script or some config file?\n  Oooops, looks like you are screwed. Seems that Redmond forgot to include most crucial tool in sysadmin’s job – a simple text mode editor. WTF Microsoft?\n So, are there any 3rd party alternatives? Yes, and there are and quite a lot of them! Unfortunately none are perfect and most are old and unmaintained. This article aims to be a grand tour of whatever is available out there.\n Note that throughout the article I will be repeatedly referring to a “portable” editor, that for me means single .exe file that can be carried around on a USB pen drive or network share. I also cry a lot about 64-bit Windows builds because I work a lot in WinPE and other environments where syswow64 is not available.\n First lets start with most obvious choices well known through intertubes. If you search for a Windows Console Editor   VIM and   Emacs will naturally pop up first.These editors don’t need any introduction or praising. I use VIM every day and Emacs every now and then. These two had ports to Windows for as long as I can remember and in terms of quality and stability definitely up top. The problem is that both are completely foreign and just plain unusable to a typical Windows user and learning curve is pretty steep. Also portability suffers a lot at least for Emacs. Both editors come with hundreds of supporting files and are massive in size. Emacs.exe binary is whopping 83 MB in size and the zip file contains two of them just in case. Whole unpacked folder is 400 MB.\n  VIM is fortunately much much better you can extract single vim.exe binary from the package and use it without much complaints.\n  When talking about about VI and Emacs hard not to mention some more historical versions. Emacs’ little brother  MicroEmacs has been available for Windows since earliest days. I’m not going to attempt to link to any particular one since there are so many flavors.\n  VIM little brother VI also comes in different shapes and forms. Lets take look at a few.\n     Stevie is a very special case. Rumor has it, this editor played crucial role in development of Windows NT itself or has been used since earliest days of NT as part of the private SDK. If you could ever look at Windows source code I’d bet you could probably find it buried inside. Because it was ported by folks at Redmond the quality should be pretty good. Unfortunately README states  “this is an incomplete VI that has not been fully tested. Use at your own risk.”. For a historical note according to Wikipedia, Stevie port to Amiga has been used by Bram Moolenaar as a base source code for VIM.\n  One particularly interesting case is  VI editor from Watcom compiler suite. It has very nice TUI known from MS-DOS editors, syntax highlighting and online help. One of nicest versions of VI available for Windows. Small portable and just all around handy editor. This is probably my main to go text editor when working on WinPE or Server Core. Unfortunately not very well known. I hope it can gain some popularity it deserves.\n  Thanks to Federico Bianchi just learned that there is a BusbyBox port to Windows having both  32bit and  64bit builds, 100% portable as just a single exe file! Most importantly it contains a working vi editor that understands window resizing and Win32 paths. I’m going to be keeping this one around. Awesome job Busybox! As a last thought I wish they also included Nano.\n  I don’t want this article to be all about VI and Emacs clones. Let this nice color menus be a segue to more native Windows / DOS editors at least departing from hardcore keystrokes and Unix.\n For a change in theme lets look at  SemWare TSE Pro, the editor that originally started as QEDIT for DOS and OS/2. It has most advanced features one could ever imagine for a text mode editor. Including resizable windows, hex editor, macros and spell checker. I really wish I could use it in everyday’s life. Unfortunately TSE has some drawbacks, it lacks portable version and install is little cumbersome. Currently no x64 build but the author is working on it. TSE is not free, the license is $45 but it allows to install on as many machines as you need.\n  Next one up is  Brief. It used to be very popular in it’s own time and sparked quite bit of following as there are numerous of editors being “brief style”. It’s a nice and small console based text editor. It comes in two versions basic (free) and professional (paid). The pro version supports splitting in to multiple windows regexp and unicode. Unfortunately it runs at $120 per user and there is no 64bit build or a portable edition.\n  There also is an open source clone of Brief called GRIEF. Flipping through  the manual it has very impressive set of features including $120 windowing feature and macros. Unfortunately it’s rather unportable due to large amount of dll and other files. 64bit build could probably be made if someone wanted.\n  As we talk about less costly options there is  Kinesics Text Editor aka KIT. It’s more well known if you search on google, completely free and after installing you can find and a x64 binary file! This makes it somewhat portable and able to run in WinPE for instance. Until recently the editor did not have 64bit version so I did not have chance to use it much in practice but the TUI appears to have a well rounded easy to use (F1 or right mouse click brings menus). It does’t seem to have any advanced features but it’s very stable and actively maintained. And frankly this is what matters for editing on the console. It may actually be the right missing Windows console editor.\n  Another one is  Minimum Profit. It’s fully open source and it supports a lot of platforms in both windowing and text mode. It has a lot of interesting features such as syntax highlighting, spell checked and menus. It can’t be easily made portable as it needs a lot of files of it’s own scripting language. There is no Win64 build by default but one could probably make it with Mingw64. I also find that screen refresh is somewhat funky.\n  Lets look at somewhat well known  FTE. It’s a very nice text editor available on many platforms such QNX, OS/2 and of course Windows. It has nice TUI, split windows, syntax highlighting, folding, bookmarks and tools for HTML authoring etc. Overall awesome editor falling short only to TSE. Support for NT console has been available since 1997. I have recently fixed couple of bugs and built a  64bit portable version.\n  One could also not forget Borland Turbo C IDE. Apparently there is an open source clone of the IDE as a regular editor called  SETEdit. It’s multi platform editor with MS-DOS style windows and menus. Syntax highlighting macros and all regular amenities. Looks like DOS version can play MP3 songs while you code. There is a native WinNT build made with BCPP. To run on Windows you install the DOS version then overwrite dos exe file win NT exe. The editor is absolutely awesome, unfortunately currently doesn’t work in a portable manner and there is no x64 binary. However as it’s open source it could be probably made.\n  When talking about MS-DOS style windows, Norton Commander like file managers come to mind. There is one particular built specifically for Windows –  FAR Manager. Written by author of WinRAR, originally shareware, but since 2007 it has been released under BSD license. FAR does come with a built in text editor hence it’s featured here. It’s actively supported and developed, and because it’s designed from ground up for Windows, it’s probably most stable and trustworthy of all applications in this post. I normally don’t use it that much, but I do keep a copy of it lying around when I need to do some more heavy lifting from Windows console. There is a 64bit binary by default but unfortunately FAR can be hardly made portable as it comes with 400 files.\n  When talking about Norton Commander clones lets not forget  Midnight Commander, which does have an unofficial native Windows console build called mcwin32. Similar to FAR, MC has a very nice built-in text editor. MC overall seems far nicer than FAR but because it’s multi platform rather than WIndows specific and not officially supported I don’t trust it as much for day to day use.\n  When on topic of Unix, lets talk about  GNU Nano. In it’s native habitat, it’s very popular and stable editor making it a perfect choice for a text mode console. Unfortunately Windows port is lacking quite a lot, especially for things like resizing Window or handling file names. The official build looks like a fusion of cygwin, mingw, pdcurses and other horrible stuff. Version that comes with Mingw/MSYS is not portable and so far I failed in attempts to build a static windows binary by hand. Nano predecessor UW Pico unfortunately never did have console terminal Windows port. Authors of Pine decided to make it semi graphical application with it’s own window, menus and buttons. Sad story for both Pico and Nano. Hopefully one day someone will make a 100% native Windows port.\n  Another non-vi and non-emacs Unix editor with Windows console port is  JED. Frankly I have not used JED that much in the past although I did play with it in the 90s. This is the original  web page of Jed editor. It does seem to have menus and multi windows. Unfortunately doesn’t look like it can be easily made in to a portable image.\n  Yet another more obscure editor is  ED-NT which is DEC EDT clone. Unfortunately seems to be completely dead an unmaintained. Sources are still available through archive.org so perhaps it could be still looked after if someone wanted EDT editor on Windows.\n  When going through obscurities via archive.org one can also mention ZABED and more specifically  Z95 which is a 32bit console version. I don’t know anything about the editor and I’m little too lazy to play with it extensively although  pdf manual is available. Probably little too old and too obscure for every day use.\n  Perhaps even more obscure to a mere mortal is  The Hessling Editor aka THE. It’s based on VM/CMS editor XEDIT. I did briefly use VM/CMS and XEDIT in early ’90 but I never liked it so much. THE comes in as a native Win32 binary. Not easily portable as it requires some additional files. Also no 64bit binary but source code is available.\n  Thanks to Andreas Kohl I have learned about  X2 Programmers Editor which also has NT console version. The editor seems very nice and has extensive help, syntax highlighting, etc. Unfortunately I have never used this editor before. Last version has been released in 2008 which is not loo long ago but sadly there has been no update since. I hope the author will continue to maintain it.\n  Andreas also brought up Personal Editor, which comes as  PE32 and  PE64. Looks like really well maintained and stable editor designed and developed specifically for Windows. 64bit bit version is really cool however the editor doesn’t seem to be portable and $40 license will probably prevent me from using it professionally in environments where I would need it. Never the less looks like a very fine editor!\n  Another find is  e3 editor. Pretty interesting stuff. It’s written in assembler and available on many operating systems including DOS and Windows. Looks like it’s still maintained as last version was released in 2016. It supports multiple modes,  Wordstar,  Emacs,  Vi,  Pico and  Nedit by renaming or linking the main executable. It’s definitely portable as it doesn’t need any extra files and the exe is just 20KB (take that emacs!). Unfortunately because of assembler I don’t think there will be a 64bit release any time soon. Overall seem to be really cool to keep this one around.\n  A really cool last minute find is public domain  TDE – Thomson-Davis Editor. Released not so long ago in 2007 it has 16, 32bit DOS and 32bit Windows console executable. It has DOS style menus,syntax highlighting, resizable windows and bunch of other features. Looks like a very handy editor. I don’t know how did I miss it. Since source code was available so I was able to make a  x64 build. This is really untested so use at your own risk!\n  Also a recent find – shareware editor called  Aurora. I never had a chance to use it in the past but after taking it for a quick spin I fell in love. The text mode UI it feels like it’s own windowing operating system! Originally for DOS, Unix and OS/2, Win32 port is relatively new. Unfortunately it’s no longer maintained or even sold. This is very sad because the editor is extremely cool. I hope the author may be willing to release the source code so it could be maintained.\n  Thanks to Richard Wells I have learned about  OSPlus Text Editor. It’s a really cool little editor with Borland style TUI and multi windows. It doesn’t seem to have any advanced features but it does have a built in calculator and allows background play of WAV and MID. Also allows format conversion of various formats like Word, Write or RTF in to text using Microsoft Office converters. Pretty cool if you need to read Word based documentation on the text console. Sadly looks like the application is no longer maintained. I guess with little bit of luck a 64bit version could be compiled using Mingw64 or MSVC.\n  Also recently learned about  HT. This is more intended as a binary/exe/hex editor and analyzer. However it seems to have an excellent plain text editor with HTML and C syntax highlighting. It doesn’t have very advanced features but one that stands out is a very detailed change log, much like Photoshop History. It shows you what exactly has been changed and in what order. This is pretty cool when doing heavy editing of some important files. The latest version is from 2015 and it’s 100% portable single exe. Unfortunately no x64 but I guess it should be easy enough to build one with Mingw64.\n  Just in freshly “re-discovered” –  Microsoft Editor. This editor is a Win32 port of Mark Zbikowski’s port of  Z editor to MS-DOS. It has been widely used with  Microsoft C as M, MEP and and OS/2 SDK as  SDKED. Shockingly looks like Windows NT did actually have a console mode text editor since it’s earliest days or even earlier. Included in Windows NT pre-release CDs and later on the official Windows NT/2000 SDKs, hiding in plain sight, was a Win32 console mode MEP.EXE. Only if Microsoft included this editor with Windows itself the world would be a different place. I have recently dug it out of SDK and made available  here. There also are additional builds (including x64)  here. There is a dedicated  blog post about it.\n  As with many commercial editors there is an open source edition of Z named  K_Edit. It is a modern re-implementation from scratch written in C++ and LUA. It builds only on 64bit Windows and there probably is no chance for any other version. As of today author of K doesn’t provide ready binaries but I was able to  make one myself.\n  Reader  brdlph pointed me to a pretty fresh editor named  Textadept. It’s a cross platform, both GUI and TUI editor. Windows console version uses Curses, but it performs remarkably well. It has a look and feel of a modern programmer’s text editor with syntax highlighting, line numbers, etc.  The zip archive comes with over 400 files so it’s rather not portable. Also there seem to be no Windows 64bit build although there is one for Linux. The application seem to be very well maintained and the latest release is from January 2018!\n  Reader Andreas Kohl mentioned SlickEdit, which was a text mode editor for DOS, OS/2 and Windows console (before Visual SlickEdit stole it’s name). According to the company’s employee an OS/2 version of the editor was used by some Windows NT team members to develop their operating system. In early days, SlickEdit CTO traveled to Redmond to port the application to a barely yet functioning NT console system so that the developers could use native dev environment. SlickEdit was most likely the very fist commercial application for Windows NT. It was available in 386, Alpha, MIPS and PowerPC editions. I’m hoping to obtain old evaluation copies. So far I was able to get this screenshot:\n  Last but not least, a new kid on the block, is  Micro. It’s a modern times editor for all platforms including Windows. It looks really cool and seem to have all recent amenities from editors such as Sublime Text or Atom. Multi windows, syntax highlighting and even it’s own built in terminal emulator for running a subshell. Micro is 100% portable and comes in as a single x64 exe file. It’s 10 MB size but I think well worth keeping around. Unfortunately it doesn’t have built-in file browser. Yes, there is a plugin for it but I don’t know how to use it. Also seems to have issues with Windows style path names. However I’m really happy that a new editor has been developed in recent times. It has a great chance of becoming the missing Windows text mode editor for the future! Definitely worth keeping an eye on it.\n  With this positive news it’s time to wrap up. To summarize there currently is no perfect text mode editor for Windows. I hope that Microsoft can one day step up and provide one. In the mean time I usually stick around to OpenWatcom VI and FAR Manager. For people who do not wish to learn VI, Kinesics KIT may probably be the most perfect editor in short term and Micro in the future. I also hope someone can make a good GNU Nano port using native Win32 APIs without going to pdcurses and cygwin.\n Thank you for all suggestions! Have I forgotten or missed any editor? Please let me know and I will promptly add it to the list! Note: please do not include editors that work under Cygwin.", "posttime": "2020-06-28 22:57:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,console,编辑器", "title": "需要：Windows控制台文本编辑器", "title_en": "Wanted: Console Text Editor for Windows", "transed": 1, "url": "https://virtuallyfun.com/wordpress/2018/02/15/wanted-console-text-editor-for-windows/", "via": "", "real_tags": ["windows", "console", "编辑器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇博客文章解释了Linux程序如何调用Linux内核中的函数。它将概述几种不同的进行系统调用的方法、如何手工制作自己的程序集来进行系统调用(包括示例)、系统调用的内核入口点、系统调用的内核出口点、glibc包装器、bug等等。", "note_en": "TL;DR This blog post explains how Linux programs call functions in the Linux kernel. It will outline several different methods of making systems calls, how to handcraft your own assembly to make system calls (examples included), kernel entry points into system calls, kernel exit points from system calls, glibc wrappers, bugs, and much, much more.", "posttime": "2020-06-28 22:56:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,系统,调用", "title": "Linux系统调用指南(2016)", "title_en": "Guide to Linux System Calls (2016)", "transed": 1, "url": "https://blog.packagecloud.io/eng/2016/04/05/the-definitive-guide-to-linux-system-calls/", "via": "", "real_tags": ["linux", "系统", "调用"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果我们非常频繁地在程序中调用昂贵的函数，最好保存函数调用的结果以供将来使用，而不是每次都调用函数。这通常会加快程序的执行速度。\n函数的开销可以是计算性的(CPU使用率)或延迟(磁盘读取、从网络获取资源)。\n函数调用的保存结果通常称为缓存。进行缓存的天真方法是存储每个函数调用。但是，对于函数的参数数量和每个参数的范围来说，这不是很好的伸缩性。\n因此，我们需要一种使用固定内存量进行缓存的智能方法。而且，根据我们可以获得的信息类型，有很多可用的缓存策略。\n从低级(硬件/CPU)到高级(网络/CDN)，缓存在很多领域都得到了大量使用。\n在大多数语言中，我们将选择自己选择的缓存策略，并使用一些数据结构(哈希图、优先级队列)来实现它们。根据语言的不同，可能只需要几分钟到几个小时就可以实现我们需要的通用解决方案。\n但是，Python的标准库函数工具已经附带了一种称为LRU(最近最少使用)的缓存策略。多亏了python中的装饰者，只需一行代码就可以集成到现有的代码库中。\n导入时间为TT def fib(N)：如果n&lt；=1，则返回n个返回fib(n-1)+fib(n-2)t1=TT。time()fib(30)打印(f&#34；花费的时间：{tt.。time()-t1}&#34；)#输出：#耗时：0.3209421634674072\n将时间导入为TT import functools#保存所有函数调用@functools。lru_cache(maxSize=31)def fib(N)：如果n&lt；=1：返回n个返回fib(n-1)+fib(n-2)t1=TT。time()fib(30)打印(f&#34；花费的时间：{tt.。time()-t1}&#34；)打印(图。cache_info())#输出：#花费的时间：1.7881393432617188e-05#CacheInfo(命中=28，未命中=31，最大大小=31，当前大小=31)。\n在本例中，我们保存了所有函数调用。但是，我们知道斐波纳契可以使用DP来实现。\n导入时间为tt定义fib_iterative(N)：如果n&lt；=1：对于范围(n-1)内的i，返回n f，s=0，1：t=f+s f，s=s，t返回t t1=tt。time()fib_iterative(30)打印(f&#34；所用时间：{tt.。time()-t1}&#34；)#输出：#耗时：5.0067901611328125e-06。\n导入时间为TT import functools def lru_size(Max_Lru)：@functools。lru_cache(maxSize=max_lru，type=false)def fib_lru(N)：if n&lt；=1：返回n，返回fib_lru(n-1)+fib_lru(n-2)为[1，2，5，10，31]：t1=TT中的i返回fib_lru。time()fib=lru_size(I)fib(10)打印(f&#34；lru大小：{i}耗时：{tt.。time()-t1}&#34；)打印(图。CACHE_INFO())#输出：#LRU大小：1所用时间：0.6930997371673584#缓存信息(命中=0，未命中=2692537，最大大小=1，当前大小=1)#LRU大小：2所用时间：0.012731075286865234#缓存信息(命中=8656，未命中=41641，最大大小=2，当前大小=2)#LRU大小：5所用时间：5.817413330078125E-05#缓存信息(命中=28。\n由此可见，fib函数的最佳缓存大小为5，增加缓存大小不会带来很大的加速比。\n在计算机科学中，确定性算法是一种算法，在给定特定输入的情况下，它将始终产生相同的输出，底层机器始终通过相同的状态序列。确定性算法是迄今为止研究最多、最熟悉的一种算法，也是最实用的算法之一，因为它们可以在真实的机器上高效地运行。", "note_en": "If we’re calling expensive functions in the program very frequently, It’s best to save the result of a function call and use it for future purposes rather than calling function every time. This will generally speed up the execution of the program.\n The expensiveness of function can be in terms of computational (CPU usage) or latency (disk read, fetching a resource from the network).\n The saving result of function calls is generally referred to as caching. The naive way to do caching is to store every function calls. But, this doesn’t scale very well with the number of parameters of function and range of each parameter.\n So, we need a smart way to do caching with a fixed amount of memory. And, there are plenty of  caching strategies available depending upon what type of information is available to us.\n Caching is heavily used in plenty of areas from low-level (hardware/CPU) to high level (network/CDNs).\n In most of the languages, We will choose caching strategies of our choice and implement them using a few data structures (hashmap, priority queue). Depending upon the language, It might take as little as few minutes to few hours to implement the generic solution of our need.\n But, Python’s standard library  functools already comes with one strategy of caching called  LRU(Least Recently Used). Thanks to  decorators in python, It only takes one line to integrate into the existing codebase\n  import  time  as  tt def  fib ( n ):  if  n  &lt;=  1 :  return  n  return  fib ( n - 1 )  +  fib ( n - 2 ) t1  =  tt . time () fib ( 30 ) print  ( f&#34;Time taken:  { tt . time ()  -  t1 } &#34; ) # Output : # Time taken: 0.3209421634674072\n  import  time  as  tt import  functools # saving all function calls @ functools . lru_cache ( maxsize = 31 ) def  fib ( n ):  if  n  &lt;=  1 :  return  n  return  fib ( n - 1 )  +  fib ( n - 2 ) t1  =  tt . time () fib ( 30 ) print  ( f&#34;Time taken:  { tt . time ()  -  t1 } &#34; ) print  ( fib . cache_info ()) # Output :# Time taken: 1.7881393432617188e-05# CacheInfo(hits=28, misses=31, maxsize=31, currsize=31)\n In this example, we have saved all function calls. But, We know that Fibonacci can be implemented using  DP.\n  import  time  as  tt def  fib_iterative ( n ):  if  n  &lt;=  1 :  return  n  f ,  s  =  0 ,  1  for  i  in  range ( n - 1 ):  t  =  f  +  s  f ,  s  =  s ,  t  return  t t1  =  tt . time () fib_iterative ( 30 ) print  ( f&#34;Time taken:  { tt . time ()  -  t1 } &#34; ) # Output:# Time taken: 5.0067901611328125e-06\n  import  time  as  tt import  functools def  lru_size ( max_lru ):  @ functools . lru_cache ( maxsize = max_lru ,  typed = False )  def  fib_lru ( n ):  if  n  &lt;=  1 :  return  n  return  fib_lru ( n - 1 )  +  fib_lru ( n - 2 )  return  fib_lru for  i  in  [ 1 ,  2 ,  5 ,  10 ,  31 ]:  t1  =  tt . time ()  fib  =  lru_size ( i )  fib ( 10 )  print  ( f&#34;LRU size:  { i }  Time taken:  { tt . time ()  -  t1 } &#34; )  print  ( fib . cache_info ()) # Output:# LRU size: 1 Time taken: 0.6930997371673584# CacheInfo(hits=0, misses=2692537, maxsize=1, currsize=1)# LRU size: 2 Time taken: 0.012731075286865234# CacheInfo(hits=8656, misses=41641, maxsize=2, currsize=2)# LRU size: 5 Time taken: 5.817413330078125e-05# CacheInfo(hits=28, misses=31, maxsize=5, currsize=5)# LRU size: 10 Time taken: 3.9577484130859375e-05# CacheInfo(hits=28, misses=31, maxsize=10, currsize=10)# LRU size: 31 Time taken: 3.504753112792969e-05# CacheInfo(hits=28, misses=31, maxsize=31, currsize=31)\n As,  we can see the optimal cache size of fib function is 5. Increasing cache size will not result in much gain in terms of speedup.\n    In computer science, a deterministic algorithm is an algorithm which, given a particular input, will always produce the same output, with the underlying machine always passing through the same sequence of states. Deterministic algorithms are by far the most studied and familiar kind of algorithm, as well as one of the most practical, since they can be run on real machines efficiently.", "posttime": "2020-06-28 22:55:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,函数调用,function,缓存", "title": "在Python中只需一行即可加快函数调用速度", "title_en": "Speeding up function calls with just one line in Python", "transed": 1, "url": "https://hackeregg.github.io/2020/06/03/Speeding-up-function-calls-with-just-one-line-in-Python.html", "via": "", "real_tags": ["python", "函数调用", "function", "缓存"]}, {"category": "", "categoryclass": "", "imagename": "3d7e2b23b918fdd12ea8f3906d9ee2fa.jpeg", "infoid": 1008732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着Godot 4.0工作的稳步推进，在主分支中添加了一种新的、新颖的创建全场景全局照明的方法。\nSDFGI代表符号距离场全局照明。这意味着该技术大量使用有符号距离场(栅格的有符号距离函数的基于欧几里得距离的表示)来创建此照明。\n虽然实现并不是最终的，而且在质量和性能方面可能会有很多改进，但现在看来它已经足够好了，可以普遍使用了。\n我要非常感谢马蒂亚斯·戈德伯格在这方面的巨大帮助，感谢我们的赞助人们的持续支持，感谢蒂姆·斯威尼和史诗游戏公司对帮助我们通过史诗巨人资助我们的研究的信心。这项新技术完全是开放开发的，并在麻省理工学院的许可下实现，因此任何人都可以在自己的引擎和游戏中使用它。\nSDGFI类似于动态实时光照贴图(但它不需要展开，也不使用纹理)。它是启用的，它通过为静态对象生成全局照明自动工作。它不需要光线跟踪，并且可以在大多数当前(以及一些年头)的专用GPU上运行，甚至在几年前的中端预算CPU上运行(SDFGI是在GeForce1060上开发和测试的，总是以60fps的速度运行)。\n灯光更改是实时的，这意味着照明条件的任何更改都将导致立即更新。仅支持从环境中接收灯光的动态对象，但它们对照明没有贡献。最终计划对此提供一定程度的支持，但不是立即。\nSDFGI还支持镜面反射，既尖锐又粗糙，所以完整的PBR场景应该只需要工作。在下图中，您可以在棋盘粗糙度纹理中看到它们：\n还支持发射照明，因此具有发射通道的材质将完全与SDFGI配合使用，从而为场景提供照明。\nSDFGI基本上是无泄漏的，不像当今最常用的VCT技术(如SVOGI/GIProbe/等)。只要对于给定的梯级，墙壁比体素还厚，光线就不会穿透。\n确保您的网格标记为静态烘焙，然后在环境设置中启用SDFGI。就是这样。\n单元格大小：显示最近级联的基本单元格大小。每个更远的级联都会复制SICE，从而允许支持全局照明的非常大的视图距离。\n遮挡：在探头之间生成遮挡信息，以避免墙中的光线泄漏。遮挡通常效果良好，但必须确保墙在渲染到的层叠上比体素厚，以避免灯光泄漏。启用时成本很小。\nY比例：用水平细节换取水平范围。这对于带有内部的场景非常有用。\nSDFGI层叠：将世界显示为SDF，可帮助您了解体素大小，因此可以调整几何体以更好地使用这些体素大小。\nSDFGI探测器：显示探测器的位置(目前仅接近级联)，帮助您了解几何图形读取光源的位置。如果某个区域的探头密度较小，则可能会得到错误的遮挡。\nGodo4.0一直在改进，我们完全致力于创造一个令人惊叹的游戏引擎，你可以像使用自己的内部技术一样自由地使用它。如果您还没有，请成为我们的赞助人，帮助我们更快地改进戈多！", "note_en": "As work progresses on Godot 4.0 at a steady pace, a new and novel method of creating full-scene global illumination has been added in the master branch.\n  SDFGI stands for Signed Distance Field Global Illumination. It means this technique makes heavy use of Signed Distance Fields (an euclidean distance based representation of the signed distance function of a grid) to create this lighting.\n  While implementation is not final, and there will probably be many improvements to quality and performance, it seem to be good enough for general use now.\n I would like to thank hugely Matias Goldberg for his enormous help on this, our  patrons for their continued support, and Tim Sweeney and Epic Games for their confidence in helping us finance our research via Epic Megagrant. This new technique was developed entirely in the open and implemented under MIT license, so anyone can take it for using in their own engines and games.\n  SDGFI is something akin to a dynamic real-time lightmap (but it does not requiere unwrapping, nor does it use textures). It&#39;s enabled and it automatically works by generating global illumination for static objects. It  does not require raytracing, and it runs in most current (and some years old) dedicated GPUs,  even medium end budget cpus from some years ago (SDFGI was developed and tested on a Geforce 1060, running always at 60fps).\n Light changes  are real-time, meaning any change in lighting conditions will result in an  immediate update. Dynamic objects are supported only for receiving light from the environment, but they don&#39;t contribute to lighting. Some degree of support is planned for this eventually, but not immediately.\n  SDFGI also supports specular reflections,  both sharp and rough, so full PBR scenes should &#34;just work&#34;. In the image below you can see both of them in checkerboard roughness texture:\n  Emissive lighting is also supported, so materials with emission channel  will fully work with SDFGI, providing lighting to the scene.\n  SDFGI is mostly leak free, unlike VCT techniques which are the most common in use today (like SVOGI/GIProbe/etc). As long as walls are thicker than a voxel for a given cascade, light won&#39;t go through.\n   Ensure your meshes are marked as &#34;Static Bake&#34;, then enable SDFGI in the Environment settings. That&#39;s it.\n  Cell size: Shows the base cell size of the nearest cascade. Each further away cascade duplicates the sice, allowing very large view distances that support global illumination.\n  Occlusion: Generates occlusion information between the probes, to avoid light leaks in walls. Occlusion generally works well, but you must ensure that walls are thicker than a voxel at the cascade they are rendering to in order to avoid light leaks. It has a small cost when enabled.\n  Y Scale: Trades horizontal detail for horizontal range. This is very useful for scenes with interiors.\n  SDFGI Cascades: Show the world as SDF, helps you understand what voxel sizes are, so you adjust your geometry to work better with those voxel sizes.\n SDFGI Probes: Shows where probes are (only near cascade for now), helps you understand where your geometry is reading lighting from. If an areas has less probe density, it may get wrong occlusion.\n       Godot 4.0 keeps improving and we are fully commited to create an amazing game engine, that you can use with the same freedom as as if it was your own in-house tech. If you are not yet, please  become our patron and help us improve Godot faster!", "posttime": "2020-06-28 22:55:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全局,based,照明", "title": "Godot 4.0获得基于SDF的实时全局照明", "title_en": "Godot 4.0 gets SDF based real-time global illumination", "transed": 1, "url": "https://godotengine.org/article/godot-40-gets-sdf-based-real-time-global-illumination", "via": "", "real_tags": ["全局", "based", "照明"]}, {"category": "", "categoryclass": "", "imagename": "7a7a402f47a1db460a426af7242403dd.png", "infoid": 1008731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新款福特F-150中最引人注目的技术升级是卡车的数字显示屏。当我们的报道在周四发布时，我们没有任何图片可以分享，但福特发来了两个短片，展示了数字主仪表组的新用户界面及其最新的Sync 4信息娱乐系统。所以我们决定现在就和您分享。您可以查看上面的图库，或者观看下面嵌入的一对视频剪辑。\nF-150并不是第一款拥有全数字仪表盘的福特；在新款野马(Mustangs)中，你可以找到12英寸的显示屏，而不是老式的表盘，电动野马Mach-E跨界车在司机面前使用了10英寸的显示屏。不过，穿着2021年F-150面朝你的12.3英寸屏幕看起来比任何一条长发都要优雅：\n其想法是它以一种非常直接的方式呈现信息，因此它的行为几乎就像一个礼宾。因此，它展示了最重要的信息，并能够在数字环境中移动东西，为其他可能更重要的内容腾出空间，福特F-150数字设计师马克·西奇(Mark Sich)表示。西奇告诉“每日邮报”，要想摆脱歪歪扭扭的用户界面，需要对福特的卡车客户进行一些测试。我们发现，只要信息以真实的、可理解的、可理解的、层次分明的方式呈现，他们就愿意真正踏上信仰的飞跃。\n就驾车者如何表示信息而言，我认为我们正迅速来到这个转折点，我们是否仍然需要建立在我们现在正在寻找的用像素表示模拟仪表的传统和遗产中？福特数字体验首席设计师彼得·鲁森伯格(Peter Ruthenberg)说，我们是否仍然需要建立在传统和传统的基础上，用像素来表示模拟仪表？福特的数字体验首席设计师彼得·鲁森伯格(Peter Ruthenberg)说，我们是否仍然需要建立在我们正在寻找的传统和遗产中，用像素来表示模拟仪表？\n我认为，对于F-150的客户来说，通过以人为本的设计过程和大量的迭代研究，我们发现这一代客户(至少F-150的客户)还没有准备好向远离实物量具的方向迈进，鲁森伯格最近在与福特的设计师交谈时说。这些类型的仪表仍然与他们产生共鸣，他们感觉到了信息的前进。但在未来产品的道路上，我们可能会希望采取更大的信心飞跃。我认为现在我们正处在模拟和数字之间的桥梁领域，这意味着什么。\n在仪表盘视频接近尾声时，您会注意到仪表盘上卡车的头像会根据您所处的驾驶模式而变化。这实际上是实时渲染的，而不是预先录制的视频，福特表示，这是司机在不同卡车模式之间切换时拥有这种级别的动态动画和过渡的唯一方式。\nF-150和今年的野马马赫-E都是福特最新的信息娱乐平台Sync 4的接受者，但这两款车看起来截然不同。Mach-E使用了一个巨大的15英寸信息娱乐屏幕，并在屏幕上使用了一个基于瓷砖的UI和一个物理慢跑轮。在F-150中，事情看起来有点传统，尽管可选的12英寸触摸屏信息娱乐系统仍然主导着这个大得多的仪表盘的中央控制台。", "note_en": "Among the most immediately noticeable technology upgrades in the  new Ford F-150 are the truck&#39;s digital displays. We didn&#39;t have any images to share when our coverage was published on Thursday, but Ford sent over a pair of short clips that show off the new UI for the digital main instrument cluster and its latest Sync 4 infotainment system. So we decided to share them with you now. You can check out the gallery above, or watch the pair of video clips embedded below.\n  The F-150 isn&#39;t the first Ford to get an all-digital dash; you can find a 12-inch display instead of old-fashioned dials in  newer Mustangs, and  the electric Mustang Mach-E crossover uses a 10-inch display in front of the driver. The 12.3-inch screen that faces you in a 2021 F-150 looks more elegant than any of those &#39;stangs, though:\n  &#34;The idea is it presents information in a very directed way so that it almost behaves like a concierge. So it&#39;s presenting the most important information and being able to move things around in a digital environment to make room for other content that&#39;s perhaps more important,&#34; said Mark Sich, F-150 digital designer at Ford. The move away from a skeuomorphic UI required some testing with Ford&#39;s truck customers, Sich told Ars. &#34;What we discovered was that, as long as the information is presented in a real, digestible, understandable, hierarchical way, they were willing to really take that leap of faith.&#34;\n &#34;In terms of just how information is represented for the driver, I think we&#39;re quickly coming to this inflection point of, &#39;Do we need to still be founded in tradition and legacy of what we&#39;re looking at in terms of representing analog gauges now with pixels?&#39;&#34; said Peter Ruthenberg, chief designer of digital experience at Ford.\n &#34;I think for the F-150 customer, through human-centered design process and a lot of iterative research here, we found that this generation at least of F-150 customers weren&#39;t ready for a big leap toward something that walks away from physical gauges,&#34; Ruthenberg said when Ars spoke with the Ford designers recently. &#34;These types of gauges still resonated with them, they felt information-forward. But potentially down the road for future products, we might want to take greater leaps of faith. I think right now we&#39;re kind of in this bridged territory between analog and digital and what that means.&#34;\n Toward the end of the dashboard video, you&#39;ll note that the truck&#39;s avatar on the dashboard changes depending upon the drive mode you&#39;re in. This is actually rendered in real-time, not prerecorded video, which Ford says is the only way to have this level of dynamic animation and transitions as a driver switches between different truck modes.\n  The F-150 and this year&#39;s Mustang Mach-E are both recipients of Ford&#39;s newest infotainment platform, Sync 4. But it looks wildly different in the two vehicles. The Mach-E uses a massive 15-inch infotainment screen and sports a tile-based UI with a physical jog wheel on the screen. In the F-150, things look a bit more conventional, although the optional 12-inch touchscreen infotainment system still dominates the center console of this much larger dashboard.", "posttime": "2020-06-28 22:35:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "福特,信息,display", "title": "这就是新款福特F-150的展示和信息娱乐的样子", "title_en": "This is what the new Ford F-150 display and infotainment looks like", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/this-is-what-the-new-ford-f-150-display-and-infotainment-looks-like/", "via": "", "real_tags": ["福特", "信息", "display"]}, {"category": "", "categoryclass": "", "imagename": "1842715492a62e3f885ad6d1693190e2.jpg", "infoid": 1008729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年，在其230年的历史上，美国人口普查将首次使用不同的隐私，以便在数据公开时对公民的回答保密。但是它是如何工作的呢？\n差别隐私使用数学噪声来保护个人的隐私和机密性，同时允许观察总体统计数据。这一概念是对机器学习的自然扩展，在机器学习中，我们可以保护模型免受隐私攻击，同时保持总体准确性。\n例如，如果你想知道我的年龄(32岁)，我可以从帽子中随机选择一个数字，比如说±7-你只会知道我的年龄可能在25到39岁之间。为了保护我的年龄，我在数据中增加了一点噪音，美国人口普查局也会做类似的事情。\n虽然美国政府构建了自己的差异隐私工具，但IBM一直在开发自己的开源版本，今天我们将发布最新版本v0.3。IBM Differential Privacy Library拥有一套用于机器学习和数据分析任务的工具，所有这些工具都具有内置的隐私保障。\n我们的库让科学家和开发人员能够在熟悉的环境中访问轻量级、用户友好的数据分析和机器学习工具，这一点与其他库相比是独一无二的-事实上，大多数任务只需一行代码即可运行。\n使我们的图书馆与众不同的还有我们的机器学习功能，它使组织能够以前所未有的方式严格保证用户隐私，发布和共享他们的数据。\n随着v0.3的技术细节，图书馆现在配备了一名预算会计，以跟踪不同操作的隐私预算支出。使用先进的组合技术，预算会计允许用户提取比更简单的会计方法更多的洞察力，虽然很难量化，但在典型的工作负载下，隐私预算节省超过50%的情况并不少见。\n我们的图书馆包括一系列功能，可以从数据中提取洞察力和知识，并提供强大的隐私保证。我们专注于为最流行的算法开发解决方案，包括直方图、逻辑回归、k-均值聚类和主成分分析(PCA)，并为开发人员提供差异隐私的基本构件，使他们能够开发自己的自定义解决方案。\n该库包括当前可用的类似库中不存在的以下关键组件：\n机制：全面收集差异隐私的基本构件，用于构建新的工具和应用程序；\n还包括一组用于数据探索和分析的基本工具。该库入门的所有细节都可以在IBM的Github库中找到。\nDiffPrilib：The IBM DiffPrivacy Library，Naoise Holohan，Stefano Braghin，Pól Mac Aonghura，Killian Levacher。\n众所周知，人体主要是由水组成的：例如，大脑有75%是水，甚至骨头也不是“干的”--含有多达三分之一的水。所有这些水都维持着生物细胞的形状和结构，并参与了许多生化过程。IT[…]。\n通常，当我第一次开始向某人解释完全同态加密(FHE)时，我一开始就会说，我在这个领域已经工作了近十年，但我仍然必须停顿一下才能正确拼写它。那么，我们就叫它fhe吧。半开玩笑不说，当你[…]。\n我们在苏黎世的IBM欧洲研究所的团队和以色列Technion的合作者共同进行的研究，导致了一种从小体积样本中分离颗粒和分子的新方法。这项技术利用了扩散率的差异-扩散率是一种与大小密切相关的分子特性。我们目前正在将该方法应用于快速[…]", "note_en": "This year for the first time in its 230-year history the  US Census will use differential privacy to keep the responses of its citizens confidential when the data is made available. But how does it work?\n Differential privacy uses mathematical noise to preserve individuals’ privacy and confidentiality while allowing population statistics to be observed. This concept has a natural extension to machine learning, where we can protect models against privacy attacks, while maintaining overall accuracy.\n  For example, if you want to know my age (32) I can pick a random number out of a hat, say ±7 – you will only learn that I could be between 25 and 39. I’ve added a little bit of noise to the data to protect my age and the US Census will do something similar.\n While the US government built its own differential privacy tool, IBM has been working on its own open source version and today we are publishing our  latest release v0.3. The IBM Differential Privacy Library boasts a suite of tools for machine learning and data analytics tasks, all with built-in privacy guarantees.\n Our library is unique to others in giving scientists and developers access to lightweight, user-friendly tools for data analytics and machine learning in a familiar environment – in fact, most tasks can be run with only a single line of code.\n What also sets our library apart is our machine learning functionality enables organisations to publish and share their data with rigorous guarantees on user privacy like never before.\n Technical details With v0.3, the library now comes with a budget accountant to track privacy budget spend across different operations. Using advanced composition techniques, the budget accountant allows users to extract even more insight than simpler accounting methods and while it’s hard to quantify, under typical workloads, privacy budget savings in excess of 50 percent are not uncommon.\n Our library includes an array of functionality to extract insight and knowledge from data with robust privacy guarantees. We have focused on developing solutions for the most popular algorithms, including histograms, logistic regression, k-means clustering and principal component analysis (PCA), as well as giving developers the basic building blocks of differential privacy to allow them to develop their own custom solutions.\n The library includes the following key components which don’t exist in similar libraries currently available:\n Mechanisms: A comprehensive collection of the basic building blocks of differential privacy, used to build new tools and applications;\n Also included is a collection of fundamental tools for data exploration and analytics. All the details for getting started with the library can be found at  IBM’s Github repository.\n  Diffprivlib: The IBM Differential Privacy Library,  Naoise Holohan, Stefano Braghin, Pól Mac Aonghusa, Killian Levacher\n  It is well known that the human body is mostly composed of water: The brain, for example, is 75 percent water and even bones are not “dry” – containing as much as one third water. All of this water maintains the shape and structure of biological cells and is involved in numerous biochemical processes. It […]\n   Often, when I begin explaining fully homomorphic encryption (FHE) to someone for the first time I start by saying that I’ve been working in the field for nearly a decade and yet, I still have to pause to spell it right. So, let’s call it FHE. Half-kidding aside, FHE really sounds like magic when you […]\n   Joint research by our group at IBM Research Europe in Zurich and collaborators at Technion, Israel, has led to a new method for separation of particles and molecules from small volume samples. The technique exploits differences in diffusivity – a molecular property which correlates well with size. We are currently adapting the method for rapid […]", "posttime": "2020-06-28 22:34:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "代码,保密,differential,ibm", "title": "IBM新的差分保密库只需一行代码即可工作", "title_en": "IBM's New Differential Privacy Library Works With Just a Single Line of Code", "transed": 1, "url": "https://www.ibm.com/blogs/research/2020/06/ibm-differential-privacy-library-the-single-line-of-code-that-can-protect-your-data/", "via": "", "real_tags": ["代码", "保密", "ibm"]}, {"category": "", "categoryclass": "", "imagename": "fef8938da226ca439843a0859084ecbc.png", "infoid": 1008727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "注：巴西的六个城市分别是圣保罗、里约热内卢、福塔莱萨、马瑙斯、累西腓和贝伦。\n对28个国家的死亡数据的回顾显示，在冠状病毒大流行中死亡的人数比官方发布的新冠肺炎死亡人数报告至少多出12万人-这为危机的死亡人数提供了一个更清晰的图景，尽管还不完整。\n“纽约时报”发现，在过去的两个月里，这些国家中的大多数国家的死亡人数比前几年要多得多。总数包括新冠肺炎和其他原因的死亡人数，可能包括那些由于医院人满为患而无法接受治疗的人。\n注：超额死亡为估计数，包括新冠肺炎等死因。新冠肺炎报告的死亡人数反映了所有原因死亡数据可用期间的官方冠状病毒死亡人数，包括后来修订的数字。据报道，伊斯坦布尔的新冠肺炎死亡人数是基于政府的声明，即该国60%的病例发生在该市。\n这些数字削弱了这样一种观点，即许多死于病毒的人可能很快就会死亡。在英国，新冠肺炎的死亡人数仅次于美国和巴西，是世界上死亡人数最多的国家。自3月中旬以来，英国的死亡人数比往常多6.31万人，比官方死亡统计数据多出约1.3万人。\n注：最近的数据是暂时性的，随着更多死亡人数的统计，可能会增加。资料来源：国家统计局；苏格兰国家记录；北爱尔兰统计和研究机构。\n大流行期间的死亡数据并不完美。在大多数地方，官方死亡人数和总死亡人数上升之间的差距反映了对病毒的有限检测，而不是故意低估。截至周二，全球已有约47.6万人死于冠状病毒。\n但研究人员说，总的死亡数字提供了这次大流行的更完整的写照，特别是因为大多数国家只报告了发生在医院的新冠肺炎死亡事件。\n德国马克斯·普朗克人口研究所的人口学家蒂姆·里夫(Tim Riffe)说，“无论某一天报道的数字是多少，都会被严重低估。”“在许多地方，大流行已经持续了足够长的时间，以至于有足够的时间来进行晚期死亡登记，这让我们对死亡的真实情况有了更准确的了解。”\n这种差异在那些迟迟没有认识到问题范围的国家尤为明显。从3月到5月，印尼政府将雅加达的520人死于冠状病毒。但根据雅加达公园和公墓部门的数据，在这几个月里，雅加达公墓埋葬的人数比正常多4200人。\n与过去三年同期相比，厄瓜多尔记录的死亡人数比往常多了约10,500人-大约是该国同期报告的新冠肺炎死亡人数的三倍。在墨西哥城，从3月30日到6月7日，记录的死亡人数超过了1.7万人。\n注：第1周、第52周和第53周的数据不包括在内，因为它们可能代表部分周；2020年第1周至第10周的数据没有收集到墨西哥城；墨西哥城2016-2018年的死亡统计是基于美国国家统计、地理和信息学研究所(INEGI)发布的死亡数据。ITTS 2019-2020年数据基于通过民事登记局获得的死亡证明记录。\n这些估计是通过将今年的总死亡人数与考虑到当地死亡趋势的预期死亡人数进行比较得出的，并根据时间的变化进行了调整。“经济学人”也在以类似的方式跟踪这些被称为超额死亡的死亡事件。\n人口学家说，死亡数据发布得如此之快是不寻常的，但由于冠状病毒爆发的紧迫性，许多国家都在努力提供更全面、更及时的信息。数据是有限的，如果说有什么不同的话，那就是多出来的死亡人数被低估了，因为并不是所有的死亡人数都被报告了。\n联合国人口学家帕特里克·格兰德(Patrick Gerland)说，“在这个阶段，这只是一个部分快照。”“这是对问题的一种看法，反映了形势最尖锐的一面，主要是通过以医院为基础的系统。”\n“在接下来的几个月里，”格兰德说，“一幅更清晰的图景将成为可能。”\n根据欧洲死亡率监测项目(European Mortality Monitoring Project)发布的数据，尽管有早期的数据，但许多欧洲国家都报告了明显偏离正常死亡模式的情况。欧洲死亡率监测项目是一个研究机构，收集了24个欧洲国家的每周死亡数据。\n在意大利，3月和4月的死亡人数比过去五年这两个月的平均水平高出约40%，比正常水平高出约4.26万人。\n注：第1、52和53周的数据不包括在内，因为它们可能代表部分周。\n在比利时和法国等一些国家，当局正在努力将新冠肺炎在医院外的死亡情况纳入他们的日常报告，或者一旦在养老院或养老院等地方确认死亡，就调整新冠肺炎的总体死亡总数。\n其他机构，如英国国家统计局，已经开始在死亡证明处理后公布死亡数据，证实了那些提到新冠肺炎的人。这比英国公共卫生每天发布的医院数据提供了一个更准确的死亡率统计，如果延迟的话。\n在少数几个国家，今年的死亡率没有明显上升的迹象。造成这种情况的原因是多种多样的，随着各国对死亡进行处理和认证，原因将在未来几个月变得更加清楚。\n在挪威、丹麦和芬兰，人口学家表示，死亡率较低的部分原因是今年冬天的流感季节不那么严重-但也是因为这些国家在疫情规模较小、更容易控制的情况下，提前实施了严格的限制措施，以减缓病毒的传播。\n以色列的冠状病毒暴发规模相对较小，控制较好，新冠肺炎死亡人数只有245人。然而，初步的死亡率数据只能在3月份获得，4月份的数据可能会有所不同。\n根据南非医学研究理事会(South African Medical Research Council)的数据，在南非，由于交通事故和凶杀等非自然原因导致的死亡人数下降，每周的死亡人数低于正常水平。此外，该国疫情的爆发还很可能还为时过早，死亡人数要大幅上升还为时过早。\n注：第1、52和53周的数据不包括在内，因为它们可能代表部分周。\n死亡数据中的年龄细分将为新冠肺炎在超额死亡中所起的作用提供更清晰的图景。例如，在瑞典，80岁及以上男性的高死亡率是死亡人数增长最多的原因，这表明总体数字低估了疫情对老年人的严重程度。\n即使考虑到新的数字，专家们表示，到目前为止的死亡人数可能要糟糕得多。\n马克斯·普朗克人口研究所的人口学家弗拉基米尔·什科尔尼科夫(Vladimir Shkolnikov)说：“今天全因死亡率的上升是在采取非常措施的情况下发生的，比如社会距离、封锁、关闭边境和增加医疗保健，至少其中一些措施产生了积极影响。”“如果没有这些措施，目前的死亡人数很可能会更高。”\n在GitHub上阅读更多关于该方法的信息，并从“纽约时报”下载超额死亡率数据。\n为了估计预期死亡人数，我们对每个国家从2015年到2020年1月报告的死亡人数拟合了一个线性模型。该模型有两个组成部分-线性时间趋势和平滑样条，前者用于解释人口结构的变化，后者用于解释季节性变化。对于仅限于月度数据的国家/地区，该模型将月份作为固定效果，而不是使用平滑样条。\n一些国家可获得的历史数据较少。对于有三年或更少数据的国家，该模型使用观察年份的简单平均死亡人数。对于英国，该模型考虑了给定一周的银行假期数量，因为在银行假期期间没有登记死亡人数。\n穆克蒂塔·苏哈托诺(Muktita Suhartono)从曼谷、卡洛塔·加尔(Carlotta Gall)从伊斯坦布尔、阿纳托利·库尔马纳耶夫(Anatoly Kurmanaev)从委内瑞拉加拉加斯、莫妮卡·普隆祖克(Monika Pronczuk)从布鲁塞尔、何塞·玛丽亚·莱昂·卡布雷拉(JoséMaría León Cabrera)从厄瓜多尔基多、伊里特·帕兹纳(Irit Pazner)从耶路撒冷、约翰·巴特利特(John Bartlett)从圣地亚哥、米雷利斯·莫拉莱斯(Mirelis Morales)从利马、曼努埃拉·安德烈奥尼(Manuela。关于数据：从每个国家获得的全原因死亡数据各不相同：一些国家公布了几十年前的每日死亡总数，另一些国家只公布了最近几年的死亡总数。历史数据较少的地方，如伊斯坦布尔，更容易进行历史比较。用于计算额外死亡人数的历史基线没有根据2014年至2015年和2017年至18年冬季欧洲非新冠肺炎原因造成的死亡人数或两次致命流感疫情的预期减少进行调整。意大利的数据包括占人口94%的城镇。美国的数据占总人口的86%。\n资料来源：Stephane Helleringer，约翰霍普金斯大学；Tim Riffe，马克斯普朗克人口研究所；Lasse Skafte Vestergaard，EuroMOMO；Vladimir Shkolnikov，马克斯普朗克人口研究所；Tom Moultrie，开普敦大学；Isaac Sasson，特拉维夫大学；Patrick Gerland，联合国；S V Subramanian，哈佛大学；Paulo Lotufo，圣保罗大学；Marcelo。Leroy Mathias，Dupont Yves，Bossuyt Nathalie，Bustos Sierra Natalia。比利时埃皮萨特，死亡率监测，科学萨诺(比利时)；荷兰统计局；挪威统计局；丹麦统计局；瑞典统计局；公共卫生当局(瑞典)；国家统计局(英格兰和威尔士)；苏格兰国家记录；北爱尔兰统计和研究机构；疾病控制和预防中心；纽约市卫生和精神卫生部(纽约市)；民事登记总局(厄瓜多尔)；国家统计研究所(厄瓜多尔)；联邦统计局(德国)；意大利国家统计研究所；南非医学研究。民事和巴西登记处(巴西)；秘鲁死亡率信息系统(Sinadef)；秘鲁卫生部；民事登记和身份查验处(智利)；总务局统计司(日本东京)；通过民事登记处总局收集的死亡证明记录，由Mario Romero Zavala和Laurianne Despeghel(墨西哥城)收集；国家统计、地理和信息学研究所(INEGI)；韩国统计局。\n更正：本文较早版本的图表错误陈述了法国4月第一周的历史平均死亡人数。自那以后，添加了更完整的历史数据。一周的平均人数约为11,000人，而不是9,400人。", "note_en": "Note: The six cities in Brazil are São Paulo, Rio de Janeiro, Fortaleza, Manaus, Recife and Belém.\n At least 120,000 more people have died during the coronavirus pandemic than the official Covid-19 death counts report, a review of mortality data in 28 countries shows — providing a clearer, if still incomplete, picture of the toll of the crisis.\n Over the last two months, far more people have died in most of these countries than in previous years, The New York Times found. The totals include deaths from Covid-19 as well as those from other causes, likely including people who  could not be treated as hospitals became overwhelmed.\n Note: Excess deaths are estimates that include deaths from Covid-19 and other causes. Reported Covid-19 deaths reflect official coronavirus deaths during the period when all-cause mortality data is available, including figures that were later revised. Reported Covid-19 deaths in Istanbul are estimated based on the government’s statement that 60 percent of the country’s cases are in the city.\n These numbers undermine the notion that many people who have died from the virus may soon have died anyway. In Britain, which has recorded more Covid-19 deaths than any country except the United States and Brazil, 63,100 more people than usual have died since mid-March — and about 13,000 more than have been captured by official death statistics.\n Note: Recent data is provisional and may increase as more deaths are counted. Sources: Office for National Statistics; National Records of Scotland; Northern Ireland Statistics and Research Agency.\n Mortality data in the middle of a pandemic is not perfect. In most places, the disparities between the official death counts and the total rise in deaths reflect limited testing for the virus rather than intentional undercounting. Officially, about  476,000 people  had died worldwide of the coronavirus as of Tuesday.\n But the total death numbers offer a more complete portrait of the pandemic, researchers say, especially because most countries report only those Covid-19 deaths that occur in hospitals.\n “Whatever number is reported on a given day is going to be a gross underestimate,” said Tim Riffe, a demographer at the Max Planck Institute for Demographic Research in Germany. “In a lot of places the pandemic has been going on for long enough that there has been sufficient time for late death registrations to come in, giving us a more accurate picture of what the mortality really was.”\n The differences are particularly stark in countries that have been slow to acknowledge the scope of the problem. From March through May, the Indonesian government attributed 520 deaths to the coronavirus in Jakarta. But over 4,200 people more than normal were buried in Jakarta cemeteries during those months, according to data from the city’s Department of Parks and Cemeteries.\n Ecuador recorded about 10,500 more deaths than usual compared to the same period in the last three years — about three times higher than the  reported number of Covid-19 deaths in the country during that time. And in Mexico City, more than 17,000 excess deaths were recorded from March 30 through June 7.\n Notes: Data from weeks 1, 52 and 53 are excluded, as they may represent partial weeks; Data from weeks 1 to 10 in 2020 was not collected for Mexico City; Mexico City’s 2016-2018 death counts are based on mortality data released by the National Institute of Statistics, Geography and Informatics (INEGI). Itts 2019-2020 data is based on death certificate records obtained via the General Directorate of the Civil Registry.\n These estimates were made for each country by comparing the total number of people who died this year to the number of deaths that would be expected given local mortality trends, adjusted to account for changes over time. The Economist is also  tracking these deaths, known as excess deaths, in a similar way.\n It is unusual for mortality data to be released so quickly, demographers say, but many countries are working to provide more comprehensive and timely information because of the urgency of the coronavirus outbreak. The data is limited and, if anything, excess deaths are underestimated because not all deaths have been reported.\n “At this stage, it’s a partial snapshot,” said Patrick Gerland, a demographer at the United Nations. “It’s one view of the problem that reflects that most acute side of the situation, primarily through the hospital-based system.”\n  “In the next couple of months,” Mr. Gerland said, “a much clearer picture will be possible.”\n  Despite the early data, many European countries have reported clear deviations from normal patterns of deaths, according to data released by the  European Mortality Monitoring Project, a research group that collects weekly mortality data from 24 European countries.\n In Italy, about 40 percent more people died in March and April than the average for those months in the last five years, about 42,600 deaths more than normal.\n Notes: Data from weeks 1, 52 and 53 are excluded, as they may represent partial weeks.\n In some countries, like Belgium and France, authorities are working to include Covid-19 deaths outside of hospitals in their daily reports, or adjusting the overall Covid-19 death totals once a death is confirmed in a place like a nursing or retirement home.\n Others, like Britain’s  Office for National Statistics, have started to release mortality data after death certificates have been processed, confirming those that mention Covid-19. This provides a more accurate, if delayed, account of mortality than the hospital figures released each day by  Public Health England.\n  In a handful of countries there has been no clear sign of increased mortality this year. The reasons for this are varied and will become more clear in the months ahead as countries process and certify deaths.\n In Norway, Denmark and Finland, demographers say the low mortality is due in part to a less severe flu season this winter — but also because these countries implemented early, severe restrictions to slow the spread of the virus when their outbreaks were smaller and easier to contain.\n Israel’s coronavirus outbreak has been comparatively small and well-contained, with only 245 Covid-19 deaths recorded.  Preliminary mortality data is only available through March, however, and could look different in April.\n And in South Africa, weekly deaths are lower than normal due to a drop in deaths from non-natural causes like traffic accidents and homicides, according to the  South African Medical Research Council. It is also likely that it is still too early in the country’s outbreak to pick up a notable spike in deaths.\n Notes: Data from weeks 1, 52 and 53 are excluded, as they may represent partial weeks.\n Age breakdowns in mortality data will provide an even clearer picture of the role of Covid-19 in excess deaths. In Sweden, for example, a high mortality rate among men aged 80 and older  accounted for the largest increase in deaths, suggesting that the overall numbers understate the severity of the outbreak for older people in particular.\n Even taking into account the new numbers, experts say the death toll to date could have been much worse.\n “Today’s rise in all-cause mortality takes place under conditions of extraordinary measures, such as social distancing, lockdowns, closed borders and increased medical care, at least some which have positive impacts,” said Vladimir Shkolnikov, a demographer at the Max Planck Institute for Demographic Research. “It is likely that without these measures, the current death toll would be even higher.”\n Read more about the methodology and  download data for excess mortality from The New York Times on GitHub.\n To estimate expected deaths, we fit a linear model to reported deaths in each country from 2015 to January 2020. The model has two components — a linear time trend to account for demographic changes and a smoothing spline to account for seasonal variation. For countries limited to monthly data, the model includes month as a fixed effect rather than using a smoothing spline.\n Some countries have less historical data available. For countries with three or fewer years of data, the model uses a simple average of deaths in the observed years. For the United Kingdom, the model accounts for the number of bank holidays in a given week, since deaths are not registered during bank holidays.\n Muktita Suhartono contributed reporting from Bangkok, Carlotta Gall from Istanbul, Anatoly Kurmanaev from Caracas, Venezuela, Monika Pronczuk from Brussels, José María León Cabrera from Quito, Ecuador, Irit Pazner from Jerusalem, John Bartlett from Santiago, Mirelis Morales from Lima, Manuela Andreoni from Rio de Janeiro and Choe Sang-hun from Seoul. About the data: The all-cause mortality data obtained from each country varies: Some countries publish daily death totals dating back decades, and others only for the last few years. Places with less historical data, such as Istanbul, make for rougher historical comparisons. Historical baselines used to calculate excess deaths do not adjust for any expected reduction in recent deaths from non-Covid-19 causes or for two deadly flu epidemics in Europe during the winters of 2014-15 and 2017-18. The data in Italy includes towns accounting for 94 percent of the population. The data in the U.S. accounts for 86 percent of the population.\n Sources: Stephane Helleringer, Johns Hopkins University; Tim Riffe, Max Planck Institute for Demographic Research; Lasse Skafte Vestergaard, EuroMOMO; Vladimir Shkolnikov, Max Planck Institute for Demographic Research; Tom Moultrie, University of Cape Town; Isaac Sasson, Tel Aviv University; Patrick Gerland, United Nations; S V Subramanian, Harvard University; Paulo Lotufo, University of São Paulo; Marcelo Oliveira; Patama Vapattanawong, Mahidol University; Ryohei Mogi, Autonomous University of Barcelona; Fumiya Uchikoshi, Princeton University; Istanbul Metropolitan Municipality; Jakarta Department of Parks and Cemeteries; Daily Mortality Surveillance System (Spain); National Institute of Statistics and Economic Studies (France); Federal Statistical Office (Switzerland); Leroy Mathias, Dupont Yves, Bossuyt Nathalie, Bustos Sierra Natalia. Epistat, Belgium Mortality Monitoring, Sciensano (Belgium); Statistics Netherlands; Statistics Norway; Statistics Denmark; Statistics Sweden; Public Health Authority (Sweden); Office for National Statistics (England &amp; Wales); National Records of Scotland; Northern Ireland Statistics and Research Agency; Centers for Disease Control and Prevention; NYC Department of Health and Mental Hygiene (New York City); General Direction of Civil Registry (Ecuador); National Institute of Statistics (Ecuador); Federal Statistical Office (Germany); Italian National Institute of Statistics; South African Medical Research Council; Population and Immigration Authority, Central Bureau of Statistics (Israel); Moscow City Government; Registro Civil and Brasil.io (Brazil); Peru&#39;s Mortality Information System (Sinadef); The Ministry of Health of Peru; The Civil Registry and Identification Service (Chile); Statistics Division, Bureau of General Affairs (Tokyo, Japan); Death certificate records via General Directorate of the Civil Registry, collected by  Mario Romero Zavala and  Laurianne Despeghel (Mexico City); National Institute of Statistics, Geography and Informatics (INEGI); Statistics Korea\n Correction: An earlier version of a chart with this article misstated the average historical number of deaths in France during the first week of April. More complete historical data has since been added. The average for the week was about 11,000, not 9,400.", "posttime": "2020-06-28 22:32:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人数,covid,死亡", "title": "几个国家的总死亡人数(Covid和非Covid)", "title_en": "Total Deaths (Covid and non-Covid) across several countries", "transed": 1, "url": "https://www.nytimes.com/interactive/2020/04/21/world/coronavirus-missing-deaths.html", "via": "", "real_tags": ["人数", "covid", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "f795d8c4b913f8f5adaadb5834c0a61c.jpg", "infoid": 1008726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "阻碍电子垃圾回收的一个因素是实际的回收过程本身。我们需要更便宜、更安全、更清洁或更有效的方法从电子产品中分离和回收有价值的元素，然后才能使整个努力更具吸引力和更有利可图。目前的一些方法使用大量的能量来熔化组分，但化学可以提供一些诱人的替代方案。\n韩国高级科学技术研究所的洪永然领导的一项新研究涉及一种对黄金有着令人印象深刻的亲和力的化学物质。对一些电路板进行酸处理以释放其材料，这些材料将聚集所有溶解的金。在它释放了黄金之后，它就可以再次使用了。\n研究人员的洗金器是基于一种叫做卟啉的有机化合物。在聚合物中连接在一起，它拥有大量的小孔，这些小孔在能量上想要容纳一个金属原子。这就是化学家寻找的帮助回收的那种结构。\n研究人员将他们的聚合物进行了一系列不同的测试，以找出它在哪些金属上效果最好，以及它可以捕获多少金属。它对少量贵金属最有效，尤其是黄金。事实上，与聚合物中的孔隙数量相比，他们发现它捕获的金原子大约是原来的10倍。对于其他元素，如铂，每个气孔只容纳一个原子(我们可以说，这是造成原子社会距离的主要原因)。但是，金原子似乎在每个毛孔上组成了一个派对。\n这一行为得到了测量的验证，并通过一些建模得到了解释。研究人员发现，聚合物会在紫外光的帮助下与金原子相互作用，并给它一些电子，这恰好使更多的金原子有可能加入到一团中。果然，用不同数量的紫外光重复测试产生了影响，尽管即使没有紫外光，捕捉能力仍然相当高。\n最后，对聚合物进行了相当真实的测试。研究人员从垃圾场拿出7块电路板，放入酸浴中浸出金属。然后他们混合他们的聚合物，调整溶液，让它搅拌几天。(尽管其他测试显示99%的黄金可以在大约30分钟内被清除。)。过滤分离出聚合物和它运来的黄金。再次加入酸会导致聚合物释放金，金沉淀成固体金块，占从电路板上浸出的黄金的94%。\n考虑到结果，这项技术的经济理由似乎很容易提出。研究人员说，这种聚合物的生产成本约为每克5美元，而这克可以捕获64美元的黄金。由于聚合物可以重复使用，随着时间的推移，它将比它便宜得多，几乎不会增加回收操作的总成本。\n“尽管(印刷电路板)含有比矿山矿石更多的贵金属，”研究小组写道，“但80%的废物仍然被送往垃圾填埋场，主要是因为缺乏选择性的、高产量的、非氰化物回收程序。”随着类似的工艺被发现更容易收获其他元素，所有这些浪费看起来都将越来越像是经济机会-并通过将旧设备变成新设备而不是垃圾来帮助闭合循环。", "note_en": "One thing holding back e-waste recycling is the actual recycling process itself. We need cheaper, safer, cleaner, or more effective methods of separating and recovering the valuable elements from electronics before we can make the whole endeavor more attractive and profitable. Some current methods use large amounts of energy to melt components down, but chemistry could provide some tempting alternatives.\n A new study led by Yeongran Hong of the Korea Advanced Institute of Science and Technology involves a chemical with an impressive affinity for gold. Subject some circuit boards to an acid treatment to release its materials and this stuff will gather up all the dissolved gold. And after it lets go of that gold, it’s ready to be used again.\n The researchers’ gold-scrubber is based on an organic compound called a  porphyrin. Linked together in a polymer, it possesses lots and lots of little pores that, energetically, want to host a metal atom. That’s the kind of structure chemists look for to help with recycling.\n The researchers put their polymer through a number of different tests to work out which metals it worked best on and how much it could capture. It’s most effective with a small number of precious metals, most notably gold. In fact, compared to the number of pores in the polymer, they found it was capturing about 10 times as many gold atoms. For other elements like platinum, each pore only hosts one atom (responsible atomic social distancing, shall we say). But gold atoms seemed to make a party at each pore.\n  That behavior was verified by measurements and explained by some modeling. The researchers found that the polymer would interact with the gold atom—aided by ultraviolet light—and hand it some electrons, which happens to make it possible for more gold atoms to join in a clump. Sure enough, repeating the test with varying amounts of ultraviolet light had an impact, although capture was still quite high even without it.\n Finally, the polymer was put through a pretty authentic test. The researchers took seven circuit boards from a junkyard and put them in an acid bath to leach out the metals. Then they mixed in their polymer, adjusted the solution, and kept it stirring for a couple days. (Although other tests showed that 99 percent of gold can be scavenged in about 30 minutes.) Filtering separated out the polymer and its haul of gold. Adding acid again causes the polymer to let go of the gold, which precipitated as a solid nugget that accounted for 94 percent of the gold leached from the circuit boards.\n Given the results, the economic case for this technique seems easy to make. The researchers say the polymer costs about $5 per gram to produce, and that gram can capture $64 in gold. And since the polymer can be reused, it would be considerably cheaper than that over time, adding little to the overall cost of a recycling operation.\n “Although [printed circuit boards] contain more precious metals than the ores in mines,” the team writes, “80 percent of this waste still goes to landfills chiefly because of the lack of selective, high-yield, noncyanide recovery procedures.” As similar processes are found to more easily harvest other elements, all that waste is going to increasingly look like economic opportunity—and help close the loop by turning old devices into new ones instead of trash.", "posttime": "2020-06-28 22:13:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电子,easily,聚合物", "title": "新型聚合物可轻松捕获从电子垃圾中提取的黄金", "title_en": "New polymer easily captures gold extracted from e-waste", "transed": 1, "url": "https://arstechnica.com/science/2020/06/new-polymer-easily-captures-gold-extracted-from-e-waste/", "via": "", "real_tags": ["电子", "easily", "聚合物"]}, {"category": "", "categoryclass": "", "imagename": "797c47e1c7e689d2bc420f61b8b8ff11.jpg", "infoid": 1008725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部设在慕尼黑的Wirecard，成立于1999年，旨在帮助网站从托管机构收取信用卡付款。", "note_en": "  Munich-based Wirecard, founded in 1999, was established with the intention of assisting websites with credit card payment collections from custo...", "posttime": "2020-06-28 22:10:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "挽救,salvageable,设在", "title": "分析师称，Wirecard“超越了可挽救的范围”", "title_en": "Wirecard is 'beyond salvageable,' according to analyst", "transed": 1, "url": "https://www.businessinsider.com/wirecard-is-beyond-salvagable-analyst-says-and-rivals-may-benefit-2020-6", "via": "", "real_tags": ["挽救", "设在"]}, {"category": "", "categoryclass": "", "imagename": "d7bd7adbcc3c27631c573415fbcd0922.jpg", "infoid": 1008724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当尘土散去时，傀儡四分五裂地躺在地牢地板上。埃里克深深地叹了口气，虽然他的视线模糊了，但他仍然能看到派对上的其他人向他伸出援手。最先欢迎他加入团队的骑士埃梅琳娜(Emmelina)在他最后一口气时把他抱在怀里。我们的团队走了这么远，结果却失去了最年轻的成员。在五个不同的州，我们的团队没有一个人干眼，但我们重新振作起来，继续通过我们已经使用了五年的服务：Roll20来玩桌面冒险。\n也许，像我一样，你年轻的时候和当地的朋友一起进行过有趣的冒险，或者，也许你现在对角色扮演感兴趣，但由于大流行，你知道的，实际上无法与任何人见面。如果是这样的话，Roll20解决了你和你的伙伴一起挖掘地牢之间的最大障碍。而且它这样做并不会使事情变得过于复杂。如果你可以上网，你就可以运行虚拟桌面游戏“地下城与龙”，或者其他任何游戏，这都要归功于Roll20。\nRoll20是一个由相对较小的Orr集团公司提供的数字平台。它于2012年推出，允许人们创建、分享和参与桌面活动。有各种升级版本可供购买，但基本服务将让任何人都可以轻松完成上述所有工作，无需太多麻烦或大惊小怪。在所有让Roll20试一试的理由中，最大的可能是最简单的：它是免费的。\n从一开始，Roll20可以让你创建活动，使用各种不同的地图，可以切换为活动或非活动，以令牌的形式放置数字微型模型，然后可以在这些地图上移动，等等。想在玩的同时做视频和语音吗？这是内置的。基本的文本聊天还允许掷骰子，作为特定的字符发送消息，以及只是，嗯，闲聊。免费版甚至还内置了自动唱片点唱机功能，让你可以用一小段音乐来设定心情。\n在Roll20中也有一些高级选项，范围从有用到非常有用：动态照明和高级令牌。但是所有的核心功能从一开始就在那里，如果你不需要额外的功能，就没有理由升级。这是一个很好的设置，真的，因为你可以在不需要支付任何费用的情况下运行完整的活动，但所有的额外服务都是有帮助的。不同的订阅级别(Plus每年49.99美元，Pro每年99.99美元)增加了更多的存储空间，前面提到的动态照明，定制角色表，等等。我过去订阅过，将来可能还会订阅，但对于刚开始订阅的人来说，SUB很可能只会增加更多的东西来摆弄。毕竟，没有必要从一开始就提高学习曲线。\n除了订阅级别，Roll20还直销数字模块和手册，以播放多种不同的RPG系统。如果你是那种真的想让人们“惊叹”，但又没有时间从头开始构建一切的人，你可以只挑选一些预先构建的冒险项目，然后运行它们，而不需要太多的调整。在我看来，没有什么能完全取代手头的纸质书，但也有一些东西可以说，只需点击几下就可以访问这些书中的任何东西，而且你不能完全以同样的方式将一本纸质书倾倒到虚拟桌面系统中。\n甚至在新冠肺炎的回应关闭一切之前，虚拟桌面就是一种跨越不同空间与人们联系的方式-而且现在也是如此。现在恰好有时间、有距离的人更多，使这类服务更具吸引力。我自己去Roll20的旅程似乎很常见：在我高中时期的地下城与龙乐队搬去上大学，然后去全国各地工作之后，Roll20让我们再次在同一个空间玩耍，即使那是一个数字空间。\n自从2012年末加入Roll20以来，我已经在这个平台上记录了近500个小时-其中绝大多数是把朋友和以前的熟人聚集在一起，而不是随机的陌生人。并不是说随机分组没有任何问题，Roll20甚至可以方便地将自己添加到玩家目录中，通过系统指示您希望加入的游戏类型。或者，如果你喜欢冒险，你可以浏览论坛，玩家在那里寻找要加入的游戏，运行游戏的人在哪里寻找玩家。\n多年来，我尝试过其他虚拟桌面平台，但由于其相对易用性和广泛的访问性，我似乎总是会重新使用Roll20。其他流行的选择包括Fantasy Ground或D20PRO，但根据我的经验，这两种都比Roll20要麻烦得多。在Roll20中，从注册到加入游戏再到玩游戏的过程相当简单，对于玩家来说，这在很大程度上是无缝的。实际运行游戏的人有许多不同的选择，包括他们想要运行的游戏的详细程度，但玩家在很大程度上只需要点击几个链接，就可以在指定的时间出现。\n在过去的五年左右的时间里，这对我为一群曾经在网上认识的人运行的游戏来说是完美的。他们中的绝大多数都是我从未见过的人，而我有的人呢？我们上一次在互联网之外见面大约是在2013年。每隔两周或三周，我们就会登录到Roll20，以便使用绿罗宁的龙族时代桌面设置来进行一场活动。我的玩家在我们不玩的时候对我们的游戏进行了不和谐的理论推导，他们分享了可怕的模因，每一次游戏都是一个新的提醒，尽管这完全是虚拟的，但玩桌面是多么有趣。\n以下是派对的概貌：有被学校开除的运动骑士，喜欢演奏音乐的弓箭手，可能比她愿意承认的更有宗教信仰的弓箭手，安静的精灵法师，不总是确定如何对待其他人，还有试图将一切团结在一起的矮人角斗士。在这场派对上，有被学校开除的运动骑士，有喜欢演奏音乐的弓箭手，可能比她承认的更有宗教信仰的精灵法师，还有试图将一切团结在一起的矮人角斗士。“弓箭手”对我们的战役有一个规范的故事风格的日志，在这一点上有数百页长。有扇子艺术。和定制的微型模型。而且，至少在一定程度上，这一切都要归功于Roll20。", "note_en": "When the dust cleared, the golem lay in pieces across the dungeon floor. Erik sighed deeply, and though his vision blurred, he could still see the rest of the party coming to his aid. Emmelina, the knight that had first welcomed him into the group, cradled him in her arms as he took his last breath. Our team had come this far only to lose its youngest member. Across five different states, there wasn&#39;t a dry eye among our team, but we recomposed ourselves and continued to play our tabletop adventure through the service we’ve used for half a decade now: Roll20.\n Perhaps, like me, you had fun adventures with friends locally when you were younger or, perhaps you&#39;re interested in role-playing now but unable to actually, you know, meet up with anyone thanks to the pandemic. If so, Roll20 solves the biggest hurdle between you and delving dungeons with your buddies. And it does so without overly complicating things. If you have access to the internet, you can run virtual tabletop games of  Dungeons &amp; Dragons—or anything else—thanks to Roll20.\n   Roll20 is a digital platform from relatively small company The Orr Group. It launched in 2012 and allows people to create, share, and play tabletop campaigns. Various upgrades are available to purchase, but the basic service will let anyone do all of the above without too much muss or fuss. And of all the reasons to give Roll20 a shot, possibly the biggest is the simplest: it’s free.\n From the start, Roll20 lets you create campaigns, use a variety of different maps which can be toggled as active or not, place digital miniatures in the form of tokens that can then be moved about said maps, and more. Want to do video and voice while you play? That’s built right in. Basic text chat also allows for rolling dice, sending messages as specific characters, and just, well, shooting the breeze. There’s even a jukebox function baked into the free version that lets you set the mood with a little music.\n There are also certain premium options in Roll20, and they range from useful to extremely useful: things like dynamic lighting and premium tokens. But all of the core functionality is there from the start, and there’s no reason to upgrade if you don’t need the extras. It’s a nice setup, really, because you can run full campaigns without having to pay anything, but all of the extras are helpful. The different subscription tiers (Plus at $49.99 a year and Pro at $99.99 a year) add more storage, the aforementioned dynamic lighting, custom character sheets, and more. I’ve subscribed in the past and likely will again in the future, but for someone just starting out, a sub will likely only add more stuff to fiddle with. No need to up the learning curve from the start, after all.\n In addition to subscription tiers, Roll20 also straight-up sells digital modules and handbooks to play a number of different RPG systems. If you’re the kind of person that really wants to “wow” folks but doesn’t have the time to build everything from scratch, you can just pick up some preconstructed adventures and run them without too much tweaking. In my opinion, nothing quite replaces having the physical books on hand, but there’s also something to be said for being able to access anything and everything within said books using just a few clicks, and you can’t exactly dump a physical book into a virtual tabletop system in the same way.\n   Even before the COVID-19 response shut everything down, virtual tabletop was a way to connect with folks across disparate spaces—and it remains so. There just now happens to be even more people with the time and the distance to make such services all the more appealing. My own journey to Roll20 seems to be pretty common: in the wake of my high school  Dungeons &amp; Dragons group moving away for college, and then across the country for work, Roll20 let us play in the same space again, even if it was a digital one.\n Since joining Roll20 in late 2012, I’ve logged nearly 500 hours on the platform—with the vast majority of that bringing together friends and former acquaintances rather than random strangers. Not that there’s any problem with random groups, and Roll20 even facilitates this with the ability to add yourself to a directory of players by indicating what sort of games, by system, you’re looking to join. Or, if you’re feeling adventurous, you can browse the forums where players look for games to join and where those running games look for players.\n Over the years, I’ve tried out other virtual tabletop platforms, but I always seem to drift back to Roll20 thanks to its relative ease of use and broad access. Other popular options include Fantasy Grounds or D20PRO, but both are far more fiddly than Roll20, in my experience. The path in Roll20 from signing up to joining a game to playing in a game is fairly straightforward, and for players, it largely comes across as seamless. Folks that are actually running games have a number of different choices to make, including just how detailed of a game they want to run, but players in large part simply need to click a couple links and show up at the designated time.\n And that, for the last five years or so, has worked perfectly for a game that I run for a bunch of what were once acquaintances online. The vast majority of these are people I’ve never physically met, and the one I have? The last time we met outside of the internet was something like 2013. Every two weeks, or three, we log into Roll20 in order to play out a campaign using Green Ronin’s Dragon Age tabletop setting. My players theorize in Discord about our game while we’re not playing, and they share terrible memes, and every session is a new reminder of just how much fun playing tabletop can be despite the fact that this is entirely virtual.\n Here’s an overview of the party: there’s the jock knight that was kicked out of school, the archer that likes to play music and maybe has more religion in her than she cares to admit, the quiet elven mage that isn’t always sure what to make of the rest of the group, and the dwarven gladiator trying to hold it all together. The archer keeps a canonical story-style log of our campaign, which at this point is hundreds of pages long. There’s fan art. And custom miniatures. And, at least partly, it’s all thanks to Roll20.", "posttime": "2020-06-28 21:51:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,角色扮演,role,roll20", "title": "如何将角色扮演游戏之夜搬到网上", "title_en": "How to move your role-playing game nights online", "transed": 1, "url": "https://arstechnica.com/gaming/2020/06/how-to-move-your-role-playing-game-nights-online/", "via": "", "real_tags": ["游戏", "角色扮演", "role", "roll20"]}, {"category": "", "categoryclass": "", "imagename": "978c70dc9ca5138a46bdf8b3013c6eb9.jpg", "infoid": 1008722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Eclipse基金会本周宣布了Jakarta EE9 Milestal1，这是第一个候选版本(RC)之前的企业Java规范的最终版本。\n雅加达EE9的发布标志着从javax.*名称空间(Oracle拒绝放弃)到Eclipse的Jakarta.*的最终过渡。此版本更新了所有API，以便在包名中使用Jakarta.*。\n事实上，Eclipse基金会的执行董事Mike Milinkovich说，这个版本实际上就是关于过渡的。\n&#34；Java EE 9的主要目的是提供一个非常类似于Java EE 8的版本，&#34；Milinkovich告诉ADTmag，&#34；所有内容都转换为Jakarta.*名称空间。我们正在提供一个稳定的技术转换平台，因此生态系统中所有使用javax.servlet的工具和框架都可以信心十足地进行更改。\n米林科维奇说，让生态系统为从爪哇EE咖啡杯过渡到雅加达EE帆船奠定坚实的基础，这是基金会为快速创新搭建舞台的方式，一旦过渡基本完成。\n他补充说，这些技术已经存在了很长一段时间，我们必须为人们提供一个稳定的转换平台。同时，多亏了IBM的贡献，我们有了Eclipse Transformer Project，它将提供运行时支持。如果某人有一个他们不想重新编译的应用程序，而该应用程序使用的是javax.*名称空间，那么他们将能够在与Jakarta兼容的应用程序服务器上运行它。这将为未来的应用程序提供二进制兼容性。这里有很多不同的作品汇聚在一起，贡献来自许多不同的来源。我想提到IBM的Kevin Sutter，他真正承担了推动规范向前发展的重担。如果你看一下Glassfish，你会发现项目负责人来自Payara和富士通(Fujitsu)。如果你看一下TCK，你会发现很多工作都来自红帽。我们在倡议的不同部分取得了不同利益的良好平衡。\n雅加达EE兼容性测试套件-一套兼容性测试，用于验证雅加达EE平台产品是否符合雅加达EE平台标准。\n&#34；Eclipse Foundation规范流程规定，在发布新版本的规范之前，必须在开放源码许可下至少有一个兼容的实现可用，&#34；Milinkovich解释道。至少在目前，仅仅从纯技术的角度来看，TCK[技术兼容性工具包](TCK[Technology Compatibility Kit])。这最初是由甲骨文贡献的，与Glassfish捆绑在一起。因此，到目前为止，为了发货或释放，我们必须得到Glassfish，这是由大约20个项目组成的。有一大堆东西实现了一堆规范的各种参考实现。\n根据GitHub网站的说法，雅加达EE9版本还从雅加达EE8中删除了旧的、可选的或已废弃的规范，以减少API的表面积，并确保新供应商更容易进入生态系统。这也减轻了旧API的实现、迁移和维护负担。\nGitHub网站声明，Jakarta EE平台项目团队主要将Jakarta EE 9视为工具版本：\n工具供应商可以从中创建和更新其工具以支持新的Jakarta.*命名空间的平台。\n一个平台，开发团队可以将其用作测试将其应用程序迁移到新命名空间的稳定目标。\n一个运行时供应商可以用来测试和交付选项和功能的平台，这些选项和功能支持与Jakarta EE 8的迁移和向后兼容。\n一个创新的基础，雅加达EE规范项目可以使用它来驱动在雅加达EE10和更高版本中发布的新特性。\n米林科维奇说，有很多可移动的部件，我们必须在同一天把它们都排好，才能真正进行放映。在我们发布的那天，一切都必须完美无瑕。那么，当兼容的实现100%通过TCK中的测试用例时，我们可以宣布胜利吗？&#34；", "note_en": "The Eclipse Foundation this week  announced Jakarta EE 9 Milestone 1, the final version of the enterprise Java specification before the first Release Candidate (RC).\n  The Jakarta EE 9 release marks the final  transition away from the  javax.* namespace (which Oracle refused to give up) to Eclipse&#39;s  jakarta.*. This release updates all the APIs to use  jakarta.* in package names.\n  In fact, Mike Milinkovich, executive director of the Eclipse Foundation, says that transition is really what this release is all about.\n  &#34;The main purpose of Java EE 9 is to provide a release that is very similar to Java EE 8,&#34; Milinkovich told  ADTmag, &#34;with everything converted to the  jakarta.* namespace. We&#39;re providing a stable technical conversion platform, so all the tools and frameworks in the ecosystem that are using, say,  javax.servlet, can make the change with confidence.&#34;\n      Giving the ecosystem solid footing for the transition from the Java EE coffee cup to the Jakarta EE sailboat is the Foundation&#39;s way of setting the stage for rapid innovation, Milinkovich said, once the transition is largely complete.\n  &#34;These technologies have been around for an awfully long time,&#34; he added, &#34;and we had to provide folks with a stable platform for the conversion. At the same time, thanks to a contribution from IBM, we have the  Eclipse Transformer Project, which is going to provide runtime enablement. If someone has an application they don&#39;t want to recompile, and that application is using the  javax.* namespace, they will be able to run it on top of a Jakarta-compatible app server. That&#39;s going to provide binary compatibility for apps, going forward. There are a lot of different pieces coming together here, and the contributions have been coming from a number of different sources. I want to mention Kevin Sutter at IBM, who&#39;s really taking on the burden of moving the specifications forward. If you look at Glassfish, you&#39;ll see that the project leads are from Payara and Fujitsu. If you look at the TCKs, you&#39;ll see that a lot of the work going into that is coming from Red Hat. We have this nice balance of different interests coming together on different parts of the initiative.&#34;\n    Jakarta EE Compatibility Test Suite - A suite of compatibility tests for verifying that a Jakarta EE platform product complies with the Jakarta EE platform standard.\n    &#34;The Eclipse foundation specification process says that before you can release a new version of the spec, you have to have at least one compatible implementation available under an open source license,&#34; Milinkovich explained. &#34;And at least currently, just from a pure technical perspective, the TCK [Technology Compatibility Kit]. That was originally contributed by Oracle is tied to glassfish. So, as of this moment, in order to ship or release, we have to get Glassfish, which is made up of about 20 projects. There&#39;s a whole bunch of stuff that implements the various reference implementations for a bunch of the specs.&#34;\n  Jakarta EE 9 release also removes specifications from Jakarta EE 8 that were old, optional, or deprecated, according to the  GitHub site, in order to reduce the surface area of the APIs and ensure that it&#39;s easier for new vendors to enter the ecosystem. This also reduces the burden on implementation, migration, and maintenance of the old APIs.\n  The GitHub site states that the Jakarta EE Platform Project team sees Jakarta EE 9 primarily as a tooling release:\n  A platform from which tooling vendors can create and update their tools to support the new  jakarta.* namespace.\n  A platform that development teams can use as a stable target for testing migration of their applications to the new namespace.\n  A platform that runtime vendors can use to test and deliver options and capabilities that support migration and backwards compatibility with Jakarta EE 8.\n  A foundation for innovation that Jakarta EE specification projects can use to drive new features for release in Jakarta EE 10 and beyond.\n  &#34;There are a lot of moving parts,&#34; Milinkovich said, &#34;and we have to line them all up on the same day to actually do the release. The day we do the release, it all has to work perfectly. So, when the compatible implementation passes 100% of the test cases in the TCK, can we declare victory.&#34;", "posttime": "2020-06-28 21:50:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,java,ee9,ee,规范", "title": "雅加达EE9规范发布“标志着从javax命名空间的最终过渡”", "title_en": "Jakarta EE 9 Specification Release 'Marks the Final Transition Away From javax Namespace'", "transed": 1, "url": "https://adtmag.com/articles/2020/06/25/jakarta-ee-9-release.aspx", "via": "", "real_tags": ["发布", "java", "ee9", "ee", "规范"]}, {"category": "", "categoryclass": "", "imagename": "99194f67e5542018f2c1c325832cade0.png", "infoid": 1008721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这句话并不是以同样的方式引起每个人的共鸣。为了真正理解我所说的仔细的API设计是什么意思，一个人必须经历过这两种情况。\n但也有一线希望--一旦你体验了好的设计，就真的很难再回到另一种设计了。即使在承认好的设计不可避免地要付出代价之后，无论是认知负担、编译时间，还是让招聘变得更具挑战性等，都不可避免地要付出代价。\n学习新事物，理解它的价值，然后再回到旧的做事方式，这是一种非常困难的经历。这适用于任何主题，而不仅仅是编程。\n我知道这对我来说很困难。所以，这里是你的警告：一旦你学会了发现设计缺陷，你就不能忘记它，而且这确实会让你很难把工作做好。这是一个微妙的平衡。\n几年前，当我开始使用Go时，我很高兴地发现了一些核心界面。\n首先，它从Go1.0开始就有了，它只有一个功能。所以基本上你能想到的任何东西都已经实现了。\n//在`main.go`包main import(&#34；io&#34；&#34；log&#34；&#34；os&#34；)func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}readSome(F)}函数readSome(r io.。读卡器){buf：=make([]byte，4)n，err：=r.Read(Buf)if err！=nil{log.。Printf(&#34；获取错误：%+v&#34；，Err)}其他{日志。Printf(&#34；读取%v字节：%v&#34；，n，buf[：n])}}。\n包主要导入(&#34；io&#34；&#34；log&#34；&#34；net&#34；)func main(){log.。SetFlags(日志。L短文件)连接，错误：=NET。如果err！=nil{log！，则拨号(&#34；TCP&#34；，&#34；example.org：80&#34；)。Fatalf(&#34；%+v&#34；，err)}_，err=conn。如果err！=nil{log.，则写入([]byte(&#34；GET/HTTP/1.1\\r\\n\\r\\n&#34；))。Fatalf(&#34；%+v&#34；，err)}readSome(Conn)}//省略：readSome\n包主要导入(&#34；io&#34；&#34；log&#34；&#34；net/http&#34；)func main(){log.。SetFlags(日志。L短文件)，错误：=http。Get(&#34；http://example.org&#34；)if Err！=nil{log.。Fatalf(&#34；%+v&#34；，err)}readSome(分别。BODY)}Funcc readSome(r io.。读卡器){buf：=make([]byte，4)n，err：=r.Read(Buf)if err！=nil{log.。Printf(&#34；获取错误：%+v&#34；，Err)}其他{日志。Printf(&#34；读取%v字节：%v&#34；，n，buf[：n])}}。\n我们可以继续下去，但我们不能--基本上，围棋生态系统中任何可以阅读的东西几乎都可以实现io.Reader。\nAltReader接口提出了几个问题-让我们通过为*os.File实现它来强调这些问题。\n包主导入(&#34；log&#34；&#34；os&#34；)类型AltReader接口{AltRead()([]byte，error)}func(f*os.。文件)AltRead()([]字节，错误){buf：=make([]byte，1024)n，err：=f.read(Buf)return buf[：n]，err}func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}readSome(F)}func readSome(R AltReader){buf，err：=r.AltRead()if err！=nil{log.。Printf(&#34；获取错误：%+v&#34；，Err)}其他{日志。Printf(&#34；读取%v字节：%v&#34；，len(Buf)，buf)}}。\n$Go运行main.go#命令行参数。\\main.go：12：6：无法在非本地类型os.File上定义新方法。\\main.go：26：10：不能在参数中使用f(类型*os.File)作为类型AltReader来读取Some：*os.File不实现AltReader(缺少AltRead方法)。\n包主导入(&#34；io&#34；&#34；log&#34；&#34；os&#34；)类型AltReader接口{AltRead()([]byte，error)}//新类型：类型AltReadWrapper struct{Internal io.。Reader}//现在接收器是我们的包装器类型func(arw*AltReadWrapper)AltRead()([]byte，error){buf：=make([]byte，1024)n，err：=arw。内部。read(Buf)return buf[：n]，err}func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}//参数现在换行为readSome(&amp；AltReadWrapper{Internal：f})}func readSome(R AltReader){buf，err：=r.AltRead()if err！=nil{log.。Printf(&#34；获取错误：%+v&#34；，Err)}其他{日志。Printf(&#34；读取%v字节：%v&#34；，len(Buf)，buf)}}。\n$GO运行main.gomain.go：42：读取705字节：[112 97 99 107 97 103 101 32 109 97 105(等)]。\n请注意，当我们实现AltReader时，我们只声明了一个具有正确签名的名为AltRead()的函数。\n好的，所以AltReader接口可以工作了--但是，没有办法指定您想要读取多少数据。我们很高兴早些时候只读取了4个字节，但是现在我们依赖于AltReader的实现者选择的任何缓冲区大小。\n类型AltReader接口{AltRead(N Int)([]byte，error)}类型AltReadWrapper结构{内部io。Reader}var_AltReader=(*AltReadWrapper)(Nil)func(arw*AltReadWrapper)AltRead()([]字节，错误){buf：=make([]byte，1024)n，err：=arw。内部。read(Buf)return buf[：n]，Err}//省略：其他所有内容。\nFunc(arw*AltReadWrapper)AltRead()([]字节，错误){buf：=Make([]字节，1024)//⬅此处n，Err：=arw。内部。读取(Buf)返回buf[：n]，错误}。\n$Go运行main.go#命令行参数。\\main.go：17：5：不能使用(*AltReadWrapper)(Nil)(type*AltReadWrapper)作为赋值中的AltReader类型：*AltReadWrapper不实现AltReader(AltRead方法的类型错误)有AltRead()([]byte，error)Want AltRead(Int)([]byte，error)。\\main.go：AltReadWrapper文本(type*AltReadWrapper)作为readSome的参数中的类型AltReader：*AltReadWrapper未实现AltReader(AltRead方法的类型错误)Have AltRead()([]byte，Error)Want AltRead(Int)([]Byte，Error)。\\main.go：38：23：调用r.AltRead Have()Want(Int)时参数不足。\nfunc(arw*AltReadWrapper)AltRead(N Int)([]byte，error){buf：=make([]byte，n)n，err：=arw。内部。读取(Buf)返回buf[：n]，错误}。\nfunc readSome(R AltReader){buf，err：=r.AltRead(4)if err！=nil{log.。Printf(&#34；获取错误：%+v&#34；，Err)}其他{日志。Printf(&#34；读取%v字节：%v&#34；，len(Buf)，buf)}}。\n现在，一切都重新编译并运行-我们得到了4个字节，就像我们想要的那样：\n函数(arw*AltReadWrapper)AltRead(N Int)([]byte，error){//我们要找出GC是否真的很快buf：=make([]byte，n)n，err：=arw。内部。读取(Buf)返回buf[：n]，错误}\n包主导入(&#34；io&#34；&#34；log&#34；&#34；os&#34；)类型AltReader接口{AltRead(N Int)([]byte，error)}类型AltReadWrapper struct{Internal io.。Reader buf[]byte}var_AltReader=(*AltReadWrapper)(Nil)func(arw*AltReadWrapper)AltRead(N Int)([]byte，error){if len(arw.。buf)&lt；n{log.。Printf(&#34；分配%v字节&#34；，n)arw。buf=make([]byte，n)}n，Err：=arw。内部。阅读(arw.。buf)返回arw。buf[：n]，err}func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。对于i：=0；i&lt；4；i++{readSome(Arw)}}函数readSome(R AltReader){buf，err：=r.AltRead(4)if err！=nil{log.，则Fatalf(&#34；%+v&#34；，err)}arw：=&amp；AltReadWrapper{Internal：f}for i：=0；i&lt；4；i++{readSome(Arw)}}函数readSome(R AltReader){buf，err：=r.AltRead(4)。Printf(&#34；获取错误：%+v&#34；，Err)}其他{日志。Printf(&#34；读取%v字节：%v&#34；，len(Buf)，buf)}}。\n$GO运行main.gomain.go：22：分配4字节main.go：49：读取4字节：[112 97 99 107]main.go：49：读取4字节：[97 103 101 32]main.go：49：读取4字节：[109 97 105 110]main.go：49：读取4字节：[10 10 105 109]。\n当然，返回内部缓冲区的问题在于没有什么能阻止调用者保留对它的引用。\n包主导入(&#34；io&#34；&#34；log&#34；&#34；os&#34；//new！&#34；github.com/davecgh/go-spew/spew&#34；)//某些类型/函数省略了func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}fc：=readFourChunks(&amp；AltReadWrapper{Internal：f})输出。dump(Fc)}type FourChunks struct{one[]byte Two[]byte Three[]byte four[]byte}func readFourChunks(R AltReader)FourChunks{masRead：=func()[]byte{r，err：=r.AltRead(4)if err！=nil{log.。Fatalf(&#34；Cannot Not Read：%+v&#34；，Err)}return r}return FourChunks{One：mastRead()，Two：msiRead()，Three：msiRead()，Four：mastRead()，}。\n$go run main.gomain.go：24：分配4字节(main.FourChunks){一：([]uint8)(len=4 cap=4){00000000 0A 0A 69 6d|..im|}，二：([]uint8)(len=4 cap=4){00000000 0A 0A 69 6d|..im|}，三：([]uint8)(len=4 cap=4){00000000 0A 0A 69 6d|..im。\n啊哦。FourChunks的所有字段都设置为main.go中找到的第四组偏置字节。\n键入AltReadWrapper struct{interi.。Reader}函数(arw*AltReadWrapper)AltRead(N Int)([]字节，错误){buf：=make([]byte，n)n，err：=arw。内部。读取(Buf)返回buf[：n]，错误}。\n$go run main.go(main.FourChunks){一：([]uint8)(len=4 cap=4){00000000 70 61 63 6b|pack|}，二：([]uint8)(len=4 cap=4){00000000 61 67 65 20|age|}，三：([]uint8)(len=4 cap=4){00000000 6d 61 69 6e|main|}，四：([]uint8)(len=4 cap=4)\n而且我们在每次读取设计时都会坚持分配，因为我们不知道调用者可能会保留我们返回的切片多长时间。在我们的AltReader实现类型获取垃圾回收之后，他们可能会保留很长时间。\n但我认为Reader没有这个问题。通过采用单个[]字节参数，它可以同时满足这两个要求：\n如果我们将示例更改为只使用io.Reader，我们可以看到一切都很正常：\n软件包主要导入(&#34；io&#34；&#34；log&#34；os&#34；&#34；github.com/davecgh/go-spew/spew&#34；)func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}fc：=readFourChunks(F)spew.。dump(Fc)}type FourChunks struct{one[]byte Two[]byte Three[]byte four[]byte}函数读取FourChunks(r io.。Reader)FourChunks{masRead：=func(p[]byte)[]byte{_，err：=io。ReadFull(r，p)if err！=nil{log.。Fatalf(&#34；Cannot Not Read：%+v&#34；，Err)}Return p}return FourChunks{One：mastRead(make([]byte，4))，Two：mastRead(make([]byte，4))，Three：mastRead(make([]byte，4))，Four：mastRead(make([]byte，4))，}}。\n$go run main.go(main.FourChunks){一：([]uint8)(len=4 cap=4){00000000 70 61 63 6b|pack|}，二：([]uint8)(len=4 cap=4){00000000 61 67 65 20|age|}，三：([]uint8)(len=4 cap=4){00000000 6d 61 69 6e|main|}，四：([]uint8)(len=4 cap=4)。\n软件包主要导入(&#34；io&#34；&#34；log&#34；os&#34；&#34；github.com/davecgh/go-spew/spew&#34；)func main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}readFourTimes(F)}函数readFourTimes(r io.。读卡器){buf：=make([]byte，4)for i：=0；i&lt；4；i++{_，err：=io。ReadFull(r，buf)，如果err！=nil{log.。Fatalf(&#34；无法读取：%+v&#34；，Err)}拼写。转储(Buf)}}。\n见鬼，如果我们愿意，我们甚至可以把它读到缓冲区的中间：\nfunc main(){log.。SetFlags(日志。L短文件)f，错误：=os。如果错误！=nil{log.(&#34；main.go&#34；)，则打开(&#34；main.go&#34；)。Fatalf(&#34；%+v&#34；，err)}readToMid.(F)}函数readToMid.。读卡器){buf：=[]byte(&#34；.&#34；)_，Err：=io。ReadFull(r，buf[8：20])，如果err！=nil{log.。Fatalf(&#34；无法读取：%+v&#34；，Err)}拼写。转储(Buf)}\n$go run main.go([]uint8)(len=30 cap=30){00000000 2e 2e 2e 70 61 63 6b 61 67 65 20|.Package|00000010 6d 61 69 6e 2e 2e 2e|Main.|}。\n在这一点上，我认为公平地说，io.Reader是一个更好的设计。\n我还没有展示完整的io.Reader界面--只展示了它的函数签名。不幸的是，这还不足以完全指定接口。\n任何时候，只要界面的签名本身不足以推断其行为，就会有麻烦出现。\n想象一下，你可以拉起或拉下一个火警报警器。如果你把它拉起来-警报器响了，人们都疏散了，一切都很好。\n当然，最终人们会想出办法的--他们会把它拉下来，看看什么都没有发生，困惑几秒钟，然后试着把它拉起来。或者也许他们赢了，然后假设它坏了。\n当然，除非拉警报器的人什么也听不到。也许大厦管理人员可以确信这是一个潜在的问题，应该做些什么来解决它。\n他们没有更换警报器，而是设立了员工培训。所有的火警警报器都必须拉下来，而不是拉起来--不，等等，反过来。\n他们还没有解决问题的根源。这充其量只是一个创可贴。任何还没有参加过培训的人，比如新员工，都是大楼的潜在危险。\n现在，酷熊，你知道这个类比并不适用于每个人。我可以从这里看到评论.。\n不要紧--不管怎样，让我们在这里公平地说：不是所有的事情都是可以解决的。有时你只需要在墙上贴一张告示，上面写着不要戳熊，因为那里有熊是有充分理由的。\n不管怎样，我要说的是我们还没有讨论完整的IO.Reader界面。\n尽管它只是一个函数，但有一堆可移动的部分。首先，这是Go，在Go中，您没有元组，您没有Result&lt；T&gt；类型，您没有异常处理-您有多值回报。\n多值回报的问题之一是，没有人抱怨这样的事情：\n软件包主要导入(&#34；log&#34；&#34；os&#34；&#34；github.com/davecgh/go-spew/spew&#34；)func main(){log.。SetFlags(日志。lShort file)//这显然不是一个好主意f，_：=os。打开(&#34；woops&#34；)buf：=make([]byte，32)//n，_：=f.read(Buf)spew。转储(buf[：n])}。\n编译器不会抱怨，去兽医也不会抱怨，golangci-lint运行的51个短针都不会抱怨。\n他们当然不会抱怨，你在想，你只是用_！叫他们闭嘴！\n在支持异常的语言中懒于处理错误的方法是.。什么都不做。\n//@ts-check const{readFile}=REQUIRED(&#34；fs&#34；)。承诺；异步函数main(){const content=await readFile(&#34；woops&#34；，{coding：&#34；utf-8&#34；})；控制台。log(`刚刚读取文件：${Contents。Slice(0，20)}.`)；}main()；\nwoops文件不存在，而且我们肯定没有花任何时间考虑错误处理，因此，它导致整个程序中断：\n$node--unhanded-rejections=Strict main.jsInternal/process/promises.js：194 riggerUncaughtException(err，true/*from mPromise*/)；^[错误：ENOENT：无此类文件或目录，打开&#39；C：\\msys64\\home\\amos\\go\\aac\\woops&#39；]{errno：-4058，code：&#39；ENOENT&#39；，SysCall。\n导入java。伊俄。BufferedReader；导入java。伊俄。FileInputStream；导入java。伊俄。InputStreamReader；导入java。尼欧。CharBuffer；public class main{public static void main(string args[])抛出java。朗。异常{BufferedReader Reader=new BufferedReader(new InputStreamReader(new FileInputStream(&#34；woops&#34；)，&#34；UTF-8&#34；))；CharBuffer BUF=CharBuffer。分配(32)；读取器。读(BUF)；读。关闭()；系统。出去。println(&#34；只需读取文件：&#34；+buf。toString())；}}。\n$javac Main.java&amp；&amp；线程中的java MainException&#34；Main&34；java.io.FileNotFoundException：位于java.base/java.io.FileInputStream.open0(Native方法的Woops(系统找不到指定的文件)位于java.base/java.io.FileInputStream.open(FileInputStream.java:219)位于java.base/java.io.FileInputStream.&lt；init&gt；(FileInputStream.java:157)位于java.base/java.io.FileInputStream.&lt；init&gt；(FileInputStream.java：112)在Main.main(Main.java：8)。\n$python main.pyTraceback(最近一次调用)：file&#34；main.py&#34；，第2行，在&lt；module&gt；file=open(&#34；woops&#34；，&#34；r&#34；)FileNotFoundError：[Errno 2]没有这样的文件或目录：&#39；woops&#39；\n#DEFINE_CRT_SECURE_NO_WARNINGS#include&lt；stdio.h&gt；#include&lt；stdlib.h&gt；int main(int argc，char**argv){file*f=fopen(&#34；woops&#34；，&#34；r&#34；)；const size_t len=32；//(！)。无偿使用sizeof传达意图//作者意识到sizeof(Char)只有1.char*buf=calloc(len，sizeof(Char))；fread(buf，sizeof(Char)，len，f)；printf(&#34；只读取文件的一部分：%.*s\\n&#34；，(Int)len，buf)；return 0；}。\n$lldb./Main(Lldb)目标创建&#34；./Main&#34；当前可执行文件设置为&#39；./Main&#39；(X86_64)r进程14644已启动：&#39；C：\\msys64\\HOME\\amos\\go\\aac\\main&#39；(X86_64)进程14644已停止*线程#1，停止原因=在地址0x7ff6遇到异常0xc0000409。IMM=0xC0000417 0x7ff6f10c6385：LEAL 0x1(%r8)，%ecx。\n我做的不仅仅是几条下划线。我故意隐藏了一些非常有趣的警告。\n$clang main.c-o main.c：5：13：警告：&#39；fopen&39；已弃用：此函数或变量可能不安全。请考虑改用fopen_s。要禁用弃用，请使用_CRT_SECURE_NO_WARNINGS。有关详细信息，请参阅联机帮助。[-W不推荐使用的声明]文件*f=fopen(&#34；woops&#34；，&#34；r&#34；)；^C：\\Program Files(X86)\\Windows Kits\\10\\Include\\10.0.18362.0\\ucrt\\stdio.h:207:20：备注：&#39；fopen&#39；已被显式标记为已弃用HERE_CHECK_RETURN__CRT_INSECURE_DELPERATE(FOPEN_S)^D：\\Programs\\MicrosoftVisual Studio\\2019\\Community\\VC\\Tools\\MSVC\\14.26.28801\\include\\vcruntime.h:316:55：备注：从宏展开；_CRT_INSECURE_DEPREATE&#39；#DEFINE_CRT_INSECURE_DEPREATE(_REPLACE)_CRT_DEPROATE_TEXT(\\^D：\\PROGRAM\\MICROSOFT Visual Studio\\2019\\Community\\VC\\Tools\\MSVC\\14.26.28801\\include\\vcruntime.h:306:47：注意：从宏&#39；_CRT_DEPREATE_TEXT&#39；#DEFINE_CRT_DEPREATE_TEXT(_TEXT)__DECLSPEC(DEPERATED(_TEXT))^1生成警告。\n#include&lt；stdio.h&gt；#include&lt；stdlib.h&gt；int main(int argc，char**argv){file*f；fopen_s(&amp；f，&#34；woops&#34；，&#34；r&#34；)；//etc返回0；}。\n然后..。没有其他警告了。不过，微软(我在Windows上写这篇文章)已经为C开发了一种注释语言。\n_check_return_wat__ACRTIMP errno_t__cdecl fopen_s(_Outptr_result_maybenull_file**_Stream，_in_z_char const*_filename，_in_z_char const*_Mode)；\n(顺便说一句，这是在PowerShell中运行的-我通常在msys2中运行shell sessionin)。\n$cl.exe/nlogo/Analyze main.cmain.cC：\\msys64\\home\\amos\\go\\aac\\main.c(8)：警告C6031：已忽略返回值：&#39；fopen_s&#39；.C：\\msys64\\home\\amos\\go\\aac\\main.c(14)：警告C6387：&#39；buf&#39；可能是&#39；0&#39；：这不符合s。\n..", "note_en": "This statement doesn&#39;t resonate the same way with everyone. In order toreally understand what I mean by &#34;careful API design&#34;, one has to haveexperienced both ends of the spectrum.\n But there is a silver lining - once you  have experienced &#34;good design&#34;,it&#39;s really hard to go back to the other kind. Even after acknowledging that&#34;good design&#34; inevitably comes at a cost, whether it&#39;s cognitive load, compiletimes, making hiring more challenging, etc.\n It&#39;s a very difficult experience to learn about something new, and understandits value, and then go back to the old way of doing things. This holds truefor any topic, not just programming.\n I know it&#39;s been very difficult for me. So, here&#39;s your warning: once you learnto spot design deficiencies, you can&#39;t unlearn it, and it does make it harderto just &#34;get the job done&#34;. It&#39;s a delicate balance.\n  When I started playing around with  Go, a few yearsback, I was delighted to discover some of the core interfaces.\n    For starters, it&#39;s been around since  Go1.0.It&#39;s only one function. So it&#39;s been implemented for basically anything youcould think of.\n  // in `main.go` package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;os&#34;) func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t readSome( f)} func  readSome( r io. Reader) {\t buf  :=  make([] byte, 4)\t n,  err  :=  r. Read( buf)\t if  err  !=  nil {\t\t log. Printf( &#34;got error: %+v&#34;,  err)\t}  else {\t\t log. Printf( &#34;read %v bytes: %v&#34;,  n,  buf[: n])\t}}\n   package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;net&#34;) func  main() {\t log. SetFlags( log. Lshortfile)\t conn,  err  :=  net. Dial( &#34;tcp&#34;,  &#34;example.org:80&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t _,  err  =  conn. Write([] byte( &#34;GET / HTTP/1.1\\r\\n\\r\\n&#34;))\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t readSome( conn)} // omitted: readSome\n   package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;net/http&#34;) func  main() {\t log. SetFlags( log. Lshortfile)\t resp,  err  :=  http. Get( &#34;http://example.org&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t readSome( resp. Body)} func  readSome( r io. Reader) {\t buf  :=  make([] byte, 4)\t n,  err  :=  r. Read( buf)\t if  err  !=  nil {\t\t log. Printf( &#34;got error: %+v&#34;,  err)\t}  else {\t\t log. Printf( &#34;read %v bytes: %v&#34;,  n,  buf[: n])\t}}\n  We could go on, but let&#39;s not - basically, anything that can be read in theGo ecosystem almost certainly implements  io.Reader.\n      That  AltReader interface presents several issues - let&#39;s underline them byimplementing it for, say,  *os.File\n package main import (\t &#34;log&#34;\t &#34;os&#34;) type  AltReader  interface {\t AltRead() ([] byte,  error)} func ( f  *os. File)  AltRead() ([] byte,  error) {\t buf  :=  make([] byte, 1024)\t n,  err  :=  f. Read( buf)\t return  buf[: n],  err} func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t readSome( f)} func  readSome( r  AltReader) {\t buf,  err  :=  r. AltRead()\t if  err  !=  nil {\t\t log. Printf( &#34;got error: %+v&#34;,  err)\t}  else {\t\t log. Printf( &#34;read %v bytes: %v&#34;,  len( buf),  buf)\t}}\n $ go run main.go# command-line-arguments.\\main.go:12:6: cannot define new methods on non-local type os.File.\\main.go:26:10: cannot use f (type *os.File) as type AltReader in argument to readSome: *os.File does not implement AltReader (missing AltRead method)\n   package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;os&#34;) type  AltReader  interface {\t AltRead() ([] byte,  error)} // new type: type  AltReadWrapper  struct {\t inner io. Reader} // now the receiver is our wrapper type func ( arw  * AltReadWrapper)  AltRead() ([] byte,  error) {\t buf  :=  make([] byte, 1024)\t n,  err  :=  arw. inner. Read( buf)\t return  buf[: n],  err} func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t // the argument is now wrapped\t readSome( &amp; AltReadWrapper{ inner:  f})} func  readSome( r  AltReader) {\t buf,  err  :=  r. AltRead()\t if  err  !=  nil {\t\t log. Printf( &#34;got error: %+v&#34;,  err)\t}  else {\t\t log. Printf( &#34;read %v bytes: %v&#34;,  len( buf),  buf)\t}}\n $ go run main.gomain.go:42: read 705 bytes: [112 97 99 107 97 103 101 32 109 97 105 (etc.)]\n Notice that when we implemented  AltReader, we just declared a functionnamed  AltRead() with the correct signature.\n Okay, so the  AltReader interface works - but, there&#39;s no way to specify howmuch data you want to read. We were happy just reading four bytes earlier,but now we&#39;re dependent on whatever buffer size the implementor of AltReader chose.\n  type  AltReader  interface {\t AltRead( n  int) ([] byte,  error)} type  AltReadWrapper  struct {\t inner io. Reader} var  _  AltReader  = ( * AltReadWrapper)( nil) func ( arw  * AltReadWrapper)  AltRead() ([] byte,  error) {\t buf  :=  make([] byte, 1024)\t n,  err  :=  arw. inner. Read( buf)\t return  buf[: n],  err} // omitted: everything else\n  func ( arw  * AltReadWrapper)  AltRead() ([] byte,  error) {\t buf  :=  make([] byte, 1024)  // ⬅ here\t n,  err  :=  arw. inner. Read( buf)\t return  buf[: n],  err}\n $ go run main.go# command-line-arguments.\\main.go:17:5: cannot use (*AltReadWrapper)(nil) (type *AltReadWrapper) as type AltReader in assignment: *AltReadWrapper does not implement AltReader (wrong type for AltRead method) have AltRead() ([]byte, error) want AltRead(int) ([]byte, error).\\main.go:34:11: cannot use &amp;AltReadWrapper literal (type *AltReadWrapper) as type AltReader in argument to readSome: *AltReadWrapper does not implement AltReader (wrong type for AltRead method) have AltRead() ([]byte, error) want AltRead(int) ([]byte, error).\\main.go:38:23: not enough arguments in call to r.AltRead have () want (int)\n   func ( arw  * AltReadWrapper)  AltRead( n  int) ([] byte,  error) {\t buf  :=  make([] byte,  n)\t n,  err  :=  arw. inner. Read( buf)\t return  buf[: n],  err}\n  func  readSome( r  AltReader) {\t buf,  err  :=  r. AltRead(4)\t if  err  !=  nil {\t\t log. Printf( &#34;got error: %+v&#34;,  err)\t}  else {\t\t log. Printf( &#34;read %v bytes: %v&#34;,  len( buf),  buf)\t}}\n Now, everything compiles and runs again - and we got four bytes,just like we wanted:\n    func ( arw  * AltReadWrapper)  AltRead( n  int) ([] byte,  error) {\t // we&#39;re about to find out if that GC really is fast\t buf  :=  make([] byte,  n)\t n,  err  :=  arw. inner. Read( buf)\t return  buf[: n],  err}\n   package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;os&#34;) type  AltReader  interface {\t AltRead( n  int) ([] byte,  error)} type  AltReadWrapper  struct {\t inner io. Reader\t buf [] byte} var  _  AltReader  = ( * AltReadWrapper)( nil) func ( arw  * AltReadWrapper)  AltRead( n  int) ([] byte,  error) {\t if  len( arw. buf)  &lt;  n {\t\t log. Printf( &#34;allocating %v bytes&#34;,  n)\t\t arw. buf  =  make([] byte,  n)\t}\t n,  err  :=  arw. inner. Read( arw. buf)\t return  arw. buf[: n],  err} func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t arw  :=  &amp; AltReadWrapper{ inner:  f}\t for  i  := 0;  i  &lt; 4;  i ++ {\t\t readSome( arw)\t}} func  readSome( r  AltReader) {\t buf,  err  :=  r. AltRead(4)\t if  err  !=  nil {\t\t log. Printf( &#34;got error: %+v&#34;,  err)\t}  else {\t\t log. Printf( &#34;read %v bytes: %v&#34;,  len( buf),  buf)\t}}\n $ go run main.gomain.go:22: allocating 4 bytesmain.go:49: read 4 bytes: [112 97 99 107]main.go:49: read 4 bytes: [97 103 101 32]main.go:49: read 4 bytes: [109 97 105 110]main.go:49: read 4 bytes: [10 10 105 109]\n      The issue with returning a internal buffer is, of course, that nothingprevents the caller from keeping references to it.\n package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;os&#34;\t // new!\t &#34;github.com/davecgh/go-spew/spew&#34;) // some types/functions omitted func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t fc  :=  readFourChunks( &amp; AltReadWrapper{ inner:  f})\t spew. Dump( fc)} type  FourChunks  struct {\t one [] byte\t two [] byte\t three [] byte\t four [] byte} func  readFourChunks( r  AltReader)  FourChunks {\t mustRead  :=  func() [] byte {\t\t r,  err  :=  r. AltRead(4)\t\t if  err  !=  nil {\t\t\t log. Fatalf( &#34;could not read: %+v&#34;,  err)\t\t}\t\t return  r\t}\t return  FourChunks{\t\t one:  mustRead(),\t\t two:  mustRead(),\t\t three:  mustRead(),\t\t four:  mustRead(),\t}}\n $ go run main.gomain.go:24: allocating 4 bytes(main.FourChunks) { one: ([]uint8) (len=4 cap=4) { 00000000 0a 0a 69 6d |..im| }, two: ([]uint8) (len=4 cap=4) { 00000000 0a 0a 69 6d |..im| }, three: ([]uint8) (len=4 cap=4) { 00000000 0a 0a 69 6d |..im| }, four: ([]uint8) (len=4 cap=4) { 00000000 0a 0a 69 6d |..im| }}\n Uh oh. All the fields of  FourChunks are set to the fourth set offour bytes found in  main.go.\n  type  AltReadWrapper  struct {\t inner io. Reader} func ( arw  * AltReadWrapper)  AltRead( n  int) ([] byte,  error) {\t buf  :=  make([] byte,  n)\t n,  err  :=  arw. inner. Read( buf)\t return  buf[: n],  err}\n $ go run main.go(main.FourChunks) { one: ([]uint8) (len=4 cap=4) { 00000000 70 61 63 6b |pack| }, two: ([]uint8) (len=4 cap=4) { 00000000 61 67 65 20 |age | }, three: ([]uint8) (len=4 cap=4) { 00000000 6d 61 69 6e |main| }, four: ([]uint8) (len=4 cap=4) { 00000000 0a 0a 69 6d |..im| }}\n  And we&#39;re stuck with that &#34;allocate on every read&#34; design, because we have no idea how long a caller might hold on to the slices we return. Theymight hold on to it long after our  AltReader-implementing type getsgarbage-collected.\n But  io.Reader does not have that problem. By taking a single []byte argument, it solves both these requirements:\n  And if we change our example to just use  io.Reader, we can see thateverything works fine:\n package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;os&#34;\t &#34;github.com/davecgh/go-spew/spew&#34;) func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t fc  :=  readFourChunks( f)\t spew. Dump( fc)} type  FourChunks  struct {\t one [] byte\t two [] byte\t three [] byte\t four [] byte} func  readFourChunks( r io. Reader)  FourChunks {\t mustRead  :=  func( p [] byte) [] byte {\t\t _,  err  :=  io. ReadFull( r,  p)\t\t if  err  !=  nil {\t\t\t log. Fatalf( &#34;could not read: %+v&#34;,  err)\t\t}\t\t return  p\t}\t return  FourChunks{\t\t one:  mustRead( make([] byte, 4)),\t\t two:  mustRead( make([] byte, 4)),\t\t three:  mustRead( make([] byte, 4)),\t\t four:  mustRead( make([] byte, 4)),\t}}\n $ go run main.go(main.FourChunks) { one: ([]uint8) (len=4 cap=4) { 00000000 70 61 63 6b |pack| }, two: ([]uint8) (len=4 cap=4) { 00000000 61 67 65 20 |age | }, three: ([]uint8) (len=4 cap=4) { 00000000 6d 61 69 6e |main| }, four: ([]uint8) (len=4 cap=4) { 00000000 0a 0a 69 6d |..im| }}\n  package main import (\t &#34;io&#34;\t &#34;log&#34;\t &#34;os&#34;\t &#34;github.com/davecgh/go-spew/spew&#34;) func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t readFourTimes( f)} func  readFourTimes( r io. Reader) {\t buf  :=  make([] byte, 4)\t for  i  := 0;  i  &lt; 4;  i ++ {\t\t _,  err  :=  io. ReadFull( r,  buf)\t\t if  err  !=  nil {\t\t\t log. Fatalf( &#34;could not read: %+v&#34;,  err)\t\t}\t\t spew. Dump( buf)\t}}\n Hell, we can even have it read to the middle of a buffer if we want:\n func  main() {\t log. SetFlags( log. Lshortfile)\t f,  err  :=  os. Open( &#34;main.go&#34;)\t if  err  !=  nil {\t\t log. Fatalf( &#34;%+v&#34;,  err)\t}\t readToMiddle( f)} func  readToMiddle( r io. Reader) {\t buf  := [] byte( &#34;..............................&#34;)\t _,  err  :=  io. ReadFull( r,  buf[8:20])\t if  err  !=  nil {\t\t log. Fatalf( &#34;could not read: %+v&#34;,  err)\t}\t spew. Dump( buf)}\n $ go run main.go([]uint8) (len=30 cap=30) { 00000000 2e 2e 2e 2e 2e 2e 2e 2e 70 61 63 6b 61 67 65 20 |........package | 00000010 6d 61 69 6e 2e 2e 2e 2e 2e 2e 2e 2e 2e 2e |main..........|}\n At this point, I think it&#39;s fair to say that  io.Reader is a better design.\n   I haven&#39;t presented the  full  io.Reader interface - only its functionsignature. And unfortunately, that is not enough to specify the interfacecompletely.\n Anytime the interface&#39;s signature itself is not enough to infer itsbehavior, there is trouble on the horizon.\n Imagine a fire alarm that you can pull up or down. If you pull it up - thealarm goes off, people evacuate, everything is fine.\n  Sure, eventually people will figure it out - they&#39;ll pull it down, see thatnothing happens, be confused for a few seconds, then try pulling it up. Ormaybe they won&#39;t, and assume it&#39;s broken.\n Unless of course the person pulling the alarm can&#39;t hear anything. And maybethe building management could be convinced that this is a potential problem,and that something should be done about it.\n And instead of replacing the alarm, they set up employee training. &#34;All thefire alarms must be pulled  down, not up - no, wait, the other way around&#34;.\n They haven&#39;t fixed the root of the issue. This is a band-aid, at most. Anyonewho hasn&#39;t yet attended training, such as a new hire, is a potential dangerto the building.\n Now, cool bear, you know that analogy isn&#39;t going to work for everyone. I cansee the comments from here...\n  Nevermind - anyway, let&#39;s be fair here: not  everything is fixable.Sometimes you just gotta slap a notice on the wall that says &#34;don&#39;t poke thebear&#34;, because there&#39;s a good reason for there to be a bear there.\n  Anyway - the point I was making is that we haven&#39;t yet discussedthe full  io.Reader interface.\n Even though it&#39;s just one function, there&#39;s a bunch of moving parts.First off, this is Go, and in Go, you don&#39;t have tuples, and you don&#39;thave a  Result&lt;T&gt; type, and you don&#39;t have exception handling - youhave multi-valued return.\n The problem - one of the problems - with multi-valued return is thatnobody complains about stuff like this:\n package main import (\t &#34;log&#34;\t &#34;os&#34;\t &#34;github.com/davecgh/go-spew/spew&#34;) func  main() {\t log. SetFlags( log. Lshortfile)\t // this is obviously a bad idea\t f,  _  :=  os. Open( &#34;woops&#34;)\t buf  :=  make([] byte, 32)\t // and so is this\t n,  _  :=  f. Read( buf)\t spew. Dump( buf[: n])}\n The compiler doesn&#39;t complain,  go vet doesn&#39;t complain, none ofthe 51 linters that  golangci-lint runs complain.\n  Of course they don&#39;t complain, you&#39;re thinking,  you just told themto shut up by using  _!\n   The way to be lazy about error handling in languages that supportexceptions is to just... do nothing.\n // @ts-check const  { readFile  }  =  require ( &#34;fs&#34; ) . promises ; async  function  main ( )  {  const  contents  =  await  readFile ( &#34;woops&#34; ,  {  encoding:  &#34;utf-8&#34;  } ) ;  console . log ( `Just read a file:  ${ contents . slice (0 , 20 ) }...` ) ; } main ( ) ;\n The  woops file does not exist, and we definitely haven&#39;t spent any timethinking about error handling, and so, it brings down the whole program:\n $ node --unhandled-rejections=strict main.jsinternal/process/promises.js:194 triggerUncaughtException(err, true /* fromPromise */); ^[Error: ENOENT: no such file or directory, open &#39;C:\\msys64\\home\\amos\\go\\aac\\woops&#39;] { errno: -4058, code: &#39;ENOENT&#39;, syscall: &#39;open&#39;, path: &#39;C:\\\\msys64\\\\home\\\\amos\\\\go\\\\aac\\\\woops&#39;}\n  import  java. io. BufferedReader; import  java. io. FileInputStream; import  java. io. InputStreamReader; import  java. nio. CharBuffer; public  class  Main {  public  static  void  main( String  args[])  throws  java. lang. Exception {  BufferedReader  reader =  new  BufferedReader ( new  InputStreamReader( new  FileInputStream( &#34;woops&#34;),  &#34;UTF-8&#34;));  CharBuffer  buf =  CharBuffer. allocate(32);  reader. read( buf);  reader. close();  System. out. println( &#34;Just read a file: &#34; +  buf. toString()); }}\n $ javac Main.java &amp;&amp; java MainException in thread &#34;main&#34; java.io.FileNotFoundException: woops (The system cannot find the file specified) at java.base/java.io.FileInputStream.open0(Native Method) at java.base/java.io.FileInputStream.open(FileInputStream.java:219) at java.base/java.io.FileInputStream.&lt;init&gt;(FileInputStream.java:157) at java.base/java.io.FileInputStream.&lt;init&gt;(FileInputStream.java:112) at Main.main(Main.java:8)\n   $ python main.pyTraceback (most recent call last): File &#34;main.py&#34;, line 2, in &lt;module&gt; file = open(&#34;woops&#34;, &#34;r&#34;)FileNotFoundError: [Errno 2] No such file or directory: &#39;woops&#39;\n    #define  _CRT_SECURE_NO_WARNINGS #include  &lt;stdio.h&gt; #include  &lt;stdlib.h&gt; int  main( int  argc,  char  * * argv) {  FILE  * f =  fopen( &#34;woops&#34;,  &#34;r&#34;);  const  size_t  len = 32;  // (!) gratuitious use of sizeof to convey intent  // the author realizes sizeof(char) is just 1.  char  * buf =  calloc( len,  sizeof( char));  fread( buf,  sizeof( char),  len,  f);  printf( &#34;Just read part of a file: %.*s\\n&#34;, ( int)  len,  buf);  return 0;}\n     $ lldb ./main(lldb) target create &#34;./main&#34;Current executable set to &#39;./main&#39; (x86_64).(lldb) rProcess 14644 launched: &#39;C:\\msys64\\home\\amos\\go\\aac\\main&#39; (x86_64)Process 14644 stopped* thread #1, stop reason = Exception 0xc0000409 encountered at address 0x7ff6f10c6378 frame #0: 0x00007ff6f10c6378 main-&gt; 0x7ff6f10c6378: int $0x29 0x7ff6f10c637a: movl $0x1, %r8d 0x7ff6f10c6380: movl $0xc0000417, %edx ; imm = 0xC0000417 0x7ff6f10c6385: leal 0x1(%r8), %ecx\n   I did  much more than just a few underscores. I hid some veryinteresting warnings on purpose.\n  $ clang main.c -o mainmain.c:5:13: warning: &#39;fopen&#39; is deprecated: This function or variable may be unsafe. Consider using fopen_s instead. To disable deprecation, use _CRT_SECURE_NO_WARNINGS. See online help for details. [-Wdeprecated-declarations] FILE *f = fopen(&#34;woops&#34;, &#34;r&#34;); ^C:\\Program Files (x86)\\Windows Kits\\10\\Include\\10.0.18362.0\\ucrt\\stdio.h:207:20: note: &#39;fopen&#39; has been explicitly marked deprecated here _Check_return_ _CRT_INSECURE_DEPRECATE(fopen_s) ^D:\\Programs\\Microsoft Visual Studio\\2019\\Community\\VC\\Tools\\MSVC\\14.26.28801\\include\\vcruntime.h:316:55: note: expanded from macro &#39;_CRT_INSECURE_DEPRECATE&#39; #define _CRT_INSECURE_DEPRECATE(_Replacement) _CRT_DEPRECATE_TEXT( \\ ^D:\\Programs\\Microsoft Visual Studio\\2019\\Community\\VC\\Tools\\MSVC\\14.26.28801\\include\\vcruntime.h:306:47: note: expanded from macro &#39;_CRT_DEPRECATE_TEXT&#39;#define _CRT_DEPRECATE_TEXT(_Text) __declspec(deprecated(_Text)) ^1 warning generated.\n  #include  &lt;stdio.h&gt; #include  &lt;stdlib.h&gt; int  main( int  argc,  char  * * argv) {  FILE  * f;  fopen_s( &amp; f,  &#34;woops&#34;,  &#34;r&#34;);\t // etc.  return 0;}\n And then.. there&#39;s no other warning. Except, Microsoft (I&#39;m writing thison Windows) has developed an annotation language for C.\n  _Check_return_wat_  _ACRTIMP  errno_t  __cdecl  fopen_s(  _Outptr_result_maybenull_  FILE * *  _Stream,  _In_z_  char  const *  _FileName,  _In_z_  char  const *  _Mode );\n   (This is run in PowerShell, by the way - I usually run shell sessionsin  msys2).\n  $ cl.exe /nologo /analyze main.cmain.cC:\\msys64\\home\\amos\\go\\aac\\main.c(8) : warning C6031: Return value ignored: &#39;fopen_s&#39;.C:\\msys64\\home\\amos\\go\\aac\\main.c(14) : warning C6387: &#39;buf&#39; could be &#39;0&#39;: this does not adhere to the s\n......", "posttime": "2020-06-28 21:48:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抽象,abstracting,main", "title": "抽象出正确性", "title_en": "Abstracting Away Correctness", "transed": 1, "url": "https://fasterthanli.me/articles/abstracting-away-correctness", "via": "", "real_tags": ["抽象", "main"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章将是一个偶然的、反复出现的系列文章中的第一篇，这些文章指出了Unicode中鲜为人知的历史人物故事。\n这个字是U+213a，大写Q旋转，它是一个逆时针旋转90°的大写Q。它用Unicode编码在类字母符号块中，根据Unicode注释，它是一个有约束力的签名标记。&#34；\n我确信我不是唯一一个不知道这是什么意思的人。\n对该字符进行编码的直接原因是需要为ISO 5426-2：1996“信息和文件--书目信息交换用拉丁字母编码字符集的扩展--第2部分：欧洲次要语言中使用的拉丁字符和过时的排版”中的编码字符提供往返映射。\n横排的Q不能与任何现有的字符统一，因此被编码为新字符。\n装订签名标记是出版商在用于装订的签名(又名集锦--以8页、12页、16页、24页或32页为单位打印和折叠的纸张)边缘放置的标记。\n有相当多的这样的标志，在某种程度上可以被认为是出版商的标志，除了他们中的许多人利用他们的打印机中提供的奇怪的符号。\n因为它们的特殊用法不是常规文本的一部分，所以没有特别需要对更多的它们进行分类并将它们编码为字符。\n然而，轮换的大写字母Q作为映射项目的一部分进入，以帮助ISOTC46脱离开发和维护字符编码标准的业务，独立于ISOJTC1/SC2/WG2中正在进行的开发ISO/IEC 10646的工作。\n现在您就知道了--字符的编码是为了与另一个标准兼容，我们希望帮助它转移到其他方面，而不是保持字符编码独立于Unicode。这是一种必要的税，我们有时不得不为拥有通用的字符编码标准而支付。\n本文由&#34；℺&#34；(U+213a，又名。旋转大写q)(除非您有像Code2000这样的包含该字符的字体，否则您可能看不到该字符)", "note_en": "This article will be the first in an occasional recurring series of articles that point out little-known historical character stories in Unicode.\n The character in question is U+213a, ROTATED CAPITAL Q. It is a Capital Q turned 90° counter-clockwise. It is encoded in the  Letterlike Symbols block in Unicode, and according to the Unicode annotation, it is &#34;a binding signature mark.&#34;\n I am sure I am not the only one who had no flipping clue what that means.\n  The proximate cause for the encoding of this character was the need to provide roundtrip mapping for encoded characters in ISO 5426-2:1996, Information and documentation -- Extension of the Latin alphabet coded character set for bibliographic information interchange -- Part 2: Latin characters used in minor European languages and obsolete typography.\n     The sideways Q could not be unified with any existing character, and so was encoded as a new character.\n Binding signature marks are marks placed by publishers on the edges of signatures (aka &#34;gatherings&#34; -- printed and folded sheets in units of 8, 12, 16, 24, or 32 pages) for book binding.\n There are a rather large number of these, which could be considered publisher logos, in a way, except that many of them make use of odd symbols available in their printers&#39; type sets.\n There is no particular need to go out and catalog more of them and encode them as characters, because of their peculiar usage not part of regular text.\n However, the ROTATED CAPITAL Q got in as part of the mapping project to help get ISO TC46 out of the business of developing and maintaining character encoding standards independently of the ongoing work in ISO JTC1/SC2/WG2 to develop ISO/IEC 10646.\n There you have it -- the character was encoded for compatibility with another standard that we wanted to help move on to other things and not keep encoding characters independent of Unicode. A necessary tax that we sometimes have to pay for having a universal character encoding standard.\n This post brought to you by &#34; ℺&#34;  (U+213a, a.k.a. ROTATED CAPITAL Q)  (You may not be able to see this character unless you have a font like Code2000 that contains it)", "posttime": "2020-06-28 21:26:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "角色,character,字符", "title": "每个角色都有一个故事：U+213a(旋转Q)(2005)", "title_en": "Every character has a story: U+213a (rotated Q) (2005)", "transed": 1, "url": "https://web.archive.org/web/20060909235709/http://blogs.msdn.com/michkap/archive/2005/01/10/349769.aspx", "via": "", "real_tags": ["角色", "character", "字符"]}, {"category": "", "categoryclass": "", "imagename": "34ca74d95808231013233c451155ba12.jpeg", "infoid": 1008718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DDoS攻击是一种拒绝服务(DoS)攻击，在这种攻击中，受损系统的网络被用来瞄准单个设备、应用程序或网络，以使其无法向用户提供服务。\nAkamai刚刚宣布，他们检测到并阻止了可能是DDoS攻击史上最大的每秒数据包数之一的DDoS攻击。\nAkamai补充说，他们接收并阻止了每秒高达8.09亿个数据包的巨大数据包洪流。\nAkamai无法确定攻击背后的原因(即利用DDoS分散注意力)，但安全团队表示，有问题的银行通常会不断面临此类DDoS攻击，因此这可能只是一次新的(也是最大的)尝试使服务离线。\n对Akamai的研究人员来说，奇怪的是攻击是如何如此迅速地开始和结束(或减轻)的。\nAkamai说：“攻击在几秒钟内从正常的流量水平增长到418Gbps，然后在大约两分钟内达到809Mpps的峰值。”“总体而言，袭击持续了不到10分钟。”\n尽管AWS在5月份声称它缓解了针对目标的2.3Tbps洪水，但Akamai仍然声称它阻止了更大的攻击，就每秒数据包数而言。\n这次攻击不仅流量很大，而且攻击来源也很庞大。攻击背后的僵尸网络牧羊人控制着大量受感染的电脑，其中许多电脑有史以来第一次被用作DDoS攻击的一部分。\n这些DDoS攻击将继续发生，您能做些什么来防止它们或保持保护？\n有了良好而安全的VPN，您的所有互联网活动都通过安全隧道进行路由，从而隐藏您的IP，使其免受任何类型的入侵。攻击者将只能看到VPN的IP地址，而看不到您的IP地址，因此，他们将无法攻击您的网络。\n内容交付网络通过吸收大量信息来缓解DoS或DDoS攻击的迹象。在受到攻击的情况下，所有流量都会被CDN庞大的服务器系统所吸收，因此它永远不会到达您的手中。\n使用CDN不仅可以保护您的站点免受巨大流量的冲击，还可以提高页面加载速度。\n通过利用强大的防火墙，您可以阻止不需要的系统访问，并保护您免受我们前面提到的各种类型的DDoS攻击。防火墙是保护您的网站或游戏服务器的主要防线，因为它们可以防止未经批准的访问。\n我们建议选择代理防火墙框架，因为它们作为系统之间的中介者，使得DdoSer很难攻击您。\n是的，DDoS攻击可能会对您的网络造成很大的破坏，但通过使用这些预防措施，您可以避免受到大量流量泛滥的攻击。", "note_en": "A DDoS attack is a type of denial of service (DoS) attack where a network of compromised systems are used to target a single device, application, or network to disable it from providing services to users.\n  Akamai just announced that they detected and blocked what may be one of the largest DDoS attack in the history of DDos Attacks in terms of packets per second.\n Akamai added that they recieved and blocked a huge flood of packets recorded upto 809 Million packets per second.\n Akamai could not identify the reason behind the attack (ie, to use the DDoS as a distraction) but the security team stated that the bank in question usually keeps facing these kind of DDoS attacks, so it might just be a new (and biggest) of a number of attempts to make the service offline.\n What seemed weird to the Akamai researchers was how the attack started and ended (or was mitigated) such rapidly.\n “The attack grew from normal traffic levels to 418Gbps in seconds, before reaching its peak size of 809Mpps in approximately two minutes,” Akamai said. “In total, the attack lasted slightly less than 10 minutes.”\n Although,  AWS claimed in May it mitigated a 2.3 Tbps flood against a target, Akamai still claims that it stopped a bigger attack, in terms of packets per second.\n The attack was not only large in terms of traffic, but the source of the attack was also huge. The botnet wrangler behind the attack was in command of a huge amount of infected PCs, many of them being utilized as part of a DDoS attack for the first time ever.\n These DDoS attacks will keep on happening, what can you do to prevent them or stay protected?\n  With a good and  secure VPN, all your Internet activity is routed through a secure tunnel, hiding your IP from any kind of intrusion. An attacker will only be able to see the IP address of a VPN and not yours, thus, they will not be able to attack your network.\n  Content delivery networks ease the indications of a DoS or DDoS assault by absorbing a lot of information. In case of an assault, all the traffic is absorbed by the CDN’s broad system of servers so it never gets to you.\n Utilizing a CDN won’t just secure your site against huge floods of traffic but also increase the speed of your page loading times as well.\n  By utilizing a powerful firewall, you can stop undesirable system access and remain shielded from the various kinds of DDoS assaults we’ve referenced previously. Firewalls are the main line of protection for your website or gaming server as they prevent unapproved access.\n We’d suggest picking aproxy firewall framework as they go about as mediators between systems, making it hard for a DDoSer to assault you.\n Yes, DDoS attacks can be very damaging to your network, but with the use of these preventive measures, you can avoid getting attacked with huge amounts of traffic floods.", "posttime": "2020-06-28 21:24:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阻止,blocked,攻击", "title": "Akamai刚刚阻止了历史上最大的DDoS攻击", "title_en": "Akamai just blocked the biggest DDoS attack in the history", "transed": 1, "url": "https://medium.com/@lucyhales/the-biggest-ddos-attack-in-the-history-6ecdc7d3377b", "via": "", "real_tags": ["阻止", "blocked", "攻击"]}]