[{"category": "", "categoryclass": "", "imagename": "49fcde80f52093ec71d71b7e48daa0ba.jpeg", "infoid": 1007806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于所有awk都不能读取二进制文件，因此您首先需要通过十六进制转储示例(请参阅run.sh)来传输类文件：javac Add.java&amp；&amp；hexdump-v-e&#39；/1&#34；%01u&#34；&#39；Add.class|awk-f jvm.awk", "note_en": "since none of the awks can read binary, you first need to pipe the classfile through hexdump example (see run.sh):  javac Add.java &amp;&amp; hexdump -v -e &#39;/1 &#34;%01u &#34;&#39; Add.class | awk -f jvm.awk", "posttime": "2020-06-23 23:07:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jvm,文件", "title": "AWK-JVM是AWK中的一个玩具JVM", "title_en": "Awk-JVM is a toy JVM in Awk", "transed": 1, "url": "https://github.com/rethab/awk-jvm", "via": "", "real_tags": ["jvm", "文件"]}, {"category": "", "categoryclass": "", "imagename": "43cee65ff2d79fa792d622a6ad831930.jpg", "infoid": 1007805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "水力侵蚀是水随时间改变地形的过程。这主要是由降雨造成的，但也有海浪撞击海岸和河流流动造成的。图1显示了一条小溪对其周围岩石环境产生的相当大的影响。在创建逼真的环境时，需要考虑侵蚀的影响。我以前曾尝试过程序地形生成，以生成分层体素渲染的场景，并演示立方体噪波。这些地形是非常基本的，没有考虑到侵蚀。因此，他们缺乏很多细节，使他们在仔细检查时是不现实的。\n在这篇文章中，我将详细介绍一种简单而快速的方法，它近似于水力侵蚀的影响。这种方法的目的是创造可信的环境，而不是达到高度的现实主义。只要结果看起来很自然，为了速度，忠诚度可能会被牺牲。综上所述，该方法应做到以下几点：\n当涉及到模拟侵蚀时，有几种不同的方法。所有的方法都模拟了相同的现象：水从高处流向低处，在流动的过程中侵蚀地形，在沿着自己的路径进一步前进时沉积沉积物。这一过程总是导致一些可识别的地形特征，如河流流经的沟壑和山谷，河流与目的地汇合的三角洲，以及小溪汇合成大河的冲积扇。在阅读有关此主题的文章时，我在研究文献中遇到了以下不同的策略：\n侵蚀是通过跟踪地形上每个位置的水的位置来模拟的。为环境创建网格(或二维数组)，并保持每个单元的水位和压力。更新时，压力决定水流向何处。流动时，水会移动沉积物。\n侵蚀是通过在地形上投放许多模拟雨滴的粒子来模拟的。然后粒子沿着地形的坡度移动。他们可以随身携带沉淀物，也可以将其沉淀。\n主要出于性能原因，我选择实现基于Drop的方法。因为大多数水滴不会流得很远，所以许多不活跃的水滴模拟可以提前终止，并且大部分处理能力将流向实际绘制出地形特征的水滴。对于每个更新周期，基于网格的模拟将需要模拟地形上的每个部分。\n模拟中的水滴可以被视为雪球，而不是雨滴。在模拟的背景下，我认为这是一个更好的类比。雪球在落下时开始很小，但当它们滚下山坡时就会获得更多的物质。当它们变得太大时，它们就开始边走边脱落。当它们停止在山谷或海洋中滚动时，雪球就会碎裂，并将它们的物质留在地形上。\n完整的侵蚀算法(在Javascript中)可以在下面阅读。此代码使用heightMap对象进行侵蚀。此高度贴图可以读取和写入，并且sampleNormal函数可用于获取曲面法线。这是从地形向上指向的3D矢量，因此可用于确定坡度方向和陡度。\n/*让雪球侵蚀高度图*@param{number}x X坐标开始于*@param{number}y Y坐标开始于*/trace=function(x，y){const ox=(随机性.getFloat()*2-1)*半径；//X偏移量常数y=(随机性.getFloat()*2-1)*半径；//Y偏移量让沉淀物=0；//携带沉淀物的量让xp=。//上一个Y位置设vx=0；//水平速度设vy=0；//(设i=0；i&lt；maxIterations；++i){//获取当前位置地形的表面法线const faceNormal=heightMap.sampleNormal(x+ox，y+oy)；//如果地形平坦，停止模拟，如果(faces eNormal.y=1)破裂，雪球不能继续滚动。常量侵蚀=侵蚀率*(1-faceNormal.y)*Math.min(1，i*iterationScale)；//更改此雪球来源地的沉积物Map.change(xp，yp，沉积-侵蚀)；沉积物+=侵蚀-沉积；vx=摩擦*vx+faceNormal.x*速度；vy=摩擦*vy+faceNormal.z*速度；xp=x；yp=y；x+=vx；y+=vy。++i)trace(随机性.getFloat()*width，随机性.getFloat()*Height)；//模糊高度贴图以平滑效果sheightMap.blur()；\n变量ox和oy编码雪球的偏移量。它们用来读取具有一定偏移量的地形坡度，使雪球运动变得更粗糙，从而防止雪球路径过于收敛。\n当曲面法线完全向上指向时(当该法线的y值等于1时)，雪球就会终止。在实践中，这意味着已经到达模拟边缘的雪球或海底停止模拟那里。因为这些区域什么都不会发生，所以模拟侵蚀将是对处理能力的浪费。\n更改沉淀量时，雪球将在其先前位置而不是当前位置编辑高度贴图。侵蚀和沉积发生在它的后面，以防止雪球自己挖进去。\n模拟侵蚀后，将高斯模糊应用于高度贴图。由于这些示例中的高度贴图的分辨率较低，因此需要模糊来保持曲面足够平滑，以便在视觉上具有吸引力。\n由于偏移量是在侵蚀时使用的，而且腐蚀率相当高，因此每个跟踪的雪球对地形的影响比看起来更像雨滴的较小节点对地形的影响更大。这会导致快速模拟，但会降低精度。\n将上述算法应用于不同的雪球计数，结果如图3所示。该算法在浏览器中运行，源代码可以在GitHub上找到。按空格键将生成一个新孤岛。算法的起始材质显示在图3的第一张图片中。这个岛的形状是使用与我在分层体素渲染示例地形中使用的算法非常相似的算法生成的。虽然这个形状确实包含了一些细节和山脊，但它非常光滑，没有水力侵蚀的痕迹。\n第二张图片显示了在同一个岛上投下了35.000个雪球。它们被随机、均匀地投放。由于起始形状的随机初始条件，形成了山谷和类似河流的结构，雪球在那里找到了到达大海的最快途径。35.000看起来可能是一个很高的数字，但请记住，到达海底或地图边缘的雪球会提前终止。大多数水滴不会落在岛上，所以只有一小部分水滴实际上会从图中可以看到的山谷中滚落下来。\n第三张图片显示了掉下50.000个雪球后的同一个岛。与上图相比，没有新的细节形式，尽管地形特征更加明显。\n最后一张图片显示了掉下100.000个雪球后的小岛。这显然太多了；山脊变得非常深，海岸非常崎岖。在这一点上，结果也开始看起来不太现实。这些山谷刻出了非常尖锐的地形地貌，这些地貌会自我侵蚀。\n上图中的所有孤岛都可以在我的台式计算机上半秒内生成，算法在单个CPU线程上运行。因此，在大多数应用程序中，出于性能原因没有必要减少滚雪球的数量。就目前而言，该算法已经足够快了。\n该算法提供了一种快速逼近水力侵蚀的方法。虽然现实主义不是优先考虑的，但当在不同的地形上测试该方法时，人们预期的侵蚀和沉积模式确实会出现。\n由于代码运行速度非常快(与文献中可以找到的大多数替代解决方案相反)，因此它可能适用于游戏中的过程性地形生成等应用程序。在这些应用程序中，希望快速产生结果，而结果不需要非常现实；它们只需要看起来可信即可。\n该方法可推广应用于河床路径跟踪。许多雪球滚滚而过的山谷实际上是河流。当一个区域达到一定的滚雪球流量阈值时，就可以在那里形成一条河流或湖泊。\n另一个有趣的补充是一个纹理，它可以跟踪地形上材料的侵蚀和沉积的量。然后这些数据可以用来给地形上色；如果沉积了大量的材料，沙子和小颗粒就会在那里堆积。几乎没有发生侵蚀的地区将看起来与严重侵蚀的斜坡不同。\n该动画示例包含朝向岛屿海岸移动的波浪。除了澄清海岸的形状外，它们并没有真正起到防止侵蚀的作用，但它使场景更漂亮了。\n首先，在岛屿海岸周围创建一张沃罗诺伊图。不是从点创建关系图，而是从形状创建关系图。岛上不在海平面以下的每一部分基本上都是沃罗诺伊图上的一个点。这篇博文解释了用于在GPU上生成Voronoi图的跳跃泛洪算法；这篇博客还解释了在构建图时使用形状而不仅仅是点。\n创建Voronoi图后，图中的数据用于创建纹理，存储每个像素到最近岸点的距离和方向。图4显示红色和绿色通道用于存储方向矢量。矢量的大小编码了到海岸的距离，那里的黑色区域离海岸最远。\n创建正弦波来表示全局波形模式。正弦波中的位置由朝向最近岸点的方向确定，并且波慢慢地朝向岸边移动。如果波浪是三维的，则可以使用朝向最近岸点的方向来计算波浪形状的表面法线。\n最后，波浪被风格化，波浪图案被稍微分解，以给人一种所有波浪都是它们自己的实体的印象。", "note_en": "Hydraulic erosion is the process by which water transforms terrain over time. This is mostly caused by rainfall, but also by ocean waves hitting the shore and the flow of rivers. Figure 1 shows the considerable effects that a small stream has had on the rocky environment around it. When creating realistically looking environments, the effects of erosion need to be accounted for. I have experimented with procedural terrain generation before to generate scenes for  layered voxel rendering and to demonstrate  cubic noise. These terrains were very basic and did not account for erosion. Therefore, they lack a lot of detail, making them unrealistic at closer inspection.\n  In this article, I will detail a simple and fast method that approximates the effects of hydraulic erosion. The aim of this method is to create believable environments rather than reaching a high degree of realism. Fidelity may be sacrificed for the sake of speed, as long as the results look natural. Summarized, the method should do the following:\n   There are several different approaches when it comes to simulating erosion. All methods simulate the same phenomenon: water moving from high places to low places, eroding terrain as it flows, and depositing sediment as they go further down their paths. This process always results in a number of recognizable terrain features like gulleys and valleys where rivers flow, deltas where they meet their destination and  alluvial fans where smaller streams combine into bigger rivers. While reading about this topic, I have encountered the following distinct strategies in research literature:\n Erosion is simulated by keeping track of where water is for every position on the terrain. A grid (or 2D array) is created for the environment, and water levels and pressures are kept for every cell. When updating, the pressures determine where the water flows to. While flowing, water moves sediment around.\n Erosion is simulated by dropping many particles simulating raindrops on the terrain. The particles then move down the slopes of the terrain. They can bring sediment with them or deposit it.\n  Mostly for performance reasons, I&#39;ve chosen to implement a drop based method. Because most drops don&#39;t flow very far, many inactive drop simulations can be terminated early and the bulk of the processing power will go to the drops that actually carve out terrain features. The grid based simulation will need to simulate every part on the terrain for every update cycle.\n  The drops in the simulation can be seen as  snowballs instead of raindrops. Within the context of the simulation, I believe this is a better analogy. The snowballs start small when they are dropped, but gain more material as they roll down the hills. When they become too big, they start shedding material as they go. When they stop rolling in valleys or in the sea, the snowballs fall apart and leave their material on the terrain.\n The complete erosion algorithm (in  Javascript) can be read below. This code uses a  heightMap object to erode. This height map can be read from and written to, and the  sampleNormal function can be used to get the surface normal. This is a 3D vector pointing upwards from the terrain, so it can be used to determine the slope direction and steepness.\n /** * Let a snowball erode the height map * @param {Number} x The X coordinate to start at * @param {Number} y The Y coordinate to start at */trace = function(x, y) { const ox = (random.getFloat() * 2 - 1) * radius; // The X offset const oy = (random.getFloat() * 2 - 1) * radius; // The Y offset let sediment = 0; // The amount of carried sediment let xp = x; // The previous X position let yp = y; // The previous Y position let vx = 0; // The horizontal velocity let vy = 0; // The vertical velocity for (let i = 0; i &lt; maxIterations; ++i) { // Get the surface normal of the terrain at the current location const surfaceNormal = heightMap.sampleNormal(x + ox, y + oy); // If the terrain is flat, stop simulating, the snowball cannot roll any further if (surfaceNormal.y === 1) break; // Calculate the deposition and erosion rate const deposit = sediment * depositionRate * surfaceNormal.y; const erosion = erosionRate * (1 - surfaceNormal.y) * Math.min(1, i * iterationScale); // Change the sediment on the place this snowball came from heightMap.change(xp, yp, deposit - erosion); sediment += erosion - deposit; vx = friction * vx + surfaceNormal.x * speed; vy = friction * vy + surfaceNormal.z * speed; xp = x; yp = y; x += vx; y += vy; }};// Simulate 50000 snowballsconst snowballs = 50000;for (let i = 0; i &lt; snowballs; ++i) trace( random.getFloat() * width, random.getFloat() * height);// Blur the height map to smooth out the effectsheightMap.blur();\n  The variables  ox and  oy encode the  offset of a snowball. They are used to read the terrain slope with a certain offset to make the snowball motion a bit rougher, which prevents snowball paths from converging too much.\n When the surface normal points perfectly upwards (when the y value of that normal equals one), the snowball terminates. In practice, this means that snowballs that have reached the edge of the simulated are or the sea floor stop simulating there. Because nothing happens in those areas, simulating erosion would be a waste of processing power.\n When changing the amount of sediment, the snowball edits the height map at its previous position instead of its current position. Erosion and deposition take place behind it to prevent snowballs from digging themselves in.\n After simulating erosion, gaussian blur is applied to the height map. Because the height map in these examples has a low resolution, blur is required to keep the surfaces smooth enough to be visually appealing.\n Because the offset is used while eroding, and because the erosion rate is quite high, every traced snowball has a larger influence on the terrain than a smaller node that looks more like a raindrop would. This results in a fast simulation, but it reduces precision.\n   Applying the algorithm above with varying snowball counts gives the results rendered in Figure 3. The algorithm  works in a browser, and the source code can be found  on GitHub. Pressing the space bar generates a new island. The &#34;starting material&#34; for the algorithm is shown in the first image of figure 3. This island shape was generated using a very similar algorithm to the one I used in  my layered voxel rendering example terrains. While the shape does contain some details and ridges, it is very smooth and contains no traces of hydraulic erosion.\n The second image shows the same island after dropping 35.000 snowballs on it. They are dropped randomly and evenly spaced. Because of the random initial conditions of the starting shape, valleys and river like structures form where the snowballs find the quickest way to the sea. 35.000 may seem like a high number, but recall that snowballs that reach the sea floor or the edge of the map terminate early. The majority of drops don&#39;t fall on the island, so only a small number will actualy roll down one of the valleys that can be seen in the image.\n The third image shows the same island after dropping 50.000 snowballs. Compared to the previous image, no new details form, although the terrain features are more pronounced.\n The last image shows the island after dropping 100.000 snowballs. This is clearly too much; the ridges become very deep and the shore is very rough. At this point, the results start looking less realistic too. The valleys carve out very sharp terrain features that would erode away themselves.\n All islands in the images above can be generated within half a second on my desktop computer, with the algorithm running on a single CPU thread. Therefore, it is not necessary to reduce the number of snowballs for performance reasons in most applications. The algorithm is fast enough as it is.\n  The proposed algorithm provides a fast method to approximate hydraulic erosion. While realism was no priority, erosion and deposition patterns that one would expect do show up when testing the method on various terrains.\n Because the code runs very fast (contrary to most alternative solutions that can be found in the literature), it may be suitable for applications like procedural terrain generation in games. In those applications, it is desirable to produce results quickly, while the results do not need to be very realistic; they just need to look credible.\n The method can be extended to track the paths of river beds. Valleys where many snowballs roll through would realistically be rivers. When an area reaches a certain threshold of &#34;snowball traffic&#34;, a river or lake can be created there.\n Another interesting addition would be a texture that keeps track of the amount of erosion and deposition of material on the terrain. This data can then be used to color the terrain; if lots of material is deposited, sand and small particles will accumulate there. Areas where little erosion has taken place will look different from heavily eroded slopes.\n   The  animated example contains waves that move towards the shore of the islands. Besides clarifying the shape of the shore, they don&#39;t really serve a purpose with regards to the erosion, but it makes the scene prettier.\n  First, a   Voronoi diagram is created around the island shore. Instead of creating a diagram from points, the diagram is created from shapes. Every part of the island that is not under sea level is essentially a point in the Voronoi diagram.  This blog post explains the  jump flooding algorithm which was used to generate the Voronoi diagram on the GPU; this blog also explains the use of shapes instead of just points when constructing a diagram.\n After the Voronoi diagram has been created, the data in the diagram is used to create a texture storing the distance and direction to the nearest shore point for every pixel. Figure 4 shows that the red and green channels are used to store the direction vector. The magnitude of that vector encodes the distance to the shore, where the black areas are the furthest away from the shore.\n A sine wave is created to represent the global wave pattern. The position in the sine wave is determined by the direction towards the nearest shore point, and the wave slowly shifts towards the shore. The direction towards the nearest shore point can be used to calculate the surface normals of the wave shape, if the waves are three dimensional.\n Finally, the waves are stylized, and the wave patterns are broken up a bit to give the impressions that all waves are their own entities.", "posttime": "2020-06-23 23:07:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "水力,hydraulic,侵蚀", "title": "模拟水力冲刷", "title_en": "Simulating Hydraulic Erosion", "transed": 1, "url": "https://jobtalle.com/simulating_hydraulic_erosion.html", "via": "", "real_tags": ["水力", "hydraulic", "侵蚀"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们依赖您的支持：您知道吗，Phoronix上每个月写的数百篇文章大多是由一个人在疯狂的工作时间撰写的？Phoronix.com没有一个拥有无限资源的整个新闻编辑室，它依赖于人们阅读我们的内容而不屏蔽广告，或者通过订阅Phoronix Premium来获得我们的无广告服务和其他额外功能。你也可以考虑通过贝宝支付小费。戴尔今天上午宣布，他们最新的XPS开发者版笔记本电脑将开始配备Ubuntu 20.04 LTS，作为流行的桌面Linux发行版的最新版本。虽然Ubuntu 20.04 LTS已于4月份发货，但戴尔一直在通过其QA和验证流程来推动这一新的Ubuntu焦点Fossa长期支持版本。截至今天，配备第10代英特尔酷睿CPU的Dell XPS 13开发人员版现在提供预安装20.04 LTS，而不是已有两年历史的Ubuntu 18.04 LTS。有关采用Ubuntu Linux的Dell XPS 13开发人员版的详细信息和当前定价，请访问Dell.com。这一阵容仅由英特尔第10代CPU组成，(遗憾的是)还没有Ubuntu预装在任何AMD Ryzen 4000系列戴尔笔记本电脑上的选项。", "note_en": "We Rely On Your Support: Did you know that the hundreds of articles written on Phoronix each month are mostly authored by one individual working insane hours? Phoronix.com doesn&#39;t have a whole news room with unlimited resources and relies upon people reading our content without blocking ads and alternatively by people  subscribing to Phoronix Premium for our ad-free service with other extra features. You can also consider  a tip via PayPal.   Dell is announcing this morning that their latest XPS Developer Edition laptops are beginning to ship with Ubuntu 20.04 LTS as the latest version of the popular desktop Linux distribution.\r   While Ubuntu 20.04 LTS shipped back in April, Dell has been pushing this new Ubuntu &#34;Focal Fossa&#34; long-term support release through their QA and verification process. As of today, the Dell XPS 13 Developer Edition with 10th Gen Intel Core CPU is now offering a pre-install with 20.04 LTS rather than the two-year-old Ubuntu 18.04 LTS.\r   Details and current pricing on the Dell XPS 13 Developer Edition with Ubuntu Linux can be found at  Dell.com. The line-up consists of just the Intel 10th Gen CPUs still with (sadly) no option yet for Ubuntu pre-loaded on any AMD Ryzen 4000 series powered Dell laptop.", "posttime": "2020-06-23 23:06:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,开发,开发人员,shipping", "title": "戴尔将开始在其最新XPS开发人员版上交付Ubuntu 20.04 LTS", "title_en": "Dell to Begin Shipping Ubuntu 20.04 LTS on Their Latest XPS Developer Edition", "transed": 1, "url": "https://www.phoronix.com/scan.php?page=news_item&px=Dell-XPS-Ubuntu-20.04-Shipping", "via": "", "real_tags": ["ubuntu", "开发", "开发人员", "shipping"]}, {"category": "", "categoryclass": "", "imagename": "6ba4f6a7799583afcde74e447d118f55.jpg", "infoid": 1007803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter周二表示，它已经给商业客户发了电子邮件，比如那些在网站上做广告的客户，警告说他们的信息可能因安全漏洞而被泄露。\n这家社交网络巨头表示，商业用户的账单信息无意中存储在浏览器的缓存中，其他人，如那些共享电脑的人，可能已经访问了它。\n这些数据包括业务用户的电子邮件地址、电话号码以及与帐户关联的信用卡号码的最后四位数。\nTwitter告诉用户，它在5月20日首次意识到这个问题，一个月前，Twitter披露了一个类似的漏洞，即在Firefox的浏览器缓存中不当存储Twitter用户数据，如直接消息。\nTwitter发言人劳拉·帕卡斯(Laura Pacas)向TechCrunch证实了这一事件，但拒绝透露受影响的人数。\n这位发言人说：“我们注意到了一起事件，如果你在ads.twitter.com或analytics.twitter.com上查看你的账单信息，账单信息可能已经存储在浏览器的缓存中。”一旦我们发现这种情况发生，我们就解决了这个问题，并与可能受到影响的客户进行了沟通，以确保他们知道并了解如何保护自己。“。\n仅在去年，Twitter就关闭了一个漏洞，该漏洞允许一名研究人员发现与数百万Twitter账户相关的电话号码；Twitter承认，它向其中一个合作伙伴提供了账户位置数据，即使这名用户选择不共享他们的数据；并无意中向其广告合作伙伴提供了超过应有的数据。Twitter去年还表示，它使用用户提供的电话号码进行双因素身份验证，以提供有针对性的广告。\n2018年，Twitter承认以明文存储用户密码，并警告其数百万用户重置密码。", "note_en": "Twitter said Tuesday that it has emailed its business customers, such as those who advertise on the site, to warn that their information may have been compromised in a security lapse.\n The social network giant said that business users’ billing information was inadvertently stored in the browser’s cache, and it was “possible” that others, such as those who share computers, could have accessed it.\n That data includes the business user’s email addresses, phone numbers, and the last four-digits of their credit card number associated with the account.\n Twitter told users that it first became aware of the problem on May 20, a month after Twitter  disclosed a similar bug that improperly stored Twitter user data, such as direct messages, in Firefox’s browser cache.\n  Twitter spokesperson Laura Pacas confirmed the incident to TechCrunch, but declined to disclose the number of people affected.\n “We became aware of an incident where if you viewed your billing information on ads.twitter.com or analytics.twitter.com the billing information may have been stored in the browser’s cache,” the spokesperson said. “As soon as we discovered this was happening, we resolved the issue and communicated to potentially impacted clients to make sure they were aware and informed on how to protect themselves moving forward.”\n  Last year alone, Twitter  closed a bug that allowed a researcher to discover phone numbers associated with millions of Twitter accounts; admitted  it gave account location data to one of its partners, even if the user had opted-out of having their data shared; and  inadvertently gave its ad partners more data than it should have. Twitter last year also said  it used phone numbers provided by users for two-factor authentication for serving targeted ads.\n In 2018, Twitter admitted it  stored user passwords in plaintext, and warned its millions of users to reset their passwords.", "posttime": "2020-06-23 23:06:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推特,商业,business,twitter", "title": "推特表示，一些商业用户的私人数据被曝光", "title_en": "Twitter says some business users had their private data exposed", "transed": 1, "url": "https://techcrunch.com/2020/06/23/twitter-says-some-business-users-had-their-pivate-data-exposed/", "via": "", "real_tags": ["推特", "商业", "business", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "b0335259317056e4f92d34076bc7c82f.png", "infoid": 1007801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你使用过像Google的PageSpeed Insights这样的工具，你可能会遇到使用“下一代图像格式”的建议，即Google的WebP图像格式。谷歌声称，在同等质量下，他们的WebP格式比JPEG小25-34%。\n在使用感知图像优化器测试WebP时，我遇到了一个特殊的问题：与压缩的JPEG相比，WebP文件的大小非常相似，在许多情况下更大。我不是唯一注意到这一点的人，Mozilla在2013年的研究中也注意到，与JPEG相比，WebP通常没有更好的压缩效率。(请注意，Mozilla有点退缩了，并在2019年实现了对Firefox的WebP支持)。\n我认为Google文件减少25%-34%的主要原因是他们将WebP编码器与JPEG参考实现--独立JPEG集团的cjpeg--进行了比较，而不是Mozilla改进后的MozJPEG编码器。我决定运行一些测试，看看cjpeg、MozJPEG和WebP如何比较。我还测试了基于开放的AV1视频编解码器的新的AVIF格式。火狐已经支持AVIF了，如果这张票可信的话，它应该很快就会出现在Chrome上。\n在测试中，我使用了3种不同大小的柯达图像数据集：500px、1000px和1500px。\n对于JPEG转换，我使用了带有--Optimize标志、--Procedure标志和4：2：0色度子采样的cjpeg。\n对于MozJPEG转换，我使用了带有--优化标志、--渐进标志和4：2：0色度子采样的MozJPEG。\n对于WebP，我使用带有-m6标志的cwebp来实现最大压缩，使用-af来进行自动过滤，这可能是为了提高质量而牺牲编码时间。WebP仅支持4：2：0子采样，因此不需要单独指定。\n对于AVIF，我使用了带标志的Colorist--tonemap off、--yuv 420和--Speed 0，这是最慢但质量最高的编码\n除此之外，ImageMagick还用于缩小原始图像的比例，并在PNG、WebP和TGA之间进行转换(cwebp仅支持TGA输入)。所有转换均在sRGB颜色空间中完成。\n为了比较质量，我使用了kornelski的dssim实用程序，它计算图像之间的结构相似性指数。我的目标ssim是0.0044，大致相当于85的jpeg质量。\n如果我们查看文件大小的中位数，我们可以看到，与cjpeg相比，在同等的ssim索引下，MozJPEG大约小了11%，WebP小了18%，AVIF小了31%。\n如果我们查看文件大小的中位数，我们可以看到，与cjpeg相比，MozJPEG大约小了11%，WebP也比cjpeg小了11%，avf在同等的ssim索引下小了28%。\n如果我们查看文件大小的中位数，我们可以看到，与cjpeg相比，MozJPEG大约小9%，WebP与cjpeg大小相同，AVIF在同等的ssim索引下小28%。\n只是为了好玩，我画了所有图像大小的平均值。我知道这可能不是一个公平的比较，但尽管如此，你还是要说：\n如您所见，与cjpeg相比，MozJPEG大约小了9%，WebP小了6%，AVIF小了30%。\n如果您感兴趣，您可以在此处以电子表格的形式查看所有图像的原始数据。比较应用程序和RAW图片的源代码可以在GitHub上找到：500px、1000px和1500px。检查原始图像的原始目录。\n那么，WebP比JPEG好吗？这取决于您使用的是参考libjpeg库还是改进的MozJPEG编码器。\n在大多数情况下，WebP的压缩效果似乎比libjpeg好10%左右，除了1500px的图像压缩效果差不多。\n然而，与MozJPEG相比，WebP只在500px的小图像上表现得更好。对于其他图像大小，压缩效果相等或更差。\n我认为MozJPEG是这里的明显赢家，其压缩性能一直比libjpeg好10%左右。\n由于大部分时间WebP与JPEG回退一起使用，因此通过使用WebP，您基本上可以将存储成本提高一倍，而收益却微乎其微。因此，最后，我建议仅在以下情况下使用WebP：\n在任何情况下，将图像转换为WebP时，请检查它们是否实际小于JPEG等效值。没有必要向您的用户提供超出所需的更大的图像。\nJPEG编码器与WebP(基于VP8)和AVIF(基于AV1)相比的一个显著区别是，很容易看出后者是如何从视频编解码器派生出来的。JPEG压缩对每个16x16“宏块”使用相同的量化因子，因此压缩在整个图像中是一致的。\n另一方面，WebP和AVIF对图像的不同部分使用不同的压缩因子，因此在图像的细节部分保持其质量的同时，细节较低的表面(如皮肤或天空)将被“平滑”。这一点在此图像中的红色百叶窗中尤为明显。\n虽然图像中的砖块看起来很锋利，但门看起来几乎就像是应用了“智能模糊”Photoshop滤镜。\n我认为这种自适应压缩是很有价值的。想一想一张有森林和天空的照片。传统的图像编码器必须决定整个图像的单一压缩比。虽然在高频细节的林木上使用大量的比特是好的，但是对于低频细节的天空来说它们是浪费的。\n更智能的编码器(如WebP或AVIF)将能够单独处理这些区域，从而有效地使用可用位。\n我认为AVIF是一个非常激动人心的开发，与WebP相比，它似乎是一个真正的下一代编解码器，与libjpeg相比，压缩比提高了大约30%。我唯一担心的是低细节区域的过度模糊。当更先进的工具出现时，这一点是否能得到改善还有待观察。\n现在的工装有点乱七八糟。Colorist是我发现的唯一可以可靠地对AVIF文件进行编码的程序。编码AVIF文件也真的很慢！对大图像进行编码可能需要几分钟的时间。我使用的是AOM编码器，但是rav1e可能更快。浏览器支持也仍在进行中。Firefox支持AVIF，但它有问题，而且似乎无法正确读取ICC配置文件。尽管如此，它还是比苹果的下一代HEIF支持更多的浏览器，后者在Safari中甚至不受支持。\n我认为，在未来一年左右的时间里，我们可能会看到一幅截然不同的图景。有了Chrome，我们可以看到支持的浏览器跃升到所有浏览器的70%左右，这意味着在Web项目中支持AVIF将是一个务实的事情。\n在这次测试中，我只使用了摄影图像。例如，压缩图形时，WebP可能会更好，因为它支持对Alpha通道进行有损压缩，而PNG和JPEG不支持。\n我还测试了“Web质量”目标为85的图像，因此WebP在质量非常高或非常低的设置下可能会有不同的表现。\n此外，谷歌的研究使用了不同的程序来计算SSIM值。在我的测试中，我使用了dssim实用程序，它在实验室颜色空间中计算多尺度的ssim，而前者似乎在rgb颜色空间中使用简单的ssim。这意味着他们可能会给出不同的结果，但很难说哪一个更准确。\n根据流行的需求，在图表中添加了错误条。这些分别代表第25和75个百分位数。我还为对比应用程序和RAW图片添加了giHub链接。", "note_en": "If you have used tools like Google’s PageSpeed Insights, you probably have run into a suggestion to use “next-gen image formats”, namely Google’s  WebP image format. Google  claims that their WebP format is 25 – 34% smaller than JPEG at equivalent quality.\n When testing out WebP using a  perceptual image optimizer, I ran into a peculiar issue: the WebP files were of very similar size compared to compressed JPEGs, in many cases larger. I’m not only one who noticed this, but Mozilla also noted in  their 2013 study that WebP doesn’t generally have much better compression efficiency when compared to JPEG. (Note that Mozilla somewhat walked back from this and implemented  WebP support for Firefox in 2019)\n I think Google’s result of 25-34% smaller files is mostly caused by the fact that they compared their WebP encoder to the JPEG reference implementation, Independent JPEG Group’s  cjpeg, not Mozilla’s improved  MozJPEG encoder. I decided to run some tests to see how cjpeg, MozJPEG and WebP compare. I also tested the new AVIF format, based on the open AV1 video codec. AVIF support is already in Firefox behind a flag and should be coming soon to Chrome if  this ticket is to be believed.\n  For the testing I used the  Kodak image dataset in 3 different sizes: 500 px, 1000px and 1500px.\n For JPEG conversion I used cjpeg with  --optimize flag,  --progressive flag and 4:2:0 chroma subsampling.\n For MozJPEG conversion I used MozJPEG with  --optimize flag,  --progressive flag and 4:2:0 chroma subsampling\n For WebP I used cwebp with  -m 6 flag for maximum compression and  -af for auto filter which presumably trades encoding time for increased quality. WebP only supports 4:2:0 subsampling so this doesn’t need to be specified separately.\n For AVIF I used  colorist with flags  --tonemap off,  --yuv 420 and  --speed 0 which is the slowest but highest quality encoding\n In addition to these, ImageMagick was used to scale down the images from the originals and converting between PNG, WebP and TGA (cwebp only supports TGA input). All conversions were done in sRGB color space.\n For comparing the quality I used kornelski’s  dssim utility which calculates  structural similarity index between images. My target SSIM is 0.0044 which  roughly corresponds to JPEG quality of 85.\n         If we look at the median file sizes, we can see that compared to cjpeg, MozJPEG is roughly 11% smaller, WebP is 18% smaller compared and AVIF is 31% smaller at the equivalent SSIM index.\n         If we look at the median file sizes, we can see that compared to cjpeg, MozJPEG is roughly 11% smaller, WebP is also 11% smaller compared and avif is 28% smaller at the equivalent SSIM index.\n         If we look at the median file sizes, we can see that compared to cjpeg, MozJPEG is roughly 9% smaller, WebP is the same size as cjpeg and AVIF is 28% smaller at the equivalent SSIM index.\n  Just for fun, I graphed the averages of all image sizes. I know this might not be a fair comparison but still, here you go:\n    As you can see, when compared to cjpeg, MozJPEG is about 9% smaller, WebP is 6% smaller and AVIF is 30% smaller.\n If you are interested, you can view the raw data for all the images as a spreadsheet  here. Source code for the comparison app and raw images are available on GitHub:  500px,  1000px and  1500px. Check the originals directory for the raw images.\n   So, is WebP better than JPEG? It depends if you are using the reference libjpeg library or the improved MozJPEG encoder.\n WebP seems to have about 10% better compression compared to libjpeg in most cases, except with 1500px images where the compression is about equal.\n However, when compared to MozJPEG, WebP only performs better with small 500px images. With other image sizes the compression is equal or worse.\n I think MozJPEG is the clear winner here with consistently about 10% better compression than libjpeg.\n Since most of the time WebP is used alongside JPEG fallback, by using WebP you will essentially double your storage costs with little benefit. So, in the end, I would recommend using WebP in only the following cases:\n  In any case, when converting images to WebP, check that they are actually smaller than the JPEG equivalent. There’s no need to serve larger images to your users than needed.\n  One notable difference between JPEG encoders compared to WebP (based on VP8) and AVIF (based on AV1) is that it’s pretty easy to see how the latter were derived from video codecs. JPEG compression uses the same quantization factor for each 16x16 “macroblock” so the compression is consistent throughout the image.\n WebP and AVIF on the other hand use different compression factors for different parts of the image so while the detailed parts of the image retain their quality, surfaces like skin or the sky which have low detail are “smoothed out”. This is especially noticeable with the red window shutters in this image.\n    While the bricks in the image look sharp, the doors look almost like they have a “Smart blur” Photoshop filter applied to them.\n I think this kind of adaptive compression is a valuable thing to have. Think about a photo with a forest and the sky. A traditional image encoder would have to decide a single compression ratio for the whole image. While it’s good to use a lot of bits for the forest trees with high-frequency detail, they are wasted for the sky with low-frequency detail.\n A smarter encoder like WebP or AVIF will be able to process these areas separately to use the available bits efficiently.\n  I think AVIF is a really exciting development and compared to WebP it seems like a true next-generation codec with about 30% better compression ratio compared to libjpeg. Only concern I have is the excessive blurring of low detail areas. It remains to be seen if this can be improved when more advanced tooling becomes available.\n Right now the tooling is a bit spotty.  Colorist was the only program I found which can reliably encode AVIF files. Encoding AVIF files is also really slow! A big image can take several minutes to encode. I’m using the AOM encoder but  rav1e might be faster. Browser support also still in progress. Firefox has AVIF support but it’s behind a flag and it doesn’t seem to  read ICC profiles correctly. Still, it’s more browser support than Apple’s &#34;next-gen&#34; HEIF which  isn’t even supported in Safari.\n I think in the next year or so we might see a radically different landscape. With Chrome on board, we could see supported browsers jump to something like 70% of all browsers which means AVIF would be a pragmatic thing to support in web projects.\n  In this test, I only used photographic images. WebP may be better when compressing graphics, for example, since it supports lossy compression for the alpha channel which PNG and JPEG do not.\n I also tested the images in “Web quality” target of 85 so WebP may perform differently in very high or very low-quality settings.\n Also, Google’s study used  a different program to compute the SSIM values. In my tests, I used the  dssim utility which computes multi-scale SSIM in LAB color space while the former seems to use simple SSIM in RGB color space. This means they likely give different results but it’s hard to say which is more accurate.\n  By popular demand, added error bars to the graphs. These represent 25th and 75th percentiles. I also added GitHub links for the comparison app and raw images.", "posttime": "2020-06-23 22:46:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webp", "title": "WebP比JPEG好吗？", "title_en": "Is WebP better than JPEG?", "transed": 1, "url": "https://siipo.la/blog/is-webp-really-better-than-jpeg", "via": "", "real_tags": ["webp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年6月我作为全职开发人员的最后一年是2018年。(有关那个故事，请阅读“离开我的日间工作”)。\n开发人员的薪水千差万别，但9万美元对我来说是相当稳定的。再加上我妻子的收入和一些穆斯塔基主义，存一大笔钱以备不时之需已经足够了。(或者在开源LOL-破坏者警报😬上几个月的未付费工作)。\n在需要换个环境后，我在2019年1月11日离开了Strture，开始了一次“休假”(“休息一下，做任何我想做的事”的奇妙词汇😛)，然后在几个月后开始做自由撰稿人之类的工作。\n休假4天后，我读了这篇帖子，匆忙为拉威尔做了一个概念证明。\n这一天标志着我休假的突然结束。我完全被这个项目(现在称为Livewire)迷住了，无法停止全职工作。)我从未停止过。我仍然全天候迷恋它。)。\n(在此过程中，我还创建了一个非常流行的JS框架，名为alpineJS，我也在为它工作，但这是另一个Time…的故事)。\n信不信由你，开源软件并不能很好地支付账单，所以我聘请了一些小代码导师客户，让他们在2019年全年保持在水面上。\n我减了大约7万美元的工资，这样我就可以追求我的激情了。这看起来很危险，但我知道在生活中做出这样的举动只会变得更加困难。\n一路上，很多好心人找到我，询问他们如何帮助支持这个项目。像这样给我发信息：\n我很长一段时间都避免创建Patreon，因为我一直在想象一个世界，在那里，有几个人每月给我5美元。这会很好，但对我来说似乎不值得。\n看起来很完美。直接托管在GitHub上，而且足够新，周围有一些令人兴奋的东西。\n从那以后，我从giHub赞助商…那里收到了大约25000美元的现金。(他们匹配第一个5000美元，他们收取零%的佣金。你保留了一切(🙌🏻❤️)。\n…。在写这篇文章的时候，我每年的GitHub赞助商收入已经增长到112,680美元/年。🎉。\n我现在赚的钱比我在为我喜欢的社区开发开源软件时赚的钱还要多。捏我一下，我在做梦。\n是因为我开发的软件令人难以置信地令人信服，迫使535人给我至少14美元/月的报酬吗？继续努力吗？…。我也想，但不止于此。一路上我做了一些关键的事情才来到这里。让我告诉你所有关于他们的事情。\n起初，GitHub赞助商是一个派遣忠诚/慷慨的追随者支持该项目的地方。\n无论这些人多么圣洁，与实际使用该软件的人数(并经常通过该软件赚钱)相比，他们并不多。\n由于开源的性质，人们已经免费获得了软件，所以这种策略在没有给他们的生活增加任何价值的情况下，是非常有限的。\n这张收入图表的第一部分完全来自那些只想贡献自己力量的善良的人。\n在录制“没有计划与我的伙伴丹尼尔合并”的一集时，我们想出了一个新的想法，叫做“海绵软件”(Sponsorware)。\n在您达到一定数量的赞助商之前，将其独家提供给赞助您的人。\n它工作得非常好，我在几天内就增加了11000美元的年收入。\n我在这里写了一整篇关于“海绵软件”的文章，并在Changelog Podcast的这一集接受了关于这个过程的采访。\n此外，我的一个朋友努诺·马杜罗(Nuno Maduro)最近在他的名为Pest的项目中复制了这种技术，并取得了类似的成功：\n这项技术很棒，但它要求我有源源不断的新想法。所有这些都将成为我必须持续进行的项目。从长远来看，我需要一些更合理的东西。\n构建一个有用的软件是一回事。教育人们如何使用它是完全不同的事情。(我可能会补充一件不太有趣的事情)。\n我试着把文档做得尽可能好，但总是需要更高级的内容。\n而不是承担创建关于Livewire的整个课程或书籍的巨大任务。我决定走一条不同的路线。\n以下正是我所做的，使我在大约3个月内从4万美元增加到10万美元：\n我添加了文档其他部分的链接，将人们指向他们，这样他们就知道他们在那里：\n几周后，我添加了一个新的“私人”群组，仅面向GitHub赞助商。\n(为了实现这一切，我构建了一个带有GitHub身份验证的Laravel应用程序，它调用GitHub API来验证用户的赞助)\n现在，观看截屏视频的人自然会遇到这些“私人”的截屏视频，如果他们喜欢免费的，他们会赞助我(14美元/月)。才能获得访问权限。\n每当有新的特写出现，或者我决定报道Livewire的新技术时，我都会发布一批新的视频。\n我还为赞助商提供访问每节课的源代码的权限(这些课程托管在单独的repo上，最终将成为用Livewire编写的整个Web应用程序)。\n就收入而言，这是我有过的最有影响力的想法。\n它在90天内使我的年收入增加了约8万美元。就像变魔术一样。\n现在我有了源源不断的收入，而不必把所有的时间都花在主要的课程启动上。我可以继续为我喜欢的社区构建我喜欢的软件，并随着时间的推移发布新的截屏视频(实际上我很喜欢这样做)。\n所有这一切之所以奏效，是因为我花了很多年磨练我的手艺，制作出真正有用的软件。我在那项工作上倾注了我的一切，没有捷径可走。您在前面看到了我是如何在一个开源项目上全职工作了将近一整年，然后才看到任何回报的。人们赞助的工作必须是高质量的，并且仍然是第一要务。\n你可以在互联网上创建最好的工具，但如果没有人关注你，那就没有意义了。建立受众对于这一切的任何一项工作都是至关重要的。推特追随者和电子邮件订阅者是你最有价值的资产。再说一次，这里没有捷径。只是努力工作，并在很长一段时间内公开地、始终如一地为人们提供价值。\n人们在GitHub赞助商身上犯的最大错误是提供的第一级太少。\n如果人们可以选择支付1-5美元/月。他们将支付较低的金额，而不是14美元。\n我很早就意识到，如果我真的想成功的话，我需要超过5美元的赞助。在很长一段时间里，我从9美元开始，然后又涨到了14美元的录像费。\n我增加了一个7美元的等级，对于那些只想说声谢谢但不需要任何回报的好心人来说，这是没有任何好处的。(这些人就是前面提到的圣徒🙏🏻)。\n在设置赞助商级别时，请选择描述该级别适合的人员类型的名称。\n例如。对于更高的级别，可以给它贴上类似“机构”的标签，或者意味着企业应该在更高的级别赞助，而不是像“白金”这样含糊的东西。\n这样，当人们阅读层级时，他们会想：“我属于什么级别的使用”，而不是“我想每月花多少钱”。\n不要害怕谈论你的赞助和你赚了多少钱\n我从小就认为谈论金钱是不礼貌的。这是个谎言。有一次我加薪一万美元，因为一位同事告诉我他们赚了多少钱。在我了解了他们制造的东西后，我觉得自己很放心地要求同样的价格。如果他们不告诉我什么都不会发生。\n我不会隐瞒自己的收入，因为我从别人不隐瞒自己的收入中获益。\n即使它比我高出天文数字，我也从来没有怨恨过它，也没有权利这样做，我只会感到兴奋和鼓舞。我希望其他人也有同样的感受。\n最重要的是，如果你对你的GitHub赞助商的收入感到兴奋，其他人也会感到兴奋！\n完全坦率地说，你依赖这笔钱，这并不粗鲁，它可以帮助你构建人们每天都在使用并从中受益的软件。\n我总是提醒自己，我不是密码传教士。如果我的赞助收入超过了简朴的生活，那也没问题。这不是非营利组织。\n我的收入与我的软件为他人生活增加的价值成正比，这是可以接受的。\n我做的不是神圣的工作。这是企业用来赚钱的软件。他们从中获利。获利也是可以的。\n我希望这个传奇故事至少能让你觉得好笑，最多也只能提供一个蓝图，让你自己的开源项目在财务上可持续发展。\n如此多的开放源码项目开始时充满热情，后来又被放弃了。我相信，如果这些项目在财务上是可持续的，它们就会变得更好，变得更大，维持得更久。每个人都会赢。\n如果你自己尝试这些技巧中的任何一种，我很想了解一下。我在推特上的DM总是开放的。\n如果你喜欢我做的工作并想要支持它，你知道该怎么做，❤️。\n我每隔一段时间就会发一封电子邮件，介绍我正在研发或推出的很酷的东西。如果你喜欢，那就去报名吧！", "note_en": "Jun 2020      My last year as a full-time developer (at  Tighten) was 2018. (Read  “On Leaving My Day Job” for that story)\n   Developer salaries vary like crazy, but $90k was pretty solid for me. Combined with my wife’s income and some  Mustachianism it was plenty to save up a chunk of cash for a rainy day. (Or for a few months of working un-paid on open source lol - SPOILER ALERT 😬)\n After needing a change of scenery, I left Tighten on January 11th, 2019 to go on a “sabbatical” (fancy word for “take a break and do whatever the hell I want“ 😛) and then start freelancing or something after a couple of months.\n 4 days into my Sabbatical, I read  this post and hastily made a proof of concept for  Laravel.\n  This day marked the abrupt end of my sabbatical. I was completely enamored with the project (now called  Livewire) and couldn’t stop working on it full-time. (I’ve never stopped. I’m STILL enamored with it full-time.)\n (I also created a pretty popular JS framework along the way called  AlpineJS that I work on too, but that’s a story for another time…)\n Believe it or not, open-source software doesn’t quite pay the bills, so I took on some small code mentorship clients to stay above the water for the entire year of 2019.\n   I reduced my salary by ~$70k so I could pursue my passion. It seemed risky, but I knew it would only get harder to make this kind of move in life.\n Lots of kind folks reached out to me along the way asking how they could help support the project. Sending me messages like this:\n  I avoided creating a Patreon for a long time because I kept picturing a world where a handful of people give me five bucks a month. Which would be nice, but never seemed worth it to me.\n  It seemed perfect. Hosted directly on GitHub and new enough that there’s some excitement around it.\n   I’ve since received \u0004~$25k in cash from GitHub sponsors…(They match the first $5k, and they take a ZERO percent cut. You keep EVERYTHING 🙌🏻❤️)\n  …and as of this writing, I’ve grown my annual GitHub sponsors revenue to $112,680/yr. 🎉\n   I am now making more money than I’ve ever made while developing open-source software for a community that I adore. Pinch me, I’m dreaming.\n   Was it that the software I built was so incredibly compelling that it forced 535 people to give me at least $14/mo. to keep working on it? …I wish.It’s more than that though. There were some key things I did along the way to get here. Let me tell you all about them.\n   At first, GitHub Sponsors was a place to send loyal/generous followers that wanted to support the project.\n However saintly these people are, there aren’t that many of them compared to the number of people actually using the software (and often making money on it).\n Because of the nature of open-source, people are already getting the software for free, so without ADDING any value to their lives, this strategy is seriously limiting.\n The first section of this income graph is solely from kind folks who just wanted to pitch in.\n        While recording an episode of  No Plans To Merge with my buddy  Daniel on how to monetize it, we cooked up a novel idea called: “Sponsorware”\n   Make it exclusive to people who sponsor you until you reach a certain number of sponsors\n  It worked incredibly well and I increased my yearly revenue by $11k in a matter of days.\n  I did an entire writeup on “Sponsorware”  here and was interviewed about the process on  this episode of The Changelog Podcast.\n Also, a friend of mine  Nuno Maduro recently replicated the technique with his project called  Pest and had similar success:\n  This technique is fantastic, but it requires me to have a constant stream of new ideas. All of which would become projects I would have to maintain ongoing. I needed something more reasonable for the long haul.\n       Building a useful piece of software is one thing. Educating people on how to use it is an entirely different thing. (A much less fun thing I might add)\n I try to make  the docs as good as possible, but there’s always a need for more advanced content.\n Rather than taking on the huge task of creating an entire course or book on Livewire. I decided to go a different route.\n Here’s exactly what I did that took me from ~$40k to &gt;\u0007$100k in ~3 months:\n   I added links to other parts of the documentation pointing people towards them so they know they’re there:\n  A few weeks later I added a new “private” group of screencasts for GitHub sponsors only.\n   (To make all this happen I built a Laravel app with GitHub authentication that calls on the GitHub API to verify a user’s sponsorship)\n Now, people watching the screencasts will naturally encounter these “private” screencasts and if they like the free ones, they will sponsor me (at $14/mo.) to get access.\n I release a new batch of videos every time a new feature comes out, or I decide to cover a new Livewire technique.\n I also provide sponsors with access to the source code for each lesson (which is hosted on a separate repo and will eventually become an entire web app written with Livewire).\n In terms of income, this has been the single most impactful idea I have EVER had.\n It raised my annual revenue by ~$80k in 90 days. It’s like magic.\n Now I have a constant stream of income without having to spend all my time on major course launches. I can keep building the software I love for the community I love and release new screencasts over time (which I actually enjoy doing).\n   All of this works because I spent years and years honing my craft and producing software that is truly useful. I’ve poured everything I have into that work, and there are no shortcuts there. You saw earlier how I worked full-time on an open-source project for almost an entire year before seeing any returns. The work people are sponsoring for has to be quality and remain the #1 priority.\n  You can build the greatest tool on the internet, but it means nothing if no one’s paying attention to you. Building an audience is ESSENTIAL for any of this to work. Twitter followers and email subscribers are your most valuable asset. Again, no shortcuts here. Just hard work, and providing value to people publicly and consistently for a long time.\n  The biggest mistake people make with GitHub sponsors is offering too small of a first tier.\n If people have the option of paying $1-5/mo. instead of &gt;$14, they will pay the lesser amount.\n I realized early on that if I want to really make a go of this, I’d need more than five dollar sponsorships. I started at $9 for a long time and then bumped it to $14 for the screencasts.\n I’ve added a $7 tier that gets no perks for kind folks that just want to say thanks but don’t need anything in return. (These people are the aforementioned Saints 🙏🏻)\n  When you are setting up your sponsorship tiers, pick names that describe the type of person the tier is suited for.\n For example. For a higher tier, label it something like “The Agency” or something that implies that a business should be sponsoring at a higher tier, rather than something vague like “Platinum”.\n This way, when people are reading the tiers they will think to themselves: “What level of usage do I fall under”, rather than: “How much money do I want to spend per month”.\n Don’t be afraid to talk about your sponsorships and how much you make\n I grew up thinking it was rude to talk about money. This is a lie. I got a ten thousand dollar raise once because a coworker told me how much they made. After I learned what they made I felt comfortable asking for that same amount. Nothing would have happened if they didn’t tell me.\n  I don’t hide what I make because I’ve benefited from others not hiding what they make.\n Even if it’s astronomically higher than me, I’m never bitter or entitled about it, I’m only ever excited and inspired. My hope is that others feel the same way.\n On top of that, if you’re excited about your GitHub sponsors revenue, others will be too!\n It’s not rude to be totally up-front that you rely on this money and it helps you build the software people are using and benefiting from every day.\n  I always remind myself that I am not a code missionary. If my sponsorship revenue climbs beyond a modest living, THAT’S OK. It’s not a non-profit.\n It’s OK for my income to be proportional to the value my software adds to other people’s lives.\n This isn’t holy work I’m doing. it’s software that businesses use to make money. They profit from it. It’s OK to profit as well.\n  I hope this saga at least amuses you, and at most provides a blueprint for making your own open-source projects financially sustainable.\n SO many open source projects are started with enthusiasm and later abandoned. I believe, if working on those projects was financially sustainable, they would be better, grow bigger, and be maintained longer. Everyone would win.\n If you try any of these techniques yourself, I’d love to know about it. My DMs on  Twitter are always open.\n If you like the work I do and want to support it,  you know what to do ❤️\n      I send out an email every so often about cool stuff I&#39;m working on or launching. If you dig, go ahead and sign up!", "posttime": "2020-06-23 22:45:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,赞助商,软件", "title": "我刚从GitHub赞助商那里拿到了每年10万美元(我是怎么做到的)", "title_en": "I Just Hit $100k/Yr on GitHub Sponsors (How I Did It)", "transed": 1, "url": "https://calebporzio.com/i-just-hit-dollar-100000yr-on-github-sponsors-heres-how-i-did-it", "via": "", "real_tags": ["github", "赞助商", "软件"]}, {"category": "", "categoryclass": "", "imagename": "381719aa23934e6688adcf7274b1fa6f.jpg", "infoid": 1007799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "超人是目前最受欢迎的初创公司之一，这款仅限邀请的应用程序被认为是科技行业最独一无二的服务之一。对于一个电子邮件应用程序来说，这是令人印象深刻的。更令人印象深刻的是，一款电子邮件应用程序只需访问你现有的Gmail账户，每月收费30美元。无论是来自公司的营销还是围绕硅谷的热议都是史无前例的。超人将自己标榜为“不是另一个电子邮件客户端”，承诺一个“从头开始重建”的收件箱，让你“感觉自己拥有超能力”。该网站上充斥着初创公司首席执行官们的赞誉，称赞它如何改变了他们与电子邮件的关系。\n但这是否辜负了炒作呢？我花了一个月的时间使用这项服务来找出答案。\n进入早在2016年就推出的超人本身就是一项任务。首先，你要么需要提交访问请求，要么需要受到已经在使用该应用程序的人的邀请。在大多数情况下，这会让你进入等待名单-据报道，截至去年6月，等待名单长达18万人-这可能会也可能不会导致公司联系你继续申请。\n假设你被录取了，你将被要求填写一份冗长的工作流程问卷，这样超人就可以更多地了解你是如何使用电子邮件的-以及你的工作流程是否适合其应用程序。你会被问到关于你的公司，你的工作是什么，你如何使用电子邮件(台式机，移动设备，甚至大部分)，你使用什么设备，你在这些设备上使用什么电子邮件应用程序，你使用什么电子邮件扩展程序，你的电子邮件工作流程是什么样子(你是否存档、删除、标记为未读等)，你是否使用更高级的功能，如日历集成或打盹，以及超人让你兴奋的是什么。\n然而，这项调查并不是结束，如果你回答错误-也就是说，以一种超人的判断方式让你不适合使用这款应用-你就不会被录取。(例如，我的同事丹·塞弗特(Dan Seifert)因为在他的工作流程中使用统一收件箱而被拒绝，这是超人不支持的。)。\n不过，如果你被录取了，你将被要求与超人入职团队的一名成员安排一个强制性的一小时通话，其中包括一个关于你目前如何使用电子邮件的屏幕分享演练，以及一个关于如何使用超人的所有各种特性和功能的分步教程。这最后一步是该公司“白手套服务”的一部分，该公司吹捧这项服务是其每月30美元高价的关键吸引力之一。\n但是假设你设法进入了超人的VIP俱乐部，那么另一边到底在等着什么呢？而且它值得入场费吗？\n超人的桌面应用--目前仅限Mac--严重依赖键盘快捷键。一旦你了解了超人的设置，大多数功能都可以通过按下按钮来访问，而那些不能(或者你记不起来)的功能可以在一个快速的弹出搜索栏中找到，它实际上就像是Alfred或Spotlight的应用内版本。iPhone应用程序(也不支持Android)稍微传统一些，使用现在标准的滑动手势将东西从收件箱中移出。\n这两款应用看起来都很可爱，都有出色的电子邮件线条和真正有用的侧边栏，可以显示你从Twitter、Facebook和LinkedIn上获得的联系人的详细信息，以及你之前的电子邮件对话。(如果这听起来很耳熟，那是因为超人创始人拉胡尔·沃拉之前的创业项目是一个Gmail插件Rapportive，提供了类似的功能。)。如果你用Tab键切换或点击电子邮件中的日期，侧边栏还可以显示谷歌日历的即时视图，这使得安排日程变得很容易。\n超人最有争议的功能之一是电子邮件的阅读状态，这在以前是默认启用的，并提取了惊人的信息量(包括对收件人阅读电子邮件的位置进行跟踪)。目前的实现更加有限，只是通知你你的电子邮件是否已被阅读，但我个人不喜欢密切关注我的联系人的感觉。\n还有一些便利措施，比如“即时介绍”，可以将不必要的介绍性电子邮件参与者转移到密件抄送，或者后续提醒，可以让尚未回复的电子邮件重新浮出水面。其他功能在大多数现代电子邮件应用程序中都很常见，比如将电子邮件从收件箱中移出等待稍后的预录回复(这里称为“片段”)，以及快速撤销已发送的电子邮件的选项。\n它们都不同程度地有趣和有用，虽然不太适合我的工作(由没完没了的推介组成，几乎没有来回交流)，也不适合我的个人电子邮件(由几份时事通讯和偶尔的发货确认组成)。\n超人的问题是，你必须愿意以超人的方式使用这款应用。这款应用程序严重依赖其热键，但你不能根据自己的喜好更改或编辑它们。删除电子邮件始终是Shift-3组合键，在帐户之间切换的唯一方法是使用Ctrl键。其中有些还不错；我用过的电子邮件应用程序的设置菜单太复杂了，以至于立即让人反感，甚至懒得更改任何东西。但是，当你不能进入这个超人大小的盒子时，这也会导致一些令人沮丧的互动。\n你可以使用“Splits”-一种高级标签-在应用程序中创建新的标签，但它们只适用于单个搜索词。我试图将公关爆炸过滤成一个单独的分裂，但失败了，因为我想不出一个搜索词来同时涵盖所有内容。它对某些事情很有用，比如将任何带有.ics日历邀请的电子邮件带到它自己的选项卡中。\n还有几个预制的拆分：相当标准的重要/其他设置，试图识别重要的电子邮件(这将触发通知)，并过滤掉不太重要的电子邮件。有一个VIP收件箱，允许你手动将某些发件人标记为VIP，并将他们放入他们自己的优先选项卡中。有一个专门用来过滤时事通讯的“新闻”选项卡和一个用来过滤掉和你在同一个域的人发来的电子邮件的“团队”选项卡。\n这个重要的过滤器虽然有用，但并不完美--尽管有超人的“人工智能分类”--在我的“重要”收件箱里留下了大量的垃圾邮件，还有一些关键邮件，包括我们编辑的一封全团队的电子邮件(它跳过了团队收件箱，因为它被发送到了员工名单中，这是一项你不能禁用的功能)，最终进入了其他收件箱。\n这就把我带到了房间里最让人掏腰包的地方：价格。“超人”的月费高达30美元，令人眼花缭乱。简单地说，它提供的设计和功能不值每月30美元。我甚至不确定是否有可能做出一项每月价值30美元的完整电子邮件服务，更不用说一个非常好的Gmail包装器了，上面有一些(诚然很好的)烘焙功能。\n相比之下，Adobe Photoshop和Lightroom(捆绑在一起)的月费为10美元。微软的Office套件(包括Word、Excel、PowerPoint、OneNote、Access、Publisher和OneDrive中1TB的云存储)的月费为6.99美元。自动化工具Zapier每月收费24.95美元。事实上，如果不求助于完整的Adobe Creative Cloud套件(每月53美元)或AutoCAD LT等专业绘图工具(每月55美元)，很难找到对单个用户收取比超人更高月费的主要软件订阅。\n实际上很难找到月费更高的主要软件订阅。\n即使是其他付费电子邮件应用程序和服务也无法与之匹敌。对于单个用户来说，G Suite账户每月只需6美元。航空邮件(提供时尚的Mac和iOS应用程序)每月收费2.99美元，一年收费9.99美元。牛顿邮递(Newton Mail)(也有Windows和Android应用程序)每年收费49.99美元。Spark为更高级的用户提供溢价订阅，每月7.99美元，尽管基础应用程序是完全免费的。即使是嘿，Basecamp最新发布的电子邮件服务-这是一项全新的服务，可以为电子邮件的想法提供更实质性的修复-每年的费用为99美元。\n所有这些都忽略了一个事实，即超人搭载的实际gmail服务是免费的，就像许多优秀的电子邮件应用程序一样，它们既适用于桌面电脑，也适用于Mac电脑，并提供许多与超人相同的功能。正如高端电子邮件应用程序牛顿(Newton)的创始人罗希特·纳德哈尼(Rohit Nadhani)所解释的那样，当公司刚开始关闭时，它几乎不可能找到一种能与苹果、谷歌和微软的免费应用程序竞争的商业模式。\n首先，尽管价格高得离谱，但它是一款不错的电子邮件应用程序。在另一个世界，超人的价格更合理，更具定制化，我可以看到它非常受欢迎。(尽管，历史对流行的电子邮件应用程序并不是特别友好。人们只需看看Mailbox和Sparrow的例子，尽管谷歌和Dropbox拥有巨大的资金实力，但这两家公司都未能生存很长时间。)。\n但截至去年6月，超人只招揽了1.5万名客户，而想要加入的客户接近18万人。这在我看来，重点并不是像其他电子邮件服务甚至Gmail本身的整体理念那样，为大众创建一款更好的电子邮件应用程序。\n超人的部分意义在于排他性。这是一款针对1%的人的电子邮件应用程序，他们以非常特殊的方式使用电子邮件，用于非常特殊的商业目的。它是为公司网站上显眼的创始人、首席执行官和高管打造的，他们愿意为成为VIP俱乐部的一员而付出代价。\n当涉及到电子邮件时，超人想要重新发明轮子，但很难回避这样一个事实，即它仍然建立在Gmail和G Suite之上。现在，你甚至根本不能将它与其他电子邮件服务一起使用，让超人成为你已经拥有的Gmail体验的一件漂亮的外衣和一些方便的功能。\n超人是不会保存电子邮件的--即使它可以，也不值得为这项特权向你收费。", "note_en": "Superhuman is one of the most in-demand startups right now, with the invite-only app considered one of the most exclusive services in the tech industry. That’s impressive, for an email app. It’s even more impressive for an email app that merely accesses your existing Gmail account and costs $30 per month to use. The buzz — both from the company’s marketing and around Silicon Valley — is off the charts. Superhuman bills itself as “not another email client,” promising an inbox that’s been “rebuilt from the ground up” that will make you “feel like you have superpowers.” The website is peppered with accolades from startup CEOs praising how it has changed their relationship with email.\n But does it live up to the hype? I spent a month using the service to find out.\n  Just getting into Superhuman, which launched way back in 2016, is a task all on its own. First, you’ll either need to submit a request for access or be invited by someone who’s already using the app. In most cases, that’ll put you on a waiting list — which, as of last June, was  reportedly 180,000 members long — which may or may not result in the company contacting you to move on with your application.\n Assuming that you are accepted, you’ll be asked to fill out a lengthy workflow questionnaire so Superhuman can learn more about how you use email — and whether your workflow is the right fit for its app. You’ll be asked about your company, what your job is, how you use email (desktop, mobile, or mostly even), what devices you use, what email apps on those devices you use, what email extensions you use, what your email workflow looks like (do you archive, delete, mark unread, etc.), whether you use more advanced features like calendar integration or snoozing, and what excites you about Superhuman.\n   That survey isn’t the end of it, though, and if you respond incorrectly — that is to say, in a manner that Superhuman judges makes you a poor fit for the app — you won’t get in. (For example, my colleague Dan Seifert was rejected for using a unified inbox in his workflow, something that Superhuman doesn’t support.)\n If you are accepted, though, you’ll be asked to set up a mandatory one-hour call with a member of Superhuman’s onboarding team, which includes a screen-sharing walkthrough of how you currently use your email and a step-by-step tutorial on how to use all of Superhuman’s various features and functions. That last step is part of the company’s “white glove service,” which it touts as one of the key draws for its hefty $30-per-month price tag.\n But assuming you manage to get inside the VIP club that is Superhuman, what’s actually waiting on the other side? And is it worth the price of admission?\n   Superhuman’s desktop app — Mac only, for now — relies heavily on keyboard shortcuts. Most features can be accessed by the push of a button once you learn Superhuman’s settings, and those that can’t (or ones you can’t remember) can be found in a speedy pop-up search bar that’s effectively like an in-app version of Alfred or Spotlight. The iPhone app (there’s no Android support, either) is a little more traditional, with the now-standard swiping gestures for moving things out of your inbox.\n  Both apps look lovely, with excellent threading of emails and a genuinely useful sidebar that shows details on your contacts — pulled from Twitter, Facebook, LinkedIn — and previous email conversations you’ve had. (If that sounds familiar, it’s because Superhuman founder Rahul Vohra’s previous venture was a Gmail plugin,  Rapportive, which offered a similar function.) That sidebar can also show an instant view of your Google Calendar if you tab over or click on a date in an email, making it easy to schedule things.\n One of Superhuman’s most controversial features is read statuses for emails, which had previously been enabled by default and  pulled a startling amount of information (including  location tracking for where your recipient read your email). The current implementation is more limited, just informing you if your email was read, but I personally don’t like the feeling of keeping tabs on my contacts.\n There are also some neat conveniences, like “instant intro,” which shunts unnecessary introductory email participants to BCC, or follow-up reminders that will resurface emails that haven’t been responded to. Other features are common to most modern email apps, like snoozing emails out of your inbox for later, canned responses (called “snippets” here), and the option to quickly undo an email you’ve sent.\n They’re all interesting and useful to varying degrees, although poorly suited for both my work (which consists of an endless flood of pitches and very little back-and-forth communication) or my personal email (which consists of a few newsletters and the occasional shipping confirmation).\n   The problem with Superhuman is that you have to be willing to use the app Superhuman’s way. The app is heavily reliant on its hotkeys, but you can’t change or edit them to your liking. Deleting email will always be Shift-3, and the only way to switch between accounts is by using the Control key. Some of that is fine; I’ve used email apps with settings menus so complex as to be immediately off-putting to even bother changing anything. But it also leads to some frustrating interactions when you don’t fit into the Superhuman-sized box.\n You can use “splits” — a sort of high-level label — to create new tabs in the apps, but they only work for a single search term. My attempts to filter out PR blasts into a single split was foiled since I couldn’t come up with a search term to encompass everything at once. It’s useful for some things, like bringing out any emails with a .ics calendar invite into its own tab.\n There are also several premade splits: a fairly standard Important/Other setting that tries to identify important emails (which will trigger notifications) and filter out less important ones. There’s a VIP inbox, which allows you to manually flag certain senders as VIPs and put them in their own priority tab. There’s a News tab designed to filter out newsletters and a Team tab that filters out emails sent from people at the same domain as you.\n But the Important filter, while useful, isn’t perfect — despite Superhuman’s “A.I. Triage” — leaving me with plenty of dross in my “Important” inbox and a few key messages, including a team-wide email from our editor (which skipped the Team inbox since it was sent to the staff list, a feature you can’t disable) ended up in Other instead.\n   That brings me to the wallet-bursting elephant in the room: price. Superhuman costs an eye-watering $30 per month. Simply put, the design and features it offers are not worth $30 per month. I’m not sure that it’d even be possible to make an entire email service that was worth $30 per month, much less a very nice wrapper for Gmail with some (admittedly nice) features baked on top.\n For comparison, Adobe Photoshop and Lightroom ( bundled together) cost $10 per month.  Microsoft’s Office suite (which includes Word, Excel, PowerPoint, OneNote, Access, Publisher, and a terabyte of cloud storage in OneDrive) costs $6.99 per month.  Automation tool Zapier costs $24.95 a month. It’s actually difficult to find a major software subscription that charges more per month for a single user than Superhuman without turning to things like the full Adobe Creative Cloud suite ($53 per month) or professional drafting tools like  AutoCAD LT ($55 per month).\n It’s actually difficult to find a major software subscription that charges more per month\n Even other paid email apps and services don’t come close. A  G Suite account only costs $6 per month for a single user.  AirMail (which offers sleek Mac and iOS apps) costs $2.99 per month or $9.99 a year.  Newton Mail (which also has Windows and Android apps) costs $49.99 per year.  Spark has a premium subscription for more advanced users for $7.99 per month, although the base app is totally free. And even  Hey, the newly released email service from Basecamp — which is an entirely new service that can offer  more substantial fixes to the idea of email — costs $99 a year.\n All that ignores the fact that the actual Gmail service, which Superhuman piggybacks on top of, is free, as are any number of excellent email applications that exist for both desktop and Mac and offer many of the same features as Superhuman. As Rohit Nadhani, the founder of premium email app Newton, explained when the  company first shut down, it was almost impossible for it to find a business model that could compete with the free apps from Apple, Google, and Microsoft.\n  Well, first off, despite the astronomical price, it  is a good email application. In another world, one where Superhuman was more reasonably priced and a little more customizable, I could see it being very popular. (Although, history has not been particularly kind to popular email applications. One only need look at the examples of  Mailbox and  Sparrow, neither of which managed to survive long, despite the massive funding power of  Google and Dropbox.)\n But as of last June, Superhuman touted just 15,000 customers compared to the nearly 180,000 who wanted in. This suggests to me that the point isn’t really to create a better email app for the masses the way other email services — or even the entire idea of Gmail itself — intended.\n  Part of the point of Superhuman  is the exclusivity. It’s the email app for the 1 percent of people who use email in a very particular way for very particular business purposes. It’s built for the founders and CEOs and executives who are featured prominently on the company’s site and who’re willing to pay the price to be part of the VIP club.\n Superhuman wants to reinvent the wheel when it comes to email, but it’s hard to get around the fact that it’s still built on Gmail and G Suite. Right now, you can’t even use it with another email service at all, leaving Superhuman as a nice coat of paint and some convenient features onto the same Gmail experience you already have.\n Superhuman isn’t going to save email — even if it could, it’s not worth what it’ll charge you for the privilege.", "posttime": "2020-06-23 22:45:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,电子邮件,email", "title": "超人的电子邮件应用程序被过度炒作和定价过高", "title_en": "Superhuman’s email app is overhyped and overpriced", "transed": 1, "url": "https://www.theverge.com/21299681/superhuman-email-app-review-price-gmail-iphone-mac", "via": "", "real_tags": ["程序", "电子邮件", "email"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "搜索开发人员", "note_en": "Search Developer", "posttime": "2020-06-23 22:27:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "翻译,translation,搜索", "title": "关于罗塞塔翻译环境", "title_en": "About the Rosetta Translation Environment", "transed": 1, "url": "https://developer.apple.com/documentation/apple_silicon/about_the_rosetta_translation_environment", "via": "", "real_tags": ["翻译", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "b3f3057a97b3e54877de40eaed9b264e.jpg", "infoid": 1007796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特朗普总统暂时暂停了包括H-1B在内的新工作签证。这一暂停将持续到2021年的剩余时间，对于那些关注政府的人来说，这并不令人意外。然而，依赖H-1B寻找人才的科技公司可能会发现自己在争先恐后地寻找替代解决方案。\n这是一项涉及面很广的命令，也限制了公司在引入高技术工人之外引入高管的能力。在他的行政命令中，特朗普指出新冠肺炎疫情是这一举措背后的一个关键原因。\n“通常情况下，管理得当的临时工项目可以给经济带来好处，”他写道，“但在新冠肺炎疫情导致经济萎缩的特殊情况下，某些授权此类就业的非移民签证项目对美国工人的就业构成了不同寻常的威胁。”\n他补充说：“假设经济收缩结束，美国经济可能需要几个月的时间才能恢复到收缩前的经济产出，并需要额外的几个月来恢复稳定的劳动力需求。“有鉴于此，我决定，在2020年12月31日之前，某些外国人以移民和非移民身份入境将损害美国的利益。”\n不出所料，H-1B系统的倡导者对这一举动感到失望。支持移民的非营利组织FWD.us的总裁托德·舒尔特(Todd Schulte)告诉“纽约时报”，“这是对美国创新的全面攻击，也是对我们国家从吸引世界各地人才中获益的能力的全面攻击。”\n这项禁令是否会延长到今年年底之后，几乎肯定要取决于2020年选举的结果。\n当然，一旦解禁，事情会不会恢复到“一切如常”？在特朗普政府执政期间，H-1B申请的拒绝率稳步上升。现在，对立法进行一些调整可能会使高拒绝率面临风险。\n首先，这方面的一些背景故事。在过去的几年里，美国公民和移民服务局(USCIS)拒绝了越来越多的H-1B签证申请。这包括首次就业…的请愿书\n以及要求继续就业的请愿书(向美国国家政策基金会(NFAP)致敬，感谢他们在背后进行了一些艰难的分析)：\n然而，在与ITServe Alliance打了一场多少有些高调的法律战之后，USCIS发布了一份新的政策备忘录，并撤销了另外两份政策备忘录。在这份日期为6月17日的新备忘录中，调整了请愿人要求提供证据的要求，包括提交文件时某一特定工作存在的证据。雇主也不一定需要提供具体的日常任务的证据。\n备忘录一度写道：“如果请愿人的证明和证明文件符合这一标准(证明存在就业)，那么官员不应该要求额外的证据，应该批准请愿书，前提是证据占多数，满足所有其他资格要求。”\n根据美国国家政策基金会(National Foundation For American Policy)执行董事斯图亚特·安德森(Stuart Anderson)在福布斯发表的一篇文章，其中一份被撤销的备忘录(“Neufeld”备忘录)取消了一项确定正确雇主与雇员关系的限制性测试。这篇文章还方便地细分了这三份备忘录，通过它们的加入和缺失，可能会从根本上改变公司成功申请H-1B签证实际上需要的证据的数量。\n所有这一切的总影响是：一旦白宫放松暂停H-1B签证的申请，否认H-1B签证的比率可能会逐渐下降。其他人则表示，白宫可能会试图以其他方式限制H-1B项目的长期前景，比如将所需的最低工资提高到25万美元。然而，这些举措可能会遇到重大的法律挑战。\n成为会员有它的好处。注册一个免费的骰子档案，添加你的简历，发现伟大的职业洞察力，启动你的技术职业生涯。现在注册", "note_en": "President Trump has temporarily suspended new work visas, including the H-1B. The suspension, which will last throughout the rest of 2021, did not come as a surprise to those watching the administration. However, tech firms that depend on the H-1B to source talent may find themselves scrambling for an alternative solution.\n The order is a sweeping one, and also curtails companies’ abilities to bring in executives in addition to highly technical workers.  In his executive order, Trump cited the COVID-19 pandemic as a key reason behind the move.\n “Under ordinary circumstances, properly administered temporary worker programs can provide benefits to the economy,” he wrote. “But under the extraordinary circumstances of the economic contraction resulting from the COVID-19 outbreak, certain nonimmigrant visa programs authorizing such employment pose an unusual threat to the employment of American workers.”\n He added: “Assuming the conclusion of the economic contraction, the United States economy will likely require several months to return to pre-contraction economic output, and additional months to restore stable labor demand.  In light of the above, I have determined that the entry, through December 31, 2020, of certain aliens as immigrants and nonimmigrants would be detrimental to the interests of the United States.”\n Predictably, advocates of the H-1B system were dismayed by the move. “This is a full-frontal attack on American innovation and our nation’s ability to benefit from attracting talent from around the world,” Todd Schulte, the president of pro-immigration nonprofit FWD.us,  told  The New York Times .\n Whether the ban will extend past the end of the year will almost certainly hinge on the outcome of the 2020 election.\n  Once the ban is lifted, of course, will things return to “business as usual”? Over the course of the Trump administration, the rate of denials for H-1B petitions has steadily crept up. Now, some tweaks to legislation could put that high denial rate at risk.\n First, some backstory on this aspect of things. U.S. Citizenship and Immigration Services (USCIS) has denied an increasing number of H-1B visa applications over the past few years. That includes  petitions for initial employment…\n As well as petitions for continuing employment (hat tip to the National Foundation for American Policy (NFAP) for doing some of the hard analytics behind this):\n However, after a somewhat high-profile legal battle with the ITServe Alliance, USCIS has issued a new policy memo and rescinded two others.  The new memo, dated June 17, adjusts petitioners’ requests for evidence, including proof that a particular job exists at the time of filing. Nor do employers necessarily need to provide evidence of specific day-to-day assignments.\n “If the petitioner’s attestations and supporting documentation meet this standard [of establishing that employment exists], then the officer should not request additional evidence and should approve the petition, provided all other eligibility requirements are met by a preponderance of the evidence,” the memo states at one point.\n According to a  Forbes article by Stuart Anderson, executive director of the National Foundation for American Policy, one of the rescinded memos (the “Neufeld” memo) removes a restrictive test to determine proper employer-employee relationships. The article also provides a handy breakdown of how these three memos, by their inclusion and absence, might fundamentally change the amount of evidence that companies actually need to successfully petition for H-1B visas.\n The total impact of all this: The rate of H-1B denials may gradually go down once the White House eases its suspension. Other scuttlebutt suggests that the White House could attempt to restrict the long-term prospects of the H-1B program in other ways, such as  raising the minimum required wage to $250,000. Those steps, however, may be met with significant legal challenges.\n Membership has its benefits. Sign up for a free Dice profile, add your resume, discover great career insights and set your tech career in motion.  Register now", "posttime": "2020-06-23 22:08:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特朗普,trump,美国", "title": "特朗普暂停H-1B，其他签证", "title_en": "Trump Suspends H-1B, Other Visas Temporarily", "transed": 1, "url": "https://insights.dice.com/2020/06/23/trump-suspends-h-1b-other-visas-temporarily/", "via": "", "real_tags": ["特朗普", "trump", "美国"]}, {"category": "", "categoryclass": "", "imagename": "24e61a8175af932d24d6bfab5f86fc71.png", "infoid": 1007795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州在惩罚IMDb(互联网电影数据库)的尝试中再次失败，而IMDb本身就是因为电影制片厂犯下的年龄歧视行为，这些电影制片厂似乎拒绝挑选超过一定年龄的女演员担任精选角色。\n加州立法机构通过的法律做了一件事：阻止IMDb(和其他网站，理论上)公布关于演员的事实：即他们的年龄。这项愚蠢的法律是由电影演员工会(Screen Actors Guild)发起的，利用了一名女演员对该网站提起的(失败的)诉讼，这名女演员声称，公布她的真实年龄让她在好莱坞损失了数百万美元的工资。\n这些第一修正案的受益者认为加州的第一修正案太多了。为了保护演员不受制片厂高管的影响，SAG决定追查一个第三方网站，该网站因收集关于电影、演员和其他与电影相关的一切事实信息而备受尊敬。\n处理IMDb对该州的诉讼的联邦法院迅速利用了该州支持非常有选择性的审查制度的论点。在仅仅六页的时间里，法院就摧毁了政府最优秀的法律头脑提出的理由。这里只是法院废除这项愚蠢法律的一个样本：\nAB1687是对言语的直接限制。法律禁止某些演讲者发布某些真实信息-在许多情况下，这些信息是由公众提供的-因为担心第三方可能会利用这些信息从事非法行为。\nSAG-AFTRA辩称，可以禁止公布娱乐业人员的年龄事实，因为这些事实助长了年龄歧视-如果成功，这一论点将使各州能够禁止公布几乎任何事实。\n法院还指出，针对IMDb的法律没有解决根本问题。事实上，看起来该州甚至没有解决正确的问题。\n被告将此描述为年龄歧视问题。虽然这在某种程度上可能是准确的，但从根本上说，这更多的是性别歧视问题。电影制片人通常不会因为男主角对女主角来说年龄太大而拒绝让他当男主角；除非她比男主角年轻得多，否则未来的女主角才会得到这个角色。电视网通常不会因为男性新闻主播被认为太老而抛弃他们；女性主播的成功往往取决于她们的年轻。这并不是因为娱乐业本身就有老年人的问题。相反，这是该行业坚持将女性物化的一种表现，高估她们的外表，贬低其他一切。\n该州提出上诉，第九巡回上诉法院并不比下级法院印象更深刻。(法院新闻处)。\n基于内容的限制通常违反第一修正案。针对某些演讲者和他们发出的非常具体的演讲也是如此。根据意见[PDF]：\n从表面上看，AB 1687因其内容而限制言论。它禁止传播一种类型的言论：“出生日期或年龄信息。”而且，也许更令人不安的是，它只限制了单一类别的演讲者。因此，AB1687对一种语言类别“施加了直接而重要的限制”。它一般不适用。\n该州辩称，这只影响了付费控制其个人资料中包含的信息的网站订户。上诉法院表示，这并不重要。这项法律针对的不仅仅是付费账户。它禁止传播由第三方提供的年龄信息。\n该规约不仅限制通过当事各方的合同关系盗用的信息；它还禁止公布与IMDb无关的公众提交的信息。无论IMDb公共配置文件是否独立于IMDb和IMDbPro订户之间的任何合同协议存在，或在此之前存在，这些限制都适用。\n即使付费账户转手，目标演讲也不是商业演讲。该网站将自己称为数据库是有原因的。这使国家的论点无效。\n这些免费的公开资料可以在一个“在线信息数据库”中找到，周围的内容“包括演员、制作人员、虚构人物、传记、剧情总结、琐事和评论等信息”。内容是百科全书式的，而不是交易式的。\n法院还免除了州政府的论点，即年龄信息的公布允许其他各方从事非法歧视。它通过指出一个显而易见的事实来做到这一点：反歧视性法律的目标应该是那些实际从事歧视行为的实体。\n如果被接受，SAG对匹兹堡出版社的解释将要求本法院不仅允许限制提出非法活动的言论，而且允许限制第三方可能用来为自己的非法行为提供便利的表面上的非攻击性言论。[.]。典型的“制止违法行为的方法”不是限制诚实的言论，而是对从事违法行为的人进行适当的惩罚。\n法院还指出，这项法律似乎是专门为防止一个网站发布年龄信息而制定的。这并不是第一修正案意义上的狭隘定制的意思。狭隘的裁剪可以施加通过第一修正案测试的言论限制。针对一个网站，而允许其他网站自由发布法律规定的IMDb不能发布的内容，这是违反宪法的。\n从表面上看，AB 1687只限制了像IMDb.com这样的网站，而不限制任何其他可能传播年龄信息的渠道。这在这里引起了严重的关注，因为AB1687似乎只针对IMDb而设计。\nAB 1687的包容性较低，因为它未能触及几个潜在的年龄信息来源，并且只保护同时订阅此类服务和选择加入的行业专业人员。这一弊病意味着该法规不是严格定制的，因此是违宪的。\n非法的年龄歧视在娱乐业或任何其他行业都没有立足之地。但并不是所有结束这种歧视的法定手段都是合宪的。在这里，我们讨论基于内容的言论限制，并认为AB 1687在表面上是违宪的，因为它没有通过第一修正案的审查。\n即使这项法律以某种方式经受住了第一修正案的挑战，它仍然不能阻止制片厂从事歧视性的招聘做法。如果这真的是政府的担忧，它应该加强对娱乐业的监管，而不是只有一个网站被一位女演员起诉但未获成功，她猜测IMDb与她的年龄相仿的出版是她没有得到她想要的角色的原因。", "note_en": "The state of California has lost again in its attempt to punish IMDb (the Internet Movie Database) -- and IMDb  alone -- for ageism perpetrated by [checks notes]  movie studios who seem to refuse to cast actresses above a certain age in choice roles.\n The law passed by the California legislature does one thing: prevents IMDb (and other sites, theoretically) from publishing facts about actors: namely, their ages. This stupid law was ushered into existence by none other than the Screen Actors Guild, capitalizing on a  (failed) lawsuit brought against the website by an actress who claimed the publication of her real age cost her millions in Hollywood paychecks.\n These beneficiaries of the First Amendment decided there was just too much First Amendment in California. To protect actors from studio execs, SAG decided to go after a third-party site respected for its collection of factual information about movies, actors, and everything else film-related.\n The federal court handling  IMDb&#39;s lawsuit against the state  made quick work of the state&#39;s arguments in favor of very selective censorship. In only six pages, the court destroyed the rationale offered by the government&#39;s finest legal minds. Here&#39;s just a sampling of the court&#39;s dismantling of this stupid law:\n AB 1687 is a direct restriction on speech. The law prohibits certain speakers from publishing certain truthful information – information that, in many instances, is supplied by members of the public – because of concerns that a third party might use that information to engage in illegal conduct.\n  SAG-AFTRA contends that publication of facts about the ages of people in the entertainment industry can be banned because these facts &#34;facilitate&#34; age discrimination – an argument that, if successful, would enable states to forbid publication of virtually any fact.\n The court also pointed out that the law targeting IMDb did nothing to address the underlying problem. In fact, it appeared the state wasn&#39;t even addressing the right problem.\n The defendants describe this as a problem of &#34;age discrimination.&#34; While that may be accurate on some level, at root it is far more a problem of sex discrimination. Movie producers don&#39;t typically refuse to cast an actor as a leading man because he&#39;s too old for the leading woman; it is the prospective leading woman who can&#39;t get the part unless she&#39;s much younger than the leading man. TV networks don&#39;t typically jettison male news anchors because they are perceived as too old; it is the female anchors whose success is often dependent on their youth. This is not so much because the entertainment industry has a problem with older people per se. Rather,  it&#39;s a manifestation of the industry&#39;s insistence on objectifying women, overvaluing their looks while devaluing everything else.\n The state appealed and the Ninth Circuit Appeals Court is no more impressed than the lower court. (h/t  Courthouse News Service)\n Content-based restrictions are generally First Amendment violations. So is the targeting of certain speakers and very specific speech emanating from them. From the  opinion [PDF]:\n On its face, AB 1687 restricts speech because of its content.  It prohibits the dissemination of one type of speech: “date of birth or age information.” And, perhaps more troubling, it restricts only a single category of speakers. Thus, AB 1687 “impose[s] direct and significant restrictions” on a category of speech. It does not apply generally.\n The state argued that this only affected subscribers to the site who paid to control the information contained in their profiles. The Appeals Court says this doesn&#39;t matter. The law targets more than paid accounts. It forbids the dissemination of age information contributed by third parties.\n The statute does not restrict only information misappropriated through the parties’ contractual relationship; it also prohibits the publication of information submitted by members of the public with no connection to IMDb. These restrictions apply regardless of whether an IMDb public profile existed independent of, or prior to, any contractual agreement between IMDb and an IMDbPro subscriber.\n Even if money changes hands for paid accounts, the speech being targeted is not &#34;commercial&#34; speech. The site refers to itself as a &#34;database&#34; for a reason. And that nullifies the state&#39;s argument.\n These free, publicly available profiles are found in an “online database of information” and are surrounded by content that “includes information on cast, production crew, fictional characters, biographies, plot summaries, trivia and reviews.” The content is encyclopedic, not transactional.\n The court also dispenses with the state&#39;s argument that the publication of age information allows other parties to engage in illegal discrimination. And it does so by pointing out the obvious: the target of anti-discriminatory laws should be the entities that actually engage in discriminatory behavior.\n If accepted, SAG’s interpretation of Pittsburgh Press would require this court to permit the restriction not only of speech that proposes an illegal activity but also facially inoffensive speech that a third-party might use to facilitate its own illegal conduct. [...] Rather than restrict truthful speech,  the typical “method of deterring unlawful conduct is to impose an appropriate punishment on the person who engages in it.”\n The court also notes that the law appears to have been crafted specifically to prevent one site from publishing age information. That&#39;s not what &#34;narrowly-tailored&#34; means in the First Amendment sense of the phrase. Narrow tailoring can impose speech restrictions that pass the First Amendment test. Targeting one site while leaving others free to publish what the law says IMDb cannot isn&#39;t Constitutional.\n On its face, AB 1687 restricts only websites like IMDb.com while leaving unrestricted every other avenue through which age information might be disseminated. This presents serious concerns here because AB 1687 appears designed to reach  only IMDb.\n  AB 1687 is underinclusive because it fails to reach several potential sources of age information and protects only industry professionals who both subscribe to such service and who opt-in. This malady means that the statute is not narrowly tailored, and thus, is unconstitutional.\n  Unlawful age discrimination has no place in the entertainment industry, or any other industry. But not all statutory means of ending such discrimination are constitutional. Here, we address content-based restrictions on speech and hold that AB 1687 is facially unconstitutional because it does not survive First Amendment scrutiny.\n Even if the law had somehow survived a First Amendment challenge, it still wouldn&#39;t have prevented studios from engaging in discriminatory hiring practices. If this was really the state&#39;s concerns, it would have stepped up its regulation of the entertainment industry, rather than a single site that was unsuccessfully sued by an actress, who speculated IMDb&#39;s publication of her age was the reason she wasn&#39;t landing the roles she wanted.", "posttime": "2020-06-23 21:17:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "法院,court,年龄", "title": "上诉法院称加州以IMDb为目标的“年龄歧视”法律违宪", "title_en": "Appeals Court Says California's IMDb-Targeting 'Ageism' Law Is Unconstitutional", "transed": 1, "url": "https://www.techdirt.com/articles/20200620/15245844750/appeals-court-says-californias-imdb-targeting-ageism-law-is-unconstitutional.shtml", "via": "", "real_tags": ["法院", "court", "年龄"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SCI-Hub.tw/10.1038/s41565.020707-4", "note_en": "sci-hub.tw/10.1038/s41565-020-0707-4", "posttime": "2020-06-23 20:07:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阻碍,absorb,sci", "title": "植物吸收纳米塑料，阻碍生长", "title_en": "Plants absorb nanoplastics, hindering growth", "transed": 1, "url": "https://sci-hub.tw/10.1038/s41565-020-0707-4", "via": "", "real_tags": ["阻碍", "absorb", "sci"]}, {"category": "", "categoryclass": "", "imagename": "530ec1a36c6ddc7d49836b6755e16d50.jpg", "infoid": 1007793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们推出Riot已经将近四年了，这是一段疯狂的旅程-从一个相对简单的Matrix应用程序，到今天的全唱全舞默认加密协作工具，从Mozilla到法国政府等国的人们都在使用。\n然而，正如一些人可能知道的那样，多年来，我们在使用Riot这个名字时遇到了一些问题。首先，到目前为止，最大的问题来自某家大型游戏公司，该公司一直在阻止我们为Riot甚至Riot.im注册商标-当涉及到保护用户免受应用程序滥用分支的影响时，这一直是一个大问题。如果有人使用相同或相似的名称和徽标来分叉Riot，做出一些可疑的更改，而我们无法采取行动说服应用商店将其删除，我们的处境就很糟糕了。\n其次，我们选择了“Riot”这个名字来唤起一些颠覆性和充满活力的东西-就像“五颜六色的狂欢”。移动应用程序上的加载动画之所以会在完全不同版本的徽标中横冲直撞是有原因的。然而，许多人听到Riot这个词，就会认为这款应用程序专注于暴力-事实并非如此。\n最后，我们发现用户可能会对Riot周围的不同品牌感到非常困惑。我们无法摆脱这样一个事实，Riot是建立在Matrix之上的，而不是另一个孤立的通信应用。然而，为什么Riot是由一家名为New Vector的公司制造的？为什么我要从Modular为Riot购买服务器，它们与Riot或New Vector有什么关系？RiotX是什么？毕竟，当我使用SLACK时，它是由一家名为SLACK的公司制造的，该公司提供名为…的主机。松懈。同样不和谐。同样，Rocket.chat和许多其他网站也是如此。早在2016年，从Matrix的角度来看，创建三个不同的品牌来阐明生态系统的模块性可能是有意义的-但现在有许多其他Matrix客户、供应商和托管提供商完美地展示了Matrix生态系统的多样性。\n一旦我们准备好了，新名称将在几周内宣布，但我们想给每个人一个提醒，这样就不会让人感到震惊。\n这显然是一个大胆的举动：我们花了四年时间建立Riot的声誉，并说服每个人都将他们的朋友、家人和团队转移到它上面。更名不可避免地会造成一些混乱。我们知道，你们中的许多人在阅读这篇文章时会冒着风险让人们采用Riot，我们真的理解不得不向用户解释这一变化是多么令人沮丧。\n然而，我们非常有信心，现在是修改名称的合适时机。我们正在对Riot的用户体验和可用性进行巨大的改进，这将极大地改善这款应用程序。事实上，它是如此难以辨认，以至于我们可以脱下我们的皮，庆祝我们期待已久的转变为一个真正的主流可用的应用程序。最重要的是，我们终于找到了一个我们真的很兴奋的名字(比我们以前对Riot的兴奋要多得多)，我们希望你也会喜欢它！\n所以…。注意这个空间。我们将在接下来的几周里低调工作，把我们在飞行中的所有一波又一波的改进集中在一起，然后所有的事情都会公之于众。\n感谢您对Riot的使用和支持。“我们在另一边见！”", "note_en": "It&#39;s almost four years since we launched Riot, and it&#39;s been a crazy journey - going from a relatively bare bones Matrix app through to today&#39;s all-singing, all-dancing encrypted-by-default collaboration tool used by folks ranging from Mozilla to the French Government and beyond.\n However, as some may know, we’ve had a few problems with the name Riot over the years.  Firstly, the biggest by far has been from a certain large games company that has consistently blocked us from being able to trademark Riot or even Riot.im - which has been a huge issue when it comes to defending users against abusive forks of the app. We’re in a terrible position if someone forks Riot using the same or similar name and logo, makes some dubious changes, and we can’t take action to persuade the app stores to remove it.\n Secondly, we picked the name “Riot” to evoke something disruptive and vibrant - like a “riot of colour.”  There’s a reason the loading animation on the mobile apps has been of the logo running riot through completely different versions of the logo.  However, many people hear the word Riot and assume that the app is focused on violence - which it is not.\n Finally, we’ve found that users can get very confused by the different brands that surround Riot. We can’t get away from the fact that Riot builds on Matrix rather than being yet another siloed communication app. However, how come Riot is made by a company called New Vector? Why should I get a server for Riot from Modular, and what do they have to do with Riot or New Vector? What’s RiotX? After all, when I use Slack, it’s made by a company called Slack, who provide hosting called… Slack. Likewise Discord. Likewise Rocket.chat and many others. Back in 2016 it may have made sense from a Matrix standpoint to create three different brands to spell out the modularity of the ecosystem - but nowadays there are lots of other Matrix clients, vendors and hosting providers that demonstrate perfectly the diversity of the Matrix ecosystem.\n  The new name will be announced in a few weeks once we’re ready, but we wanted to give everyone a heads up so it doesn’t come as a shock.\n This is obviously a bold move: we’ve spent four years building up Riot’s reputation and persuading everyone to move their friends, families and teams onto it. Renaming is inevitably going to cause some confusion. We know that many of you reading this will have put their neck on the line to get folks to adopt Riot, and we really appreciate how frustrating it may be to have to explain the change to your users.\n However, we are extremely confident that now is the right time to fix the name. We’re in the process of landing gigantic improvements to Riot’s user experience and usability which will unrecognisably improve the app.  So unrecognisably, in fact, that we can shed our skin and celebrate our long-awaited transition into being a truly mainstream-usable app.  And most importantly, we’ve finally found a name which we’re really excited about (much more than we ever were about Riot!), and we hope you’ll like it too!\n So… watch this space. We’re going to have our heads down for the next few weeks while we pull together all the waves of improvements we have in flight, and then all shall be revealed.\n Thanks for using and supporting Riot.  We’ll see you on the other side!", "posttime": "2020-06-23 20:07:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "changing,riot", "title": "世界正在改变[将重命名的Riot Matrix客户端]", "title_en": "The world is changing [Riot Matrix client to be renamed]", "transed": 1, "url": "https://blog.riot.im/the-world-is-changing/", "via": "", "real_tags": ["changing", "riot"]}, {"category": "", "categoryclass": "", "imagename": "a373cb2889382777c70615f7881d03af.jpg", "infoid": 1007791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为今年夏天离开地球的下一次火星任务的一部分，航天局将尝试做一些以前从未做过的事情：驾驶一架直升机穿过火星稀薄的大气层。\n如果成功，这架名为“独创号”的小型直升机将为未来的机器人探险者打开一条鸟瞰火星和太阳系其他世界的新途径。\n过去六年，NASA喷气推进实验室火星直升机项目经理Mimi Aung说：“这非常类似于莱特兄弟的时刻，但在另一个星球上。”\n在火星上飞行不是一件微不足道的事情。那里没有太多的空气可以推动产生升力。在火星表面，大气层的密度只有地球的1/100。较小的重力--你在这里感觉到的三分之一--有助于升空。但是从火星表面起飞相当于在地球上10万英尺的高度飞行。从来没有地面直升机飞得那么高，这是喷气式客机通常飞行高度的两倍多。\n这架直升机将坚持不懈地搭便车前往这颗红色星球，这将是NASA派遣到那里的第五辆机器人漫游车。这项任务计划于7月20日发射，这是今年前往火星的三项任务之一。\n在上周的一次新闻发布会上，美国宇航局局长吉姆·布里登斯廷(Jim Bridenstine)在预览毅力任务时，特别强调了独创性。他说：“我要告诉你，作为一名NASA管理员，最让我兴奋的事情是准备观看直升机在另一个世界上飞行。”\n在1997年之前，所有送到火星表面的航天器都是文具着陆器。但在1997年，探路者任务包括了对NASA来说具有革命性的东西：一个轮式机器人。这辆名为“索尤纳”的月球车大约有一个短小的文件柜大小。继这一成功之后，两辆高尔夫球车大小的漫游车“勇气号”和“机遇号”于2004年抵达火星，然后在2012年抵达了大约一辆汽车大小的“好奇号”。\n对于在另一个星球上的机器人探险家来说，四处移动的能力提供了巨大的优势。\n行星科学家不再拘泥于盯着一个地方。漫游者可以驾车穿越这片风景，停下来近距离观察有趣的岩石。这种自由是获得目前对早期火星的理解的关键，即这颗星球现在又冷又干，曾经是潮湿的，至少拥有一些可能适合生命居住的环境。\n“独创性”本质上是“旅居者”的空中对应物，展示了一种新技术，这种技术可能会在以后的任务中得到更广泛的应用。巧妙的身体大约是一个垒球大小，有四条细长的腿伸出。两组叶片，从尖端到尖端各约4英尺，以相反的方向旋转。它只有4磅重，大约1.5英尺高。\n直升机总工程师鲍勃·巴拉拉姆(Bob Balaram)早在20世纪90年代就开始与一些同事合作研究这个想法。\n“它并没有真正发挥作用，”巴拉拉姆博士说。“我们确实做了一些小测试，但后来它被搁置了，直到大约六七年前。”\n他说，时任喷气推进实验室主任的查尔斯·埃拉奇(Charles Elachi)产生了兴趣，并为进一步研究提供了资金。“这让我们继续前进，”巴拉拉姆博士说。\n做以前从未做过的事情是一项工程挑战，吸引了昂山素季，她于2014年年中加入，担任项目经理。\n“大约20年前，这是不可能的，真的，因为数学上的原因，”昂山素季说。在加入火星项目之前，她是喷气推进实验室自主系统部门的副经理。\n但昂山素季说，一些进步，比如电子产品的微型化、储存更多能量的电池，以及可以做成轻质叶片的材料，终于让火星飞行器的梦想在技术上成为了可能。\n到2014年底，工程师们已经建造了一个小型原型。这架小型直升机被放置在一个房间里，那里的大部分空气被吸入，复制了火星大气的密度。因为他们还没有编写直升机自己飞行的软件，团队中的一名成员试图用操纵杆来引导它的运动，就像业余爱好者驾驶无人机一样。\n领导空气动力学和实现可控飞行工作的工程师哈瓦德·格里普(Havard Grip)说，“它做了我们当时必须做的事情，那就是说我们实际上可以离开地面。”“因此，从这方面来说，这是一次成功。但很明显，要了解这种东西的行为方式，还有很多工作要做。“。\n巴拉拉姆博士和格里普博士说，其中一个问题是，叶片在以每分钟2000到3000转的速度旋转时会上下反弹。在地球上，空气对叶片的压力会使弹跳最小化。但在火星稀薄的大气中，弹跳造成了不稳定，使得直升机的运动很难控制。\n解决方案原来是让叶片稍微坚硬一些，但这增加了一些重量。\n“我认为，在早期找到一个合适的设计是最大的问题之一，”格里普博士说。最终，他们找到了解决方案。\n“当你举起这些刀片中的一个时，如果你把它拿在手里，你会认为你要举起一些实质性的东西，而且它像空气一样轻，同时又极其僵硬，这是相当令人震惊的。”\n这项工程涉及一系列折衷方案，以适应尺寸、重量和电池电量的限制。\n与此同时，格里普博士带头开发了计算机算法，这些算法将能够足够快地操纵和调整直升机的飞行，以自动对火星上不断变化的大气条件做出反应。\n2016年5月，下一个原型准备就绪。在模拟透明的火星大气层的同一个舱里，直升机上升，然后稳定地盘旋并软着陆。第一次，一架直升机原型在模拟火星大气的条件下进行了控制飞行，尽管它仍然连接着外部电源和计算机。\n完整的设计，包括电池，一个高通骁龙处理器，与手机、通信系统和传感器完全集成在一起，于2018年1月准备就绪。为了模仿火星较弱的引力，一个滑轮向上拉以抵消部分地球引力。房间里的空气密度又被抽了下来。但这一次，没有留下少量的地球空气，而是注入了少量二氧化碳-火星空气的主要成分。\n半年后，NASA批准将直升机添加到NASA的下一次火星漫游车任务“毅力”中。\n现在，“毅力”号的肚子上贴上了独创性，它正在为从佛罗里达州卡纳维拉尔角发射进行最后的准备。\n与此同时，昂山素季和她的团队正在排练一旦“独创号”登上火星，他们将会做些什么。由于喷气推进实验室由于冠状病毒大流行而基本上关闭，所有的工作都是通过电话会议完成的，所有的团队成员都在家里工作。\n在2月份毅力登陆火星大约两个月后，对独创性的测试将开始。漫游者会找到一个合适的平坦的地方，把直升机扔到地上，然后开到至少100码远的地方。昂山素季说，“直升机再也不会回到月球车那里了。”\n在30天内，直升机将进行最多5次飞行。大部分时间都会坐在那里等待太阳能电池板给电池充电。\n第一种是上升几英尺，盘旋30秒，然后着陆。随后的飞行将会更长、更高、更远。在第五次飞行中，如果一切正常，“匠心”号将上升约15英尺，飞出500英尺，然后回到它开始的地方。它有两个摄像头：一个是向下的黑白摄像头，用于跟踪它所在的位置；另一个是彩色摄像头，用于斜视风景。这次飞行将持续一分半钟。\n一旦飞行完成，独创性将留在最后的着陆点，毅力将驱车完成剩余的任务。\n昂说，这项技术可以改装成更大的飞船，重量最高可达30磅左右，而不是4磅。它可能足够大，可以携带几磅的相机和其他仪器。\n美国国家航空航天局已经计划向土星最大的卫星泰坦发射一架核动力旋翼机--蜻蜓。但土卫六的大气层很厚，因此在那里飞行不会带来与火星相同的技术挑战。\n即使未来的直升机前往火星，它们几乎可以肯定永远不会成为那里的宇航员可行的交通工具。\n“你不会想到把它扩展到可以像在地球上那样载人飞行的地方，”昂山素季说。“就是没有足够的气氛。”", "note_en": "As part of its next mission to Mars, leaving Earth this summer, the space agency will attempt to do something that has never been done before: fly a helicopter through the rarefied atmosphere of Mars.\n If it works, the small helicopter, named Ingenuity, will open a new way for future robotic explorers to get a bird’s-eye view of Mars and other worlds in the solar system.\n “This is very analogous to the Wright brothers moment, but on another planet,” said MiMi Aung, the project manager of the Mars helicopter at NASA’s Jet Propulsion Laboratory over the past six years.\n Flying on Mars is not a trivial endeavor. There is not much air there to push against to generate lift. At the surface of Mars, the atmosphere is just 1/100th as dense as Earth’s. The lesser gravity — one-third of what you feel here — helps with getting airborne. But taking off from the surface of Mars is the equivalent of flying at an altitude of 100,000 feet on Earth. No terrestrial helicopter has ever flown that high, and that’s more than twice the altitude that jetliners typically fly at.\n The copter will hitch a ride to the red planet with Perseverance, which is to be the fifth robotic rover NASA has sent there. The mission is scheduled to launch on July 20, one of three missions headed to Mars this year.\n At a news conference last week previewing the Perseverance mission, Jim Bridenstine, the NASA administrator, made a point to highlight Ingenuity. “I’ll tell you, the thing that has me the most excited as an NASA administrator is getting ready to watch a helicopter fly on another world,” he said.\n  Until 1997, all of the spacecraft sent to the surface of Mars had been stationery landers. But in 1997, the Pathfinder mission included something that was revolutionary for NASA: a wheeled robot. That rover, Sojourner, was roughly the size of a short filing cabinet. That success was followed by two golf cart-size rovers, Spirit and Opportunity, arriving on Mars in 2004 and then Curiosity, about the size of a car, in 2012.\n For a robotic explorer on another planet, the ability to move around offers great advantages.\n Planetary scientists are no longer stuck staring at one spot. A rover can drive across the landscape, stopping for closer looks at intriguing rocks. That freedom was key to gaining the current understanding of early Mars, that the planet, now cold and dry, was once wet and possessed at least some environments that were potentially habitable for life.\n Ingenuity is in essence the aerial counterpart of Sojourner, a demonstration of a novel technology that might be used more extensively on later missions. The body of Ingenuity is about the size of a softball with four spindly legs sticking out. Two sets of blades, each about 4 feet from tip to tip, spin in opposite directions. It weighs just 4 pounds and stands about one and a half feet high.\n Bob Balaram, the chief engineer for the helicopter, started working with some colleagues on the idea back in the 1990s.\n “It didn’t really go anywhere,” Dr. Balaram said. “We did run some small tests, but then it sat on the shelf till about six, seven years back.”\n He said Charles Elachi, then the director of the Jet Propulsion Laboratory, became interested and provided money for further study. “And that got us going,” Dr. Balaram said.\n Doing something that had never been done before was an engineering challenge that appealed to Ms. Aung, who joined as the project manager in the middle of 2014.\n “About 20 years ago, it couldn’t have been possible, really, because of the math,” said Ms. Aung who was a deputy manager of the Jet Propulsion Laboratory’s autonomous systems division before joining the Mars project.\n But a number of advances, such as miniaturization of electronics, batteries that stored more energy and materials that could be shaped into lightweight blades, had finally made the dream of Mars flying machines into a technological possibility, Ms. Aung said.\n  By the end of 2014, the engineers had built a small prototype. The little helicopter was placed in a chamber where most of the air was sucked out, replicating the density of the Martian atmosphere. Because they had yet to write the software for the helicopter to fly itself, a member of the team tried to guide its motion with a joystick, like a hobbyist flying a drone.\n  “It did kind of what we had to do at that point, which was say we can actually get off the ground,” said Havard Grip, the engineer who led work on aerodynamics and achieving controlled flight. “So in that way, it was a success. But it also was clear that there was a lot more work to be done here on understanding how this thing behaves.”\n Dr. Balaram and Dr. Grip said one problem was that the blades bounced up and down as they spun at 2,000 to 3,000 revolutions a minute. On Earth, the pressure of the air pushing against the blades minimizes the bouncing. But in the thin Martian atmosphere, the bouncing created an instability that made it hard to control the motion of the helicopter.\n The solution turned out to be making the blades slightly stiffer, but that added some weight.\n “Arriving at a suitable design for that was, I think, one of the biggest issues early on,” Dr. Grip said. Eventually, they found a solution.\n “It’s quite astounding when you lift one of these blades, if you hold it in your hand, you think you’re going to lift something substantial, and it’s as light as air and, at the same time, extremely stiff.”\n The engineering involved a series of compromises needed to fit within the constraints of size, weight and battery power.\n Dr. Grip at the same time spearheaded the development of computer algorithms that would be able to steer and adjust the flight of the helicopter quickly enough to automatically respond to shifting atmospheric conditions on Mars.\n In May 2016, the next prototype was ready. In the same chamber simulating the diaphanous Martian atmosphere, the helicopter rose, then hovered steadily and softly landed. For the first time, a helicopter prototype had flown under control in conditions that simulated the Martian atmosphere, although it was still connected to an external power source and computer.\n The complete design, with the batteries, a Qualcomm Snapdragon processor that is the same as those in cellphones, communication systems and sensors all integrated, was ready in January 2018. To mimic the weaker gravitational pull of Mars, a pulley pulled upward to counteract part of Earth’s gravity. The density of air in the chamber was pumped down again. But this time, instead of leaving wisps of Earth air, a bit of carbon dioxide — the main constituent of Martian air — was pumped in.\n  Half a year later, NASA gave the go-ahead for adding the helicopter to NASA’s next Mars rover mission, Perseverance.\n Ingenuity is now attached to the belly of Perseverance, which is undergoing final preparations for launch from Cape Canaveral, Fla.\n In the meantime, Ms. Aung and her team are rehearsing what they will be doing once Ingenuity is on Mars. With the Jet Propulsion Laboratory largely shutdown because of the coronavirus pandemic, all that work has been done via teleconferences, with all of the team members working at home.\n About two months after Perseverance lands on Mars in February, the tests of Ingenuity will begin. The rover will find a suitably flat spot, drop the helicopter onto the ground, then drive away at least 100 yards away. “The helicopter never returns to the rover,” Ms. Aung said.\n  Over 30 days, the helicopter will make up to five flights. Much of the time will be sitting around waiting for solar panels to recharge the batteries.\n The first is to go up about a few feet and hover for up to 30 seconds, then land. Subsequent flights will be longer, higher, farther. On the fifth flight, if everything works, Ingenuity will go up about 15 feet, fly out 500 feet and then return back to where it started. It has two cameras: a downward-facing, black-and-white one for keeping track of where it is; and a color one for oblique views of the landscape. The flight will last a minute and a half.\n Once the flights are done, Ingenuity will be left at its final landing site, and Perseverance will drive off for the rest of its mission.\n Mr. Aung said that the technology could be adapted to a bigger craft, up to about 30 pounds in weight instead of four. That might be large enough to carry a couple of pounds of cameras and other instruments.\n Already, NASA has plans for sending  Dragonfly, a nuclear-powered rotorcraft to Titan, the largest moon of Saturn. But Titan has a thick atmosphere, so flying there does not pose the same technological challenges as Mars.\n Even if future helicopters are headed to Mars, they will almost certainly never be a viable mode of transportation for astronauts there.\n “You wouldn’t envision extending it to where you can fly humans like you can on Earth,” Ms. Aung said. “There just isn’t enough atmosphere.”", "posttime": "2020-06-23 19:48:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火星,nasa,美国,sending", "title": "美国国家航空航天局正在向火星发射一架实验直升机", "title_en": "NASA is sending an experimental helicopter to Mars", "transed": 1, "url": "https://www.nytimes.com/2020/06/23/science/mars-helicopter-nasa.html", "via": "", "real_tags": ["火星", "nasa", "美国", "sending"]}, {"category": "", "categoryclass": "", "imagename": "a47535f4e1347c1a7848001131f68552.jpg", "infoid": 1007790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加利福尼亚州奥克兰。-杰克·多尔西(Jack Dorsey)在冠状病毒危机期间的企业行动主义赢得了喝彩，他以推特(Twitter)首席执行官的身份挑战特朗普总统，并将总财富的近三分之一捐给了大流行救援工作。\n但在多尔西的另一家公司Square，也是他兼任首席执行官的支付业务，他面临着越来越多的不满客户。\n数以千计使用Square处理信用卡交易的小企业-包括水管工、法律顾问和建筑公司-抱怨称，该公司最近开始扣留他们从客户那里收取的20%到30%的钱。他们说，扣留是在没有任何警告的情况下进行的，Square声称有权在接下来的四个月里保留这笔钱。\nSquare告诉他们，这样做是为了保护他们免受高风险交易或要求退款的客户的影响。但几家受影响的企业向《纽约时报》提供的文件显示，他们没有任何回报或风险标志。\n他们说，Square在经济脆弱的时候不公平地向他们隐瞒资金，以保护自己的底线。他们补充说，这让他们的小企业陷入财务困境，迫使他们裁员，削减扩张计划，申请贷款，错过抵押贷款还款。\n华盛顿州奥林匹亚建筑公司Pennywise Contract的老板杰西·拉森(Jesse Larsen)说，“让我们倒闭的可能不是冠状病毒，而是Square的贪婪。”\n他说，Square在5月初开始持有每笔交易的30%，这笔交易对他来说总计数千美元。他说，没有这些资金，他不得不暂停招聘，出售一艘船和其他个人财产，以维持公司的运营。", "note_en": "OAKLAND, Calif. — Jack Dorsey has won plaudits for his corporate activism during the coronavirus crisis,  taking on President Trump in his role as Twitter’s chief executive and  donating nearly a third of his total wealth to pandemic relief.\n But at Mr. Dorsey’s other company, Square, a payments business where he is also chief executive, he is facing a growing chorus of unhappy customers.\n Thousands of small enterprises that use Square to process their credit card transactions — including plumbers, legal consultants and construction firms — have complained that the company recently began holding back 20 to 30 percent of the money they collected from customers. The withholdings came with little warning, they said, and Square asserted the right to hang on to the money for the next four months.\n Square told them that it was doing this to protect against risky transactions or customers who demanded their money back. But several affected businesses provided documents to The New York Times showing they had not had any returns or risk flags.\n Square was unfairly keeping money from them at an economically vulnerable time to protect its own bottom line, they said. That had thrown their small businesses into financial difficulties, they added, forcing them to lay off employees, cut expansion plans, take out loans and miss mortgage payments.\n “It may not be the coronavirus that puts us out of business but actually the greed of Square that breaks the camel’s back,” said Jesse Larsen, the owner of PennyWise Contracting, a construction company in Olympia, Wash.\n He said Square had begun holding on to 30 percent of each transaction in early May, which totaled thousands of dollars for him. Without those funds, he said, he had to put a hold on hiring and sell a boat and other personal property to keep his company operating.", "posttime": "2020-06-23 19:48:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "扣留,withholding,square", "title": "Square扣留了商家说他们需要的钱", "title_en": "Square Is Withholding Money Merchants Say They Need", "transed": 1, "url": "https://www.nytimes.com/2020/06/23/technology/square-jack-dorsey-pandemic-withholding.html", "via": "", "real_tags": ["扣留", "square"]}, {"category": "", "categoryclass": "", "imagename": "6f72ef899440589492e7e2420f06f501.jpg", "infoid": 1007789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "只有大约4.72%的网络用户使用它，但Linux基金会的人员都是微软团队的成员，他们在其他网站/服务中使用Windows，甚至在庆祝系统管理员日(Sysadmin Day)时也使用Windows。\n摘要：另一个主要的侥幸来自非Linux基金会，它现在在Linux基金会的官方博客和Linux.com上推广一个Windows站点(Linux基金会时事通讯…。是Windows)。\n如果你喜欢这篇文章，可以考虑订阅RSS提要，或者现在就加入我们的IRC频道。\n微软裁员，不到一个月内第二次裁员(人们失去了Mixer)企业媒体或大多数新闻现在更愿意让我们关注Facebook(而不是Mixer裁员和关闭)；GitHub可能是下一个，因为它损失了很多钱；一切都是关于控制和杠杆，没有其他。\n日益企业化的FSF&34；的含义是，谁来捍卫我们的4项自由呢？那些贿赂看门狗的人？斩首我们组织的人？&#34；\nLinux Foundation时事通讯是Microsoft Windows和专有的IIS，这是非Linux基金会的另一个重大侥幸，它现在在Linux基金会的官方博客和Linux.com上推广一个Windows站点(Linux Foundation时事通讯…。是Windows)。\n长期在美国和欧洲法院撒谎的律师正在反击诉讼公司和专利流氓的阴谋；律师事务所不是像他们应该的那样不断发展，而是对真相本身提出指控。\n西雅图警察局在第一期中编辑的三件事我们强调了西雅图警察局的“信息自由法”工作人员预先声明的事情不会包括在披露的文件中。\n在这篇“嗨，嗨”(AI)的吹捧文章发表几个小时后，Mozilla从微软聘请了Mozilla的董事会成员。Mozilla的新任首席执行官在“加入Mozilla董事会”时欢迎“微软前人工智能产品开发总监”。\n[幽默]诉讼行业运营的司法和消费者保护部(“BMJV”)令人震惊的披露：司法和消费者保护部(“BMJV”)似乎不关心正义，更不用说消费者了；它也不关心法律、真相和宪法。\n提醒德国读者：请礼貌地投诉司法和消费者保护部(“BMJV”)试图破坏宪法联邦司法和消费者保护部(“BMJV”)正试图在德国造成宪法危机-所有这些都是为了安抚诉讼狂热分子，包括专利巨魔和甚至不是德国(更不用说欧洲)的大公司。\n[幽默]在Reddit上你不能说的话Reddit之于言论自由和表达自由，就像微软之于道德。\n比尔·盖茨的私人工程师非法拥有枪支。警方显然从未为此起诉过他。比尔的工程师可能受到的指控比我们所知道的要多；他只用了惊人的短刑期就逃脱了惩罚，这引发了人们对法律制度(和执法)的客观性的质疑。\n来自渥太华的David在Reddit上检测和撤销/撤销对微软批评者的审查建议了跟踪被审查的评论并恢复它们供读者评估的方法(尽管版主过于热心和/或有偏见)。\n比尔和梅林达·盖茨的员工为海滩上的小男孩拍照根据警方的报告，比尔·盖茨的工程师(在他家工作)不仅观看和分享儿童色情作品；在他的卧室里，他有一个照片信封，里面装着海滩上小男孩的照片和底片，根据警方的报告，在一个快递截停信封里。\n[幽默/米姆]红绿灯冒犯了所谓的红皮人吗？计算机的类比或隐喻正在被删除，因为在某些上下文中，它们可能被(错误地)解释为指种族或征服；主要问题是，正如我们之前指出的那样，有足够的空间进行语言卫生，这可能会导致混淆(术语将被替换，而不会追溯更改)。\n上瘾作为软件领域的大制药/毒品心态故意设计让用户上瘾的软件的伦理方面或负面影响很少在主流中被探讨；这种情况真的应该改变，理查德·斯托尔曼对此很感兴趣。\n反GNU/Linux FUD的演变和嘲笑那些认为GNU/Linux刚刚赢得胜利，没有敌人的人显然很容易被微软灌输或彻底欺骗；此刻，GNU/Linux的商标和身份正受到攻击。\n[幽默]我们从未要求过的爱.。Linux基金会喜欢从微软那里得到数百万美元(接受“微软喜欢Linux”的谎言)；但真正使用GNU/Linux的人并不喜欢它。\n自由软件社区中的一些人称之为“自由软件9/11&34；”的另一本关于事件链或整个事件的方式的书值得重读，因为书中有许多元素仍然没有得到解决，而且根据新获得的信息正在进行调查。\n西雅图警察局提供了与比尔·盖茨有关的2851页关于恋童癖逮捕的警方报告的第一部分正在调查与盖茨基金会有关的逮捕(在比尔和梅琳达·盖茨家中工作的工作人员)以获得更多信息，包括背景和背景。\n[幽默]与OSI、OIN和Linux基金会告诉你的相反.。微软仍然是一个专利勒索公司；但只要它在贿赂OSI、Linux Foundation和其他公司，就别指望他们会谈论这件事。…。(微软“热爱Linux”，只要所有主要的OEM和服务器主机-包括亚马逊-本质上都向微软支付GNU/Linux费用，就像微软“拥有”它一样)。\n如何告诉德国司法和消费者保护部(“BMJV”)违反宪法是不可接受的技术权利敦促欧洲读者写信给BMJV官员，提醒BMJV宪法是存在的，一群诉讼狂热分子绕过宪法是完全不可接受的(这也是德国的尴尬，进而是欧盟的尴尬)。\nPython的新董事会增加了50%的谷歌和25%的微软。Python软件基金会(PSF)有了一个新的董事会，它将增加75%的GAFAM\n[幽默]GitHub托管的Fedora(微软观看、审查、耕种用户)自由的承诺不是Fedora兑现的；它需要要求IBM/Red Hat建立更多IBM/Red(和Fedora)可以控制的Git基础设施，而不是竞争对手(微软)控制的Git基础设施", "note_en": "Only  About 4.72% of the Web Uses It, But the  Linux Foundation‘s People are on Microsoft’s Team and They Use Windows in Other Web Sites/Services, Even to  Celebrate Sysadmin Day\n  Summary: Another major fluke from the not-so-Linux Foundation, which now promotes a Windows site in  the Linux Foundation’s Official Blog and in  Linux.com as well (the Linux Foundation Newsletter… is Windows)\n  If you liked this post, consider  subscribing to the RSS feed or join us now at  the IRC channels.\n            Microsoft Layoffs, Second Time in Less Than a Month (and People Lose Their &#39;Mixer&#39;)   The corporate media or most of the news right now would rather have us focused on Facebook (not Mixer layoffs and shutdown); GitHub may be next as it loses lots of money; it’s all about control and leverage, nothing else\n The Implications of an Increasingly Corporate FSF   &#34;Who&#39;s going to defend our 4 freedoms then? The people who bribed the watchdogs? The people who decapitated our organisations?&#34;\n Linux Foundation Newsletter is Microsoft Windows and Proprietary IIS   Another major fluke from the not-so-Linux Foundation, which now promotes a Windows site in the Linux Foundation’s Official Blog and in Linux.com as well (the Linux Foundation Newsletter… is Windows)\n Lawyers That Lie Chronically   The courts in the United States and in Europe are pushing back against the cabal of litigation firms and patent trolls; instead of evolving, as they ought to, law firms charge against truth itself\n The Three Things Seattle&#39;s Police Department Redacted in the First Installment   We highlight the things that the FOIA staff of Seattle&#39;s Police Department stated upfront would not be included among/inside the documents disclosed\n Mozilla Hires From Microsoft for Mozilla&#39;s Board   Hours after this “hey hi” (AI) puff piece Mozilla’s new CEO welcomed “former Director of Product Development for Artificial Intelligence at Microsoft” on “Joining the Mozilla Board”\n  [Humour] Litigation Industry-Run Ministry of Justice and Consumer Protection (“BMJV”)   The astounding revelation that the Ministry of Justice and Consumer Protection (“BMJV”) seems not to care about justice, let alone about consumers; it does not care about the law, the truth and the constitution, either\n Reminder to German Readers: Please Lodge Polite Complaints Against the Ministry of Justice and Consumer Protection (“BMJV”) Trying to Undermine the Constitution   The Bundesministerium der Justiz und für Verbraucherschutz (“BMJV”) is trying to cause a constitutional crisis in Germany — all this for the sole purpose of appeasing litigation fanatics, including patent trolls and large firms that aren’t even German (let alone European)\n   [Humour] Things You Can&#39;t Say on Reddit   Reddit is to free speech and freedom of expression what Microsoft is to ethics\n Personal Engineer of Bill Gates Illegally Possessed Firearms. Police Apparently Never Charged Him for That.   The number of possible charges against Bill&#39;s engineer turns out to be greater than what we knew; he got away with a surprisingly short sentence, which raises questions about the objectivity of the legal system (and law enforcement)\n Detecting and Undoing/Reversing Censorship of Microsoft Critics at Reddit   David from Ottawa suggests ways to track censored comments and restore them for readers to assess (in spite of overzealous and/or biased moderators)\n  Bill and Melinda Gates Employee Took Photos of Young Boys at the Beach   Based on the police report, the engineer of Bill Gates (working at his home) was not only viewing and sharing child pornography; in his bedroom he had a &#34;photo envelope that contained photographs and negatives of young boys on a beach,&#34; based on the police report, inside an Express Stop envelope\n [Humour/Meme] Are Traffic Lights Offensive to So-called &#39;Redskins&#39;?   Computer analogies or metaphors are being removed because in some contexts they can be (mis)interpreted as referring to race or subjugation; the main issue is, as we&#39;ve noted before, there’s ample room for language sanitation that may lead to confusion (terms being replaced and not changed retroactively)\n Addiction as Big Pharma/Drug Mentality in the Realm of Software   The ethical aspects or the negative impacts of software deliberately designed to make users &#39;addicted&#39; are rarely explored in the mainstream; that really ought to change and Richard Stallman has taken an interest in that\n The Evolution of Anti-GNU/Linux FUD and Ridicule   People who believe that GNU/Linux just &#34;won&#34; and has no enemies left are clearly easy for Microsoft to indoctrinate or thoroughly deceive; at the moment the very trademark and identity of GNU/Linux is under attack\n [Humour] The Love We Never Asked For...   The Linux Foundation loves millions of dollars from Microsoft (to accept the lie that “Microsoft loves Linux”); but people who actually use GNU/Linux aren’t into it\n There May be Another Book on the Way    The chain of events or the whole episode that some people in the Free software community have dubbed &#34;Free software 9/11&#34; is worth revisiting because there are many elements in it that remain unaddressed and there are ongoing investigations based on newly-available information\n Seattle Police Department Delivers First Installment of 2,851-Page Police Report About Pedophilia Arrest Connected to Bill Gates   The Gates Foundation-connected arrest (staff working at the home of Bill and Melinda Gates) is being explored for further information, including context and background\n [Humour] Contrary to What OSI, OIN and Linux Foundation Will Tell You...   Microsoft is still a patent blackmail operation; but as long as it’s bribing OSI, Linux Foundation and others don’t expect them to even talk about it… (Microsoft “loves Linux” as long as all the major OEMs and server hosts — Amazon included — essentially pay Microsoft for GNU/Linux as if Microsoft ‘owns’ it)\n   How to Tell the German Ministry of Justice and Consumer Protection (“BMJV”) That Violating the Constitution is Not Acceptable   Techrights urges European readers to write to BMJV officials, reminding the BMJV that a constitution exists and bypassing it for a bunch of litigation zealots is totally unacceptable (it’s also an embarrassment to Germany and — by extension — to the EU)\n Python&#39;s New Board of Directors Adds 50% Google and 25% Microsoft   The Python Software Foundation (PSF) has a new Board of Directors and it is adding 75% GAFAM\n  [Humour] GitHub-Hosted Fedora (Microsoft Watching, Censoring, &#39;Farming&#39; Users)   The promise of freedom isn&#39;t being fulfilled by Fedora; it needs to ask IBM/Red Hat to set up more Git infrastructure that IBM/Red (and Fedora) can control, not one that the competition (Microsoft) controls", "posttime": "2020-06-23 19:30:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,windows,microsoft,时事,newsletter", "title": "LinuxFoundation时事通讯在Microsoft Windows和IIS上运行", "title_en": "LinuxFoundation newsletter is running on Microsoft Windows and IIS", "transed": 1, "url": "http://techrights.org/2020/06/22/proprietary-iis-and-windows-foundation/", "via": "", "real_tags": ["linux", "windows", "microsoft", "时事"]}]