[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它接受十六进制分隔颜色或GPL调色板格式的输入。\n它的输出是高度可配置的，并且能够在RGB和HSL之间转换。\n它还具有用于修改调色板中所有颜色的色调、饱和度和亮度值的原始命令语言。\n多亏了optparse-application，Calico可以自动生成各种外壳的完成脚本。说明可以在这里找到，用户只需很少的工作。\nCalico诞生的原因是，为了查看调色板中包含的颜色，不得不打开完整的图像编辑器。它利用真彩色终端转义码在命令行上准确地显示颜色。", "note_en": "It accepts input in the form of delimited hex colors or the GPL palette format.\n Its output is highly configurable, and it is able to convert between RGB and HSL.\n It also features a primitive command language for modifying the hue, saturation and luminosity values of all colors in the palette.\n    Thanks to  optparse-applicative, calico can automatically generate completion scripts for various shells.Instructions can be found  here and require minimal effort on the user&#39;s part.\n  calico was born out of a frustration with having to open a full image editorin order to view the colors contained within a palette. It makes use of true-color terminalescape codes to display the colors with accuracy on the command line.", "posttime": "2020-05-02 18:00:44", "tags": "印花布,cat,颜色,colors", "title": "像印花布的猫，但要颜色", "title_en": "Calico – Like Cat, but for Colors", "transed": 0, "url": "https://github.com/ix/calico", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["印花布", "cat", "颜色", "colors"]}, {"category": "", "categoryclass": "", "imagename": "f15df176d47c83b4627c84a4a9b845fe.jpg", "infoid": 1000234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据联邦选举援助委员会的数据，2012年至2018年期间，仍有2830万张邮寄选票下落不明。丢失的选票占所有缺席选票和邮寄给居住在完全通过邮寄选举的州的选民的选票的近五分之一。\n各州和地方当局根本不知道这些选票自邮寄以来发生了什么-2800万张选票丢失的数字可能更高，因为美国的一些地区，特别是芝加哥，没有回应联邦机构的调查问题。此数字不包括损坏、无法投递或因任何原因退回的选票。\n尽管没有证据表明数百万张丢失的选票被舞弊使用，但汇编选举援助委员会提供的公开数据的公共利益法律基金会(Public Interest Legal Foundation)表示，这些数据的数量本身就引发了人们对选举安全的严重怀疑。\n这些问题特别相关，因为冠状病毒大流行正迫使全国各州在选举年迅速扩大邮寄投票业务。民主党参议员艾米·克洛布查尔(Amy Klobuchar)和罗恩·怀登(Ron Wyden)提出了2020年自然灾难和紧急投票法，该法案将允许每一位符合条件的选民都有机会通过邮寄投票，而不考虑管理邮寄选票的州法律。\n今年秋天邮寄投票的显著增加可能会极大地刺激“选票收获”，即第三方代表选民收集邮寄选票，并将其交给选举官员。长期以来，人们一直一致认为，这种做法会鼓励欺诈，而在美国大部分地区，收集选票是非法的。近年来，在北卡罗来纳州的一名共和党特工因2018年与收集选票有关的罪行被起诉后，公众对这一问题的辩论愈演愈烈。\n在同一个选举周期，加利福尼亚州将收集选票合法化，观察人士表示，这种做法在2018年罢免奥兰治县的几名共和党国会议员方面发挥了关键作用。奥兰治县是共和党在该州的长期据点，该州近几十年来变得非常自由。\nPILF发言人洛根·丘奇韦尔(Logan Churchwell)指出，每个选举周期都有数百万张未使用的邮寄选票四处漂浮，这一事实“在这里不是秘密类型的数据--它就在互联网上，而你却在为服务器费用买单，”(PILF)发言人洛根·丘奇韦尔(Logan Churchwell)指出。“那么真正关注选举过程的人会怎么做呢？他们开始收集选票。如果有这么多选票悬而未决，选举官员下落不明，那么肯定会有一些人力投入……。\n为了说明风险，丘奇韦尔指出，2016年，希拉里·克林顿(Hillary Clinton)赢得普选，获得的选票比唐纳德·特朗普(Donald Trump)多280万张。但2016年有近600万张下落不明的邮寄选票从未清点过，是她在普选中领先优势的两倍多。通过追查未使用的邮寄选票并确保它们得到统计-使用可能合法也可能不合法的方法-来影响选举的潜力是巨大的。\n毫无疑问，随着邮寄选票数量的增加，欺诈行为也会增加。“纽约时报”(New York Times)2012年的一篇报道指出，涉及邮寄选票的选民欺诈“比引起更多关注的面对面投票欺诈要普遍得多，”选举管理人员说。在佛罗里达州，缺席投票丑闻似乎就像是在选举时间前后准时到来的。根据“华尔街日报”关于德克萨斯州拉美裔社区选民剥削的报道，邮寄选票…。\n对邮寄投票舞弊的担忧非常严重，以至于加州理工/麻省理工学院投票技术项目(Caltech/MIT Voting Technology Project)在2008年发布的一份报告中建议各州“限制或废除按需缺席投票，转而支持面对面提前投票。”\n报告补充说：“按需缺席者带来的便利是以牺牲投票过程的真实完整性和感知完整性为代价的。”“从表面上看，提前投票可以提供近乎同等的便利，同时大大加强了对欺诈和胁迫的控制。”同样，里德学院2008年完成的另一项学术研究指出了与缺席投票有关的各种担忧，并承认“关于投票率的文献很多”，但当它出现时……。\n尽管存在这些担忧，俄勒冈州、华盛顿州、科罗拉多州、犹他州和夏威夷这五个州现在所有的选举都是通过邮寄进行的。支持者指出，这些州的顺利选举证明了这种做法是有效的。但PILF从俄勒冈州获得了2012年和2018年选举的选民数据，并与人口普查数据进行了核对。俄勒冈州是第一个专门采用邮寄投票的州。在这两次选举中，该州发出了700万张选票，其中约87.1万张选票完全下落不明。\n与全国平均五分之一的选票不同，俄勒冈州只输掉了八张选票中的一张，这可能是因为俄勒冈州有了更准确的选民名单", "note_en": "Between 2012 and 2018, 28.3 million mail-in ballots remain unaccounted for, according to data from the federal Election Assistance Commission. The missing ballots amount to nearly one in five of all absentee ballots and ballots mailed to voters residing in states that do elections exclusively by mail.\n States and local authorities simply have no idea what happened to these ballots since they were mailed – and the figure of 28 million missing ballots is likely even higher because some areas in the country, notably Chicago, did not respond to the federal agency’s survey questions. This figure does not include ballots that were spoiled, undeliverable, or came back for any reason.\n  Although there is no evidence that the millions of missing ballots were used fraudulently, the Public Interest Legal Foundation, which  compiled the public data provided from the Election Assistance Commission, says that the sheer volume of them raises serious doubts about election security.\n These questions are particularly relevant as the COVID-19 pandemic is forcing states across the country to rapidly expand vote-by-mail operations in an election year. Democratic Sens. Amy Klobuchar and Ron Wyden have proposed the  Natural Disaster and Emergency Ballot Act of 2020, a bill that would allow every eligible voter the opportunity to vote by mail, regardless of state laws governing mail-in ballots.\n A significant increase in mail-in voting this fall could greatly incentivize “ballot harvesting,” where third parties collect mail-in ballots on behalf of voters and deliver them to election officials. There’s long been a consensus that such a practice incentivizes fraud, and ballot harvesting is illegal in most of the country. Public debate over the issue has intensified in recent years after a  GOP operative in North Carolina was indicted for crimes related to ballot harvesting in 2018.\n  That same election cycle  California legalized ballot harvesting, and observers say the practice played a key role in ousting several Republican congressmen in Orange County in 2018, a longstanding GOP stronghold in a state that has become very liberal in recent decades.\n The fact that millions of unused mail-in ballots are floating around in every election cycle “is not a secret type data here –it&#39;s sitting there on the Internet, and you&#39;re paying for the server cost, ”notes Logan Churchwell, a spokesman for PILF. “So what do people that really focus on the election process do about that? They go into ballot harvesting. If there&#39;s so many ballots out there in the wind unaccounted for by election officials, surely some manpower could be dedicated  ...\n To illustrate the risk, Churchwell notes that in 2016 Hillary Clinton won the popular vote by garnering over 2.8 million more votes than Donald Trump. But nearly 6 million unaccounted mail-in ballots were never counted in 2016, more than twice her margin in the popular vote. The potential to affect elections by chasing down unused mail-in ballots and make sure they get counted – using methods that may or may not be legal – is great.\n There’s little doubt that as the number of mail-in ballots increases, so does fraud. A 2012  report in The New York Times noted that voter fraud involving mail-in ballots “is vastly more prevalent than the in-person voting fraud that has attracted far more attention, election administrators say. In Florida, absentee-ballot scandals seem to arrive like clockwork around election time.” According to  a Wall Street Journal reporton voter exploitation in Hispanic communities in Texas, mail-in ballots  ...\n  Concerns about fraud in mail-in ballots were serious enough that a 2008  report produced by the CalTech/MIT Voting Technology Project recommended that states “restrict or abolish on-demand absentee voting in favor of in-person early voting.”\n “The convenience that on-demand absentees produces is bought at a significant cost to the real and perceived integrity of the voting process,” the report added. “On the face of it, early voting can provide nearly equal convenience with significantly greater controls against fraud and coercion.” Similarly,  another academic studydone in 2008 from Reed College flagged various concerns related to absentee voting and conceded there is a “great deal of literature on turnout ”but when it comes  ...\n Despite these concerns, five states – Oregon, Washington, Colorado, Utah, and Hawaii – now do all elections exclusively by mail. Supporters point to smooth elections in these states as proof that it works. But PILF obtained voter data from Oregon, the first state to adopt voting by mail exclusively, for the 2012 and 2018 elections and checked it against census data. Of the 7 million ballots the state sent out in those two elections, some 871,000 ballots are totally unaccounted for.\n Losing only one of eight ballots, as opposed to the national average of one in five, may be the result of Oregon having a more accurate listing of voters’ addresses than many other states, but that’s still a very high percentage of missing ballots, and Oregon would not reveal its data for the 2014 and 2016 elections for reasons the state would not disclose.\n Regardless, U.S. Census data confirms that 11% of Americans move every year, and voters on the lower end of the economic scale are especially transient. Without implementing some extensive, and likely problematic, government surveillance program, there ’s no way for election administrators to reliably get ballots to tens of millions of Americans every election cycle without a large percentage of ballots going to the wrong address. This problem is compounded by states that mail ballots  ...\n The inherent problems of mail-in voting are being widely ignored, however. Use of mail-in ballots more than doubled from 24.9 million in 2004 to 57.2 million in 2016, and around 40% of U.S. votes are now done by mail. Along with this dramatic increase there have been virtually no new safeguards, scrutiny, or additional research on the risks of vote by mail. If the current pandemic is going to force the issue during a presidential election, proponents of voting by mail may have to address  ...\n “I really think the only reason vote-by-mail problems are not getting more attention on a regular basis, is that it&#39;s kind of an embarrassing problem and people just aren’t paying attention,” says Churchwell. “These numbers of missing ballots demonstrate large voter list maintenance failures and security gaps within the broader mail voting process.”", "posttime": "2020-05-02 18:00:41", "tags": "邮寄,ballots,选票", "title": "2800万张邮寄选票在最近四次选举中丢失", "title_en": "28M Mail-In Ballots Went Missing in Last Four Elections", "transed": 0, "url": "https://www.realclearpolitics.com/articles/2020/04/24/28_million_mail-in_ballots_went_missing_in_last_four_elections_143033.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["邮寄", "ballots", "选票"]}, {"category": "", "categoryclass": "", "imagename": "96d79bec976df39f6ab168fe99bf5f32.jpg", "infoid": 1000233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该委员会的民主党高层此前表示，他们怀疑亚马逊在其自有品牌战略上向国会撒谎。\n周五，众议院司法委员会要求杰夫·贝佐斯(Jeff Bezos)作证，此前民主党领导人表示，他们怀疑亚马逊向国会撒谎。\n该委员会的七名两党成员在致贝佐斯的一封信中表示，最近华尔街日报关于亚马逊使用第三方卖家数据的报道似乎表明，亚马逊在之前的声明中可能误导了国会。\n他们写道，如果“华尔街日报”文章中的报道是准确的，那么亚马逊向委员会所作的关于该公司商业行为的陈述似乎具有误导性，可能在刑事上是虚假的或伪证的。\n亚马逊周五股价下跌7.6%，此前一天该公司公布了财报。该公司已承诺将其预期的40亿美元第二季度利润投资于冠状病毒相关努力。\n华尔街日报的调查发现，亚马逊的员工使用来自第三方卖家的非聚合或容易识别的数据来确定应该自己生产哪些产品。这份报告是基于对20多名亚马逊前员工的采访和华尔街日报查阅的文件。\n这份报告似乎与亚马逊副总法律顾问内特·萨顿(Nate Sutton)在7月份众议院反垄断小组委员会听证会上的证词相矛盾，该小组委员会正在以反垄断为由调查亚马逊及其三家同行。\n在听证会上，萨顿表示，亚马逊不会使用个人卖家数据来确定其战略，这一策略可能会被认为是反竞争的。马萨诸塞州民主党参议员伊丽莎白·沃伦(Elizabeth Warren)等强烈反垄断执法的倡导者认为，公司不应该拥有市场，不应该在市场上竞争，因为这可能会鼓励不公平的做法。\n贝佐斯是亚马逊、苹果、谷歌和Facebook这四大科技公司中唯一位以前从未在国会作证的首席执行官。过去一年，随着立法者和监管机构评估科技公司的隐私和主导地位问题，该公司一直面临审查。据彭博社(Bloomberg)报道，除了众议院反垄断小组委员会的调查外，亚马逊还面临联邦贸易委员会(Federal Trade Commission)的调查。\n众议院反垄断小组委员会主席大卫·西西林(David Cicilline)是这封信的七个签字人之一，他上周表示，这份报告显示，亚马逊在之前向小组委员会提供的证词中可能对国会撒了谎。众议院司法委员会主席、纽约州民主党人杰罗尔德·纳德勒(Jerrold Nadler)也签署了这封信，此前他曾表示，如果属实，“华尔街日报”的报道引发了人们对亚马逊在委员会面前在一个核心问题上明显缺乏坦率的深切担忧。\n星期五的信中说，贝佐斯作为首席执行官作证很重要，如果有必要，他将保留诉诸强制程序的权利。\n小组委员会的最高共和党人、威斯康星州众议员詹姆斯·森森布伦纳(James Sensenbrenner)、小组委员会副主席乔·内古斯·D-科罗拉多(Joe Neguse D-Colo.)、众议员普拉米拉·贾亚帕尔·D-华盛顿州(Pramila Jayapal D-Wash.)、共和党人肯·巴克(Ken Buck)和佛罗里达州共和党人马特·盖茨(Matt Gaetz)也在信上签名。\n全体委员会的最高共和党人，俄亥俄州共和党众议员吉姆·乔丹(Jim Jordan)没有被列为签字人之一。乔丹是反垄断调查的新成员，他取代了佐治亚州共和党众议员道格·柯林斯(Doug Collins)，担任柯林斯寻求参议院竞标的职位。司法委员会的一位共和党发言人在一份声明中说，我们的成员当然有问题要问亚马逊，他们希望为美国人民得到答案。但我们想知道司法民主党人的真正动机是什么。早些时候..。\n柯林斯和森森布伦纳在2月份威胁说，不会参与一项带有先入为主的结论的调查，即美国的大型科技公司天生就不好，不能被允许存在于社会中，必须拆分。此前，一段筹款活动的视频显示，纳德勒谈到了改变权力分配，拆分了所有的大公司，尽管这并不是专门指的是科技行业。之后，柯林斯和森森布伦纳威胁说，他们不会参与调查，因为他们事先就得出了这样的结论：美国的大型科技公司天生就不好，不能允许它们存在于社会中，必须拆分。此前，一段募捐活动的视频显示，纳德勒谈到了改变权力分配的问题。\n亚马逊发言人拒绝对这封信发表评论。一位发言人此前告诉CNBC，认为亚马逊在我们的证词中故意误导的说法是完全不正确的。", "note_en": "Top Democrats on the committee previously said they suspected Amazon of lying to Congress over its private label strategy.\n The House Judiciary Committee demanded on Friday that Jeff Bezos testify after Democratic leaders said they suspected  Amazon of lying to Congress.\n    Seven bipartisan members of the committee said in a  letter to Bezos that a recent Wall Street Journal report on Amazon&#39;s use of third-party seller data appears to show that Amazon may have misled Congress in previous statements.\n &#34;If the reporting in the Wall Street Journal article is accurate, then statements Amazon made to the Committee about the company&#39;s business practices appear to be misleading, and possibly criminally false or perjurious,&#34; they wrote.\n Amazon&#39;s stock fell 7.6% Friday, a day after the company reported earnings. The company has pledged to invest its expected $4 billion Q2 profit into coronavirus-related efforts.\n The Journal investigation found Amazon employees used  nonaggregated or easily identifiable data from third-party sellers to figure out which products to make on its own. The report was based on interviews with more than 20 former Amazon employees and documents reviewed by the Journal.\n  The report appeared to contradict testimony by Amazon&#39;s associate general counsel Nate Sutton at a July hearing before the House Antitrust Subcommittee, which is investigating Amazon and three of its peers on antitrust grounds.\n At the hearing, Sutton said Amazon does not use individual seller data to determine its strategy, a tactic that would likely be considered anti-competitive. Advocates for strong antitrust enforcement, like Sen. Elizabeth Warren, D-Mass., have argued that companies should not be able to own and compete on a marketplace because it could encourage unfair practices.\n Bezos is the only CEO of the big four tech firms — Amazon,  Apple,  Google and  Facebook — who has never before testified in front of Congress. The company has faced scrutiny over the past year as lawmakers and regulators assess issues of privacy and dominance among tech companies. In addition to the House Antitrust Subcommittee investigation, Amazon also faces a probe by the Federal Trade Commission, according to Bloomberg.\n House Antitrust Subcommittee Chairman David Cicilline, D-R.I., who is one of the seven signatories of the letter, said last week the report shows that Amazon  &#34;may have lied to Congress&#34;in its previous testimony to the subcommittee. House Judiciary Chairman Jerrold Nadler, D-N.Y., who also signed the letter, previously said that if true, the Journal&#39;s report &#34;raises deep concerns about Amazon&#39;s apparent lack of candor before the Committee regarding an issue that is central  ...\n Friday&#39;s letter said it was important for Bezos to testify as CEO and would &#34;reserve the right to resort to compulsory process if necessary.&#34;\n The letter was also signed by the top Republican on the subcommittee, Rep. James Sensenbrenner of Wisconsin, subcommittee Vice Chairman Joe Neguse D-Colo., and Reps. Pramila Jayapal D-Wash., Ken Buck, R-Colo., and Matt Gaetz, R-Fla.\n The top Republican on the full committee, Rep. Jim Jordan, R-Ohio, is not listed as one of the signatories. Jordan was  newcomer to the antitrust probe after replacing Rep. Doug Collins, R-Ga., in the position as Collins pursues a Senate bid. A Republican spokesperson for the Judiciary Committee said in a statement, &#34;Of course our Members have questions for Amazon and want to get answers for the American people. But we wonder what Judiciary Democrats&#39; true motivations are. Earlier  ...\n Collins and Sensenbrenner  threatened in February to &#34;not participate in an investigation with pre-conceived conclusions that America&#39;s large tech companies are inherently bad, cannot be allowed to exist in society, and must be broken up.&#34; The comment came after a video from a fundraising event showed Nadler talking about &#34;changing the distribution of power&#34; and &#34;breaking up all the large companies,&#34; though not specifically referring to the tech industry.\n An Amazon spokesperson declined to comment on the letter. A spokesperson previously told CNBC, &#34;It&#39;s simply incorrect to suggest that Amazon was intentionally misleading in our testimony.&#34;", "posttime": "2020-05-02 18:00:38", "tags": "amazon,贝佐斯,亚马逊,执行官,ceo", "title": "亚马逊首席执行官贝佐斯被传唤到国会作证", "title_en": "Amazon CEO Bezos Called to Testify Before Congress", "transed": 0, "url": "https://www.cnbc.com/2020/05/01/house-judiciary-committee-asks-amazon-ceo-jeff-bezos-to-testify-over-allegedly-misleading-congress.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["amazon", "贝佐斯", "亚马逊", "执行官", "ceo"]}, {"category": "", "categoryclass": "", "imagename": "f8b542529610cfdc9b320e7c7f98959e.jpg", "infoid": 1000232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到内容我们对主要ISP数据的分析发现，为互联网服务租用设备的普通客户通过购买自己的路由器，每年可以节省150美元以上。\n相比之下，一台顶级路由器的一次性费用可以低至70美元。\n购买个人设备将在路由器的使用期限内为消费者节省750美元，并在互联网使用期限内为消费者节省数千美元。\n这是大多数人没有考虑到的事情，但当他们注册住宅互联网服务时，往往会有几个隐藏的成本，这可能会大幅增加他们每月的账单。最昂贵的附加费用之一是支付直接从ISP租用路由器和调制解调器等设备的费用。虽然大多数人可能没有注意到每月有线电视账单上增加了10-15美元，但在服务计划的整个生命周期内，这些成本加起来可能会达到数百甚至数千美元…。\n为了得到一个具体的数字，我们从所有主要的互联网服务提供商中提取数据，平均计算出客户直接从他们的有线电视公司租用设备所支付的费用。例如，在互联网服务方面，平均每个客户每月支付12-15美元租用路由器和调制解调器等设备。\n在有线电视合同的有效期内，这可能最终会达到数千美元。换句话说，你最终可能会为一台成本低于100美元的设备支付昂贵的费用，而且这些设备可以使用数年。\n通过研究主要的电商平台，消费者可以很容易地找到价格在50-70美元之间的高质量路由器，具体取决于他们的需求。这笔一次性费用将在不到6个月的时间内收回成本，几乎不需要更换或升级。甚至更昂贵的顶级路由器将在一两年内收回成本。\n可能会有人争辩说，许多消费者对管理自己的设备感到害怕，因为像设置和维护这样的事情对普通人来说可能会感觉到技术上的要求。虽然大多数ISP不会对你没有从他们那里租用的设备提供服务，但路由器很少需要比偶尔的重启更多的维护。初始设置完成后，通常不需要更多的技术支持。\n我们与几位有线电视客户讨论了他们设置自己的路由器的经验，他们发现远没有他们想象的那么复杂。\n“大概花了15分钟，我不是技术人员。当被问及他们的体验时，一位受访者说：“我按照盒子里的说明操作了自己的路由器，没有任何问题。”\n每隔一段时间升级设备可能很重要，但这不是每年的要求，甚至不是每两到三年一次的承诺。虽然对电影和电视流媒体服务或在线游戏等内容的更快下载的需求从未像现在这样高，但大多数路由器在未来几年都将完成这项任务。虽然技术和安全的变化可能会导致在大约五年后需要更新，但主要品牌将继续支持他们的产品。\n如果您正在寻找一种从每月预算中削减开支的简单方法，请考虑购买您自己的路由器，而不是直接从您的ISP那里租用。\n注册我们的电子邮件时事通讯，放大，在那里我们发现令人惊讶的真相，进入我们评论的幕后，用精彩的晚宴对话武装您。\n我想订阅Reviews.com时事通讯。我想订阅Reviews.com时事通讯和特别电子邮件促销。Reviews.com不会共享或出售您的电子邮件。请参阅隐私政策。\nReviews.com通过关联合作伙伴链接赚钱：如果您点击一个链接，我们可能会赚取佣金。我们的作者和编辑创建所有评论、新闻和其他内容以告知读者，不受我们业务团队的影响。了解更多关于我们如何赚钱的信息。我们竭尽全力确保我们的网站是准确和最新的，但有些信息可能与您通过访问供应商网站找到的信息不同。所有产品均无保修。", "note_en": "Skip to content     Our analysis of data from major ISPs found that the average customer who rents equipment for their internet service could save upwards of  $150 per year by purchasing their own router.\n In contrast, a top-rated router can be as cheap as $70 as a one-time expense.\n Purchasing personal equipment will save consumers  $750 over the lifetime of a router and thousands more over a lifetime of internet usage.\n It ’s something that most people don ’t think about, but when they sign up for residential internet service, there are often several hidden costs that can drastically increase their monthly bill. One of the most expensive additions is paying to rent equipment directly from the ISP like a router and modem. While most people might not notice a $10-$15 addition on the cable bill each month, over the lifetime of a service plan, those costs can add up to hundreds or even thousands of  ...\n To get a specific number, we pulled data from all major ISPs to average out how much customers are paying to rent equipment directly from their cable company. For internet service, for example, the average customer is paying between $12-$15 per month to rent equipment like a router and modem.\n Over the lifetime of a cable contract, this could end up being thousands of dollars. In other words, you could end up making costly payments for a piece of equipment that costs less than $100 that will last years.\n By researching major e-commerce platforms, consumers can easily find a high-quality router for $50-$70, depending on their needs. This one-time expense will pay for itself in under six months, and will rarely need a replacement or upgrade. Even more expensive, top-of-the-line routers will pay for themselves within a year or two.\n There might be an argument that many consumers feel intimidated by managing their own equipment, as things like set up and maintenance can feel technically demanding for the average person. While most ISPs won’t provide service on the equipment you’re not renting from them, it’s rare for a router to need much more maintenance than the occasional reset. Once the initial setup is complete, it would be unusual to need much more technical support.\n We spoke with several cable customers about their experience setting up their own router, and they found it to be far less complicated than they had imagined.\n “It took maybe 15 minutes and I’m not a technical person. I followed the instructions in the box and had my own router working with no issues at all,” one respondent said when asked about their experience.\n It can be important to upgrade equipment every so often, but it’s not an annual requirement or even every two to three-year commitment. While the demand for faster downloads for things like movies and TV streaming services or online games has never been higher, most routers will be up to the task for years to come. And while technology and security changes may cause the need for an update after five years or so, major brands will continue to support their products.\n If you are looking for a simple way to trim expenses from your monthly budget, consider purchasing your own router instead of renting it directly from your ISP.\n Sign up for our email newsletter, Magnified, where we uncover surprising truths, go behind the scenes of our reviews, and arm you with great dinner party conversation.\n I would like to subscribe to Reviews.com newsletter.   I would like to subscribe to Reviews.com newsletter and special email promotions. Reviews.com will not share or sell your email. See  privacy policy.\n Reviews.com makes money through affiliate partner links: If you click on a link, we may earn a commission. Our writers and editors create all reviews, news, and other content to inform readers, with no influence from our business team. Learn more about  how we make money. We take pains to ensure our site is accurate and up to date, but some information might be different than what you find by visiting a vendor website. All products are presented without warranty.", "posttime": "2020-05-02 18:00:36", "tags": "消费者,consumer,路由器,router", "title": "普通消费者从他们的ISP那里租用一台路由器每年要损失150美元以上", "title_en": "The average consumer loses over $150 a year renting a router from their ISP", "transed": 0, "url": "https://www.reviews.com/utilities/internet/the-average-consumer-loses-over-150-a-year-renting-a-router-from-their-isp/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["消费者", "consumer", "路由器", "router"]}, {"category": "", "categoryclass": "", "imagename": "f6121cf327c6824b9ccbf06a8249606b.jpg", "infoid": 1000231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周是开源硬件用户组织(OSHUG)成立十周年。因此，不仅回顾OSHUG的历史，而且回顾开放硬件的一些历史和未来，似乎是再合适不过的了。\n让我们早一点开始，大约在12-13年前。我自己对开源硬件的介绍-请注意，我也将互换使用开放硬件，意思是相同的-是在2007/2008年间通过两种不同的途径进行的。第一个是格拉斯哥黑客空间的联合创始人，电子俱乐部，他对新的Arduino平台提供的艺术可能性感到兴奋。第二个是BT Osmosoft的一位同事，他发现了最近宣布的Bug Labs硬件……。\nBUG LABSABE今天仍然存在，似乎他们的重点从硬件转移到了服务上。当然，Arduino的故事是众所周知的，多年来它一直是开放硬件的典范。接下来，至少在最明显的意义上，是一个由相对简单的电路板设计组成的新兴生态系统-例如表面贴装设备的分流模块，以及Arduino兼容机和附加组件。有一种日益增长的运动，这主要集中在微控制器上……。\n在这一点上，如果不提到两个值得注意的例外，那就是玩忽职守。第一个是Openmoko，它着手创建一个具有开放硬件规范的移动电话系列-提供了原理图和机械CAD文件-以及开源操作系统。另外还有另一款消费电子产品Chumby，一款带有触摸屏和WiFi的嵌入式计算机。\n除此之外，Elphel已经悄悄地生产了一段时间的开放硬件和免费软件驱动的摄像机。值得注意的是，还有来自Sun的OpenSPARC和草根开放硅社区OpenCores，以及它的旗舰项目OpenRISC。加雷斯的文章“数字化石”更详细地介绍了这些和其他早期开放硅片的努力。\n新兴的开放硬件运动已经开始蓄势待发，2009年12月，总部位于英国的慈善和创新基金会内斯塔(Nesta)举办了一场为期一天的活动，专门讨论这一主题。对于我们许多参加会议的人来说，这是一个关键时刻，其中一个结果就是开放源码硬件用户组的形成。\nOSHUG是由保罗·唐尼(Paul Downey)、艾伦·伍德(Alan Wood)和我在2010年初共同创立的。受到Nesta活动的启发，也受到英国半导体公司XMOS的鼓励，XMOS决定将其开发板设计作为开放硬件发布。\n幸运的是，保罗和我都在英国电信的开源创新部门Osmosoft工作，那里的社区活动是其职责的一部分。因此，在2010年4月29日星期四，我们举办了有史以来第一次职业安全与健康联合会会议。为此，我们很荣幸邀请到了大卫·梅教授--Transputer的设计师，然后是XMOS的首席技术官--出席了会议。\n我们从一开始就决定，虽然重点将主要放在拥有自由许可设计工艺品的硬件上，但我们也会鼓励就相关主题(如嵌入式开发)以及硬件设计和制造中使用的工具和技术进行讨论。这项政策对OSHUG很有帮助，并导致了一个非常有趣的话题组合。\n自由开放源码软件是主流。免费和开放的硬件不是。OSHUG#2。\n最初的几次会议确实使该集团得以确立自己的地位，如果没有BT Osmosoft的支持，这是不可能的。探讨的主题包括许可和社区，以及软件定义无线电和FPGA开发等主题。第六次会议由伦敦Hackspace主办，第七次会议由英国广播公司(BBC)主持，会议的主要内容是关于BBC计算机素养项目的演讲-该项目催生了BBC Micro和Domesday项目。\n第八次会议是在Osmosoft办公室举行的最后一次会议(我们占据的威斯敏斯特电话交换机的安全安排是…。棘手)。\n对于第九次会议，我们受到了技能事务的盛情款待。其中包括Omer Kilic对FPGA编程的介绍，Jeremy Bennett博士关于OpenCores和OpenRISC的演讲，以及Lawrence Wilkinson关于在FPGA中仿真IBM System/360大型机的演讲。\n在接下来的几年里，国王十字的创意合作中心成为了我们的家。\n我们还去了肯特大学(University Of Kent)，这是由Omer Kilic提供的。2011年10月，我们举办了有史以来第一次开源硬件夏令营(OSHCamp)。这次会议的特色是3D打印和物联网研讨会，以及对开源硬件合作的探索。\n第29次会议是第一次由BCS主办并与其开源专家组(OSSG)合作的会议。在这次会议上，我们就RepRap 3D打印机的创建者Adrian Bowyer博士进行了演讲。在返回BCS伦敦之前，我们由Erlang Solutions主办了下一次会议，", "note_en": "This week marks the tenth anniversary of the inaugural meeting of the Open Source Hardware User Group (OSHUG). As such it seemed only appropriate to take a look back over the past decade at not only the history of OSHUG, but some of the history and the future of open hardware also.\n    Let’s begin a little earlier and around 12-13 years ago. My own introduction to open source hardware — note that I will also use  open hardware interchangeably and to mean the same thing — came in 2007/2008 via two different routes. The first of these being a fellow co-founder of Glasgow hackerspace, the  Electron Club, who was excited at the artistic possibilities presented by the new Arduino platform. The second was a  BT Osmosoftcolleague who spotted the recently announced Bug Labs hardware  ...\n   Bug Labsare still around today and it appears their focus shifted from hardware to services. Of course, the Arduino story is well known and for many years it served as the open hardware poster child. What followed next, at least in the most visible sense, was a burgeoning ecosystem of relatively simple board designs —such as breakout modules for surface mount devices, along with Arduino compatibles and add-ons. There was a growing movement and this was focused mostly around microcontrollers  ...\n   At this point it would be remiss not to mention two notable exceptions. The first of these being  Openmoko, which set out to create a family of mobile phones with an open hardware specification — schematics and mechanical CAD files were provided — and open source O/S. Also another consumer electronics product, the  Chumby, an embedded computer with a touch screen and WiFi.\n In addition to which,  Elphel had been quietly producing open hardware and free software powered video cameras for some time. Notably also there was OpenSPARC from Sun and the grassroots open silicon community, OpenCores, together with its flagship project, OpenRISC. These and other early open silicon efforts are covered in more detail in Gareth’s article,  Digital FOSSils.\n    The nascent open hardware movement had started to gather momentum and in December 2009,  Nesta, the UK based charity and innovation foundation, hosted a  one day event dedicated to the topic. This served as a pivotal moment for many of those of us who attended and one outcome of this being the formation of the  Open Source Hardware User Group.\n   OSHUG was co-founded in early 2010 by Paul Downey, Alan Wood and myself. Inspired by the Nesta event and also encouraged by UK semiconductor company,  XMOS, which had decided to publish its development board designs as open hardware.\n Fortunately, Paul and I both worked for BT’s open source innovation unit, Osmosoft, where community events were part of its remit. So on Thursday 29 th April 2010 we hosted the  first ever OSHUG meeting. For this we were honoured to have Professor David May — architect of the Transputer and then CTO of XMOS — present.\n   We decided from the outset that, although the focus would primarily be hardware with liberal licensed design artefacts, we would also encourage talks on related topics, such as embedded development, along with tools and techniques employed in hardware design and manufacture. A policy which has served OSHUG well and led to an ever interesting mix of topics.\n   Free and open source software is mainstream. Free and open hardware isn’t.  OSHUG #2.\n The first few meetings really enabled the group to establish itself and this wouldn’t have been possible without the support of BT Osmosoft. Themes explored included  licensing and  community, along with topics such as  software-defined radio and  FPGA development. For the sixth meeting we were hosted by  London Hackspace and for the  seventh the BBC, which featured talks on the BBC Computer Literacy project — which gave birth to the BBC Micro — and Domesday project.\n The eighth meeting was the last that was held at the Osmosoft offices (the security arrangements at the Westminster telephone exchange we occupied were… tricky).\n For the  ninth meeting we were kindly hosted by Skills Matter. This featured an introduction to FPGA programming from Omer Kilic, a talk on OpenCores and OpenRISC from Dr Jeremy Bennett, and Lawrence Wilkinson gave a talk on emulating an IBM System/360 mainframe in FPGA.\n   For the next few years, the now much missed,  Centre for Creative Collaboration in Kings Cross became our home.\n We also had an  outing to the University of Kent, courtesy of Omer Kilic, and in October 2011 we held our first ever  Open Source Hardware Camp (OSHCamp). This featured 3D printing and IoT workshops, along with an exploration of collaboration in open source hardware.\n   The 29 th meeting was the first hosted by the  BCS and in partnership with its  Open Source Specialist Group (OSSG). At this we had a talk on the RepRap 3D printer, from its creator, Dr Adrian Bowyer. For the next meeting we were hosted by Erlang Solutions, before returning to BCS London, which then became our new home and continues to be up until the present day.\n    Early 2011 I relocated to the north of England and then travelled to London for OSHUG events. However, I also managed to persuade the group that we should host the next OSHCamp in Hebden Bridge — after an initial response of, “Where?!” This turned out to provide a perfect setting for a weekend of talks and workshops in more relaxed environs, with plenty of opportunity to socialise.\n   Over the years and now that we ’re up to 80 events in total, OSHUG has seen talks on an incredibly diverse range of topics related to open hardware; FPGAs, chip design and verification, wireless, education, music, security, privacy, performance, tools, compilers, EMC, design for manufacture, automotive —and more. Not to mention also hands-on workshops covering a wide variety of topics, including software-defined radio, machine learning and Internet of Things, for example.  ...\n   Regular evening meetings continue to be hosted by BCS and held in partnership with OSSG. A special thanks to Professor Cornelia Boldyreff and Dr Jeremy Bennett for their support.\n OSHCamp takes place annually — although perhaps not  this year… — and in addition to being hosted in Hebden Bridge, was held in Lincoln in 2018, with thanks to Sarah Markall for making this happen. A special thanks also to Alan Wood, Ken Boak, Omer Kilic and Paul Tanner, who together with Jeremy Bennett have compered and presented at many OSHUG meetings.\n   Having been convener and main event organiser for the first 6 or so years, regular monthly events are now organised by Sevan Janiyan and Andy Bennett, who do an excellent job with programming. I continue as the main organiser for OSHCamp and look forward to its return in 2021.\n Next I’d like to take a look at wider advances in open hardware, the present day, and the future.\n    Go back ten years and most activity was focused around PCB designs, with the majority being relatively simple. Collaboration was a hot topic, but wasn ’t easy and remains far more difficult than with software; different design tools and minimal interoperability continuing to present a challenge, in addition to which the processes involved just aren ’t the same as with software. Hence designs are typically completed by one person or a close knit team and published when  ...\n   While collaborative PCB design hasn’t taken off, we have seen increasingly advanced open source hardware designs, such as the  Novena laptop and  LimeSDR familyof software-defined radios, along with ever more capable FPGA development boards. That these may not be developed in a collaborative manner —as is often (but not always!) the case with open source software —is not an issue. Rather instead it ’s just a simple fact of the development process and factors involved.  ...\n   As we saw at OSHUG meetings and in the wider community, open hardware is by no means limited to electronics and PCB design. For example, the RepRap 3D printer and  Global Village Construction Set involve significant elements of mechanical design. However, such projects are comparatively small in number and mech design has similar challenges to PCB design.\n Over the past ten years we’ve seen the proliferation of hacker/maker spaces and the Raspberry Pi — even though not open hardware itself — has had significant impact in terms of getting more involved people hands-on with electronics; the community continues to grow and mature. In addition to which, there have been numerous advances in open hardware licensing and improvements in FOSS tooling.\n   Sun made a remarkably bold move with OpenSPARC and open sourcing the T1 core in 2006. However, an FPGA board capable of hosting the design would have set you back quite a bit and it had few users outside of academia. There was also the OpenCores community and, as noted in Digital FOSSils, OpenRISC found its way into a Samsung digital TV SoC, amongst other uses.\n Although, generally speaking, FPGAs and digital design were seen as complex and/or difficult. In part because the skills required are less common than software development, with many in the early open hardware community being “crossover software developers”, self-taught and/or enthusiasts. This is something that  Chip Hackset out to address, with the first event hosted in London in 2013, a second in Cambridge in 2014, and then a much larger event in Hebden Bridge  ...\n   Meanwhile FPGA development boards have continued to become cheaper and more powerful, with a constantly growing enthusiast community, in part as a result of this and perhaps also while looking for the next challenge.\n Of course, open hardware is now also gaining serious traction in the semiconductor industry, which is something that I’ll come to later. Meanwhile there have also been groundbreaking advances in tooling — which is a topic for another day.\n    At the time of writing, over 12,000 LimeSDR boards have been shipped to developers and while this figure is much lower than it would be for, say, Arduino, it is impressive for an advanced design of its specialist nature. The open hardware design has also enabled derivative designs, such as one that has been  integrated into a cubesat. Furthermore, its impact in industry is now being seen as the LimeSDR platform is at the heart of the  CrowdCell developed  via the  ...\n   The Free and Open Source Silicon Foundation has been hosting packed out conferences for a number of years now, with delegates and speakers from across industry and academia. The foundation also participates in Google Summer of Code, hosts  LibreCores, is home to a number a projects and workgroups, and produces a  monthly newsletter with a steadily growing readership.\n The advent of the  RISC-V open ISA clearly acted as a catalyst and has generated a groundswell in interest in open silicon, with other ISAs also now starting to follow suit, such as  OpenPOWER.\n   Although gathering pace in more recent years, RISC-V can trace its history back to 2010 and what we ’re seeing now is the result of the multi-year efforts of the founders, contributors, sponsors and, of course, the RISC-V Foundation and its membership. While at the same time being able to take advantage of the earlier work of the OpenCores community, whether utilising an i2c core or some other simpler IP, or just benefiting from an established community and  ...\n   More recently the  CHIPS Alliance was set up under the auspices of the Linux Foundation and has workgroups focusing on the Chisel HDL, RISC-V Rocket chip generator, cores, tools and interconnects. We also have the  OpenHW Group driving collaborative development of open source cores, related IP, tools and software. This boasts an impressive membership and has 32-bit microcontroller and 64-bit Linux capable core designs, with more to come.\n To say I’ve barely scratched the surface of open silicon would be a serious understatement. I’ve purposely not mentioned companies and, where possible, specific projects, since these are both topics that I couldn’t do justice here and will save for future posts. Similarly with tools, where there have also been major advances and it would be better to cover these separately.\n   The  ULXS3 FPGA board from Zagreb Makerspace is supported by a FOSS toolchain and capable of booting Linux via a RISC-V soft core.\n I believe that we will continue to see more and increasingly advanced board designs, both from industry and the wider open hardware community. The benefits are clear in terms of education, technology transfer, establishing plarforms and expediting innovation, for example. Not to mention enthusiast and professional engineers alike continuing to up their “spare time” game.\n Meanwhile the wider community continues to grow and whether identifying as being part of the open hardware movement, a maker, an electronics hobbyist or a Raspberry Pi enthusiast, this all contributes to more people getting hands-on with electronics.\n Ten years ago it would have been impossible to predict the size of the opportunity that would be presented by free and open source silicon (FOSSi). Since digital designs generally start out with a text based hardware description that might look like, or even be based upon, a programming language, in hindsight this may now seem blatantly obvious. After all, it means that a lot of the tooling and processes from software development can be reused.\n However, the semiconductor industry was seen as being particularly conservative, making use of eye-wateringly expensive tooling under strict NDA, with fabrication costs of millions of dollars. As with so many things, this was true in part and with some measure of misunderstanding. This aside, the benefits of open silicon are now becoming abundantly clear and certainly in terms of processor and SoC design at least, where the environment has changed in  ...\n  In closing I should note that many important developments and projects will have been omitted. This post is already  much longer than originally intended and there is plenty more to be covered via future posts. This is also partially a view through the lens of the Open Source Hardware User Group, with the original idea being to mark ten years since the first meeting.", "posttime": "2020-05-02 18:00:32", "tags": "硬件,开源,years,open", "title": "开源硬件十年", "title_en": "Ten Years of Open Source Hardware", "transed": 0, "url": "https://abopen.com/news/ten-years-of-open-source-hardware/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["硬件", "开源", "years", "open"]}, {"category": "", "categoryclass": "", "imagename": "c5239baaced7fbac87489ab3e462115f.jpeg", "infoid": 1000230, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对损坏的系统进行故障排除是每个系统管理员、SRE或DevOps工程师的基本技能。我们每个人都会时不时地遇到与操作系统相关的问题，当事情变得非常糟糕时，最好做好准备。\n能够快速识别问题并对其采取行动，以防止任何重大损害，这尤其有益。为了在本文中帮助解决这一问题，我们将介绍一些您可能会遇到的常见问题，以及收集信息、故障排除和解决这些问题的方法。\n注意：本文使用的是RHEL8/CentOS。但是，下面的示例/概念可以应用于任何Linux发行版。\n如果您丢失了root密码，并且无法访问特权用户，该怎么办？如果您仍然可以使用机器，那么有一种方法可以解决这种不方便的情况。\n首先，从重新启动机器开始。机器启动时，按任意键访问引导菜单：\n在引导菜单中，按e编辑引导选项。使用箭头移动到以Linux开头的行，并附加rd.Break。这会提前中断引导过程。\n您还可以选择附加Enforcing=0，以暂停SELinux实施。接下来，按CTRL+X让机器引导。\n引导几秒钟后，您应该会得到外壳。此时，您可以以只读模式访问系统。\n因此，要更改系统中的任何内容(如root密码)，我们需要将文件系统设置为读写。我们可以通过运行mount-o remount，rw/sysroot来实现这一点。\n我们需要做的下一件事是使用chroot/sysroot进入root监狱-这会将文件系统的根更改为/sysroot，而不是/。这是必需的，这样我们运行的任何其他命令都将与/sysroot目录相关。现在，我们可以使用passwd更改root密码。\n如果在引导选项中添加了Enforcing=0，则现在可以按CTRL+D(或键入EXIT)并让系统完全引导。如果没有，请运行touch/.autorelabel以触发SELinux系统重新标记。\n这是必需的，因为更改密码会导致/etc/password具有不正确的SELinux安全上下文。因此，我们需要在下次引导期间重新标记整个文件系统(这可能需要一些时间，具体取决于文件系统的大小)。\n作为替代解决方案，您还可以访问Linux的debug-shell。同样，这可以通过在引导期间访问GRUB并附加systemd.debug-shell而不是rd.Break来实现。\n当您使用此选项让系统引导时，您将结束在正常的shell会话中，这不是很有帮助。但是，如果您尝试使用CTRL+ALT+F9访问终端9，您将使用完全root权限打开debug-shell。\n在这里，您可以正常更改密码。此时，您可以切换回普通shell(CTRL+ALT+F1)并登录。\n不过，您不应该忘记停止调试shell，因为它是系统的一个巨大漏洞。您可以通过运行systemctl stop debug-shell.service(您仍然可以切换回debug-shell，但它将没有响应；取消)来完成此操作。\n但是，即使这些都是基本任务，也很容易出错，导致系统无法引导。让我们看看如何解决与无法挂载的文件系统相关的问题。\n与前面的解决方案一样，我们首先重新启动机器，访问引导菜单并对其进行编辑，这一次追加了systemd.unit=Emergency.target。这会告诉您的系统引导到紧急目标，而不是默认目标(多用户或图形)。\n当系统引导并获得shell时，我们以root身份登录，并再次使用mount-o remount，rw/重新挂载文件系统。现在，我们可以通过运行mount-a来尝试挂载所有文件系统。\n如果在挂载特定文件系统时出现问题，您可能会看到类似mount：/wrong-mount：mount point is not eXist的错误消息。或挂载/错误挂载：特殊设备/dev/sdb1不存在。这类问题需要在/etc/fstab内修复：\n修复/etc/fstab中的问题后，运行systemctl daemon-reload，以便systemd获取更改。现在，再次运行mount-a。如果问题确实已修复，您应该不会看到错误(没有消息，就是好消息)。您现在可以使用CTRL+D退出，并让系统正常引导。\n除了键入错误的设备或装载点名称外，您可能还会遇到VDO(虚拟数据优化器)或Stratis的问题，这需要额外的装载参数。\n另一个常见且容易修复的错误可能是在使用UUID=&#34；时缺少引号.。指定设备(使用/etc/fstab语法突出显示，可以省去很多问题)。\n这不是一个生死攸关的情况，但它会导致很多问题，所以当它发生时，能够迅速识别它是有益的。\n重要的是要认识到，在大多数情况下，SELinux都在正确地执行其工作。但是，您可能正试图实现SELinux没有预料到的事情。\n您可能会遇到的一些问题可能包括错误文件的问题", "note_en": "Troubleshooting damaged systems is an essential skill of every SysAdmin, SRE, or DevOps engineer. Every one of us runs into OS-related issues from time to time and it’s better to be prepared when things go terribly wrong.\n It’s especially beneficial to be able to identify and act on the issue quickly to prevent any significant damage. To help with that in this article, we will go over a few common problems that you might encounter as well as ways to gather information, troubleshoot, and solve these issues.\n Note: This article uses  RHEL 8/ CentOS. But, the examples/concepts below can be applied to any Linux distribution.\n  What if you lose the  root password and you don&#39;t have access to a privileged user? If you still have access to the machine, then there is a way to solve this inconvenient situation.\n First, start by rebooting the machine. When the machine starts, hit any key to access the boot menu:\n  In the boot menu, hit  e to edit boot options. Using the arrows, move to the line starting with  linux and append  rd.break. This  breaks the boot process early on.\n Optionally, you can also append  enforcing=0, to pause SELinux enforcing. Next, hit  CTRL+X to let the machine boot.\n  After a few seconds of booting, you should get the shell. At this point, you have access to the system in read-only mode.\n So, to change anything in the system — like the  root password — we need to make the filesystem  read-write. We can do that by running  mount -o remount,rw /sysroot.\n The next thing we need to do is enter the root jail using  chroot /sysroot — this changes the root of the filesystem to  /sysroot instead of  /. This is required so that any further commands we run will be in regards to the  /sysroot directory. Now we can change the  root password using  passwd.\n If you added  enforcing=0 to boot options, you can now hit  CTRL+D (or type  exit) and let the system fully boot. If not, run  touch /.autorelabel to trigger the SELinux system relabel.\n This is needed because changing the password results in  /etc/password having an incorrect SELinux security context. Therefore, we need to relabel the whole filesystem during the next boot (this can take some time, depending on the size of the filesystem).\n  As an alternative solution, you could also access Linux’  debug-shell. This can be done, again, by accessing GRUB during boot and appending  systemd.debug-shell instead of  rd.break.\n When you let the system boot with this option, you will end up in a normal shell session, which isn’t very helpful. If you, however, try to access terminal 9 using  CTRL+ALT+F9, you will open  debug-shell with full  root permissions.\n Here, you can change the password normally. At this point, you can switch back to a normal shell (  CTRL+ALT+F1) and log in.\n You shouldn’t forget to stop the  debug-shell though, as it is a huge vulnerability to the system. You can do that by running  systemctl stop debug-shell.service (you can still switch back to  debug-shell but it will be unresponsive; killed-off).\n  But, even though these are basic tasks, it’s easy to make a mistake that may render your system unbootable. Let’s see how you can solve problems related to unmountable filesystems.\n As with previous solutions, we start by rebooting the machine, accessing the boot menu and editing it, this time appending  systemd.unit=emergency.target. This tells your system to boot into an emergency target instead of the default one (multi-user or graphical).\n When the system boots and we get the shell, we login as root and we again remount the filesystem using  mount -o remount,rw /. Now we can try mounting all filesystems by running  mount -a.\n If there is a problem with mounting a specific filesystem, you might see an error message like  mount: /wrong-mount: mount point does not exist. or  mount /wrong-mount: special device /dev/sdb1 does not exist.. These kinds of issues need to be fixed inside  /etc/fstab:\n  After fixing the issue in  /etc/fstab, run  systemctl daemon-reload, so that  systemd picks up the changes. Now, run  mount -a again. If the issue was indeed fixed, you should see no error (no news, is good news). You can now exit using  CTRL+D and let the system boot normally.\n Aside from a mistyped device or mount point name, you might also encounter issues with VDO (Virtual Data Optimizer) or Stratis, which require extra mount arguments.\n  Another common and easily fixable mistake might be a missing quote when using  UUID=&#34;... to specify the device (use  /etc/fstab syntax highlighting, it can save you a lot of problems).\n  This one is not a life and death kind of a situation, but it can cause a lot of problems, so it’s beneficial to be able to identify it quickly when it happens.\n It’s important to realize that most of the time, SELinux is doing its job correctly. But it might just happen that you are trying to achieve something SELinux doesn’t expect.\n Some of the problems you might encounter may include issues with incorrect file context, for example, after moving a file from one place to another. Sometimes the issue might be with overly restrictive policies (SELinux booleans) or blocked service ports.\n One can troubleshoot all of these problems by first temporarily changing SELinux to non-enforcing mode using  setenforce 0 and retrying the action that wasn’t working previously.\n If the problem was fixed by switching SELinux to non-enforcing mode, then we know that the problem was caused by an SELinux violation.\n Now, if we turn SELinux back on using  setenforce 1, we can try to analyze and fix the violation.\n First, install  setroubleshoot-server using  yum -y install setroubleshoot-server. This troubleshooting server will listen to  /var/log/audit/audit.log and send summary messages to  /var/log/messages.\n Next, to analyze these messages, run  grep sealert /var/log/messages which should give you messages like this:\n  As an example here, I configured  httpd to run on port  8012 which is blocked because of SELinux service’s allowed ports. If we were not aware of this, then it would be quite hard to find the root cause of this issue.\n The output above can help with that. We can see a description of the SELinux violation as well as a command that can help us troubleshoot further, so let’s try it out:\n  This produces a full report of what caused the violation. Including a suggested (not necessarily the most appropriate) fix.\n If you have some experience with SELinux, you might realize that the most appropriate way to fix this issue is to add the relevant port to the SELinux service ( http_port_t). This can be done by running  semanage port -a -t http_port_t -p tcp 8012.\n This pattern of replicating the violation, looking for  sealert messages in  var/log/messages and viewing the report, and analyzing the report can be applied to any SELinux violation/problem, not just the one example above.\n Alternatively, you can also search directly in  /var/log/audit/audit.log using  ausearch. The specific command you would want to run:  ausearch -m AVC -ts recent. This shows all recent denials.\n The output should look something like this (same information, but a little less user friendly):\n  By default, logs stored in  /run/log/journal are not persisted across system reboots. That might become a problem if you need to debug logs on a crashing system.\n   By uncommenting and changing  Storage to  persistent, we tell  systemd to store all logs in  var/log/journal. Aside from this change, we also need to run  systemctl reload systemd-journald to make sure that the change takes effect.\n Even though this change will persist logs on your system, it won’t keep all of them forever. By default,  journald is configured to not exceed 10% of the filesystem or leave the system with less than 15% of free space.\n Now, to actually inspect the previously-stored logs. First, switch to  root user. Run  journalctl --list-boots. This will give you a list like this:\n  Based on the dates and times, choose from which boot you want to see logs. For example, to view logs from the boot with id  -2 with log level  err or higher:\n  If the logs above are not enough to troubleshoot your issues, then there are other log files to check:\n  Alternatively, if you can’t boot your machine normally, then you can access  emergency.target as shown above, a view logs there in the same way.\n  There is a lot more that can go wrong with a Linux machine than what I have shown in the sections above. These examples/approaches, however, can be applied to a variety of other problems that you might encounter.\n Also, not all of them are life-and-death kind of situations, but it’s always preferable to be able to solve them rather quickly, especially if this problematic machine is a production system.\n Solving most of the issues depends on getting the right information and being able to restore previous configurations, therefore, it’s crucial to always store logs and to backup critical files on your system before modifying them", "posttime": "2020-05-02 18:00:30", "tags": "密码,linux,mac,selinux", "title": "保存您的Linux计算机-恢复您的root密码等", "title_en": "Save your Linux machine – Recovering your root password and more", "transed": 0, "url": "https://medium.com/better-programming/save-your-linux-machine-from-certain-death-24ced335d969", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["密码", "linux", "mac", "selinux"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与其他任何人一样了解该架构-并与技术堆栈保持同步。\n附表1-1s与您的直接下属每周进行沟通。按月安排跳级计划。\n以客户为中心。了解您的产品是如何在野外使用的。例如，加入销售和支持电话。\n设定积极但可实现的目标。通过专注于你想要实现的结果来倒退。\n确保每份报告都清楚团队、组织和公司的首要任务。\n任何任务都不是经理所能胜任的。弄脏你的手，即使它不是编码：\n千万不要一对一跳过。它是接收和提供反馈的最佳平台。大多数队友都重视这一点，通常当他们没有看到其中一人执行得很好时，他们就不会这么做了。\n帮助组织每个主题的问题。在1-10分的范围内，你会如何评价：.&#34；\n不常问的其他问题：组织意识：您认为本季度您最优先考虑的3个问题是什么？团队的？组织？\n有关有效的一对一的更多想法，请参见从你的一对一中获得更多。\n默认开放问题：问什么、怎么问、问谁，而不是像Do、Have这样的封闭式问题，就是邀请对话，并让人对问题拥有所有权。为什么你认为这是正确的方法？&#34；比&#34；这是个好主意吗？&#34；。\n总结一下对方所说的话，这样你们就能达成一致，并准确地指出问题所在。听起来有两个问题，x和y。我们应该首先关注哪一个？\n即使是正面的反馈，也要具体。我喜欢您为减少该服务的内存占用而采取的举措。它显示所有权。&#34；\n关注数据而不是行为：我注意到你没有回答你在过去三份公关中提出的任何评论。\n谈谈这件事为什么重要，以及它影响的是谁：我之所以提到它，是因为我分配给您的罚单对本季度的路线图至关重要。\n突出正面模式(记住要具体)。我喜欢你主动清理代码，因为它显示了所有权。\n很高兴看到你教X关于Y的知识，这样他们就能和你一样熟练了。这是高级工程师的特点。\n你的团队是如何移动针头的？你把注意力放在正确的事情上了吗？您如何知道您重新构建的功能将使客户受益？\n公司今年的首要任务是什么？从现在开始三年后，公司应该是什么样子？\n如果你升职了，你的团队中谁会接替你的位置？这个人需要掌握哪些技能或经验？\n确定决定是可逆的还是不可逆的。如果没有大量的返工，就不可能改变不可逆转的决定。这些决定应该花更长的时间，并记录下来并进行讨论。示例：架构更改、语言决策、数据模型。\n无论何时存在分歧，都要关注决策的预期结果，并确保团队意识到您的推理。虽然数据库X更好，但我希望我们在一个堆栈上实现标准化，以便它更容易维护。\n如果有人不同意一个可撤销的决策，设定一个日期与团队一起重新审视该决策，理想情况下，您也有定义该决策成功与否的度量标准。我理解你的担忧。让我们一个月后再来讨论这个问题，看看我们的进展如何。\n如果有人不同意一个不可逆转的决定，给他们机会陈述自己的情况。不管怎样，每个人都应该意识到最终的决定是你的，团队需要不同意并完全致力于所做的决定。\n将您的决策记录下来，以便您可以参考做出这些决策的原因以及您的团队所面临的权衡。\n发现一个令人讨厌但似乎永远不会成为首要任务的p2病毒？✅。\n避免糟糕的头脑风暴会议。不要把决定推迟到会议上。当场做出决定，通过长篇写作进行沟通，并利用会议进行讨论。\n会议结束时总是带着行动、所有者和时间安排，这样下一步是什么就很清楚了。\n在员工会议上，围着桌子转一圈，询问报告他们最关心的是什么。许多经理想参加高管员工会议，因为这会让他们感到需要，并让他们知情。我利用了这一愿望，设定了入场费：你必须承认至少有一件事着火了。-霍洛维茨(Horowitz)。\n最好的程序员并不比优秀的程序员好多少。无论以什么标准衡量：概念创造力、速度、设计的独创性或解决问题的能力，它们都要好上几个数量级。-兰德尔·E·斯特罗斯(Randall E.Stross)。\n主人。即使问题不是他们百分之百的责任，也要承担责任；了解原因。请告诉我您在职责范围之外承担重要任务的情况", "note_en": "Know the architecture just as well as anyone else — and stay current with the tech stack.\n Schedule 1-1s with your direct reports on a weekly basis. Schedule skip-levels on a monthly basis.\n Be customer-focused. Understand how your products are used in the wild. For example, join sales and support calls.\n Set aggressive but achievable goals. Work backwards by focusing on the outcomes you want to achieve.\n     Ensure every report is aware of the top priorities of the team, organization and company.\n  No task is beneath a manager. Get your hands dirty even if it&#39;s not coding:\n  Never skip one on ones. It&#39;s the best platform for receiving and giving feedback. Most teammates value it and usually when they don&#39;t it&#39;s because they haven&#39;t seen one conducted well.\n   Questions to help frame each topic. &#34;On a scale of 1-10 how would you rate:...&#34;\n Additional questions to ask on a less frequent basis: Organization awareness: What do you see as your top 3 priorities this quarter? The team’s? The org&#39;s?\n  See  getting more from your one on ones for more thoughts on effective one on ones.\n  Default to open questions: ask questions starting with  what,  how,  who instead of closed-ended ones like  do,  have,  is to invite conversation and give ownership over a problem. &#34;Why do you think this is the right approach?&#34; is better than &#34;Is this a good idea?&#34;.\n Summarize what the person is saying so you&#39;re both on the same page and are pinpointing the problem. &#34;It sounds like there are two issues, x and y. Which should we focus on first?&#34;\n  Be specific even if it&#39;s positive feedback. &#34;I like the initiative you took to reduce the service&#39;s memory footprint. It shows ownership.&#34;\n Focus on data and not behavior: &#34;I noticed you didn&#39;t address any of the comments made in your last three PRs&#34;\n Talk about why this matters and who it&#39;s affecting: &#34;I mention it because the ticket I assigned you is critical to this quarter&#39;s roadmap&#34;\n   Highlight positive patterns (remember to be specific). &#34;I like it when you take initiative in cleaning up code because it shows ownership.&#34;\n &#34;It&#39;s great to see you teach X about Y so that they&#39;re as proficient as you. That&#39;s a trait of a senior engineer.&#34;\n  How is your team moving the needle? Are you focusing on the right things? How do you know the features you&#39;re building will benefit the customer?\n  What are the company&#39;s top priorities this year? Where should the company be three years from now?\n   If you were to get promoted, who from your team would take your place? What skills or experience does this person need to acquire?\n  Determine if the decision is  reversible vs. irreversible. Irreversible decisions cannot be changed without significant rework. These decisions should takelonger and be documented and discussed. Examples: architecture changes, language decision, data models.\n Whenever there is disagreement, focus on the intended outcome of the decision and make sure the teamis aware of your reasoning. &#34;While database X is better, I want us to standardize on one stack so that it&#39;s easier to maintain.&#34;\n If someone disagrees with a reversible decision, set a date to revisit that decision with the team.Ideally you also have metrics to define the success of that decision. &#34;I understand your concerns. Let&#39;s revisit this in a month and see where we stand.&#34;\n If someone disagrees with an irreversible decision, give them the opportunity to present their case.Regardless, everyone should be aware the decision is ultimately yours and the team needsto  disagree and commit wholly to the decision made.\n Document your decisions so that you can refer to why they were made and the tradeoffs your team faced.\n   Picking up a p2 bug that&#39;s annoying but never seems to become top priority?  ✅\n    Avoid  shitty brainstorm sessions. Don’t defer decisions to meetings. Make decisions on the spot, communicate it over long-form writing, and use the meeting to discuss it.\n  Always end a meeting with actions, owners and timing, so it&#39;s clear what next steps are.\n For staff meetings, go around the table and ask reports what their biggest concerns are. Many managers want to attend executive staff meetings, as it makes them feel needed and puts them in the know. I made use of this desire by setting a price of admission to the meeting: you had to fess up to at least one thing that was &#39;on fire.&#39;&#34; - Horowitz\n  The best programmers are not marginally better than merely good ones. They are an order-of-magnitude better, measured by whatever standard: conceptual creativity, speed, ingenuity of design, or problem-solving ability. – Randall E. Stross\n   Owner. Takes ownership of a problem even when it&#39;s not 100% their responsibility; understands the why. &#34;Tell me about a time when you took on something significant outside of your area of responsibility. Why was it important? What was the outcome?&#34;\n &#34;Tell me about a time when you made a hard decision to sacrifice short term gain for a longer term goal.&#34;\n Handles ambiguity &#34;Can you tell me about a time when you had to solve an ambitious problem? Why was the problem important?&#34;\n &#34;Can you tell me about a time when you had to make a decision without complete information? What was the situation? What risks did you take? Why did you make the decision you made?&#34;\n  Communicator. Can articulate ideas at different levels. &#34;You mentioned X in your resume. Explain it to me as if I&#39;ve never come across it?&#34;\n  Deep diver. Digs a level deeper to understand what&#39;s happening under the hood. &#34;Tell me about a time you were trying to understand a problem on your team and you had to go down several layers to figure it out.&#34;\n Simplifier. Simplifies problems instead of just hacks at things and adds tech debt. Does the person have a build vs. buy mentality.\n  Short tenure at companies. If a candidate typically stays at companies for less than a year, ask them why. There might be perfectly valid reasons or it might indicate a pattern that the person is difficult to work with.\n Menu of technologies. Resumes that just list technologies used instead of problems solved may indicate person may not be thinking big picture. Also a typical trait of junior engineers.\n Long resumes. More than 2 pages may indicate the person has difficulty distilling what&#39;s important. That being said, there can be culture reasons for long resumes. For example, in some European countries, resumes are encouraged to be long.\n  Having a good onboarding process is crucial to the success of your team and new team members. It ensures team members are contributing as early as possible and are assimilated into your processes and culture.\n An onboarding process is successful if your new team member can contribute a bug fix on their first day of joining.\n      The Pendulum or the Ladder: On the challenges of being a manager who wants to stay technical.\n  What You Do Is Who You Are: Why company culture matters and how to establish one.\n    LifeLabs Learning. Great workshop for new and experienced managers. I learned a lot from it on feedback, coaching and 1-1s.\n How Software Engineers Can Help Interview Their Future Managers: A list of questions for engineers to ask interviewing managers.\n The Feedback Fallacy: focus on replaying positive performance so team members know how to repeat excellence.", "posttime": "2020-05-02 18:00:28", "tags": "启发式,playbook,决策,team", "title": "经理攻略：有效管理的启发式方法", "title_en": "Manager's Playbook: Heuristics for effective management", "transed": 0, "url": "https://github.com/ksindi/managers-playbook", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["启发式", "playbook", "决策", "team"]}, {"category": "", "categoryclass": "", "imagename": "4eb2b6d340e8e255b43e67e8eb0803d1.jpg", "infoid": 1000226, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们采访了围棋编程语言(The Go Programming Language)的合著者罗布·派克(Rob Pike)，谈到了他跨越40年的职业生涯，围棋在过去10年的演变，以及未来的发展。\nEvrone：与今天的许多开发人员不同，您几十年前在贝尔实验室开始了您的职业生涯。考虑到你罕见的视角，我们开发软件的方式发生了什么最大的变化，你能想到的是什么？\n罗伯：今天的规模要大得多。不仅仅是计算机和网络，还有程序本身。所有Unix版本6(大约1975年)都可以舒适地安装在单个RK05磁盘组上，该磁盘组有2MB多一点的存储空间，还有大量空间可供用户软件使用。这是一个很好的计算环境，或者至少在当时看起来是这样。当然，虽然我可以解释其中的大部分增长，但这是令人震惊的，可能并不是所有的增长都是合理的。\nEvrone：考虑到对变革的抵制和对兼容的承诺，你如何看待围棋编程语言及其生态系统的未来10年？您为您的技术设想的最好的未来是什么？\n罗伯：虽然还远不能确定，但经过十多年的研究，它看起来像是参数多态性的设计，俗称泛型，但有误导性，将在未来一两年内问世。这是一个非常困难的问题，要找到一个在现有语言中工作并感觉像是属于它的设计，但伊恩·泰勒(Ian Taylor)在这个问题上投入了惊人的精力，看起来答案现在已经触手可及。\n这将对图书馆、生态系统和社区产生怎样的影响，这将是一个引人入胜的观察。\nEvrone：随着&#34；渐进式键入被引入&#34；动态键入的语言中，并且&#34；类型推理被引入&#34；静态键入的&#34；中，两者之间的界限现在变得模糊了。您对现代编程语言的类型系统有什么看法？\n罗伯：我是静态类型的铁杆粉丝，因为它带来的稳定性和安全性。\n我是动态打字的狂热粉丝，因为它带来的乐趣和轻量级的感觉。(顺便说一句，对集成单元测试的大力推动可以归功于诸如Python这样的语言，它们推动了测试，以证明键入系统无法提供的正确性。)。\n我不喜欢类型驱动编程、类型层次结构、类和继承。虽然许多非常成功的项目都是这样建造的，但我觉得这种方法在经验影响之前，就把重要的决策推到了设计阶段的太早。换句话说，我更喜欢写作而不是继承。\n不过，我要对那些喜欢使用继承来构建程序结构的人说：不要注意，请继续使用对您有效的方法。\n埃夫龙：有时人们会以奇怪的方式使用技术。例如，要从高级Python或Ruby代码生成高效的Go代码(是的，我们看到了！)。这些年来，你见过的最奇怪、最有创意或最有趣的围棋用法是什么？你最惊讶的是什么？\n罗伯：最大的惊喜是当我们得知Go被用来写恶意软件的时候。您无法控制谁将使用您的作品，或者他们将如何处理这些作品。\nEvrone：您创建了许多文本编辑器。您觉得Visual Studio代码怎么样？有了像LSP这样的技术，文本编辑器和IDE之间的界限现在变得模糊了。你认为软件开发人员需要像Goland这样功能齐全的IDE吗？或者使用VSCode就可以了？\nRob：我来自一个不同的时代，在IDE之前，但在项目的早期就有关于Go是否需要IDE才能成功的讨论。然而，团队中没有人拥有合适的技能集，所以我们没有尝试创建一个。然而，我们确实创建了用于解析和打印GO代码的核心库，这很快就为各种编辑器和IDE提供了高质量的插件，这是一个偶然的成功。\n最近，我们一直在努力开发名为gopls的围棋LSP服务器，任何支持该协议的编辑器或IDE都可以使用它来改善使用该语言的体验。\n也许是因为我们习惯于使用更简单风格的编辑器，所以我们确保人们可以在围棋中舒适地工作，而不需要从编程环境中进行繁重的工作。不过，IDE当然可以提供帮助：我现在看到的大多数使用Go的人都使用IDE，或者至少使用支持自定义Go的编辑器，并且从中获得了很大的价值。\n使用哪种编辑风格的问题是一个品味问题，受到你工作所用语言的文化的影响。\nEvrone：软件开发人员倾向于给东西贴上标签，比如DART是前端语言，C是系统低级语言，等等。考虑到Go编程语言的功能集和用法，您现在如何称呼Go编程语言？\nRob：Go是一种通用编程语言。你想写什么就写什么，不用担心把语言或任何其他技术都归结于单一的问题领域。\n罗伯：围棋体验", "note_en": "We spoke to Rob Pike, the co-author of the Go programming language, about a career spanning four decades, the evolution of Go over the last ten years, and into the future.\n  Evrone: Unlike many developers today, you started your career decades ago at Bell Labs. What’s been the biggest change in the way we develop software that you can think of, given your rare perspective?\n Rob: The scale is much bigger today. Not just of the computers and the network, but the programs themselves. All of Unix version 6 (circa 1975) fits comfortably on a single RK05 disk pack, which has just over 2MB of storage, with lots of room left over for user software. And that was a fine computing environment, or at least seemed like one at the time. Although I can, of course, explain much of the growth, it is astonishing and perhaps not all of it is justified.\n  Evrone: Given the &#34;resistance to change&#34; and &#34;promise of compatibility&#34; ideas, how do you see the next 10 years for the Go programming language and its ecosystem? What is the best future you envision for your technology?\n Rob: Although it&#39;s far from certain, after over a decade of work it looks like a design for parametric polymorphism, what is colloquially but misleadingly called generics, is coming in the next year or two. It was a very hard problem to find a design that works within the existing language and feels as if it belongs, but Ian Taylor invested a phenomenal amount of energy into the problem and it looks like the answer is now in reach.\n How that affects the libraries, the ecosystem, and the community will be fascinating to watch.\n  Evrone: With &#34;gradual typing&#34; being introduced into &#34;dynamically typed&#34; languages and &#34;type inference&#34; into &#34;statically typed&#34;, the line between two is now blurred. What is your opinion on a type system for a modern programming language?\n Rob: I am a big fan of static typing because of the stability and safety it brings.\n I am a big fan of dynamic typing because of the fun and lightweight feel it brings. (As a side note, the big push for integrated unit testing can be credited to languages like Python, which drove testing to demonstrate correctness that the typing system failed to provide.)\n I am not a fan of type-driven programming, type hierarchies and classes and inheritance. Although many hugely successful projects have been built that way, I feel the approach pushes important decisions too early into the design phase, before experience can influence it. In other words, I prefer composition to inheritance.\n However, I say to those who are comfortable using inheritance to structure their programs: pay no attention and please continue to use what works for you.\n  Evrone: Sometimes people use technologies in strange ways. For example, to generate efficient Go code from the high-level Python or Ruby code (yes, we saw that happening!) Over the years, what is the strangest, most creative or amusing Go usage have you seen? What surprised you the most?\n Rob: The biggest surprise was when we learned that Go was being used to write malware. You can&#39;t control who will use your work or what they will do with it.\n  Evrone: You created a number of text editors. What do you think about the Visual Studio code? With technologies like LSP, the line between &#34;text editor&#34; and IDE is blurred now. Do you think software developers need full-featured IDEs like GoLand or using VSCode is fine?\n Rob: I am from a different time, before IDEs, but there was talk early in the project about whether Go needed an IDE to succeed. No one on the team had the right skill set, though, so we did not try to create one. However, we did create core libraries for parsing and printing Go code, which soon enabled high-quality plugins for all manner of editor and IDE, and that was a serendipitous success.\n More recently, we&#39;ve been working hard on an LSP server for Go called gopls, which can be used by any editor or IDE that supports that protocol to improve the experience working with the language.\n Perhaps because of our comfort working with simpler styles of editor, we made sure that one could work comfortably in Go without heavy lifting from the programming environment. An IDE can certainly help, though: most of those I see working in Go today use one, or at least an editor with custom Go support, and get much value from it.\n The question of what style of editor to use is a matter of taste, colored by the culture of the language you work in.\n  Evrone: Software developers tend to label things, such as Dart being a &#34;frontend language&#34;, and C being a &#34;system low-level language&#34;, and so on. How would you term the Go programming language now, given its feature set and usage?\n Rob: Go is a general-purpose programming language. Write whatever you want in it and don&#39;t worry about pinning the language, or any other technology for that matter, to a single problem domain.\n   Rob: The Go experience has taught me that people love to opine about languages, perhaps more than almost any other element of our field. And I have certainly done so myself. But I am tired of the negativity that often results, so now I try to avoid judging things for others.\n There has been a real renaissance in language design over the last 10 years or so, after a period where very few new languages were arriving and succeeding. It&#39;s great to see this and the innovation it brings.\n  Evrone: How does being a Google employee help you develop and guide the Go language? How important is it to be able to ask &#34;tell us how you use our language&#34; on Twitter and get responses from the biggest companies all over the world? Is it just a nice addition or an essential part of language development? How does Google help you?\n Rob: Google has been very generous in its support for the Go project, for which I am very grateful. And of course the language was created because we thought Google needed it; what became called &#34;cloud computing&#34; needed a language with good support for concurrency and easy deployment, among other things. But Google has not directed the project in any significant way. It supports us and lets us do what we think is best.\n Regarding other companies and other users, input from the community is a vital part of understanding how the project, by which I mean the language, compiler, tools, runtime, library, environment — all of it — advances.\n  Evrone: After 10 years of Go development and observing how it is used, what can you name the biggest design success and, opposite, biggest design failure for the language? It&#39;s strongest and weakest points, respectively?\n  The technical one is first-class support for concurrent computation. Go is only a decade or so old, but when it was being developed, &#34;threading&#34; and concurrency were not widely appreciated in the programming community. In fact a major reason for creating Go was the difficulty of doing concurrent computation in C++ at the time. It became clear shortly after launch that the concurrency support was a major attraction, one that compensated for what some felt were  ...\n As John Graham-Cumming of Cloudflare says, &#34; I came for the easy concurrency, I stayed for the easy composition&#34;.\n  The political success was the firm  promisemade about compatibility for Go version 1. Once we, and the community, had used Go for a few years, we had a long list of things we wanted to fix, but change is disruptive. So we did a careful program of updates, with the &#34;go fix&#34; command to pull the community along, and once that was done, not only did we stop, we promised to stay stopped. That stability —Go programs written in 2012 will still compile and run perfectly  ...\n  Evrone: What does your work-life balance look like? There are lots of talks about &#34;burn-outs&#34; right now, and the epidemic situation does not help at all. Any hints from your 40-year journey for new generations of developers?\n Rob: The best way to avoid burnout is to do something you truly enjoy in an environment that supports you. I&#39;ve been very lucky in that regard through my whole career, but I realize not everyone is as fortunate. If you&#39;re feeling stressed by work, you should feel free to take a break or change direction, especially in our current situation.\n  Evrone: In hindsight, the popularity of many technologies is credited to so-called &#34;killer apps&#34; that made them popular. Can you name such a &#34;killer app(s)&#34; for the Go programming language and what do you think about such a &#34;killer app&#34; idea as a whole?\n Rob: A few years ago, Danny Berkholz called Go &#34; the emerging language of cloud infrastructure,&#34; and that is no accident. Go was designed by people working at Google to make it easier to write Google-relevant software, in particular network-resident servers. That&#39;s what we call &#34;cloud&#34; today. (Some of the motivation for the design is in my Splash keynote from 2012,  Go at Google: Language Design in the Service of Software Engineering.)\n So although it was gratifying and important to see Docker, Kubernetes, and many other components of  cloud computing written in Go, it&#39;s perhaps not too surprising. Go has indeed become the language of cloud infrastructure.\n  Evrone: What competition do you see for the Go programming language right now and in what area? What is your opinion about Rust with its &#34;no-garbage-collection&#34; ideas and compile-time guarantees?\n Rob: Rust is an intriguing language and I watch its development with interest. Beyond that, I offer no opinion, as I said above.\n  Evrone: Go has just reached 70k stars on GitHub! How do you see different social activities like GitHub, Reddit, Twitter, offline and online conferences, webinars etc influence the language? Are they important for the language&#39;s success or they just reflect it?\n Rob: The people we have met through conferences and social media have been a critical part of the development of Go and all its elements. Many, many contributors have affected the development in positive ways, including the original port to Windows and a number of non-x86 architectures, development of tools and libraries, thoughtful discussions of technical proposals, and much more.\n And it goes the other way, as the Go team reaches out to the community to start discussions, pose questions, and ask for help and guidance.\n One thing that I think is important is to engage with the community as one voice, to speak as a team rather than as individuals. A consistent message is more easily understood.\n  Evrone: How being the author of one of the popular programming languages has changed your life?\n Rob: A correction: I am a co-author, not the author. Ken Thompson and Robert Griesemer started the project with me, and many others contributed massively. So please don&#39;t single me out as &#34;the author&#34;.\n To answer your question, Go has certainly raised my public profile and introduced me to a new and vibrant community but beyond that it hasn&#39;t had much effect. I&#39;ve had a long career with other successes (and innumerable failures).\n  Evrone: Imagine that you have an opportunity to travel back in time and give only one piece of advice to your younger self, at around the time you’ve started to design the Go language spec. What advice would you give to yourself and your colleagues?\n Rob: That&#39;s easy: Ignore the haters. Just listen to the voices that understand and share your goals; they&#39;re the ones to care about. Not everyone agrees with what you&#39;re doing, and that&#39;s OK. But those who engage in advancing what you&#39;re trying to do can be a fantastic source of ideas, energy, and inspiration.\n   At Evrone we pride ourselves on using the best tool for the job, whether that’s  Ruby on Rails,  Python,  Elixir, or, of course,  Go. We strive to stay at the forefront of a range of technologies to be able to provide the best and most appropriate solutions to meet our clients’ needs, and we’re very happy to do all we can to help bring developer communities together.", "posttime": "2020-05-02 18:00:21", "tags": "罗伯,pike,language", "title": "罗伯·派克采访", "title_en": "Rob Pike interview", "transed": 0, "url": "https://evrone.com/rob-pike-interview", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["罗伯", "pike", "language"]}, {"category": "", "categoryclass": "", "imagename": "6f812cf55b4ad05940b2f7cddbfdb7e6.png", "infoid": 1000225, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我们开始看到计算机走上街头，幸运的是，它主要是帮助我们获得快递或运送我们四处走动。这些机器人是传感器、计算单元和某种形式的连接的组合。他们有个性，如果你仔细看，邮差服务上有两只可爱的眼睛，这为它提供了立体视觉来导航街道。虽然“服务”是完全准备好在街道上导航，即使是最聪明的机器人也需要来自.。\n我们中的许多人都认为远程访问计算机是理所当然的，尽管我们的生产服务器在NAT之后运行。这是由SRE实现的，他们设置公共端点和堡垒主机，并配置基于身份的身份验证，正如我们在上一篇名为如何正确使用SSH的帖子中所介绍的那样。但是，如果您的计算机正在移动，该怎么办呢？如果你在成千上万的城市拥有成千上万的手机，会发生什么呢？如何为系统级调试提供访问权限？哪种技术.。\n我们很幸运地为物联网设备提供了一系列连接选项，从高速LTE连接到新的LoRaWAN网络。连接到网络后，下一步是访问设备。本文将重点介绍如何按照最佳实践使用SSH。前面，我们概述了如何配置本地ssh-agent以连接到堡垒主机。这种方法工作得很好，但除非你一开始就有一个非常好的命名约定，否则要找到一个机器人就会变得困难得多……。\n我们已经采用了访问系统的最佳实践，并将它们合并到我们的开源项目Teleport中。Teleport旨在替代OpenSSH，但重点放在服务器车队(群集)上，其中单个节点(如自动驾驶卡车或常规AWS实例)可以位于世界任何地方。证书颁发机构和审计日志部署在安全网络中，只有代理可用于公共互联网。让我们更深入地研究一下。..。\n虽然送货机器人的技术细节通常是保密的，但我们知道其他人已经花了很长时间才能通过David的可怕的阴影项目来SSH到灯柱中。同样的方法也可以应用于使用反向SSH隧道的自动驾驶机器人，但这种方法的可扩展性仅限于此，并且需要50多个步骤才能设置。\n反向SSH隧道是主机(自动驾驶车辆)向代理发起的SSH连接。只要主机在线，此连接就会一直保持，如果工程师或Ansible脚本想要连接到车辆，他们会连接到代理，然后代理通过隧道将连接代理到发起连接的主机。\n我们有许多长期要求支持反向隧道的请求，有了OSS Teleport4.0，我们使这些反向隧道的设置和管理变得更简单。这可以通过几个快速步骤在节点上设置。\n在机器人/灯柱/自动驾驶卡车上，将安装远程端口守护程序，然后将拨回中央远程端口群集。\n可以设置额外的配置选项来添加标签和额外的支持元数据，以帮助操作员。\n连接到代理后，“节点”(在我们的示例中是单个Raspberry PI)将显示在Teleport Web UI中，您也可以使用CLI客户端查看它：\n服务器~tsh ls节点名地址标签-Truck-1821➜⟵隧道拱门=linux，主机名=PostMate-SERVE-342145正常运行时间=正常运行时间=0分钟，📍=SF📶=5G。\n现在，我可以使用节点名称通过SSH连接到该节点。\n您可以使用Truck-1821的节点名ssh进入Truck-1821，这意味着您不必再担心IP地址或必须在其位置设置动态DNS。\n标签可以提供系统数据和位置数据。这使得管理一大批设备变得容易得多。\n随着规模的扩大，我们已经开始看到更多的计算机被推向边缘，一些人猜测这可能是云计算的终结。作为背景，自动驾驶卡车每英里产生10G的数据。一些自动驾驶公司已经公布了他们是如何管理和设置网络基础设施的。克鲁斯为任何对这个话题感兴趣的人提供了一个很棒的博客。\n随着这些系统变得越来越复杂，让更多的计算和额外的冗余运行容器编排系统对于每英里扩展与数千兆字节数据相关的工作负载是有意义的。然而，对于运营商来说，这些系统可能越来越难以更新、调试和访问。提供访问权限打开了潘多拉的问题盒子。如果机器人或人类可以访问机器，就需要有审核跟踪、审批工作流，以及对运行内容的完全可见性……。\n这些问题在小范围内很容易解决，但100多个群集就会变得越来越困难。将大型群集与数百名员工组合在一起可能会造成额外的运营复杂性。我们已经有了", "note_en": "Over the last couple of years, we’ve started to see computers take to the street, and lucky for us, it’s been mostly to help us get deliveries or transport us around. These robots are a combination of sensors, compute units, and some form of connectivity. They have personalities, and if you look closely, two cute eyes on  Postmates’ Servethat provide it with stereo vision to navigate the streets. While ‘Serve ’is fully equipped to navigate the streets, even the smartest robots need help from a  ...\n Many of us have taken accessing computers remotely for granted, despite the fact that our production servers are running behind NAT. This has been made possible by SREs who set up public endpoints and bastion hosts, and configure identity-based authentication as we’ve covered in a previous post called   How to SSH properly. But what if your computer is on the move? What happens if you have thousands of them in thousands of cities? How do you provide access for system-level debugging? Which technical  ...\n   We are lucky to have a range of connectivity options available to IoT devices, from high speed LTE connections to new  LoRaWANnetworks. Once connected to a network, the next step is to get access to the device. This post will focus on using SSH by following best practices. Earlier, we ’ve outlined how to configure the local ssh-agent to connect to a Bastion Host. This method works well, but unless you start off with a very good naming convention, it becomes much harder to find that one robot  ...\n We ’ve taken the best practices of accessing systems and rolled them into our open source project, Teleport. Teleport was designed as a drop-in replacement for OpenSSH, but with a focus on fleets of servers (clusters) where individual nodes such as self-driving trucks (or regular AWS instances) can be located anywhere in the world. The certificate authority and the audit log are deployed in secure networks with only the proxy available to the public internet. Let ’s dive a bit deeper into it.  ...\n  While the technical details of delivery robots are often kept under wraps, we know other people have gone to great lengths to be able to  SSH into lamp posts with David’s Awesome  Shadowing Project. The same approach could be applied to self-driving robots using a reverse SSH tunnel, but this method only scales so far, and it requires more than 50 steps to set up.\n A reverse SSH tunnel is an SSH connection initiated by the host (self-driving vehicle) to the proxy. This connection is maintained for as long as the host is online, and if an engineer or an Ansible script wants to connect to the vehicle, they connect to the proxy, which in turn proxies the connection through the tunnel to the host who initiated it.\n We had many  long standing requests to support reverse tunnels, and with OSS Teleport 4.0, we’ve made setting up and managing these reverse tunnels simpler. This can be set up on the node in a couple of quick steps.\n On the robot/lamp post/self-driving truck, the Teleport daemon will be installed and will then dial back to a central Teleport Cluster.\n  Extra configuration options can be set up to add labels and extra supporting metadata to help the operator.\n After connecting to the proxy, the ‘node’ - in our case a single Raspberry Pi - will show in the Teleport web UI and you can see it by using the CLI client as well:\n ➜ ~ tsh lsNode Name Address Labels--------------------- --------------- --------------------------------------------------Truck-1821 ⟵ Tunnel arch=Linux, hostname=postmate-serve-342145 uptime=up 0 minutes, 📍=SF 📶=5G\n I’m now able to SSH into the node using it’s node name.\n   You can ssh into truck-1821 using it’s nodename, meaning you no longer have to worry about IP addresses or having to setup Dynamic DNS at its location.\n Labels can provide both system and location data. This makes managing a large fleet of devices much easier.\n  Moving up in scale, we’ve started to see more computers move to the edge, and some have speculated that this could be the  end of cloud computing. For context, a self driving truck generates 10 gigabytes of data per mile. Some self-driving companies have published how they manage and set up network infrastructure. Cruise has a  great blog for anyone interested in the topic.\n As these systems become more complex, having more compute and extra redundancy running a container-orchestration system makes sense to scale the workloads associated with many gigabytes of data every mile. Yet for operators, these systems can be increasingly difficult to update, debug, and access. Providing access opens Pandora ’s box of issues. If robots or humans can access machines, there needs to be an audit trail, approval workflows, and full visibility into what ’s been run  ...\n These problems can be easy to solve on a small scale, but become increasingly difficult with 100+ Clusters. Combining a large cluster with hundreds of employees can create extra operational complexity. We have had many users facing the same problem and by using external identity providers combined with a flexible Role Based Access Control (RBAC), They get access quickly and securely.\n In this quick example we’ll show how a fictional company has deployed multiple kubernetes clusters into trucks, yet still require a centralized command and control over the cluster.\n  Teleport provides users two options for connecting to a Kubernetes cluster, it can be run as a proxy outside the cluster or deployed inside a cluster. We recommend deploying inside a cluster, then registering the cluster back to a central root cluster using t rusted clusters.\n All of these features are available in the OSS version of Teleport, using Github as an SSO provider. We’ve more information on our  Kubernetes integration here.\n   No matter where you run a computer, be it a small home lab, a small robot or many thousands of self-driving trucks, these patterns can be used to get secure access quickly. The use of reverse tunnels to access infrastructure can be very powerful when you don’t have full control over the network.", "posttime": "2020-05-02 18:00:19", "tags": "进入,driving,连接,access", "title": "如何SSH进入自动驾驶卡车", "title_en": "How to SSH into a self-driving truck", "transed": 0, "url": "https://gravitational.com/blog/how-ssh-into-a-self-driving-vehicle/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["进入", "driving", "连接", "access"]}, {"category": "", "categoryclass": "", "imagename": "99802949575453c4fb0dd2b264902060.jpg", "infoid": 1000224, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到内容你可以通过网络和第三方应用程序向推文添加位置信息，例如你所在的城市或精确位置.。你始终可以选择删除推特位置记录。了解更多。\n隐私公开·任何人都可以关注该列表私密·只有你可以访问此列表。\n以下为推文链接.。复制以与好友轻松分享推文.。\n复制下列代码，把此推文添加到你的网站上.。了解更多。\n复制下列代码，把此视频添加到你的网站上.。了解更多。\n在你的网站或应用中嵌入推特内容即表示你同意推特开发者协议和开发者政策。\n还没有推特吗？注册，关注你的兴趣所在，并获取即时更新.。\n这个时间线是你花费时间最多的地方，供你获取你关心事物的最新动态.。\n鼠标悬停在个人资料图片上并点击“正在关注”按钮，即可取消关注任何账号.。\n当你看到一条自己喜欢的推文时，点击爱心，即可让作者知道你分享了爱.。\n和你的关注者分享别人推文的最快捷方式就是转推.。点击图标立即发出转推.。\n通过回复，提出你对任何推文的看法.。找出一个让你充满热情的话题，立即加入进去.。\n对人们正在讨论的话题获得即时洞察.。\n关注更多账号，获得关于你关心话题的最新动态.。\n即时看到关于任何话题的最新讨论。\ntwitter可能超载或出现了暂时故障。重试或访问twitter状态以了解更多信息。", "note_en": "跳到内容              你可以通过网络和第三方应用程序向推文添加位置信息，例如你所在的城市或精确位置。你始终可以选择删除 Tweet 位置记录。  了解更多\n     隐私  公开 · 任何人都可以关注该列表       私密 · 只有你可以访问此列表\n  以下为推文链接。复制以与好友轻松分享推文。\n 复制下列代码，把此推文添加到你的网站上。  了解更多\n  复制下列代码，把此视频添加到你的网站上。  了解更多\n    在你的网站或应用中嵌入 Twitter 内容即表示你同意 Twitter  开发者协议 和  开发者政策。\n     还没有 Twitter 吗？注册，关注你的兴趣所在，并获取即时更新。\n      这个时间线是你花费时间最多的地方，供你获取你关心事物的最新动态。\n 鼠标悬停在个人资料图片上并点击“正在关注”按钮，即可取消关注任何账号。\n 当你看到一条自己喜欢的推文时，点击爱心，即可让作者知道你分享了爱。\n 和你的关注者分享别人推文的最快捷方式就是转推。点击图标立即发出转推。\n 通过回复，提出你对任何推文的看法。找出一个让你充满热情的话题，立即加入进去。\n 对人们正在讨论的话题获得即时洞察。\n 关注更多账号，获得关于你关心话题的最新动态。\n 即时看到关于任何话题的最新讨论\n      Twitter 可能超载或出现了暂时故障。 重试或访问  Twitter 状态以了解更多信息。", "posttime": "2020-05-02 18:00:18", "tags": "外福,selfie,推文", "title": "自拍2外福", "title_en": "Selfie 2 Waifu", "transed": 0, "url": "https://twitter.com/tkasasagi/status/1250427941567094786", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["外福", "selfie", "推文"]}, {"category": "", "categoryclass": "", "imagename": "942aa8cd06e06a6f7fe32f1dc0f83cb5.png", "infoid": 1000222, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "植物是有智慧的生物，有深厚的智慧可以传授--只要我们知道如何倾听。莫妮卡·加利亚诺知道如何倾听。这位进化生态学家做了开创性的实验，表明植物具有学习、记忆和做出选择的能力。这还不是全部。Gagliano是澳大利亚悉尼大学的高级研究员，他与植物交谈。他们会顶嘴。植物召唤她，告诉她如何生活和工作。加利亚诺的一些谈话发生在..。\n与苏珊娜·西马德(Suzanne Simard)和彼得·沃莱本(Peter Wohlleben)等森林科学家一起，加利亚诺就智力的本质和“植物意识”的可能性提出了深刻的科学和哲学问题。“但加利亚诺的不同寻常之处在于，她愿意谈论她与萨满和传统治疗师的经历，以及她对迷幻药的使用。”对于一个已经受到其他科学家猛烈抨击的人来说，暴露她的个人隐私并不是一个稳妥的职业选择.。\n加利亚诺认为，她用非西方方式观察世界的探索是她科学工作的一部分。“这些都是重要的门，你需要打开，你要么走进去，要么不进去，”她告诉我。“我只是决定走过去。“她说，有时候，某些植物会给她精确的指导，告诉她如何进行实验，甚至告诉她要研究哪种植物。但这并不容易。“就像爱丽丝一样，(我)发现自己掉进了一个相当奇怪的兔子洞里，……。\n在冠状病毒封锁前不久，我与达特茅斯学院的加利亚诺进行了交谈，她当时是达特茅斯学院的访问学者。我们谈论了她的实验，植物智能的新领域，以及她自己与植物交谈的经历。\n你最出名的是对含羞草的实验，它通常被称为“敏感植物”，当它被触摸时，它的叶子会立即关闭。你能描述一下你的实验吗？\n我造了一个小装置，可以让我把植物从大约15厘米的高度掉下来。所以不会太高。当它们坠落时，它们会落在一个软垫的底座上。这种植物在受到干扰时会合上叶子，特别是如果这种干扰是潜在的捕食者的话。当树叶闭合时，又大又多刺的尖锐的东西会突出出来，所以它们可能会阻止捕食者。事实上，他们不仅合上树叶，而且真的下垂，就像，“看，我死了。这里没有果汁给你喝。“。\n一点儿没错。对于一种植物或动物来说，重复一种实际上是无用的行为是没有意义的，所以我们很快就知道，无论什么是无用的，你都不会再做了。你在浪费大量的精力去做一些实际上没有帮助的事情。那么，当潜在的捕食者不是真实的，并且之后没有不良后果时，这种植物-在这种情况下是含羞草-能学会不关闭叶子吗？\n这项测试是针对一种称为习惯化的特定类型的学习进行的。我决定将它们连续丢弃60次。然后有一个很大的停顿让他们休息，我又做了一次。但在最初的三到六滴之后，这些植物已经重新开放了它们的叶子。所以在几分钟内，他们就确切地知道发生了什么-就像，“哦，天哪，这真的很烦人，但这并不意味着什么，所以我就不想费心关门了。”因为当我的叶子张开的时候，..。\n你说这些植物“明白”并“认识到”不再有威胁。你是在暗示他们“记得”你不是在比喻地使用这些词。你是说字面意思吗？\n是的，那就是他们正在做的。这绝对是记忆。这和我们用蜜蜂或老鼠做的实验是一样的。所以用“记忆”和“学习”这两个词感觉完全合适。我知道我的一些同事指责我拟人化，但这并没有拟人化。这些术语指的是某些过程。记忆和学习不是两个独立的过程。除非你记住，否则你不能学习。所以如果一株植物在所有的方框里勾选.。\n你认为这些植物真的在决定是否关闭它们的叶子吗？\n这个用米莫萨瓦做的实验并不是为了测试这个特定的问题。但后来，我用其他植物做了实验，特别是豌豆，是的，毫无疑问，这些植物在真正的决策中做出了选择。这是在迷宫的背景下测试的，测试实际上是在左和右之间做出选择。如果你选择一方或另一方，你的选择是基于你可能获得的收益。我用豌豆做了一项研究，表明植物可以选择正确的手臂。\n哦，是的，当然。我说的不是电信号。我们还发现植物会发出自己的声音。声音信号从工厂传出。\n我们称它们为点击，但这是语言可能失败的地方，因为我们试图描述一些我们不够熟悉的东西，以创建真正描述图片的语言。我们一起工作", "note_en": "Plants are intelligent beings with profound wisdom to impart —if only we know how to listen. And Monica Gagliano knows how to listen. The evolutionary ecologist has done groundbreaking experiments suggesting plants have the capacity to learn, remember, and make choices. That ’s not all. Gagliano, a senior research fellow at the University of Sydney in Australia, talks to plants. And they talk back. Plants summon her with instructions on how to live and work. Some of Gagliano ’s conversations happened  ...\n Along with forest scientists like  Suzanne Simard and  Peter Wohlleben, Gagliano raises profound scientific and philosophical questions about the nature of intelligence and the possibility of “vegetal consciousness. ”But what ’s unusual about Gagliano is her willingness to talk about her experiences with shamans and traditional healers, along with her use of psychedelics. For someone who ’d already received fierce pushback from other scientists, it was hardly a safe career move to reveal her personal  ...\n Gagliano considers her explorations in non-Western ways of seeing the world to be part of her scientific work. “Those are important doors that you need to open and you either walk through or you don ’t, ”she told me. “I simply decided to walk through. ”Sometimes, she said, certain plants have given her precise directions on how to conduct her experiments, even telling her which plant to study. But it hasn ’t been easy. “Like Alice, [I] found myself tumbling down a rather strange rabbit hole,  ...\n Shortly before the COVID-19 lockdown, I talked with Gagliano at Dartmouth College, where she was a visiting scholar. We spoke about her experiments, the new field of plant intelligence, and her own experiences of talking with plants.\n   You are best known for an experiment with  Mimosa pudica, commonly known as the “sensitive plant,” which instantly closes its leaves when it’s touched. Can you describe your experiment?\n I built a little contraption that allowed me to drop the plants from a height of maybe 15 centimeters. So it’s not too high. When they fall, they land in a softly padded base. This plant closes its leaves when disturbed, especially if the disturbance is a potential predator. When the leaves are closed, big, spiny, pointy things stick out, so they might deter a predator. In fact, they not only close the leaf, but literally droop, like, “Look, I’m dead. No juice for you here.”\n  Exactly. It makes no sense for a plant or animal to repeat a behavior that is actually useless, so we learn pretty quick that whatever is useless, you don’t do anymore. You’re wasting a lot of energy trying to do something that doesn’t actually help. So, can the plant—in this case,  Mimosa—learn not to close the leaves when the potential predator is not real and there are no bad consequences afterward?\n  The test is for a specific type of learning that is called habituation. I decided they would be dropped continuously for 60 times. Then there was a big pause to let them rest and I did it again. But the plants were already re-opening their leaves after the first three to six drops. So within a few minutes, they knew exactly what was going on —like, “Oh my god, this is really annoying but it doesn ’t mean anything, so I ’m just not going to bother closing. Because when my leaves are open,  ...\n  You say these plants “understand” and “learn” that there’s no longer a threat. And you’re suggesting they “remember.” You’re not using these words metaphorically. You mean this literally?\n Yes, that ’s what they ’re doing. This is definitely memory. It ’s the same kind of experiment we do with a bee or a mouse. So using the words “memory ”and “learning ”feels totally appropriate. I know that some of my colleagues accuse me of anthropomorphizing, but there is nothing anthropomorphic about this. These are terms that refer to certain processes. Memory and learning are not two separate processes. You can ’t learn unless you remember. So if a plant is ticking all the boxes and  ...\n Do you think these plants are actually making decisions about whether or not to close their leaves?\n This experiment with  Mimosawasn ’t designed to test that specific question. But later, I did experiments with other plants, with peas in particular, and yes, there is no doubt the plants make choices in real decision-making. This was tested in the context of a maze, where the test is actually to make a choice between left and right. The choice is based on what you might gain if you choose one side or the other. I did one study with peas that showed the plants can choose the right arm  ...\n  Oh, yeah, of course. And I’m not talking about electrical signals. We have also discovered that plants emit their own sounds. The acoustic signal comes out of the plant.\n  We call them clicks, but this is where language might fail because we are trying to describe something we ’re not familiar enough with to create the language that really describes the picture. We worked out that, yes, plants not only produce their own sound, which is amazing, but they are listening to sounds. We are surrounded by sound, so there are studies, like my own study, of plants moving toward certain frequencies and then responding to sounds of potential predators chewing on  ...\n  You are describing a surprising level of sophistication in these plants. Do you have a working definition of “intelligence?”\n That’s one of those touchy subjects. I use the Latin etymology of the word and “ intelligere” literally means something like “choosing between.” So intelligence really underscores decision-making, learning, memory, choice. As you can imagine, all those words are also loaded. They belong in the cognitive realm. That’s why I define all of this work as “cognitive ecology.”\n Do you see parallels between this kind of intelligence in plants and the collective intelligence that we associate with social insects in ant colonies or beehives?\n That kind of intelligence might be referred to as “distributed intelligence” or “collective intelligence.” We are testing those questions right now. Plants don’t have neurons. They don’t have a brain, which is often what we assume is the base for all of these behaviors. But like slime molds and other basal animals that don’t have neural systems, they seem to be doing the same things. So the short answer is yes.\n What you’re saying is very controversial among scientists. The common criticism of your views is that an organism needs a brain or at least a nervous system to be able to learn or remember. Are you saying neurons are not required for intelligence?\n Science is full of assumptions and presuppositions that we don ’t question. But who said the brain and the neurons are essential for any form of intelligence or learning or cognition? Who decided that? And when I say neurons and brains are not required, it ’s not to say they ’re not important. For those organisms like ourselves and many animals who do have neurons and brains, it ’s amazing. But if we look at the base of the animal kingdom, sponges don ’t have neurons. They look  ...\n   You know, they just say plants do not learn and do not remember. Then you do this study and stumble on something that actually shows you otherwise. It ’s the job of science to be humble enough to realize that we actually make mistakes in our thinking, but we can correct that. Science grows by correcting and modifying and adjusting what we once thought was the fact. I went and asked, can plants do Pavlovian learning? This is a higher kind of learning, which Pavlov did with his  ...\n There’s an emerging field of what’s called “vegetal consciousness.” Do you think plants have minds?\n What is the mind?  [Laughs] You see, language is very inadequate at the moment in describing this field. I could ask you the same question in referring to humans. Do you think humans have a mind? And I could answer again, what is the mind? Of course, I have written a paper with the title “The Mind of Plants” and there is a book coming called  The Mind of Plants. In this context, language is used to capture aspects of how plants can change their mind, and also whether they have  ...\n Let me ask the question a different way. Do you think plants have emotional lives? Can they feel pain or joy?\n It’s the same question. Where do feelings arise from, and what are feelings? These are yes or no questions, usually. But to me, they are yes  and no. It depends on what you mean by “feeling” and “joy.” It also depends on where you are expecting the plant to feel those things, if they do, and how you recognize them in a human way. I mean, plants might have more joy than we do. It’s just that we don’t know because we’re not plants.\n We have only talked about this from the scientific perspective, which is the Western view of the world. But I ’ve also had a close relationship with plants from a very different perspective, the indigenous world view. Why is that less valuable? And when you actually do explore those perspectives, they require your experience. You can ’t just understand them by thinking about them. My own personal experience tells me that plants definitely feel many things. I don ’t know  ...\n  You’ve studied with shamans in indigenous cultures and you’ve taken ayahuasca and other psychoactive plants. Why did you seek out those experiences?\n I didn ’t. They sought me. So I just followed. They just arrived in my life. You know, those are important doors that you need to open and you either walk through or you don ’t. I simply decided to walk through. I had this weird series of three dreams while I was in Australia doing my normal life. By the time the third dream came, it was very clear that the people that I was dreaming of were real people. They were waiting somewhere in this reality, in this world. And  ...\n  The first time I went, I found this place that was in my dream. It was just exactly the same as what I saw in my dream. It was the same man I saw in my dream, grinning in the same way as he was in my dream. So I just worked with him, trying to learn as much as I could about myself with his support.\n This was a local shaman whom you identify as Don M. And there was a particular plant substance, a hallucinogen, that you took.\n I did what they call a “dieta, ”which is basically a quiet, intense time in isolation that you do on your own in a little hut. You are just relating with the plant that the elder is deciding on. So for me, the plant that I worked with wasn ’t by itself a psychedelic in the normal way of thinking about it. But of course, all plants are psychedelic. Even your food is psychedelic because it changes your brain chemistry and your neurobiology all the time you eat. Sugars,  ...\n  When you ’re trying to describe this to people haven ’t had the experience, it probably doesn ’t make much sense because this kind of knowledge requires your participation. I don ’t hear someone talking to me as if from the outside, talking to me in words and sound. But even that is not correct because inside my head it does sound exactly like a conversation. Not only that, but I know it ’s not me. There is no way that I would know about some of the information that  ...\n Early this summer I met a friend for breakfast at a restaurant in Williamsburg, Brooklyn. While waiting for him to arrive I spent some time staring at a lot next door—a vacant lot, as the spaces are called, but also...  READ MORE\n Are you saying these plants had specific information to tell you about your life and your work?\n Yeah, I mean, some of the plants tell me exactly how wrong I was in thinking about my experiments and how I should be doing them to get them to work. And I ’m like, “Really? ”I ’m scribbling down without really understanding. Then I go in the lab and try what they say. And even then, there is a part of me that doesn ’t really believe it. For one experiment, the one on the Pavlovian pea, I was trying to address that question the year before with a different plant.  ...\n Do you think you are really encountering the consciousness of that plant? Maybe your imagination has opened up to see the world in new ways, but it’s all just a projection of your own mind. How do you know you are actually encountering another intelligence?\n If you had this experience of connecting with plants the way I have described —and there are plenty of people who have —the experience is so clear that you know that it ’s not you; it ’s someone else talking. If you haven ’t had that experience, then I can totally see it ’s like, “No way, it must be your mind that makes it up. ”But all I can say is that I have had exchanges with plants who have shared things about topics and asked me to do things that I have  ...\n  I’m not a medical scientist, but I’ve been given information by plants about their medical properties. And these are very specific bits of information. I wrote them in my diary. I would later check and I did find them in the medical literature: “This plant is for this and we know this.” I just didn’t know. So maybe I’m tapping into the collective consciousness.\n What do you do with these kinds of personal experiences? You are a scientist who’s been trained to observe and study and measure the physical world. But this is an entirely different kind of reality. Can you reconcile these two different realities?\n I think there are some presuppositions that a scientist should just explore the consensus reality that most of us experience in more or less the same way. But I don ’t really have a conflict because I find this is just part of experimenting and exploring. If anything, I found that it has enriched and expanded the science I do. This is a work in progress, obviously, but I think I ’m getting better at it. And in the writing of my book, which for a scientist  ...\n  Steve Paulson is the executive producer of Wisconsin Public Radio’s nationally syndicated show “To the Best of Our Knowledge.” He’s the author of Atoms and Eden: Conversations on Religion and Science.  You can subscribe to TTBOOK’s podcast  here.", "posttime": "2020-05-02 18:00:11", "tags": "植物,plant,plants", "title": "由植物之声引导", "title_en": "Guided by Plant Voices", "transed": 0, "url": "http://nautil.us/issue/84/outbreak/guided-by-plant-voices", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["植物", "plant", "plants"]}, {"category": "", "categoryclass": "", "imagename": "fcf56207f07bd9e5a49c5f8995bf5b83.jpg", "infoid": 1000221, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国专利商标局(USPTO)本周早些时候宣布，该机构裁定，人工智能系统不能被计入专利发明者。这一决定是对两项专利的回应-一项是食品容器的专利，另一项是闪光灯的专利-这两项专利是由一种名为DABUS的人工智能系统创造的。\nUSPTO的论点之一是，美国专利法一再提到发明家使用类似于人类的术语，如“谁”，以及“他自己”和“她自己”等代词。这些申请背后的组织曾争辩说，法律将发明家称为“个人”的说法可以适用于机器，但美国专利商标局表示，这种解释过于宽泛。“根据现行法律，只有自然人才能在专利申请中被命名为发明人，”该机构总结道。\n根据现行法律，只有自然人才能在专利申请中被命名为发明人。\n这些专利是去年由人工发明家项目提交的。除了提交给USPTO的专利外，该团队还向英国知识产权局(IPO)和欧洲专利局(EPO)提交了文件。IPO和EPO已经裁定，由人工智能研究人员斯蒂芬·泰勒(Stephen Thaler)创建的DABUS不能根据类似的法律解释被列为发明家。USPTO去年11月就这一话题征求公众意见。\nMIT Technology Review指出，人工发明家项目并不是说人工智能应该拥有专利，只是认为它应该被列为发明家。它认为，当数百甚至数千名员工在计算机本身继续解决问题之前向IBM的沃森超级计算机等系统贡献了代码时，这可能是必要的。如果没有人足够密切地参与到一项发明中来声称它的功劳，那么该组织担心它可能不可能获得专利……。\n该项目还认为，允许人工智能被列为发明家将激励创新，因为这些机器所增加的价值将得到更清楚的认识。人工发明家项目的瑞安·阿博特(Ryan Abbott)去年告诉英国“金融时报”：“如果你特别重视一台机器在创造过程中的价值，这台机器将不可避免地变得更有价值。”\n然而，除非法律在未来有所改变，否则人工智能很可能会继续被视为发明工具，而不是发明者。", "note_en": "The US Patent and Trademark Office (USPTO) has ruled that artificial intelligence systems cannot be credited as an inventor in a patent, the  agency announced earlier this week. The decision came in response to two patents — one for a food container and the other for a flashing light — that were created by an AI system called DABUS.\n Among  the USPTO’s arguments is the fact that US patent law repeatedly refers to inventors using humanlike terms such as “whoever” and pronouns like “himself” and “herself.” The group behind the applications had argued that the law’s references to an inventor as an “individual” could be applied to a machine, but the USPTO said this interpretation was too broad. “Under current law, only natural persons may be named as an inventor in a patent application,” the agency concluded.\n “Under current law, only natural persons may be named as an inventor in a patent application.”\n The patents were submitted last year by the  Artificial Inventor Project. Along with the patents submitted to the USPTO, the team also submitted documents to the UK’s Intellectual Property Office (IPO) and the European Patent Office (EPO). The  IPO and  EPO have already ruled that DABUS, which was created by AI researcher Stephen Thaler, cannot be listed as an inventor based on similar legal interpretations. The  USPTO asked the public for opinions on the topic last November.\n The Artificial Inventor Project is not arguing that an AI should own a patent, just that it should be listed as an inventor,   MIT Technology Review notes. It argues that this might be necessary when hundreds or even thousands of employees have contributed code to a system, like IBM ’s Watson supercomputer, before the computer itself then goes on to solve a problem. If no human was involved closely enough with an invention to claim credit for it, then the group fears it may be impossible to patent  ...\n The project also argues that allowing AI to be listed as an inventor would incentive innovation since the value these machines are adding would be more clearly recognized. “If you make a point of recognizing how valuable a machine has been in the creative process, that machine will inevitably become more valuable,” the Artificial Inventor Project’s Ryan Abbott  told the  Financial Times last year.\n Unless the law changes in the future, however, artificial intelligence is likely to continue to be seen as an inventing tool, rather than an inventor.", "posttime": "2020-05-02 18:00:09", "tags": "人工智能,裁定,office,专利,inventor", "title": "美国专利局裁定人工智能不能是合法发明者", "title_en": "US patent office rules that artificial intelligence cannot be a legal inventor", "transed": 0, "url": "https://www.theverge.com/2020/4/29/21241251/artificial-intelligence-inventor-united-states-patent-trademark-office-intellectual-property", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["人工智能", "裁定", "office", "专利", "inventor"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000220, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Git分支是一个强大的工具，可以将正在进行的工作作为团队的一部分进行组织，并确保软件交付保持有效。如果你现在使用Git，你很有可能使用著名的Git-Flow或最新的GitHub Flow。这两个工作流在很大程度上依赖于有效地使用分支-而命名新分支是许多开发人员努力解决的问题。\n推荐的约定和格式如此之多，但有时遵循这些约定本身就很痛苦。在这里，我们概述了一个简单的git分支命名约定，该约定易于遵循，并处理最常见的用例。\n大多数约定建议在分支机构名称前面加上前缀，如Hotfix-、Feature-、Chore-或任务分类的其他变体。实际上，如果您使用的是问题跟踪器，那么您无论如何都是在问题跟踪器中标记任务的类别--此外还有更多的附加上下文。使用这些分类前缀，这至少看起来是多余的，在最坏的情况下，在命名分支时需要额外的决策。以问题跟踪器ID开头很方便，.。\n在大多数情况下，在问题跟踪器中创建的问题用于跟踪团队的进度。将相关工作分支与每个任务相关联变得很容易-特别是当每个开发人员同时处理许多问题时。\n在问题跟踪器中搜索和过滤要容易得多。一旦您知道了问题编号，使用自动完成在本地GIT树中查找分支就变得很容易了。\n➜超级机密-项目GIT：(主)GIT签出72x722-添加-计费-模块-应用代码审阅的建议720-子模块-RC722-添加-计费-模块723-修复-突出显示728-修复-主页-css。\n虽然在大多数情况下，使用问题跟踪器ID本身就足以识别项目中的唯一分支，但可能需要更多细微差别。例如，可能有多个分支机构需要处理一个问题，可能由不同的人负责。\n在问题ID之后使用简短的、可操作的任务描述符。这使得分支机构名称可识别、清晰且易于搜索，以防您手头没有问题ID。确保描述符简洁，但描述性足以让您对分支机构中发生的事情有一个了解。\n这有点固执己见，但是在分支名称中使用连字符是很好的分隔符。你也可以用下划线_。不过，关键是要始终如一。\n仅此而已--只需牢记以下三条规则。没有复杂的命名方案或要遵循的规则，团队中的每个人都很容易保持一致。给事物命名有时可能很困难，拥有简单的启发式方法会很有帮助。在一个几乎每个人都在使用某种问题跟踪的世界里，这种方法使git分支命名变得尽可能简单。\nDeepSource帮助您在代码检查期间自动查找并修复代码中的问题，例如错误风险、反模式、性能问题和安全缺陷。使用GitHub或GitLab帐户设置需要几分钟，并且支持Python、Go和Ruby。JavaScript即将问世。\n注册DeepSource", "note_en": "Git branches are a powerful tool to organize ongoing work as part of a team and ensure that software delivery stays effective. If you use git today, there are high chances that you&#39;re either using the famed git-flow or the more recent GitHub flow. Both these workflows depend extensively on using branches effectively — and naming a new branch is something many developers struggle with.\n There are so many conventions and formats that are recommended, but at times following these conventions becomes painful in itself. Herein we outline a simple git branch naming convention that’s easy to follow, and takes care of most common use-cases.\n   Most conventions recommend leading the branch name with prefixes like  hotfix-,  feature-,  chore-, or some other variant of the categorization of tasks. Practically, if you are using an issue tracker, you ’re tagging the category of the task in the issue tracker anyway —in addition to much more additional context. Using these categorical prefixes, this, seems redundant at least and requires additional decision-making when naming branches at worst. Leading with the issue tracker ID is convenient,  ...\n The issues created in the issue tracker, in most cases, are used for tracking the team’s progress. It becomes easy to correlate the relevant working branch with each task — especially when each developer is working on many issues at the same time.\n Searching and filtering is much easier in the issue tracker. Once you know your issue number, it becomes easy to find the branch using auto complete in the local git tree.\n ➜ super-secret-project git: (master ) git checkout 72&lt;TAB&gt;722-add-billing-module -- Apply suggestions from code review720-submodules-rc 722-add-billing-module 723-fix-highlighting 728-fix-homepage-css\n  While using the issue tracker ID itself is sufficient to identify a unique branch in a project in most cases, there could be chances that some more nuance is needed. For example, there could be multiple branches needed to work on one issue, possibly by different people.\n Use a short, actionable descriptor of the task after the issue ID. This makes the branch name recognizable, distinct, and easy to search for in case you don’t have the issue ID handy. Make sure that the descriptor is concise, but descriptive enough to give you an idea of what’s going on in the branch.\n  This is a little opinionated, but hyphens make for good separators in branch names. You could use an underscore,  _, too. The key is to be consistent, though.\n  And that’s it — just these three rules to keep in mind. No complex naming schemes or rules to follow make it easy for everyone in the team to stay on the same page. Naming things can be difficult at times, and it’s helpful to have simple heuristics. In a world where almost everyone is using some sort of issue tracking anyway, this approach makes git branch naming as easy as possible.\n DeepSource helps you automatically find and fix issues in your code during code reviews, such as bug risks, anti-patterns, performance issues, and security flaws. It takes a couple of minutes to set up with your GitHub or GitLab account, and supports Python, Go, and Ruby. JavaScript is coming soon.\n Sign up for DeepSource", "posttime": "2020-05-02 18:00:00", "tags": "分支,branch,问题", "title": "Git分支命名约定", "title_en": "Git Branch Naming Conventions", "transed": 0, "url": "https://deepsource.io/blog/git-branch-naming-conventions/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["分支", "branch", "问题"]}, {"category": "", "categoryclass": "", "imagename": "828e327553af44bdd22a4a51e8ef1354.png", "infoid": 1000219, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在速度和规模上进行创新的举动强调了软件质量，并暴露了测试的局限性。\n不要误会我的意思-所有形式的测试都离不开软件交付供应链。测试和静态分析对于软件开发管道至关重要，对于传统应用程序和云本地应用程序都是如此。\n我们正处于史无前例的时代，处于一个颠覆的时代，历史悠久的金融机构正面临着来自成立7年的初创公司的竞争。公司面临着快速行动以保持生存的压力，即使是那些已经存在超过100年的公司，他们也需要以两倍的速度来捍卫自己的地位并保持竞争力。\n十多年前，当引入测试驱动开发(Test-Driven Development，TDD)时，它承诺提高生产力和质量。即使对于那些不虔诚地追随它，但更多地将其视为北极星的团队来说也是如此。从那时起，发布周期缩短了，CI/CD不再是一个时髦的词，开发管道自动化产品的新公司-我在看你的GitLab-已经足够成熟，可以IPO了。\n重申这一点，测试可能比以往任何时候都更相关，但是当快速移动是桌上的赌注时，仅仅依靠传统的测试来防止错误已经不够了。即使测试是不可替代的，关键错误仍然会影响生产，而客户正在等待承诺的无缝体验(就在他们的应用程序中断之前)。\n底线是什么？测试已经不够了。在这篇文章中，我们将概述我们是如何做到这一点的，以及专家们对此有何看法。\n在数字商业的背景下，原地踏步就相当于输了。刘易斯·卡罗尔(Lewis Carroll)在“爱丽丝梦游仙境”(Alice In Wonderland)中说得最好，这成为了所谓的“红皇后假说”的基础：\n除了是一本伟大的书中的一则精彩轶事外，红皇后假说源于一种进化论概念，即生物体必须不断适应才能生存，同时在不断变化的环境中与其他生物体竞争。\n同样的想法也可以应用于业务设置，这说明了为什么每家公司都在争先恐后地自动化其CI/CD工作流。这里的二阶效应是它如何应用于测试。当您越来越快地发布代码、提高开发速度时，如何防止错误被提升呢？如果它们真的发生了，您如何快速修复它们？\n时速70英里的公路车辆的安全措施与时速超过200英里的F1赛车的安全措施非常不同，因此，当您自动执行CI/CD工作流时，测试也需要发展。\n根据Google Cloud的DevOps Research&amp；Analysis(DORA)的DevOps状态报告，更改故障率(即生产中导致服务降级并需要补救的更改的百分比)可能高达所有新代码发布的60%。对于表现优秀的人员，故障率可以保持在15%以下，但由于这只解决了已知的错误，并且是基于工程师(而不是客户)的自我报告，因此实际的故障率可能会更高。\n表现不佳的人和表现优秀的人之间的差异相当大，这让精英们在创新和快速行动的能力上获得了“不公平的优势”。这解释了我们从Facebook、苹果、Netflix、微软和谷歌等大型科技公司看到的结果，尽管它们也不是没有错误。\n这背后的一个关键驱动因素是能够以更高的频率发布较小的更改-但这不是唯一的区别。虽然所有的公司都以这样或那样的形式进行测试，但它们如何进行测试，以及它们寻找的是什么，差异很大。\n在最近的一次现场小组讨论中，我们与DevOps Paradox的联合主持人Darin Pope和Viktor Fracic讨论了这个问题，Darin Pope是一位以将复杂变得简单而闻名的DevOps顾问，Viktor Fracic是首席软件交付策略师、开发人员倡导者和出版作家。以及Over Ops解决方案工程副总裁Eric Mizell。\n这里提供了该对话的点播录音，其中包括如何在速度和质量与持续可靠性之间取得平衡的要点。\n下面是从那次谈话中得出的三个关键结论，它们说明了为什么传统测试是不够的：\nViktor Fracic：“代码覆盖毫无意义。我不明白为什么人们仍然痴迷于代码覆盖。这真的不是关于你有多少个测试，而是那些测试的质量。我见过一些代码覆盖率接近100%的公司，但它们的测试毫无意义，什么也证明不了。\n“这些类型的指标对我来说非常具有误导性。拥有95%的测试代码覆盖率是很容易的，但拥有真正重要的测试，让它们驱动您的设计，并检测难以检测的东西，这才是困难之处。如果测试本身做得不是很好，代码覆盖就没有多大作用。“。\n达林·波普：“对于大多数人来说，这是日常生活，我宁愿在生产过程中出现错误。", "note_en": "The move to innovate at speed and scale is stressing software quality and exposing the limitations of testing.\n  Don’t get me wrong – testing in all its forms is inseparable from the software delivery supply chain. Tests and static analysis are essential to software development pipelines, and this holds true for both traditional and cloud-native applications.\n  We are in the midst of  unprecedented times, and in an era of disruption where long-established financial institutions are facing competition from 7 year old startups. Companies are under pressure to move fast to remain viable, even those that have been around for over 100 years, and they need to move twice as fast to defend their position and remain competitive.\n Over a decade ago, when Test-Driven Development (TDD) was introduced, it promised to improve productivity and quality. Even for teams that don’t follow it religiously, but treat it more as a north star. Since then, release cycles shortened, CI/CD is no longer a buzzword, and new companies that develop pipeline automation products –  I’m looking at you GitLab – are mature enough to IPO.\n To reiterate this point, testing is perhaps more relevant than ever, but when moving fast is table stakes, relying on traditional tests alone for preventing errors is no longer enough. Even though tests are irreplaceable, critical errors still reach production, while customers are waiting on the seamless experience they were promised (right before their  application breaks).\n The bottom line?   Testing is no longer enough. And in this post, we’ll outline how we got here and what the experts have to say on that.\n  In the context of digital business, standing still is the equivalent of losing. Lewis Carroll said it best in “Alice in Wonderland,” which became the basis for what’s called the  “Red Queen Hypothesis:\n  Apart from being a nice anecdote from a great book, the Red Queen Hypothesis originates from an evolutionary concept, proposing that organisms must constantly adapt in order to survive, while pitted against other organisms in a constantly changing environment.\n The same idea can be applied to a business setting, demonstrating why every company is rushing to automate their CI/CD workflows. The second-order effect here is how it applies to testing. When you’re releasing code faster and faster, increasing your development velocity, how can you prevent errors from being promoted? And how can you fix them fast if they do occur?\n The safety measures for a road car going 70mph are very different from those of a F1 car going over 200mph, so as you automate your CI/CD workflows, testing needs to evolve as well.\n  According to Google Cloud’s DevOps Research &amp; Analysis (DORA)  State of DevOps report, change failure rates (i.e. the percentage of changes in production that result in degraded service and require remediation)   can go up to 60% of all new code releases.  For elite performers, the failure rate can be kept under 15%, but since this addresses only known errors and is based on self-reporting of engineers (not customers), the actual rates might even be higher.\n The difference between low performers and elite performers is quite high, giving the elite an “unfair advantage” in their ability to innovate and move fast. This explains the results we’ve seen from big tech companies like Facebook, Apple, Netflix, Microsoft and Google, although even they are not free from errors.\n A key driver behind this is the ability to release smaller changes at a higher frequency – but that’s not the only difference. While all companies test in one form or another, how they do it and what they look for varies greatly.\n During a recent live panel, we discussed this issue with the co-hosts of  DevOps Paradox,  Darin Pope, a DevOps Consultant that’s known for making the complex simple, and  Viktor Fracic, a Principal Software Delivery Strategist, Developer Advocate and a published author. Together with  Eric Mizell, OverOps VP of Solution Engineering.\n An on-demand recording of that conversation, including takeaways for balancing speed and quality with Continuous Reliability,  is available here.\n Below are three key takeaways from that conversation that illustrate why traditional testing is not sufficient:\n  Viktor Fracic: “Code coverage means nothing. I don’t understand why people are still obsessed with code coverage. It’s not really about how many tests you have, but the quality of those tests. I’ve seen companies that have close to 100% code coverage but have meaningless tests that don’t prove anything.\n “Those types of metrics to me are very misleading. It’s easy to have 95% test code coverage, but having tests that really matter, having them drive your design, and detect things that are hard to detect, that’s what’s hard. Code coverage doesn’t serve much of a purpose if the tests themselves are not really well done.”\n  Darin Pope: “This is day-to-day life for most people, I would rather have an error happen in production and go-to-market fast, than build something for 5 years to get it out the door when all market opportunity is lost. I’d rather see people move fast and be comfortable with failing.”\n Viktor Fracic:“If you do develop for five years and then put it in production, it ’s still going to fail. Until you put it in production you don ’t really know how it will behave with real users. We ’re just trying to get as close to being stable before we put it in production, but once it ’s there then we can figure out what ’s going on and react quickly to solve problems. But the whole idea that you will be testing, testing, testing and then you say, yes now it ’s going to work  ...\n Eric Mizell:“I don ’t want to drop in production and fail miserably. But I do want to be able to have the people and processes in place to fix it, because you want to adopt a move fast/fix fast mindset. I want to get it out there fast, because I need to move quicker in today ’s world. In a cloud world a new company can spend a day and they could compete with me with something I ’ve been working on for five years. I need to figure out how to move fast and continue to move forward  ...\n  Viktor Fracic: “I would say that this was true a long time ago. It’s just that now we are admitting it. And everybody knows that we never deploy stable code in production that never fails or doesn’t have any problems. Every single company in the world 20 years ago was receiving notifications from their users, this or that doesn’t work, and then you need to fix it. We knew all of this, now we’re just admitting the reality.”\n Eric Mizell: “I’ve actually heard a company say that they try to do risk assessment on how risky it is to lose customers and revenue versus getting the software out there. They need new features. It’s a balance. I don’t think anyone has the perfect balance there but you see it happening a ton and it goes back to the notion of I want to be able to move fast/fix fast. How do I come back from a failure is the true challenge.”\n  As developers, we are great at writing code, but inherently limited in the ability to foresee where it will break down later. The task of detecting software issues, either early in testing or later in prod, and gathering information on them should be automated if we ever want to achieve the move fast/fix fast vision.\n That’s the mission we’re tackling here at  OverOps, so if you’re running mission-critical Java or .NET applications, send me a note at alex [at] overops.com, and I’d be happy to chat!\n The on-demand recording of this panel, including takeaways for balancing speed and quality with Continuous Reliability, is available  here.", "posttime": "2020-05-02 17:59:56", "tags": "软件,今天,longer,测试,testing", "title": "为什么测试对今天的软件交付管道不再足够", "title_en": "Why Testing Is No Longer Sufficient for Today’s Software Delivery Pipelines", "transed": 0, "url": "https://blog.overops.com/why-testing-is-no-longer-sufficient-for-todays-software-delivery-pipelines/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["软件", "今天", "longer", "测试", "testing"]}, {"category": "", "categoryclass": "", "imagename": "33f0b4c5652196e1d12aadca9fead569.jpg", "infoid": 1000218, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "摘要一旦程序员了解了一种语言，他们就可以利用已经学到的概念和知识，轻松地学习另一种编程语言。但这是不是一直都是这样的呢？为了了解程序员学习其他编程语言是否有困难，我们对18种不同编程语言的堆栈溢出问题进行了实证研究。我们假设以前的知识可能会潜在地干扰学习一门新的编程语言。从我们的检查来看..。\n俄勒冈州立大学相变软件课程研究生，俄勒冈州立大学。\n密歇根大学、加州大学圣巴巴拉分校、美国密歇根大学、密歇根大学", "note_en": "Abstract Once a programmer knows one language, they can leverage concepts and knowledge already learned, and easily pick up another programming language. But is that always the case? To understand if programmers have difficulty learning additional programming languages, we conducted an empirical study of Stack Overflow questions across 18 different programming languages. We hypothesized that previous knowledge could potentially interfere with learning a new programming language. From our inspection  ...\n   Session Program Graduate Student,   Oregon State University,   Oregon State University,   Oregon State University,   Oregon State University,   Phase Change Software,   Oregon State University\n  University of Michigan,   University of Michigan,   University of Michigan,   University of California at Santa Barbara,   University of Michigan, USA,   University of Michigan", "posttime": "2020-05-02 17:59:52", "tags": "开发,prog,developers,大学,university", "title": "我们又来了：为什么开发人员很难学习另一种Prog语言？", "title_en": "Here We Go Again: Why Is It Difficult for Developers to Learn Another Prog Lang?", "transed": 0, "url": "https://conf.researchr.org/details/icse-2020/icse-2020-papers/61/Here-We-Go-Again-Why-Is-It-Difficult-for-Developers-to-Learn-Another-Programming-Lan", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["开发", "prog", "大学"]}]