[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1033034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器很快就会重定向到您所请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2020-11-04 04:40:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,saltstack,reveals,重定向", "title": "SaltStack揭示新的关键漏洞，立即修补", "title_en": "SaltStack reveals new critical vulnerabilities, patch now", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/saltstack-reveals-new-critical-vulnerabilities-patch-now/", "via": "", "real_tags": ["漏洞", "saltstack", "reveals", "重定向"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，我和一些朋友一直在做一个在互联网上一起唱歌的项目(以前，以前，最初)。它还没有完成，但是这个周末一位朋友在它上面举办了一个歌唱会，而且进行得很顺利。如果您对玩它感兴趣，欢迎您试用。这里只有一个共享的实例，如果您想主持某个活动，您可以通过向gsc268k1lu78lbvfbhphdr0cs4@group.calendar.google.com.发送日历邀请来预订时间。如果您遇到任何问题，请提交错误信息。不幸的是，它目前只能在基于闪烁的浏览器中运行：Chrome、New Edge、Brave、Opera等等。它依赖于两个新的浏览器功能，其他浏览器引擎正在努力添加，但还没有添加。\n如果当前有活动安排，它会告诉您。现在一切都是荣誉制度，请不要把其他任何人的活动搞得一团糟。\n它会问一些澄清的问题，并鼓励你使用有线耳机。无线具有不一致的延迟，系统依赖于保持绝对恒定的延迟，而当您不这样做时，使用耳机的反馈(尽管不是令人难堪的那种)可能是个问题。\n它会问你的名字，这也是荣誉制度。目前还没有帐户：\n它还要求您选择您的输入设备。通常，从默认设置开始是一个很好的方法，然后只有在出现问题时才会回到这里。\n为了使每个人的声音与其他人的声音完美一致，它需要知道从(A)要求浏览器将音频发送到您的扬声器或耳机到(B)从您的麦克风接收回音频有多长时间。从(A)到(B)的时间取决于您的音频硬件、您的计算机，甚至在您刷新页面时也不总是一致的。更糟糕的是，我们不能只问浏览器这个延迟有多长，我们所能做的就是测量它。我们会从扬声器/耳机发出一系列嘟嘟声，并计时它们需要多长时间才能回到麦克风中。\n还有一个问题是，并不是每个人都有这样的设置，他们的计算机会检测到他们以相同的音量唱歌。有些人的脸正对着麦克风，另一些人在几英尺远的地方就赢了。在视频通话中，它通常会自动设置你的音量，但如果我们使用浏览器内置的算法，它会做一些事情，比如当你拿着一个长音音符时，它会慢慢地调低你的音量。取而代之的是，我们要求每个人都唱一点，这样我们就可以为他们设定一个水平。\n一旦你完全校准好了，你就可以看到系统上还有谁，然后你可以选择领唱一首歌还是跟着唱。还有一个基本的聊天系统，这样你就可以与其他人进行协调了。\nGlenn、Taymon和我已经为此付出了很大努力，非常欢迎您的反馈！它也是开源的，如果你想看看代码的话。", "note_en": "For the past several months, some friends and I have been working on aproject for singing together over the internet ( previously,  previously,  originally). It&#39;s still not done, butthis weekend a friend hosted a singing party on it and it wentwell. If you&#39;re interested in playing with it, you&#39;re welcome to  try it out. There&#39;s only oneshared instance, and if you want to host something you can book timeon it by sending a calendar invitation to gsc268k1lu78lbvfbhphdr0cs4@group.calendar.google.com. Ifyou run into any problems, please  filea bug. Unfortunately it currently only works in the Blink-based browsers:Chrome, new Edge, Brave, Opera, etc. It depends on two new browserfeatures that other browser engines are  workingon  addingbut haven&#39;t added yet.\n  If there is currently an event scheduled, it will tell you. Everythingis honor system right now; please don&#39;t mess up anyone else&#39;s events.\n  It will ask some clarifying questions, and encourage you to use wiredheadphones. Wireless has inconsistent latency, and the system isdependent on latency staying absolutely constant, while when you don&#39;tuse headphones feedback (though not the squealy kind) can be a problem.\n  It asks you for your name; this is honor system as well. No accounts yet:\n  It also asks you to choose your input device. Typically starting with thedefault is a good approach, and then only coming back here if there&#39;sa problem.\n  In order to perfectly line up everybody&#39;s voice with everyone else, itneeds to know how much time there is from (a) when it asks the browserto send audio out to your speakers or headphones until (b) when itreceives audio back in from your microphone. The time from (a) to (b)depends on your audio hardware, your computer, and isn&#39;t even alwaysconsistent if you refresh the page. Worse, we can&#39;t just ask thebrowser how long this latency is, all we can do is measure it. Wesend a series of beeps out the speaker/headphones and time how long ittakes until they come back in the microphone.\n  There&#39;s also the problem that not everyone has a setup where theircomputer will detect them as singing at the same volume. Some peoplehave a microphone right up by their face, other people have wonseveral feet away. In a video call it typically sets your volumeautomatically, but if we use that algorithm, built into the browser,it will do things like slowly turn your volume down as you hold a longloud note. Instead, we ask everyone to sing a little bit so we canset a level for them.\n  Once you&#39;re fully calibrated, you can see who else is on the systemand choose to lead a song or sing along. There&#39;s also a rudimentarychat system so you can coordinate with others.\n  Glenn, Taymon, and I have worked hard on this, and  feedbackis most welcome! It&#39;s also open source, if you&#39;d like to  look at thecode.", "posttime": "2020-11-04 04:20:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "水桶,brigade,浏览器", "title": "水桶旅歌声", "title_en": "Bucket Brigade Singing", "transed": 1, "url": "https://www.jefftk.com/p/bucket-brigade-singing", "via": "", "real_tags": ["水桶", "brigade", "浏览器"]}, {"category": "", "categoryclass": "", "imagename": "1a0eb7219a1c3761dd225b1fb8ef6012.jpg", "infoid": 1033031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "可再生能源的价格已经暴跌到这样的地步，对于地球上的大部分地区来说，风能和太阳能现在比化石燃料发电更便宜。但这些电源的多变性可能会使在电网中管理它们具有挑战性-这是一个挑战，可能会使成本超出其表观价格。然而，确切的成本已经引起了激烈的争论，估计从最低限度到最高34；建造一座完整的天然气工厂，以匹配每一兆瓦的风力发电。\n伦敦帝国理工学院的菲利普·赫普顿·斯托尔和罗伯特·格罗斯决定试着计算出实际花费是多少。在费力地进行了数百项研究后，他们得出的答案介于复杂和复杂之间，视情况而定。但关键结论是，即使是在估计的高端，可再生能源的额外成本仍使它们与碳排放来源具有相当的竞争力。\nHeptonstall和Gross首先将增加成本的可能性分为三类。第一个是弥补可再生能源有点不稳定的性质，如果它们的发电量与预测的发电量不符，可能会产生费用。第二个是可再生能源满足可预测的日需求峰值的能力-在较热的气候中，傍晚时分，在较冷的气候中过夜。最后，还有将可再生能源整合到现有电网中的成本，因为最好的发电地点可能无法与现有的输电能力相匹配。\n在本研究中，最后一个类别受到的关注最少。铺设新的可再生能源项目是有成本的，但它们的差异令人难以置信。欧洲的一些海上风电设施距离主要城市中心不是很远；德克萨斯州的一些陆上风电距离该州的主要城市很远，需要大量建设新的输电线路。因此，很难为将可再生能源整合到电网中的成本得出一个单一的数字。\n而且，真的，我们可能不需要。然而，赫普顿斯托尔和格罗斯指出，可再生能源并不是唯一产生修建新电线成本的电力来源。我们倾向于在远离主要人口中心的地方建造核电站，而水电则走到地理位置允许的任何地方。我们不倾向于将输电线路的成本与这些电源相抵销，所以我们不清楚为什么我们要对可再生能源这样做。\n然而，另外两类成本是非常真实的，并得到了两位作者的详细审查。\n平衡成本听起来似乎很简单，被定义为包括为应对(可再生)产出的意外变化而采取的任何调整行动。与预测相比，这可能是一个出人意料的多云或静止期(分别针对太阳能和风能)。在这一点上，如果需求运行在预测的水平上，就必须采取一些措施来弥补差额。这件事可以简单到耗尽一块电池，也可以复杂到让一座化石燃料发电厂上线。\n再说一次，这个问题不是可再生能源的具体成本。工厂或输电线路会有一定规律的停机，因此即使是没有可再生电力的电网也不得不维持储备。这意味着低水平的可再生能源-不到电网电力的10%-不会招致太多成本，因为电网已经准备好应对水平的波动。当电网达到30%可变可再生能源的区域时，拥有运营备用的成本往往在每兆瓦时5.00美分左右，而且从那里开始略有上升，尽管关于非常高水平的可再生能源的数据很少。\n然而，这是可以降低的。储水量较高的电网可以平息这些意想不到的波动，水电可以在可再生能源生产率高的时期保持水分，并在水位下降时提高发电量，从而起到蓄水的作用。需求响应管理，即大客户同意在需要时略微减少用电量，有助于将需求与可用的电力供应相匹配。\n最近对德国和英国平衡行动的分析表明，运营创新可以避免额外运营储备的需要，或者减少运营储备需求，即使(可再生能源)的份额大幅上升。事实上，多项研究发现，随着可再生能源的增加，总体成本会下降。\n匹配高峰需求也要视当地情况而定。随着太阳能价格的大幅下降，许多地区的高峰供应往往在中午左右，太阳能可能足以覆盖工作时间内与空调需求相关的任何高峰。在这种情况下，较低的可再生能源价格将意味着满足高峰需求实际上更便宜-这是许多研究在地中海国家发现的。相比之下，北欧的需求高峰往往出现在寒冷的冬夜，那里没有太阳能。\n虽然这在结果中产生了很大的价差，但数字相当一致：拥有满足高峰需求所需的容量，可再生能源的成本增加了约10欧元，随着电网中可再生能源比例的上升，价格略有下降。\n将这两项相加，每兆瓦时可变可再生能源的额外成本约为15-20.00美分。这与一些研究很好地吻合了，这些研究试图量化变异性的总成本，而不是分开每个单独的问题。成本确实会上升，一些迹象表明，一旦可再生能源的比例超过75%，成本就会超过30.00美分/兆瓦-小时。\n在最简单的层面上，这意味着风能和太阳能只需比化石燃料领先那么多就能脱颖而出。赫普顿斯托和格罗斯引用了英国的例子，那里的电力平均批发价约为每兆瓦时40 GB。这大致就是近海风能--最昂贵的可变可再生能源--最近的价格。这意味着陆上风能和太阳能现在可能具有竞争力，对吗？\n再说一次，事情没有那么简单。英国已经有大约四分之一的电力来自可变的可再生能源，这意味着它正在进入更高的成本范围。但不可再生能源也伴随着污染和碳排放等成本；如果将这些因素考虑在内，海上风能可能已经具有竞争力，其他选择也会走在前面。英国主要的零排放能源--核能--正在建设一座新的发电厂，仅仅是因为它的发电价格保证在90 GB/MW-hr以上。\n这只是英国的情况；几乎每个国家都有自己的一组独特因素，这些因素使分析变得复杂。\n但是可以做一些概括。首先，风能和太阳能的变化性确实使它们加入电网的成本更高，尽管如果它们在当地电网中的发电量还没有超过10%，成本就相当低。除此之外，与我们为化石燃料发电支付的价格相比，它们才刚刚开始具有竞争力。但是，我们为化石燃料支付的价格并不包括它们产生的排放量；考虑到这一点，风能和太阳能很可能会重新成为领头羊。而且现在任何东西都比核能便宜。\n另一个关键的概括是这些成本可以降低。拥有更灵活的电网，拥有大量的存储、需求响应管理和水电接入，即使可再生能源的可用性不同，也可以使供应与需求保持匹配变得容易得多。", "note_en": "Renewable energy prices have plunged to the point where, for much of the planet, wind and solar power is now cheaper than fossil fuel-generated electricity. But the variability of these power sources can make managing them on an electric grid challenging—a challenge that can exact costs beyond their apparent price. The exact cost, however, has been heavily debated, with estimates ranging from &#34;minimal&#34; up to &#34;build an entire natural gas plant to match every megawatt of wind power.&#34;\n Philip Heptonstall and Robert Gross of Imperial College London decided to try to figure out what the costs actually were. After wading through hundreds of studies, the answer they came up with is somewhere between &#34;It&#39;s complicated&#34; and &#34;It depends.&#34; But the key conclusion is that, even at the high end of the estimates, the added costs of renewables still leave them fairly competitive with carbon-emitting sources.\n  Heptonstall and Gross start by breaking the potential for added costs down into three categories. The first is covering for the somewhat erratic nature of renewable power, which may incur expenses if their output doesn&#39;t match their forecasted output. The second is the ability of renewables to meet the predictable daily peaks in demand—late afternoon in hotter climates, overnight in colder ones. Finally, there&#39;s the costs of integrating renewables into an existing grid, as the best sites for generation may not match up with the existing transmission capacity.\n The last category gets the least attention in this research. There are costs to wiring up new renewable projects, but they vary incredibly. Some of the offshore wind installations in Europe are not very distant from major urban centers; some of the onshore wind in Texas is nowhere near the state&#39;s major cities and has required significant construction of new transmission. So it&#39;s hard to generate a single figure for the cost of integrating renewables into a grid.\n And, really, we may not need one. Heptonstall and Gross point out, however, that renewables are hardly the only power sources that have incurred the cost of building new electric lines. We&#39;ve tended to build nuclear plants well outside of major population centers, while hydro power goes wherever the geography has allowed. We don&#39;t tend to hold the costs of the transmission lines against these power sources, so it&#39;s not clear why we would want to do so for renewables.\n The other two categories of costs, however, are very much real and get a detailed examination by the two authors.\n  Balancing costs sounds deceptively simple, being defined to &#34;include any action taken to adjust for unpredicted changes in [renewable] output.&#34; This could be an unexpectedly cloudy or still period (for solar and wind, respectively) compared to the forecast. At that point, if demand is running at the levels forecast, something has to be done to make up the difference. That &#34;something&#34; could be as simple as drawing down a battery or as complex as bringing a fossil fuel plant online.\n Again, this issue isn&#39;t a renewable-specific cost. Plants or transmission lines go down with some regularity, so even grids with no renewable power have had to maintain reserves. And that means that low levels of renewable power—less than 10 percent of the power on grid—don&#39;t incur much in the way of costs, since the grid is already prepared to handle levels of fluctuation. By the time the grid reaches the area of 30 percent variable renewable power, having an operating reserve tends to cost in the area of about ¢5.00 per megawatt-hour, and it rises slightly from there, although data on very high levels of renewables is sparse.\n This can be brought down, however. Grids with higher levels of storage can smooth out these unexpected fluctuations, and hydropower can act as storage by holding water during periods of high renewable productivity and boosting generation when they drop. Demand-response management, in which large customers agree to slightly cut their use when needed, can help match demand to the available supply of power.\n &#34;Recent analysis of balancing actions in Germany and Great Britain,&#34; Heptonstall and Gross write, &#34;show that operational innovation can avoid the need for additional operating reserves or reduce operating reserve needs, even as the share of [renewables] rises substantially.&#34; In fact, a number of studies have found overall costs drop as more renewables get added.\n  Matching peak demand also depends on local conditions. With solar prices dropping so dramatically, peak supply in many locations tends to come around mid-day, and solar may be sufficient to cover any peaks associated with air conditioning needs during work hours. In this case, the lower price of renewable power will mean that meeting peak demand is actually cheaper—something a number of studies have found in the Mediterranean countries. In contrast, peak demand in Northern Europe tends to come on cold winter nights, where solar power is non-existent.\n While this produces a lot of spread in the results, the numbers are fairly consistent: having the capacity needed to meet peak demand adds about 10 euro to the cost of renewable power, with the price dropping slightly as the fraction of renewable power on the grid goes up.\n Adding the two, and you get something in the area of ¢15.00-20.00 of added costs for each megawatt-hour of variable renewable power. And that matches up nicely with a number of studies that have tried to quantify the total costs of variability without breaking out each individual issue. Costs do go up, with some indications that they get above ¢30.00/MW-hr once the fraction of renewable power gets above 75 percent.\n  On the simplest level, this means that wind and solar just have to beat fossil fuels by that much in order to come out ahead. Heptonstall and Gross cite the example of the UK, where the average wholesale price of power is about £40 per megawatt-hour. That&#39;s roughly the price that offshore wind—the most expensive form of variable renewable—has been getting lately. Which means that onshore wind and solar might now be competitive, right?\n Again, it&#39;s not that simple. The UK is already getting about a quarter of its electricity from variable renewables, meaning it&#39;s heading into the higher range of costs. But non-renewable power also comes with costs like pollution and carbon emissions; if those are factored in, offshore wind is probably already competitive, and the other options come out ahead. And the UK&#39;s major alternative for emissions-free power, nuclear energy, is seeing a new plant built only because it was guaranteed a price of over £90/MW-hr for the power it generates.\n And that&#39;s just the UK; nearly every country has its own set of unique factors that complicate the analysis.\n But it is possible to make some generalizations. The first is that the variability of wind and solar power do make them more expensive to add to the grid, although the expense is pretty minimal if they&#39;re not already generating more than 10 percent of the power on the local grid. Above that, and they&#39;re only just becoming competitive with the price we pay for fossil-fuel generated power. But the price we pay for fossil fuels doesn&#39;t include the emissions they generate; accounting for that would probably bring wind and solar back in front. And anything&#39;s cheaper than nuclear right now.\n The other key generalization is that these costs can be brought down. Having a more flexible grid, with lots of storage, demand-response management, and access to hydropower, can make it far easier to keep supply matching demand even as the availability of renewable power varies.", "posttime": "2020-11-04 04:05:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "价格,power,再生能源", "title": "随着可再生能源价格的下降，研究人员总结了他们增加的成本", "title_en": "As renewable power prices drop, researchers tally up their added costs", "transed": 1, "url": "https://arstechnica.com/science/2020/11/as-renewable-power-prices-drop-researchers-tally-up-their-added-costs/", "via": "", "real_tags": ["价格", "power", "再生能源"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "HYBRiX 2.1是一种独特的多旋翼，只需25千克MTOW即可提供长达4小时的运行飞行时间。它的独特功能使这架混合无人机成为一个非常多功能的平台，将帮助你比以往任何时候都更快地完成任务。\n不需要等待很长时间才能给电池充电，只需加油，你就可以再次飞行了。\n得益于其混合动力系统和独特的设计，HYBRiX.20在耐力方面的表现比任何电动多用途飞行器都高出10倍，从而实现了更长时间和更雄心勃勃的空中任务。\n即使在最大有效载荷的情况下，这种混合多旋翼RPA也可以获得超过2小时的飞行时间。甚至需要更多的时间？只要加油，不到10分钟就能回到高空。\nHYBRiX是为便于操作而开发的。可拆卸的手臂允许舒适的运输和部署。它可以由两个人快速设置和操作，并对无人机及其有效载荷进行独立控制。\n它的运输箱在前往作业区期间保护HYBRiX飞机，它可以放在一辆标准汽车的后备箱里。\n通过其先进的地面控制站完全控制您的HYBRiX。根据有效载荷的不同，它可以包括具有视频接收功能的第二发射机。\n这种专业的GCS允许您通过数字通信独立控制飞机及其有效载荷。它舒适轻便的设计非常适合执行长时间的任务。\n有了HYBRiX及其任务规划器，您将完全控制空中任务，设置具有航点和紧急功能的自动飞行计划，实时检索相关数据，并在任何需要的时间切换到手动驾驶模式。\nHYBRiX搭载了一个基于ArduPilot的开源飞行控制器，与最流行的传感器和无人机配件兼容。", "note_en": "HYBRiX 2.1 is a unique multirotor that provides up to 4 hours of operational flight time with only 25 kg MTOW. Its unique features make this hybrid drone a very versatile platform that will help you accomplish your missions faster than ever before.\n  No need to wait a long time to charge batteries, only refuel and you are ready to fly again.\n  Thanks to its hybrid power system and its unique design, HYBRiX.20 outperforms any electric multicopter by 10 times on endurance, enabling longer and more ambitious aerial missions.\n Even with maximum payload, this hybrid multirotor RPAS can get over 2 hours of flight time. Even more time required? Just re-fuel and get back aloft in less than 10 minutes.\n  HYBRiX has been developed for easy operation. The removable arms allow for comfortable shipment and deployment. It can be quickly set up and operated by two people, with independent controls for the drone and its payload.\n Its transport case protects HYBRiX aircraft during during the trips to the area of operation and it fits in the trunk of a standard car.\n  Take full control of your HYBRiX with its advanced Ground Control Station. Depending on the payload, it can include a second transmitter with video reception.\n This professional GCS allows you to control the aircraft and its payload independently, both with digital communications. Its comfortable and light design is perfect for carrying long missions.\n  With HYBRiX and its Mission Planner you will take full control of the aerial mission, setting an automatic flight plan with waypoints and emergency functions, retrieving relevant data on real time and shifting to manual pilot mode at any desired time.\n HYBRiX carries an open-source Flight Controller based on Ardupilot and compatible with the most popular sensors and UAV accessories.", "posttime": "2020-11-04 03:57:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "无人机,hybrid,飞行", "title": "一架20公斤重的混合无人机，能以每小时50公里的速度飞行4小时", "title_en": "A 20kg hybrid drone that can fly at 50kmh for 4 hours", "transed": 1, "url": "https://www.quaternium.com/uav/hybrix-drone/", "via": "", "real_tags": ["无人机", "hybrid", "飞行"]}, {"category": "", "categoryclass": "", "imagename": "0a1c07e0ff706ca3df4e9fd12ff5f3bd.jpg", "infoid": 1033029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Dealmaster的头条新闻是我们上周强调的早期黑色星期五销售的一些遗留下来的好交易。尽管我们距离黑色星期五(和网络星期一)本身还有几周的时间，但显然，许多大型零售商都计划在活动前几周提供相当数量的广告折扣。我们下面的综述中并不是所有的东西都被明确地作为黑色星期五交易进行了营销，但今天仍然有几个极好的折扣，应该可以与我们在黑色星期五看到的价格相匹配。\n其中最值得注意的是Bose&39；的QuietComfort 35 II，售价199美元，与百思买(Best Buy)广告中的黑色星期五大减价不相上下。这与无线降噪耳机的历史最低价格持平，比其在网上的典型市场价格低约100美元。虽然QC35II现在已经有几年的历史了，但它仍然非常舒适，一次佩戴几个小时，具有令人愉悦的平衡的声音和噪音消除，仍然是你能买到的最强的之一。权衡：你必须解决microUSB充电问题，而不是USB-C，音频配置文件和噪音消除效果不像索尼的WH-1000XM4那样可定制，而且你会失去一些先进的功能，比如环境音效模式。但是尽管我们认为XM4总体上是一个更好的选择-我们预计它在黑色星期五会降到278美元-QC 35 II在这个价格下还是很划算的。\n在其他地方，亚马逊的Fire TV和Echo的许多设备都降到了黑色星期五的广告价格，包括亚马逊的Fire TV Stick 4K，售价30美元。虽然我们在去年黑色星期五期间看到这一媒体流服务降到了25美元，但今天的交易价格追平了自那以来我们看到的今年的最低价格，与亚马逊黄金日期间的现行价格持平。无论如何，我们仍然推荐Fire TV Stick 4K给那些想要廉价播放4K HDR视频的人：它运行和加载应用程序的速度很快，它通过Alexa具有强大的语音搜索功能，并且它支持Dolby Vision HDR。Roku的Streaming Stick+支持4K，用户界面更整洁但更白，谷歌最新的Chromecast应用程序库中的漏洞较少，但只需几个简单的步骤就可以纠正后者。\n除此之外，我们还看到Beats；Powerbeats Pro、LG的CX和BX OLED电视，以及三星的Galaxy Watch Active 2等产品在黑色星期五提前打折。你可以在下面的全面综述中看到这些优惠，以及今天剩下的最好的技术交易。如果你身在美国，并且在周二的选举中没有投票，那么你应该走出去，一边做一边去纠正这一点。\n注：Ars Technica可能会通过会员计划从此帖子上的链接获得销售补偿。\nDealmaster推出了自己的时事通讯！注册后，就可以收到一份更短的、经过严格管理的网上最佳科技交易清单--不要胡说八道，直接进入你的收件箱，而且通常是在它们进入ARS主页之前。\nBose QuietComfort 35 II蓝牙降噪耳机在亚马逊和百思买售价199美元(通常为300美元)。\n亚马逊Fire TV Stick 4K和HDR媒体流在亚马逊和百思买(Best Buy)售价29.99美元(通常为50美元)。\n亚马逊Fire TV Stick Lite 1080p HDR媒体流在亚马逊和百思买(Best Buy)售价17.99美元(通常为30美元)。\n亚马逊Echo Show 8智能显示屏在亚马逊和百思买(Best Buy)售价64.99美元(通常为105美元)。\n65英寸LG CX(2020年型号)4K HDR OLED电视，亚马逊售价1,849.99美元(剪贴47美元优惠券-通常为2,350美元)。\n三星Galaxy Watch Active 2(40毫米)健身智能手表在亚马逊和百思买的售价分别为179.99美元和249万美元。\n击败Powerbeats Pro耳机(精选颜色)的真无线运动耳机在亚马逊和百思买的售价分别为159.99美元(通常为240亿美元)。\nTribit XSound Go便携蓝牙扬声器在亚马逊售价21.39美元(夹5美元优惠券，使用代码：FZQ8XFYUS-通常为33美元)。\n适用于Xbox无线控制器的PowerA Moga移动游戏剪辑在亚马逊售价10.99美元(通常为15美元)。\n三星860 EVO(500 GB)2.5英寸SATA内置SSD在亚马逊和B&amp；H售价分别为54.99美元(通常为72美元)。\n联想Yoga C940二合一笔记本电脑-英特尔酷睿i7-1065G7，14英寸3840x2160，16 GB内存，512 GB固态硬盘，百思买售价1199.99美元(通常为1500美元)。\n三星860 EVO(500 GB)2.5英寸SATA内置SSD在亚马逊和B&amp；H售价分别为54.99美元(通常为72美元)。\n手表狗：军团军团(PS4，Xbox)在亚马逊的售价为49.94万美元(包括免费的下一代升级-通常为60美元)。\n预购：赛伯朋克2077(PS4，Xbox)在亚马逊售价49.94美元(包括免费的下一代升级-通常是60美元)。\n预购：刺客的Creed Valhara(PS4，Xbox)在亚马逊售价49.94美元(包括免费的下一代升级-通常为60美元)。\n适用于Xbox无线控制器的PowerA Moga移动游戏剪辑在亚马逊售价10.99美元(通常为15美元)。\n任天堂Switch Joy-Con控制器(L/R，各种颜色)任天堂Switch在亚马逊和沃尔玛的售价为69美元(通常为80美元)。\n55英寸LG BX电视(2020款)4K HDR OLED电视，亚马逊、B&amp；H和百思买(Best Buy)售价1,296.99美元(通常为1,500美元)。\n65英寸LG BX电视(2020款)4K HDR OLED电视，亚马逊、B&amp；H和百思买(Best Buy)售价1796.99美元(通常为2100美元)。\n55英寸LG CX电视(2020款)4K HDR OLED电视，亚马逊和B&amp；H的售价为1,396.99美元(通常为1,600美元)。\n仅限Costco会员：55英寸LG CX(2020年型号)4K HDR OLED电视+100美元的Hulu礼品卡，在Costco购买价值1,349.99美元(通常为1700美元)。\n65英寸LG CX(2020年型号)4K HDR OLED电视，亚马逊售价1,849.99美元(剪贴47美元优惠券-通常为2,350美元)。\n65英寸索尼X750H(2020年款)4K LED安卓电视，亚马逊售价599.99美元(通常为750美元)。\n亚马逊Fire TV Stick 4K和HDR媒体流在亚马逊和百思买(Best Buy)售价29.99美元(通常为50美元)。\n亚马逊Fire TV Stick Lite 1080p HDR媒体流在亚马逊和百思买(Best Buy)售价17.99美元(通常为30美元)。\n亚马逊Fire TV Cube的4K HDR媒体流+智能扬声器在亚马逊和百思买(Best Buy)售价79.99美元(通常为120美元)。\n亚马逊Fire TV在亚马逊和百思买重播了一台(500 GB)无线硬盘录像机，售价为129.99美元(通常为230亿美元)。\n亚马逊Kindle阅读器(8 GB，ADS)在亚马逊和百思买(Best Buy)售价59.99美元(通常为90美元)。\n亚马逊Echo Dot智能扬声器(第三代)在亚马逊和百思买(Best Buy)售价18.99美元(通常为40美元)。\nAmazon Echo Flex是一款智能插电式扬声器，在亚马逊和百思买(Best Buy)售价9.99美元(通常为25美元)。\n亚马逊Echo Show 5智能显示屏在亚马逊、科尔百货(Kohl&39；s)和百思买(Best Buy)的售价分别为44.99美元(通常为75美元)。\n亚马逊Echo Show 8智能显示屏在亚马逊和百思买(Best Buy)售价64.99美元(通常为105美元)。\n亚马逊Echo Show(第二代)10.1英寸智能显示屏在亚马逊和百思买的售价分别为149.99美元(通常为230美元)。\n三星Galaxy Watch Active 2(40毫米)健身智能手表在亚马逊和百思买的售价分别为179.99美元和249万美元。\nTP-Link Kasa HS300智能Wi-Fi配电盘-6倍交流，3倍USB-A，在亚马逊售价59.99美元(通常为72美元)。\nBose QuietComfort 35 II蓝牙降噪耳机在亚马逊和百思买售价199美元(通常为300美元)。\n击败Powerbeats Pro耳机(精选颜色)的真无线运动耳机在亚马逊和百思买的售价分别为159.99美元(通常为240亿美元)。\n三星Galaxy Buds在亚马逊和百思买(Best Buy)推出了真正的无线耳机，售价99.99美元(通常为110美元)。\nTribit XSound Go便携蓝牙扬声器在亚马逊售价21.39美元(夹5美元优惠券，使用代码：FZQ8XFYUS-通常为33美元)。\nEarFun免费在亚马逊购买真正的无线耳机，售价35.99美元(Clip 10%优惠券-通常是45美元)。\nJLAB Audio Rewind无线蓝牙耳机在JLab Audio售价12.75美元(使用代码：GOREED-通常为20美元)。\n三星EVO精选卡(256 GB)microSDXC卡-UHS-I，U3，Class 10在亚马逊和三星电子的售价分别为29.99亿美元(通常为35美元)。\nNekteck 60W PD墙壁充电器-60W USB-C PD在亚马逊售价19.99美元(通常为26美元)。\nAnker电力线II(3英尺，MFi认证)USB-C到闪电电缆在亚马逊售价9.99美元(通常为14美元)。\nAnker Power Line III(6英尺，60W PD)USB-C到USB-C电缆在亚马逊售价8.99美元(使用代码：NANKER8853-通常为18美元)。\nAnker PowerExpand+7合1 USB-C HUB-85W USB-C PD，USB-C，2x USB 3.0，microSD，SD，HDMI(4K@30 Hz)，在亚马逊售价23.99美元(削价20%优惠券-通常为38美元)。\nAnker PowerCore Essential 20000 PD和便携式电池-18WUSB-C PD，USB-A，20000mAh，在亚马逊商店售价34.99美元(剪辑15美元优惠券-通常是50美元)。\nAnker PowerPort Cube的USB配电盘-3x AC，3x USB-A在亚马逊售价16.14美元(剪裁15%的优惠券-通常是20美元)。\nAnker配电盘和USB配电板-2倍交流，30W USB-C PD，2倍USB-A，在亚马逊售价31.99美元(剪裁20%优惠券-通常为37美元)。\n仅限Prime：AUKEY PA-B3和USB-C壁式充电器-总计65W，65W USB-C PD，USB-A，GAN，亚马逊售价24.99美元(剪辑5美元优惠券-通常为38美元)。\nVAVA-UC006和9合1 USB-C集线器-49W USB-C PD，2x USB 3.0，USB 2.0，HDMI(4K@30 Hz)，SD，microSD，3.5 mm，以太网，亚马逊售价48.44美元(剪贴5%优惠券-通常为60美元)。\nRAVPower RP-PC058 QI无线充电器+Quick Charge 3.0适配器-10W Galaxy/7.5W iPhone，RAVPower售价13.09美元(使用代码：BACK60-通常为22美元)。", "note_en": "Today&#39;s Dealmaster is headlined by a few good leftover deals from the  early Black Friday sales we highlighted last week. Though we&#39;re still weeks away from Black Friday (and Cyber Monday) itself, it seems  apparent that many  retailers plan  to make a fair amount of their advertised discounts available in the weeks leading up to the event. Not  everything in our roundup below has been explicitly marketed as a Black Friday deal, but there are still a handful of excellent discounts available today that should match the prices we&#39;ll see on Black Friday proper.\n Among the most noteworthy of these offers is  Bose&#39;s QuietComfort 35 II for $199, which matches Best Buy&#39;s  advertised Black Friday deal. This ties the all-time lowest price for the wireless noise-canceling headphones and comes in about $100 below its typical street price online. Though it&#39;s now a few years old, the QC 35 II remains supremely comfortable to wear for hours at a time, with a pleasantly balanced sound and noise cancellation that still ranks among the strongest you can buy. The trade-offs: you have to deal with microUSB charging instead of USB-C, the audio profile and noise-canceling effect aren&#39;t as customizable as they are on other pairs like Sony&#39;s WH-1000XM4, and you lose out on some advanced features like an ambient sound mode. But while we think the XM4  is a better option overall—we expect it to drop to $278 on Black Friday—the QC 35 II is an excellent value at this deal price.\n Elsewhere, a number of Amazon&#39;s Fire TV and Echo devices are down to  advertised Black Friday prices, including  Amazon&#39;s Fire TV Stick 4K for $30. Although we saw this media streamer drop to $25 during Black Friday last year, today&#39;s deal ties the lowest price we&#39;ve seen in the year since and matches its going rate during Amazon Prime Day. In any event, we  still recommend the Fire TV Stick 4K for those looking to stream 4K HDR video on the cheap: it runs and loads apps quickly, it has robust voice-search functionality through Alexa, and it supports Dolby Vision HDR.  Roku&#39;s Streaming Stick+ does 4K with a tidier-but-blander user interface, and  Google&#39;s latest Chromecast has fewer holes in its app library, but it&#39;s possible to rectify the latter with  a couple easy steps.\n Beyond that, we&#39;re also seeing early Black Friday deals on  Beats&#39; Powerbeats Pro,  LG&#39;s CX and BX OLED TVs, and Samsung&#39;s Galaxy Watch Active 2, among a couple others. You can see those offers, along with the rest of today&#39;s best tech deals, in our full roundup below. And if you&#39;re in the United States and haven&#39;t voted in Tuesday&#39;s elections, go out and rectify that as you do so.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n The Dealmaster has launched its very own newsletter! Sign up to receive a shorter, tightly curated list of the very best tech deals on the Web—no nonsense, direct to your inbox, and often before they make it to the Ars homepage.\n   Bose QuietComfort 35 II Bluetooth noise-canceling headphones for  $199 at Amazon and  Best Buy (normally $300).\n Amazon Fire TV Stick 4K HDR media streamer for  $29.99 at Amazon and  Best Buy (normally $50).\n Amazon Fire TV Stick Lite 1080p HDR media streamer for  $17.99 at Amazon and  Best Buy (normally $30).\n Amazon Echo Show 8 smart display for  $64.99 at Amazon and  Best Buy (normally $105).\n 65-inch LG CX (2020 model) 4K HDR OLED TV for  $1,849.99 at Amazon ( clip $47 coupon—normally $2,350).\n Samsung Galaxy Watch Active 2 (40mm) fitness smartwatch for  $179.99 at Amazon and  Best Buy (normally $249).\n Beats Powerbeats Pro (select colors) true wireless sports earphones for  $159.99 at Amazon and  Best Buy (normally $240).\n Tribit XSound Go portable Bluetooth speaker for  $21.39 at Amazon ( clip $5 coupon and use code:  ZQ8XFYUS—normally $33).\n PowerA MOGA Mobile Gaming Clip for Xbox Wireless Controllers for  $10.99 at Amazon (normally $15).\n Samsung 860 EVO (500GB) 2.5-inch SATA internal SSD for  $54.99 at Amazon and  B&amp;H (normally $72).\n   Lenovo Yoga C940 two-in-one laptop—Intel Core i7-1065G7, 14-inch 3840x2160, 16GB RAM, 512GB SSD for  $1,199.99 at Best Buy (normally $1,500).\n Samsung 860 EVO (500GB) 2.5-inch SATA internal SSD for  $54.99 at Amazon and  B&amp;H (normally $72).\n   Watch Dogs: Legion (PS4, Xbox) for  $49.94 at Amazon (includes free next-gen upgrade—normally $60).\n       Pre-order:   Cyberpunk 2077 (PS4, Xbox) for  $49.94 at Amazon (includes free next-gen upgrade—normally $60).\n Pre-order:   Assassin&#39;s Creed Valhalla (PS4, Xbox) for  $49.94 at Amazon (includes free next-gen upgrade—normally $60).\n   PowerA MOGA Mobile Gaming Clip for Xbox Wireless Controllers for  $10.99 at Amazon (normally $15).\n   Nintendo Switch Joy-Con (L/R, various colors) controllers for Nintendo Switch for  $69 at Amazon and  Walmart (normally $80).\n   55-inch LG BX (2020 model) 4K HDR OLED TV for  $1,296.99 at Amazon,  B&amp;H, and  Best Buy (normally $1,500).\n 65-inch LG BX (2020 model) 4K HDR OLED TV for  $1,796.99 at Amazon,  B&amp;H, and  Best Buy (normally $2,100).\n 55-inch LG CX (2020 model) 4K HDR OLED TV for  $1,396.99 at Amazon and  B&amp;H (normally $1,600).\n Costco Members only:  55-inch LG CX (2020 model) 4K HDR OLED TV  + $100 Hulu gift card for  $1,349.99 at Costco (normally $1,700).\n 65-inch LG CX (2020 model) 4K HDR OLED TV for  $1,849.99 at Amazon ( clip $47 coupon—normally $2,350).\n 65-inch Sony X750H (2020 model) 4K LED Android TV for  $599.99 at Amazon (normally $750).\n Amazon Fire TV Stick 4K HDR media streamer for  $29.99 at Amazon and  Best Buy (normally $50).\n Amazon Fire TV Stick Lite 1080p HDR media streamer for  $17.99 at Amazon and  Best Buy (normally $30).\n Amazon Fire TV Cube 4K HDR media streamer + smart speaker for  $79.99 at Amazon and  Best Buy (normally $120).\n Amazon Fire TV Recast (500GB) over-the-air DVR for  $129.99 at Amazon and  Best Buy (normally $230).\n   Amazon Kindle (8GB, ads) e-book reader for  $59.99 at Amazon and  Best Buy (normally $90).\n Amazon Echo Dot (3rd gen) smart speaker for  $18.99 at Amazon and  Best Buy (normally $40).\n Amazon Echo Flex smart plug-in speaker for  $9.99 at Amazon and  Best Buy (normally $25).\n Amazon Echo Show 5 smart display for  $44.99 at Amazon,  Kohl&#39;s, and  Best Buy (normally $75).\n Amazon Echo Show 8 smart display for  $64.99 at Amazon and  Best Buy (normally $105).\n Amazon Echo Show (2nd gen) 10.1-inch smart display for  $149.99 at Amazon and  Best Buy (normally $230).\n Samsung Galaxy Watch Active 2 (40mm) fitness smartwatch for  $179.99 at Amazon and  Best Buy (normally $249).\n   TP-Link Kasa HS300 smart Wi-Fi power strip—6x AC, 3x USB-A for  $59.99 at Amazon (normally $72).\n   Bose QuietComfort 35 II Bluetooth noise-canceling headphones for  $199 at Amazon and  Best Buy (normally $300).\n Beats Powerbeats Pro (select colors) true wireless sports earphones for  $159.99 at Amazon and  Best Buy (normally $240).\n   Samsung Galaxy Buds true wireless earphones for  $99.99 at Amazon and  Best Buy (normally $110).\n Tribit XSound Go portable Bluetooth speaker for  $21.39 at Amazon ( clip $5 coupon and use code:  ZQ8XFYUS—normally $33).\n  EarFun Free true wireless earphones for  $35.99 at Amazon ( clip 10% coupon—normally $45).\n  JLab Audio Rewind Wireless Bluetooth on-ear headphones for  $12.75 at JLab Audio (use code:  GOREED—normally $20).\n   Samsung EVO Select (256GB) microSDXC card - UHS-I, U3, Class 10 for  $29.99 at Amazon and  Samsung (normally $35).\n Nekteck 60W PD Wall Charger—60W USB-C PD for  $19.99 at Amazon (normally $26).\n Anker PowerLine II (3ft, MFi certified) USB-C to Lightning cable for  $9.99 at Amazon (normally $14).\n Anker PowerLine III (6ft, 60W PD) USB-C to USB-C cable for  $8.99 at Amazon (use code:  ANKER8853—normally $18).\n Anker PowerExpand+ 7-in-1 USB-C hub—85W USB-C PD, USB-C, 2x USB 3.0, microSD, SD, HDMI (4K@30Hz) for  $23.99 at Amazon ( clip 20% coupon—normally $38).\n Anker PowerCore Essential 20000 PD portable battery—18W USB-C PD, USB-A, 20,000mAh for  $34.99 at Amazon ( clip $15 coupon—normally $50).\n Anker PowerPort Cube USB power strip—3x AC, 3x USB-A for  $16.14 at Amazon ( clip 15% coupon—normally $20).\n Anker PowerStrip Pad USB power strip—2x AC, 30W USB-C PD, 2x USB-A for  $31.99 at Amazon ( clip 20% coupon—normally $37).\n Prime only:  Aukey PA-B3 USB-C wall charger—65W total, 65W USB-C PD, USB-A, GaN for  $24.99 at Amazon ( clip $5 coupon—normally $38).\n Vava VA-UC006 9-in-1 USB-C hub—49W USB-C PD, 2x USB 3.0, USB 2.0, HDMI (4K@30Hz), SD, microSD, 3.5mm, Ethernet for  $48.44 at Amazon ( clip 5% coupon—normally $60).\n RAVPower RP-PC058 Qi wireless charger + Quick Charge 3.0 adapter—10W Galaxy/7.5W iPhone for  $13.09 at RAVPower (use code:  BACK60—normally $22).", "posttime": "2020-11-04 03:43:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "bose,early,usb", "title": "抢购Bose耳机、Fire TV Stick等的早期黑色星期五优惠", "title_en": "Grab early Black Friday deals on Bose headphones, Fire TV Sticks, and more", "transed": 1, "url": "https://arstechnica.com/staff/2020/11/early-black-friday-deals-bose-headphones-amazon-devices/", "via": "", "real_tags": ["bose", "early", "usb"]}, {"category": "", "categoryclass": "", "imagename": "01dcd42ec83d98ffdfec3de366b13934.jpg", "infoid": 1033028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2016年大选后，YouTube的工程师们开始对YouTube算法进行修改，该算法已成为世界上最具影响力的计算机代码行之一。\n这一算法决定了YouTube推荐用户下一步观看哪些视频；该公司表示，人们每天在YouTube上花费的10亿小时中，有70%是由它负责的。但很明显，这些建议往往会将观众引向极端党派、分裂、误导或彻头彻尾错误的视频。\n新的数据现在显示，去年完成的这项努力大多奏效了。根据前谷歌工程师纪尧姆·沙洛特(Guillaume Chaslot)的研究，在周二大选前的几周里，YouTube推荐的附带新闻视频的边缘频道比2016年少得多，这有助于减少虚假信息的传播。夏洛特曾帮助构建YouTube的推荐引擎，现在正在研究它。\n“在我们的数据集中，2016年最受推荐的频道是亚历克斯·琼斯(Alex Jones)，”臭名昭著的互联网阴谋论者亚历克斯·琼斯(Alex Jones)说。自那以后，他被禁止进入YouTube。“现在是福克斯新闻。”\n根据查斯洛和加州大学伯克利分校(University of California，Berkeley)研究员马克·法杜尔(Marc Faddul)的数据，在过去一个月对YouTube关于热门新闻和选举视频的推荐进行的几项分析中，福克斯新闻(Fox News)一直是最受欢迎的频道，有时还遥遥领先。\n数据还显示，YouTube最常推荐的福克斯新闻(Fox News)片段来自其支持特朗普的黄金时段节目，这些节目经常攻击民主党人，有时还会传播关于选民欺诈和冠状病毒的不可靠信息。\n社交媒体分析公司Social Blade的数据显示，福克斯新闻(Fox News)在YouTube上的观点在过去一年里翻了一番多，周一超过60亿，这些数据证实了这些发现。数据显示，这一速度超过了除NBC新闻之外的所有其他美国主要新闻网络，NBC新闻在此期间的增长速度几乎是NBC的两倍，但总浏览量为23亿。\nFacebook也对其算法进行了调整，以引导人们获得更可靠的信息，该公司也显示了类似的结果。从用户与帖子的互动来看，福克斯新闻的表现远远超过其他大型新闻媒体，这是唯一可以公开获得的此类数据。\n福克斯新闻(Fox News)在社交媒体平台上的崛起提醒人们，科技公司一直在限制错误信息和安抚抱怨硅谷有偏见的政客之间走钢丝--所有这些都是在让人们在自己的网站上点击、观看和分享。\nYouTube对福克斯新闻(Fox News)毫不掩饰的保守派专家的宣传，也削弱了这些专家中的一些人的观点，即最大的科技公司正试图让他们保持沉默。\n福克斯新闻(Fox News)明星塔克·卡尔森(Tucker Carlson)最近批评了一名谷歌高管的言论，该高管表示，拥有YouTube的公司将努力改善搜索结果，以促进“更好的治理质量”和决策。\n“那是什么意思？”卡尔森先生说。“换句话说，他们想颠覆民主。”\n查斯洛的数据显示，近几周来，YouTube推荐卡尔森这段视频的程度几乎超过了任何其他新闻相关视频。\n研究人员和其他分析师估计，福克斯新闻在YouTube和Facebook上越来越受欢迎，很大程度上是因为它适合他们的算法甜蜜点。该电视台一直被认为是一个权威的消息来源，这会告诉算法们给它一个提振，而它的保守派脱口秀节目的党派标题在吸引点击量方面是有效的，这也告诉算法们要继续宣传它们。\n根据查斯洛的分析，MSNBC和CNN也是YouTube最近热门新闻视频中最受推荐的频道之一，尽管不及福克斯新闻(Fox News)。YouTube还经常将人们引导到他们的视频上，这些视频有更多的党派色彩和耸人听闻的标题。\n“点击诱惑力仍然非常重要，就像2016年一样，”查斯洛说。\nYouTube发言人法沙德·沙德洛(Farshad Shadloo)在一份声明中表示，YouTube的算法改变导致人们在过去一年里观看福克斯新闻(Fox News)、MSNBC、CNN、NBC新闻、ABC新闻和CBS新闻的视频的时间增加了141%。\n他说：“自2018年以来，我们一直专注于确保人们在YouTube上寻找新闻和信息时，他们能从权威渠道获得信息。”\n福克斯新闻的一位发言人表示，该电视网一直在努力提升其在YouTube上的存在。福克斯新闻(Fox News)组建了一个专注于该平台的团队，并特意发布了在YouTube搜索引擎和观众中表现良好的视频，如突发新闻的现场直播。\n根据CrowdTangle的数据，在Facebook上，过去一周与选举相关帖子的所有互动中，福克斯新闻的页面占到了10%。这仅次于特朗普总统的官方页面，占18%，高于布莱巴特的6%。\n紧随其后的是CNN，支持率为2%，与福克斯新闻早间节目“福克斯与朋友”的版面大致相当。Facebook拒绝置评，但指出互动并不完全反映帖子的覆盖范围，尽管它们是该公司提供的唯一衡量帖子受欢迎程度的指标。\n在一项分析中，沙斯洛和法杜尔在10月27日结束的三周时间里，每天收集YouTube上800个最受欢迎的新闻频道发布的视频的推荐。在收集到的30万条推荐中，福克斯新闻占了3%以上，是排名第二的历史频道的两倍多。CNN和MSNBC约占推荐的1%。\n当研究人员只分析来自相同频道的选举视频时，福克斯新闻(Fox News)占所有推荐的10%，几乎是第二大宣传频道MSNBC的三倍。对推荐的其他分析以及一些最受欢迎的选举相关视频也显示，福克斯新闻(Fox News)是宣传最多的频道。\n普林斯顿大学(Princeton University)研究算法对社会的影响的计算机科学家阿温德·纳拉亚南(Arvind Narayanan)说，考虑到YouTube和Facebook等社交网络的巨大规模和影响力，改变它们推广内容的方式往往会导致意想不到的结果，比如新闻机构为了取悦新算法而撰写标题或编排故事。\n他说：“YouTube一直在修改它的算法。”“当它这么做的时候，它总是会产生意想不到的和意想不到的影响。”", "note_en": "After the 2016 election, engineers at YouTube went to work on changes to a YouTube algorithm that had become one of the world’s most influential lines of computer code.\n That algorithm decided which videos YouTube recommended that users watch next; the company said it was responsible for 70 percent of the one billion hours a day people spent on YouTube. But it had become clear that those recommendations  tended to steer viewers toward videos that were  hyperpartisan,  divisive,  misleading or  downright false.\n New data now shows that the effort, which was  completed last year, mostly worked. In the weeks leading up to Tuesday’s election, YouTube recommended far fewer fringe channels alongside news videos than it did in 2016, which helped it to reduce its spread of disinformation, according to research by Guillaume Chaslot, a former Google engineer who helped build YouTube’s recommendation engine and now  studies it.\n  “The channel most recommended in our data set in 2016 was  Alex Jones,” the notorious internet conspiracy theorist, who has since been barred from YouTube, Mr. Chaslot said. “Now it’s Fox News.”\n In several analyses of YouTube’s recommendations on popular news and election videos over the past month, Fox News was consistently the most recommended channel, sometimes by a wide margin, according to data from Mr. Chaslot and  Marc Faddoul, a researcher at the University of California, Berkeley.\n The data also showed that the Fox News clips most frequently recommended by YouTube were from its pro-Trump prime-time shows that often attack Democrats and sometimes spread unreliable information about  voter fraud and the  coronavirus.\n The findings were affirmed by separate data that showed Fox News’s views on YouTube have more than doubled over the past year, surpassing six billion on Monday, according to Social Blade, a social media analytics firm. That rate outpaced every other major American news network aside from NBC News, which grew nearly twice as fast over the period but had 2.3 billion total views, according to the data.\n Facebook, which has also tweaked its algorithms to  steer people toward more reliable information, has shown similar results. Fox News has far outperformed other large news outlets when measured by users’ interactions with posts, the only such data publicly available.\n The ascent of Fox News on the social media platforms was a reminder that tech companies have been walking a tricky line between limiting misinformation and appeasing politicians complaining that Silicon Valley is biased — all while still keeping people clicking, watching and sharing on their sites.\n YouTube’s promotion of Fox News’s unabashedly conservative pundits also undercut arguments from some of those same pundits that the biggest tech companies are trying to silence them.\n The Fox News star Tucker Carlson recently criticized comments by a Google executive that the company, which owns YouTube, would try to improve its search results to promote “better quality of governance” and decision making.\n “What does that mean?” Mr. Carlson said. “In other words, they want to subvert democracy.”\n YouTube has recommended that  clip of Mr. Carlson more than almost any other news-related video in recent weeks, according to Mr. Chaslot’s data.\n The researchers and other analysts estimated that Fox News’s growing popularity on YouTube and Facebook was largely due to its fitting into their algorithmic sweet spots. The network has been rubber-stamped as an authoritative source, which tells the algorithms to give it a boost, while its conservative talk shows’ partisan headlines are effective at drawing clicks, which also tells the algorithms to keep promoting them.\n  MSNBC and CNN were also among YouTube’s most recommended channels on recent popular news videos, according to Mr. Chaslot’s analysis, though less than Fox News. YouTube also frequently directed people toward their videos that had more partisan and sensational headlines.\n “Clickbaitiness is still really important, as it was in 2016,” Mr. Chaslot said.\n Farshad Shadloo, a YouTube spokesman, said in a statement that YouTube’s algorithm changes contributed to a 141 percent increase in the time people spent watching videos from Fox News, MSNBC, CNN, NBC News, ABC News and CBS News collectively over the past year.\n “Since 2018, we’ve been focused on ensuring when people come to YouTube looking for news and information, they get it from authoritative sources,” he said.\n A Fox News spokesperson said the network had worked hard to elevate its presence on YouTube. Fox News created a team focused on the platform and has made a point of posting videos that perform well with YouTube’s search engine and with viewers, such as live broadcasts of breaking news.\n On Facebook, Fox News’s page accounted for 10 percent of all interactions with posts about the election over the past week, according to CrowdTangle. That was second only to President Trump’s official page, at 18 percent, and above Breitbart’s at 6 percent.\n The next major network was CNN at 2 percent, roughly on a par with the page of “Fox &amp; Friends,” the Fox News morning show. Facebook declined to comment but noted that interactions do not entirely reflect a post’s reach, though they are the only measure of a post’s popularity that the company makes available.\n In one analysis, Mr. Chaslot and Mr. Faddoul collected recommendations daily on videos posted by 800 of YouTube’s most popular news-related channels over the three weeks that ended on Oct. 27. Fox News accounted for more than 3 percent of the 300,000 recommendations collected, more than twice the rate of the next-closest channel, the History Channel. CNN and MSNBC accounted for about 1 percent of recommendations.\n When the researchers analyzed only videos about the election from the same channels, Fox News accounted for 10 percent of all the recommendations, nearly three times the rate of the No. 2 most-promoted channel, MSNBC. Other analyses of recommendations alongside some of the most popular election-related videos also showed Fox News as the most-promoted channel.\n Given the enormous size and influence of social networks like YouTube and Facebook, changes to how they promote content often causes unforeseen outcomes, such as news organizations writing headlines or framing stories to please the new algorithms, said Arvind Narayanan, a computer scientist at Princeton University who studies the effect of algorithms on society.\n “YouTube is constantly tinkering with its algorithms,” he said. “And when it does that, it always is going to have both intended and unintended effects.”", "posttime": "2020-11-04 03:38:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,新闻,news", "title": "研究：YouTube最近减少边缘频道错误信息推荐的努力奏效了；福克斯新闻现在是最受推荐的新闻和选举视频", "title_en": "Study: YouTube's recent efforts to reduce recommendations of misinfo from fringe channels worked; Fox News is now the most recommended for news, election videos", "transed": 1, "url": "https://www.nytimes.com/2020/11/03/technology/youtube-misinformation-fox-news.html", "via": "", "real_tags": ["youtube", "新闻", "news"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自美国东部的两名年轻男子遭到身份盗窃和共谋指控，他们涉嫌通过欺骗无线电话公司的员工提供远程访问和修改客户账户信息所需的凭据来窃取比特币和社交媒体账户。\n检察官说，马里兰州蒂莫尼姆21岁的乔丹·K·米尔森(Jordan K.Milleson)。还有19岁的宾夕法尼亚州金斯敦。当地居民凯尔·A·布莱恩(Kyell A.Bryan)通过语音钓鱼或“Vishing”攻击以及“SIM交换”(一种涉及贿赂或欺骗移动电话公司员工的欺诈形式)，劫持了社交媒体和比特币账户。\n调查人员指控，这两人建立了模仿属于无线提供商的合法员工门户的钓鱼网站，然后向这些提供商的员工发送电子邮件和/或打电话，试图诱骗他们登录这些虚假门户。\n根据起诉书(PDF)，米勒森和布莱恩利用他们对无线公司员工工具的钓鱼访问，重新分配了绑定到目标移动设备上的订户身份识别模块(SIM)。SIM卡是移动电话中的一个小的、可拆卸的智能芯片，它将设备与客户的电话号码联系起来，他们窃取员工工具的权限意味着他们可以将任何客户的电话号码重新分配给他们控制的移动设备中的SIM卡。\n这使得他们能够控制目标的来电和短信，这些电话和短信被用来重置与这些号码相关的电子邮件、社交媒体和加密货币账户的密码。\n有趣的是，这一阴谋似乎是因为两人之间的一场商业纠纷而瓦解的。检方称，2019年6月26日，“布莱恩打电话给巴尔的摩县警察局，谎报他自称是米尔逊家族住宅的居民，在该住宅枪杀了他的父亲。”\n美国马里兰州地区检察官办公室的一份声明写道：“在通话中，布莱恩冒充据称的枪手，威胁说如果警察试图与他对峙，他将开枪自杀，并向警察开枪。”“这是一次‘拍打’攻击，这是一种刑事骚扰策略，一个人给当局打一个假电话，就会触发警察或特种武器与战术(SWAT)小组的反应-从而造成危及生命的情况。”\n起诉书称，布莱恩扇了他所谓的合作伙伴一巴掌，以报复米尔森未能分享数字货币盗窃的收益。米勒森和布莱恩面临电信欺诈、未经授权访问受保护的计算机、严重的身份盗窃和电信欺诈共谋的指控。\n起诉书没有具体说明钓鱼和反钓鱼计划针对的无线公司，但接近调查的消息人士告诉Krebson Security，这两人是OGuser的活跃成员，OGuser是一个在线论坛，面向出售被劫持社交媒体账户访问权的人。\n据称，布莱恩在OGUSERS上使用了“香槟”的昵称。在过去几年中，至少有两次OGuser论坛遭到黑客攻击，其用户数据库-包括论坛成员之间的私人消息-被发布在网上。在一条日期为2019年11月15日的私人消息中，可以看到香槟要求另一名OGuser成员创建一个模仿T-Mobile员工登录页面的钓鱼网站(t-mobileupdate[.]com)。\n消息人士告诉Krebson Security，这两人是一个更大阴谋的一部分，涉及来自美国和英国的个人，他们利用钓鱼和网络钓鱼欺骗在家工作的员工提供远程访问雇主网络所需的凭据。", "note_en": "Two young men from the eastern United States have been hit with identity theft and conspiracy charges for allegedly stealing bitcoin and social media accounts by tricking employees at wireless phone companies into giving away credentials needed to remotely access and modify customer account information.\n  Prosecutors say  Jordan K. Milleson, 21 of Timonium, Md. and 19-year-old Kingston, Pa. resident  Kyell A. Bryan hijacked social media and bitcoin accounts using a mix of voice phishing or “ vishing” attacks and “ SIM swapping,” a form of fraud that involves bribing or tricking employees at mobile phone companies.\n Investigators allege the duo set up phishing websites that mimicked legitimate employee portals belonging to wireless providers, and then emailed and/or called employees at these providers in a bid to trick them into logging in at these fake portals.\n According to  the indictment (PDF), Milleson and Bryan used their phished access to wireless company employee tools to reassign the subscriber identity module (SIM) tied to a target’s mobile device. A SIM card is a small, removable smart chip in mobile phones that links the device to the customer’s phone number, and their purloined access to employee tools meant they could reassign any customer’s phone number to a SIM card in a mobile device they controlled.\n That allowed them to seize control over a target’s incoming phone calls and text messages, which were used to reset the password for email, social media and cryptocurrency accounts tied to those numbers.\n Interestingly, the conspiracy appears to have unraveled over a business dispute between the two men. Prosecutors say on June 26, 2019, “Bryan called the Baltimore County Police Department and falsely reported that he, purporting to be a resident of the Milleson family residence, had shot his father at the residence.”\n “During the call, Bryan, posing as the purported shooter, threatened to shoot himself and to shoot at police officers if they attempted to confront him,” reads  a statement from the U.S. Attorney’s Office for the District of Maryland. “The call was a ‘swatting’ attack, a criminal harassment tactic in which a person places a false call to authorities that will trigger a police or special weapons and tactics (SWAT) team response — thereby causing a life-threatening situation.”\n The indictment alleges Bryan swatted his alleged partner in retaliation for Milleson failing to share the proceeds of a digital currency theft. Milleson and Bryan are facing charges of wire fraud, unauthorized access to protected computers, aggravated identity theft and wire fraud conspiracy.\n The indictment doesn’t specify the wireless companies targeted by the phishing and vishing schemes, but sources close to the investigation tell KrebsOnSecurity the two men were active members of  OGusers, an online forum that caters to people selling access to hijacked social media accounts.\n Bryan allegedly used the nickname “Champagne” on OGusers. On at least two occasions in the past few years, the OGusers forum  was hacked and its user database — including private messages between forum members — were posted online. In a private message dated Nov. 15, 2019, Champagne can be seen asking another OGusers member to create a phishing site mimicking T-Mobile’s employee login page (t-mobileupdates[.]com).\n Sources tell KrebsOnSecurity the two men are part of  a larger conspiracy involving individuals from the United States and United Kingdom who’ve used vishing and phishing to trick work-at-home employees into giving away credentials needed to remotely access their employers’ networks.", "posttime": "2020-11-04 03:16:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "被控,sim,钓鱼", "title": "两人被控SIM卡互换，恶意诈骗", "title_en": "Two Charged in SIM Swapping, Vishing Scams", "transed": 1, "url": "https://krebsonsecurity.com/2020/11/two-charged-in-sim-swapping-vishing-scams/", "via": "", "real_tags": ["被控", "sim", "钓鱼"]}, {"category": "", "categoryclass": "", "imagename": "e4f045655c9a7854741da7e52f88d704.png", "infoid": 1033025, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在每个开发人员的生命中都会有这样一个时刻，他们必须面对这种不可避免的情况。真的，这是我们社区的必经之路。\n我写这篇简短的帖子是为了记录导致这起可怕事故的事件，以及从这场惨败中吸取的一些重要教训。\n在我们开始之前，先快速概述一下我的基础架构。WorkIndia的基础设施托管在AWS上，其中一些术语指的是AWS服务，但这可能发生在任何在虚拟机上托管数据库的人身上。这个特定的微服务托管在运行API的单个虚拟机、PostgreSQL和使用Docker容器的MongoDB服务器上。\n我尝试通过SSH登录机器，但由于CPU负载异常高，我的连接不成功。此时，通常的解决方案是从AWS控制台面板重新启动或停止/启动实例。大错特错了！\n我停止该实例，并给它几分钟时间来引导一台新机器并启动码头容器。\n突然意识到服务已在Auto Scaling Group(ASG)后面配置。当我停止原来的实例时，ASG找不到健康的机器，它从一个非常旧的启动模板创建了一个新实例。\n没关系，至少我有原始实例和所有数据。我只需更改新机器中的数据库主机设置。\n一旦我停止了该实例，ASG就确定该实例不健康，并继续永久终止它。这是ASG的默认行为，但是可以使用终止策略将实例从这种命运中拯救出来。\n我叫了增援部队，但太晚了。损害已经造成了。PostgreSQL和MongoDB上的所有数据都丢失了。\n我信任的同事们立即开始工作，并设计了一个计划，使用来自另一项服务的逻辑重新生成大部分丢失的数据。他们花了不到一天的时间，但谢天谢地，数据或多或少得到了恢复。\n基础设施是一项容易出错的业务。作为一名基础设施工程师，我觉得我更多的精力花在创建故障保险上，而不是真正尝试创建一个完全健壮的应用程序。事情会失败的，我们的工作就是优雅地处理失败。\n在我们的规模中，将API服务器等无状态应用程序与PostgreSQL和MongoDB等有状态应用程序混合使用是不明智的，这些应用程序有存储需求。无状态应用程序和有状态应用程序遵循不同的规则，因此需要使用截然不同的故障策略。", "note_en": "There comes a moment in every developer’s life when they must face this inevitable situation. Really, it’s a rite of passage for our community.\n  I’m writing this short post to chronicle the events that lead to this dreadful accident along with a few important lessons to learn from this fiasco.\n Before we begin, a quick overview of my infrastructure. The infrastructure at WorkIndia is hosted on AWS and some of the terms reference to AWS Services, but this could happen to anyone hosting databases on virtual machines. This particular microservice was hosted on a  single virtual machine running the API, a PostgreSQL, and a MongoDB server using Docker containers.\n    I try to SSH into the machine but due to unnaturally high CPU load, my connection is unsuccessful. At this point the usual solution is to reboot or stop/start the instance from the AWS Console panel.  BIG MISTAKE!\n    I stop the instance and give it a few minutes to boot a new machine and start the docker containers.\n     Sudden realisation that the service has been configured behind an  Auto Scaling Group (ASG). When I stopped the original instance, the ASG couldn’t find a healthy machine and it created a new instance from a very old launch template.\n Its okay, at least I have the original instance and all its data. I’ll just change the database host settings in the new machine.\n   Once I stopped the instance, the ASG determined the instance was unhealthy and proceeded to permanently terminate it. This is the default behaviour of an ASG but an instance can be saved from such a fate using a  termination policy.\n     I call in reinforcements, but its too late. The damage is done. All data on both the PostgreSQL and MongoDB was lost.\n  My trusted collegues immediately got to work and devised a plan to regenerate most of the lost data using logic from another service. It took them not more than a day, but thankfully the data was recovered,  more or less.\n  Infrastrucutre is an error prone business. As an infrastructure engineer, I feel more of my energy is spent on creating fail-safes than actually trying to create a perfectly robust application. Things will fail, its our job to handle the failures gracefully.\n   At our scale, it is unwise to mix stateless applications like API servers with stateful applications like PostgreSQL and MongoDB which have storage requirements. Stateless and stateful applications play by different rules and therefore need to have vastly different failure strategies.", "posttime": "2020-11-04 03:16:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database", "title": "我在生产中删除了一个数据库，并且没有备份", "title_en": "I Deleted a Database in Production And I had no backup", "transed": 1, "url": "https://medium.com/workindia-in/i-deleted-a-database-in-production-be78f1211b93", "via": "", "real_tags": ["数据库", "database"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033024, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据发表在“科学进展”上的一项后续研究，美国对海洋的塑料污染比之前想象的高出五倍。这项研究是2015年研究的续篇，2015年的研究粗略估计了美国的垃圾贡献。新的研究现在显示，2016年美国人向海洋贡献了110万到220万吨塑料。这一数字几乎是2015年估计上限的两倍，比早先预测中的最低估计高出五倍。\n这项研究显示，美国人使用的塑料比以往任何时候都多。这些数据包括他们之前的研究中没有考虑的美国废物出口。该国约88%的废物出口到回收基础设施较差的国家。最近的发展表明，许多出口的塑料垃圾没有经过回收系统，最终进入海洋。\n海洋教育协会(Sea Education Association)主要作者兼海洋学研究教授卡拉·拉文德·劳(Kara Lavender Law)表示：“当你考虑到我们有多少塑料垃圾因为价值低、受到污染或难以加工而实际上无法回收利用时，很多塑料垃圾最终污染了环境就不足为奇了。”\n数据分析是塑料垃圾管理中必须进行的一个重要方面。据达尔豪西大学资源与环境研究学院副教授托尼·沃克(Tony Walker)称，各个城市都缺乏数据标准。研究人员现在强调，当涉及到塑料污染时，需要获得准确的信息。\n据“纽约时报”报道，这个国家只有9%的垃圾进入回收系统。不幸的是，不能保证这些废物真的会变成新的物品。塑料回收已被证明是相当昂贵的，这使得塑料制造商使用回收塑料是不现实的。\n登录您的帐户，即表示您同意我们的使用条款和隐私政策，并同意按照其中所述使用Cookie。\n密码丢了？\n我同意接收来自该网站的电子邮件。我可以随时通过取消订阅来撤回我的同意。\n我同意InHabit的使用条款、隐私政策和其中描述的Cookie政策，我还同意在美国收集、存储和处理我的数据，那里的数据保护法可能与我的国家的不同。", "note_en": "The U.S. is contributing up to five times more plastic pollution to the oceans than previously thought, according to a follow-up study  published in  Science Advances. The study was a sequel to 2015 research, which had given a rough estimate of the waste contribution by the U.S. The new study has now revealed that Americans contributed between 1.1 and 2.2 million metric tons of  plastic to the oceans in 2016. This figure is almost double the higher end of the estimates from 2015 and five times more than the lowest estimates in the earlier predictions.\n   The study has revealed that Americans are using more plastic than ever before. The data included American waste exports that were not accounted for in their previous studies. About 88% of the country’s waste exports goes to countries with poor recycling infrastructure. Recent developments have shown that much of the plastic waste that is exported does not go through recycling systems and ends up in the oceans.\n  “When you consider how much of our plastic waste isn’t actually recyclable because it is low-value, contaminated, or difficult to process, it’s not surprising that a lot of it ends up  polluting the environment,” said Kara Lavender Law, lead author and research professor of oceanography at the Sea Education Association.\n Data analysis is an important aspect that must be employed in the management of plastic  waste. According to Tony Walker, an associate professor at the Dalhousie University School for Resource and Environmental Studies, there is a lack of data standards across municipalities. The researchers are now emphasizing the need to get accurate information when it comes to plastic pollution.\n As reported by The New York Times, only 9% of the country’s total waste goes into the recycling system. Unfortunately, there is no guarantee that such waste will actually be made into new items. Plastic recycling has proven to be quite expensive, making it unrealistic for plastic manufactures to use recycled plastic.\n   By logging into your account, you agree to our  Terms of Use and  Privacy Policy, and to the use of cookies as described therein.\n Lost your password?\n  I agree to receive emails from the site. I can withdraw my consent at any time by unsubscribing.\n I agree to Inhabitat&#39;s  Terms of Use,  Privacy Policy, and to the  Cookie Policy described therein, and I also consent to the collection, storage, and processing of my data in the United States, where data protection laws may be different from those in my country.", "posttime": "2020-11-04 03:16:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,贡献,times,研究", "title": "美国贡献的海洋塑料是之前估计的5倍", "title_en": "U.S. contributes 5 times more ocean plastic than previous estimates", "transed": 1, "url": "https://inhabitat.com/u-s-contributes-5-times-more-ocean-plastic-than-previous-estimates/", "via": "", "real_tags": ["美国", "贡献", "times", "研究"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个过程是自动的。您的浏览器很快就会重定向到您所请求的内容。", "note_en": "This process is automatic. Your browser will redirect to your requested content shortly.", "posttime": "2020-11-04 02:56:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "操作系统,windows,不会,won,重定向", "title": "Windows7不会消亡，仍然是第二大最受欢迎的操作系统", "title_en": "Windows 7 won't die, still second most popular operating system", "transed": 1, "url": "https://www.bleepingcomputer.com/news/microsoft/windows-7-wont-die-still-second-most-popular-operating-system/", "via": "", "real_tags": ["操作系统", "windows", "不会", "won", "重定向"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033022, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Termux是一款Android终端仿真器和Linux环境应用程序，无需启动或设置即可直接运行。自动安装最小基本系统-使用APT软件包管理器可以使用其他软件包。\n安全。从OpenSSH使用ssh客户端访问远程服务器。Termux将标准软件包与精确的终端仿真结合在一个漂亮的开源解决方案中。\n功能齐全。在Bash、Fish或Zsh和Nano、Emacs或Vim之间选择。通过您的SMS收件箱进行grep。使用cURL访问API端点，并使用rsync将联系人列表的备份存储在远程服务器上。\n可定制的。通过Debian和Ubuntu GNU/Linux的APT包管理系统安装您想要的东西。为什么不从安装Git和同步您的dotfile开始呢？\n可探索的。你有没有坐在公交车上想知道tar到底接受哪些论点？Termux中提供的软件包与Mac和Linux上的软件包相同-在手机上安装手册页，在一个会话中阅读，同时在另一个会话中进行实验。\n包括电池在内。你能想象一个比readline驱动的Python控制台更强大但更优雅的袖珍计算器吗？Perl、Python、Ruby和Node.js的最新版本都可用。\n准备好扩大规模了。如果需要，可以连接蓝牙键盘并将您的设备连接到外部显示器-Termux支持键盘快捷键并完全支持鼠标。小叮当。使用Clang编译C文件进行开发，并使用cmake和pkg-config构建您自己的项目。如果遇到问题需要调试，可以使用gdb和strace。", "note_en": "Termux is an  Android terminal emulator and Linux environment app that works directly with no rooting or setup required. A minimal base system is installed automatically - additional packages are available using the APT package manager.\n        Secure. Access remote servers using the ssh client from OpenSSH. Termux combines standard packages with accurate terminal emulation in a beautiful open source solution.\n  Feature packed. Take your pick between Bash, fish or Zsh and nano, Emacs or Vim. Grep through your SMS inbox. Access API endpoints with curl and use rsync to store backups of your contact list on a remote server.\n  Customizable. Install what you want through the APT package management system known from Debian and Ubuntu GNU/Linux. Why not start with installing Git and syncing your dotfiles?\n  Explorable. Have you ever sat on a bus and wondered exactly which arguments tar accepts? Packages available in Termux are the same as those on Mac and Linux - install man pages on your phone and read them in one session while experimenting with them in another.\n  With batteries included. Can you imagine a more powerful yet elegant pocket calculator than a readline-powered Python console? Up-to-date versions of Perl, Python, Ruby and Node.js are all available.\n  Ready to scale up. Connect a Bluetooth keyboard and hook up your device to an external display if you need to - Termux supports keyboard shortcuts and has full mouse support. Tinkerable. Develop by compiling C files with Clang and build your own projects with CMake and pkg-config. Both GDB and strace are available if you get stuck and need to debug.", "posttime": "2020-11-04 02:56:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "android,linux,程序,应用程序", "title": "Termux是一个Android终端仿真器和Linux环境应用程序，没有根", "title_en": "Termux is an Android terminal emulator and Linux environment app with no rooting", "transed": 1, "url": "https://termux.com/", "via": "", "real_tags": ["android", "linux", "程序", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "edf3f1574755f63b2d8d611153fb3e0e.jpeg", "infoid": 1033021, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，数据基础设施公司Segment是一家价值数十亿美元的企业，以管理从IBM到Glossier的大型品牌的客户数据而闻名。10月份，云通信提供商Twilio宣布将以32亿美元的股票收购Segment。\n但不到十年前，Segment的创始人彼得·莱因哈特(Peter Reinhardt)、卡尔文·弗兰奇-欧文(Calvin French-Owen)和伊利亚·沃罗达斯基(Ilya Volodarsky)还是麻省理工学院(MIT)的大学生，他们住在同一个宿舍里，头脑风暴着他们可以开发的产品，以启动自己的初创企业。\n这对朋友似乎有一条几乎是童话般的成功之路-他们想出了成立一家科技初创公司的想法，被著名的硅谷初创企业加速器Y Combinator录取，并在2011年用60万美元的资金创办了一家企业。\n尽管如此，并不是所有的事情都像计划的那样。以下是Segment的联合创始人在取得成功方面学到的三个教训。\n法国莱因哈特--欧文和沃洛达克西并不是从梦想成为企业家开始的。事实上，在麻省理工学院之前，这些朋友对初创企业文化知之甚少。直到他们开始阅读Y Combinator联合创始人保罗·格雷厄姆的文章，并在2010年一起上了一门名为“创始人之旅”的课程，这颗种子才播下。\n直到他们冒了一个令人尴尬的风险，这个梦想似乎才有可能成为现实。\n每周，在麻省理工学院创始人之旅的课堂上，这位成功初创企业的创始人都会发表演讲，回答学生的问题。第一堂课的嘉宾演讲者是电子邮件软件公司Xobni(向后拼写的收件箱)和机器学习公司Kite的创始人亚当·史密斯(Adam Smith)。法国莱因哈特--欧文和沃罗达斯基对史密斯非常敬畏，史密斯也曾就读于麻省理工学院(根据他在LinkedIn上的个人资料，两年半就毕业了)，并于2006年在Y Combinator创立了Xobni。\n莱因哈特说，史密斯的来信让莱因哈特、弗伦奇-欧文和沃尔达斯基彻底崩溃了。见到一位令人惊叹的创始人真是太棒了。\n课程结束时，沃洛达斯基有了一个不同寻常的想法：如果我们邀请亚当回宿舍喝杯啤酒呢？起初，莱因哈特觉得这样做会很尴尬，但沃洛达斯基还是这么做了。让朋友们大吃一惊的是，史密斯答应了。\n在那一刻，莱因哈特感觉到了(与史密斯)感情距离的巨大崩溃，他回忆道。这就像，哇，创始人也是普通人。他们做的是正常的事情。也许我们真的可以成为创始人。\n在与史密斯、莱因哈特、弗伦奇-欧文和沃罗达斯基进行了一次观点转变的会面后，他们在本学年剩下的时间里一直在努力打造能够用来创办公司的产品。到了2011年春天，朋友们萌生了制作课堂讲课工具的想法，它可以让学生向教授指出任何困惑之处。他们称其为Segment，并将其应用于Y组合器(Y Combinator)。\n在麻省理工学院还剩一年的时候，朋友们休了一年假，搬进了旧金山的一套三居室公寓，开始生活和工作，以启动他们的业务。莱因哈特成为首席执行官，弗伦奇-欧文担任首席技术官，沃罗达斯基担任总裁，他们还请来了另一位朋友，罗德岛设计学院的学生伊恩·斯托姆·泰勒担任首席设计师。\n但是，尽管Y Combinator的天使投资人和团队的专注力提供了大约60万美元的种子资金，但在他们于那年秋天推出这个讲座工具后，它还是失败了。学生们没有按预期使用该产品--一旦他们上了电脑，他们就开始上网，分心听课。\n很明显，这是行不通的。因此，我们关闭了它，召回了所有的投资者，莱因哈特说。\n莱因哈特说，事实上，Y Combinator最近让我们发现，他们其实并不太看重这个想法，但认为我们是一个很好的团队。因此，联合创始人能够留住除两名投资者之外的所有投资者。\n从2011年秋季到2012年冬季，两位联合创始人每周工作80到100个小时，为Segment创造了一款新产品，Segment是一款网络分析工具，公司可以更好地了解客户的行为。\n但莱因哈特说，这也是一场灾难。事实证明，这是一个非常非常拥挤的市场。\n我们花了一年半的时间。我们在银行里还剩10万美元。我们意识到我们还有一次机会，莱因哈特说。\n联合创始人们用剩下的钱抓住了可能是他们最后的机会，停了下来，开始反思他们在Y Combinator学到了什么。莱因哈特说，他们决定把重点放在建造一些我们可以快速测试的用途上。\n除了两名投资者外，所有投资者都还在，团队决定发布他们创建的内部编程工具的一个版本，以构建他们之前的产品，他们称之为Analytics.js。在团队将Analytics.js分享到开源开发平台GitHub之后，Analytics.js在开发人员中变得越来越受欢迎。在注意到它是如何被使用的之后，泰勒建议他们将其商业化，并将其作为该细分市场的产品。\n伊恩说，你知道吗，我认为Analytics.js背后有一笔大生意，我认为我们应该这么做，莱因哈特说。泰勒告诉团队，他们应该调整他们的编程工具，创建一个简单的分析应用程序编程接口(API)，可以用来从任何平台收集数据的分析。\n一开始，莱因哈特完全不同意泰勒的观点，他说，他觉得这是有史以来最糟糕的想法。我不认为它有什么价值。所以，我们四个创始人都大吵了一架。\n在这一点上，我们处于一个非常螺旋式下降的状态。我们有六八个月的跑道。莱因哈特说，在这一点上，我们非常接近死亡螺旋。\n为了确定泰勒是否正确，团队决定在Y Combinator运营的开发者社区Hacker News上推出Segment，以测试它是否会成功。莱因哈特说，令莱因哈特惊讶的是，成千上万的人对这款产品感兴趣，许多人伸出援手，要求获得它。\n这次发布对我个人来说是一个非常具有决定性的时刻，因为它如此鲜明地证明了我的直觉在现实世界中可能是完全错误的，莱因哈特在GrowthHacker的一次会议上说。\n而且这也不是该团队最后一次考虑反馈。莱因哈特说，例如，2016年，Segment根据客户反馈推出了两款产品，分别名为Warehouse(帮助客户收集和存储第一方客户数据)和Sources(帮助分析这些数据)。根据莱因哈特的说法，这些产品的收入翻了两番。\n这是你只有通过与客户交谈才能获得的那种清晰度。他说，要做到这一点，靠的不是凭直觉。\n莱因哈特在2019年1月告诉“旧金山商业时报”(The San Francisco Business Times)，到2019年1月，该公司已经筹集了2.84亿美元的风险投资，并带来了数千万美元的年收入。", "note_en": "Today, data infrastructure company Segment is a multibillion-dollar business, known for managing the customer data of huge brands from IBM to Glossier. In October, cloud communications provider Twilio announced it is acquiring Segment for  $3.2 billion in stock.\n But less than a decade ago, Segment founders Peter Reinhardt, Calvin French-Owen and Ilya Volodarsky were college kids at Massachusetts Institute of Technology (MIT), living in the same dorm and brainstorming products they could build to launch their own start-up.\n  It seems like the friends had a practically fairytale road to success — they came up with an idea for a tech start-up, were accepted to famous Silicon Valley start-up accelerator Y Combinator and in 2011 launched a business with $600,000 in funding.\n Still, not everything went as planned. Here are three lessons Segment&#39;s co-founders learned about achieving success.\n  Reinhardt, French-Owen and Volodarksy didn&#39;t start out dreaming of being entrepreneurs. In fact, before MIT, the friends didn&#39;t know much about start-up culture. It wasn&#39;t until they started reading  essays by Y Combinator co-founder Paul Graham and took a class together called &#34;The Founder&#39;s Journey&#34; in 2010 that the seed was planted.\n And it wasn&#39;t until they took an embarrassing risk that the dream seemed like it could be a reality.\n Each week in their MIT &#34;Founder&#39;s Journey&#34; class, the founder of a successful start-up would speak and answer students&#39; questions. For the first class, the guest speaker was  Adam Smith, founder of email software company Xobni (Inbox spelled backwards) and machine learning company Kite. Reinhardt, French-Owen and Volodarsky were &#34;totally in awe&#34; of Smith, who also attended MIT (and graduated in two-and-a-half years, according to his  LinkedIn profile) and founded Xobni at Y Combinator in 2006.\n  Hearing from Smith left Reinhardt, French-Owen and Volodarsky &#34;totally floored,&#34; Reinhardt says. &#34;It was so amazing meeting an amazing founder.&#34;\n At the end of the class, Volodarsky had an unconventional idea: &#34;&#39;What if we just invite Adam back to the dorm for a beer?&#39;&#34; Initially, Reinhardt felt it would be &#34;embarrassing&#34; to ask, but Volodarsky did so anyway. To the friends&#39; surprise, Smith said yes.\n  In that moment, Reinhardt felt &#34;this massive collapse of feeling distance [from Smith],&#34; he recalled. &#34;It&#39;s like, &#39;Wow, a founder is a normal person too. They do normal things. And maybe we could actually be founders.&#39;&#34;\n  After their perspective-changing meeting Smith, Reinhardt, French-Owen and Volodarsky spent the rest of the school year trying to build products with which they could start a company. By the spring of 2011, the friends had landed on the idea for a &#34;classroom lecture tool&#34; that would let students flag any points of confusion to professors. They called it Segment and applied to Y Combinator.\n  With a year left at MIT, the friends took a leave of absence and moved into a three-bedroom apartment in San Francisco to live and work to get their business off the ground. Reinhardt became CEO; French-Owen, CTO; Volodarsky, president; and they brought on another friend, Ian Storm Taylor, a student at the Rhode Island School of Design, to be lead designer.\n But despite about $600,000 in seed money from Y Combinator&#39;s angel investors and the team&#39;s singular focus, after they launched the lecture tool that fall, it failed. Students didn&#39;t use the product as intended — once they got onto their computers, they started surfing the internet and were distracted from the lecture.\n &#34;It was pretty obvious that it was not going to work. So, we shut it down and called back all the investors,&#34; Reinhardt says.\n In fact, &#34;Y Combinator let us find out recently that they actually didn&#39;t think much of the idea, but thought we were a good team,&#34; Reinhardt says. As a result, the co-founders were able to retain all but two investors.\n Between fall 2011 and winter 2012, the co-founders worked 80 to 100 hours a week creating a new product for Segment — a web analytics tool for companies to better understand their customers&#39; behavior.\n But &#34;that was also a disaster,&#34; Reinhardt says. &#34;Turns out it&#39;s a very, very crowded market.&#34;\n &#34;We were a year and a half in. We had $100,000 left in the bank. We realized that we had one more shot,&#34; says Reinhardt.\n   Taking what could be their last chance with the money they had left, the co-founders paused and started to reflect on what they were taught at Y Combinator. They decided to focus on &#34;building something for uses that we could test quickly,&#34; Reinhardt says.\n With all but two investors still on board, the team decided to release a version of the internal programming tool they had created build their previous products, which they had called Analytics.js. Analytics.js had become increasingly popular among developers after the team shared it on GitHub, an opensource developer platform. After noticing how it was being used, Taylor recommended they take it commercial and make that Segment&#39;s product.\n &#34;Ian was like, &#39;You know what, I think there&#39;s a big business behind  Analytics.js and I think we should do that instead,&#39;&#34; Reinhardt says. Taylor told the team they should adjust their programming tool and create a simple analytics Application Programming Interface, or API, that could be used to collect analytics data from any platform.\n At first, Reinhardt completely disagreed with Taylor and felt it was &#34;the worst idea of all time,&#34; he says. &#34;I didn&#39;t think there was much value in it. So, we had a huge fight, all four of us founders.&#34;\n &#34;We were in a pretty downward spiral at that point. We had six or eight months of runway. We were pretty close to a death spiral at that point,&#34; Reinhardt says.\n To decide whether Taylor was correct, the team decided to launch Segment on Hacker News, a developer community run by Y Combinator, to test whether it&#39;d be successful or not. To Reinhardt&#39;s surprise, thousands of people were interested in the product and many reached out &#34;demanding&#34; access to it, he says.\n  &#34;The launch was a pretty defining moment for me personally since it was such stark proof that my intuition could be completely wrong in the real world,&#34; Reinhardt said during a  GrowthHackers &#34;Ask Me Anything&#34; session.\n And it wasn&#39;t the last time the team considered feedback. For example, in 2016, Segment launched two products called Warehouses (which helps customers collect and store first-party customer data) and Sources (which helps analyze that data) &#34;as a result of customer feedback,&#34; Reinhardt says. The products &#34;quadrupled revenue,&#34; according to Reinhardt.\n &#34;That&#39;s the sort of clarity that you only get by talking to customers. You don&#39;t get that by trying to be intuitive,&#34; he said.\n By 2019, the company had raised $284 million in venture capital funding and was bringing in &#34; tens of millions of dollars in annual revenue,&#34; Reinhardt  told the San Francisco Business Times in January 2019.", "posttime": "2020-11-04 02:56:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,大学生,college,创始人", "title": "麻省理工学院大学生创立了价值数十亿美元的公司Segment", "title_en": "MIT college kids founded multibillion-dollar company Segment", "transed": 1, "url": "https://www.cnbc.com/2020/11/03/segment-co-founder-and-ceo-this-is-how-we-built-a-multibillion-dollar-company-from-t.html", "via": "", "real_tags": ["大学", "大学生", "college", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "轻松存储和管理私有容器镜像。", "note_en": "Easily store and manage private container images.", "posttime": "2020-11-04 02:56:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "container,存储", "title": "DigitalOcean Container Registry现已正式上市", "title_en": "DigitalOcean Container Registry Now GA", "transed": 1, "url": "https://www.digitalocean.com/products/container-registry/", "via": "", "real_tags": ["container", "存储"]}, {"category": "", "categoryclass": "", "imagename": "1346c439543b191a1661181c7f32444d.jpg", "infoid": 1033019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "旅行者2号宇宙飞船已经离开地球超过43年了，现在它位于距离我们星球125个天文单位的地方。这是地球和太阳之间距离的125倍。\n可以理解的是，这个距离使得NASA与其遥远的航天器进行通信变得相当困难-存在超过17个小时的时间延迟。然而，对于旅行者2号，与航天器交谈还有另一个复杂的问题。\n在飞越木星、土星和天王星之后，旅行者2号于1989年8月最后一次飞越海王星。科学家们也对飞越海王星有趣的卫星海王星感兴趣，所以他们命令旅行者2号在超越海王星的途中飞越海王星的北极海王星。这条轨道将它带向相对于太阳系平面向南的路径，并一直在向南预订。\n这对与美国国家航空航天局(NASA)的地球深空网络通信产生了影响，该网络由加州、西班牙和澳大利亚的三个位于世界各地的大型无线电天线设施组成。通常情况下，这种地理分布使得NASA所有仍然活跃的航天器都有能力随时与这些设施中的至少一个进行通信。\n但由于旅行者2号已经俯冲到太阳系飞机以南太远的地方，它现在只能通过视线与澳大利亚堪培拉70米宽的天线进行通信。由于这个设施大约有五十年的历史，从三月份开始需要进行翻新和升级工作，从那时起就一直处于离线状态。这项工作预计将在2月份结束，因此自那时以来，NASA一直无法向旅行者2号发送信号。\n上周，为了测试最近安装在大型碟子上的新硬件，旅行者号任务经理自3月份以来首次能够向航天器发送一系列信号。航天局说，旅行者2号回复说，它确实收到了信号，并执行了NASA的命令。\n这对NASA和整个科学都是有利的，因为旅行者2号(和旅行者1号)现在正冒险走出太阳系，进入星际空间。在大黑之外，旅行者2号将继续返回关于星际介质中带电粒子的速度、密度、温度和压力的数据。", "note_en": "The Voyager 2 spacecraft has been gone from Earth for more than 43 years, and it now lies 125 astronomical units from our planet. That is 125 times the distance between the Earth and Sun.\n Understandably, this distance makes it rather difficult for NASA to communicate with its far-flung spacecraft—there is a time delay of more than 17 hours. However, with Voyager 2, there is another complication in talking to the spacecraft.\n  After flying by Jupiter, Saturn, and Uranus, Voyager 2 made its final planetary flyby in August 1989 past Neptune. Scientists were also interested in flying by Neptune&#39;s intriguing moon Triton, so they commanded Voyager 2 to do so on its way beyond Neptune, flying over the north pole of Triton. This trajectory carried it along a southward path relative to the plane of the Solar System, and it has kept on booking it south.\n This has consequences for communicating with NASA&#39;s Deep Space Network on Earth, which consists of three large radio antenna facilities around the world, in California, Spain, and Australia. Typically, this geographical spread allows for all of NASA&#39;s spacecraft still active to have the capability to communicate with at least one of these facilities at all times.\n But because Voyager 2 has dipped so far south of the plane of the Solar System, it can now only communicate by line of sight with the 70-meter-wide antenna in Canberra, Australia. Because this facility is about five decades old, it needed to  undergo refurbishment and upgrade work beginning in March, and it had been offline since that time. This work is expected to conclude in February, so NASA has been unable to send signals to Voyager 2 since that time.\n Last week, to test new hardware recently installed on the large dish, Voyager mission managers were able to send a series of signals to the spacecraft for the first time since March. Voyager 2 replied that it had, indeed, received the signals and executed NASA&#39;s commands,  the space agency says.\n That&#39;s good for NASA and science in general, as Voyager 2 (along with Voyager 1) is now venturing beyond the Solar System, into interstellar space. Out in the great black beyond, Voyager 2 will continue to return data about the speed, density, temperature, and pressure of charged particles in the interstellar medium.", "posttime": "2020-11-04 02:42:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,呼叫,calls", "title": "NASA呼叫旅行者2号，宇宙飞船从星际空间应答", "title_en": "NASA calls Voyager 2, and the spacecraft answers from interstellar space", "transed": 1, "url": "https://arstechnica.com/science/2020/11/nasa-calls-voyager-2-and-the-spacecraft-answers-from-interstellar-space/", "via": "", "real_tags": ["nasa", "呼叫", "calls"]}, {"category": "", "categoryclass": "", "imagename": "3136252c16f8f39a17c9f451bf489b52.jpg", "infoid": 1033018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hulu说，值得注意的是，这将是第一次启用Watch Party的现场活动。\n观看派对功能于5月份首次亮相，为Hulu的“无广告”订阅者提供了一种在一起观看节目的同时在Hulu应用程序中聊天的方式。在发布时，Hulu从其点播流媒体库中提供了数千部电影和节目供共同观看。\n这种社交观看体验在冠状病毒爆发期间变得流行起来，因为家人和朋友都呆在家里，隔离和社交距离。今天，有与一系列流媒体服务合作的协同观看服务，包括Netflix、HBO、Amazon Prime Video等。但只有一些提供本地体验，就像Hulu一样。\n有了Watch Party，用户可以在他们选择的节目流的同时，在屏幕右侧的侧边栏中进行群聊。该功能还允许用户在自己的计算机上控制点播视频播放，而不会中断群的体验，然后单击一个按钮在稍后恢复与群的同步。\n今年9月，Hulu也将Watch Party扩展到了有广告支持的观众，甚至为其原创节目“PEN15”的观众测试了定制体验。\n但是，只有点播客户才能访问Watch Party，以便与2020年选举覆盖一起使用。\nHulu在3月份与美国广播公司新闻直播(ABC News Live)合作，以应对新冠肺炎疫情。该公司希望确保其剪线点播客户可以全天候收看实时新闻，即使他们不为带有Live TV的Hulu升级版付费。该公司表示，其广告支持的观众中有近50%是有线电视切割者，甚至是不喜欢有线电视的人-这意味着他们从一开始就没有签约有线电视或卫星电视。\n该公司在10月初宣布，还将通过ABC News Live合作伙伴关系向这些观众提供现场选举报道。", "note_en": "Notably, this will be the first time Watch Party has been enabled for a live event, Hulu says.\n The Watch Party feature  first debuted in May as a way to give Hulu’s “No Ads” subscribers a way to chat with one another in the Hulu app while watching programs together. At launch, Hulu made thousands of movies and shows available for co-viewing from its on-demand streaming library.\n  This sort of social viewing experience had become popular during the coronavirus outbreak as families and friends were staying at home, quarantining and social distancing. Today, there are co-viewing services that work with a range of streaming services, including  Netflix,  HBO,  Amazon Prime Video, and others. But only some offer native experiences, like Hulu does.\n With Watch Party, users can group chat in a sidebar to the right of the screen as their program of choice streams. The feature also allowed users control the on-demand video playback on their own computer without interrupting the group’s experience, then click a button to get back in sync with the group at a later point.\n In September,  Hulu expanded Watch Party to its ad-supported viewers, too, and even tested a customized experience for viewers of its original program, “Pen15.”\n However, only on-demand customers will have access to Watch Party for use with Election 2020 coverage.\n Hulu  partnered with ABC News Live in March in response to the COVID-19 pandemic. The company wanted to ensure its cord cutting on-demand customers had access to live news 24/7, even if they didn’t pay for the upgraded version of Hulu with Live TV. The company says that nearly 50% of its ad-supported viewers were cord cutters or even “cord nevers” — meaning they never signed up for cable or satellite TV in the first place.\n The company  announced earlier in October that it would also offer live election coverage to these viewers through the ABC News Live partnership.", "posttime": "2020-11-04 02:38:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "watch,live,hulu", "title": "\nHulu用选举新闻直播流测试其社交观看功能Watch Party", "title_en": "\n\t\t\t\tHulu tests its social viewing feature, Watch Party, with election news live streams\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/hulu-tests-its-social-viewing-feature-watch-party-with-election-news-live-streams/", "via": "", "real_tags": ["watch", "live", "hulu"]}]