[{"category": "", "categoryclass": "", "imagename": "f7a6895946443c81347d4a59c27eda22.jpg", "infoid": 1032960, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是第二次世界大战的巅峰时期，一架B-17轰炸机正独自飞越德国领土。通常的轰炸机护送人员抛弃轰炸机是有原因的。炸弹..。", "note_en": "It is the peak of World War II. A B-17 bomber is flying over German territory, Alone. The usual Bomber escorts have deserted the bomber for a reason. The bom...", "posttime": "2020-11-03 21:45:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,战斗机,fighter,轰炸机", "title": "二战期间，一架德国战斗机护送一架美国轰炸机安全抵达", "title_en": "German fighter escorted a US bomber to safety in World War II", "transed": 1, "url": "https://www.youtube.com/watch?v=7bJei2exm2c", "via": "", "real_tags": ["美国", "战斗机", "fighter", "轰炸机"]}, {"category": "", "categoryclass": "", "imagename": "d8a7d416c26985edffd4e571df3ecee6.png", "infoid": 1032959, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你在过去的10年里浏览过网络，那么你看到的cookie横幅就会比你应得的要多！\n作为2011年欧盟Cookie法的变通办法，Cookie同意横幅已经变得如此常见，以至于大多数人甚至懒得看它们，或者只是在所有东西上点击接受。\n在我看来，“饼干法”的目的是阻止网站在你的浏览器中存储数据，除非他们绝对需要，要求他们提示访问者同意。最终目标是让你更好地控制你的在线隐私，停止不必要的跟踪，并让网站所有者对他们正在做的事情三思而后行。简而言之，这是一个用心良苦的想法。\n然而，基本上，世界上所有的网站都采取了更简单、不那么内省的方式--征得同意--为每个人创造了客观上更糟糕的网络体验。\n因为在“让我一个人呆着”网站上，我们正在努力树立一个如何经营隐私友好型公司的榜样，所以我们决定想办法在不牺牲任何重要东西的情况下，从我们的登录页面上删除所有的cookie。这意味着不再有cookie横幅，不再跟踪！🍪。\n在我们开始之前，我不一定要说我不信任这些公司，不信任他们使用cookie的方式……所以你可以对他们做出自己的判断。我们来这里只是为了得到免费的饼干！\n像大多数网站一样，为了跟踪我们的页面浏览量和一般访问者行为，我们使用了谷歌分析(Google Analytics)。\nGoogle Analytics将页面加载时的小cookie设置为记住访问者在网站浏览时在每个页面上所做的事情。这使得它可以创建访问者的个人资料，这样你就可以准确地计算出需要什么才能让访问者注册或转换，或者任何你试图衡量的东西。\n实际上，我们从来没有真正使用过这些信息，所以很容易去掉它。实际上，有几个更简单的网络分析平台不使用Cookie，我们选择了尝试Simple Analytics。有了这一点，我们基本上得到了我们从Google Analytics(页面浏览量)获得的所有信息，所以这似乎是一个很好的折衷方案。\n你甚至可以将你的分析页面公之于众，这非常符合我们的开放式创业公司的职业道德。例如，您可以在此处查看此博客帖子的统计数据！\n拥有烦人的聊天小部件是SaaS主页的另一件常见事情。为此，我们过去常常使用Crisp，它使用Cookie将浏览器会话与其系统中的消息进行匹配。他们的隐私政策规定，这不是用于跟踪目的，但考虑到他们在UI中显示的所有关于访问者的数据，这并不是很舒服。\n(它甚至猜测访问者的大量个人信息，比如他们在哪家公司工作，以及他们的职称，使用一种名为Crisp rich的东西，这种东西显然不可能找到任何信息，但听起来像地狱一样阴暗)。\n因此，这是头等大事，因为它看起来像是一个绝对的隐私和跟踪噩梦。\n我知道这很难，但是我们确实找不到可以做到这一点的无cookie(或者甚至是轻微关注隐私)的服务，所以我们最终大量修改了一个名为Intergram的开源项目来做我们想做的事情。Intergram的工作原理与普通聊天小工具类似，但它通过自托管服务器与聊天应用Telegram进行通信--这意味着至少我们可以控制代码。我们修改后的聊天小部件现在看起来如下所示(并且代码是开源的)；\n不幸的是，它仍然需要一些地方在本地存储消息，以便访问者拥有它们的副本，但我们仍然做到了这一点，只在聊天打开后才存储任何内容。与Crisp不同的是，Crisp会在它想要的时候给它注入饼干。我们也不像Crisp那样收集任何跟踪垃圾，只收集聊天消息！\n我们通过向聊天小部件本身添加同意提示来增加交易的甜头，如下所示；\n这是一个棘手的问题。我们使用Cloudflare作为安全层来保护网站免受拒绝服务攻击。我们还使用他们的CDN来缓存我们的资产，以便网站加载得更快，并使用他们的DNS，因为这非常方便。\n为了执行它们的保护，Cloudflare存储了一个名为_cfduid的cookie，它用于跟踪每个客户端，并以某种方式确定它们是恶意行为者还是其他什么。我真的不知道，他们的描述一清二楚。不管它做什么，它都得搬走。\n我真的不知道从哪里开始做这件事，所以我发了一条推特，收到了一位在那里工作的系统工程师的回复：\n这有点不是一个答案，因为企业计划每月花费200美元，而且我的麻烦最终只有更少的功能。\n因为我们实际上从来没有使用过Cloudflare保护，所以我的解决方案是完全禁用Cloudflare转发，并切换到合适的CDN提供商。您可以通过单击DNS设置上的云图标切换到仅DNS&#34；来执行此操作：\n这意味着我们现在只将Cloudflare用于DNS。但是，如果我们发现自己受到攻击，可以再次按下这个按钮并暂时重新启用Cloudflare转发，所以我认为这是一个很好的选择。\n对于CDN提供商，我们决定推荐使用BunnyCDN。事实上，这项服务给我留下了深刻的印象，与Cloudflare相比，一切都感觉更快了，而且更容易知道发生了什么，这是我喜欢的。另外，因为它只是一个CDN文件，所以当然没有cookie！\n网站现在没有加载cookie，如果访问者打开聊天小部件，就会使用一些存储空间，我认为这是一个相当成功的结果！\n你可以在这里查看它，你会注意到那里没有饼干横幅让你恼火，它几乎就像是回到了过去；)。\n如果你喜欢这篇文章，那就看看我的推特吧。我把我的空闲时间花在推特上，说我多么讨厌反隐私的网络做法和糟糕的邮件列表电子邮件。那里见！\n如果你像讨厌饼干横幅一样讨厌垃圾邮件，那就看看我的服务吧，别管我。有了它，你可以在一个地方看到所有的邮件列表，只需点击一下就可以取消订阅。", "note_en": "If you&#39;ve browsed the web in the last 10 years then you&#39;ll have seen more than your fair share of cookie banners!\n Intended as a workaround to the  2011 EU Cookie Law, cookie consent banners have become so commonplace that most people  don&#39;t even bother to look at them, or just click accept on everything.\n    As I see it, the purpose of the Cookie Law was to  stop websites from storing data in your browser unless they absolutely needed to, by requiring them to prompt their visitors for consent. The end goal being to give you more control over your online privacy, stop needless tracking, and make website owners think twice about what they were doing. In short - a good intentioned idea.\n However, basically every website in the world took the easier, less introspective approach - prompting for consent - creating an objectively worse web experience for everyone.\n Since at  Leave Me Alone we&#39;re trying to set an example of how to run a privacy friendly company, we decided to figure out how we could remove all the cookies from our landing page without sacrificing anything important. This means no more cookie banner, no more tracking! 🍪\n   Before we start, I&#39;m not neccessarily saying I distrust any of these companies and how they use cookies...so make your own judgement about them. We&#39;re just in this to get cookie free!\n  To track our page views and general visitor behaviour, like  most sites, we were using Google Analytics.\n Google Analytics sets a little cookie on page load to &#34;remember&#34; what a visitor has done on each page as they navigate around a site. This allows it to create a profile of the visitor so you can figure out exactly what it takes to get a visitor to sign up or convert, or whatever it is that you&#39;re trying to measure.\n Realistically we never really use this information, so it&#39;s an easy one to get rid of. There are actually a handful of simpler web analytics platforms that don&#39;t use cookies, and we opted to try  Simple Analytics. With this we get basically all the info we ever got out of Google Analytics (page views), so it seems like a great compromise.\n You can even make your analytics pages public, which fits nicely with our &#34; open startup&#34; work ethic. For example you can view the stats for this  blog post here!\n     Having an annoying chat widget is another common thing for a SaaS homepage. We used to use Crisp for this, which uses a cookie to match a browser session to messages in their system. Their  privacy policy says this is &#34;not used for tracking purposes&#34;, but given all the data they show in their UI about visitors that&#39;s not exactly much comfort.\n (It even guesses a load of personal info from the visitors&#39; email address like what company they work for and their job title using something called  Crisp Enrich which is apparently impossible to find any info about but sounds shady as hell).\n  So, this is a top priority since it looks like an absolute privacy and tracking nightmare.\n I get that this is a difficult one, but there&#39;s literally no service we could find to do this cookieless (or even mildly privacy focused) so we ended up heavily modifying an open-source project called  Intergram to do what we wanted. Intergram works like a regular chat widget, but it communicates with the chat app Telegram via a self-hosted server - meaning at least we&#39;re in control of the code. Our modified chat widget now looks like this (and the code is  open-source);\n  Unfortunately it still requires some place to store the messages locally so that the visitor has a copy of them, but we still made this work by only storing anything  after the chat has been opened. Unlike Crisp that injected it&#39;s cookies when it felt like it. We also don&#39;t collect any tracking crap like Crisp does, only chat messages!\n We sweetened the deal by adding a consent prompt to the chat widget itself like this;\n    This was a tricky one. We use Cloudflare as a security layer to protect the website from denial-of-service attacks. We also use their CDN to cache our assets so that the site loads extra fast, and use their DNS because it&#39;s hella convenient.\n To perform their protection Cloudflare stores a cookie called   _cfduid,  which is used to track each client and somehow figure out if they&#39;re a malicious actor or something. I don&#39;t really know and  their description is clear as mud. Whatever it does, it&#39;s got to go.\n I didn&#39;t really know where to start with this one, so  I tweeted about it and got a reply from a systems engineer that works there:\n  Which is a bit of a non-answer, since the Enterprise plan costs $200/month and I&#39;d end up with fewer features for my trouble.\n Since we&#39;ve never actually had to use Cloudflare protection, my solution was to disable Cloudflare forwarding completely and switch to a proper CDN provider. You can do this by clicking the cloud icon on the DNS settings switching to &#34;DNS only&#34;:\n  This means we are now just using Cloudflare for DNS. But it&#39;s possible to hit this button again and  re-enable Cloudflare forwarding temporarily if we find ourselves under attack, so I figure this is a good option.\n For a CDN provider we decided on recommendation to check out  BunnyCDN. I&#39;m actually really impressed by this service, compared to Cloudflare everything feels a bit faster and it&#39;s easier to know what&#39;s going on, which I like. Also since it&#39;s just a file CDN there are zero cookies of course!\n   The website now has no cookies on load, with some storage being used if a visitor opens the chat widget, which I think is a pretty successful outcome!\n  You can check it out  here, you&#39;ll notice there&#39;s no cookie banner to annoy you, it&#39;s almost like stepping back in time ;)\n   If you enjoyed this post then check out  my Twitter. I spend my free time tweeting about how much I hate anti-privacy web practices and crappy mailing list emails. See you there!\n   If you hate spam emails as much as cookie banners then check out my service  Leave Me Alone. With it you can see all your mailing lists in one place and unsubscribe from them with a single click.", "posttime": "2020-11-03 21:45:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "saas,homepage,访问者", "title": "我们如何让SaaS主页无Cookie", "title_en": "How we made our SaaS homepage cookie-free", "transed": 1, "url": "https://blog.leavemealone.app/no-more-cookies/", "via": "", "real_tags": ["saas", "homepage", "访问者"]}, {"category": "", "categoryclass": "", "imagename": "8bc432aef2220279ac425c3537217f8f.jpg", "infoid": 1032958, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约60万年前，人类一分为二。有一群人留在了非洲，进化成了我们。另一个人从陆路击倒，进入亚洲，然后是欧洲，成为尼安德塔尔人-尼安德特人。他们不是我们的祖先，而是平行进化的姐妹物种。\n尼安德特人之所以让我们着迷，是因为他们告诉我们关于我们自己的事情--我们是谁，我们可能会成为什么样的人。人们很容易看到他们以田园诗般的方式，与大自然和彼此和平共处，就像花园里的亚当和夏娃一样。\n如果是这样的话，也许人类的弊病--特别是我们的领土、暴力、战争--不是与生俱来的，而是现代的发明。\n生物学和古生物学描绘了一幅更黑暗的图景。尼安德特人远不是和平的，他们很可能是熟练的战士和危险的战士，只有现代人才能与之匹敌。\n掠食性陆地哺乳动物是地域性的，特别是群居猎人。就像狮子、狼和智人一样，尼安德特人也是合作的大型动物猎人。这些位于食物链顶端的捕食者本身几乎没有捕食者，因此人口过剩导致了狩猎场的冲突。尼安德特人面临着同样的问题；如果其他物种不能控制他们的数量，冲突就会发生。\n这种领地在人类中有很深的根基。领土冲突在我们的近亲黑猩猩身上也很激烈。雄性黑猩猩经常联合起来攻击和杀死来自敌对乐队的雄性黑猩猩，这一行为与人类战争惊人地相似。\n这意味着700万年前，黑猩猩和我们人类的共同祖先共同进化出合作攻击性。如果是这样的话，尼安德特人将继承这些合作侵略的相同倾向。\n战争是人类固有的一部分。战争不是现代的发明，而是我们人类古老的、基本的一部分。从历史上看，所有的人都在打仗。我们最古老的著作充满了战争故事。考古学揭示了数千年前的古代堡垒和战斗，以及史前大屠杀的地点。\n战争是人之常情--尼安德特人和我们非常相似。我们在头骨和骨骼解剖上非常相似，并且有99.7%的DNA相同。\n在行为上，尼安德特人与我们惊人地相似。他们生火，埋葬他们死去的贝壳和动物牙齿制成的珠宝，制作艺术品和石头神殿。如果尼安德特人有这么多和我们一样的创造本能，那么他们很可能也有很多和我们一样的破坏性本能。\n尼安德特人是熟练的大型动物猎手，他们用长矛猎杀鹿、麋鹿、麋鹿、野牛，甚至犀牛和猛犸象。令人难以置信的是，如果他们的家人和土地受到威胁，他们会犹豫是否使用这些武器。考古学表明，这样的冲突是司空见惯的。\n史前战争留下了可以说明问题的迹象。棍棒击中头部是一种有效的杀戮方式-棍棒是快速、强大、精确的武器-所以史前智人经常表现出头骨的创伤。尼安德特人也是如此。\n战争的另一个迹象是护栏骨折，这是由于躲避打击而导致的小臂骨折。尼安德特人也有很多手臂骨折。至少有一名来自伊拉克沙尼达洞穴的尼安德特人被长矛刺中胸部。\n创伤在年轻的尼安德特人男性中尤其常见，死亡也是如此。一些伤害可能是在狩猎中造成的，但这些模式与参与部落间战争的民族所预测的模式相匹配-规模较小但激烈的旷日持久的冲突，以游击式突袭和伏击为主的战争，以及更罕见的战斗。\n战争以领土边界的形式留下了更微妙的印记。尼安德特人不仅打仗，而且擅长战争，最好的证据就是他们遇到了我们，但没有立即被攻占。相反，在大约10万年的时间里，尼安德特人抵制现代人的扩张。\n要不然我们为什么要花这么长时间才离开非洲？不是因为环境恶劣，而是因为尼安德特人已经在欧洲和亚洲蓬勃发展。\n现代人与尼安德特人相遇，并决定只活下去，让他们活下去，这是极不可能的。如果没有其他因素，人口增长不可避免地迫使人类获得更多的土地，以确保有足够的领土为他们的孩子狩猎和觅食。\n相反，几千年来，我们必须测试他们的战士，而几千年来，我们一直在失败。在武器、战术、战略上，我们势均力敌。\n尼安德特人可能拥有战术和战略优势。他们占领中东长达数千年之久，毫无疑问，他们对那里的地形、季节以及如何靠当地的动植物为生有了深入的了解。\n在战斗中，他们巨大而强壮的体格一定使他们在近距离战斗中成为了毁灭性的战士。他们的大眼睛可能给了尼安德特人优越的微光视力，让他们在黑暗中进行伏击和黎明突袭。\n最后，僵局被打破，潮流也随之改变。我们不知道为什么。更好的远程武器-弓箭、投掷鱼叉、投掷棍棒-的发明有可能让身材瘦小的智人使用打了就跑的战术从远处骚扰粗壮的尼安德特人。\n或者，也许更好的狩猎和采集技术可以让智人养活更大的部落，在战斗中创造数量优势。\n即使在20万年前原始智人从非洲爆发之后，也花了15万多年的时间才征服了尼安德特人的土地。在以色列和希腊，古老的智人在尼安德特人的反攻中后退，然后现代智人从12.5万年前开始的最后一次进攻，消灭了他们。\n这不是一场闪电战，如果尼安德特人要么是和平主义者，要么是地位低下的战士，人们会认为这不是一场闪电战，而是一场旷日持久的消耗战。最终，我们赢了。但这并不是因为他们不太喜欢打架。最终，我们可能只是在战争中变得比他们更好。\n本文是根据知识共享许可从对话中重新发布的。请阅读原文。", "note_en": "Around 600,000 years ago, humanity split in two. One group stayed in Africa, evolving into us. The other struck out overland, into Asia, then Europe, becoming  Homo neanderthalensis – the  Neanderthals. They weren&#39;t our ancestors, but a sister species, evolving in parallel.\n   Neanderthals fascinate us because of what they tell us about ourselves – who we were, and who we might have become. It&#39;s tempting to see them in idyllic terms, living peacefully with nature and  each other, like Adam and Eve in the Garden.\n If so, maybe humanity&#39;s ills – especially our territoriality, violence, wars – aren&#39;t innate, but modern inventions.\n Biology and palaeontology paint a darker picture. Far from peaceful, Neanderthals were likely skilled fighters and dangerous warriors, rivalled only by modern humans.\n  Predatory land mammals are territorial, especially pack-hunters. Like  lions, wolves and  Homo sapiens, Neanderthals were cooperative big-game hunters. These predators, sitting atop the food chain, have few predators of their own, so overpopulation drives  conflict over  hunting grounds. Neanderthals faced the same problem; if other species didn&#39;t control their numbers, conflict would have.\n This territoriality has deep roots in humans. Territorial conflicts are also  intense in our closest relatives,  chimpanzees. Male chimps routinely gang up to attack and kill males from rival bands,  a behaviour strikingly like human warfare.\n This implies that cooperative aggression evolved in the common ancestor of chimps and ourselves,  7 million years ago. If so, Neanderthals will have inherited these same tendencies towards cooperative aggression.\n    Warfare is an intrinsic part of being human. War isn&#39;t a modern invention, but an  ancient, fundamental part of our humanity.  Historically, all peoples warred. Our oldest writings are filled with war stories.  Archaeology reveals ancient fortresses and  battles, and sites of prehistoric massacres going back millennia.\n To war is human – and Neanderthals were very like us. We&#39;re remarkably similar in our skull and skeletal anatomy, and share  99.7 percent of our DNA.\n Behaviourally, Neanderthals were astonishingly like us. They  made fire,  buried their dead, fashioned  jewellery from seashells and  animal teeth,  made artwork and  stone shrines. If Neanderthals shared so many of our creative instincts, they probably shared many of our destructive instincts, too.\n   Neanderthalensis were skilled  big game hunters,  using spears to take  down deer, ibex, elk, bison, even rhinos and mammoths. It defies belief to think they would have hesitated to use these weapons if their families and lands were threatened. Archaeology suggests such conflicts were commonplace.\n Prehistoric warfare leaves telltale signs. A club to the head is an efficient way to kill – clubs are fast, powerful, precise weapons – so prehistoric  Homo sapiens  frequently show trauma to the skull.  So too  do  Neanderthals.\n   Another sign of warfare is the parry fracture, a break to the lower arm caused by warding off blows. Neanderthals also show  a lot of broken arms. At least one Neanderthal, from Shanidar Cave in Iraq, was  impaled by a spear to the chest.\n Trauma was  especially common in young Neanderthal males, as were deaths. Some injuries could have been sustained in hunting, but the patterns match those predicted for a people engaged in intertribal warfare- small-scale but intense, prolonged conflict, wars dominated by guerrilla-style raids and ambushes, with rarer battles.\n  War leaves a subtler mark in the form of territorial boundaries. The best evidence that Neanderthals not only fought but excelled at war, is that they met us and weren&#39;t immediately overrun. Instead, for around 100,000 years, Neanderthals resisted  modern human expansion.\n  Why else would we take so long  to leave Africa? Not because the environment was hostile but because Neanderthals were already thriving in Europe and Asia.\n It&#39;s exceedingly unlikely that modern humans met the Neanderthals and decided to just live and let live. If nothing else, population growth inevitably forces humans to acquire more land, to ensure sufficient territory to hunt and forage food for their children.\n    Instead, for thousands of years, we must have tested their fighters, and for thousands of years, we kept losing. In weapons, tactics, strategy, we were fairly evenly matched.\n Neanderthals probably had tactical and strategic advantages. They&#39;d occupied the Middle East for millennia, doubtless gaining intimate knowledge of the terrain, the seasons, how to live off the native plants and animals.\n In battle, their massive, muscular builds must have made them devastating fighters in close-quarters combat.  Their huge eyes likely gave Neanderthals superior low-light vision, letting them manoeuvre in the dark for ambushes and dawn raids.\n  Finally, the stalemate broke, and the tide shifted. We don&#39;t know why. It&#39;s possible the invention of superior ranged weapons –  bows,  spear-throwers,  throwing clubs – let lightly-built  Homo sapiens harass the stocky Neanderthals from a distance using hit-and-run tactics.\n Or perhaps  better hunting and gathering techniques let  sapiens feed bigger tribes, creating numerical superiority in battle.\n Even after primitive  Homo sapiens broke out of Africa  200,000 years ago, it took over 150,000 years to conquer Neanderthal lands. In  Israel and  Greece, archaic  Homo sapiens took ground only to  fall back against  Neanderthal counteroffensives, before a final offensive by modern  Homo sapiens, starting  125,000 years ago, eliminated them.\n This wasn&#39;t a blitzkrieg, as one would expect if Neanderthals were either pacifists or inferior warriors, but a long war of attrition. Ultimately, we won. But this wasn&#39;t because they were less inclined to fight. In the end, we likely just became better at war than they were.\n  This article is republished from  The Conversation under a Creative Commons license. Read the  original article.", "posttime": "2020-11-03 21:44:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特人,humans", "title": "尼安德特人和人类交战超过10万年", "title_en": "Neanderthals and Humans Were at War for over 100k Years", "transed": 1, "url": "https://www.sciencealert.com/how-neanderthals-and-humans-battled-for-supremacy-for-over-100-000-years/", "via": "", "real_tags": ["特人", "humans"]}, {"category": "", "categoryclass": "", "imagename": "8f48b7b1adc169894440481c6075b581.jpg", "infoid": 1032957, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，日本出版物《日经新闻》(Nikkan Kogyo Shimbun)报道称，正如Mac Otakara发现的那样，索尼将向苹果提供OLED微型显示器，用于其广为流传的AR/VR眼镜", "note_en": "Earlier this week, Japanese publication   Nikkan Kogyo Shimbun reported that Sony will supply Apple with OLED microdisplays for its widely rumored AR/VR glasses, as  spotted by  Mac Otakara", "posttime": "2020-11-03 21:25:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,glasses,早些时候", "title": "据报道，苹果眼镜将使用索尼的“尖端”OLED微型显示屏来提供“真正的AR体验”。", "title_en": "Apple Glasses Will Reportedly Use Sony's 'Cutting-Edge' OLED Micro-Displays To Deliver 'Real AR Experience'", "transed": 1, "url": "https://www.macrumors.com/2020/10/22/apple-glasses-sony-oled-microdisplays/", "via": "", "real_tags": ["apple", "苹果", "glasses", "早些时候"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032954, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，争论什么是央行“印钞”，什么不是“印钞”变得流行起来。\n由于2020年政策性质极端，大规模财政支出、央行资产负债表大幅增加，以及央行通胀目标发生变化，这场辩论是很自然的。重要的是要知道什么是通货膨胀，什么不是，以及通货膨胀的程度。\n由于人们对央行政策和财政政策的运作方式有非常不同的理解，今年的分析师电话会议从恶性通胀到深度通缩，以及介于两者之间的一切。\n当然，以CPI或PCE衡量，结果一直处于中间水平，通胀受到政策的影响，从3月份的低点反弹，但既不是超调，也不是欠调，总体上仍低于央行的长期通胀目标。\n然而，今年和最近几年，最基本和非外包商品和服务的许多通胀类别的上涨速度都快于整体篮子。\n本文的症结在于，在分析通胀和通缩之间的可能性，以及什么构成“印钞”时，量化宽松本身和量化宽松与巨额财政赤字是两种截然不同的情况.。\n在深入研究印钞机制之前，先做好准备。上下文是关键。\n从历史上讲，我们正在从长期债务周期的顶峰下降，目前处于长期债务周期的漫长解决过程中，长期债务周期指的是公共和私人债务相对于经济和货币供应的规模达到数十年来的峰值。这发生在利率降至零之后。\n我们在过去的12年里一直在进行这个解决过程，上一次是在20世纪30年代和40年代，当时我们达到了长期债务周期的前一个顶峰。\n以下是美国过去一个世纪的总债务占GDP的百分比，左轴为蓝色(所有债务，公共和私人债务)，右轴为橙色的短期利率：\n这里是总债务占广义货币供应量的百分比，它更清楚地显示了每个周期的结构性峰值(因为由于货币速度的变化，政策制定者对广义货币供应量的影响力比GDP更大)：\n如果我们将联邦债务与非联邦债务(家庭、企业、州、财务杠杆等)分开，我们会在每个长期周期中看到两个明显的峰值。非联邦债务(橙线)首先在商业银行危机中见顶(20世纪30年代初和2000年末)，然后是多年后在主权债务危机中见顶的联邦债务(蓝线)(20世纪40年代中期和？-2020年)：\n高私人债务水平是通货紧缩的，因为它使消费者和企业在财务上受到限制，不愿承担风险。\n大宗商品供过于求是通缩的，因为它降低了我们用于其他一切的基石的价格。\n外包是通缩的，因为它降低了商品的劳动力成本，并给国内工资带来了下行压力。\n在一个低负债的体系中，出于一些积极的原因(如技术进步)而出现结构性通缩将是一件好事。这意味着你的钱的购买力随着时间的推移而增长，因为技术进步带来的更高的生产率降低了商品的成本或改善了商品的质量，所以你的钱更值。\n然而，在一个异常高的债务体系中(这首先需要大量的中央政策干预才能达到如此高的水平)，通货紧缩会打破局面，导致广泛的违约，因为偿债成本相对于现金流会上升。\n因此，财政和货币政策制定者故意用通胀政策来击退通缩力量，特别是在达到这些极端的时候。我们可以确定几种通胀的定义或类型。\n货币通胀指的是广义货币供应量的增长，可以用几种方法计算，但相当简单。\n资产价格通胀是指股票、债券、黄金、私募股权、艺术品等金融资产价格的泡沫式上涨。这有点主观，因为资产的估值可能会有所不同，但广义上有各种比率可以跟踪。\n消费价格通胀指的是日常商品和服务价格的普遍上涨，人们对应该如何衡量它展开了争论。政府对一篮子商品使用CPI和PCE计算，但这些使用了各种替代方法。还有一些不使用代换的替代计算，这通常会导致更高的数字。\n每个家庭都有他们自己购买的一篮子独特的消费品和服务。为了进行研究，我计算出，过去两年，我的个人家庭消费价格通胀率平均每年约为3%，这还包括我们购买的所有非投资性商品和服务。\n进入2008年危机时，美国银行的杠杆率极高，银行准备金非常低。\n大银行的现金水平仅相当于其资产的3%(下面的蓝线；现金占总资产的百分比)，大银行持有的美国国债占资产的百分比也相当低(红线；国债占总资产的百分比)：\n因此，在金融危机之前，他们的资产中只有13%左右是现金(3%)和国债(10%)。他们其余的资产投资于贷款和风险更高的证券。这也是在家庭债务与GDP之比达到创纪录高位的时候，因为消费者被卷入了房地产泡沫。\n这种过度杠杆化的银行状况在2008/2009年危机中达到高潮，恰逢家庭债务与GDP之比达到创纪录高位，也是长期私人(非联邦)债务周期的顶峰。当银行的杠杆率很低，现金储备很少时，即使是3%的资产损失也会导致资不抵债。事情就是这样发生的；整个银行体系的贷款总冲销率达到了峰值，超过了3%，这导致了一场广泛的银行业危机。\n然而，银行通过量化宽松和问题资产救助计划(TARP)得到了救助。这是一次自上而下的、反通货紧缩的银行业救助，但不是一次自下而上的、有利于通胀的实体经济救助。TARP提振银行偿付能力，QE提振银行流动性。\n随着危机的发展，一些银行倒闭，另一些银行得到救助，监管机构希望提高银行存款准备金率和资本金要求，要求银行以现金储备和其他安全资产的形式持有更大比例的资产。然而，这样做的问题是，银行不能仅仅神奇地增加准备金；它们将不得不出售其他资产来获得现金，但如果系统中的每一家银行都出售资产以获得现金，它们会出售给谁，这么多现金从哪里来购买他们出售的东西？\n换句话说，虽然个别银行可以通过出售资产筹集资本来提高准备金，但整个银行业从机械上讲不可能整体提高整个行业的准备金。\n因此，作为最后贷款人/买家的角色，美联储(Federal Reserve)凭空创造了新的现金储备，将其交给银行，并将部分美国国债和抵押贷款支持证券(MBS)作为回报，即量化宽松(QE)。与问题资产救助计划一起，这对银行进行了资本重组，使银行的现金占资产的比例从2008年初的3%上升到2008年底的8%。美联储在2014年之前又实施了几轮量化宽松，使银行的现金水平总体上达到了15%，这使得它们的超额准备金达到了泡沫水平。\n然而，这并没有导致更多的钱追逐更少的商品和服务，因此对每个价格来说都不是特别通胀。这些资金大多留在银行系统内部，处于较高的储备水平。广义货币供应量增长不快。\n许多担心通胀的分析师忽略了一个事实，即从量化宽松到实体经济的传导机制很小，因此这大多只是一个银行资本重组过程。银行及其高管从美联储和财政部得到了很好的帮助，但广大公众并没有。银行并没有借出太多的钱(也没有大量有信誉的需求要求他们这样做)，财政支出也没有太多绕过银行渠道。\n类似的版本在20世纪30年代上演，那是上一次利率在长期私人债务周期的顶峰触及零界限。银行体系当时也崩溃了，因此政策制定者在银行业假期期间让美元对盯住黄金的汇率贬值，扩大了货币基础，并对银行进行了资本重组。这足以抵消20世纪30年代初发生的深度通缩，并在30年代中期将其重新转变为通货再膨胀趋势，但还不足以导致迅速而广泛的消费价格通胀。换句话说，它是反通货紧缩的，但不是彻底的通胀。\n从2008年中期到2014年底，美联储总共扩大了约3.5万亿美元的资产负债表。他们创造了新的银行储备来购买美国国债和抵押贷款支持证券。\n许多人认为这会是魏玛共和国式的恶性通货膨胀。所以，他们把金价抬高到相当高的水平。我很高兴他们有这种感觉，因为我在2011年将黄金卖给了他们，当时市场情绪非常高涨。这是我唯一一次卖实物金条。相反，我想买入历史上最便宜的股票。\n以下是相对于我的模型的金价(即远远高于蓝线的橙色区域)：\n当然，出于前面描述的原因，这次量化宽松最终并不是消费者价格的直接通胀。它是反通货紧缩的，而不是直接的通货膨胀。与低利率一起，这对资产价格有一定的通胀作用，但不是大多数消费者价格。这也是它在20世纪30年代的运作方式。\n我们可以给它加上一些宽泛的数字。从2007年到2009年，由于股票和房价下跌，美国家庭净资产减少了11万亿美元，从71万亿美元下降到60万亿美元。然后，美国家庭净资产花了大约五年的时间才恢复到以前的高点。这是11万亿美元的通货紧缩财富破坏(加上技术进步、大宗商品供应过剩、房屋净值贷款信贷收紧和其他通缩力量)，而美联储创造银行储备或量化宽松的回应是3.5万亿美元。当然，这不会是恶性通货膨胀。\n而且，如前所述，由于没有重大的财政转移机制，3.5万亿美元中的大部分从未进入广义货币供应量，因此大多只是停留在银行储备中。它通过用更高水平的偿付能力和流动性对银行系统进行资本重组来抵消通货紧缩冲击和银行倒闭(因此是反通货紧缩的)，但并不是彻底的通货膨胀。\n实际上，银行受到监管资本要求的限制，它们可以承担的杠杆率和风险是有限的。在这个模型中，有一些非常低风险的资产(如银行准备金、国债和黄金)不计入银行的风险水平，而有一些风险较高的资产(如个人贷款或公司债券)确实计入了银行的总体风险水平。银行需要保持适当的资产平衡，以避免被认为风险过高。\n在一些监管制度中，银行还可以受到准备金要求的约束，这意味着要求银行将一定比例的存款作为现金储备储存起来。\n假设有一个监管规则，规定所有银行必须有相当于其客户银行存款(银行的负债；欠客户的)5%的现金作为储备存放在美联储。因此，如果一家银行有1000亿美元的客户银行存款(这是银行的负债)和1100亿美元的资产(因此他们的资产比负债多100亿美元)，它们可以将高达1050亿美元的资产投入各种形式(放贷、购买证券等)，但必须在美联储的账户上持有至少50亿美元的现金储备。\n以下是一个准备金受限的银行例子。一家银行有1000亿美元的存款(负债)和1100亿美元的资产。在他们的资产中，50亿美元是现金储备，200亿美元是国债，100亿美元是抵押贷款支持证券，750亿美元是其他资产(个人贷款、抵押贷款、公司贷款和/或其他任何资产)。这家银行不能再放贷了，除非它吸收更多的存款，这也会增加准备金，或者出售一些现有的资产。因此，它受到储量的限制。它可能想放贷，而且有良好的客户需求可以借钱给它，但它就是不能再杠杆化了。如果美联储创造50亿美元的全新储备(又名QE)，并购买50亿美元的美国国债或抵押贷款支持证券，这将缓解它们受到准备金限制的状况，银行可以用这50亿美元来发放更多贷款，或购买更多证券。如果银行想放贷，这将会刺激经济，因为现在银行可以放贷，从而在系统中的某个地方创造存款，增加广义货币供应。\n以下是一个不受储量限制的示例。一家银行有1000亿美元的存款(负债)和1100亿美元的总资产。在他们的资产中，150亿美元是现金储备，200亿美元是国债，100亿美元是抵押贷款支持证券，650亿美元是其他资产。这家银行有100亿美元的超额准备金，超过了50亿美元的要求；它可以放贷额外的资金。也许它现在不想放贷；它看不到任何好的风险调整后的贷款可以发放。或者，可能它的客户对借钱的需求不是很大。因此，除了50亿美元的法定准备金之外，它只是持有额外的100亿美元作为超额准备金。如果美联储实施量化宽松，购买50亿美元的国债，并将银行的储备提高到200亿美元，这不会影响他们借出的金额，因为他们一开始就不受准备金限制。这不会起到刺激作用，也不会增加广义货币供应量，因为它不会迫使银行发放更多贷款。\n这就是仅靠量化宽松不会引发通胀的原因。增加银行准备金并不一定会增加广义货币供应量。快速增长的广义货币供应量以及对商品和服务供应的限制，是可能导致通胀的原因。\n增加广义货币供应量有两种方式。要么银行需要放贷，要么联邦政府可以绕过它们，运行巨额财政赤字。在长期债务周期的顶峰，后一种情况往往会发生。\n现在到了2020年，在2008年银行业危机12年后的下一次衰退中，我们又回到了衰退中，规模比以前更大，但有了一个转折。\n这一次，进入危机时，银行系统已经资本充足。由现金和美国国债组成的银行资产的百分比已经创下历史新高。因此，与2008年不同的是，银行没有过度杠杆化。然而，更广泛的经济被过度杠杆化，大流行打击了更广泛的经济。\n数百万人失业，无数的企业面临破产风险，因为他们的现金流崩溃了。对于美联储来说，简单地从银行购买国债和MBS几乎不会对此做任何事情，因为这不是一个银行资本重组问题，也不会有任何向公众传递的机制。银行已经拥有充足的资本，所以银行不受准备金的限制。\n取而代之的是，这一次，财政当局(国会和总统)向实体非银行经济投入了数万亿美元，向民众提供刺激支票，将失业救济金每周额外增加600美元(对于领取失业救济金的人来说，几个月内每月增加2400美元)，资助银行向小企业提供PPP贷款，这些贷款大多会转化为赠款，并通过新的注资部分救助一些受打击最严重的企业行业。这是一个比2008/2009年任何时候都大得多的刺激措施。\n在目前的法律结构下，政府会计工作的方式是，他们必须发行大量的国债来为这项支出提供资金。然而，外国部门并没有真正买入美国国债，事实上，他们在今年早些时候抛售了一些国债。那么，今年有谁可以额外购买3万亿美元的美国国债呢？\n再次进入美联储。今年3月，当美国国债市场在买家不足的背景下因外国人和对冲基金抛售国债而变得缺乏流动性时，美联储出手干预，凭空创造了1万亿美元的全新银行储备，用于在3周内购买1万亿美元的国债。这是美联储有史以来最迅速的资产购买计划。然后他们缩减了利率，但几个月来一直在购买美国国债，以吸收2020年为所有刺激计划提供资金的大规模国债发行，直到今天，他们仍在用新创建的银行储备每月购买数百亿美元的美国国债。\n因此，美联储再次增加了资产负债表(这一次在短短三个月内增加了近3万亿美元)，购买了大量美国国债，以及抵押贷款支持证券(MBS)和少数公司债券等其他一些资产。到目前为止，在2020年迄今的资产负债表扩张中，约有2万亿美元，即三分之二的资金包括购买公债。但这一次的不同之处在于，它不仅仅停留在银行系统中，对银行进行资本重组。它通过银行流向美国财政部，财政部根据国会“关爱法案”的授权将这笔资金直接注入经济。\n以下图表显示了美国商业银行存款总额的同比变化(以数十亿美元为单位)，蓝色为蓝色，政府转移支付为绿色，美联储资产负债表为红色：\n这张图表至关重要，可以看出为什么2020年和2008年截然不同，为什么这一次政策反应对金融市场和个人收入的反应要快得多，力度也更大。到目前为止，到目前为止，全国范围内的个人收入和净资产在2020年非但没有下降，反而上升了。\n在2008-2014年，有大量的量化宽松(红线上升)，但这些美元没有进入公共银行存款(这是广义货币供应量的主要组成部分)。这是因为很少或根本没有财政传导机制；政府没有向人民发放巨额支票。因此，绿线(政府转移支付同比变化)和蓝线(银行存款同比变化)保持在较低水平。2008年的量化宽松进程大多只是对银行进行资本重组。\n然而，2020年是一个非常不同的故事。政府直接向经济投入了数以吨计的资金，并通过发行美国国债为其融资，美联储(Federal Reserve)创造了新的银行储备来购买这些债券。出于法律原因，美联储在二级市场上购买这些证券，但这在实践中没有太大区别；重要的是它们最终在哪里并保持不变。在这种情况下，从财政部购买这些债券并将其出售给美联储的银行只是充当传递实体。\n因此，与2008-2014年期间不同的是，蓝线、绿线和红线在2020年都是垂直的。政府向个人和企业发送资金(绿线)，这些钱出现在他们的银行存款(蓝线)中，从而出现在广义货币供应中，美联储创造了新的银行储备，以购买大量为该计划提供资金而发行的国债(红线)。\n或者，简单地说，2020年广义货币供应量增加了很多，但在2008/2009年(无论是绝对值还是百分比)几乎没有那么大的变动，因为。\n.", "note_en": "Lately, it has become fashionable to debate what is, or is not, “money-printing” by central banks.\n This debate is natural, due to the extreme policy nature of 2020, with massive fiscal expenditures, huge increases in central bank balance sheets, and changes in central bank inflation targets. It’s important to know what is inflationary, and what isn’t, and to what extent.\n Because people have very different understandings of how central bank policy and fiscal policy work, there have been analyst calls this year ranging from hyperinflation to deep deflation, and everything in between.\n The outcome has of course been somewhere in the middle as measured by CPI or PCE, with inflation that rebounded from March lows in response to policy, but neither much of an overshoot or undershoot, and still generally below long-term central bank inflation targets.\n Many inflation categories for the most essential and non-outsourced goods and services, however, have risen faster than the overall basket this year, and in recent years.\n The crux of this article is that quantitative easing on its own, and quantitative easing combined with massive fiscal deficits, are two very different situations to consider when it comes to analyzing the possibilities between inflation and deflation, and what constitutes “money printing”.\n  Before diving into the mechanisms of money-printing, it helps to set the stage. Context is key.\n Historically speaking, we’re coming down from the apex of, and currently within the lengthy resolution process of, a  long-term debt cycle, which refers to a multi-decade peak in public and private debts relative to the size of the economy and money supply. This occurs in the aftermath of when interest rates hit zero.\n We’ve been in this resolution process for the past 12 years, and the previous time before that was the two-decade period of the 1930’s and 1940’s where we hit the previous apex of a long-term debt cycle.\n Here is total debt as a % of GDP in the United States over the past century in blue on the left axis (all debts, public and private), along with short-term interest rates in orange on the right axis:\n   And here is total debt as a % of the broad money supply, which shows the structural peaks of each cycle even more clearly (since policymakers have more influence over broad money supply than GDP, due to shifting monetary velocity):\n   If we break out federal debt from non-federal debt (households, businesses, states, financial leverage, etc), we see two distinct peaks in each long-term cycle. Non-federal debt (orange line) peaks first in a commercial banking crisis (early 1930’s and late 2000’s), and then federal debt (blue line) peaks many years later in a sovereign debt crisis (mid-1940’s and ???-2020’s):\n    High private debt levels are deflationary, since it makes consumers and businesses financially restrained and risk-adverse.\n    Commodity oversupply is deflationary, since it cheapens the building blocks we use for everything else.\n Outsourcing is deflationary, since it lowers labor costs of goods and puts downward pressure on domestic wages.\n In a low-debt system, structural deflation for some of the positive reasons, such as technological improvement, would be a good thing. It means your money’s purchasing power grows over time, as higher productivity from technological enhancements lowers the cost of goods or improves their quality, so you get more value for your dollar.\n However, in an extraordinarily high-debt system (which requires a lot of central policy intervention in the first place to be able to get up that high), deflation breaks things and results in widespread defaults, because the cost of servicing debts goes up relative to cash flows.\n So, fiscal and monetary policymakers deliberately push back on deflationary forces with inflationary policy, especially when it gets to those extremes. And there are a few definitions or types of inflation that we can identify.\n Monetary inflation refers to the growth of the broad money supply, which can be calculated in a few ways but is pretty straightforward.\n Asset price inflation refers to bubble-like increases in the prices of financial assets, like stocks, bonds, gold, private equity, fine art, and so forth. This is a bit more subjective because valuations on assets can vary, but there are various ratios to keep track of it in a broad sense.\n Consumer price inflation refers to a broad rise in the prices of everyday goods and services, and people debate about how it should be measured. The government uses CPI and PCE calculations on a basket of goods, but those use various substitutions. There are alternative calculations that don’t use substitutes, which generally lead to higher figures.\n Each household has their own unique basket of consumer goods and services that they buy. For research purposes, I calculated that my personal household consumer price inflation rate averaged about 3% per year over the past two years, taking into account our total purchases of non-investment goods and services.\n  Going into the 2008 crisis, U.S. banks were extremely leveraged, with very low bank reserves.\n Large bank cash levels equaled just 3% of their assets (blue line below; cash as a percentage of total assets), and large bank holdings of Treasuries as a percentage of assets were pretty low historically as well (red line; treasury securities as a percentage of total assets):\n   So, leading into the financial crisis, only about 13% of their assets consisted of cash (3%) and Treasury securities (10%). The rest of their assets were invested in loans and riskier securities. This was also at a time when household debt to GDP reached a record high, as consumers were caught up in the housing bubble.\n That over-leveraged bank situation hit a climax into the 2008/2009 crisis, coinciding with record high debt-to-GDP among households, and was the apex of the long-term private (non-federal) debt cycle. When banks are that leveraged with very little cash reserves, even a 3% loss in assets results in insolvency. And that’s what happened; the banking system as a whole hit a peak total loan charge-off rate of over 3%, and it resulted in a widespread banking crisis.\n However, banks were bailed out via QE and the Troubled Asset Relief Program. It was a top-down, anti-deflationary bank industry bailout, but not a bottom-up, pro-inflationary real economy bailout. TARP boosted bank solvency, and QE boosted bank liquidity.\n As the crisis played out and some banks failed and others were bailed out, regulators wanted to increase bank reserve requirements and capital requirements, requiring banks to hold a greater percent of their assets in cash reserves and other safe assets. The problem with that, however, is that banks can’t just magically boost up their reserves; they would have to sell other assets to get cash, but if every bank in the system sells assets to get cash, who do they sell to, and where would so much cash come from to buy what they sell?\n In other words, while it’s possible for an individual bank to boost its reserves by selling assets to raise capital, it’s mechanically impossible for the entire banking industry to collectively raise its reserves industry-wide.\n So, in the role of lender/buyer of last resort, the Federal Reserve created new cash reserves out of thin air, gave them to the banks, and took some of their Treasuries and mortgage-backed securities in return, aka quantitative easing or QE. Along with TARP, this recapitalized banks, bringing them from 3% cash as a percentage of assets at the start of 2008, to 8% by the end of 2008. The Fed did further rounds of QE through 2014 that brought banks collectively up to 15% cash levels, which brought them up to frothy levels of excess reserves.\n This, however, didn’t result in more money chasing fewer goods and services, and therefore wasn’t particularly inflationary for every prices. The money remained mostly internal to the banking system, at higher reserve levels. Broad money supply didn’t increase rapidly.\n Many analysts that were worried about inflation missed the fact that the transmission mechanism from QE to the real economy was small, so this was mostly just a bank-recapitalization process. Banks and their executives got a nice assist from the Fed and Treasury, but the broad public did not. Banks didn’t lend much of the money out (nor was there a ton of creditworthy demand for them to do so), and fiscal spending didn’t go around the banking channel very much either.\n A similar version of this played out in the 1930’s, which was the previous time that interest rates hit the zero bound at the apex of a long-term private debt cycle. The banking system collapsed back then too, so policymakers devalued the dollar vs the gold peg, expanded the monetary base, and recapitalized banks during a banking holiday. This was enough to offset the deep deflation that was happening in the early 1930’s, and turn it back into a reflationary trend in the mid-1930’s, but not enough to cause rapid broad consumer price inflation. It was anti-deflationary, in other words, but not outright inflationary.\n  All told, the Fed expanded their balance sheet by about $3.5 trillion from mid-2008 to the end of 2014. They created new bank reserves to buy Treasuries and mortgage-backed securities.\n Many folks thought this would be hyperinflationary, Weimar Republic style. So, they bid up the price of gold rather high. I’m glad they felt that way, because I sold my gold to them in 2011, during a period of very high sentiment. It’s the only time I sold physical bullion. I wanted to load up on historically cheap stocks instead.\n Here was the gold price relative to my model (i.e. orange area way above blue line):\n     Of course, this QE ended up not being outright inflationary for consumer prices, for reasons described before. It was anti-deflationary, rather than outright inflationary. Along with low rates, it was somewhat inflationary for asset prices, but not most consumer prices. That’s how it worked in the 1930’s, too.\n We can put some broad numbers on it. From 2007 to 2009, there was a $11 trillion decline in U.S. household net worth, as it fell from $71 trillion to $60 trillion, due to a decline in stock and house prices. It then took about five years for U.S. household net worth to recover to previous highs. This was $11 trillion in deflationary wealth destruction (plus technology improvements, and commodity oversupply, tightened credit for home equity loans, and other deflationary forces), up against the response of $3.5 trillion in Fed bank reserve creation or QE. Of course it wouldn’t be hyperinflationary.\n  Moreover, as previously-described, most of the $3.5 trillion never entered the broad money supply because there was no major fiscal transfer mechanism, so it mostly just stayed in bank reserves. It offset a deflationary shock and bank collapse by recapitalizing the banking system with higher levels of solvency and liquidity (and thus was anti-deflationary), but it was not outright inflationary.\n  Banks, in practice, are limited in how much leverage and risk they can take by their regulatory capital requirements. In this model, there are some very low-risk assets (like bank reserves, Treasury securities, and gold) that don’t count against the bank’s risk level, and there are higher-risk assets (like personal loans, or corporate bonds) that do count against a bank’s overall risk level. Banks need to maintain an appropriate balance of assets to avoid being considered too risk-heavy.\n In some regulation regimes, banks can also be constrained by reserve requirements, meaning that banks are required to have a certain percentage of deposits stored as cash reserves.\n Suppose that there is a regulatory rule which says that all banks must have an amount of cash equal to 5% of their customer bank deposits (which are liabilities for banks; owed to their customers) held in reserve at the Federal Reserve. So, if a bank has $100 billion in customer bank deposits held with them (which are liabilities for the bank), and $110 billion in assets (and so they have $10 billion more assets than liabilities), they can put up to $105 billion of their assets into various forms (making loans, buying securities, etc), but must hold at least $5 billion in cash reserves at their account with the Fed.\n Here is a reserve-constrained bank example. A bank has $100 billion in deposits (liabilities), and $110 billion in assets. Of their assets, $5 billion is in cash reserves, $20 billion is in Treasuries, $10 billion is in mortgage-backed securities, and $75 billion is in other assets (personal loans, mortgage loans, corporate loans, and/or whatever else). This bank can’t lend anymore, until either it collects more deposits which would also boost reserves, or sells some existing assets. It is therefore reserve-constrained. It might want to lend, and has good client demand to lend money to, but it simply can’t leverage itself anymore. If the Fed were to create $5 billion in brand new reserves (aka QE) and buy $5 billion of their Treasuries or mortgage-backed securities, it would alleviate their reserve-constrained status, and the bank could use that $5 billion to lend more, or buy more securities. This would be economically stimulative if the bank wants to lend money, because now the bank can go ahead and lend that money, and thus create deposits somewhere in the system and increase the broad money supply.\n Here is a non-reserve-constrained example. A bank has $100 billion in deposits (liabilities) and $110 billion in total assets. Of their assets, $15 billion is in cash reserves, $20 billion is in Treasuries, $10 billion is in mortgage-backed securities, and $65 billion is in other assets. This bank has $10 billion in excess reserves above the $5 billion requirement; extra money it can lend. Maybe it doesn’t want to lend right now; it doesn’t see any good risk-adjusted loans to make. Or maybe there isn’t a lot of demand from its clients to borrow money. So, it’s just holding that extra $10 billion as excess reserves, in addition to their $5 billion required reserves. If the Fed were to do QE and buy $5 billion of their Treasuries, and bring the bank up to $20 billion in reserves, it won’t affect how much they lend, because they weren’t reserve-constrained to begin with. This would not be stimulative and would not increase the broad money supply, since it doesn’t coerce the bank to make any more loans.\n That is why QE alone isn’t inflationary. Increasing bank reserves does not necessarily increase the broad money supply. A rapidly increasing broad money supply along with constraints on the supply of goods and services, is what can lead to inflation.\n There are two ways to increase broad money supply. Either banks need to lend, or the federal government can go around them and run big fiscal deficits. At the apex of a long-term debt cycle, the latter tends to happen.\n  Now in 2020, in the next recession twelve years after the 2008 banking crisis, we’re back at it and bigger than before, but with a twist.\n This time, going into the crisis, the banking system was already well-capitalized. The percent of bank assets that consist of cash and Treasuries was already historically high. So, unlike 2008, banks weren’t over-leveraged. However, the broader economy was over-leveraged, and the pandemic hit the broader economy.\n Millions of people became unemployed, and countless businesses faced insolvency risk as their cash flows collapsed. For the Fed to simply buy Treasuries and MBS from banks wouldn’t do almost anything for this, because it’s not a bank recapitalization issue, and there would be no transmission mechanism to the public. Banks were already well-capitalized, and so the banks weren’t reserve-constrained.\n Instead, this time, fiscal authorities (Congress and the President) spent trillions of dollars into the real non-bank economy, sending folks stimulus checks, boosting unemployment benefits by an extra $600/week (which is $2,400/month for several months for folks who received it), financing banks to give small businesses PPP loans that mostly turn into grants, and partially bailing out some of the hardest-hit corporate industries with fresh capital injections. It was a much larger stimulus than anything from 2008/2009.\n The way that the government’s accounting works in the current legal structure, is that they have to issue a lot of Treasury securities to fund that expenditure. However, the foreign sector was not really buying Treasuries, and in fact were selling some Treasuries early this year. So, who would be available to buy $3 trillion in extra Treasury securities this year?\n Enter the Fed again. When the Treasury market became illiquid in March from foreigners and hedge funds selling Treasuries against a backdrop of insufficient buyers, the Fed stepped in, and created $1 trillion in brand new bank reserves out of thin air to buy $1 trillion in Treasuries over a 3-week period. This was the most rapid asset-purchase program the Fed has ever done. And then they tapered that rate but kept buying Treasuries for months to soak up the massive 2020 Treasury issuance that funded all the stimulus, and are still buying tens of billions of dollars of Treasuries monthly with newly-created bank reserves to this day.\n So, the Fed once again increased its balance sheet (this time by nearly $3 trillion in just three months) to buy a large chunk of Treasuries, plus some other assets like mortgage-backed securities and a handful of corporate bonds. About $2 trillion, or 2/3rds of this 2020 balance sheet expansion so far, consisted of buying Treasuries. But what made this one different, was that it didn’t just stay in the banking system to recapitalize banks. It flowed through banks to the U.S. Treasury Department, which injected that money directly into the economy as authorized by Congress’ CARES Act.\n This following chart shows the year-over-year change (in billions of dollars) of total U.S. commercial bank deposits in blue, government transfer payments in green, and the Fed’s balance sheet in red:\n   That chart is critical to see why 2020 and 2008 were quite different, and why the policy response acted so much quicker and more powerfully on financial markets and personal income this time. Personal income and net worth on a nationwide scale went up, rather than down, in 2020 so far.\n In 2008-2014, there was a lot of QE (red line going up), but those dollars didn’t get out into public bank deposits (which is what mostly makes up the broad money supply). This was because there was little or no fiscal transmission mechanism; the government wasn’t sending huge checks to people. So, the green line (year-over-year change in government transfer payments) and blue line (year-over-year change in bank deposits) remained low. The QE process in 2008 mostly just recapitalized banks.\n However, 2020 was a very different story. The government sent out tons of money directly into the economy, and financed it by issuing Treasury bonds that the Federal Reserve created new bank reserves to buy. For legal reasons, the Fed buys those securities on the secondary market, but that doesn’t make much of a difference in practice; it’s where they end up and remain that matters. The banks that buy them from the Treasury and sell them to the Fed just act as pass-through entities in this case.\n So, the blue, green, and red lines all went vertical in 2020, unlike the 2008-2014 period. The government sent money to people and businesses (green line), that money showed up in their bank deposits (blue line) and thus in the broad money supply, and the Fed created new bank reserves to buy a lot of the Treasury securities issued to fund that program (red line).\n Or, put simply, the broad money supply went up a lot in 2020, but didn’t budge nearly as much in 2008/2009 (in either absolute or percent terms), becau\n......", "posttime": "2020-11-03 19:48:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "银行,qe", "title": "银行、量化宽松和印钞", "title_en": "Banks, QE, and Money-Printing", "transed": 1, "url": "https://www.lynalden.com/money-printing/", "via": "", "real_tags": ["银行", "qe"]}, {"category": "", "categoryclass": "", "imagename": "fd89c838ffe60b5fee8bce2ed66ebf3f.png", "infoid": 1032953, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论你是在办公室还是在家里工作，保持高效率都可能是一件具有挑战性的事情；然而，要消除家里的干扰可能更具挑战性。\n有很多网站和应用程序可以通过阻止分心来帮助你专注于你的优先事项。\n在某些特定的环境中，我们很多人都很难集中注意力。许多人发现在安静或吵闹的环境中几乎不可能集中注意力。这样的环境太容易让我们分心或走神。有了合适的背景噪音，你可以让你的注意力集中在稳定而连续的配乐上，这是为了帮助你，而不是分散你的注意力！\n无论你是学习还是工作，合适的背景噪音可以帮助你更容易集中注意力。\n100多种不同的背景声音，从雨声到咖啡馆的声音，都可以配置您自己的混音。\nPomodoro时间管理技术可以将您的工作分解为几个间隔，从而帮助您提高工作效率。添加一项任务，工作25分钟，然后稍作休息。在四次工作间隔之后，休息10分钟。\n这个网站非常简单。它允许您添加要处理的任务，然后设置工作和休息间隔。它还向您显示一份个人报告，其中包含每天、每周或每年的重点小时数。\n无论你是想写下你的想法，不想忘记它们，还是想创作草图并与同事分享，还是只是想和朋友玩一个tic tac toe游戏，witeboard都是适合你的网站。\n如果你厌倦了让你的电子邮件收件箱被你注册的网站的电子邮件填满，inboxkitter提供了一个很好的解决方案。它提供了您在注册网站时可以使用的电子邮件地址。您收到的所有发送到该电子邮件地址的电子邮件都会在收到后3天内删除。", "note_en": "It can be challenging to stay productive whether you were working in an office or from home; however, the distractions at home can be way more challenging to eliminate.\n There are many websites and apps to help you focus on your priorities by blocking distractions.\n    A lot of us struggle to focus in certain env ironments. Many people find it nearly impossible to focus in silence, or in loud environments. These kinds of environments make it too easy for us to get distracted or let our minds wander. With the right background noise, you can help keep your mind focused on a steady and continuous soundtrack that is designed to aid, not distract!\n Whether you were studying or working, the right  background noise can help you focus your mind more easily.\n  Over 100 background sounds varying from the sound of rain to the sound of a coffee shop to configure your own mix.\n    The Pomodoro time management technique can help improve your productivity by breaking down your work into intervals. Add a task and work on it for 25 minutes and then take a short break. After four work intervals take a long 10 minutes break.\n The website is very simple. It allows you to add the tasks that you want to work on and then set the work and break intervals. It also shows you a personal report with the hours focused per day, week, or year.\n      Whether you want to write down your thoughts to not forget them, create sketches and share them with co-workers, or just play a game of tic tac toe with a friend,  witeboard is the right website for you.\n      If you are tired of having your email inbox filled with emails from websites that you sign up to,  inboxkitter offers a great solution. It provides an email address that you can use when signing up to a website. All the emails that you receive to the email address are deleted within 3 days after receiving them.", "posttime": "2020-11-03 19:48:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网站,improve", "title": "4个网站可提高您在家工作时的工作效率", "title_en": "4 Websites to Improve Your Productivity When Working from Home", "transed": 1, "url": "https://focuslisounds.medium.com/4-websites-to-improve-your-productivity-when-working-from-home-ace912f2d747", "via": "", "real_tags": ["网站", "improve"]}, {"category": "", "categoryclass": "", "imagename": "1a802e7ae8b93f89b7e93987cd7abbcb.jpg", "infoid": 1032952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你在技术行业工作，你可能已经看过NVIDIA的网站，这个人并不存在。这是一个使用人工智能生成人脸的简单界面。这也是经常用来愚弄记者引用并不存在的消息来源的工具。\n上面的屏幕截图摘自一家快速发展的联盟网站(即，通过推荐客户在另一网站上购物来赚钱的网站)的标题。\n乍一看，这些人似乎是真人，但事实并非如此。熟悉生成性对抗性网络的人可以辨别出泄露技术的“内幕”。例如，看一下扭曲的背景和不匹配的耳环。\n这些所谓的专家可能并不存在，但他们背后的垃圾邮件发送者能够欺骗合法出版物的记者，如“纽约杂志”、“妇女日”、“商业网站”、“逆向”、“读者文摘”、“生活黑客”、“简单美元”、“得分”、“父亲”、“法律缩放”、“商业新闻日报”和“Cheapism”。\n最重要的是，引用这些不存在的人的故事都是关于育儿、心理健康和新冠肺炎等话题。\n当一名记者在写一篇需要他或她没有的消息来源的报道时，该记者很可能会求助于Haro，这是一项将寻求专业知识的记者与拥有该专业知识的消息来源联系起来的服务。\n搜索引擎优化专家利用这项服务建立内容链接，让他们获利，这已不是什么秘密，但深度假技术的兴起，使得利用那些渴望点击的过度劳累、训练有素的记者变得比以往任何时候都更容易。\n我是一个高加索男性，但没有什么(除了我自己的道德)能阻止我假装这个网站是由有色人种女性发布的。上面的照片不是真的，但它足够真实，足以在最后期限前愚弄一名记者。为了打击这种欺诈行为，新闻编辑部必须迅速采用新的方法来核实消息来源。\nGAN渲染是逼真的，在Photoshop中修饰的渲染近乎完美，但它们(目前)还不容易扩展。结果是：总是要两张你的线人的照片。\n将这些照片放入Tineye(甚至是Google Images)等反向图像查找服务中。他们以前在网上出现过吗？上下文有意义吗？\n请求提供指向社交媒体个人资料的链接。这些账户活跃多久了？他们讲的故事前后一致吗？\n这是英伟达在其“此人不存在”网站上给出的天真而居高临下的建议。不过，这是个好建议。\n依靠大科技来解决这个问题，就像依靠大烟草来治愈癌症一样。我们每个人都要为真理而战。", "note_en": "If you work in technology, you&#39;ve probably seen Nvidia&#39;s &#34; This Person Does Not Exist&#34; website. It&#39;s a simple interface that uses AI to generate human faces. It&#39;s also the tool that is used routinely to fool journalists into quoting sources who don&#39;t exist.\n  The screenshot above is taken from the masthead of a fast-growing affiliate website (i.e. a website that earns money by referring customers to make purchases on another website).\n These seem like real people at first glance, but they aren&#39;t. Someone who is familiar with generative adversarial networks can spot the “tells” that give the technology away. For example, look at the distorted backgrounds and mismatched earrings.\n These so-called &#34;experts&#34; might not exist, but the spammers behind them were able to fool reporters at legitimate publications like New York Magazine, Woman&#39;s Day, Business.com, Inverse, Reader&#39;s Digest, Lifehacker, The Simple Dollar, Score, Fatherly, Legal Zoom, Business News Daily and Cheapism.\n On top of that, the stories that quoted these non-existent people were about topics like parenting, mental health and COVID-19.\n  When a reporter is writing a story that requires a source that he or she does not have, that reporter will likely turn to  HARO, a service that &#34;connects journalists seeking expertise to include in their content with sources who have that expertise.&#34;\n It&#39;s no secret that  search engine optimization specialists use the service to build links to content that profits them, but the rise of &#34;deepfake&#34; technology has made it easier than ever to exploit overworked and undertrained reporters who are  hungry for clicks.\n  I&#39;m a caucasian male, but there is nothing ( other than my own morals) to stop me from pretending that this website is published by a woman of color. The photo above isn’t real, but it’s real enough to fool a journalist on a deadline. To combat this fraud, newsrooms must quickly adopt new methods for verifying sources.\n  GAN renderings are realistic and those that are retouched in Photoshop are nearly perfect, but they are not readily extensible (yet). The upshot: Always ask for two photographs of your source.\n Take those photographs and plug them into a reverse image lookup service like  Tineye (or even Google Images). Have they appeared on the web before? Does the context make sense?\n Ask for links to social media profiles. How long have the accounts been active? Do they tell a consistent story?\n  That’s the naive and condescending advice that Nvidia gives on its This Person Does Not Exist website. Nevertheless, it’s good advice.\n  To rely on Big Tech to solve this problem is like relying on Big Tobacco to cure cancer. It’s up to each of us to fight for the truth.", "posttime": "2020-11-03 19:08:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,毁掉,ruining,记者", "title": "NVIDIA是如何毁掉互联网的", "title_en": "How Nvidia Is Ruining the Internet", "transed": 1, "url": "https://www.superhighway98.com/nvidia", "via": "", "real_tags": ["nvidia", "毁掉", "ruining", "记者"]}, {"category": "", "categoryclass": "", "imagename": "89b49c316d9804f2b0580c2a56c38b1f.gif", "infoid": 1032949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约25年前，我发现了Nethack和Rogue，从那时起，我就想制作我自己的流氓游戏。周五，我实现了那个年轻的梦想，发运了“星际迷航”(Asterogue)，耶！\n这个游戏卖不出去。我在独立游戏界呆了很长时间，知道这是个垃圾游戏。要制作一款成功的独立游戏，你必须在巅峰状态下执行，做好每一件事，然后你仍然会在成功时掷骰子。我见过冷冰冰的天才们创造出辉煌的艺术品，却看着它们零下载量。推出一周后，一滴眼泪顺着他们的脸颊滚落下来，小小的像素化小提琴演奏着莫扎特安魂曲的调子版本。\n我的游戏卖不出去，没关系。在经历了这么多年的游戏堵塞和次要项目之后，我对它感到平静。这是大势所趋。我只是很高兴有机会实现这个梦想。\n我在制作“星际迷航”时玩得很开心。我从来没有在副业上付出过更大的努力。我公开承诺将于10月30日发布，我已经做到了。我从小就建造了我梦寐以求的东西，我只是感谢整个宇宙，因为这个机会就在我的触手可及之处。\n我要感谢那些冒险买下这款游戏的人。我很惊讶，我们这群喜欢这种游戏的人竟然不止一人。你们太棒了！\n我也想从心底感谢那些测试游戏并给我反馈的人。当有人愿意牺牲他们的时间来尝试你建造的东西时，这是一种荣誉，我真的很感激。正是你们的反馈使这款游戏成为我在分配的时间内所能做的最好的游戏。谢谢。", "note_en": "I discovered Nethack and Rogue some 25 years ago and ever since then I have wanted to make my own roguelike game. On Friday I followed through on that youthful dream and shipped Asterogue, yay!\n This game won’t sell. I have been around the indie games scene long enough to know its a crap-shoot. To make a successful indie game you have to execute at peak performance, do everything right, and then you still roll the dice on success. I’ve seen stone cold geniuses build glorious works of art and watch them get zero downloads. A single tear rolls down their cheek one week after launch and tiny pixellated violins play a chiptune version of Mozart’s Requiem.\n My game won’t sell and that’s ok. I am at peace with it after all of these years of game jams and side projects. It is the way of things. I’m just happy to have had the chance to fulfill this dream.\n I had so much fun making Asterogue. I’ve never worked harder on a side project. I publically committed to an October 30th release, and I’ve done it. I built the thing I dreamed of making since I was a kid, and I am simply grateful to the universe that this opportunity was within my reach.\n I want to thank the people who took a chance and bought the game. It’s amazing to me that our tiny club of people who like this kind of game has more than one member. You guys rock!\n I also want to thank from the bottom of my heart the people who tested the game and gave me feedback. It’s an honor when somebody is willing to sacrifice their time to try out something you built, and I really appreciate it. It’s your feedback that made this the best possible game I could make in the time allocated. Thank you.", "posttime": "2020-11-03 18:06:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,卖不出去,won", "title": "我的游戏卖不出去，没关系", "title_en": "My game won't sell and that's ok", "transed": 1, "url": "https://chr15m.itch.io/asterogue/devlog/190653/my-game-wont-sell-and-thats-ok", "via": "", "real_tags": ["游戏", "卖不出去", "won"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两年前，也就是2018年11月，AWS公布了新的条件密钥aws：prinalTag和aws：RequestTag，并开始推动基于属性的访问控制(ABAC)概念。这篇文章将描述这是什么，实施这一战略的困难，以及AWS需要做些什么才能让客户成功地使用这一概念。\nAWS安全的一个长期问题是，如果您在一个AWS帐户中有两个项目，通常无法确保某些主体(即那里的用户和角色)只能与一个项目的资源交互，而不能与另一个项目的资源交互。为了实现最低权限策略，您需要隔离每个主体只能对某些资源执行的操作，以确保它们不会影响其他项目或从其他项目中导出数据。\n许多客户被迫采用的解决方案是将他们的项目隔离到单独的AWS帐户中，但这并不总是理想的。例如，随着帐户的增长，很难采用现有帐户并将资源移动到另一个帐户。因此，AWS开始专注于标记资源并通过标记限制访问。随着时间的推移，许多特权开始能够使用条件键aws：ResourceTag，这样您就可以限制谁可以与现有资源交互。但是，如果您希望主体创建新资源，但限制他们可以使用的标记，这样他们就不能使用另一个项目的标记创建资源，那该怎么办呢？为此，AWS发布了AWS：RequestTag。\n如果您有许多主体和项目，并且不想为每个主体和项目创建单独的IAM策略，该怎么办？您需要一个可以应用于所有主体的策略，即“仅与与您拥有的相同标记匹配的资源交互”或“您只能与您创建的资源交互”的公共请求。为了实现这一概念，AWS发布了aws：prinalTag，因此您现在可以使用以下条件：\n基于属性的访问控制(ABAC)是一种基于属性定义权限的授权策略，在AWS中属性意味着标签。关于这一概念，最好的两个资源是Brigid Johnson的Re：Inforce Talk Scale Permission Management in AWS w/Attribute-Based Access Control，以及Michael Chan的博客文章Working Backward：从IAM策略和主体标记到AWS资源的标准化名称和标记。\n人们在使用ABAC时遇到的第一个问题是，并不是所有的资源都支持标签。在那些支持的资源中，并不是所有的资源都支持IAM条件来限制这些标签。在支持创建的资源中，并不是所有的资源都支持标记，因此您只能限制对现有资源的标记访问，而不对资源进行标记。让我们来了解一下AWS今天的覆盖范围。使用来自议会的IAM数据(只是将AWS文档拼凑到一个json文件中)，我们发现有869个权限包含单词create，我们可以假定这些权限是授予创建资源权限的权限。\n$cat议会/iam_finition.json|jq&#39；.[]|.prefix as$prefix|.Priviles[]|.Privilica as$privilege|select($privilege|ascii_downcase|contains(&#34；create&#34；))|$prefix+&#34；：&#34；+$privilege&#39；|SORT|uniq|wc-l 869。\n接下来，我们将查找允许RequestTag条件键的所有权限：\n$cat议会/iam_finition.json|jq&#39；.[]|.prefix as$prefix|.Priviles[]|.Privilica as$privilege|select($privilege|ascii_downcase|contains(&#34；create&#34；)).resource_types[].condition_keys[]|select(.|ascii_downcase|contains(&#34；requesttag&#34；))|$prefix+&#34；：&#34；+$privilege&#39；|SORT|uniq|wc-l381。\n我们发现，在AWS上创建资源的869个权限中，有381个(43%)允许您对新资源进行标记，并限制对其使用的标记。此搜索确实缺少用于创建资源的某些权限，但不包括单词create，例如允许您创建EC2的ec2：RunInstances和允许您创建子域的route53：ChangeResourceRecordSets。它还忽略了AWS具有两个创建资源的权限的情况，即一个权限用于创建带标记的资源，另一个权限不带标记，例如CloudFront：CreateDistribution和CloudFront：CreateDistributionWithTags。然而，43%似乎大致正确。\n有人可能会试图争辩说，更广泛使用的资源确实支持在创建和限制那些标记时使用标记，但有些流行的资源并不支持。例如，以下权限都无法限制CREATE上的标签：lambda：CreateFunction、DynamoDB：CreateTable、KMS：CreateKey、Logs：CreateLogGroup、S3：CreateBucket、SQS：CreateQueue&#34；、IAM：CreateRole。\n作为一种技巧，对于不支持在创建时使用标记的资源，您可以使用与标记类似的方式使用资源的名称，但这很尴尬。\n在给定AWS账户中的资源的情况下，没有多少可用的工具可以告诉您谁都有权访问它。一些工具(例如。Awspx)会告诉您谁拥有某些特权，但他们不了解条件等细节。例如，他们可以告诉您谁拥有secsmanager：CreateSecret，但不会告诉您谁可以使用标签foo创建秘密。\n我通过试图理解更多IAM逻辑的access_check命令在CloudMapper中构建了一些功能。它对条件有一定的了解，也会考虑IAM边界，但是它不理解资源上的现有标记，并且缺乏很多其他功能。对于某些问题，它的答案将比其他工具更正确，但在许多情况下仍然是不正确的。项目PMapper中还包含一些额外的逻辑。\n有一个名为SimulatePrincalPolicy的API可用于了解谁有权访问资源，但它缺少许多您期望的功能。例如，您可以将主体的ARN、资源的ARN和要检查的关联权限传递给它，但如果有任何条件，则还必须包括检查时应使用的条件值。这意味着您必须找出资源的标记和资源策略，然后将其传递给此调用。\n因此，例如，假设我们有一个主体，它只能对已使用值为foo的项目键进行标记的秘密调用Secretsmanager：GetSecretValue，并且我们有一个带有该标记的秘密。为了检查我们的主体是否可以访问此密码，我们可以运行以下命令：\nAWS IAM模拟-主体-策略\\--策略-源-ARN ARN：AWS：IAM：：123456789012：用户/测试用户\\--操作名称秘密管理器：获取秘密值\\--资源-ARNS arn:aws:secretsmanager:us-east-1:123456789012:secret:test-abcdef\\--上下文条目ContextKeyName=secretsmanager:ResourceTag/project，上下文键值=foo，上下文键值=字符串。\n请注意，在最后一行中，我必须告诉它我希望它检查的资源的标记值。策略模拟器不会为您计算出这一点。因此，如果您要尝试自动执行此操作，则必须执行Describe调用，知道在响应中的什么位置查找标记值，以及如何使用此值格式化对SimulatePrincalPolicy的调用。此外，如果IAM策略具有用于其他权限的不相关的条件键，则您也必须为这些权限提供上下文键。接下来，您必须提供资源策略(如果存在)、IAM边界(如果存在)以及可能的其他数据。\nZelkova是AWS于2017年发布的针对IAM策略的自动化推理解决方案，可供私人测试版使用。当我和人们谈论了解谁有权访问什么的问题时，这个项目经常被那些不熟悉它的确切功能的人作为一个可能的选择。不幸的是，Zelkova是一个引擎，你仍然需要弄清楚它的输入。它可以回答一些与IAM相关的问题，但是对于我们了解谁有权访问哪些内容的目标而言，它与IAM：SimulatePrincialPolicy具有相同的限制。\nAWS组织的一项称为标记策略的功能本应帮助强制执行标记，但它受到严重限制，因为它只能在使用定义的标记键时强制执行可能使用的标签值。这意味着您不能强制标记资源。只有当有人试图用某个键标记资源时，才能强制要求该值是定义的集合中的一个。为了强制在组织中实际使用标记，您必须按照此处所述使用SCP。\n此外，标签策略并不涵盖支持标签的所有资源。支持的资源列表在此处。支持标签但不受标签策略支持的资源的一个示例是S3对象。\nAWS需要扩展此功能的功能，以支持强制使用标签密钥，因为其当前形式没有什么价值。\n人们经常处理多个项目，但是无法使用具有多个标记值的键来标记主体。例如，假设您有两个项目，foo和bar，并且您希望允许一个人只处理foo，并且他们创建的所有资源都应该有一个值为foo的Project标记，同样，您还有一个人应该只处理bar项目。AWS已经展示了如何创建可应用于两个人的单一IAM策略，您只需确保将项目标签应用到委托人，以定义他们可以处理的项目。\n现在假设这些员工中的一个需要同时处理这两个项目。不能同时使用foo和bar标记主体。一种解决方案是让人员根据他们从事的项目承担不同的IAM角色。另一种选择是为此人创建自定义IAM策略，该策略对他们可以处理的项目进行硬编码，从而停止在这些项目上使用主体标签。这两个选择似乎都不理想。\nAWS有一个可传递标签的概念，当实体在不同角色之间承担时，这些标签将跟随在实体后面，这可以帮助审计会话。它们有用于创建会话的可传递标记，但没有用于其他资源的可传递标记。如果可以将此概念应用于它们创建的任何资源，这样EC2和其他资源在创建时就会以某种方式自动标记，而无需用户指定这些标记，那就太好了。因此，如果用户是foo项目的一部分，他们创建的所有资源都会自动标记为foo的一部分。\nAWS以外的其他人也写到了ABAC的限制和困难，触及了他们遇到的其他问题：\n伊恩·麦凯(Ian McKay)所著的“ABAC的早期日子”描述了他发现的一个bug，他可以在那里标记资源，尽管他没有这样做的特权。\n不要使用标签来管理AWS中的权限，作者Rowan Udell指出了标签的可用性问题。\n创建正确的IAM策略来实施标记是困难的。由于IAM的限制，有些目标是不可能的，有些目标是尴尬的。各种资源类型的限制并不是恒定的，这些差异增加了复杂性。在某些情况下，可以基于标记定义权限，但不是所有情况下都可以，因此在尝试采用此策略时要小心。AWS缺乏全公司范围的指导和标准化，这经常让客户感到沮丧。\n具有相对简单解决方案的AWS上最大的问题之一是了解环境的工具，例如谁有权访问哪些资源。我希望AWS能够增加在这方面的投资，例如通过改进SimulatePrincalPolicy API来自动计算出呼叫中涉及的条件。在他们这样做之前，或者其他人这样做之前，尝试基于标签定义权限将是不必要的困难，出于各种原因，您安全边界的最佳策略将继续是使用单独的AWS帐户。\n如果您有兴趣了解更多关于AWS安全的知识，我提供培训，包括远程培训！", "note_en": "Two years ago, in November 2018, AWS  announced new conditions keys  aws:PrincipalTag and  aws:RequestTag, and  started to push the concept of Attribute Based Access Control (ABAC). This post will describe what this is, the difficulties with implementing this strategy, and what AWS needs to do for customers to be successful with this concept.\n  A long standing problem with AWS security has been that if you had two projects in a single AWS account, it was often impossible to ensure that some principals (meaning the users and roles there) could only interact with the resources of one project and not the other. In order to implement a least privilege strategy, you want to isolate the actions each principal can take to only certain resources to ensure they cannot impact or exfil data from the other project.\n The solution many customers have been forced to adopt is to isolate their projects into separate AWS accounts, but that’s not always ideal. For example, it can be difficult to take an existing account and move resources into another account as an account grows. So AWS started focusing on tagging resources and restricting access via tags. Over time, many privileges started to be able to work with the condition key  aws:ResourceTag so that you could restrict who could interact with an existing resource. But what if you wanted the principal to create new resources, but restrict what tags they could use, so they couldn’t create a resource with the tag of another project? For this AWS  released  aws:RequestTag.\n What if you had many principals and projects and you didn’t want to create separate IAM policies for each one? You want a single policy that you can apply to all principals that says “Only interact with resources that match the same tag as you have” or the common request of “You can only interact with resources you created.” To implement this concept, AWS released  aws:PrincipalTag, so you could now use a conditions such as:\n  Attribute-based access control (ABAC) is an authorization strategy that defines permissions based on attributes, which on AWS means tags. Two of the best resources on this concept are  Brigid Johnson’s re:Inforce talk  Scale Permissions Management in AWS w/ Attribute-Based Access Control and  Michael Chan’s blog post  Working backward: From IAM policies and principal tags to standardized names and tags for your AWS resources.\n   The first issue people ran into with ABAC was that not all resources supported tags. Of those resources that did, not all supported IAM conditions to restrict these tags. Of those that did, not all supported tag on create, so you could only restrict access to tag existing resources, leaving resources untagged. Let’s get some stats on how much coverage AWS has today. Using the IAM data from  Parliament (which is just the AWS  docs scraped into a json file), we find there are 869 privileges that contain the word  create, which we can assume to be the privileges that grant permission to create a resource.\n $ cat parliament/iam_definition.json | jq &#39;.[]|.prefix as $prefix|.privileges[]|.privilege as $privilege|select($privilege|ascii_downcase|contains(&#34;create&#34;))|$prefix+&#34;:&#34;+$privilege&#39; | sort | uniq | wc -l 869\n Next, we’ll find all the privileges of these that allow the  RequestTag condition key:\n $ cat parliament/iam_definition.json | jq &#39;.[]|.prefix as $prefix|.privileges[]|.privilege as $privilege|select($privilege|ascii_downcase|contains(&#34;create&#34;)).resource_types[].condition_keys[]|select(.|ascii_downcase |contains(&#34;requesttag&#34;))|$prefix+&#34;:&#34;+$privilege&#39; | sort | uniq | wc -l 381\n We find that 381 of 869 (43%) privileges for creating resources on AWS allows you to both tag the new resources and to restrict what tags are used for that. This search does miss some privileges that are used to create resources but do not include the word  create, such as  ec2:RunInstances that lets you create an EC2 and  route53:ChangeResourceRecordSets that lets you create a subdomain. It also misses situations where AWS has two privileges for creating a resource, where one privilege is used for creating the resource with tags and one without, such as  cloudfront:CreateDistribution and  cloudfront:CreateDistributionWithTags. However, 43% seems roughly correct.\n One might try to argue that the more widely used resources do support tag on create and restricting those tags, but there are some popular resources that do not. For example, the following privileges are all unable to restrict tag on create:  lambda:CreateFunction,  dynamodb:CreateTable,  kms:CreateKey,  logs:CreateLogGroup,  s3:CreateBucket,  sqs:CreateQueue&#34;, and  iam:CreateRole.\n As a hack, for resources that don’t support tag on create, you can use the names of the resources in a similar way as a tag, but this is awkward.\n  Given a resource in an AWS account, there is not much tooling available that can tell you who all has access to it. Some tools (ex.  awspx) will tell you who has certain privileges, but they don’t understand conditions, among other details. So for example, they can tell you who has  secretsmanager:CreateSecret, but they won’t tell you who can create a secret with the tag  foo.\n I built some functionality into  CloudMapper through it’s  access_check command that tries to understand more IAM logic. It has some understanding of conditions and will also take IAM Boundaries into consideration, but it does not understand the existing tags on a resource, and lacks a lot of other functionality. Its answers will be more correct than other tools for some questions, but will still be incorrect for a lot of cases. The project  PMapper also has some additional logic in it.\n  There is an API called  SimulatePrincipalPolicy that can be used to understand who has access to resources, but it is missing a lot of functionality you would expect. For example, you can pass it the ARN of a principal, the ARN of a resource, and associated privilege to check for, but if there are any conditions, you then have to also include the condition values that should be used when checking this. This means you have to figure out the tags of the resource and the resource policy to then pass to this call.\n So for example, assume we have a principal that can call  secretsmanager:GetSecretValue only on secrets that have been tagged with a  project key that has a value  foo, and we have a secret with that tag. In order to check if our principal can access this secret, we can run:\n aws iam simulate-principal-policy \\ --policy-source-arn arn:aws:iam::123456789012:user/testuser \\ --action-names secretsmanager:getsecretvalue \\ --resource-arns arn:aws:secretsmanager:us-east-1:123456789012:secret:test-abcdef \\ --context-entries ContextKeyName=secretsmanager:ResourceTag/project,ContextKeyValues=foo,ContextKeyType=string\n Notice in the last line, I have to tell it the value of the tag for the resource that I want it to check. The policy simulator does not figure that out for you. So if you were to try to automate this, you would have to make a describe call, knowing where in the response to find the tag value, and how to format the call to  SimulatePrincipalPolicy with this value. Also, if the IAM policy has unrelated condition keys for other privileges, you have to provide context keys for those too. Next, you have to provide the resource policy if one exists, the IAM boundary if one exists, and potentially other data.\n   Zelkova is an automated reasoning solution for IAM policies that was announced by AWS in 2017 and available for private beta. When I talk to people about the problem of understanding who has access what, this project often comes up as a possible option by those who aren’t familiar with what exactly it does. Unfortunately, Zelkova is an engine that you still have to figure out the inputs to. It can answer some IAM related questions, but for our goals of understanding who has access to what, it has all the same limitations as iam:SimulatePrincipalPolicy.\n  An AWS Organization feature called  Tag Policies was supposed to help enforce tagging, but it is critically limited by only being able to enforce what tag values may be used when defined tag keys are used. This means you cannot enforce that a resource is tagged. You can only enforce that when someone attempts to tag a resource with a certain key, that the value is one of a defined set. In order to enforce tagging actually be used in an organization, you have to use SCPs as described  here.\n   Further, Tag Policies do not have coverage across all resources that support tags. The list of supported resources is  here. An example of a resource that supports tags, but is not supported by Tag Policies, is S3 objects.\n AWS needs to extend the functionality of this feature to support enforcement of using tag keys, as there is little value in it in its current form.\n  People often work on multiple projects, but there is no way to tag a principal with a key that has multiple tag values. As an example, imagine you have two projects,  foo and  bar, and you want to allow a person to work on just  foo and all the resources they create should have a  Project tag with value  foo, and likewise you have another person who should only work on the  bar projects. AWS  has shown how to create a single IAM policy that can be applied to both people, and you’d just need to make sure to apply a  Project tag to the principals to define which project they can work on.\n Now imagine that one of these employees needs to work on both projects. You cannot tag a principal with both  foo and  bar. One solution is to have the person assume different IAM roles depending on which project they are working on. Another option would be to create a custom IAM policy for this person that hard-codes what projects they can work on, and therefore stops using the principal tag on them. Neither option seems ideal.\n  AWS has a concept of  transitive tags that will follow an entity as they assume between roles which can assist with auditing sessions. They have transitive tags for the creation of sessions, but not for other resources. It would be nice if this concept could be applied to any resources they create, such that EC2s and other resources are automatically tagged in some way as they are created, without the user having to specify those tags. So if a user is part of the  foo project, all the resources they create are automatically tagged as being part of  foo.\n  Others outside of AWS have also written about the limitations and difficulties of ABAC, touching on other problems they’ve run into:\n Still Early Days for ABAC by  Ian McKay describes a bug he found where he could tag resources despite not having privileges to do so.\n  Don’t use Tags to Manage Permissions in AWS by  Rowan Udell points out usability issues with tags.\n  Creating correct IAM policies to enforce tags is difficult. Some goals are impossible and some are awkward due to limitations of IAM. The limitations are not constant across resource types and these discrepancies add to the complexity. It is possible in some situations to define permissions based on tags, but it is not universally possible, so beware when attempting to adopt this strategy. AWS’s lack of company-wide direction and standardization is a regular source of frustration for customers.\n One of the biggest problems on AWS that has a relatively straightforward solution, is tooling to understand environments, such as who has access to which resources. I would love for AWS to increase investment in this area, such as by improving the SimulatePrincipalPolicy API to automatically figure out the conditions involved in a call. Until they do so, or someone else does, attempting to define permissions based on tags is going to be unnecessarily difficult, and your best strategy for security boundaries, for a variety of reasons, will continue to be to use separate AWS accounts.\n  If you’re interested in learning more about AWS Security, I provide  training, including remote training!", "posttime": "2020-11-03 17:44:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "abac,标记", "title": "AWS上的ABAC状态", "title_en": "The State of ABAC on AWS", "transed": 1, "url": "https://summitroute.com/blog/2020/11/02/state_of_abac_on_aws/", "via": "", "real_tags": ["abac", "标记"]}, {"category": "", "categoryclass": "", "imagename": "332bb03fa233c678c2dfb5877fdcf1f3.png", "infoid": 1032947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Kraken是一个P2P驱动的Docker注册中心，专注于可伸缩性和可用性。它专为混合云环境中的Docker映像管理、复制和分发而设计。借助可插拔的后端支持，Kraken可以轻松集成到现有的Docker注册表设置中作为分布层。\n自2018年初以来，Kraken一直在优步生产。在我们最繁忙的集群中，Kraken每天分发100多万个斑点，其中包括10万个1G+斑点。在峰值生产负载下，Kraken在30秒内分发20K 100MB-1G斑点。\n高度可扩展。Kraken能够在每台主机上以最大下载量的50%分发Docker映像(速度限制)。集群大小和映像大小对下载速度没有显著影响。支持任意大的斑点/层。为了获得最佳性能，我们通常将最大大小限制为20G。\n可插拔存储选项。Kraken不再管理数据，而是插入可靠的BLOB存储选项，如S3、GCS、ECR、HDFS或其他注册表。存储界面简单，新选项易于添加。\nKraken的高级想法是让少量专用主机向集群中每个主机上运行的代理网络播种内容。\n中心组件，跟踪器，将协调网络中的所有参与者以形成伪随机规则图。\n这样的图具有高连通性和小直径。因此，即使只有一个种子机，同时有数千个对等点加入，所有参与者在理论上也可以达到最低80%的最大上传/下载速度(当前实现为60%)，并且性能不会随着BLOB大小和集群大小的增加而大幅下降。有关更多详细信息，请参阅KubeCon+CloudNativeCon上团队的TechTalk。\n以下数据来自一项测试，其中2600台主机同时下载一个2层的3G Docker映像(5200次BLOB下载)，所有代理的速度限制为300MB/s(使用5个跟踪器和5个源)：\n您可以使用我们的示例Helm图表在您的K8S群集上部署Kraken(使用示例HTTP文件服务器后端)：\n部署后，每个节点都将在localhost上公开一个docker注册表API：30081。有关从Kraken代理拉取图像的Pod规范，请参见示例。\n启动带有开发配置的羊群容器(包含源、跟踪器、构建索引和代理)和两个agenttainers：\n在笔记本电脑上运行dev-cluster需要Docker-for-Mac。有关devcluster的更多信息，请查看devcluster自述文件。\n蜻蜓群集有一个或几个超级节点，它们协调群集中每4MB数据块的传输。\n虽然超级节点将能够做出最优决策，但是整个集群的吞吐量受到一个或几个主机的处理能力的限制，并且性能将随着BLOB大小或集群大小的增加而线性下降。\nKraken的跟踪器只帮助协调连接图，并将实际数据传输的协商留给各个同行，因此Kraken使用大的BLOB可以更好地扩展。最重要的是，Kraken是HA并支持跨群集复制，这两者都是可靠的混合云设置所必需的。\nKraken最初是使用BitTorrent驱动程序构建的，但是，我们最终实现了基于BitTorrent协议的P2P驱动程序，以便与存储解决方案更紧密地集成，并更好地控制性能优化。\nKraken的问题空间与BitTorrent的设计目标略有不同。Kraken的目标是在稳定的环境中减少全球最大下载时间和通信开销，而BitTorrent是为不可预测和充满敌意的环境而设计的，因此它需要保留稀缺数据的大部分副本，并防御恶意或不良行为的同行。\n尽管有这些不同之处，我们还是会不时地重新检查Kraken的协议，如果它是可行的，我们希望它能再次与BitTorrent兼容。\n如果Docker注册表吞吐量不是您部署工作流程中的瓶颈，那么切换到Kraken不会神奇地加快您的Docker获取速度。为了加快扩展坞拉取速度，请考虑在构建时切换到Makisu以提高层的可重用性，或者调整压缩比，因为扩展坞拉取会将大部分时间花在数据解压缩上。\n允许变异标签(例如更新最新的标签)，但是，有几件事不会起作用：由于Nginx缓存，紧接着的标签查找仍将返回旧值，并且复制可能不会触发。我们正在努力更好地支持这一功能。如果您现在需要标签转换支持，请减少构建索引组件的缓存间隔。如果您还需要在多群集设置中进行复制，请考虑将另一个Docker注册表设置为Kraken sbackend。\n从理论上讲，Kraken应该分发任何大小的斑点而不会显著降低性能，但在优步，我们执行20G的限制，不能支持超大型斑点(即100G+)的生产使用。对等点在每个斑点的基础上实施连接限制，如果没有对等点相对较快地成为种子点，则新的对等点可能会缺乏连接。如果您有想要分发的超大块，我们建议您先将它们分成10G块。", "note_en": "Kraken is a P2P-powered Docker registry that focuses on scalability and availability. It isdesigned for Docker image management, replication, and distribution in a hybrid cloud environment.With pluggable backend support, Kraken can easily integrate into existing Docker registry setupsas the distribution layer.\n Kraken has been in production at Uber since early 2018. In our busiest cluster, Kraken distributesmore than 1 million blobs per day, including 100k 1G+ blobs. At its peak production load, Krakendistributes 20K 100MB-1G blobs in under 30 sec.\n       Highly scalable. Kraken is capable of distributing Docker images at &gt; 50% of max downloadthe speed limit on every host. Cluster size and image size do not have a significant impact ondownload speed. Supports arbitrarily large blobs/layers. We normally limit max size to 20G for the best performance.\n   Pluggable storage options. Instead of managing data, Kraken plugs into reliable blob storageoptions, like S3, GCS, ECR, HDFS or another registry. The storage interface is simple and newoptions are easy to add.\n  The high-level idea of Kraken is to have a small number of dedicated hosts seeding content to anetwork of agents running on each host in the cluster.\n A central component, the tracker, will orchestrate all participants in the network to form apseudo-random regular graph.\n Such a graph has high connectivity and a small diameter. As a result, even with only one seeder andhaving thousands of peers joining in the same second, all participants can reach a minimum of 80%max upload/download speed in theory (60% with current implementation), and performance doesn&#39;tdegrade much as the blob size and cluster size increase. For more details, see the team&#39;s  techtalk at KubeCon + CloudNativeCon.\n     The following data is from a test where a 3G Docker image with 2 layers is downloaded by 2600 hostsconcurrently (5200 blob downloads), with 300MB/s speed limit on all agents (using 5 trackers and5 origins):\n        You can use our example Helm chart to deploy Kraken (with an example HTTP fileserver backend) onyour k8s cluster:\n  Once deployed, every node will have a docker registry API exposed on  localhost:30081.For example pod spec that pulls images from Kraken agent, see  example.\n   To start a herd container (which contains origin, tracker, build-index and proxy) and two agentcontainers with development configuration:\n  Docker-for-Mac is required for making dev-cluster work on your laptop.For more information on devcluster, please check out devcluster  README.\n   Dragonfly cluster has one or a few &#34;supernodes&#34; that coordinates the transfer of every 4MB chunk of datain the cluster.\n While the supernode would be able to make optimal decisions, the throughput of the whole cluster islimited by the processing power of one or a few hosts, and the performance would degrade linearly aseither blob size or cluster size increases.\n Kraken&#39;s tracker only helps orchestrate the connection graph and leaves the negotiation of actual datatransfer to individual peers, so Kraken scales better with large blobs.On top of that, Kraken is HA and supports cross-cluster replication, both are required for areliable hybrid cloud setup.\n  Kraken was initially built with a BitTorrent driver, however, we ended up implementing our P2Pdriver based on BitTorrent protocol to allow for tighter integration with storage solutions and morecontrol over performance optimizations.\n Kraken&#39;s problem space is slightly different than what BitTorrent was designed for. Kraken&#39;s goal isto reduce global max download time and communication overhead in a stable environment, whileBitTorrent was designed for an unpredictable and adversarial environment, so it needs to preserve morecopies of scarce data and defend against malicious or bad behaving peers.\n Despite the differences, we re-examine Kraken&#39;s protocol from time to time, and if it&#39;s feasible, wehope to make it compatible with BitTorrent again.\n  If Docker registry throughput is not the bottleneck in your deployment workflow, switching toKraken will not magically speed up your  docker pull. To speed up  docker pull, considerswitching to  Makisu to improve layer reusability at build time, ortweak compression ratios, as  docker pull spends most of the time on data decompression.\n Mutating tags (e.g. updating a  latest tag) is allowed, however, a few things will not work: taglookups immediately afterwards will still return the old value due to Nginx caching, and replicationprobably won&#39;t trigger. We are working on supporting this functionality better. If you need tagmutation support right now, please reduce the cache interval of the build-index component. If you also needreplication in a multi-cluster setup, please consider setting up another Docker registry as Kraken&#39;sbackend.\n Theoretically, Kraken should distribute blobs of any size without significant performancedegradation, but at Uber, we enforce a 20G limit and cannot endorse the production use ofultra-large blobs (i.e. 100G+). Peers enforce connection limits on a per blob basis, and new peersmight be starved for connections if no peers become seeders relatively soon. If you have ultra-largeblobs you&#39;d like to distribute, we recommend breaking them into &lt;10G chunks first.", "posttime": "2020-11-03 17:43:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "docker,p2p,kraken", "title": "Kraken-P2P Docker注册表", "title_en": "Kraken – P2P Docker Registry", "transed": 1, "url": "https://github.com/uber/kraken", "via": "", "real_tags": ["docker", "p2p", "kraken"]}, {"category": "", "categoryclass": "", "imagename": "9a815bde318a4cef6ebc9257fb78cbfc.jpg", "infoid": 1032945, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创始人和早期员工的收入可以比员工50岁以上的收入高出几个数量级。这是有充分理由的。早期员工不是旅行者，他们是制图员。\n创始人在开始阶段最常见的不可伸缩的事情就是手动招募用户。几乎所有的初创公司都必须这样做。你不能等用户来找你。你必须出去把它们拿来。\n毕竟，第一个客户是最不赚钱的！他们付出了最多的努力、最多的关注、最多的支持和最多的管道胶带！数百个小时的创始人和早期员工的工作投入到建立、赚取和留住第一批客户。这些客户在单位经济(CAC/LTV)和会计基础上是极其无利可图的…。甚至很有可能是士气的基础。\n有这样一个时刻，当你有几个早期的客户，仅仅因为得到这几个客户，你就感到瘀伤，遭受重创，筋疲力尽……。你想知道这件事会不会变得更容易。\n如果你花太多时间想象所有的客户都会像第一个客户一样具有挑战性、反应迟缓、价格昂贵--“好吧，我们还是现在就把公司关门大吉吧。”\n当我不再关注单位经济学，而开始关注企业价值--以投资者的身份思考时，我就明白了做那些不值得做的事情的数学意义。\n我是一名更好的投资者，因为我是一名商人，我是一名更好的商人，因为我是一名投资者。&沃伦·巴菲特。\n我在谢恩·帕里什(Shane Parrish)的播客中听到杰森·卡拉卡尼斯(Jason Calacanis)说，当一家公司从零个客户变成一个客户时，它就从不可投资变成了可投资。\n当一家公司从0个客户增加到1个客户时，预计的企业价值变化是…。接近无限%的增长，因为在客户数量为0的情况下，一家公司的默认价值为0美元。\n当你没有任何客户时，给你的业务增加最大价值的事情就是增加你的第一个客户。\n当一家年轻的公司增加一个客户时，他们不仅仅是增加了该客户的LTV。他们还增加了赢得其他有类似问题的客户的可能性。他们获得了一些递增的可信度，一些递增的规模，以及需要发扬光大的经验教训。\n想想早期销售对预计的企业价值的影响，很明显，赢得并保持客户第一是一家公司最重要的工作。对于您的企业价值而言，您的第一位客户可能价值数百万美元。它可能会把你从不可投资变成可投资。\n我认为这一趋势不会止步于一家。其次最有价值的是赢得并留住客户2。然后是3，以此类推。\n当公司最重要的事情不是赢得下一位客户以外的事情时，这一点就不那么明显了，除非在服务下一位客户方面有一些关键的限制。\n您拥有的客户越多，您获得的确定性、可复制性和规模经济效益就越高。\n#100,000客户的单位经济性和会计利润将比1号客户更好。但#10万；对企业价值的影响将小得多。\n这就是为什么要做规模不大的事情--因为早期客户是将一家公司从默认的死气沉沉(0美元)转变为默认活着(100万美元以上)的重要一步。(注1)这就是为什么要做不重要的事情--因为早期客户是将一家公司从默认的死气沉沉(0美元)转变为默认还活着(100万美元以上)的重要一步。早期的团队因其高风险、高回报的制图工作而获得奖励。\n这是一项艰苦的工作。坐在顾客面前，搞不清他们需要什么，你是否能帮上忙，这让人很不舒服。在没有脚本的情况下向新客户销售新产品是很困难的。带来第一批客户的创始人和早期员工玩的是一种不同的游戏，获得的回报与后来到来的销售团队不同。\n当你以1亿美元以上的公司价值回首早期时，你会感觉到这是真的。启发式方法将帮助你在早期集中精力并确定优先顺序。\n&#34；Customer&#34；表示付款。其他的验证方法在这种情况下更加模糊，你应该看看每周的使用率、参与度等。\n数字在这里只是一个例子。对于免费的社交产品，也许可以乘以10或100。如果你是Palantir，你可能一次只有100个客户。", "note_en": "Founders and early employees can earn orders of magnitude more than employees 50+. And there is a good reason for that. Early employees aren&#39;t travelers, they are cartographers.\n  &#34; The most common unscalable thing founders have to do at the start is to recruit users manually. Nearly all startups have to. You can&#39;t wait for users to come to you. You have to go out and get them.&#34;\n  After all, the first customer is the least profitable! They take the most effort, the most attention, the most support, and the most duct tape of any customer to come! Hundreds of hours of founder and early employee work go into building for, earning, and keeping those first customers. Those customers are wildly unprofitable on a unit economic (CAC / LTV) basis, and an accounting basis... and quite possibly even a morale basis.\n There is this moment, when you have a few early customers, and you are feeling bruised and battered and exhausted just from getting those few... that you wonder if this will ever get easier.\n If you spend too much time imagining that all of the customers to come will be AS challenging, slow, and expensive as this first customer — “well, we may as well shut the company down right now.”\n    The math that made me  understand &#34;Do things that don&#39;t scale&#34; was when I stopped looking at Unit Economics and started looking at Enterprise Value—thinking like an Investor.\n &#34; I am a better investor because I am a businessman, and a better businessman because I am an investor.&#34; - Warren Buffett\n I heard  Jason Calacanis on Shane Parrish&#39;s podcast say a company goes from uninvestable to investable when they go from zero customers to one customer.\n  The  projected enterprise value change when a company goes from 0 customers to 1 customer is... approaching an infinite % increase, because at 0 customers a company is by default worth $0.\n When you don&#39;t have any customers, the thing that will add the most value to your business is adding your first customer.\n When a young company adds one customer, they aren&#39;t just adding the LTV of that customer. They are also adding the likelihood of winning other customers with similar problems. They gain some incremental credibility, some incremental scale, and lessons to carry forward.\n Think about early sales’ impact on projected enterprise value, and it is clear winning and keeping customer one is a company&#39;s most important job. Your first customer may be worth millions of dollars to your enterprise value . It may take you from uninvestable to investable.\n  I don&#39;t think that trend stops at one. Next most valuable is winning and keeping customer 2. Then 3, etc.\n It&#39;s not as obvious when the most important thing for the company is something  other than winning the next customer, unless there is some critical constraint on serving the next customer.\n The more customers you have, the more certainty, replicability, and economies of scale you gain.\n The unit economics and the accounting profit from customer #100,000 will be better than customer #1... but #100,000&#39;s impact on enterprise value will be much lower.\n  That is why &#34;do things that don&#39;t scale&#34; matters — because early customers are huge steps to turning a company from &#34;default dead&#34; ($0) to &#34;default alive&#34; ($1,000,000+). And the early team is rewarded for their high-risk, high-reward cartography work.\n It is hard work. Sitting in front of a customer confused about what they need and whether you can help is uncomfortable. Selling a new product to new customers with no script is tough. Founders and early employees who bring in the first customers are playing a different game and earning different rewards than sales teams who come along later.\n  When you look back on the early days from your perch at a $100+ million company value, it will feel true. And the heuristic will help you focus and prioritize early on.\n   &#34;Customer&#34; implies paying. Other methods of validation are more waffle-y in this context and you&#39;d look at weekly usage, engagement, etc.\n Numbers are just an example here. For a free social product, maybe multiply by 10 or 100. If you’re Palantir, you may only have 100 customers ever.", "posttime": "2020-11-03 17:42:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "客户,customer", "title": "为什么您的第一个客户价值1000万美元", "title_en": "Why your first customer is worth $10M", "transed": 1, "url": "https://www.ejorgenson.com/blog/why-your-first-customer-is-worth-10000000", "via": "", "real_tags": ["客户", "customer"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1032944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎阅读我的“学习生锈”系列文章的第三篇。如果您想从一开始就点击它，这里有一个指向第一个的链接！这整个系列涵盖了我的旅程，从一个完全封闭在陆地上的地鼠，变成(希望如此)一只老练的Rustacean，能够安全地掠过任何应用程序的危险海床。\n警告：即将到来的观点独白；如果你想要的是复习功课，请随时跳到复习复习。\n让我开始不要在我还不太了解的概念上松散地思考，因为有足够的时间来做这件事，而是允许我画出我看到的铁锈和Go的风景。在相当发自内心的时候，我意识到这些现代语言的构建不仅是为了让我们的编程生活更愉快，而且是为了引导我们实现特定的工程和组织目标。\n对新的通用语言的需求不再源于“简单的”软件问题。以使用变量(Assembly)、使用自定义数据类型(C)、跨平台、跨架构兼容性(JVM语言)甚至是非常简单(Python)的问题为例。今天的语言可以从前面的所有功能中选择功能，然后应用工程和组织方向。\n自2014年以来，我一直把围棋作为一种爱好写东西，但直到2018年才开始专业写作。作为一个业余爱好者，我承认我曾经认为“围棋是固执己见的”。这看起来很酷，因为意见是有意义的！对吗？但是为什么它会固执己见，为什么呢？醒醒，伙计！\n今天我对它有了完全不同的看法。围棋只是一种在工程师之间共享非常安全的语言。这是因为工程师在使用围棋时不需要做很多决定。如果一个应用程序在理论上已经完成了它的设计，那么实际上它通常只是一个敲打代码来使其成为现实的问题。\n看看谷歌拥有多少Go开发工具就知道了。使用Java时，我记得在构建工具中选择Ant或Maven。围棋不让你选择。我们最接近的选择是依赖关系管理的dep。但最终谷歌屈服了，gomod成为了标准。围棋会尽最大努力剥夺你的选择。您不需要在Tomcat或Jetty之间进行选择-Go Net/http包将为您处理10kRPS，没有问题。见鬼，我看过服务于50kRPS的应用程序，而仅使用fmt.Println就记录了三分之一的请求。您只需远离标准库即可扩展，这是该语言的一个巨大优势。(这在很大程度上也是因为在过去的10年里，网络服务器并没有改变太多，所以围棋不必“跟上”--另一方面，我在围棋中使用http2的体验远非理想)。\n这是到目前为止在公司使用Go的最大卖点。如果你需要雇佣帮手，你基本上可以找到任何有后台经验的人，他们会在一到两周内拿到90%的围棋。如果他们有使用Struts、JUnit或Spring的经验，您完全不需要担心-标准库中的内容已经很多了。我是认真的。他们需要知道如何传递指针或值吗？并非如此-一般的软件工程实践，如同行评审和简单的单元测试，可以很容易地发现这些类型的问题。\n另一方面，现在谁还会雇佣我加入他们的铁锈团队呢？没有人-因为我会是那支球队的巨大负担。\nGo的目的是让开发人员开发出可伸缩、易于开发且不需要关键任务性能的Web服务。\n我是个菜鸟。100%。但即便如此，在我虚弱的脑海里，我已经明白了什么是铁锈。我看到了一把非常锋利的刀，但这把刀完全地、完全地被包裹在防篡改、防儿童、防盗、硬化和密封的塑料外壳中。是的，shell，就像shell的复数形式一样。这些外壳甚至也是成人专用的，成人是一名普通工程师，一般只接受过其他语言的培训。编译器就是包装，当它确切地知道您的行动计划时，它会让您挥舞这把刀。-但是，哦，不，不是任何计划都可以，你的计划必须遵守1938年《刀具安全测量法》及其相关修正案中的每一项规则和规定！！(这可能不是严格意义上的，因为我听说过一个不安全的关键字)。\n但是为什么会有这么多塑料布洛赛登呢？你知道，我知道这是为了防止像我这样心地温和的人，不被那把非常锋利的刀划伤手指。回到元级别，这些手指甚至不一定属于我这个程序员，而是属于代码的最终用户。对于任何对Rust感兴趣的人来说，这都不是什么秘密，这种语言的一个主要驱动因素是能够用同样高效但不太容易受到安全漏洞攻击的东西来替换C++代码。因此，安全塑料的目的不是保护个人编码员，而是保护编码组织。\n好了，你可能已经听够了我的观点，在这个比喻崩溃并真正伤害到某人之前，让我们继续前进吧。\n本课中最先让人大吃一惊的时刻之一是这条编译器消息：\n很自然地，我运行了列出的命令，这会将我带到一个较少的窗口(Buffer？)。包含以下内容：\n重新指定了不可变变量。错误代码示例：&#39；&#39；&#39；&#39；&#39；&#39；&#39；&#39；&#39；&#39；默认情况下，Rust中的变量是不可变的。要修复此错误，请在声明变量时在关键字`let`后添加关键字`mu`。例如：&#39；&#39；&#39；fn main(){设mut x=3；x=5；}&#39；&#39；&#39；\n这让我有点失望(&amp；mldrand)。这个“解释”里没有太多的信息。我继续让rustc向我“解释”更多的随机错误代码，其中大多数似乎也相当小或已被弃用。我希望要么是A)我不需要经常使用这个功能，要么B)我可以创建rustc/Cargo/IntelliJ，默认情况下只需告诉我详细信息即可。\n由于某种原因，当我第一次看到它时，这让我很恼火(这条评论是从我的课堂笔记中逐字摘录的)。仔细一看，它似乎真的对可读性真的很有帮助。\n这看起来是个很方便的把戏。您可以编写代码，就好像您的变量是不可变的一样，但是编译器会为您进行切换。然而，真正让我头晕目眩的是，你在了解所有权之前就已经了解了影子。那么，在这之后，我对影子的天真理解是否改变了呢？我不这么认为&至少我不这么认为。这是我写的一些东西来验证我的学习：\nFn main(){let mut s=string：：from(&#34；hello&#34；)；let r1=&amp；mut s；let r1=&amp；mut s；println！(&#34；{}&#34；，r1)；}。\n&amp；mldrand它起作用了。它还回答了我最初学习所有权时的一个问题。由于某种原因，当我读到书中的例子时，我想Rust可以推断出不可变引用的结束时间，但不能推断出可变引用的结束时间。我对此感到困惑，并有一个后续项目，但这个小例子证明我错了。快乐的日子！\n无效的数组元素访问示例不起作用-它本应产生运行时错误，但却无法编译：\n编译变量V0。1.0(/home/levi/rustprojs/Variables)错误：此操作将在运行时死机--&gt；src/main。RS：5：19|5|设element=a[index]；|^index出界：镜头为5，索引为10|=备注：`#[DENY(无条件_PARGIC)]`默认开启。\n我甚至不知道我是应该称这为“Nit”，还是应该直截了当地说“印象深刻”。铁锈是不是进化到了这本书再也不能欺骗我制造运行时恐慌的地步了？！我向上帝发誓，这是个直夹克级别的包装。热烈的掌声。\n在这节课中拿到了许多好的指针后，我想我已经把自己提升了几个档次。也许是白腰带、双黄尖端或类似的东西&mldr“我们去散散步吧”我心平气和地想。我先向左看，然后向右看，在一条扬起的眉毛的掩护下，我选择向铁锈的肚子走去。\n我选择了一条简单的道路。我选择了一些对所有初学者来说都很具体的东西。我选择了Hello_World&amp；mldr的巅峰。\n&amp；mldr和俯冲我做到了。当我的头撞到这个宏硬的铁柱后，我直接撞到了地上。我的眼睛却直接瞥见了索伦，从那以后，我一直是瞎子：\n#[MACRO_EXPORT]#[STRATE(FEATURE=&#34；RUST1&#34；，SING=&#34；1.0.0&#34；)]#[ALLOW_INTERNAL_USTRATE(PRINT_INTERNAL，FORMAT_ARGS_NL)]MACRO_RULES！Println{()=&gt；($crate：：print！(&#34；\\n&#34；))；($($arg：tt)*)=&gt；({$crate：：IO：：_print($crate：：format_args_nl！($($arg)*)；})}。\n看在上帝的份上，这对我所有感官的辛辣攻击到底是什么？\n我在这里要说实话。见鬼，我不可能在第二十课结束前理解这个宏图。我会吗？实际上我不太确定。我想还有希望吧？第10章、第14章和第19章看起来都将是强制性的。希望强化&&amp；mldr？\n如果在表达式末尾添加分号，则会将其转换为语句，然后该语句将不返回值。当您接下来探索函数返回值和表达式时，请记住这一点。\n这是一种他妈的思维-大约在阅读这篇文章的10分钟前，我对自己说，分号似乎是可选的，在生锈的情况下有点毫无意义。孩子们，我在树林外面很远的地方。\n不过，后来的一个想法确实让我想知道：Rustaceans真的只是在其getter函数的末尾编写表达式，还是显式返回更常见？\n在Rust中，惯用的注释样式以两个斜杠开始注释，注释一直持续到行尾。对于超过一行的注释，您需要在每行包含//，如下所示：\n奇怪的是，/**/样式注释被明确支持-我在读完这篇文章后尝试了一下。但是，整个评论子课没有提到它们吗？我猜这与作者使用的惯用限定词有关。如果是这样的话那很好，我只想知道是谁定义了这些成语，更好的是，给我指给我看“生锈成语圣经”。在围棋中，我们有有效的围棋。\n我想，现在我突然想到，这本书可能就是我正在胡思乱想的那本“圣经”。但即便如此，我仍然认为它应该提到/**/，以及为什么我们不应该使用它们&&和mldr。\n当你是新手的时候，你会看到很多关于Rust的事情，那就是所有权检查，所以我很高兴终于有一章向我展示了一些非常新奇的东西。顺便说一句，如果你还和我在一起，那么恭喜你--你有牛蛙般的耐心。\n现在我要开始这一章，先说我在弦上被耍了。\n这本书真的让我相信“铁锈”中确实有两种弦，我个人认为这对“铁锈”来说是一个非常大胆的举动。只是在接下来的30分钟里，作者才仁慈地告诉我，只有一根绳子！“特殊的”字符串字面值实际上只是在不可变的字符串片引用上加了一些糖。归根结底，我觉得自己被这一点欺骗了，但我想，如果人们不熟悉切片和参考资料等，那么也许这种教学方法是有意义的。\n最终，在一种反高潮的半身像中，这一章对我生锈的大脑来说实际上是相当平淡无奇的。(嘿；我一直生活在可怕的围棋双关语中，好吧！)。在这一章中，我只有两件事想要更多地了解。第一个是特点，哦，天哪，这些听起来很有趣--不过我会有耐心的。第二个来自于引言中的这个花絮：\n对于字符串类型，为了支持可变的、可增长的文本片段，我们需要在堆上分配一定数量的内存(编译时未知)来保存内容。这意味着：\n当我们处理完字符串时，我们需要一种将该内存返回给分配器的方法。\n第一部分由我们完成：当我们调用String：：From时，它的实现请求它所需的内存。这在编程语言中几乎是通用的。\n&amp；mldr我只是希望这本书能告诉我更多信息，即字符串是进行libc malloc调用，还是只是做了一个新的切片，而搅拌器有自己的幕后内存层？我90%肯定这一点稍后需要变得更清楚，以便编写好的Rust代码，这与Go形成鲜明对比，在Go中，对堆和堆栈分配几乎没有控制权(因此，知道或依赖运行时分配器的工作方式不会有很好的回报，因为这也总是会发生变化)。\n这绝对是我可以自己深入了解的东西，但为了这个博客系列和我每晚自己的时间，我在很大程度上将我的探索限制在这本书一分钟一字不变地教给我的内容上。还记得索伦用普林特恩对我的眼睛做了什么吗？\n在这里结束一篇双篇章的帖子，我认为教训是扎实的。默认情况下，不可变变量的恐惧正在消退，因为我了解了一些处理它们的模式。退一步说，在这么早的阶段就有一种语言引入堆栈和堆的概念是很好的，大约一年前我重读了那本C语言书，我甚至不认为里面提到了这些概念！？事实上，我读的最后一本深入研究这些概念的编程书籍是奇妙的RISC-V汇编语言书籍。所以，是的，拉斯特显然是提前为年轻的克拉比准备了餐桌。\n我真的，真的很期待从“铁锈”这本书中解开下一课，希望你和我一起享受这段旅程。像往常一样，我非常感谢评论中的任何指导和更正，直到下一次地鼠和Rustaceans，Nofo a(再见)！", "note_en": "Hello and welcome to the third post in my series about learning Rust. In case you want to hit it from the start,  here’s a link to the first one! This entire series covers my journey from being a completely land-locked Gopher to becoming (hopefully) a hardened Rustacean, able to skitter the hazardous seabed of any application safely.\n Warning: Incoming opinion monologue; feel free to skip to  The Lesson Review review if that’s what you’re after\n  Let me begin not by thwacking loosely about in concepts I know little yet of, as there’s plenty of time for that, but instead allow me to paint the landscapes I see for both Rust and Go. At quite the visceral it occurred to me that these modern languages are built not just to make our coding lives more delightful - but instead to shepherd us into particular engineering and organizational goals.\n The needs for new general purpose languages no longer stem from the “simple” software problems. Take the problems of using variables (Assembly), using custom data types (C), cross-platform, cross-architecture compatibility (JVM languages) or even being dead simple (Python). Today’s languages can instead choose features from all the preceding and  then apply engineering and organizational direction.\n  I’ve been writing in Go as a hobby since 2014 but professionally only since 2018. As a hobbyist I’ll admit I used to think “Go is  opinionated”. That seemed cool, because opinions mean something! Right? But  why was it opinionated Levi, WHY? WAKE UP MAN!\n Well today I have a completely different look on it. Go is simply a language that is very  safe to share across engineers. This is because engineers don’t need to make a lot of decisions when they use Go. If an application has had its design completed in theory then in Go it often really is just a matter of whacking out the code to make it a reality.\n Just look at how much of Go’s development tooling Google owns. With Java, I remember choosing between Ant or Maven for your build tooling. Go doesn’t let you chose. The closest we got to having a choice was with  dep for dependency management. But finally Google caved and  gomod was brought about as the standard. Go does its best to take choices away from you. You don’t need to chose between Tomcat or Jetty - the Go  net/http package will handle 10kRPS for you no problem. Hell I’ve looked at apps serving 50kRPS, whilst  logging a third of said requests simply using  fmt.Println. You just don’t need to stray far from the standard library to scale and that is a huge plus of the language. (A large part of this is also comes from the fact that webservers haven’t changed a heck of a lot in the past 10 years so Go didn’t have to “keep up” - on the other hand my experience with http2 in Go has been far from ideal).\n  This is by far the biggest selling point of using Go  in a company. If you need to hire help you can find basically  anyone with backend experience, and they will pick up 90% of Go in a week or two. You don’t need to worry at all if they have experience with Struts, JUnit or Spring - what’s in the standard library is plenty. I mean it. Do they need to know about passing pointers or values? Not really - general software engineering practices like peer review and simple unit testing will uncover those types of issues with ease.\n Now on the other hand - who in their right mind would hire  me to join their Rust team right now? Nobody - because I would be a gigantic liability to that team.\n Go’s purpose is for dev shops to crank out web services that are scalable, easy to develop and do not require mission critical performance.\n   I’m a noob. 100%. But even so, in my feeble mind I can already see what Rust is. I see a very sharp knife; but this knife is completely and utterly shrouded and encased in tamper-proof, child-proof, thief-proof hardened and sealed plastic shells. Yes shells as in the plural of shell. These shells are even adult-proof too, where the adult is a generic engineer trained generally in other languages only. The compiler is the packaging, and it will let you wield the knife when it knows exactly what your action plan is. -But oh no, not just any plan will do, your plan  must adhere to each and every rule and regulation from the Knife Safety Measurement Act of 1938 and its associated amendments!! (This may not be strictly true as I’ve heard about an  unsafe keyword).\n But why so much plastic broseidon? You know, and I know that it’s to keep mild-minded people like myself exactly, from nicking fingers with that very sharp knife. Warping back to a meta-level, those fingers don’t even necessarily belong to me the coder, but to the end users of the code. It is no secret to anybody even slightly interested in Rust that a major driving factor for the language was to be able to replace C++ code with something  as efficient but much less susceptible to security exploits. Thus, the safety plastic aims not to protect individual coders, but the  coding organization.\n Okay, you’ve probably heard enough of my opinion, let’s move on before this analogy implodes and actually hurts someone.\n    One of the first ‘huh’ moments in this lesson was this compiler message:\n  Naturally I ran the command listed, which took me to a  less window (buffer?) containing the following:\n An immutable variable was reassigned.Erroneous code example:&#39;&#39;&#39;fn main() { let x = 3; x = 5; // error, reassignment of immutable variable}&#39;&#39;&#39;By default, variables in Rust are immutable. To fix this error, add the keyword`mut` after the keyword `let` when declaring the variable. For example:&#39;&#39;&#39;fn main() { let mut x = 3; x = 5;}&#39;&#39;&#39;\n &amp;mldrand this slightly let me down. There isn’t a whole lot of information in this “explanation”. I proceeded to allow  rustc to “explain” some more random error codes to me, most of them seemed also to be quite small or to have been deprecated. I am hoping either A) I don’t have to use this feature much or B) I can make rustc/cargo/intellij just tell me the detailed stuff by default.\n   For some reason this irked me when I first saw it (the comment taken verbatim from my lesson notes). On second look it actually seems really, really helpful for readability.\n   This seems like a really handy trick. You get to write code as if your variable was immutable, but the compiler does the switching for you. What is really messing my head up though is that you learn about Shadowing before you learn about Ownership. So does my naive understanding of shadowing change after this? I don’t think so &amp;mldr at least. Here’s something I wrote to verify my learnings:\n fn  main ()   {    let   mut   s   =   String:: from ( &#34;hello&#34; );    let   r1   =   &amp; mut   s ;    let   r1   =   &amp; mut   s ;    println ! ( &#34;{}&#34; ,   r1 );   }\n &amp;mldrand it works. It also answers a question I had when originally learning ownership. For some reason when reading the examples in the book I came away thinking Rust could infer when immutable references&#39; scopes end, but not mutable ones. I was puzzled by this and had a follow-up item but this little example proves I was wrong. Happy days!\n   The  Invalid array element access example didn’t work - it was supposed to produce a runtime error but instead it failed to compile:\n Compiling   variables   v0 . 1.0   ( / home / levi / rustprojs / variables )   error:  this   operation   will   panic   at   runtime    --&gt;  src / main . rs: 5: 19    |   5   |   let   element   =   a [ index ];    |   ^^^^^^^^   index   out   of   bounds:  the   len   is   5   but   the   index   is   10    |    =   note:  ` #[deny(unconditional_panic)] `   on   by   default\n I don’t even know if I should call this a nit or just straight up be impressed. Did Rust  evolve to the point the  book can no longer trick me into making a runtime panic?! This is some straight-jacket level packaging I swear to god. Much applause.\n   Having picked up many a good pointer during this lesson I figured I had bumped myself up a couple of notches. Maybe white-belt, double-yellow-tip or something along those lines&amp;mldr “ Let’s go for a wander” I thought to myself with quiet confidence. Looking left, and then looking right, under the shelter of a single raised eye-brow I chose to descend toward the belly of Rust.\n  I chose a simple avenue. I chose something concrete to all beginners. I chose the pinnacle of  Hello_World&amp;mldr\n  &amp;mldr and dive I did. Straight into the ground after clanking my head into a hard iron post of this macro. My eyes but glimpsed Sauron directly and from then on and always, I am blind:\n #[macro_export]   #[stable(feature =  &#34;rust1&#34; , since =  &#34;1.0.0&#34; )]   #[allow_internal_unstable(print_internals, format_args_nl)]   macro_rules !   println   {    ()   =&gt;   ( $crate:: print ! ( &#34;\\n&#34; ));    ( $($arg: tt ) * )   =&gt;   ({    $crate:: io:: _print ( $crate:: format_args_nl ! ( $($arg ) * ));    })   }\n What in God’s sweet name is this acrid assault on all of my senses?\n I am going to be honest here. There is no way in hell I will understand this macro by the end of my twentieth lesson. Will I?I’m not sure actually. I guess there’s hope? Chapters  10,  14 and  19 all look they will be mandatory.  Hoping Intensifies &amp;mldr ?\n   If you add a semicolon to the end of an expression, you turn it into a statement, which will then not return a value. Keep this in mind as you explore function return values and expressions next.\n This was a mind fuck - about 10 minutes before reading this I thought to myself that semi-colons seemed optional and kind of pointless in rust. Boy was I well outside the woods.\n A later thought did have me wondering though; do Rustaceans really just write expressions at the end of their getter functions or is it more common to explicitly  return?\n   In Rust, the idiomatic comment style starts a comment with two slashes, and the comment continues until the end of the line. For comments that extend beyond a single line, you’ll need to include // on each line, like this:\n What’s weird is that  /* */ style comments are clearly supported - I tried it after reading this. The entire Comments sub-lesson doesn’t make  any mention of them though? I’m guessing this has something to do with the  idiomatic qualifier the authors used. If this  is the case then that’s fine, I’d just like to know who defines the idioms and better yet, point me to the Rust Idioms Bible. In Go we have  effective Go.\n I guess it occurs to me now that this very book could  be the Bible I’m faffling about&amp;mldr.  But even then I still think it should mention  /**/’s and why we shouldn’t used them&amp;mldr\n   One thing you see mentioned a lot about Rust when you’re new is the ownership checker, so I was very happy to finally reach a chapter showing me something really novel. By the way, if you’re still with me then congratulations - you have the patience of a bullfrog.\n Now I’ll start this chapter off by saying I was tricked about strings.\n The book really led me to believe there are literally two types of strings in Rust, which I personally thought was a very ballsy move on Rust’s part. Only over the next thirty minutes did the authors mercifully reveal to me that there is but ONE  String! The “special” string literals are really just some sugar over an immutable string slice reference. Ultimately I kind of felt duped by this but I guess if people aren’t familiar with slices and references etc then maybe this teaching approach makes sense.\n Ultimately though, in a kind of anti-climactic bust, this chapter was actually quite uneventful for my rusty brain. (Hey; I’ve been living with terrible Go puns since forever ok!) There were only two things from the chapter in which I wanted to know more about. The first is Traits, oh my goodness these sound intriguing - I’ll be patient for this though. The second was from this tidbit in the  introduction:\n With the String type, in order to support a mutable, growable piece of text, we need to allocate an amount of memory on the heap, unknown at compile time, to hold the contents. This means:\n We need a way of returning this memory to the allocator when we’re done with our String.\n That first part is done by us: when we call String::from, its implementation requests the memory it needs. This is pretty much universal in programming languages.\n &amp;mldrI just wish the book told me a bit more, i.e. does  String make a libc malloc call or does it just make a new slice and the comiler has its own behind the scenes memory layer? I’m 90% sure this will  need to become clearer later in order to write good Rust code, which is in stark contrast with Go where have little-to-no control over heap vs stack allocations (and subsequently it doesn’t pay off very well to know or rely on how the runtime allocator works as this has always been subject to change too).\n This is definitely something I could just dive into  String to check out for myself but for the sake of this blog series and my own time each night, I’m largely restricting my explorations to what the book is teaching me verbatim for the minute.  Also remember what Sauron did to my eyes with  println!\n  To cap-off a double-chapter post here, I think the lessons were solid. The scariness of  immutable variables by default is subsiding as I learn some of the patterns for dealing with them. Taking a step back it is nice to have a language introduce the concepts of the stack and heap at such an early stage, I re-read the  C book about a year ago and I don’t even think those concepts were mentioned in it!? In fact the last programming book I read that went deep on these concepts was the fantastic  RISC-V Assembly Language book. So yeah, Rust is clearly setting the table well in advance for young crabbies.\n I’m really, really looking forward to unpacking the next lessons from the  Rust book and hope that you’re enjoying the journey with me. As usual I greatly appreciate any guidance and corrections in the comments, until next time Gophers and Rustaceans, Nofo a (Byebye)!", "posttime": "2020-11-03 17:21:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,身份", "title": "以地鼠的身份学习铁锈，第三部分", "title_en": "Learning Rust as a Gopher, part 3", "transed": 1, "url": "https://levpaul.com/posts/rust-lesson-3-and-4/", "via": "", "real_tags": ["rust", "身份"]}, {"category": "", "categoryclass": "", "imagename": "3596a6b83f68cb4436e56f1bdbfccd44.jpg", "infoid": 1032943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月有消息称，IBM将收购惠普(Hewlett-Packard)，并将其一分为二--一家IT咨询公司和一个时髦的合规部门--这标志着另一家伟大的工作站公司“一切照旧”的终结。\n关于计算历史的一个小插曲。你可以想象个人计算是由两个截然不同的思想流派驱动的。以施乐(Xerox Parc)、贝尔实验室(Bell Labs)、学术界和军方等研究机构为代表的“自上而下”的学校提出了一个问题：“如果每个人都有自己的小型机，世界会是什么样子？”他们把UNIX这样的大型分时系统先安装在员工的办公桌下，然后再安装在员工的办公桌上，供自己使用。\n“自下而上”的学校是由业余爱好者组成的，他们问道：“我们能用便宜的部件制造出一台有趣的电脑吗？”因此，像美国的苹果和MITS，英国的橡子和辛克莱无线电公司，以及其他公司，采用了通常用作“真实”电脑的外围控制器的芯片，并围绕这些芯片建立了互动编程系统。微型计算机革命来自自下而上的学校，因为他们让家庭计算机变得负担得起。工作站革命来自自上而下的学校，因为他们使强大的按需计算成为可能。\n这两所学校在20世纪80年代走得非常近，当时摩托罗拉68000系列CPU(以及68881/68882浮点处理器和68851内存单元)是各种处理器的首选，从雅达利520ST这样的入门级个人电脑，到世嘉Mega Drive(美国的Genesis)这样的游戏机，再到Next Computer、Sun Microsystems和Apollo Computer最昂贵的Unix工作站。\n但随后，工作站制造商根据RISC设计原则在他们自己的CPU架构上投入了大量资金，这两家公司再次分道扬镳。工作站市场变得高度分化：IBM的RS/6000(后来的PowerPC)，Digital Equipment Corp的Alpha，MIPS的MIPS，Sun的SPARC，HP的PA-RISC。这些工作站上的软件虽然表面上非常相似，但实际上也是不同的，而且出人意料地不兼容。从HP-UX获取一个程序，您将很难在NeXTSTEP上运行它，除非作者共享源代码并使用新出现的GNU autotools来支持可移植的构建。正如尤达所说：UNIX之战已经开始。\n当然，我们知道今天的(台式机)计算世界主要是英特尔，工作站大多是花哨的个人电脑，而不是垂直整合的公司定制的设计，苹果是价值2万亿美元的异类。我们是如何做到这一点的，是因为商品部件足够好，工作站级硬件没有明显的优势。高端PC可以很容易地运行System V UNIX(Solaris就是早期的例子)、BSD(386BSD，后来成为FreeBSD或NeXTSTEP)或Windows NT等工作站操作系统。\n在这一过程中，工作站公司进行了整合(阿波罗最终被并入惠普；MIPS并入SGI)或完全消失(Sun成为甲骨文硬件公司；SGI破产并将其资产出售给SGI；Symbolics也做了类似的事情-顺便说一句，Symbolics是第一家拥有.com域名的公司)。IBM早在很久以前就已经停止生产自有品牌的个人电脑，而拆分的消息意味着现在很少有工作站公司以“过去”的形式进行交易。我能想到的唯一没有对公司结构进行重大调整的公司是施乐和索尼，它们的管理层可能甚至都不知道他们出售了工作站。\n随着工作站的消亡，失去的是一种商业模式，在这种模式下，你将昂贵的计算机作为集成解决方案的一部分销售到特定的垂直市场，在这个市场，昂贵的解决方案的成本将比用廉价的PC拼凑出的东西要低得多。为什么？我认为人们现在使用计算机时有一个更低的期望和更高的痛苦门槛；他们期望基于自己的经验产生一定程度的摩擦，并将这种期望转化为不属于这种期望的领域。正如我在第2期中所描述的那样，计算是一个柠檬市场。\n组织会去找工作站供应商，因为他们很好地解决了特定的问题。如果你在人工智能领域，你需要符号学。计算机图形学，SGI。电信业，应该是Sun。如果您想用Ada为军工复合体编写软件，您将购买一台Rational工作站。是的，第一个IDE是硬件和软件的完全集成软件包。当然，还有苹果的桌面出版，Mac本身就是一个工作站。人们之所以会购买电脑，是因为AutoCAD、Quark或MATHEMICA等应用程序在它们上运行得很好。他们不会购买电脑，然后浏览应用程序商店，看看它是否能做任何有用的事情。\n奇怪的是，现在用集成解决方案迎合这些垂直市场比以往任何时候都更容易。免费软件的广泛使用意味着“作为一台台式计算机”的基本工作可以免费处理，因此企业可以专注于贡献有价值的定制行为。硬件成本比以往任何时候都要低：高性能SoC和Raspberry Pi和Rock64等单板电脑的出现，应该会让电脑作为应用程序的配件出售，而不是反过来。\n在高科技领域，工程师可以很容易地拥有合适的计算机工具箱，就像机械师有不同的工具来完成他们的任务一样。这款芯片有一个由PCI-E和JTAG连接的FPGA，可实现快速的硬件原型设计。这个连接到一个用于可视化的高吞吐量GPU；那个连接到一个用于科学模拟的高容量GPU。\n通用硬件供应商想让我们相信，一台无所不能的计算机是最适合一切的：你不需要卡车，所以这里有一辆车。但是当你拖着一吨货物的时候，你会发现花更多的钱买一辆卡车更便宜，也更令人满意。好的，做任何事都是没用的。", "note_en": "Last month’s news that  IBM would do a Hewlett-Packard and divide into two—an IT consultancy and a buzzword compliance unit—marks the end of “business as usual” for yet another of the great workstation companies.\n A quick aside on computing history. You can imagine personal computing being driven by two distinct schools of thought. The “top down” school, represented by research-led organisations including Xerox PARC, Bell Labs,academia and the military, asked “what would the world be like if everyone had their own minicomputer”? They took large, time-sharing systems like UNIX and installed them first under, then on, employees’ desks for their own personal use.\n The “bottom up” school was made up of hobbyists who asked “can we make an interesting computer out of inexpensive components”? Thus companies like Apple and MITS in the US, Acorn and Sinclair Radionics in the UK, and others took chips that were usually used as peripherals controllers in “real” computers and built interactive programming systems around them. The microcomputer revolution came from the bottom-up school, as they made home computing affordable. The workstation revolution came from the top-down school, as they made powerful on-demand computing feasible.\n The two schools came into very close proximity in the 1980s, when the Motorola 68000 family of CPUs (along with the 68881/68882 FPU and 68851 MMU) were the processors of choice in everything from entry-level PCs like the Atari 520ST, through games consoles like the Sega Mega Drive (Genesis in the US), to the most expensive UNIX workstations from NeXT Computer, Sun Microsystems, and Apollo Computer.\n But then the workstation makers invested heavily in their own CPU architectures based on RISC design principles and again the two diverged. The workstation market became highly differentiated: RS/6000 from IBM (later PowerPC), Alpha from Digital Equipment Corp, MIPS from, well, MIPS, SPARC from Sun, PA-RISC from HP. The software on these workstations, while superficially very similar, was also differentiated and surprisingly incompatible. Take a program from HP-UX and you’ll have difficulty running it on NeXTSTEP, unless the authors shared the source code and used the nascent GNU autotools to support portable building. As Yoda said: begun, the  UNIX wars have.\n Of course we know that the (desktop) computing world today is mostly Intel and that workstations are mostly fancy PCs, rather than bespoke designs by vertically-integrated companies, Apple being the two trillion dollar outlier. How we got here was that the commodity parts got good enough that there was no evident advantage to workstation-grade hardware. A high-end PC could easily run a workstation OS like System V UNIX (Solaris was an early example), BSD (386BSD which later became FreeBSD, or NeXTSTEP) or Windows NT.\n Along the way, the workstation companies consolidated (Apollo and eventually DEC got absorbed into HP; MIPS into SGI) or disappeared altogether (Sun became Oracle Hardware; SGI went bankrupt and sold its assets to sgi; Symbolics did similar—incidentally Symbolics was the first company with a .com domain). IBM long ago stopped even making its own brand PCs, and the news of its split means that there are now very few workstation companies trading in the same form they had “back in the day”. The only ones I can think of that have not had major changes to their corporate structures are Xerox and Sony, whose management may not even have known that they sold workstations.\n What’s got lost alongside the death of the workstation is the business model where you sell expensive computers as part of an integrated solution into a particular vertical market, where that expensive solution will cost a lot less than cobbling something together out of cheap PCs. Why? I think people have a lower expectation and higher pain threshold when using computers now; they expect an amount of friction based on their own experience and translate that expectation into realms where it doesn’t belong. As I described way back in issue 2,  computing is a lemon market.\n Organisations would go to the workstation vendors because they solved particular problems very well. If you’re in AI, you need Symbolics. Computer graphics, SGI. Telecoms, that’d be Sun. If you want to write software in Ada for the military-industrial complex, you’ll be buying a Rational workstation. Yes, the first IDE was a completely integrated package of hardware and software. And, of course, Apple for Desktop Publishing, the Mac being a workstation of sorts itself. People would buy computers  because applications like AutoCAD, Quark or Mathematica ran well on them. They wouldn’t buy the computer then browse the App Store to see whether it could do anything useful.\n And the strange thing is that catering to those vertical markets with integrated solutions is easier than ever now. The wide availability of free software means that the basic job of “being a desktop computer” is taken care of at zero cost, so business can focus on contributing valuable bespoke behaviour. And hardware costs are lower than ever: the availability of high-capability SoCs and single-board computers like the Raspberry Pi and Rock64 should make it a no-brainer to sell the computers as accessories for the applications, not the other way around.\n In high-tech domains, an engineer could readily have a toolchest of suitable computers in the same way that a mechanic has different tools for their tasks. This one has an FPGA connected by both PCI-E and JTAG to allow for quick hardware prototyping. This one is connected to a high-throughput GPU for visualisations; that one to a high-capacity GPU for scientific simulations.\n The general purpose hardware vendors want us to believe that an okay-at-anything computer is the best for everything: you don’t need a truck, so here’s a car. But when you’re hauling a ton of goods, you’ll find it cheaper and more satisfying to shell out more for a truck. Okay-at-anything is good for nothing.", "posttime": "2020-11-03 17:21:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不合时宜,demise", "title": "工作站的不合时宜的消亡", "title_en": "The Untimely Demise of Workstations", "transed": 1, "url": "https://deprogrammaticaipsum.com/the-untimely-demise-of-workstations/", "via": "", "real_tags": ["不合时宜", "demise"]}, {"category": "", "categoryclass": "", "imagename": "db46728e7f2320d9903ae1343cf3562d.jpg", "infoid": 1032939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像这样的帮助支持视频：https://www.patreon.com/cgpgrey**CGP灰色T恤出售！**：http://www.cgpgrey.com/t-shirt观看完整系列的策略...", "note_en": "Help support videos like this: https://www.patreon.com/cgpgrey **CGPGrey T-Shirts for sale!**: http://www.cgpgrey.com/t-shirt Watch the full series of Politi...", "posttime": "2020-11-03 16:16:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cgp,post", "title": "首次通过投票后的问题(CGP Grey，2011)", "title_en": "Problems with First Past the Post Voting (CGP Grey, 2011)", "transed": 1, "url": "https://www.youtube.com/watch?v=s7tWHJfhiyo&list=PLNCHVwtpeBY4mybPkHEnRxSOb7FQ2vF9c&index=1", "via": "", "real_tags": ["cgp", "post"]}, {"category": "", "categoryclass": "", "imagename": "00b2a6593df8aa8874195324644d4928.jpg", "infoid": 1032937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "SpaceX公开的Starlink测试版的一些参与者报告说，网速超过了95%的美国互联网用户。\nStarLink是一个由数万颗卫星组成的星座，发射的目的是向地球传输互联网服务，特别是连接薄弱的农村地区。据Business Insider报道，SpaceX告诉用户在公测期间要期待适度的信号，但一些用户已经比传统互联网提供商有了更好的运气。\nSpaceX从一开始就明确表达了它的期望：这家太空公司称这次公开测试是“总比没有测试好”，并建议用户可能会看到50到150 Mbps的速度。\n“Starlink将永远改变这个游戏，”一位来自蒙大拿州农村的用户在Reddit上分享他们174 Mbps的下载速度时说。另一位Beta测试者吹嘘他们在西雅图的结果，虽然略低，但仍好于美国95%的地区。\n当然，这些用户得到了他们所支付的回报：据Business Insider报道，参加公测意味着每月支付99美元，再加上购买Starlink路由器、三脚架和允许用户连接的终端的一次性费用499美元。\n目前，Starlink互联网每隔几分钟就会中断几秒钟-SpaceX告诉用户，这是一个预测到的故障-但随着更多卫星的发射和覆盖变得更加全面，这些中断可能会消失。", "note_en": "Some of the participants in SpaceX’s public Starlink beta are reporting internet speeds higher than 95 percent of U.S. internet users.\n Starlink, a constellation of what will eventually be  tens of thousands of satellites, was launched for the purpose of beaming down internet service to the planet, especially rural areas with weak connections. SpaceX told users to expect moderate signals during the public beta,   Business Insider  reports, but some users have already had better luck than they ever did with a conventional internet provider.\n  SpaceX made its expectations clear from the beginning: The space company called the public test a “Better Than Nothing Beta” and suggested users might see speeds of 50 to 150 Mbps.\n   “Starlink will forever change the game,” one user from rural Montana  said on Reddit as they shared their 174 Mbps download speeds. Another beta tester  boasted of their results in Seattle, which were slightly lower but still better than 95 percent of the U.S.\n  Of course, these users are getting what they paid for: Participation in the public beta means paying $99 per month on top of a one-time $499 expense for a Starlink router, tripod, and terminal that allows users to connect,  Business Insider reports.\n For now, Starlink  internet cuts off for seconds at a time every couple of minutes — a predicted glitch that SpaceX told users to expect — but those interruptions will likely fade as more satellites are launched and coverage becomes more comprehensive.", "posttime": "2020-11-03 15:54:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,beta", "title": "StarLink Beta在美国的表现超过了大多数互联网", "title_en": "Starlink Beta Has Outperformed Most Internet in the US", "transed": 1, "url": "https://futurism.com/the-byte/starlink-beta-outperformed-most-internet-us", "via": "", "real_tags": ["美国", "beta"]}]