[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1070574, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "LWN 订阅者的好处 订阅 LWN 的主要好处是帮助我们保持发布，但除此之外，订阅者可以立即访问所有站点内容并访问许多额外的站点功能。请今天报名！低级文件描述符是 Linux 系统中的基本对象之一。文件描述符是一个简单的整数值，可以引用一个打开的文件——或者一个网络连接、一个正在运行的进程、一个加载的 BPF 程序或一个命名空间。多年来，使用文件描述符来引用瞬态对象已经发展到很难证明使用其他任何东西的 API 是合理的。有趣的是，io_uring 子系统", "note_en": "Benefits for LWN subscribers The primary benefit from  subscribing to LWN is helping to keep us publishing, but, beyond that, subscribers get immediate access to all site content and access to a number of extra site features. Please sign up today!\n   The lowly file descriptor is one of the fundamental objects in Linuxsystems. A file descriptor, which is a simple integer value, can refer to anopen file — or to a network connection, a running process, a loaded BPFprogram, or a namespace. Over the years, the use of file descriptors to refer to transient objectshas grown to the point that it can be difficult to justify an API thatuses anything else. Interestingly, though, the  io_uring subsystem", "posttime": "2021-07-30 12:16:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "uring,files", "title": "Io_uring 的无描述符文件", "title_en": "Descriptorless Files for Io_uring", "transed": 1, "url": "https://lwn.net/Articles/863071/", "via": "", "real_tags": ["uring", "files"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "背景 本研究的目的是评估先前感染 SARS-CoV-2 的人接种 COVID-19 疫苗的必要性。方法 2020 年 12 月 16 日，即开始接种 COVID-19 疫苗的那天，在俄亥俄州工作的克利夫兰诊所卫生系统的员工被包括在内。任何至少 42 天前检测出 SARS-CoV-2 呈阳性的受试者都被认为是先前感染过的。一个被认为在收到第二剂 SARS-CoV-2 mRNA 疫苗后 14 天接种了疫苗。在未来五个月内，在接种疫苗的先前感染受试者中，SARS-CoV-2 感染的累积发生率与未接种疫苗的先前感染受试者、接种疫苗的先前未感染受试者以及先前未感染疫苗的受试者的发生率进行了比较。未接种疫苗。结果 在纳入的 52238 名员工中，2579 名先前感染过的受试者中有 1359 名（53%）未接种疫苗，而先前未感染的 49659 名受试者中有 20804 名（42%）。 SARS-CoV-2 感染的累积发生率在先前感染的未接种疫苗的受试者、先前感染的接种疫苗的受试者和先前未感染的接种疫苗的受试者中几乎保持为零，而先前未感染的未接种疫苗的受试者的累积发病率则稳步增加。在研究期间，1359 名先前感染但未接种疫苗的受试者中没有一人感染了 SARS-CoV-2。在 Cox 比例风险回归模型中，在调整流行阶段后，疫苗接种与先前未感染的 SARS-CoV-2 感染风险显着降低相关（HR 0.031，95% CI 0.015 至 0.061），但与在先前感染的患者中（HR 0.313，95% CI 0 至无穷大）。结论 感染了 SARS-CoV-2 的个体不太可能从 COVID-19 疫苗接种中受益，并且可以安全地优先接种那些以前没有感染过的疫苗。总结 在美国医疗保健系统的 52238 名员工中检查了 COVID-19 的累积发病率。在过去五个月的研究中，2579 名先前感染 COVID-19 的人（包括 1359 名未接种疫苗的人）中没有人发生 COVID-19。我确认已遵循所有相关的道德准则，并已获得任何必要的 IRB 和/或道德委员会的批准。为所述研究提供批准或豁免的 IRB/监督机构的详细信息如下：\n该研究得到了克利夫兰诊所机构审查委员会的批准。同意放弃知情同意和放弃 HIPAA 授权以允许研究团队访问个人健康信息，并理解未经 IRB 的额外批准，不得向研究团队以外的任何人共享或发布可识别数据。已获得所有必要的患者/参与者同意，并已存档适当的机构表格。我了解所有临床试验和任何其他前瞻性干预研究必须在 ICMJE 批准的注册中心注册，例如 ClinicalTrials.gov。我确认手稿中报告的任何此类研究已注册并提供试验注册 ID（注意：如果发布回顾性注册的前瞻性研究，请在试验 ID 字段中提供声明，解释为什么未提前注册该研究） .我已遵循所有适当的研究报告指南，并上传了相关的 EQUATOR Network 研究报告清单和其他相关材料作为补充文件（如果适用）。公共数据存储库中提供了去标识化的主题级数据和重现结果的代码。", "note_en": "Background The purpose of this study was to evaluate the necessity of COVID-19 vaccination in persons previously infected with SARS-CoV-2.\n Methods Employees of the Cleveland Clinic Health System working in Ohio on Dec 16, 2020, the day COVID-19 vaccination was started, were included. Any subject who tested positive for SARS-CoV-2 at least 42 days earlier was considered previously infected. One was considered vaccinated 14 days after receipt of the second dose of a SARS-CoV-2 mRNA vaccine. The cumulative incidence of SARS-CoV-2 infection over the next five months, among previously infected subjects who received the vaccine, was compared with those of previously infected subjects who remained unvaccinated, previously uninfected subjects who received the vaccine, and previously uninfected subjects who remained unvaccinated.\n Results Among the 52238 included employees, 1359 (53%) of 2579 previously infected subjects remained unvaccinated, compared with 20804 (42%) of 49659 not previously infected. The cumulative incidence of SARS-CoV-2 infection remained almost zero among previously infected unvaccinated subjects, previously infected subjects who were vaccinated, and previously uninfected subjects who were vaccinated, compared with a steady increase in cumulative incidence among previously uninfected subjects who remained unvaccinated. Not one of the 1359 previously infected subjects who remained unvaccinated had a SARS-CoV-2 infection over the duration of the study. In a Cox proportional hazards regression model, after adjusting for the phase of the epidemic, vaccination was associated with a significantly lower risk of SARS-CoV-2 infection among those not previously infected (HR 0.031, 95% CI 0.015 to 0.061) but not among those previously infected (HR 0.313, 95% CI 0 to Infinity).\n Conclusions Individuals who have had SARS-CoV-2 infection are unlikely to benefit from COVID-19 vaccination, and vaccines can be safely prioritized to those who have not been infected before.\n Summary Cumulative incidence of COVID-19 was examined among 52238 employees in an American healthcare system. COVID-19 did not occur in anyone over the five months of the study among 2579 individuals previously infected with COVID-19, including 1359 who did not take the vaccine.\n      I confirm all relevant ethical guidelines have been followed, and any necessary IRB and/or ethics committee approvals have been obtained.\n  The details of the IRB/oversight body that provided approval or exemption for the research described are given below:\n The study was approved by the Cleveland Clinic Institutional Review Board. A waiver of informed consent and waiver of HIPAA authorization were approved to allow access to personal health information by the research team, with the understanding that sharing or releasing identifiable data to anyone other than the study team was not permitted without additional IRB approval.\n All necessary patient/participant consent has been obtained and the appropriate institutional forms have been archived.\n  I understand that all clinical trials and any other prospective interventional studies must be registered with an ICMJE-approved registry, such as ClinicalTrials.gov. I confirm that any such study reported in the manuscript has been registered and the trial registration ID is provided (note: if posting a prospective study registered retrospectively, please provide a statement in the trial ID field explaining why the study was not registered in advance).\n  I have followed all appropriate research reporting guidelines and uploaded the relevant EQUATOR Network research reporting checklist(s) and other pertinent material as supplementary files, if applicable.\n   De-identified subject-level data and code to reproduce the results are available on a public data repository.", "posttime": "2021-07-30 12:13:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "感染者,previously,研究", "title": "先前感染者接种 Covid-19 疫苗的必要性", "title_en": "Necessity of Covid-19 vaccination in previously infected individuals", "transed": 1, "url": "https://www.medrxiv.org/content/10.1101/2021.06.01.21258176v3", "via": "", "real_tags": ["感染者", "研究"]}, {"category": "", "categoryclass": "", "imagename": "a1125902687c75da112c32742ba9b4b2.jpg", "infoid": 1070572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "State Of Julia（Stefan Karpinksi、Viral Shah、Jeff Bezanson、Keno Fischer）：2021 年 Julia 状态概览。", "note_en": "State Of Julia (Stefan Karpinksi, Viral Shah, Jeff Bezanson, Keno Fischer): An overview of the state of Julia in 2021.", "posttime": "2021-07-30 12:13:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "julia,状态", "title": "Julia 状态和路线图", "title_en": "State of Julia and Roadmap", "transed": 1, "url": "https://www.youtube.com/watch?v=IlFVwabDh6Q", "via": "", "real_tags": ["julia", "状态"]}, {"category": "", "categoryclass": "", "imagename": "e85c8c562432dba6e195ee40661c8a5e.jpg", "infoid": 1070571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您一直在焦急地等待 Facebook 的智能眼镜，我们有一些好消息要告诉您：它们将成为该公司的下一个消费设备。首席执行官马克扎克伯格周三在 Facebook 第二季度财报电话会议上证实了这一消息，同时就公司即将推出的产品周期提供了一些见解。 “展望未来，下一个产品发布将是雷朋与 EssilorLuxottica 合作推出的首款智能眼镜，”他说。虽然扎克伯格没有提供任何关于发布时间表的细节，但他确实表示该设备看起来就像普通眼镜一样。这位 Facebook 首席执行官继续解释说，“这款眼镜具有标志性的外形，可以让你做一些非常整洁的事情。”就功能和规格而言，我们不确定那些“非常整洁的东西”会是什么。但这并不能阻止 Facebook 将该产品宣传为即时“经典”。去年，这家社交媒体巨头告诉 The Verge，“该设备不会被归类为增强现实 (AR) 设备，也不会有任何类型的集成显示器。”该报告继续指出，这款眼镜看起来可能与 Snapchat 的 Spectacles 或亚马逊的 Echo Frames 相似——两者都与日常服装相得益彰。早些时候的声明呼应了扎克伯格在周三的电话会议上关于这个主题的最后一句话。在继续讨论其他话题之前，这位首席执行官表示，他“很高兴将 [智能眼镜] 送到人们的手中，并在未来向全增强现实眼镜的旅程中继续取得进展。”\n虽然这些“智能眼镜”不被认为是完整的 AR，但该项目仍然是 Facebook Reality Labs (FRL) 的一部分——该公司的 XR 技术研发机构。因此，这些智能眼镜收集的任何数据和反馈都有助于为 Facebook 目前正在测试的轻量级 AR 眼镜 Project Aria 做出贡献。 Facebook 计划在 2021 年推出这些雷朋眼镜的确切时间还有待观察。但考虑到我们已经过了半年，公司很可能很快就会发布它们——也许是在假期到来的时候。", "note_en": "If you&#39;ve been anxiously awaiting  Facebook&#39;s smart glasses, we have some good news for you: They&#39;re slated to be the company&#39;s next consumer device.\n CEO Mark Zuckerberg confirmed the news on Wednesday during Facebook&#39;s second quarter earnings call, while providing some insight on the company&#39;s upcoming product cycle.\n &#34;Looking ahead here, the next product release will be the launch of our first smart glasses from Ray-Ban in partnership with EssilorLuxottica,&#34; he said.\n While Zuckerberg didn&#39;t provide any specifics regarding a timeframe for release, he did state that the device will look just like regular glasses . The Facebook CEO went on to explain that &#34;the glasses have their iconic form factor and they let you do some pretty neat things.&#34;\n We&#39;re not exactly sure what those &#34;pretty neat things&#34; will be as far as features and specs go. But that&#39;s not stopping Facebook from hyping the product as an instant &#34;classic.&#34;\n  Last year, the social media giant told  The Verge &#34;that the device will not be classified as an Augmented Reality (AR) device, and it will not have an integrated display of any kind.&#34; That report goes on to note that the glasses may look similar to  Snapchat&#39;s Spectacles or  Amazon&#39;s Echo Frames — both of which blend in fairly well with everyday attire.\n That earlier statement echoes Zuckerberg&#39;s last words on the subject during Wednesday&#39;s call. Before moving on to other topics, the CEO said he was &#34;excited to get [the smart glasses] into people&#39;s hands and to continue to make progress on the journey towards full augmented reality glasses in the future.&#34;\n While these &#34;smart glasses&#34; aren&#39;t considered to be full AR, the project is still part of Facebook Reality Labs (FRL) — the company&#39;s R&amp;D outfit for XR technologies. So, any data and feedback gathered by these smart glasses could help contribute to  Project Aria, the lightweight AR glasses Facebook is  currently testing.\n It remains to be seen when exactly  in 2021 Facebook plans on launching these Ray-Ban glasses. But considering we&#39;re more than halfway through the year already, it&#39;s likely the company will release them very soon — perhaps in time for the holiday season.", "posttime": "2021-07-30 11:27:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "mashable,眼镜", "title": "可混搭", "title_en": "Mashable", "transed": 1, "url": "https://mashable.com/article/facebook-zuckerberg-ray-ban-smart-glasses-coming-soon-2021", "via": "", "real_tags": ["mashable", "眼镜"]}, {"category": "", "categoryclass": "", "imagename": "f4539453bd3b8f5e8c4442ac1797f8a6.jpg", "infoid": 1070570, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，政策制定者一直认为机器学习——当前人工智能炒作浪潮的基础——是机器人技术进步的基础，这将预示着“第四次工业革命”——但两者并没有真正融合在一起，或者说至少不要使用当前流行的方法。 “需要大量数据的理想化算法会失败，”首席研究员 Filip Piękniewski 告诉我。 “现实是我们不知道如何为机器构建与我们自己的大脑一样强大的控制系统，但我们只是喜欢自欺欺人地认为我们可以做到这一点，”资深机器人专家和麻省理工学院前负责人AI 实验室 Rodney Brooks 更加严厉地批评 OpenAI 的辩护，即“市场还没有准备好”迎接 Cube-dropping Cube 求解器这样的奇迹。 “也许&#39;问题&#39;是市场已经成熟，并且了解什么是有价值的，什么是不有价值的。”人工智能的危机已经酝酿多年。系统是“脆弱的”——一调整就停止工作——而不是“通用的”，内部行话，这意味着它们只能做一项工作。正如圣达菲大学的 Melanie Mitchell 教授和最易读的外行人对当今人工智能极限的介绍的作者所说的那样——所有这一切都意味着今天的人工智能非常愚蠢。米切尔最近的一篇论文概述了人工智能研究人员提出的四个谬论，其中最具破坏性的是自欺欺人，因为计算机速度更快，它们变得更聪明。 Grabby 关于蛋白质可视化的新闻稿不会改变这些基本原理。唉，政府和白厅在应对人工智能危机和做出更明智的资源分配决策方面能力不足。英国政府已经创建了一个由重叠的 quangos 和咨询组织组成的庞大网络。历届政府都增加了一个新政府，而没有废除或合并其他政府。因此，开放数据研究所紧随其后的是 Alan Turing 研究所，然后是 Ada Lovelace 研究所——以及 Goldstaub 女士的人工智能委员会。为了更好地衡量，我们还必须包括数据道德与创新中心。这是一个由共同朋友组成的舒适、适合俱乐部的世界。没有人想过警告决策者人工智能的问题——这更像是当地的苏联隐瞒了 Gosplan 的真实生产数字。", "note_en": "For years policymakers have believed that machine learning – the foundation of the current wave of AI hype – is fundamental to advances in robotics that will herald a “Fourth Industrial Revolution” – but the two don’t really go well together at all, or at least not using currently fashionable methods.\n “Data-hungry, idealised algorithms simply fail,” leading researcher Filip Piękniewski told me. “The reality is we don’t know how to build control systems for machines that would be anywhere as robust as our own brains but we just love to fool ourselves into thinking we can do that,” The veteran robotics expert and former head of MIT’s AI lab Rodney Brooks was even more scathing about OpenAI’s defence that the “market wasn’t ready” for such wonders as the Cube-dropping Cube solver. “Perhaps the ‘problem’ is that the market is mature and understands what is valuable and not.”\n The crisis in AI has been brewing for years. Systems are ‘brittle’ – one tweak and they stop working – and not ‘generalisable’, insider jargon that means they only do one job. As Professor Melanie Mitchell of Santa Fe University, and author of the most readable layman’s introduction to the limits of today’s AI, said – all that means today’s AI is pretty dumb. A recent paper by Mitchell outlines four fallacies advanced by AI researchers, the most devastating of which is kidding ourselves that because computers are faster, they’re getting smarter. Grabby press releases about visualising proteins do not change these fundamentals.\n Alas, the Government and Whitehall are uniquely poorly equipped to deal with the AI crisis and make smarter resource allocation decisions. UK governments have created a vast network of overlapping quangos and advisory organisations. Each successive government added a new one, without abolishing or merging the others. So the Open Data Institute was followed by the Alan Turing Institute and then the  Ada Lovelace Institute – along with Ms Goldstaub’s AI Council. For good measure, we must also include the Centre for Data Ethics and Innovation. It’s a cosy, clubbable world of mutual friends. No one has thought to warn policymakers of the problems with AI – that would be rather like the local Soviet withholding the true production numbers from Gosplan.", "posttime": "2021-07-30 11:26:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "啦啦队,thrall,人工智能", "title": "我们的政客们被一群 AI 啦啦队迷住了", "title_en": "Our politicians are in thrall to a cabal of AI cheerleaders", "transed": 1, "url": "https://www.telegraph.co.uk/business/2021/07/26/politicians-thrall-cabal-ai-cheerleaders/", "via": "", "real_tags": ["啦啦队", "thrall", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "23c06e5f84c0a4cb0ed97fa9d4b03230.jpeg", "infoid": 1070569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在转向电动汽车所有权时经常听到的宣传之一是电动汽车的维护成本更低。但是，当我们驾驶特斯拉 Model 3 接近 40,000 英里时，实际节省的服务成本非常小。当然，Model 3 不需要换油，理论上这应该可以为我们节省大量成本。然而，Model 3 要求我们每年或 12,500 英里润滑制动卡钳——这是针对在冬季使用道路盐的地区指定的——成本几乎一样多，到目前为止，三项此类服务总计 432 美元，其中通常还包括轮胎旋转。虽然这比我们为 BMW M340i 花费的 539 美元或我们的起亚特柳赖德的 728 美元少，但在我们近两年的拥有期间，每月节省的费用在 6 到 15 美元之间，这在业主的预算。尽管未包含在我们的定期维护或正常磨损的官方统计数据中，但我们也进行了一些昂贵的修复。例如，玻璃屋顶上的一块石屑让我们花 1200 美元买一个新的，而我们出于同样的原因花了 1100 美元买一个新的挡风玻璃。而且，由于特斯拉拥有其所有服务中心并对其零部件保持严格控制，因此在此类情况下，与大多数其他汽车相比，货比三家的服务选择更少。行驶了 30,000 英里，原始的米其林 Primacy MXM4 轮胎被射出。我们经常使用四季轮胎获得两倍的里程数，但快速轮胎磨损是 Model 3 车主论坛上的常见话题。至少部分问题是这些轮胎的特斯拉版本开始时胎纹深度比现成的 MXM4 少 1.5 32 英寸。虽然听起来可能不多，但可用胎纹深度减少了 20%。我们刚刚用其他工厂 Model 3 配件米其林 Pilot Sport 4 夏季轮胎更换了这些轮胎，我们期待在 40,000 英里的最后一次测试中看到这些可以提高制动和转弯性能。一个附带的好处是夏季轮胎并不比四季轮胎贵，但我们的正常磨损计数仍然增加了 1157 美元。在温暖的春季和夏季，我们的消耗和效率数据呈回升趋势，连续三个月超过 100 MPGe，这使我们的整体平均水平提高了 1 至 85 MPGe。尽管我们离我们中西部的小角落还不算太远，但我们仍然设法在一个月内累积了多达 3500 英里的里程，这证明了特斯拉在直流快速充电方面的领先地位。这是我们最近的 EV 1000 拉力赛中最清晰的收获之一，三辆 Tesla 横扫了领奖台，零故障问题或许多其他车队遇到的充电器被占用。这意味着即使节省的维护成本微乎其微，在我们的 Model 3 上行驶里程也并不困难。\n在车队的月数：20 个月当前里程：35,984 英里平均燃油经济性：85 MPGe 电池容量：75.0 kWh 观察到的燃油范围：230 英里服务：432 美元正常磨损：1159 美元维修：0 美元损坏和破坏：2400 美元一年多和 24,000 美元使用我们的 Tesla Model 3 记录里程，我们已经过了蜜月期。我们最初 12 个月的高级连接已过期，这意味着车内音频和视频流现在仅适用于 Wi-Fi 连接。而且由于我们地区的任何一个 Superchargers 都没有它，我们不再通过流式传输 Netflix 来消磨为我们的汽车充电所花费的时间。迄今为止，我们的维护成本总计 313 美元，与许多汽油动力车辆的成本相当。这包括来自特斯拉内部服务网络的两项相当高的费用：轮胎换位 103 美元和为我们汽车的制动卡钳润滑的不寻常服务 210 美元，每年在我们这样的州使用盐来润滑汽车的汽车都需要这种服务。在冬季清除冰路。该服务是为了防止制动器卡死，因为与传统摩擦制动器相比，当更频繁地使用电动机的再生制动来减慢汽车速度时，它们并没有多大用处。同样不寻常的，虽然不贵，但遥控钥匙已经烧毁了电池。我们还花了 1088 美元来更换破裂的挡风玻璃，但那是我们的错。然而，永远不会过时的是在跑腿时插上电源并免费获得燃料。即使在 14 个月后，这种特权仍然感觉很新颖。自从一年前更换后电机组件以来，我们的汽车没有遇到任何其他重大问题。驾驶员侧 B 柱上的装饰件 - 您在进出座椅时容易碰到的部件 - 松动并在保修期内固定。我们注意到早期出现的吱吱声和嘎嘎声，但随着时间和里程的增加，这些似乎并没有恶化。春夏两季大幅改善了 Model 3 的能耗。在效率最高的月份，6 月，我们平均每英里消耗 267 瓦时（Wh/英里），而在 12 月——安装了冬季轮胎并且平均温度与 6 月的 81 度相比下降到 34 度——它增加到 354 瓦时/英里.这相当于在预期范围内摆动 60 英里（或 20%），这主要取决于外部温度。如果它是通宵插入的。否则，Model 3 可以轻松增加 10 或 20 英里的续航里程。我们的整体平均消耗量为 316 Wh/英里，我们的平均效率（与包括充电损耗在内的消耗量不同）提高了 10 MPGe 至 84 MPGe。目前全国平均住宅电费为每千瓦时 13.6 美分，为 Model 3 供电每英里需要 5.5 美分。如果我们完全依赖特斯拉的超级充电网络，成本几乎翻倍，达到 10.4 美分/英里，几乎匹配保持我们的长期 BMW M340i 充满 93 辛烷值溢价（10.7 美分/英里）的价格。这可能是一个极端的例子，但它证明了这一点，如果您想获得电动汽车的潜在经济利益，在家中或办公室安装高压充电器至关重要。尽管我们的 Model 3 被派往弗吉尼亚国际赛道参加我们一年一度的 Lightning Lap 活动，完成了从安娜堡到返回的每段 635 英里的路程，需要三站充电，但我们仍然没有超过之前最好的 221 英里部分原因是，根据我们正在使用的 TeslaFi 跟踪工具，我们的电池自新以来已经损失了 7% 的容量，即 22 英里。\n我们仍然对 Model 3 的速度着迷。我们间歇性地对其 Autopilot 功能的不同体验印象深刻和困惑。有时似乎完全自动驾驶即将来临。在其他时候，系统会严重破坏看似简单的操作，以至于我们认为我们一年多前支付的承诺的完全自动驾驶 (FSD) 功能 - 并且仍在等待实现 - 比特斯拉更远世界相信。特斯拉在去年年底部署了一项名为 Boombox 的新功能，而不是自己设定的 2020 年发布 FSD 的最后期限，现在我们可以用它来用音乐或各种噪音来攻击外部世界——当然，包括一声呐喊坐垫——使用汽车的外部扬声器。该更新还重新调整了中央触摸屏的布局，为描绘汽车周围环境的区域提供了更多空间，当手不再放在方向盘上时，这可能会变得更加重要。这两者都是我们在任何其他汽车上都没有看到的变化，再次证明特斯拉的体验绝对不是像往常一样造车，无论好坏。在舰队的月数：14 个月当前里程：24,035 英里平均燃油经济性：84 MPGe 电池容量：75.0 kWh 观察到的燃油范围：230 英里服务：313 美元正常磨损：2 美元维修：0 美元损坏和破坏：1088 美元我们的许多长期更新长期汽车，尤其是无故障的汽车，往往与我们和车辆一样重要。在缺乏可靠性或服务戏剧性的情况下，重点反而变成了我们访问的地方，以及我们在 40,000 英里的过程中发现的任何新烦恼。但特斯拉的拥有体验与驾驶体验一样不同。特斯拉实际上会随着公司源源不断的软件更新而改变。自 Model 3 Long Range 交付以来的 6 个月和 10,000 英里内，已经进行了 12 次软件更新，平均每 16 天更新一次。然而，并非所有这些都是实质性的。许多是小的后续更新，用于在发布主要更新后修复问题。我们已经提到，当我们的车刚到的时候，第 10 版的主要更新就已经准备好了，它增加了智能召唤和剧院模式，允许流式传输 Netflix、YouTube 和 Hulu。这是在充电时打发时间的好方法。从那时起，我们看到了一系列变化，例如增加了真正的单踏板驾驶。 （在更新之前，汽车会减慢到大约 3 英里/小时，但不会完全停下来。）还有狗模式可以在我们人类跑腿时保持舒适的车内温度（并显示一条大消息以缓解任何窗户-粉碎路过的好心人）。还添加了行车记录仪和哨兵模式安全功能。哨兵模式存储来自外部摄像头阵列的剪辑，无论是在驾驶员的要求下还是当汽车在停车时检测到运动时。就在本周，特斯拉通过增加在汽车中央屏幕上查看该镜头的功能来纠正错误。尽管 Model 3 的加速性能——尤其是它的响应能力——已经获得了我们员工的普遍赞誉，但其中一项更新包括声称的 5% 的功率提升，这全面提高了我们汽车的性能，包括其性能提高了 0.1 秒。零到 60 英里/小时的时间到 4.0 秒。\n然后，在圣诞节那天，灾难发生了。停在车道上时，后电源逆变器短路触发了烟火式保险丝，从而防止了更糟糕的结果。在乘坐拖车到最近的服务中心大约一个小时后，整个后电机组件被更换。我们收到了来自其他 Model 3 车主的大量电子邮件和 DM，他们分享了被困在 Model 3 手中的类似故事。但此后我们遇到了与此事件或其他任何相关的零可靠性问题。尽管进行了旨在改进自动雨刷器的更新，但有关自动雨刷器的投诉仍在继续。鉴于我们所经历的糟糕表现，我们质疑特斯拉选择依靠前置摄像头来控制其操作，而不是像其他汽车制造商那样使用雨量传感器。印刷总监埃里克·廷沃尔 (Eric Tingwall) 解释说：“雨刷经常处于休眠状态，因为挡风玻璃因周围交通的喷雾而变得几乎不透明。然后你只需轻敲一下雨刷杆就可以将它们唤醒，然后它们就会不必要地全速运行几分钟。”许多人还评论了在中央屏幕中定位雨刷设置的困难。这给我们带来了最常见的日志副词：Model 3 几乎完全依赖中央屏幕来控制其各种特性和功能。驾驶我们的 Model 3 后，主编康纳·霍夫曼 (Connor Hoffman) 说：“我现在知道我奶奶给她买了 iPad 时的感受。每次坐进去，我都会发现一些新东西。”路试编辑贝卡·哈克特 (Becca Hackett) 承认在她第一次开车回家时试图让自己适应设置时，在车库里摆弄了一个小时的中央屏幕。编辑科林·贝雷斯福德（Colin Beresford）提出了一个存在主义的问题：“如果 Z 世代的成员在屏幕上找不到某个功能，它是否还存在？”少数几个保留的物理按钮也位于奇怪的位置，例如顶篷上的危险按钮。其他常见的评论包括插入特斯拉的快速充电超级充电站时发出的令人不安的响亮的沉闷噪音。虽然这在 Model S 中没有发生，但对于 3 来说似乎是正常的。我们也做了一些我们自己的实验。我们发现 Model 3 的塑料轮罩可将续航里程提高多达 10 英里。尽管在寒冷的早晨从特斯拉的暖通空调系统吹出近乎即时的暖空气是受欢迎的，但我们发现仅启动气候控制就可以将行驶里程减少 60 英里。我们最近还比较了特斯拉新推出的 250 千瓦 V3 增压器之一与旧款 150 千瓦增压器的充电速度。我们仍在等待完全自动驾驶选项的实质性更新，购买价格增加了 6000 美元。尽管特斯拉为驾驶时出现在屏幕左侧的可视化添加了更多功能——包括显示交通信号灯和建筑锥体——但我们正在等待特斯拉最近一直在戏弄的 Autopilot 功能的真正改进。跟上频繁的更新并不容易，因为特斯拉需要 Wi-Fi 连接来下载软件，而不会通过内置数据连接来下载。此外，Model 3 仅连接到简单的 Wi-Fi 源，例如带有网络名称和密码的典型家用路由器。任何更复杂的事情，例如需要用户名和密码的网络，或者如果您需要打开浏览器窗口以同意合法的样板文件，都将不起作用。那么，我们在哪里驾驶我们的 Model 3？不是很远。我们大部分时间都呆在我们的家乡密歇根州，因为我们已经度过了冬天。它的日志充满了关于射程险些未命中的焦虑评论，我们一直在以比预期高出大约 50% 的速度咀嚼这些评论。迄今为止，我们最远的车程是从我们的办公室到密歇根州北部的 221 英里。多次停靠的长途公路旅行——例如霍夫曼最近驱车 520 英里前往圣路易斯——通常不允许尝试最大化续航里程，因为必须在增压器所在的位置进行进站。等待将电池充电至 100% 的时间效率不高。\n但我们肯定会努力改善这一点，随着冬季轮胎脱落，气温继续变暖，我们又一次可以自由地在这个国家漫游。在舰队中的月数：6 个月当前里程：10,626 英里平均燃油经济性：74 MPGe 电池容量：75.0 kWh 观察到的燃油范围：230 英里服务：0 美元正常磨损：0 美元维修：0 美元损坏和破坏：0 美元关于最有趣的事情之一Model 3 和一般的特斯拉，就是它偏离了汽车行业的规范的程度。其他汽车制造商通常通过仔细跟踪和匹配与竞争对手相关的功能和设备来创建非常相似的条目，不同的是，特斯拉如何简单地做自己的事情令人耳目一新——有时也令人讨厌。当我们开始对 2019 年 Model 3 Long Range 进行 40,000 英里的评估时，这是继 2015 年 Model S P85D 之后我们的第二辆长期特斯拉，与其他紧凑型豪华轿车相比，不可能不注意到这款电动汽车的巨大差异。以相似的尺寸和价格存在。这里没有 Apple CarPlay 或 Android Auto，尽管该功能在其豪华轿车同行中几乎无处不在，甚至在驾驶员面前也没有仪表组显示。然而，Model 3 有很多令人惊叹的技巧来赢得第一次接触特斯拉的人，比如排放测试模式，有六种不同的放屁噪音选项，以及狗模式，让我们毛茸茸的朋友们自在。它的手机即钥匙功能可以完全无缝地运行，这与现代汽车等传统汽车制造商最近的尝试不同，后者需要笨拙地拿出手机并将其握在门把手上。此外，还有非常强大的 Autopilot 驾驶员辅助功能套件，该套件现已成为标准配置，并且通常可显着减少驾驶员需要控制的转向、制动和加速量。尤其是从正面看时，我们不会称 Model 3 有吸引力，但低整流罩和大玻璃区域提供了广阔的前视图。这是关于驾驶 Model 3 的一系列积极评价之一。它非常快，直接转向，甚至我们的全轮驱动模型愿意在动力下旋转。我们为它的即时响应和有力的加速而着迷——在 4.1 秒到 60 英里/小时时，最新的 3 比我们测试的最初的 Model 3 Long Range 快 0.9 秒，它只有一个后置电机，而且它也只有 0.3 秒的关闭BMW M340i 的速度很快。更重要的是，特斯拉的动力输出以其瞬时性而与众不同，我们的 5 至 60 英里/小时滚动启动测试证明了这一点。 Model 3 在 4.2 秒内完成了它，而今天的高增压燃气发动机通常在其站立启动和滚动启动指标之间存在显着差距（例如，M340i 的差异为 0.9 秒）。 Model 3 在其他领域的表现不如通常的豪华车——宝马 3 系、奥迪 A4、梅赛德斯 C 级——它的塑料座椅材料、固定和狭窄的头枕，以及为大型车提供的超便宜的纸板盖行李箱地板下的垃圾箱不符合其豪华价格点。 Model 3 也不像传统玩家那样在路上安静。在 70 英里/小时的风速下有很多风噪声，在 70 分贝时，它在该速度下比分段规范高一到两个分贝。这还不包括它在侧向路面接缝处发出响亮的声音，部分原因是其 42 psi 的高轮胎压力有助于管理 Model 3 的 4038 磅整备重量（比后轮驱动 Model 重 141 磅） 3 我们在 2018 年测试过）并扩大其范围。早期 Model 3 经常讨论的问题包括面板间隙和整体制造质量，在这方面，这款最新款汽车比我们之前的示例要好得多。然而，当我们的车到达时，引擎盖在我们的车上并不太平，所以我们调整了引擎盖索环以使其如此。我们已经注意到仪表板发出了一些吱吱声和嘎嘎声，特别是在我们密歇根总部已经降临的寒冷天气中。\n我们正在使用名为 TeslaFi 的第三方软件来收集来自我们汽车的大量数据流，包括其行踪、里程、充电和充电效率、车内外温度以及气候控制使用情况。在我们最初的两个月里，我们驾驶 Model 3 的时间为 85.5 小时，行驶了 280 多次，总共行驶了 3867 英里。然而，部分由于平均室外温度为 43 度，我们使用的额定里程比实际行驶里程多近 50%。这导致了一些抱怨，即在以比 EPA 评级建议的速度更快的速度耗尽电池时，主要范围读数不会向下调整。但是，能量屏幕上有一个基于最近驾驶的运行平均值。我们还注意到，当 Model 3 在 40 度的温度下在外面过夜而不插电时，电池的充电状态可能会下降 5% 左右。我们测试车上唯一的选择是 1000 美元的午夜银金属漆和6000 美元的全自动驾驶功能，使我们的总标价达到 57,690 美元。而后一个功能——目前售价 7000 美元——承诺在一些 poi ......", "note_en": "One of the pitches we hear often on the switch to EV ownership is that electric vehicles are cheaper to maintain. But, as we close in on 40,000 miles in a Tesla Model 3, the actual savings in service costs is turning out to be quite minimal.\n Sure, the Model 3 needs no oil changes, which in theory should save us significant cost. However, the  Model 3&#39;s requirement that we lubricate the brake calipers every year or 12,500 miles—something specified for areas that use road salt in the winter months—has cost nearly as much, totaling $432 for three such services thus far, which often also include a tire rotation. Although that&#39;s less than the $539 we spent on maintenance for  our BMW M340i or the $728 for  our Kia Telluride, that savings works out to between $6 and $15 a month over the course of our nearly two years of ownership, which would be barely noticeable in an owner&#39;s budget.\n     Although not included in our official tally of regular maintenance or normal wear, we&#39;ve had some pricey fixes as well. For example, a stone chip in the glass roof set us back $1200 for a new one, and we paid $1100 for a new windshield for the same reason. And, since Tesla owns all of its service centers and maintains tight control over its parts, there are fewer options to shop around for service in cases like these than for most other cars.\n By 30,000 miles, the original Michelin Primacy MXM4 tires were shot. We often get twice as many miles on all-season tires, but rapid tire wear is something that&#39;s a common topic on Model 3 owner&#39;s forums. At least part of the issue is that the Tesla version of these tires start with 1.5 32nds of an inch less tread depth than the off-the-shelf MXM4s. Although it might not sound like much, that&#39;s 20 percent less usable tread depth.\n  We have just replaced those with the other factory Model 3 fitment, Michelin Pilot Sport 4 summer tires, and we look forward to seeing how much these might improve braking and cornering performance during our final test session at 40,000 miles. A side benefit is that the summer tires were no more expensive than the all-seasons, but a still substantial $1157 has been added to our normal wear tally.\n Our consumption and efficiency figures have trended back up in the warmer spring and summer months, topping 100 MPGe for three months running, which has bumped our overall average by one to 85 MPGe. Although we haven&#39;t strayed too far from our little corner of the Midwest, we&#39;ve still managed to accumulate as many as 3500 miles in a month, a testament to Tesla&#39;s leadership in DC fast charging. That was one of the clearest takeaways from  our recent EV 1000 rally, where the three Teslas swept the podium, with zero issues of nonfunctioning or occupied chargers that many other teams encountered.\n That means it hasn&#39;t been difficult to put miles on our Model 3, even if the savings in maintenance costs has been minimal.\n  Months in Fleet: 20 months  Current Mileage: 35,984 miles  Average Fuel Economy: 85 MPGe   Battery Capacity: 75.0 kWh  Observed Fuel Range: 230 miles   Service: $432  Normal Wear: $1159  Repair:$0  Damage and Destruction: $2400\n     With more than a year and 24,000 miles logged with our  Tesla Model 3, we&#39;re way past the honeymoon phase. Our initial 12 months of included premium connectivity has expired, which means in-car audio and video streaming now only works with a Wi-Fi connection. And since not one of our area  Superchargers has it, we are no longer whiling away the time spent charging our car by  streaming Netflix.\n Our maintenance costs thus far have totaled $313, which is on par with the cost for many gas-powered vehicles. That includes two rather steep charges from  Tesla&#39;s in-house service network: $103 for a tire rotation and $210 for an unusual service to lubricate our car&#39;s brake calipers, which is called for annually on cars that reside in a state like ours that uses salt to rid the roads of ice during winter months. That service is to prevent the brakes from seizing, as they don&#39;t get much use when regenerative braking from the electric motors is employed more often to slow the car than the conventional friction brakes. Also unusual, though not expensive, is that the key fob has already burned through a battery. We also spent $1088 to replace a cracked windshield, but that was our fault.\n  What never gets old, however, is plugging in while out running errands and getting fuel for free. Even 14 months in, that perk still feels novel. We haven&#39;t had any other significant issues with our car since the replacement of the rear motor assembly that  happened a year ago. The trim on the driver&#39;s side B-pillar—the piece you tend to bump getting in and out of the seat—came loose and was fixed under warranty. We noted squeaks and rattles that materialized early on, but those don&#39;t seem to have worsened with the additional time and miles.\n The spring and summer months substantially improved the Model 3&#39;s energy consumption. In the most efficient month, June, we averaged 267 watt-hours per mile (Wh/mile), while in December—with winter tires installed and the average temperature plummeting to 34 degrees compared with June&#39;s 81—it increased to 354 Wh/mile. That equates to a 60-mile swing (or 20 percent) in expected range, depending largely on the outside temperature. And that&#39;s if it&#39;s plugged in overnight. Otherwise, the Model 3 can easily shed an additional 10 or 20 miles of range. Our overall average consumption is 316 Wh/mile, and our average efficiency—unlike consumption, which includes charging losses—has bumped up by 10 MPGe to 84 MPGe.\n     At the current national average residential electricity rate of 13.6 cents per kWh, it&#39;s costing us 5.5 cents per mile to power our Model 3. If we instead relied entirely on Tesla&#39;s Supercharger network, the cost would nearly double, to 10.4 cents/mile, almost matching the price of keeping  our long-term BMW M340i filled with 93-octane premium (10.7 cents/mile). That may be an extreme example, but it proves the point that having a high-voltage charger at home or at your office is  critical if you want to reap the potential financial benefits of going electric.\n Although our Model 3 was dispatched to our  annual Lightning Lap event at Virginia International Raceway, completing each 635-mile leg of that trip from Ann Arbor and back with three stops to charge, we have still yet to beat our previous best of 221 miles between plugging in. That&#39;s partially because, according to the  TeslaFi tracking tool we&#39;re using, our battery has  lost 7 percent of its capacity, or 22 miles, since it was new.\n  We&#39;re still smitten with the Model 3&#39;s swiftness. And we&#39;re intermittently impressed and befuddled by the varying experiences of its Autopilot feature. Sometimes it seems that fully autonomous driving is nearly upon us. At other times the system bobbles a seemingly straightforward maneuver so badly that we think the promised Full Self-Driving (FSD) capability that we paid for more than a year ago—and are still waiting to materialize—is much further off than Tesla would have the world believe.\n Instead of meeting its self-imposed 2020 deadline to release FSD, Tesla deployed a new feature at the tail end of last year, called  Boombox, with which we can now assault the outside world with music or various noises—including, naturally, a whoopee cushion—using the car&#39;s external speaker. That update also rejiggered the layout of the central touchscreen, giving more real estate to the area that depicts the car&#39;s surroundings, which will likely become more important when hands are no longer on the wheel. Both of these are changes that we haven&#39;t seen in any other car, proving yet again that the Tesla experience is definitely not car-making as usual, for better and for worse.\n Months in Fleet: 14 months  Current Mileage: 24,035 miles  Average Fuel Economy: 84 MPGe   Battery Capacity: 75.0 kWh  Observed Fuel Range: 230 miles   Service: $313  Normal Wear: $2  Repair: $0  Damage and Destruction: $1088\n    The updates on many of our  long-term cars, particularly the trouble-free ones, tend to be as much about us as about the vehicles. In the absence of reliability or service drama, the focus instead becomes the places we visit, plus whatever new annoyances we find over the course of 40,000 miles.\n But the  Tesla ownership experience is as different as the driving experience. A Tesla actually changes over time with the company&#39;s steady stream of software updates. In the six months and 10,000 miles since we&#39;ve taken delivery of our  Model 3 Long Range, there have been 12 software updates, or an average of one every 16 days. Not all of them are substantial, however; many are small, follow-on updates to fix issues after a major update is released.\n  We already mentioned that the update to version 10, a major one, was ready when our car first arrived, and it added  Smart Summon and  Theater mode, which allows streaming of Netflix, YouTube, and Hulu. It&#39;s a great way to pass the time while charging. Since then, we&#39;ve seen a flurry of changes, such as the addition of true one-pedal driving. (Before the update, the car would slow to about 3 mph but wouldn&#39;t come to a complete stop.) There&#39;s also  Dog mode for maintaining a comfortable cabin temperature while us humans are running errands (and displaying a large message to assuage any window-smashing would-be do-gooders passing by). Dashcam and  Sentry mode security features also have been added. Sentry mode stores clips from the array of exterior cameras, either at the driver&#39;s behest or when the car detects motion while parked. Just this week, Tesla righted a wrong by adding the  ability to view that footage on the car&#39;s center screen.\n Although the Model 3&#39;s acceleration—and particularly its responsiveness—was already garnering universal praise by our staff, one of the updates included a claimed five-percent power bump, which improved our  car&#39;s performance across the board, including a 0.1-second improvement of its zero-to-60-mph time to 4.0 seconds.\n  Then, on Christmas Day,  disaster struck. While parked in a driveway, a short in the rear power inverter triggered a pyrotechnic fuse, which prevented an even worse outcome. Following a tow-truck ride to the closest service center about an hour away, the entire rear-motor assembly was replaced. We received plenty of emails and DMs from other Model 3 owners sharing similar stories of getting stranded at the hands of a Model 3. But we&#39;ve had zero reliability issues since, related either to this event or anything else.\n  Complaints about the automatic wipers have continued despite an update meant to improve them. Given the poor performance we&#39;ve experienced, we question Tesla&#39;s choice to rely on the front cameras to control their operation rather than a rain sensor like every other automaker employs. Print director Eric Tingwall elaborates: &#34;The wipers often lay dormant as the windshield becomes nearly opaque with spray from surrounding traffic. Then you wake them up by tapping the stalk for a single wipe, and they unnecessarily run at full speed for several minutes.&#34; Many also have commented on the difficulty in locating the wiper settings in the center screen.\n This brings us the most regular logbook refrain: the Model 3&#39;s near complete reliance on the center screen to control its various features and functions. &#34;I now know how my grandma felt when we got her an iPad,&#34; said staff editor Connor Hoffman after driving our Model 3. &#34;Every time I get in it, I find something new.&#34; Road-test editor Becca Hackett admitted to tinkering with the center screen for an hour in her garage as she tried to acclimate herself to the setup when she drove the car home for the first time. And staff editor Colin Beresford asks an existential question: &#34;If a member of Gen Z can&#39;t find a feature on the screen, does it even exist?&#34; Some of the few physical buttons that do remain are in odd locations, too, such as the hazard button up on the headliner. Other regular comments include the disconcertingly loud clunking noises that happen while plugged in at one of Tesla&#39;s fast-charging Superchargers. Although this doesn&#39;t happen in the Model S, it seems to be normal for the 3.\n  We&#39;ve also done some experiments of our own. We discovered that the Model 3&#39;s plastic wheel covers  improve range by up to 10 miles. And although the near-instant warm air blowing from the Tesla&#39;s HVAC system is welcome on a cold morning, we found that  cranking up the climate control alone can reduce range by 60 miles. We also recently  compared the charging speeds on one of Tesla&#39;s new 250-kW V3 Superchargers versus the older 150-kW units.\n We&#39;re still waiting for substantial updates to the full self-driving option that added $6000 to the purchase price. Although Tesla has added more  features to the visualization that appears on the left side of the screen while driving—including displaying traffic lights and construction cones—we&#39;re waiting for a real improvement in Autopilot&#39;s capability that  Tesla has been teasing of late.\n Not making it easy to keep up with the frequent updates is the fact that Tesla requires a Wi-Fi connection to download software and won&#39;t do so through the built-in data connection. Plus, the Model 3 only connects to simple Wi-Fi sources like the typical home router with a network name and password. Anything more complex, such as a network that requires a username and password, or if you need to open a browser window to agree to legal boilerplate, won&#39;t work.\n  So, where have we driven our Model 3? Not very far. We&#39;ve mostly stayed in our home state of Michigan as we&#39;ve soldiered through winter. Its logbook is full of anxiety-ridden comments about near misses on range, which we&#39;ve been chewing through at a rate that&#39;s roughly 50 percent higher than predicted. Our farthest drive thus far was a 221-mile run from our office to northern Michigan. Longer road trips with multiple stops—such as Hoffman&#39;s recent 520-mile drive to St. Louis—generally don&#39;t allow attempts at range maximization since pit stops have to occur where the Superchargers are. And it&#39;s not time efficient to wait to recharge the battery all the way to 100 percent.\n But we&#39;ll certainly be trying to improve upon that that as the winter tires come off, the temperatures continue to warm, and we&#39;re once again free to roam the country.\n Months in Fleet: 6 months  Current Mileage: 10,626 miles  Average Fuel Economy: 74 MPGe   Battery Capacity: 75.0 kWh  Observed Fuel Range: 230 miles   Service: $0  Normal Wear: $0  Repair: $0  Damage and Destruction: $0\n        One of the most interesting things about the  Model 3, and Teslas in general, is just how much it deviates from the norms of autodom. Unlike other automakers, which often wind up creating very similar entries by carefully tracking and matching features and equipment relative to the competition, it&#39;s refreshing—and occasionally annoying—how  Tesla simply does its own thing.\n As we&#39;re  embarking on a 40,000-mile evaluation of a 2019 Model 3 Long Range, our second long-term Tesla after a  2015 Model S P85D, it&#39;s impossible not to notice this electric vehicle&#39;s vast differences compared with other compact-luxury sedans that exist at a similar size and price. There&#39;s no Apple CarPlay or Android Auto here, although the feature has become nearly ubiquitous among its luxury-sedan peers, nor even a gauge-cluster display in front of the driver. However, there are lots of wowing tricks up the Model 3&#39;s sleeve to win over people coming into contact with a Tesla for the first time, such as  Emissions Testing mode, with six different fart-noise options, and  Dog mode to keep our furry friends comfortable. And its phone-as-key feature works completely seamlessly, unlike more recent attempts by traditional automakers,  such as Hyundai, that require awkwardly getting out a phone and holding it to the door handle. Plus, there&#39;s the very capable suite of Autopilot driver-assist features, which is now standard and generally works impressively to reduce the amount of steering, braking, and accelerating the driver needs to control.\n   Especially when viewed from the front, we wouldn&#39;t call the Model 3 attractive, but the low cowl and large glass area make for an expansive forward view. And that is one of a flurry of positive comments about driving the Model 3; it&#39;s extremely quick, with direct steering and even a willingness of our all-wheel-drive model to rotate under power. We&#39;re suckers for its instant response and forceful acceleration—at 4.1 seconds to 60 mph, this latest 3 is 0.9 second quicker than the  initial Model 3 Long Range we tested, which only had a rear motor, and it&#39;s also just 0.3 second off the pace of the swift  BMW M340i. What&#39;s more, the Tesla&#39;s power delivery sets itself apart by its instantaneousness, which is demonstrated by our 5-to-60-mph rolling-start test. The Model 3 nails it in 4.2 seconds, whereas today&#39;s highly boosted gas engines often have a significant gap between their standing-start and rolling-start metrics (the difference on the M340i, for example, is 0.9 second).\n The Model 3 stacks up less well in other areas against the usual luxury players— BMW 3-series,  Audi A4,  Mercedes C-class—where its plasticky seat material, fixed and narrow headrests, and ultracheap, cardboard-like cover for the large bin under the trunk floor don&#39;t live up to its luxury price point. The Model 3 also isn&#39;t as hushed over the road as the traditional players; there&#39;s a lot of wind noise at 70 mph, and at 70 decibels, it measures one to two decibels louder at that speed than the segment norms. And that&#39;s not including the way it clomps loudly over lateral pavement seams, which is partly a result of its high, 42-psi tire pressures that help manage the Model 3&#39;s 4038-pound curb weight (that&#39;s 141 pounds heavier than the rear-drive Model 3 we tested in 2018) and boost its range.\n  Among the oft-discussed issues on early Model 3s were panel gaps and overall build quality, and in that area, this latest car is far better than our earlier example. However, the hood wasn&#39;t quite level on our car when it arrived, so we adjusted the hood grommets to make it so. We&#39;re already noticing some squeaks and rattles emanating from the instrument panel, particularly in the cold weather that has descended on our Michigan HQ.\n  We&#39;re using  third-party software called TeslaFi to corral a staggering amount of data streaming from our car, including its whereabouts, mileage, charging and charge efficiency, temperatures outside and inside the vehicle, and climate-control usage. In our first two months, we&#39;ve spent 85.5 hours behind the wheel of our Model 3 over 280 drives and a total of 3867 miles. However, partly due to an average outside temperature of 43 degrees, we&#39;ve used nearly 50 percent more rated range than miles actually driven. That has led to complaints that the main range readout does not adjust downward when using up the battery at a quicker rate than its EPA rating suggests. However, there is a running average figure based on recent driving, found on the Energy screen. We&#39;ve also noted that the battery&#39;s state of charge can drop by 5 percent or so when the Model 3 sits outside overnight in 40-degree temperatures without being plugged in.\n     The only options on our test car are its $1000 Midnight Silver Metallic paint and the $6000 Full Self-Driving Capability, bringing our total sticker price to $57,690. While the latter feature—currently priced at $7000—promises at some poi\n......", "posttime": "2021-07-30 11:25:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "维护,model", "title": "我们的 Tesla Model 3 并未大幅节省维护成本", "title_en": "Our Tesla Model 3 Hasn't Delivered Big Savings in Maintenance Costs", "transed": 1, "url": "https://www.caranddriver.com/reviews/a30209598/2019-tesla-model-3-reliability-maintenance/", "via": "", "real_tags": ["维护", "model"]}, {"category": "", "categoryclass": "", "imagename": "c30d84493767a77db58dcf93e6ca8980.jpg", "infoid": 1070567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在她的新回忆录《某人的女儿》的开头几页中，作家阿什利·C·福特 (Ashley C. Ford) 描述了她与一名被监禁的父亲一起成长的经历，父亲在她 10 个月大时就被判刑。在接下来的 30 年里，他将在监狱里度过；他于 2019 年获释。在这本书中，福特所写的部分内容是她的生活——以及她周围人的生活——是如何因他的缺席而受到影响的。就他们能够维持关系而言，福特和她的父亲主要通过他们在这三个十年中交换的信件来维持关系。当事情进展顺利时，我的一个朋友福特会分享她在学校学到的知识以及她生活中发生的小而值得注意的事情。反过来，她的父亲会分享他是多么自豪，多么爱她。但 30 年是一段很长的时间，当她的父亲还在监狱里时，福特正在成长、改变并了解她在这个世界上的身份。结果，有时，在很长一段时间内，她不像以前那样经常给父亲写信。她说，这不一定是针对个人的，但保持通信往来是很困难的。他接受了这一点，她在回忆录中写道：“‘没关系，宝贝，’当我试图在电话里为没有写信道歉时，我父亲会说。 &#39;你想写的时候给我写信。我会耐心地、快乐地等待。&#39;”我被福特的书吸引的原因之一是因为它以细微差别和诚实的方式捕捉了一个被监禁的成年人的孩子的生活中的一些情感领域，这是我以前从未遇到过的。文学。从表面上看，一个小孩与她被监禁的父亲交换信件的想法似乎很感人——甚至是强大的——但当我继续阅读这些信件时，我注意到其他类型的交流，特别是电话，非常罕见.我一直在想福特和其他父母被监禁的孩子，因为上个月，康涅狄格州成为美国第一个对被监禁者免费从青少年拘留中心和州监狱拨打所有电话的州. （纽约市、旧金山、圣地亚哥和洛杉矶等少数城市也可以免费拨打监狱电话。）将于 2022 年 7 月 1 日生效的康涅狄格州法律有可能改变福特和她父亲等人的生活和人际关系。对于美国数百万被监禁的人来说，电话是与亲人联系的重要线路。但对许多人来说，这种沟通因高昂的费用而受阻，尽管各州的费用差异很大。例如，根据监狱政策倡议，2018 年，阿肯色州一所州监狱拨打 15 分钟州内电话（4.80 美元）的费用是伊利诺伊州一所州监狱拨打 15 分钟州内电话的 34 倍（ 0.14 美元）。读完福特的书后，我和她聊了聊她父亲在狱中的经历，了解到高昂的电话费用确实影响了她和她的家人与父亲沟通或不沟通的方式。她给他写信并不是因为那是她想与他交流的主要方式；这是她唯一能负担得起的方法。 “有几次他试图拨打对方付费电话，但效果不佳，”福特告诉我。 “我妈妈不得不告诉他，‘请不要打电话给对方，因为孩子们会接受，但他们不知道这意味着什么，然后他们和你聊了很长时间，然后我收到了这笔巨额账单，付不起钱。’”福特说她父亲不想让家里的事情变得比现在更难，所以他不会打电话给福特的母亲，而是只在他负担得起的时候打电话他自己，这并不常见。 “这很艰难，因为他打电话时也只希望我们在家，”她说。有时，如果家人幸运的话，他们会收到一封简短的语音邮件，这意味着福特可以一遍又一遍地听到她父亲的声音。\n在 3 月 22 日的法案公开听证会上，直接受到监狱电话费用高昂影响的人重申了福特与我分享的许多观点——这些高昂的费用使人们无法与他们所爱的人保持联系。丈夫和妻子。兄弟姐妹。父母和孩子。最近的估计表明，有 270 万美国儿童的父母被监禁，超过 500 万儿童（占所有美国儿童的 7%）的父母曾被关押在监狱或监狱中。当黛安·刘易斯的儿子在 17 岁时被监禁时，她和他一样担心他的安全。她向他保证他们每天都会说话，但这些电话的费用造成了灾难性的后果。 “没过多久，公用事业就被切断了；煤气被切断了；我的房租迟到了，”她在听证会上说。 “但我像母亲一样做出了牺牲。我真的不必每天吃午饭，我可以借几块钱打几个电话，直到我再次获得报酬。”刘易斯曾与非营利倡导组织 Worth Rises 合作推动立法，他的故事在数百万亲人被监禁的人中非常普遍。康涅狄格州众议院司法委员会主席史蒂夫·斯塔夫斯特罗姆 (Steve Stafstrom) 在听证会快要结束时说：“今天离开这里后，我会坚持一段时间的一件事就是必须选择在能够让父亲与他的孩子交流和[负担得起]吃饭之间。我无法想象在这个国家和这个州，这是任何人都应该做出的决定。”在某些方面，康涅狄格州是该国第一个表示将提供州监狱免费电话的州，这令人惊讶，因为该州是全国监狱电话费率最高的州之一——每人收费近 5 美元。 15 分钟通话。更重要的是，由于与美国最大的监狱电话供应商之一 Securus Technologies 签订了合同，该州从州监狱的州内电话中获得了 68% 的佣金，在 2019 年转化为大约700万美元。该法案还保护亲自探视，以防止免费电话可能以某种方式被惩教机构用作防止或减少此类探视的风险。更重要的是，康涅狄格州众议院在其预算执行者中加入了语言——一项指导州政府如何执行州预算的重要立法——每天至少为监狱中的人分配 90 分钟的通话时间。保持联系不仅对孩子有好处；这对被监禁的成年人也很重要。根据维拉司法研究所的一份报告，“对从监狱归来的人的研究表明，在监禁期间和释放后，家庭成员可以成为宝贵的支持来源。例如，与家人有更多联系并且总体上报告积极关系的监狱囚犯不太可能再次入狱。”我问福特，如果她能够更经常地与父亲交流，她的童年会有何不同。 “我本来有机会与他建立一种基于现实的关系，而不是一种主要是幻想的关系，”她告诉我。\n“当父母不在时，你真的会试图填补那个洞，”她继续说道。 “如果你无法获得关于他们是谁的信息，尤其是当你真的很小的时候，你就会想出一些能让你感到安慰的东西，或者想出一些你真正希望成为真实的东西。你会寻找证据证明这些事情是真实的。老实说，我认为它教会了你如何以某种方式欺骗自己。不幸的是，这是一种很难摆脱的做法。我希望我有更多的机会……知道我父亲是谁。”", "note_en": "In the opening pages of her new memoir,  Somebody’s Daughter, the writer Ashley C. Ford describes growing up with an incarcerated father, who was sentenced when she was just 10 months old. He would spend the next 30 years in prison; he was released in 2019. In the book, part of what Ford writes about is how so much of her life—and the lives of those around her—was shaped by his absence.\n To the extent that they were able to maintain a relationship, Ford and her father did so largely through letters they exchanged over the course of those three decades. When things were going well, Ford, a friend of mine, would share what she was learning in school and the small but notable things happening in her life. Her father, in turn, would share how proud he was and how much he loved her. But 30 years is a long time, and while her father remained in prison, Ford was growing, changing, and learning who she was in the world. As a result, sometimes, for extended stretches of time, she didn’t write to her father as often as she once had. This wasn’t necessarily personal, she says, but keeping the correspondence going was hard. He accepted this, she wrote in her memoir: “‘That’s okay, baby,’ my father would say, when I tried to apologize on the phone for not writing. ‘You write me when you want to. I’ll be waiting patiently, happily.’”\n One of the reasons I was drawn to Ford’s book was because it captured with nuance and honesty some of the emotional terrain of life for an incarcerated adult’s child in ways that I had not encountered before in literature. On its face, the idea of a small child exchanging letters with her incarcerated father can seem moving—powerful, even—but as I continued to read about these letters, I took note of the conspicuous rarity of other types of communication, specifically phone calls.\n I’ve been thinking about Ford, and other children with parents who have been incarcerated, because last month the state of Connecticut became the first state in the country to make all outgoing phone calls from both youth detention centers and state prisons free for incarcerated people. (A few cities, such as New York City, San Francisco, San Diego, and Los Angeles, have also made phone calls from prison free.) The Connecticut law, which goes into effect July 1, 2022, has the potential to transform the lives and relationships of people like Ford and her father.\n  For millions of incarcerated people in America, phone calls are vital lines of connection to their loved ones. But for many, such communication has been obstructed by exorbitant costs, though fees vary greatly from state to state. For example, according to the  Prison Policy Initiative, in 2018 a 15-minute in-state phone call from a state prison in Arkansas ($4.80) cost 34 times more than a 15-minute in-state call from a state prison in Illinois ($0.14).\n After finishing Ford’s book, I spoke with her about her father’s time in prison and learned that the high cost of phone calls indeed shaped how she and her family communicated, or didn’t, with her father. It wasn’t that she wrote him letters because that was the primary way she had  wanted to communicate with him; it was the only way she could afford to. “A few times when he tried to call collect it did not go over well,” Ford told me. “My mom had to tell him, ‘Please do not call collect, because the kids will accept it and they don’t know what it means, and then they talk to you for a long time, and then I have this huge bill I can’t pay.’”\n Ford says that her father didn’t want to make things harder on the family than they already were, so instead of making calls that would be charged to Ford’s mother, he would call only when he could afford it himself, which wasn’t often. “That was tough because he also just had to hope we were home when he called,” she said. Sometimes, if the family was lucky, they would get a short voicemail, which would mean Ford could hear her father’s voice on repeat over and over again.\n During a public hearing for the bill on March 22, people who had been directly affected by the high cost of prison phone calls reaffirmed many of the points Ford shared with me—that these steep rates prohibit people from staying in touch with those they love. Husbands and wives. Brothers and sisters. Parents and children. Recent estimates show that 2.7 million American children have a parent who is incarcerated, and more than 5 million children—7 percent of all American children—have had a parent who was held in prison or jail at some point.\n When Diane Lewis’s son was incarcerated at the age of 17 she feared for his safety, as did he. She’d promised him they would speak every day, but the cost of those calls had disastrous consequences. “It wasn’t long before the utilities were being cut off; the gas was being cut off; I was late on rent,” she  said during the hearing. “But I made sacrifices like a mother does. I didn’t really  have to eat lunch every day, and I could borrow a few dollars to cover a few phone calls until I got paid again.” Lewis, who worked with the nonprofit advocacy organization Worth Rises in pushing for the legislation, has a story that is all too common among the millions of people with incarcerated loved ones.\n Steve Stafstrom, who is the chair of the judiciary committee of the Connecticut House of Representatives, said toward the end of the hearing, “One of the things that will stick with me for a while after leaving here today is the thought of having to choose between being able to have a dad communicate with his kids and [affording] to eat. I can’t imagine in this country and in this state that that’s a decision anyone should have to make.”\n In some ways it is surprising that Connecticut is the first state in the country to say it will provide free phone calls from state prisons, because the state has had one of the highest prison-phone-call rates in the country—nearly $5 for a 15-minute call. What’s more, as a result of its contract with Securus Technologies, one of the largest prison-phone-call vendors in the nation, the state raked in a 68 percent commission on in-state calls from state prisons, which in 2019 translated to about $7 million.\n  The bill also protects in-person visitation, to guard against the risk that the free phone calls might somehow be used by correctional facilities as a way to prevent or scale such visits back. What’s more, the Connecticut House of Representatives included language in its  budget implementer—a major piece of legislation that instructs the state on how to execute the state’s budget—that allots a minimum of 90 minutes of call time a day to those in prison.\n Not only is staying in touch good for children; it is essential for incarcerated adults as well. According to  a report from the Vera Institute of Justice, “Research on people returning from prison shows that family members can be valuable sources of support during incarceration and after release. For example, prison inmates who had more contact with their families and who reported positive relationships overall are less likely to be re-incarcerated.”\n I asked Ford how her childhood would have been different if she had been able to communicate more regularly with her father. “I would have had an opportunity to build a relationship with him that was based in reality, instead of something that was mostly a fantasy,” she told me.\n “When a parent is gone, you really try to fill in that hole,” she went on. “And if you can’t get information about who they are, especially when you’re really little, you will just come up with things that comfort you or come up with things that you would really  like to be true. And you look for evidence that those things  are true. Honestly, I think it teaches you how to deceive yourself in a certain way. And unfortunately, that’s a really hard practice to get out of. And I wish I got more of an opportunity to just … know who my dad was.”", "posttime": "2021-07-30 11:25:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电话,prison,福特", "title": "监狱电话的费用", "title_en": "The Cost of a Prison Phone Call", "transed": 1, "url": "https://www.theatlantic.com/ideas/archive/2021/07/phoning-home-connecticut-state-prison/619586/", "via": "", "real_tags": ["电话", "prison", "福特"]}, {"category": "", "categoryclass": "", "imagename": "f263770f063ae92c3084ab19bd78b31b.jpg", "infoid": 1070565, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "动视暴雪处于危机模式。上周，加利福尼亚州公平就业和住房部就对女性雇员普遍存在的性别歧视、骚扰和歧视的指控提起了令人震惊的诉讼，这家魔兽世界出版商成为了这家魔兽世界出版商的对象。由此产生的影响日益加剧，最终导致 500 人于周三在欧文的暴雪娱乐总部举行罢工。该公司的股价本周已下跌近 10%，首席执行官鲍比·科蒂克 (Bobby Kotick) 周二在给员工的消息中承认，动视暴雪最初的反应是“聋子”。与此同时，随着越来越多的前任和现任员工公开谈论视频游戏行业最大、最有权势的雇主之一的工作条件和据称猖獗的厌女症，不断有新报道揭露可怕的不当行为。游戏行业正在聚集在动视暴雪员工的周围。许多前和现任暴雪成员、杰出的行业人物和 Twitch 主播，甚至来自竞争游戏工作室的开发人员都与员工一起团结起来参加周三的罢工，要求管理层采取具体行动。据 Axios 报道，来自全球 32 家工作室的近 500 名育碧员工在周三签署了一封公开信，表示对动视暴雪员工的支持。这封信还呼吁在整个行业范围内制定“一套规则和流程来处理这些犯罪行为的报告”。在过去的两年里，育碧自身也卷入了一系列性骚扰丑闻。 “我实际上与#ActiBlizzWalkout 中的人站在一起。我保证会成为变革的一部分，”前首席执行官迈克·莫海姆写道，他于 2018 年离开公司，就在加利福尼亚启动为期两年的调查之前，引发了上周的诉讼.本周早些时候，他向员工道歉，称他作为领导者“辜负”了他们。广受欢迎的网络游戏《魔兽世界》背后的团队本周发表了一份声明，称将“立即采取行动”删除“不适合我们的世界”的游戏内引用，尽管该声明没有说明具体细节。 2010 年魔兽世界开发者嘲笑一名女性批评游戏女性代表的视频也引起了一些相关人员的广泛批评和道歉。罢工的组织者呼吁改变。组织者在活动前表示，这次示威被称为“一场有利于所有员工改善劳动条件的持久运动的开始”。现在，根据 Axios 的说法，那些参与的人说他们“不会恢复沉默”。\n员工激进主义的热潮始于周一的一封公开信，此后 2,500 多名现任和前任动视暴雪员工签署了谴责公司领导层的初步回应，这封信称其为“令人憎恶和侮辱性的”。罢工组织者在一份声明中写道：“我们期待领导层对上述几点做出迅速回应并承诺采取行动，并期待就如何为所有员工打造更好的动视暴雪进行建设性对话。”参与的员工回避直接讨论工会问题，在被问到时告诉 The Verge “无可奉告”。无论如何，Activision Blizzard 已决定聘请著名的律师事务所 WilmerHale，该律师事务所帮助亚马逊在今年早些时候在阿拉巴马州成功开展了破坏工会的行动。水闸已经打开。在过去的几天里，主要发生在子公司暴雪娱乐的不当行为的故事已经开始涌现。其中最令人震惊的包括 Kotaku 对所谓的“Cosby Suite”进行的调查，据称该套件属于或与不光彩的前暴雪创意总监 Alex Afrasiabi 相关。诉讼中直接提到的套房是公司活动中众所周知的行业聚会和饮酒场所。在 Kotaku 获得的短信和 Facebook 帖子中，强烈暗示这个名字开始或最终成为暴雪高层领导之间的一个内部笑话，与该演员的约会强奸和性侵犯指控的历史有关，尽管一些员工声称这是对 Cosby 的提及丑毛衣。这篇文章展示了暴雪许多最知名的领导者和游戏设计师围绕 Cosby 的肖像摆姿势的照片。照片主题撰写的旧推文也表明，截至 2013 年，这是一个持续的笑话，在对 Cosby 的指控成为主流之前，但在许多早期指控者已经站出来之后。动视暴雪周三首次证实，在 Kotaku 的报告之后，它去年因不当行为解雇了 Afrasiabi。 Afrasiabi 被指控对暴雪员工和业内其他女性进行连续性骚扰，无论是直接在诉讼中，还是在此后公开的单独账户中。\nActivision Blizzard 的诉讼浮出水面仅一周时间，但对其所谓的工作环境以及公司领导层的行为和不作为的强烈反对已经合并为一场全面的劳工运动。该公司是否会回应罢工组织者的要求还有待观察。早期迹象表明，公司将更多地关注损害控制，因为该公司已经取消了进一步的全体会议。但动视暴雪最初的回应——诉讼中充斥着对过去“毫无根据”、“扭曲”和“过时”的描述——已经完全崩溃了。不管加州的诉讼会发生什么，这种规模的持续压力证明是一种相当有效的反击，即使是最强大的公司防御。", "note_en": "Activision Blizzard is in crisis mode. The World of Warcraft publisher was the subject of a  shocking lawsuit filed by California&#39;s Department of Fair Employment and Housing last week over claims of widespread sexism, harassment and discrimination against female employees. The resulting fallout has only intensified by the day, culminating in a  500-person walkout at the headquarters of Blizzard Entertainment in Irvine on Wednesday.\n The company&#39;s stock price has tumbled nearly 10% this week, and CEO Bobby Kotick acknowledged in a  message to employees Tuesday that Activision Blizzard&#39;s initial response was &#34;tone deaf.&#34; Meanwhile, there has been a continuous stream of new reports unearthing horrendous misconduct as more and more former and current employees speak out about the working conditions and alleged rampant misogyny at one of the video game industry&#39;s largest and most powerful employers.\n The game industry is rallying around Activision Blizzard employees. Numerous former and current Blizzard members, prominent industry figures and Twitch streamers, and even developers from competing game studios have joined employees in solidarity for Wednesday&#39;s walkout, demanding concrete action from management.\n  Close to 500 Ubisoft employees from 32 studios around the globe signed an open letter on Wednesday showing support for Activision Blizzard employees,  Axios reported. The letter also calls for an industrywide &#34;set of rules and processes for handling reports of these offences.&#34; Ubisoft has been embroiled in a series of sexual harassment scandals of its own over the past two years.\n &#34;I stand in virtual solidarity with those in the #ActiBlizzWalkout. I promise to be part of the change,&#34;  wrote former CEO Mike Morhaime, who left the company in 2018 just prior to California launching the two-year investigation that prompted last week&#39;s lawsuit. Earlier this week,  he apologized to employees, saying he &#34;failed&#34; them in his capacity as a leader.\n The team behind massively popular online game World of Warcraft has  issued a statement this week, saying it would &#34;take immediate action&#34; to remove in-game references &#34;that are not appropriate for our world,&#34; though the statement was light on specifics. A 2010 video of World of Warcraft developers  mocking a woman for critiquing the game&#39;s female representation has also prompted widespread criticism and apologies from some of those involved.\n Organizers of the walkout are calling for change. The demonstration was billed as &#34;the beginning of an enduring movement in favor of better labor conditions for all employees,&#34; organizers said ahead of the event. Now, those who participated say they &#34;will not return to silence,&#34;  according to Axios.\n The swell of employee activism began with an  open letter on Monday, since signed by more than 2,500 current and former Activision Blizzard employees condemning the initial response from company leadership, which the letter called &#34;abhorrent and insulting.&#34;\n &#34;We expect a prompt response and a commitment to action from leadership on the points enumerated above, and look forward to maintaining a constructive dialogue on how to build a better Activision Blizzard for all employees,&#34; reads a statement from the walkout organizers.\n Participating employees have shied away from outright discussing unionization,  telling The Verge &#34;no comment&#34; when asked. Regardless, Activision Blizzard has decided to  hire prominent law firm WilmerHale, which helped Amazon with its  successful union-busting efforts earlier this year in Alabama.\n The floodgates have opened. Stories of misconduct, primarily at subsidiary Blizzard Entertainment, have begun pouring out in the past few days. Among the most shocking include a  Kotaku investigation about the so-called &#34;Cosby Suite&#34; allegedly belonging to or connected with disgraced former Blizzard creative director Alex Afrasiabi. The suite, mentioned directly in the lawsuit, was a known industry hangout and drinking spot at company events.\n In text messages and Facebook posts obtained by Kotaku, there&#39;s strong insinuation the name started as or eventually became an inside joke among top Blizzard leadership pertaining to the actor&#39;s history of date rape and sexual assault allegations, though some employees claim it was a reference to Cosby&#39;s ugly sweaters.\n The article features a photo of many of Blizzard&#39;s most well-known leaders and game designers posing around a portrait of Cosby.  Old tweets authored by subjects of the photo also suggest it was an ongoing joke as of 2013, prior to allegations against Cosby going mainstream but well after numerous early accusers had already come forward.\n Activision Blizzard confirmed for the first time Wednesday that it fired Afrasiabi for misconduct last year following Kotaku&#39;s report. Afrasiabi is accused of serial sexual harassment of Blizzard employees and other women in the industry, both directly in the lawsuit as well as in separate accounts that have  since been made public.\n It&#39;s only been one week since the Activision Blizzard lawsuit surfaced, but backlash against its alleged work environment and the behavior and inaction of company leadership have coalesced into a full-blown labor movement.\n It remains to be seen whether the company will respond at all to the walkout organizers&#39; demands; early signs point to a focus more on damage control, as the company has  canceled further all-hands meetings. But Activision Blizzard&#39;s initial response — that the lawsuit was filled with &#34;meritless,&#34; &#34;distorted&#34; and &#34;out of date&#34; depictions of the past — has already completely crumbled. Regardless of what happens with California&#39;s lawsuit, sustained pressure of this magnitude is proving a rather effective counter to even the most powerful corporate defenses.", "posttime": "2021-07-30 10:35:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "动视,law,员工", "title": "看看动视暴雪诉讼的后果，因为该公司证实它去年因不当行为解雇了魔兽世界的负责人，并聘请了“破坏工会”的律师事务所", "title_en": "A look at the fallout from the Activision Blizzard suit, as the company confirms it fired WoW lead for misconduct last year and hires “union-busting” law firm", "transed": 1, "url": "https://www.protocol.com/activision-blizzard-lawsuit-floodgates-open", "via": "", "real_tags": ["动视", "law", "员工"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基尼系数（也称为基尼指数）是迄今为止最受欢迎和广为人知的不平等衡量标准，通常用于衡量某些国家、地区或其他社区的收入或财富不平等。它很受欢迎，因为它易于理解，其数学定义可以很容易地在图形上进行可视化。然而，正如人们对任何试图将不平等减少到一个数字的方案所期望的那样，基尼系数也有其局限性。即使在衡量各国收入和财富不平等的原始背景下也是如此，但当基尼系数移植到其他背景下（尤其是：加密货币）时，情况就更是如此。在这篇文章中，我将讨论基尼系数的一些限制，并提出一些替代方案。基尼系数是 Corrado Gini 于 1912 年引入的衡量不平等的指标。它通常用于衡量国家收入和财富的不平等，但它也越来越多地用于其他情况。曲线上方面积定义：绘制函数图，其中 \\(f(p)\\) 等于人口中收入最低的部分在总收入中所占的份额（例如 \\(f(0.1)\\）是收入最低的 10% 在总收入中所占的份额）。基尼系数是该曲线和 \\(y=x\\) 线之间的面积，作为整个三角形的一部分： 平均差定义：基尼系数是所有可能的个人之间收入平均差的一半，除以平均收入。例如，在上面的示例图表中，四个收入为 [1, 2, 4, 8]，因此 16 个可能的差异为 [0, 1, 3, 7, 1, 0, 2, 6, 3, 2, 0, 4, 7, 6, 4, 0]。因此平均差异为 2.875，平均收入为 3.75，因此 Gini = \\(\\frac{2.875}{2 * 3.75} \\approx 0.3833\\)。事实证明，两者在数学上是等价的（证明这是给读者的一个练习）！\n基尼系数很有吸引力，因为它是一个相当简单且易于理解的统计数据。这可能看起来并不简单，但相信我，几乎所有处理任意规模人口的统计数据都那么糟糕，而且往往更糟。在这里，看看标准偏差这样基本的公式：那么，它有什么问题？嗯，它有很多问题，人们写了很多关于基尼系数各种问题的文章。在本文中，我将重点讨论一个我认为关于基尼系数整体讨论不足的特定问题，但它与分析互联网社区（如区块链）中的不平等特别相关。基尼系数将两个实际上看起来完全不同的问题结合到一个单一的不平等指数中：由于缺乏资源而遭受痛苦和权力集中。为了更清楚地理解这两个问题之间的区别，让我们看一下两个反乌托邦： 反乌托邦 B：一个人拥有所有资源的一半，其他人平均分享剩余的一半 显然，这两个反乌托邦都不是居住的好地方。但它们并不是以非常不同的方式生活的好地方。反乌托邦 A 使每个居民在难以想象的可怕的大规模饥饿（如果他们最终在分配的左半部分）和平等主义的和谐（如果他们最终在右半部分）之间进行硬币翻转。如果你是灭霸，你可能真的喜欢它！如果不是，则值得以最强的力量避免。另一方面，反乌托邦 B 类似于《美丽新世界》：每个人都过着不错的生活（至少在拍摄每个人资源的快照时），但代价是极其不民主的权力结构的高昂成本。 d最好希望你有一个好的霸主。如果您是 Curtis Yarvin，您可能真的会喜欢它！如果你不是，那也非常值得避免。这两个问题足够不同，值得分别分析和衡量。这种差异不仅仅是理论上的。这是一张图表，显示了最底层 20%（避免反乌托邦 A 的体面代表）所赚取的总收入份额与最高 1%（接近反乌托邦 B 的体面代表）所赚取的总收入份额：来源：https： //data.worldbank.org/indicator/SI.DST.FRST.20（合并 2015 年和 2016 年数据）和 http://hdr.undp.org/en/indicators/186106。", "note_en": "The  Gini coefficient (also called the Gini index) is by far the most popular and widely known measure of inequality, typically used to measure inequality of income or wealth in some country, territory or other community. It&#39;s popular because it&#39;s easy to understand, with a mathematical definition that can easily be visualized on a graph.\n However, as one might expect from any scheme that tried to reduce inequality to a single number, the Gini coefficient also has its limits. This is true even in its original context of measuring income and wealth inequality in countries, but it becomes even more true when the Gini coefficient is transplanted into other contexts (particularly: cryptocurrency). In this post I will talk about some of the limits of the Gini coefficient, and propose some alternatives.\n  The  Gini coefficient is a measure of inequality introduced by Corrado Gini in 1912. It is typically used to measure inequality of income and wealth of countries, though it is also increasingly being used in other contexts.\n  Area-above-curve definition: draw the graph of a function, where  \\(f(p)\\) equals the share of total income earned by the lowest-earning portion of the population (eg.  \\(f(0.1)\\) is the share of total income earned by the lowest-earning 10%). The Gini coefficient is the area between that curve and the  \\(y=x\\) line, as a portion of the whole triangle:\n      Average-difference definition: the Gini coefficient is half the average difference of incomes between each all possible pairs of individuals, divided by the mean income.\n For example, in the above example chart, the four incomes are  [1, 2, 4, 8], so the 16 possible differences are  [0, 1, 3, 7, 1, 0, 2, 6, 3, 2, 0, 4, 7, 6, 4, 0]. Hence the average difference is 2.875 and the mean income is 3.75, so Gini =  \\(\\frac{2.875}{2 * 3.75} \\approx 0.3833\\).\n It turns out that the two are mathematically equivalent (proving this is an exercise to the reader)!\n  The Gini coefficient is attractive because it&#39;s a reasonably simple and easy-to-understand statistic. It might not  look simple, but trust me, pretty much everything in statistics that deals with populations of arbitrary size is that bad, and often much worse. Here, stare at the formula of something as basic as the  standard deviation:\n     So, what&#39;s wrong with it? Well, there are lots of things wrong with it, and people have  written lots of  articles about  various problems with the Gini coefficient. In this article, I will focus on one specific problem that I think is under-discussed about the Gini as a whole, but that has particular relevance to analyzing inequality in internet communities such as blockchains.  The Gini coefficient combines together into a single inequality index two problems that actually look quite different: suffering due to lack of resources and concentration of power.\n To understand the difference between the two problems more clearly, let&#39;s look at two dystopias:\n Dystopia B: one person has half of all the resources, everyone else equally shares the remaining half\n       Clearly, neither of those two dystopias are good places to live.  But they are not-very-nice places to live in very different ways. Dystopia A gives each resident a coin flip between unthinkably horrific mass starvation if they end up on the left half on the distribution and egalitarian harmony if they end up on the right half. If you&#39;re  Thanos, you might actually like it! If you&#39;re not, it&#39;s worth avoiding with the strongest force. Dystopia B, on the other hand, is Brave New World-like: everyone has decently good lives (at least at the time when that snapshot of everyone&#39;s resources is taken), but at the high cost of an extremely undemocratic power structure where you&#39;d better hope you have a good overlord. If you&#39;re  Curtis Yarvin, you might actually like it! If you&#39;re not, it&#39;s very much worth avoiding too.\n These two problems are different enough that they&#39;re worth analyzing and measuring separately. And this difference is not just theoretical. Here is a chart showing share of total income earned by the bottom 20% (a decent proxy for avoiding dystopia A) versus share of total income earned by the top 1% (a decent proxy for being near dystopia B):\n  Sources:  https://data.worldbank.org/indicator/SI.DST.FRST.20 (merging 2015 and 2016 data) and  http://hdr.undp.org/en/indicators/186106.", "posttime": "2021-07-30 10:35:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "gini,基尼系数", "title": "反对过度使用基尼系数", "title_en": "Against Overuse of the Gini Coefficient", "transed": 1, "url": "https://vitalik.ca/general/2021/07/29/gini.html", "via": "", "real_tags": ["gini", "基尼系数"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JPG vs Raw：第一次做对 © 2009 KenRockwell.com。版权所有。我使用这些商店。我不能保证下面的广告。 2008 年的一个大问题是人们在拍摄时不知道为什么。 Raw 需要专用软件才能读取。如果您刚刚购买了新相机，则在更新计算机软件之前您将无法打开这些文件。更糟糕的是，许多新相机在相机制造商的软件更新前一周推出，如果您使用 Adob​​e、Apple 或其他公司的软件，可能需要等待数周（或更长时间）才能更新。这意味着如果您没有拍摄 JPG，您今天可能无法使用新相机打开文件！如果您使用 Photoshop 和 Adob​​e Camera Raw，您可能只需要购买最新版本的 Photoshop，因为 Adob​​e 不会更新旧版本以从新相机读取文件。哈哈！ Photoshop 非常好，我发现不需要从 CS2 更新，也不需要拍摄原始数据，我不必这样做。如果你在拍摄动作片，raw 是行不通的。您会以超乎想象的速度填满一张 8 gig 卡。我从不直接射击。我为什么要？ Raw 浪费时间和空间，即使您可以打开文件，它看起来也不比 JPG 好。相机都从原始数据开始，并使用相机中的硬件将这些数据转换为 JPG 图像。然后他们丢弃原始数据，因为它不再需要。\n保存这些原始数据就像人们将二十年的报纸堆放在房子周围一样。他们知道他们有时可能需要这些信息，但它确实会妨碍！其他人认为他们疯了。一些更高级的相机会保存这些原始数据，以便您以后可以使用软件来执行相机硬件所做的相同操作。软件需要更长的时间来完成相机硬件所做的相同事情，但让信心不足的人有机会在以后尝试修复错误。 JPG 和 raw 的图像质量相同。请参阅我的 D200 图像质量设置示例。另请参阅我对文件格式的解释。此页面引起争议，因为事实并不总是与聊天室中数码摄影新手传播的老太太的故事一致。我正在分享在数字成像领域连续三年全职带薪专业经验中收集到的对我有用的东西。此外，在我获得工程学位之前，我已经学习了十年的数字成像，并开始作为一名专业人士，与发明了这一切的数学博士们一起工作。读者对那些对我在下面分享的观察结果提出异议的人的回应在这里。如果您一天拍摄成百上千张图片，请拍摄 JPG，不要担心。几乎所有意图和目的的质量都与原始文件相同，原始文件将需要数 GB 或数十 GB 的时间来下载、转换、编目和刻录到备份 CD。事实上，如果你拍摄这么多，那么 JPG 可以提供更好的质量，因为尝试拍摄这么多原始照片会阻碍你的工作流程，并且当你的卡片填满时，你可能会完全错过制作一些图像。您总是会用完存储卡或等待访问指示灯停止闪烁的时间。如果你喜欢一张一张地调整你的图像并且一次拍摄不到一百张照片，那么 raw 可能适合你。事实上，如果您更喜欢可以从 raw 中获得的外观（在某些情况下它可能与 JPG 不同，具体取决于软件），您可以让您的计算机批量处理图像并将结果保存为 JPG。我几乎从不以原始格式拍摄任何东西，而且当我这样做时，无论如何我都浪费了所有努力，但我从来没有看到任何区别。 （如果我在我的电脑上把东西吹到 100% 或更大，我可以看到差异，但在打印时不会。）\n这就是它的全部内容。令人遗憾的是，有些人实际上对这一切感到如此兴奋，以至于他们建立了像以前一样的仇恨网站。这很可悲，因为我完全同意佩特里的 Pontifications。我认为他把那个仇恨页面移到了这里。对 JPG 或 raw 的偏好取决于您要尝试做什么。每种格式都没有绝对的优点；这完全取决于它们与您手头的特定工作的合适程度。每个人的需求都不一样，我只是更喜欢 JPG。话虽如此，这里更多的是我“通常的固执己见，暴躁的风格”。如果您了解上述基础​​知识，则可以安全地跳过它。 JPG（与 JPEG 相同）是普通的数码相机图像。相机根据您的设置（如锐度和白平衡）从原始图像传感器数据创建 JPG 图像。相机制作JPG，然后一旦记录JPG，原始数据就会蒸发。当心 JPEG 2000，它只能在某些高级软件中找到。这是一个更新的 JPG 版本，今天在静态摄影中已经被遗忘了。它与当前的 JPG 系统完全不兼容。 JPEG 2000 已在数字电影计划中得到应用，并将用作我们许多人或大多数人今天和不久的将来在影院观看的电影的标准。原始文件只是原始传感器数据。在进一步处理之前，它不是图片。大多数花哨的数码相机允许您保存原始数据而不是实际的 JPG 图片。如果这样做，您仍然需要在计算机中进行处理以制作您实际可以看到的图像（JPG 或其他格式）。相机在硬件中执行此处理的速度比计算机在软件中执行的速度要快得多。一些相机具有方便的原始 + JPG 模式，可同时保存原始数据和 JPG 图片。原始文件就像生橄榄：您需要先烹饪或以其他方式处理它们，然后才能使用它们。如果保持原始状态，它们也会很快变质，并且一旦加工成橄榄油或 JPG 之类的东西就可以永久保存。\n恐怖的恐怖，我听说最新的尼康软件甚至无法读取旧相机的 NEF，您需要加载旧软件才能读取它们。就像生鸡蛋一样，除非您将其处理成蛋清打印或 JPG 之类的东西，否则如果不进行处理，原始文件可能会变质。不是文件变坏了，愚蠢，而是未来软件读取它的潜在能力。由于原始数据对于每台相机都是完全唯一的，并且即使对于同一相机的不同固件版本也是不同的，因此即使不同的文件具有相同的后缀，如 .CRW 或 .NEF，原始数据也不是一种格式。原始文件本身不会坏。糟糕的是，在 10 年或 20 年之后，无论我们在使用何种类型的计算机上运行的任何软件，都可能无法打开一个被遗忘已久的 20 年专有文件。 JPG 是通用的。 Raw 专用于相机品牌和型号，甚至相机固件版本。如果没有可靠的制造商支持，您将无法再次使用原始文件。您能在今天的 Lotus Notes 或 PFS Write 或 Brother Style Writer 中找到一台计算机来打开 10 或 20 年前的文字处理文件吗？我不能；这就是为什么我尽可能将我的文件从这些程序转换为通用的 .TXT 格式。你相信佳能、尼康和 Adob​​e 支持 10 或 20 岁的相机吗？ 30 或 40 年前的相机怎么样？如果这样做，请继续将原始文件保留为原始文件。我将所有原始文件转换为 JPG 或 TIFF 进行存档。相机中的 JPG 处理可能比您稍后在软件中从原始数据中处理的更好。在“户外摄影师”杂志 2004 年 9 月号的第 25 页中，Rob Shepard 说“……当两者直接打开时，高质量的 JPEG 图像看起来远远优于原始文件。”相机从传感器传出的 12 位或更多原始数据创建其 JPG。您的对比度、白平衡、锐化和所有内容都会应用于相机内的原始数据，然后才将文件压缩并存储为 JPG。您将看不到额外的工件，因为这些都是在 JPG 转换之前完成的。\n使用原始文件显然需要更多的时间和耐心，就像重制豆子一样，因为您可以在相机中免费完成所有这些处理。如果由于某种原因您不确定要使用什么设置，您只想解决这个问题。原始数据，因为它包含所有内容，所以也占用了更多的空间，需要更多的时间来移动。这有点像拥有一辆可以运行的完整汽车 (JPG)，或者拥有一百万件仍需要组装才能驾驶它的科学项目（原始）。在拍摄原始文件后，您无法真正更改曝光度，尽管打开此数据的软件提供了重新缩放数据的选项并给人以更改曝光度的印象。您也可以从 JPG 中获得相同的合成照明，尽管只有原始图像才可以修正过度曝光。我从调整者那里得到了很多热量，因为我和其他摄影师一样，更喜欢在相机内进行调整并直接使用 JPG。其他人更喜欢以后花更多的时间来处理原始数据，但这不适合我。我用 JPG 获得了我需要的外观，并且更喜欢花时间制作更多照片。如果你是那种喜欢玩弄和重做的人，那么生吃绝对适合你。每个人的需求都不一样。对于许多爱好者来说，调整是乐趣的一部分，我不想破坏它。请不要认为我更喜欢第一次就拍对，而不是以后再调整。如果我需要纠正一个错误，我只需从 JPG 中完成。 JPG（与 JPEG 相同）是多产射手使用的标准。它提供了出色的质量，并为一切提供了最快的速度。它是地球上最流行和最兼容的图像格式。它尤其适用于数码相机最适合拍摄的内容，例如新闻、体育和活动。使用 JPG，您可以一次拍摄成百上千张图像，并且无需进一步处理即可发布文件。 JPG 处理得当，就像数码相机在设置为 NORMAL 或 FINE 时所做的那样，提供可以立即使用的出色效果。当然，您需要一台专业的数码相机来提供精确的相机内调整，例如微妙的白平衡控制和即时、轻松的访问，才能做到这一点。如果这些相机需要通过菜单进行调整或白平衡功能有限，那么专业人士会跳过许多让业余爱好者兴奋的相机。像 Karl Grobl 这样需要产生结果的专业记者拍摄 JPG。卡尔刚从亚洲为期两个月的一系列任务中归来。他带回了 20 GB 的 JPG，而这些只是保管者。 Karl 不再有时间在 Photoshop 中摆弄任何东西：如果图像在拍摄时不完美，它就会被删除。如果制作图像是你的生计，那么生命太短暂了，不能摆弄草率的图像。当然，如果摄影是你的爱好并且你觉得无聊很有趣，或者如果你在工作室里有时间燃烧，那么那就是另一回事了。卡尔有大量的图像，他需要接触大量的客户，然后他就开始下一个任务了。没有时间等待诸如原始文件处理之类的事情。我从他的 JPG 中看到了 Karl 的 20 x 30&quot; 照片，它们非常壮观。有时 raw 看起来与 JPG 不同，这取决于相机内使用的锐化算法 (JPG) 和不同版本的软件 (raw) 之间的差异。我找到每一个原始版本（Adobe Photoshop CS、Adobe Camera raw、相机制造商的版本、iView 等）在锐度、曲线和颜色方面对图像的处理略有不同，所以在你之后你永远不会真正有一个明确的外观已将文件打开并保存为标准 JPG、PSD 或 TIFF。您可能更喜欢其中一个。如果您不喜欢相机内选项，请拍摄未锐化的 JPG 并在其他地方锐化。同样，如果您设置错误白平衡或曝光不足，您可以稍后使用例如 Photoshop 的色阶、曲线和/或色彩平衡功能等进行校正。我在 Photoshop 的色阶或曲线命令中为深色 JPG 添加两档曝光没有问题。\n许多拍摄 raw 的人，我认为这是浪费时间，没有意识到即使是 JPG 也可以在 Photoshop 中调整白平衡。不，Photoshop 还没有一个“傻瓜”面板，实际上标有常见的白平衡绰号，但熟练的摄影师总是能够做到这一点。我更喜欢在色阶命令中使用“设置白点”和“设置中性灰色”滴管。请参阅此处了解如何操作。一些相机，如卡西欧 EX-Z750，也允许在拍摄后对白平衡和曝光的 JPG 进行校正。我通过在 ISO 200、ISO 800 下以 JPG 和原始格式拍摄场景，然后在 ISO 200 下两次曝光不足（将曝光补偿设置为 -2），对我的 D1H（您也可以）进行了刻意比较。现在有六枪。通过在打开时添加 +2 档来打开曝光不足的原始图像，并使用色阶或曲​​线对深色 JPG 进行校正。现在看看这两个和 ISO 800 下拍摄的照片。它们看起来几乎一样，如果你真的深入了解相机的信号处理和外部数学，你会意识到你正在对相同的数据做同样的事情;只是不同的进程在不同的地方执行这些相同的算法。当然，您如何使深色 JPG 变亮可能会改变图像的外观；我忘记了我最好用什么曲线来模拟添加两个停靠点。嘻嘻，我只拍了普通的 ISO 200 照片是为了表明从 ISO 200 推两档与直接在 ISO 800 下拍摄具有相同的颗粒感。实际上最好首先在 ISO 800 下拍摄，因为相机做得更好通过增加 CCD 放大器的模拟增益。此外，该室内/室外对比场景的最佳图像是通过使用曝光不足的图像（保留室外部分）并使用滤镜来减轻室内的黑暗。我从 JPG 和原始文件中得到了相同的结果。如果你是一个调整者，你会感兴趣学习 raw 和 JPG 也有相同的有效位精度。 JPG 每像素每种颜色有 8 位，而 raw 可能有 12 位，但这里有一个大问题：raw 是 12 位线性，JPG 是 8 位对数、伽马校正或其他一些从 12 位线性数据派生的非线性变换.因此，在这可能很重要的阴影中，两者是相同的，因为非线性编码保留了黑暗区域中的完整 12 位分辨率。即使这两种格式的暗分辨率不同，传感器噪声仍然大于 1 LSB，这使其成为一个有争议的问题。 Raw 是为那些打算一次花费大量时间处理一张图像的人设计的。对于这些应用，我使用大画幅 4x5&quot; 胶片来获得更好的质量，因此您明白我为什么不使用 raw。Raw 非常适合用数码相机拍摄风景的人，这不是数码相机的用途。不幸的是，这在业余爱好者中越来越流行，但请记住，业余爱好者的乐趣在于制作照片，而数码才是王道。个人而言，我专注于最终图像，大电影擅长。这可以解释我从中获得的所有热量业余爱好者，他们当然喜欢 raw 并在他们的数码单反上拍摄优胜美地，这与我所做的非常不同。Raw 也适用于在制作图像时尚未获得完美曝光的人，当然 JPEG 也允许这些调整。如果你能得到正确的图像，Raw 是不必要的乏味。Raw 总是需要额外的步骤来从相机处理成可用的格式，文件只能用非常特殊的软件打开，需要更多的时间来处理所有事情因此会减慢工作流程。实际上，raw 并不是任何一种标准格式：.CRW 或 .NEF 或任何文件实际上与每种型号的相机都非常不同，您需要不断更新转换软件才能从任何文件中读取文件你刚拿到的相机。我有来自尼康 D70 的高级样品的 NEF 文件，由于软件尚未发布，我无法打开。在专业领域，工作流程效率是等待批量转换完成与从事新的付费项目之间的区别。不管怎样，Raw 看起来和好的 JPG 一样。我承认，在 D70 上，默认锐化的差异在于，如果您在计算机上放大到 100%，原始图像看起来确实比 JPG 更清晰，但在 12 x 18&quot; 打印时我仍然看不到. 不要过分关注销售演示，其中展示了如何在关键的半光圈曝光过度的镜头中恢复高光细节。首先，没有人真的是演播室摄影师如此糟糕，以至于他们实际上会过度曝光一系列的工作室拍摄了半个停止而在数码相机上不知道的。这让我想起喜剧演员乔治卡林的台词，他认为人类可以做的最愚蠢的事情是在有工作的汽车中耗尽汽油电量计。你可以在相机的 LCD 上看到过度曝光。是的，如果你搞砸了，raw 可以很好地捕捉到最后半个停止，但这大约取决于你的相机可以纠正的范围。今天我发现这与之前不同尼康 D70 相机似乎提供了更多的捕捉能力h 失去了高光，我还没有看到，raw 所涉及的努力证明了最终图像的任何改进是合理的。尽管我可以看到改进，但我的女朋友仍然更喜欢 BASIC JPG 图像的 12 x 18&quot; 打印，而不是从原始文件制作的 12 x 18&quot; 打印，我花了一个小时校正所有级别和镜头失真和色度问题。这就是艺术！\n如果你打算花几个小时来处理单个镜头，或者有足够的时间像这样在聊天室里浪费时间，那么继续拍摄原始照片，记住将它们保存为标准化的东西，以便以后阅读。如果您现在需要大量精美图像，请直接拍摄标准 JPG。对于真实照片，RAW 看起来并不比 JPG 好。它只会占用空间，浪费您的时间，并冒着现在和将来都无法打开的风险。如果您只拍摄几十张图像并且想在 Photoshop 中处理每张图像，那么 Raw 是可以的；如果您每天需要成百上千的图像并在开始时将它们正确放入相机，那么 JPG 是最佳选择。从单个原始文件制作双重曝光合成的最新技巧实际上可以从 JPG 中完成；只需在 Photoshop 中打开 JPG（为高光曝光），然后将 LEVELS 或 CURVES 命令应用于表示阴影的图层。示例 1：我的一个朋友第一天带着他的 D1X 参加了一场跑步比赛。他不知道他会拍这么多，他的单张 256MB 卡很快就装满了。他不得不将相机设置为 SMALL 分辨率 (1,312 x 2,000) 和 BASIC JPG (256kB)，这样他才能继续拍摄。然后，他将其中一个图像文件授权给一家鞋履公司用于海报。印刷时看起来很棒，他获得了 1,200 美元用于临时使用该文件。 （不，他并没有以如此低的价格直接出售图像。）当然，他可以拍摄原始照片，但如果他这样做，他将完全错过镜头，因为他会失去记忆，根本没有任何图像而不是一个好看的。示例 2：昨天当每个人都在聊天室时，我花了一整天的时间来咨询价值 7,000,000 美元的房屋的拍摄。我们在佳能 1D 上拍摄了 raw + JPG，这样我的客户就会有两种文件供以后学习。从 1 Gig 闪存卡下载图像花了半个小时，......", "note_en": "JPG vs Raw:   Get it Right the First Time  © 2009 KenRockwell.com. All rights reserved.\n      I use  these stores. I can&#39;t vouch for  ads below.            A big problem in 2008 is that people are shooting raw and not knowing why. Raw requires dedicated software to read. If you just bought a new camera, you won&#39;t be able to open the files until you update your computer&#39;s software.\n  Worse, many new cameras come out a week before the camera maker&#39;s software is updated, and if you use software by Adobe, Apple or others, may have to wait weeks (or much longer) until there is an update. That means you may not be able to open your files today with your new camera if you didn&#39;t shoot JPG!\n  If you use Photoshop and Adobe Camera Raw, you just might have to buy the newest version of Photoshop, since Adobe doesn&#39;t update older versions to read the files from new cameras. Ha Ha! Photoshop is so good I&#39;ve seen no need to update from CS2, and not shooting raw, I don&#39;t have to.\n  If you&#39;re shooting action, raw doesn&#39;t work. You&#39;ll fill an 8 gig card faster than you can imagine.\n  I never shoot raw. Why would I? Raw is a waste of time and space, and doesn&#39;t look any better than JPG even when you can open the files.\n      Cameras all start with raw data and convert this data to JPG images with hardware in the camera. They then throw away the raw data since it&#39;s no longer needed.\n  Saving this raw data is  exactly like people who save twenty years of newspapers in piles around their house. They know they might need the information sometime, but it sure gets in the way! Other people think they are crazy.\n  Some fancier cameras save this raw data so you can use software to do the same thing the camera&#39;s hardware did, later. Software takes much longer to do the same thing the camera&#39;s hardware does, but gives less confident people the chance to try to fix mistakes later.\n  Image quality is the same in JPG and raw. See my  D200 Image Quality Setting Examples. See also my explanation of  File Formats.\n  This page generates controversy because fact doesn&#39;t always agree with old wives&#39; tales circulated by newcomers to digital photography in chat rooms. I&#39;m sharing what works for me gathered across three decades of continuous full-time paid professional experience in digital imaging. In addition I was studying digital imaging for ten years before I got my engineering degree and started as a professional working with the guys with Ph.Ds in mathematics who invented all this.\n  A reader&#39;s response to those who take issue with the observations I share below is  here.\n          If you shoot hundreds or thousands of images in a day shoot JPG and don&#39;t worry. The quality is the same for almost all intents and purposes as raw, and the raw files would take gigabytes or tens of gigabytes and resultant hours to download, convert, catalog and burn to backup CDs. In fact, if you shoot this much then JPG can give better quality since attempting to shoot this much raw will constipate your workflow and you could miss making some images entirely as your cards fill up. You&#39;d always be running out of memory cards or time waiting for the access light to stop blinking.\n  If you love to tweak your images one-by one and shoot less than about a hundred shots at a time than raw could be for you. In fact, if you prefer the look you can get from raw (it may be different from JPG in some cases depending on software) you can let your computer batch process images and save the results as JPGs, too. I almost never shoot anything in raw, and when I do I never see any difference for all the effort I wasted anyway. (I can see differences if I blow things up to 100% or bigger on my computer, but not in prints.)\n  That&#39;s about all there is to it. It&#39;s sad that some people actually get so excited by all this that they put up hate sites like one that used to be  here. It&#39;s sad because I completely agree with Petteri&#39;s Pontifications. I think he moved that hate  page here. One&#39;s preference for JPG or raw depends on what you&#39;re trying to do. Each format has no absolute goodness; it&#39;s all in how appropriate they are to your particular work at hand. Everyone&#39;s needs vary and I just happen to prefer JPG.\n  With that said, here&#39;s more in my &#34;usual opinionated, cranky style.&#34; If you understand the basics above you can safely skip it.\n      JPGs (same as  JPEGs) are normal digital camera images. Cameras create JPG images from raw image sensor data based on your settings like Sharpness and White Balance. The camera makes the JPG and then the raw data evaporates as soon as the JPG is recorded.\n  Beware  JPEG 2000 which you only find in some advanced software. It was a newer proposed version of JPG that has been forgotten today for still photography. It is COMPLETELY INCOMPATIBLE WITH the current JPG systems. JPEG 2000 has found application in the  Digital Cinema Initiative and will be used as their standard for the movies many or most of us will be seeing in theaters today and in the near future.\n      Raw files are just the raw sensor data. It isn&#39;t a picture until it is processed further. Most fancy digital cameras allow you to save the raw data instead of the actual JPG picture. If you do, you still have to do the processing in your computer to make an image (JPG or otherwise) that you actually can see. Cameras do this processing in hardware much faster than your computer can do it in software.\n  Some cameras have a handy raw + JPG mode which saves both the raw data and the JPG picture.\n  Raw files are just like raw olives: you need to cook or otherwise process them before you can use them. They also go bad fast if left in the raw state and can keep forever once processed to something like olive oil or JPGs.\n  Horror of horrors, I&#39;ve heard that the latest Nikon software can&#39;t even read the NEFs from older cameras and that you need to load older software to read them. Just like raw eggs, unless you process it into something like an egg-albumen print or a JPG, the raw files may go bad if left unprocessed.\n  It&#39;s not the file that goes bad, silly, it&#39;s the potential ability of future software to read it. Since raw data is entirely unique to each camera, and different even for different firmware revisions for the same camera, raw isn&#39;t even a format, even though the different files have the same suffix like .CRW or .NEF.\n  Raw files themselves don&#39;t go bad. What goes bad is that in 10 or 20 years, whatever software we&#39;re running on whatever sort of computer we&#39;ll be using may not be able to open a long-forgotten 20-year old proprietary file.\n  JPGs are universal. Raw is proprietary to camera make and model and even camera firmware version. Without solid manufacturer support you won&#39;t be able to use your raw files again.\n  Can you find a computer to open word processing files from 10 or 20 years ago today in Lotus Notes or PFS Write or Brother Style Writer? I can&#39;t; that&#39;s why I converted my files from these programs to the universal .TXT format back when I could. Do you trust Canon, Nikon and Adobe to support 10 or 20 year old cameras? How about 30 or 40 year old cameras? If you do, go ahead and leave your raw files as raw. I convert all my raw files to JPGs or TIFFs for archiving.\n  The JPG processing in the camera can be better than what you may be able to do later in software from raw. In the September 2004 issue of &#34;Outdoor Photographer&#34; magazine, page 25, Rob Shepard says &#34;...the high quality JPEG images looked far superior to the raw files when both were opened directly.&#34;\n  Cameras create their JPGs from the 12 bit or more raw data as it comes off the sensor. Your contrast, white balance, sharpening and everything are applied to the raw data in-camera, and only afterwards is the file compressed and stored as a JPG. You&#39;ll see no additional artifacts since that&#39;s all done before the JPG conversion.\n  Using raw files obviously takes a lot more time and patience, like  refrying beans, since you could have had all that processing done right in the camera for free. You only want to go through this trouble if for some reason you&#39;re unsure of what settings to use. The raw data, since it includes everything, also takes up a whole lot more space and takes more time to move around. It&#39;s sort of like either having a complete car that runs (JPG), or a science project in a million pieces that still needs assembly before you can drive it (raw). You can&#39;t really change exposure after a raw file is shot, although the software that opens this data gives one the option to rescale the data and give the impression of changing exposure. You can get this same synthetic lightening from JPGs, too, although only raw allows some ability to correct overexposure.\n  I take a lot of heat from tweakers because I, like other photographers, prefer to make my adjustments in-camera and use the JPGs directly. Others prefer to spend even more time later twiddling in raw, but that&#39;s not for me. I get the look I need with JPGs and prefer to spend my time making more photos. If you&#39;re the sort of person who likes to twiddle and redo than by all means raw is for you.\n  Everyone&#39;s needs vary. For many hobbyists tweaking is part of the fun and I don&#39;t want to spoil that. Please just don&#39;t take it personally that I prefer to get my shots right the first time instead of having to tweak them later. If I need to correct a goof I just do it from the JPGs.\n      JPG (same as  JPEG) is the standard used by prolific shooters. It gives great quality and offers the fastest speed for everything. It is the most popular and compatible image format on the planet. It is especially popular for the things for which digital cameras are best suited in the first place, like news, sports and events. With JPG you can shoot hundreds or thousands of images at a time and the files are ready for release with no further processing. JPGs done properly, as digital cameras do when set to NORMAL or FINE, give great results you can use immediately. Of course you need a professional digital camera that provides the exact in-camera adjustments, like subtle white balance control and immediate, easy access to them, to be able to do this. Pros skip many of the cameras that excite amateurs if those cameras require adjustments to be made through menus or have limited WB capabilities.\n  Professional journalists like  Karl Grobl who need to produce results shoot JPG. Karl just returned from a two month series of assignments in Asia. He brought back 20 Gigabytes of JPGs, and those were just the keepers. Karl no longer has the time to piddle with anything in Photoshop: if the image isn&#39;t perfect as shot it gets deleted. Life is too short to piddle with sloppy images if making images is what you do for a living. Of course if photography is your hobby and you find the piddling enjoyable or if you&#39;re in a studio with time to burn then that&#39;s another story. Karl has a ton of images he needs to get to a ton of clients, and then he&#39;s off on the next assignment. There is just no time to wait for things like raw file processing. I&#39;ve seen Karl&#39;s 20 x 30&#34; prints from his JPGs and they are spectacular.\n  Sometimes raw will look different from JPG depending on the differences between sharpening algorithms used in-camera (JPG) and in different versions of software (raw.) I find every raw opener (Adobe Photoshop CS, Adobe Camera raw, the camera maker&#39;s version, iView, etc.) processes the image a little bit differently in terms of sharpness, curves and colors, so you never really have a definitive look until after you&#39;ve opened and saved the file as a standard JPG, PSD or TIFF.\n  You may prefer one or the other. If you don&#39;t like the in-camera options, shoot unsharpened JPGs and sharpen elsewhere. Likewise, if you set the wrong white balance or underexposed you can always correct it later using, for instance, Photoshop&#39;s Levels, Curves and/or Color Balance features, among others. I have no problem adding two stops of exposure to a dark JPG in Photoshop&#39;s Levels or Curves command.\n  Many people who shoot raw, which I consider to be a big waste of time, don&#39;t realize that white balance can be adjusted in Photoshop even from JPGs. No, Photoshop doesn&#39;t yet have a &#34;dummies&#34; panel actually marked with common white balance monikers, but skilled photographers have always been able to do it. I prefer using the &#34;Set White Point&#34; and &#34;Set Neutral Gray&#34; eyedroppers in the Levels command. See  here for how to do it.\n  Some cameras, like the  Casio EX-Z750, allow correction of JPGs for White Balance and exposure after they&#39;ve been shot as well.\n  I&#39;ve made deliberate comparisons on my D1H (and so can you) by shooting a scene in both JPG and raw at ISO 200, ISO 800 and then underexposing two stops (set exposure compensation to -2) at ISO 200. There now are six shots. Open the underexposed raw by adding +2 stops while opening and apply correction to the dark JPG with Levels or Curves. Now look at these two vs. the shots made at ISO 800. They look pretty much the same, which if you really get into the camera&#39;s signal processing and external math you&#39;ll realize that you&#39;re doing the same thing to the same data; just the different processes are doing these identical algorithms in different places. Of course how you lighten the dark JPG will probably alter the look of the image; I forget what curves I used best to simulate adding two stops. Hee hee, I only made the normal ISO 200 shots to show that pushing two stops from ISO 200 gives the same grain as shooting directly at ISO 800. Actually it&#39;s better to shoot at ISO 800 in the first place since the camera does a better job by increasing the analog gain of the CCD amplifiers. Also the very best image of that indoor/outdoor contrasty scene was made by using the underexposed image (which retained the outdoor part) and using a filter to lighten the dark indoors. I got the same result from the JPG and raw files.\n  If you&#39;re a tweaker you&#39;d be interested to learn raw and JPG also have the same effective bit precision. JPG has 8 bits per color per pixel and raw may have 12 bits, but here&#39;s the big catch: raw is 12 bit linear, and JPG is 8 bit  log, gamma corrected or some other non-linear transform derived from the 12 bit linear data. Thus in the shadows where this might matter the two are the same, since the full 12 bit resolution in the dark areas is preserved by the non-linear coding. Even if the two formats differed in dark resolution the sensor noise is still greater than one  LSB anyway making it a moot point.\n      Raw is designed for people who intend to spend a lot of time twiddling with one image at a time. For these applications I use large format 4x5&#34; film instead for much better quality, thus you see why I don&#39;t use raw. Raw is very popular for people shooting landscapes with digital cameras, which is not what digital cameras are for. Unfortunately this is becoming popular among amateurs, but remember that for amateurs the fun is in making the photo, and for fun digital is king. Personally I focus on the final image, for which big film excels. This goes to explain all the heat I get from hobbyists, who of course love raw and shoot Yosemite on their digital SLRs which is very different from what I do. Raw is also for people who don&#39;t yet get perfect exposure right when they make the image, although of course JPEGs also allow these adjustments.\n  Raw is needlessly tedious if you can get the right image to begin with. Raw always requires extra steps to process from the camera into a usable format, the files can only be opened with very special software, requires far more time for everything and therefore slows workflows. In fact, raw is not any sort of a standard format: .CRW or .NEF or whatever files are actually very different from each model of camera, and you constantly need to be updating your conversion software just to be able to read files from whatever camera you just got. I had NEF files from an advance sample of a Nikon D70 I couldn&#39;t open since the software had not been released. In the professional arena workflow efficiency is the difference between waiting for a batch convert to complete and working on a new paying project. Raw looks the same anyway as a good JPG. I will admit that on the D70 the differences in default sharpening are such that the raw images do look sharper than the JPGs if you&#39;re looking zoomed in to 100% on a computer, but were still invisible to me in 12 x 18&#34; prints.\n  Don&#39;t pay too much attention to sales demos showing how you can restore details in highlights for a shot that was overexposed by a critical half stop. First off, no one really is so bad a studio photographer that they&#39;d actually overexpose a series of studio shots by a half a stop and not know it on a digital camera. That reminds me of comedian  George Carlin&#39;s line about he thinks that the stupidest thing a human being can do is to run out of gas in a car with a working gas gauge. You can see overexposure on the LCD of the digicam. Yes, raw is great to catch this last half a stop if you goofed, but that&#39;s about as far as it can correct depending on your camera. Today I find that unlike earlier cameras the Nikon D70 seems to offer a good deal more ability to catch lost highlights, which again I have yet to see that the efforts involved with raw justified any improvement in the final image. Even though I could see the improvement, my girlfriend still preferred the 12 x 18&#34; print of the BASIC JPG image to the 12 x 18&#34; print made from the raw file on which I spent an hour correcting all the levels and lens distortion and chromatic issues. Such is art!\n  If you intend to spend hours twiddling with individual shots or have enough time to waste piddling in chat rooms like  this then go ahead and shoot raw, just remember to save them as something standardized so you can read them later. If you need loads of great images  now then shoot straight to standard JPGs.\n  Raw looks no better than JPG for real photos. It just takes up space, wastes your time and runs the risk of not being able to be opened now and in the future. Raw is OK if you only shoot a few dozen images and you want to play around with each of them in Photoshop; JPG is best if you need hundreds or thousands of images each day and get them right in the camera to begin with. The latest trick of making dual-exposure composites from single raw files actually can be done just the same from a JPG; just open the JPG (exposed for the highlights) in Photoshop and apply the LEVELS or CURVES command to the layer representing your shadows.\n  Example 1 : a friend of mine on his first day out with his D1X shot a foot race. He had no idea he would shoot so much and his single 256MB card was filling up quickly. He had to set the camera down to SMALL resolution (1,312 x 2,000) and BASIC JPG (256kB) so he could keep shooting. He then licensed one of those image files to a shoe company for use on a poster. It looked great in print and he got $1,200 for the temporary use of the file. (No, he did not sell the image outright for such a low price.) Sure, he could have shot raw, but if he did he would have missed the shot completely since he would have been out of memory giving him  no image at all instead of a great looking one.\n  Example 2: While everyone was in chat rooms yesterday I spent the day consulting on a shoot of a $7,000,000 home. We shot raw + JPG on a Canon 1Ds so my client would have both kinds of files from which to learn afterwards. It took a half hour to download the images from the 1 Gig flash card, a\n......", "posttime": "2021-07-30 10:34:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "jpg,raw", "title": "JPG vs. RAW：第一次做对（2009）", "title_en": "JPG vs. RAW: Get it right the first time (2009)", "transed": 1, "url": "https://www.kenrockwell.com/tech/raw.htm", "via": "", "real_tags": ["jpg", "raw"]}, {"category": "", "categoryclass": "", "imagename": "ac7de3d0bca852c8a7a2156d9ea553f9.jpg", "infoid": 1070562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用 Axios AM/PM 让您忙碌的日子变得更简单。在短短 5 分钟内了解新功能及其重要性。订阅 Axios Closer 以深入了解当天的商业新闻和趋势以及它们为何如此重要订阅 Axios Markets 以获取最新的市场趋势和经济见解。免费注册。通过 Axios Sports 尽情享受推动体育世界发展的统计数据和故事。免费注册。使用 Axios Login 从硅谷和 DC 获取我们对技术的明智看法。免费注册。通过 Axios Sneak Peek 获取新白宫的内幕指南。免费注册。通过 Axios Denver 获取影响您家乡的最重要故事的每日摘要\n通过 Axios Des Moines 获取影响您家乡的最重要故事的每日摘要 通过 Axios Twin Cities 获取影响您家乡的最重要故事的每日摘要 通过 Axios Tampa Bay 获取影响您家乡的最重要故事的每日摘要 获取与 Axios Charlotte 一起了解影响您家乡的最重要故事的每日摘要 及时了解由当地记者撰写的影响阿肯色州西北部的最重要和最有趣的故事 忘记家庭办公室 — 45% 的美国远程工作者经常在沙发上工作，根据家居装修营销公司 CraftJack 的一项研究，38% 的人经常在床上工作，20% 的人经常在外面工作。虽然一些工人已经能够花费数百甚至数千美元在家中建立工作站，但其他人却在大流行中挣扎。\n许多远程工作者，尤其是居住在城市的工作者，一直在与室友或家人共享的空间中工作，并且没有办公桌。虽然为远程工作人员配备装备的蓬勃发展的行业如雨后春笋般涌现，而且像 Dropbox 这样的科技公司也提供丰厚的 WFH 津贴，但大多数员工并没有那么幸运。根据数字：人们平均花费 268 美元来改善远程工作设置，但仍有 50% 的人表示在家工作的痛苦和不适足以让他们回到办公室。底线：Axios 的 Kia Kokalitcheva 指出，公司为远程工作人员提供津贴以购买符合人体工程学的椅子或办公桌是不够的。许多人根本就没有在家中分配用于办公室设置的空间，而且搬到更大的地方可能太昂贵了。方法：CraftJack 对 2021 年 6 月 16 日至 25 日期间完全或主要在家工作的 1,520 名美国人进行了调查。", "note_en": "Make your busy days simpler with Axios AM/PM. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to Axios Closer for insights into the day’s business news and trends and why they matter\n Subscribe to Axios Markets for the latest market trends and economic insights. Sign up for free.\n Binge on the stats and stories that drive the sports world with Axios Sports. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with Axios Des Moines\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with Axios Tampa Bay\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n   Forget the home office — 45% of American teleworkers regularly work from a couch, 38% regularly work from bed and 20% often work outside, according to  a study by the home improvement marketing firm CraftJack.\n  While some workers have been able to spend hundreds — or even thousands — of dollars setting up work stations in their homes, others have struggled through the pandemic.\n Many remote workers, especially those living in cities, have been working in shared spaces with roommates or family members and working without desks.\n While a thriving sector for  outfitting remote workers has sprung up, and tech companies like Dropbox are offering lavish WFH stipends, most employees aren&#39;t so lucky.\n By the numbers: People have spent an average of $268 trying to improve their remote work setups, but a whopping 50% still say the pain and discomfort of working from home is enough to send them back to the office.\n The bottom line: It&#39;s not enough for companies to provide stipends for teleworkers to buy ergonomic chairs or desks, Axios&#39; Kia Kokalitcheva notes. Many people simply do not have the space allocated inside their homes for an office setup, and it can be too expensive to move to a bigger place.\n Methodology: CraftJack surveyed 1,520 Americans who worked entirely or primarily from home between June 16 – 25, 2021.", "posttime": "2021-07-30 10:34:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,工作者,workers,axios", "title": "每日统计：38% 的远程工作者在床上工作", "title_en": "Stat of the day: 38% of remote workers work from bed", "transed": 1, "url": "https://www.axios.com/38-percent-remote-workers-work-bed-f8708125-a068-47ff-9519-bb7870011cd5.html", "via": "", "real_tags": ["远程工作", "工作者", "workers", "axios"]}, {"category": "", "categoryclass": "", "imagename": "d7ca370df31565a4d1deb63c5ad65506.jpg", "infoid": 1070561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们的 C 轮融资 2.05 亿美元，由 Vy Capital 领投，Google Ventures、DFJ Growth、Valor Equity Partners、Craft Ventures、Founders Fund 和 Gigafund 跟投。我们也很高兴地宣布，一批在具有战略意义的领域的领先高管和企业家也加入了这一轮，包括 Robert Nelson（ARCH Venture Partners 的联合创始人）、Blake Byers（Byers Capital）、Sam Altman（董事会主席）。 YC Group 和 OpenAI 首席执行官）、Fred Ehrsam（Paradigm 和 Coinbase 的联合创始人）和 Ken Howery（PayPal 和 Founders Fund 的联合创始人）。 Neuralink 在过去四年中一直在构建第一个用于患者治疗的高通道数脑机接口。我们的第一款产品 N1 Link 是一种 1024 通道设备，一旦植入，它就完全不可见，并通过无线连接传输数据。该设备的第一个迹象是通过允许用户以高带宽和自然的方式与他们的计算机或手机交互，帮助四肢瘫痪者重新获得数字自由。本轮融资将用于将 Neuralink 的第一个产品推向市场，并加速未来产品的研发。 Neuralink 由埃隆·马斯克 (Elon Musk) 创立，旨在在短期内帮助脑损伤患者，并在长期内降低人工智能对人类的风险。该公司的使命是开发治疗各种大脑相关疾病的脑机接口，最终目标是创建一个能够更紧密地连接生物和人工智能的全脑接口。", "note_en": "Our Series C funding round of $205 million, led by Vy Capital, with participation from Google Ventures, DFJ Growth, Valor Equity Partners, Craft Ventures, Founders Fund, and Gigafund.\n  We are also happy to share that a group of leading executives and entrepreneurs in areas of strategic importance are also joining the round, including Robert Nelson (Co-Founder of ARCH Venture Partners), Blake Byers (Byers Capital), Sam Altman (Chairman of YC Group and CEO of OpenAI), Fred Ehrsam (Co-founder of Paradigm and Coinbase) and Ken Howery (Co-Founder of PayPal and Founders Fund).\n  Neuralink has spent the last four years building the first high channel count brain machine interface intended for therapeutic use in patients. Our first product, the N1 Link, is a 1024 channel device that, once implanted, is completely invisible and transmits data via a wireless connection. The first indication this device is intended for is to help quadriplegics regain their digital freedom by allowing users to interact with their computers or phones in a high bandwidth and naturalistic way. The funds from the round will be used to take Neuralink’s first product to market and accelerate the research and development of future products.\n  Neuralink was founded by Elon Musk to help those with brain injuries in the near term and reduce AI risk to humanity in the long term. The company’s mission is to develop brain-machine interfaces that treat various brain related ailments, with the eventual goal of creating a whole brain interface capable of more closely connecting biological and artificial intelligence.", "posttime": "2021-07-30 10:34:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "融资,funding,人工智能", "title": "C轮融资公告", "title_en": "Series C funding round announcement", "transed": 1, "url": "https://neuralink.com/blog/series-c", "via": "", "real_tags": ["融资", "funding", "人工智能"]}, {"category": "", "categoryclass": "", "imagename": "a25e410ad3c69d97df37de267551bb03.jpeg", "infoid": 1070560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（彭博社）——Robinhood Markets Inc. 希望通过首次公开募股创造历史，现在它已经——出于错误的原因。在该公司的第一个交易日，这家支持模因股票革命的经纪人的股价比 IPO 价格下跌了 8.4%。根据彭博汇编的数据，这是有记录以来在筹集到与 Robinhood 一样多的现金的 51 家美国公司中最糟糕的首次亮相。它取代了另一家券商 MF Global Holdings Ltd. 的 2007 年首次公开募股，成为符合条件的公司中最糟糕的首次公开募股。 MF Global 首日下跌 8.2%。 Robinhood 以 38 美元的首次公开募股价格开盘。对于 Robinhood 规模及更大规模的 IPO，这是自 2019 年 5 月优步科技公司以来美国公司中最弱的开盘交易。优步首日收盘下跌 7.6%。", "note_en": "(Bloomberg) -- Robinhood Markets Inc. wanted to make history with its initial public offering, and now it has -- for the wrong reason.\n Shares in the broker behind the meme-stock revolution fell 8.4% below the IPO price in the company’s first trading session. That’s the worst debut on record among 51 U.S. firms that raised as much cash as Robinhood or more, according to data compiled by Bloomberg.\n It dethroned the 2007 IPO by another brokerage, MF Global Holdings Ltd., as the worst debut among qualifying firms. MF Global ended its first day down 8.2%.\n   Robinhood opened at the $38 initial public offering price. For an IPO of Robinhood’s size and larger, that’s the weakest opening trade since Uber Technologies Inc. in May of 2019 among U.S. firms. Uber finished its debut session down 7.6%.", "posttime": "2021-07-30 10:33:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "robinhood,worst", "title": "Robinhood 有史以来最糟糕的首次公开募股", "title_en": "Robinhood Has the Worst Debut Ever for IPO of Its Size", "transed": 1, "url": "https://finance.yahoo.com/news/robinhood-flirts-worst-debut-ever-172454124.html", "via": "", "real_tags": ["robinhood", "worst"]}, {"category": "", "categoryclass": "", "imagename": "c37fd4345be434b9d7bbb4819558bcfb.png", "infoid": 1070558, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "&lt;ruby&gt; HTML 元素表示在基础文本上方、下方或旁边呈现的小注释，通常用于显示东亚字符的发音。它也可以用于注释其他类型的文本，但这种用法不太常见。术语 ruby​​ 起源于排字机使用的一种度量单位，表示文本可以在新闻纸上打印同时保持清晰的最小尺寸。", "note_en": "The   &lt;ruby&gt;  HTML element represents small annotations that are rendered above, below, or next to base text, usually used for showing the pronunciation of East Asian characters. It can also be used for annotating other kinds of text, but this usage is less common.\n The term  ruby originated as  a unit of measurement used by typesetters, representing the smallest size that text can be printed on newsprint while remaining legible.", "posttime": "2021-07-30 10:30:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,html,表示", "title": "ruby - 文本上方注释的 HTML 元素", "title_en": "ruby - HTML element for annotations above the text", "transed": 1, "url": "https://developer.mozilla.org/en-US/docs/Web/HTML/Element/ruby", "via": "", "real_tags": ["ruby", "html", "表示"]}, {"category": "", "categoryclass": "", "imagename": "856570d7fd77e40e50ef18588bfbe0df.jpeg", "infoid": 1070557, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "On the Clock 是 Motherboard 对有组织的劳工运动、零工工作、自动化和工作的未来的报告。 7 月 31 日，外卖应用程序 DoorDash 的零工工人将拒绝在当天工作，这似乎是 DoorDash 历史上的第一次协同罢工。零工工人要求平台在他们同意交付订单之前向他们展示他们的技巧，并为每个订单制定至少 4.50 美元的基本工资。 （基本工资是司机在给小费之前的订单中赚取的金额。由于最近的减薪，许多司机在小费前的收入低至 2.00 美元）。 “没有 DASHER = 没有交付 = DOORDASH 的巨大损失，”关于在 Reddit 上流传的罢工的帖子说。罢工不隶属于任何组织，但最近几天 Reddit 和 Facebook 上的数百名 Dashers 讨论了罢工，并分发了一张图片和要求清单。主板收到了七名计划罢工的司机的消息，还有更多人表示他们将参加，因为他们已经看到基本工资下降，并希望在接受订单之前能够看到他们的小费。 “我很震惊，因为他们在这里将基本工资从 3 美元降低到 2.50 美元，而且随着汽油的增加，很难赚钱，”堪萨斯州欧弗兰帕克的一名司机告诉主板。 “没有小费，我们什么也做不了。” DoorDash 罢工的呼吁发生在特殊情况下。 7 月初，DoorDash 重新编写了自己的代码以关闭 Para，这是一个第三方应用程序，允许零工工人在接受送货订单之前查看他们的小费金额。 Para 由 Uber 的前运营和物流经理开发，它透露了包含在 DoorDash 代码中的小费信息，但并未向送货司机显示。\n司机会同时登录这两个应用程序，向 Para 提供他们的 DoorDash 登录凭据。当 DoorDash 向司机提供送货单时，来自 Para 应用程序的通知会下拉通知司机与该订单相关的小费金额。 （如果没有 Para，DoorDash 只会在司机完成交付前向他们显示他们的估计收入金额。）UberEats 也对司机隐藏了小费金额，但 Para 无法在他们的代码中找到小费金额。一夜之间，Para 应用炸了。根据一名 Para 员工提供的截图，截至 7 月 24 日，它已在苹果应用商店下载约 20 万次，在 Google Play 商店下载约 5 万次。 Para 目前在 App Store 中的商业应用程序中排名第 40。在数百条在线评论中，DoorDash 工作人员称赞 Para 允许他们访问他们的提示。 “我喜欢这个应用程序，”一位 Dasher 在 5 月份写道。 “它预先告诉你你会赚多少钱，所以它不需要在长途旅行中赌博。它帮助我赚了更多的钱，这太棒了。”但在 7 月中旬，帕拉停止了工作。 Bridgit 是新泽西州 Tom&#39;s Creek 的 DoorDash 司机，有三个孩子，她在 3 月份注册了 DoorDash，特别是因为她希望在使用 Para 应用程序接受订单之前能够看到她的小费金额。 “我阅读了一些论坛，每个人都在谈论 Para。”她告诉主板，由于失去了 Para 提供的提示透明度，她将在 7 月 31 日罢工。 “我会说，当帕拉停止工作时，很多工人都醒了，”她说。 “Para 表明 DoorDash 并不像它应有的那样透明。我认为 DoorDash 隐藏订单提示是荒谬的。没有提示是很常见的。”虽然一些司机在失去 Para 提供的小费透明度后被迫罢工，但其他司机主要是因为 DoorDash 的基本工资很低。根据 DoorDash 的说法，订单的基本工资范围从 2 美元到 20 美元不等，但司机们表示，工资通常较低。今年 2 月，DoorDash 司机发起了一场名为#DECLINENOW 的抗议活动，以玩弄 DoorDash 的算法，并通过拒绝低于 5 美元的订单来推高基本工资。 DoorDash 被指控盗窃小费、数据泄露、低于最低工资标准。 “DoorDash 很自豪能够为 Dashers 提供灵活、低门槛的创收机会，同时帮助餐厅发展业务。在全国范围内，Dashers 平均每周工作不到 4 小时，在送货时每小时收入超过 25 美元，包括 100% 的小费，”DoorDash 的一位女发言人在回应罢工消息时告诉 Motherboard。\n总体而言，零工经济因使用“黑盒算法”而臭名昭著，这些算法将有关工资、小费和订单的关键信息对零工工人隐藏，通常对工人不利。在 DoorDash 的当前模型下，工作人员无法知道订单是否附有 50 美分或 50 美元的小费，即使 DoorDash 在分配该订单时知道。司机们说这会造成困难，因为他们的收入大部分来自小费，而且他们经常被迫赌需要行驶 20 英里的订单会有值得的小费。司机说，在事先不知道小费的情况下接受订单可能会导致在考虑汽油成本后的负收益。许多客户实际上会给小费，或者根本不给小费。另一方面，DoorDash 司机还表示，Para 允许司机利用所谓的“独角兽”，订单的小费有时是基本工资的 300%。换句话说，司机可能会拒绝 15 美元的订单，因为他们希望得到 2 美元的小费，而没有意识到附加了 50 美元的小费。 “帕拉停止工作，这肯定影响了我罢工的决定，”德克萨斯州高地村/花丘的 DoorDash 司机米兰达·阿什利说。 “我认为 DoorDash 应该是 100% 透明的，所有的支出都应该是透明的，因为它直接影响我们是否会接受订单。当 DD 隐藏小费信息时，只会导致 Dashers 拒绝订单，客户等待时间更长，并且甚至可能是冷食。” DoorDash 的一位发言人告诉 Motherboard，Para 违反了其服务条款，但没有回答有关重写其代码的问题。 “Para 通过未经 DoorDash 平台授权抓取内容来收集其信息。这令人深感担忧，因为我们致力于保护我们市场和利益相关者各方的隐私和数据安全，”他们说。 DoorDash 的服务条款规定，“您将仅将软件和服务用于您自己的用途，不得直接或间接转售、许可或转让软件、服务或服务显示的内容给第三方。” “在几个月内，近 200,000 名 DoorDash 司机注册了 Para，以便在接受旅行之前了解他们的全部收入潜力，”Para 创始人 David Pickerell 和 Jeffrey Tang 在一份声明中告诉 Motherboard。 “DoorDash 所依赖的劳动力要求更高的透明度，以及决定他们从这些零工平台接受什么样的工作的自主权。我们希望 DoorDash 在这里做正确的事，并为司机提供工具他们需要就自己的工作和生计做出明智的决定。”\n科罗拉多州丹佛市的另一名 Para 员工和 DoorDash 司机史蒂夫约翰逊告诉主板，在 7 月中旬，DoorDash 重写了其软件，有效地删除了 Para。 Johnson 认为，作为独立承包商，DoorDash 的司机应该可以在每个订单中获得全额小费，并可以自由使用任何可用的工具来增加收入。 “我们试图让你有信息来决定是否接受订单，”Para 员工史蒂夫约翰逊说。 “这是我们作为独立承包商的权利。他们应该让我们完全透明。”约翰逊说，通过有效地删除 Para 并重写他们的代码，DoorDash 否认其零工工人享有公司宣传的独立承包商权利，从而自相矛盾。去年，DoorDash、优步、Lyft 和 Instacart 花费了 2.04 亿美元，以将他们的零工工人归类为加利福尼亚的独立承包商。零工经济中的罢工很难真正损害公司的底线，因为零工工人被社会孤立，分布在全国各地，无法组建工会。 Instacart 此前曾声称，由其工人于 2020 年 3 月发起的全国性罢工“完全没有影响”。一些 DoorDash 零工工人表示，他们将在周六的罢工中工作，因为他们认为罢工没有足够的工人支持来伤害 DoorDash。", "note_en": "On the Clock is Motherboard&#39;s reporting on the organized labor movement, gig work, automation, and the future of work.\n  On July 31, gig workers on the food delivery app DoorDash will refuse to work for the day in what appears to be the first coordinated strike in DoorDash history.\n  Gig workers are demanding that the platform show them their tips before they agree to deliver an order and institute a base pay of at least $4.50 per order. (Base pay is the amount drivers earn on an order before tips. Thanks to recent pay cuts, many drivers earn as little as $2.00 before tips).\n    &#34;NO DASHER = NO DELIVERIES = MASSIVE LOSS FOR DOORDASH,&#34;   a post about the strike circulating on Reddit says.\n  The strike isn&#39;t affiliated with any organization, but hundreds of Dashers on Reddit and Facebook have discussed the strike in recent days, and circulated   a graphic and   list of demands. Motherboard heard from seven drivers who plan to strike, and many more have stated they will participate because they&#39;ve seen their base pay drop and want to be able to see their tips before they accept orders.\n  &#34;I&#39;m striking because they lowered the base pay from $3 to $2.50 here, and with gas increases, it’s hard to make any money,&#34; a driver in Overland Park, Kansas told Motherboard. &#34;Without tips we’re not making anything.&#34;\n  The call for a DoorDash strike occurs under peculiar circumstances. In early July, DoorDash rewrote its own code to cut off Para, a third-party app that allowed gig workers to see their tip amounts before they accepted a delivery order. Developed by a former operations and logistics manager at Uber, Para revealed tip information that&#39;s included in DoorDash&#39;s code but is not surfaced for delivery drivers.\n    Drivers would log in to both apps at once, providing Para with their DoorDash login credentials. When DoorDash offered drivers a delivery order, a notification from the Para app would drop down informing drivers of the tip amount associated with that order. (Without Para, DoorDash only shows drivers the estimated amount on their earnings before they complete the delivery.) UberEats also hides the tip amount from drivers, but Para was unable to find tip amounts in their code.\n  Overnight, the Para app blew up. As of July 24, it has been downloaded roughly 200,000 times in Apple&#39;s App Store and 50,000 times in the Google Play store, according to a screenshot provided by a Para employee. Para currently sits at #40 among business apps in the App Store. In hundreds of reviews online, DoorDash gig workers praise Para for allowing them to access their tips.\n  &#34;I love this app,&#34; one Dasher wrote in May. &#34;It shows you up front how much you will be making so it takes the guesswork out of gambling on longer mileage trips. It&#39;s helped me make more money and it&#39;s amazing.&#34;\n  But in mid-July, Para stopped working. Bridgit, a DoorDash driver in Tom&#39;s Creek, New Jersey with three kids, signed up for DoorDash in March, specifically because she expected to be able to see her tip amount before accepting an order using the Para app. &#34;I read some forums and everyone was talking about Para.&#34;\n  She told Motherboard that she&#39;s striking on July 31 because of losing the tip transparency offered on Para. &#34;I would say a lot of workers woke up when Para stopped working,&#34; she said. &#34;Para showed that DoorDash is not as transparent as it could be. I think it&#39;s ridiculous that DoorDash hides tips for orders. It&#39;s very common to get no tips.&#34;\n    While some drivers are being propelled to strike after losing the tip transparency offered by Para, others are mostly motivated by DoorDash&#39;s poor base pay. Base pay ranges on orders ranges from $2 to $20, according to DoorDash, but drivers say pay is often on the lower end. In February,   DoorDash drivers launched a protest campaign called #DECLINENOW to game DoorDash&#39;s algorithm and push up base pay by declining orders under $5. DoorDash has been accused of   rampant tip theft,   data breaches,   sub-minimum wage pay.\n  “DoorDash is proud to provide flexible, low-barrier earning opportunities for Dashers while helping restaurants grow their businesses. On average nationally, Dashers work fewer than four hours a week and earn over $25 an hour while they’re on a delivery, including 100 percent of their tips,&#34; a spokeswoman from DoorDash told Motherboard, in response to news of the strike.\n    Across the board, the gig economy is notorious for using &#39;blackbox algorithms&#39; that keep crucial information about wages, tips, and orders hidden from gig workers, often to the disadvantage of workers. Under DoorDash&#39;s current model, workers have no way to know whether an order has 50 cents or a $50 tip attached, even though DoorDash is aware when it assigns that order.\n  Drivers say this creates hardship because the vast majority of their earnings come from tips, and they&#39;re often forced to gamble that orders that require driving 20 miles will have a worthwhile tip. Accepting an order without knowing the tip beforehand can result in negative earnings after accounting for the cost of gas, drivers say. Many customers literally tip pennies, or nothing at all.\n  On the other end of the spectrum, DoorDash drivers also say that Para allowed drivers to take advantage of so-called &#34;unicorns,&#34; orders with giant tips that are sometimes 300 percent of the base pay. In other words, a driver might decline a $15 dollar order because they expect a $2 tip, without realizing that there&#39;s a $50 tip attached.\n  &#34;Para stopped working, and that&#39;s definitely influenced my decision to strike,&#34; said Miranda Ashley, a DoorDash driver in Highland Village/Flower Mound, Texas. &#34;I believe DoorDash should be 100% transparent with the full payouts, as it directly affects whether or not we will accept an order. When DD hides tip information, it only causes Dashers to decline orders and customers to have much longer wait times, and possibly even cold food.&#34;\n    A spokesperson for DoorDash told Motherboard that Para violated its terms of service, but did not respond to a question about rewriting its code. &#34;Para collects its information by scraping content without authorization from the DoorDash platform. This is deeply concerning as we are committed to protecting the privacy and data security of every side of our marketplace and stakeholders,&#34; they said.\n  DoorDash&#39;s terms of service say, &#34;You will use the Software and Services only for your own use and will not directly or indirectly resell, license or transfer the Software, Services or content displayed by the Services to a third party.”\n  “In a matter of months, nearly 200,000 DoorDash drivers signed up for Para in order to understand their full earning potential before accepting trips,&#34; Para founders David Pickerell and Jeffrey Tang told Motherboard in a statement. &#34;The very people whose labor DoorDash depends on are demanding more transparency, as well as the autonomy to make decisions about what kind of work they accept from these gig platforms. We hope DoorDash will do the right thing here, and provide drivers with the tools they need to make informed decisions about their work and livelihoods.”\n  Steve Johnson, another Para employee and a DoorDash driver in Denver, Colorado, told Motherboard that in mid-July, DoorDash rewrote its software, effectively cutting out Para.\n  Johnson believes that as independent contractors, DoorDash&#39;s drivers should have access to full tip amounts with every order, and the freedom to use any tools at their disposal to increase their earnings. &#34;We were trying to make it so that you have the information to decide if you want to accept an order,&#34; Steve Johnson, the Para employee, said. &#34;That’s our right as independent contractors. They’re supposed to allow us full transparency.&#34;\n  Johnson says that by effectively cutting out Para and rewriting their code, DoorDash is contradicting itself by denying its gig workers the independent contractor rights that the company has advertised. Last year, DoorDash, Uber, Lyft, and Instacart   spent $204 million fighting to keep their gig workers classified as independent contractors in California.\n  It&#39;s hard for strikes in the gig economy to actually hurt a company&#39;s bottom line, because gig workers are socially isolated, spread out across the country, and cannot form unions. Instacart has previously claimed that a nationwide strike led by its workers in March 2020   had &#34;absolutely no impact.&#34; Some DoorDash gig workers say they&#39;ll be working through the strike on Saturday because they don&#39;t think the strike has enough buy-in from workers to harm DoorDash.", "posttime": "2021-07-30 09:52:37", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "deliveries,doordash", "title": "“没有 DASHER = 没有交付：”DoorDash 司机罢工以提高提示透明度", "title_en": "'NO DASHER = NO DELIVERIES:' DoorDash Drivers Strike for Tip Transparency", "transed": 1, "url": "https://www.vice.com/en/article/pkbvgz/no-dasher-no-deliveries-doordash-drivers-strike-for-tip-transparency", "via": "", "real_tags": ["doordash"]}]