[{"category": "", "categoryclass": "", "imagename": "4d8313b551d15a5a6230b722d13a47a0.jpg", "infoid": 1012703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果公司正在努力在其开发者生态系统中摒弃非包容性语言，推进一项始于今年6月召开的全球开发者大会(Worldwide Developers Conference)的倡议。\n周四，该公司在其开发人员门户的更新中宣布了这一变化，称将修改编码术语，以删除或取代Xcode、平台API、文档和开源项目中可能被视为种族主义的语言。\n6月份，随着最初的iOS14、iPadOS14、MacOS Big Sur、watchOS7和TVOS14测试版软件以及随附的文档首次出现变化。\nApple将实现更中性的语言，如&#34；允许列表&34；和&#34；拒绝列表。&#34；&#34；主&34；将取代Xcode 12的默认SCM分支中的&#34；主&34；，而不是引用&#34；白名单、&#34；主/从分支和其他可能不敏感的术语，而是实现更中性的语言，如&#34；允许列表&34；和&#34；拒绝列表。&#34；&#34；主&#34；将取代&#34；主&34；在Xcode 12中的默认SCM分支中的&#34；主&#34；将取代&#34；主&#34；中的&#34；主&34；现在，这个术语在指人时是大写的。\n我们敦促开发人员研究API的变化，并在各自的项目中加入新语言。\n苹果公司表示，随着我们在内部代码库、公共API和开源项目(如WebKit和Swift)中引入替代方案，带有排他性条款的开发人员API将被弃用。&#34；我们鼓励您密切监视代码库中的弃用警告，并主动转向平台SDK中提供的最新API。&#34；\n更新的术语和其他相关更改已添加到Apple Style Guide中。\n苹果的这一举措是在更广泛的推动下出台的，目的是摒弃计算机技术参考中的种族主义术语。这项努力已经进行了多年，但随着黑人生命也是命运动和围绕5月份乔治·弗洛伊德遇害的抗议活动的出现，这一努力变得更加紧迫。\nAppleInsider与会员有合作关系，通过会员链接购买的产品可能会赚取佣金。这些合作关系不会影响我们的编辑内容。", "note_en": "Apple is working to deprecate non-inclusive language in its developer ecosystem, forwarding an initiative that began at this year&#39;s Worldwide Developers Conference in June.\n  The company announced the change in an  update to its developer portal on Thursday, saying coding terminology will be modified to remove or replace language that could be perceived as racist from Xcode, platform APIs, documentation, and open source projects.\n Changes first rolled out with initial  iOS 14, iPadOS 14,  macOS Big Sur,  watchOS 7 and  tvOS 14 beta software and accompanying documentation in June.\n Instead of references to &#34;blacklist,&#34; &#34;whitelist,&#34; &#34;master branch,&#34; &#34;master/slave&#34; and other potentially insensitive terminology, Apple will implement more neutral language like &#34;allow list&#34; and &#34;deny list.&#34; &#34;Main&#34; will take the place of &#34;master&#34; in the default SCM branch in Xcode 12, the company said. The term &#34;Black&#34; is now capitalized when referring to people.\n Developers are urged to study the API changes and incorporate the new language in their respective projects.\n  &#34;Developer APIs with exclusionary terms will be deprecated as we introduce replacements across internal codebases, public APIs, and open source projects, such as WebKit and Swift,&#34; Apple said. &#34;We encourage you to closely monitor deprecation warnings across your codebases and to proactively move to the latest APIs available in the platform SDKs.&#34;\n The updated terminology and other relevant changes have been added to the  Apple Style Guide.\n Apple&#39;s initiative arrives amid a wider push to deprecate racist terminology from technical computer references. The effort has been ongoing for years but gained new urgency with the Black Lives Matter movement and protests surrounding the  killing of George Floyd in May.\n    AppleInsider has affiliate partnerships and may earn commission on products purchased through affiliate links. These partnerships do not influence our editorial content.", "posttime": "2020-07-18 15:55:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,apple,苹果,移除,remove", "title": "苹果将移除，取代代码库中的非包容性语言", "title_en": "Apple to remove, replace non-inclusive language in code base", "transed": 1, "url": "https://appleinsider.com/articles/20/07/17/apple-to-remove-replace-non-inclusive-language-in-code-base", "via": "", "real_tags": ["代码", "apple", "苹果", "移除", "remove"]}, {"category": "", "categoryclass": "", "imagename": "9d2fec9738fd5aaf0938c29888e56d6e.jpg", "infoid": 1012702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这部有史以来票房最高的电影背后的导演二人组将打破Netflix的另一项电影纪录。这一次，兄弟与复仇者联盟：终局电影制作人乔和安东尼·拉索(他还执导了《美国队长2：冬日士兵》、《美国队长2：内战》和《复仇者联盟：漫威的无限战争》)将前往Netflix观看这家流媒体服务公司迄今预算最高的电影，这看起来像是一部间谍电影，007将举起他搅拌而不是摇晃的玻璃杯。\n据Deadline报道，Netflix正在为改编自瑞安·高斯林(Ryan Gosling)和美国队长克里斯·埃文斯(Chris Evans)的《灰人》(The Gray Man)投入2亿美元以上的巨额预算。Netflix的计划是利用作者马克·格里尼(Mark Greaney)的间谍来源素材打造一个新的特许经营权--这将使Netflix的大预算投资转向与享有盛誉的马丁·斯科塞斯(Martin Scorsese)电影“爱尔兰人”不同的方向。格里尼还因在汤姆·克兰西(Tom Clancy)的杰克·瑞安(Jack Ryan)去世后接手这部系列而闻名。\n在乔与他经常与MCU合作的克里斯托弗·马库斯(Christopher Markus)和斯蒂芬·麦克菲利(Stephen McFeely)共同撰写的一部电影中，两位电影明星在一部电影中全力以赴，这部电影看起来利用了一种类似的氛围：电影中不可能发生的事情，或者被低估了。来自U.N.C.L.E.的人(间谍/刺客)和法院绅士(Ryan Gosling)正在被他的前中央情报局同事劳埃德·汉森(克里斯·埃文斯饰)追捕。预计会有大量的小玩意儿、双交叉和动作定位器。杰森·伯恩是谁？\n这部电影希望建立一个由高斯林主演的系列，它将采取与书籍相同的路线，从而开启了畅销系列的序幕。\n乔·罗素说，我们的想法是创建一个系列，打造一个以瑞安为中心的宇宙。“我们都致力于第一部电影，这一定很棒，才能让我们进入第二部电影。”这些都是刺客大师，高斯林饰演的人物被中央情报局烧死了，埃文斯饰演的人物不得不追捕他。\n在解释这部电影的试金石时，安东尼·鲁索解释说：“这部电影是这两位伟大演员之间的真正男子汉，他们代表了中情局的两个不同版本，它可以成为什么，它可以做什么。对于那些美国队长：冬日战士的粉丝来说，这是我们在更真实的世界背景下进入那个领域。“。\n提交您的信息，即表示您同意我们的隐私政策、条款和条件，并接受来自NBC环球的营销信息。", "note_en": "The directing duo behind the highest-grossing film of all time are set to break another movie record for Netflix. This time, brothers and  Avengers: Endgame filmmakers Joe and Anthony Russo (who also helmed  Captain America: The Winter Soldier,  Captain America: Civil War, and  Avengers: Infinity War for Marvel) are headed to Netflix for the streaming service&#39;s biggest-budgeted movie yet — and it looks to be a spy film that would have 007 raising his stirred-not-shaken glass.\n According to  Deadline, Netflix is putting a massive, $200M+ budget behind an adaptation of  The Gray Man starring Ryan Gosling and Captain America himself, Chris Evans. The plan is to make a new franchise out of the spycraft source material from author Mark Greaney — something that would take Netflix&#39;s big-budget investments in a different direction from the prestige-oriented Martin Scorsese film  The Irishman. Greaney is also known for taking over Tom Clancy&#39;s Jack Ryan series after the author&#39;s death.\n  With a pair of movie stars going full  Spy vs. Spy in a film co-written by Joe alongside his frequent MCU collaborators Christopher Markus and Stephen McFeely, the film looks to capitalize on a similar vibe as the  Mission: Impossible movies or underappreciated  The Man from U.N.C.L.E. Spy/assassin Court Gentry (Ryan Gosling) is being hunted by his old CIA co-worker Lloyd Hansen (Chris Evans). Expect plenty of gadgets, double-crosses, and action setpieces. Jason Bourne who?\n The movie looks to set up a series — starring Gosling — that&#39;ll take the same route as the books, which kicked off a bestselling franchise.\n The idea is to create a franchise and build out a whole universe, with Ryan at the center of it,&#34; Joe Russo said. &#34;We have all committed to the first movie and that’s got to be great to get us to the second movie. These are master assassins and Gosling’s characters gets burned by the CIA and Evans’ character has to hunt him down.&#34;\n Explaining the film&#39;s touchstones, Anthony Russo explained that, “The movie is a real mano a mano between those two great actors, who represent two different versions of the CIA, in what it can be, and what it can do. For those who were fans of  Captain America: Winter Soldier, this is us moving into that territory in more of a real world setting.”\n      By submitting your information, you agree to our  Privacy Policy,  Terms and Conditions and to receive marketing messages from NBCUniversal.", "posttime": "2020-07-18 15:15:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,bond,expensive", "title": "Netflix有史以来最昂贵的电影将是罗素兄弟(Russo Bros)出品的一部价值2亿美元的詹姆斯·邦德(James Bond)级别的惊悚片。", "title_en": "Netflix's Most Expensive Movie Ever Will Be a $200M James Bond-Level Thriller From the Russo Bros.", "transed": 1, "url": "https://www.syfy.com/syfywire/the-gray-man-netflix-expensive-movie-ever-russo-brothers", "via": "", "real_tags": ["电影", "bond", "expensive"]}, {"category": "", "categoryclass": "", "imagename": "9c326fbe1c0ec93e0f43e60618d54619.jpeg", "infoid": 1012701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，纽约警察局慈善中士协会主席埃德·穆林斯(Ed Mullins)通过远程视频出现在福克斯新闻(Fox News)上，身后放着一个印有极右翼阴谋论Qanon象征的马克杯。\n这并不是穆林斯第一次出现在宣传卡农阴谋的马克杯旁边，该阴谋声称世界是由意图推翻唐纳德·特朗普总统的撒旦式的虐待儿童的精英组成的阴谋统治的。同样的装饰伴随着穆林斯今年春天接受福克斯新闻(Fox News)的另外至少两次视频采访。\n穆林斯在与Business Insider的通话中拒绝透露这个杯子是不是他的，或者他是否支持QAnon的阴谋。\n穆林斯说：我们的国家正在分崩离析，纽约市正处于危机之中，新闻媒体唯一关心的就是一个马克杯。\n赫芬顿邮报记者克里斯托弗·马蒂亚斯在推特上写道，穆林斯周五告诉他，那个马克杯不是他的。\n近几个月来，穆林斯多次出现在福克斯电视台，讨论黑人生命也是抗议活动和警方的反应，并定期批评抗议者和纽约市市长白思豪(Bill De Blasio)。\n白思豪曾多次严厉谴责穆林斯，并坚称工会领导层只是在实行分裂，他们煽动仇恨。\n白思豪今年早些时候告诉记者，他们并没有试图帮助我们向前迈进。他们不会试图创造任何好东西。我不尊重小企业管理局的领导。\n起源于2017年的QAnon理论吸引了一批忠实的保守派追随者，几位美国众议院共和党候选人要么支持这一阴谋，要么表示支持。特朗普积极推广QAnon，在Twitter上分享了数十条QAnon相关账户的信息。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "Ed Mullins, president of the NYPD&#39;s Sergeants Benevolent Association, appeared on Fox News on Friday via remote video with a mug placed behind him emblazoned with the symbol of QAnon, a far-right conspiracy theory.\n This isn&#39;t the first time Mullins has appeared alongside the mug promoting the QAnon conspiracy, which claims the world is run by a Satanic cabal of child-abusing elites intent on ousting President Donald Trump. The same decor accompanied at least two other  video interviews Mullins did with Fox News this spring.\n Mullins refused to say whether the mug was his or whether he endorses the QAnon conspiracy in a call with Business Insider.\n &#34;Our country is falling apart, New York City is in crisis, and the only thing the news media is concerned about is a mug,&#34; Mullins said.\n    HuffPost reporter Christopher Mathias tweeted that Mullins told him on Friday that the mug wasn&#39;t his.\n   Mullins has repeatedly appeared on Fox in recent months to discuss the Black Lives Matter protests and the police response, and regularly criticize protesters and New York City Mayor Bill de Blasio.\n De Blasio has sharply condemned Mullins on multiple occasions and insisted the union leadership &#34;has only practiced division, they foment hatred.&#34;\n   &#34;They do not try to help us move forward,&#34; de Blasio told reporters earlier this year. &#34;They don&#39;t try to create anything good. I have no respect for the leadership of the SBA.&#34;\n The QAnon theory, which originated in 2017, has attracted a devoted conservative following and  several Republican candidates for the US House have either endorsed or voiced support for the conspiracy. Trump has actively promoted QAnon, sharing dozens of messages from QAnon-linked accounts on Twitter.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-18 15:13:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "qanon,sergeants,穆林斯", "title": "纽约警察局中士工会主席出现在福克斯新闻上，手持QAnon马克杯", "title_en": "NYPD sergeants union chief appeared on Fox News with a QAnon mug", "transed": 1, "url": "https://www.businessinsider.com/nypd-sergeants-union-chief-appeared-on-fox-news-with-a-qanon-mug-2020-7", "via": "", "real_tags": ["qanon", "sergeants", "穆林斯"]}, {"category": "", "categoryclass": "", "imagename": "0a5542a31fac8a1ec752ba97d272357a.png", "infoid": 1012699, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "详情请参考ChangelOG.md。", "note_en": "Please refer to  CHANGELOG.md for details.", "posttime": "2020-07-18 14:11:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "vue,参考", "title": "VUE v3.0.0-RC.1", "title_en": "Vue v3.0.0-RC.1", "transed": 1, "url": "https://github.com/vuejs/vue-next/releases/tag/v3.0.0-rc.1", "via": "", "real_tags": ["vue", "参考"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Adrian Page在2005年首次为Krita编写了一个基于OpenGL的Canvas实现。那是在QT3时代。OpenGL当时相当简单，但是我们必须复制我们所有的画布处理代码，一旦用OpenGL实现，一旦用QPainter实现，我们就必须复制所有的画布处理代码。\nKrita的画布代码分三个阶段执行。这里有图像投影，也就是合并所有图层的结果，这是首先绘制的。然后我们绘制画布装饰：即选择轮廓、向导、助手、参考图像等。然后我们绘制工具装饰：那就是轮廓光标、直线或标尺工具的线条等等。\n显然，实现这一切两次，一次是在OpenGL中，一次是使用QPainter，这并不理想。\n所以当Qt4出现的时候，我们都很高兴。Qt4附带了基于OpenGL的QPainter引擎。这很理想；我们可以拆分我们的画布代码。图像将使用纯OpenGL在QGLWidget上绘制，或者使用QPainter在QWidget上绘制，画布装饰和工具装饰将使用QPainter绘制在任一画布上。\nQt文档甚至附带了一个很好的示例，说明如何做到这一点。\n然而，Qt开发人员显然更多地将OpenGL QPainter引擎视为加快QWidget绘制速度的一种方式，而不是应用程序开发人员会使用的东西。而且OpenGL QPainter引擎永远无法完全正确地呈现复杂的应用程序。\n因此，在某个时候，引擎在MacOS上停止工作。主要是因为苹果公司不想让人们使用OpenGL，所以他们的驱动程序在开发中匮乏，但也因为Qt开发人员认为OpenGL QPainter引擎是一个失败的实验，因为它在绘制他们的小部件时没有提高性能：他们忘记了应用程序开发人员在他们的OpenGL应用程序中使用QPainter。甚至告诉他们不要这么做。尽管文件从未反映过这一观点。\n这很糟糕，因为我们需要它，2016年我们不得不花了一个夏天的代码槽来修复OpenGL QPainter引擎，这样它就可以在带有OpenGL 3.2核心配置文件的MacOS上运行。降落在Qt的飞机上。\n随着从Qt4迁移到Qt5，又发生了一些事情：Qt4QML基于QGraphicsView。我一直怀疑QGraphicsView是为需要地图软件的公司创建的，但在诺基亚时代，有几次尝试将QGraphicsView作为移动UI框架DUI的基础(我能找到的最好的链接；这里有严重的历史损失)。\n这些尝试都失败了，直到有人想出了QML，它最初也是用QGraphicsView呈现的。\n我们使用QML创建了Krita Sketch和Krita Gemini。因为它是基于QGraphicsView的，所以我们创建的触摸式UI可以与基于OpenGL的画布无缝协作。\nQt5问世时，QML是基于OpenGL和场景图的。我们花了几个月和相当多的钱试图将我们的OpenGL画布集成到新的场景图中，但就是不起作用。完全没有。它无法工作，Krita Sketch和Krita Gemini死了。\n(顺便说一句：将OpenGL代码从Qt4移植到Qt5比我们预期的要困难得多。事实上，这是一个巨大的麻烦。)。\nWindows上的OpenGL驱动程序的质量总是参差不齐，有时甚至非常糟糕。我们在开发Krita Sketch时就已经遇到过这种情况，当时我们突然有了很多Windows用户。\nAngel将OpenGL无缝转换为Direct3D。一旦Chrome使用了这一点，他们所有的崩溃都消失了。\nGPU制造商没有理由再修复他们的驱动程序，所以他们没有这么做。游戏将使用Direct3D，Chrome将使用Angel，很快Qt也增加了使用Angel的选项，因为否则Windows上基于QML的应用程序将不断崩溃。\n这对我们来说是个极好的消息。我们开始使用Angel，错误报告的数量大幅下降。当我们想在Windows上支持HDR屏幕时，我们已经使用了Angel这一事实是很棒的，因为这使我们能够使HDR工作，因为在Windows上，HDR只能在使用Direct3D渲染窗口时才能工作。\nHDR补丁还没有登陆Qt，所以我们随身携带了它们，还有很多其他补丁需要让Krita工作得很好。\n我们定期将这些补丁移植到较新版本的Qt5，但我们所有的Krita二进制版本都是使用Qt5.12构建的，因为从5.12开始的每个Qt版本都有太多错误，无法使用。例如：在5.15中，在子窗口模式下使用QMdiArea将在Windows上挂起。\n除了Krita Sketch仍然死了，我们正在移植到Android，移动UI应该很好，一切都很好。\n因为，显然，Qt的角度构建选项的存在只是为了确保QML应用程序可以在windows上运行，而不是为了任何目的，所以Qt6已经放弃了角度选项…。\n因为将会有一个新的框架，它将直接使用各种GPU API(Metal、Vulkan、Direct3D、OpenGL)，在它们上面有一个抽象层()，用于渲染QML场景图。不过，看起来这一切都是Qt内部的。\n确实很难找到文档，但看起来QPainter将使用这些模块进行渲染；但不清楚的是，当我们在QOpenGLWidget上使用QPainter时会发生什么。或者，我们是否必须实现一个Metal画布、一个Direct3画布和一个OpenGL画布？我们是否能够在Windows上访问HDR功能？", "note_en": "Adrian Page first  coded an OpenGL-based canvas implementation for Krita in  2005. That was back in the Qt3 days. OpenGL was fairly simple back then, but we had to duplicate all our canvas handling code, once implemented in OpenGL, once implemented with QPainter.\n Krita’s canvas code executes in three phases. There’s the image projection, that is, the result of combining all the layers, which is drawn first. Then we draw the canvas decorations: that’s the selection outline, the guides, the assistants, the reference images and so on. Then we draw the tool decorations: that’s the outline cursor, the line for the straight line or ruler tool and so on.\n Obviously, implementing all of that twice, once in  OpenGL, once with QPainter isn’t ideal.\n  So we were elated when Qt4 appeared. Qt4 came with an  OpenGL based QPainter engine. This was ideal; we could split up our canvas code. The image would be drawn with pure OpenGL on a QGLWidget or with QPainter on a QWidget, and the canvas decorations and tool decorations would be drawn with QPainter on either canvas.\n The Qt documentation even came with a  nice example showing how this was to be done.\n  However, the Qt developers apparently saw the OpenGL QPainter engine more as a way to speed up the drawing of QWidgets than something that application developers would use. And the OpenGL QPainter engine never was able to render a complex application completely correctly.\n So at some point, the engine stopped working on macOS. Mostly because Apple doesn’t want people to use OpenGL, so they’re starving their drivers from development, but also because the Qt developers  thought that the OpenGL QPainter engine was a failed experiment because it didn’t improve performance when painting their widgets: they had forgotten that applications developers are using QPainter in their OpenGL applications. Or even told them not to do that. Though the documentation never reflected  that opinion.\n That sucked, since we needed it, and in 2016 we had to spend  a Summer of Code slot on  fixing the OpenGL QPainter engine so it worked on macOS with OpenGL 3.2 Core Profile. That landed in Qt.\n  With the migration from Qt4 to Qt5 something else happened: Qt4 QML was based on QGraphicsView. I’ve always suspected that QGraphicsView was created for companies that needed mapping software, but in the Nokia days there were several attempts to use QGraphicsView as a basis for a mobile ui framework,  DUI (best link I could find; there’s serious loss of history here).\n Those attempts failed, until someone came up with QML, which initially was also rendered with QGraphicsView.\n We used QML to create  Krita Sketch and  Krita Gemini. Because it was based on QGraphicsView, the touch ui we created worked seamlessly with our OpenGL-based canvas.\n When Qt5 came out, QML was based on OpenGL and a scenegraph. We spent several months and quite a bit of money trying to integrate our OpenGL canvas in in the new scenegraph, but it just did not work. At all. It couldn’t be made to work, and Krita Sketch and Krita Gemini died.\n (As an aside: it was much harder than we had expected to port our OpenGL code from Qt4 to Qt5. It was a huge hassle, in fact.)\n   The quality of OpenGL drivers on Windows was always variable, sometimes even really bad. We had already encountered that when developing Krita Sketch, when we suddenly had a lot of Windows users.\n  Angle seamlessly translates OpenGL into Direct3D. And once Chrome used  that, all their crashes were gone.\n And the GPU manufacturers had  no reason all anymore to fix their drivers, so they didn’t. Games would use Direct3D, Chrome used Angle, and pretty soon Qt added an option to use Angle, too, because otherwise QML-based applications on Windows would keep crashing.\n This was  excellent news for us. We started using Angle, and the number of bug reports dropped a serious amount. And when we wanted to support HDR screens on Windows, the fact that we were using Angle already was great, because that enabled us to make HDR work, because on Windows, HDR can only be made to work when the window is rendered using Direct3D.\n The HDR patches still haven’t landed in Qt, so we are carrying them, along with a  lot of other patches that are needed to make Krita work well.\n We regularly port those patches to newer versions of Qt5, but we make all our Krita binary builds with Qt 5.12, because every version of Qt since 5.12 has been too buggy to use. For example: with 5.15, using a QMdiArea in subwindow mode will hang on Windows.\n Except for the fact that Krita Sketch was still dead, and we were  porting to Android, and a mobile UI would have been nice, everything was fine.\n  Because, obviously, Qt’s Angle build option only  existed to make sure that QML apps would work on Windows, not for anything, Qt6 has dropped the Angle option…\n Because there’s going to be a  new framework which will use the various GPU API’s (Metal, Vulkan, Direct3D, OpenGL) directly with a abstraction layer ( ) above them that will be used to render the QML scenegraph. It looks like that’s all internal to Qt, though.\n It’s really hard to find documentation, but it looks like QPainter will render using those modules; but what isn’t clear is what will happen when we’re going to use QPainter on a QOpenGLWidget. Or would we have to implement a Metal canvas, a Direct3 canvas, and an OpenGL canvas? And will we be able to access the HDR functionality on Windows?", "posttime": "2020-07-18 12:24:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "opengl", "title": "Krita、OpenGL和Qt", "title_en": "Krita, OpenGL and Qt", "transed": 1, "url": "https://valdyas.org/fading/hacking/krita-hacking/krita-opengl-and-qt/", "via": "", "real_tags": ["opengl"]}, {"category": "", "categoryclass": "", "imagename": "3e033333c95b5542fe37ade2c66715b5.jpg", "infoid": 1012693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2009年9月，我写了“医疗改革”。基本上，政府将把花在医疗保险和医疗补助上的数万亿美元投入到为每个美国人购买相当好的医保政策上。\n每位居民将获得一张可以在他或她选择的诊所或医疗保健机构签约的代金券；代金券的金额将取决于居民的年龄和性别(所有代金券的加权平均值将等于2000美元或我们决定花费的任何金额)。\n希望从联邦政府获得任何收入的诊所或保健组织将被要求接受任何提交凭单的人，而不考虑预先存在的条件。\n美国居民可以每年更换诊所，比方说5月1日。\n诊所负责支付居民在另一机构的紧急医疗费用。\n这项改革的一个可能的副作用是回到初级保健医生的中心地位。乔·联邦医疗保险患者通常没有任何医生来协调他的治疗，更不用说协调他的治疗了。如果乔看过六位专家，他可能在服用交叉用途的药物。如果乔在一家典型的医院的ICU里，治疗他的多名医生可能永远不会相互交谈。每个人都知道他或她已经安排了什么检查和程序，但除了看病人的病历外，他们不知道其他医生在调查什么。一位看过这份提案的初级保健医生说：“我在我的办公室里与新患者讨论的第一件事就是尽可能多地让他们停药；当一个70岁的老人正在服用11种药物时，你最好相信会有很多意想不到的相互作用。”\n最重要的是，美国人希望华盛顿的伟大父亲爱他们。“特朗普和赫伯特·胡佛一样，是‘不在乎的人’。”拜登可以让这一点站稳脚跟。“。(《今日美国》，6月28日)：\n最重要的是，特朗普是那个不在乎的人。他没有感受到你的痛苦。他不哀悼死者，不安慰悲痛的人，也不支持挣扎的人。他不考虑他的话，也不担心他们可能会产生后果。他不听取专家的意见，也不考虑自己的选择。\n国会本届会议的“工作”已接近尾声。如果共和党想要在11月获胜，为什么不让美国人感受到他们被爱和被照顾的感觉呢？我们不再在乎钱了，对吧？我们乐于花费我们积累的财富的100%来躲避冠状瘟疫，如果这是略微减少死亡人数所需的话。我们很乐意印制和借阅数万亿美元。一项针对每个美国居民的全民医保政策不需要比目前的医疗补助和医疗保险的出血量再加上雇主为中档保险支付的任何费用更高。\n除了业内人士，还会有人怀念当前的系统吗？以下是最近的几条新闻：\n“德克萨斯州的两位朋友接受了冠状病毒检测。一张钞票是199美元。另一个呢？6408美元。“。(纽约时报)指出，医院乐于为支付现金的客户提供199美元的服务，实际价格(通过保险)为1128美元。\n“从冠状病毒中幸存下来的110万美元的医院账单？这就是你的美国“(卫报)，它指出，实际上病人不会支付任何费用，因为医疗保险将支付一些商定的金额。\n至少从我在脸书上的帖子判断，美国人相信，尽管新冠肺炎缺乏任何有效的治疗方法，尽管没有保险的人为新冠肺炎治疗时由联邦政府买单，但全民医疗保险将极大地减少新冠肺炎的死亡人数。\n读者：您怎么看？特朗普和共和党人能否通过一次大规模的医保分发，让民主党人的风向大部分停滞不前？(当然，这方面的所有资金都将来自纳税人自己，但不知何故，美国人似乎从未考虑过，他们最终将不得不为政府“给予”他们的一切而工作。)。\n2019年9月，医疗补助和医疗保险在阿拉斯加州诺姆建造的房屋的额外照片。这一座建筑的价值很可能超过了这座城市的所有其他房屋和商业地产。", "note_en": "In September 2009, I wrote  “Health Care Reform”. Essentially the government would take the $trillions being spent on Medicare and Medicaid and put it into buying every American a reasonably good HMO policy.\n each resident will be given a voucher good for signing up at the clinic or HMO of his or her choice; the amount of the voucher will depend on the resident’s age and sex (the weighted average of all vouchers will equal $2,000 or whatever we’ve decided we want to spend)\n a clinic or HMO that wishes to get any revenue from the federal government will be required to take any person who submits a voucher, regardless of preexisting conditions\n a resident of the U.S. can switch clinics annually, let’s say on May 1.\n the clinic is responsible to pay for the resident’s emergency medical care at another facility\n  One likely side effect of this reform is the return to centrality of the primary care physician. Joe Medicare Patient often does not have any doctor who understands much less coordinates his care. If Joe has seen six specialists, he may be on drugs that are working at cross purposes. If Joe is in the ICU at a typical hospital, the multiple doctors treating him may never talk to each other. Each one knows what tests and procedures he or she has ordered, but, except by looking at the patient’s chart, has no idea what the other doctors are investigating. One primary care doctor who reviewed this proposal said “The first item I address with new patients in my office is to try to get them off as many drugs as possible; when a 70-year-old is on 11 meds you better believe there are many unintended interactions.”\n  Americans want, most of all, for the Great Father in Washington to love them.  “Trump, like Herbert Hoover, is ‘the man who doesn’t care.’ Biden can make that stick.” ( USA Today, June 28):\n Most of all, Trump is the man who doesn’t care. He doesn’t feel your pain. He doesn’t mourn the dead, comfort the grieving, or support the struggling. He doesn’t consider his words or worry that they could have consequences. He doesn’t listen to experts or ponder his options.\n Congress is almost finished with its “work” for this session. If the Republicans want to win in November, why not make Americans feel that the they are loved and cared for? We don’t care about money anymore, right? We are happy to spend 100 percent of our accumulated wealth hiding from coronaplague if that is what it takes to cut the death toll slightly. We are happy to print and borrow trillions. A universal HMO policy for every resident of the U.S. wouldn’t have to cost any more than the current bleeding for Medicaid and Medicare plus whatever employers pay for mid-range coverage.\n Will anyone, other than folks in the industry, miss the current system? A couple of recent news items:\n “Two Friends in Texas Were Tested for Coronavirus. One Bill Was $199. The Other? $6,408.” (NYT), which notes that the real price (through insurance) was $1,128, for a service that the hospital was happy to do for $199 for customers paying cash\n “A $1.1m hospital bill after surviving the coronavirus? That’s America for you” ( Guardian) which notes that actually the patient won’t pay anything because Medicare will pay some negotiated amount.\n At least to judge by my Facebook feed, Americans are convinced that, despite the lack of any effective therapy for Covid-19 and despite the fact that the Feds pick up the tab when the uninsured are treated for Covid-19, universal health insurance would hugely cut the number of Covid-19 deaths.\n Readers: What do you think? Could Trump and the Republicans take most of the wind out of the Democrats’ sails with one big health care hand-out? (of course, all of the money for this would just come from taxpayers themselves, but somehow Americans never seem to consider that they will ultimately have to work for whatever the government “gives’ them)\n Bonus pictures of the house that Medicaid and Medicare built, in Nome, Alaska, from September 2019. This single building is likely worth more than all of the rest of the houses and commercial real estate in the city.", "posttime": "2020-07-18 12:22:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全民,greenspun,医疗保险", "title": "菲利普·格林斯潘-共和党人可以在11月赢得全民医疗保险吗？", "title_en": "Philip Greenspun – Republicans could win in Nov with universal health insurance?", "transed": 1, "url": "https://philip.greenspun.com/blog/2020/07/16/republicans-could-win-in-november-if-they-gave-americans-universal-health-insurance/", "via": "", "real_tags": ["全民", "greenspun", "医疗保险"]}, {"category": "", "categoryclass": "", "imagename": "f817420bb78c2a27695897ec59c0dfd6.png", "infoid": 1012692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为我们的公民自由而战的最新进展。", "note_en": "The latest in the fight for our civil liberties.", "posttime": "2020-07-18 12:01:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,公民自由,suing", "title": "美国公民自由联盟起诉联邦调查局秘密追踪我们的面孔。", "title_en": "The ACLU is Suing The FBI for Tracking Our Faces in Secret.", "transed": 1, "url": "https://www.aclu.org/news/privacy-technology/the-fbi-is-tracking-our-faces-in-secret-were-suing/", "via": "", "real_tags": ["美国", "公民自由", "suing"]}, {"category": "", "categoryclass": "", "imagename": "8a7cb5f7b87366114bf89891122a4e82.jpg", "infoid": 1012691, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，前总统候选人安德鲁·杨(Andrew Yang)启动了一项名为数据红利项目的新倡议，将迫使社交媒体公司为使用其数据的用户提供补偿。正如杨告诉The Verge，“人们通过DDP for All获得股息的第一天将是如此伟大的一天。”但第二天，随着平台用户和广告商适应新的成本，肯定会一团糟。\n杨并不是唯一一个呼吁社交媒体用户分享平台收入的人。2019年，加利福尼亚州州长加文·纽瑟姆(Gavin Newsom)也呼吁创造数字红利。“加州的消费者也应该能够分享从他们的数据中创造的财富，”他说。两年前，也就是2017年，明尼苏达州议会提出了一项法案，该法案将迫使电信和互联网服务提供商向使用从互联网获得的信息的消费者付费。参议院银行委员会(Senate Banking Committee)也在玩弄一些计划，迫使公司向平台用户支付费用。这些努力肯定会失败，原因有三个。\n威尔·莱因哈特(@WillRinehart)是增长与机会中心(Center For Growth And Opportunity)和犹他州州立大学(Utah State University)的高级研究员。(增长与机会中心收到了包括Facebook在内的多家公司提供的一般运营支持捐款。)。\n首先，杨大大低估了评估数据的难度。DDP的目标是在消费者隐私法的成功基础上建立数字红利。(CCPA于7月1日生效，为加州人提供基线隐私保护。)。但加利福尼亚州已经围绕这项法律制定了规则。它列出了七种可能的计算数据价值的方法，以及“任何其他实用和可靠的计算方法”的总括。在实践中，每种方法产生的估值都大相径庭，其中一种方法将账户定价为140美元，另一种方法的估值为零点几美分。公司会立即选择成本最低的选项，从而违背支付股息的目的。\n其次，很明显，杨致远的数字红利(他说是“大约20美元、50美元或100美元”)太高了。减去商业成本后，Facebook用户的平均净收入仅为7美元左右。迫使Facebook每年向其美国用户发送20美元的支票，将蒸发约四分之一的全球利润，并重新安排整个业务。Facebook将不得不在整个公司范围内大幅裁员，包括已经四面楚歌的内容审核和客户服务团队。\n第三，也是最重要的一点，杨想迫使Facebook和其他公司成为现金支付的商业模式，这将是死刑。这个想法已经尝试了无数次，但都没有成功。在20世纪90年代末，付费冲浪业务模式似乎是下一步要做的事情，但在互联网崩盘迫使每个人的底线都变得清醒之后，AllAdvantage和它的同行理所当然地被一扫而空。近年来，握手和Datacoup等公司都尝试了这种模式，但它们也步履蹒跚。虽然这个想法有追随者，但没有一位企业家成功地将其付诸实施。\n部分问题在于“自由”和“价值”的语言。虽然像Facebook这样的服务可能不涉及现金，但用户可以自由地放弃浏览服务的时间。将在该平台上花费的所有工资时间加在一起表明，美国消费者每年使用该网站已经看到了近1万亿美元的价值。\n杨致远希望改变这种价值主张，并确保这些公司“不再能够通过囤积从你的数据中获得的收益而逍遥法外”。但消费者已经通过完全注销或减少在网站上的停留时间来做到这一点。自从“剑桥分析”事件曝光以来，大约有1500万人离开了Facebook，那些留在Facebook上的人每天在该网站上的时间减少了4分钟。换句话说，消费者已经收回了近2000亿美元的时间。\n数字红利乍看起来很聪明，但在考虑实施时就变得不那么有吸引力了。将在线体验的隐性好处转化为显性的现金支付，在现实世界中很难维持。最终，强加数字红利肯定会导致成功公司的壮观失败。\n《连线观点》发表外部撰稿人的文章，代表了广泛的观点。点击此处阅读更多观点。提交一篇专栏文章，电子邮件地址为：tOptions@wired.com。\n5G本来是要团结世界的，但它却把我们撕裂了。\n治疗师👁加入了--这是一款聊天机器人应用程序。另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Last month, former presidential hopeful Andrew Yang launched a new initiative called the  Data Dividend Project that would force social media companies to compensate users for the use of their data. As Yang  told the Verge, “That first day that people get paid their dividend through DDP for All is going to be such a great day.” But the second day, as platform users and advertisers adjust to the new costs, is sure to be a mess.\n Yang isn’t the only one calling for social media users to share in platform revenues. In 2019,  California governor Gavin Newsom also called for creating a digital dividend. “California’s consumers should also be able to share in the wealth that is created from their data,” he said. Two years earlier, in 2017, the Minnesota State Legislature introduced  a bill that would force telecom and internet service providers to pay consumers for using their information obtained from the internet. The Senate Banking Committee has also toyed with schemes that would force companies to pay platform users. These efforts are sure to fail for three reasons.\n Will Rinehart ( @WillRinehart) is a senior research fellow for the Center for Growth and Opportunity and Utah State University. (The Center for Growth and Opportunity receives contributions for general operational support from a number of corporations, including Facebook.)\n  First, Yang vastly underestimates the difficulty in valuing data. DDP aims to build off the successes of the Consumer Privacy Act to establish a digital dividend. (The CCPA went into effect July 1 and provides Californians baseline privacy protections.) But the state of California has already made rules around this law. It lists  seven possible methods to calculate the value of data as well as a catchall for “any other practical and reliable method of calculation.” Each method yields widely different valuations in practice, one of them would price accounts at $140, another at   fractions of a cent. Companies would immediately select into the lowest cost option, defeating the purpose of a dividend payment.\n Second, it is clear that Yang’s digital dividend, which he says would be “something like $20, $50, or $100,” is far too steep. After subtracting business costs, the average Facebook user only nets  about $7 in income. Forcing Facebook to send out checks of $20 each year to its US users would evaporate about a quarter of the global bottom line and rearrange the entire business. Facebook would have to make deep cuts across the company, including the already beleaguered content moderation and customer service teams.\n Third and most importantly, Yang wants to force Facebook and other firms to become cash payment business models, which would be a death sentence. The idea has been tried countless times with no success. In the late 1990s, the pay-to-surf business model seemed to be the next thing, but AllAdvantage and its peers were rightly swept away after the dotcom crash forced sobriety on everyone’s bottom line. Firms like  Handshake and Datacoup have tried the model in recent years, and they too have faltered. While the idea has acolytes, no entrepreneur has made it successfully work.\n  Part of the problem rests in the language of “free” and “value.” While services like Facebook might not involve cash, users freely give up their time to browse the service. Tallying up all of the wage time spent on the platform suggests that US consumers already see nearly $1 trillion in value every year in using the site.\n Yang wants to shift the value proposition and ensure these companies “will no longer be able to get away with hoarding the gains made off your data.” But consumers have already done that by logging off entirely or spending less time on the site. Since the Cambridge Analytica story broke,  roughly 15 million people have left Facebook, and those that have stayed on spend four fewer minutes per day on the site. In other words, consumers have taken back nearly $200 billion of their time.\n Digital dividends seem clever at first, but become far less appealing when thinking through implementation. Converting the implicit benefit of an online experience into an explicit cash payment is a difficult model to sustain in the real world. In the end, foisting a digital dividend is sure to create spectacular failures of successful companies.\n  WIRED Opinion  publishes articles by outside contributors representing a wide range of viewpoints. Read more opinions  here. Submit an op-ed at  opinion@wired.com.\n   5G was going to unite the world— instead it’s tearing us apart\n   👁 The therapist is in— and it&#39;s a chatbot app. Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-07-18 12:00:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数据,data", "title": "安德鲁·杨的数据红利项目将迫使社交媒体公司补偿用户，但该计划低估了数据估值的难度", "title_en": "Andrew Yang's Data Dividend Project would force social media companies to compensate users, but the plan underestimates difficulty of valuing data", "transed": 1, "url": "https://www.wired.com/story/opinion-andrew-yangs-plan-to-pay-you-for-your-data-doesnt-add-up", "via": "", "real_tags": ["数据", "data"]}, {"category": "", "categoryclass": "", "imagename": "e6fe1ec9c0a354f43e60cfce2b37f719.jpg", "infoid": 1012690, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如我们通过@TwitterSupport账户通知我们的那样，2020年7月15日，星期三，我们在Twitter上检测到一起安全事件，并立即采取了行动。在我们即将进入周末之际，我们想要概述一下我们所处的位置。\n在这篇文章中，我们总结了太平洋时间7月17日晚上8点35分的情况。以下信息是我们到目前为止所知道的，随着我们的调查和外部调查的继续，这些信息可能会发生变化。此外，随着对这起事件的调查正在展开，我们目前没有提供一些细节-特别是关于补救的细节-来保护工作的安全。我们将在将来可能的情况下提供更多细节，以便社会和我们的同龄人能够从所发生的事情中吸取教训并从中受益。\n目前，我们认为攻击者通过一个社会工程计划瞄准了某些Twitter员工。这是什么意思？在此背景下，社会工程是故意操纵人们进行某些行为并泄露机密信息。\n攻击者成功操纵了少数员工，并使用他们的凭证访问了Twitter的内部系统，包括通过了我们的双因素保护。到目前为止，我们知道他们访问的工具只有我们的内部支持团队才能使用，目标是130个Twitter账户。对于这些账户中的45个，攻击者能够启动密码重置，登录到该账户，并发送Tweet。我们正在继续对所有账户进行法医审查，以确认可能已经采取的所有行动。此外，我们认为他们可能试图出售一些用户名。\n对于多达8个涉及的Twitter账户，攻击者采取了额外的步骤，通过我们的“您的Twitter数据”工具下载了账户信息。这是一个旨在向帐户所有者提供其Twitter帐户详细信息和活动摘要的工具。我们正在直接联系任何我们知道这是真的账户所有者。\n我们在周三意识到了攻击者的行动，并迅速采取行动锁定并重新控制了被泄露的账户。我们的事件响应团队保护并撤销了对内部系统的访问权限，以防止攻击者进一步访问我们的系统或个人帐户。如上所述，我们目前故意限制我们分享的补救步骤的细节，以保护其有效性，并将在未来可能的情况下提供更多技术细节。\n除了我们在幕后的努力外，在我们意识到正在进行的情况后不久，我们采取了先发制人的措施，限制了许多Twitter账户的功能-包括阻止他们发布推文或更改密码。我们这样做是为了防止攻击者进一步传播他们的骗局，也是为了防止他们在我们调查期间能够控制任何额外的账户。出于高度谨慎，我们还锁定了最近更改密码的帐户。周三晚些时候，我们向许多账户恢复了推文功能，截至今天，我们已经恢复了大部分被锁定的账户，等待所有者更改密码。\n我们正在继续调查这起事件，与执法部门合作，并确定我们应该采取的长期行动，以提高我们系统的安全性。我们有多个团队日以继夜地工作，专注于保护使用Twitter的人的安全和知情。\n对于使用Twitter的人来说，最重要的问题可能是-攻击者看到我的任何私人信息了吗？对于绝大多数人来说，我们相信答案是否定的。对于被锁定的130个账户，以下是我们截至目前所知的情况。\n攻击者无法查看以前的帐户密码，因为这些密码不是以纯文本存储的，也不是通过攻击中使用的工具提供的。\n攻击者能够查看个人信息，包括电子邮件地址和电话号码，这些信息会显示给我们内部支持工具的一些用户。\n在帐户被攻击者接管的情况下，他们可能已经能够查看其他信息。我们对这些活动的法医调查仍在进行中。\n在进入周末和下周之际，我们将重点关注以下核心目标：\n恢复所有帐户所有者的访问权限，这些帐户所有者可能仍因我们的补救工作而被锁定。\n在全公司范围内开展额外的培训，以防范社会工程策略，以补充员工在入职和全年持续的网络钓鱼练习中接受的培训。\n通过这一切，我们也开始了与使用和依赖Twitter的人重建信任的长期工作。\n我们敏锐地意识到我们对使用我们服务的人和更广泛的社会负有责任。我们很尴尬，很失望，最重要的是，我们很抱歉。我们知道，我们必须努力重新获得你们的信任，我们将支持将肇事者绳之以法的一切努力。我们希望我们在整个过程中的公开性和透明度，以及我们将采取的步骤和工作，以防止未来发生其他攻击，将成为纠正这一错误的开始。", "note_en": "As we’ve been informing via the  @TwitterSupport account, on Wednesday, July 15, 2020, we detected a security incident at Twitter and took immediate action. As we head into the weekend, we want to provide an overview of where we are.\n  In this post we summarize the situation as of July 17 at 8:35p Pacific Time. The following information is what we know as of today and may change as our investigation and outside investigations continue. Additionally, as the investigation of this incident is unfolding, there are some details — particularly around remediation — that we are not providing right now to protect the security of the effort. We will provide more details, where possible in the future, so that the community and our peers may learn and benefit from what happened.\n    At this time, we believe attackers targeted certain Twitter employees through a social engineering scheme. What does this mean? In this context, social engineering is the intentional manipulation of people into performing certain actions and divulging confidential information.\n  The attackers successfully manipulated a small number of employees and used their credentials to access Twitter’s internal systems, including getting through our two-factor protections. As of now, we know that they accessed tools only available to our internal support teams to target 130 Twitter accounts. For 45 of those accounts, the attackers were able to initiate a password reset, login to the account, and send Tweets. We are continuing our forensic review of all of the accounts to confirm all actions that may have been taken. In addition, we believe they may have attempted to sell some of the usernames.\n  For up to eight of the Twitter accounts involved, the attackers took the additional step of downloading the account’s information through our “ Your Twitter Data” tool. This is a tool that is meant to provide an account owner with a summary of their Twitter account details and activity. We are reaching out directly to any account owner where we know this to be true.\n    We became aware of the attackers’ action on Wednesday, and moved quickly to lock down and regain control of the compromised accounts. Our incident response team secured and revoked access to internal systems to prevent the attackers from further accessing our systems or the individual accounts. As mentioned above, we are deliberately limiting the detail we share on our remediation steps at this time to protect their effectiveness and will provide more technical details, where possible, in the future.\n  In addition to our efforts behind the scenes, shortly after we became aware of the ongoing situation, we took preemptive measures to restrict functionality for many accounts on Twitter - this included things like preventing them from Tweeting or changing passwords. We did this to prevent the attackers from further spreading their scam as well as to prevent them from being able to take control of any additional accounts while we were investigating. We also locked accounts where a password had been recently changed out of an abundance of caution. Late on Wednesday, we were able to return Tweeting functionality to many accounts, and as of today, have restored most of the accounts that were locked pending password changes for their owners.\n  We are continuing our investigation of this incident, working with law enforcement, and determining longer-term actions we should take to improve the security of our systems. We have multiple teams working around the clock focused on this and on keeping the people who use Twitter safe and informed.\n    The most important question for people who use Twitter is likely — did the attackers see any of my private information? For the vast majority of people, we believe the answer is, no. For the 130 accounts that were targeted, here is what we know as of today.\n  Attackers were not able to view previous account passwords, as those are not stored in plain text or available through the tools used in the attack.\n  Attackers were able to view personal information including email addresses and phone numbers, which are displayed to some users of our internal support tools.\n  In cases where an account was taken over by the attacker, they may have been able to view additional information. Our forensic investigation of these activities is still ongoing.\n      As we head into the weekend and next week, we are focused on these core objectives:\n  Restoring access for all account owners who may still be locked out as a result of our remediation efforts.\n      Rolling out additional company-wide training to guard against social engineering tactics to supplement the training employees receive during onboarding and ongoing phishing exercises throughout the year.\n  Through all of this, we also begin the long work of rebuilding trust with the people who use and depend on Twitter.\n  We’re acutely aware of our responsibilities to the people who use our service and to society more generally. We’re embarrassed, we’re disappointed, and more than anything, we’re sorry. We know that we must work to regain your trust, and we will support all efforts to bring the perpetrators to justice. We hope that our openness and transparency throughout this process, and the steps and work we will take to safeguard against other attacks in the future, will be the start of making this right.", "posttime": "2020-07-18 11:59:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "安全事件,security,账户", "title": "关于我们安全事件的最新消息", "title_en": "An update on our security incident", "transed": 1, "url": "https://blog.twitter.com/en_us/topics/company/2020/an-update-on-our-security-incident.html", "via": "", "real_tags": ["安全事件", "security", "账户"]}, {"category": "", "categoryclass": "", "imagename": "1e86591019fc08df4668b7c1eb5533a6.jpg", "infoid": 1012689, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前ICANN首席执行官现在是试图收购.org的私募股权公司的联席首席执行官。\nICANN前首席执行官法迪·切哈德(Fadi Chehadé)目前在该公司网站上被列为ethos Capital的联席首席执行官。\nEthos Capital试图收购运营.org域名的非营利性组织Public Interest Registry，但ICANN否认了这笔交易。\n当ethos宣布与.org进行交易时，切哈德的名字并没有出现在该公司的网站上。他的参与很快就公之于众了，因为WHOIS关于ethos Capital的一个域名的数据。这家私募股权公司承认，契哈德是这笔交易的顾问。\n几个月来，ethos Capital网站只列出了两名员工：首席执行官埃里克·布鲁克斯(Erik Brooks)和首席目的官诺拉·阿布西塔-乌里(Nora Abusitta-Ouri)。Abusitta-Ouri在ICANN与契哈德共事。\n将切哈德列为联席首席执行官的网站变更似乎发生在最近。6月15日最后一次捕获的Wayback Machine没有显示他。埃利奥特·西尔弗今天发现了其中的不同之处。\n许多行业观察人士可能会想，契哈德是否一直被认为是联席首席执行官，只是为了避免更多争议而从网站上省略了这一点。\nEthos的网站现在列出了八名员工，其中三名是前ICANN员工。艾伦·格罗根(Allen Grogan)是执行合伙人，曾任ICANN首席合同合规官。格罗根在LinkedIn的页面上说，他从去年9月开始为ethos提供咨询服务；在ICANN要求提供与该公司有关的前ICANN员工的信息后，他的参与被披露。\n在切哈德的LinkedIn页面上，他仍然是收购甜甜圈的私募股权公司Abry的合伙人。布鲁克斯以前和阿布里在一起。", "note_en": "Former ICANN CEO is now a co-CEO of the private equity firm that tried to buy .org.\n  Former ICANN CEO Fadi Chehadé is currently listed as the co-CEO of Ethos Capital on the  firm’s website.\n Ethos Capital tried to buy Public Interest Registry, the non-profit that runs .org domains, but ICANN  denied the transaction.\n Chehadé’s name was nowhere on Ethos’ website when it announced the .org transaction. His involvement quickly  became public because of Whois data for one of Ethos Capital’s domain names. The private equity company admitted that Chehadé was an advisor on the deal.\n For months, the Ethos Capital website listed only two employees: CEO Erik Brooks and Chief Purpose Officer Nora Abusitta-Ouri. Abusitta-Ouri worked with Chehadé at ICANN.\n  The website change listing Chehadé as co-CEO appears to have happened very recently. The last Wayback Machine capture from June 15 did not show him. Elliot Silver  spotted the difference today.\n Many industry observers may wonder if Chehadé was pegged to be a co-CEO all along, only omitted from the website to avoid more controversy.\n Ethos’ website now lists eight employees, three of whom are former ICANN employees. Allen Grogan is Executive Partner and is the former Chief Contract Compliance Officer at ICANN.  Grogan’s LinkedIn page says he started advising Ethos last September; his involvement was disclosed after ICANN requested information on former ICANN employees involved with the company.\n Chehadé’s LinkedIn page still lists him as a partner at Abry, the private equity firm that  acquired Donuts. Brooks was formerly with Abry.", "posttime": "2020-07-18 11:18:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "首席,ceo", "title": "前ICANN首席执行官现在是试图收购.org的私募股权公司的联席首席执行官", "title_en": "Former ICANN CEO is now co-CEO of the private equity firm that tried to buy .org", "transed": 1, "url": "https://domainnamewire.com/2020/07/16/fadi-chehade-is-now-co-ceo-of-ethos-capital/", "via": "", "real_tags": ["首席", "ceo"]}, {"category": "", "categoryclass": "", "imagename": "33bd43654d5c2dd64a12ae05c1db3207.jpg", "infoid": 1012688, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在物理学中，我们通过猜测，然后将猜测的结果与实验结果进行比较，发现了一条新的定律。正如经常被引用的理查德·费曼(Richard Feynman)所说：“你的猜测有多美没有任何区别。你有多聪明没有任何区别，…。如果它与实验不一致，那就错了。“。\n这就是区分物理和数学的本质。数学家也会猜测，他们对真理的最终裁决者是严格的证据。物理学家可能会使用甚至发明复杂的数学工具，但他们的目标不同：解释宇宙的本来面目。为此，实验是必不可少的。\n当然，实验验证可能远远落后于我们的理论推测。科学家们花了100年的时间探测到地球上的引力波，花了50年的时间才发现了希格斯玻色子。两者都需要极大的独创性、技术开发和货币投资。这些实验观察不仅证实了理论预测，也教会了我们一些新的东西，同时也为进一步的研究打开了大门。我们预计天体物理源可以产生可探测到的引力波，但我们不知道这些源有多常见，我们有理由相信希格斯玻色子的存在，但不确定它的质量。\n量子引力的研究是理论走到实验前面的一个极端情况。我们对原子和亚核粒子尺度上的量子物理有了相当满意的理解，但还没有经过实验验证的适用于非常强引力的量子理论。如果没有这样的理论，我们就无法理解大爆炸后早期宇宙中发生了什么，也无法预测一个不幸的宇航员在黑洞内被压缩到难以想象的高密度的确切命运。我们需要实验来指导我们，但令人沮丧的是，它们难以捉摸。\n粒子物理学的历史提供了一个具有启发性的类比。到了20世纪50年代，我们已经有了一个与实验相一致的弱核力理论。但纯粹出于理论上的原因，我们知道它是有缺陷和不完整的；我们甚至可以估计，该理论的预测在非常短的距离尺度上会失败，大约10−18米或更短。最终，强大到足以在这些微小尺度上探索物质的加速器导致了新现象的发现，如W玻色子和Z玻色子以及希格斯粒子，这指向了一个更完整的理论。\n有了引力，我们又有很好的理由相信目前的理论是不完整的，在这里我们也可以估计新现象必须出现的距离尺度：大约10−35米。不幸的是，利用现有技术建造一台能够探测这种尺度的粒子加速器需要一台与银河系差不多大小的机器。显然，即使在遥远的未来，这也是遥不可及的。\n既然用“蛮力”研究量子引力是行不通的，我们必须找到一种更巧妙、更不直接的方法来取得进展。事实上，我们确实有各种关于在实验室中探测量子引力的建议，所有这些都需要实验者做出英勇的-但不一定是徒劳的-努力。我想讨论一种我觉得令人兴奋的特殊方法。\n为了理解它，让我们关注由于量子效应导致的黑洞的形成和最终的蒸发，这是量子引力中研究的典型现象。起初，在实验室进行相关实验似乎是不可能的，更不用说危险了。但也许有办法。\n量子引力的理论研究在同一物理现象的两种不同公式之间建立了惊人的等价性。由于这种等价性，黑洞的生命周期可以用一种完全不涉及重力的完全不同的语言来描述。取而代之的是，“双重”量子系统由许多相互强烈相互作用的粒子组成。当前研究的一个目标是充实词典，将这些语言中的一种翻译成另一种。\n对同一基础物理的两种不同描述的等价性似乎“仅仅”是一种数学观察，但它对实验的影响却是深远的。事实证明，研究黑洞非引力描述所需的实验工具，正是物理学家出于完全不同的原因已经在开发的工具-操作解决非常困难的计算问题的量子设备。这是因为在量子重力和量子计算的模拟中，我们都需要存储一个由许多粒子组成的复杂系统，并精确地控制它们如何相互作用。\n多年来，我一直对量子计算和黑洞都非常感兴趣，所以对我来说，这两者之间的这种联系是令人着迷和满足的。可以肯定的是，量子计算技术还不成熟，所以我们不可能很快在实验室里模拟出逼真的黑洞。没关系-我们将满足于研究简化的模型，这些模型捕捉到了量子引力的一些有趣的特征。即使是这些也可能是有启发性的，随着量子技术的进步，我们将能够进行越来越复杂的实验。\n此外，二元性是一条双行道。量子计算机不仅会教给我们有关量子引力的知识；通过将许多强相互作用粒子的行为与引力现象联系起来，我们可以更好地理解这种行为。通常，如果我们在一个强相互作用的系统中的特定位置印上一些信息，这些信息会迅速传播，很快就会变得非常难以阅读。但我们知道有一些有趣的情况，由于一些不明显的原因，信息最终会重新聚焦，并在遥远的不同位置变得很容易阅读。\n当翻译成双重引力语言时，这个神秘的过程就更容易理解了。在这个框架中，虫洞将空间中两个遥远的点连接起来。当印记信息进入虫洞的一端时，它就消失了，然后当它从另一端出现时，它又重新出现了。物理学家渴望这种对复杂现象的直观解释，而实验学家和理论家的共同努力必然会产生更多类似的见解。\n我们有时担心，随着科学的进步，它会不断分裂成越来越窄的专业，彼此之间的互动越来越少。但根据我自己的经验，我看到了一个更强大的反补贴趋势：随着知识的进步，在不同领域工作的科学家发现，他们有越来越多的东西可以相互学习。在实验室探索量子引力的机会受到高能理论家的猜测的推动，但它也大量借鉴了凝聚态物理学家、原子物理学家和计算机科学家的专业知识。这些令人兴奋和不断加深的联系让我对未来持乐观态度。", "note_en": "In physics, we discover a new law by making a guess, and then comparing the consequences of the guess with experimental results. As the ever-quotable Richard Feynman put it: “It does not make any difference how beautiful your guess is. It does not make any difference how smart you are … if it disagrees with experiment it is wrong.”\n This is the essence of what separates physics from, say, math. Mathematicians make guesses too, and their final arbiter of the truth is rigorous proof. Physicists may use or even invent sophisticated mathematical tools, but theirs is a different objective: to explain the universe as it really is. For that purpose, experiments are indispensable.\n Of course, experimental validation may lag far behind our theoretical speculations. It took 100 years for scientists to detect gravitational waves on Earth, and 50 years to discover the Higgs boson. Both required much ingenuity, technological development and monetary investment. And those experimental observations not only confirmed theoretical predictions, they also taught us something new, while opening the door to further investigation. We expected that astrophysical sources could produce detectable gravitational waves, but we couldn’t know how common those sources would be, and we had reason to believe the Higgs boson existed but were not sure about its mass.\n The study of quantum gravity is an extreme case of theory getting in front of experiment. We have a quite satisfactory understanding of quantum physics at the scale of atoms and subnuclear particles, but no experimentally validated quantum theory that applies to very strong gravitational forces. Without such a theory we cannot understand what happened in the early universe right after the Big Bang, or predict the exact fate of an unfortunate astronaut compressed to unimaginably high density within a black hole. We need experiments to guide us, yet they are depressingly elusive.\n  The history of particle physics provides an instructive parallel. By the 1950s, we had a theory of the weak nuclear force that agreed with experiment. But for purely theoretical reasons, we knew that it was flawed and incomplete; we could even estimate that the theory’s predictions would fail at very short distance scales, around 10 − 18 meters or less. Eventually, accelerators powerful enough to explore matter at these tiny scales led to the discovery of new phenomena, such as the W and Z bosons and the Higgs particle, pointing toward a more complete theory.\n With gravitation, we again have good reason to believe that the current theory is incomplete, and here too we can estimate the distance scale at which new phenomena must appear: about 10 − 35 meters. Unfortunately, building a particle accelerator that could probe that scale using existing technology would require a machine about as big as the Milky Way galaxy. Clearly, that will be far out of reach even in the distant future.\n Since investigating quantum gravity by “brute force” isn’t going to work, we’ll have to find a more ingenious and less direct way to make progress. And we do in fact have various proposals for probing quantum gravity in the lab, all requiring heroic — but not necessarily futile — efforts by experimentalists. I’d like to discuss one particular approach that I find exciting.\n To understand it, let’s focus on the formation and eventual evaporation of a black hole due to quantum effects, the quintessential phenomenon studied in quantum gravity. At first it may seem impossible, not to mention dangerous, to perform related experiments in the lab. But there may be a way.\n Theoretical investigations of quantum gravity have established an astonishing equivalence between two different formulations of the same physical phenomena. Thanks to that equivalence, a black hole’s life cycle can be described in a completely different language that does not involve gravity at all. Instead, the “dual” quantum system consists of many particles strongly interacting with one another. One goal of current research is to flesh out the dictionary that translates one of these languages into the other.\n  This equivalence of two different descriptions of the same underlying physics may seem like a “merely” mathematical observation, but its implications for experiments are profound. It turns out that the experimental tools needed to study the nongravitational description of a black hole are exactly the ones physicists have already been developing for completely different reasons — to operate quantum devices that solve very hard computational problems. That’s because in both a simulation of quantum gravity and a quantum computation, we need to store a complex system of many particles and accurately control how they interact.\n I have been deeply interested in both quantum computing and black holes for many years, so for me this connection between the two is fascinating and satisfying. To be sure,  quantum computing technology is still immature, so we won’t be able to simulate a realistic black hole in the lab anytime soon. That’s OK — we’ll settle for studying simplified models that capture some of the interesting features of quantum gravity. Even these can be instructive, and as quantum technology advances we’ll be able to do increasingly sophisticated experiments.\n Furthermore, duality is a two-way street. Not only will quantum computers teach us about quantum gravity; by relating the behavior of many strongly interacting particles to gravitational phenomena, we can better understand that behavior. Typically, if we imprint some information at a particular location in a strongly interacting system, this information spreads rapidly and soon becomes exceedingly hard to read. But we know of a few intriguing situations where, for reasons that are far from obvious, the information eventually refocuses and becomes easily readable at a different location far away.\n When translated into the dual gravitational language,  this mysterious process is much easier to grasp. In this framework, a wormhole connects two distant points in space. The imprinted information disappears as it enters one end of the wormhole, and then reappears as it emerges from the other. Physicists long for such intuitive explanations of complex phenomena, and the joint efforts of experimentalists and theorists are bound to yield further insights of the same sort.\n  We sometimes worry that as science progresses, it continually splinters into narrower and narrower specialties that interact less and less with one another. But based on my own experience, I see a more powerful countervailing trend: As knowledge advances, scientists working in different fields find that they have more and more to learn from one another. The opportunity to probe quantum gravity in the lab is fueled by the speculations of high-energy theorists, but it also draws heavily from the expertise of condensed matter physicists, atomic physicists and computer scientists. These exciting and deepening connections make me optimistic about the future.", "posttime": "2020-07-18 11:17:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "量子,quantum", "title": "量子计算可能会帮助我们研究量子引力", "title_en": "Quantum Computing May Help Us Study Quantum Gravity", "transed": 1, "url": "https://www.quantamagazine.org/john-preskill-quantum-computing-may-help-us-study-quantum-gravity-20200715/?", "via": "", "real_tags": ["量子", "quantum"]}, {"category": "", "categoryclass": "", "imagename": "71d3ed871792d85bd4c79bd13c4fe1fd.jpg", "infoid": 1012687, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麻省理工学院如何说话，IAP2018年教师：帕特里克·温斯顿查看完整的课程：https://ocw.mit.edu/how_to_speak帕特里克·温斯顿的如何说话有蜜蜂…", "note_en": "MIT How to Speak, IAP 2018 Instructor: Patrick Winston View the complete course: https://ocw.mit.edu/how_to_speak Patrick Winston's How to Speak talk has bee...", "posttime": "2020-07-18 11:17:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "温斯顿,patrick,说话", "title": "“如何说话”，帕特里克·温斯顿著", "title_en": "How to Speak by Patrick Winston", "transed": 1, "url": "https://www.youtube.com/watch?v=Unzc731iCUY", "via": "", "real_tags": ["温斯顿", "patrick", "说话"]}, {"category": "", "categoryclass": "", "imagename": "0a34cf0d0e1d34736fb0427ebf07ed5e.png", "infoid": 1012686, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前维多利亚时代的新冠肺炎疫情再次呼吁澳大利亚采取冠状病毒“消灭”战略。这真是令人惊讶。这是不现实的--而且很危险。\n推论是，如果维多利亚消除了社区传播，第二次疫情就不会发生--这显然是错误的。\n正如维多利亚州州长丹尼尔·安德鲁斯(Daniel Andrews)所说，此次疫情很大程度上源于澳大利亚公民从海外回国的隔离安排遭到破坏。即使社区传播已经消除了几周，这样的入侵也会滋生这次疫情。\n这场辩论的部分挑战是，在媒体上为此案起诉的人并不普遍持有消除的定义。\n如果我们采用公认的公共卫生术语，即我们将澳大利亚的感染人数减少到零，并以刻意的公共卫生干预为目标，以防止重新建立社区传播，这听起来与我们在澳大利亚大部分地区所取得的成就非常相似。\n我们称之为“咄咄逼人的镇压”，我们采取任何必要的措施，包括重新实施限制和关闭边界的艰难决定，以切断发生这种情况的社区传播。\n然而，只有在你有疫苗的情况下，真正的消除才是一个现实的策略。而且我们还没有新冠肺炎的疫苗。\n麻疹就是一个很好的例子。它在澳大利亚被消灭，我们在2014年获得了世界卫生组织(WHO)的这一殊荣。“我们偶尔会爆发疫情，我们的公共卫生团队很快就控制住了疫情，因为我们有很好的免疫接种计划。\n在澳大利亚，我们一直在进行激进的镇压，因为我们知道这将导致该国部分地区的淘汰期。消灭和镇压不是相互排斥的概念，而是一个可以根据当地情况进行调整的连续体。\n当它发生时，局部消除是很棒的，它允许显著放松疏远措施。\n然而，这不应该导致抗击病毒的基本原则完全放松。保持身体距离，在场馆内记录联系方式，养成良好的卫生习惯，是现在的一种生活方式。如果最近几周维多利亚州出现全面放松，最近的这一次输入性疫情肯定会更加严重。\n在全球传播不断增加的澳大利亚，我们无法实现消灭。\n完全封锁任何国家的边界是不可能的，即使是像澳大利亚这样的岛屿大陆，我们也不应该尝试这样做。返回的旅客、货船和相关船员将继续来自传播广泛的国家。\n任何国家或地区都不能想当然地认为，一段时间的地方消灭就是防止社区进一步爆发的保护措施。我们的制度是优秀的，但它们永远不会完美，任何领导人声称它们可能是完美的都是不负责任的。\n消除风险产生的是一种错误的安全感，这种安全感可能会减少社区对广泛检测的参与，并导致加强的公共卫生应对措施的缩减，这是建立在一个假设的基础上的，即“我们已经在我们所在的地区一劳永逸地消除了病毒”。\n这很危险。每一个有能力的国家和地区都应该提高警惕，有能力应对新冠肺炎疫情，无论它们目前的社区传播状况如何。\n在澳大利亚，我们将继续尽一切可能争取本地淘汰。在与新冠肺炎的斗争中，我们仍然是世界上最成功的国家之一。我们实现了这一点，不是通过追求消除的虚假希望，而是通过在最必要的时候采取现实、务实和相称的行动。", "note_en": "The current Victorian COVID-19 outbreak has seen renewed calls for Australia to pursue a coronavirus “elimination” strategy. This is surprising. It’s unrealistic ­– and it’s dangerous.\n The inference is that if Victoria had eliminated community transmission, this second outbreak would not have occurred – something which is patently false.\n As the Victorian Premier, Daniel Andrews, has said, this outbreak has largely stemmed from breaches in quarantine arrangements for Australian citizens returning from overseas. Such breaches would have seeded this outbreak even if community transmission had been eliminated for several weeks.\n Part of the challenge in this debate is that the definition of elimination is not commonly held by people who are prosecuting the case for it in the media.\n If we take the accepted public health terminology, that we reduce to zero the number of infections in Australia and target deliberate public health interventions to prevent re-establishing community transmission, that sounds very similar to what we have achieved in most parts of Australia.\n We have termed this “aggressive suppression”, where we take whatever measures are necessary, including the difficult decisions to reintroduce restrictions and close borders, to shut down community transmission where it occurs.\n However, true elimination is really only a realistic strategy when you have a vaccine. And we do not yet have a vaccine for COVID-19.\n Measles is a good example.  It is eliminated in Australia and we received that distinction from the World Health Organization (WHO) in 2014.  We have occasional outbreaks, which are quickly brought under control by our public health teams and because we have an excellent immunisation program.\n In Australia, we have pursued aggressive suppression with the knowledge this will lead to periods of elimination in parts of the country. Pursuing elimination and suppression are not mutually exclusive concepts; rather a continuum that can be adjusted to local circumstances.\n Local elimination is wonderful when it occurs, and it allows significant relaxation of distancing measures.\n It should not, however, lead to a complete relaxation of basic principles to combat the virus. Physical distancing, recording of contact details in venues and practising good hygiene are a way of life now. Had full relaxation occurred in Victoria in recent weeks, this latest imported outbreak would certainly have been even more significant.\n We are not in a position in Australia to achieve elimination where global transmission is increasing.\n It is impossible to completely seal the borders of any country – even an island continent such as Australia – and nor should we try to. Returning travellers, freight vessels and associated crews will continue to come from countries with widespread transmission.\n No country or part of a country can assume that a period of local elimination is protection against further community outbreaks.  Our systems are excellent, but they will never be perfect, and it would be irresponsible for any leader to claim they could be.\n The risk elimination creates is a false sense of security that may diminish the community engagement with widespread testing and lead to a downsizing of the enhanced public health response, based on an assumption “we have got rid of the virus once and for all in our part of the world”.\n This is dangerous. Every country and region with the capacity to do so should be on the lookout and have the ability to respond to COVID-19 outbreaks, whatever their current state of community transmission.\n  In Australia, we will continue to strive for local elimination wherever possible. We remain one of the world’s most successful nations in the fight against COVID-19. We have achieved this, not by pursuing the false hope of elimination, but by realistic, pragmatic and proportionate action when it is most necessary.", "posttime": "2020-07-18 11:17:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "医疗,deputy,澳大利亚", "title": "澳大利亚副首席医疗官：消除新冠肺炎的虚幻希望", "title_en": "Australian Deputy Chief Medical Officer: Eliminating Covid-19 a False Hope", "transed": 1, "url": "https://www.health.gov.au/news/eliminating-covid-19-a-false-hope", "via": "", "real_tags": ["医疗", "deputy", "澳大利亚"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012685, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年7月最近有很多关于特权的讨论。虽然这个概念被过度使用了，但它还是有一定的道理，特别是特权会让你失明的想法，让你无法看到那些生活与你截然不同的人所能看到的东西。但是，这类失明最普遍的例子之一，我从未见过明确提到过。我要称它为正统特权：一个人的思想越传统，在他们看来，每个人表达自己的观点就越安全。对他们来说，发表意见是安全的，因为他们的意见来源是目前可以接受的任何东西。因此，在他们看来，这对每个人来说都是安全的。从字面上讲，他们无法想象会给他们带来麻烦的真实说法。然而，在历史的每一个时刻，都有一些真实的事情会让你陷入可怕的麻烦之中。我们的是第一个不是这样的地方吗？那将是多么惊人的巧合啊。当然，这至少应该是默认的假设，即我们的时代并不是独一无二的，有一些真实的事情你现在不能说，就像过去一直存在的那样。你会认为。但是，即使面对如此压倒性的历史证据，大多数人还是会大胆地去做这件事。东正教特权的典型特征是，你为什么不直接说出来呢？如果你认为有些事情是真实的，人们不能说，为什么你不勇敢地拥有它呢？更极端的人甚至会指责你他们认为你心里一定有特定的异端邪说，尽管如果你那个时代有不止一种异端邪说，这些指控往往是不确定的：你必须要么是Bean Xist，要么是Yist。与这些人打交道固然令人沮丧，但重要的是要认识到他们是认真的。他们并不是假装认为一个想法既非正统又真实是不可能的。在他们看来，世界真的是这样的。你如何回应正统特权？仅仅给它起个名字可能会有一些帮助，因为当你遇到它的时候，它会提醒你，为什么和你交谈的人看起来如此不合理，因为这是一种独特的顽强的特权形式。人们可以通过了解更多他们不了解的东西来克服大多数形式的特权造成的盲目性。但是他们不能仅仅通过学习更多的知识来克服正统特权。他们必须变得更加独立。如果这真的发生了，那也不是在一次谈话的时间范围内发生的。也许可以让一些人相信正统特权是存在的，尽管他们感觉不到它，就像人们对暗物质可以感觉到的那样。例如，可能会有一些人相信，这是历史上第一个你不能说没有真实的东西的时刻，即使他们想象不出具体的例子，这也是非常不可能的。但是，除了这些人，我认为对这类特权说“检查一下你的特权”是行不通的，因为那些在这类特权中的人并没有意识到他们也在享受这项特权的权利。“。在思想保守的人看来，他们并不是思想传统。在他们看来，他们是对的。事实上，他们往往特别肯定这一点。也许解决办法就是诉诸礼貌。如果有人说他们能听到你听不到的高音噪音，那只是礼貌地相信他们的话，而不是要求他们拿出不可能拿出的证据，或者干脆否认他们听到了什么。想象一下这听起来有多粗鲁。同样，如果有人说他们能想到一些真实但不能说出来的事情，那么只有礼貌地相信他们的话，即使你自己想不到任何事情。一旦你意识到正统特权的存在，很多其他的事情就会变得更加清晰。例如，怎么会有一大批理性的聪明人担心他们所谓的取消文化，而另一些理性的聪明人却认为这是个问题呢？“。一旦你理解了正统特权的概念，就很容易看出这种分歧的根源。如果你相信没有什么是你不能说的，那么任何因为他们所说的事情而陷入麻烦的人都是罪有应得。感谢山姆·奥尔特曼、特雷弗·布莱克威尔、帕特里克·科里森、安东尼奥·加西亚-马丁内斯、杰西卡·利文斯顿、罗伯特·莫里斯、迈克尔·尼尔森、杰夫·拉尔斯顿、马克斯·罗瑟和哈吉·塔格阅读了这本书的草稿。", "note_en": "July 2020  There has been a lot of talk about privilege lately. Although theconcept is overused, there is something to it, and in particularto the idea that privilege makes you blind that you can&#39;t seethings that are visible to someone whose life is very differentfrom yours.  But one of the most pervasive examples of this kind of blindnessis one that I haven&#39;t seen mentioned explicitly. I&#39;m going to callit  orthodox privilege: The more conventional-minded someone is, themore it seems to them that it&#39;s safe for everyone to express theiropinions.  It&#39;s safe for them to express their opinions, because the sourceof their opinions is whatever it&#39;s currently acceptable to believe.So it seems to them that it must be safe for everyone. They literallycan&#39;t imagine a true statement that would get them in trouble.  And yet at every point in history, there were true things that wouldget you in terrible trouble to say. Is ours the first where thisisn&#39;t so? What an amazing coincidence that would be.  Surely it should at least be the default assumption that our timeis not unique, and that there are true things you   can&#39;t say now,just as there have always been. You would think. But even in theface of such overwhelming historical evidence, most people will gowith their gut on this one.  The spectral signature of orthodox privilege is &#34;Why don&#39;t you justsay it?&#34; If you think there&#39;s something true that people can&#39;t say,why don&#39;t you be brave, and own it? The more extreme will evenaccuse you of specific heresies they imagine you must have in mind,though if there&#39;s more than one heresy current in your time, theseaccusations will tend to be nondeterministic: you must either bean xist or a yist.  Frustrating as it is to deal with these people, it&#39;s important torealize that they&#39;re in earnest. They&#39;re not pretending they thinkit&#39;s impossible for an idea to be both unorthodox and true. Theworld really looks that way to them.  How do you respond to orthodox privilege? Merely giving it a namemay help somewhat, because it will remind you, when you encounter it,why the people you&#39;re talking to seem so strangely unreasonable.Because this is a uniquely tenacious form of privilege. People canovercome the blindness induced by most forms of privilege by learningmore about whatever they&#39;re not. But they can&#39;t overcome orthodoxprivilege just by learning more. They&#39;d have to become moreindependent-minded. If that happens at all, it doesn&#39;t happen onthe time scale of one conversation.  It may be possible to convince some people that orthodox privilegemust exist even though they can&#39;t sense it, just as one can with,say, dark matter. There may be some who could be convinced, forexample, that it&#39;s very unlikely that this is the first point inhistory at which there&#39;s nothing true you can&#39;t say, even if theycan&#39;t imagine specific examples.  But except with these people, I don&#39;t think it will work to say&#34;check your privilege&#34; about this type of privilege, because thosein its demographic don&#39;t realize they&#39;re in it. It doesn&#39;t seem toconventional-minded people that they&#39;re conventional-minded. Itjust seems to them that they&#39;re right. Indeed, they tend to beparticularly sure of it.  Perhaps the solution is to appeal to politeness. If someone saysthey can hear a high-pitched noise that you can&#39;t, it&#39;s only politeto take them at their word, instead of demanding evidence that&#39;simpossible to produce, or simply denying that they hear anything.Imagine how rude that would seem. Similarly, if someone says theycan think of things that are true but that cannot be said, it&#39;sonly polite to take them at their word, even if you can&#39;t think ofany yourself.  Once you realize that orthodox privilege exists, a lot of otherthings become clearer. For example, how can it be that a largenumber of reasonable, intelligent people worry about something theycall &#34;cancel culture,&#34; while other reasonable, intelligent peopledeny that it&#39;s a problem? Once you understand the concept of orthodoxprivilege, it&#39;s easy to see the source of this disagreement. Ifyou believe there&#39;s nothing true that you can&#39;t say, then anyonewho gets in trouble for something they say must deserve it.             Thanks to Sam Altman, Trevor Blackwell, Patrick Collison, Antonio Garcia-Martinez,Jessica Livingston, Robert Morris, Michael Nielsen, Geoff Ralston, Max Roser, andHarj Taggar for reading drafts of this.", "posttime": "2020-07-18 10:55:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "东正教,orthodox,特权", "title": "东正教特权", "title_en": "Orthodox Privilege", "transed": 1, "url": "http://www.paulgraham.com/orth.html", "via": "", "real_tags": ["东正教", "orthodox", "特权"]}, {"category": "", "categoryclass": "", "imagename": "6927ed7609305e637bbc6861a6cb9719.jpg", "infoid": 1012684, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据当地一家新闻媒体报道，韩国环境部发表声明称，该国将在2025年前投资610亿美元，成为净零社会。\n作为韩国新政的一部分，这一绿色政策是这个亚洲国家对日益高涨的气候变化浪潮的回应，同时也提振了受到新冠肺炎冠状病毒重创的经济，希望实现商务部所说的“净零社会”。\n据阿里郎新闻中心报道，一位韩国政府官员说，现在是加速成为零碳社会的最合适时机。绿色新政旨在克服新冠肺炎引发的经济危机和导致流行病的气候和环境危机。\n5年期、610亿美元(美国)。该倡议呼吁建设零能耗的公共设施，其中许多设施将用生态友好型材料进行改建。这一举措预计将创造66万个新的就业机会，此外，未来五年还将减少1200万吨温室气体。\n政府还将带头在全国范围内升级公共教育，提供更多的生态友好型学校。到2022年，韩国所有小学、初中和高中都将安装WiFi，学校将收到大约24万台平板电脑。\n韩国政府还致力于在城市基础设施和建筑中采用绿色技术。一旦建成，韩国将拥有25个智能绿色城市。\n如果国家达到目标，能源将从化石燃料转向可再生能源，包括太阳能、风能和氢能。\n据阿里郎报道，尽管全球汽车市场受到新冠肺炎的冲击，韩国2020年上半年的电动汽车销量增长了80%，但政府将尽最大努力让我们的环保汽车行业成为全球领先者。\n机动性也将适应，因为环保交通-现有100多万辆电动汽车-将取代使用普通汽油的汽车。据报道，韩国将供应20万辆氢气汽车，而不是在全国范围内收取关税。\n据阿里郎新闻中心报道，韩国政府表示，绿色新政将成为我们国家成为净零经济全球领头羊的垫脚石。\n韩国政府还将创建10个智能绿色工业园，拥有1700多家绿色工厂。随着世界准备迎接全球气候变化的全面冲击，韩国正加入全球主要经济体的行列，努力从冠状病毒危机的影响中恢复过来。", "note_en": "South Korea announced it&#39;s investing $61 billion by 2025 to become a &#34;net-zero society,&#34; according to a statement from the country&#39;s Ministry of Environment,  reports a local news source.\n   As part of the South Korean New Deal, this &#34;green&#34; policy is the Asian country&#39;s response to the rising tide of climate change, while also boosting its economy — hit hard by the COVID-19 coronavirus — in hopes of achieving what trade ministries have called a &#34;net-zero society.&#34;\n &#34;Now is the most appropriate time to speed up to become a carbon net-zero society,&#34; said a South Korean government official, Arirang News Center reports. &#34;The Green New Deal aims to overcome both the economic crisis caused by COVID-19 and the climate and environmental crises that caused the pandemic.&#34;\n  The five-year, 61-billion-dollar (U.S.) initiative calls for the construction of zero-energy public facilities, many of which will be remodeled with  eco-friendly materials. This move is expected to create 660,000 new jobs, in addition to reducing greenhouse gases by 12 million tons over the next five years.\n  The government will also spearhead a country-wide public education upgrade to offer  eco-friendly schools. Schools will receive roughly 240,000 Tablet computers, with WiFi installed in all elementary, middle- and high schools throughout South Korea by 2022.\n The South Korean government also aims to adopt green technology for city infrastructure and buildings. Once completed, South Korea should have 25 &#34;smart green cities.&#34;\n  If and when the country reaches its goal, energy will shift from fossil fuels to renewable sources, including solar, wind, and hydrogen power.\n  &#34;Despite the global car market taking a hit from COVID-19, Korea&#39;s electric car sales in the first half of 2020 rose by 80%, the government will put its utmost efforts into making our eco-friendly car industry the global leader,&#34; said a government official, Arirang reports.\n  Mobility will also adapt, as eco-friendly transportation — with more than 1 million electric cars available — will come to replace cars running on ordinary gas. South Korea will reportedly supply 200,000 hydrogen vehicles, instead of a charging a tariff across the nation.\n &#34;The Green New Deal will be a stepping stone for [our] nation to become a global pace-setter in [the] net-zero economy,&#34; said the South Korean government, reports Arirang News Center.\n The South Korean government will also create 10 &#34;smart green&#34; industrial complexes, with more than 1,700 &#34;green factories.&#34; As the world braces for the full onslaught of global climate change, South Korea is joining major worldwide economies already working to recover from the effects of the  coronavirus crisis.", "posttime": "2020-07-18 10:15:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "社会,korea,绿色", "title": "韩国承诺到2025年为“净零社会”投入610亿美元", "title_en": "South Korea Commits $61 Billion For 'Net-Zero Society' By 2025", "transed": 1, "url": "https://interestingengineering.com/south-korea-commits-61-billion-for-net-zero-society-by-2025", "via": "", "real_tags": ["社会", "korea", "绿色"]}]