[{"category": "", "categoryclass": "", "imagename": "a0494bb0ff6666b59f0d1fe675e586b3.jpg", "infoid": 1067981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的三十年里，带来了太阳系令人惊叹的令人惊叹的照片并丰富了我们对宇宙的理解的故事的空间望远镜正在经历一个技术故障。\n  美国宇航局的科学家们说，哈勃太空望远镜＆＃39; S的有效载荷计算机，操作航天器＆＃39; SCONICIC Instruments，突然在6月13日突然下降。没有它，船上的乐器意味着拍摄图片并收集数据目前尚未收集数据在职的。\n  科学家在故障的计算机系统上运行了一系列测试，但尚未弄清楚出了问题。\n  ＆＃34;它＆＃39;＆＃39;试图修复某些东西的效率低下，在你的头上而不是你的实验室，＆＃34; NASA的Astrophysics主任Paul Hertz告诉NPR。\n  ＆＃34;如果这台计算机在实验室中，我们＆＃39; D＆＃39; d挂钩监视器并测试输入并输出到处，并且真的很快诊断它，＆＃34;他说。 ＆＃34;我们所能做的一切都是从我们有限的命令发送一个命令，然后看看计算机中的数据，然后向下发送数据并尝试分析它。＆＃34;\n      在第一个美国宇航局科学家们想知道A＆＃34;降级内存模块＆＃34;在哈勃上责怪。然后，在周二，该机构表示正在调查计算机＆＃39; S中央处理模块（CPM）或其标准接口（Stint）硬件，这有助于CPM与其他组件通信，导致问题。\n  赫兹表示，目前的假设虽然没有验证，但技术问题是A＆＃34;随机部件失败＆＃34;在计算机系统的某个地方，建于20世纪80年代，并于1990年推出了太空。 \n＆＃34;它们＆＃39;重新获得的电脑与您的手机中的＆＃39;他说，＆＃34;但问题是我们可以触摸它或看到它。＆＃34;\n  大多数Hubble＆＃39; S组件具有冗余的备份，因此一旦科学家们弄清楚＆＃39; s导致计算机问题的特定组件，它们可以远程切换到其备份部分。\n  ＆＃34;拇指的规则是什么东西在工作时你不改变它，＆＃34;赫兹说。 ＆＃34;我们＆＃39;当我们将哈勃恢复服务时，喜欢改变尽可能少的事情。＆＃34;\n    有效载荷计算机操作的仪器 - 例如调查的高级相机，用于捕获空间图像的图像和宇宙起源光谱仪，这些宇宙源点测量近距离光源 - 目前在＆＃34;安全模式＆＃34;而不是操作。\n    在不同的系统上运行的望远镜本身继续通过指向设定的时间表上的不同部分来操作。 ＆＃34;我们这样做的原因是望远镜在我们计划的方式保持其方向相对于太阳，并且保持望远镜的热稳定性，使其保持在正确的温度下，＆＃34 ;赫兹说。\n  最后一次宇航员访问哈勃是2009年第五次和最终维修任务。\n  赫兹说，由于哈勃旨在由航天飞机提供服务，而航天飞机舰队已经退休，因此没有未来的计划为外层空间天文台提供服务。 ", "note_en": "The storied space telescope that brought you stunning photos of the solar system and enriched our understanding of the cosmos over the past three decades is experiencing a technical glitch.\n  Scientists at NASA say the Hubble Space Telescope&#39;s payload computer, which operates the spacecraft&#39;s scientific instruments, went down suddenly on June 13. Without it, the instruments on board meant to snap pictures and collect data are not currently working.\n  Scientists have run a series of tests on the malfunctioning computer system but have yet to figure out what went wrong.\n  &#34;It&#39;s just the inefficiency of trying to fix something which is orbiting 400 miles over your head instead of in your laboratory,&#34; Paul Hertz, the director of astrophysics for NASA, told NPR.\n  &#34;If this computer were in the lab, we&#39;d be hooking up monitors and testing the inputs and outputs all over the place, and would be really quick to diagnose it,&#34; he said. &#34;All we can do is send a command from our limited set of commands and then see what data comes out of the computer and then send that data down and try to analyze it.&#34;\n      At first NASA scientists wondered if a &#34;degrading memory module&#34; on Hubble was to blame. Then on Tuesday  the agency said it was investigating whether the computer&#39;s Central Processing Module (CPM) or its Standard Interface (STINT) hardware, which helps the CPM communicate with other components, caused the problem.\n  Hertz said the current assumption, though unverified, was that the technical issue was a &#34;random parts failure&#34; somewhere on the computer system, which was built in the 1980s and launched into space in 1990.\n     &#34;They&#39;re very primitive computers compared to what&#39;s in your cell phone,&#34; he said, &#34;but the problem is we can&#39;t touch it or see it.&#34;\n  Most of Hubble&#39;s components have redundant back-ups, so once scientists figure out the specific component that&#39;s causing the computer problem, they can remotely switch over to its back-up part.\n  &#34;The rule of thumb is when something is working you don&#39;t change it,&#34; Hertz said. &#34;We&#39;d like to change as few things as possible when we bring Hubble back into service.&#34;\n    The  instruments that the payload computer operates — such as the Advanced Camera for Surveys that captures images of space and the Cosmic Origins Spectrograph which measures distant sources of ultraviolet light — are currently in &#34;safe mode&#34; and not operating.\n    The telescope itself, which runs on a different system, has continued to operate by pointing at different parts of the sky on a set schedule. &#34;The reason we do that is so that the telescope keeps changing its orientation relative to the sun in the way that we had planned, and that maintains the thermal stability of the telescope, keeps it at the right temperature,&#34; Hertz said.\n  The last time astronauts visited Hubble was in 2009 for its  fifth and final servicing mission.\n  Hertz said that because Hubble was designed to be serviced by the space shuttle and the space shuttle fleet has since been retired, there are no future plans to service the outer space observatory.", "posttime": "2021-06-24 22:16:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国宇航局,nasa,美国,计算机,figure", "title": "美国宇航局无法弄清楚在哈勃望远镜上导致计算机问题 ", "title_en": "NASA Can't Figure Out What's Causing Computer Issues on the Hubble Telescope", "transed": 1, "url": "https://www.npr.org/2021/06/23/1009567351/hubble-trouble-nasa-cant-figure-out-whats-causing-computer-issues-on-the-telesco", "via": "", "real_tags": ["美国宇航局", "nasa", "美国", "计算机", "figure"]}, {"category": "", "categoryclass": "", "imagename": "2881028ca38bb15867c472c783f51de4.webp", "infoid": 1067980, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在任何PHP框架中发送API请求一直是一点点手动过程，是的，您可以创建一个SDK或包装器 - 但您仍然必须做同样的事情。\n 您在HTTP客户端或Facade中拉动，您将其配置为进入要发送请求的URI的运算方式，然后标记在可选的附件，如身份验证，有效载荷，任何其他标题。这是一个非常手动过程。\n 很多时候您都有要发送的特定请求，是的，你可以在通过进入标识符等时略微调整东西 - 但通常它们保持相对常量。\n 这让我感到沮丧了一段时间，我们必须很长的长度来制造我们面向的很多代码对象。然而，我们尝试用API请求完成此操作。我一直坐在这个问题上很长一段时间，思考可能的解决方案 - 它可能看起来如何，以及如何使用它。\n 这是我最新的Laravel包装：我描述为：\n Transporter是在PHP中发送API请求的未来派方式。这是处理API请求的OOP方法。\n  要开始，您需要做的就是安装它，没有配置无需添加到您的项目中没有任何额外的东西 - 它只在您想要使用它时使用。 \n我们在这里所做的就是过滤完成的托多列表 - 没有什么意思是困难的。\n 首先让我们看一下我们通常如何做到这一点（但是假装我们假装此API要求我们使用先前生成的API令牌进行身份验证）。\n  不可思议的权利？我的意思是，它有效，并做你可能期望的。但是，这是非常成绩。如果URL更改会发生什么？如果查询参数更改，会发生什么？我们必须通过我们的代码库追捕，并在任何地方更新这些。你知道，我们正在努力避免更多和更多的东西我们构建的一切。\n 让＆＃39; s为这些请求添加了一点魔法，并了解我们如何使用Laravel运输车发送完全相同的请求：\n  它＆＃39; s。整个东西凝聚在课程中。让＆＃39;看看我们如何到达那里。\n    ＆lt;？phpdeclare（strict_types = 1）;命名空间app \\ transporter;使用illuminate \\ http \\ client \\ pendingrequest;使用juststeveking \\ transporter \\ prodect; class todorequest扩展请求{protected string $ method =＆＃39; get＆＃39;受保护的字符串$ baseurl =＆＃39; https：//jsonplaceholder.typicode.com&#39 ;;受保护的字符串$ path =＆＃39; / todos＆＃39 ;;受保护的数组$ DATA = [＆＃39;已完成＆＃39; =＆gt;真的， ];受保护的函数有查询（PendingRequest $请求）：void {$ equest-＆gt; outtoken（config（＆＃39; jsonplaceholder.api.token＆＃39;））; }}\n 返回原来的问题，如果选择改变 - 我们必须在我们的应用程序中捕获我们可能已经使用过的地方。通过将此移动到基于类的请求来解决该问题。此外，由于请求本身只是一个围绕Laravels Inbuilt PendingRequest的花哨的包装器 - 我们可以在发送之前和之后调用所有相同的方法。意思是没有新的API学习，所以它相对直截了当。您也可以在运行时覆盖选项 - 想要显示未完成的户户曲？ \n这可能不是一个接地破碎的包，即将改变世界，但是要做的就是让你开始询问问题：我可以以更具结构化和有组织的方式发送API请求吗？\n 想象一下，您需要使用第三方API所需的方案。您可以很快生成一系列请求，并将完成！让＆＃39借用Laravel Forge的示例，如果你记得我在此之前写过关于我在这里发布的PHP-SDK的那篇文章。\n    ＆lt; phpdeclare（strict_types = 1）;命名空间app \\ transporter \\ forge;使用illuminate \\ http \\ client \\ pendingrequest;使用juststeveking \\ transporter \\ lequest;类忘记扩展请求{受保护的字符串$ baseurl =＆＃39; https：/ /forge.laravel.com/api/v1&#39 ;;受保护的函数有查询（pendingrequest $请求）：void {$ locue-＆gt; outtoken（config（＆＃39; services.forge.token＆＃39;））; }}\n 下一个Let＆＃39;借用所有服务器的示例。为此请求生成新请求：\n   ＆lt;？phpdeclare（strict_types = 1）;命名空间app \\ transporter \\ forge \\ server;使用app \\ transporter \\ forge \\ forgerequest;使用illuminate \\ http \\ client \\ pendingrequest; class listservers扩展谅解{protected string $方法=＆＃39 ; Get＆＃39 ;;受保护的字符串$ path =＆＃39; /服务器＆＃39 ;;}\n 我们在这里所做的就是使用继承来扩展遗忘，该遗传包含我们需要的每个请求的初始状态 - 并允许我们建立在我们想要的地方。\n 感谢您的阅读，我欢迎任何可能有助于推动此包装的反馈，并使更容易使用！随意开始讨论或打开GitHub存储库的问题，甚至在Twitter上丢弃我的推文/ DM。 ", "note_en": "Sending API requests in any PHP framework has always been a little bit of a manual process, yes you can create an SDK or wrapper - but you are still having to do the same thing.\n You pull in the HTTP client, or facade, you configure it in a proceedural way entering the URI you want to send a request to, then tag on the optional extras such as authentication, payload, any additional headers. It is quite a manual process.\n A lot of the time you have a specific request you want to send, yes you may slightly adjust things as you go by passing in an identifier etc etc - but in general they remain relatively constant.\n This has frustrated me for a while, we have to great lengths to make a lot of our code Object Oriented. Yet, we hadn&#39;t tried to do this with API requests. I have been sitting on this question for quite a while, pondering on the possible solutions - how it might look, and how it might be used.\n The result of this has turned into my latest Laravel package:  Laravel Transporter which I describe as:\n Transporter is a futuristic way to send API requests in PHP. This is an OOP approach to handle API requests.\n  To get started all you need to do is install it, theres no configuration required nothing extra to add to your project - it will only be used when you want to use it.\n   All we are doing here is filtering a list of todos that are completed - nothing overly difficult.\n Firstly let us have a look at how we would do this usually (but let&#39;s pretend this API required us to be authenticated using an API token we have previously generated).\n  Not terrible right? I mean, it works and does what you might expect. But, this is very proceedural. What happens if the URL changes? What happens if the query parameters change? We have to hunt through our code base, and update these everywhere. You know, the thing we are trying to avoid more and more in everything we build.\n Let&#39;s add a little magic to these requests and see how we would send this exact same request using Laravel Transporter:\n  That&#39;s it. The entire thing condensed into a class. Let&#39;s look how we got there.\n    &lt;?phpdeclare(strict_types=1);namespace App\\Transporter;use Illuminate\\Http\\Client\\PendingRequest;use JustSteveKing\\Transporter\\Request;class TodoRequest extends Request{ protected string $method = &#39;GET&#39;; protected string $baseUrl = &#39;https://jsonplaceholder.typicode.com&#39;; protected string $path = &#39;/todos&#39;; protected array $data = [ &#39;completed&#39; =&gt; true, ]; protected function withRequest(PendingRequest $request): void { $request-&gt;withToken(config(&#39;jsonplaceholder.api.token&#39;)); }}\n Going back to the original problem, if options change - we have to hunt everywhere in our application for where we may have used it. That problem has been solved by moving this to a class based request. Also, as the request itself is just a fancy wrapper around Laravels inbuilt  PendingRequest - we can call all the same methods before and after sending. Meaning there is no new API to learn, so it is relatively straight forward. You can override options at runtime too - want to show not completed todos?\n  This may not be a ground breaking package that is going to change the world, however what it is going to do is make you start asking the question: Could I send API requests in a more structured and organised way?\n Imagine a scenario, where you needed to work with a 3rd party API. You could quite quickly generate a series of requests and it will be done! Let&#39;s take the example of Laravel Forge, which if you remember I wrote about before when I released PHP-SDK  here is that article.\n    &lt;?phpdeclare(strict_types=1);namespace App\\Transporter\\Forge;use Illuminate\\Http\\Client\\PendingRequest;use JustSteveKing\\Transporter\\Request;class ForgeRequest extends Request{ protected string $baseUrl = &#39;https://forge.laravel.com/api/v1&#39;; protected function withRequest(PendingRequest $request): void { $request-&gt;withToken(config(&#39;services.forge.token&#39;)); }}\n Next let&#39;s take the example of getting all servers. Generate a new request for this request:\n   &lt;?phpdeclare(strict_types=1);namespace App\\Transporter\\Forge\\Servers;use App\\Transporter\\Forge\\ForgeRequest;use Illuminate\\Http\\Client\\PendingRequest;class ListServers extends ForgeRequest{ protected string $method = &#39;GET&#39;; protected string $path = &#39;/servers&#39;;}\n All we have done here is used inheritance to extend the ForgeRequest which contains our initial state for every request we need - and allows us to build upon that where we want to.\n Thanks for reading, I welcome any feedback that may assist in pushing this package forward and making it easier to use! Feel free to start a discussion or open an issue on the  GitHub Repository or even drop me a tweet/DM on  twitter.", "posttime": "2021-06-24 22:16:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "小径,laravel,请求", "title": "小径运输 ", "title_en": "Laravel Transporter", "transed": 1, "url": "https://www.juststeveking.uk/introducing-laravel-transporter/", "via": "", "real_tags": ["小径", "laravel", "请求"]}, {"category": "", "categoryclass": "", "imagename": "239b7303f0ba414b8ca3190258c79360.jpg", "infoid": 1067977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一个令人不安的新报告，对Venmo，Cash App或Zelle等一些数字付款服务和应用程序的投诉是令人窒息的。\n   非营利组织美国公共利益研究小组[Pirg]表示顶级问题包括骗局，使用账户和客户服务差的麻烦。本集团于2017年至4月2021年，分析了超过9,200名投诉，将消费者金融保护局提交。\n 该报告发现，从今年1月到4月举行了超过2,700份投诉 - 与去年同期达到600多个。\n   其中一个是来自纽约长岛的专业秘密学家Luke Krafka。 Krafka经常在音乐演奏中扮演一场变化的音乐家，通常以现金支付 - 他说移动支付应用程序使这项任务更容易。\n ＆＃34; PayPal，Venmo，Cash App，是的。没有涉及的纸张没有纸张，没有涉及的检查，其中没有等待，＆＃34;他告诉CBS新闻消费者调查记者Anna Werner，＆＃34;你马上得到报酬，去你的银行账户。＆＃34;\n   ＆＃34;这是一个正常的，你知道，婚礼。我伸出我的朋友，这对演出有利，＆＃34;他说。\n 客户告诉他，他会向Krafka发送大约1,000美元的支票，另外950美元支付客户＆＃39; s＆＃34; sound man＆＃34; - 他要求Krafka然后通过移动支付应用程序付款。 \n＆＃34;我说，＆＃39;看，如果你寄给我钱，那个＆＃39;没有问题，＆＃39; s fine，＆＃39; Krafka回忆道。  移动支付应用程序允许用户立即支付别人，通过连接到应用程序的银行账户或信用卡。  他们的简单性通常是件好事，但并非总是如此，因为克拉夫卡在存入婚礼客户端后发现了1,960美元。  ＆＃34;我检查了第二天，全额在我的银行账户中，＆＃34; 他说。  然后按照要求，他发送了客户＆＃39; s＆＃34;声音男人＆＃34; 通过付款APP Zelle 950美元。  ＆＃34;我相信这是第二天检查反弹，＆＃34; 他说。 ＆＃34;当发生这种情况时，然后我慢慢开始将所有这一切放在一起。＆＃34;  据说雇用他的人停止回答他的电话 - 他出了950美元。 \nPirg＆＃39;据报告向联邦监管机构看过有关数字钱包和付款应用，包括PayPal，Venmo，CashApp和Zelle的联邦监管机构。\n 他们发现今年1月至4月之间提交的那些从去年的同期增加了300％以上 - 许多人失去了骗子或欺诈。\n ＆＃34;如果它＆＃39; s诈骗者，它不会回来，＆＃34;埃德米尔兹温林斯（Sed Mierzwinski），负责监督Pirg＆＃39; S联邦消费计划。\n  ＆＃34;没有规则，当您的钱脱离您的帐户并进入其他人和＃39; S帐户时，根本没有保护您。他说。\n  Krafka说他伸出银行拿回钱，但被告知他们无法帮助他。\n   ＆＃34;我很惊讶的是，没有追索权，一旦完成，它就完成了，它已经完成，并且你无能为力，＆＃34;专业的音乐家说。\n Zelle不会评论krafka＆＃39; S案，但表示其最重要的是＆＃34;保护消费者免受诈骗和欺诈的。＆＃34;该公司在其网站上提供了全面的建议列表，用于消费者保护自己。 \nCash App在线和他们的移动应用程序以及7天的客户服务电话号码有一个帮助中心，并鼓励人们，＆＃34;如果您认为您已将受害者陷入骗局，您应该联系现金应用程序立即通过应用程序或网站支持。＆＃34;他们还提供关于认可和避免在其网站上的骗局的文章。\n Venmo和PayPal敦促消费者认为他们＆＃39;直接联系客户支持。＆＃34;他们为在他们的网站上报告的内容提供资源，并如何在其网站上报告。\n ＆＃34;我们还建议客户联系Spoof@Paypal.com，以分享有关疑似垃圾邮件的信息。我们专门的安全团队将审查所需的信息和赌注Actionas，＆＃34;公司网站读。\n 所有的App公司都告诉CBS新闻，他们努力停止糟糕的演员并有流程来帮助旗帜诈骗。他们也警告消费者保持警惕，只向他们所知道的人汇款 - 而不是陌生人。 ", "note_en": "Complaints against some digital payment services and apps like   Venmo, Cash App or Zelle are skyrocketing, according to a troubling new report.\n   Nonprofit U.S. Public Interest Research Group [PIRG] says top issues include scams, trouble using accounts and poor customer service. The group analyzed more than 9,200 complaints filed with the Consumer Financial Protection Bureau from 2017 to April of 2021.\n The report found more than 2,700 complaints were made from January to April of this year — compared to just over 600 in the same period last year.\n   One of them is Luke Krafka, a professional cellist from Long Island,   New York. Krafka often plays in concerts with a changing cast of musicians, who are usually paid in cash — and he says mobile payment apps have made that task a lot easier.\n &#34;Paypal, Venmo, cash app, yeah. There&#39;s no paper involved, there&#39;s no checks involved, there&#39;s no waiting,&#34; he told CBS News Consumer Investigative Correspondent Anna Werner, &#34;You get paid right away, goes to your bank account.&#34;\n   &#34;It was gearing up to be a normal, you know, wedding. And I had reached out to my friends that are good for the gig,&#34; he said.\n The client told him he would send a check of roughly $1,000 for Krafka and another $950 to pay for the client&#39;s &#34;sound man&#34; — who he asked Krafka to then pay through a mobile payment app.\n &#34;I said, &#39;look, if you send me the money, that&#39;s no problem, that&#39;s fine,&#39;&#34; Krafka recalled.\n   Mobile payment apps allow users to pay others immediately, through   bank accounts or credit cards connected to the app.\n Their simplicity is usually a good thing, but not always, as Krafka found out after depositing the wedding client&#39;s check for $1,960.\n &#34;I checked the following day, and the full amount was in my bank account,&#34; he said.\n Then as requested, he sent the client&#39;s &#34;sound man&#34; $950 through the payment app Zelle.\n &#34;I believe it was the following day that check bounced,&#34; he said. &#34;And when that happened, then I slowly started to put all of this together.&#34;\n The people who supposedly hired him stopped answering his calls — and he was out the $950.\n    PIRG&#39;s report looked at over 9,000 complaints to federal regulators about digital wallets and payment apps, including PayPal, Venmo, CashApp and Zelle.\n They found the ones filed between January and April of this year were up more than 300% from the same period last year — with many losing money to scams or fraud.\n &#34;If it&#39;s a scammer, it is not coming back,&#34; said Ed Mierzwinski, who oversees PIRG&#39;s Federal Consumer Program.\n  &#34;There are no rules that protect you very well at all when your money goes out of your account and into somebody else&#39;s account,&#34; he said.\n  Krafka said he reached out to his bank to get the money back, but was told they couldn&#39;t help him.\n   &#34;I was surprised that there was no recourse and that once it&#39;s done, it&#39;s done and there&#39;s nothing you can do,&#34; the professional musician said.\n Zelle would not comment on Krafka&#39;s case, but said its top priority is &#34;protecting consumers from scams and fraud.&#34; The company provides a  comprehensive list of recommendations on its website for consumers to protect themselves.\n Cash App has a help center for consumers online and on their mobile app as well as a 7-day  customer service phone number, and encourages people, &#34;If you believe you have fallen victim to a scam, you should contact Cash App Support through the app or website immediately.&#34; They also provide articles on  recognizing and avoiding scams on their site.\n Venmo and Paypal urge consumers who think they&#39;ve  fallen victim to a scam to &#34;contact Customer Support directly.&#34; They provide resources for what to look out for and how to report it  on their website.\n &#34;We also recommend that customers contact  spoof@paypal.com to share information on suspected spam. Our dedicated security team will review the information and take action as needed,&#34; the company site reads.\n All of the app companies told CBS News they work to stop bad actors and have processes in place to help flag scams. They also warn consumers to be vigilant, and only send money to people they know — not to strangers.", "posttime": "2021-06-24 22:14:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "消费者,mobile", "title": "随着消费者克制的消费者，对移动支付的投诉飙升300％ ", "title_en": "Complaints against mobile payment apps surge 300% as consumers get scammed", "transed": 1, "url": "https://www.cbsnews.com/news/venmo-payal-zelle-cashapp-scams-mobile-payment-apps/", "via": "", "real_tags": ["消费者", "mobile"]}, {"category": "", "categoryclass": "", "imagename": "82db64e7c0b83afe87de1d4858b5c701.jpg", "infoid": 1067975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最综合的分子研究尚未对Covid-19死亡的大脑，提出了一个潜在的答案：为什么疾病的人经常发展神经系统？\n 在回答这个未知的过程中，研究人员出土了一系列新问题。\n 严重的Covid-19案例可以对一个人的身体造成严重破坏。该疾病可以影响肾脏，肺，心脏和至关重要的脑功能。多达80％的人与Covid-19报告癫痫发作，脑雾和抑郁等神经系统问题。在病毒清除身体作为“长Covid的症状”，这些条件可以很长。\n 尽管住院的Covid-19患者的令人惊讶的高百分比，但在这种残酷的过程中大脑究竟在大脑中究竟发生了更低。\n 如何在德国斯坦福医学院和萨尔兰大学进行研究人员研究了8人死于Covid-19的脑组织，并将这种组织与14个对照的大脑进行了比较。\n 尽管有的事实上，没有一个患者在死亡前报告了神经系统障碍的临床症状，但研究人员发现患者脑组织中的“炎症的深刻分子标记”。他们的调查结果于周一在杂志上发表。\n 这些标记如此深刻，研究团队报告他们是那些在死于阿尔茨海默病和帕金森病等神经变性疾病的人中所期望的人。令人振奋地，研究人员没有发现大脑中病毒本身的任何证据。 \n如果SARS-COV-2，导致Covid-19的病毒是或仍然存在于受感染者的大脑中，是科学和医学界的争论问题。一些研究，如2020年预先打印纸张检查已故患者，已发现大脑中病毒的痕迹。其他人，如2020纸，其中检查了两名Covid-19和神经系统症状的患者，没有。\n 确定病毒是否存在于大脑中是重要的，因为它可以帮助研究人员了解它是否是病毒本身 - 或者身体对病毒的免疫应答 - 这导致损坏。这种理解对于在治疗方面做出最好的决定至关重要。\n  在1920年9月出版的一篇本质上的文章中，利物浦大学神经科医生的本笃·迈克尔解释了寻找这些神经病疾病发展的机制的重要性。\n “如果这是中枢神经系统的直接病毒感染，这些是我们应该针对Remdesivir或其他抗病毒的患者，”他说。 “如果病毒不在中枢神经系统中，也许病毒是透露的身体，那么我们需要用抗炎疗法治疗。”\n 这项新研究背后的研究人员的新研究人员从已故的Covid-19患者中取样的脑组织和对照组的脑组织中培养了65,309个细胞。它们记录了每种细胞中数千基因的激活水平。\n 在每种情况下，从Covid-19患者采取的主要细胞类型中数百种基因的激活水平明显不同于对照。其中许多基因与炎症反应有关。\n 结合研究人员在样品中没有发现病毒的任何证据的事实，这表明它是至少部分地对神经病症负责的免疫应答。 \n研究人员还发现脑皮层中的违规行为;大脑的面积涉及行政功能，如决策和记忆。\n 在死于Covid-19的患者中，从脑皮质的最外层取出的样品显示分子变化。这些变化表明脑信号的改变通常与阿尔茨海默病和其他神经变性条件相关。\n  研究人员发现了一种免疫反应可能对与Covid-19：T细胞相关的一些神经效应负责的另一种线索。\n 在死亡的Covid-19患者的大脑中，T细胞比在对照大脑中的大量丰富得多。这是有道理的：丰富的T细胞不是在健康大脑中发现的东西。\n 逆分析 - 鉴于已知一种过度活跃的免疫应答是可怜的Covid-19结果的原因之一，如果延伸到大脑的反应，它会有意义，最终导致炎症变化。\n 但需要做更多的工作来确定免疫反应如何导致这些显着的反应以及更好地了解大脑上的病毒直接作用。\n 本研究中最引人注目的，仍然是未解释的，这项研究的各个方面是Covid-19患者的患者 - 他的大脑如此巨大，不同于对照的患者 - 没有报道临床神经症状。在全球拥有超过17900万个Covid-19案例，这是非常重要的是，我们完全理解这种病毒可以对我们的身体做些什么。 ", "note_en": "The most comprehensive molecular study yet of the brains of people who died of  Covid-19 has put forth a potential answer to a mystery: Why people with the disease so often develop  neurological conditions?\n In the process of answering this unknown, the researchers unearthed a slew of new questions.\n Serious cases of Covid-19 can  wreak havoc on a person’s body. The disease can affect the kidneys, lungs, heart, and crucially,  brain function. As many as  80 percent of people hospitalized with Covid-19 report neurological issues like seizure disorders, brain fog, and depression. These conditions can persist long after the virus has cleared the body as symptoms of “ long Covid.”\n Despite the staggeringly high percentage of hospitalized Covid-19 patients with neurological conditions, what exactly goes on in the brain during this brutal process has been less clear.\n How the discovery was made — Researchers at the Stanford School of Medicine and Saarland University in Germany examined the brain tissue of eight people who died of Covid-19 and compared this tissue to the brains of 14 controls.\n Despite the fact that none of the patients reported clinical signs of neurological impairment prior to their death, the researchers  found “profound molecular markers of inflammation” in the patients’ brain tissue. Their  findings were published Monday in the journal  Nature.\n These markers were so profound, the study team reports they’re akin to what you’d expect to see in the brains of people who died of neurodegenerative diseases like  Alzheimer’s Disease and  Parkinson’s Disease. Bafflingly, the researchers did not find any evidence of  the virus itself in the brain.\n  Whether or not SARS-CoV-2, the virus that causes Covid-19, becomes or remains present in the brains of people who become infected is a debated issue in the scientific and medical community. Some studies, like this 2020  pre-print paper examining deceased patients, have found traces of the virus in the brain. Others, like this  2020 paper in which two patients with Covid-19 and neurological symptoms are examined, have not.\n Determining whether or not the virus is present in the brain is important because it can help researchers understand whether or not it is the virus itself — or the body’s immune response to the virus — that is causing the damage. This understanding is critical for making the best decision when it comes to treatment.\n  In an article published in  Nature in September 2020, Benedict Michael, a neurologist at the University of Liverpool,  explained the importance of finding the mechanism by which these neurological conditions develop.\n “If this is direct viral infection of the central nervous system, these are the patients we should be targeting for remdesivir or another antiviral,” he said. “Whereas if the virus is not in the central nervous system, maybe the virus is clear of the body, then we need to treat with anti-inflammatory therapies.”\n What’s new — Using “ single-cell RNA sequencing,” the researchers behind this new study took 65,309 cells from brain tissue sampled from the deceased Covid-19 patients, as well as controls. They recorded the activation levels of thousands of genes in each cell.\n In every case, the activation levels of hundreds of genes in major cell types taken from Covid-19 patients were markedly different from the controls. Many of those genes are associated with inflammatory responses.\n Combined with the fact that the researchers couldn’t find any evidence of the virus in the samples, this suggests it is the  immune response that is at least partially responsible for the neurological conditions.\n The researchers also found irregularities in the cerebral cortex; the area of the brain involved in  executive functioning like decision making and memory.\n In patients who died of Covid-19, samples taken from the outermost layers of the cerebral cortex showed molecular changes. These changes suggest alterations in brain signaling typically associated with Alzheimer’s Disease and other  neurodegenerative conditions.\n  The researchers found another clue that immune response may be responsible for some of the neurological effects associated with Covid-19:  T-cells.\n In the brains of deceased Covid-19 patients, T-cells were much more abundant than they were in the control brains. This makes sense: An abundance of T-cells is not something typically found in a healthy brain.\n The  Inverse analysis — Given that an  overactive immune response is known to be one of the causes of poor Covid-19 outcomes, it would make sense if that response extended to the brain, ultimately causing inflammatory changes.\n But more work needs to be done to find out precisely how the immune response causes these marked reactions as well as a better understanding of the virus’ direct role, if any, on the brain.\n One of the most striking, and still unexplained, aspects of this study is how the Covid-19 patients — whose brains were so vastly and distinctively different from the controls — had no reported clinical neurological symptoms. With more than 179 million cases of Covid-19 worldwide, it is vitally important that we understand exactly what contracting this virus can do to our bodies.", "posttime": "2021-06-24 22:13:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "分子,similar,大脑", "title": "Covid-19的大脑：分子变化与阿尔茨海默病相似 ", "title_en": "Brain on Covid-19: Molecular changes appear similar to Alzheimer's disease", "transed": 1, "url": "https://www.inverse.com/mind-body/this-is-your-brain-on-covid19", "via": "", "real_tags": ["分子", "similar", "大脑"]}, {"category": "", "categoryclass": "", "imagename": "a28a0e440f7ca21509504d45ffaec378.jpg", "infoid": 1067973, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最新的上诉法院裁决是英国的第四次判决，支持提供的争夺者，即其乘客在中央仲裁委员会和在高等法院审判之后的判决。\n 按需食品交付平台运营不同的GIG模型，以乘坐巨型巨型优步 - 相比之下，这一点未能阻止英国法院判断其司机成为工人而不是自雇承包商。\n  例如，提供乘坐乘客使用替代品来实现对实践限制限制的转变。并解释就业法究竟适用于究竟涉及完全这样的细节，因为为平台工人提供了灵活性水平。\n  尽管多年来，尽管有一系列法律丢失兑换，但IWGB并没有放弃其战斗。最近倾向于集体谈判问题，并寻求挑战平台巨头的欧洲人权公约的立场 - 争论骑手有权形成或加入工会的合法权利。\n 但是，对于这一争论来说，这一点没有太多的成功。\n 今天，英国上诉法院驳回了其最新的上诉 - 裁决，骑手不会属于欧洲人权公约所载的工会自由权利的范围。\n 虽然法院确实表明骑手确实落在“根据eCohr”第11条“第11条”下的“更普遍的协会自由权”下降。 \n最后，法官还提出了一个指出，其他演出的经济法律挑战可能具有不同的结果，写作：“可能认为演出经济中的人特别需要组织作为工会的权利。所以我非常接受，可能还有其他情况，在不同的事实和更广泛的可用参数中，不同的结果可能会发生。“\n IWGB的总统Alex Marshall在裁决的这一要素中扣押 - 评论声明：\n “判决承认，骑手将从组织中统一组织，以代表他们的兴趣，并承认判决中达成的结论可能似乎是表现直观的。我们现在将考虑我们的法律职位，但有一件事是肯定的：我们将继续在数量中增长并在街道上战斗，直到送达这些关键的工人英雄他们的支付和条件超过应得的支付和条件。“\n 在进一步的评论中，Marshall袭击了为骑手提供的态度 - 声称它已经试图“沉默”他们的声音并否认他们谈判更好的术语的机会：\n “交付快递员一直在致力于大流行的前线，而公众甚至被雇主宣布英雄，他们一直在越来越不公平和不安全的工作条件下工作。他们收到了他们的习惯努力的奖励？交付持续投资数千英镑的诉讼，沉默工人的声音，否认他们有机会谈判更好的条款和条件。最近由调查新闻局透露骑手的调查，骑手每小时的2英镑。这是如果他们真的是自己的老板，那么这类工人会接受吗？看来，当送达灵活性和成为自己的老板时，它就谈到了选择何时在不安全的条件下选择贫困工资的灵活性。“\n  “今天是提供骑手的好消息，并标志着一个重要的里程碑。英国法院现已测试并维持交付乘客的自雇人士状态四次。\n “我们向骑手的信息很清楚。我们将继续向您努力按照您的需求工作，我们将继续倾听您的倾听并回应最重要的事情。 \n“SupertoOO的模型提供了真正的灵活性，这些灵活性只与自营职业兼容，为骑手提供他们告诉我们价值的工作。 那些宣传骑手的灵活性的活动不会为绝大多数车手发来，并寻求强加一种骑手不想要的工作方式。 送达将继续为像我们这样的公司提供竞争，以便能够提供自营职业的全部灵活性以及更大的利益和更多的安全性。“ ", "note_en": "The latest appeals court ruling is the fourth judgment in the UK that supports Deliveroo’s contention that its riders are self-employed, following earlier judgments by the Central Arbitration Committee and two at the High Court.\n The on-demand food delivery platform operates a different gig model to ride-hailing giant Uber — which has, by contrast, failed to prevent UK courts from  judging its drivers to be workers not self-employed contractors.\n  Deliveroo, for example, allows riders to use a substitute to fulfil a shift with only limited restrictions on the practice. And the interpretation of how exactly employment law applies typically hinges on exactly such nuanced details as the level of flexibility being offered to platform workers.\n  Despite a string of legal loses against Deliveroo over the years, the IWGB did not give up its fight. Most recently honing in on the issue of collective bargaining, and seeking to challenge the platform giant’s stance under the European Convention on Human Rights — by arguing riders have a legal right to form or join a union.\n It hasn’t had much success with this line of argument against Deliveroo either, though.\n And today the UK Court of Appeal dismissed its latest appeal — ruling that riders do not fall under the scope of the trade union freedom right set out in the European Convention of Human Rights.\n Although the Court did suggest that riders do fall under “the more general right of freedom of association under article 11 [of the ECoHR]”.\n In conclusion the judges also make a point of noting that other gig economy legal challenges may have a different outcome, writing that: “It may be thought that those in the gig economy have a particular need of the right to organise as a trade union. So I quite accept that there may be other cases where, on different facts and with a broader range of available arguments, a different result may eventuate.”\n The IWGB’s president, Alex Marshall, seized on this element of the ruling — commenting in a statement:\n “The judgment recognises that riders would benefit from organising collectively to represent their interests and admits the conclusion reached in the judgment might seem counter intuitive. We will now consider our legal position, but one thing is for sure: We will continue to grow in numbers and fight on the streets until Deliveroo give these key worker heroes the pay and conditions they more than deserve.”\n In further remarks, Marshall attacked Deliveroo’s stance toward riders — claiming it has sought to “silence” their voices and deny them opportunities to negotiate better terms:\n “Deliveroo couriers have been working on the frontline of the pandemic and whilst being applauded by the public and even declared heroes by their employer, they have been working under increasingly unfair and unsafe working conditions. The reward they have received for their Herculean effort? Deliveroo continuing to invest thousands of pounds in litigation to silence workers’ voices and deny them the opportunity to negotiate better terms and conditions. A recent investigation by the Bureau of Investigative Journalism revealed riders were making as little as £2 per hour. Is this the kind of pay workers would accept if they really were their own boss? It appears that when Deliveroo talk about flexibility and being your own boss, it is talking about the flexibility of choosing when to make poverty wages and work in unsafe conditions.”\n  “Today is good news for Deliveroo riders and marks an important milestone. UK courts have now tested and upheld the self-employed status of Deliveroo riders four times.\n “Our message to riders is clear. We will continue to back your right to work the way you want and we will continue to listen to you and respond to the things that matter to you most.\n “Deliveroo’s model offers the genuine flexibility that is only compatible with self-employment, providing riders with the work they tell us they value. Those campaigning to remove riders’ flexibility do not speak for the vast majority of riders and seek to impose a way of working that riders do not want. Deliveroo will continue to campaign for companies like ours to be able to offer the full flexibility of self employment along with greater benefits and more security.”", "posttime": "2021-06-24 21:31:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "击败,defeats,骑手", "title": "交付击败英国法院的另一名工人权利挑战 ", "title_en": "\n\t\t\t\tDeliveroo defeats another workers’ rights challenge in UK courts\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/deliveroo-defeats-another-workers-rights-challenge-in-uk-courts/", "via": "", "real_tags": ["击败", "defeats", "骑手"]}, {"category": "", "categoryclass": "", "imagename": "dff31dc319c0348a70792d3fbc422033.jpg", "infoid": 1067972, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Kodiak将使用资金为其自动驾驶技术堆栈构建安全案例，因此它可以更快地商业化。它还致力于招聘新的人才，并扩大其卡车舰队，并具有至少加倍每年运营的车辆数量的目标。该起始公司目前在德克萨斯州的商业路线与加利福尼亚州的山景中的商业路线之间有10辆卡车。\n 该交易条款未披露。 BMW I Ventures通常投资能够为BMW的当前和未来业务提供解决方案，但Kodiak的首席执行官和联合创始人Don Burnette告诉TechCrunch，BMW的投资纯粹是财务而不是战略性的，这意味着两者之间没有技术伙伴关系。\n  这项新的投资仅仅是一个星期的胎儿普利司通宣布在科迪亚克宣布少数民族股权。这笔交易背后的财务状况也没有透露。迄今为止，Kodiak公开宣布从其系列A系列的资金宣布为4000万美元，而且伯特特表示启动以来起始了几项额外投资。\n  Burnette还分享了该公司计划，以规模达到无意识的行动，不到10％的Wathmo公开提高到目前为止 -  57亿美元 - 占TusiMple总现有筹款的57亿美元 - 约为19.4亿美元，包括它所提出的金钱它的IPO。这让我们留下了大约5亿美元的数字。\n “这是我们认为我们需要驾驶的金额的总额，这是因为我们认为我们一直是一个更高效的公司，直到这一点，我们将继续更高效，”燃烧。\n BMW I Ventures资金将最终构成Kodiak系列B的部分。通过这一最新投资，该公司并不试图进一步发展其自动驾驶能力或功能，而是希望建立其安全案例并证明这一点Burnette说，它的系统可以在没有船上的驾驶员处理道路。\n “我们正在朝着4级自治系统建立，但我们仍然有一个座位在座位上始终始终监控我们的系统，”伯伯士说。 “今天，我们在技术上是一个2级系统，这对于那里的其他人来说是真实的。” \n具有人类驾驶员监督的车辆，如转向，制动和加速度支持，以及车道定心和自适应巡航控制的东西，如汽车工程师（SAE）的2级自主权的定义。等级4表示车辆可以在没有人为干预的情况下处理某些条件下驾驶的所有方面。\n  Kodiak表示正在取得进展。 1月份，它宣布其Kodiak驱动程序实现了“无脱离免费交付”（意味着自治系统在从达拉斯到休斯顿的商业路线期间在商业路线期间出于安全原因关闭）。该公司一直在达拉斯测试和运营设施运行这条路线两年，并表示现在已经实现了一定程度的成熟度，系统可以处理高速公路抛出的任何东西。\n “我们正在做出非常复杂和先进的机动，而不仅仅是处理合并和削减和划线和繁重的交通，也是更细致的挑战，如识别在路边拉过来的车辆，”布尔特。 “我们的系统可以自动识别，然后根据法律要求自动缩小，或者轻推离该对象以使其更加空间。如果有车道，它也可以考虑制造车道改变，一种方法在侧面上的停滞车辆更加间隙，这正是人类驱动。“\n 为了达到Kodiak可以证明其技术实际上比人类的驾驶员更安全，因此适合在以规模的商业上运营，启动必须在模拟环境中推动其总线，在私有封闭轨道上的结构化测试，在现实世界驾驶中。\n Burnette表示，Kodiak是唯一没有将一种类型传感器指定为“初级”的公司，而是采取全面的方法，这意味着它不是LIDAR-First或Vision-First公司。 Tesla的Ai Andrej Karpathy最近透露了该公司的新超级计算机，旨在实现视野的方法，但根本不同意这种方法。\n “我们相信这些不同的方式中的每一个都有优势和劣势，我们的目标是利用这些优势，并涵盖与其他方式的弱点，因此我们创建了一种传感器融合算法，使我们能够考虑哪种传感器算法有利的是他们给我们最具可用信息的时刻，“伯伯州说。\n Kodiak不使用HD映射，因此其卡车在路上实时看到，这使得Kodiak驱动程序在改变道路状况或环境时可以灵活。该系统使用由Kodiak的卡车收集的数据以及由其工程师设计的场景进行培训，并且数据使用Scale AI自动标记，这是Kodiak能够保持成本的方式之一，Burnette说。 \nKodiak的团队从谷歌的原创自行车团队，优步，Lyft和其他值得注意的科技公司的繁荣。 Burnette表示，BMW I Ventures对公司的投资来到了一个彻底的审查过程中，该公司派出了自主驾驶专家并挖掘了团队的专业知识和技术。 ", "note_en": "Kodiak will use the funds to build out a safety case for its self-driving tech stack so it can more quickly commercialize. It will also work on hiring fresh talent and expanding its truck fleet, with a stated goal of at least doubling the number of vehicles it operates each year. The startup currently has 10 trucks in rotation between its commercial route in Texas and its test pilot in Mountain View, California.\n The terms of the deal were not disclosed. BMW i Ventures usually invests in companies that can provide solutions to BMW’s current and future business, but Kodiak’s CEO and co-founder Don Burnette told TechCrunch that BMW’s investment was purely financial and not strategic, meaning there is currently no technical partnership between the two.\n  This new investment comes just a week after tire-maker   Bridgestone announced a minority stake in Kodiak . The financials behind that deal were not revealed either. To date, Kodiak has publicly announced $40 million in funding from its Series A, and Burnette says the startup has had several additional investments since then.\n  Burnette also shared the company’s plans to achieve driverless operations at scale for less than 10% of what Waymo has publicly raised to date –   $5.7 billion – and less than 25% of TuSimple’s total existing fundraise –  about $1.94 billion, including the money it raised through its IPO. That leaves us with a number roughly around $500 million.\n “That’s the total amount of money that we think we need to get to driverless, and that’s because we think we’ve been a much more efficient company up until this point, and we will continue to be much more efficient going forward,” said Burnette.\n The BMW i Ventures funding will eventually make up part of Kodiak’s Series B.  With this latest investment, the company isn’t trying to further develop its self-driving capabilities or features, but rather it wants to build out its safety case and prove that its system can handle the road with no driver on board, says Burnette.\n “We are building toward a Level 4 autonomy system, but we still have a driver in the seat that’s actually monitoring our system at all times,” said Burnette. “Today, we are technically a Level 2 system, which is true for just about everybody else out there.”\n Vehicles with a human driver supervising operations such as steering, brake and acceleration support, as well as things like lane centering and adaptive cruise control fit under the   Society of Automobile Engineer’s (SAE)  definition of Level 2 autonomy. Level 4 means the vehicle can handle all aspects of driving in certain conditions without human intervention.\n  Kodiak says it’s made progress. In January it announced its Kodiak Driver achieved “disengagement-free deliveries” (meaning the autonomous system didn’t have to be switched off for safety reasons) during a commercial route from Dallas to Houston. The company has been running this route out of its Dallas testing and operations facility for two years, and says it’s now achieved a level of maturity where the system can handle anything the highway throws at it.\n “We’re doing really complex and advanced maneuvers, not just handling obvious things like merges and cut-ins and heavy traffic, but also more nuanced challenges like identifying vehicles that are pulled over on the side of the road,” said Burnette. “Our system can automatically identify that and then slow down as required by law, or nudge away from that object to give it more space. It can also consider making a lane change if a lane is available, a way to give even more clearance to the stalled vehicle on the side, and this is exactly how humans drive.”\n To get to the point where Kodiak can prove its tech is actually safer than a human driver, and thus suitable for operating commercially at scale, the startup has to build up its total miles driven in simulated environments, structured testing on a private closed track, and in real world driving.\n Burnette says Kodiak is the only company that doesn’t designate one type of sensor as ‘primary,’ and rather takes a comprehensive approach, meaning it’s not a lidar-first or vision-first company. Tesla’s head of AI  Andrej Karpathy recently revealed the company’s new supercomputer which takes a vision-only approach, but Burnette fundamentally disagrees with that method.\n “We believe that each of these different modalities have strengths and weaknesses, and our objective is to take advantage of those strengths and cover the weaknesses with other modalities, and so we’ve created a sensor fusion algorithm that allows us to consider which sensors are advantageous in the moments where they give us the most usable information,” said Burnette.\n Kodiak doesn’t use HD mapping either, so its trucks see in real time on the road, which allows the Kodiak Driver to be flexible when it comes to changing road conditions or environments. The system is trained using data collected by Kodiak’s trucks, as well as on scenarios devised by its engineers, and that data is   auto-labeled using Scale AI , which is one of the ways Kodiak is able to keep down costs, says Burnette.\n Kodiak’s team hails from Google’s original self-driving team, Uber, Lyft and other notable tech companies. Burnette says BMW i Ventures’ investment in the company came after a thorough vetting process in which the firm sent over their autonomous driving experts and dug into the team’s expertise and tech.", "posttime": "2021-06-24 21:31:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,ventures,kodiak", "title": "BMW I Ventures投资自动卡车技术公司Kodiak机器人 ", "title_en": "\n\t\t\t\tBMW i Ventures invests in autonomous truck technology company Kodiak Robotics\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/bmw-i-ventures-invests-in-autonomous-truck-technology-company-kodiak-robotics/", "via": "", "real_tags": ["机器人", "ventures", "kodiak"]}, {"category": "", "categoryclass": "", "imagename": "7080159f14c864de7c415d92fdf1fd1b.png", "infoid": 1067971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如沃尔玛的杂货送货服务继续繁荣，为亚马逊和Instacart等公司构成竞争，沃尔玛使用的技术也扩展了。今天，沃尔玛共享有关如何培训其AI在线杂货订单中的智能替代品的信息。\n 将这项技术带入杂货交付不是任何手段的新颖。最后，沃尔玛据报道，它习惯于如何确定其快递服务的资格，这是当时的全新。一年的美国冠状病毒爆发，Instacart工程师报告说，他们每天蹲下“Petabytes即可预测杂货店的东西，甚至需要多长时间去寻找停车。”\n  那么是什么让沃尔玛的AI用于杂货替代品独特？据沃尔玛全球技术执行副总裁Srini Venkatesan称，沃尔玛可以用来教导其AI的纯粹数量。超过2亿人在沃尔玛店内店铺和每周在线购买超过150,000多种不同的杂货产品。 AI使用该数据来预测消费者行为，偏好和需求。\n “科技技术我们建造了深入学习AI考虑数百个变量 - 大小，类型，品牌，价格，聚合购物者数据，个人客户偏好，当前库存等 - 实时确定最佳下一个可用物品，”解释了Venkatesan 。 “然后，它抢先地要求客户批准替代物品或让我们知道他们不想要它，这是一个重要的信号，即反馈我们的学习算法，以提高未来建议的准确性。”\n  而不是要求个人购物者做出如何替代樱桃酸奶的决定（你从同样品牌那里得到了不同的味道，而且来自更昂贵的品牌的同样的味道，等等，AI可以选择他们。沃尔玛去年开始开发该算法，并在此时，以来，客户接受换算已得到改善。\n “在算法推出之前，我们在左右90％左右，”Venkatesan说。 “我们现在达到97％至98％。”\n 在去年，沃尔玛将其数量的个人购物者翻了一番，以超过170,000名工人。为订单拾取器启用了大约3,750家商店，并启用3,000家商店进行交付，其占人口的68％。今年早些时候，沃尔玛将在其快递服务上汇总了35美元的订单，是亚马逊素质的竞争对手。 ", "note_en": "As Walmart’s grocery delivery services have continued to boom, posing competition to companies like Amazon and Instacart, the tech that Walmart uses has expanded too. Today, Walmart shared information about how it’s training its AI to make smarter substitutions in online grocery orders.\n Bringing this technology to grocery delivery isn’t novel by any means. Last May, Walmart reported how it  used to AI to determine eligibility for its Express delivery service, which was  brand new at the time. A year into the United States’ coronavirus outbreak,  Instacart engineers reported that they crunched “petabytes daily to predict what will be on grocery shelves and even how long it will take to find parking.”\n  So what makes Walmart’s AI for grocery substitutions unique? According to Srini Venkatesan, an Executive Vice President at Walmart Global Tech, it’s the sheer quantity of data that Walmart can use to teach its AI. Over 200 million people shop at Walmart in-store and online each week for more than 150,000 different grocery products. The AI uses that data to predict consumer behavior, preferences, and needs.\n “The tech we built uses deep learning AI to consider hundreds of variables — size, type, brand, price, aggregate shopper data, individual customer preference, current inventory and more — in real time to determine the best next available item,” explained Venkatesan. “It then preemptively asks the customer to approve the substituted item or let us know they don’t want it, an important signal that’s fed back into our learning algorithms to improve the accuracy of future recommendations.”\n  Rather than asking a Personal Shopper to make a quick decision about how to substitute for cherry yogurt (do you get a different flavor from the same brand, the same flavor from a more expensive brand, and so on), the AI makes that choice for them. Walmart started developing this algorithm last year, and in the time since, customer acceptance of substitutions has improved.\n “We were at about 90% before this algorithm rolled out,” said Venkatesan. “We are now around 97% to 98%.”\n In the last year, Walmart doubled its number of Personal Shoppers to over 170,000 workers. About 3,750 stores are enabled for order pickup, and 3,000 stores are enabled for delivery, which covers 68% of the population. Earlier this year, Walmart  dropped the $35 order minimum on its Express delivery service, a competitor to Amazon’s  Prime Now.", "posttime": "2021-06-24 21:31:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ai,沃尔玛", "title": "沃尔玛的AI对杂货店交付越来越聪明 ", "title_en": "\n\t\t\t\tWalmart’s AI is getting smarter about grocery delivery\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/walmarts-ai-is-getting-smarter-about-grocery-delivery/", "via": "", "real_tags": ["ai", "沃尔玛"]}, {"category": "", "categoryclass": "", "imagename": "1bea0afaef71dae802c84a94038135f2.jpg", "infoid": 1067970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Accepti.inc是一家基于丹佛的公司，该公司试图在房地产科技中创建一个新的类别。为了帮助扩展其数字抵押贷款平台，本公司今天宣布，它已获得9000万美元的债务和股权 - 债务7800万美元和1200万美元的公平。信号消防领导其融资的股权部分，其中还包括来自现有的种子投资者Y组合者和DN Capital的参与。\n Accept.inc将自己描述为ilder，或者是一个“支持技术的贷款人”，为人们提供一种方法，以便在抵押贷款后提交房屋内的全现金优惠。\n  使用其平台，买方首先得到合格，然后可以开始寻找落在他或她被批准的金额下的房屋。他们可以购买更昂贵的家，但是任何金额以上他们被批准的东西都必须从口袋里出来。从历史上看，大多数买家都不知道他们必须在他们在特定的家庭提出要约之前支付袋子，并在他们为房屋支付的价格中提出评估。在这些情况下，买方必须咳出口袋的差异。用接受。inc。，它的执行局，买家提前了解他们被批准的多少，并且可以花在一个新的家中“所以以后没有惊喜。”\n 信号火式创始合作伙伴和CTO Ilya Kirnos描述了接受.inc为“第一和唯一的ilder”。\n 他指出，由于它是一个贷方，接受。inc不会通过在全现金提供空间中的其他一些人这样的地方收费购买者费用来赚钱。\n “与”替代的“替代性”不同，“接受。inc inc arch现金购买房子然后卸下抵押贷款起源和冠军，意思是卖家，他们的代理商没有额外的服务费用，”他告诉TechCrunch 。\n 相反，伊瓦尔代替卖家在网上报名的卖家，经常修正和销售这些房屋，然后帮助人们用所有现金购买不同的家庭。他们还通过收取交易费用来赚钱。一家公司在空间内运营，包括成熟的球员，如开托和Zillow和较新的球员，如家庭主妇。 \n自2016年开始以来，Accument.inc表示，它帮助了数千人的买家，代理商和卖家在家中的“数亿美元”。据首席执行官和联合创始人亚当波拉克称，该公司在2020年举行了“14X”增长率，从6月20日至6月到6月2021年，它在其团队团队和交易数量和收入数量方面取得了“10X”的增长。 Accept.inc希望使用其新资本来构建这种势头并满足需求。\n Pollack和Nick Friedman在大学时遇到了，并开始建立接受。inc，目标是“将每个提议转化为现金报价”。这对基本上“失败了两年”，半笑话。\n “我们基本上成为1000种方式的百科全书，帮助人们使全现金优惠无法发挥作用，”他说。\n 该团队在2019年冬天经历了Y组合者，而且在他们创造了ILEND概念时。在ILENDER模型中，公司使用现金购买买家的房子。一旦贷款接受即被发贷款即可关闭，该公司将在不额外的费用或费用中销售给买方“。\n “基本上我们通过这两年了解到的是，你必须垂直整合你的所有核心能力，你不能依靠第三方拥有或管理你的特殊酱汁，”Pollack告诉TechCrunch。 “我们也意识到，如果您将为能够负担抵押贷款的人建立现金提议，您必须使其成为一个完整的BONA FIDE现金报价，而在三天内完成，而不是存在的更好版本。你必须拥有它，并带来它的风险，并对此感到满意。“\n 该货说，他们模型的好处是，买家成为现金买家，卖家可以在短短32小时内接近，代理商“获得保证委员会检查”。\n 弗里德曼说：“我们的使命是每个人都应该在家里拥有平等机会。” “我们不仅想要级别的播放领域，我们希望创建一个新的标准。” \n公司索赔，买家使用Accept.inc使用6-7次频率。 凭借其新资本，它还计划将其团队加倍，并在其丹佛之外的家庭基地外进入新市场。  SignalFire Partner Chris Scoggins认为，接受。inc与其他贷方的焦点不同，因为它的重点是“赢得家庭，而不仅仅是为贷款提供服务，商业模式比市场上的其他球员比其他球员更多的商业模式。  他补充说：“该团队被驱动......为今天丢失的房屋携带者的竞争对手队失去全权现金，”他补充说。 “我们看到了接受的巨大机会成为抵押贷款未来的骨干。” ", "note_en": "Accepti.inc is a Denver-based company that is attempting to create a new category in real estate technology. To help scale its digital mortgage lending platform, the company announced today that it has secured $90 million in debt and equity – with $78 million in debt and $12 million in equity. Signal Fire led the equity portion of its financing, which also included participation from existing seed investors Y Combinator and DN Capital.\n Accept.inc describes itself as an iLender, or a “technology-enabled lender” that gives people a way to submit all-cash offers on a home upon qualifying for a mortgage.\n  Using its platform, a buyer gets qualified first and then can start looking for homes that fall at or under the amount he or she is approved for. They can purchase a more expensive home, but any amount above what they are approved for would have to come out of pocket. Historically, most buyers don’t know that they will have to pay out of pocket until they’ve made an offer on a specific home and an appraisal comes under the amount of the price they are paying for a home. In those cases, the buyer has to cough up the difference out of pocket. With Accept.inc., its execs tout, buyers know upfront how much they are approved for and can spend on a new home “so there are no surprises later.”\n SignalFire Founding Partner and CTO  Ilya Kirnos describes  Accept.inc as “the first and only iLender.”\n He points out that since it is a lender, Accept.inc doesn’t make its money by charging buyers fees like some others in the all-cash offer space.\n “Unlike ‘iBuyers’ or ‘ alternative iBuyers,’ Accept.inc fronts the cash to buy a house and then makes money off mortgage origination and title, meaning sellers, homebuyers and their agents pay no additional cost for the service,” he told TechCrunch.\n IBuyers instead buy  homes from sellers who signed up online, make a profit by often fixing up and selling those homes and then helping people purchase a different home with all cash. They also make money by charging transaction fees. A slew of companies operate in the space including established players such as  Opendoor and Zillow and newer players such as Homelight.\n  Since its 2016 inception, Accept.inc says it has  helped thousands of buyers, agents and sellers close on “hundreds of millions of dollars” in homes. The company  saw ”14x” growth in 2020 and from June 2020 to June 2021, it achieved “10x” growth in terms of the size of its team and number of transactions and revenue, according to CEO and co-founder Adam Pollack. Accept.inc wants to use its new capital to build on that momentum and meet demand.\n Pollack and Nick Friedman met while in college  and started building Accept.inc with the goal of “turning every offer into a cash offer.” The pair essentially “failed for two years,” half-jokes Pollack.\n “We basically became an encyclopedia of 1,000 ways the idea of helping people make all-cash offers   wouldn’t  work,” he said.\n The team went through Y Combinator in the winter of 2019 and that’s when they created the iLender concept. In the iLender model, the company uses its cash to buy a house for buyers. Once the loan with Accept.inc is ready to close, the company sells back the house to the buyer “at no additional cost or fees.”\n “Basically what we learned through those two years is that you have to vertically integrate all of your core competencies, and you can’t rely on third parties to own or manage your special sauce for you,” Pollack told TechCrunch. “We also realized that if you’re going to build a cash offer for anyone who could afford a mortgage, you’ve got to make it a full bona fide cash offer that closes in three days as opposed to a better version of what existed. And you have to own that, and take the risk that comes with it and be comfortable with that.”\n The benefits of their model, the pair say, is that buyers get to be cash buyers, sellers can close in as little as 32 hours, and agents “get a guaranteed commission check.”\n “Our mission is that everyone should have an equal chance at homeownership,” Friedman said. “We not only want to level the playing field, we want to create a new standard.”\n Buyers using Accept.inc win 6-7 times more frequently, the company claims. With its new capital,  It also plans to double its team of 90 and enter new markets outside of its home base of Denver.\n SignalFire Partner Chris Scoggins believes that Accept.inc is different from other lenders in that its focus is on  “winning the home, not just servicing the loan, with a business model that’s 10x more capital-efficient than other players in the market.\n “ The team is driven…to level the playing field for homebuyers who today lose out against all-cash offers from home-flippers and wealthy individuals,” he added. “ We see an enormous opportunity for Accept.inc to become the backbone of the future of mortgage lending.”", "posttime": "2021-06-24 21:30:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "数字,equity,现金", "title": "接受。inc在债务和公平中确保90米，以扩展其数字抵押贷款平台 ", "title_en": "\n\t\t\t\tAccept.inc secures $90M in debt and equity to scale its digital mortgage lending platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/accept-inc-secures-90m-in-debt-equity/", "via": "", "real_tags": ["数字", "equity", "现金"]}, {"category": "", "categoryclass": "", "imagename": "15d1c22eed24cdd07338728d5b3a13f3.jpeg", "infoid": 1067969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Luminar之前曾宣布过沃尔沃的生产交易。但是，当时，Luminar的堆栈将在旗舰车上是可选的 - 这是一个升级，将增加成本。现在，当然，它将内置于每个车辆中。\n 但是，如果客户希望利用公路试点功能，客户仍然需要支付。只有当车辆在高速公路上驾驶时才可用的能力，将驾驶员从循环中放出 - 它们甚至不必主动监控车辆，因为在今天已经在道路上的一些系统中常见，a熟悉该技术的来源告诉TechCrunch。它是系统提供的自主权的最高能力，如果客户想要它，他们将不得不为此付出代价。\n  当条件被验证到安全时，该功能将无线地激活，在新闻稿中表示。客户不需要支付的是一套安全功能，如自动紧急制动和车道保持，目标是汽车事故最常见的原因。\n 这笔交易毫无疑问是Luminar的主要福音。除了更高的生产卷外，公司还将受益于其系统将暴露的数千英里的数千英里 - 有价值的数据，可以送回其自主驾驶堆栈。该系统还将能够无线上空更新，因此驾驶员应该随着时间的推移而越来越聪明'。\n 沃尔沃没有透露高速公路飞行员加载量的成本，也没有在订阅模式中提供或作为一次性购买。但是制造商确实说，所有车辆都将是无监督自动驾驶的“硬件准备”，一旦它可用。 ", "note_en": "Luminar had previously announced  the production deal with Volvo last May. But at that time, Luminar’s stack was going to be optional on the flagship vehicle — an upgrade that would add on cost. Now, it will be built into each vehicle as a matter of course.\n However, customers will still have to pay if they want to take advantage of the Highway Pilot functionality. That capability, which will be available only when the vehicle is driving on a highway, puts the driver out of the loop — they won’t even have to actively monitor the vehicle, as is common in some systems already on the road today, a source familiar with the technology told TechCrunch. It’s the highest capability of autonomy that the system offers, and if customers want it, they will have to pay for it.\n  That functionality will be activated wirelessly when the conditions are verified to be safe, Luminar said in a news release. What customers won’t have to pay for is a suite of safety capabilities, like automatic emergency braking and lane-keeping, that target the most common cause of car accidents.\n The deal is undoubtedly a major boon for Luminar. In addition to higher production volumes, the company will also benefit from the many thousands of driving miles its system will be exposed to — valuable data that it can feed back into its autonomous driving stack. The system will also be capable of wireless over-the-air updates, so drivers should benefit as it grows ‘smarter’ over time.\n Volvo did not reveal how much the Highway Pilot add-on will cost, nor whether it will be available in a subscription model or as a one-time purchase. But the carmaker did say that all vehicles will be “hardware ready” for unsupervised autonomous driving once it’s available.", "posttime": "2021-06-24 21:30:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,旗舰,flagship,功能", "title": "沃尔沃的旗舰电动SUV将带有Luminar的Lidar和软件作为标准 ", "title_en": "\n\t\t\t\tVolvo’s flagship electric SUV will come with Luminar’s lidar and software as standard\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/volvos-flagship-electric-suv-will-come-with-luminars-lidar-and-software-as-standard/", "via": "", "real_tags": ["软件", "旗舰", "flagship", "功能"]}, {"category": "", "categoryclass": "", "imagename": "44dda236b5ce5179709bf04debe92c1f.jpg", "infoid": 1067968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于密歇根州的启动制造霍尔效应等离子体推进器，用于小型和立方体卫星。推进器在整个卫星的寿命（或需要维持其轨道的空间中的任何物体，如空间站）来调整轨道高度，避免碰撞，并且一旦它到达其最有用的终结生活。霍尔推进员使用磁场来电离推进剂并产生等离子体。\n 虽然它们长期以来在太空中使用，但这种推进器对于小型卫星运营商来说主要过于昂贵。 orbion表示，它创造了一种成本效益的生产能力，以满足对低地球轨道发射的初创公司和开发人员不断增长的需求。 orbion首席执行官Brad King在一份声明中表示，该公司审议了合同制造商但最终选择了垂直整合的制造模型。现在，该公司表示，它已经超过了现有的制造空间。\n  国王说，该公司正面临着其极光系统的“前所未有的市场需求”。随着所谓的新空间经济的繁荣，部分地通过减少处理器，组件甚至发射的成本下降，这并不奇怪，有效的内部推进系统的需求并不奇怪。\n  该公司于2019年8月曾提高了920万美元的系列。自此以来，该公司与美国国防部获得了研究伙伴关系，该部门正在测试美国空间系统的弹性。去年9月也与卫星制造商蓝峡谷技术降落了合同。\n 最新的资金循环由美国印度VC公司献上资本合作伙伴领导，额外参与物质影响，Beringea和Wakestream Ventures。\n “太空游戏正在发生变化，”Invenus Capital Partners Investor Kanwal Rekhi在一份声明中表示。 “大卫星正在被多种纳米卫星取代;就像PCS替换了大型机一样。射落正在提供这些纳米卫星的机动性，以进入更精确的轨道，并保持更长的轨道。“ ", "note_en": "The Michigan-based startup manufactures Hall effect plasma thrusters for use in small and cube satellites. Thrusters are used throughout the lifespan of a satellite (or any object in space that needs to maintain its orbit, like the space station) to adjust orbital altitude, avoid collisions, and de-orbit the craft once it has reached the end of its useful life. Hall thrusters use a magnetic field to ionize a propellant and produce plasma.\n While they have long been used in space, this type of thruster has mostly been too expensive for small satellite operators.  Orbion says it has created a cost-effective production capacity to meet the growing demand of startups and developers launching to low Earth orbit. Orbion CEO Brad King said in a statement that the company considered contract manufacturers but ultimately chose a vertically integrated manufacturing model. Now, the company says it has outgrown its existing manufacturing space.\n  The company is facing “unprecedented market demand” for its Aurora system, King said. With the boom of the so-called new space economy, driven in part by the decreased costs of processors, components and even launch, it’s no surprise that there’s been a concurrent uptick in demand for efficient in-space propulsion systems.\n  The company had previously raised a  $9.2 million Series A in August 2019. Since that time, the company secured a  research partnership with the U.S. Department of Defense that’s testing the resiliency of American space systems. Orbion also landed a contract with satellite manufacturer Blue Canyon Technologies last September.\n This most recent funding round was led by the US-India VC firm Inventus Capital Partners, with additional participation from Material Impact, Beringea and Wakestream Ventures.\n “The space game is changing,” Inventus Capital Partners investor Kanwal Rekhi said in a statement. “Large satellites are being replaced by a multitude of nano-satellites; just like the PCs replaced mainframes. Orbion is providing these nano-satellites maneuverability to get into more precise orbits and stay there longer.”", "posttime": "2021-06-24 21:30:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "等离子体,systems", "title": "空间等离子体推进系统的制造商锻造，提高了20万系列B ", "title_en": "\n\t\t\t\tOrbion, manufacturer of in-space plasma propulsion systems, raises $20M Series B\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/orbion-manufacturer-of-in-space-plasma-propulsion-systems-raises-20m-series-b/", "via": "", "real_tags": ["等离子体", "systems"]}, {"category": "", "categoryclass": "", "imagename": "25c681f0b44d9d868a8fef4f6ff1a2ef.jpg", "infoid": 1067967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，经过一年的强劲增长在较大的繁荣中在线视频从Covid-19，纽约的公司正在宣布一轮融资 -  1亿美元 - 扩大其技术，并成为它相信的地方视频是下一个。\n 首都来自一个投资者，LLR合作伙伴，而JW播放器的估值没有披露，我们理解它还没有10亿美元，但快速接近它。尽管在行业中是一个相对安静的球员，但它介绍了公司的高跟鞋。\n  公司的首席执行官和公司联合创始人戴夫（德华州）（以另一个联合创始人命名为初始技术），在接受采访中告诉TechCrunch，即该公司的视频流量流量近200％在最后年，随着现场流动，在此期间增长400％。\n 现在有超过600,000多个应用程序和网站运行JW播放器支持的视频，其中约10,000名高级用户;耐心的休息用软件，奥肯说。\n 他说，这足以让公司在多年来一直有利可图。并且在软件被免费使用的情况下，JW Player正在使用其工具中的一些客户中获得“付费”，包括芝麻街，时间，赫斯特，内幕，IMDB和切尔西足球俱乐部。\n  这是远离JW的早期供电的途中 - 屏幕截图 - 截图上面的屏幕截图 - 但与早期推动者的许多例子相反，这是一个最慢的创新以后创新，JW希望这是它是第一个的事实视频中的移动器并不意味着它将是最后一个预期未来发生的事情。\n  正如公司越来越开始在他们的书面内容上创建工资空间，他们也希望为他们的视频目录做同样的事情，而JW Player希望成为他们的伴侣。这将包括对订阅服务的更多投资，以及一组新的用于个性化视频的工具，并通过广泛的数据提供广告机会，即它已经积累并继续聚集了视频使用情况。 \n该公司拥有一张强大的卡片，为后者的业务播放：那些使用免费版JW Player“支付”公司的人，通过帮助它收集探视视频的洞察。\n 该公司将在现场和按需视频领域进行的另一个领域。 5月，它在这些领域获得了一个基于英国的专家，也建立了DRM解决方案，它已经集成到其平台中。\n 视频现在占所有在线交通的80％，人们通常花费超过2小时的时间观看。虽然其中一些是不可避免的大平台，如youtube，facebook，社交媒体平台，如Instagram，Tiktok和Snapchat，仍然有一个很大的机会，并由JW的喜欢辅助，雕刻在混合中的空间。\n “JW Player一直处于数字视频创新的最前沿，自创始人Jeroen Wijering于2008年创建YouTube的原创视频播放器。今天，该公司提供了数字视频生态系统中最全面的技术，广告和数据分析平台，”大卫路透社说，在一个声明中的LLR合作伙伴的合作伙伴。 “我们期待与JW Player团队合作，因为他们扩展他们的平台并继续提升品牌可以举办的方式，流和货币化视频。” ", "note_en": "Now, after a year of strong growth on the back of the bigger boom in online video from Covid-19, the New York-based company is announcing a big funding round — $100 million — to expand its tech, and to be where it believes video is going next.\n The capital is coming from a single investor,  LLR Partners, and while the JW Player’s valuation is not being disclosed, we understand it’s not quite yet at $1 billion, but fast approaching it. It comes on the heels of the company charting some massive growth, despite being a relatively quiet player in the industry.\n  Dave Otten, the CEO and co-founder of the company (which is named after another co-founder, Jeroen Wijering, who developed the initial technology), told TechCrunch in an interview that the company’s video streaming traffic by nearly 200% over the last year, with live streaming growing 400% in that period.\n There are now over 600,000 applications and sites running video powered by JW Player, with about 10,000 of those premium users; the rest use its software for free, Otten said.\n This is enough of a balance that the company has been profitable for a number of years, he said. And in cases where the software is being used for free, JW Player is getting “paid” in a  Some of the many customers using its tools include Sesame Street, TIME, Hearst, Insider, IMDB and the Chelsea Football Club.\n  It’s a long way away from JW’s early days powering YouTube — screen shot of how it looked above — but contrary to so many examples of early movers being some of the slowest to innovate later on, JW is hoping that the fact that it was a first mover in video does not mean it will be the last to anticipate what is coming in the future.\n  Just as companies have increasingly started to create paywalls around their written content, they are looking to do the same for their video catalogues, too, and JW Player wants to be their partner for this. That will include more investments into subscription services, as well as a a new set of tools for personalizing videos and providing advertising opportunities by way of the extensive data that it has amassed and continues to gather about video usage.\n The company has a strong card to play in its hand for the latter business: those who use the free version of JW Player “pay” the company by way of helping it gather lots of insights into how videos are watched.\n Another area that the company will be doing more is in the area of live and on-demand video. In May, it acquired Vualto, a UK-based specialist in these areas that also builds DRM solutions, which it has already integrated into its platform.\n Video now accounts for a whopping 80% of all online traffic, with people typically spending more than two hours days watching it. While some of that is inevitably going big platforms like YouTube, Facebook, social media platforms like Instagram, TikTok and Snapchat, there remains a big opportunity for others, aided by the likes of JW, to carve out spaces for themselves in the mix.\n “JW Player has been at the forefront of digital video innovation ever since founder Jeroen Wijering created YouTube’s original video player in 2008. Today, the company offers the most comprehensive technology, advertising and data analytics platform in the digital video ecosystem,” said David Reuter, Partner at LLR Partners, in a statement. “We look forward to partnering with the JW Player team as they expand their platform and continue to elevate the way brands can host, stream and monetize video.”", "posttime": "2021-06-24 21:30:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,player,视频", "title": "JW Player在其视频软件周围建立订阅和其他货币化工具100米 ", "title_en": "\n\t\t\t\tJW Player raises $100M to build subscriptions and other monetization tools around its video software\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/24/jw-player-raises-100m-to-build-subscriptions-and-other-monetization-tools-around-its-video-software/", "via": "", "real_tags": ["软件", "player", "视频"]}, {"category": "", "categoryclass": "", "imagename": "f9080d1935624c7f40c694cd5375e932.jpg", "infoid": 1067966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌已将主要隐私变化延迟到其Chrome浏览器，推回计划阻止第三方cookie，直到2023年底，确定如何保护用户，同时为网络发布者提供一种方式来赚钱。\n 去年，搜索巨头表示它会阻止世界＆＃39; S最广泛使用的浏览器接受叫做第三方cookie的短信，这些cookie有助于广告商，发布者和数据经纪人的个人资料，以帮助广告商针对您的目标广告。更改将防止广告商从后来向您的其他网站上显示减肥计划的广告，以防止您访问节食网站。\n   周四，谷歌推动了近两年的推动，允许自己更多的时间开发和测试保留第三方cookie的隐私替代方案，以及网站采取更改。该公司表示，它延迟了更改，将谷歌呼叫其隐私沙箱的哪些调整集合，为广告商和网络上的其他人进行了更好的课程。\n ＆＃34;我们需要以负责任的步伐移动，允许足够的时间讨论正确的解决方案和出版商以及广告业，以迁移他们的服务，＆＃34; Chrome Engineering Director Vinay Goel在博客帖子中说。 ＆＃34;这很重要，避免危害支持自由提供内容的许多网络发布商的商业模式。＆＃34;\n 延迟在强化硅谷巨头压力来修复互联网互联网上。像欧洲的法律和加州消费者隐私法案（CCPA）瞄准谷歌和其他公司想要微调他们提供的广告的数据收集。广告科技产业并不是永远改变课程，因为有人对Chrome的任何人不满意而有富裕的替代品。\n 所有Chrome＆＃39; S顶级竞争对手，包括Apple＆＃39; S Safari，Mozilla＆＃39; S Firefox，Microsoft＆＃39; S Edge and Brave软件＆＃39; s勇敢，在停止跟踪时比谷歌在停止跟踪中采取更具侵略的措施。如果您想坚持Chrome，浏览器扩展如Ghostery，Duckduckgo，Privacy Badger和Ublock Origin，旨在阻止跟踪器。\n 谷歌的一部分＆＃39;首先推动其计划的理由是，移动太快将鼓励跟踪公司使用的饼干跟踪方法而不是饼干。一种这样的方法，指纹识别，使用跟踪器来收集浏览器配置详细信息，例如您的版本＆＃39;重新使用和哪些字体＆＃39; ve下载了。具有足够的这些细节，跟踪器可以准确识别您。 \n谷歌认为，在这个阶段阻止了第三方饼干对使用网络的人来说实际上是糟糕的，因为它驱使跟踪公司涵盖指纹等方法。 ＆＃34;与cookie不同，用户无法清除其指纹，因此无法控制其信息是如何收集或使用的。我们认为这是一个可持续的长期投资，＆＃34; Goel在CNET的声明中说。\n  网站也移动到其他跟踪方法，如需要登录免费内容。这为它们提供了一个非常特定的标识符，用于分析您的行为，并可能与其匹配您的其他网站上的活动。\n 浏览器Don＆＃39; t块第一方cookie，由您网站的运营商设置为您＆＃39;重新访问或广告商提供广告。第一方Cookie帮助您在电子商务购物车中记住的任务，或者让您登录后续访问。但是，对于第三方Cookie阻止的一个广告技术解决方法是将与网站联系起来使用他们的第一方权限。\n 第一方cookie也是谷歌的棘手问题。它具有像搜索和youtube一样的巨型网站，让它设置第一方cookie。它还拥有一个大型在线广告业务，可以从Google＆＃39; cookie和跟踪信息中受益。其他广告公司不具有那种特权的状态，这就是欧洲委员会对谷歌开设反垄断调查的原因，据报道还在审查谷歌和＃39; S Cookie方法。\n 但Goel否认谷歌将获得优势。 ＆＃34;隐私沙箱技术不会对谷歌和＃39;广告产品或谷歌＆＃39;自己的网站，＆＃34提供优惠待遇或优势他告诉CNET。的确，谷歌致力于＆＃34;没有用于谷歌广告产品的数据优势＆＃34;在英国＆＃39;竞争和市场管理局开始调查谷歌广告科技竞争问题。\n 除了最终逐步淘汰第三方饼干外，谷歌正在努力致力于联合学习的队列学习，或絮状物，与广告与大群人相匹配，而不是个人。有了它，浏览器监视您的浏览历史记录，并将您的数千人组成，其中具有与队列相似的行为。注意到，注意到特定的队列正在访问一种类型的网站，然后可以向其他网站上的其他成员展示广告。\n 弗洛夫有其批评者。勇敢反对絮状物，与Vivaldi浏览器一样。电子前沿基金会是一种数字版权非营利组织，说弗洛夫是一个＆＃34;可怕的想法。＆＃34; Mozilla得出结论，弗洛夫让网站＆＃34;学到很多关于你的努力，而不是今天需要消耗。＆＃34; \n谷歌也正在制定絮凝物。 它计划将反馈纳入更改和新一轮测试。 ", "note_en": "Google has delayed a major privacy change to its   Chrome browser, pushing back a plan to  block third-party cookies until late 2023 as it determines how to protect users while providing web publishers a way to make money.\n Last year,  the search giant said it would prevent the world&#39;s most widely used browser from accepting the snippets of text called third-party cookies that help advertisers, publishers and data brokers profile you to help advertisers target ads toward you. The change would prevent an advertiser that recorded your visit to a dieting website from later showing you ads for weight loss programs on other sites, for example.\n   On Thursday, Google pushed that move out by nearly two years, allowing itself more time to develop and test privacy-preserving alternatives to third-party cookies, and for websites to adopt the changes. The company said it had delayed the change, part of a collection of adjustments to what Google calls its  Privacy Sandbox, to chart a better course for advertisers and everyone else on the web.\n &#34;We need to move at a responsible pace, allowing sufficient time for public discussion on the right solutions and for publishers and the advertising industry to migrate their services,&#34; Chrome Engineering Director Vinay Goel said in a blog post. &#34;This is important to avoid jeopardizing the business models of many web publishers which support freely available content.&#34;\n The delay comes amid intensifying pressure on Silicon Valley giants to fix the internet&#39;s privacy problem. Laws like  Europe&#39;s GDPR and the  California Consumer Privacy Act (CCPA) target the data collection that Google and other companies want for fine tuning the advertisements they deliver. The ad tech industry doesn&#39;t have forever to change course because anyone dissatisfied with Chrome&#39;s pace has abundant alternatives.\n All Chrome&#39;s top rivals, including  Apple&#39;s Safari,  Mozilla&#39;s Firefox,  Microsoft&#39;s Edge and  Brave Software&#39;s Brave, take more aggressive measures at stopping tracking than Google. If you want to stick with Chrome, browser extensions like  Ghostery,  DuckDuckGo,  Privacy Badger and  uBlock Origin, are designed to block trackers.\n One part of Google&#39;s rationale for pushing back its plan is that moving too fast will encourage tracking companies to use sneakier tracking methods than cookies. One such method, fingerprinting, uses trackers to gather browser configuration details, such as the version you&#39;re using and which fonts you&#39;ve downloaded. With enough of those details, trackers can identify you accurately.\n Google believes blocking third-party cookies at this stage is actually bad for people using the web because it drives tracking companies to covert approaches such as fingerprinting. &#34;Unlike cookies, users cannot clear their fingerprint, and therefore cannot control how their information is collected or used. We don&#39;t think that&#39;s a sustainable long term investment,&#34; Goel said in a statement to CNET.\n  Websites also are moving to other tracking methods like requiring logins for free content. That provides them a very specific identifier for profiling your behavior and potentially matching it to your activity on other sites that know it.\n Browsers don&#39;t block first-party cookies, which are set by the operator of the website you&#39;re visiting or advertisers contributing ads. First-party cookies help with tasks like remembering what&#39;s in your e-commerce shopping cart or keeping you logged in for subsequent visits. One ad tech workaround for third-party cookie blocking, though, is to tie in with websites to use their first-party privileges.\n First-party cookies also are a thorny issue for Google. It has giant websites like search and YouTube that let it set first-party cookies. It also has a big online advertising business that can benefit from Google&#39;s cookies and tracking information. Other advertising companies don&#39;t have that privileged status, which is why the  European Commission opened an antitrust investigation on Google&#39;s ad technology and the US  Justice Department reportedly also is examining Google&#39;s cookie approach.\n Goel denied that Google will get an edge, though. &#34;Privacy Sandbox technologies will not give preferential treatment or advantage to Google&#39;s advertising products or to Google&#39;s own sites,&#34; he told CNET. Indeed,   Google committed to &#34; no data advantage for Google advertising products&#34; after the UK&#39;s Competitions and Markets Authority   started investigating Google ad-tech competition issues.\n In addition to eventually phasing out third-party cookies, Google is working on a technology called  federated learning of cohorts, or FLOC, that matches ads to large groups of people, rather than individuals. With it, the browser monitors your browsing history and groups you with thousands of others with similar behavior into a cohort. Advertisers, noticing that a particular cohort is visiting a type of website, can then show ads to other members of that cohort on other sites.\n FLOC has its critics.  Brave opposes FLOC, as does the  Vivaldi browser. The Electronic Frontier Foundation, a digital rights nonprofit, says  FLOC is a &#34;terrible idea.&#34; And  Mozilla concluded FLOC lets sites &#34;learn a lot about you with far less effort than they would need to expend today.&#34;\n Google is working on revisions to FLOC, too. It plans to incorporate feedback for changes and a new round of testing.", "posttime": "2021-06-24 21:23:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,发布,延迟,delay", "title": "谷歌将延迟计划从2022年初到2023年初阻止第三方Cookie，找到保护隐私的方法而不伤害依赖于依赖于依赖的发布者 ", "title_en": "Google will delay plans to block third-party cookies from early 2022 to late 2023, to find ways to protect privacy without hurting ad-dependent publishers", "transed": 1, "url": "https://www.cnet.com/news/google-delays-chromes-cookie-blocking-privacy-plan-by-nearly-2-years/", "via": "", "real_tags": ["google", "谷歌", "发布", "延迟", "delay"]}, {"category": "", "categoryclass": "", "imagename": "2660fca2ffa5b2be2e260e5322018dd8.png", "infoid": 1067965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您的企业在哪里采用AI采用曲线？采取我们的AI调查来了解。\n JW Player，一家主要企业和出版公司的视频流和分析平台，从LLR合作伙伴提供了一系列资金的一系列资金中筹集了1亿美元。\n 在2005年推出，JW Player最初是一个开源产品，继续为YouTube的早期版本提供电源。虽然JW Player没有长期开源，但是在非商业用途的创意公众许可下提供，它已成为顶级数字视频播放器之一，拥有ViaCom，Zoom，Newegg和标签等企业和媒体客户蜂师。\n  纽约的公司索赔10亿人口每月观看JW播放器供电的视频，跨越27亿台设备。\n  根据互动广告局（IAB）的数据，Digital广告收入仅飙升了12.2％至美国去年仅为1400亿美元。数字视频广告，专门地看到了最高的增长，增加了20.6％至超过260亿美元。为帮助，JW Player提供了一个HTML5视频播放器，使公司能够在任何网站上嵌入他们的视频（使用广告），其中包含软件开发套件（SDK），用于将JW播放器添加到其本地移动应用程序。此外，该公司还提供其他工具，如“物品匹配”，它自动将相关视频插入JW播放器网络的相关在线文章中。\n 此外，营销人员和广告商喜欢为所有花费的视频和广告证明，并优化事物以最大限度地提高投资回报 - 这是数据进入磨损的地方。 JW Player为地表实时视频活动提供分析，例如哪些视频是最受欢迎的，以及对视频在不同平台和设备上进行的洞察的见解。\n  在现在之前，JW Player筹集了约4600万美元，最新的现金注入公司现已充分利用蓬勃发展的数字视频市场，这有助于其过去的“记录视频流增长和强大的盈利能力”年。同样，公开交易的JW Player竞争对手Bistgove在2020年3月开始的12个月期间在12个月期间看到了其估值三倍 - 似乎是繁荣的数字视频经济。 \n最新的资金也在JW Player首次收购的高跟鞋上进行了热烈的，这是在上个月抢购的黄路队以扩展到Live和按需视频流中，包括数字版权管理（DRM）。 在此次收购的日子宣布后，JW Player指出了拉丁美洲和亚太地区的“材料上涨和销售涌入”，亚太地区的秘密。  VidtureBeat＆＃39; S使命是成为技术决策者的数字城市广场，以获得有关转型技术和Transact的知识。您网站提供有关数据技术和策略的基本信息，以指导您的领导您的组织。 我们邀请您成为社区的成员，访问：门控思想领导者内容和对我们奖化事件的折扣访问，如转换2021：了解更多  成为会员 ", "note_en": "Where does your enterprise stand on the AI adoption curve? Take our  AI survey to find out.\n JW Player, a video streaming and analytics platform for major enterprise and publishing companies, has raised $100 million in a series E round of funding from LLR Partners.\n Launched in 2005, JW Player was initially an open source product which went on to power one of the early versions of YouTube. While JW Player is no long open source, instead being  offered under a creative commons license for non-commercial use, it  has emerged as one of the top digital video players, with enterprise and media customers such as Viacom, Zoom, Newegg, and Tag Heuer.\n  The New York-based company claims 1 billion people view a JW Player-powered video each month, spanning 2.7 billion devices.\n  According to data from the Interactive Advertising Bureau (IAB), digital advertising revenue surged 12.2% to nearly $140 billion in the U.S. alone last year. Digital video advertising, specifically, saw the highest growth, rising 20.6% to more than $26 billion. To help, JW Player serves an HTML5 video player that enables companies to embed their videos (replete with ads) on any website, with software development kits (SDKs) for adding JW Player to their native mobile apps. Additionally, the company offers other tools such as “article matching,” which automatically inserts relevant videos into relevant online articles across the JW Player network.\n Moreover, marketers and advertisers like to justify all those video and ad dollars spent, and optimize things to maximize the return on its investments — which is where data enters the fray. JW Player offers analytics to surface real-time video activity, such as which videos are proving most popular, as well as insights on how videos are performing across different platforms and devices.\n  Prior to now, JW Player had  raised around $46 million, and with its latest cash injection the company is now well-positioned to capitalize on a booming digital video market which has helped it attain “record video streaming growth and strong profitability” over the past year. Similarly, publicly-traded JW Player  rival Brightcove saw its valuation triple in the 12-month period starting in March 2020 — the digital video economy, it seems, is thriving.\n The latest funding also comes hot on the heels of JW Player’s first ever acquisition, after it  snapped up Vualto last month to extend its reach into live and on-demand video streaming, including digital rights management (DRM). In the days after this acquisition was announced, JW Player noted a “material uptick and influx of sales,” particulary across Latin America and Asia-Pacific regions.\n VentureBeat&#39;s mission is to be a digital town square for technical decision-makers to gain knowledge about transformative technology and transact.Our site delivers essential information on data technologies and strategies to guide you as you lead your organizations. We invite you to become a member of our community, to access: gated thought-leader content and discounted access to our prized events, such as   Transform 2021: Learn More\n Become a member", "posttime": "2021-06-24 21:23:19", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "player,llr,视频", "title": "JW Player，ViaCom等主要公司使用的视频流和分析服务，从LLR合作伙伴提高了100万系列 ", "title_en": "JW Player, a video streaming and analytics service used by major companies like Viacom, raises $100M Series E from LLR Partners", "transed": 1, "url": "https://venturebeat.com/2021/06/24/video-streaming-and-analytics-platform-jw-player-raises-100m/", "via": "", "real_tags": ["player", "llr", "视频"]}, {"category": "", "categoryclass": "", "imagename": "b501e5ad995a04e0aa52715715882710.jpg", "infoid": 1067964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于渴望甜食猪肉球的3％，可能是停止饮酒的时间\n  英国狂欢者被要求他们最喜欢的宿醉治疗，有一些坦率的奇怪的结果。\n 在调查中调查的那些由Tabasco Sauce的制造商委托，宣称，一份完整的英式早餐是迄今为止他们最喜欢处理沉重之夜的后果的方式，32％的人缩小了竖起大拇指。\n 面向击败头痛的讲台和毛茸茸的舌头被强烈的咖啡（26％）填充，它在近死热中将培根三明治（25％）狭窄地缩短了培根三明治（25％）。\n   其他旧收藏夹也非常出色，热黄油烤面包在13％的13％上注册了一个可敬的九九。豆类上的豆豆和炒鸡蛋分别达到了第十四和第十四次，每年11％。\n     剩下的疼痛减少的伎俩，有些人可能会被贬低到年轻的繁荣，如＆＃34;一个能量饮料＆＃34;那里，其中六分之有15％，或＆＃34;草莓奶昔＆＃34;，这是第19次最受欢迎的8％。\n 但是，必须询问七分之七百分之七十九年的思想的正确性，他们在第22位将鸡肉周梅宁放置在第22位，一个士兵的咸味和营养丰富的煮沸的鸡蛋之一。 \n3％的受访者建议与宿醉的一天应该最好地开始用甜味和酸猪球（第30次）显然患有由酒精以外的东西引起的宿醉。可能破裂。\n  还有人建议最好不要在没有帮助的情况下面对一只眼睛后面的混蛋，其中62％的人要求暗示处理它的最佳方式是＆＃34;与早午餐见面的朋友。＆＃34 ;\n  同一朋友可能帮助您进入该状态的可能性最初可能导致44％的受访者表示，他们喜欢解剖前一天晚上的事件，这将是一个很好的讨论早午餐的主题。\n 事实上，76％的被问及的人说，第二天与朋友一起吃饭有时比夜晚更好。这是对英国的悲惨起诉书，如果在类似折磨的朋友的Sullen公司在Sullen Company中努力努力，这是一个令人悲伤的刺激性的习惯比让你在那里的晚上更有趣。\n 结果肯定会抬起眉毛关于人们在Covid锁定期间做的事情，直到最近，他们一直在一夜之间被严格地普通话，正如与朋友在一起的话，以便在之后讨论它。\n 登记册只能承担调查结果反映了过去18个月左右过去18个月的一定程度的一般性思考。虽然我们毫无疑问，我们刚刚通过的强迫隔离的漫长时期不会被彼一，但从长时间沉思的宿醉性质以及你更愿意正在经历它们的人。\n     Google于周四介绍了开源项目的统一漏洞架构，继续其目前的运动来围起开源软件的安全性。 \n模式定义了数据库的结构。它＆＃39;数据库中对象的蓝图，它通知如何查询和交换数据。\n  尚未命名的漏洞互换架构旨在通过提供常见的交换格式来实现难以连接电流，碎片漏洞数据库的空白。它旨在以与实际使用的打开源包生态系统的命名和版本控制约定相匹配的方式强制执行软件版本规范。\n  继续阅读\n  Roam的条约最终在灰烬中：O2裂缝，加入竞争对手，为欧盟的重型用户添加数据漫游费用\n     我们在公共汽车的一侧没有看到它。英国听到Brexit公民投票结果的五年，O2已经成为英国的最后一个网络，以便为其客户重新推出欧洲的漫游费用。\n  对于其薪酬每月划桨者，超过25GB的每千兆字节现在将以每GB 3.50英镑收费。\n  在发送给客户的消息中，运营商写道：“由于您的每月英国数据津贴超过25GB，您仍然可以在欧洲区域使用您的数据。但它现在受到25GB的漫游限制。一旦您达到此限制，您将收取额外费用的3.50英镑/ GB。“ \n继续阅读\n  容器是来自Hyperscale-Land的游客。当你邀请他们时，他们应该尊重你的方式\n     注册辩论欢迎来到最新的注册辩论，其中作家讨论技术主题，而您 - 读者 - 选择获胜的论点。格式很简单：我们提出了一项动议，议案的论点将于周一和周三营运这个议案，以及周二和星期四的论点。\n  在本周期间，您可以在使用嵌入式民意调查中支持您支持的投票，选择您是否有利于或反对运动。最终得分将于星期五公布，揭示了对抗或反对争论最受欢迎。它＆＃39;这取决于我们的作家，让你说服他们投票。\n  继续阅读\n  令人痛苦地等待Windows 11的发射的粉丝已经被视为今天的一点举报＆＃39;大事事件，与微软结尾给我们所有......手指？\n  ＆＃34;窗户，＆＃34感觉＆＃39;劝告微软。基于Vista和Windows 8，我们＆＃39; D必须说我们＆＃39;重新获得即将发生的厄运感。或许我们应该感到蓬松......就像云一样。毕竟，这是微软旅行的方向。 \n继续阅读  英国看门狗罚款Biz£130万英镑用于40,000+直接营销呼叫，以选择退出的人  颜色外套被指控撒谎，粗鲁和咄咄逼人，并挂在冷酷的受害者身上  基于East Sussex的家庭改善Biz面临罚款130,000英镑，用于向上升900,000名未经请求的营销呼吁，该营销呼吁已注册电话偏好服务（TPS）。  2019年8月1日至去年3月31日在2019年至3月31日之间制作了近970,000个连接的呼叫，其中有超过452,000人的办公室（ICO），其中超过452,000名以TPS注册 或企业相同的。  ICO表示，当毫无戒心的冷呼叫伤亡人员收到超过50名投诉时，它将其倾向于公司＆＃39; 这包括重复呼叫，告诉公司不再与他们联系。  继续阅读 \n铁路压力集团呼吁英国政府在新的氢气动力列车后面抛出其重量，以帮助现有的滚动股，并在轨道上恢复全国＆＃39。\n  铁路行业协会（RIA） - 它可以追溯到140多年来追溯到其成员繁忙的蒸汽洛杉矶 - 希望政府支持试点项目，以测试氢的可行性不仅是作为一种清洁的燃料来源而是如此一种提升经济增长的方法。\n  ＆＃34;氢火车将对常规电气化一起发挥至关重要的作用 - 随着英国希望在2050年，＆＃34开发净零经济性。在简短的笔记中说RIA。\n  继续阅读\n  Cheeky服装公司法国连接，也被称为FCUK，已成为勒索软件的最新受害者，与一个帮派理解与Revil相关联，通过选择私人内部数据。\n  在1972年由现任首席执行官Stephen Marks成立，法国联系在采用Not-Exte-rude-uments口号＆＃34; fcuk＆＃34;在2000年代初的广告中。最初成立为中市女性＆＃39; S时尚品牌，自从展开到男装，手表，洗漱用品，甚至眼镜。\n  可悲的是，攻击者可以理解与Revil Ransomware Gang相关，无需这样的光学增强功能，以发现公司的安全漏洞＆＃39; S后端系统。结果，它们与一套内部公司数据进行了＆＃39。 \n继续阅读\n  在无状态环境中部署最终的状态代码是A＆＃39;棘手的业务＆＃39; IDC Guru Opines.\n     领先的分析师警告大型非技术公司在Kubernetes中进行数据库部署，将这种方法作为企业称为“新兴技术”。\n  虽然开发人员可能需要灵活性和敏捷性，但无状态容器乐队承诺，Carl Olofson，Research副总裁，Data Management Software，IDC宣传了企业部署的谨慎。\n  经验丰富的数据库专家在Postgres Vision 2021会议上发表演讲，说：“你真的需要确保你使用完全成立的功能。你想要保守。 Kubernetes是开源的，所以更新和测试和所有这些都在提交到熄灭的计时器时遵循相当慢的正式过程。 Kubernetes仍在发展迅速。喜欢任何技术：如果你试图将你的企业致力于在新兴技术上运行的功能，那么你正在接受一些风险。“\n  继续阅读\n  允许云PABX，VPN和数据共享，以便当地人可以参与跨国工作流程 \n印度的电信部在希望他们成为一个更具吸引力的离岸外离岸目的地的规则。修订后的规则使呼叫中心和类似企业可以使用云中的资源，并且作为全球客户服务组织的一部分，更容易运作。\n  更改的核心允许印度称之为“其他服务提供商”（OSPS） - 一个术语，描述通过语音传播的任何业务 - 使用联网资源，同时删除大量繁文缛节。\n  以前的安排意味着这些公司发现它难以作为全球运营的一部分工作，因为它们被迫在印度内使用电信基础设施，以提供详细的技术模式，以解释他们作为繁重注册过程的一部分进行路由呼叫的详细技术模式，并且无法分享近海实体的数据。\n  继续阅读\n  英国的广告看门狗给了一个社会距离，自由的手工消毒拍摄到一个坚定的营销，它声称可以清除导致Covid-19呼吸系统疾病的冠状病毒的空气。\n  Go-Vi Eradicator 19的在线广告声称在分开的第二次中Zap Zap两次 - 如果是真的，那么不应该嗅到。障碍是，在广告标准权威（ASA）的某人。\n  监管机构佩戴了戴着薄壁的戴上掩盖，戴着制造商＆＃39所声称它被“证明摧毁了冠状病毒细胞”，并希望了解更多关于这个“空气净化系统”，它被声称，已经通过独立测试了实验室。 \n继续阅读  Google Drive云存储储物柜的神秘“安全更新”将断开某些文件的链接  管理员给予整个月的一个月。 明智地选择 - 在7月23日之后，用户赢得了＆＃39; t被告知发生了什么＆＃39;正在发生什么  Google已建议其工作区生产力套件的管理员设置，以提高其驱动器云存储储物柜的安全性，但修复程序将断开某些文件的链接。  AD Giant对Workspace Admins的咨询没有提到更新的原因，除了说这是一个增强。  提供的小细节提供了“更新”更改某些Google驱动器文件和文件夹的URL。 新链接包括文件的URL中的资源密钥。“  继续阅读 \n注册 - 对科技界的独立新闻和意见。 部分情况出版 ", "note_en": "For the 3% who craved sweet and sour pork balls, it might be time to stop drinking\n  British revellers have been asked for their favourite hangover cures, with some frankly bizarre results.\n Those polled in the survey, which was commissioned by the makers of Tabasco sauce, declared that  a full English breakfast was by far  their favourite way of dealing with the consequences of a heavy night, with 32 per cent giving it the thumbs-up.\n The podium places for confronting a thumping headache and a furry tongue were filled out by strong coffee (26 per cent), which narrowly edged out bacon sandwiches (25 per cent) into third in a near dead heat.\n   Other old favourites also featured highly, with hot buttered toast registering a respectable ninth on 13 per cent. Beans on toast and scrambled eggs reached thirteenth and fourteenth respectively on 11 per cent each.\n     Of the remaining pain-reduction ploys, some could be put down to youthful exuberance, such as &#34;an energy drink&#34;, which came sixth with 15 per cent, or &#34;a strawberry milkshake&#34;, which was the 19th most popular response on 8 per cent.\n But questions must be asked as to the rightness of mind of the seven per cent of boozers who contrived to place chicken chow mein in 22nd place, one above the splendidly savoury and nutritious boiled egg with soldiers.\n   The 3 per cent of respondents who suggested a day with a hangover should best be started with sweet and sour pork balls (30th) are clearly suffering from a hangover caused by something other than alcohol. Possibly crack.\n  It was also suggested that it is better not to face up to a bastard behind the eyes without help, with 62 per cent of those asked suggesting that the best way of dealing with it was &#34;meeting friends for brunch.&#34;\n  The likelihood that those very same friends probably helped you get into that state in the first place is probably what led 44 per cent of respondents to say they enjoyed dissecting the events of the night before, which would be a good subject to discuss over the brunch.\n Indeed, 76 per cent of those questioned said that meeting to eat with friends the following day was sometimes better than the night out itself. It is a sad indictment of Britain&#39;s socialising habits if struggling with a hangover in the sullen company of similarly afflicted friends is more fun than the evening that got you there.\n The results will certainly raise eyebrows about what people have been doing during the COVID lockdown as until very recently, going for a night out at all was strictly verboten, as was meeting up with friends to discuss it afterwards.\n The Register can only assume the results of the survey reflect a certain level of wishful thinking over the past 18 months or so on the part of those polled. Although we have no doubt the lengthy period of enforced isolation we have all just been through would not be mutually exclusive from a prolonged contemplation of the nature of hangovers and who you would prefer to be experiencing them with.\n     Google on Thursday introduced a unified vulnerability schema for open source projects, continuing its current campaign to shore up the security of open source software.\n  A schema defines the structure of a database. It&#39;s a blueprint for the objects within the database and it informs how data can be queried and exchanged.\n  The as-yet-unnamed  vulnerability interchange schema aspires to bridge gaps that make it difficult to connect current, fragmented vulnerability databases by providing a common interchange format. It aims to enforce software version specification in a way that matches the naming and versioning conventions that open source package ecosystems actually use.\n  Continue reading\n  Treaty of Roam finally in ashes: O2 cracks, joins rivals, adds data roaming charges for heavy users in EU\n     We didn&#39;t see this on the side of a bus. Five years to the day that Britain heard the results of the Brexit referendum, O2 has caved as the last of the UK&#39;s Big Four networks to re-introduce roaming charges in Europe for its customers.\n  For its pay monthly punters, each gigabyte of data over 25GB will now be charged at £3.50 per GB.\n  In a message sent to customers, the carrier wrote: “As your monthly UK data allowance is over 25GB, you can still use your data in our Europe Zone. But it’s now subject to a Roaming Limit of 25GB. Once you’ve reached this limit you’ll be charged an additional cost of £3.50/GB.”\n  Continue reading\n  Containers are visitors from hyperscale-land. They should respect your ways when you invite them in\n     Register Debate  Welcome to the latest Register Debate in which writers discuss technology topics, and you – the reader – choose the winning argument. The format is simple: we propose a motion, the arguments for the motion will run this Monday and Wednesday, and the arguments against on Tuesday and Thursday.\n  During the week you can cast your vote on which side you support using the embedded poll, choosing whether you&#39;re in favor or against the motion. The final score will be announced on Friday, revealing whether the for or against argument was most popular. It&#39;s up to our writers to convince you to vote for their side.\n  Continue reading\n  Fans eagerly awaiting the emission of Windows 11 have been treated to a teaser of today&#39;s big event, ending with Microsoft giving us all... the finger?\n  &#34;Feel what&#39;s next for Windows,&#34; exhorts Microsoft. Based on Vista and Windows 8, we&#39;d have to say we&#39;re getting a sense of impending doom. Or perhaps we should be feeling fluffy… like a cloud. Which, after all, is the direction of travel for Microsoft.\n  Continue reading\n  UK watchdog fines biz £130k for 90,000+ direct marketing calls to folk who had opted out\n  Colour Coat accused of lying, being rude and aggressive, and hanging up on cold-call victims\n     A home improvement biz based in East Sussex is facing a fine of £130,000 for making upwards of 900,000 unsolicited marketing calls to individuals and businesses that had enrolled on the Telephone Preference Service (TPS).\n  Colour Coat of St Leonards-on-Sea made almost 970,000 connected calls between 1 August 2019 and 31 March last year, the Information Commissioner&#39;s Office (ICO) found, of which more than 452,000 were to folk or entities registered with TPS or the corporate equivalent.\n  The  ICO said it was tipped off to the company&#39;s practices when it received more than 50 complaints from unsuspecting cold-call casualties. This included repeated calls to people that told the company not to contact them again.\n  Continue reading\n  A railway pressure group is calling on the UK government to throw its weight behind a new fleet of hydrogen-powered trains to help modernise existing rolling stock and get the nation&#39;s transport policy back on track.\n  The  Railway Industry Association (RIA) – which can trace its roots back more than 140 years to when its members were busy building steam locos – wants government to support pilot projects to test the viability of hydrogen not only as a clean source of fuel but as a way to boost economic growth.\n  &#34;Hydrogen trains will have a vital role to play – alongside conventional electrification – as the UK looks to develop a Net Zero economy by 2050,&#34; said the RIA in a briefing note.\n  Continue reading\n  Cheeky clothing firm French Connection, also known as FCUK, has become the latest victim of ransomware, with a gang understood to be linked to REvil having penetrated its back-end - making off with a selection of private internal data.\n  Founded in 1972 by current chief executive Stephen Marks, French Connection made a name for itself when it adopted the not-actually-rude-honest slogan &#34;FCUK&#34; in its advertising in the early 2000s. Originally founded as a mid-market women&#39;s fashion brand, the company has since expanded into menswear, watches, toiletries, and even glasses.\n  Sadly, attackers understood to be related to the REvil ransomware gang needed no such optical enhancements to spot a security vulnerability in the company&#39;s back-end systems. As a result, they&#39;ve made off with a trove of internal company data.\n  Continue reading\n  Deploying the ultimate stateful code in a stateless environment is a &#39;tricky business&#39; IDC guru opines\n     A leading analyst has warned big, non-tech companies against database deployments in the Kubernetes, dubbing the approach as “emerging technology” for enterprises.\n  While developers might want the flexibility and agility the stateless container orchestrator promised, Carl Olofson, research vice president, data management software, IDC urged caution with enterprise deployments.\n  Speaking at the  Postgres Vision 2021 conference this week, the seasoned database expert said: “You really need to make sure you&#39;re using functions that are well established. You want to be conservative. Kubernetes is open source, so the updates and the testing and all that, follows a rather slow formal process from the time that submission comes to the timer that goes out. Kubernetes is still rapidly evolving. Like any technology: if you&#39;re trying to commit your enterprise to functions that run on an emerging technology, then you are accepting some risks.”\n  Continue reading\n  Allows cloud PABXs, VPNs, and data sharing, so that locals can participate in multinational workflows\n     India’s department of telecommunications has tweaked some rules in the hope they make the nation a more attractive offshoring destination. The revised rules make it possible for call centres and similar businesses to use resources in the cloud, and more easily operate as part of global customer service organisations.\n  The core of the changes is permitting what India calls “other service providers” (OSPs) — a term that describes any business conducted remotely by voice — to use networked resources, while removing plenty of red tape.\n  Previous arrangements meant such companies found it hard to work as part of a global operation, as they were forced to use telecoms infrastructure within India, to provide detailed technical schemas explaining how they routed calls as part of an onerous registration process, and could not share data with offshore entities.\n  Continue reading\n  The UK’s advertising watchdog has given a socially distanced, liberally hand-sanitised slap to a firm marketing a gizmo it claimed could clear the air of the coronavirus that causes the COVID-19 respiratory disease.\n  The online ad for the Go-Vi Eradicator 19 claimed to zap both airborne and surface nasties in a split second – which if true, should not be sniffed at. Snag is, someone at the Advertising Standards Authority (ASA)  did.\n  The regulator took a close mask-wearing look at the manufacturer&#39;s claim that it was “proven to destroy Coronavirus cells” and wanted to know more about this “air purification system” that, it was claimed, had been tested by independent laboratories.\n  Continue reading\n  Mysterious ‘security update’ to Google Drive cloud storage locker will break links to some files\n  Admins given a whole month to sort it out. Choose wisely — after July 23rd, users won&#39;t be told what&#39;s happening\n     Google has advised administrators of its Workspace productivity suite that it’s set to improve security of its Drive cloud storage locker, but that the fix will break links to some files.\n  The ad giant’s advisory to Workspace admins doesn’t mention the reason for the update, other than saying it’s an enhancement.\n  The little detail offered states that the update “changes the URLs for some Google Drive files and folders. The new links include a resource key in a file’s URL.”\n  Continue reading\n  The Register - Independent news and views for the tech community. Part of Situation Publishing", "posttime": "2021-06-24 21:22:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上衣,english", "title": "“全英文”上衣英国宿醉固化调查 ", "title_en": "“Full English” tops UK hangover-cure survey", "transed": 1, "url": "https://www.theregister.com/2021/06/24/hangover_survey/", "via": "", "real_tags": ["上衣", "english"]}, {"category": "", "categoryclass": "", "imagename": "d1c9a8316ab781e63c8621e2b669c3b8.jpg", "infoid": 1067962, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我不确定他们在首尔的Hyundai HQ自助餐厅喂它们，但无论是什么，它的工作。这些过去几年的韩国汽车制造商一直在热门条纹，在设计，建立质量或效率方面上涨了董事会的游戏。 2022 Tucson混合交叉又是另一个支持该声明，提供夏普的外观，有趣的内部和38英里/ 100km）的数据点，仅为29,050美元。\n Tucson于2004年首次出现在交叉时代的曙光上。对于这一代，现代延长了北美市场的Tucsons的翼展，为108.5英寸（2,756毫米）。总长度仍然是可管理的182.3英寸（4,630毫米），宽度为73.4英寸（1,864毫米），高度为65.6英寸（1,666毫米）。如此，汽车＆＃39;造型是主观的，但在这种情况下，我认为设计总监Sangyup Lee＆＃39; S团队做了一个不错的工作。他们＆＃39;重新召集大分风格＆＃34;参数动态。＆＃34;在前面，日间运行灯融入了现代格栅的侧面，在后方有独特的尾灯，让我提醒我一些福特野马mach-e。\n  普通的Tucsons由2.5L发动机提供动力，今年晚些时候在此后的插件混合动力Tucson提供动力，但今天我们＆＃39;只关注Not-Plug-in Hybrid。这采用1.6L涡轮增压的四缸汽油直喷引擎，其自身几乎与更大的发动机一样强大，并且更多的扭矩，提供180 HP（134kW）和195磅-CT（264nm）。但由于它的一个混合动力车，它还获得了59 HP（44.2千瓦），195年LB-FT（264nm）电动机的好处，即＆＃39;从1.5 kWh离子聚合物电池喂食。它与曾经，它并不像只加上电动机和内燃机的总输出一样简单（因为它们赢得了＆＃39;同时制造峰值电源），但总产量为226 HP（169 kW）和258磅（350nm）。\n 全轮驱动是Tucson混合动力车上的标准版，六速自动变速器也是如此。燃油效率是令人印象深刻的38英里MPG，尽管限量装饰落到37 MPG（6.4L / 100km）。 ＆＃39;由于一些NVH改进，包括声学挡风玻璃和更好的轮子衬垫。\n 如果不起眼，那么道路的方式是完全可以接受的。在一周的过程中，我平均36.5 mpg（6.4 l / 100km）而不尝试，这正是我想要的混合交叉。 Tucson Hybrid将是我通过蜿蜒的峡谷路爆炸的首选，但为学校运行或通勤＆＃39;难以破坏乘坐舒适和效率的水平。\n  我宁愿对我与图森＆＃39的内饰有多感到惊讶。一个分裂级别的破折号缠绕在门上 - 我第一次在上一代奥迪A8和信息娱乐系统和主开关系统和主开关面板上突出的东西，从上层突出，直到划分。一个10.25英寸的数字主仪器显示器设置为驾驶员前部划线的较低级别（限制尺寸;较小的修剪级别使用较小的显示器进行。和主要仪表板的UI主题提供相当数量的定制，以及64种不同颜色的环境LED照明。\n 在中央控制台上，您＆＃39; ll找到了传输的按钮控制，基本上与Sonata混合中的相同。在那里有一个体面的储物口袋，我们的汽车配备了手机的无线充电垫。 \n自从Hyundai位于Tucson Hybrid＆＃39; S锂离子电池，在后排座椅上，作为非混合动力版本-38.8立方英尺（1,098升）的货物室内的货物室。使用，或74.5立方英尺（2,109升），后座折叠。谈到后排座位，归功于较长的轴距，如果你坐在那里，你有41.3英寸（1,049毫米）的腿室，比你坐在前面的话，0.2英寸（5毫米）。\n  我确实有一个投诉，它＆＃39; s的电容面板，寿命在信息娱乐系统下方。你必须用它来改变卷或改变气候控制，但是没有触觉反馈，甚至在一周之后，如果我想让它更温暖，更冷，更响亮，甚至不得不看看小组。或更安静。旋钮或实际的物理按钮将有很长的路要解决这个问题。但除此之外，信息娱乐系统（10.25英寸触摸屏如果您参加37,350美元的Tucson Hybrid Limited，或者如果您不使用8英寸的单位）是不可告知的。\n 高级驾驶员辅助系统（ADAS）的标准包包括自适应巡航控制和车道保持;前进碰撞警告和紧急制动（将识别行人和骑自行车者以及汽车）;交界处和后交通警惕;和盲点监控，包括主仪器面板上的视频显示屏，当您激活转弯信号时，侧面＆＃39;盲点。有限的装饰还增加了后应急制动，以及停车传感器和摄像机。\n 如果我印象深刻，我就是。虽然我认为爱好者仍然倾向于Mazda CX-30驱动器，大多数人都aren＆＃39; t爱好者，以及一些仍然优先考虑燃油效率。如果这听起来像你和你＆＃39;重新寻找高效的紧凑型交叉在30,000-40,000美元之间，你可以做到比考虑Tucson混合的程度。 ", "note_en": "I&#39;m not sure what they feed them at the Hyundai HQ cafeteria in Seoul, but whatever it is, it&#39;s working. The Korean automaker has been on a hot streak these past few years, having upped its game across the board, whether that&#39;s in design, build quality, or efficiency. The 2022 Tucson Hybrid crossover is yet another data point to support that claim, offering sharp looks, an interesting interior, and 38 mpg (6.2 L/100km), starting at just $29,050.\n The Tucson first appeared back at the dawn of the crossover era in 2004. For this generation, Hyundai has lengthened the wheelbase of Tucsons destined for the North American market to 108.5 inches (2,756 mm). Overall length is still a manageable 182.3 inches (4,630 mm), with a width of 73.4 inches (1,864 mm) and a height of 65.6 inches (1,666 mm). As ever, a car&#39;s styling is subjective, but in this case I think design director SangYup Lee&#39;s team did a decent job. They&#39;re calling the faceted style &#34;Parametric Dynamics.&#34; At the front, the daytime running lights are incorporated into the sides of the Hyundai grille, and at the rear there are distinctive taillights that remind me somewhat of the Ford Mustang Mach-E.\n  Normal Tucsons are powered by a 2.5L engine, and there&#39;s a plug-in hybrid Tucson due later this year, but today we&#39;re only concerned with the not-plug-in Hybrid. This uses a 1.6 L turbocharged four-cylinder gasoline direct-injection engine, which on its own is almost as powerful as the bigger engine as well as being more torquey, providing 180 hp (134kW) and 195 lb-ft (264 Nm). But since it&#39;s a hybrid, it also gets the benefit of a 59 hp (44.2 kW), 195 lb-ft (264 Nm) electric motor that&#39;s fed from a 1.5 kWh lithium-ion polymer battery. As ever, it&#39;s not quite as simple as just adding the total outputs of the electric motor and internal combustion engine together (since they won&#39;t both make peak power at the same time), but total output is 226 hp (169 kW) and 258 lb-ft (350 Nm).\n All-wheel drive is standard on the Tucson Hybrid, as is a six-speed automatic transmission. Fuel efficiency is an impressive 38 mpg across the board, although the Limited trim drops to 37 mpg (6.4 L/100km) combined. It&#39;s relatively quiet on the move, thanks to some NVH improvements, including an acoustic windshield and better wheel liners.\n On-road manners were perfectly acceptable, if unremarkable. Over the course of a week I averaged 36.5 mpg (6.4 L/100km) without trying, which is exactly what I want from a hybrid crossover. The Tucson Hybrid wouldn&#39;t be my first choice for a blast through a sinuous canyon road, but for the school run or commute it&#39;s hard to fault the level of ride comfort and efficiency.\n  I was rather surprised with how taken I was with the Tucson&#39;s interior. A split-level dash wraps around to the doors—something I first saw on the previous-generation Audi A8—and the infotainment system and main switchgear panel project down from the upper level, bisecting the dash. A 10.25-inch digital main instrument display is set into the lower level of the dash in front of the driver (in Limited trim; the lesser trim levels make do with a smaller display). And a fair amount of customization is available in terms of the UI theme of the main instrument panel, as well as 64 different colors of ambient LED illumination.\n On the center console you&#39;ll find the pushbutton controls for the transmission, which are basically the same as in the  Sonata Hybrid. There&#39;s a decent array of storage pockets, and our car was equipped with a wireless charging pad for your phone.\n Since Hyundai located the Tucson Hybrid&#39;s lithium-ion battery under the rear seats, there&#39;s as much cargo room in the back as the non-hybrid version—38.8 cubic feet (1,098 L) with the rear seats in use, or 74.5 cubic feet (2,109 L) with the rear seats folded flat. Speaking of rear seats, thanks to the longer wheelbase, if you sit back there you&#39;ve got 41.3 inches (1,049 mm) of leg room, 0.2 inches (5 mm) more than if you sat in the front.\n  I do have one complaint, and it&#39;s the capacitive panel that lives just below the infotainment system. You have to use this to change the volume or alter the climate control, but there&#39;s no haptic feedback, and even after a week I still had to look at the panel if I wanted to make it warmer, colder, louder, or quieter. Knobs or actual physical buttons would go a long way to resolving that. But other than that, the infotainment system (10.25-inch touchscreen if you go for the $37,350 Tucson Hybrid Limited, or an 8-inch unit if you don&#39;t) is unobjectionable.\n The standard package of advanced driver assistance systems (ADAS) includes adaptive cruise control and lane keeping; forward collision warning and emergency braking (which will recognize pedestrians and cyclists, as well as cars); junction and rear cross-traffic alerts; and blind spot monitoring, including a video display on the main instrument panel that shows you that side&#39;s blind spot when you activate a turn signal. The Limited trim also adds rear emergency braking, as well as parking sensors and cameras.\n If I sound impressed, I am. While I think enthusiasts will still prefer the way the  Mazda CX-30 drives, most people aren&#39;t enthusiasts, and some who are still prioritize fuel efficiency. If that sounds like you and you&#39;re looking for an efficient compact crossover between $30,000-$40,000, you could do a lot worse than to consider the Tucson Hybrid.", "posttime": "2021-06-24 20:41:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tucson,hybrid,混合", "title": "Hyundai的2022 Tucson Hybrid是一个迷人和高效的交叉 ", "title_en": "Hyundai’s 2022 Tucson Hybrid is a charming and efficient crossover", "transed": 1, "url": "https://arstechnica.com/cars/2021/06/hyundais-2022-tucson-hybrid-is-a-charming-and-efficient-crossover/", "via": "", "real_tags": ["tucson", "hybrid", "混合"]}]