[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1000020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一种新病毒在全球迅速传播，南卡罗来纳州的托米医疗系统无法为医院工作人员提供更多的防护口罩。它们在全球范围内的挤兑造成了短缺。\n那就是2009年的“猪流感”。托米后来囤积了一些防护装备，但多年来没有补充一些过期的物品。今年，它发现一些口罩上的橡皮筋很脆。当一名官员试穿时，其中一件折断了。\n..。", "note_en": "A new virus had rapidly spread across the globe and Tuomey Healthcare System in South Carolina couldn’t get more protective masks for its hospital workers. A global run on them had created a shortage.\n  That was the 2009 “swine flu.” Tuomey later stockpiled protective gear, but over the years didn’t replenish some expired items. This year, it found that elastic bands on some of its masks were brittle. One snapped when an official tried it on.\n...", "posttime": "2020-05-02 17:43:56", "tags": "coronavirus,病毒,冠状病毒,对抗,level", "title": "各级误判使美国没有装备对抗冠状病毒", "title_en": "Miscalculation at every level left U.S. unequipped to fight coronavirus", "transed": 0, "url": "https://www.wsj.com/articles/miscalculation-at-every-level-left-u-s-unequipped-to-fight-coronavirus-11588170921", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "对抗", "level"]}, {"category": "", "categoryclass": "", "imagename": "5e9c81075b9c594439b186f640f9dbc4.jpg", "infoid": 1000019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伦敦--隐藏在伦敦西部一个时髦的合作建筑群里，经过美食街和支付处理初创公司，它可能是世界上技术最落后的唱片公司。\n自2012年开始发行音乐的The Electric Record Co.专门对20世纪50年代和60年代的古典和爵士乐专辑进行精心的再创作。它的目录包括重新发行威廉·弗特文格勒(Wilhelm Furtwängler)、约翰·科尔特兰(John Coltrane)和塞隆尼斯·蒙克(Thelonous Monk)的里程碑式录音，以及收藏家喜欢的不太知名的艺术家，比如小提琴家约翰娜·马茨(Johanna Martzy)。\n但真正让电子唱片与众不同的是它的方法-一种更类似于制作小批量美食巧克力的生产哲学，而不是大多数收缩包装的乙烯基巧克力。\n它的专辑由手工组装，并以300或更少的版本发行-每张LP的成本为400至600美元-使用的是修复后的复古设备，从发光的真空管放大器到半个多世纪没有使用过的单声道磁带系统。目标是确保唱片公司创始人皮特·哈奇森(Pete Hutchison)认为已经失去的唱片制作黄金时代得到忠实的恢复。甚至它的唱片封套，一个接一个地印在凸版印刷机上，也显示出对…的狂热热爱…。\n和记黄埔在最近的一次采访中说：“它一开始是想重现原作，但不是让它成为一种仿制品。”“并且为了不创造一个仿制品，我们不得不像他们那样做每一件事。”\n电子唱片对细节的关注，以及和记黄埔在掌握旧唱片方面的精致工程风格，使该品牌在收藏家中享有尊崇的地位，但也在竞争对手中招致微妙的嘲笑，他们认为其做法不必要地昂贵，而且一半以上过于珍贵。\n53岁的哈奇森(Hutchison)五官犀利，胡子长达一英尺，让他看起来像是“指环王”(The Lord Of The Rings)中任性的巫师。他驳斥了这样的批评，认为这是发烧友世界卑鄙的部落主义的例子。他认为，即使是“发烧友”这个词，也更多的时候是一种空洞的营销噱头，而不是质量的可靠标志。\n“发烧友用耳朵听，而不是用心听，”和记黄埔说。他补充说：“这不是我们的游戏，真的。”\n“如果你愿意，这个游戏试图做一些反仿制药的事情，”他说。“我们对这些旧唱片所做的，本质上是把当时的技术拿来，重新制作成当时的样子，而不是破坏它。”\n在很大程度上，过去十年的乙烯基复兴是由再版推动的。但没有一家再发行的标签像电子唱片那样走到了同样的极端。\n2009年，和记黄埔购买了他用来制作唱片的两台笨重的青铜灰色机器-一台Lyrec磁带机和一台车床，都是1965年的，都是1965年的-并在三年内花费了超过15万美元对它们进行修复。他又投资了数千美元进行改进，比如用开采的白银更换铜线，和记黄埔表示，这使音频信号的纯度更高。\n这些机器允许和记黄埔排除自披头士(Beatles)还在轻便摩托车时代以来悄悄进入录音过程的任何技术痕迹。这不仅意味着任何数字化或计算机化的东西，还包括几十年来音频电路的中流砥柱晶体管；取而代之的是，机器的放大器由真空管(或英国工程师称之为阀门)供电。\n和记黄埔在参观该品牌的工作室时表示：“我们在这里都是关于阀门的。”\n掌握一张黑胶唱片涉及到在漆盘上“切割”凹槽，这是一门黑暗的艺术，在这种艺术中，微小的调整可以产生很大的效果。在工程师中不同寻常的是，和记黄埔倾向于在低音量下掌握唱片-有时甚至比原始唱片更安静-以带来更多乐器的自然感觉。\n他在最近的一次“Mal/2”的制作会上展示了他的技巧，这张专辑是爵士乐钢琴家Mal Waldron于1957年发行的，其中有一张由Coltrane亮相的专辑。他测试了歌曲“One by One”的几个掌握水平-这首歌有很多断断续续的小号音符，由Idrees Sulieman演奏-最后选定了一个，保留了原始磁带的刺激，但避免了和记黄埔所说的当号角达到高潮时发出的“喇叭”。\n“你想听到的是清晰度、和声、质地，”他说。“你不想要的是把它戴上，然后觉得你必须把它关小一点。”\n这些判断往往是主观的。但为了测试和记黄埔的方法，我参观了迈克尔·弗雷默(Michael Fremer)在新泽西的家，他是“立体爱好者”(Stereophile)的特约编辑，也是黑胶的长期拥护者。我们在弗雷默最先进的测试系统上收听了几个电子录音版本，并将它们与其他公司的相同材料的印刷机进行了比较(仅扬声器一项的价格就高达10万美元)。\n我经常对黑胶优越的说法持怀疑态度，但当我听到马茨演奏的一张电子录音公司的巴赫小提琴独奏专辑时，我被它们的清晰和美丽惊呆了。与其他人相比", "note_en": "LONDON — Tucked in a trendy co-working complex in West London, just past the food court and the payment processing start-up, is perhaps the most technologically backward-looking record company in the world.\n The Electric Recording Co., which has been releasing music since 2012, specializes in meticulous recreations of classical and jazz albums from the 1950s and ’60s. Its catalog includes reissues of landmark recordings by Wilhelm Furtwängler, John Coltrane and Thelonious Monk, as well as lesser-known artists favored by collectors, like the violinist  Johanna Martzy.\n But what really sets Electric Recording apart is its method — a philosophy of production more akin to the making of small-batch gourmet chocolate than most shrink-wrapped vinyl.\n Its albums, assembled by hand and released in editions of 300 or fewer —at a cost of $400 to $600 for each LP —are made with restored vintage equipment down to glowing vacuum-tube amplifiers, and mono tape systems that have not been used in more than half a century. The goal is to ensure a faithful restoration of what the label ’s founder, Pete Hutchison, sees as a lost golden age of record-making. Even its record jackets, printed one by one on letterpress machines, show a fanatical devotion to  ...\n “It started as wanting to recreate the original but not make it a sort of pastiche,” Hutchison said in a recent interview. “And in order not to create a pastiche, we had to do everything as they had done it.”\n Electric Recording’s attention to detail, and Hutchison’s delicate engineering style in mastering old records, have given the label a revered status among collectors — yet also drawn subtle ridicule among rivals who view its approach as needlessly expensive and too precious by half.\n   Hutchison, 53, whose sharp features and foot-long beard make him look like a wayward wizard from “The Lord of the Rings,” dismissed such critiques as examples of the audiophile world’s catty tribalism. Even the word “audiophile,” he feels, is more often an empty marketing gimmick than a reliable sign of quality.\n “Audiophiles listen with their ears, not with their hearts,” Hutchison said. He added: “That’s not our game, really.”\n  “The game is trying to do something that is anti-generic, if you like,” he said. “What we’re doing with these old records is essentially taking the technology from the time and remaking it as it was done then, rather than compromising it.”\n To a large degree, the vinyl resurgence of the last decade has been fueled by reissues. But no reissue label has gone to the same extremes as Electric Recording.\n In 2009, Hutchison bought the two hulking, gunmetal-gray machines he uses to master records — a Lyrec tape deck and lathe, with Ortofon amplifiers, both from 1965 — and spent more than $150,000 restoring them over three years. He has invested thousands more on improvements like replacing their copper wiring with mined silver, which Hutchison said gives the audio signal a greater level of purity.\n The machines allow Hutchison to exclude any trace of technology that has crept into the recording process since a time when the Beatles were in moptops. That means not only anything digital or computerized, but also transistors, a mainstay of audio circuitry for decades; instead, the machines’ amplifiers are powered by vacuum tubes (or valves, as British engineers call them).\n  “We’re all about valves here,” Hutchison said on a tour of the label’s studio.\n Mastering a vinyl record involves “cutting” grooves into a lacquer disc, a dark art in which tiny adjustments can have a big effect. Unusually among engineers, Hutchison tends to master records at low volumes — sometimes even quieter than the originals — to bring out more of the natural feel of the instruments.\n He demonstrated his technique during a recent mastering session for “Mal/2,” a 1957 album by the jazz pianist Mal Waldron that features an appearance by Coltrane. He tested several mastering levels for the song “ One by One” — which has lots of staccato trumpet notes, played by Idrees Sulieman — before settling on one that preserved the excitement of the original tape but avoided what Hutchison called a “honk” when the horns reached a climax.\n “What you want to hear is the clarity, the harmonics, the textures,” he said. “What you don’t want is to put it on and feel like you’ve got to turn it down.”\n These judgments are often subjective. But to test Hutchison’s approach, I visited the New Jersey home of Michael Fremer, a contributing editor at Stereophile and a  longtime champion of vinyl. We listened to a handful of Electric Recording releases, comparing them to pressings of the same material by other companies, on Fremer’s state-of-the-art test system (the speakers alone cost $100,000).\n  I am often skeptical of claims of vinyl’s superiority, but when listening to one of Electric Recording’s albums of Bach’s solo violin pieces played by Martzy, I was stunned by their clearness and beauty. Compared to the other pressings, Electric Recording’s version had vivid, visceral details, yielding a persuasive illusion of a human being standing before me drawing a bow across a violin.\n “It’s magical what they’re doing, recreating these old records,” Fremer said as he swapped out more Electric Recording discs.\n Hutchison is a surprising candidate to carry the torch for sepia-toned classical fidelity. In the 1990s, he was  a player in the British techno scene with his label Peacefrog; the label’s success in the early 2000s with the minimalist folk of José González helped finance the obsession that became Electric Recording.\n Hutchison’s conversion happened after he inherited the classical records owned by his father, who died in 1998. A longtime collector of rock and jazz, Hutchison was entranced by the sound of the decades-old originals, and found newer reissues unsatisfying. He learned that Peacefrog’s distributor, EMI, owned the rights to many of his new favorites. Was it possible to recreate things exactly as they had been done the first time around?\n After restoring the machines, Electric Recording put its first three albums on sale in late 2012 — Martzy’s solo Bach sets, originally issued in the mid-1950s.\n Hutchison decided that true fidelity applied to packaging as well as recording. Letterpress printing drove up his manufacturing costs, and some of the label’s projects have seemed to push the boundaries of absurdity.\n In making “ Mozart à Paris,” for example, a near-perfect simulacrum of a deluxe 1956 box set, Hutchison spent months scouring London’s haberdashers to find the right strand of silk for a decorative cord. The seven-disc set is Electric Recording’s most expensive title, at about $3,400 — and one of the few in its catalog that has not sold out.\n  Hutchison defends such efforts as part of the label’s devotion to authenticity. But it comes at a cost. Its manufacturing methods, and the quality-control attention paid to each record, bring no economies of scale. So Electric Recording would gain no reduction in expenses if it made more, thus negating the question Hutchison is most frequently asked: Why not press more records and sell them more cheaply?\n “We probably make the most expensive records in the world,” Hutchison said, “and make the least profit.”\n Electric Recording’s prices have drawn head-scratching through the cliquey world of high-end vinyl producers. Chad Kassem, whose company  Acoustic Sounds, in Salina, Kan., is one of the world’s biggest vinyl empires, said he admired Hutchison’s work.\n “I tip my hat to any company that goes the extra mile to make things as best as possible,” Kassem said.\n But he said he was proud of Acoustic Sounds’s work, which like Electric Recording cuts its masters from original tapes and goes to great lengths to capture original design details — and sells most of its records for about $35. I asked Kassem what is the difference between a $35 reissue and a $500 one.\n Yet the market has embraced Electric Recording. Even amid the coronavirus pandemic, Hutchison said, its records have been selling as fast as ever, although the company has had some production hiccups. The only manufacturer of a fabric that Hutchison chose for a Mozart set in the works, by the pianist Lili Kraus, has been locked down in Italy.\n The next frontier for Electric Recording is rock. Hutchison recently got permission to reissue “ Forever Changes,” the classic 1967 psychedelic album by the California band Love, and said that the original tape had a more unvarnished sound than most fans had heard. He expects that to be released in July, and “Mal/2” is due in August.\n But Hutchison seemed most proud of the label’s work on classical records that seemed to come from a distant era. He pulled out a 10-inch mini-album of Bach by the French pianist Yvonne Lefébure, originally released in 1955. Electric Recording painstakingly recreated its dowel spine, its cotton sleeve, its leather cover embossed in gold leaf.\n “It’s a nice artifact,” Hutchison said, looking at it lovingly. “It’s a great record as well.”", "posttime": "2020-05-02 17:43:51", "tags": "唱片,albums,hutchison", "title": "电子唱片公司按照几十年前的制作方式剪辑专辑", "title_en": "The Electric Recording Co. cuts albums the way they were made decades ago", "transed": 0, "url": "https://www.nytimes.com/2020/04/28/arts/music/electric-recording-co-vinyl.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["唱片", "albums", "hutchison"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000018, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "看来AMD Zen3CPU终于要支持PCID了！至少根据AMD最新的程序员参考手册，内存保护密钥也将面世。AMD已经出版了他们的程序员参考手册的新修订版。详细介绍的新寄存器用于PCID和PKEY。是的，与进程上下文标识符一样的PCID终于在AMD CPU上得到支持。PCID自2010年以来一直由英特尔CPU支持，而自2018年以来，更多的人谈论PCID有助于.", "note_en": "It looks like AMD Zen 3 CPUs will finally be supporting PCID! And memory protection keys are coming too, at least according to AMD&#39;s latest programmer reference manual.\r   AMD has published a new revision of their Programmer&#39;s Reference Manual. The new registers detailed are for PCID and PKEY.\r    Yes,  PCID as in Process Context Identifiers are finally being supported on AMD CPUs. PCID has been supported by Intel CPUs since 2010 while since 2018 have been talked about much more for  helping to  ...", "posttime": "2020-05-02 17:43:49", "tags": "程序,内存,程序员,programmer,pcid", "title": "AMD程序员手册更新指向PCID支持、内存保护密钥", "title_en": "AMD Programmer Manual Update Points to PCID Support, Memory Protection Keys", "transed": 0, "url": "https://www.phoronix.com/scan.php?page=news_item&px=AMD-PRM-PCID-PKEY", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["程序", "内存", "程序员", "pcid"]}, {"category": "", "categoryclass": "", "imagename": "9b59c42c1b2c671334b0a52fd5588141.png", "infoid": 1000016, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很高兴地介绍源代码生成器的第一个预览，这是一个新的C#编译器特性，允许C#开发人员检查用户代码并生成可以添加到编译中的新C#源文件。这是通过一种新的组件来实现的，我们称之为源生成器。\n要开始使用源代码生成器，您需要安装最新的.NET5预览版和最新的Visual Studio预览版。\n除非您一直在密切关注与C#语言和编译器相关的每个原型和提案，否则您现在很有可能会问“什么是源代码生成器”。源代码生成器是在编译期间运行的一段代码，可以检查您的程序以生成附加文件，这些文件与您的其余代码一起编译。\n源代码生成器是C#开发人员可以编写的一种新组件，它允许您做两件主要的事情：\n检索表示正在编译的所有用户代码的编译对象。可以检查该对象，并且可以编写与正在编译的代码的语法和语义模型一起工作的代码，就像现在的分析器一样。\n生成可在编译过程中添加到编译对象的C#源文件。换句话说，您可以在编译代码时提供额外的源代码作为编译的输入。\n将这两件事结合在一起，就是源代码生成器如此有用的原因。您可以使用编译器在编译期间构建的所有丰富元数据检查用户代码，然后将C#代码返回到基于您分析的数据的同一编译中！如果您熟悉Roslyn Analyzer，您可以将源代码生成器视为可以发出C#源代码的分析器。\n源代码生成器是由编译器与任何分析器一起加载的.NET Standard 2.0程序集。它在可以加载和运行.NET标准组件的环境中可用。\n现在您已经了解了什么是Source Generator，让我们来看看它们可以改进的一些场景。\n源生成器最重要的方面不是它是什么，而是它可以启用什么。\n今天，有三种通用方法可以检查用户代码并基于当今技术使用的分析生成信息或代码：运行时反射、IL编织和处理MSBuild任务。源生成器可以是对每种方法的改进。\n运行时反射是很久以前添加到.NET中的一项功能强大的技术。使用它的场景不计其数。一个非常常见的场景是在应用程序启动时对用户代码执行一些分析，并使用这些数据来生成内容。\n例如，当您的Web服务第一次运行时，ASP.NET Core使用反射来发现您定义的构造，这样它就可以“连接”控制器和剃须刀页面之类的东西。虽然这使您能够编写具有强大抽象的简单代码，但它在运行时会带来性能损失：当您的Web服务或应用程序第一次启动时，它无法接受任何请求，直到发现代码信息的所有运行时反射代码都运行完毕！\n使用Source Generator，启动的控制器发现阶段可以在编译时进行，方法是分析源代码并发出“连接”应用程序所需的代码。这可能会导致更快的启动时间，因为今天在运行时发生的操作可能会被推入编译时。\n源代码生成器可以通过不限于在运行时反射来发现类型的方式来提高性能。某些方案涉及多次调用MSBuild C#任务(称为CSC)，以便它们可以检查编译中的数据。正如您可能想象的那样，多次调用编译器会影响构建应用程序所需的总时间！我们正在研究如何使用源代码生成器来消除处理这样的MSBuild任务的需要，因为源代码生成器.。\nSource Generator可以提供的另一个功能是避免使用一些“字符串类型”的API，例如ASP.NET Core在控制器和razor页面之间的路由是如何工作的。使用Source Generator，路由可以是强类型的，必要的字符串将作为编译时详细信息生成。这将减少输入错误的字符串文字导致请求未命中正确控制器的次数。\n随着我们充实API并体验更多编写源代码生成器的经验，我们预计会有更多的场景变得明显。我们还计划与合作伙伴团队合作，帮助他们采用Source Generator，如果这能改善他们的核心场景的话。\n源代码生成器的另一个特点是，它们可以帮助消除基于链接器和AOT(提前)编译优化的主要障碍。许多框架和库大量使用反射或反射发出，如System.Text.Json、System.Text.RegularExpressions以及ASP.NET Core和WPF等发现和/o", "note_en": "We’re pleased to introduce the first preview of Source Generators, a new C# compiler feature that lets C# developers inspect user code and generate new C# source files that can be added to a compilation. This is done via a new kind of component that we’re calling a Source Generator.\n To get started with Source Generators, you’ll need to install the latest  .NET 5 preview and the latest  Visual Studio preview.\n  Unless you’ve been closely following every prototype and proposal related to the C# language and compiler, then there’s a good chance you’re asking, “What is a Source Generator” right now. A Source Generator is a piece of code that runs during compilation and can inspect your program to produce additional files that are compiled together with the rest of your code.\n A Source Generator is a new kind of component that C# developers can write that lets you do two major things:\n Retrieve a  Compilation object that represents all user code that is being compiled. This object can be inspected and you can write code that works with the syntax and semantic models for the code being compiled, just like with analyzers today.\n Generate C# source files that can be added to a  Compilation object during the course of compilation. In other words, you can provide additional source code as input to a compilation while the code is being compiled.\n When combined, these two things are what make Source Generators so useful. You can inspect user code with all of the rich metadata that the compiler builds up during compilation, then emit C# code back into the same compilation that is based on the data you’ve analyzed! If you’re familiar with Roslyn Analyzers, you can think of Source Generators as analyzers that can emit C# source code.\n   A Source Generator is a .NET Standard 2.0 assembly that is loaded by the compiler along with any  analyzers. It is usable in environments where .NET Standard components can be loaded and run.\n Now that you know what a Source Generator is, let’s go through some of the scenarios they can improve.\n  The most important aspect of a Source Generator isn’t what it is, but what it can enable.\n Today, there are three general approaches to inspecting user code and generating information or code based on that analysis used by technologies today: runtime reflection, IL weaving, and juggling MSBuild tasks. Source Generators can be an improvement over each approach.\n Runtime reflection is a powerful technology that was added to .NET a long time ago. There are countless scenarios for using it. A very common scenario is to perform some analysis of user code when an app starts up and use that data to generate things.\n For example, ASP.NET Core uses reflection when your web service first runs to discover constructs you ’ve defined so that it can “wire up ”things like controllers and razor pages. Although this enables you to write straightforward code with powerful abstractions, it comes with a performance penalty at runtime: when your web service or app first starts up, it cannot accept any requests until all the runtime reflection code that discovers information about your code is finished running!  ...\n With a Source Generator, the controller discovery phase of startup could instead happen at compile time by analyzing your source code and emitting the code it needs to “wire up” your app. This could result in some faster startup times, since an action happening at runtime today could get pushed into compile time.\n Source Generators can improve performance in ways that aren ’t limited to reflection at runtime to discover types as well. Some scenarios involve calling the MSBuild C# task (called CSC) multiple times so they can inspect data from a compilation. As you might imagine, calling the compiler more than once affects the total time it takes to build your app! We ’re investigating how Source Generators can be used to obviate the need for juggling MSBuild tasks like this, since Source generators  ...\n Another capability Source Generators can offer is obviating the use of some  “stringly-typed” APIs, such as how ASP.NET Core routing between controllers and razor pages work.  With a Source Generator, routing  can be strongly typed with the necessary strings being generated as a compile-time detail. This  would reduce the amount of times a mistyped string literal leads to a request not hitting the correct controller.\n As we flesh out the API and experience writing Source Generators more, we anticipate more scenarios to become evident. We’re also planning on working with partner teams to help them adopt Source Generators if it improves their core scenarios.\n  Another characteristic of Source Generators is that they can help remove major barriers to linker-based and AOT (ahead-of-time) compilation optimizations. Many frameworks and libraries make heavy use of reflection or reflection-emit, such as  System.Text.Json,  System.Text.RegularExpressions, and frameworks like ASP.NET Core and WPF that discover and/or emit types from user code at runtime.\n We’ve also identified that many of the top  NuGet packages people make heavy use of reflection to discover types at runtime. Incorporating these packages is essential for most .NET apps, so the “linkability” and ability for your code to make use of AOT compiler optimizations is greatly affected. We’re looking forward to working with our wonderful OSS community to see how these packages could use source generators and improve the overall .NET ecosystem.\n  All the previous examples of source generators mentioned earlier are pretty complex. Let’s go through a very basic one to show some of the key pieces you’ll need to write your own Source Generator.\n The goal is to let users who have installed this Source Generator always have access to a friendly “Hello World” message and all syntax trees available during compilation. They could invoke it like this:\n  Over time, we’ll make getting started a lot easier in tools with templates. For now, here’s how to do it manually:\n   The key pieces of this is that the project can generate a NuGet package and it depends on the bits that enable Source Generators.\n 2. Modify or create a C# file that specifies your own Source Generator like so:\n     4. Add the source generator from a project as an analyzer and add  preview to the LangVersion to the project file like this:\n  If you’ve written Roslyn Analyzers before, the local development experience should be similar.\n When you write your code in Visual Studio, you’ll see that the Source Generator runs and the generated source file is added to your project. You can now access it as if you had created it yourself:\n  Note: you will currently need to restart Visual Studio to see IntelliSense and get rid of errors with the early tooling experience\n There are many more things you can do with Source Generators than just something simple like this:\n  The  Source Generators Cookbook goes over some of these examples with some recommended approaches to solving them.\n Additionally, we have a  set of samples available on GitHub that you can try on your own.\n As mentioned earlier, we’re working on making the experience authoring and using Source Generators better in tooling, such as adding templates, allowing for seamless IntelliSense and navigation, debugging, and improving responsiveness and performance in Visual Studio when generating source files.\n  As mentioned earlier in this post, this is the first preview of Source Generators. The intention of releasing this first preview is to let library authors try out the feature and give us feedback on what ’s missing and what needs to change. From preview to preview, there may be changes in the API and characteristics of source generators. We intend on shipping Source Generators as GA with C# 9, and sometime later this year we intend on stabilizing the API and features  ...\n  If you own a .NET library written in C#, now is a great time to evaluate Source Generators and see if they’re a good fit. There’s a good chance that if your library makes heavy use of reflection, you’ll benefit in some way.\n   Give us your feedback and let us know what you need! We’d love to learn more about how you think Source Generators could improve your code, and what you feel is missing or needs changing.\n  This first preview is is exactly that: a first preview. There is a basic editing experience in Visual Studio, but it is not what we would consider “1.0 quality ”right now. We may explore a few different designs over time before we commit to a particular one. One of the biggest areas of focus between now and the .NET 5 release will be improving the editing experience for Source Generators. Additionally, we expect to modify the API to accommodate feedback from partner  ...\n Additionally, we’ll ensure a good experience for how Source Generators are distributed. We’re currently designing them to be very similar to Analyzers that can be shipped alongside a package. They currently use the Analyzer infrastructure to handle configuration in editor tooling.\n  Below is a list of questions we anticipate some people might have. We’ll update this list with more questions as they come.\n  Source Generators are a form of metaprogramming, so it ’s natural to compare them to similar features in other languages like macros. The key difference is that Source Generators don ’t allow you _rewrite_ user code. We view this limitation as a significant benefit, since it keeps user code predictable with respect to what it actually does at runtime. We recognize that rewriting user code is a very powerful feature, but we ’re unlikely to enable Source Generators  ...\n  If you’re an F# programmer (or familiar with the language), then you might have heard of  Type Providers. Source Generators were inspired in part by Type Providers, but there are several differences that make them distinct. The main difference is that Type Providers are a part of the F# language proper and emit types, properties, and methods in-memory based on an external source. Source Generators are a compiler feature that analyzes C# source code, optionally  ...\n  No! Reflection is an incredibly useful tool to use. Reflection does present some performance and “linkability” challenges that can be solvable with Source Generators in some scenarios. We recommend carefully evaluating if Source Generators fit your scenario.\n  Source Generators are similar to analyzers, since both are compiler features that let you plug into a compilation. The key difference is that analyzers ultimately emit diagnostics that can be used to associate with a code fix. Source Generators ultimately emit C# source code that is added to a compilation. There are several other differences discussed in the  design document.\n  No. As mentioned earlier, Source Generators do not allow you to rewrite user source code. We do not intend on allowing them to this. They can only augment a compilation by adding C# source files to it.\n  We intend on shipping Source Generators with C# 9. However, in the event that they aren’t ready in time, we’ll keep them in preview and ensure that users need to opt in to use them.\n  Technically, yes. Source Generators are .NET Standard 2.0 components, and like any project you can change the TFM. However, they only support being loaded into consuming projects as .NET Standard 2.0 components today.\n  Source Generators are currently a C# only feature. Because this is the first preview, there are many things that can change between now and the released version. We do not intend on adding Source Generators to Visual Basic at this time. If you’re an F# developer and want to see this feature added, please search the suggestions or file a new one in the  F# language suggestion repository.\n  This depends on how libraries are authored. Since VB and F# currently don ’t support Source Generators, library authors should avoid designing their features such that they require a Source Generator. Ideally, features have fallbacks to runtime reflection and/or reflection emit. This is something that library authors will need to careful consider before adopting Source Generators. We expect most library authors will use Source Generators to augment –rather  ...\n Why do I not get IntelliSense for generated code? Why does Visual Studio say there’s an error even though it builds?\n You will need to restart Visual Studio after building the source generator to make errors go away and IntelliSense appear for generated source code. After you do that, things will work. Currently, Visual Studio integration is very early on. This current behavior will change in the future so that you don’t need to restart Visual Studio.\n  Eventually, we’ll support navigation and debugging of generated source in Visual Studio. It is not yet supported in this early preview stage.\n  Source Generators can be shipped as NuGet packages, just like Analyzers today. In fact, they use the same “plumbing” as Analyzers. If you’ve ever shipped an Analyzer, then you can easily ship a Source Generator.\n  Eventually, yes. But this is still the first preview of the technology, and a lot of things may need to change to accommodate various scenarios. There is currently no timeline for when Microsoft-authored Source Generators are available.\n  Although Source Generators are not technically a C# language feature, they are in preview. Rather than introduce a new setting just for Source Generators, we decided it would be easier to just use the existing switch that enables preview language features for the C# compiler.", "posttime": "2020-05-02 17:43:41", "tags": "c#,source,代码", "title": "C#源生成器", "title_en": "C# Source Generators", "transed": 0, "url": "https://devblogs.microsoft.com/dotnet/introducing-c-source-generators/", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["c#", "source", "代码"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克(Elon Musk)在一段带有咒骂的简短咆哮中，加倍反对美国各州最近几周出台的原地避难令，以努力阻止这种新型冠状病毒的传播。\n这位特斯拉首席执行官在周三的电话会议上直言不讳地表示，特斯拉被迫关闭工厂对这家电动汽车制造商的业务构成严重风险。此前，该公司公布了出人意料的第一季度利润。\n坦率地说，在我看来，我认为这是侵犯宪法规定的所有权利，将人们强行囚禁在他们家里的行为。它正在以可怕和错误的方式破坏人们的自由，而不是他们来到美国或建设这个国家的原因。这他妈的是什么.-。打扰了。义愤填膺。愤怒。&#34；\n时间回到3月6日，当美国首次开始报告境内病例时，这位亿万富翁首先表示，对冠状病毒的恐慌是愚蠢的。目前美国已知的病例已超过100万例。周二，他在推特上加大了抱怨力度，敦促各国领导人现在就让美国自由，并称赞德克萨斯州计划从周五开始放松规定。\n马斯克在电话会议上表示，这将造成巨大的伤害，不仅对特斯拉，而且对许多公司都是如此。虽然特斯拉能够经受住这场风暴，但也有许多公司做不到。人们毕生所做的一切都在被实时摧毁。\n马斯克甚至称州政府下令关闭被认为不必要的企业是不民主的。\n他说，如果有人想呆在自己的房子里，那太好了，他们应该能够做到。但是说他们不能离开自己的房子，如果他们离开就会被逮捕，这就是法西斯主义者。这是不民主的--这不是自由。把他们该死的自由还给人们。", "note_en": "In a short rant complete with expletives, Elon Musk doubled down on his stance against the shelter-in-place orders introduced by various US states in recent weeks in an effort to stop the novel coronavirus&#39; spread.\n The Tesla chief executive did not mince words on a Wednesday conference call  following the company&#39;s surprise first-quarter profit when he said Tesla&#39;s forced factory shutdowns were a &#34;serious risk&#34; to the electric-car maker&#39;s business.\n &#34;Frankly, I would call it forcible imprisoning of people in their homes against all of, their constitutional rights, in my opinion,&#34; he said. &#34;It&#39;s breaking people&#39;s freedoms in ways that are horrible and wrong and not why they came to America or built this country. What the f---. Excuse me. Outrage. Outrage.&#34;\n Back  on March 6, as the US first began reporting cases within its borders, the billionaire first said panic about the coronavirus &#34;is dumb.&#34; Known US cases now top 1 million. On Tuesday, he ratcheted up his complaints on Twitter, urging leaders to &#34;FREE AMERICA NOW&#34; and praising Texas&#39; plan to relax rules starting Friday.\n   &#34;It will cause great harm, not just to Tesla but to many companies,&#34; Musk said on the call. &#34;And while Tesla will weather the storm, there are many companies that will not. Everything people have worked for their whole life is being destroyed in real time.&#34;\n Musk even went so far as to call it undemocratic for state governments to order shutdowns of businesses deemed nonessential.\n &#34;If somebody wants to stay in their house, that&#39;s great and they should be able to,&#34; he said. &#34;But to say they cannot leave their house and that they will be arrested if they do, that&#39;s fascist. That is not democratic — this is not freedom. Give people back their goddamn freedom.&#34;", "posttime": "2020-05-02 17:43:37", "tags": "埃隆·马斯克,美国,musk,people", "title": "埃隆·马斯克称美国原地避难所订单为法西斯，不是美国人", "title_en": "Elon Musk calls US shelter-in-place orders fascist, un-American", "transed": 0, "url": "https://www.businessinsider.com/elon-musk-rant-coronavirus-shelter-place-orders-fascist-unamerican-imprisoning-2020-4", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["埃隆·马斯克", "美国", "musk", "people"]}, {"category": "", "categoryclass": "", "imagename": "1a5ea31bf8d81610c6dfc716cbd75e1d.jpeg", "infoid": 1000013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在任何组织中，确定文档的优先顺序都可能是一场斗争，但根据我的个人经验，精心设计的文档策略可能会使这场斗争看起来不那么真实。下面包含的是我个人过去用来建议和推广良好的文档标准的模板。虽然它远不是一个包罗万象的战略，但它已经很好地概述了与业务相关的文档的挑战和目标，并确定了解决这些挑战和目标的策略。\n本文档的目的是建立一个持续创建和维护产品文档的策略。这里的主要驱动因素是确保我们面向客户的工具(如API以及移动和Web应用程序)的文档准确且可用。\n在讨论生成文档的目标和策略之前，在设计文档策略时，有几个未回答的问题应该牢记在心：\n所有文档的质量和有效性，无论是什么产品或目标受众，都可以用三个特征来衡量：可读性、准确性和可发现性。虽然这些特征通常用于确定文档质量，但它们也可以用于建立创建文档策略的目标。\n顾名思义，可读性就是一组文档的“可读性”。虽然散文是文档中的一个重要因素，但可读性在很大程度上考虑了文档的目标用户以及如何编写文档。\n与产品开发一样，确定一组文档将由谁使用会极大地影响文档的创建方式。建立一个或多个读者角色将定义文档的技术和详细程度。这里需要注意的是，为营销活动和可用性计划建立的用户角色可能不一定与用于文档目的的角色相同，因为“买方”并不总是与……相同的人。\n当我写东西的时候--不管是文档还是其他东西--我收到的最好的建议就是总是假设你的读者是懒惰、愚蠢和刻薄的。简而言之，这意味着你应该总是为你最难读的读者写作，而不是为你最喜欢的读者写作。懒惰的读者不想从一大堆文本中筛选出答案，愚蠢的读者很难理解大词，而且刻薄的读者总是把模棱两可的措辞搞错。..。\n文档通常分为两种不同类型的信息：描述性信息和基于任务的信息。描述性信息，顾名思义，描述的是什么。它通常用被动语态书写，用来围绕一个成分或主题提供上下文。另一方面，基于任务的信息描述了如何做某事。它通常是用主动语态写的，并引导读者执行一个或多个动作。这两种类型的信息都是必需的。\n不准确的文档是毫无用处的。它不仅没有提供任何有用的信息，而且浪费时间，将用户送上错误的道路，并破坏了可能已经与他们建立的任何表面上的信任。除了确保文档可读之外，验证其准确性即使不是更重要，也同样重要。\n为了确保文档的准确性，应该在整个过程中与原始功能开发人员进行一系列技术审查。第一次审查应该在编写任何文档之前进行，这样作者就有机会在动笔之前了解必要的信息。在写完初稿后，应该进行第二次审查，以验证所写文章的准确性。这确保了文档的编写.。\n高质量文档的第三个，也是最后一个特征是可发现性。当涉及到文档时，如果用户找不到他们要查找的信息，那么文档的准确性或可读性如何都无关紧要。这可以通过几种方式来实现，每种方式都侧重于可发现性的不同方面。\n建立直观和“可浏览”的信息体系结构是使文档可被发现的关键。在此做出努力是使读者能够找到所需的有关给定功能的信息所需的最低限度的努力。实现这一点的一种简单方法是建立一组基于主题的层次结构，将文档归类到以下项下：Dashboard&&gt;Account&&gt;Account Details。\n除了建立信息体系结构以更好地组织文档之外，重点放在可用性上也很重要。在文档上下文中，可用性意味着在组织单页文档时考虑到易用性。代码片段中的语法突出显示、描述性动画GIF和“相关主题”部分等小事情可能会有很大帮助", "note_en": "Prioritizing documentation can be a struggle at any organization but, in my personal experience, a well-crafted documentation strategy can make that struggle seem far less real. Included below is a template I have personally used to propose and promote good documentation standards in the past. While it is far from an all-encompassing strategy, it has done a good job of outlining the challenges and goals of documentation in relationship to the business, and identifies strategies to address them.\n  The purpose of this document is to establish a strategy for creating and maintaining product documentation on an ongoing basis. The primary driver here is to ensure accurate and usable documentation for our customer-facing tooling, such as our API and mobile and web applications.\n  Before addressing goals and strategies for generating documentation, there are a few unanswered questions that should be kept in mind when designing a documentation strategy:\n   The quality and effectiveness of all documentation, regardless of the product or target audience, can be measured against three traits: readability, accuracy, and discoverability. While these traits are often used to determine documentation quality, they can also be used to establish goals for creating a documentation strategy.\n  As the name implies, readability is how “readable” a set of documentation is. While prose is an important factor in documentation, readability largely considers  who the documentation is targeted towards and  how it is written.\n  As with product development, determining who a set of documentation is intended to be consumed by can greatly influence how that documentation is created. Establishing one or more reader personas will define how technical and detailed the documentation should be. It is important to note here that the user personas established for marketing campaigns and usability plans might not necessarily be the same personas used for documentation purposes, as the “buyer ”isn ’t always the same person as  ...\n  When writing something-whether it is documentation or something else entirely-the best advice I ’ve ever received is to always assume that your reader is lazy, stupid, and mean. In a nutshell, what this means is that you should always write for your most difficult reader, not your most agreeable one. Lazy readers don ’t want to sift through a ton of text to get to the answer, stupid readers have a hard time understanding big words, and mean readers always take ambiguous wording the wrong way.  ...\n  Documentation is typically split between two different types of information: descriptive and task-based. Descriptive information, as the name implies, describes what something  is. It is often written with a passive voice and used to provide context around a component or topic. On the flip side, task-based information describes  howto do something. It is typically written in an active voice and directs the reader to perform one or more actions. Both of these types of information are necessary  ...\n  Inaccurate documentation is beyond useless. Not only does it not provide any useful information, it wastes time, sends users down the wrong path, and breaks any semblance of trust that may have been established with them. In addition to making sure that documentation is readable, verifying its accuracy is just as-if not more-important.\n  In order to ensure accurate documentation, a series of technical reviews with the original feature developer should be performed throughout the process. The first review should happen prior to any documentation being written, providing the writer with an opportunity to understand the necessary information before putting pen to paper. After the initial draft is written, a second review should be performed to verify the accuracy of the written piece. This ensures that documentation is written  ...\n  The third, and final trait of high quality documentation is discoverability. When it comes to documentation, it doesn’t matter how accurate or readable something is if the user can’t find the information they are looking for. This can be accomplished in several ways, each of which focus on a different facet of discoverability.\n  Establishing an intuitive and “browseable” information architecture is key to making documentation discoverable. Making an effort here is the minimum effort required to enabling readers to find the information they need about a given feature. A simple way of accomplishing this is to establish a set of topic-based hierarchies to categorize documentation under: Dashboard &gt; Account &gt; Account Details\n  In addition to establishing an information architecture to better organize documentation, it is important to put some focus on usability. Usability, in the context of documentation, means structuring single-page documentation with ease-of-use in mind. Little things like syntax highlighting in code snippets, descriptive animated GIFs, and a “Related Topics” section can go a long way towards making documentation easier to read and parse.\n  Finally, when all else fails, indexing documentation and providing a mechanism to search it can make up for any failings in the other two categories. Search is, quite literally, the most common definition of “discoverability.”\n  While “documentation” is often taken to mean “user manual,” there are actually many different types of documentation that can-and should-be generated. Below is an outline of the types that are most relevant to our organization.\n  Release notes convey, in a nutshell, what has changed in an application from day to day. These are generally bulleted lists of small blurbs, with links out to additional information (where applicable).\n  Reference guides-also known as user manuals-are the “FM” in “RTFM.” They are comprehensive manuals that outline every feature, button, and screen in a product. Often written in an impersonal voice, reference guides are intended to provide information in the form of (typically dry) definitions, examples, and explanations.\n  Where reference guides provide information about how a product works, knowledge base articles provide cut-and-paste solutions to common problems. They should promote best practices and have a more-than-usual eye for accuracy, as users should be expected to follow them word for word. Knowledge base articles should be treated like recipes and focus on how to accomplish something, not why the solution works. To quote Red Hat’s Rich Bowen:\n When you assemble your new Ikea desk, you don’t care why a particular screw size was selected, you just want the instructions, and you expect them to work.\n  The happy middle-ground between reference guides and knowledge base articles are tutorials. They take a little bit of the how in knowledge base articles and combine it with the what and why from the reference guides to craft small, user-friendly pieces of content aimed at empowering the readers with the skills and tools necessary to become a power user. They should be written using a personal voice in a very conversational tone, and guide the reader down a path from question to  ...\n  While the details outlined above draw a clear picture of what the problems are surrounding documentation and philosophies to solve them, they do not offer concrete solutions. To help kickstart a conversation around our own documentation plan, I’ve outlined some common strategies and solutions below.\n  When it comes to documentation versioning, there are two camps: delete vs deprecate. Microsoft, for example, falls squarely under the “deprecate ”camp, as they maintain backwards compatibility beyond reason and find it more valuable to users to retain legacy documentation that is no longer valid or accurate. Deletion, on the other hand, is the more common solution, with outdated documentation being updated or deleted as required. Personally, I am a fan of deletion, because as  ...\n  Technical reviews are necessary for validating the accuracy of documentation at the time of publishing, but what they do not cover is documentation that becomes stale over time. In order to maintain the accuracy of documentation, regardless of publish date, it would be valuable to schedule periodic quality assurance reviews. In addition, all new documentation should include a “related documentation ”audit to ensure that any new information does not supersede or contradict what  ...\n  Just like any other product, gathering user feedback is crucial to ensuring it is providing maximum value. While gathering feedback on documentation can be done using any number of CRM tools, I personally think this makes a good case for open sourcing documentation. Because documentation is inherently public, open sourcing it offers little to no risk with potentially huge rewards. Contributors can be empowered identify and fix inaccurate documentation, while at the same time  ...\n  Usability is more than just making sure documentation is intuitive and clean. It means establishing and adhering to a style guide, and putting an effort towards design. Much like software development, documentation that is written in the same voice and follows the same grammar rules is significantly more understandable than the alternative. Creating this style guide should be a team effort across stakeholders, however this guide by  Write the Docslists some excellent examples  ...\n  The biggest question in documentation is: “how and where do we publish it?” There are a multitude of tools to create both hosted and printed documentation, from  GitBook to  GitHub Pages, however the right solution is the one that makes the most sense for the established documentation strategy (for reference, my personal favorite solution is GitBook, as it is markdown-based, version controlled, mobile friendly, searchable, and built for teams). Whatever solution we choose,  ...", "posttime": "2020-05-02 17:43:29", "tags": "产品,product,文档,documentation", "title": "建立产品文档策略：一个实用模板", "title_en": "Establishing a Product Documentation Strategy: A Practical Template", "transed": 0, "url": "https://medium.com/@zachflower/establishing-a-documentation-strategy-96f75ab7fcb4", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["产品", "product", "文档"]}, {"category": "", "categoryclass": "", "imagename": "73f1c2eaf0c2d08ef1f147f9f5cd4496.jpeg", "infoid": 1000012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是第十七篇探讨联合国十七个可持续发展目标中每一个目标的挑战的第二篇文章。\n今天，有7.95亿人在挨饿。到2050年，预计还会有20亿人加入他们的行列。\n然而，全球粮食生产的效率令人难以置信。世界农民生产的粮食足以养活1.5倍的全球人口。这足以养活100亿人(我们目前有76亿人)。\n我们无法养活整个世界人口的主要原因是食物浪费。在全球范围内，30%-40%的食物被浪费。\n在欠发达国家，这种浪费是由于缺乏保持食物新鲜的基础设施和知识。例如，由于零售和批发商缺乏冷藏，印度损失了30-40%的农产品。\n在更发达的国家，较低的食品相对成本降低了浪费的诱因。随着份量的增加，越来越多的食物被扔掉和浪费。\n我们的食品配送系统效率低下。但到2050年，这种低效不会让20亿人陷入饥饿。\n气候变化将重塑世界农业格局。较冷的气候将变得更有利于农业，但目前许多农业大国将看到产量大幅下降。\n美国中西部地区的玉米产量将至少下降20%。\n为了防范这些变化，农民既需要现代化的农业方法，也需要使他们的农田多样化。\n就结果而言，现代化方法与更新粮食基础设施属于同一个水桶。两者都需要投资和知识来提高产量和粮食供应。\n但是多样化的领域呢？这将更多的作物和方法纳入农业过程。最终，它可以重塑农业本身。\n使我们的作物多样化对我们的健康至关重要。根据联合国的数据，自20世纪90年代以来，75%的作物生物多样性已经消失。农业生物多样性有助于更有营养的饮食，并建立更具弹性和可持续的耕作系统。\n然而，建立有弹性和可持续的农业系统的另一个必要组成部分是降低风险。气候变化引发的影响将撼动许多农业中心。为了将这些对粮食供应的影响降至最低，我们需要分散其生产。\n都市农业将生产健康食品纳入长期与食品生产分离的环境中。\n西雅图的整个社区和公园都有丰富的果树。每年，这种水果中的许多都会掉落、腐烂和浪费。City Fruit看到了需求，开始将这种水果转移到缺乏健康食品的社区。\n在短短几年内，City Fruit开始收获超过55000磅的水果。这一数量的水果不仅养活了数千人，还滋养了他们。它利用了当地的资源，因此提高了社区的复原力。\n为了结束饥饿，我们需要在全球范围内复制这些类型的故事。我们需要确定社区丰富的当地资源，加强它们，并利用它们来改善最需要的人获得食物的机会。", "note_en": "This is the second article of seventeen exploring the challenges of each of the   United Nation’s Seventeen Sustainable Development Goals .\n Today, 795 million people are hungry.  Another 2 billion are expected to join them by 2050.\n However, global food production is incredibly efficient.  The world’s farmers produce enough food to feed 1.5x the global population. That’s enough to feed 10 billion (we are at 7.6 billion currently).\n     Our inability to feed the entirety of the world’s population is mostly due to food waste.  Globally, 30–40% of all food is wasted.\n In less developed countries, this waste is due to lack of infrastructure and knowledge to keep food fresh. For example, India loses 30–40% of its produce because retail and wholesalers lack cold storage.\n In more developed countries, the lower relative cost of food reduces the incentive to waste. And as portion size grows, more and more food gets thrown out and wasted.\n Our food distribution system is inefficient. But this inefficiency won’t drive 2 billion more people into hunger by 2050.\n    Climate change will reshape the world’s agricultural landscape. Colder climates will become more favorable to agriculture, but many current agriculture powerhouses will see significant declines in yield.\n  The US’s Midwest region will see at least a 20% decline in corn production.\n To safeguard against these changes, farmers will need to  both modernize agricultural methods and diversify their fields.\n In terms of outcomes, modernizing methods falls into the same bucket as updating food infrastructure. Both require investment and knowledge to improve yield and food availability.\n But diversifying fields? That incorporates more crops and methods into agricultural processes. And, ultimately, it can reinvent agriculture itself.\n  Diversifying our crops is paramount to our health. According to the UN, 75% of crop biodiversity has disappeared since the 1900s. Agricultural biodiversity contributes to more nutritious diets and builds more resilient and sustainable farming systems.\n However, another necessary component to building resilient and sustainable farming systems is to reduce risk. Climate change-induced impacts will rock many agricultural hubs. To minimize these impacts on food availability, we need to decentralize its production.\n  Urban agriculture incorporates producing healthy food into an environment long detached from its food production.\n  Seattle has an abundance of fruit trees throughout its neighborhoods and parks. Every year, much of this fruit falls, rots, and wastes. City Fruit saw a need and began diverting this fruit to communities lacking healthy food access.\n In just a few years, City Fruit began harvesting over 55,000 pounds of fruit. This amount of fruit not just feeds thousands, but nourishes them as well. It makes use of local resources, and as a result, improves community resiliency.\n To end hunger, we need to replicate these types of stories across the globe. We need to identify communities’ abundant local resources, strengthen them, and utilize them to improve food access to those who need it most.", "posttime": "2020-05-02 17:43:24", "tags": "食物,food,农业", "title": "我们生产的食物足够养活100亿人。那么为什么饥饿依然存在呢？", "title_en": "We produce enough food to feed 10B people. So why does hunger still exist?", "transed": 0, "url": "https://medium.com/@jeremyerdman/we-produce-enough-food-to-feed-10-billion-people-so-why-does-hunger-still-exist-8086d2657539", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["食物", "food", "农业"]}, {"category": "", "categoryclass": "", "imagename": "8da3fa4e33662652fbe4a1f46dbd3169.jpg", "infoid": 1000011, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克是亿万富翁。发明家。一个创业天才。有史以来使大众市场电动汽车可行的第一人。一位能带我们去火星的梦想家。\n他的行为也像一个笨拙的白痴，似乎不能理解关于公共安全、健康、病毒如何工作或何时闭嘴的基本概念。\n周三凌晨，这位汽车天才在推特上发布了特朗普式的“现在自由的美国”--这是对总统一周前堵塞集体意识的“解放”信息的一种情书。这些推文似乎想向观众代表一个激进的想法：美国在冠状病毒封锁期间被剥夺了自由，它必须恢复。用武力吗？也许吧!。这些信息读起来当然像是号召战斗。一位特朗普的支持者回应马斯克说，“最可怕的.。\n事实是这样的：54，362名美国人失去了生命(到目前为止！)。由于冠状病毒-比在越南战争中失去的美国人的生命还要多。美国在冠状病毒病例方面领先于世界(这个数字还在继续增长)，但在检测和医务人员的防护设备方面却严重落后，而且没有正式的重新开放计划。还有一件事是真的：由于这种病毒感染和死亡风险最大的人并不是富有的中年商人。\n另一方面，埃隆·马斯克(Elon Musk)是一位富有的中年工厂老板，他希望自己的生产线恢复满负荷运转，这样他的电动汽车就可以继续赚钱(披露一下，我租了一辆特斯拉Model 3，我越来越质疑马斯克的每一句话都会对这一决定提出质疑)。他的推文不是关于美国自由的。它们不是关于人们的权利。它们是关于他在全球大流行期间获利的愿望。\n事实上，在今天的财报电话会议上，马斯克对冠状病毒原地避难所的订单进行了长篇大论，称这种做法是法西斯主义的，并最终对其对特斯拉供应商的影响变得愤怒起来，称他们正处于超级艰难的时期。数万人的死亡没有被提及。\n这是马斯克正在进行的一场运动。首先(和特朗普一样)他淡化了冠状病毒造成的“恐慌”。然后，他扮演纸上谈兵的科学家，沉思着羟基氯喹将是治疗病毒的有效方法(事实并非如此--事实上它可能会导致人死亡)。在最后一刻，他建议他可能会通过为医院提供呼吸机来帮助前线医务人员。那他就再也没寄过信了。然后他在这件事上撒了谎(当然是在推特上)。\n所有这一切，就像马斯克的许多咆哮一样，都是自助式的。扮演天才，或英雄，或房间里最聪明的人，最后，试图煽动愤怒，这样他就能得到他想要的东西。与马斯克的儿科男孩事件不同，这甚至不是想让自己看起来很酷。这显然是关于商业的，令人遗憾的是，这位首席执行官过去的行为-无论是试图绕过避难所的限制，还是未能支持特斯拉的工人-都说明了整个故事。它..。\n其他每个人都应该认识到他的行为是什么-一种与简单的、老式的贪婪相结合的孩子气的冲动控制问题。听起来耳熟吗？如果说此时此刻我们能从马斯克和特朗普身上学到什么，那就是夸夸其谈和哗众取宠不能取代真正的智慧，不能拯救生命，也不能提供答案。对于我们现在所处的状态来说，实际上需要真正稳定的天才。\n注：这篇帖子已经更新，包括马斯克在今天的特斯拉财报电话会议上的评论。", "note_en": "Elon Musk is a billionaire. An inventor. An entrepreneurial genius. The first person to ever make a mass-market electric vehicle viable. A visionary who will take us to Mars.\n He&#39;s also behaving like a lumbering idiot who can’t seem to understand basic ideas about public safety, health, how viruses work, or when to keep his mouth shut.\n  In the early hours of Wednesday, the car genius tweeted the Trumpian “FREE AMERICA NOW ”—a kind of love letter to the president ’s “LIBERATE ”messages that clogged up the collective consciousness a week ago. These tweets seemingly want to represent a radical idea to the viewer: America has had its freedom taken from it during the coronavirus lockdowns, and it must be restored. By force? Maybe! The messages certainly read like a call to arms. A Trump-supporter responded to Musk that, “The scariest  ...\n  Here’s what’s actually true: 54,362 American lives  have been lost (so far!) due to COVID-19 — more than U.S. lives lost  in the Vietnam war. The U.S. leads the world in coronavirus cases (a number that continues to grow), but is woefully behind in testing, protective equipment for medical workers, and has no formal reopening plan. Here’s what else is true: the people most at risk for infection and death due to this virus aren’t rich, middle-aged businessmen.\n Elon Musk, on the other hand, is a rich, middle-aged factory owner who wants his production lines back at full capacity so he can continue to make a buck on his electric cars (disclosure, I lease a Tesla Model 3, a decision I increasingly question with every Musk quote). His tweets aren’t about American freedom. They aren’t about people’s rights. They are about his desire to profit during a global pandemic.\n In fact, on an earnings call today, Musk  went on a tirade over COVID-19 shelter-in-place orders, calling the practice &#39;fascist,&#39; and ultimately becoming apoplectic about its impact to Tesla suppliers, saying they&#39;re having a &#34;super hard time.&#34; The tens of thousands of deaths were not mentioned.\n  This has been an ongoing campaign from Musk. First (like Trump) he  downplayed the “panic” caused by COVID-19. Then he played armchair scientist, musing that hydroxychloroquine would be effective treatment for the virus (it’s not — in fact it might  be killing people). In the eleventh hour, he suggested  he might help front-line medical workers by providing ventilators to hospitals. Then he  never sent any. Then  he lied about it (on Twitter, of course).\n All of this, like so much of Musk’s bluster, was self-service. Playing genius, or hero, or smartest-guy-in-the-room, and finally, trying to foment anger so he can get something he is after. Unlike Musk&#39;s &#34;pedo guy&#34;  incident, this isn&#39;t even about wanting to seem cool. It&#39;s so obviously, pitifully about business, and the CEO&#39;s past actions — whether it&#39;s trying to skirt  shelter-in-place restrictions or failing to  support workersat Tesla —tell the whole story. It  ...\n Everyone else should recognize his behavior for what it is — a childlike impulse control problem married to simple, old-fashioned greed. Sound familiar? If we can learn anything from Musk and Trump in this moment, it’s that bombast and grandstanding can’t take the place of real intelligence, and don’t save lives or offer answers. For the state we’re in right now, real, stable geniuses are actually needed.\n  Note: This post has been updated to include Musk&#39;s comments on a Tesla earnings call today.", "posttime": "2020-05-02 17:43:20", "tags": "埃隆·马斯克,埃隆,elon,马斯克,musk", "title": "埃隆·马斯克怎么了？", "title_en": "What is wrong with Elon Musk?", "transed": 0, "url": "https://www.inputmag.com/culture/what-the-hell-is-wrong-with-elon-musk", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["埃隆·马斯克", "埃隆", "elon", "马斯克", "musk"]}, {"category": "", "categoryclass": "", "imagename": "c5e52725de99031161460f15b1cfe6f8.jpg", "infoid": 1000010, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，特斯拉首席执行官埃隆·马斯克在推特上发布消息称，特斯拉的股价太高了，股价下跌了至少12%。\n数字显示：就在马斯克发推文之前，该股交易价格为760.23美元。但随后暴跌至717.64美元，并继续下跌。\n这条推文是包括马斯克在内的一系列帖子的一部分，马斯克说他将出售几乎所有的实物财产。\n大局：特斯拉周三公布连续第三季盈利，但表示冠状病毒大流行可能会扰乱其运营。\n在当天的财报电话会议上，马斯克称为应对冠状病毒大流行而实施的居家命令是一种暴行。", "note_en": "Tesla&#39;s share price dropped at least 12% Friday after CEO Elon Musk  tweeted the price was &#34;too high.&#34;\n By the numbers: The stock was trading at 760.23 just before Musk&#39;s tweet, per  CNBC. It plunged to 717.64 and continued to drop.\n The tweet was part of a series of posts that included Musk  saying he was &#34;selling almost all physical possessions.&#34;\n The big picture: Tesla posted profits for the third quarter in a row on Wednesday, but said the coronavirus pandemic was likely to disrupt its operations.\n On an earnings call that day, Musk  called stay-at-home orders, which were implemented in response to the coronavirus pandemic, &#34;fascist&#34; and &#34;an outrage.&#34;", "posttime": "2020-05-02 17:43:11", "tags": "埃隆·马斯克,推特,特斯拉,暴跌,stock", "title": "特斯拉股价暴跌，此前埃隆·马斯克在推特上发文称，特斯拉股价“太高”", "title_en": "Tesla stock plunged after Elon Musk tweeted it was “too high”", "transed": 0, "url": "https://www.axios.com/tesla-stock-elon-musk-tweet-e6f9d9a5-b90e-439d-9467-38a3aaa134f5.html", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["埃隆·马斯克", "推特", "特斯拉", "暴跌", "stock"]}, {"category": "", "categoryclass": "", "imagename": "d8384ad23eada382be6805d7c6466704.jpg", "infoid": 1000007, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "扎根小米A1，安装Burp CA。被代理去打嗝。没别的了，没什么可大惊小怪的。我把浏览器调到隐姓埋名模式。它排除了屏幕截图，因此会有照片。请注意，我没有登录。\n我感兴趣的是参数DATA_LIST。URL decde.base64 decde.Gunzip.JSON data。我不认为应该在那里。\nCyberchef链接不能直接在Twitter上使用，所以这里有一个带有请求的贴纸链接。", "note_en": "Rooted Xiaomi A1, with a Burp CA installed. Proxied to Burp. Nothing more, no need to mess about.I put the browser into &#34;Incognito&#34; mode. It precludes screenshots, hence the photos.Notice I am NOT signed in.\n        The parameter data_list is the one I am interested in.URL decode.base64 decode.Gunzip.JSON data.I don&#39;t think that should be there.\n  Cyberchef links don&#39;t work directly on Twitter, so here&#39;s a link to pastebin with the request.", "posttime": "2020-05-02 17:43:00", "tags": "stealing,data", "title": "小米正在窃取你的搜索历史", "title_en": "Xiaomi is stealing your search history", "transed": 0, "url": "https://twitter.com/cybergibbons/status/1255969992123863041", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["stealing", "data"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1000003, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要继续，请单击下面的框，让我们知道您不是机器人。\n请确保您的浏览器支持JavaScript和Cookie，并且您没有阻止它们加载。有关更多信息，您可以查看我们的和。", "note_en": "To continue, please click the box below to let us know you&#39;re not a robot.\n  Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our   and  .", "posttime": "2020-05-02 17:42:47", "tags": "epic,click", "title": "史诗般的工作崩溃的许多新指标", "title_en": "The Many New Indicators of an Epic Job Collapse", "transed": 0, "url": "https://www.bloomberg.com/opinion/articles/2020-04-30/jobs-collapse-is-deeper-than-the-government-says", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["epic", "click"]}, {"category": "", "categoryclass": "", "imagename": "bd919438ab0c76a949fb877cca17e829.jpg", "infoid": 1000001, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名澳大利亚医生表示，冠状病毒可能会影响患者的血液系统，并可能导致一些年龄在30多岁和40多岁的人中风。\n澳大利亚神经病学家托马斯·奥克斯利博士说，冠状病毒可能会增加一些患者的血液凝结。\n奥克斯利博士说，西奈山医院已经看过五名年轻的冠状病毒患者，他们患上了中风。\n纽约西奈山健康系统的介入神经科医生托马斯·奥克斯利博士说，有一小部分患者患有这种疾病的脑部并发症。\n他告诉7.30：我们看到在西奈山医院就诊的病人中风的数量在增加。\n我们看到的是一种疾病，这种疾病至少通过增加体内的血液凝结来部分发挥作用，这就是为什么我们认为中风发生的风险增加了。\n他说，虽然年长的冠状病毒患者也有中风，但在过去的几周里，年轻患者的数量激增。\n在“新英格兰医学杂志”(The New England Journal Of Medicine)定于下周发表的一篇研究论文中，奥克斯利博士和他的同事们表示，在过去的两周里，医院已经在50岁以下的人群中发现了5例病例。\n相比之下，在过去的12个月里，我们的服务平均每两周治疗0.73名50岁以下的大血管中风患者，该报称。\n它接着说，在年轻患者中，大血管中风和冠状病毒疾病之间的联系需要进一步的调查。\n奥克斯利博士告诉7.30：这肯定是一个很小的样本量，我们正在边走边学。\n我们从全市的同事那里听说，全市的中风人数都在上升。\n现在就确切地知道实际数字是多少还为时过早。\n该研究报告称，武汉冠状病毒爆发的一份报告显示，住院患者的共同中风发生率约为5%，尽管该系列中最年轻的患者年龄为55岁。\n“华盛顿邮报”报道说，美国各地的医学专家记录了冠状病毒患者出现血栓的情况。\n虽然对冠状病毒的研究进展很快，但我们对这种去年年底才出现的疾病仍然有很多不知道的地方。\n他说：我们谈论的是在家感染冠状病毒的人，他们可能有轻微的冠状病毒症状，但突然出现大血管中风，然后需要在紧急情况下入院治疗。\n研究论文称，其中一名患者是一名以前健康的33岁女性，她出现了咳嗽、头痛和寒战，持续了一周。当她开始出现中风症状时，她推迟了寻求紧急护理。\n我们队列中的两名患者有20个小时和26个小时没有叫救护车，因为他们害怕进医院，而且我们被告知，如果你在家生病，发烧和呼吸急促的症状就是你可能会叫救护车的症状。\n他说，任何出现中风症状的人-面部下垂、手臂无力、言语障碍-都应该立即叫救护车。\n空格键用于播放或暂停，M键用于静音，左右箭头键用于查找，上下箭头键用于音量。", "note_en": "An Australian doctor says the coronavirus may affect a patient&#39;s blood system and could have caused strokes in a number of people aged in their 30s and 40s.\n Coronavirus may be increasing blood clotting in some patients, says Australian neurologist Dr Thomas Oxley\n Dr Oxley said Mount Sinai Hospital had seen five young coronavirus patients who had suffered a stroke\n Dr Thomas Oxley, interventional neurologist at Mount Sinai Health System in New York, said a small number of patients were &#34;having brain complications from the disease&#34;.\n &#34;We&#39;re seeing an increase in the number of strokes that are happening in our patients presenting to Mount Sinai Hospital,&#34; he told 7.30.\n &#34;What we are seeing is a disease that is partially working at least by increasing blood clotting in the body, and that is why we think there&#39;s increased risk of stroke occurring.&#34;\n He said while older coronavirus patients had also had strokes, in the last few weeks there had been a &#34;spike of young patients&#34;.\n  In a research paper due to be published next week by the New England Journal of Medicine, Dr Oxley and his colleagues said the hospital had seen five cases in people under the age of 50 in the last two weeks.\n  &#34;For comparison, our service, over the previous 12 months, has treated on average 0.73 patients every two weeks under the age of 50 years with large vessel stroke,&#34; the paper said.\n It went on to say &#34;the association between large vessel stroke and COVID-19 disease in young patients requires further investigation&#34;.\n &#34;It&#39;s certainly a small sample size and we are learning as we go,&#34; Dr Oxley told 7.30.\n &#34;We are hearing from our colleagues around the city that stroke numbers are up all around the city.\n &#34;It&#39;s still too early to know absolutely what the real numbers are going to be.&#34;\n The research paper said a report &#34;from the Wuhan COVID-19 outbreak showed a co-incident stroke rate of about 5 per cent in hospitalised patients; although the youngest patient in that series was 55 years old&#34;.\n The Washington Post reports that medical experts around the United States have recorded coronavirus patients experiencing blood clots.\n While research into COVID-19 is progressing rapidly, there is still a lot we do not know about the disease, which only emerged late last year.\n     &#34;We are talking about people at home with COVID-19, who may have mild symptoms of COVID-19, but are developing a sudden onset of large vessel stroke and then requiring to come into hospital as an emergency,&#34; he said.\n  The research paper said one of the patients was a previously healthy 33-year-old woman who developed a cough, headache and chills lasting one week. When she started showing stroke symptoms, she delayed seeking emergency care.\n &#34;Two of the patients in our cohort did not call the ambulance for 20 and 26 hours because they were afraid of coming into hospital, and because we&#39;ve been told that if you&#39;re sick at home, symptoms of fever and shortness of breath are the ones you might call the ambulance for.&#34;\n He said anyone who develops the symptoms of stroke — &#34;facial droop, arm weakness, speech disturbance&#34; — should call an ambulance immediately.\n  Space to play or pause, M to mute, left and right arrows to seek, up and down arrows for volume.", "posttime": "2020-05-02 17:42:40", "tags": "coronavirus,病毒,冠状病毒,导致,blood", "title": "冠状病毒可导致血液凝块，并可能导致中风。", "title_en": "Coronavirus can cause blood clots and may lead to strokes", "transed": 0, "url": "https://www.abc.net.au/news/2020-04-23/research-suggests-coronavirus-can-cause-blood-clots-and-strokes/12176826", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "导致", "blood"]}, {"category": "", "categoryclass": "", "imagename": "bb9611244c5cdbb3eab5af11f9760f09.png", "infoid": 1000000, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "截至2020年4月29日，全球有超过313万例冠状病毒(冠状病毒)确诊病例，其中美国、西班牙和意大利的确诊病例最多。这个数字很可能是对所有病例的低估，因为一个国家检测冠状病毒的方式可能会对他们检测到的病例数量产生巨大影响。我们探索不同的检测方法如何极大地限制各国平坦感染曲线的能力。\n关于病例数量的统计数据很难在各国之间进行比较。各国在测试人口方面有着截然不同的方法。例如，冰岛的检测次数与人口的比率最高，并对没有症状或与感染者没有明显接触的人进行例行检测。在冠状病毒爆发的前30天，每1000名冰岛人中有近44人接受了检测。相比之下，美国只对部分有症状的人进行检测，\n未能对其大部分或有代表性的人口进行检测的国家可能面临严重的不利影响。意大利贝加莫的案例就是一个很好的例子。[1]由于病毒在没有发现的情况下传播了几周，当2020年3月急性病例和死亡人数开始迅速增加时，它很快就超出了当地医院和殡仪馆的能力。\n关于检测的决定对于平坦感染曲线至关重要。比较意大利沃镇和钻石公主号游轮提供了一个自然的实验来理解不同测试决定的后果。这两个地方的人口都在3000到4000人之间，在疫情期间都实施了类似的隔离政策。然而，Vo‘镇在发现第一例病例后对几乎所有的居民进行了检测，而钻石公主船最初.。\n到最后一轮检测(第一次检测后两周)，Vo‘有6人感染(占人口的0.2%)，2人死亡。相比之下，钻石公主号有712名乘客感染(占总人口的19.2%)，7人死亡。由于在第一轮测试中只检测了可疑病例，钻石公主错过了许多感染者，这些感染者随后在接下来的一段时间里促成了病毒的传播。这两种情况的主要不同之处在于……期间的测试次数不同。\n在各国进行的检测次数和确定的病例数量之间有很强的关系(见下图)。也有证据表明，来自测试的易感人群、感染人群、恢复者和死亡者(SIRD)的统计数据不能代表潜在人群(http://lapogianni.blogspot.com/).。这证明政策制定者一再呼吁“测试、测试、测试”是合理的。它还强调了引导群众……的重要性。", "note_en": "As of April 29th 2020, there were over  3.13 million confirmed cases of coronavirus (COVID-19) globally, with the United States, Spain, and Italy having the highest numbers. This number is most likely an undercount of all cases because the way a country tests for coronavirus can have a huge impact on the number of cases they detect. We explore how different testing approaches can dramatically limit countries’ abilities to flatten the curve of infections.\n Statistics on the number of cases are difficult to compare across countries. Countries have vastly different approaches to testing their populations. For example, Iceland has the highest ratio of number of tests to population and has routinely tested persons with no symptoms or no evident contacts with infected persons. Nearly 44 tests per 1000 Icelanders were administered in the first 30 days of their coronavirus outbreak. In contrast, the US only tests some of the people with symptoms,  ...\n  Countries that fail to test a large or representative portion of their population might face severe adverse effects.   The case of Bergamo in Italy is a case in point. [1] As the virus circulated undetected for weeks, when the number of acute cases and deaths started to increase rapidly in March 2020 it quickly overwhelmed the capacity of local hospitals and funeral homes.\n Decisions on testing are essential to flatten the curve of infections. Comparing the town of Vo ’, Italy and the Diamond Princess cruise ship provides a natural experiment to understand the consequences of different testing decisions. Both places had a population of between 3,000 and 4,000 people and implemented similar isolation policies during the epidemic. However, the town of Vo ’tested almost all of its residents following the first detected case while the Diamond Princess ship initially  ...\n  By the final round of tests (two weeks since the first test), Vo ’had 6 people infected (0.2% of the population) and 2 deaths. In contrast, the Diamond Princess had 712 passengers infected (19.2% of the population) and 7 deaths. By testing only suspicious cases during the very first round of tests, the Diamond Princess had missed many infected people who then contributed to spread the virus in the subsequent period. The main difference between the two cases is the number of tests during  ...\n There is a strong relationship between the number of tests performed and the number of cases identified across countries (see diagram below). There is also evidence that the statistics emerging on Susceptible, Infected, Recovered, and Dead people (SIRD) from tests are not representative of the underlying populations ( http://lapogianni.blogspot.com/). This justifies the repeated calls by policy makers for “testing, testing, testing ”. It also emphasizes the importance of conducting mass  ...", "posttime": "2020-05-02 17:42:35", "tags": "病毒,冠状病毒,测试,testing,检测", "title": "全部测试还是部分测试？一个小镇在检测每个人的冠状病毒方面的关键一课", "title_en": "Testing for all or some? A town's key lesson in testing everyone for Covid-19", "transed": 0, "url": "https://blogs.worldbank.org/opendata/covid-19-testing-all-or-testing-some-towns-key-lesson-testing-everyone-coronavirus", "via": "", "source_name": "Hacker News", "source_domain": "news.ycombinator.com", "real_tags": ["病毒", "冠状病毒", "测试", "testing", "检测"]}]