[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1004534, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "图像擦除这是一个匿名在抗议活动中拍摄的照片的工具。它将从照片中删除标识元数据(Exif数据)，还允许您有选择地模糊图像的某些部分，以覆盖面部和其他可识别的信息。点击打开按钮可打开照片。程序将显示它正在删除的数据。单击确定，然后您可以通过单击保存或右键单击并保存擦除的图像来保存它。最大大小为2500x2500像素-较大的图像将被缩小。您可以选择在图像上绘画或将其模糊。在图像上拖动将在其上作画或使其模糊。您可以通过滑块更改笔刷大小和模糊强度。将模糊设置为零以撤消。所有处理过程都直接在浏览器中进行-不会将任何信息存储或发送到任何位置。错误报告或问题请发送至：everest.Pipkin@gmail.com如果您需要其他方式来覆盖您的数字足迹，我已经在这里收集了一个资源列表。", "note_en": "Image ScrubberThis is a tool for anonymizing photographs taken at protests. It will remove identifying metadata ( Exif data) from photographs, and also allow you to selectively blur parts of the image to cover faces and other identifiable information. Hit the open button to open a photograph. The program will display the data it is removing.Click okay, and you can then save the scrubbed image by hitting save or right clicking on it and saving it. Maximum size is 2500x2500 pixels - larger images will be scaled down.You can select between painting over the image or blurring it out. Dragging on the image will paint on or blur it. You can change your brush size and the intensity of the blur via the sliders. Set the blur to zero to undo.  All processing happens directly in the browser- no information is stored or sent anywhere.Bug reports or questions to: everest.pipkin@gmail.comIf you want other ways to cover your digital footprint, I&#39;ve assembled a  list of resources here.", "posttime": "2020-05-31 23:02:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "抗议,scrubber,图像", "title": "图像洗涤器：将抗议活动中拍摄的照片匿名化的工具", "title_en": "Image Scrubber: tool for anonymizing photographs taken at protests", "transed": 1, "url": "https://everestpipkin.github.io/image-scrubber/", "via": "", "real_tags": ["抗议", "scrubber", "图像"]}, {"category": "", "categoryclass": "", "imagename": "39cf46beee70af9a7a663030f14c80cd.jpg", "infoid": 1004533, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "百多名科学家和临床医生质疑了一个庞大的医院数据库的真实性，该数据库是上周发表的一项有影响力的研究的基础，该研究得出结论，用氯喹和羟基氯喹治疗新冠肺炎患者无济于事，可能会增加心律失常和死亡的风险。\n在致“柳叶刀”编辑理查德·霍顿(Richard Horton)和论文作者的一封公开信中，科学家们要求该杂志提供数据来源的细节，并呼吁世界卫生组织(World Health Organization)或其他机构对这项研究进行独立验证。\n这篇论文的主要作者、哈佛大学教授曼迪普·R·梅赫拉(ManDeep R.Mehra)博士的发言人周五表示，该研究的作者已经要求对他们的工作进行独立的学术审查和审计。\n使用疟疾药物氯喹和羟氯喹防治新冠肺炎一直是公众高度关注的焦点。特朗普总统一直在宣传羟基氯喹的承诺，尽管从随机临床试验中没有黄金标准的证据来证明其有效性，最近他还表示，他正在亲自服用，希望能防止冠状病毒感染。\n科学家们对“柳叶刀”这篇论文的挑战，正值人们对匆忙发表关于新冠肺炎的新医学发现的风险的争论日益激烈的时候。这篇发表于5月22日的论文包括了截至4月14日住院的数万名患者的数据，这意味着作者在短短五周多一点的时间里分析了这些数据宝库，撰写了论文，并对其发现进行了同行审查，速度比往常快得多。\n撰写“柳叶刀”的专家们还批评了这项研究的方法，以及作者拒绝指明任何提供患者数据的医院，也拒绝透露他们所在的国家。拥有该数据库的公司是总部设在芝加哥的Surgisphere。\n科学家们写道：“来自非洲的数据显示，非洲大陆近25%的新冠肺炎病例和40%的死亡病例发生在与外科手术相关的医院，这些医院拥有复杂的患者数据电子记录。”“无论是病例和死亡人数，还是详细的数据收集，似乎都不太可能。”\n批评人士担心的另一个问题是，有关澳大利亚新冠肺炎病例的数据与政府报告不符，其中包括“比研究期间全国发生的住院死亡人数还要多”。\n柳叶刀的女发言人艾米丽·海德(Emily Head)在一封电子邮件中表示，该杂志收到了许多关于这篇论文的询问，并已将问题转给了作者。\n她说：“如有需要，我们会提供进一步的最新消息。”“柳叶刀”鼓励科学辩论，并将在适当的时候在杂志上发表对这项研究的回应，以及作者的回应。\n周六，该杂志对这项研究进行了两次更正，但表示，“论文的研究结果没有任何变化。”\nSapan S.Desai博士是Surgisphere的所有者和创始人，也是这篇论文的作者之一，他极力为这些发现以及该公司数据库的真实性和有效性进行了辩护。他说，官方对冠状病毒病例和死亡人数的统计往往落后于实际病例，这可能可以解释一些差异。\n这篇论文的作者说，他们分析了从六大洲的671家医院收集的数据，这些数据共享了近1.5万名接受过药物治疗的患者和8.1万名没有接受治疗的患者的细粒度医疗信息，同时保护了他们的身份。\n“世界必须明白的是，这是基于注册表的数据，”德赛博士说。“我们无法控制信息的来源。我们所能做的就是报告给我们的数据。“。\n来自巴塞罗那全球卫生研究所的另一组研究人员也向《柳叶刀》的作者和编辑提出了关于Surgisphere数据库的问题。\n撰写和签署这封批评这项研究的信的科学家包括来自学术医学中心的临床医生、研究人员、统计学家和伦理学家，包括哈佛大学公共卫生学院、宾夕法尼亚大学、范德比尔特大学和杜克大学。\n签署人之一、杜克临床研究所(Duke Clinic Research Institute)所长阿德里安·埃尔南德斯(Adrian Hernandez)博士表示，这篇论文包含了许多令人不安的异常现象，“但最大的危险是，这里有一个涵盖600多家医院的如此庞大的数据库，没有人真正知道它的存在。”这是相当了不起的。“。\n各州正在一点一滴地重新开放。这意味着有更多的公共空间可供使用，越来越多的企业被允许重新开业。联邦政府在很大程度上把决定权留给了各州，一些州的领导人把决定权留给了地方当局。即使你没有被告知呆在家里，限制外出旅行和你与其他人的互动仍然是一个好主意。\n接触受污染的物体，然后将细菌感染我们自己，这并不是典型的病毒传播方式。但这是有可能发生的。对流感、鼻病毒、冠状病毒和其他微生物的多项研究表明，包括新型冠状病毒在内的呼吸道疾病可以通过接触受污染的表面传播，特别是在日托中心、办公室和医院等地方。但是，要让这种疾病以这种方式传播，必须发生一系列漫长的事件。保护自己免受冠状病毒感染的最好方法--无论是表面传播还是密切的人类接触--仍然是社交距离、洗手、不碰脸和戴口罩。\n常见症状包括发烧、干咳、疲劳、呼吸困难或呼吸急促。这些症状中的一些与流感的症状重叠，使检测变得困难，但流鼻涕和鼻窦堵塞不太常见。疾控中心还增加了寒战、肌肉疼痛、喉咙痛、头痛和新的味觉或嗅觉丧失作为要注意的症状。大多数人在接触后五到七天就会生病，但症状可能会在短短两天或长达14天内出现。\n如果航空旅行是不可避免的，你可以采取一些措施来保护自己。最重要的是：勤洗手，不要再摸你的脸。如果可能的话，选择靠窗的座位。埃默里大学的一项研究发现，在流感季节，坐在飞机上最安全的地方是靠窗的，因为坐在靠窗座位的人与可能生病的人接触较少。对坚硬的表面进行消毒。当你坐到座位上，双手干净后，用消毒湿巾清洁座椅的硬表面，如头枕和扶手、安全带扣、遥控器、屏幕、座椅靠背口袋和托盘桌子。如果座椅很硬，不透气，或者是皮革或人造革的，你也可以把它擦干净。(在软垫座椅上使用湿巾可能会导致座椅湿润，传播细菌，而不是杀死他们。)。\n自大流行以来，已有超过4000万人-相当于美国工人中的四分之一-申请了失业救济金。美联储(Federal Reserve)5月14日发布的一项调查数据显示，在2月份工作的人中，有五分之一的人报告在3月份或4月初失去了工作或被暂时解雇，这种痛苦高度集中在低收入者身上。一位美联储官员表示，在收入在4万美元或以下的家庭中，整整39%的前工人失去了工作，相比之下，收入超过10万美元的家庭中，这一比例为13%。\n报告冻疮症状的人数有所上升，冻疮是一种疼痛的红色或紫色病变，通常在冬天出现在手指或脚趾上。这些病变正在成为感染新型冠状病毒的另一种症状。冻疮是由小血管在寒冷或潮湿的条件下发生炎症引起的，但它们通常在最冷的冬季月份很常见。联邦卫生官员不将脚趾病变列入冠状病毒症状清单，但一些皮肤科医生正在推动改变，称所谓的Covid Toe应该是检测的充分理由。\n是的，但是要确保你和不住在你家里的人保持6英尺的距离。即使你只是在公园里闲逛，而不是去慢跑或散步，呼吸一些新鲜空气，希望能得到阳光，也是一个好主意。\n测量一个人的体温来寻找发烧的迹象并不像听起来那么容易，因为“正常”的体温数字可能会有所不同，但通常情况下，要注意100.5华氏度或更高的温度。如果你没有温度计(这些天它们可能很贵)，还有其他方法可以确定你是发烧了，还是有患新冠肺炎并发症的风险。\n美国疾病控制与预防中心建议所有美国人在公共场合外出时都要戴上口罩。这是联邦指导方针的转变，反映了新的担忧，即冠状病毒是由没有症状的感染者传播的。到目前为止，疾控中心和世界卫生组织一样，建议普通人除非生病和咳嗽，否则不需要戴口罩。部分原因是为了保存医用级口罩，供医护人员在口罩持续供不应求的时候迫切需要。口罩不能取代洗手和社交距离。\n如果你接触过冠状病毒或认为自己感染了冠状病毒，并出现发烧或咳嗽或呼吸困难等症状，请打电话给医生。他们应该就你是否应该接受检测，如何检测，以及如何在不潜在感染或暴露他人的情况下求医给你提供建议。\n如果你生病了，你认为你已经接触了新的冠状病毒，疾控中心建议你打电话给你的医疗保健提供者，解释你的症状和恐惧。他们会决定你是否需要检查。请记住，有一种可能性--例如，因为缺乏检测工具，或者因为你没有症状--你可能无法接受检测。\n慈善导航器使用基于数字的系统来评估慈善机构，它有一份在受疫情影响的社区工作的非营利性组织的运行名单。你可以通过美国红十字会献血，世界中央厨房已经介入，在主要城市分发食物。\n与这封信的其他几个签名者一样，赫尔南德斯博士也参与了一项羟基氯喹的临床试验，以确定它是否能保护医护人员免受感染。\n澳大利亚墨尔本莫纳什大学(Monash University)传染病教授艾伦·程(Allen Cheng)也签署了这封信，他在电子邮件中表示，应该识别数据库中包括的个别医院。\n他说：“理想情况下，数据库应该公开，但如果这是不可能的，至少应该进行独立审查和审计。”\n外科医生的数据也是本月发表在“新英格兰医学杂志”(The New England Journal Of Medicine)上的一项针对冠状病毒患者的研究的基础。这项研究的作者包括德赛博士和哈佛大学的梅拉博士，以及一篇关于使用抗菌药治疗新冠肺炎的两个版本的文章，这两篇文章都没有发表在成熟的医学期刊上。\n“新英格兰医学杂志”(The New England Journal Of Medicine)女发言人詹妮弗·泽斯(Jennifer Zeis)通过电子邮件表示，该杂志已经意识到人们提出的问题，并正在对其进行调查。\n梅赫拉博士周五发表了一份声明，称该论文的作者“利用了通过Surgisphere获得的数据，提供观察指导，为住院的新冠肺炎患者的护理提供信息”，因为随机临床试验的结果需要一段时间才能公布。\n其他观察性研究之前已经报告了可能与疟疾药物相关的危害，美国食品和药物管理局(Food And Drug Administration)已经就它们的使用发出了安全警告。在柳叶刀的论文发表后，世界卫生组织和其他组织暂停了这种药物的临床试验。", "note_en": "More than 100 scientists and clinicians have questioned the authenticity of a massive hospital database that was the basis for  an influential study published last week that concluded that treating people who have Covid-19 with chloroquine and hydroxychloroquine did not help and might have increased the risk of abnormal heart rhythms and death.\n In an open letter to The Lancet’s editor, Richard Horton, and the paper’s authors, the scientists asked the journal to provide details about the provenance of the data and called for the study to be independently validated by the World Health Organization or another institution.\n A spokeswoman for Dr. Mandeep R. Mehra, the Harvard professor who was the paper’s lead author, said on Friday that the study’s authors had asked for an independent academic review and audit of their work.\n Use of the malaria drugs chloroquine and hydroxychloroquine to prevent and treat Covid-19 has been a focus of intense public attention. President Trump has promoted the promise of hydroxychloroquine, despite the absence of gold-standard evidence from randomized clinical trials to prove its effectiveness, and recently said he was taking it himself in hopes of preventing coronavirus infection.\n The scientists’ challenges to The Lancet paper come at a time of increasing debate about the risks of the rush to publish new medical findings about Covid-19. The paper, published May 22, included data on tens of thousands of patients hospitalized through April 14, meaning that the authors analyzed the trove of data, wrote the paper and went through the journal’s peer review of its findings in just over five weeks, much faster than usual.\n The experts who wrote The Lancet also criticized the study’s methodology and the authors’ refusal to identify any of the hospitals that contributed patient data, or to name the countries where they were located. The company that owns the database is Surgisphere, based in Chicago.\n “Data from Africa indicate that nearly 25 percent of all Covid-19 cases and 40 percent of all deaths in the continent occurred in Surgisphere-associated hospitals which had sophisticated electronic patient data recording,” the scientists wrote. “Both the numbers of cases and deaths, and the detailed data collection, seem unlikely.”\n  Another of the critics’ concerns was that the data about Covid-19 cases in Australia was incompatible with government reports and included “more in-hospital deaths than had occurred in the entire country during the study period.”\n A spokeswoman for The Lancet, Emily Head, said in an email that the journal had received numerous inquiries about the paper and had referred the questions to the authors.\n “We will provide further updates as necessary,” she said. “The Lancet encourages scientific debate and will publish responses to the study, along with a response from the authors, in the journal in due course.”\n On Saturday, the journal  made two corrections to the study but said, “There have been no changes to the findings of the paper.”\n  Dr. Sapan S. Desai, the owner and founder of Surgisphere and one of the paper’s authors, vigorously defended the findings and the authenticity and validity of the company’s database. He said official counts of coronavirus cases and deaths often lagged behind actual cases, which might explain some discrepancies.\n The paper’s authors said they had analyzed data gathered from 671 hospitals on six continents that shared granular medical information about nearly 15,000 patients who had received the drugs and 81,000 who had not, while shielding their identities.\n “What the world has to understand is that this is registry-based data,” Dr. Desai said. “We have no control over the source of the information. All we can do is report the data that is given to us.”\n Another group of researchers from the Barcelona Institute for Global Health also raised questions about the Surgisphere database, both with the authors and editors of The Lancet.\n  Scientists who wrote and signed the letter criticizing the study included clinicians, researchers, statisticians and ethicists from academic medical centers, including Harvard’s T.H. Chan School of Public Health, the University of Pennsylvania, Vanderbilt University and Duke University.\n One of the signatories, Dr. Adrian Hernandez, who heads the Duke Clinical Research Institute, said the paper contained many troubling anomalies, “but the biggest thing that raised a red flag was that here was such a large database across more than 600 hospitals, and no one had really known about its existence. That was quite remarkable.”\n States are reopening bit by bit. This means that more public spaces are available for use and more and more businesses are being allowed to open again. The federal government is largely leaving the decision up to states, and some state leaders are leaving the decision up to local authorities. Even if you aren’t being told to stay at home, it’s still a good idea to limit trips outside and your interaction with other people.\n  Touching contaminated objects and then infecting ourselves with the germs is not typically how the virus spreads. But it can happen. A number  of studies of flu, rhinovirus, coronavirus and other microbes have shown that respiratory illnesses, including the new coronavirus, can spread by touching contaminated surfaces, particularly in places like day care centers, offices and  hospitals. But a long chain of events has to happen for the disease to spread that way. The best way to protect yourself from coronavirus — whether it’s surface transmission or close human contact — is still social distancing, washing your hands, not touching your face and wearing masks.\n  Common symptoms  include fever, a dry cough, fatigue and difficulty breathing or shortness of breath. Some of these symptoms overlap with those of the flu, making detection difficult, but runny noses and stuffy sinuses are less common.  The C.D.C. has also added chills, muscle pain, sore throat, headache and a new loss of the sense of taste or smell as symptoms to look out for. Most people fall ill five to seven days after exposure, but symptoms may appear in as few as two days or as many as 14 days.\n  If air travel is unavoidable,  there are some steps you can take to protect yourself. Most important: Wash your hands often, and stop touching your face. If possible, choose a window seat. A  study from Emory University found that during flu season, the safest place to sit on a plane is by a window, as people sitting in window seats had less contact with potentially sick people. Disinfect hard surfaces. When you get to your seat and your hands are clean, use disinfecting wipes to clean the hard surfaces at your seat like the head and arm rest, the seatbelt buckle, the remote, screen, seat back pocket and the tray table. If the seat is hard and nonporous or leather or pleather, you can wipe that down, too. (Using wipes on upholstered seats could lead to a wet seat and spreading of germs rather than killing them.)\n  More than 40 million people — the equivalent of 1 in 4 U.S. workers — have filed for unemployment benefits since the pandemic took hold. One in five who were working in February reported losing a job or being furloughed in March or the beginning of April,  data from a Federal Reserve survey released on May 14 showed, and that pain was highly concentrated among low earners. Fully 39 percent of former workers living in a household earning $40,000 or less lost work, compared with 13 percent in those making more than $100,000, a Fed official said.\n  There is an uptick in  people reporting symptoms of chilblains, which are painful red or purple lesions that typically appear in the winter on fingers or toes. The lesions are emerging as yet another  symptom of infection with the new coronavirus. Chilblains are caused by inflammation in small blood vessels in reaction to cold or damp conditions, but they are usually common in the coldest winter months. Federal health officials do not include toe lesions in the list of coronavirus symptoms, but some dermatologists are pushing for a change, saying so-called Covid toe should be sufficient grounds for testing.\n  Yes, but make sure you keep six feet of distance between you and people who don’t live in your home.  Even if you just hang out in a park, rather than go for a jog or a walk, getting some fresh air, and hopefully sunshine, is a good idea.\n  Taking one’s temperature to look for signs of fever is not as easy as it sounds, as “normal” temperature numbers can vary, but generally, keep an eye out for a temperature of 100.5 degrees Fahrenheit or higher. If you don’t have a thermometer (they can be pricey these days), there are  other ways to figure out if you have a fever, or are at risk of Covid-19 complications.\n  The C.D.C. has  recommended that all Americans wear cloth masks if they go out in public. This is a shift in federal guidance reflecting  new concerns that the coronavirus is being spread by infected people who have no symptoms. Until now, the C.D.C., like the W.H.O., has advised that ordinary people don’t need to wear masks unless they are sick and coughing. Part of the reason was to preserve medical-grade masks for health care workers who desperately need them at a time when they are in continuously short supply. Masks don’t replace hand washing and social distancing.\n  If you’ve been exposed to the coronavirus or think you have, and have a fever or symptoms like a cough or difficulty breathing, call a doctor. They should give you advice on whether you should be tested, how to get tested, and how to seek medical treatment without potentially infecting or exposing others.\n  If you’re sick and you think you’ve been exposed to the new coronavirus,  the C.D.C. recommends that you call your healthcare provider and explain your symptoms and fears. They will decide if you need to be tested. Keep in mind that there’s a chance — because of a lack of testing kits or because you’re asymptomatic, for instance — you won’t be able to get tested.\n  Charity Navigator, which evaluates charities using a numbers-based system, has a running list of nonprofits working in communities affected by the outbreak. You can give blood through the  American Red Cross, and  World Central Kitchen has stepped in to distribute meals in major cities.\n Like several other signatories of the letter, Dr. Hernandez is involved in a clinical trial of hydroxychloroquine to see if it can protect health care workers from infection.\n Allen Cheng, a professor of infectious diseases at Monash University in Melbourne, Australia, who also signed the letter, said in an email that the individual hospitals included in the database should be identified.\n “Ideally, the database should be made public, but if that isn’t possible, it should at least be independently reviewed and an audit performed,” he said.\n Surgisphere’s data was also the basis of a  study of coronavirus patients published in The New England Journal of Medicine this month by some of the same authors, including Dr. Desai and Harvard’s Dr. Mehra, as well as for two versions of an article on the use of an antimicrobial drug to treat Covid-19 that were not published in an established medical journal.\n Jennifer Zeis, a spokeswoman for The New England Journal of Medicine, said by email that the journal was aware of the questions that had been raised and was looking into them.\n Dr. Mehra issued a statement Friday, saying that the paper’s authors “leveraged the data available through Surgisphere to provide observational guidance to inform the care of hospitalized Covid-19 patients” because the results of randomized clinical trials would not be available for some time.\n Other observational studies had previously reported possible harms associated with the malaria drugs, and the Food and Drug Administration had issued a safety warning about their use. After the Lancet paper was published,  the World Health Organization and other organizations suspended clinical trials of the drugs.", "posttime": "2020-05-31 23:01:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,氯喹,question,数据", "title": "科学家质疑主要羟氯喹研究的有效性", "title_en": "Scientists Question Validity of Major Hydroxychloroquine Study", "transed": 1, "url": "https://www.nytimes.com/2020/05/29/health/coronavirus-hydroxychloroquine.html", "via": "", "real_tags": ["科学家", "氯喹", "question", "数据"]}, {"category": "", "categoryclass": "", "imagename": "4934db9a372c67e59bec090843fe117d.jpg", "infoid": 1004532, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "绝对是Vim的初学者课程。唯一的知识假设是您已经安装了VIM。我讲的是基本动作和命令把你带到一个..。", "note_en": "The absolute beginner class for Vim. Only knowledge assumption made is that you have vim installed. I cover basic motions and commands needed to get you to a...", "posttime": "2020-05-31 23:01:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "vim", "title": "最佳Vim简介", "title_en": "Best Vim Intro", "transed": 1, "url": "https://www.youtube.com/watch?v=Nim4_f5QUxA", "via": "", "real_tags": ["vim"]}, {"category": "", "categoryclass": "", "imagename": "971749dbf4f58bce28d994bf1d0d4459.jpg", "infoid": 1004531, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿-5月31日，一艘龙(Dragon)乘员飞船与国际空间站(International Space Station)对接，不到一天前，这是近九年来首次从美国进行载人轨道太空飞行，创造了历史。\nNASA宇航员鲍勃·本肯(Bob Behnken)和道格·赫尔利(Doug Hurley)的机组人员将这艘航天器命名为奋进号(Endeavour)，于上午10点16分与空间站的和谐舱对接。东边。航天器接近国际空间站的过程很顺利，对接比原计划提前了近15分钟。\n本肯和赫尔利计划在下午12点45分左右打开舱门，进入国际空间站。东部，加入了NASA宇航员克里斯·卡西迪和俄罗斯宇航员阿纳托利·伊万尼辛和伊万·瓦格纳的行列。\n航天器于下午3点22分在猎鹰9号上发射。东部时间5月30日，标志着自2011年7月最后一次航天飞机任务STS-135以来，美国首次载人轨道发射。Behnken和Hurley在5月31日早些时候NASA的一次简短的电视会议上说，航天器工作得很好。\n这包括使用航天器的手动控制，通常是自动操作的。“我想和霍桑的球队形成互补。只是模拟器的一项壮观的工作，因为飞行器的飞行与霍桑的模拟器完全一样，“Hurley说，他指的是SpaceX在加利福尼亚州霍桑的总部。\n然而，本肯指出，这些模拟器并不能完全捕捉发射的体验。他说：“道格和我都在谈论我们在上坡过程中观察到的所有情况。”“虽然这是一次激动人心的旅程，但我认为我们得到了几个小小的惊喜，就车辆移动和摇晃的方式而言。”\n虽然对接是在升空仅19小时后进行的，但两名宇航员表示，他们能够测试航天器的各个方面，包括在太空舱内睡觉的能力。“昨晚我和道格睡了个好觉，”本肯说。“我想，我们在车上实际上睡得这么好，这让我们很惊讶。”", "note_en": "WASHINGTON — A Crew Dragon spacecraft docked with the International Space Station May 31, less than a day after making history as the first human orbital spaceflight from the United States in nearly nine years.\n The spacecraft, named Endeavour by its crew of NASA astronauts Bob Behnken and Doug Hurley, docked with the station’s Harmony module at 10.16 a.m. Eastern. The spacecraft’s approach to the ISS went smoothly, with docking taking place nearly 15 minutes ahead of schedule.\n Behnken and Hurley were scheduled to open hatches and enter the ISS around 12:45 p.m. Eastern, joining NASA astronaut Chris Cassidy and Roscosmos cosmonauts Anatoly Ivanishin and Ivan Vagner.\n  The spacecraft  launched on a Falcon 9 at 3:22 p.m. Eastern May 30, marking the first crewed orbital launch from the United States since the final space shuttle mission, STS-135, in July 2011. Behnken and Hurley said in a brief NASA TV session early May 31 that the spacecraft was working well.\n That included using the manual controls of the spacecraft, which ordinarily operates autonomously. “I want to complement the teams at Hawthorne. Just a spectacular job with the simulator as the vehicle flew exactly like the simulators out in Hawthorne,” Hurley said, referring to SpaceX’s headquarters in Hawthorne, California.\n Behnken, though, noted that those simulators weren’t able to fully capture the experience of launch. “Doug and I were talking about all of the observations that we had all the way uphill,” he said. “While it was an exciting ride, I think we got a couple of minor surprises, just in terms of the way the vehicle is moving and shaking.”\n While docking took place only 19 hours after liftoff, the two astronauts said they were able to test various aspects of the spacecraft, including the ability to sleep inside the capsule. “Doug and I had a good night’s sleep last night,” Behnken said. “We were surprised, I think, at how well we actually slept aboard the vehicle.”", "posttime": "2020-05-31 22:45:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "空间站,dragon,航天器", "title": "与国际空间站对接的机组人员龙码头", "title_en": "Crew Dragon Docks with ISS", "transed": 1, "url": "https://spacenews.com/crew-dragon-docks-with-iss-2/", "via": "", "real_tags": ["空间站", "dragon", "航天器"]}, {"category": "", "categoryclass": "", "imagename": "b3ed81cd763c7bca1935275c4f7bf7e9.jpg", "infoid": 1004530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "直接从美国的太空计划到YouTube，在这里观看NASA的电视直播，从我们对宇宙的探索中获得最新的信息，并了解我们是如何分配的…", "note_en": "Direct from America's space program to YouTube, watch NASA TV live streaming here to get the latest from our exploration of the universe and learn how we dis...", "posttime": "2020-05-31 22:45:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "国际,dragon,了解", "title": "SpaceX与国际空间站开始对接", "title_en": "SpaceX Dragon Docking Started with ISS", "transed": 1, "url": "https://www.youtube.com/watch?v=21X5lGlDOfg", "via": "", "real_tags": ["国际", "dragon", "了解"]}, {"category": "", "categoryclass": "", "imagename": "ec01a3c0124c8085498594aea1a9d11d.jpg", "infoid": 1004529, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们Lionbridge已经编制了一个包含14个电影数据集的列表。从统计学习的角度来看，电影数据集可能很有用，因为您可以使用它们来掌握基本的机器学习概念，而不是依赖于枯燥、深奥的数据集。\n此列表上的许多数据集都包含数据点，如演员和剧组成员、脚本、运行时间和评论。您可以将这些电影数据集用于自然语言处理、情感分析等机器学习项目。\nIMDB电影评论数据集：该数据集包含50,000个电影评论，并且已经平均分为机器学习模型的训练集和测试集。它还为无监督学习算法提供了另外50,000个未注释的文档。\nIMDb评论：这是一个包含25000条电影评论的数据集，用于二元情绪分析任务。\nOMDB API：OMDB API是获取电影信息的Web服务。这是一个众包电影数据库，可以随时更新最新的电影。\nMovieLens 20M数据集：该数据集包括2000万评分和465,000个标签应用程序，由138,000个用户应用于27,000部电影。\n康奈尔影评数据：标有总体情感极性(正面或负面)或主观评分(例如，“两颗半星”)，以及标有主观性状态(主观性或客观性)或极性的句子。\n电影数据集：此数据集包含超过10,000部电影的列表，其中包括许多历史、次要和邪教电影，其中包含有关演员、演员、导演、制片人和制片厂的信息。\n康奈尔电影对话语料库：这个语料库包含10,292对电影角色之间的220,579次对话交流。\n电影数据集：2017年7月或之前发布的4.5万部电影的元数据。数据点包括演员、剧组、剧情关键字、预算、收入、海报、上映日期、语言、制作公司、国家、TMDB票数和平均票数。\n使用IMBDB元数据的32000部电影字幕的语言数据：32000多部电影的元数据。将元数据与来自字幕文件的字数统计类别进行匹配。\n电影产业：该数据集包含6820部电影(1986~2016年，每年220部)。每部电影都有以下数据点：预算、公司、国家、导演、类型、毛收入、评级、上映日期、运行时间、IMDb用户评级、主要演员。\n电影中的猫：这个数据集跟踪电影中出现的所有猫。您可以按导演、制片人和上映日期搜索电影。\n电影身体计数：这个数据集记录了动作片、科幻片和战争片中的银幕杀戮、死亡和身体数量。\n印度电影院：此数据集包含每个电影院的屏幕大小、影院容量、平均票价和位置坐标。", "note_en": "We at Lionbridge have compiled a list of 14 movie datasets. Movie datasets can be useful from a statistical learning perspective, because you can use them to master basic machine learning concepts, instead of relying on dry, esoteric datasets.\n Many of the datasets on this list contain data points such as the cast and crew members, script, run time, and reviews. You could use these movie datasets for machine learning projects in natural language processing, sentiment analysis, and more.\n   IMDB Movie Reviews Dataset: This dataset contains 50,000 movie reviews, and is already split equally into training and test sets for your machine learning model. It also provides a further 50,000 unannotated documents for unsupervised learning algorithms.\n IMDB reviews: This is a dataset of 25,000 movie reviews for binary sentiment analysis tasks.\n OMDb API: The OMDb API is a web service to obtain movie information. It is a crowdsourced movie database that is kept up-to-date with the most current movies.\n MovieLens 20M Dataset: This dataset includes 20 million ratings and 465,000 tag applications, applied to 27,000 movies by 138,000 users.\n Cornell Movie Review Data: Movie review documents labeled with their overall sentiment polarity (positive or negative) or subjective rating (ex. “two and a half stars”), and sentences labeled with their subjectivity status (subjective or objective) or polarity.\n Movie Dataset: This dataset contains a list of over 10,000 movies, including many historical, minor, and cult films, with information on actors, cast, directors, producers, and studios.\n Cornell Movie Dialogs Corpus: This corpus contains 220,579 conversational exchanges between 10,292 pairs of movie characters.\n The Movies Dataset: Metadata for 45,000 movies released on or before July 2017. Data points include cast, crew, plot keywords, budget, revenue, posters, release dates, languages, production companies, countries, TMDB vote counts and vote averages.\n Linguistic Data of 32k Film Subtitles with IMBDb Meta-Data: Meta-data for 32,000+ films. The meta-data are matched to word-count categories from subtitle files.\n  Movie Industry: This dataset includes 6820 movies (220 movies per year, 1986~2016). Each movie has the following data points: budget, company, country, director, genre, gross revenue, rating, release date, runtime, IMDb user rating, main actor.\n Cats in Movies: This dataset tracks all cats featured in movies. You can search the movies by director, producer, and release date.\n Movie Body Counts: This dataset tallies the number of on-screen kills, deaths, and dead bodies in action, sci-fi and war movies.\n Indian Movie Theaters: This dataset contains screen sizes, theater capacities, average ticket prices, and location coordinates for each movie theater.", "posttime": "2020-05-31 22:44:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电影,机器,datasets", "title": "用于机器学习的电影数据集", "title_en": "Movie Datasets for Machine Learning", "transed": 1, "url": "https://lionbridge.ai/datasets/movie-datasets-machine-learning/", "via": "", "real_tags": ["电影", "机器", "datasets"]}, {"category": "", "categoryclass": "", "imagename": "b6a65d94cb47d36d04abf7a7e00e4f65.png", "infoid": 1004528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，在家工作真的提醒了我，我们对互联网的看法是多么的理所当然。一些读者可能会想知道为什么我决定在Techway Endeavour II计算机上工作-嗯，在新冠肺炎疫情之前，我实际上就有一个项目。\n互联网已经成为我们日常生活中重要的一部分，但我们现在通过宽带高速连接体验它的方式与我童年时不同。早在90年代末到2000年代初，我在我的奔腾133 MHz非MMX机器上拨号，机器配备了48MB内存，运行Windows 98SE(以及后来的Windows 2000 Professional)。这一经历本身就反映了这样一个事实，即“永远在线”的互联网并不被认为是一种必要或常态--当时，“ttyt”是“明天与你交谈”的缩写。\n我决定尝试在2020年重新获得拨号体验，方法是“做我自己的ISP”，在家里用我自己的拨号服务器拨号，使用那台回收的老式电脑，在这段23分钟的实时视频中捕捉到它，让所有人都能看到(只有几次剪辑除外)。这个视频的旁白是无剧本的，所以它从一个地方跳到另一个地方，有点仓促，但它是在一次拍摄中完成的。希望你喜欢！\n自20世纪90年代末至2000年初以来，互联网发生了翻天覆地的变化。缓慢的进化很容易被忽略--最初，互联网上充斥着文字和偶尔出现的小图片。布局非常简单，使用最基本的HTML标签，没有样式或自定义字体。音乐充其量也就是MIDI，至少在Macromedia(后来的Adobe)Flash出现之前是这样。页面需要加载100千字节左右，或者说指导方针是这样的，因为现代用户在一个好的链路上通常最多加载5kB/s，MTU为576是非常常见的。加载页面是一场耐心的游戏，因为图像通常是“交错”的，以便以一种模糊的方式加载，在几次传递中逐渐清除。\n实时互动非常有限-文本聊天是当天的顺序，ICQ，mIRC，MSN Messenger，AIM等等。当时，使用SSL的HTTPS连接的想法才刚刚开始在网上银行等应用程序中站稳脚跟。因此，这些聊天消息中的大多数都是在明文情况下发送和接收的。\n在浏览器方面，网景是王者，但后来被Internet Explorer取代。下载需要很长时间--下载一首MP3歌曲很容易就需要16分钟。许多东西都可以直接通过浏览器下载，但下载管理器要明智得多，因为线路随时都可能断线(特别是在有呼叫等待信号或无意中拿起电话的情况下)，这样会让你的进度变得非常糟糕。他们还提供了暂停和恢复下载的可能性。实时多媒体流仍处于初级阶段-RealNetworks RealPlayer曾经是该市场的主导者，提供相当模糊的低帧率视频和听起来刺耳的音频，以适应您的连接速度。Windows Media远远排在第二位。\n那是互联网繁荣的时代，因此发生了很多事情。垃圾电子邮件相当流行，还有愚蠢的“连锁电子邮件”，上面写着“把这封邮件转发给x个人以获得好运”或诸如此类的荒唐事。最糟糕的是，弹出式广告涌入了一个原本纯洁无瑕的商业利益世界。弹出窗口(巧合的是，弹出窗口)在很大程度上是一种分散注意力的广告方式，近年来由于弹出窗口拦截程序的流行，这种方式已经半途而废，这些弹出窗口拦截程序最终集成到了浏览器本身。\n同样值得记住的是，互联网有多么“肮脏”--Internet Explorer(特别是在没有打补丁和没有限制性安全设置的情况下)经常容易受到攻击。但如果你没有使用IE，那么你访问的网站很可能无法正常运行，因为他们垄断了浏览器市场的份额，并推动着自己的标准。\n曾经有一段时间，免费的美国在线试用会时不时地进入你的邮箱，但你安装它后，发现当地的POP(例如悉尼)都被占用了，这样软件就会尝试呼叫更远的(例如堪培拉)，代价是性病呼叫…。紧随其后的是疯狂的冲刺以关闭调制解调器并中止呼叫。还有一些“免费”的拨号上网服务提供商提供免费使用互联网的机会，前提是你愿意坐着看完一连串的横幅广告。这样的服务包括GoConnect和GlobalFreeway-尽管它们的服务经常会被超额订阅，以至于下载速度大约是像样的ISP的一半。对于那些没有按月拨号计划的人来说，也有预付费的拨号上网卡可以购买(有时是打折的)-我们当然用了Optus One的公平份额。\n拨号上网是一种奢侈品-在移动电话价格过高的时代，电话线是即时通信的主要形式。拨号意味着连接电话线，通常是几个小时。单击连接按钮，用户将等待按需建立连接，并仔细听取协商。一个好的连接应该是以独特的V.90Dil信号为特色的连接，这意味着正在进行更高速的连接。之后听到第二组测距信号将表明协商V.90失败，因此将改为建立V.34连接，这意味着较慢的互联网连接(约为速度的60%)和令人沮丧的体验。当然，并不是所有的用户都有V.90，这是K56flex和X2之间标准之战的最终结果，因此对于许多只需要电子邮件的用户来说，较慢的连接仍然是正常的。大多数“无限制的”ISP都有会话时间限制，这将强制断开连续连接时间达到5或6小时的用户，以便给可能在高峰期间遇到忙碌信号的用户一个机会，但通常连接时间越长，连接速度就会变得越慢，因为线路中断和损伤经常会在调制解调器重新培训时降低速度。这通常伴随着20-30秒的无数据吞吐量和轻微的紧张情绪，担心连接可能会永久丢失。\n在天气好的时候，一个连接将推动大约20MiB/小时或大约45.5kbit/s的实际吞吐量。(通常)52,000/50,666/49,333/48,000/46,667 bps连接的其余部分将受到开销的影响，包括数据包报头、校验和、重新传输和在重新训练中损失的时间。那些没有无限连接的人(比如早年的我们)可以花费的时间有限，因此我们会连接并立即开始加载内容和开始下载，以最大限度地利用我们有限的时间。如果我们在5小时内突破100,000,000字节大关，我们会特别高兴，因为这意味着我们挤出了连接中的每一个丢弃。必须为我们的25c本地电话费付费，这意味着我们“一天最多打一次电话”(mantra…)。除非有任何紧急情况。如果我们的电话掉线了，我们就放弃这一天，明天再来。为了最大限度地避免此类问题，我们必须禁用呼叫等待音。\n随着拨号时代的结束，情况确实发生了变化--无限制的互联网套餐变得更便宜了，而无限制的本地电话和互联网套餐则成了一种“东西”。为了寻求最快的连接，一天拨号几次变得负担得起。还可以启用呼叫等待音，以便来电可以“抢占”我们的互联网连接并接通。相反，优质的追加销售是“增压”拨号，它通过“透明”代理重新压缩大图像，承诺提供类似宽带的体验。我们从来没有上当过，…。但这是一个迹象，表明随着宽带ADSL变得司空见惯，互联网正在发生变化。这提醒了我，奇怪的是，ISDN很少在这里常驻部署，尽管一些认真的拨号用户确实有多条线路，并与兼容的ISP配置了多链路，以便在ADSL之前获得更快的速度。在这个阶段，移动互联网也不是什么真正的东西-尽管GPRS确实存在，但数据是按千字节收费的，肯定会让你破产。手机只适用于被称为“WAP”的残缺版本的互联网。\n网站现在很丰富-不再受简单布局的限制，它们现在是各种复杂的Javascript文件的纠结，它们与大量执行客户端计算和级联样式表的新浏览器API交互。拥有不同的字体和高分辨率的图像被认为是“正常的”，而嵌入式自动播放视频现在也成为一种趋势。随着互联网连接变得更快，人们也变得不那么耐心了，页面加载速度仍然至关重要。尽管如此，很少有网站尊重过去的“大小”指引--许多首页都在l。\n但最重要的是，互联网现在“无时无刻不在”。它一直开着。它就像是一种我们没有考虑过的实用工具--也许现在它比电话更重要。它是交付许多虚拟商品(如报纸、游戏、视频订阅)的工具，也是实物商品的市场，但也是实现生产力的一种手段(如电子邮件、在家工作的视频会议、上传新视频的内容创作者)。在新冠肺炎的大流行期间，很明显互联网是多么重要-想象一下试图在拨号上做同样的事情！当我们将这一点与无线网络技术结合起来时，我们不再局限于台式机或笔记本电脑和电话线。\n它甚至已经成为人们创造自己的新闻和分享他们关心的东西的工具，无论是好是坏。连接的速度和配额直接影响你的体验，因为很多东西已经从“下载”模式转变为订阅和流媒体模式。因此，那些拥有较少的人更有可能错过某些在线体验。这一点尤其正确，因为我们非常不喜欢等待。\n我想人们总是可以访问互联网档案馆的网站来感受一下早期的互联网，尽管随着浏览器的变化和爬行并不总是完美的，一些曾经有效的东西可能不再起作用了。在那里，你会发现一种更简单的体验，可能不是那么美观，但仍然可以使用。\n要制作这段视频，我首先需要一些精确的硬件。对我来说幸运的是，它的基础是我打捞上来并最近“拉皮条”的Techway Endeavour II。这涉及到一些硬件更改，以增强系统的功能，同时也不会太现代化，可能会“破坏”体验。当然，液晶屏的周期不准确，是宽屏，但它是我用过的最小的一块。\n视频捕获是通过VGA到HDMI转换器和AVerMedia Live Gamer便携设备执行的，它们系在笔记本电脑上，提供捕获和显示功能。值得注意的是，VGA到HDMI转换器不是定标器，因此许多引导屏幕无法通过LGP捕获，因为它不会与信号同步。但是，一旦启动，就可以很好地支持和捕获1024×[电子邮件受保护]。这就是为什么开始和结束部分依赖于固定在三脚架上的尼康D3400拍摄的视频，系统声音用Zoom H2n录制，并在后期制作中同步。编辑是用我相对业余的编辑技能在Adobe Premiere中完成的。\n要想成为自己的ISP，需要一台服务器来接听电话，并提供必要的网关功能来接入互联网。为此，我决定使用Windows 2000 Professional，这是一个我非常喜欢的操作系统，因为它是一个可靠、坚固的操作系统，对旧设备有很好的硬件支持，没有Windows XP的所有臃肿和繁琐。最棒的是，WGA DRM也不用担心--现在激活可能是一件相当麻烦的事。它安装在我最新的工作站(运行Windows10的Ryzen 7 1700)上运行的VMWare VM容器中。由于我只为演示而运行它，因此安全风险可以忽略不计。\n我选择了Windows2000Professional，因为这给了我对各种调制解调器的很好支持，这些调制解调器在更现代的Windows版本上不起作用，而且它没有任何奇怪的地方可言。我总是觉得它很“管用”。由于CPU的处理能力和便利性过高，我选择只使用从香港购买的便宜的USB软调制解调器来终止来电。要开始使用，只需安装驱动程序，然后添加一个“接受”来电的新连接即可。\n添加一些可以访问此拨入连接的凭据可能是个好主意-我刚刚创建了一个单独的帐户。\n最后，如果您允许呼叫者访问您的LAN，并且您已将虚拟LAN适配器桥接到您的实际家庭LAN，那么任何拨入的人基本上都可以访问您LAN上的任何东西-包括通过您的网关访问互联网。为了获得更好的性能，我决定在网关上的DHCP池之外指定固定的IP地址范围，以防止干扰家庭LAN上的其他计算机。\n为了提供电话接口，我使用了值得信赖的旧Linksys PAP2T VoIP ATA。为了获得最可靠的体验，我将其配置为进行背靠背呼叫，方法是首先为其分配一个静态IP，然后在两条线路上启用IP拨号。我填写了一个虚假的本地注册服务器，但也允许单位在没有注册的情况下拨号。我配置了每条线路的拨号方案，以便一旦接听，线路将停留几秒钟，并按IP自动拨打对方线路的IP(例如，[受保护的电子邮件]：5060将在其拨号方案中自动拨打[受保护的电子邮件]：5061)。这样，拨入线路的任何内容都不会有任何效果，它只会使另一个端口振铃。\n当然，这不是最佳配置。对于通过Linksys PAP2T ATA路由的呼叫音频，即使在背靠背呼叫中，也会由于模数和数模转换而导致信号降级，以及由于时序变化和抖动缓冲器调整而偶尔出现“卡顿”。该呼叫的成功足以一次提供数小时的连接，但通常以28.8kbit/s至31.2kbit/s之间的对称速度进行。\n这种安排是必要的，原因有很多，最大的原因是拨号服务器本身希望看到来自调制解调器的“振铃”信号，以向操作系统发出接听呼叫的信号。一些调制解调器还需要一些“环路电流”来承载呼叫音频，并且不能在“干”线路上发送/接收。在拥有atas之前，我有自己的方法来实现这一点-9v的电池为环路供电将允许必要的环路电流，而在尖端和环上连接24-36v的交流变压器通常会提供足够的“嗡嗡声”来触发调制解调器中的振铃探测器，尽管频率和电压都低于额定电压。这仍然留下了拨号音检测的问题，可以通过将“X3”添加到额外的初始化参数来解决这个问题，但是感觉有点不真实。这种破解安排的优点是能够以33.6kbit/s对称的速度连接，因为线路是死寂的，没有进行A/D或D/A转换。\n我一直想在家里做一台56K的拨号服务器。为此，我有一台Cisco 3840集成多业务路由器，它配备了双模E1卡、PVDM数字语音编解码器卡、FXS/FXO卡和带有30个MICA调制解调器的数字调制解调器卡。在构建了一条粗糙的E1交叉电缆之后，我设法让E1卡形成了从设备到设备的中继，并对其进行了足够远的配置，以使FXS端口启动并从一个端口拨号到另一个端口。\n不幸的是，我从未设法将来自E1中继的呼叫路由到MICA调制解调器，即使它们确实显示为可操作，并且怀疑这是Cisco IOS和VWIC E1卡的问题。也许MICA只能接听来自专用NM接口的呼叫，但是因为我没有可用的接口，所以我不能测试它。更大的问题是我在这上面投入了相当多的时间和金钱，但是时间不多了，而且总是有很多其他事情争抢我的时间，所以它现在被搁置了。\n除此之外，由于密码套件和SSL/TLS协议支持的不同，从浏览器直接连接到安全的HTTPS网站是不可能的，所以我决定。\n..", "note_en": "Working from home over the past few months has really reminded me about how much we take the internet for granted. Some readers may have wondered why I decided to work on the Techway Endeavour II computer – well, I actually had a project in mind from before this COVID-19 epidemic.\n The internet has become a vital part of our everyday lives, but the way we experience it now through broadband high-speed connections is not the way it was in my childhood. Back in the late 90’s to early 2000’s, I was dialling up from my Pentium 133MHz non-MMX machine equipped with 48MB of RAM running Windows 98SE (and later, Windows 2000 Professional). This experience was in itself, reflective of the fact that “always on” internet was not considered a necessity or normality – back then, “ttyt” short for “talk to you tomorrow” was a thing.\n  I decided to try and recapture the dialup experience in 2020 by “being my own ISP” and dialling up to my own dial-up server at home, using the salvaged vintage computer, capturing it for all to see in this 23 minute video that runs in real-time (save for a few cuts). The narration on this video was unscripted, so it jumps a bit from place to place and is a bit rushed, but it was done in one take. I hope you enjoy!\n   Since the late 1990’s and early 2000’s, the internet has changed dramatically. The slow evolution is one that is easy to miss – originally, the internet was mostly filled with text and occasional small images. Layouts were very simplistic, using the most basic of HTML tags without so much as styles or custom fonts. Music was MIDI at best, at least, until the advent of Macromedia (later Adobe) Flash. Pages would be a hundred or so kilobytes to load, or such were the guidelines, as modem users would usually top out at 5kB/s on a good link, with an MTU of 576 being very common. Loading pages was a game of patience, as images were often “interlaced” so as to load up in a fuzzy manner, gradually clearing up over several passes.\n Real-time interactivity was very limited – text chat was the order of the day with ICQ, mIRC, MSN Messenger, AIM to name a few. At that time, the idea of HTTPS connections using  SSL was only just starting to take hold for applications such as online banking. As a result, most of these chat messages were sent and received in the clear.\n In terms of browsers, Netscape was king only to be later dethroned by Internet Explorer. Downloads would take a long time – an MP3 song could easily take 16 minutes to download. Many things could be downloaded directly through the browser, but download managers were much more advisable, since lines could disconnect at any time (especially with call waiting signals or the unintentional picking up of the phone) and losing your progress really sucked. They also offered the possibility of pausing and resuming downloads. Real-time multimedia streaming was still in its infancy – RealNetworks RealPlayer used to be the dominant player in this market, offering rather blotchy, low frame-rate video with harsh-sounding audio that adapted to the speed of your connection. Windows Media was a distant second.\n It was the era of the dot-com boom, thus there was a lot of stuff going on. Email spam was quite a popular thing, along with stupid “chain e-mails” that say “forward this to x people to get good luck” or something ridiculous like that. Worst of all was the influx of pop-up advertising into a world which was originally pure and untainted with such commercial interests. Pop-ups (and coincidentally, pop-unders) were very much a distracting way of advertising which has in more recent years fallen by the wayside, thanks to the popularity of pop-up blockers which eventually became integrated into the browser itself.\n It’s also worth remembering just how “dirty” the internet was as well – Internet Explorer (especially when unpatched and without restrictive security settings) was often vulnerable to exploitation. But if you didn’t use IE, then there’s a good chance that the site you were visiting might not operate properly as they held a monopoly market share on the browser market and pushed for their own standards.\n There was a time when free AOL trials would plop into your mailbox every so often, but you’d install it only to find the local POPs (e.g. Sydney) to be busied out so the software would try calling one further away (e.g. Canberra) at the cost of an STD call … followed by a mad dash to turn off the modem and abort the call. There were also “free” dial-up internet providers that offered the chance to use the internet for free, provided you were willing to sit through a barrage of banner ads. Such services included GoConnect and GlobalFreeway – although often their services would be so oversubscribed that the speed of downloads were about half that of a decent ISP. For those who weren’t on monthly dial-up plans, there were also pre-paid dial-up internet cards one could buy (sometimes on discount) – we certainly used our fair share of Optus ones.\n Dial-up sessions were very much a luxury – the phone line was the main form of immediate communications in an era when mobile telephone calls were exorbitantly expensive. Dialling up meant tying up that phone line, usually for hours. Clicking on the connect button, one would wait as the connection was established on demand, listening carefully to the negotiation. A nice connection would be one featuring the distinctive  V.90 DIL signal, which meant a higher speed connection was taking place. Hearing a second set of ranging signals afterward would indicate a failure to negotiate V.90, thus a  V.34 connection would be made instead, meaning a slower internet connection (~60% of the speed) and a frustrating experience. Of course, not all users had V.90 which was the end result of a war of standards between K56flex and X2, thus slower connections were still normal for many users who merely needed emails. Most “unlimited” ISPs had session time limits which would forcibly disconnect users that hit five or six hours of continuous connection time to give a chance to users which may have encountered busy signals during peak periods, but often the longer a connection went, the slower the connection would become as line interruptions and impairments often pushed the speeds down as the modems retrained. This would usually be accompanied by 20-30 seconds of no data throughput and a slight nervousness that the connection could be permanently lost.\n On a good day, a connection would push about 20MiB/hour or about 45.5kbit/s of actual throughput. The remainder of the (frequently) 52,000/50,666/49,333/48,000/46,667 bps connection would be tied up by overheads including packet headers, checksums, retransmissions and lost time in retrains. Those who didn’t have unlimited connections (such as ourselves in the early days) would have limited hours to spend, thus we would connect and  immediately begin loading content and starting downloads to make the most of our limited time. We would be especially happy if we cracked the 100,000,000 byte mark by five hours as this meant we squeezed every drop out of the connection. Having to pay for our 25c local calls meant that we were on a “one call a day at most” mantra … barring any emergencies. If our call dropped out, we’d just give up for the day and come back tomorrow. To maximise our chances of avoiding such an issue, we’d be sure to disable the call waiting tones.\n Things did change towards the end of the dial-up era – unlimited internet plans became cheaper, while plans with unlimited local calls and internet became a “thing”. It became affordable to dial up several times a day, seeking the fastest connection. It also became possible to enable call waiting tones so that incoming calls could “pre-empt” our internet connection and come through. Instead, the premium upsell was “supercharged” dial-up which promised broadband-like experiences by recompressing large images via their “transparent” proxy. We never fell for that trick … but it was a sign that the internet was changing as broadband ADSL became commonplace. This reminds me that oddly enough, ISDN rarely ever saw deployment here residentially, although some serious dial-up users did have multiple lines and configured a Multi-Link with compatible ISPs to get better speeds prior to ADSL. Mobile internet, at this stage, was not really a thing either – while GPRS did exist, data was charged by the kilobyte and was sure to send you broke. Phones were only good enough for a crippled version of the internet known as “ WAP“.\n  Websites are now rich – no longer constrained by simple layouts, they are now a tangle of various complex Javascript files interacting with a multitude of new browser APIs performing client side computations and Cascading Style Sheets. Having different fonts and high resolution imagery is considered “normal”, while embedded auto-play video is now also becoming a trend. As internet connections have become faster, people are also less patient and page load speeds still remain critical. Despite this, few sites respect the “size” guidance of the past – many front pages are at least several megabytes in size – sometimes the Javascript code itself is already a few megabytes. Efficiency seems to be less of a concern to many, as they take the speed they have for granted. Considering the computer of the late 90s has less computing power and memory than the base-model smartphone of today, it’s not surprising that even the most basic smartphones can process the full internet and technologies such as WAP have fallen by the wayside.\n The capabilities of HTML5, along with HTTP Live Streaming (HLS), WebRTC, has largely meant that client-based streaming (e.g. Windows Media) have mostly been abandoned and technologies such as Flash are quickly being sunset. Even video conferencing could take place in the confines of a browser – in essence, making the browser perhaps the most important piece of software running on the OS. The “standards” world means that browser compatibility issues of the past are much less common (but not entirely eliminated). Nowadays, it seems Google Chrome is on top, while Internet Explorer and its related “cousin” Edge are quite unpopular. Unfortunately, it seems Chrome is now in a position to dominate the creation of standards through its sheer “weight”. Even HTTP did not escape unscathed, with the new HTTP/2 in broad use and HTTP/3 upcoming.\n Perhaps what is most surprising of all is that the internet was never designed for real-time applications, but more than ever, we’ve adapted and come to rely on it to perform such tasks. The acceleration of IP-converged technologies now sees Voice and Video over IP and on-demand video streaming over an internet that is very much suffering congestion during peak hours. Management strategies, often involving “deprioritising” less sensitive traffic are necessary to maintain quality of service – the internet is, in essence, a patch upon a patch upon a patch. The IPv4 address space which we know and love has become exhausted – the new IPv6 address space is still  slowly moving towards mainstream adoption. In the interim, the “end-to-end” model of the internet has been broken by the proliferation of carrier-grade NAT and NAT devices in the home. But asymmetry in the internet is hardly new – many users are more consumers than creators and this is reflected also in connection speeds for most technologies prioritising downloads over uploads (although some of this is due to technical limitations).\n Security has also become very important and with increased computational power comes the opportunity to encrypt everything. Better understandings of weaknesses in prior algorithms has led to new ciphers and versions of TLS to mitigate these issues, along with the “push” by browsers and Google towards HTTPS sites everywhere, it has turned the internet into a much more secure place. Even simple protocols like DNS are being migrated to secure versions in the form of DNS over HTTPS, while very security conscious people may be using a VPN instead (although this deserves its own article in itself). E-mail and instant messaging transactions for the most part are secured as well. Of course, surveillance has also become much more widespread and focused with advertising and social media companies capitalising on such information.\n But most of all, the internet is now “always here”. It’s always on. It’s like a utility we don’t think about – it’s perhaps now even more important than the telephone. It’s the vehicle by which many virtual goods (e.g. newspaper, game, video subscriptions) are delivered, as well as a marketplace for physical goods, but also a means by which productivity is achieved (e.g. emails, video conferencing working from home, content creators uploading new videos). During this COVID-19 pandemic, it’s clear how important the internet is – imagine trying to do the same thing on dial-up! When we team this up with wireless networking technology, no longer are we bound to a desktop or laptop and a phone cable.\n It has even become the vehicle for people to create their own news and share what they care about, for better or for worse. The speed and quota of the connection directly impacts the experiences you can have, as many things have moved away from a “download” model to a subscribe and stream model. As a result, those with less are  more likely to miss out on certain experiences online. This is especially true as we very much don’t like waiting.\n I suppose one could always visit sites on the  Internet Archive to get a feel for the early internet, although as browsers have changed and the crawling is not always perfect, some things that used to work may not work anymore. There, you will find a simpler experience, perhaps not as aesthetically pleasing but still functional nonetheless.\n  To make this video, the first thing I needed was  some period accurate hardware. Luckily for me, the basis was the Techway Endeavour II which I  had salvaged and then recently  “pimped up”. This involved some hardware changes to build up the system’s capabilities, while also not going too modern and perhaps “spoiling” the experience. Of course, the LCD screen is not period accurate, being a wide-screen, but it was the smallest working one I had.\n Video capture was performed with a  VGA to HDMI converter and the Avermedia Live Gamer Portable, tethered to a laptop, providing capture and display. Of note is that the VGA to HDMI converter is not a scaler, thus many of the booting screens could not be captured via the LGP because it would not sync to the signal. However, once booted, 1024× [email protected] is supported and captured just fine. This is why the beginning and end segments relied on video shot on my Nikon D3400 secured on a tripod, with system sounds recorded with a Zoom H2n and synchronised in post-production. Editing was done in Adobe Premiere with my relatively  amateur editing skills.\n  Being your own ISP requires a server of sorts to answer calls and provide the gatewaying functionality necessary to allow internet access. To do this, I decided to call upon Windows 2000 Professional, an OS that I very much loved as a reliable, sturdy OS with good hardware support for older equipment without all of the bloat and frills of Windows XP. Best of all, there’s no nasty WGA DRM to worry about either – activation can be quite a hassle nowadays. This was installed inside of a VMWare VM container running on  my latest workstation, a Ryzen 7 1700 running Windows 10. As I only run this for a demo, the security risks are negligible.\n I chose Windows 2000 Professional as this gave me good support for various sorts of modems which wouldn’t work on more modern versions of Windows, and it didn’t have any quirks to speak of. I’ve always found it just “works”. I opted, owing to the excess of CPU power and convenience, to just use the  cheapy USB soft modem I purchased from Hong Kong to terminate my incoming calls. To get started is just a matter of installing the drivers and then adding a new connection that “accepts” incoming calls.\n  It’s perhaps a good idea to add some credentials that can access this dial-in connection – I just created a separate account.\n  Finally, if you allow the callers to access your LAN and you have the virtual LAN adapter bridged to your actual home LAN, then anyone who dials in can basically access anything on your LAN – including the internet via your gateway. For better performance, I decided to specify fixed ranges of IP addresses outside of the DHCP pool on my gateway to prevent interference with other machines on the home LAN.\n To provide the telephone interface, I used my trusty old  Linksys PAP2T VoIP ATA. To get the most reliable experience, I configured it to do back-to-back calling by first assigning it a static IP and enabling IP dialling on both lines. I filled in a bogus local registration server, but also allowed for the unit to dial without registration at all. I configured the dial plans for each line so that once picked up, the line will sit for a few seconds and auto-dial the IP of the  opposing line by IP (e.g.  [email protected]:5060 would have  [email protected]:5061 autodialled in its dial plan). This way, anything dialled into the line would not have an effect and it will just ring the other port.\n This, of course, is not the optimum configuration. With the call audio routed via the Linksys PAP2T ATA, even on a back-to-back call, there is degradation of the signal due to analog-to-digital and digital-to-analog conversions and the occasional “stutter” due to timing variations and jitter buffer adjustments. The call is successful enough to provide hours of connectivity at a time, but usually at speeds between 28.8kbit/s to 31.2kbit/s symmetrical.\n This arrangement is necessary for a number of reasons – the biggest is that the dial-up server itself expects to see a “ring” signal from the modem to signal the OS to pick up the call. Some modems also require some “loop current” to carry the call audio and can’t transmit/receive on a “dry” line. Prior to owning ATAs, I had my own method to achieve this – a 9v battery powering the loop would allow the necessary loop current, while attaching a 24-36V AC transformer across tip and ring would often provide enough “buzz” to trip the ring detector in a modem despite the frequency and voltage both being below nominal. This still leaves the issue of dialtone detection, which could be overcome by adding “X3” into the additional initialisation parameters, but feels a bit inauthentic. The plus side of this hack arrangement would be the ability to connect at 33.6kbit/s symmetric as the line is  dead silent with no A/D or D/A conversions taking place.\n I have always wanted to make a 56k dial-up server at home some time. To that end, I do have a Cisco 3840 integrated services router equipped with dual-mode E1 cards, a PVDM digital voice codec card, FXS/FXO cards and a digital modem card that has 30 MICA modems on it. Having built a hacky cross-over E1 cable, I managed to get the E1 cards to form a trunk from the unit to the unit and configured it far enough to get the FXS ports up and dialling from port to port.\n Unfortunately, I never managed to get the incoming calls from the E1 trunk to route to the MICA modems even though they do show as operational and suspect this to be an issue with Cisco IOS and the VWIC E1 cards. Perhaps the MICA can only answer calls from a dedicated NM interface, but since I don’t have one kicking about, I can’t test it. The bigger problem is that I had sunk quite a lot of time and money into it, but time is running short and there are always plenty of other things competing for my time, so it’s been shelved for now.\n Aside from this, direct connections from the browsers to secure HTTPS websites was impossible due to the difference in cipher suite and SSL/TLS protocol support, so I decided t\n......", "posttime": "2020-05-31 22:28:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,拨号,dial,连接", "title": "重温2020年的拨号体验", "title_en": "Reliving the Dial-Up Experience in 2020", "transed": 1, "url": "https://goughlui.com/2020/05/31/video-project-reliving-the-dial-up-experience-in-2020/", "via": "", "real_tags": ["2020", "拨号", "dial", "连接"]}, {"category": "", "categoryclass": "", "imagename": "69bf263cd7ee41c8eec29947632eca65.jpg", "infoid": 1004527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "扬登·拉图(Yonden Lhatoo)将美国各地爆发的社会动荡与香港的抗议活动相提并论，以突显华盛顿愤世嫉俗的反华运动的彻头彻尾的虚伪。", "note_en": "Yonden Lhatoo compares the outbreak of social unrest across the US with Hong Kong’s protests to highlight the sheer hypocrisy of Washington’s cynical anti-China campaign.", "posttime": "2020-05-31 22:27:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特朗普,burns,lhatoo", "title": "在美国焦头烂额之际，唐纳德·特朗普(Donald Trump)正忙于“修复”香港问题", "title_en": "While America burns, Donald Trump is busy ‘fixing’ Hong Kong’s problems", "transed": 1, "url": "https://www.scmp.com/news/hong-kong/article/3086823/while-america-burns-donald-trump-busy-fixing-hong-kongs-problems", "via": "", "real_tags": ["特朗普", "burns", "lhatoo"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004526, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我一直在思考分布式系统工程师在工作中学到的教训。我们的很多指示都是通过在生产交通中犯下的错误留下的伤疤。当然，这些伤疤是有用的提醒，但最好是有更多的工程师对他们的手指了如指掌。\n新的系统工程师将发现分布式计算的缺陷和CAP定理作为他们自我教育的一部分。但这些都是抽象的东西，没有经验不足的工程师开始行动所需的直接、可行的建议。令人惊讶的是，新工程师在开始行动时只得到了很少的背景信息。\n以下是我作为一名分布式系统工程师学到的一些经验教训，值得告诉新工程师。有些是微妙的，有些是令人振奋的，但没有一个是有争议的。这份清单是为新上任的分布式系统工程师提供的，以指导他们对所从事领域的思考。虽然不全面，但这是一个良好的开端。\n这份清单最糟糕的特点是集中在技术问题上，很少讨论工程师可能遇到的社会问题。由于分布式系统需要更多的机器和更多的资金，它们的工程师倾向于与更多的团队和更大的组织合作。社交工作通常是任何软件开发人员工作中最困难的部分，也许在分布式系统开发中尤其如此。\n我们的背景、教育和经验使我们倾向于技术解决方案，即使社交解决方案会更有效、更令人愉快。我们一定要改正这一点。人们没有计算机那么挑剔，即使他们的界面没有那么标准化。\n#分布式系统不同，因为它们经常出现故障。当被问及分布式系统与其他软件工程领域的区别时，这位新工程师经常提到延迟，认为这就是分布式计算困难的原因。\n但他们错了。分布式系统工程的不同之处在于失败的概率，更糟糕的是，部分失败的概率。如果格式良好的互斥解锁失败并出现错误，我们可以认为该进程不稳定并使其崩溃。但是分布式互斥锁的解锁失败必须内置于锁定协议中。\n没有从事过分布式计算的系统工程师会想出这样的想法：“嗯，它只会把写操作发送到两台机器上”，或者“它会一直重试写操作，直到成功”。这些工程师并没有完全接受(尽管他们通常在智力上认识到)联网的系统比只存在于一台机器上的系统故障更多，而且故障往往是局部的，而不是全部的。一次写入可能成功，而另一次失败，那么现在我们如何获得一致的数据视图呢？这些部分失败的原因要难得多。\n交换机关闭、垃圾收集暂停使领导者“消失”、套接字写入在另一台机器上看似成功但实际上已失败、一台机器上的磁盘驱动器过低会导致整个群集中的通信协议爬行，依此类推。从本地存储器读取比跨几个交换机读取更稳定。\n#编写健壮的分布式系统比编写健壮的单机系统成本更高。创建健壮的分布式解决方案比创建单机解决方案需要更多的资金，因为有一些故障只在许多机器上才会发生。虚拟机和云技术使分布式系统工程变得更便宜，但不如能够在您已经拥有的计算机上设计、实现和测试那么便宜。而且有一些故障情况很难在一台机器上复制。无论是因为它们只出现在比共享机器所能容纳的数据集大得多的数据集上，还是在数据中心发现的网络条件下，分布式系统往往需要实际的(而不是模拟的)分布来清除它们的错误。当然，模拟是非常有用的。#。\n#健壮的开源分布式系统远不如健壮的单机系统常见。长时间运行多台机器的成本是开源社区的负担。业余爱好者和业余爱好者是开源软件的引擎，他们没有可用的财政资源来探索或修复分布式系统将会遇到的许多问题。业余爱好者利用他们已经拥有的机器，在空闲时间编写开源代码来取乐。很难找到愿意启动、维护和购买大量机器的开源开发人员。\n为法人实体工作的工程师已经填补了部分空缺。但是，他们组织的优先事项可能与您组织的优先事项不一致。\n虽然开放源码社区中的一些人已经意识到了这个问题，但它还没有得到解决。这太难了。#。\n#协调非常困难。尽可能避免协调机器。这通常被描述为“水平可伸缩性”。水平可伸缩性的真正诀窍在于独立性--能够将数据转移到机器上，从而将机器之间的通信和共识保持在最低限度。每当两台机器必须就某件事达成一致时，服务就变得更难实现。信息的传播速度有一个上限，网络交流比你想象的更不稳定，你关于什么构成共识的想法可能是错误的。了解两位将军和拜占庭将军的问题在这里是有用的。(哦，Paxos确实很难实现；这不是脾气暴躁的老工程师认为他们比您更了解。)#。\n#如果你能把你的问题放在内存中，那么它可能是微不足道的。对于分布式系统工程师来说，一台机器上的本地问题是很容易的。当数据刚刚切换离开而不是几个指针取消引用时，更难弄清楚如何快速处理数据。在分布式系统中，自计算机科学诞生以来就有文献记载的老套的效率技巧不再适用。对于在一台机器上运行的算法，有大量的文献和实现，因为大多数计算都是在单一的、不协调的机器上完成的。对于分布式系统，存在的数量明显更少。#。\n#“它很慢”是你调试过的最难的问题。“它很慢”可能意味着执行用户请求所涉及的一个或多个系统很慢。这可能意味着流水线中的一个或多个部分在许多机器上的转换速度很慢。“它很慢”很难，部分原因是问题陈述没有为缺陷的位置提供太多线索。部分故障潜伏在黑暗的角落里，这些故障不会出现在您通常查找的图表上。而且，在降级变得非常明显之前，您不会收到那么多的资源(时间、金钱和工具)来解决它。达珀和齐普金的诞生是有原因的。#\n#在整个系统中实施反压。反压是从服务系统到请求系统的故障信号，以及请求系统如何处理这些故障以防止自身和服务系统过载。背压设计是指在过载和系统故障期间限制资源的使用。这是创建健壮的分布式系统的基本构件之一。\n反压力的实现通常包括要么将新消息丢弃在地板上，要么在资源变得有限或发生故障时将错误发回给用户(在这两种情况下都会增加度量)。到其他系统的连接和请求的超时和指数回退也很重要。\n如果没有适当的反压机制，可能会出现级联故障或意外的消息丢失。当一个系统无法处理另一个系统的故障时，它往往会向依赖它的另一个系统发出故障。#。\n#找到部分可用的方法。部分可用性是指即使系统的某些部分出现故障，也能够返回一些结果。\n搜索是在这里探索的理想案例。搜索系统在搜索结果的好坏和让用户等待多长时间之间进行权衡。典型的搜索系统设置了搜索文档的时间限制，如果该时间限制在搜索完所有文档之前过期，它将返回收集到的任何结果。这使得搜索在面对间歇性减速和错误时更容易扩展，因为这些失败被视为无法搜索其所有文档。该系统允许将部分结果返回给用户，并且增强了它的弹性。\n并考虑Web应用程序中的私人消息收发功能。在某一时刻，无论您做什么，足够多的私人消息存储机器都会在您的用户注意到的同时停机。那么，我们希望在这个系统中出现什么样的局部故障呢？\n这需要考虑一下。人们通常对私人信息为他们(可能还有其他一些用户)关闭更无所谓，而不是对所有用户都刮掉他们的一些信息而感到不安。如果服务超载或其中一台机器出现故障，只出现一小部分用户群的故障比丢失较大部分的数据要好。而且，最重要的是，我们可能不想因为私信出现问题而影响一些不相关的功能，比如公共图片上传。我们愿意做多少工作来保持这些故障域的分离？\n能够在部分可用性中识别这些类型的权衡是很好的，您的工具箱中有这样的工具。#\n#衡量标准是完成工作的唯一途径。公开度量标准(如延迟百分位数、增加某些操作的计数器、变化率)是跨越您认为的系统在生产中所做的和它实际正在做的事情之间的差距的唯一方法。了解系统在第20天的行为与在第15天的行为有何不同，是成功的工程和失败的萨满教之间的区别。当然，度量标准对于理解问题和行为是必要的，但它们不足以知道下一步要做什么。\n把注意力转移到伐木上。日志文件很好用，但它们往往会过时。例如，几个错误类的日志记录通常会占用日志文件中的很大一部分空间，但实际上，只有很小比例的请求会发生。因为记录成功在大多数情况下是冗余的(并且在大多数情况下会炸掉磁盘)，并且因为工程师经常错误地猜测哪些类型的错误类是有用的，所以日志文件被各种各样的奇数位和浮点填满了。更喜欢记录Asif如果有人谁没有看到代码将阅读日志。\n我看到另一位工程师(或我自己)延长了大量的停机时间，在没有首先对照度量进行检查的情况下过度强调了我们在日志中看到的一些奇怪的东西。我还见过另一位工程师(或我自己)夏洛克-福尔摩斯从几条日志中提取出一整套失败的行为。但请注意：首先，我们记住这些成功是因为它们非常罕见；其次，除非衡量标准或实验支持这个故事，否则你不是夏洛克。#。\n#使用百分位数，而不是平均值。百分位数(第50、99、99.9、99.99)比绝大多数分布式系统中的平均值更准确、更具信息量。使用均值假设评估中的度量遵循钟形曲线，但在实践中，这描述了工程师关心的很少的度量。“平均延迟”是一个常见的度量标准，但我从未见过延迟遵循钟形曲线的分布式系统。如果度量不遵循钟形曲线，则平均值毫无意义，并导致错误的决策和理解。用百分位数说话来避开陷阱。默认为百分位数，您将更好地了解用户对您的系统的真实看法。#。\n#学会估计自己的能力。因此，您将了解一天中有多少秒。知道你需要多少台机器才能完成一项任务，这是一个持久的系统和一个需要投入3个月的工作的系统之间的不同之处。或者，更糟糕的是，在完成生产之前需要更换。\n考虑一下推特吧。在一台普通机器的内存中可以容纳多少个tweet id？嗯，2012年底一台典型的机器有24 GB的内存，操作系统需要4-5 GB的开销，另外至少还有一对夫妇来处理请求，一个tweet id是8个字节。这就是包络计算的后面部分，您会发现自己在做这项工作。杰夫·迪恩(Jeff Dean)的数字Everyone ShouldKnow幻灯片是一个很好的预期设定者。#。\n#功能标志是基础设施的铺设方式。“功能标志”是产品工程师在系统中推出新功能的常见方式。功能标志通常与前端A/B测试相关联，在前端A/B测试中，它们用于仅向部分用户展示新的设计或功能。但它们也是更换基础设施的有力途径。\n太多的项目失败了，因为它们进行了“大切换”或一系列“大切换”，然后这些“大切换”被发现的错误工具强迫回滚。相反，通过使用功能标志，您将获得对项目的信心，并降低失败的成本。\n假设您要从单个数据库转向隐藏新存储解决方案详细信息的服务。使用功能标志，您可以在写入旧数据库的同时缓慢增加对新服务的写入，以确保其写入路径足够正确和快速。在写入路径为100%并且回填到服务的数据存储区完成后，您可以使用单独的功能标志开始从服务读取数据，而无需使用用户响应中的数据，以检查性能问题。另一个特征标志可用于在从旧系统和新系统读取数据时执行比较检查。并且可以使用最后一个标志来缓慢地增加来自新系统的“真实”读数。\n通过将部署分解为多个步骤，并为您自己提供快速和部分的特性标志反应，您可以更容易地在升级过程中发现错误和性能问题，而不是在“大爆炸”发布时发现它们。如果出现问题，您只需立即将功能标志设置压回较低(可能为零)的设置即可。调整速率可以让你在不同的流量下进行调试和实验，因为你知道你遇到的任何问题都不是完全的灾难。有了功能标志，您还可以选择其他迁移策略，如基于每个用户移动请求，从而更好地洞察新系统。当您的新服务仍处于原型阶段时，您可以使用较低设置的标志来使您的新系统消耗更少的资源。\n现在，对于训练有素的开发人员或受过良好培训的新工程师来说，功能标志听起来就像是一堆糟糕的条件。使用功能标志意味着接受拥有多个版本的基础设施和数据是一种规范，而不是罕见。这是一个深刻的教训。在单机系统中运行良好的东西在分布式问题面前有时会步履蹒跚。\n最好将功能标志理解为一种权衡，以牺牲局部复杂性(在代码中，在一个系统中)来换取全局简单性和弹性。#。\n#明智地选择id空格。您为系统选择的ID空间将塑造您的系统。\n获取数据所需的ID越多，对数据进行分区的选择就越多。获取数据所需的ID越少，使用系统输出就越容易。\n考虑一下Twitter API的版本1。获取、创建和删除推文的所有操作都是针对每个推文的单个数字ID完成的。tweet id是一个简单的64位数字，它没有连接到任何其他数据。随着tweet数量的增加，很明显，如果同一用户的所有tweet都存储在同一台机器上，那么创建用户tweet时间轴和其他用户订阅的时间轴就可以有效地构建。\n但是公共API要求每个tweet只能由twetid寻址。要按用户划分tweet，必须构造查找服务。知道哪个用户拥有哪个tweet id的人。如果有必要的话，这是可行的，但要付出不小的代价。\n另一种API可以在任何推文查找中要求用户ID，并且最初简单地使用推文ID进行存储，直到用户分区的Storagecame在线为止。另一种替代方案将用户ID包括在推特ID本身中，代价是推特ID不再是k排序的和数字的。\n注意您的ID中编码的是哪种信息，无论是明确的还是隐含的。客户端可能会使用您的ID结构来解除私有数据的匿名化，以意想不到的方式爬行您的系统(自动递增ID是非典型的痛点)，或者执行大量其他攻击。#。\n#利用数据局部性。数据的处理和缓存离其持久存储越近，处理就越高效，保持缓存的一致性和快捷性就越容易。与指针取消引用和Fread(3)相比，网络有更多的故障和更多的延迟。\n当然，数据局部性意味着在空间上就近，但也意味着在时间上就近。如果多个用户几乎同时发出同样昂贵的请求，也许可以将他们的请求合并为一个。如果对同一类数据的多个请求彼此接近，则可以将它们合并为一个更大的请求。经常这样做可以降低被监听的通信，并更容易进行故障管理。#。\n#将缓存数据写回永久存储是错误的。这发生在比你想象的更多的系统中。尤其是那些最初由没有分布式系统经验的人设计的。您将继承的许多系统都会有此缺陷。如果实现者谈论“俄罗斯玩偶缓存”，那么您很有可能会遇到非常明显的错误。这个条目本可以从列表中删除，但我心里对它有一种特别的憎恨。此缺陷的常见表现形式是用户信息(例如，屏幕名称、电子邮件和散列密码)神秘地恢复到以前的值。#。\n#计算机的功能超出您的想象。在今天的领域里，没有太多经验的实践者对机器的能力有大量的错误信息。\n2012年底，一台轻型Web服务器拥有6个或更多处理器、24 GB内存和超过您所能使用的磁盘空间。在一台机器上的现代语言运行时中，一个相对复杂的CRUD应用程序能够在几百毫秒内每秒处理数千个请求。这是一个很深的下限。就操作能力而言，在大多数情况下，每台机器每秒数百个请求并不值得吹嘘。\n获得更好的性能并不难，特别是如果您愿意根据您的测量来分析您的应用程序并引入效率的话。#\n#使用CAP定理来批判系统。CAP定理不是你可以用来构建系统的东西。这不是一个你可以作为第一原则并从中推导出工作系统的定理。它的概观太笼统了，可能的解决方案的空间也太广了。\n但是，它非常适合于批评分布式系统设计，并了解需要进行哪些权衡。进行系统设计并迭代CAP对其子系统施加的约束，最终会给您留下更好的设计。作为家庭作业，将CAP定理的约束应用于俄罗斯玩偶缓存的真实实现。\n最后一个注意事项：在C、A和P中，您不能选择CA。#。\n#提取服务。“服务”在这里指的是“结合了比存储系统更高级的逻辑的分布式系统，并且通常具有请求-响应样式的API”。注意代码更改，如果将代码。\n..", "note_en": "I’ve been thinking about the lessons distributed systems engineers learn onthe job. A great deal of our instruction is through scars made by mistakesmade in production traffic. These scars are useful reminders, sure, but it’dbe better to have more engineers with the full count of their fingers.\n New systems engineers will find the  Fallacies of DistributedComputing and the  CAP theorem as part of theirself-education. But these are abstract pieces without the direct, actionableadvice the inexperienced engineer needs to start moving  1. It’s surprisinghow little context new engineers are given when they start out.\n Below is a list of some lessons I’ve learned as a distributed systems engineerthat are worth being told to a new engineer. Some are subtle, and some aresurprising, but none are controversial. This list is for the new distributedsystems engineer to guide their thinking about the field they are takingon. It’s not comprehensive, but it’s a good beginning.\n The worst characteristic of this list is that it focuses on technical problemswith little discussion of social problems an engineer may run into. Sincedistributed systems require more machines and more capital, their engineerstend to work with more teams and larger organizations. The social stuff isusually the hardest part of any software developer’s job, and, perhaps,especially so with distributed systems development.\n Our background, education, and experience bias us towards a technical solutioneven when a social solution would be more efficient, and more pleasing. Let’stry to correct for that. People are less finicky than computers, even if theirinterface is a little less standardized.\n  #  Distributed systems are different because they fail often. When asked whatseparates distributed systems from other fields of software engineering, thenew engineer often cites latency, believing that’s what makes distributedcomputation hard.\n But they’re wrong. What sets distributed systems engineering apart is theprobability of failure and, worse, the probability of partial failure. If awell-formed mutex unlock fails with an error, we can assume the process isunstable and crash it. But the failure of a distributed mutex’s unlock must bebuilt into the lock protocol.\n Systems engineers that haven’t worked in distributed computation will come upwith ideas like “well, it’ll just send the write to both machines” or “it’lljust keep retrying the write until it succeeds”. These engineers haven’tcompletely accepted (though they usually intellectually recognize) thatnetworked systems fail more than systems that exist on only a single machineand that failures tend to be partial instead of total. One of the writes maysucceed while the other fails, and so now how do we get a consistent view ofthe data? These partial failures are much harder to reason about.\n Switches go down, garbage collection pauses make leaders “disappear”,socket writes seem to succeed but have actually failed on the other machine, aslow disk drive on one machine causes a communication protocol in the wholecluster to crawl, and so on. Reading from local memory is simply more stablethan reading across a few switches.\n  #  Writing robust distributed systems costs more than writing robustsingle-machine systems. Creating a robust distributed solution requires moremoney than a single-machine solution because there are failures that onlyoccur with many machines. Virtual machine and cloud technology makedistributed systems engineering cheaper but not as cheap as being able todesign, implement, and test on a computer you already own. And there arefailure conditions that are difficult to replicate on a singlemachine. Whether it’s because they only occur on dataset sizes much largerthan can be fit on a shared machine, or in the network conditions found indatacenters, distributed systems tend to need actual, not simulated,distribution to flush out their bugs. Simulation is, of course, very useful. #\n #  Robust, open source distributed systems are much less common than robust,single-machine systems. The cost of running many machines for long periodsof time is a burden on open source communities. Hobbyists and dilettantes arethe engines of open source software and they do not have the financialresources available to explore or fix many of the problems a distributedsystem will have. Hobbyists write open source code for fun in their free timeand with machines they already own. It’s much harder to find open sourcedevelopers who are willing to spin up, maintain, and pay for a bunch ofmachines.\n Some of this slack has been taken up by engineers working for corporateentities. However, the priorities of their organization may not be in linewith the priorities of your organization.\n While some in the open source community are aware of this problem, it’s notyet solved. This is hard. #\n #  Coordination is very hard. Avoid coordinating machines whereverpossible. This is often described as “horizontal scalability”. The real trickof horizontal scalability is independence – being able to get data tomachines such that communication and consensus between those machines is keptto a minimum. Every time two machines have to agree on something, the servicebecomes harder to implement. Information has an upper limit to the speed it cantravel, and networked communication is flakier than you think, and your ideaof what constitutes consensus is probably wrong. Learning about the  TwoGenerals and  Byzantine Generals problems is usefulhere. (Oh, and Paxos really is  very hard to implement; that’s notgrumpy old engineers thinking they know better than you.) #\n #  If you can fit your problem in memory, it’s probably trivial. To adistributed systems engineer, problems that are local to one machine areeasy. Figuring out how to process data quickly is harder when the data is afew switches away instead of a few pointer dereferences away. In a distributedsystem, the well-worn efficiency tricks documented since the beginning ofcomputer science no longer apply. Plenty of literature and implementations areavailable for algorithms that run on a single machine because the majority ofcomputation has been done on singular, uncoordinated machines. Significantlyfewer exist for distributed systems. #\n #  “It’s slow” is the hardest problem you’ll ever debug. “It’s slow” mightmean one or more of the number of systems involved in performing a userrequest is slow. It might mean one or more of the parts of a pipeline oftransformations across many machines is slow. “It’s slow” is hard, in part,because the problem statement doesn’t provide many clues to the location of theflaw. Partial failures, ones that don’t show up on the graphs you usually lookup, are lurking in a dark corner. And, until the degradation becomes veryobvious, you won’t receive as many resources (time, money, and tooling) tosolve it.  Dapper and  Zipkin were built for a reason. #\n #  Implement backpressure throughout your system. Backpressure is thesignaling of failure from a serving system to the requesting system and howthe requesting system handles those failures to prevent overloading itself andthe serving system. Designing for backpressure means bounding resourceuse during times of overload and times of system failure. This is oneof the basic building blocks of creating a robust distributed system.\n Implementations of backpressure usually involve either dropping newmessages on the floor, or shipping errors back to users (and incrementinga metric in both cases) when a resource becomes limited or failuresoccur. Timeouts and exponential back-offs on connections and requests to othersystems are also essential.\n Without backpressure mechanisms in place, cascading failure or unintentionalmessage loss become likely. When a system is not able to handle the failuresof another, it tends to emit failures to another system that depends on it. #\n #  Find ways to be partially available. Partial availability is being able toreturn some results even when parts of your system is failing.\n Search is an ideal case to explore here. Search systems trade-off between howgood their results are and how long they will keep a user waiting. A typicalsearch system sets a time limit on how long it will search its documents, and,if that time limit expires before all of its documents are searched, it willreturn whatever results it has gathered. This makes search easier to scale inthe face of intermittent slowdowns, and errors because those failures aretreated the same as not being able to search all of their documents. Thesystem allows for partial results to be returned to the user and itsresilience is increased.\n And consider a private messaging feature in a web application. At some point, nomatter what you do, enough storage machines for private messaging will be downat the same time that your users will notice. So what kind of partial failure dowe want in this system?\n This takes some thought. People are generally more okay with private messagingbeing down for them (and maybe some other users) than they are with all usershaving some of their messages go missing. If the service is overloaded or one ofits machines are down, failing out just a small fraction of the userbase ispreferable to missing data for a larger fraction. And, on top of that choice, weprobably don’t want an unrelated feature, like public image upload, to beaffected just because private messaging is having a problem. How much work arewe willing to do to keep those failure domains separate?\n Being able to recognize these kinds of trade-offs in partial availability isgood to have in your toolbox. #\n #  Metrics are the only way to get your job done. Exposing metrics (such aslatency percentiles, increasing counters on certain actions, rates of change)is the only way to cross the gap from what you believe your system does inproduction and what it actually is doing. Knowing how the system’s behavior onday 20 is different from its behavior on day 15 is the difference betweensuccessful engineering and failed shamanism. Of course, metrics are necessaryto understand problems and behavior, but they are not sufficient to know whatto do next.\n A diversion into logging. Log files are good to have, but they tend tolie. For example, it’s very common for the logging of a few error classes totake up a large proportion of a space in a log file but, in actuality, occurin a very low proportion of requests. Because logging successes is redundantin most cases (and would blow out the disk in most cases) and becauseengineers often guess wrong on which kinds of error classes are useful to see,log files get filled up with all sorts of odd bits and bobs. Prefer logging asif someone who has not seen the code will be reading the logs.\n I’ve seen a good number of outages extended by another engineer (or myself)over-emphasizing something odd we saw in the log without first checking itagainst the metrics. I’ve also seen another engineer (or myself)Sherlock-Holmes’ing an entire set of failed behaviors from a handful of loglines. But note: a) we remember those successes because they are so very rareand b) you’re not Sherlock unless the metrics or the experiments back up thestory. #\n #  Use percentiles, not averages. Percentiles (50th, 99th, 99.9th, 99.99th)are more accurate and informative than averages in the vast majority ofdistributed systems. Using a mean assumes that the metric under evaluationfollows a bell curve but, in practice, this describes very few metrics anengineer cares about. “Average latency” is a commonly reported metric, butI’ve never once seen a distributed system whose latency followed a bellcurve. If the metric doesn’t follow a bell curve, the average is meaninglessand leads to incorrect decisions and understanding. Avoid the trap by talkingin percentiles. Default to percentiles, and you’ll better understand how usersreally see your system. #\n #  Learn to estimate your capacity. You’ll learn how many seconds are in aday because of this. Knowing how many machines you need to perform a task isthe difference between a long-lasting system, and one that needs to bereplaced 3 months into its job. Or, worse, needs to be replaced before youfinish productionizing it.\n Consider tweets. How many tweet ids can you fit in memory on a common machine?Well, a typical machine at the end of 2012 has 24 GB of memory, you’ll need anoverhead of 4-5 GB for the OS, another couple, at least, to handle requests,and a tweet id is 8 bytes. This is the kind of back of the envelopecalculation you’ll find yourself doing. Jeff Dean’s  Numbers Everyone ShouldKnow slide is a good expectation-setter. #\n #  Feature flags are how infrastructure is rolled out. “Feature flags” are acommon way product engineers roll out new features in a system. Feature flagsare typically associated with frontend A/B testing where they are used to showa new design or feature to only some of the userbase. But they are a powerfulway of replacing infrastructure as well.\n Too many projects have failed because they went for the “big cutover” or aseries of “big cutovers” that were then forced into rollbacks by bugs found toolate. By using feature flags instead, you’ll gain confidence in your project andmitigate the costs of failure.\n Suppose you’re going from a single database to a service that hides the detailsof a new storage solution. Using a feature flag, you can slowly ramp up writesto the new service in parallel to the writes to the old database to make sureits write path is correct and fast enough. After the write path is at 100% andbackfilling into the service’s datastore is complete, you can use a separatefeature flag to start reading from the service, without using the data in userresponses, to check for performance problems. Another feature flag can be usedto perform comparison checks on read of the data from the old system and the newone. And one final flag can be used to slowly ramp up the “real” reads from thenew system.\n By breaking up the deployment into multiple steps and affording yourself quickand partial reactions with feature flags, you make it easier to find bugs andperformance problems as they occur during ramp up instead of at a “big bang”release time. If an issue occurs, you can just tamp the feature flag settingback down to a lower (perhaps, zero) setting immediately. Adjusting the rateslets you debug and experiment at different amounts of traffic knowing that anyproblem you hit isn’t a total disaster. With feature flags, you can also chooseother migration strategies, like moving requests over on a per-user basis, thatprovide better insight into the new system. And when your new service is stillbeing prototyped, you can use flags at a low setting to have your new systemconsume fewer resources.\n Now, feature flags sound like a terrible mess of conditionals to a classicallytrained developer or a new engineer with well-intentioned training. And the useof feature flags means accepting that having multiple versions of infrastructureand data is a norm, not an rarity. This is a deep lesson. What works well forsingle-machine systems sometimes falters in the face of distributed problems.\n Feature flags are best understood as a trade-off, trading local complexity (inthe code, in one system) for global simplicity and resilience. #\n #  Choose id spaces wisely. The space of ids you choose for your system willshape your system.\n The more ids required to get to a piece of data, the more options you have inpartitioning the data. The fewer ids required to get a piece of data, theeasier it is to consume your system’s output.\n Consider version 1 of the Twitter API. All operations to get, create, anddelete tweets were done with respect to a single numeric id for eachtweet. The tweet id is a simple 64-bit number that is not connected to anyother piece of data. As the number of tweets goes up, it becomes clear thatcreating user tweet timelines and the timeline of other user’s subscriptionsmay be efficiently constructed if all of the tweets by the same user werestored on the same machine.\n But the public API requires every tweet be addressable by just the tweetid. To partition tweets by user, a lookup service would have to beconstructed. One that knows what user owns which tweet id. Doable, ifnecessary, but with a non-trivial cost.\n An alternative API could have required the user id in any tweet look up and,initially, simply used the tweet id for storage until user-partitioned storagecame online. Another alternative would have included the user id in the tweetid itself at the cost of tweet ids no longer being k-sortable and numeric.\n Watch out for what kind of information you encode in your ids, explicitly andimplicitly. Clients may use the structure of your ids to de-anonymize privatedata, crawl your system in unexpected ways (auto-incrementing ids are atypical sore point), or perform a  host of other attacks. #\n #  Exploit data-locality. The closer the processing and caching of your datais kept to its persistent storage, the more efficient your processing, and theeasier it will be to keep your caching consistent and fast. Networks have morefailures and more latency than pointer dereferences and  fread(3).\n Of course, data-locality means being nearby in space, but it also means nearbyin time. If multiple users are making the same expensive request at nearly thesame time, perhaps their requests can be joined into one. If multiple instancesof requests for the same kind of data are made near to one another, they couldbe joined into one larger request. Doing so often affords lower communicationoverheard and easier fault management. #\n #  Writing cached data back to persistent storage is bad. This happens inmore systems than you’d think. Especially ones originally designed by peopleless experienced in distributed systems. Many systems you’ll inherit will havethis flaw. If the implementers talk about “Russian-doll caching”, you have alarge chance of hitting highly visible bugs. This entry could have been leftout of the list, but I have a special hate in my heart for it. A commonpresentation of this flaw is user information (e.g. screennames, emails, andhashed passwords) mysteriously reverting to a previous value. #\n #  Computers can do more than you think they can. In the field today, there’splenty of misinformation about what a machine is capable of from practitionersthat do not have a great deal of experience.\n At the end of 2012, a light web server had 6 or more processors, 24 GB ofmemory and more disk space than you can use. A relatively complex  CRUDapplication in a modern language runtime on a single machine is triviallycapable of doing thousands of requests per second within a few hundredmilliseconds. And that’s a deep lower bound. In terms of operational ability,hundreds of requests per second per machine is not something to brag about inmost cases.\n Greater performance is not hard to come by, especially if you are willing toprofile your application and introduce efficiencies based on yourmeasurements. #\n #  Use the CAP theorem to critique systems. The CAP theorem isn’t somethingyou can build a system out of. It’s not a theorem you can take as a firstprinciple and derive a working system from. It’s much too general in itspurview, and the space of possible solutions too broad.\n However, it is well-suited for critiquing a distributed system design, andunderstanding what trade-offs need to be made. Taking a system design anditerating through the constraints CAP puts on its subsystems will leave youwith a better design at the end. For homework, apply the CAP theorem’sconstraints to a real world implementation of Russian-doll caching.\n One last note: Out of C, A, and P, you  can’t choose CA. #\n #  Extract services. “Service” here means “a distributed system thatincorporates higher-level logic than a storage system and typically has arequest-response style API”. Be on the lookout for code changes that would beeasier to do if the code \n......", "posttime": "2020-05-31 22:27:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "年轻一代,distributed,系统", "title": "面向年轻一代的分布式系统笔记(2013)", "title_en": "Notes on Distributed Systems for Young Bloods (2013)", "transed": 1, "url": "https://www.somethingsimilar.com/2013/01/14/notes-on-distributed-systems-for-young-bloods/", "via": "", "real_tags": ["年轻一代", "系统"]}, {"category": "", "categoryclass": "", "imagename": "2c4afb521dd7e9e513ae94090ae33975.jpg", "infoid": 1004525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "十多个美国城市实施了夜间宵禁，抗议活动因一名黑人男子在警方拘留期间死亡而肆虐。DW的斯特凡·西蒙斯花了", "note_en": "More than a dozen US cities have imposed night-time curfews as protests rage over the death of a black man in police custody. DW's Stefan Simons spent the ni...", "posttime": "2020-05-31 22:10:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开枪,police,男子", "title": "明尼阿波利斯警方开枪，威胁逮捕德国之声记者", "title_en": "Minneapolis police shoot at, threaten to arrest Deutsche Welle reporter", "transed": 1, "url": "https://www.youtube.com/watch?v=NN8ISwuiX68", "via": "", "real_tags": ["开枪", "police", "男子"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004524, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当他们年富力强的时候，这些地方看到了一切：谁在舞台上砸吉他；16岁的艾米·怀恩豪斯(Amy Winehouse)的首次亮相；60年代的节奏蓝调、70年代的朋克、80年代的流行和90年代的摇滚的到来。\n但一些帮助启动音乐事业的场所，从现状到性手枪，现在已经远离聚光灯，在伦敦的角落里像洗衣店、炸鸡店甚至警察局一样萎靡不振。\n现在，为了挽救他们在首都文化史上的位置，一位音乐发起人出身的摄影师记录了首都爵士乐、布鲁斯、摇滚乐、民谣、朋克和独立音乐历史的150个地标。\n保罗·塔林的新摄影散文包括数十家酒吧和酒吧，里奇·布莱克莫尔的“深紫色和苏西”和“女妖”等人就是在这些酒吧里第一次调好吉他的。\n现年52岁的塔林在20世纪80年代开始涉足伦敦的音乐界，并在那十年末在首都组织了狂躁街头传教士的第一场演唱会。\n“我给了GB 30英镑的汽油钱，让他们从威尔士去伦敦，这样他们就可以在89年在牧羊人灌木丛的果岭歌剧院演出。他们是如此诚实，他们只要求20 GB，因为这就是他们乘坐面包车到达那里所需的全部。这是他们第一次在伦敦演出，所以他们告诉了我，我只是不得不把这一点写进这本书里，“塔林说。\n塔林还在伦敦各地经营摇滚和流行徒步旅行，他说，他注意到在过去20年里，有多少著名的音乐酒吧、酒吧和俱乐部被快餐连锁店、住房协会，甚至福音派基督教教堂接管。\n他花了三年时间在全市徒步旅行，重新发现、研究和拍摄了所有的旧场地，其中许多都有被从摇滚史上抹去的危险。\n“这并不全是厄运和悲观，”他说。“一些老地方仍然很兴旺，比如普特尼的半月或牛津街的100俱乐部，既有新乐队，也有老乐队在那里演奏。但捕捉战后一些最大甚至最小的表演首次登上舞台或拥有一些最著名的时刻是至关重要的。“。\n随着冠状病毒的封锁可能会在不久的将来关闭更多的酒吧和俱乐部，塔林担心他可能会有更多以前的演唱会场所可以去看他的第二卷。\n“我还有150多个地方要拍，比如芬斯伯里公园的老彩虹，但我也会继续在伦敦进行摇滚乐之旅。”有一些关于那些伟大的摇滚之夜的故事，你不能把它们写进任何一本书里，有一些故事是不能出版的，甚至可能是诽谤的-所以我会把这些故事留到徒步旅行中去，“他说。\n1977年元旦，这场冲突成为这个朋克/新浪潮场地开幕的头条新闻。在跟随他们的常规羽翼未丰的乐队中，有苏西乐队、女妖乐队和X-Ray Spex乐队。\nDJ唐·莱茨(DJ Don Letts)在乐队之间演奏雷鬼配音的场地，部分原因是朋克唱片太少了，成为朋克/新浪潮场景的代名词，以至于同年录制了专辑“Live at the Roxy London”，那年春天跻身英国专辑排行榜前20名。马克·博兰非常喜欢这个地方，1977年3月，霸王龙在那里举办了“地下世界”专辑发布会上的“花花公子”(Dandy)乐队。\n然而不到一年，首都的朋克泡沫似乎已经破裂，Roxy关闭了，这让蹲在大楼里抗议关闭的粉丝们感到痛苦。会场最终被关闭，并被掏空。今天这里是Speedo运动服装店的所在地。\n曾有报道援引艾米·怀恩豪斯的话说，她的职业生涯就是从这个地方开始的，“在雷纳斯巷的一家酒吧的后屋里为老人唱歌”。\n在20世纪60年代末到21世纪初，雷纳夫妇主持了一系列兼收并蓄的表演，包括酒吧摇滚到新生朋克传奇人物费尔古德博士(Dr Feelgood)。像巴斯特王子这样的斯卡皇室成员在它的一个光头雷鬼之夜现场表演了布景。\n酒吧于2006年初关闭，原定于当地议会在最后一刻对建筑下达保护令之前拆除。现在它被救世主基督宗教培训学院占据，尽管酒吧的招牌仍然悬挂在外面。\n另一个朋克俱乐部像1977年的Roxy一样如雨后春笋般涌现，Vortex甚至在“果酱边的沃杜尔街的炸弹”的歌词中被提到。\n在那首歌中，Paul Weller等人回忆了场馆常客、工作人员和一群新纳粹光头党之间的暴力冲突。(“他们叫了军队，他们叫了警察/我被困在漩涡地板上/我的头被踢进去了，鲜血开始涌入…”)。\n在“漩涡”舞台上开始演艺生涯的艺人中，有一个是全女子朋克乐队The Slits，还有一个从都柏林赶来的乐队，名为“新兴城市老鼠”(The Boomtown Rats)。1977年，伯明翰的一家名为“钢铁脉动”(Steel Pulse)的根雷鬼组织就是从那里宣布埃尔维斯·普雷斯利(Elvis Presley)去世的。\n人群中的一些人欢呼起来-这一行为在舞台上遭到了一位名为丹尼·贝克(Danny Baker)的年轻乐迷的谴责，贝克是未来的电台DJ和电视主持人。\n以前的会场现在是SOHO的Dirty Harry‘s下面的Nova Club，它橱窗里的盒装霓虹灯招牌告诉顾客：“这不是脱衣舞俱乐部”。\n这个场地位于伦敦西部的一个汽车展厅上方，最初被称为阁楼俱乐部，1964年开业，乔治·名气(Georgie Fame)和吉诺·华盛顿(Geno Washington)等人在那里演奏。\nRicky-Tick是20世纪60年代颇具影响力的节奏蓝调俱乐部。在那里演出的最著名的演员有吉米·亨德里克斯、平克·弗洛伊德、克里姆、亚瑟·布朗的疯狂世界、庭院鸟和谁人。一张鼎盛时期的Ricky-Tick海报宣传着一场吉米·亨德里克斯体验演唱会，入场费为7先令6便士。\n该俱乐部还率先带领塔姆拉汽车城成功进军英国，至尊乐队、诱惑乐队和年轻的史蒂维·旺德都出现在那里。它还包括一家内部时装店或“Boutick”，顾客可以在那里购买60年代的摇摆服装。\n俱乐部今天的豪恩斯洛总部是一家职业介绍所的办公室，位于南多连锁餐厅的一家分店上方。\n保罗·塔林的“伦敦迷失的音乐场所”，GB 14.99，由www.DamagedGoodsBooks.com出版", "note_en": "When they were in their prime, these places saw it all: the Who smashing their guitars on stage; the debut of a 16-year-old Amy Winehouse; the arrival of 60s rhythm and blues, 70s punk, 80s pop and 90s rock.\n But some of the venues that helped launch musical careers from Status Quo to the  Sex Pistols are now far from the spotlight, languishing in corners of London as laundrettes, fried chicken joints and even police stations.\n Now, in an attempt to save their placein the capital’s cultural history, a music promoter turned photographer has documented 150 landmarks of the capital’s jazz, blues, rock, folk, punk and indie history.\n Paul Talling’s new photographic essay includes dozens of pubs and bars where the likes of Ritchie Blackmore’s Deep Purple and  Siouxsie and the Banshees first tuned up their guitars.\n  Talling, 52, became involved in London’s musical scene in the 1980s, and at the end of that decade organised the Manic Street Preachers’ first concert in the capital.\n “I offered £30 petrol money to get them from Wales to London so they could play in ’89 at the Opera On the Green at Shepherd’s Bush. They were so honest they only asked for £20 because that was all they needed to get there in their van. That was their first  London gig, so they told me, and I just had to put that in this book,” Talling said.\n Talling, who also runs rock and pop walking tours around London, said he has noticed over the last two decades how many of the famous music pubs, bars and clubs have been taken over by fast-food chains, housing associations and even evangelical Christian churches.\n  It took him three years of tramping across the city to rediscover, research and shoot all of the old venues, many of which were in danger of being erased from rock’n’roll history.\n “It’s not all doom and gloom,” he said. “Some of the old places are still going strong, like the Half Moon in Putney or the 100 Club in Oxford Street, with new bands as well as old ones playing there. But it was vital to capture the places where some of the biggest and even smallest acts from the postwar era onwards first took to the stage or had some of their most famous moments.”\n With the coronavirus lockdown threatening to close more pubs and clubs in the near future, Talling fears he may have more former gig venues to visit for his second volume.\n “I’ve another 150 more places to photograph, like the old Rainbow in Finsbury Park, but I will also keep doing the rock’n’roll tours of London too. There are stories about those great rock nights that you cannot put in any book, stories that are unprintable, maybe even libellous – so I’ll keep those tales for the walking tours,” he said.\n   On New Year’s Day, 1977, the Clash were the headline act to open this punk/new wave venue. Among the regular fledgling bands to follow them there were Siouxsie and the Banshees and X-Ray Spex.\n The venue, where DJ Don Letts played dub reggae between bands, partly because there were so few punk records to play, became so synonymous with the punk/new wave scene that an album,  Live at the Roxy London , was recorded in the same year, and that spring made the Top 20 in the UK album chart. Marc Bolan loved the place so much that in March 1977 T Rex hosted their  Dandy in the Underworld album party launch there.\n Yet within a year, the punk bubble in the capital appeared to have burst, and the Roxy closed, to the anguish of fans who squatted in the building in protest at its closure. The venue was eventually shut and gutted. Today it is the location of a Speedo sportswear shop.\n   Amy Winehouse was once quoted as saying that she began her career in this spot, “singing for old people in the back room of a pub in Rayners Lane”.\n  Between the late 1960s and early 2000s, the Rayners hosted an eclectic range of acts including pub rock-to-nascent punk legends Dr Feelgood. Ska royalty like Prince Buster performed live sets at one of its skinhead reggae nights.\n The pub closed in early 2006 and was due to be demolished before the local council put an 11th-hour conservation order on the building. It is now occupied by Christ the Redeemer religious training college, although the pub sign still hangs outside.\n   Another punk club that sprung up like the Roxy in 1977, the Vortex is even mentioned in the lyrics of ‘A’ Bomb in Wardour Street by  the Jam.\n In that song, Paul Weller et al recalled violent clashes between the venue’s regulars, the staff and a gang of neo-Nazi skinheads. (“They’ve called in the army, they’ve called in the police / I’m stranded on the vortex floor / My head’s been kicked in and blood’s started to pour…”)\n Among the acts who started their careers on the Vortex’s stage was the all-girl punk band the Slits, and a group that had travelled from Dublin known as the Boomtown Rats. And it was from there that Steel Pulse, a roots reggae outfit from Birmingham, announced Elvis Presley’s death in 1977.\n Some in the crowd cheered – an act that was denounced from the stage by a young music fan known as Danny Baker, the future radio DJ and television presenter.\n The former venue is now the Nova Club below Dirty Harry’s of Soho, whose boxed-off neon-sign in the window advises customers: “This Is Not A Strip Club”.\n   This venue, above a car showroom in west London, was originally called the Attic Club and opened in 1964 with the likes of Georgie Fame and Geno Washington playing there.\n  The Ricky-Tick was an influential 1960s rhythm and blues club. Among the most famous acts to play there were Jimi Hendrix, Pink Floyd, Cream, the Crazy World of Arthur Brown, the Yardbirds and the Who. One heyday Ricky-Tick poster advertised a  Jimi Hendrix Experience concert with the entry fee of 7 shillings, 6 pence.\n The club also pioneered Tamla Motown’s triumphant march into the UK with the Supremes, the Temptations and a young Stevie Wonder all appearing there. It also included an in-house fashion store or ‘Boutick’ where patrons could buy Swinging 60s clothing.\n The club’s Hounslow HQ today is the offices of an employment agency, located above a branch of the Nando’s restaurant chain.\n Paul Talling’s London’s Lost Music Venues, £14.99 is published by  www.DamagedGoodsBooks.com", "posttime": "2020-05-31 22:10:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,london,乐队", "title": "失去了帮助推出亨德里克斯、怀恩豪斯和朋克的伦敦场馆", "title_en": "Lost London venues that helped launch Hendrix, Winehouse and punk", "transed": 1, "url": "https://www.theguardian.com/artanddesign/2020/may/31/tracing-the-lost-london-venues-that-helped-launch-amy-winehouse-hendrix-and-punk", "via": "", "real_tags": ["帮助", "london", "乐队"]}, {"category": "", "categoryclass": "", "imagename": "d2892ebf4e31bc79b4735c6f3aa5d227.jpg", "infoid": 1004523, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "三个核心中的每一个都携带一台飞行计算机、降落伞展开系统和推力矢量控制组件。上级也配备了推力矢量控制，并搭载了一辆3D打印跑车-没有一款猎鹰重型跑车是不完整的。\n猎鹰重型模型是BPS太空的技术演示。其目的是展示在模型尺度上可能取得的进步。\n猎鹰重型飞行计算机是Signal的升级版本，Signal是一种专门为模型火箭的推力矢量控制而设计和制造的计算机。每台电脑都有一套MEMS陀螺仪和加速计，用于感知火箭上的运动和方向，与大多数智能手机中的传感器相同。气压传感器被用来确定火箭离地面的高度。\n在每台飞行计算机上，一个48 mhz的Cortex M0处理器以400 hz的速度读取飞行传感器，并将31个通道的数据记录到闪存芯片中，每秒40次。猎鹰重型在空中的每一秒都会记录4960个数据点-永远不会有太多的数据。\n飞行计算机在飞行过程中不相互通信，传感器和软件足够精确，短途飞行不需要。没有一个航班设置是硬编码的；根据航班配置文件的不同，它们都可以使用Signal iOS/Android应用程序进行更改。\n飞行软件是用C++编写的，SWIFT的iOS应用程序和Java的Android应用程序都是用C++编写的。飞行制导是使用四元数计算的，计算效率更高，在一些航天运载火箭中用于制导。有关各种BPS的更多详细信息。可以通过下面的按钮找到太空飞行计算机。您也可以单击此处查看Z轴陀螺仪测试的镜头。\n每个侧型芯顶部的附着点沿着中心型芯上的坡道滑下，在阶段分离过程中给它们留出一些间隙。这种被动的设置让事情在飞行过程中变得非常简单，但当飞行器在地面上时，核心通常是用螺栓固定在一起的。所有三个核心也连接在车辆的底部，使用稍微简单的推力板。\n侧芯通过保持比中心芯/上级略高的净推力来保持与车辆的连接。一旦CC/US产生的净推力超过侧核，级就会分开。为了灵活起见，每个侧芯还为小型分离电机提供了一个插槽。使用时，SEP马达通过侧芯以微小角度点火，以确保与中心芯的清洁分离。到目前为止，航班上还不需要这种设置，但以后可能会有帮助。\n猎鹰重型模型的中心核心在飞行过程中经历了两个助推阶段。在第一阶段，连接侧芯。就在侧面核心烧毁的时候，中心核心点燃了第二个马达，第二个助推阶段开始了。这两个火箭发动机安装在中心核心的推力矢量支架上。当第二个马达点火时，下部的废马达就会被弹出。同样的技术也被用来控制其他BPS太空火箭的上升和推进着陆马达。\n猎鹰重型模型每一级的火箭发动机可以在任何方向上进行±5度的平衡。由于侧芯不是直接通过车辆的质心发射，它们不仅可以用于俯仰和偏航，还可以用于侧滚控制。每一次多核飞行都运行一个滚动程序，该程序通常以20度正侧滚为目标，以每秒30-40度的速度执行。\n发射猎鹰重型型号需要一些深思熟虑。中心铁心马达在点火时有一个轻微的推力尖峰，此后产生的力量慢慢减少。在发射时，侧面的核心必须具有比中心核心更大的净推力。正因为如此，在跳频飞行期间，中心核心在T-1秒被点亮，而飞行器仍然被发射夹子夹在垫子上。在T-0时，侧面核心被点亮，在T+0.25时，野兽被释放。单击下面了解有关启动平台的更多详细信息。\n2018年2月，满载的猎鹰重型火箭被压在发射台上进行静态射击试验。一些航天运载火箭会在发射台上发动发动机几秒钟，以确保发射前一切正常。这场静态大火的目的是为了确保新的发射台工作正常，坦率地说，是为了获得一些项目宣传的酷镜头。\n在第一次跳频发射之前，火箭的每一级都进行了单独的测试。这些早期测试中的许多也作为信号R2推力矢量套件的试验台，当时该套件仍在开发中。首先，对中心堆芯进行了自行测试。这次飞行取得了成功，核心被找回，并进行了几次飞行测试。\n在中心核心又进行了几次飞行后，侧面核心被连接起来进行全面的助推器试飞。中央核心有一个软件错误，导致级分离后不稳定。然而，成功测试了飞行中最复杂的部分，包括正确的点火正时，滚动程序，以及基本干净的级分离(右助推器在9月级被中心核心损坏)。\n在将其连接到中心核心之前，上级也进行了自己的测试。第一次试飞没有成功，这就是为什么测试很重要！这次飞行失败有几个原因，主要与飞行器的稳定性和调谐有关。文中对失效原因和原因进行了详细的分析。\n第二次试飞部分成功，稳定性大大提高，PID增益和PID采样率均有所提高。还做了几个其他的改变。然而，降落伞(和跑车)仍然没有展开，车辆又发生了一次硬撞击。整流罩没有正确分离，因此需要另一轮整流罩分离测试。\n这是全猎鹰重型模型首次发射前的最后一次主要测试，这些整流罩分离测试确保了上级在飞行后可以安全回收。在这个过程中，整流罩的设计做了几处小的修改，测试结果是一个更可靠的回收系统。\n猎鹰重型模型的第一次飞行取得了部分成功。更复杂的点火序列达到了预期的效果，让中心核心在垫子上燃烧了一点。飞行的第一个助推阶段非常完美。两边的核心都击中了滚动程序目标，从T+0.9秒开始，以每秒40度的速度滚动到+20度。车辆在助推器第一阶段保持稳定。在两边的核心完全分开后，中心核心失去了控制。\n中心堆芯马达悬置的热致结构故障导致推力矢量控制丢失。在感觉到失去控制后，上级的飞行计算机呼叫飞行中的中止，将整流罩炸开以展开降落伞。当火箭开始坠落时，中心核心展开了上面的级和自己的降落伞，将两级都安全地带到了地面。在这一点上，两边的核心都已经在各自的降落伞下轻轻地到达了地面。多亏了飞行中的中止系统，火箭保持了良好的状态。\n猎鹰重型模型的第二次飞行将于2019年初进行。主要目标将是解决中心核心的机械问题，减少总体质量，并简化飞行器飞行准备程序。\n还有，我还需要说吗？那些助推器当然要着陆了！目前，推进着陆测试计划与猎鹰重型计划是分开的，但随着两个计划成功率的提高，这两个计划将合并。\n许多人通过Patreon慷慨解囊来支持BPS空间-如果您想要尽早访问视频、设计文件等，请单击下面。", "note_en": "Each of the three cores carries a flight computer, parachute deployment system, and thrust vector control assembly. The upper stage flies with thrust vector control as well, and it carries a 3d printed sports car - no Falcon Heavy model would be complete without one.\n The Falcon Heavy model is a technology demonstrator for BPS.space. The intention is to showcase the advancement possible at the model scale.\n   The Falcon Heavy flight computers are upgraded versions of  Signal, a computer designed and built specifically for thrust vector control in model rockets. Each computer has a set of MEMS gyroscopes and accelerometers for sensing movement and orientation on the rocket, the same kind of sensors found in most smartphones. A barometric pressure sensor is used to determine the rocket’s altitude above ground level.\n On each flight computer, a 48mhz Cortex M0 processor reads the flight sensors at 400hz and logs 31 channels of data to a flash chip, 40 times per second. Every second that Falcon Heavy is in the air, 4,960 points of data are recorded onboard - never too much data.\n The flight computers don’t communicate with each other during flight, the sensors and software are accurate enough that it’s not required for short flights. None of the flight settings are hard-coded; depending on the flight profile, they can all be changed using the Signal iOS/Android app.\n The flight software is written in C++, the iOS app in Swift, and the Android app in Java. Flight guidance is computed using  quaternions, which are more computationally efficient, and are used for guidance in some space launch vehicles. More details about the various BPS.space flight computers can be found via the button below.  You can also click here for footage of Z axis gyroscope testing.\n    The attachment points at the top of each side core slide down a ramp on the center core, giving them a bit of clearance during stage separation. This passive setup keeps things very simple during flight, but the cores are usually bolted together while the vehicle is on the ground. All three cores are also connected at the base of the vehicle using a slightly simpler thrust plate.\n The side cores remain attached to vehicle by maintaining a slightly higher net thrust force than the center core/upper stage. As soon as the CC/US produces more net thrust than the side cores, the stages will separate. For flexibility, each side core also has a slot for a small separation motor. When used, the sep motor fires at a slight angle through the side core to ensure a clean separation away from the center core. This setup has not been needed on flights so far, but may be helpful later down the road.\n The center core of the Falcon Heavy model goes through two boost phases during flight. During the first phase, the side cores are attached. Right around side core burnout, the center core lights a second motor, and the second boost phase begins. These two rocket motors are mounted on top of each other in the center core’s thrust vectoring mount. When the second motor ignites, the lower, spent motor, is ejected. This same technique used to control ascent and propulsive landing motors in other BPS.space rockets.\n The rocket motors in each stage of the Falcon Heavy model can be gimbaled ±5 degrees in any direction. Because the side cores are not firing directly through the vehicle’s center of mass, they can be used not just for pitch and yaw, but roll control as well. Each multi-core flight runs a roll program which usually targets 20 degrees of positive roll, executed at 30-40 degrees per second.\n Launching the Falcon Heavy model requires a bit of forethought. The center core motor has a slight thrust spike at ignition, after which the amount of force produced slowly tapers off. At liftoff, the side cores must have a greater net thrust than the center core. Because of this, during a full FH flight, the center core is lit at T-1 second while the vehicle is still held on the pad by the launch clamps. At T-0 the side cores are lit, and at T+0.25 the beast is released. Click below for more details on the launch pad.\n    In February of 2018, the full Falcon Heavy rocket was held down on the launch pad for a static fire test. Some space launch vehicles will fire their engines for a few seconds on the launch pad to make sure everything is working properly before launch day. The purpose of this static fire was instead to make sure the new launch pad was working correctly, and frankly, to get some cool footage for project promotion.\n  Each individual stage of the rocket was tested on its own before the first full FH launch. Many of these early tests also served as testbeds for the  Signal R2 thrust vectoring kit, which was still in development at the time. First, the center core was tested by itself. The flight was a success; the core was recovered and flight tested several more times.\n  After several more flights of the center core, the side cores were attached for a full booster test flight. The center core had a software bug which caused instability after stage separation. However, the most complex parts of the flight were successfully tested, including proper ignition timing, a roll program, and a mostly clean stage separation(right booster was damaged by the center core at stage sep).\n  Before attaching it to the center core, the upper stage was tested on its own as well. The first test flight was unsuccessful, which is why it’s important to test! The flight failed for several reasons, mostly having to do with the stability and tuning of the vehicle.  The failure and analysis is discussed in detail here.\n  The second test flight was a partial success - stability greatly improved with an increase in both PID gains and PID sample rate. Several other changes were made as well. However, the parachute(and sports car) still failed to deploy, and the vehicle had another hard impact. The fairing wasn’t separating properly, so another round of fairing separation tests was needed.\n  The final major test before the first launch of the full Falcon Heavy model, these fairing separation tests served to ensure the upper stage could be safely recovered after flight. Several small modifications were made to the fairing design in the process, and the tests resulted in a much more reliable recovery system.\n   Flight 1 of the Falcon Heavy model was a partial success. The more complex ignition sequence worked as intended, letting the center core burn a bit on the pad. The first boost phase of flight was picture perfect. Both side cores hit the roll program target dead on, rolling to +20 degrees at 40 degrees per second beginning at T+0.9 seconds. The vehicle remained stable during boost phase one. After a clean separation of both side cores, the center core lost control.\n A heat induced structural failure in the center core’s motor mount resulted in a loss of thrust vector control. After sensing a loss of control, the upper stage’s flight computer called an in-flight abort, blowing the fairing apart to deploy its parachute. As the rocket began falling, the center core deployed the upper stage, and its own chutes, bringing both stages safely to the ground. Both side cores had reached the ground softly under their own parachutes by that point. The rocket remains in excellent condition, thanks to the in-flight abort system.\n    Flight 2 of the Falcon Heavy model will take place in early 2019. Primary goals will be resolving the mechanical issues with the center core, reducing overall mass, and streamlining vehicle flight prep procedures.\n  Also, do I even have to say it? Of course those boosters are gonna land! The propulsive landing test program is isolated from the Falcon Heavy program right now, but the two will merge as the success rate for both programs increases.\n  BPS.space is supported by the generosity of many through Patreon - if you’d like early access to videos, design files, and more, click below.", "posttime": "2020-05-31 22:10:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火箭,rust,矢量,spacex,核心", "title": "推力矢量控制1/48比例尺SpaceX猎鹰重型模型火箭", "title_en": "1/48 scale SpaceX Falcon Heavy model rocket with thrust vector control", "transed": 1, "url": "https://bps.space/falcon-heavy", "via": "", "real_tags": ["火箭", "rust", "矢量", "spacex", "核心"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从今天开始，也就是5月1日，我们将从CGIT/人造板安装切换到GitLab。我们的旧服务器git.xfce.org现在是一个只做好准备的同步镜像(所以您仍然可以拉取代码)。我们的新服务器是gitlab.xfce.org。\n(这篇博客文章的详细版本可以在我在Xfce邮件列表上的公告中阅读。)。\n对于分发者来说，没有什么变化(假设您使用的是发行版tarball而不是Git标签)。\n最重要的是：Git URL已更改，因此您需要更新本地存储库的远程。请随意使用我们的助手脚本。\n如果您还没有帐户(我们已经为您的常客创建了相当多的帐户)，请注册！我们已经开放了GitLab帐户的注册，并允许您注册您的GitHub帐户(如果您有的话)。如果您缺乏存储库访问权限或所有权，请在IRC或邮件列表上拨打我们的电话。(默认情况下，新用户在手动批准之前不能分叉。是。我们害怕垃圾邮件。)", "note_en": "Starting today, May 1, we’re switching from our cgit/gitolite setup to GitLab. Our old server, git.xfce.org, is now a ready-only in-sync mirror (so you can still pull code). Our new server is gitlab.xfce.org.\n (The detailed version of this blog post can be read in my  announcement on the Xfce Mailing List.)\n   For  distributors nothing changes (presuming you’re using the release tarballs and not Git tags).\n  Most importantly: The Git URL changed, so you need to update the remotes of your local repositories.  Feel free to use our helper script.\n  If you don’t have an account yet (we created quite a few for you regulars already) please sign up! We have opened registrations for GitLab accounts as well as allowing you to register with your GitHub account (if you have one). Please poke us on IRC or the mailinglist if you’re lacking repository access or ownership. (By default new users cannot fork before being manually approved. Yes. We  are afraid of the spambots.)", "posttime": "2020-05-31 22:09:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "切换,switches,帐户", "title": "XFCE切换到GitLab", "title_en": "Xfce Switches to Gitlab", "transed": 1, "url": "https://simon.shimmerproject.org/2020/04/30/xfce-switches-to-gitlab/", "via": "", "real_tags": ["切换", "switches", "帐户"]}, {"category": "", "categoryclass": "", "imagename": "be8c640a13d5624e253b0a60c38857e9.jpeg", "infoid": 1004521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "通常，制造商鼓励我们不要舔我们的电子设备，因为它们的味道可能不怎么样。日本明治大学的研究人员正在寻求改变这一点，不是通过制造可食用的智能手机外壳，而是一种几乎可以模拟用户舌头上任何味道的味觉显示器。大多数人可以感觉到四种主要的味道-甜、酸、咸和苦，以及它们的组合。第五种口味，鲜味(可口)，对我们如何品尝不同的食物，如肉汤和熟肉，也起着重要的作用。\n工程师们的新设备名为Norimaki合成器，可以捕捉到这五种口味，并用它们欺骗我们的大脑，让我们认为我们在品尝不同的食物，就像我们的大脑欺骗我们的眼睛看到了不存在的东西一样。可以把它想象成您当前正在阅读本文的显示器-它使用由红色、绿色和蓝色元素组成的像素来生成数百万种不同的颜色。\nNorimaki合成器的味道展示是使用五种不同颜色的凝胶设计的，这些凝胶由琼脂包装成管状，甘油代表甜味，柠檬酸代表酸性，氯化钠代表咸味，氯化镁代表苦味，谷氨酸钠代表鲜味。当按压舌头时，用户可以同时体验所有的味道，但是混合这些凝胶并调整它们的量和强度会产生特定的味道。\n显示器的管子是用铜箔包裹的，所以当它们拿在手中与舌头接触时，就会通过人体产生一条电路，这就是所谓的离子电泳。当施加电流时，这一过程会移动凝胶中的分子，将分子移动到远离舌头的阴极侧，导致该特定凝胶的味道较弱。\n这是一个减法过程，逐渐去除某些味道，以呈现特定的味道。在测试中，研究小组发现，他们可以在不吃任何食物的情况下复制从寿司到胶糖的一切味道。", "note_en": "Typically, we are encouraged not to lick our electronic devices by manufacturers, as they probably don’t taste that great anyway. Researchers from Meiji University in Japan are looking to change that, not by making edible smartphone enclosures, but rather a Taste Display that simulates nearly any flavor on the user’s tongue. Most humans can detect four primary flavors — sweet, sour, salty, and bitter, along with a combination thereof. A fifth flavor, umami (savory), also plays a significant role in how we taste different foods, such as broth and cooked meats.\n The engineers&#39; new device, known as the  Norimaki Synthesizer,  can capture those five flavors, and use them to trick our brains into thinking we are tasting distinct foods, much in the same way our brains trick our eyes into seeing something that isn’t there. Think of it like looking at the display you are currently reading this article on — it uses pixels made up of red, green, and blue elements to make millions of different colors.\n  The Norimaki Synthesizer taste display was designed using five different color-coded gels made of agar packed into a tube shape, which uses glycerin for sweet, citric acid for acidic, sodium chloride for salty, magnesium chloride for bitter, and glutamic sodium for umami. When pressed against the tongue, users experience all of the flavors at the same time, however mixing those gels and adjusting their amounts and intensities creates specific flavors.\n The tubes for the display are wrapped in copper foil, so when they are held in hand and make contact with the tongue, it creates an electrical circuit via the human body, which is known as ion electrophoresis. The process moves molecules in a gel when a current is applied, moving the molecules to the cathode side away from the tongue, resulting in a weak flavor for that particular gel.\n  It’s a subtractive process that removes certain flavors gradually to render a specific taste. In tests, the team found that they could replicate the flavors of everything from sushi to gummy candy without eating a single piece of food.", "posttime": "2020-05-31 22:09:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,大学,university,味道", "title": "明治大学开发几乎可以重现每一种味道的味觉展示", "title_en": "Meiji University Develop Taste Display That Can Recreate Nearly Every Flavor", "transed": 1, "url": "https://www.hackster.io/news/meiji-university-engineers-develop-taste-display-that-can-recreate-nearly-every-flavor-f1120994954b", "via": "", "real_tags": ["开发", "大学", "味道"]}, {"category": "", "categoryclass": "", "imagename": "080e3b0db1f05ffd1aed9f27aaae1e92.png", "infoid": 1004520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个我一生都热爱和支持的组织也走向了黑暗面。\n是时候取消那份终身订阅了。(说真的，国家地理现在对我来说已经死了，因为我这样做了。这和“国家地理”已经不一样了。)。\n另一家对我来说应该是死路一条的公司，因为它在历史性的广播中毫无根据地破坏和删除了至关重要的流(YouTube的所有者)是……。\n我现在讨厌谷歌，因为你非法和错误地关闭了那些正在广播并作为一个社区一起庆祝的人，从而极大地伤害了我们社区的无辜欢呼，因为你非法和错误地关闭了那些正在广播的人，并将其作为一个社区一起庆祝，从而推动人类成为一个更好的物种，成为一个太空飞行物种。", "note_en": "An organization that I&#39;ve loved and supported ALL my life, has gone to the Dark Side as well.\n  Time to cancel that life long subscription. (Seriously: National Geographic is now dead to me, for doing this. This just isn&#39;t the same National Geographic anymore.)\n Another company that should be dead to me for unfoundedly destroying and taking down vitally important streams during historic broadcasts (who owns youtube) is...\n   I hate Google right now for how you greatly harmed our innocent viewing pleasure and how you greatly harmed our community&#39;s innocent cheering on of humanity&#39;s push to become a better species, and a space faring species, by illegally and WRONGLY shutting down those who were broadcasting and celebrating this as a community together.", "posttime": "2020-05-31 22:08:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,国家,geographic,无辜", "title": "国家地理非法声称所有Youtuber的流：SpaceXLounge", "title_en": "National Geographic Illegally Claimed Every Youtuber’s Stream: SpaceXLounge", "transed": 1, "url": "https://pay.reddit.com/r/SpaceXLounge/comments/gtwj02/national_geographic_illegally_claimed_every/", "via": "", "real_tags": ["youtube", "国家", "无辜"]}]