[{"category": "", "categoryclass": "", "imagename": "bcc2fdc783fb82fd9074529f613a8de9.jpg", "infoid": 1067247, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ryan Sammy是一个增长营销机构Fract的战略总监，帮助财富500年和精品企业通过高质量的内容改善反击组合，品牌意识和有机交通。\n    您可以看到它而不是立即显示顶部结果，谷歌在丰富的赛段中回答您的问题。它还为您提供了具有其他假期倒计时的相关搜索查询。在右边是Wikipedia的知识面板，大约万圣节，低于它，您将看到特色片段部分。当单击相关问题的答案时，这些代码段将扩展。\n  最后，在这些答案到您的查询和任何相关问题之后，您将获得第一个结果。此时，您是否需要访问网站？\n 谷歌搜索不是曾经是什么。我们都希望在搜索结果页面上排名第一，但这些天，到达该职位是不够的。这可能是值得的，而是在顶级特色片段位置之后。\n  特色片段是谷歌从与搜索查询相关的网页直接拉动的句子或单词的集合。这些代码段显示在搜索框下方，并旨在快速回答搜索查询。片段可以以列表的形式出现，如何进行步骤，表，短段框和其他格式。 ", "note_en": "Ryan Sammy is director of strategy at  Fractl, a growth marketing agency that helps Fortune 500s and boutique businesses improve backlink portfolios, brand awareness and organic traffic through high-quality content.\n    You can see that instead of displaying the top result right away, Google answers the question for you in a rich snippet. It also gives you related search queries featuring countdowns for other holidays. On the right is a knowledge panel from Wikipedia about Halloween, and below that, you’ll see the featured snippets section. These snippets will expand when clicked with answers for related questions.\n  Finally, after these answers to your queries and any related questions, you get to the first result. At this point, do you even need to visit the website?\n Google search is not what it used to be. We all want to be No. 1 on the search results page, but these days, getting to that position isn’t enough. It might be worth your while to instead go after the top featured snippet position.\n  Featured snippets are collections of sentences or words that Google pulls directly from a webpage relevant to the search query. These snippets are displayed right below the search box and are meant to answer search queries quickly. The snippets can appear in the form of lists, how-to steps, tables, short paragraph boxes and other formats.", "posttime": "2021-06-22 01:46:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,top,搜索", "title": "如何在2021年使用特色片段在Google搜索的顶部点 ", "title_en": "\n\t\t\t\tHow to land the top spot in Google search with featured snippets in 2021\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/how-to-land-the-top-spot-in-google-search-with-featured-snippets-in-2021/", "via": "", "real_tags": ["google", "top", "搜索"]}, {"category": "", "categoryclass": "", "imagename": "6452d522d28121e59177a7258280822f.jpg", "infoid": 1067246, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "温哥华的SoleSavy是一个致力于给粉丝提供策划的策划般的鞋子的策划场所，随着其所有滴剂，新闻和谣言，在包装200万美元的种子回合后筹集了1250万美元的时间，展示了投资者的热情背后垂直特定的优质社会体验。随着Bedrock Capity的参与，由Bedrock Capity的Roham Gharegozlou，Diplo，Bessemer Ventures和Turner Novak的Banana Capital等参与，等等。\n 首席执行官德国Pralica表示，该公司自去年晚些时候提高以来，该公司已推翻了其用户群，同时在同一时期将其团队从10到37名员工培养。\n  如今，SoleSavy的社区主要基于一个Slack集团网络，用户可以讨论一切。虽然平台的聊天社区在SLACK中陷入困境，但Pralica看到未来，该公司可以为成员建立自己的聊天中心，以进一步融入Startup的应用程序，网站和在线对话。近期目标越多，将这个社区发展成为一个值得信赖的买家和卖方的中心，在那里同行成员市场可以茁壮成长。 SoleSavy是一代新一代社交互联网市场的最前沿，垂直特定的社区可以在全包平台内收集和生长。\n “我确实在非常集成的端到端平台上设想，”Pralica告诉TechCrunch。“我想再次让运动鞋变得乐趣，享受对他们充满热情的人。”\n 部分乐趣的一部分已经通过Free-For-Blue聊天团体来减少，可以快速增长毒性或增长剥削，因为主持人看起来兑现在他们的网络上，所以Solsavy希望更加策划方法可以带回。\n  正如我的老板（和TC的居民运动鞋）Matthew在今年早些时候在唯一的种子的举报中说：\n 那个积极的社区氛围是Pralica所说的是Solesavy的长期焦点和差异化因素，让美国和加拿大的4000名成员在几乎每天的基础上与该小组互动......我一直在十几个或如此不同的团体上专注于购买大量每次释放以重新销售多年来，其中许多是最好，吵闹的毒性最差。 Pralica说，这是一个唯一的唯一要远离的环境。相反，Solesavy试图为那些想要购买和穿鞋的人，交易他们，是的，甚至最终转售个人对才能获得并佩戴另一个格拉勒。 \n该公司的大量系列在展示展示后几个月的举动，大量投资者受到社会社区围绕社会社区建立的垂直性市场的想法，将资金视为忽视筹款的机会，并专注于“建设” 未来“在识别Sneakersphere中的新机会时。  唯一的是迄今为止非常重点关注北美运动鞋头，但Pralica认为Hefty系列一张支票将平台带入新市场，包括澳大利亚和新西兰，英国，新加坡，日本和更广泛的欧洲。 该公司还计划利用新资金与播客，编辑特征，原始视频和成员活动建立其编辑网络。 ", "note_en": "Vancouver’s  SoleSavy, a sneaker community dedicated to giving fans a curated place to navigate the world of shoes, with all of its drops, news and rumors, has raised a $12.5 million Series A just months after wrapping a $2 million seed round, showcasing investor enthusiasm behind vertical-specific premium social experiences. The round was led by Bedrock Capital with participation from Dapper Labs’ CEO Roham Gharegozlou, Diplo, Bessemer Ventures and Turner Novak’s Banana Capital, among others.\n CEO Dejan Pralica says the company has tripled its user base since its seed raise late last year, while growing its team from 10 to 37 employees in the same period.\n  Today, SoleSavy’s community is based largely around a network of Slack groups where users can discuss just about everything. Though the platform’s chat communities are organized in Slack now, Pralica sees a future where the company could build its own chat hub for members, something to further tie-in the startup’s app, website and online conversations. The more near-term goal is to grow this community into a hub of trusted buyers and sellers where a peer-to-peer member marketplace can thrive. SoleSavy is at the forefront of a new generation of more social internet marketplaces where vertical-specific communities can gather and grow inside an all-encompassing platform.\n “I do envision on end-to-end platform that’s very integrated,” Pralica tells TechCrunch.”I want to make sneakers fun again and enjoyable for the people that are passionate about them.”\n Part of that fun has been diminished by free-for-all chat groups that can quickly grow toxic or grow exploitative as moderators look to cash in on their networks, something SoleSavy hopes a more curated approach can bring back.\n  As my boss (and TC’s resident sneaker head) Matthew said in his  write-up of SoleSavy’s seed raise earlier this year:\n That positive community vibe is what Pralica says is SoleSavy’s long-term focus and differentiating factor that keeps the 4,000 members across the U.S. and Canada interacting with the group on a nearly daily basis… I’ve been in a dozen or so different groups focused on buying large quantities of each release to re-sell over the years and many of them are, at best, rowdy and at worst toxic. That’s an environment that SoleSavy wanted to stay away from, says Pralica. Instead, SoleSavy tries to court those who want to buy and wear the shoes, trade them and yes, maybe even resell personal pairs eventually to obtain and wear another grail.\n The company’s sizable Series A raise just months after a seed showcases that plenty of investors are intrigued by the idea of verticalized marketplaces built up around social communities, Pralica sees the funding as a chance to ignore fundraising for a while and focus on “building for the future” while identifying new opportunities in the sneakersphere.\n SoleSavy has been pretty focused on North American sneaker heads so far, but Pralica see that hefty Series A check taking the platform into new markets, including Australia and New Zealand, United Kingdom, Singapore, Japan and broader Europe. The company also plans to use the new funding to build out its editorial network with podcasts, editorial features, original video and member events.", "posttime": "2021-06-22 01:46:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "社区,build,pralica", "title": "运动鞋社区启动Solesavy筹集了1250万美元的A系列A构建端到端的Sneakersphere ", "title_en": "\n\t\t\t\tSneaker community startup SoleSavy raises $12.5 million Series A to build an end-to-end sneakersphere\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/sneaker-community-startup-solesavy-raises-12-5-million-series-a-to-build-an-end-to-end-sneakersphere/", "via": "", "real_tags": ["社区", "build", "pralica"]}, {"category": "", "categoryclass": "", "imagename": "3f6f0a8f4ad36656b129a8e2cfae5448.jpg", "infoid": 1067245, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这笔交易，在新闻稿中宣布，除了来自Amblin和Netflix高管的发光报价，少数细节。所有这些都肯定的是，Amblin将为Netflix生产“每年多个新的功能电影”。\n “从TED [Sarandos，Netflix Co-Ceo和首席内容官员]和我开始讨论伙伴关系，很明显，我们有一个惊人的机会，以便在新的方面讲述新的故事并以新的方式达到观众，”Spielberg说发布。\n  几年前，当据报道，那些新的方式对Spielberg据据报道，他对学院奖项中的Netflix电影排除了这几年前。\n “一旦你提交电视形式，你就是电视电影，”Spielberg于2019年3月告诉ITV。“我不相信刚刚给予几个剧院的令牌资格的电影不到一周应该有资格为学院奖提名。“\n 尽管如此，最终没有真正推动。斯皮尔伯格是否被歪曲，改变了他的思想，或者只是读了房间，他已经锻炼了他的立场。他曾说过，他只是想珍惜和保护“戏剧经历” - 可以从现代大片的一个先驱之一中理解。\n 当然，它是一个巨大的Netflix，它将获得稳定的氨氨型功能，尽管没有保证Spielberg图片。与此同时，Amblin将继续与普遍存在的长期合作，填补了更传统的动作和分销方面。该公司已经用流媒体公司破碎了面包，其中由Netflix和其他人制作的节目和电影，但这是迄今为止最重要的伙伴关系。\n 也许它是Covid，建议斯皮尔伯格和阿博林，媒体平台是远离外国的，只需在许多方面都是行业的未来。在一个“戏剧经历”是一个潜在的超级普遍活动和人们完全乐意观看（并支付）家里的“Premiere”，可能更好地用拳打滚动，并希望事情反弹。 ", "note_en": "The deal,  announced in a press release with few details except glowing quotes from Amblin and Netflix executives. All that is certain is that Amblin will produce “multiple new feature films per year” for Netflix.\n “From the minute Ted [Sarandos, Netflix Co-CEO and Chief Content Officer] and I started discussing a partnership, it was abundantly clear that we had an amazing opportunity to tell new stories together and reach audiences in new ways,” said Spielberg in the release.\n  Those new ways didn’t sound so amazing to Spielberg a couple years ago when he was reportedly pushing to exclude Netflix films from the Academy Awards.\n “Once you commit to a television format, you’re a TV movie,” Spielberg told ITV in March of 2019. “I don’t believe films that are just given token qualifications in a couple of theaters for less than a week should qualify for the Academy Award nomination.”\n Ultimately no real push was made, though. Whether Spielberg was misrepresented, changed his mind, or just read the room, he has since tempered his position. He has said rather that he simply wants to cherish and protect “the theatrical experience” — understandable from one of the pioneers of the modern blockbuster.\n Naturally it’s a huge get for Netflix, which will get a steady stream of Amblin features, though there’s no guarantee of a Spielberg picture. Meanwhile Amblin will continue its longtime partnership with Universal, which fills the more traditional moviemaking and distribution side of things. The company has already broken bread with streaming companies, with shows and films made for and distributed by Netflix and others, but this is most significant partnership so far.\n Perhaps it was COVID that suggested to Spielberg and Amblin that streaming platforms are, far from going away, simply the future of the industry in many ways. In a world where the “theatrical experience” is a potential superspreader event and people are perfectly happy to watch (and pay for) a “premiere” at home, it may be better to roll with the punches and hope that things bounce back.", "posttime": "2021-06-22 01:46:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,amblin", "title": "Spielberg的Amblin墨水墨水多年的功能电影处理Netflix ", "title_en": "\n\t\t\t\tSpielberg’s Amblin inks multi-year feature film deal with Netflix\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/spielbergs-amblin-inks-multi-year-feature-film-deal-with-netflix/", "via": "", "real_tags": ["电影", "amblin"]}, {"category": "", "categoryclass": "", "imagename": "f836ce1f3532f41865e7566a77edcbcf.png", "infoid": 1067243, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Warning: Can only detect less than 5000 characters\nWarning: Can only detect less than 5000 characters\n简而言之，qu'est-ce qu'une plante？ 是一个辉煌，必要的工作，当时植物生活激发了肉食主义者和肉食主义者的植物主义者的一个不和谐的声音。 ", "note_en": "What if plants suffered, thought, helped each other? And what if the carrot were an animal like any other? According to Peter Wohlleben, famous German forest engineer and author of the best-seller  The Hidden Life of Trees, “whether it’s a wolf ripping apart a wild boar or a deer eating an oak seedling, in both cases there is pain and death” (quoted p. 13). The thesis is original, and seems all the more innocuous since none of its defenders call for people to stop cooking plants.\n Is there not in this form of neo-animism, which sees a continuity between human and plant subjective interiority, an element of bad faith? Is not the alleged suffering of plants, Florence Burgat asks, “a new diversion from the cause of animals” (p. 172)? Dominique Lestel, author of  Apologie du carnivore (Apology for Carnivorism), does not hide his polemical intentions: “Why would it be more ethical to make a carrot suffer than a hare?” (quoted p. 13). In good logic, if the carrot and the hare suffer in equal measure, “it is not ethical” to discriminate between them, to spare animals while savagely killing blades of grass, carrots, and soy sprouts. In this sense, vegetarians are murderers like any other. Just let carnivores enjoy themselves!\n Against this thesis, known as the “cry of the carrot” ( le cri de la carotte), animalists have so far been content to answer two things. On the one hand, plants do not have a nervous system, and so they do not feel pain. On the other hand, carnivores consume animals that are themselves fed on plants. Worse, the production of one animal protein requires 7 to 10 plant proteins. The argument is a strictly accounting one. Even if plant suffering were of the same intensity as animal suffering, omnivores would produce seven to ten times more suffering than plant lovers alone.\n Burgat is not satisfied with these arguments. The first is based on the idea that there can be no suffering without a nervous system. A  handful of biologists, controversial to be sure, follow in Wohlleben’s footsteps and argue that plants have a form of “diffuse nervous system.” In their view, synaptic activity—electrical signals—on the body of plants functions like a diffuse brain, one that is not concentrated in a single organ, as in animals. As for the second argument, it concedes that killing a carrot is murder, a murder comparable to that of a farm animal. In the eyes of the philosopher, this concession is absurd, pointless.\n Qu’est-ce qu’une plante? (What is a plant?) goes beyond these two arguments by defending the thesis of a radical ontological difference between plant and animal life. According to Burgat, resolving the question of pain, of subjectivity, requires us to focus on how plants give themselves to us, on their phenomenology.\n  The book is divided into three parts: epistemology, ontology, and morals and rights. The first part deals with the knowledge of plants. How does one produce knowledge about plants? Two models of knowledge can be distinguished: homological and analogical. The homological model assimilates plants to animal or human life. The body parts of one correspond to the body parts of the other. This is Wohlleben’s model. Drawing on numerous passages from his book, Burgat easily shows that anthropomorphism is not here a simple method of popularizing science, a pedagogical metaphor; it is taken as a given. The other model of knowledge, the analogical paradigm, is more interesting and more complex. Since we know animals better than plants, since the former are closer to us physically, emotionally, and mentally, the scientific strategy of botanists has long consisted in investigating the unknown in plants based on the animal model—as François Delaporte observes in his works, but also Foucault in  The Order of Things. According to Burgat, this model of knowledge stumbles on at least two fundamental points: plant nutrition and reproduction. Unlike animals, plants are capable of feeding themselves without taking ready-made organic molecules from their environment; they can synthesize the latter from light. Thus, plants do not need to look for food. As for reproduction, some plants reproduce by cutting, “which remains unexplained, for lack of finding an analogue elsewhere” (Canguilhem, quoted p. 36). In this mode of reproduction, like comes from like. “A plant,” writes Hegel quoted by Burgat (p. 40), “is an aggregate of a group of individuals which form a single individual, but whose parts are completely self-subsistent.”\n It will be objected that certain plants, for instance carnivorous plants (p. 60), are mixotrophic, capable also of feeding on pre-existing organic constituents. Moreover, plant reproduction is not always asexual; not all plants can grow from a cutting. This is because a good part of the misunderstandings concerning plants stems “from the idea that finding an animal feature in a plant organism suffices to extract [this organism] from its category and to place it in the opposite category” (pp. 51-52). No single empirical feature is the truth of an organism. “Under the analytical eye, empirical features say nothing when taken one by one; they never allow the ontological question to be decided” (p. 52). The organism is the structure and not the sum of its parts. Against analytical methodology, which decomposes the living into its elements, Burgat pleads for a science or an interpretation of forms, of the whole that is formed and transformed.\n  Thus, Florence Burgat propose an ontological study based on a phenomenology of plant life. The investigation focuses on what plants are. The challenge is to understand what substantially differentiates plants from animals by proposing both a negative, privative definition (what they do not have compared to animals) and a positive one (what they have that animals do not have). To understand what is specific to plant life, one must first engage in comparative analysis, which is the means by which philosophy, and not only the current of philosophical anthropology, approaches the “question of plant life.” Negatively, the plant has no perception in the psychological sense (p. 55). When the plant has infraperceptions, that is, perceptions without a subject to experience them as its own, it is not necessarily its unity that infraperceives—a unity that is nowhere to be found—but some of its parts. Plants react finely to any corpuscular or undulatory phenomenon, but without forming mental images of it (p. 90).\n There is no interiority, no life of consciousness, no intentionality in plant life: “Consciousness appears only in the primitive reflection of sensation” (Scheler, quoted p. 79). Plant life is neither experiential nor restless (p. 102).\n Plants do not have a lived world; their life is immediate. They are among the living beings for whom objects in the world have only one meaning. There is no multivocality of meaning. There is no error experienced as an error, no astonishment at what appears. There is an “absolutely radical” division between the plant world and the animal world, between the world of “objective correspondence” and the world of subjective meaning (p. 64). Plants are not individuals, if individuals are indivisible totalities whose division implies destruction (p. 105).\n Finally, plants do not move. Phototropism, or reaction to light, is just that—a reaction. “The animal,” writes Hans Jonas, “can freely close and open its jaws whenever it feels like it—to chew, to yawn, or simply to exercise this faculty—and it can stop and reverse every movement in progress” (quoted p. 62). The plant does not have this freedom; it cannot close and open its leaves.\n From the perspective of a positive ontology, Burgat wonders whether the life of the plant might not closely approximate life as a superpowerful and eternal force. In some respects, the plant seems immortal, freed from temporality: Seeds or root fragments suffice for its rebirth. Plants are “driven by pure growth, unaware of the caesura of birth and the irreversible rupture of death, slowly collapsing in on themselves to relive elsewhere” (p. 83). If the plant is not an individual, then its positive quality may be that it is a  dividuum (according to the expression coined by a biologist quoted by Plessner, p. 105). The plant is “the greatest chemist among all living beings (...) it builds the elements of its organic development from inorganic substances” (Scheler, quoted p. 110). This capacity—this autotrophy—is the mark of its autarchic royalty (p. 130). Whereas for Claude Lévi-Strauss the animal is the most other of all others, that is, the psycho-subjective structure which, sharing a common basis, is the most alien to us, plant life for Burgat is “radical alterity” (p. 129), that which resists all common, lived experience.\n  Is plant life—as defined through the ontological investigation—worthy of respect? The philosopher shares with Lévi-Strauss and Francis Hallé a certain repugnance for the felling of trees. Their destruction as well as “the ransacking and pollution of natural environments are reproved for their consequences and for what they are in themselves: a repugnant attitude” (p. 144). This repugnance appears to be an intuition, the first answer that comes to mind when we are summoned to answer the question “is it right to cut down the tree that is standing over there, right in front of me, and has been around for decades?” But is this intuition correct? Is it reprehensible to cut down a hundred hundred-year-old oaks to rebuild the framework of Notre-Dame Cathedral (p. 148)? If it is reprehensible, is our repugnance consistent with the principle of attributing fundamental rights to plants?\n Burgat does not definitively settle these questions. In terms of content, she sides with Rousseau and Bentham. Sensibility is a necessary and sufficient condition to be a bearer of rights. In terms of form, she points out that, from a strictly technical point of view, nothing prevents the legislator from protecting the interests of humans in the environment, if they consider these interests sufficiently important to set up a specific protection, or to protect such and such a species of flower, or such and such a tree that is particularly remarkable for aesthetic reasons. One may well call legal “rights” these types of rights which are conceptually indirect. If historical monuments can be protected (p. 153), then so can plants. Nevertheless, Burgat insists, one should not attribute an inherent, absolute value to what does not seem to have any, beyond the beauty it inspires in us. The humanist doctrine which, believing that it serves the cause of humanity, “destroys the object of its contempt (nature and animals)” (p. 144) will find no remedy in metaphors about the soul of trees.\n In short,  Qu’est-ce qu’une plante? is a brilliant and necessary work, a discordant voice at a time when plant life inspires both biologists and philosophers of carnivorism.", "posttime": "2021-06-22 01:39:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "动物,plants,qu", "title": "如果植物是像其他动物一样的动物怎么办？ ", "title_en": "What if plants were animals like any other?", "transed": 1, "url": "https://booksandideas.net/Are-Plants-Animals-Like-Any-Other.html", "via": "", "real_tags": ["动物", "plants", "qu"]}, {"category": "", "categoryclass": "", "imagename": "e1a7afd4e3cf897468f7ae51916a95ee.jpeg", "infoid": 1067242, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "听起来像是雇用小丑。也许你应该改善你的招聘流程。你如何跟踪他们现在完成的东西？\n 我不知道。现在我走来走去问他们，我们在谈论它的地方会议;如果我＆＃39;我不是周围的，我怎么知道他们是否懈怠？\n 也许您应该努力改进您衡量的内容以及您如何鼓励反馈。有办法讲述人们是否为自己付出代价做好事来说，通常是一个好主意。\n 但如果我看不到他们要确保他们正在工作，那么我无法管理它们。\n 听起来你需要升级为经理。还有其他技能可以改进您如何管理不同类型的团队和工作方式。你作为领导者的工作是拥有一支富有成效的团队;采取所有权，并以新的方式调整到运行生产力团队。\n 但我们不能让我们的人们看不见对方，他们不会很好地沟通。\n 人们一直在不在同一个地方的情况下协调大型项目。您可能希望考虑提高您的流程。一些简单的变化可以改善您的沟通。 \n去年＆＃39; T典型的遥控作品;大多数公司都急于离开办公室，但并没有拥抱遥控作品。遥控工作，如果做得好，不是一天充满了缩放会议。 Gitlab是一个6B公司的公司，有一个可能是一个有趣的阅读。在它中，他们说，当他们只是以同样的方式做所有事情，但不在同一个地方，这家公司是在斯凯乌尔的阶段。您可以将其归结为后来的阶段，您可以在视频通话中花费这么多。\n 我是一个经理，如果我花更少的时间在会议上，我整天都在做什么？\n 我很欣赏诚实;这听起来像是一个很棒的问题。战略性地思考，帮助培养你的人民，写作会议的文件。你会很忙，只是以不同的方式。\n  听起来像是他们想要的话，你不让他们，他们会留给其中一个让他们的公司之一。我希望他们都不是你的竞争对手。\n 但是我们正在为办公空间支付所有这笔钱，我不想浪费一下。\n 最终是你的电话。根据您的业务，失去一些关键员工可能会更糟糕的是，吃一年的租约。根据您的业务，减少个人会议，能够在几个小时之外雇用人才，并且具有更高的忠诚员工可能不那么重要，而不是大租赁费用。此外，您可能会遇到沉没的成本谬误。\n 我不想改变我的工作方式，我只想让人们在办公室里加入我。我的孩子们疯了。说i＆＃39;寂寞是奇怪的;我想念我的办公室朋友。 \n该办公室有一些伟大的事情。 你有没有坐下并列出他们并想到了更多建立的公司确保没有办公室的事情？ 你可能会感到惊讶。 此外，你走出办公室的一些东西是你可以在其他地方得到的东西。 您可以独立选择您的朋友，并且有办法弄清楚如何在孩子身边工作。  您可能还想学习如何在家工作时处理您的孩子。 ", "note_en": "Sounds like you hire clowns. Maybe you should improve your hiring process. How do you track what they are getting done now?\n I don&#39;t know. Now I walk around and ask them, and we have meetings where we talk about it; if I&#39;m not around how would I know if they were slacking off?\n Maybe you should work to improve what you measure and how you encourage feedback. It is normally a good idea to have ways to tell if people are doing a good job for what you are paying them to do.\n But if I can’t see them to make sure they are working, then I can’t manage them.\n Sounds like you need to level up as a manager. There are other skills to improve how you manage different types of teams and working styles. Your job as a leader is to have a productive team; take ownership of this and adjust to running a productive team in a new way.\n But we can’t let our people not see each other, they won’t communicate well.\n People coordinate large projects all the time without being in the same place. You might want to think about improving your processes. Some simple changes could improve your communication.\n  The last year isn&#39;t typical remote work; most companies were rushing to move away from the office, but were not embracing remote work. Remote work, if done well, is not a day full of Zoom meetings. GitLab, a $6B company, has a guide that might be an  interesting read. In it, they say that the company is in the  Skeumorph phase when they just do everything the same way, but not in the same place. You can mature past this into later phases where you don&#39;t spend so much on video calls.\n I&#39;m a manager, if I spend less time in meetings, what am I going to be doing all day?\n I appreciate the honesty; that sounds like a great problem to have. Thinking strategically, helping to grow your people, writing documents that would have been meetings. You will be plenty busy, just in a different way.\n  Sounds like if they want to and you don’t let them, they will leave to one of the many companies that let them. I hope none of them are your  competitors.\n But we are paying all this money for office space, I don&#39;t want to waste that.\n That is ultimately your call. Depending on your business,  losing a few key employees might be worse that eating a year of a lease. Depending on your business, reducing in-person meetings, being able to hire talented people a few hours away, and having happier more loyal employees might be less important than a big lease cost. Also, you might be experiencing the  Sunk Cost Fallacy.\n I don&#39;t want to change the way I work, I just want people to join me in the office. My kids are driving me crazy. Is it weird to say I&#39;m lonely; I miss my office friends.\n The office has some great things going for it. Have you ever sat down and listed them and thought about how more established companies make sure those things happen without an office? You might be surprised. Also, some of the things   you get out of the office are things you can get elsewhere. You can choose your friends independently of your work, and there are ways to figure out how to work around your kids.\n   You might also want to learn how to handle your kids while working from home.", "posttime": "2021-06-22 01:39:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不能,work", "title": "由于愚蠢的原因，我们不能让人们在家工作 ", "title_en": "We Can't Let People Work from Home, for Stupid Reasons", "transed": 1, "url": "https://blog.davidtate.org/we-cant-let-people-work-from-home-for-stupid-reasons/", "via": "", "real_tags": ["不能", "work"]}, {"category": "", "categoryclass": "", "imagename": "de5f58e3b57eeb57d9e1a6129697ed73.jpeg", "infoid": 1067240, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "百分之六十的千禧一年每年耙耙，他们居住在薪水中，达到薪水，发现了Pymnts和Lendingclub的新调查，分析了经济数据和普查均衡调查超过28,000名美国人。\n 它发现约有54％的美国人将薪水达到薪水。近40％的高收入者 - 每年制作超过10万美元的人 - 说他们的生活方式。\n 这意味着高收入的千禧一代aren＆＃39; t唯一的感觉伸展稀薄，但他们觉得这比他们的六个数字的同龄人更多。报告称，居住在受约束预算中可能与收入较少，与费用有关，该报告称。\n     这部分是因为生活方式选择。许多这些千禧一代很可能是亨利 - 高收入者，尚未富裕。首字母缩略词是在2003年发明的，但它已经表征了一组30的六位数六数人，以平衡他们的支出和储蓄习惯。\n 当一个人增加一个＆＃39;匹配酌情收入增加时，亨利通常会使生活方式蠕变成为生活方式蠕变。他们更喜欢舒适且经常昂贵的生活方式，让他们生活在薪水中的薪水。\n        正如报告所说，＆＃34;薪水的生活薪水有时会携带几乎没有贫穷和贫困的内涵。今天美国的薪水到薪水生活方式的现实更加复杂，目前的经济环境使它变得更加复杂。＆＃34;\n 它引用了大学35岁的35岁赚取超过100,000美元的例子，同时拖放抵押贷款，学生贷款债务和一个孩子，可以留下少量购买或意外的紧急情况。 \n这一代面临着负担能力危机。收入增加根本并没有保持生活成本的指数增加，大流行的人和＃39; T通过投入失业并支付削减混合来帮助重要。\n 自20世纪70年代以来，教育成本也增加了一倍多，留下了许多千年学生债务。 Priya Malani，Stash Refort的创始人，这是一个与亨利有关的金融公司，以前告诉Insider，40％的客户有学生贷款。平均而言，他们欠80,000美元。\n     作为这种生活成本增加的副产品，中产阶级一直在萎缩。 PEW研究中心定义了美国中产阶级，因为人们赚取三分之二到中位数家庭收入的两倍 - 即2018年约为48,500至145,500美元，最近的数据提供了最新数据。\n 这意味着六分之一的薪水不再是曾经是什么。在今天的经济中，100,000美元被认为是美国中产阶级。\n  点击“注册”，您同意从Insider以及其他合作伙伴提供的营销电子邮件以及接受我们的服务条款和隐私政策。\n          形成一个＆＃39的两个交叉线; x＆＃39;它表示封闭互动或解雇通知的方法。 ", "note_en": "Sixty percent of millennials raking in over $100,000 a year said they&#39;re living paycheck to paycheck, found a  new survey by PYMNTS and LendingClub, which analyzed economic data and census-balanced surveys of over 28,000 Americans.\n It found that about 54% of Americans live paycheck to paycheck. And nearly 40% of high earners — those making more than $100,000 annually — said they live that way.\n That means high-earning millennials aren&#39;t the only ones feeling stretched thin, but they feel that way more than their six-figure-making peers. Living on constrained budgets may therefore have less to do with income and more to do with expenses, the report said.\n     That&#39;s partly because of lifestyle choices. Many of these millennials are likely  HENRYs — short for high earner, not rich yet. The acronym was invented in 2003, but it has come to characterize a certain group of 30-something six-figure earners who struggle to balance their spending and savings habits.\n HENRYs typically fall victim to  lifestyle creep, when one increases one&#39;s standard of living to match a rise in discretionary income. They prefer a comfortable and often expensive lifestyle that leaves them living paycheck to paycheck.\n        As the report said, &#34;Living paycheck to paycheck sometimes carries connotations of barely scraping by and of poverty. The reality of a paycheck-to-paycheck lifestyle in the United States today is much more complex, and the current economic environment has made it even more complicated.&#34;\n It cited the example of a college-educated 35-year-old earning more than $100,000 while juggling a mortgage, student-loan debt, and a child, which could leave them with little savings for big purchases or unexpected emergencies.\n The generation is facing an  affordability crisis. Income increases simply  have not kept up with an exponential increase in living costs, and the pandemic hasn&#39;t helped matters by throwing job loss and  pay cuts into the mix.\n The cost of education has also more than doubled since the 1970s, leaving many millennials with student debt. Priya Malani, the founder of  Stash Wealth, a financial firm that works with HENRYs,  previously told Insider that 40% of her clients had student loans. On average, they owed $80,000.\n     As a byproduct of this increased cost in living, the middle class has been shrinking. Pew Research Center  defines the US middle class as people earning two-thirds to twice the median household income — i.e., about $48,500 to $145,500 in 2018, the most recent data available found.\n That means a six-figure salary is no longer what it used to be. In today&#39;s economy, $100,000 is considered middle class in the US.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-06-22 01:38:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "薪水,paycheck,生活", "title": "60％的千禧一代赚取超过100万美元的现场薪水到薪水 ", "title_en": "60% of Millennials Earning over $100k Live Paycheck to Paycheck", "transed": 1, "url": "https://www.businessinsider.com/high-earning-henry-millennials-six-figure-salaries-feel-broke-2021-6", "via": "", "real_tags": ["薪水", "paycheck", "生活"]}, {"category": "", "categoryclass": "", "imagename": "27dac31ace458d4e4a7fab7a8e1106db.jpg", "infoid": 1067239, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究人员说，人类可能居住在墨西哥南部南部南部南部令人惊讶的是，在33,448和28,279年之间。\n 如果是这样，那些人在人们经常被标记为第一个美国人（SN：7/11/18）之前，那些人达到了10,000多年。其他初步证据在大约33,000年前（SN：7/22/20）大约在墨西哥中部墨西哥人类。\n 最新的证据来自动物骨骼，生物人类学家和考古学家安德鲁·萨默维尔和两位墨西哥同事发现储存在墨西哥城实验室。骨头在20世纪60年代挖掘出一个叫做Coxcatlan洞穴的岩石屋。\n 来自该场地最深沉积物的六只兔子骨头的雷可碳分析产生了意外的老年人，研究人员在200月19日在线报告了拉丁美洲古代。该沉积物还含有芯片和锋利的石头被该网站的铅挖掘机被视为工具。\n 较高的沉积物层产生更清晰的石材工具和其他人类活动残余物的例子，约为9,900年前。萨默维尔在阿瓦达州立大学举动，最初怀疑来自最深沉积物的兔子骨骼可能大约12,000岁。但分析显示，他们年纪大了，暗示人类大约30,000年前住在洞穴里。\n 萨默维尔接下来将确定古代沉积物的其他动物骨骼是否显示屠宰标记，突破骨髓从烹饪中删除或烧毁斑块。他还希望找到和研究可能存储在同一实验室中的相同沉积物的可能的石工具。\n 根据其他墨西哥地点的额外的RadioCarbon日期和比较来自其他墨西哥网站，Somerville怀疑占据了Coxcatlan洞穴的单独占用，介于13,500至9,900日之间。当最后一次和19,000年前的最后一次冰增长时，区域食品和水源可能已经陷入困境，导致最早的定居者在条件改善，索维尔推测之前离开和推迟进一步职业。 \nA. Somerville，I. Casar和J. Arroyo-Cabrales。 新的AMS Radiocarbon年龄来自Coxcatlan Cave，Puebla，Mexico的Pexcatlan Cave：全新生占领Tehuacan山谷？ 拉丁美洲古代。 在线发布于2021年5月19日。DOI：10.1017 / LAQ.2021.26。 ", "note_en": "Humans may have inhabited what’s now southern Mexico surprisingly early, between 33,448 and 28,279 years ago, researchers say.\n If so, those people arrived more than 10,000 years before  folks often tagged as the first Americans ( SN : 7/11/18). Other preliminary evidence puts  humans in central Mexico as early as around 33,000 years ago ( SN: 7/22/20).\n The latest evidence comes from animal bones that biological anthropologist and archaeologist Andrew Somerville and two Mexican colleagues found stored in a Mexico City lab. The bones had been excavated in the 1960s at a rock-shelter called Coxcatlan Cave.\n Radiocarbon analyses of six rabbit bones from the site’s deepest sediment  yielded unexpectedly old ages, the researchers report online May 19 in  Latin American Antiquity. That sediment also contained chipped and sharp-edged stones regarded as tools by the site’s lead excavator.\n Higher sediment layers yielded clearer examples of stone tools and other remnants of human activity dating to nearly 9,900 years ago.  Somerville, of Iowa State University in Ames, initially suspected that rabbit bones from the deepest sediment were perhaps around 12,000 years old. But analyses revealed they were much older, hinting humans were living in the cave roughly 30,000 years ago.\n Somerville will next determine whether other animal bones from the ancient sediment display butchery marks, breaks where marrow was removed or burned patches from cooking. He also wants to locate and study possible stone tools from that same sediment that may be stored in the same lab.\n Based on additional radiocarbon dates and comparisons with stone-tool finds from other Mexican sites, Somerville suspects that a separate occupation of Coxcatlan Cave occurred between 13,500 and 9,900 years ago. Regional food and water sources may have dwindled when the last Ice Age peaked between 26,000 and 19,000 years ago, causing the earliest settlers to leave and delaying further occupations  until conditions improved, Somerville speculates.\n   A. Somerville, I. Casar and J. Arroyo-Cabrales.  New AMS radiocarbon ages from the preceramic levels of Coxcatlan Cave, Puebla, Mexico: A Pleistocene occupation of the Tehuacan Valley?  Latin American Antiquity. Published online May 19, 2021. doi: 10.1017/laq.2021.26.", "posttime": "2021-06-22 01:38:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建议,suggest,可能", "title": "新的线索建议人们在30k年前大约到达美洲 ", "title_en": "New clues suggest people reached the Americas around 30k years ago", "transed": 1, "url": "https://www.sciencenews.org/article/americas-ancient-people-arrival-mexico-coxcatlan-cave", "via": "", "real_tags": ["建议", "suggest", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067237, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我发送的电子邮件的编辑副本，为APT-key的用户提供指导，即如何处理帖子关键世界中的事物。  手动页面已经提供了更换APT-key添加使用所需的所有信息：  注意：而不是使用此命令，键控应直接放在带有描述性名称的/etc/pt/trusted.gpg.d/目录中，并将“gpg”或“asc”作为文件扩展名  因此，有点令人惊讶的人需要一步一步一步地将文件复制/下载到目录中。  我还将讨论替代安全的蜗牛方法，符合这变得流行。 也许我们不应该添加签名，人们似乎忘记了DEBS仍然以root身份运行维护者脚本。  除此之外，Debian用户应该查找Extropo，为您管理策划的外部存储库。  较旧的（和所有）版本只支持扩展名为.gpg的unwormored文件。 如果您关心它们，请提供一个，并使用 \n有些人会告诉你下载.asc和管道它到gpg --dearmor，但是GPG可能无法安装，所以真的，只需提供一个.gpg一个，而是支持所有系统的支持。\n      人们说，不使用trusted.gpg.d并在其他地方安装文件，然后从源代码。使用符号=＆lt;文件＆gt;文件＆gt;文件＆gt;所以这看起来很安全，因为现在你的密钥无法签署其他不相关的存储库。志愿者，安全性增加是最小的，因为包维护者脚本无论如何都可以作为root。但我想这更好的宣传:)\n 作为一个例子，以下是从信号.org安装信号桌面的说明。如上所述，GPG --dearmor在没有一个好主意，我个人不会告诉人们修改/ usr，因为它应该由包管理器管理，但我们没有/ etc / apt / keyrings目前或类似的;如果包装安装键控，则很好。您也可以只添加那里的文件作为起点，然后安装keyring包覆盖它（假装下面有一个信号桌面键控包，它会覆盖我们添加的.gpg）。\n ＃注意：这些说明仅适用于64位Debian的＃Linux发行版，例如Ubuntu，Mint等。＃1.安装我们的官方公共软件签名keywget -o-https://updates.signal.org/desktop/apt/ keys.asc | gpg --dearmor＆gt; signal-desktop-keyring.gpgcat信号 - 桌面-keyring.gpg | sudo tee -a /usr/share/keyrings/signal-desktop-keyring.gpg＆gt; / dev / null＃2.将我们的存储库添加到RepositieseCho＆＃39; deb [arch = amd64签名= / usr / share / keyrings / signt-desktop-keyring.gpg] https：//updates.signal .org /桌面/ apt Xenial Main＆＃39; | \\ sudo tee-a /etc/apt/sources.list.d/signal-xenial.list# 3.更新您的包数据库并安装Scnersudo APT更新＆amp;＆amp; sudo apt安装信号桌面\n 我想知道为什么他们做wget | gpg --dearmor，管道进入文件然后猫| sudo t恤它，而不是在一个管道中拥有这一切。也许他们想要更好的进度报告。\n   对于系统图像构建，在/etc/apt/trusted.gpg.d中运送密钥似乎是合理的;你是供应商的类型，所以它可以全局信任。\n Chrome风格的DEBS和Repository Config DEBS：如果您发出DEB，则嵌入Sources.List.d Scippet（调用它$ MyRepo.List）并运送$ MyRepo.gpg IN / USR / Share / Keyrings是最好的方法。无论您是在产品中发货，还是提供存储库配置DEB（让我们调用它myRepo-repo.deb），然后告诉人们运行APT更新，后跟APT安装＆lt; repo＆gt内部包装。我猜，取决于仓库中的包数量。 \n手动说明（信号样式）：第三种情况，您告诉别人自己运行Wget，我发现棘手。我们在信号中看到，只是将钥匙圈文件填充到/ usr / share / keyrings是流行的，尽管/ usr应该是由包管理器管理。我们没有内部/ etc / etc（或/ usr / local）的另一个程序，因此很难建议其他东西。实际上没有签名的额外工作没有显着的好处，所以这是额外的工作不过，收获很少。\n  这部分是新的，只是为了这个博客帖子。让我们来看看即将到来的变化以及它们如何让事情变得更加容易。\n  假设我得到了合并的合并请求，APT的下一个版本（2.4 / 2.3.something）将消除所有复杂性，并允许您将密钥直接嵌入DEB822 .Sources文件（现在已在某个时间可用）：\n 类型：deburis：https：//myrepo.example/ https：//myotherrepo.example/suites：stable not-so-stablecomponents：mainsigned-by：--------------------------------------------------------------------------------------------------------------------------------------------------------------开始PGP公钥块-----。 mDMEYCQjIxYJKwYBBAHaRw8BAQdAD / P5Nvvnvk66SxBBHDbhRml9ORg1WV5CvzKY CuMfoIS0BmFiY2RlZoiQBBMWCgA4FiEErCIG1VhKWMWo2yfAREZd5NfO31cFAmAk IyMCGyMFCwkIBwMFFQoJCAsFFgIDAQACHgECF4AACgkQREZd5NfO31fbOwD6ArzS dM0Dkd5h2Ujy1b6KcAaVW9FOa5UNfJ9FFBtjLQEBAJ7UyWD3dZzhvlaAwunsk7DG 3bHcln8DMpIJVXht78sL = IE0r ----- END PGP PUBLIC KEY BLOCK -----\n 然后，您只能为用户提供.osources文件，他们将其放入“sources.list.d”，并且一切都神奇地工作\n  嗯，Python-APT的安全源包仍然不支持Deb822来源，无论如何，我们都需要一个aptsources2，以便为倒退 - 兼容性原因，然后端口软件属性和其他用户。\n  我们在使用ED25519Keys签署释放文件的作品中，我们确实可以更好地更换GPG。它暂时命名为aptsign，但它是一个单章deb822文件的概括性程序，类似于表示/ miniSign。 \n我们认为，这解决了我们OpenPGP集成的安全性噩梦，同时降低了复杂性。 键短得多，所以上面的遗工文件看起来很好。 ", "note_en": "This is an edited copy of an email I sent to provide guidance to users of apt-key as to how to handle things in a post apt-key world.\n The manual page already provides all you need to know for replacing  apt-key add usage:\n Note: Instead of using this command a keyring should be placed directly in the /etc/apt/trusted.gpg.d/ directory with a descriptive name and either “gpg” or “asc” as file extension\n So it’s kind of surprising people need step by step instructions for how to copy/download a file into a directory.\n I’ll also discuss the alternative security snakeoil approach with signed-by that’s become popular. Maybe we should not have added  signed-by, people seem to forget that debs still run maintainer scripts as root.\n Aside from this email, Debian users should look into  extrepo, which manages curated external repositories for you.\n        Older (and all) releases only support unarmored files with an extension .gpg. If you care about them, provide one, and use\n  Some people will tell you to download the  .asc and pipe it to  gpg --dearmor, but  gpg might not be installed, so really, just offer a  .gpg one instead that is supported on all systems.\n      People say it’s good practice to  not use  trusted.gpg.d and install the file elsewhere and then refer to it from the  sources.list entryby using  signed-by=&lt;path to the file&gt;. So this looks a lot safer, because now your key can’t sign other unrelated repositories. Inpractice, security increase is minimal, since package maintainer scripts run as root anyway. But I guess it’s better for publicity :)\n As an example, here are the instructions to install  signal-desktop from signal.org. As mentioned,  gpg --dearmor use in there is not a good idea, and I’d personally not tell people to modify  /usr as it’s supposed to be managed by the package manager, but we don’t have an  /etc/apt/keyrings or similar at the moment; it’s fine though if the keyring is installed by the package. You can also just add the file there as a starting point, and then installa keyring package overriding it (pretend there is a signal-desktop-keyring package below that would override the .gpg we added).\n # NOTE: These instructions only work for 64 bit Debian-based# Linux distributions such as Ubuntu, Mint etc.# 1. Install our official public software signing keywget -O- https://updates.signal.org/desktop/apt/keys.asc | gpg --dearmor &gt; signal-desktop-keyring.gpgcat signal-desktop-keyring.gpg | sudo tee -a /usr/share/keyrings/signal-desktop-keyring.gpg &gt; /dev/null# 2. Add our repository to your list of repositoriesecho &#39;deb [arch=amd64 signed-by=/usr/share/keyrings/signal-desktop-keyring.gpg] https://updates.signal.org/desktop/apt xenial main&#39; |\\ sudo tee -a /etc/apt/sources.list.d/signal-xenial.list# 3. Update your package database and install signalsudo apt update &amp;&amp; sudo apt install signal-desktop\n I do wonder why they do  wget | gpg --dearmor, pipe that into the file and then  cat | sudo tee it, instead of having that all in one pipeline. Maybe they want nicer progress reporting.\n   For system image building, shipping the key in  /etc/apt/trusted.gpg.d seems reasonable to me; you are the vendor sort of, so it can be globally trusted.\n Chrome-style debs and repository config debs: If you ship a deb, embedding the  sources.list.d snippet (calling it  $myrepo.list) and shipping a  $myrepo.gpg in  /usr/share/keyrings is the best approach. Whether you ship that in product debs aka  vscode/ chromium or provide a repository configuration deb (let’s call it  myrepo-repo.deb) and then tell people to run  apt update followed by  apt install &lt;package inside the repo&gt; depends on how many packages are in the repo, I guess.\n Manual instructions (signal style): The third case, where you tell people to run  wget themselves, I find tricky.As we see in signal, just stuffing keyring files into  /usr/share/keyrings is popular, despite  /usr supposed to be managed by the package manager.We don’t have another dir inside  /etc (or  /usr/local), so it’s hard to suggest something else.There’s no significant benefit from actually using  signed-by, so it’s kind of extra work for little gain, though.\n  This part is new, just for this blog post. Let’s look at upcoming changes and how they make things easier.\n  Assuming I get my  merge request merged, the next version of APT (2.4/2.3.something) will do away with all the complexity and allow you to embed the key directly into a deb822  .sources file (which have been available for some time now):\n Types: debURIs: https://myrepo.example/ https://myotherrepo.example/Suites: stable not-so-stableComponents: mainSigned-By: -----BEGIN PGP PUBLIC KEY BLOCK----- . mDMEYCQjIxYJKwYBBAHaRw8BAQdAD/P5Nvvnvk66SxBBHDbhRml9ORg1WV5CvzKY CuMfoIS0BmFiY2RlZoiQBBMWCgA4FiEErCIG1VhKWMWo2yfAREZd5NfO31cFAmAk IyMCGyMFCwkIBwMFFQoJCAsFFgIDAQACHgECF4AACgkQREZd5NfO31fbOwD6ArzS dM0Dkd5h2Ujy1b6KcAaVW9FOa5UNfJ9FFBtjLQEBAJ7UyWD3dZzhvlaAwunsk7DG 3bHcln8DMpIJVXht78sL =IE0r -----END PGP PUBLIC KEY BLOCK-----\n Then you can just provide a  .sources files to users,they place it into `sources.list.d,and everything magically works\n  Well, python-apt’s  aptsources package still does not support deb822 sources, andnever will, we’ll need an  aptsources2 for that for backwards-compatibility reasons,and then port  software-properties and other users to it.\n  We do have a better, tighter replacement for gpg in the works which uses Ed25519keys to sign Release files. It’s temporarily named  aptsign, but it’s a genericsigner for single-section deb822 files, similar to  signify/ minisign.\n  We believe that this solves the security nightmare that our OpenPGP integrationis while reducing complexity at the same time. Keys are much shorter, so thebundled sources file above will look much nicer.", "posttime": "2021-06-22 01:33:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "apt,文件", "title": "远离APT键 ", "title_en": "Migrating Away from Apt-Key", "transed": 1, "url": "https://blog.jak-linux.org/2021/06/20/migrating-away-apt-key/", "via": "", "real_tags": ["apt", "文件"]}, {"category": "", "categoryclass": "", "imagename": "5664594158b1328409ab99e08e869503.png", "infoid": 1067236, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步在2019年宣布计划在角角落中占有多数所有权。该交易未完成，直到墨西哥除外的第三季度，该墨西哥于2021年1月结束。这项最新协议，该协议已于6月18日达成并报告周一，将成为优步拥有全资附属公司的角落。\n 这笔交易表明，优步对交付的看涨尚未进行过度。与角角落作为全资子公司，优步可以备注其杂货交付方案，这项服务在大流行期间流行。优步开始提供杂货店，在去年夏天在加拿大横跨拉丁美洲，加拿大和美国的杂货店提供销售后的折扣价值26.5亿美元的交易后。优步面临着从杂货店零售商自己的僵硬竞争，其中许多人通过与Doordash或Chould Fleet这样的初创公司合作提供交付。\n  Cornershop，总部位于智利，于2015年由Oskar Hjertonsson，Daniel Undurraga和Juan Pablo Cuevas成立。该公司将其运营扩展到八个国家，上下美洲，包括智利，墨西哥，巴西，哥伦比亚，哥斯达黎加，秘鲁，美国和加拿大。该公司从投资者提供了3170万美元的资金，包括Accel和Jackson Square Ventures。\n 优步不是唯一的杂货服务，眼睛在角角落;该启动应该由沃尔玛获得2.25亿美元的协议，但最终通过墨西哥反垄断监管机构阻止了向前发展的交易。目前尚不清楚这笔交易是否会受到同样的风险。\n TechCrunch已达到Cornershop和Uber进行评论。如果他们回复，我们将更新故事。 ", "note_en": "Uber announced in 2019 plans to take a majority ownership in Cornershop. That transaction wasn’t completed until the third quarter of 2020 other than in Mexico, which closed in January 2021. This latest agreement, which was reached June 18 and reported Monday, will make Cornershop a wholly owned subsidiary of Uber.\n The deal suggests Uber’s bullishness in delivery hasn’t waned. With Cornershop as wholly owned subsidiary, Uber can beef up its grocery delivery options, a service made popular during the pandemic. Uber started offering grocery delivery  in select cities across Latin America, Canada and the U.S. last summer after it acquired Postmates in a deal valued at  $2.65 billion. Uber faces stiff competition from grocery retailers themselves, many of whom offer delivery through partnering with startups like DoorDash or Favor Fleet.\n  Cornershop, which is headquartered in Chile, was founded in 2015 by Oskar Hjertonsson, Daniel Undurraga and Juan Pablo Cuevas. The company expanded its operations to eight countries up and down the Americas, including Chile, Mexico, Brazil, Colombia, Costa Rica, Peru, the U.S. and Canada. The company raised  $31.7 million over four rounds of funding from investors that include Accel and Jackson Square Ventures.\n Uber wasn’t the only grocery service with its eyes on Cornershop; the startup was supposed to be acquired by Walmart in a $225 million deal, but it ultimately fell through after Mexican anti-trust regulators blocked the deal from moving forward. It is unclear whether this deal will be subject to the same risks.\n TechCrunch has reached out to Cornershop and Uber for comment. We will update the story if they respond.", "posttime": "2021-06-22 00:56:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "成为,sole,优步", "title": "优步成为杂货店的唯一所有者的销售启动角落 ", "title_en": "\n\t\t\t\tUber to become the sole owner of grocery delivery startup Cornershop\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/21/uber-to-become-the-sole-owner-of-grocery-delivery-startup-cornershop/", "via": "", "real_tags": ["成为", "sole", "优步"]}, {"category": "", "categoryclass": "", "imagename": "1b519358da1eaeaecb2008f7a313ad67.png", "infoid": 1067235, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook的Clubhouse竞争对手，现场音频室，正在进行状态。该公司今天宣布，一些基于美国的公众数据以及某些团体，可以通过主Facebook iOS应用程序开始托管室。 （然而，允许的倾听者数量没有上限 - 俱乐部会所的主要镜头，这会限制房间尺寸限制。\n 它还引入了其他漂亮的功能，如通知当您的朋友或追随者加入房间以及Live Tablions时。将有一个“举手”按钮来请求加入对话，并可在整个聊天中进行交互。 Twitter Spaces，Twitter的Live Audio功能，包括标题，但俱乐部仍然没有。\n 在组中，管理员可以控制允许谁创建一个房间：主持人，团体成员或其他管理员。公共组合聊天将在本集团外部和外部访问，但私有组聊天将仅限于成员。此外，主机还可以选择非营利组织或租金，以便在与按钮进行对话期间支持，以直接捐赠聊天。同样，这感觉就像一个直接构建的功能，以解决关键的俱乐部用例并使其无摩擦。 （许多俱乐部创作者在应用程序上托管了筹款人，但必须将人们指向外面的联系，以便于捐款。）\n   此外，Facebook正在在平台上提供播客，确认早期的边缘报告。人们将能够通过迷你员或全屏播放器来侦听播客，其中包含各种播放控制，包括在屏幕关闭时侦听的能力。他们可以找到特定播客创造者的页面以及新闻源的节目，他们可以反应，评论，书签和分享他们的最爱。 Facebook团队表示计划在今年夏天晚些时候推出自动标题，以及侦听功能，侦听器可以创建和分享他们喜欢的剪辑。\n Spotify首次推出自己的现场音频应用程序，Greenthach后，所有这些功能都只有几天的时间;舞台渠道起来三个月起来;红德谈时四个月; Twitter发射空间后大约七个月;俱乐部首次发布后大约15个月。据报道，LinkedIn和Slack涉及他们自己的音频产品版本，即使下载和俱乐部本身周围的嗡嗡声已经过分衰落。\n   与俱乐部不同意，通过给予他们对硅谷热门镜头的听觉访问，Facebook希望将更广泛的影响者施放了一个带有现场音频室的更广泛。在发布会上有权访问该功能的名称公众人物中将成为音乐家（Tokimonsta，D Smoke，Kehlani）;媒体数字（Joe Budden，Deray McKesson）;和运动员（Russell Wilson，Omareloff）。 Joe Budden还将通过Facebook分发他的播客。\n 音频室可能是或可能不是真正的持续力量的功能，但Facebook似乎意图在广泛投资。 ", "note_en": "Facebook’s Clubhouse competitor,  Live Audio Rooms, is making its way stateside. The company announced today that some US-based public figures, as well as certain groups, can start hosting rooms through the main Facebook iOS app. (People can join, however, from both iOS and Android.) Anyone can be invited up as a speaker with up to 50 people able to speak at once. There’s no cap on the number of listeners allowed in — a major shot at Clubhouse, which imposes room size limitations.\n It’s also introducing other nifty features, like notifications when your friends or followers join a room, as well as live captions. There will be a “raise a hand” button to request to join the conversation, and reactions will be available to to interact throughout the chat. Twitter Spaces, Twitter’s live audio feature, includes captions, but Clubhouse still does not.\n Within groups, admins can control who’s allowed to create a room: moderators, group members, or other admins. Public group chats will be accessible both in and outside the group, but private group chats will be restricted to members. Additionally, hosts can also select a nonprofit or fundraiser to support during their conversation with a button to directly donate showing up on the chat. Again, this feels like a feature directly built to address a key Clubhouse use case and make it frictionless. (Many Clubhouse creators have hosted fundraisers on the app but have to direct people to outside links in order to facilitate donations.)\n   Additionally, Facebook is making podcasts available on the platform, confirming earlier   Verge reporting. People will be able to listen to podcasts through either a mini-player or a full-screen player with various playback controls, including the ability to listen while the screen is off. They’ll be able to find shows on specific podcast creators’ Pages, as well as in the News Feed, and they can react to, comment, bookmark, and share their favorites. The Facebook team says it plans to roll out automatic captioning later this summer, as well as a clips feature where listeners can create and share their favorite clips.\n All these features come  just days after Spotify debuted its own live audio app, Greenroom;  three months since Stage Channels came to Discord;  four months after Reddit Talk; roughly  seven months after Twitter launched Spaces; and about 15 months after Clubhouse first launched.  LinkedIn and  Slack are, reportedly, working on their own versions of an audio product, even as  downloads of and  buzz around Clubhouse itself have waned considerably.\n   Unlike Clubhouse, which drew in early listeners by giving them auditory access to Silicon Valley hot shots, Facebook is hoping to cast a broader net of influencers with Live Audio Rooms. Among the named public figures who will have access to the feature on launch will be musicians (TOKiMONSTA, D Smoke, Kehlani); media figures (Joe Budden, DeRay Mckesson); and athletes (Russell Wilson, Omareloff). Joe Budden will also distribute his podcast through Facebook.\n Audio rooms may or may not be a feature with real staying power, but Facebook seems intent on investing broadly in the space.", "posttime": "2021-06-22 00:50:26", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,推出,launches,功能", "title": "Facebook推出其俱乐部克隆 ", "title_en": "Facebook Launches Its Clubhouse Clone", "transed": 1, "url": "https://www.theverge.com/2021/6/21/22540508/facebook-live-audio-rooms-clubhouse-rival-spaces-greenhouse", "via": "", "real_tags": ["facebook", "推出", "launches", "功能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1067234, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个想法：只要你的CI从主分支构建代码，请不要抛弃构建结果：改为发布。这使得QA工程师或错误记者提供新的构建来易于尝试。\n  我第一次在工作中经历了这个设置，我们使用Jenkins。 Jenkins不是我首选的CI系统，而是为了获得信用，它使其超级易于实现此功能：添加步骤来归档工件，或者使用ArchiveARtifacts Pipeline命令。\n 我们实际上为所有在工作中的构建执行此操作，不仅是主分支构建。它使我们的QA工程师的生活更容易。我们的工作流程如下所示：\n 当开发人员考虑它准备QA时，QA工程师下载PR构建生成的工件并使用它们来验证工作。\n  我认为将类似于我自己的项目的东西是一个很好的想法，这些项目在Github上托管并使用Gi​​tHub CI。\n 我预计这样的功能可以随时可用，但我找不到我想要的东西。 GitHub提供了一种从建筑物中下载文物的方法，但它并不理想：\n 伪像在一个大的zip中捆绑在一起，在构建多平台应用时，这是不方便的：没有人想要下载一个包含相同应用程序的acos，windows和linux应用程序。 \n一些项目使用标签来生产主分支构建，但我不喜欢这个想法。叫我一个纯票，但是使用标签，这种方式感觉像对概念来补偿丢失的github功能。\n 由于我托管vps上的博客，我最终做了什么正在vps上建立一个子域（builds.agateau.com），并将github上传到我的服务器上的ssh。\n  我设置的第一件事是HTTP服务器提供文件。在我的注册商上添加子域后，我在我的vps上创建了一个目录，并配置了nginx，以便访问＆＃34; builds.agateau.com＆＃34;可以使用nginx花式索引模块浏览和下载此目录的内容。\n   然后我在vps上创建了一个构建用户，在/srv/builds.agateau.com/html中创建了一个目录，并使构建用户成为这些目录的所有者，以便它可以写入它们。\n 最后，我为此用户创建了一个SSH键，以便GitHub Builder可以连接到它。\n  我研究了SSH上传的现有GitHub操作，但它只对SCP呼叫感到过度矫枉过正。相反，我决定保持简单：我的构建将调用shell脚本来进行上传。无论如何，我更喜欢将依赖关系保持在最小，这使得在本地测试构建脚本，而不是使用Commit-Push-and-and-34;工作流程＆＃34;\n  ＃！/ bin / bash set -euo pipefail progname = $（basename $ 0）die（）{echo＆＃34; $ progname：$ *＆＃34; ＆gt; ＆amp; 2出口1}＃检查$ 1是定义的，而不是emptycheck_var（）{local name = $ 1如果！ env | Grep -Q＆＃34; ^ $名称= .. *＆＃34; ;然后死亡＆＃34;环境变量$名称未设置或为空＆＃34; fi}用法（）{如果[＆＃34; $ *＆＃34; ！！ =＆＃34;＆＃34; ];然后回声＆＃34;错误：$ *＆＃34;回声FI猫＆lt;＆lt; EOF使用率：$ progname [选项...]＆lt; project＆gt; ＆lt; build_file＆gt; [build_file ...]上载使用scp构建一个器件到服务器。文件是上载到构建/＆lt; project＆gt; /。期望设置以下环境变量： -  Upload_Username  -  Upload_Private_Key  -  Upload_Hostname选项：-h，--help显示此用法消息和退出EOF Exit 1} Project =＆＃34;＆＃34;＆＃34; build_files =＆＃34;＆＃34;虽然[$＃-gt 0];案例＆＃34; 1美元＆＃34;在-h |  -  help）使用; -  *）使用＆＃34;未知选项＆＃39; $ 1＆＃39;＆＃34; ;; *）如果[-Z＆＃34; $项目＆＃34; ];然后项目=＆＃34; 1美元＆＃34; else build_files =＆＃34; $ build_files $ 1＆＃34; fi ;;如果[-z＆＃34; $ build_files＆＃34; ];然后用法＆＃34;没有足够的争论＆＃34; ficheck_var upload_usernamecheck_var upload_private_keycheck_var upload_hostname echo＆＃34;上传＆＃34; eval $（SSH-代理）回声＆＃34; $ upload_private_key＆＃34; | ssh-add -scp -o＆＃34; stricthostkeychecking＆＃34; $ build_files＆＃34; $ upload_username @ $ upload_hostname：builds / $ project /＆＃34; \n不可否认，它＆＃39;对于简单的SCP呼叫有点久，但是，它是因为我更喜欢至少添加至少一定量的doc，参数解析和处理到此类脚本。我发现它有助于在6个月后重新审视它们时（我前段时间在我的shell脚本模板中写道，如果您有兴趣）。\n 此脚本获取项目的名称，该项目与服务器上创建的目录匹配，以及上传文件。通过环境变量提供敏感信息（用户名，主机名和私钥）。\n 注意：我不得不禁用主机键检查（-o＆＃34; stricthostkeychecking＆＃34; scp调用中的选项），因为我无法弄清楚如何将主机键作为参数或环境变量传递。我相信这种情况，它赢得了＆＃39; t太糟糕了，可能发生的情况是，有人管理窃取帐户公钥并上传到他们的服务器而不是我的服务器。仍然是我喜欢能够通过主机键。如果你知道如何做到这一点，我很乐意收到你的来信！\n  我连接到项目github管理页面，并将用户名，主机名和私钥声明为github加密的秘密。\n 现在所做的一切都是从Github构建工作流程调用上传构建脚本。\n 以下是Git Bonsai构建工作流程，显示如何在每个推送到主分支后调用上传 - 构建。\n 名称：版本：[推，pull_request]作业：构建：策略：Fail-Fast：False Matrix：OS： -  Ubuntu-18.04  -  MacOS-10.15  -  Windows-2019 runs-on：$ {{romix.oS}}默认值：shell：bash步骤： - 用途：操作/ [电子邮件保护]  - 名称：build运行：ci / build-app  - 名称：运行静态检查运行：ci / run-static-checks  -  name：运行测试运行： CI / Run-Tests  - 名称：Create Archive Run：CI / Create-Archive  - 名称：上传IF：GitHub.ref ==＆＃39; refs / heads / master＆＃39;运行：CI / Upload-Build Git-Bonsai Artifacts / *。BZ2 ENV：Upload_Username：$ {{secrets.upload_eusername}} upload_private_key：$ {{secrets.upload_private_key}} upload_hostname：$ {{secrets.upload_hostname}} \n服务器端需要最后一件事：为确保服务器磁盘没有充满构建，并且构建列表页面不会变得太长，我添加了一个清理脚本，以保持每个项目的最新30个构建。此脚本每天都运行。\n 在这里，它再次它＆＃39;因为参数解析而比人们所期望的时间长一点：\n ＃！/ bin / bash set -euo pipefail progname = $（basename $ 0）root_dir = / srv / builds.agateau.com / html max_builds = 30＃verbose命令默认cmd =＆＃34; rm -v＆＃34; quiet_cmd =＆＃34; rm＆＃34; dry_run_cmd =＆＃34;回声将删除＆＃34; clean_project_dir（）{local project_dir =＆＃34; 1美元＆＃34; ls  -  ssort time --reverse＆＃34; $ project_dir＆＃34; \\ | awk＆＃39; nr＆gt; ＆＃39; $ max_builds＆＃39; {打印$ 1}＆＃39; \\ |虽然读名称为$ cmd＆＃34; $ project_dir / $ name＆＃34;完成}用法（）{如果[＆＃34; $ *＆＃34; ！！ =＆＃34;＆＃34; ];然后回声＆＃34;错误：$ *＆＃34;回声FI猫＆lt;＆lt; EOF使用率：$ progname [选项...]删除旧构建工件。选项：-h，--help显示此用法消息和退出-q，--quiet工作静默 - 运行打印将被删除，而不是删除任何EOF退出1}而[$＃-gt 0];案例＆＃34; 1美元＆＃34;在-h |  -  help）使用; -q | --quiet）cmd =＆＃34; $ quiet_cmd＆＃34;转移  ;; - 运行）cmd =＆＃34; $ dry_run_cmd＆＃34;转移  ;; -  *）使用＆＃34;未知选项＆＃39; $ 1＆＃39;＆＃34; ;; *）使用＆＃34;太多争论＆＃34; ;;在$ root_dir / * /中为project_dir完成esac; do clean_project_dir＆＃34; $ project_dir＆＃34;完毕\n  要使构建网站看起来有点漂亮，我配置了花式索引模块来使用平面主题。我还在降序订单中制作了它列表构建，以便最新版本始终位于页面的顶部。\n 它，你可以看看它：https://builds.agateau.com/。现在只有两个项目，我计划将来增加更多。\n  我很高兴我花了一些时间设置这个神器上传系统，因为它已经证明了让错误记者在报告问题后确认修复。让我知道这是否对您有用，或者您是否知道发布构建工件的更简单的解决方案。 ", "note_en": "The idea: whenever your CI builds the code from your main branch, do not ditch the build results: publish them instead. This makes it easy to provide QA engineers or bug reporters with new builds to try.\n  I first experienced this setup at work, where we use Jenkins. Jenkins is  not my preferred CI system, but to its credit, it makes it super easy to implement this feature: add a step to archive artifacts, either using the GUI or using the  archiveArtifacts pipeline command.\n We actually do this for all builds at work, not only master branch builds. It makes the life of our QA engineers much easier. Our workflow looks like this:\n when developers consider it ready to QA, QA engineers download the artifacts produced by the PR build and use them to validate the work.\n  I thought it would be a good idea to setup something similar for my own projects, which are hosted on GitHub and use GitHub CI.\n I expected a feature like this to be readily available, but I could not find exactly what I wanted. GitHub provides a way to download artifacts from a build but it&#39;s not ideal:\n Artifacts are all bundled together in a big zip, which is inconvenient when building multi-platform apps: no-one wants to download a single archive containing the same application for macOS, Windows and Linux.\n Some projects use tags to produce main branch builds, but I don&#39;t like this idea. Call me a purist, but using tags that way feels like subverting the concept to compensate for a missing GitHub feature.\n Since I host my blog on a VPS, what I ended up doing is setting up a subdomain for builds on the VPS ( builds.agateau.com) and making GitHub upload artifacts to my server over SSH.\n  The first thing I set up was the HTTP server to serve the files. After adding the subdomain on my registrar, I created a directory on my VPS and configured Nginx so that users visiting &#34;builds.agateau.com&#34; would be able to browse and download the content of this directory, using the  Nginx Fancy Index module.\n   I then created a  build user on the VPS, created one directory per project in  /srv/builds.agateau.com/html and made the  build user the owner of these directories so that it can write to them.\n Finally I created an SSH key for this user, so that the GitHub builder can connect to it.\n  I looked into existing GitHub actions for SSH uploads but it all felt overkill for just an  scp call. Instead I decided to keep it simple: my build is going to call a shell script to do the upload. I prefer keeping dependencies with the CI to a minimum anyway, it makes it easier to test build scripts locally instead of using the commit-push-and-pray &#34;workflow&#34;.\n  #!/bin/bash set -euo pipefail PROGNAME = $(basename  $0 )die ()  {  echo  &#34; $PROGNAME :  $* &#34; &gt; &amp; 2  exit  1 } # Check $1 is defined and not emptycheck_var ()  {  local  name = $1  if ! env  | grep -q  &#34;^ $name =..*&#34;  ;  then die  &#34;Environment variable  $name  is not set or is empty&#34;  fi }usage ()  {  if  [  &#34; $* &#34; ! =  &#34;&#34;  ]  ;  then  echo  &#34;Error:  $* &#34;  echo  fi cat  &lt;&lt; EOF Usage: $PROGNAME [OPTION ...] &lt;project&gt; &lt;build_file&gt; [build_file...] Uploads build artifacts to a server using scp. Files are upload to builds/&lt;project&gt;/. Expects the following environment variables to be set: - UPLOAD_USERNAME - UPLOAD_PRIVATE_KEY - UPLOAD_HOSTNAME Options:  -h, --help display this usage message and exit EOF  exit  1 } project = &#34;&#34; build_files = &#34;&#34; while  [  $# -gt  0  ]  ;  do  case  &#34; $1 &#34; in -h |--help ) usage  ;; -* ) usage  &#34;Unknown option &#39; $1 &#39;&#34;  ;; * )  if  [ -z  &#34; $project &#34;  ]  ;  then  project = &#34; $1 &#34;  else  build_files = &#34; $build_files   $1 &#34;  fi  ;;  esac  shift done if  [ -z  &#34; $build_files &#34;  ]  ;  then usage  &#34;Not enough arguments&#34; ficheck_var UPLOAD_USERNAMEcheck_var UPLOAD_PRIVATE_KEYcheck_var UPLOAD_HOSTNAME echo  &#34;Uploading&#34; eval  $(ssh-agent ) echo  &#34; $UPLOAD_PRIVATE_KEY &#34;  | ssh-add -scp -o  &#34;StrictHostKeyChecking off&#34;  $build_files  &#34; $UPLOAD_USERNAME @ $UPLOAD_HOSTNAME :builds/ $project /&#34;\n Admittedly, it&#39;s a bit long for a simple  scp call, but that&#39;s because I prefer adding at least a minimum amount of doc, argument parsing and error handling to such scripts. I find that it helps when revisiting them 6 months later (I wrote about my  shell script template some time ago if you are interested).\n This script takes the name of the project, which matches the directory created on the server for it, and the files to upload. Sensitive information (username, host name and private key) is provided through environment variables.\n Note: I had to disable host-key checking (the  -o &#34;StrictHostKeyChecking off&#34; option in the  scp call) because I could not figure out how to pass the host key as an argument or environment variable. I believe in that case it won&#39;t be too bad, the worse that could happen is someone managing to steal the account public key and uploading builds to their server instead of mine. Still I&#39;d prefer to be able to pass the host key. If you know how to do this, I would love to hear from you!\n  I connected to the project GitHub admin page and declared the username, host name and private keys as  GitHub encrypted secrets.\n Now all that was left to do was to call the  upload-build script from the GitHub build workflow.\n Here is  Git Bonsai build workflow, showing how to call  upload-build after each push to the master branch.\n name :  Build on :  [ push ,  pull_request ] jobs :  build :  strategy :  fail-fast :  false  matrix :  os :  -  ubuntu-18.04  -  macos-10.15  -  windows-2019  runs-on :  ${{ matrix.os }}  defaults :  run :  shell :  bash  steps :  -  uses :  actions/ [email protected]  -  name :  Build  run :  ci/build-app  -  name :  Run static checks  run :  ci/run-static-checks  -  name :  Run tests  run :  ci/run-tests  -  name :  Create archive  run :  ci/create-archive  -  name :  Upload  if :  github.ref == &#39;refs/heads/master&#39;  run :  ci/upload-build git-bonsai artifacts/*.bz2  env :  UPLOAD_USERNAME :  ${{ secrets.UPLOAD_USERNAME }}  UPLOAD_PRIVATE_KEY :  ${{ secrets.UPLOAD_PRIVATE_KEY }}  UPLOAD_HOSTNAME :  ${{ secrets.UPLOAD_HOSTNAME }}\n  One last thing was required on the server side: to ensure the server disk does not get filled with builds and the build list page does not become too long to load, I added a cleanup script to keep only the latest 30 builds for each project. This script runs every day.\n Here it is, once again it&#39;s a bit longer than what one would expect because of argument parsing:\n #!/bin/bash set -euo pipefail PROGNAME = $(basename  $0 ) ROOT_DIR =/srv/builds.agateau.com/html MAX_BUILDS = 30 # Verbose command by default CMD = &#34;rm -v&#34; QUIET_CMD = &#34;rm&#34; DRY_RUN_CMD = &#34;echo Would delete &#34;clean_project_dir ()  {  local  project_dir = &#34; $1 &#34; ls --sort  time --reverse  &#34; $project_dir &#34;  \\  | awk  &#39;NR &gt; &#39; $MAX_BUILDS &#39; { print $1 }&#39;  \\  |  while  read name  do  $CMD  &#34; $project_dir / $name &#34;  done }usage ()  {  if  [  &#34; $* &#34; ! =  &#34;&#34;  ]  ;  then  echo  &#34;Error:  $* &#34;  echo  fi cat  &lt;&lt; EOF Usage: $PROGNAME [OPTION ...] Delete old builds artifacts. Options: -h, --help display this usage message and exit -q, --quiet work silently --dry-run print what would be deleted instead of deleting anything EOF  exit  1 } while  [  $# -gt  0  ]  ;  do  case  &#34; $1 &#34; in -h |--help ) usage  ;; -q |--quiet )  CMD = &#34; $QUIET_CMD &#34;  shift  ;; --dry-run )  CMD = &#34; $DRY_RUN_CMD &#34;  shift  ;; -* ) usage  &#34;Unknown option &#39; $1 &#39;&#34;  ;; * ) usage  &#34;Too many arguments&#34;  ;;  esac done for project_dir in  $ROOT_DIR/*/  ;  do clean_project_dir  &#34; $project_dir &#34; done\n  To make the builds site look a bit nicer, I configured the Fancy Index module to use the  Flat theme. I also made it list builds in descending date order, so that the latest builds are always at the top of the page.\n That&#39;s it, you can have a look at it here:  https://builds.agateau.com/. There are only two projects for now, I plan to add more in the future.\n  I am happy I spent some time setting up this artifact upload system as it has proved useful to let bug reporters confirm a fix after they reported an issue. Let me know if this was useful to you, or if you know of simpler solutions to publish build artifacts.", "posttime": "2021-06-22 00:49:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,publishing,构建", "title": "自动发布您的构建工件 ", "title_en": "Automatically publishing your build artifacts", "transed": 1, "url": "https://agateau.com/2021/automatically-publishing-your-build-artifacts/", "via": "", "real_tags": ["发布", "构建"]}, {"category": "", "categoryclass": "", "imagename": "8ba41e0b008abde46e41f5c9e01a86db.jpg", "infoid": 1067233, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是美国中世纪历史上的博士学生。我的讲话涉及美国的历史博士节目。如果你认为这是虚伪的，那就这样。\n 人文博士仍然是一个职业学位，为学生做好学科职业教学，而且没有工作。历史上没有博士学位。\n 看，我得到它。在Askhistorians的所有人中，我得到它。你不要＆＃39; t＆＃34;爱情历史;＆＃34;你喜欢你灵魂中的一切的历史，你读出你的子场外的历史书籍以获得乐趣，你花了90％的空闲时间试图让其他人尽可能多地爱历史，甚至四分之一甚至是一个季度只是想一想几分钟，你的一天是做出的。我得到它。\n 你有教授＆＃39; S告诉你你＆＃39;重复教学学院。你有一位向你保证你的教授＆＃39;重新出现并将成功。你有一个刚刚获得博士学位的朋友，并在加州大学洛杉矶分校工作。你不需要一个R1学校;你只是想教导你＆＃39; D与一个小的4年的自由艺术大学职位良好。\n 您＆＃39;在空气床垫上睡了四个或六个生存一年，并享受贫困卷饼，并工作三个兼职工作，以支付本科生。你＆＃39;再担心更多。哎呀，一个博士学位看起来像一个薪水。或者也许你有愿意介入的父母或祖父母，也许你没有从本科贷款偿还。\n 它并不重要。你不是例外。不要在历史或任何相关领域获得博士学位。\n 没有工作。历史就业市场于2008年坠毁，2011-12次恢复了一点......然后消失了。这是aha的图表。 300个全职工作，1200个新博士。加上前几年的所有人没有工作，并且具有比你更多的出版物。加上所有当前的捕鱼教授，他们拥有更多的出版物，连接和经验。减去不在您领域的所有工作。减去用于在其他地方有权的高级教授专门的所有工作。你的模糊子场不会拯救你。博物馆工作可能更具竞争力，您不会有经验或技能。没有工作。 \n因此，您的工作选项是垃圾。兼容工作是不可行的薪酬，没有福利，可再生但不能保证，并且即使涉及更高的课程课程，也消失了。 ＆＃34; postdocs＆＃34;有一个任期赛道工作的所有责任为一半的工资（如果你＆＃39;幸运的话），可能没有好处，哦，是的，你可以在1  -  3年内再次寻找工作。世界的某个地方。这是一个真正的职位广告。事实上，您的工作选择垃圾。\n ＆＃39;对女性更糟糕。因素包括：学生对浪潮更高度的男性教授更高。妇女正在社交劳动，致力于情绪劳动和＆＃34;请注意没有其他人正在做的任务＆＃34;并这样做，因为他们必须要完成。女性使用产假成为母亲;父亲使用亲子休假进行研究。疯狂的性骚扰率，包括毕业生和eni管理员，积极保护男性教授。每个阶梯的女性教师跌落的百分比是由于所有这些因素所屈服的职业阶梯。我不知道对颜色或妇女的颜色或妇女的男性（或其他性别教师）的研究，但我想象它并不是任何人的好照片。\n  历史注册正在崩溃，因为学生在高中担任历史要求（如果甚至仍然是一个）作为GPA提升，更强大的大学应用程序的AP /双重入学，并释放（美国）UNI的课堂选项。\n 学校没有取代退休教师。他们将任职线转换为辅助点，或者更常见，只需要现有的教师教授更多课程。\n 更老的教师可以＆＃39;不起，或者不想要。甚至被问及他们是否计划退休，甚至被问及更老的教师，即使它们是否无法进行教学课程。\n 历史博士不会让你对其他工作更具吸引力。您将具有惊人的软技能，但公司希望硬盘。不止于此，他们想要直接经验，你不会有。博士可能让你回归和＃34;过度资格，＆＃34;或者自动取消资格，因为公司/学区规则需要更高的PHDS薪水。\n 在学术界的其他工作？老实说，你是否认为其他1200个新博士赢得了育空中间的研究图书馆队？你真的觉得他们中的一些人赢得了＆＃39; t有mlis学位，并花了他们的博士时间得到特殊的收藏体验吗？你想在一份工作中规划你的博士，每年可能有一个开放吗？哦！或者您可以在学术管理中工作，并尽可能喜欢帮助当前的毕业生犯有你的错误。 \n你不是例外。 50％的人文学生在获得博士之前辍学。 50％的博士学生承认遭受抑郁症，焦虑和其他心理健康问题（50％的博士学生撒谎）。学术界的人比跳伞者更多。辍学或留在，你＆＃39; LL已经花了1-10岁，没有建立工作经验，薪水，退休储蓄，永久居住，正常的时间表，爱好。父母或配偶独立富裕？极好;再次享受历史悠闲制作历史博士＆＃39;职业。\n 您的计划不是例外。美国和u.k的计划目前正在授权对学生进行额外资金的承诺。大学正在改变截止日期，将当前的学生推出门，没有足够的时间来完成他们需要的研究或获得他们的技能，他们需要任何类型的历史职业工作，甚至是他们想要不同的工作，方面的经验这份工作。\n 我叫这个论文＆＃34的粗略草案;博士博士将摧毁你的未来，吃你的孩子。＆＃34;不，这不是要翻转的东西。历史上没有博士学位。\n ...但我也得到它，我知道对你们中的一些人来说，绝对没有我或任何人都可以说阻止你做出巨大糟糕的决定。而且我知道那个小组中的一些人来自本科学校，也许没有＆＃39; T有别人的声望，或者了解申请毕业生学校并获得它的教授。所以在评论中，我给出了我希望的建议，我希望我不会使用。\n 这杀了我写作。我喜欢历史。我花了我的空闲时间谈论Reddit的历史。我可以通过我找到大量的旧帖子说历史博士的所有原因都很好。不。它没有。你不是例外。您的计划不是例外。不要在人文科学中获得博士学位。 ", "note_en": "I am a PhD student in medieval history in the U.S. My remarks concern History PhD programs in the U.S. If you think this is hypocritical, so be it.\n The humanities PhD is still a vocational degree to prepare students for a career teaching in academia, and there are no jobs. Do not get a PhD in history.\n Look, I get it. Of all the people on AskHistorians,  I get it. You don&#39;t &#34;love history;&#34; you love history with everything in your soul and you read history books outside your subfield for fun and you spend 90% of your free time trying to get other people to love history as much as you do, or even a quarter as much, or even just think about it for a few minutes and your day is made. I get it.\n You have a professor who&#39;s told you you&#39;re perfect to teach college. You have a professor who has assured you you&#39;re the exception and will succeed. You have a friend who just got their PhD and has a tenure track job at UCLA. You don&#39;t need an R1 school; you just want to teach so you&#39;d be fine with a small, 4-year liberal arts college position.\n You&#39;ve spent four or six subsistence-level years sleeping on an air mattress and eating poverty burritos and working three part-time jobs to pay for undergrad. You&#39;re not worried about more. Heck, a PhD stipend looks like a pay  raise. Or maybe you have parents or grandparents willing to step in, maybe you have no loans from undergrad to pay back.\n It doesn&#39;t matter.  You are not the exception. Do not get a PhD in history or any of the allied fields.\n There are no jobs. The history job market crashed in 2008, recovered a bit in 2011-12...and then disappeared.  Here is the graph from the AHA. 300 full-time jobs, 1200 new PhDs. Plus all the people from previous years without jobs and with more publications than you. Plus all the current profs in crappy jobs who have more publications, connections, and experience than you. Minus all the jobs not in your field. Minus all the jobs earmarked for senior professors who already have tenure elsewhere. Your obscure subfield will not save you. Museum work is probably more competitive and you will not have the experience or skills. There are no jobs.\n Your job options, as such, are garbage. Adjunct jobs are unliveable pay, no benefits, renewable but not guaranteed, and *disappearing even though a higher percentage of courses are taught by adjuncts. &#34;Postdocs&#34; have all the responsibilities of a tenure track job for half the pay (if you&#39;re lucky), possibly no benefits, and oh yeah, you get to look for jobs all over again in 1-3 years. Somewhere in the world.  This is a real job ad. Your job options are, in fact, garbage.\n It&#39;s worse for women. Factors include: students rate male professors more highly on teaching evals. Women are socialized to take on emotional labor and to &#34;notice the tasks that no one else is doing&#34; and do them because they have to be done. Women use maternity leave to be mothers; fathers use paternity leave to do research. Insane rates of sexual harassment, including of grad students, and uni admins that actively protect male professors. The percentage of female faculty drops for each step up the career ladder you go due to all these factors. I am not aware of research for men of color or women of color (or other-gender faculty at all), but I imagine it&#39;s not a good picture for anyone.\n  History enrollments are crashing because students take their history requirement (if there even still is one) in high school as AP/dual enrollment for the GPA boost, stronger college app, and to free up class options at (U.S.) uni.\n Schools are not replacing retiring faculty. They convert tenure lines to adjunct spots, or more commonly now, just require current faculty to teach more classes.\n Older faculty can&#39;t afford to retire, or don&#39;t want to. Tenure protects older faculty from even being asked if they plan to retire, even if they are incapable of teaching classes anymore.\n A history PhD will not make you more attractive for other jobs. You will have amazing soft skills, but companies want hard ones. More than that, they want direct experience, which you will not have. A PhD might set you back as &#34;overqualified,&#34; or automatically disqualified because corporate/school district rules require a higher salary for PhDs.\n Other jobs in academia? Do you honestly think that those other 1200 new PhDs won&#39;t apply for the research librarianship in the middle of the Yukon? Do you really think some of them won&#39;t have MLIS degrees, and have spent their PhD time getting special collections experience? Do you want to plan your PhD around a job for which there might be one opening per year? Oh! Or you could work in academic administration, and do things like help current grad students make the same mistakes you did.\n You are not the exception. 50% of humanities students drop out before getting their PhD. 50% of PhD students admit to struggling with depression, anxiety, and other mental health issues (and 50% of PhD students are lying). People in academia drink more than  skydivers. Drop out or stay in, you&#39;ll have spent 1-10 years not building job experience, salary, retirement savings, a permanent residence, a normal schedule, hobbies. Independently wealthy due to parents or spouse? Fabulous; have fun making history the  gentlemen&#39;s profession again.\n Your program is not the exception. Programs in the U.S. and U.K. are currently reneging on promises of additional funding to students  in progress on their dissertations. Universities are changing deadlines to push current students out the door without adequate time to do the research they need or acquire the skills they&#39;d need for any kind of historical profession job or even if they want a different job, the side experience for that job.\n I called the rough draft of this essay &#34;A history PhD will destroy your future and eat your children.&#34; No. This is not something to be flip about.  Do not get a PhD in history.\n ...But I also  get it, and I know that for some of you, there is absolutely nothing I or anyone else can say to stop you from making a colossally bad decision. And I know that some of you in that group are coming from undergrad schools that maybe don&#39;t have the prestige of others, or professors who understand what it takes to apply to grad school and get it. So in comments, I&#39;m giving advice that I hope with everything I am you will not use.\n This is killing me to write. I love history. I spend my free time  talking about history on reddit. You can find plenty of older posts by me saying all the reasons a history PhD is fine. No. It&#39;s not.  You are not the exception. Your program is not the exception. Do not get a PhD in the humanities.", "posttime": "2021-06-22 00:49:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "得到,history", "title": "为什么你不应该得到历史博士 ", "title_en": "Why You Should Not Get a History PhD", "transed": 1, "url": "https://www.reddit.com/r/AskHistorians/comments/96yf9h/monday_methods_why_you_should_not_get_a_history/", "via": "", "real_tags": ["得到", "history"]}, {"category": "", "categoryclass": "", "imagename": "b4b7da2550a930d7606ecf78ec405dfa.jpeg", "infoid": 1067232, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过一年加上冠状病毒引起的压力和无聊，许多美国人渴望再次旅行。\n 期待夏季旅行中的繁荣，Amtrak在旅行者中兴起了美国铁路通行证的重新启动。 Amtrak上周推出的票，让人们花一个月在Amtrak火车上花费了一个固定费用。\n 到6月22日，通行证是299美元，其通常价格为499美元。它不允许无限制的火车旅行 -  299美元超过30天内覆盖10个铁路段。\n 根据Amtrak的说法，当乘客离开火车时，一段旅行结束，所以一个连接的旅行将使用两个段，但是一个长期的骑行将只是一个段。 Amtrak＆＃39;最长的直接路线 - 就像芝加哥到圣安东尼奥 - 拉伸超过1000英里。\n      美国铁路通行者只适用于教练席位，并没有让乘客预订睡眠客舱或一流席位等高级住宿。鉴于一段可能花费数百美元，通用折价仍然是30美元的一段，提供了大量折扣。\n 例如，来自纽约到新奥尔良的1,377英里新月线上的一张往返机票可以越来越靠近500美元。美国铁路通行证将在那次独自旅行之后为自己付出代价。\n 买家在购买它后，使用美国铁路通过预订旅行120天，所以6月22日的折扣通行证将在10月下旬到期。他们有30天从他们第一次旅行时使用10个细分。 \n点击“注册”，您同意从Insider以及其他合作伙伴提供的营销电子邮件以及接受我们的服务条款和隐私政策。  形成一个＆＃39的两个交叉线; x＆＃39; 它表示封闭互动或解雇通知的方法。 ", "note_en": "After a year-plus of coronavirus-induced stress and boredom, many Americans are eager to travel again.\n Expecting a boom in summer travel, Amtrak is luring in travelers with the relaunch of its USA Rail Pass. The ticket, which Amtrak launched last week, allows people to spend a month crisscrossing the country on Amtrak trains for a flat fee.\n Through June 22, the pass is $299, 40% off its usual price of $499. It doesn&#39;t allow for unlimited train travel — the $299 covers 10 rail segments over 30 days.\n According to Amtrak, a segment of a trip ends when a passenger gets off a train, so a trip with one connection would use two segments, but one long ride would be only one segment. Amtrak&#39;s longest direct routes — like Chicago to San Antonio — stretch more than 1,000 miles.\n      The USA Rail Pass is good for only coach seats and doesn&#39;t let passengers book premium accommodations like sleeper cabins or first-class seats. Still, at $30 a segment, the pass offers massive discounts, given that one segment can cost hundreds of dollars.\n For instance, one round-trip ticket on the 1,377-mile Crescent line from New York to New Orleans can run you close to $500. The USA Rail Pass would pay for itself after that trip alone.\n Buyers have 120 days to book trips using their USA Rail Pass after purchasing it, so a discounted pass bought by June 22 would be good through late October. They have 30 days from the day of their first trip to use up the 10 segments.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.\n          Two crossed lines that form an &#39;X&#39;. It indicates a way to close an interaction, or dismiss a notification.", "posttime": "2021-06-22 00:48:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,relaunches,旅行", "title": "Amtrak Relaunches美国铁路通行证 - 以299美元的价格旅行30天 ", "title_en": "Amtrak relaunches US Rail Pass – Travel the country for 30 days for $299", "transed": 1, "url": "https://www.businessinsider.com/amtrak-usa-rail-pass-discount-price-summer-travel-2021-6", "via": "", "real_tags": ["美国", "旅行"]}, {"category": "", "categoryclass": "", "imagename": "383a08b76ec2ee0372aa0e9086867d79.jpeg", "infoid": 1067231, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法院举行了一致的胜利，我在斗争中对阵NCAA的斗争中，它试图施加与教育有关的赔偿。\n 颁布的法官9-0确认降低法院裁决，阻止NCAA限制对运动员等物品的款项或对实习的赔偿金额限制。\n 最高法院周一举行一致的胜利，我将在他们对斗争的斗争中举行大学运动员，并试图施加与教育有关的赔偿。\n 法院投票9-0肯定了较低的法院裁决，发现反托拉斯法阻止了NCAA限制了乐器等物品的运动员的款项或作为实习的赔偿。这位司法官拒绝了NCAA＆＃39;它的参仇，它的球员＆＃39;如果他们可以获得薪酬，业余情况是不可能维持的，即使是有关的教育相关的费用。\n  ＆＃34;简单地说，这套套装涉及在被告行使垄断控制的市场中承认水平价格修复，＆＃34;尼尔·戈斯鲁奇的正义为法庭写道。\n 保守的司法是前总统唐纳德特朗普的被任命的人写道，它是＆＃34;目前不清楚NCAA寻求什么。＆＃34;\n ＆＃34;在某种程度上提出从谢尔曼的条款提出一种司法宣传的豁免权，因为他们应该忽视其限制，因为他们恰好在高等教育，体育运动的交叉口下降和金钱 - 我们不能同意，＆＃34;戈斯鲁奇写道。 \n结果在三月份口头争论后大部分预期。该决定维护了联邦地区法院的禁令，禁止NCAA限制＆＃34;与教育有关的赔偿和福利。＆＃34;早些时候上诉的第9届美国赛道法院批准了禁令。\n 在允许禁令时，戈斯鲁奇写道，NCAA可以询问立法者为它造成一个例外。\n  ＆＃34; NCAA可以自由地争辩，＆＃39;因为[其]特定行业的特点，＆＃39;它应该免于豁免反托拉斯法的惯常行动 - 但那些上诉是＆＃39;适当地发给国会，＆＃39;＆＃34;戈斯鲁奇写道。\n ＆＃34;国会也不对此类请求不敏感。它已经修改了过去某些行业的反托拉斯法律，未来可能会再次这样做，＆＃34;戈斯鲁奇写道。 ＆＃34;但直到国会所说，唯一一项要求我们向我们执行执行的法律是谢尔曼法案，该法律是独自一人的假设追求的 - ＆＃39;竞争是分配资源的最佳方法＆＃39;在国家和＃39;＆＃34;\n 案件最初是由Shawne Alston，前西弗吉尼亚州跑回和其他学生运动员带来的。争议，被称为国家大学运动股份有限公司。 v。阿尔斯顿，第20-512号，与NCAA规则的持续争议分开，这些规则限制了运动员来播放或做出认可交易。\n 后一条规则尚未进入最高法院，法院＆＃39的意见没有权衡他们的合法性。\n 然而，特朗普委任者Brett Kavanaugh建议在星期一的舆论中建议，这些规则也可能争夺反托拉斯法的原因。他写了那个＆＃34; NCAA不是在法律上的上方;那个＆＃34; NCAA＆＃39;商业模式在美国几乎任何其他行业都会被违法行为。＆＃34; \n＆＃34;每个人都同意NCAA可以要求学生运动员才能享受良好的学生。 但NCAA＆＃39;使用无偿学生运动员在大学收入中产生数十亿美元的商业模式提出了在反托拉斯法律下的严重问题，＆＃34; kavanaugh写道。  他补充说，它是＆＃34; NCAA及其成员大学的高度可疑是合理的，而不是向学生运动员支付关于循环理论的收入的公平份额，即大学体育的定义特征是大学不支付学生运动员 。＆＃34;  ＆＃34;如果这种声称的理由是无知的，目前尚不清楚NCAA如何合法捍卫其剩余的赔偿规则，＆＃34; kavanaugh写道。 ", "note_en": "The court gave a unanimous win to Division I college athletes in their fight against the NCAA over caps it sought to impose on compensation related to education.\n The justices voted 9-0 to affirm lower court rulings that prevented the NCAA from restricting payments to athletes for items such as musical instruments or as compensation for internships.\n The Supreme Court handed a unanimous victory Monday to Division I college athletes in their fight against the National Collegiate Athletic Association over caps it sought to impose on compensation related to education.\n The court voted 9-0 to affirm lower court rulings that found that antitrust law prevented the NCAA from restricting payments to athletes for items such as musical instruments or as compensation for internships. The justices rejected the NCAA&#39;s argument that its players&#39; amateur status would be impossible to maintain if they could receive pay, even for education-related expenses.\n  &#34;Put simply, this suit involves admitted horizontal price fixing in a market where the defendants exercise monopoly control,&#34; Justice Neil Gorsuch wrote for the court.\n The conservative justice, an appointee of former President Donald Trump, wrote that it was &#34;unclear exactly what the NCAA seeks.&#34;\n &#34;To the extent it means to propose a sort of judicially ordained immunity from the terms of the Sherman Act for its restraints of trade — that we should overlook its restrictions because they happen to fall at the intersection of higher education, sports, and money — we cannot agree,&#34; Gorsuch wrote.\n The outcome was largely expected following  oral argument in March. The decision upheld an injunction imposed by a federal district court that barred the NCAA from limiting &#34;compensation and benefits related to education.&#34; The 9th U.S. Circuit Court of Appeals earlier approved of the injunction.\n In allowing the injunction, Gorsuch wrote that the NCAA can ask lawmakers to carve out an exception for it.\n  &#34;The NCAA is free to argue that, &#39;because of the special characteristics of [its] particular industry,&#39; it should be exempt from the usual operation of the antitrust laws — but that appeal is &#39;properly addressed to Congress,&#39;&#34; Gorsuch wrote.\n &#34;Nor has Congress been insensitive to such requests. It has modified the antitrust laws for certain industries in the past, and it may do so again in the future,&#34; Gorsuch wrote. &#34;But until Congress says otherwise, the only law it has asked us to enforce is the Sherman Act, and that law is predicated on one assumption alone — &#39;competition is the best method of allocating resources&#39; in the Nation&#39;s economy.&#34;\n The case was originally brought by Shawne Alston, a former West Virginia running back, and other student athletes. The dispute, known as National Collegiate Athletic Assn. v. Alston, No. 20-512, is separate from the ongoing controversy over NCAA rules that restrict athletes from being paid to play or for doing endorsement deals.\n The latter rules have not yet come before the Supreme Court, and the court&#39;s opinion did not weigh on their legality.\n However, Trump appointee Justice Brett Kavanaugh suggested in a blistering concurrence to Monday&#39;s opinion that those rules may also run afoul of antitrust law. He wrote that &#34;The NCAA is not above the law&#34; and that &#34;The NCAA&#39;s business model would be flatly illegal in almost any other industry in America.&#34;\n &#34;Everyone agrees that the NCAA can require student athletes to be enrolled students in good standing. But the NCAA&#39;s business model of using unpaid student athletes to generate billions of dollars in revenue for the colleges raises serious questions under the antitrust laws,&#34; Kavanaugh wrote.\n He added that it was &#34;highly questionable whether the NCAA and its member colleges can justify not paying student athletes a fair share of the revenues on the circular theory that the defining characteristic of college sports is that the colleges do not pay student athletes.&#34;\n &#34;And if that asserted justification is unavailing, it is not clear how the NCAA can legally defend its remaining compensation rules,&#34; Kavanaugh wrote.", "posttime": "2021-06-22 00:48:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大学,运动员,court,ncaa", "title": "与大学运动员赔偿争夺战的最高法院规则 ", "title_en": "Supreme Court rules against NCAA in compensation fight with college athletes", "transed": 1, "url": "https://www.cnbc.com/2021/06/21/supreme-court-rules-for-college-athletes-in-compensation-dispute-with-ncaa.html", "via": "", "real_tags": ["大学", "运动员", "court", "ncaa"]}, {"category": "", "categoryclass": "", "imagename": "ca8ad0f838b4667649a03e4b408028e5.png", "infoid": 1067229, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "又称预防性方法或预防行动，预防原则是一个最能求助的概念，这些概念由谚语“比抱歉更好的安全”或医疗马克西姆“首先没有伤害”。\n 虽然没有单一的定义，但它通常是指通过没有做任何可能产生负面后果的任何可能具有负面后果的伤害，即使这些后果的可能性是不确定的。\n 在这篇文章中，我们会看看预防原则的工作原理，其优势和缺点，使用它的最佳方式以及我们如何以自己的生活应用。\n  每当我们甚至在复杂系统内的最小变化时，我们都会风险巨大的意外后果。\n 系统内的互连和依赖性使得预测结果几乎不可能，并且看到他们经常需要合理精确的功能，我们的干预措施可能会造成严重破坏。\n 预防原则反映了在复杂系统内工作的现实。它将证明责任转移到证明事实后，在执行机会之前，证明这是安全的。它强调在冒险造成伤害之前等待更完整的信息，特别是如果一些可能的影响是不可逆转的，难以包含，或者会影响那些没有选择参与的人。\n 伤害的可能性不需要特定于特定情况;有时我们可以判断一系列行动，因为我们知道它具有出于意外后果的高风险。 \n例如，侵入性物种（造成伤害后造成伤害的植物或人类被人类引入的动物）反复导致原生物种变得灭绝。因此，在没有强有力的证据，行使预防措施并没有将生物引入新的地方，这是合理的。\n  最着名的用途作为环境法和公共卫生的监管准则，预防原则起源于德国术语“VorsorgePrinzip”，适用于防止空气污染的法规。欧洲环境政策研究所主任Konrad Von Moltke，后来将其转化为英语。\n 由于自然界是一个高度复杂的系统，我们一再严重扰乱，预防性的方式，预防原则已成为许多国家环境政策的指导部分。\n 例如，Umweltbundesamt（德国环境保护署）解释说，预防原则今天在德国环境法中有两个核心组成部分：防止风险和保护资源。\n 防止风险意味着立法者不应该采取行动，我们对环境损害潜力的了解是不完整或不确定的，但有令人关注的原因。证据负担是为了证明缺乏伤害，而不是在证明伤害。保护资源意味着在未来几代人可以使用的形式中保持水和土壤等东西。\n 为了举另一个例子，一些国家唤起了预防原则的版本，以证明禁止在遗传修饰的食物上 - 在某些情况下，在其他情况下，在其他情况下，在其安全的证据中被认为是强大的。它留给立法者来解释并在特定情况下解释和应用预防原则。\n 预防原理的灵活性是强度和弱点的根源。我们生活在一个快速移动的世界，监管并不总是跟上创新，意思是指导方针（而不是规则）通常可以证明是有用的。 \n预防原则可以是立法的实际补充的另一个原因是科学并不一定能够快速移动，以保护我们免受潜在的风险，尤其是在别的地方伤害或花费很长时间出现。例如，我们吃的食物中存在成千上万的人造物质，从给予牲畜的药物到包装中使用的材料。证明新的添加剂有一旦在食品供应中可能需要数十年的健康风险，因为它是难以置信的难以隔离致病因素。因此，一些监管机构（包括美国食品和药物管理局）要求制造商在市场上市之前证明某些东西是安全的。这种方法并不完美，但它比等待在我们开始吃东西后发现伤害更安全。\n 预防原则迫使我们对风险，不确定性，概率，政府作用的性质提出了许多难题。它还可以提示我们质疑我们在某些情况下围绕正确决定的直觉。\n  处理风险时，重要的是要意识到我们没有或无法知道的。预防原则并不是禁止禁止事物的扼杀理由 - 这是处理特定类型不确定性的工具。启发式可以指导我们做出重要的决定，但我们仍然需要灵活，并将每种情况视为独特。\n 那么我们应该如何使用预防原则？ Sven Ove Hansson建议在预防原则的极端有两种要求？首先，如果有竞争优先事项（超越避免伤害），它应该与其他决策原则相结合。例如，“探索与利用”的想法教导我们，我们需要在尝试新的选择上衡量现有选项。其次，决定采取预防措施的决定应基于最新的科学，如果科学改变，应该有如何更新该决定的计划。这包括规划频率如何重估证据以及如何评估其质量。\n 使用预防原理是一个好主意吗？有几种类型的情况，最好是安全而不是抱歉，如果事情不确定。\n 当等待的成本低时。正如我们已经看到的那样，预防原则旨在作为处理不确定性的工具，而不是任意禁令的理由。这意味着如果某些东西的安全性是不确定的，但等待学到更多的成本很低，那么使用预防措施是一个好主意。\n 当保留术语是优先级的。预防原则最常被唤起，因为潜在的风险会导致不可逆转，达到的深远，无污染的伤害。看到我们不知道未来的未来，通过避免限制选择保持我们的选择，使我们以后的最大灵活性。预防原则通过确保我们没有限制我们在线或将来的自我留下的资源来限制我们提供的资源，为我们未来的自我清理。 \n当风险的潜在成本远远超过预防行动的成本。如果潜在的风险将是毁灭性甚至毁灭，并且可以保护它，预防行动是关键。有时候赢得刚刚停留在游戏中 - 有时候留在游戏中归结为不让任何东西擦掉。\n 例如，1963年，瑞士政府承诺在核袭击或灾难发生所有公民的堡垒空间。该国仍然保持成千上万的警告国家制度，并分配碘化钾片（用于减少辐射的影响），以便在发生事故时居住在核植物附近的人。鉴于事件发生在瑞士的潜在影响（无论是有多大程度），这些预防行动都被认为是值得的。\n 当替代品可用时。如果有替代行动课程，我们知道要安全，在采用新的风险之前，还可以等待更多信息。\n  作为使用预防原理的第三个标准，Sven Ove Hansson建议不要在潜在风险的可能性或规模过低时不用于预防行动，以有任何利益。例如，如果每年一个人死于对豚鼠咬伤的过敏反应，那么它可能不值得禁止宠物豚鼠。我们可以在一些情况下添加一些情况，在那里使用预防原则通常不是一个好主意。\n 当权衡很大并且已知时。预防原则的整个点是避免伤害。如果我们知道不采取行动会造成更多伤害，而不是采取可能的可能，使用预防措施并不是一个好主意。\n 例如，在福岛的2011年事故之后，日本关闭了所有核电站。看到核电比化石燃料便宜，这导致该国地区的电力价格急剧增加。根据本文的作者对预防原则谨慎，由于实际意外的死亡人口，从无法花费的人们的死亡率增加。\n 当风险是知名和定价的时候。我们都有不同的风险偏好程度，我们对某些活动是否值得涉及的风险进行判断。当风险定价时，这意味着人们意识到它并自愿决定它是值得的，甚至是可取的。 \n例如，风险较高的投资往往具有更高的潜在回报。虽然他们可能对不想冒险的人来说可能没有意义，但他们对那些考虑潜在损失的潜在损失的潜在收益来说是有意义的。\n 只有零风险选项会令人满意。完全避免风险是不可能的，因此在期望出现100％安全选项时，锻炼预防措施并没有太大。\n 冒险时可以加强我们。作为个人，我们有时会过度冒险厌恶，而且太谨慎 - 到它让我们脆弱的程度。如果他们过度反应而不是犯下的风险，我们的祖先具有最好的机会。但对于我们今天的许多人来说，我们面临的最大风险可能是由于令人担忧的危险而导致的压力。我们最终可以担心社会拒绝等风险，这是不可避免的，如果我们将它们置于不可避免的话，往往会使我们更强大。从来没有采取任何风险通常比采取明智的想法更糟糕。\n  我们每天都面临决定，涉及平衡风险。预防原则是一种帮助我们确定特定选择是否值得赌博的工具，或者我们需要紧紧收集更多信息。 ", "note_en": "Also known as the Precautionary Approach or Precautionary Action, the Precautionary Principle is a concept best summed up by the proverb “better safe than sorry” or the medical maxim to “first do no harm.”\n While there is no single definition, it typically refers to acting to prevent harm by not doing anything that could have negative consequences, even if the possibility of those consequences is uncertain.\n In this post, we’ll take a look at how the Precautionary Principle works, its strengths and drawbacks, the best way to use it, and how we can apply it in our own lives.\n  Whenever we make even the smallest change within a complex system, we risk dramatic unintended consequences.\n The interconnections and dependencies within systems make it almost impossible to predict outcomes—and seeing as they often require a reasonably precise set of conditions to function, our interventions can wreak havoc.\n The Precautionary Principle reflects the reality of working with and within complex systems. It shifts the burden of proof from proving something was dangerous after the fact to proving it is safe before taking chances. It emphasizes waiting for more complete information before risking causing damage, especially if some of the possible impacts would be irreversible, hard to contain, or would affect people who didn’t choose to be involved.\n The possibility of harm does not need to be specific to that particular circumstance; sometimes we can judge a category of actions as one that always requires precaution because we know it has a high risk of unintended consequences.\n For example, invasive species (plants or animals that cause harm after being introduced into a new environment by humans) have repeatedly caused native species to become extinct. So it’s reasonable to exercise precaution and not introduce living things into new places without strong evidence it will be harmless.\n  Best known for its use as a regulatory guideline in environmental law and public health, the Precautionary Principle originated with the German term “Vorsorgeprinzip” applied to regulations for preventing air pollution. Konrad Von Moltke, director of the Institute for European Environmental Policy, later translated it into English.\n Seeing as the natural world is a highly complex system we have repeatedly disrupted in serious, permanent ways, the Precautionary Principle has become a guiding part of environmental policy in many countries.\n For example, the Umweltbundesamt (German Environmental Protection Agency) explains that the Precautionary Principle has two core components in German environmental law today: preventing risks and protecting resources.\n Preventing risks means legislators shouldn’t take actions where our knowledge of the potential for environmental damage is incomplete or uncertain but there is cause for concern. The burden of proof is on proving lack of harm, not on proving harm. Protecting resources means preserving things like water and soil in a form future generations can use.\n To give another example, some countries evoke versions of the Precautionary Principle to justify bans on genetically modified foods—in some cases for good, in others until evidence of their safety is considered stronger. It is left to legislators to interpret and apply the Precautionary Principle within specific situations.\n The flexibility of the Precautionary Principle is both a source of strength and a source of weakness. We live in a fast-moving world where regulation does not always keep up with innovation, meaning guidelines (as opposed to rules) can often prove useful.\n Another reason the Precautionary Principle can be a practical addition to legislation is that science doesn’t necessarily move fast enough to protect us from potential risks, especially ones that  shift harm elsewhere or take a long time to show up. For example, thousands of human-made substances are present in the food we eat, ranging from medications given to livestock to materials used in packaging. Proving that a new additive has health risks once it’s in the food supply could take decades because it’s incredibly difficult to isolate causative factors. So some regulators, including the Food and Drug Administration in America, require manufacturers to prove something is safe before it goes to market. This approach isn’t perfect, but it’s far safer than waiting to discover harm after we start eating something.\n The Precautionary Principle forces us to ask a lot of difficult questions about the nature of risk, uncertainty, probability, the role of government, and ethics. It can also prompt us to question our intuitions surrounding the right decisions to make in certain situations.\n  When handling risks, it is important to be aware of what we don’t or can’t know for sure. The Precautionary Principle is not intended to be a stifling justification for banning things—it’s a tool for handling particular kinds of uncertainty. Heuristics can guide us in making important decisions, but we still need to be flexible and treat each case as unique.\n So how should we use the Precautionary Principle? Sven Ove Hansson suggests two requirements in   How Extreme Is the Precautionary Principle? First, if there are competing priorities (beyond avoidance of harm), it should be combined with other decision-making principles. For example, the idea of “ explore versus exploit” teaches us that we need to balance doubling down on existing options with trying out new ones. Second, the decision to take precautionary action should be based on the most up-to-date science, and there should be plans in place for how to update that decision if the science changes. That includes planning how often to revaluate the evidence and how to assess its quality.\n When is it a good idea to use the Precautionary Principle? There are a few types of situations where it’s better to be safe rather than sorry if things are uncertain.\n When the costs of waiting are low. As we’ve already seen, the Precautionary Principle is intended as a tool for handling uncertainty, rather than a justification for arbitrary bans. This means that if the safety of something is uncertain but the costs of waiting to learn more are low, it’s a good idea to use precaution.\n When preserving optionality is a priority. The Precautionary Principle is most often evoked for potential risks that would cause irreversible, far-reaching, uncontainable harm. Seeing as we don’t know what the future holds, keeping our options open by avoiding limiting choices gives us the most flexibility later on. The Precautionary Principle preserves optionality by ensuring we don’t restrict the resources we have available further down the line or leave messes for our future selves to clean up.\n When the potential costs of a risk are far greater than the cost of preventative action. If a potential risk would be devastating or even ruinous, and it’s possible to protect against it, precautionary action is key. Sometimes winning is just staying in the game—and sometimes staying in the game boils down to not letting anything wipe you out.\n For example, in 1963 the Swiss government pledged to provide bunker spaces to all citizens in the event of a nuclear attack or disaster. The country still maintains a national system of thousands of warning sirens and distributes potassium iodide tablets (used to reduce the effects of radiation) to people living near nuclear plants in case of an accident. Given the potential effects of an incident on Switzerland (regardless of how likely it is), these precautionary actions are considered worthwhile.\n When alternatives are available. If there are alternative courses of action we know to be safe, it’s a good idea to wait for more information before adopting a new risky one.\n  As the third criteria for using the Precautionary Principle usefully, Sven Ove Hansson recommends it not be used when the likelihood or scale of a potential risk is too low for precautionary action to have any benefit. For example, if one person per year dies from an allergic reaction to a guinea pig bite, it’s probably not worth banning pet guinea pigs. We can add a few more examples of situations where it’s generally not a good idea to use the Precautionary Principle.\n When the tradeoffs are substantial and known. The whole point of the Precautionary Principle is to avoid harm. If we know for sure that  not taking an action will cause more damage than taking it possibly could, it’s not a good idea to use precaution.\n For example, following a 2011 accident at Fukushima, Japan shut down all nuclear power plants. Seeing as nuclear power is cheaper than fossil fuels, this resulted in a sharp increase in electricity prices in parts of the country. According to the authors of the paper  Be Cautious with the Precautionary Principle, the resulting increase in mortality from people being unable to spend as much on heating was higher than the fatalities from the actual accident.\n When the risks are known and priced in. We all have different levels of  risk appetite and we make judgments about whether certain activities are worth the risks involved. When a risk is priced in, that means people are aware of it and voluntarily decide it is worthwhile—or even desirable.\n For example, riskier investments tend to have higher potential returns. Although they might not make sense for someone who doesn’t want to risk losing any money, they do make sense for those who consider the potential gains worth the potential losses.\n When only a zero-risk option would be satisfying. It’s impossible to completely avoid risks, so it doesn’t make much sense to exercise precaution with the expectation that a 100% safe option will appear.\n When taking risks could strengthen us. As individuals, we can sometimes be overly risk averse and too cautious—to the point where it makes us fragile. Our ancestors had the best chance of surviving if they overreacted, rather than underreacted, to risks. But for many of us today, the biggest risk we face can be the stress caused by worrying too much about  improbable dangers. We can end up fearing the kinds of risks, like social rejection, that are unavoidable and that tend to make us stronger if we embrace them as inevitable. Never taking any risks is generally a far worse idea than taking sensible ones.\n  We all face decisions every day that involve balancing risk. The Precautionary Principle is a tool that helps us determine when a particular choice is worth taking a gamble on, or when we need to sit tight and collect more information.", "posttime": "2021-06-22 00:47:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "预防,principle,风险", "title": "预防原则：更安全，但对不起？ ", "title_en": "The Precautionary Principle: Better Safe Than Sorry?", "transed": 1, "url": "https://fs.blog/2021/06/precautionary-principle/", "via": "", "real_tags": ["预防", "principle", "风险"]}]