[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1072868, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎来到另一个开发工具视频，在这个视频中，我使用开发工具来分析黑客新闻（YCombinator）的工作原理。这是最好的网站之一，当它。。。", "note_en": "Welcome to another dev tools video, in this video I use dev tools to break down how hacker news (YCombinator) works. This is one of the best websites when it...", "posttime": "2022-02-13 13:28:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,analyzes,开发工具", "title": "开发人员使用浏览器开发工具分析HN", "title_en": "A developer analyzes HN using browser devtools", "transed": 1, "url": "https://www.youtube.com/watch?v=gXdisQwnGc8", "via": "", "real_tags": ["开发", "analyzes", "开发工具"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072867, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面的图表显示了在一个国家，而不是另一个国家，人们所知道的词汇比例过高。数据来源于一篇关于62000个英语引理（via）的单词流行规范的论文中的这个表格：在我们选择的数据集中，每个单词平均由388名参与者（282名来自美国，106名来自英国）判断。表示知道这个词的人的百分比从2%到2%不等（斯托廷卡、阿德塔、卡希卡提亚、戈穆蒂、阿森纽雷特、阿尔塞克……）100%（…，你，年轻人，你自己，分区，分区）。另见", "note_en": "The chart below visualizes words disproportionately known in one country and not the other. The data comes from this table in a paper on Word prevalence norms for 62,000 English lemmas (via): In the dataset we selected, each word was judged on average by 388 participants (282 from the USA and 106 from the UK). The percentages of people indicating they knew the word ranged from 2% (for stotinka, adyta, kahikatea, gomuti, arseniuret, alsike, . . .) to 100% (. . . , you, young, yourself, zone, zoned). See also", "posttime": "2022-02-13 13:28:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,uk,知道", "title": "单词在美国比在英国更为人所知，反之亦然", "title_en": "Words known better in the US than in the UK, and vice versa", "transed": 1, "url": "https://observablehq.com/@yurivish/more-words", "via": "", "real_tags": ["美国", "uk", "知道"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072866, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "司机挑剔地看着面前的泥海，小心翼翼地爬进泥潭，蹲在引擎盖前检查什么东西。\n车轮在完全无力的愤怒中旋转，挡风玻璃上满是泥，四轮驱动车轻轻地陷入更深的泥潭中。\n俗话说，坦克不怕泥。但入侵的军队应该——尤其是在乌克兰南部。\n上个月，美国政府消息人士向《纽约时报》通报说，弗拉基米尔·普京可能推迟了他入侵乌克兰的计划，因为深冬意味着地面不够硬。\n这些报道称，在本月下半月向西进军之前，普京的军队将需要“最大限度的冻结”。\n这是一个从那以后经常重复的分析——通常明智地提到希特勒的装甲部队在1941年陷入困境，以及俄语单词“rasputitsa”，或“解冻”。\n现代俄罗斯军队对泥泞并不陌生，也不乘坐80年前建造的窄履带装甲车。\n然而，这是普京和他的将军们必须考虑的一个因素，尤其是在乌克兰南部。\n切入顿巴斯表层土的沟槽系统提供了问题的横截面图。\n地表是著名的南方草原黑土。它柔软、粉状、肥沃无比，潮湿时会迅速变成液体。\n在它下面几英尺的地方是一块黄色的粘土，雨雪融化后会变成一种令人毛骨悚然的厚面糊，像水泥一样粘在靴子上。\n这里几乎没有基岩或碎石。这些层合在一起，形成了一个泥潭，在脚下和像地球一样试图认领受害者的车辆上都会被吸吮。\n沿着壕沟走下去会成为一项巨大的心血管运动，就像你失去双腿功能的噩梦一样。\n下雨时，孤立的位置无法再补给，因为即使四轮驱动也无法通行。\n乌克兰士兵说，任何试图旅行并被卡住的车辆都很容易受到俄罗斯支持的分离主义者的炮击或无人机袭击，这些分离主义者就在一公里外的同一战壕里。\n在两天的干燥天气之后，我们自己遇到了泥泞，这是在前线一个安静的地段，在友好的领土内。\n我们在一片开阔的草原上，离最近的柏油路或安全壕沟都有一英里远，两边的田地都是地雷。\n很容易想象，在类似的情况下，一支试图进军敌对领土的军队会感到多么脆弱。\n我们最终还是出来了——但仅仅是在四名士兵和两名电报记者的共同推动下，在车轮下塞满圆木整整半个小时之后，我们徒步长途跋涉到了更坚实的地面。\n回到停机坪上，我们对这次旅行哈哈大笑，我说我对那些油嘴滑舌的西方分析师和烂泥持怀疑态度。\n“这是事实。在1942年伟大的爱国主义运动期间，这里附近发生了战斗，但那是在冬天，”他说，用俄语来形容第二次世界大战。这根本不现实。普京只是想吓唬所有人。”\n这可能仍然是一种乐观的想法。但这也是许多人希望可怕的入侵不会到来的另一个原因。\n《每日电讯报》重视你的评论，但恳请所有帖子都是关于主题、建设性和尊重性的。请查看我们的评论政策。", "note_en": "The driver looked critically at the sea of mud in front of him, climbed gingerly into the quagmire, and crouched in front of the bonnet to inspect something.\n  Wheels spun with entirely impotent fury, the windscreen filled with mud, and the four wheel drive gently settled more deeply into the mire.\n  Tanks don’t fear mud, the saying goes. But invading armies should - especially in southern Ukraine.\n Last month, American government sources briefed the New York Times that Vladimir Putin may have postponed his  planned invasion of Ukraine because a late winter meant the ground was not hard enough.\n The “maximum freeze” Mr Putin’s armies will require  before marching West is expected in the second half of this month, according to those reports.\n It is an analysis that has been frequently repeated ever since - often with sage references to Hitler’s Panzers getting stuck in 1941 and the Russian word “rasputitsa”, or thaw.\n  The modern Russian army is no stranger to mud, and it does not ride in narrow-tracked Panzers built 80 years ago.\n Nonetheless, it is a factor that Mr Putin and his generals will have to consider - and especially so in the southern part of Ukraine.\n  The trench systems cut into the Donbas topsoil provide a cross-section illustration of the problem.\n On the surface lies the famous black earth of the southern steppes. It is soft, powdery, incredibly fertile, and turns quickly to liquid gloop when wet.\n A few feet below that is a yellowish clay that rain and snow melt turn into a cloying, thick batter that clings to boots like cement.\n There is almost nothing in the way of bedrock or scree. Put together, these layers make a quagmire that sucks at feet and vehicles like the earth trying to claim a victim.\n  Walking down a trench becomes an enormous cardio-vascular effort, like one of those nightmares where you lose the use of your legs.\n  When it rains, isolated positions cannot be resupplied because the fields become impassable even to four-wheel-drives.\n Any vehicle that attempts the journey and becomes stuck is vulnerable to shelling or drone attacks by Russian-backed separatists sitting in identical trenches just a kilometre away, Ukrainian soldiers say.\n Our own encounter with the mud came after two days of dry weather, on a quiet section of the front and inside friendly territory.\n  We were on the open steppe, a good mile from either the nearest tarmac road or safe trench, and the fields on either side were mined.\n It was easy to imagine how vulnerable an army trying to advance into hostile territory would feel in similar circumstances.\n We did eventually get out - but only after a good half hour jamming logs under the wheels, the combined pushing of four soldiers and two Telegraph reporters, and a long trudge on foot to firmer ground.\n  Back on tarmac, we laughed about the excursion and I remarked how sceptical I had been about glib Western analysts and the mud.\n  “It’s the truth. In 1942 during the Great Patriotic there was fighting around here, but that was in Winter,&#34; he said, using the Russian term for the Second World War. &#34;It’s simply not realistic. Putin’s just trying to scare everyone.”\n That may yet prove to be optimistic thinking. But it is another reason many here hope the feared invasion will not come.\n  The Telegraph values your comments but kindly requests all posts are on topic, constructive and respectful. Please review our commenting policy.", "posttime": "2022-02-13 13:23:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "入侵,play,军队", "title": "为什么泥巴会在弗拉基米尔·普京入侵乌克兰的决定中扮演重要角色", "title_en": "Why mud could play a big part in Vladimir Putin's decision to invade Ukraine", "transed": 1, "url": "https://www.telegraph.co.uk/world-news/2022/02/11/say-tanks-dont-fear-mud-russia-should-especially-southern/", "via": "", "real_tags": ["入侵", "play", "军队"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072863, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大约五年后，关于电动汽车行驶里程焦虑的常见抱怨将在美国大部分地区成为过去。\n从今年开始，联邦政府将在五年内向各州拨款50亿美元，以建立一个全国性的快速充电器网络。该计划最初侧重于州际公路系统，指示各州每50英里建设一个充电站。这些电站必须能够以150千瓦的功率同时为至少四辆电动汽车充电。\n一旦各州完成了州际充电网络，他们就可以申请补助金来填补其他地方的空白。能源和运输联合办公室（Joint Office of Energy and Transportation）是为帮助运输和能源部门管理该项目而成立的一个新机构，如果附近没有电网连接，该办公室将允许对50英里的要求进行个案例外。该项目最初州际部分的资金将使用一个模拟联邦公路拨款分配方式的公式进行分配。从2022财年开始，6.15亿美元将用于建设充电站，3亿美元将用于建立能源和交通联合办公室。每年10%的资金将用于填补网络的缺口。\n在最初的50亿美元项目启动后，另外25亿美元的可自由支配拨款将用于在农村和服务不足地区建造充电器。\n作为提交给联邦政府的计划的一部分，各州将需要确保充电站的可靠性，每个充电站至少有一个充电器需要在超过97%的时间内工作，并限制其对电网的影响。各州还被要求设计车站，以便随着需求的增长和充电率的提高，车站可以方便地扩展和升级。新计划还鼓励各州在旅游中心、便利店、游客中心或餐馆附近安装充电器。\n为了获得州际建设的信誉，各州必须安装使用组合充电系统（也称为CCS）的充电器。除了日产Leaf之外，在美国销售的大多数电动汽车型号都可以使用这种插头类型。尽管特斯拉有自己的插头类型，但据报道，该公司正计划提供一种适配器，使其至少部分北美车队能够使用CCS快速充电器。（它已经在韩国提供了这种适配器。）\n新计划还优先考虑国内充电器的生产，这已经促使一些制造商开始在美国开展业务。向ChargePoint提供一些快速充电器的澳大利亚公司Tritium本周早些时候表示，将在田纳西州建造一座工厂，每年生产30000台直流快速充电器。西门子还计划扩大其在美国的业务范围，以便到2025年每年能生产100万台充电器。\n这项新计划目前有一个不足之处，那就是人们将如何支付费用。大多数非特斯拉电动汽车车主的手机（或钥匙链上的FOB）上都有许多应用程序，让他们能够接入不同的充电网络。这不太方便。\n运输部长皮特·布蒂吉格告诉《汽车与司机》杂志，“我们正在仔细研究这个问题。”。他说：“这个项目的一部分将是一个共享标准。如果我们要用纳税人的#39；美元来帮助私人演员建立充电站，那么我们当然需要确保公民从中获得良好的价值。通过忠诚项目可能会有任何数量的网络利益。这很好。”，“但我们必须确保……每个人都能受益。”\n在每个充电站安装一个信用卡读卡器似乎是一个不错的解决方案，尽管一些网络已经支持ISO 15118标准，也被称为&#34；充电&#34; 使用兼容车辆的驾驶员只需插入电源，充电器和车辆就可以协调处理身份验证和支付。Buttigieg还表示，新成立的能源和交通联合办公室将开始研究如何定位和设计充电器，以方便车辆牵引拖车。\n这项新计划代表着乔·拜登总统承诺到2030年在美国各地建立一个50万个充电站网络的重大首期付款。如果该计划能够实现，它将有助于加快该国向电动汽车的过渡，同时大幅减少交通运输的碳排放。\n目前最新的充电器可以达到250-350千瓦，那么我们为什么计划只生产150千瓦的未来充电器呢？\n我不&#39；我对电动汽车了解不多，这篇文章规定四辆车同时使用150千瓦的充电器——你提到的充电器能做到这一点吗？\n有些是，很多不是。那&#39；答案很简单。答案要复杂得多。许多充电站分为两个。因此，如果你到达，没有其他人在那里，你将获得充分的权力。但如果有人连接到同一个站点，则会被拆分。因此，想象一下，为了简单起见，200对100&#39；看在上帝的份上。这就是为什么你会经常看到特斯拉在充电站把车停在彼此相隔一个空间的地方。", "note_en": "About five years from now, a common complaint about electric vehicles—range anxiety—will be a thing of the past across much of the US.\n Starting this year, the federal government will begin doling out $5 billion to states over five years to build a nationwide network of fast chargers. The  plan initially focuses on the Interstate Highway System, directing states to build one charging station every 50 miles. Those stations must be capable of charging at least four EVs simultaneously at 150 kW.\n  Once states have completed the Interstate charging network, they’ll be able to apply for grants to fill in gaps elsewhere. The Joint Office of Energy and Transportation, a new agency formed to help the Transportation and Energy Departments administer the program, will allow case-by-case exceptions to the 50-mile requirement if, for example, no grid connection is available nearby. Funding for the initial Interstate portion of the program will be allocated using a formula that mimics how federal highway grants are distributed. Starting in fiscal year 2022, $615 million will be available to build charging stations, and $300 million will be allocated to set up the Joint Office of Energy and Transportation. Ten percent of each year’s funding will go toward filling gaps in the network.\n After the initial $5 billion program is launched, another $2.5 billion in discretionary grants will be available to build chargers in rural and underserved areas.\n As part of their plans submitted to the federal government, states will need to ensure that the charging stations will be reliable—at least one charger per station needs to be working more than 97 percent of the time—and that they will limit their impact on the electric grid. States are also directed to design stations so they can be easily expanded and upgraded as demand grows and charging rates increase. The new program also encourages states to site chargers near travel centers, convenience stores, visitor centers, or restaurants.\n    To get credit for their Interstate build-out, states will have to install chargers that use the Combined Charging System, also known as CCS. With the exception of the Nissan Leaf, most models of EVs sold in the US can use this plug type. Though Teslas have their own plug type, the company is reportedly planning to offer an adapter that will allow at least some of its North American fleet to use CCS fast chargers. (It already offers that adapter in South Korea.)\n The new program also prioritizes domestic production of chargers, which has already spurred some manufacturers to begin setting up operations in the US. Tritium, an Australian company that supplies some fast chargers to ChargePoint, said earlier this week that it would build a factory in Tennessee that can crank out 30,000 DC fast chargers per year. Siemens also plans to expand its US footprint so it can make up to 1 million chargers per year by 2025.\n One area where the new program currently falls short concerns how people will pay for charging. Most non-Tesla EV owners have a number of apps on their phones (or fobs on their keychains) to give them access to different charging networks. It’s less than convenient.\n “We’re taking a good look at this,” Secretary of Transportation Pete Buttigieg  told Car and Driver. “Part of this program is going to be a shared standard. If we’re going to use taxpayers&#39; dollars to help private actors put in charging stations, then of course we need to make sure the citizen is getting good value out of it. There may be any number of network benefits through loyalty programs. That’s fine,” he said, “but we’ve got to make sure… everybody can benefit.”\n  Putting a credit card reader on each charging station seems like a decent solution, though some networks  already support the ISO 15118 standard, also known as &#34;plug-and-charge.&#34; Drivers using compatible vehicles can simply plug in, and the charger and vehicle coordinate to handle both authentication and payment. Buttigieg also said that the new Joint Office of Energy and Transportation will start looking into providing guidance on how to site and design chargers to facilitate vehicles towing trailers.\n The new program represents a significant down payment on President Joe Biden’s pledge to create a  network of 500,000 charging stations across the US by 2030. If that plan comes to fruition, it should help speed the country’s transition to EVs while slashing carbon emissions from transportation.\n  The current newest chargers can do 250-350 kw, so why are we planning making *future* chargers only 150 kw?\n  I don&#39;t know much about EVs, the article specifies 150kw for four vehicles simultaneously - are the chargers you mentioned able to do that?\n Some are, many are not. That&#39;s the short answer. The long answer is much more complicated.   Many charging stations split between two. So if you arrive and no one else is there, you will get full power. But if someone connects to the same station, that is then split. So imagine 200 vs 100 for simplicity&#39;s sake. This is why you will often see Teslas parked one space away from each other at charging stations.", "posttime": "2022-02-13 13:14:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,unveils,充电器", "title": "每50英里四个快速充电器——美国公布电动汽车基础设施计划", "title_en": "Four fast chargers every 50 miles–US unveils EV infrastructure plan", "transed": 1, "url": "https://arstechnica.com/cars/2022/02/four-fast-chargers-every-50-miles-us-unveils-ev-infrastructure-plan/", "via": "", "real_tags": ["美国", "unveils", "充电器"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072861, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "A-hed汽车制造商正在建立防御系统，以防斯通·马滕斯（stone martens）入侵发动机并吃掉电线\n柏林有没有想过，什么样的黄鼠狼会破坏晚上留在外面的一辆完美好车？\n德国有答案：它的技术名称是石貂。这种牙齿锋利的动物有挤进停着的汽车内部并享用塑料软管和管子的习惯。德国的貂数量正在爆炸式增长。\n《华尔街日报》将向您收取$+税（如果适用）。您可以随时在客户中心或致电客户服务部更改账单偏好。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客服取消订阅。", "note_en": "A-hed     Auto makers are building defenses against stone martens, a type of weasel that invades engines and eats the wiring\n   BERLIN—Ever wondered what kind of weasel would vandalize a perfectly good car left outside at night?\n  Germany has the answer: Its technical name is the stone marten. This sharp-toothed critter has a habit of squeezing into the innards of parked cars and feasting on plastic hoses and tubes. And Germany’s marten population is exploding.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-02-13 13:07:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "喜欢,love", "title": "黄鼠狼喜欢德国汽车（2019）", "title_en": "Weasels love German cars (2019)", "transed": 1, "url": "https://www.wsj.com/articles/they-go-absolutely-insane-and-tear-everything-apart-weasels-love-german-cars-11577377251", "via": "", "real_tags": ["喜欢", "love"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072860, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科罗拉多州居民克里斯托弗·布莱恩（Christopher Bryan）周三对苹果提起集体诉讼，指控该公司欺诈性地营销和销售第六代iPad mini，尽管该公司知道一个所谓的&#34；果冻滚动&#34；根据MacRumors审查的法庭文件，该设备存在缺陷。\n第六代iPad mini于9月发布几天后，一些用户开始注意到，在设备上以纵向滚动时，文本出现了轻微的不均匀。具体来说，屏幕左侧的文本在滚动时似乎稍微落后于屏幕右侧的文本。\n这项在北加利福尼亚州地方法院提起的诉讼称，苹果公司知道这一缺陷，但仍在继续销售iPad mini，没有修复缺陷，也没有修改营销材料以反映缺陷的存在。\n9月下旬，苹果的一位发言人表示，影响是&#34；LCD屏幕的正常行为，&#34；根据Ars Technica&#39；这是安德鲁·坎宁安。iFixit还表示，这种效果在显示屏上很常见，但该维修公司推测，由于显示屏#39；s控制器板垂直安装在设备内部，而不是像第四代iPad Air那样水平安装。\n这起诉讼要求在美国购买新的第六代iPad mini的任何人在庭审中证明赔偿金额。在集体诉讼可以进行之前，提议的类别仍然必须经过认证。\n让我崩溃的是。。。我的名字和中间名是克里斯托弗·布莱恩，我住在科罗拉多州，我有一辆迷你车。我不得不想，我梦游了一场官司吗？\n这些诉讼很累人。这是一个自由市场经济，如果你不喜欢这个产品，下次就买别的吧。糟糕的产品设计并不违法。\n我不明白为什么人们不利用退货政策。这是有原因的。对它不满意…把它还给我。就这么简单。\n他为什么不利用退货政策呢？他有30天的时间来决定？不知道这场诉讼会发生什么。但我有一种感觉，这就要来了。苹果还不如给他送一台新的iPad mini而不带果冻滚动，或者他可以直接购买iPad Pro型号？这也是一个很好的选择。\n就在第六代iPad mini发布几周后，关于iPad mini&#34；亲&#34；他们在网上重新露面，概述了高端设备的四种据称的规格。\niFixit今天撕碎了苹果的一个#39；在拆卸过程中，维修网站详细介绍了为什么新平板电脑出现了一个被称为#34；果冻滚动&#34;\niPad mini 6的用户一直在抱怨a&#34；果冻滚动&#34；这个问题影响了一些iPad迷你机型在纵向模式下使用该设备，苹果现在表示，这种行为对于LCD屏幕来说是正常的。\n现在，新的iPad mini 6用户已经与苹果公司有了几天的合作&#39；在谷歌最新重新设计的平板电脑上，一些用户注意到一个被称为&#34；果冻卷轴&#34；在纵向模式下查看屏幕时。\n最近发布的第六代iPad mini给苹果带来了巨大的升级#39；世界上最小的平板电脑，2020&#39；随着iPad Air开始显示出它的时代，新的iPad mini可能会为我们对下一代iPad Air的期待提供一些指示。\n苹果公司今天宣布推出第六代iPad mini，该产品经过大规模重新设计，具有更大的显示屏、电源按钮中的嵌入式触摸ID传感器、更高的性能、USB-C端口和5G。\n根据Gizmodo Japan发现的日本配件清单，第六代iPad mini将配备8.38英寸显示屏，并可能在10月发布。\n苹果公司&#39；苹果公司的第六代iPad mini将于本周五发布，该设备已提前开始向世界各地的客户发货。在MacRumors论坛上与其他人一起跟踪您的iPad mini预购发货状态。\n苹果今天向开发者发布了iOS 15.4和iPadOS 15.4的第二个Beta，以供测试之用，尽管没有&#39；正如我们在第一个Beta中获得的许多新特性一样，有一些值得强调的添加和更改。\n苹果公司&#39；s的Safari和WebKit团队在Twitter上征求反馈意见，批评该浏览器&#39；存在漏洞和缺少支持。\n苹果公司今天发布了iOS 153.1和iPADOS153.1，这是2021年9月发布的iOS和iPADOS操作系统的两个小更新。iOS和iPadOS 15.3.1在iOS和iPadOS 15.3发布两周后发布。\n科罗拉多州居民克里斯托弗·布莱恩（Christopher Bryan）周三对苹果提起集体诉讼，指控该公司欺诈性地营销和销售第六代iPad mini，尽管该公司知道一个所谓的&#34；果冻滚动&#34；根据MacRumors审查的法庭文件，该设备存在缺陷。\n特斯拉设计总监弗兰兹·冯·霍尔扎乌森最近评论了苹果公司&#39；苹果的设计原则和产品发布，哀叹苹果没有&#39；不要送东西&#34；期待&#34;\nCalDigit今天推出了新的Thunderbolt Station 4船坞，拥有18个端口，它声称这是有史以来所有Thunderbolt船坞中最多的一个。\n苹果今天宣布，它正在对AirTags进行一些更新，以减少不必要的跟踪。在多阶段的推出中，将实施几项更改。", "note_en": "Colorado resident Christopher Bryan on Wednesday filed a class action lawsuit against Apple that accuses the company of fraudulently marketing and selling the sixth-generation iPad mini despite being aware of a so-called &#34;jelly scrolling&#34; defect with the device, according to  court documents reviewed by  MacRumors.\n A few days after the sixth-generation iPad mini was released in September, some users started to notice that  text was appearing slightly uneven while scrolling in portrait orientation on the device. Specifically, text on the left side of the screen appears to ever so slightly lag behind text on the right side of the screen while scrolling.\n The complaint, filed in Northern California district court, alleges that Apple is aware of the defect, yet continues to sell the iPad mini without fixing the defect or amending its marketing materials to reflect the existence of the defect.\n In late September, an Apple spokesperson said the effect is &#34; normal behavior for LCD screens,&#34; according to  Ars Technica&#39;s Andrew Cunningham. iFixit also said the effect is common for displays, but the repair company speculated that it may be more prominent on the new iPad mini due to the display&#39;s controller board  being mounted vertically inside the device, rather than horizontally like in the fourth-generation iPad Air.\n The lawsuit seeks damages in an amount to be proven at trial for any person in the United States who purchased a new sixth-generation iPad mini. The proposed class still has to be certified before the class action lawsuit can proceed.\n  What cracked me up is... My first and middle names are Christopher Brian and I live in Colorado, and I have a mini. I had to think, did I sleepwalk a lawsuit?\n These lawsuits are tiring. This is a free market economy, if you don’t like the product, buy something else next time. Bad product design is not illegal.\nI don’t understand why people don’t take advantage of the return policy. It’s there for a reason.  Not happy with it… return it. Simple as that.\n Why didn’t he take advantage of the return policy? He had 30 days to decide ?   Not sure what’s going to happen to this lawsuit. But I had a feeling this was coming. Apple might as well send him a new iPad mini without the jelly scrolling or he can just purchase the iPad Pro models? That’s a good alternative too.\n  Just weeks after the launch of the sixth-generation iPad mini, rumors about an iPad mini &#34;Pro&#34; have resurfaced online, outlining four alleged specifications for the high-end device.\rWith its USB-C port, squared-off edges, and all-screen design, many observers believed that the sixth-generation iPad mini was the realization of years of &#34;iPad mini Pro&#34; rumors. In reality, the sixth-generation...\n iFixit today tore apart one of Apple&#39;s new iPad mini models, and in the process of the teardown, the repair site gave a detailed overview of why the new tablets are displaying an issue that has been dubbed &#34;jelly scrolling.&#34;\rSome new iPad mini 6 owners have noticed that text or images on one side of the screen appear to be tilted downward when scrolling through content, which affects all LCD ...\n iPad mini 6 owners have been complaining about a &#34;jelly scrolling&#34; problem that affects some iPad mini models when using the device in portrait mode, and Apple now says that the behavior is normal for an LCD screen.\r&#34;Jelly scrolling&#34; refers to screen tearing, which can cause text or images on one side of the screen to appear to be tilted downwards because of a mismatch in refresh rates. It...\n Now that new iPad mini 6 owners have had a couple of days with Apple&#39;s latest redesigned tablet, some users are noticing an issue being referred to as &#34;jelly scroll&#34; when viewing the screen in portrait mode.\rThe term refers to a noticeable effect when scrolling vertically through text-based content like a webpage or document, where each line of text appears to tilt down towards the left of...\n The recently launched sixth-generation iPad mini brought a huge upgrade to Apple&#39;s smallest tablet, and with 2020&#39;s iPad Air starting to show its age, the new iPad mini could give a number of indications about what we can expect from the next-generation iPad Air.\rThe iPad mini is now very similar to the iPad Air, with both devices featuring squared-off edges, an all-screen design with no...\n Apple today announced the sixth-generation iPad mini, featuring a massive redesign with a larger display, an embedded Touch ID sensor in the Power Button, improved performance, a USB-C port, and 5G.\rThe new iPad mini features a completely new design, dismissing the Home Button in favor of a full-screen design with an 8.3-inch display. The display features wide color, an antireflective...\n The sixth-generation iPad mini will feature an 8.38-inch display and could launch in October, according to a Japanese accessory listing spotted by Gizmodo Japan.\rThe now-removed Amazon Japan listing shows an Elecom glass screen protector for an all-screen 8.38-inch &#34;small&#34; iPad, presumed to be the upcoming sixth-generation iPad mini. This appears to be the most specific measurement for the...\n Apple&#39;s sixth-generation iPad mini is set to launch this Friday, and ahead of time, the device has started shipping to customers around the world. Track your iPad mini pre-order shipping status with others in the MacRumors forums.\rThe new iPad mini is essentially an iPad Air mini, as the two devices now share several features, including slimmer bezels, a USB-C port, a Touch ID power button,...\n  Apple today seeded the second betas of iOS 15.4 and iPadOS 15.4 to developers for testing purposes, and while there aren&#39;t as many new features as we got in the first betas, there are some notable additions and changes worth highlighting.\rTap to Pay on iPhone\rWith the second beta of iOS 15.4, Apple introduced support for the &#34;Tap to Pay on iPhone&#34; feature that is designed to allow...\n Apple&#39;s Safari and WebKit team has asked for feedback on Twitter amid criticisms of the browser&#39;s bugs and missing support.\rJen Simmons, an Apple Evangelist and developer advocate on the Web Developer Experience team for Safari and WebKit, Tweeted that &#34;Everyone in my mentions [is] saying Safari is the worst, it&#39;s the new IE.&#34; This led her to ask users for feedback, preferably highlighting...\n Apple today released iOS 15.3.1 and iPadOS 15.3.1, two minor updates to the iOS and iPadOS operating systems released in September 2021. iOS and iPadOS 15.3.1 come two weeks after the release of iOS and iPadOS 15.3.\rThe iOS 15.3.1 and iPadOS 15.3.1 updates can be downloaded for free and the software is available on all eligible devices over-the-air in the Settings app. To access the new...\n Colorado resident Christopher Bryan on Wednesday filed a class action lawsuit against Apple that accuses the company of fraudulently marketing and selling the sixth-generation iPad mini despite being aware of a so-called &#34;jelly scrolling&#34; defect with the device, according to court documents reviewed by MacRumors.\rA few days after the sixth-generation iPad mini was released in September, some ...\n Tesla design chief Franz von Holzhausen recently commented on Apple&#39;s design principles and product launches, lamenting that Apple doesn&#39;t deliver something &#34;to look forward to.&#34;\rDuring a podcast interview with Spike Feresten of Spike&#39;s Car Radio (via iPhone in Canada and Sawyer Merritt), Holzhausen said that Apple&#39;s devices are &#34;just a continuation&#34; and a &#34;slight refinement on the same...\n CalDigit today introduced its new Thunderbolt Station 4 dock with 18 ports, which it claims is the most on any Thunderbolt dock ever.\rThe dock features three Thunderbolt 4 ports, with one of them providing up to 98W of pass-through charging to compatible Macs, including the latest 14-inch and 16-inch MacBook Pro. The dock is also equipped with three USB-C ports (3.2 Gen 2), five USB-A ports...\n Apple today announced that it is making some updates to AirTags with the aim of cutting down on unwanted tracking. There are several changes that will be implemented in a multi-phase rollout.\rIn an upcoming software update, Apple plans to implement new privacy warnings that will show up during AirTag setup to thwart malicious use. The warning will make it clear that the AirTag is linked to...", "posttime": "2022-02-13 13:02:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,ipad,hit", "title": "苹果因iPad Mini上的“果冻滚动”而遭遇集体诉讼", "title_en": "Apple Hit with Class Action Lawsuit over 'Jelly Scrolling' on iPad Mini", "transed": 1, "url": "https://www.macrumors.com/2022/02/10/apple-jelly-scrolling-ipad-mini-lawsuit/", "via": "", "real_tags": ["苹果", "apple", "ipad", "hit"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072858, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司首席执行官斯泰西·斯派克斯（Stacy Spikes）周四在曼哈顿的一次新闻发布会上表示，订阅电影票服务将于今年夏天重新推出，距离该公司2019年首次倒闭已近三年。\n斯派克斯说，MoviePass的新订阅服务将不再提供无限量的电影，而是将引入分层订阅系统。与健身初创公司Classpass类似，MoviePass的客户将购买信用卡，然后兑换成电影放映费。\n但Spikes还展示了另一种客户可以获得积分的方式：观看广告并跟踪他们的眼球。\nMoviePass的用户通过一个名为“pre show”的功能，可以通过手机观看广告获得积分。斯派克斯说，为了确保他们真的在观看，该应用程序将跟踪用户的眼球。\n这位首席执行官穿着黑色高领毛衣，以史蒂夫·乔布斯（Steve Jobs）的风格在舞台上踱来踱去，他说：“它所做的基本上是在你和品牌之间创造一种交易。”。\n斯派克斯补充道：“你的手机、你的设备使用你自己的面部检测。”。“它不会进入云端，除了你和你的信息之外，没有人会浏览任何东西。你选择自己去做。”\n他将“展前”功能描述为电影中植入式广告的延伸。\n“我喜欢电影中的植入式广告，”斯派克斯说。“我喜欢汽车，我喜欢手表，我喜欢衣服。我就是那种有时会有记事本的人，我在写，是雨果·博斯吗？”\n斯派克斯说，根据MoviePass的新学分制，黄金时段的热门电影将需要更多学分，而不太受欢迎的电影的日场将需要更少的学分。他说，该系统将有助于电影在慢节奏的日子里挤满影院。\n一位MoviePass发言人在接受《华盛顿邮报》采访时没有透露信用卡的费用，也没有提供“分层计划”之间差异的细节。\n在最初的版本中，MoviePass为客户提供了每月10美元的无限电影票——这是一种亏损策略，吸引了300多万客户，但最终导致该公司在一个季度内亏损超过1亿美元后破产。\nMoviepass在11月首次暗示了其重新启动的计划，当时Spikes在纽约破产法庭以1.4万美元的微薄价格收购了该公司。他在法庭文件中说，公司在2021年底测试了一个“新的商业模式，有1000个客户的样本组”。\n这些文件没有提供新商业模式的细节，但确实表明，斯派克希望在2022年秋冬季推出全面的电影通行证回归。\nSpikes最初于2011年联合创立，但该服务在2017年被Helios和数据分析公司Matheson Analytics收购后才获得发展。当时，该公司推出了10美元的无限制电影票交易，推动了其增长。\n斯派克斯说，当时他质疑每月10美元的模式是否可持续，并说他在2018年因为这些担忧被该应用的新所有者解雇。\n斯派克斯在周四的演讲中说：“人们对公司前进方向的看法存在很大差异。”。“我们都知道那之后发生了什么。”\nTed Farnsworth说，由于顾客滥用公司的模式，一遍又一遍地疯狂观看同一部电影，为没有订阅该服务的朋友和家人买票，在某些情况下，购买电影票只是为了“去时代广场的洗手间”，MoviePass最终倒闭，时任Helios and Matheson Analytics首席执行官的他在2019年停刊时告诉《华盛顿邮报》。\n此外，AMC和Cinemark等电影院连锁店开始推出自己的订票服务，这导致MoviePass为最大的电影和黄金时段增加了新的费用。2019年9月，该公司无限期关闭，四个月后母公司申请破产。", "note_en": "The subscription movie ticket service is relaunching this summer, nearly three years after the company first folded in 2019, CEO Stacy Spikes said at a press event in Manhattan on Thursday.\n MoviePass’ new subscription service won’t offer unlimited movies anymore, but will instead introduce a tiered subscription system, Spikes said. Similarly to fitness startup Classpass, MoviePass customers will buy credits that they can then redeem for movie showings.\n But Spikes also showed off another way that customers will be able to earn credits: watching ads and having their eyeballs tracked.\n Using a feature called “pre-show,” MoviePass customers will get credits in exchange for watching ads on their phones. To make sure they’re actually watching, the app will track users’ eyeballs, Spikes said.\n “What it does is it basically creates a transaction between you and the brand,” the CEO said, wearing a black turtleneck and pacing the stage in the style of Steve Jobs.\n “Your phone, your device uses your own facial detection,” Spikes added. “It doesn’t go to the cloud, nobody goes through anything other than you and your information in yours. And you opt in to do it on your own.”\n He portrayed the “pre-show” feature as an extension of product placement in movies.\n  “I love product placement in movies,” Spikes said. “I love the cars, I love the watches, I love the clothes. I’m that person that sometimes has a notepad and I’m writing down, is that Hugo Boss?”\n Under MoviePass’ new credit system, in-demand movies at prime times will require more credits, whereas matinees of less popular films will take fewer, Spikes said. He said the system would help movies fill theaters on slower days.\n A MoviePass spokesperson did not say how much credits will cost or provide details on differences between the “tiered plans” when reached for comment by The Post.\n  In its original incarnation, MoviePass had offered customers unlimited movie tickets for just $10 a month — a money-losing strategy that drew more than 3 million customers but ultimately  led the company to bankruptcy after it bled more than $100 million in a single quarter.\n Moviepass first hinted at its plans for a relaunch in November, when  Spikes bought the company in New York bankruptcy court for a meager $14,000. He said in court filings that company was testing a “new proposed business model with a sample group of 1,000 customers” in late 2021.\n The filings did not provide details of the new business model but did show that Spikes wanted to launch a full-fledged MoviePass comeback in the fall or winter of 2022.\n  Spikes originally co-founded in 2011 but the service only gained steam in 2017 after it was purchased by Helios and Matheson Analytics, a data analytics firm. That was when the company introduced its $10 unlimited movie tickets deal, supercharging its growth.\n Spikes says that at the time he questioned whether the $10-a-month model was sustainable and says he was fired by the app’s new owners in 2018 over those concerns.\n “There was a really big difference in the belief of the way the company should go forward,” Spikes said during Thursday’s presentation. “And we all kind of know what happened after that.”\n  MoviePass ultimately folded after customers abused the company’s model by binge-watching the same films over and over, buying tickets for friends and family who didn’t subscribe to the service, and in some cases, purchasing a movie ticket just “to go to the restroom in Times Square,” Ted Farnsworth, then the CEO of Helios and Matheson Analytics, told The Post  at the time of its shutdown in 2019.\n Adding to its problems was the fact that movie theater chains like AMC and Cinemark began to  roll out their own ticket subscription services, causing MoviePass to add new fees to the biggest films and prime time slots. In September 2019, it  shut down indefinitely, with its parent company  filing for bankruptcy four months later.", "posttime": "2022-02-13 12:47:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "relaunching", "title": "MoviePass正在重新启动，它想追踪你的眼球", "title_en": "MoviePass is relaunching – and it wants to track your eyeballs", "transed": 1, "url": "https://nypost.com/2022/02/10/moviepass-is-back-and-its-going-to-track-your-eyeballs/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072857, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现代文化正在经历一场真正热爱旅行的痛苦。它已经成为我们时代精神的一个核心元素，一个过着充实、不平凡生活的主要信条。无论你走到哪里，无论遇到什么样的困境，旅行都是解决问题的良方。\n不知道大学毕业后想做什么？请一年假去旅行。\n感觉不安，对生活感到厌倦？开始一场史诗般的环球冒险。\n旅行不仅是治愈我们疾病的万灵药，也是构建生活其他要素的目标。这种想法认为，不要生孩子，因为他们会阻碍你旅行的能力。为自己工作，创造被动收入，这样你就可以随时随地去异国他乡。\n在一个相对安全和繁荣的时代，在一个缺乏许多内在挑战和困难的社会里，旅行已经成为一种冒险的方式，展示一种勇气——一种世界性的勇气，在这种勇气中，一个人冒险进入陌生的领域，经历一段成长的仪式，成为一个开明的全球公民。\n因此，旅行既被视为个人发展的工具，也被视为几乎利他的道德良善。\n简言之，随着指导和身份认同的旧宗教来源的消失，一种“旅行崇拜”已经取代了它们。\n但我们对旅行的信心是否合理？还是我们迫使它承担比它应该承担的更重的期望？\n如果说旅行已经发展成为一种崇拜，那么它的神圣文本之一肯定是J.R.R.托尔金的《霍比特人》。很多人（包括我们自己）都引用了这个阴谋与现代人应该努力摆脱无聊、传统生活的轨道，走出去看世界的方式类似：比尔博过着安全、舒适、资产阶级的生活，舒适地生活在他木质镶板、壁炉加热、储备充足的霍比特人洞穴中，直到他被一群矮人拖着去冒险。他经历了一场他从未意识到自己拥有的伟大召唤，展示了勇气和领导力，发展了自己的观点，最终以一个改变了的霍比特人回到了他的郊区郡。这里，似乎是一个现代的、驯化的、由无人机变成的世界旅行者的故事，在幻想的王国里表演。\n将这本书视为旅行的灵感可能会让许多人信服。但这并没有改变一个突出例外的行为：作者本人。\n托尔金自己的生活是一种安静、平凡、一成不变的家庭生活。他住在一系列简朴、非常传统的郊区住宅中，并以教授、丈夫和父亲的身份生活。托尔金典型的一天包括和孩子们一起骑自行车（他一生中大部分时间都没有车）参加清晨弥撒，在牛津彭布罗克学院讲课，回家吃午饭，辅导学生，和家人一起喝下午茶，在花园里闲逛。晚上，他会做一些写作，给其他大学的考试打分以赚取额外的钱，或者参加Inklings，一种文学俱乐部。他很少旅行，几乎从来没有出国过。当他度假时，他带着家人去了英格兰海岸非常传统的旅游胜地。\n从20多岁的托尔金在一战中服役，到霍比特人和指环王在中年取得成功，托尔金没有发生什么重大或真正激动人心的事情，即使他的书成为国际畅销书，他的生活方式也几乎完全一样。\n“我其实是霍比特人，”他承认，“我喜欢花园、树木和未经机械化的农田；我抽烟斗，喜欢美味的素菜（未冷冻），但讨厌法国菜；我喜欢，甚至敢在这些枯燥的日子里穿装饰性的马甲。我喜欢蘑菇（来自田野）；有一种非常简单的幽默感（就连我那些欣赏我的评论家也觉得无聊）；我晚睡晚起（如果可能的话）。我不常旅行。\"\n托尔金富有想象力的作品和他的家庭生活之间的并列关系，在他1944年给儿子的一份简短报告中得到了很好的概括，其中一份报告讲述了他在写《指环王》时取得的进展：“我写了一两个小时的文章，几乎把佛罗多带到了魔多的门口。下午割草。下周开学，威尔士论文的校样已经来了。不过，我会在每一个可以挽救的时刻继续‘敲响’的。”\n那么，我们如何理解这样一个事实：一个过着如此狭隘、有限、传统生活的人，也创作了史诗般、广阔的冒险作品，其中充满了人物，他们离开了普通的生物舒适，开始了伟大、冒险、具挑战性的任务？\n托尔金是个伪君子吗？他的书仅仅是一种愿望实现的形式，一个在幻想中生活的机会吗？他太胆小了，在自己的生活中做不到这些事情？\n如果你明白托尔金真正想用他的故事做什么，以及他认为最重要的冒险是什么，你就不会知道了。\n除了个人生活之外，托尔金塑造霍比特人形象的部分原因是他同胞的一般性格。正如他对一位采访者所说，“霍比特人只是土生土长的英国人，身材矮小是因为他们的想象力一般都很小，而不是他们的勇气或潜在力量（我的强调）的小范围。”\n托尔金从不怀疑他的邻居们的身体勇气——在第一次世界大战的战壕中，他亲眼目睹了应征士兵的坚韧不拔。当被要求挺身而出时，他们表现得非常出色，毫无保留。\n事实上，托尔金把这种勇气视为霍比特人的决定性特征之一。当他的儿子克里斯托弗在第二次世界大战期间为皇家空军驾驶飞机，焦急地面对致命的风险和可怕的敌人时，他鼓励他“牢记你的霍比特精神！”\n不，托尔金认为普通霍比特人或英国人所缺乏的不是勇气，而是一种完全活跃的想象力——接受新思想和观点的欲望，抛弃现状，踏上信仰、个人成长和道德挑战的旅程。\n对托尔金来说，这个世界上没有任何东西——不是它的文化、知识、假设和期望，也不是它的岩石、树木和人——完全像它看起来的那样。诗人P.B.雪莱所说的“熟悉的面纱”背后隐藏着其他层次和维度。虽然这些领域通常无法用眼睛看到，但它们是通过渴望更多东西的痛苦感受到的——偶尔的、转瞬即逝的感觉，即将迎来更伟大的东西。\n托尔金觉得，没有足够的人有足够的想象力去认真考虑这个想法，也没有勇气去追随他们对事物的渴望。普通人就像霍比特人的巴金斯家一样，你知道他“在任何问题上都会说些什么，而不必问他。”大多数人不会试图在另一个意义领域拉开帷幕——他们不会费心去穿透传统的、舒适的、受人尊敬的事物方式概念，以便发现更深层次的真理。\n对托尔金来说，这些重要的真理包括这样一个观点：所有的生命——无论是在郊区还是在真实的战场上——构成了一场史诗般的、英雄般的善与恶、黑暗与光明的冲突；每个人的选择，无论他们是多么“渺小”，都很重要；每个人的小故事都是更大的宇宙叙事的一部分。每个人都有自己的角色和朝圣之旅——不一定是一次身体上的旅行，而是一次道德和精神上的旅行。\n托尔金进一步认为，阅读神话是开启这一旅程最可靠的方式之一。在神话中，我们可以找到关于我们是谁、我们如何来到这里以及我们能做什么的奇妙解释。托尔金认为，这样的故事充满了带有大写字母T的真理回声——“对潜在现实的突然一瞥”，比任何严格的事实都真实。一个好的神话，在脱离现实的过程中，自相矛盾地帮助我们重新发现它——提醒我们，在我们日常生活的平淡和忙碌之下，隐藏着英雄和神话的潜力。\n正是因为这个原因，托尔金希望发展自己的神话，并在《霍比特人》和他的其他作品中成功地做到了这一点。比尔博的冒险经历比页面上描述的外部景观和敌人要深刻得多；他是一次穿越史诗般神话世界的朝圣之旅，在这个世界中，他与黑暗势力作战，发现自己的命运，正如《比尔博之旅》的作者所说，他经历了一场“从智慧到无知，从资产阶级堕落到英雄美德的仪式”\n通过替代性地、富有想象力地追随比尔博的追求，读者最终走上了自己的往返之旅。正如托尔金的朋友C.s.刘易斯（C.s.Lewis）在他对《霍比特人》（The Hobbit）的评论中所写的那样，这个故事向读者承认了一个“对他来说变得不可或缺的世界……在你去那里之前，你无法预知它，因为一旦你去了，你就无法忘记它”\n刘易斯和托尔金都坚信“童话故事”的力量，正如托尔金所说，它能提供“我们从未有过的感觉，并扩大我们对可能体验范围的概念”刘易斯解释了富于想象力的故事对读者的影响：“童话世界唤起了人们对他所不知道的东西的渴望。它搅动和困扰着他（使他终生受益）对他无法触及的事物的模糊感觉，不仅没有使现实世界变得迟钝或空虚，反而赋予了它一种新的深度。他并不鄙视真正的森林，因为他读过魔法森林：阅读使所有真正的森林都有点魔法。\"\n换句话说，像《霍比特人》这样的书不一定是为了激励人们去遥远的地方旅行，而是为了让我们眼前熟悉的环境恢复新鲜感。一旦你发现了通往远方王国的大门，你就可以通过神话的视角来观察世界，并发现即使在霍比特人洞穴的墙壁内也有隐藏的维度。一旦你去过那里又回来，你的观点就会永远改变；你开始看到事物的本来面目。从公寓外的风景到上班路上的交通，一切都变得更有意义，甚至神奇。\n托尔金可以在他想要的任何时候跨过这个门槛，尽管他有着资产阶级的生活方式，这是他区别于其他“霍比特人”的原因这就是为什么他忽视了物质旅行的诱惑。正如他的一位传记作者所说，“他的想象力不需要被陌生的风景和文化所激发”；他可以简单地坐在办公桌前，立即开始探索中土世界的地形，这就解释了为什么他“并不完全在乎自己身在何处”对托尔金来说，他的家常，无论多么熟悉，始终保持新鲜。\n托尔金沉浸在想象中并不是对现实的逃避，而是对现实的重新体验。他比大多数人都更清楚地看到，即使是最普通的生活，也充满了史诗般的任务、痛苦的冲突，以及在勇气与同情、贪婪与自私之间做出的英勇选择。因此，尽管他的生活范围“狭窄”，但人们不禁会觉得，比起那些在Instagram上贴满环球旅行照片的人，他的生活要广阔得多。\n托尔金所理解的是，当涉及到生命中最重要的旅程——灵性、自我发现和自我掌握的探索——时，地点是无关紧要的。\n事实上，我们的外在旅行会抑制我们的内在旅行。“因为我测量的是向内的距离，而不是向外的距离。在一个人肋骨的指南针内，有足够的空间和场景来写任何传记。”——亨利·大卫·梭罗\n当然，当旅行被赋予适当的份量，被剥夺了不应有的道德意义、夸大的力量和过高的期望时，旅行绝对没有错。\n这些期望的重新校准始于承认旅行本身没有任何价值。与之相关的好处，比如有机会扩展一个人的视角，成熟起来，并学会如何处理不确定性，当然是真实的，但不会仅仅通过从A点移动到B点而自动累积。如果是这样的话，《吃、祈祷、爱》的作者，她开始了她的环球冒险——古怪而自恋，她本可以以一个更好的人结束她的旅程，但——剧透警告——她似乎也同样沉迷于旅程的结束。\n旅行的价值只有那些以正确的心态和预先存在的自给自足参与其中的人才能获得——这些品质可以在任何地方发展，必须在出发前形成。\n许多人希望旅行能帮助他们改变或发现自己，但如果你不能成为你想成为的人，那么当你在5000英里之外时，你就无法做到。因为，当然，无论你去哪里，你都会带着自己。正如拉尔夫·沃尔多·爱默生（Ralph Waldo Emerson）所说，那些对自己的生活不满意的人，在异域和古老的土地上寻找满足感，只携带“废墟到废墟”：“正是由于缺乏自我文化，旅行的迷信——其偶像是意大利、英格兰、埃及——对所有受过教育的美国人都保持着吸引力。那些让英格兰、意大利或希腊在想象中受到尊敬的人，是通过像地轴一样坚守原处而做到这一点的。在男人的时间里，我们觉得责任是我们的位置。在灵魂不是旅行者；智者呆在家里，当他的必需品、他的职责、任何时候从家里或到外国来拜访他时，他都在家里，通过他的表情，他会使人们明白，他是智慧和美德的传教士，像君主一样访问城市和人，而不是像闯入者或仆人一样。\n我并不粗暴地反对为了艺术、学习和慈善的目的环游地球，使人首先被驯化，或者不带着寻找比他所知道的更伟大的东西的希望出国。旅行是为了消遣，或是为了得到一些他没有携带的东西，他会远离自己，甚至在年轻时也会在古老的事物中变老。在底比斯，在帕尔米拉，他的意志和思想随着时间的推移变得陈旧和破败。他把一片废墟带到另一片废墟。\n旅行是傻瓜的天堂。我们的第一次旅行发现，我们对各个地方都漠不关心。在家里，我梦想在那不勒斯，在罗马，我能陶醉于美丽，失去悲伤。我收拾行李，拥抱我的朋友，踏上大海，最后在那不勒斯醒来，在我身边是一个严峻的事实，一个悲伤的自我，无情的，一模一样的，我逃离了。我寻找梵蒂冈和宫殿。我喜欢陶醉于风景和建议，但我并不陶醉。无论我走到哪里，巨人都会跟着我。\"\n或者正如斯多葛派哲学家塞内卡在两千年前所观察到的那样：“[旅行者]一次又一次的旅行，换一个场景。正如卢克雷修斯所说，“每个人都是这样逃离自己的。”但如果他不逃离自己，那又有什么目的呢？他把自己当作自己最乏味的伙伴来追求和追求。因此，我们必须认识到，我们的困难不是地方的错，而是我们自己的错。\"\n那些为了寻找他们所缺少的东西而旅行的人发现，无论是什么阻碍了他们在家里获得这些东西，当他们着陆时，都会在机场等着他们。\n如果一个人觉得不去旅行就无法找到自己或成就感，那么他们肯定知道自己是带着错误的心态出发的——那就是说，“如果我有/做了X，一切都会改变。”正是这种心态让你觉得，如果你找到了正确的饮食，你就会减肥；如果你刚刚得到了正确的组织应用程序，你会做得更多；如果你找到了一份薪水更高的工作，你会很高兴的。在这种情况下，你实际上并不是在寻找一种工具来启动你的目标，而是为了分散你的注意力，根本不必去努力实现它。\n如果你在探索自己的后院时找不到令人满意的冒险经历，你就不会在欧洲背包旅行中找到持久的满足感。如果你不能在郊区创造丰富的内心生活，你就不能在印度的道场中发展。如果你在熟悉的事物中找不到新鲜感，在自我控制、灵性和美德的追求中找不到满足感，那么一个夏天的环球跋涉并不能最终将你从空虚乏味的生活中拯救出来。\n旅行通常被描述为一种勇气的锻炼，以及那些永远好奇的人的努力。然而，它也可以成为恰恰相反的借口。需要旅行的结构来寻找刺激和冒险，这表明缺乏想象力，而不是丰富的想象力。如果旅行被用来逃避正常生活中的混乱、失望和不足，而不是直面它们，那么没有什么比这更懦弱了。\n旅行给人的感觉和托尔金所热衷追求的一样，都是在某种奇怪而美妙的事物的门槛上——存在于一种介于两者之间的极限状态——但它的效果更为短暂，无法超越自身指向更伟大的事物。旅行者在出发时没有预先存在的自我认识和性格结构，而是打算在途中找到它，这就像一个筛子；当他旅途中产生的渴望升起时，它们就穿过他。在这次旅行中，他感到精力充沛、目标明确、充满动力，正在走向更大更好的道路。\n一旦他回到家，这些感觉就会枯竭，只有进行另一次远足，并再次受到旅游热潮的冲击，才能重新焕发活力。入门体验，而不是通往更大事物的大门，只会变成一个重复的循环，一系列空白的护照印章。\n因此，旅行应该以健康的浪漫关系的方式进行。与其寻找一个能满足你所有欲望的伴侣，不如让你自己成为一个完全实现的人。而不是寻找你的爱人来完成你，他们只是扩展和增强你已经开发的坚固的自我基础。\n同样地，旅行不应该被视为一种神奇的药丸、万灵丹、个人发展所必需的东西，而应该被视为那些已经过着有目的、充实生活的人的一种可选的充实——一种引人入胜的消遣，一种像任何其他爱好一样的爱好，有些人喜欢，而不是所有人都喜欢。\n旅行永远不应该是逃避生活；只是它的一个增强。“我们的四肢有足够的空间，但在角落里生锈的却是我们的灵魂。让我们不间断地向内部迁移，每天把帐篷搭得更靠近西方的地平线。”——亨利·大卫·梭罗\n如今，一个人旅行的次数被视为一种试金石：你旅行的次数越多，你的生活就越勇敢、有文化，也越不传统；你旅行的次数越少，你的生活就越被认为是无聊、传统和狭隘的。\n但这条线并不是那么容易画出来的。一个游历过每一个大陆的人，他的灵魂可能像指甲上的划痕一样浅，而一个从未离开过家乡的人，他的灵魂可能比海沟还要深；一个人的仪表图上满是古代遗迹和海边夕阳的图像，他对生活的可能性可能有着极其有限的看法，而一个没有护照印章的人却培养了一种开阔而深远的思维；勇敢地在世界各地冒险的人可能会害怕直面自己和与普通人搏斗，而在家舒适的人则勇敢地直面自己是谁以及自己的人生成就。\n但即使你想成为一个旅行像我一样的人\n......", "note_en": "Modern culture is in the throes of a real love affair with travel. It’s become a central element of our zeitgeist, a main tenet in living a fulfilled, non-pedestrian life. Everywhere you turn, and no matter the dilemma, travel is offered as the cure.\n Don’t know what you want to do after graduating college? Take a year off to travel.\n  Feeling restless and generally bored with life? Set off on an epic adventure around the globe.\n Travel isn’t just framed as a cure-all for what ails us, either, but as a goal around which to build the other elements of one’s life. Don’t have children, the thinking goes, because they’ll hinder your ability to travel. Work for yourself and create passive income, so you can jaunt off to exotic locales whenever you want.\n In a relatively safe and prosperous time, in a society that lacks many built-in challenges and hardships, travel has become  the way to have an adventure, to demonstrate a kind of bravery — a cosmopolitan courage where one ventures into unfamiliar territory and undergoes a rite of passage to become an enlightened global citizen.\n Travel is thus seen as both a tool of personal development and an almost altruistic moral good.\n In short, as the old religious sources of guidance and identity have fallen away, a kind of “cult of travel” has developed in their place.\n But is our faith in travel justified? Or have we forced it to bear the weight of far heavier expectations than it should be made to carry?\n If travel has developed into a kind of cult, one of its sacred texts is surely   The Hobbit by J.R.R. Tolkien. The plot has been cited by many ( including ourselves!) as a parallel to the way moderns should strive to escape the orbit of a boring, conventional life and get out and see the world: Bilbo lives a safe, comfortable, bourgeoisie existence, snug in his wood-paneled, fireplace-heated, well-stocked hobbit hole, until he is fairly dragged along on an adventure by a bunch of dwarves. He experiences a call to greatness he never knew he possessed, demonstrates courage and leadership, grows his perspective, and eventually returns to his suburban shire a changed hobbit. Here, it seems, is the story of the modern, domesticated, drone-turned-world-traveler, acted out in the realm of fantasy.\n Seeing the book as inspiration to travel may work convincingly for many. But it didn’t move the behavior of one prominent exception: the author himself.\n Tolkien’s own life was one of quiet, ordinary, unvarying domestic routine. He lived in a series of modest, very conventional suburban homes, and spent his days as professor, husband, and father. A typical day for Tolkien consisted of bicycling (he didn’t own a car for most of his life) with his children to early morning Mass, lecturing at Oxford’s Pembroke College, coming home for lunch, tutoring students, having an afternoon tea with his family, and puttering around the garden. In the evenings he’d do some writing, grade exams from other universities to earn extra money,  or attend the Inklings, a kind of literary club. He rarely traveled, almost never went abroad, and when he did vacation, he took his family to thoroughly conventional, thoroughly touristy resorts along the English coast.\n Between serving in WWI as a 20-something and the success of  The Hobbit and  The Lord of the Rings in middle-age , nothing major or really exciting happened to Tolkien, and even after his books became international bestsellers, his lifestyle remained almost entirely the same.\n “I am in fact a Hobbit,” he admitted, “in all but size”: “I like gardens, trees, and unmechanized farmlands; I smoke a pipe, and like good plain food (unrefrigerated), but detest French cooking; I like, and even dare to wear in these dull days, ornamental waistcoats. I am fond of mushrooms (out of a field); have a very simple sense of humour (which even my appreciative critics find tiresome); I go to bed late and get up late (when possible). I do not travel much.”\n The juxtaposition between Tolkien’s imaginative work and his domestic routine is encapsulated well in one of the short reports he sent his son in 1944 on the progress he was making writing  The Lord of the Rings: “I managed to get an hour or two’s writing, and have brought Frodo nearly to the gates of Mordor. Afternoon lawn-mowing. Term begins next week, and proofs of Wales papers have come. Still I am going to continue ‘Ring’ in every salvable moment.”\n So what do we make of the fact that a man who lived such a narrow, limited, conventional life, also produced works featuring epic, expansive adventures filled with characters who leave behind their ordinary creature comforts to embark on great, risky, challenging quests?\n Was Tolkien a hypocrite? Were his books merely a form of wish-fulfillment, a chance to live out in fantasy the kinds of things he was too timid to enact in his own life?\n Not if you understand what Tolkien was truly trying to do with his stories, and what he considered the most important kind of adventure.\n Part of what inspired Tolkien’s characterization of hobbits, besides his personal life, was the general character of his fellow countrymen. As he told one interviewer, “The Hobbits are just rustic English people, made small in size because it reflects the generally small reach of their imagination —  not the small reach of their courage or latent power [emphasis mine].”\n Tolkien never doubted that his neighbors had physical courage in spades — in the trenches of WWI, he had witnessed the steadfastness of enlisted soldiers firsthand. When asked to rise to the occasion, they did so splendidly and without reservation.\n Tolkien in fact saw such courage as one of the defining characteristics of hobbits. When his son Christopher was flying planes for the Royal Air Force during the Second World War and anxiously faced deadly risk and fearsome enemies, he encouraged him to “Keep up your hobbitry in heart!”\n No, the thing Tolkien thought the average hobbit, or Englishman, lacked was not bravery, but a thoroughly vitalized imagination — the desire to entertain new ideas and perspectives, to leave behind the status quo and take a journey of faith, personal growth, and moral challenge.\n For Tolkien, nothing in this world — not its culture, knowledge, assumptions, and expectations, nor its rocks, trees, and people — was entirely as it seemed. Hidden behind what the poet P.B. Shelley called “the veil of familiarity” existed other layers and dimensions. While such realms cannot normally be seen with the eye, they are sensed through poignant pangs of longing for something more — the occasional, fleeting feeling of being on the threshold of something greater.\n Not enough people, Tolkien felt, had the imagination to consider this idea seriously, nor the courage to follow their longing beyond the surface of things. The average bloke was like the Bagginses of  The Hobbit, where you know what he “would say on any question without the bother of asking him.” Most folks don’t attempt to draw back the curtain on another realm of meaning — can’t be bothered to penetrate the conventional, comfortable, respectable notions of the way things are in order to discover deeper truths.\n For Tolkien, those important truths included the idea that all of life — whether in suburbia or on an actual battlefield — constitutes an epic, heroic clash between good and evil, dark and light; that everyone’s choices, no matter how “little” of a person they are, matter; and that each individual’s small story is part of a larger, cosmic narrative. Everyone has a part to play and a pilgrimage to make — not necessarily a physical journey, but a moral and spiritual one.\n Tolkien further believed that reading myths was one of the surest ways to begin such a journey. In myths one finds fantastical explanations of who we are, how we got here, and what we’re capable of. Such stories, Tolkien held, are filled with echoes of Truth with a capital T – “a sudden glimpse of the underlying reality” that was truer than anything strictly factual. A good myth, in departing from reality, paradoxically helps us rediscover it — reminding us that beneath the blandness and busyness of our day-to-day lives, lies heroic and mythic potential.\n It’s for this reason Tolkien wished to develop his own mythology, and successfully did so in  The Hobbit and his other works. Bilbo takes an adventure that runs much deeper than the external landscapes and enemies described on the page; his is a pilgrimage through an epic mythological world in which he battles the forces of darkness, discovers his destiny, and, as the author of   Bilbo’s Journey puts it, undergoes, a “rite of passage from wisdom to ignorance and from bourgeois vice to heroic virtue.”\n By vicariously and imaginatively following along on Bilbo’s quest, the reader ends up taking a there-and-back-again journey of his own. As Tolkien’s friend C.S. Lewis wrote in his review of  The Hobbit, the story admits the reader to a world that “becomes indispensable to him…You cannot anticipate it before you go there, as you cannot forget it once you have gone.”\n Both Lewis and Tolkien believed ardently in the power of “fairy stories” to, as the latter put it, offer “sensations we never had before, and enlarge our conception of the range of possible experience.” Lewis explained the effect of imaginative tales on the reader:  “Fairy land arouses a longing for he knows not what. It stirs and troubles him (to his life-long enrichment) with the dim sense of something beyond his reach and, far from dulling or emptying the actual world, gives it a new dimension of depth. He does not despise real woods because he has read of enchanted woods: the reading makes all real woods a little enchanted.”\n In other words, books like  The Hobbit are not necessarily supposed to inspire trips to far-flung lands, but rather to restore the freshness of familiar surroundings right in front of our faces. Once you discover this doorway to realms beyond, you’re able to see the world through a mythological lens, and find that there are hidden dimensions even within the walls of one’s hobbit hole. Once you’ve been there and back again, your perspective is forever changed; you begin to see things as they  really are. Everything from the view outside your apartment to your commute to work can become more meaningful, even magical.\n That Tolkien could step through this threshold whenever he desired, his otherwise bourgeoisie lifestyle notwithstanding, is what set him apart from other “hobbits.” And it is what accounts for his obliviousness to the allure of physical travel. As  one of his biographers put it, “his imagination did not need to be stimulated by unfamiliar landscapes and cultures”; that he could simply sit down at his desk and immediately begin exploring the terrain of Middle-earth explains why he “did not altogether care very much where he was.” For Tolkien, his domestic routine, no matter how familiar, remained perennially fresh.\n Tolkien’s immersion in his imagination did not represent an escape from reality, but a reacquaintance with it. He saw clearer than most the way in which even the most ordinary life is filed with epic quests, wrenching conflicts, and the heroic choice between courage and compassion, and greed and selfishness. So that despite the “narrow” scope of his life, one cannot help feeling it was far more expansive than those who fill their Instagram profiles with photos of their globe-trotting travels.\n What Tolkien understood is that when it comes to life’s most important journeys — quests of spirituality, self-discovery, and self-mastery — location is irrelevant.\n  In fact, our outer journeys can inhibit our inner ones.  “For I measure distance inward and not outward. Within the compass of a man’s ribs there is space and scene enough for any biography.” –Henry David Thoreau\n Certainly there is absolutely nothing wrong with travel when it’s given its proper weight and is stripped of undue moral significance, exaggerated powers, and inflated expectations.\n The recalibration of those expectations begins with the acknowledgement that there is nothing  inherently valuable about travel. The benefits associated with it, like the chance to expand one’s perspective, grow in maturity, and learn how to handle uncertainty, are certainly real, but do not automatically accrue simply by moving from point A to point B. If they did, the author of  Eat, Pray, Love, who began her globe-trotting adventure flaky and narcissistic, would have ended her trip a better person, and yet — spoiler alert — she seems no less self-absorbed by the journey’s end.\n The value that can be derived from travel only comes to those who engage it with the right mindset and a preexisting self-sufficiency — qualities that can be developed anywhere, and must be formed  before you start out.\n Many people hope that traveling will help them change or find themselves, but if you can’t become the person you want to be right where you are, then you won’t be able to do it when you’re 5,000 miles distant. Because, of course, wherever you go, you bring yourself along with you. As Ralph Waldo Emerson put it, folks who are unhappy with their lives, and look for fulfillment in exotic and ancient lands, merely carry “ruins to ruins”: “It is for want of self-culture that the superstition of Travelling, whose idols are Italy, England, Egypt, retains its fascination for all educated Americans. They who made England, Italy, or Greece venerable in the imagination did so by sticking fast where they were, like an axis of the earth. In manly hours, we feel that duty is our place. The soul is no traveller; the wise man stays at home, and when his necessities, his duties, on any occasion call him from his house, or into foreign lands, he is at home still, and shall make men sensible by the expression of his countenance, that he goes the missionary of wisdom and virtue, and visits cities and men like a sovereign, and not like an interloper or a valet.\n I have no churlish objection to the circumnavigation of the globe, for the purposes of art, of study, and benevolence, so that the man is first domesticated, or does not go abroad with the hope of finding somewhat greater than he knows. He who travels to be amused, or to get somewhat which he does not carry, travels away from himself, and grows old even in youth among old things. In Thebes, in Palmyra, his will and mind have become old and dilapidated as they. He carries ruins to ruins.\n Travelling is a fool’s paradise. Our first journeys discover to us the indifference of places. At home I dream that at Naples, at Rome, I can be intoxicated with beauty, and lose my sadness. I pack my trunk, embrace my friends, embark on the sea, and at last wake up in Naples, and there beside me is the stern fact, the sad self, unrelenting, identical, that I fled from. I seek the Vatican, and the palaces. I affect to be intoxicated with sights and suggestions, but I am not intoxicated. My giant goes with me wherever I go.”\n Or as the Stoic philosopher Seneca observed two-thousand years ago: “[Travelers] make one journey after another and change spectacle for spectacle. As Lucretius says, ‘Thus each man flees himself.’ But to what end if he does not escape himself? He pursues and dogs himself as his own most tedious companion. And so we must realize that our difficulty is not the fault of the places but of ourselves.”\n Those who travel in search of something they lack, find that whatever was holding them back from attaining it at home, is waiting for them at the airport when they land.\n If one feels that they cannot find themselves or fulfillment without making a certain trip, then they may know for certain that they are setting out with the wrong mindset — the one that says, “ If I just had/did X, everything would change.” It’s the same mindset that makes you feel that if you just found the right diet, you’d lose weight; if you just got the right organizing app, you’d get more done; if you just got a better paying job, you’d be happy. In such cases, you’re not actually looking for a tool to kick-start your goal, but a  distraction from having to work on it at all.\n If you can’t  find satisfying adventure in exploring your own backyard, you won’t discover long-lasting satisfaction backpacking through Europe. If you can’t create a rich inner life in suburbia, you won’t develop one in the ashrams of India. If you can’t find freshness in the familiar, and fulfillment in the quests of self-mastery, spirituality, and virtue, then a summer’s trek around the globe won’t ultimately save you from a life of empty dullness.\n  Travel is often framed as an exercise in courage, and the endeavor of the perennially curious. And yet it can also be an excuse for the exact opposite. Needing the structure of a trip to find excitement and adventure shows a lack of imagination, rather than an abundance of it. And in cases where travel is used to flee the mess, disappointments, and deficiencies of one’s normal life, rather than facing them head on, nothing is more cowardly.\n  Travel offers the same feeling of being on the threshold of something strange and wonderful — of existing in an in-between liminal state — that Tolkien was so fond of seeking, but its effect is more temporary, and fails to point beyond itself to something greater. The traveler who embarks without a preexisting structure of self-knowledge and character, intending instead to find it along the way, is set up like a sieve; when the longings produced by his journey arise, they pass right through him. During the trip itself, he feels invigorated, purposeful, full of momentum, and on the path to bigger and better things.\n  Once he arrives back home, these feelings dry up, and can only be reinvigorated by undertaking another excursion, and getting another hit of the travel rush. The threshold experience, rather than being a doorway to greater things, merely turns into a cycle of its own duplication, an empty series of passport stamps.\n Travel then, should ideally be approached the way one does a healthy romantic relationship. Rather than looking for a partner who will fulfill all your desires, you arrive as a fully realized person yourself. Instead of looking for your lover to complete you, they simply expand and enhance the robust foundation of self you’ve already developed.\n In the same way, travel should be seen not as a magic pill, a cure-all, something necessary to your personal development, but an optional enrichment for those  already living purposeful, fulfilled lives — an engaging pastime, a hobby like any other, enjoyed by some, and not by all.\n Travel should never be an escape from life; only an enhancement of it.  “Our limbs have room enough but it is our souls that rust in a corner. Let us migrate interiorly without intermission, and pitch our tent each day nearer the western horizon.” –Henry David Thoreau\n How much one travels is presented these days as a kind of litmus test: the more you travel, the more courageous, cultured, and non-conventional your life is taken to be; the less you travel, the more your life is assumed to be boring, conventional, and narrow.\n But the lines are not so easily drawn. A man who’s visited every continent may have a soul as shallow as a thumbnail scratch, while a man who’s never left his hometown may have a spirit deeper than an oceanic trench; the man whose Instragram profile is filled with images of ancient ruins and beachside sunsets may have an extremely limited view of life’s possibilities, while the man who lacks a single passport stamp has cultivated an expansive and far-reaching mind; the man who’s bravely ventured across the globe may be frightened stiff of facing himself and grappling with the ordinary, while the man who’s snug at home has bravely faced up to exactly who he is and what his life has amounted to.\n   But even if you wish to be a man whose travels are as ric\n......", "posttime": "2022-02-13 12:38:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "霍比特,travel,旅行", "title": "反对对旅行的狂热，或者反对每个人对霍比特人的误解", "title_en": "Against the Cult of Travel, or What Everyone Gets Wrong About the Hobbit", "transed": 1, "url": "https://www.artofmanliness.com/living/leisure/against-the-cult-of-travel-or-what-everyone-gets-wrong-about-the-hobbit/", "via": "", "real_tags": ["霍比特", "travel", "旅行"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072856, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿（美联社）-过去一年，通货膨胀率飙升至40年来的最高水平，打击了美国消费者，抵消了加薪，强化了美联储开始在整个经济体提高借贷利率的决定。\n劳工部周四表示，上个月消费者价格同比上涨7.5%，为1982年2月以来的最大同比涨幅。\n12月至1月的通胀率为0.6%，与上月持平，高于经济学家的预期。价格从10月到11月上涨了0.7%，从9月到10月上涨了0.9%。\n物资和工人短缺、大量联邦援助、超低利率和强劲的消费支出加在一起，导致通货膨胀在过去一年急剧上升。而且几乎没有迹象表明它会在短期内显著放缓。\n工资正在以至少20年来最快的速度上涨，这可能会迫使企业提高价格以弥补更高的劳动力成本。港口和仓库人满为患，上个月，美国最繁忙的港口洛杉矶和长滩的数百名工人因病外出。因此，许多产品和零件仍然供不应求。\n最新的通胀数据向一些经济学家暗示，美联储可能会在3月份将其关键利率上调0.5个百分点，而不是通常的25个百分点。\n圣路易斯联邦储备银行（St.Louis Federal Reserve Bank）行长詹姆斯·布拉德（James Bullard）对彭博社（Bloomberg News）表示，他支持在7月前大幅提高基准短期利率整整一个百分点。\n随着时间的推移，更高的利率将提高从抵押贷款、信用卡到汽车和商业贷款等各种借贷的成本。这可能会冷却支出和通胀，但对美联储来说，稳步收紧信贷的决定也可能引发另一场衰退。\n美联储主席杰罗姆·鲍威尔（Jerome Powell）两周前表示，央行今年可能会多次上调基准短期利率。\n通胀报告公布后，股价下跌，布拉德的言论后，股价进一步下跌。广泛的S&amp；下午交易中，P500指数下跌1.3%。10年期国债收益率跃升至2.03%，这表明投资者预计美联储将进一步加息。\n从12月到1月，各种商品和服务的价格都在上涨——不仅仅是直接受疫情影响的商品。1月份，公寓租金上涨0.5%，为20年来最快增速。仅1月份，电价就飙升了4.2%，为15年来的最大涨幅，较上年同期上涨了10.7%。上个月，家庭家具和用品价格上涨1.6%，创下1967年以来最大单月涨幅。\n由于鸡蛋、谷物和乳制品价格上涨，食品成本在1月份上涨了0.9%。由于电脑芯片短缺，新车价格在疫情期间大幅上涨，上个月没有变化，但比一年前上涨了12.2%。新车价格的飙升反过来加速了二手车价格；今年1月，该指数上涨了1.5%，与去年同期相比，上涨了令人眩晕的41%。\n富国银行（Wells Fargo）经济学家莎拉·豪斯（Sarah House）说，“随着一些地区的价格压力缓解，经济其他地区的通货膨胀”正在加剧。“结果是，通胀可能会维持在令人不安的高位。”\n物价的稳步上涨使许多美国人负担不起食物、汽油、房租、儿童保育和其他必需品。更广泛地说，随着今年晚些时候中期选举的临近，通货膨胀已成为经济的最大风险因素，并对乔·拜登总统和国会民主党人构成严重威胁。\n考特尼·勒基（Courtney Luckey）是在食品和汽油价格更高的情况下苦苦挣扎的美国人之一，她改变了购物习惯，并在她居住的北卡罗来纳州夏洛特的一家杂货店加班。\n33岁的勒基过去能以100美元的价格装满一辆购物车。现在，她说，100美元只占了一半的购物车。西红柿已经涨到了将近每磅5美元，“我觉得这太荒谬了。”勒基已经改用罐装西红柿，并开始使用家庭美元和食物狮子的优惠券。\n为了帮助支付账单，她还在哈里斯·蒂特杂货店花了更多的时间。但是商店离她家只有30分钟的路程，所以她不得不花更多的钱买汽油。\n她被迫增加的所有支出导致勒基减少了与女儿、哥哥和两个儿子一起参加保龄球等家庭活动。这些郊游现在通常每月一次，而不是每一两周一次。\n在过去的一年里，汽油、食品、汽车和家具成本的急剧上涨也颠覆了许多其他美国人的预算。十二月，宾夕法尼亚大学沃顿商学院的经济学家估计，普通家庭不得不花费超过2020美元的3500美元来购买相同的商品和服务篮子。\nGaspachos在萨克拉门托出售水果杯、冰沙和咖啡，其所有者胡里奥·奥尔蒂斯说，他在11月份平均不得不提高6%左右的价格。一些商品的价格上涨了10%。\n“我们看到水果、蔬菜、杯子和盘子的价格飙升，”他说。他的公司使用可堆肥包装，但其中大部分来自海外，并被困在尚未卸货的船只上。\n即使不包括波动的食品和能源价格，所谓的核心通货膨胀率从12月到1月上涨了0.6%，比一年前上涨了6%。\n许多大公司在与投资者的电话会议上表示，他们预计供应短缺至少会持续到今年下半年。\nChipotle表示，为了抵消牛肉和运输成本的上涨以及员工工资的上涨，菜单价格上涨了10%。餐饮连锁店表示，如果通货膨胀持续上升，它将考虑进一步的价格上涨。\n该公司首席财务官约翰·哈东（John Hartung）说：“我们一直认为牛肉价格会先涨后跌，但这还没有发生。”。\nChipotle、星巴克和其他一些面向消费者的公司的高管都表示，到目前为止，他们的客户似乎没有被更高的价格所困扰。\n列维·斯特劳斯；由于包括劳动力在内的成本上升，该公司去年将价格提高了约7%，高于2019年的水平，并计划今年再次这样做。即便如此，这家总部位于旧金山的公司还是提高了2022年的销售预测。\n“现在，我们看到的每一个信号都是积极的，”首席执行官奇普·伯格告诉分析师。\n美联社商业作家Dee Ann Durbin（底特律）和Anne D'Innocenzio（纽约）对本报告做出了贡献。", "note_en": "WASHINGTON (AP) — Inflation soared over the past year at its highest rate in four decades, hammering American consumers, wiping out pay raises and reinforcing the Federal Reserve’s decision to begin raising borrowing rates across the economy.\n The  Labor Department said Thursday  that consumer prices jumped 7.5% last month compared with a year earlier, the steepest year-over-year increase since February 1982.\n When measured from December to January, inflation was 0.6%, the same as the previous month and more than economists had expected. Prices rose 0.7% from October to November and 0.9% from September to October.\n Shortages of supplies and workers, heavy doses of federal aid, ultra-low interest rates and robust consumer spending combined to send inflation leaping in the past year. And there are few signs that it will slow significantly anytime soon.\n  Wages are  rising at the fastest pace in at least 20 years, which can pressure companies to raise prices to cover higher labor costs. Ports and warehouses are overwhelmed, with hundreds of workers at the ports of Los Angeles and Long Beach, the nation’s busiest, out sick last month. Many products and parts remain in short supply as a result.\n  The latest inflation data suggested to some economists that the Fed could raise its key rate in March by one-half a percentage point, rather than its typical quarter-point hike.\n James Bullard, the president of the St. Louis Federal Reserve Bank, told Bloomberg News that he supported a sharp increase of a full percentage point in the benchmark short-term interest rate by July.\n Over time, higher rates will raise the costs for a wide range of borrowing, from mortgages and credit cards to auto and business loans. That could cool spending and inflation, but for the Fed, the decision to steadily tighten credit could also trigger another recession.\n Federal Reserve Chair Jerome Powell  signaled two weeks ago  that the central bank would likely raise its benchmark short-term rate multiple times this year.\n Stock prices declined after the inflation report was released and fell further after Bullard’s remarks. The broad S&amp;P 500 index fell 1.3% in afternoon trading. The yield on the 10-year bond jumped to 2.03%, a sign that investors see more Fed rate hikes ahead.\n  Prices for a broad range of goods and services accelerated from December to January — and not just for items directly affected by the pandemic. Apartment rental costs rose 0.5% in January, the fastest pace in 20 years. Electricity prices surged 4.2% in January alone, the sharpest rise in 15 years, and are up 10.7% from a year earlier. Last month, household furniture and supplies rose 1.6%, the largest one-month increase on records dating to 1967.\n Food costs, driven by pricier eggs, cereal and dairy products, increased 0.9% in January. New car prices, which have jumped during the pandemic because of a shortage of computer chips, were unchanged last month but are up 12.2% from a year ago. The surge in new-car prices has, in turn, accelerated used-car prices; they rose 1.5% in January and are up a dizzying 41% from a year ago.\n “Just as price pressures in some areas ease, inflation in other parts of the economy” is picking up, said Sarah House, an economist at Wells Fargo. “The upshot is that inflation is likely to remain uncomfortably high.”\n The steady rise in prices has left many Americans less able to afford food, gas, rent, child care and other necessities. More broadly, inflation has emerged as the biggest risk factor for the economy and  as a serious threat to President Joe Biden and congressional Democrats as midterm elections loom later this year.\n Among the Americans who are struggling with pricier food and gas is Courtney Luckey, who has changed her shopping habits and taken on additional work shifts at a grocery store in Charlotte, North Carolina, where she lives.\n Luckey, 33, used to be able to fill up a grocery cart for $100. Now, she said, $100 barely fills half the cart. Tomatoes have reached nearly $5 a pound, “which I think is ridiculous.” Luckey has switched to canned tomatoes and has begun using coupons for Family Dollar and Food Lion.\n To help pay bills, she’s also picked up more hours at a Harris Teeter grocery store. But the store is 30 minutes from her house, so she’s had to spend more on gas.\n All her forced additional spending has caused Luckey to pull back on the family activities, such as bowling, with her daughter, her brother and his two sons. Those outings now typically happen once a month, rather than every week or two.\n In the past year, sharp increases in the costs of gas, food, autos and furniture have upended many other Americans’ budgets, too. In December, economists at the University of Pennsylvania’s Wharton School estimated that the average household had to spend $3,500 more than in 2020 to buy an identical basket of goods and services.\n  Julio Ortiz, the owner of Gaspachos, which sells fruit cups, smoothies and coffee in Sacramento, said he had to raise prices by about 6%, on average, in November. For some items, prices rose 10%.\n “We’ve seen a spike in pricing for fruits, vegetables, cups, and plates,” he said. His company uses compostable packaging, but much of it comes from overseas and has been stuck on ships that haven’t been unloaded.\n Even excluding volatile food and energy prices, so-called core inflation jumped 0.6% from December to January and 6% from a year ago.\n Many large corporations, in conference calls with investors, have said they expect supply shortages to persist until at least the second half of this year.\n Chipotle said it’s increased menu prices 10% to offset the rising costs of beef and transportation as well as higher employee wages. And the restaurant chain said it will consider further price increases if inflation keeps rising.\n “We keep thinking that beef is going to level up and then go down, and it just hasn’t happened yet,” said John Hartung, the company’s chief financial officer.\n Executives at Chipotle, as well as at Starbucks and some other consumer-facing companies, have said their customers so far don’t seem fazed by the higher prices.\n Levi Strauss &amp; Co. raised prices last year by roughly 7% above 2019 levels because of rising costs, including labor, and plans to do so again this year. Even so, the San Francisco-based company has upgraded its sales forecasts for 2022.\n “Right now, every signal we’re seeing is positive,” CEO Chip Bergh told analysts.\n  AP business writers Dee-Ann Durbin in Detroit and Anne D’Innocenzio in New York contributed to this report.", "posttime": "2022-02-13 12:32:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,通货膨胀率,inflation,价格", "title": "过去一年，美国通货膨胀率上升了7.5%，创下40年来的新高", "title_en": "US inflation jumped 7.5% in the past year, a 40-year high", "transed": 1, "url": "https://apnews.com/article/business-long-beach-inflation-prices-consumer-prices-d412bcce554693de469765b34351773d", "via": "", "real_tags": ["美国", "通货膨胀率", "inflation", "价格"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072855, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周四的一次加价听证会上，参议院司法委员会提出了一项有争议的新法案，针对第230条对涉及网络性剥削的内容的保护。尽管人权和隐私团体强烈反对，但在多数投票中，《挣到钱法案》还是被推荐进行了最低投票。\n在其他条款中，该法案将剥夺公司在其平台上明知传播儿童性虐待图像（CSAM）的豁免权。目前，第230条保护公司免受民事诉讼。\n“它正在把社交媒体公司变成政府的一个部门”\n人权组织将该法案与FOSTA（一项2018年通过成为法律的反性贩运法案）进行了比较，称其将限制在线言论，但对解决潜在问题几乎没有作用。在给委员会的一封集体信中，60多个人权组织（包括EFF和ACLU）呼吁委员会放弃这一努力。\n信中写道：“通过让提供商承担大幅扩大的责任，该法案将使平台承载用户生成内容的风险大大增加。”。\n批评人士还担心，该法案可能会开启事实上禁止端到端加密的大门。目前的版本，它说加密不应该“作为一个独立的基础上的供应商的责任”，但它仍然可以考虑当法院考虑是否有一个公司已采取合理的努力根除剥削在其网络上。\n在委员会内部，议员们对该法案的描述有所不同。该法案的主要发起人森·布卢门塔尔（Sen Blumenthal，D-CT）将该法案描述为“对第230条的狭隘突破”，并将对加密的担忧斥为“转移视线”Blumenthal还详细描述了受害者分别在Twitter和Reddit上看到非自愿色情（也称为“报复色情”）的事件，在没有涉及联邦执法的情况下，受害者几乎没有选择。\n布卢门塔尔在一份开幕声明中说：“挣到钱的法案将在剥削开始前停止剥削。”。“它培育了下一代技术来阻止剥削，当技术公司在幸存者中失败时，它确实控制了这些公司，使这些掠夺者能够传播儿童性虐待材料。”\n大多数在线平台积极扫描CSAM，自愿向国家失踪和受剥削儿童中心（NCMEC）报告材料。Google Drive和Dropbox等托管服务也会根据NCMEC生成的哈希值扫描其平台，以确保CSAM不能私下存储在云中或作为电子邮件附件包含。（苹果最近提出了一项复杂的计划，将在iCloud存储中实施类似的扫描。）尽管做出了这些努力，CSAM仍在监管较少的在线空间中传播，尤其是在美国以外的地方。\n在CSAM之外，阻止非自愿色情内容的系统还远远不够发达，尽管Facebook和Pornhub等平台已经测试了有限的门户网站，允许受害者标记特定的照片。与CSAM不同，其他类型的非自愿色情作品继续在主流网络空间中传播，正如布鲁门塔尔的轶事所示，没有用于标记和删除它们的集中数据库。\n该法案的批评者承认这些问题的紧迫性，但表示《挣IT法案》无助于打击剥削。尤其是，法律专家担心，强迫公司向NCMEC披露信息会给现有的起诉带来重大问题。如果这种报告是法律强制的，法院可以裁定科技公司代表执法部门行事，因此受国家行为者原则下的宪法限制。从本质上说，国会不能强迫私营公司做任何违反宪法的事情，因为执法部门只能自己做。\nNetChoice的副总裁兼法律总顾问卡尔·萨博（Carl Szabo）说：“它正在把社交媒体公司变成政府的一个部门。”。其结果将是对科技公司如何扫描CSAM的新限制。伊利诺伊州和南卡罗来纳州的法律直接禁止此类信息共享的法律要求。\n《挣IT法案》于2020年首次出台，此前于次年7月获得委员会通过，但在更广泛的参议院停滞不前。这一次，委员会在没有举行听证会的情况下对《挣它法案》进行了加分，批评人士认为此举是为了回避对其内容的辩论。\n萨博说：“他们认识到，人们谈论这项法案的时间越长，他们就越有时间确定其根本问题。”。", "note_en": "In  a markup hearing on Thursday, the Senate Judiciary Committee advanced a controversial new bill targeting Section 230 protections for content involving online sexual exploitation. In a majority vote,  the EARN IT Act was favorably referred for a floor vote, despite vigorous objections from human rights and privacy groups.\n Among other provisions, the bill would strip companies of immunity for the knowing transmission of child sexual abuse imagery (CSAM) on their platforms. Currently, companies are protected from civil cases by Section 230 .\n “It’s turning social media companies into an arm of the government”\n Human rights groups have compared the bill to  FOSTA — an anti-sex trafficking bill passed into law in 2018 — saying EARN IT will restrict online speech while doing little to address the underlying problems. In a group letter to the committee,  more than 60 human rights organizations (including the EFF and ACLU) called on the committee to abandon the effort.\n “By opening providers up to significantly expanded liability, the bill would make it far riskier for platforms to host user-generated content,” the letter reads.\n Critics also worry that the bill could open the door to a de facto ban on end-to-end encryption. The current version of EARN IT says encryption shall not “serve as an independent basis for liability of a provider,” but it can still be taken into account when courts consider whether a company has taken reasonable efforts to root out exploitation on its networks.\n Within the committee, lawmakers characterized the bill differently. Sen Blumenthal (D-CT), a lead sponsor of the measure, described the bill as “a narrow carveout to section 230” and dismissed concerns over encryption as “a red herring.” Blumenthal also detailed separate incidents in which victims saw non-consensual pornography (also called “revenge porn”) shared on Twitter and Reddit respectively and faced few options without involving federal law enforcement.\n  “The EARN IT Act will stop exploitation before it starts,” Blumenthal said in an opening statement. “It fosters the next generation of technology to stop exploitation, and it does hold tech companies when they fail survivors and they enable these predators to spread child sexual abuse material.”\n Most online platforms scan aggressively for CSAM, reporting material to the National Center for Missing and Exploited Children (NCMEC) on a voluntary basis. Hosting services like Google Drive and Dropbox also scan their platforms against hashes generated by NCMEC to ensure CSAM can’t be stored privately in the cloud or included as an attachment to an email. (Apple  recently tabled a  complex plan that would impose similar scans in iCloud storage.) Despite these efforts, CSAM continues to circulate in less regulated online spaces, particularly those hosted outside the US.\n Outside of CSAM, systems for blocking non-consensual pornography are far less developed, although platforms like  Facebook and  Pornhub have tested limited portals that would allow victims to flag specific photos. Unlike CSAM, other kinds of non-consensual pornography continue to circulate in mainstream online spaces, and there is no centralized database for flagging and removing them, as Blumenthal’s anecdotes show.\n Critics of the bill acknowledge the urgency of these problems but say the EARN IT Act won’t help fight exploitation. In particular, legal experts worry that compelling companies to disclose information to NCMEC will create significant problems for existing prosecution. If that reporting is legally compelled, courts could rule that tech companies are acting on behalf of law enforcement, and thus subject to constitutional restrictions under  the state actor doctrine. In essence, Congress can’t compel private companies to do anything that would be unconstitutional for law enforcement to do on its own.\n “It’s turning social media companies into an arm of the government,” says Carl Szabo, a vice president and general counsel at NetChoice. The result would be new restrictions on how tech companies can scan for CSAM. State laws in Illinois and South Carolina directly prohibit legal requirements for such information sharing.\n First introduced in 2020, the EARN IT Act  previously cleared committee the following July, but stalled in the broader Senate. This time, the committee moved to mark up the EARN IT Act without a hearing, a move critics see as an effort to sidestep debate over its contents.\n “They recognize that the more time people have to talk about this bill, the more time they have to identify its fundamental problem,” Szabo said.", "posttime": "2022-02-13 12:29:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "法案,exploitation", "title": "反剥削法案在参议院取得进展，尽管存在言论自由方面的担忧", "title_en": "Anti-exploitation bill advances in Senate despite free speech concerns", "transed": 1, "url": "https://www.theverge.com/2022/2/10/22927346/earn-it-act-markup-senate-judiciary-section-230-csam-non-consensual-porn", "via": "", "real_tags": ["法案"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072854, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果应对iOS和macOS平台零日攻击的努力没有放缓的迹象。\n数月来，Cupertino第二次发布了iOS、iPadOS和macOS更新，以解决一个关键的WebKit安全缺陷（CVE-2022-22620），该缺陷使苹果设备面临远程代码执行攻击。\n“处理恶意制作的网络内容可能会导致任意代码执行。苹果知道一份报告称，这个问题可能被积极利用，”该公司在一份赤裸裸的咨询中说。\n按照惯例，苹果没有提供攻击范围、目标平台的详细信息，也没有提供任何妥协迹象，以帮助防御者寻找感染迹象。\niOS 15.3.1、iPadOS 15.3.1和macOS Monterey 12.2.1中修复的WebKit漏洞是一名匿名研究人员报告的释放内存损坏后使用问题。苹果表示，通过改进内存管理，WebKit代码得到了清理。\n这是苹果在2022年前两个月确定的第二个“积极利用”的零日。上个月底，该公司使用了同样的语言披露了零日漏洞攻击攻击IOMobileFrameBuffer中的内存损坏问题，IOMobileFrameBuffer是一个经常被攻击的iOS内核扩展。\n本周早些时候，微软的恶意软件猎手提请注意一个令人讨厌的macOS恶意软件家族，该家族已从一个基本信息收集特洛伊木马迅速演变为一个具有更强大功能的秘密后门。\nRyan Naraine是《安全周刊》的自由编辑，也是热门安全对话播客系列的主持人。他是一名记者和网络安全策略师，在IT安全和技术趋势方面拥有20多年的经验。瑞安已经在主要的全球品牌建立了安全参与计划，包括英特尔公司、毕晓普·福克斯和卡巴斯基大公司。他是Threatpost和全球SAS会议系列的联合创始人。瑞安&#39；他的记者生涯包括在主要科技出版物上署名，包括Ziff Davis eWEEK、CBS Interactive和#39；s ZDNet、PCMag和PC世界。瑞安是非营利组织安全修补者的主管，也是世界各地安全会议的常客。在Twitter@ryanaraine上关注Ryan。", "note_en": "Apple’s struggles with zero-day attacks on its iOS and macOS platforms are showing no signs of slowing down.\n For the second time in as many months, Cupertino released iOS, iPadOS and macOS updates to address a critical WebKit security defect  (CVE-2022-22620) that exposes Apple devices to remote code execution attacks.\n “Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited,” the company said in a  barebones advisory.\n As is customary, Apple did not provide details on the scope of the attack, the platform being targeted, or any indicators of compromise to help defenders look for signs of infections.\n  The WebKit flaw, fixed in  iOS 15.3.1, iPadOS 15.3.1 and macOS Monterey 12.2.1, is a use-after-free memory corruption issue that was reported by an anonymous researcher. Apple said the WebKit code was cleaned up with improved memory management.\n This is the second “actively exploited” zero-day fixed by Apple in the first two months of 2022.  Late last month, the company used the same language in the  disclosure of zero-day exploits hitting a memory corruption issue in IOMobileFrameBuffer, an oft-targeted iOS kernel extension.\n Earlier this week, Malware hunters at Microsoft called attention to a nasty  macOS malware family that has evolved quickly from a basic information-gathering trojan to a stealthy backdoor with more powerful capabilities.\n        Ryan Naraine is Editor-at-Large at SecurityWeek and host of the popular  Security Conversations podcast series. He is a journalist and cybersecurity strategist with more than 20 years experience covering IT security and technology trends.Ryan has built security engagement programs at major global brands, including Intel Corp., Bishop Fox and Kaspersky GReAT. He is a co-founder of Threatpost and the global SAS conference series. Ryan&#39;s career as a journalist includes bylines at major technology publications including Ziff Davis eWEEK, CBS Interactive&#39;s ZDNet, PCMag and PC World.Ryan is a director of the Security Tinkerers non-profit, and a regular speaker at security conferences around the world. Follow Ryan on Twitter  @ryanaraine.", "posttime": "2022-02-13 12:27:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,苹果,apple,webkit,安全", "title": "苹果称WebKit零日攻击iOS和macOS设备", "title_en": "Apple Says WebKit Zero-Day Hitting iOS, macOS Devices", "transed": 1, "url": "https://www.securityweek.com/apple-says-webkit-zero-day-hitting-ios-macos-devices", "via": "", "real_tags": ["ios", "苹果", "apple", "webkit", "安全"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072851, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "软件开发人员已经发现了苹果新操作系统&#34；现实&#34；应用商店内上传日志和公司使用的GitHub存储库。\n开发者Rens Verhoeven和Steve Troughton Smith在Twitter上广泛分享了这些参考资料。Verhoeven在推特上写道：\n苹果的RealityOS在应用商店上传日志中做什么？AR/VR确认了吗？照片。啁啾com/wp7xwieeu\n-Rens Verhoeven（@renssies）2022年1月17日\n这条推文还附有一张日志截图，其中包括&#34；通用域名格式。苹果站台现实&#34；除了对现有平台的类似参考&#34；通用域名格式。苹果站台watchos&#34;\n当引用NicolásÁlvarez在推特上对GitHub回购发现的调用时，特劳顿·史密斯在推特上发布了以下内容：\n“#如果目标_特性_REALITYOS”那么。这至少证实了它有自己的操作系统&amp；二进制文件，2）有一个realityOS模拟器https://t.co/6a25kWshXR照片。啁啾com/ryf5go5gfjg\n-史蒂夫·特劳顿·史密斯（@stroughtonsmith）2022年2月9日\n该推文附带的屏幕截图包括&#34；//等代码注释允许iOS可执行文件使用realityOS dylibs&#34；和&#34；//允许iOS_Sim可执行文件使用realityOS_Sim动态库&#34;\n然而，苹果正在一个混合现实平台上工作这一事实并不是什么新鲜事。基于苹果公司的工作列表&#39；苹果的职业网站、大量可靠的报告和其他来源，苹果&#39；s的混合现实平台已经开发多年，拥有数千人的团队。\n然而，混合现实平台面临着几次延迟。例如，彭博社在2017年报道称，苹果&#39；苹果的首款耳机预定于2019年发布。该报告称苹果公司&#39；s为混合现实设备定制的操作系统#34；罗斯&#34;\n明智国等分析人士和彭博社等记者&#39；s的马克·古尔曼（Mark Gurman）一直声称高端混合现实耳机已经面世一段时间了。一些报道称，今年将推出一款耳机，但另一些报道称，耳机可能会在2023年推出。细节是模糊和矛盾的。\n例如，Kuo曾表示，该设备将配备一个与M1相当的处理器。这表明它可能是独立的，并且赢得了&#39；附近不需要iPhone或Mac电脑。但最近的另一份报告称，苹果计划依靠附近的移动设备进行处理。\n其中一些差异可能是因为苹果正在开发至少两种不同的设备。其中一款有望成为高端、支持虚拟现实技术的耳机，用于沉浸式内容&#39；这是今年或明年的预期。另一种设备是AR眼镜，可以在公共场所走动时佩戴。但该公司也可能仍在试验各种产品概念，其设计和特色尚未最终确定。", "note_en": "Software developers have discovered apparent references to a new Apple operating system called &#34;realityOS&#34; in App Store upload logs and in GitHub repositories used by the company.\n The references were shared widely by developers Rens Verhoeven and Steve Troughton-Smith on Twitter. Verhoeven  tweeted:\n Uh what is Apple’s RealityOS doing in the App Store upload logs?  AR/VR confirmed?  pic.twitter.com/Wp7XWieeEU\n— Rens Verhoeven (@renssies)  January 17, 2022\n The tweet was accompanied by a screenshot from the logs that included &#34;com.apple.platform.realityos&#34; alongside a similar reference for an existing platform, &#34;com.apple.platform.watchos.&#34;\n And while quote-tweeting a callout of the  GitHub repo find  by Nicolás Álvarez, Troughton-Smith  tweeted the following:\n “ #if TARGET_FEATURE_REALITYOS”  Well then. This at least confirms it 1) has its own OS &amp; binaries, and 2) has a realityOS Simulator  https://t.co/6a25kWshXR  pic.twitter.com/RyF5O5gFjg\n— Steve Troughton-Smith (@stroughtonsmith)  February 9, 2022\n The screenshots accompanying that tweet included code comments like &#34;// allow iOS executables to use realityOS dylibs&#34; and &#34;// allow iOS_Sim executables to use realityOS_Sim dylibs.&#34;\n The fact that Apple is working on a mixed reality platform is not new news, however. Based on job listings on Apple&#39;s careers site, numerous reliable reports, and other sources, Apple&#39;s mixed reality platform has been in development for years, with a team of thousands.\n    The mixed reality platform has faced several delays, however. For example, Bloomberg reported back in 2017 that Apple&#39;s first headset was targeting a 2019 release date. That report called Apple&#39;s custom operating system for mixed reality devices &#34; rOS.&#34;\n Analysts like Ming-chi Kuo and reporters like Bloomberg&#39;s Mark Gurman have been claiming that a high-end mixed reality headset has been coming for a while. Some reports said a headset would come this year, but others recently claimed that one could arrive in 2023 instead. Details are fuzzy and contradictory.\n For example,  Kuo has said that the device will feature an M1-equivalent processor of its own. This suggests that it may be standalone and won&#39;t require an iPhone or Mac nearby. But  another recent report claimed that Apple plans to rely on processing on a nearby mobile device.\n Some of these differences could be because Apple is working on at least two different devices. One is expected to be a high-end, VR-capable headset for immersive content—that&#39;s the one expected this year or next. Another device would be AR glasses meant to be worn while walking around public spaces. But the company could also still be experimenting with a variety of product concepts, with the designs and distinguishing features yet to be finalized.", "posttime": "2022-02-13 12:18:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,github,apple,realityos", "title": "苹果的“realityOS”出现在GitHub提交、应用商店日志中", "title_en": "Apple’s “realityOS” surfaces in GitHub commits, App Store logs", "transed": 1, "url": "https://arstechnica.com/gadgets/2022/02/devs-discover-realityos-hints-in-apple-logs-and-code/", "via": "", "real_tags": ["苹果", "github", "apple", "realityos"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072850, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的几个月里，我&#39；我从我的一个朋友那里学吉他，他碰巧是一位出色的老师。我很幸运。我在几年前就开始打球了，但可能只保留了我所知道的10%，所以我和任何一个几乎没有经验的球员一样接近于从零开始。基本上，我可以涉猎并弹奏一些和弦，但之后我的技能很快就稳定下来了。它&#39；这是一个孤独、荒凉、杂草丛生的平坦高原。你没有&#39；在那里闲逛不会更好。因此&#39；这就是为什么我&#39；我回到了面对面的课程。我试过YouTube，我试过一些书，我试过一两个应用，我试过很多东西，但我&#39；我发现我只是通过一对一的面对面指导来学习吉他。而我&#39；我好多了。但我&#39；我也在那里发现了&#39；这是另一个与实践相结合的维度：做自己想做的事情感觉更好&#39；重新学习。人们很容易将感觉更好视为“变得更好”的孪生兄弟。但我&#39；我在那里找到了&#39；这是不同的。变得更好是为了改善，感觉更好是为了自信和舒适。它&#39；这是一种伴随着变得更好而发展起来的放松。我对吉他本身感觉更好——它&#39；它不再是一个吓人的东西。当然，我&#39；我还有1000英里要走才能到达我想去的地方，但我&#39；我已经通过了第一个关卡：打球感觉更好，即使我打得不好。我发现自己更频繁地拿起吉他。不是真正的练习，而是真正的胡闹。现在我感觉好多了，我&#39；我给了自己更多的自由去享受它。更多的技能带来更多的空间，但更好的感觉带来更多的心灵空间。我记得90年代中期我在学习网页设计时也有过类似的感觉。一开始很难。我没有&#39；我不喜欢它，因为我是&#39；我一点也不擅长。我在学习，我能做东西，但我没有&#39；我还不舒服。我没有&#39；我没有掌握足够的技能来放松。然后，最终，我做到了。我喜欢它！我有点喜欢。在那一刻，我几乎没有更多的知识，但我有一种感觉，我能做到这一点，我想做到这一点，我做这件事感觉很好。这使我有机会进一步学习。我&#39；我开始相信这是第一个值得为之奋斗的里程碑。对自己的事情感觉良好&#39；你在干什么。不放一首歌，不跑一段距离，不设计一页，不把一个完美的罐子扔到轮子上，或者其他什么——只是享受你所做的事情&#39；你在干什么。一旦你击中它，你&#39；我们正在路上。", "note_en": "Over the past few months I&#39;ve been taking guitar lessons from a friend of mine who happens to be an exceptional teacher. I got lucky.  I used to play years ago, but probably only retained 10% of what I knew, so I was as close to starting from scratch as any barely-experienced player could be. Basically, I could dabble and play some chords, but my skills plateaued quickly after that. And it&#39;s a lonely, desolate, tumbleweedy-flat plateau. You don&#39;t get better hanging out there.  So that&#39;s why I&#39;m back to in-person lessons. I tried YouTube, I tried some books, I tried an app or two, I tried a bunch of stuff, but I&#39;ve discovered I simply learn guitar best with one-on-one in-person instruction.  And I&#39;ve gotten better. But I&#39;ve also discovered there&#39;s another dimension that unlocks with practice:  feeling better doing the thing you&#39;re learning.  It would be easy to dismiss feeling better as the identical twin of getting better. But I&#39;ve found there&#39;s a difference.  Getting better is about improving specifically, feeling better is about confidence and comfort. It&#39;s a certain ease that develops alongside getting better. I feel better about the guitar itself — it&#39;s no longer this intimidating object. Granted, I&#39;ve got 1000 miles to go before I get where I want to be with it, but I&#39;ve passed the first waypoint: It just  feels better to play, even when I play poorly.  I find myself picking up the guitar more frequently. Not to literally practice, but to literally fuck around. Now that I feel better about it, I&#39;ve given myself more latitude to have some fun with it. More skills bring more headroom, but better feels bring more heartroom.  I remember a similar feeling when I was learning web design way back in the mid-90s. At first it was hard. And I didn&#39;t like it because I wasn&#39;t any good at it. I was learning, I could make stuff, but I didn&#39;t feel comfortable yet. I hadn&#39;t pocketed enough skills to feel at ease. And then, eventually, I did. And I liked it! I kinda loved it. I barely had more knowledge under my belt in that very moment, but I had a sense that  I could do this, I want to do this, I feel good doing this. It opened me up to further learning.  I&#39;ve come to believe this is the first milestone worth shooting for. Feeling good about the thing you&#39;re doing. Not playing a song, or running a distance, or designing a page, or throwing a perfect pot on the wheel, or whatever — but simply  enjoying the thing you&#39;re doing. Once you hit that, you&#39;re on your way.", "posttime": "2022-02-13 12:16:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "feeling,感觉", "title": "变得更好还是感觉更好", "title_en": "Getting Better vs. Feeling Better", "transed": 1, "url": "https://world.hey.com/jason/getting-better-vs-feeling-better-6b025acb", "via": "", "real_tags": ["feeling", "感觉"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072848, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "研究每日咖啡摄入量与全因和心血管（CV）死亡率及主要CV结局的关系。在一个接受心血管磁共振（CMR）成像的亚组参与者中，我们评估了经常喝咖啡与心脏结构和功能之间的关系。\n包括招募时没有临床表现的心脏病的英国生物银行参与者。常规咖啡摄入量分为三组：零、轻度至中度（0.5-3杯/天）和高（大于3杯/天）。在多变量分析中，我们调整了主要的心血管风险因素。\n我们包括468629人（56.2±8.1岁，44.2%为男性），22.1%不经常喝咖啡，58.4%每天喝0.5-3杯咖啡，19.5%每天喝&gt；每天3杯。与不喝咖啡的人相比，轻度至中度（每天0.5-3杯）喝咖啡与较低的全因死亡率（多变量HR=0.88，95%CI:0.83-0.92；p&lt；0.001）和CV死亡率（多变量HR=0.83，95%CI:0.74-0.94；p=0.006）相关，中位随访11年后发生卒中（多变量HR=0.79，95%CI:0.63-0.99 p=0.037）。CMR数据可用于30650名参与者。轻度至中度和重度咖啡摄入类别均与左室和右室舒张末期、收缩末期和卒中量的剂量依赖性增加，以及更大的左室质量有关。\n每天最多喝3杯咖啡与良好的CV结果相关。经常喝咖啡也与CMR指标的可能健康模式相关，与年龄相关的心脏改变相反。\n©作者2022年。牛津大学出版社代表欧洲心脏病学会出版。\n公共科学图书馆医学院。2021 11月16日；18（11）：e1003830。doi:10.1371/期刊。pmed。1003830、2021年度PLOS医学杂志。2021。PMID：34784347免费PMC文章。\n心脏衰竭。2020年8月；7(4):1510-1519. doi:10.1002/ehf2。12684.Epub 2020年5月25日。心脏衰竭。2020.PMID:32449612免费PMC文章。\nJAMA医学实习生。2018年8月1日；178(8):1086-1097. 内政部：10.1001/医学院。2018.2425.  JAMA医学实习生。2018.PMID:29971434免费PMC文章。\n循环2014年2月11日；129(6):643-59. doi:10.1161/CIRCULATIONAHA。113.005925. Epub 2013年11月7日。循环2014.PMID:24201300免费PMC文章。回顾\nJ Am Coll Cardiol。2013年9月17日；62(12):1043-1051. doi:10.1016/j.jacc。2013.06.035. Epub 2013年7月17日。J Am Coll Cardiol。2013年，PMID:23871889审查。", "note_en": "To study the association of daily coffee consumption with all-cause and cardiovascular (CV) mortality and major CV outcomes. In a subgroup of participants who underwent cardiovascular magnetic resonance (CMR) imaging, we evaluated the association between regular coffee intake and cardiac structure and function.\n  UK Biobank participants without clinically manifested heart disease at the time of recruitment were included. Regular coffee intake was categorized into 3 groups: zero, light-to-moderate (0.5-3 cups/day) and high (&gt;3 cups/day). In the multivariate analysis, we adjusted for the main CV risk factors.\n  We included 468,629 individuals (56.2 ± 8.1 years, 44.2% male), 22.1% did not consume coffee on a regular basis, 58.4% had 0.5-3 cups per day and 19.5% had &gt;3 cups per day. Compared to non-coffee drinkers, light-to-moderate (0.5-3 cups per day) coffee drinking was associated with lower risk of all-cause mortality (multivariate HR = 0.88, 95%CI : 0.83-0.92; p &lt; 0.001) and CV mortality (multivariate HR = 0.83, 95%CI : 0.74-0.94; p = 0.006), and incident stroke (multivariate HR = 0.79, 95%CI : 0.63-0.99 p = 0.037) after a median follow-up of 11 years. CMR data were available in 30,650 participants. Both light-to-moderate and high coffee consuming categories were associated with dose-dependent increased left and right ventricular end-diastolic, end-systolic and stroke volumes, as well as greater left ventricular mass.\n  Coffee consumption of up to 3 cups per day was associated with favorable CV outcomes. Regular coffee consumption was also associated with a likely healthy pattern of CMR metrics in keeping with the reverse of age-related cardiac alterations.\n  © The Author(s) 2022. Published by Oxford University Press on behalf of the European Society of Cardiology.\n  PLoS Med. 2021 Nov 16;18(11):e1003830. doi: 10.1371/journal.pmed.1003830. eCollection 2021 Nov.  PLoS Med. 2021.  PMID:  34784347  Free PMC article.\n  ESC Heart Fail. 2020 Aug;7(4):1510-1519. doi: 10.1002/ehf2.12684. Epub 2020 May 25.  ESC Heart Fail. 2020.  PMID:  32449612  Free PMC article.\n  JAMA Intern Med. 2018 Aug 1;178(8):1086-1097. doi: 10.1001/jamainternmed.2018.2425.  JAMA Intern Med. 2018.  PMID:  29971434  Free PMC article.\n  Circulation. 2014 Feb 11;129(6):643-59. doi: 10.1161/CIRCULATIONAHA.113.005925. Epub 2013 Nov 7.  Circulation. 2014.  PMID:  24201300  Free PMC article.  Review.\n  J Am Coll Cardiol. 2013 Sep 17;62(12):1043-1051. doi: 10.1016/j.jacc.2013.06.035. Epub 2013 Jul 17.  J Am Coll Cardiol. 2013.  PMID:  23871889  Review.", "posttime": "2022-02-13 12:08:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "咖啡,moderate,心脏", "title": "轻度到中度的咖啡消费与较低的死亡风险有关", "title_en": "Light to moderate coffee consumption is associated with lower risk of death", "transed": 1, "url": "https://pubmed.ncbi.nlm.nih.gov/35048949/", "via": "", "real_tags": ["咖啡", "moderate", "心脏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1072846, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当她的研究——证实了20世纪70年代的一个预测，即人类对经济增长的不可抑制的渴望将撞上一堵墙，并可能在2040年左右螺旋式地演变为文明的崩溃——去年夏天首次登上头条时，可持续发展分析师加亚·赫林顿（Gaya Herrington）有着更紧迫的担忧。\n她告诉《独立报》：“这是一个非常有趣的时期，当我有一个不到两个月大的婴儿时，病毒开始传播。我在哺乳期间接受了采访。”。“在某种程度上，它从我身边经过了一点。”\n这篇发表在《工业生态学杂志》（Journal of Industrial Ecology）上的学术论文为何会在现在引起轰动，不需要太多的想象力；在一个经历了数月野火、连环飓风、毁灭性洪水和热浪的世界里，对未来的黑暗愿景似乎越来越不遥远。\n赫林顿女士曾担任会计跨国公司毕马威（KPMG）的可持续发展总监，现任施耐德电气（Schneider Electric）环境、社会和治理研究副总裁。施耐德电气是全球最具可持续发展能力的公司，能源和自动化领域的专家。\n作为她最近在哈佛大学获得可持续发展硕士学位的一部分，她决定回顾70年代初麻省理工学院（MIT）的一项标志性研究。受欧洲智库罗马俱乐部（Club of Rome）委托的研究人员提出了一个问题：在什么情况下，人类对有限资源的消耗和猖獗的工业化会超过地球的应对能力？\n通过计算机建模，麻省理工学院的研究小组用一系列变量生成了未来情景——人口、食物、工业化、不可再生自然资源的使用和污染（包括碳排放）。\n1972年出版的《增长的极限》（The Limits to Growth）一书的结果令人清醒。该团队发现，所谓的“一切照旧”经济增长方式将耗尽地球的资源，并导致21世纪内的崩溃。虽然人类文明不会终结，但随着粮食生产、工业产出和人口数量的下降，人们的境况将比前几代人严重得多。\n但并非所有增长极限（Limits to Growth，LtG）的未来前景都如此黯淡。麻省理工学院的团队还发现，如果社会围绕公民福祉重新安排优先事项，有效利用资源，减少污染，那么“稳定的世界”是可能的。\n尽管这本书的销量达到3000万册，并以30种语言出版，但最初的反应好坏参半。一些人预见到了无休止的消费和对自然世界的破坏所带来的危险。其他人则对这项研究持严厉批评态度。\n《纽约时报》的经济编辑在一篇严厉的评论中写道：“增长的极限不是对自然规律的重新发现，而是对计算机科学最古老格言的重新发现：垃圾输入，垃圾输出。”。\n根据赫林顿女士50年的对比分析，以及其间几年的大量研究发现，长期目标在很大程度上经受住了时间的考验。\n她的论文将LtG的四种情景与现有的最新实证数据进行了比较，以了解全球社会是否仍在走向崩溃。\n总的来说，新发现与20世纪70年代的研究密切相关，并得出结论认为，未来20年，文明可能会停止经济增长，在最坏的情况下，2040年左右会出现社会崩溃。\n“因此，从我的研究中可以得出的最有力的结论是，人类正走在一条限制自身增长的道路上，而不是有意识地选择自己的发展道路。然而，我的研究结果也表明，随后工农业产出的下降是否会导致人口和收入的急剧下降福利水平，”赫林顿在7月份的博客文章中写道。\n我们这一代人是第一个经历气候变化的人，但我们也是最后一个能够对此采取任何行动的人。\n这位分析师告诉《独立报》：“在一个有限的星球上，增长无法持续的想法是非常直观的。没有什么东西能永远增长。”。然而，她补充说，模型能够准确预测未来几十年的情况“相当罕见”。\n她在谈到最初的研究时说：“这太遗憾了，因为如果我们当时注意到了这个信息，我们本来可以有一个非常平稳的过渡。”。“我现在的结论是，我们还有时间，但时间很快就用完了。我们必须做出重大改进。这将是一条崎岖不平的道路。”\n她补充说：“接下来的十年将决定本世纪余下的时间。这是一个非常不寻常的时期。我们这一代人是第一个经历气候变化的人，但我们也是最后一个能够对此采取任何行动的人。”\n根据她的研究，一本名为《避免崩溃的五大洞见》的书将于今年晚些时候出版。这位分析师是罗马俱乐部的顾问，也是一个工作组的成员，该工作组将在6月的联合国斯德哥尔摩+50会议上向LtG提交一份50年的最新报告。\n从疫情中“重建得更好”的承诺一直是主要经济体领导人的号召，但在现实中，这种更清洁、更绿色的未来迄今尚未成形。燃烧化石燃料导致的气候危机的主要驱动因素二氧化碳和甲烷排放量继续上升。\n从某种意义上说，LtG的更新提供了一个可怕的未来愿景。然而，赫林顿表示，最坏的情况并不是不可避免的，尽管窗口正在迅速关闭，以绘制一条不同的路线，并将需要进行重大改变。\n例如，她说，仅仅关注净零排放目标已经过时，缺乏雄心壮志，“在税收和定价的边缘思考”也是如此。\n“我们需要完全重新设想我们在世界上的角色，”她说。“因为目的是什么？让这个世界比你发现的更好一点。”。\n“归根结底，我认为这就是增长的局限性。它可以比这更好，我们真的可以做得更好，感觉更好。我认为我们必须提供一个愿景的替代方案。”\n通过注册，您还可以有限地访问高级文章、独家新闻稿、评论以及与我们主要记者的虚拟活动\n密码必须至少包含6个字符，包括大小写字符和数字\n必须至少包含6个字符，包括大小写字符和数字\n必须至少包含6个字符，包括大小写字符和数字\n我想通过电子邮件了解《独立报》的报价、活动和最新消息。阅读我们的隐私声明\n您可以通过登录您的帐户随时选择退出，以管理您的首选项。每封邮件都有一个取消订阅的链接。\n点击“创建我的账户”，您确认您的数据输入正确，并且您已经阅读并同意我们的使用条款、Cookie政策和隐私声明。\n本网站受reCAPTCHA保护，谷歌隐私政策和服务条款适用。\n点击“注册”确认您的数据输入正确，并且您已经阅读并同意我们的使用条款、Cookie政策和隐私声明。\n本网站受reCAPTCHA保护，谷歌隐私政策和服务条款适用。\n想把你最喜欢的文章和故事加入书签，以便以后阅读或参考吗？从今天开始独立高级订阅。", "note_en": "When her study – confirming a 1970s prediction that  humanity’s unquenchable desire for economic growth would hit a wall and could spiral into civilization’s collapse around 2040 – first hit headlines last summer, sustainability analyst Gaya Herrington had more pressing concerns.\n “It was a very interesting time when it went viral as I had a less than two-month-old infant. I’ve done interviews while breastfeeding,” she told  The Independent. “In a way, it passed me by a little bit.”\n   It doesn’t take much of an imaginative leap to understand why this academic paper, published in the relatively obscure   Journal of Industrial Ecology, would catch fire now; when dark visions of the future seem less and less far-fetched in a world experiencing months-long  wildfires, back-to-back hurricanes, devastating floods and heatwaves.\n  Ms Herrington, former sustainability director at accounting multinational KPMG, is vice president of environmental, social, and governance research at Schneider Electric, a specialist in energy and automation, which is  ranked the world’s most sustainable company.\n  As part of her recent Master’s degree in sustainability at Harvard University, she decided to review an iconic study from the Massachusetts Institute of Technology ( MIT) in the early Seventies. Researchers, commissioned by European think tank the Club of Rome, had been set this question: At what point will humanity’s consumption of finite resources and rampant industrialization outstrip the planet’s ability to cope?\n  Using computer modeling, the MIT group generated future scenarios with a number of variables –  population, food, industrialisation, use of nonrenewable natural resources, and pollution (which included carbon emissions).\n  The results, published in 1972 as  The Limits to Growth, were sobering. The team discovered that a so-called “business-as-usual” approach to economic growth would drain the planet’s resources and lead to collapse within the 21st century. While human civilization would not end, people would be significantly worse off than previous generations amid tumbling food production, industrial output, and population numbers.\n  But not all future scenarios in  Limits to Growth (LtG) were so bleak. The MIT team also discovered that a “stabilized world” was possible, if society reconfigured priorities around the wellbeing of citizens, used resources efficiently, and cut pollution.\n While the book went on to sell 30 million copies and was published in 30 languages, the initial response was mixed. Some saw a prescient warning on the dangers of endless consumption and blithe ravaging of the natural world. Others were heavily critical of the research.\n  “The Limits to Growth is best summarized not as a rediscovery of the laws of nature but as a rediscovery of the oldest maxim of computer science: Garbage In, Garbage Out,”   The New York Times economics editors wrote in a scathing review.\n Five decades on Ms Herrington’s comparative analysis, along with a number of  studies in intervening years, found that  LtG  has largely stood the test of time.\n  Her thesis compared four scenarios from  LtG, against the most recent empirical data available, to find out if global society was still heading towards collapse.\n Overall, the new findings aligned closely with the 1970s study and concluded that civilisation can expect a halt to economic growth in the next 20 years and, in the worst-case scenario, see societal collapse around 2040.\n  “The strongest conclusion that can be drawn from my research therefore, is that humanity is on a path to having limits to growth imposed on itself rather than consciously choosing its own. However, my research results also leave open whether the subsequent declines in industrial and agricultural output will lead to sharp declines in population and welfare levels,”  Ms Herrington wrote in blog post in July.\n  Our generation is the first to experience climate change but we are also the last to be able to do anything about it.\n “The idea that growth cannot continue on a finite planet is very intuitive. Nothing grows forever,” the analyst told  The Independent. However she added that it was “quite rare” for models to accurately predict decades into the future.\n “It’s such a shame because if we had heeded the message [back] then, we could have had a really smooth transition,” she said of the original research. “My conclusion now is that we still have time but we’re fast running out of it. We have to make drastic improvements. It’s going to be a bumpy road.”\n She added: “This upcoming decade is going to determine the rest of the century. It’s quite an extraordinary time. Our generation is the first to experience climate change but we are also the last to be able to do anything about it.”\n  A book based on her research,  titled  Five Insights For Avoiding Collapse, will be published later this year. The analyst, who is an adviser to the Club of Rome, is also part of a working group which will present a 50-year update to  LtG at the United Nation’s Stockholm +50 meeting in June.\n A promise to “build back better” from the pandemic has been the rallying cry of leaders of major economies but in reality, this cleaner, greener future has so far failed to take shape. Carbon dioxide and methane emissions, the main drivers of the climate crisis caused by burning fossil fuels,  continue to rise.\n In one sense, the updated look at  LtG offers a terrifying vision of the future. However the worst-case scenario is not inevitable, Ms Herrington says, even though the window is rapidly closing to chart a different course, and will require dramatic change.\n For example, she says, the focus solely on net-zero emissions targets is outdated and lacks ambition, as does “thinking at the margins of taxes and pricing”.\n  “We need to completely re-envision what our role is in the world,” she says. “Because what is the purpose? It’s to leave the world a little bit better than you found it.\n  “Ultimately, I think that’s the  Limits to Growth message. It can be better than this, we really can do better, and feel better. I think we have to offer an alternative of what the vision could be.”\n By registering, you will also enjoy limited access to Premium articles, exclusive newsletters, commenting, and virtual events with our leading journalists\n Password Must be at least 6 characters, include an upper and lower case character and a number\n Must be at least 6 characters, include an upper and lower case character and a number\n Must be at least 6 characters, include an upper and lower case character and a number\n I would like to be emailed about offers, events and updates from The Independent.   Read our  Privacy notice\n You can opt-out at any time by signing in to your account to manage your preferences. Each email has a link to unsubscribe.\n     By clicking ‘Create my account’ you confirm that your data has been entered correctly and you have read and agree to our  Terms of use,  Cookie policy and  Privacy notice.\n This site is protected by reCAPTCHA and the Google  Privacy policy and  Terms of service apply.\n  By clicking ‘Register’ you confirm that your data has been entered correctly and you have read and agree to our  Terms of use,  Cookie policy and  Privacy notice.\n This site is protected by reCAPTCHA and the Google  Privacy policy and  Terms of service apply.\n         Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.", "posttime": "2022-02-13 11:55:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "论文,崩溃,predicted,研究", "title": "20世纪70年代的一篇论文预测2040年社会将崩溃，作者现在是这么说的", "title_en": "A 1970s paper predicted societal collapse in 2040-heres what the author says now", "transed": 1, "url": "https://www.independent.co.uk/climate-change/news/social-collapse-prediction-2040-paper-b2011601.html", "via": "", "real_tags": ["论文", "崩溃", "predicted", "研究"]}]