[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1073326, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电击可能正是说服云层产生降雨的原因。新的研究表明，给云增压可以增加水滴之间的吸引力，帮助雨滴生长。我们终于找到制造雨水的方法了吗？\n我们周围充满了电荷。雷雨云会发出噼啪声，但即使是我们呼吸的空气中也有一些带电的气溶胶和水滴。雷丁大学的气象学家Giles Harrison和同事们一直在研究非雷雨云中的水滴电荷。\n由马丁·安巴姆领导并发表在《皇家学会学报A》上的计算表明，电荷的变化越大，液滴之间的吸引力越强。“这推进了我们对电荷如何影响液滴增长的理解，并为回答这个古老的问题带来了一个新的方面：为什么下雨？”哈里森说。\n去年，哈里森和他的同事们在阿拉伯联合酋长国的资助下进行了增雨研究，他们驾驶装有电离器的无人机进入云层，并尝试向空气中释放正电荷和负电荷。新的结果将帮助他们对这些实验进行微调，有可能找到在需要的地方加速降雨形成的方法。", "note_en": "A n electric shock might be just the thing to persuade a cloud to produce some rain. New research suggests that supercharging a cloud could increase the attractive forces between droplets and help raindrops to grow. Have we finally found the recipe for making rain?\n Electric charge is all around us. Thunderclouds literally crackle with it, but even the air we breathe has some charged aerosols and droplets in it. Giles Harrison, a meteorologist at the  University of Reading, and colleagues have been investigating the electric charge of drops in non-thunderstorm clouds.\n  In calculations led by Maarten Ambaum and published in  Proceedings of the Royal Society A, they show that the greater the variation in charges, the stronger the attraction between droplets. “This advances our understanding of how charge influences drop growth and brings a new aspect to answering the age-old question: why does it rain?” says Harrison.\n Last year Harrison and his colleagues, who have been  funded by the United Arab Emirates to research rain enhancement, flew  drones equipped with ionisers into clouds and experimented with releasing positive and negative charges into the air. The new results will help them fine-tune these experiments, potentially to find ways to hasten the formation of rain where it is needed.", "posttime": "2022-02-15 08:08:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "制造,recipe,电荷", "title": "我们终于找到制造雨水的方法了吗？", "title_en": "Have We Finally Found the Recipe for Making Rain?", "transed": 1, "url": "https://www.theguardian.com/news/2022/feb/08/have-we-finally-found-the-recipe-for-making-rain", "via": "", "real_tags": ["制造", "recipe", "电荷"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客攻击。虚假信息。监控赛博是主板&#39；它的播客和关于互联网黑暗底层的报道。\n乌克兰安全部门表示，已经关闭了利沃夫市的一个巨魔农场。\n“SSU网络专家在利沃夫发现并捣毁了两个机器人农场，总容量为18000个假账户，”SSU新闻稿称。“根据初步信息，来自俄罗斯的组织者监督了bot农场的管理人员。”\n根据新闻稿，有三人在两个不同的住宅中参与。其中两人将公寓交给了运营部门，第三人负责维护账户和设备。“机器人农场主要在社交网络中工作：分发假货以传播恐慌，”新闻稿说。“这些机器人还发布了各种设施炸弹威胁的虚假信息。”\nSSU表示，他们查获了两套GSM网关、3000张SIM卡、笔记本电脑和会计记录。GSM网关是一种允许人们使用SIM卡连接到默认网络之外的网络的设备。它们是黑客和其他网络犯罪分子常用的工具，他们可以使用它们管理多个电话号码，并连接到IP语音或VoIP网络。半身像的照片显示了数十个GSM网关，里面塞满了模糊不清的SIM卡。\n乌克兰和俄罗斯边境沿线的其他国家长期以来一直在应对来自邻国的网络犯罪和攻击。今年1月，身份不明的黑客关闭了几家乌克兰政府网站。基辅指责克里姆林宫，克里姆林宫否认其参与。\n据称俄罗斯巨魔农场被关闭之际，乌克兰和俄罗斯之间的紧张局势正在加剧。俄罗斯军队、武器和物资正在俄罗斯和白俄罗斯等邻国的乌克兰边境集结。过去八年来，俄罗斯一直支持乌克兰东顿巴斯地区的叛乱。\n注册即表示您同意使用条款和隐私政策&amp；接收来自Vice Media Group的电子通信，其中可能包括市场推广、广告和赞助内容。", "note_en": "Hacking. Disinformation. Surveillance. CYBER is Motherboard&#39;s podcast and reporting on the dark underbelly of the internet.\n  Ukraine’s Security Service said it has shut down a troll farm in the city of Lviv.\n  “The SSU cyber specialists uncovered and dismantled two bot farms in Lviv with a total capacity of 18,000 fake accounts,” an SSU   press release said. “According to preliminary information, organizers from Russia supervised the administrators of the bot farms.”\n     According to the press release, three people in two different residences were involved. Two gave over their apartments to the operation while a third took care of maintaining the accounts and equipment. “The bot farms worked mostly in social networks: distributed fakes to spread panic,” the press release said. “The bots also published false information about bomb threats at various facilities.”\n   The SSU said it seized two sets of GSM gateways, 3,000 SIM cards, laptops, and accounting records. GSM gateways are equipment that allows people to use SIM cards to connect to networks outside the default network they’re meant to be connected to. They’re popular tools for hackers and other cyber criminals, who can use them to manage several phone numbers, and to connect to Voice Over IP, or VoIP networks. The photos of the bust show dozens of GSM gateways stuffed with blurred SIM cards.\n   Ukraine and other countries along Russia’s border have long dealt with cyber crime and attacks that originate from the neighboring country. In January, unidentified hackers   disabled several Ukrainian government websites. Kiev blamed the Kremlin, and the Kremlin denied its involvement.\n   The shut down of the alleged Russian troll farm comes as tensions between Ukraine and Russia are on the rise. Russian troops, weapons, and supplies are gathering along the   border of Ukraine in Russia and neighboring countries like Belarus. For the past eight years, Russia has backed an insurgency in the eastern Donbas region of Ukraine.\n  By signing up, you agree to the  Terms of Use and  Privacy Policy &amp; to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.", "posttime": "2022-02-15 08:06:47", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "俄罗斯,机器人,sim,busts,网络", "title": "乌克兰用数千张SIM卡捣毁据称的俄罗斯机器人农场", "title_en": "Ukraine Busts Alleged Russian Bot Farm Using Thousands of SIM Cards", "transed": 1, "url": "https://www.vice.com/en/article/4awq8m/video-ukraine-busts-alleged-russian-bot-farm-using-thousands-of-sim-cards", "via": "", "real_tags": ["俄罗斯", "机器人", "sim", "busts", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌&#39；美国默认启用双因素身份验证的决定似乎取得了成果。这家搜索公司透露，在自动启用2FA（Google speak中的两步验证）的用户中，账户违规率下降了50%。暴跌证明了额外的因素是&#34；有效&#34；在保护你的数据方面，谷歌说，尽管它没有&#39；不要透露泄露账户的确切数量。\n该公司没有&#39；我没说2FA预计会以多快的速度传播，但承诺将继续推广到2022年。到目前为止，已有超过1.5亿人自动注册，其中包括超过200万名YouTube创作者。\n该公司还承诺进行更多安全升级，以帮助纪念更安全的互联网日。从3月起，谷歌将允许你选择一个帐户级的安全浏览选项，防止你访问已知的有害网站。谷歌也在扩展助手&#39；在接下来的几个月里，美国将把注重隐私的来宾模式扩展到九种新语言，并承诺在美国中期选举前加强对政客的保护。\n账户违规数量的减少不是&#39；令人震惊的是，需要更多的努力才能破解一个账户，这必然会阻止一些潜在的入侵者。它没有&#39；不过，要展示2FA对安全性的切实影响，以及谷歌的规模，并不总是那么容易；s的用户群为它提供了一个其他人可以提供的代表性样本&#39；不容易匹配。\nEngadget推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果你通过其中一个链接购买东西，我们可能会获得会员佣金。\n由于您的隐私偏好，此内容不可用。在此处更新设置，然后重新加载页面以查看它。", "note_en": "Google&#39;s decision to  enable two-factor authentication by default appears to have borne fruit. The search firm has  revealed that account breaches dropped by 50 percent among those users where 2FA (two-step verification in Google-speak) was auto-enabled. The plunge was proof the extra factor is &#34;effective&#34; in safeguarding your data, Google  said, although it didn&#39;t disclose the exact number of compromised accounts.\n The company didn&#39;t say how rapidly it expected 2FA to spread, but promised to continue the rollout through 2022. More than 150 million people have been auto-enrolled so far, including more than 2 million YouTube creators.\n  The company also promised more security upgrades to help mark Safer Internet Day. As of March, Google will let you opt-in to an account-level safe browsing option that keeps you from visiting known harmful sites. Google is also expanding Assistant&#39;s privacy-minded  Guest Mode to nine new languages in the months ahead, and has promised to ramp up safeguards for politicians ahead of the US midterm elections.\n The reduced volume of account breaches isn&#39;t a shock — requiring more effort to crack an account is bound to deter some would-be intruders. It hasn&#39;t always been easy to show the tangible impact of 2FA on security, though, and the sheer scale of Google&#39;s user base gives it a representative sample others can&#39;t easily match.\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2022-02-15 08:05:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,账户,cut", "title": "谷歌称默认2FA将账户违规减少一半", "title_en": "Google Says Default 2FA Cut Account Breaches In Half", "transed": 1, "url": "https://www.engadget.com/google-says-2fa-default-cut-account-breaches-193745716.html", "via": "", "real_tags": ["谷歌", "google", "账户", "cut"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "埃隆·马斯克（Elon Musk）的卫星互联网服务Starlink刚刚遭受了代价高昂的打击——该公司目前估计，2月3日发射的49颗Starlink卫星中，有40颗将因地磁风暴而被毁。\n这场风暴造成了“比之前发射时高出50%的阻力”，使部署的卫星无法到达其环绕地球的正确轨道。虽然Starlink试图让它们“像一张纸一样”边缘飞行，以减少阻力，但现在看来，其中多达40颗将在地球大气层中燃烧，而不是到达目的地。\nSpaceX最近跨越了2000年的卫星发射里程碑，并计划发射12000颗卫星，如果不是更多的话——因此失去其中的40颗可能不是一件大事。不过，这是猎鹰9号火箭在大气层中燃烧的星链发射能力的绝大部分。\n2月3日星期四，美国东部时间下午1:13，“猎鹰9号”从佛罗里达州肯尼迪航天中心的发射综合体39A（LC-39A）向近地轨道发射了49颗星链卫星。猎鹰9号的第二级将卫星部署到其预定轨道上，近地点距离地球约210公里，每颗卫星都实现了受控飞行。\nSpaceX将其卫星部署到这些较低的轨道上，这样在极少数情况下，任何卫星都不会通过初始系统检查，它将通过大气阻力迅速脱离轨道。虽然低部署高度需要更多功能强大的卫星，但我们要付出相当大的代价，这是保持可持续空间环境的正确做法。\n不幸的是，周四部署的卫星受到了周五地磁风暴的严重影响。这些风暴导致大气变暖，我们低部署高度的大气密度增加。事实上，机载GPS显示，风暴造成的大气阻力的升级速度和严重程度比之前发射时高出50%。Starlink团队指挥卫星进入安全模式，在该模式下，它们将沿边缘飞行（就像一张纸），以最大限度地减少阻力，从而有效地“躲避风暴”——并继续与空间部队第18空间控制中队和LEOLAB密切合作，提供基于地面雷达的卫星更新。\n初步分析表明，低空阻力的增加阻止了卫星离开安全模式开始轨道提升操作，其中多达40颗卫星将重返或已经重返地球大气层。脱轨卫星与其他卫星的碰撞风险为零，按设计，在大气再入时即失效，这意味着不会产生轨道碎片，也不会有卫星部件撞到地面。这种独特的情况表明，Starlink团队为确保该系统处于在轨碎片缓减的前沿，付出了巨大的努力。\n正如你所见，SpaceX正借此机会吹嘘其卫星对天空的影响是多么小——这在过去一个月一直是个问题，因为一项新的研究进一步加深了人们的担忧，即Starlink卫星在绕轨道运行时会在天文学家的图像上留下条纹，并可能阻止我们识别危险的小行星。天文学家正在组建一个“保护黑暗安静的天空免受卫星星座干扰中心”，以应对这一问题。", "note_en": "Elon Musk’s satellite internet service Starlink just got dealt an expensive blow —  the company’s currently estimating that 40 of the 49 Starlink satellites it launched on February 3rd will be destroyed because of a geomagnetic storm.\n The storm caused “up to 50 percent higher drag than during previous launches,” keeping the deployed satellites from reaching their proper orbit around the Earth. And while Starlink tried to fly them “edge-on (like a sheet of paper)” to reduce that drag, it now looks like as many as 40 of them will burn up in the Earth’s atmosphere instead of reaching their destinations.\n SpaceX  recently crossed the 2,000 satellite launch milestone, and has plans to launch 12,000 if not a great many more — so losing 40 of them might not be a huge deal in the grand scheme of things. Still, that’s the vast majority of an entire Falcon 9 rocket’s Starlink launch capacity burning up in the atmosphere.\n  On Thursday, February 3 at 1:13 p.m. EST, Falcon 9 launched 49 Starlink satellites to low Earth orbit from Launch Complex 39A (LC-39A) at Kennedy Space Center in Florida. Falcon 9’s second stage deployed the satellites into their intended orbit, with a perigee of approximately 210 kilometers above Earth, and each satellite achieved controlled flight.\n SpaceX deploys its satellites into these lower obits so that in the very rare case any satellite does not pass initial system checkouts it will quickly be deorbited by atmospheric drag. While the low deployment altitude requires more capable satellites at a considerable cost to us, it’s the right thing to do to maintain a sustainable space environment.\n Unfortunately, the satellites deployed on Thursday were significantly impacted by a geomagnetic storm on Friday. These storms cause the atmosphere to warm and atmospheric density at our low deployment altitudes to increase. In fact, onboard GPS suggests the escalation speed and severity of the storm caused atmospheric drag to increase up to 50 percent higher than during previous launches. The Starlink team commanded the satellites into a safe-mode where they would fly edge-on (like a sheet of paper) to minimize drag—to effectively “take cover from the storm”—and continued to work closely with the Space Force’s 18th Space Control Squadron and LeoLabs to provide updates on the satellites based on ground radars.\n Preliminary analysis show the increased drag at the low altitudes prevented the satellites from leaving safe-mode to begin orbit raising maneuvers, and up to 40 of the satellites will reenter or already have reentered the Earth’s atmosphere. The deorbiting satellites pose zero collision risk with other satellites and by design demise upon atmospheric reentry—meaning no orbital debris is created and no satellite parts hit the ground. This unique situation demonstrates the great lengths the Starlink team has gone to ensure the system is on the leading edge of on-orbit debris mitigation.\n As you can see, SpaceX is taking this opportunity to tout how little its satellites impact the skies — something that’s been in question this past month, as  a new study furthers the concern that Starlink satellites are  leaving streaks across astronomers’ images as they orbit, and could prevent us from identifying dangerous asteroids. Astronomers are forming  a “Centre for the Protection of the Dark and Quiet Sky from Satellite Constellation Interference” to combat the issue.", "posttime": "2022-02-15 07:59:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风暴,starlink,卫星", "title": "一场地磁风暴可能已经摧毁了40颗SpaceX Starlink卫星", "title_en": "A Geomagnetic Storm May Have Effectively Destroyed 40 SpaceX Starlink Satellites", "transed": 1, "url": "https://www.theverge.com/2022/2/8/22924561/spacex-starlink-satellites-geomagnetic-storm", "via": "", "real_tags": ["风暴", "starlink", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一项小型试验中，人们在练习了两种简单易行的身体技术后，站着时感觉不那么眩晕。\n加拿大的研究人员表示，他们已经提出了两种简单的物理技术来帮助预防头晕和晕厥的常见原因。在一项小型试验中，他们发现，这些动作只需要移动下肢，就可以有效地减轻初始直立性低血压的症状，这种情况会让人站起来时暂时头晕。\n直立性低血压是一种低血压，发生在人们从坐姿或躺姿站起来时，导致头晕甚至昏厥。通常，这种情况可能与潜在的神经系统问题有关，也可能是许多药物的副作用，这些病例往往会影响老年人。但在其他情况下，血压下降的速度非常快，只需一分钟，而且可能与任何其他健康问题无关；这种形式被称为初始直立性低血压（IOH），它往往会影响年轻人。\n虽然很多人都会经历IOH，但从来没有将其视为一个大问题，一些患者可能会反复或严重地发生IOH，从而影响他们的日常功能。研究者Satish Raj是卡尔加里大学心脏节律的心脏病专家，他的同事们经常在他们的精神障碍和昏迷的诊所看到这些类型的病人。他们想知道，除了生活方式的改变，比如喝更多的水或药物，他们是否还能为这些患者提供更多的东西。\n拉杰在电话中告诉Gizmodo：“在某种程度上，每个人都可能在生活中的某个时候经历过这种情况。但也有人经常发生这种情况。这种情况可能会导致残疾。”。\n正如他所解释的，当人们站起来时，血流通常会向下转移到我们的胸部以下。但在IOH中，这种变化似乎伴随着一种反射，这种反射是由我们站立时肌肉的激活触发的，导致血管广泛开放，正是这种结合导致血压迅速但暂时的下降。基于Raj团队早期的工作以及其他研究，他们假设IOH患者可以通过早期激活反射或在站立时拉紧下肢肌肉来缩短这一过程，从而在一定程度上缓解血压下降。\n为了验证这一点，他们招募了22名IOH志愿者，尝试他们开发的两种技术。其中一种方法是从坐姿开始预激活反射后面的肌肉，每次只需抬起一个膝盖，持续30秒。另一组要求人们站立，然后交叉双腿，紧握大腿和臀部，收紧下肢。作为对照，志愿者也会正常站立。\n与对照组相比，在对志愿者的血液循环和自我报告的症状进行测量后，两种技术都改善了患者的IOH。据传闻，拉杰诊所的患者在采取这些策略后也取得了类似的成功。研究小组的研究结果周三发表在《心律》杂志上。\n“它是免费的，没有任何药物副作用，完全在他们的控制范围内，我想很多患者都喜欢，”拉杰说。\n值得注意的是，该试验的结果是基于小样本的，所有志愿者都是女性。拉杰说，这项试验的目的不仅仅是为了让女性参与，而且他们以先到先得的方式招募志愿者。女性快速志愿的事实可能反映出IOH对她们的影响更为频繁，但他认为这些技术没有理由不能帮助男性进行IOH。他指出，政府和卫生相关组织通常需要进行大规模试验，以支持某种疾病的治疗，这种试验的资金成本很高，但他的团队可能会进行较小的试验，在男性身上测试这种方法，或确定结合这些方法是否能提高其有效性。\n虽然其他人可能需要更多的研究才能广泛支持这些技术的使用，但拉杰希望他们的工作至少能提高人们对IOH的总体认识。\n拉杰说：“对我来说，这里更重要的信息是，最初的直立性低血压是存在的。这听起来可能很傻，但我已经有医生推荐了等待半年以上才来看我的患者。我认为这说明了一个事实，即这一点尚未被认识到。”。“因此，我希望通过强调这个问题，以及有一种可能的治疗方法，更多的人会认识到他们可能患有这种疾病。然后我们可以尝试简单的治疗方法。但是，除非他们意识到问题是什么，否则你无法将其传达给患者。”", "note_en": "In a small trial, people felt less dizzy when standing after practicing two easy-to-do physical techniques.\n Researchers in Canada say they’ve come up with two simple physical techniques to help prevent a common cause of dizziness and fainting. In a small trial, they found that these maneuvers, which involve nothing more than moving your lower limbs, could effectively reduce the symptoms of initial orthostatic hypotension, a condition that temporarily leaves people light headed when they stand up.\n  Orthostatic hypotension is a form of low blood pressure that happens when people stand up from sitting or lying down, leading to dizziness or even fainting. Often, this condition can be linked to underlying neurological problems, or it can happen as a side effect of many medications, and these cases tend to affect older people. But other times, this drop in blood pressure comes and goes very rapidly, within as little as a minute, and it may not be linked to any other health problems; this form is called   initial orthostatic hypotension (IOH) and it tends to affect younger people.\n Though many people can experience IOH without ever registering it as a big problem, some sufferers can have repeated or severe enough episodes of IOH that it routinely affects their daily functioning. Study author Satish Raj, a heart rhythm cardiologist at the University of Calgary, and his colleagues have often seen these sorts of patients at their dysautonomia and fainting clinic. And they wondered if there was something more they could offer these patients besides lifestyle changes like drinking more water or medications.\n    “On some level, everyone’s probably experienced this at some point in their life. But there are people in whom this happens a lot. And it can be disabling,” Raj told Gizmodo by phone.\n  As he explains it, when people stand up, blood flow normally shifts downward to below our chest. But in IOH, this change seems to be accompanied by a reflex, triggered by the activation of muscles as we stand up, that causes blood vessels to open widely—and it’s this combination that then causes the rapid but temporary drop in blood pressure. Based on Raj’s team’s earlier work, as well as other research, they hypothesized that people with IOH could short-circuit this process by activating the reflex early or by tensing the lower limb muscles as they stood, somewhat mitigating the blood pressure drop.\n   To test this out, they recruited 22 volunteers with IOH to try out both of the techniques they developed. One method involved pre-activating the muscles behind the reflex from a sitting position, done simply by raising the knees one at a time for up to 30 seconds. The other asked people to stand and then tense up their lower limbs, by crossing their legs and clenching their thighs and butt. As a control, the volunteers would also stand up normally.\n Compared to the control condition, on measures of both the volunteers’ circulation and their self-reported symptoms, people’s IOH improved after doing either technique. And Raj’s patients in the clinic have anecdotally reported similar success after adopting the strategies. The team’s findings were   published Wednesday in the journal Heart Rhythm.\n  “It’s free, it doesn’t have any drug side effects, and it’s totally within their control, which I think a lot of patients like,” Raj said.\n It’s important to note that the trial’s findings are based on a small sample size, and that all of the volunteers were women. Raj says the trial wasn’t intended to only include women and that they took on volunteers on a first-come-first-served basis. The fact that women volunteered quickly might reflect that IOH affects them more often, but he sees no reason why these techniques wouldn’t help men with IOH. He noted that large-scale trials—the kind often needed for governments and health-related organizations to endorse treatments for a condition—are expensive to fund, but his team may yet conduct smaller trials to test out the methods in men or to determine whether combining the methods boosts their effectiveness.\n  While it may take more research for others to widely support the use of these techniques, Raj hopes their work can at least raise awareness of IOH in general.\n  “To me, the bigger message here is that initial orthostatic hypotension exists. And that might sound like a silly thing to say, but I’ve had physicians referring patients that wait over half a year to see me for this problem. And I think that speaks to the fact that this isn’t recognized,” Raj said. “And so, my hope is that by highlighting the problem, and that there’s a possible treatment, some more people will recognize that they might have it. And then we can try out the simple treatment. But you can’t get that to the patient unless they realize what the problem is.”", "posttime": "2022-02-15 07:56:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "减少,movements,可能", "title": "研究发现，两个简单的动作可以减少站立时的眩晕", "title_en": "Two Simple Movements Can Reduce Dizziness When Standing Up, Study Finds", "transed": 1, "url": "https://gizmodo.com/study-how-to-prevent-dizziness-when-standing-1848507098", "via": "", "real_tags": ["减少", "movements", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073318, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "距离今年第一场预计将推出新款iPhone SE和iPad Air的活动只有几周的时间了，有关苹果计划在2022年剩余时间内推出哪些产品的传言已经沸沸扬扬。它看起来像Mac电脑，Mac电脑，还有更多的Mac电脑。\n根据马克·古尔曼（Mark Gurman）最新的开机通讯，苹果准备在2022年推出不少于四台M2 Mac电脑。首批机型可能会在今年晚些时候面世，重新设计的MacBook Air将引领潮流，紧随其后的是新的13英寸MacBook Pro、24英寸iMac和入门级MacMini。DigiTimes周二的一份报告称，13英寸的MacBook Pro可能会在苹果的春季发布会上发布，以迎接新芯片的到来。\n与2021一样，苹果将在2022发布多个不同芯片的Mac电脑。M2将是M1的继任者，可能采用相同的8核设计（四个性能核和四个效率核），M1 Pro和M1 Max将进入更高端的Mac。第一款是27英寸的iMac，可能会在苹果的春季发布会上亮相，今年晚些时候还会推出Mac mini。\n根据传闻将于2022年推出的Mac电脑，苹果硅芯片的开发周期为18个月。第一批M1 Mac是在2020年11月发布的，因此6月份发布大约需要一年半的时间。秋季发布的新24英寸iMac也是如此。\n2022年，苹果公司将推出一款新的Mac Pro，作为苹果硅芯片转型的高潮。这意味着，今年所有Mac系列和几乎所有型号都将进行更新，只有最近发布的14英寸和16英寸MacBook Pro没有更新。\n更新2/8：一份DigiTimes报告称，13英寸MacBook Pro可能是2022年推出的第一款新M2机型。\n注意：当你点击我们文章中的链接后购买物品时，我们可能会获得少量佣金。阅读我们的会员链接政策了解更多详细信息。\n自从iPod成为iWalk以来，迈克尔·西蒙一直在报道苹果。他对技术的痴迷可以追溯到他的第一台个人电脑——IBM Thinkpad，它带有提升式键盘，用于更换驱动器。他&#39；It’他仍在等待它的回归。", "note_en": "With just weeks to go until the f irst event of the year that’s expected to bring a new  iPhone SE and  iPad Air, rumors are already swirling about what Apple has planned for the rest of 2022. And it’s looking like Macs, Macs, and more Macs.\n According to Mark Gurman’s latest  Power On newsletter, Apple is preparing to launch no less than four M2 Macs throughout 2022. The first models will likely arrive later in the year, with the redesigned MacBook Air leading the way, followed by a  new 13-inch MacBook Pro,  24-inch iMac, and  entry-level Mac mini. A  DigiTimes report on Tuesday said the 13-inch MacBook Pro may launch at Apple’s spring event to usher in the new chip.\n Like 2021, Apple will be releasing Macs with several different chips in 2022. The M2 will be a successor to the M1, likely with the same 8-core design (four performance cores and four efficiency cores), and the M1 Pro and M1 Max will make their way into more high-end Macs. The first of those, the 27-inch iMac, could arrive at Apple’s spring event, with a  Mac mini coming later in the year.\n Based on the Macs rumored to launch in 2022, Apple silicon is on an 18-month cadence. The first M1 Macs were released in November 2020, so a June release would be roughly a year in a half. The same would go for a fall launch for a new 24-inch iMac.\n    There’s also a new  Mac Pro due in 2022 as the culmination of the Apple silicon transition. That would mean every Mac line is due for a refresh this year and nearly every model, with only the recently released 14-inch and 16-inch MacBook Pro escaping without a refresh.\n Update 2/8:  A  DigiTimes report says the 13-inch MacBook Pro could be the first new M2 model to launch in 2022.\n Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our   affiliate link policy  for more details.\n    Michael Simon has been covering Apple since the iPod was the iWalk. His obsession with technology goes back to his first PC—the IBM Thinkpad with the lift-up keyboard for swapping out the drive. He&#39;s still waiting for that to come back in style tbh.", "posttime": "2022-02-15 07:45:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,设计,m1,mac,苹果", "title": "每一款M1 Mac都将于2022年更新，采用更快的M2芯片和新设计", "title_en": "Every M1 Mac Is Due For a 2022 Refresh With Faster M2 Chip, New Designs", "transed": 1, "url": "https://www.macworld.com/article/612350/apple-planning-to-upgrade-every-m1-mac-in-2022.html", "via": "", "real_tags": ["芯片", "设计", "m1", "mac", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073317, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位长期担任视觉特效导演的导演是有史以来最具影响力的一些科幻电影的幕后黑手。\n道格拉斯·特鲁姆贝尔（Douglas Trumbull）于周一去世，享年79岁。特鲁姆贝尔是《银翼杀手》（Blade Runner）的视觉特效策划人，《第三类亲密接触》（2001年：太空漫游）和其他众多作品的幕后黑手。他的女儿Amy Trumbull在Facebook上宣布了这一消息，并写道，她父亲的去世是在与癌症、脑瘤和中风进行了“两年的斗争”之后。\n特伦贝尔1942年4月8日出生于洛杉矶，父亲是一名机械工程师和艺术家。他的父亲曾为《绿野仙踪》和《星球大战：新希望》等电影制作特效。年轻的特鲁姆贝尔曾在好莱坞担任插图画家和喷枪艺术家多年。在他给斯坦利·库布里克（Stanley Kubrick）打了电话之后，他的职业生涯真正腾飞了。这段对话促成了他在《2001：太空漫游》中的工作。\n他对2001年最重要的贡献之一是创作了电影《星际之门》，这是一个开创性的场景，宇航员戴夫·鲍曼（Dave Bowman）在这一场景中穿过一条穿越时空的发光隧道。为了满足库布里克对拍摄的高审美标准，特伦贝尔设计了一种将胶片相机翻过来的方法。特伦贝尔的特别技术“完全打破了相机应该做什么的概念，”他在TIFF的一次演讲中说。\n特鲁姆贝尔凭借《星际迷航：电影与银翼杀手》获得奥斯卡视觉特效提名。他还接见了总统&#39；1996年获得美国电影摄影师协会颁发的奥斯卡奖。\n在他职业生涯的后期，特伦贝尔表达了对计算机对视觉效果影响的厌恶，谴责CGI新时代的廉价化和扁平化影响。“今天，电影视觉效果行业几乎完全被计算机图形学所取代。我们能够做一些在过去绝对不可想象的事情，比如水特效、火灾、爆炸、烟雾。但是，今天视觉效果行业几乎所有的东西都是在计算机上创造的。有一种商品化的趋势这导致我对自己感到不舒服。我喜欢微缩和物理效果，以及我所说的有机效果，”特伦贝尔在2018年接受《好莱坞记者》采访时说。\n他在生命的最后几年致力于一种新的超级沉浸式电影格式，他称之为MAGI，他相信这将改善在影院观看电影的体验。但特伦贝尔很难引起当今电影业的兴趣。“我感兴趣的是能够为观众创造深刻的个人体验，”特伦贝尔在2016年接受麻省理工学院技术评论时说。“不管是什么，我想让你感觉屏幕上发生的事情实际上是实时发生的，对你来说，在这个剧场里。”\nEngadget推荐的所有产品均由我们的编辑团队选择，独立于我们的母公司。我们的一些故事包括附属链接。如果你通过其中一个链接购买东西，我们可能会获得会员佣金。\n由于您的隐私偏好，此内容不可用。在此处更新设置，然后重新加载页面以查看它。", "note_en": "The longtime visual effects director was behind some of the most influential sci-fi films of all time.\n  Douglas Trumbull, the visual effects mastermind behind  Blade Runner,  Close Encounter of the Third Kind,  2001: A Space Odyssey and numerous others, died on Monday at age 79. His daughter Amy Trumbull  announced the news on Facebook, writing that her father’s death followed a “two-year battle” with cancer, a brain tumor and stroke.\n Trumbull was born on April 8, 1942 in Los Angeles, the son of a mechanical engineer and artist. His father worked on the special effects for films including  The Wizard of Oz and  Star Wars: A New Hope. The younger Trumbull worked as an illustrator and airbrush artist in Hollywood for many years. His career really took off after he  cold-called Stanley Kubrick, a conversation which led to a job working on  2001: A Space Odyssey.\n  One of his most significant contributions to  2001 was creating the film’s  Star Gate, a ground-breaking scene where astronaut Dave Bowman hurtles through an illuminated tunnel transcending space and time. In order to meet Kubrick’s high aesthetic standards for the shot, Trumbull essentially designed a way to turn the film camera inside-out. Trumbull’s ad hoc technique “was completely breaking the concept of what a camera is supposed to do,” he said  during a lecture at TIFF.\n Trumbull earned visual effects Oscar nominations for his work on  Close Encounters, Star Trek: The Motion Picture and  Blade Runner. He also received the President&#39;s Award from the American Society of Cinematographers in 1996.\n Later in his career, Trumbull voiced distaste over the impact of computers on visual effects, decrying the cheapening and flattening impact of the new era of CGI. “Today, the motion picture visual effects industry has almost entirely given way to computer graphics. We’re able to do things that were absolutely inconceivable in the old days like water effects, fire, explosions, smoke. But, almost everything in the visual effects industry today is created on computers. There’s a certain commoditization that has resulted that I’m not comfortable with myself. I like miniatures and physical effects and what I call organic effects,” said Trumbull in a 2018  interview for  The Hollywood Reporter.\n He spent the last years of his life working on a new super-immersive film format he dubbed  MAGI, which he believed would improve the experience of watching a film in theaters. But Trumbull struggled to draw the interest of today’s film industry. “What interests me is being able to create profound personal experiences for audiences,” Trumbull  told  MIT Technology Review in 2016. “Whatever it is, I want you to feel like what’s happening on the screen is actually happening in real-time, to you, in this theater.”\n   All products recommended by Engadget are selected by our editorial team, independent of our parent company. Some of our stories include affiliate links. If you buy something through one of these links, we may earn an affiliate commission.\n   This content is not available due to your privacy preferences.  Update your settings here, then reload the page to see it.", "posttime": "2022-02-15 07:43:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电影,vfx,trumbull", "title": "道格拉斯·特伦贝尔（Douglas Trumbull）是《银翼杀手》（Blade Runner）、《2001》（2001）等电影的VFX天才，享年79岁", "title_en": "Douglas Trumbull, VFX Whiz For 'Blade Runner', '2001' and Others, Dies At 79", "transed": 1, "url": "https://www.engadget.com/douglas-trumbull-visual-effects-death-200939015.html", "via": "", "real_tags": ["电影", "vfx", "trumbull"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073316, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "ExpressVPN更新了其漏洞奖励计划，使其对道德黑客更具吸引力，现在向任何可能危害其系统的人提供一次性10万美元的漏洞奖励。\nExpressVPN是使用最广泛的VPN（虚拟专用网络）产品之一，它为用户提供网络浏览隐私和绕过地理限制的能力。\n这种隐私通过传递给用户&#39；s通过加密隧道传输互联网流量，而用户&#39；的实际IP地址隐藏在VPN服务提供的IP地址后面。\n因此，危及此类系统的安全性会导致这些产品最关键的卖点之一——用户——出现故障；隐私\n这就是为什么ExpressVPN提供漏洞奖励计划，允许安全审计员和研究人员报告公司的漏洞#39；并获得金钱奖励。\n今天，ExpressVPN宣布，他们现在为其内部技术TrustedServer中的关键漏洞提供10万美元的漏洞悬赏。\n&#34;这是Bugcrowd平台上提供的最高单笔悬赏，比ExpressVPN和#34之前提供的最高悬赏高出10倍；该公司在给BleepingComputer的电子邮件中分享了这一信息。\n第一个提交有效漏洞、允许未经授权访问或暴露客户数据的人将获得10万美元的悬赏。此一次性奖金在领奖前有效。\n一次性10万美元奖金仅适用于ExpressVPN VPN服务器中的漏洞。\n活动应保留在TrustedServer平台的范围内。如果不确定您的测试是否在范围内，请联系support@bugcrowd.com先确认一下。\nExpressVPN还邀请安全研究人员发现泄露客户端实际IP地址和监控用户流量的可能方法。\nbug bounty项目通过BugCrowd运行，它为试图突破ExpressVPN的研究人员提供了一个安全的避风港&#39；s服务器作为程序的一部分。\nTrustedServer是基于Debian Linux定制的操作系统，具有专有的安全增强功能，非常适合在VPN基础设施中使用。\nExpressVPN对其服务器采用仅限RAM的方法，并采用定期数据擦除系统，在重新启动时激活。\n该系统有一个构建验证，可防止内部代码篡改事件，并每周在每个ExpressVPN服务器上使用干净的安装进行修补。\n很可能很难找到可以利用的漏洞，尤其是在漏洞悬赏计划已经实施了六年之后，因此奖金会增加。\n如果你&#39；如果你对自己的黑客能力充满信心，并对上述挑战感兴趣，你可以从这里开始参与该计划。", "note_en": "ExpressVPN has updated its bug bounty program to make it more inviting to ethical hackers, now offering a one-time $100,000 bug bounty to whoever can compromise its systems.\n ExpressVPN is one of the most widely used VPN (virtual private networks) products, which offers users web browsing privacy and the ability to bypass geo-restrictions.\n This privacy is achieved by passing the user&#39;s internet traffic through encryption tunnels, while the user&#39;s actual IP address is hidden behind one provided by the VPN service.\n As such, compromising the security of this type of system results in failure on one of the most critical selling points of these products, users&#39; privacy.\n This is why ExpressVPN offers a bug bounty program, allowing security auditors and researchers to report vulnerabilities in the company&#39;s infrastructure and software and receive monetary bug bounty rewards.\n  Today, ExpressVPN announced that they are now offering a $100,000 bug bounty for critical vulnerabilities in their in-house technology, TrustedServer.\n &#34;This is the highest single bounty offered on the Bugcrowd platform and 10 times higher than the top reward previously offered by ExpressVPN,&#34; the company shared in an email to BleepingComputer.\n  The first person to submit a valid vulnerability, granting unauthorized access or exposing customer data, will receive the US$100,000 bounty. This one-time bonus is valid until the prize has been claimed.\n The one-time US$100,000 bounty is only eligible for vulnerabilities in ExpressVPN’s VPN Server.\n Activities should remain in scope to the TrustedServer platform. If unsure that your testing is considered in-scope, please reach out to support@bugcrowd.com to confirm first.\n ExpressVPN also invites security researchers to uncover possible ways to leak the actual IP address of clients and monitor user traffic.\n The  bug bounty program is run through BugCrowd, which offers a safe harbor for researchers who attempt to breach ExpressVPN&#39;s servers as part of the program.\n  TrustedServer is a custom-built operating system based on Debian Linux, featuring proprietary security enhancements that make it ideal for use in VPN infrastructure.\n ExpressVPN follows a RAM-only approach for its servers and employs a periodic data wiping system that activates upon reboots.\n The system has a build verification that prevents insider code tampering events and is patched every week with clean installations on every ExpressVPN server.\n It will likely be hard to find bugs to leverage, especially after the bug bounty program has been available for the past six years, hence the hike in the payouts.\n If you&#39;re confident in your hacking abilities and interested in the above challenge, you can take part in the program  from here.", "posttime": "2022-02-15 07:39:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,黑客攻击,hacks,expressvpn", "title": "ExpressVPN向黑客攻击其服务器的第一人提供10万美元", "title_en": "ExpressVPN Offering $100,000 To First Person Who Hacks Its Servers", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/expressvpn-offering-100-000-to-first-person-who-hacks-its-servers/", "via": "", "real_tags": ["黑客", "黑客攻击", "hacks"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073315, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑客攻击。虚假信息。监控赛博是主板&#39；它的播客和关于互联网黑暗底层的报道。\n根据主板获得的一封电子邮件，纽约警察局（NYPD）专注于情报收集的部门收到了NSO集团备受争议的Pegasus间谍软件产品的演示。\n这条新闻提供了更多关于以色列公司NSO集团进军美国监控市场的信息，特别是它向美国警察部队推销该公司的技术。《纽约时报》报道称，FBI在2019年为了评估目的购买了一个飞马座许可证后，才得出上述结论。\n“罗格斯大学刑事司法学院（Rutgers School of Criminal Justice）将有一个附带调查软件的演示，”新泽西州北部纽瓦克/泽西市UASI的项目经理詹姆斯·希恩（James Sheehan）在2015年8月的电子邮件中写道。UASI是城市地区安全倡议，由国土安全部管理，汇集执法、消防、公共卫生等机构，以应对恐怖主义威胁和其他问题。“观众是UASI/CorrStat地区和纽约警察局英特尔公司，”希恩继续说。\n你在NSO集团或类似公司工作吗？你还了解这些公司吗？我们&#39；I’我很高兴收到你的来信。使用非工作电话或计算机，您可以通过+44 20 8133 5190的信号、josephcox的Wickr或电子邮件与Joseph Cox安全联系。cox@vice.com  .\nSheehan和#39的获奖者；伯根县检察官的代表&#39；s办公室，泽西市&#39；还有帕特森警察局，一个只有15万人口的城市。\nSheehan的电子邮件中附有一本关于Pegasus的小册子，这是NSO集团的黑客产品，它宣传了该工具获取目标电话、联系人、电子邮件、WhatsApp消息、跟踪其位置等信息的能力。该手册包含NSO集团北美分公司WestBridge的标识。\n“把你目标的智能手机变成一座智能金矿，”帕伽索斯的小册子上写道。\n“纽约警察局情报”可能指的是纽约警察局的情报局。它的使命是“通过使用情报主导的警务手段来侦查和破坏犯罪和恐怖活动。与传统的警务方法相结合，情报局的军警和文职分析人员从各种来源收集和分析信息，以推进犯罪和恐怖分子调查，”他说纽约警察局的网站。\n主板通过公共记录请求获得了这封电子邮件。UASI和纽约警察局均未回复置评请求。NSO集团没有回应记者就其为纽约警察局做的演示置评的请求。\n主板首次披露NSO集团在2020年试图将其黑客技术出售给美国警察局，包括圣地亚哥警察局和洛杉矶警察局。在这些案例中，恶意软件被贴上了“幻影”的标签，但手册显示，其功能基本相同。\n在主板之前获得的电子邮件中，圣地亚哥警察局的一名官员称该工具“棒极了”这些邮件还描述了NSO集团推出的另外两款产品，分别是“Landmark”和“Hook”NSO的一位前员工之前告诉主板，Landmark是一个“SS7定位系统”SS7是手机用来通信的底层网络和相关协议，允许攻击者对手机进行地理定位。\n主板还透露，美国缉毒局收到了NSO集团的演示，但没有购买该公司的产品，因为它太贵了。\n《纽约时报》上个月的报道称，FBI支付了500万美元购买了飞马座的许可证，FBI在给《卫报》的一份声明中称，此次购买仅用于“产品测试和评估”\n美国商务部工业和安全局（Bureau of Industry and Security）将NSO Group列入联邦非公开名单，禁止任何美国公司或个人向NSO Group出售或提供服务，NSO Group目前正面临生存危机。\nNSO集团目前也卷入了国内争议，此前以色列出版物《名单》披露，NSO集团的软件被以色列警方用来对付首席执行官、记者、抗议者，甚至前总理本杰明·内塔尼亚胡的儿子阿夫纳·内塔尼亚胡。\n注册即表示您同意使用条款和隐私政策&amp；接收来自Vice Media Group的电子通信，其中可能包括市场推广、广告和赞助内容。", "note_en": "Hacking. Disinformation. Surveillance. CYBER is Motherboard&#39;s podcast and reporting on the dark underbelly of the internet.\n  A section of the New York Police Department (NYPD) focused on intelligence gathering received a demo of NSO Group’s controversial Pegasus spyware product, according to an email obtained by Motherboard.\n  The news provides more insight into Israeli company NSO Group’s push into the surveillance market in the United States, and specifically its pitching of the company’s technology to American police forces. The findings come after   the New York Times  reported that the FBI bought a Pegasus licence in 2019 for evaluation purposes.\n    “There will be a demo of the attached investigative software at the Rutgers School of Criminal Justice,” James Sheehan, a program manager from the Northern New Jersey-Newark/Jersey City UASI, wrote in the August 2015 email. The UASI is the Urban Area Security Initative, a program administered by the Department of Homeland Security which brings together bodies from law enforcement, fire service, public health, and more to address threats of terrorism and other issues. “The audience is the UASI/CorrStat region and NYPD intel,” Sheehan continued.\n Do you work at NSO Group or a similar company? Do you know anything else about these firms? We&#39;d love to hear from you. Using a non-work phone or computer, you can contact Joseph Cox securely on Signal on +44 20 8133 5190, Wickr on josephcox, or email  joseph.cox@vice.com  .\n  Recipients on Sheehan&#39;s email inviting people to attend included representatives from the Bergen County Prosecutor&#39;s Office, Jersey City&#39;s public safety agency, and the Paterson Police Department, a city of just over 150,000.\n  Attached to Sheehan’s email was a brochure for Pegasus, NSO Group’s hacking product, which advertised the tool’s ability to obtain a target’s calls, contacts, emails, WhatsApp messages, track their location, and more. The brochure contains a logo for WestBridge, NSO Group’s North American branch.\n    “Turn Your Target’s Smartphone into an Intelligence Gold Mine,” the Pegasus brochure reads.\n  “NYPD intel” likely refers to the NYPD’s Intelligence Bureau. Its mission is to “detect and disrupt criminal and terrorist activity through the use of intelligence-led policing. In combination with traditional policing methods, uniformed officers and civilian analysts in the Intelligence Bureau collect and analyze information from a variety of sources in order to advance criminal and terrorist investigations,”  according to the NYPD’s website.\n  Motherboard obtained the email via a public records request. Neither the UASI or the NYPD responded to a request for comment. NSO Group did not respond to a request for comment on its demo for the NYPD.\n   Motherboard first revealed NSO Group’s attempts to sell its hacking technology to American police departments in 2020, including the San Diego Police Department  and the Los Angeles Police Department. In those cases, the malware was branded as “Phantom,” but the functionality is largely the same, according to the brochures.\n  In emails previously obtained by Motherboard, one San Diego Police Department officer described the tool as “awesome.” Those emails also described two other products NSO Group pitched called “Landmark” and “Hook.” A former NSO employee previously told Motherboard that Landmark was a “SS7 locating system.” SS7 is an underlying network and related protocol that phones use to communicate, and which allows an attacker to geolocate phones.\n    Motherboard also revealed that the Drug Enforcement Administration received a demo from NSO Group,  but didn’t buy the company’s product because it was too expensive.\n  After  the New York Times report last month which said the FBI paid $5 million for a Pegasus license,  the FBI said in a statement to   The Guardian that the purchase was for “product testing and evaluation only.”\n  NSO Group is currently facing an existential crisis after the U.S. Commerce Department’s Bureau of Industry and Security added the company to a federal denylist that stops any American company or individual  from selling or providing their services to NSO Group.\n  NSO Group is also currently embroiled in controversy domestically, after the Israeli publication  Calcalist revealed NSO Group’s software was used by Israeli police against CEOs, journalists, protestors, and even former Prime Minister Benjamin Netanyahu’s son, Avner Netanyahu.\n  By signing up, you agree to the  Terms of Use and  Privacy Policy &amp; to receive electronic communications from Vice Media Group, which may include marketing promotions, advertisements and sponsored content.", "posttime": "2022-02-15 07:36:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,集团,group,nso", "title": "NSO集团向纽约警察局提供了Pegasus间谍软件演示", "title_en": "NSO Group Gave Pegasus Spyware Demo To the NYPD", "transed": 1, "url": "https://www.vice.com/en/article/m7vp93/nso-group-pegasus-demo-nypd", "via": "", "real_tags": ["软件", "集团", "group", "nso"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073314, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该机构在周一（2月7日）宣布，它已选择航空航天公司洛克希德·马丁公司制造火星上升飞行器（MAV），这是一种小型火箭，将在大约十年后向地球发射原始的红色行星样本。\n&#34;致力于火星上升飞行器代表着一个早期和具体的步骤，以敲定这个雄心勃勃的项目的细节，不仅是登陆火星，而且是从火星起飞；美国宇航局总部科学副局长托马斯·祖尔布钦在一份声明中说。\n&#34;我们的火星样本返回任务的概念阶段即将结束，各部分将汇集在一起，从另一颗行星&34；祖尔布钦补充道&#34;一旦进入地球，它们就可以被最先进的工具研究，这些工具过于复杂，无法运输到太空中&#34;\n火星样本返回是NASA和欧洲航天局（ESA）的共同努力。多亏了NASA&#39；2021年2月，我们在火星上着陆。到目前为止，这台六轮机器人已经收集了一些样本，如果一切按计划进行，最终将捕获几十个样本。\n下一个重大步骤计划在20世纪20年代中期开始，届时将启动另外两项任务——NASA领导的样本回收着陆器（SRL）和ESA&#39；s地球返回轨道器（ERO）。\nSRL将提供ESA&#34；把罗孚和#34；还有MAV飞到火星表面。fetch漫游者将把从“毅力”号（或“毅力”号储存样本的地点）收集的样本运送到MAV，MAV随后将把它们发射到围绕这颗红色行星的轨道上。然后，一个装有样本的容器将与能源监管局会合，能源监管局将最早在2031年将样本运回地球。\n一旦样本落地，世界各地设备齐全的实验室的科学家将对其进行研究，寻找古代火星生命的迹象、火星的线索&#39；美国宇航局官员表示，美国的进化史和其他感兴趣的话题。\n&#34;当第一次机器人往返任务从另一个星球获取样本时，这一开创性的努力注定会激励世界——这是一个重要的步骤，最终将有助于将第一批宇航员送往火星；美国宇航局局长比尔·纳尔逊在同一份声明中说。\n&#34;美国对火星样本回收计划的投资将实现一个最优先的行星科学目标，并表明我们致力于全球合作，确保NASA在探索和发现领域保持领先地位；纳尔逊补充道。\nNASA官员在今天的&#39；这是我的声明。合同工程将于2月25日开始，为期六年。在此期间，洛克希德·马丁公司将建造多个微型飞行器测试单元和飞行单元。\n迈克·沃尔是&#34；在那里&#34；（大中央出版社，2018年；卡尔·泰特插画），一本关于寻找外星生命的书。在Twitter@michaeldwall上关注他。在Twitter@Spacedotcom或Facebook上关注我们。\n加入我们的太空论坛，继续谈论最新的太空任务、夜空等等！如果您有新闻提示、更正或评论，请联系我们：community@space.com.", "note_en": "The agency announced on Monday (Feb. 7) that it has selected the aerospace company Lockheed Martin to build the Mars Ascent Vehicle (MAV), a small rocket that will launch pristine Red Planet samples back toward   Earth a decade or so from now.\n  &#34;Committing to the Mars Ascent Vehicle represents an early and concrete step to hammer out the details of this ambitious project not just to land on   Mars, but to take off from it,&#34; Thomas Zurbuchen, the associate administrator for science at NASA Headquarters,   said in a statement.\n   &#34;We are nearing the end of the conceptual phase for this Mars Sample Return mission, and the pieces are coming together to bring home the first samples from another planet,&#34; Zurbuchen added. &#34;Once on Earth, they can be studied by state-of-the-art tools too complex to transport into space.&#34;\n    Mars Sample Return is a joint effort of NASA and the European Space Agency (ESA). The project is already well underway, thanks to NASA&#39;s   Perseverance rover, which landed on the Red Planet in February 2021.The six-wheeled robot has collected a handful of samples thus far and will eventually snag several dozen more, if all goes according to plan.\n The next big steps are scheduled to come in the mid-2020s, with the launch of two additional missions — the NASA-led Sample Retrieval Lander (SRL) and ESA&#39;s Earth Return Orbiter (ERO).\n SRL will deliver an ESA &#34;fetch rover&#34; and the MAV to the Martian surface. The fetch rover will carry the collected samples from Perseverance — or the spot(s) where Perseverance has cached them — to the MAV, which will then launch them into orbit around the Red Planet. A container holding the samples will then meet up with the ERO, which will haul it home to Earth, perhaps as early as 2031.\n Once the samples are down on the ground, scientists in well-equipped labs around the world will study them for signs of ancient   Mars life, clues about the planet&#39;s evolutionary history and other topics of interest, NASA officials have said.\n  &#34;This groundbreaking endeavor is destined to inspire the world when the first robotic round-trip mission retrieves a sample from another planet — a significant step that will ultimately help send the first astronauts to Mars,&#34; NASA Administrator Bill Nelson said in the same statement.\n &#34;America’s investment in our Mars Sample Return program will fulfill a top-priority planetary science goal and demonstrate our commitment to global partnerships, ensuring NASA remains a leader in exploration and discovery,&#34; Nelson added.\n The newly announced MAV contract has a potential value of $194 million, NASA officials said in today&#39;s statement. The contracted work will begin on Feb. 25 and run for six years. During this time, Lockheed Martin will build multiple MAV test units as well as the flight unit.\n Mike Wall is the author of &#34;   Out There &#34; (Grand Central Publishing, 2018; illustrated by Karl Tate), a book about the search for alien life. Follow him on Twitter    @michaeldwall . Follow us on Twitter    @Spacedotcom  or on    Facebook .\n Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.", "posttime": "2022-02-15 07:33:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,火箭,火星,picks", "title": "NASA选择洛克希德·马丁公司制造火箭，将火星样本带回地球", "title_en": "NASA Picks Lockheed Martin To Build Rocket To Carry Mars Samples Back To Earth", "transed": 1, "url": "https://www.space.com/nasa-mars-sample-return-rocket-lockheed-martin", "via": "", "real_tags": ["nasa", "火箭", "火星", "picks"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073313, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "无论是用于网络安全、游戏还是科学模拟，世界都需要真正的随机数，但生成它们比人们想象的要困难。但布朗大学的一组物理学家已经开发出一种技术，通过利用某些二维材料中产生的Skyrmion微小磁异常的行为，可能每秒产生数百万个随机数字。研究人员说，他们的研究发表在《自然通讯》上，揭示了以前未被探索过的单个天狼星的动力学。大约五年前发现的skyrmions激发了人们对物理学的兴趣，将其作为下一代计算设备的途径，利用粒子的磁性——一个被称为自旋电子学的领域。\n&#34;有很多研究都是关于Skyrmion的全球动力学，使用它们的运动作为执行计算的基础，&#34；布朗大学物理系主任、该研究的资深作者肖刚说&#34;但在这项工作中，我们表明，仅在Skyrmion的大小上也是有用的。在这种情况下，我们展示了我们可以利用这些波动来生成随机数，每秒可能多达1000万位&#34;\n计算机产生的大多数随机数不是&#39；严格说来，这不是随机的。计算机使用一种算法，根据初始起始位置（种子数）生成随机数。但由于生成数字的算法是确定性的，因此数字不是&#39；这不是真正的随机。有了关于算法或其输出的足够信息，人们就有可能在算法产生的数字中找到模式。虽然伪随机数在很多情况下都是足够的，但应用程序，比如-它使用的数字可以&#39；Don’不要被外界猜测，这需要真正的随机数。\n产生真实随机数的方法通常利用自然界。例如，流过电阻器的电流的随机波动可以用来产生随机数。其他技术利用量子力学中固有的随机性，即粒子在最小尺度上的行为。\nSkyrmion源于&#34；旋转&#34；超薄材料中的电子。自旋可以被认为是每个电子的微小磁矩，它指向上、下或中间的某个地方。一些处于最低能量状态的电子具有一种称为垂直磁各向异性的特性，这意味着电子的自旋都指向垂直于薄膜的方向。当这些材料被电或磁场激发时，一些电子自旋会随着系统能量的增加而翻转。当这种情况发生时，周围电子的自旋会受到一定程度的扰动，在翻转的电子周围形成一个磁漩涡——一个skyrmion。\n通常直径约为1微米（百万分之一米）或更小的Skyrmion，其行为有点像一种粒子，从一侧到另一侧在材料上快速移动。一旦他们&#39；重组后，他们&#39；你很难摆脱。因为他们&#39；由于它们非常健壮，研究人员对利用它们的运动来执行计算和存储数据感兴趣。\n这项新研究表明，除了Skyrmion在材料上的全局移动外，单个Skyrmion的局部行为也很有用。在布朗博士后研究员王康领导的这项研究中，研究人员使用一种在材料中产生细微缺陷的技术来制造磁性薄膜；原子晶格。当Skyrmion在材料中形成时，这些缺陷（研究人员称之为钉扎中心）将Skyrmion牢牢固定在原位，而不是让它们像通常那样移动。\n研究人员发现，当skyrmion固定在适当位置时，其大小会随机波动。当skyrmion的一部分紧紧抓住一个固定中心时，其余的skyrmion来回跳跃，围绕着附近的两个固定中心，一个更近，一个更远。\n&#34;每一只skyrmion都在大直径和小直径之间来回跳跃&#34；王说&#34;我们可以测量随机发生的波动，并用它生成随机数&#34;\nskyrmion大小的变化通过什么来衡量&#39；它被称为反常霍尔效应，是一种在材料中传播的电压。这个电压对电子自旋的垂直分量很敏感。当skyrmion大小发生变化时，电压的变化程度很容易测量。这些随机电压变化可以用来产生一串随机数字。\n研究人员估计，通过优化设备中的缺陷间距，他们可以每秒产生多达1000万个随机数字，提供了一种新的、高效的产生真实数字的方法。\n&#34;这为我们提供了一种生成真数的新方法，它可能对许多应用程序有用；肖说&#34;这项工作还为我们提供了一种利用Skyrmion力量的新方法，通过观察它们的局部动态以及全球运动&#34;        更多信息：Kang Wang等人，《利用局部动力学和skyrmion之间的相互作用的单个skyrmion真随机数生成器》，自然通讯（2022年）。内政部：10.1038/s41467-022-28334-4", "note_en": "Whether for use in cybersecurity, gaming or scientific simulation, the world needs true random numbers, but generating them is harder than one might think. But a group of Brown University physicists has developed a technique that can potentially generate millions of random digits per second by harnessing the behavior of skyrmions—tiny magnetic anomalies that arise in certain two-dimensional materials.    Their research, published in  Nature Communications, reveals previously unexplored dynamics of single skyrmions, the researchers say. Discovered around a half-decade ago, skyrmions have sparked interest in physics as a path toward next-generation computing devices that take advantage of the magnetic properties of particles—a field known as spintronics.\n  &#34;There has been a lot of research into the global dynamics of skyrmions, using their movements as a basis for performing computations,&#34; said Gang Xiao, chair of the Department of Physics at Brown and senior author of the research. &#34;But in this work, we show that purely   in the size of skyrmions can be useful as well. In this case, we show that we can use those fluctuations to generate random numbers, potentially as many as 10 million digits per second.&#34;\n  Most random numbers produced by computers aren&#39;t random in the strictest sense. Computers use an algorithm to generate random numbers based on an initial starting place, a seed number. But because the algorithm used to generate the number is deterministic, the numbers aren&#39;t truly random. With enough information about the algorithm or its output, it could be possible for someone to find patterns in the numbers that the algorithm produces. While pseudorandom numbers are sufficient in many settings, applications like  —which uses numbers that can&#39;t be guessed by an outside party—require true random numbers.\n  Methods of producing true random numbers often draw on the natural world. Random fluctuations in electrical current flowing through a resistor, for example, can be used to generate random numbers. Other techniques harness the inherent randomness in quantum mechanics—the behavior of particles at the tiniest scale.\n    Skyrmions arise from the &#34;spin&#34; of electrons in ultra-thin materials. Spin can be thought of as the tiny magnetic moment of each electron, which points up, down or somewhere in between. Some  , in their lowest energy states, have a property called perpendicular magnetic anisotropy—meaning the spins of electrons all point in a direction perpendicular to the film. When these materials are excited with electricity or a magnetic field, some of the electron spins flip as the energy of the system rises. When that happens, the spins of surrounding electrons are perturbed to some extent, forming a magnetic whirlpool surrounding the flipped electron—a skyrmion.\n    Skyrmions, which are generally about 1 micrometer (a millionth of a meter) or smaller in diameter, behave a bit like a kind of particle, zipping across the material from side to side. And once they&#39;re formed, they&#39;re very difficult to get rid of. Because they&#39;re so robust, researchers are interested in using their movement to perform computations and to store data.\n  This new study shows that in addition to the global movement of skyrmions across a material, the local behavior of individual skyrmions can also be useful. For the study, which was led by Brown postdoctoral fellow Kang Wang, the researchers fabricated magnetic thin films using a technique that produced subtle defects in the material&#39;s atomic lattice. When skyrmions form in the material, these defects, which the researchers call pinning centers, hold the skyrmions firmly in place rather than allowing them to move as they normally would.\n  The researchers found that when a skyrmion is held in place, they fluctuate randomly in size. With one section of the skyrmion held tightly to one pinning center, the rest of the skyrmion jumps back and forth, wrapping around two nearby pinning centers, one closer and one farther away.\n  &#34;Each skyrmion jumps back and forth between a large diameter and a small diameter,&#34; Wang said. &#34;We can measure that fluctuation, which occurs randomly, and use it to generate random numbers.&#34;\n  The change in skyrmion size is measured through what&#39;s known as the anomalous Hall effect, which is a voltage that propagates across the material. This voltage is sensitive to the perpendicular component of electron spins. When the skyrmion size changes, the voltage changes to an extent that is easily measured. Those random voltage changes can be used to produce a string of random digits.\n  The researchers estimate that by optimizing the defect-spacing in their device, they can produce as many as 10 million random digits per second, providing a new and highly efficient method of producing true  .\n  &#34;This gives us a new way of generating true   numbers, which could be useful for many applications,&#34; Xiao said. &#34;This work also gives us a new way of harnessing the power of skyrmions, by looking at their local dynamics as well as their global movements.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tKang Wang et al, Single skyrmion true random number generator using local dynamics and interaction between skyrmions,  Nature Communications (2022).  DOI: 10.1038/s41467-022-28334-4", "posttime": "2022-02-15 07:31:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人员,tiny,skyrmion", "title": "研究人员利用微小的磁漩涡产生真正的随机数", "title_en": "Researchers Use Tiny Magnetic Swirls To Generate True Random Numbers", "transed": 1, "url": "https://phys.org/news/2022-02-tiny-magnetic-swirls-true-random.html", "via": "", "real_tags": ["人员", "tiny", "skyrmion"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073311, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Axios AM和PM时事通讯，让忙碌的日子变得更简单。赶上什么&#39；这是新的，为什么它在5分钟内重要。\n订阅Axios Closer时事通讯，了解当天的商业新闻和趋势以及它们的重要性。\n深入VC、PE和M&amp；A按比例使用Axios。由Dan Primack和Kia Kokalitheva每天发送到你的收件箱。\n通过Axios体育通讯，尽情享受推动体育界的统计数据和故事。免费注册。\n通过Axios登录，从Valley和D.C.获取我们的智能接收技术。免费注册。\n找个内幕人士&#39；Axios的新白宫指南。免费注册。\n通过Axios Denver获取影响家乡的最重要故事的每日摘要\n通过Axios得梅因通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Twin Cities，每日获取影响家乡的最重要故事摘要\n通过Axios Tampa Bay时事通讯获取影响家乡的最重要故事的每日摘要。\n与Axios Charlotte一起获取影响家乡的最重要故事的每日摘要\n通过Axios Nashville时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Columbus时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Dallas时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Austin时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Atlanta时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Philadelphia通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios芝加哥时事通讯获取影响家乡的最重要故事的每日摘要。\n关注当地记者撰写的影响阿肯色州西北部的最重要、最有趣的故事\n通过Axios DC时事通讯获取影响家乡的最重要故事的每日摘要。\n2019冠状病毒疾病流行限制可能会结束，34；很快&#34；早在今年，NIAID董事安东尼·福奇（Anthony Fauci）就在周二发表的一次采访中告诉英国《金融时报》。\n大局：福奇解释说他不相信&#34；我们要消灭这种病毒&#34；但是他说它将达到&#34；平衡&#34;\n&#34;我希望我们看到的是，当我们有足够多的人接种疫苗，有足够多的人免受以前的感染时，新冠病毒的限制将很快成为过去，&#34；福奇说。\n福奇补充说，他希望限制措施能够结束；很快&#34；同意他们可能在今年基本结束的建议。\n游戏状态：福奇还说，美国是&#34；当然要出发了&#34；在大流行的一个特别困难的阶段，主要由奥米克龙推动，地方卫生部门将代替拜登政府，做出与病毒有关的决定。\n他&#39；他说&#34；当我们走出2019冠状病毒疾病流行阶段时，我们肯定会退出，这些决定将越来越多地在地方层面上进行，而不是集中决定或授权，34。福奇说。\n&#34;也会有更多的人自己决定如何应对病毒&#34;", "note_en": "Make your busy days simpler with the Axios AM and PM newsletters. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to the Axios Closer newsletter for insights into the day’s business news and trends and why they matter.\n Dive into the world of dealmakers across VC, PE and M&amp;A with Axios Pro Rata. Delivered daily to your inbox by Dan Primack and Kia Kokalitcheva.\n Binge on the stats and stories that drive the sports world with the Axios Sports newsletter. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with the Axios Des Moines newsletter.\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with the Axios Tampa Bay newsletter.\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Get a daily digest of the most important stories affecting your hometown with the Axios Nashville newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Columbus newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Dallas newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Austin newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Atlanta newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Philadelphia newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Chicago newsletter.\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n Get a daily digest of the most important stories affecting your hometown with the Axios DC newsletter.\n   COVID-19 pandemic restrictions could end &#34;soon,&#34; even as early as this year, NIAID director Anthony Fauci told the  Financial Times in an interview published Tuesday.\n The big picture: Fauci explained that he does not believe &#34;we are going to eradicate this virus,&#34; but said that it will instead reach an &#34;equilibrium.&#34;\n &#34;I hope we are looking at a time when we have enough people vaccinated and enough people with protection from previous infection that the COVID restrictions will soon be a thing of the past,&#34; Fauci said.\n Fauci added that he hoped restrictions would end &#34;soon,&#34; agreeing with a suggestion that they could largely end this year.\n State of play: Fauci also said that as the U.S. is &#34;certainly heading out&#34; of a particularly difficult phase of the pandemic driven largely by Omicron, local health departments will be the ones to make virus-related decisions instead of the Biden administration.\n What he&#39;s saying: &#34;As we get out of the full-blown pandemic phase of COVID-19, which we are certainly heading out of, these decisions will increasingly be made on a local level rather than centrally decided or mandated,&#34; Fauci said.\n &#34;There will also be more people making their own decisions on how they want to deal with the virus.&#34;", "posttime": "2022-02-15 07:24:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,走出,full,axios", "title": "福奇说，美国正在走出“全面大流行阶段”", "title_en": "US Heading Out of 'Full-blown Pandemic Phase', Fauci Says", "transed": 1, "url": "https://www.axios.com/fauci-covid-pandemic-restrictions-vaccines-15d1c1fb-5532-43f6-8b6c-bb6bfb3911b1.html", "via": "", "real_tags": ["美国", "走出", "full", "axios"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073309, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该项目暂停后，Facebook的以色列研发中心（Israel R&amp；D中心面临着不确定的未来，消息人士已通知“全球”", "note_en": "Suspension of the project has left 100 employees at Facebook's Israel R&amp;D center facing an uncertain future, sources have informed \"Globes.\"", "posttime": "2022-02-15 07:23:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,冻结,freezes,中心", "title": "Facebook冻结Novi数字钱包项目", "title_en": "Facebook Freezes Novi Digital Wallet Project", "transed": 1, "url": "https://en.globes.co.il/en/article-meta-freezes-novi-digital-wallet-project-1001401477", "via": "", "real_tags": ["facebook", "冻结", "freezes", "中心"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073307, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用Axios AM和PM时事通讯，让忙碌的日子变得更简单。赶上什么&#39；这是新的，为什么它在5分钟内重要。\n订阅Axios Closer时事通讯，了解当天的商业新闻和趋势以及它们的重要性。\n深入VC、PE和M&amp；A按比例使用Axios。由Dan Primack和Kia Kokalitheva每天发送到你的收件箱。\n通过Axios体育通讯，尽情享受推动体育界的统计数据和故事。免费注册。\n通过Axios登录，从Valley和D.C.获取我们的智能接收技术。免费注册。\n找个内幕人士&#39；Axios的新白宫指南。免费注册。\n通过Axios Denver获取影响家乡的最重要故事的每日摘要\n通过Axios得梅因通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Twin Cities，每日获取影响家乡的最重要故事摘要\n通过Axios Tampa Bay时事通讯获取影响家乡的最重要故事的每日摘要。\n与Axios Charlotte一起获取影响家乡的最重要故事的每日摘要\n通过Axios Nashville时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Columbus时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Dallas时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Austin时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Atlanta时事通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios Philadelphia通讯获取影响家乡的最重要故事的每日摘要。\n通过Axios芝加哥时事通讯获取影响家乡的最重要故事的每日摘要。\n关注当地记者撰写的影响阿肯色州西北部的最重要、最有趣的故事\n通过Axios DC时事通讯获取影响家乡的最重要故事的每日摘要。\n微软的高管们正在为监管机构提出的收购游戏巨头动视暴雪（Activision Blizzard）的计划做准备，他们承诺，未来将包括一个开放的&#34；环球和#34；应用商店。\n驱动新闻：周三，微软宣布了一套&#34；开放应用商店原则&#34；该公司表示将适用于Windows上的微软商店及其下一代游戏市场。\n&#34;我们制定了这些原则，部分是为了解决微软在全球各国首都寻求监管部门批准收购动视暴雪时日益增长的角色和责任；微软总裁布拉德·史密斯在一篇博客文章中写道。\n为什么它是重要的：该公司正试图通过在App Store和跨设备的互操作性原则下出售其提议的690亿美元收购AccVistB暴雪，因为立法者考虑了会改变App Store操作的提议。\n他们&#39；你说&#34；动视暴雪的收购让我们来到了华盛顿特区；史密斯和首席执行官萨蒂亚·纳德拉以及Xbox公司副总裁萨拉·邦德在一次简报会上告诉记者&#34;我们&#39；我们更关注于适应监管，而不是对抗监管&#34;\n&#34;游戏产业&#39；当我们过去购买（实体游戏）时，公司的结构、规则和商业模式是建立在一个范例上的；邦德说&#34;这应该会改变。它将设备置于体验的中心。我们认为应该是中锋&#34;\n美国联邦贸易委员会（Federal Trade Commission）正在审查该交易。史密斯表示，该交易将需要全球17家监管机构的批准。\n细节：其中七项原则围绕着安全、隐私、质量、安全、责任、公平和透明度，该公司表示从今天开始将致力于这些原则。\n剩下的四条原则将改变开发者使用应用商店的方式，不要求开发者使用微软&#39；它的支付系统，不会给其应用商店带来更优惠的条款，不会对使用不同支付系统的开发者不利，也不会阻止开发者直接与客户沟通。\n该公司表示将&#34；承诺随着时间的推移弥合剩余原则上的差距&#34;\n言外之意：在过去的一年里，微软越来越多地表示要将其游戏服务扩展到尽可能多的平台和设备。\n但当涉及到像苹果严格封闭的iOS这样的平台时，有些可能只有通过立法才能开放。\n将市场放在戒备森严的平台上引发了Epic对苹果的诉讼。\n参议院司法委员会最近批准的《开放应用程序市场法案》将把这些原则中的许多纳入法律。\n史密斯说微软想要&#34；站在历史的正确一边&#34；在法案成为法律之前以及法案是否成为法律之前，遵守这些原则。\n聪明一点：微软实际上并没有宣布一个新的应用商店，只是它将用来指导一个假设的应用商店的原则。\nAxios游戏的思想泡沫&#39；s Stephen Totilo：微软在今天提出了一个关键的警告#39；承认所有这些原则都没有&#39；t目前与现有的Xbox游戏商店不兼容，但随着时间的推移，它将不再兼容。\n微软为目前的模式辩护，该模式允许微软在Xbox商店收入中占有30%的份额，因为该模式基于亏本销售的游戏机（索尼称其已经从PS5销售中获利）。\n在一个新的商店里，开发者有朝一日可以选择使用微软&#39；s的支付系统和其他服务，如流媒体技术，或没有&#34;我们&#39；我们将发展商业模式，以支持我们&#39；我们为他们提供他们所采用的&#34；邦德说。", "note_en": "Make your busy days simpler with the Axios AM and PM newsletters. Catch up on what&#39;s new and why it matters in just 5 minutes.\n Subscribe to the Axios Closer newsletter for insights into the day’s business news and trends and why they matter.\n Dive into the world of dealmakers across VC, PE and M&amp;A with Axios Pro Rata. Delivered daily to your inbox by Dan Primack and Kia Kokalitcheva.\n Binge on the stats and stories that drive the sports world with the Axios Sports newsletter. Sign up for free.\n Get our smart take on technology from the Valley and D.C. with Axios Login. Sign up for free.\n Get an insider&#39;s guide to the new White House with Axios Sneak Peek. Sign up for free.\n Get a daily digest of the most important stories affecting your hometown with Axios Denver\n Get a daily digest of the most important stories affecting your hometown with the Axios Des Moines newsletter.\n Get a daily digest of the most important stories affecting your hometown with Axios Twin Cities\n Get a daily digest of the most important stories affecting your hometown with the Axios Tampa Bay newsletter.\n Get a daily digest of the most important stories affecting your hometown with Axios Charlotte\n Get a daily digest of the most important stories affecting your hometown with the Axios Nashville newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Columbus newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Dallas newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Austin newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Atlanta newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Philadelphia newsletter.\n Get a daily digest of the most important stories affecting your hometown with the Axios Chicago newsletter.\n Stay up-to-date on the most important and interesting stories affecting NW Arkansas, authored by local reporters\n Get a daily digest of the most important stories affecting your hometown with the Axios DC newsletter.\n   Microsoft executives are warming up regulators to  their proposed acquisition of gaming giant Activision Blizzard in Washington by pledging a future that includes an open, &#34;universal&#34; app store.\n Driving the news: On Wednesday, Microsoft announced a set of &#34;Open App Store Principles&#34; the company says will apply to the Microsoft Store on Windows and the next generation of its game marketplaces.\n &#34;We have developed these principles in part to address Microsoft’s growing role and responsibility as we start the process of seeking regulatory approval in capitals around the world for our acquisition of Activision Blizzard,&#34; Microsoft president Brad Smith wrote in a blog post.\n Why it matters: The company is trying to sell its proposed $69 billion acquisition of Activision Blizzard by committing to principles of interoperability in app stores and across devices as lawmakers consider proposals that would change how app stores operate.\n What they&#39;re saying: &#34;The Activision Blizzard acquisition is what has brought us to Washington, D.C.,&#34; Smith told reporters in a briefing along with CEO Satya Nadella and Xbox corporate vice president Sarah Bond. &#34;We&#39;re more focused on adapting to regulation than fighting against it.&#34;\n &#34;The game industry&#39;s structure, rules and business model was set on a paradigm when we used to buy [physical games],&#34; said Bond. &#34;That should change. It has put the device at the center of the experience. We think it should be the player at the center.&#34;\n The Federal Trade Commission is reviewing the deal in the U.S. Smith said the deal will require approval from 17 regulators globally.\n Details: Seven of those principles center around security, privacy, quality, safety, accountability, fairness and transparency, and the company says it is committing to those principles starting today.\n The four remaining principles would change how developers use app stores by not requiring developers to use Microsoft&#39;s payment system, not giving its app store more favorable terms, not disadvantaging developers who use a different payment system and not preventing developers from communicating directly with customers.\n The company said it would &#34;commit to closing the gap on the remaining principles over time.&#34;\n Between the lines: Over the last year,  Microsoft has been increasingly vocal about expanding its gaming services to as many platforms and devices as possible.\n But when it comes to platforms like Apple’s tightly sealed iOS, some may only open up through legislation.\n Putting marketplaces on tightly guarded platforms is what sparked  Epic’s lawsuit against Apple.\n The Open App Markets Act, recently approved by the Senate Judiciary committee, would cement many of these principles into law.\n Smith said Microsoft wants to &#34;be on the right side of history&#34; by committing to such principles before and whether the bill becomes law.\n Be smart: Microsoft didn’t actually announce a new app store, only the principles it would use to guide a hypothetical one.\n Thought bubble from Axios Gaming&#39;s Stephen Totilo: Microsoft included a crucial caveat in today&#39;s briefing, acknowledging that all of these principles don&#39;t currently mesh with the existing Xbox game store, but would over time.\n Microsoft justifies the current model, which grants Microsoft a 30% take of Xbox store revenue, as one based on consoles being sold at a loss (for what it&#39;s worth, Sony says it  already profits from PS5 sales).\n In a new store, developers would someday be able to choose to use Microsoft&#39;s payment system and other services, such as streaming tech, or not. &#34;We&#39;re going to evolve the business model to support how much of the functionality we&#39;re providing them that they adopt,&#34; Bond said.", "posttime": "2022-02-15 07:10:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,游戏,proclaims,axios", "title": "微软宣布支持更开放的游戏未来", "title_en": "Microsoft Proclaims Support for a More Open Gaming Future", "transed": 1, "url": "https://www.axios.com/microsoft-activision-gaming-open-markets-act-3afe4296-342e-4a26-80ad-a067d0ad8b0c.html", "via": "", "real_tags": ["microsoft", "微软", "游戏", "proclaims", "axios"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1073304, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Block的移动支付平台Cash App的用户现在可以通过闪电网络进行即时免费比特币支付，该公司周一在推特上写道。\n闪电开发工具包（Lightning Development Kit）使比特币第二层协议的集成成为可能，闪电开发工具包是Block，Spiral旗下另一家公司开发的开源项目。\nSpiral的运营完全独立于母公司，Block的首席执行官、Twitter的前首席执行官杰克·多尔西（Jack Dorsey）也几乎没有直接控制权。相反，由开发人员、设计师和项目经理组成的自我指导小组共同推动比特币的采用。\nLightning Development Kit（LDK）是一款灵活的Lightning实现，面向希望将比特币的Lightning网络无摩擦地集成到应用程序中的开发者。它将闪电的复杂性抽象出来，使开发人员能够更轻松、更快地将网络集成到他们的应用程序中。\n杰克·多尔西（Jack Dorsey）上周与软件智能公司MicroStrategy的首席执行官迈克尔·塞勒（Michael Saylor）在炉边聊天时表示，让现金应用程序在螺旋形的工作中集成闪电是他职业生涯中最自豪的时刻之一。\n自萨尔瓦多于9月将比特币法定货币化以来，闪电的使用率急剧上升，这促使用户使用更快的支付方式在麦当劳购买每日早餐，或在星巴克购买晨咖啡。尽管批评人士表示，由于比特币底层的结算速度缓慢，比特币无法用作交换手段，但闪电让比特币能够以很少甚至是零成本处理最小的支付。\n现在，所有现金应用程序用户也可以利用Lightning即时免费发送小额付款。然而，现金应用程序本身似乎还不能接收闪电交易——只能发送它们。", "note_en": "Users of Block’s mobile payments platform Cash App can now make instant and free bitcoin payments through the Lightning Network, the company  tweeted on Monday.\n The integration of Bitcoin’s second-layer protocol for faster and cheaper transactions was made possible by the Lightning Development Kit, an open-source project developed by another company owned by Block, Spiral.\n Spiral operates completely independently of its parent company and Jack Dorsey, the CEO of Block and ex-CEO of Twitter, also has little direct control over it. Instead, the self-directed group of developers, designers, and project managers work together to advance the adoption of bitcoin.\n  The  Lightning Development Kit (LDK) is a flexible Lightning implementation geared towards developers who want to integrate Bitcoin’s Lightning Network into their applications frictionlessly. It abstracts away complexities of Lightning, enabling developers to integrate the network easier and faster into their apps.\n Jack Dorsey  said in a fireside chat last week with Michael Saylor, the CEO of software intelligence company MicroStrategy, that having Cash App integrate Lightning through the Spiral’s work was one of the proudest moments of his career.\n     Lightning adoption has skyrocketed since El Salvador made bitcoin legal tender in September, prompting users to use the faster payment rails to buy their daily breakfast on McDonald’s or their morning coffee on Starbucks. Despite critics saying that Bitcoin cannot be used as a means of exchange due to its base layer’s slow settlements, Lightning empowers Bitcoin to handle the smallest of payments for little to no cost.\n Now, all Cash App users can also leverage Lightning to send small payments instantly and for free. However, it seems that Cash App cannot yet receive Lightning transactions itself — only send them.", "posttime": "2022-02-15 07:00:43", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,比特币,闪电,dorsey", "title": "Jack Dorsey的现金应用程序集成了比特币的闪电网络", "title_en": "Jack Dorsey's Cash App Integrates Bitcoin's Lightning Network", "transed": 1, "url": "https://bitcoinmagazine.com/business/cash-app-integrates-bitcoins-lightning-network", "via": "", "real_tags": ["程序", "比特币", "闪电", "dorsey"]}]