[{"category": "", "categoryclass": "", "imagename": "f8405fd0dd15e4f5c0e6cf862dee7a73.jpg", "infoid": 1014484, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "感谢你们所有人，温马切斯能够加入我们最近的早期活动，在会上她分享了一些处理各种问题的技巧和诀窍，从记者听到的快速膨胀的危机，到大流行期间的裁员，再到为什么诉讼实际上可以推动一些公司的增长。\n这是一条建议，你可以把它保存起来，以备将来参考。正如她所指出的，如何处理危机可以决定一家初创公司的成败，即使是最小的公司也会出问题的清单“很长”，包括需要召回的产品、网站瘫痪、网络入侵、无法相处的创始团队、不当行为、诉讼和文化问题。\n温马切斯说，首先，要花时间对情景进行建模，像你一样“让你的想象力自由发挥”。如果有必要的话，在这上面花一个月的时间。当你在考虑最坏的情况时，也要弄清楚参与危机应对的团队。法律部门总是必须参与进来，但通常还需要人力资源、外部法律顾问，如果初创公司负担得起的话，还要得到外部危机沟通团队的帮助。她指出，如果是产品故障，你还需要产品领导。", "note_en": "Thankfully for all of you, Wennmachers was able to join us for our recent Early Stage event, where she shared some of her tips and tricks for dealing with everything from fast-ballooning crises that reporters catch wind of, to laying off people during a pandemic, to why lawsuits can actually fuel some companies’ growth.\n It’s advice you might save for future reference. As she noted, how a crisis is handled can make or break a startup, and the list of things that can go wrong at even the smallest outfit is “long,” including a product needing to be recalled, a site going down, a cyber breach, a founding team that doesn’t get along, inappropriate behavior, lawsuits and cultural issues.\n   First, said Wennmachers, spend time modeling out the scenarios, and “let your imagination run wild” as you do. Spend a month on this if necessary. As you’re thinking of worst-case scenarios, also figure out the team that would be involved in a crisis response. Legal will always have to be involved but also, often, HR, outside counsel, and, if a startup can afford it, the help of an outside crisis communications team. If it’s a product failure, you’ll also need the product lead, too, she noted.", "posttime": "2020-07-28 02:39:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,management,产品", "title": "\n来自初创企业窃窃私语者Margit Wennmachers的危机管理技巧", "title_en": "\n\t\t\t\tCrisis management tips from startup whisperer Margit Wennmachers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/crisis-management-tips-from-startup-whisperer-margit-wennmachers/", "via": "", "real_tags": ["初创", "产品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014482, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "选择购买试用订阅港币10元，试用期4周，试用结束后每月收费港币495.00元。\n4周内可无限制享受英国“金融时报”值得信赖、屡获殊荣的商业新闻的无限量高级数字访问。\n选择购买数码订阅，每周港币54.1元，试用结束后每月收费港币305.00元。\n礼品-每月与家人、朋友和同事分享多达10篇文章", "note_en": "Select  Purchase a Trial subscription for HK$10.00 for 4 weeks   You will be billed HK$495.00 per month after the trial ends\n  For 4 weeks receive unlimited Premium digital access to the FT&#39;s trusted, award-winning business news\n  Select  Purchase a Digital subscription for HK$54.10 per week   You will be billed HK$305.00 per month after the trial ends\n  Gift Article – share up to 10 articles a month with family, friends and colleagues", "posttime": "2020-07-28 02:38:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,欧盟,takes,试用", "title": "Facebook将欧盟告上法庭，称其侵犯隐私", "title_en": "Facebook Takes EU To Court For Invading Privacy", "transed": 1, "url": "https://www.ft.com/content/a0335cd5-fcae-42b8-9831-a77e6b5a4347", "via": "", "real_tags": ["facebook", "欧盟", "takes", "试用"]}, {"category": "", "categoryclass": "", "imagename": "96be990790dda5e8010488b2ad089326.jpg", "infoid": 1014480, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ro是一家在线健康初创公司，通过要求消费者支付现金来帮助缓解许多最常见的医疗投诉，而不必亲自去看医生，从而建立了一项大业务。\n该公司以向男性销售脱发补充剂和勃起功能障碍药物起家，现在已经开发了一系列健康应用程序，并表示现在它的年收入为2.5亿美元--不包括保险。\n该公司的旗舰服务罗曼(Roman)在2017年推出时，专注于男性与医生面对面交谈时可能会感到耻辱或羞耻的情况。从那时起，该公司推出了一个名为Rory的女性品牌，该品牌提供节育和其他药物，以及一项名为Zero的戒烟服务。它现在有一项名为Ro Pharmacy的药物递送服务，可以以每种5美元的固定费用提供500多种仿制药。为了向新患者推销自己，它建立了一个名为Health Guides的健康内容服务。\n对于这些服务中的每一项，它都会为患者提供远程护理团队。与该领域的许多远程医疗公司不同，它专注于患者可能有重复需求并可能需要持续支持的医疗保健领域，而不是一次性的鼻窦感染或尿路感染。这包括糖尿病和心脏病等慢性疾病，这些疾病目前困扰着近一半的美国人。\n通过这些服务，患者可以安排与医生见面的时间，要求续杯，询问问题等。如果需要，RO可能还会让患者接受面对面的服务。\n截至本周，在通用催化剂(General Catalyst)牵头的新一轮2亿美元融资完成后，Ro的估值为15亿美元。这使其融资总额达到3.76亿美元，使其成为新兴医疗科技行业资本最雄厚的初创企业之一。\n虽然没有盈利，但Ro的快速收入增长并不是医疗保健初创企业的典型。但该公司已经能够避免一些通常与医疗保健业务相关的代价高昂的复杂问题，比如与保险公司和该行业的其他利益相关者达成协议。\n该公司表示，它已经发展到500万次医患互动。考虑到高免赔额计划的兴起，以及越来越多没有保险的美国人，Ro打赌最近愿意自掏腰包看病的人会更多。\n该公司首席执行官扎卡里亚·雷塔诺(Zachariah Reitano)说，我们希望成为第一个呼叫的病人。我们参与的越多，对结果的影响就越大。\n对于雷塔诺来说，这不仅仅是在3.5万亿美元的医疗保健市场中分得一杯羹。相反，他指出，该公司正在寻求将患者聚集到可以使用共享的累积杠杆来反击系统的程度。\n雷塔诺认为，传统的医疗保健方式浪费太多，效率太低。在他看来，这是一个系统的结果，这个系统收取任意的价格，没有优先考虑患者的经历和结果。他希望通过提供透明的价格和按需护理，人们将越来越愿意转向像Ro这样的服务，包括那些有保险的人。\n在后端，该公司还在为其医生开发软件，这样他们就可以很容易地看到谁在排队--以及哪些病人在任何给定的时刻都是最优先的。目前，该公司有50至100名医疗服务提供者，其中约三分之一为员工(其余为合同制)。该公司希望通过雇佣更多的全职医生和护士来改变这一点。\nRO目前面临着像Hims这样的初创公司的竞争，后者最近开始就以10亿美元左右的估值上市的交易进行谈判。它可能会与亚马逊(Amazon)和沃尔玛(Walmart)等规模大得多的公司擦肩而过，前者为同时服用多种药物的人提供药房递送服务，后者在医疗保健领域雄心勃勃。\n雷塔诺指出，虽然一些旁观者认为Ro是为千禧一代包装的医疗保健，但Ro客户的平均年龄现在是46岁。大多数用户是男性，因为Ro一开始关注的是男性的健康，但该公司预计，在未来几年，男性和女性的比例将会持平。\n随着Ro的不断增长，Reitano正在向希望获得新患者的医生推销这项服务。他们的患者可以使用它来预约线上或线下预约，或者请求服务，而不是构建自己的软件。正如雷塔诺所说，它的宏伟愿景是成为医疗保健领域的购物中心。", "note_en": "Ro, an online health start-up, has built a big business by asking consumers to pay cash to help alleviate many of the most common medical complaints without having to visit a doctor in person.\n The company, which started out by selling hair loss supplements and erectile dysfunction medication to men, has built a range of health apps and says it&#39;s now generating $250 million in annual revenue -- without taking insurance.\n  When it launched in 2017, the company&#39;s flagship service, Roman, focused on conditions where men might feel stigma or shame talking to a doctor in person. From there, the company introduced a women&#39;s brand called Rory, which delivers birth control, among other medications, and a smoking cessation service called Zero. It now has a medication delivery service called Ro Pharmacy, which delivers more than 500 generic medications at a flat fee of $5 each. To market itself to new patients, it built out a health content offering called Health Guides.\n For each of these services, it provides patients with a remote care team. Unlike many telemedicine companies in the space, it focuses on areas of health care where patients are likely to have a repeat need and may need ongoing support, rather than the one-off sinus infections or urinary tract infections. That includes chronic medical conditions, like diabetes and heart disease, which currently afflict nearly half of all Americans.\n From those services, patients can schedule time with a doctor, request a refill, ask questions and more. Ro might also refer the patient to an in-person service if needed.\n As of this week, Ro is valued at $1.5 billion after closing a new financing round of $200 million led by General Catalyst. That brings its funding total to $376 million, making it one of the most well-capitalized start-ups in the burgeoning health tech sector.\n Although it&#39;s not profitable, Ro&#39;s rapid revenue growth isn&#39;t typical for a health-care start-up. But the company has been able to avoid some of the costly complexities typically associated with health-care businesses, such as forging deals with insurers and other stakeholders in the industry.\n  Already, the company says it has grown to 5 million patient-physician interactions. Given the rise of high-deductible plans and the increasing numbers of Americans without insurance, Ro is betting that many more are newly willing to pay out of pocket to access a doctor.\n &#34;We want to be patients&#39; first call,&#34; said Zachariah Reitano, the company&#39;s CEO. &#34;The more we are involved, the more we can impact the outcome.&#34;\n For Reitano, it&#39;s not just about biting off a slice of the $3.5 trillion health-care market. Instead, he notes, the company is looking to &#34;aggregate patients to the point where you can use the shared cumulative leverage to push back on the system.&#34;\n Reitano believes that there&#39;s far too much waste and inefficiency with traditional health care. In his view, it&#39;s the result of a system that charges arbitrary prices and doesn&#39;t prioritize patient experiences and outcomes. He&#39;s hoping that by offering transparent prices and care on demand, people will be increasingly willing to move to a service like Ro, including those who have insurance.\n On the back-end, the company is also building software for its doctors so it&#39;s easy for them to see who&#39;s waiting in the queue -- and which patients are high priority at any given moment. Currently it has between 50 and 100 medical providers on board and about a third of them are on staff (the rest are on contract). The company hopes to change that by hiring more doctors and nurses full time.\n  Ro currently is up against start-ups like Hims, which recently started talks  about a deal to go public at around a $1 billion valuation. It might brush up against much larger players like  Amazon, which  offers pharmacy delivery to people juggling multiple medications, and  Walmart,  which has big ambitions in the health-care space.\n While some onlookers think of Ro as  health care packaged to millennials, the average age of a Ro customer is now 46 years old, notes Reitano. Most of the users are male, given that Ro started off focusing on men&#39;s health, but the company is anticipating that the ratio between men and women will even out in the coming years.\n As Ro continues to grow, Reitano is pitching the service to doctors looking to acquire new patients. Rather than building their own software, their patients can use it to book an online or offline appointment, or request a service. As Reitano puts it, its big vision is to become the &#34;Shopify of health care.&#34;", "posttime": "2020-07-28 02:31:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人群,general,ro", "title": "Ro是一家面向未参保人群的远程医疗初创公司，在General Catalyst的带领下筹集了2亿美元，估值为15亿美元，并表示年收入已达到2.5亿美元", "title_en": "Ro, a telemedicine startup that caters to the uninsured, raises $200M led by General Catalyst valuing it at $1.5B and says it has hit $250M in annual revenue", "transed": 1, "url": "https://www.cnbc.com/2020/07/27/ro-raises-200-million-at-1point5-billion-valuation-250-million-sales.html", "via": "", "real_tags": ["人群", "general", "ro"]}, {"category": "", "categoryclass": "", "imagename": "cb8e78ebd502ba682e54fa7a632f27a3.jpg", "infoid": 1014479, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "雷·克罗克经常被誉为特许经营商业模式的“鼻祖”。\n但在麦当劳之前60年，一位名叫玛莎·玛蒂尔达·哈珀(Martha Matilda Harper)的女子建立了自己令人敬畏的美发沙龙特许经营权-这是美国第一家此类沙龙-并培训了数百名贫困妇女经营自己的企业。\n哈珀不仅是特许经营的先驱，而且被广泛认为是现代美发沙龙行业的先驱，现在这个行业的市场规模已达200亿美元。作为一名摆脱贫困的前佣人，她在世界各地建立了一个拥有500家沙龙的帝国。她做这一切的时候，女性在创业追求上基本上是沉默的。\n玛思·玛蒂尔达·哈珀于1857年9月10日出生于加拿大安大略省的一个小村庄，她的生活前景黯淡。\n她是10个孩子中的第4个-他们都住在一间单间木屋里-她的父亲是一名裁缝(用她后来的话说)，是一位“严厉、毫不畏惧的英国先驱，太专注于日常斗争，没有太多关注[她]。”\n7岁时，哈珀被送到安大略省一位富有的农场主那里当佣人。为了换取令人精疲力竭的打扫、做饭和维护农场的养生方式，她每月的报酬约为4美元(今天约为130美元)。每一分钱都还给了她父亲。\n五年后，哈珀被转移到附近一名医生的家中，这名医生在妻子去世后正在寻找家务帮助。\n尽管这名医生的身份从未被记录在案，但哈珀的传记作者简·普利特(Jane Plitt)表示，这名医生是韦斯顿·勒罗伊·赫尔曼(Weston Leroy Herriman)医生，他曾是南北战争时期的医生，在现在的加拿大霍普港小镇经营着一家诊所。\n当时，北美的护发养生法是最低限度的。男人和女人只是很少洗头。热水和粗皂(由猪油和灰烬制成)供不应求，商用洗发水是一个遥远的发明。\n但赫里曼曾花时间研究头皮卫生和刷头的效果等问题。在接下来的十年里，他经常与渴望学习的哈珀分享他的知识。\n当他在1879年去世时，他给了哈珀一些东西，后来改变了她的生活：一种用天然草药制成的护发素的配方。\n新得到的这份礼物，加上她名下的少量积蓄，25岁的哈珀登上了一艘前往纽约罗切斯特的船，寻找一个新的开始。\n她又一次找到了一份仆人的工作--先是为当地一名律师工作，然后为一位名叫卢埃拉·J·罗伯茨(Luella J.Roberts)的富人工作。\n在19世纪后期，理发通常由佣人在家里做。哈珀担任罗伯茨女士的私人美容师，给她做头皮按摩和理发。她是如此的熟练，以至于罗切斯特的上流社会妇女很快就来家里接受她们自己的治疗。\n在这些工作间隙的一小段时间里，哈珀开始在罗伯茨女士后院的一个棚子里生产她自己的护发素。\n哈珀在附近的妇女中进行了小型市场测试，并挨家挨户地分发补品。它受到了令人惊讶的好评--她开始感觉到了一个商机。\n尽管处于苏珊·B·安东尼(Susan B.Anthony)领导的蓬勃发展的女性选举权运动的中心，罗切斯特的创业版图仍然几乎完全由男性控制。维多利亚时代的习俗规定，女人的位置是在家里。当时的一位著名心理学家将女性的自由意志等同于“疾病的症状”。\n哈珀知道机会对她不利。但她有远见，有一项利基专长，而且市场反应积极。\n因此，在1888年，31岁的她将毕生积蓄-360美元(按2020年美元计算为970万美元)-投资于她的第一家哈珀美发店。\n哈珀将目光投向了鲍尔斯大厦(Power Building)，这是一座九层的建筑，容纳着罗切斯特一些最好的企业。起初，她的申请被拒绝了。但在当地律师的帮助下，她获得了逐月租约。\n这个沙龙设计得很奢华，以健康和纯洁为美德。\n顾客将接受“哈珀方法”(Harper Method)的治疗，这是一个复杂的2小时过程，包括头部和肩部按摩、面部护理，以及名为“马鞍手法”、“捆绑动作”和“检查动作”的程序，据称这些程序旨在刺激血液流动，促进头发生长。\n为了推销这些服务，哈珀使用了她自己令人羡慕的头发的照片-栗色的头发太长了，以至于PT Barnum曾经试图招募她加入马戏团。\n哈珀后来会用她传奇的头发作为一种营销工具，为她的沙龙招揽生意(罗切斯特博物馆和科学中心)\n一开始，生意很清淡。她的高端客户-仍然坚持家访-反对去公共沙龙的想法。作为现代沙龙的开拓者，哈珀意识到她必须改变顾客的行为。\n当她生意隔壁的一位音乐老师提到他没有等候室时，哈珀主动提供了她的沙龙。妇女们开始漫步在家里做头发护理，同时等待她们的孩子完成钢琴课。\n在客户服务还是一个陌生概念的时候，哈珀将利润再投资于丰富客户体验，发明了第一款躺式洗发椅和一个特殊的水槽，颈部有一个独特的切口。\n这个充满异国情调的新沙龙概念在罗切斯特的精英中广为流传。很快，这家有3张椅子的商店里也挤满了来自其他城市的杰出女性。\n尽管哈珀收到了在其他城市开设沙龙的请求，但她拒绝扩大规模，直到那个社区有一定数量的女性签署了请愿书。作为一名精明的经营者，她敏锐地意识到了市场测试。\n哈珀知道，她必须严格控制自己的品牌和服务质量。她还知道，她必须找到她可以信任的运营商。\n她开始雇佣与她背景相似的女性：下层仆人和女佣，她们有经营企业的雄心和纪律，但缺乏资金。\n这些“哈珀主义者”接受了高强度的训练，以确保一致性，并创建了一所学校，向他们传授哈珀方法。\n为了拥有自己的特许经营权，哈珀特人需要支付一定的费用(随着时间的推移以贷款的形式偿还)，并同意只储备哈珀的产品-刷子、滋补品、椅子和水槽。哈珀选择了每个地点，并控制了标牌和广告。\n上图：一位顾客得到哈珀方法手册；下图：20世纪20年代的哈珀派聚会(罗切斯特博物馆和科学中心)。\n1891年，哈珀在纽约布法罗开设了第二家门店-被认为是美国第一家零售特许经营店。底特律、芝加哥、旧金山和巴尔的摩的分店很快就接踵而至，每个分店都由一名哈珀里特人经营。\n这种商业模式是如此成功和可扩展，到1914年，哈珀已经在美国、加拿大和欧洲的128个城市开设了134家特许经营店。这足以让哈珀作为罗切斯特商会唯一的女性成员赢得一席之地。同年，一家加拿大报纸写道：“(哈珀)是现代商界最引人入胜的故事之一。”\n哈珀当时已经是一个富有的女人了，她甚至保释了她曾经服务过的女人：当罗伯茨女士遇到财务问题时，她的前仆人拿出15万美元来挽救她的遗产。\n1920年，63岁的哈珀嫁给了39岁的陆军上校罗伯特·A·麦克贝恩。和她的同伴一起，她把眼光定得更高了。\n20世纪20年代的文化大革命带来了美容业的巨大转变。浪荡子们突然喜欢上了化妆品、口红和新发明，比如卷发棒和染发剂。在这一切中，哈珀一直专注于天然产品。\n她加倍生产她的滋补剂和天然洗发水，在一年的时间里(1920-1921年)从175家商店扩大到350家商店。她将她的服务扩展到男性，并将她的产品介绍给百货商店。\n在大萧条和大规模打折的时代，她坚持溢价，并将重点放在卓越的质量和客户服务上。\n她写道：“对现状感到满意肯定是衰落的迹象。”“对我来说，建设性的不满是一种更高的思维能力。”\n她辞去了总裁一职，把大权交给了她的丈夫，根据普利特的说法，他把产品业务“过度商业化”了。\n到1950年，93岁的哈珀去世时，她的企业已经发展成为一个拥有500人的沙龙帝国。她曾效力于一批令人惊叹的美国传奇人物--伍德罗·威尔逊、苏珊·B·安东尼、杰奎琳·肯尼迪、范德比尔特、福特、哈茨、杜邦。她积累了价值75万美元(1100万美元)的遗产。\n她在“纽约时报”发表的讣告称她是“美容业的先驱之一”。\n随着她的缺席，公司失去了相关性。1956年，她的丈夫卖掉了境况不佳的公司。所有权在接下来的几年里一直在反弹，直到1972年一位前哈珀化学家买下了它。\n今天，一家轮胎店占据了她在罗切斯特的旧工厂。她的老家-卡尔弗路863号-现在两侧是一家麦当劳。\n注：本文中的大部分信息来自简·普利特的优秀传记“玛莎·玛蒂尔达·哈珀与美国梦”(Martha Matilda Harper And The American Dream)。如果没有她坚持不懈的研究，哈珀的大部分故事可能都会随着时间的推移而消失。我们强烈建议您阅读一下。", "note_en": "Ray Kroc is often credited as the “father” of the  franchising business model.\n But 60 years before McDonald’s, a woman named Martha Matilda Harper built her own formidable franchise of hair salons — the first of its kind in the US — and trained hundreds of underprivileged women to run their own businesses.\n Harper not only pioneered franchising but is widely credited a trailblazer of the modern hair salon industry, which is now a  $20B market. An ex-servant who escaped poverty, she built an empire of 500 salons all over the world. And she did it all during a time when women were largely silenced in their entrepreneurial pursuits.\n   Born on September 10, 1857, in a small village in Ontario, Canada, Marth Matilda Harper began life with bleak prospects.\n She was the 4th of 10 children — all of whom shared a one-room log cabin — and her father, a tailor by trade, was (in her later words) a “stern, unflinching English pioneer too preoccupied with his daily struggle to pay much heed to [her].”\n  At the age of 7, Harper was sent off to be a house servant for a wealthy Ontario farm owner. In exchange for a grueling regimen of cleaning, cooking, and maintaining the farm, she was paid around $4 per month (about $130 today). Every penny went back to her father.\n   Five years later, Harper was transferred to the home of a nearby physician, who was looking for household help in the wake of his wife’s death.\n Though the doctor’s identity was never recorded, Harper’s biographer, Jane Plitt,  suggests it was Dr. Weston Leroy Herriman, an ex-Civil War medic who ran a practice in what is now the Canadian town of Port Hope.\n  At the time, the North American hair care regimen was minimal. Men and women only infrequently washed their hair. Hot water and  crude soap (made of hog fat and ashes) were in short supply, and commercial shampoos were a distant invention.\n But Herriman had spent time studying things like scalp hygiene and the effects of hair brushing. Over the next decade, he often shared his knowledge with Harper, who was eager to learn.\n When he died in 1879, he gave Harper something that would later change her life: a recipe for a hair tonic made of natural herbs.\n Newly bestowed with this gift, and with a small amount of savings to her name, the 25-year-old Harper boarded a ship to Rochester, New York, in search of a fresh start.\n   Once again, she found work as a servant — first for a local attorney, then for a wealthy woman named Luella J. Roberts.\n In the late 19th century, haircare was done in the home, usually by a servant. Harper assumed the role of Ms. Roberts’ personal beautician, doling out scalp massages and hair dressings. She was so skilled that the high-society women of Rochester were soon visiting the house for their own treatments.\n   During the little time she had between these duties, Harper began producing her own iteration of hair tonic in a shed in Ms. Roberts’ backyard.\n Harper ran small market tests with women in the neighborhood and handed the tonic out door-to-door. It was received astonishingly well — and she began to sense a business opportunity.\n Despite being at the center of a burgeoning women’s suffrage movement led by  Susan B. Anthony, Rochester’s entrepreneurial landscape was still controlled almost entirely by men. Victorian mores dictated that a woman’s place was in the home. A leading psychologist at the time  equated the free will of a woman to the “symptom of a disease.”\n Harper knew that the odds were stacked against her. But she had a vision, a niche specialty, and positive market reception.\n So, in 1888, at the age of 31, she invested her life savings —  $360 ($9.7k in 2020 dollars) — into her first Harper Hairdressing Parlor.\n  Harper set her sights on the Powers Building, a nine-story structure that housed some of the finest businesses in Rochester. At first, her application was denied. But with the help of a local attorney, she was granted a month-to-month lease.\n The salon was designed with a luxurious feel and built on the virtue of health and purity.\n Customers would be treated to the “Harper Method” — an elaborate 2-hour process involving head and shoulder massages, facials, and procedures with names like “saddle maneuver,” “strapping action,” and “checking motion” that were purported to stimulate blood flow and promote hair growth.\n To market these services, Harper used images of her own enviable head of hair — a chestnut mane so long that PT Barnum once tried to  recruit her to the circus.\n  Harper would later use her legendary mane of hair as a marketing tool to drum up business for her salon (Rochester Museum and Science Center)\n In the beginning, business was slow. Her high-end clientele — still insistent on home visits — were opposed to the idea of going to a public salon. As a trailblazer of the modern salon, Harper realized she’d have to change the behavior of her customers.\n  When a music teacher next door to her business mentioned he had no waiting room, Harper offered up her salon. Women began to wander in to get hair treatments while waiting for their children to finish their piano lessons.\n At a time when customer service was still something of a  foreign concept, Harper reinvested profits in enriching her clients’ experience, inventing the first reclining shampoo chair and a special sink with a unique cut-out for the neck.\n Word of this exotic new salon concept spread among Rochester’s elite. In short order, the 3-chair shop was bustling with prominent women from other cities, too.\n  Though Harper received requests to open up salons in other cities, she refused to expand until a certain number of women in that community signed a petition. A shrewd operator, she was keenly aware of market testing.\n Harper knew that she had to maintain strict control over her brand and the quality of her service. She also knew she had to find operators she could trust.\n She set out to hire women who came from a similar background as her: lower-class servants and housemaids who had the ambition and discipline to run a business but lacked the capital.\n These “Harperites” were put through intense training to ensure uniformity and created a school where they were taught the Harper methods.\n To own her own franchise, a Harperite would pay a fee (paid back as a loan over time), and agree to only stock Harper products — brushes, tonics, chairs, sinks. Harper chose each location and controlled signage and advertisements.\n  Top: A customer gets a Harper Method facil; bottom: A gathering of Haperites in the 1920s (Rochester Museum and Science Center)\n In 1891, Harper launched a second location — considered to be the first retail franchise in the US — in Buffalo, New York. Locations in Detroit, Chicago, San Francisco, and Baltimore soon followed, each run by a Harperite.\n The business model was so successful and scalable that by 1914, Harper had opened 134 franchises in 128 cities across the US, Canada, and Europe. It was enough to earn Harper a spot as the only female member of the Rochester Chamber of Commerce. “[Harper] is one of the most fascinating stories anywhere in the modern business world,” wrote a Canadian newspaper that year.\n Harper, by then a wealthy woman, even bailed out the woman she once served: When Ms. Roberts ran into financial problems, her ex-servant put up $1.5k to save her estate.\n In 1920, at age 63, Harper married Robert A. MacBain, a 39-year-old army colonel. With her companion, she set her sights even higher.\n The cultural revolution of the 1920s brought with it a tremendous shift in the beauty industry.  Flappers suddenly favored makeup, lipstick, and new inventions like the curling iron and hair dyes. Through it all, Harper maintained a focus on natural products.\n She doubled down on the production of her tonic and natural shampoos, expanding from 175 shops to 350 shops in the span of one year (1920-1921). She expanded her services to men and introduced her products to department stores.\n During the Depression, and an age of massive discounting, she stuck with her premium prices and kept the focus on exceptional quality and customer service.\n “Being satisfied with things the way they are is a sure sign of decline,” she wrote. “Constructive discontent is, to me, a higher faculty of mind.”\n   She stepped down as president and passed the reins to her husband, who, by Plitt’s account, “overcommercialized” the business with products.\n   By the time she passed away in 1950, at the age of 93, Harper had grown her business into a 500-salon empire. She’d served an astonishing  roster of American legends — Woodrow Wilson, Susan B. Anthony, Jacqueline Kennedy, Vanderbilts, Fords, Hearts, DuPonts. She’d amassed an estate worth $750k ($11m).\n Her obituary in  The New York Times heralded her as a “one of the pioneers in the beauty business.”\n  With her absence, the company lost relevance. In 1956, her husband sold the ailing business. Ownership bounced around in the following years until an ex-Harper chemist bought it in 1972.\n Today, a tire shop occupies her old factory in Rochester. And her old home — 863 Culver Road — is now flanked by a McDonald’s.\n Note:  Much of the information in this article came from Jane Plitt’s excellent biography,   Martha Matilda Harper and the American Dream . Without her dogged research, much of Harper’s story might’ve been lost to time. We highly recommend giving it a read.", "posttime": "2020-07-28 02:30:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "商业,商业模式,servant,沙龙", "title": "开创特许经营商业模式的家政服务员", "title_en": "The house servant who pioneered the franchising business model", "transed": 1, "url": "https://thehustle.co/martha-matilda-harper-inventor-of-franchising/", "via": "", "real_tags": ["商业", "商业模式", "servant", "沙龙"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014477, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌因禁止使用GNU Affero通用公共许可证(俗称“AGPL”)软件而闻名，谷歌也因成为时尚初创企业追逐商品的对象而闻名。不幸的是，这意味着他们很容易受到来自谷歌的最终反AGPL宣传的影响，几乎没有事实依据。\n事实上，AGPL的条款很容易遵守。AGPL区别于其他许可证的基本义务如下：\n根据AGPL的条款，此类软件的任何用户都有权获得源代码，包括通过网络访问它的用户，例如使用他们的网络浏览器或通过API或互联网协议访问它的用户。\n如果您使用的是AGPL许可的软件，如数据库引擎或我自己的AGPL许可的作品，并且您没有对源码进行任何更改，那么您所要做的就是提供一个指向上游源码的链接，如果用户要求，请将其定向到那里。如果您已经修改了软件，您只需发布您的修改即可。要做到这一点，最简单的方法是将其作为补丁上游发送，但您也可以使用像向用户提供tarball这样简单的东西。\n细微差别很详细，涵盖了许多边缘情况，以防止滥用。但是一般说来，只要在相同的AGPL条款下发布您的修改就可以了。许可证通常以COPYINGor许可证文件的形式出现在源代码中，所以如果您只需将修改后的源代码涂抹掉并将链接放到您的网站上，这就足够了。如果你想走得更远，并表达你对原始软件开发人员的感激之情，可以考虑提交你的更改以纳入上游内容。通常，您将收到的反馈也将帮助您的更改更好地适应您的用例；而将您的工作提交到上游将防止您的副本偏离上游。\n这很容易，对吧？我敢肯定，贵公司必须处理比AGPL更繁重的合同。那为什么谷歌要对此大惊小怪呢？\n关于AGPL的谷歌页面详细描述了关于AGPL义务的不准确(但常见的)误解，这些误解与正文不符。谷歌声明，例如，如果谷歌地图使用PostGIS作为其数据存储，而PostGIS使用AGPL，谷歌将被要求发布谷歌地图代码。这不是真的。在这种情况下，他们将被要求发布他们的PostGIS补丁。AGPL并没有扩展GPL，因为它并没有像Google暗示的那样，将互联网视为一种创建衍生作品的链接形式，而是让任何通过互联网使用该软件的人都有权获得其源代码。它并没有更新“什么算得上是‘衍生作品’”算法，也就是说，它更新了“算得上是‘分发’软件‘”的算法。\n他们散布这些误解的原因很简单：他们想要阻止人们使用AGPL，因为他们不能有效地生产这样的软件。谷歌希望能够将自由/开源软件整合到他们的产品中，并将其出售给用户，而没有义务发布他们的衍生作品。谷歌是一家互联网公司，他们提供互联网服务。最初的GPL不会威胁到他们的计划，因为他们的软件是通过互联网访问的，而不是直接分发给最终用户。\n通过不鼓励在更广泛的社区中使用AGPL，Google希望创建一个更大的自由和开放源码软件集，他们可以根据自己的需要使用这些软件，而不需要上游的任何义务。问问你自己：为什么像使用什么软件许可证这样的面向内部决策的文档会在公共场所发布？答案很简单：影响公众。这是宣传。\n有一种奇怪的想法，那些避开AGPL而选择像麻省理工学院这样的公司这样做的软件公司之所以这样做，是因为他们想让“像Google 2”这样的公司为他们的软件付费，而且他们知道，如果他们使用AGPL，他们就没有机会了。事实上，谷歌永远不会买你的软件。如果你不使用AGPL，他们只会拿走你的软件，什么也不会归还。如果你真的使用了AGPL，他们只会在内部开发一个解决方案，谷歌不会付钱给你。\n不要害怕使用AGPL，也不要害怕使用使用AGPL的软件。不管谷歌希望你怎么认为，这些义务并不是特别繁重或困难。驾照不是很长--读一读，你自己看看。\n顺便说一句，以任何标准衡量，世界上“像谷歌”的公司都不超过10家。--↩。\n对我的一篇帖子有什么评论吗？通过发送电子邮件至~sircmpwn/public-inbox@lists.sr.ht，在我的公共收件箱中开始讨论。\n您是一名自由软件维护员吗？在您的工作过程中，您是否正在与压力、苛刻的用户、超负荷工作或任何其他社会问题作斗争？请给我发电子邮件-我知道你的感受，我可以倾听你的同情心，分享一些经验丰富的建议。", "note_en": "Google is well-known for  forbidding the use of softwareusing the  GNU Affero General Public License, commonly known as “AGPL”.Google is also well-known for being the subject of cargo-culting by fadstartups. Unfortunately, this means that they are susceptible to what isultimately anti-AGPL propaganda from Google, with little to no basis in fact.\n  In truth, the terms of the AGPL are pretty easy to comply with. The basicobligations of the AGPL which set it apart from other licenses are as follows:\n Any users of such software are entitled to the source code under the terms ofthe AGPL, including users accessing it over the network such as with their webbrowser or via an API or internet protocol.\n If you’re using AGPL-licensed software like a database engine or  my ownAGPL-licensed works, and you haven’t made any changes to the sourcecode, all you have to do is provide a link to the upstream source codesomewhere, and if users ask for it, direct them there. If you  have modifiedthe software, you simply have to publish your modifications. The easiest way todo this is to send it as a patch upstream, but you could use something as simpleas providing a tarball to your users.\n The nuances are detailed and cover many edge cases to prevent abuse. But ingeneral, just publish your modifications under the same AGPL terms and you’llbe good to go. The license is usually present in the source code as a  COPYINGor  LICENSE file, so if you just tar up your modified source code and drop alink on your website, that’s good enough. If you want to go the extra mile andexpress your gratitude to the original software developers, consider submittingyour changes for upstream inclusion. Generally, the feedback you’ll receive willhelp to make your changes better for your use-case, too; and submitting yourwork upstream will prevent your copy from diverging from upstream.\n That’s pretty easy, right? I’m positive that your business has to deal with muchmore onerous contracts than the AGPL. Then why does Google make a fuss about it?\n The Google page about the AGPL details inaccurate (butcommon  1) misconceptions about the obligations of the AGPL that don’t followfrom the text. Google states that if, for example, Google Maps used PostGIS asits data store, and PostGIS used the AGPL, Google would be required to releasethe Google Maps code. This is not true. They would be required to release  theirPostGIS patches in this situation. AGPL does not extend the GPL in that itmakes the Internet count as a form of linking which creates a derivative work,as Google implies, but rather that it makes anyone who uses the the software viathe Internet entitled to its source code. It does not update the “what countsas a ‘derivative work’” algorithm, so to speak — it updates the “whatcounts as ‘distributing’ the software” algorithm.\n The reason they spread these misconceptions is straightforward: they want todiscourage people from using the AGPL, because they cannot productize suchsoftware effectively. Google wants to be able to incorporate FOSS software intotheir products and sell it to users without the obligation to release theirderivative works. Google is an Internet company, and they offer Internetservices. The original GPL doesn’t threaten their scheme because their softwareis accessed over the Internet, not distributed to end-users directly.\n By discouraging the use of AGPL in the broader community, Google hopes to createa larger set of free- and open-source software that they can take for their ownneeds without any obligations to upstream. Ask yourself: why is documentation ofinternal-facing decisions like what software licenses to use being published ina public place? The answer is straightforward: to influence the public. This ispropaganda.\n There’s a bizarre idea that software companies which eschew the AGPL in favor ofsomething like MIT are doing so specifically because they want companies “likeGoogle  2” to pay for their software, and they know that they have no chance ifthey use AGPL. In truth, Google was never going to buy your software. If youdon’t use the AGPL, they’re just going to take your software and give nothingback. If you do use the AGPL, they’re just going to develop a solution in-house.There’s no outcome where Google pays you.\n Don’t be afraid to use the AGPL, and don’t be afraid to use software which usesthe AGPL. The obligations are not especially onerous or difficult, despite whatGoogle would have you believe. The license isn’t that long — read it andsee for yourself.\n By the way, there are no more than 10 companies world-wide which are “like Google” by any measure.  ↩\n Have a comment on one of my posts? Start a discussion in my  public inbox by sending an email to   ~sircmpwn/public-inbox@lists.sr.ht\n Are you a free software maintainer who is struggling with stress, demanding users, overwork, or any other social problems in the course of your work? Please  email me — I know how you feel, and I can lend a sympathetic ear and share some veteran advice.", "posttime": "2020-07-28 02:30:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "agpl,软件", "title": "AGPL的条款很容易遵守", "title_en": "The terms of the AGPL are pretty easy to comply with", "transed": 1, "url": "https://drewdevault.com/2020/07/27/Anti-AGPL-propaganda.html", "via": "", "real_tags": ["agpl", "软件"]}, {"category": "", "categoryclass": "", "imagename": "937e22ffaa4460112a2684673e8d9b56.png", "infoid": 1014476, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欢迎参加“桶中之鱼”内存安全奖励计划，这是第一个奖励使用内存安全编程语言提高安全性的关键安全开源软件贡献者的奖励计划。\n外面已经有很多安全赏金了，为什么还要再来一个呢？大多数赏金侧重于奖励发现单个漏洞的人。在桶中鱼，我们坚信，为了实现更好的计算机安全，我们必须集中精力解决导致大量漏洞的根本原因，而不是一次修复一个漏洞。在过去的两年里，我们一直在进行自己的安全研究，并对许多项目的漏洞进行量化。我们一次又一次看到的是，内存不安全的编程语言要为大量的漏洞负责。\n为此，我们设立了一项赏金，奖励那些解决了这么多漏洞的根本原因的人。我们希望这将会：\n规范安全关键型项目应该寻找摆脱内存不安全编程语言的方法的想法。\n为了有资格获得奖励，你必须为一个安全关键的开源项目做出贡献，该项目是用内存不安全的语言编写的，其中的更改合并到上游，并且更改使用内存安全的语言来减少内存不安全的危害。在这个项目中，您必须为一个用内存不安全的语言编写的安全关键开源项目做出贡献，在这个项目中，更改被合并到上游中，并且更改使用内存安全的语言来减少内存不安全的危害。\n截至本文发布之日，安全关键型开源项目和内存安全(和不安全)语言的定义如下：\n是什么让项目变得安全关键？它的使用非常广泛，而且它用在安全敏感的环境中。\n是什么让语言记忆变得不安全？内存不安全的编程语言包括但不限于C、C++和汇编语言。\n是什么让语言内存变得安全？内存安全编程语言包括但不限于Rust、Go和SWIFT。\n添加使库可从Rust或SWIFT使用的绑定(例如，将官方SWIFT绑定添加到图像解析库)。\n将项目部分(或完全)迁移到内存安全语言(例如，将图像解析库中的一个解码器/编码器转换为Rust)。\n不时，在我们完全酌情的情况下，桶中鱼可以(I)更改这些定义，(Ii)将任何其他语言添加或删除到内存安全或内存不安全列表，或(Iii)添加或删除符合条件的投稿类型。如果您计划参加此计划，您应该不时查看此列表。\n奖励为500美元或100美元，取决于贡献额的大小和相关性，由桶中鱼的单独决定权决定。\n如果您希望将您的赏金捐赠给合格的501(C)(3)组织，我们将加倍赏金。在接到支付奖励通知后12个月内无人认领的任何奖励将捐赠给我们选择的慈善机构。\n以提交/TEMPLATE.md的形式向此存储库发送一个拉请求，将一个新条目添加到提交/目录中。我们的团队将审查提交的材料，如果符合条件，我们会将其合并，并与您一起安排付款。\n赏金申请必须在提交后12个月内提出，上游合并。\n下面列出的项目中，维护人员已经明确表示，他们有兴趣为采用内存安全语言做出贡献。如果您是开放源码项目的维护者，您可以发送拉取请求将其添加到此处。\n问：如果维护人员不接受补丁怎么办？答：记忆安全奖赏只奖励上游合并的贡献。我们强烈鼓励那些对追求丰富感兴趣的人与开源维护者合作，而不是与之对抗，并表现得有远见。\n问：有没有办法奖励发现或修复漏洞的人？答：不是，这项奖励是专门针对从内存不安全语言中迁移出来的。\n问：一个人可以同时从桶中鱼和另一个赏金计划(例如谷歌的补丁奖励)中获得奖励吗？答：是的！\n问：这些赏金不是很高。答：这不是问题，但不，他们不是。这是由对这一主题充满热情的安全工程师从他们个人的口袋里资助的，而不是由一家公司资助的。\n问：谁决定哪些提交符合条件？答：我们目前的小组由亚历克斯·盖纳(Alex Gaynor)和保罗·凯勒(Paul Kehrer)组成。\n制裁名单和参与能力。我们不能向制裁名单上的个人或制裁名单上的国家(例如古巴、伊朗、朝鲜、苏丹或叙利亚)的个人发放奖励。此外，根据您当地的法律，您的进入能力可能会受到额外的限制。每位提交者负责确定当地法律是否允许您参与。\n税收。根据您居住的国家和国籍的不同，您应对任何税收影响负责。如果任何奖励是600美元或更多(或根据美国国税法确定的任何其他金额)，如果您是美国居民，您将收到一份向美国国税局报告奖励的美国表格1099。\n违反法律、损害第三方数据/项目、免除责任。您有责任确保您的工作不违反任何当地或美国法律，也不会破坏或损害任何不属于您自己的数据或项目。您理解桶中之鱼或下文第4节中定义的其任何受补偿方对您或任何其他人不承担任何责任，除非在本计划中明确规定的范围内，对您提交给本计划的任何工作，包括工作的可行性，不承担任何责任。\n责任和赔偿。桶中鱼或其附属公司、负责人、成员、官员、董事、员工、代表、代理人、律师或继任者和受让人(受补偿方)对根据本计划提交材料的个人或实体(提交者)或任何其他个人、商号或组织，在履行其义务过程中或与其义务相关的任何作为或不作为方面，均不承担任何责任(#34；提交人)或任何其他个人、商号或组织在履行其义务的过程中或与其义务相关的情况下，对其自身或任何其他个人、商号或组织的任何作为或不作为承担任何责任，或对任何其他个人、商号或组织在履行其义务的过程中或与其义务相关的任何行为或不作为承担任何责任。的行为或不作为构成故意的不当行为、不守信用、严重疏忽或鲁莽无视受补偿方在本计划下的义务和义务。提交方同意赔偿受补偿方，并使其不受任何费用、损失、索赔、损害赔偿、债务、费用(包括合理的法律和其他专业费用和支出)、判决、罚款或和解(损失)的损害，这些费用、损失、索赔、损害赔偿、责任、费用(包括合理的法律和其他专业费用和支出)、判决、罚款或和解(损失)是由政府机构或任何其他人在任何威胁或实际诉讼、仲裁或行政诉讼过程中发生的，这些诉讼、仲裁或行政诉讼涉及政府机构或任何其他人在本计划项下完成的工作(已收到报酬或其他与本协议有关的工作)，的行为或不作为构成故意的不当行为、不守信用、严重疏忽或鲁莽无视受补偿方在本计划下的义务和义务。根据受补偿方和提交方之间的关系以及本计划的生命周期，本条款将继续有效，并保持完全的效力和效力。\n对程序的更改。对于尚未提交给他们的项目，桶中的鱼可以随时自行决定更改计划的条款。任何更改都应反映在https://github.com/fishinabarrel/bounty.规定的计划文件中。\n约束效应。本计划规则对桶中鱼和提交人及其各自的继承人、受让人、继承人和法定代表人均具有约束力，并使其受益，但未经另一方书面同意，任何一方不得转让本协议项下的任何权利。", "note_en": "Welcome to the Fish in a Barrel Memory Safety Bounty Program, the firstsecurity bounty that rewards people for contributing to security-critical opensource software in ways that use memory-safe programming languages to improvesecurity.\n  There are already a great many security bounties out there, why another? Mostbounties focus on rewarding finders of individual bugs. At Fish in a Barrel, wefirmly believe that in order to achieve better computer security, we must focusnot on fixing bugs one at a time,but rather on addressing the underlying causes that lead to a great manyvulnerabilities. We&#39;ve spent the last two years performing our own security researchand  quantifying vulnerabilities acrossmany projects. What we&#39;ve seen time and time again is that  memory unsafeprogramming languages are to blamefor an incredible share of vulnerabilities.\n To that end, we&#39;ve created a bounty that rewards people for addressing thatunderlying cause of so many vulnerabilities. It is our hope that this will:\n Normalize the idea that security-critical projects should be looking for waysto migrate away from memory unsafe programming languages.\n  To qualify for a bounty, you must make a contribution to a  security-criticalopen-source project which is written in a memory- unsafe language, where thechange is merged into upstream, and where the change uses memory- safelanguages to reduce the harm of memory-unsafety.\n Definitions of security-critical open source project and memory-safe (andunsafe) languages as of the date this is posted are:\n What makes a project security-critical? It&#39;s very widely used, and it&#39;sused in contexts which are security sensitive.\n What makes a language memory-unsafe? Memory-unsafe programminglanguages include, but are not limited to C, C++, and Assembly.\n What makes a language memory-safe? Memory-safe programming languagesinclude, but are not limited to Rust, Go, and Swift.\n  Add bindings making the library usable from Rust or Swift (e.g., addingofficial Swift bindings to an image parsing library)\n Partially (or completely) migrate the project to a memory-safe language(e.g., convert one of the decoder/encoders in an image parsing library toRust)\n From time to time, and in our sole discretion, Fish in a Barrel may (i)change these definitions, (ii) add or delete any other languages to thememory-safe or memory-unsafe list, or (iii) add or delete the types ofcontributions that qualify. If you are planning on participating in thisProgram, you should check this list from time to time.\n   Rewards are $500 or $100, depending on the size and relevance of thecontribution, determined in the sole discretion of Fish in a Barrel.\n If you wish to donate your bounty to a qualified 501(c)(3) organization we will double thesize of the bounty. Any rewards that are unclaimed after 12 months fromnotification that a reward is payable will be donated to a charity of ourchoosing.\n  Send a pull-request to this repository, adding a new entry to the submissions/ directory, in the form of  submissions/TEMPLATE.md. Our team will review thesubmission, and if it qualifies we will merge it and work with you to arrangepayment.\n Applications for a bounty   must be made within 12 months of the submissionbeing merged upstream.\n  Projects listed below are ones where the maintainers have explicitly indicatedthey would be interested in contributions to embrace memory-safe languages. Ifyou&#39;re the maintainer of an open-source project, you can send a pull request toadd it here.\n    Q: What if the maintainers won&#39;t accept the patch?  A: The Fish in a Barrel Memory Safety Bounty only rewards contributionsthat are merged upstream. We strongly encourage people interested in pursuing abounty to work with, not against, open source maintainers and to behaverespectfully.\n  Q: Is there a way to be rewarded for finding or fixing a vulnerability?  A: No, this bounty is specific to migration away from memory unsafelanguages.\n Q: Can one get a reward from both Fish in a Barrel and another bounty program(e.g., Google&#39;s Patch Rewards)?  A: Yes!\n Q: These bounties aren&#39;t very high.  A: That&#39;s not a question, but no, they&#39;re not. This is funded by securityengineers who are passionate about this subject, from their personal pockets,not by a company.\n Q: Who decides what submissions qualify?  A: Our current panel consists of Alex Gaynor and Paul Kehrer.\n  Sanctions Lists and Ability to Participate. We are unable to issue rewards to individuals who are on sanctions lists, or who are in countries ( e.g., Cuba, Iran, North Korea, Sudan, or Syria) on sanctions lists. In addition, there may be additional restrictions on your ability to enter depending upon your local law. Each submitter is responsible for determining whether local law allows you to participate.\n Taxes. You are responsible for any tax implications depending on your country of residency and citizenship. In the event that any reward is for $600 or more (or any other amount determined under the U.S, Internal Revenue Code), if you are a U.S. resident, you will receive a U.S. Form 1099 reporting the reward to the U.S. Internal Revenue Service.\n Violation of Laws, Compromise of Third-Party Data/Projects, Waiver of Liability. It is your responsibility to make sure that your work does not violate any local or U.S. law and does not disrupt or compromise any data or project that is not your own. You understand that Fish in a Barrel or any of their Indemnified Parties as defined in Section 4 below has no liability to you or any other person, except to the extent that is specifically set forth in the Program, for any work you submit to the Program, including the viability of the work.\n Liability and Indemnification. Neither Fish in a Barrel, or any if its affiliates, principals, members, officers, directors, employees, representatives, agents, attorneys, or successors and assigns (the &#34;Indemnified Parties&#34;) shall have any liability to the person or entity making a submission under the Program (&#34;Submitter&#34;), or to any other person, firm or organization, for any act or omission of itself or of any other person, firm or organization in the course of, or connected with, its obligations under this Agreement, unless the Indemnified Party&#39;s action or omission constitutes willful misfeasance, bad faith, gross negligence, or reckless disregard of the Indemnified Party&#39;s obligations and duties under the Program. Submitter agrees to indemnify and hold the Indemnified Parties harmless from and against any and all costs, losses, claims, damages, liabilities, expenses (including reasonable legal and other professional fees and disbursements), judgments, fines or settlements (&#34;Losses&#34;) incurred by the Indemnified Party in the course of any threatened or actual litigation, arbitrations or administrative proceedings brought by a governmental agency or any other person pertaining to the work done under the Program for which a reward was received or otherwise relating to this Agreement, unless the Indemnified Party&#39;s action or omission constituted willful misfeasance, bad faith, gross negligence or reckless disregard of the Indemnified Party&#39;s obligations and duties under the Program. This provision shall survive and remain in full force and effect following the relationship between the Indemnified Parties and the Submitter, and the life of the Program.\n Changes to the Program. Fish in a Barrel may change the terms of the Program as to projects not yet submitted to them from time to time and in their sole discretion. Any changes shall be reflected on the Program documents set forth at  https://github.com/fishinabarrel/bounty.\n Binding Effect. The Program Rules shall be binding upon and shall inure to the benefit of both Fish in a Barrel and the Submitter and their respective successors, assigns, heirs, and legal representatives, but no any rights hereunder may be assigned by the either Party without the written consent of the other party.", "posttime": "2020-07-28 02:29:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "记忆,barrel,奖励", "title": "桶中鱼记忆安全赏金计划", "title_en": "Fish in a Barrel Memory Safety Bounty Program", "transed": 1, "url": "https://github.com/fishinabarrel/bounty", "via": "", "real_tags": ["记忆", "barrel", "奖励"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014475, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "程序产生的数据需要存储在某个地方以备将来参考，而且必须有某种组织，这样我们才能快速检索所需的信息。文件系统(FS)负责此任务，并在物理存储数据的存储设备上提供抽象。\n在这篇文章中，我们将更多地了解文件系统使用的概念，以及在编写您自己的文件系统时它们是如何组合在一起的。\n当数据存储在硬盘驱动器(HDD)或固态驱动器(SSD)中时，它以称为扇区(在SSD情况下称为页)的小单位写入。驱动器没有任何关于这段数据代表什么的信息，尽管如此，磁盘只是一个巨大的扇区阵列。理解这一切是文件系统的工作。\n文件系统将磁盘划分为固定大小的块。FS使用这些块中的大部分来存储用户数据，但也有一些块用于存储文件系统操作所必需的元数据。\n下图举例说明了文件系统如何组织磁盘上的信息：\n超级块存储关于文件系统的大部分元数据，例如：块大小、时间戳、正在使用的块和文件的数量以及有多少空闲的，等等。\n位图是跟踪哪些数据块和索引节点空闲的一种方式。位图中的索引设置为0表示空闲时隙，而索引设置为1表示占用的时隙。\nInode是存储有关文件的元数据的结构。形成文件的数据块的权限、大小、位置等属性保存在inode中。\nInode存储在一起形成inode表的块中，如下图所示。\n对于设置为1的inode位图中的每个插槽，表中将有一个对应的inode。槽的索引与表中的索引相同，这解释了名称inode是索引节点的简称。\n顾名思义，数据块是写入文件的实际数据的块。这些积木也有不同的用途，我们很快就会看到。\nInode需要有一种指向组装文件的数据块的方式。最简单的方法是有直接的指针。在这种情况下，每个指针都指向包含某些文件数据的块。问题是，这种模式不支持大文件(大小超过索引节点可以拥有的直接指针数)。解决这个问题的一种方法是使用间接指针，而不是存储用户数据，而是存储指向保存用户数据的块的指针。对于较大的文件，使用双间接指针添加另一层间接层。而对于更大的文件，则会使用三个间接指针。\n为了给出每个级别允许的最大文件大小的概念，让我们运行一个示例，假设每个块大小为4 KiB。研究表明，大多数文件都很小[1]，因此12个直接指针可以支持高达48 KiB的文件。考虑到每个指针占用4个字节，因此单个间接指针将允许文件最大约为4 MiB：\n最后，使用三个间接指针，文件的大小可能在4TiB左右：\n此方法对于处理大文件可能效率不高。例如，100MiB的文件需要分配25600个数据块。如果数据块在磁盘上碎片化，性能可能会受到严重影响。\n一些文件系统使用区段来帮助解决这种情况。在这种方法中，只有一个指针和一个长度来告诉数据从指针的地址开始，并在给定的块范围内运行。在上面的示例中，描述同一文件将使用大小为100MB的单个区段。可以使用多个区段来支持更大的文件。\n您可能已经注意到，目录没有特定的结构。其背后的原因是inode同时表示文件和目录。区别在于存储在相应数据块中的内容。目录只是它包含的所有文件的列表。每个条目的形式为(名称、索引号)，因此在查找特定文件(或另一个目录)时，系统使用该名称来查找相应的inode。\n如果目录包含大量文件，则搜索文件可能会很慢。这个问题可以通过维护排序的列表并使用二进制搜索来缓解，或者也可以使用哈希表或平衡搜索树而不是将其表示为列表。\n从文件读取时，文件系统需要遍历整个路径，沿途访问每个信息节点，直到到达所需文件的信息节点。假设用户具有访问文件的权限，文件系统会咨询与其关联的块，然后从这些块读取请求的数据。\n当写入文件时，同样的过程必须找到相应的inode。如果写入需要新的数据块，则文件系统必须分配该数据块，更新相关信息(位图和索引节点)，然后写入该数据块。因此，一次写入操作需要五次I/O操作：一次读取位图，一次写入以将新块标记为已占用，两次读取和写入索引节点，以及一次写入块中的数据。在创建新文件时，此数字可能会增加，因为现在还必须读取和写入目录的关联信息以反映此新文件，以及创建新索引节点的操作。\n作为一个附带项目，我决定在学习Rust语言时编写自己的文件系统。有些方面受到ext4[2](和家族)的启发，在本节中，您将了解更多关于它的信息。文件系统使用FUSE[3]，磁盘表示为常规文件。数据块大小可以配置为1 KiB、2 KiB或4 KiB。对于4KiB的数据块大小，文件大小最高可达4 GiB，而文件系统理论上最大可达16 TiB。\n第一步是使用文件系统的配置值创建映像本身。这是通过mkfs命令实现的：\n运行该命令后，将创建总大小为10 GiB的映像，并且文件系统中的每个数据块的大小为4 KiB。\n在此步骤中，将配置值和其他结构(如根目录)写入第一个块(即超级块)中的映像。它对应的位图条目和数据也被写入。这些值将有助于下一步：挂载文件系统。\n创建映像后，我们需要挂载它，以便可以开始使用它。Mount命令用于执行以下操作：\n超级块写入前1024个字节，它保存mkfs命令中提供的配置值。\n发布结构超级块{发布魔术：u32，发布块大小：u32，发布创建时间：u64，发布修改时间：选项&lt；U64&gt；，发布最后安装时间：选项&lt；U64&gt；，pub block_count：u32，pub inode_count：u32，pub free_block：u32，pub free_inode：u32，pub group：u32，pub data_block_per_group：u32，pub uid：u32，pub gid：u32，pub checksum：u32，}。\n接下来的两个块表示数据位图和信息节点位图。然后，将n个块的运行用于索引节点表。并且紧随其后的块是将写入用户数据的块。\nPub struct inode{pub mode：libc：：mode_t，pub hard_link：u16，pub user_id：libc：：uid_t，pub group_id：libc：：gid_t，pub block_count：u32，//pub大小：u64，pub Created_at：u64，pub access_at：option&lt；i64&gt；，pub Modified_at：option。I64&gt；，发布直接块：[u32；作为usize的直接指针]，发布间接块：u32，发布双间接块：u32，发布校验和：u32，}。\n如上所述，inode支持双间接指针，这意味着对于块大小为4 KiB的磁盘，文件的最大容量为4 GiB。直接指针数量设置为12：\n第一次启动文件系统时，将使用下面的定义创建根目录：\n信息节点位图具有4 KiB，这意味着每个位图块将具有32768个信息节点的容量。假设我们将inode的大小四舍五入为128字节；相应的inode表将需要4MiB的空间。构造它们的方法之一是让许多块专用于位图，然后相应的编号块用于存储索引节点，其余块用于用户数据。\n与其这样做，我们可以创建块组，使其始终具有一个用于数据位图的块和一个用于inode位图的块。接下来的1024个数据块包含索引节点表，然后是用于用户数据的32768个数据块。\n现在“磁盘”已经设置好了，我们可以开始从其中写入和读取文件了。使用mkdir创建新目录：\n发生的过程如下：系统搜索根目录的索引节点，查找内容正被写入的数据块，为新目录分配新的索引节点和数据块，将条目写入根目录，最后将新目录写入其数据块。\n写入新文件遵循类似的方法。系统遍历给定路径，直到到达最终目录，并添加表示新文件的条目。\nWRITE函数提供路径、带有数据的缓冲区、偏移量和一个fileinfo结构，该结构可能包含一个文件句柄以及关于该文件的额外信息：\n在这种情况下，系统不会再次遍历路径来查找索引节点，而是使用文件句柄(FS之前在创建文件时设置了它)。有了inode，FS就可以通过查找写入inode的确切位置来构建结构：\nFn inode_offsets(&amp；self，index：u32)-&gt；(U64，U64){let inodes_per_group=self.superblock().data_block_per_group as U64；let inode_bg=(index as U64-1)/inodes_per_group；let bitmap_index=(index as U64-1)&amp；(inodes_per_group-1)；(inode_bg，bitmap_index)}fn inode_Seek_position(&amp；self，index：u32)-&gt；U64{let(group_index，bitmap_index)=self.inode_offsets(Index)；let block_size=sel.superblock().block_size；group_index*util：：block_group_size(Block_Size)+2*block_size as U64+bitmap_index*inode_size+superblock。\n既然FS有了关于当前分配给inode的数据块的信息，它就可以使用这些信息来查找写入数据的确切位置，过程类似于上面所示的过程。新数据块首先添加到信息节点直接数据块阵列，如果文件大小超过(12*block_size)，FS将分配一个INDIRECT_BLOCK，其中包含标识包含用户数据的其他数据块的编号。在文件更大且需要更多块的情况下，系统使用指向更多间接块的DUBLE_INDIRECT_BLOCK字段添加额外的间接层。从文件读取遵循相同的方法。您可以看到它在这里运行：\n文件系统背后的思想是为磁盘上的内容定义一个结构，然后允许系统在创建、写入和读取文件和目录时在其上操作。\n我们学习了一些用于磁盘格式的概念，目录和文件是如何表示的。一个有趣的方面是使用间接指针来存储大文件。如果您有兴趣了解有关文件系统的更多信息，我建议您阅读更多有关使用的其他技术的信息，例如日志记录、写入时复制、日志结构的文件系统，以及现代文件系统如何应用这些技术和其他技术。也许可以开始学习一下你现在正在使用的那个。\n[1]Agrawal，N.，Bolosky，W.J.，Douceur，J.R.和Lorch，J.R.，2007。一项为期五年的文件系统元数据研究。ACM存储学报(TOS)，3(3)，第9-ES页。", "note_en": "Data produced by programs need to be stored somewhere for future reference, andthere must be some sort of organisation so we can quickly retrieve the desiredinformation. A file system (FS) is responsible for this task and provides anabstraction over the storage devices where the data is physically stored.\n In this post, we will learn more about the concepts used by file systems, andhow they fit together when writing your own.\n  When data is stored in a hard-disk drive (HDD) or solid-state drive (SSD), it iswritten in small units called sectors (or pages in the SSD case). The drivesdon’t have any information about what that piece of data represents, for all itis worth, the disk is just a giant array of sectors. It is the job of the filesystem to make sense of it all.\n A file system will divide the disk into fixed-sized blocks. The FS uses themajority of these blocks to store user data, but some blocks are used to storemetadata that is essential for the file system operation.\n The following figure gives an example of how a file system structures theinformation on the disk:\n    The superblock stores most of the metadata about the file system, such as thefollowing: block size, timestamps, how many blocks and files are in use and howmany are free, etc.\n Bitmaps are one way of tracking which data blocks and inodes are free. An indexin the bitmap set to  0 indicates a free slot, and an index set to  1indicates an occupied slot.\n  The inode is the structure that stores metadata about a file. Attributes such aspermissions, size, location of data blocks that form the file and more are savedin an inode.\n The inodes are stored in blocks that together form the  inode table as thefollowing figure shows.\n  For each slot in the inode bitmap set to  1, there will be a correspondinginode in the table. The index of the slot is the same as the index in the table.And this explains the name inode being a short name for  index node.\n  As the name suggests, the data blocks are the blocks where the actual databelonging to a file is written. These blocks are also used for differentpurposes which we will see shortly.\n  The inode needs to have a way of pointing to the data blocks that assemble thefile. The simplest way is to have  direct pointers. In this case, eachpointer points to a block that has some of the file data. The problem is thatlarge files; where the size exceeds the number of direct pointers an inode canhave; are not supported in this mode. One way of overcoming this issue is to use indirect pointers, which instead of storing user data they store pointers toblocks that hold user data. For larger files, another layer of indirection isadded with  double indirect pointers. And for even larger files,  tripleindirect pointers are put to use.\n  To give an idea of the largest file size that each level permit let’s run anexample considering that each block size is 4 KiB. Research has shown that themajority of files are small [1] so 12 direct pointers would allow for files upto 48 KiB. Considering that each pointer takes 4 bytes, a single indirectpointer would then allow a file to be up to around 4 MiB:\n    And finally, with triple indirect pointers the files could have a size of around4 TiB:\n  This approach might not be very efficient for handling large files. For example,a file of 100 MiB requires the allocation of 25600 blocks. The performance canbe severely impacted in case the blocks were fragmented over the disk.\n Some file systems use  extents to help with this situation. In this approach,there is a single pointer and a length to tell that the data starts at theaddress of the pointer and runs for the given range of blocks. In our exampleabove, describing the same file would use a single extent of size 100 MiB.Multiple extents can be used to support larger files.\n  You may have noticed that there isn’t a specific structure for directories. Thereason behind it is the fact that inodes represent both files and directories.The difference is in what is stored in the corresponding data blocks.Directories are simply a list of all files that it includes. Each entry has theform of  (name, index number) so when looking up a particular file (or anotherdirectory), the system uses the  name to find the corresponding inode.\n Searching for a file can be slow if a directory contains a large number offiles. This issue can be mitigated by maintaining the list sorted and usingbinary search, or instead of representing it as a list, a hash table or abalanced search tree could also be used.\n   When reading from a file, the file system needs to traverse the entire path,visiting each inode along the way until reaching the inode for the desired file.Assuming the user has permission to access the file, the file system consultswhich blocks are associated with it and then read the solicited data from them.\n  When writing to a file, the same process has to happen to find the correspondinginode. If a new block is required for the write, the file system has to allocatethe block, update the associated information (bitmap and inode), and write tothe block. So one write operation requires five I/O operations: one read to thebitmap, one write to mark the new block as occupied, two to read and write tothe inode, and one writing the data in the block. This number can increase whencreating a new file because now the associated information of the directory alsohas to be read and written to reflect this new file, and operations to create anew inode.\n  As a side project, I decided to write my own file system in Rust as I’m learningthe language. Some aspects are inspired by ext4 [2] (and family), and in thissection, you will learn more about it. The file system uses FUSE [3], and thedisk is represented as a regular file. The block size can be configured as 1KiB, 2 KiB, or 4 KiB. Files can have a size of up to 4 GiB for block sizes of 4KiB while the file system could theoretically be up to 16 TiB in size.\n  The first step is to create the image itself with the configuration values forthe file system. This is achieved via the  mkfs command:\n  After running the command, the image is created with a total size of 10 GiB, andeach block in the file system has a size of 4 KiB.\n In this step, the configuration values and other structures such as a rootdirectory are written to the image in the first block: the superblock. Itscorresponding bitmap entries, and data are also written. These values will benecessary for the next step: mounting the file system.\n  After creating the image, we need to mount it so we can start using it. The mount command is used for this:\n     The superblock is written in the first 1024 bytes, and it holds theconfiguration values provided in the  mkfs command.\n pub  struct  Superblock  {  pub  magic :  u32 ,  pub  block_size :  u32 ,  pub  created_at :  u64 ,  pub  modified_at :  Option &lt; u64 &gt; ,  pub  last_mounted_at :  Option &lt; u64 &gt; ,  pub  block_count :  u32 ,  pub  inode_count :  u32 ,  pub  free_blocks :  u32 ,  pub  free_inodes :  u32 ,  pub  groups :  u32 ,  pub  data_blocks_per_group :  u32 ,  pub  uid :  u32 ,  pub  gid :  u32 ,  pub  checksum :  u32 , }\n The next two blocks represent the data bitmap and inode bitmap. Then, a run of n blocks are used for the inode table. And the blocks following that are theones where user data will be written.\n  pub  struct  Inode  {  pub  mode :  libc :: mode_t ,  pub  hard_links :  u16 ,  pub  user_id :  libc :: uid_t ,  pub  group_id :  libc :: gid_t ,  pub  block_count :  u32 ,  // should be in 512 bytes blocks  pub  size :  u64 ,  pub  created_at :  u64 ,  pub  accessed_at :  Option &lt; i64 &gt; ,  pub  modified_at :  Option &lt; i64 &gt; ,  pub  changed_at :  Option &lt; i64 &gt; ,  pub  direct_blocks :  [ u32 ;  DIRECT_POINTERS  as  usize ],  pub  indirect_block :  u32 ,  pub  double_indirect_block :  u32 ,  pub  checksum :  u32 , }\n As you can see above, inodes support double indirect pointers which means thatfor a disk with a block size of 4 KiB, the maximum capacity of a file is 4 GiB.The number of direct pointers is set to 12:\n  When starting the FS for the first time, it will create the root directory usingthe definition below:\n   The inode bitmap has 4 KiB meaning that each bitmap block will have a capacityfor 32768 inodes. Suppose we round up the size of an  Inode to 128 bytes; thecorresponding inode table will require 4 MiB of space. One of the ways forstructuring them would be to have many blocks dedicated to the bitmaps, then thecorresponding number blocks to store the inodes, and the remaining blocks foruser data.\n Instead of doing that, we can create  block groups that will always have oneblock for the data bitmap and one for the inode bitmap. The next 1024 blockscontain the inode table, and following that, 32768 blocks which are used foruser data.\n   Now that the “disk” is set up, we can start writing and reading files from it. Creating a new directory using  mkdir:\n  The process that occurs is the following: the system searches for the inode ofthe root directory, looks up in which data block the contents are being writtento, allocates a new inode and data block for the new directory, writes the entryto the root directory, and finally, writes the new directory to its data block.\n Writing a new file follows a similar method. The system traverses the given pathuntil the final directory is reached and adds an entry representing the newfile.\n The write function provides the path, buffer with the data, offset, and a fileinfo struct that may hold a file handle along with extra information about thefile:\n  In this case, instead of traversing the path again to find the inode, the systemuses the file handle (the FS previously sets it when creating the file). Withthe inode in hand, the FS can build the struct by seeking to the exact locationwhere the  Inode is written:\n fn  inode_offsets ( &amp; self ,  index :  u32 )  -&gt;  ( u64 ,  u64 )  {  let  inodes_per_group  =  self .superblock () .data_blocks_per_group  as  u64 ;  let  inode_bg  =  ( index  as  u64  -  1 )  /  inodes_per_group ;  let  bitmap_index  =  ( index  as  u64  -  1 )  &amp;  ( inodes_per_group  -  1 );  ( inode_bg ,  bitmap_index ) } fn  inode_seek_position ( &amp; self ,  index :  u32 )  -&gt;  u64  {  let  ( group_index ,  bitmap_index )  =  self .inode_offsets ( index );  let  block_size  =  self .superblock () .block_size ;  group_index  *  util :: block_group_size ( block_size )  +  2  *  block_size  as  u64  +  bitmap_index  *  INODE_SIZE  +  SUPERBLOCK_SIZE }\n Now that the FS has information about which data blocks are currently allocatedto the  Inode, it can use them to find the exact location where to write thedata, in a process similar as shown above. New blocks are first added to the Inode direct blocks array, and if the file size exceeds  (12 * BLOCK_SIZE),the FS allocates an  indirect_block that holds the numbers identifying otherblocks containing user data. And in the case the file is even bigger requiringmore blocks, the system adds an extra layer of indirection using the double_indirect_block field which points to more indirect blocks. Reading froma file follows the same method. You can see it running here:\n   The idea behind a file system is to define a structure for the contents on diskwhich then allow the system to operate on top of it when creating, writing andreading from files and directories.\n We learned some of the concepts used for the on-disk format, how directories andfiles are represented. One interesting aspect is the usage of indirect pointersto allow storing large files. If you are interested in learning more about filesystems, I would recommend reading more about other techniques that are usedsuch as journaling, copy-on-write, log-structured file systems, and also howmodern file systems apply these and other techniques. Maybe start learning aboutthe one you are using right now.\n   [1] Agrawal, N., Bolosky, W.J., Douceur, J.R. and Lorch, J.R., 2007.   A five-year study of file-system metadata. ACM Transactions on Storage (TOS), 3(3), pp.9-es.", "posttime": "2020-07-28 02:29:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,编写,file,文件", "title": "在Rust中从头开始编写文件系统", "title_en": "Writing a file system from scratch in Rust", "transed": 1, "url": "https://blog.carlosgaldino.com/writing-a-file-system-from-scratch-in-rust.html", "via": "", "real_tags": ["rust", "编写", "file", "文件"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014474, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "#噪音#污染是城市环境中的主要压力源之一，对人们的生活质量和健康产生负面影响。对于一些市民群体，如学童、患者和老年人，有必要支持他们在城市噪声污染地区寻找步行路线。在一篇新的论文中，我们将重点放在交通噪声的估计上，并提出了一种考虑道路估计噪声水平的提供安静路径服务的方法。\n通过结合来自OpenStreetMap(OSM)的自愿地理信息、官方社会经济数据和开放获取的GPS轨迹数据，我们开发了一组与交通相关的变量，并应用机器学习方法进行交通量估计。在给定估计的交通信息的情况下，然后利用现有的交通噪声模型来推导噪声污染区域。针对静态路由的生成，提出了一种新的路由算法。它在考虑路线距离限制的同时，将行人暴露在交通噪音污染中的程度降至最低。我们将我们的静默路由方法应用于德国海德堡。应用结果表明，该算法在生成符合行人偏好的安静路径方面是有效的。\n王振国，诺瓦克，严元元，齐普夫，“交通噪音污染环境下行人的安静路线规划”，收录于“IEEE智能交通系统学报”，DOI：10.1109/TITS.2020.3004660。\n在之前的工作中，我们已经研究了基于绿色、噪音和社交等几个因素生成定制的愉快步行路线，并将其添加到HeiGIT&amp；GIScience HD的Openrouteservices中：\nNovack，T.；Wang，Z.；Zipf，A.(2018)：基于OpenStreetMap数据生成定制欢快步行路线的系统。传感器2018，18,3794。\n此外，目前我们开始在德累斯顿和海德堡的meinGrün项目背景下测试相关方法。这建立在Zipf和Röther(2000)早期工作的基础上，但现在所需的数据源更加可用，因此可以使用开放数据将这些想法扩展到新的水平，从而可以使用真实世界的数据对方法进行微调和评估。\n发表在“自然神经科学”上的一项研究证实了绿地与城市福祉和心理健康的相关性。\nH.Tost，M.Reichert，U.Braun，I.Reinhard，R.Peters，S.Lautenbach，A.Hoell，E.Schwarz，U.Ebner-Priemer，A.Zipf，和A.Meyer-Lindenberg(2019年)：现实生活中城市绿地暴露的情感利益个体差异的神经关联。自然神经科学。Https://doi.org/10.1038/s41593-019-0451-y\n齐普夫，A.&Amp；Röther，S.(2000)：Tourenvorschläge für StadtTravel risten麻省理工学院DEM ArcView网络分析师。收信人：利比格，W.。(HRSG.)：ArcView Arbeitsbuch.。Hüthig Verlag.。海德堡。\n将OpenStreetMap用于大面积或特定场景(例如灾难管理、轮椅等)的专用路由和导航应用程序的其他早期示例。具体如下：\nNeis，P.&amp；Zipf，A(2008)：OpenRouteService.org是三次“开放”：结合了OpenSource、OpenLS和OpenStreetMap。英国地理信息系统研究(GISRUK 08)。曼彻斯特。\nSchmitz，S.，Neis，P.&amp；Zipf，A.(2008)：基于协作地理数据的新应用--路径选择案例。第二十八届印加国际合作测绘和空间技术大会，印度古吉拉特邦甘地纳加。\nRousell A.和Zipf A.(2017)：使用OSM数据实现基于地标的步行导航服务。“国际地理信息杂志”，ISPRS IJGI，6(3)：64。\nNeis，P.，Singler，P.&amp；Zipf，A.(2010)：灾难物流的协作制图和紧急路线--来自海地地震和联合国非洲之家门户网站的案例研究。收录于：Car，A.，Griesebner，G.&amp；Strobl，J.。(主编)：地理空间十字路口@GI_Forum‘10.萨尔茨堡地理信息学论坛论文集。\nZipf，A.，Mobasheri，A.，Rousell，A.，Hahmann，S.(2016)：针对个人需求的众包--行动不便的人的路线和导航案例。收录于：Capinei，C，Haklay，M，Huang，H，Antoniou，V，Kettunen，J，Ostermann，F and Purves，R.。“欧洲众包地理信息手册”，第325-337页。伦敦：无处不在的出版社。Doi：dx.doi.org/10.5334/bax.x。\nMIKSCH，J.，Hahmann，S.，Resch，B.，Lauer，J.，Zipf，A.(2017)：通过开放空间的路由-算法的性能比较。地球空间信息科学，2017年。泰勒和弗朗西斯。地球空间信息科学，2017年。泰勒和弗朗西斯。Https://doi.org/10.1080/10095020.2017.1399675", "note_en": "#Noise #pollution is one of the main stressors in urban environments, having negative impacts on people’s quality of life and health. For some groups of citizens, such as school children, patients, and elders, there is a need to support them in finding pedestrian routes in noise polluted areas of cities. In  a new paper,  we focus on the  estimation of traffic noise, and present an approach to  provide quiet routing services,  taking into account the estimated noise levels of roads.\n By combining Volunteered Geographic Information from OpenStreetMap (OSM), official socio-economic data, and open-access GPS trajectory data, we develop a set of traffic related variables, and apply machine learning methods to perform  traffic volume estimations. Given the estimated traffic information, an existing traffic noise model is then employed to derive the noise polluted areas. For generation of quiet routes, a new routing algorithm is proposed. It minimizes the exposure of pedestrians to traffic noise pollution while taking into account the route distance constraint. We apply our quiet routing approach to the city of Heidelberg (Germany). The application results demonstrate the efficacy of our algorithms in the generation of quiet routes customized to pedestrian preferences.\n Z. Wang, T. Novack, Y. Yan and A. Zipf, “ Quiet Route Planning for Pedestrians in Traffic Noise Polluted Environments,” in IEEE Transactions on Intelligent Transportation Systems, doi: 10.1109/TITS.2020.3004660.\n  In earlier work we looked already into generating customized pleasant pedestrian routes based on several factors like greenness, noise and sociability, and added this to  Openrouteservice by  HeiGIT &amp;  GIScience HD:\n Novack, T.; Wang, Z.; Zipf, A. (2018):  A System for Generating Customized Pleasant Pedestrian Routes Based on OpenStreetMap Data.  Sensors   2018 ,  18 , 3794.\n Also currently we started to  test related approaches in Dresden and Heidelberg in the context of the  meinGrün project. This builds upon early work by  Zipf and Röther (2000), But nowadays the needed data sources are much more available, so that it becomes possible to scale these ideas to new levels using open data which allow to finetune and evaluate the approach using real world data.\n The relevance of green spaces for wellbeing and mental health in cities has been proofed by a study published in  Nature Neuroscience\n H. Tost, M. Reichert, U. Braun, I. Reinhard, R. Peters, S. Lautenbach, A. Hoell, E. Schwarz, U. Ebner-Priemer, A. Zipf, and A. Meyer-Lindenberg (2019):  Neural correlates of individual differences in affective benefits of real-life urban green space exposure.  Nature Neuroscience. https://doi.org/10.1038/s41593-019-0451-y\n Zipf, A. &amp; Röther, S. (2000):  Tourenvorschläge für Stadttouristen mit dem ArcView Network Analyst.  In: Liebig, W. (Hrsg.): ArcView Arbeitsbuch. Hüthig Verlag. Heidelberg.\n Other early examples on using OpenStreetMap for specialized routing and navigation applications for large areas or specific scenarios (e.g. disaster management, wheelchairs etc.) are given below:\n Neis, P. &amp; Zipf, A (2008):  OpenRouteService.org is three times “Open”: Combining OpenSource, OpenLS and OpenStreetMap. GIS Research UK (GISRUK 08). Manchester.\n Schmitz, S., Neis, P. &amp; Zipf, A. (2008):  New Applications based on Collaborative Geodata – the Case of Routing.  XXVIII INCA International Congress on Collaborative Mapping and SpaceTechnology, Gandhinagar, Gujarat, India.\n Rousell A. and Zipf A. (2017):  Towards a landmark based pedestrian navigation service using OSM data.  International Journal of Geo-Information, ISPRS IJGI, 6(3): 64.\n Neis, P., Singler, P. &amp; Zipf, A. (2010):  Collaborative mapping and Emergency Routing for Disaster Logistics – Case studies from the Haiti earthquake and the UN portal for Afrika.  In: Car, A., Griesebner, G. &amp; Strobl, J. (Eds.): Geospatial Crossroads @ GI_Forum ‘10. Proceedings of the Geoinformatics Forum Salzburg.\n Zipf, A., Mobasheri, A., Rousell, A. ,Hahmann, S. (2016):  Crowdsourcing for individual needs - the case of routing and navigation for mobility-impaired persons  . In: Capineri, C, Haklay, M, Huang, H, Antoniou, V, Kettunen, J, Ostermann, F and Purves, R. (eds.) European Handbook of Crowdsourced Geographic Information, p. 325–337. London: Ubiquity Press. DOI: dx.doi.org/10.5334/bax.x\n Miksch, J., Hahmann, S., Resch, B., Lauer, J., Zipf, A. (2017):  Routing Through Open Spaces - A Performance Comparison Of Algorithms.  Geo-Spatial information Science, 2017. Taylor &amp; Francis. Geo-Spatial information Science, 2017. Taylor &amp; Francis. https://doi.org/10.1080/10095020.2017.1399675", "posttime": "2020-07-28 02:29:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "噪声污染,route,数据", "title": "交通噪声污染环境下行人的安静路径规划", "title_en": "Quiet route planning for pedestrians in traffic noise polluted environments", "transed": 1, "url": "http://k1z.blog.uni-heidelberg.de/2020/07/15/quiet-route-planning-for-pedestrians-in-traffic-noise-polluted-environments/", "via": "", "real_tags": ["噪声污染", "route", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014473, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "所以在垃圾场挖掘时，我无意中发现了一个看起来像是超级马里奥卡丁车代码中的软盘驱动程序。\n进一步调查发现，SNES的DOS版本看起来相当丰富，带有软盘控制器、并行和串行端口、键盘、读取DOS格式化软盘的代码：\n起初，我想我可能是弄糊涂了，看着一些开发PC的代码，但它的所有内容都有对PPU和SNES寄存器的引用。另外，Makefile的目标是SNES CPU，所以我几乎可以肯定这段代码注定要在SNES上运行。您可以看到在初始化期间有一条xce指令。这是为了将SNES 6502 CPU切换到本机模式，这进一步指向编写的代码将在SNES上运行，而不是在PC上运行。\n西田Y.Nishida编写的Super Famicom磁盘操作系统主程序[1991年8月21日]*。\n我不认为它是一个加载器/复印机单元(即软盘连接到SNES上以加载ROM)，因为你为什么要费心输入代码来读取键盘输入呢？另外，由于西田是Famicom磁盘系统的工程师之一，因此他在SNES计算机外围设备上工作也是顺理成章的。\n我现在最好的理论是，任天堂正在考虑将SNES作为一台完整的电脑供应，以绕过当时围绕游戏机的各种进口法律和税收。索尼在PS2上也做了类似的事情。\n编辑：对于感兴趣的人，请在转储中查找位于以下位置的sfxdos&#39；文件夹：\n它非常接近每个人都垂涎三尺的驴子，不确定为什么到目前为止还没有人发现它。\n这并不是一个延伸的想象力，认为这一单位将有3个芯片(PPI，FDC和SCC)插入扩展端口在底部的早期SNES。\n键盘应该是PC-98键盘，因为这是串行端口扫描键码的原因。这是有意义的，因为PC-98可能被用作开发机器。打印机代码似乎有点简单，它似乎没有任何输出代码，只是一些用来检测是否连接了打印机的代码。\n也许可以汇编它并使其运行，它似乎使用as65c&39；作为它的汇编器，但是试图让几十年前的汇编器编译和工作一点也不有趣。“。\n就开发时间表而言，大部分工作是在1991年7月至11月之间进行的，尽管似乎有人在1994年1月试图使用Ricoh SFX链接器V2.02&39；构建它。", "note_en": "So digging through the dump, I stumbled across what looked like a Floppy Disc driver in the Super Mario Kart code.\n Further investigation has revealed what looks to be a pretty fleshed out version of DOS for the SNES, with code for a floppy disc controller, parallel and serial ports, keyboard, reading DOS formatted floppy discs:\n    At first I thought maybe I was getting confused, looking at some code for a dev PC, but it&#39;s got references to PPUs and SNES registers all through it. Plus the makefile targets the SNES CPU, so I&#39;m almost certain that this code was destined to run on a SNES. You can see that there&#39;s a  xce instruction during the initialisation. This is there to switch the SNES 6502 CPU into &#39;native&#39; mode, which further points to it being code written to run on a SNES, rather than a PC.\n Super Famicom Disk Operation Sysytem main routine\tProgrammed by  Y.Nishida [ Aug.21, 1991 ]\t*\n I don&#39;t think it was a loader/copier unit (ie floppy hooked up to a SNES to load in ROMs), as why would you bother putting in code to read keyboard inputs? Also as Y. Nishida was one of the engineers involved in the  Famicom Disk System, it stands to reason that he&#39;d work on a SNES &#39;Computer&#39; peripheral.\n My best theory right now is that Nintendo was looking into supplying the SNES as a full &#39;computer&#39; to get around the various import laws and taxes around game consoles at that time. Sony did something similar with the  PS2\n EDIT: For those that are interested, have a look in the dump for a &#39;sfxdos&#39; folder in:\n  It&#39;s quite close to the &#39;donkey_test&#39; that everyone is drooling over, not sure why no one else hasn&#39;t spotted it so far.\n  It&#39;s not a stretch of the imagination to think that this unit would have have 3 chips (PPI, FDC and SCC) plugged into the  expansion port on the bottom of early SNESs.\n The keyboard would have been a  PC-98 keyboard, as that&#39;s what the serial port scans keycodes for. This makes sense as a PC-98 was probably used as the development machine. The printer code seems a bit barebones, it doesn&#39;t seem to have any output code, just some code to detect if a printer is connected.\n It  may be possible to assemble it and get it running, it seems to use  &#39;as65c&#39; as it&#39;s assembler, but trying to get decades old assemblers compiled and working is not fun at all.\n In terms of development timeframe, most of the work was carried out between July-November 1991, although it seems someone tried to build it using the &#39;RICOH SFX LINKER V2.02&#39; in January 1994.", "posttime": "2020-07-28 02:28:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "任天堂,turning,snes", "title": "在我看来，任天堂试图把SNES变成一台完全成熟的“计算机”", "title_en": "It looks to me that Nintendo tried turning the SNES into a full blown 'computer'", "transed": 1, "url": "https://www.reddit.com/r/retrogaming/comments/hxy4je/gigaleak_it_looks_to_me_that_nintendo_tried/", "via": "", "real_tags": ["任天堂", "turning", "snes"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1014472, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Emojicode使用大量优化将您的代码编译成本机代码，从而使您的代码变得更快。\nEmojicode附带了一套全面的默认软件包。而且你可以很容易地写出你自己的。\n我们相信表情符号具有表现力。让我们利用这一点让编程变得更有趣、更容易理解。\nEmojicode是一种简单易学的语言，无论您有什么背景。众所周知，我们的文档非常优秀，充满了演练指南和示例。\n你可以帮助Emojicode成长！开发工作在GitHub上进行，您可以随时光临。", "note_en": "Emojicode compiles to native machine code using lots of optimizations that make your code fast.\n Emojicode comes with a comprehensive set of default packages. And you can easily write your own.\n We believe that Emojis have expressive force. Let’s use that to make programming more fun and accessible.\n  Emojicode is a straightforward language to learn, whatever background you have. Our documentation is known to be excellent and stuffed with walk-through guides and examples.\n   You can help Emojicode grow! Development takes place on GitHub and you’re invited to drop in.", "posttime": "2020-07-28 02:28:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,表情符号,full,代码", "title": "Emojicode-由表情符号组成的成熟编程语言", "title_en": "Emojicode – full-blown programming language consisting of emojis", "transed": 1, "url": "https://www.emojicode.org/", "via": "", "real_tags": ["编程", "表情符号", "full", "代码"]}, {"category": "", "categoryclass": "", "imagename": "6a08907511601158aa7512d04aa45840.jpg", "infoid": 1014467, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作者：皮特·弗林特(@PeteFlint)。皮特是位于旧金山的种子期风险投资公司NFX的执行合伙人。\nTwitter和Slake是科技界谈论最多的两家公司。它们都是以超增长为标志的品类定义产品，每个产品都积累了大量非常忠诚的用户，估值超过200亿美元。\n但创建者很少接触到幕后做出的产品决策，或者指导他们的战略和框架。\n阿普丽尔·安德伍德在这两家公司都发挥了重要作用，先是担任Twitter的产品总监，然后是Slake的首席产品官。她是一位强大的产品领导者，在将B2C和B2B产品从0到1发展到无处不在以及在此过程中建立世界级的产品团队方面拥有非同寻常的深度经验。\n阿普丽尔和我一起做客本期NFX播客，提供一些内幕故事和从Twitter和Slake的领先产品中学到的经验教训。世界各地的创始人和产品负责人都将受益于她在Slake为招聘优秀PM而开发的三部分框架，她关于利用早期采用者的见解，以及产品首席执行官如何在不拖累他们的情况下与他们的产品团队保持密切联系。\n归根结底，伟大的产品是伟大的产品领导者的结果。正如我在Trulia的经历一样，阿普里尔给产品人员的最大建议就是证明，标志性的初创企业是人才x时机的结果：“如果你有机会从事一些处于技术创新、甚至商业创新和文化创新交汇处的事情，那就奔跑吧，不要走路。”(这句话的意思是：“如果你有机会从事某项处于技术创新、甚至商业创新和文化创新交汇处的事情，那就奔跑吧，不要走路。”\n你的商业模式定下了基调。对于我和其他在我们从Twitter过渡到Slake时加入我的人来说，最大的惊喜之一就是他们是如此的不同。系统性差异。显然，Slake是一家企业软件公司，你可以在其中收取合理的价格，而Twitter是一家靠广告支持的企业。因此，从根本上说，你对产品、业务、用户和客户的看法是非常、非常不同的。\n沟通是驱动因素。尽管沟通确实是这两种产品的核心，但它们的文化实际上截然不同。令人惊讶的是，沟通是如此基础，以至于它可以在商业、文化、产品体验等方面走很多不同的方向。\n您的办公室感觉像您的产品体验吗？当你在2010年走进Twitter办公室时，这可能在2020年仍然是真的，感觉就像是一个交易室大厅，因为它太吵了。这有点像这项服务本身--你会看到并听到员工们隔着地板互相交谈。现场笑声不断。每天都会有很多惊喜发生。服务上会发生一些事情，会让我们措手不及，并在某些方面分散我们的工作注意力。\n在松弛办公室里。当你走进Slake的时候，早在2015年我加入的时候，你都能听到大头针掉下来的声音。这是一款专为工作打造的产品。这是一种为完成任务而制造的产品。因此，当你走进松弛的办公室时，它渗透着一种文化，一种尽力而为、努力工作的理念。员工实际上是在使用他们正在建设的服务来完成任务。我们理解在Slake内部进行更多对话的价值，这样其他人就可以从来回交流中受益，因此接下来的10到100名员工实际上可以从这些对话的历史积压中受益。因此，整个地板上的喊叫声比我们在推特上看到的要少。\n当你看到这种情况发生时，不要走，而是跑去加入一家公司…。\n寻找时机+人才。我给产品人员的一个主要建议是，如果你有机会与一位有明确产品愿景的创始人合作，从事一项技术创新、甚至是商业创新、也是一项文化创新的工作，那么就跑吧，不要走路。我有过两次这样做的机会。当我在2010年加入Twitter时，当时还处于移动业务的早期。回顾一下，这是巴拉克·奥巴马的第一个任期，当时人们正在寻找在公共论坛上更自由地表达自己的方式。发生了一场文化转变，让人感觉这是一个如此独特的机会。\n当我加入Slake时，我也感受到了同样的机会。从技术的角度来看，我们的大多数客户过去常常说，在Slake之前，他们没有任何东西可用，这表明在Slake之前，他们的头脑中没有任何东西填补了这一空间。\n这在文化上与现在想要以完整的自我出现在工作中的员工配对。任何人都可以在您的松弛团队中创建一个频道，这意味着人们可以创建空间来谈论正交的甚至完全与工作无关的事情。但人们并没有分心-他们正在将他们的连接从物理水冷器转移到Slake内部的数字体验上。\n早期采用始于斯图尔特·巴特菲尔德(Stewart Butterfield)那样的清晰愿景。在某种程度上，我们把自己与工作场所已经出现的世俗趋势联系在一起。但这款产品从一开始就是为斯图尔特·巴特菲尔德(Stewart Butterfield)提出的愿景而设计的-也就是让Slake成为整个公司的中枢神经系统。我想说，他的愿景清晰，加上与市场需求中更广泛的文化转变相结合，才真正点燃了推动早期采用的火焰。\n在Twitter上，我们的早期采用者是有影响力的人和记者。对于Slake，是工程师和开发人员。\n关键是让你的早期采用者发挥你的长处，即使他们的用例最初看起来是独一无二的。在Slake，我们承受了一些仅供工程团队使用的热度。我终于意识到这是一个好处，因为我们在工程团队中很受欢迎，有几个结构上的原因。1)当工程团队说他们需要工具时，财务不会质疑他们，并为他们提供更多的访问权限和更大的工具预算。2)工程师通常是整个组织内技术选择的风向标。\n问问自己这个问题：“为什么这是我们的第一批观众，这太棒了？我们如何利用这一点来发挥我们的优势呢？“。我们认识到，实际上，为我们的第一批工程观众做好准备是我们传播到每一面墙的途径。\n我们没有忘记我们的原始用户去追逐下一批用户。\n在Twitter，我们与广播媒体建立了密切的联系，通过建立推特按钮和推广标签等方式，搭建了线上和线下沟通的桥梁，从而拥抱了记者和名人。这对Twitter上的出版商有帮助，但也提高了我们的知名度，增加了我们的受众。\n真正发射的定义。需要明确说明的是，产品不仅仅是代码。\n伟大的产品领导者推动着产品与市场的契合。这就是产品经理，当然还有产品负责人，必须继续磨练这一战略的地方，帮助客户理解您的愿景，您的发展方向，您与竞争对手的不同之处，并向有原则的立场倾斜。\n长弧差。我确实认为，从长远来看，客户会欣赏那些致力于以认真、诚实、纯粹的方式解决问题的团队和公司。\n产品负责人需要了解网络效应。产品团队经常考虑这一点。我们可能会称它为“无处不在”，而不是网络效应，但这是同一个概念。它是教人们如何很好地使用我们的产品的驱动力，然后他们会被驱使去教其他人使用产品，而且当更多的人在那里时，情况会变得更好。\n早期Twitter的网络效应：当我想到Twitter时，在每一家主要新闻出版物上都有一个推文按钮，并鼓励创建可能将人们带入Twitter的内容，这是一种增长战略，也是推动网络效应的一种方式。克洛伊·斯拉登(Chloe Sladden)和媒体团队说服广播公司在电视右下角放置标签，这样人们就可以参与到关于这种直播体验的在线对话中，这是一项非常成功的增长战略，克洛伊·斯拉登(Chloe Sladden)和媒体团队所做的工作是一项非常成功的增长战略。\n松弛早期的网络效应：我们的一些开发人员开始使用“使用松弛登录”，因为他们意识到，如果团队使用他们的松弛登录，不仅他们更容易启动和运行，因为我们处理了身份验证、配置文件和其他自注册步骤，而且这些人默认情况下会安装松弛应用程序。这是一个持续不断的通知渠道，实际上会交付更多参与度更高的团队，而这些团队更有可能是粘性的。\n产品团队现在也应该是增长团队。你不再需要一个增长团队来做所有这些事情，因为这些元素现在都是桌上的赌注；它们只是构建一种体验的一部分，这种体验很容易发现，很容易从许多不同的途径进入，很容易通过这项服务与其他人快速互动。\n寻找错位的观众。如果您对您的开发人员平台感到困惑，并且想着两个不同的想法，“我必须为我的开发人员服务，我需要为我的客户服务”，那么我会认为您已经犯了一个错误。\n当您为多个组成部分进行构建时，要有正确的心态。您正在寻求为您的客户提供服务，并且您正在寻求将在服务这些客户方面具有既得利益的开发人员也带到您身边。当您进行这种思想转变时，我认为这将引导您确保您正在为开发人员构建功能，使他们能够解决您从客户那里听到的问题。\n请小心确定开发用户的优先级。有了Twitter和Slake，我们在早期平台上犯了一个常见的错误，那就是认为API是一种产品。以这种方式思考的公司会公开他们的API并认为，“所有这些好事都会到来，开发人员很高兴，因为他们可以访问API。”但是，当开发人员意识到他们花费时间、精力和金钱做的一些事情实际上与您对平台发展方向的愿景不一致时，他们可能真的会不高兴。\n在Twitter，当我们创建“tweet”按钮时，我们对消费者体验将会是什么是固执己见的。我们考虑了出版商在推特按钮中真正要求的是什么，即流量。我们建立了功能，我们建立了相关的客户体验，以一种固执己见的方式解决了真正的客户问题。而且成功了。出版商看到他们的有机受众是通过使用这一功能建立起来的。这给他们带来了巨大的价值。\n如果我们只是发布了一个API并说，“嘿，如果你愿意，你可以做这14件事，这里有一个关于如何做到这一点的规范”，它永远不会始终如一地发生。而且，无论他们建造什么，都不会像我们的推特按钮那样得到使用。\n为产品体验设定清晰的愿景。因此，事后看来，很明显，我们正在进入一个时代，在这个时代，我们正在展示我们对平台的愿景，并为我们想要提供的体验设定目标。在我们的平台特性中反映了这一点之后，我们开始真正赋予平台一些它在仅仅是一个API时所缺乏的形状和用途。\n有意义的产品在马斯洛堆栈中排名较低。我经常画马斯洛的平台需求层次图。要获得真正有意义的平台机会，您需要做好一些在Maslow堆栈中相当低、很基本的事情。例如，知识的沟通和交流是知识型员工最基本的活动。这就是为什么我在2015年被Slake所吸引，在我开始运营所有Product之前，我是第一个领导平台的人。因为有机会解决这一基本需求。\n此外，我们不仅实现了来回交流，还聚合了知识集，并在此基础上构建搜索，从而为客户创造了更多价值。\n斯拉克的商业模式推动了这一决定。我们从来不需要采取(完全在平台上)的方法。原因是，我承认这是一个香槟问题，人们已经把所有的时间都花在了斯拉克。因此，与基于广告的平台不同，我们并没有试图强迫他们在Slake上花费更多时间。我们的商业模式是，如果你花8小时在Slake而不是7小时，我们赚不到更多的钱。所以我们建立了这个平台，允许紧急和实时的信息进入Slake，并让用户在非常短的时间内提供基本的响应。比如共享Google Drive文件，而无需返回Google Drive设置权限。\n但当用户需要做一些更复杂的事情时-比如你要去设计线框-我们认为他们应该去找最适合做这件事的地方，那就是他们的设计工具。\n关键洞察力-移交是我们启用的通信的一部分。我们希望帮助将您路由到那里并实现这些移交，因为人与人之间的移交归根结底是通信，最适合在已经可以找到人的地方进行：在斯拉克。\n为什么B2B的门槛需要更高。当我们构建Slake的时候，当然，应用程序应该是直观的，并且像你拥有的消费者消息传递体验一样容易使用，这是很有意义的。事实上，它甚至可能比消费者应用程序更好，因为你更有可能以数字方式与同事交谈，而不是与生活中的其他任何人交谈。所以产品应该只是歌唱。这应该是毫不费力的。在Slake，我们希望尽可能打造非常、非常好的体验。我们认为：这太重要了，不能搞错。没有把这件事做好是不礼貌的。\n这对创建者来说是一个巨大的机会。现在，一切都变得数字化和远程，每个人都在家里工作，企业的消费化才刚刚开始。\n关键策略-让每个人在旅途中团结在一起。当我成为Slake的产品副总裁时，我召集了CTO、工程副总裁和设计负责人，开始像一个团队一样运作，这样我们就可以确保我们的愿景和团队之间的角色定义是一致的。\n注意你的节奏。它真的释放了我们可以一起完成事情的节奏。我们可以建立我们的团队，我们可以让他们负起责任。我们可以审查产品，建立路线图流程，然后让引擎运转起来。\n避免在真空中领导产品。作为产品负责人，我本可以在真空中完成所有这些工作，但相反，通过团队合作，我们都感到拥有主导权。我们还可以互相支持，因为你不可能一直让每个领导人都在房间里。\n把创始人带到发生这种事情的房间里--持续很长一段时间。我们也把斯图尔特(巴特菲尔德)带到了这个过程中。至少有四个季度，我们让斯图尔特在房间里处理所有这些过程。这是一个让团队直接从他那里听到反馈的机会，也是一个让他观察团队进展的机会，同时也是一个了解组织如何发展的机会，并向我以及我的工程和设计同行提供反馈。\n不这样做=故障模式。这段校准期是数百小时，但我认为这是绝对关键的。很多产品负责人都来了，他们想让CEO/创始人尽快离开办公室。我认为这是一种失败模式。\n您是否是Enabler…。还是拦截者？早期创业公司的创始人问我很多问题：我应该什么时候雇佣我的第一个PM？如果你一直是工程和设计团队的拦路虎，阻碍他们取得进展，那么你需要雇佣一名PM。\n这是一种显而易见但很少实践的技巧。特别是作为一名创始人，问问你的团队吧！如果你对你的团队进行民意调查，你经常发现人们在等待你的答案，那么你真的别无选择。\n别等太久了。创始人往往会等太久才意识到这一点。因此，他们可能会损失团队的一些生产力，因为创始人必须达到无法快速响应的地步。\n你的工作就是不断地从各个方面激发你自己。需要明确的是，创始人尽可能长时间地与产品和团队保持密切联系是非常有价值的。但在任何处于成长期的公司--无论你是处于零到一阶段，还是之后阶段--你都必须考虑如何从工作的各个方面解雇自己。\n这里没有“总理”金矿。首先，没有人生来就是产品经理。这是在工作中学到的一项技能。归根结底，每个人都是从其他地方来生产产品的。也许他们一开始是工程师，然后进入了这个行业，或者他们在业务方面表现出了对客户的足够理解，于是他们跳跃到了产品领域。也许他们是创始人，并决定产品是他们想要保留的东西。所以没有一个明显的地方可以寻找它们。为了帮助做到这一点，在我在Slake组建产品团队期间，我制定了三个招聘PM的策略。\n这种结构迫使我选择这三个轴中的哪一个对每个员工来说都是最重要的。然后我用这一点来指导我的招聘，寻找与这份个人资料相匹配的候选人。对我来说，聘请一位总理总是一个定制的过程。\n我们在这里谈论的是什么口味的PM？如果你去一家公司，也许每个PM都有CS学位，然后在另一家公司，PM被期望拥有MBA学位，更多的是成为一名商业领袖。要求可以完全不同，所以您不能只看纸，然后假设所有PM都是相同的。在进入产品之前，你需要了解它们的血统，了解它们的功能背景。\n你经常可以找到一些人，他实际上可以帮助填补团队中的一些漏洞。例如，如果您正在招聘一名产品负责人，但您的工程经理可能在扩展方面遇到了一些挑战，那么您可能会聘请一名更具技术性的产品人员，因为他们或许可以帮助填补这一空缺。\n也许你没有任何人负责市场营销，所以实际上你需要一个产品负责人，他可以承担这一点，并保持一小段时间，直到你达到聘请专门负责市场营销的人的规模。\n从一个案例到另一个案例，你将寻找来自完全不同公司和文化的项目经理。\n有时候这很重要。例如，在Slake，当我为企业组织招聘产品负责人时，我绝对是在寻找构建和销售企业软件的人。因此，我聘请了伊兰·弗兰克，他至今仍是Slake企业团队的产品副总裁。他是团队中的一位奇妙的新成员，因为他向我们产品组织中的所有人展示了作为大客户的产品负责人是什么样子。他向我们展示了你如何只需为他们现身，向他们推销，面对他们的反对，以及对观众和他们的需求有深刻的理解。\n有时候，主题专业知识并不重要--特别是在较初级的角色中，你可以雇佣可以解决任何问题的多面手PM，他们渴望了解新的问题和新的受众。\n有在20个人的公司工作过的人。有在2000人公司工作过的人。有一小部分人非常幸运地在一家公司工作，该公司在20-2000年间沿着这条轨迹发展。\n寻找有成长阶段经验的人比主题文件更重要。\n.", "note_en": "by Pete Flint ( @PeteFlint). Pete is a Managing Partner at NFX, a seed-stage venture firm based in San Francisco.\n  Twitter and Slack are two of technology’s most talked-about companies. They are both category-defining products marked by hypergrowth, each amassing a large base of deeply loyal users and a valuation of more than $20B.\n But Founders rarely get access to the product decisions being made behind the scenes, or the strategy and frameworks that guided them.\n April Underwood was instrumental at both companies, first as Director of Product at Twitter and then as Chief Product Officer at Slack. She is a powerhouse product leader with an unusual depth of experience in growing both B2C and B2B products from 0 to 1 to ubiquity and building world-class product teams along the way.\n April joins me on  this episode of the NFX podcast to offer inside stories and lessons learned from leading product at Twitter and Slack. Founders and product leaders everywhere will benefit from the 3-part framework she developed at Slack for hiring great PMs, her insights about leveraging early adopters, and how product CEOs can stay close to their product teams without slowing them down.\n Ultimately, great products are the result of great product leaders. And just as I experienced with  Trulia, April’s biggest advice to product people is a testament that iconic startups are the result of talent x  timing: “If you have the opportunity to work on something that sits at the intersection of a technological or even a business innovation, and also a cultural one, then run, don’t walk.”\n     Your business model sets the tone. One of the biggest surprises for me and for others who joined me as we transitioned from Twitter over to Slack was just how different they were. Systemic differences. Obviously Slack is an enterprise software company where you can charge a fair price for it, whereas Twitter is an advertising-supported business. So fundamentally the way you think about the product, the business, your users and your customer is very, very different.\n Communication is the driver. Even though communication is really at the core of both of those products, their cultures were actually quite different. It’s amazing how communication is so fundamental that it can go in a lot of different directions in terms of business, culture, product experience, and more.\n Does your office feel like your product experience? When you would walk into the Twitter office in 2010, and it is probably still true in 2020, it felt like a trading room floor because it was so loud. It was kind of like the service itself — you’d see and hear employees talking to each other across the floor. There was a lot of laughter. There were a lot of surprises that would happen every day. Things would happen on the service that would catch us off guard and distract us in some ways from our work.\n Inside the Slack office. When you walked into Slack, back in 2015 when I joined, you could’ve heard a pin drop. It’s a product that’s built for work. It’s a product built for getting things done. And so when you walk into the Slack office, that permeates the culture, this concept of doing your best work and working hard. Employees were literally using the service they were building to get things done. We understood the value of having more of our conversation happen inside Slack so that other people could benefit from the back and forth, and so the next 10 or 100 employees could actually benefit from the historical backlog of those conversations. So there was less of the shouting across the floor than we saw at Twitter.\n  Run, Don’t Walk, To Join A Company When You See This Happening…\n Look for Timing + Talent. One of my main pieces of advice for product folks is that if you have the opportunity to work on something that sits at the intersection of a technological or even a business innovation, and also a cultural one, with a Founder that has clear product vision, then  run, don’t walk. I’ve had the opportunity to do that twice.  When I joined Twitter in 2010, it was still the early days for mobile. To rewind, this was Barack Obama’s first term in office, this was a time when people were searching for ways to express themselves more freely in a public forum. There was a cultural shift happening that really made it feel like such a unique opportunity.\n I felt the same opportunity when I joined Slack. From a technology point of view, most of our customers used to say they didn’t have anything to use before Slack, which suggests that there was just nothing that filled that space in their mind prior to Slack.\n This paired up culturally with employees who now wanted to show up to work as their full selves. The ability for anyone to create a channel inside your Slack team meant that people created spaces to talk about things that were orthogonal or even completely unrelated to the work. But people weren’t getting distracted — they were moving their connection from the physical water cooler into that digital experience inside Slack.\n Early adoption begins with a clear vision like Stewart Butterfield had. To some degree, we tied ourselves to the secular trend that was already happening in the workplace. But the product was designed from the very outset for the vision that  Stewart Butterfield laid out — which was for Slack to be  the central nervous system for your entire company. I would say that the clarity of his vision combined with connecting to that broader cultural shift in market need was what really lit the fire that drove that adoption early on.\n         With Twitter, our early adopters were influencers and journalists. With Slack, it was engineers and developers.\n The key is leveraging your early adopters toward your strengths, even if their use case first appears unique. At Slack, we were taking some heat that we were mostly used just by engineering teams. It finally dawned on me that this was a benefit, that we were popular among engineering teams for a few structural reasons. 1) Finance doesn’t question the engineering team when they say they need a tool and gives them more access and bigger budgets for tools. 2) Engineers are often the tastemakers for technology selections within the entire organization.\n Ask yourself this question: “Why is it  fantastic that this is the first audience that we have? How do we leverage that to play to our strengths?” We recognized that actually getting it right for our first engineering audience was  the avenue for us to spread wall to wall.\n We didn’t forget our original users to go chasing the next set of users.\n At Twitter, we embraced journalists and celebrities by creating close ties with broadcast media to bridge online and offline communication by, for example, building a Tweet button and by promoting hashtags. This helped publishers on Twitter but it also drove our awareness and increased our audience.\n   The definition of a true launch. It needs to be stated explicitly that a product is not just the code.\n  Great product leaders drive toward product-market fit. This is where the role of the Product Manager, and certainly the product leader, has to continue to hone that strategy, to help customers understand your vision, where you’re going, what makes you different from a competitor, and to lean into principled stances.\n The long arc difference. I do think that customers over the longer arc have an appreciation for teams and companies that are dedicated to solving their problems in an earnest, honest, pure way.\n   Product leaders need to understand network effects. Product teams think about this constantly. We might have called it “ubiquity” instead of network effects, but it’s the same concept. It’s the driver to teach people how to use our product so well that they’re then driven to teach other people to use the product and it gets better when more people are there.\n Network effects in the early Twitter days: When I think about Twitter, getting a tweet button on every major news publication and encouraging creation of the content that might bring people into Twitter was a growth strategy and a way to drive network effects. The work that  Chloe Sladden and the media team did to convince the broadcasters to put hashtags in the bottom right-hand corner of television so that people would have a way to participate in an online conversation about this on-air experience was a massively successful growth strategy.\n Network effects in the early Slack days: Some of our developers started to use “Login with Slack” because they realized that if teams used their Slack logins, not only was it easier for them to get up and running because we took care of auth and profile and other onboarding steps but also that those people would by default have the Slack app installed. This was a constant avenue for notifications that would actually deliver more engaged teams that would be more likely to be sticky.\n Product teams should now be the growth team too. It’s no longer the case that you need to have a growth team that does all of this stuff because these elements are now table stakes; they are just part of building an experience that is easy to discover, easy to enter from lots of different avenues and easy to quickly engage with other people through that service.\n         Look for misaligned audiences. If you get confused about your developer platform and think two separate thoughts, “I’ve got to serve my developers and I need to serve my customers,” then I would argue that you’ve already made a misstep.\n The right frame of mind when you’re building for multiple constituents. You’re seeking to serve your customers and you’re seeking to bring developers along with you who have a vested interest in serving those customers as well. When you make that mental shift, then I think that that leads you to ensure that you’re building capabilities for your developers that allow them to solve the problems that you’re hearing about from your customers.\n Be careful prioritizing dev users. With both Twitter and Slack, we fell for a common misstep for early platforms, which is to think that the API is a product. Companies who think this way expose their API and think, “All this good is going to come and the developers are happy because they have access to APIs.” But developers might be really unhappy down the road when they realize that some of the things they have spent their time and energy and money doing are not actually in line with your vision for where your platform is going.\n At Twitter, when we built the “tweet” button, we were opinionated about what that consumer experience was going to be. We considered what publishers were really asking for in a tweet button — namely, traffic. We built the feature, we built a customer experience that was relatable, that solved a real customer problem in an opinionated way. And it worked. Publishers saw their organic audience build through the use of that feature. It gave them a ton of value.\n If we had just published an API and said, “Hey, you could do these 14 things if you want, and here’s a spec for how you would do that,” it never would have happened consistently. And whatever they built wouldn’t have gotten the usage they got with our tweet button.\n Set a clear vision for the product experience. So in hindsight, it was clear we were moving into an era where we were demonstrating our vision for the platform and setting goals for the experience we wanted to deliver. Having that reflected in our platform features started to really give the platform some shape and purpose that it lacked when it was just an API.\n     Meaningful products are low on the Maslow stack. I often draw a Maslow’s Hierarchy of Needs for platforms. To have a really meaningful platform opportunity you need to be doing something well that’s pretty low, fundamental on the Maslow stack. For example, communication and exchange of knowledge is the most fundamental activity for knowledge workers, period. That’s why I was drawn to Slack in 2015, to first lead platform before I stepped up to run all of Product. Because of the opportunity in solving that fundamental need.\n Also, we were not just enabling back and forth communication, but also aggregating that knowledge set and building search on top of it and creating more value for the customer out of it.\n   Slack’s business model drove this decision. We never needed to take (a fully on-platform) approach. The reason was, and I admit it’s a champagne problem, people were already spending all of their time in Slack. So, unlike ad-based platforms, we weren’t trying to coerce them to spend more time in Slack. Our business model was such that we didn’t make more money if you spent eight hours in Slack versus seven hours in Slack. So we built this platform that allowed urgent and real-time information to come into Slack and for users to provide basic responses in a very short amount of time. Like sharing a Google Drive file without having to go back to Google Drive to set permissions.\n But the minute a user needed to do something more sophisticated — like if you’re going to go design a wireframe — we thought they should go to the best place for that, which was their design tool.\n Key insight — the handoffs were part of the communication we enabled. We wanted to help route you there and enable those handoffs because those handoffs between people are ultimately communication and are best-suited to take place where people could already be found: in Slack.\n   Why the bar for B2B needs to be higher. When we were building Slack it just made sense that, of course, the app should be intuitive and just as easy to use as the consumer messaging experiences you have. In fact, it should probably be even better than consumer apps, because you are more likely to talk to your colleagues in a digital fashion more than you talk to anybody else in your life. So the product should just sing. It should be effortless. At Slack, we wanted to build the very, very best experience that we possibly could. We thought: This is too important to get wrong. It is rude not to get this right.\n A huge opportunity for Founders. Now that everything is going digital and more remote and everyone is working at home, the consumerization of enterprise is only just getting started.\n   Critical Tactic — bring everyone together on the journey. When I became VP of Product at Slack, I pulled together the CTO, the VP of Engineering, the Head of Design, to start functioning as a team so that we could ensure we were consistent in our vision and the role definition between our teams.\n Mind your rhythms. It really unlocked this rhythm where we could get things done together. We could build our teams, we could hold them accountable. We could review products and establish a roadmapping process and just get the engine going.\n Avoid product leadership in a vacuum. I could have gone and done all this in a vacuum as the product leader but instead, by working as a team, we all felt ownership of it. And we could also back each other up because you can’t have every leader in the room all the time.\n Bring the Founder into the room where it happens — for a long time. We also brought Stewart [Butterfield] along for that process. For at least four quarters we had Stewart in the room for all of those processes. That was an opportunity for the team to hear feedback directly from him and was an opportunity for him to observe the team’s progress, as well as just get a read on how the organization was shaping up and give feedback to me and to my engineering and design peers as well.\n Not doing this = failure mode. This calibration period was hundreds of hours but I think it was absolutely critical. A lot of product leaders come in and they want to get the CEO / Founder out of the room as quickly as possible. I think that’s a failure mode.\n   Are you an enabler… or a blocker? Founders of early startups ask me a lot: When should I hire my first PM? If you are consistently the blocker for your engineering and design team and preventing them from making progress, then you need to hire a PM.\n An obvious yet rarely-practiced technique. Especially as a Founder, ask your team! if you poll your team and you regularly find that people are waiting for answers from you, then you really have no choice.\n Don’t wait too long. Founders tend to wait too long before realizing this. So they may lose some amount of productivity for their team because the Founder must get to a point where they’re just not able to respond quickly.\n Your job is to keep firing yourself from various aspects. To be clear, there’s a lot of value in a Founder being very close to the product and close to the team for as long as possible. But in any growth-stage company — whether you’re in the zero to one phase or later — you always have to be thinking about how you’re firing yourself from various aspects of your job.\n   There is no “PM” gold mine. First,  nobody is born a product manager. It is a skill learned on the job. Ultimately everybody comes to product from somewhere else. Maybe they started as an engineer and moved into it, or maybe they were on the business side and showed enough understanding of the customer that they made the leap over into product. Maybe they were the Founder and decided that product was the thing they wanted to keep. So there’s not an obvious place to look for them. To help with this, during my time at Slack as I built out the product team, I developed three axes for hiring PMs.\n This structure forces me to pick which one of these 3 axes is most important for each hire. And then I use that to guide my sourcing and look for candidates that match that profile.  It’s always a bespoke process for me to hire a PM.\n   What  flavor of PM are we talking about here? If you go to one company, maybe every PM has a CS degree, and then at another company, the PM is expected to have an MBA and be more of a business leader. The requirements can be completely different, so you can’t just look at paper and assume all PMs are the same. You need to know their lineage, know what functional background they come from before entering product.\n You can oftentimes find somebody who can actually help round out some holes within the team. For example, if you’re hiring a product leader, but your engineering manager maybe is having some challenges scaling, you might hire a more technical product person because maybe they can help fill that gap.\n Maybe you don’t have anybody running marketing, and so actually you want a product leader who can just take that on and run with the ball for a little bit until you reach a scale where you hire somebody specific for marketing.\n From case to case you’ll be looking for PMs from fairly different companies and cultures.\n  Sometimes it matters a lot. For example, at Slack, when I was hiring a product leader for the enterprise organization, I absolutely was looking for somebody who had built and sold enterprise software. So I hired Ilan Frank, who continues to this day to be the VP Product for the Enterprise Team at Slack. He was a fantastic addition to the team because he showed all of us in the product organization what it looked like to be a product leader for large customers. He showed us how you need to just show up for them and pitch to them and face objections from them, as well as have a deep understanding of the audience and their needs.\n Sometimes subject matter expertise doesn’t matter — especially in more junior roles, where you can just hire generalist PMs that can work on anything and they’re hungry to learn new problems and new audiences.\n  There are people who have worked in 20 person companies. There are people that have worked in 2,000 person companies. There’s a very small group of people who have been lucky enough to work at a company that grows along that trajectory from 20 to 2000.\n Finding somebody with growth stage experience is more important than the subject matter fil\n......", "posttime": "2020-07-28 02:19:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思维,slake,thinking,产品", "title": "与阿普丽尔·安德伍德一起打造Slake和Twitter的产品思维", "title_en": "The Product Thinking That Built Slack and Twitter, with April Underwood", "transed": 1, "url": "https://www.nfx.com/post/product-thinking-slack-twitter-april-underwood/", "via": "", "real_tags": ["思维", "slake", "thinking", "产品"]}, {"category": "", "categoryclass": "", "imagename": "1c37d8d82ec3404ed57160a373508b79.jpg", "infoid": 1014466, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据“华尔街日报”报道，谷歌将让几乎所有员工--大约20万名员工和承包商--再在家工作一年。据报道，谷歌首席执行官桑达尔·皮查伊上周做出了这一决定。\n漫长的时间表为谷歌员工提供了更多的确定性，他们正在为下一学年的学校和住房做出决定。此前，谷歌的员工应该在1月份回到办公室。\n随着冠状病毒大流行的严重性变得更加明显，整个硅谷-以及整个美国经济-的公司一直在延长办公室的关闭时间。\n今年5月，Facebook宣布正在进行永久性转变，允许更多员工在家工作。所有Facebook员工都被鼓励在家中工作到今年年底。\n亚马逊计划在10月份之前重新开放办公室。Twitter在5月份表示，员工可以无限期在家工作。它的办公室将至少关闭到9月。微软允许员工在家工作，至少持续到10月份。\n虽然在家工作对于许多美国工人来说是一个新的选择，但Ars Technica几十年来一直是一个在家工作的组织。我们的作家和编辑在3月份的一篇文章中提供了一些远程工作的小贴士。\n对他们来说很好。我的组织以反对远程工作而臭名昭著，在3月初几乎完全采用了它，此后一直在一次延长两周。上周，它宣布我们将正式远程办公到2020年底。这完全是自愿的--上次我听说办公室每天都有大约10%的人坐满--但它的工作方式比管理层预想的要好得多。我希望你很快就能看到更多这样的东西。从某种程度上说，安顿下来做长远打算，并把这一点放在心上来计划事情会更容易一些。\n没错，但老实说，我认为我们还会看到越来越多的企业允许越来越多的员工永久在家工作，以及大量关闭办公场所。我认识两个人(不同的公司)，他们被告知要到明年才能回来，他们工作过的办公室(自从租约到期后)即将关闭，因此他们甚至不知道自己会回到哪个办公室。公司一直非常反对远程办公，这场流行病迫使公司尝试一下，节省的成本让计价员垂涎三尺。坦率地说，这对每个人都有好处，对地球也是如此。更少的通勤，更少的开车压力，更少的汽油，等等。", "note_en": "Google will keep &#34;nearly all&#34; of its workforce—around 200,000 employees and contractors—working from home for another year, The Wall Street Journal has  reported. Google CEO Sundar Pichai reportedly made the decision last week.\n The long timeline gives more certainty for Googlers who are making school and housing decisions for the coming academic year. Previously Google workers were due back in the office in January.\n Companies across Silicon Valley—and across the broader US economy—have been keeping their offices closed longer as the severity of the coronavirus pandemic becomes more clear.\n In May, Facebook  announced that it was making a permanent shift toward allowing more employees to work from home. All Facebook workers are encouraged to work from home through the end of the year.\n Amazon isn&#39;t scheduled to re-open its offices before October. Twitter  said in May that employees could work from home indefinitely. Its offices will be closed through at least September. Microsoft is allowing employees to work from home  until at least October.\n While working from home is a new option for a lot of American workers, Ars Technica has been a work-from-home organization for decades. Our writers and editors offered some remote working tips in a  March article.\n  Good for them.  My organization, notorious for its opposition to telework, adopted it pretty much wholesale in early March, and has been extending it two weeks at a time since. Last week, it announced that we will be officially teleworking through the end of 2020. It&#39;s all voluntary - last I heard the offices were roughly 10% full on any given day - but it&#39;s working way better than management ever thought it would.  I expect you&#39;ll see a lot more of this pretty quickly. It&#39;s easier, in some ways, to just settle in for the long haul and plan things with that in mind.\n  True, but honestly, I think what we&#39;ll also see alot of is businesses allowing more and more employees to work from home permanently, and the closing of office space in bulk.  I know two people (different companies)who have been told not to come back until next year, and that the office they worked in is being physically closed (since the lease came up), so they don&#39;t even know which office they&#39;d go back to.  Companies have been SO against telecommuting, this pandemic forced companies to give it a try, and the bean counters are drooling at the cost savings. Frankly, that&#39;s good for everyone, and the planet. Much less commuting, much less stress trying to drive in, less gas, etc.", "posttime": "2020-07-28 01:08:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,明年,home", "title": "谷歌将把20万名员工留在家里直到明年夏天", "title_en": "Google will keep 200,000 workers home through next summer", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/07/google-will-keep-200000-workers-home-through-next-summer/", "via": "", "real_tags": ["google", "谷歌", "明年", "home"]}, {"category": "", "categoryclass": "", "imagename": "e306d0d4b5502e34e4dd43d93da7faae.jpg", "infoid": 1014464, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于大流行，加速器已经将运营转移到完全偏远的地方，以遵守社会距离。这种转变迫使500 Startups、Y Combinator和Techstar等知名项目完全上线，同时鼓励现有的风险投资公司推出新的纯数字奖学金，如Cleo Capital和NextView Ventures。\n在大流行之前，加速器可以通过出借曾经被Airbnb、Twilio和Brex的联合创始人使用的办公桌空间，加上耀眼的演示日来宣传自己的价值。现在，剔除了面对面的元素，加速器计划的实际价值-以及他们提供的网络-正在以新的方式接受测试。\n因此，对于参与其中的创始人来说，还有一个问题：他们是否获得了他们认为自己签约的好处？\n迈克尔·维加-桑兹最不想做的事就是参加另一个创业者的Zoom聚会。但他与双胞胎兄弟马修共同创立的汽车共享公司正在转型，因此他们加入了NextView Ventures的首个远程加速器项目。\n维加-桑兹说：“我设想了一种加速器，它有令人尴尬的快乐时间，还有大规模的变焦通话。”快进项目一个月后，他说“完全相反”。\n在加入NextView的加速器之前，Vega-Sanz在波士顿巴布森学院(Babson College)做了一个面对面的孵化器，但他告诉TechCrunch，虚拟“不会有太多的麻烦”。\n他说：“(面对面的)现实是你会去吃午饭，当你开车去那里，边说边聊，闲聊，并真正进入活动的实质时，已经损失了很多时间，”他说，“当你开车去那里的时候，你所有的边聊边聊，实际上进入了事件的实质，这造成了大量的时间损失。”“在那段时间里，你可能一直在为你的公司工作。”\n如果可能，Vega-Sanz仍然建议第一次创业的人参加物理加速器，而不是虚拟加速器，因为它带来了能量，即使有无用活动的负面影响。", "note_en": "As a result of the pandemic, accelerators have moved operations fully remote to abide by social distancing. The shift has forced well-known programs like  500 Startups,  Y Combinator and  Techstars to go fully online, while encouraging existing venture capital firms to launch new digital-only fellowships like  Cleo Capital and  NextView Ventures.\n Before the pandemic, accelerators could advertise  their value by lending desk space once used by  Airbnb,  Twilio and  Brex’s co-founders, plus a glitzy demo day. Now, stripped of their in-person element, the actual value of an accelerator program — and the network they provide — is being tested in new ways.\n So a question remains for participating founders: Are they getting the benefits of what they thought they signed up for?\n  The last thing  Michael Vega-Sanz wanted to do was was join another Zoom get-together for entrepreneurs. But the  car-sharing company he co-founded with twin brother  Matthew was in the middle of a pivot, so they joined NextView Ventures’  inaugural remote accelerator program.\n “I envisioned an accelerator with awkward happy hours, mass Zoom calls,” Vega-Sanz said. Fast-forward one month into the program, he says it “has been quite the opposite.”\n Before joining NextView’s accelerator, Vega-Sanz did an in-person incubator at Babson College in Boston, but there’s “a lot less fluff” in being virtual, he told TechCrunch.\n “[With in-person] the reality was you’d go to lunch, and by the time you drove over there and had all your side talk, small talk, chit-chat and actually got into the nitty-gritty of the event, there was a lot of time loss,” he said. “You could have been working for your company during that time.”\n If possible, Vega-Sanz still recommends that first-time founders attend a physical accelerator instead of a virtual one for the energy it brings, even with the downside of useless events.", "posttime": "2020-07-28 01:07:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "办公桌,demo,加速器", "title": "\n没有办公桌和演示日，加速器值得吗？", "title_en": "\n\t\t\t\tWithout desks and a demo day, are accelerators worth it?\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/without-desks-and-a-demo-day-are-accelerators-worth-it/", "via": "", "real_tags": ["办公桌", "demo", "加速器"]}, {"category": "", "categoryclass": "", "imagename": "0fa7c9c2c96b311b571069c8de508f9e.jpg", "infoid": 1014463, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周一的一份简短声明中，该公司表示，它在7月23日受到了一次网络攻击，“对我们的一些系统进行了加密”。\n声明写道：“因此，我们的许多在线服务中断，包括网站功能、客户支持、面向客户的应用程序和公司通信。”“我们立即开始评估攻击的性质，并开始补救。”\nGarmin表示，它“没有迹象表明”客户数据被访问、丢失或被盗。该公司表示，其服务正在恢复。\n这家科技制造商此前将这起事件归因于“停电”。但知情人士告诉TechCrunch，停电是由文件加密恶意软件造成的。\nTechCrunch之前援引一位直接了解该事件的消息人士的话称，此次攻击是由WastedLocker勒索软件造成的。据了解，WastedLocker被一家名为Evil Corp.的俄罗斯黑客组织使用，该组织去年受到美国财政部的制裁。\n通过实施制裁，财政部实际上将使任何美国公司支付赎金以取回文件都是非法的。\n停电期间，Garmin的股价从每股102美元跌至94美元。截至周一下午的交易，Garmin股价上涨3%，至每股100美元。", "note_en": "In a brief statement on Monday, the company said it was hit by a cyberattack on July 23 that “encrypted some of our systems.”\n “As a result, many of our online services were interrupted including website functions, customer support, customer facing applications, and company communications,” the statement read. “We immediately began to assess the nature of the attack and started remediation.”\n Garmin said it had “no indication” that customer data was accessed, lost, or stolen. The company said  its services are being restored.\n The tech maker previously attributed the incident to an “outage.” But sources familiar with the incident told TechCrunch that the outage was caused by file-encrypting malware.\n TechCrunch previously reported that the attack was  caused by the WastedLocker ransomware, citing a source with direct knowledge of the incident. WastedLocker is known to be used by a Russian hacking group, known as Evil Corp., which was sanctioned by the U.S. Treasury last year.\n By imposing sanctions, the Treasury would have effectively made it illegal for any U.S. company to pay a ransom to get their files back.\n During the outage, Garmin’s stock price fell from $102 to $94 per share. By afternoon trading on Monday, Garmin was up 3% to $100 per share.", "posttime": "2020-07-28 01:07:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "软件,攻击,confirms,客户", "title": "\nGarmin证实勒索软件攻击导致服务中断", "title_en": "\n\t\t\t\tGarmin confirms ransomware attack took down services\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/garmin-confirms-ransomware-attack-outage/", "via": "", "real_tags": ["软件", "攻击", "confirms", "客户"]}, {"category": "", "categoryclass": "", "imagename": "a18c1fbd36da8a675b7239b41c4404d5.jpg", "infoid": 1014462, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "大家好，欢迎回到TechCrunch专注于风险投资的播客The Equity，在这里我们解开标题背后的数字。\n早间节目播出后，Equity摄制组无法闭嘴Qualtrics与SAP的交易，所以我们别无选择，只能跳回录制模式，即兴拍摄Equity。和往常一样，镜头都是关注单一新闻主题的短片。\n基于丹尼的SAP知识，娜塔莎对未来Qualtrics S-1的好奇心，以及我最近对SAP和Qualtrics数字的深入研究，我们设法涵盖了相当多的领域。所以，如果你想知道：\n最后一个问题的剧透回答是坚定的否定，但尽管如此，多么有趣。这就是本期的股票拍摄，点击播放，玩得开心，我们周五早上回来，除非发生其他事情，比如Palantir S-1。\n股市每周一上午7点下跌。PT和周五上午6点。PT，所以订阅我们的苹果播客，阴天，Spotify和所有的演员。", "note_en": "Hello and welcome back to  Equity, TechCrunch’s venture capital-focused podcast where we unpack the numbers behind the headlines.\n After  the morning show went out, the Equity crew could not shut up about  the Qualtrics-SAP deal, so we had no choice but to jump back into recording mode for an off-the-cuff Equity Shot. As always, Shots are short-form Equity episodes that focus on a single, news topic.\n  Building off of Danny’s SAP knowledge, Natasha’s curiosity about the future  Qualtrics   S-1, and  my own recent dive into the SAP and Qualtrics numbers, we managed to cover quite a lot of ground. So, if you wanted to know:\n   Spoiler on that last as the answer is a firm  no, but, all the same, what fun. That’s about it for this Equity Shot, hit play, have fun, and we are back Friday morning unless something else happens, like a Palantir S-1.\n Equity drops every Monday at 7:00 a.m. PT and Friday at 6:00 a.m. PT, so subscribe to us on   Apple Podcasts ,   Overcast ,   Spotify  and all the casts.", "posttime": "2020-07-28 01:06:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ipo,shot,sap", "title": "\n股权快照：所有关于Qualtrics IPO的信息", "title_en": "\n\t\t\t\tEquity Shot: All about the Qualtrics IPO\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/27/equity-shot-all-about-the-qualtrics-ipo/", "via": "", "real_tags": ["ipo", "shot", "sap"]}]