[{"category": "", "categoryclass": "", "imagename": "98670454797a2c3e8533501fb2569cfc.jpeg", "infoid": 1006823, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧盟执行机构欧盟委员会(European Commission)表示，它将评估苹果针对应用开发商通过App Store分发应用的规定是否违反了欧盟的竞争规定。\n至于Apple Pay，欧盟委员会表示，它将调查苹果将Apple Pay集成到商家应用程序和网站的条款和条件，苹果对使用NFC技术的限制，以及涉嫌拒绝访问Apple Pay。\n欧盟委员会周二宣布，将对苹果的App Store规则和Apple Pay平台发起两项反垄断调查。\n欧盟执行机构欧盟委员会(European Commission)表示，它将评估苹果针对应用开发商通过App Store分发应用的规定是否违反了欧盟的竞争规定。\n虽然公司可以免费将他们的应用程序放在App Store上，但苹果公司从应用程序内购买中收取30%的费用，第一年收取30%的订阅费，之后收取15%。\n与Apple Music直接竞争的Spotify认为这是不公平的，并于2019年3月正式提出投诉。与苹果图书竞争的电子阅读器公司Kobo也提出了申诉。\n负责竞争政策的执行副总裁玛格丽特·维斯特格(Margrethe Vestager)在一份声明中表示：移动应用程序从根本上改变了我们获取内容的方式。苹果制定了向iPhone和iPad用户分发应用程序的规则。\n在向苹果流行设备的用户分发应用程序和内容方面，苹果似乎获得了看门人的角色。我们需要确保，在苹果与其他应用开发商竞争的市场上，苹果的规则不会扭曲竞争，例如与其音乐流媒体服务Apple Music或Apple Books竞争。因此，我决定密切关注苹果的App Store规则，以及它们是否符合欧盟的竞争规则。\n关于Apple Pay，欧盟委员会表示，它将调查苹果将Apple Pay集成到应用程序和网站的条款和条件，苹果对使用NFC技术的限制，以及涉嫌拒绝访问Apple Pay。\n维斯特格说，苹果似乎对Apple Pay在商家应用程序和网站中的使用方式设定了条件。\n它还将iPhone的即点即用功能保留到Apple Pay上。重要的是，苹果的措施不会剥夺消费者从新支付技术中获得的好处，包括更好的选择、质量、创新和有竞争力的价格。因此，我决定仔细研究一下苹果在Apple Pay方面的做法及其对竞争的影响。\n欧盟委员会有权关闭科技服务，并向美国科技公司收取其年收入的10%。苹果公司表示，欧盟委员会听取了少数企业的无端投诉，这令人失望。\n苹果公司在一份声明中表示，纵观我们的历史，苹果在世界上竞争最激烈的一些市场创造了突破性的新产品和服务。“我们做任何事情都遵循法律，我们在每个阶段都拥抱竞争，因为我们相信竞争会推动我们提供更好的结果。”我们开发App Store有两个目标：让消费者安全可靠地发现和下载应用程序，以及为企业家和开发者提供巨大的商机。我们为无数通过我们的平台进行创新并取得成功的开发人员深感自豪。随着我们的共同成长，我们继续提供创新的新服务，如Apple Pay，这些服务在满足行业领先的隐私和安全标准的同时，提供最好的客户体验。归根结底，我们的目标很简单：让我们的客户在安全可靠的环境中获得他们选择的最好的应用程序或服务。我们欢迎有机会向欧盟委员会展示我们为实现这一目标所做的一切。\n近几个月来，欧盟对谷歌、亚马逊和Facebook发起了其他反垄断调查。", "note_en": "The Commission, the executive arm of the EU, said it will assess whether Apple&#39;s rules for app developers on the distribution of apps via the App Store breach EU competition rules.\n With regards to Apple Pay, the Commission said it will look at Apple&#39;s terms and conditions for integrating Apple Pay in merchant&#39;s apps and websites, Apple&#39;s limitation of access to NFC technology, and alleged refusals of access to Apple Pay.\n The European Commission announced Tuesday that it&#39;s launching two antitrust investigations into  Apple&#39;s App Store rules and the Apple Pay platform.\n The Commission, the executive arm of the EU, said it will assess whether Apple&#39;s rules for app developers on the distribution of apps via the App Store breach EU competition rules.\n  While companies can place their apps on the App Store at no cost, Apple charges companies 30% from in-app purchases and 30% on subscriptions for the first year, then 15% thereafter.\n Spotify, which competes directly with Apple Music, feels this is unfair and filed a formal complaint in March 2019. Kobo, an e-reader company that competes with Apple Books, has also filed a complaint.\n Executive Vice-President Margrethe Vestager, in charge of competition policy, said in a statement:  &#34;Mobile applications have fundamentally changed the way we access content. Apple sets the rules for the distribution of apps to users of iPhones and iPads.&#34;\n &#34;It appears that Apple obtained a &#39;gatekeeper&#39; role when it comes to the distribution of apps and content to users of Apple&#39;s popular devices. We need to ensure that Apple&#39;s rules do not distort competition in markets where Apple is competing with other app developers, for example with its music streaming service Apple Music or with Apple Books. I have therefore decided to take a close look at Apple&#39;s App Store rules and their compliance with EU competition rules.&#34;\n  With regards to Apple Pay, the Commission said it will look at Apple&#39;s terms and conditions for integrating Apple Pay in apps and websites, Apple&#39;s limitation of access to NFC technology, and alleged refusals of access to Apple Pay.\n  &#34;It appears that Apple sets the conditions on how Apple Pay should be used in merchants&#39; apps and websites,&#34; Vestager said.\n &#34;It also reserves the &#39;tap and go&#39; functionality of iPhones to Apple Pay. It is important that Apple&#39;s measures do not deny consumers the benefits of new payment technologies, including better choice, quality, innovation and competitive prices. I have therefore decided to take a close look at Apple&#39;s practices regarding Apple Pay and their impact on competition.&#34;\n The European Commission has the power to shut down tech services and charge U.S. tech firms 10% of their annual revenues. Apple said it was &#34;disappointing&#34; that the Commission is listening to &#34;baseless complaints&#34; from a small number of businesses.\n &#34;Throughout our history, Apple has created groundbreaking new products and services in some of the most fiercely competitive markets in the world. We follow the law in everything we do and we embrace competition at every stage because we believe it pushes us to deliver even better results,&#34; the company said in a statement.   &#34;We developed the App Store with two goals in mind: that it be a safe and trusted place for customers to discover and download apps, and a great business opportunity for entrepreneurs and developers. We&#39;re deeply proud of the countless developers who&#39;ve innovated and found success through our platform. And as we&#39;ve grown together, we&#39;ve continued to deliver innovative new services — like Apple Pay — that provide the very best customer experience while meeting industry-leading standards for privacy and security.&#34;   &#34;At the end of the day, our goal is simple: for our customers to have access to the best app or service of their choice, in a safe and secure environment. We welcome the opportunity to show the European Commission all we&#39;ve done to make that goal a reality.&#34;\n The EU has launched other anti-trust investigations into  Google,  Amazon, and  Facebook in recent months.", "posttime": "2020-06-17 00:16:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,app,apple,rust,竞争", "title": "欧盟对苹果App Store和Apple Pay展开反垄断调查", "title_en": "EU Launches Antitrust Probes Into Apple's App Store and Apple Pay", "transed": 1, "url": "https://www.cnbc.com/2020/06/16/apple-eu-antitrust.html", "via": "", "real_tags": ["苹果", "app", "apple", "rust", "竞争"]}, {"category": "", "categoryclass": "", "imagename": "8f8c5b1332820c7c0c8de312535c9593.png", "infoid": 1006822, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "虽然Jupyter在Python科学计算社区中广为人知，但实际上它是一个语言不可知的开发环境。数据科学的主要语言，如Python、C++、R或Julia，都有高质量的语言内核。但是，数据科学的另一个重要工具是SQL编程语言系列。今天，我们宣布发布SQLite的Jupyter内核。\n这个新内核允许用户使用完整的SQLite语法以及一些额外的操作，比如打开或关闭数据库文件，或者使用Jupyter Magics以不同的方式可视化数据。\n为了使为Jupyter实现新内核的任务变得更容易，我们利用了Xeus，这是一个提供Jupyter内核协议的可靠实现的库，这样我们就可以专注于实现内核中特定于语言的部分。\n作为SQLite的原生C实现和C++之间的连接，我们使用SRombauts的库SQLiteCpp。\nXEUS-SQLite仍在积极开发中，但它提供了一个功能齐全的SQLite接口和Magics来执行SQL语法范围之外的高级操作，比如创建、打开或关闭SQLite数据库。可以使用Xeus-SQLite执行的一些操作包括创建、加载、备份或删除新数据库。您还可以检查表是否存在，设置和重置数据库的键，并获取有关该表的信息。您可以在SQLite的文档中找到有关使用这些方法的更多信息。\nXeus-SQLite为Jupyter Notebook和Jupyter Lab中的表格提供了丰富的HTML显示。对于Jupyter控制台，我们使用表格库进行文本显示。\n对于Xeus-SQLite的未来，我们希望创建一种直观的可视化数据形式：从SQLite查询结果创建曲线图、图形、图表、地图和更多内容，所有这些都在同一个笔记本中。目前，我们正在探索在Xeus-SQLite中使用Vega，Xeus-SQLite是一种用于创建交互式可视化设计的声明性语言，可以使用jupyter Magics绘制条形图：\n我们还计划生成一个静态版本的Xeus-SQLite，将Xeus和SQLite库捆绑到一个易于分发的单一可执行文件中。\n您只需单击下图即可试用稳定版，而无需在您的计算机上安装任何东西：\n这不会授予您访问我们正在测试的实验分支的权限，如果您有兴趣尝试，请查看安装指南，并确保您选择了正确的分支。\n请注意，您首先需要在计算机上安装Jupyter。您可以使用manba安装xeus-sqlite：\n我的名字是Mariana Meireles，我是QuantStack的一名软件开发人员。我非常关心技术对世界的影响，并尽最大努力成为我希望看到的变化，为基于自由和多样化标准的开放源码项目做出贡献。\n在加入QuantStack之前，我在Qt公司的PySide团队担任开发人员，在Mozilla担任Web性能开发人员。", "note_en": "While it is well known in the Python scientific computing community, Jupyter is in fact a language-agnostic development environment. High-quality language kernels exist for the main languages of data sciences, such as  Python,  C++,  R or  Julia. But another important tool for data science is the SQL family of programming languages. Today, we announce the release of a Jupyter kernel for SQLite.\n  This new kernel allows the user to use the complete SQLite syntax as well as some extra operations such as opening or closing a database file, or visualizing the data in different ways using Jupyter magics.\n  To make the task of implementing a new Kernel for Jupyter easier, we make use of   Xeus , a library providing a solid implementation ofthe Jupyter kernel protocol, so that we can focus on implementing the language-specific parts of the kernel.\n As a connection between SQLite’s native C implementation and C++ we’re using SRombauts’ library   SQLiteCpp .\n  xeus-SQLite is still under active development but it offers a fully functional SQLite interface and magics to perform higher-level operations that are outside of the scope of the SQL syntax, such as creating, opening, or closing SQLite databases. Some of the things you can do with xeus-SQLite are creating a new database, loading it, backing it up or deleting it. You can also check if a table exists, set and reset keys of a database and get information about it. You can find more about the use of these methods in SQLite’s  documentation.\n xeus-SQLite provides rich HTML display of tables in the Jupyter Notebook and Jupyter Lab. For the Jupyter Console we make use of the   tabulate library for textual display.\n   For the future of xeus-SQLite we want to create an intuitive form of visualizing data: creating plots, graphs, charts, maps and much more from your SQLite query results, all in the same notebook. Currently we’re exploring the use of   Vega  in xeus-SQLite, a declarative language for creating interactive visualization designs and can do bar plots using jupyter magics:\n   We also plan on producing a static build of xeus-SQLite bundling xeus and the SQLite library into a single executable that can be easily distributed.\n  You can try the stable version without the need of installing anything on your computer just by clicking on the image below:\n  This won’t grant you access to the experimental branch where we’re testing, if you’re interested in trying it please check the  installation guide and make sure you’re in the right  branch.\n  Note that you first need to have Jupyter installed on your computer. You can install  xeus-sqlite using mamba:\n      My name is  Mariana Meireles and I’m a software developer working for  QuantStack. I care deeply about the impacts that technology has in the world and try my best to be the change I want to see by contributing to open source projects that stand upon libre and diverse standards.\n Prior to QuantStack I worked as a developer on the PySide team at the Qt Company and as a web performance developer at Mozilla.", "posttime": "2020-06-17 00:14:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sqlite,kernel", "title": "一种面向SQLite的Jupyter内核", "title_en": "A Jupyter Kernel for SQLite", "transed": 1, "url": "https://blog.jupyter.org/a-jupyter-kernel-for-sqlite-9549c5dcf551", "via": "", "real_tags": ["sqlite", "kernel"]}, {"category": "", "categoryclass": "", "imagename": "b0fe96952a39dff08352adfd54bd2beb.jpg", "infoid": 1006821, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一，一道蓝光划过天空，让西澳大利亚的夜猫子们大吃一惊，也让天文学圈迷惑不解。\n这个蓝色的火球是在凌晨1点被看到的。据ABC新闻皮尔巴拉报道，当地时间6月15日。堪培拉CSIRO-NASA跟踪站的教育和推广经理格伦·纳格尔(Glen Nagle)告诉通讯社，这真是一次壮观的观察。Nagle说，据报道，在偏远的皮尔巴拉地区以及该国的北领地和南澳大利亚都有目击事件。\n许多观察家用视频捕捉到了这一现象。火球稳定地划过天空。起初，它看起来是橙色或黄色的，后面有一条短尾巴。几秒钟后，火球的大部分亮起蓝色。\n据美国广播公司新闻网报道，科学家们并不十分确定是什么物体在大气层中燃烧，才能创造出如此灿烂的灯光秀。一些业余天文学家推测，该物体可能是人造残骸，可能来自最近的一次火箭发射。但这似乎不太可能，科廷大学太空科技中心的研究大使Renae Sayers告诉通讯社。\n2020年6月16日，在西澳大利亚偏远的皮尔巴拉pic.twitter.com/UF9JqNIRiR，一个火球划过夜空。\n塞耶斯说，当太空垃圾重新进入大气层时，我们往往会看到一些爆裂和火花。这是因为有东西在燃烧--所以你的太阳能电池板到处都是，你的金属块到处都在移动。\n另一方面，皮尔巴拉上空的火球在天空中平稳地滑行。这使得它更有可能是一个自然空间物体。根据Nagle的说法，蓝色表示铁含量很高。许多陨石--在穿越地球大气层的火热旅程中幸存下来的太空岩石--含铁量很高。根据英国自然历史博物馆的说法，其中一些可能是古代小行星的核心。\n塞耶斯说，这个火球看起来与2017年在澳大利亚发现的另一颗壮观的流星相似。2017年的火球呼啸着划过天空，但它没有击中地面或在大气中燃烧，而是反弹回太空。她告诉ABC新闻，6月15日的火球可能是另一次吃草的遭遇。\n明亮到可以归类为火球的流星很少见，但与太空岩石相遇却很常见。根据美国国家航空航天局(NASA)的数据，每天大约有48.5吨(44000公斤)的流星物质落在地球上。大多数太空岩石在穿过地球大气层时会完全解体或变成鹅卵石大小。偶尔也会有真正壮观的入场：2013年2月，一颗后来被称为车里雅宾斯克流星的流星进入俄罗斯上空的大气层，并在1908年通古斯卡爆炸以来最大的太空爆炸中爆炸。爆炸炸毁了六个不同城市建筑物的窗户。\n在有限的时间内，您可以订阅我们任何畅销的科学杂志，每月只需2.38美元，即前三个月的标准价格有45%的折扣。视图交易", "note_en": "A streak of blue light that flashed across the sky on Monday surprised western Australia&#39;s night owls and befuddled the astronomy community.\n The blue fireball was seen at 1 a.m. local time on June 15, according to   ABC News Pilbara. &#34;It was really a spectacular observation,&#34; Glen Nagle, the education and outreach manager at the CSIRO-NASA tracking station in Canberra, told the news agency. Sightings were reported across the remote Pilbara region as well as in the country&#39;s Northern Territory and in South Australia, Nagle said.\n  Many observers caught the phenomenon on video. The fireball streaks steadily across the sky. At first, it appears orange or yellow, with a short tail streaming behind it. After a few seconds, the bulk of the fireball lights up blue.\n  Scientists aren&#39;t quite sure what object was burning up in the atmosphere to create the brilliant light show, according to ABC News. Some amateur astronomers speculated that the object could be human-made debris, perhaps from a recent rocket launch. But that seems unlikely, Renae Sayers, a research ambassador at Curtin University&#39;s Space Science and Technology Centre, told the news agency.\n  A fireball flashes across the night sky in Western Australia’s remote Pilbara pic.twitter.com/UF9JqNIRiR June 16, 2020\n When space junk reenters the atmosphere, &#34;what we tend to see is sort of like crackles and sparks,&#34; Sayers said. &#34;This is due to the fact that there is stuff burning up — so you&#39;ve got solar panels going all over the place, you&#39;ve got hunks of metal moving around.&#34;\n The fireball over Pilbara, on the other hand, glided smoothly through the sky. That makes it more likely to be a natural space object. The blue color, according to Nagle, indicates a high   iron content. Many   meteorites — space rocks that survive their fiery trip through Earth&#39;s atmosphere — are high in iron. Some may be the cores of ancient asteroids,   according to the Natural History Museum in the U.K.\n Sayers said that the fireball looked similar to another spectacular meteor sighted in Australia in 2017. That 2017 fireball whooshed across the sky, but instead of hitting the ground or burning up in the atmosphere, it   bounced back into space. The June 15 fireball may have been another grazing encounter, she told ABC News.\n Meteors bright enough to be classified as fireballs are rare, but encounters with space rocks are common.   According to NASA, about 48.5 tons (44,000 kilograms) of meteor material falls on   Earth every day. Most space rocks disintegrate entirely or are the size of a pebble by the time they make it through Earth&#39;s atmosphere. Occasionally, one makes a truly spectacular entrance: In February 2013, a meteor that would become known as the Chelyabinsk meteor entered the atmosphere over Russia and exploded in the   biggest space blast since the 1908 Tunguska explosion. The explosion blew out windows in buildings in six different cities.\n   For a limited time, you can take out a digital subscription to any of  our best-selling science magazines for just $2.38 per month, or 45% off the standard price for the first three months. View Deal", "posttime": "2020-06-17 00:14:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上空,fireball,火球", "title": "西澳大利亚上空蓝色火球条纹", "title_en": "Blue fireball streaks above Western Australia", "transed": 1, "url": "https://www.livescience.com/mysterious-fireball-pilbara.html", "via": "", "real_tags": ["上空", "fireball", "火球"]}, {"category": "", "categoryclass": "", "imagename": "b87188d93e88c4f4373ce4327a85a111.jpeg", "infoid": 1006820, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从英格兰的布里斯托尔到阿拉巴马州的伯明翰，世界各地的人们一直在努力应对种族主义的遗产，在问题古迹的头上抛出他们的格斗钩子。\n如果你碰巧发现自己靠近一座你决定不再喜欢的雕像，我们向科学家请教了最好、最安全的方法，让它落地而不会有人受伤-当然，除了已经死了一个世纪的死气沉沉的种族主义者。\n机械工程师斯科特·霍兰德(Scott Holland)表示，推倒雕像所需的力没有你想象的那么大。大多数雕像都是青铜的，使用90%的铜和10%的锡的合金，最大厚度为3/16英寸。相比之下，自由女神像的铜板厚度只有3/32英寸。\n霍兰德说，一个人的平均雕像最高可达3500磅左右。(仅供参考：一尊马雕像约重7000磅。)。与此同时，OSHA规定的每人水平拉力的上限是50磅-“但这是为了每天工作，”他说，“所以你可能会做两倍。”\n霍兰德说，在100磅的力量下，我们谈论的是一项35人的工作来拖拽雕像。但要把它拉下来，“让我们假设力量是原来的两倍--所以你需要两倍的人。”所以在你开始倒台之前，你最好招募70个有点肌肉的朋友。\n既然你有船员了，你就需要合适的工具。霍兰德建议抓起几条4x4恢复带，这种带的额定重量可以超过3.2万磅，远没有链子那么笨重。霍兰德说，一旦你装备得当，你就想要得到杠杆作用，“所以你需要把带子绑在(雕像的)头或脖子上。”\n要将雕像从底座上打破，请在两边分成两个小组，来回工作。霍兰德说，大多数雕像都附着在底座上2到3英尺长的钢筋上，所以你实际上是在钢筋上方的青铜处折断它，而不是钢筋本身。(那是钢材。)。他说：“当美国拆除萨达姆·侯赛因的雕像时，你可以看到它在底部钢筋处折叠。”\n比方说你找不到70个朋友。如果你还想用一支规模较小的清除小分队来尝试这一点，你必须削弱纪念碑本身的力量。这就是温度的用武之地。\n屈服强度随温度变化很大。例如，一座90%的铜/10%的锡雕像在室温下的屈服强度为31.4兆帕斯卡-相比之下，6061铝的屈服强度为275兆帕-“所以从结构上讲，”霍兰德说，“它不难打破。”\n35人的情况下，你需要将雕像的屈服强度通过加热将其减半。你是怎么做到的呢？对于一尊青铜雕像，你的目标温度是450摄氏度左右，或842华氏度。“你可以用丁烷火炬，”霍兰德说，“但用丙烷火炬会快得多。那些更烫。你会在那里待上15到20分钟，但这要容易得多。“。\n只要确保你使用了适当的防护装备，并确保雕像坠落时没有人在下面就行了。这意味着要使用一根长绳子，以确保绳子上的第一个人离雕像的距离比雕像的高度更远。使用这个方便的毕达哥拉斯三角形计算器来帮助你解决这个问题。\n也许你是在一个更小的团队中运作-或者，保佑你的灵魂，你自己一个人推倒雕像。那样的话，你最好的选择就是融化这该死的东西。我们来做个铝热剂反应。\n“公式非常简单，”圣地亚哥州立大学化学教授克里斯·哈里森(Chris Harrison)说。“铁锈和铝粉的质量比是3：1。你把它们混合在一起，用一块镁作为高温保险丝。如果你没有，你可以用一个汽水。“。\n假设的青铜雕像的熔点是1,742华氏度，但即使你遇到种族主义的铜铸件(熔点：1,984度)，你仍然可以很容易地用铝热剂熔化两者，因为它的燃烧温度为2500华氏度。\n虽然铝热剂可能燃烧的热量几乎是太阳的一半，但它不是爆炸性的。“你可以用塑料或金属桶把铝热剂包在(雕像的)脚踝上，去掉底座，”哈里森说。“你可以把水桶的两半倒过来，放在脚的两边，然后把铝热剂倒进去，尽可能地把它压得严严实实。”开放的空间越大，反应的效率就越低。“。\n哈里森说，一旦你熔化了雕像的脚踝，它就会倒下，因为这种金属可能会支撑它上面的一切。\n如果你的汽水用完了，可以从Airgas或Praxair这样的分销商那里买一些液氮。然后，在雕像上钻一个洞，把氮气倒在里面，粉碎脚踝。\n或者你可以将两者结合起来，哈里森说。“如果液氮高于铝热剂的高度，你会有一些非常冷的金属，就在一些金属变得非常热的旁边，”他说。“这应该会引起很大的热应变，很可能会导致金属在该区域开裂。”\n只要把那个洞保持在你的铝热剂上方，否则你会把热得令人难以置信的熔融金属喷到空气中。\n哈里森说，还有一个有趣的好处：液氮会很快变成气体，从你钻的那个洞里喷出来，这几乎肯定会引起高音尖叫。“人们可以想象，这声音听起来有点像邦联将军的脚着火时发出的声音。”\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息。\n此评论区由第三方创建和维护，并导入到此页面。你可以在他们的网站上找到更多信息。", "note_en": "From  Bristol, England to  Birmingham, Alabama, people all over the world have been grappling with the  legacy of racism by tossing their grappling hooks around the heads of  problematic monuments.\n Should you happen to find yourself near a statue that you decide you no longer like, we asked scientists for the best, safest ways to bring it to the ground without anyone getting hurt—except, of course, for the inanimate racist who’s been dead for a century anyway.\n   The force required to pull down a statue isn’t as great as you think, says mechanical engineer Scott Holland. Most statues are bronze, using an alloy of 90 percent copper and 10 percent tin and a maximum thickness of 3/16 of an inch. The   Statue of Liberty’s copper sheeting is only 3/32 of an inch thick, for comparison.\n Holland says your average statue of a person tops out at around 3,500 pounds. (FYI: A horse statue is approximately 7,000 pounds.) Meanwhile, the   OSHA-mandated upper force limit for horizontal pulling per person is 50 pounds of force—“but that’s for working every day,” he says, “so you could probably do twice that.”\n At 100 pounds of force, then, we’re talking about a 35-person job to drag the statue, Holland says. But to pull it down, “let’s assume twice the force—so you’ll need twice as many people.” So before you start toppling, you’d better recruit 70 buddies with a bit of muscle.\n Now that you have your crew, you’ll need the right tools. Holland suggests grabbing a few   4x4 recovery straps, which can be rated to over 32,000 pounds and are far less cumbersome than a chain. Once you’re properly equipped, you want to get leverage, Holland says, “so you need to get the straps around the head or the neck [of the statue].”\n To break the statue from its base, split into two teams on either side and work in a back-and-forth motion. Most statues are attached to the base by 2 to 3 feet of rebar, so you’ll actually be breaking it at the bronze above the rebar— not the rebar itself, says Holland. (That’s steel.) “When the U.S.   took down that statue of Saddam Hussein, you can see it folds at that spot where the rebar is in the base of it,” he says.\n  Let’s say you can’t find 70 friends. If you still want to attempt this with a smaller removal squad, you have to weaken the monument itself. That’s where temperature comes in.\n Yield strength changes a lot with temperature. A 90 percent copper/10 percent tin statue, for example, will have a yield strength at room temperature of 31.4 megapascals—that’s compared to 275 MPa for 6061 aluminum—“so structurally,” Holland says, “it’s not hard to break.”\n  With 35 people, you need to cut the statue’s yield strength in half by heating it up. And how do you do that? For a bronze statue,  your target temperature is around 450 degrees Celsius, or 842 degrees Fahrenheit. “You could use a butane torch,” says Holland, “but it would be much quicker with a propane torch. Those burn hotter. You’ll be there for 15 to 20 minutes, but it’s a lot easier.”\n Just make sure you use the proper protective equipment and look to see that nobody is underneath the statue when it falls. That means using a long rope to make sure the first person on the rope is farther away from the statue than the statue is tall. Use this handy   Pythagorean triangle calculator to help figure that out.\n   Maybe you’re operating with an even smaller team—or, bless your soul, toppling the statue all by yourself. In that case, your best bet is melting the damn thing. So let’s make a thermite reaction.\n “The formula is very simple,” says Chris Harrison, a chemistry professor at San Diego State University. “It’s 3:1 by mass of rust and aluminum powder. You mix those together and use a piece of magnesium to use as a high temperature fuse. And if you don’t have one, you could use a sparkler.”\n  The melting point of the hypothetical bronze statue is 1,742 degrees Fahrenheit, but even if you come across a racist cast in copper (melting point: 1,984 degrees), you can still easily melt both with thermite, as it burns at 2,500 degrees.\n While thermite might burn nearly half as hot as the sun, it isn’t explosive. “You could pack the thermite around [the statue’s] ankles using a plastic or metal bucket with the base removed,” Harrison says. “You could invert the halves of the bucket and place them on either side of the feet, and then pour in the thermite, packing it down as best as possible. The more open space there is, the less efficient the reaction will be.”\n  Once you melt the statue’s ankles, it should just fall over, Harrison says, as that metal likely supports everything above it.\n  If you’re out of sparklers, snag some liquid nitrogen from a distributor like Airgas or Praxair. Then, drill a hole in the statue and pour the nitrogen inside to shatter the ankles.\n Or you could combine the two, says Harrison. “If the liquid nitrogen is above the height of the thermite, you’ll have some very cold metal, right next to some metal getting very hot,” he says. “This should induce a lot of thermal strain, likely causing the metal to crack in that region.”\n Just keep that hole way above your thermite, or you’ll be spraying incredibly hot molten metal into the air.\n  And here’s a fun bonus: The liquid nitrogen will quickly turn to a gas and come shooting out of that hole you drilled, says Harrison, which will almost certainly cause a high-pitched squeal. “One could imagine it sounding something like the sound a confederate general would make if their feet were on fire.”\n   This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n   This commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "posttime": "2020-06-16 23:55:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "推倒,statue,雕像", "title": "如何用科学推倒雕像", "title_en": "How to Topple a Statue Using Science", "transed": 1, "url": "https://www.popularmechanics.com/science/a32870657/remove-statue-science/", "via": "", "real_tags": ["推倒", "statue", "雕像"]}, {"category": "", "categoryclass": "", "imagename": "64f792b778acfccbf5f64e6ca4044b24.png", "infoid": 1006819, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这可能是一个有点不受欢迎的观点，所以点击诱饵标题应该是合适的！从1.6版开始，我已经学习和使用Rust将近四年半了。对于熟悉语言、工具和生态系统的一些问题来说，这是一段很长的时间。但这是一个略有不同的故事，这是对编译器速度慢的常见批评的异议。在这次讨论中，我将争辩说，这些说法充其量只是误导。有大量证据表明，与其他语言的编译器相比，Rustc速度较慢；Go可以在五分之一的时间内编译具有类似复杂性的应用程序，Clang或GCC可以为C编写的应用程序做同样的事情。可以接受的是，可以证明RUST宏和类型系统比通常用GO或C编写的要复杂得多，这需要RUST编译器承担更大的负担。虽然这种情绪有一定的道理，但我相信还有更多的原因。我认为，与其说这是一个算法问题，不如说是一个人类问题。\n我经常光顾URLO，时不时地帮助回答问题。我主要用它来吸收信息，学习这种语言和围绕它的更大的生态系统。我有时也公开反对肥胖，我想通过这篇文章继续提高人们的意识。\n首先，让我们简短地绕道来考察一下历史背景下的软件膨胀。我首先想到的是沃斯定律，它实质上说，软件[开发者]通过填补空白来抵消硬件性能上的所有进步。请阅读Niklaus Wirth的论文“精益软件的恳求”，这是非常值得的。这绝不是一个新的或独特的观察结果。继续探索这条臃肿的道路，任何进一步的探索都会对读者造成伤害，因为它偏离了我的主要观点。但这是另一个基本问题的例子，那就是人类是神秘的，人类的行为甚至更不清楚。\n大多数开发人员在编写软件时都会权衡时间。对于开发人员来说，唯一真正的目标是解决特定的问题。比方说玛丽在做一个游戏，她没有无限的时间来完善这个游戏，但她可以在合理的时间框架内完成一些合理的事情。玛丽知道她剩下的心跳是有限的，这是激励生活本身的货币，所以她会明智地利用这些心跳，忽略细节，专注于手头的问题。这不是一件坏事！一款游戏制作完成，她就可以继续创作她的下一个大热门了。\n但它对产品的内部结构说了些什么呢？它做了什么浪费的事吗？能不能把它做得更有效率一点？使用更少的能源(特别是电池电源)？当然可以！玛丽没有时间把它做得尽善尽美。这就是我要讲的故事。\n我之所以描述这个假想的游戏开发者和她的软件，是因为我自己已经做过很多次了。我写代码，当我对它的工作方式感到满意时，我就会转移到其他事情上，在这个过程中留下大量的面包屑。任何人看到这种情况都会惊呼，哎呀，真是一团糟！谁会这么做？！&#34；\n我当前在生产环境中运行的大量代码是Python。每天有数以百万计的人依赖它，而且它的运营费用非常昂贵。学到的教训是，尽管语言的选择可能让我快速地将一个项目从构思发展到生产，但长期的赤字根本不值得早期微不足道的收获。如果多个项目用客观上很慢的语言编写，使用客观上不好的动态类型转换，您会如何处理这些项目？当然，您可以在JIT编译器下运行它们！如果它必须客观上很慢，我们至少可以通过一点积极的编译器优化来弥补一些严重的效率损失。\n这终于引出了我的观点。软件开发人员并不完美，在如何利用他们的心跳方面做出明智的决定，他们通过利用前人编写的软件来构建软件。在这里选择一种语言和编译器，在那里添加少量的库和依赖项，然后将它们混合在一起，您就得到了一个很好的解决问题的方法。但当然，在你制造至少一个，也许是许多其他问题之前，你是不会这样做的。重要的是，这些决定不是出于懒惰，而是出于必要。\n对于那些在优化代码上投入了大量精力的开发人员，再怎么赞扬也不为过。严格的基准测试和性能分析，密切关注CPU周期和堆块的去向，并控制过高的代码路径。我们在很多地方都可以看到这一点，从regex机箱到Actix框架，一直到编译器本身。如此多的积极和令人印象深刻的壮举，总是鼓舞人心的。\n所以，如果编译器实际上已经相当好了，并且有一个团队致力于提高它的速度，那么为什么对于这么多Rust开发人员来说，它看起来这么慢呢？我怀疑这个概念主要是由开发人员自己强加的，他们很快就利用了引入依赖项的轻而易举的优势。几乎没有人抵制依赖于参数解析机箱代码--这就是事情可能会引起一些争议的地方--它及其所有依赖项在可执行文件中占据了400 KiB(在剥离调试符号之后)。您的二进制大小的400 KiB将用于参数解析吗？哦，好吧，我可以算了，400基布现在不卖了。\n但是编译时间呢？那要多少钱？如果你看重你的心跳，你可能不喜欢clap花了这么长时间编译。在我的笔记本电脑上，编译20subCommands示例花费了1分14秒。而且这个例子根本没有任何业务逻辑。它完全只是一个命令行解析器。但是，编译时间在实践中是否相当可观呢？当然，clap将在实际应用程序中使用，在该应用程序中，参数解析仅在程序启动时的最初几十毫秒内完成。大多数应用程序逻辑的成本会高得多，对吗？对吗？\n我的一个副业是用一块便宜的FPGA板学习数字逻辑。测试数字逻辑的一个方便工具是波形查看器，几周前我找到了一个非常简单的工具：dwfv。它在终端中运行，呈现TUI，具有编辑支持和Vim键绑定。干净利落！我注意到的第一件事是编译发布版本几乎花了两分半钟。这不是一个理想的第一印象，但事实就是如此。\n当我玩它的时候，我意识到这可能是一个我会放在后面口袋里的工具。所以这是值得帮助的，为开放源码等做贡献。我的第一个公关是(惊喜！)。用口香糖代替鼓掌。现在，我过去在口香糖上取得了一些成功，所以我知道我要做的是什么。并不总是能够提供与CLAP提供的CLI完全相同的CLI，这也不例外。位置文件名必须更改为可选参数，以便子命令语法可以使用自由参数。在我看来，这是一个非常合理的权衡，可以将编译时间减少30秒。额外的好处；可执行文件的大小也减少了500 KiB。\n好的，我很抱歉找了克拉普的麻烦。我知道它比更简单的参数解析板条箱有它的好处。如果我有自己的选择，我会直接使用环境，而不是进行参数解析。实话实说，论据解析更人性化，而且12个因素的应用程序指南大多是针对微服务的。另外，拍手确实有很强的表现力，我不能打折扣。\n我替换的下一个东西是解析器生成器，用Nom替换了lalrop。在试图决定如何为我计划进行RIIR的汇编项目编写解析器时，我对这两个问题都进行了简要的研究。我为那个项目选择了NOM，总的来说，这是一次非常好的经历。事实证明，这对dwfv来说也是一个很好的改变，它保留了完全的语法兼容性，并将构建时间减少到了大约40秒。这次可执行文件的大小仅减少了32 KiB。\n最后，我能够用一些简单的基于迭代器的解析器替换regex，将构建时间减少到26秒，并惊人地将可执行文件的大小减少了1.14MB。前后的整体情况如下所示：\n这代表了编译时间的显著改进，最新的PR比我第一次发现该应用程序时快了五倍多。更少的依赖项和更小的可执行文件大小也带来了巨大的好处。所有这些都不会丢失任何功能，并且只需对CLI参数选项进行非常微小的更改。\n从很多角度来看，这都是一个非常有趣的项目，我很高兴有机会分享我的发现。我在这里试图说明的是，有些人可能认为是慢编译器的很多东西都可以追溯到开发人员没有勤奋地进行依赖项管理，或者比编译时更喜欢运行时性能，甚至比编译时更喜欢开发速度(无论这意味着什么！)，所以我在这里试图说明的是，有些人可能认为编译器速度很慢，这可以追溯到开发人员不勤奋地进行依赖项管理，或者比编译时更喜欢运行时性能，甚至比编译时更喜欢开发人员速度(无论这意味着什么！)。还记得我说过的关于Python及其允许开发人员快速构建东西的能力吗？有时正则表达式会有这种感觉。隐性成本总是让人大吃一惊。\n然而，情况并不总是如此。有时您必须牺牲编译速度来换取运行时性能。这些应该是例外，而不是规则。大多数Rust开发人员只需稍微推动一下，编译更少的代码就可以减少编译时间。\n此分析使用的工具是货树树(包含在货树中，从铁锈1.44开始！)。和货物膨胀。寻找替代板条箱并不总是容易的，我没有任何一般性的建议，任何人希望尝试任何类似的工作。如果您知道您的选择并且只需要权衡它们，那么lib.rs上显示的有关板条箱的依赖关系统计信息可以帮助您提供比较的基础。", "note_en": "This might be a bit of an unpopular opinion, so the clickbait title should be appropriate!  I&#39;ve been learning and using Rust for nearly four and a half years, since version 1.6. That&#39;s a good amount of time to become familiar with some of the troubles of the language, the tooling, and the ecosystem. But this is a slightly different story, this is a dissent to a common criticism that the compiler is slow. In this discussion, I will argue that these claims are misleading at best.    There is plenty of evidence that suggests rustc is slow relative to compilers for other languages; Go can compile applications with similar complexity in 1/5 the time, and clang or gcc can do the same for applications written in C. It might be acceptable to justify that the Rust macro and type systems are significantly more complex than what is usually written in either Go or C, and that it warrants much heavier lifting by the Rust compiler. While there is some truth in that sentiment, I believe there is more to it than that. I believe it&#39;s more of a human problem than an algorithmic one.\n     I frequent  URLO, helping answer questions from time to time. I mostly use it to absorb information, learning about the language and the greater ecosystem around it. I have also spoken out  against bloat on occasion, and I would like to continue raising awareness through this article.\n  First, let&#39;s take a brief detour to examine software bloat in a historical context. The first thing that comes to my mind is  Wirth&#39;s Law, which says in essence that software [developers] cancel out all advances in hardware performance by filling in the gaps. Read Niklaus Wirth&#39;s paper,  A Plea for Lean Software, it is well worth the time investment. This is by no means a new or unique observation. Continuing to explore this path of &#34;bloatware&#34; any further would be a disservice to the reader as it strays from my primary point. But it stands as another example of the fundamental problem, that humans are enigmatic and human behavior is even less clear.\n  Most developers make a time tradeoff while writing software. The only real goal for a developer is to solve a particular problem. Say Mary is making a game; she doesn&#39;t have infinite time to spend on perfecting the game, but she can get something reasonable completed within a reasonable timeframe. Mary knows she has a finite number of remaining heartbeats, the currency that motivates life itself, so she will wisely spend those heartbeats by ignoring minutiae to focus on the problem at hand. This isn&#39;t a bad thing! A game is produced, and she can go on to work on her next big hit.\n  But what does it say of the internals of the product? Does it do anything wasteful? Could it be made a little more efficient? Use a little less energy (especially battery power)? Surely it can! Mary doesn&#39;t have time to make it perfect. And that&#39;s really the story I want to tell.\n    The reason I&#39;m describing this hypothetical game developer and her software is because I&#39;ve done this myself many times. I write code and when I&#39;m satisfied with how it works, I move on to something else  leaving a large number of breadcrumbs along the way. Anyone could look at the situation and exclaim, &#34;Gee, what a mess! Who would do this?!&#34;\n  A surprising amount of my code that is currently running in a production environment is Python. It is relied upon by millions of people every day, and it is extraordinarily expensive to operate. Lesson learned is that though the language choice may have allowed me to rapidly evolve a project from conception to production, the long term deficits are not at all worth what little was gained early on. What do you do with multiple projects that are written in an objectively slow language, using objectively bad dynamic type transformations? You run them under a JIT compiler, of course! If it has to be objectively slow, we can at least regain some of the gross efficiency loss with a little aggressive compiler optimization.\n  And this leads to my point, at long last. Software developers, being imperfect and making wise decisions about how to spend their heartbeats, build software by leveraging software written by those who came before them. Pick a language and compiler here, add a smidge of libraries and dependencies there, mix it all together and you got yourself one deliciously solved problem. But of course, not before you create at least one, perhaps many other problems. Importantly, these decisions are not made out of laziness, but of necessity.\n  Enough praise cannot be given to the developers who put heroic amounts of effort into optimizing their code. Rigorously benchmarking and profiling, paying keen attention to where CPU cycles and heap blocks are going, and reigning in overly expensive code paths. We see this in many places from the   regex crate to the   actix framework, all the way down into  the compiler itself. So many positive and impressive feats, it&#39;s always inspiring.\n  So if the compiler is actually quite good already and has a team dedicated to making it faster, why does it seem so slow to so many Rust developers? My suspicion is that this conception is mostly self-imposed by developers who are quick to take advantage of just how effortless it is to bring in dependencies. There is almost no resistance to depending on  an argument parsing crate -- and this is where things might get a little controversial -- which with all of  its dependencies takes up 400 KiB in the executable (after stripping debug symbols). 400 KiB of your binary size goes to argument parsing? Oh well, I can let that slide; 400 KiB costs nothing these days.\n  But what about compile time? What does that cost? If you value your heartbeats, you probably dislike that  clap takes so long to compile. On my laptop, the  20_subcommands example took 1 minute and 14 seconds to compile. And the example doesn&#39;t have any business logic at all. It&#39;s entirely  just a command line parser. But is the compile time substantial in practice? Surely  clap will be used in a real-world application where argument parsing is only done within the first few dozen milliseconds or so when the program is started. The majority of the application logic is going to be far more costly, right? Right?\n    One of my side projects is learning digital logic with an inexpensive FPGA board. A handy tool for testing digital logic is a waveform viewer, and I was able to find a very simple one a few weeks back:   dwfv. It runs in the terminal, presents a TUI, has editing support, and vim key bindings. Neat! The first thing I noticed about it is that compiling the release build took almost two and a half minutes. Not an ideal first impression, but there it is.\n  As I played with it, I realized this is probably a tool I will be keeping in my back pocket. So it&#39;s worth helping out, contributing to open source and all that.  My first PR was (surprise!) replacing  clap with   gumdrop. Now, I&#39;ve had some success with  gumdrop in the past, so I knew what I was getting into. It isn&#39;t always possible to provide exactly the same CLI that  clap will provide, and this was no exception. The position filename had to change into an optional argument so that free args could be used for the subcommand syntax. A very reasonable tradeoff, in my opinion, for reducing the compile time by 30 seconds. Bonus; the executable size was also reduced by 500 KiB.\n  Alright, I&#39;m sorry for picking on  clap. I know it has its benefits over simpler argument parsing crates. If I had my druthers, I would  just use the environment instead of argument parsing at all. Real talk, argument parsing is more human friendly, and the 12-factor app guidelines are mostly targeted to microservices anyway. Also  clap does have a lot of expressive power, I can&#39;t discount that.\n  The  next thing I replaced was the parser generator,   lalrpop with   nom. I had looked at both of these briefly while trying to decide on how to write a parser for an assembler project that I planned to RIIR. I settled on  nom for that project, and it was overall a very good experience. It also turned out to be a good change for  dwfv, which retained full syntax compatibility and reduced the build time to about 40 seconds. The executable size was only reduced by 32 KiB this time.\n  Finally, I was able to  replace  regex with some simple iterator-based parsers, reducing the build time to 26 seconds, and astonishingly reducing the executable size by a whopping 1.14 MB. The overall before-and-after looks like this:\n     This represents a significant improvement in compile time, with the latest PR being more than five times faster than when I first discovered the application. Non-trivial benefits are also seen in fewer number of dependencies and a smaller executable size. All without losing  any features, and with only a very minor change to the CLI argument options.\n    This was a very interesting project from many perspectives, and I&#39;m happy to get the chance to share my findings. What I&#39;ve tried to show here is that a lot of what some might consider to be a &#34;slow compiler&#34; can be traced back to a developer not being diligent with dependency management, or preferring runtime performance over compile time, or even &#34;developer velocity&#34; over compile time (whatever that means!) Remember what I said about Python and its ability to allow developers to rapidly build things? Sometimes a regular expression feels that way. Hidden costs are always a surprise.\n  This is not always the case, however. There will be times that you must trade compile speed for runtime performance. Those should be the exception, not the rule. Most Rust developers can reduce their compile times with just a little nudge to compile less code.\n  The tools used for this analysis were  cargo tree (included in  cargo starting with Rust 1.44!) and   cargo-bloat. Finding alternative crates is not always easy, and I don&#39;t have any general recommendations for anyone wishing to attempt any similar work. The &#34;dependencies&#34; statistics shown for crates on  lib.rs can help provide a basis for comparison if you know your options and just need to weigh them.", "posttime": "2020-06-16 23:36:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,rust,铁锈,compiler", "title": "铁锈编译器不慢，我们慢", "title_en": "The Rust compiler isn't slow; we are", "transed": 1, "url": "https://blog.kodewerx.org/2020/06/the-rust-compiler-isnt-slow-we-are.html", "via": "", "real_tags": ["编译", "rust", "铁锈", "compiler"]}, {"category": "", "categoryclass": "", "imagename": "f340ca23f7fc541eca1d85d0fe475825.jpeg", "infoid": 1006818, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "代码很糟糕，密码设计也有缺陷，但像往常一样，我们可以从这个博客中学到一些东西。让我们忽略以下事实：它使用的是MCRYPT_RIJNDAEL_256(Rijndael的256位块版本，而不是AES)，而不是MCRYPT_RIJNDAEL_128(真正的AES)；它不检查substr()的返回值；它将十六进制编码的密钥传递给需要二进制字符串的函数。我以前已经在这个博客上报道过所有这些失败的地方，所以我不会再触及它们了。\n相反，让我们关注两个事实。首先，它正在进行“MAC然后加密”(MTA)，这意味着在加密之前将消息认证码(MAC)应用于明文消息-这与现代密码智慧相反。其次，通过非时序安全比较来检查MAC，这意味着如果攻击者能够获得失败解密的真正精确的时序测量，他们就可以找出有多少MAC匹配。在“Encrypt Then MAC”(ETM)设计中，MAC在加密后应用于密文，这种定时泄漏通常会让您伪造消息。但这一次，MAC是在密文中加密的，所以乍一看，利用它似乎更困难。\n事实上，这个问题是在该页面的评论部分提出的。代码的作者回应如下：\n我曾编写代码对MAC进行恒定时间的文本比较，但后来意识到在使用MAC-Then-Encrypt方法时这不是问题，因为只有在解密之后才会比较MAC，以验证数据是否完整且与加密时相同。因为只有在使用正确的加密密钥时才会暴露正确的MAC，所以文本比较是否以固定时间进行并不重要。更改为Encrypt-Then-MAC方法(需要恒定时间MAC比较)不会向后兼容当前版本。\n让我们遵循这句话的逻辑。在广泛的层面上，他们声称时间攻击无关紧要，因为MAC在加密内部。他们提出这一要求的理由是什么？有两种方式来解释所写的内容，这取决于您将“正确的MAC”理解为什么意思。\n在一种解释中，“正确的MAC”指的是存储在消息中的MAC，他们说您需要密钥才能访问它，因此即使您可以使用计时通道通过旋转“正确的MAC”来匹配计算出的MAC，您也无法实际了解它是什么。这一推理是有缺陷的，因为要创建伪造，您并不总是需要知道MAC值，您只需要生成一些解密机器可以接受的新密文。或者，它们可能意味着即使您知道计算出的MAC值，也不能在不知道加密密钥的情况下将其放入明文消息中。这假设加密本身提供了某种完整性保护。很可能是这样，但需要更严格的论据来证明它的合理性。\n在另一种解释中，“正确的MAC”指的是从解密后的明文消息计算出的MAC。这种解读很难正面解读。确实，它只有在使用正确的密钥解密后才会公开，但是代码中的侧通道在解密之后就会立即泄露有关它的信息！\n这两种读物可能都不是作者的真正意思，但我正试图用最好的方式来解释他们的话。\n稍后我将告诉您如何攻击此代码，存在攻击的事实表明作者的推理肯定是不可靠的。那么，为什么要花这么多话来分析这个论点呢？因为这是一个非常常见的错误的例子，我称之为乐高推理。\n当设计师或开发人员将密码学理解为堆叠在一起的乐高积木时，乐高推理就会发生。蓝色块(MAC)位于红色块(加密)之上，因此蓝色块不会倒下。教科书以电路图的形式展示密码学算法，这些电路图将密码和散列等基元与密钥和明文等数据连接在一起。这导致了一种观点，即密码算法应该被认为是连接在一起的简单组件。\n乐高的观点没有错。这是在编写代码时考虑密码算法的一种直观方式。但这是对密码安全性的错误思考。要谈论算法的安全性，您需要将整个系统作为一个整体来考虑。在你的家里，你可以安全地把一个旧的白炽灯泡换成一个更节能的紧凑型荧光灯，而不用担心它会导致你的微波炉爆炸。密码学则不同。对算法的一部分做一个小小的更改就可以完全破坏其他看似无关的部分。仅仅因为电路图中的部件在空间上是分开的，并不意味着它们不会相互影响。你需要着眼于大局。\n专业的密码学家就是这么做的。而不是自下而上的推理，像这样说：“绿色的乐高积木和红色的乐高积木是这样连接的，所以上面的蓝色乐高积木不会倒下。”他们采取了自上而下的方法，更接近于，“让我们假设这个乐高结构以任何方式破裂。唯一可能的方法(省略了严格的证明细节)是如果绿色的乐高积木一分为二。我们假设个别乐高积木不会破裂，那么整个结构就不会破裂。“。\n在密码学术语中，我们首先假设系统容易受到特定类型的对手的攻击。通常，我们会给对手尽可能多的权力。我们让他们加密选定的明文，甚至解密选定的密文。然后，我们证明了这样一种说法：“如果该对手可以破坏整个系统(整个乐高结构)，那么他们就可以在散列函数(不可摧毁的乐高积木块)中找到冲突。”这种推理让我们正式地证明，如果我们使用的密码原语(密码、散列函数、MAC)是安全的，那么整个系统就是安全的。这是对密码学中的安全性进行推理的正确方式。\n我个人发现，自上而下的思维模式也是破解糟糕密码的好方法。如果您想破解某些密码，首先根据严格的安全正式定义(IND-CPA、IND-CCA2等)找出表明它不安全的攻击。安全的正式定义是如此严格，以至于您发现的攻击可能根本没有任何实际意义。接下来，抓住这个弱点，想办法把它变成实际相关的攻击。对我来说，这几乎每次都有效。\n好的，我之前向您承诺过，我对此PHP加密代码进行了实际攻击，现在是交付的时候了。\n我喜欢这次攻击，因为它展示了我到目前为止一直在说的一切。在Lego块视图中，代码中的计时侧通道似乎只与消息完整性相关。我们被诚信搞得心烦意乱，忘了考虑它对保密的影响。事实证明，这会产生很大的影响。我发现的攻击可以让攻击者解密密文中每个块的第一个字节。唯一的前提条件是：(1)攻击者需要一些(小于2000)的已知明文块，以及(2)攻击者需要能够向解密函数提供密文并获得准确的运行时间测量(即，他们可以利用侧信道)。\n我不打算在这里解释这次袭击。我觉得这样做会分散人们对这篇帖子所传达的信息的注意力。如果您感兴趣，您可以在这里找到攻击的模拟概念实现证明。代码有很好的注释，所以如果您想知道它是如何工作的，您应该能够通过阅读(并运行)该代码来理解它。\n在概念验证中，我删除了Serialize()和UnSerialize()调用，以及对Trim()的调用。我还修改了解密函数，如果第一个字节的MAC比较失败，则返回0；如果MAC比较超过第一个字节，则返回1，模拟具有一个字节粒度的旁路。\n我进行了这些更改，以使攻击更容易、更可靠。如果没有这些变化，攻击在理论上仍然是可能的，但要证明起来要困难得多。具体地说，字符串比较计时泄漏实际上并不具有一个字节的粒度。相反，通常逐字比较字符串(一次4或8个字节)，这会增加执行攻击所需的解密查询数。如果读者感兴趣，他们可能会尝试让攻击在现实环境中工作。\n当我们用乐高进行推理时，我们为了拯救一棵树而破坏了环境。在这种情况下，我们分心思考Mac和伪造，忘记检查其他安全属性。是的，那块蓝色的乐高积木被红色的积木挡住了，但直到我们后退一步，我们才能看到红色的积木挂在边上，即将倒下，把蓝色的积木也带来了。\n把密码学想成乐高积木会让你误入歧途。如果您想要构建安全的密码学，请坚持在具有强大对手的严格模型中提供安全证明。如果您想破解密码学，首先要证明它在严格的模型中是不安全的，然后找到一种方法将这些弱点转化为实际的攻击。\n如果你想雇佣我来找出你的密码设计的问题或你代码中的一些错误，你可以在这里找到更多关于我的咨询服务的信息。", "note_en": "The code is bad and the crypto design is flawed, but as usual for this blog, we can learn something from it. Let’s ignore the fact that it’s using  MCRYPT_RIJNDAEL_256 (the 256-bit  block version of Rijndael, not AES) instead of  MCRYPT_RIJNDAEL_128 (real AES), the fact that it’s not checking the return value of  substr(), and the fact that it’s passing a hexadecimal-encoded key to a function that expects a binary string. I’ve covered all of these failings on this blog before, so I won’t touch on them again.\n Instead, let’s focus on two facts. First, it is doing “MAC then Encrypt” (MtA), which means the Message Authentication Code (MAC) is being applied to the plaintext message  before encryption – contrary to modern crypto wisdom. Second, that the MAC is checked with a  non-timing-safe comparison, which means that if an attacker can get really precise timing measurements of a failed decryption, they can find out how much of the MAC matches. In the “Encrypt then MAC” (EtM) design, where the MAC is applied to the ciphertext after encryption, this kind of a timing leak usually lets you forge a message. But this time, the MAC is inside the ciphertext, encrypted, so at a first glance, exploiting it seems more difficult.\n Indeed, the issue was brought up in the comment section of the page. The author of the code responded as follows:\n I had written code for a constant-time text comparison of the MAC but then realized that this is not an issue when using the MAC-then-encrypt method because the MAC is only compared after decryption to verify that the data is intact and the same as when it was encrypted. Since the correct MAC is only exposed when the correct encryption key is used it doesn’t matter whether the text comparison is done in constant-time or not. Changing to an encrypt-then-MAC method (requiring a constant-time MAC comparison) would not be backwards compatible with the current version.\n Let’s follow the logic of this statement. On a broad level, they are claiming that the timing attack does not matter because the MAC is inside the encryption. What is their reasoning for this claim? There are two ways to interpret what was written, depending on what you take “correct MAC” to mean.\n In one interpretation, “correct MAC” means the MAC that’s stored within the message, and they are saying you need the key to access it, so even if you could use the timing channel to match the calculated MAC by twiddling the “correct MAC” you couldn’t actually learn what it is. This reasoning is flawed because to create a forgery you do not always need to know the MAC value, you just need to produce some new ciphertext that the decryption machinery will accept. Or perhaps they mean that even if you did know the calculated MAC value, you still couldn’t place it inside the plaintext message without knowing the encryption key. This assumes the encryption itself is providing some sort of integrity protection. That may well be so, but a more rigorous argument is necessary to justify it.\n In the other interpretation, “correct MAC” means the MAC that’s computed from the plaintext message after decryption. This reading is hard to interpret in a positive light. It’s true that it’s only exposed after decryption with the correct key, but the side-channel in the code leaks information about it right after it is!\n Neither of these readings may be what the author really meant, but I am trying to interpret their words in the  best way possible.\n I’m going to tell you how to attack against this code in just a moment, and the fact that an attack exists demonstrates that the author’s reasoning must be unsound. So why spend so many words analysing the argument? Because it is an example of an extremely common mistake, which I’ll call  reasoning by Lego.\n Reasoning by Lego happens when a designer or developer understands cryptography as Lego blocks stacked together. The blue block (the MAC) is sitting on top of the red block (the encryption), therefore the blue block won’t fall down. Textbooks put cryptography algorithms on display as circuit diagrams with primitives like ciphers and hashes wired up to data like keys and plaintexts. This leads to the view that crypto algorithms should be thought of as simple components wired together.\n The Lego view is not wrong. It’s an intuitive way to think of crypto algorithms when you’re writing the code. But it’s the wrong way to think about cryptographic security. To talk about an algorithm’s security, you need to consider the entire system as a whole. In your house, you can safely replace an old incandescent lightbulb with a more energy-efficient compact fluorescent without worrying that it will cause your microwave to explode. Cryptography is different. Making a small change to one part of your algorithm can completely break the other seemingly-unrelated parts. Just because the parts are spatially separated in the circuit diagram doesn’t mean they don’t influence each other. You need to look at the bigger picture.\n Professional cryptographers do just that. Instead of reasoning from the bottom up, as by saying, “The green Lego block is connected to the red Lego block in this way, therefore the blue Lego block on top won’t fall over.” they take a top-down approach, closer to, “Let’s suppose this Lego structure breaks in  any way. The only way that’s possible [rigorous proof details omitted] is if the green Lego block splits in two. We are assuming individual Lego blocks do not break, so the whole structure will not break.”\n In cryptographic terms, we start by assuming the system is vulnerable to a specific kind of adversary. Usually, we give the adversary as much power as possible. We let them encrypt chosen plaintexts and even decrypt chosen ciphertexts. Then we prove a claim along the lines of, “If that adversary can break the system as a whole (the entire Lego structure), then they can find a collision in the hash function (the indestructible Lego block).” This sort of reasoning lets us prove, formally, that if the crypto primitives we’re using (ciphers, hash functions, MACs) are secure, then the system as a whole is secure. That is the right way to reason about security in cryptography.\n I’ve personally found that the top-down mindset is a good way to  break bad cryptography, too. If you want to break some crypto, first find an attack that shows it isn’t secure according to the strict formal definitions of security (IND-CPA, IND-CCA2, etc.). The formal definitions of security are so strict that the attack you find might not have any practical relevance at all. Next, take that weakness and find a way to turn it into into a practically-relevant attack. For me, this works nearly every time.\n  Okay, I promised you earlier that I had an actual attack against this PHP encryption code, and now it’s time to deliver.\n I like this attack because it demonstrates everything I’ve been saying up until now. On the Lego block view, the timing side-channel in the code only seems relevant to message integrity. We were so distracted by integrity that we forgot to consider its effect on confidentiality. It turns out to have a big effect. The attack I found lets an attacker decrypt the first byte of every block in a ciphertext. The only preconditions are: (1) The attacker needs some (less than 2000) known plaintext blocks, and (2) the attacker needs to be able to provide ciphertexts to the decryption function and get an accurate measure of the running time (i.e. they can exploit the side-channel).\n I’m not going to explain the attack here. I feel like doing so would distract away from the message of this post. If you are interested, you can find a simulated proof of concept implementation of the attack  here. The code is well-commented, so if you want to know how it works, you should be able to understand it by reading (and running) that code.\n In the proof of concept, I’ve removed the  serialize() and  unserialize() calls, as well as the call to  trim(). I’ve also modified the decryption function to return  0 if the MAC comparison fails on the first byte or  1 if the MAC comparison makes it past the first byte, simulating a side-channel with one-byte granularity.\n I made these changes to make the attack easier and more reliable. Without the changes, the attack is still possible  in theory, but much harder to demonstrate. In particular, string-comparison timing leaks do not have one-byte granularity in practice. Instead, strings are usually compared word-by-word (4 or 8 bytes at a time), which increases the number of decryption queries required to carry out the attack. If the reader is interested, they might try to get the attack working in a realistic setting.\n  When we reason by Lego, we destroy the environment in favor of saving a single tree. In this case, we got distracted into thinking about MACs and forgeries and forgot to check the other security properties. Yes, that blue Lego block is held up by the red block, but until we took a step back, we couldn’t see that the red block was hanging off the edge, about to fall, bringing the blue block with it.\n Thinking of cryptography as Lego blocks put together will lead you astray. If you want to build secure cryptography, insist on a security proof in a strict model with powerful adversaries. If you want to break cryptography, start by showing that it isn’t secure in a strict model, and then find a way to turn those weaknesses into practical attacks.\n  If you would like to hire me to find the problems with your crypto design or some bugs in your code, you can find more information about my consulting services  here.", "posttime": "2020-06-16 23:18:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "密码,思考,lego,mac", "title": "乐高的推理：思考密码学的错误方式", "title_en": "Reasoning by Lego: The wrong way to think about cryptography", "transed": 1, "url": "https://www.cryptofails.com/post/121201011592/reasoning-by-lego-the-wrong-way-to-think-about", "via": "", "real_tags": ["密码", "思考", "lego", "mac"]}, {"category": "", "categoryclass": "", "imagename": "30d702a91a267003776a4e8a05f55a6a.png", "infoid": 1006817, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周一，特斯拉宣布其Model S电动轿车现在一次充电可以行驶402英里(647公里)。据美国环境保护局(Environmental Protection Agency)称，到目前为止，最长腿的Model S-绰号Long Range Plus-只能满足于只有373英里(600公里)。人们普遍认为，特斯拉在电动总成方面远远领先于其他任何汽车制造商，但通过这里和那里进行的一系列小调整，它让这款最老的电动汽车在同样的千瓦时数上走得更远。\n首先，特斯拉已经从车辆中剥离了更多的质量。该公司没有说明具体价格，但改进来自于使用该品牌的内部座椅，以及电动马达和电池组的重量减轻。有一种新的18英寸车轮，带有较低的滚动阻力轮胎，贡献了大约2%的改善。一个类似的效率提升来自前置电机的变速箱。\n现在，一款新的S型Long Range Plus将把再生制动与摩擦制动相结合，以减少能量损失。特斯拉还在Model S上增加了刹车架，所以你不需要把脚放在左侧踏板上来保持汽车静止不动。(不是开玩笑，这是我在任何新车上绝对最喜欢的便利功能，所以把它添加到S型车和特斯拉上做得很好。)。\n如果续航里程的提升不足以吸引新买家，特斯拉也再次降低了Model S的价格。现在Long Range Plus的价格是74990美元，比以前少了5000美元。(特斯拉最近还将Model 3的价格下调了2000美元，将Model X的价格下调了5000美元。)。正如我们在该公司季度收益报告中了解到的那样，8年前首次推出的Model S轿车的销量已经连续几个季度下降，这要归功于美国国税局(IRS)的税收抵免到期以及较便宜、较新的Model 3轿车的蚕食。", "note_en": "On Monday, Tesla announced that its Model S electric sedan can now go 402 miles (647km) between charges. Until now, the longest-legged Model S—with the straightforward moniker Long Range Plus—had to be satisfied with a mere 373 miles (600km)  according to the Environmental Protection Agency. Tesla is widely acknowledged to be far ahead of any other automaker when it comes to electric powertrains, but through a series of small tweaks here and there, it has made its oldest electric vehicle go even further on the same amount of kilowatt-hours.\n To start with, Tesla has stripped some more mass out of the vehicle. It&#39;s not saying exactly how much, but the improvements come from using the brand&#39;s in-house seats, as well as weight savings in the electric motors and battery pack. There are new 18-inch wheels with a lower-rolling-resistance tire that contribute about a two-percent improvement. A similar efficiency boost comes from the front motor&#39;s gearbox.\n And now a new Model S Long Range Plus will blend regenerative braking with friction braking to decrease energy losses. Tesla has also added a &#34;brake hold&#34; to the Model S, so you needn&#39;t keep your foot on the left pedal to keep the car stationary. (No joke, this is my absolute favorite convenience feature on any new car, so well done for adding it to the Model S, Tesla.)\n If the range bump isn&#39;t enough to tempt new buyers, Tesla has also dropped the price of the Model S again. Now a Long Range Plus will cost you $74,990, $5,000 less than before. (Tesla  also recently cut $2,000 from the price of the Model 3 and $5,000 from the Model X.) As we have learned during the company&#39;s  quarterly earnings reports, sales of the Model S sedan— first introduced eight years ago— have been falling for  several quarters thanks to the expiration of the IRS tax credit and cannibalization from the cheaper, newer Model 3 sedan.", "posttime": "2020-06-16 22:59:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,里程,cuts,model", "title": "特斯拉将Model S降价5000美元，将续航里程提高至402英里", "title_en": "Tesla cuts Model S price by $5k, bumps range to 402 miles", "transed": 1, "url": "https://arstechnica.com/cars/2020/06/tesla-cuts-model-s-price-by-5000-bumps-range-to-402-miles/", "via": "", "real_tags": ["特斯拉", "里程", "cuts", "model"]}, {"category": "", "categoryclass": "", "imagename": "b90971499e3f7c2cc0a1c7b527b25516.jpg", "infoid": 1006816, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据为时任局长迈克·庞皮欧(Mike Pompeo)和他的副手、现任局长吉娜·哈斯佩尔(Gina Haspel)准备的一份内部报告，2016年中情局绝密电脑黑客工具被盗是工作场所文化的结果，在这种文化中，中情局的精英电脑黑客“以牺牲自己系统的安全为代价，优先制造网络武器”。\n据称，这起泄密事件是由一名中情局员工在事件发生一年后发现的，当时维基解密(WikiLeaks)于2017年3月发布了这一信息。这个反保密组织将此次发布称为“Vault 7”，美国官员表示，这是中情局历史上最大规模的未经授权泄露机密信息的事件，导致中情局关闭了一些情报行动，并提醒外国对手注意中情局的技术。\n美国中央情报局(CIA)维基解密工作组(WikiLeaks Task Force)2017年10月发布的这份报告中，有几页被遗失或编辑过，报告描绘了一个更关心扩充网络武器库而不是保护这些工具安全的机构。报道称，设计和制造这些工具的特种部队内部的安全程序“非常松懈”。\n根据这份报告，如果没有维基解密的披露，中央情报局可能永远不会知道这些工具被盗了。“如果数据是为了州对手的利益而被窃取的，而不是公布的，我们可能仍然没有意识到损失，”特别工作组总结道。\n这份特别工作组的报告是由参议院情报委员会(Senate Intelligence Committee)成员罗恩·怀登(Ron Wyden)的办公室提供给“华盛顿邮报”的。怀登是参议院情报委员会的成员，他一直在敦促加强情报界的网络安全。他从司法部获得了这份经过编辑、不完整的副本。\n这起泄密事件发生近三年前，时任美国国家安全局(National Security Agency)承包商的爱德华·斯诺登(Edward Snowden)窃取并披露了有关NSA监视行动的机密信息。\n报告称，“鉴于美国其他政府机构接连遭到入侵，中情局行动太慢，未能建立起我们知道是必要的保障措施。”报告发现，“我们的大多数敏感网络武器没有分区，用户共享系统管理员级别的密码，没有有效的可移动媒体(拇指驱动器)控制，用户可以无限期地获得历史数据。”\n特别工作组指出，他们无法确定入侵的确切规模，因为中情局黑客团队不需要监控谁使用了其网络，但得出结论，这名员工窃取了多达34TB的信息，约合22亿页。\n中情局新闻秘书蒂莫西·巴雷特(Timothy Barrett)拒绝直接对该报告发表评论。他说：“中央情报局致力于融入一流的技术，以保持领先地位，并防御不断演变的威胁。”\n这些黑客工具是由中情局网络情报中心(Center For Cyber Intelligence)开发的，中情局最老练的黑客在那里设计了进入难以渗透的网络的方法，例如，秘密激活外国目标平板电脑上的摄像头和麦克风，或者窃取外国对手先进武器系统的设计方案。\n一位熟悉特别工作组调查结果的前高级情报官员表示，这些员工不断面临压力，要求他们发现商业软件和其他技术中的漏洞。\n特别工作组承认这是“为了满足日益增长的和关键的任务需求”的努力，他们指责这是“日常安全实践”松懈的原因。\n这份报告是在对曾在该中心工作的前中央情报局雇员约书亚·舒尔特(Joshua Schulte)的刑事审判中作为证据提出的，他被控窃取黑客工具并将其提供给维基解密(WikiLeaks)。\n舒尔特已经提出无罪抗辩，特别工作组的调查结果也在他的辩护中发挥了作用。他的律师在今年早些时候的一次审判中辩称，计算机网络的安全性非常差，数百名员工或承包商中的任何一人都可能接触到舒尔特所获得的相同信息。\n陪审团在3月份未能就舒尔特是否将这些工具提供给维基解密达成裁决。检察官表示，他们打算今年再次审判舒尔特。\n该报告区分了中情局的“企业信息技术系统”和专门的“任务系统”，前者占中情局计算机网络的绝大多数，后者包括存放黑客工具的系统。\n这位前情报官员和其他人一样，由于主题的敏感性而不愿透露姓名。他表示，任务系统与企业系统是分开的，企业系统遵循内部威胁检测的“黄金标准”。特别工作组表示，中情局在保护其企业系统方面一直是“早期的领导者”。\n这位前官员说，他同意特别工作组的大部分调查结果，但他反对中情局没有强调计算机安全或精英黑客小组在保护机密方面漫不经心的断言。\n这位熟悉该部门运作的前官员表示：“我们没有努力让我们的所有系统达到最高网络安全水平的想法或断言将是一种错误的说法。”\n这位前官员说，该中心的任务系统设在一座单独的建筑里，而不是在中央情报局总部，访问受到高度限制。\n但这位前官员说，中情局黑客认为，“审计”网络的能力，知道谁在登录，以及他们的活动，比实际情况更好、更详细。\n这位前官员补充说，计算机网络也是由承包商维护的。“运营该单位的人与运营和维护该网络的人之间存在误解。”\n这次入侵发生在中情局强调计算机安全(包括任务中心网络)的重组不到六个月。\n“最难做的事情就是保护自己的人不受攻击，”另一名熟悉此次入侵事件的前情报官员表示。\n怀登表示，2014年，国会赋予国土安全部(Department Of Homeland Security)要求联邦机构达到最低网络安全标准的权力，但免除了间谍机构的责任，理由是作为国家最有价值机密的守护者，他们将格外小心地保护自己的系统。怀登周二在给国家情报总监约翰·拉特克利夫(John Ratcliffe)的一封信中写道：“现在很明显，免除情报界遵守联邦网络安全基线要求是一个错误。”\n一些分析人士指责国会没有采取更多措施，要求情报机构对他们的失误负责。约翰·霍普金斯大学(Johns Hopkins University)高级国际研究学院(School Of Advanced International Studies)信息安全教授托马斯·里德(Thomas Rid)表示，2017年Equifax信用报告机构被入侵一事，受到的审查远远超过美国国家安全局(NSA)和中央情报局(CIA)。\n随着越来越多的数据被放到网上，9·11事件后，各机构之间共享情报的障碍降低了。2001年11月11日，袭击、入侵事件频繁发生。\n2010年，时任陆军情报分析师的切尔西·曼宁(Chelsea Manning)向维基解密提供了数十万份外交电报和军事文件。2013年，斯诺登向记者提供了有关敏感监控项目的大量数据。\n里德说：“你会认为这些事件会给情报界和整个美国安全机构敲响警钟。”“但看起来，地球上最强大、资金最充裕的情报机构无法阻止自己的数据流失。”\n特别工作组发现，维基解密显然没有获得包含在“黄金文件夹”中的更敏感的信息，该文件夹包括黑客工具的“最终版本”和源代码。", "note_en": "The theft of top-secret computer hacking tools from the CIA in 2016 was the result of a workplace culture in which the agency’s elite computer hackers “prioritized building cyber weapons at the expense of securing their own systems,” according to an internal report prepared for then-director Mike Pompeo as well as his deputy, Gina Haspel, now the current director.\n The breach — allegedly by a CIA employee — was discovered a year after it happened, when the information was published by WikiLeaks, in March 2017. The anti-secrecy group dubbed the release “ Vault 7,” and U.S. officials have said it was the biggest unauthorized disclosure of classified information in the CIA’s history, causing the agency to shut down some intelligence operations and alerting foreign adversaries to the spy agency’s techniques.\n  The October 2017 report by the CIA’s WikiLeaks Task Force, several pages of which were missing or redacted, portrays an agency more concerned with bulking up its cyber arsenal than keeping those tools secure. Security procedures were “woefully lax” within the special unit that designed and built the tools, the report said.\n   Absent WikiLeaks’s disclosure, the CIA might never have known the tools had been stolen, according to the report. “Had the data been stolen for the benefit of a state adversary and not published, we might still be unaware of the loss,” the task force concluded.\n The task force report was provided to The Washington Post by the office of Sen. Ron Wyden (D-Ore.), a member of the Senate Intelligence Committee, who has pressed for stronger cybersecurity in the intelligence community. He obtained the redacted, incomplete copy from the Justice Department.\n The breach came nearly three years after Edward Snowden, then a National Security Agency contractor, stole and disclosed classified information about the NSA’s surveillance operations.\n  “CIA has moved too slowly to put in place the safeguards that we knew were necessary given successive breaches to other U.S. Government agencies,” the report said, finding that “most of our sensitive cyber weapons were not compartmented, users shared systems administrator-level passwords, there were no effective removable media [thumb drive] controls, and historical data was available to users indefinitely.”\n  The task force noted that it could not determine the precise size of the breach because the CIA hacking team did not require monitoring of who used its network, but concluded that the employee stole as much as 34 terabytes of information, or about 2.2 billion pages.\n Timothy Barrett, the CIA press secretary, declined to comment directly on the report. “CIA works to incorporate best-in-class technologies to keep ahead of and defend against ever-evolving threats,” he said.\n  The hacking tools were developed by the CIA’s Center for Cyber Intelligence, where the agency’s most sophisticated hackers devised ways to gain access to hard-to-penetrate networks, for instance, to secretly activate the camera and microphone on a foreign target’s tablet, or steal the design plans for a foreign adversary’s advanced weapons systems.\n   Those employees are under constant pressure to find vulnerabilities in commercial software and other technology, said a former senior intelligence official familiar with the task force’s findings.\n The task force acknowledged the drive “to meet growing and critical mission needs,” which it blamed for the laxness in “day-to-day security practices.”\n  The report has been introduced as evidence in the criminal trial of Joshua Schulte, a former CIA employee who worked in the center and is accused of stealing the hacking tools and giving them to WikiLeaks.\n  Schulte has pleaded not guilty, and the task force findings have figured in his defense. His attorneys argued at a trial earlier this year that security on the computer network was so poor that any one of hundreds of employees or contractors may have had access to the same information Schulte did.\n  A jury  failed to reach a verdict in March on whether Schulte gave the tools to WikiLeaks. Prosecutors have said they intend to try Schulte again this year.\n  The report distinguishes between the CIA’s “enterprise information technology system,” which accounts for the vast majority of the agency’s computer network, and specialized “mission systems,” including the one that housed the hacking tools.\n The former intelligence official, who, like others, spoke on the condition of anonymity because of the subject’s sensitivity, said the mission systems are segregated from the enterprise systems, which follow the “gold standard” for insider threat detection. The task force said the CIA had been “an early leader” in securing its enterprise system.\n The former official said he agreed with most of the task force’s findings, but he objected to the assertion that the CIA hadn’t emphasized computer security or that the elite hacking unit was cavalier about protecting its secrets.\n   “The idea or the assertion that we weren’t working to get all of our systems to the highest level of cybersecurity would be a false claim,” according to the former official who was familiar with the unit’s operations.\n The center’s mission system was housed in a separate building not at CIA headquarters, and access was highly restricted, the former official said.\n But the CIA hackers presumed that the ability to “audit” the network, to know who was logging on and their activities, was better and more detailed than it actually was, the former official said.\n The computer network also was maintained by contractors, the former official added. “There was a misunderstanding between the people who ran the unit and people who ran and maintained the network.”\n  The breach occurred less than six months into a CIA reorganization that emphasized computer security, including for the mission center networks.\n  “The hardest thing to do is protect against your own people,” said another former intelligence official who is familiar with the breach.\n Congress in 2014 gave the Department of Homeland Security the power to require federal agencies to meet minimum cybersecurity standards, but exempted the spy agencies, reasoning that as guardians of the nation’s most valuable secrets they would take extra care to secure their systems, Wyden said. “It is now clear that exempting the intelligence community from baseline federal cybersecurity requirements was a mistake,” Wyden wrote in a letter Tuesday to Director of National Intelligence John Ratcliffe.\n  Some analysts fault Congress for not doing more to hold intelligence agencies to account for their lapses. The 2017 breach of the Equifax credit reporting agency got far more scrutiny than those of the NSA and CIA, said Thomas Rid, an information security professor at Johns Hopkins University’s School of Advanced International Studies.\n  As more and more data was placed online and the barriers to sharing intelligence among agencies fell after the Sept. 11, 2001, attacks, breaches occurred more often.\n In 2010, Chelsea Manning, then an Army intelligence analyst, gave hundreds of thousands of diplomatic cables and military files to WikiLeaks. In 2013, Snowden provided troves of data to journalists about sensitive surveillance programs.\n “You’d think that these incidents would be major wake-up calls for the intelligence community and the entire American security establishment,” Rid said. “But it appears that the most powerful and best funded intelligence agencies on the planet are unable to stop the bleeding of their own data.”\n WikiLeaks apparently did not obtain even more sensitive information contained in a “Gold folder” that included “final versions” of the hacking tools, as well as source code, the task force found.", "posttime": "2020-06-16 22:40:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,黑客,黑客工具,cia,中情局", "title": "开发黑客工具的中情局精英单位未能保护自己的系统", "title_en": "Elite CIA unit that developed hacking tools failed to secure its own systems", "transed": 1, "url": "https://www.washingtonpost.com/national-security/elite-cia-unit-that-developed-hacking-tools-failed-to-secure-its-own-systems-allowing-massive-leak-an-internal-report-found/2020/06/15/502e3456-ae9d-11ea-8f56-63f38c990077_story.html", "via": "", "real_tags": ["开发", "黑客", "黑客工具", "cia", "中情局"]}, {"category": "", "categoryclass": "", "imagename": "5384dd9a316130005eb7c044edaa090a.jpg", "infoid": 1006815, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我对编码、自我和注意力的思考。通过了解自我和注意力之间的联系，我学会了如何摆脱自己的方式。\n如果说成为一名优秀的软件工程师意味着成为一名优秀的思想家，那么成为一名优秀的软件工程师应该意味着改进我们的思维方式……。对吗？嗯，说我花了十多年的编码时间才弄明白这一点，这可不算什么丢脸的事。最终将我的注意力集中在改进我的思维方式上，而不是学习另一个库、框架或编程语言。\n在某种程度上，阻碍我成长的事情与解决问题无关，而是与我投入工作时脑海中实际发生的事情有关，我应该参与到一个问题中去。\n在元级别上，编码是关于进行观察和识别关系。这些观察结果使我们几乎没有要检验的假设。所以这是关于拥有，嗯，🧐…，这里的这个东西可能就是导致那里的那个东西🤔&34；，片刻的原因。再三。例如，当这些小假设中的一个被证明是错误的时，我们就不会以自己的方式行事。\n在我似乎做对了的日子里，解决问题感觉几乎毫不费力。它是无摩擦的。问题的大小、熟悉程度或复杂程度没有区别。我的胃里没有结。我仍然很好奇。我对这件事去的任何地方都持开放态度。因此，迭代我的解决方案是有趣的、令人兴奋的和令人难以置信的回报。\n我现在很清楚，这不是关于我所知道的，而是我如何看待这几天的不同。\n所以我要问的两个问题是：(1)我怎样才能有比坏日子更多的好日子？还有，(2)在我的好日子里，我到底做了什么不同的事情？\n下面是我所学到的关于编码的元认知。或者简单地说，我对自己在编码时的思考，以及如何对其进行优化。\n在硅谷，我们谈论了很多关于分心的话题。分心的代价是显而易见的，众所周知，注意力和注意力是影响工程产出的主要因素。更少的分心意味着更多的生产、更好的软件、更好的会议和更好的团队。等等。\n然而，大部分的焦点都集中在我们称之为外部干扰的东西上。我们的电话、过多的会议、开放的办公室、闲暇时间、电子邮件等等。这些外部干扰无疑是主要因素。但我要说它们是可以控制的分心之物。我们可以把手机收起来。我们可以找个安静的地方工作，甚至把专门的时间用来专注于我们的日历。\n尽管如此，我还是不得不面对这样一个现实，即处理外部干扰是最容易的部分。我最大的干扰一直伴随着我。它在我的脑海里。这是我的自负。\n我的自尊心在我的工作和我的身份之间建立了一条紧密的纽带。把我的自我价值和我的工作做得有多好联系起来。这就需要跟踪我的表现。为了记分。制造消耗宝贵资源的心智过程，这会使你很难继续完成任务。\n一旦我们坐下来做任何对我们重要的事情，得分过程就开始了，分心也就开始了。\n我可能会突然有种想吃零食的冲动。或者下意识地暂时忽略问题中不确定/困难的部分，转而专注于容易或更熟悉的部分。然后，在这些分心的事情之后，会有这样的想法：我现在应该已经弄明白了。或者我是否足够优秀，可以这样做？或者，如果这中断了生产，他们会怎么看我？\n这是自我分心。这是关于将不确定性推迟到晚些时候，以换取暂时的缓解。这是为了保护我们的自我免受感知到的威胁。像棘手的问题，公开失败的可能性，或负面反馈，当它们与我的身份联系在一起时，都会成为威胁。\n这是行动中的自我分散。它在我们检查手机之前、期间和之后都在那里。\n没有任何概念能像相对剥夺理论那样清楚地显示出自我分心的普遍力量。\n记者马尔科姆·格拉德威尔(Malcolm Gladwell)在一场名为“为什么你不应该上哈佛大学”的演讲中，研究了美国各地大学的STEM学位完成率，发现了一个令人惊讶的模式。利率本身并不是什么有趣的事情。事实是，学生排名一直在预测哪些学生最终会获得学位。不管这所大学多么“有声望”，毕业率都是始终如一的。排在班级前3位的学生获得了超过一半的学位，排在后3位的学生获得的学位不到20%，而排在中间3位的学生获得了另外30%的学位。\n这个比率怎么可能保持不变呢？为什么“聪明”的学校不培养更多的毕业生，而“笨”的学校不培养更少的毕业生呢？\n常识会表明，在一所筛选全国最聪明学生的学校，毕业率应该有更高(或更低)的学生数量。对吗？但事实并非如此！它们是一样的。\n马尔科姆指出，在STEM中坚持不懈不仅仅是认知能力的函数--它还取决于你在班级中的相对地位。你已经被证明是这个星球上最聪明的学生之一，这并不重要。我们仍然根据我们的排名而不是我们的能力来限制我们的努力。\n心理学家称这种现象为相对剥夺。尖子生说服其他人停止尝试。或者，伟大的工程师说服其他人停止尝试。\n这是行动中的自我分散。自我比较决定努力。如果我们觉得我们领先，我们就会继续努力。如果我们觉得自己不值得，我们就会认为不值得努力。\n我们都知道不可能在我们参加的每一场比赛中都领先。有些问题我们都不知道答案。在一些房间里，我们不知道发生了什么。然而，这些都是最重要的竞选、最重要的问题和需要进入的重要房间。\n“这一点我说得再强烈也不为过：不要拿自己和别人比较。做真实的自己，继续全力以赴地学习。“--池田大作”青春讨论“。\n因此，与其取消与我们聪明的朋友的好友关系，不如看看我们如何在潜意识中停止节流自己的表现。\n在禅宗佛教中，有一个强大的心理模型，它出色地处理了这个自我分心的问题。它被称为Shoshin，或初学者的头脑。\n初学者的想法是拒绝专家的心态，拥抱一个终生的学生。\n专业知识的问题不在于你知道多少，这部分显然是好的。问题是，采用专家的思维方式会使学习曲线急剧变平。\n更多的专业知识带来的判断和期望减缓了学习过程。我们开始对现实做出预测，而不是让现实给我们带来惊喜。\n一旦我们的专家预测开始与现实不符，可怕的事情就开始发生在我们清晰思考的能力上。心理学家称之为动机推理。我们不再只是观察然后假设，我们甚至在看证据之前就开始选择立场(因为这就是我现在是😌的水平)。我们开始忽略与我们的“专家”判断不符的证据。我们变得很难共事，因为任何不像我一样致力于维护自我的人都会成为敌人。\n具有讽刺意味的是，从我记事起，我就一直认为这是掌握的目标。我以为这种“知道”就是“资深”、“专业”或“专家”的意思。我错了。\n我现在明白了，“职业选手只是知道如何优雅地从错误中恢复过来的业余爱好者。”--凯文·凯利(Kevin Kelly)。\n仅此而已。专业人士只需缩短反馈循环即可。他们犯错误，承认错误，从中吸取教训，然后毫不犹豫地继续下去。\n努力避免犯错误是激发这种有动机的推理的原因。但在现实中，它所做的一切就是耗费了本应专注于学习的精力，并将其浪费在试图保持我们被误导的专家身份和不正确(或充其量是不完整的)偏见上。\n“自我和掌握存在于同一连续体的两端。越是偏向自我，离掌握就越远“--杨三生。\n初学者的头脑是这个星球上最强大的思考工具。这是元认知蓝图，它允许建立信心，同时避免自我分心。\n初学者的头脑接受这样一个事实，即绝对的知识是无限的，因此记分是浪费时间。因此，他没有努力争取专业知识，而是接受了愚蠢的做法。她努力像学生一样处理每一个问题、谈话或任务。就像海绵一样。准备好吸收现实。准备好大吃一惊了。做好了迅速失败的准备。准备好快速学习。\n我每周都试图提醒我的团队，我们都是白痴，一无所知，但我们很幸运地知道了这一点。&纳西姆·塔勒布(Nassim Taleb)--纳西姆·塔勒布(Nassim Taleb)。\n初学者的思想反映了科学本身的创始原则，我不认为这是巧合。\n现代科学是基于拉丁文的戒律“无知”，我们不知道。它假定我们不是什么都知道。更重要的是，它承认，随着我们获得更多的知识，我们认为我们知道的事情可能会被证明是错误的。没有任何概念、思想或理论是神圣的和不可挑战的。&尤瓦尔·诺亚·哈拉里(Yuval Noah Harari)，萨皮恩斯(Sapiens)。\n掌握仅仅是动力的积累，而不是知识的积累。就像骑自行车一样，速度不会储存起来以备日后使用。在“左踏板”和“右踏板”或“知道”和“不知道”之间摇摆，只会产生动量，使你在前进时更容易踩踏板。\n认为速度正在“积累”，就是认为你可以停止踩踏板，以某种方式保持速度。然而，这正是这位专家开始想的。随着他变得更加教条，他失去了动力，学习曲线开始变得平坦。\n另一方面，学生知道不能把单纯的速度积累和知识积累混为一谈。专家们开始滑行，但学生继续踩脚踏板。这是唯一的区别。\n“科学更多的是一种思考方式，而不是一种知识体系。”--卡尔·萨根(Carl Sagan)。\n在投球的心理ABC一书中，世界著名的棒球心理学家和投球教练H·A·多夫曼(H.A.Dorfman)说，纪律是把任务放在中心位置。\n多夫曼描述说，在投手的世界里有两个地点：投手丘上和投手丘外。当她在投手丘上时，她只能考虑两件事：投球选择和投球位置。如果她发现自己在想别的事情--她应该离开投手丘。\n自负的把戏总是一样的。让它变得个人化。把它写在我身上。把我放在中心位置。因此，当我们坐下来解决问题时，诀窍就是只问自己与问题相关的问题。这些是&#34；或&#34；什么类型的问题。我们必须避免问个人类型的问题。因此，我们没有去想是不是我造成了这个错误？而是问了这个错误在哪里？&#34；。\n明智之处在于认识到这些个人问题是100%分散注意力的。意识到这种自我评估并不能让我们真正解决问题。因此，我们的目标必须是把任务放在中心位置。在我们和任务之间拉近距离。\n当某样东西在外面时，很难使它个人化，因为它不是我的球，而是球。这不是我的问题，而是问题所在。这不是我的主意，只是我的主意。这不是我的拉式请求，只是拉式请求。\n每当我发现我的自我在做它的事情时，我就故意制造这种心理距离。这种简单的重新定位消除了自我分心。如果不是我的，就不能个性化。结果是更专注，不间断地学习，更好的协作和出色的工作。\n假期可以治愈以自我为中心的心态，因为要想把工作做好，你必须关注任务本身。&大卫·布鲁克斯，“第二座山”\n处理自我分心不仅提高了我的注意力，还教会了我喜欢解决问题的过程。它教会了我热爱和尊重学习过程。因此，我的工作效率更高了。我不那么焦虑了。我是个更好的队友。我是更好的朋友，更好的思想家。\n在某种程度上，它把我脖子上的自我强加的靴子拿掉了，这让我有了空间带回我小时候第一次学习编程时的乐趣和兴奋。回到我还是个彻头彻尾的笨蛋的时候。\n现在，我的新目标不是焦急地等待我最终可以称自己为专家的那一天，而是尽一切可能顽固地保持学生身份。\n初学者心目中有很多可能性，但行家心目中的可能性却很少。--禅宗大师铃木顺约\n感谢您抽出时间阅读这篇文章。这里就我一个人吗？或者这是你也考虑过的事情吗？自我分心是你在自己身上注意到的吗？或者，有没有其他，也许更突出的，会让你分心的东西？\n我很乐意听到任何关于你如何处理内部干扰和保持工作状态的小贴士。\n特别感谢这些令人敬畏的人类花时间审阅了这篇文章的早期草稿：埃里克、胡安、阿尼莎、朱利安和丹。\n应用程序开发人员·工程经理·设计师·讲师·作家·以前的@Sosh(被@Postmate收购)·通常是一个乐观主义者。联系我@JoseBrowneX", "note_en": "My thoughts on coding, ego and attention. How I learned to get out of my own way by learning about the link between ego and attention.\n  If being a good software engineer means being a good thinker, then becoming a better one should mean improving the way we think... right? Well,  no little shame in saying that it&#39;s taken me more than a decade of coding to get this. To finally focus my attention on improving the way I think instead of learning yet another library, framework or programming language.\n At a certain point, the things that got in the way of my growth had  nothing to do with problem solving and  everything to do with what was actually happening in my mind when I  was engaged should have been engaging with a problem.\n On a meta-level, coding is about making observations and identifying relationships. These observations result in little hypotheses for us to test out. So it’s about having the, &#34;Hmm 🧐..., this thing over here might be what&#39;s causing that thing over there 🤔&#34;, moments. Over and over. Without getting in our own way when, for example, one of these little hypotheses gets proven false.\n  On days when I seem to get this right, problem solving feels almost effortless. It&#39;s frictionless. The size, familiarity, or complexity of the problem makes no difference. There&#39;s no knot in my stomach. I remain curious. I remain open to wherever this thing goes. As a result, iterating my way to solutions is fun, exciting and incredibly rewarding.\n  It’s clear to me now that it&#39;s not about  what I know, but rather  how I think that&#39;s different on these days.\n So the two questions for me are: (1) How can I have more good days than bad ones? And, (2) what exactly am I doing differently on my good days?\n What follows is what I&#39;ve learned about the metacognition of coding. Or put simply, my thinking about my thinking while coding and how to optimize it.\n   In Silicon Valley, we talk a lot about distraction. The cost of distraction is clearly felt and it’s well understood that attention and focus are major factors to engineering output. Less distraction means more production, better software, better meetings and better teams. Etc etc.\n However, most of the focus has been on what we’ll call  external distractors. Our phones, excess meetings, open offices, slack, email, etc. These external distractors are without a doubt major contributors. But I would say they’re manageable distractions. We can put our phones away. We can find a quiet place to work or even block off dedicated time for focus on our calendar.\n Despite all this, I&#39;ve had to come to grips with the reality that dealing with external distractors was the easy part. My biggest distractor is with me all the time. It’s in my head. It’s my ego.\n My ego creates a tight bond between my work and my identity. Linking my self worth to how well I do my job. This then creates the need to track my performance. To keep score. Spinning up mental processes that consume valuable resources which make staying on task very difficult.\n As soon as we sit down to do anything that matters to us, the scoring process starts and distraction begins.\n I might suddenly feel an urge to grab a snack. Or subconsciously ignore that uncertain/hard part of the problem for now and instead focus on the easy or more familiar parts. These distractions are then followed up with thoughts like: &#34;I should have figured this out by now.&#34;, or &#34;Am I good enough to do this?&#34; or &#34;What will they think of me if this breaks production?&#34;.\n This is ego distraction. It’s about putting off uncertainty till later to buy temporary relief.  To protect our ego from a perceived threat. Things like hard problems, the possibility of failing publicly, or negative feedback all become threats when they’re linked to my identity.\n This is ego distraction in action. It’s there before, during and after we check our phones.\n  No concept shows the universal power of ego distraction as clearly as the phenomenon known as the  Relative Deprivation Theory.\n In a talk called &#34;Why you shouldn&#39;t go to Harvard&#34; journalist Malcolm Gladwell finds a surprising pattern when he looked at STEM degree completion rates at universities all over the country. The rate itself is not what&#39;s interesting. It’s the fact that student ranking consistently predict which students end up with degrees. Regardless of how “prestigious” the university, the graduation rate is consistent. Students ranked in the top 3rd of the class get more than half the degrees, students in the bottom 3rd get less than 20 percent of the degrees while the middle 3rd share the other 30%.\n   How is it possible that this rate stays the same? Why don’t the “smarter” schools produce more graduates and “dumber” schools less?\n Common sense would suggest that the completion rate at a school that filters for the &#34;smartest&#34; students in the country should have a higher (or lower) amount of students who finish. Right? But nope! They’re the same.\n Malcolm makes the case that, &#34;Persistence in STEM is not simply a function of cognitive ability - it&#39;s a function of your relative standing in your class&#34;. It doesn&#39;t matter that you&#39;ve already proven to be one of the smartest students on the planet. We still throttle our effort based on where we ranked instead of how capable we are.\n Psychologists call this phenomenon  Relative Deprivation. Top students convincing everyone else to stop trying. Or, great engineers convincing the rest to stop trying.\n This is ego distraction in action. Self comparison determining effort. If we feel like we’re ahead we continue to put in the effort. If we feel like we’re not, we determine it’s not worth the effort.\n We all know it’s impossible to lead every race we’re in. We all won’t know the answer to some questions. In some rooms, we’ll have no idea what’s going on. Yet those are the most important races, the most important questions to hear and the important rooms to be in.\n “I cannot say this too strongly: Do not compare yourselves to others. Be true to who you are, and continue to learn with all your might.” ―  Daisaku Ikeda,  Discussions on Youth\n So, instead of unfriending our &#34;smart&#34; friends, here&#39;s how we stop subconsciously throttling our performance.\n  In Zen Buddhism, there&#39;s a powerful mental model that deals with this problem of ego distraction brilliantly. It&#39;s called  shoshin, or &#34;Beginner&#39;s Mind&#34;.\n Beginner&#39;s Mind is about rejecting the expert mindset and embracing one of the life long student.\n The problem with expertise isn’t how much more you know, that part is obviously good. The problem is the sharp flatting out of the learning curve that comes with adopting the expert’s mindset.\n  With more expertise comes judgments and expectations that slows the learning process. We start making predictions about reality instead of allowing reality to surprise us.\n As soon as our expert predictions start to differ from reality terrible things begin to happen to our ability to think clearly. Psychologists call it &#34;motivated reasoning&#34;. Instead of just making observations and  then hypothesizing, we start picking sides before even looking at the evidence (because that’s how good I am now 😌). We start to ignore evidence that doesn&#39;t align with our “expert” judgments. We become difficult to work with because anyone who is not as committed as I am to the preservation of my ego becomes the enemy.\n The irony is that for as long as I can remember I thought this was the goal of mastery. I thought that this “knowing” was what it meant to be “senior”, “pro” or “expert”. I was wrong.\n I know now that, “Pros are just amateurs who know how to gracefully recover from their mistakes.” ―  Kevin Kelly\n That’s all it is. Pros just shorten the feedback loop. They make a mistake, own it, learn from it, and continue without hesitating.\n Trying to avoid making mistakes is what activates this motivated reasoning. But in reality all it does is take energy that should be focused on learning and wastes it trying to preserve our misguided expert identities and incorrect (or at best incomplete) biases.\n  “Ego and mastery exist on opposite ends of the same continuum. The more one leans towards ego, the further one is from mastery” ―  Sam Yang\n  Beginner’s Mind is the most powerful thinking tool on the planet. It’s the metacognitive blueprint that allows for the building of confidence while avoiding egoic distractions.\n Beginner&#39;s mind accepts the fact that absolute knowledge is infinite and thus keeping score is a waste of time. So instead of striving for expertise, he embraces idiocy. She strives to approach every problem, conversation, or task like a student. Like a sponge. Ready to absorb reality. Ready to be surprised. Ready to fail quickly. Ready to learn quickly.\n &#34;I try to remind my group each week that we are all idiots and know nothing, but we have the good fortune of knowing it.&#34; ―  Nassim Taleb\n  I don&#39;t think it&#39;s a coincidence that Beginner&#39;s Mind mirrors the founding principle of science itself.\n &#34;Modern science is based on the Latin injunction  ignoramus - &#39;we do not know&#39;. It assumes that we don&#39;t know everything. Even more critically, it accepts that the things that we think we know could be proven wrong as we gain more knowledge. No concepts, idea, or theory is sacred and beyond challenge.&#34; ―  Yuval Noah Harari,  Sapiens\n   Mastery is simply the accumulation of momentum, not the accumulation of knowledge. Just like riding a bike, speed isn’t stored up for use at a later time. Oscillations between “Left Pedal” &amp; “Right Pedal”, or “knowing” &amp; “not knowing”, only builds momentum which makes pedaling easier as you go.\n To think that speed is being “accumulated” is to think that you can stop pedaling and somehow maintain speed. Yet this is exactly what the expert begins to think. As he becomes more dogmatic, he loses momentum and the learning curve begins to flatten.\n On the other hand, the student knows not to confuse the mere accumulation of speed with the accumulation of knowledge. The experts starts coasting but the student continues to pedal. That’s the only difference.\n “Science is a way of thinking much more than it is a body of knowledge.” ―  Carl Sagan\n  In &#34;The Mental ABC’s of Pitching&#34;, world-renowned baseball psychologist and pitching coach H. A. Dorfman says that &#34;The Discipline is to put the task at the center&#34;.\n Dorfman describes there being two locales in a pitcher&#39;s universe: on the mound and off the mound. When she&#39;s on the mound she can only be thinking about two things: pitch selection and pitch location. If she finds herself thinking about anything else - she should  get off the mound.\n  The Ego&#39;s trick is always the same. Make it personal. Make it about me. Put me at the center. So when we sit down to solve a problem the trick is to only ask ourselves problem related questions. These are &#34;the&#34; or &#34;what&#34; type questions. We must avoid asking the personal &#34;I&#34; or &#34;me&#34; type questions. So instead of thinking &#34;Did   I cause the bug?&#34;, we instead ask &#34;Where is   the bug?&#34;.\n The wisdom is in realizing that these personal questions are 100% distraction. To realize that this self-evaluation gets us no closer to actually solving the problem. So our objective must be to do the work of keeping the task at the center instead. To creating distance between us and the task.\n   When something is &#34;out there&#34; it&#39;s hard to make it personal because it&#39;s not  my ball, it&#39;s  the ball. It&#39;s not  my problem, it&#39;s  the problem. It&#39;s not  my idea, just  the idea. It&#39;s not  my Pull Request, just  the Pull Request.\n I deliberately create this psychological distance whenever I catch my ego doing its thing. This simple reorientation disarms ego distraction. If it’s not mine it can’t be personalized. The results is more concentration, uninterrupted learning, better collaboration and great work.\n Vocation can be a cure for self-centeredness, because to do the work well you have to pay attention to the task itself.&#34; ―  David Brooks, The Second Mountain\n Dealing with ego distraction has not only improved my attention but taught me to love the problem solving process. It’s taught me to love and respect the learning process. As a result I’m more productive. I’m less anxious. I’m a better teammate. I’m a better friend and a better thinker.\n In a way, it’s taken the self-imposed boot off my neck which has allowed space to bring back the fun and excitement I used to have when I was first learning to code as a kid. Back when I was  actually a complete n0Ob.\n Now, instead of anxiously awaiting the day that I could finally call myself an &#34;expert&#34;, my new goal is to do everything possible to stubbornly remain the student.\n &#34;In the beginner&#39;s mind there are many possibilities, but in the expert&#39;s there are few.&#34; -  Shunryo Suzuki,  Zen Master\n  Thanks for taking the time to read this. Am I alone here? Or is this something you&#39;ve thought about as well? Is ego distraction something you&#39;ve noticed in yourself? Or are there other, perhaps more prominent, distractors that gets in your way?\n Would love to hear any tips for how you cope with internal distractions and stay on task.\n  Special thank you to these awesome humans for taking the time to review early drafts of this post:  Eric,  Juan,  Anisa,  Julian and  Dan\n Application Developer • Engineering Manager • Designer • Instructor • Writer • Formerly @Sosh (Acquired By @Postmates) • Generally an optimist.    Reach me  @JoseBrowneX", "posttime": "2020-06-16 22:21:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编码,ego,问题", "title": "论编码、自我与注意", "title_en": "On Coding, Ego and Attention", "transed": 1, "url": "https://josebrowne.com/on-coding-ego-and-attention/", "via": "", "real_tags": ["编码", "ego", "问题"]}, {"category": "", "categoryclass": "", "imagename": "47f693b15134dff3ce1e50d22c9a52fe.jpg", "infoid": 1006814, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这就是那些日子中的一天。您在浏览器中键入twitter.com，看到某人发布了一条关于如何使用Reaction Hook的新推文。但是，出于某种原因，您的公司或团队尚未切换到使用Hook。或者，可能您正在使用它们，但不是以一种新的“时髦”方式。也许你使用的是Vue.js或ANGLING，但是这些反应挂钩到处都是，几乎在你加热晚餐的时候就开始出现在你的微波炉上了。\n既然是这样的一天，你就会开始质疑你的代码库里的东西是不是正确的？你是不是应该用你刚刚读到的内容来重构这段逻辑呢？随着问题的解决，您开始想象这在您的代码中会是什么样子。\n现在，你突然有一种使用它的冲动。你让你的团队领导你的团队，或者向你的整个团队发送关于这种很酷的新做事方式的信息，然后你建议你开始使用它。\n不久前，@ThePracticalDev推特账号上出现了一本虚构的书的封面。回到2016年，以与今天的人们略有不同的方式取笑不断变化的JavaScript世界是一种时尚。\n嘘，我发明了时光机(别告诉任何人)！让我们快速回到2016年。呼！我们到了。JavaScript景观如下所示：\n如果您正在使用JavaScript框架或想要使用框架，您可能会选择Angular.js。但是，关于“天使2”的新闻几乎会让你重写一切。另外，这个新成员--React.js正在兴起并走向成熟，当然，还有Vanilla JS和无框架的人们。2016年，不使用框架仍是一种流行观点，但正在慢慢消退。\n知道了这一切，你会怎么做？你会选择哪条路？为什么？既然你来自未来，答案似乎是显而易见的--反应。但是，如果您在几年后决定使用Angular.js，您会忍不住想要使用新的Angular版本并重写代码。如果你选择使用REACTION，你将会是一个幸运的赢家，因为现在每个人都在乘坐REPACT火车。现在，您很想删除类组件，将功能组件与那些甜蜜的钩子一起使用，对吗？嗯，至少它不是一个全新的API来学习，就像使用Angular.js-角度2变化一样，对吗？\n我们现在选择什么或以前选择什么都无关紧要。我们仍然会受到诱惑，或者必须在以后重写代码。这样做的原因可能会有所不同：\n你觉得旧的解决方案不再适合你了，你想要一些新的东西。\n不断改进和出货一个新的、更好的版本深深植根于我们的行业之中。制定更高效、更简单、更美观、更健壮的解决方案的需求正紧跟着我们的脚步。破坏不断学习和进步的观念，这是与当今任何事情和每个人都背道而驰的。我现在不打算走这条路，但如果你想在未来听到更多关于这方面的消息，请考虑订阅这份时事通讯。\n必须学习新东西的想法是好的，我同意这一点，但你应该多久这样做一次？看看JavaScript的世界，一个新的想法、博客帖子、库、框架等等经常会出现。事情变得越来越糟糕，人们很快就会尝试采纳这一点。我并不是说你不应该采用新的东西，不应该考虑不同的方法来解决问题，一点也不！我正试着提出少做这件事的想法。\n让我们变得更加务实。我以前用过AXIOS，它很管用。你可以恰当地使用它，得到广泛的支持，有很多网点(GitHub明星)，等等。然后，我看到了一篇博客帖子，它告诉您替换AXIOS并使用您的获取逻辑。\n看了这篇博文的标题《用简单的自定义抓取包装器替换AXIOS》，让你从这篇博文一开始就经历了思考的过程，让你对自己的选择产生了质疑。\n我不会详细说明你是否应该这样做，因为帖子告诉你，帖子本身就做得很好。我可以帮你做基本的决策。你现在对AXIOS满意吗？如果答案是肯定的，那么最好不要考虑更换它的想法。AXIOS证明对你或你的团队来说困难吗？如果答案是肯定的，那么试着按照帖子告诉你的去做，看看效果如何。\n简而言之：不要上当炒作。试着“感受”什么对你管用，然后顺其自然。尽量不要屈服于华而不实的新推文，博客帖子，黑客新闻头条，关于你应该做什么或不应该做什么的流行标签。继续阅读，了解如何避免这种炒作驱动的开发。\n这种炒作在我们的行业里是很常见的。还记得NoSQL吗？或者当每个人都疯狂于微服务的时候？还是人工智能/机器学习的爆发？清单不胜枚举。人们对新的和突破性的技术和想法感到兴奋。高德纳(Gartner)的员工在描绘炒作周期方面做得非常出色：\n它展示了新技术和新兴技术的典型生命周期。你有没有认出你现在正在使用的任何东西，可能会落入图表的某个部分？艾曼制作了一个更详细的炒作循环图：\n当追逐最近的JS趋势时，回想一下这个斜率，它适合在哪里？\n炒作和刺激有时在生活中是有用的。没有它，生活将是平淡乏味的。追随炒作，时不时地跟上潮流，这可能是一种提神作用，但你应该总是先做研究。\n在尝试采用全新的炒作的库或框架时，请记住这一点。向您自己和您的团队提出以下问题：\n阅读博客帖子、推特和公告是有帮助的，但要想获得最佳体验，无论某件事是不是适合你，都要通过积累经验来实现。试着为你计划使用的东西建立一个原型。看看它如何与你正在做的其他事情“共舞”。\n如果你计划在团队层面上做一些事情，试试团队黑客马拉松。黑客马拉松是与你的团队一起测试新技术的一种很好的方式，也是一个你可以疯狂寻找解决方案的地方。然后，你可以和你的团队进行某种形式的回顾，讨论利弊。\n您当前的实施是否存在特定问题？如果是这样的话，测试一下新技术是否能解决这个问题。需要多长时间？学习它并重写您的解决方案是否值得呢？这会在多大程度上拖累你们团队的发展？\n如果你在一家小公司工作，或者在一个由经验不丰富的团队成员组成的团队工作，这个问题可能会很棘手。试着征求建筑师或高级工程师的意见。仅仅因为一些库很适合Airbnb和他们的网站，对你来说可能不是最好的，而且你可能忽略了它的某些方面。与有经验的人交谈有时是一种特权，但如果你有这种特权，就使用它吧！\n如果你是大四学生，试着和低年级的或经验比你少的人交谈。许多公司都在实施所谓的“反向指导”计划，即初级员工对公司的高级成员进行培训。高年级学生的经验换来了低年级学生的新视角。你会惊讶于你能学到和分享到多少东西。\n如果您喜欢这篇博客文章，请考虑订阅时事通讯或与您的朋友和同事分享：\n我刚刚发布了一篇关于如何应对JavaScript趋势和炒作的新帖子。你对这个话题有什么看法？https://t.co/LH11oINZl2。\n-尼古拉ĐUza(@nikolalsvk)2020年6月16日。\n作者尼古拉·鲁比(NikolaĐUza)在诺维萨德生活和工作，他用javascript和ruby构建了令人惊叹的东西。你可以在推特上关注他。\n只有当有新内容发布时，我才会给您发送电子邮件。没有垃圾邮件。随时取消订阅。", "note_en": "It is one of those days. You typed in  twitter.com inyour browser and you saw a new tweet from someone on how to use React Hooks.But, for some reason, your company or a team hasn’t switched to using Hooks.Or, maybe you are using them, but not in a new “trendy” way. Perhaps you areusing Vue.js or Angular, but these React Hooks are popping up everywhere, almoststarting to show up on your microwave when you are heating your dinner.\n Since it is one of those days, you start questioning whether what you have inyour codebase is right? Should you maybe refactor that piece of logic with whatyou just read? As the questions settle down, you start imagining how that wouldlook in your code.\n Now, you feel a sudden urge to use it. You ping your team lead or send amessage to your whole team about this cool new way of doing things, and yousuggest that you start using it.\n   Some time ago, a cover for an imaginary book surfaced on the  @ThePracticalDev Twitter account.Back in 2016, it was fashionable to make fun of the ever-changing world ofJavaScript in a bit of a different manner than folks do today.\n  Psst, I have invented the time machine (don’t tell anyone)! Let us quickly travelback in time to 2016. SWOOSH! We are there. JavaScript landscape looks like this:\n If you are using a JavaScript framework or want to use a framework,Angular.js is probably something you would choose. But, the news aboutAngular 2 that will make you rewrite almost everything is just around thecorner. Also, this new kid on the block - React.js is coming up and getting ripe.Of course, Vanilla JS and no-framework-folks are there. Not using a frameworkis still a popular opinion in 2016, but is slowly fading.\n Knowing all this, what would you do? Which path would you choose and why? Theanswer might seem obvious now that you come from the future - React. But if youdecided about Angular.js, a couple of years down the road, you will get tempted to use newAngular versions and rewrite your code. If you chose to use React, you’d be a luckywinner since everyone is riding the React train nowadays. Now, youget tempted to drop class components and use functional components with thosesweet, sweet hooks, right? Well, at least it is not a whole new API to learn aswith Angular.js - Angular 2 change, right?\n  It doesn’t matter what we choose now or what we chose back in the day.We will still get tempted or have to rewrite our code later down the road.Reasons to do it might vary:\n you feel the old solution is not working out for you anymore, and you want something new\n   Constant improvement and shipping a new, better version is planted deep insideour industry. The need to make more efficient, less complex, prettier, robustsolutions is breathing down our necks. To undermine the idea of continuouslearning and advancement is to go against everything and everyone these days.I am not going to go down that road right now, but please consider subscribingto the  newsletter if you want to hear more about this in thefuture.\n The idea of having to learn something new is good, and I agree with that, but howoften should you do that? Looking at the world of JavaScript, a new idea, blogpost, library, framework, and whatnot pops up very often. Things becometrending, and people quickly try to adopt that. I’m not saying you should notadopt new things and consider different approaches to a solution, not at all! Iam trying to propose the idea of doing that less often.\n Let us get more  pragmatic. I used axios before, and it works great. You cantest it properly, is widely supported, has a lot of internet points(GitHub stars), and so on. Then, I come across a blog postthat tells you to replace axios and roll your fetching logic.\n After reading the title of the blog post” Replace axios with a simple custom fetch wrapper”, it makes you go through the thought process from the start of this blog post.It makes you question your choices.\n  I won’t go into details whether you should or should not do as the post tellsyou, posts do that pretty well on its own. I can help you with the basicdecision making. Are you happy with axios right now? If the answer is yes, itis probably best to leave alone this idea of replacing it. Is axios provingdifficult for you or your team? If the answer is yes, then try to do what thepost tells you and see how that works out.\n In short: do not fall for the hype. Try to “feel” what works for you and gowith that. Try not to succumb to flashy new tweets, blog posts, Hacker News topposts, trending hashtags of what you should or should not do. Read on to findout how to avoid this Hype Driven Development.\n  The hype is something common in our industry. Remember NoSQL? Or when everyonewent crazy over microservices? Or the AI / Machine learning burst? The listgoes on and on. People get excited about new and breakthrough technologies andideas. Folks at Gartner did an excellent job of drawing a Hype Cycle:\n  It shows a typical life cycle of new and emerging technology. Do you recognizeanything that you are using right now that might fall into some part of thegraph?  Aymanmade a more detailed hype cycle graph:\n  Recall this slope when going for a recent JS trend, where does it fit in?\n  Hype and excitement are sometimes useful in life. Without it, life would be blandand boring. It can come as a refreshment to follow the hype and ride thebandwagon from time to time, but you should always do your research first.\n Remember this when trying to adopt a brand new hyped up library or a framework.Ask these questions to yourself and your team:\n  Reading blog posts, tweets, and announcements are helpful, but to bestexperience, whether something is for you is by getting experience in it. Trybuilding a prototype for what you are planning to use it. See how it ‘dances’with the rest of what you are doing.\n If you are planning to do something on the team level, try out team hackathons.Hackathons are a great way of testing new technology with your team, and aplace where you can go crazy with solutions. Then, you can have a retrospectionof some sort with your team, discussing the pros and cons.\n  Do you have a specific problem with your current implementation? If so, test outto see if the new technology does solve it. How much time will it take? Will itbe worth the cost of learning it and rewriting your solution to it? How much will it slowdown the development of your team?\n  This one might be tricky if you are working in a small company or a team ofnot so experienced team members. Try to look for an opinion from an architect or asenior engineer. Just because some library is working out nicely for AirBnB andtheir website, might not be the best for you, and you might have overlookedsome aspect of it. Talking to someone experienced is sometimes a privilege, butif you have it, use it!\n If you are a senior, try talking to a junior or someone less experiencedthan you. Many companies are running what is called” reverse mentoring”programs where juniors coach senior members of a company. Senior’sexperience is traded for a fresh perspective from a junior. You’d be amazed at howmuch you could learn and share.\n  If you liked the blog post, consider subscribing to the newsletter or share it with your friends and coworkers:\n I just released a new post on how to deal with JavaScript trends and hype. What are your thoughts on this topic? https://t.co/LH11oINZl2\n— Nikola Đuza (@nikolalsvk)  June 16, 2020\n   Written by   Nikola Đuza who lives and works in Novi Sad, building awesome things with JavaScript and Ruby.  You can follow him on Twitter.\n I will send you an email only when new content is posted. No spam. Unsubscribe at any time.", "posttime": "2020-06-16 22:21:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,javascript", "title": "不要跟随JavaScript趋势", "title_en": "Do Not Follow JavaScript Trends", "transed": 1, "url": "https://pragmaticpineapple.com/do-not-follow-javascript-trends/", "via": "", "real_tags": ["java"]}, {"category": "", "categoryclass": "", "imagename": "e288ebae83f7e65426ccf8525d6139e5.jpg", "infoid": 1006813, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新闻：挪威在受到挪威数据保护局的批评后，暂停了其冠状病毒接触者追踪应用Smittestopp，该机构表示，该国的低感染率意味着该应用程序侵犯隐私的行为不再合理。因此，这款应用程序将停止收集新的数据，到目前为止收集的所有数据都将被删除，处理这些数据的工作实际上会无限期暂停。\n背景资料：挪威的感染率稳定，是欧洲感染率最低的国家之一。然而，据当地报道，挪威公共卫生研究所(NIPH)的官员不同意这一决定。\nNIPH主任卡米拉·斯托尔滕贝格(Camilla Stoltenberg)周一在一份声明中表示：“有了这一点，我们为增加感染传播做好准备的一个重要部分就被削弱了，因为我们在开发和测试这款应用程序上浪费了时间。”“与此同时，我们抗击正在进行的感染传播的能力降低了。大流行还没有结束。我们在人群中没有免疫力，没有疫苗，也没有有效的治疗方法。如果没有Smittestopp应用程序，我们在预防可能在当地或全国范围内爆发的新疫情方面的装备将会减少。“。\n背景：随着病毒本身继续在世界各地起伏不定，新的接触者追踪应用程序正在看到喜忧参半的成功。挪威选择不使用谷歌和苹果开发的注重隐私的技术，其应用程序在MIT技术评论的Covid Tracking Tracker中的数据最小化和透明度标记上也失败了。\n然而，整个欧洲的情况并不都是一样的。意大利是欧洲大陆第一个遭受严重打击的国家，由罗马政府支持的接触者追踪应用Immuni最近发布，获得了相对积极的评价，并很快被能够下载它的意大利居民采用。Immuni确实使用了谷歌和苹果开发的技术。在追踪器数据库中，它在所有标准上都获得了满分，包括最小化和透明度。\n英国也有自己的挣扎，选择建立自己的集中式技术，而不是使用硅谷系统。据BBC报道，政府的联系人追踪应用预计最终将在6月或7月在全国范围内推出。缓慢且往往坎坷的开发过程让许多人对最终产品感到困惑和批评。\n全球对这些应用程序的反应导致人们对它们是否有助于在大多数国家抗击冠状病毒深表怀疑。这个问题有两个方面。许多人对这项全新技术的有效性和准确性表示怀疑。或许同样重要的是，公众对数字医疗监控的广泛担忧，以及这些应用是否会获得主流接受的不确定性，以及拯救生命和遏制疫情需要多广泛的采用。", "note_en": "The news: Norway is halting its coronavirus contact tracing app, Smittestopp, after criticism from the Norwegian Data Protection Authority, which said that the country’s low rate of infections meant that the app’s privacy invasions were no longer justified. As a result, the app will cease collecting new data, all data collected so far is being deleted, and work on it is effectively paused indefinitely.\n  The background: Norway’s infection rate is steady and among the lowest in Europe. However, officials at the Norwegian Institute of Public Health (NIPH) disagreed with the decision,  according to local reports.\n  “With this, we weaken an important part of our preparedness for increased spread of infection, because we lose time in developing and testing the app,” NIPH director Camilla Stoltenberg said in a statement on Monday. “At the same time, we have a reduced ability to fight the spread of infection that is ongoing. The pandemic is not over. We have no immunity in the population, no vaccine, and no effective treatment. Without the Smittestopp app, we will be less equipped to prevent new outbreaks that may occur locally or nationally.”\n  The context: New contact tracing apps are seeing mixed success as the virus itself continues to ebb and flow around the world. Norway opted against using privacy-focused technology developed by Google and Apple, and its app failed on marks of data minimization and transparency in MIT Technology Review’s  Covid Tracing Tracker.\n  However, the situation is not the same all across Europe. Italy was the first country in on the continent to be badly hit, and Immuni, the contact tracing app backed by the government in Rome, was released recently to relatively positive reviews and  quickly adopted by the Italian residents who are able to download it. Immuni does use the technology developed by Google and Apple. It received full marks on all criteria, including minimization and transparency, in the  tracker database.\n  The United Kingdom has had its own struggles, choosing to build its own centralized technology instead of using the Silicon Valley system. The government’s contact tracing app is expected to finally be launched nationwide by June or July,  according to the BBC. A slow and often rocky development process has left many confused and critical of the final product.\n  The reaction to these apps globally has led to profound skepticism about whether they will help fight the coronavirus in most countries. There are two sides to that question. Many wonder about the efficacy and accuracy of this brand-new technology. Perhaps just as important is the widespread public apprehension about digital medical surveillance, as well as uncertainty about whether the apps will gain mainstream acceptance and  just how widespread adoption needs to be to save lives and stop the pandemic.", "posttime": "2020-06-16 22:20:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,coronavirus,病毒,app,冠状病毒", "title": "挪威因隐私问题暂停冠状病毒应用程序", "title_en": "Norway Halts Coronavirus App over Privacy Concerns", "transed": 1, "url": "https://www.technologyreview.com/2020/06/15/1003562/norway-halts-coronavirus-app-over-privacy-concerns/", "via": "", "real_tags": ["程序", "病毒", "app", "冠状病毒"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006812, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，我一直在为文件同步解决方案而苦苦挣扎。起初，Dropbox很棒，但在过去的几年里，它们开始膨胀起来。我搬到了iCloud，但情况更糟。最后，几天前，在iCloud再次神秘崩溃后，我决定是时候尝试一些不同的东西了。\n我尝试了Syncthing，这是一种免费的开源替代方案。你知道吗？这是一种解放。理智、简单、可靠、特色。它带来了使用的乐趣，让你相信文明的崩溃可以慢一点。\n当计算机产品不需要处理公司的废话，不需要宣传品牌或向用户推销时，它们可以变得多么伟大，这是令人惊讶的。坦率地说，我几乎不再相信这仍然是可能的。但它是。\n您可以下载单个二进制可执行文件。你来管理它。没有第三步。\n不，说真的。太简单了，我以为我错过了什么。但是没有。在运行该二进制文件之后，您就拥有了一个完全可操作的Syncthing节点。它已准备好与任何其他同步节点同步，无需其他设置。没有安装程序，没有软件包管理(但如果你愿意，还有软件包)，没有注册，没有电子邮件，没有登录，没有密码创建，没有2FA，没有同意，没有用户协议。只需下载并运行即可。见鬼，在Linux服务器上设置自动启动比仅仅运行应用程序本身要复杂得多！\n为了让您了解情况，以下是Dropbox在新计算机上安装时为您提供的所有步骤：\nAaaa和…。这还不是全部！您还需要处理这个烦人的通知：\n只有在这一点上，您才能开始使用Dropbox。幸运的是，我已经有账户了，否则，还需要5个步骤。太荒谬了！\n(不用说，所有这些都是不同的窗口。请注意，这不会发生在单一的可预测区域。你必须追赶他们每一个人。而且“设置Dropbox”窗口总是在顶部，所以它隐藏了其他必要的步骤，这也增加了趣味性。)。\n因为Synthing是免费的，并且不依赖于服务器端存储，所以它们不需要对您施加奇怪或不自然的限制。您可以使用磁盘上的所有空间。您可以根据需要同步任意多个文件夹。您可以同步任何文件夹，无论它位于何处。您可以与世界上任何人同步。事实上，您可以与任意数量的人同步任何文件夹。你决不会怀疑“但这是否符合我的计划”？如果您的硬件允许，它会正常工作。就这么简单。\n文件夹是其他云存储如何不断他妈的把最简单的东西搞砸的最生动的例子。Syncthing可以同步位于任何位置的驱动器上的任何文件夹。您可以同步现有文件夹。您可以同步多个不同的文件夹。文件夹只是文件夹，没有什么特别之处。我在这里同步“系统”文件夹：~/Desktop和~/Library/Fonts，以及三个自定义文件夹。毫不费力：\n这种简单性使您可以将其用作一种工具，有时可以创造性地应用于您的任务，而不是作为您必须忍受的服务。例如，通过同步~/库/字体，如果我在一台计算机上安装字体，它会自动安装到所有位置。\n这与Dropbox形成对比，后者要求您将所有内容都放在~/Dropbox文件夹中。如果您让您的项目处于~/工作状态，并且想要同步它，那么，真倒霉。您也不能同步多个文件夹。当然，从技术上讲，Dropbox可以同步任何东西。文件就是文件。但品牌推广要求在某个地方必须有一个Dropbox文件夹，即使这对用户来说不方便。\n但最严重的违规者是iCloud。和Dropbox一样，它也要求你把所有的东西放到一个文件夹里。但该文件夹名为~/Library/Mobile Documents/com~Apple~CloudDocs！\n如果你是程序员，它是无法使用的。首先，你不能在头脑清醒的情况下，每次需要CD的时候都输入。第二，它包含空格！这打破了所有的东西，信不信由我，即使是在2020年。我不能把Fira代码放在iCloud里，因为Python脚本，我不能把Jekyll这样的博客放在那里，因为Ruby，我不能运行Bazel等等。没用。\n如果没有注册、帐户、电子邮件等，如何连接两台设备？简单！每个设备都有一个唯一的ID，在您第一次运行该程序时会自动生成。与另一台设备共享此ID，让他们共享他们的ID，您就可以开始工作了。\n最好的消息是什么？那些身份证甚至都不是秘密。它们更像是公钥，所以您可以自由地交换它们。但只有当两个设备都知道对方的ID时，该方案才有效。\n我喜欢这个计划的原因是它非常简单，而且精益求精。这是纯粹的数学。而且使用起来也非常方便。没有电子邮件，没有表格，没有没有回应的网页，没有邀请，没有过期的令牌，没有失败/过时/超载的API，没有密码管理，没有什么可以持有或“管理”的东西。\n这里有高级用户模式！如果您不介意，总会有一个UI，并且您可以在那里配置的大部分内容。但是，如果您是一名程序员并且需要更多，您可以：\n只需配置一次，就可以永远忘记生成的类、提供的依赖项和其他不必要的同步缓存。\n相比之下，iCloud有一项功能可以将*.nosync文件排除在同步之外，但你知道吗？我通常没有名为*.nosync的文件，这就是问题所在：\n有点可笑的是，商业应用程序功能臃肿，却没有电源模式。您可以做更多不同的事情，但不能根据您的喜好进行配置。\n商业解决方案对锁定用户并不断向他们追加销售更多功能感兴趣。因此，您会收到通知、功能、弹出窗口。例如，在此屏幕截图上，在我刚刚在一台新机器上安装了Dropbox之后：\n链接到另一个产品(纸张)，即使它与文件同步无关，\n通知我的桌面应用程序已准备好可以使用？！我是说，我是从桌面应用上看的！\nDropbox卖给我更多的空间(尽管那是两年前的事了，我有&gt；50%的免费空间)，\n星光闪耀的物品？这是什么，高中记事本吗？如果我真的想要的话，我可以在操作系统中给文件加标签，不过还是谢谢你。\n这些至少是文件状的吗？不过，如果你已经有一款主要任务是同步文件的应用程序，我不明白为什么它们一定是“特殊功能”。它已经做到了这一点。为什么有些文件比其他文件更特殊？\n答案很简单：Dropbox生存的唯一途径就是建立和销售更多的功能。你和他们在一起永远不会安心。\niCloud要年轻得多，还没有功能膨胀，但他们仍然对销售更多的Mac和iPhone感兴趣。所以他们总是试图把你与世界其他地方隔绝。当您启用/禁用同步时，预计会有奇怪的限制和极大的不便，比如iCloud文件夹位置或移动桌面文件夹。\n另一方面，同步生存并不依赖于制造更多的特征。他们只做一件事，但他们做得很好。看，他们的菜单1看起来和Dropbox在2012年还不错的时候一模一样：\niCloud和Dropbox经常做的另一件丑事是试图吓唬你，让你不敢走开。每次您将多个文件移出iCloud文件夹时，都会显示这些文件：\n看起来他们似乎在试图解释一些事情，但事实并非如此。他们害怕你可能会离开，并试图吓唬你回去。策略很简单：质疑你的每一个动作，即使是像移动或删除文件这样的琐碎操作，即使是安全操作也会显示巨大的警告标志，冗长的令人费解的措辞(“存储在iCloud中的文档将从Mac上删除”)让你永远不确定会发生什么。那是一些可疑的狗屎。\n另一方面，Syncthing根本不在乎。他们不会从你那里拿到任何钱，所以他们对创造需求或不断提醒自己不感兴趣。如果你在寻找心灵的安宁，你不能用商业产品来满足你的需求。\nSyncthing提醒我，如果计算机不是由公司制造的，那么它们可以是多么伟大。这是简单的，可预测的，理智的，行为不是胡说八道的。您可以随心所欲地配置它，它始终让您处于控制之中。这是一个纯粹的函数，它很擅长这一点。它是免费的，而且是开源的，但我更愿意每月捐给他们10欧元，而不是像Dropbox那样。如果我的Mac/iPhone上至少有一半的程序是这样的，我会更快乐。\n我还创建了开源的东西：Fira Code、AnyBar、DataScript和Rum。如果您喜欢我所做的，并希望早日访问我的文章(以及其他好处)，您应该在Patreon上支持我。", "note_en": "I’ve been struggling with file sync solutions  for years. In the beginning, Dropbox was great, but in the last few years, they started to bloat up. I moved to iCloud, but it was even worse. Finally, a few days ago, after iCloud  cryptically broke again, I decided it’s time to try something different.\n I tried  Syncthing, a free and open-source alternative. And you know what? It’s been liberating. The sanity, the simplicity, the reliability, the features. It brings the joy of use and makes you believe  the collapse of civilization can be slowed down a bit.\n  It’s amazing how great computer products can be when they don’t need to deal with corporate bullshit, don’t have to promote a brand or to sell its users. Frankly, I almost ceased to believe it’s still possible. But it is.\n  You download a single binary executable. You run it. There’s no step three.\n  No, seriously. It’s so simple I thought I missed something. But no. After you run that binary, you have a fully operational node of Syncthing. It’s ready to sync with any other Syncthing node, no other setup necessary. There’s no installers, no package management (but there are packages if you want to), no registration, no email, no logins, no password creation, no 2FA, no consents, no user agreements. Just download and run. Heck, setting up autostart on Linux server was more complex than just running the app itself!\n   Just to give you the perspective, these are all the steps that Dropbox puts you through when you install it on a new computer:\n            Aaaaand… that’s not all! You also get this annoying notificaiton to deal with:\n  Only at this point can you start using Dropbox. Luckily, I already had an account, otherwise, it would be 5 more steps. Ridiculous!\n (It goes without saying, that all of these are different windows. It does not happen in a single predictable area, mind you. You have to chase every one of them. And the “Set Up Dropbox” window is always-on-top, so it hides other required steps, which also adds to the fun.)\n  Because Synthing is free and doesn’t depend on server-side storage, they don’t need to put weird or unnatural restrictions on you. You can use as much space as you have on disk. You can sync as many folders as you want. You can sync any folder, no matter where it’s located. You can sync with anyone in the world. In fact, you can sync any folder with any number of people. At no point have you to wonder “but will it work with my plan”? If your hardware allows it, it will work. As simple as that.\n Folders are the most vivid example of how other cloud storages constantly fuck up the simplest things. Syncthing can sync any folder on your drive, located anywhere. You can sync existing folders. You can sync multiple different folders.  Folders are just folders, nothing special about them. Here I’m syncing “system” folders:  ~/Desktop and  ~/Library/Fonts, and three custom ones. No sweat:\n  This simplicity lets you use it as a tool you can apply, sometimes creatively, to your task, not as a service you have to put up with. For example, by syncing  ~/Library/Fonts, if I install a font on one machine, it automatically installs everywhere.\n Contrast this with Dropbox, which requires you to put everything inside  ~/Dropbox folder. If you keep your projects under  ~/work and want to sync it, well, tough luck. You can’t sync multiple folders either. Well, technically Dropbox can sync anything, of course. Files are files. But branding dictates there MUST be a Dropbox folder somewhere, even if it’s inconvenient for the user.\n  But the worst offender is the iCloud. Same as Dropbox, it also requires you to put all your stuff into a folder. But that folder is called  ~/Library/Mobile Documents/com~apple~CloudDocs!!!\n If you are a programmer, it’s unusable. First, you can’t in your right mind type THAT every time you need to  cd. Second, it contains spaces! Which breaks all sorts of things, believe me or not, even in 2020. I can’t keep Fira Code in iCloud because of python scripts, I can’t keep Jekyll blog like this one there because of Ruby, I can’t run bazel, etc. Useless.\n     How do you connect two devices, if there’s no registration, accounts, email, etc? Simple! Each device has a unique id, generated automatically when you first run the program. Share this id with another device, let them share their, and you are good to go.\n  Best news? Those ids are not even secret. They are more like public keys, so you can exchange them freely. But the scheme only works if both devices know ids of each other.\n What I like about this scheme is how beautifully simple and down-to-absolute-essentials it is. This is pure mathematics. But it’s also very convenient to use. There’re no emails, no forms, no unresponsive web pages, no invites, no expiring tokens, no failing/outdated/overloaded APIs, no password management, nothing to hold onto or “manage”.\n  There’s power user mode! If you don’t care, there’s always a UI, and most of the things you can configure there. But if you’re a programmer and need more, you can:\n      Configure it once and forget about generated classes, vendored dependencies and other caches syncing unnecessary forever.\n In contrast, iCloud has a feature to exclude  *.nosync files from syncing, but you know what? I usually don’t have files called  *.nosync, that’s the problem:\n    It’s kind of funny, how commercial apps have feature bloat but don’t have power mode. You can do more different things, but can’t configure them to your liking.\n  Commercial solutions are interested in keeping users locked in and constantly upselling more features to them. As a result of that, you get notifications, features, popups. For example, on this screenshot, after I  just installed Dropbox on a fresh machine:\n   Link to another product (Paper), even though it has nothing to do with file synchronization,\n    A notification that says my Desktop app is ready for use?! I mean, I’m looking at it from the desktop app!\n    Dropbox selling me more space (even though it was 2 years ago and I have &gt;50% free),\n    Starred items? What is it, a high-school notepad? If I really wanted, I could tag files in the OS, but thank you.\n     These are at least file-like? I don’t understand why they have to be “special features”, though, if you already have an app whose primary task is to sync files. It already does that. Why are some files more special than others?\n The answer is simple: the only way Dropbox can survive is by building and selling more features. You’ll never have peace of mind with them.\n iCloud is much younger and doesn’t have feature bloat yet, but they are still interested in selling more Macs and iPhones. So they will always try to isolate you from the rest of the world. Expect weird restrictions and great inconveniences, like iCloud folder location or moving Desktop folder when you enable/disable sync for it.\n Syncthing survival, on the other hand, does not depend on making more features. They do one thing, but they do it well. Look, their menu  1 looks exactly how Dropbox used to look when it still was good in 2012:\n   Another ugly thing both iCloud and Dropbox routinely do is trying to scare you from walking away. Those appear every time you move more than one file outside of iCloud folder:\n      It might seem like they try to explain something, but they do not. They are scared you might be leaving and try to scare you back. The tactic is simple: question your every action, even trivial operations like moving or deleting files, display huge warning signs even for safe operations, long puzzling wording (“ documents stored in iCloud will be removed from Mac”) so that you never sure what will happen. That’s some shady shit.\n  Syncthing, on the other hand, simply doesn’t care. They don’t get any money from you, so they are not interested in creating a need or constantly reminding about themselves. If you are looking for peace of mind, you can’t have it with commercial offerings.\n  Syncthing has reminded me how great computers can be if they are not made by corporations. It’s simple, predictable, sane, acts no-nonsense. You can configure it however you like and it always keeps you in control. It’s a pure function and it’s good at that. It’s free and open-source, but I’m much more happy to donate them €10/month than e.g. Dropbox. I would be a much happier person if at least half of the programs on my Mac/iPhone were like that.\n      I also create open-source stuff: Fira Code, AnyBar, DataScript and Rum. If you like what I do and want to get early access to my articles (along with other benefits), you should  support me on Patreon.", "posttime": "2020-06-16 22:20:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,computers", "title": "电脑就像我以前喜欢的那样", "title_en": "Computers as I used to love them", "transed": 1, "url": "https://tonsky.me/blog/syncthing/", "via": "", "real_tags": ["电脑", "computers"]}, {"category": "", "categoryclass": "", "imagename": "f52851c9ba095fd20eeca3004c1ab3aa.png", "infoid": 1006809, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "集锦、新闻稿和演讲", "note_en": "Highlights, press releases and speeches", "posttime": "2020-06-16 21:41:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,opens,新闻稿", "title": "欧盟对苹果App Store规则展开调查", "title_en": "EU opens investigations into Apple's App Store rules", "transed": 1, "url": "https://ec.europa.eu/commission/presscorner/detail/en/ip_20_1073", "via": "", "real_tags": ["苹果", "app", "apple", "opens", "新闻稿"]}, {"category": "", "categoryclass": "", "imagename": "f7518e329161f548ceddb2a7daab9e53.jpg", "infoid": 1006808, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数学界的一个由来已久的做法是将这个领域一分为二。有一种传统的“应用与纯粹”论点，它反映了其他学科的实验-理论分歧-向特定目的推进知识与为其本身而做之间的紧张关系。或者我们可以将数学一分为二，就像我们的大脑分裂一样，用代数的“左半球”按逻辑顺序思考，用几何的“右半球”用更直观的方法思考。但这个领域也根据一个更微妙的区别来细分：一个人对数学美的两种口味的偏好。\n对于非专家来说，一开始就很难认为数学是美的。当然，美丽在旁观者的眼中，但当艺术品隐藏在黑暗中，被难以穿透的符号和行话所笼罩时，也很难看清。试图欣赏数学而不了解它的内部工作原理，就像是读贝多芬第五交响曲的描述，而不是听它。\n然而，数学家们毫不犹豫地认真地将他们的方程式和证明描述为美丽的。这种美感已经被证明是非常普遍的，存在于不同的文化和时代：巴比伦的数学家和现代学生可以在研究平面几何中完美的直线排列或求解二次方程时找到同样的乐趣。\n粗略地说，数学之美可以是两种形式中的一种，一般的或特殊的。我甚至可以说，数学家本身也有这两种口味--至少，他们倾向于偏向两极中的一种。\n第一种变体是美的一种空灵形式，反映在形式结构和图案中。这是一种对数学世界自身安排的不可阻挡的秩序的惊叹。想想看，自然数排成无限列是多么完美。或者考虑增加维度的欧几里得空间序列：直线、平面、空间等，或者形式逻辑本身的严密性和精确性。这些结构令人难以置信地强大和有用，从某种角度来看，确实可以说是美丽的。\n但对于那些站在分歧另一边的人-似乎包括大多数人，当然也包括大多数非数学家-很难真正对n维向量空间的概念或实线上的连续函数感到兴奋。欣赏这些想法就是欣赏一种抽象的形式，而这种美感往往让人感觉冰冷而正式。它是冰雪皇后的美丽，最好是从安全的距离欣赏，而不是近距离欣赏。\n数学美的第二种形式更具关联性。它涉及到规则的例外，即不属于任何更大类别的对象。这些是17世纪和18世纪充斥着自然历史橱柜的迷人化石和奇怪矿物的奇特之处、一次性的、数学上的化身。这种美有一种非常不同的感觉：它是异国情调的、古雅的、亲密的--当然，也是相当主观的。\n以十二面体为例，它是许多数学趣味柜子里最受欢迎的物体。它是由12个五边形组成的规则立体，也是五个完全对称的立体之一。它的吸引力曾经在我看来是“复杂的，但不是太复杂”。这个形状作为一种深奥的象征有着悠久的历史，这可以追溯到古希腊人，当时柏拉图提出了五个物体(现在被称为柏拉图实体)和物理宇宙之间的联系。十二面体象征着所有的天体--恒星和行星，它们的形状和运动都很完美。从那时起，这种数学形式就象征着外星人，并成为炼金术士和占星家喜爱的象征。从现代数学的角度来看，它仍然被认为是例外的，它是为数不多的几个完全独立的对称物体之一，不是任何更大模式的一部分。例如，很容易将立方体或四面体概括为任意维度的相似对象，但没有十二面体的高维类似物。\n另一个数学上的错位，对任何内阁来说都是有利可图的财产，简单地说就是怪物。它是最大的特殊构件，所有的对称群都可以从它上面构造出来，这是一个数学上的怪物，只能在一个不低于196883维的空间中可视化。根据你的品味，怪物群体要么是所有数学中最漂亮的，要么是最丑的。\n多年来，这两种美都迷住了数学家，并带来了许多进展。抽象显然是一个强大的工具。它允许一个人一次处理一个家庭的所有成员，而且它把问题放在更广泛的角度。追随冰雪女王的数学家通常不喜欢具体的应用或具体的案例-抽象代数的最高教士之一亚历山大·格罗森迪克(Alexander Grothendieck)曾以57为素数的例子而闻名。(事实并非如此。)。对数学弃儿的迷恋也是一种富有成效的策略。这样的物体通常生活在多个想法的交叉点上，可以作为完全不同世界之间的接入点。这种风格的爱好者不喜欢“抽象的胡言乱语”，而是珍视具体案例的特殊性，无论是缺点还是一切。\n但现实世界与理想化的数学图景大相径庭。大多数科学都与描述真实世界的宇宙联系在一起--但这只是无穷无尽的数学可能性中的一种。据报道，正如Jean-Pierre Serre对他的数学家同事Raul Bott所打趣的那样，“当其他科学在寻找上帝为这个宇宙选择的规则时，我们数学家在寻找即使是上帝也必须遵守的规则。”\n面对这个事关生存的问题--宇宙到底遵循什么规律？--对大多数科学家来说，自然而然地会被橱柜里特殊物品的相关魅力所吸引。但科学告诉我们，抽象而朴素的数学美往往提供了一种更安全的长期选择。\n这方面的一个著名演示涉及天文学家约翰尼斯·开普勒早期工作中柏拉图式固体的出现。他提出了一个太阳系模型，该模型基于五种固体的特定构型来计算行星轨道之间的距离。这是一个美好的想法，但注定要失败。开普勒本人后来拒绝了这一模型，因为他得出结论，行星的轨道并不是形成单一的完美圆形，而是有着丑陋的椭圆外观，可以采取一系列形状中的一种。这似乎是一种明确的倒退。他将这一发现比作留在奥吉安科学马厩里的“装满粪便的马车”。\n但是，当开普勒最初因为偏爱特殊物体而误入歧途时，艾萨克·牛顿(Isaac Newton)会继续根据他的万有引力理论解释行星的椭圆轨道。事实上，他展示了天空中的所有运动都是圆、椭圆、双曲线和抛物线的版本。之美在于牛顿的抽象定律，而不是具体的解。\n这是物理学家和科学家们已经学过很多次的一课。在19世纪，科学家们从随意收集的古董柜转向对自然界进行更系统的研究。生物学家开始收集一组有机体的所有标本，而不仅仅是最美丽的蝴蝶或鸟类，并发现了进化的一般理论。化学家们对所有元素进行了分类，超越了简单的银和金的闪耀，并在这个过程中揭示了元素周期表的模式。物理学家随后揭示了隐藏在元素原子中的基本粒子的对称性。\n每一次，他们都发现宇宙之美在于物理现象背后的抽象结构。乍一看，这些结构可能会让人感到困惑和难以理解，但从长远来看，往往会被证明更强大、更有意义。而且，的确，更漂亮了。", "note_en": "A time-honored practice in mathematical circles is to divide the field in two. There’s the traditional “applied versus pure” argument, which mirrors the experimental-theoretical divide of other disciplines — the tension between advancing knowledge toward a specific end and doing it for its own sake. Or we can bisect mathematics in the same way that our brain is split, with an algebraic “left hemisphere” that thinks in logical sequences and a geometric “right hemisphere” that has a more visual approach. But the field also breaks down according to a more subtle distinction: one’s preference between two flavors of mathematical beauty.\n It’s tough for nonexperts to see mathematics as beautiful in the first place. Beauty is in the eye of the beholder, sure, but it’s also hard to see when the work of art is hidden in darkness, obscured by an impenetrable cloud of symbols and jargon. Trying to appreciate mathematics without understanding its inner workings is like reading a description of Beethoven’s Fifth Symphony instead of hearing it.\n Yet mathematicians have no qualms about earnestly describing their equations and proofs as beautiful. It’s a sense of aesthetics that has proved remarkably universal, existing across cultures and times: A Babylonian mathematician and a modern student could find equal delight in studying a perfect arrangement of lines in plane geometry, or in solving a quadratic equation.\n And roughly speaking, mathematical beauty can come in one of two forms, generic or exceptional. I would go so far as to say that mathematicians themselves come in these two flavors, too — at least, they tend to gravitate to one of the two poles.\n The first variant is an ethereal form of beauty, reflected in formal structures and patterns. It’s a sense of wonder at the inexorable order in which the mathematical world arranges itself. Just think of how perfectly the natural numbers line up in an infinite row. Or consider the sequence of Euclidean spaces of increasing dimensions: a line, a plane, a space, etc. Or the rigor and precision of formal logic itself. These structures are incredibly powerful and useful, and from a certain perspective that can indeed be beautiful.\n But for those on the other side of the divide — which, it seems, includes most people and certainly most non-mathematicians — it’s tough to get truly excited by the concept of a vector space in  n dimensions, or a continuous function on the real line. To appreciate these ideas is to appreciate a form of abstraction, and this sense of aesthetics often feels cold and formal. It’s the beauty of an ice queen, best admired from a safe distance, never up close.\n The second form of mathematical beauty is more relatable. It concerns the exceptions to the rules, the objects that do not fit into any larger category. These are the curiosities, the one-offs, the mathematical incarnations of the enchanting fossils and strange minerals that filled natural history cabinets in the 17th and 18th centuries. This beauty has a very different feel to it: It’s exotic, quaint, intimate — and, of course, quite subjective.\n  Consider, for example, the dodecahedron, a favorite object in many mathematical cabinets of curiosities. It is the regular solid built out of 12 pentagons, and it’s one of the five perfectly symmetric solids. Its attraction was once described to me as being “complicated, but not too complicated.” The shape has a long history as a symbol of the esoteric that goes back to the ancient Greeks, when Plato suggested a connection between the five objects, now called the Platonic solids, and the physical universe. The dodecahedron symbolized all the heavenly bodies — the stars and planets, each perfect in shape and movement. Ever since, this mathematical form has signified the extraterrestrial, and it became a beloved symbol of alchemists and astrologists. From a modern mathematical perspective it is still considered exceptional, one of only a handful of symmetric objects that fully stand on their own and are not part of any larger pattern. For example, it is easy to generalize a cube or a tetrahedron to an analogous object in arbitrary dimensions, but there are no higher-dimensional analogues of the dodecahedron.\n Another mathematical misfit, a prize possession for any cabinet, is simply known as the monster. It is the largest exceptional building block out of which all symmetry groups can be constructed, a mathematical monstrosity that can only be visualized in a space of no less than 196,883 dimensions. Depending on your taste, the monster group is either the prettiest or the ugliest object in all mathematics.\n Both types of beauty have charmed mathematicians over the years and led to many advances. Abstraction is an obviously powerful tool. It allows one to deal with all members of a family at once, and it places problems in a wider perspective. The mathematician who follows the ice queen often dislikes concrete applications or specific cases — Alexander Grothendieck, one of the high priests of abstract algebra, once famously picked 57 as an example of a prime number. (It’s not.) The fascination with mathematical outcasts has been a productive strategy too. Such objects often live at the intersection of multiple ideas and can act as an access point between completely different worlds. Aficionados of this style don’t care for “abstract nonsense” and cherish the peculiarities of the concrete case, warts and all.\n  But the real world is very different from the idealized landscape of mathematics. Most sciences are tethered to the universe that describes the real world — but that’s just one out of an infinity of mathematical possibilities. As Jean-Pierre Serre  reportedly quipped to his mathematician colleague Raoul Bott, “While the other sciences search for the rules that God has chosen for this Universe, we mathematicians search for the rules that even God has to obey.”\n Confronted with this existential question — what laws does the universe actually follow? — it’s natural for most scientists to gravitate toward the relatable charms of the exceptional objects in the cabinet. But science has taught us that the abstract and austere form of mathematical beauty often offers a safer long-term choice.\n A famous demonstration of this involves the appearance of the Platonic solids in the early work of the astronomer Johannes Kepler. He proposed a model of the solar system that based the distances between planetary orbits on a particular configuration of the five solids. It was a beautiful idea, but doomed. Kepler himself later rejected this model, after concluding that the orbits of the planets did not form the singular perfect shape of a circle, but instead had the ugly appearance of an ellipse, which can take one of a whole range of shapes. It seemed a definite step backward. He compared this discovery to a “wagon full of manure” left in the Augean stables of science.\n  But while Kepler was initially led astray by his preference for exceptional objects, Isaac Newton would go on to explain the planets’ elliptical orbits based on his universal theory of gravity. In fact, he showed how all motions in the heavens were versions of circles, ellipses, hyperbolas and parabolas. The beauty lay in Newton’s abstract laws, not the specific solutions.\n This is a lesson that physicists, and scientists generally, have learned many times over. In the 19th century, scientists moved away from the random collections of curiosity cabinets to a more systematic study of the natural world. Biologists started to collect all specimens in a group of organisms, not just the most beautiful butterflies or birds, and discovered the general theory of evolution. Chemists classified all the elements, going beyond the easy bling of silver and gold, and uncovered the periodic table’s patterns in the process. Physicists then revealed the symmetries of elementary particles hidden within the elements’ atoms.\n Every time, they discovered that the universe’s beauty lies in the abstract structures underlying physical phenomena. These structures may at first feel confusing and difficult to relate to, but taking the long view often proves much more powerful and meaningful. And, indeed, more beautiful.", "posttime": "2020-06-16 21:22:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数学,mathematical", "title": "数学美的两种形态", "title_en": "The Two Forms of Mathematical Beauty", "transed": 1, "url": "https://www.quantamagazine.org/how-is-math-beautiful-20200616/", "via": "", "real_tags": ["数学"]}, {"category": "", "categoryclass": "", "imagename": "f6ca0df7d33dfed07f101223c77772b0.png", "infoid": 1006807, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "NETGEAR R7000经过一天的辛勤研究，放松、放松、轻松地做一些事情，这是一件很有趣的事情。虽然与10-15年前相比，现代软件开发流程极大地提高了商业软件的质量，但消费者网络设备在很大程度上被甩在了后面。因此，当需要一些快速乐趣和良好的信心提升时，我喜欢分析SOHO设备。本博客描述了一个这样的会话，即审核Netkit R7000路由器、分析由此产生的漏洞，以及随后的利用漏洞开发过程。在我们的NotQuite0Day星期五存储库中可以找到这篇博客文章中描述的漏洞的记录和代码。\n分析SOHO设备的第一步是获取固件。值得庆幸的是，Netkit的支持网站提供了R7000的所有固件。本博客文章中使用的Netkit R7000版本1.0.9.88固件可从该网站下载。在解压缩固件之后，我们将使用binwalk从固件映像中提取根文件系统：虽然路由器可能有许多值得分析的服务，但Web服务器通常最有可能包含漏洞。在像R7000这样的SOHO设备中，Web服务器必须解析来自网络的用户输入，并运行使用该输入的复杂CGI功能。此外，Web服务器是用C语言编写的，几乎没有经过测试，因此它经常容易受到微不足道的内存损坏错误的攻击。因此，我决定从分析Web服务器httpd开始。由于我们对Web服务器(Mis)如何处理用户输入很感兴趣，因此开始分析Web服务器的逻辑位置是jrecv函数。该函数用于从连接中检索用户输入。因此，通过查看Web服务器中对Recv函数的引用，我们可以看到用户输入从哪里开始。Web服务器具有两个调用RECV的助手函数，一个在HTTP解析器中使用，另一个用于读取从动态DNS请求到oemdns.com的响应。我们将重点介绍前一种用法，如Hex-Rays反编译器中所示：在调用READ_CONTENT函数(crecv_helper函数)之后，解析器会执行一些错误检查，将接收到的内容与之前接收到的任何内容组合在一起，然后在用户输入中查找字符串：name=&#34；mtenFWUpload&#34；和&#34；\\r\\n\\r\\n&#34；，然后在用户输入中查找字符串：name=&#34；mtenFWUpload&#34；和&#34；\\r\\n\\r\\n&#34；。如果用户输入包含这些字符串，则这些字符串之后的用户输入的其余部分将传递给JabCheckBoardID函数。抓取固件的根文件系统，我们可以看到字符串“mtenFWUpload”是从文件www/upg_upgrade.htm和www/Modem_upgrade.htm中引用的，因此我们可以得出结论，这是路由器升级功能的一部分。\n在用户输入之后，我们接下来来看一下AabCheckBoardID函数。此函数如下所示，预期用户输入为R7000的CHK固件文件。它解析用户输入以验证魔术值(字节0-3)，获得报头大小(字节4-7)和校验和(字节36-49)，然后将报头复制到堆栈缓冲区。此副本通过memcpy函数执行，使用用户输入中指定的大小。因此，堆栈缓冲区溢出是微不足道的。在大多数现代软件中，此漏洞是无法利用的。现代软件通常包含可防止攻击的堆栈cookie。但是，R7000不使用堆栈cookie。事实上，在所有共享公共代码库的Netkit产品中，只有D8500固件版本1.0.3.29和R6300v2固件版本1.0.4.12-1.0.4.20使用堆栈cookie。但是，更高版本的D8500和R6300v2停止使用堆栈Cookie，使得此漏洞再次被利用。与其他现代软件相比，这只是SOHO设备安全性落后的又一个例子。\n除了缺少堆栈cookie之外，Web服务器也没有编译为位置无关的可执行文件(PIE)，因此不能充分利用ASLR。因此，在.httpd二进制文件中找到一个ROP小工具(如下面显示的那个)很容易，该小工具将使用从溢出堆栈获取的命令调用系统小工具。Grimm的NotQuite0Day星期五资料库中的漏洞利用此小工具以超级用户身份启动telnet守护程序，监听TCP端口8888，不需要密码即可登录。由于该漏洞发生在检查跨站点请求伪造(CSRF)令牌之前，因此也可以通过CSRF攻击来利用此漏洞。如果使用易受攻击的路由器的用户浏览到恶意网站，该网站可能会利用该用户的路由器进行攻击。开发的利用漏洞攻击通过向目标设备提供向目标设备发送包含利用漏洞攻击的AJAX请求的HTML页面来展示此功能。但是，由于CSRF网页无法从目标服务器读取任何响应，因此无法远程对设备进行指纹识别。相反，攻击者必须知道他们正在利用的型号和版本，", "note_en": "Netgear R7000 After a long day of hard research, it’s fun to relax, kick back, and do something easy. While modern software development processes have vastly improved the quality of commercial software as compared to 10-15 years ago, consumer network devices have largely been left behind. Thus, when it’s time for some quick fun and a nice confidence boost, I like to analyze SOHO devices. This blog describes one such session of auditing the  Netgear R7000 router, analyzing the resulting vulnerability, and the exploit development process that followed. The write-up and code for the vulnerability described in this blog post can be found in our  NotQuite0DayFriday repository.\n The first step when analyzing a SOHO device is to obtain the firmware. Thankfully,  Netgear’s support website hosts all of the firmwares for the R7000. The Netgear R7000 version 1.0.9.88 firmware used in this blog post can be downloaded from this website. After unzipping the firmware, we’ll use  binwalk to extract the root filesystem from the firmware image:       While the router may have many services worth analyzing, the web server is often the most likely to contain vulnerabilities. In SOHO devices like the R7000, the web server must parse user input from the network and run complex CGI functions that use that input. Furthermore, the web server is written in C and has had very little testing, and thus it is often vulnerable to trivial memory corruption bugs. As such, I decided to start by analyzing the web server, httpd.  As we’re interested in how the web server (mis)handles user input, the logical place to begin analyzing the web server is the   recv function. The   recv function is used to retrieve the user input from a connection. Thus by looking at the references to the   recv function in the web server, we can see where the user input begins. The web server has two helper functions which call   recv, one used in the http parser and one used to read the responses from Dynamic DNS requests to oemdns.com. We’ll focus on the former use, as shown below in the Hex-Rays decompiler:       After the call to   read_content (the   recv helper function), the parser does some error checking, combines the received content with any previously received content, and then looks for the strings   name=&#34;mtenFWUpload&#34; and &#34;  \\r\\n\\r\\n&#34; in the user input. If the user input contains these strings, the rest of the user input after these strings is passed to the   abCheckBoardID function. Grepping the firmware’s root file system, we can see that the string   mtenFWUpload is referenced from the files   www/UPG_upgrade.htm and   www/Modem_upgrade.htm, and thus we can conclude that this is part of the router’s upgrade functionality.\n Following the user input, we’ll next look at the  abCheckBoardID function. This function, shown below, expects the user input to be the chk firmware file for the R7000. It parses the user input to validate the magic value (bytes 0-3), obtains the header size (bytes 4-7) and checksum (bytes 36-49), and then copies the header to a stack buffer. This copy, performed via the   memcpy function, uses the size specified in the user input. As such, it’s trivial to overflow the stack buffer.       In most modern software, this vulnerability would be unexploitable. Modern software typically contains  stack cookies which would prevent exploitation. However, the R7000 does not use stack cookies. In fact, of all of the Netgear products which share a common codebase, only the D8500 firmware version 1.0.3.29 and the R6300v2 firmware versions 1.0.4.12-1.0.4.20 use stack cookies. However, later versions of the D8500 and R6300v2 stopped using stack cookies, making this vulnerability once again exploitable. This is just one more example of how SOHO device security has fallen behind as compared to other modern software.\n In addition to lacking stack cookies, the web server is also not compiled as a Position-independent Executable (PIE), and thus cannot take full advantage of ASLR. As such, it’s trivial to find a ROP gadget within the   httpd binary, such as the one shown below, that will call   system with a command taken from the overflown stack.        The exploit in GRIMM’s  NotQuite0DayFriday repository uses this gadget to start the telnet daemon as root listening on TCP port 8888 and not requiring a password to login.       As the vulnerability occurs before the  Cross-Site Request Forgery (CSRF) token is checked, this exploit can also be served via a CSRF attack. If a user with a vulnerable router browses to a malicious website, that website could exploit the user’s router. The developed exploit demonstrates this ability by serving an html page which sends an AJAX request containing the exploit to the target device. However, as the CSRF web page cannot read any responses from the target server, it is not possible to remotely fingerprint the device. Rather, the attacker must know the model and version that they are exploiting, as shown below.\n A lot of SOHO devices share a common software base, especially among devices created by the same manufacturer. As such, a vulnerability in one device can normally be found in similar devices by the same manufacturer. In this particular case, I was able to identify 79 different Netgear devices and 758 firmware images that included a vulnerable copy of the web server. This vulnerability affects firmwares as early as 2007 (WGT624v4, version 2.0.6). Given the large number of firmware images, manually finding the appropriate gadgets is infeasible. Rather, this is a good opportunity to automate gadget detection.   Included in GRIMM’s  NotQuite0DayFriday repository is the   find_arm_gadget.sh and   find_mips_gadget.sh shell scripts. The   find_arm_gadget.sh shell script uses objdump and grep to look for the needed gadget, as shown below. While the R7000 has an ARM processor, some of the other vulnerable devices use a MIPS processor. Unlike ARM, objdump cannot easily resolve the function names of functions being called in a MIPS binary. As such, the MIPS gadget identification scripts use IDAPython in order to identify the gadgets for a binary. Using these sets of scripts, I was able to create an exploit for each of the 758 vulnerable firmware images. Afterwards, I manually tested the exploit on 28 of the vulnerable devices to ensure that the identified gadgets worked as expected.\n The last step before exploitation can reliably be achieved is to remotely detect the model and version of the router. Thankfully, almost all of the vulnerable versions listen for requests to the URL   /currentsetting.htm and return the model and version of the device. As such, remotely fingerprinting a device is trivial. The published exploit for the vulnerability described in this blog post automatically determines the target model and version using this approach.       Routers and modems often form an important security border that prevents attackers from directly exploiting the computers in a network. However, poor code quality and a lack of adequate testing has resulted in thousands of vulnerable SOHO devices being  exposed to the internet for over a decade. This blog post illustrates just how far behind the times consumer network device security has fallen.   On 6/15/2020, ZDI published an advisory by d4rkn3ss from VNPT ISC on this vulnerability. We discovered the issue independently and reported the vulnerability directly to Netgear on 5/7/2020. ZDI&#39;s advisory can be read at  https://www.zerodayinitiative.com/advisories/ZDI-20-712/\n  Want to join us and exploit some binaries? We’re  hiring. Need help auditing or exploiting your binaries? Feel free to  contact us.", "posttime": "2020-06-16 21:04:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "漏洞,day,函数", "title": "NETGEAR 79台设备的0天漏洞分析和利用", "title_en": "Netgear 0-day Vulnerability Analysis and Exploit for 79 devices", "transed": 1, "url": "https://blog.grimm-co.com/2020/06/soho-device-exploitation.html?m=1", "via": "", "real_tags": ["漏洞", "day", "函数"]}]