[{"category": "", "categoryclass": "", "imagename": "3a369e0c6d868d9d32c40dee3bcdbcff.jpg", "infoid": 1010515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于首次担任首席执行官的领导者来说，花时间学习和思考可以转化为早期的成功。但问题是，几乎没有时间去做这两件事中的任何一件。信息来得更快，比以往任何时候都更多的人需要他们的时间，他们被告知，摆在他们面前的无数决定都是重要的。\n如果从外部招聘，就会有一种新的文化需要适应，而且还不清楚该信任谁。即使是从内部提拔，与在同一家公司管理一个部门相比，速度也可能会不协调。在这两种情况下，任何新领导人都必须管理高曝光率(因为它深入到高层领导人几乎没有地方可逃)和不切实际的期望(对自己和他人都是如此)。\n对于完全避免这些问题，新的领导人无能为力。他们所能控制的就是他们对他们的反应。因为我们往往会在事情加速时犯错误，特别是在不熟悉的领域，找到放慢速度的方法可以起到很大的作用。\n法国哲学家布莱斯·帕斯卡(Blaise Pascal)指出，“人类所有的问题都来自于人类无法独自安静地坐在房间里。”他不是指安静地坐在笔记本电脑前回复电子邮件。最好的想法来自结构化反思--而做到这一点的最好方法就是写一本个人日记。\n当我接管一家制造研究、软件和咨询公司时，我开始写日记。我当时很年轻，我们正处于危机之中，面临着一个充满挑战的市场，我不确定我可以依靠谁。在我担任董事长和首席执行官的12年里，我一直在写日记，从那以后，我第一次向那些进入任何高级职位的人推荐了这本日记。\n有强有力的证据表明，在我们的大脑中回放事件对学习至关重要。当大脑记录和保存当下发生的事情时，从一个人所经历的事情中学习--也就是决定什么是重要的，什么教训应该学到--发生在事实发生之后，处于安静的反思期。\n此外，当我们放慢脚步反思时，我们可以更有创意地解决看似难以理解的问题。举个例子，就拿我过去用过的一种叫“第二解法”的技术来说。如果一群人正在努力想出解决棘手问题的选择，我们会集思广益，以确定一系列可能的解决方案。在切换到优先顺序、使项目具体化等之前，我们尝试确定所有可能的选项。我发现最好的方法是告诉小组休息一下，当他们重新开会时问，“你还会想到什么？”不可避免的是，这个简单的问题导致了大约50%的产品增加，通常是质量更高的产品。通过实验，我发现第一轮和第二轮之间发生的休息比问题更重要。日记是一种有效、高效、私密的休息方式。\n日记条目不仅应该记录所发生的事情，还应该记录我们是如何情绪反应的；把它写下来会带来一定的清晰度，让我们能够正确地看待事情。在其他情况下，这是一种心理彩排，为应对特别敏感的问题做准备，因为在这些问题上，除了你自己没有人可以交谈。日记也是思考豪赌决策和检验逻辑的最佳方式。\n虽然个性、风格和情况会导致不同的方法，但事实证明，一些指导方针是有用的，可以获得最好的结果。笔记应该在你想要学习的事件发生后尽快做好--最好是在同一天。等待超过24小时似乎牺牲了细节的特殊性，这些细节最大的不同以及它们发生的原因。\n条目应该从主要结果开始-最能捕捉主要结果的标题。然后，列出造成这种结果的主要原因；一个总是微妙的根本原因，通过问“为什么？”而变得显而易见。五次剥开每一层，显露出以前的样子。(我记得有一次看过我的日记，意识到有几个豪赌的决定在辩论中恰到好处地提出了正确的问题。幸运的是，我的笔记足够详细，它们显示每次都是同一个下属提出了正确的问题。我开始更仔细地听他说话)。第三，回忆一下影响决策的情绪，以及它们为什么会爆发。最后，找出你可以从整个经历中学到什么，以及下次你可以做些什么不同的事情。\n许多人会选择在他们的电脑或iPad上保存日记。虽然这可能更有效率，但写日记的目的不是效率，而是反思和放慢速度，以便最大限度地提高学习效率。出于这个目的，笔迹可能会更好地发挥作用。小说家保罗·塞罗克斯曾说过，他手写是因为，“我用钢笔写字的速度似乎就是我的想象力找到最好的…的速度。文字。“。他指出，2011年“新闻周刊”的一篇文章说，“大脑扫描显示，手写比打字涉及更多的大脑区域，而且一旦你把东西写在纸上，就更容易记住它。”\n写日记有这么多好处，为什么很少有领导人这样做呢？\n这需要时间，这是最宝贵的资产。因为日记需要反思，所以最好在安静的时间做，这对任何领导人来说都是罕见的。\n有时，记日记需要重温一件你很快就会忘记的事情。即使是学习中至关重要的一步，也是令人不快的。\n因为许多领导者更喜欢迅速进入下一个挑战，所以反思在他们喜欢或有很多经验的事情清单上并不是很重要。\n像任何工具一样，完善使用它的最佳方式需要时间。这里提供的方法论并不是立竿见影的，而是在经历了多次试验和错误之后才出现的。\n与好处相比，这些都是微不足道的缺点。放慢脚步会带来更好的思考，更有效的判断，并学会做更多的事情和改变什么。与任何事情一样重要的一个结果是，应该从掌权中获得满足感的增加。个人日记应该是任何领导者工具箱的一部分。", "note_en": "For leaders assuming the CEO title for the first time, taking time to learn and think translates into early successes. But the problem is there’s little time to do either. Information comes at them more quickly, more people than ever before demand their time, and they’re told that the myriad decisions piled in front of them are all important.\n  If hired from outside, there is a new culture to get used to and it’s not clear who to trust. Even when promoted from inside, the pace can be jarring compared to running a division in the same company. In both cases, any new leader must manage intense exposure (as it sinks in that top leaders have few places to escape to) and unrealistic expectations (of both self and others).\n  There is nothing new leaders can do to avoid these problems completely. All they can control is how they react to them. Because we tend to make mistakes when things speed up, especially when in unfamiliar territory, it can make all the difference to find ways to slow things down.\n  The French philosopher Blaise Pascal pointed out that “All of humanity’s problems come from man’s inability to sit quietly in a room alone.” He didn’t mean sitting quietly in front of a laptop responding to emails. The best thinking comes from structured reflection — and the best way to do that is keeping a personal journal.\n  I started keeping a journal when I took over a manufacturing research, software, and consulting firm. I was very young, we were in crisis facing a challenging market, and I wasn’t sure whom I could rely on. I kept a journal through my 12 years as chairman and CEO and have since recommended it to people moving into any senior position for the first time.\n  There’s strong evidence that replaying events in our brain is essential to learning. While the brain records and holds what takes place in the moment, the learning from what one has gone through — that is, determining what is important and what lessons should be learned — happens after the fact during periods of quiet reflection.\n           Also, when we slow things down and reflect, we can be more creative about solving seemingly inscrutable problems. Take, for example, a technique called the “second solution method” that I’ve used in the past. If a group was struggling to come up with options to solve a tough problem, we would brainstorm to identify a list of possible solutions. Before switching to prioritizing, making items specific, etc., we tried to identify all possible options. I found the best approach was to tell the group to take a break and when it reconvened to ask, “What else occurs to you?” Inevitably, this simple question resulted in about 50% more items, often of higher quality. By experimenting, I found that the break that took place between the first and second rounds was more important than the question. A journal is an effective, efficient, private way to take a similar break.\n  Journal entries should provide not only a record of what happened but how we reacted emotionally; writing it down brings a certain clarity that puts things in perspective. In other cases, it’s a form of mental rehearsal to prepare for particularly sensitive issues where there’s no one to talk with but yourself. Journals can also be the best way to think through big-bet decisions and test one’s logic.\n  While personality, style, and situation cause different approaches, some guidelines have proven useful for the best results. Notes should be made as soon as possible after an event from which one wants to learn—ideally the same day. Waiting more than 24 hours seems to sacrifice specificity about details that made the most difference and why they happened.\n  An entry should begin with the primary outcome — the headline that best captures the major result. Then, list the essential reason for that outcome; an always-subtle root cause made apparent by asking “why?” five times to peel back each layer, revealing what came before. (I remember reviewing my journal once and realized that several big-bet decisions turned on the right question asked at just the right point in the debates. Fortunately, my notes were in enough detail that they showed that the same subordinate asked the right question each time. I started listening to him much more closely). Third, recall the emotions that affected decision making and why they flared. Last, identify what you can learn from the whole experience and what you can do differently next time.\n  Many will opt to keep a journal on their computer or iPad. While that may be more efficient, the point of keeping a journal is not efficiency but to reflect and slow things down so that learning is maximized. For that purpose,  handwriting may work better. The novelist Paul Theroux has said that he writes long-hand because, “The speed with which I write with a pen seems to be the speed with which my imagination finds the best… words.” He noted  a 2011 Newsweek article that said, “Brain scans show that handwriting engages more sections of the brain than typing [and] it’s easier to remember something once you’ve written it down on paper.”\n    With so many benefits of keeping a journal, why do so few leaders do it?\n  It takes time, a most precious asset. Because a journal requires reflection, it’s best done during quiet periods, which are rare for any leader.\n  Sometimes, keeping a journal requires reliving something one would just as soon forget. Even though a vital step in learning, it’s unpleasant.\n  Because many leaders prefer to rapidly move on to the next challenge, reflection is not high on their list of things they enjoy or have much experience with.\n  Like any tool, it takes time to perfect the best way to use it. The methodology offered here did not happen right away, but came after many trials and errors.\n  These are minor drawbacks compared to the benefits. Slowing things down leads to better-thought-through, more effective judgement and to learning what to do more of and what to change. One result, as important as anything, is an increase in the satisfaction that should come from being in charge. A personal journal should be part of any leader’s toolkit.", "posttime": "2020-07-08 18:56:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "需要,job,反思", "title": "职称越高，你越需要记日记", "title_en": "The More Senior Your Job Title, the More You Need to Keep a Journal", "transed": 1, "url": "https://hbr.org/2017/07/the-more-senior-your-job-title-the-more-you-need-to-keep-a-journal", "via": "", "real_tags": ["需要", "job", "反思"]}, {"category": "", "categoryclass": "", "imagename": "6c1235a8319b71bccaa10c8e138f534d.jpg", "infoid": 1010514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zoom Video Communications与四家视频会议硬件制造商联手推出了Zoom硬件即服务，旨在使Zoom房间和Zoom电话更容易为企业所用。\n软件包中的硬件提供程序是dten、neat、Poly和Yelink。硬件和Zoom捆绑包为技术买家提供每月固定价格，根据系统和Zoom的支持而有所不同。Neat和dten已经围绕Zoom设计了硬件系统，Zoom已经成为一个家喻户晓的品牌，随着新冠肺炎疫情期间的远程轮班，Zoom已经成为一个增长相匹配的品牌。\n在Zoom采取这一举措之前，Lifesize在去年12月推出了客房即服务计划，然后在1月份更新了管理控制台的分析功能。LifeSize&#39；的会议室即服务计划的起步价为每月99美元，适用于会议室的软硬件捆绑套餐起价为每月99美元，适用于顶级会议室的套餐最低价格为每月199美元。LiveSize集成了自己的硬件和软件。\n这里的结果是，硬件和软件领域的大多数视频会议和协作参与者都可能提供即服务计划。思科(Cisco)的WebEx等供应商可能会提供订阅服务，并寻找微软团队与其硬件生态系统以及戴尔(Dell)、惠普(HP)和联想(Lenovo)等公司合作。Google Meet已经与G Suite捆绑订阅，但可以利用硬件合作伙伴，亚马逊Chime也可以。\nZoom的硬件即服务(HAAS)定价因硬件而异。例如，Zoom手机的硬件价格从Poly VVX 250的每台5.99美元到Yelink CP960的每月50美元不等。缩放硬件即服务不包括软件许可费用。\n在Zoom&39；最近的财报电话会议上，Zoom手机被认为是一款需求旺盛的产品。\nZoom Room Hardware as a Service计划比Zoom Phone选项价格更高。Zoom Room硬件的定价范围从配备Neat.Pad控制器的Neat.bar(每个设备每月110美元)到Poly系统(每月100美元到150美元不等)。软件许可费用不包括在内。下面我们来看看各种选择。\n与其他作为服务的努力一样，Zoom Haas提供了较低的前期成本和可预测的预算，以及向上或向下扩展和获得托管支持的能力。", "note_en": "Zoom Video Communications has teamed up with four  video conferencing hardware makers to launch Zoom Hardware as a Service designed to make Zoom Rooms and Zoom Phone more available to enterprises.\n  The  hardware providers in the package are  DTEN,  Neat,  Poly, and  Yealink. The  hardware and Zoom bundles give tech buyers a monthly fixed price that varies by system and support by Zoom. Neat and DTEN have already designed hardware systems revolving around Zoom, which has become a household name  with growth to match following the  remote work shift during the  COVID-19 pandemic.\n  Zoom&#39;s move comes after  Lifesize launched a Rooms-as-a-service effort in December and then  updated its admin console with analytics in January.  Lifesize&#39;s Rooms-as-a-Service plans start at $99 a month for a software-hardware bundle for huddle rooms and go to $199 a month for top-of-the-line conference rooms. Lifesize integrates its own hardware and software.\n     The upshot here is that most video conferencing and collaboration players in hardware and software are likely to offer as-a-service plans. Vendors such as Cisco&#39;s WebEx are likely to offer subscriptions and look for Microsoft Teams to partner with its hardware ecosystem and companies such as Dell, HP, and Lenovo. Google Meet is already bundled with G Suite as a subscription but could leverage hardware partners as could Amazon Chime.\n      Zoom&#39;s Hardware as a Service (HaaS) pricing varies depending on hardware. For instance, Zoom Phone hardware runs from $5.99 per device for the Poly VVX 250 to $50 a month for the Yealink CP960. Zoom Hardware as a Service doesn&#39;t include software license costs.\n   On Zoom&#39;s recent earnings conference call, Zoom Phone was cited as a product that was seeing strong demand.\n  The Zoom Rooms Hardware as a Service plans are pricier than Zoom Phone options. Pricing for Zoom Rooms hardware range from the Neat.bar with Neat.Pad controller at $110 a month per device to Poly systems that range from $100 a month to $150 a month. Software licensing costs aren&#39;t included. Here&#39;s a look at the options.\n    Zoom HaaS like other as-a-service efforts provides low upfront costs and predictable budgeting as well as the ability to scale up or down and get managed support.", "posttime": "2020-07-08 18:17:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "硬件,产品,offering", "title": "缩放产品硬件即服务产品", "title_en": "Zoom Offering Hardware As a Service Offering", "transed": 1, "url": "https://www.zdnet.com/article/zoom-rooms-go-as-a-service-with-hardware-partners-dten-neat-poly-and-yealink/", "via": "", "real_tags": ["硬件", "产品", "offering"]}, {"category": "", "categoryclass": "", "imagename": "9f2942528a6547ade0676742b4dce565.png", "infoid": 1010513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "McFly使用智能搜索引擎替换您的默认ctrl-r shell历史搜索，该搜索引擎会考虑您的工作目录和最近执行的命令的上下文。麦克弗莱的建议是用一个小的神经网络实时优先处理的。\ntl；dr：升级的ctrl-r，历史记录结果对您当前正在进行的工作有意义。\n重新绑定ctrl-r以调出具有小型神经网络优先级的全屏反向历史搜索。\n增加shell历史记录，以跟踪SQLite数据库中的命令退出状态、时间戳和执行目录。\n同时维护正常的壳历史文件，以便您可以随时停止使用McFly。\n包括从McFly数据库和Shell历史记录文件中清除任何历史记录项目的简单操作。\nMcFly的关键功能是由一个实时运行的小型神经网络提供动力的智能命令优先排序。我们的目标是让您要运行的命令始终是最受欢迎的建议之一。\n您运行该命令的目录。您将来很可能会在同一目录中运行该命令。\n安装到$PATH中的某个位置。(例如，您可以在~/bin创建一个目录，将McFly复制到此位置，然后将导出路径=&#34；$PATH：$HOME/bin&#34；添加到您的.bashrc/.zshc。)。\n为避免McFly的UI弄乱您在iTerm2中的回滚历史记录，请确保未选中此选项：\n可以通过环境变量设置许多设置。要设置设置，您应该将以下代码片段添加到~/.bashrc/~/.zshc中。\n若要交换在灯光终端中使用的配色方案，请设置环境变量MCFLY_LIGHT。\n默认情况下，McFly使用emacs启发的密钥方案。如果要切换到VIM启发的密钥方案，请设置环境变量MCFLY_KEY_SCHEME。", "note_en": "McFly replaces your default  ctrl-r shell history search with an intelligent search engine that takes into accountyour working directory and the context of recently executed commands. McFly&#39;s suggestions are prioritizedin real time with a small neural network.\n TL;DR: an upgraded  ctrl-r where history results make sense for what you&#39;re working on right now.\n  Rebinds  ctrl-r to bring up a full-screen reverse history search prioritized with a small neural network.\n Augments your shell history to track command exit status, timestamp, and execution directory in a SQLite database.\n Maintains your normal shell history file as well so that you can stop using McFly whenever you want.\n  Includes a simple action to scrub any history item from the McFly database and your shell history files.\n  The key feature of McFly is smart command prioritization powered by a small neural network that runsin real time. The goal is for the command you want to run to always be one of the top suggestions.\n  The directory where you ran the command. You&#39;re likely to run that command in the same directory in the future.\n       Install to a location in your  $PATH. (For example, you could create a directory at  ~/bin, copy  mcfly to this location, and add  export PATH=&#34;$PATH:$HOME/bin&#34; to your  .bashrc /  .zshrc.)\n    To avoid McFly&#39;s UI messing up your scrollback history in iTerm2, make sure this option is unchecked:\n   A number of settings can be set via environment variables. To set a setting you should add the following snippets to your  ~/.bashrc /  ~/.zshrc.\n  To swap the color scheme for use in a light terminal, set the environment variable  MCFLY_LIGHT.\n   By default Mcfly uses an  emacs inspired key scheme. If you would like to switch to the  vim inspired key scheme, set the environment variable  MCFLY_KEY_SCHEME.", "posttime": "2020-07-08 17:57:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,neural,mcfly", "title": "McFly-神经网络支持的目录和上下文感知外壳历史搜索", "title_en": "Mcfly – neural-network powered directory and context-aware shell history search", "transed": 1, "url": "https://github.com/cantino/mcfly", "via": "", "real_tags": ["神经网络", "neural", "mcfly"]}, {"category": "", "categoryclass": "", "imagename": "52c04b9378bbd40a9068eaa219bc7927.jpeg", "infoid": 1010512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "老式电子维修，家电维修，老式风扇维修，旧车，旧杂货。", "note_en": "Vintage electronic repair, appliance repair, vintage fan repair, old cars, misc old stuff.", "posttime": "2020-07-08 17:56:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "youtube,恢复,pier,维修", "title": "YouTube恢复乔丹码头的电子维修频道", "title_en": "Jordan Pier's Electronics Repair Channel Reinstated by YouTube", "transed": 1, "url": "https://www.youtube.com/user/JPDylon", "via": "", "real_tags": ["youtube", "恢复", "pier", "维修"]}, {"category": "", "categoryclass": "", "imagename": "ac684880eb484ea347aae159cb09b645.png", "infoid": 1010511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ariane是实现64位RISC-V指令集的6级、单问题顺序CPU。它完全实现了第一卷：用户级ISA V2.3中指定的I、M、A和C扩展，以及草案特权扩展1.10。它实现了三个特权级别M、S、U，以完全支持类Unix操作系统。此外，它还符合外部调试规范草案0.13。\n它具有可配置的大小、独立的TLB、硬件PTW和分支预测(分支目标缓冲器和分支历史表)。设计的主要目标是减少关键路径长度。\n@文章{8777130，作者={F.{扎鲁巴}和L.{贝尼尼}，期刊={IEEE超大规模集成系统学报}，标题={应用级处理的成本：采用22 nm FDSOI技术的Linux1.7GHz64位RISC-V内核的能量和性能分析}，年份={8777130}，卷={27}，数量={11}，页数={2629-2640}，doi={10.1109/T。\n去拿RISC-V工具。确保您的RISCV环境变量指向您的RISC-V安装(有关详细信息，请参阅RISC-V工具和相关项目)。\n这将创建包括SystemVerilog包装器的核心的C++模型，并将其链接到C++testbench(在TB子文件夹中)。二进制文件可以在工作器中找到，并接受RISC-V ELF二进制文件作为参数，例如：\nVerilator测试平台使用riscv-fesvr。这意味着您可以使用riscv-test存储库以及开箱即用的riscv-pk。根据一般经验，Verilator模型的行为将类似于Spike(例外情况是速度慢了几个数量级)。\nVerilator模型和Questa模拟都将生成跟踪日志。Verilator跟踪更基本，但您可以将日志提供给Spike-dasm以将指令解析为助记符。遗憾的是，目前无法对Verilator跟踪文件进行值检查。\n$ECHO&#39；#include&lt；stdio.h&gt；int main(int argc，char const*argv[]){printf(&#34；Hello Ariane！\\\\n&34；)；return 0；}&#39；&gt；hello.c$riscv64-UNKNOWN-ELF-GCC hello.c-o hello.elf\n如果要使用QuestaSim运行它，可以使用以下命令：\n耐心点！RTL模拟比斯派克慢得多。如果您认为遇到了问题，可以检查跟踪文件。\n我们目前仅为Genesys 2主板提供支持。我们在这里提供了Genesys 2的预建码流和内存配置文件。\n以太网控制器和相应的网络连接仍在运行中，目前不起作用。预计很快会有一些更新。\n右键单击FPGA设备-从配置存储设备启动(或按FPGA上的程序按钮)。\n默认情况下，第一阶段引导程序将从SD卡引导。给自己买一张合适的SD卡(我们用这张)。从这里获取一个预先构建的Linux映像，或者按照Ariane-SDK存储库中的自述文件自己生成Linux映像。按照Ariane-SDK存储库中的从SD卡引导一节准备SD卡。\n在您插入SD卡并对FPGA进行编程之后，您可以连接到FPGA的串行端口，应该会看到引导加载程序，然后就可以启动Linux了。默认用户名为root，不需要密码。\n要自己为Genesys II板运行生成FPGA位流(和内存配置)，请执行以下操作：\n这将生成一个位流文件和内存配置文件(在fpga/work-fpga中)，您可以通过运行上述命令永久刷新它们。\n您可以使用OpenOCD调试(和编程)FPGA。下面我们提供了两个OpenOCD示例脚本。\n要开始，请将标有JTAG的微型USB端口连接到您的计算机。此端口连接到Genesys 2板上的FTDI 2232 USB转串行芯片，通常用于访问KINTEX-7 FPGA的本地JTAG接口(例如，使用Vivado对设备进行编程)。然而，FTDI芯片还暴露了第二条串行链路，该链路被路由到FPGA上的GPIO引脚，我们利用这一点从RISC-V调试模块连接JTAG。\n如果您使用的是基于Ubuntu的系统，则需要将以下udev规则添加到/etc/udev/rules.d/99-ftdi.ules。\n连接到系统后，键入lsusb时应会列出FTDI芯片：\nBus 005 Device 019：ID 0403：6010 Future Technology Devices International，Ltd FT2232C/D/H Dual UART/FIFO IC。\n如果是这种情况，您可以继续使用fpga/ariane.cfg配置文件启动openocd：\n$openocd-f fpga/ariane.cfg开放片上调试器0.10.0+dev-00195-g933cb87(2018年9月14日19：32)获得GNU GPL v2许可。有关错误报告，请阅读http://openocd.org/doc/doxygen/bugs.htmladapter速度：1000kHzInfo：自动选择第一个可用的会话传输&#34；JTAG&#34；。要覆盖使用TRANSPORT SELECT&lt；TRANSPORT&gT；&#39；.info：时钟速度1000 kHzInfo：TAP riscv.cpu没有IDCODEInfo：datacount=2程序bufsize=8Info：已检查RISC-V核心；找到1个hartsInfo：HART 0：XLEN=64，MISA=0x8000000000141105Info：侦听端口3333上的GDB连接准备\n$riscv64-未知-elf-gdb/path/to/elf(Gdb)目标远程本地主机：3333(Gdb)loadLoad段.text，大小0x6508 LMA 0x80000000加载段.rodata，大小0x900 LMA 0x80006508(Gdb)b putchar(Gdb)cContinuing.Program接收信号SIGTRAP，跟踪/断点陷阱。0x00000080009126 in putcha.0x00000080009126 in putcha.0x00000080009126 in putchar。\n(Gdb)x/i 0x1000 0x1000：lui t0，0x4(Gdb)set{int}0x1000=22(Gdb)set$PC=0x1000。\nAriane初步支持普林斯顿大学的OpenPiton分布式缓存系统。为此，已经开发了不同的L1高速缓存子系统(src/cache_subsystem/wt_cache_subsystem.sv)，其遵循直写协议并且支持高速缓存无效和原子。\nOpenPiton GitHub存储库将发布相应的集成补丁。检查该存储库中的自述文件，了解如何在OpenPiton设置中使用Ariane。\n要激活不同的缓存系统，请使用宏WT_DCACHE(默认设置)编译代码。\n核心是使用QuestaSim的完整许可版本开发的。如果您自己恰好有这个模拟器，这里是如何使用它来运行内核的。\n要指定要运行的测试，请使用以下命令(例如：您希望在tmp/risc-tests/build/isa文件夹内运行rv64ui-p-Sraw：\n如果您使用Batch-mode=1调用sim，它将在没有GUI的情况下运行。QuestaSim也使用riscv-fesvr进行通信。\n我们为运行RISCV装配测试的Travis CI和GitLab CI提供了两个CI配置文件，即RISCV基准测试和随机RISCV拷问测试。两者的区别在于Travis CI仅在Verilator上运行这些测试，而GitLab CI在QuestaSim和Verilator上运行相同的测试。\n如果您想要在您的机器上本地运行CI测试套件，请遵循两个脚本ci/travis-ci-mulul.sh和ci/travis-ci-mulul.sh中的任何一个(取决于您是否有QuestaSim)。特别是，在运行任何测试套件之前，您必须获取系统所需的软件包、ci/path-setup.sh中的路径以匹配您的设置，并运行安装和构建脚本。\n完成所有设置和安装后，您可以按如下方式运行测试套件(使用Verilator)：\n为了运行随机化酷刑测试，您首先必须在运行模拟之前生成随机化程序：\n这将在Spike和RTL目标上运行随机化程序，并检查两个签名是否匹配。随机指令混合可以在./tmp/riscv-cutry/config/default.config文件中配置。\nAriane可以在Questa中转储跟踪日志，这很容易与启用提交日志的Spike区别开来。在include/ariane_pkg.sv集中：\n这将在Spike和RTL目标上运行随机化程序，并检查两个签名是否匹配。随机指令混合可以在./tmp/riscv-cutry/config/default.config文件中配置，这将转储一个名为trace_hart_*_*_comm.log的文件。\n这对于调试长痕迹(例如：酷刑痕迹)很有帮助。要使用提交日志功能编译SPEKE，请执行以下操作：\n$apt-get安装设备树编译器$mkdir build$cd build$../configure--prefix=$RISCV--with-fesvr=$RISCV--enable-Commitlog$make$[sudo]make install。\n在标准配置中，调试模块将负责加载内存内容。它还将处理与riscv-fesvr的通信。根据场景的不同，这可能不会被禁用(例如：在模拟中预加载大型ELF或Linux引导)。您可以使用PRELOAD ELF标志来指定将被预加载的二进制文件的路径。\n用于RTL模拟的零级引导加载器(ZSBL)位于boot trom/中，而FPGA的引导代码位于fpga/src/boot trom中。RTL引导代码只是跳转到DRAM的基址，在那里FSBL接管。对于FPGA，ZSBL执行额外的内务处理。两个引导加载器分别将hartid和地址传递给参数寄存器a0和a1中的设备树。\n要重新生成引导代码，您可以使用这些目录中的现有Makefile。要生成SystemVerilog文件，您需要在系统上安装位串python包。\n转储检查点。这是参考模型的整个建筑状态。DroMajo丢弃了主内存和引导内存。此外，它还生成引导代码。如果您要运行该代码，它将恢复整个体系结构状态。这意味着您可以通过运行这段代码使任意两个或更多核心进入完全同步的体系结构状态。\n将检查点加载到RTL内存和RTL中的DroMajo实例。DroMajo作为共享库链接到模拟器。RTL通过一组DPI调用与DroMajo通信。", "note_en": "Ariane is a 6-stage, single issue, in-order CPU which implements the 64-bit RISC-V instruction set. It fully implements I, M, A and C extensions as specified in Volume I: User-Level ISA V 2.3 as well as the draft privilege extension 1.10. It implements three privilege levels M, S, U to fully support a Unix-like operating system. Furthermore it is compliant to the draft external debug spec 0.13.\n It has configurable size, separate TLBs, a hardware PTW and branch-prediction (branch target buffer and branch history table). The primary design goal was on reducing critical path length.\n    @article{8777130, author={F. {Zaruba} and L. {Benini}}, journal={IEEE Transactions on Very Large Scale Integration (VLSI) Systems}, title={The Cost of Application-Class Processing: Energy and Performance Analysis of a Linux-Ready 1.7-GHz 64-Bit RISC-V Core in 22-nm FDSOI Technology}, year={2019}, volume={27}, number={11}, pages={2629-2640}, doi={10.1109/TVLSI.2019.2926114}, ISSN={1557-9999}, month={Nov},}\n     Go and get the  RISC-V tools. Make sure that your  RISCV environment variable points to your RISC-V installation (see the RISC-V tools and related projects for further information).\n       This will create a C++ model of the core including a SystemVerilog wrapper and link it against a C++ testbench (in the  tb subfolder). The binary can be found in the  work-ver and accepts a RISC-V ELF binary as an argument, e.g.:\n  The Verilator testbench makes use of the  riscv-fesvr. This means that you can use the  riscv-tests repository as well as  riscv-pk out-of-the-box. As a general rule of thumb the Verilator model will behave like Spike (exception for being orders of magnitudes slower).\n Both, the Verilator model as well as the Questa simulation will produce trace logs. The Verilator trace is more basic but you can feed the log to  spike-dasm to resolve instructions to mnemonics. Unfortunately value inspection is currently not possible for the Verilator trace file.\n      $ echo &#39;#include &lt;stdio.h&gt;int main(int argc, char const *argv[]) { printf(&#34;Hello Ariane!\\\\n&#34;); return 0;}&#39; &gt; hello.c$ riscv64-unknown-elf-gcc hello.c -o hello.elf\n  If you want to use QuestaSim to run it you can use the following command:\n  Be patient! RTL simulation is way slower than Spike. If you think that you ran into problems you can inspect the trace files.\n  We currently only provide support for the  Genesys 2 board. We provide pre-build bitstream and memory configuration files for the Genesys 2  here.\n    The ethernet controller and the corresponding network connection is still work in progress and not functional at the moment. Expect some updates soon-ish.\n  Right click on the FPGA device - Boot from Configuration Memory Device (or press the program button on the FPGA)\n  The first stage bootloader will boot from SD Card by default. Get yourself a suitable SD Card (we use  this one). Either grab a pre-built Linux image from  here or generate the Linux image yourself following the README in the  ariane-sdk repository. Prepare the SD Card by following the &#34;Booting from SD card&#34; section in the ariane-sdk repository.\n    After you&#39;ve inserted the SD Card and programmed the FPGA you can connect to the serial port of the FPGA and should see the bootloader and afterwards Linux booting. Default username is  root, no password required.\n  To generate the FPGA bitstream (and memory configuration) yourself for the Genesys II board run:\n  This will produce a bitstream file and memory configuration file (in  fpga/work-fpga) which you can permanently flash by running the above commands.\n  You can debug (and program) the FPGA using  OpenOCD. We provide two example scripts for OpenOCD below.\n To get started, connect the micro USB port that is labeled with JTAG to your machine. This port is attached to the FTDI 2232 USB-to-serial chip on the Genesys 2 board, and is usually used to access the native JTAG interface of the Kintex-7 FPGA (e.g. to program the device using Vivado). However, the FTDI chip also exposes a second serial link that is routed to GPIO pins on the FPGA, and we leverage this to wire up the JTAG from the RISC-V debug module.\n If you are on an Ubuntu based system you need to add the following udev rule to  /etc/udev/rules.d/99-ftdi.rules\n Once attached to your system, the FTDI chip should be listed when you type  lsusb:\n Bus 005 Device 019: ID 0403:6010 Future Technology Devices International, Ltd FT2232C/D/H Dual UART/FIFO IC\n If this is the case, you can go on and start openocd with the  fpga/ariane.cfg configuration file:\n $ openocd -f fpga/ariane.cfgOpen On-Chip Debugger 0.10.0+dev-00195-g933cb87 (2018-09-14-19:32)Licensed under GNU GPL v2For bug reports, read http://openocd.org/doc/doxygen/bugs.htmladapter speed: 1000 kHzInfo : auto-selecting first available session transport &#34;jtag&#34;. To override use &#39;transport select &lt;transport&gt;&#39;.Info : clock speed 1000 kHzInfo : TAP riscv.cpu does not have IDCODEInfo : datacount=2 progbufsize=8Info : Examined RISC-V core; found 1 hartsInfo : hart 0: XLEN=64, misa=0x8000000000141105Info : Listening on port 3333 for gdb connectionsReady for Remote ConnectionsInfo : Listening on port 6666 for tcl connectionsInfo : Listening on port 4444 for telnet connectionsInfo : accepting &#39;gdb&#39; connection on tcp/3333\n  $ riscv64-unknown-elf-gdb /path/to/elf(gdb) target remote localhost:3333(gdb) loadLoading section .text, size 0x6508 lma 0x80000000Loading section .rodata, size 0x900 lma 0x80006508(gdb) b putchar(gdb) cContinuing.Program received signal SIGTRAP, Trace/breakpoint trap.0x0000000080009126 in putchar (s=72) at lib/qprintf.c:6969 uart_sendchar(s);(gdb) si0x000000008000912a 69 uart_sendchar(s);(gdb) p/x $mepc$1 = 0xfffffffffffdb5ee\n  (gdb) x/i 0x1000 0x1000: lui t0,0x4(gdb) set {int} 0x1000 = 22(gdb) set $pc = 0x1000\n  Ariane has preliminary support for the OpenPiton distributed cache system from Princeton University. To this end, a different L1 cache subsystem ( src/cache_subsystem/wt_cache_subsystem.sv) has been developed that follows a write-through protocol and that has support for cache invalidations and atomics.\n The corresponding integration patches will be released on  OpenPiton GitHub repository. Check the  README in that repository to see how to use Ariane in the OpenPiton setting.\n To activate the different cache system, compile your code with the macro  WT_DCACHE (set by default).\n    The core has been developed with a full licensed version of QuestaSim. If you happen to have this simulator available yourself here is how you could run the core with it.\n To specify the test to run use (e.g.: you want to run  rv64ui-p-sraw inside the  tmp/risc-tests/build/isa folder:\n  If you call  sim with  batch-mode=1 it will run without the GUI. QuestaSim uses  riscv-fesvr for communication as well.\n  We provide two CI configuration files for Travis CI and GitLab CI that run the RISCV assembly tests, the RISCV benchmarks and a randomized RISCV Torture test. The difference between the two is that Travis CI runs these tests only on Verilator, whereas GitLab CI runs the same tests on QuestaSim and Verilator.\n If you would like to run the CI test suites locally on your machine, follow any of the two scripts  ci/travis-ci-emul.sh and  ci/travis-ci-emul.sh (depending on whether you have QuestaSim or not). In particular, you have to get the required packages for your system, the paths in  ci/path-setup.sh to match your setup, and run the installation and build scripts prior to running any of the tests suites.\n Once everything is set up and installed, you can run the tests suites as follows (using Verilator):\n  In order to run randomized Torture tests, you first have to generate the randomized program prior to running the simulation:\n  This runs the randomized program on Spike and on the RTL target, and checks whether the two signatures match. The random instruction mix can be configured in the  ./tmp/riscv-torture/config/default.config file.\n Ariane can dump a trace-log in Questa which can be easily diffed against Spike with commit log enabled. In  include/ariane_pkg.sv set:\n  This runs the randomized program on Spike and on the RTL target, and checks whether the two signatures match. The random instruction mix can be configured in the  ./tmp/riscv-torture/config/default.config file.This will dump a file called  trace_hart_*_*_commit.log.\n This can be helpful for debugging long traces (e.g.: torture traces). To compile Spike with the commit log feature do:\n $ apt-get install device-tree-compiler$ mkdir build$ cd build$ ../configure --prefix=$RISCV --with-fesvr=$RISCV --enable-commitlog$ make$ [sudo] make install\n  In standard configuration the debug module will take care of loading the memory content. It will also handle communication with  riscv-fesvr.Depending on the scenario this might not be diserable (e.g.: preloading of a large elf or linux boot in simulation). You can use the preload elf flag to specify the pathto a binary which will be preloaded.\n    The zero stage bootloader (ZSBL) for RTL simulation lives in  bootrom/ while the bootcode for the FPGA is in  fpga/src/bootrom. The RTL bootcode simply jumps to the base of the DRAM where the FSBL takes over. For the FPGA the ZSBL performs additional housekeeping. Both bootloader pass the hartid as well as address to the device tree in argumen register  a0 and  a1 respectively.\n To re-generate the bootcode you can use the existing makefile within those directories. To generate the SystemVerilog files you will need the  bitstring python package installed on your system.\n     Dump the checkpoint. This is the whole architectural state of the reference model. Dromajo dumps the main and boot memories. In addition, it generates a boot code. If you were to run that code it will restore the whole architectural state. This means that you can bring any two or more cores into complete synced architectural state by running this piece of code.\n Load the checkpoint into the RTL memory and the instance of Dromajo in RTL. Dromajo gets linked to a simulator as a shared library. RTL communicates to Dromajo through set of DPI calls.", "posttime": "2020-07-08 17:35:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,linux,cpu", "title": "Ariane RISC-V CPU--能够引导Linux的开源CPU", "title_en": "Ariane RISC-V CPU – An open source CPU capable of booting Linux", "transed": 1, "url": "https://github.com/openhwgroup/cva6", "via": "", "real_tags": ["开源", "linux", "cpu"]}, {"category": "", "categoryclass": "", "imagename": "c67fc288c5ded665b2188566586562a7.jpg", "infoid": 1010510, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国初创公司Farewill为人们提供了一个在线立遗嘱、组织遗嘱认证服务(比如整理个人财产的遗产税和税款)以及订购火化的平台，该公司已经筹集了2000万GB(约合2500万美元)的资金-它希望这笔资金不仅能帮助公司发展业务，还能帮助应对我们自己和亲人的死亡。\nFarewill首席执行官丹·加勒特在接受采访时谈及这一提议的复杂性时说：“我们想通过剥夺死亡的身份来提供帮助，我们都必须面对死亡。”它存在于每个人的体内。但对我们大多数人来说，我们从心理上就是不去想这件事，而且作为一个过程，人们很大程度上是听命于一个不为客户着想的行业。“。\n正如你可能已经猜到的，这个名字是关于告别的戏剧。“想一想双关语，你就可以开公司了，”加勒特说，声音中带着一丝嘲讽，我不确定你现在能不能避免，特别是考虑到这个话题。\n这轮融资由Highland Europe牵头，Keen Ventures、Headspace的里奇·皮尔森、Broadaven Ventures、Venture Founders以及之前的投资者奥格门塔姆·金融科技、TransferWise的塔维特·欣里库斯和Kindred Capital也参与了这轮融资。这被描述为一轮风险投资-2019年1月完成了略低于1000万美元的首轮融资-使Farewill筹集的资金总额达到3000万GB。\nFarewill目前只生活在英国，但从长远来看，计划扩大到更多。在本土市场，加勒特(他与大学时的朋友、首席技术官兼首席运营官丹·罗杰斯共同创立了Farewill)表示，在Farewill运营的五年里，它已经成为美国这个相当分散的市场中最大的遗嘱写入者：每写10份遗嘱，初创公司就有1份，即10%的市场份额。\n火葬、葬礼和遗嘱认证服务是从2019年12月开始的较新服务。但即便如此，考虑到目前的封锁、社会疏远和可悲的是实际死亡人数的上升，他们也看到了很多活动。加勒特说，法雷威尔的火葬服务，火葬和其他细节的订单都是在网上进行的，平均费用是典型葬礼的五分之一-这个想法是，家人可以选择在这一过程之后如何纪念，绕过更传统的葬礼选择-现在是全国第三/第四大火葬提供商。然而，这并不全是过去几个月的事：他补充说，去年(新冠肺炎之前)，这家初创公司的整体营收增长了800%。\n就像死亡对大多数人来说不是一个容易的话题一样，要将它确定为初创公司“颠覆”的目标行业也是一个复杂的话题。在这种背景下，法雷威尔的起源故事是一个有趣的故事。\n加勒特本科时在牛津大学学习工程学，他说这个想法是在帝国理工学院和皇家艺术学院联合攻读设计和创新学位的研究生工作中产生的。\n在Airbnb等公司的启发下，他带着很多伟大的想法进入了这个学位。“设计主导的公司潜力巨大，”他在谈到自己当时的想法时说。\n他说，开设课程队列的任务之一是考虑更广泛的老龄化概念和解决这一问题的服务。作为课程的一部分，他前往日本--日本对衰老和死亡过程有着特殊的敬意--并在东京的一家养老院与“一支由编年学家和人类学家组成的团队”一起，在那里生活了6个月。\n他回忆说，他带着意想不到的洞察力走了出来。“我觉得在那里待了六个月后，我作为设计师的角色失败了，”他说。“我们所有的注意力都集中在衰老的肤浅上：我们如何才能制造出更好的餐具，或者帮助他们走动的床或座椅？”这一切都是关于机动性和身体方面的。但我们没有接近讨论的原因是，这些人中的大多数都面临着死亡。而在疗养院，你身边没有朋友或家人。“。换句话说，身体上的细节和让生活更容易管理或更享受是可以的，但加勒特并不觉得他们切中了问题的核心。\n“在我看来，如果你是一名设计师，你的责任就是弄清问题的真相，”他说。他的论文关于痴呆症护理，提出的问题不是餐具本身，而是以人为中心的方法。“这很大程度上是关于身体上的改善，而不是心理方面。”\n因此，当他回到英国后，他开始努力了解“死亡产业”。他花了两个月的时间做他所说的“神秘购物”，定期拜访葬礼负责人，并说他是来讨论死亡(假设的死亡，而不是真实的死亡)，以了解人们在走进大门参加真正的葬礼时经历了什么过程。“我确保没有浪费他们太多的时间，”他说。\n然后，他还获得了遗嘱撰写的资格，并开始为他的朋友(免费)提供服务，这些朋友需要帮助完成遗嘱认证过程-包括整理遗产税、整理个人财产和遗产等等。他和法雷威尔还试图在整个工作中体现一种透明和道德的方法，其中还包括使在遗嘱中指定承诺的遗产收入(即对事业的捐赠)变得更容易。目标是到2023年达到10亿GB的承诺遗产收入，到目前为止筹集了超过2亿GB的资金，而且这个数字还在加速。\n他说，所有的实践经验对于掌握他想要建造的东西都很重要。他说：“我可能有三个硕士学位，但我在学习方面做得很糟糕，却没有实际行动。”\n加勒特发现的一个重要结论是，死亡产业不仅庞大而复杂，不仅仅是因为主题，而且因为它周围根本没有技术创新。\n“人类对处理死亡有着深刻的厌恶，这是一个出色的设计挑战，”他说。\n事实上，不管你喜不喜欢，死亡总是围绕着我们，也许现在尤其如此。在美国-美国本身就有许多专注于死亡相关服务的初创公司-遗嘱撰写公司的业务在过去几个月里出现了巨大的飙升。尽管全球大部分地区现在都看到了新冠肺炎带来的经济放缓，但死亡护理服务(不包括遗嘱撰写，而是死亡后的一切)预计今年将是一个价值1,020亿美元的行业。\n正是这样的数字，以及Farewill在其所作所为中的执行力，吸引了投资者。\n“为那些哀悼亲人的人解除行政上的痛苦怎么样？提供负担得起的、毫不费力的、体贴的服务怎么样？这就是Farewill团队正在做的事情--以非凡的同情心和科技推动的效率相结合，“Highland Europe合伙人斯坦·劳伦(Stan Laurent)在一份声明中说。”太久以来，遗嘱和殡仪业基本上都是着眼于利润，而不是目标。自从我们与丹的第一次会面以来，我们就知道法雷威尔拥有从根本上颠覆这个行业的要素。我们很高兴能支持他们，因为他们扩大了他们的野心。“。\n奥格门塔姆金融科技首席执行官蒂姆·莱文在一份声明中补充说：“自从我们18个月前进行首次投资以来，法雷威尔已经取得了惊人的进步。”“他们增长了10倍，并推出了一系列成功的新产品。这笔额外的资本将为公司创新一个古老的行业提供进一步的机会，并成为死亡服务领域的领先数字平台。“", "note_en": "Farewill, a UK startup that provides a platform for people write online wills, organise probate services (such as sorting out death duties and taxes on a person’s property) and order cremations, has raised £20 million ($25 million) in funding — money that it hopes will not only help the company grow its business but also to help in the process of coping with our own deaths and those of our loved ones.\n “We want to help by destigmatising death,” said Farewill CEO Dan Garrett in an interview about the complexity of the proposition. “We all have to face death. It lives inside everyone. But for most of us, we are psychologically hardwired not to think about it, and as a process people have been largely at the behest of an industry that doesn’t think about its customers.”\n  The name is, as you may have guessed, a play on farewell. “Think of the pun, and you can start the company,” Garrett said with the hint of wryness in his voice that I’m not sure you can avoid at the moment, especially given the subject.\n The round is being led by Highland Europe, with Keen Ventures, Rich Pierson of Headspace, Broadhaven Ventures, Venture Founders and previous investors Augmentum Fintech, Taavet Hinrikus of TransferWise and Kindred Capital also participating. It’s being described as a venture round — a Series A of just under $10 million was closed in January 2019 — and brings the total raised by Farewill to £30 million.\n Farewill is currently only live in the UK but longer term has plans to expand to more. In its home market, Garrett (who co-founded the company with university friend Dan Rogers, who is the CTO and CPO) says that in the five years that Farewill has been operational, it’s become the biggest will writer in the country in what is a quite fragmented market: the startup accounts for one out of every 10 wills written, or a 10% market share.\n The cremation funeral and probate services are more recent launches from December 2019. But even so, given the current state of play with lockdown, social distancing and sadly the rise in actual deaths, they too have seen a lot of activity. Garrett said that Farewill’s cremation service, where the order for cremation and other details are all carried out online and costs on average one-fifth of the typical funeral — the idea being that families can then choose how to memorialise after that process, bypassing that more traditional funeral option — is now the third/fourth-biggest cremation provider in the country. It’s not all about the last few months, however: overall growth for the startup, he added, was 800% last year (before COVID-19) on a revenue basis.\n  Just as death is not an easy topic for most people, it’s a complicated one to pinpoint as a target industry for a startup to “disrupt.” Farewill’s origin story, in that context, is an interesting one.\n Garrett — who studied engineering at Oxford as an undergraduate — said the the idea came to him while doing postgraduate work on a joint degree between Imperial College and the Royal College of Art on design and innovation.\n He came into the degree with a lot of big ideas, inspired by companies like Airbnb. “There is just so much potential for design-led companies,” he said of his thinking at the time.\n One of the remits that the course cohort was given, he said, was to think about the broader concept of aging and services to address that. As part of the course, he travelled to Japan — which has its own specific reverence for ageing and the death process — and based himself at an old people’s home in Tokyo for six months along with “a team of enthnographers and anthropologists.”\n He came out of that with an insight he didn’t expect, he recalled. “ I felt that at the end of my six months there, I’d failed in my role as a designer,” he said. “All we focused was on the superficiality of ageing: how can we make better cutlery, or beds or seating that helped them move around? It was all about mobility and the physical aspects. But why  we didn’t get close to talking about was that most of these people were facing their mortality. And in care homes, you don’t have friends or family around.” In other words, physical details and making life more manageable  or enjoyable are fine, but Garrett didn’t feel that they got to the heart of the matter.\n “To my mind, if you’re a designer, your responsibility is to get to the bottom of whatever the issue is,” he said. His dissertation, about dementia care, raised questions not about cutlery  per se but person-centered approaches. “So much of it is about physical amelioration, not psychological aspects.”\n So when he returned to the UK, he set to work trying to understand “the death industry.” He spent two months doing what he described as “mystery shopping”, regularly visiting funeral directors, and saying he was coming to discuss a death (a hypothetical one, not a real one) to understand what process people went through when they walked through the door for a real funeral. “I made sure I didn’t waste too much of their time,” he said.\n He then also got a qualification in will writing and started offering services to his friends (free) who needed help to go through the probate process — which involves sorting out death duties, organising personal effects and the estate and so on. He — and Farewill — have also tried to embody a transparent and ethical approach in the work throughout, which has also included making it easier to designate pledged legacy income in wills (that is donations to causes). The aim is to reach £1 billion in pledged legacy income by 2023, with over £200 million raised so far and the numbers accelerating.\n All that hands-on experience was important, he said, to get to grips with what he wanted to build. “I may have three masters degrees, but I am terrible at learning without actually doing something,” he said.\n One big conclusion Garrett found was that not only was the death industry large and complicated, not least because of the subject matter, but because it had no technical innovation at all around it.\n “There is this profound human aversion to dealing with death, and that is a brilliant design challenge,” he said.\n Indeed, like it or not, death is always around us, and perhaps particularly right now. In the US — itself home to a number of startups focusing on death-related services — will writing companies have  seen huge spikes in their business in the last several months. And even with the economic slowdown much of the globe is now seeing as a result of COVID-19, death care services (which don’t include will writing but everything after death), is  projected to be a $102 billion industry this year.\n It’s numbers like that, and Farewill’s execution in what it is doing, that has attracted investors.\n “How about entirely removing the administrative pain for those grieving for their loved ones? How about providing an affordable, effortless and considerate service? That’s what the Farewill team is doing – with an extraordinary blend of compassion and tech-fueled efficiency,” said Stan Laurent, Partner at Highland Europe in a statement. “For too long, the wills and funeral industry has been largely geared towards profit over purpose. Since our first meeting with Dan, we knew that Farewill had the ingredients to radically disrupt the industry. We’re excited to back them as they broaden their ambition.”\n “Farewill has made phenomenal progress since our initial investment 18 months ago,” added Tim Levene, CEO of Augmentum Fintech, in a statement. “They have grown by 10x and launched a suite of successful new products. This additional capital will provide further opportunity for the company to innovate an archaic industry, and become the leading digital platform in death services.”", "posttime": "2020-07-08 17:16:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "撰写,farewill,死亡", "title": "\n英国的Farewill为其在线遗嘱撰写、葬礼和其他死亡服务的新方式筹集了2500万美元", "title_en": "\n\t\t\t\tUK’s Farewill raises $25M for its new approach online will writing, funerals and other death services\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/08/uks-farewill-raises-25m-for-its-new-approach-online-will-writing-funerals-and-other-death-services/", "via": "", "real_tags": ["撰写", "farewill", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "b7059a6cd560cec0e5efb47d486b690d.png", "infoid": 1010509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“网络的力量在于它的普遍性。每个人都可以使用，而不分残疾，这是一个重要的方面。“。\n在过去的两年里，WebAIM对排名前100万的网站的主页进行了无障碍评估。他们的结果表明，即使在流行的网站上，可访问性错误仍然非常普遍。\n“在100万个主页中，检测到60,909,278个不同的辅助功能错误-平均每页有60.9个错误。”\n“残疾用户每接触到14个主页元素，就会有1个元素出现可检测到的错误。”\n总体而言，98.1%的主页有可检测到的WCAG2故障-比前一年的97.8%有所增加。\n作为他们分析的一部分，WebAIM分享了六个最常见的WCAG故障。\n在这篇文章中，我将描述这些失败中的每一个，并回答为什么它们很重要，以及我们如何修复它们。通过演示应用程序可以看到每个故障的现场演示。\n网站应该在所有文本和其背后的背景颜色之间有较高的颜色对比度。换句话说，文本的亮度不应该太接近背景亮度。\n低对比度的文本使读者更难辨别字符的形状和边缘，从而降低了阅读速度和阅读理解。随着文本大小的减小，这一问题变得更加突出，随着移动用户数量的持续增长，这一问题变得越来越重要。\n对于那些视力低下的人来说，低对比度文本的困难被放大了。每十二个人中就有一个看不到所有颜色的光谱。许多老年人因年龄增长而失去对比度敏感度。视力低下的人将无法阅读没有足够对比度的背景文本。\n低对比度文本如此普遍的原因之一是它很难被检测到。在编写或查看某些代码时，您可能会看到文本的十六进制值为#f2f2f2，背景的值为#808dd1。这颜色对比度够吗？即使检查它在屏幕上的效果，也很难确定对比度是否足以满足那些视力低下或屏幕较小的人。\n幸运的是，有几个工具可以自动测量颜色对比度，并突出显示任何不符合成功标准的工具。\n灯塔是由谷歌创建的一个工具，如果你使用谷歌Chrome，它已经内置到浏览器中了(还有其他浏览器的浏览器扩展)。运行审核将生成一份报告，该报告将标记网站上的可访问性问题。它将列出它检测到的文本背景和前景颜色对比度不够高的所有元素。\n一旦你意识到哪些元素不符合成功标准，你就可以调整背景和前景颜色来增加对比度。\n有多种颜色对比度分析器，可以帮助您找到两种对比度足够高的颜色。如果您使用的是Google Chrome，您可以使用Chrome DevTools的颜色选择器，它将显示两条白线来显示AA和AAA阈值。\nWCAG将文本对比度的成功标准定义为对比度为4.5：1。对于上面的Hello World示例，我们可以看到颜色对比度只有2.82，没有达到阈值。通过增加对比度，我们可以提高元素的可读性和可访问性。\n“31.3%的主页图像(平均每页12个)缺少替代文本…。\n这些数据表明，人们可以预期，网络上近一半的图像会有缺失、有问题或重复的替代文本。\n屏幕阅读器是由盲人或视障人士使用的。它以另一种形式在屏幕上传输视觉信息，例如通过大声朗读文本。\n屏幕阅读器无法将图像转换为文字。因此，有必要为每个图像提供一个简短的描述性替代文本，屏幕阅读器将使用该文本来传达图像的内容和目的。\n备选文本应简短且具有描述性。它应该描述图像的内容和目的，同时避免任何不相关的细节，因为这会冲淡有用的细节。\n如果图像使用img标签显示，则可以使用alt属性。\n如果图像使用另一个标记(如div的背景图像)显示，则可以使用aria-label属性。\n如果图像是由另一个元素的内容描述的，您可以使用aria-labelledby属性。\n&lt；！--❌缺少替代文本--&gt；&lt；img src=&#34；co.jpg&#34；/&gt；&lt；div class=&#34；COOL-BG-IMAGE&#34；/&gt；&lt；div class=&#34；另一个-COOL-BG-IMAGE&#34；aria-labelledby=&#34；不存在&#34；/&gt；div class=&#34；/&gt；div class=&#34；COOL-BG-IMAGE&#34；aria-labelledby=&#34；不存在&#34；/&gt。一只悲伤的海豹&#34；/&gt；&lt；div class=&#34；Cool-bg-image&#34；aria-label=&#34；一只愤怒的鳄鱼&#34；/&gt；&lt；div class=&#34；另一个-Cool-BG-image&34；aria-labeldby=&#34；my-label&34；/&gt；&。/div&gt；\n如果图像纯粹是装饰性的，您可以给图像添加一个替代文本&#34；&#34；，以指示屏幕阅读器不应该大声阅读它。这会阻止屏幕阅读器读出无用的信息。\n屏幕阅读器应该可以识别链接和按钮文本。这包括用作链接或按钮的图像的替代文本。\n在Web上，链接和按钮显示为符号或图像是很常见的。这在空间有限时特别有用，例如在较小的屏幕和移动设备上。然而，屏幕阅读器将很难将这些元素的目的翻译给用户。\n例如，我们非常习惯看到带有“+”符号的按钮来表示向列表中添加某些内容，或者使用徽标来表示链接。\n该链接将被读取为图像文件名或要链接到的页面的URL。\n当您可以看到整个屏幕并理解按钮/链接的上下文时，这些描述可能没有问题，但是屏幕阅读器不能提供这些额外的细节。\n可以使用aria-label和aria-labelledby属性将描述添加到按钮和链接。然后，屏幕阅读器将读取这些描述，使用户更清楚地了解元素的用途。\n&lt；！--带描述性标签的✅-按钮aria-Label=&#34；添加播放列表&#34；&gt；+&lt；/Button&gt；&lt；a HREF=&#34；.&#34；aria-Label=&#34；查看我们的推特页面&#34；&gt；&lt；img src=&#34；twitter.svg&34；/&g。\n要了解每个表单元素的用途，需要使用有用的表单标签。视力正常的用户通常可以通过使用诸如标签与元素的接近程度或元素的占位符之类的信息来推断这一目的。但是，屏幕阅读器不能做出这些假设，因此它要求标签以编程方式与元素相关联。\n单击以编程方式关联的Label元素也会激活该控件。这有利于运动技能受损的用户，或任何使用小屏幕的用户，因为它提供了更大的可点击区域。\n给标签一个for属性，它等于输入元素的id。\n为输入元素赋予aria-labelledby属性，该属性等于充当标签的元素的id。\n&lt；！--❌缺少输入标签--&gt；&lt；标签&gt；名称&lt；/标签&&gt;；&lt；输入/&lt；/div&&gt;；&lt；输入/&&gt;；&lt；！--带有输入标签的✅--&lt；&lt；标签&gt；名称：&lt；输入/&&gt;；&lt。&gt；name&lt；/label&gt；&lt；input id=&#34；name&#34；/&gt；&lt；div id=&#34；name&#34；&gt；name&lt；/div&gt；&lt；input aria-labelledby=&#34；name&#34；/&gt；\n当用户配置屏幕阅读器时，他们选择默认语言。如果未指定网站的语言，屏幕阅读器将使用用户设置的默认语言。\n如果用户会说多种语言，则他们可能正在访问用与其屏幕阅读器上的默认语言不同的语言编写的网站。如果使用了错误的语言库，单词的发音会很奇怪，导致网站无法使用。\n将lang属性添加到html元素，该元素的值表示网站的主要语言。该属性的可能值可以在IANA语言子标记注册表中找到，也可以通过使用语言子标记查找工具找到。\n&lt；！--❌缺少lang属性--&gt；&lt；html&gt；&lt；！--文档头和正文--&gt；&lt；/html&gt；&lt；！--具有lang属性的✅--&gt；&lt；html lang=&#34；en&#34；&gt；&lt；！--文档头和正文--&gt；&lt；/html&gt；\n如果网站内的语言发生更改，您可以使用另一个lang属性进行指定。如果语言是从右向左书写的，您还应该使用dir属性指定它。\n一种语言的&lt；p&&gt;文本&lt；span lang=&#34；es&34；&gt；text to en otro idioma&lt；/p&gt；&lt；p lang=&#34；ar&#34；dir=&#34；rtl&34；&gt；النصالعربيهنا&lt；/p&gt；\n对于希望创建高质量网站和Web工具并不排斥人们使用其产品和服务的开发人员和组织来说，辅助功能至关重要。\n在构建网站时，特别是作为一个可能不受故障影响的人，可能很难记住在网站中包含可访问性。幸运的是，工具和资源可以帮助我们。\n如上所述，灯塔是一个令人难以置信的检查网站质量的工具。它可以在几个类别中创建审计，包括性能、SEO和可访问性。他们提供浏览器扩展，如果你使用的是谷歌Chrome，它已经内置到Chrome DevTools中了。\nDeque还提供了适用于Chrome和Firefox的Axe浏览器扩展。与LighTower一样，此扩展将列出当前页面的可访问性问题。如果选择问题，则可以突出显示该问题的每个元素。它还提供了详细信息，如问题是什么、问题的严重性，并提供了一个链接，您可以在其中了解更多信息。\n通过使用这些工具，我们可以轻松地提高我们网站的可访问性，并帮助实现Web的目标，即“为所有人工作，无论他们的硬件、软件、语言、位置或能力如何”。\n我是位于纽卡斯尔的Scott Logic公司的一名软件开发人员。我对Web应用程序开发特别感兴趣，特别是Reaction/Redux。", "note_en": "“The power of the Web is in its universality. Access by everyone regardless of disability is an essential aspect.”\n  For the past two years,  WebAIM has performed an  accessibility evaluation of the home pages of the top 1,000,000 web sites. Their results show that accessibility errors are still incredibly prevalent, even on popular web sites.\n “Across the one million home pages, 60,909,278 distinct accessibility errors were detected — an average of 60.9 errors per page.”\n  “Users with disabilities would expect to encounter detectable errors on 1 in every 14 home page elements with which they engage.”\n In total, 98.1% of home pages had detectable  WCAG 2 failures - an increase from 97.8% the year before.\n As part of their analysis, WebAIM shared what the six most common WCAG failures were.\n  In this post, I will describe each of these failures, and answer why they are important and how we can fix them. Live demos for each of the failures can be seen with the  demo app.\n    Web sites should have a high colour contrast between all text and the background colour behind it. In other words, the brightness of the text shouldn’t be too close to the background brightness.\n Low contrast text makes it more difficult for the reader to distinguish the shapes and edges of the characters, reducing reading speed and reading comprehension. This problem is emphasised as the text size decreases, making this issue increasingly important as the number of mobile users continues to grow.\n  The difficulties with low contrast text are magnified for those who experience low vision.  One in twelve people cannot see the full spectrum of colours. Many older people lose contrast sensitivity from ageing. A person with low vision will be unable to read text which is against a background without sufficient contrast.\n  One of the reasons low contrast text is so common is that it’s so hard to detect. When writing or reviewing some code, you may see the text has a hex value of  #f2f2f2, and the background has a value of  #808dd1. Is that a sufficient colour contrast? Even checking how it looks on screen, it’s hard to determine whether the contrast is sufficient for those with low vision or on smaller screens.\n  Fortunately, there are several tools which can measure the colour contrast automatically and highlight any which fail to meet the success criterion.\n Lighthouse is a tool created by Google and is already built into the browser if you’re using Google Chrome (there are also browser extensions for other browsers).  Running an audit will generate a report which will flag the accessibility issues on the web site. It will list any elements it detects whose text background and foreground colours don’t have a sufficiently high contrast ratio.\n  Once you’re aware of the elements which fail to meet the success criteria, you can adjust the background and foreground colours to increase the contrast.\n There are multiple  colour contrast analysers which can help you find two colours with sufficient contrast. If you are using Google Chrome, you can use the  Chrome DevTools’ colour picker, which will display two white lines to show the AA and AAA thresholds.\n  WCAG defines  the success criterion for text contrast as a contrast ratio of 4.5:1. For our Hello World example above, we can see that the colour contrast is only 2.82, which doesn’t reach the threshold. By increasing the contrast, we can improve the readability and accessibility of the element.\n   “31.3% of all home page images (12 per page on average) had missing alternative text…\n “These data show that one can expect nearly half of the images on the web to have missing, questionable, or repetitive alternative text.”\n   A screen reader is used by those who are blind or visually impaired. It transmits the visual information on the screen in another form, such as by reading the text aloud.\n Screen readers have no way of translating an image into words. Therefore, it is necessary to give each image a short, descriptive alternative text which will be used by the screen reader to convey the image’s content and purpose.\n  Alternative text should be short and descriptive. It should describe the image’s content and purpose while avoiding any irrelevant details which will dilute the useful details.\n  If the image is shown using an  img tag, you can use the  alt attribute.\n  If the image is shown with another tag, such as the background image of a  div, you can use the  aria-label attribute.\n  If the image is described by the content of another element, you can use the  aria-labelledby attribute.\n &lt;!-- ❌ Missing alternative text --&gt; &lt;img  src= &#34;cow.jpg&#34;  /&gt; &lt;div  class= &#34;cool-bg-image&#34;  /&gt; &lt;div  class= &#34;another-cool-bg-image&#34;  aria-labelledby= &#34;non-existent&#34;  /&gt; &lt;!-- ✅ With alternative text --&gt; &lt;img  src= &#34;cow.jpg&#34;  alt= &#34;a sad seal&#34;  /&gt; &lt;div  class= &#34;cool-bg-image&#34;  aria-label= &#34;an angry alligator&#34;  /&gt; &lt;div  class= &#34;another-cool-bg-image&#34;  aria-labelledby= &#34;my-label&#34;  /&gt; &lt;div  id= &#34;my-label&#34; &gt;a happy hyena &lt;/div&gt;\n If an image is purely decorative, you can give the image an alternative text of  &#34;&#34; to indicate to the screen reader that it shouldn’t be read aloud. This stops the screen reader reading out information that isn’t useful.\n   Link and button text should be discernible by a screen reader. This includes alternative text for images when used as links or buttons.\n It is common on the web for links and buttons to be shown as symbols or images. This is particularly useful when space is limited, such as on smaller screens and mobile devices. However, screen readers will struggle to translate the purpose of these elements to the user.\n For example, we are very used to seeing buttons with a “+” sign to represent adding something to a list, or a logo to represent a link.\n    the link will be read as either the image file name or the URL of the page being linked to.\n These descriptions may be fine when you can see the whole screen and understand the context of the button/link, but a screen reader won’t be able to provide those additional details.\n  Descriptions can be added to buttons and links by using the  aria-label and  aria-labelledby attributes. These descriptions will then be read by the screen reader, giving the user a more clear understanding of the purpose of the element.\n &lt;!-- ✅ With descriptive labels --&gt; &lt;button  aria-label= &#34;Add a playlist&#34; &gt;+ &lt;/button&gt; &lt;a  href= &#34;...&#34;  aria-label= &#34;View our Twitter page&#34; &gt;  &lt;img  src= &#34;twitter.svg&#34;  /&gt; &lt;/a&gt;\n     Useful form labels are necessary to understand the purpose of each form element. This purpose can often be inferred by sighted users, by using information such as the proximity of the label to the element, or the element’s placeholder. However, a screen reader cannot make these assumptions, so it requires that the label be programmatically associated with the element.\n Clicking a programmatically associated label element also activates the control. This benefits users with impaired motor skills, or any user using a small screen, by providing a larger clickable area.\n   Give the label a  for attribute, which is equal to the  id of the input element.\n  Give the input element an  aria-labelledby attribute, which is equal to the  id of the element acting as a label.\n &lt;!-- ❌ Missing input labels --&gt; &lt;label&gt;Name &lt;/label&gt; &lt;input  /&gt; &lt;div&gt;Name &lt;/div&gt; &lt;input  /&gt; &lt;!-- ✅ With input labels --&gt; &lt;label&gt;Name:  &lt;input  /&gt;&lt;/label&gt; &lt;label  for= &#34;name&#34; &gt;Name &lt;/label&gt; &lt;input  id= &#34;name&#34;  /&gt; &lt;div  id= &#34;name&#34; &gt;Name &lt;/div&gt; &lt;input  aria-labelledby= &#34;name&#34;  /&gt;\n   When users configure a screen reader, they select a default language. If the language of a web site is not specified, the screen reader uses the default language set by the user.\n If the user speaks multiple languages, they may be visiting a web site written in a language which is different from the default on their screen reader. If the wrong language library is used, the pronunciations of the words will be strange, making the web site impossible to use.\n  Add a  lang attribute to the html element whose value represents the primary language of the web site. Possible values for the attribute can be found in the  IANA Language Subtag Registry or by using the  Language Subtag Lookup tool.\n &lt;!-- ❌ Missing lang attribute --&gt; &lt;html&gt;  &lt;!--document head and body--&gt; &lt;/html&gt; &lt;!-- ✅ With lang attribute --&gt; &lt;html  lang= &#34;en&#34; &gt;  &lt;!--document head and body--&gt; &lt;/html&gt;\n If the language changes within the web site, you can specify this with another  lang attribute. If the language is written right to left, you should also specify that with the  dir attribute.\n &lt;p&gt;Text in one language  &lt;span  lang= &#34;es&#34; &gt;texto en otro idioma &lt;/span&gt;&lt;/p&gt; &lt;p  lang= &#34;ar&#34;  dir= &#34;rtl&#34; &gt;النص العربي هنا &lt;/p&gt;\n  “Accessibility is essential for developers and organizations that want to create high-quality websites and web tools, and not exclude people from using their products and services.”\n  It can be hard to remember to include accessibility in your web site as you’re building it, especially as a person who may not be affected by the failures. Fortunately, tools and resources can help us.\n As mentioned above,  Lighthouse is an incredible tool for checking the quality of a web site. It can create an audit in several categories, including performance, SEO, and accessibility. They offer browser extensions and, if you’re using Google Chrome, it is already built into the Chrome DevTools.\n Deque also offers the Axe browser extension for  Chrome and  Firefox. Like Lighthouse, this extension will list the accessibility issues for the current page. If you select an issue, you can highlight each of the elements with that issue. It also provides details such as what the issue is, the severity of the issue, and provides a link where you can learn more about it.\n By using these tools, we can easily improve the accessibility of our web sites, and help meet the  goal of the Web “to work for all people, whatever their hardware, software, language, location, or ability”.\n  I am a software developer at Scott Logic, based in Newcastle. I am particularly interested in web app development, especially React/Redux.", "posttime": "2020-07-08 17:15:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "功能,accessibility", "title": "常见的辅助功能问题(以及如何解决这些问题)", "title_en": "Common Accessibility Problems (and How to Fix Them)", "transed": 1, "url": "https://blog.scottlogic.com/2020/07/02/6-most-common-accessibility-problems.html", "via": "", "real_tags": ["功能"]}, {"category": "", "categoryclass": "", "imagename": "ad90e452beb8be4e57d84b5611f46ad7.png", "infoid": 1010508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一切都是从一个想法开始的，那就是为尽可能多的复古机器创造最方便的现代USB鼠标适配器。\n威利六年前开始在业余时间做这项工作。项目目标很简单。\n这个项目来得很快，威利订了第一批。不幸的是，它几乎满足了所有条件，除了一个条件-可靠性。该设计基于FTDI Vinculum2芯片。虽然布局还不错，但工具链却非常不发达(至少当时是这样)。到处都是内存泄漏，调试几乎是不可能的，主要是因为处理器没有文档。此外，不时保存的配置会破坏配置本身的…。太过分了。这个项目已经被放弃了。如果你是一个意志坚强的人，你可以自己试一试。所有在它上面做的工作，都可以在这里访问。如果您有精力突破未完成的、错误的和未记录的代码，您可以查看或使用它。\n与此同时，这个设计被反复从抽屉里挖掘出来，但不幸的是效果不大。最初的一些目标后来证明是不可能实现的。\n直到2019年的愚蠢冒险，这被证明是一个突破。事实证明，对功能齐全的雅达利ST适配器的需求相当大。MouSTer项目由此诞生。\n这个项目得到了一个新的名字“MouSTer”，Kroll(需要翻译)成为了它的教父。我希望他不介意：)。克罗尔是雅达利设备最好的测试员。\n目前，当前的大小已降至最小-DB9插头大小+USB-A插座。\n通过USB闪存驱动器升级固件(需要3秒，其中2秒是引导加载程序需要识别闪存驱动器的时间)。\n最后，在实验室条件下进行了几个月的测试后，一切都像岩石一样坚如磐石地工作。更改固件和配置可以自信地工作，并且没有任何故障。\n按目标大小进行测试-由于COVID19关闭工厂根本没有任何帮助🙁。\n8位Atari将接收一种特殊模式，该模式将覆盖所有PS4 PAD功能、鼠标和其他HID类设备。\n必须强调的是，MouSTer最初是一个雅达利插件，但它的目标是成为多平台适配器！！\n如果您想购买复古设备或硬件模块，请访问我们的商店-&gt；https://retrohax.net/shop/", "note_en": "It all started with an idea to create the most convenient modern USB mouse adapter for as many retro machines as possible.\n Willy started working on it in his spare-time six years ago. The project goals were simple.\n  The project came about quite quickly and Willy ordered the first batch. Unfortunately, It met almost all conditions but one – reliability. The design was based on the FTDI Vinculum2 chip. Although the layout is not bad, the toolchain is terribly underdeveloped (at least it was at that time). There were memory leaks all over the place, debugging was almost impossible, mainly due to the processor for which there is no documentation. In addition, the configuration saved from time to time destroyed the config itself … It was too much. The project has been abandoned. If you are a strong-willed person you can try it yourself. All work that was done on it, is accessible  HERE. You can view or use it if you have the energy to break through the unfinished, wrong and undocumented code\n  In the meantime, the design was repeatedly unearthed from a drawer, but unfortunately without much effect. Some of the original goals turned out to be impossible to fulfill.\n Up to  Silly Venture 2019 which turned out to be a breakthrough. the demand for a functional Atari ST adapter turned out to be quite large. The mouSTer project was born.\n The project received a new name “The mouSTer” and  Kroll (translator required) became its godfather. I hope he doesn’t mind :). Kroll is the best tester of an Atari equipment around.\n     At the moment, the current size has been reduced to a minimum – DB9 plug size + USB-A socket\n  firmware upgrade via USB flash drive (takes 3 seconds, of which 2 seconds is the time the bootloader needs to recognize the flash drive)\n  Finally, after a few months of testing in laboratory conditions, everything works rock-solid. Changing the firmware and configuration works confidently and is trouble-free.\n         making a test batch in the target size – closing the plant due to COVID19 did not help at all 🙁\n     8-bit Atari will receive a special mode that will cover all the PS4 pad functions, mouse and other HID class devices\n What has to be highlighted is that mouSTer started as an ATARI add-on but it aims to be multi-platform adapter!!\n  If you want to get retro gear or hardware modules, please visit  our shop -&gt; https://retrohax.net/shop/", "posttime": "2020-07-08 17:15:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "适用,mouster", "title": "ProjectMouSTer-适用于逆向计算机的终极鼠标适配器", "title_en": "Project mouSTer – The ultimate mouse adapter for retrocomputers", "transed": 1, "url": "https://retrohax.net/project-mouster-the-ultimate-mouse-adapter-for-retrocomputers/", "via": "", "real_tags": ["适用", "mouster"]}, {"category": "", "categoryclass": "", "imagename": "86c35aab7f959fe9a16d2e03a9bfd161.jpeg", "infoid": 1010507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook仍然没有让民权组织相信，它在打击其平台上的仇恨言论方面做得足够多。\n周二，Facebook首席执行官马克·扎克伯格、首席运营官谢丽尔·桑德伯格和首席产品官克里斯·考克斯会见了全国有色人种协进会、变化之色、新闻自由和反诽谤联盟的领导人，试图解决他们对其仇恨言论政策的担忧。\n在长达一小时的虚拟会议之后，民权组织称这是令人失望的，并在一份声明中表示，很明显Facebook还没有准备好应对他们平台上的尖酸刻薄的仇恨。\nADL首席执行官乔纳森·格林布拉特(Jonathan Greenblatt)周二在与记者的电话会议中表示：今天我们几乎什么也没看到，几乎什么也没听到。他补充说：我们没有得到承诺、时间框架或明确的结果。我们期待的是细节，但这不是我们听到的。\n上个月，这些团体组织了一场大规模的Facebook广告抵制活动，以回应Facebook对唐纳德·特朗普(Donald Trump)总统有争议的帖子的不作为，自那以来，已有500多家公司加入。据路透社报道，与Facebook高管的多次讨论最终破裂，抵制组织者要求扎克伯格亲自出席，因为他是最终权威。\n但是，即使有最高领导层在这个房间里，Facebook也无法说服这些团体，它正在采取足够有力的行动。\n这两个组织在一份声明中表示，他们与Facebook讨论了10项要求，其中包括：拥有民权专业知识的首席执行官、公共和独立的民权审计、修改Facebook围绕仇恨言论和错误信息的审查政策、向广告显示在仇恨言论旁边的广告商退款，以及为经历仇恨或骚扰的用户提供实时客户支持。\n这两个组织表示，Facebook只部分解决了聘请一名民权专家的问题，没有提出任何尝试来解决其他9项要求。\n这些团体表示，Facebook希望我们接受同样的陈词滥调，重新包装为新的回应，而不是真正回应该平台数十个最大广告商的要求，这些广告商在7月份加入了#StopHateForProfit广告抵制活动。\n这次会议给了我们一个机会，让我们听取活动组织者的意见，并重申我们对在我们的平台上打击仇恨的承诺。他们希望Facebook没有仇恨言论，我们也是如此。Facebook的一位发言人告诉“商业内幕”(Business Insider)，这就是为什么我们努力把这件事做好是如此重要的原因。他补充说，Facebook已经采取了一系列措施，包括投入人力和财力打击仇恨言论，引入新的政策来处理错误信息，以及禁止仇恨团体。\nFacebook还计划在周三公布始于2018年的民权审计，但桑德伯格在周二的一篇帖子中表示，该公司并没有遵循每一条建议。\nFacebook正面临越来越多的批评人士，他们表示需要采取更多措施打击其平台上的种族主义和仇恨言论。在首席执行官马克·扎克伯格(Mark Zuckerberg)为自己不对特朗普的帖子采取行动的决定进行辩护后，Facebook的员工以及扎克伯格的慈善倡议遭到了反抗。“华盛顿邮报”(The Washington Post)上周报道称，早在2015年，Facebook就为总统制定了豁免条款。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "Facebook still hasn&#39;t convinced civil rights groups that it&#39;s doing enough to combat hate speech on its platform.\n On Tuesday, Facebook CEO Mark Zuckerberg, COO Sheryl Sandberg, and Chief Product Officer Chris Cox met with the leaders of the NAACP, Color of Change, Free Press, and the Anti-Defamation League in an attempt to address their concerns over its hate speech policies.\n Following the hour-long virtual meeting, civil rights groups called it a &#34;disappointment&#34; and said in a statement that it was clear Facebook &#34;is not yet ready to address the vitriolic hate on their platform.&#34;\n &#34;Today we saw little and heard just about nothing,&#34; ADL CEO Jonathan Greenblatt said in a call with reporters Tuesday, adding: &#34;We didn&#39;t get commitments or time frames or clear outcomes. we expected specifics and that&#39;s not what we heard.&#34;\n   Last month, the groups organized a massive Facebook ad boycott in response to its inaction on controversial posts by President Donald Trump that  more than 500 companies have since joined. Multiple discussions with Facebook executives ultimately broke down, with the boycott organizers demanding that Zuckerberg personally attend because &#34;he is the ultimate authority,&#34;  Reuters reported.\n But even with its top leadership in the room, Facebook wasn&#39;t able to persuade the groups that it&#39;s taking strong enough action.\n The groups said in a statement that they discussed 10 demands with Facebook, which included items such as: a C-suite level executive with civil rights expertise, public and independent civil rights audits, changes to Facebook&#39;s  moderation policies around hate speech and misinformation, refunds to advertisers whose ads are shown next to hate speech, and live customer support for users experience hate or harassment.\n Facebook only partially addressed hiring a civil rights expert and &#34;offered no attempt&#34; to address the other nine demands, the groups said.\n   &#34;Instead of actually responding to the demands of dozens of the platform&#39;s largest advertisers that have joined the #StopHateForProfit ad boycott during the month of July, Facebook wants us to accept the same old rhetoric, repackaged as a fresh response,&#34; the groups said.\n &#34;This meeting was an opportunity for us to hear from the campaign organizers and reaffirm our commitment to combating hate on our platform. They want Facebook to be free of hate speech and so do we. That&#39;s why it&#39;s so important that we work to get this right,&#34; a Facebook spokesperson told Business Insider, adding that it has taken a number of steps, including investing people and financial resources into combatting hate speech, introducing  new policies to address misinformation, and  banning hate groups.\n Facebook also plans to release its civil rights audit Wednesday — which began in 2018 — but Sandberg said in a post Tuesday that the company  won&#39;t follow every recommendation.\n Facebook is facing a growing chorus of critics who say it needs to do more to combat racism and hate speech on its platform. After CEO Mark Zuckerberg defended his decision not to take action on Trump&#39;s posts,  employees at Facebook as well as  Zuckerberg&#39;s philanthropic initiative revolted, and  The Washington Post reported last week that Facebook has crafted exemptions for the president going as far back as 2015.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-08 16:56:20", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,表示,rights", "title": "民权组织称他们与Facebook高管的会面“令人失望”，并表示该公司还没有准备好解决该平台的“尖酸刻薄的仇恨”。", "title_en": "Civil rights groups called their meeting with Facebook execs a 'disappointment' and said the company isn't ready to address the platform's 'vitriolic hate'", "transed": 1, "url": "https://www.businessinsider.com/civil-rights-groups-call-facebook-meeting-a-disappointment-2020-7", "via": "", "real_tags": ["facebook", "表示", "rights"]}, {"category": "", "categoryclass": "", "imagename": "719f4c722006a3e9e3be370518fd9e4f.png", "infoid": 1010506, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PGA是一种基于平面的几何代数，非常适合于三维欧几里德几何中运算的描述和计算。在真实的框架中，它自然包含高效的运动表示，如齐次坐标和双四元数，与面向对象模型完全集成。PGA对四坐标块中的基元和运算符的编码使其非常适合快速GPU实现。为了满足2019年关于PGA的SIGGRAPH演示引起的好奇心，Leo Dorst决定升级2007年出版的计算机科学几何代数(GA4CS)一书的第11章，以类似精确但易于理解的方式处理这些新发展。目前的文本假设一些基本的几何代数知识(虽然它可以在没有这些知识的情况下阅读，作为获得这些知识的激励灵感)。自始至终，我们都尽量做到数学化，并提供到软件演示的插图和链接。本文注意在其所有操作中传播方向符号和比例因子，因为作者认为PGA允许这样一个一致定向的欧几里德几何。不再需要事后猜测手势.。好好享受吧！我们计划在此页面上发布有关新发展的更新，并在本教程的升级版本中介绍基于平面的几何代数。利奥·多斯特·史蒂文·德·肯因克2020年7月", "note_en": "PGA is a  plane-based geometric algebra which appears eminently suited for the description and computation of operations in  3D Euclidean geometry. \rIt naturally contains, in a real framework, efficient motion representations like homogeneous coordinates and dual quaternions, fully integrated with oriented object models. \rPGA&#39;s encoding of primitives and operators in blocks of four coordinates makes it very suitable for  fast GPU\rimplementation.  \r\rTo satisfy the curiosity raised by the   2019 SIGGRAPH presentation on PGA, Leo Dorst decided to upgrade\r Chapter 11 of the 2007 book   Geometric Algebra for Computer Science (GA4CS) to treat these new developments in a similarly precise but accessible style.\r      \r\rThe present text assumes some  basic geometric algebra knowledge (though it could be read without that, as a motivational inspiration to acquire that knowledge). \rThroughout, we try to be no more mathematical than required, and provide  illustrations and links to  software demonstrations.\r   \r\rThis text takes care to propagate  orientational signs and  scaling factors through all its operations, since the author believes that PGA allows for such a consistently  oriented Euclidean geometry. \rGuessing signs afterwards should no longer be required...  \r\rEnjoy! We plan to post updates on new developments on this page, and in upgraded versions of this &#39; Guided Tour to the Plane-Based Geometric Algebra PGA&#39;.  \r\rLeo Dorst \rSteven De Keninck  \r\rJuly 2020", "posttime": "2020-07-08 16:55:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代数,tour,知识", "title": "平面几何代数PGA导游", "title_en": "A Guided Tour of the Plane-Based Geometric Algebra PGA", "transed": 1, "url": "https://bivector.net/PGA4CS.html", "via": "", "real_tags": ["代数", "tour", "知识"]}, {"category": "", "categoryclass": "", "imagename": "dd0892123b5a0a184c66ac8979e191b7.jpg", "infoid": 1010505, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当您在命令行上使用git时，您可能已经使用了消息标志(-m)。它允许开发人员在调用git Commit时内联定义提交消息。\n我不是这种方法的忠实拥趸，因为我更喜欢在VIM中编辑提交消息(我只使用VIM编写提交消息)。它让我有机会仔细检查我正在提交的文件。\n原来您可以多次使用-m选项。GIT文档包括以下段落：\n作者：Stefan Judis日期：Tue Jul 7 21：53：21 2020+0200提交标题提交描述test.txt|0 1文件已更改，0插入(+)，0删除(-)。\n您可以使用多个-m标志来创建&#34；多行提交，我必须承认这在某些情况下非常方便。\n编辑：有几个人指出，打开引号，再按Enter键，再用引号结束提交，就可以实现相同的提交结构，包括标题和正文(多行)。\nGIT COMMIT-m&#34；提交标题引用&&gt;；提交描述&#34；[MASTER 2fe1ef8]第一行文件已更改，0个插入(+)，0个删除(-)创建模式100644测试-2.txt。\n如果你想看看这个命令的运行情况，我在Twitter上分享了一个简短的终端会话和一个小视频。", "note_en": "When you use git on the command line you might have used the message flag ( -m). It allows developers to define commit messages inline when calling git commit.\n  I&#39;m not the biggest fan of this approach because I prefer to edit the commit message in vim (which I only use for writing commit messages). It gives me the opportunity to double-check the files I&#39;m committing.\n  It turns out that you can use the  -m option multiple times.  The git documentation includes the following paragraph:\n     Author: stefan judis  Date: Tue Jul 7 21:53:21 2020 +0200 commit title commit description test.txt | 0 1 file changed, 0 insertions(+), 0 deletions(-)\n You can use multiple  -m flags to create &#34;multiline commits&#34;, and I have to admit that this can be very handy in some cases.\n Edited: Several people pointed out that you can achieve the same commit structure including a title and body (multiple lines) by opening quotes, pressing enter and closing the commit with quotes again.\n git commit -m &#34;commit titledquote&gt;dquote&gt; commit description&#34;[master 2fe1ef8] first line 1 file changed, 0 insertions(+), 0 deletions(-) create mode 100644 test-2.txt\n  If you want to see this command in action,  I shared a short terminal session on Twitter with a little video.", "posttime": "2020-07-08 16:55:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "commit,提交", "title": "Git COMMIT接受几个消息标志(-m)以允许多行提交", "title_en": "Git commit accepts several message flags (-m) to allow multiline commits", "transed": 1, "url": "https://www.stefanjudis.com/today-i-learned/git-commit-accepts-several-message-flags-m-to-allow-multiline-commits/", "via": "", "real_tags": ["commit", "提交"]}, {"category": "", "categoryclass": "", "imagename": "1e2b22629ac0ea750a2d44ba79abfd2c.jpg", "infoid": 1010504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月前，我写过一篇文章，谈到早期的倡导如何承诺设计系统将改善我们产品的一致性，以及这个承诺如何从未真正实现。最近，我一直在思考早期谈话中的另一件事：即设计系统将引入新的、更具协作性的工作方式。\n这是Airbnb设计团队在2016年发布的一篇帖子，他们在帖子中描述了他们的设计系统如何帮助改善设计师和工程师之间的合作：\n设计师和工程师之间的差距只会越来越大。设计团队往往很难达到平衡创作过程和持续创新周期的节奏。质量受到影响，体验变得不那么有凝聚力，有才华的人仅仅是在管理跨学科的沟通上就花费了过多的时间。\n您可能对Airbnb描述的流程非常熟悉。设计师可能会在Sketch或Photoshop等设计应用程序中“模拟”新功能，然后将这些设计交给工程师来实现。有两个规程，每个规程都有自己的工作空间：面向设计人员的布局应用程序；面向工程师的代码应用程序。\n…。我们将代码作为一种设计工具进行投资。更接近于使用不仅包括布局和设计，还包括逻辑和数据的资产。这有助于弥合工程师和设计师之间的差距，从而减少对设计规格或红线的需求，以及愿景和现实之间的步骤。\n换句话说，Airbnb构建了一套社交工具，每个工具都融合了他们设计系统中的生活模式。设计师可以将实时数据和内容放入他们的原型中；工程师可以更直接地参与早期的设计探索。这些工具让设计师和工程师可以有效地并排坐在一起，并在设计系统中快速地从活的图案中组装新的概念。根据Airbnb的说法，这种协作基础设施将设计和工程更紧密地联系在一起。\n我认为这是一篇很棒的文章，甚至是一个更好的案例研究。更重要的是，它代表了当时的许多主张：一种论点，即设计系统将使设计师和工程师能够更紧密、更有效地合作。\n但根据我的经验，设计系统并没有给大多数组织带来这种丰富的、跨职能的协作。相反，设计和实现之间的现有分歧已经变得根深蒂固，而且很大程度上是如此。\n现在，这种竖井并不是因为设计系统--不是真的。我可以想出几个导致目前状况的因素，我将依次介绍每一个因素。\n首先，令人惊讶的是，几乎没有现成的技术对将设计和工程更紧密地联系在一起感兴趣。现在，这并不是说协作完全没有改善：像gihub或glitch这样的平台让工程环境变得更加社交化和协作化；像Figma和Abstract这样的实用程序在设计方面也做了同样的事情。换句话说，设计应用程序使设计人员更容易协作；开发应用程序使开发人员更容易协作。\n但自从Airbnb发布帖子以来，已经有四年多的时间了。在这段时间里，每个学科的工作空间之间的差距没有明显的变化。也许你的团队会从Airbnb的AirShots工具中受益，它允许用户在不同的设备或语言集上快速预览数千种模式排列。遗憾的是，像它这样的产品很少。更重要的是，很少有产品专注于设计和实现之间的空间-将设计工作空间和工程工作空间更紧密地联系在一起。这意味着，如果您的组织想要缩小这一差距，您将不得不承担相当数量的定制开发工作。\n当然，有一些工具可以帮助实现这一点。Figma的API提供了对ART文件中定义的值的读取访问，这可以更紧密地将设计决策集成到生产代码中-例如，通过编程从Figma文件中提取设计令牌。但这些只是拼图的一部分，而不是最终的解决方案。因此，对于许多承担系统工作的组织来说，构建自定义工作流基础设施的成本可能高得令人望而却步。\n在过去的几年里，我们的行业见证了围绕前端工程的复杂性的爆炸式增长。设计系统的流行与单页面应用程序模式的兴起以及ANGLE、VUE和Reaction等JavaScript框架的发展相吻合。正如Dave Rupert等人指出的那样，这些框架不是在真空中存在的：每个框架都是软件库和构建环境的生态系统，每个都需要大量的领域专业知识。\n我只想强调一点：这些框架可以为使用它们的组织提供真实、切实的好处。我不是在这里暗示那些好处不存在，也不是在这里批评框架本身。(我不够资格，不太合格，像汤姆·麦克赖特(Tom MacWright)和蒂姆·卡德里克(Tim Kadlec)这样的人写的文章比我写的要好得多。)。但很少讨论的是这种复杂性带来的社会和组织成本。\n当开始一个项目时，我经常会问一个新客户，一个非工程师会如何改变他们的产品设计。例如，如果设计人员想要更新一行CSS，工程师需要为他们实现吗？如果设计者可以自己完成，他们需要安装哪些技术？他们需要学习哪些成分结构或句法？他们的工作将如何审查，由谁审查？设计人员可以自己部署更改吗？\n我问这些问题并不是为了建议设计师应该能够直接更新设计。脚注1相反，它们有助于评估产品技术架构中内置的协作摩擦的数量。换句话说：您的技术堆栈在允许谁为前端做贡献方面做出了什么样的决定？改变这些决定，引入一种不同的工作方式，代价会有多高？对于许多组织来说，跨职能协作的技术障碍可能高得令人无法接受。更重要的是，这种复杂性的代价很少被承认。\n现代数字团队很少就其产生的协作成本来讨论决策。孤立地看待与设计或工程相关的决策是很诱人的，也是很自然的：选择Vue作为前端框架只会影响工程团队，或者迁移到Figma只会影响设计人员。但是其中的每一个都会改变团队的工作方式，从而影响其他团队的工作方式和与他们协作的方式。\n是啊，我知道这听起来有点明显。但我们通常倾向于认为设计系统有别于组织的更广泛的结构，事实并非如此。通常情况下，您的设计系统会成为团队工作方式的一面镜子。如果您想重新思考您的团队的工作方式，不能将其视为您采用设计系统时就会发生的事情。改善协作需要在一开始就是一个明确的目标，并就如何实现这一目标提出明确的建议。在整个过程中做出的每一个决定都需要对照这个目标进行衡量。脚注2。\n…。制作工件、可交付成果--是的，还有模式--的工作才是价值所在，而不是工件本身。\n正如Alla Kholmatova在她的书“设计系统”中所说，设计系统是“一组相互关联的模式和共享的实践”。设计系统的工作远不止模式库：它是您的组织使用这些模式的方式。当您开始定义您的设计系统时，有必要对您的团队的工作方式以及设计系统如何支持更好的工作方式进行一次艰苦的、深思熟虑的讨论。\n去年，我和利维亚·拉巴特一起在Vox Media工作，看到他们在一些与设计系统相关的大型活动中将这一点付诸实施。不用说，利维亚的工作对我在这里的想法产生了巨大的影响。(↩)。\n我现在可以雇佣。这是我做过的一些工作。如果你想和我谈谈你即将进行的项目，请随时与我联系。", "note_en": "A few months back, I wrote about  how early advocacy promised that design systems would improve the consistency of our products, and how that promise never really materialized. Lately, I’ve been thinking about another piece of that early conversation: namely, that design systems would introduce new, more collaborative ways of working.\n Here’s a 2016 post from the Airbnb Design team, in which they describe how  their design system helped improve collaboration between designers and engineers:\n The gap between designers and engineers has only increased. Design teams can often struggle to reach a cadence that balances the creative process and cycles of continuous innovation. Quality suffers, the experience becomes less cohesive, and talented people spend an inordinate amount of time simply managing communication across disciplines.\n The process Airbnb describes might be pretty familiar to you. A designer might “mock up” new features in a design application like Sketch or Photoshop, and then hand off those designs to an engineer for implementation. Two disciplines, each with its own  workspace: a layout application for designers; for engineers, code.\n  …we’re investing in code as a design tool. Moving closer to working with assets that don’t only include layout and design, but also logic and data. This helps bridge the gap between engineers and designers, thus reducing the need for design specs–or redlines–and the steps between vision and reality.\n In other words, Airbnb built a suite of social tools, which each incorporated live patterns from their design system. Designers could pull live data and content into their prototypes; engineers could be more directly involved in early design explorations. These tools allowed designers and engineers to effectively sit side-by-side, and quickly assemble new concepts from live patterns in the design system. And according to Airbnb, that collaborative infrastructure is what brought design and engineering closer together.\n I think this is a wonderful article, and an even better case study. What’s more, it’s representative of much of the advocacy of the time: an argument that design systems would enable designers and engineers to work more closely—and more effectively—together.\n But in my experience, design systems haven’t brought this kind of rich, cross-functional collaboration to most organizations. Instead, the existing divisions between design and implementation have become entrenched, and massively so.\n Now, this siloing isn’t  because of design systems—not really. I can think of a few factors that contributed to the current state of things, and I’m going to look at each in turn.\n  First and foremost, there’s surprisingly little ready-made technology out there that’s interested in bringing design and engineering closer together. Now, that’s not to say collaboration hasn’t improved at all: platforms like  GitHub or  Glitch have made engineering environments much more social and collaborative; utilities like  Figma and  Abstract have done the same for design. In other words, design applications have made it much easier for designers to work together; development applications have made it easier for developers to work together.\n But it’s been over four years since Airbnb’s post. In that time, the gap  between each discipline’s workspace hasn’t changed significantly. Maybe your teams would benefit from something like  Airbnb’s Airshots utility, which allowed its users to quickly preview thousands of pattern permutations across different devices or language sets. Sadly, there are few products like it. What’s more, there are surprisingly few products focused on the space between design and implementation—on bringing design workspaces and engineering workspaces closer together. This means that if your organization wants to close that gap, you’re going to have to take on a fair amount of custom development.\n There are some tools to help with this, of course.  Figma’s API provides read access to values defined in art files, which can more tightly integrate design decisions into production code—for example, by  programmatically extracting design tokens from a Figma file. But these are pieces of the puzzle, not a finished solution. So for many organizations undertaking systems work, the costs to building custom workflow infrastructure can be prohibitively high.\n   In the last few years our industry’s seen an  explosion of complexity around front-end engineering. The popularity of design systems has dovetailed with the rise of  the single-page application pattern, and with it, the growth of JavaScript frameworks like Angular, Vue, and React. And as folks like  Dave Rupert have pointed out, these frameworks don’t exist in a vacuum: each is  an ecosystem of software libraries and build environments, each requiring a heavy amount of domain expertise.\n Just to underline something: these frameworks can offer real, tangible benefits to organizations that use them. I’m not here to suggest those benefits aren’t there, nor am I here to criticize the frameworks themselves. (I’m not qualified, not really, and folks like  Tom MacWright and  Tim Kadlec have written far better pieces than I ever could.) But what’s rarely discussed is the social and organizational cost of that complexity.\n When starting a project, I’ll often ask a new client how a non-engineer might make a change in their product’s design. For example, if a designer wanted to update a line of CSS, does an engineer need to implement it for them? If the designer can do it themselves, what technologies will they need to install? What component structures or syntaxes will they need to learn? How will their work be reviewed, and by whom? Can the designer deploy the change themselves?\n I’m not asking these questions to suggest a designer  should be able to directly update the design.   Footnote 1 Rather, they’re helpful in evaluating the amount of collaborative friction that’s built into the product’s technical architecture. Put another way: what kind of decisions does your technical stack make about who’s allowed to contribute to the front-end? And how expensive will it be to alter those decisions, and introduce a different way of working? For many organizations, the technical barriers to cross-functional collaboration can be unacceptably high. And what’s more, the cost of that complexity is rarely acknowledged.\n   Modern digital teams rarely discuss decisions in terms of the  collaborative costs they incur. It’s tempting—and natural!—to see design- or engineering-related decisions in isolation: that selecting Vue as a front-end framework only impacts the engineering team, or that migrating to Figma only impacts designers. But each of these changes the way that team works, which impacts how other teams will work and collaborate with them.\n Yeah, I realize that sounds a bit obvious. But we’re often inclined to  think of a design system as distinct from an organization’s broader structure, which isn’t the case. More often than not, your design system becomes a mirror of the way your team already works. If you’d like to rethink the way your team works, it can’t be seen as something that  just happens when you adopt a design system. Improved collaboration needs to be a stated goal at the outset, with clear proposals about how to get there. And every decision made throughout the process needs to measured against that goal.   Footnote 2\n  …the work that goes into making artifacts, deliverables — and, yes, patterns — is where the value lies, more than in the artifact itself.\n As Alla Kholmatova said in her book   Design Systems, a design system is “a set of  interconnected patterns and  shared practices.” Design systems work is  much, much more than a pattern library: it’s the way your organization works with those patterns. As you start defining your design system, it’s worth having a hard, thoughtful discussion about the way your team works, and how a design system might support a  better way of working.\n  I worked alongside  Lívia Labate last year at  Vox Media, and watched them put this in action on some large design systems-related initiatives. Needless to say, Lívia’s work was massively influential on my thinking here.  (↩)\n  I’m currently available for hire. Here’s some of  the work I’ve done. If you’d like to talk to me about your upcoming project, feel free to  get in touch.", "posttime": "2020-07-08 16:54:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,design", "title": "我们之间的设计体系", "title_en": "The design systems between us", "transed": 1, "url": "https://ethanmarcotte.com/wrote/the-design-systems-between-us/", "via": "", "real_tags": ["设计", "design"]}, {"category": "", "categoryclass": "", "imagename": "d702027ef97c3b34b1286eab8903d83f.jpg", "infoid": 1010503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "很抱歉，PeerTube似乎与您的Web浏览器不兼容。", "note_en": "We are sorry but it seems that PeerTube is not compatible with your web browser.", "posttime": "2020-07-08 16:54:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,免费,下载,大战,wars", "title": "软件大战免费下载", "title_en": "Software Wars Free Download", "transed": 1, "url": "https://video.detroitquaranteam.com/videos/watch/07696431-2f2d-4926-a429-29ac9c7d22b1", "via": "", "real_tags": ["软件", "免费", "下载", "大战", "wars"]}, {"category": "", "categoryclass": "", "imagename": "6fc95262468d8bbec5245b978cf57a71.jpeg", "infoid": 1010502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是互联网上最早的视频会议工具之一的源代码和二进制文件的存档。它主要是由Ron Frederick编写的，但也包括一些其他人的贡献，以使其支持各种视频捕获设备和压缩算法。有关更详细的作者信息，请参阅各个源文件。\n此代码的大部分版权归施乐公司所有，并在获得以下许可之前发布：\n授予复制、使用以及制作和使用衍生作品用于研究和评估目的的许可，前提是与任何此类拷贝或衍生作品相关的所有文档均承认施乐。施乐不授予任何明示或暗示的其他许可。未经书面许可，不得在任何广告中使用施乐商标名称。\n施乐公司对本软件的适用性或本软件是否适用于任何特定目的不作任何陈述。本软件按原样提供，不提供任何形式的明示或默示担保。\n一些单独的源文件是版权所有的佳能信息系统公司、数字设备公司、太阳微系统公司、海军研究实验室和南加州大学。有关完整的版权和许可信息，请参阅各个源文件。\n1992年10月，我开始使用Sun VideoPix帧采集卡进行实验，我的想法是编写一个基于IP组播的网络视频会议工具。它将模仿LBL开发的音频会议工具--vat&34；，因为它将对加入会议的用户使用类似的轻量级会话协议，在该会议中，您只需将数据发送到特定的多播组，并观察该组中是否有来自其他组成员的流量。\n为了使程序真正成功，它需要在将视频数据放到网络上之前对其进行压缩。我选择的一个目标是制作一个看起来可以接受的数据流，大约128kbps，或标准家庭ISDN线路上可用的带宽。我还希望制作一些仍然可以观看的东西，可以放在这个带宽的一半范围内。这意味着对于我正在使用的特定图像大小和帧速率，我需要大约20倍的压缩。我能够实现这种压缩，并为我使用的技术申请了专利，后来被授予专利US5485212A：用于电话会议的软件视频压缩。\n11月初，我向互联网社区发布了视频会议工具(二进制形式)。经过一些初步测试后，它被用来对11月的互联网工程任务组(Internet Engineering Task Force)的部分活动进行视频转播。15个国家的大约200个子网能够接收到这次广播，在本周的某个时候，大约有50-100人使用NV收到了视频。\n在接下来的几个月里，另外三个研讨会和一些较小的会议已经使用NV&34；在整个互联网上进行了广播，包括澳大利亚网络研讨会、MCNC分组音频和视频研讨会，以及瑞典关于分布式虚拟现实的MultiG研讨会。\n1993年2月发布了NV&34；的源代码，并在3月发布了该工具的新版本，我在其中引入了一个新的基于小波的压缩方案。1993年5月，我添加了对彩色视频的支持。\n用于NV&34；和其他互联网会议工具的网络协议成为实时传输协议(RTP)的基础，该协议通过互联网工程任务组(IETF)标准化，IETF在RFC 1889-1890中首次发布，后来在RFC 3550-3551中进行修订，以及覆盖用于承载特定格式的音频和视频的配置文件的各种其他RFC。\n在接下来的几年里，这项工作仍在继续，将该工具移植到一些额外的硬件平台和视频采集设备上。它继续被用作当时在互联网上广播会议的主要工具之一，包括被美国宇航局选中在线直播航天飞机任务的报道。“。\n1994年，我在NV&34；中添加了对其他人开发的视频压缩算法的支持，包括一些硬件压缩方案，如SunVideo视频采集卡支持的Cellb格式。这也允许NV&34；以CUSeeMe格式发送视频，并将视频发送给在Mac和PC上运行CUSeeMe的用户。\nNV&34；上一次公开发布的版本是3.3测试版，于1994年7月发布。我当时正在开发一个版本，它打算迁移到RTP协议的版本2，但是这项工作一直没有完成。为了完整起见，此存档中包含了4.0 alpha代码的副本，但它尚未完成，并且存在已知问题，特别是在不完整的RTPv2支持方面。\nNV&34；提供的框架后来成为施乐Parc的Jupiter多媒体Moo&34；项目中视频会议的基础，该项目最终成为后来被微软收购的剥离公司PlaceWare&34；的基础。它还被用作许多硬件视频会议项目的基础，这些项目允许通过高带宽以太网和ATM网络发送完整的NTSC广播质量的视频。我后来还将其中一些代码用作基于网络的视频录制和回放服务&Mediastore&34；的基础。", "note_en": "This is an archive of the source code and binaries of one of the veryfirst videoconferencing tools available on the Internet. It was primarilywritten by Ron Frederick, but also includes contributions from a numberof others to adapt it to support various video capture devices andcompression algorithms. See the individual source files for more detailedauthor information.\n   The majority of this code is copyright Xerox Corporation and is releaseduntil the following license:\n License is granted to copy, to use, and to make and to use derivativeworks for research and evaluation purposes, provided that Xerox isacknowledged in all documentation pertaining to any such copy or derivativework. Xerox grants no other licenses expressed or implied. The Xerox tradename should not be used in any advertising without its written permission.\n XEROX CORPORATION MAKES NO REPRESENTATIONS CONCERNING EITHER THEMERCHANTABILITY OF THIS SOFTWARE OR THE SUITABILITY OF THIS SOFTWAREFOR ANY PARTICULAR PURPOSE. The software is provided &#34;as is&#34; withoutexpress or implied warranty of any kind.\n Some individual source files are copyright Canon Information Systems, DigitalEquipment Corporation, Sun Microsystems, the Naval Research Laboratory, andthe University of Southern California. See the individual source files forfull copyright and license information.\n   In October of 1992, I began to experiment with the Sun VideoPix frame grabbercard, with the idea of writing a network videoconferencing tool based upon IPmulticast. It would be modeled after &#34;vat&#34; -- an audioconferencing tooldeveloped at LBL, in that it would use a similar lightweight session protocolfor users joining into conferences, where you simply sent data to a particularmulticast group and watched that group for any traffic from other groupmembers.\n In order for the program to really be successful, it needed to compress thevideo data before putting it out on the network. A goal I chose was to makean acceptable looking stream of data that would fit in about 128kbps, or thebandwidth available on a standard home ISDN line. I also hoped to producesomething that was still watchable that fit in half this bandwidth. Thismeant I needed approximately a factor of 20 in compression for the particularimage size and frame rate I was working with. I was able to achieve thiscompression and filed for a patent on the techniques I used, later grantedas patent  US5485212A: Software video compression for teleconferencing.\n At the beginning of November, I released the videoconferencing tool &#34;nv&#34; (inbinary form) to the Internet community. After some initial testing, it was usedto videocast parts of the November Internet Engineering Task Force all aroundthe world. Approximately 200 subnets in 15 countries were capable ofreceiving this broadcast, and approximately 50-100 people received video using&#34;nv&#34; at some point in the week.\n Over the next couple of months, three other workshops and some smallermeetings have used &#34;nv&#34; to broadcast to the Internet at large, including theAustralian NetWorkshop, the MCNC Packet Audio and Video workshop, and theMultiG workshop on distributed virtual realities in Sweden.\n A source code release of &#34;nv&#34; followed in February of 1993, and in March Ireleased a new version of the tool where I introduced a new wavelet-basedcompression scheme. In May of 1993, I added support for color video.\n The network protocol used for &#34;nv&#34; and other Internet conferencing toolsbecame the basis of the Realtime Transport Protocol (RTP), standardizedthrough the Internet Engineering Task Force (IETF), first published inRFCs  1889- 1890 and later revised in RFCs  3550- 3551, alongwith various other RFCs that covered profiles for carrying specificformats of audio and video.\n Over the next couple of years, work contined on &#34;nv&#34;, porting the toolto a number of additional hardware platforms and video capture devices.It continued to be used as one of the primary tools for broadcastingconferences on the Internet at the time, including being selected by NASAto broadcast live coverage of shuttle missions online.\n In 1994, I added support in &#34;nv&#34; for supporting video compression algorithmsdeveloped by others, including some hardware compression schemes such asthe CellB format supported by the SunVideo video capture card. This alsoallowed &#34;nv&#34; to send video in CUSeeMe format, to send video to usersrunning CUSeeMe on Macs and PCs.\n The last publicly released version of &#34;nv&#34; was version 3.3beta, releasedin July of 1994. I was working on a &#34;4.0alpha&#34; release that was intendedto migrate &#34;nv&#34; over to version 2 of the RTP protocol, but this work wasnever completed. A copy of the 4.0 alpha code is included in this archivefor completeness, but it is unfinished and there are known issues with it,particularly in the incomplete RTPv2 support.\n The framework provided in &#34;nv&#34; later went on to become the basis of videoconferencing in the &#34;Jupiter multi-media MOO&#34; project at Xerox PARC, whicheventually became the basis for a spin-off company &#34;PlaceWare&#34;, lateracquired by Microsoft. It was also used as the basis for a number ofhardware video conferencing projects that allowed sending of full NTSCbroadcast quality video over high-bandwidth Ethernet and ATM networks.I also later used some of this code as the basis for &#34;Mediastore&#34;, whichwas a network-based video recording and playback service.", "posttime": "2020-07-08 16:53:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,代码,ip,video,视频", "title": "网络视频工具：首批发布的IP视频会议工具代码之一", "title_en": "Network Video tool: One of the first IP videoconferencing tools code released", "transed": 1, "url": "https://github.com/ronf/nv", "via": "", "real_tags": ["发布", "代码", "ip", "video", "视频"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010500, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本互联网草案完全符合BCP 78和BCP 79的规定。vbl.。\n互联网草案是互联网工程任务组(IETF)的工作文件。请注意，其他小组也可以将工作文件作为互联网草稿分发。目前的互联网草稿列表在https://datatracker.ietf.org/drafts/current/.。vbl.。\n互联网草案是有效期最长为6个月的草案文件，可随时更新、替换或被其他文件淘汰。使用互联网草稿作为参考材料或将其作为正在进行的工作以外的引用是不合适的。\n版权所有(C)2020 IETF Trust和确认为文档作者的人员。版权所有。vbl.。\n本文件受BCP78和IETF Trust有关IETF文件(https://trustee.ietf.org/license-info))的法律规定的约束，自本文件发布之日起生效。请仔细阅读这些文档，因为它们描述了您对本文档的权利和限制。本文档中提取的代码组件必须包括简化的BSD许可证文本，如信托法律规定的第4.e节所述，并且如简化的BSD许可证中所述，提供的代码组件不提供担保。vbl.。\n域名系统(DNS)是一个独特的分布式数据库，是大多数Internet应用程序的重要服务。虽然DNS是分布式的，但它依赖于集中的、受信任的注册商来提供全局唯一的名称。随着人们对DNS在互联网上的核心作用的认识的提高，各种机构正在利用他们的权力(包括法律手段)对DNS进行攻击，从而威胁到互联网上信息的全球可用性和完整性。vbl.。\nDNS不是以安全为目标设计的。这使得它非常容易受到攻击，特别是对于拥有整个民族国家的技术能力的攻击者来说。本规范描述了一种抗审查、保护隐私和分散的名称系统：GNU名称系统(GNS)。它旨在提供DNS的安全替代方案，特别是在遇到审查或操纵时。GNS可以将名称绑定到任何类型的加密安全令牌上，使其在某些方面能够加倍，甚至可以替代当今的一些公钥基础设施，特别是用于Web的X.509。vbl.。\n本文档包含GNU名称系统[GNS]的GNU名称系统(GNS)技术规范，GNU名称系统是一个完全分散且抗审查的名称系统。GNS为域名系统(DNS)提供了一种隐私增强的替代方案。GNS的设计包含了与DNS集成和共存的能力。GNS基于PetName系统的原理，并以简单分布式安全基础设施(SDSI)的思想为基础，通过将安全标识符分散映射到可记忆的名称来解决一个中心问题：即在没有可信机构的情况下不可能提供全局的、安全的和可记忆的映射。GNS使用SDSI设计中的传递性，将受信任的根替换为安全的授权委派，从而使Petname在非常强的对手模型下操作时对其他用户有用。vbl.\n本文档定义了供实施者使用的资源记录、解析过程、加密例程和安全注意事项的标准有线格式。vbl.。\n本文档中的关键字&#34；必须&#34；，&#34；必须&#34；，&#34；不得&#34；，&#34；不应该&#34；，&#34；不应该&#34；，&#34；推荐&#34；，&#34；可以&#34；，&#34；和&#34；可选&#34；应按照[RFC21中所述解释。vbl.。\nGNS中的区域由公钥/私钥ECDSA密钥对(d，zk)定义，其中d是私钥，zk是相应的公钥。GNS采用曲线25519[RFC7748](也称为。Edwards25519)与ECDSA方案([RFC6979])。在下面的代码中，我们对加密原语使用以下命名约定：Ó。\n是256位的ECDSA私钥。在GNS中，记录使用派生自第#34；d&34；节的密钥进行签名，如第4节所述。\n是对应于d的ECDSA公钥。它在[RFC6979]中被定义为曲线点d*B，其中B是椭圆曲线的群生成器。公钥用于唯一标识GNS区域，称为区域密钥。vbl.。\nGNS实施者必须提供一种机制来创建和管理本地区域的资源记录。通过创建区域密钥对来建立本地区域。可以将记录添加到每个区域，因此必须提供资源记录和区域的(本地)持久性机制。此本地区域数据库由GNS解析器实现使用，并用于发布记录信息。vbl.。\nGNS资源记录保存区域中特定记录的数据。资源记录格式定义如下：Ó。\n0 8 16 24 32 40 48 56+-+-+|到期|+-+-+|数据大小|类型|+-+。--+|标志|DATA/+-+/\n表示记录的绝对64位到期日期。自1970年1月1日午夜(0小时)以来的微秒(以网络字节顺序表示)。vbl.。\n以字节和网络字节顺序表示数据字段的32位大小。vbl.。\n是32位资源记录类型。此类型可以是第3节中定义的GNS资源记录之一，也可以是[RFC1035]中定义的DNS记录类型，或任何互补的标准化DNS资源记录类型。该值必须以网络字节顺序存储。请注意，2^16以下的值保留通过IANA进行分配([RFC6895])。vbl.。\n可变长度资源记录数据负载。内容由资源记录的相应类型定义。vbl.。\n标志指示资源记录周围的元数据。标志值为0表示所有标志均未设置。下面说明了资源记录的32位标志值中的标志分布：？\n.5 4 3 2 1 0-+-+/.|SHADOW|EXPREL|SUPL|PRIVATE|/|-+-+。\n如果设置了此标志，则解析程序应忽略此记录，除非相同记录类型的所有(其他)记录都已过期。用于允许区域发布者将记录的未来值放入分布式哈希表，从而在记录更改时提高性能。这样，未来的值可以传播，并且可以在转换变为活动状态之前进行缓存。vbl.。\n记录的过期时间值是相对时间(仍以微秒为单位)，而不是绝对时间。对于从分布式哈希表获取的记录，解析程序永远不会遇到此标志，但在解析程序查找本地托管的区域的私有记录时可能会出现此标志。vbl.\n这是一份补充记录。它是在提供其他记录的基础上提供的。此标志表示此记录未与相应名称下的其他记录一起显式管理，但可能对应用程序有用。对于从分布式哈希表获取的记录，只有解析器才会遇到此标志。vbl.。\n这是此对等方的私人记录，因此不应在分布式哈希表中发布。因此，对于从分布式哈希表获取的记录，解析器永远不会遇到该标志。在解析本地区域中的标签时，仍应将私有记录视为与常规记录一样。vbl.。\n第10节描述了GNS记录类型的注册表。该注册表的注册策略是先到先得，如[RFC8126]中所述。在请求新条目时，强烈建议仔细考虑以下标准：修复：Ausdenken是wir da gerne haetten。vbl.。\n在GNS中，标签对区域的委托通过PKEY记录表示。PKEY资源记录包含要委派到的区域的公钥。PKEY记录必须是标签下的唯一记录。不允许其他记录。PKEY数据条目的格式如下：\n可以通过GNS2DNS记录将标签委托回DNS。资源记录包含解析程序在DNS中继续使用的DNS名称，后跟DNS服务器。这两个名称都采用[RFC1034]中为DNS名称定义的格式。GNS2DNS数据条目具有以下格式：\n0 8 16 24 32 40 48 56+-+-+|域名|/||+-+-+|域名服务器名称|/。/||+-+。\n要使用的DNS服务器。可以是点分十进制形式的IPv4/IPv6地址或DNS名称。它也可以是以顶级域结尾的相对GNS名称。该值为UTF-8编码(也适用于DNS名称)，以0结尾。vbl.。\n期望在应用层提供DNS名称的应用程序可以使用传统主机名记录。最常见的用例是HTTP虚拟主机，它不能按原样与GNS名称一起使用，因为这些名称可能不是全局唯一的。期望在具有IPv4或IPv6地址的单个资源记录中一起找到LEHO资源记录。LEHO数据条目具有以下格式：？\n注意：如果应用程序在HTTP请求标头(例如&#34；Host：&#34；标头)中使用LEHO值，则必须将其转换为Punycode表示[RFC5891]。vbl.。\n区域管理员可以使用昵称记录来发布有关此区域更喜欢引用的标签的指示。这是对其他区域在创建包含此区域的公共区域密钥的PKEY(第3.2节)记录时使用的标签的建议。此记录只能存储在空标签&#34；@&#34；下，但可以在任何标签下随记录集一起返回，作为补充记录。第6.2.6节详细说明解析器必须如何处理补充和非补充NICK记录。NICK数据条目具有以下格式：？\n表示区域的首选标签的UTF-8字符串(不是以0结尾)。此字符串不能包含&#34；.&#34；字符。vbl.。\n在GNS中，名称中的每个&#34；.&#34；都委托给另一个区域，GNS查找期望在一个记录集中返回所有必需的有用信息。这与DNS用于SRV和TLSA记录的特殊标签不兼容。因此，GNS定义了装箱记录格式来装箱SRV和TLSA记录，并将它们包括在与其关联的标签的记录集中。例如，&#34；_https._tcp.example.org&#34；的TLSA记录将存储在&#34；example.org&#34；的记录集中，作为具有服务(SVC)443(Https)和协议(PROTO)6(TCP)和记录类型&#34；TLSA&#34；的箱式记录。有关参考，另请参阅[RFC2782]。框数据条目具有以下格式：Ó。\n0 8 16 24 32 40 48 56+-+-+|协议|服务|类型|+-+-+|记录数据|/|。|+-+-+。\n装箱记录的16位服务值，即端口号。以网络字节顺序。vbl.。\n是一个可变长度字段，包含DNS中为相应类型定义的类型的数据格式。vbl.。\n0 8 16 24 32 40 48 56+-+-+|托管对等公钥||(256bit)|+-+-+|协议|服务名称。|+-++/||+-+-+\n用于标识宿主对等方的服务的共享密钥，用于派生连接到服务所需的端口号。服务名称必须是以0结尾的UTF-8字符串。vbl.。\nGNS资源记录在分布式哈希表(DHT)中发布。我们假设DHT提供两个功能：get(Key)和put(key，value)。在GNS中，资源记录按其各自的标签分组，在分布式哈希表中的单个资源记录块(RRBLOCK)中以密钥&#34；Q&#34；：PUT(Q，RRBLOCK)加密并一起发布。从区域密钥和所包含记录的相应标签导出的密钥。vbl.。\nprk_h：=HKDF-Extract(&#34；Key-Derivation&#34；，ZK)h：=HKDF-Expand(PRK_h，Label|&#34；GNS&#34；，512/8)d_h：=h*d mod Lzk_h：=h mod L*zkq：=SHA512(ZK_H)。\nvbl.。\n我们使用[RFC5869]中定义的基于散列的密钥派生函数(HKDF)。提取相采用HMAC-SHA512，展开相采用HMAC-SHA256。vbl.。\n是使用HKDF检索的密钥材料，使用字符串Key-Derivation&34；作为SALT，使用公共区域密钥&#34；ZK&34；作为初始密钥材料。vbl.。\n是512位HKDF扩展结果。扩展信息输入是标签和字符串&#34；gns&#34；的串联。vbl.。\n是使用密钥材料从区密钥&#34；ZK&34；导出的256位公钥。vbl.\n是发布资源记录块的512位分布式哈希表密钥。它是对应于派生私钥&#34；d_h&#34；的公钥&#34；zk_h&#34；上的SHA512散列。vbl.。\n我们指出，&#34；ZK&34；与&#34；h；的乘法是点乘，而&#34；d&34；与&#34；h；的乘法是标量乘法。vbl.。\nGNS记录按其标签分组，并在分布式哈希表中作为单个块发布。分组的记录集可以与任何数量的补充记录配对。补充记录必须设置补充标志(参见第3节)。所包含的资源记录使用对称加密方案加密。GNS实现必须根据底层分布式哈希表的属性和建议发布RRBLOCK。这可能包括定期更新发布。GNS RRBLOCK具有以下格式：\n0 8 16 24 32 40 48 56+-+-+|签名|+-+-+|公钥|+-。-+-+|大小|目的|+-+-+|到期|+-+-。-+|bdata/|+-+-+。\n符合[RFC6979]的512位ECDSA确定性签名。对公钥字段后面的数据计算签名。签名是使用派生的私钥&#34；d_h&#34；创建的(参见第4节)。vbl.。\n是用于验证签名的256位公钥&#34；zk_h&#34；。该值的焊线格式在[RFC8032]的第5.1.5节中定义。vbl.。\n一个32位值，包含公钥字段后面的签名数据的长度(按网络字节顺序)。除了BDATA的长度之外，该值始终包括字段Size(4)、Purpose(4)和Expires(8)的长度。当使用32位值时，实现可能会拒绝发布远远低于4 GB的特定大小的块。但是，必须支持62千字节的最小数据块大小。vbl.。\n指定RRBLOCK何时过期，加密块应从分布式哈希表中删除并缓存，因为它可能已过时。但是，应用程序可能会继续使用未过期的单个记录，直到它们过期。该值必须设置为此块中包含的资源记录的过期时间，且过期时间最短。如果记录块包括影子记录，则考虑所有具有匹配类型的影子记录的最大到期时间和非影子记录的到期时间。这是自1970年1月1日午夜(0小时)以来的64位绝对日期(以微秒为单位)，按网络字节顺序排列。vbl.\n使用对称加密方案将资源记录集合RDATA加密到GNS RRBLOCK的BDATA字段中。RDATA的导线格式如下所示：\n0 8 16 24 32 40 48 56+-+-+|RR计数|呼气/+-+-+/-tion|数据大小|+。-+-+|类型|标记|+-+-+|数据/|+-+-。-+|到期|+-+-+|数据大小|类型|+。-+-+|FLAGS|DATA/+-/-//填充/。\n一个32位值，包含按网络字节顺序跟随在此字段之后的可变长度资源记录的数量。vbl.。\n这些字段在第3节的资源记录格式中定义。这些资源记录的RR计数总数必须存在。vbl.。\n填充必须在所有二进制八位数中包含值0。填充必须确保没有RR计数字段的RDATA的大小是2的幂。作为特殊例外，具有(仅)PKEY记录类型的记录集永远不会被填充。请注意，具有PKEY记录的记录集不能包含其他记录。vbl.。\n对称密钥和初始化向量从记录标签和区域密钥导出。对于资源记录块有效载荷的解密，对称密码的密钥材料#34；K#34；和初始化向量#34；IV#34；导出如下：\nprk_k：=HKDF-Extract(&#34；gns-AES-CTX-KEY&#34；，ZK)prk_iv：=HKDF-Extract(&#34；gns-AES-ctx-iv&#34；，zk)k：=HKDF-Expand(PRK_k，Label，512/8)；IV：=HKDF-Expand(PRK_iv，Label，256/8)。\nvbl.\nHKDF是[RFC5869]中定义的基于散列的密钥派生函数。具体地说，HMAC-SHA512用于提取阶段，HMAC-SHA256用于扩展阶段。输出密钥材料是用于对称密钥的64个八位字节(512位)和用于初始化向量的32个八位字节(256位)。我们将得到的密钥材料分为256位的AES[RFC3826]密钥和256位的TWOFISH[TWOFISH]密钥：\n0 8 16 24 32 40 48 56+-+-+|AESKEY|+-+-+|TWOFISHKEY|+。-+-+。\n0 8 16 24 32 40 48 56+-+-+|AESIV|+-+-+|TWOFISH IV|+-+--。-+-+-+。\n密钥和IV用于CFB128-AES-256和CFB128-TWOFISH-256链式对称密码。这两种密码都用于密码反馈(CFB)模式[RFC3826]。vbl.。\nGNS中的所有标签都采用UTF-8[RFC3629]编码。这不包括通过Idna规范[RFC5890]国际化的DNS记录(如CNAME记录)中的任何DNS名称。vbl.。\n通过递归查询分布式哈希表记录存储来解析GNS中的名称。在下面，我们定义如何启动解析以及如何处理解析中的每个迭代。vbl.。\n名称的GNS解析必须从使用区域公钥指示的给定起始区域开始。有关如何确定起始区的详细信息，请参阅第8节。\n当请求GNS名称解析时，客户端可以提供所需的记录类型。如果需要，GNS解析器将使用期望的记录类型来指导处理，例如通过提供VPN记录到A或AAAA记录的转换。但是，在检索到资源记录集之后，仍必须由客户端根据所需的记录类型对记录集进行过滤。vbl.\n在递归名称解析的每个步骤中，都有一个权威区域ZK和一个要解析的名称。该名称可能为空。最初，权威区是起始区。如果名称为空，则将其解释为顶点标签&#34；@&#34；。vbl.。\n验证并按下。\n..", "note_en": "This Internet-Draft is submitted in full conformance with the provisions of BCP 78 and BCP 79. ¶\n Internet-Drafts are working documents of the Internet Engineering Task Force (IETF). Note that other groups may also distribute working documents as Internet-Drafts. The list of current Internet-Drafts is at   https://datatracker.ietf.org/drafts/current/. ¶\n Internet-Drafts are draft documents valid for a maximum of six months and may be updated, replaced, or obsoleted by other documents at any time. It is inappropriate to use Internet-Drafts as reference material or to cite them other than as &#34;work in progress.&#34; ¶\n Copyright (c) 2020 IETF Trust and the persons identified as the document authors. All rights reserved. ¶\n This document is subject to BCP 78 and the IETF Trust&#39;s Legal Provisions Relating to IETF Documents (  https://trustee.ietf.org/license-info) in effect on the date of publication of this document. Please review these documents carefully, as they describe your rights and restrictions with respect to this document. Code Components extracted from this document must include Simplified BSD License text as described in Section 4.e of the Trust Legal Provisions and are provided without warranty as described in the Simplified BSD License. ¶\n  The Domain Name System (DNS) is a unique distributed database and a vital service for most Internet applications. While DNS is distributed, it relies on centralized, trusted registrars to provide globally unique names. As the awareness of the central role DNS plays on the Internet rises, various institutions are using their power (including legal means) to engage in attacks on the DNS, thus threatening the global availability and integrity of information on the Internet. ¶\n DNS was not designed with security as a goal. This makes it very vulnerable, especially to attackers that have the technical capabilities of an entire nation state at their disposal. This specification describes a censorship-resistant, privacy-preserving and decentralized name system: The GNU Name System (GNS). It is designed to provide a secure alternative to DNS, especially when censorship or manipulation is encountered. GNS can bind names to any kind of cryptographically secured token, enabling it to double in some respects as even as an alternative to some of today&#39;s Public Key Infrastructures, in particular X.509 for the Web. ¶\n This document contains the GNU Name System (GNS) technical specification of the GNU Name System  [ GNS], a fully decentralized and censorship-resistant name system. GNS provides a privacy-enhancing alternative to the Domain Name System (DNS). The design of GNS incorporates the capability to integrate and coexist with DNS. GNS is based on the principle of a petname system and builds on ideas from the Simple Distributed Security Infrastructure (SDSI), addressing a central issue with the decentralized mapping of secure identifiers to memorable names: namely the impossibility of providing a global, secure and memorable mapping without a trusted authority. GNS uses the transitivity in the SDSI design to replace the trusted root with secure delegation of authority thus making petnames useful to other users while operating under a very strong adversary model. ¶\n This document defines the normative wire format of resource records, resolution processes, cryptographic routines and security considerations for use by implementors. ¶\n The key words &#34;MUST&#34;, &#34;MUST NOT&#34;, &#34;REQUIRED&#34;, &#34;SHALL&#34;, &#34;SHALL NOT&#34;, &#34;SHOULD&#34;, &#34;SHOULD NOT&#34;, &#34;RECOMMENDED&#34;, &#34;MAY&#34;, and &#34;OPTIONAL&#34; in this document are to be interpreted as described in  [ RFC2119]. ¶\n A zone in GNS is defined by a public/private ECDSA key pair (d,zk), where d is the private key and zk the corresponding public key. GNS employs the curve parameters of the twisted edwards representation of Curve25519  [ RFC7748] (a.k.a. edwards25519) with the ECDSA scheme ( [ RFC6979]). In the following, we use the following naming convention for our cryptographic primitives: ¶\n  is a 256-bit ECDSA private key. In GNS, records are signed using a key derived from &#34;d&#34; as described in  Section 4. ¶\n                    is the ECDSA public key corresponding to d. It is defined in  [ RFC6979] as the curve point d*B where B is the group generator of the elliptic curve. The public key is used to uniquely identify a GNS zone and is referred to as the &#34;zone key&#34;. ¶\n A GNS implementor MUST provide a mechanism to create and manage resource records for local zones. A local zone is established by creating a zone key pair. Records may be added to each zone, hence a (local) persistency mechanism for resource records and zones must be provided. This local zone database is used by the GNS resolver implementation and to publish record information. ¶\n A GNS resource record holds the data of a specific record in a zone. The resource record format is defined as follows: ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| EXPIRATION |+-----+-----+-----+-----+-----+-----+-----+-----+| DATA SIZE | TYPE |+-----+-----+-----+-----+-----+-----+-----+-----+| FLAGS | DATA /+-----+-----+-----+-----+ // // /\n   denotes the absolute 64-bit expiration date of the record. In microseconds since midnight (0 hour), January 1, 1970 in network byte order. ¶\n     denotes the 32-bit size of the DATA field in bytes and in network byte order. ¶\n     is the 32-bit resource record type. This type can be one of the GNS resource records as defined in  Section 3 or a DNS record type as defined in  [ RFC1035] or any of the complementary standardized DNS resource record types. This value must be stored in network byte order. Note that values below 2^16 are reserved for allocation via IANA ( [ RFC6895]). ¶\n          the variable-length resource record data payload. The contents are defined by the respective type of the resource record. ¶\n Flags indicate metadata surrounding the resource record. A flag value of 0 indicates that all flags are unset. The following illustrates the flag distribution in the 32-bit flag value of a resource record: ¶\n ... 5 4 3 2 1 0------+--------+--------+--------+--------+--------+/ ... | SHADOW | EXPREL | SUPPL | PRIVATE| / |------+--------+--------+--------+--------+--------+\n   If this flag is set, this record should be ignored by resolvers unless all (other) records of the same record type have expired. Used to allow zone publishers to facilitate good performance when records change by allowing them to put future values of records into the DHT. This way, future values can propagate and may be cached before the transition becomes active. ¶\n     The expiration time value of the record is a relative time (still in microseconds) and not an absolute time. This flag should never be encountered by a resolver for records obtained from the DHT, but might be present when a resolver looks up private records of a zone hosted locally. ¶\n     This is a supplemental record. It is provided in addition to the other records. This flag indicates that this record is not explicitly managed alongside the other records under the respective name but may be useful for the application. This flag should only be encountered by a resolver for records obtained from the DHT. ¶\n     This is a private record of this peer and it should thus not be published in the DHT. Thus, this flag should never be encountered by a resolver for records obtained from the DHT. Private records should still be considered just like regular records when resolving labels in local zones. ¶\n A registry of GNS Record Types is described in Section 10. The registration policy for this registry is &#34;First Come First Served&#34;, as described in  [ RFC8126]. When requesting new entries, careful consideration of the following criteria is strongly advised: FIXME: ausdenken was wir da gerne haetten. ¶\n In GNS, a delegation of a label to a zone is represented through a PKEY record. A PKEY resource record contains the public key of the zone to delegate to. A PKEY record MUST be the only record under a label. No other records are allowed. A PKEY DATA entry has the following format: ¶\n It is possible to delegate a label back into DNS through a GNS2DNS record. The resource record contains a DNS name for the resolver to continue with in DNS followed by a DNS server. Both names are in the format defined in  [ RFC1034] for DNS names. A GNS2DNS DATA entry has the following format: ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| DNS NAME |/ // /| |+-----+-----+-----+-----+-----+-----+-----+-----+| DNS SERVER NAME |/ // /| |+-----------------------------------------------+\n   The DNS server to use. May be an IPv4/IPv6 address in dotted decimal form or a DNS name. It may also be a relative GNS name ending with a &#34;+&#34; top-level domain. The value is UTF-8 encoded (also for DNS names) and 0-terminated. ¶\n Legacy hostname records can be used by applications that are expected to supply a DNS name on the application layer. The most common use case is HTTP virtual hosting, which as-is would not work with GNS names as those may not be globally unique. A LEHO resource record is expected to be found together in a single resource record with an IPv4 or IPv6 address. A LEHO DATA entry has the following format: ¶\n     NOTE: If an application uses a LEHO value in an HTTP request header (e.g. &#34;Host:&#34; header) it must be converted to a punycode representation  [ RFC5891]. ¶\n Nickname records can be used by zone administrators to publish an indication on what label this zone prefers to be referred to. This is a suggestion to other zones what label to use when creating a PKEY ( Section 3.2) record containing this zone&#39;s public zone key. This record SHOULD only be stored under the empty label &#34;@&#34; but MAY be returned with record sets under any label as a supplemental record.  Section 6.2.6 details how a resolver must process supplemental and non-supplemental NICK records. A NICK DATA entry has the following format: ¶\n    A UTF-8 string (which is not 0-terminated) representing the preferred label of the zone. This string MUST NOT include a &#34;.&#34; character. ¶\n In GNS, every &#34;.&#34; in a name delegates to another zone, and GNS lookups are expected to return all of the required useful information in one record set. This is incompatible with the special labels used by DNS for SRV and TLSA records. Thus, GNS defines the BOX record format to box up SRV and TLSA records and include them in the record set of the label they are associated with. For example, a TLSA record for &#34;_https._tcp.example.org&#34; will be stored in the record set of &#34;example.org&#34; as a BOX record with service (SVC) 443 (https) and protocol (PROTO) 6 (tcp) and record TYPE &#34;TLSA&#34;. For reference, see also  [ RFC2782]. A BOX DATA entry has the following format: ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| PROTO | SVC | TYPE |+-----------+-----------------------------------+| RECORD DATA |/ // /| |+-----+-----+-----+-----+-----+-----+-----+-----+\n   the 16-bit service value of the boxed record, i.e. the port number. In network byte order. ¶\n          is a variable length field containing the &#34;DATA&#34; format of TYPE as defined for the respective TYPE in DNS. ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| HOSTING PEER PUBLIC KEY || (256 bits) || || |+-----------+-----------------------------------+| PROTO | SERVICE NAME |+-----------+ +/ // /| |+-----+-----+-----+-----+-----+-----+-----+-----+\n   a shared secret used to identify the service at the hosting peer, used to derive the port number requird to connect to the service. The service name MUST be a 0-terminated UTF-8 string. ¶\n GNS resource records are published in a distributed hash table (DHT). We assume that a DHT provides two functions: GET(key) and PUT(key,value). In GNS, resource records are grouped by their respective labels, encrypted and published together in a single resource records block (RRBLOCK) in the DHT under a key &#34;q&#34;: PUT(q, RRBLOCK). The key &#34;q&#34; which is derived from the zone key &#34;zk&#34; and the respective label of the contained records. ¶\n PRK_h := HKDF-Extract (&#34;key-derivation&#34;, zk)h := HKDF-Expand (PRK_h, label | &#34;gns&#34;, 512 / 8)d_h := h * d mod Lzk_h := h mod L * zkq := SHA512 (zk_h)\n ¶\n We use a hash-based key derivation function (HKDF) as defined in  [ RFC5869]. We use HMAC-SHA512 for the extraction phase and HMAC-SHA256 for the expansion phase. ¶\n  is key material retrieved using an HKDF using the string &#34;key-derivation&#34; as salt and the public zone key &#34;zk&#34; as initial keying material. ¶\n     is the 512-bit HKDF expansion result. The expansion info input is a concatenation of the label and string &#34;gns&#34;. ¶\n                    is a 256-bit public key derived from the zone key &#34;zk&#34; using the keying material &#34;h&#34;. ¶\n          Is the 512-bit DHT key under which the resource records block is published. It is the SHA512 hash over the public key &#34;zk_h&#34; corresponding to the derived private key &#34;d_h&#34;. ¶\n We point out that the multiplication of &#34;zk&#34; with &#34;h&#34; is a point multiplication, while the multiplication of &#34;d&#34; with &#34;h&#34; is a scalar multiplication. ¶\n GNS records are grouped by their labels and published as a single block in the DHT. The grouped record sets MAY be paired with any number of supplemental records. Supplemental records must have the supplemental flag set (See  Section 3). The contained resource records are encrypted using a symmetric encryption scheme. A GNS implementation must publish RRBLOCKs in accordance to the properties and recommendations of the underlying DHT. This may include a periodic refresh publication. A GNS RRBLOCK has the following format: ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| SIGNATURE || || || || || || || |+-----+-----+-----+-----+-----+-----+-----+-----+| PUBLIC KEY || || || |+-----+-----+-----+-----+-----+-----+-----+-----+| SIZE | PURPOSE |+-----+-----+-----+-----+-----+-----+-----+-----+| EXPIRATION |+-----+-----+-----+-----+-----+-----+-----+-----+| BDATA // // |+-----+-----+-----+-----+-----+-----+-----+-----+\n   A 512-bit ECDSA deterministic signature compliant with  [ RFC6979]. The signature is computed over the data following the PUBLIC KEY field. The signature is created using the derived private key &#34;d_h&#34; (see  Section 4). ¶\n     is the 256-bit public key &#34;zk_h&#34; to be used to verify SIGNATURE. The wire format of this value is defined in  [ RFC8032], Section 5.1.5. ¶\n     A 32-bit value containing the length of the signed data following the PUBLIC KEY field in network byte order. This value always includes the length of the fields SIZE (4), PURPOSE (4) and EXPIRATION (8) in addition to the length of the BDATA. While a 32-bit value is used, implementations MAY refuse to publish blocks beyond a certain size significantly below 4 GB. However, a minimum block size of 62 kilobytes MUST be supported. ¶\n          Specifies when the RRBLOCK expires and the encrypted block SHOULD be removed from the DHT and caches as it is likely stale. However, applications MAY continue to use non-expired individual records until they expire. The value MUST be set to the expiration time of the resource record contained within this block with the smallest expiration time. If a records block includes shadow records, then the maximum expiration time of all shadow records with matching type and the expiration times of the non-shadow records is considered. This is a 64-bit absolute date in microseconds since midnight (0 hour), January 1, 1970 in network byte order. ¶\n A symmetric encryption scheme is used to encrypt the resource records set RDATA into the BDATA field of a GNS RRBLOCK. The wire format of the RDATA looks as follows: ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| RR COUNT | EXPIRA- /+-----+-----+-----+-----+-----+-----+-----+-----+/ -TION | DATA SIZE |+-----+-----+-----+-----+-----+-----+-----+-----+| TYPE | FLAGS |+-----+-----+-----+-----+-----+-----+-----+-----+| DATA // // |+-----+-----+-----+-----+-----+-----+-----+-----+| EXPIRATION |+-----+-----+-----+-----+-----+-----+-----+-----+| DATA SIZE | TYPE |+-----+-----+-----+-----+-----+-----+-----+-----+| FLAGS | DATA /+-----+-----+-----+-----+ // +-----------------------// | /+-----------------------+ // PADDING // /\n   A 32-bit value containing the number of variable-length resource records which are following after this field in network byte order. ¶\n     These fields were defined in the resource record format in  Section 3. There MUST be a total of RR COUNT of these resource records present. ¶\n     The padding MUST contain the value 0 in all octets. The padding MUST ensure that the size of the RDATA WITHOUT the RR COUNT field is a power of two. As a special exception, record sets with (only) a PKEY record type are never padded. Note that a record set with a PKEY record MUST NOT contain other records. ¶\n The symmetric keys and initialization vectors are derived from the record label and the zone key &#34;zk&#34;. For decryption of the resource records block payload, the key material &#34;K&#34; and initialization vector &#34;IV&#34; for the symmetric cipher are derived as follows: ¶\n PRK_k := HKDF-Extract (&#34;gns-aes-ctx-key&#34;, zk)PRK_iv := HKDF-Extract (&#34;gns-aes-ctx-iv&#34;, zk)K := HKDF-Expand (PRK_k, label, 512 / 8);IV := HKDF-Expand (PRK_iv, label, 256 / 8)\n ¶\n HKDF is a hash-based key derivation function as defined in  [ RFC5869]. Specifically, HMAC-SHA512 is used for the extraction phase and HMAC-SHA256 for the expansion phase. The output keying material is 64 octets (512 bit) for the symmetric keys and 32 octets (256 bit) for the initialization vectors. We divide the resulting keying material &#34;K&#34; into a 256-bit AES  [ RFC3826] key and a 256-bit TWOFISH  [ TWOFISH] key: ¶\n 0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| AES KEY || || || |+-----+-----+-----+-----+-----+-----+-----+-----+| TWOFISH KEY || || || |+-----+-----+-----+-----+-----+-----+-----+-----+\n  0 8 16 24 32 40 48 56+-----+-----+-----+-----+-----+-----+-----+-----+| AES IV || |+-----+-----+-----+-----+-----+-----+-----+-----+| TWOFISH IV || |+-----+-----+-----+-----+-----+-----+-----+-----+\n The keys and IVs are used for a CFB128-AES-256 and CFB128-TWOFISH-256 chained symmetric cipher. Both ciphers are used in Cipher FeedBack (CFB) mode  [ RFC3826]. ¶\n All labels in GNS are encoded in UTF-8  [ RFC3629]. This does not include any DNS names found in DNS records, such as CNAME records, which are internationalized through the IDNA specifications  [ RFC5890]. ¶\n Names in GNS are resolved by recursively querying the DHT record storage. In the following, we define how resolution is initiated and each iteration in the resolution is processed. ¶\n GNS resolution of a name must start in a given starting zone indicated using a zone public key. Details on how the starting zone may be determined is discussed in  Section 8. ¶\n When GNS name resolution is requested, a desired record type MAY be provided by the client. The GNS resolver will use the desired record type to guide processing, for example by providing conversion of VPN records to A or AAAA records, if that is desired. However, filtering of record sets according to the required record types MUST still be done by the client after the resource record set is retrieved. ¶\n In each step of the recursive name resolution, there is an authoritative zone zk and a name to resolve. The name may be empty. Initially, the authoritative zone is the start zone. If the name is empty, it is interpreted as the apex label &#34;@&#34;. ¶\n  Verify and pr\n......", "posttime": "2020-07-08 16:33:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "名称,system,记录", "title": "GNU名称系统IETF草案", "title_en": "The GNU Name System IETF Draft", "transed": 1, "url": "https://tools.ietf.org/id/draft-schanzen-gns-01.html", "via": "", "real_tags": ["名称", "system", "记录"]}]