[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1074378, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "简要介绍一下上下文：上周在人工智能中包括了一份每周人工智能新闻摘要的时事通讯、一个报道赛义德新闻的播客，以及评论这条新闻的社论。如果你订阅，我们会很高兴的！\nTLDR：在OpenAI Cheif科学家Ilya Sutskever在推特上表示大型神经网络可能“稍微有意识”之后，AI推特和其他地方引发了一场激烈的辩论。虽然辩论是健康的，但它们忽略了更广泛的一点，即负责任的科学传播的必要性。这条长达一周的推文已经被许多流行sci文章引用为人工智能正在变得“有意识”的证据，鉴于萨茨基在OpenAI中的角色，这一牵强的说法将误导许多人。人工智能研究人员，尤其是那些拥有大量媒体追随者的研究人员，有责任准确地告知公众，或者至少避免误导公众。\n上周三，OpenAI首席科学家Ilya Sutskever发布了上述推文，它立即成为热门话题。许多人工智能专家加入了“当前人工智能是否有意识？”在接下来的几天里进行了辩论。许多人驳斥了这一说法，认为当前神经网络结构的局限性及其使用的非实体化方式阻止了此类算法被认为是“有意识的”\n鉴于这些负面反应，OpenAI首席执行官山姆·奥尔特曼为萨茨克的说法进行了辩护，但同时向所有人保证，他认为GPT-3，甚至GPT-4不会“以任何方式使用这个词”：\n引用Sutskever的推文，许多媒体开始用以下标题报道这一主张：\n值得赞扬的是，大多数文章确实引用了研究人员的话，他们驳斥了这一说法，并避免说人工智能是有意识的，只是因为萨茨克弗发了推特。尽管如此，这条推文所产生的炒作是言过其实的，如果一个不知情的公众获得了人工智能可能具有某种意识的错误印象，这一点也不足为奇。\n除了直接辩论和媒体报道外，许多专家对社区的反应进行了评论。Bender教授在这方面有一个很好的思路（我们建议读者查看整个思路）：\n但并不是所有的反应都那么严重。人工智能推特（AI Twitter）在制作模因方面进行了一天的努力，对最初的推特和随后的争议都进行了取笑。以下是一些例子：\n专家们基本上同意，目前的人工智能形式在任何意义上都是无意识的。虽然已经有很多关于“计算意识”的研究，或者一些可能被认为是有意识的东西是如何通过计算机实现的，但这些研究都是非常初步的，没有提供任何关于建造“有意识”机器的具体计划。现实是，我们对意识没有一个被广泛接受的定义，更不用说理解了。声称我们已经在计算机上复制了这样一个模糊的概念，充其量也不太可能。诚然，如果还规定了意识的特定定义，这种说法也可能是合理的。\nSutskever的推文被“断章取义”以产生炒作，正是这种炒作引发了辩论。Twitter不是进行细微讨论的地方，一条推文不可能传达出平衡、深思熟虑的人工智能意识所需的所有细节。此外，看看Sutskever过去的推文，很明显，它们不是严肃的宣言，而是零散的想法，这些想法本身是完全正确的。然而，鉴于Sutskever在OpenAI中的突出地位，这条推文的严重性被夸大，以建立有意识人工智能的炒作，这迫使其他人工智能研究人员谴责并澄清当前的人工智能没有意识。这场辩论让公众更多地关注了整个考验，或许具有讽刺意味的是，它进一步放大了最初的推文。\n这一事件突显了对人工智能研究进行更负责任沟通的必要性。人工智能作为一个技术领域对炒作并不陌生，我们过去曾认为，该领域缺乏人工智能研究人员更细致、更冷静的沟通。问题不是Sutskever的随意推文；问题是，一个不熟悉人工智能的人很容易就因为一位著名的研究人员在推特上发表了一个温和的猜测而相信了一些不真实的东西。这一切都有助于在公众中建立对人工智能系统的不合理期望，进而误导公众情绪、流行文化和公共政策。正如俗话所说：拥有强大的（公共关系）权力，就意味着巨大的（公共传播）责任。我们希望更多的人工智能研究人员认识到这一点，并负责任地发推特。", "note_en": "Quick bit of context: Last Week in AI includes a newsletter with  weekly digests of AI news, a  podcast covering said news, and  editorials commenting on this news. We’d love it if you subscribed!\n     TLDR: After OpenAI Cheif Scientist Ilya Sutskever tweeted that large neural nets may be “slightly conscious,” a torrent of debate ensued on AI Twitter and elsewhere. While debates are healthy, they miss the broader point about the need for responsible science communication. The week-old tweet has already been quoted by many pop-sci articles as evidence that AI is becoming “conscious,” a far-fetched claim that will mislead many, given Sutskever’s role at OpenAI. AI researchers, especially ones that have large media followings, have a responsibility to accurately inform the public, or at least refrain from misleading them.\n   Last Wednesday, Ilya Sutskever, Chief Scientist at OpenAI, sent out the above Tweet, and it instantly became a hot topic. Many AI experts joined the “is current AI conscious?” debate in the days that followed. Many rebuked the claim and argued that the limitations of current neural network architectures and the disembodied way they’re used prevent such algorithms from ever being considered “conscious.”\n       In view of the negative responses, Sam Altman, CEO of OpenAI, defended Sutskever’s claim, but at the same time reassured everyone that he does not think GPT-3, or even GPT-4, will be conscious “in any way we use the word”:\n   Quoting Sutskever’s tweet, many media outlets began running articles covering the claim with headlines like:\n  To their credit, most articles did quote from researchers who rebuked the claim and refrained from saying that AI is conscious just because Sutskever tweeted so. Still, the hype that this single tweet generated is overblown, and it is not at all surprising if an uninformed member of the public receives the misguided impression that AI probably has some form of consciousness.\n On top of the direct debate and the media coverage, many experts gave commentary on the community response. Professor Bender has a great thread on this (we recommend readers to check out the whole thread):\n    But not all responses were as serious. AI Twitter had a field day making memes that poke fun at both the original Tweet and the controversy that followed. Some examples below:\n        Experts largely agree that current forms of AI are not conscious, in any sense of the word. While there have been  many studies on “computational consciousness,” or how something that might be considered conscious can be realized with computers, these studies are very preliminary and do not offer anything close to a concrete plan on building “conscious” machines. The reality is that we don’t have a widely accepted definition, let alone understanding, of  consciousness. Claiming that we have already replicated such a nebulous concept with computers seems improbable at best. Granted, the claim could also be reasonable, if a particular definition of consciousness was specified as well.\n Sutskever’s tweet was “taken out of context” to generate hype, and it is this hype that triggered the debate. Twitter is not the place for nuanced discussion and a single tweet cannot possibly convey all the details necessary for a balanced, well-thought-out take on the consciousness of AI. Moreover, looking at Sutskever’s past tweets, it is clear that they are not serious proclamations but rather scattered thoughts, which by themselves are totally fine. However, given Sutskever’s prominent position at OpenAI, the seriousness of this particular tweet was blown out of proportions to build the hype of conscious AIs, which pressured other AI researchers to rebuke and clarify that current AIs are not conscious. This debate gave more public attention to the whole ordeal, and, perhaps ironically, helped amplify the original tweet even more.\n This event highlights the need for more responsible communication for AI research. AI as a technological field is no stranger to  hype, and we have  argued in the past that the field lacks more nuanced, level-headed communication by AI researchers. The problem isn’t Sutskever’s off-handed tweet; the problem is someone not familiar with AI becoming easily convinced of something that is not true, just because a famous researcher tweeted a mild speculation. This all helps to build unreasonable expectations of AI systems in the public, which in turn will misguide public sentiments, popular culture, and public policy.  As the cliché goes: with great (public relations) power, comes great (public communications) responsibility. We hope more AI researchers recognize this and tweet responsibly.", "posttime": "2022-02-21 06:24:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "神经网络,人工智能,nets", "title": "神经网络没有“轻微的意识”，人工智能公关可以用较少的炒作来实现", "title_en": "Neural nets are not “slightly conscious,” and AI PR can do with less hype", "transed": 1, "url": "https://lastweekin.ai/p/conscious-ai", "via": "", "real_tags": ["神经网络", "人工智能", "nets"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074377, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年，我在印度古吉拉特邦的阿南德探望家人，见到了我们的邻居巴拉特拜·帕特尔，他是当地一所大学的画家和艺术教授。这些平面设计研究来自他的档案，他很想带我们参观他的工作室，并让我们记录下来。没有人知道谁是U.M.帕特尔，那个画这些画的学生，在互联网上我找不到任何东西。这就更有趣了——有多少名不见经传的艺术家和他们数不清的作品在时间的乙醚中消失了，从来没有被另一个人看到过？\n1950&#39;古吉拉特邦位于阿南德小镇，极度贫困、欠发达，与西方世界没有真正的联系——专业图形设计的概念闻所未闻。\nU.M.Patel在肯尼亚内罗毕的RTCEA学院学习，基于论文上的学院印章。这意味着，帕特尔极有可能从古吉拉特邦穿越阿拉伯海，获得大学教育。\n水彩画的质量和耐光性非常出色，保存这些作品的档案过程令人印象深刻。\n他的作品多才多艺——平面设计、工业设计、建筑规划、色彩理论、艺术主题、透视研究等。", "note_en": "I was visiting my family in Anand, Gujarat (India) in 2018 and got to meet our neighbor, Bharatbhai Patel, who is a painter and a professor of Arts at a local college. These graphic design studies are from his archives and he was eager to give us a tour of his studio and allowed us to document them. No one knows who U.M. Patel, the student who made these drawings and there is nothing on the internet that I could find. That makes it even more interesting - how many unknown artists and their uncountable works have been lost in the ether of time, never to be seen by another human, ever?\n  1950&#39;s in the small town of  Anand, Gujarat was extremely impoverished, under developed and had no real connection to the western world - and the concept of professional Graphics Design was unheard of.\n U.M. Patel studied at the  RTCEA college in Nairobi, Kenya based on the college stamp on the papers. That means, Mr. Patel had most likely sailed across the Arabian Sea from Gujarat to obtain a university education.\n  Watercolor quality and lightfastness is exceptional and the archival process used to preserve these works is impressive.\n The versatility of his works - graphic design, industrial design, architectural plans, color theory, artistic motifs, perspective studies, etc.", "posttime": "2022-02-21 06:23:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,设计,古吉拉特邦,studies,作品", "title": "20世纪50年代古吉拉特邦设计师的平面研究（2020年）", "title_en": "1950's Graphic Studies from a Gujarati Designer (2020)", "transed": 1, "url": "https://neil.computer/notes/1950s-graphic-design-studies-from-a-gujarati-designer/", "via": "", "real_tags": ["2020", "设计", "古吉拉特邦", "studies", "作品"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074374, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在JavaScript/TypeScript中管理键盘快捷键真是一件糟糕的事情。让&#39；假设你有以下快捷键（假设你在macOS上）：\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{if（event.metaKey&amp；！event.altKey&amp；！event.ctrlKey&amp；！event.shiftKey&amp；&amp；event.code===&amp#34；KeyL&amp#34；）{doThingA（）；}if（event.metaKey&amp；event.ctrlKey&amp；event.altKey&amp；event.shiftKey&amp；event.code===&amp；34；KeyL&amp；34；）{doThingB（）；}if（event.metaKey&amp；event.ctrlKey&amp；event.shiftKey&amp；event.altKey&amp；event.code===&amp；34；KeyL&amp；34；）{doThingC（）；}}）；\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{if（event.metaKey&amp；！event.altKey&amp；&amp；&amp；event.code===&amp#34；KeyL&amp#34；）{if（event.ctrlKey）{if（event.shiftKey）{doThingC（）；}else{doThingB（）；}else{doThingA（）；}}}）；\n因此，你的开箱即用的选择是让它变得混乱或冗长。好消息！结果是&#39；第三个选项：位标志。\n我需要在一个辅助项目I&#39；我正在工作，所以我用位标志实现了自己的小键盘快捷键库。我尊敬的同事马特·梅希姆（Matt Mayhem，饰演坏阴影，没有明日男孩的名声）正在审查我的拉车请求，想知道所有的&amp；和|操作员，这就是这个帖子存在的原因。\n在深入研究位移位、位标志和位运算符之前，让&#39；Let’我们都跳上小车去二进制交叉点，谈谈基数为2的数字。\n我们中的大多数人都在以10为基数（或十进制）的宇宙中工作，我&#39；我懒得解释，所以我&#39；我会让别人做的。二进制数用2进制表示，这只是一种花哨的说法，表示它只使用两个符号：0和1。\n我&#39；我将交替使用10进制和十进制，但它们指的是同一件事。\n二进制计数有点奇怪，所以让&#39；让我们来谈谈这种奇怪。我们&#39；我们将使用JavaScript&#39；s parseInt（）函数以获取二进制数的十进制表示形式。第一个参数是二进制数字符串，第二个参数是基数。要获得十进制值，I&#39；m使用基数为2（对于基数为2的数字系统）。\n如果你猜到了5，给自己买杯饮料吧！如果你觉得101=5听起来像胡说八道，请容忍我。从右到左计算二进制数。从右向左移动时，该位的十进制表示为：\n找到每一位的十进制值，然后将它们相加。所以这里&#39；这就是把101变成5的方法：\n最右边的那一列代表每一位的十进制值。因为第0位和第2位是1，所以将1乘以2⁰ （1）和2²（4），将它们相加得到5。\nJavaScript使用32位有符号整数进行逐位操作。这意味着任何在引擎盖下旋转的位都会对二进制数进行操作，如下所示：\n我可以为你节省一些计算时间，并向你保证这个数字是32x1。每个1代表一个位，即&#34；32位&#34；来自。32位有符号整数的最小值为-2147483648，最大值为2147483647。但如果你要运行这个：\n它注销了4294967295。你怎么能一直到4294967295？那&#39；这很简单，第一位是&#34；符号位&#34；（以及最高有效位），因此将其翻转为1会使数字无符号。自从我们&#39；我们不再处理负数了，我们只是把所有的数据都加上2147483648。最小值-2147483648变为0，最大值2147483647变为4294967295。\n既然你对二进制数有了更好的理解（希望如此），那就让&#39；s关于位移位和位标志的说唱。\n我们需要将四个修改键表示为位标志。我&#39；我在这里使用打字脚本，所以我&#39；我将使用枚举。我&#39；我也使用Electron，这个应用程序只在macOS上运行，所以我&#39；我将用macOS术语来表示每个修饰语。\n枚举Mod{Command=1&lt；&lt；1，//2在base-10控件中=1&lt；&lt；2，//4在base-10选项中=1&lt；&lt；3，//8在base-10中Shift=1&lt；&lt；4，//16在base-10}\n左移位运算符（&lt；&lt；）将第一个操作数向左移位指定位数。向左移位的多余位将被丢弃。零位从右边移入。\n因此，如果我们要注销它们的base-2表示中的每一个修饰符，这里&#39；这就是我们&#39；d得到：\n比如parseInt（）、JavaScript&#39；函数可以使用一个可选的基数参数，将数字转换为指定的基数。\n您可以看到0的数量直接对应于&lt&书信电报；Mod enum中的运算符。\n那又怎样&#39；这一切的意义是什么？好吧，让&#39；让我们切换到10垒一分钟。你需要检查多个正确或错误的条件。使用位标志的好处是，这些Mod值的任何组合都不会等于同一个数字：\n清单还在继续（相信我）。这些标志的每个可能组合都不会与另一个组合重叠。例如，你&#39；我永远不会遇到值可能是（Mod.Command+Mod.Option）或（Mod.Option+Mod.Shift）的问题。\n那里&#39；这实际上是我们的比特数问题&#39；重新转换（即1、2、3和4），但我们&#39；我稍后再谈。\n现在我们&#39；我们已经设置好了修改器，让&#39；下面介绍如何将它们与位运算符一起使用。\n我&#39；我只关心AND，OR，AND运算符，而不是我的目的，但如果您需要的话，XOR是存在的。位运算符可以用真值表来描述。如果你没有&#39；我不想点击这里的链接&#39；下面是一个简短的概述：\n真值表是数学中用来进行逻辑运算的数学表。它包括布尔代数或布尔函数。它主要用于根据输入值确定复合语句是真是假。\n链接站点上的真相表有点难以掌握，所以让&#39；让我们为每个运算符检查真值表&#39；我们关心的是。\n假设有两位a和b。and位运算符的真值表如下所示：\n如果将0替换为false，将1替换为true，并将&amp；为&amp&amp；，它将映射到：\n安慰日志（假和假）；//假控制台。日志（假与真）；//假控制台。日志（真与假）；//假控制台。日志（真与真）；//符合事实的\n如果将0替换为false，将1替换为true，将|替换为| |，它将映射到：\n安慰日志（假| |假）；//假控制台。日志（假| |真）；//trueconsole。日志（真| |假）；//trueconsole。日志（真| |真）；//符合事实的\n所以我们有一个Mod bit flag enum和一些操作符，可以用来调整位。让&#39；让我们将其应用于键盘快捷键。\n目前，我们&#39；我们以后将只关注修饰符，并担心非修饰符键（例如字母、数字、符号）。让&#39；s创建一个名为areKeysDown的函数，其中包含一个事件和一个组合参数。事件是一个键盘事件，组合是一个与我们的位标志相对应的数字。\n就所需的功能而言，我们希望检查特定的按键组合是否已关闭。它&#39；It’重要的是要注意，当且仅当那些精确的键被按下时，函数才会返回true。因此，如果命令键关闭，areKeysDown（事件，Mod.Command）将返回true，如果Command+Control关闭，则返回false。\n函数areKeysDown（事件：KeyboardEvent，combo:number）：布尔值{let keyCode=combo；if（（combo&amp；Mod.Command）==Mod.Command）{if（！event.metaKey）{return false；}else{keyCode=keyCode&amp；~Mod.Command；}else{if（event.metaKey）{return false；}}/。。。其余的Mod处理程序…//当我们添加非修改键时，这将发生变化：return keyCode===0；}\n在macOS上，事件。metaKey表示命令键（⌘) 事件已经结束。altKey表示选项键（⌥) 事件已经结束。ctrlKey表示控制键（⌃) 这件事已经结束了。shiftKey表示Shift键已按下。\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{//如果event.metaKey=true，则注销true，其他修饰符为false，//并且没有按下其他键：console.log（areKeysDown（event，Mod.Command））；}；\n让&#39；让我们谈谈。在第一行中，我创建了一个局部变量keyCode，它被赋予combo的值。这个想法是，我们一步一步地通过每个修饰符，清除键码中的位标志，直到我们到达函数的底部。去掉所有Mod标志后，您&#39；re left键代码代表按下的字母或数字。\n好极了我们&#39；我们遇到了第一个位运算符AND。那么这条线在做什么？好吧，根据MDN文档中关于和操作员的描述：\n按位AND运算符（&amp；）在两个操作数的对应位均为1的每个位位置返回1。\n常数a=5；//000000000000000000101常数b=3；//00000000000000000000000011//；在两个值中都是1。/a&b0000000000000000000000001//这就是它只注销1的原因^\nconst combo=Mod。命令；//00000000000000000000000010 const compare=combo&amp；摩登派青年命令；//00000000000000000000000000000010//这转换为：//if 00000000000000000000000010/==00000000000000000000000000000010//这是真的！所以我们知道命令修改器被按下了。如果（compare==Mod.Command）{/…}\n如果（（组合和修改命令）==Mod。命令）{if（！event.metaKey）{return false；}else{keyCode=keyCode&amp；~Mod.Command；}\nif（！event.metaKey）语句非常明显。如果我们&#39；重新检查命令修饰符，它不是&#39；t按下，函数返回false。另一个是事情变得辛辣的地方。我&#39；m使用AND和NOT运算符清除Mod。来自keyCode的命令。\n达夫那是什么意思？对于32位整数，它将所有的1变成0，0变成1。\n但是等一下，不是吗&#39；这难道不意味着在我们不这么做之后，它的价值将是巨大的吗？你是对的，但是不要&#39；不要忘记这是一个两步操作：\nconst combo=Mod。命令；//00000000000000000000000010 const not=~Mod。命令；//11111111111111111111101控制台。日志（（组合和非组合）。toString（2））；//00000000000000000000000000/^Don&#39；别忘了还有！\n按位AND运算符（&amp；）在两个操作数的对应位均为1的每个位位置返回1。\n组合中没有位置，也没有两个位都为1的变量，因此其输出为0。最后一条else语句强制要求当且仅当按下指定的确切组合时函数返回true。如果你&#39；重新检查国防部。控件关闭且用户按下Control+Command时，函数返回false。\n函数areKeyDown（事件：KeyboardEvent，combo:number）：布尔值{let keyCode=combo；if（（combo&amp；Mod.Command）==Mod.Command）{/…}否则//Command键被按下，但我们&#39；重新显式检查//if _not u down，因此我们返回false:if（event.metaKey）{return false；}}/。。。其余的Mod处理程序…//当我们添加非修改键时，这将发生变化：return keyCode===0；}\n这一切都很好，但不是很有用。如何检查多个修改器？我&#39；我很高兴你这么问！\n让&#39；s在areKeysDown函数中添加第二个修饰符if语句，用于检查控制：\n函数areKeysDown（事件：KeyboardEvent，combo:number）：布尔值{let keyCode=combo；if（（combo&amp；Mod.Command）==Mod.Command）{if（！event.metaKey）{return false；}else{keyCode=keyCode&amp；~Mod.Command；}else{if（event.metaKey）{return false；}如果（（组合和模块控制）==Mod。控件）{if（！event.ctrlKey）{return false；}else{keyCode=keyCode&amp；~Mod.Control；}else{if（event.ctrlKey）{return false；}}/。。。其余的Mod处理程序…//当我们添加非修改键时，这将发生变化：return keyCode===0；}\n为了检查多个修饰符，我们&#39；我们将给出最后一个按位运算符：OR。我们的函数调用如下所示：\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{//如果event.metaKey=true，event.ctrlKey=true，则注销true，//其他修饰符为false，并且没有按下其他键：console.log（areKeysDown（event，Mod.Command | Mod.Control））；}；\n按位OR运算符（|）在其中一个或两个操作数的对应位为1的每个位位置返回1。\n常数a=5；//000000000000000000101常数b=3；//00000000000000000000000011//这些是1或0^^^控制台。日志（a | b）；//000000000000000000000000111//所以它把它们都变成了1^^^\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{//如果event.metaKey=true，event.ctrlKey=true，则注销true，//其他修饰符为false，并且没有按下其他键：console.log（areKeysDown（event，Mod.Command | Mod.Control））；}；函数areKeysDown（事件：KeyboardEvent，combo:number）：布尔{//Mod.Command=00000000000000000000000000000010//Mod.Control=000000000000000000000000000000100//combo=000000000000000000000000000000110//如果（（combo&amp；Mod.Command）==Mod Command），则将任意数字中的位设置为1^^^{//Mod.Command=00000000000000000000000010//combo=000000000000000000000000110//combo&amp；Mod.Command=00000000000000000000000000000010//Mod.Command_u和u00000000000000000010//==00000000000000000000000010？//是的！所以我们知道Mod.Command在com中bo参数}\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{console.log（areKeysDown（事件，Mod.Command | Mod.Control））；}；函数areKeysDown（事件：KeyboardEvent，combo:number）：布尔值{//Mod.Command=00000000000000000000000000000010//Mod.Control=000000000000000000000000000000100//combo=000000000000000000000000110//将任意数字中的1位设置为1^^^让keyCode=combo；如果（（combo&amp；Mod.Command）==Mod。Command）{//参见前面的示例（我们知道它是真的）…如果（！event.metaKey）{return false；}else{/~Mod.Command=11111111111111111111111101//keyCode仍然是combo=000000000000000000000000110 keyCode=keyCode&amp；~Mod.Command；//000000000000000000000000100//两个数字中的唯一位位置，值为1^}else{/…}如果（（组合和模块控制）==Mod。（控制）{//Mod.Control=000000000000000000000000100//combo=000000000000000000000000110//combo&amp；Mod.Control=000000000000000000000000000000100//只有命令_和uCombo为1的位置^//如果（！event.ctrlKey）{return false；}否则{//~Mod.Control=111111111111111111111111011//keyCode=combo w/o Mod.Command=000000000000000000000000000000100 keyCode=keyCode&amp；~Mod.Control；//00000000000000000000000000000000000000}//keyCode现在是0，所以我们返回true！return keyCode==0；}\n因此&#39；这就是我们处理多个修饰语的方式。但这仍然没有&#39；我们无法获得所需的所有功能。字母、数字、箭头键等呢。？让&#39；接下来我们来报道。\n这就是事情开始变得有点棘手的地方。KeyboardEvent的keyCode属性已被弃用一段时间，不再推荐使用。\n不推荐使用的键盘事件。keyCode只读属性表示与系统和实现相关的数字代码，用于标识按键的未修改值。\n它&#39；因为它是&#39；s是一个数字，所以字母a的键码是65。通过执行以下操作，可以检查是否按下了Command+A：\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{//如果按了&#34；A&#34；则注销65次：console.log（event.keyCode）；//如果按了event.metaKey=true和&#34；A&#34；则注销true（仅当按下这些键时）：console.log（areKeysDown（event，Mod.Command | 65））；\n我想不赞成的主要原因是国际键盘布局的问题。MDN建议您使用KeyboardEvent。代码，这很好，但它只需要一点额外的工作。\n我用每个非修饰键创建了一个枚举，以使areKeysDown函数更具可读性。如果keyCode属性不是&#39；t不推荐，看起来是这样的：\n枚举键{LetterA=65，LetterB=66，LetterC=67，LetterD=68，//……等等……}\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{console.log（areKeysDown（事件，Mod.Command | Key.LetterA））；}；函数areKeyDown（事件：KeyboardEvent，combo:number）：布尔值{let keyCode=combo；if（（combo&amp；Mod.Command）==Mod.Command）{/..keyCode=keyCode&amp；~Mod.Command；//keyCode=65=Key.letta/../事件keyCode=65=Key。LetterA=keyCode，所以我们返回true:return事件。keyCode===keyCode；}\n枚举键{LetterA=1，LetterB，LetterC，LetterD，//……等等……}\n我从1开始，而不是0，因为0将是清除所有修饰符的结果。没有办法区分&#34；只按下修改器&#34；和&#34；一些修饰语加上字母A被按下&#34；。\n现在我们只需要一个表来将密钥枚举映射到相应的KeyboardEvent。代码值：\nconst codeByKeyTable:记录&lt；键，字符串&gt；={[Key.LetterA]：&#34；Key.LetterB]：&#34；Key&#34；[Key.LetterC]：&#34；Key&#34；[Key.LetterD]：&#34；KeyD&#34；/…等等。}\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{//Logs out&#34；KeyA&#34；当您按下字母&#34；A&#34；：console.log（event.code）；}；\n如果你&#39；你想知道我为什么用KeyboardEvent。代码而不是键盘事件。钥匙，它&#39；这是因为键盘事件。Code返回的值不是&#39；t根据键盘布局或修改键的状态进行更改。键盘事件。键根据修改键的状态返回不同的值，这将大大破坏我们所有的代码。\n文件addEventListener（&#34；keydown&#34；，（事件：KeyboardEvent）=&gt；{console.log（areKeysDown（事件，Mod.Command | Key.LetterA））；}；函数areKeyDown（事件：KeyboardEvent，combo:number）：布尔值{let keyCode=combo；if（（combo&amp；Mod.Command）==Mod.Command）{/…keyCode=keyCode&amp；Mod.Comma\n......", "note_en": "Managing keyboard shortcuts in JavaScript/TypeScript is a real shitshow.Let&#39;s say you have the following keyboard shortcuts (assuming you&#39;re on macOS):\n   document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  if  ( event .metaKey  &amp;&amp;  !event .altKey  &amp;&amp;  !event .ctrlKey  &amp;&amp;  !event .shiftKey  &amp;&amp; event .code  ===  &#34;KeyL&#34;  )  {  doThingA ( ) ;  }  if  ( event .metaKey  &amp;&amp; event .ctrlKey  &amp;&amp;  !event .altKey  &amp;&amp;  !event .shiftKey  &amp;&amp; event .code  ===  &#34;KeyL&#34;  )  {  doThingB ( ) ;  }  if  ( event .metaKey  &amp;&amp; event .ctrlKey  &amp;&amp; event .shiftKey  &amp;&amp;  !event .altKey  &amp;&amp; event .code  ===  &#34;KeyL&#34;  )  {  doThingC ( ) ;  } } ) ;\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  if  (event .metaKey  &amp;&amp;  !event .altKey  &amp;&amp; event .code  ===  &#34;KeyL&#34; )  {  if  (event .ctrlKey )  {  if  (event .shiftKey )  {  doThingC ( ) ;  }  else  {  doThingB ( ) ;  }  }  else  {  doThingA ( ) ;  }  } } ) ;\n So your choices out-of-the-box are to make it confusing or make it verbose.Good news! It turns out there&#39;s a third option: bit flags.\n I needed to add quite a few keyboard shortcuts to a side project I&#39;m working on, so I implemented my own little keyboard shortcut library using bit flags.My esteemed colleague, Matt Mayhem (of  Bad Shadows and  No Tomorrow Boys fame),was reviewing my pull request and wanted to know what the hell was going on with all the  &amp; and  | operators, so that is why this post exists.\n Before I dig into bit shifting, bit flags, and bitwise operators, let&#39;s all hop on the trolley to Binary Junction to talk about base-2 numbers.\n  Most of us operate in the  base-10 (or  decimal) universe, which I&#39;m too lazy to explain, so  I&#39;ll let someone else do it. Binary numbers are expressed in the  base-2 numeral system, which is just a fancy way of saying it only uses two symbols:  0 and  1.\n I&#39;ll be using the terms  base-10 and  decimal interchangeably, but they refer to the same thing.\n Counting in binary is a little weird, so let&#39;s talk about that weirdness.We&#39;re going to use JavaScript&#39;s   parseInt() function to get the decimal representation of a binary number.The first argument is the binary number string and the second is the radix. To get the decimal value, I&#39;m using a radix of  2 (for base- 2 number system).\n   If you guessed  5, buy yourself a drink! If  101 =  5 sounds like bullshit to you, bear with me.You count binary from  right to left. As you move from right to left, the decimal representation of that bit is:\n  You find the decimal value for each bit and add them all up. So here&#39;s how you turn  101 into  5:\n  That right-most column represents the decimal value of each bit.Since the 0th and 2nd bits are  1, you multiply  1 by 2⁰ ( 1) and 2² ( 4) respectively and add them up to get  5.\n JavaScript uses  32-bit signed integers for bitwise operations.That means that any bit-twiddling under the hood operates on binary numbers that look like this:\n  I can save you some time spent counting and assure you that there are 32x  1s in that number.Each  1 represents a bit, which is where &#34;32-bit&#34; comes from.A 32-bit  signed integer has a minimum value of  -2147483648 and a maximum value of  2147483647.But if you were to run this:\n  It logs out  4294967295. How the hell can you get all the way up to  4294967295?Well that&#39;s easy, the very first bit is the &#34;sign bit&#34; (and the  most significant bit), so flipping it to  1 makes the number  unsigned.Since we&#39;re no longer dealing with negative numbers, we just shimmy everything over by  2147483648.The minimum of  -2147483648 becomes  0, and the maximum of  2147483647 becomes  4294967295.\n   Now that you have a better understanding of binary numbers (hopefully), let&#39;s rap about bit shifting and bit flags.\n  We need to represent the four modifier keys as bit flags. I&#39;m using TypeScript here, so I&#39;m going to use an  enum.I&#39;m also using Electron and this application only runs on macOS, so I&#39;m going to represent each modifier in the macOS parlance.\n enum Mod  { Command  =  1  &lt;&lt;  1 ,  // 2 in base-10 Control  =  1  &lt;&lt;  2 ,  // 4 in base-10 Option  =  1  &lt;&lt;  3 ,  // 8 in base-10 Shift  =  1  &lt;&lt;  4 ,  // 16 in base-10 }\n  The left shift operator ( &lt;&lt;) shifts the first operand the specified number of bits to the left.Excess bits shifted off to the left are discarded. Zero bits are shifted in from the right.\n So if we were to log out each of those modifiers in their base-2 representation, here&#39;s what we&#39;d get:\n  Like  parseInt(), JavaScript&#39;s  toString() function cantake an optional radix argument that converts the number to the specified base.\n You can see that the number of  0s directly corresponds to the number to the right of the  &lt;&lt; operator in the  Mod enum.\n So what&#39;s the point of all this? Well, let&#39;s switch to base-10 for a minute. You need to check for multiple true or false conditions.The nice thing about using bit flags is any combination of those  Mod values will never add up to the same number:\n  The list goes on (just trust me). Each possible combination of those flags will never overlap with another combination.For example, you&#39;ll never run into an issue where the value could be either ( Mod.Command +  Mod.Option) or( Mod.Option +  Mod.Shift).\n There&#39;s actually an issue with the amount of bits we&#39;re shifting (i.e.  1,  2,  3, and  4),but we&#39;ll cover that later.\n Now that we&#39;ve got our modifiers set up, let&#39;s cover how to use them with bitwise operators.\n   I&#39;m only concerned with the  AND,  OR, and  NOT operators for my purposes, but  XOR is there if you need it.Bitwise operators can be described by something called a  truth table.If you don&#39;t feel like clicking through on that link, here&#39;s a quick rundown:\n A truth table is a mathematical table used to carry out logical operations in Maths.It includes boolean algebra or boolean functions.It is primarily used to determine whether a compound statement is true or false based on the input values.\n The truth table on the linked site is a bit difficult to grasp, so let&#39;s go through the truth table for each operator we&#39;re concerned with.\n Assuming you have two bits a and b. The truth table for the  AND bitwise operator looks like this:\n  If you swapped out  0 for  false,  1 for true, and  &amp; for  &amp;&amp;, it would map to:\n console . log ( false  &amp;&amp;  false ) ;  // falseconsole . log ( false  &amp;&amp;  true ) ;  // falseconsole . log ( true  &amp;&amp;  false ) ;  // falseconsole . log ( true  &amp;&amp;  true ) ;  // true\n   If you swapped out  0 for  false,  1 for true, and  | for  ||, it would map to:\n console . log ( false  ||  false ) ;  // falseconsole . log ( false  ||  true ) ;  // trueconsole . log ( true  ||  false ) ;  // trueconsole . log ( true  ||  true ) ;  // true\n   So we have a  Mod bit flag enum and some operators we can use to shimmy bits around.Let&#39;s apply that to keyboard shortcuts.\n  For the time being, we&#39;re going to focus exclusively on modifiers and worry about non-modifier keys (e.g. letters, numbers, symbols) later.Let&#39;s create a function called  areKeysDown with an  event and a  combo argument.The  event is a   KeyboardEvent and the  combo is a number that corresponds to our bit flags.\n As far as desired functionality goes, we want to check if a specific combination of keys are down.It&#39;s important to note that the function returns  true if and only if those  exact keys are down.So  areKeysDown(event, Mod.Command) returns  true if the  Command key is down, but  false if  Command +  Control is down.\n  function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  let keyCode  = combo ;  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  if  ( !event .metaKey )  {  return  false ;  }  else  { keyCode  = keyCode  &amp;  ~Mod .Command ;  }  }  else  {  if  (event .metaKey )  {  return  false ;  }  }  // ... rest of Mod handlers ...  // This will change when we add non-modifier keys:  return keyCode  ===  0 ; }\n On macOS,  event.metaKey indicates the  Command key ( ⌘) is down, event.altKey indicates the  Option key ( ⌥) is down, event.ctrlKey indicates the  Control key ( ⌃) is down,and  event.shiftKey indicates the  Shift key is down.\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  // Logs out true if event.metaKey = true, other modifiers are false,  // and no other keys are pressed:  console . log ( areKeysDown (event , Mod .Command ) ) ; } ) ;\n Let&#39;s talk this out. On the very first line I create a local variable,  keyCode which is assigned the value of  combo.The idea is that we step through each modifier and clear the bit flag from the  keyCode until we get down to the bottom of the function.After getting rid of all the  Mod flags, you&#39;re left with the  keyCode which represents the letter or number that was pressed.\n   Hooray! We&#39;ve encountered our first bitwise operator, the  AND. So what is this line doing?Well, according to the  MDN documentation for the AND operator:\n The bitwise AND operator ( &amp;) returns a  1 in each bit position for which the corresponding bits of both operands are  1s.\n  const a  =  5 ;  // 00000000000000000000000000000101 const b  =  3 ;  // 00000000000000000000000000000011 // Only bit that&#39;s a 1 in both values ^console . log (a  &amp; b ) ;  // 00000000000000000000000000000001 // Which is why it only logs out 1 ^\n  const combo  = Mod .Command ;  // 00000000000000000000000000000010 const compare  = combo  &amp; Mod .Command ;  // 00000000000000000000000000000010 // This translates to: // if 00000000000000000000000000000010 // == 00000000000000000000000000000010 // Which is true! So we know the Command modifier was pressed. if  (compare  === Mod .Command )  {  // ... }\n  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  if  ( !event .metaKey )  {  return  false ;  }  else  { keyCode  = keyCode  &amp;  ~Mod .Command ;  } }\n The  if (!event.metaKey) statement is pretty obvious. If we&#39;re checking for the  Command modifier, and it isn&#39;t pressed, the function returns  false.The  else is where things get spicy. I&#39;m using the  AND plus the  NOT operator to clear  Mod.Command from  keyCode.\n   Dafuq does that mean? Well for a 32-bit integer, it turns all the  1s to  0s and  0s to  1s.\n  But hang on a second, wouldn&#39;t that mean the value would be huge after we NOT it?You are correct, but don&#39;t forget that this is a two-step operation:\n const combo  = Mod .Command ;  // 00000000000000000000000000000010 const not  =  ~Mod .Command ;  // 11111111111111111111111111111101 console . log ( (combo  &amp; not ) . toString ( 2 ) ) ;  // 00000000000000000000000000000000 // ^ Don&#39;t forget about the AND!\n  The bitwise AND operator ( &amp;) returns a  1 in each bit position forwhich the corresponding bits of both operands are  1s.\n There are  no positions in the  combo and  not variables in which both bits are  1, so the output of that is  0.The final  else statement enforces the requirement that the function return  true if and only if  the exact combo specified is pressed.If you&#39;re checking if  Mod.Control is down and the user is pressing  Control +  Command, the function returns  false.\n function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  let keyCode  = combo ;  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  // ...  }  else  {  // The Command key is depressed, but we&#39;re explicitly checking  // if it is _not_ down, so we return false:  if  (event .metaKey )  {  return  false ;  }  }  // ... rest of Mod handlers ...  // This will change when we add non-modifier keys:  return keyCode  ===  0 ; }\n So this is all well and good, but not very useful. How do you check for multiple modifiers?I&#39;m glad you asked!\n  Let&#39;s add a second modifier  if statement to our  areKeysDown function that checks for  Control:\n function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  let keyCode  = combo ;  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  if  ( !event .metaKey )  {  return  false ;  }  else  { keyCode  = keyCode  &amp;  ~Mod .Command ;  }  }  else  {  if  (event .metaKey )  {  return  false ;  }  }  if  ( (combo  &amp; Mod .Control )  === Mod .Control )  {  if  ( !event .ctrlKey )  {  return  false ;  }  else  { keyCode  = keyCode  &amp;  ~Mod .Control ;  }  }  else  {  if  (event .ctrlKey )  {  return  false ;  }  }  // ... rest of Mod handlers ...  // This will change when we add non-modifier keys:  return keyCode  ===  0 ; }\n  In order to check for multiple modifiers, we&#39;re going to bring out the final bitwise operator:  OR.So our function call looks like this:\n document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  // Logs out true if event.metaKey = true, event.ctrlKey = true,  // other modifiers are false, and no other keys are pressed:  console . log ( areKeysDown (event , Mod .Command  | Mod .Control ) ) ; } ) ;\n  The bitwise OR operator ( |) returns a  1 in each bit position for which thecorresponding bits of either or both operands are  1s.\n  const a  =  5 ;  // 00000000000000000000000000000101 const b  =  3 ;  // 00000000000000000000000000000011 // These are either 1 or 0 ^^^console . log (a  | b ) ;  // 00000000000000000000000000000111 // So it turns them all into 1s ^^^\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  // Logs out true if event.metaKey = true, event.ctrlKey = true,  // other modifiers are false, and no other keys are pressed:  console . log ( areKeysDown (event , Mod .Command  | Mod .Control ) ) ; } ) ; function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  // Mod.Command = 00000000000000000000000000000010  // Mod.Control = 00000000000000000000000000000100  // combo = 00000000000000000000000000000110  // Set bits with a 1 in either number to 1 ^^  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  // Mod.Command = 00000000000000000000000000000010  // combo = 00000000000000000000000000000110  // combo &amp; Mod.Command = 00000000000000000000000000000010  // Only position where Mod.Command _and_ combo is 1 ^  // Does 00000000000000000000000000000010  // == 00000000000000000000000000000010?  // Yep! So we know that Mod.Command is in the combo argument  } }\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  console . log ( areKeysDown (event , Mod .Command  | Mod .Control ) ) ; } ) ; function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  // Mod.Command = 00000000000000000000000000000010  // Mod.Control = 00000000000000000000000000000100  // combo = 00000000000000000000000000000110  // Set bits with a 1 in either number to 1 ^^  let keyCode  = combo ;  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  // See previous example (we know it&#39;s true)...  if  ( !event .metaKey )  {  return  false ;  }  else  {  // ~Mod.Command = 11111111111111111111111111111101  // keyCode is still combo which = 00000000000000000000000000000110 keyCode  = keyCode  &amp;  ~Mod .Command ;  // 00000000000000000000000000000100  // Only bit position in both numbers with value of 1 ^  }  }  else  {  // ...  }  if  ( (combo  &amp; Mod .Control )  === Mod .Control )  {  // Mod.Control = 00000000000000000000000000000100  // combo = 00000000000000000000000000000110  // combo &amp; Mod.Control = 00000000000000000000000000000100  // Only position where command _and_ combo is 1 ^  // Does 00000000000000000000000000000100  // == 00000000000000000000000000000100?  // Yep! So we know that Mod.Control is in the combo argument  if  ( !event .ctrlKey )  {  return  false ;  }  else  {  // ~Mod.Control = 11111111111111111111111111111011  // keyCode = combo w/o Mod.Command = 00000000000000000000000000000100 keyCode  = keyCode  &amp;  ~Mod .Control ;  // 00000000000000000000000000000000  }  }  // The keyCode is now 0, so we return true!  return keyCode  ===  0 ; }\n So that&#39;s how we handle multiple modifiers. But that  still doesn&#39;t get us all the functionality we need.What about letters, numbers, arrow keys, etc.? Let&#39;s cover that next.\n  This is where things start to get a little hairy.The  KeyboardEvent has a  keyCode property that has been deprecated for a while and is no longer recommended.\n  The deprecated  KeyboardEvent.keyCode read-only property represents a system andimplementation dependent numerical code identifying the unmodified value of the pressed key.\n It&#39;s handy for bit flags because it&#39;s a number, so the letter  A has a  keyCode of  65.You could check if  Command +  A is pressed by doing this:\n document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  // Logs out 65 if &#34;A&#34; is pressed:  console . log (event .keyCode ) ;  // Logs out true if event.metaKey = true and &#34;A&#34; is pressed  // (and only if those keys are pressed):  console . log ( areKeysDown (event , Mod .Command  |  65 ) ) ; } ) ;\n I imagine the primary reason for the deprecation was due to issues with international keyboard layouts.MDN recommends you use   KeyboardEvent.codeinstead, which is fine, but it just requires a little extra work.\n I created an  enum with each non-modifier key to make the  areKeysDown function more readable.If the  keyCode property  wasn&#39;t deprecated, that would look something like this:\n enum Key  { LetterA  =  65 , LetterB  =  66 , LetterC  =  67 , LetterD  =  68 ,  // ... and so on ... }\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  console . log ( areKeysDown (event , Mod .Command  | Key .LetterA ) ) ; } ) ; function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  let keyCode  = combo ;  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  // ... keyCode  = keyCode  &amp;  ~Mod .Command ;  // keyCode = 65 = Key.LetterA  // ...  }  // event.keyCode = 65 = Key.LetterA = keyCode, so we return true:  return event .keyCode  === keyCode ; }\n  enum Key  { LetterA  =  1 , LetterB , LetterC , LetterD ,  // ... and so on ... }\n I started at  1 instead of  0, because  0 would be the result of clearing all the modifiers.There would be no way to differentiate between &#34;only modifiers are pressed&#34; and &#34;some modifiers plus the letter  A was pressed&#34;.\n Now we just need a table to map the  Key enum to the corresponding  KeyboardEvent.code values:\n const codeByKeyTable : Record &lt;Key ,  string &gt;  =  {  [Key .LetterA ] :  &#34;KeyA&#34; ,  [Key .LetterB ] :  &#34;KeyB&#34; ,  [Key .LetterC ] :  &#34;KeyC&#34; ,  [Key .LetterD ] :  &#34;KeyD&#34; ,  // ... and so on ... }\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  // Logs out &#34;KeyA&#34; when you press the letter &#34;A&#34;:  console . log (event .code ) ; } ) ;\n If you&#39;re wondering why I used  KeyboardEvent.code instead of  KeyboardEvent.key, it&#39;s because  KeyboardEvent.codereturns a value that  isn&#39;t altered by keyboard layout or the state of the modifier keys. KeyboardEvent.key returns a different value depending on the state of the modifier keys, which wouldpretty much break all our code.\n  document . addEventListener ( &#34;keydown&#34; ,  (event : KeyboardEvent )  =&gt;  {  console . log ( areKeysDown (event , Mod .Command  | Key .LetterA ) ) ; } ) ; function  areKeysDown (event : KeyboardEvent , combo :  number ) :  boolean  {  let keyCode  = combo ;  if  ( (combo  &amp; Mod .Command )  === Mod .Command )  {  // ... keyCode  = keyCode  &amp;  ~Mod .Comma\n......", "posttime": "2022-02-21 05:50:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "键盘,bitwisdom,mod", "title": "从键盘快捷键中获得智慧", "title_en": "Gaining Bitwisdom from Keyboard Shortcuts", "transed": 1, "url": "https://mikerourke.dev/blog/bitwisdom-keyboard-shortcuts/", "via": "", "real_tags": ["键盘", "bitwisdom", "mod"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074373, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "❤️ 在这里查看Lambda并注册他们的GPU云：https://lambdalabs.com/papers📝 #NVIDIA的论文“具有多分辨率的即时神经图形原语。。。", "note_en": "❤️ Check out Lambda here and sign up for their GPU Cloud: https://lambdalabs.com/papers📝 #NVIDIA's paper \"Instant Neural Graphics Primitives with a Multires...", "posttime": "2022-02-21 05:50:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nvidia,人工智能,ai,图形", "title": "英伟达的新人工智能：即时神经图形", "title_en": "Nvidia’s New AI: Instant Neural Graphics", "transed": 1, "url": "https://www.youtube.com/watch?v=j8tMk-GE8hY", "via": "", "real_tags": ["nvidia", "人工智能", "ai", "图形"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074372, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有关winit范围之外的功能，请参阅wiki中其他板条箱提供的缺失功能。\nWinit是一个窗口创建和管理库。它可以创建窗口，并允许您处理窗口生成的事件（例如：正在调整大小的窗口、正在按下的键、鼠标移动等）。\nWinit被设计成一个库层次结构中的底层砖块。因此，为了在窗口上显示某些内容，您需要使用winit或其他库提供的特定于平台的getter。\n使用winit:{event:：{event，WindowEvent}，event_loop:：{ControlFlow，EventLoop}，window:：WindowBuilder，}；fn main（）{let event_loop=EventLoop:：new（）；let window=WindowBuilder:：new（）.build（&amp；event_loop）.unwrap（）；event_loop.run（移动|事件，uu，控制_flow |{*控制_flow=ControlFlow:：Wait；匹配事件{event:：WindowEvent:WindowEvent:：CloseRequested，window id，}如果window id==window id==window gt*control_flow=ControlFlow:：Exit，=&gt；(), } });}\n在web平台上，Winit窗口由&lt；帆布&gt；要素您可以向Winit提供&lt；帆布&gt；元素，或让Winitcreate创建一个&lt；帆布&gt；元素，然后您可以自己检索并将其插入DOM。\n例如，使用Winit和WebAssembly的示例代码，请查看web示例。有关在WebAssembly上使用Rust的信息，请参阅Rust and WebAssembly手册。\n该库使用ndk rs板条箱，有关更多文档，请参阅该repo。\nndk_glue版本需要与winit使用的版本匹配。否则，应用程序将无法正确启动，因为ndk#U胶水&#39；由于版本不匹配，s的内部NativeActivity静态不相同。", "note_en": "For features  outside the scope of winit, see  Missing features provided by other crates in the wiki.\n     Winit is a window creation and management library. It can create windows and lets you handleevents (for example: the window being resized, a key being pressed, a mouse movement, etc.)produced by window.\n Winit is designed to be a low-level brick in a hierarchy of libraries. Consequently, in order toshow something on the window you need to use the platform-specific getters provided by winit, oranother library.\n use winit ::{ event ::{Event, WindowEvent}, event_loop ::{ControlFlow, EventLoop}, window ::WindowBuilder,}; fn  main() {  let event_loop  = EventLoop :: new();  let window  = WindowBuilder :: new(). build( &amp;event_loop). unwrap(); event_loop. run( move  |event, _, control_flow | {  *control_flow  = ControlFlow ::Wait;  match event { Event ::WindowEvent { event: WindowEvent ::CloseRequested, window_id, }  if window_id  == window. id()  =&gt;  *control_flow  = ControlFlow ::Exit, _  =&gt; (), } });}\n        On the web platform, a Winit window is backed by a  &lt;canvas&gt; element. You caneither  provide Winit with a  &lt;canvas&gt; element, or  let Winitcreate a  &lt;canvas&gt; element which you can then retrieve andinsert it into the DOM yourself.\n For example code using Winit with WebAssembly, check out the  web example. Forinformation on using Rust on WebAssembly, check out the  Rust and WebAssemblybook.\n  This library makes use of the  ndk-rs crates, refer to that repo for more documentation.\n The  ndk_glue version needs to match the version used by  winit. Otherwise, the application will not start correctly as  ndk_glue&#39;s internal NativeActivity static is not the same due to version mismatch.", "posttime": "2022-02-21 05:48:33", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,处理,window,winit", "title": "Winit–纯锈玻璃窗处理库", "title_en": "Winit – Window handling library in pure Rust", "transed": 1, "url": "https://github.com/rust-windowing/winit", "via": "", "real_tags": ["rust", "处理", "window", "winit"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074371, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GamesBeat Summit 2022将于4月26日至28日回归，届时将举办其最大的游戏领袖活动。在这里预定座位！\nNvidia首席执行官Jensen Huang没有实现他收购ARM 800亿美元的梦想。监管机构推迟了交易，黄在“竭尽全力”后取消了交易\n但他的公司仍在发展壮大。英伟达公布截至1月30日的第四财季营收为76.4亿美元，同比增长53%。游戏、数据中心和专业可视化市场平台均实现了创纪录的季度和年度收入。\n这表明，该公司有很大的广度，因为它知道在Arm交易崩溃后会做什么。黄说，他对自己的三芯片战略——Omniverse、metaverse和自动驾驶汽车——寄予厚望。在公司本周发布盈利报告后，我有很短的时间采访了黄。\nVentureBeat：你的后置策略是什么？鉴于（Arm交易被取消），你必须传达你的战略方向吗？\n黄延森：没什么。因为我们还没有完成和Arm的结合。因此，任何可能来自组合的策略都从未被提及。所以我们的策略是完全一样的。我们为任何有中央处理器的地方进行加速计算。我们将在x86上实现这一点。我们会这样做的，我们这样做是为了手臂。我们有一大堆ARM CPU和正在开发的片上系统（SoC）。我们是狂热者。我们都这么做。我们拥有20年的Arm知识产权许可证。我们将继续利用所有这些和所有市场。就这样。继续构建CPU（图形处理单元）GPU和DPU（数据处理单元）。\n这就是你的三芯片策略？你会考虑RISC-V现在手臂交易没有发生吗？\n黄：我们使用RISC-V。我们是GPU中的RISC-V用户。我们在几个领域使用它。对于系统控制器，Bluefield GPU内部有一个RISC-V加速引擎，如果你愿意的话，还有一个可编程引擎。我们在合理的时候使用RISC-V。我们在合理的时候使用手臂。我们在有意义的时候使用x86。\nVB：你是如何看待metaverse的进展的？似乎每个人都对元宇宙更感兴趣，而全宇宙总是对话的一部分。\n黄：让我看看。Omniverse for enterprise正在全球约700家不同的公司进行试用和测试。我们已经签订了一些主要的许可证。所以我们的数字有了一个很好的开始。人们用它做各种各样的事情。他们用它来连接设计师和创作者。他们用它来模拟物流仓库，模拟工厂。他们用它来生成合成数据，因为我们在物理上准确地模拟传感器。你可以用它来模拟训练人工智能的数据，这些数据是从激光雷达、雷达，当然还有摄像头收集的。因此，他们将其用于软件开发过程中的模拟部分。作为发布过程的一部分，您需要验证软件。您可以将Omniverse应用于机器人技术应用程序验证流程中。人们也在用它来制作数字双胞胎。\nVB：你会成为最大的数码孪生兄弟，对吗？[Nvidia计划制作一个地球的数字孪生体，作为其“地球2号”模拟的一部分，该模拟将使用人工智能和世界上最快的超级计算机来模拟气候变化，并预测未来几十年地球气候可能如何变化]。\n黄：我们正在建造或确定建筑的范围，并建造最终的数字孪生兄弟。\nVB：你觉得我们也在走向一个开放的元宇宙吗？相对于一堆有围墙的花园，它是否足够开放？\n黄：我真的希望它是开放的，而且我认为它将以通用场景描述（USD）开放。正如你们所知，我们是当今美元最大的贡献者之一，也是主要的贡献者。它是皮克斯发明的。它被许多不同的开发者采用。Adobe采用了它，我们已经有很多人采用了它。我希望每个人都能使用USD，然后它基本上会成为metaverse的HTML。\nVB：您对汽车部门的信心水平如何？我们在自动驾驶汽车方面的进展如何？大流行过后，你觉得我们正在回到正轨吗？\n黄：我相信全世界都会有自动驾驶汽车。它们都有自己的操作域。其中一些就在一个非常大的仓库的范围内。他们称之为AMR，自动移动机器人。你可以把它们放在有围墙的工厂里，这样它们就可以把货物和存货四处转移。你可以在最后一英里运送货物，比如Neuro和其他公司。所有这些伟大的公司都在做最后一英里的交付。只要你不过分承诺，所有这些应用都是可行的。\n我认为自动驾驶汽车将会有成千上万的应用，这是肯定的。今年将是我们自主驾驶的转折之年。今年对我们来说将是重要的一年。然后明年，明年会更大。到2025年，我们将部署自己的for软件，与汽车公司分享收入。\n因此，如果许可证是10000美元，我们各占一半。如果订阅基数为每月1000美元或100美元，我们各占一半。我想我现在非常确定，自动驾驶汽车将成为我们最大的业务之一。\nGamesBeat&#39；s在报道游戏行业时的信条是&#34；激情与商业相遇的地方&#34; 这是什么意思？我们想告诉你新闻对你有多重要——不仅仅是作为游戏工作室的决策者，还是游戏迷。无论您是阅读我们的文章、收听我们的播客，还是观看我们的视频，GamesBeat都将帮助您了解这个行业，并享受参与其中的乐趣。了解更多", "note_en": "GamesBeat Summit 2022 returns with its largest event for leaders in gaming on April 26-28th. Reserve your spot  here!\n Nvidia CEO Jensen Huang didn’t get to fulfill his dream of  acquiring Arm for $80 billion. Regulators held the deal up and Huang called off the deal after “giving it our best shot.”\n But his company is still going strong.  Nvidia reported revenues of $7.64 billion for its fourth fiscal quarter ended January 30, up 53% from a year earlier. Gaming, datacenter, and professional visualization market platforms each achieved record revenue for the quarter and year.\n  That shows the company has a lot of breadth as it figures out what it will do in the wake of the Arm deals collapse. And Huang said he has high hopes for his three-chip strategy, the Omniverse, the metaverse, and self-driving cars. I had a short time to interview Huang after the company reporting earnings this week.\n    VentureBeat: What is your post-Arm strategy? Do you have to communicate your strategic direction in light of [the Arm deal being called off]?\n Jensen Huang: Not really anything. Because we never finished combining with Arm. So any strategies that would have come from the combination were never talked about. And so our strategy is exactly the same. We do accelerated computing for wherever there are (central processing units) CPUs. And so we’ll do that for x86. And we’ll do we do that for Arm. We have a whole bunch of ARM CPUs, and system-on-chips (SoCs) in development. And we’re enthusiasts. We do all that. We have a 20-year license to Arm’s intellectual property. And we’ll continue to take advantage of all that and all the markets. And that’s about it. Keep building CPUs, (graphics processing units) GPUs, and DPUs (data processing units).\n VB: So it’s your three-chip strategy? Would you consider RISC-V now that the Arm deal is not happening?\n Huang: We use RISC-V. We’re RISC-V users inside our GPUs. We use it in several areas. For system controllers, inside the Bluefield GPU, there is a RISC-V acceleration engine, if you will, a programmable engine. And we use RISC-V when when it makes sense. We use Arm when it makes sense. We use x86 when it makes sense.\n VB: And how are you viewing progress on the metaverse? It seems like everybody’s a lot more excited about the  metaverse, and the Omniverse is always part of that conversation.\n Huang: Let’s see. Omniverse for enterprise is being trialed and being tested in about 700 or so different companies around the world. We have entered into some major licenses already. And so our numbers are off to a great start. People are using it for all kinds of things. They’re using it for connecting designers and creators. They’re using it to simulate logistics warehouses, simulate factories. They’re using it for synthetic data generation because we simulate sensors physically and accurately. You could use it for simulating data for training AIs that are collected from LiDAR, radars, and of course cameras. And so they’re using it for simulation part of the software development process. You need to validate software as part of the part of the release process. And you can put Omniverse in the flow of robotics application validation. People are using it for digital twins, too.\n  VB: You’re going to make the biggest digital twin of all, right? [Nvidia plans to make a digital twin of the Earth as part of its Earth 2 simulation, which will use AI and the world’s fastest supercomputers to simulate climate change and predict how the planet’s climate could change over decades].\n Huang: We’re off building or scoping out the architecture and building the ultimate digital twin.\n VB: And do you feel like we’re also heading towards an open metaverse? Will it be sufficiently open as opposed to a bunch of walled gardens?\n Huang: I really do hope it’s open and I think it will be open with Universal Scene Description (USD). As you know, we’re one of the largest contributors, the primary contributor, to USD today. And it was invented by Pixar. It’s been adopted by so many different content developers. Adobe adopted it, and we have gotten a lot of people to adopt it. I’m hoping that everybody will go to USD and then it will be become essentially the HTML of the metaverse.\n VB: What is your confidence level in the automotive division and how we are moving forward with self-driving cars? Do you feel like we are getting back on track after the pandemic?\n Huang: I am certain that we will have autonomous vehicles all over the world. They all have their operating domains. And some of that is just within the boundaries of a very large warehouse. They call them AMRs, autonomous moving robots. You could have them inside walled factories, and so they could be moving goods and inventory around. You could be delivering goods across the last mile, like Neuro and others. All these great companies that are doing last-mile delivery. All of those applications are very doable, so long as you don’t over promise.\n And I think there will be thousands an thousands of applications of autonomous vehicles, and it’s a sure thing. This year is going to be the inflection year for us on autonomous driving. This will be a big year for us. And then next year, it’ll be even bigger next year. And in 2025, that’s when we deploy our own for software where we do revenue sharing with the car companies.\n And so if the license was $10,000, we shared 50-50. If it’s a subscription base of $1,000 or $100 a month, we share 50-50. I think I’m pretty certain now that autonomous vehicles will be one of our largest businesses.\n GamesBeat&#39;s creed when covering the game industry is &#34;where passion meets business.&#34; What does this mean? We want to tell you how the news matters to you -- not just as a decision-maker at a game studio, but also as a fan of games. Whether you read our articles, listen to our podcasts, or watch our videos, GamesBeat will help you learn about the industry and enjoy engaging with it.  Learn More", "posttime": "2022-02-21 05:03:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nvidia,押注", "title": "采访NVIDIA首席执行官Jensen Huang对该公司的战略失败后，手臂出价，奥姆尼维尔的进展，并押注自驾车", "title_en": "Interview with Nvidia CEO Jensen Huang on the company's strategy after its failed Arm bid, Omniverse's progress, and its bet on self-driving cars", "transed": 1, "url": "https://venturebeat.com/2022/02/20/jensen-huang-interview-nvidias-post-arm-strategy-omniverse-and-self-driving-cars/", "via": "", "real_tags": ["nvidia", "押注"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074370, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "机器学习的黄金法则之一是将数据集分为训练集、验证集和测试集。了解如何绕过最常见的警告！\n我们这样做的原因很简单。如果我们不将数据分成不同的集合，模型将根据训练期间看到的相同数据进行评估。因此，我们可能会遇到一些问题，比如在不知不觉中过度装修。\n我们将数据集随机分成三个子集，称为训练集、验证集和测试集。拆分可以是60/20/20或70/20/10或任何其他您想要的比率。\n如果我们对结果不满意，我们可以更改超参数或选择另一个模型，然后再次转到步骤2\n最后，一旦我们对验证集的结果满意，我们就可以在测试集上评估我们的模型。\n如果我们对结果感到满意，我们现在可以再次在训练集和验证集上训练我们的模型，并使用我们最后导出的超参数。\n我们可以在测试集上再次评估模型的准确性，如果我们愿意，可以部署模型。\n大多数ML框架为数据集的随机训练/测试分割提供了内置方法。最著名的例子是scikit learn的train_test_split函数。\n是的，这可能是个问题。对于非常小的数据集，测试集将非常小，因此单个错误预测对测试精度有很大影响。幸运的是，有一种方法可以解决这个问题。\n这个问题的解决方案称为交叉验证。我们基本上创建了数据集的分区，如下图所示。我们总是拿出一套测试数据，并使用所有其他数据进行培训。最后，我们收集并平均测试集的所有结果。我们基本上训练了k个模型，并使用这个技巧获得了在完整数据集上评估模型的统计数据（因为每个样本都是k个测试集的一部分）。\n这种方法在最近的深度学习方法中几乎没有使用，因为训练一个k型的时间非常昂贵。\n随着深度学习的兴起和数据集规模的大幅增加，对交叉验证或单独验证集等技术的需求已经减少。其中一个原因是实验非常昂贵，而且需要很长时间。另一个原因是，由于大数据集和大多数深度学习方法的性质，模型受过度拟合的影响较小。\n过度拟合仍然是深度学习中的一个问题。但是，对10个特征的50个样本进行过拟合比对百万像素的100k图像进行过拟合要快\n有人可能会说，研究人员和从业者变得懒惰/邋遢。如果能看到最近的任何一篇论文再次研究这种效应，那将是一件有趣的事情。例如，可能是过去几年，研究人员在ImageNet的测试集上过度拟合了他们的模型，因为一直在努力改进它，使之成为最先进的技术。\n天真的是，可以手动将数据集分成三个块。这种方法的问题是，我们人类是非常有偏见的，这种偏见会被引入到三个集合中。\n在学术界，我们知道我们应该随机挑选它们。随机分成三组可以保证所有三组遵循相同的统计分布。这就是我们想要的，因为ML是关于统计的。\n从完全不同的分布中导出这三个集合会产生一些不想要的结果。如果我们想用猫的图片训练一个模型来对花进行分类，那么它没有多大价值。\n然而，随机分割的基本假设是，初始数据集已经与我们想要解决的问题的统计分布相匹配。这意味着，对于自动驾驶等问题，假设我们的数据集涵盖了各种城市、天气条件、车辆、一年四季、特殊情况等。\n正如你可能认为的那样，这个假设实际上并不适用于大多数实际的深度学习应用。每当我们在一个不受控制的环境中使用传感器收集数据时，我们可能无法获得所需的数据分布。\n但这很糟糕。如果我无法收集我试图解决的问题的代表性数据集，我该怎么办？\n你要寻找的是关于发现和处理领域差距、分布变化或数据漂移的研究领域。所有这些术语都有自己的具体定义。我在这里列出了它们，这样你就可以轻松地搜索相关问题。\n对于域，我们指的是数据域，即我们使用的数据的来源和类型。有三种前进的方式：\n在机器学习中，当我们的模型必须在新输入数据来自与训练数据不同的分布的情况下表现良好时，我们指的是分布外。回到我们之前的自动驾驶示例，我们可以说，对于一个只在加利福尼亚晴朗天气下训练的模型，在欧洲进行预测是不合理的。\n由于我们使用不同的传感器收集数据，我们还可能有关于每个样本来源的附加信息（样本可以是图像、激光雷达帧、视频等）。\n您很可能过度拟合了验证集的模型，或者验证集和测试集非常不同。但是怎么做呢？\n您可能多次反复调整参数，以挤出模型在验证集上可以产生的最后一点精度。验证集不再满足其目的。此时，您应该放松一些超参数或引入正则化方法。\n在导出最终的超参数后，我想在发货前在完整的数据集（训练+验证+测试）上重新训练我的模型\n不，不要这样做。hyperparameters已经针对train（或者train+验证）集进行了调整，当用于完整数据集时，可能会产生不同的结果。此外，由于测试集不再存在，您将无法再回答模型的实际性能有多好的问题。\n我有一个视频数据集，想把帧随机分成训练集、验证集和测试集\n由于视频帧很可能高度相关（例如，相邻的两帧看起来几乎相同），这是一个坏主意。这与我们根据训练数据评估模型几乎是一样的。相反，您应该将数据集拆分为多个视频（例如，视频1、3、5用于培训，视频2、4用于验证）。您可以再次使用随机列车测试拆分，但这次是在视频级别而不是帧级别。", "note_en": "One of the golden rules in machine learning is to split your dataset into train, validation, and test set. Learn how to bypass the most common caveats!\n The reason we do that is very simple. If we would not split the data into different sets the model would be evaluated on the same data it has seen during training. We therefore could run into problems such as overfitting without even knowing it.\n      We split the dataset  randomly into three subsets called the  train,  validation, and  test set. Splits could be 60/20/20 or 70/20/10 or any other ratio you desire.\n   If we are not happy with the results we can change the hyperparameters or pick another model and  go again to step 2\n Finally, once we’re happy with the results on the  validation set we can evaluate our model on the  test set.\n If we’re happy with the results we can now again train our model on the  train and  validation set combined using last the hyperparameters we derived.\n We can again evaluate the model accuracy on the  test set and if we’re happy deploy the model.\n Most ML frameworks provide built-in methods for random train/ test splits of a dataset. The most well-known example is the  train_test_split function of scikit-learn.\n   Yes, this could be a problem. With very small datasets the test set will be tiny and therefore a single wrong prediction has a strong impact on the test accuracy. Fortunately, there is a way to work around this problem.\n The solution to this problem is called  cross-validation. We essentially create partitions of our dataset as shown in the image below. We always hold out a set for testing and use all the other data for training. Finally, we gather and average all the results from the testing sets. We essentially trained k models and using this trick managed to get statistics of evaluating the model on the full dataset (as every sample has been part of one of the k test sets).\n  This approach is barely used in recent deep learning methods as it’s super expensive to train a model k times.\n With the rise of deep learning and the massive increase in dataset sizes, the need for techniques such as cross-validation or having a separate validation set has diminished. One reason for this is that experiments are very expensive and take a long time. Another one is that due to the large datasets and nature of most deep learning methods the models got less affected by overfitting.\n Overfitting is still a problem in deep learning. But overfitting to 50 samples with 10 features happens faster than overfitting to 100k images with millions of pixels\n One could argue that researchers and practitioners got lazy/ sloppy. It would be interesting to see any recent paper investigating such effects again. For example, it could be that researchers in the past years have heavily overfitted their models to the test set of ImageNet as there has been an ongoing struggle to improve it and become state-of-the-art.\n   Naively, one could just manually split the dataset into three chunks. The problem with this approach is that we humans are very biased and this bias would get introduced into the three sets.\n In academia, we learn that we should pick them randomly. A random split into the three sets guarantees that all three sets follow the same statistical distribution. And that’s what we want since ML is all about statistics.\n Deriving the three sets from completely different distributions would yield some unwanted results. There is not much value in training a model on pictures of cats if we want to use it to classify flowers.\n  However, the underlying assumption of a random split is that the initial dataset already matches the statistical distribution of the problem we want to solve. That would mean that for problems such as autonomous driving the assumption is that our dataset covers all sorts of cities, weather conditions, vehicles, seasons of the year, special situations, etc.\n As you might think this assumption is actually not valid for most practical deep learning applications. Whenever we collect data using sensors in an uncontrolled environment we might not have the desired data distribution.\n But that’s bad. What am I supposed to do if I’m not able to collect a representative dataset of the problem I try to solve?\n What you’re looking for is the research area around finding and dealing with  domain gaps,  distributional shifts, or  data drift. All these terms have their own specific definition. I’m listing them here so you can search for the relevant problems easily.\n With a  domain, we refer to the data domain, as the source and type of the data we use. There are three ways to move forward:\n    In machine learning, we refer to out-of-distribution whenever our model has to perform well in a situation where the new input data is from a different distribution than the training data. Going back to our autonomous driving example from before, we could say that for a model that has only been trained on sunny California weather, doing predictions in Europe is out of distribution.\n  Since we collected the data using different sensors we also might have additional information about the source for each of the samples (a sample could be an image, lidar frame, video, etc.).\n       You very likely overfitted your model to the validation set or validation and test set are very different. But how?\n You likely did several iterations of tweaking the parameters to squeeze out the last bit of accuracy your model can yield on the validation set. The validation set is no longer fulfilling its purpose. At this point, you should relax some of your hyperparameters or introduce regularization methods.\n After deriving my final hyperparameters I want to retrain my model on the full dataset (train + validation + test) before shipping\n No, don’t do this. The hyperparameters have been tuned for the train (or maybe the train + validation) set and might yield a different result when used for the full dataset. Furthermore, you won’t be able to answer the question anymore of how good your model really performs as the test set no longer exists.\n I have a video dataset and want to split the frames randomly into train, validation, and test set\n Since video frames are very likely highly correlated (e.g. two frames next to each other almost look the same) this is a bad idea. It’s almost the same as if we would evaluate the model on the training data. Instead, you should split the dataset across videos (e.g. videos 1,3,5 are used for training and video 2,4 for validation). You can again use a random train test split but this time on the video level instead of the frame level.", "posttime": "2022-02-21 04:48:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "深度学习,深度,test,数据", "title": "深度学习中的训练测试", "title_en": "Train Test Split in Deep Learning", "transed": 1, "url": "https://www.lightly.ai/post/train-test-split-in-deep-learning", "via": "", "real_tags": ["深度学习", "深度", "test", "数据"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074369, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ta4j是一个用于技术分析的开源Java库。它提供了创建、评估和执行交易策略的基本组件。\n泰姬陵位于马文中心。您只需在pom中添加以下依赖项。xml文件。\n您还可以通过向pom添加以下依赖项，从maven中央存储库下载示例代码。xml:\n维基是学习泰姬陵的最佳场所。有关更详细的问题，请使用问题追踪器。", "note_en": "Ta4j is an open source Java library for  technical analysis. It provides the basic components for creation, evaluation and execution of trading strategies.\n     Ta4j is available on  Maven Central. You just have to add the following dependency in your  pom.xml file.\n      You can also download   example code from the maven central repository by adding the following dependency to your pom.xml:\n   The  wiki is the best place to start learning about ta4j. For more detailed questions, please use the  issues tracker.", "posttime": "2022-02-21 04:46:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,技术,library,pom", "title": "用于技术分析的Java库", "title_en": "A Java library for technical analysis", "transed": 1, "url": "https://github.com/ta4j/ta4j", "via": "", "real_tags": ["java", "技术", "library", "pom"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074368, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在ISSCC 2022大会上，英特尔分享了其新的比特币采矿富矿ASIC的深入细节，并概述了它如何将300个这种小型节能芯片融合到一个强大的3600W采矿机中，以高达40 THash/s的性能挑战Bitmain和MicroBT市场上的最佳产品。我们首先发现了英特尔&#39；在ISSCC 2022年会议上，s Bonanza矿业有限公司将ASICs列入展示名单，以下信息来自该活动的展示。本资料涵盖第一代英特尔&39；微软的采矿芯片BMZ1，但该公司已经进入第二代#39；富矿39号；ASIC被称为BMZ2，它现在向客户提供。公司消息传出后&#39；英特尔最终正式承认了其区块链/比特币硅计划，并透露其已经拥有多个第二代芯片的大客户。这包括BLOCK（由Twitter fame的首席执行官杰克·多尔西掌舵）、Argo区块链和GRIID基础设施。英特尔没有&#39；t还没有分享第二代芯片和系统的细节，但我们知道它们是BMZ1 ASIC的衍生产品，如下所示。\n在这里，我们可以看到BMZ1芯片在其相当小的7 x 7.5毫米暴露芯片FCLGA封装（132个球）。作为你&#39；如下图所示，其中300个芯片为系统供电。每个芯片尺寸为4.14 x 3.42mm，总共有14.16mm^2的硅，因此这些是相对较小的硅条。更小的芯片尺寸提高了产量，并最大限度地利用了晶圆面积（每个晶圆多达4000个芯片），从而有助于最大限度地提高生产能力（尽管它确实需要更多的晶圆切割/封装能力）。英特尔称这些是7nm ASIC，但没有&#39；t指定这是否是它自己的#39；英特尔7和39；最初的7nm将流程节点重命名为&#39；英特尔4,39；或台积电&#39；7nm工艺。每个Bonanza Mine ASIC有258个挖掘引擎，每个引擎计算并行SHA256双哈希。这些引擎占据了90%的芯片面积，并以英特尔所称的&#39；超低&#39；电压355mV。缩小到系统中的300个芯片，有&#39；总共有4248mm^2的硅，以3600W的功耗提供高达40次/秒的速度。每个ASIC在75摄氏度下以1.35到1.6 GHz的频率工作，每个ASIC平均消耗7.5瓦，同时达到137 Ghash/s。在355mV下达到55 J/THash/s。\n英特尔在每个散列板上的75个Bonanza Mine ASIC上焊接，排列在25个深电压堆栈中，堆栈电压相连。散列板还包含一个微控制器，用于管理通电和热/堆栈电压监控。10MB/s UART串行链路在芯片和位于整个系统顶部的控制单元之间交换数据。\n在这里，我们可以看到整个系统的框图和图像。四块散列板垂直放置在一个单元中，带有四个风扇，可保持系统冷却。控制单元位于设备顶部，包含一个基于Intel FPGA的系统控制器和一个Arm Cortex内核，该内核运行挖掘守护进程并在300个芯片之间分配工作。ARM内核还调整芯片上的PLL，以控制芯片频率，并验证ASIC&#39；散列结果。正如您所料，该装置还具有以太网连接，可与更大的采矿池进行通信。该系统还具有可编程电源。\n如上所示，该系统可以在不同的功率/热模式下运行，如节能、平衡和高性能，以定制使用模式，从而产生54到60 J/THash的任何功率。英特尔用第一代Bonanza矿山芯片构建了上述系统。然而，英特尔&#39；s的第二代芯片显然可以用于几种配置：GRIID和#39；谷歌与英特尔的供应协议中有大量的密文来保护敏感信息，但也大量引用了英特尔&#39；参考设计资料。这些是一系列文档，客户在将Bonanza矿山芯片集成到自己的定制系统时可以使用这些文档作为指导。这意味着英特尔将向其部分客户供应硅，然后这些客户将创建自己的系统。这也与杰克·多尔西（Jack Dorsey#39；他说，这将创造一个&#34；比特币挖掘系统基于定制硅芯片，面向全球个人和企业开放源代码&#34; 当然，英特尔也可以制造完整的采矿系统，并通过合作伙伴将其推向市场，但我们&#39；We’我们还得等着进一步了解它的上市策略。英特尔&#39；s的第一代Bonanza矿芯片为其第二代Bonanza矿芯片设定了一个充满希望的基调，这些芯片已经在向客户推出。然而，关于第二代芯片的技术细节，如性能、效率、定价、功耗、工艺节点、使用的铸造厂等，仍有很多未知因素。我们也不&#39；我不了解这家公司&#39；s对其未来路线图的计划。英特尔将于本周晚些时候在ISSCC举行问答会议，我们&#39；我们将在会议结束后继续提供更多信息。", "note_en": "At ISSCC 2022, Intel shared the deep-dive details of its new Bitcoin-mining Bonanza Mine ASICs and outlined how it melds 300 of these tiny power-efficient chips into a powerful 3,600W miner that challenges the best on the market from Bitmain and MicroBT with up to 40 THash/s of performance.  We  first discovered Intel&#39;s Bonanza Mine ASICs in a listing for a presentation at the  ISSCC 2022 conference, and the information below comes from the presentations at the event. This material covers the first generation of Intel&#39;s mining chips, known as BMZ1, but the company has already moved on to its  second-gen &#39;Bonanza Mine&#39; ASIC, known as BMZ2, that it is now making available to customers.  After news of the company&#39;s efforts came to light,  Intel finally officially acknowledged its blockchain/Bitcoin silicon program, divulging that it already has several large customers for the second-gen chips. That includes BLOCK (helmed by CEO Jack Dorsey of Twitter fame), Argo Blockchain, and GRIID Infrastructure.  Intel hasn&#39;t shared details of the second-gen chips and systems yet, but we do know they are derivatives of the BMZ1 ASICs shown below.\n   Here we can see the BMZ1 chip in its rather small 7 x 7.5mm exposed-die FCLGA package (132 balls). As you&#39;ll see below, 300 of these chips power the system.   Each chip die measures 4.14 x 3.42mm, for a total of 14.16mm^2 of silicon, so these are comparatively small slivers of silicon. The smaller die size improves yield and maximizes wafer area usage (up to 4,000 die per wafer), thus helping maximize production capacity (though it does require more wafer dicing/packaging capacity). Intel says these are 7nm ASICs, but doesn&#39;t specify if that is its own &#39;Intel 7,&#39; the original 7nm before it renamed the process node to &#39;Intel 4,&#39; or TSMC&#39;s 7nm process.  Each Bonanza Mine ASIC has 258 mining engines, and each engine computes parallel SHA256 double hashes. These engines comprise 90% of the die area and operate at what Intel characterizes as an &#39;ultra-low&#39; voltage of 355mV.  Zooming out to the 300 chips in the system, there&#39;s a total of 4,248mm^2 of silicon that delivers up to 40TH/s at 3600W of power consumption. Each ASIC operates at 1.35 to 1.6 GHz at 75C, consuming an average of 7.5W apiece while hitting up to 137 Ghash/s. That works out to 55 J/THash/s at 355mV.\n   Intel solders on 75 Bonanza Mine ASICs per hash board, arranged in 25-deep voltage stacks with ganged stack-voltages. The hash board also houses a microcontroller that manages power-on and thermal/stack-voltage monitoring. A 10MB/s UART serial link shuffles data between the chips and the control unit that sits atop the full system.\n    Here we can see both the block diagram and images of the full system. Four hash boards are placed vertically into a single unit with four fans that keep the system cool.  The control unit sits atop the device, housing an Intel-FPGA-based system controller and an Arm Cortex core that runs the mining daemon and distributes the work among the 300 chips. The ARM core also adjusts the on-die PLLs to control chip frequencies and verify the ASICs&#39; hash results. As you would expect, the unit also has an Ethernet connection to communicate with a larger mining pool. The system also has a programmable power supply.\n  As shown above, the system can operate in different power/thermal profiles, like Power-Saving, Balanced, and High-Performance, to tailor the usage profile, thus yielding anywhere from 54 to 60 J/THash.  Intel built the system described above from the first-gen Bonanza Mine chips. However, Intel&#39;s second-gen chips can obviously be used in several configurations: GRIID&#39;s  supply agreement with Intel has plenty of redactions to protect sensitive information, but it also heavily references Intel&#39;s Reference Design Materials. These are a series of documents that customers use as guidance when integrating the Bonanza Mine chips into their own custom systems.  This implies that Intel will supply the silicon to some of its customers, who will then create their own systems. This also meshes well with Jack Dorsey&#39;s plans for BLOCK, which  he says will create a &#34;bitcoin mining system based on custom silicon and open source for individuals and businesses worldwide.&#34; Of course, Intel could also manufacture complete mining systems and bring them to market through partners, but we&#39;ll have to wait to learn more about its go-to-market strategy.  Intel&#39;s first-gen Bonanza Mine chip sets a promising tone for its second-gen Bonanza Mine chips that are already working their way out to customers. However, there are still plenty of unknowns about the technical details of the second-gen chips, like performance, efficiency, pricing, power consumption, the process node, foundry used, and so on. We also don&#39;t know the company&#39;s plans for its future roadmap.  Intel has a question and answer session scheduled at ISSCC for later in the week, and we&#39;ll follow up with more information after.", "posttime": "2022-02-21 04:45:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,芯片,比特币,开采,details", "title": "英特尔详细介绍了其比特币开采“Bonanza Mine”芯片和系统", "title_en": "Intel Details Its Bitcoin-Mining 'Bonanza Mine' Chips and Systems", "transed": 1, "url": "https://www.tomshardware.com/news/intel-details-its-bitcoin-mining-bonanza-mine-chips-and-systems", "via": "", "real_tags": ["英特尔", "芯片", "比特币", "开采", "details"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074367, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "比特币发明者的特征是什么？那个人就是中本聪。\n让我们用一个新的名字来命名Satoshi，以便尽可能少地偏袒Satoshi。\nX必须精通C++，因为Satoshi在C++中编写了比特币源代码。\nX可能在2009年1月10日在加利福尼亚州范努伊斯，因为佐藤在这个时间和地点透露了一个IP地址，而佐藤通常在俄罗斯使用代理，这使得范努伊斯的泄密可能是无意的、真实的。\nX可能会使用诸如“数量级”和“血腥”之类的短语，因为佐藤是这样做的。\nX可能是“专横的”，因为与佐藤一起工作的人就是这样描述他的。\nX在2007年肯定有时间写比特币，因为Satoshi就是在那时写的。", "note_en": "What are the characteristics of the person who invented Bitcoin? The person who  is Satoshi Nakamoto.\n  Let’s use a new name for the pseudonym Satoshi in order to consider the person who  is Satoshi with as little bias as possible.\n  X must have proficiency in C++, because Satoshi wrote the Bitcoin source code in C++.\n  X probably was in Van Nuys, California on 2009–01–10, because Satoshi revealed an IP address at this place and time, and Satoshi typically used a proxy in Russia, which makes the Van Nuys leak probably inadvertent and genuine.\n    X might use phrases like “order of magnitude” and “bloody”, because Satoshi did.\n   X might be “bossy”, because that’s how people who worked with Satoshi described him.\n X must have had time to write Bitcoin in 2007, because that’s when Satoshi did.", "posttime": "2022-02-21 04:44:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "paypal,specific,satoshi", "title": "Satoshi和PayPal联合创始人之间的高度特定的共同点", "title_en": "Highly specific commonalities between Satoshi and Co-Founder of PayPal", "transed": 1, "url": "https://medium.com/@sahil50/satoshi-nakamoto-is-x-1a5f5fb09f1", "via": "", "real_tags": ["paypal", "specific", "satoshi"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074366, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两位独立消息人士表示，微软已经开始或即将开始开发Windows 12。雷德蒙德目前正在调动人员，准备团队开始Windows 12开发。此次工作场所重组发生在Windows 11推出以来最重要的更新发布几天后。\n微软MVP Swift on Security今天在推特上表示，微软的一位消息人士告诉他，&#34；Windows 12已经在开发中，它&#39；这将需要两个胎压监测系统&#34;  德克莫德。de声称自己也听说过微软的Windows 12开发。然而，第二位独立消息人士表示，Windows 12将从下个月开始开发，因为微软仍在为该项目组建团队。\n在&#34；两个胎压监测系统&#34；细节方面，我们的陪审团有分歧。安全方面的斯威夫特不是&#39；无论如何，这都不是一个很幽默的说法，但德克莫德说，这只是一个笑话。翻开我们之前对Windows和安全性的报道，我们认为Swift on security可能是在谈论Windows 12需要TPM和片上硬件，如Microsoft Proputo处理器和/或AMD平台安全处理器。\n&#34;Ryzen 6000包括新的Microsoft Proputo security协处理器，它增加了更多功能和&#34；Xbox类和#34；除了AMD和#39；现有的平台安全处理器（PSP）和#34；AMD解释道&#34;PSP仍然控制用于安全引导的固件身份验证、运行时的映射I/O，以及用于安全目的的加密引擎。Puropon处理器将提供fTPM功能和其他操作系统导向的功能&#34;\nWindows 10大概是2015年发布的Windows操作系统的最后一个版本。很高兴知道，我们将有一个较长的稳定期，每半年交替进行一次引擎盖下的功能更新，并从Windows 8中拯救了我们。然而，Windows 11的发布和发布粗暴地将我们从令人满意的起伏的操作系统进程中唤醒。\n据说Windows 11在某种程度上是必要的，因为变化的规模需要它。一些最重要的预告性变化包括一个改进的任务调度程序，这将使PC机在英特尔&#39；s混合架构Alder Lake处理器成为主流。此外，人们非常重视系统安全。主要是在这个祭坛上，微软有足够的信心牺牲了许多可用的老一代CPU（英特尔卡比湖或老一代，AMD Ryzen 1000或老一代）。\n到目前为止，Windows 11没有&#39；t似乎吸引了个人电脑用户的心，这就是我们对个人电脑市场狂热者的感受。然而，Windows有一个传说中的好版本——破坏性版本周期。出于这个原因，以及可能来自系统和组件制造商推动硬件升级的压力，可能是微软似乎重新回到常规主要Windows版本更新轨道的原因。\n最后但并非最不重要的一点是，即使有两个独立的消息来源支持Windows 12的开发，我们仍然认为这条新闻需要一些盐。\n考虑到W11肯定不是没有它&#39；我和我妻子都有问题；s的PC没有问题，我想我们会错过W11，等待W12。\n回复", "note_en": "Two independent sources have  said that Microsoft has either started or is on the verge of beginning the development of Windows 12. Redmond is currently shifting personnel around, readying teams to start Windows 12 development. The workplace reshuffling takes place just days after delivering the  most significant update to Windows 11 since its introduction.\n  Microsoft MVP  Swift on Security tweeted today that a source at Microsoft had told him, &#34;Windows 12 is already under development, and it&#39;s going to require two TPMs.&#34;  Deskmodder.de claims it too heard about Windows 12 development at Microsoft. However, this second independent source says that Windows 12 will only be in development starting from next month, as Microsoft is still building teams for the project.\n  On the &#34;Two TPMs&#34; detail, we have a split jury. Swift on Security isn&#39;t a heavy humor account by any means, but Deskmodder says that this reference is just a joke. Digging through our previous coverage of Windows and security, we think Swift on Security may be talking about Windows 12 requiring both a TPM and on-chip hardware like the  Microsoft Pluton Processor and or AMD Platform Security Processor.\n   &#34;Ryzen 6000 includes the new Microsoft Pluton security co-processor, which adds more functionality and &#34;Xbox-class&#34; security in addition to AMD&#39;s existing Platform Security Processor (PSP),&#34; explained AMD. &#34;The PSP still controls firmware authentication for secure boot, mapped I/O during runtime, and a cryptographic engine for security purposes. The Pluton processor steps in for fTPM functionality and additional OS-directed features.&#34;\n  Windows 10 was presumably the last version of the Windows OS when released back in 2015. It was pleasant to know that we would have an extended period of stability, with biannually alternating under-the-hood and feature updates from the OS that saved us from Windows 8. However, the announcement and  launch of Windows 11 rudely awoke us from our contented undulating OS progress.\n  The story goes that Windows 11 was somehow necessary as the scale of the change demanded it. Some of the most significant heralded changes included a revamped task scheduler, which would make PCs more efficient with Intel&#39;s hybrid architecture  Alder Lake processors becoming mainstream. Furthermore, there was a lot of emphasis on system security. It was mainly on this altar that Microsoft felt confident enough to  sacrifice many serviceable older-gen CPUs (Intel Kaby Lake or older, AMD Ryzen 1000 or older).\n So far, Windows 11 doesn&#39;t seem to have caught the hearts and minds of PC users - this is how we feel from the enthusiast side of the PC market. However, Windows has a fabled good version – destructive version cycle. For this reason, as well as perhaps pressure from systems and component makers to promote hardware upgrades, might be why Microsoft seems to be getting back on the regular major Windows version update track.\n Last but not least, even with two independent sources behind these rumors of Windows 12 development, we still think the news requires some salt.\n      Given that W11 is certainly not without it&#39;s problems and that W10, on both mine and my wife&#39;s PCs, is problem free, I think we will give W11 a miss and wait for W12.\n   Reply", "posttime": "2022-02-21 04:41:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,windows,报道,reportedly", "title": "据报道，Windows 12开发将于下月正式启动", "title_en": "Windows 12 Development Reportedly Begins in Earnest Next Month", "transed": 1, "url": "https://www.tomshardware.com/news/windows-12-developement-earnest-next-month", "via": "", "real_tags": ["开发", "windows", "报道"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074365, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1969年5月的一个温暖的夜晚，一群令人敬畏的赌徒围着意大利里维埃拉一张破旧的轮盘赌桌。\n中心站着一位38岁的瘦长的医学教授，穿着皱巴巴的西装。他刚刚下了10万美元的赌注（2019年为71.5万美元），赌一圈。当蹲下的人打开白色小球时，房间里一片寂静。他不可能这么幸运吧？\n但是Richard Jarecki博士并没有把它留给机会。他花了数千个小时设计了一种巧妙的制胜方法，很快他就获得了相当于80多万美元的现代奖金。\n理查德·贾雷基1931年出生于德国斯特廷的一个犹太家庭，被推入一个混乱的世界。\n德国正处于经济困难的阵痛之中，纳粹党正通过一个反犹太主义纲领获得支持，该纲领将该国的弊病归咎于犹太公民。贾雷基的父母是皮肤科医生，也是航运业的女继承人，他们的所有财产都逐渐被剥夺。二战开始时，他们面临拘留，为了更好的生活逃到了美国。\n在新泽西州，年轻的贾雷基在拉米、斯卡特和桥牌等游戏中找到了慰藉，并从朋友那里“习惯性地赢钱”中获得了极大的乐趣。他有一个聪明的头脑，能够记住数字和统计数据，因此他去学习医学——这是一项令他父亲高兴的崇高追求。\n作为50年代的一名年轻人，贾雷基获得了世界顶尖医学研究人员的声誉。\n但他隐藏着一个秘密：他真正的激情在于黑暗、发霉的赌场大厅。\n大约在1960年的某个时候，贾雷基对轮盘赌产生了痴迷。轮盘赌是一种游戏，一个小球绕着一个随机编号的多色轮子旋转，玩家下注于它将落在哪里。\n虽然轮盘赌被许多人认为纯粹是一种机会游戏，但贾雷基确信它可以被“击败”\n他注意到，每天晚上结束时，赌场都会用新的轮盘来替换纸牌和骰子——但昂贵的轮盘赌轮盘没有被碰过，而且在被替换之前通常会使用几十年。\n和其他机器一样，这些轮子也会磨损。Jarecki开始怀疑微小的缺陷——碎屑、凹痕、划痕、不平整的表面——可能会导致某些车轮比随机性规定的更频繁地落在特定的数字上。\n医生周末在手术台和轮盘赌台之间来回奔波，手动记录成千上万次旋转，并分析数据中的统计异常。\n1969年，他告诉《悉尼先驱晨报》：“我（一直在试验），直到我根据之前的获奖数字大致勾勒出一个系统的轮廓。”。“如果1号、2号和3号在最后3轮中获胜，我可以确定下一轮最有可能获胜的是什么。”\n贾雷基的方法并不新鲜：约瑟夫·贾格尔被认为是所谓“偏向车轮”战略的“先驱”，在19世纪80年代以这种方式赢得了巨额资金。1947年，研究人员阿尔伯特·希布斯（Albert Hibbs）和罗伊·沃尔福德（Roy Walford）博士（Dr.Roy Walford）利用这一技术购买了一艘游艇，驶向加勒比海的日落。还有赫尔穆特·伯林（Helmut Berlin），一位前车床操作员，他在1950年雇佣了一队密友来跟踪车轮，并以42万美元逃走。\n但对贾雷基来说，这与钱无关：他想完善这个系统，重复一遍，然后“敲打”方向盘。这是一个人战胜机器的问题。\n在收集了数月的数据后，他凑足了100美元（他在雨天的积蓄），去了赌场。他从未赌博过——尽管他相信自己的研究，但他知道自己仍然面临着“机会的因素”\n在几个小时内，他把100美元变成了5000美元（今天大约41000美元）。通过这种验证，他转向了更高的赌注。\n在60年代中期，JaRiki移居德国，在海德堡大学攻读电泳和法医学。\n他最近因在国际医学合作方面的工作而获得了一项享有盛誉的和平奖（全世界仅有的12项和平奖之一），并因此进入了一个由医生和科学家组成的精英群体。\n欧洲轮盘赌轮盘赌的赔率比美国轮盘赌轮盘赌的赔率高：他们有37个轮盘赌槽，而不是38个轮盘赌槽，这使赌场对玩家的优势从5.26%降至2.7%。而且，正如贾雷基会发现的那样，它们只是他那种类型的机器——陈旧、简陋，而且充满了物理缺陷。\n他和妻子卡罗尔在欧洲各地的赌场里搜寻了几十个轮子，从蒙特卡洛（摩纳哥）、迪冯·莱班斯（法国）到巴登·巴登（德国）。两人招募了一个由8名“计时员”组成的团队，他们在这些场馆张贴帖子，有时在一个月的时间里记录多达20000次旋转。\n在确定哪些车轮存在偏差后，他从一位瑞士金融家那里获得了2.5万英镑的贷款，并花了6个月时间坦率地严格执行他的策略。到比赛结束时，他净赚了62.5万英镑（今天大约670万美元）。\n从堪萨斯到澳大利亚，贾雷基的胜利成为世界各地报纸的头条新闻。每个人都想知道他的“秘密”——但他知道，如果他想复制这一壮举，就必须隐藏自己真正的方法论。\n因此，他为媒体编造了一个“奇幻故事”：他每天统计轮盘赌的结果，然后将信息输入Atlas超级计算机，该计算机告诉他选择哪个数字。\n当时，赌博历史学家拉塞尔·巴恩哈特（Russell Barnhart）在《打方向盘》一书中写道，“计算机被视为来自外太空的生物……几乎没有人，包括赌场经理，具备职业资格来区分神话和现实。”\n在这一技术诡计的背后，贾雷基继续关注有偏见的表格——并为他的下一个重大举措做好准备。\n贾雷基现金充裕，在地中海沿岸富丽堂皇的意大利赌场圣雷莫附近购买了一套豪华公寓。\n通过仔细观察，他发现一张桌子的落地习惯比平常多得多——这是“球与轮子不断摩擦”的结果\n1968年的一个春夜，他开着他的白色劳斯莱斯（Rolls-Royce）来到赌场，在三天多的时间里，他赢得了4.8万美元（今天是36万美元）。\n八个月后，他回来了，在一个周末赢得了19.2万美元（14万美元），并在一个晚上两次用两个不同的轮子打破了银行（耗尽了赌场的手头现金）。由于濒临破产，赌场老板别无选择，只能以“太好”为由，向贾雷基发出15天的禁令\n禁令解除的那天晚上，贾雷基回来了，又赢了10万美元（合71.7万美元）——这么多钱，赌场不得不给他一张期票。\n当贾雷基出现在一家赌场时，大批人群聚集在一起，见证这位大师的工作。许多人会模仿他的一举一动，在相同的数字上下小赌注。\n为了打败贾雷基，赌场老板每天晚上都在不同的地方重新安排他最喜欢的轮盘赌。但是这位教授知道木头上的每一条纹理——每一个裂纹、划痕和变色——他总是把它们挖出来。\n“他对欧洲的每家赌场都是一个威胁，”赌场老板拉德拉先生告诉《悉尼先驱晨报》。“我不知道他到底是怎么做到的，但如果他再也不回到我的赌场，我将是一个非常快乐的人。”\n“如果赌场经理不想输，”贾雷基反驳道，“他们应该卖蔬菜。”\n最后，雷莫以24美元的价格把房子换成了轮盘赌。他们放弃了，这是阻止他们见过的最好球员的唯一方法。在贾雷基统治后的几十年里，赌场投入巨资监控其轮盘赌桌的缺陷，并建造不太容易产生偏差的轮子。如今，大多数车轮都已经数字化，由有利于房子的编程算法运行。\n据报道，贾雷茨基在1964年至1969年间在有偏轮盘赌桌上下了12.5万美元（今天为80万美元）的巨额赌注。\n意大利报纸《意大利日报》称他为“世界上最成功的轮盘赌选手”——一位“看起来不像赌徒”的芦苇学者他曾被认为是校园里的“书呆子”，后来成了“大学里每个学生的英雄”\n1973年，贾雷基将家人搬回新泽西州，在那里他开始了商品经纪人的新职业。在亿万富翁哥哥的帮助下，他的财富翻了10倍。他还把自己对游戏的爱好传给了儿子，儿子9岁时成为历史上最年轻的国际象棋大师。\n有时，赌场老板会打电话向他提出合作意向，但他从未上钩：“他（喜欢）从赌场拿钱，”他的妻子卡罗尔告诉《纽约时报》，“而不是给他们。”\n90年代初，贾雷基厌倦了大西洋城，搬到了马尼拉，那里有着繁荣（监管松散）的赌博场所。他一直留在那里，直到2018年去世，享年87岁。\n他躲在一个熙熙攘攘的赌场角落里，周围是霓虹灯和老虎机，他下了最后一次赌注。轮子转了又转。就像以前很多次一样，这个白色的小球落在了他的号码上。", "note_en": "On a warm night in May of 1969, a throng of awestruck gamblers crowded around a well-worn roulette table in the Italian Riviera.\n At the center stood a gangly 38-year-old medical professor in a rumpled suit. He’d just placed a $100,000 bet ($715,000 in 2019 dollars) on a single spin of the wheel. As the croupier unleashed the little white ball, the room went silent.  He couldn’t possibly be this lucky… could he?\n But Dr. Richard Jarecki wasn’t leaving it up to chance. He’d spent thousands of hours devising an ingenious method of winning — and it would soon net him the modern equivalent of more than $8,000,000.\n   Born in 1931 to a Jewish family in Stettin, Germany, Richard Jarecki was thrust into a world in chaos.\n Germany was in the throes of economic hardship, and the Nazi Party was gaining support with an anti-Semitic platform that blamed the country’s ills on Jewish citizens. Jarecki’s parents, a dermatologist and a shipping industry heiress, were gradually stripped of everything they had. Facing internment at the onset of WWII, they fled to America for a better life.\n  In New Jersey, the young Jarecki found solace in games like rummy, skat, and bridge, and took great pleasure in “habitually winning money” from friends. Gifted with a brilliant mind that could retain numbers and statistics, he went to study medicine — a noble pursuit that pleased his father.\n As a young man in the ‘50s, Jarecki gained a reputation as one of the world’s  foremost medical researchers.\n But he harbored a secret: His true passion lay in the dark, musty halls of casinos.\n   Sometime around 1960, Jarecki developed an obsession with roulette, a game where a little ball is  spun around a randomly numbered, multi-colored wheel and the player places bets on where it will land.\n Though roulette was considered by many to be purely a game of chance, Jarecki was convinced that it could be “beat.”\n He noticed that at the end of each night, casinos would replace cards and dice with fresh sets — but the expensive roulette wheels went untouched and often stayed in service for decades before being replaced.\n Like any other machine, these wheels acquired wear and tear. Jarecki began to suspect that tiny defects — chips, dents, scratches, unlevel surfaces — might cause certain wheels to land on certain numbers more frequently than randomocity prescribed.\n  The doctor spent weekends commuting between the operating table and the roulette table, manually recording thousands upon thousands of spins, and analyzing the data for statistical abnormalities.\n “I [experimented] until I had a rough outline of a system based on the previous winning numbers,” he told the   Sydney Morning Herald in 1969. “If numbers 1, 2, and 3 won the last 3 rounds, [I could determine] what was most likely to win the next 3.”\n Jarecki’s approach wasn’t new:  Joseph Jagger, thought to be the “pioneer” of the so-called “biased wheel” strategy, had won hefty sums this way in the 1880s. In 1947, researchers  Albert Hibbs and Dr. Roy Walford used the technique to buy a yacht and sail off into the Caribbean sunset. Then, there was  Helmut Berlin, an ex-lathe operator who, in 1950, hired a team of cronies to track wheels and made off with $420,000.\n But for Jarecki, it wasn’t about the money: He wanted to  perfect the system, repeat it, and “beat” the wheel. It was a matter of man triumphing over machine.\n After months of collecting data, he scraped together $100 (his rainy day savings) and hit the casino. He’d never gambled — and though he trusted his research, he knew he was still up against “the element of chance.”\n In a matter of hours, he flipped his $100 into $5,000 (~$41,000 today). And with this validation, he turned to much higher stakes.\n   In the mid-60s, Jarecki moved to Germany and took up a post at the University of Heidelberg to study  electrophoresis and forensic medicine.\n He’d recently won a highly prestigious peace prize (one of only 12 awarded worldwide) for his work on international cooperation in medicine, and, as a result, had gained entry into an elite group of doctors and scientists.\n   European roulette wheels offered better odds than American wheels: They had 37 slots instead of 38, reducing the casino’s edge over the player from 5.26% to  2.7%. And, as Jarecki would discover, they were just his type of machine — old, janky, and full of physical defects.\n With his wife, Carol, he scouted dozens of wheels at casinos around Europe, from Monte Carlo (Monaco), to Divonne-les-Bains (France), to Baden-Baden (Germany). The pair recruited a team of 8 “clockers” who posted up at these venues, sometimes recording as many as 20,000 spins over a month-long period.\n  After establishing which wheels were biased, he secured a £25,000 loan from a Swiss financier and spent 6 months candidly exacting his strategy. By the end of the run, he’d netted  £625,000 (roughly $6,700,000 today).\n Jarecki’s victories made headlines in newspapers all over the world, from Kansas to Australia. Everyone wanted his “secret” — but he knew that if he wanted to replicate the feat, he’d have to conceal his true methodology.\n  So, he concocted a “fanciful tale” for the press: He tallied roulette outcomes daily, then fed the information into an Atlas supercomputer, which told him which numbers to pick.\n At the time, wrote gambling historian, Russell Barnhart, in   Beating the Wheel, “Computers were looked upon as creatures from outer space… Few persons, including casino managers, were vocationally qualified to distinguish myth from reality.”\n Hiding behind this technological ruse, Jarecki continued to keep tabs on biased tables — and prepare for his next big move.\n   Flush with cash, Jarecki purchased a luxury apartment near San Remo, a palatial Italian casino on the shores of the Mediterranean.\n Through studious observation, he identified a table that had a habit of landing on #33 far more than usual — a  result of the “constant friction of the ball against the wheel.”\n On a spring night in 1968, he drove his white Rolls Royce to the gambling den and, over  3 days, proceeded to win $48,000 ($360,000 today).\n Eight months later he returned, winning $192,000 ($1,400,000) in a single weekend, and breaking the bank (depleting the casino’s on-hand cash) at two different wheels  twice in one night. Teetering on bankruptcy, the casino owner had no option but to issue Jarecki a  15-day ban… for “being too good.”\n  The night the ban was lifted, Jarecki returned and  won another $100,000 ($717,000) — so much money that the casino had to give him a promissory note.\n When Jarecki showed up to a casino, large crowds would gather to witness the master at work. Many would mirror his every move, placing small bets on the same numbers.\n In a bid to outfox Jarecki, casino owners rearranged his favorite roulette wheels in different spots every night. But the professor knew every vein in the wood —  every nic, crack, scratch, and discoloration — and he always ferreted them out.\n “He is a menace to every casino in Europe,” casino owner, Signor Lardera,  told the  Sydney Morning Herald. “I don’t know how he does it exactly, but if he never returned to my casino I would be a very happy man.”\n “If the casino directors don’t like to lose,”  retorted Jarecki, “they should sell vegetables.”\n Eventually, San Remo gave up and replaced all 24 of its roulette wheels at a steep cost to the house. It was, they ceded, the only way to stop the best player they’d ever seen.   In the decades following Jarecki’s dominance, casinos invested heavily in monitoring their roulette tables for defects and building wheels  less prone to bias. Today, most wheels have gone digital, run by algorithms programmed to favor the house.\n   All told, Jarecki made a reported $1,250,000 ($8,000,000 today) placing hefty bets on biased roulette tables between 1964 and 1969.\n The Italian newspaper  Il Giorno called him “The world’s most successful roulette player” — a reedy academic who “[didn’t] look like a gambler.” Once deemed to be an “egghead” on campus, he  became “the hero of every student at his university.”\n  In 1973, Jarecki moved his family back to New Jersey, where he started a new career as a commodities broker. With the help of his  billionaire brother, he multiplied his fortune 10 times over. He also passed down his penchant for games to his son, who, at the  age of 9, became the youngest chess master in history.\n On occasion, casino owners would call him with partnership offers, but he never took the bait: “He [liked] to take money from the casinos,” his wife, Carol,  told  TheNew York Times, “not give it to them.”\n In the early ‘90s, Jarecki grew tired of Atlantic City and relocated to Manila, home to a flourishing (and loosely regulated) gambling scene. He remained there until his death in 2018, at the age of 87.\n Tucked in the corner of a bustling gambling hall, surrounded by neon lights and slot machines, he wagered his final bet. The wheel spun round and round. Like so many times before, the little white ball landed on his  number.", "posttime": "2022-02-21 04:33:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "轮盘,beat,贾雷基", "title": "打败轮盘赌的教授", "title_en": "The professor who beat roulette", "transed": 1, "url": "https://thehustle.co/professor-who-beat-roulette/", "via": "", "real_tags": ["轮盘", "beat", "贾雷基"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074364, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伯克希尔哈撒韦公司（Berkshire Hathaway Inc.）的亿万富翁副董事长、沃伦·巴菲特（Warren Buffett）的商业伙伴芒格说，芬克旗下贝莱德公司（BlackRock Inc.）运营的指数基金的兴起，导致了影响企业决策的权力的“巨大转移”。他说，这种转变将“改变世界”，而不是变得更好。\n《华尔街日报》将向您收取$+税（如果适用）。您可以随时在客户中心或致电客户服务部更改账单偏好。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客服取消订阅。", "note_en": "Mr. Munger, the billionaire vice chairman of Berkshire Hathaway Inc. and Warren Buffett’s  business partner, said the rise of index funds like those run by Mr. Fink’s BlackRock Inc. has resulted in an “enormous transfer” of the power to sway corporate decision making. That shift will “change the world,” he said, and not for the better.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2022-02-21 04:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芒格,munger", "title": "查理·芒格（Charlie Munger）预计指数基金会改变世界——但不是以一种好的方式", "title_en": "Charlie Munger expects index funds to change the world – and not in a good way", "transed": 1, "url": "https://www.wsj.com/articles/charlie-munger-expects-index-funds-to-change-the-worldand-not-in-a-good-way-11645055334", "via": "", "real_tags": ["芒格", "munger"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074363, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我每周都会重读一篇我最喜欢的关于生活建议的文章——每周一篇。它之所以有用，有几个不同的原因：\n最好的文章有足够多的有用的建议，我每次读它们都会发现新的有趣的地方。\n许多好的建议很容易理解，但很难实施。因此，为了从中获得最大的好处，你应该找到最能引起你共鸣的版本，然后经常重读，让自己保持正轨。\n我收集了我最喜欢的文章，在下面重读。我会不断更新这篇文章，因为我发现了更多优秀的文章，我欢迎其他的贡献，请在评论中提出你自己的最爱！\n有了孩子，我学会了如何将连续的时间转化为离散的时间。你只有52个周末和你2岁的孩子在一起。如果圣诞魔法持续时间从3岁到10岁，你只能看你的孩子经历8次。虽然不可能说什么是大量或少量的连续量，比如时间，但8并不是很多。如果你有一把8个花生，或者一个书架上有8本书可供选择，那么无论你的寿命如何，数量肯定是有限的。\n这对我来说很重要。这意味着“生命对于x来说太短”这种形式的论点有很大的影响力。说生命太短暂，不适合做某事，这不仅仅是一种修辞。它不仅仅是烦人的同义词。如果你发现自己认为生命对于某件事来说太短，你应该尽可能地消除它。\n当我问自己，我发现生命对于什么来说太短了，脑海中闪现的词是“胡说”我意识到这个答案有些重复。这几乎是胡说八道的定义，它是生命短暂的东西。然而，废话确实有一个独特的特征。这有点假。这是经验的垃圾食品。[1]\n如果你问自己你花了多少时间在这上面，那是胡说，你可能已经知道答案了。不必要的会议、毫无意义的争端、官僚主义、装腔作势、处理他人的错误、交通堵塞、令人上瘾但毫无回报的消遣。\n我发现，除非我保持警惕，否则我生活中的胡说八道只会越来越多。每隔一段时间重读《生命短暂》会让我大吃一惊，弄清楚什么才是真正重要的，以及如何让胡说八道的水平下降。\n德里克·西弗斯，没有速度限制，他在一个下午学习了一学期的音乐理论：\n不到一分钟，他就开始盘问我。“如果五和弦和七号调有三个音，那么另一个七号调也有三个音。哪一个？”\n“对！这是一个替代和弦。任何一个7号平和弦都可以用另一个7号平和弦来替代，这个7号平和弦共享同一个三音。所以，在这个图表中，你可以重新协调所有和弦。开始。”\n节奏很快，我很喜欢。最后，有人在挑战我——把我压在头上——鼓励并期待我尽快振作起来。我学得太快了，感觉就像玩电子游戏时的肾上腺素激增。他把所有事实都抛给我，让我证明我明白了。\n那天早上我们上了三个小时的课，他教了我整整一学期伯克利的和声课程。\n这是让你变得不耐烦的主要启示之一。每次我重读它，我都会想到至少一件事，我会无缘无故地给自己设置限速！\n山姆·奥特曼，怎样才能成功。山姆可能比这个星球上的任何人都更仔细地观察到了更多成功人士，而这个建议正如你所期待的那样好。\n花更多时间思考应该关注什么，几乎我见过的每个人都会受益匪浅。做正确的事情比长时间工作要重要得多。大多数人把大部分时间浪费在无关紧要的事情上。\n一旦你想好了该做什么，就要毫不犹豫地迅速完成你的一小部分优先事项。我还没有遇到过一个行动迟缓、非常成功的人。\n几乎总是，那些说“我会一直坚持下去，直到成功，不管有什么挑战，我都会找到答案”的人，他们是认真的，会继续取得成功。他们有足够长的毅力，给自己一个好运的机会。\n&amp；mldr要想任性，你必须乐观，希望这是一种可以通过实践改善的性格特征。我从未见过一个非常成功的悲观主义者。\nR·W·哈明，你和你的研究。哈明观察到的伟大科学家几乎和山姆·奥特曼观察到的一样多。他得出了一些有趣的结论：\n起初，我问化学中的重要问题是什么，然后问他们正在研究哪些重要问题，或者可能导致重要结果的问题。一天，我问：“如果他们正在做的事情不重要，也不太可能导致重要的事情，他们为什么要做这些事情？”之后我不得不和工程师们一起吃饭！\n大约四个月后，我的朋友在大厅里拦住我，说我的问题困扰了他。他整个夏天都在思考他所在领域的重要问题，虽然没有改变他的研究，但他认为这是非常值得的。我谢了他，继续走。几周后，我注意到他被任命为部门负责人。许多年后，他成为美国国家工程院院士。一个能听到这个问题的人接着做了重要的事情，而据我所知，所有其他人都没有做任何值得公众关注的事情。\n&amp；mldr一些人在工作时开门，清楚地看到路过的人，而另一些人则小心地保护自己不受打扰。那些开门的人每天完成的工作更少，但那些关门的人往往不知道该做什么，也不容易听到他们“清单”问题中缺失部分的线索。我无法证明敞开的大门会产生开放的思想，或者反过来。我只能观察到这种相关性。我怀疑这两者都会加强彼此，一扇打开的门比一扇关闭的门更有可能导致你和重要的问题。\n我花了很多年才注意到另一个特点，那就是容忍歧义的能力。大多数人想相信他们所学到的是事实：有少数人对一切都持怀疑态度。如果你相信的太多，那么你就不太可能找到改变一个领域的全新视角，如果你怀疑的太多，你就根本做不到什么。这是一个很好的平衡，在相信你所学的同时又怀疑事物。伟大的进步通常需要改变观点，使之超越该领域的标准观点。\n当你学习东西的时候，你需要从多方面思考和审视它们。通过多种方式将它们与你已经知道的联系起来；mldr。您可以稍后在异常情况下检索它们。我花了很长时间才意识到，每次我学到一些东西，我都应该在上面挂上“钩子”。这是额外努力的另一面，更深入的研究，更深入的探索，这似乎是伟大科学家的特征。\n哈明是（a）一位伟大的科学家本人，（b）对什么使他人伟大感到好奇和深思熟虑，以及（c）对他的观察（似乎）诚实和开放的不寻常组合。\n匿名，成为一名魔术师，讲述如何成为一个你现在的自己会觉得不可思议的人：\n这个描述大约有五六页长，当时，它是一种绝望的渴望的表现，渴望成为一个不在我身边的人，一个感到自由和被关心的人。当时我认为这种描述基本上是不可能的；我的生活在现实中从未如此精彩。\n快进大约七十年，当我把旧笔记本和日记从一个尘土飞扬的存储点转移到另一个存储点时，我重新发现了这种描述。当我通读它时，我发现我在描述中所做的90%的陈述是真实的（或精神上是真实的）&amp；尽管自我写这篇文章以来，我的生活发生了种种变化，但对我来说，我基本上已经成为了一个我十几岁时梦想过的人，这让我难以置信。\n然后是萨纳坦·丁达。作为一名来自加尔各答的印度视觉艺术家，他参加比赛的第一年甚至没有进入决赛，第二年他以一种打破了比赛中“好作品”的六条隐含规则的风格排名第二&amp；mldr他来的第三年，他赢得了整个比赛，比第二名的下一位艺术家赢得了大约10%的总积分。\n&amp；mldr让我困惑的是，我不知道他是怎么做到的。比如，我没有任何关于他是如何在我们所有人都有的时间框架内创作这首曲子的心智模型；他是如何想出、设计、实践的。尽管他排在第一位，我排在第五位，从逻辑上讲，我们都存在于“人体彩绘能力”的等级上，但所需的技能似乎完全不同。\n他们建议的练习对于每周（或每月或每年）的复习来说是非常有用的活动。强烈推荐！\nDan Luu，第95百分位不是很好。通过提醒你（从某种意义上说）在某件事上取得巨大进步是多么容易，这对于培养自我提升的心态非常有用：\n达到95%并不令人印象深刻，因为这并不难做到。我认为这是我最可笑的想法之一。如果赤裸裸地说出来，这听上去是精英主义的，那也无济于事。但我认为恰恰相反：大多数人可以（相对地）在大多数事情上变得很好。\n请注意，当我说95%-ile时，我的意思是95%-ile在参与的人中，而不是所有人中（对于许多活动来说，仅仅做它就可以使你在所有人中都达到99%-ile或更高）。我也不是指那些经常练习的人中95%的人。“一个奇怪的把戏”是，对于很多活动来说，在练习的人中，大约10%的人会让你在参与的人中，大约90%或99%的人。\n这不是每周的评论材料，但我也很欣赏关于丹其他最可笑想法的奖励部分。", "note_en": "I start each of my  weekly reviews by re-reading one of my favorite essays of life advice—a different one each week. It’s useful for a few different reasons:\n The best essays are dense enough with useful advice that I find new interesting bits every time I read them.\n Much good advice is  easy to understand, but hard to implement. So to get the most benefit from it, you should find whatever version of it most resonates you and then  re-read it frequently to keep yourself on track.\n I’ve collected my favorite essays for re-reading below. I’ll keep this updated as I find more great essays, and I’d welcome other contributions—please suggest your own favorites in the comments!\n    Having kids showed me how to convert a continuous quantity, time, into discrete quantities. You only get 52 weekends with your 2 year old. If Christmas-as-magic lasts from say ages 3 to 10, you only get to watch your child experience it 8 times. And while it’s impossible to say what is a lot or a little of a continuous quantity like time, 8 is not a lot of something. If you had a handful of 8 peanuts, or a shelf of 8 books to choose from, the quantity would definitely seem limited, no matter what your lifespan was.\n  It has for me. It means arguments of the form “Life is too short for x” have great force. It’s not just a figure of speech to say that life is too short for something. It’s not just a synonym for annoying. If you find yourself thinking that life is too short for something, you should try to eliminate it if you can.\n When I ask myself what I’ve found life is too short for, the word that pops into my head is “bullshit.” I realize that answer is somewhat tautological. It’s almost the definition of bullshit that it’s the stuff that life is too short for. And yet bullshit does have a distinctive character. There’s something fake about it. It’s the junk food of experience. [1]\n If you ask yourself what you spend your time on that’s bullshit, you probably already know the answer. Unnecessary meetings, pointless disputes, bureaucracy, posturing, dealing with other people’s mistakes, traffic jams, addictive but unrewarding pastimes.\n I’ve found that unless I’m vigilant, the amount of bullshit in my life only ever increases. Rereading  Life is Short every so often gives me a kick in the pants to figure out what  really matters and how to get the bullshit levels back down.\n  Derek Sivers,  There is no speed limit, in which he learns a semester’s worth of music theory in an afternoon:\n Within a minute, he started quizzing me. “If the 5-chord with the flat-7 has that tri-tone, then so does another flat-7 chord. Which one?”\n  “Right! So that’s a substitute chord. Any flat-7 chord can be substituted with the other flat-7 that shares the same tri-tone. So reharmonize all the chords you can in this chart. Go.”\n The pace was intense, and I loved it. Finally, someone was challenging me — keeping me in over my head — encouraging and expecting me to pull myself up quickly. I was learning so fast, it felt like the adrenaline rush you get while playing a video game. He tossed every fact at me and made me prove that I got it.\n In our three-hour lesson that morning, he taught me a full semester of Berklee’s harmony courses.\n This was one of the major inspirations for  Be impatient. Every time I reread it, I think of at least one thing where I’m setting myself a speed limit for no reason!\n  Sam Altman,  How To Be Successful. Sam might have observed more successful people more closely than anyone else on the planet, and the advice is as good as you’d expect.\n Almost everyone I’ve ever met would be well-served by spending more time thinking about what to focus on. It is much more important to work on the right thing than it is to work many hours. Most people waste most of their time on stuff that doesn’t matter.\n Once you have figured out what to do, be unstoppable about getting your small handful of priorities accomplished quickly. I have yet to meet a slow-moving person who is very successful.\n  Almost always, the people who say “I am going to keep going until this works, and no matter what the challenges are I’m going to figure them out”, and mean it, go on to succeed. They are persistent long enough to give themselves a chance for luck to go their way.\n &amp;mldr To be willful, you have to be optimistic—hopefully this is a personality trait that can be improved with practice. I have never met a very successful pessimistic person.\n   R. W. Hamming,  You and your research. Hamming observed almost as many great scientists as Sam Altman did founders. He had some interesting conclusions:\n At first I asked what were the important problems in chemistry, then what important problems they were working on, or problems that might lead to important results. One day I asked, “if what they were working on was not important, and was not likely to lead to important things, they why were they working on them?” After that I had to eat with the engineers!\n About four months later, my friend stopped me in the hall and remarked that my question had bothered him. He had spent the summer thinking about the important problems in his area, and while had had not changed his research he thought it was well worth the effort. I thanked him and kept walking. A few weeks later I noticed that he was made head of the department. Many years later he became a member of the National Academy of Engineering. The one person who could hear the question went on to do important things and all the others—so far as I know—did not do anything worth public attention.\n &amp;mldr Some people work with their doors open in clear view of those who pass by, while others carefully protect themselves from interruptions. Those with the door open get less work done each day, but those with their door closed tend not know what to work on, nor are they apt to hear the clues to the missing piece to one of their “list” problems. I cannot prove that the open door produces the open mind, or the other way around. I only can observe the correlation. I suspect that each reinforces the other, that an open door will more likely lead you and important problems than will a closed door.\n  There is another trait that took me many years to notice, and that is the ability to tolerate ambiguity. Most people want to believe what they learn is the truth: there are a few people who doubt everything. If you believe too much then you are not likely to find the essentially new view that transforms a field, and if you doubt too much you will not be able to do much at all. It is a fine balance between believing what you learn and at the same time doubting things. Great steps forward usually involve a change of viewpoint to outside the standard ones in the field.\n While you are leaning things you need to think about them and examine them from many sides. By connecting them in many ways with what you already know&amp;mldr. you can later retrieve them in unusual situations. It took me a long time to realize that each time I learned something I should put “hooks” on it. This is another face of the extra effort, the studying more deeply, the going the extra mile, that seems to be characteristic of great scientists.\n Hamming is an unusual combination of (a) a great scientist himself, (b) curious and thoughtful about what makes others great, and (c) honest and open about his observations (it seems).\n  Anonymous,  Becoming a Magician—on how to become a person that your current self would perceive as magical:\n The description was about five or six handwritten pages long, and at the time, it was a manifestation of desperate longing to be somewhere other than where I was, someone who felt free and cared for. At the time I saw that description as basically an impossibility; my life could never be so amazing in reality.\n Fast forward about seven or ten years and I rediscovered the description when I was moving old notebooks and journals from one dusty storage spot to another. As I read through it, I discovered that 90% of the statements I had made in that description were true (or true in spirit). &amp;mldr It was incredible to me, despite all the changes that had happened in my life since when I wrote the passage, that I had basically become the person whose life I had dreamed of living as a teenager.\n  And then came Sanatan Dinda. An Indian visual artist from Kolkata, he didn’t even make the finals the first year he competed, and the next year he placed second with a style that broke half a dozen of the implicit rules of ‘good artwork’ at the competition. &amp;mldr [T]he third year he came he won the entire competition by something like ten percent of the total awarded points over the next artist in second place.\n &amp;mldr The thing that confused me though was this – I could not work out how he did it. Like, I had zero mental model of how he created that piece in the same timeframe we all had; how he came up with it, designed it, practiced it. Even though he placed first and I placed fifth and logically we both existed on a scale of ‘competence at bodypainting’ it seemed like the skills required were completely different.\n The exercise they suggest is a really useful activity for weekly (or monthly or yearly) reviews. Highly recommended!\n  Dan Luu,  95th percentile isn’t that good. Great for cultivating self-improvement mindset by reminding you how easy (in some sense) it is to make huge improvements at something:\n Reaching 95%-ile isn’t very impressive because it’s not that hard to do. I think this is one of my most ridiculable ideas. It doesn’t help that, when stated nakedly, that sounds elitist. But I think it’s just the opposite: most people can become (relatively) good at most things.\n Note that when I say 95%-ile, I mean 95%-ile among people who participate, not all people (for many activities, just doing it at all makes you 99%-ile or above across all people). I’m also not referring to 95%-ile among people who practice regularly. The “one weird trick” is that, for a lot of activities, being something like 10%-ile among people who practice can make you something like 90%-ile or 99%-ile among people who participate.\n It’s not weekly review material, but I also appreciate the bonus section on Dan’s other most ridiculable ideas.", "posttime": "2022-02-21 04:25:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,生活,essays,时间", "title": "我最喜欢的生活建议散文（2020）", "title_en": "My favorite essays of life advice (2020)", "transed": 1, "url": "https://www.benkuhn.net/weeklyessays/", "via": "", "real_tags": ["2020", "生活", "essays", "时间"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1074362, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们中的许多人，至少在世界上较富裕的地区，都熟悉购买、拥有和丢弃太多东西的感觉。我们可能对此感到有点内疚。我们甚至可能试着做点什么，抛弃塑料吸管，保留一个购物用的手提袋，并努力将回收物分离出来。\n我们也可能意识到这还不够。为了满足我们的物质需求，人类现在每年使用大约1000亿吨的物质。其中90%以上是从地球表面开采、钻探和切割的原始材料。其中只有300亿吨是永久性的。其余的则作为燃料燃烧或快速使用并丢弃——每一阶段都会污染土地、水和空气，造成气候变化的温室气体排放。\n我们能做得更好吗？“循环”经济的概念已经存在了一段时间，在这种经济中，几乎所有的东西都被重新利用，废物并不真正存在。它们通常被视为模糊的乌托邦主义，但就在最近，基调发生了变化。这不仅仅是因为我们刚刚意识到我们对地球的影响之大，以及它给我们带来的麻烦。这也是因为我们越来越有想法和技术，使我们自己和我们的消费模式不仅对地球不那么坏，甚至可能对地球有益。一种更加循环、可持续的方式来满足我们的物质需求当然是可能的。但这只需要彻底重新设想我们的生活方式。", "note_en": "MANY of us, at least in richer parts of the world, are familiar with the feeling of buying, owning and discarding too much stuff. We probably feel a bit guilty about it. We may even have tried to do something about it, ditching the plastic straws, keeping a tote bag for the shopping and diligently separating out the recycling.\n We might also be aware that this isn’t enough. To fulfil our material wants, humanity now uses some 100 billion tonnes of stuff every year. More than 90 per cent of it is virgin material that is mined, drilled and hacked from the planet’s surface. Only 30 billion tonnes of it makes anything of permanence. The rest is burned as fuel or used fleetingly and discarded – at each stage polluting land, water and air and creating climate-changing greenhouse gas emissions.\n Can we do better? Ideas of “circular” economies, in which pretty much everything is reused and waste doesn’t really exist, have been around for a while. They are usually dismissed as woolly utopianism, but just lately the tone has been changing. That isn’t just because of our late-dawning realisation of the scale of our impact on the planet and the trouble it is storing up for us. It is also because we increasingly have the ideas and the technologies to make ourselves and our consumption patterns not just less bad for the planet, but perhaps even beneficial for it. A more circular, sustainable way of satisfying our material wants is certainly possible. But it will require nothing less than a complete reimagining of the way we live our lives.", "posttime": "2022-02-21 04:25:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "终结,grand,地球", "title": "废物的终结：建设真正循环经济的宏伟计划", "title_en": "The end of waste: The grand plan to build a truly circular economy", "transed": 1, "url": "https://www.newscientist.com/article/mg25333730-800-the-end-of-waste-the-grand-plan-to-build-a-truly-circular-economy/", "via": "", "real_tags": ["终结", "grand", "地球"]}]