[{"category": "", "categoryclass": "", "imagename": "bc309b6ce9fc0998eeca2e8f1dc0a083.png", "infoid": 1029741, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能状况报告分析了人工智能领域最有趣的发展。我们的目标是引发一场关于人工智能状态及其对未来的影响的知情对话。该报告由人工智能投资者内森·贝纳奇(Nathan Benaich)和伊恩·霍加斯(Ian Hogarth)制作", "note_en": "The  State of AI Report analyses the most interesting developments in AI. We aim to trigger an informed conversation about the state of AI and its implication for the future. The Report is produced by AI investors   Nathan Benaich  and   Ian Hogarth", "posttime": "2020-10-19 15:17:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,2020,状况,ai", "title": "2020年人工智能状况报告", "title_en": "State of AI Report 2020", "transed": 1, "url": "https://www.stateof.ai/", "via": "", "real_tags": ["人工智能", "2020", "状况", "ai"]}, {"category": "", "categoryclass": "", "imagename": "6f8c66935dc4143b94627a539e022efd.jpeg", "infoid": 1029740, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当经济中的货币和信贷供应增长快于经济产出时，就会发生通货膨胀。这就是今天发生的事情。\n为了减轻债务负担(使他们更容易偿还贷款)，政府受到刺激而使货币供应量膨胀。\n从长远来看，美联储是无能为力的。实体经济增长是维持经济所必需的。打印只是一种短期解决方案。\n注意你的利率：如果你在2020年有现金存在银行，那就是在摧毁财富。\n注意你的收入：如果你在雇主业务中的份额稳定或增长，你应该期待每两年至少5%的加薪。\n有一些非常简单、低能耗的方法可以战胜通胀：考虑硬资产和“美元成本平均法”。\n我们的教育系统中缺少一条重要的信息。对钱有一个明确的定义。\n当我们毕业时，我们被期望走进世界，为我们的雇主赚钱，为我们的经济赚钱，为我们自己赚钱。然而，在此之前，我们中的大多数人都没有学到什么是钱的真正含义。有一个持怀疑态度的案例可以辩称，我们没有被教导有关金钱的知识是有原因的。1957年，亨利·福特(Henry Ford)是有史以来20位最富有的人之一，他说过一句名言：\n“国民不了解我们的银行和货币体系已经足够好了，因为如果他们了解，我相信明天早上之前会有一场革命。”\n通过阅读这篇文章，我希望你能了解什么是钱，它是如何融入我们的经济和银行体系的，并带走一些在动荡的世界中保护你的财富的简单策略。\n归根结底，钱就是信任。相信我们过去花费的时间和精力可以在未来兑换成商品和服务。\n因为我们通常不能随身携带我们的个人商品和服务，所以我们将这一能力委托给政府发行的一张纸。\n我们今天的货币被称为“法定货币”，因为它们不能兑换成任何其他形式的资产。纵观历史，货币花了很多时间与黄金这样的硬资产挂钩，而黄金的通货膨胀率很低。可兑换为硬资产在历史上确保了信任。你有办法摆脱你的货币，进入像黄金这样的东西，由于它的供应增长率一直很低，而且随着时间的推移，黄金在历史上保持了数千年的价值。\n今天没有这样的可兑换，也没有固定的法定货币供应。这是定时炸弹。\n💡美元不受政府、黄金、军队或其他任何东西的支持。它只是得到了公众信任的支持。相信你的邻居会给你和你一样值的一美元。而信任是一件反复无常的事情，特别是当与供应不断增加的资产挂钩时。\n信用仅仅是将来从借款人(债务人)那里收到钱的承诺。它可以被认为是另一种形式的货币。不同的是，信贷的波动性要大得多。它可以在创建、完成或默认事务时瞬间创建和销毁。出于这个原因，我们经济中的信贷比货币多得多。\n只要公众对货币保持信任，并且这种信任的价值不会随着时间的推移而贬值，我们的法定货币就可以正常运作。但当货币供应变化过快时，信任问题就会出现。这在历史上已经发生过很多次了。\n由于各国政府受到刺激来膨胀货币供应量，并使债务更容易偿还，货币的关键“信任”部分有非零的侵蚀可能性。这意味着货币贬值只是个时间问题。\n近代史上有很多货币崩溃的例子，包括德国马克和津巴布韦元。\n美元作为世界储备货币，在全球具有独特的力量。全球贸易和债务的很大一部分是以美元计价的。这给了它比其他法定货币更多的持久力和信任。但这并不是不可战胜的。它仍然面临着同样的风险，按照历史标准衡量，美元可能即将结束其使用寿命。\n💡仅在2020年，美国的货币供应量就增加了25%。这意味着全球流通的美元比一年前多了25%。你们在全球美元总额中的份额刚刚减少了20%。\n如果金钱就是信任，那我们信任什么呢？我们相信一美元可以维持购买力。购买力是指当你花掉每一美元时，你可以买到的东西。\n通货膨胀意味着你的购买力在下降，因为商品和服务变得更加昂贵，你不能用同样的余额购买同样多的东西。通货紧缩是商品和服务的降价，意味着你的购买力在增强。\n从历史上看，通货紧缩很少发生。它通常不经常发生，在长期债务周期结束或货币崩溃后，大约每100年发生一次。\n但通胀几乎每时每刻都在发生。它给政府提供了一个经济杠杆。我们生活在平均长期通货膨胀率每年3%左右的情况下。\n💡自1950年以来，由于通货膨胀，美元已经失去了90%的购买力。购买力每年下降约3%。在今天零利率的情况下，银行现金每年购买的商品和服务将减少3%。\n通货膨胀通常使用消费者物价指数(CPI)来衡量。CPI衡量的是消费者为一篮子商品和服务支付的价格在一段时间内的平均变化。虽然CPI擅长在短期内衡量通胀对日常支出的影响，但它没有捕捉到“总通胀”的影响--通胀对整个经济的影响。\n在撰写本文时，股票市场(标准普尔500指数)同比上涨了16%。这就是通货膨胀。毫无疑问，2020年美国的经济产出下降了近10%。虽然这两者没有一对一的联系，但廉价资金正被用来抬高金融资产。\n通货膨胀，即购买力的损失，当总货币供应量的增长速度快于在该货币下生产的商品和服务时，就会发生通货膨胀：\n总通货膨胀模型代表整个经济的通货膨胀，包括股票和债券等金融资产。2020年，总通货膨胀率正在上升。\n当美国联邦储备银行(“美联储”)“印钞票”时增加货币。印刷有多种形式，包括增加流通美元数量的行动。这些美元只不过是央行数据库条目和资产购买计划(“量化宽松”)，比如美联储今年买进公司债的时候.。\n在美联储降息时增加信贷，这会压低借贷成本，并激励创造更多的债务(信贷)。\n国民生产总值(GNP)下降当失业率上升、税收增加、关税增加或政府就业计划结束时，导致GNP下降。如果减少国民生产总值，不要低估恐惧的力量。即使没有什么改变，如果人们担心经济衰退、损失、失业或其他经济危机，他们也会减少支出，减少对他人的投资。所有这些都降低了货币的流通速度，压低了GNP。从历史上看，国民生产总值通常会随着时间的推移而增长，这是由于人口增长(约为每年1%)。在美国)，以及从技术进步和综合人类知识中普遍提高的生产力。\n通货膨胀会产生涓滴效应。美联储的印钞行动通常会导致资本直接部署到金融资产中，从而在短期内推高股市价格。这些资本慢慢渗透到日常商品和服务中，然后可以在CPI中看到。\n💡当经济体中有更多的货币和信贷可用，对于相同数量的商品和服务，货币和信贷供应者增加支出会推高需求，导致商品和服务价格上涨，从而推动通货膨胀。\n从历史上看，美联储的目标通胀率是2%。最近，这一目标已经放松，以允许通胀进一步上升。\n2%的通货膨胀率足够低，不会在短期内损害人们的购买力，因为它的日常影响几乎没有人注意到。只有当你回顾几十年的时候，通货膨胀的影响才会变得显而易见。就像20世纪70年代麦当劳芝士汉堡的低价一样：\n但为什么要设定2%的通胀率目标呢？美联储声称，这是为了允许“衡量偏差”、“降息空间”和“避免通缩”。这些理由并不是全部。\n如果工资和收入随着时间的推移普遍上涨，那么一定程度的通胀可能会带来心理上的好处，这会给人们和经济带来一种事情正在进步的感觉，他们正在“走向某个地方”。心理影响经济，这就是积极心态的力量。\n通货膨胀允许债务负担随着时间的推移而减轻，如果债务的购买力随着时间的推移而减弱，今天取出的债务在未来变得更容易偿还。\n通货膨胀会刺激消费如果你的钱随着时间的推移而失去购买力，你宁愿把它投入工作，试图赚取回报率。这些重新投入经济的投资应该会帮助经济随着时间的推移而增长。这是政府设定一定通胀目标的另一个关键原因。美联储还有一个目标，那就是确保“市场稳定”。正是由于这些原因，你经常会看到在股市极端波动时期(如2020年的科罗纳崩盘)印钞最多，因为它们试图刺激支出，支撑市场。\n警告你。这个看似很小的2-3%的年通货膨胀率，再加上一代人(30年)的累积，将使银行余额的购买力降低45%。因此，如果你想保持财富的购买力，就不要让它以法定货币存在。不要把它放在银行里。\n💡关注你的收入增长率。你的收入增长至少要跟上通货膨胀率(每年2-3%)。为了让你保持现有的购买力。如果你在过去两年里没有加薪，如果你在雇主总收入中的份额没有变化，你今年应该至少会加薪4%。但是，如果你要为整个公司增加更多的价值，你应该至少加薪5%。如果你不明白这一点，别搞错了，你受到了不公平的对待--也许是时候四处看看了。\n美联储印制和调整利率的能力给了它一种错误的安全感。他们有很多杠杆可以在短期内发挥作用。但这些行动总是会达到极限。通常每100年一次，债务负担变得过重，需要重新设置。这样的时期通常与主要股市的顶峰和崩盘不谋而合。许多著名的经济学家认为，我们现在正处于那个顶峰阶段。\n市场周期，经济和股票市场的大起大落只是围绕GNP生产率上升趋势的波动，周期意味着回到GNP趋势。美联储已经证明，他们无法阻止这些周期。在过去的50年里，美联储在预测和防止经济衰退方面一直效率低下。他们的行动通常为时已晚，而且他们经常在市场触顶之前收紧政策，往往会引发向下的连锁效应。是的-美联储已经引发了一系列衰退的开始。\n膨胀货币供应量只会推迟不可避免的情况。市场将会崩溃。市场周期总是会发生，通胀可能会增加市场崩盘的波动性和深度。虽然刺激(印钞)看起来很容易解决，但泡沫越大，破灭的难度就越大。\n当美联储降息时，它会激励银行发放更多贷款，这会导致信用价值较低的个人和实体获得信贷，这会增加风险，随着时间的推移，会导致更多的违约(想想2008年)。最终结果是无法停止的。\n人类是情绪化的。有时我们贪婪，有时我们害怕。我们把事情推到极限是有偏见的。贪婪导致杠杆拉得太紧，最终导致泡沫增长到经济产出无法维持的地步。\n2020年就是一个完美的例子。2018年，美联储收紧政策，我们看到了强烈的警告信号，股市回调了20%。2019年，一个近乎完美的衰退预警信号--“收益率曲线倒置”--预示着经济衰退即将到来，预计将在6-12个月内出现。市场做好了暴跌的准备。美联储的紧缩行动设定了这一指控。所有这一切都发生在任何病毒被识别之前。最后，冠状病毒是匹配的。\n一旦危机开始，美联储的印钞权力在短期内确实会有所帮助。2020年初，市场崩盘的速度和力度比我们以前见过的都要快。美联储做出了回应，出人意料的印钞数量令人难以置信，直接涌入股市。尽管经济停滞不前，股市还是咆哮着恢复了活力。\n虽然美联储在逐日和逐月层面上的力量是巨大的，但在推动经济从一年到一年和从十年到十年的层面上，美联储实际上是无能为力的。长期生产率继续增长，市场周期不变。\n💡在短期内美联储是强大的，从长期来看它是无能为力的。你无法逃脱实质经济增长的需要！在你的一生中，美联储对你创造和储存财富的能力的影响微乎其微，前提是你不把你的财富放在通胀的资产中，比如美元。\n我们知道通货膨胀会持续下去。我们知道，美联储有动机使用它，即使它没有长期利益。关键是要了解你不应该做什么来保存你的财富。当银行存款利率低于通胀时，就像今天一样，把钱留在银行是没有意义的。\n包括沃伦·巴菲特(Warren Buffet)在内的一些最优秀的投资者推荐的一种简单方法是简单地买入并持有一个股票指数。从历史上看，这将是每年7-8%的回报率。从长期来看，远远高于通胀，远远高于大多数付费基金的表现。99%的基金未能跑赢大盘。但你必须为挥杆做好准备。如果你在市场恐慌中抛售，这种策略不会奏效，如果你在泡沫顶端买入，这种策略也不会奏效。如果你买入，准备好持有5年、10年、15年以上，看看这些回报。\n另一种方法是投资于硬资产。黄金和比特币是两种供应有限、通胀率已知的资产，它们的供应不能被操纵。从历史上看，硬资产在充满挑战的经济时期表现得特别好。有理由在2020年至少将我们的投资组合中的一部分配置到硬资产上，以对冲通胀。\n另一个将情绪从这个过程中剔除的好方法是“美元成本平均数”(Dollar Cost Average)。只需将固定百分比的月薪直接部署到索引或硬资产中即可。摆好就忘了。遵循这个过程，直到退休，你会比大多数人做得更好。例如，如果从2017年比特币峰值到今天(2020年10月15日)，在过去3年中，您每周平均将美元成本转换为比特币，即使比特币比顶部下降了40%以上，您的年回报率也会超过30%！\n这些是一些简单、有效和低能耗的方法，可以保护你的资本，并在未来保持你的购买力。\n你能做的最好的事情就是继续学习，掌握你的财富和未来。\n💡如果得不到至少2%，你就是在损失财富。如果你的投资，包括你的银行存款，至少没有通货膨胀率增长得那么快，你的购买力就会随着时间的推移而下降。把你的钱用起来。从历史上看，采用非情绪化的长期策略的表现优于大多数基金经理。\n本文中的材料仅供教育和讨论之用，并不构成投资建议。其中包含的意见和预测是截至发布日期提供的，可能被证明是不准确的，如有更改，恕不另行通知。没有建议投资于任何资产。过去的表现并不能保证将来的结果。", "note_en": "Inflation happens when the supply of money and credit in the economy grows faster than economic output. This is happening today.\n The government is incentivised to inflate the money supply to reduce debt burdens (make it easier for them to pay loans back).\n In the long-run the Federal Reserve is powerless. Real economic growth is necessary to maintain an economy. Printing is a short-term solution only.\n Watch your interest rates: if you have cash sitting in the bank in 2020, it is wealth destroying.\n Watch your income: if your share of your employer’s business is stable or growing, you should expect a minimum 5% pay rise every 2 years.\n There are some very simple, low energy ways to beat inflation: consider hard assets and “dollar cost averaging”.\n  A critical piece of information is missing from our education system. A clear definition of money.\n When we graduate, we are expected to go into the world and work to grow money for our employer, money for our economy and money for ourselves. Yet up until that point, most of us were taught nothing about what money really is. There is a sceptical case to argue that there is a reason we are not taught about money. In 1957 Henry Ford, one of the 20 richest people of all time, is famous for saying:\n “It is well enough that people of the nation do not understand our banking and monetary system, for if they did, I believe there would be a revolution before tomorrow morning.”\n By reading this article, I hope that you will gain an understanding for what money is, how it fits into our economy and banking system and take away some simple strategies to protect your wealth in a volatile world.\n  When boiled down, money is simply trust. Trust that our time and effort, expended in the past, can be redeemed for goods and services in the future.\n Because we can’t normally carry around our personal goods and services, we entrust this capability into a government issued piece of paper.\n Our currencies today are called “fiat currencies” because they have no convertibility into any other form of asset. Through history, money has spent much of its time linked to a hard asset like gold which has a known and low inflation rate. Convertibility to a hard asset historically ensured trust. You had a way out of your currency and into something like gold which has historically maintained value for millennia, due to its low and consistent supply growth rate through time.\n Today there is no such convertibility, and there is no fixed supply of fiat currency. This is ticking time bomb.\n 💡A dollar is not backed by the government, gold, army, or anything else.  It is simply backed by public trust. Trust that your neighbour will give a dollar the same worth as you. And trust is a fickle thing, particularly when pegged to an asset with increasing supply.\n  Credit is simply a promise to receive money from a borrower (debtor) in the future. It can be considered another form of money. The difference is credit is much more volatile. It can be created and destroyed in an instant when a transaction is created, completed or defaulted on. For this reason, there is a lot more credit in our economy than there is money.\n  Our fiat currencies work fine as long as public trust is maintained in the money and as long as the value of that trust does not erode over time. But when the money supply changes too quickly, trust problems arise. This has happened many times through history.\n Because governments are incentivised to inflate the money supply and make debt easier to pay back, the critical “trust” component of the money has a non-zero probability of erosion. That means it’s just a matter of time until the currency fails.\n There are  many examples of currency collapses in recent history, including the German Mark and Zimbabwe Dollar.\n As a world reserve currency, the US Dollar has a unique power globally. A significant portions of global trade and debt is denominated in the US Dollar. This gives it a lot more staying power and trust than other fiat currencies. But it is not invincible. It is still subject to the same risks and by historic measures the US Dollar may be nearing the end of its useful life.\n  💡 In 2020 alone, the money supply in the US has increased by 25%.  This means that there are 25% more dollars circulating the world than a year ago. Your share of the total dollars in the world has just reduced by 20%.\n  If money is trust, what are we trusting? We are trusting that a dollar maintains purchasing power. Purchasing Power is what you can buy for each of your dollars when you spend them.\n Inflation means your purchasing power is reducing, because goods and services get more expensive and you can’t buy as much with the same balance. Deflation is the cheapening of goods and services, meaning your purchasing power is increasing.\n Historically, deflation rarely occurs. It typically takes place infrequently and at the end of long-term debt cycles or after monetary collapse, this happens roughly once every 100 years.\n But inflation is happening almost all the time. It gives governments an economic lever. We live with an average long-term inflation rate of around 3% p.a.\n  💡   Since 1950, the dollar has lost 90% of its purchasing power as a result of inflation.  Purchasing Power has reduced around 3% a year. With zero interest rates today, cash in the bank will buy 3% less goods and services every year.\n  Inflation is often measured using the Consumer Price Index (CPI). CPI measures the average change in prices over time that consumers pay for a basket of goods and services. While CPI is good at measuring the impact of inflation on daily spending in the short-term, it does not capture the impact of “total inflation” - the economy wide impact of inflation.\n  As of writing, the stock market (S&amp;P500) is up 16% year-on-year. This is inflation. Make no mistake, the economic output of the US is down near 10% in 2020. While these two are not linked 1-to-1, the cheap money is being used to bid up financial assets.\n Inflation, the loss of purchasing power, happens when the total money supply increases at a faster rate than the goods and services produced under that currency:\n  The Total Inflation Model represents inflation across the entire economy, including financial assets like stocks and bonds. In 2020, total inflation is rising.\n  Increasing money When the US Federal Reserve Bank (the “Fed”) “prints money”. Printing takes many forms and encompasses actions which increases the amount of circulating dollars. These dollars are simply central bank database entries and asset-purchase programs (“quantitative easing”), such as  when the Fed bought up corporate bonds this year.\n Increasing credit When the Fed cuts interest rates, which drive down the cost of borrowing, and incentivize more debt (credit) to be created.\n Decreasing Gross National Product (GNP) When unemployment rises, tax increases, tariffs are created or government employment programs are wound down, causing GNP to decrease. Don’t underestimate the power of fear if reducing GNP also. Even if nothing changes, if people fear recession, loss, unemployment or other economic crisis, they will spend less and invest in others less. All of which reduces the velocity of money and drives down GNP. Historically, GNP typically grows over time due to population growth (which is about 1% p.a. in the US) and generally rising productivity from advances in technology and combined human knowledge.\n There is a trickle-down effect with inflation. The money printing actions of the Fed typically results in capital being deployed straight into financial assets, driving up stock market prices in the short-term. That capital slowly trickles down into everyday goods and services and can then be seen in CPI.\n 💡 When there is more money and credit available in an economy, for the same amount of goods and services, increasing spending by those with the money and credit supply drives up demand, and results in increases prices of goods and services; thus driving inflation.\n  Historically, the Fed targets a 2% inflation rate. More  recently, this target has been relaxed to allow inflation to run even  higher.\n A 2% inflation rate is low enough that it doesn’t hurt people’s purchasing power in the short-term, as its day-to-day effects go mostly unnoticed. It is only when you look back over periods of decades that the effects of inflation become blatantly obvious. Like the low price of a McDonald’s Cheeseburger in the 1970s:\n  But why target 2% inflation at all? The  Fed claims it is to allow for “ measurement bias”, “ room to cut interest rates” and to “ avoid deflation”. These justifications are not the full story.\n  There may be a psychological benefit to some inflation If salaries and incomes are generally rising over time, it gives people and economies a sense that things are progressing and they are “going somewhere”. Psychology impacts economies, this is the power of the positive mindset.\n Inflation allows debt burdens to reduce over time Debt taken out today, becomes easier to pay back in the future if the purchasing power of that debt weakens over time.\n Inflation incentivizes spending If your money is losing purchasing power over time you rather put it to work to try and earn a rate of return. This investment back into the economy should help the economy grow over time. It is another key reason Governments target some inflation. The Fed also has a goal of ensuring  “a stable market”. It is for these reasons you often see the most money printing during times of extreme stock market volatility, such as the Corona crash in 2020, as they attempt to incentive spending and prop markets up.\n Be warned. This seemingly small number of 2–3% inflation per year, compounded over a generation (30 years), will reduce a bank balance’s purchasing power by 45%. So if you want to preserve the purchasing power of your wealth, do not leave it in fiat currencies. Do not leave it in the bank.\n   💡   Keep an eye on your income growth rate.  Your income needs to grow at least as fast as the rate of inflation (2–3% p.a.) in order for you to maintain your existing purchasing power. If you haven’t had a salary raise in the last two years, you should be expecting at least 4% raise this year if your share of your employer’s total revenue hasn’t changed. But if you are adding more value to your company as a whole, you should be after a minimum 5% raise. If you are not getting this, make no mistake, you are not being treated fairly — it may be time to look around.\n  The ability for the Fed to print and change interest rates gives it a false sense of security. They have a lot of levers to pull in the short-term. But these actions always reach a limit. It is usually once every 100 years that the debt burden becomes too much and a reset is required. Such periods usually coincide with major stock market tops and crashes. A number of renown economists think we are in that peaking phase  now.\n Market cycles, and the booms-and-busts of the economy and stock market are simply fluctuations around an upward productivity trend in GNP, the cycles mean revert back to the GNP trend. The Fed has proven they cannot stop these cycles. The Fed has been ineffective at predicting and preventing recessions in the last 50 years. Their actions are usually too late, and they frequently tighten immediately before a market top, often triggering a cascading effect downwards itself. Yes — the Fed has triggered the start of a number of recessions.\n  Inflating the money supply just delays the inevitable. Markets will crash. Market cycles will always occur and inflation potentially increases the volatility and depth of market crashes. While stimulus (money printing) may seem like an easy fix, the bigger the bubble grows, the harder it comes crashing down.\n When the Fed cuts interest rates, it incentivises banks to issue more loans, this results in less credit worthy people and entities receiving credit, which increases risk and, with time, results in more defaults (think 2008). The end result cannot be stopped.\n Humans are emotional. Sometimes we are greedy, sometimes we are fearful. We are biased to push things to the limit. Greed causes levers to be pulled too hard and ultimately grows bubble to the point where they cannot be sustained by economic output.\n  2020 is the perfect example. In 2018, the Fed tightened and we saw strong warning signs with a 20% stock market correction. In 2019 a near perfect recession warning flag, the “yield curve inversion”, signified a recession was on the horizon and expected within 6–12 months. The market was primed to pop. Fed tightening actions set the charge. All of this happened before any virus was identified. Finally, the Coronavirus was the match.\n Once a crisis begins, the power of the Fed to print does help in the short-term. In early 2020, the market crashed faster and harder than we have ever seen before. The Fed responded, with incredible and unforeseen amounts of money printing, which flooded straight back into the stock market. Despite a standstill economy, stocks roared back to life.\n  While the power of the Fed is huge on a day-to-day and month-to-month level, the Fed is actually powerless at driving the economy over the year-to-year and decade-to-decade level . Long-term productivity growth continues, and market cycles stay.\n 💡   In the short-term the Fed is powerful, in the long-term it is powerless. You can’t escape the need for real economic growth!  Over the course of your life, the Fed will have negligible impact on your ability to generate and store wealth, provided you do not keep your wealth in an inflating asset, like the US dollar.\n  We know that inflation is here to stay. We know that the Fed is incentivized to use it, even if it has no long-term benefit. The key is to understand what you should not do to preserve your wealth. When bank deposit interest rates are less than inflation, as they are today, it does not make sense to leave your money in the bank.\n  A simple approach recommended by some of the best investors, including Warren Buffet, is to simply buy and hold an index of stocks. Historically this would have returned 7–8% p.a. in the long run, well above inflation and well above the majority of paid fund performance.  99% of funds fail to outperform. But you have to be prepared for the swings. This strategy will not work if you sell in the midst of market panic, and it will not work if you buy at the top of a bubble. If you buy, be prepared to hold for 5, 10, 15 years plus to see these returns.\n Another approach is to invest in a hard asset. Gold and Bitcoin are two assets with limited supply and known inflation rates which cannot have their supply manipulated. Hard assets have historically performed particularly well in challenging economic times. There is a case to be made to allocate at least some of our portfolio to hard assets in 2020 as an inflation hedge.\n Another great way to take the emotion out of the process is to “Dollar Cost Average”. Simply deploy a fixed percentage of your monthly pay check straight into an index, or a hard asset. Set and forget. Follow this process through to retirement and you will do better than most. For example, if you had dollar cost averaged into Bitcoin every week over the last 3 years starting at the Bitcoin peak in 2017 and continuing to today (15 October 2020), you  would have returned over 30% per year even though Bitcoin is down over 40% from the top!\n These are some simple, effective and low energy ways to protect your capital and maintain your purchasing power into the future.\n The best thing you can do is continue the learning and take control of your wealth and your future.\n 💡   If not getting at least 2%, you are losing wealth.  If your investments, including your bank deposits, are not growing at least as fast as the inflation rate, your purchasing power is reducing with time. Put your money to work. Employing non-emotional, long-term strategies has historically outperformed most money managers.\n The materials in this article are for education and discussion purposes only and do not constitute investment advice. Opinions and projections included are provided as of the date of publication, may prove to be inaccurate, and are subject to change without notice. No recommendations are made to invest in any asset. Past performance is no guarantee of future results.", "posttime": "2020-10-19 15:16:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "money,货币", "title": "钱是什么？", "title_en": "What Is Money?", "transed": 1, "url": "https://medium.com/capriole/what-is-money-8ddcff0788f4", "via": "", "real_tags": ["money", "货币"]}, {"category": "", "categoryclass": "", "imagename": "40113f60dc6e699d842ea0196a8e28af.jpeg", "infoid": 1029739, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卡夫卡一号说：“没有写作的作家是一个追求疯狂的怪物。”我说所有的作家都是混蛋，但并不是所有的混蛋都是作家。所以当个会写字的混蛋总比不会写的混蛋要好。\n在我自己的生活中，我经常危险地转向成为一个混蛋。所以为了写作的利益，你知道，这里有一些来之不易的写作建议，可以帮助我们两个人走上正确的道路。\n他说，有三种方法可以学习如何写作--多读，多写，当所有这些都失败的时候，让其他作家喝得酩酊大醉。\n当我说欧文·威尔士告诉我如何写作时，我真正的意思是我在一次读书会上听到他这么说。\n你通过写得好和写得不好学到了一样多的写作。\n你推出来的每一块垃圾都会让你离你想要的金砖更近一点。\n关于写作，你需要知道的一切都可以用这三句语录来概括。\n杰克·凯鲁亚克说：“你一直都是个天才。”欧内斯特·海明威说：“所有东西的初稿都是狗屎。”他们都是对的。\n正如艾伦·金斯伯格(Allen Ginsberg)所说，“第一个想法，最好的想法”。但是你还是要做这项工作。\n你必须写作才能克服成为作家的最大绊脚石。\n不是你的家庭作业，不是你的家务，不是你的责任。你。或者，更准确地说，是你的恐惧。\n把你自己分成三个人，给他们分配工作：一个写，一个修改，一个编辑。\n写垃圾是可以的，但你不能擦拭垃圾。\n如果你是一名作家，这些话是你赖以生存的准则。或者一只猴子。你身上有屎。\n作为一个粗略的经验法则，你写的每一件事都是糟糕的，直到它不是。尽你最大的努力，然后继续前进。但首先要确保你已经尽了最大努力。\n写垃圾是可以的，但你不能擦拭垃圾。\n“我写情书，是为了写，不是因为我爱。”--古斯塔夫·福楼拜。\n如果他们不读你的话，没有人会死--除非你以写标语为生，比如：“当心狮子。”\n如果你写什么并不重要，那么你可以自由地写出对你来说最重要的东西。\n每一条建议的写作都会对你有所帮助，或者不会，但永远不会比写作本身更有帮助。\n认清自己是一个作家，一个写作和创造的人，一个创造者，而不是一个消费者。\n“如果你想成为一名音乐会钢琴家，那就每天都去做。如果你想成为一名作家，那就每天都去做吧。你想变得抑郁，那就每天想一些令人沮丧的想法。如果你想成为一个乐观主义者，每天都要想一个愉快的想法。每天都这样做。“。\n作为一名作家和写作是有自由的。它正在履行你的功能。我曾经认为自由意味着做任何你想做的事。它意味着知道你是谁，知道你应该在这个地球上做什么，并且简单地去做。--娜塔莉·戈德堡。\n“这不是天才，只是如果你想从某件事中走出一些好东西，你必须付出很大的努力。这需要大量的艰苦工作，有时还需要大量的鲜血、汗水和泪水。对任何事情都没有不同，对我们所有人做的都没有不同。“--小休伯特·塞尔比(Hubert Selby Jr.)\n先写下来，然后研究你需要填补空白的部分。\n如果你为你的书制定了完美的计划，你就会失去写完实际书所需的杂乱无章的草稿的欲望。\n如果它不属于故事，那么它就不是一个伟大的台词，无论它有多好。\n但是把它们写得好像你只被允许写三本没用的吸血鬼小说一样。\n那样的话，你就会把你所有关于吸血鬼的垃圾想法都塞进这三本书里。\n你打破阻力就像打破石头一样--用很多小的、重复的尝试和偶尔的大打击。\n我小的时候，我们必须上游戏课。我讨厌游戏，但我是一名天生的短跑运动员。正因为如此，他们让我也跳过了栏。\n首先，我根本跳不过栏。我不知道怎么-我只是跑得很快就把他们撞倒了。\n所以他们把它放在地板上的栏杆上，让我跳过去。\n每次我跳过所有的栏目，他们都会把它们提高一个档次，直到最后它们达到正确的高度--而我仍然能够跳过它们。\n在写作中，你需要把“质量”的障碍放在地板上，而不是把重点放在数量上。\n在恐惧中继续奔跑--一次稍微提高你的跨栏，直到它们很容易以最高的高度跳过去。\n写小说与自我表现无关，而完全与讲故事有关。\n不要用你的想法和感觉让读者感到厌烦。抓住他们的喉咙，给他们讲个故事。\n一个有外国口音的漂亮女孩在利兹火车站拦住了我，抓住了我的胳膊。\n虽然这不是她的意思--带着痛苦写作是什么意思？把痛苦变成语言。\n你用什么痛苦来写作？即使你不能对自己诚实，也要对页面诚实。\n创意炼金术。你不能把铅变成黄金，但你可以把屎变成钱。\n心理剧。把它写下来，让它发生。或者反之亦然。正如艾伦·金斯伯格所说，“呼吸，然后写出来”。\n这也让我想起了保罗·奥斯特(Paul Auster)关于他为什么总是带着铅笔的轶事：因为在他小时候最需要的一次，他没有铅笔，错过了获得童年英雄威利·梅斯(Willie Mays)签名的机会。\n在杂志出版方面，你必须尽快让东西“适合印刷”。\n把你写的任何东西都当作占位符文本--只要把一些东西写在纸上就行了。\n细节，或者任何你不确定的东西，都只是Tk(编辑的意思是“来吧”)。\n不是很好，但至少我没有用完-", "note_en": "Kafka one said that “A non-writing writer is a monster courting insanity.” I say that all writers are assholes but not all assholes are writers. So it’s better to be an asshole who writes than an asshole who doesn’t.\n In my own life I often veer dangerously close to just being an asshole. So in the interests of, you know, actually writing — here’s some hard-won writing advice to help keep both of us on the right track.\n   He said that there are three ways to learn how to write — read a lot, write a lot, and when all else fails get other writers drunk.\n When I say Irvine Welsh told me how to write all I really mean is that I heard him say it at a book reading.\n    You learn to write as much by writing well as you do by writing badly.\n Every piece of crap you push out gets you a little closer to the gold bricks you want.\n     Everything you need to know about writing can be summed up by these three writing quotes.\n Jack Kerouac said: “You are a genius all of the time.” Ernest Hemingway said: “The first draft of everything is shit.” They’re both right.\n  “First Thought, Best Thought” as Allen Ginsberg said. But you still have to do the work.\n You have to write to overcome the biggest stumbling block to you being a writer.\n Not your homework, not your chores, not your responsibilities. You. Or, more accurately, your fear.\n   Split yourself into three people and give them jobs to do: The one who writes, the one who revises and the one who edits.\n It’s ok to write crap — but you can’t polish a turd\n     These are words to live by if you’re a writer. Or a monkey. And you have shit.\n  As a rough rule-of-thumb everything you write is bad until it isn’t. Do your best and then move on. But first make sure that you’ve done your best.\n    It’s ok to write crap — but you can’t polish a turd.\n  “I write a love letter, to write, and not because I love.” — Gustave Flaubert\n   Nobody is going to die if they don’t read your words — unless you write signs for a living like: ‘Beware of the lion.’\n  If it doesn’t matter what you write then you’re free to write what matters most to you.\n     Every scrap of writing advice will help you, or not, but never so much as writing itself.\n     Identify as a writer, as one who writes and creates, as a creator not a consumer.\n     “If you want to become a concert pianist, do it every day. You want to be a writer, do it every day. You want to become depressed, think depressing thoughts every day. You want to become an optimist, think a cheerful thought every day. Do it every day.”\n   There is freedom in being a writer and writing. It is fulfilling your function. I used to think freedom meant doing whatever you want. It means knowing who you are, what you are meant to be doing on this earth, and simply doing it. — Natalie Goldberg\n         “It’s not genius, it’s just that if you want something good to come out of something, you have to put in a lot of effort. That involves a lot of hard work, and a lot of blood, sweat and tears sometimes. No different to anything, no different to what we all do.” — Hubert Selby Jr\n      Write it first, then research the bits that you need to fill in the gaps.\n  If you make the perfect plan for your book, you’ll lose all desire to write the messy drafts required to finish the actual book.\n      If it doesn’t belong in the story, then it’s not a great line, no matter how good it is.\n        But write them as though you’re only allowed to write three trashy vampire novels.\n That way, you’ll shove every trashy idea you’ve ever had about vampires into those three books.\n    You break resistance like you break rocks — with lots of small, repeated attempts and the occasional big hit.\n      When I was little we had to do games lessons. I hated games but I was a natural sprinter. Because of this they made me jump the hurdles too.\n To begin with I couldn’t jump over the hurdles at all. I didn’t know how to — I’d just run at them really fast and knock them over.\n So they set it up with the hurdles on the floor and told me to jump over them.\n    Each time I jumped all the hurdles they raised them one notch until eventually they were at the correct height — and I was still able to jump them.\n In writing you need to put the hurdle of ‘quality’ on the floor and focus on quantity instead.\n Just keep running at your fears — raise your hurdles, a little bit at a time, until they’re easy to jump over at full height.\n  Writing fiction has got nothing to do with self-expression and everything to do with telling a story.\n  Don’t bore the reader with your thoughts and feelings. Grab them by the throat and tell them a story.\n    A pretty girl with a foreign accent stopped me in Leeds train station and held onto my arm.\n        Although it’s not what she meant — what does it mean to write with a pain? To turn pain into words.\n What pain do you write with? Be honest with the page even if you can’t be honest with yourself.\n Creative Alchemy. You can’t turn lead into gold but you can turn shit into money.\n Psychodrama. Write it down and make it happen. Or vice versa. “Breathe it, then write it” as Allen Ginsberg said.\n It also reminded me of Paul Auster’s anecdote about why he always carries a pencil: because the one time he needed it most, as a child, he didn’t have a pencil and missed the opportunity to get the autograph of his childhood hero Willie Mays.\n   In magazine publishing you have to get things ‘fit to print’ as soon as possible.\n  Think of whatever you write as placeholder text — just get something down on paper.\n  Details, or anything you’re unsure about, are just TK (editing speak for ‘to come’).\n     It’s not great, but at least I didn’t run out of ti —", "posttime": "2020-10-19 15:16:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作家,assholes,写作", "title": "所有的作家都是混蛋，但并不是所有的混蛋都是作家", "title_en": "All writers are assholes but not all assholes are writers", "transed": 1, "url": "https://medium.com/writers-guild/all-writers-are-assholes-but-not-all-assholes-are-writers-a623ecefa9b6", "via": "", "real_tags": ["作家", "assholes", "写作"]}, {"category": "", "categoryclass": "", "imagename": "83562d04730a05aa3601df0efcf6cb11.jpeg", "infoid": 1029736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "#设置gcloud CLI-用途：GoogleCloudPlatform/github-actions/setup-gcloud@master，带：Version：&#39；314.0.0&#39；Service_account_key：${Secrets.service_account_key}}service_account_email：${{Secrets.service_account_email}}project_id：${Secrets.project_id}}export_default_credentials：true-run：gcloud info-name：create Google Cloud Dataproc cluster use：vishnudxb/gcloud-dataproc-create@main with：cluster：&#34；region：&#34；your dataproc luster region&#34；项目：&#34；您的gcloud项目id&#34；初始化操作：&#34；gs：//&lt；您的存储桶&gt；/&lt；initialization-script.sh&&gt;lt；&#34；master-boot-disk-size：&#34；500 GB&#34；master-boot-disk-type：&#34；pd-Standard&#34；master-Machine-type：&#34；n1-Standard-2&#34；max-IDLE：&#34；1H&#34；Num-master：1 worker-boot-disk-size：&#34；500 GB&#34；worker-boot-disk-type：&#34；pd-Standard&#34；worker-Machines-type：&#34；n1-Standard-2&#34；zone：&#34；us-east1-b&#34；image-version：&#34；review-ubuntu18&#34；METADATA：&#34；PIP_Packages=$(sed-e&#39；/^#/d&#39；-e&#39；s/#.*$//&#39；-e&#39；s/*$//g&#39；Requirements.txt|TR&#39；\\n&#39；&#39；)&#34；范围：&#34；https://www.googleapis.com/auth/cloud-platform&#34；Num-Worker：2属性：&#34；Spark：partk.Scheduler.mode=FIFO&#34；标签：&#34；service=web-app，env=dev&#34；\n输入：cluster：description：&#39；输入您的gcloud dataproc群集名称&#39；必需：true region：description：&#39；输入您的gcloud dataproc群集区域&#39；必需：false default：US-East1 project：description：&#39；输入您的gcloud项目id&#39；必需：true initialization_action：description：&#39；可执行文件或脚本将在群集设置后立即在您的群集中的所有节点上运行。必需：true master-boot-disk-size：描述：&#39；Dataproc主引导盘大小&#39；必需：FALSE默认值：500 GB主引导盘类型：描述：&#39；Dataproc主引导盘类型&#39；必填：FALSE DEFAULT：PD-STANDARD MASTAND-MACHINE-TYPE：描述：&#39；Dataproc主机器类型&#39；必填：FALSE默认值：N1-STANDARD-2 max-IDLE：描述：&#39；群集之前的持续时间在最后一个作业完成后自动删除，例如&#34；2h&#34；或&#34；1d&#34；。&#39；必填：FALSE默认值：&#39；1h&#39；num-master：描述：&#39；群集中的主节点数量。&#39；必需：FALSE DEFAULT：1 Worker-Boot-Disk-Size：Description：&#39；Dataproc Worker Boot Disk Size&#39；Required：False Default：500 GB Worker-Boot-Disk-type：Description：&#39；Dataproc Worker Boot Disk type&#39；Required：False Default：PD-Standard Worker-Machine-type：Description：&#39；Dataproc Worker Machine type&#39；必填：False Default：N1-Standard-2 zone：Description：&#39；DataProc群集区域&#39；必需：FALSE默认值：us-east1-b image-version：描述：&#39；要用于群集的映像版本。&#39；REQUIRED：FALSE DEFAULT：PREVIEW-ubuntu18 METADATA：DESCRIPTION：&#39；要提供给实例上运行的来宾操作系统的元数据&#39；REQUIRED：TRUE Scope：DESCRIPTION：&#39；指定节点实例的作用域。&#39；必需：FALSE默认值：https://www.googleapis.com/auth/cloud-platform Num-Worker：描述：&#39；群集中的工作节点数。&#39；必需：false default：2 properties：description：&#39；指定已安装软件包的配置属性，如Hadoop和Spark。&#39；必需：真标签：描述：&#39；标签键列表=要添加的值对。&#39；必需：FALSE。\n在测试之后，您可以通过运行以下操作来删除您创建的dataproc集群。\n-名称：删除Google Cloud DataProc集群使用：vishnudxb/gcloud-dataproc-delete@main with：cluster：&#34；your dataproc cluster name&#34；region：&#34；your dataproc luster region&#34；project：&#34；your gcloud project id&#34；", "note_en": "# Setup gcloud CLI-  uses:  GoogleCloudPlatform/github-actions/setup-gcloud@master  with:  version:   &#39;314.0.0 &#39;  service_account_key:  ${{ secrets.service_account_key }}  service_account_email:  ${{ secrets.service_account_email }}  project_id:  ${{ secrets.project_id }}  export_default_credentials:  true-  run:  gcloud info-  name:  Create Google Cloud Dataproc cluster  uses:  vishnudxb/gcloud-dataproc-creation@main  with:  cluster:   &#34;your dataproc cluster name &#34;  region:   &#34;Your dataproc luster region &#34;  project:   &#34;Your gcloud project id &#34;  initialization-actions:   &#34;gs://&lt;your bucket&gt;/&lt;initialization-script.sh&gt; &#34;  master-boot-disk-size:   &#34;500GB &#34;  master-boot-disk-type:   &#34;pd-standard &#34;  master-machine-type:   &#34;n1-standard-2 &#34;  max-idle:   &#34;1h &#34;  num-masters:  1  worker-boot-disk-size:   &#34;500GB &#34;  worker-boot-disk-type:   &#34;pd-standard &#34;  worker-machine-type:   &#34;n1-standard-2 &#34;  zone:   &#34;us-east1-b &#34;  image-version:   &#34;preview-ubuntu18 &#34;  metadata:   &#34;PIP_PACKAGES=$(sed -e &#39;/^#/d&#39; -e &#39;s/#.*$//&#39; -e &#39;s/ *$//g&#39; requirements.txt | tr &#39; \\n&#39; &#39; &#39;) &#34;  scopes:   &#34;https://www.googleapis.com/auth/cloud-platform &#34;  num-workers:  2  properties:   &#34;spark:spark.scheduler.mode=FIFO &#34;  labels:   &#34;service=web-app,env=dev &#34;\n  inputs:  cluster:  description:   &#39;Enter your gcloud dataproc cluster name &#39;  required:  true  region:  description:   &#39;Enter your gcloud dataproc cluster region &#39;  required:  false  default:  us-east1  project:  description:   &#39;Enter your gcloud project id &#39;  required:  true  initialization_actions:  description:   &#39;Executables or scripts that will run on all nodes in your cluster immediately after the cluster is set up &#39;  required:  true  master-boot-disk-size:  description:   &#39;Dataproc Master Boot disk size &#39;  required:  false  default:  500GB  master-boot-disk-type:  description:   &#39;Dataproc Master Boot disk type &#39;  required:  false  default:  pd-standard  master-machine-type:  description:   &#39;Dataproc Master Machine type &#39;  required:  false  default:  n1-standard-2  max-idle:  description:   &#39;The duration before cluster is auto-deleted after last job completes, such as &#34;2h&#34; or &#34;1d&#34;. &#39;  required:  false  default:   &#39;1h &#39;  num-masters:  description:   &#39;The number of master nodes in the cluster. &#39;  required:  false  default:  1  worker-boot-disk-size:  description:   &#39;Dataproc Worker Boot disk size &#39;  required:  false  default:  500GB  worker-boot-disk-type:  description:   &#39;Dataproc Worker Boot disk type &#39;  required:  false  default:  pd-standard  worker-machine-type:  description:   &#39;Dataproc Worker Machine type &#39;  required:  false  default:  n1-standard-2  zone:  description:   &#39;Dataproc Cluster Zone &#39;  required:  false  default:  us-east1-b  image-version:  description:   &#39;The image version to use for the cluster. &#39;  required:  false  default:  preview-ubuntu18  metadata:  description:   &#39;Metadata to be made available to the guest operating system running on the instances &#39;  required:  true  scopes:  description:   &#39;Specifies scopes for the node instances. &#39;  required:  false  default:  https://www.googleapis.com/auth/cloud-platform  num-workers:  description:   &#39;The number of worker nodes in the cluster. &#39;  required:  false  default:  2  properties:  description:   &#39;Specifies configuration properties for installed packages, such as Hadoop and Spark. &#39;  required:  true  labels:  description:   &#39;List of label KEY=VALUE pairs to add. &#39;  required:  false\n After your testing you can delete the dataproc cluster you created by running the below action.\n -  name:  Delete Google Cloud Dataproc cluster  uses:  vishnudxb/gcloud-dataproc-deletion@main  with:  cluster:   &#34;your dataproc cluster name &#34;  region:   &#34;Your dataproc luster region &#34;  project:   &#34;Your gcloud project id &#34;", "posttime": "2020-10-19 15:15:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,github,测试用例,action,gcloud", "title": "GitHub-为测试用例创建Google云数据流程集群的操作", "title_en": "A GitHub-Action to create a Google cloud dataproc cluster for test use-cases", "transed": 1, "url": "https://github.com/marketplace/actions/gcloud-dataproc-cluster-creation", "via": "", "real_tags": ["google", "github", "测试用例", "action", "gcloud"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们在小的、单声道聚焦的项目中运营*。对我们来说，“Facebook”或“PornHub”是两个单一焦点的项目。“欧洲选举算法分析”是另一个项目，所有的志愿者都免费贡献，期待他们的努力得到认可，并提供优质的时间。一般来说，我们与理解和分享宣言的人和组织合作。我们格外赞赏积极主动地开发创意，截至2019年秋季，我们人手不足，资金不足。我们还没有解决这些问题的办法。阅读更多…", "note_en": "We operate in small, mono focus, projects*. “Facebook” or “Pornhub” are two mono-focus projects for us. “European Election algorithm analysis” is another one.All the volunteers contribute freely expecting acknowledgment for their effort and offering quality time. Generally, we team up with people and organization who understand and share the manifesto. Being proactive in developing an idea is extra appreciated, as per Autumn 2019, we run understaffed and underfunded. We don’t have solutions for these issues yet.    Read More…", "posttime": "2020-10-19 15:15:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "网络,web,贡献", "title": "我们为一个属于许多人的网络而战，而不是少数人的财产。", "title_en": "We fight for a web that is home for many, not property of the few", "transed": 1, "url": "https://tracking.exposed/", "via": "", "real_tags": ["网络", "web", "贡献"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "关于，我在换工作。我即将离开IDE*的围墙花园，前往部署在AS/400*上的专有语言。我们用IBM RPG*和Cool Plex编写，它们看起来有很多元代码，我现在知道是RDFTriples。\n在我的新工作中，我使用开源技术编写面向Web的应用程序，并部署到Linux上。我需要找一位编辑来帮我完成这项任务。\n我花了一些时间探索我的选择。在那次探索中，我从卡尔·迈耶那里了解到了Emacs。卡尔是我高中时的朋友，他为世界做出了很大贡献。\n当时我有三个年幼的孩子，我刚刚换了工作，换了编程语言，还不能理解Emacs。我希望我的编辑器能像其他GUI*应用程序一样工作。\n我没有花时间浏览Emacs教程，而把Emacs抛在了后面。\n在我新工作的几个月里，我再次转换了语言和范式。我的公司跳上一辆面包车，开到芝加哥去了解Django*和Ruby on Rails*。不到一周，我们的组织就采用了Ruby on rails。\n当时，我采用了TextMate*作为我的编辑。它有一个漂亮的用户界面，不需要花多少功夫就能学会。我没有意识到shell环境的用处有多大；在以后的岁月里，我会学到更多。在我的职业生涯中，我经常依赖于文件、系统和流程的GUI视图。因此，我没有一个心理模型，可以进一步推动我走向一个集成的文本编辑器。在我的傲慢中，我没有一步步看完Emacs教程。\n当时，TextMate是封闭源代码的。我用过它，也很喜欢它，但它开始滞后了。搜索项目功能开始行为不端，网格化项目陷入停顿。我找到了崇高的文字*然后换了。当时，Sublime的定位是TextMate的替代品。\n然后，随着我越来越多地参与开源项目，我开始想要一个开源文本编辑器。我是在2015年了解到Atom的。它是开源的，行为非常像Sublime，所以我改用了它。在此期间，我尝试了VIM*。然而，编辑的模态性质给人一种陌生的感觉。有时，我会尝试一个教程，但它从来没有坚持下来。我还考虑过修改TextMate，因为它的所有者后来将其作为开放源码发布。\n转发到。我已经开始注意到Atom中越来越多的bug和漏洞。不是害怕更换编辑的人，我开始寻找。\n我也给了VS Code*一个旋转，发现它令人不安。首先，它让人感到压抑和反感。配置生态系统感觉很笨重。这些插件给人的感觉就像是一个App Store。每件事都让人感觉VS代码试图混淆它的底层系统。\n几年前，我开始渴望遵循Tim Pope关于提交消息的指导来编写我的大部分提交消息。直到今天，我还在尝试编写有意义的提交消息，因为我知道这些提交消息通常与代码非常接近。有些人可能会将信息放在Github或GitLab上Pull请求消息中，但该信息不会保持在代码附近。然而，这些信息现在与Github的细节密不可分。当我想要拼写我的代码时，我不想去Github查看发生了什么。我希望我的git注解和git日志能够承载尽可能多的意义。\n众所周知，最后一根稻草是要求提交消息的git*提示符。提示是一个很小的输入框；它不鼓励有意义的提交消息。相反，它鼓励简洁的承诺。仅这一功能就告诉我，使用它的人将被鼓励编写不好的提交消息。我不想成为那个有我的文本编辑器的人。\n我又试了一次vim*但感觉不对劲。当我向服务器支付费用时，我使用Vim。我最近不经常这样做，因为我可能会使用Emacs的流浪汉模式。\n我尝试了Emacs，并按照自己的方式完成了教程。正是对该教程的坚定承诺，以及诚实地说，该教程的写作促使我进一步深入研究。我花了一些时间摆弄Doom或Spacemacs，但最终还是选择了裸机Emacs。\n事实证明，这一点至关重要。作为一个使用文本编辑器超过15年的人，我知道我使用过的功能。我选择在Emacs中做的是完成教程并开始编码。\n如果我发现自己想要一个功能，我就会注意到它。然后，我找到了实现该功能的一个或多个包。我花了相当多的时间通读梅尔帕，寻找一个包裹。发生的事情是，我已经建立了自己的编辑器，满足了我的需求。\n现在，大约5个月过去了，我完全喜欢这段经历。Emacs开发人员社区似乎对编写文档有更高的承诺。许多Emacs开发人员使用识字编程范例编写配置文件。换句话说，他们首先写下他们对软件的意图，然后再编写软件。\n组织模式是我以前的文本编辑器所缺少的部分。Carstin Dominik花时间构建了组织软件开发、研究和编写的非编码任务的功能。如果我重新开始我的博客，我会利用org-mode和ox-Hugo来写博客。\n组织模式将有意义的工具层叠在纯文本文件之上；语法接近Markdown，但差别很大。结构的简单性使世界与众不同。使用纯文本，我可以运行低级Unix命令(例如grep、sed等)。而且还具有对数据的更高级别的编程访问。\n在使用magit之前，我几乎总是使用git*的命令行工具。我之前的工作流程是使用终端声明我的GIT提交，然后使用文本编辑器编写提交消息。作为提交消息编辑器打开Atom很慢，这是我离开Atom的另一个原因。我不想等待数秒才开始编写提交消息。\n除了读取git日志之外，我现在使用Magit执行几乎所有的git任务。这包括一个令人惊叹的交互式git rebase环境。\n当卡尔把我介绍给Emacs的时候，他给我看了一整段话。这一功能让我印象深刻。这不是什么花哨的事，但它表明Emacs将列宽视为一等公民。\n遵循这种结构有助于确保您的GIT日志旅行不会过于混乱。如果您要与命令行交互，这也会有所帮助。换句话说，自动换行很好，但它不是通用的，也不是在所有上下文中都有效。\n我已经使用此命令快速包装文档，以免它流出屏幕。对于编码缓冲区，我禁用了自动换行。我也渴望120字符线宽的代码和80字符线宽的评论。为什么会有这样的差异呢？评论应该读起来更像散文，长长的台词会使段落更难阅读。\n这不是什么命令，但自从我了解Emacs以来，我就一直对此持乐观态度。\n直到我偶然发现它，我才知道我想要Swiper。我现在一直在使用它；它甚至取代了我在Emacs中的默认查找行为。\n是干什么的呢？我输入Control+S，用Emacs的话来说就是C-s，然后开始输入一个单词。在当前缓冲区底部的小型缓冲区中，我看到包含该单词的行。这有点像一个有上下文的发现。重要的是，这不会移动主缓冲区中的光标。\n所以我很快就引用了一些东西，然后继续打字。或者，我可以在迷你缓冲区中导航并跳转到主缓冲区中的该位置。相当圆滑。\nWgrep-ag套餐有点让我大吃一惊。它允许您使用ag*和wgrep编辑搜索结果。\n在Emacs中，我使用ag搜索项目。Emacs在迷你缓冲区中呈现搜索结果。在本例中，小缓冲区是Emacs底部的一小部分行，显示结果的子集。\n在小缓冲区处于活动状态(例如，我一直在那里键入结果)的情况下，我调用了Ivy-Octure。该函数在只读缓冲区中打开所有搜索结果。当我写这个例子的时候，我想“我想知道我是否可以使用常春藤-发生在Swiper结果中？是的我可以。所以我在解释的时候学到了一些东西。\n使用这个新缓冲区，我调用函数wgrep-change-to-wgrep-mode。这会将常春藤发生缓冲区切换到编辑模式。我开始编辑搜索结果，就好像它是它自己的文件一样。\n然后保存编辑，wgrep-ag将所有这些更改写回找到的结果。\n从另一种角度来看，wgrep-ag加载一个半结构化缓冲区。每行有三个字段：文件名、行号和行文本。我可以使用wgrep-ag将这些更改写回原始文件。\nTextMate首先向我介绍了这个强大的概念。从那时起，这个功能就成了我的编辑器的必备功能。\nIedit-默认情况下，如果我键入Control+；(例如C-；)，iedit包将突出显示该单词的每个匹配项。我现在可以输入，然后iedit会更新所有匹配项。\n多光标-这个包提供了更精细的粒度控制，并允许我在10个连续行上设置光标并开始键入。\n直到我安装了Expand-Region，我才知道我错过了什么。现在使用Control+=(例如C-=)，我的光标扩展到最小的逻辑区域(例如突出显示一个单词)，再次键入它会扩展该区域(例如突出显示句子)，依此类推。而Control+Shift+=(例如C-+)则收缩该区域。\n我已经用它为我在行业竞选中的新远景写了竞选笔记。双向链接和快速笔记捕获工具成就了信息管理的梦想。\n在Away中，它创建了一个我可以使用Emacs编辑和导航的Wiki。\n今年，Emacs吸引了我。随着我进入软件开发的第三十年，我开始欣赏教程、文档和拥有自己的工具。Emacs做到了这一切。它甚至和我一样老。\n我发现我花在Emacs上的时间越来越多，因为它做了越来越多我想要的事情，所有这些都是在文本文件和目录的基础上构建的。", "note_en": "About  , I was changing jobs. I was leaving the walled garden of an  IDE  *\t\t\t\t\t\tfor a proprietary language that deployed to an  AS/400  *\t\t\t\t\t\t.  \t\t\t\t\t\t\t\tWe wrote in  IBM RPG  *\t\t\t\t\t\t\t\tand Cool Plex, which looked a lot of meta-code and what I now know to be  RDF Triples\n  At my new job, I was writing web-facing applications using open source technology and deploying to Linux. I needed to find an editor to help me with the task.\n  I spent a bit of time exploring my options. During that exploration, I learned of  Emacs from  Carl Meyer.  \t\t\t\t\t\t\t\tCarl is a friend of mine from high school, and has contributed a lot to the world.\n  At the time I had three young children, I had just changed jobs, changed programming languages, and couldn’t wrap my head around Emacs. I wanted my editor to behave like other  GUI  *\t\t\t\t\t\tapplications.\n  I didn’t take the time to walk through the Emacs tutorial, and left Emacs behind.\n  A few months into my new job, I switched languages and paradigms again. In  , my company hopped in a van and drove to Chicago to learn about  Django  *\t\t\t\t\t\tand  Ruby on Rails  *\t\t\t\t\t\t. Within a week, our organization adopted Ruby on Rails.\n  At that time, I adopted  Textmate  *\t\t\t\t\t\tas my editor. It had a beautiful user-interface and required little effort to learn.  \t\t\t\t\t\t\t\tI wasn’t aware of how useful a shell environment could be; In the years I’d learn more. I had, during my professional life, often relied on GUI views into files, systems, and processes. So I didn’t have a mental model that would have further nudged me towards an integrated text editor. And in my hubris, I didn’t step through the Emacs tutorial.\n  At the time Textmate was closed source. I used it and loved it, but it began to lag.  \t\t\t\t\t\t\t\tThe search a project function started misbehaving and gridning projects to a halt.\t\t\t\t\t\t\t\t\t\t\t\t\tI found  Sublime Text  *\t\t\t\t\t\tand switched. At the time, Sublime was positioning as a Textmate replacement.\n  Then, as I engaged more and more in open source projects, I started wanting an open source text editor. I learned about Atom in 2015. It was open source and acted enough like Sublime, that I switched.  \t\t\t\t\t\t\t\tDuring this time, I dabbled with  vim  *\t\t\t\t\t\t\t\t. However, the modal nature of editing felt foreign. At times, I’d try out a tutorial, but it never stuck. I also thought about revising Textmate as the owner later released it as open source.\n  Forward to  . I had begun noticing more and more bugs and breaks in Atom. Not one to fear changing editors, I started looking.\n  I also gave  VS Code  *\t\t\t\t\t\ta spin, and found it disconcerting. First, it felt constraining and off-putting. The configuration ecosystem felt clunky. The plugins felt like an App Store. Everything felt like VS Code was trying to obfuscate it’s underlying systems.\n  Years ago, I started aspiring to write most of my commit messages following  Tim Pope’s guidance on commit messages. To this day, I try to write meaningful commit messages, knowing that these commit messages will most often be close to the code. \t\t\t\t\t\t\t\tSome may put that information in a pull request message on Github or Gitlab, but that information does not remain close to the code. However, that information is now inextricably tied to the details of Github. When I want to spelunk through my code, I don’t want to have to go to Github to get a view into what happened. I want my  git annotate and  git log to carry as much meaning as possible.\n  The proverbial last straw was the  git  *\t\t\t\t\t\tprompt for commit messages. The prompt was a small input box; It didn’t encourage meaningful commit messages. Instead it encouraged terse commits. That feature alone told me that people using it will be encouraged to write bad commit messages. I didn’t want to be that guy with my text editor.\n    I again tried  vim  *\t\t\t\t\t\tbut it felt off.  \t\t\t\t\t\t\t\tI use Vim when I shell out to a server. I haven’t done it much recently, because I’d likely use Emacs’s  Tramp mode.\n  I tried Emacs, and worked my way through the Tutorial. It was the strong commitment to the Tutorial and honestly the writing of that tutorial that nudged me to dive further in. I spent some time fiddling with Doom or Spacemacs, but in the end settled on bare metal Emacs.\n  This proved crucial. As someone that’s used text editors for 15+ years, I know the features I’ve used. What I chose to do in Emacs was to complete the tutorial and start coding.\n  If I found myself wanting a feature, I took note of it. Then, I went and found the package or packages that implemented the feature.  \t\t\t\t\t\t\t\tI spent quite a bit of time reading through  Melpa, looking for a package. What happened is that I have built up my own editor that meets my needs.\n  Now, 5 months or so in, I’m fully loving the experience. The community of Emacs developers seem to have a higher commitment to writing documentation.  \t\t\t\t\t\t\t\tMany Emacs developers write their configuration files using the paradigm of  Literate Programming. In other words, they first write down their intentions for the software, then write the software.\n    Org Mode is the missing piece for my past text editors.  Carstin Dominik took the time to build out functionality for organizing the non-coding tasks of software development, research, and writing.  \t\t\t\t\t\t\t\tWere I to begin my blog anew, I’d leverage  org-mode and  ox-hugo for blogging.\n  Org Mode layers meaningful tools on top of plain text files; The syntax is close to Markdown, but different enough. The simplicity of structure makes the world of difference. With the plain text, I can run low-level Unix commands (e.g.  grep,  sed, etc.) but also have higher level programmatic access to the data.\n    Prior to  magit, I almost always used command line tools for  git  *\t\t\t\t\t\t. My previous workflow would be to use Terminal to state my git commits, and then my text editor to write commit messages.  \t\t\t\t\t\t\t\tAtom’s slowness to open as a commit message editor was another reason I left Atom. I don’t want to wait multiple seconds to start writing a commit message.\n  Except for reading git logs, I now do most all git tasks with Magit. That includes an  amazing interactive  git rebase environment.\n      When Carl introduced me to Emacs, he showed me  fill-paragraph. That functionality stuck with me. It’s nothing fancy, but it shows that Emacs treats column-width as a first class citizen.\n    Conforming to that structure helps ensure that your  git log excursions are not unduly messy. It also helps if you’re going to interact with the command-line. In other words, automatic word-wrapping is nice, but its not universal, nor does it work in all contexts.\n  I have used this command to quickly wrap documentation so as to not have it flow off the screen.  \t\t\t\t\t\t\t\tFor coding buffers, I disable word wrapping. I also aspire to 120 character line width for code and 80 character line width for comments. Why the variance? Comments should read more like prose, and long running lines make the paragraphs harder to read.\n  It ain’t much of a command, but I’ve held a candle for it since I learned about Emacs.\n    I never knew I wanted Swiper until I stumbled onto it. I now use it  all of the time; It’s even replaced my default Find behavior in Emacs.\n  What does it do? I type Control+S  \t\t\t\t\t\t\t\tIn Emacs parlance, that’s  C-s \t\t\t\t\t\tand start typing a word. In a mini-buffer at the bottom of the current buffer, I see the lines that include that word. It’s a bit like a find with context. Importantly, this doesn’t move my cursor in the main buffer.\n  So I end up quickly referencing something and get back to typing. Or, I can navigate through the mini-buffer and jump to that location in the main buffer. Quite slick.\n    The  wgrep-ag package sort of blew my mind. It allows you to use  ag  *\t\t\t\t\t\twith  wgrep to edit search results\n    In Emacs, I search a project using  ag. Emacs renders the search results in a mini-buffer. In this case, the mini-buffer is a small set of rows at the bottom of Emacs that show a subset of the results.\n  With the mini-buffer active (e.g. I’ve been typing results there), I invoke  ivy-occur. That function opens all of the search results in a read-only buffer.  \t\t\t\t\t\t\t\tWhile I was writing this example, I thought to myself “I wonder if I can use  ivy-occur from Swiper results? Yes I can. So I learned something while explaining something.\n  With this new buffer, I invoke the function  wgrep-change-to-wgrep-mode. This toggles  ivy-occur buffer into an edit mode. I begin editing the search results as though it were it’s own file.\n  Then I save the edits, and  wgrep-ag writes all of those changes back to the found results.\n  Another way to think of it,  wgrep-ag loads a semi-structured buffer. Each row has three fields: file name, line number, and line text. I can use  wgrep-ag to write those changes back to the originating file.\n      Textmate first introduced me to this powerful concept. Since then, this functionality has been a mandatory feature of my editors.\n    iedit - by default, if I type Control+ ; (e.g.  C-;), the iedit package highlights each occurence of the word. I can now type and iedit updates all occurrences.\n  multiple-cursors - this package provides finer grain control, and allows me to set a cursor on ten contiguous lines and start typing.\n    I didn’t know what I was missing until I installed  expand-region. Now with Control+ = (e.g.  C-=) my cursor expands to the smallest logical region (e.g. highlighting a word), typing it again expands that region (e.g. highlighting the sentence), etc. And Control+Shift+ = (e.g.  C-+) contracts the region.\n      I’ve used this to write up campaign notes for my  New Vistas in the Thel Sector campaign. The bi-directional link and quick note capture tools make for a dream in information management.\n  In away, it creates a Wiki that I can use Emacs to edit and navigate.\n    This year, Emacs drew me in. As I’ve entered my 3rd decade of software development, I’ve grown to appreciate tutorials, documentation, and owning my tools. Emacs delivers on all of that.  \t\t\t\t\t\t\t\tIt’s even as old as I am.\n  What I’ve found is I spend more and more time in Emacs, as it does more and more of what I want, all building from the basis of text files and directories.", "posttime": "2020-10-19 15:15:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "emacs", "title": "我选择Emacs作为我的新文本编辑器", "title_en": "I Chose Emacs as My New Text Editor", "transed": 1, "url": "https://takeonrules.com/2020/10/18/why-i-chose-emacs-as-my-new-text-editor/", "via": "", "real_tags": ["emacs"]}, {"category": "", "categoryclass": "", "imagename": "bb01c602bfac53da8e0dcb9c232d920a.png", "infoid": 1029733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每一位星际舰队军官的首要职责就是了解真相，无论是科学真相、历史真相还是个人真相！这是星际舰队赖以生存的指导原则。--让-吕克·皮卡德船长，“星际约会45703.9”\n我们的使命是将我们的美国“星际迷航”粉丝与无党派团体联系起来，努力确保我们的社区有一个公平公正的选举过程，并将我们从“星际迷航”中学到的原则和职业道德带到旅途中。​。\n点击“将我传送”，即表示您同意接收来自Trek the Vote和我们的合作伙伴的电子邮件。你可以随时选择退出。\n请尽您所能回答以下问题，我们将为您配对在您所在地区工作的合作伙伴。\n通过在21世纪社交媒体和电子邮件上分享Trek投票，帮助我们找到学院的下一批学员。\n公平计票志愿者将做无党派的工作，走出全国的投票电话和短信银行，在选定的州(包括佐治亚州、佛罗里达州和密西西比州)的投票站外观察。\n通过866-Our-Our-Vote热线和选民援助现场计划，选举保护帮助确保合格的选民能够参与我们的民主。\nPower the Polls的使命是在全国范围内招募25万名投票工作人员，以保持投票站的开放，并确保美国人可以安全轻松地投票。\n投票英雄计划正在招募25岁以下的星际舰队官员，以满足他们社区对投票工作人员的需求。\n事先阅读所有的报告和技术手册，这样当你有选票的时候，你就可以确切地知道你想怎么投票。\n对您的选民登记运行3级诊断，并确保您已准备好在选举日参与投票。\n将您的所有信息输入主计算机只需不到两分钟。\n想要跳过排队，远离COVID，还是想在选举日做志愿者？报名参加邮寄投票。\n联邦委员会的每个成员都可以自由地对选票上的每个人和每件事发表自己的意见，但Trek the Vote是一项无党派的倡议。\n这意味着我们唯一感兴趣的是举行一场选举，在这场选举中，每个合格的美国人都可以轻松安全地投票，每一张选票都经过地方和州选举官员的严格统计和认证。\n我们是一个由迷航迷、演员和幕后专业人士组成的草根网络，并不隶属于哥伦比亚广播公司(CBS)。\n大多数美国人习惯于在选举当晚拿到选举结果，但由于今年有这么多人通过邮寄投票，我们可能需要几天甚至几周的时间才能知道结果。\n我们计划在11月3日之后向志愿者提供另一套Trek The Vote任务，这是基于无党派的过渡诚信项目的结果，该项目预计，在选举后的一段时间里，很有可能需要大量的公众参与，以确保在认证或宣布结果之前统计每一张选票。\n你是无党派选举诚信组织的成员吗？你需要星际舰队最好的帮助吗？\n你是演员、作家、设计师或其他对“迷航”经典有贡献的创意专业人士吗？\n你是新闻媒体的一员吗？希望报道“迷航之旅”的投票情况吗？", "note_en": "&#34;The first duty of every Starfleet officer is to the truth, whether it&#39;s scientific truth or historical truth or personal truth! It is the guiding principle on which Starfleet is based.&#34; - Captain Jean-Luc Picard, Stardate 45703.9\n Our mission is to connect our fellow American  Star Trek fans with non-partisan groups working to ensure a fair and equitable electoral process in our communities, and to carry the principles and work ethic we&#39;ve learned from  Star Trek along for the ride.​\n    By clicking &#34;Beam Me Up&#34; you agree to receive email from Trek the Vote and our partners. You may opt out at any time.\n   Please answer the following questions to the best of your ability and we will match you with partners doing work in your area.\n Help us find the next class of cadets for the Academy by sharing Trek the Vote on 21st century social media and by email.\n     Fair Count volunteers will do nonpartisan get out the vote phone &amp; text banking nationwide and observe outside of polling stations in select states, including Georgia, Florida, and Mississippi.\n Through the 866-OUR-VOTE hotline and voter assistance field program, Election Protection helps ensure eligible voters are able to participate in our democracy.\n Power the Polls is on a mission to recruit 250,000 poll workers nationwide to keep polling places open and ensure that Americans can vote safely and easily.\n Poll Hero Project is recruiting Starfleet officers under 25 to meet the need for poll workers in their communities.\n     Read all the reports and technical manuals beforehand so you know exactly how you want to vote when you have your ballot.\n Run a level 3 diagnostic of your voter registration and make sure you&#39;re ready to engage on Election Day.\n It takes less than two minutes to get all your information into the main computer.\n Want to skip the lines, stay safe from COVID, or spend Election Day volunteering? Sign up to vote by mail.\n           Each individual member of the Federation Council is free to express their own opinions about everyone and everything on the ballot, but Trek the Vote is a non-partisan initiative.\n  That means our only interest is to have an election in which every eligible American gets to vote easily and safely and each vote is scrupulously counted and certified by local and state elections officials.\n We are a grassroots network of  Trek fans, actors, and behind-the-scenes professionals and not affiliated with CBS.\n Most Americans are used to getting election results the night of the election, but because so many people are voting by mail this year, it will likely take days or even weeks before we know the results.\n  We are basing our plans to offer another set of Trek the Vote missions to volunteers after November 3 on the findings of the non-partisan  Transition Integrity Project, which projected a high likelihood that significant public engagement will be required in the post-election period to ensure that every vote is counted before results are certified or announced.\n  Are you part of a non-partisan election integrity group? Would you like some help from Starfleet&#39;s finest?\n Are you an actor, writer, designer, or other creative professional who has contributed to the  Trek canon?\n Are you a member of the news media looking to report on Trek the Vote?", "posttime": "2020-10-19 15:14:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "徒步旅行,trek,投票", "title": "徒步旅行投票", "title_en": "Trek the Vote", "transed": 1, "url": "https://www.trekthe.vote/", "via": "", "real_tags": ["徒步旅行", "trek", "投票"]}, {"category": "", "categoryclass": "", "imagename": "bc0104333d09d46f53efce364cec0277.jpeg", "infoid": 1029732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Covid强迫我们所有人回到自己的房子里，有一段时间，这似乎是一种永久的趋势，至少在IT领域是这样。当生产率保持稳定甚至提高时，人们会感到惊讶。他们开始讨论把它变成永久性的。一些人甚至尝试了一下(Dropbox，Twitter，Upwork，Zillow)。\n但对潜在的远程工作世界的抱怨也在流传。尤其是在社交媒体上。怀疑者声称，团队不能远程建立信任，工作关系必须面对面地建立。\n然而，这些评论与哈希科普(Hashicorp)、Basecamp和Automattic等成功的公司形成了鲜明对比，这些公司甚至在大流行之前就100%远离这里。\n那么真相是什么呢？据我所知，这位远程工作批评家的论点不是集中在生产力上，而是集中在人际关系上，可能是个人偏好的一种表达--这是内向和外向之间的经典区别。人们是不同的，他们需要不同的工作场所的东西。对一些人来说，工作不需要同时提供同事和午餐伴侣。对于其他人来说，更多的个人接触对于有效的协作至关重要。\n如果面对面交流的需求是单独确定的，那么我们应该选择尊重这种差异的混合解决方案。如果您有时在现场，有时不在现场，这不是一种混合方法。这只会让人们一半时间不开心。而是一种混合解决方案，员工可以在仅远程团队或现场团队(团队中的每个人都100%远程或100%现场)之间进行选择？\n此确定需要特定于团队，因为只有一些远程员工的团队是有问题的。如果现在面对面的员工很难与远程员工建立信任，那么在他们回到办公室后，这一点也不会改变，他们仍然需要与一半的团队在线协作。要求他们将互动限制在办公桌上的视频会议似乎也是不切实际的。如果面对面的互动是他们所渴望的，那么这个计划只会进一步剥夺他们的权利。远程工作者也在这些计划中蒙受损失。他们可能会感到被排斥，想知道没有他们会做出什么决定。\n考虑一下大学是如何配置的。各种类型的人都有学习安排。有些人把时间花在学习小组、图书馆的共享空间或其他地方。有些人参加大学聚会，在那里他们可以长时间安静地集中精力。一些人在像自助餐厅或宿舍大堂这样的开阔区域学习，以获得平静的背景噪音和活动。每个人都有适合自己的东西。\n一所大学迎合所有性格类型，不美化或贬低任何特定的风格。工作也要努力做到这一点。我们不应该把自己的喜好投射到任何人身上，而应该尊重他们，并在可能的情况下设法容纳他们。人们选择在哪里工作对幸福感和生产力有如此重大的影响，因此值得特别关注。\n我们刚刚经历了十年或更长时间，工程师们被迫在开放式办公室计划中工作，因为公司高管的少数偏好。很多工程师抱怨分心。如果再把它强加给他们，那将是一个错误。同样，强迫每个人远程工作也是同样错误的另一面。\n在我们今后的工作安排中--即使是在愉快之后--让我们双管齐下。没那么难。无论哪一方都试图将自己的喜好投射到另一方，让我们保持坚强，记住我们学到的教训。最重要的是，让我们对彼此的个人需求保持敏感。这场大流行至少教会了我们这么多。\n[1]另一个流行的想法是让团队在一周中的某些日子都在现场，其余的时间则远离现场。这一计划可能会奏效，但也有一些潜在的陷阱。首先，如果每个人的办公室日程都不一样，那就违背了目的--但这可能很难安排。其次，随着时间的推移，人们自然会喜欢一种工作模式而不是另一种，并主要倾向于这种工作模式。然后，所有同样的失败的动态，一半和一半的团队将会出现。", "note_en": "Covid forced us all to our houses and for a while it seemed like this would be a permanent trend, at least in the IT space. People were surprised when productivity stayed consistent or even increased. They started talking about making it permanent. Some even took the plunge (Dropbox, Twitter, Upwork, Zillow).\n But grumblings about a potentially remote-working-world are circulating as well. Particularly on social media. Doubters claim that teams cannot build trust remotely, that work relationships must be built face-to-face.\n These comment s, however, stand in contrast to successful companies like Hashicorp, Basecamp and Automattic that were 100% remote even before the pandemic.\n So what is the truth? As far as I can tell, the remote work critic’s argument doesn’t center on productivity, but on relationships and may be an expression of personal preference — the classic difference between introverts and extroverts. People are different, and they need different things from their place of employment. For some, work doesn’t need to provide both coworkers and lunch companions. For others, more personal contact is crucial for effective collaboration.\n If the need for face-to-face communication is individually determined, then we should settle on a hybrid solution that respects that difference. Not a hybrid approach where some days you are on-site and some days you are not. That only promises to make people unhappy half the time. But a hybrid solution where the employees get to choose between a remote-only or on-site team — where everyone on the team is either 100% remote or 100% on-site¹.\n This determination needs to be team specific, because teams with only some remote workers are problematic. If building trust with remote employees is difficult now for the face-to-facers, that won’t change after they return to the office and still have to collaborate online with half their team. It also doesn’t seem practical to ask them to limit their interactions to video conferencing from their desks. If face-to-face interaction was what they were craving that scheme would only further deprive them. Remote workers also suffer in these schemes. They are likely to feel excluded, wondering what decisions are being made without them.\n Consider how a university is configured. There are study arrangements for all types of people. Some spend their time in study groups in shared spaces in libraries or elsewhere. Some take to a university carrel where they can be by themselves for long periods of quiet concentration. Some study in open areas like cafeterias or dormitory lobbies for the calming background noises and activity. There is something for everyone.\n A university caters to all personality types, and does not glorify or disparage any specific style. Work should strive to do the same. We should not project our own preferences on anyone else, but respect them and seek to accommodate them where possible. Where people choose to work has such a significant impact on happiness and productivity that it deserves particular attention.\n We just came off a decade or more where engineers were forced to work in open office plans because of a minority preference of corporate executives. Plenty of engineers complained about the distraction. It would be a mistake to force it on them again. Likewise, forcing everyone to work remotely would be the other side of the same mistake.\n In our future working arrangements — even after covid — let’s have it both ways. It’s not that hard. No matter how much either side may try to project their own preferences on the other, let’s stay strong and remember the lessons we’ve learned. Most of all, let’s be sensitive to each other’s personal needs. This pandemic has at least taught us that much.\n  [1] Another popular idea is for teams to  all be on-site some days of the week and remote the rest. This scheme could work, but has some potential pitfalls. First, it would defeat the purpose if everyone wasn’t on the same in-office schedule— but that can be difficult to arrange. Second, over time people will naturally prefer one working mode over the other and drift towards it primarily. Then all the same failed dynamics of a half-and-half team will be present.", "posttime": "2020-10-19 15:14:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wfh", "title": "即将到来的WFH对峙", "title_en": "The Coming WFH Standoff", "transed": 1, "url": "https://medium.com/@vincent.bird2020/the-coming-wfh-standoff-f98657b8f283", "via": "", "real_tags": ["wfh"]}, {"category": "", "categoryclass": "", "imagename": "768ee3a1b5d3b857c8921f2aa9060096.png", "infoid": 1029731, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当今世界有两种银行体系：一种是为有钱(或信用良好)的人提供的，另一种是为没有钱(或信用良好)的人提供的。但这两个系统都运行得不好。有钱人已经习惯了笨重的用户体验和较低的期望。对于其他所有人--大多数美国人和全世界数十亿人--银行没有很好地为他们提供服务，或者有时根本没有。不仅如此，目前的体系实际上是从最需要金融服务的人身上提取出来的。你越穷，你的选择就越少，支付的费用就越多。\n这个系统显然已经崩溃了。尽管多次尝试，但没有人能够修复它。大型金融机构每年仅在维护现有系统和遵守法规方面就已经花费数十亿美元，几乎没有留下新产品开发的空间。与此同时，合规要求和基础设施的复杂性使新公司甚至难以负担进入市场的费用。但是，如果软件可以解决这些硬的、结构性的问题，即使是非金融科技的公司也能为客户提供金融服务，情况会怎样呢？如果结果是，人们不只是忍受，而是真的热爱他们的银行，那会怎么样呢？目前，尽管人们使用金融服务的频率很高，但很少有人会将他们的银行列为他们日常产品中一个受人喜爱的品牌。\n但下一家银行不必一开始就是一家银行。我相信金融服务的下一个时代将来自看似意想不到的地方。就像亚马逊网络服务极大地降低了软件业务的成本和复杂性，释放了数以千计的新公司一样，银行业的“金融科技的亚马逊网络服务”阶段已经到来。在AWS之前，一家企业每月运行计算和存储的成本可能为15万美元，而现在的成本约为每月1500美元。以大致相同的方式，我们正接近任何一家公司都可以启动或启用金融服务的临界点。多个类别的消费者应用程序-用户高度重视的主屏幕固定装置-正在成为银行。这并不像听起来那么疯狂：许多司机已经将Lyft和Uber视为他们事实上的银行。十年前，这些拼车公司甚至还不存在。\n为什么所有这些都不能通过对当前系统的渐进式改进来实现呢？为什么没有更多的初创公司能够扩大规模呢？要完全理解为什么我们开始看到如此戏剧性的变化，有必要先解开我们是如何走到今天这一步的。\n为什么“穷人代价高昂”的流行说法是，大银行应该为高昂的费用和缺乏产品创新负责。在某种程度上，这是真的。但由于遗留技术和实体足迹的负担，经典金融服务机构也面临结构性问题。\n一段时间以来，银行一直承受着压力，特别是在消费者已经转移到网上的情况下。这些机构中的大多数已经存在了几十年-在某些情况下是几百年-通过在实体分行获得客户。然后，银行拥有该人的整个财务生命周期：从第一个支票账户到第一张信用卡，从第一个经纪账户到第一个抵押贷款，依此类推。然而，在电子商务时代，银行与客户之间不再存在同样的关系。取而代之的是，消费者可以在网上从几个不同的提供商那里选择他们的金融服务。\n然后金融危机来袭。德宾修正案(多德-弗兰克法案的一部分)等用意良好的法规限制了借记卡交易的手续费，其理论是，如果商家在互换中支付更少的费用，他们将以更低的价格将节省的费用转嫁给消费者。这些规定旨在帮助商人和刺激经济活动，但它们显著减少了大银行的收入。一些人估计每年收入下降超过60亿美元-这是一个不小的打击需要消化！为了弥补这些损失，许多银行取消了免费支票，提高了最低余额，并提高了透支费。具有讽刺意味的是，德宾修正案对其意在帮助的消费者产生了不利影响。由于大多数美国人靠薪水过活，这些看似增加的银行手续费对他们的生活产生了重大影响。\n对于银行来说，提高费用比降低实体分行和相关员工的硬固定成本容易得多，速度也快得多。最重要的是，现有的软件基础设施似乎是一个无底洞：银行不断地在旧的、难以改变的系统之上为新的合规规则添加和修补补丁，导致软件变得错综复杂，像意大利面一样混乱。在一些较大的银行，75%的IT预算用于维护。除了软件，还有大量的体力劳动。大型银行10%至15%的员工专门致力于合规工作。仅花旗集团去年就有20.4万名员工中的3万人合规工作，主要致力于手动审查反洗钱(AML)系统和文件触发的警报等任务\n这些维护和合规成本中的许多都以更高的费用的形式转嫁给客户。这些成本在预算中几乎没有留下创新的空间。在其他行业，初创公司通常可以带来新的方法和更好的技术。但在金融服务业，要让金融科技的公司在当前条件下运营是困难的，需要多个合作伙伴关系，根深蒂固的金融业内部知识，以及建立的关系和资本。\n以下是创建一家只提供两种基本金融服务产品--支票账户和借记卡--的新“银行”所需具备的条件：\n新银行显然需要遵守监管规定。在美国，这通常是通过寻找赞助银行合作伙伴来实现的。(这种策略比申请执照要快得多，成功的可能性也更高。)。一家受监管的银行同意“借给”新银行牌照，以换取新银行提供的任何财务削减。通常情况下，这意味着担保银行可以获得更多存款，而不必支付获得这些客户的费用。\n对于初创公司来说，很难找到合适的赞助银行合作伙伴：没有这些银行的目录来确定潜在的合作伙伴和联系人。\n虽然保函银行确实获得了更多业务(例如，更多存款)的好处，但它也带来了额外的风险。它必须确保启动符合KYC(了解您的客户)、AML(反洗钱)等。鉴于这种风险，当潜在的金融科技初创企业与银行接洽时，一家银行如何深思熟虑、高效地评估初创伙伴？\n在一家初创公司决定合作之后，仍然需要更多的时间和精力来构建产品的其余部分。需要有一个卡处理器(更多的谈判，更多的成本)；一个发卡机构或与卡网络的关系(如Visa或MasterCard)；一个卡片打印机(更多的来回)；某种方式来连接到其他银行账户获取数据；消费者支付的方式；供应商帮助合规；等等。\n在这种制度下，现有银行很难变得更好，新银行很难起步，即使在激励一致的情况下，它们也很难相互合作。\n今天，技术使创新的新公司得以创建，并使现有的银行能够更好地服务于客户的需求。具体地说，这是通过以下方式实现的：(1)新的金融服务基础设施公司提供API(应用编程接口)；(2)新的分销渠道，使更好的、差异化的产品能够更容易地传播，并以更低的客户获取成本；(3)更好的数据，使公司能够更准确地评估和分配风险。\n首先是基础设施：我们正处于一个由银行基础设施公司组成的不断增长的生态系统的开端-一个“API经济”-初创公司和现有公司都可以借鉴。这些类似乐高的公司专门为银行构建和提供特定的构建块(例如，KYC/AML遵从性)。通过为其服务提供API，这些公司实现了其专业知识的民主化。这意味着任何一家公司都不必了解关于复杂法规的每一件事；另一家专门从事该领域的公司已经创建了供其他公司使用的API。这也意味着，创建各种规模和各种类型的新金融服务公司变得更容易。他们不需要自己建立或维护监管系统，只需“插入”这方面的专业知识即可。\n不仅新进入者使用这种软件基础设施来更快、更便宜地开始使用，现有的公司也开始扩充甚至取代他们的一些遗留系统。与其他实体零售商的做法不同-其中许多零售商要么倒闭，要么成为电子商务的光鲜展厅-银行API经济的美妙之处在于，它让每个人都参与进来，发挥自己的优势，专注于自己的核心产品。对更好、更具包容性的金融服务的需求足够大，市场上的许多参与者都有作为大型独立公司取得成功的空间。所有这些都能以更低的成本生产出更好的产品，为更广泛的消费者提供服务。\n这也意味着几乎任何一家公司都可以提供银行服务。尽管现有的消费者服务过去只有两个选择可以货币化-要么对产品收费，要么出售广告-现在，公司可以叠加金融产品。如果你的拼车应用程序变成了你的银行，你可以像跳上车一样无摩擦地支付商品，那会怎么样？多亏了科技，如果你最喜欢的游戏公司、流媒体服务或消费产品成为一家受人喜爱的金融服务公司，怎么办？或者见鬼，如果你的牙刷公司可以给你提供…。牙科保险？\n看起来很牵强吗？不是这样的。关于这个未来，最让我兴奋的是，它可以为无银行账户的人开启新的服务，这些服务是由来自他们试图服务的社区的企业家创建的，无论是在地理上还是通过个人经验。了解社区问题的人可能会开发出更好地服务于他们的产品：有谁比靠食品券长大的企业家更适合为那些靠食品券长大的人建立银行服务呢？\n关键是，今天，更好的产品可以更容易、更便宜地传播，这要归功于短信和社交媒体等新的分销渠道，以及通过你已经使用的非金融科技品牌，从而降低了客户获取成本。一种比现状好得多的产品可以通过推荐来传播，为公司创造有机增长的成本优势。如果公司没有很高的固定成本结构，那么他们就不需要通过高额费用来收回成本，从而扩大了它可以服务的客户范围。幸运的是，限制传统系统更好服务的漏洞-银行被激励通过更高的费用收回客户获取投资-成为较新公司的一个特征，这些公司拥有低成本结构和高效的分销战略。\n然而，伟大的技术转变不仅仅是解决现有的问题，它们还包括开放渠道来帮助更多的人。这就是数据是最后一块拼图的地方：通过复杂的数据科学和机器学习，我们现在可以释放更多的数据源，以便更好地评估那些缺乏足够数据或在当前系统中“看不见信用”的人的风险。今天，7900万美国人的信用评分低于680(这一点利率可能会大幅上升)，5300万人甚至没有足够的数据来生成FICO评分。大多数银行会认为这些人是高风险的，并在违约情况下向他们收取更高的利率(或者根本不向他们提供服务)。然而，我们在更多、更优越的数据中游来游去(而不仅仅是5个因素！)。而不是在这些信用评估系统发明的时候。\n数据科学和机器学习也可以帮助我们理解决定一个人的支付意愿和能力的最佳信号。在评估信用方面的新实验-比如监控租金和手机支付，以及现金流承销-一直很有希望。在全球范围内，公司正在使用更具创意的数据类型来有效地预测贷款偿还，比如你的手机操作系统有多新，你经常发短信的朋友数量，甚至你的手机晚上是否充满电。\n以前难以估量的人现在成了新客户。当更多的人有机会获得公平的c\n这种数据转移不仅会影响资金在债务中的流动，也会影响收入的流动。如果人们可以更快地拿到工资，而不是不得不等待两周，会怎么样？可靠的工人(无论是工薪族还是小时工)在发薪日之前现金短缺，他们应该能够从他们已经完成的工作中获得他们的收入。有了数据，我们知道您何时工作，您已经赚了多少钱，并且可以提供这项服务。目前的模式不成比例地惩罚了穷人。发薪日之前的短缺意味着他们不得不与有时更有害的发薪日玩家打交道。一些州试图通过使用贷款上限来阻止发薪日以高利贷利率放贷，以解决这个问题，但意想不到的结果是，最需要贷款的人现在可以使用…。没什么。这是善意的又一个例子，被误用了。但软件可以绕过遗留模型的硬限制，更好地协调意图和预期结果。\n10年前的第一波金融科技公司证明，实际位置不是银行的必要条件。现在，下一波浪潮正在解锁构建更好的金融服务所需的其余基础设施-银行牌照、支付处理器、监管合规性等。以前，公司必须煞费苦心地收购或合作(缓慢而昂贵！)，从头开始建设(也缓慢而昂贵！)，并找出合规性和IT的拼凑(仍然缓慢且非常昂贵！)。新的金融服务公司可以利用一流的基础设施，创造差异化的产品，帮助降低客户获取成本，并利用更好的数据源为更多、更多的人服务。\n软件不仅让我们绕过了艰难的结构问题，还让我们建立了全新的公司和服务。这一切都是在说：金融科技在吃世界。\n今天的银行系统偏爱特权阶层，而大部分人根本没有选择的余地。技术让各种金融服务参与者超越现有系统的限制进行创新，以更好地反映我们生活的世界。与其削弱根深蒂固的低效率，我们可以利用其非常结构性的限制，从头开始创建新类型的公司。我们可以比双层系统做得更好。当穷人不应该很贵。随着越来越多的人通过获得更好的金融服务进入经济，每个人都会受益。", "note_en": "There are two banking systems in the world today: one for people with money (or good credit), and another for people without. But neither of these systems work well. People with money have gotten used to clunky user experiences and low expectations. For everyone else — that’s most Americans and billions worldwide — banks don’t serve them well, or sometimes, at all. Not only that, but the current system actually extracts from the very people who need financial services the most. The poorer you are, the fewer options you have and the more you will pay.\n The system is clearly broken. No one has been able to fix it, despite many attempts to do so. Big financial institutions already   spend   billions  of dollars a year simply to maintain existing systems and comply with regulations, leaving little room for new product development. Meanwhile, compliance requirements and infrastructure complexity make it challenging for new companies to afford to even   enter  the market. But what if software could address these hard, structural problems, enabling even  non-fintech companies to provide financial services for their customers ? What if, as a result, people didn’t just put up with, but actually   love , their banks? Right now, despite how often people use financial services, few would list their bank as a beloved brand among their daily products.\n But the next bank does not have to start out as a bank. I believe the next era of financial services will come from seemingly unexpected places. Just as Amazon Web Services dramatically lowered the cost and complexity of launching a software business, unleashing thousands of new companies, the “AWS for fintech”   stage  has arrived in banking. Before AWS, it could cost $150,000 a month for a business to run compute and storage; it now costs roughly $1,500 a month. In much the same way, we are nearing the point at which any company can start or enable financial services. Consumer apps across multiple categories –home-screen fixtures highly valued by users — are becoming banks. It’s not as crazy as it might sound: Many drivers already consider Lyft and Uber their de facto bank. These ridesharing companies didn’t even exist a decade ago.\n   Why couldn’t all this happen through incremental improvements to the current system? And why haven’t more startups been able to scale? To fully understand why we’re starting to see such dramatic change, it’s worth unpacking how we got here in the first place.\n The popular narrative for why “it’s expensive to be poor” is that large banks are to blame for high fees and a lack of product innovation. To some extent, that’s true. But classic financial services institutions also face structural problems due to legacy tech and the burden of a physical footprint.\n Banks have been under pressure for some time, especially as consumers have moved online. Most of these institutions have existed for decades — centuries, in some cases — by acquiring customers in physical branches. The bank then owned that person’s full financial lifecycle: from first checking account to first credit card, first brokerage account to first mortgage, and so on. In the age of ecommerce, however, banks no longer have that same relationship with their customers. Instead, consumers can choose their financial services from several different providers online.\n Then the financial crisis hit. Well-intended regulations such as the   Durbin amendment  (part of Dodd-Frank) limited transaction fees on debit swipes, the theory being that if merchants paid less in interchange they would pass on savings to consumers in the form of lower prices. These regulations were meant to help merchants and spur economic activity, but they significantly reduced revenue for large banks. Some estimated a revenue drop of   over $6 billion a year  — no small hit to absorb! To make up for those losses, many banks banished free checking, increased minimum balances, and raised overdraft fees. Ironically, the Durbin amendment had an adverse effect on the consumers it was intended to help. Since most Americans live paycheck to paycheck, these seemingly incremental banking fees significantly impact their lives.\n For banks, raising fees was much easier and faster than lowering the hard, fixed costs of physical branches and associated staff. On top of that, existing software infrastructure can seem like a bottomless money pit: Banks keep incrementally adding and patching fixes for new compliance rules on top of older, hard-to-change systems, leading to a tangled, spaghetti-like mess of software. At some of the larger banks,   75 percent of the IT  budget goes toward maintenance. Beyond software, there’s a large manual labor force.  Ten  to 15 percent of the workforce  at larger banks is devoted solely to compliance. Citigroup alone had 30,000 of its 204,000 employees working in compliance last year,  largely devoted to tasks like manually reviewing alerts triggered by anti-money laundering (AML) systems and filing suspicious activity reports.\n Many of these maintenance and compliance costs are passed along to customers in the form of higher fees. Those costs leave little room in the budget for innovation. In other industries, startups could typically come in with fresh approaches and better technology. But in financial services, getting a fintech company going under the current conditions is   hard , requiring multiple partnerships, entrenched financial-industry insider knowledge, and established connections and capital.\n Here’s  what it would take to launch a new “bank” that offers just two basic financial services products, a checking account and a debit card:\n The new bank obviously needs to comply with regulation. In the US, this is most often achieved by finding a sponsoring bank partner. (This tactic is much faster and has a higher likelihood of success than applying for a license.) A regulated bank agrees to “lend” the new bank its license in exchange for a financial cut of whatever the new bank is offering. Typically, that means the sponsoring bank gets more deposits without having to pay to acquire those customers.\n F or a startup, finding the right sponsor bank partner is difficult: There’s no directory of these banks to identify potential partners and contacts.\n While the sponsoring bank does get the benefit of more business (e.g., more deposits), it also carries additional risk. It must ensure that the startup properly complies with KYC (Know Your Customer), AML (Anti Money Laundering), and so on. Given this risk, when approached by potential fintech startups, how does a bank thoughtfully and efficiently evaluate a startup partner?\n After a startup decides to partner, there’s still much more time and effort involved to build out the rest of the product. There needs to be a card processor (more negotiation, more costs); a card issuer or relationship with a card network (like a Visa or MasterCard); a card printer (more back-and-forth); some way to hook into other bank accounts for data; a way for consumers to make payments; vendors to help with compliance; and so on and on and on.\n Under this system, it’s hard for existing banks to get better, it’s hard for new banks to get started, and it’s hard for them to partner with each other, even when incentives are aligned.\n  Today, technology allows innovative new companies to be created and enables existing banks to better serve the needs of customers. Specifically, that’s happening through (1) new financial-services infrastructure companies providing  APIs  (application programming interfaces); (2)  new distribution channels  that enable better, differentiated products to spread more easily and at lower customer acquisition cost; and (3)  better data  that allows companies to assess and assign risk more precisely.\n First, the infrastructure: We are at the beginning of a growing ecosystem of banking infrastructure companies — an “  API economy ” — that both startups   and  incumbents can draw on. These Lego-like companies specialize in building and providing specific building blocks for banking (for instance, KYC/AML compliance). By providing  APIs  to their services, the companies democratize their expertise. This means that any one company doesn’t have to know every single thing there is to know about complex regulations; another company that specializes in that area has created an API for others to use. It also means that it’s easier to create new financial services companies of all sizes and of all kinds. Rather than having to build or maintain regulatory systems themselves, they can just “plug in” to that expertise.\n Not only are new entrants using this software infrastructure to get started faster and more cheaply, incumbents are beginning to augment, or even replace, some of their legacy systems. Instead of going the way of other brick-and-mortar retailers — many of which either went out of business or became glorified showrooms for ecommerce — the beauty of the API economy for banking is that it lets everyone participate, play to their strengths, and concentrate on their core offering. The demand for better and more inclusive financial services is big enough that there’s room for many players in the market to succeed as large, stand-alone companies. All of this results in better products at less cost, serving a wider range of consumers.\n This also means that almost any company can offer banking services. Whereas existing consumer services used to have only two options to monetize — either charge for the product or sell advertising — now, companies can layer on financial products. What if your ridesharing app became your bank and you could pay for goods as frictionlessly as you hop in a car? What if your favorite gaming company or streaming service or consumer product becomes a beloved financial services company, thanks to tech? Or hell, what if your toothbrush company  could  offer  you… dental insurance?\n Seem far-fetched? It’s not. The thing that excites me most about this future is that it can unlock new services   for banking the unbanked ,  built by entrepreneurs who come from the very communities they are trying to serve , whether geographically or through   personal experience.  The people who understand the problems in their communities will likely build products that better serve them: Who better to build banking services for those on food stamps than   entrepreneurs who grew up on food stamps ?\n The key is that today, better products can spread more easily and cheaply thanks to  new distribution channels  like messaging and social media, as well as through the non-fintech brands you  already  use, resulting in lower customer acquisition costs (CAC). A product that is exponentially better than the status quo could spread by referral, creating an organic-growth cost advantage for the company. If the company doesn’t have a high fixed cost structure, then they don’t have to recoup their costs through high fees, thus expanding the range of customers that it can serve. Luckily, the bug that limits better service in the legacy system — in which banks are incentivized to recoup their customer acquisition investment through higher fees — becomes a   feature  for newer companies, which have low cost structures and efficient distribution strategies.\n Great technology shifts aren’t just about fixing existing problems, though, They’re also about   opening access to help more people . This is where  data  is the last piece of the puzzle: Through sophisticated data science and machine learning, we can now unlock more data sources to better assess risk for people who lack sufficient data or are “credit invisible” in the current system. Today, 79 million Americans have credit scores below 680 (the point at which rates can dramatically increase) and   53 million  don’t have enough data to even generate a FICO score. Most banks will assume those people are high-risk and charge them higher interest rates (or not serve them at all)  by default . Yet we’re swimming in much more, far superior data (  not just 5 factors! ) than when these credit-assessment systems were invented.\n Data science and machine learning can also help us understand the best signals for determining one’s willingness and ability to pay. New experiments in assessing credit-worthiness — such as monitoring rent and cell-phone payments, as well as   cash-flow underwriting  — have been promising. Globally, companies are using even more creative data types to effectively predict loan repayment, such as how up-to-date your phone operating system is, the number of friends you message with regularly, and even whether you charge your phone fully at night.\n People who were previously hard to gauge now become new customers. When more people have access to fair credit, income inequality declines, spurring opportunity and economic growth.\n Such data shifts affect not only how money flows around debt, but around income, too. What if people could get paid sooner, instead of having to wait two weeks? Reliable workers (whether salaried or hourly) who are falling short on cash before payday should be able to get access to their earnings for work they have already completed. With data, we know when you’ve worked, what you’ve already earned, and can offer this service. The current model disproportionately punishes the poor. A shortfall before payday means they have to engage with the more sometimes pernicious payday players. Some states tried to solve this problem by using   lending caps  to discourage payday lending at usurious rates, but the unintended outcome is that the people who need it most now have access to…nothing. It’s another example of good intentions, misapplied. But software can flow around the hard limits of legacy models, better aligning intentions and desired results.\n  The first wave of fintech companies 10 years ago proved that physical locations aren’t a requirement for banking. Now, the next wave is unlocking the rest of the infrastructure required for building better financial services — banking licenses, payment processors, regulatory compliance, and so on. Previously companies would have had to painstakingly acquire or partner (slow and expensive!), build from the ground up (also slow and expensive!), and figure out a patchwork of compliance and IT (still slow and very expensive!). New financial services companies can leverage best-of-breed infrastructure, create differentiated products that help lower customer acquisition costs, and draw on better data sources to serve many, many more people.\n Software not only lets us bypass hard structural problems, it lets us build entirely new kinds of companies and services.  All of this is to say:   fintech is eating the world .\n The banking system today favors the privileged, while large swaths of the population have no options at all. Technology lets financial services players of all kinds innovate beyond the constraints of the existing systems to better reflect the world we live in. Instead of chipping away at deeply ingrained inefficiencies, we can use its very structural limits to build new kinds of companies from the ground up. We can do better than a two-tier system. It shouldn’t be expensive to be poor. And as more people enter the economy by getting plugged into better financial services,   everyone  wins.", "posttime": "2020-10-19 15:14:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "成为,company,银行", "title": "为什么每个公司都会成为金融科技公司", "title_en": "Why Every Company Will Be a Fintech Company", "transed": 1, "url": "https://a16z.com/2019/11/21/banking-on-the-future/", "via": "", "real_tags": ["成为", "company", "银行"]}, {"category": "", "categoryclass": "", "imagename": "7da564c33140a5730586ed85b31cfe3b.jpg", "infoid": 1029729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "观景廊-3张图片一个多世纪以来，钢筋一直是加固混凝土的首选材料，但一种新的方法有望使这种常见的建筑材料变得更坚固和更环保。科学家们利用3D打印来生产一种聚合物晶格结构，这种结构可以作为低碳混凝土的主干，同时也具有很高的强度和耐久性。\n这项研究是在加州大学伯克利分校(University of California，Berkeley)进行的，建立在之前使用聚合物纤维加固混凝土的努力基础上。这种钢筋大约在半个世纪前出现，是钢筋的一种有前途的替代品，钢筋强度很高，但重量大，价格昂贵，而且随着时间的推移会退化。\n另一方面，聚合物纤维重量轻，生产成本低，而且耐腐蚀。目前的方法是在浇筑混凝土之前将这些纤维混合到混凝土中，但这可能会导致分布不均匀，这意味着最终结构的某些部分更坚固，其他部分容易出现裂缝。\n这项新研究背后的工程师试图通过3D打印的八位组聚合物晶格来解决这一缺点，这种结构因其独特的轻盈和强度组合而受到青睐，其中一个人希望通过密集的桁架排列来防止裂缝形成。研究小组发现，成功地使用丙烯腈丁二烯苯乙烯(ABS)聚合物来生产格子，然后用超高性能混凝土填充缺口，就抗压而言，超高性能混凝土的强度是普通混凝土的四倍。\n研究人员试验了这个配方的不同版本，使用不同版本的聚合物晶格，它们从混凝土总体积的19.2%到高达33.7%不等。虽然这些调整带来了抗压强度和峰值荷载方面的微小变化，但混凝土的整体力学性能基本保持不变。\n该研究的合著者、土木与环境工程学教授克劳迪娅·奥斯特塔格(Claudia Ostertag)说：“当一种材料变脆时，它可以承受一定的峰值载荷，然后就会失效。”“在这种情况下，我们没有观察到那次失败。它变得越来越强。对于我们对混凝土感兴趣的人来说，这是令人惊叹的。你正在把非常易碎的东西渲染成非常延展性的东西。“。\n所有被测样品的应变密度值都很高，因此能够吸收大量的能量，而晶格结构较薄的样品与晶格结构较厚的样品一样坚韧。这一部分是该研究项目的总体目标之一的关键；使用更高浓度的替代材料来减少混凝土制造的碳足迹，混凝土制造占世界二氧化碳排放量的8%。\n“产生水泥的反应本身就会产生二氧化碳，”该研究的合著者海登·泰勒(Hayden Taylor)说。相比之下，通过使用生物聚合物、回收利用和可再生能源，有一条可以想象的路线，可以获得净碳中性甚至潜在的碳负向聚合物。\n从这里开始，研究小组计划用不同的晶格形状进行实验，看看不同的几何形状是否可以服务于不同的用途。\n“展望未来，我最大的问题是如何为特定的应用选择最佳的晶格结构，”主要作者布莱恩·萨拉扎(Brian Salazar)说。“可能还有更理想的几何结构等待着我们去寻找。”\n查看图库-3张图像", "note_en": "View gallery - 3 images   For over a century, steel rebar has been the go-to material to reinforce concrete but a new approach promises to make the common building material stronger and more environmentally friendly. Scientists have leveraged 3D printing to produce a polymer lattice structure that can act as the backbone for low-carbon concrete that also boasts great strength and durability.\n The research was conducted at the University of California, Berkeley and builds on previous efforts to reinforce concrete using polymer fibers. This emerged around half a century ago as a promising alternative to steel rebar reinforcements, which offer great strength but are heavy, expensive and degrade over time.\n Polymer fibers, on the other hand, are lightweight, cheap to produce and are resistant to corrosion. Current approaches involve mixing these fibers into the concrete before it is poured, but this can lead to an uneven distribution meaning some parts of the final structure are stronger and others are susceptible to cracks.\n The engineers behind this new study sought to address this shortcoming with a 3D-printed octet polymer lattice, a structure favored for its unique combination of lightness and strength, and one hoped to prevent cracks from forming through a dense arrangement of trusses. The team found success using acrylonitrile butadiene styrene (ABS) polymers to produce the lattice, with the gaps then filled with ultra-high-performance concrete, which is four times stronger than regular concrete in terms of compression.\n The researchers experimented with variations of this recipe, using different versions of the polymer lattice so that they ranged from 19.2 percent of the overall volume of the concrete to as much as 33.7 percent. While these tweaks brought about small changes in terms of compressive strength and peak loads, the overall mechanical properties of the concrete remained largely the same.\n “When a material is brittle, it can hold up to a certain peak load and then it fails,” says study co-author Claudia Ostertag, professor of civil and environmental engineering. “In this case, we did not observe that failure. It got stronger and stronger. For us interested in concrete, this is amazing. You are rendering something very brittle into something very ductile.”\n All of the samples tested scored high in strain density values and are therefore able to absorb a lot of energy, while those with thinner lattice structures were just as tough as those with the thicker ones. This part is key to one of the overarching aims of the research project; using higher concentrations of alternative materials to reduce the carbon footprint of concrete manufacturing, which accounts for eight percent of the world’s CO2 emissions.\n “The reaction that produces cement inherently produces CO2,” says study co-author Hayden Taylor. “In contrast, there is a conceivable route toward polymers that are net carbon-neutral or even potentially carbon-negative through the use of biopolymers, recycling and renewable energy sources.”\n From here, the team plans to experiment with different lattice shapes to see if different geometries can serve different uses.\n “Going forward, my biggest question is how to choose the best lattice structure for a particular application,” says lead author Brian Salazar. “There could be even more optimal geometries waiting to be found.”\n   View gallery - 3 images", "posttime": "2020-10-19 14:35:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "格栅,concrete,混凝土", "title": "用聚合物格栅增强低碳混凝土保持强度", "title_en": "Low-carbon concrete stays strong with polymer lattice reinforcements", "transed": 1, "url": "https://newatlas.com/materials/low-carbon-concrete-strong-polymer-lattice-reinforcements/", "via": "", "real_tags": ["格栅", "concrete", "混凝土"]}, {"category": "", "categoryclass": "", "imagename": "c3a445836064069f2ad57496e87f5ed2.jpg", "infoid": 1029727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克里斯·拉特纳(Chris Lattner)是一位世界级的软件和硬件工程师，领导着苹果、特斯拉、谷歌和SiFive的项目。请通过检查您的博客来支持此播客。", "note_en": "Chris Lattner is a world-class software & hardware engineer, leading projects at Apple, Tesla, Google, and SiFive. Please support this podcast by checking ou...", "posttime": "2020-10-19 14:35:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,计算,lattner,chris", "title": "克里斯·拉特纳：计算和编程语言的未来--莱克斯·弗里德曼", "title_en": "Chris Lattner: The Future of Computing and Programming Languages – Lex Fridman", "transed": 1, "url": "https://www.youtube.com/watch?v=nWTvXbQHwWs", "via": "", "real_tags": ["编程", "计算", "lattner", "chris"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029726, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，您可以将JSON webhooks从任何地方定向到mailinator.com。Mailinator一直以电子邮件闻名，但实际上支持SMS已经有几年了。Mailinator现在允许任何人直接将他们的网络挂钩发布到公共(即免费)Mailinator系统中。\n以这种方式到达的邮件将像电子邮件一样到达目标收件箱。当然，传入的WebHook将保留其原始形式，并可通过单击收件箱页面上的链接来查看。这也很简单！以下是URL：\n将JSON数据发送到该URL会将该数据注入相应的Mailnator收件箱。下面是一个完整的curl命令，现在就可以试用一下：\nCurl-v-d&#39；{&#34；from&#34；：&#34；MyMailinatorTest&#34；，&#34；主题&#34；：&#34；测试消息&#34；，&#34；文本&#34；：&#34；hello world&#34；，&#34；到&#34；：&#34；杰克&#34；}&#39；-H&#34；内容类型：应用程序/json&#34；-X POST&#34；Https://www.mailinator.com/api/v2/domains/public/webhook/bob/&#34；\nMailinator将接受来自任何地方的网络挂钩(您的自定义网络挂钩、zapier、ifttt…。只要你能说出它的名字！)。但是，我们正在添加对一些更流行的发送WebHook的服务的直接地图支持。Twilio已经启动并运行，只需要对url稍作修改：\n对于Mailinator订阅者，该功能更加深入。首先，您可以像您预期的那样将WebHook发布到您的私有域。此外，传入的WebHook享受Mailinator私有消息的所有优势，包括通过Web或API访问，以及通过Mailinator规则系统执行。\n通过将您的SMS消息通过网络连接到您的专用域中，您的自动化测试现在有了一站式服务(只有一个您已经习惯的API)，可以访问组成您的消息工作流的传入消息。\n我们对这一新功能感到很兴奋，也很想看看我们的客户会用它做些什么！\n您可以在我们针对公共系统和私有系统的文档中找到有关该功能的更多信息。", "note_en": "You can now direct JSON webhooks from anywhere to Mailinator.com. Mailinator has always been known for email but has actually supported SMS for several years.Mailinator now allows anyone to post their webhooks directly into the Public (i.e. FREE) Mailinator system.\n Messages that arrive this way will arrive in the destination inbox just as an email would. Of course, incoming webhooks will retain their original formand are visible by clicking the link on the inbox page. It’s easy too! Here’s the URL:\n  Posting JSON data to that url will inject that data into the respective Mailnator inbox. Here’s a full curl command to try it out right now:\n curl -v -d &#39;{&#34;from&#34;:&#34;MyMailinatorTest&#34;, &#34;subject&#34;:&#34;testing message&#34;, &#34;text&#34; : &#34;hello world&#34;, &#34;to&#34; : &#34;jack&#34; }&#39;-H &#34;Content-Type: application/json&#34;-X POST &#34;https://www.mailinator.com/api/v2/domains/public/webhook/bob/&#34;\n   Mailinator will accept webhooks from anywhere (your custom webhooks, Zapier, IFTTT … you name it!) but, we’re adding direct mapping support for some more popular services that send webhooks. Twilio is up and running already and just requires a small modificationto the url:\n   For Mailinator subscribers, the functionality goes deeper. Firstly, you can publish webhooks to your Private Domain as you’d expect. In addition, incoming webhooks enjoy allthe advantages of private messages with Mailinator including access via Web or API, and execution through the Mailinator Rule System.\n By webhooking your SMS messages into your Private Domain, your automated tests now have a one-stop-shop (with just one API you’re already used to), to access the incoming messagesthat make up your Message Workflow.\n We’re excited about this new feature and excited to see what our Customers will do with it !\n You can find more information about the feature in our documentation for both the Public and Private systems.", "posttime": "2020-10-19 14:35:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webhooks,send,webhook", "title": "不仅仅是电子邮件，还可以将您的(Twilio)Webhooks发送给Mailinator", "title_en": "Not Just Email, Send Your (Twilio) Webhooks to Mailinator", "transed": 1, "url": "https://manybrain.github.io/m8r_blog/blog/send-your-webhooks/", "via": "", "real_tags": ["webhooks", "send", "webhook"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "←之前的版本", "note_en": "← Previous", "posttime": "2020-10-19 14:34:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,游戏,版本", "title": "游戏编程模式", "title_en": "Game Programming Patterns", "transed": 1, "url": "http://gameprogrammingpatterns.com/contents.html", "via": "", "real_tags": ["编程", "游戏", "版本"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1029720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "水银温度计是由荷兰物理学家丹尼尔·加布里埃尔·费伦海特于1714年左右发明的，它由一个狭长的玻璃管组成，管子底部有一个灯泡，里面装着水银。汞的体积随着温度的变化而变化；随着温度的上升，汞被驱赶出灯泡，并上升到管子上。来源：维基百科关于玻璃水银温度计的文章图片来源：Donar Reiskoffer，Wikimedia Commons。\n90厘米高的Clebsch双三次曲面，由树脂和纤维制成。它包括位于曲面内部的所有线。另请参阅我们1880年的条目-克莱恩的数学石膏模型，以了解由石膏制成的早期版本。资料来源：Cayetano Ramirez.cobratano.com(另类网站)Cayetano Ramirez(2006)透明Clebsch表面的创建过程。\n“数字制造”代表了一种将数据转化为形式的设计方法。5英尺高的雕塑是物理的和互动的(声音，光)。该表格表示我们机构的使用年限，显示随时间变化的情况。这首曲子也可以通过简单的手向上或向下移动来“演奏”，释放52个声和弦和光效果-所有这些都与数据绑定在一起。一起，雕塑[…]。\n布莱特湖(Lake Brite)是一个数据可视化项目，允许公众通过7500个LED的显示器了解尚普兰湖。从温度统计到动物生活，布莱特湖将鼓励互动和数据素养，将尚普兰湖健康的共同事业周围的每个人联系起来。资料来源：Echo，尚普兰湖Leahy中心；www.echo vt.org/lakebrite。\n国家地理和天空海洋风险投资海洋塑料创新挑战赛的获胜者[该项目]以海滩垃圾为突出例子，突出了塑料问题的范围(就产量和命运而言)和塑料在其生命周期中的转变。情境、参与式数据安装方法将数字的抽象显示扩展到更吸引人的[…]形式", "note_en": "The mercury thermometer was invented by Dutch physicist Daniel Gabriel Fahrenheit in 1714. It consists of a narrow glass tube with a bulb at the bottom, containing mercury. The volume of mercury changes with temperature; mercury is driven out of the bulb and up the tube as the temperature rises. Sources: Wikipedia article on Mercury-in-glass thermometer Image Credit: Donar Reiskoffer, Wikimedia Commons\n                                                                                                                                                                                                  A 90 cm tall Clebsch bicubic surface hand made in resin and fiber. It includes all lines lying inside the surface. Also see our entry 1880 – Klein’s Mathematical Plaster Models for an earlier version made of plaster. Sources: Cayetano Ramirez. obratano.com (alternative website) Cayetano Ramirez (2006) Creation process for the transparent Clebsch surface.\n                                                                                                                                                                                                                                                                                                  “Made By Numbers” represents a design methodology that translates data into form. The 5′ high sculpture is physical and interactive (sound, light). The form expresses the year-in-the-life of our agency, showing changes over time. The piece can also be “played” via a simple hand movement up or down, releasing 52 sonic chords and light effects – all tied to the data. Together, the sculpture   […]\n                                                    Lake Brite is a data visualization project which allows the public to learn about Lake Champlain through a display of 7,500 LED’s. From temperature statistics to animal life, Lake Brite will encourage interaction and data literacy, connecting everyone around the common cause of Lake Champlain health. Sources: ECHO, Leahy Center for Lake Champlain; www.echovt.org/lakebrite\n                                                                                                                                    Winner of the National Geographic and Sky Ocean Ventures Ocean Plastic Innovation Challenge [This project] highlights the scope of the plastic problem (in terms of amount produced as well as its fate) and the transformation of plastic over its lifetime, using beach debris as a salient example. The situated, participatory data installation approach extends abstract displays of numbers towards a more gripping form of   […]", "posttime": "2020-10-19 14:33:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "可视化,物理,physical,来源", "title": "物理可视化", "title_en": "Physical Visualizations", "transed": 1, "url": "http://dataphys.org/list/", "via": "", "real_tags": ["可视化", "物理", "physical", "来源"]}, {"category": "", "categoryclass": "", "imagename": "30c9af87d0f9f6a7ee72045696d5f37b.jpg", "infoid": 1029719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Zapps将同类最佳的应用程序引入Zoom体验，以实现无缝的工作效率和引人入胜的体验。", "note_en": "Zapps bring best of breed applications into the Zoom experience for seamless productivity and engaging            experiences.", "posttime": "2020-10-19 14:33:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,zapps,apps,体验", "title": "Zapps(缩放中的应用程序)", "title_en": "Zapps (Apps in Zoom)", "transed": 1, "url": "https://zoom.us/docs/en-us/zapps.html", "via": "", "real_tags": ["程序", "zapps", "apps", "体验"]}]