[{"category": "", "categoryclass": "", "imagename": "a91935f4e00bef4fe551da144361f428.jpg", "infoid": 1068303, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "伊隆麝香＆＃39; s spacex是＆＃34;七月拍摄＆＃34;为了推出其Starship Rocket的第一个轨道空间，公司总裁Gwynne Shotwell周五表示。\n ＆＃34;我希望我们成为它，但我们都知道这很困难，＃34; Shotwell说，在国家空间协会和虚拟国际空间开发会议上发表演讲。\n 该公司在5月份展示了该航班的计划，该计划将从公司发射德克萨斯州的设施，并旨在从夏威夷的海岸飞溅。\n 伊隆麝香＆＃39; s spacex是＆＃34;七月拍摄＆＃34;为了推出Starship Rocket的第一个轨道空间，Gwynne Protwell总裁星期五表示。\n ＆＃34;我希望我们成为它，但我们都知道这很困难，＃34; Shotwell说，在国家空间协会和虚拟国际空间开发会议上发表演讲。\n  ＆＃34;我们真的在飞行那个系统的尖端，或者至少尝试那个系统的第一个轨道飞行，真正在近期术语中，＆＃34;散步添加。\n 在过去的一年中，SpaceX在过去的一年中进行了多次短暂的测试飞行飞行型原型，但到达轨道代表了测试火箭的下一步。该公司在5月份展示了该航班的计划，该计划将从公司发射德克萨斯州的设施，并旨在从夏威夷的海岸飞溅。 \nStarship原型矗立在160英尺高，或围绕一座16层建筑的大小，并由不锈钢建造 - 代表麝香的火箭早期版本在2019年。火箭最初在A＆＃34上发射;超重＆＃34;助推器，它构成了火箭的下半部分，高耸230英尺高。在堆放发射时，星舰和超重将近400英尺高。\n  该公司正在开发出发的星舰，在月球和火星上发布货物和人员。\n 虽然Spacex＆＃39; Flcon 9和Falcon重型火箭的舰队是部分可重复使用的，麝香＆＃39;目标是使Starship完全可重复使用 - 设想一个更像是商业飞机的火箭，在哪里飞行时期短的周转时间唯一的主要成本是燃料。\n  ＆＃34;我认为人们真的甚至会理解这个系统要做的事，＆＃34; Shotwell说。\n 她强调麝香＆＃34;感觉令人震惊的匆忙＆＃34;开发STARSHIP和CREATION＆＃34;一个持续的能力，将人们带到月球和火星。＆＃34;\n ＆＃34;这意味着它＆＃39;不是每两年一次的一艘船，对吗？当您能够让人们送到火星时，我们必须能够在时间范围内飞行数十艘船;散步添加。\n 拥有CNBC Pro的智慧投资者。获取股票选秀权，分析师电话，独家访谈和进入CNBC电视。立即注册以开始免费试用。 ", "note_en": "Elon Musk&#39;s SpaceX is &#34;shooting for July&#34; to launch the first orbital spaceflight of its Starship rocket, company president Gwynne Shotwell said on Friday.\n &#34;I&#39;m hoping we make it, but we all know that this is difficult,&#34; Shotwell said, speaking at the National Space Society&#39;s virtual International Space Development conference.\n The company in May revealed its plan for the flight, which would launch from the company&#39;s facility in Texas and aim to splash down off the coast of Hawaii.\n Elon Musk&#39;s SpaceX is &#34;shooting for July&#34; to launch the first orbital spaceflight of its Starship rocket, company president Gwynne Shotwell said Friday.\n &#34;I&#39;m hoping we make it, but we all know that this is difficult,&#34; Shotwell said, speaking at the National Space Society&#39;s virtual International Space Development conference.\n  &#34;We are really on the cusp of flying that system, or at least attempting the first orbital flight of that system, really in the very near term,&#34; Shotwell added.\n SpaceX has conducted multiple short test flights of Starship prototypes over the past year, but reaching orbit represents the next step in testing the rocket. The company in May  revealed its plan for the flight, which would launch from the company&#39;s facility in Texas and aim to splash down off the coast of Hawaii.\n Starship prototypes stand at about 160 feet tall, or around the size of a 16-story building, and are built of stainless steel – representing the early version of  the rocket that Musk unveiled in 2019. The rocket initially launches on a &#34;Super Heavy&#34; booster, which makes up the bottom half of the rocket and stands about 230 feet tall. Together, Starship and Super Heavy will be nearly 400 feet tall when stacked for the launch.\n  The company is developing Starship to launch cargo and people on missions to the moon and Mars.\n While SpaceX&#39;s fleet of Falcon 9 and Falcon Heavy rockets are partially reusable, Musk&#39;s goal is to make Starship fully reusable — envisioning a rocket that is more akin to a commercial airplane, with short turnaround times between flights where the only major cost is fuel.\n  &#34;I don&#39;t think that people really have even comprehended what that system is going to do,&#34; Shotwell said.\n She emphasized that Musk &#34;feels in a huge hurry&#34; to develop Starship and create &#34;a sustaining capability that will take people to the Moon and Mars.&#34;\n &#34;That means it&#39;s not one ship every two years, right? We have to be able to fly dozens of ships during the timeframe when you can get people to Mars,&#34; Shotwell added.\n Become a smarter investor with    CNBC Pro .  Get stock picks, analyst calls, exclusive interviews and access to CNBC TV.   Sign up to start a    free trial today  .", "posttime": "2021-06-26 03:29:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "星舰,aims,火箭", "title": "Spacex旨在在7月推出第一个轨道星舰航班 ", "title_en": "SpaceX Aims To Launch First Orbital Starship Flight in July", "transed": 1, "url": "https://www.cnbc.com/2021/06/25/spacex-aims-to-launch-first-orbital-starship-flight-in-july.html", "via": "", "real_tags": ["星舰", "aims", "火箭"]}, {"category": "", "categoryclass": "", "imagename": "890072afb1ab5d5e5cea6e46b2003b71.jpg", "infoid": 1068302, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "©2020财富媒体IP Limited。 版权所有。 使用本网站构成接受我们的使用条款和隐私政策| CA通知收集和隐私声明| 不要出售我的个人信息| Ad Coolices财富是Fortune Media IP Limited的商标，在美国和其他国家/地区注册。 财富可能会收到本网站上的产品和服务的某些链接赔偿。 优惠可能如有更改，恕不另行通知。 引用延迟至少15分钟。 互动数据提供的市场数据。 ETF和Morningstar，Inc。提供的互联网数据Dow Jones术语＆amp; 条件：http：//www.djindexes.com/mdsidx/html/tandc/indexestandcs.html。 S＆amp; P索引数据是Chicago Mercantile Exchange Inc.及其许可方的财产。 版权所有。 条款＆amp; 使适应。 由交互式数据托管解决方案提供支持和实现。 ", "note_en": "© 2020 Fortune Media IP Limited. All Rights Reserved. Use of this site constitutes acceptance of our  Terms of Use and  Privacy Policy |  CA Notice at Collection and Privacy Notice |  Do Not Sell My Personal Information |  Ad Choices  FORTUNE is a trademark of Fortune Media IP Limited, registered in the U.S. and other countries. FORTUNE may receive compensation for some links to products and services on this website. Offers may be subject to change without notice. Quotes delayed at least 15 minutes. Market data provided by  Interactive Data. ETF and Mutual Fund data provided by  Morningstar, Inc. Dow Jones Terms &amp; Conditions:  http://www.djindexes.com/mdsidx/html/tandc/indexestandcs.html. S&amp;P Index data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved.  Terms &amp; Conditions. Powered and implemented by  Interactive Data Managed Solutions.", "posttime": "2021-06-26 03:28:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "免费,比特币,公民,salvador,数据", "title": "萨尔瓦多正在向公民提供免费比特币 ", "title_en": "El Salvador is Giving Away Free Bitcoin To Its Citizens", "transed": 1, "url": "https://fortune.com/2021/06/25/bitcoin-en-el-salvador-free-stimulus-check/", "via": "", "real_tags": ["免费", "比特币", "公民", "salvador", "数据"]}, {"category": "", "categoryclass": "", "imagename": "05ab48761fa20dc288cbd8f098965464.jpg", "infoid": 1068300, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "传统上，我们认为Windows作为群众的操作系统，并且每个新版本都是一个无意识的升级，即使是具有较旧的PC的人。现在，在市场上六年后，Windows 10占2009年（12年前的Windows 7的Windows 7所有Windows的78％）（12年前！）占地16％。 Windows 10快速增长，因为绝对没有理由不升级。它适用于运行Windows 7或8的每台PC，它是免费的（看如何免费或便宜地获得Windows 10），它有一系列新功能。\n  微软没有让Windows 10免费升级，只是善良。该公司希望花时间支持最新的操作系统，它希望人们使用Microsoft Store和Edge浏览器等功能。它希望开发人员使用最新的SDK来制作有助于平台的突破性应用程序。\n  但是Windows 11改变了所有的，留下了大量的Windows 10计算机 - 即使是从寒冷中的三年前甚至高端工作站即使是高端工作站也是因为它们不会满足最低要求，这对此有所改变自从Windows 7于2009年推出以来首次。公平，这些新的要求，特别是TPM模块（更详细的产品）和DX12 GPU，旨在提供比我们之前所见的更高的最小安全性和性能基线。微软甚至似乎它期望长时间留在当前的操作系统上，最近宣布计划支持Windows 10到2025。\n 这是Microsoft的海洋变革，因为该公司以前已经优先考虑了几乎没有其他的新操作系统。事实上，当需要两年时间超过预期的Windows 10达到10亿活跃的每月设备时，该公司可能会失望。使用Windows 11，它将花费更长，并且与Android设备一样，可能会更多运行旧操作系统的计算机比最新的操作系统多年来一直到来。这对用户和开发人员来说是坏消息。\n   这些新的最低要求乍看之下看起来不太奋斗。根据分析师公司NPD的副总裁Stephen Baker，在去年的销售中不到4％的PC有74GB或更小的存储驱动，并且少于4GB的系统量是“无关紧要的。换句话说，几乎所有2020年代新的PC都会适合账单，即使他们没有＆＃39; T有最好的SSD。\n  但是，大多数人每年都不买新的电脑。事实上，根据贝克的说法，计算机的平均更换周期为4至5年。而且我相信我们都认识人们或者在我们的家中拥有计算机的计算机。\n 您可能会认为受这些变化影响的唯一计算机是戴尔Inspiron 3000系列（大约2018年）和亚马逊vivobooks等上网本或200美元的笔记本电脑，其中一些拥有2GB的RAM和32GB的存储空间。但是，即使是2018年出现的主要工作站CPU也可能无法运行Windows 11。 \n英特尔的Xeon W-3175x，于2018年第29季度推出，以2999美元，体育16核心不带内置TPM支持。您可以在事实之后购买具有TPM标题的主板，并在此事实后添加TPM芯片，但默认情况下许多系统都没有这个。很难争辩说，在不到三年前的大量HEDT（高端桌面）不应该能够运行Windows 11。\n   大多数用户的问题不是RAM，存储或GPU要求，但需要TPM 2.0，大多数消费者的特征甚至不知道在几年前的许多计算机上并不是禁用的在很多当前的系统上。\n 可信平台模块（TPM）提供了存储加密密钥，证书和其他敏感数据的安全方法。例如，如果您使用BitLocker加密，TPM就是阻止某人能够删除硬盘驱动器，将其粘在另一台计算机上并读取数据。\n  “未来的个人电脑需要这种现代硬件的根本信任，以帮助保护像赎金软件等普通和复杂的攻击，以及来自国家的更复杂的攻击。要求TPM 2.0通过要求内置的信任来提升硬件安全标准。“\n 并且，公平，TPM 2.0很难全新。从2016年开始，Microsoft要求“所有新设备型号，线路或系列”设备具有TPM 2.0，默认实现和启用。然而，显然，只适用于公司合作伙伴制作OEM笔记本电脑和台式机的合作伙伴，因为许多当前的主板默认情况下禁用TPM，并且一些最近的高端芯片没有船上没有它。好消息是，如果你有一个从过去三到五年的处理器，你可以在UEFI BIOS中启用TPM并解决这个问题。\n  但在这里的边界线上可能有很多PC，没有TPM能力。高级作家Michelle Ehrhardt报告说，她在2016年买的核心I7-6700K在主板BIOS中没有TPM选项，所以她可能没有运气。一些主板提供了添加物理TPM模块作为升级的能力，但谁将这样做？\n Microsoft的兼容CPU列表留下了任何比第8岁的英特尔处理器，以及比Ryzen 2000系列旧的任何AMD CPU（第一个Gen Ryzen不在列表中）。但是，Microsoft发言人表示，列出了这些CPU，因为它们具有TPM，因此，如果您有一个未在列表上的CPU并且通过固件或通过硬件升级芯片支持TPM，Windows 11将安装。 \n据Microsoft说，如果你没有TPM，你根本就无法安装Windows 11.根据Microsoft的兼容性Doc，TPM 2.0要求是一个“软的楼层”，Windows 11将警告你不是一个好的安装的想法和下面的“硬地板”，您无法安装Windows 11，所有人都有TPM 1.2（很多人仍然没有）。有了任何一层，您需要启用某种类型的TPM，您需要在本机UEFI代码中使用BIOS启用安全启动，而不是兼容性或传统模式。\n 另请注意，不会有32位窗口。因此，如果您有一个带有32位处理器的旧上网本，则无法运行Windows 11。\n  如果Windows 10只需要DirectX 9支持，Windows 11要求GPU处理DirectX 12. DirectX 9是在Windows 98，ME和XP上首次亮相时一直回到2002的标准，但版本12只有2015年。\n 现在，要公平，NVIDIA GPU是Fermi（GTX 400），AMD芯片像图形核心一样旧（Radeon 7000）和集成的英特尔图形回到哈尔韦尔（2013）与DirectX 12一起工作。但是如果您正在考虑在Viliv N5 UMPC上抛出Windows 11，那么在2010年的低功耗原子处理器上运行的矿井的个人最受欢迎的，您就会运气。\n  在某些时候，微软将停止支持真正旧的硬件，并且由大多数帐户都停止支持，Windows 11的最低要求是真正最小的。然而，TPM的要求本身可能会强迫大量拥有五年历史的PC，以便用Windows 10粘贴到新计算机。\n 愤世嫉俗的人说，微软和OEM正在寻找推动新的PC升级周期的理由。但是，它也是不可避免的，为了保证具有圆形边缘和半透明窗口小部件或像安全引导等现代安全功能等图形功能的体面的用户体验，您需要满足您的要求。只是不要指望看到Windows 11即将尽快达到10亿个活跃的设备。\n 注意：与我们所有的OP-EDS一样，这里表达的意见属于Wherit Ions，而不是Tom＆＃39;作为团队的硬件。 ", "note_en": "Traditionally, we think of Windows as the operating system for the masses and that each new version is a no-brainer upgrade, even for those with older PCs. Right now, after six years on the market, Windows 10   makes up 78 percent of all Windows installs with Windows 7, which launched in 2009 (12 years ago!) taking second place at 16 percent. Windows 10 grew this fast because there was absolutely no reason not to upgrade. It works on every PC that runs Windows 7 or 8, it’s free (see  how to get Windows 10 for free or cheap) and it has a slew of new features.\n  Microsoft didn’t make Windows 10 a free and easy upgrade just to be kind. The company wants to spend its time supporting the latest OS and it wants people using features like the Microsoft Store and Edge browser. It wants developers using its latest SDK to make groundbreaking apps that help the platform grow.\n  But Windows 11 changes all that, leaving a significant number of Windows 10 computers -- even high-end workstations from just three years ago -- out in the cold, because they won’t meet the minimum requirements, which have changed significantly for the first time since Windows 7 launched in 2009. To be fair, these new requirements, particularly requiring   TPM modules (more on that below) and DX12 GPUs, are designed to provide a higher minimum baseline of security and performance than we’ve seen before. And Microsoft even seems like it’s expecting a significant number of users to stay on the current OS, having recently announced that it plans to support Windows 10 through 2025.\n This is a sea change for Microsoft, because the company has previously prioritized new OS adoption over most else. In fact, the company was likely disappointed when it took two years longer than expected to   reach 1 billion active monthly devices for Windows 10. With Windows 11, it’s going to take a lot longer and, as with Android devices, there’s likely to be more computers running older operating systems than the latest one for years and years to come. That’s bad news for users and developers.\n   These new minimum requirements don’t look too strenuous at first glance. According to Stephen Baker, vice president at analyst firm NPD, less than 4% of PCs sold in the last year have storage drives that were 64GB or smaller and the amount of systems with less than 4GB was “inconsequential.” In other words, almost all 2020-era new PCs would fit the bill, even if they don&#39;t have one of the  best SSDs.\n  However, most people don’t buy a new PC every year. In fact, according to Baker, the average replacement cycle for computers is 4 to 5 years. And I’m sure we all know people or have computers in our homes that are older than that.\n You might think that the only computers affected by these changes are netbooks or sub-$200 laptops like the Dell Inspiron 3000 series (circa 2018) and Amazon VivoBooks, some of which had 2GB of RAM and 32GB of storage quite recently. However, even a major workstation CPU that came out in 2018 will likely not be able to run Windows 11.\n Intel’s   Xeon W-3175X, which launched in Q4 of 2018 for $2999 and sports 16 cores does not come with built-in TPM support. You can purchase a motherboard that has a TPM header and add a TPM chip after the fact, but many systems don’t have this by default. It’s hard to argue that a massive HEDT (high end desktop) from less than three years ago should not be able to run Windows 11.\n   The problem for most users is not the RAM, storage or GPU requirements,, but the need for TPM 2.0, a feature most consumers don’t even know about that isn’t present on many computers from just a few years ago and is disabled on a lot of current-generation systems too.\n A Trusted Platform Module (TPM) provides a secure way to store encryption keys, certificates and other sensitive data in hardware. For example, if you use Bitlocker encryption, TPM is what prevents someone from being able to just remove your hard drive, stick it in another computer and read the data.\n  “PCs of the future need this modern hardware root-of-trust to help protect from both common and sophisticated attacks like ransomware and more sophisticated attacks from nation-states. Requiring the TPM 2.0 elevates the standard for hardware security by requiring that built-in root-of-trust.”\n And, to be fair, TPM 2.0 is hardly brand new. Starting in 2016, Microsoft   required that “all new device models, lines or series” of devices come with TPM 2.0 implemented and enabled by default. However, clearly, that only applied to the company’s partners making OEM laptops and desktops, because many current motherboards come with TPM disabled by default and some recent high-end chips don’t have it on board. The good news is that, if you have a processor from the last three to five years, there’s a good chance you can   enable TPM in the UEFI BIOS and solve this problem.\n  But there are probably a lot of PCs on the borderline here that don’t have TPM capability. Senior Writer   Michelle Ehrhardt reports that her Core i7-6700K that she bought in 2016 did not have a TPM option in the motherboard BIOS so she’s probably out of luck. Some motherboards offer the ability to add a physical TPM module as an upgrade but who is going to do that?\n Microsoft’s list of compatible CPUs leaves out any   Intel processor that is older than 8th Gen Core and any   AMD CPU older than Ryzen 2000 series (first gen Ryzen is not on the list). However, a Microsoft spokesperson said that these CPUs were listed because they have TPM so, in theory, if you have a CPU that’s not on the list and does support TPM, either through firmware or through a hardware upgrade chip, Windows 11 would install.\n According to Microsoft, if you don’t have TPM, you simply will not be able to install Windows 11. According to Microsoft’s   compatibility doc, the TPM 2.0 requirement is a “soft floor” where Windows 11 will warn you that it’s not a good idea to install and the “hard floor” below which you can’t install Windows 11 at all is having TPM 1.2 (something many people still don’t have). With either floor, you need TPM of some kind to be enabled and you’ll need Secure Boot enabled with your BIOS in native UEFI code, not compatibility or legacy modes.\n Also note that there will be no more 32-bit Windows. So, if you have an old netbook with a 32-bit processor, there is no way it will run Windows 11.\n  Where Windows 10 required only DirectX 9 support, Windows 11 demands that your GPU handle DirectX 12. DirectX 9 is a standard that goes all the way back to 2002 when it debuted on Windows 98, Me and XP, but version 12 is only from 2015.\n Now, to be fair, Nvidia GPUs as old as the Fermi (GTX 400), AMD chips as old as Graphics Core Next (Radeon 7000) and integrated Intel graphics going back all the way to Haswell (2013) work with DirectX 12. But if you were thinking of throwing Windows 11 on your  Viliv N5 UMPC, a personal favorite of mine which runs on a low-power Atom processor from 2010, you’re out of luck.\n  At some point it was inevitable that Microsoft would stop supporting really old hardware and, by most accounts, the minimum requirements for Windows 11 are really minimal. However, the TPM requirement by itself may force a lot of people with five year old PCs to either stick with Windows 10 or upgrade to new computers.\n The cynic in me says that Microsoft and OEMs are looking for reasons to drive a new PC upgrade cycle. But it’s also inevitable that, to guarantee a decent user experience with graphical features like rounded edges and translucent window widgets or modern security features like secure boot, you need to up your requirements. Just don’t expect to see Windows 11 hit 1 billion active devices any time soon.\n Note: As with all of our op-eds, the opinions expressed here belong to the writer alone and not Tom&#39;s Hardware as a team.", "posttime": "2021-06-26 03:28:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "windows,操作系统,芯片,microsoft,windows-10", "title": "Microsoft表示Windows 11需要一个可信平台模块（TPM）芯片，从而排除了大量Windows 10计算机升级到新操作系统 ", "title_en": "Microsoft says Windows 11 requires a Trusted Platform Module (TPM) chip, excluding a significant number of Windows 10 computers from upgrading to the new OS", "transed": 1, "url": "https://www.tomshardware.com/news/windows-11-leaves-computers-out", "via": "", "real_tags": ["windows", "操作系统", "芯片", "microsoft"]}, {"category": "", "categoryclass": "", "imagename": "d2c1f394c53d580338600175da3e5baa.jpg", "infoid": 1068299, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TLDR：DuckDB，免费和开源分析数据管理系统，可以直接在镶木地板文件上运行SQL查询，并自动利用木质格式的高级功能。\n Apache Parquet是分析的最常见的“大数据”存储格式。在Parquet文件中，数据以柱状压缩二进制格式存储。每个镶木文件都存储单个表。该表将被分成行组，每个行组包含表的行的子集。在行组中，表数据以柱状方式存储。\n  Parquet格式具有许多属性，使其适用于分析用例：\n 柱状表示表示可以（有效地）读取各个列。无需始终阅读整个文件！\n  该文件包含每个行组（最小值/最大值和空值的数量）中的每个列统计信息。如果不需要，这些统计信息允许读者跳过行组。\n  柱状压缩显着降低了格式的文件大小，从而减少了数据集的存储需求。这通常可以将大数据变为媒体数据。\n    DuckDB的零依赖性地板读卡器能够在镶木地块文件上直接执行SQL查询，而无需任何导入或分析步骤。由于木质地板的自然柱状格式，这是非常快的！ \nDuckDB将以流式方式读取地形文件，这意味着您可以对不适合您主内存不适合的大地板文件执行查询。\n DuckDB能够自动检测任何给定查询所需的列和行。这允许用户分析更大且更复杂的地形文件，而无需执行手动优化或投资更多硬件。\n 作为一个添加的奖金，DuckDB能够使用Glob Syntax使用并行处理和多个地块文件的所有这些。\n 作为简短的预告片，这里是一个代码片段，允许您直接在镶木文件的顶部运行SQL查询。\n ＃安装＃39;＆＃39;＆＃39;从＆＃39选择count（*）; taxi_2019_04.parquet＆＃39;＆＃39; 2019-04-15＆＃39之间的pickup_at;和＃39; 2019-04 -20＆＃39;＆＃39;＆＃39;＆＃39;）。fetchall（））\n    让我们潜入以前的查询，以更好地了解木质格式的力量，与DuckDB的查询优化器相结合。\n  在此查询中，我们从我们的镶板文件（pickup_at）中读取了一个列。存储在拼贴文件中的任何其他列可以完全跳过，因为我们不需要它们来回答我们的查询。 \n此外，只有在2019年4月的第15和2019年4月20日之间存在Pickup_At的行会影响查询结果。可以跳过任何不满足此谓词的行。\n 我们可以在这里使用镶木地板文件中的统计信息在这里的大量优势。可以跳过任何具有低于2019-04-15的Pickup_at的最大值的行组，或者最小值高于2019-04-20。在某些情况下，允许我们跳过整个文件。\n    为了说明这些自动优化的有效性，我们将使用Pandas和DuckDB在地板文件的顶部运行许多查询。\n 在这些查询中，我们使用存储为镶木地板文件的臭名昭着的纽约出租车数据集的一部分，特别是2019年4月和2019年6月的数据。这些文件是加利福尼亚州。 360 MB的大小在一起，每个含有约2100万行的18行。将三个文件放入出租车/文件夹中。\n 此示例可在此处作为谷歌Colab的互动笔记本。这里报告的时间来自这种环境以获得可重复性。\n    首先，我们在数据集中查看一些行。出租车/文件夹中有三个镶木地板文件。 DuckDB支持Globbing语法，允许它同时查询所有三个文件。\n   尽管查询从三个（相当大的）拼贴文件中选择所有列，但查询立即完成。这是因为DuckdB以流式方式处理拼影文件，并且在前几行被读取后将停止读取地板文件，因为全部需要满足查询。 \n如果我们在熊猫尝试这样做，我们意识到它并不是那么简单，因为熊猫不能在一个呼叫中读取多个镶木地板文件。我们首先必须使用pandas.concat将三个镶木档案连接在一起：\n    PANDAS显着更长的时间来完成此查询。这是因为Pandas不仅需要整体读取三个拼影文件中的每一个，它必须将这三个单独的熊猫Dataframe串联在一起。\n    我们可以通过从三个较小的部分创建单个大块地板文件来解决串联问题。我们可以使用PyArrow库来实现这一目标，它有支持读取多个镶嵌文件并将它们流入单个大文件。请注意，Pyarrow Parquet Reader是熊猫内部使用的非常相同的木条读卡器。\n         我们可以看到熊猫比以前更好，因为避免了级联。但是，整个文件仍然需要读入内存，这取得了大量的时间和内存。\n 对于DuckdB，它并不重要，您需要在查询中读取多少个镶木文件。\n    现在假设我们想弄清楚我们的数据集中有多少行。我们可以使用以下代码执行此操作：\n   DuckDB非常快地完成查询，因为它自动识别需要从地块文件中读取的内容，并最大限度地减少所需的读取。 Pandas必须再次读取整个文件，这导致它将其与以前查询相同的时间。 \n对于此查询，我们可以通过手动优化来改善Pandas的时间。为了获得计数，我们只需要文件中的单列。通过在read_parquet命令中手动指定要读取的单个列，我们可以获得相同的结果，但更快。\n   虽然这更快，但由于整个Vendor_ID列必须将其作为Pandas列读入内存，因此仍然需要超过一秒钟仅计算行数。\n    通常使用某种过滤谓词仅查看数据集的有趣部分。例如，想象一下我们想知道2019年6月30日之后发生了多少出租车发生。我们可以使用DuckDB中的以下查询来执行以下操作：\n      但是，它再次将整个文件读入内存，导致此查询需要7.5s。使用手动投影推动，我们可以将此降至0.9s。仍然明显高于DuckdB。\n  然而，Pyarrow Parquet Reader还允许我们对扫描进行滤波器推动。一旦我们添加了这一点，我们最终会更具竞争力的70ms来完成查询。\n   这表明这里的结果不是由于DuckdB的木质读者比Pyarrow Parquet Reader更快。 DuckDB在这些查询上更好地表现更好的原因是其优化器从SQL查询自动提取所有必需的列和过滤器，然后在镶木地板读卡器中自动使用，无需手动努力。\n 有趣的是，Pyarrow Parquet Reader和DuckdB都比在物化DataFrame上在Pandas上本身进行此操作的速度快得多。 \n＃将整个镶木地板文件读入Pandas DF = Pandas。 read_parquet（＆＃39; alltaxi.parquet＆＃39;）＃在熊猫＃注意34; pickup_at＆gt;＆＃39; 2019-06-30＆＃39;＆＃34;））））\n     最后让我们看看更复杂的聚合。假设我们想计算每次乘客的游乐设施数量。使用DuckDB和SQL，它看起来像这样：\n    对于SQL-Averse并且作为未来博客文章的预告片，DuckDB还具有“关系API”，其允许更具Python-esque的查询声明。以下是与上述SQL查询相当，它提供了完全相同的结果和性能：\n  现在作为比较，让我们以先前的方式在熊猫中运行相同的查询。\n ＃天真的熊猫。 read_parquet（＆＃39; alltaxi.parquet＆＃39;）。 groupby（＆＃39; passenting_count＆＃39;）。 agg（{＆＃39; passenting_count＆＃39;：＆＃39; count＆＃39;}）＃投影推平熊猫。 read_parquet（＆＃39; alltaxi.parquet＆＃39;，columns = [＆＃39; passenger_count＆＃39;]）。 groupby（＆＃39; passenting_count＆＃39;）。 agg（{＆＃39; passenting_count＆＃39;：＆＃39; count＆＃39;}）＃本地（Parquet文件预加载到内存中）df。 groupby（＆＃39; passenting_count＆＃39;）。 agg（{＆＃39; passenting_count＆＃39;：＆＃39; count＆＃39;}）\n  我们可以看到DuckDB在所有三种情况下都比熊猫更快，而无需执行任何手动优化，而无需将拼影文件加载到内存中。\n    DuckdB可以在镶木地板文件的顶部有效地运行查询，而无需初始加载阶段。系统将自动利用所有镶木地板的高级功能来加快查询执行。 \nDuckDB是一个免费和开源的数据库管理系统（MIT许可）。 它旨在成为分析的SQLite，并提供一个快速高效的数据库系统，具有零外部依赖项。 它不仅适用于Python，还可用于C / C ++，R，Java等。  ←返回新闻档案 ", "note_en": "TLDR: DuckDB, a free and open source analytical data management system, can run SQL queries directly on Parquet files and automatically take advantage of the advanced features of the Parquet format.\n Apache Parquet is the most common “Big Data” storage format for analytics. In Parquet files, data is stored in a columnar-compressed binary format. Each Parquet file stores a single table. The table is partitioned into row groups, which each contain a subset of the rows of the table. Within a row group, the table data is stored in a columnar fashion.\n  The Parquet format has a number of properties that make it suitable for analytical use cases:\n The columnar representation means that individual columns can be (efficiently) read. No need to always read the entire file!\n  The file contains per-column statistics in every row group (min/max value, and the number of  NULL values). These statistics allow the reader to skip row groups if they are not required.\n  The columnar compression significantly reduces the file size of the format, which in turn reduces the storage requirement of data sets. This can often turn Big Data into Medium Data.\n    DuckDB’s zero-dependency Parquet reader is able to directly execute SQL queries on Parquet files without any import or analysis step. Because of the natural columnar format of Parquet, this is very fast!\n DuckDB will read the Parquet files in a streaming fashion, which means you can perform queries on large Parquet files that do not fit in your main memory.\n DuckDB is able to automatically detect which columns and rows are required for any given query. This allows users to analyze much larger and more complex Parquet files without needing to perform manual optimizations or investing in more hardware.\n And as an added bonus, DuckDB is able to do all of this using parallel processing and over multiple Parquet files at the same time using the glob syntax.\n As a short teaser, here is a code snippet that allows you to directly run a SQL query on top of a Parquet file.\n # to install: pip install duckdb# to download the parquet file:# wget https://github.com/cwida/duckdb-data/releases/download/v1.0/taxi_2019_04.parquet import  duckdb print ( duckdb . query ( &#39;&#39;&#39;SELECT COUNT(*)FROM &#39;taxi_2019_04.parquet&#39;WHERE pickup_at BETWEEN &#39;2019-04-15&#39; AND &#39;2019-04-20&#39;&#39;&#39;&#39; ). fetchall ())\n    Let us dive into the previous query to better understand the power of the Parquet format when combined with DuckDB’s query optimizer.\n  In this query, we read a single column from our Parquet file ( pickup_at). Any other columns stored in the Parquet file can be entirely skipped, as we do not need them to answer our query.\n  In addition, only rows that have a  pickup_at between the 15th and the 20th of April 2019 influence the result of the query. Any rows that do not satisfy this predicate can be skipped.\n We can use the statistics inside the Parquet file to great advantage here. Any row groups that have a max value of  pickup_at lower than  2019-04-15, or a min value higher than  2019-04-20, can be skipped. In some cases, that allows us to skip reading entire files.\n    To illustrate how effective these automatic optimizations are, we will run a number of queries on top of Parquet files using both Pandas and DuckDB.\n In these queries, we use a part of the infamous New York Taxi dataset stored as Parquet files, specifically data from April, May and June 2019. These files are ca. 360 MB in size together and contain around 21 million rows of 18 columns each. The three files are placed into the  taxi/ folder.\n The examples are available  here as an interactive notebook over at Google Colab. The timings reported here are from this environment for reproducibility.\n    First we look at some rows in the dataset. There are three Parquet files in the  taxi/ folder.  DuckDB supports the globbing syntax, which allows it to query all three files simultaneously.\n   Despite the query selecting all columns from three (rather large) Parquet files, the query completes instantly. This is because DuckDB processes the Parquet file in a streaming fashion, and will stop reading the Parquet file after the first few rows are read as that is all required to satisfy the query.\n If we try to do the same in Pandas, we realize it is not so straightforward, as Pandas cannot read multiple Parquet files in one call. We will first have to use  pandas.concat to concatenate the three Parquet files together:\n    Pandas takes significantly longer to complete this query. That is because Pandas not only needs to read each of the three Parquet files in their entirety, it has to concatenate these three separate Pandas DataFrames together.\n    We can address the concatenation issue by creating a single big Parquet file from the three smaller parts. We can use the  pyarrow library for this, which has support for reading multiple Parquet files and streaming them into a single large file. Note that the  pyarrow parquet reader is the very same parquet reader that is used by Pandas internally.\n         We can see that Pandas performs better than before, as the concatenation is avoided. However, the entire file still needs to be read into memory, which takes both a significant amount of time and memory.\n For DuckDB it does not really matter how many Parquet files need to be read in a query.\n    Now suppose we want to figure out how many rows are in our data set. We can do that using the following code:\n   DuckDB completes the query very quickly, as it automatically recognizes what needs to be read from the Parquet file and minimizes the required reads. Pandas has to read the entire file again, which causes it to take the same amount of time as the previous query.\n For this query, we can improve Pandas’ time through manual optimization. In order to get a count, we only need a single column from the file. By manually specifying a single column to be read in the  read_parquet command, we can get the same result but much faster.\n   While this is much faster, this still takes more than a second as the entire  vendor_id column has to be read into memory as a Pandas column only to count the number of rows.\n    It is common to use some sort of filtering predicate to only look at the interesting parts of a data set. For example, imagine we want to know how many taxi rides occur after the 30th of June 2019. We can do that using the following query in DuckDB:\n      This again reads the entire file into memory, however, causing this query to take  7.5s. With the manual projection pushdown we can bring this down to  0.9s. Still significantly higher than DuckDB.\n  The  pyarrow parquet reader also allows us to perform filter pushdown into the scan, however. Once we add this we end up with a much more competitive  70ms to complete the query.\n   This shows that the results here are not due to DuckDB’s parquet reader being faster than the  pyarrow Parquet reader. The reason that DuckDB performs better on these queries is because its optimizers automatically extract all required columns and filters from the SQL query, which then get automatically utilized in the Parquet reader with no manual effort required.\n Interestingly, both the  pyarrow Parquet reader and DuckDB are significantly faster than performing this operation natively in Pandas on a materialized DataFrame.\n # read the entire parquet file into Pandas df  =  pandas . read_parquet ( &#39;alltaxi.parquet&#39; ) # run the query natively in Pandas# note: we only time this part print ( len ( df [[ &#39;pickup_at&#39; ]]. query ( &#34;pickup_at &gt; &#39;2019-06-30&#39;&#34; )))\n     Finally lets look at a more complex aggregation. Say we want to compute the number of rides per passenger. With DuckDB and SQL, it looks like this:\n    For the SQL-averse and as a teaser for a future blog post, DuckDB also has a “Relational API” that allows for a more Python-esque declaration of queries. Here’s the equivalent to the above SQL query, that provides the exact same result and performance:\n  Now as a comparison, let’s run the same query in Pandas in the same way we did previously.\n # naive pandas . read_parquet ( &#39;alltaxi.parquet&#39; )  . groupby ( &#39;passenger_count&#39; )  . agg ({ &#39;passenger_count&#39;  :  &#39;count&#39; }) # projection pushdown pandas . read_parquet ( &#39;alltaxi.parquet&#39; ,  columns = [ &#39;passenger_count&#39; ])  . groupby ( &#39;passenger_count&#39; )  . agg ({ &#39;passenger_count&#39;  :  &#39;count&#39; }) # native (parquet file pre-loaded into memory) df . groupby ( &#39;passenger_count&#39; )  . agg ({ &#39;passenger_count&#39;  :  &#39;count&#39; })\n  We can see that DuckDB is faster than Pandas in all three scenarios, without needing to perform any manual optimizations and without needing to load the Parquet file into memory in its entirety.\n    DuckDB can efficiently run queries directly on top of Parquet files without requiring an initial loading phase. The system will automatically take advantage of all of Parquet’s advanced features to speed up query execution.\n DuckDB is a free and open source database management system (MIT licensed). It aims to be the SQLite for Analytics, and provides a fast and efficient database system with zero external dependencies. It is available not just for Python, but also for C/C++, R, Java, and more.\n   ← back to news archive", "posttime": "2021-06-26 03:27:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "duckdb,parquet,文件", "title": "使用duckdb查询精度的木质 ", "title_en": "Querying Parquet with Precision Using DuckDB", "transed": 1, "url": "https://duckdb.org/2021/06/25/querying-parquet.html", "via": "", "real_tags": ["duckdb", "parquet", "文件"]}, {"category": "", "categoryclass": "", "imagename": "6a9f3376a78af12d6299201baa15b86f.jpg", "infoid": 1068297, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我喜欢建立东西，但我什么都不知道让人们使用它们。我是如何建造并在24hourhomepage.com建造和长大的实验...... ", "note_en": "I like building things but I know nothing about getting people to use them.Here is how I built and grew 24hourhomepage.com as an experiment in strengthening ...", "posttime": "2021-06-26 03:26:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "销售,sales,建立", "title": "10k小时？ 86,400秒，销售和营销作为一个SWE ", "title_en": "10K hours? 86,400 seconds to get better at sales and marketing as a SWE", "transed": 1, "url": "https://www.youtube.com/watch?v=v8WFZ4b7s4Y", "via": "", "real_tags": ["销售", "sales", "建立"]}]