[{"category": "", "categoryclass": "", "imagename": "72e6662b3eb7f17591b1ebb5851aaea6.jpg", "infoid": 1033088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这条简短的信息没有具体提到选举日，促使纽约州总检察长利蒂夏·詹姆斯(Letitia James)对此事展开调查。詹姆斯周二宣布，她的办公室正在积极调查选民收到机器人电话的指控。\n“投票是我们民主的基石，”詹姆斯在周二的一份声明中说。“阻止选民行使投票权的企图令人沮丧，令人不安，而且是错误的。”\n联邦调查局告诉TechCrunch，该机构知道有机器人通话的报告。该机构不愿透露是否正在调查机器人通话；然而，据美联社报道，国土安全部的一名高级官员周二告诉记者，联邦调查局正在调查试图阻止人们投票的电话。\nFBI在发给TechCrunch的一份声明中表示：“作为提醒，FBI鼓励美国公众核实他们可能通过当地选举官员收到的任何选举和投票信息。”\n在詹姆斯宣布这一消息之前，纽约股份公司(New York AG)办公室本周早些时候发出传票，调查这些据称散布虚假信息的机器人电话的来源。收到虚假信息或在投票中面临问题的纽约选民可以联系她办公室的选举保护热线1-800-771-7755。\n他说：“每个选民都必须能够行使他们的基本投票权，而不受骚扰、胁迫或恐吓。我们的国家有自由公正的选举遗产，这次选举也不会有什么不同。“詹姆斯补充说。“选民应该放心，投票是安全可靠的，他们应该在保密的情况下行使投票的基本权利。我们和全国各地的国家领导人正在努力保护你们的选举权，任何试图阻碍这一权利的人都将被追究最大限度的法律责任。“。\n上个月，美国司法部宣布，由司法部长威廉·P·巴尔(William P.Barr)召集的一个跨部门工作组向国会发布了一份关于阻止非法机器人通话的努力的报告。这份报告描述了美国司法部的努力，包括2020年1月对美国互联网协议语音(VoIP)公司、联邦贸易委员会(Federal Trade Commission)和联邦通信委员会(Federal Communications Commission)为打击非法机器人通话而提起的两起民事诉讼。尽管做出了这些努力，甚至有证据表明机器人通话在一段时间内有所下降，但总统选举和新冠肺炎疫情推动了电话数量的激增。", "note_en": "The brief message, which doesn’t specifically mention Election Day, has prompted New York Attorney General Letitia James to launch an investigation into the matter. James announced Tuesday that her office is actively investigating allegations that voters are receiving the robocalls.\n “Voting is a cornerstone of our democracy,” James said in a statement Tuesday. “Attempts to hinder voters from exercising their right to cast their ballots are disheartening, disturbing and wrong.”\n   The FBI told TechCrunch that the agency is aware of reports of robocalls. The agency wouldn’t say if it is investigating the robocalls; however, a senior official at the Department of Homeland Security told reporters Tuesday that the FBI was investigating calls that seek to discourage people from voting, according to the AP.\n “As a reminder, the FBI encourages the American public to verify any election and voting information they may receive through their local election officials,” the FBI said in a statement sent to TechCrunch.\n The announcement from James follows subpoenas issued earlier this week by the New York AG office to investigate the source of these robocalls allegedly spreading disinformation. New York voters who receive concerning disinformation, or face issues at the polls can contact her office’s Election Protection Hotline at 1-800-771-7755.\n “Every voter must be able to exercise their fundamental right to vote without being harassed, coerced, or intimidated. Our nation has a legacy of free and fair elections, and this election will be no different,” James added. “Voters should rest assured that voting is safe and secure, and they should exercise their fundamental right to vote in confidence. We, along with state leaders across the nation, are working hard to protecting your right to vote, and anyone who tries to hinder that right will be held accountable to the fullest extent of the law.”\n Last month, the U.S. Department of Justice announced that an interagency working group convened by Attorney General William P. Barr released a report to Congress on efforts to stop illegal robocalls. The report described efforts by the DOJ, including two civil actions filed in January 2020 against U.S.-based Voice over Internet Protocol (VoIP) companies, the Federal Trade Commission and the  Federal Communications Commission to combat illegal robocalls. Despite those efforts, and even evidence of some declines in robocalls for a time, the presidential election and the COVID-19 pandemic has fueled a spike in calls.", "posttime": "2020-11-04 08:11:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,home,选举", "title": "\n选举日“待在家里”机器人电话提示警告，调查", "title_en": "\n\t\t\t\t‘Stay home’ robocalls on Election Day prompt warnings, investigation\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/stay-home-robocalls-on-election-day-prompt-warnings-investigation/", "via": "", "real_tags": ["机器人", "home", "选举"]}, {"category": "", "categoryclass": "", "imagename": "5bb5f51caed44760878da12feb477a82.png", "infoid": 1033087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "即使这个国家正处于两极分化的选举的最后几天，风险投资的齿轮也从未停止转动。在这个一如既往安静的非选举新闻周二，风险投资公司仍设法向美国证券交易委员会(SEC)提交了文件，显示新筹集的资金。Predicor Ventures和Insight Partners将加入Hustle Fund，完成新资本的募集。\n这些文件值得注意，因为它们标志着新资本进入初创企业世界，未来几周的情况可能会截然不同。尽管如此，Premitive Ventures和Hustle Fund仍在筹集资金，因此预计它们(希望)在未来几个月会增加更多资本。\n由查尔斯·哈德森(Charles Hudson)领导的先驱风险投资公司(Producer Ventures)筹集了新一批资本，用于投资于种子前期公司。该公司于2020年3月首次提交申请，称计划募集4000万美元的基金，今天似乎已经完成了2900万美元的目标。前身最近的投资包括The Juggernaut、MMHMM和TeamPay。该基金最近登上了头条，因为它提拔了第一位受聘的西德尼·托马斯(悉尼Thomas)担任负责人。由于筹款活动，哈德森无法置评。\n我们还看到了Insight Partners提交的一份文件，该公司在4月份关闭了一只95亿美元的基金，用于初创企业和成长期投资，这表明它已经为其有史以来第一只机会基金筹集了资金。美国证券交易委员会(SEC)的文件显示，Insight Partners已经为机会基金筹集了4.13亿美元。Insight没有回复记者的置评请求。\n今天早些时候，SEC的文件还显示，Hustle Fund已经为第二只基金筹集了3,000万美元，超过了之前1,150万美元的基金。有趣的是，这只新基金的文书工作最初是在2019年5月提交的，目的是筹集5000万美元。因此，今天的新闻是它的第一个收盘价。虽然该公司仍在筹集资金，但从提交申请到第一次结案还有很长的差距。该基金由前500 Startup合伙人埃里克·巴恩(Eric Bahn)和伊丽莎白·殷(Elizabeth Yen)于2018年推出，类似于先驱，投资于种子前的初创公司。Hustle Fund每年向50家初创公司投资2.5万美元的支票。\n虽然选举日的资金热潮值得注意，但这在某种程度上是意料之中的。一般来说，基金希望在潜在的混乱事件或动乱时间之前清理和关闭他们的文书工作。我们看到OpenView、Canaan、True Ventures等公司关闭了交易，而包括First round和Khosla在内的公司则提交了申请新基金的文件。时间会告诉我们，这是1月1日之前的最后一次消息，还是风投世界将继续推动成群结队的资本，假期见鬼去吧。", "note_en": "Even as the country is in the final days of a polarizing election, the cogs of VC never stop turning. On this ever-so-quiet, non-election-news Tuesday, venture firms still managed to file paperwork with the SEC indicating newly raised funds.  Precursor Ventures   and Insight Partners will join  Hustle Fund   in closing new capital.\n The filings are noteworthy because they signal new capital coming into the startup world, which could look dramatically different in the coming weeks. Still, Precursor Ventures and Hustle Fund are both still fundraising, so expect them to (hopefully) add more capital in the coming months.\n  Precursor Ventures, led by Charles Hudson, has raised a new tranche of capital to invest in pre-seed companies. The firm first filed in March 2020 that it had plans to raise a $40 million fund, and today it appears that it has closed  $29 million of that goal. Recent investments from Precursor include  The Juggernaut,  mmhmm and  TeamPay. The fund made headlines recently because it  promoted Sydney Thomas, its first hire, to principal. Hudson was unable to comment due to fundraising activity.\n  We also saw a filing from  Insight Partners,   which closed a  $9.5 billion fund in April for startups and growth-stage investments, indicating that it has raised money for its first-ever Opportunity Fund. The SEC filing shows that Insight Partners has raised $413 million for the opportunity fund. Insight did not return a request for comment.\n Earlier today, SEC filings also showed that Hustle Fund has  raised $30 million for a second fund, surpassing its previous fund of $11.5 million. Interestingly, paperwork for this new fund was first filed in May 2019 with the intention to raise $50 million. Today’s news, thus, is its first close. While the firm is still fundraising, it’s a long gap between filing and first close. The fund was launched in 2018 by ex-500 Startup partners Eric Bahn and Elizabeth Yin to, similar to Precursor, invest in pre-seed startups. Hustle Fund invests $25,000 checks into 50 startups per year.\n  While the spree of funds on Election Day was noteworthy,  it was somewhat expected. Generally speaking, funds want to get their paperwork cleared and closed before a potentially  chaotic event or time of unrest. We saw closes from OpenView, Canaan, True Ventures and more, while firms including First Round and Khosla filed paperwork for new funds. Time will tell if this is a final exhale of news until January 1, or if the VC world will continue pushing droves of capital, holidays be damned.", "posttime": "2020-11-04 08:11:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,fund,基金", "title": "\nInsight Partners和先驱风险投资公司加入Hustle Fund筹集新基金资金", "title_en": "\n\t\t\t\tInsight Partners, Precursor Ventures join Hustle Fund in raising new fund money\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/insight-partners-precursor-ventures-join-hustle-fund-in-raising-new-fund-money/", "via": "", "real_tags": ["风险投资", "fund", "基金"]}, {"category": "", "categoryclass": "", "imagename": "52cc4413eb94717b8f7c1573460563c4.jpg", "infoid": 1033086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个钱包的名字很容易记住，地址是1HQ3Go3ggs8pFnXu HVHRytPCq5fGG8Hbhx，就持有量而言，它是-或者更确切地说，是第四大比特币钱包。\n这些硬币自2015年4月以来一直放在钱包里，当时比特币的价格在200美元的中档。今天，一枚比特币的价值约为13,800美元。\n这些持有量早于比特币现金硬叉，这意味着地址所有者还有权获得69,370 BCH(价值1680万美元)；在这些持有量今天也被转移之前，比特币现金钱包一直是第18大比特币现金钱包。\n地址的所有者尚不清楚，但黑客多年来一直试图使用据称保存其私钥的文件进入钱包。不幸的是，密码和文件类型使他们很难访问。多年来没有人能做到这一点。\n看起来有人想通了。或者它的主人聪明起来，把硬币移到了一个钱包里，而这个钱包并没有在黑暗的网络上交易。\n为获得最佳体验，请立即下载指尖上的顶级密码新闻和独家功能。", "note_en": "The wallet, which goes by the easy-to-remember   address  of 1HQ3Go3ggs8pFnXuHVHRytPCq5fGG8Hbhx, is—or, rather, was—the   fourth-largest Bitcoin wallet  in terms of holdings.\n The coins had been sitting in the wallet since April 2015, when the price of Bitcoin was in the mid-$200 range. Today, a single Bitcoin is worth around $13,800.\n The holdings predate the Bitcoin Cash hard fork, meaning the address owner was also entitled to 69,370 BCH (worth a cool $16.8 million); it   was  the   18th-largest Bitcoin Cash wallet  until those holdings were moved today as well.\n  The owner of the address is unknown, but hackers have been trying to get into the wallet for years using a file that purportedly held its private keys. Unfortunately for them, the password and file type made it difficult to access. No one had managed to do so in years.\n Looks like someone figured it out. Or its owner wised up and moved the coins to a wallet that   isn&#39;t  being traded around on the dark web.\n  For the best experience, top crypto news at your fingertips and exclusive features download now.", "posttime": "2020-11-04 08:06:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,比特币,hackers,钱包", "title": "9.55亿美元的比特币黑客刚刚被转移", "title_en": "The $955M in Bitcoin Hackers Have Been After Just Moved", "transed": 1, "url": "https://decrypt.co/47123/950-million-bitcoin-hackers-have-been-after-just-moved", "via": "", "real_tags": ["黑客", "比特币", "hackers", "钱包"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一小群植物遗产爱好者正在印度带头开展一场运动，通过恢复过去蓬勃发展、但现在濒临灭绝的丰富作物品种，复兴和保护该国迅速消失的食物生物多样性。\n43岁的巴比塔·巴特(Babita Bhatt)曾是一名软件专业人士，她只是这些十字军战士中的一员，他们正在避开既定的职业和丰厚的薪酬，成为农民、活动家和企业家。\n害怕给年幼的女儿喂食覆盖着杀虫剂的食物是巴特搬到北阿肯德邦山区的导火索。用稳定的收入换取了企业家的财务不安全感，她在2018年创办了自筹资金的企业喜马拉雅2Home(Himalaya2Home)。\n“我从小在山里长大，吃惯了山里种植的美味的有机农产品。所以，当我婚后搬到这个城市时，低档次的农产品和没有稳定、可靠的有机农产品供应对我打击很大。“Bhatt说。例如，商店买的谷仓里的小米是抛光的白色的，没有味道，不像山里的小米没有打磨过，味道很好。市里的蔬菜和水果也缺乏光泽、质地和口感。“。\nBhatt推出了一种基于可持续本土和传家宝种子农业的供应链模式。“印度不为人知或鲜为人知的本土作物名单令人难以置信，”她说。“直到100年前，所有这些品种都被广泛种植和食用。然而，它们随着绿色革命(始于20世纪60年代)而消失，这场革命将高产置于土壤保护和优质农产品之上。\n“大量使用杀虫剂和通过转基因篡改种子进一步敲响了许多具有药用和治疗特性的本土种子品种的丧钟。她说：“保存在社区种子库中的种子档案文件齐全，这是当务之急，因为它可以在保存迅速消失的本土产品方面发挥关键作用。”\n三年多来，巴特已经在北阿肯德邦和东北部各州与几个与她有相同愿景的草根非政府组织建立了成功的合作伙伴关系。她现在德拉登拥有功能齐全的生产和包装设施，并在印度各地拥有一个拥有110多种产品和近3500名常客的在线市场。\n她说：“我们希望利用农业的传统知识，形成社区合作伙伴关系，提供培训，并创建可靠的供应链，通过有保证的回购来帮助提高收入。我们还与激进团体Beej Bacao Aandolan合作，通过种子保护和繁殖的传家宝种子库，复兴和促进传统的以种子为基础的农业。“\n专家说，Bhatt的担忧反映了一种农业趋势，这种趋势已经在印度和世界各地带来了耕作技术的结构性转变。自19世纪末以来，农业机械化的指数增长以牺牲土壤保护和遗传多样性为代价，将生产力放在首位。印度的绿色革命进一步破坏了农业多样性，取而代之的是越来越少的营养但有弹性的作物品种。\n联合国粮农组织在去年发布的第一份关于粮食和农业生物多样性状况的全球报告中发现，在大约6000种种植的食用植物中，不到200种对全球粮食产量做出了重大贡献，只有9种植物占作物总产量的66%。\n在印度，许多品种的小麦、豆类、南瓜、黄瓜和茄子(茄子)都消失了。\n联合国生物多样性公约“的一份报告表示：”对印度来说，保护生物多样性至关重要，不仅因为它提供了人类生存所需的几种商品和服务，还因为它与为数百万当地人提供生计和改善社会经济条件直接相关，从而为可持续发展和减贫做出贡献。“。\n退休的八十多岁的教师Natabar Sarangi在沿海的奥迪萨共同创立了Rajendra土著农业研究中心，在25年的时间里保存、繁殖和分发700多个本地水稻品种。\n萨兰吉说，在印度，曾经有100多万个地方品种的水稻具有多样而有价值的特性。但在绿色革命之后，当一些高产品种被引进时，绝大多数品种都消失了。\n87岁的萨兰吉说：“在担任了32年的公立学校教师后，我回到了祖传的3.5英亩(一块)土地上从事无化学耕作的职业，尽我所能扭转农业中愚蠢的机械化，以及肆无忌惮地使用破坏土壤的化肥/杀虫剂。”\nSarangi已经培训了2000多名农民使用本土种子、有机肥和杀虫剂。这项工作的资金来自出售种子和祝福者的捐赠。\n“我们要重振传统，重现本土品种昔日的辉煌。我们图书馆有500多本来自不同国家的有机农业书籍。人们对有机农业不能养活整个人口持保留态度，“他说。但我的反驳，以及65年多的农业经验表明，它不仅可以养活我们的国家，还可以提供过剩的农产品出口到其他国家，促进我们的经济。\nPrabhakar Rao博士是自然或吠陀农业(而不是有机农业)的倡导者，也是Hariyalee Seeds的创始人，他表示，在过去的100年里，印度的蔬菜生物多样性已经丧失了近99%。旅行到印度的偏远角落，并与农民和其他农业利益攸关方互动，这位拥有遗传学和植物育种博士学位的农学家在2009年成立了一个种子库。\n“在过去的十年里，我从我收集的600粒种子中稳定了大约200粒种子(在遗传和环境上)。需要三到四年的时间才能稳定一个种子品种，这一过程使其可以使用和分发，“他解释说。\n拉奥在班加卢市附近的农场充满了超现实主义色彩。红色秋葵从一些灌木丛中窥视，而红色的玉米和紫罗兰辣椒则像装饰性的耳环一样从其他灌木丛中悬挂着。黑色和靛蓝的西红柿和蓝宝石色调的黄瓜为令人惊叹的万花筒增添了色彩。“我目前最大的关注点是与城市园艺师合作，他们可以把这些品种介绍给消费者。一旦这一趋势在商业上可行，农民将为他们的蔬菜找到一个更大、更有利可图的市场，并实现大规模，“他说。\n拉奥警告说，除了生物多样性不可逆转的丧失之外，蔬菜品种的丧失也对印度5000年的文化遗产构成严重威胁。“100多年前写的食谱提到了用一些已不复存在的蔬菜制作的菜肴。这些菜肴已经从我们的剧目中消失了，我们无价的烹饪遗产也消失了。“。\n他说，最大的挑战之一是，与命名并商业化销售的转基因/杂交蔬菜种子不同，新发现的本土种子正在与身份危机作斗争。\n“目前，我们有三十多个品种的西红柿，包括蓝色、棕色和紫色，味道和质地不同；有二十八种茄子；十种不同的黄瓜；七种秋葵等。”但如何命名呢？“。\n为了暂时绕过这个问题，这些产品正在以它们来自的地方命名。例如，有以印度东北部一个邦命名的梅加拉亚红南瓜，还有在马哈拉施特拉邦繁衍生息的一种葫芦--浦那卡克里(Pune Kakri)。但拉奥认为，政府和机构需要介入，引导像他这样的人。\n根据Rao的说法，本土作物品种不仅对健康有好处，还能保护我们免受气候变化的影响。“杂交种或转基因种子的工作假设是，气候条件将永远保持理想；水将会充足，土壤将会有养分等。但随着气候变化变得更加严重，这些种子生长的基本原则将被粗暴地动摇。”\n“在这一点上，如果我们没有传家宝种子中存在的遗传生物多样性，我们如何才能获得对抗气候变化的基因呢？适应/抵抗气候波动和振荡的耐寒品种从何而来？“。这位活动家问道。\n在这里找到更多关于物种灭绝的报道，并在Twitter上关注生物多样性记者菲比·韦斯顿和帕特里克·格林菲尔德，以获得所有最新的新闻和专题", "note_en": "A small army of botanical heritage enthusiasts is spearheading a movement in  India for the revival and preservation of the country’s rapidly vanishing food biodiversity by bringing back the rich crop varieties that thrived in the past, but are now on the verge of extinction.\n Babita Bhatt, a 43-year-old former software professional, is just one of these crusaders, who are eschewing established careers and fat pay packets to become farmers, activists and entrepreneurs.\n Fear of feeding her young daughter foods covered in pesticides was the trigger for Bhatt to move to the hills of Uttarakhand. Trading a steady income for the financial insecurity of an entrepreneur, she launched  Himalaya2Home, a self-funded venture, in 2018.\n  “Growing up in the hills, I was used to eating delicious, organic produce cultivated in the mountains. So when I moved to the city after marriage, the low-grade produce and the non-availability of a steady, reliable supply of organic produce hit me hard,” says Bhatt. “For instance, the store-bought barnyard millet was polished white and tasteless, unlike the one in the hills which was unpolished and delicious. The city vegetables and fruits also lacked lustre, texture and taste.”\n Bhatt launched a supply chain model based on sustainable indigenous and heirloom seed-based agriculture. “The list of unknown or lesser-known indigenous crops in India is mind-boggling,” she says. “All these varieties were widely grown and eaten till just 100 years ago. However, they disappeared with  the Green Revolution [initiated in the 1960s], which placed a premium on high-crop yield over soil preservation and quality produce.\n “Rampant use of pesticides and tampering of seeds through GMO further sounded the death knell of many indigenous seed varieties that had medicinal and curative properties. A well-documented archive of seeds saved in community seed banks is the need of the hour as it can play a pivotal role in preserving fast-disappearing indigenous produce,” she says.\n  Over three years, Bhatt has forged successful partnerships with several grassroots NGOs that share her vision, across Uttarakhand and the north-eastern states. She now has fully functional production and packaging facilities in Dehradun and an online marketplace with more than 110 products and almost 3,500 regular customers across India.\n She says: “We want to harness traditional knowledge of agriculture, by forming community partnerships, imparting training and creating a reliable supply chain to help improve incomes by guaranteed buyback. We’re also working with  Beej Bachao Aandolan, an activist group, to revive and promote traditional seeds-based agriculture through an heirloom seed bank for seed conservation and propagation.”\n Bhatt’s concerns, say experts, reflect an agricultural trend that has brought about tectonic shifts in cultivation techniques across India and the world. Since the late 1800s, the exponential growth of farm mechanisation has prioritised productivity at the cost of soil preservation and genetic diversity.  India’s  green  revolution further undermined agricultural diversity, replacing it with fewer and less nutritious but resilient varieties of crops.\n  In its  first global report on the state of biodiversity for food and agriculture, released last year, the Food and Agriculture Organization at the UN found that of approximately  6,000 plant species cultivated for food, fewer than 200 contribute substantially to global food output, and only nine account for 66% of total crop production.\n In India, many varieties of wheat, beans, pumpkin squash, cucumber gourds, and  brinjal (aubergine) have been lost.\n “For India, conservation of biodiversity is crucial not only because it provides several goods and services necessary for human survival, but also because it is directly linked with providing livelihoods to and improving socio-economic conditions for millions of local people, thereby contributing to sustainable development and poverty alleviation,” says a report by the UN Convention on Biological Diversity.\n Retired octogenarian schoolteacher Natabar Sarangi co-founded the Rajendra Indigenous Agriculture Research Centre in coastal Odisha to preserve, multiply and distribute more than 700 varieties of native rice varieties over 25 years.\n Sarangi says that in India there were once more than a million landraces of rice with diverse and valuable properties. But after the green revolution, when a few high-yielding varieties were introduced, a huge majority vanished.\n  “After 32 years of service as a government school teacher, I turned back to my ancestral profession of chemical-free farming on a 3.5-acre [piece of] land to reverse in whatever little way I could the mindless mechanization in agriculture as well the unchecked use of chemical fertilisers/pesticides that were ruining the soil,” says Sarangi, who is 87.\n Sarangi has trained more than 2,000 farmers on the use of native seeds, organic manure and pesticides. The work is funded through the sale of seeds and donations from well-wishers.\n “We want to revive traditions and return the former glory of native varieties. Our library has over 500 books on organic farming from different countries. People have reservations organic farming can’t feed an entire population,” he says. “But my counter to that, and experience of over 65 years in farming, suggests that not only can it feed our country but also provide surplus produce to export to other countries and boost our economy.”\n According to Dr Prabhakar Rao, an advocate of natural or Vedic farming – rather than organic farming – and founder of  Hariyalee Seeds, India has lost nearly 99% of its biodiversity in vegetables in the past 100 years. Travelling to remote corners of India and interacting with famers and other agricultural stakeholders led the agriculturist, who has a PhD in genetics and plant breeding, to launch a seedbank in 2009.\n  “Over the last decade, I have stabilised (genetically and environmentally) about 200 seeds from the 600 that I collected. It takes three to four years to stabilise one seed variety, a process which makes it ready for use and distribution,” he explains.\n  Rao’s farm near Bengaluru is a riot of surreal colours. Red okra peeks from some bushes while scarlet corn and violet peppers dangle like ornamental earrings from others. Black and indigo tomatoes and sapphire-hued cucumbers add to the stunning kaleidoscope. “My biggest focus currently is to work with urban gardeners who can introduce these varieties to consumers. Once this trend becomes commercially viable, farmers will find a bigger and more lucrative market for their vegetables and mass scale will be achieved,” he says.\n In addition to the irreversible loss of biodiversity, Rao warns that the loss of vegetable varieties also poses a serious threat to India’s 5,000-years of cultural heritage. “Cookbooks written over 100 years ago mention dishes crafted from a number of vegetables that no longer exist. Those dishes have disappeared from our repertoire and so has that part of our priceless culinary heritage.”\n One of the biggest challenges, he says, is that unlike GMO/hybrid vegetable seeds which are named and commercially sold, newly discovered indigenous seeds struggle with an identity crisis.\n  “Currently, we have over 30 varieties of tomatoes, including blue, brown and purple, with different tastes and textures; 28 types of  brinjals; 10 different cucumbers; seven types of okra and so on. But how to name them?”\n To temporarily circumvent the problem, the produce is being named after the places they came from. For instance, there is Meghalaya red pumpkin, named after one of India’s north-eastern states, and Pune Kakri, a type of gourd which thrives in a city in Maharashtra. But Rao argues that the government and institutions need to step in to guide people like him.\n According to Rao, indigenous varieties of crops are not only good for health, they also protect us against climate change. “Hybrid or GMO seeds work on the presumption that climatic conditions will remain ideal forever; that water will be plentiful, soil will have nutrients etc. But as climate change gets more severe, as it will, the foundational principles on which these seeds are grown will be rudely shaken.\n  “At that point, if we don’t have the genetic biodiversity that exists in heirloom seeds how are we going to get the genes to combat climate change? Where will the hardy varieties which are adaptable/resistant to climatic fluctuations and oscillations come from?” the activist asks.\n Find more  age of extinction coverage here, and follow biodiversity reporters  Phoebe Weston and  Patrick Greenfield on Twitter for all the latest news and features", "posttime": "2020-11-04 08:06:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "品种,boggling,农业", "title": "“令人难以置信的品种”：保护印度遗产的食品斗士", "title_en": "‘Mind-boggling variety’: the food crusaders preserving India’s heritage", "transed": 1, "url": "https://www.theguardian.com/environment/2020/nov/03/mind-boggling-variety-the-food-crusaders-preserving-indias-heritage-aoe", "via": "", "real_tags": ["品种", "boggling", "农业"]}, {"category": "", "categoryclass": "", "imagename": "0abed3da87355c7bfa583437b675a52f.jpg", "infoid": 1033083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年降落在冰冻湖泊上的一块陨石含有数千种形成于数十亿年前的有机化合物，可能包含有关地球生命起源的线索。\n这颗流星在穿越冰冷的真空后于2018年1月16日进入地球大气层，照亮了加拿大安大略省和美国中西部的天空。天气雷达追踪到了燃烧的太空岩石下降和破裂的过程，帮助陨石猎人快速定位密歇根州汉堡草莓湖上坠落的碎片。\n科学家们在一项新的研究中报告说，一个国际研究小组随后在一项新的研究中对一块核桃大小的陨石进行了检查，当时它还很新鲜。据研究作者报道，他们的分析显示，超过2000个有机分子可以追溯到我们太阳系年轻的时候；类似的化合物可能为我们星球上出现的微生物生命埋下了种子。\n陨石从湖的冰冻表面迅速恢复，防止了液态水渗入裂缝，并污染了陆地孢子和微生物的样本。这保持了太空岩石的原始状态，使专家能够更容易地评估它的成分。\n该研究的合著者、芝加哥大学地球物理科学系博士生、菲尔德博物馆常驻研究生詹妮卡·格里尔(Jennika Greer)表示，事实上，几乎没有陆地风化作用，以至于带到芝加哥田野博物馆的碎片看起来就像是在太空中收集的一样。\n当太空岩石以每秒几英里的速度进入大气层时，它们周围的空气就会电离。该研究的主要作者、菲尔德博物馆陨石馆长、芝加哥大学(University Of Chicago)副教授菲利普·赫克(Philipp Heck)说，极端高温会融化高达90%的陨石，在大气层中幸存下来的岩石会被包裹在1毫米厚的熔融玻璃外壳中。赫克是菲尔德博物馆陨石馆长，也是芝加哥大学(University Of Chicago)的副教授。\n玻璃外壳中幸存的碎片是岩石在太空中地球化学的原始记录。Heck告诉Live Science，尽管有一次猛烈的坠落地球，但在蒸发的外层被带走后，像这样的岩石陨石着陆时非常非常冷。\n他说，我听过目击者说，下雨后陨石掉进了水坑，因为陨石太冷了，水坑结冰了。\n密歇根陨石中铀(同位素238和235)与元素铅(同位素207和206)衰变状态的比值告诉科学家，母体小行星形成于大约45亿年前。大约在那个时候，岩石经历了一个被称为热变质的过程，因为它受到了高达1300华氏度(700摄氏度)的温度。在那之后，小行星的组成在过去的30亿年里基本保持不变。\n赫克告诉Live Science，大约1200万年前，根据对陨石在太空中暴露于宇宙射线的分析，最近坠落在密歇根州的一大块岩石受到了撞击。\n因为这块陨石在数十亿年前最初加热后变化很小，所以它被归类为H4：&#34；H#34；表明它是一块富含铁的岩石陨石，而第四类陨石已经经历了足以改变其原始成分的热变质作用。但在今天落到地球上的陨石中，只有大约4%属于H4类别。\n格里尔说，当我们观察这些陨石时，我们看到的是一种与太阳系早期形成时的物质非常接近的物质。\n研究人员在研究中报道，陨石含有2600种有机化合物或含碳化合物。赫克说，由于陨石自45亿年前以来基本没有变化，这些化合物很可能与其他陨石带给年轻地球的化合物相似，其中一些可能已经融入了生命。\n他补充说，从地外有机化合物转变为地球上第一个微生物生命是一大步，至今仍笼罩在神秘之中，但有证据表明，有机物质在陨石中很常见-即使是在落地密歇根州的热变质陨石中也是如此，他补充道，这是一大步，仍然笼罩在神秘之中，但有证据表明，有机物质在陨石中很常见--即使是在落地密歇根的那块热变质陨石中也是如此。Heck说，对于年轻的地球来说，流星轰击的频率也比现在更高，所以我们非常确定，陨石对地球上的有机物种的输入对于播种生命是很重要的。\n加入我们的空间论坛，继续谈论空间的最新任务，夜空和更多！如果您有任何新闻提示、更正或评论，请发送电子邮件至：Community@space.com。", "note_en": "A meteorite that landed on a frozen lake in 2018 contains thousands of organic compounds that formed billions of years ago and could hold clues about the origins of life on   Earth.\n  The   meteor entered Earth&#39;s atmosphere on Jan. 16, 2018, after a very long journey through the freezing vacuum of space, lighting up skies over Ontario, Canada, and the midwestern United States. Weather radar tracked the flaming space rock&#39;s descent and breakup, helping meteorite hunters to quickly locate fallen fragments on Strawberry Lake in Hamburg, Michigan.\n  An international team of researchers then examined a walnut-size piece of the meteorite &#34;while it was still fresh,&#34; scientists reported in a new study. Their analysis revealed more than 2,000 organic molecules dating to when our   solar system was young; similar compounds may have seeded the emergence of microbial life on our planet, the study authors reported.\n   Swift recovery of the meteorite from the lake&#39;s frozen surface prevented liquid water from seeping into cracks and contaminating the sample with terrestrial spores and microbes. This maintained the space rock&#39;s pristine state, enabling experts to more easily evaluate its composition.\n  In fact, there was so little terrestrial weathering that the fragment brought to Chicago&#39;s Field Museum looked like it had been collected in space, said study co-author Jennika Greer, a doctoral candidate in the Department of the Geophysical Sciences at the University of Chicago, and a resident graduate student at The Field Museum.\n When space rocks enter the atmosphere at speeds of several miles per second, the air around them becomes ionized. Extreme heat melts away up to 90% of the meteor, and the rock that survives atmospheric passage becomes encased in a 1-millimeter-thick fusion crust of melted glass, said lead study author Philipp Heck, a curator of meteorites at the Field Museum and an associate professor at the University of Chicago.\n That surviving fragment inside the glassy crust is a pristine record of the rock&#39;s geochemistry in space. And despite a fiery fall to Earth, after the vaporized external layers are carried away, rocky meteorites such as this one are very, very cold when they land, Heck told Live Science.\n &#34;I&#39;ve heard eyewitness accounts of meteorites falling into puddles after it rained, and the puddle froze because the meteorite was so cold,&#34; he said.\n     The Michigan meteorite&#39;s ratio of   uranium (isotopes 238 and 235) to the element&#39;s decayed state as   lead (isotopes 207 and 206) told the scientists that the parent asteroid formed about 4.5 billion years ago. Around that time, the rock underwent a process called thermal metamorphism, as it was subjected to temperatures of up to 1,300 degrees Fahrenheit (700 degrees Celsius). After that, the asteroid&#39;s composition stayed mostly unchanged for the last 3 billion years.\n Then about 12 million years ago, an impact broke off the chunk of rock that recently fell in Michigan, according to an analysis of the meteorite&#39;s exposure to cosmic rays in space, Heck told Live Science.\n Because the meteorite was altered so little after its initial heating billions of years ago, it was classified as H4: &#34;H&#34; indicates that it&#39;s a rocky meteorite that&#39;s high in iron, while type 4 meteorites have undergone thermal metamorphism sufficient to change their original composition.  Only about 4% of the meteorites that fall to Earth today land in the H4 category.\n &#34;When we&#39;re looking at these meteorites, we&#39;re looking at something that&#39;s close to the material when it formed early in the solar system&#39;s history,&#34; Greer said.\n  The meteorite held 2,600 organic, or carbon-containing compounds, the researchers reported in the study. Because the meteorite was mostly unchanged since 4.5 billion years ago, these compounds likely are similar to the ones that other meteorites brought to a young Earth, some of which &#34;might have been incorporated into life,&#34; Heck said.\n The transformation from extraterrestrial organic compounds into the first microbial life on Earth is &#34;a big step&#34; that is still shrouded in mystery, but evidence suggests that organics are common in meteorites — even in thermally metamorphosed meteorites such as the one that landed in Michigan, he added. Meteor bombardment was also more frequent for a young Earth than it is today, &#34;so we are pretty certain that the input from meteorites into the organic inventory on Earth was important,&#34; for seeding life, Heck said.\n Join our Space Forums to keep talking space on the latest missions, night sky and more! And if you have a news tip, correction or comment, let us know at:  community@space.com.", "posttime": "2020-11-04 08:05:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "坠毁,crashed,陨石", "title": "在密歇根州坠毁的陨石含有外星有机化合物", "title_en": "Meteorite that crashed in Michigan holds extraterrestrial organic compounds", "transed": 1, "url": "https://www.space.com/fireball-meteorite-organic-compounds", "via": "", "real_tags": ["坠毁", "crashed", "陨石"]}, {"category": "", "categoryclass": "", "imagename": "1c16c64af18d182de53222c9dbe2b860.jpeg", "infoid": 1033082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "硅谷最大的几家公司正在抢购一些好莱坞大片背后的人才和技术，以努力改善他们的增强现实和虚拟现实产品。\n谷歌(Google)、Facebook和苹果(Apple)等科技巨头近年来都在吸引视觉艺术家离开好莱坞，并收购了最初用于为“星球大战1：星球大战故事”(Rogue One：A Star Wars Story)和“阿凡达”(Avata)等大片制作数字特效的技术。谷歌、Facebook和苹果(Apple)等科技巨头近年来都在努力吸引视觉艺术家离开好莱坞，并获得了最初用于为“星球大战总动员”和“阿凡达”等大片制作数字特效的技术。\n虽然VR几乎是完全身临其境的，但AR将图像叠加到现实世界上。苹果、谷歌、Facebook、微软和其他公司正在为这些应用程序开发特殊的眼镜或耳机，也被称为扩展现实(Extended Reality)。\n硅谷招募的艺术家和工程师打造了一些好莱坞最令人难忘的数字效果，反映出这样一种观点，即大众用户对AR和VR平台的采用取决于创造逼真的体验。用逼真的计算机生成的人物和场景填充平台，类似于电影或视频游戏中的东西，是这一努力的核心。\n近年来，前视觉特效专业人士放弃了在工业光魔(Industrial Light&amp；Magic)(其作品包括星球大战系列电影)、Digital Domain(漫威)和Weta Digital(“指环王”(Lord Of The Rings)、“朱曼吉：下一个台阶”(Jumanji：The Next Level))等好莱坞顶级公司的职业生涯，转而在开发AR和VR应用程序和硬件的科技公司工作，报酬往往更高。\n“在视觉特效行业工作很难赚到这么多钱，”视觉特效行业的资深人士保罗·德贝韦克(Paul Debevec)说，他现在是南加州大学(University Of Southern California)的教授。大约四年半前，谷歌聘请了德贝韦克，帮助公司推进扩展现实技术。德贝韦克是创造令人信服的数字人类的获奖先驱。\n他说：“我在视觉特效行业结识的许多最有才华的人都进入了科技行业。”德贝韦克的团队中有三人加入了他在谷歌的行列。\n在电影和电视中从事视觉特效工作可能意味着长时间、不可预测的工作时间、有限的薪酬、糟糕的工作保障和微不足道的福利-许多人称其为在好莱坞工作的乐趣而支付的“酷税”。与此同时，硅谷一直在向扩展现实技术投入数十亿美元。这两个行业之间的差距创造了大量有吸引力的工作岗位，一些厌倦了视觉效果的专业人士很难拒绝这些工作岗位。\n一位经验丰富的视觉特效艺术家说，“不同之处在于，在科技领域，人们更像对待人一样对待你。”他和许多同龄人一样，最近离开了好莱坞，去了一份科技行业的工作。他现在为世界上最大的科技公司之一开发AR平台。\n哈佛商学院(Harvard Business School)名誉教授肖莎娜·祖博夫(Shoshana Zuboff)称好莱坞向硅谷的移民是“科技帝国如何能够垄断关键的智力劳动的最新例证”。她将这种转变与人工智能领域发生的事情相提并论，因为各大科技公司说服科学家离开政府或大学的工作。\n近年来，好莱坞的视觉特效行业一直举步维艰。尽管它的作品在电影和电视中已经无处不在，但不断下跌的价格使得盈利变得越来越困难，工人的补偿也受到了影响。\nAR和VR的情况正好相反。咨询公司埃森哲(Accenture PLC)去年表示，预计到2023年，公司在沉浸式技术上的支出将从2020年的210亿美元增长到1210亿美元。\n“我们的智能手机世界变得如此繁重、如此丰富。早期的虚拟现实开发者马克·佩斯说：“我们花了太多时间看这块屏幕，我们对此几乎无能为力。”“下一步(事情)是把世界变成屏幕…。这就是AR所能提供的。“。\n近年来，科技公司在寻求创造栩栩如生的数字对象和人物时，一直依赖视觉效果专业人士的专业知识。\n“如果你戴上AR或VR耳机，你会看到一些东西，”德贝韦克说。“你将要看到的最重要的东西之一就是人。”\n在领导南加州大学创意技术研究所(USC Institute For Creative Technologies)期间，德贝韦克和其他人设计了许多视觉特效界人士认为最复杂的设备，用来捕捉人体的数字扫描，然后再将其制作成动画。\n灯光舞台，也就是众所周知的设备，是一个直径9英尺的球形设备，有1.4万盏灯和40多个摄像头。它在创造电影界一些最著名的演员数字复制品方面发挥了关键作用，比如“本杰明·巴顿的奇遇记”中的布拉德·皮特，“双子座人”中的威尔·史密斯，甚至还有“速度与激情7”中已故的保罗·沃克。\n2017年，谷歌建造了自己的更大的光舞台，不仅能够捕捉一个人的头部，而且能够捕捉整个人类的形态。在德贝韦克的帮助下，该公司正在使用该设备，部分原因是试图为AR和VR平台创造完全令人信服的数字人。\n南加州大学实验室的另一位前负责人李浩(音译)进入视觉效果领域，是因为他想“以一种好的方式愚弄观众”。他也拥有自己共同开发的技术，以改善硅谷收购的好莱坞数字人物的制作。\n苹果购买了李彦宏和同事开发的面部跟踪技术，并将其作为Animoji的基础，允许用户将自己的面部表情与动画生物融合在一起。他在这个项目上的一些合作者在出售后不久就开始在苹果工作。", "note_en": "Silicon Valley’s biggest companies are snapping up the people and technology behind some of Hollywood’s blockbusters in an effort to improve their augmented- and virtual-reality offerings.\n  Alphabet    GOOG  1.49%  Google,  Facebook    FB  1.51%  and  Apple    AAPL  1.54%  are among the tech giants that in recent years have been both luring visual artists away from Hollywood and acquiring technology first used to create digital effects for blockbusters like “Rogue One: A Star Wars Story” and “Avatar.”\n  While VR is almost completely immersive, AR superimposes images onto the real world. Apple, Google, Facebook,  Microsoft  and others are developing special glasses or headsets for these applications, also called extended reality.\n  Silicon Valley’s recruitment of artists and engineers who built some of Hollywood’s most memorable digital effects reflects the view that mass-user adoption of AR and VR platforms depends on creating lifelike experiences. Populating the platforms with realistic computer-generated characters and scenery, similar to what is found in movies or videogames, is central to that effort.\n    In recent years, former visual effects professionals have traded careers working for top Hollywood firms like Industrial Light &amp; Magic (whose credits include the Star Wars films), Digital Domain (Marvel) and Weta Digital (“Lord of the Rings,” “Jumanji: The Next Level”) in favor of often higher-paying gigs at tech companies developing AR and VR applications and hardware.\n    “It’s harder to make as much money working in visual effects,” said Paul Debevec, a veteran of the visual-effects industry who is now a professor at the University of Southern California. About 4½ years ago Google hired Mr. Debevec, an award-winning pioneer in the creation of convincing digital humans, to help the company advance extended reality.\n  “A lot of the most talented individuals that I’ve met through the visual effects industry find their way into the tech industry,” he said. Three of Mr. Debevec’s team joined him at Google.\n  Working in visual effects in film and TV can mean long, unpredictable hours, limited compensation, poor job security and paltry benefits—many call it the “cool tax” one pays for the pleasure of working in Hollywood. Meanwhile, Silicon Valley has been pouring billions of dollars into extended-reality technology. The disparity between the two industries has created an abundance of attractive jobs that some fed-up visual effects professionals find hard to turn down.\n  “The difference is, in tech, you are broadly treated more like a human being,” said one veteran visual effects artist who, like many of his peers, recently left Hollywood for a job in technology. He now works developing AR platforms for one the world’s largest tech companies.\n    Harvard Business School professor emeritus Shoshana Zuboff calls the Hollywood to Silicon Valley migration “the latest illustration of how tech empires are able to corner critical intellectual labor.” She likens the shift to what has happened in the field of artificial intelligence, as major technology companies persuade scientists to leave government or university jobs.\n  Hollywood’s visual effects industry has  struggled in recent years. Even as its work has become ubiquitous in film and television, falling prices have made it increasingly difficult to turn a profit, and compensation for workers has suffered.\n  The reverse has been true in AR and VR. Consulting company  Accenture PLC said last year it projects company spending in the immersive technologies to grow to $121 billion by 2023 from $21 billion in 2020.\n  “Our smartphone world has become so laden, so rich. We spend so much time looking down into this screen, there’s very little more we can do with that,” says early VR developer Mark Pesce. “The next [thing] is to turn the world into the screen…that is what AR offers.”\n    In recent years tech companies have leaned on the expertise of visual-effects professionals as they seek to create lifelike digital objects and characters.\n  “If you put on an AR or VR headset, you’re going to look at stuff,” said Mr. Debevec. “One of the most important things you’re going to see are people.”\n  While heading the USC Institute for Creative Technologies, Mr. Debevec and others designed what many in visual effects consider the most sophisticated device for capturing digital scans of humans that can then be animated later.\n    The Light Stage, as the device is known, is a nine-foot diameter spherical device with 14,000 lights and more than 40 cameras. It has played a key role in creating some of cinema’s most celebrated digital facsimiles of actors, such as Brad Pitt in “The Curious Case of Benjamin Button,” Will Smith for “Gemini Man” and even a deceased Paul Walker for “Furious 7.”\n  In 2017, Google built its own, bigger Light Stage, capable of capturing not just a person’s head, but the entire human form. With Mr. Debevec’s help, the company is using the device, in part, to try to create thoroughly convincing digital humans for AR and VR platforms.\n  Hao Li, another former head of the USC lab—who got into visual effects because he wanted to “fool an audience, in a good way”—has also had technology he co-developed to improve the production of digital characters for Hollywood acquired by Silicon Valley.\n  Apple bought facial-tracking technology developed by Mr. Li and colleagues and used it as the basis for its Animoji, which allows users to meld their own facial expressions with animated creatures. Some of his collaborators on the project started working at Apple shortly after the sale.", "posttime": "2020-11-04 07:47:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "艺术,ar,数字", "title": "为了改善AR和VR产品，科技公司正在聘请好莱坞的视觉艺术家，他们厌倦了自己行业的工作条件", "title_en": "Looking to improve their AR and VR offerings, tech companies are hiring Hollywood's visual artists, who are tired of their industry's working conditions", "transed": 1, "url": "https://www.wsj.com/articles/big-tech-enlists-hollywood-to-boost-adoption-of-enhanced-reality-11604399401?mod=djemalertNEWS", "via": "", "real_tags": ["艺术", "ar", "数字"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033080, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "市民应时刻保持对恐怖主义危险的警觉，如有任何可疑活动，请致电999向警方举报，或致电反恐热线0800 789 321。如果您的信息与迫在眉睫的威胁无关，您也可以联系军情五处。\n恐怖主义对英国(英格兰、威尔士、苏格兰和北爱尔兰)的威胁是严重的。\n威胁级别的设计是为了给出恐怖袭击可能性的广泛指示。\n国际恐怖主义对英国的威胁等级是由联合恐怖主义分析中心(JTAC)设定的。\n军情五处负责设定爱尔兰和其他国内恐怖主义在北爱尔兰和英国的威胁级别。\n在对任何特定情况下的适当威胁水平作出判断时，需要考虑几个因素。\n可获得的情报。很少有特定的威胁信息可用并且可以依赖。更多时候，对威胁的判断将基于广泛的信息，这些信息往往是零散的，包括当前恐怖活动的水平和性质，与其他国家事件和以前袭击的比较。情报只可能揭示一部分情况。\n恐怖分子的能力。根据以前的袭击或情报，检查有关恐怖分子的能力和他们可能使用的方法的已知情况。这也将分析攻击的潜在规模。\n恐怖分子的意图。利用情报和公开的信息来审查恐怖分子的总体目标以及他们可能实现这些目标的方式，包括他们将考虑攻击哪类目标。\n时间刻度。威胁级别表示近期内发生攻击的可能性。我们从过去的事件中了解到，一些袭击需要数年时间才能策划，而另一些袭击则更快地整合在一起。在缺乏具体情报的情况下，需要判断袭击可能离结果有多近。威胁级别没有任何固定的到期日期，但会定期进行审查，以确保它们保持最新。\n威胁级别本身并不需要公众做出具体的反应。它们是在关键国家基础设施(CNI)的不同部门工作的安全从业者和警察在确定可能需要什么保护性安全响应时使用的工具。\n无论当前的国家威胁水平如何，保持警惕都是至关重要的。考虑到当前的国家威胁，这一点尤为重要。与公众共享国家威胁水平，让每个人都了解情况。它解释了我们在日常生活中可能遇到的各种安全措施(例如机场安检或行李搜查)的背景。\n如果你有关于可能的恐怖活动的信息，请拨打反恐热线：0800 789 321。\n反恐热线是提供线报和机密信息的。有关可能的炸弹或其他紧急威胁的警告，请拨打999。\n自2006年以来，有关国家威胁级别的信息已经在军情五处和内政部网站上提供。2010年9月，还提供了与北爱尔兰有关的恐怖主义的威胁等级。\n2019年7月，对恐怖主义威胁等级系统进行了修改，以反映各种形式的恐怖主义构成的威胁，而不考虑意识形态。现在只有一个国家威胁级别来描述对英国的威胁，其中包括伊斯兰、北爱尔兰、左翼和右翼恐怖主义。", "note_en": "Members of the public should always remain alert to the danger of terrorism and report any suspicious activity to the police on 999 or the anti-terrorist hotline: 0800 789 321. If your information does not relate to an imminent threat, you can also  contact MI5.\n   The threat to the UK (England, Wales, Scotland and Northern Ireland) from terrorism is SEVERE.\n          Threat levels are designed to give a broad indication of the likelihood of a terrorist attack.\n    The threat level for the UK from international terrorism is set by the  Joint Terrorism Analysis Centre (JTAC).\n MI5 is responsible for setting the threat levels from Irish and other domestic terrorism both in Northern Ireland and in Great Britain.\n In reaching a judgement on the appropriate threat level in any given circumstance several factors need to be taken into account.\n  Available intelligence. It is rare that specific threat information is available and can be relied upon. More often, judgements about the threat will be based on a wide range of information, which is often fragmentary, including the level and nature of current terrorist activity, comparison with events in other countries and previous attacks. Intelligence is only ever likely to reveal part of the picture.\n Terrorist capability. An examination of what is known about the capabilities of the terrorists in question and the method they may use based on previous attacks or from intelligence. This would also analyse the potential scale of the attack.\n Terrorist intentions. Using intelligence and publicly available information to examine the overall aims of the terrorists and the ways they may achieve them including what sort of targets they would consider attacking.\n Timescale. The threat level expresses the likelihood of an attack in the near term. We know from past incidents that some attacks take years to plan, while others are put together more quickly. In the absence of specific intelligence, a judgement will need to be made about how close an attack might be to fruition. Threat levels do not have any set expiry date, but are regularly subject to review in order to ensure that they remain current.\n   Threat levels in themselves do not require specific responses from the public. They are a tool for security practitioners working across different sectors of the Critical National Infrastructure (CNI) and the police to use in determining what protective security response may be required.\n Vigilance is vital regardless of the current national threat level. It is especially important given the current national threat. Sharing national threat levels with the general public keeps everyone informed. It explains the context for the various security measures (for example airport security or bag searches) which we may encounter in our daily lives.\n If you have information about possible terrorist activity, call the Anti-Terrorist Hotline: 0800 789 321.\n The Anti-Terrorist Hotline is for tip-offs and confidential information. For warnings about possible bombs or other urgent threats please call 999.\n   Since 2006, information about the national threat level has been available on the MI5 and Home Office websites. In September 2010 the threat levels for Northern Ireland-related terrorism were also made available.\n In July 2019 changes were made to the terrorism threat level system, to reflect the threat posed by all forms of terrorism, irrespective of ideology. There is now a single national threat level describing the threat to the UK, which includes Islamist, Northern Ireland, left-wing and right-wing terrorism.", "posttime": "2020-11-04 07:43:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "恐怖主义,moves,威胁", "title": "军情五处将英国恐怖主义威胁级别提升至“严重”", "title_en": "MI5 moves UK Terrorism threat level to “SEVERE”", "transed": 1, "url": "https://www.mi5.gov.uk/threat-levels", "via": "", "real_tags": ["恐怖主义", "moves", "威胁"]}, {"category": "", "categoryclass": "", "imagename": "c8578acee531a818ff49706071bccc2f.jpg", "infoid": 1033079, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已知在世的最长寿的人是Kane Tanaka，一位令人难以置信的116岁的日本妇女。但如果你问大卫·辛克莱，他会说116岁只是中年。至少，他认为应该是这样。辛克莱是老龄化领域的顶尖科学家之一，他认为变老不是生活中自然的一部分--这是一种需要治愈的疾病。\n听起来很疯狂，对吧？哈佛大学教授辛克莱曾在2014年入选《时代》杂志全球最具影响力100人排行榜，他将默认每个人都会在某个时候死去，但他认为，我们可以将预期寿命翻一番，一直过上健康、积极的生活，直到最后。\n他的新书“长寿：为什么我们变老，为什么我们没有必要”(28美元，Atria Books)将于今年秋天出版，详细介绍了目前正在长寿领域发生的尖端科学。从这篇不那么快速的阅读中可以得到一个快速的结论：科学家们正在抛弃之前关于衰老的假设，他们发现了几个你现在可以用来减缓甚至在某些情况下逆转时钟的工具。\n上世纪90年代，作为麻省理工学院实验室的博士后，辛克莱在该领域引起了轰动，因为他发现了导致酵母衰老的机制，这为人类衰老提供了一些见解。辛克莱和他的实验室同事以他对酵母的研究为出发点，专注于识别人类衰老的机制，并在2013年发表了一项研究，断言一种名为sirtuins的蛋白质家族的故障是衰老的唯一主要原因。Sirtuins负责修复DNA损伤，并通过保持细胞正常工作来控制整体细胞健康。换句话说，sirtuins告诉肾细胞像肾细胞一样工作。如果细胞不堪重负，就会开始行为不端，我们就会看到衰老的症状，比如器官衰竭或皱纹。随着年龄的增长，我们细胞中的所有遗传信息仍然存在，但我们的身体失去了解读它的能力。这是因为我们身体的NAD含量开始下降，这是一种激活sirtuins的分子：我们50岁时体内的NAD是20岁时的一半。没有它，sirtuin就无法发挥作用，我们体内的细胞就会忘记它们应该做什么。\n辛克莱在美国和澳大利亚之间奔波，在哈佛医学院和新南威尔士大学管理实验室。他的所有研究都试图证明衰老是我们可以解决的问题-并找出如何阻止衰老。他认为，我们可以减缓衰老过程，在某些情况下甚至可以逆转这一过程，方法是将我们的身体置于增加NAD水平和促进sirtuin活动的“健康应激源”中。“sirtuins在衰老中的作用现在已经被很好地接受了，但我们可以重新激活它们(以及如何最好地做到这一点)的想法仍在研究中。”\n变冷，努力锻炼，偶尔挨饿，这些都参与了辛克莱所说的我们身体的生存电路，在这种电路中，sirtuin告诉细胞增强它们的防御，以保持有机体(你)的生命。虽然辛克莱的生存循环理论尚未在试验环境中得到证实，但有大量研究表明，锻炼、冷暴露和减少卡路里摄入都有助于减缓衰老的副作用，并延缓与变老相关的疾病。特别是禁食，已经得到了其他研究的很好支持：在各种研究中，接受限制饮食的小鼠和酵母都比吃得好的同组人活得更长。20世纪90年代进行的一项为期两年的人体实验发现，限制饮食让他们挨饿的参与者通常会降低血压、血糖水平和胆固醇水平。随后的人体研究发现，根据血液生物标志物的变化，减少12%的卡路里可以减缓生物衰老。\n长寿科学有点像狂野的西部：规则还没有完全确立。这项研究令人兴奋，但人类临床试验还没有发现任何确定的东西。纵观整个领域，私营公司、研究人员，甚至像哈佛这样的研究机构之间都存在一种令人不快的关系：辛克莱指出，一家名为Inside Tracker的公司进行的一项生物标记物测试证明了他自己的“生物年龄”降低了，但他也是该公司的投资者。他也被列为目前市场上NAD助推器持有的一项专利的发明家。\n当尘埃落定时，对于好奇的人来说，最好的建议是尝试那些容易、自由、健康和无害的习惯-比如快走、冷散步和吃清淡的饮食。辛克莱解释说，对于寒冷的暴露，适度是关键。他认为，只需在冬天不穿夹克散步就能收获好处。他也没有开出最有效的确切的禁食养生法，但他也不会推荐任何极端的东西-只是到处错过一顿饭，比如跳过早餐，吃晚一点的午餐。\n“长生不老”是一本及时的书，但不一定是一本容易读的书。科学知识很丰富，即使是在播客和演讲中听辛克莱解释，也无助于打断所有书呆子的话。但是，如果你对在50岁时扣篮，或者在70岁徒步阿巴拉契亚小径，或者有一天在你的生日蛋糕上吹灭100支蜡烛抱有些许希望，你可能会考虑在书架上腾出空间让人长寿。这里有足够的有用信息，值得你花时间。\n我们激励读者走出国门的使命从未像现在这样重要。近年来，外部在线报道了一项突破性的研究，将自然界中的时间与改善心理和身体健康联系起来，我们一直在向您通报美国公共土地面临的前所未有的威胁。我们严谨的报道有助于引发关于健康、旅行和冒险的重要辩论，它为读者提供了通往新的户外激情的通道。户外时间是必不可少的，我们可以帮助您充分利用这段时间。向外部在线捐款只需几分钟，将确保我们能够继续提供像您这样的读者所依赖的开创性、信息量大的新闻。我们希望您能支持我们。谢谢。\n为外部→做出贡献。\n主要图片：tomazl/i股票当您使用我们故事中的零售链接购买商品时，我们可能会赚取少量佣金。外部不接受编辑设备审查的费用。阅读有关我们政策的更多信息。\n您现在已订阅“天天移动”，我们不会以任何理由与任何人共享您的电子邮件。在我们的时事通讯注册页面上可以找到更多时事通讯。\n本网站受reCAPTCHA保护，适用谷歌隐私政策和服务条款。", "note_en": "The oldest-known living person is Kane Tanaka, a Japanese woman who is a mind-boggling 116 years old. But if you ask  David Sinclair, he’d argue that 116 is just middle age. At least, he thinks it should be. Sinclair is one of the leading scientists in the field of  aging, and he believes that growing old isn’t a natural part of life—it’s a disease that needs a cure.\n Sounds crazy, right? Sinclair, a Harvard professor who made  Time’s list of the  100 most influential people in the world in 2014, will acquiesce that everyone has to die at some point, but he argues that we can double our life expectancy and live healthy, active lives right up until the end.\n His new book,   Lifespan: Why We Age and Why We Don’t Have To  ($28, Atria Books), out this fall, details the cutting-edge science that’s taking place in the field of longevity right now. The quick takeaway from this not-so-quick read: scientists are tossing out previous assumptions about aging, and they’ve discovered several tools that you can employ right now to slow down, and in some cases, reverse the clock.\n In the nineties, as a postdoc in an MIT lab, Sinclair caused a stir in the field when he discovered the mechanism that leads to aging in yeast, which offered some insight into why humans age. Using his work with yeast as a launching point, Sinclair and his lab colleagues have focused on identifying the mechanism for aging in humans and published a study in 2013 asserting that the malfunction of a family of proteins called sirtuins is the single cause of aging. Sirtuins are responsible for repairing DNA damage and controlling overall cellular health by keeping cells on task. In other words, sirtuins tell kidney cells to act like kidney cells. If they get overwhelmed, cells start to misbehave, and we see the symptoms of aging, like organ failure or wrinkles. All of the genetic info in our cells is still there as we get older, but our body loses the ability to interpret it. This is because our body starts to run low on NAD, a molecule that activates the sirtuins: we have half as much NAD in our body when we’re 50 as we do at 20. Without it, the sirtuins can’t do their job, and the cells in our body forget what they’re supposed to be doing.\n Sinclair splits his time between the U.S. and Australia, running labs at Harvard Medical School and at the University of New South Wales. All of his research seeks to prove that aging is a problem we can solve—and figure out how to stop. He argues that we can slow down the aging process, and in some cases even reverse it, by putting our body through “healthy stressors” that increase NAD levels and promote sirtuin activity. The role of sirtuins in aging is  now fairly  well accepted, but the idea that we can reactivate them (and how best to do so) is still being worked out.\n Getting cold, working out hard, and  going hungry every once in a while all engage what Sinclair calls our body’s survival circuit, wherein sirtuins tell cells to boost their defenses in order to keep the organism (you) alive. While Sinclair’s survival-circuit theory has yet to be proven in a trial setting, there’s plenty of research to suggest that exercise,  cold exposure, and  calorie reduction all help slow down the side effects of aging and stave off diseases associated with getting older. Fasting, in particular, has been well supported by other research: in various studies, both mice and yeast that were fed restricted diets live much longer than their well-fed cohorts. A  two-year-long human experiment in the 1990s found that participants who had a restricted diet that left them hungry often had decreased blood pressure, blood-sugar levels, and cholesterol levels.  Subsequent human studies found that decreasing calories by 12 percent slowed down biological aging based on changes in blood biomarkers.\n Longevity science is a bit like the Wild West: the rules aren’t quite established. The research is exciting, but human clinical trials haven’t found anything definitive just yet. Throughout the field, there’s an uncomfortable relationship between privately owned companies, researchers, and even research institutes like Harvard: Sinclair points to a biomarker test by a company called  InsideTracker as proof of his own reduced “biological age,” but he is also an investor in that company. He is listed as an inventor on a patent held by a NAD booster that’s on the market right now, too.\n While the dust settles, the best advice for the curious to take from  Lifespan is to experiment with habits that are easy, free, and harmless—like taking a brisk, cold walk and eating a lighter diet. With cold exposure, Sinclair explains, moderation is the key. He believes that you can reap benefits by simply taking a walk in the winter without a jacket. He doesn’t prescribe an exact fasting regimen that works best, but he doesn’t recommend anything extreme—simply missing a meal here and there, like skipping breakfast and having a late lunch.\n Lifespan is a timely book, but it’s not necessarily an easy read. The science is dense, and even listening to Sinclair explain it on podcasts and during presentations doesn’t help cut through all of the nerd speak. But if you’re even mildly hopeful about dunking a basketball at the age of 50, or hiking the Appalachian Trail at 70, or blowing 100 candles out on your birthday cake someday, you might consider making room for  Lifespan on your bookshelf. There’s enough useful information to make it worth your time.\n Our mission to inspire readers to get outside has never been more critical. In recent years, Outside Online has reported on groundbreaking research linking time in nature to improved mental and physical health, and we’ve kept you informed about the unprecedented threats to America’s public lands. Our rigorous coverage helps spark important debates about wellness and travel and adventure, and it provides readers an accessible gateway to new outdoor passions. Time outside is essential—and we can help you make the most of it. Making a financial contribution to Outside Online only takes a few minutes and will ensure we can continue supplying the trailblazing, informative journalism that readers like you depend on. We hope you’ll support us. Thank you.\n  Contribute to Outside →\n   Lead Photo: tomazl/iStock When you buy something using the retail links in our stories, we may earn a small commission.  Outside does not accept money for editorial gear reviews.  Read more about our policy.\n You are now subscribed to  Move Every Day We will not share your email with anyone for any reason. Find more newsletters on our  newsletter sign-up page.\n This site is protected by reCAPTCHA and the Google  Privacy Policy and  Terms of Service apply.", "posttime": "2020-11-04 07:42:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,believes,研究", "title": "科学家认为衰老是可选的", "title_en": "Scientist Believes Aging Is Optional", "transed": 1, "url": "https://www.outsideonline.com/2404642/lifespan-david-sinclair-book-review", "via": "", "real_tags": ["科学家", "believes", "研究"]}, {"category": "", "categoryclass": "", "imagename": "802ba6826108d395341c70ad8fae2246.jpeg", "infoid": 1033078, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年6月，编剧约翰·里德利(John Ridley)为洛杉矶时报写了一篇评论文章，呼吁华纳媒体从他们新的流媒体服务HBO Max上删除电影《乱世佳人》。雷德利认为这部被广泛认为是美国经典的电影“美化了南北战争前的南方”(…)。(并延续了)一些对有色人种最痛苦的刻板印象。他的专栏文章引发了一场在线抗议，最终华纳媒体从HBO Max下架了《乱世佳人》，并以电影学者杰奎琳·斯图尔特(Jacqueline Stewart)为主角的新的介绍性免责声明转发了这部电影。\n雷德利专栏的成功指出了一个我们几乎所有人都接受的观点：电影、小说和电视节目对历史的描绘对我们记忆过去的方式产生了戏剧性的影响-无论是对的还是错的。但是，历史上的电子游戏就不能说同样的话吗？有没有等同于“乱世佳人”的电子游戏？答案是：差不多。1992年，俄勒冈步道的制造商明尼苏达教育计算公司(MECC)发布了一款名为“自由！”的游戏。使用俄勒冈小径的许多基本机制，自由！追随南北战争前一名逃亡奴隶试图逃离奴役的旅程。\n不像“乱世佳人”，自由！制作这本书是有值得称赞的理由的：教育小学生了解美国的奴隶制历史，强调非裔美国人抵制奴隶制，并表明摆脱奴隶制实际上是多么困难。自由！MECC的开发团队拥有数十年的教育软件开发经验，他们依靠学科专家和学术来源来确保游戏的历史准确性。此外，自由！以一种令人信服的方式制作：从第一人称的角度来看，玩家必须依靠环境线索和仔细的资源管理，才能穿越充满奴隶巡逻员、狗和自然障碍的危险地形。\n然而，归根结底，自由！是一场灾难。在1992年秋天发行后不久，“自由！因延续种族刻板印象而遭到严厉批评和抗议。1993年初，MECC拉动了自由！从商店货架上下架，并吊销了全国各地学校的游戏许可证。\n多么自由的故事！从一个有价值的想法到成为抗议对象始于1983年。那一年，明尼苏达州将MECC从一个国有非营利性财团转变为一个追求利润的公司。最初，MECC的创建目的是为明尼苏达州的学生提供计算机访问和软件。然而，到了20世纪80年代初，MECC开始向其他州出售他们软件的许可证，这些州急于向他们的学生介绍计算机，但缺乏在这些计算机上运行的经过验证的教育软件。明尼苏达州抓住了这个机会，放开了MECC，允许它不受约束地追求蓬勃发展的教育软件市场，只要该公司与州政府分享一部分利润。\n教育游戏经常被排除在视频游戏历史的流行描述之外，但就销售额和影响力而言，MECC是20世纪80年代最成功的游戏公司之一。到本世纪末，MECC主宰了美国的教育软件，与全国超过三分之一的学区保持着利润丰厚的许可协议。但它经常获得数百万美元的利润，这在很大程度上要归功于它销售历史书籍，如俄勒冈小径(Oregon Trail)，在所有迭代中售出了6500万册。1991年，当MECC被一家风险投资公司从明尼苏达州收购时，该公司积极寻求扩大其历史游戏组合。这种扩张采取了一种熟悉的形式，一系列游戏借用了俄勒冈小径的名称(例如非洲小径、亚马逊小径、育空小径)，以及俄勒冈小径的机制(如流氓般的、资源管理、基于回合的策略、高难度)。\n正是在这种环境下，自由！出现了。考虑到MECC的底线，自由！将是一个基于运行的历史模拟。但是为什么要做一个关于南北战争前奴隶制的游戏呢？MECC在他们的游戏宣传材料中说，自由！符合该公司“提供包容性教学材料”的承诺，以及“描绘来自不同文化的人的经历和观点”的目标。我们可以在这里推断出自由！这代表了对MECC主要客户(即强调多元文化教育的学区)的需求的认可，以及对MECC以前的许多历史标题，即俄勒冈小径，描绘了过去白人殖民视角的认识，损害了其他群体的利益。\n然而，“自由！”的主要灵感不是来自财政上的需要，甚至也不是来自俄勒冈小径，而是来自MECC总部附近的一个新的历史事件。\n在这样的背景下，什么是自由！真的喜欢吗？如果您不介意从我的废弃软件下载并在AppleWin之类的模拟器上运行，您可以自己玩这个游戏。如果你不介意的话，你可以在YouTube上找到几个让我们一起玩这个游戏的视频。\n无论哪种方式，你都会发现这款游戏显然是从俄勒冈小径中吸取了很多东西，但也会让你希望有痢疾和蛇咬伤的问题。自由！是极其困难的。您可以从选择南部的起点开始，这可以包括特拉华州、马里兰州或弗吉尼亚州。你的种植园的位置可以决定你的游戏最终会有多困难和多耗时，但无论你决定从哪里开始，你都会感觉到难以置信的压力。你的自由之旅将需要你克服几乎无穷无尽的奴隶巡逻者，带着狗的奴隶巡逻者，拿着灯笼的奴隶巡逻者，水，和“波涛汹涌”的水(通常是海洋，所以如果你遇到这些，你最好转身面对追你的任何版本的奴隶巡逻者)。\n除了游戏的敌人和自然障碍带来的持续威胁之外，你还需要管理你的营养、健康和耐力，以及跟踪你前进的方向。如果你的角色不是从指南针开始的，你就会跟着星星或者看着树上的苔藓来判断北方。一旦你被奴隶巡逻队追赶，你的角色就会毫无方向地奔跑，直到他们被抓获或逃跑，在这种情况下，你将不得不重新找到北方。鉴于你在俄勒冈州小径的白人玩家角色可以从容地沿着一条陈旧的道路向西前进，而不需要太多地担心环境危害，自由中黑人玩家角色的位置！让你感觉每次开始新的逃跑时，你都必须重新发明轮子，头上顶着一把枪。\n然而，最终，围绕自由的争议！与这个游戏难以置信的难度无关。相反，大多数争议都与玩家在游戏开始前遇到的人物和对话有关。在选择了你的出发地点之后，自由！为你的角色提供一个简短的传记，然后让你有机会在开始跑步之前拜访你的种植园的奴隶长老。这些长辈基本上与俄勒冈州步道的店主有着相同的目的：为您即将到来的北方之旅提供设备、食物和有用的提示。然而，这些长辈说的是一种方言，他们的外表(使用Apple II有限的调色板创造)经常像是非洲裔美国人的种族主义漫画。除了种植园的长老，玩家角色的对话选项经常包含断断续续的英语，他们的开始特征是随机的，可能包括不能读写。当地名和书面信息变得难以辨认，使得玩家更难完成游戏时，这一特性会极大地影响玩转。\n关于在“自由！”中使用特定于时代的方言，很明显，开发团队预计至少会有玩家的反对。你可以在这里阅读游戏手册，其中有一节特别提到了方言，内容是教练在第一次玩游戏之前可能想要与学生讨论的主题。这一节指出，包括这种方言“是为了保持一种历史时期…的‘感觉’(而且)是我们的顾问，一位非裔美国人极力推荐的。“。手册还提到，这款游戏在发布之前经过了双子城地区一群不同的教师和学生的测试。\n我采访了克莱姆森教授苏珊娜·阿什顿(Susanna Ashton)，她是19世纪奴隶叙事方面的专家，谈到了这项运动的方言。她认为，虽然游戏的方言对于19世纪和20世纪出版的奴隶叙述来说大致准确，但方言并不一定反映奴隶的实际说话方式。此外，从这些叙述中重建的方言往往会产生种族主义效果，即使没有种族主义意图。这种对自由的影响的最终结果！是一款没有教练指导的游戏，感觉和看起来更像是一场吟游诗人的表演，而不是准确的历史模拟。\n虽然开发人员小心翼翼地将“掩护你的屁股”的语言引用到方言中，但他们对他们推荐的教练用来补充班级游戏播放的活动类型有点漫不经心。该手册特别鼓励教师让他们的学生在课堂上“重演奴隶制”，一些学生扮演奴隶主的角色，另一些学生扮演奴隶的角色。然而，开发人员只是建议讲师们确保不要让“所有的\n不久之后，一群非裔美国家长向老师投诉，然后直接向MECC投诉说“自由！是无礼的和“任天堂化”的奴隶制。特别值得一提的是，这款游戏对方言的使用和对黑人的笼统描绘“让他们的孩子受到了嘲笑”。对于自由！的玩家来说，玩数字过去往往是让它在现实生活中复活的借口。学校负责人补充说，这款游戏淡化了“这些人所经历的痛苦和折磨”。正如一位家长简明扼要地说的那样，“奴隶制在我们的历史上不是一场游戏。”在与菲勒小学的家长小组和全国有色人种协进会的一名代表会面后，MECC将游戏从商店中撤下，并要求客户要么将游戏退还给MECC，要么销毁他们的副本。这款游戏的更新版从未发布。\n自由！围绕它的争论对MECC后来的发展进程产生了深远的影响。1994年，MECC聘请了一家外部公司为一个名为Africa Trek(最终改名为Africa Trail)的项目运营一个焦点小组，该项目的中心是从北部到南非的12000英里自行车之旅。在斯特朗图书馆(Strong Library)可以找到的焦点小组文件中，明确提到了“自由！”引起的“公众和(学校)的不良行政反应”，并建议不要把“非洲之旅”作为“发现你(非洲)根”的一种方式来推销。此外，专题小组强烈建议，“发展管理应获得消费者和教师的反馈”(…。作为出版前的灾难检查。正如一位焦点小组成员总结的那样，“每当你试图重现历史时，都会有很多敌意冒出来。”\n就像“乱世佳人”一样，自由！是一部制造和延续有害种族刻板印象的历史虚构作品的一个例子。然而，MECC剥夺了自由！从货架和计算机实验室下架意味着这款游戏和对它的批评在很大程度上已经被遗忘了。MECC有能力解决游戏的问题，但是自由！从未重发过。\n它应该得到第二次机会吗？在考虑这个问题时，研究俄勒冈越野赛的历史是很重要的。俄勒冈小径游戏最初是作为唐·拉维希(Don Rawitsch)1971年初中历史课程的补充课程而创建的，众所周知，它在首次亮相时没有提到美洲原住民，也没有提到向西扩张的更广泛的种族和民族影响。然而，随着几十年过去了，这款游戏的受欢迎程度越来越高，新的版本被创造出来，不仅解决了游戏的机械缺陷，还解决了它许多最严重的历史缺陷。在很大程度上，俄勒冈小径是在争议中反复出现的。\n自由！从来没有得到过这样的机会。但也许它应该这么做。意图在这里很重要。“乱世佳人”是为了将一段不存在的过去浪漫化。自由！是为了在一个重要而令人沮丧的未被教授的话题上教育玩家。在某种程度上，这个游戏的失败是学校从一开始就很少教授非裔美国人历史的重要原因。正如亨利·P·菲勒(Henry P.Fieler)的一位家长在1992年提出的那样，“我希望看到的是，在奴隶制游戏可以被用作教育工具之前，学校系统时期有一个非裔美国人的课程。”在阅读“自由！”最初的批评时，我们有理由认为，1992-93年的家长担忧不仅与游戏中对美国黑人的描绘有关，而且还与这样一个事实有关，即这一描绘从一开始就是在游戏中。自由！它可能是一款教育游戏，但它是在美国关于游戏的一场伟大的、周期性的歇斯底里中发布的，这要归功于像Mortal Kombat、Night Trap和Wolfenstein 3D这样的游戏。\n虽然自20世纪90年代初以来，美国人对游戏和游戏的看法有所改善，但最近在明尼苏达州和其他地方发生的事件表明，自自由以来，关于奴隶制和重建等主题的教育并没有太大变化！被释放了。这个问题是为什么教育者继续笨拙地、常常是灾难性地尝试以南北战争前奴隶制为中心的课堂角色扮演游戏的一大原因。他们把游戏和游戏看作是用教科书和传统教学来弥补失败的一种方式。这项工作的一个较好的例子是由政府资助的美国使命游戏Flight to Freedom，这是一款Flash游戏，讲述奴隶逃往自由的故事，但也巧妙地更新了角色的口语，以避免与《自由！》中的方言发生争议。就流行的游戏开发商而言，他们渴望与过去打交道，但前提是历史是有利可图的，而且他们可以在模糊的、包罗万象的免责声明背后找到错误的掩护(即，这款游戏是“由一个多文化团队…设计、开发和制作的”)。。\n也许历史知识--真正能够改变社会的历史知识--不可能存在于流行的游戏中。也许它甚至不能存在于教育性或严肃的游戏中。也许社会首先要改变：", "note_en": "In June, screenwriter John Ridley wrote an  op-ed for the Los Angeles Times that called on Warner Media to remove the film  Gone with the Wind from their new streaming service, HBO Max. Ridley argued that the film – widely regarded as an American classic – “glorifies the antebellum south…[and perpetuates] some of the most painful stereotypes of people of color.” His op-ed led to an online protest that culminated in Warner Media removing  Gone with the Wind from HBO Max and reposting the film with  a new introductory disclaimer featuring film scholar Jacqueline Stewart.\n  The success of Ridley’s op-ed points to an idea almost all of us accept: portrayals of history by movies, novels, and television shows have a dramatic effect—rightly or wrongly—on how we remember the past. But can’t the same thing be said about historical video games? Is there a video game equivalent to  Gone with the Wind? The answer is: almost. In 1992, the Minnesota Educational Computing Corporation or MECC, makers of  The Oregon Trail, released a game called  Freedom!. Using many of the underlying mechanics of  Oregon Trail,  Freedom! followed the journey of a runaway slave in the antebellum south attempting to escape bondage.\n  Unlike  Gone with the Wind,  Freedom! was made for laudable reasons: to educate grade school students on the history of slavery in the United States, to emphasize that African Americans resisted slavery, and to show how difficult the escape from slavery actually was.  Freedom! was also made by conscientious people: MECC’s development team boasted decades of experience creating educational software, and they relied on subject experts and scholarly sources to ensure the game’s historical accuracy. Moreover,  Freedom! was made in a compelling way: from a first person perspective, players had to rely on environmental clues and careful resource management in order to traverse a dangerous landscape filled with slave patrollers, dogs, and natural obstacles.\n  Ultimately, however,  Freedom! was a disaster. Shortly after its release in fall 1992,  Freedom! encountered heavy criticism and protests for perpetuating racial stereotypes. In early 1993, MECC pulled  Freedom! from store shelves and revoked the game’s license for schools across the country.\n  The story of how  Freedom! went from being a worthwhile idea to becoming the object of protest starts in 1983. That year saw the state of Minnesota convert MECC from a state owned nonprofit consortium  into a profit-seeking corporation. Originally, MECC was created to provide computer access and software for students within the state of Minnesota. By the early 1980s, however, MECC began to sell licenses for their software to other states, who were eager to introduce computers to their students but lacked proven educational software to run on those machines. Seizing on the opportunity, the state of Minnesota cut MECC loose, and allowed it to pursue the burgeoning educational software market unfettered, so long as the company shared a portion of its profits with the state.\n  It’s common to see educational games left out of popular accounts of the history of video games, but, in terms of both sales and influence, MECC was one of the most successful game companies of the 1980s. By the end of the decade, MECC dominated educational software in America, maintaining lucrative licensing deals with over 1/3 of the school districts in the country.  It routinely raked in millions in profits thanks in large part to its sale of history titles such as The Oregon Trail, which sold 65 million copies across all of its iterations. When MECC was purchased from Minnesota by a venture capital firm in 1991, the company aggressively pursued the expansion of its history game portfolio. This expansion took a familiar form, with a series of games borrowing  The Oregon Trail name (e.g.  Africa Trail,  Amazon Trail,  Yukon Trail), and  The Oregon Trail’s mechanics (i.e. roguelike, resource management, turn-based strategy, high difficulty).\n  It was in this environment that  Freedom! emerged. Given the context of MECC’s bottom line, it makes sense that  Freedom! would be a run-based historical simulation. But why make a game about antebellum slavery? In their promotional materials for the game, MECC stated that  Freedom! fit in with the company’s commitment “to providing inclusive instructional materials,” and their goal to “portray the experiences and perspectives of people from various cultures.” We can infer here that  Freedom! represented a nod to the needs of MECC’s primary customer (i.e. school districts emphasizing multicultural education) as well as an awareness that many of MECC’s previous history titles, namely  The Oregon Trail, portrayed a white colonial perspective of the past to the detriment of other groups.\n  The key inspiration for  Freedom!, however, didn’t come from financial necessity or even  The Oregon Trail, but instead from a new living history event near MECC’s headquarters in the Twin Cities region of Minnesota. In the late 1980s, an activist named Kamau Kambui began to run a live action role play event called Underground Railroad Reenactments (UGRRs) just outside of Minneapolis-St. Paul. These events placed participants in the role of fugitive slaves attempting to escape to freedom during the course of a night. You can learn more about Kambui and UGRRs from  this recent and excellent write up in The New Yorker. At some point in the early 1990s, Kambui met MECC designer Rich Bergeron, who used Kambui’s UGRRs as the basis for the history and gameplay in  Freedom!. Kambui became the game’s primary consultant, and, as  The New Yorker notes, “his influence is clear in the [game’s] emphasis on wilderness survival…period dialect and characters with a distinctly ‘African’ look.”\n  Given this background, what is  Freedom! actually like? You can play the game yourself, if you don’t mind downloading it from  My Abandonware and running it on an emulator like AppleWin. If you can&#39;t be bothered, you can find a few let’s plays of the game on YouTube.\n  Either way, what you’ll discover is a game that’s obviously drawing a great deal from  The Oregon Trail, but will also leave you wishing for problems with dysentery and snake bites.  Freedom! is brutally difficult. You start by choosing your origin point in the south, which can include Delaware, Maryland, or Virginia. The location of your plantation can determine how difficult and time consuming your playthrough will end up being, but regardless of where you decide to start you’ll feel incredible pressure throughout. Your journey to freedom will require you to overcome a near endless stream of slave patrollers, slave patrollers with dogs, slave patrollers with lanterns, water, and “rough” water (usually the ocean, so if you come across this you might as well turn and face whatever version of slave patroller is chasing you).\n  On top of the constant threat presented by the game’s enemies and natural obstacles, you’re also tasked with managing your nutrition, health, and stamina as well as keeping track of which direction you’re headed. If your character doesn’t start with a compass, you’ll be left following the stars or looking at moss on trees to determine north. And as soon as you’re chased by slave patrollers, your character will run directionless until they are either recaptured or escape, in which case you’ll have to find north all over again. Whereas your white player character in  Oregon Trail gets to follow a well worn path to the west at a leisurely pace without much beyond environmental hazards to worry about, the position of the black player characters in  Freedom! make you feel as though you have to reinvent the wheel with a gun at your head every time you start a new escape.\n  In the end, however, the controversy that enveloped  Freedom! had nothing to do with the game’s incredible difficulty. Instead, most of the controversy related to characters and dialogue that the player encounters before the game even begins. After choosing your starting location,  Freedom! presents you with a brief biography for your character and then gives you an opportunity to visit your plantation’s slave elders before starting your run. These elders essentially serve the same purpose as shop owners from  Oregon Trail: a source for equipment, food, and useful tips about your upcoming journey north. These elders, however, speak in a dialect and their appearance (created using Apple II’s limited color palette) often resemble racist caricatures of African Americans. In addition to the plantation elders, the player character’s dialogue options often contain broken English, and their starting characteristics, which are randomized, can include an inability to read and write. This characteristic can greatly affect a playthrough as place names and written messages become illegible, making it that much more difficult for the player to complete the game.\n  With regard to the use of era specific dialect in  Freedom!, it’s clear that the development team were expecting at least some pushback from players. The game’s manual, which you can read  here, makes special mention of dialect in a section on topics that instructors may want to discuss with their students ahead of playing the game for the first time. This section states that this dialect was included “to maintain a ‘feel’ for the historical period…[and] was highly recommended by our consultant, an African American.” The manual also mentions that the game was play tested by a diverse group of teachers and students in the Twin Cities area before release.\n  I talked with Clemson Professor Susanna Ashton, an expert on 19th century slave narratives, about the game&#39;s dialect. She felt that while the game&#39;s dialect was roughly accurate for published slave narratives from the 19th and 20th centuries, the dialect did not necessarily reflect how slaves actually spoke. Furthermore, the reconstructed dialect from these narratives could often have a racist effect even if there was no racist intent. The end result of this influence on  Freedom! is a game—without instructor guidance—that can feel and look more like a minstrel show rather than an accurate historical simulation.\n  While the developers were careful to include “cover your ass” language with reference to dialect, they were a bit more cavalier with the types of activities they recommended instructors use to supplement their class’ playthrough of the game. In particular, the manual encourages instructors to have their students “re-enact the institution of slavery” in the classroom, with some students roleplaying as slaveowners and the others roleplaying as slaves. The developers, however, merely recommended that instructors make sure to not let “all the white children be ‘owners’ and all black children or children of color be ‘slaves.’”\n  Reading the manual for  Freedom! reveals both the earnestness of the developers and their naivete. They are convinced of the importance and potential benefits of their game, but they are also hopeful that the game will only be played in an appropriate setting with instructor guidance. In practice, few players of  Freedom! ever played with an instructor, let alone read the manual. This issue manifested itself first at  Henry P. Fieler Elementary School in Merrillville, Indiana outside of Chicago. At Fieler,  Freedom! was added to “the school’s open computer lab, [and] offered as something  students could explore with their free time. No curriculum was attached.”\n  Soon after, a group of African American parents complained to teachers and then to MECC directly that  Freedom! was offensive and “Nintendoized” slavery. In particular, the game’s use of dialect and general depiction of blacks “exposed their children to ridicule.” For players of  Freedom!, playing the digital past was too often an excuse to resurrect it in real life. The school’s superintendent added that the game trivialized “the pain and suffering these folks went through.”  As one parent succinctly put it, “slavery was not a game in our history.” After meeting with the parent group at Fieler Elementary and a representative of the NAACP, MECC pulled the game from stores, and requested customers either return the game to MECC or destroy their copy. An updated version of the game was never released.\n  Freedom! and the controversy surrounding it had a profound effect on MECC’s subsequent development process. In 1994, MECC hired an outside firm to run a focus group for a project called  Africa Trek (eventually retitled, unsurprisingly,  Africa Trail), which was centered around a 12,000 mile bike journey from north to south Africa. The focus group’s documentation,  available at the Strong Library, explicitly references the “adverse public and [school] administrative reaction” to  Freedom!, and recommended that  Africa Trek should not be marketed “as a way to ‘discover your [African] roots.’” Moreover, the focus group panel strongly advised that “development management should obtain consumer and teacher feedback … as a disaster check” before publishing. As one focus group member summarized, “whenever you try to recreate history, there’s a lot of hostility that comes out.”\n  Like  Gone with the Wind,  Freedom! is an example of a work of historical fiction engendering and perpetuating harmful racial stereotypes. Yet MECC’s removal of  Freedom! from shelves and computer labs means that the game and the criticism of it have largely been forgotten. MECC had the capability to address the game’s issues, but  Freedom! was never rereleased.\n  Did it deserve a second chance? When considering this question, it’s important to study the history of  The Oregon Trail game. Originally created as a supplemental lesson for Don Rawitsch’s junior high history course in 1971,  The Oregon Trail game famously debuted without mention of Native Americans, or the wider racial and ethnic implications of westward expansion. Yet as the decades past, and the game’s popularity grew, new versions were created that addressed not only the game’s mechanical shortcomings but many of its worst historical faults as well. To a large extent,  The Oregon Trail was iterated out of controversy.\n  Freedom! never got that opportunity. But maybe it should have. Intent matters here.  Gone with the Wind was made to romanticize a nonexistent past.  Freedom! was made to educate players on an important, and depressingly under-taught topic. To a certain extent, the game’s failures were part and parcel of how little African American history was taught in schools to begin with. As one Henry P. Fieler parent argued in 1992, “What I’d like to see is an African-American curriculum in the school system period, before a slavery game can be used as an educational tool.” In reading the original criticism of  Freedom!, there’s a case to be made that parent concerns in 1992-93 related not just to the game’s depiction of black Americans, but also the fact that this depiction was in a game to begin with.  Freedom! may have been an educational game, but it was released right in the middle of one of America’s great, periodic hysterias about games in general, thanks to titles like  Mortal Kombat,  Night Trap, and  Wolfenstein 3D.\n  While America’s opinion on games and gaming have improved since the early 1990s, recent events in Minnesota and elsewhere have shown that not much has changed with  education on topics like slavery and reconstruction since Freedom! was released. This problem is a big reason why educators continue  to awkwardly and often disastrously attempt their own classroom roleplay games centered around antebellum slavery. They look to games and gaming as a way to make up for failures with textbooks and traditional instruction. One of the better examples of this work is the publicly funded Mission US game  Flight to Freedom, a flash game that follows a slave’s escape to freedom, but also deftly updates the character’s spoken language to avoid the controversies with dialect found in  Freedom!. Popular game developers, for their part, are eager to engage with the past, but only if the history is profitable and they can find cover for mistakes behind nebulous, catchall disclaimers (i.e. this game was “designed, developed, and produced by a multicultural team…”).\n  Maybe historical knowledge—real historical knowledge that could change society—can’t exist in popular games. Maybe it can’t even exist in educational or serious games. Maybe society has to change first: games can be an educational supplement, but there has to be something to supplement. The story of  Freedom! highlights how at once the game&#39;s message was absolutely necessary, but by itself was also insufficient to its purpose. Even  an experienced team of developers relying on expert knowledge published a game that had to be pulled from the shelves.\n  There&#39;s an irony here. Jacqueline Stewart’s introduction for  Gone with the Wind on HBO Max argues that the problematic film should remain available because it shines a light on the racial inequalities that existed at the time of its production and the inequalities that continue to this day. The same can be said of titles like the original  Oregon Trail, where the absence of indigenous people and slavery can be used to criticize the game as well as entrenched narratives of westward expansion. In the right hands, even badly flawed games and toxic works of art can still be used to teach history. But that history will still often be taught in relation to the white mythmaking and stereotyping that erased and reduced marginalized people.  Freedom!, which (however imperfectly) attempted to center the experience of fleeing slaves and highlight the horrors of the antebellum United States, remains a little-seen historical curiosity.", "posttime": "2020-11-04 07:42:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,小径,trail", "title": "“俄勒冈小径”工作室制作了一个关于奴隶制的游戏。然后父母就看到了", "title_en": "The 'Oregon Trail' Studio Made a Game About Slavery. Then Parents Saw It", "transed": 1, "url": "https://www.vice.com/en/article/3annjy/the-oregon-trail-studio-made-a-game-about-slavery-then-parents-saw-it", "via": "", "real_tags": ["游戏", "小径", "trail"]}, {"category": "", "categoryclass": "", "imagename": "01aed008b2f98e9b9459721d295a0f62.jpeg", "infoid": 1033077, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您认为您可以像我们一样，只需设置一个简单的STRIPE集成，然后继续前进，那么您就大错特错了。\n我记得就像昨天一样，我们开始计划推出付费订阅，需要整合一家支付提供商。分配两个星期应该很容易就够了，对吧？斯波普必须把它盖起来。我的意思是，我们不是第一家提供付费订阅的欧洲公司，必须有一个循序渐进的过程才能效仿…。🕳🐇。\n在这篇文章中，我将分享一些我们的研究和发现，这样您就可以有一个很好的概述，了解如何为您的SAAS业务实现这一过程，并希望能保住您的头发。\n首先，让我简要描述一下我们提供的在线服务类型，以确保它能满足您的需求。作为一家德国软件公司，我们是欧盟的一部分，也是TEMPO的创造者；TEMPO是一款可供全球个人和公司用于商业(B2B)和个人使用(B2C)的电子邮件客户端。\n我们希望能够提供月度和年度许可证(可能是分层的)，使用信用卡购买。稍后，如果它能支持苹果支付、微信、支付宝等数字钱包，那就更好了，我们还期待能提供折扣码，以及用于集团支付的许可证密钥。我们还希望提供试用期，无需预先输入付款方式(就我们个人而言，试用期满后，您会忘记取消并收到账单)。\n所有这些需求都指向Strip，我们已经在我们的早期支持者计划中尝试过它，但为了开始向欧洲客户提供真正的订阅，需要计算和报告增值税。令人惊讶的是，Stiped还没有直接提供这项服务(他们确实提供了第三方集成，稍后我会再谈到这些)。\n欧洲有44个国家，欧盟成员国适用不同的增值税税率，从卢森堡的17%到匈牙利的27%(普华永道对所有国家的真相来源)。这将需要在结账期间实时计算。然后，根据销售对象是经过验证的公司还是非公司(个人)以及他们所在的位置，结账流程会有所不同：\n只要提供了有效的增值税编号(是的，它需要验证)，就不会申请增值税。发票应注明适用反向收费规则，因此营业额以收件人的服务地点为准。\n仔细检查您选择的支付提供商是否可以正确配置发票，使其符合您所在国家/地区的要求。\n对于每笔增值税支付，必须将金额报告给征收增值税的每个欧盟国家的相关税务机关。因此，如果您在不同的欧盟成员国有20个非公司客户，您将需要向这20个税务机关报告收入。\n向您注册的国家/地区的主管部门提交的纳税申报单需要包括以下内容：\n注意-您必须保存至少10年的记录，以证明您符合欧盟增值税标准。\n幸运的是，有一个名为VAT Moss(Mini One Stop Shop)的计划，这是一个在线门户网站，可以帮助您通过选择的税务当局将您的每一笔欧盟增值税支付合并为一份单一的纳税申报单。然后，该税务当局将处理向每个欧盟成员国分配资金的问题。\nMOSS注册需要一些时间，所以在你开始开具发票之前，你的目标是把一切都准备好。检查您所在国家的流程。在英国，你必须在第一次销售后的10天前注册MOSS。(例如，1月8日首次销售，2月10日登记)。英国脱欧后，我猜英国将被视为一个非欧盟国家，但同样没有人确切地知道会发生什么，看看这个[_]。\n最方便的解决方案是使用记录商家(MOR)，该商家充当您的SaaS的经销商，负责支付、发票、税务和税务处理。例如：划桨、快速弹簧。\n使用与您选择的支付网关集成的第三方税务SaaS服务(例如，条纹、Braintree、GoCarless)以正确的税率自动开具发票，并提供随时可以提交的纳税报告。例如：Quaderno、Ocbat。然后您自己办理税务登记和税务汇款。一个例外是Payhip，它代表您提交纳税报告和汇款。\n自己动手(DIY)解决方案：向您选择的支付提供商输入相关税率。可能使用来自Taxlayer或Avalara的API。条纹检出“设置模式”也允许这样做。登记并给自己汇款。\n你可能在想“Chargebee，Recurly和Chargify怎么样？”我不会讨论这些，因为它们既不是支付网关，也不是MOR-它们专门管理您的订阅和计费逻辑，因此在技术堆栈中又增加了一层。请注意，条纹计费还可以处理订阅。\n我们决定不想把第三方(排名第二)加入到这一组合中，所以我们更深入地研究了条纹结账(排名第三)和MOR提供商(排名第一)的自定义安装过程。\n条带结账允许您从条带控制面板为每个欧盟位置创建税率对象。当用户订阅并输入地址和增值税id(如果有)时，他们可以检查是否有税率对象并应用它。Stripe根据VIE(增值税信息交换系统)验证任何给定的增值税号码，以证明该号码已被验证，之后收到网络挂钩，客户被更改为“反向收费”，并被收取不含增值税的费用。\n请注意，VIES是已知为维护而停机的政府系统，🙈，因此您可能需要说明如何在结账流程中处理这一问题。\n也可能发生国家更改增值税税率(如最近的新冠肺炎事件)，这需要手动更新。请注意，您不能更改现有税率对象，因此需要创建唯一的税率对象，例如德国-COVID。\n我们的联系人告诉我们，他们的费用都是以欧元收取的，并不适用于客户的当地货币，他们决定所有的价格都是含税的。他们使用MOSS报告增值税交易(这不是由STRIPE直接处理的)。\n欧洲卡1.4%+0.25欧元，其他所有卡2.9%+0.25欧元。如果需要兑换货币，需要加收2%的手续费。\n方法：在您的网站上创建一个页面，使用表单输入地址和增值税ID，然后将用户重定向到条纹结账。\n价值20亿美元的大公司(16亿美元融资！)-短期内不会倒闭。\n非常适合在手动增值税处理不太麻烦的单一或极少数市场销售。\n在欧洲做生意的最大障碍是，斯利普不会为你实现开箱即用的增值税自动化。在欧洲，税务处理是一个巨大的漏洞。\n您必须构建自己的表单来收集用户+增值税ID的位置，以便确定当您将用户重定向到条纹结账时可以传递的税率。\n考虑到条纹的规模，我们很惊讶他们没有一份资源文档来澄清与欧洲客户管理增值税的流程。这需要我们自己进行相当多的研究，并与他们的支持人员来回进行研究。\n这种一体化的解决方案激起了我们的兴趣--不需要在条纹之上建立另一层，不需要支付第三方的费用，也不需要花费时间与会计师一起手动工作。MOR在您这边处理整个客户账单旅程和纳税流程。您每月只从他们那里收到一张发票，而不是在每笔交易之后。\n最终，在这个阶段，我们宁愿花时间让核心产品变得更好，而不是试图优化/定制我们的支付流程的每一寸，或者处理手动报告。我们决定使用Paddle over FastSpring有几个原因。主要是因为他们位于欧盟，每笔交易的提成较低，而且如果您决定切换，他们不会阻止您将客户数据带到另一项服务(更多信息请单击此处)。\n2012年在英国成立。2330万美元B系列融资使用Paddle的公司：Framer，Put.io Tower。\n你每月会收到一张发票，上面有Ppale欠你的钱，而不是每笔与Strip的交易。\n无客户门户-客户要查看所有发票或管理其帐户，您需要使用Paddle中的API构建自己的页面。\n使用虚拟信用卡的测试帐户没有沙箱环境。Ppale可以手动设置一个单独的帐户，但在风险团队开始联系您之前有100美元的限制。有点不方便。\n创建计划时，请确保添加数量。您不能将用户从数量为0的计划移动到数量为1的计划。\n他们的试验系统可能达不到您的需要，因此请考虑构建您自己的系统。问题：他们的试用需要预先提供信用卡凭证。当一个计划有一个或多个订阅者时，您不能更改试用期。你不能在审判期间把人转移到不同的计划。没有立即购买按钮，因此用户需要等待试用期满才能付款。Paddle在试用期间向用户发送5封电子邮件。\n结账流程有它的怪异之处：措辞强硬的法律语言，所有产品都有1种样式，如果只提供一种支付选项，它仍然包括一个后退按钮来更改支付选项", "note_en": "If you think you can just setup a simple Stripe integration and move on, like us, you’d be sadly mistaken.\n  I remember like it was yesterday, we were beginning to plan for our paid subscriptions launch and needed to integrate a payments provider. Allocating two weeks should easily be enough right? Stripe must have it covered. I mean, we’re not the first European company to offer paid subscriptions, there has to be a step by step process to follow… 🕳🐇\n  In this article, I’m going to share some of our research and findings so that you have a good overview of how to approach the process for your SAAS business and hopefully save your hair.\n  First, let me briefly describe the kind of online service we offer to be sure that it can relate to your needs. As a German software company, we are a part of the EU and the creators of  Tempo; an email client that can be used for business (B2B) and personal use (B2C), by individuals and companies worldwide.\n  We wanted to be able to offer a monthly and annual licence (possibly tiered), purchased using a credit card. Later, it would be great if it can support digital wallets such as Apple pay, Wechat, Alipay etc., and we also anticipate the ability to offer discount codes, and licence keys for group payments. We also wish to offer a trial period without the need to enter a payment method up front (speaking from our personal peeves when that trial expires, you’ve forgotten to cancel and get billed).\n  All of these needs pointed to Stripe, which we had already tried out for our   early supporters program  but to  begin to offer real subscriptions to customers in Europe, VAT needs to be calculated and reported. Surprisingly Stripe does not directly offer this service yet (they do have third party integrations and I’ll touch on those a bit later on).\n  There are 44 countries in Europe, and different rates of VAT apply in the EU member states, ranging from 17% in Luxembourg to 27% in Hungary ( Source of truth for all countries by PWC ). This would need to be calculated in real-time during checkout. Then depending on if the sale is to a proven corporation or non-corporate (individual) and where they are located, the checkout process varies:\n    No VAT is applied so long as a valid VAT number is provided (yep it needs verification). The invoice should state that the reverse charge rule applies and thus the turnover is subject at the place of the recipient’s service.\n       Double check that your chosen payment provider can correctly configure the invoices to be compliant in your country.\n  For every VAT payment, the sum must be reported to the relevant tax authority in each EU country where it was charged. So in the case that you have 20 non-corporate customers in separate EU member countries, you will need to report the income to those 20 tax authorities.\n The tax declaration to the authority in your registered country needs to include the following:\n  Note — you must keep records for at least 10 years to show you are EU VAT compliant.\n  Luckily, there’s a scheme called VAT MOSS (Mini One Stop Shop), an online portal that helps you combine every single one of your EU VAT payments into one single tax return via the tax authority of your choice. That tax authority will then deal with the distribution of funds to each EU member state.\n The MOSS registration takes some time so aim to have everything in place before you start issuing invoices. Check the process in your country. In  the UK you must have MOSS registered by the 10th day of the month after your first sale. (e.g. first sale 8 Jan, registered by 10 Feb). Post-Brexit, I guess that the UK will be treated as if it were a non-EU country, but again no one knows for sure what the heck will happen, watch this [________].\n   The most convenient solution is to use a Merchant of Record(MoR) who acts as a reseller for your SaaS and handles the payment, invoices, tax, and handling of the tax. Examples:  Paddle,  Fastspring.\n Use a third party tax SaaS service that integrates with your chosen payment gateway (e.g. Stripe,  Braintree,  Gocardless) to automate invoicing at the correct rates as well as providing ready to submit tax reports. Examples:  Quaderno,  Octobat. You then handle the tax registration and remittance of taxes yourself. An exception is  Payhip which submits tax reports and remits on your behalf.\n Do it yourself (DIY) solution: Input the relevant tax rates to your chosen payment provider. Potentially using APIs from  Taxlayer or  Avalara.  Stripe Checkout “setup mode” also allows this. Register and remit yourself.\n You might be thinking “ what about, Chargebee, Recurly and Chargify?” I won’t cover these as they are neither a payment gateway, or MoR — they specialize in managing your subscription and billing logic and therefore add  another layer in the tech stack. Note that Stripe Billing can also handle subscriptions.\n We decided we didn’t want to add third parties (no.2) into the mix so we looked deeper into the custom setup process with Stripe Checkout (no.3) and MoR providers (no.1).\n  Stripe Checkout allows you to create tax rate objects for every EU location from the Stripe dashboard. When a user subscribes and enters an address and VAT id (if any) they can check if there is a tax rate object and apply it. Stripe validates any given VAT number against VIES (the VAT Information Exchange System) to prove the number is verified, after which the webhook is received, the customer is changed to “reverse charge” and is charged without VAT.\n Note that VIES is a government system that has been known to be down for maintenance,🙈 so you might want to account for how you handle that in the checkout flow.\n It can also happen that countries change their VAT rate (like with the recent COVID-19 event) and this needs to be updated manually. Note that you cannot change an existing tax rate object, so will need to create a unique one e.g. Germany-COVID.\n Our contact told us that they kept their fees all charged in EUR and not adapted to the customer’s local currency and they made the decision that all prices were tax inclusive. For reporting of transactions with VAT (which isn’t handled directly by Stripe) they used MOSS.\n  Stripe 1.4 % + €0.25 for European cards, 2.9 % + €0.25 for all others. If currency conversion is required, an additional 2% fee will apply.\n  How: Create a page on your website with the form to enter the address and VAT ID, after which you redirect the user to the Stripe Checkout.\n  Huge $2B valued company ($1.6B in funding!) — isn’t going out of business anytime soon.\n   Great for selling in single or very few markets where manual VAT handling is less hassle\n  The biggest hurdle for doing business in Europe is that Stripe does not automate VAT for you out of the box. Tax handling is a big gaping hole here in Europe.\n Have to build your own form to collect the location of the user + VAT ID in order to determine the tax rate which you then can pass along when you redirect the user to the Stripe Checkout.\n Given the size of Stripe, we were quite surprised that they didn’t have a resource doc to clarify the process of managing VAT with European customers. It required a fair amount of research on our own and back-and-forth with their support staff.\n  This all-in-one solution piqued our interest — no need to build another layer on top of Stripe, pay for third parties or spend time manually working with an accountant. A MoR handles the entire customer billing journey and tax processes on your side. You only receive one invoice from them per month instead of after every transaction.\n Ultimately, at this stage we’d rather spend our time making the core product even better than trying to optimize/customize every inch of our payment flow or deal with manual reporting .We decided to go with Paddle over Fastspring for a few reasons. Mainly due to their EU location, lower cut per transaction, and as they don’t prevent you from taking your customer data to another service if you decide to switch (more about this  here).\n  Founded 2012 in UK. $23.3M in funding series B. Companies using Paddle:  Framer,  Put.io Tower.\n   You receive an invoice 1x a month with what paddle owes you as opposed to every transaction with Stripe.\n  No customer portal — for a customer to view all invoices, or manage their account you need to build you own page using APIs from Paddle\n No sandbox environment for test accounts with dummy credit cards. Paddle can manually setup a separate account but there is a limit of $100 before the risk team will start contacting you. Kinda inconvenient.\n  When creating plans, make sure you add a quantity. You can’t move users from plan with quantity 0 to quantity 1\n    Their trial system might not be up to what you need so consider building your own. Issues: Their trial required credit card credentials upfront. When a plan has one or more subscribers you can’t change trial length. You can’t move people to different plan when on trial. No buy now button so users need to wait to trial expires to pay. Paddle sends 5 emails to users during trial\n Checkout flow has its quirks: strongly worded legal language, 1 styling for all products, if offering only one payment option it still includes a back button to change payment option", "posttime": "2020-11-04 07:42:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "选择,choose,需要", "title": "我们没有选择斯利普来处理欧盟订阅", "title_en": "We didn't choose Stripe to handle EU subscriptions", "transed": 1, "url": "https://medium.com/slight-pause/how-to-setup-saas-subscriptions-correctly-to-charge-vat-in-europe-d75d857b5d01", "via": "", "real_tags": ["选择", "choose", "需要"]}, {"category": "", "categoryclass": "", "imagename": "5cb36a63263176b1e3a660f7c99e3598.jpg", "infoid": 1033075, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "密歇根州正在进行一场短信宣传活动，目标是提供有关“选票传感器问题”的错误信息。根据“华盛顿邮报”的报道，这些信息声称是一个“印刷错误”，导致投票给乔·拜登的人把票换成了特朗普总统，而投票给特朗普的人又把票换成了拜登。这条恶作剧信息声称来自联邦调查局。\n密歇根州总检察长达娜·内塞尔(Dana Nessel)警告选民，这些短信是假的。她在推特上写道：“迪尔伯恩的选民们，据报道，发送短信是为了欺骗你，让你以为选票传感器有问题。”“别上当，这是个骗局！”\n在弗林特，由于投票站应该排起了长队，机器人电话一直试图欺骗人们明天投票(这是不允许的)。内塞尔也驳斥了这一说法，他在推特上写道：“有报道称，弗林特的居民接到了多个机器人电话，由于排队很长，他们应该明天投票。”显然，这是错误的，是为了压制投票。没有长队，今天是投票的最后一天。别相信那些谎言！让我们听到你的声音！RT PLS。“。\n这些竞选活动只是散布人们对2020年总统选举结果的疑虑的众多努力中的两项。据“华盛顿邮报”报道，在另一场活动中，机器人呼叫者一直在警告人们“保持安全，呆在家里”。这些电话始于今年夏天，在大选前有所增加，目标几乎是美国每一个城市。虽然他们没有提到2020年的竞选，但一位消息人士告诉“华盛顿邮报”：“我认为他们的意思是呆在家里，不要投票。”\n据《纽约时报》报道，摇摆州选民收到的有关2020年大选前邮寄投票的错误信息最多。根据媒体情报公司Zignal Labs的数据，9月1日至10月29日期间，宾夕法尼亚州收到了227,907起邮寄投票的谣言。\n一些谣言是在卢泽恩县的一名承包商错误地丢弃了少量军事选票后开始的。特朗普总统抓住这件事不放，谎称这是选民欺诈的证据。他在推特上写道：“马萨诸塞州RINO州长查理·贝克(Charlie Baker)试图在选票中捍卫邮件，但没有成功，因为到处都发现了欺诈行为。”“看看最近的一些竞选，或者宾夕法尼亚州被扔进垃圾桶的特朗普选票就知道了。”\n美国东部时间11月3日下午3：10更新：文章已经更新，包括密歇根州弗林特针对人的机器人通话的新闻。", "note_en": "A text message campaign is targeting people in Michigan with misinformation about “ballot sensor issues.” The messages claim a “typographical error” is causing people who voted for Joe Biden to have their votes switched to President Trump, and people who voted for Trump to have their votes switched to Biden,  according to  The Washington Post. The hoax message claims to be coming from the FBI.\n Michigan Attorney General Dana Nessel warned voters the text messages are fake. “Dearborn voters, text messages are reportedly being sent to trick you into thinking there are ballot sensor issues,”  she tweeted. “Do not fall for it, it’s a trick!”\n In Flint, robocalls have been trying to trick people into voting tomorrow (which is not allowed) due to supposedly long lines at polling stations.  Nessel debunked this claim too, tweeting: “Getting reports of multiple robocalls going to Flint residents that, due to long lines, they should vote tomorrow. Obviously this is FALSE and an effort to suppress the vote. No long lines and today is the last day to vote. Don’t believe the lies! Have your voice heard! RT PLS.”\n These campaigns are just two of the many efforts to spread doubt about the outcome of the 2020 presidential election. In a separate campaign, robocallers have been warning people to “stay safe and stay home,”  according to  The Washington Post . The calls, which began over the summer, have increased leading up to the election — targeting nearly every city in the US. While they do not mention the 2020 race, one source told the  Post: “I think they mean stay home and don’t vote.”\n Voters in swing states have received the most misinformation about voting by mail leading up to the 2020 election,  according to  The  New York Times. Between September 1st and October 29th, Pennsylvania saw 227,907 mail-in voting rumors, according to media intelligence company Zignal Labs.\n Some of the rumors started after a contractor in Luzerne County discarded a small number of military ballots in error. President Trump latched onto the story, falsely claiming it was evidence of voter fraud. “RINO Governor Charlie Baker of Massachusetts is unsuccessfully trying to defend Mail In Ballots, when there is fraud being found all over the place,”  he tweeted. “Just look at some of the recent races, or the Trump Ballots in Pennsylvania that were thrown into the garbage.”\n Update November 3rd, 3:10PM ET:  Article has been updated to include news about robocalls targeting people in Flint, Michigan.", "posttime": "2020-11-04 07:24:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "短信,hoax,投票", "title": "密歇根州短信传播选举恶作剧", "title_en": "Election Hoax Spreading Through Text Messages In Michigan", "transed": 1, "url": "https://www.theverge.com/2020/11/3/21547883/election-hoax-text-message-michigan-robocall", "via": "", "real_tags": ["短信", "hoax", "投票"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1033074, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stuart Marks Smarks at openjdk.java.net Tue Nov 3 03：18：08 UTC 2020此更改在Stream上引入了新的终端操作。这看起来像是Stream.Collect(Collectors.toList())或Stream.collect(Collectors.toUnmodifiableList())，的一个方便方法，但它不是。将此方法直接放在Stream上使其能够做收集器不容易做的事情。特别值得一提的是，它允许流直接将结果存放到目标数组中(即使是并行的)，并将此数组包装在一个不可修改的列表中，而不是复制。过去，我们将集合框架中的大部分内容作为Collector的实现保留，而不是直接在Stream上保存，而只有基本的内容(如toArray)才直接显示在Stream上。大多数收藏品都是如此，但是列表看起来确实很特别。它可以是数组的薄薄包装器；它可以比数组更好地处理泛型；与数组不同，它可以成为不可修改的(浅层不变)；它可以是基于值的。参见John Rose在错误报告中的评论：https://bugs.openjdk.java.net/browse/JDK-8180352?focusedCommentId=14133065&amp；page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14133065This操作是空容忍度，这与其余的流匹配。不过，这并未指定；在某些情况下，可能需要使用有关流中NULL处理的一般语句。最后，此方法确实非常方便(如果调用者可以处理此操作返回的内容)，因为收集到列表中是最常见的流终端操作。-提交消息：-8180352：add Stream.toList()方法更改：https://git.openjdk.java.net/jdk/pull/1026/files webrev：https://webrevs.openjdk.java.net/?repo=jdk&amp；pr=1026&amp；范围=00问题：https://bugs.openjdk.java.net/browse/JDK-8180352统计信息：6个文件中的405行已更改：358INS；23 DEL；24 MOD修补程序：https://git.openjdk.java.net/jdk/pull/1026.diff FETCH：GIT FETCH https://git.openjdk.java.net/jdk Pull/1026/Head：Pull/1026PR：https://git.openjdk.java.net/jdk/pull/1026", "note_en": "Stuart Marks  smarks at openjdk.java.net    Tue Nov 3 03:18:08 UTC 2020  This change introduces a new terminal operation on Stream. This looks like a convenience method for Stream.collect(Collectors.toList()) or Stream.collect(Collectors.toUnmodifiableList()), but it&#39;s not. Having this method directly on Stream enables it to do what can&#39;t easily by done by a Collector. In particular, it allows the stream to deposit results directly into a destination array (even in parallel) and have this array be wrapped in an unmodifiable List without copying.In the past we&#39;ve kept most things from the Collections Framework as implementations of Collector, not directly on Stream, whereas only fundamental things (like toArray) appear directly on Stream. This is true of most Collections, but it does seem that List is special. It can be a thin wrapper around an array; it can handle generics better than arrays; and unlike an array, it can be made unmodifiable (shallowly immutable); and it can be value-based. See John Rose&#39;s comments in the bug report: https://bugs.openjdk.java.net/browse/JDK-8180352?focusedCommentId=14133065&amp;page=com.atlassian.jira.plugin.system.issuetabpanels:comment-tabpanel#comment-14133065This operation is null-tolerant, which matches the rest of Streams. This isn&#39;t specified, though; a general statement about null handling in Streams is probably warranted at some point.Finally, this method is indeed quite convenient (if the caller can deal with what this operation returns), as collecting into a List is the most common stream terminal operation.-------------Commit messages: - 8180352: Add Stream.toList() methodChanges:  https://git.openjdk.java.net/jdk/pull/1026/files Webrev:  https://webrevs.openjdk.java.net/?repo=jdk&amp;pr=1026&amp;range=00 Issue:  https://bugs.openjdk.java.net/browse/JDK-8180352 Stats: 405 lines in 6 files changed: 358 ins; 23 del; 24 mod Patch:  https://git.openjdk.java.net/jdk/pull/1026.diff Fetch: git fetch  https://git.openjdk.java.net/jdk pull/1026/head:pull/1026PR:  https://git.openjdk.java.net/jdk/pull/1026", "posttime": "2020-11-04 07:20:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,方法,method,https", "title": "添加Stream.toList()方法[Java]", "title_en": "Add Stream.toList() Method [Java]", "transed": 1, "url": "https://mail.openjdk.java.net/pipermail/core-libs-dev/2020-November/070782.html", "via": "", "real_tags": ["java", "方法", "method", "https"]}, {"category": "", "categoryclass": "", "imagename": "da105df891404d33046bf50be5ffb811.jpg", "infoid": 1033073, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "包括苏塞克斯大学的两名物理学家在内的一组科学家已经找到了一种方法来绕过一个178年前的理论，这意味着他们可以有效地消除远距离的磁场。他们是第一个能够以一种具有实际利益的方式做到这一点的人。这项工作有望有广泛的应用前景。例如，患有阿尔茨海默氏症或帕金森氏症等神经系统疾病的患者未来可能会得到更准确的诊断。使用磁场扫描仪的医生能够抵消外界嘈杂的磁场，因此能够更准确地看到大脑中正在发生的事情。\n这项研究发表在“物理评论快报”上。它是苏塞克斯大学的Mark Bason博士和Jordan i Prat-Camps博士，以及来自巴塞罗那自治大学和其他机构的Rosa Mach-Batlle和Nuria Del-Valle之间的一项研究。\n1842年的恩肖定理限制了塑造磁场的能力。研究小组能够计算出一种创新的方法来绕过这一理论，以便有效地抵消实验中可能会混淆读数的其他磁场。\n实际上，他们是通过创造一种由仔细排列的电线组成的装置来实现这一点的。这会产生额外的磁场，从而抵消不需要的磁场的影响。科学家们多年来一直在与这一挑战作斗争，但现在该团队找到了一种新的策略来处理这些有问题的领域。虽然已经在更高的频率上实现了类似的效果，但这是第一次在低频和静电场(如生物频率)下实现这一效果，这将开启一系列有用的应用。\n量子技术和量子计算，其中来自外部磁场的噪音会影响实验读数。\n神经成像，一种叫做经颅磁刺激的技术，通过磁场激活大脑的不同区域。使用这篇论文中的技术，医生可能能够更仔细地处理需要刺激的大脑区域。\n生物医学，以更好地控制和操纵纳米机器人和磁性纳米颗粒，这些纳米机器人和磁性纳米颗粒通过。这一开发的潜在应用包括改进药物输送和磁热疗法。\n这篇论文的主要作者罗莎·马赫-巴特勒博士来自巴塞罗那自治大学，她说：从是否有可能在远处创建磁源这个基本问题出发，我们想出了一种远程控制磁力的策略，我们相信这一策略可以对依赖于分布在难以接近的区域(如人体内部)的技术产生重大影响。\n苏塞克斯大学数学与物理科学学院的马克·巴森博士说：“我们发现了一种绕过恩肖定理的方法，这是许多人没有想到的。”作为一名物理学家，这是相当令人兴奋的。但这不仅仅是一项理论练习，因为我们的研究可能会带来一些真正重要的应用：未来对运动神经元疾病患者进行更准确的诊断，例如，更好地理解大脑中的痴呆症，或者加快量子技术的发展。更多信息：罗莎·马赫-巴特勒(Rosa Mach-Batlle)等人，“在无法到达的区域裁剪磁场”，“物理评论快报”(Physical Review Letters，2020)。网址：10.1103/PhysRevLett.125.177204", "note_en": "A team of scientists including two physicists at the University of Sussex has found a way to circumvent a 178-year old theory which means they can effectively cancel magnetic fields at a distance. They are the first to be able to do so in a way which has practical benefits.    The work is hoped to have a wide variety of applications. For example, patients with neurological disorders such as Alzheimer&#39;s or Parkinson&#39;s might in future receive a more accurate diagnosis. With the ability to cancel out &#39;noisy&#39; external magnetic fields, doctors using magnetic field scanners will be able to see more accurately what is happening in the brain.\n  The study &#34;Tailoring magnetic fields in inaccessible regions&#34; is published in  Physical Review Letters. It is an   between Dr. Mark Bason and Jordi Prat-Camps at the University of Sussex, and Rosa Mach-Batlle and Nuria Del-Valle from the Universitat Autonoma de Barcelona and other institutions.\n  &#34;Earnshaw&#39;s Theorem&#34; from 1842 limits the ability to shape magnetic fields. The team were able to calculate an innovative way to circumvent this theory in order to effectively cancel other magnetic fields which can confuse readings in experiments.\n  In practical terms, they achieved this through creating a device comprised of a careful arrangement of electrical wires. This creates additional fields and so counteracts the effects of the unwanted magnetic field. Scientists have been struggling with this challenge for years but now the team has found a new strategy to deal with these problematic fields. While a similar effect has been achieved at much higher frequencies, this is the first time it has been achieved at low frequencies and static fields—such as biological frequencies—which will unlock a host of useful applications.\n    Quantum technology and quantum computing, in which &#39;noise&#39; from exterior magnetic fields can affect experimental readings\n Neuroimaging, in which a technique called &#39;transcranial magnetic stimulation&#39; activates different areas of the brain through magnetic fields. Using the techniques in this paper, doctors might be able to more carefully address areas of the brain needing stimulation.\n Biomedicine, to better control and manipulate nanorobots and magnetic nanoparticles that are moved inside a body by means of  . Potential applications for this development include improved drug delivery and magnetic hyperthermia therapies.\n  Dr. Rosa Mach-Batlle, the lead author on the paper from the Universitat Autonoma de Barcelona, said: &#34;Starting from the fundamental question of whether it was possible or not to create a magnetic source at a distance, we came up with a strategy for controlling magnetism remotely that we believe could have a significant impact in technologies relying on the   distribution in inaccessible regions, such as inside of a human body.&#34;\n  Dr. Mark Bason from the School of Mathematical and Physical Sciences at the University of Sussex said: &#34;We&#39;ve discovered a way to circumvent Earnshaw&#39;s theorem which many people didn&#39;t imagine was possible. As a physicist, that&#39;s pretty exciting. But it&#39;s not just a theoretical exercise as our research might lead to some really important applications: more accurate diagnosis for Motor Neurone Disease patients in future, for example, better understanding of dementia in the brain, or speeding the development of quantum technology.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tRosa Mach-Batlle et al, Tailoring Magnetic Fields in Inaccessible Regions,  Physical Review Letters (2020).  DOI: 10.1103/PhysRevLett.125.177204", "posttime": "2020-11-04 07:19:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "取消,circumvent,磁场", "title": "物理学家绕过数百年的理论取消磁场", "title_en": "Physicists circumvent centuries-old theory to cancel magnetic fields", "transed": 1, "url": "https://phys.org/news/2020-10-physicists-circumvent-centuries-old-theory-cancel.html", "via": "", "real_tags": ["取消", "磁场"]}, {"category": "", "categoryclass": "", "imagename": "6f5d93664f060440a14c63ebadb06e65.jpg", "infoid": 1033072, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "恐惧通常被视为一种负面情绪，一种让我们对环境中的潜在危险保持警惕的不良反应。但人类也倾向于寻找恐怖电影、恐怖小说或闹鬼的房子--而且不仅仅是在万圣节期间。在学术文献中，这种倾向被称为娱乐性恐惧：恐惧和享受的混合情感体验。但是，根据“心理科学”杂志的一篇新论文，恐惧因素必须恰到好处，才能达到这种混合状态。这篇论文将主观享受的这种金发地带与心率波动的范围相关联。\n“通过研究人类如何从恐惧中获得快乐，我们发现似乎存在一个‘甜蜜点’，让快乐最大化，”该研究的合著者、丹麦奥胡斯大学互动思维中心的研究员马克·马尔姆多夫·安德森(Marc Malmdorf Andersen)说。“我们的研究提供了一些关于恐惧、享受和娱乐形式的恐惧的身体唤醒之间关系的初步经验证据。”\n这只是奥胡斯大学(Aarhus University)的马蒂亚斯·克拉森(Mathias Clasen)带头开展的一项研究过程的最新进展，马蒂亚斯·克拉森是另一位合著者，也是《为什么会引发恐怖诱惑》一书的作者。例如，Clasen研究了恐怖粉丝的主要人格特征。(他们往往在体验的开放性上得分很高，这也被称为智力想象力。)。去年，我们报道了他对参与丹麦鬼屋活动的受试者使用的两种不同的恐惧调节策略的调查：一种是靠在恐惧中的肾上腺素瘾君子，另一种是试图压制恐惧的白指节者。第三项研究仍在进行中，将研究恐惧和记忆之间的关系。\n克拉森的核心假说--恐怖利用进化的恐惧系统--今年早些时候从芬兰图尔库大学的科学家的一项研究中得到了支持。他们使用核磁共振成像来绘制受试者在观看恐怖电影时的神经活动图：具体地说，2010年的电影《潜伏》和2016年的电影《招魂2》。在这两部电影中，参与者都对自己的恐惧程度进行了评分。\n正如我们之前报道的，芬兰的这项研究聚焦于两种类型的恐惧：一种是在可怕的环境中潜移默化的不祥预感，越来越多的人感觉到有些事情不太对劲，另一种是我们对突然出现的怪物或其他威胁(跳跃恐慌)的本能震撼反应。研究小组发现，在前一种情况下，视觉和听觉方面的大脑活动明显增加。在突如其来的休克场景中，参与处理情绪、评估威胁和做出决定的区域的大脑活动增强，越能更好地对任何感知到的威胁做出快速反应。\n这项最新研究基于对2017年在丹麦Vejle一年一度的Dystopia鬼屋实验中收集的数据的分析，Dystopia鬼屋是一个商业景点，有42个主题相连的房间，提供身临其境的真人恐怖体验。住在一家老水产厂，由一群恐怖爱好者经营，每年10月整整一个月都有多达300名志愿者参与其中。奥胡斯大学的研究人员将心率监视器绑在参与者身上，并为几个闹鬼的房间配备了红外摄像机。这样，他们就可以测量心率，还可以跟踪姿势和面部表情。参与者在他们的鬼屋体验之前和之后完成了问卷调查。\n该小组专注于鬼屋中的三个地点。在第一个实验中，参与者遇到了一位疯狂的科学家，他开始了一段很长的独白，然后踢翻了一个水桶-这是僵尸跳出来吓唬参与者的提示。第二起事件涉及内燃机点火，显示出一个戴着猪面具、穿着血淋淋的屠夫围裙的大个子男子(他用电锯追赶参与者)。最后，就在退场前，参与者会转过一个弯，意外地遇到一群咆哮的僵尸。\n“假设是，在恐惧过多和恐惧不足之间，在可预测性和不可预测性之间存在一个甜蜜点，在这种情况下，你觉得自己可以控制一定程度的情况，但仍然存在一定程度的不可预测性，”克莱森去年告诉Ars。研究结果在很大程度上支持了这一假设。当克拉森的团队绘制出实验参与者自我报告的恐惧程度和快乐程度之间的关系时，数据显示了一个倒U形--一个金发碧眼的区域，以获得最大的快乐。在参与者心率签名的数据中也有类似的U型趋势。\n安徒生说：“这与科学家发现的描述人类游戏的特征惊人地相似。”例如，我们知道，当个人的期望被违反到恰到好处的程度时，往往会激发好奇心，一些关于游戏的描述强调了恰到好处的不确定性和惊喜对于解释为什么玩耍感觉愉快的重要性。\n和往常一样，有一些警告，比如使用的行为测量(面部表情和肢体语言)是否是该指标的最佳方法。未来的研究可能会使用行为指标--也许使用加速计来跟踪参与者的动作，以应对跳跃恐慌。作者承认了许多方法上的挑战，这导致了相对较多的被排除在外的参与者(110人中有18人)。具体地说，鬼屋里的人经常会撞在一起，做出突然的动作，甚至会出汗，所有这些都偶尔会干扰参与者佩戴的心率监测器的信号检测。\n还有几位参与者被闹鬼屋等候区狂欢节般的气氛分散了注意力，以至于忘了填写必要的问卷。作者还承认，他们还不能确定这些发现是否超越了闹鬼的房子背景，推广到其他媒体，如恐怖片、恐怖小说、甚至过山车或极限运动。\n尽管如此，“我们关于恐惧和快乐如何在主观和生理层面共存的发现是耐人寻味的，”作者总结道，并呼吁未来的研究重复他们的发现。“就目前而言，将娱乐恐怖理解为一种游戏形式，似乎是解决恐惧心理学中一个由来已久的悖论的卓有成效的方法。”", "note_en": "Fear is typically viewed as a negative emotion, an adverse reaction to keep us on our toes with regard to potential dangers in our environment. But human beings also tend to seek out scary movies, horror novels, or haunted houses—and not just during the Halloween season. This tendency has been dubbed &#34;recreational fear&#34; in the academic literature: a &#34;mixed emotional experience of fear and enjoyment.&#34; But the scare factor has to be just right in order to achieve that mixed state, according to  a new paper in the journal Psychological Science that correlates this &#34;Goldilocks zone&#34; of subjective enjoyment with a telltale range of heart-rate fluctuations.\n “By investigating how humans derive pleasure from fear, we find that there seems to be a ‘sweet spot’ where enjoyment is maximized,”  said co-author Marc Malmdorf Andersen, a researcher at the Interacting Minds Center at Denmark’s Aarhus University. “Our study provides some of the first empirical evidence on the relationship between fear, enjoyment, and physical arousal in recreational forms of fear.”\n This is just the latest development in a course of research spearheaded by Mathias Clasen of Aarhus University, another co-author, and the author of   Why Horror Seduces. For instance, Clasen has examined the  dominant personality traits of horror fans. (They tend to score highly on openness to experience, also called intellect imagination.) And last year  we reported on his  investigation of two different fear-regulation strategies employed by subjects participating in a Danish haunted house: &#34;adrenaline junkies,&#34; who lean into the fear, and &#34;white-knucklers,&#34; who try to tamp down their fear. A third study still in progress will examine the relationship between fear and memory.\n  Clasen&#39;s core hypothesis—that horror exploits the evolved fear system—received a boost earlier this year from  a study by scientists at the University of Turku in Finland. They used an MRI to map the neural activity of subjects while the subjects watched horror movies: specifically, the 2010 film  Insidious and 2016’s  The Conjuring 2. Participants rated their fear levels throughout both films.\n As  we reported previously, the Finnish study focused on two types of fear: that creeping sense of foreboding in a spooky setting, with a growing sense that something is not quite right, and the instinctive jolting response we have to an unexpected sudden appearance of a monster or other threat (a jump scare). The team found that during the former scenarios, there are marked increases in brain activity in terms of visual and auditory perception. In the sudden shock scenarios, there was heightened brain activity in regions involved in processing emotion, evaluating threats, and making decisions, the better to respond rapidly to any perceived threats.\n This latest study is based on analysis of data gleaned from a 2017 experiment at the annual Dystopia haunted house in Vejle, Denmark, a commercial attraction with 42 thematically connected rooms, providing an immersive, live-action horror experience. Housed in an old fish factory and run by a group of horror enthusiasts, as many as 300 volunteers pitch in for the entire month of October each year. The Aarhus researchers strapped heart-rate monitors onto the participants and outfitted several of the haunted-house rooms with infrared cameras. That way they could measure heart rates and also track posture and facial expressions. Participants completed questionnaires before and after their haunted house experience.\n    The team focused on three locations in the haunted house. In the first, participants met a mad scientist, who embarked on a long monologue before kicking over a bucket—the cue for a zombie to jump out and frighten the participants. The second involved a combustion engine igniting, cueing the appearance of a large man in a pig&#39;s mask and a bloody butcher&#39;s apron (he pursued participants with a chainsaw). Finally, just before the exit, participants would turn a corner and unexpectedly encounter a horde of snarling zombies.\n “The hypothesis is that there&#39;s a sweet spot between too much fear and not enough fear, between predictability and unpredictability, where you feel you have a certain amount of control over the situation, but there’s still a degree of unpredictability,” Clasen told Ars last year. And the results largely support that hypothesis. When Clasen&#39;s team plotted the relationship between levels of self-reported fear and enjoyment by participants in the experiment, the data showed an inverted U-shape—a Goldilocks zone for maximum enjoyment. There was a similar U-shaped trend in the data for participants&#39; heart-rate signatures.\n “This is strikingly similar to what scientists have found to characterize human play,”  said Andersen. “We know, for instance, that curiosity is often aroused when individuals have their expectations violated to a just-right degree, and several accounts of play stress the importance of just-right doses of uncertainty and surprise for explaining why play feels enjoyable.”\n  As always, there are some caveats, such as whether the behavioral measures used (facial expression and body language) are the best approach for that metric. Future studies might employ behavioral proxies—perhaps using accelerometers to track participants’ movements in response to jump scares. The authors acknowledged numerous methodological challenges, which contributed to a relatively high number of excluded participants (18 out of 110). Specifically, people in the haunted house often bumped into each other, made sudden movements, or even broke out into sweats, all of which occasionally interfered with signal detection from the heart-rate monitors worn by participants.\n There were also several participants who were distracted enough by the carnival-like atmosphere of the haunted house waiting area to forget to fill out the requisite questionnaires. And the authors also acknowledged that they can’t yet determine whether these findings generalize beyond the haunted house setting to other media like horror films, horror novels, or even roller coasters or extreme sports.\n Nonetheless, “Our findings of how fear and enjoyment coexist on subjective and physiological levels are intriguing,” the authors concluded, calling for future studies to replicate their findings. “For now, understanding recreational horror as a form of play seems to be a fruitful approach to a longstanding paradox in the psychology of fear.”", "posttime": "2020-11-04 07:06:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "研究,house,恐惧", "title": "一项新的鬼屋研究表明，娱乐恐惧是一个甜蜜点", "title_en": "New haunted house study suggests there’s a sweet spot for recreational fear", "transed": 1, "url": "https://arstechnica.com/science/2020/11/new-haunted-house-study-suggests-theres-a-sweet-spot-for-recreational-fear/", "via": "", "real_tags": ["研究", "house", "恐惧"]}, {"category": "", "categoryclass": "", "imagename": "b5a4d80060f1d659e54bb44d5d905a66.jpg", "infoid": 1033071, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Hustle Fund是由伊丽莎白·殷(Elizabeth Yen)和埃里克·巴恩(Eric Bahn)两位前500家初创公司合伙人创建的，目标是投资于种子前的软件初创公司。传统上，该公司的运营方式是向一家公司投资2.5万美元，通常是使用最低生存能力的产品，然后与团队合作，帮助他们成长。据其网站显示，该公司每年进行约50项投资。\n这是一种小而集中的投资方式，这种方式已经让Hustle Fund参与了Webflow、NerdWallet和The Hustle等交易。但是，随着前期种子的增长，公司提高了高得离谱的第一轮检查，风投们可能有必要继续进行交易，需要更大的检查。因此，一只基金在几年后扩大基金规模既是现实的，也是预期的。\n不过，不要指望Hustle Fund现在就会改变其投资胃口。几个月前，殷加入了我们的Extra Crunch，详细介绍了她的食欲。\n“我认为在一定程度上，把钱投入到更快的实验中是有帮助的，但也就到此为止了，”殷说。“你不能用钱来推动执行的速度；它是通过学习的速度来实现的。我认为，在早期阶段，你可以投入多少和多少资源来提高学习速度，这是有上限的。“", "note_en": "Hustle Fund was created by  Elizabeth Yin   and Eric Bahn, two former 500 startups partners, with the goal of investing in pre-seed software startups. The firm has traditionally operated by investing $25,000 in a company, usually with a minimum-viable product, and then works with the team to help them grow. It does around 50 investments per year,  according to its website.\n  It’s a small but focused investing approach, one that has gotten Hustle Fund into deals such as Webflow, NerdWallet, and The Hustle. But, as pre-seed grows and companies raise absurdly high first-check rounds, the need for bigger checks might be necessary for VCs to continue getting into deals. Thus, a bigger fund size for a fund a few years in is both practical and expected.\n Still, don’t expect Hustle Fund to be changing up its investment appetite just yet. Yin joined us at Extra Crunch a few months ago to detail her check appetite.\n “I think to a certain extent, putting money into faster experiments helps, but it only goes so far,” Yin said. “You can’t drive speed of execution with money; it happens through the speed of learning. And I think that’s something that there’s an upper bound as to how much and how many resources you can put into increasing that speed of learning in the earlier stages.”", "posttime": "2020-11-04 07:02:38", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "hustle,fund,投资", "title": "\n种子前期公司Hustle Fund完成3000万美元新基金募集", "title_en": "\n\t\t\t\tHustle Fund, a pre-seed firm, closes $30M for a new fund\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/03/hustle-fund-a-pre-seed-firm-closes-30m-for-a-new-fund/", "via": "", "real_tags": ["hustle", "fund", "投资"]}]