[{"category": "", "categoryclass": "", "imagename": "33035adddc477a87a84cb5a219fde3fc.png", "infoid": 1010994, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自Greylock、General Catalyst、Accel、Plexo Capital等公司的顶级风险投资家将分享他们关于如何为您的公司筹集资金的秘密。例如，如果你需要优化你的投球台，或者决定在推销时是自举还是避免陷阱，甚至是如何让你的公司被收购，这都是你能够从种子到IPO学习的地方。\n为了成长，你必须建立和吸引你的观众，但是你如何在人群中脱颖而出呢？增长的秘诀是什么？在TC的早期阶段，我们将有几位营销专家随时待命，为您提供发展品牌个性所需的技巧和技巧，并教您如何面对新客户。\n为了确保机器以最佳状态运行，所有部件都需要有效地协同工作。当你在招聘员工、开发和保护你公司的技术堆栈、扩大董事会或构建你的条款说明书时，这些研讨会可以帮助你微调公司运行所需的所有功能拼图。\n你不仅会遇到专家，还会有数以百计的其他创始人可以随时听从你的安排，与其他投资者和服务提供商分享最佳实践，会见其他投资者和服务提供商，并扩大你的社交圈。它是锦上添花，增加您的整个TC早期体验。此外，你甚至可以在演出开始之前就开始与其他参会者建立联系！\n我们将尽可能保持这些会议的私密性，这样您就有机会与演讲者接触，并从每个研讨会中获得最大的收获。某些会话已达到容量，因此您需要快速行动并立即注册。所有的课程都将在活动结束后独家提供给TC早期参与者观看，因此如果您错过了一个课程，您仍然可以按需观看课程。现在就领取机票，并在网上确保您在TC Early Stage的座位。", "note_en": "Top venture capitalists from Greylock, General Catalyst, Accel, Plexo Capital and more will share their secrets on how to raise funds for your company. For example if you need to optimize your pitchdeck or deciding whether to bootstrap or pitfalls to avoid when pitching or even how to get your company acquired this is the place where you will be able to learn it all from seed to IPO.\n  In order to grow, you have to build and engage your audience but how do you stand out in the crowd? What’s the secret sauce for growth? At  TC Early Stage, we’ll have several marketing mavens on tap to provide the tips and tricks you’ll need to develop your brand’s personality and teach you how to get in front of new clients.\n   To make sure the machine is operating at its best, all of the pieces need to work together effectively. As you are hiring employees, developing and securing your company’s tech stack, building out your board, or structuring your term sheets, these workshops can help you to fine tune all of the functional puzzle pieces of your company that make it run.\n  Not only will you have the experts to meet but you’ll also have hundreds of other founders who are at your disposal to share best practices, meet other investors and service providers and expand your social graph. It’s the icing on the cake to augment your entire  TC Early Stage experience. Plus you’ll be able to kick-start your networking with other attendees before the show even begins!\n  We’re keeping these sessions as intimate as possible so you have opportunities to engage with speakers and get the most out of each workshop. Some sessions have already reached capacity, so you’ll want to act fast and register now. All of the sessions will be exclusively available for  TC Early Stage attendees to view after the event concludes so if you miss one, you’ll still be able to watch the session on demand.  Get your tickets now and secure your seat at  TC Early Stage online.", "posttime": "2020-07-10 22:07:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "tc,attend", "title": "\n参加TC早期在线培训的五个原因", "title_en": "\n\t\t\t\tFive reasons to attend TC Early Stage online\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/10/five-reasons-to-attend-tc-early-stage-online/", "via": "", "real_tags": ["tc", "attend"]}, {"category": "", "categoryclass": "", "imagename": "1acca21756625a274d1ff82dafdeba3b.jpeg", "infoid": 1010993, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "个人电脑行业在经历了多年来最疲软的季度后，在2020年第二季度出现反弹，主要是由于冠状病毒大流行推动的就地避难订单。根据Gartner和IDC的数据，第二季度PC出货量同比增长-前者表示出货量总计6480万台(比2019年第二季度增长2.8%)，而IDC表示全球出货量达到7230万台，与去年同期相比增长11.2%。\n这两个组织都将增长归因于第一季度供应链中断后个人电脑产量的增长，以及现在更多的人需要电脑在家工作或学习的强劲需求。高德纳研究总监北川美子(Mikako Kitagawa)表示：“在2020年初，新冠肺炎疫情导致个人电脑供应链严重中断后，本季度的部分增长是由于分销商和零售渠道将其供应重新补充到接近正常的水平，”高德纳研究总监北川美子(Mikako Kitagawa)表示。\n尤其是由于人们的远程学习和工作需求，移动PC或笔记本电脑市场表现非常出色。然而，这两个组织都对这种需求是否会持续到2020年以后表示怀疑。北川说，需求的上升是“短期的……。由于新冠肺炎大流行的影响。“。IDC研究副总裁林恩·黄(Linn Huang)也发表了类似的声明：\n由于库存仍在积压，这种商誉将持续到7月份。然而，随着我们越来越深地陷入全球经济衰退，善意情绪将日益恶化。\n这两个组织还指出，美国和欧洲、中东和非洲(EMEA)地区的传统个人电脑出货量超出了预期。惠普(HP)和联想(Lenovo)在全球个人电脑供应商排行榜上名列前茅，IDC和高德纳(Gartner)的戴尔均位居第三。", "note_en": "The PC industry bounced back in the second quarter of 2020 after its  weakest quarter in years mostly due to shelter-in-place orders prompted by the coronavirus pandemic. According to both  Gartner and  IDC, PC shipments grew year-over-year in the second quarter — the former says shipments totaled 64.8 million units (a 2.8 percent increase from Q2 2019), while IDC says global shipments reached 72.3 million units, which is 11.2 percent higher compared to the same period last year.\n Both organizations attribute the growth to PC production ramping up after supply chains were disrupted in the first quarter and to strong demand, now that more people need computers to work or study from home. “After the PC supply chain was severely disrupted in early 2020 due to the COVID-19 pandemic, some of the growth this quarter was due to distributors and retail channels restocking their supplies back to near-normal levels,” Gartner research director Mikako Kitagawa said.\n  The mobile PC or laptop segment did very well, in particular, due to people’s remote learning and working needs. However, both organizations are skeptical that the demand would continue beyond 2020. Kitagawa says the uptick in demand is “short-term... due to the impact of the COVID-19 pandemic.” IDC research vice president Linn Huang issued a similar statement:\n &#34;With inventory still back ordered, this goodwill will continue into July. However, as we head deeper into a global recession, the goodwill sentiment will increasingly sour.&#34;\n Both organizations also noted that traditional PC shipments exceeded expectations in the US and in the Europe, Middle East and Africa (EMEA) region. HP and Lenovo topped the list of PC vendors worldwide, with Dell coming in third for both IDC and Gartner.", "posttime": "2020-07-10 22:06:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "安排,pc,增长", "title": "由于在家工作的安排，全球PC出货量增长", "title_en": "Worldwide PC Shipments Grew Due To Work-From-Home Arrangements", "transed": 1, "url": "https://www.engadget.com/worldwide-pc-shipments-grew-due-to-workfromhome-arrangements-040609642.html", "via": "", "real_tags": ["安排", "pc", "增长"]}, {"category": "", "categoryclass": "", "imagename": "78743781e8be35578e3f280247d7fdeb.jpeg", "infoid": 1010992, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-英伟达(NVDA.O)首次超过英特尔(INTC.O)，成为美国最有价值的芯片制造商。\n作为半导体行业的一个里程碑，NVIDIA的股价在周三下午的交易中上涨2.3%，达到创纪录的404美元，使这家图形组件制造商的市值达到2,480亿美元，略高于英特尔的2,460亿美元，英特尔曾是全球领先的芯片制造商。\n近年来，随着NVIDIA从核心的个人电脑芯片业务扩展到数据中心、汽车和人工智能，NVIDIA的股票一直是华尔街表现最强劲的股票之一。英特尔几十年来一直在个人电脑和服务器处理器领域占据主导地位，在智能手机革命中遭遇重大挫折后，该公司一直难以实现业务多元化。\n自3月23日标准普尔500指数触及低点以来，美国芯片制造商的表现大多强于大盘，但英特尔享受到的反弹要比英伟达少得多，英伟达经常是富达(Fidelity)和其他散户投资网站上成交量最大的股票之一。\n英特尔的股价在2020年下跌了近3%，而英伟达的股价飙升了68%。投资者一直押注，由于冠状病毒大流行而转向远程工作，将继续推动NVIDIA数据中心业务的快速增长。\n近年来，英特尔也面临国外对手更激烈的竞争，市值早已跌破韩国三星电子(005930.KS)和台积电(2330.TW)。\n最近，英特尔在其庞大的供应链中遭遇挫折，原因是疫情蔓延，以及与即将到来的“老虎湖”10纳米处理器开发相关的更高成本。\n尽管NVIDIA股价迅速上涨，但其销售额仍只是英特尔的一小部分。根据Refinitiv的数据，分析师平均预计NVIDIA当前财年的营收将增长34%，至146亿美元，而分析师预计英特尔2020财年的营收将增长2.5%，至738亿美元。\n反映出投资者对NVIDIA未来获利增长的乐观情绪，目前NVIDIA的股价预期市盈率为45倍，而英特尔的预期市盈率为12倍。", "note_en": "(Reuters) - Nvidia (  NVDA.O) has overtaken Intel (  INTC.O) for the first time as the most valuable U.S. chipmaker.\n  In a semiconductor industry milestone, Nvidia’s shares rose 2.3% in afternoon trading on Wednesday to a record $404, putting the graphic component maker’s market capitalization at $248 billion, just above the $246 billion value of Intel, once the world’s leading chipmaker.\n   Nvidia’s stock has been among Wall Street’s strongest performers in recent years as it expanded from its core personal computer chip business into datacenters, automobiles and artificial intelligence. Intel, which for decades has dominated in processors for PCs and servers, has struggled to diversify its business after making critical stumbles in the smartphone revolution.\n U.S. chipmakers have mostly outperformed since the S&amp;P 500 hit a low on March 23, but Intel has enjoyed much less of that rebound than Nvidia, which is frequently among the most traded stocks on Fidelity and other retail investing websites.\n While Intel’s stock has lost almost 3% in 2020, Nvidia’s has surged 68%. Investors have been betting that the shift to working remotely because of the coronavirus pandemic will continue to fuel fast growth in Nvidia’s datacenter business.\n In recent years, Intel has also faced greater competition from foreign competitors, and its market capitalization has already fallen below those of South Korea’s Samsung Electronics (  005930.KS) and Taiwan Semiconductor Manufacturing Co (  2330.TW).\n Most recently, Intel has suffered setbacks in its sprawling supply chain due to the pandemic, and higher costs related to the development of upcoming “Tiger Lake” 10-nanometer processors.\n Despite Nvidia’s meteoric stock rise, its sales remain a fraction of Intel’s. Analysts on average see Nvidia’s revenue rising 34% in its current fiscal year to $14.6 billion, while analysts expect Intel’s 2020 revenue to increase 2.5% to $73.8 billion, according to Refinitiv.\n Reflecting investors’ optimism about Nvidia’s future profit growth, Nvidia’s shares are currently trading at 45 times expected earnings, while Intel’s trade at 12 times expected earnings.", "posttime": "2020-07-10 22:06:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "芯片,nvidia,美国,英特尔,2020", "title": "英伟达超过英特尔成为最有价值的美国芯片制造商，市值达2480亿美元以上，因为其股价在2020年飙升了68%", "title_en": "Nvidia surpasses Intel as the most valuable US chipmaker, with a market cap of $248B+ as its stock has surged 68% in 2020", "transed": 1, "url": "https://www.reuters.com/article/us-usa-stocks-chips/nvidia-eclipses-intel-as-most-valuable-u-s-chipmaker-idUSKBN2492Z8", "via": "", "real_tags": ["芯片", "nvidia", "美国", "英特尔", "2020"]}, {"category": "", "categoryclass": "", "imagename": "7568bd3011818c954edb3f9733188ee3.jpeg", "infoid": 1010990, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国财政部周三称，亚马逊同意就其违反多项美国制裁规定的指控达成和解。\n根据亚马逊与财政部外国资产控制办公室(Office Of Foreign Assets Control)之间的和解协议，这家总部位于西雅图的电商巨头涉嫌向受到美国制裁的个人或实体提供商品和服务，这主要是因为该公司的自动筛选流程存在缺陷。外国资产控制办公室负责执行美国的经济和贸易制裁。\n亚马逊同意支付的和解金额-约为13.5万美元-与该公司的规模相比微不足道，该公司的市值约为1.5万亿美元。但该协议突显了实施和维持有效的制裁遵守工具和计划的重要性，以及此类工具有时如何会让即使是最大、最复杂的公司也会失败。\n苹果公司。去年，该公司就违反美国制裁的指控达成和解，与一家列入黑名单的实体打交道两年多，因为由于标点符号和字母案例的明显差异，该公司的制裁筛选工具未能识别出列入黑名单的实体。\n亚马逊自愿披露了涉嫌的违规行为，并采取了补救措施-根据OFAC的说法，这些因素在和解总额中发挥了作用-也存在类似的问题。\nOFAC说，亚马逊的自动制裁筛查程序未能全面分析交易和客户数据，比如受制裁司法管辖区的常见替代拼写，该公司的筛查系统未能标记可能与美国法规相抵触的订单。\n根据和解协议，亚马逊为位于伊朗和叙利亚等美国制裁地区的个人和实体，或被美国列入黑名单的个人和实体，如被指定为毒贩、全球恐怖分子或大规模杀伤性武器扩散者，接受和处理这些消费品和服务订单。\n根据协议，在数百起案例中，亚马逊的系统据称未能标记出美国黑名单上个人和实体的拼写正确的姓名和地址。\nOFAC表示，亚马逊的制裁审查系统也未能标记出含有克里米亚拼写变化的地址的订单，也没有遵守涉及黑海半岛的某些交易的报告要求。美国通常禁止向克里米亚进出口商品、服务和技术，除非获得许可证。\nOFAC赞扬亚马逊配合调查，提供了对指控的违规行为的数据分析，并实施了重大补救措施来解决制裁筛选问题。这些努力包括增加公司合规团队的人数，并聘请内部和第三方消息来源审查其制裁合规计划。", "note_en": "Amazon.com  agreed  to settle allegations that it violated multiple U.S. sanctions regulations, the U.S. Treasury Department said Wednesday.\n  The Seattle-based e-commerce giant allegedly provided goods and services to individuals or entities subject to U.S. sanctions, primarily due to deficiencies in the company’s automatic screening processes, according to a settlement agreement between Amazon and the Treasury’s Office of Foreign Assets Control, which enforces U.S. economic and trade sanctions.\n    The amount Amazon agreed to pay to settle the allegations—about $135,000—is paltry compared with the size of the company, which has a market cap of about $1.5 trillion. But the agreement highlights the importance of implementing and maintaining effective sanctions-compliance tools and programs, and how such tools can sometimes fail even the largest and most sophisticated companies.\n    Apple Inc. last year  settled allegations it violated U.S. sanctions by dealing with a blacklisted entity for more than two years because the company’s sanctions-screening tool failed to identify a blacklisted entity due to apparent differences in punctuation and letter cases.\n    Amazon, which voluntarily disclosed the alleged violations and took remedial measures—factors that played a role in the settlement total, according to OFAC—had a similar issue.\n  OFAC said Amazon’s automated sanctions-screening processes failed to fully analyze transaction and customer data, such as common alternative spellings of a sanctioned jurisdiction, and that the company’s screening system failed to flag orders that could have run afoul of U.S. regulations.\n    Amazon accepted and processed these orders of consumer goods and services for individuals and entities located in regions under U.S. sanctions, such as Iran and Syria, or that had been blacklisted by the U.S., such as designated as drug traffickers, global terrorists or proliferators of mass destruction weapons, according to the settlement agreement.\n  In several hundred instances, Amazon’s system allegedly failed to flag the correctly spelled names and addresses of people and entities on the U.S. blacklist, according to the agreement.\n  Amazon’s sanctions-screening system also failed to flag orders containing addresses with variation of the spelling of Crimea and had failed to comply with reporting requirements for certain transactions involving the Black Sea peninsula, OFAC said. The U.S. generally prohibits the import and export of goods, services and technology to or from Crimea, unless allowed under licenses.\n  OFAC credited Amazon for cooperating with the investigation by providing data analysis of the alleged breaches and implementing significant remedial measures to address the sanctions screening issues. These efforts included adding head count to the company’s compliance team and employing internal and third-party sources to review its sanctions compliance program.", "posttime": "2020-07-10 22:02:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,亚马逊,amazon,筛选,department", "title": "美国财政部表示，亚马逊以13.5万美元了结了有关其违反美国制裁的指控，这主要是由于其自动筛选过程中的缺陷", "title_en": "US Treasury Department says Amazon settled allegations that it violated US sanctions, primarily due to flaws in its automatic screening process, for $135,000", "transed": 1, "url": "https://www.wsj.com/articles/amazon-settles-allegations-of-u-s-sanctions-violations-11594252099?mod=djemalertNEWS", "via": "", "real_tags": ["美国", "亚马逊", "amazon", "筛选"]}, {"category": "", "categoryclass": "", "imagename": "693f98ea6606eca3021765457108fae0.jpeg", "infoid": 1010988, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，美国司法部(Justice Department)正在调查丑闻缠身的德国支付公司Wirecard是否在涉嫌与一个在线大麻市场有关的1亿美元银行欺诈案中发挥了关键作用。\n已经有两名商人在涉嫌欺诈中被起诉，他们被控与第三方支付处理商和其他人合谋欺骗美国银行批准大麻产品的信用卡支付。检察官说，这些人能够做到这一点，方法是使用在离岸商业银行有账户的虚假公司，这些公司反过来从交易中赚取高额手续费。\n知情人士说，曼哈顿联邦检察官办公室和联邦调查局(Federal Bureau Of Investigation)纽约外地办事处正在调查Wirecard是否通过同时担任支付处理商和离岸商业银行在涉嫌阴谋中发挥了作用。其中两名知情人士说，当局还在考虑几位前任或现任Wirecard高管可能扮演的角色。\n美国当局的关注增加了Wirecard面临的无数法律困境，Wirecard的价值一度超过包括德意志银行(Deutsche Bank)在内的任何一家德国银行。上个月有消息称，该公司声称拥有的20多亿美元可能根本就不存在，此后该公司迅速分崩离析。\n该公司没有在美国银行欺诈案中受到指控，也没有在任何公开法庭文件中被点名。法庭文件显示，今年3月，当两名商人之一-一名德国电商顾问-在加州被捕并被拘留时，Wirecard的一名高管提出帮助他缴纳保释金。\nWirecard曾是一家快速增长的德国金融科技公司，似乎随着电子商务的崛起而蓬勃发展，它曾担任在线企业的金融中间人，包括为零售商、赌博网站、旅游公司和其他服务处理电子支付。\n但Wirecard长期以来一直受到投资者的指控，称该公司利用第三方和空壳公司创造虚假收入，或者声称持有并不存在的现金。该公司上个月申请了德国版的破产，几天前，该公司披露了失踪的20亿美元。\n该公司首席执行官马库斯·布劳恩(Markus Braun)上个月辞职，并在因被指控夸大Wirecard的数字而被捕后获得保释。布劳恩一直否认有不当行为。他的律师没有回复记者的置评请求。第二名未透露姓名的高管本周在慕尼黑因涉嫌共谋欺诈而被捕。\n慕尼黑检察官说，他们正在调查前管理人员，以确定他们是否伪造收入，在公司健康状况上愚弄投资者。詹姆斯·弗里斯(James Freis)曾是美国最高反洗钱监管机构，目前担任Wirecard的临时首席执行长。\n美国的案件似乎与Wirecard在新兴市场的工作、其银行部门和支付处理服务有关。美国当局对Wirecard的兴趣表明，调查的范围比最初涉及大麻市场的指控中建议的范围要大得多。\n3月9日，38岁的德国公民、卢森堡居民鲁本·魏甘德在前往哥斯达黎加途中在洛杉矶国际机场被捕。他的共同被告哈米德·“雷”·阿卡万(Hamid“Ray”Akhavan)于当月晚些时候被捕。两人都被控一项与大麻交易有关的合谋银行欺诈的罪名，并已提出无罪抗辩。\n阿卡万和魏甘德的律师说，政府的起诉书含糊不清，并对银行欺诈指控提出异议，说美国客户银行--该案中据称的受害者--没有一家被欺骗或损失过钱。他们还指出，根据州法律，潜在的大麻交易是合法的。\n检察官称，魏根德和阿卡万与大麻市场Eaze Technologies Inc.的高管和第三方支付处理商合作，为这些交易洗钱，以规避信用卡公司对处理大麻销售的限制。检察官在4月份的一份法庭文件中说，共谋者利用虚假商家的离岸银行账户掩饰支付，欺骗美国银行处理通过Eaze的平台购买的数千万美元大麻。\n在对魏甘德电子设备的搜查令申请中，一名联邦调查局特工说，政府正在寻找包括银行欺诈、洗钱和共谋在内的指控的证据。\n总部位于加州的Eaze上周表示：“我们已经意识到这件事，并正在与相关当局充分合作。”Eaze在起诉书中没有被点名，也没有受到指控。\n起诉书称，2017年至2019年期间，在被指控的计划中处理了超过1亿美元的信贷和借记交易。检方在一份法庭文件中说，财务记录显示，阿卡万和魏甘德以及用于开设虚假商家账户的银行收取的手续费在某些情况下超过了大麻交易的10%。检察官声称，高昂的手续费反映了银行处理此类交易的相关风险。\n纽约卖空者法赫米·夸迪尔(Fahmi Quadir)去年年初写信给Wirecard的审计师，表达了她对Wirecard的担忧。她说，“我们很高兴看到这些起诉，因为这有力地表明，Wirecard的问题远远超出了会计欺诈的范畴。”\n起诉书或任何公开法庭文件中都没有提到Wirecard的名字。知情人士说，Wirecard高管与Akhavan和Weigand合作创建了一个支付处理网络，当局称该网络绕过了银行规则，欺骗了美国的银行。\n据法庭文件和知情人士透露，加州商人阿卡万曾作为顾问与Eaze高管密切合作，而魏根德则负责管理Eaze与持有离岸账户的欧洲银行的关系。\n在今年春天早些时候的一次法庭诉讼中，检察官表示，魏根德“与一个可以获得大量财政资源的犯罪网络有关联”，并补充说，起诉书中描述的1亿美元的交易很可能“严重低估了该组织处理的实际金额”。\n自被捕以来，魏根德一直被关押在南加州的一所监狱里。曼哈顿联邦检察官主张继续拘留他，称他构成了巨大的逃亡风险。德国不会将本国公民引渡到美国。\n在4月份写给美国地区法官杰德·S·拉科夫(Jed S.Rakoff)寻求释放他们客户的信中，魏根德的律师提出了一项保释方案，其中包括由魏根德卢森堡的住所担保的400万美元保释金，以及魏根德的朋友提供的100万美元现金。法庭文件显示，其中一位朋友马库斯·福克斯(Markus Fuchs)提出为现金方案贡献15万美元。福克斯在LinkedIn上的账户显示，他是总部位于慕尼黑的Wirecard Global Sales GmbH的全球销售副总裁。在9月份的债券招股说明书中，他还被任命为Wirecard在英国的控股公司的董事。\n富克斯还写了一封支持魏根德的信，称他是他最亲密的朋友之一。\n法庭文件显示，另一家名为Heidelpay的德国支付处理公司的首席执行长米尔科·胡勒曼(Mirko Hüllemann)也表示愿意帮助魏甘德。他写了一封支持信，提出支付80万美元并签署保释金。根据胡勒曼在LinkedIn上的个人资料，在2001年至2003年期间，他是联合支付有限公司(United Payment GmbH)的董事总经理，该公司隶属于一家最终成为Wirecard的公司。一位女发言人说，他是以“个人身份”写这封信的。\n写信给丽贝卡·戴维斯·奥布莱恩(Rebecca.OBrien@wsj.com)、朱丽叶·钟(Juliet Chung)(juliet.chung@wsj.com)和帕特里夏·科斯曼(Patricia.kowsmann@wsj.com)", "note_en": "The Justice Department is examining whether scandal-plagued German payment company  Wirecard    WDI  -5.24%  played a critical role in an alleged $100 million bank-fraud conspiracy connected to an online marijuana marketplace, according to people familiar with the investigation.\n  Two businessmen have already been  charged in the alleged fraud, accused of conspiring with third-party payment processors and others to trick U.S. banks into approving credit-card payments for marijuana products. The men were able to do this, prosecutors said, by using phony companies with accounts at offshore merchant banks that in turn earned steep fees off the transactions.\n  The Manhattan U.S. Attorney’s office and the New York field office of the Federal Bureau of Investigation are examining whether Wirecard played a role in the alleged conspiracy by serving as both a payment processor and an offshore merchant bank, the people said. The authorities are also considering the possible role of several former or current top Wirecard executives, two of the people said.\n  The attention from U.S. authorities adds to the  myriad legal woes facing Wirecard, which was once more valuable than any German bank, including  Deutsche Bank  . The company has rapidly unraveled following revelations last month that more than $2 billion it had claimed to have may never have existed.\n    The company hasn’t been charged in the U.S. bank-fraud matter and hasn’t been identified in any public court filings. When one of the two businessmen—a German e-commerce consultant—was arrested and detained in California in March, a Wirecard executive offered to help post his bail, court filings show.\n    Wirecard, once a fast-growing German fintech company that appeared to thrive with the rise of online commerce, served as a financial middleman for online businesses, including processing electronic payments for retailers, gambling sites, travel companies and other services.\n    But Wirecard has long been dogged by allegations from investors that the company used third parties and shell companies to generate fake revenue, or claimed to hold cash that wasn’t there. The company filed for  the German equivalent of bankruptcy last month, days after it disclosed the missing $2 billion.\n  Its chief executive, Markus Braun, resigned last month and is out on bail  after being arrested over accusations he inflated Wirecard’s numbers. Mr. Braun has consistently denied wrongdoing. His lawyer didn’t respond to a request for comment. A second, unnamed executive was arrested in Munich this week under suspicion of conspiracy to commit fraud.\n  Munich prosecutors said they are investigating former managers to determine whether they faked income to fool investors about the company’s health. James Freis, formerly the top anti-money-laundering regulator in the U.S., is serving as Wirecard’s interim CEO.\n  The U.S. case appears to relate to Wirecard’s work in emerging markets, its banking arm and its payment processing services. U.S. authorities’ interest in Wirecard indicates an investigation of far larger scope than suggested in the initial charges involving the marijuana marketplace.\n  On March 9, Ruben Weigand, a 38-year-old German citizen and resident of Luxembourg, was arrested at Los Angeles International Airport on his way to Costa Rica. His co-defendant, Hamid “Ray” Akhavan, was arrested later that month. Both were charged with one count of conspiracy to commit bank fraud in connection with the marijuana transactions and have pleaded not guilty.\n  Lawyers for Messrs. Akhavan and Weigand have described the government’s indictment as vague and have disputed the bank-fraud charge, saying none of the U.S. customer banks—the alleged victims in the case—were cheated or lost money. They also noted that the underlying marijuana transactions were legal under state law.\n    Prosecutors allege that Messrs. Weigand and Akhavan worked with executives at the marijuana marketplace—Eaze Technologies Inc.—and third-party payment processors to launder those transactions, to evade credit-card company restrictions on processing marijuana sales. In an April court filing, prosecutors said the conspirators used the phony merchants’ offshore bank accounts to disguise payments, tricking U.S. banks into processing tens of millions of dollars in marijuana purchases made through Eaze’s platform.\n  In a search-warrant application for Mr. Weigand’s electronic devices, filed in the case, an FBI agent said the government was seeking evidence of charges including bank fraud, money laundering and conspiracy.\n  “We are aware of this matter and are fully cooperating with the relevant authorities,” California-based Eaze said last week. Eaze wasn’t named in the indictment and hasn’t been charged.\n  Between 2017 and 2019, the indictment said, more than $100 million in credit and debit transactions were processed in the alleged scheme. In one court filing, prosecutors said financial records showed that Messrs. Akhavan and Weigand, along with the banks used to open the phony merchants’ accounts, collected fees that were in some cases more than 10% of the marijuana transaction. Prosecutors alleged that the high fees reflected the risk banks associated with processing such transactions.\n  “We were thrilled to see these indictments because this is a strong indication that the problems at Wirecard span far beyond accounting fraud,” said Fahmi Quadir, a New York short seller who wrote to Wirecard’s auditor early last year flagging her concerns about Wirecard.\n  Wirecard wasn’t named in the indictment or in any public court filings. The people familiar with the investigation said Wirecard executives worked with Messrs. Akhavan and Weigand to create a payment processing network that authorities say skirted banking rules and defrauded U.S. banks.\n  Mr. Akhavan, a California businessman, worked closely with Eaze executives as a consultant, while Mr. Weigand was responsible for managing Eaze’s relationships with European banks that held the offshore accounts, according to court filings and people familiar with the matter.\n  In a court proceeding earlier this spring, prosecutors said Mr. Weigand was “connected to a criminal network with access to substantial financial resources,” adding that the $100 million in transactions described in the indictment is likely a “significant underestimate of the actual amount of money handled by this organization.”\n  Mr. Weigand has been held at a Southern California jail since his arrest. Manhattan federal prosecutors have argued for his continued detention, saying he poses a substantial flight risk. Germany doesn’t extradite its own citizens to the U.S.\n  In an April letter to U.S. District Judge Jed S. Rakoff seeking their client’s release, Mr. Weigand’s lawyers proposed a bail package including a $4 million bond, secured by Mr. Weigand’s Luxembourg home, and $1 million in cash provided by Mr. Weigand’s friends. One of those friends, Markus Fuchs, offered to contribute $150,000 toward the cash package, according to the court filings. Mr. Fuchs is vice president of global sales at Wirecard Global Sales GmbH, based in Munich, according to his LinkedIn account. He was also named as a director of Wirecard’s holding company in the U.K. in a September bond prospectus.\n  Mr. Fuchs also wrote a letter of support for Mr. Weigand, describing him as one of his closest friends.\n    Mirko Hüllemann, chief executive of another German payment-processing company called Heidelpay, also offered to help Mr. Weigand, according to court filings. He wrote a letter of support and offered to pay $800,000 and sign the bond. Between 2001 and 2003, according to his LinkedIn profile, Mr. Hüllemann was managing director of United Payment GmbH, a unit of a company that eventually became Wirecard. A spokeswoman said he wrote the letter in his “personal capacity.”\n  Write to Rebecca Davis O’Brien at  Rebecca.OBrien@wsj.com, Juliet Chung at  juliet.chung@wsj.com and Patricia Kowsmann at  patricia.kowsmann@wsj.com", "posttime": "2020-07-10 22:01:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,美国司法部,fraud,wirecard", "title": "消息来源：美国司法部正在调查Wirecard是否在一起据称与在线大麻市场有关的1亿美元银行欺诈案中发挥了关键作用", "title_en": "Sources: DOJ is examining whether Wirecard played a critical role in an alleged $100M bank fraud conspiracy connected to an online marijuana marketplace", "transed": 1, "url": "https://www.wsj.com/articles/wirecard-under-criminal-scrutiny-by-u-s-authorities-as-part-of-probe-into-alleged-bank-fraud-conspiracy-11594229246?mod=djemalertNEWS", "via": "", "real_tags": ["美国", "美国司法部", "fraud", "wirecard"]}, {"category": "", "categoryclass": "", "imagename": "fba7dc51ff0bcb986c9a5d65e50b60ab.jpg", "infoid": 1010987, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊今天宣布，其面向工业客户的托管监控服务AWS IoT SiteWise在AWS Re：Invent2018上亮相两年后，现已正式推出。截至本周，SiteWise在美国东部(弗吉尼亚州北部)、美国西部(俄勒冈州)、欧洲(法兰克福)和欧洲(爱尔兰)地区面向亚马逊网络服务(AWS)客户上线，未来几个月还会有更多的服务器区域。\n制造商、能源公用事业公司和食品加工商往往难以收集、处理和分析来自数百到数千个物联网(IoT)传感器的数据。跨不同位置提取数据既耗时又昂贵，因为这些数据通常存储在缺乏通用数据格式的本地专用服务器中。即使有了数据收集管道，也必须手动注释设备类型、设施位置以及与其他设备的关系等信息；客户必须编写自定义应用程序来计算和比较设施之间的性能指标，以获得洞察力。\nSiteWise自动从工厂车间摄取数据，对数据进行结构化和标记，并生成实时指标，以便为管理决策提供信息。在SiteWise中，客户首先通过向收集的数据添加上下文来对其工业设备、流程和设施进行建模。然后，他们使用SiteWise的内置数学函数库定义常见的工业性能指标(例如，总体设备效率和正常运行时间)。一旦客户的环境建模并在AWS中处理了他们的数据，该服务就会按照客户定义的时间间隔自动计算指标。上传的数据和指标被发送到完全托管的时间序列数据库，旨在以低延迟存储和检索带时间戳的数据。\n在SiteWise控制台中，客户无需编码即可创建自定义Web应用程序，以可视化终端用户设备上的KPI。除了使用在边缘设备上运行的软件，SiteWise还提供通过MQ遥测传输(MQTT)消息或其API从现代工业应用程序收集数据的接口。\nVB Transform 2020 Online-7月14-17日。加入领先的人工智能高管：注册的最后机会！\n亚马逊表示，大众集团(Volkswagen Group)等客户正在使用SiteWise将制造车间数据收集到云中，在其工厂内对这些不同的机器资产进行建模和组织，并在网络应用程序中可视化来自气缸生产线的运营数据。另一家客户-拜耳-已经在北美的九家玉米生产工厂部署了SiteWise，从工厂车间收集数据，然后测量和分析其机械的整体设备效率，以确定生产效率低下。拜耳声称，SiteWise使其能够在不到几个小时的时间内登上作物场地，而不是几周。\n亚马逊在物联网领域保持着领先地位，据估计，到2019年底，物联网领域的价值将达到212亿美元。根据Eclipse基金会在2018年进行的一项调查，AWS是迄今为止最受物联网开发者欢迎的云平台，受欢迎程度从2017年的21%增长到51.8%，而Azure的份额为31.21%(2017年为17%)。亚马逊首席技术官沃纳·沃格斯在最近的一次采访中告诉VentureBeat，AWS的客户部署了数十万个传感器。", "note_en": "Amazon today  announced AWS IoT SiteWise, its managed monitoring service for industrial customers, is now generally available two years after its unveiling at AWS re:Invent 2018. SiteWise is live for Amazon Web Services (AWS) customers as of this week in the US East (N. Virginia), US West (Oregon), Europe (Frankfurt), and Europe (Ireland) regions, with additional server regions to follow in the coming months.\n Manufacturers, energy utilities, and food processors often struggle to collect, process, and analyze data from their hundreds to thousands of internet of things (IoT) sensors. Extracting data across different locations is time-consuming and expensive, because this data is typically stored in local, specialized servers that lack a common data format. Even with a data-collection pipeline in place, information like equipment type, facility location, and relationships with other equipment must be annotated manually; customers have to write custom apps to calculate and compare performance metrics across facilities to derive insights.\n  SiteWise automates data ingestion from the plant floor, structuring and labeling the data and generating real-time metrics to inform managerial decisions. In SiteWise, customers begin by modeling their industrial equipment, processes, and facilities by adding context to the collected data. They then define common industrial performance metrics (e.g., overall equipment effectiveness and uptime) using SiteWise’s built-in library of mathematical functions. Once a customer’s environment is modeled and their data processed in AWS, the service automatically computes the metrics at an interval defined by the customer. Uploaded data and metrics are sent to a fully managed time-series database designed to store and retrieve time-stamped data with low latency.\n From within the SiteWise console, customers can create custom web apps without coding to visualize KPIs across end-user devices. In addition to using software running on an edge device, SiteWise provides interfaces for collecting data from modern industrial apps through MQ Telemetry Transport (MQTT) messages or its APIs.\n  VB Transform 2020 Online - July 14-17. Join leading AI executives:  Last chance to register!\n Amazon says that customers like Volkswagen Group are using SiteWise to collect manufacturing shop floor data into the cloud, model and organize those different machine assets within its plants, and visualize operational data from its cylinder production line in a web app. Another customer — Bayer — has deployed SiteWise across nine corn production plants in North America, collecting data from the plant floor and then measuring and analyzing the overall equipment effectiveness of its machinery to identify production inefficiencies. Bayer claims that SiteWise enabled it to onboard a crop site in less than a few hours versus several weeks.\n Amazon maintains pole position in the IoT segment, which was estimated to be worth $212 billion by the end of 2019. According to a  survey conducted by the Eclipse Foundation in 2018, AWS was by far the most popular cloud platform for IoT developers, growing in popularity by 21% from 2017 to a 51.8% share, compared with Azure’s 31.21% share (up from 17% in 2017).  Amazon CTO Werner Vogels told VentureBeat in a recent interview that AWS customers deploy upwards of hundreds of thousands of sensors.", "posttime": "2020-07-10 22:01:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,amazon,物联网,监控,iot", "title": "亚马逊宣布全面推出AWS IoT SiteWise，这是亚马逊为包括大众和拜耳在内的工业客户提供的托管物联网监控服务", "title_en": "Amazon announced the general availability of AWS IoT SiteWise, its managed IoT monitoring service for industrial customers, including VW and Bayer", "transed": 1, "url": "https://venturebeat.com/2020/07/09/amazon-launches-aws-iot-sitewise-in-general-availability/", "via": "", "real_tags": ["亚马逊", "amazon", "物联网", "监控", "iot"]}, {"category": "", "categoryclass": "", "imagename": "2d1520413dc02b30cf156381c44f6a63.jpeg", "infoid": 1010986, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-亚马逊公司(Amazon.com Inc.)计划创建至少1亿美元的股票奖励，以留住其上月提出收购的自动驾驶汽车初创公司Zoox的900多名员工，如果他们中的大量员工拒绝了这家科技巨头的工作邀请，他们可以退出这笔交易。\n亚马逊正在积极进军自动驾驶技术领域，该公司6月26日宣布已同意收购这家硅谷公司，该公司成立于一项雄心勃勃的努力，目的是从头开始设计一款完全自动驾驶的汽车，而不是将现有汽车改装成自动驾驶。\n根据路透看到的交易文件，亚马逊将为此次收购支付13亿美元现金，双方希望在9月前完成收购。\n根据PitchBook的数据，2018年Zoox的估值为32亿美元。亚马逊的交易文件显示，2020年初，Zoox每月消耗超过3000万美元，并预计到7月将耗尽现金。亚马逊在6月份签署协议时有权借给Zoox 3000万美元，还可以在交易完成前选择进一步贷款。\n从亚马逊手中夺走Zoox或其人才的尝试甚至在两家公司达成最终协议之前就已经开始了。\n交易文件显示，在Zoox与亚马逊签署独家谈判协议后，但在他们达成协议之前，第三方介入，出价10.5亿美元。\n两名知情人士告诉路透社，出价来自Cruise，这家自动驾驶公司得到了通用汽车(General Motors Co)、本田汽车(Honda Motor Co Ltd)(7267.T)和软银集团(SoftBank Group Corp)(9984.T)的部分支持。\nZoox没有回应这一提议。路透社(Reuters)6月4日报道称，Cruise的创始人与Zoox工程师接洽，提供工作机会。\n科技新闻刊物The Information 6月30日报道，Zoox的两名高级工程师詹姆斯·菲尔宾(James Philbin)和马克·温默肖夫(Marc Wimmershoff)加入了Alphabet Inc.(GOOGL.O)的自动驾驶部门Waymo。菲尔宾和温默肖夫没有立即回复记者的置评请求。\n亚马逊与Zoox的交易文件描述了两份“关键员工”名单。第一份名单上的所有人都必须抢走亚马逊的工作才能完成交易，第二份名单中的至少19人必须留下来。亚马逊计划向其他Zoox员工的三个时刻表提供工作，要求前两个时刻表中的90%和第三个时刻表中的88%接受工作才能完成交易。\nZoox联合创始人杰西·莱文森将在三年内获得交易薪酬的40%，而不是在交易结束时。莱文森拥有Zoox 1.314亿股普通股中的4900万股，约占37%的股份。文件显示，Zoox首席执行长埃文斯(Aicha Evans)获得了340万美元的现金奖金。\n这笔交易奖励了在5月18日之前加入Zoox的“公司服务提供商”，他们将获得1.25亿美元的现金“交易红利池”，按比例支付给他们的股票。文件显示，除了将为交易后留在亚马逊的Zoox员工创建1亿美元的亚马逊限制性股票单位池外，亚马逊还为该池提供了30%的资金。\n留下来的Zoox现任员工-即使是最近加入的员工-的回报将远远超过只持有普通股的长期前员工，或者是那些在收盘前离开的员工。文件显示，交易完成后，普通股每股估值预计在69美分至76美分之间。", "note_en": "(Reuters) - Amazon.com Inc (  AMZN.O) plans to create at least $100 million in stock awards to retain the 900-plus employees of Zoox, the self-driving car startup it offered to buy last month, and can walk away from the deal if large numbers of them turn down job offers from the technology giant.\n  Amazon, which is aggressively expanding into self-driving technology, announced June 26 it had agreed to acquire the Silicon Valley company, which was founded on an ambitious effort to design a fully autonomous vehicle from scratch rather than retrofitting existing cars for self-driving.\n Amazon will pay $1.3 billion in cash for the takeover, which the parties hope to close by September, according to deal documents seen by Reuters.\n Zoox had been valued at $3.2 billion in 2018, according to data from PitchBook. The Amazon deal documents show Zoox was burning more than $30 million each month in early 2020 and projected it would run out of cash by July. Amazon had the option to lend Zoox $30 million on signing the agreement in June, with the option for further loans before the deal closes.\n  Attempts to wrest Zoox or its talent away from Amazon started before the two even reached a definitive agreement.\n After Zoox signed an exclusive agreement to negotiate with Amazon but before they reached a deal, a third party stepped in to offer $1.05 billion, according to the deal documents.\n The offer came from Cruise, the self-driving company backed in part by General Motors Co (  GM.N), Honda Motor Co Ltd (  7267.T) and SoftBank Group Corp (  9984.T), two people with knowledge of the matter told Reuters.\n Zoox did not respond to the offer. Reuters reported June 4 that the founder of Cruise approached Zoox engineers with job offers.\n Technology news publication The Information reported June 30 that two senior Zoox engineers, James Philbin and Marc Wimmershoff, joined Waymo, Alphabet Inc’s (  GOOGL.O) self-driving unit. Philbin and Wimmershoff did not immediately respond to requests for comment.\n The Amazon-Zoox deal documents describe two lists of “key employees.” All on the first list must take Amazon jobs for the deal to close, and at least 19 from the second list must stay. Amazon plans to offer jobs to three schedules of other Zoox employees, requiring that 90% of the first two and 88% of the third accept jobs to close the deal.\n  Zoox co-founder Jesse Levinson will receive 40% of his deal compensation over three years rather than at the closing. Levinson owns 49 million of the 131.4 million common shares of Zoox, a roughly 37% stake. Zoox Chief Executive Aicha Evans got a $3.4 million cash bonus, according to the documents.\n The deal rewards Zoox “company service providers” who had joined by May 18 with a $125 million cash “transaction bonus pool” paid out in proportion to their shares. Amazon provided 30% of the funding for the pool, on top of the $100 million pool of Amazon restricted stock units it will create for Zoox employees who stay with Amazon after the deal, the documents show.\n The rewards for current Zoox employees who stay on - even those who joined recently - far outstrip those of longtime former employees with only common shares or those employees who leave before the close. Common shares are expected to be valued between 69 cents and 76 cents each after the deal closes, according to the documents.", "posttime": "2020-07-10 22:00:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "亚马逊,交易,amazon,股票,zoox", "title": "文件显示，亚马逊计划设立至少1亿美元的股票奖励，以留住Zoox人才，如果大多数人拒绝工作邀请，亚马逊可以放弃收购Zoox的交易", "title_en": "Documents show Amazon plans to create at least $100M in stock awards to retain Zoox talent and can abandon deal to acquire Zoox if a majority reject job offers", "transed": 1, "url": "https://www.reuters.com/article/us-amazon-com-zoox-exclusive/exclusive-amazon-plans-at-least-100-million-to-keep-zoox-talent-after-1-3-billion-deal-idUSKBN24A3C8", "via": "", "real_tags": ["亚马逊", "交易", "amazon", "股票", "zoox"]}, {"category": "", "categoryclass": "", "imagename": "0518b59dce3aefca2ad91ac66340dfac.jpg", "infoid": 1010984, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容我期待着今天iOS14和ipad的公众测试版的发布，我一直在使用开发者测试版，面对着既舒服又不知所措的奇怪组合。\n除非你把iPhone主屏幕的巨大变化计算在内(我只计算了一部分)，否则这两个操作系统都不会为你的手机或平板电脑提供一个新的大愿景。然而，这两个版本都有很长的新功能列表，以至于我一想到要将它们全部列举出来就胆战心惊，更不用说给你留下的印象了。从技术上讲，iOS14和iPadOS14有一千个新功能吗？我实际上不知道，但这个数字足够高，足以让人应接不暇。\n由于我一直在使用iOS14(除非我需要指定iPhone或iPad，否则我会用这两个平台来指代这两个平台)，所以我脑海里浮现了一个我编造的小故事。\n我想，苹果的高管去年在WWDC之后把所有的工程师都叫进了一个房间，然后说，“嘿，下一步是什么？”工程师们静静地看着对方，直到其中一个人说，“嗯，你一直让我把这个功能放在一边。”一位高管回答说，“当然，去做吧。”\n然后，当苹果的每个人都叫嚣着要让他们的东西回到路线图上时，出现了纯粹而光荣的混乱。每一次，这位主管都说，“当然，有何不可？”\niPhone(但奇怪而恼人的是，不是iPad)的主屏幕上出现了三大新功能概念。你可能会争辩说，苹果借鉴了Android--或者Windows Phone--但我所关心的是，iPhone终于允许在主屏幕上实现一些复杂性和定制化。以下是最大的新功能：\n有一个全新的窗口小部件框架，可以在iOS、iPadOS和MacOS上运行。在iPhone上，苹果允许你将这些小工具放在网格上任何位置的任何主屏幕上。您还可以创建可以翻阅的小部件的“堆栈”，以及试图将最相关的小部件放在最上面的“智能堆栈”。\n有了一个新的“应用程序库”，你所有的应用程序图标都会出现在这里，由苹果自动分类(一般情况下)。这意味着，这是第一次，应用程序图标可以出现在iPhone的多个地方。而且第一次，你可以摆脱那些烦人的“垃圾”文件夹，里面有你从来不用过的应用程序。遗憾的是，你不能在App Library中对应用程序重新分类，你不能四处移动分类文件夹，奇怪的是，iPad上没有这个功能。\n最后，您可以进入总览模式并“取消选中”主屏幕上的整个页面，这可以有效地让您为某些任务(如工作或锻炼等)设置主屏幕页面，您可以随意显示或隐藏这些页面。不幸的是，你不能让一个应用程序图标出现在你的主屏幕上的多个地方，就像你在Android上可以做到的那样，所以这个功能可能并不像它第一次出现时那么有用。\n我已经写了一篇文章，并制作了一段视频，更深入地介绍了iPhone的新主屏幕，以及苹果允许(但不要求)iPhone复杂性的令人鼓舞的趋势。与其重复我的话，我就指给你看。\n在它的第二次迭代中(幸运地取名为iPadOS14而不是iPadOS2)，苹果不再试图教我们在屏幕上移动应用程序窗口的全新隐喻。尽管我仍然认为iPad的窗口系统不直观，但让我松了一口气的是，苹果今年没有搞砸它-尽管苹果在确保第三方应用程序在多种尺寸下运行方面稍微严格了一点。\n但iPad仍然有一个旗舰功能：涂鸦。这是苹果的品牌，因为它能够用苹果铅笔将文本直接输入到任何文本字段中。我们也见过其他平台做类似的事情，但通常，手写识别都是在一个单独的框中进行的。\n要使用Scribble，您只需将Apple铅笔的尖端放入文本输入框中并开始书写即可。你也不必把你的分数留在场内。一旦iPad识别出你在写作(它在这方面做得很好)，你就可以一边写作一边在屏幕上漫游。\n当您完成一个单词时，您的手写内容会在半秒左右的延迟后解析为该字段中的文本。这既令人印象深刻，又令人沮丧。这是令人印象深刻的，因为iPadOS14和我尝试过的任何东西一样好，甚至比其他任何东西都好，可以识别我糟糕透顶的笔迹。(有趣的是，苹果公司表示，随着时间的推移，它不会使用实时设备上的机器学习来提高对你笔迹的识别。它开发了一个适用于所有人的静态模型。)。这是令人沮丧的，因为延迟的时间足够长，你不会马上发现错误的翻译，所以你必须回去修复它。\n回过头来修正一个错误的翻译并不像你想的那样优雅。您可以圈出单词来选择它们，也可以划掉它们来删除它们，但是固定光标位置和单词插入感觉有点随意。它非常接近伟大，但它陷入了一种不可思议的互动谷。\n综上所述，我喜欢Scribble的短小文本，比如在Safari地址栏中草草搜索，或者在消息中快速输入文本。它让你可以把苹果铅笔更多地留在手中，如果你一开始就已经在用它的话。借用微软Panos Panay(谁对平板电脑上的笔输入略知一二)一词，还有一个更好的“流”。\n苹果Notes应用程序对苹果铅笔的支持也得到了增强。现在，您可以从手写中选择文本，然后将其复制为纯文本以粘贴到其他位置。这使得用苹果铅笔做笔记的提议要好得多，因为把文本放到你想要的地方最终会更容易。这不是一个独一无二的把戏-三星的Galaxy Note去年就做到了这一点-但这是一个必要的功能。\n苹果显然已经决定，用户不会再被iOS上出现在其他东西之上的东西弄得不知所措了。它引入了一些属于“紧凑型用户界面”的新功能，据我所知，这相当于让应用程序在不占据整个屏幕的情况下在其他应用程序上显示内容。\n因此，来电只是作为专门的通知出现在屏幕顶部，而不是完全接管。(终于！)。同样的功能也将提供给第三方VOIP应用程序。FaceTime和其他应用程序可以生成画中画窗口，当你切换应用程序时，该窗口会持续存在-而且它的大小可以调整。(终于！)。在Safari中，PIP功能与YouTube配合使用效果很好(你必须先全屏显示，才能获得苹果更标准的视频按钮)，但我想其他视频应用程序有多快采用这一功能还有待观察。如果有任何希望的话，那就是Netflix和其他视频应用程序多年来一直在iPad上支持PIP，所以希望他们能效仿，在iPhone上也采用PIP。\n还有一个新的“紧凑型Siri”界面，在iPhone和iPad的屏幕底部都有一个五颜六色的小气泡。它不会挡住你在屏幕上看到的任何东西，这很好，但目前屏幕和Siri之间还没有互动。\n但对我来说，最好的紧凑型UI新功能是新的搜索栏。它现在的通用性做得更好了，让你可以输入应用程序、文档和(最后！！)。Web搜索，然后只需按Enter键即可完成搜索。它开始搜索并过滤你输入的每一个字母，整个过程感觉更快更好。\n你仍然可以通过向下滑动主屏幕或点击外部iPad键盘上的CMD-Space来访问它。最后一个选项非常适合我的工作流程，因为这个搜索可能出现的另一个问题是Siri快捷方式。我使用它们进行一些自定义的网络搜索，能够快速访问它们是非常棒的。\n苹果公司为iPhone开发了一款新的翻译应用程序(但同样奇怪的是，iPad上没有这款应用程序)。它支持英语、西班牙语、普通话、日语、韩语、俄语、德语、法语、意大利语、巴西葡萄牙语和阿拉伯语之间的翻译。在我用我非常(非常)糟糕的西班牙语进行的非常简短的测试中，它似乎在对话模式下工作得和谷歌翻译一样好。\n苹果版本的应用程序稍微简单一些，但对我来说，这可能是一个功能，考虑到你真的需要一个翻译应用程序，你会希望它尽可能简单。\nSiri增加了可以相互翻译的新语言，Safari则增加了英语、西班牙语、简体中文、法语、德语、俄语和巴西葡萄牙语的本地网页翻译。在这里，它似乎和谷歌翻译一样能获得文章的要义。\n消息现在支持线程化，这在我看来有点过头了。话又说回来，我没有参加任何大规模的iMessage群聊。您还可以在这些聊天中特别提到人，这对关闭所有通知的人很有帮助。如果你在和使用旧版iOS的人发短信，这两个功能都会优雅地降级。\n苹果的地图应用程序将获取加拿大、英国和爱尔兰的新的、更详细的地图信息。住在旧金山湾区，我可以告诉你，它带来了很大的不同。我对新的“指南”印象不深，它们看起来只不过是一个快速内容合作的机会。超速摄像头、拥堵区和电动汽车路线也在不断涌现。\n但地图的头条功能是骑自行车的方向，苹果在这方面做得还可以。你可以看到你的路线上的高度，以及每条道路的自行车友好性到底是什么的一些细节。\n然而，苹果地图不像谷歌地图那样支持覆盖，所以你只能相信苹果提供的路线，而不是使用你自己从谷歌显示的内容中做出的判断。在城市里骑自行车是有压力的，能够看到地图上所有的自行车道是重要的信息。苹果已经允许你在交通、过境和卫星覆盖之间切换。它也需要一辆自行车。\n通常，这一部分是我列出一些有趣但可能并不重要的功能和更新的地方。但今年，“其他一切”似乎构成了iOS和iPadOS 14新功能的主要组成部分。这里有很多东西(其中一些我还没有真正测试过)，很难给你一个大的主题桶。\n在系统层面上，最大的变化可能是在隐私方面。苹果要求应用程序申请许可才能进行某些类型的跟踪，并要求应用程序制造商制作一份RDA营养数据样式的情况说明书，说明他们的应用程序拥有的各种隐私政策。当应用程序查看你的剪贴板时，它也会弹出一个警告-这已经导致一些应用程序清理它们的行为。所有这些都将给应用程序生态系统带来改变的压力。\n同样，Safari现在将显示其“阻止”的跟踪器的报告。注意，这里的单词是“阻止的”，而不是“阻止的”，因为完全阻止一些Web技术会破坏很多东西。不过，效果基本上是一样的：苹果更积极的智能跟踪预防框架在停止网络跟踪方面将比Chrome走得更远。它向你显示的数字，除了用它羞辱网站之外，你什么也做不了。(我认为这个数字不能说明全部情况，但那是…。(另一个故事。)\n您可以更改默认浏览器和电子邮件应用程序，但不能更改地图。\n这只是隐私功能中的一小部分，但我也很高兴看到这么多辅助功能。苹果在它的画外音辅助功能中增加了机器学习功能，这样它就可以在还没有更新到正式支持它的应用程序中阅读屏幕(就像Android 11一样)。还有耳机设施，AirPods用户的空间音频，以及“声音识别”，可以提醒你火警或门铃的声音。Back Tap功能也获得了很多关注。它可以让你轻触iPhone的背面来触发特定的动作。它很有趣，但是在早期的测试版中，我总是不小心触发它。\n除此之外，就像我在上面说的那样，功能清单如此之长，似乎苹果的每个人都被允许继续发布他们的宠物功能。我们终于可以将替代浏览器和电子邮件应用程序设置为默认设置。(我还没能对此进行测试。)。时钟应用程序有一个很好的睡前功能，Memoji已经得到了增强，相机在第一次拍摄后可以更快地拍照，你可以锁定曝光更长时间，有一个重新设计的图像拾取器，你可以用你的iPhone作为某些汽车的车钥匙，还有太多其他东西让我无法进入这里。\n见鬼，我甚至没有提到App Clip，它是应用程序的小型临时版本，要么是很少使用的新奇玩意儿(就像Android即时应用程序看起来那样)，要么是我们对应用程序及其在手机上的持久性的看法的重大转变。如果一款应用程序像浏览器选项卡一样易于使用和关闭，情况会怎样？\n这里还有另一个例子：照片说明。这对我来说是一件大事，因为这意味着我可以给我经常搜索的某些照片贴上标签(当地的火车地图，展示理发师的一张好照片，等等)。这将使查找那些照片变得容易得多。然而，作为功能637(或其他任何功能)，它只是在洗牌过程中丢失了。\niOS14中的任何东西都不会让你不知所措，不是真的。有一千个新功能需要发现，但我怀疑很多人不会这样做。与Android一样，iOS是一个成熟的操作系统，因此可发现性问题可能是一个不可避免的问题。\n我完全主动给苹果的建议是，最终做其他所有平台公司都会做的事情：更频繁地发布应用程序更新，把每年的节奏留给大的系统级的东西。为什么Memoji或Home应用(没错，它也有新功能)的更新需要等待苹果操作系统的重大更新，这是一个谜。但这是一个很容易解决的问题，只需在应用程序更新准备好时发布即可。\n如果我去年想象的那次会议现在还在进行，我希望当高管们问“下一步是什么？”时，一些答案可以在他们准备好的时候到来，而不是在iOS 15准备好的时候。\n苹果如何阻止Facebook的iOS漏洞导致Spotify、Pinterest、Tinder和其他应用程序崩溃。\n由于Facebook问题，Apple Spotify、Pinterest、Tinder和许多其他iOS应用程序再次崩溃。\n查看技术领域的所有故事", "note_en": "Skip to main content                                                                                                                In anticipation of  today’s release of the public betas of iOS 14 for the iPhone and iPadOS 14 for the iPad, I’ve been using the developer betas and facing a curious mix of feeling both comfortable and overwhelmed.\n Unless you count the big changes to the iPhone’s home screen (and I only partially do), neither OS offers a big new vision of what your phone or tablet can be. And yet, both have new feature lists so long that I quail at the idea of trying to enumerate them all, much less give you impressions. Are there  technically a thousand new features in iOS 14 and iPadOS 14? I don’t actually know, but the number is sufficiently high as to be overwhelming.\n As I have been using iOS 14 (which is how I’ll refer to both platforms unless I need to specify iPhone or iPad), I have had a little story I made up running around in my head.\n I imagined that Apple’s executives got all of the engineers into a room last year after WWDC and said, “Phew, what’s next?” And the engineers looked at each other quietly until one of them said, “Uh, I have this feature you keep making me put on the back burner,” to which an executive replied, “Sure, do that.”\n Then there was pure, glorious chaos as everybody at Apple clamored to get their thing back on the roadmap. Each time, the executive said, “Sure, why not?”\n   The iPhone (but, strangely and annoyingly, not the iPad) is getting three big new feature concepts on its home screen. You could argue that Apple has  borrowed from Android — or  perhaps Windows Phone — but all I care about is that the iPhone finally allows for some complexity and customization on the home screen. Here are the big new features:\n There’s an entirely new widget framework that works across iOS, iPadOS, and macOS. On the iPhone, Apple is allowing you to put these widgets on any home screen in any location on the grid. You can also create “stacks” of widgets you can flip through and “smart stacks” that try to put the most relevant widget on top.\n There’s a new “App Library” where all of your app icons appear, auto-categorized (mediocrely) by Apple. This means, for the first time, app icons can appear in multiple places on the iPhone. And for the first time, you can get rid of that annoying “junk” folder of apps you never use. Sadly, you can’t recategorize apps in the App Library, you can’t move the category folders around, and weirdly, it’s not available on the iPad.\n Finally, you can go into an overview mode and “uncheck” entire pages on your home screen, which effectively lets you set up home screen pages for certain tasks (like work or exercise or whatever) that you can show or hide at will. Unfortunately, you can’t have an app icon appear in multiple places on your home screen as you can on Android, so this feature may not be as useful as it first appears.\n I’ve already written a piece and made a video where I go more in-depth on the iPhone’s new home screen and the encouraging trend of Apple allowing (but not requiring) complexity on the iPhone. Rather than repeat myself, I’ll  just point you there.\n   In its second iteration (blessedly called iPadOS 14 instead of iPadOS 2), Apple is taking a break from trying to teach us all-new metaphors for moving app windows around on a screen. Although I still think the iPad’s windowing system is unintuitive, I am relieved that Apple isn’t messing with it this year — though  Apple is being a little more strict about making sure third-party apps work at multiple sizes.\n But the iPad still gets a flagship feature: Scribble. That’s Apple’s branding for the ability to enter text directly into any text field with the Apple Pencil. We’ve seen other platforms do similar things, but usually, handwriting recognition happens in a separate box.\n To use Scribble, you simply place the point of the Apple Pencil in a text entry box and start writing. You don’t have to keep your point inside the field, either. Once the iPad recognizes that you’re writing (and it’s quite good at doing so), you can roam around the screen as you write.\n  Your handwriting resolves into text in that field after a half-second-or-so delay when you finish a word. That’s both impressive and frustrating. It’s impressive because iPadOS 14 is as good or better than anything else I’ve tried at recognizing my terrifically bad handwriting. (Interestingly, Apple says it is not using real-time on-device machine learning to improve its recognition of your handwriting over time. There’s a static model it developed that applies to everybody.) It’s frustrating because that delay is just long enough that you won’t catch a mistranscription right away, and you’ll have to go back and fix it.\n Going back and fixing a mistranscription is not quite as elegant as you’d probably like. You can circle words to select them or scratch them out to erase them, but nailing cursor placement and word insertion feels a little haphazard. It’s very close to being great, but there’s a kind of uncanny valley of interaction it falls into.\n All that said, I love Scribble for short bits of text, like jotting a search into the Safari URL bar or a quick text in Messages. It makes it so you can leave the Apple Pencil in your hand more if that’s what you’re already using in the first place. There’s a better “flow” to it, to borrow a term from Microsoft’s Panos Panay (who knows a thing or two about pen input on tablets).\n Apple Pencil support in Apple’s Notes app has been beefed up as well. Now, you can select text from your handwriting and then copy it as plain text for pasting elsewhere. That makes taking notes with the Apple Pencil a much nicer proposition, as getting that text out to someplace you might want to is finally easier. It’s not a unique trick — Samsung’s Galaxy Note was able to do this last year — but it is a necessary feature.\n   Apple has apparently decided that users won’t be discombobulated by things appearing on top of other things on iOS anymore. It’s introduced a few new features that fall under the rubric of a “compact UI,” which, so far as I can tell, amounts to letting apps show content on top of other apps without taking up the whole screen.\n So incoming calls just appear as a specialized notification at the top of the screen instead of taking over completely. (Finally!) The same feature will be offered to third-party VOIP apps. FaceTime and other apps can spawn a Picture-in-Picture window that persists as you switch apps around — and it can be resized. (Finally!) The PiP feature works great with YouTube in Safari (you have to go full-screen first to get Apple’s more standard video buttons), but I suppose it’s TBD how quickly other video apps take up this feature. If there’s any hope, it’s that Netflix and other video apps have  supported PiP on the iPad for years, so hopefully they will follow suit adopting it on the iPhone as well.\n  There’s also a new “compact Siri” interface, which amounts to a little multicolored bubble at the bottom of the screen on both the iPhone and iPad. It’s nice that it doesn’t block whatever it is you’re looking at on the screen, but there’s no interactivity between the screen and Siri just yet.\n But for my money, the best new compact UI feature is the new search bar. It does a better job of being universal now, letting you type in apps, documents, and (finally!!) web searches and then just hit Enter to finish your search. It starts searching and filtering down with each letter you type, and the whole thing feels faster and better.\n You still get to it by a swipe down on the home screen or by hitting CMD-Space on an external iPad keyboard. That last option is great for my workflow, as the other thing this search can surface is Siri shortcuts. I use them for a few custom web searches, and having fast access to them is wonderful.\n   Apple has made a new Translate app for the iPhone (but, again, it’s weirdly absent from the iPad). It supports translations between English, Spanish, Mandarin Chinese, Japanese, Korean, Russian, German, French, Italian, Brazilian Portuguese, and Arabic. In my very brief testing with my very (very) bad Spanish, it seemed to work about as well as Google Translate in conversation mode.\n Apple’s version of the app is a little more bare-bones, but to me, that might be a feature, given in a situation where you’d really need a translation app, you’d want it to be as simple as possible.\n Siri picks up new languages it can translate between, and Safari is picking up native webpage translation for English, Spanish, Simplified Chinese, French, German, Russian, and Brazilian Portuguese. Here, too, it seems to work about as well as Google Translate for getting the gist of an article.\n Messages now has support for threading, which seems like overkill to me. Then again, I’m not in any massively big iMessage group chats. You can also specifically mention people in those chats, which is helpful for people who turn off all notifications for them. Both features degrade gracefully if you’re texting with people who are on an older version of iOS.\n  Apple’s Maps app will pick up its new, more detailed mapping information for Canada, the UK, and Ireland. Living in the Bay Area, I can tell you it makes a world of difference. I’m less impressed with the new “guides,” which seem like little more than an opportunity for quick content partnerships. Speed cameras, congestion zones, and electric vehicle routing are also coming.\n But the headline feature for Maps is biking directions, and Apple’s done a passable job with it. You get a view of the elevation on your route and some detail on what exactly the bike-friendliness of each road will be.\n However, Apple Maps doesn’t support overlays in the way that Google Maps does, so you kind of have to just trust the route that Apple provides instead of using your own judgment from what Google can show you. Biking in the city is stressful, and being able to see all of the bike lanes on the map is important information. Apple already lets you toggle between traffic, transit, and satellite overlays. It needs a bike one, too.\n   Normally, this section is the place where I’d list a bunch of interesting but perhaps not consequential features and updates. But this year, “everything else” feels like it constitutes the  bulk of what makes up the new stuff in iOS and iPadOS 14. There’s a lot here (some of which I haven’t been able to really test yet), and it’s difficult to give you big thematic buckets.\n On a system level, the biggest changes might be in privacy. Apple is requiring apps to request permission for certain kinds of tracking, and it’s requiring app makers to make an RDA nutritional data-style fact sheet for the kinds of privacy policies their apps have. It’s also popping a warning when apps look at your clipboard — which has already caused some apps to clean up their acts. All will exert pressure on the app ecosystem to change.\n Similarly, Safari is now going to show a report of the trackers it has “prevented.” Note the word here is “prevented,” not “blocked,” as fully blocking some web technologies would break a lot of things. The effect is largely the same, though: Apple’s more aggressive Intelligent Tracking Prevention framework will go much further than Chrome in stopping tracking on the web. The number it shows you isn’t anything you can  do anything with beyond using it to shame websites. (I think the number doesn’t tell the whole story, but that is... another story.)\n You will be able to change your default browser and email app but not maps\n That’s just a  few of the privacy features, but I’m also pleased to see so many accessibility features. Apple has added machine learning to its VoiceOver accessibility feature so it can read the screen in apps that haven’t been updated to support it officially (just like Android 11 will). There are also headphone accommodations, spatial audio for AirPods users, and “Sound Recognition,” which can alert you to the sound of a fire alarm or doorbell. The Back Tap feature has garnered a lot of attention, too. It lets you tap the back of the iPhone to trigger certain actions. It’s fun, but in the early betas, I triggered it accidentally all the time.\n Beyond that, like I said at the top, the list of features is so long it seems like everybody at Apple was given permission to just go ahead and ship their pet feature. We’re finally going to get the ability to set alternative browsers and email apps as the default. (I haven’t been able to test this yet.) The clock app has a nice bedtime feature, Memoji have been enhanced, the camera is able to take photos faster after the first shot, you can lock exposure for longer, there’s a redesigned image picker, you can use your iPhone as a car key for certain cars, and just far, far too many other things for me to get into here.\n Hell, I haven’t even mentioned App Clips, which are small, temporary versions of apps that will either be little-used curiosities (as Instant Apps for Android seem to be) or a major shift in how we think about apps and their permanence on our phones. What if an app was as easy to use and dismiss as a browser tab?\n Here’s another example: photo captions. This is a big deal for me because it means I can label certain photos I am constantly searching for (the local train map, the one good photo of a haircut to show a barber, etc). It’ll make finding those photos much easier. As feature 637 (or whatever), though, it just gets lost in the shuffle.\n  Nothing in iOS 14 will overwhelm you, not really. There are a thousand new features to discover, but I suspect that many people won’t be doing that discovering. As with Android, iOS is a mature operating system, so the problem of discoverability is perhaps an inevitable one.\n My wholly unsolicited advice to Apple is to finally do what every other platform company does: release app updates more often and save the yearly cadence for the big system-level stuff. Why an update to Memoji or the Home app (which, yes, also has new features) needs to wait for Apple’s big OS updates is a mystery. But it’s one that’s easily solved by just putting out app updates when they’re ready.\n If that meeting I imagined from last year is happening again right now, I hope that when the executives ask “What’s next?,” some of the answers can arrive when they’re ready instead of when iOS 15 is.\n Apple   How to stop Facebook’s iOS bug from crashing Spotify, Pinterest, Tinder, and other apps\n  Apple   Spotify, Pinterest, Tinder, and many other iOS apps are crashing again due to a Facebook issue\n  View all stories in Tech", "posttime": "2020-07-10 21:59:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "iphone,apple,苹果,ios,发布", "title": "在iOS 14和iPadOS 14公开测试版发布时亲身体验，iPhone上有一个新的主屏幕，带有小部件，这是苹果铅笔的一项Scribble功能，还有更多", "title_en": "Hands-on with iOS 14 and iPadOS 14 as they launch in public beta with a new home screen with widgets on the iPhone, a Scribble feature for Apple Pencil, more", "transed": 1, "url": "https://www.theverge.com/21317904/ios-ipados-14-public-beta-preview-scribble-home-screen-widgets-apple-maps?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["iphone", "apple", "苹果", "ios", "发布"]}, {"category": "", "categoryclass": "", "imagename": "f7b6ea4ec6c98e9efe66125d0cf14d5f.jpg", "infoid": 1010983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国和澳大利亚政府正在调查一家面部识别公司，该公司从互联网上抓取了数十亿人的照片，并将其用于其数据库。调查将调查Clearview AI及其对数据的抓取和处理是否违反了英国数据保护法和澳大利亚隐私法。\n澳大利亚信息专员办公室(Office Of The Australian Information Commission)和英国信息专员办公室(Office of the UK‘s Information Commission)周四发表声明称，此次调查突显了在全球化的数据环境中，执法合作在保护澳大利亚和英国公民个人信息方面的重要性。\n为我们的编辑订阅CNET Now时事通讯，精选当天最重要的新闻。\nClearview的首席执行官Hoan ton-That表示，公司将配合调查，并为公司的做法进行了辩护。\nClearview AI根据适用的法律从互联网上搜索公开可用的照片。它被用来帮助识别犯罪嫌疑人，也就是说。其强大的技术目前在英国和澳大利亚是不可用的。这些国家的个人可以选择退出。\n尽管Ton-Ton表示这项技术现在两国都不可用，但BuzzFeed新闻在2月份报道称，澳大利亚警方已经使用Clearview AI进行了数百次搜索，英国警方也是如此。\n要退出Clearview的数据库，你必须提交一张你自己的照片，让公司永久保存。只有当您生活在需要Clearview AI允许的州或国家/地区时，您才能选择退出。\n这家面部识别公司在1月份《纽约时报》(New York Times)的一篇报道后成为聚光灯下的焦点。该公司通过从Facebook、Instagram、LinkedIn和YouTube等网站上抓取公共图片，收集了30多亿张人的照片，并声称它有第一修正案的权利这样做。\n据BuzzFeed新闻报道，Clearview人工智能告诉客户，它可以精确地将这些照片与人进行匹配，这一点让公司的客户从警察局到零售店都有了机会。批评人士称，这项技术剥夺了人们的隐私保护，程度令人担忧。\nFacebook、谷歌(Google)和微软(Microsoft)等科技巨头已经就Clearview AI的抓取向其发出了停止令，但这家面部识别公司表示，它打算挑战这些请求。\n三天前，加拿大隐私专员办公室(Office Of The Privacy Commission Of Canada)表示，Clearview AI将离开加拿大，以回应该机构的另一项调查。\n加拿大隐私专员办公室表示，他们仍在调查加拿大警方是如何使用面部识别工具的，以及Clearview AI将如何删除属于加拿大人的数据。\n加拿大、艾伯塔省、不列颠哥伦比亚省和魁北克省隐私保护机构对Clearview的调查仍在进行中。该办公室在7月6日的一份声明中表示，考虑到这一问题对加拿大人隐私权的重要性，当局仍计划发布这一问题的调查结果。\n在针对种族正义和执法做法的大规模抗议活动之后，对面部识别的审查工作得到了加强。民权倡导者和立法者认为，这项技术存在种族偏见，侵蚀了隐私权。微软(Microsoft)、IBM和亚马逊(Amazon)等公司以人权和道德担忧为由，暂停了向执法部门提供面部识别服务，而立法者则提议在全国范围内无限期禁止警察进行面部识别。\n尽管公众对这项技术表示强烈抗议，但Clearview AI还是加倍努力，辩称其面部识别可以帮助警方，甚至提供其监控技术来帮助追踪冠状病毒大流行。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "The governments of the UK and Australia are investigating a  facial recognition company that grabbed billions of people&#39;s pictures from across the internet for use in its database.  The inquiry will look at Clearview AI and whether its scraping and handling of data violated the UK Data Protection Act and the Australian Privacy Act.\n &#34;The investigation highlights the importance of enforcement cooperation in protecting the personal information of Australian and UK citizens in a globalised data environment,&#34; says a Thursday statement from the Office of the Australian Information Commissioner and the UK&#39;s Information Commissioner&#39;s Office.\n  Subscribe to the CNET Now newsletter for our editors&#39; picks of the most important stories of the day.\n Clearview AI&#39;s CEO, Hoan Ton-That, said the company would be cooperating with the investigation, and he defended the company&#39;s practices.\n &#34;Clearview AI searches publicly available photos from the internet in accordance with applicable laws. It is used to help identify criminal suspects,&#34; Ton-That said. &#34;Its powerful technology is currently unavailable in the UK and Australia. Individuals in these countries can opt out.&#34;\n Though Ton-That said the tech is now unavailable in the two countries, BuzzFeed News reported in February that Australian police had made  hundreds of searches using Clearview AI, as had  police in the UK.\n To opt out of Clearview AI&#39;s database, you have to  submit a photo of yourself for the company to permanently keep. You can opt out only if you live in a state or country that requires Clearview AI to let you.\n                                             The facial recognition company was thrown into the spotlight after a New York Times story in January. The company amassed more than 3 billion photos of people by scraping public images from websites like Facebook, Instagram, LinkedIn and YouTube, and asserted that  it had a First Amendment right to do so.\n Clearview AI tells customers that it can match those photos to people with pinpoint accuracy, a pitch that&#39;s landed the company  clients from police departments to retail stores, according to BuzzFeed News. Critics say the technology strips away people&#39;s  privacy to an alarming extent.\n Tech giants like  Facebook, Google and Microsoft have sent cease-and-desist orders to Clearview AI over its scraping, but the facial recognition company said it intends to challenge those requests.\n The joint investigation comes three days after the Office of the Privacy Commissioner of Canada said that  Clearview AI will be leaving Canada in response to a separate investigation by that agency.\n The office of Canada&#39;s privacy commissioner said it&#39;s still investigating how Canadian police used the facial recognition tool, and how Clearview AI would delete data belonging to Canadians.\n &#34;The investigation of Clearview by privacy protection authorities for Canada, Alberta, British Columbia and Quebec remains open. The authorities still plan to issue findings in this matter given the importance of the issue for the privacy rights of Canadians,&#34; the office said in a statement on July 6.\n Scrutiny of facial recognition has intensified following   mass protests regarding racial justice and   law enforcement practices. Civil rights advocates and lawmakers argue that the technology is racially biased and erodes privacy rights. Companies like  Microsoft,  IBM and  Amazon have paused their facial recognition offers to law enforcement, citing human rights and ethical concerns, while lawmakers have proposed an indefinite   national ban on facial recognition for police.\n Despite the public outcry against the technology, Clearview AI has doubled down, arguing that  its facial recognition can help police, even offering its surveillance technology to help track the  coronavirus pandemic.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-07-10 21:59:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "澳大利亚,australian,clearview", "title": "英国和澳大利亚数据隐私办公室表示，他们正在对Clearview AI展开联合调查", "title_en": "UK and Australian data privacy offices say they are opening a joint investigation of Clearview AI", "transed": 1, "url": "https://www.cnet.com/news/uk-and-australia-open-joint-data-privacy-investigation-on-clearview-ai/", "via": "", "real_tags": ["澳大利亚", "clearview"]}, {"category": "", "categoryclass": "", "imagename": "e3a89a929b4bce838ab81e897826a8e0.jpg", "infoid": 1010982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "史诗游戏公司新发布的一款iOS应用程序可以让开发人员记录面部表情，这些表情可以直接导入到虚幻引擎中，只需使用iPhone的前置摄像头即可。Live Link人脸应用程序现在可以从App Store下载，它可以将这些面部动画数据实时直接流式传输到虚幻引擎中的角色上，Eic希望这将使创作者“更容易和更容易”捕捉面部。\nEPIC的应用程序是建立在苹果现有的几项技术之上的，包括其ARKit增强现实平台，以及苹果在2017年随iPhone X推出的TrueDepth摄像头。这与苹果的Animoji和Memoji是同一项技术，它们可以将你的面部表情映射到卡通头像上。只是现在，它可以用来为引擎中的化身制作动画，为世界上许多最受欢迎的游戏提供动力。\nEPIC并不是第一家考虑将苹果的技术作为动画工具的公司。在iPhone X发布后，开发人员很快就开始开发面部捕捉应用程序，我们还在2018年看到它用于为“行尸走肉”增强现实游戏生成面部表情。但将该功能直接内置到虚幻引擎中，世界各地数以百万计的开发人员都在使用该引擎，这可能会使其覆盖范围更广，并使艺术家更容易在他们的作品中使用它。\nEPIC表示，其Live Link Face应用程序可以在从艺术家的家庭办公室到有多名演员穿着头盔钻机的运动捕捉套装的音响舞台上工作，并且可以在它们之间进行本机调整。这款应用程序可以远程控制，因此Etic表示，你可以将其设置为使用单一命令在多部iPhone上同时开始录制。导入后，可以在引擎内调整面部动画数据。\n如果你是一名开发人员，有兴趣亲自试用这款应用程序，可以在这里找到Epics的功能文档。", "note_en": "A  newly released iOS app from Epic Games lets developers record facial expressions that can be imported directly into the Unreal Engine, using little more than an iPhone’s front-facing camera. The  Live Link Face app, which is available to download now from the App Store, can stream this facial animation data in real time directly onto characters in Unreal Engine, which Epic hopes will make facial capture “easier and more accessible” for creators.\n Epic’s app works by building on a couple of Apple’s existing technologies, including its  ARKit augmented reality platform, and the TrueDepth camera that Apple  introduced with the iPhone X in 2017. It’s the same technology that powers Apple’s  Animoji and  Memoji, which map your facial expressions onto cartoon avatars. Only now it can be used to animate avatars in the engine powering many of the world’s most popular games.\n   Epic isn’t the first company to have thought of using Apple’s technology as an animation tool. It didn’t take long for developers to start making  facial capture apps after the iPhone X’s release, and we also saw it used to generate facial expressions for a   Walking Dead augmented reality game in 2018. But having the functionality built directly into the Unreal Engine, which is used by  millions of developers around the world, could give it a much larger reach, and make it much easier for artists to use it in their work.\n Epic says that its Live Link Face app can work in situations ranging from an artist’s home office to a soundstage with multiple actors in motion capture suits with head-mounted rigs, and that it can natively adjust between them. The app can be controlled remotely, so Epic says you could set it up to simultaneously start recording on multiple iPhones using a single command. Once imported, the facial animation data can be adjusted in-engine.\n If you’re a developer who’s interested in trying out the app for yourself, the Epic’s documentation for the feature  can be found here.", "posttime": "2020-07-10 21:58:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,ios,发布,games,应用程序", "title": "EPIC Games发布了一款名为Live Link Face的iOS应用程序，可以将面部表情直接记录到虚幻引擎中", "title_en": "Epic Games releases an iOS app, called Live Link Face, enabling the recording of facial expressions directly into the Unreal Engine", "transed": 1, "url": "https://www.theverge.com/2020/7/9/21318440/unreal-engine-facial-capture-ios-app-arkit-truedepth-front-facing-camera-animation?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["程序", "ios", "发布", "games", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "e99f42f8474d2532b884a91f07d3088e.jpg", "infoid": 1010981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "索尼和史诗游戏公司今天宣布，索尼已经投资2.5亿美元购买了堡垒之夜游戏制作人的少数股权。有了新的资金，史诗运动会到目前为止已经筹集了18.3亿美元。\n两家公司表示，这笔交易巩固了本已密切的关系，并强化了他们的共同目标，即推进技术、娱乐和社交在线服务领域的最先进水平。这种密切的关系在5月份得到了突显，当时Etic首次展示了即将推出的运行在PlayStation5上的虚幻引擎5(Unreal Engine 5)图形。正如该公司自己透露的那样，EpicGames在之前的三轮融资中筹集了15.8亿美元。2012年，该公司获得腾讯3.3亿美元的投资，获得40%的股权。\n根据这项协议，这笔投资使索尼和Etic能够扩大合作，利用索尼的娱乐资产和技术组合以及Etic的社交娱乐平台和数字生态系统(想想堡垒之夜越来越多地将其用作社交空间或Etic游戏商店)，为消费者和创作者创造独特的体验。投资的结束取决于惯例的结束条件，包括监管部门的批准。\nEPIC证实，它仍然可以在其他平台上发布。如前所述，索尼只收购了Eic Games的一小部分，而不是收购该公司的控股权。(更新版：索尼正在收购史诗游戏1.4%的股份，这意味着该交易对史诗游戏的估值为178.6亿美元)。\nVB Transform 2020 Online-7月14-17日。加入领先的人工智能高管：注册的最后机会！\n这笔交易对索尼来说很重要，因为在即将到来的游戏机大战中，它需要盟友。今年晚些时候，索尼计划推出PlayStation5游戏机，与微软的Xbox Series X展开竞争。但Epicc已经表示，其虚幻引擎5和堡垒之夜将与所有游戏平台合作，因为Epicc在制造跨平台技术方面通常是中立的。索尼是否从投资Etic中获得任何优势，从这笔交易中还不清楚。\n在一份声明中，索尼首席执行官吉田健一郎表示，Epicc的技术使其处于游戏开发的前沿，这一点在堡垒之夜的特征中就是例证。与此同时，EPIC首席执行官蒂姆·斯威尼在一份声明中表示，索尼和EPIC都在创意和技术的交汇点创建了业务，他们都有一个共同的愿景，即实时3D社交体验将导致游戏、电影和音乐的融合。他还表示，各方计划为所有消费者和内容创作者建立一个更开放、更容易获得的数字生态系统。\n这个音乐参考似乎是对最近在堡垒之夜举行的虚拟特拉维斯·斯科特演唱会的召唤，这场演唱会吸引了2700多万人。提到更加开放和可访问的数字生态系统也令人惊讶，因为Sweeney长期以来一直是开放系统的支持者，而索尼一直是保护其专有技术的公司的典范。然而，索尼已经使堡垒之夜可以作为一款交叉游戏，让朋友们在其他平台上相互游戏。\n这笔交易与彭博社(Bloomberg)6月份报道的不同，我们独立证实了这一报道，即Etic Games寻求以163亿美元的钱前估值筹集7.5亿美元，钱后估值(交易完成后公司的价值)为170亿美元。EPIC拒绝对这笔交易置评。\n史诗游戏既是堡垒之夜的开发商也是发行商，后者拥有超过3.5亿注册用户。它也是虚幻引擎的创造者，虚幻引擎是构建许多游戏(以及越来越多地制作电影和电视)的基本工具集。\n彭博社(Bloomberg)在6月份表示，参与单独一轮融资的新投资者是T.Rowe Price Group和Baillie Gifford。彭博社援引匿名消息人士的话报道，现有投资者KKR&amp；Co.也将参与其中。EPIC也没有对这一细节发表评论。\n正如我们在6月初报道的那样，Eic Games的募集资金让我们有机会了解该公司目前的财务状况，因为私人持股的Etic没有披露其收入或利润。EPIC拒绝对以下数字发表评论。\n消息人士告诉GamesBeat，2019年，Eic Games公布的收入为42亿美元，息税折旧及摊销前利润(EBITDA，衡量盈利能力的关键指标)为7.3亿美元。2020年的收入预计为50亿美元，EBITDA为10亿美元。\n消息人士告诉我，仅在4月份，由于大流行，堡垒之夜的收入就达到了4亿美元。消息人士称，4月份，玩家在皇家射击战斗中花费了32亿个小时。\n2018年，史诗运动会的表现好于2019年。消息人士称，2018年营收为56亿美元，EBITDA为29亿美元。EPIC用这笔钱对其EPIC游戏商店进行了大量投资，为堡垒之夜和虚幻引擎扩大了员工规模，并进行了一些收购。\n2017年，作为2017年迪士尼加速器计划的一部分，该公司获得了迪士尼的战略投资。2018年10月，Epic12.5亿美元的融资后估值为145亿美元。这轮融资的投资者包括KKR、火神资本(Vulcan Capital)、凯鹏华盈(Kleiner Perkins)、LightSpeed Ventures、Smash Ventures和Iconiq。\n作为5月份发布虚幻引擎5的一部分，斯威尼在接受GamesBeat采访时表示，Epic.“与索尼有着密切的关系.”“我们与索尼在存储架构和其他元素方面进行了相当长时间的超级密切合作.”这一直是我们的主要关注点。但虚幻引擎5将会出现在所有下一代平台上，堡垒之夜也会如此。“斯威尼当时说。\n他补充说，“索尼在这里设计了一个伟大的系统，这一点令人敬畏。它不只是一个伟大的GPU，他们也不只是采用最新的PC硬件并升级到它，而是遵循阻力最小的道路。PlayStation5的存储架构远远领先于你现在任何一台PC上花任何钱都能买到的任何东西。很高兴看到这样的创新。这将有助于推动未来的个人电脑。他们看到这款产品上市后会意识到，‘哇，有了两个固态硬盘，我们就得迎头赶上了。’“。\nEPIC Games没有说明它将把这笔钱用在什么地方。但很有可能，该公司将继续进行收购，投资于其史诗游戏商店，扩大堡垒之夜，并推动Metaverse的创建。后者是虚拟世界的宇宙，所有的虚拟世界都是相互联系的，就像在《雪崩》和《一号玩家》等小说中一样。斯威尼曾表示，这是他的目标之一。", "note_en": "Sony has invested $250 million for a minority stake in  Fortnite maker  Epic Games, the companies announced today. With the new money, Epic Games has raised $1.83 billion to date.\n The companies said the deal cements an already close relationship and reinforces their shared goal to advance the state of the art in technology, entertainment, and socially connected online services. This close relationship was underscored in May  when Epic first showed the upcoming Unreal Engine 5 graphics running on a PlayStation 5. As the company itself has disclosed, Epic Games raised $1.58 billion in three previous funding rounds. In 2012, the company received a  $330 million investment from Tencent for a 40% ownership stake.\n  Under the deal, the investment enables Sony and Epic to broaden their collaboration, with Sony’s portfolio of entertainment assets and technology and Epic’s social entertainment platform and digital ecosystem (think Fortnite’s increasing use as a social space or the Epic Games Store), to create unique experiences for consumers and creators. The closing of the investment is subject to customary closing conditions, including regulatory approvals.\n Epic confirmed it will still be able to publish to other platforms. As noted, Sony is acquiring only a minority part of Epic Games, and it is not acquiring a controlling stake in the company. (Update: Sony is acquiring a 1.4% stake in Epic, which means the deal values Epic Games at $17.86 billion).\n  VB Transform 2020 Online - July 14-17. Join leading AI executives:  Last chance to register!\n The deal is important for Sony because it needs allies in the upcoming console war. Later this year, Sony plans to launch the PlayStation 5 game console in competition with Microsoft’s Xbox Series X. But Epic has said that its Unreal Engine 5 and Fortnite will work with all game platforms, as Epic has generally been neutral when it comes to making cross-platform technology. If Sony gets any advantage from investing in Epic, it isn’t clear from this deal.\n In a statement, Sony CEO Kenichiro Yoshida said that Epic’s technology keeps it at the forefront of game development and that is exemplified in the features of Fortnite. Epic CEO Tim Sweeney, meanwhile, said in a statement that both Sony and Epic have created businesses at the intersection of creativity and technology and they share a vision of real-time 3D social experiences that will lead to a convergence of gaming, film, and music. He also said the parties plan to build a “more open and accessible digital ecosystem for all consumers and content creators.”\n The music reference seems like a call out to the recent  virtual Travis Scott concert in Fortnite, which drew more than 27 million people. The mention of a more open and accessible digital ecosystem is also a surprise, as  Sweeney has long been a proponent of open systems, while Sony has been an example of a company that protects its proprietary technology. Sony has, however, enabled Fortnite to function as a crossplay game that also lets friends play each other across other platforms.\n  The deal is different from the one that  Bloomberg reported in June, which we independently confirmed, that Epic Games was seeking to raise $750 million at a pre-money valuation of $16.3 billion, with a post-money valuation (the value of the company after the deal is done) of $17 billion. Epic declined to comment on that deal.\n Epic Games is both the developer and publisher of Fortnite, which has more than  350 million registered users. And it is also the creator of the Unreal Engine, a fundamental toolset for building many games (and increasingly,  making movies and TV).\n Bloomberg said in June that new investors participating in the separate round are T. Rowe Price Group and Baillie Gifford. Existing investors KKR &amp; Co. will also participate, Bloomberg reported, citing unnamed sources. Epic did not comment on that detail either.\n   As we reported earlier in June, Epic Games’ fundraising gave us a window into the company’s current financial picture, as the privately held Epic does not disclose its revenues or profits. Epic has declined to comment on the below numbers.\n Sources told GamesBeat that in 2019, Epic Games reported $4.2 billion in revenue and $730 million in earnings before interest, taxes, depreciation, and amortization (EBITDA, a key measure of profitability). Revenue for 2020 is forecast to be $5 billion, with EBITDA of $1 billion.\n In April alone, thanks to the pandemic, Fortnite revenue was $400 million, sources told me. In April, players spent 3.2 billion hours in the battle royale shooter, sources said.\n In 2018, Epic Games did better than it did in 2019. Revenue in 2018 was $5.6 billion, with EBITDA of $2.9 billion, sources said. Epic used a lot of that money to invest in its Epic Games Store, expanding its staff for Fortnite and Unreal Engine, and some acquisitions.\n  In 2017, the company received a strategic investment from Disney as part of the 2017 Disney Accelerator program. And in October 2018, Epic raised $1.25 billion at a $14.5 billion post-money valuation. Investors in that round included KKR, Vulcan Capital, Kleiner Perkins, Lightspeed Ventures, Smash Ventures, and Iconiq.\n As part of the Unreal Engine 5 announcement in May, Sweeney said in an interview with GamesBeat that Epic had a close relationship with Sony. “We’ve been working super-closely with Sony for quite a long time on the storage architecture and other elements. It’s been our primary focus. But Unreal Engine 5 will be on all next-generation platforms, and so will Fortnite,” Sweeney said at the time.\n He added, “Sony has done an awesome job of architecting a great system here. It’s not just a great GPU, and they didn’t just take the latest PC hardware and upgrade to it, following the path of least resistance. The storage architecture in PlayStation 5 is far ahead of anything that you can buy in any PC for any amount of money right now. It’s great to see that sort of innovation. It’s going to help drive future PCs. They’ll see this thing ship and realize, ‘Wow, with two SSDs, we’ll have to catch up.&#39;”\n Epic Games didn’t say what it would use the money for. But it’s a good bet the company will continue to make acquisitions, invest in its Epic Games Store, expand Fortnite, and drive toward the creation of the Metaverse. The latter is the universe of virtual worlds that are all interconnected, like in novels such as   Snow Crash and   Ready Player One.  Sweeney has said this is one of his goals.", "posttime": "2020-07-10 21:58:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,史诗,bringing,索尼", "title": "索尼向史诗游戏投资2.5亿美元，获得1.4%的股份，使堡垒之夜的制作人筹集的资金总额达到18.3亿美元", "title_en": "Sony invests $250M in Epic Games for a 1.4% stake, bringing the total raised by the maker of Fortnite to $1.83B", "transed": 1, "url": "https://venturebeat.com/2020/07/09/sony-invests-250-million-in-fortnite-maker-epic-games/", "via": "", "real_tags": ["游戏", "史诗", "bringing", "索尼"]}, {"category": "", "categoryclass": "", "imagename": "ea21b59eb8920c2b4465709ef29f137b.jpeg", "infoid": 1010979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook Inc.委托进行的审计。敦促它改进基于人工智能的工具，用来帮助识别仇恨言论等有问题的内容，展示出目前在监管全球最大的社交媒体平台方面技术的限制。\n周三公布的这份报告审查了Facebook对民权的做法，并批评其“过于被动和零敲碎打”，尽管对基于人工智能的审查员和受过追踪和删除有害内容培训的人类分析师进行了大量宣传。\n..。", "note_en": "An audit commissioned by Facebook Inc. urged it to improve artificial intelligence-based tools it uses to help identify problematic content such as hate speech, showcasing the current limits of technology in policing the world’s largest social media platform.\n  The report, made public Wednesday, examined Facebook’s approach to civil rights and criticized it as “too reactive and piecemeal,” despite much-publicized investments in AI-based censors and human analysts trained to track down and remove harmful content.\n...", "posttime": "2020-07-10 21:57:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "华尔街,华尔街日报,street", "title": "华尔街日报", "title_en": "Wall Street Journal", "transed": 1, "url": "https://www.wsj.com/articles/facebooks-artificial-intelligence-doesnt-eliminate-objectionable-content-report-finds-11594287000?mod=djemalertNEWS", "via": "", "real_tags": ["华尔街", "华尔街日报", "street"]}, {"category": "", "categoryclass": "", "imagename": "36a2828decfe18b5a4e52b0603694cf5.jpg", "infoid": 1010976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一些流行的应用和服务，包括Spotify，Pinterest和Tinder，目前在iOS设备上崩溃，早期的分析表明Facebook是罪魁祸首。\n社交媒体上有广泛的报道称，每当iPhone和iPad上发布应用程序时，它们都会崩溃，DownDetector.com上也有相应的宕机高峰。这些应用程序可以在设备离线的情况下启动，这在某些情况下很有用(例如，如果你在Spotify上保存了大量音乐)，但在其他情况下会完全破坏它们的功能。\n虽然停机的确切原因还没有得到证实，但早期的报告表明，这个问题是由Facebook的软件开发工具包(SDK)引起的，许多应用程序都使用它来管理用户登录。用户不一定要使用Facebook登录应用程序才能影响他们的软件，也没有同样的应用程序在Android上崩溃的报告。\n还有另一个Facebook SDK问题导致我们的iOS应用程序与Spotify&amp；Pinterest@FB_Engineering等主要应用程序在发布时再次崩溃。\n-彼得·朱拉斯(@peterjuas)2020年7月10日。\nFacebook今早在其开发者平台上承认，其软件引发了问题。该公司表示：“我们意识到iOS SDK上的错误增加，并对此进行了调查，这导致了一些应用程序崩溃。”在美国东部时间上午7点左右发布的GitHub帖子中，许多开发者报告了他们的应用程序存在问题，并指责Facebook。\n考虑到这并不是这家社交媒体巨头的SDK第一次破解大量这样的应用程序，开发人员和用户的恼火是合理的。5月6日发生了一个几乎相同的问题，影响了数十家服务机构一天中的大部分时间。\n正如应用程序开发者Guilherme Rambo当时告诉我们的那样，问题的根源在于，Facebook通过向开发者提供关于应用程序使用和广告的宝贵见解，鼓励他们将其登录服务整合到他们的应用程序中。\n“Facebook真的推动开发者安装他们的SDK，可能是因为他们想要收集那些应用程序用户的非常丰富的数据，”兰博在5月份说。“SDK为开发者和营销团队提供了便利，因为它还可以用来跟踪通过Facebook投放的广告的转化情况。”\n这意味着当Facebook的服务出现问题时，它会影响到大量的其他应用程序，就像今天一样。每次用户使用SDK打开应用程序时，它都会调用Facebook的服务器，准备对任何登录进行身份验证。(这就是为什么脱机打开一个应用程序可以避免这个问题，尽管你可以安装一个阻止这些呼叫的应用程序。)。\n我们已经联系Facebook寻求评论，如果我们听到更多消息，我们将更新这篇报道。", "note_en": "A number of popular apps and services including Spotify, Pinterest, and Tinder are currently broken on iOS devices, with early analysis suggesting Facebook is to blame.\n There are  widespread reports on social media of apps crashing whenever they’re launched on iPhones and iPads, and corresponding outage spikes on  DownDetector.com. The apps can be launched if the device is offline, which is useful in some cases (if you have lots of music saved on Spotify, for example) but will completely break their functionality in others.\n Although the exact cause of the outages isn’t yet confirmed, early reports suggest the problem is caused by Facebook’s software development kit, or SDK, which many apps use to manage user logins. Users don’t have to be using Facebook to log into an app for this to affect their software, and there are no reports of the same apps crashing on Android.\n There&#39;s another facebook SDK issue that lead&#39;s to our iOS app to crash on launch again along with major apps like Spotify &amp; Pinterest  @fb_engineering\n— Peter Juras (@peterjuras)  July 10, 2020\n  Facebook acknowledged on its developer platform  this morning that its software was causing problems. “We are aware and investigating an increase in errors on the iOS SDK which is causing some apps to crash,” said the firm. In a GitHub  thread posted around 7AM ET, numerous developers reported problems with their apps and blamed Facebook, too.\n The annoyance from developers and users is justified considering this isn’t the first time the social media giant’s SDK has knocked out a large number of apps like this. A near-identical problem  occurred on May 6th and affected dozens of services for a good chunk of the day.\n As app developer Guilherme Rambo  told us at the time, the root of the issue is that Facebook encourages developers to integrate its log-in services into their apps by offering them valuable insights about app usage and advertising in return.\n “Facebook really pushes developers into installing their SDK, likely because they want the very rich data they can collect on those app’s users,” said Rambo in May. “The SDK is offered as a convenience for both developers and marketing teams, since it can also be used to track the conversions of ads run through Facebook.”\n This means when there’s an issue with Facebook’s services, it affect a huge number of other apps, as it has today. Every time a user opens an app using the SDK, it makes a call to Facebook’s servers in preparation to authenticate any logins. (That’s why opening an app offline prevents the problem, although you can  install an app that blocks these calls.)\n We’ve reached out to Facebook for comment and will update this story if we hear more.", "posttime": "2020-07-10 21:56:33", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,程序,ios,应用程序,apps", "title": "由于Facebook SDK的问题，TikTok、Spotify、Tinder、Pinterest和许多其他iOS应用程序都崩溃了，这些应用程序用来管理用户登录", "title_en": "TikTok, Spotify, Tinder, Pinterest, and many other iOS apps are crashing due to an issue with the Facebook SDK, which apps use to manage user logins", "transed": 1, "url": "https://www.theverge.com/2020/7/10/21319784/ios-apps-crashing-spotify-tiktok-pinterest-tinder-facebook-sdk-certification-issue?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "程序", "ios", "应用程序", "apps"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1010975, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在就开始使用面向技术专业人士的在线简历生成器免费构建您的简历。我们将为您提供数据驱动的推荐，帮助您找到梦寐以求的工作。", "note_en": "Start building your resume for free today with the online          resume builder for tech professionals. We'll give          you data-driven recommendations to help you land your dream job.", "posttime": "2020-07-10 21:55:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,software", "title": "两年可实现10美元的软件收入", "title_en": "Two Years to Make $10 in Software Revenue", "transed": 1, "url": "https://www.beamjobs.com/startups/2-years-to-make-10-dollars-in-software-revenue", "via": "", "real_tags": ["软件", "software"]}, {"category": "", "categoryclass": "", "imagename": "c9bcfbf7c8c7dbf13d58b1ef2eaef680.jpg", "infoid": 1010974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移动分析公司Sensor Tower表示，流媒体服务Quibi只成功地将其早期一波用户中略低于10%的用户转化为付费订户。根据该公司关于Quibi早期增长的最新报告，这个短片视频平台在4月份的头几天就签约了约91万用户。在这些用户中，只有大约7.2万人在三个月的免费试用后留了下来，这表明这款应用的转化率约为8%。\n那还不算太糟。但与流媒体视频行业过去几年最成功的首次亮相迪士尼+相比，结果对奇比来说是一幅严峻的图景。尽管在新冠肺炎大流行期间，屏幕播放时间激增，但奇比一直在努力在其以移动为中心的节目中找到热门节目，并获得渴望的年轻、热爱TikTok的观众的支持。根据Sensor Tower的数据，迪士尼成功地转化了11%的早期免费试用用户，但该公司估计，迪士尼Plus在美国和加拿大上市的前三天就有950万人签约，这是其中的一个数字。从那时起，迪士尼又增加了数千万订户，截至4月份，迪士尼现在享有超过5000万付费用户，这在一定程度上要归功于其国际扩张。\nQuibi在应用程序的前三天只有8%的下载者进行了转换。\n不要将这些数字与Quibi现有的付费用户数量混淆。虽然该公司尚未披露这一至关重要的数字，但它表示，自4月份以来，已有超过560万人下载了这款应用。我们不知道有多少人在最初几天下载了这款应用，然后决定在免费试用结束后转为付费用户。\n传感器塔还估计总共只有450万人下载了Quibi。这一数字与Quibi的官方数据之间的差异表明，传感器塔对Quibi在头三天转化了多少用户的估计可能也有很大差距。在给The Verge的一份声明中，Quibi的一位发言人说，“付费订户的数量不正确一个数量级。到目前为止，已经有超过560万人下载了Quibi应用程序。我们从下载到试用的转化率高于移动应用基准，我们看到向付费订户的转化率非常好--无论是从4月份开始的90天免费试用注册，还是从5月和6月开始的14天免费试用注册。“。\n话虽如此，Sensor Tower是一家享有盛誉的分析公司，以报告准确的估计而闻名，在Quibi本身没有具体数据的情况下，其报告对这家流媒体服务公司的业务描绘的图景并不乐观。传感器塔的数据也不包括iPad用户下载Quibi这样的情况，尽管它只针对智能手机屏幕进行了优化，或者用户删除应用程序并再次下载或下载到另一台设备上，所有这些情况都可能导致Quibi的总下载量更大。\n无论如何，说Quibi的发布不是很棒并不是有争议的--联合创始人杰弗里·卡森伯格直接指责冠状病毒是该应用程序早期失败的罪魁祸首。关于该公司的缺点，人们写了很多文章，从这款应用糟糕的营销和糟糕的时机，到无法在社交媒体上分享截图或截图，再到Quibi在发布时缺乏智能电视或选角支持。\n最重要的是，该平台似乎没有值得注册的节目，比如每月增加的Netflix内容数量令人头晕目眩，或者像迪士尼+的曼达洛人(The Mandalorian)这样的大型流行文化活动。Quibi没有内置的安装基础，就像HBO最近推出HBO Max那样，如果用户不更多地出现，Quibi的18亿美元资金还能维持多久，这是一个悬而未决的问题。", "note_en": "Streaming service Quibi only managed to convert a little under 10 percent of its early wave of users into paying subscribers, says mobile analytics firm Sensor Tower. According to the firm’s new report on Quibi’s early growth, the short-form video platform signed up about 910,000 users in its first few days back in April. Of those users, only about 72,000 stuck around after the three-month free trial, indicating the app had about an 8 percent conversion rate.\n That’s not too bad. But compare it to the streaming video industry’s most successful debut of the last few years, Disney Plus, and the resulting picture is a grim one for Quibi, which has struggled both to find a hit among its mobile-centric shows and gain traction with its desired younger, TikTok-loving demographic, despite the surge in screen time during the COVID-19 pandemic. According to Sensor Tower, Disney managed to convert a comparable 11 percent of early free trials users, but that was of out of whopping 9.5 million people the firm estimates signed up for Disney Plus in its first three days of availability in the US and Canada. Since then, Disney has added tens of millions more subscribers and now enjoys  more than 50 million paying users as of April thanks in part to its international expansion.\n Quibi converted just 8 percent of the people who downloaded the app in its first three days\n These numbers are not to be confused with the number of current paying subscribers Quibi has. While the company has yet to disclose that all-important figure, it has said that more than 5.6 million people have downloaded the app since April. We don’t know how many people downloaded the app after its first few days and decided to then convert to a paid user after the free trial ended.\n Sensor Tower also estimates only 4.5 million have downloaded Quibi in total. The discrepancy between that figure and Quibi’s official one suggests Sensor Tower could also be far off in its estimates of how many users Quibi converted in its first three days. In a statement given to  The Verge, a Quibi spokesperson said, “the number of paid subscribers is incorrect by an order of magnitude. To date, over 5.6 million people have downloaded the Quibi app. Our conversion from download to trial is above mobile app benchmarks, and we are seeing excellent conversion to paid subscribers — both among our 90-day free trial sign-ups from April, as well as our 14-day free trial sign-ups from May and June.”\n That said, Sensor Tower is a reputable analytics company known for reporting accurate estimates and, in absence of concrete figures from Quibi itself, the picture its report paints of the streaming service’s business is not a rosy one. Sensor Tower’s data also doesn’t account for situations like an iPad user downloading Quibi, even though it’s not optimized for anything but smartphone screens, or users deleting the app and downloading it again or onto a separate device, all situations that may lead to Quibi’s larger total download figure.\n  Regardless, it’s not exactly controversial to say Quibi is not having a very great launch — co-founder Jeffrey Katzenberg  outright blamed the coronavirus for the app’s early failures. Much has been  written about the company’s shortcomings, from the app’s poor marketing and bad timing to the  inability to share screenshots or captures on social media to Quibi’s  lack of smart TV or casting support at launch.\n Most importantly, the platform doesn’t appear to have shows worth signing up for, like the mind-numbing amount of Netflix content that gets added each month or big pop culture events like Disney Plus’  The Mandalorian. Quibi has no built-in install base, like HBO had for its recent launch of HBO Max, and it’s an open question how long its $1.8 billion war chest will keep it afloat if users don’t show up in greater numbers.", "posttime": "2020-07-10 21:55:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,quibi,reportedly", "title": "据报道，Quibi在免费试用到期后失去了90%的早期用户", "title_en": "Quibi reportedly lost 90 percent of early users after their free trials expired", "transed": 1, "url": "https://www.theverge.com/2020/7/8/21318060/quibi-subscriber-count-free-trial-paying-users-conversion-rate", "via": "", "real_tags": ["免费", "quibi"]}]