[{"category": "", "categoryclass": "", "imagename": "61d4623ee68da2c11cbf207d73a60371.jpg", "infoid": 1006191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据《华尔街日报》报道，欧盟正准备最早在下周或之后一周对亚马逊提起反垄断指控。\n今年4月，华尔街日报的一项调查发现，亚马逊使用第三方卖家的数据来帮助开发自己的自有品牌商品。\n“华尔街日报”周四援引知情人士的话报道，欧盟反垄断监管机构正计划就亚马逊对待第三方卖家的方式对其提起诉讼。\n根据“华尔街日报”的说法，指控最早可能在下周或之后一周提出，并将集中在亚马逊作为卖家和市场运营商的双重角色上。\n此前，根据对20多名前员工的采访和华尔街日报看到的文件，华尔街日报的一项调查发现，亚马逊员工使用来自其平台上卖家的非聚合或容易识别的信息，为其专有产品战略提供信息。\n欧盟竞争事务专员玛格丽特·维斯特格(Margrethe Vestager)在2018年对亚马逊展开了初步调查，重点是该公司对第三方商家数据的使用。维斯塔格询问了第三方商家与亚马逊的关系，并试图确定亚马逊是否利用商家的数据对自己有利。\n这种做法也引起了美国监管机构的审查。根据几家美国门店的报道，亚马逊已经在接受联邦贸易委员会(Federal Trade Commission)官员的调查，调查对象是其在零售和云计算领域的商业行为。司法部和众议院司法委员会都对Big Tech展开了广泛的反垄断审查。\n近年来，在维斯特格的领导下，欧盟一直在积极追逐美国的科技巨头。竞争委员会就一系列案件对谷歌母公司Alphabet处以超过90亿美元的罚款。\n然而，与美国监管机构不同的是，欧盟竞争事务专员可以在没有法院批准的情况下，对违反反垄断行为的公司处以高达公司年收入10%的罚款。然而，被控违反竞争的公司可以对这些罚款提出上诉，就像谷歌目前正在做的那样。\n虽然欧盟的案件可能会为在国内对亚马逊提起潜在诉讼制定路线图，但欧洲的监管模式往往比美国更全面。联邦贸易委员会(Federal Trade Commission)和司法部(Department Of Justice)的监管机构必须在损害问题上让法院站在他们一边，传统上，法院高度关注消费者的价格。欧盟更加明确地强调竞争本身的公平理念。\n在美国，众议院司法委员会要求亚马逊首席执行官杰夫·贝佐斯就该公司与第三方卖家的行为作证，并威胁说，如果他不遵守，就会发出传票。亚马逊回应说，它将安排合适的高管出庭作证，但没有明确承诺让贝佐斯作证。", "note_en": "The European Union is preparing to file antitrust charges against Amazon as early as next week or the week after, The Wall Street Journal reports.\n  In April, a Journal investigation found that Amazon uses data from third-party sellers to help develop its own private-label goods.\n The European Union&#39;s antitrust watchdog is planning to file charges against  Amazon over its treatment of third-party sellers,  The Wall Street Journal reported Thursday, citing sources familiar with the case.\n The charges could come as early as next week or the week after and would focus on Amazon&#39;s dual role as both a seller and operator of the marketplace, according to the Journal.\n   It comes after a  Wall Street Journal investigation found Amazon employees had  used nonaggregated or easily identifiable information from sellers on its platform to inform its proprietary product strategy, according to interviews with more than 20 former employees and documents viewed by the Journal.\n EU Competition Commissioner Margrethe Vestager  launched a preliminary probe into Amazon in 2018, focusing on the company&#39;s use of third-party merchants&#39; data. Vestager questioned third-party merchants on their relationships with Amazon and sought to determine whether Amazon uses data from merchants to its advantage.\n The practice has also attracted scrutiny from U.S. regulators. Amazon is already being probed by Federal Trade Commission officials over its business practices in retail and cloud computing, according to reports from  several  outlets. The Department of Justice and the House Judiciary Committee have both opened broad antitrust reviews of Big Tech.\n In recent years under Vestager, the EU has aggressively gone after U.S.-based tech giants. The Competition Commission has slapped Google parent company  Alphabet with more than $9 billion in fines over a series of cases.\n  Unlike U.S. regulators, however, the EU competition commissioner can impose fines up to 10% of a company&#39;s annual revenue for antitrust violations without getting clearance from a court. Companies charged with competition violations, however, can appeal those fines, as Google is currently doing.\n While an EU case could lay out a road map for a potential lawsuit against Amazon back home, the European regulatory model tends to be more sweeping than in the U.S. Regulators at the Federal Trade Commission and Department of Justice must get a court to side with them about the harms, which have traditionally looked heavily at prices for consumers. The EU more clearly emphasizes the notion of fairness in the competition itself.\n In the U.S., the House Judiciary Committee asked Amazon CEO Jeff Bezos to testify about the company&#39;s practices with third-party sellers, and threatened to issue a subpoena if he doesn&#39;t comply. Amazon responded by saying it would &#34;make the appropriate executive available&#34; to testify, but  did not explicitly commit to letting Bezos testify.", "posttime": "2020-06-12 04:09:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,rust,欧盟,face", "title": "亚马逊将因对待第三方卖家在欧盟面临反垄断指控", "title_en": "Amazon to face antitrust charges in EU over its treatment of third-party sellers", "transed": 1, "url": "https://www.cnbc.com/2020/06/11/amazon-to-reportedly-face-antitrust-charges-in-eu.html", "via": "", "real_tags": ["亚马逊", "amazon", "rust", "欧盟", "face"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006190, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1983年，高管，尤其是计算机研究机构的经理，在他的办公室里使用个人电脑的情况并不少见。这台个人电脑的独特之处在于它是一台阿尔托--第一台个人电脑。泰勒和他的团队自1974年以来一直在使用它。一条小电缆将Alto连接到以太网-这是一种将帕洛阿尔托研究所的研究人员彼此联系起来，并与世界各地的同事联系起来的媒介。这个屏幕比大多数电脑显示屏都高，而且即使从房间的另一边看，它看起来也不同于其他电脑屏幕。取而代之的不是一个屏幕大小的框架，里面装满了数字、字母或图形，而是许多大小不一的方块，在施乐的术语中被称为窗口，看起来就像桌子上重叠的几张纸。这些符号和图像也明显比我习惯在电脑屏幕上看到的要清晰。\n鼠标是恩格尔巴特创新的更新版，用一根细线连接到Alto上。当泰勒在屏幕旁边的桌面上滑动鼠标时，一个形状像箭头的黑色小指针在屏幕上移动。当他单击鼠标顶部的一个按钮或将指针移到页边空白时，指针改变了形状，屏幕上发生了一些事情。1984年，苹果公司的麦金塔电脑将这种处理电子桌面的方式引入了大众市场。对泰勒来说，这并不是特别具有未来主义色彩。Altos和Ethernet自1974年以来一直在这里附近运行。\n到了1983年，鲍勃·泰勒对他和其他几个人在20年前开始取得的进展只有一半满意，因为他相信新技术只建成了一半。尽管他所在的办公室、指尖上的电子工作站和他周围的研究机构都是几十年前增强社区梦想的有效例子，但泰勒认为，布什和利克利德预言的互动信息社区可能还需要十年或二十年的努力才能真正影响到更广泛的人群。\n1965年，33岁的罗伯特·泰勒(Robert Taylor)在他位于五角大楼的办公室工作，担任ARPA信息处理技术办公室(ARPA Information Processing Techniques Office)的副主任，然后又担任主任。他的工作是寻找并资助涉及分时、人工智能、编程语言、图形显示、操作系统和其他计算机科学关键领域的研究项目。他记得，我们的经验法则是资助那些很有可能将信息处理能力提升一个数量级的人。\n鲍勃·泰勒还负责发起了ARPAnet的创建-由国防部创建的计算机(和大脑)的原型网络社区，这项工作始于1966年，并成为仍在推动计算技术发展的核心人物的非正式通过仪式。“ARPAnet”是由国防部创建的计算机(和大脑)的原型网络社区，这项工作始于1966年，并成为仍在推动计算技术发展的核心人物的非正式通过仪式。拉里·罗伯茨(Larry Roberts)负责网络的启动和运行，在泰勒于1969年离开ARPA时接替了泰勒。在犹他大学呆了一年后，泰勒加入了施乐公司在斯坦福附近组装的研究工作。\n1970年，越来越多的人反对越南战争，以及ARPA所有研究的军事化，这意味着当一家公司决定提供可以想象到的最绿色的牧场时，计算机网络和交互计算新领域的一批非凡的人才正在寻找更绿色的牧场。\n1969年，施乐公司(Xerox Corporation)首席执行官彼得·麦考罗(Peter McColough)宣布，他打算让施乐成为未来的信息设计师。为此，一个研究机构于20世纪70年代初在帕洛阿尔托成立。麦克洛让一个叫乔治·派克的人负责。派克做的第一件事之一就是聘请了他能找到的最好的长期计算机远见卓识者、研究组织者和人物收藏家-鲍勃·泰勒(Bob Taylor)。起初，新招募的工程师、黑客和远见卓识者在位于斯坦福大学校园附近帕洛阿尔托平原的临时宿舍工作。20世纪70年代中期，在被称为斯坦福工业园(Stanford Industrial Park)的肥沃飞地上，惠普(Hewlett-Packard)上方紧挨着Syntex的一块黄金地块开始施工。\n如果要为知识领域的技术尖端提供一个模范环境，那就是帕洛阿尔托研究开发银行(PARC)。从激光实验室的物理学家和定制微芯片商店的工程师-工匠，到计算机语言设计师、人工智能程序员、认知生理学家、视频骑师、音响工程师、机械师、图书管理员、秘书、厨师、看门人和保安，你会从你遇到的每个人那里得到一种美好的、模型乌托邦的感觉。\n实体工厂本身就是一项不可避免的创新练习。我花了一段时间才不再认为这个地方是颠倒的。由于梯田玻璃和混凝土结构是半嵌在郊狼山中建造的，祖尼·普韦布洛风格，主入口在顶层。要从一楼到二楼，你得往下走。办公室、实验室和会议室相连的四合院环绕着中庭和花园。自助餐厅可以俯瞰帕洛阿尔托；你可以把托盘拿到露台上，从这座21世纪的悬崖住宅的有利位置俯瞰海湾。\n在环绕四合院的走廊外是办公隔间，许多隔间的门都是开着的。在敞开的隔间里，各式各样的人要么打电话，要么盯着他们独特的椭圆形中音屏幕。一些小房间里有植物、海报、豆袋椅(广告)、音响、自行车。他们都有一排排书籍的书架，以及帕洛阿尔托研究所对外发表的报告上使用的亮蓝白相间的活页夹。许多小隔间的居民都很年轻。她们中女性所占的比例比你想象的要大得多。这一直是一群看起来像多国人的人群。\n我毫不费力地将泰勒与他周围各式各样的科学家、工程师、教授、黑客、长发以及男孩和女孩的天才区分开来。尽管如此，风格上的少数差异是微妙的，但却是显而易见的。虽然他的许多同事选择凉鞋、羽绒服、科技嬉皮士马尾辫、蓝色牛仔裤和皱巴巴的绳索，无论有没有自行车夹，但泰勒很可能会穿着熨烫的花呢夹克和没有褶皱的宽松裤。他的金发很随意，但很整齐。当他想看看你是否在跟随他的思路时，他会把额头朝你的方向倾斜，用淡蓝色的眼睛盯着你看，如果他的衬衫是牛仔衬衫而不是牛津棉的话，你会觉得这是老奶奶戴的眼镜。他经常微笑，有时是作为标点符号的一种形式。他的声音中不时带着得克萨斯的痕迹。\n泰勒认为，个人计算机的想法是20世纪60年代初Licklider开始进行分时研究的直接产物。分时，就像第一种高级语言一样，是计算机科学和增强方法的分水岭。它还在计算世界中创建了一个新的子社区，一个跨越军事、科学、学术和商业计算边界的利益社区。在更大的计算机科学家和计算机系统建造者社区中，这是一个相对较小的亚文化。他们被一种他们想要供自己使用的特定类型的计算机的共同愿望所联系在一起，以及作为ARPA研究努力的一部分，十年来共同的经历，以制造他们当时使用的那种计算机。许多分时工作的老兵最初是MAC项目的本科生黑客，或者是伯克利和圣莫尼卡的ARPA资助的工程师，后来在贝尔、SRI、兰德和帕洛阿尔托研究所(PARC)的研究圣地相遇。\n分时是对这样一种哲学的早期而有效的应用，即现有的使用计算机的方式应该根据人们的功能而定，而不是强迫想要使用它们的人遵守机械的限制。如果没有20世纪60年代初多路访问计算的发展，个人计算的想法永远不会只是一个梦想。\n在20世纪60年代初，数据处理是人们期望用计算机做的事情，人们几乎从来没有直接做过这件事。首先，一个程序及其原始数据必须转换成一个装满穿孔卡片的鞋盒。这些卡被送到数据处理中心，在那里系统管理员决定如何以及何时将卡送入主计算机。(这些家伙过去是，现在仍然是支持编程神职人员神话的丰富轶事来源。)。你在一小时、一天或一周后回来，拿到了一张厚厚的打印件和一张巨额账单。按键-提交-等待-检索的仪式被称为批处理。\n到了1966年，加利福尼亚州和马萨诸塞州的团体正朝着将计算机编程艺术提高到足够高的水平，用计算机做一些真正有趣的事情的方向前进。Licklider和其他几个人怀疑，如果他们能让编写和运行程序的人更直接地使用计算机的能力，程序员可能能够以比迄今可能的速度更快的速度构建新的、更好的软件。\n在日益复杂的电子硬件和软件带来的功能中，包括对大量信息进行建模、表示和搜索的能力。有了足够的速度和存储能力，计算机获得了帮助交流创造性方面的能力。但必须克服严重的障碍，才能将这种电力带到人们可以使用的地方。\n当您必须将成盒的穿孔卡倒进阅读器，然后再破译成盒的打印输出时，几乎不可能与您的程序进行动态交互。由于构建程序的很大一部分过程是跟踪复杂指令列表中的细微错误，因此批处理例程对程序员可以做多少、做多快以及他们可以生产的程序的质量进行了有效的限制。\n批处理产生了两个问题：计算机一次只能处理一个程序(和一个程序员)，而程序员在程序运行时不能直接与计算机交互。分时技术之所以成为可能，是因为计算机操作速度和与人交流所需的信息传输速度之间存在巨大差距。例如，即使是速度最快的打字员，在计算机执行数百万次操作所需的时间长度内，也只能输入一次按键。分时制让20、50、100或更多使用电脑的人都产生了一种错觉，即他或她一直在专心使用电脑，而实际上，电脑每隔几百万分之一秒就会从一个用户的任务切换到另一个用户的任务。\n当第一批程序员以交互方式访问计算机时，他们也获得了一种新的自由，可以比以往更快地创建功能更强大的程序并查看结果。60年代的第一台多路访问计算机的程序员能够一次提交一个程序，一次接收一个响应，而不是试图让整个编程工作，无论是好是坏，在一次批处理中工作。通过消除批处理的等待和观望，分时处理使程序员有可能把他们的手艺当作一门表演艺术。\n当我成为ARPA信息处理技术办公室的主任时，分时计划已经在运行了，泰勒回忆说，但它们还没有完成，所以在我担任主任期间，这项工作仍在继续。很明显，这是信息处理技术的重大突破，所以我参与了不同实验系统之间的技术转移，最终转移到军用和民用计算机应用领域。\n当我们与许多业内人士交谈时，我们遇到了一些僵化的态度。IBM起初忽略了ARPA的内容。他们根本不把这件事当回事。然后，通用电气同意与麻省理工学院和贝尔实验室合作，开发和营销一种大型分时系统。IBM说，哎呀，这里正在发生一些事情，他们启动了一个紧急项目，将他们的360系统中的一个改造成分时系统。他们接了几个订单，系统就坏了。他们不能让软件工作，因为他们没有走上ARPA资助的团体几年前走过的路。\n分时研究在企业研究领域造成了一种分裂。改变一下，第一代神职人员似乎错过了内部行动。关注分时体验的公司从长远来看是获得的。它使数码设备成为业界的第二名。DEC注意到了ARPA资助的工作，并在他们走出校门后雇佣了人，并从分时工作中获利。\n一旦分时项目接近完成，泰勒追求的第一件事就是一种将分时社区互连起来的方式。他对当时四分五裂的计算机研究世界有一个特权的概述，因为他的大量时间都花在了前往大学和智库，寻找和资助研究人员上。在20世纪60年代早期，计算机研究的各个子领域的进展都在加速。到了1966年，拼图的碎片准备好组装的时间越来越近，分开的团队必须保持密切的沟通。\n泰勒说，在每个分时社区内，人们都在进行各种不同类型的计算机研究，因此，让分时系统本身发挥作用的整个项目比分时社区不同成员正在探索的任何一个单独的研究领域-人工智能研究、计算机硬件架构、编程语言、图形学等等-都要全球化得多。\n分时系统的应用一次又一次地让我们感到惊讶，这种系统没有人设计过，但无论如何都是有人发明的。在分时系统中拥有文件和资源的能力是一个需要解决的难题。在解决这个问题的过程中，人们发现了一种新的相互交流的方式--这种方式出人意料，并成为研究界一种独特的媒介。15年前，电脑骑手们开始享受这种媒介的乐趣，如今，这种媒介已经变成了被称为电子邮件的商业版本。\n泰勒看到了相互联系的必要性，这些孤立的研究社区是利克利德播种的，萨瑟兰培育的。许多相关领域但不同机构的人相互认识，还有更多的人不知道。到了1956-1966年，ARPA开始支持国内大多数非工业系统的研究，因此鲍勃·泰勒和他的同事们对计算机研究状况的了解比任何个人研究人员都更新、更全面。\n泰勒资助的人随后承担了规划和创建一个计算机网络的工作，该网络位于全国不同地区，通过公共运营商通信线路连接起来，能够共享资源，并与日益增长的计算机研究人员社区进行远程互动。构建并最终使用该系统的人员开始面对面地讨论以他们预想的方式链接资源所需的技术。分时研究的一小群领导不是单独工作，而是开始协同工作，设计第一个在线的互动社区。\n一个真正的互操作社区能够跨越各个机器或地理位置的边界自由共享资源，这比通过电话线将计算机连接在一起的简化一般想法所建议的要困难得多。必须解决非常严重的硬件和软件问题，人们与机器见面的用户界面必须进一步人性化。\n从1966年开始，按照利克利德和萨瑟兰建立的传统，泰勒每年都会召集他所有项目的所有主要调查人员开会。它将在一个戏剧性的地方举行，远离剑桥、伯克利或帕洛阿尔托等通常的地点。泰勒既不是工程师，也不是程序员(事实上，他是哲学专业的，也是训练有素的实验心理学家)，通过所有这些会议，泰勒开始了至关重要的思想混合和筛选，他知道这对于一个如此庞大、分散和雄心勃勃的项目的凝聚力是必要的。\n泰勒回忆道：我安排了这些会议，所以严格来说，他们都必须在我在场的情况下相互了解并相互争论。我会问一些问题，迫使人们在技术问题上表明立场。持久的友谊是在互惠互利的基础上建立起来的。我问了他们一些很难回答的问题。然后，在他们回到实验室和校园后，他们的交流在质量和数量上都有所增加，因为他们相互认识。\n泰勒还发起了研究生年会。以前的ARPA研究人员的最好的研究生都有他们自己的会议，而不是像泰勒这样的年长的人，毕竟他已经35多岁了。就像策划欧洲哥特式大教堂的一群巡回建造者一样，许多参加了ARPA研究生会议的计算机系统建造者稍后将在SAIL(斯坦福人工智能实验室)和帕洛阿尔托研究所(PARC)再次会面，后来仍将在苹果(Apple)和微软(Microsoft)会面。\n泰勒通过连接研究人员的计算机来连接他们的想法是受到了他在Licklider 1966年的一篇论文中读到的一句话的启发，在这句话中，他提出了一个非常大规模的分时系统的想法，他称之为星际网络。泰勒更进一步：如果你可以建立一个通信网络，为什么不能建立一个计算机网络呢？\n泰勒没有在终端和他们的分时系统之间建立更多的更远距离的通信线路，而是看到了创造技术让不同的分时系统进行长距离通信的潜在更大的好处。泰勒向ARPA兜售了他的想法，然后聘请了一位年轻的林肯实验室研究员拉里·罗伯茨(Larry Roberts)担任项目经理。会议和单独的研究项目持续了三年，直到1969年第一批BITS通过ARPA网发送。到了这个时候，泰勒反对越南战争的声音越来越大，他相当确定他发起的项目即将完成，所以他离开了ARPA。\n当数字处理器、批处理程序和电子簿记员继续在计算机行业占据主导地位时，交互计算社区的核心成员开始通过这种独特的互联计算机社区的新原型来试验他们的计算机-并与他们自己进行试验。很快发现，实验网络正在演变成一个交流和共享研究信息的刺激环境，甚至是传输和借用计算机程序的环境，这让所有参与者都很高兴，也没有人感到惊讶。\n世博会开始对人类交流产生的影响。\n..", "note_en": "In 1983, it was not unusual to see an executive, especially a manager in a computer research organization, using a personal computer in his office. The unique thing about  this personal computer was that it was an  Alto — the  first personal computer. Taylor and his group had been using it since 1974. A small cable connected the Alto to the  Ethernet — a medium that linked the researchers at PARC with each other and with colleagues around the world.  The screen was taller than most computer displays, and it looked different from other computer screens, even when seen from across the room.  Instead of a single screen-sized frame filled with numbers or letters or graphs, there were a number of squares of various sized, known in Xerox parlance as  windows, that looked like overlapping pieces of paper on a desk. The symbols and images were also distinctly sharper than what I was accustomed to seeing on a computer screen.\n  The mouse, an update of Engelbart&#39;s innovation, was connected to the Alto with a thin wire. As Taylor slid the mouse around the desk surface next to the screen, a small dark pointer shaped like an arrow moved around the screen. When he clicked one of the buttons on top of the mouse or moved the pointer into a margin, the pointer changed shape and things happened on the screen. In 1984, Apple corporation&#39;s Macintosh computer introduced a mass market to this way of handling an electronic desktop. To Taylor, it wasn&#39;t particularly futuristic. Altos and Ethernets had been in operation since 1974 around here.\n  By 1983, Bob Taylor was only half-satisfied with his progress toward what he and a few others set out to achieve twenty years ago, because he believed that the new technology was only halfway built. Despite the fact that the office he was sitting in, the electronic workstation at his fingertips, and the research organization around him were functioning examples of what the augmentation community dreamed about decades ago,  Taylor thought that it might take another ten or twenty years of hard work before  the interactive informational communities foretold by Bush and Licklider would truly affect the wider population.\n  In 1965, at the age of thirty-three, Robert Taylor worked out of his office in the Pentagon, as deputy director, then as director, of the ARPA Information Processing Techniques Office. His job was to find and fund research projects involving time-sharing, artificial intelligence, programming languages, graphic displays, operating systems, and other crucial areas of computer science. &#34;Our rule of thumb,&#34; he remembers, &#34;was to fund people who had a good chance of advancing the state of information processing by an order of magnitude.&#34;\n  Bob Taylor was also responsible for initiating the creation of the ARPAnet — the prototype network community of computers (and minds) created by the Department of Defense, an effort that began in 1966 and became an informal rite of passage for the nucleus of people who are still advancing the state of the computing art. Larry Roberts, who was responsible for getting the network up and running, succeeded Taylor when Taylor left ARPA in 1969. After a year at the University of Utah, Taylor joined the research effort Xerox Corporation was assembling near Stanford.\n  In 1970, a combination of growing opposition to the Vietnam war, and the militarization of all ARPA research, meant that an extraordinary collection of talent in the new fields of computer networks and interactive computing were looking for greener pastures at a time when one corporation decided to provide the greenest pastures imaginable.\n  In 1969, Peter McColough, CEO of Xerox Corporation, announced his intention to make Xerox &#34;the architect of information&#34; for the future. To that end, a research organization was assembled in Palo Alto, in the early 1970s. McColough put a man named George Pake in charge. One of the first things Pake did was hire the best long-term computer visionary, research organizer, and people-collector he could find — Bob Taylor. At first, the newly recruited engineers, hackers, and visionaries worked in temporary quarters located in the Palo Alto flatlands, near the Stanford University campus. In the mid 1970s construction began on a prime piece of ground above Hewlett-Packard, next to Syntex, in that fertile enclave known as &#34;The Stanford Industrial Park.&#34;\n  If there was ever a model environment for the technological cutting edge of the &#34;knowledge sector,&#34; PARC was it. From the physicists in the laser laboratories and the engineer-artisans in the custom microchip shops to the computer language designers, artificial intelligence programmers, cognitive physiologists, video jockeys, sound engineers, machinists, librarians, secretaries, cooks, janitors, and security guards, you got a nice, model-utopian feeling from everybody you encountered.\n  The physical plant itself is an inescapable exercise in innovation. It took me a while to stop thinking of the place as being upside down. Since the terraced glass-and-concrete structure was built halfway embedded in Coyote Hill, Zuni Pueblo style, the main entrance is on the top floor. To get to the second floor from the ground floor, you go  down. The linked quadrangles of offices, laboratories, and meeting rooms wind around atriums and gardens. The cafeteria overlooks Palo Alto; you can take your tray out to the terrace and look down on the bay from the vantage of this twenty-first-century cliff dwelling.\n  Off the corridors that wind around the quadrangles are office cubicles, many with their doors open. Inside the open cubicles, various people talk on telephones or stare at their distinctively oblong Alto screens. Some cubicles have plants, posters,  bean-bag chairs (advertisement), stereos, bicycles. They all have bookshelves with rows of books and the bright blue and white binders used on the reports PARC publishes for the outside world. Many of the cubicle dwellers are young. A larger proportion of them than you might expect are women. It has always been a multinational-looking crowd.\n  I had no problem distinguishing Taylor from the assorted scientists, engineers, professors, hackers, longhairs, and boy and girl geniuses around him. The few differences in style were subtle but visible, nevertheless. While many of his colleagues opt for sandals, down jackets, techno-hippie ponytails, blue jeans, and rumpled cords with or without bicycle clips, Taylor is likely to be found in a pressed tweed jacket and unrumpled slacks. His blond hair is casual but neat. When he&#39;s trying to see if you are following his line of thought, he tilts his forehead in your direction and targets you with pale blue eyes over what would pass for granny glasses if his shirt were denim instead of oxford cotton. He smiles often, sometimes as a form of punctuation. A trace of Texas drifts into his voice at times.\n  It is Taylor&#39;s belief that the idea of personal computing was a direct outgrowth of what Licklider started in the early 1960s with time-sharing research.  Time-sharing, like the first high-level languages, was a watershed for computer science and for the augmentation approach. It also created a new subcommunity within the computation world, a community of interests that cut across the boundaries of military, scientific, academic, and business computing. It was a relatively small subculture within the larger community of computer scientists and computer systems builders. They were bonded by a common desire for a certain kind of computer they wanted for their own use, and by a decade of common experiences as a part of the ARPA research effort to build the kind of computers they were then using. Many of the time-sharing veterans who started out as undergraduate hackers at  project MAC or as ARPA-funded engineers in Berkeley and Santa Monica were to meet later, in the research sanctums of Bell, SRI, Rand, and (mostly) at PARC.\n  Time sharing was an early and effective application of the philosophy that the existing means of using computers should be tailored to the way people function, rather than forcing people who want to use them to conform to mechanical constraints. Without the development of multiaccess computing in the early sixties, the idea of personal computing would never have been more than a dream.\n  In the early 1960s, data processing was what one was expected to do with a computer, and one hardly ever did it directly. First, a program and its raw data had to be converted to a shoebox full of punched cards. The cards were delivered to a data processing center, where a system administrator decided how and when they were to be fed into the main computer. (These fellows were, and still are, a rich source of anecdotes in support of the &#34;programming priesthood&#34; mythology.) You came back an hour or a day or a week later and retrieved a thick printout and a hefty bill. The keypunch-submit-wait-retrieve ritual was called &#34;batch processing.&#34;\n  By 1966, groups in California and Massachusetts were well on the way toward raising the art of computer programming to a high enough level to do some truly interesting things with computers.  Licklider and a few others suspected that if they could make the power of computers more directly accessible to people writing and running programs, programmers might be able to construct new and better kinds of software at far greater speed than heretofore possible.\n  Among the capabilities that came with the increasingly sophisticated electronic hardware and software were powers to model, represent, and search through large collections of information. With sufficient speed and memory capacity, computers were gaining the power to assist the creative aspects of communication. But serious obstacles had to be overcome to bring that power out where people could use it.\n  It is hardly possible to interact dynamically with your program when you have to dump boxes of punchcards into readers, then decipher boxes of printout. Since a large part of the process of building a program is a matter of tracking down subtle errors in complex lists of instructions, the batch processing ritual put an effective limit on how much programmers could do, how fast they could do it, and the quality of the programs they could produce.\n  Batch processing created two problems: The computers could handle only one program (and one programmer) at a time, and programmers weren&#39;t able to interact directly with the computer while their programs were running. Time-sharing was made possible because of the enormous gap between the speed of computer operations and the rate of information transfer needed to communicate with a human. Even the fastest typist, for example, can enter only a single keystroke in the length of time it would take the computer to perform millions of operations. Time-sharing gives each of the 20, 50, or 100 or more people who are using the computer the illusion that he or she has the computer&#39;s exclusive &#34;attention&#34; at all times, when in reality the computer is switching from one user&#39;s task to another&#39;s every few millionths of a second.\n  When the first programmers gained interactive access to the computer, they also gained a new freedom to create ever more powerful programs and see the results more quickly than ever before. Programmers of the first multiaccess computers of the sixties were able to submit programs a piece at a time and receive responses a piece at a time, instead of trying to make the whole programming job work, for better or worse, in a single batch.  By eliminating the &#34;wait and see&#34; aspect of batch-processing, time-sharing made it possible for programmers to treat their craft as a performing art.\n  &#34;When I became director of the ARPA Information Processing Techniques Office, the time-sharing programs were already running,&#34; Taylor recalls, &#34;but they weren&#39;t complete, so the work continued while I was director. It was clear, though, that this was an important breakthrough in information processing technology, so I became involved in the technology transfer between the different experimental systems, and eventually to military and civilian computer applications.\n  &#34;We came up against some rigid attitudes when we talked to many people in the industry. IBM ignored the ARPA stuff at first. They simply didn&#39;t take it seriously. Then GE agreed to cooperate with MIT and Bell Laboratories to develop and market a large time-sharing system. IBM said, &#39;Whoops, something&#39;s happening here,&#39; and they went off with a crash project to retrofit one of their 360 systems to time-sharing. They took orders for a few and the system bombed. They couldn&#39;t make the software work because hadn&#39;t been down the same roads that the ARPA funded groups had been down years before.&#34;\n  Time-sharing research caused a kind of schism in the corporate research field. The first-generation priesthood seemed to be missing out on the inside action, for a change. Companies that paid attention to the time-sharing experience gained in the long run. It made Digital Equipment the &#34;second name&#34; in the industry. DEC paid attention to the ARPA-funded work and hired people when they got out of school, and profited from time-sharing.\n  The first thing Taylor went after, once the time-sharing project was on its way to completion, was a way of interconnecting the time-sharing communities. He had a privileged overview of the then-fragmented computer research world, since a good deal of his time was spent traveling to universities and think tanks, finding and funding researchers. Progress in the separate subfields of computer research was accelerating through the early 1960s. By 1966, the time was approaching when the pieces of the puzzle would be ready for assembly, and the separated teams would have to be in close communication.\n  &#34;Within each one of the time-sharing communities people were doing a variety of different kinds of computer research,&#34; says Taylor, &#34;so the overall project of making the time-sharing system itself work was much more global than any one of the individual research fields that were being explored by different members of the time-sharing community — AI research, computer hardware architecture, programming languages, graphics, and so forth.\n  &#34;We were surprised time and time again by applications of the time-sharing system that nobody planned but somebody invented anyway. The ability to have files and resources within a time-sharing system was one difficult problem to be solved. On the way to solving it, people discovered a new way of communicating with each other — something that was unexpected and became a unique medium in the research community.&#34; Fifteen years since computer jockeys started having fun with it, that medium has become the commercial version known as &#34;electronic mail.&#34;\n  Taylor saw the necessity of connecting to one another those isolated research communities that Licklider had seeded and Sutherland had nurtured. Many of the people in related fields but different institutions knew of each other, and many more did not. By 1956-1966, ARPA was supporting most of the nonindustrial systems research in the country, and thus Bob Taylor and his colleagues had a more up-to-date and comprehensive picture of the state of computer research than any individual researchers.\n  The people Taylor funded then undertook the planning and creation of a  network of computers, located in different parts of the country, linked by common-carrier communication lines, capable of sharing resources and interacting remotely with the growing community of computer researchers. The people who were to build and ultimately make use of the system began to get together in person to talk about the technology needed to link resources in the manner they envisioned. Instead of working in isolation, a small group of leaders from the time-sharing research effort began to work in concert to design the first on-line, interactive communities.\n  A truly interoperating community capable of freely sharing resources across the boundaries of individual machines or geographical locations was more difficult to bring into existence than is suggested by the simplified general idea of plugging computers together via telephone lines. Very serious hardware and software problems had to be solved, and the &#34;user interface&#34; where the person meets the machine had to be further humanized.\n  Every year, starting in 1966, following a tradition established by Licklider and Sutherland, Taylor called a meeting of all the principal investigators of all his projects. It would be held in a dramatic place far removed from the usual locales of Cambridge, Berkeley, or Palo Alto. With all these meetings,  Taylor, who was neither an engineer nor a programmer (he was, in fact, a philosophy major and an experimental psychologist by training), began the all-important mixing and sifting of ideas he knew would be necessary to the cohesion of such a large, dispersed, and ambitious project.\n  &#34;I constructed the meetings so they all had to get to know one another and argue with one another technically in my presence,&#34; Taylor recalls. &#34;I would ask questions that would force people to take sides on technical issues. Lasting friendships were built from the give and take. I asked them difficult questions. Then, after they went back to their laboratories and campuses, their communications increased in both quality and quantity, because they knew each other.&#34;\n  Taylor also initiated annual conferences of graduate students. The best graduate students of the old ARPA researchers had meetings of their own, away from the &#34;older&#34; folks like Taylor, who was, after all, in his midthirties. Like the bands of roving builders who planned the Gothic cathedrals of Europe, many of the computer-system builders who participated in the ARPA grad students&#39; meetings were to meet again later at SAIL (Stanford Artificial Intelligence Laboratory) and PARC, and later still at Apple and Microsoft.\n  Taylor&#39;s idea of connecting the researchers by connecting their computers was inspired by a phrase he read in one of Licklider&#39;s 1966 papers, in which he proposed the idea of a very large-scale time-sharing system that he called &#34;an intergalactic network.&#34; Taylor took it a step farther: If you could build a communication network, why not a computer network?\n  Instead of building larger numbers of longer-range communication lines between terminals and their time-sharing systems, Taylor saw potentially greater benefits in creating technology for different time-sharing systems to communicate with each other over long distances. Taylor sold ARPA on he idea, then hired a young Lincoln Lab researcher named Larry Roberts as project manager. The meetings and separate research projects continued for three years, before the first bits were sent over the ARPAnet in 1969. By this time, Taylor&#39;s opposition to the Vietnam war was growing, and he was reasonably certain that the project he had initiated was nearing completion, so he left ARPA.\n  While the number crunchers, batch processors, and electronic bookkeepers continued to hold sway over the computer industry, the core members of the interactive computing community were beginning to experiment with their computers-and with themselves — through this unique new prototype of an interconnected computer community.  It quickly turned out, to the delight of all participants and to nobody&#39;s surprise, that the experimental network was evolving into a stimulating environment for communicating and sharing research information and even for transporting and borrowing computer programs.\n  The implications for human communication that were beginning to emerge from the expe\n......", "posttime": "2020-06-12 03:51:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "来自,boys,计算机", "title": "来自ARPAnet的新老男孩", "title_en": "The New Old Boys from the ARPAnet", "transed": 1, "url": "http://www.rheingold.com/texts/tft/10.html", "via": "", "real_tags": ["来自", "boys", "计算机"]}, {"category": "", "categoryclass": "", "imagename": "fb26bc43b2e2c86d4e50f245ec2293e8.png", "infoid": 1006189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在过去的十年里，最高法院稳步削弱了受仲裁协议约束的各方联合起诉的能力。1×1。参见史诗系统。“公司诉刘易斯”案，载于“联邦判例汇编”第138卷。1612,1632(2018)(尽管有国家劳动关系法，但认为放弃集体行动程序的仲裁协议是可以执行的)；DIRECTV，Inc.。V.Imburgia，136S.Ct.。463、470-71(2015)(认为“联邦仲裁法”抢先于一项无效的州法律)；“AT&amp；T Mobility LLC诉Concepcion”案，载于“美国最高法院判例汇编”第563卷，第333,352页(2011)(认为“联邦仲裁法”先发制人一项州规则，允许消费者合同的任何一方在邮后要求全类仲裁)。鉴于雇佣合同中仲裁条款的增加，这一趋势已经伤害了2×2的工人。参见Jessica Silver-Greenberg&amp；罗伯特·吉贝洛夫，“无处不在的仲裁，堆砌正义的甲板”，2015年10月31日出版，https://nyti.ms/1KMvBJg[https://perma.cc/25XD-LXDN]](“美国运通等公司通过在数量激增的消费者和雇佣合同中加入单独的仲裁条款，想出了一种绕过法庭、禁止人们联合提起集体诉讼的方法，实际上，这是公民对抗非法或欺诈性商业行为的唯一工具。”)，美国运通(American Express)等公司想出了一种方法，绕过法院，禁止人们联合起来提起集体诉讼，实际上，这是公民打击非法或欺诈性商业行为的唯一工具。：因为工人个人起诉，比方说，一天十五分钟的无薪加班，3×3在经济上是不可行的。由于个人索赔的经济价值很小，这种性质的诉讼倾向于以集体或集体诉讼的形式进行。例如，参见Austin诉Amazon.com，Inc.，No.。C09-1679,2010WL 1875811，at*1(W.D.洗涤。2010年5月10日)(驳回亚马逊提出的罢工集体行动的动议，指控亚马逊未能支付工人所有工作时间的加班费)；另见Julius Getman&Amp；Dan Getman，“赢得FLSA之战：企业如何使用仲裁条款避开法官、陪审团、原告和法律”，第86 447,453页(2012)。违反保护劳动者的法律--如“公平劳动标准法”4×4.29“美国法典”第201-219条(2018年)。(FLSA)-已经变得更难补救。5×5。参见&amp；(2015)。最近，在“别格诉Facebook，Inc.”案，载于“联邦判例汇编”第3集，第6×6.947页，第1043页(第七巡回法庭)。2020)。第七巡回法院认为，集体诉讼原告不能使用FLSA通知程序向被告证明签署了仲裁条款的员工提供诉讼通知，这再次打击了工人强制执行权利的能力。在这样做的过程中，法院假设了一个有利于被告的基线，这与FLSA的补救和执法目标不一致。\n苏西·别格(Susie Bigger)是位于伊利诺伊州芝加哥的Facebook的客户解决方案经理(CSM)。7×7.参见Bigger诉Facebook，Inc.，第375 F.Supp.。3D 1007,1012(北伊利诺伊州。2019年)。尽管别格平均每周工作60小时，8×8.ID。Facebook拒绝支付她的加班费，因为它根据FLSA和伊利诺伊州最低工资法9×9.820 105(West 2018)将像她这样的某些CSMS归类为“免加班”员工。(IMWL)。10×10。更大，375华氏度。三维方向1012。别格在美国伊利诺伊州北区地区法院对Facebook提起诉讼。她提出了两项索赔：(1)根据FLSA提出的违反加班规定的推定集体诉讼，以及(2)根据“联邦民事诉讼规则”第23条提出的违反IMWL的推定集体诉讼。11×11，ID.。地区法院和上诉法院的意见都主要涉及别格的集体行动。\n正如地区法院强调的那样，集体诉讼和集体诉讼虽然在精神上相似，但在分析上是不同的：集体诉讼要求集体成员选择退出，以避免受到诉讼程序的约束，而集体诉讼要求原告选择加入案件。12×12。参见id。在1021。集体诉讼“不作为传统的第23条集体诉讼继续进行”，13×13同上；另见Scott A.Moss&Amp；Nantiya Ruan，“第二类集体诉讼：法院如何通过误用集体诉讼规则阻挠工资权利”，61 523、530-39(2012)(概述差异)。因此，地区法院使用被广泛采用的14×14来评估别格的集体诉讼请求。见第7节，第23：37节(第5版。2019年)。法院创建的两步程序。15×15。更大，375华氏度。三维方向1021。首先，在“有条件的证明”阶段，“原告必须提供‘适度的事实证明’，表明她和处境相似的员工是违反FLSA的共同政策的受害者。”(引用Pfefferkorn诉PrimeSource Health Grp.，LLC，No.17-CV-12232019年WL 354968，at*2(N.D.IL.。2019年1月29日))。在第二阶段，法院“对原告提出了更严格的要求”，以确定他们是否处于类似的境地。17×17.同上；另见7，前注14，第23：39节。\n别格的案子牵涉到\n法院的结论是，集体行动的“效率”目标“既不有利于也不不利”其框架。41×41。身份证。在1050。虽然向一大群人发送通知并在随后的过程中淘汰潜在原告可能是有效的，但法院解释说，在发出通知之前执行淘汰程序也可能是有效的，特别是如果当事人已经证明某些通知接受者将无法加入诉讼。42×42。身份证。\n由于其效率分析没有定论，第七巡回法院的测试根植于地区法院“保持中立和保护集体行动装置不被滥用的义务”。身份证。允许向有仲裁协议的员工发出通知，而不是“通知员工他们可以解决共同问题的行动”，主要是为了“增加和解压力”。身份证。同样，法院解释说，向受仲裁约束的员工发送通知将有很高的风险，这将“将司法拇指放在原告一方。”45×45。身份证。法院将此案发回地区法院，以适用这一新框架。46×46。身份证。1051号。\n与别格一起，第七巡回法院创建了一个对被告友好的制度，在三个方面削弱了FLSA的执法目标。首先，它通过限制地区法院收集信息的能力，并将FLSA集体诉讼中“类似情况”的部分分析从取消认证阶段转移到有条件的认证阶段，从而提高了以类似于规则23的集体诉讼的方式发出通知的门槛。其次，它对FLSA通知的目的采取了狭隘的看法，通过限制收到通知的具有潜在有效索赔的员工数量，帮助被告挫败非集体诉讼FLSA索赔。最后，它通过允许被告在受协议约束的员工不知情或不参与的情况下就有效仲裁协议的存在提起诉讼，从而巩固了被告的有利诉讼地位。\n首先，第七巡回法庭的举行使集体诉讼的有条件证明阶段更类似于第23条集体诉讼，使被告受益。它提出的“和解压力”论据来自规则23的上下文，即47×47。这一论据证明了在等级认证过程中加强司法把关是合理的，例如，参见Re Rhone-Poulenc罗勒公司[“联邦判例汇编”第3集第51卷第1293页，第1299页(第七巡回法庭)]一案。(见“美国最高法院判例汇编”第442卷，第330页，第344-45页(1979))，尽管这一论点没有逃脱司法批评，但也见“莱特诉索诺通公司”案[1979年“美国最高法院判例汇编”第442卷，第344-45页]。有关学术批评，请参阅尼古拉斯·阿尔门达雷斯，“定居点压力的虚假诱惑”，第50页271页，275-76页(2018年)。在那里，它因对被告无理友好而受到批评。48×48。参见，例如，Charles Silver，“我们害怕得要死”：Class Certification and Left，78 1357,1359-60(2003)(“即使接受集体诉讼会产生巨大的和解压力这一命题，人们也必须问问压力是否太大。为证明事实如此，勒索控罪的倡议者必须提供一个有关和解压力的标准，即可与集体诉讼中的压力作比较的标准。“)。将这种“和解压力”的理由引入集体行动的背景中，忽略了集体行动和集体行动之间的教义差异，从而加剧了辩论对被告的友好性质。传统上，FLSA集体行动过程中的有条件认证步骤涉及的司法把关明显少于规则23类认证，为49×49。例如见“奥布莱恩诉埃德·唐纳利·恩特斯公司”[“联邦判例汇编”第3集第575卷第567、584-86页(第六巡回法庭)]一案。2009年)(持有规则23对集体行动证明的分析是不适当的)；另见第7条，前注14，第223：38节(“[T]他谦虚的事实表明，原告必须证明他们不符合规则23的类别证明要求。由于FLSA的行动不是根据规则23进行的，所以标准的等级认证要求是无关紧要的。“。(省略脚注))。部分原因是FLSA旷日持久的两步走过程。有条件认证步骤的目的是收集信息。50×50。例如参见“迈尔斯诉赫兹公司”案，载于“联邦判例汇编”第三辑，第624卷，第537,555页(第二巡回法庭)。2010年)(“第一阶段的目的仅仅是确定‘处境相似’的原告是否确实存在。”)。FLSA的第二步，即取消认证阶段，是法院实际决定集体诉讼原告是否处于类似境地的阶段。51×51。例如，参见Hipp诉Liberty NAT‘l Life Ins。参见“联邦判例汇编”第3集第252卷，第1208,1218页(第11巡回法庭)案。2001)(“在[吊销证书]阶段，法院有更多的信息可作为其裁决的依据，并根据类似情况的问题作出事实裁定”)；另见7，前注14，第2节。", "note_en": "Over the past decade, the Supreme Court has steadily weakened the ability of parties bound by arbitration agreements to band together and sue.  1 ×   1.  See Epic Sys. Corp. v. Lewis, 138 S. Ct. 1612, 1632 (2018) (holding that arbitration agreements waiving collective action procedures are enforceable notwithstanding the National Labor Relations Act); DIRECTV, Inc. v. Imburgia, 136 S. Ct. 463, 470–71 (2015) (holding that the Federal Arbitration Act preempts an invalid state law); AT&amp;T Mobility LLC v. Concepcion, 563 U.S. 333, 352 (2011) (holding that the Federal Arbitration Act preempts a state rule allowing any party to a consumer contract to demand classwide arbitration ex post). Given the rise of arbitration clauses in employment contracts, this trend has harmed workers  2 ×   2.  See Jessica Silver-Greenberg &amp; Robert Gebeloff,  Arbitration Everywhere, Stacking the Deck of Justice,   (Oct. 31, 2015),  https://nyti.ms/1KMvBJg [ https://perma.cc/25XD-LXDN] (“By inserting individual arbitration clauses into a soaring number of consumer and employment contracts, companies like American Express devised a way to circumvent the courts and bar people from joining together in class-action lawsuits, realistically the only tool citizens have to fight illegal or deceitful business practices.”). : since it is rarely economically feasible for workers to individually sue for, say, fifteen minutes of unpaid overtime a day,  3 ×   3. Because of the small economic value of individual claims, suits of this nature tend to proceed as class or collective actions.  See, e.g., Austin v. Amazon.com, Inc., No. C09-1679, 2010 WL 1875811, at *1 (W.D. Wash. May 10, 2010) (denying Amazon’s motion to strike collective action allegations that it failed to pay workers overtime wages for all hours they worked);  see also  Julius Getman &amp; Dan Getman,  Winning the FLSA Battle: How Corporations Use Arbitration Clauses to Avoid Judges, Juries, Plaintiffs, and Laws, 86   447, 453 (2012). violations of statutes protecting laborers — like the Fair Labor Standards Act  4 ×   4. 29 U.S.C. §§ 201–219 (2018). (FLSA) — have become harder to redress.  5 ×   5.  See   &amp;  (2015). Recently, in  Bigger v. Facebook, Inc.,  6 ×   6. 947 F.3d 1043 (7th Cir. 2020). the Seventh Circuit dealt another blow to workers’ ability to enforce their rights by holding that collective action plaintiffs cannot use the FLSA notice process to provide notice of their suit to employees who the defendant has proven have signed arbitration clauses. In doing so, the court assumed a defendant-friendly baseline that is inconsistent with the remedial and enforcement goals of the FLSA.\n  Susie Bigger was a Client Solution Manager (CSM) at Facebook in Chicago, Illinois.  7 ×   7.  See Bigger v. Facebook, Inc., 375 F. Supp. 3d 1007, 1012 (N.D. Ill. 2019). Although Bigger worked an average of sixty hours a week,  8 ×   8.  Id. Facebook refused to pay her overtime because it classified certain CSMs like her as “overtime-exempt” employees under both the FLSA and the Illinois Minimum Wage Law  9 ×   9. 820   105 (West 2018). (IMWL).  10 ×   10.  Bigger, 375 F. Supp. 3d at 1012. Bigger filed suit against Facebook in the United States District Court for the Northern District of Illinois. She brought two claims: (1) a putative  collective action under the FLSA for violating its overtime provisions, and (2) a putative  class action under Rule 23 of the Federal Rules of Civil Procedure for violating the IMWL.  11 ×   11.  Id. Both the district court and appellate court opinions primarily dealt with Bigger’s collective action.\n  As the district court emphasized, class actions and collective actions, though similar in spirit, are analytically distinct: class actions require class members to  opt out to avoid being bound by a proceeding, while collective actions require plaintiffs to  opt in to the case.  12 ×   12.  See  id. at 1021. Collective actions “do not proceed as traditional Rule 23 class actions.”  13 ×   13.  Id.;  see also Scott A. Moss &amp; Nantiya Ruan,  The Second-Class Class Action: How Courts Thwart Wage Rights by Misapplying Class Action Rules, 61   523, 530–39 (2012) (overviewing the differences). Thus, the district court evaluated Bigger’s collective action claim using a widely adopted,  14 ×   14.  See 7  ,   § 23:37 (5th ed. 2019). court-created two-step process.  15 ×   15.  Bigger, 375 F. Supp. 3d at 1021. First, in the “conditional certification” stage, the “plaintiff must make a ‘modest factual showing’ that she and similarly situated employees were ‘victims of a common policy’ that violated the FLSA.”  16 ×   16.  Id. (quoting Pfefferkorn v. PrimeSource Health Grp., LLC, No. 17-CV-1223, 2019 WL 354968, at *2 (N.D. Ill. Jan. 29, 2019)). In the second stage, the court “imposes more demanding requirements on plaintiffs” to determine whether they are similarly situated.  17 ×   17.  Id.;  see also 7  ,  supra note 14, § 23:39.\n  Bigger’s case involved the first, “conditional certification” step. She sought conditional certification of a broad collective including “[a]ll individuals . . . employed by Facebook as Client Solutions Managers . . . in the United States during the period from three years prior to the entry of the conditional certification order.”  18 ×   18.  Bigger, 375 F. Supp. 3d at 1021. Facebook opposed this definition, claiming that it should be “narrowed to exclude all individuals who had arbitration clauses and class action waivers in their employment contracts.”  19 ×   19.  Id. Simultaneously, Facebook moved for summary judgment on Bigger’s collective action, arguing that Bigger was exempt from the overtime provisions of FLSA either as a “highly compensated employee” or because she worked in a “bona fide administrative capacity.”  Id. at 1014. On the same grounds, Facebook also moved for summary judgment on Bigger’s IMWL claim.  Id. at 1020. By Facebook’s estimate, more than half of the CSMs in Bigger’s proposed collective were bound by arbitration agreements or class action waivers.  20 ×   20.  Id. at 1021–22. Because these CSMs were “barred from litigating the claims at issue in [Bigger’s] case,” it argued, “they [were] not ‘potential plaintiffs’” who should have been given notice.  21 ×   21.  Id. at 1022.\n  The district court agreed with Bigger. The court found that she had sufficiently  22 ×   22. The burden on the plaintiff is not particularly onerous, as she “needs only to clear a ‘low bar’ to meet her burden.”  Id. at 1021. shown “that she and similarly situated employees were victims of a common policy” violating the FLSA, and it conditionally certified her collective action.  23 ×   23.  Id. at 1024. The court also denied Facebook’s motion for summary judgment on the FLSA claim, explaining that there remained genuine issues of material fact as to whether Bigger was exempt from the FLSA.  Id. at 1019–20. Separately, the court noted that Facebook “did not address the relevant IMWL standards in its motion” and therefore denied summary judgment on that claim.  Id. at 1020. Explaining that “district courts are divided over whether notice of a collective action may be sent to employees with arbitration agreements” and that only one circuit had reached the issue,  24 ×   24.  Id. at 1022 (citing  In re JPMorgan Chase &amp; Co., 916 F.3d 494, 499 n.6 (5th Cir. 2019)). the district court held that notice to arbitration-bound employees was permissible for three reasons.  25 ×   25.  Id. First, it noted that Bigger herself was  not bound by an arbitration agreement; because the arbitration agreements Facebook sought to enforce were between Facebook and third parties not before the court, Facebook’s argument that these agreements were enforceable was premature.  26 ×   26.  Id. at 1022–23. Next, the court explained that because the enforceability of arbitration agreements is a merits determination not made at the conditional certification stage, blocking notice based on arbitration agreements would be inappropriate.  27 ×   27.  Id. at 1023. Finally, it highlighted that because the arbitration agreements’ enforceability is governed by state law — and because neither side had briefed the court on which state’s law would govern the contracts — the court had “insufficient information” to block notice at the conditional certification stage.  28 ×   28.  Id. If any opt-in plaintiffs did have valid arbitration agreements with Facebook, Facebook could “move to decertify the case or divide the class into subclasses” during the decertification stage of the collective action.  29 ×   29.  Id.\n  Facebook appealed.  30 ×   30.  See  Bigger, 947 F.3d at 1048. After the district court conditionally certified the collective action, Facebook sought and was granted an interlocutory appeal under 28 U.S.C. § 1292(b).  Id. Facebook did not appeal the denial of summary judgment on Bigger’s IMWL claim.  Id. at 1047 n.2. Writing for the unanimous panel, Judge Kanne  31 ×   31. Judge Kanne was joined by Chief Judge Wood and Judge Barrett. held that the district court abused its discretion by authorizing notice to arbitration-bound plaintiffs.  32 ×   32.  Bigger, 947 F.3d at 1051. His opinion laid out a new test for determining when notice is appropriate.  33 ×   33.  Id. at 1050–51. Because the novelty of this test meant that the district court “could not — and did not — apply the correct standard,” the Seventh Circuit vacated and remanded.  34 ×   34.  Id. at 1051. The Seventh Circuit also affirmed the district court’s denial of Facebook’s motion for summary judgment, agreeing that “factual issues remain concerning the extent to which [Bigger] engaged in exempt duties.”  Id. at 1052.\n  The Seventh Circuit’s new framework applies when a defendant asserts that “proposed notice recipients entered mutual arbitration agreements” with the defendant.  35 ×   35.  Id. at 1050. The Seventh Circuit’s framework is similar to the one adopted by the Fifth Circuit last year.  See  In re JPMorgan Chase &amp; Co., 916 F.3d 494, 503 (5th Cir. 2019). Under this framework, a court must first determine if the existence of a valid arbitration agreement is contested; if not, then notice to employees with arbitration agreements is improper.  36 ×   36.  Bigger, 947 F.3d at 1050. If any plaintiff does contest the existence of valid arbitration agreements, the court “must permit the parties to submit additional evidence on the agreements’ existence and validity,” and the burden is on the employer to show, by a preponderance of the evidence, that a valid arbitration agreement exists “for each employee it seeks to exclude from receiving notice.”  37 ×   37.  Id.\n  In arriving at its new test, the court first highlighted the “twin goals of collective actions”: enforcement of the FLSA and efficiency in case management.  38 ×   38.  Id. at 1049. But beyond these goals, it also explained that collective actions can present dangers: plaintiffs may seek settlement leverage by threatening a collective action, and broad notice may be “indistinguishable from the solicitation of claims.”  39 ×   39.  Id. To temper these concerns, trial courts serve as gatekeepers with “discretion to monitor the preparation and distribution of notice to ‘potential plaintiffs.’”  40 ×   40.  Id. (quoting Hoffmann-La Roche Inc. v. Sperling, 493 U.S. 165, 169 (1989)).\n  The court concluded that the “efficiency” goal of collective actions “neither favors nor disfavors” its framework.  41 ×   41.  Id. at 1050. While sending notice to a large group and culling potential plaintiffs later in the process may be efficient, the court explained that it may also be efficient to perform the culling process before notice is ever sent, particularly if a party has shown that certain notice recipients would be unable to join the action.  42 ×   42.  Id.\n  Because its efficiency analysis was inconclusive, the Seventh Circuit rooted its test in a district court’s “obligations to maintain neutrality and to shield against abuse of the collective-action device.”  43 ×   43.  Id. Instead of “inform[ing] employees of an action in which they can resolve common issues,” allowing notice to employees with arbitration agreements would serve mainly to “inflate settlement pressure.”  44 ×   44.  Id. Similarly, the court explained that there is a high risk that sending notice to arbitration-bound employees will “place a judicial thumb on the plaintiff’s side of the case.”  45 ×   45.  Id. The court remanded the case to the district court to apply this new framework.  46 ×   46.  Id. at 1051.\n  With  Bigger, the Seventh Circuit has created a defendant-friendly regime that undercuts the FLSA’s enforcement goals in three ways. First, it raises the bar to notice in a way that resembles Rule 23 class actions by limiting district courts’ ability to gather information and shifting part of the “similarly situated” analysis in FLSA collective actions from the decertification stage to the conditional certification stage. Next, it adopts a narrow view of the purpose of FLSA notice that helps defendants scuttle non–collective action FLSA claims by limiting the number of employees with potentially valid claims who receive notice. Finally, it entrenches defendants’ favorable litigation position by allowing them to litigate the existence of valid arbitration agreements without the knowledge or participation of employees subject to the agreements.\n  First, the Seventh Circuit’s holding makes the conditional certification stage of collective actions more similar to Rule 23 class actions in a way that benefits defendants. The “settlement pressure” argument it makes comes from the Rule 23 context,  47 ×   47. The argument has justified increased judicial gatekeeping in the class certification process,  see, e.g.,  In re Rhone-Poulenc Rorer Inc., 51 F.3d 1293, 1299 (7th Cir. 1995), though the argument has not escaped judicial critique,  see 2  ,  supra note 14, § 4:82 n.15 (collecting cases);  see also Reiter v. Sonotone Corp., 442 U.S. 330, 344–45 (1979). For an academic critique, see Nicholas Almendares,  The False Allure of Settlement Pressure, 50   271, 275–76 (2018). where it has faced criticism for being unjustifiably defendant-friendly.  48 ×   48.  See, e.g., Charles Silver, “ We’re Scared to Death”: Class Certification and Blackmail, 78   1357, 1359–60 (2003) (“Even accepting the proposition that class actions generate enormous pressure to settle, one must still ask whether the pressure is too great. To show that it is, proponents of the blackmail charge must offer a normative account of settlement pressure, that is, a standard to which pressure in class actions can be compared.”). Introducing this “settlement pressure” justification into the collective action context exacerbates the argument’s defendant-friendly nature by ignoring the doctrinal differences between class and collective actions. Traditionally, the conditional certification step in the FLSA’s collective action process has involved significantly less judicial gatekeeping than has Rule 23 class certification,  49 ×   49.  See, e.g., O’Brien v. Ed Donnelly Enters., Inc., 575 F.3d 567, 584–86 (6th Cir. 2009) (holding Rule 23 analysis of collective action certification was improper);  see also 7  ,  supra  note 14, § 23:38 (“[T]he modest factual showing that the plaintiffs must make is  not that they meet the class certification requirements of Rule 23. As FLSA actions do not proceed under Rule 23, the standard class certification requirements are irrelevant.” (footnote omitted)). in part because of the FLSA’s protracted two-step process. The purpose of the conditional certification step is to gather information.  50 ×   50.  See, e.g., Myers v. Hertz Corp., 624 F.3d 537, 555 (2d Cir. 2010) (“[T]he purpose of this first stage is merely to determine  whether ‘similarly situated’ plaintiffs do in fact exist.”). The FLSA’s second step, the decertification stage, is where courts actually decide whether collective action plaintiffs are similarly situated.  51 ×   51.  See, e.g., Hipp v. Liberty Nat’l Life Ins. Co., 252 F.3d 1208, 1218 (11th Cir. 2001) (“At [the decertification] stage, the court has much more information on which to base its decision, and makes a factual determination on the similarly situated question.”);  see also 7  ,  supra note 14, § 23:39. By applying the already defendant-friendly “settlement pressure” argument to push the “similarly situated” analysis to the FLSA’s conditional certification analysis, the Seventh Circuit elided the doctrinal differences between class and collective actions and began from a defendant-friendly starting point.\n  Next, by adopting a narrow view of the purpose of FLSA notice, the court’s decision is defendant-friendly and undermines the FLSA’s remedial purpose because it will likely reduce the number of valid FLSA claims employees pursue. Congress enacted the FLSA to prohibit “labor conditions detrimental to the maintenance of the minimum standard of living necessary for health, efficiency, and general well-being of workers,”  52 ×   52. 29 U.S.C. § 202(a) (2018);  see also Kasten v. Saint-Gobain Performance Plastics Corp., 563 U.S. 1, 11 (2011) (explaining that the FLSA “relies for enforcement of these standards . . . upon ‘information and complaints received from employees seeking to vindicate rights claimed to have been denied’” (quoting Mitchell v. Robert DeMario Jewelry, Inc., 361 U.S. 288, 292 (1960))). and the Act’s stated purpose is “to correct and as rapidly as practicable to eliminate” detrimental working conditions.  53 ×   53. 29 U.S.C. § 202(b) (2018). By analyzing the FLSA’s legislative history, multiple scholars have confirmed this purpose and urged an expansive interpretation of the FLSA to better protect workers.  54 ×   54.  See, e.g., Kati L. Griffith,  The Fair Labor Standards Act at 80: Everything Old Is New Again, 104   557, 569–80 (2019) (“[T]he legislative history overwhelmingly communicates that one of Congress’ purposes was for those interpreting the FLSA to have some leeway to adapt as businesses restructured in response to economic circumstances, or to evade liability under the Act.”  Id. at 572.); William C. Jhaveri-Weeks &amp; Austin Webbert,  Class Actions Under Rule 23 and Collective Actions Under the Fair Labor Standards Act: Preventing the Conflation of Two Distinct Tools to Enforce the Wage Laws, 23   &amp;  233, 254–56 &amp; n.139 (2016) (collecting sources on the FLSA’s remedial nature); Scott A. Moss &amp; Nantiya Ruan,  No Longer a Second-Class Class Action? Finding Common Ground in the Debate over Wage Collective Actions with Best Practices for Litigation and Adjudication, 11   27, 57 (2019) (citing legislative history supporting the broad remedial purpose of § 216(b)); James M. Fraser, Note,  Opt-In Class Actions Under the FLSA, EPA, and ADEA: What Does It Mean to Be “Similarly Situated”?, 38   95, 99 (2004) (“Congress enacted the FLSA in 1938 to eliminate substandard working conditions by regulating wages and hours.”). Although Congress later amended the FLSA by creating the “opt-in” collective action device,  see De Asencio v. Tyson Foods, Inc., 342 F.3d 301, 306 (3d Cir. 2003), this change was driven in part by 1940s political hostility toward Rule 23(b)(3)–style class actions (which weren’t statutorily sanctioned until 1966),  see Marc Linder,  Class Struggle at the Door: The Origins of the Portal-to-Portal Act of 1947, 39   53, 172–74 (1991). The change was meant to “strike a balance to maintain employees’ rights but curb the number of lawsuits.”  De Asencio, 342 F.3d at 306.\n  Collective action notice could serve a narrow or broad purpose. Under the narrow view adopted by the Seventh Circuit, it exists only to notify employees eligible to join the collective action of their ability to do so.  55 ×   55.  See  Bigger, 947 F.3d at 1050 (suggesting that the purpose of notice is to “inform employees of an action i\n......", "posttime": "2020-06-12 03:50:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,别格,bigger,法院", "title": "别格诉Facebook，Inc.", "title_en": "Bigger v. Facebook, Inc.", "transed": 1, "url": "https://harvardlawreview.org/2020/06/bigger-v-facebook/", "via": "", "real_tags": ["facebook", "别格", "bigger", "法院"]}, {"category": "", "categoryclass": "", "imagename": "178fca3c8f792af60069aea225c6a501.jpg", "infoid": 1006188, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "第一次，一艘宇宙飞船从如此遥远的地方传回了天空的照片，以至于一些恒星似乎处于与我们从地球上看到的不同的位置。", "note_en": "For the first time, a spacecraft has sent back pictures of the sky from so far away that some stars appear to be in different positions than we'd see from Earth.", "posttime": "2020-06-12 03:50:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "nasa,视差,horizons,传回", "title": "美国国家航空航天局“新地平线”进行首次星际视差实验", "title_en": "NASA’s New Horizons Conducts the First Interstellar Parallax Experiment", "transed": 1, "url": "https://www.nasa.gov/feature/nasa-s-new-horizons-conducts-the-first-interstellar-parallax-experiment", "via": "", "real_tags": ["nasa", "视差", "horizons", "传回"]}, {"category": "", "categoryclass": "", "imagename": "d3d6b09f8833ccfb372e4b00d0cf7238.jpg", "infoid": 1006186, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马里兰大学的地球物理学家分析了数以千计的地震波、声波在地球上传播的记录，以识别从地球熔融的核心和其上方的固体地幔之间的边界发出的回声。回波揭示了比之前所知的更广泛的、不均匀的结构-核幔边界上异常致密的热岩区域。科学家们不确定这些结构的组成，之前的研究只提供了有限的观点。更好地了解它们的形状和范围有助于揭示地球深处发生的地质过程。这些知识可能会为板块构造的运作和我们星球的演化提供线索。\n这项新的研究首次以如此详细的分辨率提供了大范围内核-地幔边界的全面视图。这项研究发表在2020年6月12日的“科学”杂志上。\n研究人员将重点放在太平洋盆地下方传播的地震波的回波上。他们的分析揭示了南太平洋马尔科萨斯火山群岛下以前不为人知的结构，并表明夏威夷群岛下的结构比之前所知的要大得多。\nUMD地质学系博士后研究员、这篇论文的主要作者多延·金(Doyeon Kim)表示：通过一次观察数千个核-地幔边界回声，而不是像往常那样一次只关注几个，我们获得了一个全新的视角，多延·金(Doyeon Kim)是这篇论文的主要作者，他是UMD地质系的博士后研究员。这向我们表明，核-地幔边界区域有很多能够产生这些回声的结构，这是我们以前没有意识到的，因为我们的视野很窄。\n地震在地球表面下产生的地震波传播数千英里。当波遇到岩石密度、温度或成分的变化时，它们会改变速度、弯曲或散射，产生可以检测到的回波。来自附近建筑物的回声到达得更快，而来自较大建筑物的回声则更响亮。通过测量这些回波到达不同位置的地震仪时的强度和幅度，科学家可以开发出隐藏在地表下的岩石物理特性的模型。这一过程类似于蝙蝠通过回声定位来绘制环境地图的方式。\n在这项研究中，金和他的同事们寻找一种特殊类型的波，称为横波，当它沿着核-地幔边界传播时产生的回声。在被称为地震图的单次地震记录中，来自衍射横波的回波可能很难与随机噪声区分开来。但是，同时查看许多地震的许多地震图可以揭示相似之处和识别隐藏在数据中的回波的模式。\n研究人员使用一种名为Sequencer的软件，分析了1990年至2018年太平洋盆地周围发生的数百次6.5级以上地震的7000张地震图。测序仪是由约翰·霍普金斯大学和特拉维夫大学的这项新研究的合著者开发的，目的是在遥远的恒星和星系的辐射中寻找模式。当应用于地震的地震图时，该算法发现了大量的横波回波。\n地球科学中的机器学习正在迅速发展，像Sequencer这样的方法使我们能够系统地探测地震回波，并对地幔底部的结构有新的见解，这些结构在很大程度上仍然是谜一样的，金说。\nUMD的地质学副教授、这项研究的合著者韦德兰·莱基奇(Vedran Lekic)说，我们在大约40%的地震波路径上发现了回声。这是令人惊讶的，因为我们预计它们会更加罕见，这意味着核幔边界的异常结构比之前想象的要广泛得多。\n科学家们发现，夏威夷下方核幔交界处的大片非常致密的热物质产生了独特的巨大回声，表明它甚至比之前估计的还要大。这种地块被称为超低速区(ULVZ)，发现于火山柱的根部，在那里热岩从该地区升起，形成火山岛。夏威夷下面的ULVZ是已知的最大的。\n莱基奇说：我们很惊讶地在马克萨斯群岛下面发现了一个我们以前都不知道存在的大地貌。这真的很令人兴奋，因为它展示了Sequencer算法如何帮助我们以一种我们以前无法做到的方式将全球的地震图数据关联起来。更多信息：测序地震图：核幔边界区域散射的全景图科学(2020)。.org/cgi/doi…。1126/Science.aba8972", "note_en": "University of Maryland geophysicists analyzed thousands of recordings of seismic waves, sound waves traveling through the Earth, to identify echoes from the boundary between Earth&#39;s molten core and the solid mantle layer above it. The echoes revealed more widespread, heterogenous structures—areas of unusually dense, hot rock—at the core-mantle boundary than previously known.    Scientists are unsure of the composition of these structures, and previous studies have provided only a limited view of them. Better understanding their shape and extent can help reveal the geologic processes happening deep inside Earth. This knowledge may provide clues to the workings of plate tectonics and the evolution of our planet.\n  The new research provides the first comprehensive view of the core-mantle boundary over a wide area with such detailed resolution. The study was published in the June 12, 2020, issue of the journal  Science.\n  The researchers focused on echoes of seismic waves traveling beneath the Pacific Ocean basin. Their analysis revealed a previously unknown structure beneath the volcanic Marquesas Islands in the South Pacific and showed that the structure beneath the Hawaiian Islands is much larger than previously known.\n  &#34;By looking at thousands of core-mantle boundary echoes at once, instead of focusing on a few at a time, as is usually done, we have gotten a totally new perspective,&#34; said Doyeon Kim, a postdoctoral fellow in the UMD Department of Geology and the lead author of the paper. &#34;This is showing us that the core-mantle boundary region has lots of structures that can produce these echoes, and that was something we didn&#39;t realize before because we only had a narrow view.&#34;\n   Earthquakes generate seismic waves below Earth&#39;s surface that travel thousands of miles. When the waves encounter changes in rock density, temperature or composition, they change speed, bend or scatter, producing echoes that can be detected. Echoes from nearby structures arrive more quickly, while those from larger structures are louder. By measuring the   and amplitude of these echoes as they arrive at seismometers in different locations, scientists can develop models of the physical properties of rock hidden below the surface. This process is similar to the way bats echolocate to map their environment.\n  For this study, Kim and his colleagues looked for echoes generated by a specific type of wave, called a shear wave, as it travels along the core-mantle boundary. In a recording from a single earthquake, known as a seismogram, echoes from diffracted shear waves can be hard to distinguish from random noise. But looking at many seismograms from many earthquakes at once can reveal similarities and patterns that identify the echoes hidden in the data.\n    Using a   called Sequencer, the researchers analyzed 7,000 seismograms from hundreds of earthquakes of 6.5 magnitude and greater occurring around the Pacific Ocean basin from 1990 to 2018. Sequencer was developed by the new study&#39;s co-authors from Johns Hopkins University and Tel Aviv University to find patterns in radiation from distant stars and galaxies. When applied to seismograms from earthquakes, the algorithm discovered a large number of shear wave echoes.\n  &#34;Machine learning in earth science is growing rapidly and a method like Sequencer allows us to be able to systematically detect seismic echoes and get new insights into the structures at the base of the mantle, which have remained largely enigmatic,&#34; Kim said.\n     &#34;We found echoes on about 40% of all seismic wave paths,&#34; said Vedran Lekic, an associate professor of geology at UMD and a co-author of the study. &#34;That was surprising because we were expecting them to be more rare, and what that means is the anomalous structures at the core-mantle boundary are much more widespread than previously thought.&#34;\n  The scientists found that the large patch of very dense, hot material at the core-mantle boundary beneath Hawaii produced uniquely loud echoes, indicating that it is even larger than previous estimates. Known as ultralow-velocity zones (ULVZs), such patches are found at the roots of volcanic plumes, where hot rock rises from the   region to produce volcanic islands. The ULVZ beneath Hawaii is the largest known.\n    &#34;We were surprised to find such a big feature beneath the Marquesas Islands that we didn&#39;t even know existed before,&#34; Lekic said. &#34;This is really exciting, because it shows how the Sequencer algorithm can help us to contextualize seismogram data across the globe in a way we couldn&#39;t before.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\t&#34;Sequencing seismograms: A panoptic view of scattering in the core-mantle boundary region&#34;  Science (2020).  science.sciencemag.org/cgi/doi … 1126/science.aba8972", "posttime": "2020-06-12 03:32:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,detect,地震", "title": "科学家在地核附近发现了意想不到的广泛结构", "title_en": "Scientists detect unexpected widespread structures near Earth's core", "transed": 1, "url": "https://phys.org/news/2020-06-scientists-unexpected-widespread-earth-core.html", "via": "", "real_tags": ["科学家", "detect", "地震"]}, {"category": "", "categoryclass": "", "imagename": "7646d8dc01aa2e6acd0b88b6fe21dd55.png", "infoid": 1006185, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正则表达式(通常称为RegExp)是JavaScript中用于操作字符串的强大工具。它们提供了丰富的语法来描述和捕获字符信息。它们的使用率也很高，所以对SpiderMonkey(Firefox中的JavaScript引擎)来说，很重要的一点就是对它们进行优化。\n多年来，我们有几种方法来实现RegExp。方便的是，RegExp引擎和SpiderMonkey的其余部分之间有一条相当清晰的分界线。更换RegExp引擎仍然不容易，但这可以在不对SpiderMonkey的其余部分造成太大影响的情况下完成。\n在2014年，我们利用这种灵活性将Yarr(我们之前的RegExp引擎)替换为Irregexp的分支副本，Irregexp是V8中使用的引擎。这就提出了一个棘手的问题：如何让为一个引擎设计的代码在另一个引擎内部工作？Irregexp使用许多V8API，包括字符串表示、对象模型和垃圾收集器等核心概念。\n当时，我们选择大量重写Irregexp以使用我们自己的内部API。这使得我们更容易使用，但从上游导入新更改要困难得多。RegExp的更改相对较少，因此这似乎是一个很好的权衡。起初，这对我们来说效果很好。当引入‘\\u’标志等新功能时，我们将它们添加到Irregexp。然而，随着时间的推移，我们开始落后了。ES2018添加了四个新的RegExp功能：dotAll标志、命名捕获组、Unicode属性转义和回溯断言。V8团队添加了对这些特性的Irregexp支持，但是Irregexp的SpiderMonkey副本已经有了足够的差异，使得应用相同的更改变得困难。\n我们开始重新考虑我们的方法。我们有没有办法在不增加持续维护负担的情况下支持现代RegExp功能？如果我们优先使RegExp引擎保持最新，它会是什么样子？我们离上游的Irregexp有多近？\n事实证明，答案确实非常接近。在撰写本文时，SpiderMonkey使用的是从V8存储库中导入的最新版本的Irregexp，除了机械重写#include语句外没有任何更改。除了运行更新脚本之外，刷新导入只需要很少的工作。我们正在积极向上游提供错误报告和补丁。\n我们是怎么走到这一步的？我们的方法是在SpiderMonkey和Irregexp之间构建填充层。这个填充程序为Irregexp提供了对它通常从V8获得的所有功能的访问：从内存分配到代码生成，再到各种实用函数和数据结构。\n这花了一些功夫。这很大程度上是一件简单明了的事情，就是把事情联系在一起。例如，Irregexp解析器和编译器使用V8的Zone(一种Arena风格的内存分配器)来有效地分配临时对象并丢弃它们。SpiderMonkey的等价物被称为Lifoalloc，但它有一个非常相似的界面。我们的填充程序能够通过将对Zone方法的调用直接转发到它们的Lifoalloc等效项来实现对这些方法的调用。\nIrregexp有两种执行RegExp的策略：字节码解释器和实时编译器。前者生成更密集的代码(使用更少的内存)，并且可以在无法生成本机代码的系统上使用。后者生成运行速度更快的代码，这对于重复执行的RegExp很重要。SpiderMonkey和V8都在第一次使用时解释RegExp，然后在以后编译它们。\n用于生成本机代码的工具是非常特定于引擎的。幸运的是，Irregexp有一个设计良好的代码生成API，称为RegExpMacroAssembler。在解析和优化RegExp之后，RegExpCompiler将对RegExpMacroAssembler进行一系列调用以生成代码。例如，要确定字符串中的下一个字符是否与特定字符匹配，编译器将调用CheckCharacter。要在反向引用不匹配时回溯，编译器将调用CheckNotBackReference。\n总体而言，大约有40个可用操作。这些操作加在一起可以表示任何JavaScript RegExp。宏汇编器负责将这些抽象操作转换成最终的可执行形式。V8包含不少于9个RegExpMacroAssembler的独立实现：它支持的8个体系结构中的每一个都有一个，最后一个实现为解释器生成字节码。SpiderMonkey可以重用字节码生成器和解释器，但我们需要自己的宏汇编程序。幸运的是，有几件事对我们有利。\n首先，SpiderMonkey的原生代码生成工具工作在比V8更高的级别，我们不需要为每个架构实现宏汇编器，我们只需要一个可以针对任何支持的机器的宏汇编程序。其次，使用SpiderMonkey的代码生成器实现RegExpMacroAssembler的大部分工作已经在我们第一次导入Irregexp时完成了。我们必须进行相当多的更改才能支持新功能(特别是回溯引用)，但现有代码给了我们一个很好的起点。\nJavaScript中的内存是自动管理的。当内存不足时，垃圾收集器(GC)遍历程序并清理所有不再使用的内存。如果您正在编写JavaScript，这将在幕后进行。但是，如果您正在实现JavaScript，这意味着您必须小心。当您正在处理可能被垃圾收集的东西时-比方说，您要与RegExp匹配的字符串-您需要通知GC。否则，如果您调用一个触发垃圾收集的函数，GC可能会将您的字符串移到其他地方(如果您是唯一剩余的引用，甚至完全删除它)。出于显而易见的原因，这是一件坏事。告诉GC您正在使用的对象的过程称为根。对于我们的填补实现来说，最有趣的挑战之一是SpiderMonkey和V8根之间的方式不同。\nSpiderMonkey在C++堆栈上创建它的根。例如，如果您想要将一个字符串作为根，您可以创建一个位于本地堆栈帧中的带根的&lt；JSString*&gt；。当您的函数返回时，根目录消失，GC可以自由地收集您的JSString。在V8中，您将创建一个句柄。在幕后，V8创建一个根并将其存储在并行堆栈中。V8中根的生存期由HandleScope对象控制，这些对象在创建根堆栈时标记根堆栈上的一个点，并在销毁根堆栈时清除每个比标记点更新的根。\n为了使填隙程序正常工作，我们实现了我们自己的V8的HandleScopes的微型版本。更复杂的是，某些类型的对象在V8中是垃圾收集的，但在SpiderMonkey中是常规的非GC对象。为了处理这些对象(不是双关语)，我们添加了一个并行的“PseudoHandle”堆栈，它们看起来像Irregexp的普通句柄，但由(非GC)唯一指针支持。\n如果没有V8团队的支持和建议，这一切都是不可能的。特别值得一提的是，雅各布·格鲁伯(Jakob Gruber)提供了特别的帮助。事实证明，这个项目很好地满足了V8团队的一个预先存在的愿望，即使Irregexp更加独立于V8。虽然我们试图使填隙尽可能完整，但在某些情况下，上游更改是最好的解决方案。其中许多变化都很小。有些更有趣。\n在V8和Irregexp之间的接口上的一些代码被证明太难在SpiderMonkey中使用。例如，要执行编译的RegExp，Irregexp调用NativeRegExpMacroAssembler：：Match。该函数与V8的字符串表示紧密相关。这两个引擎中的字符串实现惊人地接近，但还没有接近到我们可以共享代码的程度。我们的解决方案是将该代码完全移出Irregexp，并将其他无法使用的代码隐藏在特定于嵌入器的#ifdef后面。从技术角度来看，这些更改并不特别有趣，但是从软件工程的角度来看，它们让我们更清楚地了解在未来的项目中可能会在哪里划定API边界，以将Irregexp与V8分开。\n当我们的原型实现接近完成时，我们意识到SpiderMonkey测试套件中剩余的失败之一在V8中也失败了。经过调查，我们发现Irregexp和JavaScript规范在不区分大小写、非Unicode RegExp方面存在细微的不匹配。我们在上游提供了一个补丁，用来重写Irregexp对具有非标准大小写折叠行为的字符的处理(如‘«’，拉丁文小写字母Sharp S，在大写时给出“SS”)。\n我们帮助改进Irregexp的机会并没有止步于此。在我们将Irregexp的新版本登陆Firefox Nighly后不久，我们勇敢的模糊团队发现了一个令人费解的RegExp，它在SpiderMonkey和V8的调试版本中都崩溃了。幸运的是，经过进一步调查，这是一个过于严格的断言。然而，它确实激发了RegExp解释器中一些额外的代码质量改进。\n除了JetStream2基准测试中一些改进的子分数之外，我们从所有这些工作中获得了什么？\n最重要的是，我们获得了对所有RegExp新功能的全面支持。Unicode属性转义和回溯引用只会影响RegExp匹配，因此填充程序一完成它们就会起作用。支持dotAll标志只需要少量的额外工作。命名捕获涉及到来自SpiderMonkey其余部分的稍微多一点的支持，但在启用新引擎几周后，命名捕获也落地了。(在测试它们时，我们在等价的V8代码中发现了最后一个错误。)。这使得Firefox完全符合JavaScript的最新ECMAScript标准。\n我们也为未来的RegExp支持奠定了更坚实的基础。在Irregexp上进行更多的协作是互惠互利的。SpiderMonkey可以更快地添加新的RegExp语法。V8获得了一组额外的眼睛和手来查找和修复bug。假设Irregexp的未来嵌入器有一个经过验证的起点。\n新引擎在Firefox78中可用，它目前在我们的开发人员版浏览器版本中。希望这项工作将在未来几年成为Firefox中RegExp的基础。", "note_en": "Regular expressions – commonly known as RegExps – are a powerful tool in JavaScript for manipulating strings. They provide  a rich syntax to describe and capture character information. They’re also heavily used, so it’s important for SpiderMonkey (the JavaScript engine in Firefox) to optimize them well.\n Over the years, we’ve had several approaches to RegExps. Conveniently, there’s a fairly clear dividing line between the RegExp engine and the rest of SpiderMonkey. It’s still not  easy to replace the RegExp engine, but it can be done without too much impact on the rest of SpiderMonkey.\n In 2014,  we took advantage of this flexibility to replace YARR (our previous RegExp engine) with a forked copy of  Irregexp, the engine used in V8. This raised a tricky question: how do you make code designed for one engine work inside another? Irregexp uses a number of V8 APIs, including core concepts like  the representation of strings,  the object model, and  the garbage collector.\n At the time, we chose to heavily rewrite Irregexp to use our own internal APIs. This made it easier for us to work with, but much harder to import new changes from upstream. RegExps were changing relatively infrequently, so this seemed like a good trade-off. At first, it worked out well for us. When new features like the ‘\\u’ flag were introduced,  we added them to Irregexp. Over time, though, we began to fall behind. ES2018 added four new RegExp features:  the dotAll flag,  named capture groups,  Unicode property escapes, and  look-behind assertions. The V8 team added Irregexp support for those features, but the SpiderMonkey copy of Irregexp had diverged enough to make it difficult to apply the same changes.\n We began to rethink our approach. Was there a way for us to support modern RegExp features, with less of an ongoing maintenance burden? What would our RegExp engine look like if we prioritized keeping it up to date? How close could we stay to upstream Irregexp?\n  The answer, it turns out, is very close indeed. As of the writing of this post, SpiderMonkey is using the very latest version of Irregexp, imported from the V8 repository, with no changes other than mechanically rewritten  #include statements. Refreshing the import requires minimal work beyond running an update script. We are actively contributing bug reports and patches upstream.\n How did we get to this point? Our approach was to build a  shim layer between SpiderMonkey and Irregexp. This shim provides Irregexp with access to all the functionality that it normally gets from V8: everything from memory allocation, to code generation, to a variety of utility functions and data structures.\n  This took some work. A lot of it was a straightforward matter of hooking things together. For example, the Irregexp parser and compiler use V8’s  Zone, an  arena-style memory allocator, to allocate temporary objects and discard them efficiently. SpiderMonkey’s equivalent is called a  LifoAlloc, but it has a very similar interface. Our shim was able to implement calls to  Zone methods by forwarding them directly to their  LifoAlloc equivalents.\n   Irregexp has two strategies for executing RegExps: a  bytecode interpreter, and a  just-in-time compiler. The former generates denser code (using less memory), and can be used on systems where native code generation is not available. The latter generates code that runs faster, which is important for RegExps that are executed repeatedly. Both SpiderMonkey and V8 interpret RegExps on first use, then tier up to compiling them later.\n Tools for generating native code are very engine-specific. Fortunately, Irregexp has a well-designed API for code generation, called  RegExpMacroAssembler. After parsing and optimizing the RegExp, the  RegExpCompiler will make a series of calls to a  RegExpMacroAssembler to generate code. For example, to determine whether the next character in the string matches a particular character, the compiler will call  CheckCharacter. To backtrack if a back-reference fails to match, the compiler will call  CheckNotBackReference.\n Overall, there are roughly 40 available operations. Together, these operations can represent any JavaScript RegExp. The macro-assembler is responsible for converting these abstract operations into a final executable form. V8 contains no less than nine separate implementations of  RegExpMacroAssembler: one for each of the eight architectures it supports, and a final implementation that generates bytecode for the interpreter. SpiderMonkey can reuse the bytecode generator and the interpreter, but we needed our own macro-assembler. Fortunately, a couple of things were working in our favour.\n First, SpiderMonkey’s native code generation tools work at a higher level than V8’s. Instead of having to implement a macro-assembler for each architecture, we only needed one, which could target any supported machine. Second, much of the work to implement  RegExpMacroAssembler using SpiderMonkey’s code generator had already been done for our first import of Irregexp. We had to make quite a few changes to support new features (especially look-behind references), but the existing code gave us an excellent starting point.\n  Memory in JavaScript is  automatically managed. When memory runs short, the garbage collector (GC) walks through the program and cleans up any memory that is no longer in use. If you’re writing JavaScript, this happens behind the scenes. If you’re  implementing JavaScript, though, it means you have to be careful. When you’re working with something that might be garbage-collected – a string, say, that you’re matching against a RegExp – you need to inform the GC. Otherwise, if you call a function that triggers a garbage collection, the GC might move your string somewhere else (or even get rid of it entirely, if you were the only remaining reference). For obvious reasons, this is a bad thing. The process of telling the GC about the objects you’re using is called rooting. One of the most interesting challenges for our shim implementation was the difference between the way SpiderMonkey and V8 root things.\n SpiderMonkey creates its roots right on the C++ stack. For example, if you want to root a string, you create a  Rooted&lt;JSString*&gt; that lives in your local stack frame. When your function returns, the root disappears and the GC is free to collect your  JSString. In V8, you create a  Handle. Under the hood, V8 creates a root and stores it in a parallel stack. The lifetime of roots in V8 is controlled by  HandleScope objects, which mark a point on the root stack when they are created, and clear out every root newer than the marked point when they are destroyed.\n To make our shim work, we implemented our own miniature version of V8’s  HandleScopes. As an extra complication, some types of objects are garbage-collected in V8, but are regular non-GC objects in SpiderMonkey. To handle those objects (no pun intended), we added a parallel stack of “PseudoHandles”, which look like normal  Handles to Irregexp, but are backed by (non-GC) unique pointers.\n  None of this would have been possible without the support and advice of the V8 team. In particular, Jakob Gruber has been exceptionally helpful. It turns out that this project aligns nicely with a pre-existing desire on the V8 team to make Irregexp more independent of V8. While we tried to make our shim as complete as possible, there were some circumstances where upstream changes were the best solution. Many of those  changes  were  quite minor. Some were more interesting.\n Some code at the interface between V8 and Irregexp turned out to be too hard to use in SpiderMonkey. For example, to execute a compiled RegExp, Irregexp calls  NativeRegExpMacroAssembler::Match. That function was tightly entangled with V8’s string representation. The string implementations in the two engines are surprisingly close, but not so close that we could share the code. Our  solution was to move that code out of Irregexp entirely, and to hide other unusable code behind an embedder-specific  #ifdef. These changes are not particularly interesting from a technical perspective, but from a software engineering perspective they give us a clearer sense of where the API boundary might be drawn in a future project to separate Irregexp from V8.\n As our prototype implementation neared completion, we realized that one of the remaining failures in SpiderMonkey’s test suite was also failing in V8. Upon investigation, we determined that there was a subtle mismatch between Irregexp and the JavaScript specification when it came to case-insensitive, non-unicode RegExps. We  contributed a patch upstream to rewrite Irregexp’s handling of characters with non-standard case-folding behaviour (like ‘ß’, LATIN SMALL LETTER SHARP S, which gives “SS” when upper-cased).\n Our opportunities to help improve Irregexp didn’t stop there. Shortly after we landed the new version of Irregexp in Firefox Nightly, our intrepid  fuzzing team discovered a convoluted RegExp that crashed in debug builds of both SpiderMonkey and V8. Fortunately, upon further investigation, it turned out to be an overly strict assertion. It did, however, inspire some additional  code quality  improvements in the RegExp interpreter.\n   What did we get for all this work, aside from some  improved  subscores on the  JetStream2 benchmark?\n Most importantly, we got full support for all the new RegExp features. Unicode property escapes and look-behind references only affect RegExp matching, so they worked as soon as the shim was complete. The dotAll flag only required a small amount of additional work to support. Named captures involved slightly more support from the rest of SpiderMonkey, but a couple of weeks after the new engine was enabled, named captures landed too. (While testing them, we turned up  one last bug in the equivalent V8 code.) This brings Firefox fully up to date with the  latest ECMAScript standards for JavaScript.\n We also have a stronger foundation for future RegExp support. More collaboration on Irregexp is mutually beneficial. SpiderMonkey can add new RegExp syntax much more quickly. V8 gains an extra set of eyes and hands to find and fix bugs. Hypothetical future embedders of Irregexp have a proven starting point.\n The new engine is available in Firefox 78, which is currently in our  Developer Edition browser release. Hopefully, this work will be the basis for RegExps in Firefox for years to come.", "posttime": "2020-06-12 03:32:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "spidermonkey,engine,irregexp", "title": "SpiderMonkey中一种新的RegExp引擎", "title_en": "A New RegExp Engine in SpiderMonkey", "transed": 1, "url": "https://hacks.mozilla.org/2020/06/a-new-regexp-engine-in-spidermonkey/", "via": "", "real_tags": ["engine", "irregexp"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006184, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Xanaflight：三页", "note_en": "Xanaflight: Three pages", "posttime": "2020-06-12 03:15:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xanaflight", "title": "Xanaflight：三页", "title_en": "Xanaflight: Three Pages", "transed": 1, "url": "http://perma.pub/alpha/edward/openZRe7/fulfil", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "ef405e250dfb7e5632c17290e13aa85d.png", "infoid": 1006183, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "xrdp使用MicrosoftRemote Desktop Protocol(RDP)提供远程计算机的图形登录。xrdp接受来自各种RDP客户端的连接：FreeRDP、rktop、NeutrinoRDP和Microsoft Remote DesktopClient(适用于Windows、Mac OS、iOS和Android)。\n大多数Linux发行版应该在其存储库中分发最新版本的xrdp。您需要xrdp和xorgxrdp包才能获得最佳体验。建议xrdp依赖于xorgxrdp，因此安装xrdp应该足够了。如果未提供xorgxrdp，请使用Xvncserver。\nxrdp在3389/TCP上侦听。确保您的防火墙接受从您想要访问的位置到3389/TCP的连接。\nYUM将被DNF替换，因此您可能需要在上面的命令中使用DNF代替YUM。\nFreeBSD不是xrdp的主要目标。它在FreeBSD上工作，但驱动器重定向功能除外。\n到目前为止还不支持MacOS等其他操作系统，但我们欢迎您的贡献。\n要从打包的源代码编译xrdp，您需要基本的构建工具-编译器(GCC或clang)和make程序。此外，您还需要openssl-devel、pam-devel、libX11-devel、libXfix-devel、libXrandr-devel。根据您的配置，将需要更多额外的软件。\n要从签出的git存储库编译xrdp，您还需要autoconf、auto ake、libtool和pkgconfig。\n如果从签出的存储库中编译，请确保您也已经复制子模块(使用GIT CLONE--递归https://github.com/neutrinolabs/xrdp)。\n如果您想使用音频重定向，您需要构建并安装附加的PulseAudio模块。构建说明可以在wiki上找到。\nxrdp├──Common···Common Code├──Docs···Documentation├──Fontdump···Windows├──的字体转储···Keymap Generator├──instfiles···可安装数据文件├──KEYGEN···xrdp RSA密钥对生成器├──libPainter··画图库├──库fxcodec·RFX编解码库├──libxrdp···核心RDP协议实现├──M4。mc···rdp客户端模块，用于使用├──├──pkgconfig代理rdp连接···pkg-config Configuration├──sesman···xrdp├──tcutils的会话管理器···基于qt的瘦客户端├──测试实用程序···代码├──vnc的测试···xrdp的vnc客户端模块···用于xrdp的vnc客户端模块。频道├──xrdp···主服务器代码├──xrdpi···虚拟频道├──xrdpvr···通过rdp└──xup播放媒体的接口···X11rdp和xorgxrdp客户端模块", "note_en": "xrdp provides a graphical login to remote machines using MicrosoftRemote Desktop Protocol (RDP). xrdp accepts connections from a variety ofRDP clients: FreeRDP, rdesktop, NeutrinoRDP and Microsoft Remote DesktopClient (for Windows, Mac OS, iOS and Android).\n         Most Linux distributions should distribute the latest release of xrdp in theirrepository. You would need xrdp and xorgxrdp packages for the bestexperience. It is recommended that xrdp depends on xorgxrdp, so it shouldbe sufficient to install xrdp. If xorgxrdp is not provided, use Xvncserver.\n xrdp listens on 3389/tcp. Make sure your firewall accepts connection to3389/tcp from where you want to access.\n        yum is being replaced with  dnf, so you may need to use  dnf insteadof  yum in the above commands.\n    FreeBSD is not a primary target of xrdp. It is working on FreeBSD exceptfor the drive redirection feature.\n Other operating systems such as macOS are not supported so far, but wewelcome your contributions.\n    To compile xrdp from the packaged sources, you need basic build tools - acompiler ( gcc or  clang) and the  make program. Additionally,you would need  openssl-devel,  pam-devel,  libX11-devel, libXfixes-devel,  libXrandr-devel. More additional software wouldbe needed depending on your configuration.\n To compile xrdp from a checked out git repository, you would additionallyneed  autoconf,  automake,  libtool and  pkgconfig.\n   If compiling from a checked out repository, please make sure you&#39;ve got the submodulescloned too (use  git clone --recursive https://github.com/neutrinolabs/xrdp)\n   If you want to use audio redirection, you need to build and install additionalpulseaudio modules. The build instructions can be found at wiki.\n   xrdp├── common ······ common code├── docs ········ documentation├── fontdump ···· font dump for Windows├── genkeymap ··· keymap generator├── instfiles ··· installable data file├── keygen ······ xrdp RSA key pair generator├── libpainter ·· painter library├── librfxcodec · RFX codec library├── libxrdp ····· core RDP protocol implementation├── m4 ·········· Autoconf macros├── mc ·········· media center module├── neutrinordp · RDP client module for proxying RDP connections using NeutrinoRDP├── pkgconfig ··· pkg-config configuration├── sesman ······ session manager for xrdp├── tcutils ····· QT based utility program for thin clients├── tests ······· tests for the code├── vnc ········· VNC client module for xrdp├── vrplayer ···· QT player redirecting video/audio to clients over xrdpvr channel├── xrdp ········ main server code├── xrdpapi ····· virtual channel API├── xrdpvr ······ API for playing media over RDP└── xup ········· X11rdp and xorgxrdp client module", "posttime": "2020-06-12 03:14:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,rdp,open,xrdp", "title": "Xrdp：一个开源的RDP服务器", "title_en": "Xrdp: An open source RDP server", "transed": 1, "url": "https://github.com/neutrinolabs/xrdp", "via": "", "real_tags": ["开源", "rdp", "open", "xrdp"]}, {"category": "", "categoryclass": "", "imagename": "a3ccf0dbc00c4a7424df0b4b4973d851.jpeg", "infoid": 1006182, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "前首席执行官Facebook Inc.。副手克里斯·考克斯(Chris Cox)即将重返这家社交媒体巨头。一年多前，他因与首席执行官马克·扎克伯格(Mark Zuckerberg)在公司发展方向上存在分歧而离职。\n考克斯是Facebook最早的工程师之一，他宣布计划重返公司担任产品主管，他于2019年3月辞去了这一职位。这一角色的核心是执行扎克伯格对Facebook平台的愿景，众所周知，考克斯不同意这位首席执行官朝着统一公司产品的方向发展的计划……", "note_en": "Former top Facebook Inc. deputy Chris Cox is returning to the social-media giant, just over a year after leaving amid disagreements with CEO Mark Zuckerberg over the company’s direction.\n  Mr. Cox, who was one of Facebook’s earliest engineers, announced his plans to return as the company’s head of product, the job he resigned in March 2019. The core of the role is executing Mr. Zuckerberg’s vision for Facebook’s platforms, and Mr. Cox was known to have disagreed with the CEO’s plans to move toward unifying the company’s products...", "posttime": "2020-06-12 03:14:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,cox", "title": "扎克伯格副手克里斯·考克斯(Chris Cox)将重返Facebook", "title_en": "Chris Cox, Zuckerberg lieutenant, to return to Facebook", "transed": 1, "url": "https://www.wsj.com/articles/zuckerberg-lieutenant-returns-to-facebook-a-year-after-departure-11591899761", "via": "", "real_tags": ["facebook", "cox"]}, {"category": "", "categoryclass": "", "imagename": "7cc0bbe438a24c9bae5f840e151d0f04.jpg", "infoid": 1006181, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "徒步穿过美国西部的国家公园-约书亚树、大峡谷、布莱斯峡谷-深深呼吸原始的空气。这些都是未被破坏的土地，总而言之，这是一个伟大的美国保护故事。然而，一种看不见的威胁实际上正在吹过空气，通过雨滴落下：微塑料颗粒，小块(定义为不到5毫米长)破碎的塑料瓶，以及从衣服上磨损的微纤维，所有这些污染物都会被地球的大气系统卷起来，沉淀在荒野中。\n研究人员今天在“科学”杂志上发表了一篇文章，报告了一个惊人的发现：在收集了14个月的雨水和空气样本后，他们计算出，每年有超过1000吨的微塑料颗粒落入美国西部的11个保护区。这相当于超过1.2亿个塑料水瓶。犹他州州立大学(Utah State University)环境科学家、主要作者贾尼斯·布拉尼(Janice Brahney)说：“我们只是为西部的保护区做了这件事，这只占美国总面积的6%。”“这个数字实在太大了，令人震惊。”\n这进一步证实了一种越来越可怕的情景：微塑料正吹向世界各地，降落在理应是纯净的栖息地，比如北极和遥远的法国比利牛斯山。它们通过废水流入海洋，污染深海生态系统，甚至被海风喷出水面，吹到陆地上。现在在美国西部，考虑到这些是基本的大气过程，大概在世界其他地方，它们正在以塑料雨的形式下降-新的酸雨。\n塑料雨可能被证明是一个比酸雨更隐蔽的问题，酸雨是二氧化硫和氮氧化物排放的结果。通过在发电厂部署洗涤器来控制前者，在汽车上部署催化转化器来控制后者，美国和其他国家在过去的几十年里减少了酸化问题。但是，即使是最偏远的环境，微型塑料也已经破坏了，而且没有办法擦洗水、陆地或空气中的颗粒-这种东西绝对无处不在，而且我们不可能在海洋中拖着一块塑料磁铁。塑料之所以如此有用-它的坚硬-也是它成为一种令人担忧的污染物的原因：塑料从未真正消失，而是破碎成越来越小的碎片，渗透到地球上越来越小的角落。更糟糕的是，根据咨询公司麦肯锡(McKinsey)的数据，到2030年，塑料垃圾预计将从每年2.6亿吨飙升至4.6亿吨。在经济发展中的国家，更多的人加入中产阶级意味着更多的消费主义和更多的塑料包装。\n为了量化整个美国西部的问题已经变得多么严重，研究人员使用了11个国家公园和保护区的收集器，对雨水和空气进行采样。每个人都有一个“湿”桶来收集雨水，一个“干”桶来收集空气。传感器会探测到降雨量，打开“湿”桶，同时关闭干桶。当外面阳光明媚时反之亦然，所以干燥的水桶会收集风中携带的微塑料颗粒，而潮湿的水桶则保持关闭状态。研究人员还对他们收集的每一场特定风暴的发源地进行了建模，在将水和微塑料倾倒到湿桶之前，观察了它经过的城市的大小。\n总体而言，他们发现，在一年多的时间里收集的样本中，令人震惊的98%含有微塑料颗粒。平均而言，捕获的大气颗粒物中有4%实际上是合成聚合物。在雨中落下的颗粒比风中沉积的颗粒更大，较轻的颗粒更容易被气流卷住。超细纤维来自聚酯服装等来源，在湿样品中占合成材料的66%，在干样品中占70%。布拉尼说：“几乎在每个样品中都能看到鲜艳的塑料碎片，这让我大吃一惊。”此外，研究小组不能用他们的设备计算透明或白色颗粒和纤维，所以他们的计数可能是保守的。\n通过观察沉积湿微塑料样品的风暴路径，布拉尼和她的同事们能够绘制出天气系统如何运输颗粒的地图。例如，风可能会将城市地区的微塑料颗粒踢离地面，在迫使它们再次浮出地面之前，将它们带到顺风方向。布拉尼说：“雨水能非常有效地清除空气中所有的东西。”“因此，大气中可能会有相当数量的灰尘和塑料，一场暴雨将把它们冲走。”微塑料颗粒甚至可以充当凝聚核，即吸引水蒸气形成云的碎片。\n另一方面，干燥的尘埃似乎正在传播更长的距离。这些粒子\n布拉尼说：“我们看到了与急流位置的关系，这意味着控制沉积的气团在大气层中确实很高。”(在美国，快速流动的喷流从西向东横跨整个大陆。)。这与其他科学家开始在世界其他地方看到的情况不谋而合：微小的塑料碎片-主要是衣服上的合成纤维-正被风卷住，散布得很远很广，污染了以前纯净的栖息地。例如，欧洲的城市似乎在北极播种微型塑料。\n这项新研究还带来了另一个令人不安的惊喜：30%的样本颗粒是微珠，这是一种微小的合成球体，美国在2015年禁止在美容产品中使用这种微球。然而，样品中的微珠通常比你在这些产品中找到的要小。布拉尼说：“我们确实看到了很多颜色鲜艳的微珠，各种颜色的彩虹，还有一些我们鉴定为丙烯酸的微珠。”\n这使得研究人员推测，这些微珠来自工业涂料和涂料。如果喷洒这些微珠，他们可以很容易地将微珠喷到大气中，在那里它们会被风卷起并带到很远的地方。如果真是这样的话，油漆行业可能会面临污染美容行业的同样的微珠清算。尽管如此，如果一个国家禁止涂料中的微珠，这种东西很可能会从邻国吹进来。\n更令人不安的是，微塑料最终会分解成纳米塑料，小到研究人员在没有合适的设备的情况下可能无法检测到它们。“我看不到任何小于4微米的东西，但这并不意味着它不在那里，”布拉尼说。“仅仅因为我们看不到他们出现在我们面前，并不意味着我们没有吸入他们。”\n科学家们还不知道吸入微珠可能对人类健康意味着什么，但我们有理由认为它是无益的。随着时间的推移，塑料碎片往往会渗出其成分化学物质，并已被认为可以运输病毒和细菌等微生物。研究人员刚刚开始探索这对其他生物意味着什么：今年早些时候发表的一项研究发现，暴露在微塑料下的寄居蟹在生长过程中很难选择新的贝壳，这是一个特别的问题，因为它们需要这些贝壳才能生存。\n在美国国家公园的土壤中，塑料的到来可能会产生连锁效应。斯特拉斯克莱德大学(University Of Strathclyde)的微整形研究员史蒂夫·艾伦(Steve Allen)没有参与这项新研究，他说：“它们不能只阻塞小动物的消化道，比如蠕虫。”“但也正是这些塑料和塑料中的化学物质会对土壤产生影响。其中很多还只是理论上的--我们仍在努力解决这个问题。“。\n布拉尼和她的同事们注意到，微塑料可能正在改变土壤的热性质，例如，改变它吸收和储存热量的方式。它们还可能导致通常生活在那里的微生物或多或少地生长，重新安排群落，改变泥土循环营养的方式。微塑料也可能改变水通过这些土壤的方式。\n但撇开这些剩余的未知因素不谈，这项研究为微塑性生命周期提供了一个关键的谜团，它随着每一项新的研究而变得越来越复杂。科学家们一直在试图弄清楚世界上的塑料污染会发生什么，几乎所有的塑料污染似乎都在环境中“消失”。但像这样的研究表明，这些东西永远不会真正消失，它只是被粉碎成更小的碎片，分散在世界各地，可能要花很多年的时间在不同的系统中循环-空中、陆地和海洋。\n例如，科学家们已经发现，洋流正在将微塑性颗粒带入深海生态系统-当洋流变慢时，悬浮颗粒会脱落并沉降在海底。“深海洋流的行为基本上与大气洋流是一样的，”曼彻斯特大学地球科学家伊恩·凯恩(Ian Kane)说，他是这项研究的主要作者，但没有参与这项新工作。“它们是全球再循环模式的一部分，颗粒根据形状和密度进行运输。所以这也是同样的过程。这些作者发现，在潮湿的条件下，较重的颗粒往往会脱落。“。\n史蒂夫·艾伦(Steve Allen)和他的配偶迪尼·艾伦(Deonie Allen)也是斯特拉斯克莱德大学(University Of Strathclyde)的微塑料研究员，他们上个月发表的另一项研究发现，海洋正在打鼓微塑料颗粒，然后这些颗粒随着海风漂浮在岸上。以前，人们认为，当微塑料通过废水流入大海时，它们会留在那里。因此，落在土壤上的微塑料也可能不会停留在原地。“这可能不是静态的，”迪尼·艾伦(Deonie Allen)说。“它不会坐视不管。有些会通过我们的地下水位，有些会因为侵蚀而移动，或者重新释放到大气中。“。\n关于这个微塑料循环，科学还有很多需要了解的地方，但有一点是明确的：不会再把塑料放回瓶子里。\n👁大脑是人工智能的有用模型吗？另外：获取最新的人工智能新闻。\n🏃🏽‍♀️想要最好的健康工具吗？看看我们Gear团队挑选的最好的健身跟踪器、跑步装备(包括鞋子和袜子)和最好的耳机", "note_en": "Hoof it through the national parks of the western United States—Joshua Tree, the Grand Canyon, Bryce Canyon—and breathe deep the pristine air. These are unspoiled lands, collectively a great American conservation story. Yet an invisible menace is actually blowing through the air and falling via raindrops: Microplastic particles, tiny chunks (by  definition, less than 5 millimeters long) of fragmented plastic bottles and microfibers that fray from clothes, all pollutants that get caught up in Earth’s atmospheric systems and deposited in the wilderness.\n Writing today in the journal  Science, researchers report a startling discovery: After collecting rainwater and air samples for 14 months, they calculated that over 1,000 metric tons of microplastic particles fall into 11 protected areas in the western US each year. That’s the equivalent of over 120 million plastic water bottles. “We just did that for the area of protected areas in the West, which is only 6 percent of the total US area,” says lead author Janice Brahney, an environmental scientist at Utah State University. “The number was just so large, it&#39;s shocking.”\n It further confirms an increasingly hellish scenario: Microplastics are blowing all over the world, landing in supposedly pure habitats, like  the Arctic and the  remote French Pyrenees. They’re flowing into the oceans via wastewater and tainting  deep-sea ecosystems, and they’re even ejecting  out of the water and  blowing onto land in sea breezes. And now in the American West, and presumably across the rest of the world given that these are fundamental atmospheric processes, they are falling in the form of  plastic rain—the new acid rain.\n  Plastic rain could prove to be a more insidious problem than acid rain, which is a consequence of sulfur dioxide and nitrogen oxide emissions. By deploying scrubbers in power plants to control the former, and catalytic converters in cars to control the latter, the US and other countries have over the last several decades  cut down on the acidification problem. But microplastic has already corrupted even the most remote environments, and there’s no way to scrub water or land or air of the particles—the stuff is absolutely everywhere, and it’s not like there’s a plastic magnet we can drag through the oceans. What makes plastic so useful—its hardiness—is what also makes it an alarming pollutant: Plastic never really goes away, instead breaking into ever smaller bits that infiltrate ever smaller corners of the planet. Even worse, plastic waste is expected to skyrocket from 260 million tons a year to 460 million tons by 2030,  according to the consultancy McKinsey. More people joining the middle class in economically-developing countries means more consumerism and more plastic packaging.\n  To quantify just how bad the problem has become across the American West, the researchers used collectors in 11 national parks and protected areas, sampling both rain and air. Each had a “wet” bucket to collect rainwater, and a “dry” bucket to collect air. A sensor would detect rainfall and open up the “wet” bucket while closing the dry one. And vice versa when it’s sunny out, so the dry bucket would collect microplastic particles carried on the wind while the wet bucket stayed shut. The researchers also modeled where each particular storm they collected rain from had originated, looking at the size of the cities it traveled through before dumping water, and microplastics, into the wet bucket.\n  Overall, they found that a stunning 98 percent of samples collected over a year contained microplastic particles. On average, 4 percent of captured atmospheric particulates were actually synthetic polymers. The particles that fell in rain were larger than those deposited by wind—lighter particles are more easily caught up in air currents. Microfibers, from sources like polyester clothing, made up 66 percent of the synthetic material in wet samples and 70 percent in dry samples. “I was just completely floored to see little brightly-colored pieces of plastic in nearly every single sample,” says Brahney. Plus, the team wasn&#39;t able to count clear or white particles and fibers with their equipment, so their tally is likely conservative.\n Looking at the path of the storms that deposited the wet microplastic samples, Brahney and her colleagues were able to map how weather systems transport the particles. Winds, for instance, might kick up microplastic particles off the ground in an urban area and carry them downwind before forcing them to the surface once more. “Rain is very effective at scrubbing the atmosphere of everything that&#39;s in it,” says Brahney. “And so there could be a fair amount of dust and plastics in the atmosphere and a rainstorm will wash those out.” Microplastic particles could even be acting as condensation nuclei, bits of debris that attract water vapor to form a cloud.\n The dry fallout, on the other hand, appears to be traveling longer distances. These particles’ smaller size indicates they’re more easily carried on winds for hundreds, maybe thousands of miles—consider that dust from the Sahara readily blows across the Atlantic and falls in the Amazon rainforest—instead of getting caught up in storms, a more regional phenomenon. And microplastics are probably traveling even farther than soil particles because they&#39;re far less dense.\n “We saw relationships to the location of the jet stream, which implies that the air masses that are controlling deposition are really high in the atmosphere,” says Brahney. (In the US,  the fast-moving jet stream runs from west to east across the continent.) This jibes with what other scientists are starting to see elsewhere around the world: Tiny pieces of plastic—largely synthetic fibers from clothes—are getting caught in the wind and spread far and wide, tainting formerly pristine habitats. For example, the cities of Europe  seem to be seeding the Arctic with microplastic.\n This new research comes with another troubling surprise: 30 percent of the sample particles were microbeads, tiny synthetic spheres that the United States  banned from beauty products in 2015. The microbeads in the samples, though, were generally smaller than the ones you’d find in those products. “We did see a lot of brightly-colored microbeads, in all colors of the rainbow, and some of those we identified as acrylic,” says Brahney.\n That leads the researchers to speculate that the microbeads are coming from industrial paints and coatings. If these are sprayed, they could easily spew the microbeads into the atmosphere, where they’d be picked up by winds and carried afar. If that’s indeed the case, the paint industry may be in for the same kind of microbead reckoning that sullied the beauty industry. Still, if one country bans microbeads in paints, the stuff could well blow in from a neighboring country.\n  More troubling still, microplastics eventually break into  nanoplastics, bits so small that researchers may not be able to detect them without the right equipment. “I couldn&#39;t see anything smaller than four microns, but that doesn&#39;t mean it wasn&#39;t there,” says Brahney. “Just because we can&#39;t see them in front of us, doesn&#39;t mean we&#39;re not breathing them in.”\n Scientists don&#39;t yet know what inhaling microbeads might mean for human health, but it’s reasonable to assume it’s not beneficial. Bits of plastic tend to leach their component chemicals over time, and have been known to transport microbes like viruses and bacteria. Researchers are just beginning to explore what this means for other organisms: One study published earlier this year found that hermit crabs exposed to microplastics  have difficulties choosing new shells as they grow, a particular problem since they need those shells to survive.\n  In the soils of America’s national parks, the arrival of plastics could have cascading effects. “These can not just block up the digestive tract of small animals, like worms,” says University of Strathclyde microplastic researcher Steve Allen, who wasn’t involved in the new study. “But it&#39;s also the chemicals that are  on these plastics and  in these plastics that can have an effect on the soil. A lot of that is still theoretical—we&#39;re still trying to work it out.”\n Brahney and her colleagues note that microplastics may be changing the thermal properties of soil, for instance, altering how it absorbs and stores heat. They may also lead to the growth of more or less of the microbes that normally live there, rearranging communities and altering the way the dirt cycles nutrients. Microplastics may also change how water moves through these soils.\n But setting these many remaining unknowns aside, this research puts in place a critical piece of the puzzle regarding the microplastic life cycle, which grows increasingly complex with each new study. Scientists have been trying to figure out what happens to the world’s plastic pollution, nearly all of which seems to “disappear” in the environment. But studies like this one are showing that the stuff never truly goes away, it just gets shredded into smaller bits that disperse all over the world, perhaps spending many years cycling through different systems—air, land, and sea.\n Scientists have discovered, for instance, that currents are carrying microplastic particles into deep-sea ecosystems—when the currents slow, the suspended particles fall out and settle on the seafloor. “Deep sea currents basically behave in the same way as atmospheric currents do,” says University of Manchester earth scientist Ian Kane, who was lead author  on that study, but wasn’t involved in this new work. “They&#39;re part of a global recirculation pattern, and the particles are transported according to the shape and the density. And so it&#39;s the same process. What these authors found is that the heavier particles tended to fall out in the wet conditions.”\n  Other research published last month by Steve Allen and his spouse Deonie Allen, also a microplastic researcher University of Strathclyde, found that the oceans are burping up microplastic particles, which then float onshore on sea breezes. Previously, it was believed that when microplastics flowed into the sea via wastewater, they’d stay there. So it may also turn out that microplastics landing on soil are also not staying put. “It may not be static,” says Deonie Allen. “It&#39;s not going to just sit. Some of it ends up going down through our water table, some of it moves because of erosion, or gets rereleased back into the atmosphere.”\n There’s still much that science has to learn about this microplastic cycle, but this much is clear: There’ll be no putting the plastic back in the bottle.\n   👁 Is the brain a  useful model for AI? Plus:  Get the latest AI news\n 🏃🏽‍♀️ Want the best tools to get healthy? Check out our Gear team’s picks for the  best fitness trackers,  running gear (including  shoes and  socks), and  best headphones", "posttime": "2020-06-12 03:14:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "塑料,rain", "title": "塑料雨是新的酸雨", "title_en": "Plastic Rain Is the New Acid Rain", "transed": 1, "url": "https://www.wired.com/story/plastic-rain-is-the-new-acid-rain/", "via": "", "real_tags": ["塑料", "rain"]}, {"category": "", "categoryclass": "", "imagename": "60479f280f4e30f392f772f18206e7f1.png", "infoid": 1006180, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转在数学中搜索，康托函数是一个连续的函数，但不是绝对连续的。这在分析中是一个臭名昭著的反例，因为它挑战了关于连续性、导数和测度的天真直觉。虽然它处处是连续的，几乎处处都有零导数，但当它的自变量从0到1时，它的值仍然从0到1。因此，从某种意义上说，该函数看起来非常像一个常数，不能增长，而在另一种意义上，它确实是通过构造单调增长的。\n它也被称为康托三元函数，勒贝格函数，[1]勒贝格奇异函数，康托-维塔利函数，魔鬼楼梯，[2]康托楼梯函数，[3]和康托-勒贝格函数。[4]Georg Cantor(1884)引入了Cantor函数，并提到Scheeffer指出它是Harnack所声称的微积分基本定理的推广的反例。康托函数由Scheeffer(1884)、Lebesgue(1904)和Vitali(1905年)讨论和推广。\n参见图。要正式定义康托函数c：[0，1]→[0，1]，设x在[0，1]中，通过以下步骤获得c(X)：\n如果x包含1，则将第一个1后面的每个数字严格替换为0。\n1/4是0.02020202.。在基数3。没有1所以下一阶段仍然是0.02020202…。这里改写为0.01010101..。当以基数2读取时，这对应于1/3，因此c(1/4)=1/3。\n1/5是0.01210121.。以3为基数。第一个1后面的数字被0替换成0.01000000…。因为没有2，所以不会重写。当以基数2读取时，这对应于1/4，因此c(1/5)=1/4。\n二百/二百四十三等于0.21102(或0.211012222.)。以3为基数。第一个1之后的数字被0替换为0.21。这被重写为0.11。当以基数2读取时，这对应于3/4，因此c(200/243)=3/4。\n等价地，如果C{\\DisplayStyle{\\Mathcal{C}}是[0，1]上的康托集，则康托函数c：[0，1]→[0，1]可以定义为\nC(X)={∑n=1∞a n 2 n，x=∑n=1∞2 a n 3 n∈C f o r in a n∈{0，1}；sup y≤x，y∈C c(Y)，x∈[0，1]∖C.。{\\displaystyle c(X)={\\start{case}\\sum_{n=1}^{\\infty}{\\frac{a_{n}}{2^{n}}，&amp；x=\\sum_{n=1}^{\\infty}{\\frac{2a_{n}}{3^{n}\\in{\\mathcal{C}}\\\\maththm{for}\\a_{n}\\。\\sup_{y\\leq x，\\，y\\in{\\mathcal{C}c(Y)，&amp；x\\in[0，1]\\setminus{\\mathcal{C}}。\\end{case}。\n这个公式是明确定义的，因为Cantor集合的每个成员都有一个唯一的基数为3的表示法，该表示法只包含数字0或2。(对于C{\\DisplayStyle{\\mathcal{C}的某些成员，三元展开与尾随的2&#39；s重复，并且存在以1结尾的替代非重复展开。例如，1/3=0.13=0.02222.。3是康托集合的成员)。由于c(0)=0和c(1)=1，并且c在C{\\displaystyle{\\mathcal{C}上是单调的，显然，0≤c(X)≤1对[0，1]中的所有x∈[0，1]∖C{\\displaystyle x\\在[0，1]\\set减{\\mathcal{C}也成立。\nCantor函数挑战了关于连续性和测度的天真直觉；尽管它处处连续，几乎处处导数为零，但c(X){\\textstyle c(X)}随着x{\\textstyle x}从0到1而从0到1，并取其间的每个值。康托函数是实函数一致连续(确切地说，它是指数为α_2/log_3的Hölder连续)但不是绝对连续的最常被引用的例子。它在形式(0。x 1 x 2 x 3.。X N022222.，0.。x 1 x 2 x 3.。xn200000…)，并且每个不在康托集合中的点都在这些区间中，所以它的导数在康托集合之外是0。另一方面，它在包含上述区间端点的康托集的不可数子集中的任何点都没有导数。\n康托函数也可以看作康托集上支持的1/2-1/2伯努利测度μ的累积概率分布函数：C(X)=μ([0，x]){\\TextStyle c(X)=\\Mu([0，x])}。这种概率分布称为康托分布，没有离散部分。也就是说，相应的度量是无原子的。这就是函数中没有跳跃不连续的原因；任何这样的跳跃都将对应于度量中的一个原子。\n然而，康托函数的任何非常数部分都不能表示为概率密度函数的积分；在任何区间上积分不是几乎处处为零的任何假定的概率密度函数都将给该分布赋予概率零的某个区间以正概率。特别地，正如Vitali(1905)指出的那样，函数不是其导数的积分，即使导数几乎处处存在。\n康托函数是非递减的，因此特别是它的图形定义了一条可校正的曲线。Scheeffer(1884)证明其图的弧长为2。\n由于无穷大的康托集的勒贝格测度为0，对于任意正的ε，1和δ，都存在一个总长度为&δ的两两不交子区间的有限序列，在该序列上，康托函数的累计升幅大于ε。\n事实上，对于每一个显示样式和限制_{k=1}^{M}(y_{k}-x_{k})&lt；δk=1M(y_k−x_k)&lt；δ；0都有有限多个两两不交区间(x_k，y_k)(1_DisplayStyle，y_k)&lt；\\DELTA}和∑k=1M(c(Yk)−c(Xk))=1{\\DisplayStyle\\SUM\\LIMITS_{k=1}^{M}(c(y_{k})-c(x_{k}))=1}。\n下面我们在单位区间上定义一个收敛于康托函数的函数序列{fn}。\n然后，对于每个整数n≥0，下一个函数fn+1(X)将根据fn(X)定义如下：\n设fn+1(X)n=1/2+1/2×fn(3 x−2)，当2/3≤x≤1时。\n这三个定义在端点1/3和2/3处是兼容的，因为通过归纳，对于每个n，fn(0)f=0和f n(1)f=1。可以检查fn是否逐点收敛到上面定义的康托函数。此外，收敛是一致的。事实上，根据fn+1的定义，分成三种情况，我们可以看到。\nmax x∈[0，1]|f n+1(X)−f n(X)|≤1 2 max x∈[0，1]|f n(X)−f n−1(X)|，n≥1.{\\displaystyle\\max_{x\\in[0，1]}|f_{n+1}(X)-f_{n}(X)|\\leq{\\frac{1}{2}}\\，\\max_{x\\in[0，1]}|f_{n}(X)-f_{n-1}(X)|，\\quad n\\geq 1。}。\nmax x∈[0，1]|f(X)−f n(X)|≤2−n+1max x∈[0，1]|f 1(X)−f 0(X)|.。{\\displaystyle\\max_{x\\in[0，1]}|f(X)-f_{n}(X)|\\leq 2^{-n+1}\\，\\max_{x\\in[0，1]}|f_{1}(X)-f_{0}(X)|}。\n此外，如果f0(0)i=0，f0(1)i=1，并且f0有界[需要引用]，那么起始函数的选择实际上并不重要。\n康托函数与康托集密切相关。康托集合C可以被定义为区间[0，1]中在其基数-3(三元)展开中不包含数字-3\\f25 1-3的那些数字的集合，除非1后面只跟零(在这种情况下，尾部-3\\f25 1000-3\\f25…-3\\f6。{\\DisplayStyle\\ldots}可以替换为0222Dotts。{\\displaystyle\\ldots}以删除任何1)。结果表明，Cantor集是一个具有无穷多个点(零维体积)，但长度为零(一维体积)的分形。这里D=loglog(2)/loglog(3){\\displaystyle D=\\⁡(2)/\\⁡(3)}是C的分形维数。我们也可以将康托函数定义为康托集合的截面的D维体积。我们可以把康托函数定义为康托集合的截面的D维体积，其中D=LOG Log(2)/LOG(3){\\DisplayStyle D=\\LOG(2)/\\LOG(3)}。我们也可以将康托函数定义为康托集合的截面的D维体积\nF(X)=HD(C∩(0，x))。{\\displaystyle f(X)=H_{D}(C\\cap(0，x))。}。\ny=∑k=1∞b k 2−k{\\DisplayStyle y=\\sum_{k=1}^{\\infty}b_{k}2^{-k}}。\n是实数0≤y≤1关于二进制位b k∈{0，1}的二进(二进制)展开式。然后考虑函数。\nCz(Y)=∑k=1∞b k z k。{\\displaystyle C_{z}(Y)=\\sum_{k=1}^{\\infty}b_{k}z^{k}。}。\n对于z=C1/3，函数x=2的逆C1/3(Y)是Cantor函数。也就是说，y<sub>y</sub>=y<sub>y</sub>(X)是康托函数。一般而言，对于任何1/2的z，Cz(Y)看起来就像是Cantor函数侧翻，随着z接近于零，台阶的宽度也会变宽。\n如上所述，Cantor函数也是Cantor集合上测度的累积分布函数。不同的康托函数，或魔鬼的楼梯，可以通过考虑不同的康托集或其他分形支持的无原子概率度量来获得。虽然Cantor函数几乎处处都有导数0，但目前的研究集中在右上导数与右下导数不同的点集的大小问题上，从而导致导数不存在。这种可微性分析通常以分形维数的形式给出，其中Hausdorff维数是最流行的选择。这方面的研究是由Darst在20世纪90年代开始的，他证明了Cantor函数的不可微集的Hausdorff维数是Cantor集维数的平方，(LOG⁡2/LOG⁡3)2{\\DisplayStyle(\\log2/\\log3)^{2}}。随后，Falconer[6]证明了这种平方关系对所有的Ahlfor&#39都成立；的正则奇异测度，即dim H⁡{x：F‘(X)=L im H→0+μ([x，x+h])h不存在}=(dim H⁡supp⁡(μ))2{\\displaystyle\\dim_{H}\\Left\\{x：F&#39；(X)=\\lim_{h\\to 0^{+}}{\\frac{\\mu([x，x+h])}{h}}{\\text{不存在}}\\right\\}=\\Left(\\dim_{H}\\Operatorname{supp}(\\mu)\\right)^{2}}。\n随后，Troscheit[7]获得了更全面的集合的图景，其中对于自共形和自相似集合上支持的更一般的归一化Gibb&#s测度，不存在导数。\n赫尔曼·明科夫斯基(Hermann Minkowski)的问号函数在视觉上松散地类似于康托函数，看起来像是后者的平滑形式；它可以通过从连分式展开到二进制展开来构造，就像康托函数可以通过从三元展开到二元展开来构造一样。问号函数具有在所有有理数处导数为零的有趣性质。\n理查德·达斯特(1993-09-01)。Cantor函数的不可微集的Hausdorff维数为[ln(2)/ln(3)]2&#34；美国数学学会论文集。119(1)：105-108。10.2307/2159830。联合包裹服务公司股价上涨2159830。\n肯尼斯·J·福尔科纳(2004-01-01)。单边多重分形分析与魔鬼楼梯的不可微点。剑桥哲学学会数学论文集。136(1)：167-174。密码：2004MPCPS.136..167F。DOI：10.1017/S0305004103006960。ISSN电话：1469-8064。\n^Troscheit，萨沙(2014-03-01)。自共形魔鬼楼梯的Hölder可微性。剑桥哲学学会数学论文集。156(2)：295-311。Arxiv：1301.1286。密码：2014MPCPS.156..295T。DOI：10.1017/S0305004113000698。ISSN电话：1469-8064。\n巴斯，理查德·富兰克林(2013)[2011]。研究生真实分析(第二版)。CreateSpace独立出版公司。ISBN电话：978-1-4818-6914-0。CS1维护：REF=HARV(链接)。\n康托，G.(1884)。de la puqhance des overfaits de Points：Extrit d&39；une lettre adresséeàl&#34；éditeur&#34；[完美点数的力量：从致编辑的信中摘录》(The Power of Perfect Set Points：Extrit d&#39；une lettre adresséeàl&#34；éditeur&#34；)。数学学报。波士顿国际出版社。4：381-392。DOI：10.1007/bf02418423.。ISSN：0001-5962。转载于：E.Zermelo(编辑)，Gesammelte Abhandlungen Mathatischen and Philosophischen Inhalts，Springer，New York，1980。\n理查德·B·达斯特；朱迪思·A·帕拉加洛；普莱斯，托马斯·E(2010)，“好奇曲线”，哈肯萨克，新泽西州：世界科学出版公司。ISBN978-981-4291-28-6,2681574先生。\nDovgoshey，O.；Marto，O.；Ryazanov，V.；Vuorinen，M.(2006)。&#34；康托函数&#34；(PDF)。“数理演绎”(Exexextiones Mamaaticae)。爱思唯尔BV。24(1)：1-37。doi：10.1016/j.exmath.2005.05.002.。ISSN电话：0723-0869。2195181岁的先生。\n朱利安·F·弗隆(1994-04-01)。关于康托集和康托函数历史的注记&#34；。数学杂志。Informa UK Limited。67(2)：136-140。10.2307/2690689。ISSN：0025-570X。联合包裹服务公司股价上涨2690689。\n勒贝格，H.(1904)，Leçons sur l&#39；intégration et la recherche des Functions Priftions[关于整合和搜索原始函数的课程]，巴黎：Gauthier-Villars。\n莱昂尼，乔瓦尼(2017)。索博列夫空间的第一堂课。181(第二版)。罗德岛普罗维登斯：美国数学学会。734页。ISBN电话：978-1-4704-2921-8。华侨城：976406106。\n谢弗，路德维希(1884)。Allgemeine Untersuhungenüber Constraint der Curven&#34；[关于曲线校正的一般调查]。数学学报。波士顿国际出版社。5：49-82。DOI：10.1007/bf02421552.。ISSN：0001-5962。\n首页--期刊主要分类--期刊细介绍--期刊题录与文摘--期刊详细文摘内容。初等实数分析(第二版)。ClassicalRealAnalysis.com。ISBN电话：978-1-4348-4367-8。CS1维护：REF=HARV(链接)。\nVestrup，E.M.(2003)。测度论和整合论。概率统计中的威利系列。约翰·威利和他的儿子们。ISBN978-0471249771。CS1维护：REF=HARV(链接)。\n维塔利，A.(1905)，#34；Sulle Funzioni Integrali&#34；[关于积分函数]，Atti Accad.。SCI。都灵属(Torino Cl.)。SCI。菲斯。垫子。自然，40：1021-1034", "note_en": "Jump to navigation  Jump to search  In  mathematics, the  Cantor function is an example of a  function that is  continuous, but not  absolutely continuous. It is a notorious counterexample in analysis, because it challenges naive intuitions about continuity, derivative, and measure. Though it is continuous everywhere and has zero derivative almost everywhere, its value still goes from 0 to 1 as its argument reaches from 0 to 1. Thus, in one sense the function seems very much like a constant one which cannot grow, and in another, it does indeed monotonically grow, by construction.\n It is also referred to as the  Cantor ternary function, the  Lebesgue function,  [1]  Lebesgue&#39;s singular function, the  Cantor–Vitali function, the  Devil&#39;s staircase,  [2] the  Cantor staircase function,  [3] and the  Cantor–Lebesgue function.  [4]  Georg Cantor ( 1884) introduced the Cantor function and mentioned that Scheeffer pointed out that it was a  counterexample to an extension of the  fundamental theorem of calculus claimed by  Harnack. The Cantor function was discussed and popularized by  Scheeffer (1884),  Lebesgue (1904) and  Vitali (1905).\n    See figure. To formally define the Cantor function  c : [0,1] → [0,1], let  x be in [0,1] and obtain  c( x) by the following steps:\n If  x contains a 1, replace every digit strictly after the first 1 by 0.\n  1/4 is 0.02020202... in base 3. There are no 1s so the next stage is still 0.02020202... This is rewritten as 0.01010101... When read in base 2, this corresponds to 1/3, so  c(1/4) = 1/3.\n 1/5 is 0.01210121... in base 3. The digits after the first 1 are replaced by 0s to produce 0.01000000... This is not rewritten since there are no 2s. When read in base 2, this corresponds to 1/4, so  c(1/5) = 1/4.\n 200/243 is 0.21102 (or 0.211012222...) in base 3. The digits after the first 1 are replaced by 0s to produce 0.21. This is rewritten as 0.11. When read in base 2, this corresponds to 3/4, so  c(200/243) = 3/4.\n Equivalently, if                C      {\\displaystyle {\\mathcal {C}}}   is the  Cantor set on [0,1], then the Cantor function  c : [0,1] → [0,1] can be defined as\n c  (  x  )  =      {          ∑    n  =  1     ∞          a    n      2    n      ,     x  =    ∑    n  =  1     ∞          2    a    n       3    n      ∈      C         f  o  r        a    n    ∈  {  0  ,  1  }  ;          sup    y  ≤  x  ,    y  ∈      C      c  (  y  )  ,     x  ∈  [  0  ,  1  ]  ∖      C    .           {\\displaystyle c(x)={\\begin{cases}\\sum _{n=1}^{\\infty }{\\frac {a_{n}}{2^{n}}},&amp;x=\\sum _{n=1}^{\\infty }{\\frac {2a_{n}}{3^{n}}}\\in {\\mathcal {C}}\\ \\mathrm {for} \\ a_{n}\\in \\{0,1\\};\\\\\\sup _{y\\leq x,\\,y\\in {\\mathcal {C}}}c(y),&amp;x\\in [0,1]\\setminus {\\mathcal {C}}.\\\\\\end{cases}}}\n This formula is well-defined, since every member of the Cantor set has a  unique base 3 representation that only contains the digits 0 or 2. (For some members of                C      {\\displaystyle {\\mathcal {C}}}  , the ternary expansion is repeating with trailing 2&#39;s and there is an alternative non-repeating expansion ending in 1. For example, 1/3 = 0.1 3 = 0.02222... 3 is a member of the Cantor set). Since  c(0) = 0 and  c(1) = 1, and  c is monotonic on                C      {\\displaystyle {\\mathcal {C}}}  , it is clear that 0 ≤  c( x) ≤ 1 also holds for all            x  ∈  [  0  ,  1  ]  ∖      C      {\\displaystyle x\\in [0,1]\\setminus {\\mathcal {C}}}  .\n  The Cantor function challenges naive intuitions about  continuity and  measure; though it is continuous everywhere and has zero derivative  almost everywhere,            c  (  x  )    {\\textstyle c(x)}   goes from 0 to 1 as            x    {\\textstyle x}   goes from 0 to 1, and takes on every value in between. The Cantor function is the most frequently cited example of a real function that is  uniformly continuous (precisely, it is  Hölder continuous of exponent  α = log 2/log 3) but not  absolutely continuous. It is constant on intervals of the form (0. x 1 x 2 x 3... x n022222..., 0. x 1 x 2 x 3... x n200000...), and every point not in the Cantor set is in one of these intervals, so its derivative is 0 outside of the Cantor set. On the other hand, it has no  derivative at any point in an  uncountable subset of the  Cantor set containing the interval endpoints described above.\n The Cantor function can also be seen as the  cumulative probability distribution function of the 1/2-1/2  Bernoulli measure  μ supported on the Cantor set:            c  (  x  )  =  μ  (  [  0  ,  x  ]  )    {\\textstyle c(x)=\\mu ([0,x])}  . This probability distribution, called the  Cantor distribution, has no discrete part. That is, the corresponding measure is  atomless. This is why there are no jump discontinuities in the function; any such jump would correspond to an atom in the measure.\n However, no non-constant part of the Cantor function can be represented as an integral of a  probability density function; integrating any putative  probability density function that is not  almost everywhere zero over any interval will give positive probability to some interval to which this distribution assigns probability zero. In particular, as  Vitali (1905) pointed out, the function is not the integral of its derivative even though the derivative exists almost everywhere.\n  The Cantor function is non-decreasing, and so in particular its graph defines a  rectifiable curve.  Scheeffer (1884) showed that the arc length of its graph is 2.\n  Because the  Lebesgue measure of the  uncountably infinite  Cantor set is 0, for any positive  ε &lt; 1 and  δ, there exists a finite sequence of  pairwise disjoint sub-intervals with total length &lt;  δ over which the Cantor function cumulatively rises more than  ε.\n In fact, to every  δ &gt; 0 there are finitely many pairwise disjoint intervals ( x k, y k) (1 ≤  k ≤  M) with              ∑    k  =  1     M    (    y    k    −    x    k    )  &lt;  δ    {\\displaystyle \\sum \\limits _{k=1}^{M}(y_{k}-x_{k})&lt;\\delta }   and              ∑    k  =  1     M    (  c  (    y    k    )  −  c  (    x    k    )  )  =  1    {\\displaystyle \\sum \\limits _{k=1}^{M}(c(y_{k})-c(x_{k}))=1}  .\n    Below we define a sequence { f  n} of functions on the unit interval that converges to the Cantor function.\n  Then, for every integer   n ≥ 0, the next function  f  n+1( x) will be defined in terms of  f  n( x) as follows:\n   Let  f  n+1( x) =  1/2 + 1/2 ×  f  n(3  x − 2),  when  2/3 ≤  x ≤ 1.\n The three definitions are compatible at the end-points 1/3 and 2/3, because  f  n(0) = 0 and  f  n(1) = 1 for every  n, by induction. One may check that  f  n converges pointwise to the Cantor function defined above. Furthermore, the convergence is uniform. Indeed, separating into three cases, according to the definition of  f  n+1, one sees that\n max    x  ∈  [  0  ,  1  ]      |     f    n  +  1    (  x  )  −    f    n    (  x  )    |   ≤      1  2        max    x  ∈  [  0  ,  1  ]      |     f    n    (  x  )  −    f    n  −  1    (  x  )    |   ,    n  ≥  1.    {\\displaystyle \\max _{x\\in [0,1]}|f_{n+1}(x)-f_{n}(x)|\\leq {\\frac {1}{2}}\\,\\max _{x\\in [0,1]}|f_{n}(x)-f_{n-1}(x)|,\\quad n\\geq 1.}\n  max    x  ∈  [  0  ,  1  ]      |   f  (  x  )  −    f    n    (  x  )    |   ≤    2    −  n  +  1        max    x  ∈  [  0  ,  1  ]      |     f    1    (  x  )  −    f    0    (  x  )    |   .    {\\displaystyle \\max _{x\\in [0,1]}|f(x)-f_{n}(x)|\\leq 2^{-n+1}\\,\\max _{x\\in [0,1]}|f_{1}(x)-f_{0}(x)|.}\n Also the choice of starting function does not really matter, provided  f 0(0) = 0,  f 0(1) = 1 and  f 0 is  bounded [   citation needed].\n  The Cantor function is closely related to the  Cantor set. The Cantor set  C can be defined as the set of those numbers in the interval [0, 1] that do not contain the digit 1 in their  base-3 (triadic) expansion, except if the 1 is followed by zeros only (in which case the tail 1000           …    {\\displaystyle \\ldots }   can be replaced by 0222           …    {\\displaystyle \\ldots }   to get rid of any 1). It turns out that the Cantor set is a  fractal with (uncountably) infinitely many points (zero-dimensional volume), but zero length (one-dimensional volume). Only the  D-dimensional volume              H    D      {\\displaystyle H_{D}}   (in the sense of a  Hausdorff-measure) takes a finite value, where            D  =  log  ⁡  (  2  )    /   log  ⁡  (  3  )    {\\displaystyle D=\\log(2)/\\log(3)}   is the fractal dimension of  C. We may define the Cantor function alternatively as the  D-dimensional volume of sections of the Cantor set\n f  (  x  )  =    H    D    (  C  ∩  (  0  ,  x  )  )  .    {\\displaystyle f(x)=H_{D}(C\\cap (0,x)).}\n   y  =    ∑    k  =  1     ∞      b    k      2    −  k      {\\displaystyle y=\\sum _{k=1}^{\\infty }b_{k}2^{-k}}\n be the  dyadic (binary) expansion of the real number 0 ≤  y ≤ 1 in terms of binary digits  b  k ∈ {0,1}. Then consider the function\n C    z    (  y  )  =    ∑    k  =  1     ∞      b    k      z    k    .    {\\displaystyle C_{z}(y)=\\sum _{k=1}^{\\infty }b_{k}z^{k}.}\n For  z = 1/3, the inverse of the function  x = 2  C 1/3( y) is the Cantor function. That is,  y =  y( x) is the Cantor function. In general, for any  z &lt; 1/2,  C  z( y) looks like the Cantor function turned on its side, with the width of the steps getting wider as  z approaches zero.\n As mentioned above, the Cantor function is also the cumulative distribution function of a measure on the Cantor set. Different Cantor functions, or Devil&#39;s Staircases, can be obtained by considering different atom-less probability measures supported on the Cantor set or other fractals. While the Cantor function has derivative 0 almost everywhere, current research focusses on the question of the size of the set of points where the upper right derivative is distinct from the lower right derivative, causing the derivative to not exist. This analysis of differentiability is usually given in terms of  fractal dimension, with the Hausdorff dimension the most popular choice. This line of research was started in the 1990s by Darst,  [5] who showed that the Hausdorff dimension of the set of non-differentiability of the Cantor function is the square of the dimension of the Cantor set,            (  log  ⁡  2    /   log  ⁡  3    )    2      {\\displaystyle (\\log 2/\\log 3)^{2}}  . Subsequently  Falconer  [6] showed that this squaring relationship holds for all Ahlfor&#39;s regular, singular measures, i.e. dim    H    ⁡    {    x  :    f  ′   (  x  )  =    lim    h  →    0    +            μ  (  [  x  ,  x  +  h  ]  )   h       does not exist    }   =      (      dim    H    ⁡  supp  ⁡  (  μ  )   )     2      {\\displaystyle \\dim _{H}\\left\\{x:f&#39;(x)=\\lim _{h\\to 0^{+}}{\\frac {\\mu ([x,x+h])}{h}}{\\text{ does not exist}}\\right\\}=\\left(\\dim _{H}\\operatorname {supp} (\\mu )\\right)^{2}}\nLater, Troscheit  [7] obtain a more comprehensive picture of the set where the derivative does not exist for more general normalized Gibb&#39;s measures supported on self-conformal and  self-similar sets.\n Hermann Minkowski&#39;s  question mark function loosely resembles the Cantor function visually, appearing as a &#34;smoothed out&#34; form of the latter; it can be constructed by passing from a continued fraction expansion to a binary expansion, just as the Cantor function can be constructed by passing from a ternary expansion to a binary expansion. The question mark function has the interesting property of having vanishing derivatives at all rational numbers.\n  ^   Darst, Richard (1993-09-01). &#34;The Hausdorff Dimension of the Nondifferentiability Set of the Cantor Function is [ ln(2)/ln(3) ]2&#34;.  Proceedings of the American Mathematical Society.  119 (1): 105–108.  doi: 10.2307/2159830.  JSTOR  2159830.\n ^   Falconer, Kenneth J. (2004-01-01). &#34;One-sided multifractal analysis and points of non-differentiability of devil&#39;s staircases&#34;.  Mathematical Proceedings of the Cambridge Philosophical Society.  136 (1): 167–174.  Bibcode: 2004MPCPS.136..167F.  doi: 10.1017/S0305004103006960.  ISSN  1469-8064.\n ^   Troscheit, Sascha (2014-03-01). &#34;Hölder differentiability of self-conformal devil&#39;s staircases&#34;.  Mathematical Proceedings of the Cambridge Philosophical Society.  156 (2): 295–311.  arXiv:  1301.1286.  Bibcode: 2014MPCPS.156..295T.  doi: 10.1017/S0305004113000698.  ISSN  1469-8064.\n  Bass, Richard Franklin (2013) [2011].  Real analysis for graduate students (Second ed.). Createspace Independent Publishing.  ISBN   978-1-4818-6914-0.  CS1 maint: ref=harv ( link)\n Cantor, G. (1884). &#34;De la puissance des ensembles parfaits de points: Extrait d&#39;une lettre adressée à l&#39;éditeur&#34; [The power of perfect sets of points: Extract from a letter addressed to the editor].  Acta Mathematica. International Press of Boston.  4: 381–392.  doi:  10.1007/bf02418423.  ISSN  0001-5962.   Reprinted in: E. Zermelo (Ed.), Gesammelte Abhandlungen Mathematischen und Philosophischen Inhalts, Springer, New York, 1980.\n Darst, Richard B.; Palagallo, Judith A.; Price, Thomas E. (2010),  Curious curves, Hackensack, NJ: World Scientific Publishing Co. Pte. Ltd.,  ISBN   978-981-4291-28-6,  MR  2681574\n Dovgoshey, O.; Martio, O.; Ryazanov, V.; Vuorinen, M. (2006).  &#34;The Cantor function&#34;  (PDF).  Expositiones Mathematicae. Elsevier BV.  24 (1): 1–37.  doi: 10.1016/j.exmath.2005.05.002.  ISSN  0723-0869.  MR  2195181.\n Fleron, Julian F. (1994-04-01). &#34;A Note on the History of the Cantor Set and Cantor Function&#34;.  Mathematics Magazine. Informa UK Limited.  67 (2): 136–140.  doi: 10.2307/2690689.  ISSN  0025-570X.  JSTOR  2690689.\n Lebesgue, H. (1904),  Leçons sur l&#39;intégration et la recherche des fonctions primitives [ Lessons on integration and search for primitive functions], Paris: Gauthier-Villars\n Leoni, Giovanni (2017).   A first course in Sobolev spaces.  181 (2nd ed.). Providence, Rhode Island: American Mathematical Society. p. 734.  ISBN   978-1-4704-2921-8.  OCLC  976406106.\n Scheeffer, Ludwig (1884). &#34;Allgemeine Untersuchungen über Rectification der Curven&#34; [General investigations on rectification of the curves].  Acta Mathematica. International Press of Boston.  5: 49–82.  doi:  10.1007/bf02421552.  ISSN  0001-5962.\n Thomson, Brian S.; Bruckner, Judith B.; Bruckner, Andrew M. (2008) [2001].  Elementary real analysis (Second ed.). ClassicalRealAnalysis.com.  ISBN   978-1-4348-4367-8.  CS1 maint: ref=harv ( link)\n Vestrup, E.M. (2003).  The theory of measures and integration. Wiley series in probability and statistics. John Wiley &amp; sons.  ISBN   978-0471249771.  CS1 maint: ref=harv ( link)\n Vitali, A. (1905), &#34;Sulle funzioni integrali&#34; [On the integral functions],  Atti Accad. Sci. Torino Cl. Sci. Fis. Mat. Natur.,  40: 1021–1034", "posttime": "2020-06-12 03:13:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "函数,function", "title": "康托函数，又名。魔鬼阶梯：0导数的递增函数", "title_en": "Cantor function, a.k.a. devil's staircase: increasing function with 0 derivative", "transed": 1, "url": "https://en.wikipedia.org/wiki/Cantor_function", "via": "", "real_tags": ["函数", "function"]}, {"category": "", "categoryclass": "", "imagename": "ecd4850d558982a25d9392ee724d5a0a.jpg", "infoid": 1006179, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们都听过很多次了：在室内、室外、火车和公交车上都要戴面罩。在工作中，在超市里，在教堂里。\n但现在，剑桥大学和格林威治大学的一项新的建模研究表明，口罩在预防未来新型冠状病毒爆发方面可能比最初想象的更重要。\n为了防止病毒卷土重来，病毒的繁殖数量(从一个感染者那里感染它的平均人数)需要降到1.0以下。研究人员认为，仅靠封锁是不可能实现这一点的。然而，他们说，封锁和广泛的口罩遵从性相结合可能会起到作用。\n科学家们在周三发表在“皇家学会学报A”上的论文中写道：“我们表明，当公众一直使用口罩时(而不仅仅是从症状第一次出现时起)，有效的繁殖次数Re可以减少到1以下，从而减缓疫情的传播，”科学家们在周三发表在“皇家学会学报A”(Proceases Of The Royal Society A)上的论文中写道。\n建模表明，当锁定期与100%口罩的使用相结合时，疾病传播大大减少，可在18个月内防止复发，这是开发疫苗经常引用的时间框架。研究还表明，如果人们在公共场合戴口罩，降低R值的效果是只在症状出现后才戴面罩的两倍。\n口罩不一定要是最好的外科口罩或呼吸器口罩。他们的结论是，仅捕捉50%呼出的飞沫的自制覆盖物将提供“人口层面的好处”。\n众所周知，戴口罩主要是保护别人不受自己的伤害，而不是反过来。这不是你认为别人是危险的迹象。\n“科学焦点”援引该研究的主要作者理查德·斯图特博士的话说：“我们的分析支持公众立即普遍采用口罩。”\n斯图特是剑桥大学植物科学系的一个研究小组的成员，该小组通常对作物病害的传播进行建模。\n阿拉米达县和旧金山市卫生官员要求居民在离开家的任何时候都要戴上面罩，并在30英尺内接近任何不住在他们家里的人。\n在旧金山、康特拉科斯塔、马林、纳帕、圣克拉拉、圣马特奥和索诺马县(以及欢乐山市和弗里蒙特市)，人们离开家去超市、药店或医生等必需品场所时，必须使用基本的非医疗口罩，包括围巾和头巾，以遮住鼻子和嘴巴。", "note_en": "We&#39;ve all heard it many times: Wear a face covering — indoors, outdoors, on trains and buses. At work, in the supermarket and at church.\n   But now a new modeling study out of Cambridge and Greenwich universities suggests that face masks may be even more important than originally thought in preventing future outbreaks of the new coronavirus.\n   To ward off resurgences, the reproduction number for the virus (the average number of people who will contract it from one infected person) needs to drop below 1.0. Researchers don’t believe that’s achievable with lockdowns alone. However, a combination of lockdowns and widespread mask compliance might do the trick, they say.\n      “We show that, when face masks are used by the public all the time (not just from when symptoms first appear), the effective reproduction number, Re, can be decreased below 1, leading to the mitigation of epidemic spread,” the scientists wrote in the paper published Wednesday by the  Proceedings of the Royal Society A.\n          The modeling indicated that when lockdown periods are combined with 100% face mask use, disease spread is vastly diminished, preventing resurgence for 18 months, the time frame that has frequently been cited for developing a vaccine. It also demonstrated that if people wear masks in public, it is twice as effective at reducing the R number than if face coverings are only worn after symptoms appear.\n       The masks don’t have to be top-of-the-line surgical or respirator masks. Homemade coverings that catch only 50 percent of exhaled droplets would provide a “population-level benefit,” they concluded.\n       As has been well-publicized, wearing a mask primarily protects others from yourself, rather than the other way around. It is not a sign that you consider others a danger.\n   Science Focus quoted the study’s lead author, Dr Richard Stutt, as saying, “Our analyses support the immediate and universal adoption of face masks by the public.”\n   Stutt is part of a team that usually models the spread of crop diseases at Cambridge’s department of plant sciences.\n   Alameda County and San Francisco city health officials require residents to wear face coverings any time they leave home and get within 30 feet of anyone not living in their household.\n   In San Francisco, Contra Costa, Marin, Napa, Santa Clara, San Mateo and Sonoma counties (plus the cities of Pleasant Hill and Fremont) people must use basic nonmedical, cloth masks, including scarves and bandannas, to cover their noses and mouths when they leave home to go to essential places like the supermarket, drugstore or doctor.", "posttime": "2020-06-12 03:13:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "口罩,mask", "title": "研究：100%使用口罩可粉碎第二波、第三波新冠肺炎波", "title_en": "Study: 100% face mask use could crush second, third Covid-19 wave", "transed": 1, "url": "https://www.sfgate.com/science/article/Study-100-face-mask-use-could-crush-second-15333170.php", "via": "", "real_tags": ["口罩", "mask"]}, {"category": "", "categoryclass": "", "imagename": "68cb75c27915854b668d13bb0e8280f2.png", "infoid": 1006178, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据首席执行官苏珊·沃西基(Susan Wojcicki)说，该公司宣布了一项为期多年、耗资1亿美元的基金，致力于“放大和发展黑人创作者和艺术家及其故事的声音”。\n“在YouTube，我们相信黑人的生命很重要，我们都需要做更多的事情来消除系统性种族主义，”沃西基在一篇博客文章中写道。我们致力于作为一个集中和放大黑人声音和观点的平台做得更好。\n沃西基宣布，本周六，也就是6月13日，YouTube将举办由YouTube Originals制作的名为“熊目击者，采取行动”的直播筹款活动，这是根据新倡议为内容提供资金的一个例子。\n由和主办的“熊目击者，采取行动”将由圆桌讨论和小组讨论，强有力的现场时刻，音乐致敬等构成。活动于美国东部时间6月13日(星期六)下午6点/太平洋时间下午3点开始。据YouTube称，这部特辑将旨在激励和联合关键而有意义的声音(YouTube创作者、有影响力的公众人物、著名的活动家声音)，以创造变革，提高意识，并为种族正义筹集资金。\n此外，在整个6月份，YoutTube的Spotlight频道将突出种族正义问题，包括YouTube上黑人社区的最新观点，以及历史内容、教育视频和抗议报道。据报道，这些内容展示了几个世纪以来争夺股权的极其重要的故事。\nYouTube原创内容全球主管苏珊·丹尼尔斯(Susanne Daniels)表示：“我支持”黑人生命也是命“(Black Lives Matter)运动，我认为我们必须帮助放大黑人的声音，继续关于有意义的变革和种族正义的对话。”“YouTube有一种独特的能力，可以团结黑人社区内的创作者、艺术家和强大的声音，鼓励世界站出来为种族正义发声。”\n“熊目击者，采取行动”将由圆桌讨论和小组讨论、现场时刻、音乐悼念-包括约翰·传奇和特雷·宋兹的表演-以及更多内容组成。将鼓励观众直接在YouTube直播上捐款支持平等司法倡议。\n主持人包括Jemele Hill、Roland S.Martin和Soledad O‘Brien；小组成员包括Ambers Closet、KimberléCrenshaw、Patrisse Cullors、Kimberly N.Foster、Alicia Garza、Roxane Gay、Eddie Glaude、Kimberly Jones、Jouelzy、MN Fats、Prince EA、Rashad Robinson、Bakari Sellers、Michael Skolnik、Chaz Smith和Baratunde瑟斯顿。Que，Jarvis Landry，Alonzo Lerone，Indya Moore，Jeff Okudah，Laviska Shault Jr.，Bryan Stevenson，sWooZie和Wilmer Valderrama。\n《熊目击者，行动起来》由勒布朗·詹姆斯的SpringHill Entertainment、Fly on the Wall和Byron Phillps出品。雷金纳德·哈德林(Reginald Hudlin)担任执行制片人和节目制片人。", "note_en": "announced a multiyear, $100 million fund dedicated to “amplifying and developing the voices of Black creators and artists and their stories,” according to CEO Susan Wojcicki.\n “At YouTube, we believe Black lives matter and we all need to do more to dismantle systemic racism,” Wojcicki wrote in a blog post. “We’re committed to doing better as a platform to center and amplify Black voices and perspectives.\n As an example of content being funded under the new initiative, Wojcicki announced that this Saturday, June 13, YouTube will host livestream fundraising event produced by YouTube Originals, called “Bear Witness, Take Action.”\n Hosted by   and  , “Bear Witness, Take Action” will be structured with roundtable discussions and panels, powerful live moments, musical tributes and more. The event kicks off Saturday, June 13, at 6pm ET / 3pm PT. The special will aim to inspire and unite key and meaningful voices (YouTube creators, influential public figures, prominent activist voices) to create change, heighten awareness and raise funding for racial justice, according to YouTube.\n  In addition, throughout the month of June, YoutTube’s Spotlight channel will highlight racial justice issues, including the latest perspectives from the Black community on YouTube alongside historical content, educational videos, and protest coverage. This content showcases incredibly important stories about the centuries-long fight for equity, according to .\n “I support the Black Lives Matter movement and I think it’s imperative that we help amplify Black voices and continue the conversation about meaningful change and racial justice,” said Susanne Daniels, YouTube’s global head of original content. “YouTube has a unique ability to unite creators, artists and powerful voices within the Black community to encourage the world to stand up and speak out for racial justice.”\n “Bear Witness, Take Action” will be structured with roundtable discussions and panels, live moments, musical tributes — including performances from John Legend and Trey Songz — and more. Viewers will be encouraged to donate to support the  Equal Justice Initiative directly on the YouTube livestream.\n Moderators include Jemele Hill, Roland S. Martin and Soledad O’Brien; panelists include Ambers Closet, Kimberlé Crenshaw, Patrisse Cullors, Kimberly N. Foster, Alicia Garza, Roxane Gay, Eddie Glaude, Kimberly Jones, Jouelzy, MN FATS, Prince EA, Rashad Robinson, Bakari Sellers, Michael Skolnik, Chaz Smith and Baratunde Thurston; special guests Tremayne Anchrum, Carmelo Anthony, AyChristeneGames, Danielle Bainbridge, Essang Bassey, Shalom Blac, Asante Blackk, Sterling K. Brown, Hakeem Butler, Duke Dawson, De’arra &amp; Ken, Khadi Don, Rasul Douglas, Teala Dunn, Bryce Hall, Skai Jackson, Jamilla &amp; Que, Jarvis Landry, Alonzo Lerone, Indya Moore, Jeff Okudah, Laviska Shenault Jr., Bryan Stevenson, sWooZie and Wilmer Valderrama.\n “Bear Witness, Take Action” is produced by LeBron James’ SpringHill Entertainment, Fly on the Wall and Byron Phillps. Reginald Hudlin serves as executive producer and showrunner.", "posttime": "2020-06-12 02:56:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "苹果,app,youtube,apple,艺术", "title": "苹果公司发起1亿美元种族正义倡议；YouTube为黑人创作者和艺术家设立1亿美元基金", "title_en": "Apple Launches $100 Million Racial Justice Initiative; YouTube Creates $100 Million Fund for Black Creators and Artists", "transed": 1, "url": "https://variety.com/2020/digital/news/youtube-100-million-fund-black-creators-artists-common-keke-palmer-1234631840/", "via": "", "real_tags": ["苹果", "app", "youtube", "apple", "艺术"]}, {"category": "", "categoryclass": "", "imagename": "fd93c5ba89bc7aeeb77dc980b7d1ece7.png", "infoid": 1006177, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "镜头-Kubernetes IDE。通过在GitHub上创建帐户，为lensapp/lens开发做出贡献。", "note_en": "Lens - The Kubernetes IDE. Contribute to lensapp/lens development by creating an account on GitHub.", "posttime": "2020-06-12 02:55:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "kubernetes", "title": "Lens(Kubernetes IDE)v3.5.0-RC.1", "title_en": "Lens (The Kubernetes IDE) v3.5.0-RC.1", "transed": 1, "url": "https://github.com/lensapp/lens/releases/tag/v3.5.0-rc.1", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "b03615a850b437c519a31525a29228d8.png", "infoid": 1006176, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个新的在线平台，可以追踪世界各地的空气污染，现在可以向公众开放。这些地图使用了哥白尼哨兵5P卫星的数据，使用14天移动平均数显示了二氧化氮的平均浓度。这些地图不仅显示了全球范围内随着时间的变化，而且还为用户提供了放大到感兴趣的区域的可能性，例如欧洲的任何城市或地区。\n平均地图也反映了新冠肺炎封锁的影响-在许多地区都可以看到二氧化氮浓度的急剧下降。这些效应现在可以很容易地在全球范围内探索。\n由于排放量的波动，以及日照、温度和风等天气条件的变化，我们大气中的二氧化氮浓度每天变化很大，所有这些都会影响气体在大气中的寿命。\n出于这些原因，有必要在相当长的一段时间内--在这种情况下是14天--分析数据，因为它允许准确绘制和分析全球各地的二氧化氮浓度。\n二氧化氮是由发电厂、车辆和其他工业设施产生的，会对人类健康产生重大影响-增加出现呼吸问题的可能性。\n由于空气质量令人严重担忧，哥白尼哨兵5P卫星于2017年发射，以绘制全球范围内的多种空气污染物地图。Copernicus Sentinel-5P搭载了Tropomi仪器，这是一种最先进的仪器，可以探测大气气体的独特指纹，以比以往任何时候都更准确和更高的空间分辨率对空气污染物进行成像。\n地图门户是哨兵-5P产品算法实验室(S5P-PAL)的一部分，S5P-PAL是由欧盟委员会资助的一个正在进行的项目。S5P-PAL是一个项目，它允许快速、低成本地开发哨兵-5P原型产品(例如，溴、一氧化碳和水蒸气)，并生成更高级别的产品，如全球地图。目前正在开发一氧化碳产品的新测绘门户和其他功能，例如选择区域和时间段来调查测量时间序列。\nS5P-PAL也是新的“针对冠状病毒和地球观测的快速行动”仪表盘的一部分，也被称为RACE。该平台提供关键的环境、经济和社会指标，以衡量冠状病毒封锁的影响，并监测封锁后的恢复情况。\n哥白尼哨兵是一支由欧盟拥有的专用卫星组成的舰队，旨在提供丰富的数据和图像，这些数据和图像对欧盟的哥白尼环境计划至关重要。欧盟委员会领导和协调这一计划，以改善环境管理，保障每天的生命安全。欧空局负责空间部分，负责代表欧洲联盟开发哥白尼哨兵系列卫星，并确保哥白尼服务的数据流通，而哥白尼哨兵卫星的业务则委托给欧空局和欧洲气象卫星组织。", "note_en": "A  new online platform that allows for the tracking of air pollution worldwide is now available to the public. The maps, which use data from the Copernicus Sentinel-5P satellite, show the averaged nitrogen dioxide concentrations using a 14-day moving average. The maps not only show changes over time on a global scale, but also provide the possibility for users to zoom in to areas of interest, for example any city or region over Europe.\n The averaged maps also reflect the effects of the COVID-19 lockdown – with drastic reductions of nitrogen dioxide concentrations visible over many areas. These effects can now be easily explored across the globe.\n Nitrogen dioxide concentrations in our atmosphere vary widely on a day-to-day basis owing to the fluctuations of emissions, as well as variations in weather conditions such as sunlight, temperature and wind, all of which can affect the lifetime of the gas in the atmosphere.\n For these reasons, it is necessary to analyse data over a substantial period of time – in this case 14 days – as it allows for the accurate mapping and analysis of nitrogen dioxide concentrations across the globe.\n Nitrogen dioxide is produced from power plants, vehicles and other industrial facilities and can have significant impacts on human health – increasing the likelihood of developing respiratory problems.\n With air quality a serious concern, the  Copernicus Sentinel-5P satellite was launched in 2017 to map a multitude of air pollutants around the globe. Copernicus Sentinel-5P carries the Tropomi instrument – a state-of-the-art instrument that detects the unique fingerprint of atmospheric gases to image air pollutants more accurately and at a higher spatial resolution than ever before.\n The mapping portal is part of the Sentinel-5P Product Algorithm Laboratory (S5P-PAL) – an ongoing project funded by the European Commission. S5P-PAL is a project that allows fast and cost-efficient Sentinel-5P prototype product development (for example bromine monoxide and water vapour) and the generation of higher level products like global maps. New mapping portals for the carbon monoxide product and additional functionalities, for example the selection of an area and time-period to investigate time-series of measurements, are currently in development.\n  The S5P-PAL is also part of the new ‘Rapid Action on Coronavirus and Earth observation’ dashboard, also known as  RACE. The platform provides access to key environmental, economic and social indicators to measure the impact of the coronavirus lockdown and monitor post-lockdown recovery.\n  The Copernicus Sentinels are a fleet of dedicated EU-owned satellites, designed to deliver the wealth of data and imagery that are central to the European Union&#39;s Copernicus environmental programme. The European Commission leads and coordinates this programme, to improve the management of the environment, safeguarding lives every day. ESA is in charge of the space component, responsible for developing the family of Copernicus Sentinel satellites on behalf of the European Union and ensuring the flow of data for the Copernicus services, while the operations of the Copernicus Sentinels have been entrusted to ESA and EUMETSAT.", "posttime": "2020-06-12 02:55:17", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "全球,space,哥白尼", "title": "欧洲航天局全球空气污染地图现已面世", "title_en": "European Space Agency Global air pollution maps now available", "transed": 1, "url": "http://www.esa.int/ESA_Multimedia/Images/2020/06/Global_air_pollution_maps_now_available", "via": "", "real_tags": ["全球", "space", "哥白尼"]}]