[{"category": "", "categoryclass": "", "imagename": "b07aa62c298184cb88efa14ac8109b05.jpg", "infoid": 1069042, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自 1963 年西尔维娅·普拉斯 (Sylvia Plath) 去世后，她就变成了一个粗俗的悲剧象征。莉莲·克劳馥问道，随着她启发更多传记，我们是否会更接近“真正的”普拉斯。当一位女作家自杀身亡时，它定义了她。从弗吉尼亚伍尔夫到莎拉凯恩，她所做的一切，她一生中创造的一切都成为死亡驱动叙事的一部分。一位男性作家过早去世，这是他创作成果的悲剧性阻碍——例如，我们哀悼迪伦·托马斯（Dylan Thomas）在 1953 年 39 岁去世后从未写过的诗歌，这与他自我毁灭的生活方式截然不同。伍尔夫的小说和凯恩的戏剧被称为是精神疾病的表现，而托马斯的诗歌虽然不是因为他酗酒和生活困难，但仍然非常出色。更像这样：在那些被自杀定义的女性艺术家中，最主要的是美国诗人和小说家西尔维娅·普拉斯，她于 1963 年 2 月 11 日去世。从那时起，她的名字就成了女性焦虑的代名词。她的作品代表了叛逆但沮丧的年轻女性，她们在流行文化背景中的出现证明了这一点——1999 年青少年 rom-com 中的 Kat 手握钟罩的副本，就像最近 Netflix 系列性教育中的梅芙一样.普拉斯已成为局外人女孩的粗略象征，她拒绝传统的女性气质标准，将自己的生死掌握在自己的手中。这种解释扩散的影响是贬低女性与普拉斯的交往。例如，阅读她的成年小说《钟形罩》，被许多人视为一种少女般的严肃文学的成人礼，这种看法经常反映在 YA 风格的封面设计中。从 JD Salinger 到 David Foster Wallace 的作品，男性成年的叙事并非如此。但事实是，普拉斯是最早深入了解女性原始现实的作者之一。在女权主义第二波和贝蒂弗里丹的《女性的奥秘》之前，普拉斯写到了她对女性劣等地位的不满、她的性冲动，以及这些压力如何影响她的心理健康。同时，钟罩和普拉斯的诗歌都是虚构的。它们以普拉斯的生活经历为基础，就像所有文学作品一样，但它们当然不是直接的自传。传记经常引用普拉斯的作品作为现实生活事件的证据，而且，就像安妮史蒂文森的《苦涩名声》一样，用它们来声称普拉斯总是很沮丧；史蒂文森以令人震惊的声明结束了关于她年轻的一章：“自杀的想法在她的脑海中形成，就像最终的、不可逆转的无花果一样”，指的是《钟形瓶》中的著名比喻，女主人公埃丝特·格林伍德将她所有潜在的未来视为无花果在一棵无花果树上。类似的偏见继续影响有创造力的女性，因此她们被视为使用艺术作为治疗而被驳回。我们与普拉斯面临的问题是，她生死的神话让她很难将她的艺术与此分开——但无论如何，也知道谁是“真正的”西尔维娅·普拉斯。然而，了解普拉斯的愿望推动了一个行业。一本声称比以前更了解她生活的新传记越来越频繁地出现在书架上，其中仅在过去 18 个月就出版了三本著名的传记。其中一本书，卡尔·罗利森 (Carl Rollyson) 的《西尔维娅·普拉斯的最后日子》(The Last Days of Sylvia Plath)，于 2020 年 3 月出版，仅关注她的自杀。另一本由盖尔·克劳瑟 (Gail Crowther) 于 4 月出版的《丽兹酒店的三个马提尼下午》(Three-Martini Afternoons at the Ritz) 是普拉斯 (Plath) 和波士顿诗人安妮·塞克斯顿 (Anne Sexton) 的双重传记，他们于 1959 年在诗人罗伯特·洛厄尔 (Robert Lowell) 举办的作家研讨会上相识。 第三本书是希瑟 (Heather)克拉克的巨著《红色彗星》：去年 10 月出版，与克劳瑟的作品一起，是第一部充分利用普拉斯最近出版的、完整且未删节的信件的书籍之一，并故意颠覆了以死亡为中心的相反方向早期书籍的年表。尽管这些书可能希望从全新的角度理解普拉斯，但可以说，他们的使命正变得越来越具有挑战性，因为准备取代它们的评论和传记作品源源不断，以及她档案中不断增加的已出版材料。她的传记甚至还有一本传记：1994 年，上个月去世的伟大的纽约客作家珍妮特马尔科姆出版了《沉默的女人》，这是对普拉斯书籍（包括史蒂文森有争议的《苦名》）的研究，试图考虑影响决定传记写作的性质。\n在准备她的书时，马尔科姆联系了奥尔文休斯，奥尔文休斯，普拉斯丈夫的妹妹，诗人泰德休斯，以及她遗产的文学执行人，寻求与泰德的采访以补充她的研究。她收到的回应是对“西尔维娅·普拉斯的神话”的扩展、自发的批评，奥尔文认为这是普拉斯本人和普拉斯的母亲奥瑞莉亚共同推动的，奥尔文声称她“为精神疾病感到羞耻”，并确定只有她女儿的“最好的一面”会被记住。奥尔文感到震惊，她继续说，作家和公众对普拉斯的家人缺乏“人情味”，结果“完全改变了[她]对人的整个态度”。然而，马尔科姆在《沉默的女人》中取得的成就是提醒我们普拉斯不是神话，而是一个和我们一样生活和呼吸的女人。通过将自己带入故事中，以反思自己在西尔维娅·普拉斯 (Sylvia Plath) 死后叙事中的角色——而不是假装客观——马尔科姆写了迄今为止关于诗人的最人性化的书。奥尔文对奥蕾莉亚·普拉斯的批评最明确地针对她编辑和出版西尔维亚的《家书》。该集出版于 1975 年，收录了西尔维娅·普拉斯 (Sylvia Plath) 与她母亲的信件，从她 50 年代初在史密斯学院到 1963 年她生命的尽头。正如珍妮特·马尔科姆 (Janet Malcolm) 在《沉默的女人》(The Silent Woman) 中所记录的那样，奥尔温将《回家的信》视为对“锤击 [奥瑞莉亚] 采取”的回应来自她在钟罩中作为以斯帖母亲的虚构描述，以及几首诗，包括美杜莎和令人不安的缪斯。 1971 年，Aurelia 写信给 The Bell Jar 的美国出版商，要求 Ted 不要发布它，哀叹说，由于将她描绘成一个冷漠的监工，“因为这本书本身就是最卑鄙的忘恩负义” .相比之下，选择“Sivvy”中的溺爱信件，旨在表明他们之间存在着深厚的母女关系。奥蕾莉亚希望将这些信件分两卷而不是一卷出版，但由于出版商的限制，她压缩了她的收藏。直到 2017-8 年，未删节的信件才出版，由 Peter K Steinberg 和 Karen V Kukil 编辑。该系列展示了普拉斯与朋友、恋人和家人通信时所用的不同书面声音，揭示了一个比 Letters Home 创造的一维女儿更为复杂和人性化的作家。与之前的收藏不同，这些卷也没有对原始语言进行编辑，也没有 Aurelia 的个人介绍或她的任何其他评论。连同普拉斯未删节的期刊，之前由 Faber &amp; Faber 于 2000 年在泰德·休斯的许可下出版，这些信件代表了普拉斯选择看到的样子，尽管无意将它们提供给读者。根据马尔科姆在《沉默的女人》中的说法，在《回家的信》出版后，“这个传奇开始了，成为一部以最完美、最具体的现实主义为背景拍摄的庞大而庞大的电影小说”。随着 2003 年由格温妮丝·帕特洛 (Gwyneth Paltrow) 主演的传记片《西尔维亚》(Sylvia) 的制作，这些电影场景变成了现实。普拉斯的女儿弗里达休斯写了一首诗批评这部电影；她说，它的目的是为了娱乐“吃花生的人”，暗指她母亲的诗《拉撒路夫人》，她在诗中描述了“吃花生的人群”要“解开我的手和脚---/大脱衣舞”。鉴于传记作者在试图对普拉斯有一个清晰的认识时所面临的问题，值得询问关于她的生活的新书可以提供什么。考虑到普拉斯神话的广泛性，很难区分那些试图通过揭示她死亡的病态细节来获利的书籍，以及那些试图将公众注意力重新调整到她的文学重要性的书籍。罗利森的《西尔维娅·普拉斯的最后日子》在其标题中宣布它落入了前阵营，并承诺在导致她自杀的事件中提供前所未有的细节。像马尔科姆这样的女权主义作家谴责将普拉斯的生活和性格降低到她抑郁最严重的时期。只要这种还原方法持续存在，学者就需要通过其他方法来反击。克劳瑟之前关于普拉斯的作品，包括《闹鬼的读者》（2017 年）和《这些幽灵档案》（2017 年），专注于她今天的理解方式，她说她第一次遇到普拉斯是在她 13 岁时阅读了她 1961 年的诗《镜子》在学校图书馆里。至于为什么她将研究重点放在普拉斯身上，克劳瑟引用了伊丽莎白鲍文的说法，即受试者会找到他们的研究人员，而不是相反。特别是，她告诉 BBC Culture，她觉得普拉斯被一些传记作者通过“懒惰和不准确的刻板印象”描述为“某种‘注定要失败的人物’”的方式感到不公正。她试图在自己的作品中与这一点作斗争，展示“普拉斯作为女性的生活经历对她的写作至关重要”，并剖析了她今天继续拥有的吸引力。克劳瑟关于普拉斯的第三本也是最新的书《丽兹酒店的三个马提尼下午》着重讲述了普拉斯与诗人塞克斯顿的相识，以展示他们的会面如何影响了他们各自的工作。塞克斯顿本人在 1963 年的讣告诗《西尔维娅之死》中为普拉提亚神话增添了活力，她在其中称她的朋友为“小偷！因为爬进“我非常想要的死亡”。 1974 年，她也因自杀身亡，享年 45 岁，这一事实促使人们将其与普拉斯同时进行比较。然而，塞克斯顿是一个更有问题的主题。 1990 年代初，她的女儿琳达·格雷·塞克斯顿 (Linda Gray Sexton) 透露，她的母亲对她进行了性虐待——这与弗里达·休斯 (Frieda Hughes) 与普拉斯 (Plath) 的幸福关系形成了鲜明对比。\n如果强调这些女性的个人主义很重要，那么这本双重传记就难免有相似之处——例如，克劳瑟在各自的论文中反复将香烟灼伤的形象浪漫化，却没有提到塞克斯顿是一个终生抽烟的人，而普拉斯则没有。直到 1962 年她与泰德·休斯分手之前，她才碰一根烟。模糊的语言被用来在诗人之间描绘出比实际更多的相似之处，与普拉斯的整洁和塞克斯顿慵懒的外表之间的对比形成鲜明对比。这种本质区别存在于他们的诗歌中，尽管这本书不涉及文学分析。在阅读他们各自的诗歌时，只有塞克斯顿明确写下了月经和手淫，而普拉斯则通过文学和神话的镜头探索了女性身份和母性的主题。普拉斯更喜欢隐喻和典故；塞克斯顿说的都是事实。撇开她自己的书不谈，克劳瑟希望我们能更接近普拉斯在文化想象中的更全面定位。她说，特别是未删节的信件的出版“使镜头向后倾斜，让我们能够欣赏她在通信中使用的多种声音”，而不仅仅是给她母亲写信的“Sivvy”。通过这些新系列，“我们听到了她过去写给朋友、恋人、同事、她的商业信件的声音，这一切都让我们更全面地了解她的幽默、她的热情、她的效率以及她管理她的技巧。自己写的。”更重要的是，克劳瑟说，让我们可以听到这些不同的声音表明“她如何在这些角色之间无缝切换，从个人到专业”，以及她在这样做时非凡的情感范围。然而，也许相反，西尔维娅·普拉斯的“版本”之多只会让我们无法知道哪些是真实的。迄今为止，普拉斯最详尽的传记是克拉克的红色彗星。当被问及她写这本书的目的时，克拉克告诉 BBC 文化，她想表明普拉斯“近乎恒定的主题不是抑郁，而是成为作家的神圣追求”。她在牛津大学攻读北爱尔兰诗人博士学位时开始对普拉斯感兴趣。此前，由于媒体对普拉斯的主要描绘，她“已经沦为普拉斯是黑暗和厄运的化身的还原观念的牺牲品”。然而，通过阅读她正在教的课堂上的作品，克拉克意识到她“非常老练、机智，而且是的，很有趣”，这让她渴望推翻卖给她的“性别歧视谎言”。由此产生的书是任何作家最接近普拉斯生平和工作的详尽传记的书。克拉克还讨论了普拉斯与塞克斯顿的关系，阐明了他们的差异以及普拉斯对塞克斯顿的重要性，反之亦然。这本书给人的印象是丰富而复杂的生活，超出了它之前的短得多的作品中所表现出来的任何东西。偶尔，她确实暗示了普拉斯的命运，这在伏笔方面是错误的，包括关于“钟罩下降”的诗意盛行，这有损于她原本力求的真实性。有趣的是，即使在这些书中如此意识到推测和神话对普拉斯的看法所产生的危险影响，他们也可能不时陷入这种境地。尽管如此，克拉克对普拉斯的学术正在以丰富的方式发展持乐观态度。她的博士生们避开了传统的女权主义者将普拉斯作为她的时代之前作为作家的关注，这种关注主导了最近的学术话语，她的博士生正在从跨国和残疾的角度看待普拉斯的作品。反过来，这些角度对于考虑普拉斯旅行的影响以及她在英国作为美国人感到的身份不协调对她的写作产生的影响很重要。以及观察普拉斯的精神疾病如何反映在她的生活和工作中，同时也考虑到在心理健康不如今天了解的时代所带来的耻辱。随着普拉斯档案的扩展，这些新方法继续为他们提供更多的源材料。除了这些信件的出版外，美国史密斯学院普拉斯档案馆馆长库基尔现在正与纽约理工学院英语副教授阿曼达·戈登合作，对这本书进行了扩充和修正。诗集，之前由泰德·休斯编辑，将由 Faber &amp; Faber 出版。也有可能有一天，普拉斯遗失的小说《Double Take》和另外两本期刊的不完整手稿可能会浮出水面。然而，无论剩下什么出现，普拉斯总是比大多数文化偶像更像是一个谜——部分原因是她英年早逝，这意味着她从未有机会以自己的方式讲述她的故事。部分地，正如越来越明显的那样，由于普拉斯能够在不同的环境和不同的人中采用多种角色，因此很难知道她什么时候是真诚的，什么时候她是带着苦笑写的脸。我们可能会继续认为我们对她是谁有了更清晰的印象，但“真正的”西尔维娅·普拉斯仍然难以捉摸。\n如果您想评论这个故事或您在 BBC Culture 上看到的任何其他内容，请前往我们的 Facebook 页面或在 Twitter 上给我们留言。如果您喜欢这个故事，请注册每周 bbc.com 专题通讯，称为基本列表。从 BBC 未来、文化、工作生活和旅行中精心挑选的故事，每周五发送到您的收件箱。", "note_en": "Since Sylvia Plath died in 1963, she&#39;s been turned into a crudely tragic symbol. As she inspires more biographies, will we ever get closer to the &#39;real&#39; Plath, asks Lillian Crawford.\n When a female author dies by suicide, it defines her. From Virginia Woolf to Sarah Kane, everything she did, everything she created during her life becomes part of a death-drive narrative. When a male author dies prematurely, it is a tragic stopper in his creative output – we mourn the poetry Dylan Thomas never wrote after he died aged 39 in 1953, for example, distinct from his self-destructive lifestyle. Woolf&#39;s novels and Kane&#39;s plays are dubbed as being manifestations of mental illness, while Thomas&#39;s poetry is brilliant in spite of, rather than because of, his alcoholism and troubled life.    More like this:\n    Chief among those female artists who have become defined by their suicide is the US poet and novelist Sylvia Plath, who died on 11 February 1963. Since then, her name has become a by-word for female angst. Her works represent rebellious but depressed young women as evidenced by their appearance in pop-culture settings – Kat in the 1999 teen rom-com 10 Things I Hate About You clutches a copy of The Bell Jar, as does Maeve in recent Netflix series Sex Education. Plath has become a crude symbol of the girl outsider who rejects conventional standards of femininity to take her life, and death, into her own hands.\n  The impact of this interpretation&#39;s proliferation is to devalue women&#39;s engagements with Plath. To read her coming-of-age novel The Bell Jar, for example, is seen by many as a girlish rite of passage towards more serious literature, a perception often  reflected in the YA-style cover designs. This isn&#39;t the case for narratives of male comings-of-age, from the works of JD Salinger to David Foster Wallace. But the truth is that Plath was one of the first authors to tap into the raw reality of being a woman. Before feminism&#39;s second wave and Betty Friedan&#39;s The Feminine Mystique, Plath wrote of her discontent with a woman&#39;s inferior place, her sexual urges, and how these pressures affected her mental health.\n At the same time, The Bell Jar and Plath&#39;s poetry are works of fiction. They are grounded in Plath&#39;s lived experience, as all literature must be, but they are not, of course, direct autobiography. Biographies often cite Plath&#39;s works as evidence for real-life events, and, as is the case with Anne Stevenson&#39;s Bitter Fame, use them to claim Plath was always depressed; Stevenson ends a chapter about her youth with the egregious statement: &#34;The idea of suicide formed in her mind like the ultimate and irrevocable fig&#34;, referring to the famous metaphor from The Bell Jar where the heroine Esther Greenwood sees all her potential futures as figs on a fig tree. A similar prejudice has continued to affect creative women, whereby they are dismissed as using art as therapy. The problem we face with Plath is that the mythos of her life and death has made it difficult to disentangle her art from that – but also know who the &#34;real&#34; Sylvia Plath was, in any case.\n  The desire to know Plath has nevertheless fuelled an industry. A new biography claiming to shed more light on her life than before appears on bookshelves with increasing regularity, including three notable releases in the past 18 months alone. One of these books, The Last Days of Sylvia Plath by Carl Rollyson, published in March 2020, focuses solely on her suicide. Another, Three-Martini Afternoons at the Ritz by Gail Crowther, published in April, is a dual biography of Plath and fellow Bostonian poet Anne Sexton, who met at a writers&#39; seminar held by poet Robert Lowell in 1959. The third book is Heather Clark&#39;s massive biography Red Comet: published last October, it is, alongside Crowther&#39;s, one of the first books about Plath to make full use of the recently-published, full and unabridged volumes of her letters, and deliberately subverts the reverse, death-focused chronology of earlier tomes.\n Even as these books may hope to understand Plath from a fresh perspective, their mission is arguably rendered ever more challenging by the steady stream of critical and biographical works ready to supplant them, alongside the ever-increasing volume of published material from her archive. There has even been a biography of her biographies: in 1994, the great New Yorker writer Janet Malcolm, who died last month, published The Silent Woman, a study of Plath books (including Stevenson&#39;s controversial Bitter Fame) which sought to consider the forces of influence which determine the nature of biographical writing.\n When preparing her book, Malcolm contacted Olwyn Hughes, the sister of Plath&#39;s husband, the poet Ted Hughes, and the literary executor of her estate, seeking an interview with Ted to supplement her research. The response she received was an  extended, unprompted critique of the &#34;myth of Sylvia Plath&#34;, something Olwyn believed was fuelled by a combination of Plath herself and Plath&#39;s mother, Aurelia, who was, Olwyn claimed, &#34;ashamed of the mental illness&#34;, and determined that only her daughter&#39;s &#34;best side&#34; was remembered. Olwyn was horrified, she went on, by a lack of &#34;human feeling&#34; shown by writers and the public for Plath&#39;s family and had as a result &#34;totally changed [her] entire attitude to people&#34;. However, what Malcolm achieved with The Silent Woman was to remind us that Plath was not a myth, but a woman who had lived and breathed as we do. By bringing herself into the story in order to reflect on her own role within the posthumous narrativisation of Sylvia Plath – rather than acting under the pretence of objectivity – Malcolm wrote the most human book on the poet to date.\n  Olwyn&#39;s criticism of Aurelia Plath was most explicitly targeted towards her editing and publication of Sylvia&#39;s Letters Home. This collection, published in 1975, compiled correspondence from Sylvia Plath to her mother, from her time at Smith College in the early 50s until the end of her life in 1963. As recorded by Janet Malcolm in The Silent Woman, Olwyn saw Letters Home as a response to &#34;the hammering [Aurelia] took&#34; from her fictionalised depiction in The Bell Jar as Esther&#39;s mother, as well as several poems, including Medusa and The Disquieting Muses. In 1971, Aurelia had written to The Bell Jar&#39;s US publisher and asked Ted not to release it, lamenting that, with its thinly-veiled portrayal of her as an unsympathetic taskmaster, &#34;as this book stands by itself, it represents the basest ingratitude&#34;. By contrast, the selection of doting letters from &#34;Sivvy&#34;, was intended to show that there had been a deep mother-daughter bond between them. Aurelia hoped to publish the letters in two volumes rather than one, but because of restrictions imposed by the publisher, she condensed her collection.\n  It wasn&#39;t until 2017-8 that the unabridged letters were published, edited by Peter K Steinberg and Karen V Kukil. This collection demonstrated the different written voices with which Plath corresponded with friends, lovers, and family, revealing a more complex and human writer than the one-dimensional daughter created by the Letters Home. Unlike that previous collection, these volumes are also presented without edits to the original language, and without either a personal introduction from Aurelia or any additional commentary from her. Along with Plath&#39;s unabridged journals, previously published by Faber &amp; Faber in 2000 with permission from Ted Hughes, these letters represent Plath as she chose to be seen, albeit without the intention of them being made available to the reading public.\n According to Malcolm in The Silent Woman, it was after the publication of Letters Home that &#34;the legend opened out, to become a vast, sprawling movie-novel filmed on sets of the most consummate and particularised realism&#34;. Those film sets became a literal reality with the production of the 2003 biopic Sylvia, starring Gwyneth Paltrow. Plath&#39;s daughter Frieda Hughes wrote a poem criticising the film; its purpose was to entertain &#34;the peanut-eaters&#34;, she said, alluding to her mother&#39;s poem Lady Lazarus, in which she describes “The peanut-crunching crowd” going to “unwrap me hand and foot --- / The big strip tease”.\n  In light of the problems which biographers have faced in trying to gain a clear view on Plath, it is worth asking what new books about her life can have to offer. Given the widespread nature of the Plathian myth, it can be hard to distinguish books trying to cash in on revealing morbid details about her death, from those attempting to realign public focus to the importance of her literature. Rollyson’s The Last Days of Sylvia Plath announces in its title that it falls into the former camp, promising unprecedented detail in the events that led to her suicide. It’s the sort of book feminist writers like Malcolm deplore for reducing Plath’s life and character to the worst period of her depression. As long as this reductive approach persists, there will be need for scholars to counter it through other approaches.\n Crowther, whose previous work on Plath, including the books The Haunted Reader (2017) and These Ghostly Archives (2017), has focused on how she is understood today, says that she first came across Plath aged 13 when she read her 1961 poem Mirror in the school library. As to why she has focused her study on Plath, Crowther cites Elizabeth Bowen&#39;s claim that subjects find their researchers, not the other way round. In particular, she tells BBC Culture, she felt a sense of injustice in the way Plath has been portrayed by some biographers as &#34;some sort of &#39;doomed figure&#39;&#34; through &#34;lazy and inaccurate stereotyping&#34;. She has sought to combat that in her own work, in showing how &#34;Plath&#39;s lived experience as a woman was crucial to her writing&#34; and dissecting the appeal she continues to have today.\n  Crowther&#39;s third and latest book on Plath, Three Martini Afternoons at the Ritz, focuses on Plath&#39;s acquaintance with fellow poet Sexton to show how their meeting may have influenced their respective work. Sexton herself fuelled the Plathian mythos with her 1963 obituary poem Sylvia&#39;s Death, in which she calls her friend a &#34;Thief!&#34; for crawling &#34;into the death I wanted so badly&#34;. She too died by suicide aged 45 in 1974, a fact that encouraged contemporaneous comparisons with Plath. Sexton is a more problematic subject, however. In the early 1990s, her daughter, Linda Gray Sexton, revealed that  her mother sexually abused her – a contrast to the happier relationship Frieda Hughes had with Plath.\n If it is important to highlight the individualism of these women, then this dual biography suffers from its forced similarities – for example, Crowther repeatedly romanticises the image of cigarette burns on their respective papers without mentioning that Sexton was a life-long chainsmoker and Plath didn&#39;t touch a cigarette until her split from Ted Hughes in 1962. Vague language is used to draw more similarities between the poets than there really were, countering the contrasts between Plath&#39;s tidiness and Sexton&#39;s lackadaisical appearance. This essential difference exists in their poetry, although the book does not engage with literary analysis. Reading their respective poems, it is only Sexton who writes explicitly of menstruation and masturbation, while Plath explored themes of female identity and motherhood through the lenses of literature and mythology. Plath preferred metaphor and allusion; Sexton said things as they were.\n  Her own books aside, Crowther hopes we are getting closer to a more rounded positioning of Plath in the cultural imagination. She says that the publication of the unabridged letters, in particular, have &#34;tilted the lens back to allow us to appreciate the multiplicity of voices she used in her correspondence&#34;, rather than just the &#34;Sivvy&#34; who wrote to her mother. Through these new collections, &#34;we hear the voices she used to write to friends, lovers, colleagues, her business correspondence, and this all gives us a much fuller picture of her humour, her passions, her efficiency, and her skill for managing her own writing.&#34; What&#39;s more, Crowther says, having these various voices available to us demonstrates &#34;how she seamlessly moved between these personas flitting across the personal to professional&#34;, and her extraordinary emotional range in so doing. Perhaps conversely, though, the sheer number of &#34;versions&#34; of Sylvia Plath only serves to prevent us from knowing which were genuine.\n The most expansive biography of Plath to date is Clark&#39;s Red Comet. Asked about her aims in writing this book, Clark tells BBC Culture that she wanted to show that Plath’s &#34;near-constant theme is not depression, but the holy quest to become a writer&#34;. Her interest in Plath began while she was doing her doctorate at Oxford University on Northern Irish poets. Previously, she &#34;had fallen prey to the reductive idea that Plath was an avatar of darkness and doom&#34; as a result of the predominant portrayal of Plath in the media. However, through reading her work for a class she was teaching, Clark realised that she was &#34;enormously sophisticated, witty, and yes, funny&#34;, giving her a desire to overturn the &#34;sexist bill of lies&#34; sold to her.\n The resulting book is the closest any writer has come to an exhaustive biography of Plath&#39;s life and work. Clark also discusses the relationship Plath had with Sexton, elucidating their differences and the greater importance of Plath to Sexton than vice versa. The impression given by the book is of a rich and complex life beyond anything shown in the far shorter works that have preceded it. Occasionally she does make hints towards Plath&#39;s fate which err on the side of foreshadowing, including with poetic flourishes about &#34;the bell jar descending&#34; which detract from the authenticity she otherwise strives for. It&#39;s interesting that even in these books that are so aware of the dangerous impact that speculation and mythologising have had on perceptions of Plath, they too can slip into that vein from time-to-time.\n Nonetheless, Clark is optimistic that the scholarship on Plath is evolving in enriching ways. Eschewing the traditional feminist focus on Plath as an author ahead of her time, which has dominated recent academic discourse, her PhD students are looking at Plath&#39;s work from transnational and disability perspectives. These angles are important, in turn, for considering the impact that Plath&#39;s travels, and the dissonance of identity she felt as an American in England, had on her writing; and for looking at how Plath&#39;s mental illness was reflected in her life and work, while also considering the shame that was attached to that in an era when mental health was less understood than it is today.\n  These new approaches continue to have more source materials available to them as the Plath archive expands. In addition to the publication of the letters, Kukil, who is curator of the Plath archive at Smith College in the US, is now working with Amanda Golden, Associate Professor of English at New York Institute of Technology, on an expanded and corrected edition of the Collected Poems, previously edited by Ted Hughes, to be published by Faber &amp; Faber. It is also possible that the incomplete manuscript for Plath&#39;s lost novel, Double Take, and two other journals may one day surface.\n Whatever is left to emerge, however, Plath is always likely to remain more of a puzzle than most cultural icons – in part because of her untimely death, which means she never got the chance to tell her story on her own terms. And in part, as has become increasingly apparent, because of the multiplicity of personae Plath was able to adopt in different settings and with different people, making it difficult to know when she was being sincere and when she was writing with a wry smile on her face. We may continue to think we are getting a clearer impression of who she was, but the &#34;real&#34; Sylvia Plath will remain elusive.\n If you would like to comment on this story or anything else you have seen on BBC Culture, head over to our    Facebook  page or message us on    Twitter .\n And if you liked this story,    sign up for the weekly bbc.com features newsletter , called The Essential List. A handpicked selection of stories from BBC Future, Culture, Worklife and Travel, delivered to your inbox every Friday.", "posttime": "2021-07-23 00:52:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sylvia,plath,普拉斯", "title": "西尔维娅·普拉斯 (Sylvia Plath) 会永远被她的死所定义吗？", "title_en": "Will Sylvia Plath always be defined by her death?", "transed": 1, "url": "https://www.bbc.com/culture/article/20210720-sylvia-plath-the-literary-icon-destined-to-remain-an-enigma", "via": "", "real_tags": ["sylvia", "plath", "普拉斯"]}, {"category": "", "categoryclass": "", "imagename": "c1a6dbd1ab6daf88bb6896b035bf1c3b.jpg", "infoid": 1069040, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "下面，您会在 Steam 的各个类别中找到您可能感兴趣的各种游戏。这可能是错误，也可能是您没有任何游戏时间记录。您可以点击刷新，也可以在玩完游戏后返回。", "note_en": "Below, you&#39;ll find a variety of titles that you may be interested in from categories across Steam\n       This might be an error, or it might be that you don&#39;t have any playtime on record. You can hit refresh, or come back once you&#39;ve played a game.", "posttime": "2021-07-23 00:52:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蒸汽,steam,可能", "title": "蒸汽下降", "title_en": "Steam Is Down", "transed": 1, "url": "https://store.steampowered.com", "via": "", "real_tags": ["蒸汽", "steam", "可能"]}, {"category": "", "categoryclass": "", "imagename": "b7a1af7e0606912201c55975f6549aec.jpg", "infoid": 1069038, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "别。由于其所有权模型，工作池不太适合 Rust。相反，拥抱函数式编程和不可变数据。 Rust 提供了更简单易用和更优雅的工具：并行迭代器和流。需要注意的是，就像在任何编程语言中使用工作池一样，应该始终设置并发上限。否则，您可能会很快耗尽系统资源。对于计算密集型作业（CPU 密集型），有提供并行迭代器的 rayon crate：其组合器被分派到线程池的迭代器。好消息是线程池对我们这些开发人员是隐藏的。我们只需要像使用标准迭代器一样进行编码。 [ package] name = &quot;rust_worker_pool&quot; version = &quot;0.1.0&quot; authors = [ &quot;Sylvain Kerkour &lt;sylvain@kerkour.com&gt;&quot;] edition = &quot;2018&quot; # 在 https://doc.rust 查看更多键和它们的定义-lang.org/cargo/reference/manifest.html[dependencies] rand = &quot;0.8&quot; rayon = &quot;1&quot; 使用 rand::{thread_rng, Rng};使用人造丝::前奏:: *;使用 std::time::Duration; fn compute_job(job: i64) -&gt; i64 { let mut rng = thread_rng();让 sleep_ms: u64 = rng.gen_range( 0.. 10); std::thread::sleep(Duration::from_millis(sleep_ms)); job * job} fn process_result(result: i64) { println !( &quot;{}&quot;, result);} fn main() { let jobs = 0.. 100; jobs.into_par_iter() .map(compute_job) .for_each(process_result);} 默认情况下，线程池的大小等于机器的逻辑 CPU 数量。对于 I/O（输入/输出）绑定作业，我们需要转移到异步区域。更准确地说，我们将使用 Streams，它是可以并发处理项目的异步迭代器。\n但是 Stream trait 本身不提供组合子。我们需要从未来的 crate 中导入 StreamExt trait。 [ package] name = &quot;rust_worker_pool&quot; version = &quot;0.1.0&quot; authors = [ &quot;Sylvain Kerkour &lt;sylvain@kerkour.com&gt;&quot;] edition = &quot;2018&quot; # 在 https://doc.rust 查看更多键和它们的定义-lang.org/cargo/reference/manifest.html[dependencies] rand = &quot;0.8&quot; tokio = { version = &quot;1&quot;, features = [ &quot;full&quot;] } futures = &quot;0.3&quot; for_each_concurrent 是最容易使用的消耗流。这意味着它不会返回 Stream 本身，而是返回一个可以 .await 的 Future。使用期货::{stream, StreamExt};使用 rand::{thread_rng, Rng};使用 std::time::Duration; async fn compute_job(job: i64) -&gt; i64 { let mut rng = thread_rng();让 sleep_ms: u64 = rng.gen_range( 0.. 10); tokio::time::sleep(Duration::from_millis(sleep_ms))。等待; job * job} async fn process_result(result: i64) { println !( &quot;{}&quot;, result);} #[tokio::main] async fn main() { let jobs = 0.. 100;让并发= 42; stream::iter(jobs) .for_each_concurrent(concurrency, |job | async move { let result = compute_job(job). await; process_result(result). await; }) 。 await;} 另一方面，buffer_unordered 不消耗流。这就是为什么我们需要使用 for_each 作为接收器来消费 Stream。使用期货::{stream, StreamExt};使用 rand::{thread_rng, Rng};使用 std::time::Duration; async fn compute_job(job: i64) -&gt; i64 { let mut rng = thread_rng();让 sleep_ms: u64 = rng.gen_range( 0.. 10); tokio::time::sleep(Duration::from_millis(sleep_ms))。等待; job * job} async fn process_result(result: i64) { println !( &quot;{}&quot;, result);} #[tokio::main] async fn main() { let jobs = 0.. 100;让并发= 42; stream::iter(jobs) .map(compute_job) .buffer_unordered(concurrency) .for_each(process_result) 。 await;} 有时，我们可能需要收集它们而不是直接处理结果，例如稍后批量发送它们。好消息，collect 方法在 Streams 上可用：\n使用期货::{stream, StreamExt};使用 rand::{thread_rng, Rng};使用 std::time::Duration; async fn compute_job(job: i64) -&gt; i64 { let mut rng = thread_rng();让 sleep_ms: u64 = rng.gen_range( 0.. 10); tokio::time::sleep(Duration::from_millis(sleep_ms))。等待; job * job} async fn process_result(result: i64) { println !( &quot;{}&quot;, result);} #[tokio::main] async fn main() { let jobs = 0.. 100;让并发= 42;让结果： Vec &lt; i64 &gt; = stream::iter(jobs) .map(compute_job) .buffer_unordered(concurrency) .collect() 。 await;} PS：想学习真实世界的 Rust 和攻击性安全吗？看看我的书 Black Hat Rust（可在早期访问中获得），我们将在其中详细介绍，以及我在那里分享我在编写 Rust 超过 2 年的时间里学到的所有东西：https://academy .kerkour.com/black-hat-rust?coupon=BLOG PS 2：为了避免与电子邮件通讯传递相关的问题，我正在启动一个矩阵频道，您可以加入以关注此博客的所有更新:) #blog： kerkour.com", "note_en": "Don’t. Worker pools are not a great fit for Rust due to its ownership model. Instead, embrace functional programming and immutable data. Rust provides simpler to use and more elegant tools:  parallel Iterators and  Streams.\n It’s important to note that, like when working with worker pools in any programming language, an upper limit for concurrency should always be set up. Otherwise, you may quickly exhaust the resources of your system.\n  For compute-intensive jobs (CPU bound), there is the   rayon crate which provides  parallel Iterators: Iterators whose combinators are dispatched to a thread pool. The nice thing is that the thread pool is hidden from us, the developers. we just have to code as if we were using standard Iterators.\n  [ package] name =  &#34;rust_worker_pool&#34; version =  &#34;0.1.0&#34; authors = [ &#34;Sylvain Kerkour &lt;sylvain@kerkour.com&gt;&#34;] edition =  &#34;2018&#34; # See more keys and their definitions at https://doc.rust-lang.org/cargo/reference/manifest.html[ dependencies] rand =  &#34;0.8&#34; rayon =  &#34;1&#34;\n  use rand::{thread_rng, Rng}; use rayon::prelude:: *; use std::time::Duration; fn  compute_job(job:  i64) -&gt;  i64 {  let  mut rng  = thread_rng();  let sleep_ms:  u64  = rng.gen_range( 0.. 10); std::thread::sleep(Duration::from_millis(sleep_ms)); job  * job} fn  process_result(result:  i64) { println !( &#34;{}&#34;, result);} fn  main() {  let jobs  =  0.. 100; jobs.into_par_iter() .map(compute_job) .for_each(process_result);}\n By default, the thread pool has a size equal to the number of logical CPUs of the machine.\n  For I/O (Input/Output) bound jobs, we need to move to  async land. More precisely, we will use   Streams, which are  async Iterators that can process items concurrently.\n But the   Stream trait does not provide combinators itself. We need to import the   StreamExt trait from the   future crate.\n  [ package] name =  &#34;rust_worker_pool&#34; version =  &#34;0.1.0&#34; authors = [ &#34;Sylvain Kerkour &lt;sylvain@kerkour.com&gt;&#34;] edition =  &#34;2018&#34; # See more keys and their definitions at https://doc.rust-lang.org/cargo/reference/manifest.html[ dependencies] rand =  &#34;0.8&#34; tokio = {  version =  &#34;1&#34;,  features = [ &#34;full&#34;] } futures =  &#34;0.3&#34;\n  for_each_concurrent is the easiest to use as it consumes the Stream. It means that it does not return a Stream itself, but a Future, that can be  .awaited.\n  use futures::{stream, StreamExt}; use rand::{thread_rng, Rng}; use std::time::Duration; async  fn  compute_job(job:  i64) -&gt;  i64 {  let  mut rng  = thread_rng();  let sleep_ms:  u64  = rng.gen_range( 0.. 10); tokio::time::sleep(Duration::from_millis(sleep_ms)). await; job  * job} async  fn  process_result(result:  i64) { println !( &#34;{}&#34;, result);} #[tokio::main] async  fn  main() {  let jobs  =  0.. 100;  let concurrency  =  42; stream::iter(jobs) .for_each_concurrent(concurrency,  |job |  async  move {  let result  = compute_job(job). await; process_result(result). await; }) . await;}\n  On the other hand,   buffer_unordered  does not consume the Stream. This is why we need to use   for_each as a sink to consume the Stream.\n  use futures::{stream, StreamExt}; use rand::{thread_rng, Rng}; use std::time::Duration; async  fn  compute_job(job:  i64) -&gt;  i64 {  let  mut rng  = thread_rng();  let sleep_ms:  u64  = rng.gen_range( 0.. 10); tokio::time::sleep(Duration::from_millis(sleep_ms)). await; job  * job} async  fn  process_result(result:  i64) { println !( &#34;{}&#34;, result);} #[tokio::main] async  fn  main() {  let jobs  =  0.. 100;  let concurrency  =  42; stream::iter(jobs) .map(compute_job) .buffer_unordered(concurrency) .for_each(process_result) . await;}\n  Sometimes, instead of processing results directly we may need to collect them, to send them later in batch for example. Good news, the   collect method is available on Streams:\n  use futures::{stream, StreamExt}; use rand::{thread_rng, Rng}; use std::time::Duration; async  fn  compute_job(job:  i64) -&gt;  i64 {  let  mut rng  = thread_rng();  let sleep_ms:  u64  = rng.gen_range( 0.. 10); tokio::time::sleep(Duration::from_millis(sleep_ms)). await; job  * job} async  fn  process_result(result:  i64) { println !( &#34;{}&#34;, result);} #[tokio::main] async  fn  main() {  let jobs  =  0.. 100;  let concurrency  =  42;  let results: Vec &lt; i64 &gt;  = stream::iter(jobs) .map(compute_job) .buffer_unordered(concurrency) .collect() . await;}\n  P.S: Want to learn real-world Rust and offensive security? Take a look at my book  Black Hat Rust (available in Early-Access), where we will go more into details, and where I share all the things I’ve learned writing production Rust for more than 2 years:  https://academy.kerkour.com/black-hat-rust?coupon=BLOG\n P.S 2: To circumvent the problems related to email newsletter delivery, I’m starting a Matrix channel you can join to follow all the updates of this blog :)  #blog:kerkour.com", "posttime": "2021-07-23 00:51:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,worker", "title": "如何在 Rust 中实现工作池", "title_en": "How to implement worker pools in Rust", "transed": 1, "url": "https://kerkour.com/blog/rust-worker-pool/", "via": "", "real_tags": ["rust", "worker"]}, {"category": "", "categoryclass": "", "imagename": "6f66461671eb44dadbe920eb47fa49e8.jpeg", "infoid": 1069037, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "WSJ News Exclusive Form Energy 的铁空气电池可能会对电网储存电力产生重大影响一家成立四年的初创公司表示，它已经制造出一种廉价的电池，可以使用地球上最常见的元素之一放电数天：铁。 Form Energy Inc. 的电池对于电动汽车来说太重了。但它表示，他们将能够解决可再生能源面临的最难以捉摸的问题之一：在没有阳光和风的情况下，以廉价的方式将大量电力储存到电网中。马萨诸塞州萨默维尔公司的工作长期以来一直笼罩在保密和保密协议中。它最近与《华尔街日报》分享了其进展，并表示希望让监管机构和公用事业公司意识到，如果一切继续按计划进行，到 2025 年，其铁空气电池将能够提供价格合理的长期电力存储。支持者包括 Breakthrough Energy Ventures，这是一家气候投资基金，其投资者包括微软公司联合创始人比尔盖茨和亚马逊公司创始人杰夫贝索斯。 Form 最近发起了一轮 2 亿美元的融资，由钢铁巨头 ArcelorMittal SA 的战略投资领投，该公司是世界领先的铁矿石生产商之一。该公司首席执行官马特奥·哈拉米洛 (Mateo Jaramillo) 曾开发特斯拉公司的 Powerwall 电池并工作在其最早的一些汽车动力系统上。 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款发生任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "WSJ News Exclusive     Form Energy’s iron-air batteries could have big ramifications for storing electricity on the power grid\n   A four-year-old startup says it has built an inexpensive battery that can discharge power for days using one of the most common elements on Earth: iron.\n  Form Energy Inc.’s batteries are far too heavy for electric cars. But it says they will be capable of solving one of the most elusive problems facing renewable energy: cheaply storing large amounts of electricity to power grids when the sun isn’t shining and wind isn’t blowing.\n  The work of the Somerville, Mass., company has long been shrouded in secrecy and nondisclosure agreements. It recently shared its progress with The Wall Street Journal, saying it wants to make regulators and utilities aware that if all continues to go according to plan, its iron-air batteries will be capable of affordable, long-duration power storage by 2025.\n  Its backers include Breakthrough Energy Ventures, a climate investment fund whose investors include Microsoft Corp. co-founder Bill Gates and Amazon.com Inc. founder Jeff Bezos. Form recently initiated a $200 million funding round, led by a strategic investment from steelmaking giant ArcelorMittal SA, one of the world’s leading iron-ore producers.\n  Form is preparing to soon be in production of the “kind of battery you need to fully retire thermal assets like coal and  natural gas” power plants, said the company’s chief executive, Mateo Jaramillo, who developed Tesla Inc.’s Powerwall battery and worked on some of its earliest automotive powertrains.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-07-23 00:51:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "claims", "title": "初创公司声称在长续航电池方面取得突破", "title_en": "Startup Claims Breakthrough in Long-Duration Batteries", "transed": 1, "url": "https://www.wsj.com/articles/startup-claims-breakthrough-in-long-duration-batteries-11626946330", "via": "", "real_tags": ["claims"]}, {"category": "", "categoryclass": "", "imagename": "9ffef05a1cb92c581846666b5a500b88.jpg", "infoid": 1069036, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个国家现在因诞生 Shopify 而在创业世界中闻名，到 2021 年为止，它已经打破了之前的年度风险投资记录。事实上，CB Insights 的数据表明，今年加拿大的创业公司已经筹集了比 2020 年总额增加一倍以上的资金。相同的数据集表明，加拿大的风险投资结果现在可与整个拉丁美洲地区的结果相媲美，第二季度的退出和大型交易大致持平，同期的风险投资总额也相近。交易所联系了一些风险投资家，以扩大我们对加拿大市场的看法，超越数据点。 Ripple Ventures 驻多伦多的投资者马特·科恩 (Matt Cohen) 告诉交易所，“今天的加拿大正处于风险投资爆炸中”，导致该国“前所未有”的结果。综合数据和投资者笔记，加拿大的创业行业似乎受益于国内和国际趋势、广泛的类型焦点和不止一个中心。让我们来谈谈它。根据 CB Insights 的数据，2021 年上半年，加拿大初创公司通过 414 笔交易筹集了 63 亿美元。这两个数字都优于加拿大 2020 年的业绩，当时 617 笔交易为加拿大初创企业筹集了 29 亿美元的总资金。加拿大已经打破了之前的风险投资记录（43 亿美元，2019 年），并且有望超过其历史最高的交易数量（720 笔，2018 年）。就其本身而言，第二季度的超大业绩甚至比其 2021 年上半年的业绩可能让您预期的更加极端，令人惊讶。观察来自同一数据集的以下图表：加拿大初创公司刚刚在交易量和美元数量方面创下了有史以来最好的季度。此外，该国在 2020 年第四季度将筹集的资金从当地最低水平提高了近 10 倍。\n值得注意的是，本季度没有一笔加拿大初创公司交易的价值超过 5 亿美元。事实上，Trulioo 的 3.94 亿美元 D 系列是最大的。从那里开始，名单包括 ApplyBoard 的 D 轮融资 3 亿美元和 Vena 的 C 轮融资 2.42 亿美元。我们认为该结果表明加拿大的投资前景并非由少数几家筹集十亿美元资金的公司主导。请注意，这是个好消息：数据表明，加拿大创业市场并没有受到一两家杰出公司的支持，而是整体表现良好。", "note_en": "The country, now famous in the startup world for giving birth to Shopify, has already crushed prior yearly records for venture investment thus far in 2021. Indeed,  CB Insights data indicates that Canadian startups this year have already raised more than double their 2020 totals.\n The same data set indicates that Canada’s venture capital results now rival those of the entire Latin American region, with exits and mega-deals coming in roughly on par in the second quarter, and a similar number of total venture capital rounds in the period.\n      The Exchange reached out to a number of venture capitalists to expand our perspective on the Canadian market beyond the data points.  Matt Cohen, a Toronto-based investor at  Ripple Ventures, told The Exchange that “Canada is in a venture explosion” today, leading to results that are “unprecedented” for the country.\n Taking the data and investor notes in aggregate, Canada’s startup industry seems to be benefiting from both domestic and international trends, a wide genre focus and more than one hub. Let’s talk aboot it.\n  In the first half of 2021, Canadian startups raised $6.3 billion across 414 deals, per CB Insights data. Both numbers compare favorably to Canada’s 2020 results, when 617 deals led to $2.9 billion in total capital raised by Canadian startups. Canada has already bested its previous record in venture dollars invested ($4.3 billion, 2019), and is on pace to beat its all-time deal count as well (720, 2018).\n By itself, the second quarter’s outsize results are even more extreme than its H1 2021 results might have led you to expect, amazingly. Observe the following chart from the same data set:\n  Canadian startups just had their single best quarter ever in both deal volume and dollar volume terms. Furthermore, the country boosted capital raised by nearly 10x from its local minimum in Q4 2020.\n Notably, no Canadian startup deal in the quarter was worth more than $500 million; indeed, Trulioo’s $394 million Series D was the largest. From there the list includes $300 million for ApplyBoard’s Series D and Vena’s $242 million Series C. We read that list of results as indicative of an investing landscape in Canada that is not dominated by a handful of companies raising billion-dollar rounds. That’s good news, mind you: The data implies that the Canadian startup market is not being bolstered by one or two standout companies, but rather performing well more generally.", "posttime": "2021-07-23 00:18:08", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,startup,加拿大", "title": "加拿大的创业市场随着全球风投热潮而蓬勃发展", "title_en": "\n\t\t\t\tCanada’s startup market booms alongside hot global VC investment\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/canadas-startup-market-booms-alongside-hot-global-vc-investment/", "via": "", "real_tags": ["创业", "startup", "加拿大"]}, {"category": "", "categoryclass": "", "imagename": "8c7e0efff34eef700cdc384b05c4a0d2.jpg", "infoid": 1069035, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "处于中心位置——至少在美国——是交通部长皮特·布蒂吉格 (Pete Buttigieg)。这位印第安纳州小镇市长成为总统候选人，现任拜登政府内阁成员，负责监管公共交通、高速公路安全和自动驾驶汽车等新兴技术。这位哈佛大学毕业生、牛津大学罗德学者和前美国海军军官能够为交通运输的未来带来复杂性或清晰度。在 Disrupt 2021 大会上，Buttigieg 部长将与我们一起进行炉边谈话，我们将深入探讨有关交通的一些最棘手的问题，以及如何确保从 A 点搬到 B 点是一项普遍权利，而不是特权。我们将向 Buttigieg 询问微型交通和公共交通、拜登总统推动联邦政府使用电动汽车、自动驾驶汽车指导以及在使用高级驾驶员辅助和自动驾驶系统时报告车辆碰撞的新监管要求——这一举措可能激发新一波初创企业，并使一些车载技术受益。结果：如果它涉及移动人员和包裹的技术，我们的目标是谈论它。 Buttigieg 部长只是将在我们的 Disrupt Stage 和 Extra Crunch Stage 上的众多知名演讲者之一。在为期三天的活动中，作家、导演、演员和 Houseplant 联合创始人 Seth Rogen 将与 Houseplant 首席商务官 Haneen Davies 和联合创始人兼首席执行官 Michael Mohr 一起讨论大麻业务，Duolingo 首席执行官和联合创始人创始人 Luis von Ahn 将讨论游戏化教育和为公开募股做准备，Coinbase 首席执行官 Brian Armstrong 将深入研究加密货币的动荡世界及其公司今年早些时候的大规模直接上市。其他演讲者包括 Twitter 首席信息安全官 Rinki Sethi、Calendly 创始人兼首席执行官 Tope Awotona、Mirror 联合创始人兼首席执行官 Brynn Putnam、Evil Geniuses 首席执行官 Nicole LaPointe Jameson 和 Andreessen Horowitz 普通合伙人 Katie Haun。如果没有 Startup Battlefield，Disrupt 2021 将是不完整的，这场竞争推出了一些世界上最大的科技公司，包括 Cloudflare 和 Dropbox。今年 9 月 21 日至 23 日，在 Disrupt 2021 线上与 Buttigieg 部长和超过 10,000 名创业界最具影响力的人一起参加。以低于 99 美元的价格在有限时间内获得您的通行证！", "note_en": "At the center — at least in the United States — sits Secretary of Transportation Pete Buttigieg. The small-town mayor in Indiana turned presidential candidate and now cabinet member under the Biden administration oversees public transport, highway safety and nascent technologies like autonomous vehicles. The Harvard graduate, Rhodes Scholar at Oxford University and former U.S. Navy officer is in a position to bring complexity or clarity to the future of transportation.\n At  Disrupt 2021, Secretary Buttigieg will join us for a fireside chat where we’ll dig into some of the thorniest questions around transportation and how to ensure that moving from Point A to Point B is a universal right, not a privilege. We’ll ask Buttigieg about micromobility and public transit, President Biden’s push for the federal government to use electric vehicles, autonomous vehicle guidance and new regulatory requirements around reporting vehicle crashes when an advanced driver assistance and automated driving system is engaged — a move that could spur a new wave of startups and benefit some in-car technologies.\n  The upshot: If it involves technology that moves people and packages, we aim to talk about it.\n Secretary Buttigieg is just one of the many high-profile speakers who will be on our  Disrupt Stage and the  Extra Crunch Stage. During the three-day event, writer, director, actor and  Houseplant co-founder  Seth Rogen will be joined by Houseplant Chief Commercial Officer Haneen Davies and co-founder and CEO Michael Mohr to talk about the business of weed,  Duolingo CEO and co-founder  Luis von Ahn will discuss gamifying education and prepping for a public offering and Coinbase CEO Brian Armstrong will dig into the volatile world of cryptocurrency and his company’s massive direct listing earlier this year.\n Other speakers include Twitter CISO  Rinki Sethi, Calendly founder and CEO  Tope Awotona, Mirror co-founder and CEO  Brynn Putnam, Evil Geniuses CEO  Nicole LaPointe Jameson and Andreessen Horowitz General Partner  Katie Haun.\n Disrupt 2021 wouldn’t be complete without Startup Battlefield, the competition that launched some of the world’s biggest tech companies, including Cloudflare and Dropbox. Join Secretary Buttigieg and over 10,000 of the startup world’s most influential people at  Disrupt 2021 online this September 21-23.  Get your pass to attend now for under $99 for a limited time!", "posttime": "2021-07-23 00:17:56", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,交通部长,transportation,首席", "title": "美国交通部长皮特·布蒂吉格 (Pete Buttigieg) 即将颠覆", "title_en": "\n\t\t\t\tUS Secretary of Transportation Pete Buttigieg is coming to Disrupt\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/us-secretary-of-transportation-pete-buttigieg-is-coming-to-disrupt-draft/", "via": "", "real_tags": ["美国", "交通部长", "首席"]}, {"category": "", "categoryclass": "", "imagename": "e66849af0ec8c5f87e4d36d3c70f0047.jpg", "infoid": 1069034, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自该公司于 2018 年成立以来，五家 Elms Capital、Blueprint Equity 和其他人参与了该轮融资，为 Sendlane 提供了 2300 万美元的总资金。 尽管该公司三年前正式成立，但联合创始人兼首席执行官 Jimmy Kim 告诉 TechCrunch 他开始致力于这个想法是在 2013 年与另外两位联合创始人一起提出的。他们都是不同业务领域的电子邮件营销人员，但有一些共同点，因为他们都使用他们不喜欢的电子邮件工具。金说，他们确实喜欢的那些对小企业来说价格太高了。他们着手为想要做的不仅仅是电子邮件活动和新闻通讯的客户构建自己的电子邮件营销自动化平台。当 Kim 参与的另外两家公司于 2017 年退出时，他决定全力投入 Sendlane，将其构建成一个基于洞察力和集成实现收入最大化的系统。 2018年底，该公司获得了Zing Capital的种子资金，并于2019年决定转向电子商务。 “基于我们的个人背景以及与我们合作过的客户，我们意识到这是我们做得最好的，”Kim 说。如今，超过 1,700 家电子商务公司使用 Sendlane 的平台将其客户数据的 100 多个点（废弃的购物车、哪些产品卖得最好以及哪个营销渠道有效）转换为旨在提高客户忠诚度的互动通信。该公司表示，它可以为客户平均增加 20% 至 40% 的收入。该公司本身的年增长率为 100%，每年的经常性收入超过 700 万美元。它目前拥有 54 名员工，Kim 预计到今年年底将达到 90 名左右，到 2022 年底将达到 150 名。Sendlane 目前有 20 多个空缺职位，他说。\n当前和潜在的增长是 Kim 追求 A 轮融资的驱动力。他说，Sendlane 去年开始盈利，这就是为什么它到目前为止还没有筹集到大量资金。然而，随着电子商务的快速普及，Kim 希望为下一波竞争做好准备，他预计明年会到来。他认为 ActiveCampaign 和 Klaviyo 等公司与 Sendlane 一致，但表示他公司的与众不同之处在于客户服务，拥有较短的等待时间和在不到 15 秒内回答问题的聊天。他还准备实现下一个愿景，即统一数据和洞察力，在客户和零售商之间建立有意义的互动。 “我们想开始开辟一个新的空间，”金补充道。 “我们将在未来 12 到 18 个月内推出大量新产品，并希望成为客户旅程数据洞察的单一来源，为您的业务增长提供灵活性。”两个即将推出的工具包括 Audience，它将统一客户数据并提供洞察力，以及用于双向通信和启用活动级别发送的 SMS 产品。", "note_en": "Five Elms Capital, Blueprint Equity and others invested in the round to give Sendlane total funding of $23 million since the company was founded in 2018.\n Though the company officially started three years ago, co-founder and CEO Jimmy Kim told TechCrunch he began working on the idea back in 2013 with two other co-founders.\n  They were all email marketers in different lines of business, but had some common ground in that they were all using email tools they didn’t like. The ones they did like came with too big of a price tag for a small business, Kim said. They set out to build their own email marketing automation platform for customers that wanted to do more than email campaigns and newsletters.\n When two other companies Kim was involved in exited in 2017, he decided to put both feet into Sendlane to build it into a system that maximized revenue based on insights and integrations.\n In late 2018, the company attracted seed funding from Zing Capital and decided in 2019 to pivot into e-commerce. “Based on our personal backgrounds and looking at the customers we worked with, we realized that is what we did best,” Kim said.\n Today, more than 1,700 e-commerce companies use Sendlane’s platform to convert more than 100 points of their customers’ data — abandoned carts, which products sell the best and which marketing channel is working — into engaging communications aimed at driving customer loyalty. The company said it can increase revenue for customers between 20% and 40% on average.\n The company itself is growing 100% year over year and seeing over $7 million in annual recurring revenue. It currently has 54 employees right now, and Kim expects to be at around 90 by the end of the year and 150 by the end of 2022. Sendlane currently has more than 20 open roles, he said.\n That current and potential growth was a driver for Kim to go after the Series A funding. He said Sendlane became profitable last year, which is why it has not raised a lot of money so far. However, as the rapid adoption of e-commerce continues, Kim wants to be ready for the next wave of competition coming in, which he expects in the next year.\n He considers companies like ActiveCampaign and Klaviyo to be in line with Sendlane, but says his company’s differentiator is customer service, boasting short wait times and chats that answer questions in less than 15 seconds.\n He is also ready to go after the next vision, which is to unify data and insights to create meaningful interactions between customers and retailers.\n “We want to start carving out a new space,” Kim added. “We have a ton of new products coming out in the next 12 to 18 months and want to be the single source for customer journey data insights that provides flexibility for your business to grow.”\n Two upcoming tools include Audiences, which will unify customer data and provide insights, and an SMS product for two-way communications and enabled campaign-level sending.", "posttime": "2021-07-23 00:17:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sendlane,shoppers,客户", "title": "Sendlane 融资 2000 万美元，将购物者转变为忠实客户", "title_en": "\n\t\t\t\tSendlane raises $20M to convert shoppers into loyal customers\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/22/sendlane-raises-20m-to-convert-shoppers-into-loyal-customers/", "via": "", "real_tags": ["sendlane", "shoppers", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069033, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AlphaFold 程序对近 20,000 种人类蛋白质结构的预测现在可供研究人员免费使用 去年，人工智能组织 DeepMind 破解了一个困扰科学家数十年的谜团：剥离蛋白质的结构，即生命的基石。现在，在积累了几乎所有人类蛋白质结构的数据库后，该公司正在免费提供在线资源供研究人员使用。理解我们基本的生物机制的关键是它的架构。构成蛋白质的氨基酸链扭曲和转动，形成最令人困惑的 3D 形状。正是这种复杂的形式解释了蛋白质的功能；从对新陈代谢至关重要的酶到对抗感染性攻击的抗体。尽管始于 1950 年代的多年繁重而昂贵的实验室工作，科学家们只解码了一小部分人类蛋白质的结构。 DeepMind 的人工智能程序 AlphaFold 已经预测了人类表达的几乎所有 20,000 种蛋白质的结构。在将预测结果与已知结构进行比较的独立基准测试中，该系统能够在 95% 的时间内以良好的标准预测蛋白质的形状。 DeepMind 与欧洲分子生物学实验室的欧洲生物信息学研究所 (EMBL-EBI) 合作，希望该数据库能够帮助研究人员通过打开驱动某些疾病的装置，在原子尺度上分析生命是如何运作的，从而在医学领域取得长足进步。个性化医疗，创造更有营养的作物并开发可以分解塑料的“绿色酶”。人工智能有各种定义，但总的来说，它是指使用数据构建世界某些方面模型的程序。然后使用该模型对未来事件做出明智的决策和预测。该技术被广泛用于在音乐、电影和购物网站上提供语音和面部识别、语言翻译以及个人推荐。未来，它可以提供无人驾驶汽车、智能个人助理和智能电网。人工智能有可能使组织更加有效和高效，但该技术引发了道德、治理、隐私和法律等严重问题。最近几个月，与从事一系列项目的科学家合作——从严重影响世界贫困地区的疾病到研究抗生素耐药性或导致 Covid 的病毒的生物学——已经开始。\n“这些应用实际上只受我们的想象力的限制——但在更基本的层面上，AlphaFold 数据库将增加我们对蛋白质如何发挥作用以及它们在生命基本过程中的作用的理解，”总干事 Edith Heard 教授说EMBL 的。 “这种理解意味着我们可以更好地解开生命的分子机制，并加速我们保护和治疗人类健康以及地球健康的追求，并使这一工具开放获取将加速研究发现和为世界各地的科学家创新。” AlphaFold 以令人眼花缭乱的准确度预测蛋白质结构的能力于去年在两年一度的“蛋白质奥林匹克运动会”上亮相。参与者获得了大约 100 种蛋白质的氨基酸序列，并要求他们解决这些问题。 AlphaFold 不仅使其他计算机程序的性能黯然失色，而且达到了类似于费力的实验室方法的准确性。 EMBL-EBI 主任 Ewan Birney 教授在结果于 11 月首次公布后说：“我几乎从椅子上摔下来，因为这个长期存在的蛋白质折叠问题已经得到解决，我感到非常兴奋和惊讶。” “这个数据集很像人类基因组……正是在这个数据集上，我们开始了一些我们之前无法做到的新科学。我很高兴开始走这条路。”", "note_en": "AlphaFold program’s prediction of nearly 20,000 human protein structures now free for researchers\n    Last year the artificial intelligence group DeepMind cracked a mystery that has flummoxed scientists for decades: stripping bare the structure of proteins, the building blocks of life. Now, having amassed a  database of nearly all human protein structures, the company is making the resource available online free for researchers to use.\n The key to understanding our basic biological machinery is its architecture. The chains of amino acids that comprise proteins twist and turn to make the most confounding of 3D shapes. It is this elaborate form that explains protein function; from enzymes that are crucial to metabolism to antibodies that fight infectious attacks.\n  Despite years of onerous and expensive lab work that began in the 1950s, scientists have only decoded the structure of a fraction of human proteins. DeepMind’s AI program, AlphaFold, has predicted the structure of  nearly all 20,000 proteins expressed by humans. In an independent benchmark test that compared predictions to known structures, the system was able to predict the shape of a protein to a good standard 95% of time.\n DeepMind, which has partnered with the European Molecular Biology Laboratory’s European Bioinformatics Institute (EMBL-EBI), hopes the database will help researchers to analyse how life works at an atomic scale by unpacking the apparatus that drives some diseases, make strides in the field of personalised medicine, create more nutritious crops and develop “green enzymes” that can break down plastic.\n Artificial Intelligence has various definitions, but in general it means a program that uses data to build a model of some aspect of the world. This model is then used to make informed decisions and predictions about future events. The technology is used widely, to provide speech and face recognition, language translation, and personal recommendations on music, film and shopping sites. In the future, it could deliver driverless cars, smart personal assistants, and intelligent energy grids. AI has the potential to make organisations more effective and efficient, but the technology raises serious issues of ethics, governance, privacy and law.\n Collaboration in recent months with scientists working on a range of projects – from diseases that disproportionately affect poorer parts of the world to studying antibiotic resistance or the biology of the virus that causes Covid – has already begun.\n “The applications are actually limited only by our imagination – but at a more fundamental level, the AlphaFold database will increase our understanding of how proteins function, and their role in the fundamental processes of life,” said Prof Edith Heard, the director-general of the EMBL.\n “This understanding means we can be better equipped to unravel the molecular mechanisms of life and accelerate our pursuits to protect and treat human health, as well as the health of our planet, and making this tool open access will accelerate the power of research discovery and innovation for scientists around the world.”\n  AlphaFold’s ability to predict protein structure with  dizzying accuracy was unveiled at the biennial “protein olympics” last year. Participants were given the amino acid sequences for about 100 proteins and challenged to work them out. AlphaFold not only eclipsed the performance of other computer programs but achieved accuracy analogous to laborious lab-based methods.\n “I almost fell off my chair in just excitement and amazement that this longstanding problem of how proteins fold had been solved,” said Prof Ewan Birney, the director of the EMBL-EBI, after the results were first presented in November.\n “This dataset is rather like the  human genome … and it’s this dataset where we start some new bits of science that we weren’t able to do beforehand. I’m very excited to start walking down that road.”", "posttime": "2021-07-23 00:14:10", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "database,人工智能,数据库,firm,蛋白质", "title": "人工智能公司 DeepMind 将生命基石数据库上线", "title_en": "AI Firm DeepMind Puts Database of the Building Blocks of Life Online", "transed": 1, "url": "https://www.theguardian.com/technology/2021/jul/22/ai-firm-deepmind-puts-database-building-blocks-life-human-protein-structure-free-online", "via": "", "real_tags": ["database", "人工智能", "数据库", "firm", "蛋白质"]}, {"category": "", "categoryclass": "", "imagename": "924f8cfc3ea599dcbc0d7c0c9bf5ab86.png", "infoid": 1069032, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Thesis 是 Fold 加密奖励应用程序和去中心化 Keep 协议背后的加密孵化器，周四宣布已在 A 轮融资中筹集了 2100 万美元。这轮融资的投资者包括 ParaFi Capital、Nascent、Polychain Capital 和其他加密领域的投资者。根据 Thesis 首席执行官兼创始人 Matt Luongo 的说法，风险工作室计划使用这笔资金来建立现有项目并启动新项目。 Thesis 的第五个工作室项目是一个尚未命名的 Web 3 钱包，Luongo 将其描述为“MetaMask 的开源替代品”。 Luongo 告诉 CoinDesk，在广受欢迎的 ConsenSys 拥有的加密钱包收紧其许可证并于 2020 年 8 月从开源转向闭源之后，Thesis 受到启发，创建了一个 MetaMask 竞争对手。 - 具体而言，A 系列筹集的 2100 万美元是对 Thesis 本身的投资。对于投资者来说，这代表着 Thesis 将继续成功孵化和开发项目的赌注。注册后，您将收到有关 CoinDesk 产品的电子邮件，并且您同意我们的条款和条件以及隐私政策。 ParaFi Capital 的 Santiago Roel Santos 表示：“Thesis 是我们生态系统中最好的重复建设者之一，利用他们早期的加密专业知识将技术推向市场，这些技术在使加密更具活力和可访问性方面发挥着关键作用。”\n本轮投资者将获得 Thesis 及其所有项目的股权。 “任何在这一轮投资的人现在都拥有 Fold、Keep、Saddle 的所有权——这真的是我们迄今为止所做的一切，”Luongo 说。披露 作为关于加密货币、数字资产和货币未来的新闻和信息的领导者，CoinDesk 是一家致力于达到最高新闻标准并遵守一套严格的编辑政策的媒体机构。 CoinDesk 是 Digital Currency Group 的独立运营子公司，该集团投资于加密货币和区块链初创公司。", "note_en": "Thesis, the crypto incubator behind the  Fold crypto rewards app and the decentralized  Keep protocol, announced Thursday that it has raised $21 million in a Series A funding round.\n Investors in the round included ParaFi Capital, Nascent, Polychain Capital and others in the crypto space.\n According to Thesis CEO and founder Matt Luongo, the venture studio plans to use the funds to build out existing projects and spin up new ones. Thesis’ fifth studio project is a yet-unnamed Web 3 wallet that Luongo described as an “open-source alternative to MetaMask.”\n Luongo told CoinDesk that Thesis was inspired to create a MetaMask competitor after the popular, ConsenSys-owned crypto wallet tightened its licenses and  switched from open-source to closed-source in August 2020.\n  Unlike previous funding rounds for Thesis, which have largely been  project-specific, the $21 million raised in the Series A is an investment into Thesis itself. For investors, it represents a bet that Thesis will continue successfully incubating and developing projects.\n By signing up, you will receive emails about CoinDesk products and you agree to our  terms &amp; conditions and  privacy policy.\n “Thesis is one of the best repeat builders in our ecosystem, leveraging their early crypto expertise to bring to market technology that plays a pivotal role in making crypto more dynamic and accessible,” said Santiago Roel Santos of ParaFi Capital.\n  Investors in the round will be given equity in Thesis and all of its projects.\n “Anyone who invested in this round now has ownership in Fold, Keep, Saddle – really everything that we’ve done so far,” Luongo said.\n    Disclosure The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a  strict set of editorial policies. CoinDesk is an independent operating subsidiary of  Digital Currency Group, which invests in  cryptocurrencies and blockchain  startups.", "posttime": "2021-07-23 00:13:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,加密,crypto", "title": "Thesis 是 Fold 加密奖励应用程序和去中心化 Keep 协议背后的加密孵化器，A 轮融资 2100 万美元", "title_en": "Thesis, the crypto incubator behind the Fold crypto rewards app and the decentralized Keep protocol, raises $21M Series A", "transed": 1, "url": "https://www.coindesk.com/crypto-venture-studio-thesis-raises-21m-to-keep-building", "via": "", "real_tags": ["程序", "加密", "crypto"]}, {"category": "", "categoryclass": "", "imagename": "1dbaaf1066c664741ea6e9b0d0a35db3.jpg", "infoid": 1069031, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "人工智能研究实验室 DeepMind 使用人工智能创建了迄今为止最全面的人类蛋白质图谱。该公司是谷歌母公司 Alphabet 的子公司，正在免费发布这些数据，一些科学家将这项工作的潜在影响与人类基因组计划的潜在影响进行了比较，人类基因组计划是一项绘制每个人类基因的国际努力。蛋白质是长而复杂的分子，在体内执行许多任务，从构建组织到对抗疾病。它们的目的是由它们的结构决定的，它们像折纸一样折叠成复杂和不规则的形状。了解蛋白质如何折叠有助于解释其功能，这反过来又可以帮助科学家完成一系列任务——从对身体如何运作进行基础研究，到设计新的药物和治疗方法。以前，确定蛋白质的结构依赖于昂贵且耗时的实验。但去年 DeepMind 表明它可以使用名为 AlphaFold 的人工智能软件对蛋白质的结构进行准确预测。现在，该公司正在向公众发布该程序做出的数十万个预测。 “我认为这是 DeepMind 整个 10 年多生命周期的顶峰，”公司首席执行官兼联合创始人 Demis Hassabis 告诉 The Verge。 “从一开始，我们就打算这样做：在人工智能方面取得突破，在围棋和雅达利等游戏上进行测试，[并]将其应用于现实世界的问题，看看我们是否可以加速科学突破并使用那些造福人类的。”目前在公共领域有大约 180,000 种蛋白质结构可用，每一种都通过实验方法产生，并可通过蛋白质数据库访问。 DeepMind 正在发布对 20 种不同生物体中约 350,000 种蛋白质结构的预测，包括小鼠和果蝇等动物以及大肠杆菌等细菌。 （DeepMind 的数据与预先存在的蛋白质结构之间存在一些重叠，但由于模型的性质，究竟有多少难以量化。）最重要的是，该版本包括对 98% 的人类蛋白质的预测，大约有 20,000 种不同结构，统称为人类蛋白质组。它不是第一个公开的人类蛋白质数据集，但它是最全面、最准确的。 AlphaFold 的技术主管 John Jumper 说，如果他们愿意，科学家们可以为自己下载整个人类蛋白质组。 “有一个有效的 HumanProteome.zip，我认为它的大小约为 50 GB，”Jumper 告诉 The Verge。 “如果你愿意，你可以把它放在闪存驱动器上，但如果没有计算机进行分析，它对你没有多大好处！”在发布第一批数据后，DeepMind 计划继续增加蛋白质库，该库将由欧洲旗舰生命科学实验室欧洲分子生物学实验室 (EMBL) 维护。 EMBL 总干事伊迪丝·赫德 (Edith Heard) 表示，到今年年底，DeepMind 希望发布对 1 亿种蛋白质结构的预测，该数据集将“改变我们对生命运作方式的理解”。\n哈萨比斯说，这些数据对科学和商业研究人员来说都是永久免费的。 “任何人都可以将它用于任何事情，”DeepMind 首席执行官在新闻发布会上指出。 “他们只需要归功于参与引用的人。”了解蛋白质的结构对各个领域的科学家都很有用。这些信息可以帮助设计新药，合成分解废物的新型酶，并创造对病毒或极端天气有抵抗力的作物。 DeepMind 的蛋白质预测已经被用于医学研究，包括研究导致 COVID-19 的病毒 SARS-CoV-2 的工作原理。新数据将加速这些努力，但科学家们指出，将这些信息转化为现实世界的结果仍需要大量时间。 “我认为这不会在一年内改变患者的治疗方式，但它肯定会对科学界产生巨大影响，”科罗拉多大学生物化学系教授 Marcelo C. Sousa ，告诉 The Verge。 DeepMind 高级研究科学家 Kathryn Tunyasuvunakool 表示，科学家们将不得不习惯于掌握这些信息。 “作为一名生物学家，我可以确认，我们甚至没有观察 20,000 个结构的手册，所以这个 [数据量] 是非常出乎意料的，”Tunyasuvunakool 告诉 The Verge。 “要分析成千上万的结构——这太疯狂了。”但值得注意的是，DeepMind 的软件生成蛋白质结构的预测，而不是实验确定的模型，这意味着在某些情况下需要进一步的工作来验证结构。 DeepMind 表示，它花了很多时间在其 AlphaFold 软件中构建准确度指标，该软件对每个预测的可信度进行排名。不过，蛋白质结构的预测仍然非常有用。通过实验方法确定蛋白质的结构既昂贵又耗时，并且依赖于大量的反复试验。这意味着即使是低置信度的预测也可以为科学家指明正确的研究方向，从而节省他们多年的工作。格拉斯哥大学结构生物学教授海伦瓦尔登告诉 The Verge，DeepMind 的数据将“显着缓解”研究瓶颈，但“进行生物化学和生物学评估的费力、资源消耗工作，例如，药物功能”将保留。\nSousa 之前曾在他的工作中使用过 AlphaFold 的数据，他说科学家们会立即感受到这种影响。 “在我们与 DeepMind 的合作中，我们有一个包含蛋白质样本的数据集，我们已经拥有了 10 年，但我们从未达到开发适合模型的地步，”他说。 “DeepMind 同意为我们提供一个结构，在我们坐了 10 年后，他们能够在 15 分钟内解决问题。”蛋白质由氨基酸链构成，人体中有 20 种不同的氨基酸。由于任何单独的蛋白质都可以由数百个单独的氨基酸组成，每个氨基酸都可以向不同的方向折叠和扭曲，这意味着分子的最终结构具有数量惊人的可能构型。一种估计是典型的蛋白质可以以 10^300 种方式折叠——即 1 后跟 300 个零。由于蛋白质太小而无法用显微镜检查，科学家不得不使用昂贵且复杂的方法（如核磁共振和 X 射线晶体学）间接确定其结构。简单地通过阅读其组成氨基酸列表来确定蛋白质结构的想法长期以来一直在理论上但难以实现，因此许多人将其描述为生物学的“巨大挑战”。然而，近年来，计算方法——尤其是那些使用人工智能的方法——表明这种分析是可能的。借助这些技术，人工智能系统可以在已知蛋白质结构的数据集上进行训练，并使用这些信息来创建自己的预测。许多团队多年来一直在研究这个问题，但 DeepMind 深厚的 AI 人才库和对计算资源的访问使其能够显着加快进展。去年，该公司参加了一项名为 CASP 的国际蛋白质折叠比赛，并击败了比赛。它的结果非常准确，以至于 CASP 的联合创始人之一计算生物学家 John Moult 说，“在某种意义上，[蛋白质折叠] 问题得到了解决。” DeepMind 的 AlphaFold 程序自去年的 CASP 竞赛以来已经升级，现在速度提高了 16 倍。 “我们可以在几分钟内折叠一个普通蛋白质，大多数情况下是几秒钟，”哈萨比斯说。该公司上周还以开源形式发布了 AlphaFold 的底层代码，允许其他人在未来继续其工作。雷丁大学教授 Liam McGuffin 开发了一些英国领先的蛋白质折叠软件，他称赞了 AlphaFold 的技术才华，但也指出该计划的成功依赖于数十年的先前研究和公开数据。 “DeepMind 拥有大量资源来保持这个数据库的最新状态，他们比任何一个学术团体都更有能力做到这一点，”麦高芬告诉 The Verge。 “我认为学者们最终会到达那里，但它会更慢，因为我们没有足够的资源。”\nThe Verge 采访的许多科学家都注意到 DeepMind 免费发布这些数据的慷慨。毕竟，该实验室归谷歌母公司 Alphabet 所有，该公司一直在向商业医疗保健项目投入大量资源。 DeepMind 本身每年都会损失很多钱，并且有很多报道称该公司与其母公司之间在研究自主权和商业可行性等问题上存在紧张关系。不过，哈萨比斯告诉 The Verge，该公司一直计划免费提供这些信息，而这样做是对 DeepMind 创始精神的实现。他强调，DeepMind 的工作在谷歌的很多地方都得到了使用——“几乎你使用的任何东西，我们的一些技术都是其中的一部分”——但该公司的主要目标一直是基础研究。 “我们被收购时达成的协议是，我们在这里主要是为了推进 AGI 和 AI 技术的发展，然后利用它来加速科学突破，”哈萨比斯说。 “[Alphabet] 有很多部门专注于赚钱，”他补充道，并指出 DeepMind 对研究的关注“为科学界带来了声望和善意方面的各种好处。可以通过多种方式实现价值。” Hassabis 预测 AlphaFold 是未来的标志——这个项目展示了人工智能在处理人类生物学等混乱问题方面的巨大潜力。 “我认为我们正处于一个非常激动人心的时刻，”他说。 “在接下来的十年中，我们和 AI 领域的其他人希望取得惊人的突破，真正加速解决我们在地球上遇到的真正大问题。”", "note_en": "AI research lab DeepMind has created the most comprehensive map of human proteins to date using artificial intelligence. The company, a subsidiary of Google-parent Alphabet, is releasing the data for free, with some scientists comparing the potential impact of the work to that of the Human Genome Project, an international effort to map every human gene.\n Proteins are long, complex molecules that perform numerous tasks in the body, from building tissue to fighting disease. Their purpose is dictated by their structure, which folds like origami into complex and irregular shapes. Understanding how a protein folds helps explain its function, which in turn helps scientists with a range of tasks — from pursuing fundamental research on how the body works, to designing new medicines and treatments.\n  Previously, determining the structure of a protein relied on expensive and time-consuming experiments. But last year DeepMind showed it can produce  accurate predictions of a protein’s structure using AI software called AlphaFold. Now, the company is releasing hundreds of thousands of predictions made by the program to the public.\n “I see this as the culmination of the entire 10-year-plus lifetime of DeepMind,” company CEO and co-founder Demis Hassabis told  The Verge. “From the beginning, this is what we set out to do: to make breakthroughs in AI, test that on games like Go and Atari, [and] apply that to real-world problems, to see if we can accelerate scientific breakthroughs and use those to benefit humanity.”\n   There are currently around 180,000 protein structures available in the public domain, each produced by experimental methods and accessible through the Protein Data Bank. DeepMind is releasing predictions for the structure of some 350,000 proteins across 20 different organisms, including animals like mice and fruit flies, and bacteria like  E. coli. (There is some overlap between DeepMind’s data and pre-existing protein structures, but exactly how much is difficult to quantify because of the nature of the models.) Most significantly, the release includes predictions for 98 percent of all human proteins, around 20,000 different structures, which are collectively known as the human proteome. It isn’t the  first public dataset of human proteins, but it is the most comprehensive and accurate.\n If they want, scientists can download the entire human proteome for themselves, says AlphaFold’s technical lead John Jumper. “There is a HumanProteome.zip effectively, I think it’s about 50 gigabytes in size,” Jumper tells  The Verge. “You can put it on a flash drive if you want, though it wouldn’t do you much good without a computer for analysis!”\n  After launching this first tranche of data, DeepMind plans to keep adding to the store of proteins, which will be maintained by Europe’s flagship life sciences lab, the European Molecular Biology Laboratory (EMBL). By the end of the year, DeepMind hopes to release predictions for 100 million protein structures, a dataset that will be “transformative for our understanding of how life works,” according to Edith Heard, director general of the EMBL.\n The data will be free in perpetuity for both scientific and commercial researchers, says Hassabis. “Anyone can use it for anything,” the DeepMind CEO noted at a press briefing. “They just need to credit the people involved in the citation.”\n  Understanding a protein’s structure is useful for scientists across a range of fields. The information can help design new medicines, synthesize novel enzymes that break down waste materials, and create crops that are resistant to viruses or extreme weather. Already, DeepMind’s protein predictions are being used  for medical research, including studying  the workings of SARS-CoV-2, the virus that causes COVID-19.\n  New data will speed these efforts, but scientists note it will still take a lot of time to turn this information into real-world results. “I don’t think it’s going to be something that changes the way patients are treated within the year, but it will definitely have a huge impact for the scientific community,” Marcelo C. Sousa, a professor at the University of Colorado’s biochemistry department, told  The Verge.\n Scientists will have to get used to having such information at their fingertips, says DeepMind senior research scientist Kathryn Tunyasuvunakool. “As a biologist, I can confirm we have no playbook for looking at even 20,000 structures, so this [amount of data] is hugely unexpected,” Tunyasuvunakool told  The Verge. “To be analyzing hundreds of thousands of structures — it’s crazy.”\n Notably, though, DeepMind’s software produces  predictions of protein structures rather than experimentally determined models, which means that in some cases further work will be needed to verify the structure. DeepMind says it spent a lot of time building accuracy metrics into its AlphaFold software, which ranks how confident it is for each prediction.\n   Predictions of protein structures are still hugely useful, though. Determining a protein’s structure through experimental methods is expensive, time-consuming, and relies on a lot of trial and error. That means even a low-confidence prediction can save scientists years of work by pointing them in the right direction for research.\n Helen Walden, a professor of structural biology at the University of Glasgow, tells  The Verge that DeepMind’s data will “significantly ease” research bottlenecks, but that “the laborious, resource-draining work of doing the biochemistry and biological evaluation of, for example, drug functions” will remain.\n Sousa, who has previously used data from AlphaFold in his work, says for scientists the impact will be felt immediately. “In our collaboration we had with DeepMind, we had a dataset with a protein sample we’d had for 10 years, and we’d never got to the point of developing a model that fit,” he says. “DeepMind agreed to provide us with a structure, and they were able to solve the problem in 15 minutes after we’d been sitting on it for 10 years.”\n  Proteins are constructed from chains of amino acids, which come in 20 different varieties in the human body. As any individual protein can be comprised of hundreds of individual amino acids, each of which can fold and twist in different directions, it means a molecule’s final structure has an incredibly large number of possible configurations. One  estimate is that the typical protein can be folded in 10^300 ways — that’s a 1 followed by 300 zeroes.\n  Because proteins are too small to examine with microscopes, scientists have had to indirectly determine their structure using expensive and complicated methods like nuclear magnetic resonance and X-ray crystallography. The idea of determining the structure of a protein simply by reading a list of its constituent amino acids has been long theorized but difficult to achieve, leading many to describe it as a “grand challenge” of biology.\n In recent years, though, computational methods — particularly those using artificial intelligence — have suggested such analysis is possible. With these techniques, AI systems are trained on datasets of known protein structures and use this information to create their own predictions.\n   Many groups have been working on this problem for years, but DeepMind’s deep bench of AI talent and access to computing resources allowed it to accelerate progress dramatically. Last year, the company competed in an international protein-folding competition known as CASP and blew away the competition. Its results  were so accurate that computational biologist John Moult, one of CASP’s co-founders, said that “in some sense the problem [of protein folding] is solved.”\n DeepMind’s AlphaFold program has been upgraded since last year’s CASP competition and is now 16 times faster. “We can fold an average protein in a matter of minutes, most cases seconds,” says Hassabis. The company also  released the underlying code for AlphaFold last week as open-source, allowing others to build on its work in the future.\n Liam McGuffin, a professor at Reading University who developed some of the UK’s leading protein-folding software, praised the technical brilliance of AlphaFold, but also noted that the program’s success relied on decades of prior research and public data. “DeepMind has vast resources to keep this database up to date and they are better placed to do this than any single academic group,” McGuffin told  The Verge. “I think academics would have got there in the end, but it would have been slower because we’re not as well resourced.”\n  Many scientists  The Verge spoke to noted the generosity of DeepMind in releasing this data for free. After all, the lab is owned by Google-parent Alphabet, which has been pouring huge amounts of resources into commercial healthcare projects. DeepMind itself  loses a lot of money each year, and there have been  numerous  reports  of tensions between the company and its parent firm over issues like research autonomy and commercial viability.\n Hassabis, though, tells  The Verge that the company always planned to make this information freely available, and that doing so is a fulfillment of DeepMind’s founding ethos. He stresses that DeepMind’s work is used in lots of places at Google — “almost anything you use, there’s some of our technology that’s part of that under the hood” — but that the company’s primary goal has always been fundamental research.\n  “The agreement when we got acquired is that we are here primarily to advance the state of AGI and AI technologies and then use that to accelerate scientific breakthroughs,” says Hassabis. “[Alphabet] has plenty of divisions focused on making money,” he adds, noting that DeepMind’s focus on research “brings all sorts of benefits, in terms of prestige and goodwill for the scientific community. There’s many ways value can be attained.”\n Hassabis predicts that AlphaFold is a sign of things to come — a project that shows the huge potential of artificial intelligence to handle messy problems like human biology.\n “I think we’re at a really exciting moment,” he says. “In the next decade, we, and others in the AI field, are hoping to produce amazing breakthroughs that will genuinely accelerate solutions to the really big problems we have here on Earth.”", "posttime": "2021-07-23 00:13:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,人类,human,deepmind", "title": "DeepMind 表示，它使用人工智能创建了人类蛋白质的“变革性”图谱；有些人将这项工作的潜在影响与人类基因组计划的潜在影响进行了比较", "title_en": "DeepMind says it used AI to create a “transformative” map of human proteins; some compare the potential impact of the work to that of the Human Genome Project", "transed": 1, "url": "https://www.theverge.com/2021/7/22/22586578/deepmind-alphafold-ai-protein-folding-human-proteome-released-for-free?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["人工智能", "人类", "human", "deepmind"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069030, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在为我的公司构建第一个机器学习管道时，我为在我们的堆栈中包含哪些建模库而苦恼。大多数模型开发人员想要使用什么？我对 scikit-learn 和 PyTorch 有强烈的感觉，但是将我对 ML 框架的意见强加于我们公司的基础架构会产生什么后果？从长远来看，哪个建模库会“获胜”？如果我在几年后就会过时的 DSL 中编写建模代码怎么办？ 2016 年，我参加了一个深度学习入门课程，所有作业都在 Tensorflow 中；我最近的深度学习课程完全是在 PyTorch 中进行的。四年后，我认识的所有机器学习研究人员似乎都在使用 PyTorch。少数不使用 PyTorch 的人使用 TF 1.0，他们的口号是“总有一天我会切换到 TF 2.0 或 PyTorch”。发生了什么？几个月后，我意识到库的选择并不重要，因为建模只是机器学习管道中的一小步。其他步骤同样具有挑战性，即使不是更多，也难以维护：例如，迁移数据管道代码比在 PyTorch 中重写基本 TF 建模代码要困难得多。我已经在 TensorFlow、PyTorch、XGBoost、scikit-learn 和 LightGBM 中为我公司的不同任务编写了模型。我什至用 Scala 编写过非 Python 模型。当我为预测任务迭代机器学习管道时，我会尽可能避免更改模型架构，因为我宁愿更改我更好理解的管道部分，例如数据摄取和更好的特征化。我公司的拉取请求表明，与管道代码相比，人们几乎不会接触他们的建模代码。重要的是拥有“即插即用”ML 模型训练器和预测器的基础设施，因为几乎没有一种编程库可以满足所有需求。有些人会指出研究人员绝大多数倾向于 PyTorch 和 JAX 的趋势，并认为这里的赢家确实很重要，因为研究人员变成了公司的数据科学家，这些数据科学家构建模型，而这些模型将“永远”生产和使用。但作为一个领域，我们仍在努力生产模型、将其输出与人类激励保持一致、迭代这些系统并信任这些管道。对于“大科技”之外的任何 ML 从业者来说，他们最大的问题是模型管道以及客户、他们自己和机器之间的价值一致性。毕竟，这些对于产品开发至关重要。即使我们为这些核心问题构建了框架，建模库仍然无关紧要，因为一个问题的多个软件框架可以愉快地共存。人们很聪明，可以轻松学习不同的框架——事实证明，在几年内从 TensorFlow 到 PyTorch 的转变如此之大，这证明开发人员会找到最适合他们工作的工具。更重要的是他们为他们构建的软件拥有正确的基础。此外，业务考虑可以覆盖框架的选择，甚至构建新框架，尤其是在初创企业中。我公司针对特定 ML 问题的代码库经历了这样的事情：首先，我在我选择的 DSL 中编写了实验代码来“解决”问题。然后当我们不得不构建一个产品时，我重写了管道。然后，当我们稍微调整一下时，我重构了管道以生成我们今天定期发布的实时 ML 产品。随着我对产品的当前版本以及其他利益相关者（技术人员或非技术人员）如何与它进行交互有了更清晰的了解，我意识到这些业务考虑比建模库或我对其他 DSL 的看法更能推动管道开发。因此，建模库的赛马具有误导性，目前“现实世界”ML 中最具挑战性的问题围绕着商业价值、生产化、小型化以及重复训练和推理的流水线。但由于编程语言和基础设施推动了软件的创新，建模库的演变仍然值得思考。在 The Mythical Man-Month: Essays on Software Engineering 中，Fred Brooks 引入了第二系统效应的概念，即“小型、优雅和成功的系统被过度设计的、臃肿的系统所取代的趋势，由于膨胀期望和过度自信。”著名的例子包括 IBM System/360 操作系统（它继承了 1950 年代的 IBM 700/7000 系列）和 Multics 操作系统（它继承了 1960 年代后期的 Compatible Time-Sharing System）。我认为 TF 1.0 是成功的：它加速了许多深度学习研究，范围相当狭窄且经过深思熟虑，并通过 XLA 编译、TPU 等率先在硬件垂直领域进行创新。但随着时间的推移，当数百名 TensorFlow 工程师试图解决该软件的局限性并将 TensorFlow 转变为适用于所有人的机器学习库时，它遭受了二次系统效应并成为了 TF 2.0，一个不为任何人使用的机器学习库（可能除了 Google ）。他们试图解决的一组问题是“使模型在生产环境中工作”：TFX 是一个很好的例子，说明了过度炒作和未充分利用的 TF 2.0 工具。将 PyPI 统计数据与 Kubeflow 的上下文进行比较； TFX 构建了他们的框架以很好地适应 Kubeflow，但 Kubeflow 用户仍然不想使用 TFX。这并不是说生产 ML 的问题不存在；相反，TFX 目前似乎并不是解决许多这些极具挑战性的问题的方法。如果 UX 违反直觉，并且工程师需要成为专业的错误日志解析器才能精通该工具，那么拥有教程也无济于事。\n所有这些都是关于我对 TensorFlow UX 的批评，我实际上在工作中使用 TF 2.0——主要是出于懒惰。 Spark 到 TFRecord 到 TFData 到 TF 模型管道有部分文档记录，而 Spark 到 TFRecord 到某些东西到 PyTorch 模型管道的文档几乎没有。但是我的模型的 DSL 几乎不是我每天都在考虑的事情，因为我的大部分问题都不是“我可以多快从头开始编写转换器或 convnet 架构”。这个行业的人很少从头开始构建东西。软件产品建立在增量原则之上；代码和功能会随着时间的推移而积累。所以我对我最初的问题的回答是，从长远来看，哪个建模库会“获胜”是不值得担心的，因为如果多个库都做一些重要的事情，比如拥护数据流范式或轻松的自微分，它们就可以获胜。如果您是工程师，请不要围绕特定的建模库构建管道。如果您是研究人员或数据科学家，则不必担心学习所有建模库或公司职位描述中提到的任何库。软件历史表明，建模框架膨胀是不可避免的，只要这些库的最大优先事项是相互竞争，它们就会收敛到相同的关键任务建模问题的解决方案——急切执行、易于构建从头开始建模，能够很好地查看损失曲线，等等。但这些只是大多数“现实世界”机器学习问题的一小部分，作为机器学习从业者，归根结底，并不是因为您在训练模型方面的专业知识而被聘用；您受雇于使机器学习系统始终如一地为最终用户提供价值。感谢 Reese Pathak、Jay Bhambhani 和 Debnil Sur 对多个草稿的反馈。", "note_en": "When building the first machine learning pipelines for my company, I agonized over which modeling libraries to include in our stack. What would most model developers want to use? I felt strongly about scikit-learn and PyTorch, but what would be the consequences of imposing my opinions on ML frameworks on our company’s infrastructure? Which modeling library would “win” in the long-term? What if I wrote modeling code in a DSL that would become obsolete in a few years?\n In 2016, I took an introductory deep learning class with assignments all in Tensorflow; my most recent deep learning course was completely conducted in PyTorch. Four years later,  it seems like all ML researchers I know use PyTorch. The few who don’t use PyTorch use TF 1.0, with the “some day I’ll switch to TF 2.0 or PyTorch” mantra. What happened?\n Over several months, I realized that  the choice of library does not matter, as modeling is just a tiny step in the machine learning pipeline. Other steps are equally, if not more, challenging to maintain: for example,  it is much harder to migrate data pipeline code than rewrite basic TF modeling code in PyTorch. I’ve written models in TensorFlow, PyTorch, XGBoost, scikit-learn, and LightGBM for different tasks for my company. I’ve even written non-Python models in Scala. When I iterate on machine learning pipelines for a prediction task, I avoid changing the model architectures as much as possible since  I’d rather change parts of the pipeline I understand better, like data ingestion and better featurization. My company’s pull requests show that people hardly touch their modeling code compared to pipeline code. What matters is having the infrastructure to “plug and play” ML model trainers and predictors, since there is almost never one programming library that meets all needs.\n Some would point to the trends of researchers overwhelmingly preferring PyTorch and JAX and argue that a winner here actually does matter, because researchers turn into data scientists at companies, these data scientists build models, and the models will get productionized and used “forever.” But as a field, we’re still struggling with productionizing models, aligning their outputs with human incentives, iterating on these systems, and trusting these pipelines. For any ML practitioners outside “big tech,” their biggest problems are model pipelines and value alignment between customers, themselves, and machines. After all, these are essential to product development. Even if we built frameworks for these central problems, the modeling library still won’t matter because  multiple software frameworks for a problem can happily coexist. People are smart and can easily learn a different framework — the fact that there was such a large, rapid  transition from TensorFlow to PyTorch within a few years proves that developers will find the best tool for their job. It matters more that they have the correct foundation for software they build.\n Additionally, business considerations can override the choice of framework or even build new frameworks, particularly in startups. My company’s codebase for a particular ML problem has experienced something in this vein: first, I wrote experimental code in my DSLs of choice to “solve” the problem. Then when we had to build a product, I  rewrote the pipeline. Then when we pivoted slightly, I  refactored the pipeline to produce the live ML product we’re regularly releasing today. As I gained more clarity on the current version of the product and how other stakeholders (technical or nontechnical) might interact with it, I realized these business considerations drove pipeline development more than the modeling libraries or my opinions on other DSLs.\n So the horse race of modeling libraries is misleading, and the most challenging problems in “real-world” ML right now revolve around business values, productionization, miniaturization, and pipelining for repeated training and inference. But since  programming languages and infrastructure  drive innovation in software, it’s still worth thinking about the evolution of modeling libraries. In  The Mythical Man-Month: Essays on Software Engineering, Fred Brooks introduces the concept of the   second-system effect to be “the tendency of small, elegant, and successful systems to be succeeded by over-engineered, bloated systems, due to inflated expectations and overconfidence.” Famous examples include the IBM System/360 operating system (which succeeded the IBM 700/7000 series from the 1950s), and the Multics operating system (which succeeded Compatible Time-Sharing System from the late 1960s).\n I consider TF 1.0 a success: it accelerated a lot of deep learning research, was fairly narrow and thoughtful in scope, and spearheaded innovation in the hardware vertical with XLA compilation, TPUs, and more. But over time, as hundreds of TensorFlow engineers tried to address the software’s limitations and turn TensorFlow into a machine learning library for everybody, it suffered from the second-system effect and became TF 2.0, a machine learning library for nobody (possibly except for Google). One set of problems they tried to address is “making models work in production settings:” TFX is a great example of an  overhyped and  underused TF 2.0 tool. Compare the PyPI stats with  Kubeflow’s for context; TFX built their framework to fit nicely with Kubeflow and Kubeflow users still don’t want to use TFX. This is not to say the problems with production ML aren’t real; rather, it seems TFX currently isn’t  the solution to many of these incredibly challenging problems. Having tutorials doesn’t help if the  UX is counterintuitive and engineers need to become professional error log parsers to become proficient with the tool.\n All this being said about my criticism for the TensorFlow UX, I actually use TF 2.0 at work — mainly out of laziness. The Spark to TFRecord to TFData to TF model pipeline is  partially  documented, whereas the Spark to TFRecord to something to PyTorch model pipeline is only  barely  documented. But the DSL for my models is hardly something I think about on a day-to-day basis, since most of my problems aren’t “how quickly can I code up a transformer or convnet architecture from scratch.” People in this industry rarely build things from scratch. Software products are built on the  principle of incrementality; code and features accumulate over time.\n So my answer to my original question is that it’s not worth worrying about which modeling library will “win” in the long run, because  multiple libraries can win if they each do something important, such as championing the dataflow paradigm or easy autodifferentiation. If you’re an engineer, don’t build your pipelines around a specific modeling library. If you’re a researcher or data scientist, don’t worry about learning all the modeling libraries or whatever libraries the company’s job description mentions. Software history indicates that the modeling framework bloat is inevitable, and for as long as these libraries’ biggest priorities are to compete with each other, they will all converge to the same solutions to mission-critical modeling problems —  eager execution, ease of  building a model from scratch, ability to  nicely view loss curves, and more. But these are only a fraction of most “real-world” machine learning problems, and you, as a machine learning practitioner, at the end of the day aren’t hired only for your expertise in training a model once; you’re hired to make a machine learning system consistently deliver value to an end user.\n Thanks to  Reese Pathak,  Jay Bhambhani and  Debnil Sur for their feedback on multiple drafts.", "posttime": "2021-07-23 00:12:57", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "建模,libraries,模型", "title": "建模库无关紧要", "title_en": "Modeling Libraries Don’t Matter", "transed": 1, "url": "https://www.shreya-shankar.com/modeling-libraries/", "via": "", "real_tags": ["建模", "libraries", "模型"]}, {"category": "", "categoryclass": "", "imagename": "3cf55c86c34fd37ca687a21662fa1c30.jpg", "infoid": 1069029, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他睡眠不足，几乎没有弹药，独自在阿拉斯加的荒野中。嗯，并不孤单。几天前，在诺姆郊外约 40 英里的一个采矿营地，这名男子连续几个晚上抵御了一只灰熊顽强的进攻。直升机的飞行员说，在周五执行任务的途中，海岸警卫队直升机的机组人员看到这名男子在空中挥舞双手，这是一个广为人知的求救信号。在一间小屋的铁皮屋顶上，潦草地写着“求救”和“救救我”。小屋的门被扯掉了。据海岸警卫队称，船员将这名男子带到诺姆接受治疗，因为他的躯干和腿部受伤没有生命危险。就这样结束了长达一周的磨难，它可以作为“亡魂”的续集，其中莱昂纳多·迪卡普里奥被计算机生成的灰熊殴打。 “在某个时候，一只熊把他拖到了河边，”中将。海岸警卫队直升机的飞行员之一贾里德·卡巴哈尔 (Jared Carbajal) 在周三接受采访时说。 “他有一把手枪。他说那只熊每晚都回来，他已经几天没睡了。”海岸警卫队没有确定这名男子的身份，救援人员说他 50 多岁或 60 岁出头，自 7 月 12 日以来一直住在小屋里，因为小规模采矿索赔。目前尚不清楚这名男子是如何到达偏远营地的，该营地没有手机服务，位于河流流域。 Carbajal 指挥官说，海岸警卫队 MH-60 Jayhawk 直升机改变了大约一英里的航向，以避开一些云彩，当时他的副驾驶注意到了一些东西。\n“他说，&#39;嘿，下面有个人在向我们挥手，&#39;”指挥官 Carbajal 说。 “我说，&#39;他是用一只手挥手还是用两只手挥手？&#39;” “我说得很好，这通常是一种痛苦的表现，”飞行员回忆说，他告诉了直升机的其他三名机组人员。 35 岁的副驾驶 jg AJ Hammac 中尉在周三接受采访时说，他看到这名男子跌跌撞撞地走出了他的小屋。这对他来说是一个奇怪的景象。哈马克中尉驻扎在马萨诸塞州的科德角，正在阿拉斯加为海岸警卫队效力两周。 “我们真的不会在偏僻的地方遇到人，”哈马克中尉说。 “他有点挣扎。当我们过来的时候，他正手和膝盖挥舞着一面白旗。” “他看起来肯定是在外面呆了一段时间，”他说。阿拉斯加渔猎部发言人里克格林周三在一封电子邮件中表示，在该男子获救的地区，灰熊很普遍，尤其是在每年的这个时候。该部门没有关于这次袭击的更多信息，也没有说明是否正在调查这次遭遇。根据阿拉斯加卫生官员 2019 年的一份报告，在 2000 年至 2017 年期间，该州有 68 人因在 66 次熊袭击中受伤而住院。在此期间，有 10 人因熊袭击而死亡。\n阿拉斯加海岸警卫队发言人一等士官阿里布莱克本周三在接受采访时表示，一个人多次遇到同一只熊是不寻常的。她说，这名男子的情况变得越来越危急。 “他只剩下两发子弹了，”她谈到他的弹药时说。 “我想你这么久不睡觉会有点发疯。”据海岸警卫队称，这次遭遇提醒人们携带紧急信标、卫星电话或短信设备的重要性。 37 岁的 Carbajal 指挥官自 2009 年以来一直是海岸警卫队的飞行员，他说他以前从未被需要营救的人标记过。救援人员花了大约 15 分钟才将这名男子带到诺姆，他说，在那里，这名男子坚持要自己走到一辆等候的救护车上。 “我想，你可以看出他的肾上腺素开始下降，并开始意识到发生了什么，”他说。 “他不想进入轮床。”海岸警卫队的直升机一直从科策布飞往诺姆，第二天机组人员被派去驾驶一组科学家在海岸线上搜寻死鲸、海象和海豹。 “如果我们在下一个河谷那边，”卡巴哈尔指挥官说，“我们会完全想念他。”", "note_en": "He was sleep-deprived and nearly out of ammunition, alone in the wilderness of Alaska. Well, not really alone.\n For several nights in a row, the man had fended off the tenacious advances of a grizzly bear that had attacked him a few days earlier at a mining camp some 40 miles outside Nome.\n  En route to a mission on Friday, the crew of a Coast Guard helicopter saw the man waving both hands in the air, a widely recognized distress signal, the helicopter’s pilot said. On the tin roof of a shack, SOS and “help me” had been scrawled. The shack’s door had been ripped off.\n The crew took the man to Nome to be treated for bruises to his torso and a leg injury that was not life-threatening, according to the Coast Guard. So ended a weeklong ordeal that could pass as a sequel to “The Revenant,” in which Leonardo DiCaprio was mauled by a  computer-generated grizzly bear.\n “At some point, a bear had dragged him down to the river,” Lt. Cmdr. Jared Carbajal, one of the pilots of the Coast Guard helicopter, said in an interview on Wednesday. “He had a pistol. He said that the bear kept coming back every night and he hadn’t slept in a few days.”\n The Coast Guard did not identify the man, who rescuers said was in his late 50s or early 60s and had been staying in the shack since July 12 on the small mining claim. It was not clear how the man had reached the remote camp, which has no cellphone service and is in a river drainage area.\n Commander Carbajal said that the Coast Guard MH-60 Jayhawk helicopter had changed its course by about a mile to avoid some clouds when something caught the eye of his co-pilot.\n “He said, ‘Hey there’s a guy down there and he’s waving at us,’” Commander Carbajal said. “I said, ‘Is he waving with one hand or two hands?’”\n  “I said well, that’s usually a sign of distress,” the pilot recalled telling the helicopter’s three other crew members.\n Lt. j.g. A.J. Hammac, the 35-year-old co-pilot, said in an interview on Wednesday that he saw the man stumble out of his shack. It was a curious sight for him. Lieutenant Hammac is based on Cape Cod in Massachusetts and is spending two weeks in Alaska for the Coast Guard.\n “We don’t really come across people in the middle of nowhere,” Lieutenant Hammac said. “He was kind of struggling. When we came around, he was on his hands and knees waving a white flag.”\n  “He definitely looked like he had been out there for a while,” he said.\n Rick Green, a spokesman for the Alaska Department of Fish and Game, said in an email on Wednesday that grizzly bears were prevalent in the area that the man had been rescued from, particularly during this time of year. The department did not have additional information about the attack or say whether it was investigating the encounter.\n According to a 2019 report by Alaskan health officials, 68 people in the state were hospitalized for injuries sustained in 66 bear attacks from 2000 to 2017. Ten people died as a result of bear attacks during that period.\n Petty Officer First Class Ali Blackburn, a spokeswoman for the Coast Guard in Alaska, said in an interview on Wednesday that it was unusual for a person to have several encounters with the same bear. She said the man’s situation had become increasingly dire.\n “He only had two rounds left,” she said of his ammunition. “I’d imagine you’d be a little loopy after not sleeping for so long.”\n The encounter served as a reminder of the importance of carrying an emergency beacon or satellite phone or texting device, according to the Coast Guard.\n Commander Carbajal, 37, a Coast Guard pilot since 2009, said he had never been flagged down before by someone who needed to be rescued. It took about 15 minutes for the rescuers to fly the man to Nome, where, he said, the man insisted on walking himself to a waiting ambulance.\n “You could tell he was starting to come off of the adrenaline, I think, and started to realize what happened,” he said. “He did not want to get in the gurney.”\n The Coast Guard helicopter had been flying from Kotzebue to Nome, where the crew had been assigned the next day to fly a team of scientists to search the coastline for dead whales, walruses and seals.\n “If we would have been in the next river valley over,” Commander Carbajal said, “we would have totally missed him.”", "posttime": "2021-07-23 00:12:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "看到,guard", "title": "一只灰熊在阿拉斯加恐吓了一个人好几天。海岸警卫队看到了他的 SOS", "title_en": "A Grizzly Bear Terrorized a Man for Days in Alaska. The Coast Guard Saw His SOS", "transed": 1, "url": "https://www.nytimes.com/2021/07/22/us/bear-attack-alaska.html", "via": "", "real_tags": ["看到", "guard"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069028, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今年夏天，我一直在参加 SLICED 机器学习竞赛，参赛者有两个小时的时间来打开新数据集、构建预测模型并作为 Kaggle 提交进行评分。参赛者主要根据模型表现进行评分，但也会通过可视化和讲故事以及观众投票获得分数。在 SLICED 之前，我几乎没有任何竞争性机器学习的经验，所以我学到了很多！到今天为止，我在积分榜上排名第 5，离季后赛的截止日期还差，所以如果你想看到我继续，你可以在这里投票给我作为“观众选择”！ （虽然我最喜欢的比赛之一是观众可以与 Kaggle 提交的作品一起竞争，所以我希望我无论如何都会加入！）对于 SLICED 的四集（包括我参加比赛的两周）我分享了我的过程的截屏视频。第 4 集和第 7 集是我现场比赛的那些（你也可以在这里找到代码）：如果你只看一集，我推荐 AirBnb，这太棒了！ （这很容易成为我最喜欢的比赛数据集，混合了文本、地理和分类数据——尽管第 1 集和第 8 集也很令人愉快）。在这篇文章中，我将分享我在使用 R 和 tidymodels 包集合进行竞争性 Kaggle 建模时学到的一些知识。多年来，Python 在机器学习工具方面具有稳固的优势（scikit-learn 只是炸药），但 R 一直在快速追赶。 RStudio 的 tidyverse 团队一直在开发 tidymodels 软件包套件，以便与 tidyverse 工具配合使用。这是我第一次真正获得与他们的深入体验，我将分享我喜欢（和不喜欢）的内容。与“成功之巅”或“厄运之坑”相反，“成功之坑”是这样一种哲学，即用户不应该为了做正确的事而努力奋斗。他们应该能够几乎偶然地养成良好的习惯，因为这比错误地使用它们更容易。\n在进行机器学习时，您可能会陷入很多陷阱，而 tidymodels 包旨在避免那些“不假思索”的陷阱。我认为最令人印象深刻的是在数据清理过程中避免数据泄漏。在拟合模型之前，想想我们可能对数据集应用的许多特征工程步骤中的一些： 分桶稀有类别（例如，用“其他”替换分类变量的稀有级别） recipes 包提供了执行这些操作的函数（例如 step_impute_mean 、step_pca 和 step_other），但这只是其价值的一部分。配方包的绝妙见解是，每个特征工程步骤本身都是一个需要训练的模型！如果在用平均值估算值时包含测试集，或者在应用 PCA 时，您会不小心输入来自测试集的信息（这使您更有可能过度拟合而没有意识到这一点）。 recipes 包明确说明了这一点：在将配方应用于数据集（使用 bake()）之前，必须对其进行数据训练（使用 prep()）。通过将此配方与模型规范结合到工作流对象中，您可以封装特征工程和建模的整个从头到尾的过程。其他 tidymodels 工具然后利用这个封装的工作流程。我发现其他每个包也在 tidymodels 的“成功坑”中发挥作用。例如：交叉验证（rsamples）：交叉验证是避免过度拟合的关键方法之一，尤其是在选择模型和选择超参数时。 vfold_cv 和 fit_resamples 使它变得容易。\n调整超参数 (tune)： tune_grid 使得指定超参数组合变得微不足道，看看性能如何变化。 autoplot() 尤其具有真正的“开箱即用”的感觉。尝试不同的模型（欧洲防风草）：我真的很喜欢不必处理每个建模包的输入和输出特性；更少的时间阅读文档意味着更多的时间专注于我的模型和数据。文本分类（textrecipes）：这在我心中有一个特殊的位置。我帮助开发了 tidytext 包，但我从来没有对它如何融入机器学习工作流程感到非常兴奋。通过提供标记化和过滤工具，textrecipes 包将文本变成了另一种类型的预测器。这些便利不仅仅是节省精力或时间；它们共同构成了一个更加稳健和有效的流程。在使用 tidymodels 之前，我可能只是跳过了调整参数，或者停止了我尝试的第一个模型类型，因为迭代太困难了（这种现象称为 shlep 盲）。我在 tidymodels 中看到的一些阻力来自“这太容易了——你没有仔细考虑代码在做什么！”但我认为这让它倒退了。通过消除编写程序逻辑的负担，我可以专注于有关我的数据和模型的科学和统计问题。愚蠢的抱怨：“这个工具让你无法思考。”当他们使用好工具时，没有人会停止思考。他们会考虑更重要的事情 — David Robinson (@drob) 2016 年 8 月 26 日\n我对 tidymodels 软件包的所有内容都不满意，尤其是当我第一次开始比赛时。在某些情况下，我觉得 API 在他们可以使用函数参数时会强迫过度管道，使模型规范比他们必须的要冗长得多。正如我稍后将讨论的那样，stacks 包仍然是一个具有粗略实现草案的好主意。但好消息是该团队正在继续改进它！在我的 SLICED 比赛过程中，我打开了两个 GitHub 问题（欧洲防风草和工作流），当我到达第二圈时，它们已经修复了！ 1 在今晚的#SLICED 中，将会震撼欧洲防风草和工作流的开发版本 A. 防风草模型现在有一个默认值而不是需要 set_engine() B.工作流() 现在采用预处理器/规范参数 💕 tidymodels 团队最近的工作https://t.co/2O4Xfen2kU pic.twitter.com/9yI4FYTilu — David Robinson (@drob) 2021 年 7 月 14 日现在我已经讨论了这些工具，我将谈谈机器学习本身。我知道我几乎是最后一个欣赏这一点的人，但 xgboost 在快速创建高性能模型方面的强大功能令人惊叹。当我为比赛练习时，我很早就磨练了一个过程。类似于：拟合 xgboost boosted 树模型，learn_rate = .02，mtry 从 2-4 不等，树从 300 到 800 不等\n绘制学习曲线（显示随着树数量变化的性能），并在需要时使用它来调整 mtry 和树。在大多数剧集中，这个死记硬背的过程通常是我最终模型的大部分时间！它几乎总是胜过我从线性或随机森林模型中得到的任何东西，即使有大量的特征工程和调整。该过程特别方便，因为您可以从单个模型拟合中获得整个学习曲线（改变树的数量），因此可以非常快速地使用 tune 包。这与我使用 keras（一个深度学习框架）的经验非常不同，我发现在我什至击败随机森林之前，我通常必须花费大量时间摆弄超参数。 keras 肯定有可能被我的一些提升的树击败，但我怀疑我是否会以同样快的速度获得它。在我自己的专业工作中，我通常喜欢构建可解释的模型，进行可视化，并了解每个特征的作用。但是提升树在“黑匣子”的方向上走得更远。但是竞争性机器学习有一种有趣的方式，可以将注意力集中在性能指标上。除此之外，我印象深刻的是我可以从基尼系数这样的重要性度量中学到很多东西。与线性模型中的特征不同，这些可以代表有趣的非线性项，它有助于突出我可以从模型中删除的不重要的项。说起来……我很快发现 xgboost 的一个特点是提供太多功能很容易对其造成伤害。 xgboost 中的低值特征削弱了其余特征的重要性，因为它们出现在较少随机选择的树中。这与正则化线性回归（例如 LASSO）形成对比，其中惩罚项通常很容易将额外系数设置为零。当我们有分类预测变量时，就会出现这种情况。如果一个类别有 20 个级别，那么当变成 one-hot 编码时，就会有 20 个额外的二进制变量。与（比如说）一两个高度预测模型相比，这些最终生成的树要多得多。我倾向于发现，当我预先删除高基数变量时，我的模型表现更好（我的理解是 catboost 可能会更优雅地处理这些！）\n一旦您在调整模型时遇到收益递减点，通常最好从另一个产生不同类型错误的模型重新开始，并将它们的预测平均在一起。这就是模型堆叠背后的原理，这是一种集成学习。一个完美的例子是 AirBnb 定价视频。我能够使用 xgboost 建立一个强大的模型，该模型基于纬度/经度等数字变量（对树木非常有效！）和一些分类变量。但数据还包括稀疏的分类变量，如街区和文本字段（公寓名称），其中“联排别墅”或“工作室”等标记具有很强的预测能力 stacks 包将此过程置于 tidymodels 框架内。在我使用过的所有 tidymodels 包中，stacks 包是最明显处于早期状态的包。对于初学者来说，它对组合模型的方式过于固执己见，总是使用带有自举交叉验证的正则化线性模型。部分原因是，即使只组合两个或三个模型，它也很慢。而且我发现当输入设置不正确时，它有时会出现无益的错误，这表明它需要一些更重的“游戏测试”。我在比赛的过程中学到了很多关于 tidymodels 和机器学习的知识。但我最喜欢的部分体验是，因为它是在 Kaggle 上公开举办的，观看比赛直播的人可以与自己竞争（通常比参赛者表现得更好！）该主题仅适用于 @kierisi 和 @kierisi。如果你不是@kierisi，你可以滚动过去。 JESSE 的手工切片模因，a 🧵：pic.twitter.com/mYHR3bobGE — Chelsea Parlett-Pelleriti（@ChelseaParlett）2021 年 6 月 23 日\n我的竞争对手 Jesse Mostipak 想出了一个绝妙的技巧，在她的模特训练时在屏幕上展示模因：这至少是她在我们比赛的聊天投票部分压倒我的原因之一（也是我正在尝试的原因之一）在这篇文章中拿出一些表情包。迟到总比不做强！）不管你喜欢不喜欢这些表情包，如果你想看到我去季后赛，你可以在这里投票给我。不管我能不能进入季后赛，我都会提交一些意见书，我很荣幸有机会和大家一起学习。特别感谢我的朋友兼同事 Julia Silge，她全职从事 tidymodels 软件包的工作，并帮助讨论了我对软件包的一些想法和反馈。 ↩ 机器学习匆忙：我从 SLICED ML 竞赛中学到的东西发表在 .", "note_en": "This summer I’ve been competing in the  SLICED machine learning competition, where contestants have two hours to open a new dataset, build a predictive model, and be scored as a Kaggle submission. Contestants are graded primarily on model performance, but also get points for visualization and storytelling, and from audience votes. Before SLICED I had almost no experience with competitive ML, so I learned a lot!\n As of today I’m 5th in the standings, short of the cutoff for the playoffs, so if you want to see me continue   you can vote for me as an “Audience Choice” here! (Though one of my favorite things about the competition is that audience members can compete along with Kaggle submissions, so I expect I’ll join in in any case!)\n For four of the SLICED episodes (including the two weeks I was competing) I shared a screencast of my process. Episodes 4 and 7 were the ones I was competing live (you can also find the code  here):\n  If you watch just one, I recommend AirBnb, which was a blast! (It was easily my favorite dataset of the competition, with a mix of text, geographic, and categorical data- though episode 1 and episode 8 were also delightful).\n In this post, I’ll share some of what I’ve learned about using R, and the  tidymodels collection of packages, for competitive Kaggle modeling.\n  For years Python has had a solid advantage in tooling for machine learning ( scikit-learn is just dynamite), but R has been catching up fast. The tidyverse team at RStudio has been developing the tidymodels suite of packages to play well with the tidyverse tools. This was the first time I’d really gotten in-depth experience with them, and I’ll share what I liked (and didn’t).\n  The  “pit of success”, in contrast to a “summit of success” or a “pit of doom”, is the philosophy that users shouldn’t have to strive and struggle to do the right thing. They should be able to fall into good habits almost by accident, because it’s easier than using them incorrectly.\n There’s a lot of traps you can fall into when doing machine learning, and the tidymodels packages are designed to avoid those “without thinking”. I think the single most impressive one is  avoiding data leakage during your data cleaning.\n  Think of a few of the many feature engineering steps we might apply to a dataset before fitting a model:\n Bucketing rare categories (e.g. replacing rare levels of a categorical variable with “Other”)\n The recipes package offers functions for performing these operations (like  step_impute_mean,  step_pca, and  step_other), but that’s only part of its value. The brilliant insight of the recipes packages is that  each of those feature engineering steps is itself a model that needs to be trained! If you include the test set when you’re imputing values with their mean, or when you’re applying PCA, you’re accidentally letting in information from the test set (which makes you more likely to overfit and not realize it).\n  The recipes package makes this explicit: a recipe has to be trained on data (with  prep()) before it is applied to a dataset (with  bake()). By combining this recipe with a model specification into a  workflow object, you encapsulate the entire start-to-end process of feature engineering and modeling. Other tidymodels tools then take advantage of this encapsulated workflow.\n  I’ve found each of the other packages also plays a role in the tidymodels “pit of success”. For instance:\n Cross validation (rsamples): Cross validation is one of the key ways to avoid overfitting, especially when selecting models and choosing hyperparameters.  vfold_cv and  fit_resamples make it easy.\n  Tuning hyperparameters (tune):  tune_grid makes it trivial to specify a combination of hyperparameters see how the performance varies.  autoplot() in particular has a real “does exactly what I want out of the box” feel.\n  Trying different models (parsnip): I really like not having to deal with each modeling package’s idiosyncrasies of inputs and outputs; less time reading docs means more time focusing on my model and data.\n  Text classification (textrecipes): This has a special place in my heart. I helped develop the tidytext package, but I’ve never been completely thrilled with how it fit into a machine learning workflow. By providing tools for tokenization and filtering, the textrecipes package turns text into just another type of predictor.\n These conveniences aren’t just a matter of saving effort or time; together they add up to a more robust and effective process. Prior to tidymodels, I might have just skipped tuning a parameter, or stopped with the first model type I tried, because iterating would be too difficult (a phenomenon known as  shlep blindness).\n Some of the resistance I’ve seen to tidymodels comes from a place of “This makes it too  easy- you’re not thinking carefully about what the code is doing!” But I think this is getting it backwards. By removing the burden of writing procedural logic, I get to focus on scientific and statistical questions about my data and model.\n Silly complaint: &#34;this tool keeps you from thinking.&#34; No one stops thinking when they use good tools. They think about more important things\n— David Robinson (@drob)  August 26, 2016\n  I wasn’t happy with everything about the tidymodels packages, especially when I first started the competition. In some cases I felt the API forced excessive piping when they could have used function arguments, making the model specifications much more verbose than they had to be. And as I’ll discuss later, the  stacks package still feels like a terrific idea with a rough draft implementation.\n But the great news is that the team is continuing to improve it! I opened two GitHub issues ( parsnip and  workflows) in the course of my SLICED competition, and by the time I reached my second lap they were already fixed!  1\n In tonight&#39;s  #SLICED, gonna be rocking the development versions of parsnip &amp; workflows  A. parsnip models now have a default instead of needing set_engine() B. workflow() now takes a preprocessor / spec argument  💕 the recent work from the tidymodels team  https://t.co/2O4Xfen2kU  pic.twitter.com/9yI4FYTilu\n— David Robinson (@drob)  July 14, 2021\n  Now that I’ve talked about the tools, I’ll get to the machine learning itself.\n I know I’m just about the last person to appreciate this, but it was remarkable how powerful xgboost was at creating high performance models quickly. When I was practicing for the competition, I honed in on a process early on. Something like:\n Fit an xgboost boosted trees model, with learn_rate = .02, mtry varying from 2-4, and trees varying from 300 to 800\n  Plot a learning curve (showing the performance as the number of trees varies), and use it to adjust mtry and trees if needed.\n In most of the episodes, this rote process usually me most of the way to my final model! It almost always outperformed anything I could get from linear or random forest models even with heavy feature engineering and tuning. The process is especially convenient because you can get an entire learning curve (varying the number of trees) from a single model fit, so it’s a very fast use of the tune package.\n  This is very different from my experience with keras (a deep learning framework), which I found I’d usually have to spend a solid amount of time fiddling with hyperparameters before I could even beat a random forest. It’s certainly possible that keras could have been beaten some of my boosted trees, but I doubt I would have gotten to it nearly as quickly.\n  In my own professional work I usually like to build interpretable models, make visualizations, and understand the role of each feature. But boosted trees are farther in the direction of “black boxes”. But competitive ML has an amusing way of “focusing the mind” on a performance metric.\n  Besides which, I was impressed how much I could learn from an importance measure like Gini coefficient. Unlike the features in a linear model, these could represent interesting nonlinear terms, and it helped highlight unimportant terms I could drop from the model. Speaking of which…\n  Something I quickly discovered with xgboost is that providing  too many features could easily hurt it. Low-value features in an xgboost dilute the importance of the remaining ones, since they show up in fewer randomly selected trees. This is in contrast to regularized linear regression (e.g. LASSO), where it’s usually pretty easy for the penalty term to set extra coefficients to zero.\n This pops up when we have categorical predictors. If a category has 20 levels, then when turned into one-hot encoding that’s 20 additional binary variables. Those end up in a lot more trees than (say) one or two highly predictive models. I tended to find that my models performed better when I just removed high-cardinality variables up front (my understanding is that catboost might handle these more gracefully!)\n  Once you’ve hit a point of diminishing returns when tuning a model, it’s often better to start fresh with another model that makes a different  kind of error, and average their predictions together. This is the principle behind model stacking, a type of ensemble learning.\n   A perfect example was in the AirBnb pricing video. I was able to get to a strong model with xgboost based on numeric variables like latitude/longitude (very effective with trees!) and a few categorical variables.\n  But the data also included sparse categorical variables like neighborhood, and a text field (the apartment name) where tokens like “townhouse” or “studio” had a lot of predictive power\n  The  stacks package puts this process within the tidymodels framework. Of all the tidymodels packages I’ve used, the stacks package is the one that’s most clearly in an early state. For starters, it’s overly opinionated about the way it combines models, always using a regularized linear model with bootstrapped cross validation. Partly because of that, it’s slow even when combining just two or three models. And I’ve found that it sometimes gives unhelpful errors when the inputs aren’t set up correctly, which suggests it needs some heavier “playtesting”.\n  I learned a lot about tidymodels and machine learning in the process of competing. But my favorite part of the experience was that because it was hosted publicly on Kaggle, people watching the competition live could compete themselves (often outperforming the contestants!)\n  This thread is for  @kierisi and  @kierisi only. If you&#39;re not  @kierisi you can scroll past.  ARTISINAL SLICED MEMES FOR JESSE, a 🧵:  pic.twitter.com/mYHR3bobGE\n— Chelsea Parlett-Pelleriti (@ChelseaParlett)  June 23, 2021\n My competitor  Jesse Mostipak came up with a brilliant schtick of showing memes on screen while her models were training:\n  This was at least one of the reasons she crushed me in the chat voting portion of our competition (and one of the reasons I’m trying out some memes in this post. Better late than never!)\n  Whether you like the memes or not, if you’d like to see me go to the playoffs you can  vote for me here. And whether or not I do make it to the playoffs, I’ll be joining in with some submissions, and I’m honored to have had the chance to learn with everyone.\n Thanks especially to my friend and colleague  Julia Silge, who works on the tidymodels packages full time and helped talk through some of my thoughts and feedback on the packages.  ↩\n    Machine learning in a hurry: what I&#39;ve learned from the SLICED ML competition was published on  .", "posttime": "2021-07-23 00:12:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器,learning,模型", "title": "机器学习匆忙", "title_en": "Machine Learning in a Hurry", "transed": 1, "url": "http://varianceexplained.org/r/sliced-ml/", "via": "", "real_tags": ["机器", "learning", "模型"]}, {"category": "", "categoryclass": "", "imagename": "33e193e17a418c1580c05f6e3f9e2e8a.jpg", "infoid": 1069027, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "就在 Google 的 DeepMind AI 小组最终详细描述其生物学工作一周后，该公司发布了一篇论文，解释了它如何分析人类基因组中编码的几乎所有蛋白质并预测其可能的三维结构——这种结构可能很关键用于了解疾病和设计治疗方法。在不久的将来，所有这些结构都将通过欧洲生物信息学研究所在知识共享许可下发布，该研究所已经拥有一个主要的蛋白质结构数据库。在与该论文发布相关的新闻发布会上，DeepMind 的 Demis Hassabis 明确表示该公司并没有就此止步。除了论文中描述的工作之外，该公司还将发布 20 种主要研究生物的基因组结构预测，从酵母到果蝇再到小鼠。总的来说，数据库发布将包括大约 350,000 个蛋白质结构。我们上周刚刚描述了 DeepMind 的软件，所以我们不会在这里详细介绍。这项工作是一个基于人工智能的系统，训练现有蛋白质的结构，这些结构已经通过实验室实验（通常是费力的）确定。该系统使用该训练，加上它从进化相关的蛋白质家族中获得的信息，来预测蛋白质的氨基酸链如何在三维空间中折叠起来。结果的三维结构可以为我们提供有关蛋白质的关键信息，例如它如何与其他蛋白质和化学物质相互作用以及蛋白质化学反应发生的位置。使用这种结构，研究人员可以了解特定的突变（如导致遗传疾病的突变）如何改变蛋白质的功能。研究人员还可以使用该结构设计可以与蛋白质相互作用并改变其功能的化学物质，这导致了对各种癌症和 HIV 的治疗。通常，这些结构是通过分离蛋白质、准备成像和用电子轰击它来确定的。这些技术既困难又耗时，而且经常失败。该论文估计，数十年的实验室工作只为我们留下了全套人类蛋白质的 17% 的结构信息。这解释了为什么研究人员还花了数十年时间寻找仅使用构成蛋白质的氨基酸序列来预测蛋白质结构的方法。但是在 AlphaFold 之前，软件的准确性还不够高，无法始终如一地有用。 DeepMind 并没有试图预测人类基因组中每个蛋白质的结构；有些只是太大而无法方便地处理。 （该公司将大小截断值设置为 2,700 个氨基酸，不幸的是，这比我在博士后克隆中花费的基因还要小。）但大多数蛋白质都远小于这个值，因此最终计数是预期的 98.5%基因组中的蛋白质。其中一些蛋白质仅根据人类基因组内 DNA 序列的特征预测存在。同样重要的是，AlphaFold 包括一个置信估计，用于记录其预测准确的可能性。总而言之，该软件对其预测的大约 60% 的氨基酸的位置充满信心，并且对超过三分之一的位置充满信心。换句话说，研究人员对 40% 的人类蛋白质的大部分结构有一个自信的预测。显然，这意味着在我们可以说我们对全套人类蛋白质有很好的把握之前，还有大量的工作要做。但这仍然比我们拥有实际结构的 18% 多得多。\n还有大量的蛋白质没有被现有结构很好地代表。嵌入细胞膜中的那些很难分离和使用，因此研究人员还没有解决这些膜蛋白的许多结构。但是，尽管训练数据中的示例较少，但 AlphaFold 似乎可以很好地处理这些结构。系统哪里出了问题？许多蛋白质根本没有形成明确的结构——事实上，它们的功能似乎依赖于具有完全灵活的结构才能发挥作用。显然，这里很难对结构进行任何准确的预测，因为这些蛋白质（更常见的是蛋白质的部分）没有。还有许多蛋白质只有在与另一种蛋白质或化学物质接触时才会呈现其结构。由于 AlphaFold 没有这些信息，因此它无能为力。总的来说，DeepMind 团队发现 AlphaFold 对其无序区域的预测信心很低，他们可以使用该信息来识别可能是非结构化的蛋白质区域。在不久的将来（可能在您阅读本文时），所有这些数据都将在由欧洲生物信息学研究所主办的专用网站上提供，这是一个由欧盟资助的组织，其部分描述如下：“我们通过一系列服务和工具向科学界免费提供世界上的公共生物数据。” AlphaFold 数据也不例外；一旦上述链接上线，任何人都可以使用它来下载有关他们选择的人类蛋白质的信息。或者，如上所述，鼠标、酵母或果蝇版本。将发布数据的 20 种生物也只是一个开始。 DeepMind 的 Demis Hassabis 表示，在接下来的几个月里，该团队将针对 DNA 数据库中可用的每个基因序列。到这项工作完成时，应该有超过 1 亿个蛋白质已经预测了结构。哈萨比斯在结束声明时说：“我们认为这是迄今为止人工智能对科学做出的最重要的贡献。”否则很难争论。也就是说，仍有一些问题需要解决。随着时间的推移，算法无疑会得到改进，因此需要有一个系统来处理主数据库中的更新和版本控制。 DeepMind 还将 AlphaFold 的代码开源，因此存在分叉和其他并发症的可能性。但这些问题都是对未来的担忧。现在，我们都可以坐下来看着服务器竭尽全力为地球上几乎所有好奇的生物学家提供服务，他们想知道他们感兴趣的蛋白质是否具有高质量的结构。", "note_en": "Just one week after Google&#39;s DeepMind AI group finally described its biology efforts in detail, the company is releasing a paper that explains how it analyzed nearly every protein encoded in the human genome and predicted its likely three-dimensional structure—a structure that can be critical for understanding disease and designing treatments. In the very near future, all of these structures will be released under a Creative Commons license via the European Bioinformatics Institute, which already hosts a major database of protein structures.\n In a press conference associated with the paper&#39;s release, DeepMind&#39;s Demis Hassabis made clear that the company isn&#39;t stopping there. In addition to the work described in the paper, the company will release structural predictions for the genomes of 20 major research organisms, from yeast to fruit flies to mice. In total, the database launch will include roughly 350,000 protein structures.\n   We  just described DeepMind&#39;s software last week, so we won&#39;t go into much detail here. The effort is an AI-based system trained on the structure of existing proteins that had been determined (often laboriously) through laboratory experiments. The system uses that training, plus information it obtains from families of proteins related by evolution, to predict how a protein&#39;s chain of amino acids folds up in three-dimensional space. The three-dimensional structure that results can give us critical information about the protein, such as how it interacts with other proteins and chemicals and where on the protein chemical reactions occur. Using the structure, researchers can learn how specific mutations, like the ones that cause genetic diseases, alter the protein&#39;s function. Researchers can also use the structure to design chemicals that can interact with the protein and change its function, something that has led to therapies for various cancers and HIV.\n Normally, these structures are determined by isolating the protein, preparing it for imaging, and bombarding it with electrons. These techniques are difficult and time-consuming, and they often fail. The paper estimates that decades of lab work have left us with structural information for only 17 percent of the full set of human proteins.\n    That explains why researchers have also spent decades looking for ways to predict structures for proteins using nothing but the sequence of amino acids that make them up. But prior to AlphaFold, the accuracy of software wasn&#39;t high enough to be consistently useful.\n  DeepMind didn&#39;t attempt to predict the structure of every protein in the human genome; some are simply too large to be handled conveniently. (The company set the size cutoff at 2,700 amino acids, which is unfortunately smaller than a gene I spent a chunk of my post-doc cloning.) But most proteins are far smaller than that, so the final count is 98.5 percent of the expected proteins in the genome. Some of these proteins are only predicted to exist based on features of DNA sequences within the human genome.\n Just as importantly, AlphaFold includes a confidence estimate that registers how likely its predictions are to be accurate. All told, the software is confident about the location of about 60 percent of the amino acids it has predicted, and it&#39;s highly confident about a bit over a third. Put differently, the researchers have a confident prediction about most of the structure of 40 percent of human proteins. Obviously, that means there&#39;s a considerable amount of work to do before we can say we have a good grip on the full set of human proteins. But that&#39;s still a  lot more than the 18 percent we have actual structures for.\n There is also a large collection of proteins that aren&#39;t well-represented by existing structures. Those embedded in a cell&#39;s membrane are difficult to isolate and work with, so researchers haven&#39;t solved many structures of these membrane proteins. But despite having fewer examples in its training data, AlphaFold seems to handle the structures reasonably well.\n Where does the system run into problems? Many proteins simply  don&#39;t form a defined structure—in fact, their function seems to depend on having a completely flexible structure in order to function. Obviously, it&#39;s hard to make any accurate predictions of a structure here, since these proteins (more typically, sections of proteins) have none. There are also many proteins that only take on their structure when they are in contact with another protein or a chemical. Since AlphaFold doesn&#39;t have that information, there is not a lot it can do.\n    In general, the DeepMind team found that AlphaFold had very low confidence in its predictions for disordered regions, and they could use that information to identify areas of proteins that are likely to be unstructured.\n  At some point in the near future (possibly by the time you read this), all this data will be available on  a dedicated website hosted by the European Bioinformatics Institute, a European Union-funded organization that describes itself in part as follows: &#34;We make the world’s public biological data freely available to the scientific community via a range of services and tools.&#34; The AlphaFold data will be no exception; once the above link is live, anyone can use it to download information on the human protein of their choice.\n Or, as mentioned above, the mouse, yeast, or fruit fly version. The 20 organisms that will see their data released are also just a start. DeepMind&#39;s Demis Hassabis said that over the next few months, the team will target every gene sequence available in DNA databases. By the time this work is done, over 100 million proteins should have predicted structures. Hassabis wrapped up his part of the announcement by saying, &#34;We think this is the most significant contribution AI has made to science to date.&#34; It would be difficult to argue otherwise.\n That said, there are still some issues left to be worked out. There will undoubtedly be improvements made to the algorithm with time, so there will need to be a system to handle updating and versioning in the main database. DeepMind has also made  the code for AlphaFold open source, so there&#39;s the potential for forks and other complications.\n But those problems are worries for the future. For now, we can all sit back and watch the servers strain to service nearly every biologist on the planet who is curious to see whether a protein that interests them has a high-quality structure.", "posttime": "2021-07-22 23:39:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,人类,turns,蛋白质", "title": "谷歌在整个人类基因组上放开 AlphaFold", "title_en": "Google turns AlphaFold loose on the entire human genome", "transed": 1, "url": "https://arstechnica.com/science/2021/07/google-turns-alphafold-loose-on-the-entire-human-genome/", "via": "", "real_tags": ["google", "谷歌", "人类", "turns", "蛋白质"]}, {"category": "", "categoryclass": "", "imagename": "bc9bb16fc3ea33e3048ec8f6eb3c05d4.jpg", "infoid": 1069026, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位亚马逊工程师告诉我，当他听到我试图用 Ars 标题做的事情时，他首先想到的是我们选择了一个看似困难的问题。他警告说，我需要小心正确地设定我的期望。如果这是一个真正的商业问题……嗯，他能做的最好的事情就是建议将问题从“好或坏的标题”重新定义为不太具体的问题。这句话是对我为期 4 周的非全日制机器学习速成课程的成果进行框架化的最适合家庭的方式。到目前为止，我的 PyTorch 内核与其说是火炬，不如说是垃圾箱火灾。由于专业干预，准确性略有提高，但我离部署工作解决方案还差得很远。今天，据称我一年多来第一次去度假拜访我的父母，我坐在他们客厅的沙发上从事这个项目，不小心在我带来的戴尔笔记本电脑上在本地启动了一项模型培训工作—— 2.4 GHz Intel Core i3 7100U CPU——而不是在同一个 Jupyter 笔记本的 SageMaker 副本中。戴尔锁定得太厉害了，我不得不拔出电池重新启动它。但是，嘿，如果机器不一定在学习，至少我是。我们快要结束了，但如果这是课堂作业，我的成绩单成绩可能是“不完整”。回顾一下：我收到了过去五年用于 Ars 文章的成对标题，其中包含有关 A/B 测试获胜者及其相对点击率的数据。然后我被要求使用 Amazon Web Services 的 SageMaker 创建一个机器学习算法来预测未来成对头条新闻中的获胜者。在咨询各种亚马逊资源以获得一些急需的帮助之前，我最终走上了一些 ML 的死胡同。大多数部件都已就位以完成该项目。我们（更准确地说，我的“给 AWS 的朋友打电话”生命线）在不同的建模方法上取得了一些成功，尽管准确率（仅 70% 以上）并不像人们希望的那样确定。如果我抄下他们的笔记并使用由此创建的算法，我有足够的工作来生成（使用一些额外的肘部润滑脂）部署的模型和代码来对成对的头条新闻进行预测。但我必须说实话：我在自己的本地服务器和 SageMaker 上重现该工作的努力都失败了。在摸索 SageMaker 的复杂性的过程中（包括忘记关闭笔记本、运行自动学习流程（后来我被告知是针对“企业客户”的）以及其他错误），我消耗的 AWS 预算超过我愿意花在没有资金的冒险上。虽然我在智力上理解如何部署由所有这些乱七八糟的模型产生的模型，但我仍在调试该部署的实际执行。如果不出意外，这个项目已经成为机器学习项目（及其背后的人）可能失败的所有方式的一个非常有趣的教训。而这次的失败始于数据本身——甚至始于我们选择提出的问题。\n我仍然可以通过这项努力得到一个可行的解决方案。但与此同时，我将在我的 GitHub 上分享我与之合作的数据集，以便为这次冒险提供更具交互性的组件。如果您能够获得更好的结果，请务必在下周加入我们，在本系列的现场总结中嘲笑我。 （更多细节在最后。）经过多次迭代调整我们在重定向尝试训练标题时使用的 SqueezeBert 模型后，结果集在测试中始终获得 66% 的准确率——略低于之前建议的高于 70百分之承诺。这包括努力减少在学习周期之间为调整输入而采取的步骤的大小——用于避免模型过度拟合或欠拟合的“学习率”超参数。我们大幅降低了学习率，因为当你有少量数据（就像我们这里所做的那样）并且学习率设置得太高时，它基本上会对数据集的结构和语法做出更大的假设。减少这会迫使模型将这些跳跃调整为小的婴儿步骤。我们最初的学习率设置为 2x10 -5 (2E-5)；我们将其降低到 1E-5。我们还尝试了一个更大的模型，该模型已经在大量文本上进行了预训练，称为 DeBERTa（Decoding-enhanced BERT with Disentangled Attention）。 DeBERTa 是一个非常复杂的模型：48 个变换层，具有 15 亿个参数。 DeBERTa 非常出色，它在 SuperGLUE 基准测试中在自然语言理解任务上的表现优于人类——这是第一个这样做的模型。生成的部署包也非常大：2.9 GB。有了所有这些额外的机器学习功能，我们的准确率又回到了 72%。考虑到 DeBERTa 在发现文本中的含义方面据说比人类更好，这种准确性正如一位著名的核电站运营商曾经说过的那样，“不是很好，也不是很糟糕”。最重要的是，时钟在滴答作响。我需要尝试启动并运行我自己的版本，以使用真实数据进行测试。\n本地部署的尝试并不顺利，尤其是从性能角度来看。如果没有可用的良好 GPU，运行模型和端点的 PyTorch 作业实际上使我的系统停止。因此，我重新尝试在 SageMaker 上进行部署。我尝试自己在 SageMaker 上运行较小的 SqueezeBert 建模作业，但很快变得更加复杂。训练需要 PyTorch、Python 机器学习框架以及其他模块的集合。但是，当我将 SageMaker PyTorch 内核所需的各种 Python 模块导入时，尽管进行了更新，但它们并没有完全匹配。结果，在我的本地服务器上运行的部分代码失败了，我的努力陷入了依赖纠缠的泥潭。原来是 NumPy 库的某个版本有问题，除非我强制重新安装（pip uninstall numpy，pip install numpy -no-cache-dir），版本相同，并且错误仍然存​​在。我终于修复了它，但随后遇到了另一个错误，该错误使我无法运行训练作业并指示我联系客户服务：ResourceLimitExceeded：调用 CreateTrainingJob 操作时发生错误 (ResourceLimitExceeded)：帐户级别“用于训练作业使用的 ml.p3.2xlarge”服务限制为 0 个实例，当前利用率为 0 个实例，请求增量为 1 个实例。请联系 AWS 支持以请求提高此限制。为了完全完成这项工作，我需要让 Amazon 提高我的配额——这不是我开始插电时所预料到的。这是一个简单的修复，但解决模块冲突占用了一天的大部分时间。当我尝试使用我的专家帮助提供的预构建模型将其部署为 SageMaker 端点时，时间已经用完了。这项工作现在需要额外的时间。这就是我一直在讨论模型在针对最近的标题对进行测试时的表现——如果我把模型弄到那个点的话。如果我最终能做到，我会将结果放在评论和我的 GitHub 页面上的注释中。", "note_en": "An Amazon engineer told me that when he heard what I was trying to do with Ars headlines, the first thing he thought was that we had chosen a deceptively hard problem. He warned that I needed to be careful about properly setting my expectations. If this was a real business problem... well, the best thing he could do was suggest reframing the problem from &#34;good or bad headline&#34; to something less concrete.\n That statement was the most family-friendly and concise way of framing the outcome of my four-week, part-time crash course in machine learning. As of this moment, my PyTorch kernels aren&#39;t so much torches as they are dumpster fires. The accuracy has improved slightly, thanks to professional intervention, but I am nowhere near deploying a working solution. Today, as I am allegedly on vacation visiting my parents for the first time in over a year, I sat on a couch in their living room working on this project and accidentally launched a model training job locally on the Dell laptop I brought—with a 2.4 GHz Intel Core i3 7100U CPU—instead of in the SageMaker copy of the same Jupyter notebook. The Dell locked up so hard I had to pull the battery out to reboot it.\n But hey, if the machine isn&#39;t necessarily learning, at least I am. We&#39;re almost at the end, but if this were a classroom assignment, my grade on the transcript would probably be an &#34;Incomplete.&#34;\n  To recap: I was given the pairs of headlines used for Ars articles over the past five years with data on the A/B test winners and their relative click rates. Then I was asked to use Amazon Web Services&#39; SageMaker to create a machine-learning algorithm to predict the winner in future pairs of headlines. I ended up going down some ML blind alleys before consulting various Amazon sources for some much-needed help.\n Most of the pieces are in place to finish this project. We (more accurately, my &#34;call a friend at AWS&#34; lifeline) had some success with different modeling approaches, though the accuracy rating (just north of 70 percent) was not as definitive as one would like. I&#39;ve got enough to work with to produce (with some additional elbow grease) a deployed model and code to run predictions on pairs of headlines if I crib their notes and use the algorithms created as a result.\n    But I&#39;ve got to be honest: my efforts to reproduce that work both on my own local server and on SageMaker have fallen flat. In the process of fumbling my way through the intricacies of SageMaker (including forgetting to shut down notebooks, running  automated learning processes that I was later advised were for &#34;enterprise customers,&#34; and other miscues), I&#39;ve burned through more AWS budget than I would be comfortable spending on an unfunded adventure. And while I understand intellectually how to deploy the models that have resulted from all this futzing around, I am still debugging the actual execution of that deployment.\n If nothing else, this project has become a very interesting lesson in all the ways machine-learning projects (and the people behind them) can fail. And failure this time began with the data itself—or even with the question we chose to ask with it.\n I may still get a working solution out of this effort. But in the meantime, I&#39;m going to share the data set on my GitHub that I worked with to provide a more interactive component to this adventure. If you&#39;re able to get better results, be sure to join us next week to taunt me in the live wrap-up to this series. (More details on that at the end.)\n  After several iterations of tuning the  SqueezeBert model we used in  our redirected attempt to train for headlines, the resulting set was consistently getting 66 percent accuracy in testing—somewhat less than the previously suggested above-70 percent promise.\n This included efforts to reduce the size of the steps taken between learning cycles to adjust inputs—the &#34;learning rate&#34; hyperparameter that is used to avoid overfitting or underfitting of the model. We reduced the learning rate substantially, because when you have a small amount of data (as we do here) and the learning rate is set too high, it will basically make larger assumptions in terms of the structure and syntax of the data set. Reducing that forces the model to adjust those leaps to little baby steps. Our original learning rate was set to 2x10 -5 (2E-5); we ratcheted that down to 1E-5.\n We also tried a much larger model that had been pre-trained on a vast amount of text, called  DeBERTa (Decoding-enhanced BERT with Disentangled Attention). DeBERTa is a very sophisticated model: 48 Transform layers with 1.5 billion parameters.\n    DeBERTa is so fancy, it has  outperformed humans on natural-language understanding tasks in the  SuperGLUE benchmark—the first model to do so.\n The resulting deployment package is also pretty hefty: 2.9 gigabytes. With all that additional machine-learning heft, we got back up to 72 percent accuracy. Considering that DeBERTa is supposedly better than a human when it comes to spotting meaning within text, this accuracy is, as a famous nuclear power plant operator once said, &#34;not great, not terrible.&#34;\n  On top of that, the clock was ticking. I needed to try to get a version of my own up and running to test out with real data.\n An attempt at a local deployment did not go well, particularly from a performance perspective. Without a good GPU available, the PyTorch jobs running the model and the endpoint literally brought my system to a halt.\n So, I returned to trying to deploy on SageMaker. I attempted to run the smaller SqueezeBert modeling job on SageMaker on my own, but it quickly got more complicated. Training requires  PyTorch, the Python machine-learning framework, as well as a collection of other modules. But when I imported the various Python modules required to my SageMaker PyTorch kernel, they didn&#39;t match up cleanly despite updates.\n As a result, parts of the code that worked on my local server failed, and my efforts became mired in a morass of dependency entanglement. It turned out to be  a problem with a version of the NumPy library, except when I forced a reinstall ( pip uninstall numpy,  pip install numpy -no-cache-dir), the version was the same, and the error persisted. I finally got it fixed, but then I was met with another error that hard-stopped me from running the training job and instructed me to contact customer service:\n ResourceLimitExceeded: An error occurred (ResourceLimitExceeded) when calling the CreateTrainingJob operation: The account-level service limit &#39;ml.p3.2xlarge for training job usage&#39; is 0 Instances, with current utilization of 0 Instances and a request delta of 1 Instances. Please contact AWS support to request an increase for this limit.\n In order to fully complete this effort, I needed to get Amazon to up my quota—not something I had anticipated when I started plugging away. It&#39;s an easy fix, but troubleshooting the module conflicts ate up most of a day. And the clock ran out on me as I was attempting to side-step using the pre-built model my expert help provided, deploying it as a SageMaker endpoint.\n This effort is now in extra time. This is where I would have been discussing how the model did in testing against recent headline pairs—if I ever got the model to that point. If I can ultimately make it, I&#39;ll put the outcome in the comments and in a note on my GitHub page.", "posttime": "2021-07-22 23:38:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ai,模型", "title": "Ars AI 头条实验大结局——我们来了，我们看到了，我们用了很多计算时间", "title_en": "Ars AI headline experiment finale—we came, we saw, we used a lot of compute time", "transed": 1, "url": "https://arstechnica.com/information-technology/2021/07/ars-ai-headline-experiment-conclusion-we-came-we-saw-we-used-a-lot-of-compute-time/", "via": "", "real_tags": ["ai", "模型"]}]