[{"category": "", "categoryclass": "", "imagename": "28416257aef23de119288fa6afb37e08.jpg", "infoid": 1013338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该基金的网站用短短几句话就展示了这一投资主题。他说：“我们深信，法国充斥着才华横溢、雄心勃勃的企业家，是世界上一些最优秀的工程师和产品设计师的故乡。我们已经意识到，在大多数情况下，他们没有机会向境外扩张，因为他们无法获得正确的资金、人才库、剧本或网络，“该网站写道，”我们已经意识到，他们没有机会向国外扩张，因为他们无法获得正确的资金、人才库、剧本或网络。“。\n伊兰·阿贝赫塞拉(Ilan Abehassera)做企业家已经有一段时间了。他首先创立了Producteed，这是一款任务管理产品，已于2012年被软件巨头Jive收购。\n后来，他推出了Ily，一款适合家庭使用的通讯设备。这款设备看起来与亚马逊回声秀(Amazon Echo Show)非常相似，但这款设备是在亚马逊接管这个市场的几年前发布的。他现在正在研究Willo，一种可以取代你牙刷的机器人。\n卡洛斯·迪亚兹(Carlos Diaz)是卡洛斯·迪亚兹(Carlos Diaz)的联合创始人，这家欧洲数字机构被Atos收购。最近，他一直在致力于The Refiners，这是一家总部位于旧金山的种子基金，帮助国际创始人在硅谷起步。今年3月，迪亚兹正在为炼油商筹集第二笔资金，但未能完成交易。\n“炼油商最初的想法是寻找雄心勃勃的欧洲初创企业，愿意搬到美国，帮助他们成为各自类别的全球领导者。全球大流行、经济不确定性与旅行限制相结合，以及特朗普政府荒谬的移民政策，使得炼油商的投资论断在推出四年后突然无法执行，“迪亚兹在一篇博客文章中写道。\n通过Diaspora Ventures，Diaz和Abehassera希望将自己与已经在美国投资的法国风险投资基金区分开来。迪亚兹表示，与一家法国基金在美国合作需要大量的往返工作才能完成交易。Daspora Ventures希望能够更快地完成交易。\nDaspora Ventures将专注于早期融资，平均支票在10万美元到20万美元之间。该公司希望每年参与10至20笔交易。\n有趣的是，Diaspora Ventures正在利用AngelList的滚动风险基金。这意味着这两位合伙人已经从各种有限合伙人那里筹集了300万美元，如Kima Ventures、Breega、Alexis Bonillo、Christophe Courtin、SalSolomon Aiach、Frédéric Laluyaux等。但基金总是在募集，因此名单会变得更长，募集的资金总额也会随着时间的推移而增长。\n这就是为什么Daspora Ventures在提出新基金的想法几个月后就成功完成了第一笔投资交易。\n在过去的几年里，他们两人也都是活跃的天使投资者。他们投资了一些著名的公司，如Algolia，SunISE，Tempow，Yolo，Double，牛仔等。", "note_en": "The fund’s website lays out this investment thesis in just a few sentences. “We are convinced that France is full of talented and ambitious entrepreneurs and is home of some of the best engineers and product designers in the world. We have realized that most of the time, they do not have the opportunity to expand beyond their borders because they don’t have access to the right funding, talent pool, playbooks or network,” the website reads.\n Ilan Abehassera has been an entrepreneur for a while. He first founded Producteed, a task-management product that has been  acquired by software giant Jive in 2012.\n  He later launched  Ily, a family-friendly communication device. The device looks an awful lot like an Amazon Echo Show, but the device was announced a couple of years before Amazon took over this market. He’w now working on  Willo, a robot that could replace your toothbrush\n Carlos Diaz co-founded Carlos Diaz, a European digital agency that was acquired by Atos. More recently, he’s been working on  The Refiners, a San Francisco-based seed fund that helps international founders get started in Silicon Valley. In March, Diaz was in the process of raising a second fund for The Refiners but couldn’t close the deal.\n “The original idea of The Refiners was to identify ambitious European startups willing to move to the U.S. and help them become global leaders in their category. The global pandemic, the economic uncertainty combined with travel restrictions, and the absurd immigration policies of the Trump administration suddenly made the investment thesis of The Refiners impossible to execute four years after its launch,” Diaz  wrote in a blog post.\n With Diaspora Ventures, Diaz and Abehassera want to differentiate themselves from French VC funds that already invest in the U.S. According to Diaz, working with a French fund in the U.S. requires a lot of back and forth to close a deal. Diaspora Ventures wants to be able to close deals more quickly.\n Diaspora Ventures will focus on early stage rounds with an average check between $100,000 and $200,000. The firm wants to participate in 10 to 20 deals per year.\n Interestingly, Diaspora Ventures is taking advantage of AngelList’s  Rolling Venture Funds. It means that the two partners have raised $3 million from various limited partners, such as  Kima Ventures,  Breega, Alexis Bonillo, Christophe Courtin, Salomon Aiach, Frédéric Laluyaux and others. But the fund is always raising, so the list will become longer and the total amount of capital raised will grow over time.\n That’s how Diaspora Ventures managed to close their first investment deal just a couple of months after coming up with the idea for the new fund.\n Both of them have also been active angel investors over the past few years. They have invested in some well-known names, such as Algolia, Sunrise, Tempow, Yolo, Double, Cowboy, etc.", "posttime": "2020-07-22 02:25:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "思维,ventures", "title": "\nDaspora Ventures希望投资于具有全球思维的法国创始人", "title_en": "\n\t\t\t\tDiaspora Ventures wants to invest in French founders with a global mindset\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/diaspora-ventures-wants-to-invest-in-french-founders-with-a-global-mindset/", "via": "", "real_tags": ["思维", "ventures"]}, {"category": "", "categoryclass": "", "imagename": "b053cbea55cbb796e4f778d8c485ebe5.jpeg", "infoid": 1013337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在孔雀的案例中，传感器塔表示，这款移动应用程序在上市的头6天里，在美国应用商店和Google Play上的下载量已经达到了150万次。\n相比之下，这比Quibi在美国推出后同期120万次的安装量高出25%，但与迪士尼+在前六天产生的1300万次下载量相比，只有12%。\n传感器塔选择不将孔雀与HBO Max进行比较，因为HBO的新服务取代了现有的HBO Now应用程序，后者已经预装在消费设备上。这不是一个恰当的比较。\n当然，孔雀没有迪士尼那样的品牌知名度。而且可以说，尽管它与经典的孔雀标志有联系，但它的名字并没有翻译成消费者心中的“NBC”。与此同时，迪士尼在其流媒体服务推出之前就有了内置的粉丝基础。而且，更广泛地说，消费者对更适合家庭的产品也存在被压抑的需求。\n在上周发布之前，孔雀已经可以在母公司康卡斯特的Xfinity X1和Flex平台上使用，但这还不包括它的移动伙伴。取而代之的是，这款移动应用于7月15日正式发布，并迅速跃升至iPhone应用商店的第一名，并一直保持到第二天。在iPad上，它在7月16日至7月18日期间排名第一。\n如今，这款应用在iPhone上的排名已经跌至第26位(在非游戏应用中)。与此同时，在Google Play上，它自7月17日以来一直排名第二，在非游戏应用中排名第一。\nQuibi在发布后不久就在应用商店的排行榜上表现出了早期的吸引力，在4月6日的发布日，它在iPhone上的排名高达第4位。但App Annie的数据显示，仅仅一周后，它就迅速跌出了美国iPhone应用的排行榜，跌出了前50名。这使得它落后于Netflix，Hulu，Disney+和Amazon Prime Video。\n也有很多讨论认为，quibi未能获得重大的早期吸引力与其缺乏对电视观看的支持有关，尽管它是在大流行期间推出的，当时用户呆在家里，在客厅的大屏幕上观看。\n然而，值得指出的是，孔雀还没有推广到美国应用最广泛的两个客厅平台：亚马逊Fire TV和Roku。这更支持了这样一种观点，即Quibi一直在努力增长，并不是因为它只限移动设备的性质，而是因为它的内容没有吸引观众。\n无论如何，Quibi驳斥了最近关于其牵引力缓慢的报道，本月早些时候指出，自发布以来，其应用程序的下载量已经增加了560万次-超过了当时声称的450万次传感器塔(Sensor Tower)。\n即使传感器塔的估计不是精确的科学，但它的数据描绘的总体趋势是，孔雀和魁比在发射时都没有一夜成名。当然，在如今拥挤的市场中，Netflix的任何竞争对手的增长轨迹肯定会很艰难。但由于缺乏可识别的品牌名称，以及未能在发布时为顶级客厅设备提供专用应用程序，这些公司让消费者更难连接。", "note_en": "In  Peacock’s   case, Sensor Tower says the mobile app has now been downloaded around 1.5 million times across the U.S. App Store and Google Play within its first 6 days on the market.\n For comparison, that’s 25% more than the 1.2 million installs  Quibi   saw during the same period post-launch in the U.S., but only 12% of the 13 million downloads Disney+ generated within its first six days.\n  Sensor Tower chose not to compare Peacock with HBO Max due to the fact that HBO’s new service replaced the existing HBO Now app, which was already preinstalled on consumer devices. That would not be as apt a comparison.\n Peacock, of course, doesn’t have the brand-name recognition of Disney. And arguably, its name doesn’t translate into consumers’ minds as “NBC,” despite its connection to the classic peacock logo. Disney, meanwhile, had a built-in fan base before its streaming service’s launch. And, more broadly, there was pent-up consumer demand for a more family-friendly offering, as well.\n Before last week’s launch, Peacock had been  available on parent company Comcast’s Xfinity X1 and Flex platforms, but that didn’t include its mobile companion. The mobile app instead  officially launched on July 15, and quickly shot up to No. 1 on the iPhone App Store, where it remained through the following day. On iPad, it ranked No. 1 between July 16 and July 18.\n Today, the app has since dropped to No. 26 on iPhone (among nongame apps). Meanwhile, on Google Play, it has ranked No. 2 since July 17, and is No. 1 among nongame apps.\n Quibi had also seen early traction on the app stores’ top charts shortly after its launch, ranking as high as No. 4 on iPhone on its launch day, April 6. But just over a week later it had  rapidly fallen out of the U.S. iPhone app rankings, App Annie’s data indicated, dropping out of the top 50. That saw it coming in behind Netflix, Hulu, Disney+ and Amazon Prime Video.\n  There was also much discussion that Quibi’s failure to gain significant early traction had to do with its lack of support for TV viewing, despite launching in the middle of a pandemic when users were staying at home and watching on their living room big screens.\n However, it’s worth pointing out that  Peacock hasn’t yet rolled out to the two most widely adopted living room platforms in the U.S.: Amazon Fire TV and Roku. That lends more support to the idea that Quibi hasn’t been struggling to grow because of its mobile-only nature, but because its content wasn’t drawing in viewers.\n For what it’s worth, Quibi  has disputed recent reports of its slow traction,  noting earlier this month its app had gained 5.6 million downloads since launch — more than the 4.5 million Sensor Tower had claimed at the time.\n Even if Sensor Tower’s estimates aren’t an exact science, the overall trend its figures paint is one where neither Peacock nor Quibi have become overnight sensations at launch. Of course, the growth trajectory for any Netflix rival is sure to be tough in today’s crowded market. But these companies have made it even more difficult for consumers to connect due to their lack of a recognizable brand name and their failure to offer dedicated apps for top living room devices at launch.", "posttime": "2020-07-22 02:25:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "下载,程序,孔雀,downloads,quibi", "title": "\nNBCU的孔雀流媒体服务前6天应用程序下载量达到150万次", "title_en": "\n\t\t\t\tNBCU’s Peacock streaming service hits 1.5M app downloads in first 6 days\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/nbcus-peacock-streaming-service-hits-1-5m-app-downloads-in-first-6-days/", "via": "", "real_tags": ["下载", "程序", "孔雀", "downloads", "quibi"]}, {"category": "", "categoryclass": "", "imagename": "b26ef9967cdb37a2eba5b54f0ece0703.jpg", "infoid": 1013336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黛比·波普(她/她)是特雷弗项目(Trevor Project)的高级产品经理，该项目是世界上最大的针对LGBTQ青少年的自杀预防和危机干预组织。作为2019年谷歌AI Impact Grantee的一个项目，该项目正在建立一个人工智能系统，以识别和优先处理高风险联系人，同时支持更多的年轻人。\n应用人工智能的一个先驱是数据-大量的数据！训练AI模型通常需要大数据集，任何拥有大数据集的组织无疑都将面临AI可以帮助解决的挑战。或者，如果数据集还不存在，数据收集可能是人工智能产品开发的“第一阶段”。\n无论您计划使用什么数据集，都很可能有人参与了数据的捕获，或者将以某种方式使用您的人工智能功能。UX设计和数据可视化的原则应该在数据捕获和/或向用户呈现数据时及早考虑。\n在模型开发开始时了解用户将如何使用您的AI产品，有助于为您的AI项目设置有用的护栏，并确保团队专注于共同的最终目标。\n例如，如果我们以电影流媒体服务的“推荐给您”部分为例，在开始数据分析之前概述用户将在此功能中看到的内容，将允许团队只关注将增加价值的模型输出。因此，如果您的用户研究确定电影标题、图像、演员和长度将是用户在推荐中看到的有价值的信息，则工程团队在决定哪些数据集应该训练模型时将具有重要的上下文。演员和电影长度数据似乎是确保推荐准确无误的关键。\n之前-用户试图实现的目标是什么？用户是如何获得这种体验的呢？他们要去哪里？他们应该期待什么呢？\n在-他们应该看到什么来定位自己？下一步做什么清楚了吗？如何引导他们克服错误？\n之后-用户是否实现了他们的目标？这段经历有没有明确的“结局”？后续步骤(如果有)是什么？\n了解用户在与模型交互之前、期间和之后应该看到的内容，将确保工程团队从一开始就对AI模型进行准确的数据培训，并提供对用户最有用的输出。\n您的用户会知道您从他们那里收集的数据发生了什么变化吗？您为什么需要这些数据？您的用户是否需要阅读您的T&amp；C页面才能获得提示？考虑将基本原理添加到产品本身中。一句简单的“这些数据将允许我们推荐更好的内容”就可以消除用户体验中的摩擦点，并为体验增加一层透明度。\n当用户向Trevor项目的顾问寻求支持时，我们明确表示，我们在与顾问联系之前要求的信息将用于为他们提供更好的支持。\n如果您的模型将输出呈现给用户，请更进一步并解释您的模型是如何得出结论的。谷歌的“为什么要做这个广告？”选项可以让您深入了解是什么驱动了您看到的搜索结果。它还允许您完全禁用广告个性化，允许用户控制其个人信息的使用方式。解释您的模型如何工作或其准确性水平可以增加对您的用户群的信任，并使用户能够根据自己的条件决定是否参与到结果中来。低精度水平还可以作为提示，从用户那里收集更多见解，以改进您的模型。\n提示用户反馈他们的体验可以让产品团队随着时间的推移不断改进用户体验。在考虑反馈收集时，也要考虑人工智能工程团队如何从持续的用户反馈中获益。有时，人类可以发现人工智能不会发现的明显错误，而您的用户群完全由人类组成！\n一个实际收集用户反馈的例子是，当Google识别出一封电子邮件是危险的，但允许用户使用自己的逻辑将该电子邮件标记为“安全”时。这种持续的手动用户校正使模型能够不断了解随着时间的推移，危险的消息传递是什么样子。\n如果您的用户群也有上下文知识来解释为什么人工智能是不正确的，那么这个上下文对于改进模型可能是至关重要的。如果用户注意到AI返回的结果中存在异常，请考虑如何包含一种让用户轻松报告异常的方法。您可以问用户什么问题来为工程团队获取关键见解，并提供有用的信号来改进模型？工程团队和UX设计人员可以在模型开发期间一起工作，以便在早期计划反馈收集，并为持续的迭代改进设置模型。\n可访问性问题会导致不对称的数据收集，而在排他性数据集上训练的人工智能可能会造成人工智能偏见。例如，在主要由白人男性面孔组成的数据集上训练的面部识别算法，对于任何不是白人或男性的人来说都会表现不佳。对于像特雷弗项目这样直接支持LGBTQ青少年的组织来说，包括性取向和性别认同的考虑是极其重要的。在外部寻找包容性数据集与确保您带到表中或打算收集的数据具有包容性一样重要。\n在收集用户数据时，请考虑您的用户将利用哪个平台与您的AI交互，以及如何使其更易于访问。如果你的平台需要付费，不符合可访问性准则，或者用户体验特别繁琐，你从那些负担不起订阅费用、有可访问性需求或不太精通技术的人那里收到的信号会更少。\n每个产品领导者和人工智能工程师都有能力确保社会上被边缘化和代表性不足的群体可以访问他们正在开发的产品。了解你在不知不觉中将谁排除在你的数据集中是构建更具包容性的AI产品的第一步。\n公平与确保培训数据的包容性齐头并进。测量模型中的公平性要求您了解模型在某些用例中可能不太公平。对于使用人员数据的模型，查看模型在不同人群中的表现可能是一个很好的开端。但是，如果您的数据集不包括人口统计信息，这种类型的公平性分析可能是不可能的。\n在设计您的模型时，请考虑数据会如何影响输出，或者它会如何对某些人造成服务不足。确保你用来训练的数据集，以及你从用户那里收集的数据足够丰富，足以衡量公平性。考虑如何监控公平性，将其作为定期模型维护的一部分。设置公平阈值，并创建一个计划，说明如果模型随着时间的推移变得不公平，您将如何调整或重新训练模型。\n作为一名开发人工智能工具的新手或经验丰富的技术工作者，考虑您的工具如何被您的用户感知并对其产生影响永远不会太早或太晚。人工智能技术具有规模化接触数百万用户的潜力，可以应用于高风险的用例中。从整体上考虑用户体验-包括人工智能输出将如何影响人们-不仅是最佳实践，而且可能是道德上的必要。", "note_en": "Debbie Pope (she/her) is senior manager of product at  The Trevor Project, the world’s largest suicide prevention and crisis intervention organization for LGBTQ youth. A 2019 Google AI Impact Grantee, the project is building an AI system to identify and prioritize high-risk contacts while simultaneously supporting more youth.\n  A precursor to applying AI is data — lots and lots of it! Large data sets are generally required to train an AI model, and any organization that has large data sets will no doubt face challenges that AI can help solve. Alternatively, data collection may be “phase one” of AI product development if data sets don’t yet exist.\n Whatever data sets you’re planning to use, it’s highly likely that people were involved in either the capture of that data or will be engaging with your AI feature in some way. Principles for  UX   design and data visualization should be an early consideration at data capture, and/or in the presentation of data to users.\n   Understanding how users will engage with your AI product at the start of model development can help to put useful guardrails on your AI project and ensure the team is focused on a shared end goal.\n If we take the ‘”Recommended for You” section of a movie streaming service, for example, outlining what the user will see in this feature before kicking off data analysis will allow the team to focus only on model outputs that will add value. So if your user research determined the movie title, image, actors and length will be valuable information for the user to see in the recommendation, the engineering team would have important context when deciding which data sets should train the model. Actor and movie length data seem key to ensuring recommendations are accurate.\n  Before — What is the user trying to achieve? How does the user arrive at this experience? Where do they go? What should they expect?\n During — What should they see to orient themselves? Is it clear what to do next? How are they guided through errors?\n After — Did the user achieve their goal? Is there a clear “end” to the experience? What are the follow-up steps (if any)?\n Knowing what a user should see before, during and after interacting with your model will ensure the engineering team is training the AI model on accurate data from the start, as well as providing an output that is most useful to users.\n  Will your users know what is happening to the data you’re collecting from them, and why you need it? Would your users need to read pages of your T&amp;Cs to get a hint? Think about adding the rationale into the product itself. A simple “this data will allow us to recommend better content” could remove friction points from the user experience, and add a layer of transparency to the experience.\n When users reach out for support from a counselor at The Trevor Project, we make it clear that the information we ask for before connecting them with a counselor will be used to give them better support.\n  If your model presents outputs to users, go a step further and explain how your model came to its conclusion. Google’s “Why this ad?” option gives you insight into what drives the search results you see. It also lets you disable ad personalization completely, allowing the user to control how their personal information is used. Explaining how your model works or its level of accuracy can increase trust in your user base, and empower users to decide on their own terms whether to engage with the result. Low accuracy levels could also be used as a prompt to collect additional insights from users to improve your model.\n  Prompting users to give feedback on their experience allows the Product team to make ongoing improvements to the user experience over time. When thinking about feedback collection, consider how the AI engineering team could benefit from ongoing user feedback, too. Sometimes humans can spot obvious errors that AI wouldn’t, and your user base is made up exclusively of humans!\n One example of user feedback collection in action is when Google identifies an email as dangerous, but allows the user to use their own logic to flag the email as “Safe.” This ongoing, manual user correction allows the model to continuously learn what dangerous messaging looks like over time.\n  If your user base also has the contextual knowledge to explain why the AI is incorrect, this context could be crucial to improving the model. If a user notices an anomaly in the results returned by the AI, think of how you could include a way for the user to easily report the anomaly. What question(s) could you ask a user to garner key insights for the engineering team, and to provide useful signals to improve the model? Engineering teams and UX designers can work together during model development to plan for feedback collection early on and set the model up for ongoing iterative improvement.\n  Accessibility issues result in skewed data collection, and AI that is trained on exclusionary data sets can create  AI bias. For instance, facial recognition algorithms that were trained on a data set consisting mostly of  white male faces will perform poorly for anyone who is not white or male. For organizations like  The Trevor Project that directly support LGBTQ youth, including considerations for  sexual orientation and  gender identity are extremely important. Looking for inclusive data sets externally is just as important as ensuring the data you bring to the table, or intend to collect, is inclusive.\n When collecting user data, consider the platform your users will leverage to interact with your AI, and how you could make it more accessible. If your platform requires payment, does not meet accessibility guidelines or has a particularly cumbersome user experience, you will receive fewer signals from those who cannot afford the subscription, have accessibility needs or are less tech-savvy.\n Every product leader and AI engineer has the ability to ensure marginalized and underrepresented groups in society can access the products they’re building. Understanding who you are unconsciously excluding from your data set is the first step in building more inclusive AI products.\n  Fairness goes hand-in-hand with ensuring your training data is inclusive. Measuring fairness in a model requires you to understand how your model may be less fair in certain use cases. For models using people data, looking at how the model performs across different demographics can be a good start. However, if your data set does not include demographic information, this type of fairness analysis could be impossible.\n When designing your model, think about how the output could be skewed by your data, or how it could underserve certain people. Ensure the data sets you use to train, and the data you’re collecting from users, are rich enough to measure fairness. Consider how you will monitor fairness as part of regular model maintenance. Set a fairness threshold, and create a plan for how you would adjust or retrain the model if it becomes less fair over time.\n As a new or seasoned technology worker developing AI-powered tools, it’s never too early or too late to consider how your tools are perceived by and impact your users. AI technology has the potential to reach millions of users at scale and can be applied in high-stakes use cases. Considering the user experience holistically — including how the AI output will impact people — is not only best-practice but can be an ethical necessity.", "posttime": "2020-07-22 02:24:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,镜头,bring", "title": "\n将UX镜头带到你的人工智能项目中的五种方法", "title_en": "\n\t\t\t\tFive ways to bring a UX lens to your AI project\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/five-ways-to-bring-a-ux-lens-to-your-ai-project/", "via": "", "real_tags": ["人工智能", "镜头", "bring"]}, {"category": "", "categoryclass": "", "imagename": "95dd7eeeeb69cc46eab17ed5d142f223.jpg", "infoid": 1013335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "韩国首尔-韩国因有效利用数字工具遏制冠状病毒而受到称赞，从紧急电话警报到基于各种数据的积极接触者追踪，不一而足。\n但一名软件工程师发现，这一战略的一个支柱-一款帮助执行隔离的移动应用程序-存在严重的安全缺陷，使私人信息容易受到黑客的攻击。\n《纽约时报》证实了这些缺陷，现在这些缺陷已经修复，攻击者可能会检索到被隔离人员的姓名、实时位置和其他详细信息。这些漏洞还可能允许黑客篡改数据，让这款应用的用户看起来要么违反了隔离命令，要么尽管在其他地方，但仍处于隔离状态。\n在采访中，韩国官员承认，他们是在工程师弗雷德里克·雷赫滕斯坦(Frédéric Rechstein)和时报通知他们之后才意识到安全漏洞的。\n“我们真的急于尽快开发和部署这款应用，以帮助减缓病毒的传播，”负责监管这款应用的内政部灾害应急部门官员郑赞铉(Jung Chan-hyun，音译)说。“我们承担不起对这款应用进行耗时的安全检查，因为这会推迟它的部署。”\n铁道部修复了上周在谷歌和苹果商店发布的最新版本的应用程序中的缺陷。韩国官员表示，在修补漏洞之前，他们没有收到任何个人信息被不当检索或滥用的报告。\n世界各地的政府都在争先恐后地部署病毒跟踪应用程序，结果却面临着对糟糕的安全做法的抱怨。由于该软件收集了如此多关于用户、他们的健康状况和他们所在位置的细节，这些应用程序是黑客的首要目标。但迅速采取行动的压力似乎允许安全功能不足的软件在几个国家匆忙推出。\n泰晤士报今年春天发现，印度的一款病毒跟踪应用程序可能会泄露用户的准确位置，促使印度政府解决这个问题。大赦国际在卡塔尔的一个暴露警报应用程序中发现了缺陷，那里的当局很快就更新了该应用程序。包括挪威和英国在内的其他国家在公众对隐私提出强烈抗议后，不得不改变其病毒应用程序的路线。\n今年4月，韩国开始要求所有从国外抵达的游客和居民将自己隔离两周。为了监控合规情况，他们不得不安装一款应用程序，其名称在韩语中的意思是自我检疫安全保护。\n截至上个月，已有超过16.2万人下载了这款应用，该应用可以跟踪用户的位置，以确保他们留在隔离区。违规者可能会被要求佩戴跟踪腕带，或者支付高额罚款。\n今年5月，雷赫滕斯坦从国外旅行回到位于首尔的家中。在家里自我孤立的同时，他对政府这款看似简单的应用程序以及它可能有哪些额外功能产生了好奇。这促使雷希滕斯坦偷看了代码的背后，这就是他如何发现了几个主要的安全漏洞。\n他发现，该软件的开发人员给用户分配的ID号很容易猜到。在猜测了一个人的证书后，黑客可以检索到注册时提供的信息，包括姓名、出生日期、性别、国籍、地址、电话号码、实时位置和医疗症状。\n雷赫滕斯坦还发现，开发人员使用了一种不安全的方法来扰乱或加密应用程序与存储数据的服务器之间的通信。与Gmail和Twitter等应用程序使用的安全标准HTTPS不同，这款应用程序使用的是直接写入代码的加密密钥。\n这样做意味着黑客可以很容易地找到密钥并解码数据，如果他们尝试过的话。这也意味着密钥不会根据正在发送的消息或用户发送的消息而更改。\n有了如此弱的加密，监控该应用程序与服务器的所有通信将成为可能，例如，通过与其他使用该应用程序的人处于同一个不受保护的Wi-Fi网络上。\n“纽约时报”检查了这款应用的代码，并证实了雷赫滕斯坦的发现。在“纽约时报”上个月就安全漏洞与韩国当局接触后，官员们表示，他们已经把快速部署该应用程序放在了优先位置，“以拯救生命”。\n内政部官员郑志刚说，他的团队与Winitech合作开发了这款应用，Winitech是一家位于韩国大邱的软件维护和修复公司，该市在2月份成为疫情爆发的中心。\nWinitech高级董事总经理洪胜福(Hong Seong-bok)表示，该公司最初开发这款应用程序时，预计只有一小部分韩国人会使用这款软件。\n洪磊说，“我们从来没有想到它会被这么多人使用，成为所有抵达机场的旅客的必备应用。”\n钟彬娴说，虽然该团队夜以继日地开发这款应用程序，并培训官员如何使用它，但他们缺乏确保软件安全的专业知识。\n随着时间的推移，政府还要求荣格的团队在应用程序中增加监控功能，官员们说，这增加了他们的工作量，使他们无法花费时间寻找安全漏洞。\n例如，增加了一项功能，当被隔离的人的手机没有物理移动超过两个小时时，它会发出噪音或振动。如果用户没有拿起设备回应，这是一个潜在的迹象，表明这个人冒险出去了，把手机留在了那里。然后，这款应用程序会向当局发出警报。\n为了更密切地关注检疫违规者，还增加了另一项功能，将跟踪腕带连接到应用程序。\n韩国官员古昌奎(Koo Chang-kyu，音译)说，“我们简直被工作压得喘不过气来。”\n在上个月与雷希滕斯坦和时报记者的会面中，韩国官员最初淡化了安全问题，称一旦一名用户完成了为期两周的隔离，他们就删除了个人数据，并关闭了这款应用。\n但雷赫滕斯坦在会上展示了，尽管他的隔离在一周多前就结束了，但通过使用手机上的应用程序，他的数据仍然可以从政府服务器上检索出来。韩国官员后来表示，他们已经解决了这个问题。\n韩国因创造性和透明地处理冠状病毒大流行而成为全球的典范。但雷赫滕斯坦说，这款应用程序的安全缺陷表明，该国在保护个人数据方面有多么落后。他还对当局花了多长时间来解决问题表示失望。\n雷赫滕斯坦说，这一事件可能会“影响人们对韩国抗击流感模式的看法”。", "note_en": "SEOUL, South Korea — South Korea has been praised for making effective use of digital tools to  contain the coronavirus, from emergency phone alerts to aggressive contact tracing based on a variety of data.\n But one pillar of that strategy, a mobile app that helps enforce quarantines, had serious security flaws that made private information vulnerable to hackers, a software engineer has found.\n The defects, which were confirmed by The New York Times and have now been fixed, could have let attackers retrieve the names, real-time locations and other details of people in quarantine. The flaws could also have allowed hackers to tamper with data to make it look as if users of the app were either violating quarantine orders or still in quarantine despite being somewhere else.\n In interviews, South Korean officials acknowledged that they had become aware of the security lapses only after the engineer, Frédéric Rechtenstein, and The Times notified them.\n “We were really in a hurry to make and deploy this app as quickly as possible to help slow down the spread of the virus,” said Jung Chan-hyun, an official at the Ministry of the Interior and Safety’s disaster response division, which oversees the app. “We could not afford a time-consuming security check on the app that would delay its deployment.”\n The ministry fixed the flaws in the latest version of the app, which was released in  Google and  Apple stores last week. South Korean officials said they had not received any reports that personal information was improperly retrieved or misused before the vulnerabilities were patched.\n Governments worldwide have raced to deploy virus-tracing apps only to face complaints about  poor security practices. With the software gathering so many details about users, their health and their locations, the apps are prime targets for hackers. But pressure to act quickly appears to have allowed software with inadequate security features to be rushed out in several nations.\n  The Times found this spring that a  virus-tracing app in India could leak users’ precise locations, prompting the Indian government to fix the problem. Amnesty International discovered flaws in an  exposure-alert app in Qatar, which the authorities there quickly updated. Other nations, including Norway and Britain, have had to change course on their virus apps after public outcry about privacy.\n In April, South Korea began requiring all visitors and residents arriving from abroad to isolate themselves for two weeks. To monitor compliance, they had to install an app whose name in Korean means Self-Quarantine Safety Protection.\n As of last month, more than 162,000 people had downloaded the app, which tracks users’ locations to ensure they remain in quarantine areas. Violators might be required to wear tracking wristbands or pay steep fines.\n  In May, Mr. Rechtenstein returned to his home in Seoul from a trip abroad. While self-isolating at home, he became curious about the government’s seemingly simple app and what extra features it might have. That prompted Mr. Rechtenstein to peek under the hood of the code, which is how he discovered several major security flaws.\n He found that the software’s developers were assigning users ID numbers that were easily guessable. After guessing a person’s credentials, a hacker could have retrieved the information provided upon registration, including name, date of birth, sex, nationality, address, phone number, real-time location and medical symptoms.\n Mr. Rechtenstein also found that the developers were using an insecure method to scramble, or encrypt, the app’s communications with the server where data was stored. Instead of HTTPS, the security standard used by apps like Gmail and Twitter, the app used an encryption key written directly into its code.\n Doing so meant hackers could easily find the key and decode the data if they had tried. It also meant the key did not change depending on the message being sent or on the user sending it.\n  With such weak encryption, monitoring all of the app’s communications with the server would be possible simply, for instance, by being on the same unprotected Wi-Fi network as someone else using the app.\n The Times examined the app’s code and confirmed Mr. Rechtenstein’s findings. After The Times approached the South Korean authorities about the security flaws last month, officials said they had put a priority on deploying the app quickly “to save lives.”\n Mr. Jung, the Interior Ministry official, said his team had developed the app with Winitech, a software maintenance and repair company in Daegu, a South Korean city that became  a center of the outbreak in February.\n Winitech’s senior managing director, Hong Seong-bok, said that when the company first developed the app, it expected that only a small number of South Koreans would ever use the software.\n “We had never thought that it would be used by so many people, becoming a must-install app for all arrivals at the airport,” Mr. Hong said.\n Mr. Jung said that while the group had worked around the clock to develop the app and train officials on how to use it, they lacked the expertise to make the software secure.\n Over time, the government also asked Mr. Jung’s team to add surveillance functions to the app, which officials said had increased their workload and prevented them from spending time hunting for security flaws.\n A feature was added, for instance, that caused a quarantined person’s phone to emit a noise or vibrate when it was not physically moved for more than two hours. If the user did not respond by picking up the device, it was a potential sign that the person had ventured out and left the phone behind. The app would then alert the authorities.\n To keep a closer watch on quarantine violators, another function was added to connect tracking wristbands to the app.\n “We were simply overwhelmed with work,” said Koo Chang-kyu, a South Korean official.\n In meetings last month with Mr. Rechtenstein and a Times reporter, South Korean officials initially played down the security issues, saying that they had deleted personal data and disabled the app once a user completed the two-week quarantine.\n But Mr. Rechtenstein demonstrated in the meeting that his data could still be retrieved from the government server by using the app on his phone, even though his quarantine had ended more than a week earlier. South Korean officials later said they had fixed the problem.\n South Korea has become a global poster child for its creative and transparent handling of the coronavirus pandemic. But the app’s security flaws show how the country lags in protecting personal data, Mr. Rechtenstein said. He also expressed disappointment at how long it took the authorities to fix the problems.\n The episode could “affect perceptions about the Korean model” for combating the pandemic, Mr. Rechtenstein said.", "posttime": "2020-07-22 02:22:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,程序,信息,korea,应用程序", "title": "韩国修复了新冠肺炎隔离应用程序中的漏洞，该漏洞可能会让攻击者获取位置等敏感用户信息，并篡改数据", "title_en": "South Korea fixes flaws in its COVID-19 quarantine app that could let attackers access sensitive user info, like location, and tamper with data", "transed": 1, "url": "https://www.nytimes.com/2020/07/21/technology/korea-coronavirus-app-security.html", "via": "", "real_tags": ["漏洞", "程序", "信息", "korea", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "7b8be5fc57678108db2fbdf4f710ce24.jpg", "infoid": 1013333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软首次允许第三方应用程序开发者集成到微软团队会议体验中。新的以开发人员为中心的功能将允许应用程序在视频通话期间集成到团队会议中，甚至在会议之前和之后。第三方应用程序将能够在Microsoft Team通话期间显示内容，甚至在通话期间显示通知。这是第三方应用程序目前在微软团队中所能做的一个很大的扩展。\n微软团队的团队产品经理Michal Lesiczka在接受The Verge采访时解释说：“应用程序可以跨越聊天和协作，现在可以很容易地拥有扩展到会议的工作流程。”\n应用程序将能够在会议邀请中添加一个选项卡，团队用户可以在会议开始前与应用程序进行交互。一旦会议开始，团队参与者将能够将应用程序添加到实时通话中。这可能包括在团队会议期间触发事件实时通知的机器人，或者在侧边栏中向参与者显示信息的应用程序。集成还包括应用程序在会议控制栏中显示为按钮的功能。\n以前，如果你想在微软团队中分享一款应用程序或网络摄像头以外的东西，唯一可用的选项是屏幕共享，如果你只想演示一款应用程序，或者避免通知或隐私问题，这并不总是理想的选择。这些新功能将允许开发人员将会议体验扩展到基础之外。\n开发人员很久以来就想要这种类型的团队集成。微软团队的团队产品经理Archana Saseetharan在接受The Verge采访时解释说：“反馈的关键之一是，‘好吧，我们可以在这些其他领域整合和启用场景，但在会议中，我们也希望在那里发挥作用。’”“微软团队”的团队产品经理阿卡纳·萨瑟兰(Archana Saseetharan)在接受The Verge采访时解释说。我们正在为开发人员提供新的API和SDK功能，以集成和瞄准这些新领域。它是相同的开发过程、相同的发布过程、相同的验证过程。一切都是一样的，但是你有这三个新的能力去实现目标。“。\nMicrosoft团队会议还提供聊天、文件、会议笔记、白板以及记录和记录会议的功能。第三方应用程序的添加意味着这些应用程序也将永久链接到各个团队的会议。\n莱斯奇卡说：“我们真的看到了很多令人兴奋的事情。”“合作伙伴一直在向我们询问有关参加会议的问题，因此人们对此非常兴奋。”开发人员将于本月晚些时候开始测试这些新的应用程序集成，微软已经看到Polly、Open Agora、iCIMS、Miro和HireVue对将集成到会议中的应用程序感兴趣。\n就像微软团队最近几周宣布的一系列其他功能一样，第三方应用程序集成也受到了正在进行的大流行的推动。“对远程工作的全部关注加快了我们在这方面的交付，”Saseetharan承认。微软还推出了一种新的“一起模式”，试图将同事变成虚拟化身，以改善会议。\n这种共同模式与会议中的第三方应用程序相结合，可能会为微软团队在远程工作时代带来一个有趣的未来。“您看到我们宣布的每一项功能都是为了增强Meetings…。我们正在考虑所有这些功能的可扩展性，“Saseetharan解释说。“团队正在做的每一件事都具有可扩展性，以及我们如何扩大开发人员越来越深入地插入产品的可能性。”\n如果开发人员确实更深入地融入微软团队，我们可以在未来的会议中看到一些创新的协作新方式。微软并不是唯一一家在大流行后的情况下试验远程工作和会议工作方式的公司。Facebook最近还调侃了自己使用增强现实和虚拟现实进行远程工作的愿景，谷歌正在迅速将其截然不同的聊天、房间和会议通信平台整合到Gmail中，以努力与微软团队和Slake竞争。就连Slake也在试图通过Slake Connect重塑商业通信的未来，这是一种让企业相互沟通和协作的更强大的方式。\n为了跟上竞争的步伐，微软正以令人难以置信的速度前进，在许多领域，将许多不同的功能整合到一个应用程序中(或者微软喜欢称之为“中心”的应用程序)。Saseetharan甚至暗示，微软正在考虑开发者是否有兴趣为团队视频通话插入背景效果和过滤器。\n近几个月来，这场流行病一直是微软团队功能背后的驱动力，将该服务的日活跃用户推高至7500万。微软主要团队的视频呼叫竞争对手Zoom也有了巨大的增长，但近几个月来，它不得不花几个月的时间来纠正有争议的隐私和安全问题，而不是推出新的功能。\n很明显，微软已经抓住机会积极推进团队，在2020年结束之前，肯定会有更多的团队功能。", "note_en": "Microsoft is allowing third-party app developers to integrate into the Microsoft Teams meeting experience for the first time. The new developer-focused features will let apps integrate into Teams meetings during video calls, and even before and after meetings. Third-party apps will be able to display content during Microsoft Teams calls, and even display notifications during calls. It’s a big expansion of what third-party apps are able to do in Microsoft Teams right now.\n “Applications can span across chat and collaboration and easily have a workflow that expands into meetings now,” explains Michal Lesiczka, a group product manager of Microsoft Teams, in an interview with  The Verge.\n Applications will be able to add a tab to meeting invites where Teams users can interact with the app before a meeting begins. Once a meeting begins, Teams participants will be able to pull apps into the live call. This could include bots that trigger live notifications about events while a Teams meeting is taking place or an app that shows information to participants in the sidebar. The integration also includes the ability for apps to appear as a button in the meeting controls bar.\n   Previously, if you wanted to share an app or something more than a webcam in Microsoft Teams, the only option available was screen sharing, which isn’t always ideal if you just want to demonstrate one app or avoid notifications or privacy headaches. These new features will allow developers to extend the meetings experience beyond the basics.\n Developers have wanted this type of Teams integration for a long time. “One of the key pieces of feedback is, ‘Okay, we can integrate and enable scenarios in these other areas, but in meetings, we want to be playing there as well,’” explains Archana Saseetharan, a group product manager of Microsoft Teams, in an interview with  The Verge. “We are enabling new APIs and SDK capabilities for developers to integrate and target these new areas. It is the same development process, the same publishing process, the same validation process. Everything is the same, but you have these three new capabilities to go target.”\n  Microsoft Teams meetings also offer a history of chat, files, meeting notes, a whiteboard, and the ability to record and transcribe meetings. The addition of third-party apps means these will also be permanently linked to individual Teams meetings.\n “We’ve really seen a ton of excitement about this,” says Lesiczka. “Partners have been asking us about plugging into meetings, so there’s a lot of excitement about this.” Developers will be able to start testing these new app integrations later this month, and Microsoft is already seeing interest from Polly, Open Agora, iCIMS, Miro, and HireVue for apps that will integrate into meetings.\n   Like the flurry of other Microsoft Teams features that have been announced in recent weeks, third-party app integration has also been driven by the ongoing pandemic. “The whole focus on remote work has accelerated our delivery on this,” admits Saseetharan. Microsoft is also rolling out  a new “Together Mode” that attempts to turn co-workers into virtual avatars to improve meetings.\n This Together Mode combined with third-party apps in meetings could lead to an interesting future for Microsoft Teams in the era of remote working. “Every single feature that you see us announcing is to amplify meetings … we’re thinking about extensibility of all of them,” explains Saseetharan. “Everything that Teams is doing has an extensibility play to it, and how we amplify the possibilities for developers to plug more and more deeply into the product.”\n If developers do plug into Microsoft Teams more deeply, we could see some innovative new ways to collaborate in future meetings. Microsoft isn’t alone in experimenting with how remote working and meetings will work in post-pandemic scenarios. Facebook also recently teased its  own vision of remote work using augmented and virtual reality, and  Google is rapidly integrating its disparate Chat, Rooms, and Meet communications platforms into Gmail in an effort to compete with Microsoft Teams and Slack. Even Slack is trying to reinvent  the future of business communications with Slack Connect, a more powerful way for businesses to communicate and collaborate with each other.\n   Microsoft is moving incredibly fast to keep pace with the competition, and in many areas, combine lots of different functionality into a single app (or “hub” as Microsoft likes to call it). Saseetharan even hints that Microsoft is looking at developer interest in plugging into background effects and filters for Teams video calls.\n The pandemic has been the driving force behind Microsoft Teams features in recent months, pushing the service  up to 75 million daily active users. Microsoft’s main Teams video calling competitor, Zoom, has also seen huge growth, but it’s had to spend recent months  rectifying controversial privacy and security issues rather than rolling out new features.\n It’s clear Microsoft has taken its opportunity to push aggressively with Teams, and there’s bound to be a whole lot more Teams features before 2020 is over.", "posttime": "2020-07-22 02:21:45", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开发,microsoft,程序,微软,现在", "title": "微软表示，现在将允许第三方开发者将应用程序集成到团队视频通话中，包括在会议之前、期间和之后", "title_en": "Microsoft says it will now let third-party developers integrate apps into Teams video calls, including before, during, and after meetings", "transed": 1, "url": "https://www.theverge.com/2020/7/21/21332414/microsoft-teams-third-party-apps-calls-meetings-integration-features?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["开发", "microsoft", "程序", "微软", "现在"]}, {"category": "", "categoryclass": "", "imagename": "64a8bb5abfe2902b7c69f4820ef1c2d5.jpg", "infoid": 1013332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安东尼·戈布利希的妈妈正开车送他去疏散区。该地区突然发生煤气泄漏，母子俩正开着这家人的黑色GMC Denali运动型多用途车(SUV)赶往现场。\n霍普盘腿坐着，右脚踩着踏板，左脚紧贴着右大腿。安东尼坐在后面，紧挨着为他妹妹准备的空车座，一边听着警方的扫描仪，一边用拇指在霍普的智能手机上用拇指指着她的驾驶方向。安东尼正在使用他母亲的手机，因为他只有12岁。他得等自己长大一点才能拥有自己的房子。\n安东尼是一个瘦小的白色孩子，留着棕色的直发，鼻子和脸颊上都有雀斑。他的衬衫上印着他在所有活动被取消之前所属的当地青少年体操项目的标志。现在是2020年2月下旬，距离新冠肺炎大流行将使世界陷入停顿只有几周的时间。\n安东尼在开车时想起了一些事情：“哦，妈妈，我们今天要喂我的甲虫。”\n“好的，太棒了，谢谢妈妈，你是最棒的。”安东尼把注意力转回到扫描仪上，这时电话线上传来了一些喋喋不休的声音。更多的消防部队正在赶往煤气泄漏的路上。\n他们正驾车穿过旧金山南部的圣马特奥郊区。安东尼第一次听到煤气泄漏的电话是通过霍普电脑上的扫描仪应用程序，他定期监控电脑。就在那时，这对情侣跳上了SUV。到目前为止，官员们已经下令当地一所幼儿园疏散。周围建筑物中的人们已被告知要原地避难。\n当他们到达时，学校旁边的十字路口被一辆消防车堵住了。安东尼正确地确认它是圣马特奥综合消防局的23号卡车。霍普在下一个路口左拐，把车停在街上。“我让你在这里下车，伙计，”她说。“好的，祝你好运！”\n安东尼跳下车，手里拿着他妈妈的手机。他的鞋跟在他的脚下被压扁了，在他匆忙离开房子的时候被压平了。当安东尼将手机连接到一个轻巧的三脚架上时，希望滚滚而去，他快速而精确的动作显示了一只熟练的手的证据。\n安东尼朝骚动的方向走去，把三脚架举在他面前。他轻敲屏幕上的一个按钮，摄像机开始在互联网上实况转播这一场景。他开始说话。“安东尼·G，现场报道一次大规模的煤气泄漏，疏散了一所学校的…。”\n几分钟后，一个女人走近安东尼，问发生了什么事。他向她快速重述了他所知道的一切情况：煤气泄漏，疏散，当地人留在室内的命令，到目前为止，第一反应小组已经到达。\n那女人的眉头皱了起来。“太可怕了，”她一边走开一边说，一边走一边回头看了安东尼一眼。\n她的担忧是有道理的。安东尼正在使用Civil en拍摄，这是一款应用程序，可以提醒用户附近的紧急事件，并让他们从现场进行直播。安东尼拍摄了这一切：车祸、入室盗窃、警察追捕，以及不知不觉中自杀的后果。在安东尼上传到“公民”的这一年里，他拍摄了数百个这样的视频：准确地说是675个。\n他的多产为他赢得了粉丝基础-其他公民用户在评论中称赞他的视频，并问道：“安东尼·G在哪里？”他没有报道的事件。也有质问者。他们嘲笑他的摄影，侮辱他青春期前的嗓音。他已经习惯了忽视除了最恶毒的巨魔之外的所有东西。\n安东尼只是数以百万计的用户中的一员，他们蜂拥到公民网站，实时查看、报道和评论当地事件。该公司表示，已有500万人签约。它不会确认这些用户中有多少人经常在该平台上活跃，也不会确认有多少人真的发布了视频，而不仅仅是潜伏着。尽管如此，公民是一个充满活力和不断增长的平台-一个吸引我们的好奇心和我们基本的人类愿望的平台，这个平台不仅要意识到附近的危险，而且要更加接近危险。\n当你打开“公民”，首先看到的是一张地图。这是一款总是在黑暗模式下运行的应用程序，纽约、旧金山、巴尔的摩、洛杉矶-目前可以使用该应用程序的19个城市中的任何一个-的黑色网格都会散布在屏幕上。捏一下并放大，你会看到地图上出现了一些圆点。每一次都表明了当地的危机：一场火灾，一次袭击，一个挥舞着两把三叉戟的男子。所有这些地理定位的信息都是从城市的紧急扫描仪收集的，并通过公民雇员进行过滤，他们汇编事件并将其放在地图上。这款应用程序的始终在线位置感知是必要的。如果事件发生在你所在的社区，应用程序会向你发送潜在危险的推送通知。如果“公民”认为你离得很近，就会出现一个按钮，让你直播正在发生的事情。\n大多数公民用户不像安东尼。她们不会在周末拍摄成百上千的视频，也不会和妈妈一起追赶火灾和交通冲突。也许他们在穿过城市时会担心自己的安全。也许他们需要知道抗议在哪里。也许他们只是想在评论里说些狗屎的话。\n不管是什么原因，公民已经吸引了数百万创建了用户账户的人，仅在过去的两个月里就有数十万人。这款应用的创建者将其视为一种透明的工具，一种中立、简化的信使，让城市居民每天都能访问数以百万计的加密报告，这些报告散布在紧急扫描仪上。但是“公民”的雄心壮志并没有止步于此。\n自从乔治·弗洛伊德(George Floyd)的死引发了全球范围内反对警察暴行的抗议活动以来，随着人们想方设法监控示威活动，并预测试图控制示威活动的执法官员的行动，公民的用户数量激增。今年5月，公民号在其服务中添加了联系人追踪功能，允许用户选择加入，以帮助追踪新冠肺炎的传播。\n公民处于有利地位，可以抓住这个社会动荡的时刻。这款应用程序承诺了安全感和社区感，这两种奢侈品在一个人们被迫分开并被猖獗的不平等激怒的世界里被极度怀念。当这个国家重新考虑其对执法的过度依赖，以及首先维护社区安全意味着什么时，公民的宣传尤其有吸引力。\n公民可能想要保持中立，但这并不容易。尤其是当你想在世界火热的时候解决安全这样一个根本问题的时候。这款应用的批评者长期以来一直指出，这款应用可能会放大这个国家更大的社会问题。这款应用的评论区往往会沦为种族主义和仇恨的洪流。用户抱怨这款应用加剧了他们的焦虑和偏执，因为它不断提醒他们家门口以外的危险。公民还面临着非常现实的关切，即它有可能导致种族定性和歧视性监视。\n布鲁金斯学会(Brookings Institution)技术创新中心(Center For Technology Innovation)主任尼科尔·特纳·李(Nicol Turner Lee)表示：“科维德(Covid)、乔治·弗洛伊德(George Floyd)遇害事件以及这些新技术工具的可获得性所分享和浮现的是，我们有一个不平等的社会。”“无论是谁控制了这些信息，或者是谁控制了那个应用程序或那个平台，他们就控制了叙事。”\n对于一家如此热衷于创造透明度的公司来说，Citizen对旨在修复其服务的更黑暗方面的任何具体功能都非常沉默。它坚称有正在运作的解决方案，但它还不愿透露任何这些计划。在某种程度上，该公司的保密只会适得其反，招致人们对潜在邪恶意图的怀疑和猜测。\n公民可能想要创造一个开放和负责任的世界，但如果公司想让人们相信它只想保证他们的安全，这种努力必须很快转向国内。\nCitizen的创始人兼首席执行官安德鲁·弗莱克喜欢谈论焚烧建筑物。他不是纵火狂什么的。这只是一个假设的例子，当你问他和其他在公民公司工作的人为什么要开发这款应用时，他们喜欢用这个例子。\n“为什么急救人员和其他人之间会有这种信息不对称，他们可以接触到正在进行的一切，包括你大楼里的火灾？”弗莱姆问。“你，在你的大楼里，你无权访问这些信息。这太疯狂了。这是你的信息。那就是你的地址。“。\n市民经常被归类到其他服务中，这些服务出售提高安全性的承诺。简单的类比是Nextdoor，一个有着种族主义和虐待历史的社交平台，伪装成痛苦的手，以及亚马逊的Ring，它被批评与执法部门过于亲近。这些比较让Frame感到沮丧。他是一位真正的初创公司创始人，他相信自己的产品代表了一种独特的愿景。其他标签-社交媒体、安全系统、邻里守望-也不太适合公民。\n“我们没有竞争对手，”Frame说。“我们已经创建了自己的类别。”\n他说得有道理。公民提供的服务是其他任何人都做不到的。当然，Ring可以捕捉犯罪的视频剪辑，但摄像机不能看到超出你的地界的太多东西。NextDoor为人们提供了一个就他们的安全问题争吵的论坛，但它同样局限于单一社区的限制。只有公民才能实时提醒人们注意当地和超地方层面的犯罪和灾难，然后让他们相互评论和分享信息。这是你口袋里的众包金丝雀，每当有报告说有人被刺伤或40名青少年打架时，它就会尖叫。\n“安全是所有75亿人拥有的核心首要需求之一，”Frame说。“这不是一个人口统计数字。安全是每个人都需要和需要的东西。“。\n这是一项崇高的任务：通过让人们保持清醒来保护他们的安全。公民是一家依赖于创业精神的混乱本质的公司，因为它不愿与其他所谓的颠覆者混为一谈。询问公民员工最初是什么吸引他们加入这个组织，你会得到与他们的领导观点一致的答案。\n“硅谷有很多大个子摇摆不定的家伙，”一位“公民”的发言人告诉我。“到目前为止，安德鲁对宏伟的幻想是最卑微的。”\n从一开始，该公司就很难让人们相信它的意图是纯粹的。这款应用程序于2016年10月突然出现，名为Vililante，这款产品是通过一段视频向世界介绍的，视频中描绘了一小群旁观者挥舞手机摄像头聚集在一起阻止袭击。这场营销活动很快就受到了执法部门的谴责，因为它建议人们将自己置于危险之中，并试图不受约束地伸张正义。它也遭到了媒体的猛烈抨击，并在抵达后48小时内被驱逐出应用商店。五个月后，伤口舔了舔，灵魂也在搜索，公司更名为公民。这项服务几乎保持不变--一个平台，供普通智能手机用户了解和报告他们所在社区的紧急情况--尽管营销更加有分寸，绰号也不那么咄咄逼人。但怀疑和激烈的评论从未真正减少。\n随着批评者指出该平台的缺陷，公民号继续调整其服务。它创建了一个全职内容审核团队来审查评论部分和核攻击性帖子。设计师重新配置了应用程序的视觉效果，以淡化警报量，并提供视觉反馈，向用户显示某个区域何时是安全的。公民制定了明确的指导方针，说明他们愿意和不会推动什么事件：没有可疑人员的报告，没有家庭纠纷，没有自杀事件。\n这些远不是完美的解决方案；任何允许用户贡献的服务都必然是混乱和分裂的。但它们仍然比科技行业常见的反应更好，在科技行业，社交平台经常对此类活动持目瞪口呆的超然态度。\n在大流行迫使社会陷入孤立之前，“公民”的规模正在迅速扩大。今年3月，风险投资公司Goodwater Capital向Citizen注资2000万美元，占该公司有史以来筹集资金总额的三分之一。它使Citizen能够加快其推出时间表。在2020年初，公民几乎每周都会在其平台上添加一个新城市。\n当隔离开始时，该公司的员工不得不适应在家工作，远离公民曼哈顿市中心办公室里隆起的站立办公桌和弯曲的电脑显示器。该团队迅速调整了产品，为应用程序补充了新功能，如定期更新新冠肺炎的统计数据和城市特定的避难所就地法规。当警察杀害乔治·弗洛伊德(George Floyd)引发全国性示威活动，抗议警察对美国黑人的暴行时，许多新用户下载了这款应用，以此作为监控骚乱的一种方式。\n尽管被采用的人数越来越多，但Citizen仍然没有产生任何收入。(“我们从来没有赚过一分钱，”弗莱尔说。)。这是一款没有广告的免费应用，到目前为止，该公司一直对其利润动机最终在哪里保持神秘。但这种保密可能即将结束。Frame告诉我，他计划在今年把“公民”变成一个货币化的产品。\nFrame说：“归根结底，这是一家C公司：我们来这里是为了赚钱。”“但我们来这里是为了负责任地赚钱。我们想完成一项任务。我们不想在我们的价值观上妥协。我们希望负责任地为股东赚钱。那是燃料。打造有规模的引擎的方法就是让资本主义为你服务。“。\n该公司表示，它不认为浏览量、点击量或花费的时间是衡量成功的有价值的指标。Frame表示，Citizen永远不会向用户出售用户数据或提供广告。但是，尽管它的计划可能不取决于对这款应用的参与度，但它确实取决于其用户基础的绝对数量。该公司尚未宣布任何细节，但该计划的总体主旨是明确的：获得足够的用户，以便能够创建分层体验，然后出售订阅的高级功能。\n“货币化间接地随之而来，”Frame说。“我们网络的规模，也就是我们向其销售下一代安全功能的受众规模。只有付费用户才能使用这些功能--超出了“公民”目前提供的服务。“\n公民依赖于人。算法和扫描仪监控硬件只能做到这一点。毕竟，警报仍然需要由公民员工单独审查和发送。这些警报由用户接收，他们解释这些消息，分享它们，并通过拍摄或评论场景来添加到这些消息中。拍摄的视频越多，这款应用程序就越能吸引人们的注意，并获得更多的下载量。如果Citizen必须增长才能赚钱，那么它必须首先吸引人们使用这款应用。\n“公民将赋予你安全、知情和做出更好决策的权力，”公民文化和社区负责人丹尼斯·“王子”·马普(Dennis“Prince”Mapp)说，他几乎从一开始就在公司工作。“我可以走出火场，而不是走进火里。”\n问题是，一个为了躲避火灾而在街区走来走去的人并不能制作出一个非常令人兴奋的营销视频。引起人们注意的是大火本身的镜头，或者被绑架的儿童，或者一些直截了当的恐怖主义。公民当前的营销策略依赖于指出应用程序上捕捉到的积极互动。今年4月，公民开始向用户发送通知，其中包含它所称的魔力时刻(Magic Moments)-经过巧妙编辑的视频，这些视频回忆起公民用户前来救援或防止自己和其他人成为可怕悲剧的受害者的事件。(并不是所有的都涉及灾难色情。神奇的时刻包括庆祝重要的工作人员和人们让一只走失的狗与它的主人团聚。)。\n公民不能鼓励用户更接近危险，或者跑过城市去拍摄可怕的事件；义务警员的惨败给团队上了一课。但要展示这款应用的真正能力，它需要用户提供的参与和内容。它需要的用户不是坐在家里目瞪口呆地看着屏幕，而是有人在Trader Joe‘s里遭到袭击。愿意把“公民”带到下一个层次的人是那些愿意去现场拿到镜头的人。\n安东尼在阑尾破裂后第一次进入了“公民”。一位朋友的母亲顺便提到了这款应用，安东尼从手术中恢复后对它越来越着迷。有一天，在他能够再次起身走动后，他闻到了烟味，并意识到邻居的房子着火了。当时他在家和一位家教一起工作。他恳求他们把他带到外面去拍摄大火。\n从那时起，安东尼几乎不间断地报道事件。他从醒来的那一刻到上床的那一刻都会收听警方的广播。他一周会出差好几次，有时一天会出差好几次。有时安东尼的父亲或祖父母开车送他去看戏。如果事件发生在附近，他可能会骑自行车。但大多数时候，是他妈妈开车送他去的。\n“他更喜欢是我，因为我比我丈夫离开家快得多，”霍普说。“我通常光着脚跑出门外，就像我们是某种标签队的新闻团队一样。”\n安东尼说：“当妈妈和我在一起的时候，效果要好得多。”\n二人组的动态有时会招致愤怒。在安东尼视频下的评论中，人们对霍普大喊大叫，称她是一个糟糕的母亲，并质疑她的育儿方式。一位市民评论者威胁说要向儿童保护服务机构举报Hope。安东尼一直受到欺凌和骚扰，最引人注目的是两名公民用户，他们在被禁止使用该应用程序之前，对他进行了为期两个月的运动。\n人们很容易做出类似的判断，给安东尼贴上某种年轻的、想成为夜行者的标签。但他不是不负责任的，也不是反社会的。他只是个对紧急反应的兴奋感兴趣的孩子。他最喜欢的事件是那些需要危险品处理人员出现的事件，原因很简单，因为这些人拥有最酷的反应车辆。\n霍普说：“他的姐妹们总是说，‘这太糟糕了，安东尼，你希望坏事发生在人们身上，’而他的回答是，‘这不是我想要任何坏事发生在人们身上，而是我只是觉得每件事都很有趣，我喜欢看他们的反应。’”\n安东尼远不是“公民”上唯一的超级用户。从纽约到洛杉矶再到印第安纳波利斯，城市的用户每人都在这款应用上发布了数百个视频。他们中的一些人这样做只是为了好玩。其他人使用这款应用程序来补充在Facebook群组和其他在线反犯罪组织中跟踪和分享当地犯罪信息的努力。\n当这款应用程序进入一个新城市时，公民会聘请当地人拍摄事件并创建内容，以此来激发当地对这款应用的兴趣。这些非官方的“街头团队”的成员是按视频付费的，只要视频有一定的长度并达到合理的质量标准。这款应用中没有提到街队用户的身份；我为这篇报道采访的前付费承包商说，他们被明确告知要避免给出任何迹象，表明公民正在付钱让他们发布内容。他们被告知，该公司希望这些视频给人以有机的感觉。\n在大流行之前，凯文·鲍威尔(Kevin Powell)在印第安纳波利斯作为公民街队的一名全职承包商工作。在写这篇文章时，他已经录制了747个视频，所有这些视频都是在花旗以来上传的。\n.", "note_en": "Anthony Goblirsch’s mom is driving him to the evacuation zone. A gas leak has sprung up in the area, and mother and son are zipping to the scene in the family&#39;s SUV, a black GMC Denali.\n Hope sits half cross-legged, her right foot working the pedals while her left foot stays tucked against her right thigh. Anthony is in the back, next to the vacant car seat meant for his younger sister, listening to a police scanner and thumbing a map on Hope’s smartphone as he feeds her driving directions. Anthony is using his mother&#39;s phone because he&#39;s only 12 years old. He has to wait until he&#39;s a little older before he gets his own.\n Anthony is a thin white kid with straight brown hair, his nose and cheeks splotched with freckles. His shirt bears the logo of the local youth gymnastics program he belonged to before everything got canceled. It’s late February 2020, just a couple short weeks before the  Covid-19 pandemic will grind the world to a halt.\n  Anthony remembers something as they drive: “Oh, Mom, we need to feed my beetles today.”\n   “OK, awesome, thanks Mom, you’re the best.” Anthony shifts his attention back to the scanner as some chatter comes across the line. More fire units are en route to the gas leak.\n  They’re driving through the suburbs of San Mateo, just south of San Francisco. Anthony first heard the call about the gas leak through the scanner app on Hope’s computer, which he monitors regularly. That’s when the pair hopped in the SUV. By now, officials have  ordered a local preschool to evacuate. People in the surrounding buildings have been told to shelter in place.\n When they arrive, the intersection next to the school is blocked by a fire engine. Anthony correctly identifies it as truck 23 from San Mateo Consolidated Fire Department. Hope takes the next left and stops the car in the street. “I’m gonna let you out here, buddy,” she says. “OK, good luck!”\n  Anthony bounds out of the vehicle, his mom’s phone in hand. The heels of his shoes are squished beneath his feet, flattened in his rush to leave the house. Hope rolls away as Anthony attaches the phone to a lightweight tripod, his quick and precise movements displaying the evidence of a practiced hand.\n Anthony moves toward the commotion, holding the tripod out in front of him. He taps a button on the screen, and the camera starts broadcasting the scene live onto the internet. He starts talking. “Anthony G., reporting live at a large gas leak which evacuated a school …”\n  A few minutes later, a woman approaches Anthony and asks what’s happening. He gives her a rapid-fire recap of everything he knows about the situation: the gas leak, the evacuation, the orders for locals to stay indoors, which first-response units have arrived so far.\n    The woman’s brow furrows. “That’s scary,” she says as she walks away, throwing a glance back at Anthony as she goes.\n Her concern is justified. Anthony is filming with Citizen, an app that alerts its users to nearby emergency incidents and lets them livestream from the scene. Anthony has filmed it all:  car crashes,  home invasions,  police pursuits, and, unwittingly, the  aftermath of a suicide. In the year that Anthony has been uploading to Citizen, he’s filmed hundreds of these videos: 675 to be exact.\n His prolificity has earned him a fan base—other Citizen users who comment to commend his videos and ask, “Where’s Anthony G?” on incidents he doesn’t cover. There are hecklers too. They mock his cinematography and insult his preteen voice. He’s gotten used to ignoring all but the most vicious trolls.\n Anthony is just one of millions of users who have flocked to Citizen for viewing, reporting, and commenting on local incidents in real time. The company says 5 million people have signed up. It won’t confirm how many of those users are regularly active on the platform, or how many actually post videos rather than just lurk. Still, Citizen is a vibrant and growing platform—one that appeals to our curiosity and our base human desire to not only stay aware of nearby danger, but to draw ever closer toward it.\n  The first thing you see when you open Citizen is a map. It is an app that always runs in  dark mode, the black grids of New York, San Francisco, Baltimore, Los Angeles—any of the 19 cities where the app is currently available—splayed across the screen. Pinch and zoom and you’ll see dots show up on the map. Each one indicates a local crisis: a fire, an assault, a  man wielding two tridents. All this geolocated information is gleaned from the city’s emergency scanners and filtered through Citizen employees, who compile the incidents and place them on the map. The app’s always-on location awareness is a necessity. If the incident is in your neighborhood, the app sends you a push notification about the potential danger. If Citizen decides you’re  really close, a button appears to let you livestream what’s happening.\n Most Citizen users aren’t like Anthony. They don’t film hundreds of videos or chase down fires and traffic collisions with their moms on the weekend. Maybe they fear for their safety when they walk through a city. Maybe they need to know where the  protests are. Maybe they just want to  talk shit in the comments.\n Whatever the reason, Citizen has already appealed to the millions who have created user accounts, hundreds of thousands of them in the past two months alone. The creators of the app see it as a tool for transparency, a neutral, simplified messenger that grants city dwellers access to the millions of cryptic coded reports that zip across emergency scanners every day. But Citizen’s ambitions don’t stop there.\n Since the  death of George Floyd sparked worldwide protests against police brutality,  Citizen’s user numbers have surged as people look for ways to monitor the demonstrations and anticipate the movements of the law enforcement officials seeking to control them. In May, Citizen  added a contact-tracing feature to its service that allowed users to opt in to help track the spread of Covid-19.\n  Citizen is well positioned to seize upon this moment of societal upheaval. The app promises the feeling of safety and community, both luxuries that are sorely missed in a world where people have been forced apart and incensed by rampant inequality. Citizen’s pitch is especially appealing as this country reconsiders its overreliance on law enforcement and what it means to keep a community safe in the first place.\n  Citizen may want to stay neutral, but that’s not so easy. Especially not when you want to solve such a fundamental problem as safety at a time when the world is on fire. Critics of the app have long pointed out the way the app can amplify the country’s larger societal problems. The app’s comment sections tend to devolve into streams of racism and hatred. Users have complained about the app stoking their  anxiety and  paranoia as it constantly reminds them of the dangers beyond their doorstep. Citizen also faces very real concerns about its potential to enable  racial profiling and  discriminatory surveillance.\n “What Covid, what George Floyd&#39;s killing and the availability of these new technological tools have shared and surfaced is that we have an unequal society,” says Nicol Turner Lee, director of the Center for Technology Innovation at the Brookings Institution. “Whoever is in control of that information, or whoever controls that app or that platform, they control the narrative.”\n For a company so enamored with creating transparency, Citizen is remarkably reticent to comment on any specific features aimed at fixing the darker aspects of its service. It insists that there are solutions at work, but it has not been willing to disclose any of those plans yet. In a way, the company’s secrecy has only backfired, by inviting suspicion and speculation about  potential nefarious intent.\n Citizen may want to create a world of openness and accountability, but that effort must soon turn inward if the company wants to convince people that it only wants to keep them safe.\n  Andrew Frame, Citizen’s founder and CEO, likes to talk about burning buildings. He’s not a pyromaniac or anything. It’s just a hypothetical example he and others who work at Citizen like to use when you ask them why they made the app.\n “Why is there this asymmetry of information between the first responders who have access to everything going on, including a fire in your building, and everybody else?” Frame asks. “You, in your building, you don&#39;t have access to that information. That&#39;s crazy. That&#39;s  your information. That&#39;s  your address.”\n  Citizen often gets grouped in with  other services that sell the promise of increased safety. The easy analogies are Nextdoor, a social platform with a history of  racism and abuse masquerading as hand-wringing, and Amazon’s Ring, which has been criticized for getting  too cozy with law enforcement. These comparisons frustrate Frame. He’s a true startup founder who believes his product represents a unique vision. Those other labels—social media, security system, neighborhood watch—don’t quite fit Citizen either.\n “We don’t have competition,” Frame says. “We’ve created our own category.”\n  He’s got a point. Citizen offers a service that nothing else has quite managed to pull off. Sure, Ring can capture video clips of crimes, but the cameras can’t see much beyond your property line. Nextdoor offers a forum for people to bicker about their safety concerns, but it’s similarly confined to the limits of a single neighborhood. Only Citizen alerts people to crimes and catastrophes at both the local and hyper-local level in real time, then lets them comment and share information with each other. It’s the crowdsourced canary in your pocket that squawks whenever there’s a report of a  man stabbed or  forty teenagers fighting.\n  “Safety is one of the core primal needs that all 7 and a half billion people have,” Frame says. “It&#39;s not a demographic. Safety is something that everybody requires and needs.”\n It’s a lofty mission: keeping people safe by keeping them aware. Citizen is a company as dependent on the chaotic nature of the startup ethos as it is resistant to being lumped in with the rest of the so-called disruptors. Ask Citizen employees what attracted them to the organization in the first place and you’ll get answers that align their outlook with that of their leader.\n “There’s a lot of big swinging dicks in Silicon Valley,” one Citizen spokesperson told me. “Andrew’s delusions of grandeur were by far the most humble.”\n From the beginning, the company has struggled to convince people that its intentions are pure. The app  burst into existence in October 2016 as  Vigilante, a product that was introduced to the world via a  video that depicts a small army of bystanders coming together to stop an assault by wielding their phone cameras. The marketing campaign was quickly condemned by law enforcement for suggesting that people put themselves in harm’s way and attempt to levy justice unchecked. It was also lambasted by the media and  ejected from the App Store within 48 hours of its arrival. Five months later, wounds licked and souls searched, the company  rebranded as Citizen. The service stayed nearly the same—a platform for ordinary users with a smartphone to learn about and report on emergencies in their neighborhood—albeit with more measured marketing and a less aggressive moniker. But the suspicion and fiery op-eds never really abated.\n Citizen has continued to tweak its service as critics point out the platform&#39;s flaws. It created a full-time content moderation team to review comment sections and nuke offensive posts. Designers  reconfigured the visuals of the app to deemphasize the alarming amount of alerts and provide visual feedback that shows users when an area is safe. Citizen set clear guidelines about what incidents it would and wouldn’t push: no reports of suspicious people, no domestic disputes, no suicides.\n These are far from perfect solutions; any service that allows user contributions is bound to be messy and divisive. But they’re still better than the response common to the tech industry, where social platforms often meet such activities with  dead-eyed detachment.\n  Before the pandemic forced society into isolation, Citizen was expanding quickly. In March the VC firm Goodwater Capital  injected $20 million into Citizen, a full third of the  total funding the company has ever raised. It enabled Citizen to accelerate its rollout schedule. In the early days of 2020, Citizen was adding a new city to its platform just about every week.\n   When quarantine began, the company’s employees had to adjust to working from home, away from the Uplift standing desks and curved computer monitors that filled Citizen’s downtown Manhattan office. The team adapted its product quickly, supplementing the app with new features like regular updates of Covid-19 statistics and city-specific shelter-in-place regulations. When the police killing of George Floyd kicked off nationwide demonstrations protesting police brutality against Black Americans, a slew of new users downloaded the app as a way to  monitor the turmoil.\n  Despite growing adoption, Citizen still has yet to generate any revenue. (“We&#39;ve never made a penny,” Frame says.) It’s a free app with no ads, and so far, the company has been mysterious about where its profit motives ultimately lie. But that secrecy could be coming to an end. Frame told me that he plans to turn Citizen into a monetizable product this year.\n  &#34;At the end of the day, this is a C corp: We are here to make money,” Frame says. “But we are here to make money responsibly. We want to deliver on a mission. We don’t want to compromise on our values. We want to make money for shareholders responsibly. That’s fuel. The way to build an engine that scales is to have capitalism working for you.”\n The company says it doesn’t consider views, clicks, or time spent to be valuable metrics for measuring success. Frame says Citizen will never sell user data or serve ads to its users. But while its plans might not depend on engagement in the app, it does depend on the sheer volume of its user base. The company has not announced any specifics, but the general thrust of the plan is clear: Get enough users to be able to create a tiered experience, then sell subscriptions for premium features.\n “The monetization indirectly follows,” Frame says. “The size of our network, that’s the size of the audience that we get to sell this next generation of safety features to. There will be features coming out available only to those who pay—beyond what Citizen offers today.”\n Citizen depends on human beings. Algorithms and scanner-monitoring hardware can only take it so far. After all, alerts still have to be individually vetted and sent out by Citizen employees. Those alerts are received by users who interpret those messages, share them, and add to them by filming or commenting on a scene. The more videos are filmed, the more the app catches people’s attention and garners downloads. If Citizen has to grow before it can make money, then it has to entice people to use the app in the first place.\n “Citizen will give you that power to be safe and informed and make better decisions,” says Dennis “Prince” Mapp, Citizen’s head of culture and community who has been with the company since nearly the beginning. “Instead of walking into a fire, I can walk away from the fire.&#34;\n The problem is, a person walking around the block to avoid a fire does not make for a very exciting marketing video. What captures people’s attention is footage of the  fire itself or a  kidnapped child or some  straight-up terrorism. Citizen’s current marketing strategy relies on pointing to positive interactions captured on the app. In April, Citizen started to send users notifications containing what it calls Magic Moments—slickly edited videos that recall incidents where Citizen users came to the rescue or prevented themselves and others from falling victim to an awful tragedy. (Not all of them involved disaster porn. Magic Moments have included a  celebration of essential workers and people  reuniting a lost dog with its owner.)\n Citizen can’t encourage users to get closer to danger or race across town to film a horrific incident; the Vigilante fiasco taught the team that lesson. But to show what the app is really capable of, it needs the participation and content provided by its users. It needs users who don’t just sit at home and gape at the screen while  someone gets assaulted in a Trader Joe’s. The people who will take Citizen to the next level are the ones willing to go to the scene, to get the footage.\n    Anthony first got into Citizen after his appendix burst. A friend’s mom mentioned the app in passing, and Anthony grew fascinated with it as he recovered from his surgery. One day, after he was able to get up and about again, he smelled smoke and realized that a neighbor’s house had caught fire. He was home working with a tutor at the time. He begged them to take him outside to film the blaze.\n  Since then, Anthony has reported on incidents nearly nonstop. He listens to the police scanner from the moment he wakes up to the moment he goes to bed. He’ll go out on reporting trips multiple times a week, sometimes multiple times in a day. Sometimes Anthony’s dad or grandparents chauffeur him to scenes. If the incident is in the neighborhood, he might ride his bike. But most of the time, his mom drives him.\n “He prefers when it’s me because I leave the house much more quickly than my husband,” Hope says. “I usually am barefoot and running out the door like we’re some kind of tag-team news team.”\n “It works much better when it’s Mom and me,” Anthony says.\n The duo’s dynamic sometimes draws ire. In the comments under Anthony’s videos, people have yelled at Hope, called her a terrible mother, and questioned her parenting. One Citizen commenter threatened to report Hope to Child Protective Services. Anthony has been bullied and harassed, most notably by a pair of Citizen users who went on a two-month-long campaign against him before being banned from the app.\n It’s tempting to rush to similar judgements, to label Anthony some kind of young, wanna-be  Nightcrawler. But he isn’t irresponsible or a sociopath. He’s just a kid who’s interested in the excitement around an emergency response. His favorite incidents are ones that require hazmat crews to show up, simply because those guys have the coolest response vehicles.\n “His sisters always say, ‘That&#39;s so bad Anthony, you want bad things to happen to people,’” Hope says, “and he&#39;s like, ‘It&#39;s not that I want anything bad to happen to people, it’s that I just find everything interesting, and I like to see how they respond.’”\n  Anthony is far from the only power user on Citizen. Users in cities from New York to Los Angeles to Indianapolis have each posted hundreds of videos on the app. Some of them do it just for kicks. Others use the app to supplement efforts to track and share info about local crimes in Facebook groups and other anti-crime organizations online.\n When the app moves into a new city, Citizen hires locals to film incidents and create content as a way to kick-start local interest in the app. Members of these unofficial “street teams” are paid per video, as long as the videos run a certain length and meet a reasonable standard for quality. Street team users aren’t identified within the app; former paid contractors I interviewed for this story said they were explicitly told to avoid giving any indication that they were being paid by Citizen to post content. The company wanted the videos to feel organic, they were told.\n Before the pandemic, Kevin Powell worked full-time as one of Citizen’s street team contractors in Indianapolis. He’s recorded 747 videos at the time of this writing, all of them uploaded in the time since Citize\n......", "posttime": "2020-07-22 02:21:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "货币化,police,公民", "title": "在考虑货币化并继续调整服务以解决缺陷之际，警察扫描应用Inside Citizen的使用率在BLM抗议活动中激增", "title_en": "Inside Citizen, a police scanner app whose usage has surged amid BLM protests, as it ponders monetization and continues to tweak its service to address flaws", "transed": 1, "url": "https://www.wired.com/story/citizen", "via": "", "real_tags": ["货币化", "police", "公民"]}, {"category": "", "categoryclass": "", "imagename": "3b02e117d8e484cb535c9c397a8671bb.jpeg", "infoid": 1013331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳到主要内容如果您从Verge链接购买内容，Vox Media可能会赚取佣金。请参阅我们的道德声明。\nOnePlus多年来一直在制造出色的耳塞，今天，该公司推出了它的第一对真正的无线耳机。售价79美元的OnePlus Buds拥有类似AirPod的坚硬设计，全是硬塑料-标志着子弹、Bullet Wireless 2和其他使用硅胶尖端的OnePlus耳塞的转变，这些耳塞使用硅胶尖端来实现密封的入耳适配性，这标志着子弹、子弹无线2和其他使用硅胶尖端的OnePlus耳塞有所不同。\n如果你想最大限度地利用OnePlus Buds，你需要一部OnePlus手机，所以这些设备对其他Android设备的用户来说真的不会有吸引力。你不会以这么低的价格获得无线充电或噪音消除等功能，但如果你发现自己羡慕苹果的AirPods，不喜欢入耳式耳塞的感觉，那么这里的价值因素是很难超越的。OnePlus Buds具有强大的电池续航能力、良好的音质和稳定的无线连接。它们在美国有白色和灰色两种颜色，蓝色/绿色组合是为国际市场预留的。我认为它看起来很像玩具，但这样大胆的颜色选择对一些人来说可能是一种新鲜空气。\n现实情况是，一加(OnePlus)称之为“半入耳”设计的“一刀切”方法总是会让一些人倒霉。我从来不喜欢普通AirPods在我耳朵里的感觉；它们不是特别稳定，尽管它们全天舒适而得到所有赞誉，但我的耳朵似乎不太适合它们。\n一加百货(OnePlus Buds)的表现也好不到哪里去。当我进入耳朵时，我发现当我坐着或四处走动时，它们都能很好地固定在适当的位置。但是如果我试着和他们一起跑，他们最终会被推开。我试穿的其他人告诉我，它们感觉就像AirPods一样舒适，穿着它们锻炼会毫不犹豫，所以这归结到你的耳朵形状上。\n对于更多的人来说，半入耳式耳塞通常更舒适，所以我们想让OnePlus Buds对更多的用户更友好，特别是那些正在寻找他们的第一款真正的无线耳机的用户。我们确实理解不同的人有不同的偏好，因此我们将继续听取用户对未来产品的反馈。我们的目标始终是在高质量的音质、快速充电、舒适性和合理的价格之间取得极大的平衡。\n和AirPods一样，OnePlus Buds的露天设计也会限制它们的音效潜力。你会听到你周围世界的很多声音，如果不把音量调到一个可能不舒服、可能不安全的水平，那是不可避免的。OnePlus表示，它调整了耳塞以增强低音，但如果没有耳内密封，结果仍达不到子弹无线2颈带耳塞或我们最顶级的真正无线耳塞的低端魅力。\n如果你能接受，他们产生的声音有一个令人愉快的宽广的音响舞台；菲比·布里奇斯(Phoebe Bridgers)的“格雷斯兰太”(Gracland Too)闪耀着充足的声学乐器与和声的分离。但其他曲目，如The Weeknd的经久不衰的“盲目之光”，如果没有完全密封，听起来就很空洞。OnePlus Buds可以随意全天收听，但如果你想要更强劲的低音和更好的隔音效果，你得多花点钱。OnePlus支持Buds的SBC和AAC编解码器；该公司内部使用了非高通芯片组，因此无法使用像APT-XHD这样的更高质量的编解码器。(无论如何，您都无法区分这种开放式耳机样式的编解码器之间的任何区别。)\n这起指控案件看起来像是Pixel Buds案件的一个压扁的、寮屋版本的案件。OnePlus声称，他们花了大约90天的时间来完善表壳的哑光纹理。我喜欢最终的结果，哑光总是胜过光泽-特别是在夏天的三伏天。注意了，三星。(不过，耳塞本身是有光泽的。)。Buds可以达到长达7小时的连续电池续航时间，而且外壳有足够的电量让你的总收听时间达到30小时左右。\n到目前为止，在我测试OnePlus Buds的过程中，我一直无法对两边的点击控件做太多操作。现在没有办法用耳塞暂停音乐；你所能做的就是双击跳到下一首歌，或者按住三秒钟在同步的设备之间切换。值得庆幸的是，更多的定制正在进行中：到7月底这些产品开始发货时，OnePlus将在其手机上推出软件更新，允许你选择双击时的首选操作，这样你就可以暂停、激活谷歌助手，或者返回到最后一首歌，而不是总是向前跳。令人有点奇怪的是，控件开箱即用如此有限--这就是为什么如果你有不同的Android手机，你应该避免使用OnePlus Buds的原因--但至少有一个修复方案即将到来。\n你不能否认它们看起来像AirPoish，但是OnePlus Buds得益于这些长茎。每个花蕾都有三个麦克风-顶部、中间和底部-并运行一些降噪算法，以帮助人们在通话中更清晰地听到你的声音。当我戴着OnePlus Buds时，所有我打电话的人都能听到我的声音，没有任何问题。该公司还吹捧在游戏/狂热模式下耳塞和OnePlus手机之间的极低延迟，这应该有助于它们跟上屏幕上的所有动作。\n它们没有无线充电，但OnePlus Buds尽管价格很低，但也有一些华而不实的东西：它们被评为IPX4防水级别，因此可以承受汗水和一些水花。当一个耳塞被移除时，它们会自动暂停音乐，而且它们还支持Android的快速配对功能，该功能将它们绑定到你的谷歌账户上，显示耳塞和耳壳的电池电量，并让你通过播放声音来找到放错位置的耳塞。不幸的是，你不能单独使用这两个耳塞中的任何一个进行音频或打电话，而且它们一次只能配对一个设备。\n我认为未来的OnePlus真正的无线耳塞将更加强调声音，设计更符合该公司的子弹系列。但对于OnePlus Buds，重点显然是试图为OnePlus客户推出更便宜的AirPods版本。79美元可以买到一副非常坚固的耳塞--如果合适的话。", "note_en": "Skip to main content                                                                                                                If you buy something from a Verge link, Vox Media may earn a commission. See our  ethics statement.\n    OnePlus has been making excellent earbuds for years now, and today, the company is introducing its first true wireless pair. The aggressively priced $79 OnePlus Buds have an AirPod-like rigid design that’s all hard plastic — marking a shift away from the Bullets, Bullets Wireless 2, and other OnePlus earbuds that used silicone tips for a sealed-off, in-ear fit.\n The OnePlus Buds require a OnePlus phone if you want to get the most from them, so these really won’t appeal to owners of other Android devices. You won’t get features like wireless charging or noise cancellation at a price this low, but if you’ve found yourself envious of Apple’s AirPods and don’t like how in-ear earbuds feel, it’s hard to beat the value factor here. The OnePlus Buds have strong battery life, decent sound, and a stable wireless connection. They’re available in white and gray in the US, with the divisive blue / green combo reserved for international markets. I think it looks very toy-like, but such a bold color option might be a breath of fresh air to some.\n  The reality is that a one-size-fits-most approach — OnePlus calls it a “half in-ear” design — is always going to leave some people out of luck. I’ve never enjoyed how regular AirPods feel in my ears; they’re not particularly stable, and for all the praise they receive for all-day comfort, my ears don’t seem well-suited for them.\n The OnePlus Buds haven’t fared much better. When in my ears, I found that they held in place just fine while I was seated or walking around. But if I tried to run with them, they’d eventually get jostled loose. Other people I let try them on told me that they felt just as snug as AirPods and they’d have no hesitation working out while wearing them, so this comes down to your ear shape.\n   Half in-ear buds are generally more comfortable for more people, so we wanted to make the OnePlus Buds more friendly for a wider range of users, especially users who are looking for their first truly wireless earphones. We do understand that different people have different preferences, so we will continue to listen to user feedback for future products. Our goal is always to provide a great balance between high-quality sound, fast charging, comfort, and a reasonable price.\n Like with AirPods, the open-air design of the OnePlus Buds will limit their sound potential. You’re going to hear a whole lot of the world around you, and there’s no avoiding that without cranking the volume to a potentially uncomfortable and possibly unsafe level. OnePlus says it tuned the earbuds to boost bass, but without an in-ear seal, the result still falls short of the low-end oomph you’ll hear from the  Bullets Wireless 2 neckband earbuds  or our top true wireless picks.\n If you can live with that, the sound they produce has a pleasantly wide soundstage; Phoebe Bridgers’ “Graceland Too” shines with ample separation for the acoustic instruments and harmonies. But other tracks like The Weeknd’s enduring “Blinding Lights” sound hollow without that full seal. The OnePlus Buds will do the job for casual, through-the-day listening but if you want more powerful bass and better noise isolation, you’ll have to spend a bit more money. OnePlus supports SBC and AAC codecs with the Buds; the company went with a non-Qualcomm chipset inside, so it couldn’t use higher-quality codecs like apt-X HD. (You’re not going to be able to tell any difference between codecs with this open style of earbud anyway.)\n  The charging case looks like a squished, squatter version of the Pixel Buds case. OnePlus claims it worked for around 90 days to perfect the case’s matte texture. I like the end result, and matte always wins over glossy — especially in the dog days of summer. Take note, Samsung. (The earbuds themselves are glossy, however.) The Buds can reach up to seven hours of continuous battery life, and the case has enough juice to get you to around 30 hours of total listening time.\n During my time testing the OnePlus Buds so far, I’ve been unable to do much with the tap controls on each side. There’s no way to pause music with the earbuds right now; all you can do is double-tap to skip to the next song or hold down for three seconds to switch between synced devices. More customization is on the way, thankfully: by the time these start shipping at the end of July, OnePlus will roll out a software update to its phones that will allow you to choose your preferred action for a double-tap so you can pause, activate Google Assistant, or go  back to the last song instead of always skipping forward. It’s a bit strange that the controls are so limited out of the box — and this is why you should avoid the OnePlus Buds if you’ve got a different Android phone — but at least a fix is coming.\n   You can’t deny their AirPodish looks, but the OnePlus Buds benefit from those long stems. Each bud has three mics — at the top, middle, and bottom — and runs some noise-reduction algorithms to help people hear you more clearly on calls. Everyone I called while wearing the OnePlus Buds was able to hear me without any issue. The company is also touting extremely low latency between the earbuds and OnePlus phones when in game / fanatic mode, which should help them keep up with all of the action on-screen.\n They lack wireless charging, but the OnePlus Buds do pack some frills despite the low price: they’re rated IPX4 water resistant, so they can withstand sweat and some splashes of water. They’ll automatically pause music when one earbud is removed, and they also support Android’s Fast Pair feature, which ties them to your Google account, shows battery levels for the buds and case, and lets you find a misplaced earbud by playing a sound. Unfortunately, you can’t use either of the earbuds standalone for audio or making calls, and they can only pair to one device at a time.\n  I think future OnePlus true wireless earbuds will put a bigger emphasis on sound and have a design more in line with the company’s Bullets series. But with the OnePlus Buds, the focus was clearly trying to come up with a cheaper version of AirPods for OnePlus customers. You’re getting a very solid set of earbuds for that $79 — if the fit is right.", "posttime": "2020-07-22 02:20:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "设计,手机,oneplus", "title": "OnePlus Buds评论：真正的无线，具有类似AirPod的刚性设计，超棒的电池续航时间，极具竞争力的79美元定价，但自定义控件仅适用于OnePlus手机", "title_en": "OnePlus Buds review: truly wireless with AirPod-like rigid design, great battery life, aggressive $79 pricing, but custom controls are for OnePlus phones only", "transed": 1, "url": "https://www.theverge.com/21331910/oneplus-buds-wireless-earbuds-review-price-design-sound?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["设计", "手机", "oneplus"]}, {"category": "", "categoryclass": "", "imagename": "de3bf5f21eea968f755af165b6eabbbe.jpg", "infoid": 1013330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一加正式发布了Nord，这是自2015年命运多舛的OnePlus X以来，该公司首次认真尝试中端手机。然而，尽管这款手机的起价仅为379 GB(约合480美元)，但这款手机在很大程度上与短短几个月前发布的699美元的OnePlus8有很多相似之处，这款手机与OnePlus8 Pro一起，是该公司今年的旗舰手机。\n它仍然拥有1080p OLED显示屏，90 Hz刷新率，Sub-6 GHz 5G，Warp Charge 30T快速充电，以及与OnePlus 8相同的4800万像素主摄像头传感器。这并不是说为了达到这个较低的价位，Nord没有做出让步，其中最重要的是Nord采用了速度较慢的骁龙765G处理器，但在其他许多情况下，妥协很小。\nNord有蓝色和灰色两种版本，8 GB内存和128 GB内存，适用于GB 379/欧元399，或12 GB RAM和256 GB内存，适用于GB 469/欧元499(约合594美元)。它将从8月4日开始在欧洲广泛销售，但一加计划今天早些时候通过自己的网站和7月31日约翰·刘易斯(John Lewis)的弹出式窗口销售部分手机。它目前只在欧洲和印度推出，尽管OnePlus表示计划在美国进行有限的测试版发布。您将不得不等到下周才能看到我们的全面评论，但现在这里是我对使用12 GB内存模型的初步印象。\n如果在中档手机中提供与OnePlus8类似的规格听起来像是抢了8的风头，那么你也不会完全错。事实上，OnePlus的联合创始人卡尔·贝(Carl Pei)告诉我，这几乎就是重点。尽管他表示，这两款手机的目标市场不同，但他不希望公司害怕与自己竞争。\n“这从来不是一种恐惧，因为我相信，如果你不是那个颠覆自己的人，那么市场上所有的竞争对手都会觉得可以随意颠覆你，”贝说。\n一部“打乱”自己阵容的手机是什么样子的？\n在很多方面，它看起来像一款功能大致相似的手机，只是规格稍低。诺德的屏幕就是一个很好的例子。它的刷新率仍然是90 Hz，仍然是OLED，仍然是1080p，但它也稍微小了一点，只有6.44英寸，而且它不像8那样绕着设备的边缘弯曲。这让手机感觉不那么溢价，但对日常使用的影响微乎其微。\n然后是它的后置摄像头。在OnePlus Nord的背面，你会发现四个后置摄像头，一个4800万像素的主摄像头，一个800万像素的超广角摄像头，一个200万像素的微距摄像头和一个500万像素的深度传感器。从技术上讲，这比OnePlus 8(没有专门的深度相机)多了一台相机，但重要的是，你真正用来拍照的相机拥有完全相同的4800万像素索尼IMX586传感器。与此同时，这款广角相机的分辨率只有OnePlus8的一半。\n然而，当谈到前置摄像头时，OnePlus实际上与Nord开创了新的天地。在这里，你会发现两个前置摄像头，包括一个具有105度视野的800万像素传感器超宽摄像头，以及一个更传统的3200万像素的自拍摄像头。在这里，你会看到两个前置摄像头，包括一个具有105度视野的800万像素传感器超宽摄像头，以及一个更传统的3200万像素自拍摄像头。这意味着屏幕的打孔切口要大一倍，但如果你想和一群朋友自拍，或者只是想要融入更多的环境，这是一个有用的功能。\n一个很大的问题，也是一个很难单凭规格来回答的问题是，功能较弱的Nord骁龙765G将对其相机性能产生什么样的影响。很早以前就很清楚，当涉及到图像质量时，软件处理几乎和硬件一样重要，这意味着我们仍然可以看到8和Nord之间的图像质量差异，尽管Nord的传感器相似。\n如果使用速度较慢的处理器还有其他显著的缺点，那么我还没有在日常使用中感受到它们。应用程序打开得很快，对使用感觉很灵敏，甚至在一个更密集的3D游戏“天空：光明的孩子”(Sky：Child of the Light)中花了很短的时间，也没有发现任何严重的性能问题。\n事实上，贝说，正是这样的中端处理器的质量让OnePlus有信心从一开始就尝试制造Nord。“我们直到现在才开始冒险，因为我们觉得这项技术还没有真正准备好提供良好的体验，”贝告诉我。现在我们终于感觉到技术，特别是处理器，已经成熟到我们可以提供消费者已经与一加联系在一起的体验的水平：[一]中端封装的快速和流畅的体验。“。\nNord的90 Hz屏幕可能在很大程度上归功于这款手机的使用感觉如此流畅。这是一个在这个价位上几乎闻所未闻的功能，与大多数手机上仍然常见的60 Hz面板相比，它提供了一个显着的改进。OnePlus对高刷新率面板并不陌生，但很高兴看到这一点出现在中端设备上，尽管许多其他制造商现在才将其引入旗舰设备。\nNord的6.44英寸屏幕不仅使用起来很流畅，而且给人的感觉也非常大。我问贝，公司是否考虑过制造一款屏幕更小的手机，但他说这样的权衡是不值得的。他告诉我，拥有更大的显示屏不仅对内容消费很重要，而且对电池寿命也很重要。\n“如果你缩小手机的尺寸，你必须首先在电池续航时间上做出妥协，”贝说，“如果把它变得更小，就会在某种程度上倾斜平衡，这对整体用户体验来说并不是最优的。”\n在这一点上，很难与贝有太多不同意见。OnePlus Nord拥有非常不错的4115mAh电池，仅比8的4300mAh电池小一点点。由于骁龙765G的集成型号，它也不需要单独为调制解调器供电，而高通今年的旗舰处理器必须与单独的调制解调器一起使用。", "note_en": "OnePlus has officially announced the Nord, its first serious attempt at a midrange handset since 2015’s  ill-fated OnePlus X. Yet, despite the fact that it starts at just £379 (around $480), the phone shares a lot of the DNA of the $699 OnePlus 8 released just a few short months ago, which, along with the OnePlus 8 Pro, was the company’s flagship handset for this year.\n It’s still got a 1080p OLED display with a 90Hz refresh rate, Sub-6GHz 5G, Warp Charge 30T fast charging, and the same 48-megapixel main camera sensor as the OnePlus 8. That’s not to say there haven’t been concessions made to reach this lower price point, the most important of which is that the Nord is powered by a slower Snapdragon 765G processor, but in a lot of other cases the compromises are small.\n The Nord will be available in both blue and gray with 8GB of RAM and 128GB of internal storage for £379 / €399 or with 12GB of RAM and 256GB of storage for £469 / €499 (around $594). It’ll be widely available starting August 4th in Europe, but OnePlus plans to sell some of the handsets early today via its own website and at a John Lewis pop-up on July 31st. It’s only coming to Europe and India for now, although OnePlus says it has plans for a limited beta launch in the US. You’ll have to wait until next week for our full review, but for now here are my initial impressions based on using the 12GB RAM model.\n   If offering similar specs to the OnePlus 8 in a midrange phone sounds like a recipe for stealing some of the 8’s thunder, then you wouldn’t be entirely wrong. In fact, OnePlus co-founder Carl Pei told me that’s almost the point. Although he says the two phones are targeting different markets, he doesn’t want the company to be afraid of competing with itself.\n “It’s never been a fear because I believe that if you’re not the one disrupting yourself then all your competitors on the market will feel free to disrupt you,” Pei says.\n What does a phone that’s “disrupting” its own lineup look like?\n In a lot of respects, it looks like a handset with broadly similar features, just offered with slightly lower specs. The Nord’s screen is a great example. It’s still got a 90Hz refresh rate, it’s still OLED, and it’s still 1080p, but it’s also a little bit smaller at 6.44-inches and it doesn’t curve round the edges of the device like the 8’s did. That makes the phone feel a little less premium, but the impact on day-to-day usage is minimal.\n   Then there are its rear cameras. On the back of the OnePlus Nord, you’ll find four rear cameras, a 48-megapixel main camera, an 8-megapixel ultrawide-angle camera, a 2-megapixel macro camera, and a 5-megapixel depth sensor. That’s technically one more camera than the OnePlus 8 (which lacked a dedicated depth camera), but the important thing is that the camera you’ll actually use to take your photos has exactly the same 48-megapixel Sony IMX586 sensor. The compromise, meanwhile, comes with the wide-angle camera, which has half the resolution of the OnePlus 8’s.\n When it comes to the front-facing camera, however, OnePlus is actually breaking new ground with the Nord. Here you’ll find two front-facing cameras, including an 8-megapixel sensor ultrawide camera with a 105-degree field of view, as well as a more traditional 32-megapixel selfie camera. It means the screen’s hole-punch cutout is twice as big, but it’s a useful feature if you’re trying to take a selfie with a group of friends or just want to include more of your environment.\n The big question, and one that’s hard to answer based on specs alone, is what sort of impact the Nord’s less powerful Snapdragon 765G will have on its camera performance. It’s long been clear that software processing is almost as important as hardware when it comes to picture quality, meaning we could still see a difference in picture quality between the 8 and the Nord, despite the Nord’s similar sensors.\n  If there are any other significant downsides to having a slower processor, then I’m yet to feel them in day-to-day use. Apps open quickly and feel responsive to use, and even spending a brief time in a more intensive 3D title,  Sky: Children of the Light, didn’t reveal any serious performance hiccups.\n In fact, Pei says it was the quality of midrange processors like this that gave OnePlus the confidence to attempt making the Nord in the first place. “We didn’t take the plunge until now because we felt like the technology wasn’t really ready to deliver a good experience,” Pei tells me. “Now we finally feel like technology, especially the processor, has matured to the level where we can deliver the same experience that consumers have come to associate with OnePlus: [a] fast and smooth experience in a midrange package.”\n The Nord’s 90Hz screen can probably take credit for a lot of how smooth the phone feels to use. It’s a feature that’s virtually unheard of at this price point and it offers a marked improvement over the 60Hz panels that are still common on most phones. OnePlus is no stranger to high-refresh rate panels, but it’s great to see this come to a midrange device, even as many other manufacturers are only now bringing them to their flagship devices.\n As well as feeling smooth to use, the Nord’s 6.44-inch screen also feels very big. I asked Pei whether the company had ever considered making a phone with a smaller screen, but he said the trade-offs aren’t worth it. Not only is having a bigger display important for content consumption, he told me, but it’s also important for battery life.\n “If you reduce the size of the phone, the first thing that you have to compromise on is the battery life,” Pei said, “Making it even smaller would kind of tilt the balance in a way that’s not optimal for the overall user experience.”\n  It’s hard to disagree too much with Pei here. The OnePlus Nord includes a very respectable 4,115mAh battery, which is only a hair smaller than the 4,300mAh battery in the 8. It also won’t have to power a separate modem thanks to the integrated model in the Snapdragon 765G, while Qualcomm’s flagship processors this year have to be used with separate modems.\n If these differences sound minor to you, then I really wouldn’t blame you. But look at the OnePlus 8 and the Nord side by side and, yes, it’s easy to tell which of the two is the more premium device. The 8 has the curved display, while the Nord’s is flat, and the rear of the Nord is a little cheaper and more plastic-feeling in comparison.\n On first impressions, however, the Nord doesn’t feel that different in day-to-day use. It still feels quick and responsive, its camera specs are in a similar ballpark, and it’s not missing out on any features that weren’t already missing from the OnePlus 8 like wireless charging and an IP rating (you had to jump up to the OnePlus 8 Pro for both).\n The result is a really interesting device that, on paper at least, ticks a lot of the boxes for what you’d like to see in a modern smartphone, regardless of whether it’s technically a midrange or a flagship. That’s especially interesting in the context of the recently released OnePlus 8, of which the Nord is definitely nipping at the heels. Whether the Nord manages to deliver on them in practice will be a matter for our full review.\n  Correction:  This specs sidebar in this post originally said the Nord has fast “wireless” charging using the Warp Charge 30T standard, when it should have read fast “wired” charging. We regret the error.", "posttime": "2020-07-22 02:19:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "5g,手机,摄像头,main", "title": "OnePlus表示，其399欧元的Nord智能手机将在欧洲和印度推出，配备90 Hz 1080p OLED显示屏，双自拍摄像头，Sub6 GHz 5G，4800万像素主摄像头", "title_en": "OnePlus says its €399 Nord smartphone will launch in Europe and India with a 90Hz 1080p OLED display, dual selfie cameras, Sub-6GHz 5G, 48-megapixel main camera", "transed": 1, "url": "https://www.theverge.com/2020/7/21/21331537/oneplus-nord-release-date-specs-features-cameras-quad-sensors-90hz?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["5g", "手机", "摄像头", "main"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013328, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "烘焙酸面团，狂欢观看普通人或美国夫人，学习折纸。人们已经以多种方式处理过禁闭问题。就我个人而言，我去寻找德国艺术家汉斯·霍尔宾(Hans Holbein)的遗骨，他在近500年前去世，被扔进了伦敦市一个没有标记的坟墓里。或者说，人们一直是这么认为的。\n在封锁期间被冠状病毒清空了，这座城市是进行社交距离和政府强制步行的完美场所。在它的街道下面是无数瘟疫受害者的身体。有一件事尤其让我难以忘怀。霍尔拜因于1543年在伦敦去世，几乎可以肯定是死于鼠疫。黑死病的长长阴影弥漫在他的艺术中，身体和骷髅令人毛骨悚然。在大流行的时候寻找这位瘟疫大师似乎是合适的。\n霍尔宾是文艺复兴时期的明星。他出生于德国南部的奥格斯堡，在瑞士城市巴塞尔声名鹊起，后来作为“乌托邦”的作者、亨利八世的财政大臣托马斯·莫尔(Thomas More)的客人进入英国。后来，他将赞助人转向托马斯·克伦威尔(Thomas Cromwell)，如今，由于希拉里·曼特尔(Hilary Mantel)的“狼厅”三部曲的最后一部“镜子与光”(The Mirror And The Light)，他在阳光下享有一席之地。霍尔拜因画肖像画赚了一小笔钱，最终成为了一名宫廷艺术家。亨利派他去画克里夫斯的安妮，帮助君主决定是否娶她为第四任妻子。然后，在46岁时，霍尔拜因在伦敦去世，似乎被埋葬在一个没有标记的坟墓里。\n很少有画家能与他对活人的眼光相提并论，但更仔细地观察他的作品，你会发现令人震惊的警告，死亡永远在你的肩上。在伦敦国家美术馆的大使们中，两个富人站在他们的壮年时期，穿着奢华的皮草，周围环绕着科学和文化的象征，从地球仪到琵琶。在奢华的绿色窗帘的衬托下，一切都以完美的、发光的细节呈现出来。\n但有些东西切开了这幅画的下半部分，直接穿过了他们梦寐以求的世界：黑白的污点像流行病一样引人注目地打断了场景。当从正确的角度观察时，细长的模糊显示出自己是一个人的头骨-死亡不可避免的存在。\n为了将这一点牢牢抓住，霍尔拜因创作了一系列名为死亡之舞的木刻作品，在这些木刻作品中，骷髅收割者在人们统治、恋爱或耕作的过程中打断他们。更重要的是，他还把基督描绘成一具腐烂的身体。坟墓中死去的基督的身体甚至没有复活的迹象-这只是一个死者，他的脸变白了，脚染上了绿色。当陀思妥耶夫斯基在巴塞尔看到它时，他惊呆了。“哎呀，一个人的信仰可能会因为看着那幅画而被毁掉！”他在“白痴”里有个角色说。\n在多次描绘死亡之后，霍尔拜因发现自己身处瘟疫肆虐的伦敦。根据他17世纪的传记作家卡雷尔·范曼德(Karel Van Mander)的说法，在他死于瘟疫的几周前，他立下了一份遗嘱，要供养他在英国的两个私生子。他的骨头的确切位置不得而知，所以在封锁过程中，我决定回去看看还有什么线索。\n我的搜寻始于奥尔德盖特地铁站，那里安静得像坟墓，没有通勤者。它可能确实标志着一个集体坟墓：维多利亚时代的工人在这里挖掘隧道时，据说他们撞到了一堵人骨墙。据说这里是1665年大瘟疫期间最大的墓穴所在地。在“瘟疫年日记”中，丹尼尔·笛福描述了马车如何将身体扔进“人类共同的坟墓”。\n奥尔盖特是霍尔宾居住的地方。他甚至可能喝了奥尔德盖特泵的水，自中世纪以来，奥尔盖特泵一直是淡水的来源。19世纪初，水泵的水开始致人死亡。这可以追溯到这样一个事实，即它的供应流经挤满了细菌遍地的身体的墓地下面。在这个充斥着城市死亡提醒的地区，这是另一个令人毛骨悚然的细节。我在圣奥莱夫大教堂附近发现的一个教堂墓地的大门上刻着可怕的头骨。查尔斯·狄更斯给它起了个绰号叫“可怕的严酷”。这附近的教堂里有那么多的头骨，实际上，它们开始感觉像是线索。\n霍尔拜因时代疾病盛行。平均预期寿命约为35岁，所以他到了40多岁还不错。活得好就是为死亡做准备。让·德·丁特维尔在“大使”中出现，他的帽子上戴着骷髅徽章。霍尔拜因表现出了与他在奥尔盖特家中立下遗嘱类似的接受：他不会像“死亡之舞”中的国王那样感到惊讶--当他被骷髅侍者宴请时，他会被打断。在这幅令人毛骨悚然的木刻中，来自各行各业的34个灵魂遭遇了可怕的结局。\n圣凯瑟琳·克里(St Katharine Cree)是奥尔德盖特教堂中声称拥有这位艺术家的人之一，她是一位古老的哥特式幸存者，现在被劳埃德大厦的管道和漏斗所笼罩。它挺过了大火和闪电战，似乎是霍尔宾安息之地的一个很好的候选者。但是，当热爱艺术的阿伦德尔伯爵想要在这里为17世纪的霍尔拜恩竖起纪念碑时，却找不到坟墓的踪迹。我们断定，这位艺术家一定是在某个瘟疫坑里。\n因此，17世纪的人们从没有墓碑或纪念碑的情况下推断，霍尔拜因一定是瘟疫的匿名受害者之一。还能有其他解释吗？\n也许他碰上了一个怪兽之王。到了1543年，杀害妻子的连环杀手亨利八世对他的宫廷艺术家不太满意。在亨利还没有见到她之前，霍尔拜因就被派去描绘潜在的第四任妻子，克里夫斯的安妮。霍尔拜因带着一幅如此可爱的油画回来，亨利让音乐家演奏来庆祝。当安妮亲自到达时，他声称发现她太丑了，不能和她上床。不过，没有霍尔宾受到惩罚的记录。他可能得救于都铎王朝时期英国艺术家的低地位。在意大利，他们可能是神，但在这里，他们只是体力劳动者。霍尔宾就在亨利的雷达下。废除他就像一个厨师因为做了不合格的馅饼而被杀一样。\n不过，我在支撑加农街大桥的巨型大梁下发现了另一种可能性。英国过去的一部分在这里消失了。在文艺复兴时期，这是一个德国汉萨同盟商人的社区。霍尔宾通过描绘他们赚了很多钱。虽然我们珍视他的英国宫廷照片，但他在这里创作的但泽商人格奥尔格·吉泽的伟大油画是柏林宝石城的一大亮点。\n这是我想找到霍尔宾坟墓的另一个原因。英国已经离开欧盟，我们假装我们一直是一个文化孤岛，坐落在银海中。霍尔宾证明了并非如此。这位最伟大的“英国”文艺复兴艺术家是一个失落的伦敦-德国社区的一部分。这可能是他的坟墓不为人所知的原因。在都铎王朝的英国，外国人被称为“陌生人”。霍尔拜因的朋友莫尔公开呼吁结束一场针对他们的致命骚乱，这场骚乱被称为邪恶的五月节。霍尔拜因被扔进坑里，不仅仅是因为他是瘟疫受害者，还因为他是一个“陌生人”？\n霍尔贝恩肯定值得一个邓克马尔(Denkmal)-一个思考事情的地方，正如德语中纪念碑(来自Denken，to Think)的美丽含义所暗示的那样。但你在哪里能想到被扔进乱葬坑的人呢？于是我和我的家人来到了圣安德鲁地下教堂，这是霍尔拜因的教区教堂。它也幸存了下来，不再躲在五月柱下，而是藏在小黄瓜下面，它是以五月柱命名的。\n教堂后面是它的旧墓地的遗迹。如果城市中心的这个小空间里有霍尔宾的坟墓，那将是很有诗意的-因为它确实是一个令人愉快的思考之地。午后的阳光下，一个白色的东西在小院的深色土壤的映衬下显得格外醒目。这是一块下巴的碎片，在牙齿曾经的地方有几个洞。它看起来很不舒服，像人一样。但我很快意识到，几乎如释重负地意识到，它太小了。周围也散落着其他的骨头。也许它们是一个地面粗糙的肥料包的一部分，或者是由食腐动物挖出的遗迹的一部分。\n我没有找到霍尔拜恩的遗体，但感觉确实像是他发来的信息。我去寻找有史以来最勤奋的骨头画家之一--而我们就在这里，在这座瘟疫肆虐的城市里沉思着骨头。他们在霍尔宾的坟墓上做记号了吗？当然不是。但他们把我带回了他的艺术，以及感觉像是解决这个谜团的东西。\n骷髅，骷髅，死去的基督--也许霍尔拜因让自己被扔进一个普通的坟墓，作为他最后的艺术姿态。毕竟，在他的遗嘱中，他本可以留下钱用于葬礼和坟墓，就像列奥纳多·达·芬奇在法国所做的那样。如果不这样做，他知道他是在冒着共同的风险。如果这真的是他的命运，那么他是在大胆地拥抱他的艺术洞察力。从国王到牧师，从律师到农民，从女修道院院长到艺术家，我们最终都是一样的：就像那部宏伟的、令人难以忘怀的杰作“死亡之舞”中的34个迷失的灵魂一样被抢走了。", "note_en": "Baking  sourdough, binge-watching  Normal People or  Mrs America, learning origami. People have dealt with lockdown in many ways. Personally, I went looking for the bones of  Hans Holbein, the German artist who died almost 500 years ago and was dumped in an unmarked grave in the City of London. Or so it has always been believed.\n Emptied out by coronavirus during lockdown, the City was the perfect place for socially distanced, government-mandated walks. And beneath its streets are the bodies of innumerable plague victims. One in particular haunts me. Holbein died in  London, almost certainly of plague, in 1543. The long shadow of bubonic plague permeates his art, in its danse macabre of corpses and skeletons. It seemed appropriate to seek out this master of pestilence in a time of pandemic.\n Holbein was a Renaissance star. Born in Augsburg, southern Germany, he made a name for himself in the Swiss city of Basel before blazing his way into Britain as a guest of  Thomas More, author of Utopia and chancellor to Henry VIII. Later he switched patron to Thomas Cromwell, now enjoying a place in the sun thanks to  The Mirror and the Light, the last of Hilary Mantel’s Wolf Hall trilogy. Holbein made a small fortune painting portraits, ending up as a court artist. Henry sent him to paint Anne of Cleves, to help the monarch decide whether to make her his fourth wife. Then, at the age of 46, Holbein died in London and was buried, it seems, in an unmarked grave.\n  Few painters have matched his eye for living people, but look harder at his work and you see startling warnings that death is ever at your shoulder. In  The Ambassadors, in London’s National Gallery, two wealthy men stand in the prime of their lives, dressed in opulent furs and surrounded by symbols of science and culture, from a globe to a lute. It is all rendered in perfect, glowing detail against a sumptuous green curtain.\n But something cuts across the lower half of the painting and right through their covetable world: a black-and-white smear that interrupts the scene as strikingly as a pandemic. When looked at from the correct angle, the long, thin blur reveals itself to be a human skull – the inescapable presence of death.\n To ram the point home, Holbein created a series of woodcuts called  The Dance of Death, in which the skeletal reaper interrupts people while they are in the middle of ruling, loving or ploughing. To bang in the final nail, he also painted Christ as a rotting corpse. And The Body of the Dead Christ in the Tomb does not even hint at resurrection – it is simply a deceased man whose face is turning grey and feet are tinged with green. When Dostoevsky saw it in Basel, he was transfixed. “Why, a man’s faith might be ruined by looking at that picture!” he has a character say in The Idiot.\n  Having portrayed death so many times, Holbein found himself in a London struck by plague. A few weeks before he died from plague, according to his 17th-century biographer Karel van Mander, he made a will to provide for his two illegitimate children in England. The exact location of his bones is unknown, so midway through lockdown I decided to go looking back over what clues still remain.\n My search began at Aldgate underground station, quiet as a grave without its commuters. And it may indeed mark a mass grave: when Victorian workers were tunnelling here, it’s said they hit a wall of human bones. This was reputedly the site of the biggest burial pit during  the  great  plague of 1665. In  A Journal of the Plague Year, Daniel Defoe describes how carts dumped bodies into its “common grave of mankind”.\n  Aldgate was where Holbein lived. He may even have drunk from the Aldgate pump, which has been a source of fresh water since the middle ages. In the early 19th century, the pump’s water started killing people. This was traced to the fact that its supply flowed under cemeteries crammed with bacteria-ridden corpses. It is another macabre detail in an area dense with reminders of urban mortality. The gate of one nearby churchyard I found, at St Olave’s, has grisly skulls carved over it. Charles Dickens nicknamed it St Ghastly Grim. There are so many skulls on churches hereabouts, actually, they started to feel like clues.\n Disease was rife in Holbein’s time. Average life expectancy was about 35, so he did all right to reach his 40s. To live well was to prepare for death. Jean de Dinteville, seen in The Ambassadors, wears a skull badge on his cap. Holbein showed similar acceptance as he had made his will at his Aldgate house: he wasn’t going to be surprised, like the King in The Dance of Death – interrupted as he feasts by a skeleton waiter. In this horrifying woodcut, 34 souls from all walks of life meet a grisly end.\n  St Katharine Cree, one of the Aldgate churches with a claim on the artist, is an ancient gothic survivor, now overshadowed by the tubes and funnels of the Lloyd’s building. It made it through  the  great  fire and the blitz and seemed a good candidate for Holbein’s resting place. But when the art-loving Earl of Arundel wanted to put up a monument to Holbein here in the 17th century, no trace of a grave could be found. The artist, it was concluded, must be in a plague pit somewhere.\n So people in the 17th century deduced from the very absence of a gravestone or monument that Holbein must have been one of plague’s anonymous victims. Can there be any other explanation?\n Perhaps he fell foul of a monster king. By 1543, Henry VIII, serial killer of wives, was not best pleased with his court artist. Sent to portray a potential fourth wife, Anne of Cleves, before Henry ever saw her, Holbein came back with such a lovely painting that Henry had musicians play to celebrate. When Anne arrived in person, he claimed to find her too ugly to sleep with. There’s no record of Holbein being punished, though. He was probably saved by the low status of artists in Tudor Britain. In Italy, they might be gods but here they were just manual workers. Holbein was underneath Henry’s radar. Doing away with him would be like having a cook killed for making a substandard pie.\n  I found another possibility, though, under the massive girders that support Cannon Street Bridge. A piece of Britain’s past has gone missing here. In the Renaissance, this was the Steelyard, a community of German Hanseatic League merchants. Holbein made much of his money portraying them. While we treasure his pictures of the English court, his great painting of the Danzig merchant Georg Gisze, produced here, is a highlight of Berlin’s Gemäldegalerie.\n So here is another reason I wanted to find Holbein’s grave. The UK has left the EU and we pretend we have always been a cultural island, set in a silver sea. Holbein proves otherwise. The greatest “British” Renaissance artist was part of a lost London-German community. This may be why his grave is unknown. In Tudor Britain, foreigners were called “strangers”. Holbein’s friend More spoke out to end a murderous riot against them known as Evil May Day. Was Holbein thrown into a pit not only because he was a plague victim, but also for being a “stranger”?\n Holbein surely deserves a  Denkmal – a place to think things over, as the German word for monument (from  denken, to think) beautifully suggests. But where can you think about someone who was thrown in a mass grave? And so my family and I came to St Andrew Undershaft, Holbein’s parish church. It too survives, no longer skulking under the maypole shaft it was named after but beneath the Gherkin.\n Behind the church are the remnants of its old burial ground. It would be poetic if this little space in the heart of the City harboured Holbein’s grave – because it does make a pleasant spot to think. In the afternoon sunlight, something white stood out against dark soil of the small yard. It was a piece of a jaw, with holes where the teeth once were. It looked uncomfortably human. But I quickly realised, almost with relief, that it was too small. There were other bones scattered around, too. Perhaps they were part of a badly ground fertiliser pack, or relics dug up by scavenging animals.\n  I had not found the remains of Holbein, but it did feel like a message from him. I had gone looking for one of the most assiduous painters of bones ever – and here we were, pondering bones in the plague-stopped city. Did they mark Holbein’s grave? Surely not. But they pointed me back to his art, and to what felt like a solution to this mystery.\n The skull, the skeletons, the dead Christ – maybe Holbein let himself be thrown in a common grave as his final artistic gesture. After all, in his will he could have left money for a funeral and tomb, as Leonardo da Vinci did in France. By not doing that, he knew he risked the common pit. If this truly was his fate, then he was boldly embracing the insight of his art. From the king to the priest, from the lawyer to the peasant, from the abbess to the artist, we all end up the same in the end: snatched out of existence like the 34 lost souls in that magnificent, haunting masterpiece, The Dance of Death.", "posttime": "2020-07-22 02:18:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "霍尔,hans,死亡", "title": "汉斯·霍尔宾的尸骨在哪里？", "title_en": "Where are the bones of Hans Holbein?", "transed": 1, "url": "https://www.theguardian.com/artanddesign/2020/jul/16/bones-hans-holbein-lockdown-arts-grisliest-mystery-plague-london-renaissance", "via": "", "real_tags": ["霍尔", "hans", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "60ecc2189783e2f706160bbc90bde5d0.jpeg", "infoid": 1013327, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "优步(Uber)正在与英国一项裁决进行斗争，该裁决要求优步司机在英国最高法院被归类为工人。\n周二，这家拼车巨头将在最高法院为期两天的听证会上开始最后一搏，试图对这起具有里程碑意义的就业权利案提出上诉。\n这场法律战始于2016年，当时就业法庭做出了有利于亚辛·阿斯拉姆(Yaseen Aslam)和詹姆斯·法勒(James Farrar)领导的一群优步司机的裁决。索赔人希望司机被视为有权享受最低工资和假日工资等就业保护的工人。\n英国的每个下级法院-最近的英国上诉法院-都站在了司机一边。\n优步的另一次亏损可能会危及该公司的商业模式。优步坚持认为，其司机应该被视为个体户-类似于有多少私人出租司机被归类-而不是员工。\n优步北欧和东欧地区总经理杰米·海伍德(Jamie Heywood)表示：绝大多数司机都希望独立工作，多年来，我们对我们的应用程序进行了重大修改，以提供完全灵活的更多好处。\n司机可以决定是否、何时何地开车，但也可以享受免费的AXA保险，包括疾病或伤害，以及产假和陪产假。\n首席申索人阿斯拉姆同时也是App司机和快递员工会(ADCU)的主席，他表示，损失将导致工会的监管机构撤销ADCU的上市，因为法律要求工会必须完全或主要由工人组成。\n这是我们与优步的最后一次摊牌，但对每个人来说，赌注都不能再高了，阿斯拉姆说。如果优步获胜，贪婪的雇主将不合时宜地急于削减我们所知的就业率，并将整个经济优步化为优步(Uber)。\n优步司机和其他零工经济工人将被剥夺成立工会的权利。\n如果优步败诉，此案可能会对零工经济产生重大影响。零工经济模式鼓励灵活的工作安排，但因将工人置于不稳定的就业状况而受到批评，特别是在冠状病毒大流行期间。该领域的其他公司包括Deliveroo和Airbnb。\n法勒和阿斯拉姆的代表律师是伦敦贝茨·威尔斯律师事务所(Bates Wells)的律师保罗·詹宁斯(Paul Jennings)和蕾切尔·马蒂森(Rachel Mathieson)。\n贝茨·威尔斯(Bates Wells)就业团队的同事马蒂森(Mathieson)表示，这起里程碑式的案件将对增长最快的经济部门的工人受到多好或多糟糕的待遇产生巨大影响。\n在我们面临经济不确定性的时候，工人得到法律规定的基本保护比以往任何时候都更加重要。优步司机理应得到他们与优步的关系赋予他们的最低工资。\n优步在英国总共有6万名司机。去年，英国的零工人数为470万人。\n优步在英国的法律诉讼增加了该公司面临的国内和国际压力。去年，优步再次被禁止在伦敦运营-尽管优步可以在上诉期间继续运营。\n与此同时，加州今年出台了一项名为AB5的法律，将优步和Lyft司机归类为工人。优步、Lyft和其他零工公司反对这项法律，然而，市政府官员正在寻求禁制令，迫使他们遵守这项法律。\n由于冠状病毒大流行，周二和周三的最高法院听证会将以在线形式举行，这是一个时代的迹象。预计法院在几个月内不会做出裁决。", "note_en": "Uber is taking its fight against a U.K. ruling that its drivers should be classified as workers to the country&#39;s highest court.\n The ride-sharing giant will kick off a last-ditch attempt to appeal the  landmark employment rights case in a two-day hearing at the Supreme Court on Tuesday.\n  The legal battle began back in 2016 when an employment tribunal ruled in favor of a group of Uber drivers led by Yaseen Aslam and James Farrar. The claimants want drivers to be treated as workers entitled to employment protections such as a minimum wage and holiday pay.\n Each of the country&#39;s lower courts — most recently the  U.K.&#39;s Court of Appeal — have sided with the drivers in the case.\n Another loss for Uber would threaten to jeopardize the company&#39;s business model. Uber maintains that its drivers should be treated as self-employed — similar to how many private hire drivers are classified — rather than employees.\n &#34;The vast majority of drivers want to work independently, and over a number of years we&#39;ve made significant changes to our app to offer more benefits with total flexibility,&#34; said Jamie Heywood, Uber&#39;s regional general manager for Northern and Eastern Europe.\n  &#34;Drivers can determine if, when and where they drive, but can also access free AXA insurance to cover sickness or injury, as well as maternity and paternity payments.&#34;\n  Lead claimant Aslam, who is also president of the App Drivers &amp; Couriers Union (ADCU), said a loss would result in the trade union&#39;s regulator revoking the ADCU&#39;s listing, since a union is required by law to be made up &#34;wholly or mainly of workers.&#34;\n &#34;This is our final showdown with Uber but the stakes could not be higher for everyone,&#34; said Aslam. &#34;If Uber wins, there will be an unseemly rush by greedy employers to collapse employment as we know it and Uber-ize the entire economy.&#34;\n &#34;Uber drivers and other gig economy workers would be robbed of the right to unionize.&#34;\n  The case could have significant ramifications for the gig economy if Uber loses. The gig economy model encourages flexible work arrangements but has been criticized for putting workers in precarious employment situations, especially during the coronavirus pandemic. Other companies in the space include Deliveroo and Airbnb.\n Farrar and Aslam are being represented by solicitors Paul Jennings and Rachel Mathieson of London-based law firm Bates Wells.\n  &#34;This landmark case will have enormous implications for how well, or badly, workers in the fastest growing sector of the economy are treated,&#34; said Mathieson, an associate of Bates Wells&#39; employment team.\n &#34;At a time when we face economic uncertainty, it is more important than ever that workers receive the basic protections that the law provides for. Uber drivers deserve the minimum wage that their relationship with Uber entitles them to.&#34;\n Uber has a total of 60,000 drivers in the U.K. Last year, the  number of gig workers in the country stood at 4.7 million.\n Uber&#39;s U.K. legal battle adds to domestic and international pressures facing the firm. It was again  banned from operating in London last year — though Uber can continue operating while it appeals the decision.\n Meanwhile, California introduced a  law known as AB5 this year, which classifies Uber and  Lyft drivers as workers. Uber, Lyft and other gig companies have opposed the law, however city officials are seeking an injunction to force them to comply.\n In a sign of the times, the Supreme Court hearing on Tuesday and Wednesday is being held in an online format due to the coronavirus pandemic. The court is not expected to reach a decision for some months.", "posttime": "2020-07-22 02:18:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "启动,kicks,优步", "title": "优步启动对英国主要司机就业权裁决的最终上诉", "title_en": "Uber kicks off final appeal against major UK ruling on drivers employment rights", "transed": 1, "url": "https://www.cnbc.com/2020/07/21/uber-appeals-against-uk-employment-rights-ruling-in-supreme-court.html", "via": "", "real_tags": ["启动", "kicks", "优步"]}, {"category": "", "categoryclass": "", "imagename": "731a6eeb1078e5ce307de276388b33a7.jpeg", "infoid": 1013325, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为什么有这么多机器学习技术？问题是不同的算法可以解决不同的问题。您获得的结果直接取决于您选择的模型。这就是为什么知道如何将机器学习算法与特定问题相匹配是如此重要的原因。\n在这篇文章中，我们将讨论这一点。我们开始吧。\n首先，要为您的项目选择算法，您需要知道存在哪些类型的算法。让我们复习一下你的不同分类知识。\n在监督学习的情况下，机器需要一位教育它们的老师。在这种情况下，机器学习专家收集一组数据并对其进行标记。然后，他们需要将训练集和规则传递给机器。下一步是观察机器是如何处理测试数据的。如果有一些错误，程序员会纠正它们，并重复该操作，直到算法准确工作。\n这种类型的机器学习不需要教育者。计算机被给予一组未标记的数据。它应该自己找到模式并提出洞察力。人们还可以通过提供一组带标签的训练数据来稍微引导机器沿着这个过程进行。在这种情况下，它被称为半监督学习。\n强化学习发生在计算机需要操作的环境中。环境扮演着老师的角色，为机器提供积极或消极的反馈，这就是所谓的强化。\n另一种将技术分组的方法是基于它们解决的问题。\n在本节中，我们将讨论分类、回归、优化和其他算法组。我们还将看看它们在行业中的使用情况。我们之前也写过关于机器学习算法分类的文章。\n以下是最流行的ML算法。有时他们属于不止一个小组，因为他们能有效地解决不止一个问题。\n分类帮助我们处理广泛的问题。它可以让我们做出更明智的决定，分类垃圾邮件，预测借款人是否会归还贷款，或者在Facebook图片中标记朋友。\n这些算法预测离散变量标签。离散变量具有可计数的可能值，并且可以分类。预测的准确性取决于您选择的模型。\n想象一下，你开发了一种算法，可以预测一个人是否患有癌症。在这种情况下，您选择的模型在预测结果时应该非常精确。\n有时候你需要把东西分成几个类别，但是你不知道这些类别是什么。分类使用预定义的类来指定给对象。\n另一方面，群集允许您识别对象之间的相似性，并根据它们的共同特征对它们进行分组。这是检测欺诈、分析文档、对客户端进行分组等操作背后的机制。聚类在销售和市场营销中被广泛应用于客户细分和个性化交流。\nK-NN、k-Means聚类、决策树和随机森林都可以用于聚类任务。\n试图找出两个或多个连续变量之间的关系是一个典型的回归任务。\n注意：如果一个变量可以取其最小值和最大值之间的任意值，则它称为连续变量。\n这项任务的一个例子是根据房价的大小和位置预测房价。在这种情况下，房价是一个连续的数值变量。\n线性回归是该领域最常用的算法。当需要对两个以上变量之间的关系建模时，可以使用多元回归算法、岭回归和套索回归。\n机器学习软件使您能够在几乎任何领域提供数据驱动的持续改进方法。您可以应用产品使用情况分析，以发现新产品功能如何影响需求。配备了经验数据的复杂软件有助于发现无效的措施，使您可以避免做出不成功的决定。\n例如，可以使用异构制造控制系统来提高动态制造系统的适应和自我管理的能力。机器学习技术实时发现各种情况下的最佳行为-这导致了系统的不断改进。\n金融机构每年因欺诈而损失约5%的收入。通过基于历史交易、社交网络信息和其他数据源构建模型，有可能在为时已晚之前发现异常。这有助于实时检测和防止欺诈性交易，即使是对于以前未知的欺诈类型也是如此。\n您可以应用机器学习来构建排名模型。机器学习排名(MLR)通常涉及监督、半监督或强化算法的应用。排名任务的一个例子是像Google的SearchWiki这样的搜索引擎系统。\n推荐系统向用户提供有价值的建议。这种方法给用户带来了实用性，也让公司受益，因为它激励了他们的客户购买更多或探索更多内容。\n项目根据其相关性进行排序。向用户显示最相关的内容。相关性是基于历史数据确定的。如果你在YouTube或Netflix上看过任何东西，你就知道它是怎么工作的。这些系统为您提供了与您已经观看过的视频相似的视频。\n你如何为你的问题找到最好的机器学习算法？您可以使用三种基本方法。\n如果您有一组已标记的数据或可以准备这样一组数据，那么这就是有监督学习的领域。\n如果你仍然需要定义一个结构，那就是一个无监督的学习问题。\n如果需要模型与环境进行交互，则需要应用强化学习算法。\n如果模型的输出是一个数字，则这是一个回归问题。\n如果模型的输出是一个类，并且预期的类数是已知的，则这是一个分类问题。\n如果模型的输出是一个类，但预期的类数是未知的，则这是一个聚类问题\n如果您希望系统根据操作历史提供选项，这是一个推荐问题。\n选择算法的过程并不局限于对问题进行分类。您还需要仔细查看您的数据，因为它在为问题选择正确的算法方面起着重要作用。\n对于较小的样本集，一些算法可以正常工作，而另一些算法需要大量的样本数。某些算法适用于分类数据，而其他算法仅适用于数字输入。\n处理：数据处理的组件包括预处理、分析、清理和从不同的内部和外部源收集数据。\n功能工程：您需要将原始数据转换为能够向预测模型表示潜在问题的功能。它有助于提高准确性，更快地获得预期结果。\n算法的选择是一项综合性的工作，需要对各种因素进行分析。\n有时候问题太复杂了，你不知道从哪里开始。不止一种模式看起来很适合，很难预测哪一种会被证明是最有效的。在这种情况下，您可以测试几个模型并对其进行评估。\n设置一个机器学习管道。它将根据您的评估标准比较每个算法在数据集上的性能。另一种方法是将数据划分为子集，并对不同的组使用相同的算法。最好的解决方案是只执行一次，或者让服务在添加新数据时每隔一段时间运行一次。\n最后，ML今天必须解决的大多数任务都可以在神经网络的帮助下解决。因此，选择ML模型的最后一种方法就是始终选择人工神经网络。\n然而，这些型号昂贵且耗时，这也是其他型号仍然存在的原因。神经网络需要极大的数据库才能准确。其他类型的ML技术可能不是通用的，但即使在处理小数据集时也能有效地解决分配的任务。\n此外，它们往往过大，也很难解释-神经网络基本上是黑匣子，研究人员不知道里面发生了什么。\n因此，如果你的预算很小，数据样本很少，或者渴望获得容易理解的有价值的见解，NNS不适合你。\n您的结果取决于您是否成功地选择并构建了一个成功的ML模型。如果您心中有一个机器学习项目，并且正在寻找解决方案，Serokell的开发人员可以帮助您构建并实现适合您业务目标的机器学习模型。", "note_en": "Why are there so many machine learning techniques? The thing is different algorithms solve various problems. The results you get directly depend on the model you choose. That’s why it’s so important to know how to match a machine learning algorithm to a particular problem.\n In this article, we’re going to talk about just that. Let’s get started.\n  First of all, to choose an algorithm for your project, you need to know what kinds exist. Let’s brush up on your knowledge of different classifications.\n    In the case of supervised learning,  machines need a  teacher who  educates them. In this case, a machine learning specialist collects a set of data and labels it. Then, they need to communicate the training set and the rules to the machine. The next step is to watch how the machine manages to process the testing data. If there are some mistakes made, the programmer corrects them and repeats the action until the algorithm works accurately.\n  This type of machine learning doesn’t require an educator. A computer is given a set of unlabeled data. It’s supposed to find the patterns and come up with insights by itself. People can slightly guide the machine along the process by providing a set of labeled training data as well. In this case, it’s called  semisupervised learning.\n  Reinforcement learning happens in an environment where the computer needs to operate. The environment acts as the teacher, providing the machine with positive or negative feedback that’s called  reinforcement.\n  Another way to divide the techniques into groups is based on the issues they solve.\n In this section, we’ll talk about classification, regression, optimization, and other groups of algorithms. We’re also going to have a look at their use in the industry. We’ve also written previously about  machine learning algorithm classification.\n  Here are the most popular ML algorithms. Sometimes they belong to more than one group because they&#39;re effective at solving more than one problem.\n    Classification helps us to deal with a wide range of problems. It allows us to make more informed decisions, sort out spam, predict whether the borrower will return the loan, or tag friends in a Facebook picture.\n  These algorithms predict discrete variable labels. A  discrete variable has a countable number of possible values and can be classified. The accuracy of the prediction depends on the model you choose.\n Imagine you develop an algorithm that predicts whether a person has or doesn’t have cancer. In this case, the model you choose should be very precise in predicting the result.\n   Sometimes you need to divide things into categories, but you don’t know what these categories are. Classification uses predefined classes to assign to objects.\n On the other hand, clustering allows you to identify similarities between objects and to group them according to the characteristics they have in common. This is the mechanic that lays behind detecting fraud, analyzing documents, grouping clients, and more. Clustering is widely used in sales and marketing for customer segmentation and personalized communication.\n  K-NN, k-means clustering, decision trees, and random forest can all be used for clustering tasks.\n  Trying to find out the relationship between two or more continuous variables is a typical regression task.\n Note: If a variable can take on any value between its minimum value and its maximum value, it’s called a  continuous variable.\n An example of such a task is predicting housing prices based on their size and location. The price of the house in this case is a continuous numerical variable.\n Linear regression is the most common algorithm in this field. Multivariate regression algorithms, ridge regression, and LASSO regression are used when you need to model a relationship between more than two variables.\n  Machine learning software enables you to provide a data-driven approach to continuous improvement in practically any field. You can apply product usage analytics in order to discover how the new product features affect demand. Sophisticated software equipped with empirical data helps to uncover ineffective measures, allowing you to avoid unsuccessful decisions.\n For example, it’s possible to use a heterarchical manufacturing control system in order to improve the capacity for a dynamic manufacturing system to adapt and self-manage. Machine learning techniques uncover the best behavior in various situations in real-time — which leads to the continuous improvement of the system.\n   Financial institutions lose about 5% of revenue each year to fraud. By building models based on historical transactions, social network information, and other sources of data, it’s possible to spot anomalies before it’s too late. This helps detect and prevent fraudulent transactions in realtime, even for previously unknown types of fraud.\n    You can apply machine learning to build  ranking models. Machine learning ranking (MLR) usually involves the application of supervised, semisupervised, or reinforcement algorithms. An example of a ranking task is search engine systems like  SearchWiki by Google.\n   Recommender systems offer valuable suggestions to users. This method brings utility to users and also benefits the companies because it motivates their clients to buy more or to explore more content.\n  Items are ranked according to their relevance. The most relevant ones are displayed to the user. The relevancy is determined based on historical data. You know how it works if you’ve ever watched anything on YouTube or Netflix. The systems offer you similar videos to what you’ve already watched.\n  How do you find the best machine learning algorithm for your problem? There are three basic approaches you can use.\n    If you have a set of labeled data or can prepare such a set, it’s the domain of supervised learning\n If you still need to define a structure, it’s an unsupervised learning problem\n If you need the model to interact with an environment, you’ll apply a reinforcement learning algorithm\n  If the output of the model is a number, it’s a regression problem\n If the output of the model is a class and the number of expected classes is known, it’s a classification problem\n If the output of the model is a class but the number of expected classes is unknown, it’s a clustering problem\n  If you want a system to offer options based on the history of actions, it’s a recommendation problem\n  The process of choosing the algorithm isn’t limited to categorizing the problem. You also need to have a closer look at your data because it plays an important role in the selection of the right algorithm for the problem.\n Some algorithms function normally with smaller sample sets, while others require a huge number of samples. Certain algorithms work with categorical data while others only work with numerical input.\n  Processing: The components of data processing are preprocessing, profiling, cleansing, and pulling together data from different internal and external sources\n Feature engineering: You need to transform raw data into features that can represent the underlying problem to the predictive models. It helps to improve accuracy and get the desired results faster.\n Choosing the algorithm is a comprehensive task that demands the analysis of a variety of factors.\n  Sometimes the problem is too complex, and you don’t know where to start. More than one model seems like a good fit, and it’s difficult to predict which one will turn out to be the most effective. In this case, you can test a couple of models and assess them.\n Set up a  machine learning pipeline. It’ll compare the performance of each algorithm on the dataset based on your evaluation criteria. Another approach is to divide your data into subsets and  use the same algorithm on different groups. The best solution for this is to do it once or to have a service running that does this in intervals when new data is added.\n  Finally, the majority of tasks ML has to solve today can be solved with the help of neural networks. So the final approach to choosing an ML model is just to always go for artificial neural networks.\n However, these models are expensive and time-consuming to build, which is why other models still exist. Neural networks need extremely large databases in order to be accurate. Other types of ML techniques might not be as universal but solve assigned tasks effectively even when working with small datasets.\n Moreover, they tend to overfit and are also hard to interpret — neural networks are basically black boxes, and researchers don’t know what’s happening inside.\n So if you have a small budget, a small data sample, or aspire to get valuable insights that are easy to understand, NNs are not for you.\n  Your results depend on whether you manage to select and build a successful ML model. If you have a machine learning project in mind and are looking for solutions, Serokell’s developers can help you to build and realize a machine learning model that suits your business goals.", "posttime": "2020-07-22 02:16:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "算法,适合,machine,需要", "title": "如何选择适合您的机器学习算法", "title_en": "How to Choose the Machine Learning Algorithm That's Right for You", "transed": 1, "url": "https://medium.com/better-programming/how-to-choose-the-machine-learning-algorithm-thats-right-for-you-652983383720", "via": "", "real_tags": ["算法", "适合", "machine", "需要"]}, {"category": "", "categoryclass": "", "imagename": "845937b93b0990d443193d5c0d3b17e1.png", "infoid": 1013324, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我的游戏acolytefight.io是一个多人技巧射击竞技场。它看起来可能看起来很简单，但它被设计成一款高技能的游戏。熟练的玩家学习每个法术的准确时间、速度、距离和行为，并学会预测和躲避敌人，使其成为最后一个站稳脚跟的人。当然，像这样的游戏需要一个评级系统。每个人都想知道，谁是第一名？\n大多数评级系统都基于ELO评级系统，该系统最初是为国际象棋设计的。有很多变体-TrueSkill是最知名的。DOTA 2和英雄联盟都是基于ELO的系统。当我把埃洛用在追随者格斗中时，每个人都很讨厌。每隔几天，就会有新的人加入到不和谐的行列中，说评级系统是垃圾。花了几个月、几千万场游戏和4个重拍的评级系统才明白原因。\n任何ELO系统(包括所有变体，如TrueSkill)的输赢曲线如下所示：\n这张图显示，如果你的对手比你低500分(也许你是一名经验丰富的球员，而他们是新手)：\nELO承认你是更好的玩家，在20场比赛中，你会赢19场，他们会赢1场，所以为了保持平衡，埃洛让你输的比你赢的多19倍。均衡允许评级系统只衡量技能，而不是玩游戏的数量。\n在Elo术语中，表达这个19：1输赢比率的另一种方式是说你有95%的获胜概率。\n在追随者的争斗中，评分系统有很多次迭代。人们提出了很多(数学上不靠谱的)建议。找出根本原因花了很长时间。\n根本原因是什么？ELO预计您的获胜概率将遵循指数曲线，如下所示：\n如果你的对手略低于你(200分之差)，你将有76%的机会获胜。\n如果你的对手比你低很多(差400分)，你将有91%的机会获胜。\n问题是，追随者战斗的实际胜率曲线实际上并不是这样的。以下是100000场比赛的实际胜率：\n请注意，这里的实际曲线看起来与上图完全不同。并没有真正的指数曲线。它更具线性。正是这种洞察力让我意识到我必须改变评级体系。如果我们让一名顶级球员，让他们反复与高级别、中级和低级别球员比赛，直到我们从统计上对他们的胜率充满信心，那么他们的胜率没有理由符合指数曲线。为什么我们甚至要使用指数曲线呢？是谁决定的？他们是根据什么数据得出这一结论的？\n我假设像DOTA 2这样的游戏在他们的方程式中仍然有一个指数曲线，尽管它可能是错误的。这不会影响他们的原因是他们的媒人只是把技能相似的玩家放在一起。与我的小游戏不同，他们很少需要准确评估一个高水平的球员在与其他技能水平的球员的比赛中会表现如何。不过，如果他们曾经这样做过，我肯定它会不能正常工作。\n我设计了一个新的评级系统，名为ACO评级系统，除了解决了一些关键问题外，它与ELO类似。\n实际胜率：获胜概率根据过去100000场比赛的实际数据计算。这意味着它不需要拟合指数曲线。例如，系统可以查找其数据库并看到1800评级玩家与1300评级玩家的匹配结果是较高级别的玩家在76.3%的时间内获胜。如果高水平的玩家表现优于这一点，他们会随着时间的推移获得积分，根据实际数据，这是一个公平的系统。\n新手压制：当你在玩评分比你低得多的人时，可以获得/失去的点数会减少。这会让人们更快乐，因为他们不会输给新手那么多分。相反，他们只能把最多的分数输给与他们技能水平相似的人，这感觉要公平得多。\n小增量：一般情况下，每场比赛你会得到或失去大约1分。这意味着每一场比赛在计划中都是无关紧要的，而且在排名模式下玩每一场比赛也不会有什么坏处。TrueSkill或Glicko等竞争系统表示，它们的优势是你可以更快地收敛到你的评分上，有时一场比赛就会增加50或100分。实际上我发现这是一个不利因素。ACO的缓慢评级增长意味着，如果你登上排行榜榜首，你肯定知道你真的赚到了，这不仅仅是因为评级系统中的不确定性错误造成的。\n每日衰退：每天，一个人的评分都会下降5个百分点。这确保了每个人都被鼓励继续打排名，捍卫自己的冠军头衔。为了保持真实评级不变，衰败与评级分开存储，上限为100，每场比赛抵消1个衰减点。以前，人们会在最高排行榜上扎营，根本不是为了保住自己的位置而打球，这并不好玩。\n“评级系统是垃圾”的投诉大幅减少，尽管还没有达到零。外面有没有一个完美的评级系统？大概不会吧。\n只有当你和其他技能水平相近的人玩时，ELO才能真正发挥作用。它是在我们可以对数十万个游戏进行数据挖掘之前发明的。我预计，即使对于国际象棋来说，获胜的概率曲线实际上也不是指数型的。\n有了ACO评级系统，即使你没有与其他类似技能水平的人相匹配，你在统计上仍然是在与他们竞争。这意味着它适合不能依赖大玩家基础和配对系统的较小游戏。", "note_en": "My game,  acolytefight.io is a multiplayer skillshot arena. It might look deceptively simple, but it is designed to be a high-skill game. Skilled players learn the exact timings, speeds, distances and behaviours of every spell, and learn to predict and dodge their enemies to be the last one standing. Naturally, a game like this needs a rating system. Everyone wants to know, who is #1?\n  Most rating systems are based on the  Elo rating system, which was originally designed for Chess. There are many variations — TrueSkill is the most well-known. DOTA 2 and League of Legends all of systems based on Elo. When I applied Elo to Acolyte Fight, everyone hated it. Every few days, a new person would join the Discord and say the rating system was trash. It took many months, tens of millions of games, and 4 remakes of the rating system to understand why.\n  The win/loss curves of any Elo system (including all variations such as TrueSkill), look something like this:\n  This graph shows that, if you play against someone who is 500 points below you (perhaps you are a well-seasoned player and they are a newbie):\n  Elo recognises that you are the better player, and that out of 20 games, you will win 19 and they will win 1. So to maintain equilibrium, Elo makes you lose 19x more than you win.  Equilibrium allows the rating system to only measure skill, and not the number of games played.\n In Elo terms, another way of expressing this 19:1 win/loss ratio is to say you have a 95%  win probability.\n  In Acolyte Fight, there were many iterations on the rating system. People made a lot of (mathematically-unsound) suggestions. It took a long time to identify the root cause.\n What is the root cause? Elo expects your win probability to follow an exponential curve, like this:\n   If you play against someone who is slightly below you (200 point difference), you’ll win 76% of the time.\n If you play against someone who is quite a lot below you (400 point difference), you’ll win 91% of the time.\n The problem is that, the actual win rate curve for Acolyte Fight doesn’t actually look like that. These are the actual win rates over 100000 games:\n  Notice, the actual curve here looks nothing like the graph above. There isn’t really an exponential curve. It is more linear.  This was the insight that made me realise I had to change the rating system. If we take a top-level player, and make them fight a high-level, mid-level and low-level player repeatedly until we can become statistically confident of their win rates against each,  there is no reason why their win rates would fit an exponential curve. Why do we even use an exponential curve? Who decided that? What data did they base this on?\n  I presume games like DOTA 2 still have an exponential curve in their equations, despite the fact that it is probably wrong. The reason it does not affect them is  their matchmaker only puts players of similar skill together. Unlike my smaller game, they rarely need to accurately assess how a high-level player would perform against players of other skill levels. If they ever did though, I am sure it would function incorrectly.\n  I have designed a new rating system called the Aco rating system, which is similar to Elo except it fixes a few key problems.\n Actual win rates: The win probability is calculated from the actual data of the past 100000 games. This means it does not need to fit an exponential curve. For example, the system could lookup its database and see that a matchup of a 1800 rating player vs a 1300 rating player results in the higher-level player winning 76.3% of the time. If the high-level player is outperforming this, they gain points over time, and that is a fair system, based in actual data.\n Newbie suppression: The points able to be gained/lost is reduced when you are playing someone substantially lower in rating than you. This makes people happier because they can’t lose as many points to newbies. Instead, they can only lose the most points to people similar to their skill level, which feels much more fair.\n Small increments: In general, you will gain or lose about 1 point per game. This means each game is insignificant in the scheme of things, and it doesn’t hurt to play every game in ranked mode. Competing systems like TrueSkill or Glicko say their advantage is that you can converge on your rating a lot faster, sometimes adding 50 or 100 points from a single game. I actually found this was a disadvantage. The slow rating increase of Aco means that if you reach the top of the leaderboard, you know for sure you have really earned it and that it is not just caused by uncertainty error in the rating system.\n Daily decay: Every day, a person’s rating decays by 5 points. This ensures everyone is encouraged to keep playing ranked and defend their title. To preserve the true rating unchanged, the decay is stored separately from the rating, caps at 100 and each game cancels out 1 point of decay. Previously, people would camp at the top leaderboard, simply not playing to maintain their position, and that was not any fun.\n  The “rating system is trash” complaints have reduced dramatically, although they have no reached zero. Is there a perfect rating system out there? Probably not.\n   Elo only really works when you’re playing others of similar skill levels. It was invented at a time before we could data mine hundreds of thousands of games. I would expect that the win probability curve even for Chess is not actually exponential.\n With the Aco rating system, even if you are not being matched with others of similar skill level, you are still competing with them statistically. This means it suits smaller games that cannot rely on a large player base and a matchmaking system.", "posttime": "2020-07-22 02:15:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,评分,sucks,系统", "title": "ELO很糟糕-更好的多人评分系统，适用于较小的游戏(2019年)", "title_en": "Elo sucks – better multiplayer rating systems for smaller games (2019)", "transed": 1, "url": "https://medium.com/acolytefight/elo-sucks-better-multiplayer-rating-systems-for-smaller-games-8ca588ee652f", "via": "", "real_tags": ["游戏", "评分", "sucks", "系统"]}, {"category": "", "categoryclass": "", "imagename": "2d9745cfe2a1ae038646d105cceecc63.jpeg", "infoid": 1013322, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这将在生成的目录中生成代码，然后针对语言、操作类型和编译器的每种组合，运行支持的基准测试。最后，一个显示基准结果的Markdown格式表被打印到标准输出。\nGCC和克朗并没有为C++执行所有的语义检查(因为它太昂贵了)。这与执行所有这些任务的D&39；s和Rust&#39；编译器形成了鲜明对比。\nLONG ADD_LONG_N0_H0(LONG X){RETURN x+0；}LONG ADD_LONG_N0(LONG X){RETURN x+ADD_LONG_N0_H0(X)+0；}LONG ADD_LONG_N1_H0(LONG X){RETURN x+2；}LONG ADD_LONG_N1_H0(X)+1；}LONG ADD_LONG_N2_H0(LONG X){RETURN x+2；}long add_long_n2(Long X){return x+add_long_n2_h0(X)+2；}int main(__ATTRIBUTE__((未使用))int ARGC，__ATTRIBUTE__((UNUSED))char*argv[]){LONG LONG_SUM=0；LONG_SUM+=ADD_LONG_N0(0)；LONG_SUM+=ADD_LONG_N1(1)；LONG_SUM+=ADD_LONG_N2(2)；返回LONG。\n对于支持泛型的每种语言，都会在LINEAR.$lang的旁边生成一个额外的模板化源文件LINEAR_t.$lang。$lang等同于LINEAR.$lang的内容。除此之外，所有函数(Main除外)都是模板化的。这个模板化的源代码也将进行基准测试。下表中模板化的列指示编译是否使用模板化函数。\nD&#39；的编译器DMD仍然遥遥领先于所有竞争对手，特别是在默认构建(标准编译)性能方面。\n每一个新版本(目前在下表中分别是8、9、10)，GCC和Cang的性能都会明显下降。\n通用C++和D(DMD)版本的编译速度大约慢1.5到2倍，而有趣的是，通用Rust版本的处理速度比非通用版本快2-3倍。\nJulia的JIT编译器(目前)非常需要内存。对于Julia，函数计数和函数深度的最大推荐乘积是5000。因此，当达到这一最大值时，朱莉娅将被排除在基准之外。\n我的英特尔®酷睿™i7-4710HQ CPU@2.50 GHz×8，16 GB内存运行Ubuntu20.04进行示例调用时的输出。\n\n这是使用LDC构建的DMD，编译时间额外减少了15%。", "note_en": "This will generate code into the directory  generated and then, for eachcombination of language, operation type and compiler, run the supportedbenchmarks. At the end a Markdown-formatted table showing the results of thebenchmark is printed to standard output.\n GCC and Clang doesn&#39;t perform all semantic checks for C++ (because it&#39;s toocostly). This is in contrast to D&#39;s and Rust&#39;s compilers that perform all ofthem.\n     long  add_long_n0_h0( long x) {  return x +  0; } long  add_long_n0( long x) {  return x +  add_long_n0_h0(x) +  0; } long  add_long_n1_h0( long x) {  return x +  1; } long  add_long_n1( long x) {  return x +  add_long_n1_h0(x) +  1; } long  add_long_n2_h0( long x) {  return x +  2; } long  add_long_n2( long x) {  return x +  add_long_n2_h0(x) +  2; } int  main(__attribute__((unused)) int argc, __attribute__((unused)) char* argv[]) {  long long_sum =  0; long_sum +=  add_long_n0( 0); long_sum +=  add_long_n1( 1); long_sum +=  add_long_n2( 2);  return long_sum;}\n  For each languages that supports generics an additional templated source file linear_t.$LANG will be generated alongside  linear.$LANG equivalent to thecontents of  linear.$LANG apart from that all functions (except  main) aretemplated. This templated source will be benchmarked aswell. The column Templated in the table below indicates whether or not the compilation isusing templated functions.\n  D&#39;s compiler  dmd is still far ahead of all its competition especially when itcomes to default build (standard compilation) performance.\n The performance of both GCC and Clang gets significanly worse with each newrelease (currently 8, 9, 10 in the table below).\n The generic C++ and D ( dmd) versions compiles about 1.5 to 2 times slowerwhereas the generic Rust version interestingly is processed 2-3 times fasterthan the non-generic version.\n Julia&#39;s JIT-compiler is (currently) very memory hungry. A maximum recommendedproduct of  function-count and  function-depth for Julia is 5000. Julia willtherefore be excluded from the benchmark when this maximum is reached.\n  The output on my Intel® Core™ i7-4710HQ CPU @ 2.50GHz × 8 with 16 GB of memoryrunning Ubuntu 20.04 for the sample call\n   \n This is with DMD built with LDC for an additional 15 percent drop in compilation time.", "posttime": "2020-07-22 02:14:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编译,基准,compiler,long", "title": "编译器基准测试", "title_en": "Compiler Benchmark", "transed": 1, "url": "https://github.com/nordlow/compiler-benchmark", "via": "", "real_tags": ["编译", "基准", "compiler", "long"]}, {"category": "", "categoryclass": "", "imagename": "3da2f165fd6202ade9b2f26fb17af754.jpg", "infoid": 1013321, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于某个年龄段的车迷来说，很少有车能与迈凯轮F1相提并论。早在1994年，这辆车就改写了规则，即使在超级跑车热潮中也是如此，当时我们有了捷豹XJ220和布加迪EB110这样的机器。它的价格约为100万美元(640,000 GB)，其价格几乎与其规格一样令人难以置信-全碳纤维结构，手工制造的V12，在赛道外闻所未闻的加速，以及最高时速超过240英里/小时(386公里/小时)。\n近三十年后，它的设计师戈登·默里(Gordon Murray)正在努力制作这款传奇汽车的续集。它将被命名为T.50，我们将在下个月发布时第一次正式看到它。但与此同时，戈登·默里汽车公司(Gordon Murray Automotive)和科斯沃斯(Cosworth)公布了T.50&39；发动机的一些细节，他们将其描述为有史以来最伟大的V12公路车。\n当他在90年代在迈凯轮时，穆雷求助于他在宝马的朋友保罗·罗什来制造F1的定制发动机。这一次，这份工作交给了科斯沃斯，它在20世纪60年代用DFV发动机彻底改变了一级方程式，第一次获得认可。\n超过一半的真正伟大的驾驶体验是由引擎提供的，所以从一开始我就设定了最高的基准-创造了世界上最伟大的自然吸气式V12。要想真正与众不同，发动机需要有正确的特性-高响应性，令人惊叹的声音，吸引人的扭矩传递，自由转速，并且它必须是自然吸气的。穆雷说，由于所有这些原因，T.50的发动机永远不会是V12以外的任何东西。\n科斯沃斯对这样的挑战并不陌生，这也是另一位传奇的F1设计师阿德里安·纽伊(Adrian Newey)为他的第一辆公路赛车阿斯顿·马丁·瓦尔基里(Aston Martin Valkyrie)选择的公司。如果说有什么不同的话，那就是T.50的发动机甚至比将为瓦尔基里提供动力的1000马力(746kW)涡轮增压6.5LV12发动机更令人震惊。对于初学者来说，它是一个小得多的发动机，置换了3.9升，总重量只有392磅(178公斤)。还有也没有完整的混合动力系统，但T.50是一个48V温和混合动力，其集成的启动发电机将贡献约50马力(37kW)的派对时，完全需要速度。\n默里并不喜欢涡轮增压器钝化油门反应的方式，所以这款V12自然是吸气的。峰值功率为654马力(488千瓦)，转速为11,500rpm，红线前还有600转。而且它到达那里的速度几乎和电动马达一样快-从空闲到12100rpm只需0.3秒。高转速自然吸气式发动机在动力方面很棒，但在扭矩方面就不那么令人印象深刻了，T.50也不是异类。峰值扭矩在9000rpm时仅为344磅英尺(467 Nm)，但戈登·默里汽车公司表示，为了确保良好的驾驶性能，发动机将在2500 rpm时产生244磅英尺(331 Nm)的扭矩。\n除了表现良好，穆雷坚持认为发动机看起来也很好，没有主导现代发动机舱的盖子。最重要的是，我希望它看起来像宝马S70/2发动机(为迈凯轮F1提供动力)，没有碳或塑料外壳。只有进气口喇叭，凸轮盖，排气块和喷头，以及一些皮带驱动的辅助装置，我设法把它们挤出了视线。在设计T.50V12时，我想让它成为现代超级跑车的解毒剂，在现代超级跑车中，你看不到碳罩下的发动机，他说。\n机械管弦乐队的设计也是为了听起来好听。除了驱动凸轮轴的12个气缸和齿轮外，发动机还从司机头顶上方的进气口吸入空气，车顶有不同厚度的碳纤维，可以放大机舱内的声音。\n我想T.50的驾驶体验将与瓦尔基里截然不同。与Newey不同的是，Murray避免了桨换档和半自动变速箱，而是选择了司机接洽和由Xtrac制造的六速手动变速箱，带有传统的H型换档，重量仅为117磅(80.5公斤)。这就是说，我也不太可能发现；只会建造100辆T.50，每辆起价260万美元，相比之下，售价300万美元、150个单元的Valkyrie几乎是司空见惯的。", "note_en": "For car nerds of a certain age, few cars compare to the McLaren F1. Back in 1994, the car rewrote the rules, even in the midst of a supercar boom that gave us machines like the Jaguar XJ220 and the  Bugatti EB110. At around a million dollars (£640,000), its price tag was almost as unbelievable as its specifications—an all carbon fiber construction, a hand-built V12, acceleration that was unheard of outside the race track, and a top speed north of 240mph (386km/h).\n Nearly three decades later, its designer  Gordon Murray is hard at work on a sequel to this legendary vehicle.  It&#39;s going to be called the T.50, and we&#39;ll get our first official look at it when it&#39;s revealed next month. But in the meantime, Gordon Murray Automotive and Cosworth have released some details on the T.50&#39;s engine, which they describe as &#34;the greatest road-car V12 ever made.&#34;\n When he was at McLaren in the &#39;90s, Murray turned to his friend Paul Rosche at BMW to build the F1&#39;s bespoke engine. This time, the job went to Cosworth, which first rose to recognition when it revolutionized Formula 1 in the 1960s with  the DFV engine.\n &#34;More than half of any truly great driving experience is delivered by the engine, so right from the start I set the highest possible benchmark—to create the world’s greatest naturally aspirated V12. To be truly remarkable, an engine needs to have the right character—highly-responsive, an amazing sound, engaging torque delivery, free-revving, and it has to be naturally aspirated. For all those reasons, the engine in the T.50 was never going to be anything other than a V12,&#34; Murray said.\n Cosworth is no stranger to challenges like that, and it&#39;s the same company that Adrian Newey—another legendary F1 designer—picked for his first road car, the Aston Martin Valkyrie. If anything, the T.50&#39;s engine is even more outrageous than  the 1,000hp (746kW) turbocharged 6.5L V12 that will power the Valkyrie. For starters, it&#39;s a much smaller motor, displacing 3.9L and weighing just 392lbs (178kg) in total. There&#39;s also no full hybrid system, but the T.50 is a 48V mild hybrid, and its integrated starter-generator will contribute about 50hp (37kW) to the party when outright speed is required.\n  Murray is not a fan of the way turbochargers blunt throttle response, so this V12 is naturally aspirated. Peak power is 654hp (488kW) at 11,500rpm, with another 600 revs before the redline. And it gets there nearly as quickly as an electric motor—from idle, the V12 will reach 12,100rpm in just 0.3 seconds. High-revving naturally aspirated engines are great for power but less impressive when it comes to torque, and the T.50 is no outlier. Peak torque is just 344lb-ft (467Nm) at 9,000rpm, but Gordon Murray Automotive says that to ensure good drivability, the engine will produce 244lb-ft (331Nm) at 2,500rpm.\n In addition to performing well, Murray has insisted that the engine looks good, too, without the covers that dominate a modern engine bay. &#34;Above all else, I wanted it to look clean like the BMW S70/2 engine [which powered the McLaren F1], which had no carbon or plastic covers. It was just inlet trumpets, cam covers, exhaust block and heads, and a few belt-driven ancillaries that I managed to squeeze out of sight. In designing the T.50 V12, I wanted it to be the antidote to the modern supercar where you can’t see the engine beneath carbon covers,&#34; he said.\n The mechanical orchestra has also been designed to sound good. In addition to the 12 cylinders and the gears that drive the camshafts, the engine sucks in air from intakes above the driver&#39;s head, with varying thicknesses of carbon fiber in the roof that amplify sound within the cabin.\n I imagine the driving experience of the T.50 will be radically different to that of the Valkyrie. Unlike Newey, Murray has eschewed paddle shifts and a semiautomatic gearbox, opting instead for driver engagement and a six-speed manual with a conventional H-pattern shift, built by Xtrac, which weighs just 117lbs (80.5kg). That said, I&#39;m also unlikely to ever find out; just 100 T.50s will be built, each starting at $2.6 million, making the $3 million, 150-unit Valkyrie almost common by comparison.", "posttime": "2020-07-22 01:06:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "沃斯,builds,发动机", "title": "有史以来最棒的V12？科斯沃斯为戈登·默里制造发动机", "title_en": "The greatest V12 ever made? Cosworth builds an engine for Gordon Murray", "transed": 1, "url": "https://arstechnica.com/cars/2020/07/the-greatest-v12-ever-made-cosworth-builds-an-engine-for-gordon-murray/", "via": "", "real_tags": ["沃斯", "builds", "发动机"]}, {"category": "", "categoryclass": "", "imagename": "5c9b879acf011c81f53cbc824e3d045f.jpg", "infoid": 1013320, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "他说：“Quizlet走到这一步的方式是通过建立和发展一项非常负责任的业务。”他说：“这是团队十年辛勤工作的结果。我们更像一头骆驼。“。\n不过，很明显，潮流可能正在改变。在教育技术领域，富人正变得越来越富有。上周，总部位于山景城的Coursera宣布，它已经筹集了1.3亿美元的F系列融资。一天前，The Information爆出了一篇报道，称Udemy以30亿美元的估值筹集了新的融资。\n对于近几个月来一直关注我的edtech报道的任何人来说，这种势头并不令人惊讶。在大流行的早期，Master Class筹集了1亿美元，Quizlet成为了一家独角兽公司，Byju‘s成为印度第二大最有价值的初创公司。\n虽然edtech的繁荣是可以预测的，但该行业以保守著称-这让创始人感到懊恼，也让长期投资者受益。今天，我们将了解后期融资的增加可能会如何在更广泛的范围内影响市场。\n猫头鹰风险投资公司(Owl Ventures)的投资者伊恩·邱(Ian Chiu)告诉TechCrunch，大额融资的兴起给价值6万亿美元的教育市场带来了一个“分水岭时刻”。OWL Ventures成立于2014年，是目前最大的专注于教育科技的公司之一，但邱表示，最近强劲的资金流表明，该行业终于开始成为其他投资者关注的行业。", "note_en": "“The way  Quizlet   has gotten to this point is by building and growing a very responsible business,” he said. “It’s the result of the hard work of the team for a decade. We’re much more like a camel.”\n It’s clear, though, that the tides might be changing. In edtech, the rich are getting richer. Last week, Mountain View-based  Coursera   announced it had raised a $130 million Series F round a day after The Information broke a story about  Udemy reportedly raising new financing at a $3 billion valuation.\n For anyone who has been following my edtech coverage in recent few months, this momentum is hardly surprising. Earlier in the pandemic, MasterClass raised $100 million, Quizlet became a unicorn and Byju’s became India’s second-most-valuable startup.\n While edtech’s boom is predictable, the industry is known —  to the chagrin of founders and to the  benefit of long-time investors — for being conservative. Today we’ll look to understand how a boost in late-stage funding may impact the market on a broader scale.\n  Ian Chiu, an investor at Owl Ventures, tells TechCrunch that the rise of big rounds brings a “watershed moment” to the $6 trillion education market. Owl Ventures was founded in 2014 and is one of the biggest edtech-focused firms out there, but Chiu says the recent strong capital flow shows that the sector is finally emerging as a sector other investors are noticing.", "posttime": "2020-07-22 01:06:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,startups", "title": "\nEdTech初创公司与独角兽式增长调情", "title_en": "\n\t\t\t\tEdtech startups flirt with unicorn-style growth\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/21/edtech-startups-flirt-with-unicorn-style-growth/", "via": "", "real_tags": ["初创", "startups"]}]