[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1007215, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Caffeine是用于Web浏览器、Node.js和WebAssembly的实时编码环境。在将其添加到网页后，您可以使用它对该页面和其他运行咖啡因的页面进行实时持久更改，而无需重新加载。\n作为一名无头Web工作者，用于发布和接收消息(您负责所有DOM操作)。\n作为一个充满头颅的IFRAME中的IDE，咖啡因可以直接操作DOM。\n通过一个令人头晕目眩的DevTools面板IDE，使用Chrome调试协议来操作您的浏览器正在运行的每个页面。\nCaffeine的底层计算引擎是SqueakJS，一个开源的Smalltalk。它具有双向JavaScript桥，使Smalltalk方法能够向JavaScript对象发送消息，并提供Smalltalk块闭包作为JavaScript承诺或回调函数。\nCaffeine支持Squeak、Pharo、Cuis、3D VR(通过A-Frame和OSC)、缩放3D演示(通过impress.js)、VueJS、WebMIDI、Observable、Web Workers、DevTools和许多其他JS框架。\n您可以在我的博客https://thiscontext.com.上阅读更多关于咖啡因的设计和新功能的内容。看看YouTube上的预告片吧。\n咖啡因已存储在Web浏览器缓存中的文件列表。您可以从其中下载文件，并将新文件放入其中。\n有问题和项目需要跟进；请务必！目前的活动集中在让咖啡因成为一个高效的虚拟现实生活编码环境，以及部署实时编码的VueJS网络应用程序。", "note_en": "Caffeine is a livecoding environment for  web browsers,  Node.js, and  WebAssembly. After adding it to a webpage, you can use it to make live persistent changes to that page and other pages running Caffeine, without reloading.\n  as a headless Web Worker, with which you post and receive messages (you are responsible for all DOM manipulation).\n  as an IDE in a headful IFrame, with Caffeine able to manipulate the DOM directly.\n    through a headful DevTools panel IDE, using the Chrome Debugging Protocol to manipulate every page your browser is running.\n Caffeine’s underlying computation engine is  SqueakJS, an open-source  Smalltalk. It features a bi-directional JavaScript bridge, enabling Smalltalk methods to send messages to JavaScript objects, and provide Smalltalk block closures as JavaScript promises or callback functions.\n Caffeine has support for  Squeak,  Pharo,  Cuis, 3D VR (via  A-Frame and  OSC), zooming 3D presentations (via  impress.js),  VueJS,  WebMIDI,  Observable,  Web Workers,  DevTools and many other JS frameworks.\n You can read more about the design of Caffeine, and new features, at my blog,  https://thiscontext.com. Check out the  teaser trailer on YouTube.\n  a listing of the files Caffeine has stored in your web browser’s cache. You can download files from it, and drop new files into it.\n There are  issues and  projects to follow; please do! Current activity is focused on  making Caffeine a productive in-world VR livecoding environment, and deploying livecoded  VueJS web apps.", "posttime": "2020-06-19 11:43:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "webassembly,livecoding,web", "title": "Caffeine：用于Web浏览器、Node.js和WebAssembly的LiveCoding环境", "title_en": "Caffeine: Livecoding environment for web browsers, Node.js, and WebAssembly", "transed": 1, "url": "https://caffeine.js.org/", "via": "", "real_tags": ["web"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007213, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "處理這個邀請時發生問題，我們正盡快修復.", "note_en": "處理這個邀請時發生問題，我們正盡快修復。", "posttime": "2020-06-19 11:42:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "进行,view,發生", "title": "SynSin：从单个图像进行端到端视图合成", "title_en": "SynSin: End-to-End View Synthesis from a Single Image", "transed": 1, "url": "https://ai.facebook.com/research/publications/synsin-end-to-end-view-synthesis-from-a-single-image/", "via": "", "real_tags": ["进行", "view", "發生"]}, {"category": "", "categoryclass": "", "imagename": "07794634379f29362ab40528ab1da69a.jpg", "infoid": 1007212, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一名特斯拉员工指责公司在保护弗里蒙特工厂工人免受新冠状病毒感染方面做得不够，他已被通知将于周五被解雇。\n海沃德(Hayward)的卡洛斯·加布里尔(Carlos Gabriel)周二收到特斯拉的一封电子邮件，给他两个工作日的时间通知公司他重返工作岗位的计划，否则他将在周五之前被解雇。在加布里埃尔与这家新组织分享的电子邮件中，特斯拉表示，做出这一决定是基于加布里埃尔在4月和5月对公司电子邮件和语音邮件关于他重返工作岗位的意图的“缺乏回应”。\n加布里埃尔说，他没有回复这封电子邮件，因为公司之前告诉他，如果他不舒服回到工作岗位，可以呆在家里。\n加布里埃尔表示，他认为特斯拉是在报复他，因为他试图向公司施压，要求其披露更多有关健康和安全协议的信息。此前有报道称，自5月下旬汽车生产重新开始后，特斯拉的几名员工的冠状病毒检测呈阳性。\n周一，在特斯拉弗里蒙特工厂外的一次集会上，加布里埃尔谈到了员工们对在工厂车间感染冠状病毒的担忧。集会由一个名为工人团结行动网络(Workers Solidations Action Network)的组织发起。加布里埃尔还举着一块牌子，上面写着“特斯拉不在乎人命。”\n不到24小时后，今年1月开始在特斯拉负责公司动力总成和电池组组装业务的加布里埃尔收到通知，称他可能在本周末之前丢掉工作。\n加布里埃尔说：“他们曾说，如果我们仍然害怕来上班，我们可以呆在家里，没有工资。”“然后，第二天，在我在一次公开集会上发言后，我收到了那封电子邮件(关于他可能被解雇的事情)。我发现这是对这次集会的直接回应。“。\n加布里埃尔提供了他发给特斯拉主管和人力资源官员的电子邮件副本，表达了他对工作环境的担忧，以及如果员工选择呆在家里，公司对他们工作的立场。在一封日期为5月9日的电子邮件中，马斯克详细说明了重新开放特斯拉工厂的计划，以反对阿拉米达县的规定。加布里埃尔表示，由于“这种病毒的危险及其长期的负面影响，我仍然对弗里蒙特工厂过早重新开放感到担忧，因为据医疗专业人士说，我们的社区还没有准备好恢复工作。”\n加布里埃尔收到了特斯拉代理人力资源总监文斯·伍达德(Vince Woodard)的回复，伍达德在回复中说，“如果你在这个时候觉得回到工作岗位不舒服，你可以呆在家里，不受处罚，享受无薪工作时间。这一决定不会有任何影响。您是一名有价值的员工，我们尊重您的决定。“。\n特斯拉在3月下旬关闭了海沃德的生产，作为旧金山湾区原地避难努力的一部分，以帮助减缓冠状病毒在整个地区的传播。有时，特斯拉和阿拉米达县之间的局势变得紧张起来，比如5月份，首席执行官埃隆·马斯克(Elon Musk)表示，他将违反就地避难所协议，在弗里蒙特开始生产。\n在特斯拉起诉阿拉米达县，马斯克威胁要将特斯拉的运营搬出加州后，该公司和该县就允许特斯拉按照县安全指导方针重启汽车生产的事宜达成休战协议。特斯拉还撤销了对阿拉米达县的诉讼。", "note_en": "A Tesla employee who accused the company of not doing enough to protect Fremont plant workers from the new coronavirus, has been notified he will be terminated from his job on Friday.\n Carlos Gabriel, of Hayward, received an email from Tesla on Tuesday giving him two business days to notify the company about his plans to return to his job, or he would be let go by Friday. In its email, which Gabriel shared with this new organization, Tesla said its decision was based on Gabriel’s “lack of response” to company emails and voicemails in April and May about his intentions of coming back to work.\n Gabriel said he didn’t respond to the email because the company had previously told him it was OK for him to stay home if he was uncomfortable going back to work.\n Gabriel said he believes Tesla is retaliating against him because of  his efforts to pressure the company to divulge more information about its health and safety protocols following reports that a handful of  Tesla employees had tested positive for coronavirus since coming back to work after vehicle production restarted in late May.\n  At a Monday rally outside of Tesla’s Fremont plant, and organized by a group called the Workers Solidarity Action Network, Gabriel spoke about employees’ fears of contracting coronavirus on the factory floor. Gabriel also held a sign reading “Tesla doesn’t care about human life.”\n Less than 24 hours later, Gabriel, who began working at Tesla in January on the company’s powertrain and battery pack assembly operations, received notice that he could lose his job by the end of the week.\n “They had said we could stay home without pay if we were still afraid about coming to work,” Gabriel said. “Then, the next day, after a public rally I spoke at, I got that email (about his possible termination). I find that a direct response to the rally.”\n Gabriel provided copies of emails he had sent to supervisors and human resources officials at Tesla expressing his concerns about the work environment, and the company’s position regarding employees jobs should they choose to stay at home. In one email, dated May 9, which was when Musk was detailing plans to reopen the Tesla plant in opposition to Alameda  County regulations, Gabriel said that because of “the dangers of this virus, and its long lasting negative effects, I remain concerned for this premature reopening of the Fremont factory being our community is not ready to return to work according to medical professionals.”\n Gabriel received a reply from Vince Woodard, who was serving as acting human resources director at Tesla, in which Woodard said, “If at this time you do not feel comfortable returning to work, you can stay home without penalty and take time unpaid. There will be no repercussions for that decision. You are a valued employee and we respect your decision.”\n   Tesla shut down production at Hayward in late March as part of the Bay Area’s shelter-in-place efforts to help slow the spread of coronavirus across the region. At times, the situation between Tesla and Alameda County turned testy, as in May, when Chief Executive Elon Musk said he would start up production in Fremont in violation of the shelter-in-place protocols.\n After Tesla sued Alameda County, and Musk threatened to move Tesla’s operations out of California, the company and the county reached a truce over the matters that allowed Tesla to restart vehicle production in line with county safety guidelines. Tesla also dropped its suit against Alameda County.", "posttime": "2020-06-19 11:40:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,特斯拉,worker", "title": "批评冠状病毒安全措施的特斯拉员工被解雇", "title_en": "Tesla worker who criticized coronavirus safety measures is terminated", "transed": 1, "url": "https://www.mercurynews.com/2020/06/18/tesla-worker-who-criticized-coronavirus-safety-measures-receives-termination-notice/", "via": "", "real_tags": ["病毒", "冠状病毒", "特斯拉", "worker"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007211, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JetBrains热爱所有编程语言和各种类型的开发人员！今年五月，Java就满25岁了！因此，我们要特别关注它，并庆祝我们喜欢Java和JVM的25个方面。\nJava几乎是独一无二的，因为它能够在现代版本的Java上运行25年前的代码。语言开发人员非常认真地对待向后兼容性，正因为如此，许多组织都乐于将Java作为他们的主要开发平台，因为他们知道代码在未来几年仍将在JVM上运行。\n在这里生活很长时间有很多好处。在过去的25年里，开发人员一直在用Java为各种行业和业务类型以及不同的平台编写应用程序。同时，在这25年中，开发人员一直在学校、大学、新兵训练营和工作中学习Java。这创造了一个巨大的生态系统，它有时间从经验中学习，并继续增长。Java，以及它可以解决的问题，都有很好的文档记录，并得到了供应商、非营利组织和个人的大力支持。对于我们这样的开发人员来说，非常重要的是，Java的成熟和广泛采用意味着想要用Java编写代码的开发人员有很多工作可做！\n与向后兼容和成熟相反，是平台和语言的演变。自2017年(Java9)以来，每六个月就会有一个新版本发布，这使得该语言有了源源不断的变化和改进。与预览功能相结合，该语言能够试验新的语法，从开发人员那里获得反馈，然后标准化新功能，这些新功能对于使用该语言的人来说工作得很好。\nJava很难在向后兼容和拥抱未来之间取得平衡。目前的方法是重视向后兼容性，每六个月发布一次，但长期支持版本每三年发布一次，这似乎取得了正确的平衡。该语言能够通过为将被移除的不推荐使用的功能提供警告，并通过替换任何可能消失的功能来进行发展。\n那些希望额外稳定的人可以留在长期的支持释放上。为了在升级时降低风险，他们可以定期针对每个新版本进行测试。那些乐于每六个月升级一次的用户可以在Java每次发布时更新到最新版本。想要在新语法标准化之前尝试新语法的开发人员可以启用预览功能，而那些想尽快这样做的开发人员甚至可以使用尚未发布的版本的早期访问版本。使用现代版本Java的团队真的可以拥有最好的一切。\n对于开发人员来说，标准可能没有语言功能那么令人兴奋，但是拥有针对Java、JavaEE和Jakarta EE以及开发人员遇到的常见用例的标准确实会使开发人员的工作变得更轻松。了解如何使用JDBC与数据库通信意味着我们不必关心数据库驱动程序是如何实现的，我们与其交互的方式总是相同的。JCP是用于确定Java标准的过程之一。\nJava语言规范涵盖了Java语言的外观以及编译器应该如何工作。它包括Java内存模型，它可以帮助我们预测应用程序可能的行为方式，而与JVM或硬件无关。Java虚拟机规范涵盖了JVM中的底层细节。这些规范使不同供应商分发的、运行在不同平台上的JDK能够以指定的、可预测的方式运行。这让我们找到了…\nWORA是Java背后的原始想法之一，如今这一点似乎如此明显，以至于我们甚至可能没有意识到它有多么开创性。我记得在一个非常非常大的组织工作，早在2002年，他们就从以前的技术堆栈转换到Java，仅仅是因为他们有很多不同的硬件，能够在上面运行新的Java应用程序，而不是必须为应用程序购买特定的硬件，这是他们将所有开发转移到Java的主要原因之一。在这个云时代，这可能看起来不那么重要，但事实上，仅仅因为我们不总是看到WORA在行动，并不意味着我们没有利用它。当然，如果您使用的是IntelliJ IDEA(或NetBeans)，那么您就是在利用桌面上的WORA。\n对于那些不太熟悉Java的人来说，这有时会让他们大吃一惊，但Java是一种非常高性能的语言。它是一个成熟的平台，经过25年的性能改进；有许多具有不同性能配置文件的垃圾收集器；JVM在运行时针对我们的实际生产用例优化了我们的代码-这比大多数人类开发人员所能做到的要好得多。例如，Java在金融领域被广泛使用，这依赖于低延迟事务和可预测的性能。\n自动垃圾收集是另外一件事，25年过去了，我们通常认为这是理所当然的。我们不必考虑如何在应用程序中分配内存，或者如何释放它。每个JVM都有一个或多个不同的GC算法，因此我们可以选择一个适合我们的应用程序的算法，而不必过多地关注内部，我们可以继续为我们的应用程序编写业务逻辑。\n如果我们对应用程序运行时发生的事情感兴趣，我们可以使用大量的工具。其中许多甚至是免费的，特别是因为Java飞行记录器和任务控制现在是OpenJDK的一部分(从Java11开始)。像JMX这样的工具甚至还允许我们动态管理我们的应用程序。\n我们刚才提到的许多特性都是JVM的特性，但是我们特别想强调JVM，以及它独立于Java语言的事实。热爱JVM的原因有很多，包括我们已经介绍过的一些内容：WORA、运行时优化、性能、供应商选择等，其中很大一部分是由于标准和规范而成为可能的。JVM也要与Java语言分开，这一点也很重要。这意味着可以在该平台上构建不同的语言，利用我们刚才提到的JVM的所有强大功能，同时提供不同类型的语法和语言功能。\nJava在Java6和Java8(Java7有一些很棒的特性，但对于Java开发人员来说并不像是一个大版本)中存活下来，甚至蓬勃发展的原因之一是因为其他JVM语言。在JetBrains，我们最喜欢的当然是Kotlin，但JVM是其他流行语言的平台，如Groovy、Scala、Clojure和JRuby，以及大量其他新的和重新实现的语言。在许多情况下，这些语言和经典Java之间的互操作性帮助我们接受并利用这种多样性。\n最有说服力的论据之一是我们有大量的库和框架可供选择，其中许多都是开放源码的，并且可以免费使用。流行的框架，如Spring，特别是Spring Boot，使得创建从小型服务到大型复杂的企业应用程序变得非常容易。标准意味着，当我们在另一个上下文中使用类似的东西时，理解和使用库通常并不困难。Java的成熟和社区对开放源码的早期采用意味着标准问题通常已经有了解决方案；没有必要重新发明轮子。这也意味着，由于这些解决方案中的许多已经存在并使用了很长时间：它们经过了良好的测试、充分的理解和良好的文档记录。\n贫穷的开发人员不得不在Internet上搜索某些未知的JAR文件的日子一去不复返了，这些JAR文件包含他们试图运行的代码显然需要的某些类。特别值得一提的是，Maven和Gradle不仅使构建和部署应用程序变得容易，而且还使以标准方式设置具有所有必需依赖项的项目变得容易。无论是在新项目中还是在现有项目中开始编码都很简单。像Maven Central和Binty这样的公共存储库为我们提供了查找(和发布)库的著名位置。\nJUnit创建于1997年，因此几乎和Java本身一样古老！它是迄今为止Java世界中最常见的自动化测试框架，JUnit和TestNG都随IntelliJ Idea一起提供，因为它假定任何新的Java项目都将需要测试框架。很可能所有语言的现代测试框架都基于我们现在从JUnit中习以为常的想法。Java社区的自动化测试文化在很大程度上要归功于这一个库。\n这是IntelliJ Idea博客，我们不会忘记的！无论您是否相信Java的冗长需要IDE，或者实际上Java能够真正利用IDE是因为它的静态类型，事实是Java开发人员喜欢他们的IDE(我们也喜欢您！)。学习有效地使用IDE(无论是IntelliJ IDEA、Eclipse还是NetBeans)可以显著提高开发人员的工作效率，这包括：代码完成和生成、运行测试、调试、导航和许多其他功能。Java开发人员通常非常热衷于IDE带来的好处。\nJava社区是一个庞大、成熟、充满活力和欢迎的社区。在世界各地的许多城市都有Java用户组，如果你不能参加物理会议，还会有一个虚拟Java用户组。Java冠军是Java世界公认的技术领袖，他们以分享对Java和JVM开发人员有用或有趣的东西而闻名。Java有一个庞大的开源社区，包括通过OpenJDK的JDK本身。Java社区重视学习、教学和持续改进，关心标准和“最佳实践”，并且对于如何在现实环境中应用这些非常务实。\n当然，社区是由人组成的，但当我问开发人员最看重Java的什么时，他们中的许多人都特别提到了Java世界中对他们产生影响的个人。这些人从同事和老师，到布莱恩·戈茨(Brian Goetz)、安吉·琼斯(Angie Jones)、乔治·萨布(Georges Saab)、马拉·古普塔(Mala Gupta)、文卡特·苏布拉马尼亚姆(Venk。有些人甚至提到了我。就我个人而言，我来到Java是因为我在大学里学到了Java，那里有很多工作，但我留下来是因为我喜欢那里的人们，以及他们给我的帮助和支持。\nJava通过Javadoc使API文档成为该语言的关键部分。三种不同类型的注释(Javadoc、块和行)清楚地指示了开发人员要留下的注释类型。Javadoc特别鼓励开发人员为调用方法或使用类或包的其他开发人员留下有用的文档。如果开发人员找不到有关库或代码段的详细教程信息，通常有Javadoc可以帮助他们指明正确的方向。\n此外，Java生态系统似乎通常希望(并为)开发人员提供高质量的文档。我们鼓励开放源码项目的潜在提交者提交Javadoc评论或其他文档的拉取请求，世界各地的开发人员可以在StackOverflow或博客上询问和回答有关特定问题的解决方案的问题。\nJava社区不仅很早就接受了开源，现在JDK本身也通过OpenJDK实现了开源。开源使多个供应商和个人更容易参与和协作。能够查看Java本身的代码也很有趣。开放源码为像我们这样的开发人员提供了一个很好的机会，可以向那些已经做了所有艰苦工作、思考和解决复杂问题的人学习。\nJava平台和Java生态系统中使用的许多最流行的工具不需要开发人员(甚至通常是盈利组织)付费使用。即使在Oracle改变了它在Java11中的许可和支持之后，他们(和许多其他供应商)仍然提供了在生产中免费使用该语言的方法。本文中已经提到的开放源码项目、构建工具和IDE要么都是免费的，要么都有免费选项。这使得Java对开始编码的开发人员和需要在关注预算的同时构建软件的各种规模的组织都很有吸引力。\n当然，面向对象编程并不是唯一的选择，每种范例都有其优缺点。Java从一开始就被设计为一种面向对象语言，并且用Java演示了许多面向对象的设计模式和其他编码最佳实践的示例。如果您想要一种面向对象的编程语言，那么Java应该是您首选的选择。\nJava过去是，现在仍然是一种面向对象的编程语言。但它也成功地采用了函数式编程中的一些概念(如lambda表达式和不可变的数据结构)，并使它们在OO范例中很好地工作。类型推断(例如var)允许我们仍然拥有静态类型语言的好处，但是使用的样板更少。计算机科学仍然是一门相对年轻的学科，但随着我们学到一些东西，它们可以应用于我们现有的工具。Java(语言和整个生态系统)正在根据新的趋势和新的“最佳实践”不断发展，也是在现实世界中看到事情如何发展的结果。\nJava还可以从其他JVM语言的语法和思想中获益，看看哪些可以工作，哪些可能不适合传统的Java世界。甚至Java用来发展和增长的进程和工具，如JCP和OpenJDK，也在不断调整自身以保持与不断发展的关系。这种进化和适应是Java必须达到的谨慎平衡的一部分。\nJava代码通常是可读的，即使对于非Java程序员也是如此。该语言倾向于更加冗长，而不是过于简练，这使得我们在阅读Java代码时更容易对其进行推理。语言开发人员还没有实现像操作符重载这样的功能，因为他们认为不要对意外的自定义行为感到惊讶是很重要的。有一种在语言和框架中避免“魔术”的趋势--尽管一些框架会使用约定而不是配置这样的东西来做事情，而不需要开发人员强制执行。例如，肯定已经不再使用注释进行大量的AOP，而是更多地使用注释进行文档和静态分析检查。社区和生态系统倾向于喜欢标准和“最佳实践”，因此即使在非常不同的项目上，Java代码也经常遵循类似的规则。\n我们已经介绍了23个我们喜欢的Java特性，但没有提到一个特性！老实说，这是因为将自己限制在只有25个特性上似乎极其困难，还因为我们喜欢Java的许多事情与语法或特性无关。我们想向开发人员最喜欢的一些特性发出光荣的呼喊：\n收藏品API：它已经和我们在一起很长时间了，并且为我们提供了很好的服务！\nStreams API：集合API的一个非常好的补充，很高兴看到它从Java8开始就在不断发展。并行流增加了一种利用现代硬件的新方法。\nLambda表达式：对于Streams API特别有用，但本身也非常方便。\n可选：一种很好的表达方法可能不会给您带来什么的方式(这样我们就不必保护自己不受NullPointerExceptions的影响了！)。很高兴看到自Java8以来对可选的每一项改进。\n受控异常：人们对受控异常和运行时异常的看法不一，但至少对于那些希望使用它们的人来说，受控异常是存在的。\n注释：注释类似于(尤其是)编译器可以检查的文档，或者类似于框架执行某些繁重任务的注释。\n访问修饰符和模块性：Java使得明确哪些代码可以访问哪些字段、方法、类和模块变得更加容易(从Java9开始更是如此)。\n有用的NullPointerException：谁不喜欢好的NullPointerException呢？现在，这些异常为开发人员提供了更多关于哪些内容为空的有用信息。\n预览功能：我们喜欢预览功能！我们对记录、instanceof的模式匹配和文本块感到非常兴奋。\n我们还有一段视频展示了所有这些功能，当然是IntelliJ Idea！\n我们每六个月就会有新的特性，而且每个LTS版本通常都会为在其上运行的任何应用程序提供更好的开箱即用的性能。Java15(2020年9月)应该有：隐藏类；文本块(不再预览)；记录的更新预览；instanceof的模式匹配；以及密封类的预览。\n在更远的将来，我们也希望看到：易于使用，与Project Loom的轻量级并发；Project Valhara的内联类型；Project Amber的更多语言更改，如lambda剩余；Project巴拿马将使程序员更容易访问外国API；由于Project Leydon，启动时间更短；对各种垃圾收集器的更多改进；等等。", "note_en": "JetBrains loves all programming languages, and developers of all types! This May, Java turns 25 years old! So we want to pay it special attention, and celebrate 25 things we love about Java and the JVM.\n    Java is almost unique in being able to run code from 25 years ago on a modern version of Java. The language developers take backwards compatibility very seriously, and because of this many organisations are happy to make Java their primary development platform, knowing that the code will still run on the JVM for years to come.\n  There are plenty of advantages to having been around for a long time. For the last 25 years, developers have been writing applications in Java for a huge range of industries and business types, and for different platforms. Meanwhile, over these 25 years, developers have been learning Java in schools, universities, boot camps, and on the job. This has created a large ecosystem that has had time to learn from experience and continues to grow. Java, and the problems it can solve, is well documented and well supported by  vendors and non-profit organisations and  individuals. Very importantly for developers like us, the maturity and broad adoption of Java means there are plenty of jobs for developers who want to code in Java!\n  In contrast to backwards compatibility and maturity, is the evolution of the platform and the language. Since 2017 (Java 9) there’s been a new release every six months, which has enabled a steady stream of changes and improvements to the language. Combined with  Preview Features, the language is able to experiment with new syntax, get feedback from developers, and then standardise new features that really work well for those who use the language.\n  Java has a difficult balance to strike between backwards compatibility and embracing the future. The current approach of valuing backwards compatibility and releasing every six months, but with a  Long Term Support release every three years, seems to strike the right balance. The language is able to evolve by providing warnings for deprecated features  that will be removed, and by having replacements for anything that might go away.\n Those who wish for extra stability can stay on a Long Term Support release. To reduce their risk when it does come time to upgrade, they could be regularly testing against every new release. Those who are happy to upgrade every six months can update to the latest version of Java every time it comes out. Developers who want to try out new syntax even before it’s standardised can  enable preview features, and those who want to do so as soon as possible can even use the  Early Access release of a version that’s not out. Teams using modern versions of Java really can have the best of all worlds.\n  Standards might not be as exciting to a developer as language features, but having standards for Java, for  Java EE and  Jakarta EE, and for common use-cases that developers run into, does make a developer’s life easier. Understanding how to use JDBC to talk to a database means that we don’t have to care about how the database driver is implemented, the way we interact with it is always the same. The  JCP is one of the processes used to determine standards for Java.\n The  Java Language Specification covers what Java-the-language looks like and how the compiler should work. It includes the  Java Memory Model, which can help us to predict how an application might behave, regardless of JVM or hardware. The  Java Virtual Machine Specification covers the lower-level details down in the JVM. These specifications enable JDKs distributed by different vendors, running on different platforms, to behave in specified, predictable ways. Which leads us to…\n  WORA was one of the original ideas behind Java, which seems so obvious these days that we might not even realise how ground-breaking it was. I remember working for a very, very large organisation who, back in 2002, switched from their previous technology stack to Java simply because they had a lot of different hardware lying around, and being able to run new Java applications on it instead of having to buy specific hardware for applications was one of the main reasons they moved all their development to Java. In this day and age of Cloud this might seem less relevant, but in fact just because we don’t always see WORA in action does not mean we’re not still taking advantage of it. And of course, if you’re using  IntelliJ IDEA (or NetBeans) you’re taking advantage of WORA on the desktop.\n  It sometimes comes as a surprise to those who are less familiar with Java, but Java is a very high-performance language. It’s a mature platform that has 25 years of performance improvements; numerous garbage collectors with different performance profiles; and the JVM optimises our code at runtime for our real production use-cases far better than most human developers ever could. Java is used extensively in the finance world, for example, which depends on low-latency transactions and predictable performance.\n  Automatic Garbage Collection is something else that, 25 years on, we generally take for granted. We don’t have to think about how memory is allocated in our applications, or how to free it. Each JVM has one or more different GC algorithms, so we can pick one that works well for our application without having to concern ourselves too much with the internals, we can just get on with writing the business logic for our applications.\n  If we are interested in what’s going on while our application is running, there are a huge number of tools available to us. Many of them are even free, particularly since  Java Flight Recorder and  Mission Control are now part of OpenJDK (since Java 11). Tools like  JMX even allow us to dynamically manage our applications too.\n  Many of the features we’ve just mentioned are features of the  JVM, but we specifically want to call out the JVM, and the fact that it’s separate from Java-the-language. There are many reasons to love the JVM, including some of the things we’ve already covered: WORA, runtime optimisations, performance, vendor choice, etc., much of which is made possible because of standards and specifications. It’s important that the JVM is separate from Java-the-language, too. It means different languages can be built upon the platform, taking advantage of all the great features of the JVM we’ve just mentioned while providing different types of syntax and language features.\n  One of the reasons Java survived, even thrived, in those quiet years between Java 6 and 8 (Java 7 has some great features but it didn’t feel like a big release for Java developers) is because of the other JVM languages. At JetBrains of course our favourite is  Kotlin, but the JVM is a platform for other popular languages like  Groovy,  Scala,  Clojure and  JRuby, and a huge number of other  new and re-implemented languages. In many cases,  interoperability between these languages and classic Java helps us to embrace and leverage this variety.\n  One of the most compelling arguments is the huge amount of choice of libraries and frameworks we have, many of which are Open Source and free to use. Popular frameworks like  Spring, and  Spring Boot in particular, make it easy to create anything from small services to large and complex enterprise applications. Standards mean that often it’s not hard to understand and use a library when we’ve been using something similar in another context. The maturity of Java, and the community’s early adoption of open source, means that there’s usually an existing solution for standard problems; there’s no need to re-invent the wheel. It also means that since many of these solutions have been around, and in use, for a long time: they’re well tested, well understood, and well documented.\n  Long gone are the days when a poor developer had to search on the internet for some unknown  JAR file containing some class that the code they are trying to run apparently requires. Maven and Gradle, in particular, made it easy to build and deploy an application, of course, but also to set up a project in a standard way with all the required dependencies. It’s straightforward to start coding in either a new or existing project. Public repositories like  Maven Central and  Bintray give us well-known places to find (and publish) libraries.\n  JUnit was  created in 1997 so is nearly as old as Java itself!  It is by far the most common automated testing framework in the Java world, and  both JUnit and TestNG are shipped with IntelliJ IDEA since it’s assumed a testing framework will be needed with any new Java project. It’s likely that modern testing frameworks for a whole range of languages are based on the ideas we now take for granted from JUnit. The Java community’s culture of automated testing owes a lot to this one library.\n  This is the IntelliJ IDEA blog, we weren’t going to forget this one! Whether you believe the verbosity of Java requires an IDE, or that actually Java can really leverage an IDE because of its static typing, the fact is that Java developers love their IDEs (and we love you!). Learning to use an IDE effectively (whether it’s IntelliJ IDEA, Eclipse, or NetBeans) can significantly improve a developer’s productivity, via:  code completion and  generation,  running tests,  debugging,  navigation, and a  bunch of other features. Java developers are usually extremely enthusiastic about the benefits an IDE brings.\n  The Java Community is a large, mature, vibrant, and welcoming community. There are  Java User Groups in many cities worldwide, and a  Virtual Java User Group if you can’t get to a physical meetup. The  Java Champions are recognised technical leaders in the Java world who became known for sharing things that are useful or interesting for Java and JVM developers. Java has a huge Open Source community, including the JDK itself via  OpenJDK. The Java Community values learning, teaching, and constant improvement, cares about standards and “best practice”, and is pragmatic about how to apply these in a real-world environment.\n  The Community is made up of people, of course, but when I asked what developers value most about Java, many of them specifically called out individuals in the Java world who had impacted them. These range from colleagues and teachers, to people like  Brian Goetz,  Angie Jones,  Georges Saab,  Mala Gupta,  Venkat Subramaniam. Some people even mentioned  me. Personally, I came to Java because I learnt it at university and there were plenty of jobs, but I stayed because I love the people and the help and support I’ve had from them.\n  Java makes API documentation a key part of the language via  Javadoc. The three different types of comments ( Javadoc, block and line) clearly indicates what sort of commentary a developer is leaving. Javadoc specifically encourages developers to leave helpful documentation for other developers who call a method, or use a class or package. If a developer cannot find detailed tutorial information on a library or piece of code, there’s usually Javadoc that can help point them in the right direction.\n In addition, the Java ecosystem generally seems to expect (and provide) good quality documentation for developers. Prospective committers to open source projects are encouraged to submit pull request of Javadoc comments or other documentation, and developers all over the world  ask and answer questions on StackOverflow, or blog about solutions to specific problems.\n  Not only did the Java community embrace open source early on, but now the JDK itself is open source too via  OpenJDK. Open source makes it easier for multiple vendors, and individuals, to be involved and collaborate. It’s also fascinating to be able to look at the code of Java itself. Open source code provides a great opportunity for developers like us to learn from people who have already done all the hard work thinking about and solving complicated problems.\n  The Java platform and many of the most popular tools used in the Java ecosystem don’t require a developer (or often even a profit-making organisation) to pay money to use them. Even after Oracle  changed its licensing and support in Java 11 they (and many other vendors) still  provided a way to use the language for free in production. The open source projects, build tools, and IDEs already mentioned in this article are all either free or have a free option. This makes Java appealing for developers getting started with coding, and for organisations of all sizes who need to build software while keeping an eye on the budget.\n  Object-oriented programming is not the only game in town, of course, and every paradigm has its advantages and disadvantages. Java was designed as an OO language right from the start, and many examples of design patterns and other coding best practice for OO are demonstrated in Java. If you want an object-oriented programming language, Java should be high on your list of ones to try.\n  Java was, and still is, an object-oriented programming language. But it has also successfully adopted some concepts from functional programming (like lambda expressions and immutable data structures) and made them work nicely within the OO paradigm. Type inference (for example  var) allows us to still have the benefits of a statically typed language, but with less boilerplate. Computer science is still a relatively young discipline, yet as we learn things they can be applied to our existing tools. Java (the language and the whole ecosystem) is constantly evolving according to new trends and new “best practices”, and also as a result of seeing how things work out in the real world.\n Java also gets to benefit from syntax and ideas from other JVM languages, to see what works and what perhaps might not fit in a classic Java world. Even the processes and tools that Java uses to evolve and grow, such as the  JCP and  OpenJDK, are also adapting themselves to stay relevant in this constant evolution. This evolution and adaptation is part of the careful balance Java has to strike.\n  Java code is often readable, even for non-Java programmers. The language leans towards being more verbose rather than over-concise, which makes it easier to reason about Java code when we’re reading it. The language developers have not implemented features like operator overloading, as they feel it’s important to not be surprised by unexpected custom behaviour. There’s a tendency to avoid “magic” in the language and the frameworks – although some frameworks will use things like  Convention over configuration to do things without a developer having to be imperative about it. There’s definitely been a move away from,for example, doing lots of  AOP with annotations, and more towards using annotations for documentation and static analysis checks. The community and ecosystem tend to like standards and “best practice”, so Java code often follows similar sorts of rules even on very different projects.\n  We’ve covered 23 Things We Like About Java but haven’t mentioned a single feature! To be honest, it’s because limiting ourselves to just 25 features seemed extremely difficult, and also because lots of the things we love about Java are not about the syntax or features. We’d like to give an honourable shout out to some of developers’ favourite features:\n Collections API: it’s been with us a long time and served us well!\n  Streams API: a very nice addition to the collections API, and great to see it evolving even since Java 8. Parallel streams added a new way to utilise modern hardware.\n Lambda Expressions: particularly useful with the Streams API, but very handy in its own right.\n Optional: a nice way to express that a method might not give you something (and stops us having to protect against NullPointerExceptions!). Really nice to see each improvement to Optional since Java 8 as well.\n  Checked exceptions: people are divided on checked vs runtime exceptions, but at least checked exceptions are there for those who wish to use them.\n Annotations: annotations are like (among other things) documentation that the compiler can check, or notes for a framework to do some heavy lifting.\n   Access modifiers and  modularity: Java makes it easy (even more so since Java 9) to be explicit about which code can access which fields, methods, classes, and modules.\n  Helpful NullPointerExceptions: who doesn’t love a good NullPointerException? Now the exceptions give developers much more useful information about what was null.\n Preview features: we love preview features! We’re very excited about  Records;  Pattern matching for instanceof; and  Text Blocks.\n We also have a video  showing all of these features, in IntelliJ IDEA of course!\n  We’re getting new features every six months, and each of the LTS releases usually provides better performance out of the box for any application running on it. Java 15 (September 2020) should have:  Hidden Classes; Text Blocks (no longer preview); updated previews for Records; Pattern matching for instanceof; and a preview of  Sealed Classes.\n Further into the future we also hope to see: easy to use, lightweight concurrency with  Project Loom; Inline Types from  Project Valhalla; more language changes from  Project Amber, like lambda leftovers;  Project Panama will make it easier for programmers to access foreign APIs; shorter startup times thanks to  Project Leydon; more improvements to various Garbage Collectors; and so much more.", "posttime": "2020-06-19 10:29:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "java,喜爱,love", "title": "Java让我们喜爱的地方", "title_en": "Things We Love About Java", "transed": 1, "url": "https://blog.jetbrains.com/idea/2020/05/25-things-we-love-about-java", "via": "", "real_tags": ["java", "喜爱", "love"]}, {"category": "", "categoryclass": "", "imagename": "80eec40ca253500b55cbb99202674be7.jpg", "infoid": 1007210, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Windows 10 2020年5月10日更新版(也称为20H1)是该操作系统今年的第一次重大升级，已经开始在一些PC上推出。随着2020年5月的更新，微软还引入了Windows段堆内存改进，这将减少Win32应用程序(如Google Chrome)的总体内存使用量。\n微软表示，2020年5月的更新带来了一个名为“SegmentHeap”的有用变化，它应该会减少内存使用，Chrome等网络浏览器就是其中的受益者之一。这是对开发人员可用的技术更改，它只适用于Windows10 2004版或更高版本。\nSegmentHeap是一个现代的堆实现，当开发人员启用它时，它将减少Win32应用程序的总体内存使用量。\n微软宣布，它已经将基于Chromium的Edge浏览器修改为使用SegmentHeap值，早期测试显示内存使用量减少了27%。\n谷歌也喜欢这个想法，并打算在Chrome上采用它。Chrome工程师在提交时指出，将“SegmentHeap”条目添加到浏览器的清单中将允许Windows102004版使用段堆而不是遗留堆。\n“在每台计算机上选择加入chrome.exe的段堆的实验表明，这可以在某些计算机上的浏览器和网络服务实用程序进程中节省数百MB。实际结果将大相径庭，最大的节省来自于多核机器。“谷歌说。\n微软和谷歌证实，实际结果将差异很大，这意味着个人表现可能低于或高于27%，但这一变化肯定会在一定程度上降低内存使用量，并为每个人提供更好的体验。\n例如，采用多核处理器的设备将获得最大好处。虽然这是一个值得欢迎的变化，但Google Chrome还不支持“SegmentHeap”。\n谷歌工程师指出，至少有一个障碍，这将要求该公司使用Windows10Build 19041.0 SDK构建Chrome。\n“我们现在可以启用它，但这会导致生成警告。因此，在切换到Windows10.0.19041.0SDK时，启用它会被阻止，而Windows 10.0.19041.0SDK目前由于一些神秘的构建失败而被阻止，“Google指出。\n目前，还不清楚这些改进何时会在Google Chrome for Windows10 2004版(2020年5月更新)中落地。", "note_en": "Windows 10 May 2020 Update (also known as 20H1) is the first major upgrade for the OS this year and  it has already begun arriving on some PCs. With May 2020 Update, Microsoft has also introduced Windows segment heap memory improvements, which will reduce overall memory usage of Win32 apps such as Google Chrome.\n Microsoft  says that May 2020 Update comes with a useful change called “SegmentHeap” that should reduce memory usage, with web browsers such as Chrome being one of the beneficiaries of this. It is a technical change available to developers and it works only on Windows 10 version 2004 or newer.\n   SegmentHeap is a modern heap implementation and it will reduce Win32 apps overall memory usage when enabled by developers.\n Microsoft  announced that it has already modified Chromium-based Edge browser to use the SegmentHeap value, with the early tests showing a 27% reduction in memory usage.\n Google has also liked the idea and is going to adopt it for Chrome. In a commit, Chrome engineer  notes that adding “SegmentHeap” entry to the browser’s manifest will allow Windows 10 version 2004 to use the segment heap instead of the legacy heap.\n  “Experiments with per-machine opting-in to the segment heap for chrome.exe suggests that this could save hundreds of MB in the browser and Network Service utility processes, among others, on some machines. Actual results will vary widely, with the greatest savings coming on many-core machines,” Google said.\n Microsoft and Google confirmed that the actual results will vary widely, which means individual performance could be lower or higher than 27%, but this change will definitely reduce memory usage to some extent and provide a better experience for everyone.\n For example, devices with multiple-core processors will get the most benefit. While this is a welcome change, support for ‘SegmentHeap’ is not yet available in Google Chrome.\n Google engineer noted that there is at least one roadblock and it would require the company to build Chrome with Windows 10 Build 19041.0 SDK.\n  “We could enable it now but that would cause build warnings. Therefore enabling it is blocked on a switch to the Windows 10.0.19041.0 SDK which is currently blocked on some mysterious build failures,” Google noted.\n At the moment, it’s unclear when these improvements will land in Google Chrome for Windows 10 version 2004 (May 2020 Update).", "posttime": "2020-06-19 10:10:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,windows-10,google,chrome,解决", "title": "Windows 10功能将解决Google Chrome的最大问题", "title_en": "Windows 10 feature will fix Google Chrome’s biggest problem", "transed": 1, "url": "https://www.windowslatest.com/2020/06/18/google-chrome-will-finally-use-less-memory-on-windows-10/", "via": "", "real_tags": ["windows", "google", "chrome", "解决"]}, {"category": "", "categoryclass": "", "imagename": "bec2e439d1731cc9f7315b0bbf32294a.png", "infoid": 1007209, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这周我一直在看关于嘿，苹果和应用程序购买的新闻。许多人都提出了他们对这种情况的看法，我不禁感到似曾相识。\n哇。我简直惊呆了。苹果刚刚加倍拒绝了嘿&#39；提供漏洞修复和新功能的能力，除非我们屈服于他们要求我们收入的15%-30%的无耻要求。更糟糕的是：我们被告知，除非我们遵守，否则他们将删除该应用程序。\n-dhh(@dhh)2020年6月16日。\n嘿向App Store提交他们的应用程序，这是一项付费服务。没有办法在应用程序上注册嘿，因为嘿不想给苹果所有交易的30%。\n嘿提交了错误修复更新，但被拒绝了，因为它们不提供用户在购买应用程序时注册的方式。\n2014年，同样的事情也发生在我以前的公司Restock上。Restock是一款基于订阅的街头服饰购物应用。我们在我们的网站上使用Strike提供服务订阅，并在App Store上提供一个配套的应用程序。\n2014年7月，我向App Store提交了Restock 1.0。App Store上的这款应用程序的标题是Restock(仅限现有会员)“。苹果批准了这款应用。\n没有办法在这款应用程序中注册。当你下载这款应用程序时，你唯一看到的就是一张登录表。所有的营销都发生在App Store之外。\n几个月后，也就是10月份，我搞砸了一次更新。推送通知现在已中断。我很快发现了问题，并向App Store提交了一个新版本。由于当时的App审核时间长达7天，我申请并获得了加速审核请求。\n这可能是我的错。几个小时后，苹果给我发了一封电子邮件，说他们对我提交的应用程序有反馈。\n这不是苹果公司经常发送的拒绝邮件。这可能是因为审查速度加快了，但我想知道这是否意味着我们的审查在内部升级到了另一个团队。\n现在，我不能给你看苹果对我说了什么，因为苹果清除了旧的“解决方案中心”通信1。但这是我对发生的事情的记忆：\n我向苹果指出，我不允许用户通过iPhone注册，只允许在网站上注册-应用程序的名称甚至包括在内(仅限现有会员)“！\n苹果公司回复说，他们不在乎，因为人们需要有一种方式来注册这款应用程序，因为这款应用程序在没有登录的情况下是毫无用处的。我们必须在应用程序购买中实施，以使更新获得批准，并确保应用程序的当前版本不会从应用程序商店中删除。\n接下来发生了一件显而易见的事情。我没有准备好与苹果公司抗争。所以，我投降了，狂热地花了一整晚的时间来实施应用程序购买。没有太多的选择--请记住，这是从试图修复应用程序中的一个关键错误开始的，用户对此很不满意。\n对我来说，这场“嘿”争论唯一令我惊讶的事情是，终于有人为他们多年来一直在做的事情而呼吁苹果公司(Apple)。我希望它能很快改变。\n在我意识到他们这样做后，我觉得苹果不会直接通过电子邮件就应用程序问题进行沟通，这对我来说更有意义了。他们只在没有日志的地方通过电话联系开发人员，或者通过他们自己的通信工具删除旧消息。这无疑让苹果掌控了一种叙事。↩", "note_en": "I’ve been reading the news this week about  Hey, Apple, and in app purchases. Many people have  offered  their  takes on the situation, and I can’t help but feel déjà vu.\n Wow. I&#39;m literally stunned. Apple just doubled down on their rejection of HEY&#39;s ability to provide bug fixes and new features, unless we submit to their outrageous demand of 15-30% of our revenue. Even worse: We&#39;re told that unless we comply, they&#39;ll REMOVE THE APP.\n— DHH (@dhh)  June 16, 2020\n  Hey submits their app, which is a paid service, to the App Store. There is no way to sign up for Hey from the app since Hey doesn’t want to give Apple 30% of all transactions.\n  Hey submits a bug fix update and is rejected because they do not offer a way for users to sign up with in app purchases.\n In 2014, the same thing happened to my former company,  Restocks. Restocks was a subscription-based shopping app for streetwear. We offered subscriptions to the service on our website using Stripe, and a companion app on the App Store.\n    In July of 2014, I submitted Restocks 1.0 to the App Store. The title of the app on the App Store was   Restocks (for existing members only)”. Apple approved the app.\n There was no way to sign up in the app. When you downloaded the app, the only thing you saw was a log-in form. All marketing happened outside of the App Store.\n  A couple of months later, in October, I botched an update. Push notifications were now broken. I quickly identified the problem and submitted a new build to the App Store. Since App Review at the time took up to 7 days, I applied for and was granted an expedited review request.\n   This may have been my mistake. A couple of hours later, Apple sends me an email saying they have  feedback for my App submission.\n   This is not the regular rejection email that Apple sends. This may have been because of the expedited review, but I wonder if it means that our review got escalated to a different team internally.\n Now, I can’t show you what Apple said to me, because Apple   purges old   Resolution Center” communications  1. But here’s my memory of what happened:\n I pointed out to Apple that I didn’t allow users to sign up via the iPhone, only on the website — the name of the app even included   (for existing members only)”!\n Apple replied that they didn’t care, because there needed to be a way for people to sign up in the app, since the app was useless without signing in. We had to implement In App Purchases to get the update approved and to ensure the current version of the app was not removed from the App Store.\n  The obvious thing happened next. I wasn’t prepared to fight against Apple. So, I capitulated and feverishly spent all night implementing in app purchases. There wasn’t much of a choice — remember that this began with trying to fix a critical bug in the app, and users were unhappy.\n The only surprising thing to me about this Hey controversy is that someone is finally calling out Apple for something they’ve been doing for years. I hope it changes soon.\n After I realized that they do this, it made a lot more sense to me that Apple doesn’t directly communicate about app issues via email. They only contact developers over the phone where there isn’t a log, or via their own communication tools where they scrub old messages. This definitely lets Apple control a narrative. ↩", "posttime": "2020-06-19 09:52:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,苹果公司,gave", "title": "早在2014年，苹果公司就给了我嘿待遇", "title_en": "Apple gave me the Hey treatment back in 2014", "transed": 1, "url": "https://ylukem.com/blog/apple-gave-me-the-hey-treatment-back-in-2014", "via": "", "real_tags": ["苹果", "app", "apple", "苹果公司", "gave"]}, {"category": "", "categoryclass": "", "imagename": "dec6e8d44e17b0c4f0b2618538293283.jpeg", "infoid": 1007208, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在主板的报告之后，这些服务器和它们的所有者一起被永久禁止。这些服务器上到处都是交易和出售从仅限订阅的网站上窃取的内容的人。", "note_en": "Following Motherboard's reporting, the servers—which were full of people trading and selling content ripped from subscriber-only sites—were permanently banned, along with their owners.", "posttime": "2020-06-19 09:35:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "专用,removes,内容", "title": "不和谐移除专用于盗版色情的服务器", "title_en": "Discord Removes Servers Dedicated To Pirating Porn", "transed": 1, "url": "https://www.vice.com/en_us/article/y3zwgg/discord-servers-onlyfans-leak-pirating-porn", "via": "", "real_tags": ["专用", "removes", "内容"]}, {"category": "", "categoryclass": "", "imagename": "cd7ac917fa0cce39c24077f9992fb8b5.jpeg", "infoid": 1007207, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "它每隔几周就会在社交媒体上传播一次，每次都会获得数千股-通常是在新闻机构宣布裁员或亏损的时候。有人问，为什么新闻业仍然不能花几美分阅读一篇文章，而是购买订阅？\n这一想法的倡导者会说，有很多网站他们不会考虑订阅，但会偶尔阅读一些故事。但他们被付费墙拒绝了。考虑到这种需求，一种简单的交叉出版机制，比如为一篇文章支付20美分，或为一篇特写支付50美分，肯定会增加收入。\n这个想法肯定是这个星球上的主要出版商想到的。出版商可能会被指责对互联网的觉醒很慢，但他们并不是那么慢，也不太可能把钱留在桌子上。\n但事实证明，有一长串理由是你不能通过这篇文章支付新闻费的-也是为什么你不应该指望看到这个想法很快流行起来的原因。\n出版商不愿采用这一机制的核心原因之一是，大多数出版物都被设想为一揽子交易。高端网点希望与订户签约，特别是定期付款计划。这意味着你决定一次，然后你的成本是看不见的。如果订阅包括印刷产品，这也会极大地增加您对广告商的价值。平均而言，一份新的订阅可能会为一份出版物带来数百美元的年收入。\n目前，大多数用户在这样的网站上遇到新的和诱人的内容时，只会在点击付费墙时点击离开-但一小部分人会订阅。如果增加支付20美分的第三个选项，每组都会有一些人选择这个选项。\n但是，如果订阅对出版商来说每年价值100美元，那么即使是一个人点击20美分的按钮，也意味着出版商需要500人购买文章来弥补收入的损失。不同门店的比率是不同的，但数学计算仍然令人望而生畏。\n还有一个哲学上的反对意见。正如前面提到的，报纸和杂志被认为是一个包裹--轻和重的混合体。有些故事的制作成本比其他故事高得多，但这是平衡的，因为你买了整个故事。如果你把它们分开，这个逻辑就消失了。\n分析工具Charteat的创始人托尼·海尔(Tony Haile)表示，订阅报纸或杂志与按文章付费的区别在于，他现在是Scroll的首席执行官。Scroll是一家初创公司，通过一款应用程序提供各种出版物的无广告浏览，最容易理解的是健身房会员资格。\n“在Equinox或类似的地方，你每月可能要付100美元。现在，你确实有了单一服务的东西--Barry‘s BootCamp和SoulCycle等等，“他说。“它们都贵得离谱，这很管用。\n“如果你使用小额支付版的健身房会员卡，就会说，‘我可以来，我可以付几英镑，我想什么时候去健身房就可以什么时候去健身房。’没有一家健身房是这样运作的。“。\n如果一家直销店想要尝试按文章付费的模式，它可能会奏效-但价位可能会比我们通常讨论的几美分高得多。海尔说，这变得更加棘手，因为信息从根本上不同于其他领域。\n游戏可能是小额支付最大的胜利。但是在游戏中，你事先知道你要买的是什么--三条额外的生命，一百个硬币，随便什么。对于一篇新闻文章，你只有在读完之后才会知道你是否喜欢它。\n而游戏公司只需与几个大的合作伙伴打交道就能使其发挥作用。媒体公司将需要为用户设计一种低摩擦的方法，让用户跨数十家不同出版商拥有的网站付费，而不需要每次都有新的登录和用户名。这将需要许多网站立即冒险，就一个系统和一个支付提供商达成一致-想必这将需要收取一定的费用才能继续运营。\n“这是海尔的媒体第一定律，”他说。“任何项目的成功都与需要出版商合作的数量成反比。”\n在英国，有一家公司正在尝试这样做。Axate是由多米尼克·杨(Dominic Young)创立的，他之前领导了鲁珀特·默多克(Rupert Murdoch)推动全行业合作的计划。但他们发现，最愿意冒险加入的出版商是那些还没有从订阅中赚钱的出版商。Axate推出的出版物很少，因此文章也不多。\n出版商Archant的马特·凯利(披露：我在它的一份出版物上有一个专栏)是第二个加入的人。他表示：“事实上，它对我们的业务影响很小。”“我们觉得最终我们需要尝试一种不同的方式来让人们支持我们。”\n还有更多的问题-难以区分哪些内容是付费的，哪些是免费的，广告的挑战，中间商的问题。但它们都构成了一个核心问题。\n读者愿意挑选最好的内容，并且比他们订阅时支付的费用更低。但没有任何组织-媒体公司、电视网或唱片公司-只能制作热门节目。他们也不应该尝试。\n因此，当我们都需要更多的收入时，这最终相当于收入的减少。我们等小额支付已经等了25年了。看起来，在这个时刻，他们可能永远不会到达。\n美国从来没有比现在更需要一个媒体监督机构吗？帮助我们今天加入CJR。", "note_en": "It circulates every few weeks on social media, and gets thousands of shares each time—often when a news outlet has announced layoffs or losses. Why, someone asks, has the journalism industry still not made it possible to pay a few cents to read a single article, instead of buying a subscription?\n There are many sites, advocates of the idea will say, for which they would not consider a subscription but would read the occasional story. But they are denied by a paywall. Given that demand, a simple cross-publication mechanism to pay, say, twenty cents for an article, or fifty cents for a feature, would surely be a revenue-raiser.\n The idea has definitely occurred to major publishers across the planet. Publishers can be accused of being slow to wake up to the internet, but they’re not that slow, nor that likely to leave money on the table.\n But there is, it turns out, a long list of reasons you can’t pay for journalism by the article—and why you shouldn’t expect to see the idea catch on anytime soon.\n One of the core reasons publishers are reluctant to adopt this mechanism is that most publications are conceived as package deals. Premium outlets want to sign up subscribers, especially on recurrent payment plans. That means you decide once, and then the cost to you is invisible. If the subscription includes a print product, this also vastly increases your value to advertisers. A single new subscription might be worth, on average, hundreds of dollars of annual revenue to a publication.\n At the moment, most users encountering new and tempting content on such a site will just click away when they hit the paywall—but a small fraction will subscribe. If a third option of paying twenty cents is added, some from each group will choose that.\n  But if a subscription is worth a hundred dollars a year to a publisher, then even one person clicking on the twenty-cent button instead means the publisher needs five hundred people to buy articles to make up for the lost revenue. The ratios are different for different outlets, but the math remains intimidating.\n There’s also a philosophical objection. As noted, newspapers and magazines have been conceived as a package—a mix of the light and the heavy. Some stories cost far more to produce than others, but it balances out because you buy the whole thing. That logic dies if you separate them out.\n The difference between subscribing to a newspaper or a magazine and paying per article is, says Tony Haile, the founder of analytics tool Chartbeat and now chief executive of Scroll, a startup providing ad-free browsing of various publications through an app, best understood in terms of gym memberships.\n “At Equinox or somewhere like that, you might pay a hundred dollars a month. Now, you do have the single-serving thing—Barry’s Bootcamp and Soulcycle and so forth,” he says. “They’re all ridiculously expensive, and that works.\n “If you would take the micropayments version of a gym membership, it would be like, ‘I can turn up and I can pay a couple of quid, and I can go into the gym whenever I want to use it.’ No gym works like that.”\n If an outlet wanted to try to start itself up on a pay-per-article model, it might work—but the price point would likely be much higher than the handful of cents we generally discuss. That gets trickier, Haile says, because information is fundamentally different from other arenas.\n Gaming is perhaps the greatest triumph of micropayments. But in games, you know what you’re buying in advance—three extra lives, a hundred coins, whatever. For a journalistic article, you’ll only know whether you enjoyed it after you’ve finished it.\n And gaming companies only have to deal with a few large partners to make it work. Media companies would need to devise a low-friction method for users to pay across sites owned by dozens of different publishers, without new log-ins and usernames each time. That would require lots of sites to take the plunge at once, agreeing on a system and a payment provider—which would presumably need to take a cut in order to keep operating.\n “It’s Haile’s first law of media,” he says. “The success of any project is inversely correlated with the amount that requires publishers to work together.”\n In the UK, one company is attempting it. Axate was started by Dominic Young, who previously led Rupert Murdoch’s scheme to push industry-wide collaboration. But they found that the publishers most willing to take the risk in joining were those that were not yet making money from subscriptions. Axate launched with very few publications, and thus not many articles.\n Matt Kelly, of the publisher Archant (disclosure: I have a column in one of its publications), was the second to join. “In truth it did very little business for us,” he says. “We felt eventually we needed to try a different approach to get people to support us.”\n There are more problems still—difficulties in delineating which content would be paid for versus free, challenges with advertising, problems with middlemen. But they all amount to a core issue.\n Readers would like to pick the very best content and pay less for it than they would if they subscribed. But no organization—media company, television network, or record company—can produce only hits. Nor should they try.\n And so it amounts, ultimately, to a reduction in revenue when we all need more. We’ve been waiting twenty-five years for micropayments. And it looks, at this moment, like they may never arrive.\n   Has America ever needed a media watchdog more than now? Help us by  joining CJR today.", "posttime": "2020-06-19 09:33:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "成为,micropayments,订阅", "title": "为什么小额支付永远不会成为新闻业的一件事", "title_en": "Why micropayments will never be a thing in journalism", "transed": 1, "url": "https://www.cjr.org/opinion/micropayments-subscription-pay-by-article.php", "via": "", "real_tags": ["成为", "订阅"]}, {"category": "", "categoryclass": "", "imagename": "7b0060edb1eaa90b0d49b778aa943543.jpg", "infoid": 1007206, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉正在收购德克萨斯州奥斯汀郊外价值500万美元的土地，以建设其新工厂，因为该项目即将获得超过6000万美元的激励。\n上个月，The electrek电视台独家报道称，特斯拉的下一家工厂将设在奥斯汀。\n在我们的报道之后，特斯拉透露，俄克拉何马州的塔尔萨仍在运营中，但我们能够确认，特斯拉已经准备在奥斯汀建造，它计划快速行动，希望在今年年底在德克萨斯州拥有一条Model Y的总装线。\n现在我们了解到，特斯拉正在奥斯汀郊外购买一块2100英亩的土地(见上图)来建造工厂。\n这块土地目前被一个砂石矿场占据，但特斯拉在德克萨斯州审计长办公室的一份申请中透露，特斯拉将以略高于500万美元的价格购买这一地点。\n“特斯拉正在评估在特拉维斯县奥斯汀格林地产内可能开发、设计和建设一家电动汽车制造厂的可能性。该地块占地约2100英亩，位于SH-130和哈罗德·格林路的交叉口。该房产目前是马丁·玛丽埃塔(Martin Marietta)和德克萨斯建筑项目(Texas Construction Projects)拥有和运营的砂石采矿场。马丁·玛丽埃塔(Martin Marietta)的资产将运营一段时间，但将在未来搬迁，以便进行场地建设。搬迁的时间表将在晚些时候确定。“。\nelectrek了解到，他们已经开始了搬迁过程，特斯拉的施工团队已经准备好在这个靠近奥斯汀机场的地点继续建设。\n然而，在获得所有地方当局的批准之前，购买并不是完全正式的。\n新特斯拉工厂的建设将于2020年第三季度开工，等待所有批准。\n特斯拉正在寻求当地学区的批准，在10年内免除高达6800万美元的财产税账单。\n这将是与特拉维斯县和该州达成的更广泛激励方案的一部分。\n首席执行官埃隆·马斯克一直将特斯拉的新工厂称为“CyberTruck GigaFactory”，因为那里将是特斯拉生产新款电动皮卡的地方。\n然而，特斯拉也计划在工厂生产Model Y，预计Model Y的生产将在CyberTruck生产之前上线。\nelectrek此前曾报道，特斯拉的目标是在今年年底前在奥斯汀工厂拥有一条Model Y总装线。\n这是一个非常激进的目标，但特斯拉显然在这个过程中取得了很大进展，尽管仍在寻求当局的官方批准。\n您正在阅读的是electrek，专家们日复一日地发布关于特斯拉、电动汽车和绿色能源的新闻。一定要查看我们的主页，了解所有最新新闻，并在Twitter、Facebook和LinkedIn上关注electrek，随时了解最新消息。不知道从何说起？请查看我们的YouTube频道以了解最新的评论。", "note_en": "Tesla is acquiring $5 million worth of land outside of Austin, Texas to build its new factory as it is about to secure over $60 million in incentives for the project.\n Last month,  Electrek exclusively reported that  Tesla’s next factory is going to be in Austin.\n After our report, Tesla leaked that Tulsa, Oklahoma, was still in the running, but we were able to confirm that Tesla was already set to build in Austin, and it plans to move fast with hope to have a general assembly line for Model Y in Texas by the end of the year.\n Now we’ve learned that Tesla is buying a 2,100-acre piece of land (pictured above) just outside Austin to build the factory.\n The land is currently occupied by a sand and gravel mining site, but Tesla is buying the location for just over $5 million which was revealed in an application with the Texas Comptroller’s office.\n  “Tesla is evaluating the possible development, design, and construction of an electric vehicle manufacturing plant in Travis County within the Austin Green property. This site is approximately 2,100 acres and located at the intersections of SH-130 and Harold Green Road. The property is currently a sand and gravel mining site owned and operated by Martin Marietta and Texas construction projects. The Martin Marietta assets will operate for a period of time but will be relocated in the future to allow for buildout of the site. The timeline for the relocation will be determined at a later date.”\n Electrek has learned that they have already started that process of relocation and Tesla’s construction team is already getting ready to build on at this location, which is near the Austin airport.\n Yet, the purchase is not making the completely official until they secure approval from all the local authorities.\n The construction of the new Tesla factory is set to commence in Q3 of 2020 pending all approvals.\n Tesla is seeking approval from the local school district to forgive up to $68 million on its property tax bill over 10 years.\n   It would be part of a wider incentive package with Travis County and the state.\n CEO Elon Musk has been referring to Tesla’s new factory as “Cybertruck Gigafactory” because it will be where Tesla produces its new electric pickup truck.\n However, Tesla also plans to produce Model Y at the factory and the Model Y production is expected to come online before Cybertruck production.\n Electrek previously reported that Tesla aims to have a Model Y general assembly line running at the Austin factory by the end of the year.\n It’s a very aggressive goal, but Tesla is apparently far along in the process despite still seeking official approval from the authorities.\n  You’re reading Electrek— experts who break news about  Tesla,  electric vehicles, and  green energy, day after day. Be sure to check out our  homepage for all the latest news, and follow Electrek on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  YouTube channel for the latest reviews.", "posttime": "2020-06-19 08:57:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "特斯拉,建造,acquires,工厂", "title": "特斯拉在奥斯汀郊外收购价值500万美元的土地建造“CyberTruck GigaFactory”", "title_en": "Tesla Acquires $5 Million Worth of Land Outside Austin To Build 'Cybertruck Gigafactory'", "transed": 1, "url": "https://electrek.co/2020/06/18/tesla-acquires-land-austin-build-factory/", "via": "", "real_tags": ["特斯拉", "建造", "acquires", "工厂"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007204, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-06-19 08:55:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "卫星,satellites,创建", "title": "僵尸卫星从墓地返回", "title_en": "Zombie Satellites Return from the Graveyard", "transed": 1, "url": "https://spectrum.ieee.org/tech-talk/aerospace/satellites/zombie-satellites-return-from-the-graveyard", "via": "", "real_tags": ["卫星", "创建"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007202, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个忙碌的早晨，收看有关土著遗产的新闻。暂时把目光从西澳大利亚移开，维多利亚州政府刚刚宣布，他们已经对阿拉皮莱斯山-图兰州立公园(Mount Arapiles-Tooran State Park)的一处遗址发布了临时保护声明，该遗址一直是传统所有者和攀岩者之间争执的主题。\n这个地点被称为Dyurrite1。这是一个小型的岩石避难所，是位于阿拉皮莱斯山以南的泰勒岩石或宣言岩的一部分，很受攀岩者的欢迎。\n最近在Dyurite 1发现了50多个肉眼无法发现的土著岩石艺术图案，那里也有一个散布的石器和一个石头采石场。\n土著事务部长加布里埃尔·威廉姆斯(Gabrielle Williams)表示，临时宣言将确保该地区得到充分保护，同时传统所有者与维多利亚公园合作，确定长期保护战略。\n威廉姆斯说：“我们非常重视对土著文化遗产的保护，我们必须与整个社区共同努力，保护、庆祝和尊重土著历史。”\n该地区自去年12月以来一直关闭，但根据临时声明，无视关闭标志的人将面临最高29.7万美元的罚款。\n公平工作委员会主席伊恩·罗斯法官宣布，将批准将国家最低工资提高1.75%，即每周13美元。\n但加薪不会同时适用于所有工人：前线工人从7月1日起加薪；建筑和制造业从11月1日起加薪；住宿、食品、零售、旅游和航空从2月1日起加薪。\nRoss表示，对FWC的要求“两极分化”，工会要求加薪4%，包括AiGroup和ACCI在内的顶峰雇主团体要求冻结薪资，政府希望FWC专注于商业生存能力和就业机会.。\n罗斯说，家庭成员委员会明白，由于新冠肺炎的原因，经济正处于“严重低迷”，但他指出，如果不加薪，低收入家庭将“更难满足自己的需求”，贫困的风险也会更大。\n罗斯说，工会要求加薪4%将造成“失业”的风险，尤其是年轻工人。\n保罗·卡普正在关注公平工作委员会，该委员会将于今天发布关于最低工资的决定。\n由于维珍航空(或无论它变成什么)的命运仍然未知，政府已经决定应该采取措施，让国内航空市场变得相当垄断。\n莫里森政府已经指示澳大利亚竞争和消费者委员会(ACCC)监测国内航空客运服务三年来。\n澳大利亚政府一直表示，拥有一个可持续、有竞争力的航空业最符合澳大利亚的国家利益。ACCC监测将有助于保护国内客运航空市场的竞争。\n除了机场监察委员会已进行的机场监察工作外，该方向亦会协助机场监察委员会取得有关资料，并为那些希望对本地航空客运业的反竞争行为表示关注的人士提供另一个渠道。\n该指示将根据2010年竞争和消费者法案第95ZE条发布，并将要求ACCC监测国内航空客运部门的价格、成本和利润。涉及的一个关键问题将是航空公司在每条航线上投入的运力水平，以及这种情况是否以可能损害竞争的方式发生。ACCC将至少每季度发布一次报告。\n是的，正如许多人指出的那样，丹·泰汉拥有墨尔本大学的文学学士学位。\n坦尼娅·普利塞克和工党正式回应了政府计划对大学进行的改革：\n“年轻人在这次经济衰退中受到的打击尤其严重，自由党再次将他们抛在脑后。\n“斯科特·莫里森希望学生为他的政府的大学改革买单，有些学位的学费翻了一番以上。\n“几年前，斯科特·莫里森削减了大学的名额。现在，他希望人们会感激他逆转了一些削减措施。即使在今天的声明之后，数以千计的澳大利亚人仍然会错过大学的机会。\n“明年想上大学的12年级学生数量翻了一番，但自由党拒绝为他们提供足够的名额。\n“青年失业率在这次经济衰退中达到顶峰：大约六分之一的年轻人找不到工作，这是20年来最糟糕的情况。如果年轻人挣不到钱，他们应该有学习的机会。但他们中的许多人将无法上大学，因为政府没有提供足够的名额。\n“斯科特·莫里森希望年轻人加入领取失业救济金的行列，而不是让他们学习，这是一种耻辱。\n“斯科特·莫里森(Scott Morrison)的自由党内阁部长都上过大学，但他们认为我们的孩子不应该有同样的机会。”", "note_en": "Show  It has been a busy morning for news about Aboriginal heritage. Looking away from Western Australia for a moment, the Victorian government has just announced it has made an interim protection declaration for a site in the Mount Arapiles-Tooran state park that had been  the subject of contention between traditional owners and rock climbers.\n The site in question is called Dyurrite 1. It’s a small rock shelter that is part of Taylors Rock or Declaration Crag, just south of Mount Arapiles, and is popular with rock climbers.\n More than 50 Aboriginal rock art motifs undetectable to the naked eye have recently been identified in Dyurrite 1, which also has a stone artefact scatter and a stone quarry.\n  The Aboriginal affairs minister,  Gabrielle Williams, said the interim declaration would ensure the area was adequately protected while traditional owners work with Parks  Victoria to determine a long-term protection strategy.\n Williams said: “We take the protection of Aboriginal cultural heritage very seriously and it is essential we work together with the whole community to protect, celebrate and respect Aboriginal history.”\n The area has been closed since December, but under the interim declaration people who ignore closure signs face fines of up to $297,000.\n The Fair Work Commission’s president, justice  Iain Ross, has announced it will grant a 1.75% increase in the national minimum wage, or $13 a week.\n  But the pay rise will not apply at the same time for all workers: frontline workers will receive it from 1 July; construction and manufacturing from 1 November; accommodation food retail tourism and aviation from 1 February.\n Ross said the demands on FWC were “sharply polarised” with unions asking for a 4% increase, peak employer bodies including AiGroup and ACCI asking for a pay freeze, and the government wanting it to focus on business viability and jobs.\n Ross said the FWC understood the economy was in a “significant downturn” due to Covid-19 but noted that low-income households would be “less able to meet their needs” and at greater risk of poverty without a pay rise.\n Ross said the union request for a 4% rise would create the risk of “disemployment”, particularly for young workers.\n  Paul Karp is watching the Fair Work Commission which will hand down its decision on the minimum wage today.\n With the fate of Virgin (or whatever it becomes) still unknown, the government has decided it should do something about the domestic air market becoming pretty much a monopoly.\n  The Morrison government has directed the Australian Competition and Consumer Commission (ACCC) to monitor domestic air passenger services for three years.\n The government has consistently said Australia’s national interest is best served through having a sustainable, competitive aviation sector. ACCC monitoring will help protect competition in the domestic passenger airline market.\n In conjunction with the airport monitoring work already undertaken by the ACCC, the direction will also assist the ACCC to obtain relevant information and provide another avenue for those wishing to raise concerns about anti-competitive conduct in the domestic air passenger sector.\n The direction will be issued under section 95ZE of the Competition and Consumer Act 2010 and will require the ACCC to monitor prices, costs and profits in the domestic air passenger sector.  A key matter covered will be the level of capacity the airlines are putting on each route and whether this is occurring in a way that may damage competition. The ACCC will release reports at least quarterly.\n And yes, as many people have pointed out,  Dan Tehan holds a bachelor of arts from the University of Melbourne.\n Tanya Plibersek and Labor have officially responded to the government’s planned changes to university:\n “Young people have been hit particularly hard by this recession, and the Liberals are leaving them behind again.\n “Scott Morrison wants students to foot the bill for his government’s uni changes, with fees for some degrees more than doubling.\n “A couple of years ago,  Scott Morrison cut uni places. Now he expects people to be grateful he’s reversed some of those cuts. Even after today’s announcement, thousands of Australians will still miss out on uni.\n “There’s double the number of year 12s who want to go to uni next year, but the Liberals refuse to open up enough places for them.\n “Youth unemployment’s gone through the roof in this recession: about one in six young people can’t find work, the worst situation in 20 years. If young people can’t earn, they should have the opportunity to learn. But many of them won’t be able to go uni because the government’s not providing enough places.\n “It’s a shame Scott Morrison wants young people to join the dole queue instead of letting them study.\n “Every one of Scott Morrison’s Liberal party cabinet ministers went to uni, but they don’t think our kids deserve the same chance.”", "posttime": "2020-06-19 08:18:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,大学", "title": "澳大利亚冠状病毒更新：总理称正在进行重大网络攻击", "title_en": "Australia coronavirus update: major cyber attack under way, PM says", "transed": 1, "url": "https://www.theguardian.com/australia-news/live/2020/jun/19/australia-coronavirus-latest-updates-coalition-welfare-victoria-community-transmission-scott-morrison-borders-tourism-live-news", "via": "", "real_tags": ["病毒", "冠状病毒", "大学"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007200, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-06-19 08:17:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "通风机,ventilator,创建", "title": "伟大的通风机冲刺", "title_en": "The Great Ventilator Rush", "transed": 1, "url": "https://spectrum.ieee.org/geek-life/hands-on/the-great-ventilator-rush", "via": "", "real_tags": ["通风机", "创建"]}, {"category": "", "categoryclass": "", "imagename": "948220093031a4c55b4a9777eda0f65f.jpg", "infoid": 1007199, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "叶会知道真相，真相会让你自由-约翰8：32(以及中央情报局总部大堂，弗吉尼亚州兰利)这里和这里有其他几个版本的谈话秘密历史背景故事点击这里。幻灯片母版更新母版可从此处下载_(如果您对历史…感兴趣", "note_en": "And Ye Shall Know the Truth, and the Truth Shall Make You Free - John 8:32 (and the lobby of CIA Headquarters, Langley Virginia) A few other versions of the talk are here and here Secret History Backstory Click Here . Master set of slides Updated master version can be downloaded here __________ (If you're interested in the history…", "posttime": "2020-06-19 07:59:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "布兰克,blank,情报局", "title": "史蒂夫·布兰克的“硅谷秘史”(2008)", "title_en": "Steve Blank's \"Secret\" History of Silicon Valley (2008)", "transed": 1, "url": "https://steveblank.com/secret-history/", "via": "", "real_tags": ["布兰克", "blank", "情报局"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1007198, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "湖边的房子从轮廓到最终的纹理都是完全程序化的。通过这个项目，我想要扩大程序性内容生成的预期范围，并发现“计算机制作的艺术”是否有可能看起来像人工制作的那样好。我想要扩大程序内容生成的预期范围，并发现是否有可能让“计算机制作的艺术”看起来像人造的那样好。\n最令人满意的部分之一是，当生成最终的湖边小屋时，网络会给我带来意想不到的、但非常有创意的结果，这是我在写规则时根本没有预料到或没有考虑到的。这些结果仍然有存在的权利，事实上，看起来非常奇怪。如果是一个人建造了这座房子，我会称赞他的独创性！这是否意味着系统可以在我们给予它们的约束下具有创造性？我喜欢把胡迪尼想象成一个学生，而你是一个老师，可以把任何信息输入到学生的头脑中，它将被100%准确地感知(无论是坏的还是好的)。而且，正如许多老师所知道的那样，学生们有一种倾向，他们想出的东西真的会让你大吃一惊。大多数人可能不会直接注册它，但我们是伟大的模式识别机器，为了使程序生成可信，我们每天面临的模式应该存在。当追求一个看起来自然的结果时，程序性网络的规则仍然是对现实世界环境的简单抽象，只要模仿考虑到必要的细节水平，这是完全没有问题的。\n对我来说，这个过程类似于绘画：首先，你画出非常宽泛和一般的笔触，然后，当你对那个阶段感到满意时，你才开始提炼和添加细节。当然，“细节解决方案”也必须考虑到，因为你可能不想在你永远看不到这么近的房子上加钉子。然而，分析是什么让房子或任何其他东西对你的大脑来说“正常”是至关重要的，因为稍微抵消你大脑基于多年经验精心构建的刻板印象，就会导致模型看起来像是人造的或“电脑制造的”。该项目在以下方面进行了介绍：\n3D Artist Magazine第105期作为13个步骤的教程-概述，在这里我将讨论创建此项目所使用的技术", "note_en": "The The lake houses are fully procedural all the way from the silhouette to the final texturing. With this project, I wanted to expand the limits of what is expected from a procedural content generation and discover whether it is possible for a “computer-made art” to look as good as human-made.\n One of the most satisfying part was, when generating the final lake houses, the network would give me unexpected, but very creative results that I simply didn’t anticipate or take into account when writing the rules. And those outcomes still had all the rights to exist and, in fact, looked extremely curious. If that was a person, who built the house, I would praise him for originality! Does it mean that the systems can be creative within the constraints that we give them? I like to think of Houdini as a student, and you are a teacher, who can put any information in a student’s head and it will be perceived with 100% accuracy (for the worse or the better). And, as many teachers know, students have a tendency to really surprise you with the things they come up with.  Most people probably do not directly register it, but we are great pattern recognition machines, and to make procedural generation believable the patterns we face on daily basis should be present. When striking for a natural-looking result, the rules for a procedural network are still simple abstractions of the real world environment, and that is perfectly fine as long as the imitation accounts for the necessary level of detail.\n For me, this process resembles painting: first, you make very wide and general brush strokes and only then, when you are satisfied with that stage, you start refining and adding specifics. And, of course, a “resolution for details” has to be taken into consideration as you probably don’t want to add nails to a house you will never see so close. However, analyzing what makes the house or anything else “normal” to your brain is essential as a slightest offset from the stereotype that was carefully constructed by your mind based on years and years of experience will result in a model looking artificial or “computer-made”.  The project was featured in:\n 3D Artist Magazine Issue #105 as a 13 steps tutorial-overview, where I discuss the techniques used to create this project", "posttime": "2020-06-19 07:59:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,procedural,可能", "title": "程序湖村，带程序房屋", "title_en": "Procedural Lake Village w/ Procedural Houses", "transed": 1, "url": "https://www.anastasiaopara.com/lakevillage", "via": "", "real_tags": ["程序", "可能"]}, {"category": "", "categoryclass": "", "imagename": "bb9a5f3154d4274eecd0c107b425f99b.jpg", "infoid": 1007197, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇未经同行评审的论文背后的研究人员对在疫情爆发早期接触过患者的医院工作人员的样本进行了抗体测试-只有4%的人有抗体，但至少有25%的人可能已经感染。", "note_en": "Researchers behind the non-peer-reviewed paper ran antibody tests on samples from hospital workers who were exposed to patients at early stage of outbreak – only 4 per cent had them, but at least 25 per cent could have been infected.", "posttime": "2020-06-19 07:58:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "study,评审", "title": "武汉一项新研究表明，可能对新冠肺炎没有免疫力", "title_en": "There may be no immunity against Covid-19, new Wuhan study suggests", "transed": 1, "url": "https://www.scmp.com/news/china/science/article/3089476/there-may-be-no-immunity-against-covid-19-new-wuhan-study", "via": "", "real_tags": ["study", "评审"]}]