[{"category": "", "categoryclass": "", "imagename": "ee75a61b1469812fe82bd3d31afb91ce.jpg", "infoid": 1017936, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于半导体行业内的人，以及在我们报道的公司中有投资的个人来说，很难错过最近围绕英特尔制造工艺困境的新闻。简而言之，英特尔的10 nm制程技术在性能和成品率方面未能达到预期，比预期晚了几年，而且无法与自己的上一代产品竞争。今天，它的销量仍然很低，虎湖有望成为英特尔10纳米愿景的第一个真正的例子。\n英特尔制造的下一步功能改变，使用极端紫外光(EUV)技术转移到7 nm，最近宣布也有额外的6个月的延迟。有了这样的消息，人们很难对英特尔提供行业领先、在市场上具有竞争力的制造节点技术的能力保持信心。在延迟进入10 nm制程之前，这是英特尔过去一直坚持的立场。\n英特尔披露的关于其制造技术的信息复杂程度各不相同，这取决于产品在内部被认为有多成功。2011年5月，当英特尔首次在其22 nm工艺节点上宣布FinFET时，有很多信息直接走出了大门，该节点非常成功。对于下一代14 nm，布罗德韦尔的第一代产品有一些延迟，但最终该公司在自己的活动上详细解释了这一过程，我们在2014年8月发表了我们关于14 nm的文章。到目前为止，14 nm工艺节点一直是英特尔利润最高的制造节点，多年来持续的节点内增强(14+、14++、14+、14+*)为该公司提供了相当于制造一代内的纯节点更新的有效增强。\n*是的，英特尔拥有14+节点。甚至在他们的图表里也有。据我们所知，唯一被确认在14+上的产品是Cooper Lake Xeon Scalable系列。\n当涉及到10 nm时，情况就不那么乐观了，即使与14 nm的延迟相比也是如此。到目前为止，英特尔已经有两代10 nm的CPU产品，其中一代甚至试图在公共场合提及，尽管我们已经对其进行了极其详细的审查。\n第一款10纳米产品--CANON LACK进入了英特尔的Crimson Canyon NUC迷你PC，可谓是一团火爆的烂摊子：只有两个内核，禁用了集成显卡，虽然在2017年实现了营收，但英特尔非常迅速地将其寄送到历史上是正确的。\n冰湖是英特尔10纳米的合适发射工具，在15瓦内提供四个内核和大量的Gen11显卡。它已经在50多个笔记本电脑设计中找到了自己的方法，但正如上一页所提到的，尽管它的原始性能时钟比时钟提高了15%-20%，但频率的10%-20%的下降抵消了它在14 nm以上的最小CPU改进。Ice Lake上的图形仍然比14 nm好很多，支持迅雷3和512位矢量指令意味着Ice Lake仍然有几个加点。\n目前的情况是，由于英特尔不想将加农湖视为其传统的真正组成部分，冰湖被认为是一种扁平的“10 nm”产品，没有绒毛和多余的比特。在冰湖被设定为老虎湖之后，它建立在一个‘10+’的制造节点上。\n关于制造过程命名的附注。正如我们的许多读者都知道的那样，FinFET技术时代附加到流程的实际数字实际上已经变成了流程节点技术的专有名词-它与构建在该流程上的产品中的任何功能无关。当工艺的某些特征比技术上的数量更小时，就会变得特别令人困惑：例如，英特尔的10 nm实际上有8纳米大小的特征。制造节点不妨命名为Gordon、Eric或Lisa，以避免使用该编号带来的混乱。\n在工艺节点技术的一代内，制造半导体订单的公司可以周期性地更新其制造工艺，但大体上仍将其保持在该一代的范围内。这些更新通常很小，但被称为BKM(最佳已知方法)更新，可以带来简单的频率或功率效率改进-可能在50 mV或25 MHz左右，但有时会带来更大的收益。\n当我们处理22 nm、32 nm、45 nm和更高的平面晶体管时，这些BKM更新在该节点制造的产品的生命周期中是正常的。制造上的改进被自动卷进产品中，它只是简单地装在同一个盒子里出售，没有太大的麻烦，但有稍微好一点的特性。\n随着我们进入多代FinFET技术，创造一个尖端的高性能处理器可能需要花费100-1亿美元或更多，这些BKM更新已经成为芯片设计公司和它们所基于的晶圆厂的适销对路的更新。对BKM的小调整现在正被用来推出新一波产品，为相关公司提供创造栏目英寸的机会，突显相关团队的工程能力，以及为客户提供更好的产品。\n不同的加工厂以不同的方式销售这些更新。英特尔在其14 nm工艺中采用了+、++、+、+命名法，每一步都提供了更好的晶体管设备性能，并被应用到新一代产品中：\n然而，在过去的几年里，英特尔的命名方案已经变成了某种程度上的迷因和笑话。由于该公司无法按最初的计划推出10 nm，英特尔决定在每一次14 nm的新工艺更新中增加更多的+。随着10 nm的进一步延迟，消费者和用户看到14 nm又增加了一个+。英特尔无法让10 nm工作，并看到14+未来产品的迷因是对这家公司灵魂的根本性打击，这家公司在过去30多年里一直以其推动尖端半导体制造实现高性能的能力而自豪。\n随着英特尔慢慢转向其10纳米产品组合，+命名几乎立刻又出现了。加农湖是10 nm，冰湖是10+，后来变成了10 nm，老虎湖是10+，然后10++和10++都出现在各种行业活动的路线图上。同样的故事也适用于未来的工艺，比如7纳米和5纳米。\n如果这让你感觉好一些，英特尔自己的工程师说，即使是他们有时也很难记住哪个+变体有特定的更新，或者哪个产品是建立在哪个+节点上的。最终，虽然+起到了一定的作用，但最终还是让客户和工程师都感到困惑。\n这就是为什么我们在幕后告诉英特尔，如果仅仅从公司形象的角度来看，它必须放弃+、++和+。台积电(TSMC)和三星(Samsung)等制造竞争对手可以针对不同的产品指出其10 nm工艺的不同变体，而英特尔拥有的只是更多的优势。\n其他媒体和分析师也告诉了英特尔这一点。然而，根据以往的经验，我们很少能与真正能带来直接改变的人交谈。我们所有的联系人所能做的就是尝试，并将我们的评论传递到链条上，希望能带着尽可能多的热情。真正能够签署这样的变化的人通常不太面对媒体。\n但是，在英特尔的某个地方，终于有人听到了我们的请求。今天，英特尔正在从不同的角度接近其10 nm产品组合。虽然在技术上没有什么变化，但新的战略允许该公司从发生的深度工程组合和研究的初始背景下营销其制造和产品。这一变化的第一个结果是超级品。\n10纳米超细纤维是老虎湖的基础，代表了10+的新名称。作为英特尔10SF的一部分，我们将了解10SF与冰湖10的不同之处，以及构成10SF工艺的晶体管和金属堆栈设计的一些关键部件的更新。\n10SF通过引入重新定义的FinFET设计(英特尔的第四代FinFET？)在10 nm的基础上构建。凭借更高的散热片性能，以及全新的SuperMIM(金属-绝缘体-金属)电容器设计。\n通过新的制造技术，增强了源极和漏极上晶体结构的外延生长，最终增加了应变，以降低电阻，允许更多电流流过沟道。\n增强的源极/漏极架构和改进的栅极制造工艺有助于推动更高的沟道迁移率，从而使电荷载流子能够更快地移动并提高晶体管性能。\n此外，更大的栅距可为需要最高性能的某些芯片功能提供更高的驱动电流。通常，更大的栅极间距听起来与我们对密集工艺节点技术的期望相反，然而，据解释，在这种情况下，使晶体管更大并提高性能实际上意味着在高性能单元库中需要更少的缓冲器，最终结果是单元尺寸减小。请注意，在英特尔的一些14 nm变种上，用来帮助驱动更高频率的技术之一是更大的栅距。\n在堆栈的较低层，英特尔正在推出一套新的阻挡层材料，以实现更薄的阻挡层，这也有助于通过使每个金属通孔在固定尺寸中的更大比例来降低通孔的电阻，最高可达30%。降低电阻增强了金属层之间的互连的性能。\n在更高的层面上，英特尔正在推出一种新的SuperMIM(金属-绝缘体-金属)电容器。英特尔表示，这一新设计在相同的占地面积内，使电容比行业标准的MIM帽增加了5倍。这推动了电压的降低，最终导致产品和晶体管性能的大幅提高。英特尔表示，这是业界首创/领先的设计，通过仔细沉积小于0.1 nm的薄层中的新Hi-K材料，在两种或两种以上材料类型之间形成超晶格。\n英特尔高级晶体管架构师Ruth Brain将所有这些功能结合在一起，称这些功能实现了“英特尔历史上最大的单(内部)节点增强”，使晶体管性能在10 nm基础设计的基础上提高了17-18%。这使得10SF相当于英特尔基础10 nm工艺上的完全节点增强。为了与英特尔的14 nm相提并论，10SF到10相当于咖啡湖(14+)到布罗德韦尔(14 Nm)。\n作为2020架构日的一部分，英特尔还表示，超过10SF的内部节点更新将称为10ESF，或10 Enhanced Superin。关于10ESF将比10SF提供什么，没有给出具体细节，只是说它将带来额外的性能和互连创新。\n话虽如此，英特尔表示，它将针对数据中心进行优化，这可能意味着某些特性将会改变，以支持矢量加速带来的更高的热量和电流密度。英特尔可能是意外地向我们确认，将会有三款基于10ESF的产品。\n(英特尔已经声明，Ponte Vecchio将有四种类型的瓷砖：基本瓷砖、计算瓷砖、兰博高速缓存瓷砖和Xe链接瓷砖。其他没有提到的将被分成7 nm和外部晶圆厂。有关该信息的更多信息，请参阅另一篇文章)", "note_en": "For those within the semiconductor industry, as well as individuals with investments in the companies we cover, it has been hard to miss the recent news surrounding Intel’s manufacturing process woes. In short, Intel’s 10nm process technology has failed to match expectations in performance and yield, coming in a couple of years later than expected and with an inability to compete with its own previous generation products. It still remains in low volume today, with Tiger Lake expected to be the first true example of what Intel’s vision 10nm was meant to be.\n  The next step function change in Intel’s manufacturing, the move to 7nm using Extreme Ultra Violet (EUV) technology, has recently been announced that it also has an additional six month delay. With news like this, it has become a struggle to remain confident about Intel’s ability to deliver an industry-leading manufacturing node technology that is competitive in the market. This used to be the position that Intel held until delays crept into the 10nm process.\n      Intel’s disclosures on its manufacturing technology vary in complexity depending on how successful the product is perceived internally. When Intel  first announced FinFETs on its 22nm process node, in May 2011, there was a lot of information straight out of the gate, and the node was very successful. With the next generation of 14nm, there were some delays with the initial generation of Broadwell products, but ultimately the process was explained in detail by the company at its own event and we published our article on 14nm in  August 2014. The 14nm process node has been Intel’s most profitable manufacturing node to date, and continuous intranode enhancements over the years (14+, 14++, 14+++, 14++++*) have given the company an effective enhancement equivalent to a pure node update within a manufacturing generation.\n    *Yes, Intel has a 14++++ node. It’s even in their diagrams. The only product confirmed to be on 14++++ as far as we can tell is the Cooper Lake Xeon Scalable family.\n  When it comes to 10nm, the situation is not as rosy, even compared to the delays on 14nm. To date, Intel has had two generations of 10nm products on the CPU side, one of which the company steers away from even trying to mention it in public, even though  we’ve reviewed it in excruciating detail.\n  Cannon Lake, the first 10nm product, found its way into Intel’s Crimson Canyon NUC mini-PCs and was a hot mess: two cores only, disabled integrated graphics, and although it shipped for revenue in 2017, Intel was right to consign it to history very quickly.\n  Ice Lake was Intel’s proper launch vehicle for 10nm, offering four cores and a lot of Gen11 graphics within 15 watts. It has found its way into over 50 laptop designs, but as mentioned on the previous page, despite its 15-20% increase in raw performance clock-for-clock, that 10-20% decrease in frequency balances it out for a minimal CPU improvement over 14nm. The graphics on Ice Lake are still a lot better than on 14nm, and support for Thunderbolt 3 as well as 512-bit vector instructions means that Ice Lake still has a few plus points.\n  As it stands, because Intel doesn’t want to consider Cannon Lake as a true part of its heritage, Ice Lake was deemed a flat ‘10nm’ product, with no plusses and no extra bits. After Ice Lake was set to be Tiger Lake, built on a ‘10+’ manufacturing node.\n    A side note about manufacturing process naming. As many of our readers are aware, the actual number attached to the process in the era of FinFET technology has effectively become nothing more than a proper noun for the process node technology – it isn’t related to any feature within the products built on that process. It gets especially confusing when there are features of a process built at a smaller scale than the number on the technology: for example, Intel’s 10nm actually has features that are 8nm in size. Manufacturing nodes might as well be given names like Gordon, Eric, or Lisa, in order to stop the confusion that having that number provides.\n  Within a generation of a process node technology, the company fabricating the semiconductor orders may periodically update its manufacturing process but still keep it, by and large, within the confines of that generation. These updates are often minor, but are called BKM (best-known-method) updates and can lead to simple frequency or power efficiency improvements – perhaps on the order of 50 mV or 25 MHz, but sometimes afford bigger gains.\n  When we were dealing with planar transistors, at 22nm, 32nm, 45nm and above, these BKM updates were par for the course during the lifecycle of a product built at that node. Improvements in the manufacturing were taken, rolled into the product automatically, and it was simply sold in the same box without much of a fuss, but had marginally better characteristics.\n  As we’ve moved into multiple generations of FinFET technologies, where creating a leading edge high-performance processor can cost $10-$100million or more, these BKM updates have become marketable updates to both the chip design companies and the fabs they are built on. Small tweaks to the BKM are now being used to launch new waves of products, and offer the companies involved a chance to create column inches and highlight the engineering prowess of the teams involved, as well as offering the customer a better product.\n  Different fabrication plants have marketed these updates in different ways. Intel has gone with the +,++,+++,++++ nomenclature for its 14nm process, with each step giving better transistor device performance and being rolled into new generations of products:\n    However, Intel’s naming scheme has become somewhat of a meme and a joke over the past few years. With the company’s inability to bring out 10nm on its initial schedule, Intel decided to add more + to each new process update on 14nm. As 10nm was delayed further, consumers and users saw another + added to 14nm. The meme of Intel unable to get 10nm working and seeing a 14+++++++++ future product is a fundamental strike to the soul of a company that has spent the last 30+ years priding itself on its ability to drive leading edge semiconductor manufacturing for high-performance.\n  As Intel has slowly moved onto its 10nm product portfolio, the + naming came in again almost immediately. 10nm for Cannon Lake, 10+ for Ice Lake which later became just ‘10nm’, 10+ for Tiger Lake, and then 10++ and 10+++ were all exhibited on roadmaps at various industry events. The same story goes on for future processes, such as 7nm and 5nm.\n    If it makes you feel any better, Intel’s own engineers said that even they sometimes have difficulty remembering which + variant has specific updates, or which product is built on which + node. Ultimately, while the + serves a purpose, it has ultimately become confusing for customers and engineers alike.\n  This is why, behind the scenes, we have told Intel that it has to move away from + and ++ and +++, if only from a corporate image standpoint. Where its manufacturing competitors like TSMC and Samsung can point to different variants of their 10nm processes for different products, all Intel has is more pluses.\n  Other press and analysts have told Intel this too. However, based on previous experiences, we rarely get to speak to the people who actually can cause direct change.  All our contacts can do is try, and pass our comments up the chain, hopefully with as much passion as we have. The people that can actually sign off on changes like this are often not very press facing.\n  But someone, somewhere at Intel, has finally heard our pleas. Today Intel is approaching its 10nm portfolio from a different angle. While nothing is technically changed under the hood, the new strategy allows the company to market its manufacturing and products from an initial context of the deep engineering portfolio and research that occurs. The first result of this change is the SuperFin.\n    10nm SuperFin is what Tiger Lake is built on, and represents the new name for 10+. As part of Intel’s 10SF, we’re getting a glimpse into what makes 10SF different to the 10 for Ice Lake , as well as updates on some key parts to the design of the transistors and metal stack that make up the 10SF process.\n    10SF builds on 10nm by introducing a redefined FinFET design (Intel’s 4 th Gen FinFET?) with increased Fin performance, as well as a new SuperMIM (metal-insulator-metal) capacitor design.\n      Through new manufacturing techniques, the epitaxial growth of crystal structures on the source and drain has been enhanced, ultimately increasing the strain in order to lower the resistance allowing more current to flow through the channel.\n  An enhanced source/drain architecture and improved gate manufacturing process helps drive additional higher channel mobility, which enabling charge carriers to move more quickly and improves transistor performance.\n  Additionally a larger gate pitch to enable higher drive current for certain chip functions that require the most performance. Normally a larger gate pitch sounds the opposite of what we want for a dense process node technology, however it was explained that in this case making the transistor bigger with improved performance actually means that fewer buffers are needed in the high performance cell libraries, and ultimately the cell size decreases as a result. Note that on some of Intel’s 14nm variants, one of the techniques used to help drive higher frequency was a larger gate pitch.\n      At the lower layers of the stack, Intel is introducing a new set of barrier materials to enable thinner barriers, which also helps reduce resistance of vias by up to 30% by enabling the metal each via to be a bigger proportion of the fixed size. Reducing the resistance enhances the performance of the interconnect between the metal layers\n  At the higher levels, Intel is introducing a new SuperMIM (metal-insulator-metal) capacitor. Intel states that this new design gives a 5x increase in capacitance over an industry standard MIM cap within the same footprint. This drives a voltage reduction that ultimately leads to drastically improved product and transistor performance. Intel states that this is an industry first/leading design, enabled through careful deposition of new Hi-K materials in thin layers, smaller than 0.1nm, to form a superlattice between two or more material types.\n    All combined, Intel’s Senior Transistor Architect, Ruth Brain, states that these features enable the  ‘ Largest single (intra)node enhancement in Intel history’, enabling 17-18% better transistor performance from the base 10nm designs. This makes 10SF equivalent to a full node enhancement over Intel’s base 10nm process. To draw parallels to Intel’s 14nm, 10SF to 10 is the equivalent of Coffee Lake (14+++) to Broadwell (14nm).\n    As part of Architecture Day 2020, Intel also stated that the intranode update beyond 10SF will be called 10ESF, or 10 Enhanced SuperFin. No specific details were given as to what 10ESF will provide over 10SF, only that it will bring additional performance and interconnect innovations.\n  That being said, Intel stated that it would be optimized for the datacenter, which likely means that some characteristics will be changed in order to support the increased thermal and current density that comes with vector acceleration. Intel, perhaps accidentally, confirmed to us that there will be three products based on 10ESF.\n    (Intel has stated that Ponte Vecchio will have four types of tile: base, compute, Rambo Cache, and Xe Link. The others not mentioned will be split between 7nm and external fabs. More on that info in a separate article)", "posttime": "2020-08-13 21:37:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,xe,core", "title": "英特尔第11代酷睿虎湖SoC详细介绍：Superin、Willow Cove和Xe-LP", "title_en": "Intel’s 11th Gen Core Tiger Lake SoC Detailed: SuperFin, Willow Cove and Xe-LP", "transed": 1, "url": "https://www.anandtech.com/show/15971/intels-11th-gen-core-tiger-lake-soc-detailed-superfin-willow-cove-and-xelp/2", "via": "", "real_tags": ["英特尔", "xe", "core"]}, {"category": "", "categoryclass": "", "imagename": "7639e82cf5faff5c5204015a523e4f6d.jpg", "infoid": 1017935, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“B.T.”已经过去十多年了。最后一次看到任何东西。\n在年轻女子经历了一场创伤性事故后，医生诊断她患有皮质盲，这是由于她大脑中的视觉处理中心受损造成的。因此，她找了一只导盲犬来引导她，她逐渐习惯了黑暗。\n此外，B.T.还有其他健康问题要应对-也就是说，有10多个截然不同的人在争夺对她身体的控制权。正是在寻求治疗她的分离性身份障碍的过程中，她突然恢复了看东西的能力。别忘了B.T.，一位大约37岁的德国女性。但对于一个十几岁的男孩来说，她有时会变成。\n经过几个月的治疗，除了两个人之外，B.T.的所有身份都恢复了正常。当B.T.在不同的身份之间摇摆时，她的视线就像脑海中的电灯开关一样忽明忽暗。世界会出现，然后就会变暗。\nB.T.的医生在《心理学杂志》上撰文称，根据她最初的诊断，她的失明不是由脑损伤引起的。相反，它更类似于大脑指令，是一种心理问题，而不是生理问题。\nB.T.的这一奇怪案例揭示了很多关于大脑超凡力量的信息--它是如何控制我们所看到的和我们是谁的。\n为了了解B.T.(在期刊文章中只透露了她名字的首字母)发生了什么，她的医生、德国心理学家汉斯·斯特拉斯伯格(Hans Strasburger)和布鲁诺·瓦尔德沃格尔(Bruno Waldvogel)一路追查，证实了她最初被诊断为皮质盲。她当时的健康记录显示，她接受了一系列的视力测试-包括激光、特殊眼镜、房间里闪耀的灯光-所有这些都表明她明显失明。由于她的眼睛本身没有受损，因此人们推测B.T.的视力问题一定来自于她的意外造成的脑损伤(报道没有说明事故中具体发生了什么)。\n13年后，当B.T.被转介给他治疗分离性身份障碍时，Waldvogel没有理由怀疑这一诊断，这种疾病曾被称为多重人格障碍。B.T.展示了10多种性格，每种性格在年龄、性别、习惯和气质上都不同。他们甚至说着不同的语言：有些人只用英语交流，有些人只用德语交流，有些人两种语言都用(B.T.小时候也曾在说英语的国家度过过一段时间，但住在德国)。\n然后，在进行心理治疗的四年里，奇怪的事情发生了：就在一次治疗结束后，在她的一个青春期男性州，B.T.在一本杂志的封面上看到了一个词。这是她17年来在视觉上读到的第一个单词。\n起初，B.T.的新视野仅限于识别那个身份中的整个单词。如果被问到，她甚至看不到组成单词的各个字母，只能看到单词本身。但它逐渐扩展，首先扩展到较高级别的视觉过程(如阅读)，然后扩展到较低级别的过程(如识别模式)，直到她的大多数个性在大部分时间都能看到为止。当B.T.在有视力和无视力的性格之间交替时，她的视力也发生了变化。\n就在那时，沃尔德沃格尔开始怀疑B.T.视力丧失的原因。这种不会导致皮质失明的严重脑损伤不太可能在这么长时间后立即痊愈。即使是这样，这也不能解释为什么B.T.的远见总是时断时续。很明显，还有其他事情在发生。\n一种解释是B.T.“装病”，或者在她的残疾问题上撒谎，但EEG测试证明这一解释是错误的。当B.T.处于两种失明状态时，她的大脑没有像有视力的人那样对视觉刺激表现出任何电反应-即使B.T.的眼睛是睁着的，她正看着它们。\n取而代之的是，Waldvogel和Strasburger认为，B.T.的失明是由脓肿引起的(心理原因，而不是身体原因)。发生了一些事情-可能与她的事故有关-导致她的身体做出反应，切断了她的视力。即使是现在，她的两个身份仍然保留着这种应对机制。\nStrasburger告诉神经科学网站Brain Decoder：“这些大概是一种退缩的可能性。”“在情绪特别紧张的情况下，病人偶尔会有失明的愿望，因此不需要看东西。”\n研究人员说，实际上，人们的大脑阻止他们看东西的情况并不少见，即使他们的眼睛工作得很好。当你的两只眼睛看到略有不同的图像时-例如，眯着眼睛-大脑会切出一张图像，以防止你被矛盾所迷惑。当你专注于你视野中的特定物体时，你的大脑也会干预视觉处理。\n让B.T.看不到她所看到的一切的信息“把关”的责任可能在于外侧膝状体，这是一种新型的神经中继中心，将视觉信息沿着突触路径发送到大脑的信息处理器中。\n然而，也许比它所说的关于视力的更有趣的是B.T.的故事告诉我们关于分离性身份障碍(DID)的事情，这种疾病显然是她视力丧失的根源。\n尽管DID自1994年以来一直被列入精神病学的“圣经”-“精神疾病诊断和统计手册”(The Diagnostic And Statistics Manual Of Mental Disorder)(在此之前的15年里，DID一直被认为是“多重人格障碍”)，但专家和其他患者对这一诊断仍然存在大量怀疑。在它成为一种精神诊断之前的几年里，DID和其他一系列精神疾病一起被称为“歇斯底里”，这个术语让你对它和它的患者有了一种感觉。\n现代的诊断批评者会指出，在诊断标准和治疗方面缺乏共识，并指责DID患者的耸人听闻的故事，如1976年的电视电影“西比尔”(Sybil)，制造了MPD诊断的“流行病”。20世纪90年代，出现了一连串的诉讼，这些患者接受了可疑的多重人格障碍治疗，他们说自己没有多重人格障碍，许多人开始相信，这种治疗并不是由精神病学家治疗的，而是由他们通过暗示的力量诱导的。\n至少，人们认为这样做可能只是高水平思维碎片化的产物--即大脑处理复杂情绪的崩溃。\n但斯特拉斯伯格和沃尔德沃格尔表示，他们的发现是确实可以在非常基本的生物学水平上展开的证据。毕竟，受B.T.病情影响的不仅仅是高水平的认知功能，比如阅读-即使是深度知觉这样的基本事情对她来说也是困难的。B.T.的医生可以在脑电图上看到所有这些都在她的大脑中进行，就在他们面前。\n与这项研究无关的坦普尔大学医学院(Temple University School Of Medicine)精神病学临床教授理查德·P·克鲁夫特(Richard P.Kluft)博士告诉Brain Decoder，这项案例研究表明，DID“是一种基于心理生理的合法心理困扰综合征”。他说，这种情况不仅仅是文化和精神病学家建议的产物；就像B.T.的情况一样，它“代表了大脑试图将其痛苦区分开来。”\n通过给作者发电子邮件来分享您的反馈。对我们的评论政策有什么问题吗？请查看我们的指南或在此处联系评论团队。", "note_en": "It had been more than a decade since “B.T.” had last seen anything.\n After suffering a traumatic accident as a young woman, doctors diagnosed her with cortical blindness, caused by damage to the visual processing centers in her brain. So she got a seeing eye dog to guide her and grew accustomed to the darkness.\n Besides, B.T. had other health problems to cope with — namely, more than 10 wildly different personalities that competed for control of her body. It was while seeking treatment for her dissociative identity disorder that the ability to see suddenly returned. Not to B.T., a 37-year-old German woman. But to a teenage boy she sometimes became.\n  With therapy, over the course of months, all but two of B.T.’s identities regained their sight. And as B.T. oscillated between identities, her vision flicked on and off like a light switch in her mind. The world would appear, then go dark.\n  Writing in  PsyCh Journal, B.T.’s doctors say that her blindness wasn’t caused by brain damage, her original diagnosis. It was instead something more akin to a brain directive, a psychological problem rather than a physiological one.\n B.T.’s strange case reveals a lot about the mind’s extraordinary power — how it can control what we see and who we are.\n  To understand what happened with B.T. (who is identified only by her initials in the journal article) her doctors, German psychologists Hans Strasburger and Bruno Waldvogel, went all the way back to her initial diagnosis of cortical blindness. Her health records from the time show that she was subjected to a series of vision tests — involving lasers, special glasses, lights shined across a room — all of which demonstrated her apparent blindness. Since there was no damage to her eyes themselves, it was assumed that B.T.’s vision problems must have come from brain damage caused by her accident (the report does not say what exactly happened in the accident).\n   Waldvogel had no reason to doubt that diagnosis when B.T. was referred to him 13 years later for treatment for dissociative identity disorder, once called multiple personality disorder. B.T. exhibited more than 10 personalities, each of them varying in age, gender, habits and temperament. They even spoke different languages: some communicated only in English, others only in German, some in both (B.T. had spent time in an English-speaking country as a child but lived in Germany).\n Then, four years into psychotherapy, something strange happened: Just after ending a therapy session, while in one of her adolescent male states, B.T. saw a word on the cover of a magazine. It was the first word she had read visually in 17 years.\n At first, B.T.’s renewed sight was restricted to recognizing whole words in that one identity. If asked, she couldn’t even see the individual letters that made up the words, just the words themselves. But it gradually expanded, first to higher-order visual processes (like reading), then to lower-level ones (like recognizing patterns) until most of her personalities were able to see most of the time. When B.T. alternated between sighted and sightless personalities, her vision switched as well.\n   That’s when Waldvogel began doubting the cause of B.T.’s vision loss. It’s unlikely that a brain injury of the kind that can cause cortical blindness would heal instantaneously after such a long time. And even if it did, that didn’t explain why B.T.’s vision continued to switch on and off. Clearly something else was going on.\n One explanation, that B.T. was “malingering,” or lying about her disability, was disproved by an EEG test. When B.T. was in her two blind states, her brain showed none of the electrical responses to visual stimuli that sighted people would display — even though B.T.’s eyes were open and she was looking right at them.\n Instead, Waldvogel and Strasburger believe that B.T.’s blindness is pyschogenic (psychologically caused, rather than physical). Something happened — perhaps related to her accident — that caused her body to react by cutting out her ability to see. Even now, two of her identities retain that coping mechanism.\n   “These presumably serve as a possibility for retreat,” Strasburger told the neuroscience site  Brain Decoder. “In situations that are particularly emotionally intense, the patient occasionally feels the wish to become blind, and thus not ‘need to see.&#39;”\n It’s not actually all that uncommon for people’s brains to stop them from seeing, even when their eyes work fine, the researchers say. When your two eyes see slightly different images — when squinting, for example — the brain will cut out one image to keep you from getting confused by the contradiction. Your brain also intervenes in visual processing when you focus on particular objects in your field of vision.\n Responsibility for the information “gatekeeping” that kept B.T. from seeing everything she looked at may lie with the lateral geniculate nucleus, a sort of neural relay center that sends visual information down synaptic pathways into the brain’s information processors.\n   Perhaps more interesting than what it says about sight, though, is what B.T.’s story tells us about dissociative identity disorder (DID), the condition apparently at the root of her vision loss.\n Though DID has been listed in psychiatry’s “Bible,” the Diagnostic and Statistical Manual of Mental Disorders, since 1994 (and was recognized as “multiple personality disorder” for a decade and a half before that), there is still a large amount of skepticism about the diagnosis among experts and patients alike. For years before it became a psychiatric diagnosis, DID was known along with a host of other psychiatric conditions as “hysteria,” a term that gives you a sense of how it and its sufferers were viewed.\n Modern critics of the diagnosis point out the absence of consensus on diagnostic criteria and treatment and blame sensational stories of DID patients like the  1976 TV movie”Sybil” for creating an “epidemic” of MPD diagnoses. The 1990s saw a spate of lawsuits from patients subjected to dubious treatments for multiple personality disorder they said they didn’t have, and many began to believe that DID was not so much treated by psychiatrists but induced by them through the power of suggestion.\n   At the very least, it’s thought that DID may only be a product of fragmentation at high levels of thinking — a breakdown in a brain dealing with complex emotions.\n But Strasburger and Waldvogel say their finding is evidence that DID can unfold at a very basic, biological level. After all, it was not just high-level cognitive functions, like reading, that were affected by B.T.’s condition — even basic things like depth perception were difficult for her. And B.T.’s doctors could see all that playing out in her brain right in front of them on the EEG.\n The case study shows that DID “is a legitimate psycho-physiologically based syndrome of psychological distress,” Dr. Richard P. Kluft, a clinical professor of psychiatry at Temple University School of Medicine not associated with the study, told  Brain Decoder. The condition is not just a product of culture and psychiatrists’ suggestions, he said; as in B.T.’s case, it “represents the mind’s attempt to compartmentalize its pain.”\n     Share your feedback by emailing the author. Have a question about our comment policies? Review our  guidelines or contact the commenting team  here.", "posttime": "2020-08-13 21:36:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "个性,woman,大脑", "title": "转变个性的盲女突然能看见东西(2015)", "title_en": "The blind woman who switched personalities and could suddenly see (2015)", "transed": 1, "url": "https://www.washingtonpost.com/news/morning-mix/wp/2015/11/24/the-blind-woman-who-switched-personalities-and-could-suddenly-see/", "via": "", "real_tags": ["个性", "woman", "大脑"]}, {"category": "", "categoryclass": "", "imagename": "41217ef677aed9f502661fbf763d69b1.jpg", "infoid": 1017934, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "彭博社表示，这些产品最早可能在10月份推出，据说届时新款iPhone将上市。不同的套餐选项将包括一个带有Apple Music和Apple TV+的入门级产品，以及一个添加Apple Arade的升级选项，以及其他还包括Apple News+的产品。根据这份报告，一个更高价格的选项也将捆绑额外的iCloud存储，尽管彭博社也声称这些安排和计划在发布之前仍然可能会改变。\n虽然最终定价没有包括在报告中，但它确实表示，目标是根据级别的不同，每月为订户节省2至5美元，而不是目前订阅这些服务的标准费用。所有订阅也将与苹果现有的家庭共享系统一起使用，这意味着一个家庭最多六名成员可以通过苹果现有的共享家庭数字产品基础设施访问。\n据称，苹果还计划继续其将免费订阅其服务与购买新硬件捆绑在一起的战略-去年推出Apple TV+时使用了这一策略，向购买了最近发布的苹果硬件的客户提供为期一年的免费服务。\n自从苹果开始更认真地投资于其服务选项以来，服务订阅捆绑基本上就是许多苹果观察家一直在呼吁的举措。这一战略很有意义，特别是在帮助苹果提高其服务的采用率方面，这些服务并不一定像其他一些服务那样受欢迎。它还为公司开始建立一个更全面、潜在稳定的经常性收入业务提供了一种方式，类似于亚马逊Prime这样的业务，就其财务表现而言，这是亚马逊经常表现突出的成功故事。", "note_en": "Bloomberg says that these could launch as early as October, which is when the new iPhone is said to be coming to market. Different package options will include one entry-level offering with Apple Music and Apple TV+, alongside an upgrade option that adds Apple Arcade, and other that also includes Apple News+. A higher-priced option will also bundle in extra iCloud storage, according to the report, though Bloomberg also claims that these arrangements and plans could still change prior to launch.\n While the final pricing isn’t included in the report, it does say that the aim is to save subscribers between $2 and $5 per month depending on the tier, vs. the standard cost of subscribing to those services currently. All subscriptions would also work with Apple’s existing Family Sharing system, meaning up to six members of a single household can have access through Apple’s existing shared family digital goods infrastructure.\n  Apple is also said to be planning to continue its strategy of bundling free subscriptions to its services with new hardware purchases – a tactic it used last year with the introduction of Apple TV+, which it offered free for a year to customers who bought recently-released Apple hardware.\n Service subscription bundling is move that a lot of Apple observers have been calling for basically ever since Apple started investing more seriously in its service options. The strategy makes a lot of sense, especially in terms of helping Apple boost adoption of its services which aren’t necessarily as popular as some of the others. It also provides a way for the company to begin to build out a more comprehensive and potentially stable recurring revenue business similar to something like  Amazon   Prime, which is a regular standout success story for Amazon in terms of its fiscal performance.", "posttime": "2020-08-13 21:07:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "apple,苹果,订阅,offer,服务", "title": "\n苹果表示很快将提供结合其多项服务的订阅捆绑包", "title_en": "\n\t\t\t\tApple said to soon offer subscription bundles combining multiple of its services\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/apple-said-to-soon-offer-subscription-bundles-combining-multiple-of-its-services/", "via": "", "real_tags": ["apple", "苹果", "订阅", "offer", "服务"]}, {"category": "", "categoryclass": "", "imagename": "c2f7d8ac8ac8585351b92f5a392db898.jpg", "infoid": 1017933, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌表示，这里的重点是基本面，其中包括性能的提高，例如，应用程序启动时间最高可提高20%的速度。\n该公司还表示，它将改进配对过程，我们将看到用户界面的改进，“更直观地控制不同的手表模式和锻炼”。不过，目前还不清楚具体会是什么样子，因为谷歌没有提供这些变化的任何细节。\n不过，谷歌谈到的一项功能是一款新的洗手计时器，它是为了应对新冠肺炎疫情而发布的。与苹果在watchOS中的自动洗手计时器不同，谷歌的功能不是免提的，你必须点击一个专用的磁贴才能触发它，这让用户不太可能真正经常使用它(但你已经在洗手的同时唱了两次生日歌了，对吧？)。\nWare OS还获得了一种新的天气体验，它将更容易在移动中阅读，提供每小时一次的天气预报，并可以访问当地的天气警报。\nWear OS团队指出，他们还计划将“最好的Android 11”引入可穿戴设备。对于开发人员来说，这主要意味着能够使用最新的Android开发工具来构建他们的Wear OS应用程序。它对用户到底意味着什么还有待观察。\n虽然我们还在等待谷歌发布自己的手表，但该公司今天指出，一些新的手表OEM制造商最近已经签约了Wear OS，包括OPPO、苏腾和小米。", "note_en": "The focus here, Google says, is on fundamentals and that includes improved performance, for example, with up to 20% speed improvements for app startup times, for example.\n The company also said it would improve the pairing process and that we’ll see UI improvements with “more intuitive controls for managing different watch modes and workouts.” What exactly that will look like isn’t clear, though, as Google didn’t provide any details of the changes.\n  One feature that Google talked about though is a new handwashing timer it is releasing in response to the COVID-19 pandemic. Unlike Apple’s automatic handwashing timer in watchOS, Google’s feature is not hands free and you have to tap a dedicated tile to trigger it, which sadly makes it less likely that users will actually regularly use it (but you’re already singing Happy Birthday twice while you’re washing your hands anyway, right?).\n Wear OS is also getting a new weather experience that will be easier to read on the go, provide an hourly forecast and access to local weather alerts.\n  The Wear OS team notes that it also plans to bring “the best of Android 11” to wearables. For developers, that mostly means being able to use the latest Android developer tools to build their Wear OS apps. What exactly it means for users also remains to be seen.\n While we’re still waiting for Google to release its own watch, the company today noted that a number of new watch OEMs have recently signed on Wear OS, including  Oppo,  Suunto and Xiaomi.", "posttime": "2020-08-13 21:06:27", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "性能,os,谷歌", "title": "\nWear OS秋季更新承诺更好的性能、简化的配对以及更多", "title_en": "\n\t\t\t\tThe Wear OS fall update promises better performance, simplified pairing and more\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/13/the-wear-os-fall-update-promises-better-performance-simplified-pairing-and-more/", "via": "", "real_tags": ["性能", "os", "谷歌"]}, {"category": "", "categoryclass": "", "imagename": "769ef02e3a2df3f91531ffb3ceb69b68.png", "infoid": 1017932, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "由于亚马逊(Amazon)的Alexa语音助手的子域存在安全漏洞，可能会被利用来交出用户数据。\n这款智能助手可以在亚马逊回声(Amazon Echo)和回声点(Echo Dot)等设备上找到，全球出货量超过2亿台，很容易受到寻求用户个人身份信息(PII)和语音录音的攻击者的攻击。\nCheck Point Research周四表示，安全问题是由Amazon Alexa子域造成的，这些子域容易受到跨域资源共享(CORS)错误配置和跨站点脚本(XSS)攻击。\n当Check Point第一次开始检查Alexa移动应用程序时，该公司注意到存在一个阻止流量检查的SSL机制。但是，使用Frida SSL通用解锁脚本可以绕过使用的脚本。\n这导致发现该应用程序对CORS策略的错误配置，该策略允许从Amazon子域发送AJAX请求。\n如果发现子域容易受到代码注入的攻击，就可能发起XSS攻击，这是通过track.amazon.com和skillsstore.amazon.com执行的。\n根据Check Point的说法，受害者只需点击恶意链接就可以利用这些漏洞。例如，通过网络钓鱼被路由到域的受害者可能会受到代码注入和与亚马逊相关的cookie的窃取。\n然后，攻击者使用这些cookie向Amazon技能商店发送Ajax请求，该请求将发送回受害者的Amazon Alexa帐户中安装的所有技能的列表。\n通过发起XSS攻击，研究人员还能够获得CSRF令牌，因此可以伪装成受害者执行操作。该团队表示，这可能包括删除或安装Alexa技能，然后使用CSRF令牌删除一项技能，然后安装一个具有相同召唤短语的新技能，这可能会触发攻击者的技能。\n如果受害者无意中触发了这项新技能，攻击者可能会访问语音历史记录，并通过滥用技能交互来获取个人信息。\n在测试中，Check Point发现电话号码、家庭地址、用户名和银行数据历史从理论上讲可能会被窃取。\n该团队表示，亚马逊不会记录您的银行登录凭据，但会记录您的互动记录，由于我们可以访问聊天历史记录，因此我们可以访问受害者与银行技能的互动，并获取他们的数据历史记录。我们还可以获取用户名和电话号码，这取决于用户的Alexa帐户上安装的技能。\n技能滥用是一种有趣的攻击形式，也是网络攻击者进入我们家的一种潜在方式--尽管在恶意技能被发现和删除之前的时间窗口可能很短。\n研究人员说，重要的是要注意，亚马逊会进行安全审查，作为技能认证的一部分，并持续监控现场技能是否存在潜在的恶意行为。&#34；确认的任何违规技能将在认证期间被阻止或迅速停用。&#34；\nCheck Point研究人员在6月份私下向亚马逊披露了他们的发现，现在安全问题已经得到修补。\nCheck Point产品漏洞研究部主管Oed Vanunu评论说，我们进行这项研究是为了强调保护这些设备的安全对于维护用户隐私是多么关键。值得庆幸的是，亚马逊对我们的披露做出了快速反应，关闭了某些亚马逊/Alexa子域名上的这些漏洞。我们希望类似设备的制造商能效仿亚马逊的做法，检查他们的产品是否存在可能危及用户隐私的漏洞。\n亚马逊的一位发言人告诉ZDNet，我们设备的安全是重中之重，我们感谢Check Point这样的独立研究人员的工作，他们给我们带来了潜在的问题。这个问题引起我们的注意后不久，我们就修复了它，并继续进一步加强我们的系统。我们不知道有任何这种漏洞被用来对付我们的客户的情况，也没有任何客户信息被泄露的情况。&#34；\n有小费吗？通过WhatsApp|Signal+447713 025499或通过KeyBase：charlie0安全联系", "note_en": "Amazon&#39;s Alexa voice assistant could be exploited to hand over user data due to security vulnerabilities in the service&#39;s subdomains.\n    The smart assistant, which is found in devices such as the Amazon Echo and Echo Dot -- with over 200 million shipments worldwide -- was vulnerable to attackers seeking user personally identifiable information (PII) and voice recordings.\n Check Point Research  said on Thursday that the security issues were caused by Amazon Alexa subdomains susceptible to Cross-Origin Resource Sharing (CORS) misconfiguration and cross-site scripting (XSS) attacks.\n When Check Point first began examining the Alexa mobile app, the company noticed the existence of an SSL mechanism that prevents traffic inspection. However, the script used could be bypassed using the Frida SSL universal unpinning script.\n  This led to the discovery of the app&#39;s misconfiguration of CORS policy, which allowed Ajax requests to be sent from Amazon subdomains.\n If a subdomain was found as vulnerable to code injection, an XSS attack could be launched, and this was performed via track.amazon.com and skillsstore.amazon.com.\n   According to Check Point, it would only take a victim to click on a malicious link to exploit the vulnerabilities. A victim routed to a domain via phishing, for example, could be subject to code injection and the theft of their Amazon-related cookies.\n An attacker would then use these cookies to send an Ajax request to the Amazon skill store, of which the request would send back a list of all skills installed in the victim&#39;s Amazon Alexa account.\n By launching an XSS attack, researchers were also able to acquire CSRF tokens and, therefore, perform actions while masquerading as the victim. This could include removing or installing Alexa skills, and by using the CSRF token to remove a skill and then installing a new one with the same evocation phrase, this could &#34;trigger an attacker skill,&#34; the team says.\n Should a victim trigger this new skill unwittingly, it may be possible for attackers to access voice history records, as well as abuse skill interactions to harvest personal information.\n  During tests, Check Point found phone numbers, home addresses, usernames, and banking data history could theoretically be stolen.\n &#34;Amazon does not record your banking login credentials, but your interactions are recorded, and since we have access to the chat history, we can access the victim&#39;s interaction with the bank skill and get their data history,&#34; the team says. &#34;We can also get usernames and phone numbers, depending on the skills installed on the user&#39;s Alexa account.&#34;\n   Skill abuse is an interesting form of attack and a potential way for cyberattackers to enter our homes -- although the time window before malicious skills are spotted and removed may be short.\n  &#34;It&#39;s important to note that Amazon conducts security reviews as part of skill certification, and continually monitors live skills for potentially malicious behavior,&#34; the researchers say. &#34;Any offending skills that are identified are blocked during certification or quickly deactivated.&#34;\n Check Point researchers disclosed their findings privately to Amazon in June, and the security issues have now been patched.\n &#34;We conducted this research to highlight how securing these devices is critical to maintaining users&#39; privacy,&#34; commented Oded Vanunu, Check Point&#39;s Head of Products Vulnerabilities Research. &#34;Thankfully, Amazon responded quickly to our disclosure to close off these vulnerabilities on certain Amazon/Alexa subdomains. We hope manufacturers of similar devices will follow Amazon&#39;s example and check their products for vulnerabilities that could compromise users&#39; privacy.&#34;\n &#34;The security of our devices is a top priority, and we appreciate the work of independent researchers like Check Point who bring potential issues to us,&#34; an Amazon spokesperson told ZDNet. &#34;We fixed this issue soon after it was brought to our attention, and we continue to further strengthen our systems. We are not aware of any cases of this vulnerability being used against our customers or of any customer information being exposed.&#34;\n      Have a tip? Get in touch securely via WhatsApp | Signal at +447713 025 499, or over at Keybase: charlie0", "posttime": "2020-08-13 21:04:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "漏洞,数据,data,技能", "title": "研究人员说，现在修补的Alexa漏洞可能被利用来交出用户的个人数据、语音记录、银行数据历史记录等", "title_en": "Researchers say a now-patched Alexa vulnerability could have been exploited to hand over users' personal data, voice recordings, banking data history, and more", "transed": 1, "url": "https://www.zdnet.com/article/in-one-click-amazon-alexa-could-be-exploited-for-theft-of-voice-history-pii-skill-tampering/", "via": "", "real_tags": ["漏洞", "数据", "data", "技能"]}, {"category": "", "categoryclass": "", "imagename": "c5d9e74f896a6015dfa6e0660e8ce7b7.jpg", "infoid": 1017931, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特拉维夫-以色列周三声称，它挫败了一个与朝鲜有关联的黑客组织对其机密国防工业的网络攻击。\n国防部表示，攻击是“实时”转移的，其计算机系统没有受到“伤害或破坏”。\n然而，最先曝光此次攻击的国际网络安全公司ClearSky的安全研究人员表示，朝鲜黑客侵入了计算机系统，很可能窃取了大量机密数据。以色列官员担心这些数据可能会与朝鲜的盟友伊朗共享。\n这起事件将以色列添加到朝鲜黑客部门的目标国家和公司名单中，该部门被私人安全分析师称为拉撒路集团(Lazarus Group)。美国和以色列官员表示，拉撒路集团(Lazarus Group)，也被称为隐藏的眼镜蛇(Hidden Cobra)，得到了平壤的支持。\n美国联邦检察官在2018年的刑事起诉书中揭露了拉撒路集团(Lazarus Group)的朝鲜成员，起诉书称，该组织代表朝鲜军事情报部门Lab 110工作。\n起诉书指控该组织在朝鲜2017年毁灭性的“想哭”(WannaCry)勒索软件攻击中发挥了作用，该攻击导致150个国家的30万台电脑瘫痪；2016年孟加拉国银行8100万美元的网络盗窃；以及2014年索尼影视娱乐公司(Sony Pictures Entertainment)遭受的严重网络攻击，导致高管电子邮件泄露，并摧毁了该公司三分之二以上的计算机服务器。据追踪该组织的美国和英国官员称，尽管该组织的记录好坏参半，但朝鲜日益壮大的6000多名黑客大军只会随着时间的推移变得更加老练和大胆。\n在去年4月的一份报告中，国务院、国土安全部(Department Of Homeland Security)、财政部和联邦调查局(FBI)的官员指责朝鲜越来越多地使用数字手段来逃避制裁，为其核武器项目赚取收入。该报告还指责朝鲜将其黑客买通给其他网络罪犯和国家，这就是所谓的“受雇黑客行为”。\n一名以色列安全官员表示，人们担心被盗数据不仅会被朝鲜使用，还会被伊朗使用。\n近几个月来，以色列一直在与伊朗进行不断升级的网络冲突。以色列表示，它在4月份挫败了对其供水基础设施的网络攻击，官员们表示，这次攻击的目的是将氯提高到危险的水平，因为以色列人与冠状病毒一起被隔离在家里。\n指责伊朗的以色列在两周后进行了报复，在5月初对伊朗一个港口发动网络攻击，导致其电脑下线，并在伊朗沙希德·拉贾伊(Shahid Rajaee)港口设施周围造成长达数英里的航运交通。\nClearSky的研究人员说，朝鲜对以色列国防工业的攻击始于去年6月在LinkedIn上的一条消息。伪装成波音猎头的朝鲜黑客向一家以色列政府所有的公司的一名高级工程师发送了一条信息，该公司为以色列军方和情报部门制造武器。\n黑客为猎头达娜·洛普(Dana Lopp)创建了一个假的LinkedIn个人资料。确实有一位真正的洛普女士，她是波音公司的高级人事招聘人员。周三，她没有回复消息。\n洛普是朝鲜黑客在LinkedIn上模仿的几家知名国防和航空航天公司的猎头公司之一，这些公司包括波音公司(Boeing)、麦克唐奈·道格拉斯公司(McDonnell Douglas)和BAE系统公司(BAE Systems)。\n在与以色列目标建立联系后，黑客要求提供电子邮件地址或电话号码，以便通过WhatsApp联系，或者为了增加可信度，建议切换到现场通话。一些接到电话的人，ClearSky后来联系到了他们，他们说对方说的英语没有口音，听起来很可信。\n研究人员说，拉撒路以前从未展示过这种水平的复杂程度。以色列官员周三猜测，朝鲜可能将部分业务外包给了在国外以英语为母语的人。\n在某个时候，黑客要求向他们的目标发送一份工作要求清单。该文件包含隐形间谍软件，它渗透到该雇员的个人电脑中，并试图爬入以色列的机密网络。\n克利尔斯基说，今年初开始的这些攻击，“根据我们的评估，成功地感染了以色列和全球的数十家公司和组织”。\n与朝鲜去年试图侵入以色列国防工业的尝试相比，这次黑客行动是一个引人注目的进步。2019年，ClearSky报道了Lazarus通过发送可能是用电子翻译写的断断续续的希伯来语的电子邮件，试图侵入一家以色列国防公司的电脑，这一努力有些笨拙。这些电子邮件立即引起怀疑，攻击被阻止。\n朝鲜黑客似乎吸取了教训，2019年年中开始使用LinkedIn和WhatsApp与西方多个军工企业建立联系，攻击欧洲和中东的航空航天和防务公司。今年8月，联合国的一份报告称，朝鲜黑客使用了类似的方法追踪该组织和成员国的官员。\nClearSky的首席执行官兼所有者博阿兹·多列夫(Boaz Dolev)表示，在这些报道之后，该公司开始看到有人试图攻击以色列的国防公司。它很快发现了Lazarus给以色列国防公司员工的假LinkedIn个人资料和消息。\nClearsky研究人员发现，在至少两个案例中，朝鲜黑客在以色列网络上安装了黑客工具。该工具名为远程访问特洛伊木马，朝鲜黑客此前曾在针对土耳其银行和其他受害者的网络攻击中使用过，窃取密码和其他数据。\n研究人员说，这次成功的安装是一个危险信号，表明朝鲜比官员们透露的更深入以色列的网络。\n多列夫说，“朝鲜的Lazarus再次证明了它在社会工程和黑客方法方面的高能力和独创性。”\n他说，企业安全变得越好，越多的民族国家和网络罪犯将试图通过社交媒体和电子邮件钓鱼攻击来攻击员工个人。\n“攻击者总是寻找新的漏洞，”他说。防御越好，“针对员工、他们的家人和家用计算设备的攻击就会越多。”", "note_en": "TEL AVIV — Israel claimed Wednesday that it had thwarted a cyberattack by a North Korea-linked hacking group on its classified defense industry.\n The Defense Ministry said the attack was deflected “in real time” and that there was no “harm or disruption” to its computer systems.\n However, security researchers at ClearSky, the international cybersecurity firm that first exposed the attack, said the North Korean hackers penetrated the computer systems and were likely to have stolen a large amount of classified data. Israeli officials fear the data could be shared with North Korea’s ally, Iran.\n The episode adds Israel to the list of countries and companies that have been targeted by North Korea’s hacking unit, known to private security analysts as the Lazarus Group. American and Israeli officials have said the Lazarus Group, also known as Hidden Cobra, is backed by Pyongyang.\n U.S. federal prosecutors unmasked North Korean members of the Lazarus Group in a 2018 criminal complaint, which said the group was working on behalf of Lab 110, a North Korean military intelligence unit.\n The complaint accused the group of playing a role in North Korea’s devastating 2017 ransomware attack, known as “WannaCry,” which paralyzed 300,000 computers across 150 countries; the 2016 cyber-theft of $81 million from Bangladesh Bank; and the crippling 2014 cyberattack at Sony Pictures Entertainment that resulted in the leak of executive emails and destroyed more than two-thirds of the studio’s computer servers.  Though the  group’s track record is mixed, North Korea’s growing army of more than 6,000 hackers has grown only more sophisticated and emboldened with time, according to American and British officials tracking the group.\n In  a report last April, officials at the State Department, the Department of Homeland Security, the Treasury Department and the F.B.I. accused North Korea of increasingly using digital means to evade sanctions and  generate income for its nuclear weapons program. The report also accused North Korea of shopping out its hackers to other cybercriminals and countries in what is known as “hacking for hire.”\n  An Israeli security official said there was concern that the stolen data would be used not only by North Korea, but by Iran.\n Israel has been fighting an escalating cyberconflict with Iran in recent months. Israel said it foiled a cyberattack on its water infrastructure in April that officials said was aimed at  raising chlorine to dangerous levels as Israelis were quarantined at home with the coronavirus.\n Israel, which blamed Iran, retaliated two weeks later with  a cyberattack on an Iranian port that knocked its computers offline and created miles-long shipping traffic around Iran’s Shahid Rajaee port facility in early May.\n The North Korean attack on Israeli’s defense industry began with a LinkedIn message last June, ClearSky researchers said. North Korean hackers posing as a Boeing headhunter sent a message to a senior engineer at an Israeli government-owned company that manufactures weapons for the Israeli military and intelligence.\n The hackers created a fake LinkedIn profile for the headhunter, Dana Lopp. There is indeed a real Ms. Lopp, a senior personnel recruiter at Boeing. She did not respond to a message on Wednesday.\n Ms. Lopp was one of several headhunters from prominent defense and aerospace companies — including Boeing, McDonnell Douglas and BAE Systems — whom North Korea’s hackers mimicked on LinkedIn.\n After establishing contact with their Israeli targets, the hackers asked for an email address or phone number to connect via WhatsApp or, to increase credibility, suggested switching to a live call. Some of those who received the calls, and whom ClearSky approached later, said the other side spoke English without an accent and sounded credible.\n That level of sophistication had not been demonstrated by Lazarus before, the researchers said. Israeli officials speculated Wednesday that North Korea may have outsourced some of their operation to native English speakers abroad.\n At some point, the hackers asked to send their targets a list of job requirements. That file contained invisible spyware that infiltrated the employee’s personal computer and attempted to crawl into classified Israeli networks.\n ClearSky said the attacks, which started early this year, “succeeded, in our assessment, to infect several dozen companies and organizations in Israel” and around the globe.\n The hacking campaign was a notable step up from a previous attempt by North Korea to hack the Israeli defense industry last year. In 2019, ClearSky reported a somewhat clumsy effort by Lazarus to break into an Israeli defense corporation’s computers by sending emails in broken Hebrew that were likely written with electronic translation. The emails immediately aroused suspicion and the attack was stopped.\n North Korea’s hackers appear to have learned their lesson and in mid-2019 began using LinkedIn and WhatsApp to establish contact with a number of military industries in the West,  attacking aerospace and defense companies in Europe and the Middle East. In August,  a United Nations report said that North Korean hackers used similar methods to track officials of the organization and of member states.\n Boaz Dolev, the chief executive and owner of ClearSky, said that in the wake of these reports the company began seeing attempts to attack Israeli defense companies. It quickly found Lazarus’s fake LinkedIn profiles and messages to employees of Israeli defense companies.\n ClearSky researchers discovered that, in at least two cases, North Korea’s hackers had installed hacking tools on Israeli networks. The tool, known as a remote access trojan, has been used by North Korean hackers in previous cyberattacks on Turkish banks and other victims, stealing passwords and other data.\n The successful installation was a red flag, researchers said, that North Korea made it further into the Israeli networks than officials let on.\n “North Korea’s Lazarus is once again proving high capability and originality in its social engineering and hacking methods,” Mr. Dolev said.\n The better corporate security becomes, he said, the more nation-states and cybercriminals will try to target employees’ personally via social media and email phishing attacks.\n “Attackers always look for new vulnerabilities,” he said. The better the defenses, “the more attacks will focus on employees, their families and home computing equipment.”", "posttime": "2020-08-13 21:03:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,表示,thwarted,以色列", "title": "以色列表示，他们挫败了与朝鲜有关联的黑客组织Lazarus对其国防工业的攻击，但研究人员表示，机密数据可能被窃取", "title_en": "Israel says it thwarted an attack on its defense industry by North Korea-linked hacking group Lazarus, but researchers say classified data was likely stolen", "transed": 1, "url": "https://www.nytimes.com/2020/08/12/world/middleeast/north-korea-hackers-israel.html", "via": "", "real_tags": ["黑客", "表示", "thwarted", "以色列"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017930, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2018年11月28日：我在结尾处添加了一个小更新，介绍如何使用每个插槽生成计数器防止“处理冲突”\n…。其中我稍微谈了一下最近我是如何在C和C++中进行动态内存管理的，它基本上是用“索引句柄”取代了原始指针和智能指针。\n在我上一篇博客文章中，我提到了免指针和免分配编程，但是跳过了细节。这就是下面这篇博文的主题。\n这一切都是基于与相当大的C++代码库(0.5到1MLOC)搏斗了15年以上(有时很痛苦)的经历，在这些代码库中，内存通常是通过智能指针来管理的。最糟糕的情况是数以万计到几十万个小C++对象，每个对象都在自己的堆分配中，通过智能指针相互指向。虽然这类代码在内存损坏方面相当健壮(段错误和损坏很少发生，因为大多数尝试在解除引用智能指针时都被断言捕获)，但这种类型的“对象蜘蛛网络代码”也非常慢，没有明显的优化起点，因为整个代码充满了缓存未命中。其他典型的问题是内存碎片和“假内存泄漏”，因为忘记的智能指针会阻止释放底层内存(我称之为“假泄漏”，因为内存调试工具无法捕获这种类型的泄漏)。\n这里介绍的并不是什么特别新或特别聪明的东西，它只是收集了一些简单的想法，它们一起在较大的代码库中工作得相当好，可以防止(或至少早期检测)C和C++中与内存有关的一些常见问题，甚至在更高级别的垃圾收集语言中可能会很有用，以减轻垃圾收集器的压力。\n然而，底层的设计哲学并不能很好地适应典型的OOP世界，在这个世界中，应用程序是由相互交互的小型自主对象构建的。这就是为什么在现有的大型OOP代码库中实现这些想法也相当棘手的原因，在那里，对象的创建和销毁发生在整个代码中“分散的”。\n不过，这里描述的方法在面向数据的体系结构中工作得非常好，在这种体系结构中，中央系统在内存中紧密打包的数据项阵列上工作。\n下面的博客文章大部分是从游戏开发人员的角度撰写的，但也应该适用于程序需要在内存中同时处理几百到几百万个对象(或一般的“数据项”)，以及经常创建和销毁此类项的其他领域。\n将所有内存管理移至集中系统(如渲染、物理、动画、…)。，系统是其内存分配的唯一所有者。\n将相同类型的项分组到数组中，并将数组基指针视为系统私有。\n创建项目时，只向外部世界返回一个‘index-Handle’，而不是指向该项目的指针。\n在索引句柄中，只使用数组索引所需的位数，其余位用于额外的内存安全检查。\n只有在绝对需要时才将句柄转换为指针，并且不要将指针存储在任何地方。\n下面我将详细解释其中的每一点。但基本的想法是，通用的“用户级”代码不会直接调用内存分配函数(如malloc、new或make_share/make_only)，并将指针的使用减少到绝对最少(只有在绝对需要直接访问内存时才作为短暂的引用)。最重要的是，指针永远不是项的底层内存的“所有者”。\n相反，直接内存操作尽可能多地发生在少数集中式系统中，在这些系统中，与内存相关的问题更容易调试和优化。\n在这篇博客中，“系统”是代码库的一部分(通常相当大)，它负责许多相关的任务，比如“渲染”、“物理”、“人工智能”、“角色动画”等等。这样的系统通过清晰定义的函数API与其他系统和“用户代码”分开，对系统数据所做的工作在紧密的中心循环中执行，而不是分散在整个代码库中。\n系统通常在用户代码的控制下创建和销毁项目(但请注意，创建和销毁项目不同于分配和释放这些项目使用的内存！)。例如，渲染系统可能处理顶点缓冲区、纹理、着色器和管道状态对象，物理系统处理刚体、关节和碰撞基本体，动画系统处理动画关键点和曲线。\n将这些项的内存管理转移到系统本身是有意义的，因为一般的内存分配器不具备关于如何处理数据项以及数据项之间的关系的系统特定的“域知识”。这允许系统优化内存分配，在创建和销毁项目时执行额外的验证检查，并在内存中安排项目以最大限度地利用CPU的数据缓存。\n这种“系统域知识”的一个很好的例子是用现代3DAPI呈现资源对象的破坏：资源对象不能简单地在用户代码指示时立即销毁，因为该资源可能仍在等待GPU使用的命令列表中被引用。相反，呈现系统只会在用户代码请求销毁资源对象时将其标记为销毁，但实际销毁会在稍后GPU不再使用该资源时发生。\n一旦所有内存管理转移到系统中，系统就可以利用其关于howitems的附加知识来优化内存分配和内存布局。一个明显的优化是通过将相同类型的项分组到数组中，并在系统启动时分配这些数组来减少通用内存分配的数量。\n系统不会在每次创建新项时执行内存分配，而是跟踪空闲数组插槽，并挑选下一个空闲插槽。当用户代码不再需要该项时，系统简单地再次将插槽标记为空闲，而不是执行释放分配(与典型的池分配器没有什么不同)。\n这种池分配很可能比按项执行内存分配要快一点，但这甚至不是将项保存在数组中的主要原因(现代通用分配器对于小分配也相当快)。\n项目保证被紧密地打包在内存中，一般分配器有时需要在实际项目内存旁边保留一些内务数据。\n在连续的内存范围内保存“热门项目”更容易，这样CPU就可以更好地利用它的数据缓存\n还可以将单个项的数据拆分成不同数组中的几个子项，以实现更紧密的打包和更好的数据缓存使用(AoS与SoA以及两者之间的所有内容)，并且所有这些数据布局细节都是系统私有的，更改起来微不足道，不会影响“外部代码”\n只要系统不需要重新分配数组，就可以保证不会出现内存碎片(尽管这在64位地址空间中问题不大)。\n更容易及早发现内存泄漏，并提供更有用的错误消息：当创建新项目时，系统可以根据预期上限简单地检查当前项目数量(例如，游戏可能知道一次活动的纹理不应该超过1024个，而且由于所有纹理都是通过渲染系统创建的，因此当超过这个数字时，系统可以打印出更有用的警告消息)。\n将系统项保存在数组中而不是唯一分配的优点是，可以通过数组索引来标识项，而不需要完整的指针。这对于内存安全非常有用，系统可以将数组基指针视为“私有知识”，而不是将内存指针交给外部世界，而只向公众分发数组索引。如果没有基指针来计算项目的内存位置，外部代码就无法访问项目的内存，即使有很大的犯罪能量也是如此。\n在许多情况下，系统外的代码甚至不需要直接访问项的内存，而只需要系统访问。在这种“理想”情况下，用户代码永远不会通过指针访问内存，也不会导致内存损坏。\n因为只有系统知道数组基指针，所以可以随意移动或重新分配项数组，而不会使现有的索引句柄无效。\n与完整指针相比，数组索引需要的位数更少，并且可以为它们选择更小的数据类型，这反过来又允许更紧密地打包数据结构和更好的数据高速缓存使用(这有一个警告，即可以使用额外的句柄位来提高内存安全性，下面将详细介绍这一点)。\n如果用户代码需要直接访问项的内存，则需要通过“查找函数”获取指针，该函数将句柄作为输入并返回指针。一旦存在这样的查找函数，上面概述的相当严密的内存安全场景就不再得到保证，用户代码应该遵守以下几条规则：\n指针不应该存储在任何地方，因为下次使用指针时，它可能不再指向同一项，甚至不再指向有效内存。\n指针应该只在简单的代码块中使用，而不能“跨越”函数调用。\n每次将句柄转换为指针时，系统可以保证返回的指针仍然指向最初为其创建句柄的同一项(下面将详细介绍)，但是这种保证会超时，因为指针下的项可能已被销毁，或者底层内存可能已被重新分配到不同的位置(这与C++中迭代器无效的问题相同)。\n上面两个简单的规则很容易记住，它们是完全不向用户代码公开指针和每次内存访问都有句柄到指针转换(代价有点高)之间的一个很好的折衷。\n首先，每种类型的句柄都应该有自己的C/C++类型，这样就可以在编译时检测到试图将错误的句柄类型传递给函数的行为(请注意，简单的tyecif不足以产生编译器警告，句柄必须包装到它自己的结构或类中-但是，这可以限于调试编译模式)。\n所有运行时内存安全检查都发生在将句柄转换为指针的函数中。如果句柄只是一个数组索引，则如下所示：\n针对当前项数组大小对索引进行范围检查，这可防止分段错误以及读取或写入已分配但不相关的内存区域。\n需要检查索引的数组项槽是否包含活动项(当前不是“空闲槽”)，这会阻止“释放后使用”的简单变体\n最后，根据私有数组基指针和公共项索引计算项指针。\n两者都只能发生在系统的一个函数中，这就是为什么存在两个“指针使用规则”(不要存储指针，不要跨函数调用保留指针)。\n不过，上面的释放后使用检查有一个很大的漏洞：如果我们只检查索引句柄后面的数组槽是否包含有效项，就不能保证它与最初为其创建该句柄的项相同。可能会发生这样的情况：原始物品被销毁，而相同的插槽被重新用于新物品。\n这就是句柄中的“空闲位”的用武之地：假设我们的句柄是16位的，但我们同时只需要1024个活动项。只需要10个索引位就可以寻址1024个项目，这样就有6个位可以用来处理其他事情。\n如果这6位包含某种“唯一模式”，就有可能检测到悬空访问：\n创建项时，会选取一个自由数组项，并将其索引放入较低的10个句柄位。将高6位设置为“唯一位模式”\n得到的16位句柄(10位索引+6位“唯一模式”)返回给外界，同时与数组槽一起存储。\n当项目被销毁时，与数组槽一起存储的项目句柄被设置为“无效句柄”值(可以是零，只要零从未作为有效句柄返回给外界)\n当句柄转换为指针时，低10位用作数组索引以查找数组槽，并将整个16位句柄与当前存储在数组槽中的句柄进行比较：如果两个句柄相等，则指针有效，并指向为其创建该句柄的同一项。\n否则，这是一次悬空访问，插槽项目要么已被销毁(在这种情况下，存储的句柄将具有“无效句柄”值)，要么已被销毁并重新用于新项目(在这种情况下，高6个“唯一模式”位不匹配)。\n在将句柄转换为指针时，这种句柄比较检查可以很好地检测悬空访问，但它不是防水的，因为数组索引和“唯一模式”的相同组合迟早会被创建。但它仍然比根本没有悬空保护(如原始指针)或“假内存泄漏”要好，后者在智能指针的类似情况下会发生。\n当然，找到好的策略来创建尽可能少发生冲突的独特句柄是最重要的部分，并留给读者作为练习；P&lt;foreign language=“English”&gt;P&lt;/foreign&gt;。\n显然，将尽可能多的位用于唯一模式是很好的，并且空闲数组槽的重用方式也很重要(例如，后进先出与先进先出)。编写一些创建/销毁压力测试，检查句柄冲突，并可用于调整特定用例的独特模式创建，可能也很好。与很少创建和销毁物品的系统相比，频繁创建和销毁物品的系统需要更多的工作(或者只是更多的句柄位)。\n除了整个内存安全方面，句柄对于指针有问题的其他情况也很有用：\n句柄可以用作跨进程的共享对象标识符(您所需要的只是某种“create_item_with_handle()”函数，该函数不会创建新的句柄，而是将现有的句柄作为输入参数)。这对于在线游戏特别有用，在游戏会话中，服务器和所有客户端之间可以共享句柄，或者在savegame系统中，用于存储对其他对象的引用。\n有时，创建一整组相关项目(用于实例动画关键点和曲线)并使用单个句柄引用整个项目组非常有用。在这种情况下，可以使用某种“范围句柄”，它不仅包含(第一项的)索引，还包含范围中的项数。\n在某些情况下，如果编译时静态类型检查不够，为项类型保留几个句柄位也很有用。\n总之，我发现用传统的“堆上对象指针”模型很自然、很优雅地解决了我过去遇到的许多问题，现在我很少怀念这个模型(以及围绕它构建的C++部分)。\nSOKOL-gfxAPI是C-API的一个示例，它使用句柄而不是呈现资源对象(缓冲区、图像、着色器、…)的指针。：\nOryol动画扩展模块是一个角色动画系统，它将其所有数据保存在数组中：\n…。在上面的帖子中，我对为同一个位置创建两次相同的唯一标签的问题不屑一顾，推特上的一位好心人暗示我一个非常简单、优雅、令人尴尬的“显而易见”的解决方案：\n每个数组槽都有自己的生成计数器，当释放句柄时会发生碰撞(也可能在创建句柄时发生，但是碰撞释放意味着您不需要“空闲槽”的保留值来检测无效的句柄)。\n要检查句柄是否有效，只需将其唯一标记与其槽中的currentGeneration计数器进行比较即可。\n一旦生成计数器将“溢出”，则禁用该数组插槽，这样就不会为该插槽返回新的句柄。\n这是避免手柄冲突的完美解决方案，但手柄最终会用完，因为所有阵列插槽最终都将被禁用。但是因为每个槽都有自己的计数器，所以这只有在所有句柄位耗尽之后才会发生，而不仅仅是少数几个唯一标记位。\n因此，使用32位句柄，您总是可以创建40亿个项目，同时最多有2^(32-num_counter_bits)处于活动状态。这也意味着唯一标签的位数可以减少，而不会损害“处理安全”。\n一旦可以保证不再有该插槽的句柄在野外(可能在代码中的特殊位置，如进入或退出关卡)，也可以重新激活被禁用的插槽。", "note_en": "28-Nov-2018: I’ve added a small update at the end on how to prevent‘handle collisions’ with a per-slot generation counter\n  …wherein I talk a bit about how I’m doing dynamic memory management in Cand C++ these days which basically replaces raw- and smart-pointers with‘index-handles’.\n In my  last blog post I was mentioningpointer- and allocation-free programming, but was skipping overthe details. This is what the following blog post isabout.\n This is all based on the (sometimes painful) experience of wrestling for 15+years with fairly big C++ code bases (0.5 to around 1 mloc) where memory isoften managed through smart pointers. The worst case being tens- tohundreds-of-thousands of small C++ objects, each in its own heapallocation, pointing to each other through smart pointers. While such codeis quite robust in terms of memory corruption (segfaults and corruptionrarely happens, since most attempts are caught by asserts when dereferencingsmart pointers), this type of ‘object spiderweb code’ is also dog-slowwithout obvious starting points for optimization, since the entire code is full ofcache misses. Other typical problems are memory fragmentation and ‘fakememory leaks’ because a forgotten smart pointer prevents freeing theunderlying memory (I call them ‘fake leaks’ because this type of leaks cannotbe caught by memory debugging tools).\n Nothing presented here is particularly new or clever, it’s justa collection of a few simple ideas which together work fairly well in biggercode bases to prevent (or at least detect early) a number of commonmemory-related problems in C and C++, and may even be useful in higher-levelgarbage-collected languages to reduce pressure on the garbage collector.\n However, the underlying design philosophy doesn’t fit very well into aclassical OOP world where applications are built from small autonomousobjects interacting with each other. That’s why it’s also quite tricky toimplement those ideas in a big existing OOP code base, where object creationand destruction happens ‘decentralized’ all over the code.\n The approach described here works very well though with a data-orientedarchitecture, where central systems work on arrays of data items packedtightly in memory.\n Most of the following blog post is written from a game developer’sperspective, but should also apply to other areas where a program needs tojuggle a few hundred to a few million objects (or generally ‘data items’) inmemory, and where such items are created and destroyed frequently.\n  move all memory management into centralized systems (like rendering, physics, animation, …), with the systems being the sole owner of their memory allocations\n  group items of the same type into arrays, and treat the array base pointer as system-private\n  when creating an item, only return an ‘index-handle’ to the outside world, not a pointer to the item\n  in the index-handles, only use as many bits as needed for the array index, and use the remaining bits for additional memory safety checks\n  only convert a handle to a pointer when absolutely needed, and don’t store the pointer anywhere\n I’ll explain each of those points in detail below. But the idea is basicallythat common ‘user-level’ code doesn’t directly call memory allocationfunctions (like malloc, new or make_shared/make_unique), and reduces the useof pointers to an absolute minimum (only as short-lived references whendirect memory access to an item is absolutely needed). Most importantly,pointers are never the ‘owner’ of an item’s underlying memory.\n Instead, direct memory manipulation happens as much as possible inside a fewcentralized systems where memory-related problems are easier to debug andoptimize.\n  In this blog post, a ‘system’ is a (usually fairly big) part of a code basewhich takes care of a number of related tasks, like ‘rendering’, ‘physics’,‘AI’, ‘character animation’ and so on. Such a system is separated from othersystems and ‘user-code’ through a clearly defined function API, and the workthat happens on the system’s data is performed in tight central loops insteadof being spread out all over the code base.\n Systems often work on items created and destroyed under control of user code(but note that creation and destruction of items is different from allocatingand freeing the memory used by those items!). For instance a rendering systemmight deal with vertex buffers, textures, shaders and pipeline state objects.A physics system works with rigid bodies, joints and collision primitives,and an animation system works with animation keys and curves.\n It makes sense to move the memory management for such items into the systemsthemselves, because a general memory allocator doesn’t have thesystem-specific ‘domain knowledge’ about how data items are processed and therelationships between data items. This allows the system to optimize memoryallocations, perform additional validation checks when creating anddestroying items, and arrange items in memory for making best use of theCPU’s data caches.\n A good example for this ‘system domain knowledge’ is the destruction ofrendering resource objects with modern 3D APIs: a resource object can notsimply be destroyed immediately when the user code says so because theresource might still be referenced in a command list waiting to be consumedby the GPU. Instead the rendering system would only mark the resource objectfor destruction when the user code requests its destruction, but the actualdestruction happens at a later time when the GPU no longer uses the resource.\n  Once all memory management has moved into systems, the system can optimizememory allocations and memory layout with its additional knowledge about howitems are used. One obvious optimization is to reduce the number of generalmemory allocations by grouping items of the same type into arrays, andallocate those arrays at system startup.\n Instead of performing a memory allocation each time a new item is created,the system keeps track of free array slots, and picks the next free slot.When the user code no longer needs the item, the system simply marks the slotas free again instead of performing a deallocation (not differentfrom a typical pool allocator).\n This pool allocation is most likely a little bit faster than performing amemory allocation per item, but this is not even the main reason for keepingitems in arrays (modern general allocators are quite fast too for smallallocations).\n  items are guaranteed to be packed tightly in memory, general allocators sometimes need to keep some housekeeping data next to the actual item memory\n  it’s easier to keep ‘hot items’ in continuous memory ranges, so that the CPU can make better use of its data caches\n  it’s also possible to split the data of a single item into several subitems in different arrays for even tighter packing and better data cache usage (AoS vs SoA and everything inbetween), and all those data layout details remain private to the system and are trivial to change without affecting ‘outside code’\n  as long as the system doesn’t need to reallocate arrays, it is guaranteed that there will be no memory fragmentation (although this is less of an issue in a 64-bit address space)\n  it’s easier to detect memory leaks early, and provide more useful error messages: when a new item is created a system can trivially check the current number of items against an expected upper bound (for instance a game might know that there should never be more than 1024 textures alive at a time, and since all textures are created through the rendering system, the system can print out a more useful warning message when this number is exceeded)\n  Keeping system items in arrays instead of unique allocations has theadvantage that an item can be identified through an array index instead ofrequiring a full pointer. This is very useful for memory safety.Instead of handing memory pointers to the outside world, the system can treatthe array base pointers as ‘private knowledge’, and only hand out arrayindices to the public. Without the base pointer to compute an item’s memorylocation, the outside code can’t access the item’s memory, even with a lotof criminal energy.\n  In many situations, code outside the system never even needs to directly access memory of an item, only the system does. In such an ‘ideal’ situation, user code never accesses memory through pointers, and can never cause memory corruption.\n  Since only the system knows the array base pointers, it’s free to move or reallocate the item arrays at will without invalidating existing index handles.\n  Array indices need fewer bits than full pointers, and a smaller data type can be picked for them, which in turn allows tighter packing of data structures and better data cache usage (this has the caveat that additional handle bits can be used to increase memory safety, more about this below)\n If user code needs to access the memory of an item directly it needs to obtaina pointer through a ‘lookup function’ which takes a handle as input and returnsa pointer. As soon as such a lookup function exists, the fairly watertight memory safety scenario outlined above is no longer guaranteed, and the user codeshould adhere to a few rules:\n pointers should never be stored anywhere, since the next time the pointer is used it may no longer point to the same item, or even to valid memory\n  a pointer should only be used in a simple code block, and not ‘across’ function calls\n Every time a handle is converted into a pointer, the system can guaranteethat the returned pointer still points to the same item that the handle wasoriginally created for (more on this below), but this guarantee ‘decays’ overtime since the item under the pointer may have been destroyed, or the underlyingmemory may have been reallocated to a different location (this is the sameproblem as iterator invalidation in C++).\n The two simple rules above are easy to memorize and are a good compromise betweennot exposing pointers to user code at all, and having a (somewhat costly) handle-to-pointer conversion for every single memory access.\n  First, each type of handle should get its own C/C++ type, so that attemptingto pass the wrong handle type to a function is already detected at compiletime (note that a simple typedef isn’t enough to produce a compiler warning,the handle must be wrapped into its own struct or class - however this couldbe limited to debug compilation mode).\n All runtime memory safety checks happen in the function which converts ahandle into a pointer. If the handle is just an array index, it would looklike this:\n a range check happens for the index against the current item array size, this prevents segmentation faults and reading or writing allocated but unrelated memory areas\n  a check needs to happen whether the indexed array item slot contains an active item (is not currently a ‘free slot’), this prevents the simple variant of ‘use after free’\n  finally the item pointer is computed from the private array base pointer and public item index\n   Both can only happen inside one of the system’s functions, that’s why the two‘pointer usage rules’ exist (don’t store pointers, don’t keep pointers acrossfunction calls).\n There is a pretty big hole in the above use-after-free check though: if we onlycheck if an array slot behind an index-handle contains a valid item, it’snot guaranteed that it is the  same item the handle was originally createdfor. It can happen that the original item was destroyed, and the samearray slot was reused for a  new item.\n This is where the ‘free bits’ in a handle come in: Let’s say ourhandles are 16-bits, but we only ever need 1024 items aliveat the same time. Only 10 index bits are needed to address 1024 items, whichleaves 6 bits free for something else.\n If those 6 bits contain some sort of ‘unique pattern’, it’s possible todetect dangling accesses:\n When an item is created, a free array item is picked and its index is put into the lower 10 handle bits. The upper 6 bits are set to a ‘unique bit pattern’\n  The resulting 16-bit handle (10 bits index + 6 bit ‘unique pattern’) are returned to the outside world, and at the same time stored with the array slot.\n  When an item is destroyed, the item handle stored with the array slot is set to the ‘invalid handle’ value (can be zero, as long as zero is never returned as a valid handle to the outside world)\n  When the handle is converted to a pointer, the lower 10 bits are used as array index to lookup the array slot, and the entire 16-bit handle is compared against the handle that’s currently stored with the array slot:  if both handles are equal, the pointer is valid and points to the same item the handle was created for\n  otherwise this is a dangling access, the slot item has either been destroyed (in that case the stored handle would have the ‘invalid handle’ value), or has been destroyed and reused for a new item (in that case the upper 6 ‘unique pattern’ bits don’t match)\n This handle-comparison check when converting a handle to a pointer worksquite well to detect dangling-accesses, but it isn’t waterproof because thesame combination of array index and ‘unique pattern’ will be created sooner orlater.But it’s still better than no dangling protection at all (like raw pointers),or a ‘fake memory leak’ which would happen in similar situations with smart pointers.\n Finding good strategies to create unique handles that collide as rarely aspossible is the most important part of course, and left as an excercise tothe reader ;P\n Obviously it’s good to use as many bits for the unique pattern as possible, and theway how free array slots are reused is important as well (e.g. LIFO vs FIFO). It’sprobably also good to write a little creation/destruction stress-test whichchecks for handle collisions and can be used to tweak the unique-pattern creation forspecific use cases. A system where items are created and destroyed with a veryhigh frequency needs more effort (or simply more handle bits) than systems where item creation and destruction is a rare occurance.\n  Apart from the whole memory safety aspect, handles are also useful for other situations where pointers are problematic:\n Handles can be used as shared object identifiers across processes (all you need issome sort of ‘create_item_with_handle()’ function, which doesn’t create a new handle, but takes an existing handle as input argument). This is especiallyuseful for online games where handles can be shared between the server andall clients in a game session, or in savegame systems to store referencesto other objects.\n Sometimes it’s useful to create a whole group of related items (for instanceanimation keys and curves), and reference the whole item group with a singlehandle. In that case some sort of ‘range handle’ can be used, which containsnot only an index (of the first item), but also the number of items in the range.\n In some situations it’s also useful to reserve a few handle bits for an itemtype if static type checking at compile time isn’t sufficient.\n In conclusion, I find it quite surprising how naturally and elegantly handlessolve many problems I encountered in the past with the traditional ‘pointersto objects on the heap’ model, and how little I miss this model now (and theparts of C++ that are built around it).\n  The sokol-gfx API is an example of a C-API which uses handles instead ofpointer of rendering resource objects (buffers, images, shaders, …):\n    The Oryol Animation extension module is a character animation system which keeps all its data in arrays:\n   …in the post above I was sort of handwaving away the problem of creatingthe same unique-tag twice for the same slot, and a nice person on twitterhinted me about a very simple, elegant and embarrassingly ‘obvious’ solution:\n Each array slot gets its own  generation counter, which is bumped when ahandle is released (can also happen when the handle is created, but bumpingon release means you don’t need a reserved value for “free slots” to detectan invalid handle).\n To check if a handle is valid, simply compare its unique-tag with the currentgeneration counter in its slot.\n Once the generation counter would ‘overflow’,  disable that array slot, sothat no new handles are returned for this slot.\n This is a perfect solution for avoiding handle collisions, but the handleswill eventually run out since all array slots will be disabled eventually. Butsince each slot has its own counter, this only happens after  allhandle-bits are exhausted, not just the few unique-tag bits.\n So with 32-bit handles, you can always create 4 billion items, with at most2^(32 - num_counter_bits) alive at the same time. This also means the number ofbits for the unique-tag can be reduced without compromising ‘handle safety’.\n It may also be possible to re-activate disabled slots once it can beguaranteed that no more handles for that slot are out in the wild(maybe at special places in the code like entering or exiting a level).", "posttime": "2020-08-13 21:01:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "句柄,handles,内存", "title": "句柄是更好的指针(2018年)", "title_en": "Handles Are the Better Pointers (2018)", "transed": 1, "url": "https://floooh.github.com/2018/06/17/handles-vs-pointers.html", "via": "", "real_tags": ["句柄", "handles", "内存"]}, {"category": "", "categoryclass": "", "imagename": "c2ebdfab4b4fca2282c5fc4a8657b91a.png", "infoid": 1017929, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Drogon是一个基于C++14/17的HTTP应用程序框架。Drogon可用于使用C++轻松构建各种类型的Web应用程序服务器程序。卓根是美国电视剧“权力的游戏”中一条龙的名字，我真的很喜欢。\nDrogon是一个跨平台的框架，它支持Linux、MacOS、FreeBSD和Windows。它的主要特点如下：\n使用基于EPOLL的非阻塞I/O网络库(MacOS/FreeBSD下的kqueue)提供高并发、高性能的网络IO，详见TFB测试结果；\n在模板的基础上，实现了简单的反射机制，实现了主程序框架、控制器和视图的完全解耦。\n支持后端渲染，控制器将数据生成到视图，生成HTML页面。视图由CSP模板文件描述，C++代码通过CSP标签嵌入到HTML页面中。Drogon命令行工具自动生成C++代码文件进行编译；\n支持过滤链，便于执行统一逻辑(如登录验证、http方法约束验证等)。在处理HTTP请求之前；\n提供轻量级命令行工具drogon_ctl，简化Drogon中各种类的创建和视图代码的生成；\n与大多数C++框架不同，Drogon应用程序的主程序可以保持干净和简单。Drogon使用一些技巧将控制器与主程序分离。控制器的路由设置可以通过宏或配置文件完成。\nDrogon提供了一些直接在main()函数中添加控制器逻辑的接口，例如，用户可以在Drogon中注册如下处理程序：\nApp().registerHandler(&#34；/test？username={name}&#34；，[](const HttpRequestPtr&amp；req，std：：function&lt；void(const HttpResponsePtr&amp；)&gt；&amp；&amp；callback，const std：：string&amp；name){json：：value json；json[&#34；result&#34。Hello，&#34；)+name；auto resp=HttpResponse：：newHttpJsonResponse(Json)；callback(Resp)；}，{get，&#34；LoginFilter&#34；})；\n虽然这样的界面看起来很直观，但它们不适合复杂的业务逻辑场景。假设有数十个甚至数百个处理程序需要在框架中注册，那么在各自的类中分别实现它们不是更好的做法吗？因此，除非您的逻辑非常简单，否则我们不推荐使用上述接口。相反，我们可以创建一个HttpSimpleController，如下所示：\n/使用命名空间Drogon；类TestCtrl：public Drogon：：HttpSimpleController&lt；TestCtrl&gt；{public：virtual void asyncHandleHttpRequest(const HttpRequestPtr&amp；req，std；{public：virtual void asyncHandleHttpRequest(const HttpRequestPtr&amp；req，std。/TestCtrl.cc文件#include&#34；TestCtrl.h&34；void TestCtrl：：asyncHandleHttpRequest(const HttpRequestPtr&amp；req，std：：function&lt；void(const HttpResponsePtr&amp；)&gt；&amp；&amp；callback){//在此处写入您的应用程序逻辑auto resp=。回调(分别)；}。\n上面的大多数程序都可以由Drogon提供的命令行工具drogon_ctl自动生成(命令是drogon_ctl create Controller TestCtrl)。所有用户需要做的就是添加他们自己的业务逻辑。在本例中，控制器返回Hello，world！客户端访问http://ip/test URL时的字符串。\n/使用命名空间Drogon；class JsonCtrl：public Drogon：：HttpSimpleController&lt；JsonCtrl&gt；{public：virtual void asyncHandleHttpRequest(const HttpRequestPtr&amp；req，std：：function&lt。/源文件#include&#34；JsonCtrl.h&#34；void JsonCtrl：：asyncHandleHttpRequest(const HttpRequestPtr&amp；req，std：：function&lt；void(const HttpResponsePtr&amp；)&gt；&amp；&amp；callback){json：：value ret；ret[&#34；message&#34；\n让我们更进一步，使用HttpController类创建一个REST风格的演示API，如下所示(省略源文件)：\n/使用命名空间Drogon；命名空间API{命名空间v1{class user：public Drogon：：HttpController&lt；user&gt；{public：method_list_Begin//使用method_add在这里添加您的自定义处理函数；method_add(user：：getInfo，&#34；/{id}&#34；，get)]头文件#scrima once#include&lt；Drogon/HttpController.h&gt；使用Namespace Drogon；Namespace API{Namespace v1{class user：public Drogon：：HttpController&lt；user&gt；{id}&#34；，get)。//路径为/api/v1/user/{arg1}method_add(user：：getDetailInfo，&#34；/{id}/Detinfo&#34；，get)；//路径为/api/v1/user/{arg1}/Detinfo method_add(user：：newUser，&#34；/{name}&#34；，Post)；//路径为/api/v1/user/{arg1}method_list_end//您的处理函数声明可能如下所示：void getInfo(const HttpRequestPtr&amp；req，std：：function&lt；void(const HttpResponsePtr&amp；)&gt；&amp；&amp；callback，int userID)const；void getDetailInfo(const HttpRequestP。请求，std：：function&lt；void(const HttpResponsePtr&amp；)&gt；&amp；&amp；回调，std：：string&amp；&amp；userName)；public：user(){log_debug&lt；&lt；&#34；User Constructor！&#34；；}}//命名空间v1}//命名空间API\n如您所见，用户可以使用HttpController同时映射路径和参数。这是创建RESTful API应用程序的一种非常方便的方式。\n此外，您还可以发现所有处理程序接口都处于异步模式，其中响应由回调对象返回。这种设计是出于性能原因，因为在异步模式下，Drogon应用程序可以用少量线程处理大量并发请求。\n编译完上述所有源文件后，我们将得到一个非常简单的Web应用程序。这是一个良好的开端。有关更多信息，请访问维基或DocsForge", "note_en": "Drogon is a C++14/17-based HTTP application framework. Drogon can be used to easily build various types of web application server programs using C++.  Drogon is the name of a dragon in the American TV series &#34;Game of Thrones&#34; that I really like.\n Drogon is a cross-platform framework, It supports Linux, macOS, FreeBSD, and Windows. Its main features are as follows:\n Use a non-blocking I/O network lib based on epoll (kqueue under macOS/FreeBSD) to provide high-concurrency, high-performance network IO, please visit the  TFB Tests Results for more details;\n   Based on template, a simple reflection mechanism is implemented to completely decouple the main program framework, controllers and views.\n  Support back-end rendering, the controller generates the data to the view to generate the Html page. Views are described by CSP template files, C++ codes are embedded into Html pages through CSP tags. And the drogon command-line tool automatically generates the C++ code files for compilation;\n   Support filter chains to facilitate the execution of unified logic (such as login verification, Http Method constraint verification, etc.) before handling HTTP requests;\n       Provide a lightweight command line tool, drogon_ctl, to simplify the creation of various classes in Drogon and the generation of view code;\n  Unlike most C++ frameworks, the main program of the drogon application can be kept clean and simple. Drogon uses a few tricks to decouple controllers from the main program. The routing settings of controllers can be done through macros or configuration file.\n     Drogon provides some interfaces for adding controller logic directly in the main() function, for example, user can register a handler like this in Drogon:\n app().registerHandler(  &#34;/test?username={name} &#34;, []( const HttpRequestPtr&amp; req, std::function&lt; void ( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback,  const std::string &amp;name) { Json::Value json; json[  &#34;result &#34;]=  &#34;ok &#34;; json[  &#34;message &#34;]= std::string(  &#34;hello, &#34;)+name;  auto resp= HttpResponse::newHttpJsonResponse(json);  callback(resp); }, {Get,  &#34;LoginFilter &#34;});\n While such interfaces look intuitive, they are not suitable for complex business logic scenarios. Assuming there are tens or even hundreds of handlers that need to be registered in the framework, isn&#39;t it a better practice to implement them separately in their respective classes? So unless your logic is very simple, we don&#39;t recommend using above interfaces. Instead, we can create an HttpSimpleController as follows:\n /// The TestCtrl.h file# pragma once# include   &lt;drogon/HttpSimpleController.h &gt; using  namespace  drogon ; class  TestCtrl: public  drogon::HttpSimpleController&lt;TestCtrl&gt;{ public:  virtual  void  asyncHandleHttpRequest( const HttpRequestPtr&amp; req, std::function&lt; void ( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback)  override; PATH_LIST_BEGIN  PATH_ADD(  &#34;/test &#34;,Get); PATH_LIST_END};  /// The TestCtrl.cc file# include   &#34;TestCtrl.h &#34; void  TestCtrl::asyncHandleHttpRequest( const HttpRequestPtr&amp; req, std::function&lt; void ( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback){   //write your application logic here  auto resp =  HttpResponse::newHttpResponse(); resp-&gt; setBody(  &#34;&lt;p&gt;Hello, world!&lt;/p&gt; &#34;); resp-&gt; setExpiredTime( 0);  callback(resp);}\n Most of the above programs can be automatically generated by the command line tool  drogon_ctl provided by drogon (The cammand is  drogon_ctl create controller TestCtrl). All the user needs to do is add their own business logic. In the example, the controller returns a  Hello, world! string when the client accesses the  http://ip/test URL.\n  /// The header file# pragma once# include   &lt;drogon/HttpSimpleController.h &gt; using  namespace  drogon ; class  JsonCtrl :  public  drogon::HttpSimpleController&lt;JsonCtrl&gt;{  public:  virtual  void  asyncHandleHttpRequest( const HttpRequestPtr &amp;req, std::function&lt; void( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback)  override; PATH_LIST_BEGIN   //list path definitions here;  PATH_ADD(  &#34;/json &#34;, Get); PATH_LIST_END};  /// The source file# include   &#34;JsonCtrl.h &#34; void  JsonCtrl::asyncHandleHttpRequest( const HttpRequestPtr &amp;req, std::function&lt; void( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback){ Json::Value ret; ret[  &#34;message &#34;] =   &#34;Hello, World! &#34;;  auto resp =  HttpResponse::newHttpJsonResponse(ret);  callback(resp);}\n Let&#39;s go a step further and create a demo RESTful API with the HttpController class, as shown below (Omit the source file):\n /// The header file# pragma once# include   &lt;drogon/HttpController.h &gt; using  namespace  drogon ; namespace  api{ namespace  v1{ class  User :  public  drogon::HttpController&lt;User&gt;{  public: METHOD_LIST_BEGIN   //use METHOD_ADD to add your custom processing function here;  METHOD_ADD(User::getInfo,   &#34;/{id} &#34;, Get);   //path is /api/v1/User/{arg1}  METHOD_ADD(User::getDetailInfo,   &#34;/{id}/detailinfo &#34;, Get);   //path is /api/v1/User/{arg1}/detailinfo  METHOD_ADD(User::newUser,   &#34;/{name} &#34;, Post);   //path is /api/v1/User/{arg1} METHOD_LIST_END   //your declaration of processing function maybe like this:  void  getInfo( const HttpRequestPtr &amp;req, std::function&lt; void( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback, int userId)  const;  void  getDetailInfo( const HttpRequestPtr &amp;req, std::function&lt; void( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback, int userId)  const;  void  newUser( const HttpRequestPtr &amp;req, std::function&lt; void( const HttpResponsePtr &amp;)&gt; &amp;&amp;callback, std::string &amp;&amp;userName);  public:  User() { LOG_DEBUG &lt;&lt;   &#34;User constructor! &#34;; }};}   // namespace v1}   // namespace api\n As you can see, users can use the  HttpController to map paths and parameters at the same time. This is a very convenient way to create a RESTful API application.\n In addition, you can also find that all handler interfaces are in asynchronous mode, where the response is returned by a callback object. This design is for performance reasons because in asynchronous mode the drogon application can handle a large number of concurrent requests with a small number of threads.\n After compiling all of the above source files, we get a very simple web application. This is a good start.  For more information, please visit the  wiki or  DocsForge", "posttime": "2020-08-13 21:00:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "c++,web,rapid,drogon", "title": "基于Drogon-C++14/17的快速HTTP和Web应用框架", "title_en": "Drogon – C++14/17-based rapid HTTP and web application framework", "transed": 1, "url": "https://github.com/an-tao/drogon", "via": "", "real_tags": ["c++", "web", "rapid", "drogon"]}, {"category": "", "categoryclass": "", "imagename": "bc1d5af59bed3c4ba8edb55bf5d24b68.jpg", "infoid": 1017928, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我是一名消费者技术专家，撰写关于Windows、PC、笔记本电脑、Mac、宽带等的文章。\nMozilla延长了与谷歌GOOGL的搜索协议，缓解了这家火狐浏览器制造商的财务担忧。\nMozilla公司本周宣布将裁员250人，该公司表示，由于冠状病毒危机，重组工作已经加快。\nMozilla的大部分收入来自搜索协议，比如它与谷歌达成的协议，谷歌将谷歌Set视为Firefox在美国和其他地区的默认搜索引擎。然而，2017年与谷歌签署的协议原定于今年晚些时候到期，这引发了人们对Mozilla未来的进一步担忧。\nMozilla的一位发言人一夜之间向我证实，Mozilla已经与谷歌达成了一项新协议。这位发言人在一份书面声明中证实：“我们最近延长了合作伙伴关系，关系没有改变。”\n目前还不清楚新协议的条款是否与之前的协议相同，但延期的消息将让Mozilla的剩余员工和Firefox浏览器的粉丝松一口气。\n火狐作为浏览器的受欢迎程度不断下降，这引发了人们的担忧，即谷歌可能不会认为延长搜索协议是值得的。\n根据NetMarketShare的数据，火狐的台式机市场份额为7.8%，自2017年签署上一笔谷歌交易以来，下降了近4个百分点。与此同时，移动版火狐只是一条小鱼，全球市场份额不到1%。\nMozilla在财务上如此依赖其最大的竞争对手，这一事实长期以来一直是一个令人担忧的问题，并导致Mozilla开发了其他营收产品，比如最近推出的VPN。\nMozilla首席执行官米切尔·贝克(Mitchell Baker)本周早些时候表示，公司必须继续开发付费产品，并辩称“所有东西都是免费的旧模式会产生后果”。", "note_en": "I am a consumer tech expert writing about Windows, PCs, laptops, Mac, broadband and more.\n Mozilla has extended its search deal with Google    GOOGL , easing the financial concerns at the Firefox browser maker.\n  Mozilla Corporation this week announced it was shedding 250 jobs, in a reorganization that it said had been accelerated because of the Coronavirus crisis.\n  The majority of Mozilla’s revenue comes from search deals such as the one it has in place with Google, which sees Google set as Firefox’s default search engine in the U.S. and other territories. However, the deal signed with Google in 2017 was due to expire later this year, raising further concern about Mozilla’s future.\n     A Mozilla spokesperson has overnight confirmed to me that Mozilla has a new deal in place with Google. “We&#39;ve recently extended the partnership, and the relationship isn&#39;t changing,” the spokesperson confirmed in a written statement.\n  It’s not clear whether the new deal is on the same terms as the previous agreement, but news of the extension will come as a relief to Mozilla’s remaining employees and fans of the Firefox browser.\n    Firefox’s declining popularity as a browser had raised concerns that Google might not regard an extension of the search deal as worthwhile.\n  Firefox’s desktop market share is 7.8%, according to  NetMarketShare, down almost four percentage points since the last Google deal was signed in 2017. The mobile version of Firefox, meanwhile, is a minnow, with less than 1% global market share.\n  The fact that Mozilla is so financially dependent on its biggest rival has long been a source of concern and has led Mozilla to develop other revenue-raising products, such as its recently launched VPN.\n  Mozilla CEO Mitchell Baker stated earlier this week that the company must continue to develop paid-for products, arguing that “the old model where everything was free has consequences”.", "posttime": "2020-08-13 20:50:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,谷歌,google,延长,extends", "title": "Mozilla延长与谷歌的Firefox搜索协议", "title_en": "Mozilla extends Firefox search deal with Google", "transed": 1, "url": "https://www.forbes.com/sites/barrycollins/2020/08/13/mozilla-extends-critical-firefox-search-deal-with-google/#7dc07d8b6ea2", "via": "", "real_tags": ["firefox", "谷歌", "google", "延长", "extends"]}, {"category": "", "categoryclass": "", "imagename": "e57c242eece10742469c74c7a555870f.png", "infoid": 1017927, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据《纽约时报》对美国疾病控制和预防中心(Centers For Disease Control And Prevention)估计数据的分析，自3月份以来，全美至少比往常多了20万人死亡。这比与冠状病毒直接相关的死亡人数高出约6万人。\n随着大流行从震中纽约市向南和向西移动，各种原因造成的不同寻常的死亡模式也是如此。这表明官方的死亡数字可能大大低估了病毒的整体影响，因为人们死于病毒以及其他与大流行有关的原因。\n今年3月，当冠状病毒首次在美国流行时，大部分死亡人数高于正常水平，或称“超额死亡”，发生在东北部，当时纽约和新泽西的死亡人数大幅上升。\n东北地区仍然占全国所有额外死亡人数的近一半，尽管该地区的人数自4月份的峰值以来已经大幅下降。\n但随着热点地区数量的扩大，该国其他地区的超额死亡人数也在增加。最近在南部和西部发生的许多冠状病毒病例和死亡可能在很大程度上是由重新开放和放松社会距离限制推动的。\n统计死亡人数需要时间，许多州的报告都落后了几周或几个月。美国疾病控制与预防中心的估计是根据前几年死亡率数据的滞后情况进行调整的。即使进行了这一调整，如果死亡率的增加导致各州比过去滞后更多，或者如果各州改变了报告系统，那么可能会低估整个死亡人数。\n但是，比起只跟踪确诊患者的死亡情况，比较最近所有原因造成的死亡总数，可以更全面地了解大流行的影响。\n下面的图表显示了每个州每周的死亡人数比平时高出多少。最近达到高峰的州-在大流行期间看到死亡人数最多的那一周-出现在第一位。对于每个州，不包括数据可能不完整的周。\n南方13个州中有9个州在7月份，也就是大流行的几个月后，开始出现死亡人数激增的情况。德克萨斯州等地病例的激增给医院带来了压力，呼应了几个月前纽约随后出现的混乱局面。南卡罗来纳州是首批重新开放零售店的州之一，7月中旬死亡人数达到正常水平的1.6倍。\n与该地区的其他州不同，路易斯安那州的超额死亡人数在4月份达到顶峰-当时总死亡人数达到了正常水平的1.7倍。医学专家说，狂欢节的聚会很可能是造成这一激增的原因。\n7月份，亚利桑那州的冠状病毒死亡人数激增，尽管此后每天新增病例有所减少。在加利福尼亚州，今年春天第一个发布在家命令的州，冠状病毒死亡人数在7月份攀升，此前一些卫生官员警告称，重新开放的速度太快了。\n在中西部，密歇根州和伊利诺伊州等一些州在4月份达到了顶峰。底特律受到病毒的打击尤其严重。\n在大流行的头几个月，纽约市是冠状病毒爆发的震中，它受到令人震惊的死亡总数的困扰，死亡总数达到了正常水平的七倍多。东北部的其他地区，包括新泽西州，马萨诸塞州和康涅狄格州也出现了早期的激增。总体而言，自那以来，该地区大部分地区的利率都大幅下降。\n总死亡人数是来自疾病控制和预防中心(Centers For Disease Control And Prevention)的估计数字，该数字基于疾控中心统计的死亡证明，并进行了调整，以考虑到死亡报告的典型滞后。\n疾控中心估计数据至少完成90%或估计死亡人数高于预期死亡人数的几周才包括在内。报告的死亡人数不到疾控中心估计的50%的几周不包括在内。由于各州向联邦政府报告死亡人数的速度有所不同，州图表可能会有不同时间段的数据。\n预计死亡人数是用一个简单的模型计算的，该模型基于疾病控制和预防中心(Centers For Disease Control And Prevention)发布的2017年至2019年每周全原因死亡人数，并根据人口变化等趋势进行了调整。", "note_en": "Across the United States, at least  200,000 more people have died than usual since March, according to a New York Times analysis of estimates from the  Centers for Disease Control and Prevention. This is about 60,000 higher than the number of deaths that have been  directly linked to the coronavirus.\n As the pandemic has moved south and west from its epicenter in New York City, so have the unusual patterns in deaths from all causes. That suggests that the official death counts may be substantially underestimating the overall effects of the virus, as people die from the virus as well as by  other causes linked to the pandemic.\n When the coronavirus first took hold in the United States in March, the bulk of deaths above normal levels, or “excess deaths,” were in the Northeast, as New York and New Jersey saw huge surges.\n The Northeast still makes up nearly half of all excess deaths in the country, though numbers in the region have drastically declined since the peak in April.\n But as the number of hot spots expanded, so has the number of excess deaths across other parts of the country. Many of the  recent coronavirus cases and deaths in the South and the West may have been driven largely by  reopenings and relaxed social distancing restrictions.\n  Counting deaths takes time and many states are weeks or months behind in reporting. The estimates from the C.D.C. are adjusted based on how mortality data has lagged in previous years. Even with this adjustment, it’s possible there could be an underestimate of the complete death toll if increased mortality is causing states to lag more than they have in the past or if states have changed their reporting systems.\n But comparing recent totals of deaths from all causes can provide a more complete picture of the pandemic’s impact than tracking only deaths of people with confirmed diagnoses.\n  The charts below show how much higher than usual weekly deaths have been in each state. States with the most recent peaks — the week when they saw the most excess deaths during the pandemic — appear first. For each state, weeks in which data may be incomplete are excluded.\n  Nine of the 13 states in the South started seeing excess deaths surge in July, months into the pandemic. A spike in cases in places like Texas put  pressure on hospitals, echoing the chaos that ensued in New York months earlier. South Carolina, among the  first states to reopen retail stores, saw deaths reach 1.6 times normal levels in mid-July.\n Unlike other states in this region, Louisiana saw its excess deaths peak in April — when total deaths reached 1.7 times normal levels. Medical experts said  Mardi Gras gatherings most likely contributed to this spike.\n  In July, coronavirus deaths in Arizona surged, though new daily cases have since decreased. In California, the first state to issue a stay-at-home order this spring, coronavirus deaths climbed up in July, after a reopening that some health officials warned was  too fast.\n  In the Midwest, some states like Michigan and Illinois saw their peaks in April. Detroit was particularly  hard hit by the virus.\n  New York City in the first few months of the pandemic was the epicenter of the coronavirus outbreak, and it was plagued by  staggering death totals, which peaked at more than seven times normal levels. Other areas of the Northeast, including New Jersey, Massachusetts and Connecticut also saw early surges. Over all, rates have decreased significantly since then in much of the region.\n  Total death numbers are estimates from the  Centers for Disease Control and Prevention, which are based on death certificates counted by the C.D.C. and adjusted to account for typical lags in the reporting of deaths.\n  Only weeks in which the C.D.C. estimates the data to be at least 90 percent complete or estimated deaths were above expected death numbers are included. Weeks in which reported deaths were less than 50 percent of the C.D.C. estimate are not included. Because states vary somewhat in their speed in reporting deaths to the federal government, state charts may have data for different time periods.\n  Expected deaths were calculated with a simple model based on the weekly number of all-cause deaths from 2017 to 2019 released by the  Centers for Disease Control and Prevention, adjusted to account for trends, like population changes, over time.", "posttime": "2020-08-13 20:48:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,美国,coronavirus,病毒,死亡", "title": "美国真正的冠状病毒死亡人数已经超过20万", "title_en": "The True Coronavirus Toll in the U.S. Has Already Surpassed 200,000", "transed": 1, "url": "https://www.nytimes.com/interactive/2020/08/12/us/covid-deaths-us.html", "via": "", "real_tags": ["冠状病毒", "美国", "病毒", "死亡"]}, {"category": "", "categoryclass": "", "imagename": "3bf905c61b3ee6af4cdc722c0a9675e0.jpg", "infoid": 1017926, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "基于长期演进标准的移动语音呼叫的出现对世界各地数百万手机用户来说是一个福音。Volte是Voice over LTE的缩写，提供的容量是早期3G标准的三倍，因此产生的高清晰度音质比前几代有了巨大的改善。Volte还使用用于在互联网上发送数据的相同IP标准，因此它有能力与更广泛的设备一起工作。Volte做到了所有这些，同时还提供了前身蜂窝技术所没有的安全层。\n现在，研究人员展示了一个弱点，允许资源有限的攻击者窃听电话。他们的技术名为Reverte，使用软件定义的无线电将运营商的基站传输到攻击者选择的手机上的信号拉取出来，只要攻击者连接到同一个手机发射塔(通常在几百米到几公里内)，并知道电话号码。由于许多运营商实现VoLTE的方式存在错误，该攻击会将加密的加扰数据转换为未加密的声音。其结果是对越来越多的手机用户的隐私构成了威胁。费用：大约7000美元。\n周三，来自鲁尔大学波鸿大学和纽约大学的研究人员在第29届USENIX安全研讨会上发表的一篇论文中写道：“数据机密性是LTE安全的核心目标之一，也是对我们通信基础设施信任的基本要求。”“我们引入了反叛攻击，使对手能够基于LTE协议的实现缺陷窃听和恢复加密的VoLTE通话。”\nVolte在电话和基站之间传递呼叫数据时对其进行加密。然后，基站对业务进行解密，以便将其传递到蜂窝网络的任何电路交换部分。然后，另一端的基站将在呼叫传输到另一方时对其进行加密。\n实现错误反抗利用是基站在连续呼叫时使用一些相同的密码材料来加密两个或更多呼叫的趋势。该攻击通过捕获目标呼叫的加密无线通信(研究人员将其称为目标或第一个呼叫)来抓住这一错误。当第一次呼叫结束时，攻击者迅速发起研究人员所称的密钥流呼叫，同时嗅探加密的流量，并记录未加密的声音，通常称为明文。\n攻击包括两个主要阶段：记录阶段，其中对手记录受害者的目标呼叫，以及呼叫阶段，随后与受害者通话。对于第一阶段，对手必须能够嗅探下行方向的无线电层传输，这可以用价格低于1400美元的实惠硬件来实现[1]。此外，当对手了解到目标eNodeB的无线电配置时，她可以对记录的业务进行解码，直到加密数据(PDCP)。但是，我们的攻击者模型不需要拥有受害者的任何有效密钥材料。第二阶段需要一部商用现成(COTS)电话，并知道受害者的电话号码和他/她的当前位置(即无线蜂窝)。\n然后，攻击者将第二次调用的加密流量和明文流量进行比较，以推断出用于加密该调用的加密位。一旦拥有了这个所谓的“密钥流”，攻击者就使用它来恢复目标呼叫的明文。\n研究人员在一篇解释攻击的帖子中写道：“叛乱攻击利用了同一密钥流在一个无线电连接内的两个后续呼叫中的重用。”“这个弱点是由基站(ENodeB)的实现缺陷造成的。”\n下图描述了涉及的步骤，下图视频显示了Reverte的实际行动：\n起义有其局限性。专门研究密码学的约翰·霍普金斯大学(Johns Hopkins University)教授马特·格林(Matt Green)解释说，现实世界的限制-包括使用的特定编解码器、编码音频转码方式的反复无常，以及分组报头的压缩-可能会使获得呼叫的完整数字明文变得困难。没有明文，解密攻击就不会奏效。他还表示，密钥流呼叫必须在目标呼叫结束后约10秒内进行。\n此外，可以解密的目标调用的数量取决于密钥流调用持续的时间。仅持续30秒的密钥流调用将仅提供足够的密钥流材料来恢复30秒的目标调用。当基站遵循LTE标准时，Reverte也不起作用，因为LTE标准规定不能重用密钥流。正如已经提到的，袭击者必须在与目标相同的手机发射塔的无线电范围内。\n尽管存在这些限制，研究人员还是能够恢复他们窃听的89%的对话，这一成就表明，只要基站错误地实施LTE，Reverte在现实世界的设置中就是有效的。所需设备包括(1)连接到蜂窝网络并记录流量的商用现成电话，以及(2)商用的AirScope软件无线电，用于对LTE下行链路流量进行实时解码。\n研究人员写道：“对手只需投资不到7000美元，就能创建一个具有相同功能的设置，并最终具有解密下行链路流量的能力。”“虽然我们的下行反抗已经可行，但更老练的对手可以通过扩展上行链路嗅探器来提高攻击效率，例如SanJole的WaveJudge5000，在那里我们可以利用相同的攻击载体，并同时访问两个方向。”\n在初步测试中，研究人员发现，在德国随机选择的15个基站中，有12个重复使用了密钥流，使得所有通过它们传输的VoLTE呼叫都容易受到攻击。在向行业组织全球移动应用系统(Global System For Mobile Applications)报告了他们的发现后，重新测试发现，受影响的德国运营商已经修复了他们的基站。由于全球有120多家提供商和1200多种不同的设备类型支持VoLTE，要完全根除窃听弱点可能需要更多时间。\n“然而，我们需要考虑全球范围内的大量供应商及其大规模部署，”研究人员写道。“因此，提高人们对这种脆弱性的认识至关重要。”\n研究人员发布了一款Android应用程序，该应用程序将测试网络连接是否易受攻击。这款应用程序需要一个支持VoLTE并运行高通芯片组的根基设备。不幸的是，这些要求会让大多数人很难使用这款应用。", "note_en": "The emergence of mobile voice calls over the standard known as Long Term Evolution has been a boon for millions of cell phone users around the world. VoLTE, short for Voice over LTE, provides up to three times the capacity of the earlier 3G standard, resulting in high-definition sound quality that’s a huge improvement over earlier generations. VoLTE also uses the same IP standard used to send data over the Internet, so it has the ability to work with a wider range of devices. VoLTE does all of this while also providing a layer of security not available in predecessor cellular technologies.\n Now, researchers have demonstrated a weakness that allows attackers with modest resources to eavesdrop on calls. Their technique, dubbed ReVoLTE, uses a software-defined radio to pull the signal a carrier’s base station transmits to a phone of an attacker’s choosing, as long as the attacker is connected to the same cell tower (typically, within a few hundred meters to few kilometers) and knows the phone number. Because of an error in the way many carriers implement VoLTE, the attack converts cryptographically scrambled data into unencrypted sound. The result is a threat to the privacy of a growing segment of cell phone users. The cost: about $7,000.\n  “Data confidentiality is one of the central LTE security aims and a fundamental requirement for trust in our communication infrastructure,” the researchers, from Ruhr University Bochum and New York University, wrote in a  paper presented Wednesday at the  29th USENIX Security Symposium. “We introduced the ReVoLTE attack, which enables an adversary to eavesdrop and recover encrypted VoLTE calls based on an implementation flaw of the LTE protocol.”\n VoLTE encrypts call data as it passes between a phone and a base station. The base station then decrypts the traffic to allow it to be passed to any circuit-switched portion of a cellular network. The base station on the other end will then encrypt the call as it’s transmitted to the other party.\n The implementation error ReVoLTE exploits is the tendency for base stations to use some of the same cryptographic material to encrypt two or more calls when they’re made in close succession. The attack seizes on this error by capturing the encrypted radio traffic of a target’s call, which the researchers call the target or first call. When the first call ends, the attacker quickly initiates what the researchers call a keystream call and simultaneously sniffs the encrypted traffic and records the unencrypted sound, commonly known as plaintext.\n  The attack consists of two main phases: the recording phase in which the adversary records the target call of the victim, and the call phase with a subsequent call with the victim. For the first phase, the adversary must be capable of sniffing radiolayer transmissions in downlink direction, which is possible with affordable hardware for less than $1,400 [1]. Furthermore, the adversary can decode recorded traffic up to the encryption data (PDCP) when she has learned the radio configuration of the targeted eNodeB. However, our attacker model does not require the possession of any valid key material of the victim. The second phase requires a Commercial Off-TheShelf (COTS) phone and knowledge of the victim’s phone number along with his/her current position (i.e., radio cell).\n The attacker then compares the encrypted and plaintext traffic from the second call to deduce the cryptographic bits used to encrypt the call. Once in possession of this so-called “ keystream, the attacker uses it to recover the plaintext of the target call.\n “The ReVoLTE attacks exploit the reuse of the same keystream for two subsequent calls within one radio connection,” the researchers wrote in a  post explaining the attack. “This weakness is caused by an implementation flaw of the base station (eNodeB).”\n The figure below depicts the steps involved, and the video below the figure shows ReVoLTE in action:\n    ReVoLTE has its limitations. Matt Green, a Johns Hopkins University professor who specializes in cryptography,  explained that real-world constraints—including the specific codecs in use, vagaries in the way encoded audio is transcoded, and compression of packet headers—can make it difficult to obtain the full digital plaintext of a call. Without the plaintext, the decryption attack won&#39;t work. He also said that keystream calls must be made within about 10 seconds of the target call ending.\n Additionally, the amount of the target call that can be decrypted depends on how long the keystream call lasts. A keystream call that lasts only 30 seconds will provide only enough keystream material to recover 30 seconds of the target call. ReVoLTE also won’t work when base stations follow the LTE standard that dictates against the reuse of keystreams. And as already mentioned, the attacker has to be in radio range of the same cell tower as the target.\n Despite the limitations, the researchers were able to recover 89 percent of the conversations they eavesdropped on, an accomplishment that demonstrates that ReVoLTE is effective in real-world settings, as long as base stations incorrectly implement LTE. The equipment required includes (1) commercial off-the-shelf phones that connect to cellular networks and record traffic and (2) commercially available  Airscope software radio to perform real-time decoding of LTE downlink traffic.\n “An adversary needs to invest less than $7,000 to create a setup with the same functionality and, eventually, the ability to decrypt downlink traffic,” the researchers wrote. “While our downlink ReVoLTE is already feasible, a more sophisticated adversary can improve the attack’s efficiency by extending the setup with an uplink sniffer, e. g., the  WaveJudge5000 by SanJole where we can exploit the same attack vector, and access both directions simultaneously.”\n  In initial tests, the researchers found that 12 of 15 randomly selected base stations in Germany reused keystreams, making all VoLTE calls transmitted through them vulnerable. After reporting their findings to the industry group  Global System for Mobile Applications, a retest found that the affected German carriers had fixed their base stations. With more than 120 providers around the world and over 1,200 different device types supporting VoLTE, it will likely take more time for the eavesdropping weakness to be fully eradicated.\n “However, we need to consider a large number of providers worldwide and their large deployments,” the researchers wrote. “It is thus crucial to raise awareness about the vulnerability.”\n The researchers have released an  Android app that will test if a network connection is vulnerable. The app requires a rooted device that supports VoLTE and runs a Qualcomm chipset. Unfortunately, those requirements will make it hard for most people to use the app.\n I emailed AT&amp;T, Verizon and Sprint/T-Mobile to ask if any of their base stations are vulnerable to ReVoLTE. So far none of them has responded. This post will be updated if replies come later.\n  ReVoLTE builds off of a  seminal research paper published in 2018 by computer scientists at the University of California at Los Angeles. They found that LTE data was often encrypted in a way that used the same keystream more than once. By using what&#39;s known as an  XOR operation on the encrypted data and the corresponding plaintext traffic, the researchers could generate keystream. With that in hand, it was trivial to decrypt the data from the first call.\n   “The keystream call allows the attacker to extract the keystream by XOR-ing the sniffed traffic with the keystream call plaintext,” ReVoLTE researchers explained. “The keystream block is then used to decrypt the corresponding captured target ciphertext. The attacker thus computes the target call plaintext.”\n While ReVoLTE exploits the incorrect implementation of LTE, Johns Hopkins’ Green said some of the fault lies in the opaqueness of the standard itself, a shortcoming that he likens to “begging toddlers not to play with a gun.”\n “Inevitably, they’re going to do that and terrible things will happen,” he wrote. “In this case, the discharging gun is a keystream re-use attack in which two different messages get XORed with the same keystream bytes. This is known to be utterly devastating for message confidentiality.”\n The researchers provide several suggestions that cellular providers can follow to fix the problem. Obviously, that means not reusing the same keystream, but it turns out that&#39;s not as straightforward as it might seem. A short-term countermeasure is to increase the number of what are known as radio bearer identities, but because there&#39;s a finite number of these, carriers should also use inter-cell handovers. Normally, these handovers allow a phone to remain connected as it transfers from one cell to another. A built-in key reuse avoidance makes the procedure useful for security as well.\n “[As] a long-term solution, we recommend specifying mandatory media encryption and integrity protection for VoLTE,” the researchers wrote. “This provides long-term mitigation for known issues, e. g., key reuse, and missing integrity protection on the radio layer, and introduces an additional layer of security.”", "posttime": "2020-08-13 20:23:16", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "黑客,窃听,eavesdrop,呼叫", "title": "黑客可以用价值7000美元的设备窃听移动电话", "title_en": "Hackers can eavesdrop on mobile calls with $7,000 worth of equipment", "transed": 1, "url": "https://arstechnica.com/information-technology/2020/08/your-mobile-calls-may-be-vulnerable-to-a-new-revolting-eavesdrop-attack/", "via": "", "real_tags": ["黑客", "窃听", "eavesdrop", "呼叫"]}, {"category": "", "categoryclass": "", "imagename": "ffb4b885ecf103ab82e4b88c538d8624.jpeg", "infoid": 1017925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在去市场上买一台新的Mac电脑真是个奇怪的时机。今年夏天早些时候，苹果宣布将开始在Mac产品线上推出Apple Silicon-其内部设计的ARM处理器即兴表演，就像以前在iPhone和iPad中看到的那样。这标志着Mac的方向发生了翻天覆地的变化。\n但该公司也表示，未来将发布使用英特尔CPU的新Mac电脑，这是台式机和笔记本电脑更传统的选择，并在未来几年支持基于英特尔的Mac电脑。\n进入几周前刚刚发布的新款27英寸iMac吧。这是自Apple Silicon发布以来的第一款新Mac产品，也是该公司最具标志性和最受欢迎的产品之一的更新-这款产品已经落后于Mac阵容中的其他产品一段时间了。\n随着Mac表面上的巨大飞跃迫在眉睫，这一新版本对iMac来说只是一个渐进的步骤。它拥有通常的更新：更快的处理器，更好的RAM和存储选项，以及更好的图形处理。它还有一个新的网络摄像头和更好的麦克风。\n但总体来说，这并不是一个根本性的变化。相反，新的iMac代表着对世界上最好的(尽管是最贵的)电脑之一的微妙改进。这是暴风雨来临前的平静。\n然而，有时你会想要你已经熟悉的东西，特别是当它花费几千美元的时候。因此，如果你在市场上寻找一款新的Mac，但你还没有准备好把赌注押在全新架构的第一代上，那么2020年的27英寸iMac更新版值得买吗？\n所有27英寸的iMac都有5120x2880的显示屏，最大亮度为500尼特，刷新率为60赫兹。这是一个出色的屏幕，调整到近乎完美-如此之好，以至于很难找到与之配对的辅助显示器，在它旁边看起来同样平衡。\n最重要的是，当你购买新的iMac时，你要支付的是这个屏幕。如果你想在一个大的、高分辨率的屏幕上工作，这可能是值得的。当然，并不是每个人都这样做，对于那些不这样做的人来说，还有更便宜的选择。而且，这里没有什么新鲜事。据我所知，它的屏幕和以前的型号是一样的。\n每台27英寸的iMac还配有立体声扬声器、三麦克风阵列(比上一款更好)和以下端口：\n这里最大的升级可以说是网络摄像头，它已经从720p升级到1080p。每个计算机制造商的公关团队都在无穷无尽的Zoom通话的大流行环境中推销更好的网络摄像头，所以这是目前理所当然的。\n不过，这是一台不错的相机。实际上，我自己一周打的Zoom电话不会超过三到四次，但我可以欣赏其中的不同之处。我很想在某个时候看到MacBook Pro的升级。\n苹果还将T2芯片(最初是在iMac Pro中推出，但现在在整个Mac系列中都可以看到)带到了iMac上。它提供了许多我们在之前的Mac评论中讨论过的安全功能。在这种情况下，T2芯片管理音频的EQ、摄像头上的人脸检测和嘿Siri等。它还用于加快视频转码速度。\n有三种默认配置，分别为1,799美元、1,999美元和2,299美元。最低端(1,799美元)配备3.1 GHz 6核第10代英特尔酷睿i5 CPU，8 GB 2666 MHz DDR4，4 GB GDDR6显存的Radeon Pro 5300，以及256 GB固态硬盘存储。\n升级到1,999美元，你把6核的i5提升到3.3 GHz的时钟速度，你的固态硬盘存储空间翻了一番，达到几乎足够的512 GB。最后，2299美元的规格将转移到3.8 GHz的8核英特尔酷睿i7 CPU和8 GB GDDR6的Radeon Pro 5500 XT GPU上。\n不幸的是，即使是顶级规格也只提供8 GB的RAM和512 GB的固态存储。对于苹果营销这些设备的一些用例来说，这两个都有点低。这意味着，尽管CPU和GPU速度很快，但基本规格只够在家办公的人做标准的办公事情，但对于那种影响较小的情况来说，这款产品非常昂贵。如上所述，大部分资金都流向了(诚然无可挑剔的)银幕。如果您想使用多个曲目和插件进行视频编辑、游戏开发或音乐制作，那么您至少需要在RAM上多花一点钱。\n提供哪些可选升级？嗯，2299美元的规格可以提升到3.6 GHz的10核英特尔酷睿i9 CPU，再加400美元，以及更快的Radeon Pro 5700 GPU，8 GB的GDDR6(比5500XT高300美元)，或者更快的5700 XT的16 GB(比5500XT高500美元)。\n我们的评测设备配备了5700XT，它确实提供了坚实的性能-实际上，在我的中档台式游戏电脑上，它的性能与我的Nvidia GTX 1070差不多。这对于一体机来说是非常棒的，尽管与Windows塔式电脑相比，这种性能相当昂贵。\n这里悄无声息但却是大新闻的是，苹果已经抛弃了Fusion Drive，这是一种将闪存与传统硬盘相结合的混合解决方案。现在，和Mac产品线的其他产品一样，iMac是彻头彻尾的固态产品。\n您可以将固态硬盘升级到1TB(比512 GB多200美元)、2TB(600美元)、4TB(1200美元)或8TB(2400美元)。对我个人来说，1TB的选择似乎是最好的选择，但你的需求可能会有所不同。有些人需要很少的存储空间，而另一些人则永远不可能有足够的空间。这里有全系列的选择，尽管它们不便宜。\n最后，你可以从8 GB内存增加到16 GB(200多美元)、32 GB(600美元)、64 GB(1000美元)或128 GB(2600美元)。值得注意的是，与许多其他Mac不同的是，你实际上可以自己更换iMac中的RAM，而且还有比从苹果购买便宜得多的选择。\n因此，虽然我通常会建议在购买Mac时将RAM堆叠起来，以避免未来的挫败感，但在这种情况下，我不建议这样做。你现在可以买到你需要的东西，以后再根据需要再加。这是个疯狂的想法！\n你在购买时可以添加的最后一件事(除了10 Gb以太网升级-如果你是需要升级的人，你已经知道了你需要知道的一切)是纳米纹理玻璃选项，它承诺无眩光观看，而不会在外观上做出任何牺牲。这比机器的基本价格高出500美元，我们稍后会更多地了解它是否值这个价。", "note_en": "It’s a weird time to be in the market for a new Mac. Earlier this summer, Apple announced that it will begin rolling out  Apple Silicon—its in-house-designed riff on ARM processors as seen before in the iPhone and iPad—to the Mac product line. That marks a seismic shift in direction for the Mac.\n But the company also said it would be releasing new Macs that use Intel’s CPUs—the more traditional choice for desktop and laptop computers—in the future and supporting Intel-based Macs for years to come.\n Enter the new 27-inch iMac, announced just a couple of weeks ago. It’s the first new Mac product since the Apple Silicon announcement, and it’s a refresh for one of the company’s most iconic and popular products—one that’s been falling behind the rest of the Mac lineup for a while now.\n With an ostensibly giant leap looming for the Mac, this new release is just an incremental step for the iMac. It boasts the usual updates: faster processors, better RAM and storage options, and better graphics processing. It also has a new webcam and better microphones.\n But it’s not a radical change overall. Rather, the new iMac represents a subtle refinement of one of the world’s best (albeit priciest) computers. It&#39;s the calm before a coming storm.\n Sometimes, though, you want the thing you’re already familiar with, especially when it costs several thousand dollars. So if you’re in the market for a new Mac, but you’re not ready to bet the farm on the first generation of a whole new architecture, is 2020’s 27-inch iMac refresh worth buying?\n      All the 27-inch iMacs have a 5,120 x 2,880 display with a maximum brightness of 500 nits and a refresh rate of 60Hz. It’s an outstanding screen that’s tuned to near perfection—so good that it’s hard to find secondary monitors to pair with it that look equally as balanced beside it.\n More than anything else, it’s this screen that you’re paying for when you buy the new iMac. It’s probably worth it if you care about working on a big, high-resolution screen. Of course, not everybody does, and there are  much cheaper options out there for those who don’t. Also, there’s nothing new here. As far as I could tell, it’s the same screen as was included in the previous model.\n Every 27-inch iMac also has stereo speakers, a three-microphone array (which is better than the previous model), and the following ports:\n  The big upgrade here is arguably the webcam, which has gone from 720p to 1080p. Every computer manufacturer’s PR team is pitching nicer webcams in the pandemic environment of endless Zoom calls, so this is par for the course right now.\n Still, it’s a nice camera. I don’t actually do more than three or four Zoom calls a week, myself, but I could appreciate the difference. I’d love to see this upgrade in the MacBook Pro at some point.\n Apple has also brought the T2 chip (first introduced in the iMac Pro, but now seen across the Mac line) to the iMac. It offers a number of security features we’ve discussed in prior Mac reviews. In this case, the T2 chip manages EQ for the audio, face detection on the camera, and Hey Siri, among other things. It’s also used to speed up video transcoding.\n  There are three default configurations at $1,799, $1,999, and $2,299. The lowest-end ($1,799) comes equipped with a 3.1GHz 6-core 10th-generation Intel Core i5 CPU, 8GB of DDR4 at 2666MHz, a Radeon Pro 5300 with 4GB of GDDR6 video memory, and 256GB of SSD storage.\n Stepping up to $1,999, you bump that 6-core i5 up to a 3.3GHz clock speed and you double SSD storage to an almost-adequate 512GB. Finally, the $2,299 spec moves to an 8-core Intel Core i7 CPU at 3.8GHz and a Radeon Pro 5500 XT GPU with 8GB of GDDR6.\n Unfortunately, even the top specification offers just 8GB of RAM and 512GB of solid state storage. Both are a bit low for some of the use cases Apple markets these devices for. That means that despite fast CPUs and GPUs, the base specs are only good enough for at-home office workers doing standard office-y things, but this thing is awfully pricey for that low-impact situation. Most of that money is going to the (admittedly impeccable) screen, as stated above. If you want to do video editing, game development, or music production with more than a few tracks and plugins, you’re going to want to spend a bit more on RAM at least.\n What optional upgrades are available? Well, that $2,299 spec can get a bump to a 3.6GHz 10-core Intel Core i9 CPU for an additional $400, as well as a faster Radeon Pro 5700 GPU with 8GB of GDDR6 ($300 over the 5500 XT) or an even faster 5700 XT with 16GB ($500 over the 5500 XT).\n Our review unit came equipped with the 5700 XT, and it does offer solid performance—about on par with my Nvidia GTX 1070 in my mid-range desktop gaming PC, actually. That’s excellent for an all-in-one, though it is quite pricey for that kind of performance compared to what you could get in a Windows tower.\n The quiet but big news here is that Apple has ditched the Fusion Drive, that hybrid solution that combined flash storage with a traditional hard drive. Now, like the rest of the Mac product line, the iMac is solid state through-and-through.\n You can upgrade the SSD to 1TB ($200 more than 512GB), 2TB ($600), 4TB ($1,200) or 8TB ($2,400). The 1TB option seems like the sweet spot to me personally, but your needs may vary. Some people need very little storage space, while others can never possibly have enough. There are options for the whole range here, even though they aren’t cheap.\n Finally, you can go above that 8GB of RAM to 16GB ($200 more), 32GB ($600), 64GB ($1,000), or a beastly 128GB ($2,600). It’s worth noting that unlike a lot of other Macs, you actually can replace the RAM in the iMac yourself, and there are much cheaper options than buying from Apple.\n So while I’d normally recommend stacking the RAM at purchase when buying a Mac to stave off future frustration, I don’t in this case. You can get as much as you need now and add on later as required. Wild concept, that!\n The last thing you can add at purchase (besides a 10Gb Ethernet upgrade—and if you’re someone who needs that, you already know all you need to know) is the nano-texture glass option That promises glare-free viewing without any sacrifice in appearances. That costs a spit-take-inducing $500 over the base machine price, and we’ll get more into whether that’s worth it a bit later.", "posttime": "2020-08-13 20:22:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "2020,imac", "title": "2020年27英寸iMac评论：一个时代终结的经典Mac", "title_en": "2020 27-inch iMac review: A classic Mac for the end of an era", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/08/2020-27-inch-imac-review-a-classic-mac-for-the-end-of-an-era/", "via": "", "real_tags": ["2020", "imac"]}, {"category": "", "categoryclass": "", "imagename": "e535c6fb99f95e96fce28b930ee1f93b.png", "infoid": 1017923, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "视频通话已成为个人和商业环境中广泛使用的通信方式。特别是在过去的几个月里，人们越来越多地使用视频通话来保持联系。不幸的是，许多人求助于美国的、集中的和封闭源代码的解决方案，这些解决方案伴随着隐私和安全问题。\n我们现在开始在Dino实施分散的电话会议。与UI的其余部分一样，我们的目标是提供良好而简单的用户体验。通话功能计划在未来12个月内逐步实施和发布。对与对话兼容的加密两方通话的支持应该在今年年底或明年初准备就绪。对于电话会议，我们还在研究与流行的视频会议解决方案Jitsi Meet的兼容性，该解决方案也基于XMPP协议。\n这项工作是通过NGI0 PET基金的捐款实现的。该基金由NLnet管理，致力于隐私和信任增强技术。它是在欧盟委员会下一代互联网计划的财政支持下建立的。", "note_en": "Video calls have become a widely used means of communication in personal and in business settings. Especially during the last months, people increasingly used video calls to keep in touch. Unfortunately, many turn to US-based, centralized and closed-source solutions that come with privacy and security issues.\n  We are now starting to implement decentralized calls and conferences in Dino. As with the rest of the UI, we aim for a nice and simple user experience. The call features are planed to be implemented and published step-by-step over the next 12 months. Support for encrypted two-party calls that are compatible with Conversations should be ready by the end of this year or early next year. For conference calls, we are also looking into compatibility with the popular video-conferencing solution Jitsi Meet, that is also based on the XMPP protocol.\n This work is made possible through contributions from the NGI0 PET Fund. The fund is managed by NLnet and dedicated to Privacy and Trust Enhancing technologies. It was established with financial support from the European Commission’s Next Generation Internet programme.", "posttime": "2020-08-13 20:10:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "会议,calls,解决方案", "title": "为呼叫和会议出发", "title_en": "Setting out for calls and conferences", "transed": 1, "url": "https://dino.im/blog/2020/08/setting-out-for-calls-and-conferences/", "via": "", "real_tags": ["会议", "calls", "解决方案"]}, {"category": "", "categoryclass": "", "imagename": "36c76b4a71e6909a23074223844da274.jpg", "infoid": 1017920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "OVHcloud网络有34个POP(入网点)，分布在欧洲、北美和亚太地区。与其他提供商相比，OVHcloud网络的全球容量约为21Tbps，可以处理更多的流量。\n在OVHcloud，网络流量不断增长，以满足数百万互联网用户的需求，这些用户使用我们遍布全球的31个数据中心。\n在过去的几年中，OVHcloud一直致力于改善我们全球主干网络的基础设施。\n经过近两年的研发，OVHcloud网络团队已经拿出了一个全新的基础设施。每个数据中心都连接到多个POP(入网点)。POP与各种其他OVHcloud数据中心共享流量，并与不同的提供商(称为对等点)交换流量。\n当前的体系结构在内部被称为“粘性路由器”，基于用于路由的路由器和充当电源板角色的交换机。几年来，它一直工作得很好(而且成本很低)，但就带宽而言，该方法最终达到了极限。我们需要找到并设计另一个能够处理日益增长的流量的系统。我们的要求很简单；我们需要一个低成本、低功耗、高效且可扩展的基础设施。\n自Octave Klaba创建以来，为我们的全球客户提供尽可能好的连接一直是公司的动力。要做到这一点，我们希望尽可能连接到当地提供商，需要10Gbps或100Gbps的多个端口。\n端口容量：必须基于100Gbps和400Gbps端口，并具有良好的成本效益。这将有助于消除网络中的任何瓶颈。它还需要为那些没有为100Gbps端口做好准备的提供商维护10Gbps链路。\n易于升级：在容量方面，新架构需要易于升级。这在一定程度上是为了公司的发展，但也是为了在POP需要网络维护时保持可用性。\n电力：团队需要找到最好的硬件来最大限度地提高电力消耗效率；特别是在像新加坡这样的国家，那里的电力消耗很贵。\n安全性：一个关键要求是与我们的安全团队合作，找到保护网络免受威胁(大规模DDoS攻击)的最佳解决方案。\n经过近一年的研究和测试，设计团队提出了一个全新的架构，该架构具有可伸缩性、高能效、易于安装和健壮等特点。新建筑被命名为Smaug，以“霍比特人中的龙”命名。\n为了具有适应性，该架构有多个容量选项，具体取决于POP的大小。这是因为在不同的数据中心交换的流量不同。每个容量选项都有自己的特殊性，目标是不会出现瓶颈。\nSmaug是一个“脊梁和树叶”的基础设施。这意味着“脊椎”(称为SuperBackbone的SBB)聚合树叶并连接每个数据中心。“叶”设备(PeeringBox称为PB)用于连接提供商以及xDSL设备或OVHcloud Connect等内部服务。\nSmaug基础设施还提供了另一种连接数据中心的方法，该数据中心至少有两个POP，且都位于不同的位置。例如，在新加坡，我们的数据中心连接到两个POP，两个POP之间的距离超过30公里-这符合两个POP不使用相同电源的规则。\n为了确保冗余，两个POP需要以巨大的容量相互连接-100Gbps或400Gbps，具体取决于POP。传输团队还参与了一种名为“银河”的新基础设施的开发。Galaxy基于不同的构造函数-结合了易于部署、可扩展的运营模型，能耗更低。\n枝叶的作用非常简单，类似于数据中心机架的顶部。它具有通向主干的巨大上行链路容量，并具有连接BGP对等点的配置；例如传输提供商、专用互联(PNI)和互联网交换。\n长途链路：它具有基于100Gbps的链路连接，指向数据中心和POP。\n路由：它拥有完整的路由表，以便选择通往OVHcloud数据中心或外部网络的最佳路径。\n保护：*vac团队通过开发新的保护工具参与其中(更多信息：https://www.ovh.com/blog/using-fpgas-in-an-agile-development-workflow/))，以帮助保护整个OVHcloud网络免受DDoS攻击。\n在设计团队和管理层确定它是OVHcloud网络的最佳架构后，我们开始测试不同的品牌，前提是所有功能都实现正确。在实验室完成所有测试后，我们确信解决方案是可行的，然后开始在新加坡部署基础设施。就交通增长而言，该地区是最重要的地区之一。这也更容易，因为我们已经有了用于数据中心和POP之间链路的暗光纤。\n一月份，我们订购了所有设备和收发器，然后准备了迁移计划，以便将整个部署安排在三月底。2月底，我们准备了配置并测试了全新设备。一切就绪后，我们就把它们都送到新加坡老爷子那里去了。\n一开始我们计划在2020年3月中旬进行这次迁移，我们本来应该把我们的技术人员从法国派到新加坡，但由于新冠肺炎的原因，我们不得不改变了计划。我们不得不找到另一个解决方案，并请我们在新加坡数据中心工作的当地技术人员来做这项工作。由于大流行需要进行新的重组，移民计划变得更加复杂。\n经过管理层、网络团队和新加坡OVHcloud技术人员的长时间讨论，决定在4月初做第一个POP的迁移，在4月底做第二个POP的迁移。迁移开始于将全新设备装入两个新机架，为迁移准备布线，并在热插拔之前进行一些检查。\n成功迁移的压力很大，因为我们不希望它影响我们的客户。在迁移的第一天晚上-一旦我们使第一个POP的流量变干-我们要求技术人员将所有长途链路移至新加坡DC，并将澳大利亚、法国和美国的所有长途链路移至新设备。经过一些测试，我们把新设备投入生产。迁移的第一步进行得很顺利。\n第二天就不那么顺利了，因为这是我们第一次使用基于FPGA服务器的新边境保护系统将我们的新Peering Box投入生产。在我们从对等点删除流量后，流量随后通过第二个POP离开OVHcloud网络。然后，我们通过数据中心供应商的热插拔将光纤移动到新的对等盒。当我们把所有东西都插上新设备后，我们就开始慢慢地恢复生产。我们需要与我们的安全团队一起做这件事，以便检查这个新的边境保护系统是否正常工作，而不是丢弃合法的流量。\n在迁移的最后一天，我们的传输团队已经安装了另一项技术。这里的目标是在新加坡数据中心和我们安装这些新设备的POP之间增加容量。隔离两端之间的流量后，我们将暗光纤迁移到新的DWDM光纤系统(Galaxy)，以便为数据中心增加400Gbps的容量。由于它是新的，我们在解释如何修复系统中的一些布线问题时遇到了一些麻烦。在全部修复和准备就绪后，我们一个接一个地将4x100Gbps链路投入生产。\n在完成了所有这些不同的步骤后，我们分析和解决了一些问题，以便在相同的时间表下使第二次弹出更快。\n一旦两个POP都投入生产，我们就会监控它是如何处理流量和DDoS攻击的。我们还联系了我们的亲密客户，以确保没有问题。\n这一新的基础设施Smaug显著提高了电源和空间效率，并降低了整体网络设计的复杂性。它还将帮助OVHcloud跟上不断增长的应用程序和服务需求。\n展望未来，我们相信Smaug设计的灵活性将帮助OVHcloud利用更快的网络容量，并为未来技术做好准备。\n弗洛里安是OVHcloud澳大利亚墨尔本办事处的一名高级网络工程师。作为核心网络团队的成员，他在为拥有30多万台服务器的网络设计构建、故障排除和网络架构咨询方面积累了专业知识。他还致力于通过增加容量、连接新供应商和在全球网络中安装新设备来改善网络。", "note_en": "The OVHcloud network has 34 PoPs (Points of Presence); located in Europe, North America and Asia-Pacific. With a global capacity of around 21Tbps, the OVHcloud network can handle much more traffic than other providers.\n At OVHcloud, network traffic is constantly growing to meet the needs of millions of internet users, who utilise our 31 data centers across the globe.\n Over the past few years, OVHcloud have been working to improve the infrastructure of our worldwide backbone network.\n   With almost two years of research and development, the OVHcloud network team has come up with a brand new infrastructure. Each datacenter is connected to multiple PoPs (Point of Presence). PoPs share traffic with various other OVHcloud datacenters as well as exchanging traffic with different providers (known as Peers).\n The current architecture, known internally as ‘sticky router’, is based on a router for routing and a switch which plays the role of the power board. For a few years, it had worked quite well (and at a low cost), but the method eventually reached its limit in terms of bandwidth. We needed to find and design another system which could handle the increasing traffic. Our requirements were simple; we needed a low cost, low-power efficient, and scalable infrastructure.\n Providing the best possible connectivity for our worldwide customers has been the company’s driving force since it was created by Octave Klaba. To do this, we wanted to be connected to local providers as far as possible, requiring multiple ports in 10Gbps or 100Gbps.\n  Port capacity: would have to be based on 100Gbps and 400Gbps ports, and have a good cost efficiency. This would help eliminate any bottlenecks in the network. It also needed to maintain 10Gbps links for those providers who were not ready for 100Gbps ports.\n Easy to upgrade: The new architecture needed to be easy to upgrade, in terms of capacity. This is partly for the growth of the company, but also to maintain availability when network maintenance is required on the PoPs.\n Power: The team needed to find the best hardware for maximising power-consumption efficiency; especially in countries like Singapore where it’s expensive.\n Security: A key requirements would be to work with our security teams to find the best solution for protecting the network against threats (massive DDoS attacks).\n After almost 1 year of research and tests, the design team came up with a brand new architecture; which was scalable, power efficient, easy to install and robust. The new architecture was named SMAUG, after the dragon in The Hobbit.\n   To be adaptable, the architecture has multiple capacity options, depending on how big the PoP is. This is because different amounts of traffic are exchanged at different datacenters. Each capacity option has its own specificity, with the objective of no bottlenecks.\n  SMAUG is a ‘Spine and Leaf’ infrastructure. This means the ‘spine’ ( called SBB for SuperBackBone) aggregates the leaves and connects each datacenter. The ‘leaf’ devices ( called PB for PeeringBox) are used for connecting providers and also internal services such as xDSL equipment or OVHcloud Connect.\n SMAUG infrastructure also provides another way to connect a datacenter where there is a minimum of two PoPs, both in a different location. For example, in Singapore, our datacenter is connected to two PoPs, which have more than 30 kms between them – this meets the rule of not using the same power source for two PoPs.\n To ensure redundancy, both the PoPs need to be connected to each other with a huge amount of capacity – in 100Gbps or 400Gbps, depending on the PoPs. The transmission team was also involved in developing a new infrastructure called ‘GALAXY’. GALAXY was based on a different constructor – combined with a simple-to-deploy, scalable, operational model, with less energy consumption.\n The role of the leaf is pretty simple and is similar to the top of the rack in a datacenter. It has a huge amount of uplink capacity towards the spines and has the configuration for connecting BGP peers; such as transit providers, private interconnection (PNI) and Internet eXchange.\n  Long-haul links: It has the connection of the links, based on 100Gbps, towards datacenter(s) and PoP(s).\n Routing: It has the entire routing table in order to take the best path towards the OVHcloud datacenters or towards the external networks.\n Protection: The VAC team has been involved in it by developing a new protecting tool (for more information:  https://www.ovh.com/blog/using-fpgas-in-an-agile-development-workflow/) in order to help to protect the entire OVHcloud network from DDoS attacks.\n  After the design team and management were sure it was the best architecture for the OVHcloud network, we started testing different brands, providing all the functionality was implemented correctly. After all the tests had been completed in the laboratory, and we were confident that the solution was viable, we started the deployment of the infrastructure in Singapore. This region was one of the most important in terms of traffic growth. It was also easier because we already had the dark fibers for the links between the datacenter and the PoPs.\n In January, we ordered all the devices and transceivers, then prepared the migration plan in order to schedule the whole deployment at the end of March. At the end of February, we prepared the configuration and tested the brand new devices. When everything was in order, we sent all of them to Singapore PoPs.\n At the beginning we planned to do this migration mid-march 2020 and we were supposed to send our technicians from France to Singapore, but due to COVID-19 we had to change our plans. We had to find another solution and ask our local technicians working in our Singaporean datacenter to do the job. The migration plan was more complicated due to the new reorganization that needed to be in place for the pandemic.\n After a long discussion between the management, the network team and the Singaporean OVHcloud technicians, it was decided to do the migration of the first PoP at the beginning of April and the second one at the end of April. The migration began by racking the brand new devices in two new racks, preparing the wiring for the migration, and doing some checks before the hotswaps.\n  The pressure for this migration to be successful was high, as we did not want it to impact our customers. On the first night of the migration – once we had dried out the traffic from the first PoP – we asked the technicians to move all the long-haul links to the Singapore DC, and for Australia, France and USA, to new devices. After some tests, we put the new devices in production. The first step of the migration went well.\n The next day wasn’t quite so smooth, as it was the first time we were putting our new Peering Box in production with our new border protection system, based on FPGA servers. After we removed the traffic from our peers, traffic was then leaving the OVHcloud network via the second PoP. Then we moved the fibers to the new Peering Box via a hot swap from our datacenter supplier. After we got everything plugged into the new equipment, we then began putting production back in slowly. We needed to do this in conjunction with our security team, in order to check that this new border protection system was working properly and not dropping legitimate traffic.\n On the last day of migration, another technology had been put in place by our transmission team. The goal here was to add capacity between the Singapore datacenter and the PoP where we installed these new devices. After we isolated the traffic between both ends, we migrated the dark fiber to the new DWDM optical system (Galaxy) in order to add 400Gbps of capacity to the datacenter. As it was new, we had some trouble explaining how to fix some cabling issues in the system. After it was all fixed and ready, one by one, we put 4x100Gbps links in production.\n After completing all these different steps we analysed and fixed some issues in order to make the second PoP faster with the same schedule.\n Once both PoPs were in production we monitored how it was handling the traffic and the DDoS attacks. We also contacted our close customers to ensure that there were no issues.\n   This new infrastructure, SMAUG, brings significant improvements in power and space efficiencies as well as reducing complexity in the overall network design. It will also help OVHcloud to keep up with increasing applications and service demands.\n Looking ahead, we believe the flexibility of SMAUG design will help OVHcloud to leverage faster network capacity and be ready for future technologies.\n   Florian is a senior network engineer based in OVHcloud’s Australian offices, in Melbourne. A member of the core network team, he developed an expertise at building, troubleshooting and consulting on network architectures for network designs with more than three hundred thousand servers. He also works on improving the network by adding capacity, connecting new providers and installing new equipment in the worldwide network.", "posttime": "2020-08-13 19:37:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "骨干,brand,网络", "title": "Smaug，全新的OVHcloud骨干网络基础设施", "title_en": "Smaug, the brand new OVHcloud backbone network infrastructure", "transed": 1, "url": "https://www.ovh.com/blog/smaug-the-brand-new-ovhcloud-backbone-network-infrastructure/", "via": "", "real_tags": ["骨干", "brand", "网络"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1017917, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "昨晚可怕的半个小时里，我以为Firefox作为一个独立的浏览器和渲染引擎正处于消失的边缘。有传言说Mozilla裁减了大量浏览器团队，这让我吓得发傻。官方新闻稿充斥着无用的企业开放网络之类的废话也于事无补--根据我的经验，新闻稿越含糊，情况就越糟糕。\n在我看来，Mozilla的核心问题是对自由的崇拜。在我看来，我们应该根除对免费网络开发的崇拜，Mozilla应该向这个方向迈出一小步，在完全自愿的基础上从Firefox内部请求捐款。\n不过我们先来回顾一下这个消息。根据我从Twitter上拼凑出来的信息，裁员严重影响了DevTools、Servo团队、MDN，可能还有活动/赞助商团队。核心的壁虎团队没有受到影响，这很好。目前，Firefox将继续作为一个独立的浏览器存在。\n从省钱的角度来看，活动团队的内脏是可以理解的。坦率地说，多年来我一直在想，Mozilla从哪里来的钱来举办他们所有的活动和赞助。我想，现在我们知道答案了。作为一个会议组织者，它会对我产生很小的影响，但它可以幸存下来。\n其他三个更严重：虽然核心的壁虎团队幸存下来，但许多支持团队已经被掏空。如果这是最后一轮裁员...。好的，我们能挺过去的。但如果不是的话..。\n对MDN的破坏发生在离家最近的地方。我停止浏览器研究的部分原因是MDN的出现：它非常高效地接管了我记录Web标准(有时还有浏览器差异)的角色，所以这个站点不那么重要。\n然而，我停止研究的更大原因是，我厌倦了免费做所有这些重要的网络支持工作。这也是我从未为MDN做出贡献的主要原因；我不介意这样做，但我非常介意免费这样做。我已经尽了我的职责。\n既然MDN可能会消失，谁来提供网络标准和浏览器兼容性信息呢？有几分钟我想回去做我的老工作，但我拒绝免费做这件事，而且看不到任何财政支持。\n说实话，我的工作赚了一些钱。最后，谷歌、微软和Mozilla为我提供了几年的赞助。不过，这还不够。当然，苹果从来没有付钱，即使从Safari/Mac的发布到iPhone的发布，他们都在我的网站上查询JavaScript兼容性信息。有一段时间，我是Safari文档团队--免费的。\n这就把我们带到了我想提出的核心观点：Web开发中的志愿服务文化，特别是在我们社区的Mozilla部分。在我看来，它不仅过时了，应该更换，而且从一开始就不应该允许它扎根。\n我认为对自由的崇拜是网络的原罪。在我看来，这本质上是一种随机的历史发展，本来可以有很大的不同，但一旦网络上一切都是免费的想法扎根，就成为了一个几乎不可能被赶走的文化接触点。\n诚然，对自由的崇拜也有其积极的一面。但今天我把重点放在消极的方面，在我看来，这些消极的方面比积极的方面要大得多。如果我们继续免费赠送一切，大公司就会赢。一家小公司免费赠送软件。大公司免费赠送相同的软件，对他们来说，费用基本上是微不足道的，而且他们拥有软件运行的平台。因此，小公司将蒙受损失，降低浏览器市场的多样性。就这么简单。\n难道不是时候改变这一切了吗？现在不是时候让Mozilla与自由崇拜划清界限了吗？我知道这在他们的DNA中根深蒂固，但这并没有阻止它触及非常艰难的地方。也许这个模型并不像我们都认为的那样可行。\n因此，请允许我提出一个温和的建议：在Firefox中内置捐赠功能-例如，在每次更新浏览器时都会看到的更新页面中添加一条简单的“请支持我们”消息，以及在主菜单中添加捐赠项目。\n哦，别为付费会员的额外福利操心了。这不是福利的问题，而是支持您正在使用的软件的问题。软件是额外的福利。\n我并不是说Mozilla应该在Firefox周围建立付费墙。这将比它应该解决的问题糟糕得多。(不过，这将是一个非常糟糕的举动是问题的一部分。(如果人们刚学会花钱买好东西…)\n我也不是说这会解决Mozilla的财务问题--事实上，我相当肯定它不会。不过，这将是朝着更好的网络方向迈出的一步，消费者会慢慢习惯于付费的想法。此外，这可能会帮助Mozilla本身摆脱对自由的崇拜，转向一种更可持续的模式，这主要是通过对整个组织施加心理压力来实现的。\n我们需要与过去决裂。像现在这样的艰难时刻可能是实现这一突破的最好机会。\n这是彼得-保罗·科赫(Peter-Paul Koch)的博客，他是一名网络开发人员、顾问和培训师，你也可以在Twitter或Mastodon上关注。原子RSS", "note_en": "For a terrible half an hour last night I though Firefox was on the brink of disappearing as an independent browser and rendering engine. I was frightened silly by the  rumour that Mozilla laid off significant portions of its browser team. The  official press release being full of useless corporate open web blah didn’t help — the vaguer the press release, the worse the situation, in my experience.\n  To my mind, Mozilla’s core problem is the cult of the free. To my mind, we should eradicate the cult of the free from web development, and Mozilla should take a small step in that direction by requesting donations from inside Firefox — on an entirely voluntary basis.\n  First, though, let’s review the news. From what I’ve been able to cobble together from Twitter, the layoffs have severely affected devtools, the  Servo team,  MDN, and likely also the events/sponsorships team.  The core Gecko team is unaffected, and that’s good. Firefox will continue to exist as an independent browser — for now.\n From a money-saving perspective the gutting of the events team is understandable. Frankly, I’ve been wondering for years where Mozilla got the money to run all their events and sponsorships. Now we know the answer, I guess. It will have a minor effect on me as a conference organiser, but it can be survived.\n The other three are more serious: although the core Gecko team survives, many supporting teams have been gutted. If this is the last round of layoffs ... ok, we can survive this. But if it isn’t ...\n  The gutting of MDN strikes closest to home. Part of the reason I stopped doing browser research is the advent of MDN: it took over my role of documenting web standards (and sometimes browser differences) quite efficiently, so this site was less vitally necessary.\n The bigger reason I stopped doing research, however, was that I was tired of doing all of this vital web-supporting work for free. That’s also the main reason I never contributed to MDN; I don’t mind doing it, but I do very much mind doing it for free. I’ve done my duty.\n And who is going to give web standard and browser compatibility information now that MDN might go away? For a few minutes I considered returning to my old job, but I refuse to do it for free, and there is no financial support in sight.\n Truth, I made some money with my work. In the end Google, Microsoft, and Mozilla granted me sponsorships for a few years. It wasn’t enough, though. And of course Apple never paid up, even though from the release of Safari/Mac to the release of the iPhone they referred to my site for JavaScript compatibility information. For a while I  was the Safari documentation team — for free.\n This brings us to the core point I’d like to make: the culture of volunteering in web development, and especially within the Mozilla segments of our community. To my mind it’s not only outdated and should be replaced, it should never have been allowed to take root in the first place.\n I see the cult of the free as  the web’s original sin. To my mind it’s an essentially random historical development that could have gone quite differently, but, once the idea of everything on the web being free took root, became a cultural touch point that is almost impossible to dislodge.\n Granted, the cult of the free also has its positive points. But today I’m focusing on the negative ones that, to my mind, outweigh the positivity by a rather large margin. If we continue to give everything away for free, the big companies will win.  Small company gives away software for free. Large companies give away the same software for free, and to them the cost is essentially peanuts,  and they own the platforms the sofware runs on. Therefore small company will lose, decreasing diversity in the browser market. Simple as that.\n  Isn’t it time to change this? Isn’t it time Mozilla distances itself from the cult of the free? I know it’s deep in their DNA, but that hasn’t prevented it from hitting a very rough spot. Maybe the model is not as viable as we all thought.\n So allow me to make a modest proposal: build in a donations function in Firefox itself — for instance by adding a simple “Please support us” message to the update page you get to see whenever you update the browser, and by adding a Donations item to the main menu.\n Oh, and don’t bother with perks for paying members. It’s not about perks, it’s about supporting the software you’re using. The software  is the perk.\n I’m not saying Mozilla should erect a paywall around Firefox. That would far worse than the problem it’s supposed to solve. (The fact that it would be such a terribly bad move is part of the problem, though. If people had just learned to pay for the good stuff ...)\n I’m also not saying this will solve Mozilla’s financial problems — in fact, I’m quite certain that it won’t. Still, it would be one step in the direction of a better web where consumers slowly get used to the idea of paying. Also, it might help Mozilla itself veer away from the cult of the free towards a more sustainable model, mostly by putting psychological pressure on the organisation as a whole.\n We need a break with the past. Trying times like these might be the best opportunity to make that break.\n  This is the blog of  Peter-Paul Koch, web developer, consultant, and trainer.You can also followhim on  Twitter or  Mastodon.  Atom RSS", "posttime": "2020-08-13 18:22:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "灭亡,free,团队", "title": "对自由的崇拜必须灭亡", "title_en": "The cult of the free must die", "transed": 1, "url": "https://www.quirksmode.org/blog/archives/2020/08/the_cult_of_the.html", "via": "", "real_tags": ["灭亡", "free", "团队"]}]