[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1008792, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项重要的新研究显示，古代农民为改善土壤肥力而进行的创新继续对亚马逊的生物多样性产生影响。\n早期的居民用炉火残余物和食物垃圾中的木炭给土壤施肥。巴西马托格罗索州立大学(State University Of Mato Grosso)和埃克塞特大学(University Of Exeter)的研究人员发现，与周围景观相比，拥有这片“黑暗地球”的地区拥有一套不同的物种，这有助于形成一个更多样化的生态系统，拥有更丰富的植物物种集合。\n几千年前这种土地管理的遗产意味着该地区散布着数千块这样的暗土，大多数大约有一小块田地那么大。这是第一次在跨越一千公里的地区测量成熟森林中黑暗和非黑暗土壤地区植被差异的研究。\n生态学家和考古学家组成的团队研究了塔帕霍斯附近亚马逊河干流沿线和亚马孙南部新谷河流域源头的废弃地区。\n主要作者埃德马尔·阿尔梅达·德·奥利维拉博士(Dr.Edmar Almeida de Oliveira)说：“这是一个黑土茂盛的森林生长的地区，周围森林中生长着不同品种的巨型树木，还有更多可食用的果树，比如塔佩雷巴和贾托巴。”\n在欧洲殖民亚马逊地区后，居住在该地区的土著社区数量锐减，这意味着许多黑暗的地球地区被遗弃了。\n这项发表在全球生态学和生物地理学杂志上的研究首次揭示了哥伦布之前的美洲印第安人对他们曾经耕种的亚马逊森林目前的结构和多样性的影响程度。\n研究人员在亚马逊河流域南部和东部对大约4000棵树进行了采样。暗土地区的pH值明显较高，养分较多，从而提高了土壤肥力。在肥沃的深色土壤中也发现了陶器碎片和其他文物。\n马托格罗索州立大学的小本·胡尔·马里蒙教授说：“前哥伦布原住民给亚马逊贫瘠的土壤施肥了至少5000年，他们留下了令人印象深刻的遗产，创造了黑暗的地球，或称Terras Pretas deíndio。”\n埃克塞特大学的考古学家何塞·艾里亚特教授说：“通过创造黑暗地球，亚马逊早期居民能够在农林复合系统中成功耕种了数千年的土壤。\n“我们认为，古代社区利用暗土地区种植农作物食用，而邻近没有暗土的森林则用于农林间作。”\n埃克塞特大学的泰德·费尔德波什博士和巴西国家空间研究所(INPE)的路易斯·阿拉戈博士共同撰写了这项研究，他说：“在被遗弃了数百年后，我们今天仍然在森林中发现了古代土地用途的指纹，这是前哥伦比亚亚马逊地区人口估计有数百万居民留下的。”\n“根据英国自然环境研究理事会(NERC)资助的一个项目，我们目前正在将这项研究扩展到整个亚马逊盆地，以评估历史火灾是否也影响了远离人为黑暗地球的林区。”\n许多拥有黑暗土地的地区目前是由当地和土著居民耕种的，他们的粮食作物取得了巨大的成功。但大多数仍然隐藏在原生森林中，导致树木尺寸、碳储量和地区生物多样性的增加。研究人员说，出于这个原因，必须将亚马逊地区“Terra Preta deíndio”郁郁葱葱的森林及其生物和文化财富作为遗产保存下来，留给子孙后代。由于非法砍伐森林和火灾，拥有黑暗地球的地区正受到威胁。\n“黑暗的地球增加了物种的丰富性，这是区域生物多样性保护的重要考虑因素。马托格罗索州立大学的合著者Betriz Marimon教授说：“这些发现突出了哥伦布前居民在亚马逊地区土壤和植被上留下的小规模的长期遗产。”这项研究的合著者比阿特丽斯·马里蒙教授来自马托格罗索州立大学(State University Of Mato Grosso)。", "note_en": "Innovation by ancient farmers to improve soil fertility continues to have an impact on the biodiversity of the Amazon,  a major new study shows.\n  Early inhabitants fertilized the soil with charcoal from fire remains and food waste. Areas with this “dark earth” have a different set of species than the surrounding landscape, contributing to a more diverse ecosystem with a richer collection of plant species, researchers from the State University of Mato Grosso in Brazil and the University of Exeter have found.\n The legacy of this land management thousands of years ago means there are thousands of these patches of dark earth dotted around the region, most around the size of a small field. This is the first study to measure the difference in vegetation in dark and non-dark earth areas in mature forests across a region spanning a thousand kilometers.\n The team of ecologists and archaeologists studied abandoned areas along the main stem of the Amazon River near Tapajós and in the headwaters of the Xingu River Basin in southern Amazonia.\n Lead author Dr Edmar Almeida de Oliveira  said: “This is an area where dark earth lush forests grow, with colossal trees of different species from the surrounding forest, with more edible fruit trees, such as  taperebá and  jatobá.”\n The number of indigenous communities living in the Amazon collapsed following European colonization of the region, meaning many dark earth areas were abandoned.\n The study, published in the journal  Global Ecology and Biogeography, reveals for the first time the extent to which pre-Columbian Amerindians influenced the current structure and diversity of the Amazon forest of the areas they once farmed.\n Researchers sampled around 4,000 trees in southern and eastern Amazonia. Areas with dark earth had a significantly higher pH and more nutrients that improved soil fertility. Pottery shards and other artefacts were also found in the rich dark soils.\n Professor Ben Hur Marimon Junior, from the State University of Mato Grosso, said: “Pre-Columbian indigenous people, who fertilized the poor soils of the Amazon for at least 5,000 years, have left an impressive legacy, creating the dark earth, or  Terras Pretas de Índio”\n Professor José Iriarte, an archaeologist from the University of Exeter, said: “By creating dark earth early inhabitants of the Amazon were able to successfully cultivate the soil for thousands of years in an agroforestry system\n “We think ancient communities used dark earth areas to grow crops to eat, and adjacent forests without dark earth for agroforestry.”\n Dr Ted Feldpausch, from the University of Exeter, who co-authored the study with Dr Luiz Aragão from the National Institute for Space Research (INPE) in Brazil, said: “After being abandoned for hundreds of years, we still find a fingerprint of the ancient land-use in the forests today as a legacy of the pre-Colombian Amazonian population estimated in millions of inhabitants.\n “We are currently expanding this research across the whole Amazon Basin under a project funded by the UK   Natural Environment Research Council (NERC) to evaluate whether historical fire also affected the forest areas distant from the anthropogenic dark earths”.\n Many areas with dark earth are currently cultivated by local and indigenous populations, who have had great success with their food crops. But most are still hidden in the native forest, contributing to increased tree size, carbon stock and regional biodiversity. For this reason, the lush forests of the “ Terra Preta de Índio” and their biological and cultural wealth in the Amazon must be preserved as a legacy for future generations, the researchers have said. Areas with dark earth are under threat due to illegal deforestation and fire.\n “Dark earth increases the richness of species, an important consideration for regional biodiversity conservation. These findings highlight the small ‐scale long ‐term legacy of pre ‐Columbian inhabitants on the soils and vegetation of Amazonia,” said co-author Prof Beatriz Marimon, from the State University of Mato Grosso.", "posttime": "2020-06-29 06:53:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "亚马逊,amazon,显示,ancient,地区", "title": "研究显示，古代农民的创新增加了亚马逊的生物多样性", "title_en": "Innovation by ancient farmers adds to biodiversity of the Amazon, study shows", "transed": 1, "url": "https://www.exeter.ac.uk/news/research/title_801967_en.html", "via": "", "real_tags": ["亚马逊", "amazon", "显示", "ancient", "地区"]}, {"category": "", "categoryclass": "", "imagename": "c9711225bdfec13aaed1baa4959635be.jpg", "infoid": 1008791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "监视，鱼叉式钓鱼和失踪的数十亿美元。“有时候我觉得我要疯了。”丹·麦克勒姆解释了这起大规模欺诈案背后的曲折……", "note_en": "Surveillance, spear phishing and missing billions. 'At times I thought I was going crazy.' Dan McCrum explains the twists and turns behind the massive fraud....", "posttime": "2020-06-29 06:53:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "wirecard,story,觉得", "title": "金融时报：Wirecard和失踪的19亿欧元--我的故事[视频]", "title_en": "Financial Times: Wirecard and the missing €1.9bn – my story [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=u-8-QbDpqqw", "via": "", "real_tags": ["wirecard", "story", "觉得"]}, {"category": "", "categoryclass": "", "imagename": "0f9955ac8d82e6ab88b74ae4e148a09d.png", "infoid": 1008790, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "苹果宣布“Apple Silicon”之所以重要，原因有很多。实现这样的承诺是卓越的产品工程的结果。带注释的线程…。\n在所有的细节、安装预发行版和评论(包括我自己的)中，我想花一点时间来反思#WWDC将其放在过去二十年的背景下。很简单，我们现在看到的是历史上一些最了不起的产品工程。1/。\n2/人们很容易陷入关于细节的争论中，为微调或惊喜而兴奋，即使是偶尔的丑闻，也很容易怀疑质量(这是一个好的测试版吗？)。在引擎盖下，是一个团队，随着时间的推移，他们做的事情比我能命名的任何球队都要多，执行得也更好。\n3/穿着类似的鞋子走了很多年，重要的是从Mac还是一把锤子砸过屏幕开始，穿过最低的低谷(好吧，我们会继续做Office)，复活和再创造，我很狂野地思考是什么让它对我如此令人惊叹。\n我的第一个Mac软件是一款名为“Mac Mendeleev”的应用程序，它是一个可视化工具，可以显示50多种元素的周期性属性。它是在MacApp的Mac程序员工作台出现之前用Pascal编写的。就像微软雇佣的许多“应用”人员一样，我从大学时就被录用，成为一名Mac程序员。当时，Apps中的大多数人似乎都是Mac用户。微软一半的业务是销售Mac Word和Mac Excel。\n很多人都有自己的想法，为什么苹果做得这么好，但我想分享一下我认为是什么让他们从一种独特的角度走到了今天。我将专注于制造产品，而不是从营销、制造和销售中剥离，这些都是平等的角色。\n5/3的因素继续让我大吃一惊(因为没有更好的表达方式)，特别是在今天之后。·无畏的多年战略·清晰的统一规划/优先顺序·前所未有的广泛执行。\n许多公司倾向于只关注“战略”(如垂直整合)，或“制造执行”(如蒂姆·库克加入公司时的传奇供应链工作)，或“营销”(“买一台Mac”)。所有这些单打独斗都是令人惊叹的，也是批判性的。我选择看产品开发的整体弧线，因为它支撑着我认为非常独特的一切。\n6/当蒂姆·库克(Tim Cook)谈到用两年的时间过渡到苹果硅片(ASI)时，我大吃一惊。首先，那就好像根本没有时间。其次，要告诉每个人需要多长时间，他们应该有耐心，这是一个令人难以置信的长时间。我是认真的。\n把这件事放在上下文中。从PowerPC到Intel的过渡是在2005年春天宣布的。第一批PC于2006年1月发货，到8月份，整个生产线都换成了英特尔(Intel)(大约一年)。到2009年夏天，OSX不再支持PPC，到2011年Rosetta仿真完全消失了。整个过渡在纸面上看起来花了5年时间，但实际上最大的阻碍是Adobe。我相信，如果Adobe更早加入，过渡就会加快(而不是像现在这样推迟)。我们在本周讨论的时间线中有很大一部分是这样的，包括蒂姆的“两年”时间表。\n但当这么多事情可能会发生变化，更重要的是可能会出错时，这真的是令人难以置信的勇敢。每家大公司都会制定多年计划(我确实做了)，但每个人都知道，这些计划在一个财年之后意义不大。在这方面，苹果完全不同。\n8/这件事最重要的是苹果的整体模式是如何实现这一点的。系统的每一个方面都必须结合在一起，以创造一个环境，在这个环境中，可以做出选择，并提供支持，使这些计划具有完整性。\n我所说的苹果模式不是指其直接面向消费者的业务或垂直整合，而是拥有“观点”的文化。苹果生产的产品深受消费者喜爱和喜爱，但它是通过研究技术、市场和使用情况来制定计划和战略的。与你在教科书上读到的不同，苹果对微小的变化、炒作周期甚至“反馈”的反应要少得多。事实上，你经常可以看到，当苹果匆忙将产品推向市场，或者听得太紧而不敢大肆宣传时，它的模式是如何运行得不太好的(例如Home Pod)。苹果是一家有观点的公司-当观点与人们喜爱的伟大产品相一致时，它可以成为一股不可阻挡的力量。\n9/例如，虽然Office可靠地发布了几十年，但使用Windows进行计划是非常困难的，因为Windows对计划和发布有不同的看法。再加上企业客户与OEM客户。当我们完成95年夏天的工作时，这是一个奇迹。\n在这里，分销渠道的差异完全改变了产品的制造方式。首先，在90年代，Office针对向零售渠道发布产品进行了优化，这意味着需要大量特定国家的“客户”，每个客户都需要交付时间，包括开发平面广告的时间等等。Windows专注于OEM，这些OEM的交货期更长，而且具有季节性(返校、度假、春季更新)，需要回溯工作长达3或4个月。所有这一切都是徒劳的，而实际上Windows项目的完成日期是一个不断变化的目标。这是有业务目标的团队的不利之处，他们将不同的方向拉到一起，并与大型独立公司组成的生态系统作为合作伙伴进行合作。然而，好处应该是显而易见的。\n10/向NT的过渡始于95年，应该需要一年的时间。Windows XP是2001(！)。因此，我们最终发运了我们(如Office)当时必须支持的质量不断下降的产品(9倍)。尽管如此，Win2000仍然应该是“it”，然后是XP，然后是XP SP2，所有其他的都被推迟了。\n注意：Windows NT和95之间的组织结构图分歧需要解决，因为NT被开发为服务器策略，并且是在一个孤立的组织中(基于事后明智的选择，但这只是推迟了策略的协调)。我们的想法是将NT内核放在Windows9x内核下，但事实证明，这并不是那么简单。因此，9x团队推出了98、98SE和Me，以继续发展硬件生态系统，并努力保持势头。Windows2000是第一个调和的内核+GUI，只是它在兼容性方面有所欠缺。终于在2001年推出了Windows XP，但在发布时存在严重的安全问题。在发布的临时Office中，Office97、Office2000、OfficeXP和Office2003都是32位应用程序，但直到Office2003才发布(2003年8月发布，比XP SP2早一年！)。我们最终停止了对9x平台的支持(在它发布8年后)。\n11/示例：64位转换。它花了20[版.，25年]年才发生。20[版.，25年]年。还没做完呢。OTOH Excel2.2仍然运行在32位Windows上，WordPerfect MS-DOS也是如此，这是一个奇迹般的成就，诚实地说，受到了巨大客户的高度重视。不同的世界。\n令人难以置信的是，每家公司的64位转换是如此不同。微软开创了64位计算的先河-通过与AMD合作，它推动了兼容的行业标准，在某种意义上，英特尔正在与之抗争(以避免IA64的商品化)。然而，在保持兼容性方面表现出的“耐心”是值得注意的。即使在今天，Office仍默认安装32位产品并推荐使用。我们的团队在2003年做出了这样的选择。情况依然如此。\n苹果从2017年开始要求64位应用程序。两年后，32位应用程序不再受支持。\n苹果模式的一个重要部分是“无所畏惧”，因为苹果愿意将其合作伙伴和生态系统成员交给新的合作伙伴和生态系统成员，以努力保持战略地位。这是让忠诚的消费者成为每个人的客户的一个关键好处-消费者自己更换设备。企业计算模式不能让你交出客户，因为全球只有2000家公司。\n12/我们没有做错任何事。许多人认为，对兼容性和提前客户的承诺让微软变得独一无二。同意并相信这一点。不过，它的作用是让客户与你一起前进变得不那么有趣/重要。不同的世界。\n有一整本书要写的是一家公司如何“交易”成为一家企业公司并承诺兼容。成功的回报非常高，但这几乎是浮士德式的交易，因为你绝对会放弃创新的权利。我谈得很多的一件事是SaaS将如何在企业空间发展。许多人认为SaaS的好处是您可以使产品保持最新并对其进行更改，但很少有达到大规模规模(超出技术精通用户)的企业产品仅通过拨动开关即可进行重大更改的部署。对于许多公司来说，这是一个“待定”的问题。事实证明，将一个主要计划分解为许多非常小的功能并推出通常是非常困难或不可能的-每次推出都有摩擦。\n13/观看今天的WWDC，你可以看到一个庞大的产品开发团队对这一多年战略进行了明确而无情的优先排序。看到这一幕真的很令人惊讶，我真的相信被低估了。我喜欢“不要发送组织结构图”这句话…\n14/发运组织结构图是在任何100人以上的团队中必须面对的最强大的力量之一。我们谈论的是一个(也许？)20000人的产品“团队”。这是我做过的任何事情的两倍大，更像我离开时的多发性硬化症的大小。\n我不知道苹果的研发团队规模有多大，也不知道有多少人在为我们在WWDC上看到的东西工作。多年来，苹果的所有产品都和我所在的Office或Windows团队一样大或更小。作为竞争对手，我密切关注着这件事。现在苹果有这样的广度，跟微软一样，没有内部细节很难比较。\n15/令人难以置信的清楚的是，苹果的每个人都把战略要求凌驾于任何“本地化”之上。当您想知道为什么Notes中没有更多的新内容，或者为什么Mail缺少一些东西时，这是因为支持多年战略胜过单个团队，这是一件好事。\n16/执行要求公司的一切都像战略最重要的那样运作。这意味着交流。绩效考核和奖励。这意味着自上而下的管理加强了它，而不是“随机的”或“不一致的”。这在内部是非常困难的。甚至很痛苦。\n17/我的经历是如此不同。又一次，不是更糟，而是不同。微软更多地在当地运营，因此在许多其他业务中更具弹性，并为许多不同类型的客户提供服务。有些人甚至会说，对客户的反应更快。活动与进步？\n18/在BigCo中，当你被要求做一些似乎与你的成功“无关”的事情时，这是一种负担-当一个群体“要求”另一个群体做一些事情时。大公司(不是苹果)的PPL知道什么是税。苹果的运营就像税收是好的一样。这是独一无二的，值得欣赏。\n我对此的看法是，举个例子，Windows被分成了50个左右的团队。每个团队都拥有产品的一个区域(Office以相同的方式运行约35个团队)。每个团队大约有50名工程师。您可以将团队视为媒体平台或设备支持。在某些情况下，您可以平衡资源分配与个人连续性以及保持专业知识之间的关系。这意味着，在某个时刻，如果您在发布中不需要或不想要某个技术领域的内容(例如，稳定性可能很好)，您将很难弄清楚团队中的每个成员可能会做什么。要做到这一点，一种方法是将团队的工作人员减少到只提供战略层面所需的内容，这是平衡这些相互冲突的目标的一种方式-这就是为什么团队不像“产品团队”那样行事，他们有自己的研究和目标，他们只是在战略目标上工作。在这个WFH和偏远的时代，这个挑战将比我相信人们考虑的更重要。\n19/今天几乎没有“随机”的东西，或者说大部分的发布。这真的很重要-这意味着在5年内没有什么需要清理的，没有什么需要过时的，没有什么会带来毫无价值的痛苦。对我来说最困难的事情是扔掉没人用过的东西(媒体中心！)\n从字面上讲，要结束微软的一些事情是不可能的。我无法告诉你我(或我们)试了多少次。一个广为流传的笑话是，Excel团队为一家欧洲银行在OS/2 Excel上进行错误修复的时间有多长。已经很久没有人使用OS/2了(除了那家银行)。媒体中心就是一个典型的例子，当我在推特上说，我知道我会收到人们说“我用过它”的推文。我们甚至公布了当然没有人相信的使用数据：-)。\n20/最后，(1)中的图像是维基百科自1984年以来苹果发布的路线图。每一个读到这篇文章的人都应该看看它，并惊叹于一件艺术品。没有一家软件公司在这么长的时间里做了这么多、这么定期、这么长时间的事情，当然也没有数十亿家公司做了这么多事情。\n21/这不是Scrum、Agile或…。-大多数人会叫它瀑布，但它不是。它包括计划、迭代、优先排序、丢弃、重新启动等等。在我职业生涯的大部分时间里，我都在争辩说，制定战略并确定优先顺序是执行才能产生这种影响的唯一途径。QED。\n许多人对此进行了反击。很快，每个关于方法的对话都会变成关于定义或“做得不对”的讨论。苹果所做的是独一无二的-这是一个长期目标，分为短期和有用的步骤进入市场，并坚持不懈地专注于不偏离计划。他们之所以能做到这一点，是因为他们对市场的看法与他们的观点是一样的--不怕被炒作周期、竞争对手的动向等所迷惑。\n微软让超过三个版本的产品“最终”工作的历史由来已久。这是完全不同的。在我看来，微软最大的两个战略赌注是在图形界面上下注，这两个赌注大约与苹果成立的时间相同(Multiplan是第一个产品，Excel是第一个主要的新产品)。你知道，如果人们因为不同意而退出，那么打赌是有战略意义的，而这种情况确实发生了！第二个赌注是为未来打造一个全新的操作系统。这个赌注的有趣之处在于，它与客户端GUI赌注(Windows9x)的融合几乎是“晚来的”。这绝对不是苹果那样的产品，更多的是对产品变化的反应。NT是一款和苹果一样坚持不懈地专注于执行的产品。与客户保持一致影响了这种能力。\n22/1看看其他任何一家试图做预先承诺的发布节奏的公司也许一家公司做得很好，但速度慢了。否则范围就会急剧缩小。或者质量下降。苹果经历了起起落落，但看看这个！我知道一些前苹果高管认为这是一件很重要的事情。\n我花了很多时间对苹果的执行感到惊叹，在我离开微软后，我有机会与一些前NeXT和前苹果的人交谈，听到他们为实现这一目标所做的努力真是太棒了。令人惊异。\n一些人问为什么微软不承诺每年发布一次。首先，不幸的是，Windows的历史甚至不能按时完成一个版本(除了Windows XP，它确实发布了2001年8月的版本，但由于需要退回到做一个从3个月的项目到30个月的安全服务包，这一点受到了阻碍。)\n除了我们自己的执行能力之外，一个真正的挑战是生态系统吸收定期释放的能力。这包括一年前购买了个人电脑的终端用户，他们没有“免费升级”的机型(所以这是经济上的)。苹果以免费操作系统而闻名，这在当时对我们来说是一个相当大的难题。\n在Office中，我们按24-36个月的时间表发布，因为企业业务不需要那么多新软件。即使客户使用ARR付款(称为企业协议)，他们也没有带宽来部署和培训员工。\n总而言之，这意味着在任何给定的时间，只有大约三分之一的客户在使用最新的软件。其他2/3的人使用的软件可能已有6-8年的历史。这就是兼容性变得重要的原因。这意味着如果一个团队今天在开发什么东西，它需要在一台8年前的计算机上工作。\n或者是干的。事实证明，我们终于在这方面取得了突破，开始认识到这样一个事实，即一台8年前的计算机也不是一台永远不会有新软件的计算机。那么何必费心呢？嗯，对于企业协议客户，他们所要做的就是询问。事实上，微软受惠于这些客户。\n23/在每个人都崇拜这些概念之前，关于它们的事情是，它们之所以有效和神奇，是因为两件事。首先，苹果的员工令人惊叹。是的，每个人都这么说，也都相信这一点，但伙计们，苹果的每个人都是世界上最擅长自己的事情的。\n每秒24小时，许多人认为垂直集成或专注于设计，或者是某些属性。对于为什么这些还不够，存在着太多的证据。索尼专注于设计。DEC是垂直整合的(他们制作软盘)。即使是IBM。垂直是达到目的的手段，而不是原因。\n只有一个苹果。不要试图抄袭。不过，读这些故事只是为了获得灵感。最近有一本很棒的书是Ken Kocienda著的“创造性选择：史蒂夫·乔布斯黄金时代苹果设计过程内幕”。\n25/不管怎样，我想在今天结束分享为什么苹果的所作所为不仅为10亿人制造了伟大的产品，而且还以一种为“如何制造”东西以及它对我来说是什么样子设定了最高标准。//结束。讨论一下。\n哇，还有很多呢。但是这条带注释的线索太长了。应该有人写本书。\n最后，这篇讨论历史工程过程的帖子与股票市场、投资或任何与此相关的建议都没有关系。", "note_en": "Apple’s announcement of “Apple Silicon” is important for many reasons. Delivering on such an undertaking is the result of remarkable product engineering. An annotated thread…\n  Amidst all the details, installing pre-release, and commentary (including my own) I want to take a moment to reflect on  #WWDC putting it in context of the past two decades. Quite simply, what we’re seeing is some of the most remarkable product engineering over time in history. 1/\n  2/ It is easy to get wrapped up in debates about specifics, excited by tweaks or surprises, even an occasional scandal, or to wonder about the quality (is this is a good beta?). Under the hood, is a team that over time has done more and executed better than any I can name, ever.\n 3/ Having walked in similar shoes for many years, and importantly starting from when Mac was a hammer smashing through a screen, through the lowest lows (fine, we’ll keep doing Office), resurrection, and reinvention, it’s wild for me to consider what makes it so amazing to me.\n My first Mac software was an app called “Mac Mendeleev” which was a visualization tool for over 50 periodic properties of elements. It was written in Pascal before the Mac Programmers Workbench of MacApp existed. Like so many people hired into “Applications” at Microsoft, I was hired from college as and to be a Mac programmer. Most everyone in Apps seemed to be a Mac person back then. Half of Microsoft’s business was selling Mac Word and Mac Excel.\n   4/ Many have their own ideas for why Apple is doing so well, but I want to share what I think of as what got them to today from a kind of unique vantage point. I’ll focus on making the products, not to take away from marketing, manufacturing, selling which all have equal roles.\n 5/ Three factors continue to blow me away (for lack of a better expression), especially after today. • Fearless multi-year strategy • Clear unified planning/prioritization • Wildly unprecedented execution\n Many tend to focus on “strategy” alone (such as vertical integration), or “manufacturing execution” (eg Tim Cook’s legendary supply chain work when he joined the company), or “marketing” (“Get a Mac”). All of those on their own were amazing and critical. I am choosing to look at the overall arc of product development as that underpins everything that I believe is singularly unique.\n 6/ My jaw dropped when Tim Cook discussed the transition to Apple Silicon (ASi) as a two year journey. First, that’s like no time at all. Second, that’s an incredibly long time to tell everyone how long it will take and that they should be patient. Seriously.\n To put this in context. The transition from PowerPC to Intel was announced in Spring 2005. The first PCs shipped in January 2006 and by August the whole line switched to Intel (about one year). By Summer 2009, OS X no longer supported PPC and by 2011 Rosetta emulation was entirely gone. The entire transition looks like it took 5 years on paper, but in reality the biggest thing holding up was Adobe. I believe had Adobe been on board sooner the transition would have been accelerated (rather than delayed as it was). Much of that feeds into the timeline we saw discussed this week, including Tim’s “2 year” time scale.\n 7/ But really that is incredibly brave when so much could potentially change, more importantly could go wrong. Every big company does multi-year planning (I did) but everyone knows those plans mean little after a fiscal year. Apple is entirely different in that regard.\n 8/ The big thing about this is how Apple’s overall model of enables this to work. Every aspect of the system has to come together to create an environment where choices can be made AND supported that allow these plans to have integrity.\n What I mean by Apple’s model is not about its direct to consumer business or vertical integration, but the culture of having a “point of view.” Apple makes products that customers love and are delighted by, but it makes them by studying technology, the market, and usage to arrive at plans and strategies. Unlike what you read in textbooks, Apple is much less about responding to micro changes, hype cycles, or even “feedback.” In fact you can see often how Apple’s model does not work so well when it rushes products to market or listens too closely to hype (eg Home Pod). Apple is a company that has a point of view — when the point of view lines up with a great product people love, it can become an unstoppable force.\n 9/ For example, while Office reliably shipped for decades planning with Windows was super difficult because Windows had a different view of planning and shipping. Plus enterprise versus OEM customers. It was a miracle when we got the summer of ’95 done.\n Here is where the difference in distribution channels totally changes how products are made. First, in the 90’s Office optimized for releasing products to retail channels, which meant a large number of country specific “customers” each requiring lead time, including time to develop print advertising, and more. Windows focused on OEMs which work with even longer lead time and also had seasonality (back to school, holiday, spring refresh) that required working backwards as much as 3 or 4 months. Lining all this up became futile when in fact the Windows project completion date was a moving target. This is the downside of teams with business goals pulling in different directions and working with an ecosystem of large independent companies as partners. The upside, however, should be obvious.\n 10/ The transition to NT started in 95, was supposed to take a year. Windows XP was 2001(!) So we ended up shipping ever decreasing quality products we (eg Office) had to support for that time (9x). Still Win2000 was supposed to be “it”, then XP, then XP SP2, delaying all else.\n Note: There was an org chart divide between Windows NT and 95 that needed to be resolved as NT was developed as the server strategy and in an isolated org (based on a smart choice in hindsight, but one that only postponed the reconciliation of strategy). The idea was to slide the NT kernel under the Windows 9x kernel, but as it would turn out that was not so straight forward. As a result, the 9x team shipped 98, 98 SE, and Me to continue to evolve the hardware ecosystem and try to keep the momentum going. Windows 2000 was the first reconciled kernel+GUI except it fell short in compatibility. Finally Windows XP in 2001, but that had significant security issues at launch. In the interim Office shipped, Office 97, Office 2000, and Office XP, and Office 2003 — all of which were 32 bit apps though it wasn’t until Office 2003 (shipped August 2003, a year before XP SP2!) that we finally stopped supporting the 9x platform (8 years after it released).\n 11/ Example: the 64-bit transition. It took 20  [ed., 25] years for it to happen. 20  [ed., 25] years. It still isn’t done. OTOH Excel 2.2 still runs on 32 bit Windows, so does WordPerfect MS-DOS, which is a miraculous achievement AND honestly highly valued by HUGE customers. Different worlds.\n It is rather incredible how different the 64 bit transitions were for each company. Microsoft pioneered 64-bit computing — by working with AMD it drove the compatible industry standard that in a sense Intel was fighting (to avoid commoditization of their IA64). Yet the “patience” shown in maintaining compatibility has been remarkable. Even today, Office installs the 32 bit product by default and recommends it. Our team made that choice in 2003. It is still the case.\n Apple began requiring 64 bit apps in 2017. Two years later 32 bit apps were no longer supported.\n An important part of the Apple model is “fearless” in that Apple is willing to turn over its partners and ecosystem members to new ones in an effort to stay on strategy. This is a key benefit of having committed consumers as everyone’s customers — consumers replace devices on their own. The enterprise computing model does not let you turn over customers, because there are only 2000 global companies.\n   12/ We didn’t do anything wrong. Many argue a commitment to compatibility and bringing forward customers made Microsoft unique. In agree and believe that. What it does though is make it much less interesting/important for customers to move forward with you. Different worlds.\n There’s a whole book to be written about the “deal” a company makes to become an enterprise company and to promise compatibility. The reward of success is extremely high, but it is almost a Faustian  bargain because you will absolutely cede the right to innovate. One of the things I have talked a great deal about is how SaaS will evolve in the enterprise space. Many believe the benefit of SaaS is that you can keep the product up to date and change it, yet few enterprise products that reached mass scale (beyond technology savvy users) have gone through a deployment of a substantial change by just flipping a switch. This is a “TBD” right now for many companies. It turns out it is often very difficult or impossible to decompose a major initiative into a lot of very small features and roll that out — each roll out has friction.\n 13/ Watching today’s WWDC you can see a clear and relentless prioritization of that multi-year strategy across a MASSIVE product development team. It is really amazing to see and I really believe under appreciated. I am fond of the expression “don’t ship the org chart”…\n 14/ Shipping an org chart is one of the greatest forces one must work against in any team of more than 100. We’re talking a product “team” of (maybe?) 20,000. That’s twice as big as anything I did and more like the size of MS when I left.\n I have no idea how big Apple’s R&amp;D team is or how many work on what we saw at WWDC. For many years all of Apple was the size or smaller than the Office or Windows teams I was part of. I watched this closely as a competitor. Now Apple has such breadth, like Microsoft, it is difficult to compare without inside details.\n 15/ It is incredibly clear that everyone at Apple puts strategy requirements above anything “local”. When you wonder why there isn’t more new in Notes or why Mail is missing stuff it’s because supporting a multi-year strategy trumps individual teams and that’s a good thing.\n 16/ To execute requires everything in the company to operate as though strategy matters most. It means communication. Performance reviews and rewards. It means management top down reinforces it and isn’t “random” or “inconsistent”. That is so difficult internally. Painful even.\n 17/ My experience was so different. Again not worse but different. Microsoft operated much more locally and hence was far more resilient, in many other businesses, and served many different customers types. Some would even say more responsive to customers. Activity v. progress?\n 18/ In BigCo when you’re asked to do things that don’t seem “as” relevant to your success, it is a tax — when one group “requires” another to do something. Ppl at a BigCo (not Apple) know what a tax is. Apple operates like taxes are good. That’s unique and worth appreciating.\n A way I think of this is that, as an example, Windows was broken down into 50 or so teams. Each team owned an area of the product (Office ran the same way about 35 teams). Each team was about 50 engineers. You could think of a team as media platform or device support. At some point you balance resource allocation with continuity for individuals AND also maintaining expertise. This means at some point you will have a tough time figuring out what every member of a team might do if you don’t need or want something from a technology area in a release (eg maybe stability is good). One way to do this is to minimally staff a team to only offer what is required at the strategy level, which is one way to balance those conflicting goals — which is why the team does not act like a “product team” and have their own research and goals, they simply work on the strategic goals. In this era of WFH and remote, this challenge is going to be front and center much more than I believe people are considering.\n 19/ There was so little “random” stuff today or most releases. That really matters — it means in 5 years there’s nothing to clean up, nothing to obsolete causing pain with no value. The hardest thing for me was getting rid of something no one used (MediaCenter!)\n It is literally impossible to end something at Microsoft. I can’t tell you how many times I (or we) tried. A running joke was how long the Excel team kept doing bug fixes on OS/2 Excel for a European bank. It was long after no one used OS/2 (except that bank). Media Center was a classic example and when I tweeted that I knew I would get tweets from people saying “I used it.” We even published the usage data which of course no believed :-)\n 20/ Finally, the image in (1) is the Wikipedia roadmap of Apple releases since 1984. Every single person reading this should look at it and marvel at a work of art. No company in software has done so much, so regularly, for so long, and certainly not at billions.\n 21/ This isn’t scrum or agile or… — most would call it waterfall BUT IT IS NOT. It is planning, iterating, prioritizing, discarding, restarting, and more. I argued most of my career that having a strategy and prioritizing is the only way to execute to have this impact. QED.\n Many pushed back on this. Very quickly every dialog about methods turns into a discussion of definitions or “not doing it right.” What Apple does is unique — it is a long term goal, broken up into short term AND useful steps that go to market, and a relentless focus on not going off plan. They can do this because their view of the market is the same as their point of view — there’s no fear of being confused by hype cycles, movements of competitors, etc.\n Microsoft has a long history of making products over three releases “finally” work. That is quite different. The two biggest strategic bets Microsoft made, in my view, were on the graphical interface which started around the same time Apple began (with Multiplan being the first product, and Excel the first major new product). You know a bet is strategic if people quit over disagreeing and that happened! The second bet was on building an entire new OS for the future. What’s so interesting about the bet was how the convergence of that bet with the client GUI bet (Windows 9x) was that it came almost “later”. This was decidedly not Apple-like and much more about responding to the changes in the product. NT was a product that had the same relentless focus on execution as Apple did. Aligning with the client impacted that ability.\n 22/ One look at any other company that tried to do pre-committed release cadence maybe a company does well, but slows down. Or the scope dramatically shrinks. Or quality declines. Apple had ups and downs but look at that! I know big ex-apple execs that count this as *the* thing.\n I spent a lot of time marveling at the execution of Apple and after I left Microsoft I had a chance to talk to some ex-NeXT and ex-Apple people and it was awesome to hear how much they did to make that happen. Amazing.\n Some ask why Microsoft did not commit to yearly releases. First, the history of Windows was, unfortunately, not even being able to get one release done on time (except Windows XP which did make the August 2001 release, but that was hampered by the need to retreat to doing a security service pack that went from a 3 month project to a 30 month.)\n Beyond our own capability to execute, a real challenge was the ability for the ecosystem to absorb regular releases. This included the end-users who had bought a PC year earlier and not having a “free upgrade” model (so it was economics). Apple famously made the OS free which was quite a conundrum at the time for us.\n In Office we released on sort of 24–36 month schedules because the enterprise business did not want that much new software. Even though customers were on ARR payment (known as enterprise agreements) they did not have the bandwidth to deploy and train their employees.\n Taken together it meant that at any given time only about 1/3rd of customers were on the most current software. The other 2/3rds were on software that might be 6–8 years old. That’s why compatibility becomes important. It means if a team was developing something today it needed to work on an 8 year old computer.\n Or did it. As it would turn out we finally had a breakthrough in this in coming to grips with the fact that an 8 year old computer was also not a computer that would ever get new software. So why bother? Well, with an enterprise agreement customer all they have to do is ask. Microsoft was in fact beholden to these customers.\n 23/ Before everyone cargo cults these concepts the thing about them is that they work and are magical because of two things. First, the people at Apple are amazing. Yes everyone says that and believes that but boy everyone at Apple is the world’s best at their thing.\n  24/ Second, many think vertical integration or design focused or some attribute is it. Too many proof points exist as to why those aren’t enough. Sony focused on design. DEC was vertically integrated (they made floppies). Even IBM. Vertical is a means to an end, not a cause.\n There’s only one Apple. Don’t try to copy. Read the stories just for inspiration though. A great recent book is  Creative Selection: Inside Apple’s Design Process During the Golden Age of Steve Jobs  by Ken Kocienda.\n 25/ Anyway, I wanted to end today sharing why what Apple is doing not only makes great products for a billion people but is doing so in a way that sets the highest bar for *how* things are made and what it looks like for me. // END. Discuss.\n Wow there is so much more. But this is too long an annotated thread. Someone should write a book.\n Finally, this post discussing historical engineering process has nothing to do with the stock market, investing, or anything recommendations along those lines.", "posttime": "2020-06-29 06:32:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,坚持不懈,relentless", "title": "苹果坚持不懈的战略、执行和观点", "title_en": "Apple’s Relentless Strategy, Execution, and Point of View", "transed": 1, "url": "https://medium.learningbyshipping.com/apples-relentless-strategy-and-execution-7544a76aa26", "via": "", "real_tags": ["苹果", "apple", "坚持不懈"]}, {"category": "", "categoryclass": "", "imagename": "1ff6ba3707f164639a82ca49698890d9.png", "infoid": 1008789, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取高质量的Google幻灯片模板，加速您的工作。每周日免费在你的收件箱里放一套新的：", "note_en": "Get high quality google slide templates that will accelerate your work. One new set to your inbox every Sunday, for free:", "posttime": "2020-06-29 06:32:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "免费,free", "title": "SlideGame-免费、可编辑的幻灯片模板", "title_en": "SlideGame – Free, editable slide templates", "transed": 1, "url": "https://slidegame.io/", "via": "", "real_tags": ["免费", "free"]}, {"category": "", "categoryclass": "", "imagename": "d8633daba9ae1c5fd928e21c70d43ec5.png", "infoid": 1008787, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你是否曾经开始写一些东西，读了大约2/3的内容，然后觉得你正在写的东西根本不值得说？\n这就是我一生中大部分时间在互联网上度过的方式，老实说，我已经厌倦了。\n互联网上有很多像我一样的人，经常被称为潜伏者。潜伏的最常见原因很简单，那就是恐惧。害怕进入一场徒劳的网络争论，害怕没有给谈话增加任何有价值的东西，或者害怕说出一些你以后会后悔的话。\n我最害怕的是没有任何有价值的东西。当我开始写一些东西，比如推特、文章、电子邮件，不管是什么，我都担心会打扰到别人。我担心我想说的不是别人想从我这里听到的。所以我什么也没说。\n但在过去的几天里有些事情发生了变化。也许我有过“F”的时刻，老实说我不知道。\n我又不是从来没有和世界分享过东西。在过去的3年里，我发表了大约20篇文章，其中很多我真的很自豪！这真的是我最好的作品之一。不过，这是问题的一部分，我只会出版最好的。任何我认为不够好的东西我都不会发表，或者更糟糕的是，我甚至不会开始写。\n艾拉·格拉斯(Ira Glass)关于这个话题的这句话真的让我印象深刻。套用一下，从事创造性工作的人做这件事是因为他们有很好的品味，他们想做好东西。当你刚开始的时候，你的工作会让你失望，因为你的技能落后于你的品味。你会发现你的工作不如你钦佩的其他人好。在你的技能达到你的品味之前，你必须做大量的练习。\n我想这句话百分之百适用于我。理论上我能做到的最好和尽我最大的努力是有区别的。大多数时候我不会在巅峰状态表演，没人能做到。但是当我注意到我的品味和技能之间的差距时，这不是放弃的理由。我需要提醒自己，缩小差距的唯一方法就是练习。\n我必须出版那些我认为没人会在意的东西，因为我可能是错的。外面有很多人，有人会从我要说的话中获得一些价值。\n好的是我喜欢做东西。我真的这么认为，这就是我做出这些决定的充分理由。我喜欢在网上分享我的作品。所以我要停止阻止自己做我喜欢做的事！\n所以我要告诉我内心的批评者多闭嘴，克制潜伏的冲动。相反，我会从别人那里得到反馈，并从实践中学习。我把我的信任寄托在你身上，互联网。告诉我什么时候我可以做得更好，我们的兴趣在哪里重叠。\n这是一篇与我通常发表的文章截然不同的文章。我通常不做公开承诺，但这一次我觉得除非我公开发布，否则我实际上无法坚持这一点，这就是😂的全部意义所在。\n既然我想以一个问题来结束，我想问这个问题：你是不是某个人，或者你认识的人，正因为这样的感觉而苦苦挣扎？让我知道，我真的很想与更多与此作斗争的人联系起来。", "note_en": "Have you ever started writing something, gotten about 2/3rds of the way through, and decided that the thing that you’re writing isn’t worth saying at all?\n That’s how I’ve spent most of my life on the internet, and to be honest, I’m tired of it.\n There’s a lot of people on the internet like me, often called lurkers. The most common reason for lurking is simple enough, fear. Fear of getting into a futile internet argument, fear of not adding anything of value to the conversation or fear of saying something you’ll later regret.\n The thing I fear the most is not adding anything of value. When I start writing something, a tweet, article, email, whatever, I worry that I’ll bother someone. I worry that what I want to talk about isn’t what someone wants to hear from me. So I say nothing instead.\n But something changed in the last few days. Maybe I had my  “F This” Moment, I honestly don’t know.\n It’s not like I’ve never shared stuff with the world. I’ve published something like 20 articles in the last 3 years, many of them I’m really proud of! It’s really some of my best work. That’s part of the problem though, I would only publish the very best. Anything that I didn’t think was good enough I just wouldn’t publish, or worse, I wouldn’t even start on it.\n This quote from Ira Glass on the topic has really stuck with me. To paraphrase, people who do creative work do it because they have good taste, and they want to make good things. When you’re just starting out, your work will disappoint you, since your skills lag behind your taste. You’ll see that your work isn’t as good as others that you admire. You have to do a bunch of practice before your skills catch up with your taste.\n I think this quote 100% applies to me. There’s a difference between the best I can theoretically do, and trying my best. Most of the time I’m not going to be performing at my peak, nobody can. But when I notice the gap between my taste and my skills, that’s not a reason to give up. I need to remind myself that the only way I’ll close that gap is to practice.\n I have to publish the stuff that I think no one will care about because I’m probably wrong. There’s a whole lot of people out there, someone is going to get some value out of what I have to say.\n The nice thing is that I love making things. I really do, and that’s reason enough to make them. And I love sharing what I make with the internet. So I’m going to stop preventing myself from doing what I love!\n So I’m going to tell my inner critic to shut up more often, to resist the impulse to lurk. Instead, I’ll get feedback from others, and learn by doing. I’m putting my trust in you, internet. To tell me when I can do better, and where our interests overlap.\n This has been a very different article than what I typically post. I don’t usually do public commitments, but this time I felt like I couldn’t actually stick to this unless I posted publicly about it, that’s kinda the whole point 😂.\n Since I like to end on a question, I’d like to ask this: Are you someone, or do you know someone, who is struggling because of feelings like this? Let me know, I’d really love to connect with more people who struggle with this.", "posttime": "2020-06-29 06:11:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,post,东西", "title": "发布或不发布", "title_en": "To Post or Not to Post", "transed": 1, "url": "https://dev.to/samborick/to-post-or-not-to-post-19m5", "via": "", "real_tags": ["发布", "post", "东西"]}, {"category": "", "categoryclass": "", "imagename": "2dd1841e199ccc72c77f078830f9ecfd.png", "infoid": 1008785, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一位举报人向我们提供了一份针对印度发布的4000多个网站的封锁令。我们正在将它们放在网上，因为它们构成了公众和研究人员的重要资源。根据我们的初步分析，大多数网站屏蔽是由于版权主张和法院命令造成的。\n网站屏蔽是一个复杂的问题，似乎只会随着时间的推移而变得越来越严重。访问互联网的普通印度人-这是一种公共资源-仍然不知道特定网站被屏蔽的原因。有时候，即使是经营这些网站的人，也不知道屏蔽网站的原因和法律依据。\n我们早前已解释过有关色情网站的法律地位，以及互联网服务供应商(ISP)的屏蔽有时是如何不一致的，并初步分析了我们通过RTIS收到的几个订单。我们在这个问题上增加透明度的持续努力得到了推动。一名举报人向印度各地的互联网服务提供商提供了法院和政府当局发出的命令。这些文件包含64多份文件，并为约4398个网站的屏蔽提供了解释。今天，我们将把它们出版，以供公众了解和更广泛的研究社区。\n关于这些订单，我们有三个初步推论要分享。在提供这些推论的同时，我们想指出，这是一个有限的数据集，并且可能会显示出偏差，因为所有阻塞订单的总数据字段并不是公开可用的。同时，我们发现提供一个初步分析来确认阻塞原因的几点是有价值的，或者是在没有适当透明度的情况下如何实现WeTransfer阻塞的较新实例。\n法院是主要行为者：产生这些命令的大多数公共当局来自位于德里和金奈的法院。这主要是德里高等法院和马德拉斯高等法院。这些命令的性质是对内容所有者索赔的临时禁令。在这里，文件共享和电影流媒体网站经常被屏蔽。在这里，对URL的特定删除过程不是首选路线，但整个网站都会被屏蔽。随便阅读一下URL列表就可以确认这一点。\n网站屏蔽是不一致的：印度各地使用不同ISP的互联网用户对网站屏蔽的体验非常不同。这可能是由于所使用的技术、受影响的拦截性质以及每个特定地区的ISP合规性不同造成的，在每个特定地区，ISP可能通过不同的技术基础设施提供服务。这具体是通过第59号文件实现的，该文件是一份不遵守规定的报告，其中通信专门指向互联网服务提供商，要求其根据早先的订单屏蔽网站。\n缺乏反对和透明度：尽管人们普遍认为大多数封锁令受到政府的影响，但如上所述，这些封锁令主要是通过私人提出的侵权索赔而发生的。在这些案件中，被告大多是几个网站、互联网服务提供商和政府部门。目前还不清楚是否有任何反对意见，以及在发出阻止指示之前是否进行了高水平的审查。虽然许多这样的主张可能是合法的，但确实存在关于相称性以及过度广泛的知识产权执法如何导致剥夺公众在线获取材料的权利的合法争论。由于没有任何中央或政府储存库用来存放和发布他们屏蔽网站的指示，向人们发出的通知不足进一步加剧了这个问题。\n我们已经确认，印度无论是通过法院还是行政机构的封锁过程中缺乏积极主动的公布和透明度，导致公众对行使这一权力的信任破裂。目前，德里高等法院正在等待一份关于屏蔽讽刺网站“嫁妆计算器”的令状请愿书。\n自2019年5月以来，我们一直在与本网站的请愿人和创建者Tanul Thakur合作起草和提交RTI申请，我们还协助了令状请愿。我们希望通过这种干预，它有助于提高透明度，支持向网站创建者适当通知的规范，即他们可以在听证会上提出辩护，然后公开披露决定。你可以在这里了解到更多关于这起案件的信息，从最初发出通知到政府采取的立场。IFF一如既往地致力于保护您的数字权利。", "note_en": "A whistleblower provided us with a cache of blocking orders for more than 4000 websites issued in India. We are making them available online as they form an essential resource for the public and researchers. As per our initial analysis a majority of website blocking being done due to copyright claims and court orders.\n  Website blocking is a complex issue which seems to be growing in severity only with time. Ordinary Indians who access the internet --- which is a public resource -- still do not know the reason why a specific website is blocked. Sometimes, even the persons who run these websites do not have knowledge as to the reasons and the legal authority which has directed the blocking of websites.\n We have earlier explained the legal position in respect of  porn websites, how sometimes  blocking is inconsistently done at the ISP level, and done a preliminary analysis of the s everal orders we had received through RTIs. Our continuing attempts to increase transparency around this issue received a boost. A whistleblower has  provided orders sent by courts and government authorities to Internet Service Providers across India. These contain more than 64 documents and provide explanations for the blocking of about 4398 websites. Today we are publishing them for public knowledge and the wider research community.\n  We have three preliminary inferences to share on these orders. While offering these inferences we would like to point out that this is a limited data set and is likely to display a bias given the total data field of all blocking orders is not publicly available. At the same time we find value in providing an initial analysis that confirms several points on the reasons for blocking, or the more recent instance of how the  WeTransfer block was effected without proper transparency.\n Courts are primary actors: The public authorities from which most of these orders arise are from courts situated in Delhi and Chennai. This is principally the High Court of Delhi and the High Court of Madras. The nature of the orders are interim injunctions on claims by content owners. Here quite often file sharing and movie streaming websites are being blocked. Here processes for specific takedowns on URLs is not the preferred route but entire websites are blocked. A casual read through the list of URLs confirms this.\n Website blocking is inconsistent: Internet users all across India who use different ISPs have very different experiences on website blocking. This may be due to the technology used, the nature of blocking that is affected and varies from each ISPs compliance in each specific region where they may be offering services through a different technical infrastructure. This is specifically through Document No. 59 which is a non-compliance report in which correspondence was specifically directed to ISPs to block websites in terms of an earlier order.\n Lack of opposition and transparency: Despite the large impression carried that a majority of blocking orders are affected by Government, as stated these primarily occur through infringement claims made by private parties. In most of these cases the defendants are a few websites, ISPs and Government Departments. It is not clear whether any opposition is presented and whether a high level of scrutiny is visited prior to the directions for blocking being made. While many of such claims may be legitimate there do exist legitimate arguments on proportionality and how over-broad intellectual property enforcement results in deprivations of the public’s right to access materials online. This issue is further compounded by the insufficient notice to people as there does not exist any central, or government repository for housing and publishing their directions for blocking websites.\n  We have identified that it is a lack of proactive publication and transparency in India’s blocking process whether through courts or executive bodies which is causing a fracture of public trust in the exercise of this power. At present there is a writ petition pending before the High Court of Delhi regarding the blocking of the satirical website, “ Dowry Calculator”.\n We have been working with Tanul Thakur, the petitioner and the creator of this website since May, 2019 with drafting and filing RTI applications and we also assisted with the writ petition. Our hope through this intervention is that it helps support greater transparency and the norms of proper notice to website creators, hearings in which they can put forward a defence followed by a public disclosure of the decision. You can read more about this case here, from when  notice was first issued, to the  stand taken by the government. As always, IFF is committed towards working relentlessly towards protecting your digital rights.", "posttime": "2020-06-29 05:51:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "提供,blocking,网站", "title": "举报人在印度为4000多个网站提供封锁令", "title_en": "Whistleblower provides blocking orders for over 4000 websites in India", "transed": 1, "url": "https://internetfreedom.in/whistleblower-provides-website-blocking-orders-on-4000-websites/", "via": "", "real_tags": ["提供", "blocking", "网站"]}, {"category": "", "categoryclass": "", "imagename": "e3d145cc77e906bc4ad93610d6304aa2.jpg", "infoid": 1008784, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "坐落在威尔士中部乡村一座偏远的、被风吹过的山顶上，坐落着一系列旨在保护我们免受人类文明最重大风险之一的建筑。\n位于波伊斯奈顿附近的太空卫士中心是一个正在工作的天文台，追踪可能撞击地球的近地天体-彗星和小行星。\n该中心主任杰伊·泰特(Jay Tate)于1997年建立了该中心，此前他开始担心英国和国际上在应对威胁方面缺乏协调。\n泰特先生说，技术的存在是为了能够将彗星和小行星推离地球，如果它们被发现得足够早的话。\n对于泰特来说，问题在于没有足够多的人认真对待这一威胁-对普通公民甚至当权者来说，这是一个遥远的威胁。\n作为英国陆军的一名前军官，泰特在那里专门研究导弹系统，他并没有将自己的工作浪漫化。\n1994年，当他通过望远镜观察彗星撞击木星时，他对人类构成的威胁感到震惊。\n在我看来，这显然是一种显而易见的、迫在眉睫的危险，而且会有适当的制度。而且那里有。\n多年来，泰特一直试图推动这一问题在军事圈子和白厅提上议事日程，但他表示，有人告诉他走开，闭嘴。\n他没有按照别人告诉的做-他津津有味地回忆起这件事-相反，他着手建立了太空卫士中心，也就是众所周知的国家近地天体信息中心。\n由于冠状病毒大流行，该中心现在对游客关闭，该中心位于距离英国边境约1公里(0.6英里)的黑暗天空区域。\n只有沿着农夫的跑道，穿过一片长满绵羊的田野才能到达，这是一个不太可能完成如此重要工作的地点。\n与火山和地震等不可预测的自然灾害不同，泰特表示，彗星和小行星是完全可预测的。\n泰特表示，只需一颗板球场大小的小行星就能摧毁伦敦这么大的一个城市。\n他说，2013年，俄罗斯城市车里雅宾斯克避免了被完全夷为平地，可能只有4秒左右，当时一颗流星在人们震惊的注视下破裂。\n他解释说，如果你把面积扩大到500米宽左右，就会有一个合理大小的国家。\n如果你上升到一公里宽的地方，其影响将是全球性的。不是大规模灭绝，而是我们所知的文明将不复存在。\n如果你走到10公里，你正在谈论的是一场非常大范围的大灭绝。\n但这并不全是厄运和悲观。泰特先生说，这项技术的存在是为了探测、跟踪甚至转移这些物体离开地球。\n问题是，你的房子被烧毁的情况非常非常罕见，但你仍然购买了保险。\n美国的小行星中心(MPC)每天都会发布一份它想要监测的物体的清单。\n像世界各地数以千计的其他天文台和业余天文学家一样，太空卫士中心从名单中挑选一个它能够观察到的物体。\n它找到物体应该位于的空间区域，并拍摄三张照片。\n然后，计算机分析这些照片，找出一个相对于恒星运动的物体。\n计算机进行的计算可以确定物体围绕太阳的轨道，并将其发回MPC。\n泰特解释说，有几种方法可以使彗星或小行星偏转，但都依赖于提前几年或几十年找到撞向地球的物体的能力。\n这是因为你只需稍稍偏离它，就能使它险些失手。\n更简单的方法包括用什么东西击中它，但泰特说，而另一种选择可能是在其表面引爆一枚核弹。\n泰特说，2013年，当这颗流星在车里雅宾斯克上空碎裂时，没有人预料到它会出现。\n这在一定程度上是因为它的体积很小(直径约20米)，但也是因为包括太空卫士中心在内的天文台的望远镜都是在其他地方训练的。\n泰特解释说，另一个物体足够大，可以挖出一块大小合理的大陆，它是从地球和月球之间经过的，在这项业务中被认为是危险的近在咫尺。\n目前，泰特表示，该中心仅限于简单地追踪，而不是寻找物体--但这种情况可能很快就会改变。\n2009年，剑桥大学向该中心提供了一台即将退役的望远镜。\n泰特先生没有地方放置这个7.5吨重的望远镜，但多亏了一群志愿者，它现在被安置在一个定制的圆顶内。\n冠状病毒已经停止了这个名为Drax的项目的重要工作，所以它可能需要数年时间才能准备就绪。\n但泰特承认，他最重要的工作可能并不是真正追求彗星和小行星。\n他总结道，我们的工作之一就是说服其他人相信这很重要。\n希望这种情况不会在我们的有生之年、下个世纪、下一个千年发生。我不知道。如果我知道，我会很高兴的。\n重点是它会发生，而当它真的发生时，生活就会以一种非常巨大的方式变成痛苦。", "note_en": "Perched on top of a remote, wind-swept hill in rural mid-Wales sits a series of structures designed to protect us against &#34;one of the most significant risks to human civilisation&#34;.\n The Spaceguard Centre, near Knighton, in Powys, is a working observatory which tracks &#34;near-Earth objects&#34; - comets and asteroids which could hit Earth.\n Its director, Jay Tate, established the centre in 1997 after he became concerned at a lack of co-ordination in the UK and internationally to counter the threat.\n Mr Tate said technology exists to be able to &#34;nudge&#34; comets and asteroids away from Earth if they are detected early enough.\n  The problem, for Mr Tate, is that not enough people take the threat seriously - to the average citizen and even those in power, it is a distant threat.\n    A former officer in the British Army, where he specialised in missile systems, Mr Tate does not romanticise his work.\n   He became alarmed at the threat posed to humanity in 1994, when he watched through a telescope as a comet hit Jupiter.\n &#34;It seemed crystal clear to me that it was a clear and present danger, and that there would be systems in place. And there weren&#39;t.&#34;\n After years of trying to push the issue up the agenda in military circles and in Whitehall, Mr Tate said he was told to &#34;go away and shut up&#34;.\n  He did not do as he was told - something he recalls with relish - and instead went about setting up the Spaceguard Centre, also known as the National Near Earth Objects Information Centre.\n Now closed to tourists due to the coronavirus pandemic, the centre sits in a dark sky area about 1km (0.6 miles) from the English border.\n Reachable only by driving along a farmer&#39;s track through a field full of sheep, it is an unlikely setting for such important work.\n  Unlike natural hazards like volcanoes and earthquakes, which are unpredictable, Mr Tate said comets and asteroids are &#34;totally predictable&#34;.\n   Mr Tate said it would only take an asteroid the size of a cricket pitch to take out a city the size of London.\n In 2013, he said the Russian city of Chelyabinsk avoided being &#34;completely flattened, probably by a matter of four seconds&#34; when a meteor broke up as people looked on in shock.\n  &#34;If you go up in size to something like 500m across, that would take out a reasonable-sized country,&#34; he explained.\n &#34;If you go up to something a kilometre across, the effects would be global. Not a mass extinction, but civilisation as we know it would cease to exist.\n &#34;If you go up to 10km, you are talking about a mass extinction on a very large scale.&#34;\n  But it is not all doom and gloom. Mr Tate said the technology exists to detect, track and even divert these objects away from earth.\n  &#34;The point is it&#39;s very, very rare for your house to burn down, but you still take out insurance.&#34;\n  Each day, the  Minor Planet Centre (MPC) in the USA publishes a list of objects it would like to be monitored.\n The Spaceguard Centre, like thousands of other observatories and amateur astronomers around the world, picks an object it is able to observe from the list.\n It finds the area of space where the object should be located and takes three photographs.\n Computers then analyse the photographs to find an object which is moving relative to the stars.\n Calculations made by the computer can determine the object&#39;s orbit around the sun, which is sent back to the MPC.\n  There are a few ways of deflecting a comet or asteroid, Mr Tate explained, but all rely on the ability to find the object heading for Earth &#34;years or decades&#34; in advance.\n That is because &#34;you only have to deflect it a tiny amount to make it a near-miss&#34;.\n Simpler methods involve hitting it with something, but Mr Tate said, while another option could be to detonate a nuclear bomb on its surface.\n  When the meteor broke up above Chelyabinsk in 2013, &#34;nobody saw it coming&#34;, Mr Tate said.\n It was, in part, due to its small size (about 20m across), but also because observatories, including the Spaceguard Centre, had their telescopes trained elsewhere.\n The other object was big enough to take out a &#34;reasonable-sized continent&#34;, Mr Tate explained, and had passed between Earth and the moon - considered &#34;danger close&#34; in the business.\n At the moment, Mr Tate said the centre is limited to simply tracking rather than finding objects - but this could soon change.\n  In 2009, Cambridge University offered the centre one of its telescopes which was being decommissioned.\n Mr Tate had nowhere to put the 7.5-tonne telescope, but thanks to a band of volunteers, it is now housed inside a custom-built dome.\n Coronavirus has put a stop to vital work on the project, named Drax, so it could be years before it is ready.\n   But Mr Tate acknowledges his most important work might not be in the actual pursuit of comets and asteroids.\n &#34;One of our jobs is to persuade everyone else that this is important,&#34; he concluded.\n &#34;This hopefully won&#39;t happen in our lifetime, in the next century, in the next millennium. I don&#39;t know. If I did know, I would be happy.\n &#34;Point is it will happen, and when it does happen, life turns to pain in a very big way.&#34;", "posttime": "2020-06-29 05:50:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "事件,events,中心", "title": "灭绝事件：帮助保护地球的人", "title_en": "Extinction events: The man helping protect earth", "transed": 1, "url": "https://www.bbc.com/news/uk-wales-53082475", "via": "", "real_tags": ["事件", "events", "中心"]}, {"category": "", "categoryclass": "", "imagename": "37b1c3177197da01030525451ed6e43b.jpg", "infoid": 1008783, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "长达数十年的耐力训练改变了人体骨骼肌中对新陈代谢健康非常重要的基因的活性。这是根据瑞典卡罗林斯卡学院和美国圣地亚哥大学的研究人员在“细胞报告”杂志上发表的一项新研究得出的结论。未经训练的人的性别差异也随着长期训练而大幅减少。这一结果可能对代谢性疾病的预防有一定的意义。众所周知，一生进行的运动训练可以带来许多健康益处，并可以预防2型糖尿病、心脏病和癌症等疾病，但这些影响背后的机制并不完全清楚。\n圣地亚哥大学综合工程系助理教授、卡罗林斯卡研究所生理学和药理学系研究员马克·查普曼(Mark Chapman)说，尽管短时间的锻炼已被证明会影响我们肌肉中的脂肪含量，但终生致力于习惯性锻炼才与长期的健康益处相关，该研究的主要作者马克·查普曼(Mark Chapman)是卡罗林斯卡研究所生理和药理学系的研究员。因此，了解我们的肌肉在多年的训练中是如何变化的，对于确定运动与健康之间的联系至关重要。\n目前的研究包括至少在过去15年内进行高强度训练的个人，要么是长期耐力训练(9名男性/9名女性)，要么是力量训练(7名男性)，以及年龄匹配的未受过训练的健康对照组(7名男性/8名女性)。从所有40名志愿者的骨骼活检中收集，并进行RNA测序，以测量超过20000个基因的活性。\n与对照组相比，长期耐力训练(跑步或骑自行车)显著改变了女性和男性超过1000个基因的活性。许多改变的基因与许多代谢途径中活性增加有关，这些代谢途径与预防代谢性疾病(如2型糖尿病)有关。令人惊讶的是，随着长期举重的进行，只发现了26个基因发生了变化，这表明力量训练并不会导致基因活性的累积变化。然而，作者指出，这并不意味着基因活性不受举重的影响，它可能是举重时肌肉基因活性的变化与蛋白质有关，而不是与RNA有关。\n研究发现，450多个基因在未经训练的男性志愿者的肌肉中与女性志愿者的肌肉中表达不同。这种性别差异是已知存在的，但新的研究表明，通过长期的耐力训练，性别差异减少了约70%。\n研究人员还交叉引用了他们的数据，并对2型糖尿病患者在长达一个月的训练期前后的肌肉基因表达进行了研究。结果表明，与开始训练前相比，在短期运动计划之后，代谢受损的个体改变了他们的基因活性，使其与长期耐力训练组更加相似。\n卡罗林斯卡研究所生理学和药理学系教授卡尔·约翰·桑德伯格最后一位作者卡尔·约翰·桑德伯格说，这表明，即使是6-12个月的短期计划也足以积极影响患有新陈代谢障碍的人的健康。这项研究确定了可能在代谢性疾病中起作用的重要的反应性因素。更多信息：马克·A·查普曼等人。长期受过训练和未受过训练的男性和女性之间的骨骼肌转录比较，“细胞报告”(2020)。doi：10.1016/j.celrep.2020.107808", "note_en": "Decades-long endurance training alters the activity of genes in human skeletal muscle that are important for metabolic health. This is according to a new study published in the journal  Cell Reports by researchers at Karolinska Institutet in Sweden and the University of San Diego in the U.S. Sex differences found in untrained individuals were also dramatically reduced with long-term training. The results may have implications for metabolic disease prevention.    Exercise training performed over a lifetime is known to result in numerous health benefits and can prevent diseases such as type 2 diabetes, heart disease and cancer but the mechanisms behind these effects are not completely understood.\n  &#34;Although short bouts of exercise have been shown to influence the   in our muscles, it is the dedication to habitual exercise over a lifetime that is associated with long-term health benefits,&#34; says lead author Mark Chapman, assistant professor at the Department of Integrated Engineering, University of San Diego and researcher at the Department of Physiology and Pharmacology, Karolinska Institutet. &#34;Thus, understanding how our muscles are changing over many years of training is critical to determining a link between exercise and health.&#34;\n    The current study included individuals who had performed intensive   for at least the past 15 years, either long-term endurance training (9 men/9 women) or strength-training (7 men), as well as age-matched untrained healthy controls (7 men/8 women). Skeletal   biopsies were collected from all 40 volunteers, and RNA sequencing was performed to measure the activity of over 20,000 genes.\n  Long-term endurance training (running or cycling) significantly changed the activity of more than 1,000 genes in both women and men compared with controls. Many of the altered genes were related to an increased activity in numerous metabolic pathways related to the prevention of metabolic diseases, such as type 2 diabetes. Surprisingly, only 26 genes were found to be changed with long-term weightlifting, suggesting that strength training does not result in accumulated changes in gene activity. However, the authors note that this does not mean gene activity is unaffected with weightlifting, it could be that changes in muscle gene activity with weightlifting are related to proteins instead of RNA.\n  More than 450 genes were found to be expressed differently in the muscles of the untrained male volunteers versus their female counterparts. Such sex differences are known to exist, but the new study demonstrates that sex differences decreased by about 70 percent with long-term endurance training.\n    The researchers also cross-referenced their data with studies examining muscle gene expression before and after a months-long training period in individuals with type 2 diabetes. The results show that following short exercise programs, individuals with impaired metabolism shifted their gene activity to become more similar to the long-term endurance-trained groups compared with before they started training.\n  &#34;This suggests that even short   programs of 6–12 months are enough to positively influence the health of people suffering from metabolic disorders,&#34; says last author Carl Johan Sundberg, professor at the Department of Physiology and Pharmacology, Karolinska Institutet. &#34;The study identifies important &#39; -responsive&#39;   that may play a role in metabolic diseases.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tMark A. Chapman et al. Skeletal Muscle Transcriptomic Comparison between Long-Term Trained and Untrained Men and Women,  Cell Reports (2020).  DOI: 10.1016/j.celrep.2020.107808", "posttime": "2020-06-29 05:49:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "基因,term,训练", "title": "长期锻炼对代谢健康相关基因的影响", "title_en": "Long-term exercise impacts genes involved in metabolic health", "transed": 1, "url": "https://medicalxpress.com/news/2020-06-long-term-impacts-genes-involved-metabolic.html", "via": "", "real_tags": ["基因", "term", "训练"]}, {"category": "", "categoryclass": "", "imagename": "b8a3e5d59628760fc938e984959a9c25.jpeg", "infoid": 1008782, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(路透社)-Facebook Inc.(FB.O)广告抵制活动的组织者得到了迅速扩大的大公司名单的支持，目前正准备将这场战斗推向全球，以增加对这家社交媒体公司的压力，要求其删除仇恨言论。\n常识传媒执行长Jim Steyer周六在接受路透专访时表示，“为利止恨”运动将开始号召欧洲各大企业加入抵制行动.。自本月早些时候该活动启动以来，包括威瑞森通讯(VZ.N)和联合利华(ULVR.L)在内的160多家公司已经签约，停止在这个全球最大的社交媒体平台上购买7月份的广告。\n在被明尼阿波利斯警方击毙的手无寸铁的黑人乔治·弗洛伊德(George Floyd)死亡后，自由新闻与常识(Free Press And Common Sense)与美国民权组织改变颜色(Color Of Change)和反诽谤联盟(Anti-Defamation League)共同发起了这项运动。\n“下一个前沿是全球压力，”Steyer说，并补充说，这场运动希望鼓励欧洲的监管机构对Facebook采取更强硬的立场。欧盟委员会(European Commission)在6月份宣布了新的指导方针，要求包括Facebook在内的科技公司提交关于它们如何处理冠状病毒错误信息的月度报告。\n美国对弗洛伊德之死的愤怒引起了世界各地企业前所未有的反应。它的影响已经超越了美国的国界。例如，联合利华(Unilever)更改了一种在印度很受欢迎的皮肤美白产品的名称，名为“美丽可爱”(Fair And Look)。\n随着组织者继续敦促更多的美国公司参与，全球活动将继续进行。自由新闻联席首席执行官杰西卡·冈萨雷斯(Jessica Gonzalez)表示，她已经联系了美国主要的电信和媒体公司，要求他们加入这一活动。\n为了回应采取更多行动的要求，Facebook周日承认还有更多工作要做，并正在与民权组织和专家合作，开发更多工具来打击仇恨言论。Facebook表示，其对人工智能的投资使其能够在用户举报之前发现90%的仇恨言论。\n将活动扩展到美国以外的地区将从Facebook的广告收入中分得更大的份额，但不太可能产生重大的财务影响。例如，联合利华(Unilever)周五承诺，今年剩余时间将暂停其在Facebook上的美国支出。据媒体和科技研究公司LightShed Partners的理查德·格林菲尔德(Richard Greenfield)称，这仅占其每年用于Facebook广告的2.5亿美元总支出的约10%。\nSteyer表示，他们将敦促联合利华(Unilever)和本田(Honda)等只承诺暂停美国广告的全球广告商在全球范围内撤回Facebook广告。\nFacebook每年产生700亿美元的广告销售额，其中约四分之一来自联合利华(Unilever)等大公司，其绝大多数收入来自小企业。\n但围绕其仇恨言论政策的宣传损害了其认知和库存。上周五，Facebook股价下跌8.3%，市值蒸发560亿美元。\n斯蒂尔说，敦促更多美国以外的公司加入的新努力表明，社会正义团体和支持他们的公司对Facebook对虚假信息和仇恨言论缺乏行动感到了多么沮丧。\n他和冈萨雷斯表示，Facebook周五推出新措施禁止广告，并为政客的仇恨言论贴上标签，以安抚抵制者，这一努力没有达到竞选活动的要求。\n冈萨雷斯说：“如果他们认为周五就结束了，那他们就大错特错了。”“我们不需要这里那里的一次性政策。我们需要全面的政策。“。\n停止仇恨谋利概述了一系列要求，其中包括单独的审查程序，以帮助成为种族和其他身份识别目标的用户，提高报告仇恨言论事件数量的透明度，以及停止从有害内容中产生广告收入。\n此外，广告技术公司AdComplyRx的首席执行官伊恩·奥雷孔迪(Ian Orekondy)表示，Facebook没有解决退款要求，这些公司的广告显示在后来因违反政策而被删除的内容旁边。AdComplyRx是一家帮助制药品牌发布数字广告的广告技术公司，该公司已经加入了抵制行动。\n抵制行动已经加速，包括Twitter等其他数字广告平台。星巴克周日表示，将暂停所有社交媒体平台上的广告，同时与民权组织合作，“阻止仇恨言论的传播”。", "note_en": "(Reuters) - Organizers of a Facebook Inc (  FB.O) advertising boycott campaign that has drawn support from a rapidly expanding list of major companies are now preparing to take the battle global to increase pressure on the social media company to remove hate speech.\n  The “Stop Hate for Profit” campaign will begin calling on major companies in Europe to join the boycott, Jim Steyer, chief executive of Common Sense Media, said in an interview with Reuters on Saturday. Since the campaign launched earlier this month, more than 160 companies, including Verizon Communications (  VZ.N) and Unilever Plc (  ULVR.L), have signed on to stop buying ads on the world’s largest social media platform for the month of July.\n Free Press and Common Sense, along with U.S. civil rights groups Color of Change and the Anti-Defamation League, launched the campaign following the death of George Floyd, an unarmed Black man killed by Minneapolis police.\n “The next frontier is global pressure,” Steyer said, adding the campaign hopes to embolden regulators in Europe to take a harder stance on Facebook. The European Commission in June announced new guidelines for tech companies including Facebook to submit monthly reports on how they are handling coronavirus misinformation.\n The outrage in the United States over the death of Floyd has led to an unprecedented reaction from corporations around the world. Its impact has been felt beyond U.S. borders. Unilever, for example, changed the name of a skin-lightening product popular in India called Fair and Lovely.\n The global campaign will proceed as organizers continue to urge more U.S. companies to participate. Jessica Gonzalez, co-chief executive of Free Press, said she has contacted major U.S. telecommunications and media companies to ask them to join the campaign.\n Responding to demands for more action, Facebook on Sunday acknowledged it has more work to do and is teaming up with civil rights groups and experts to develop more tools to fight hate speech. Facebook said its investments in artificial intelligence have allowed it to find 90% of hate speech before users report it.\n Expanding the campaign outside the United States will take a bigger slice off of Facebook’s advertising revenue but is not likely have major financial impact. Unilever, for instance, on Friday committed to pausing its U.S. spending on Facebook for the rest of the year. That only accounts for about 10% of its overall estimated $250 million it spends on Facebook advertising annually, according to Richard Greenfield of LightShed Partners, a media and tech research firm.\n Steyer said they will urge global advertisers such as Unilever and Honda, which have only committed to pausing U.S. ads, to pull their Facebook ads globally.\n Annually, Facebook generates $70 billion in advertising sales and about a quarter of it comes from big companies such as Unilever with the vast majority of its revenue derived from small businesses.\n But the publicity around its hate speech policies have hurt its perception and stock. On Friday, Facebook’s 8.3% decline in stock price wiped out $56 billion in market capitalization.\n The renewed push to urge more companies outside of the United States to join demonstrates the level of frustration felt by social justice groups and the companies that support them over Facebook’s lack of action on misinformation and hate speech, Steyer said.\n He and Gonzalez said Facebook’s efforts on Friday to introduce new measures to ban ads and label hate speech from politicians to appease boycotters fell short of the campaign’s demands.\n “If they think they are done based on Friday, they are sorely mistaken,” Gonzalez said. “We don’t need a one-off policy here and there. We need comprehensive policy.”\n Stop Hate for Profit has outlined a set of demands, which include a separate moderation process to help users who are targeted by race and other identifiers, more transparency on how many incidents of hate speech are reported and to stop generating ad revenue from harmful content.\n Moreover, Facebook did not address demands that it refund companies whose ads are displayed next to content that is later removed for policy violations, said Ian Orekondy, chief executive of AdComplyRx, an advertising tech company that helps pharmaceutical brands with their digital ads, which has joined the boycott.\n The boycott has accelerated to include other digital advertising platforms such as Twitter. Starbucks said Sunday it would pause advertising on all social media platforms while it works with civil rights organizations to “stop the spread of hate speech.”", "posttime": "2020-06-29 05:30:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,facebook,ad", "title": "Facebook广告抵制活动走向全球，组织者称", "title_en": "Facebook ad boycott campaign to go global, organizers say", "transed": 1, "url": "https://www.reuters.com/article/us-facebook-ads-boycott-exclusive/exclusive-facebook-ad-boycott-campaign-to-go-global-organizers-say-idUSKBN23Z0O4", "via": "", "real_tags": ["广告", "facebook", "ad"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008781, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一家成长型初创公司工作最困难的部分是每年都要重新面试你的工作。\n在你25人的初创公司中，你将领导一个关键职能部门。也许你是工程部主管；也许你负责市场营销。见鬼，也许你是首席执行官。你的初创企业发展迅速，公司的需求也随之发展。新世界的事情现在进展顺利，但可能不是最好的。最终，首席执行官和董事会进入一个房间，讨论下一步该做什么。\n我可以告诉你这个房间里会发生什么。董事会将讨论你的表现，并将其与其他假设的高管的表现进行比较-就像你是在面试自己的工作一样。对你有利：你是一个已知的数字，大概被认为是有才华的，甚至可能是一个亲密的朋友。反对你：你以前没有这样做过，我们现在就需要结果。\n在许多情况下，这种谈话会导致你被降职或被要求离开。在特别残酷的情况下，你可能真的会因为工作出色而被解雇。这是正常的，半预期的，糟糕透顶。这发生在每个人身上-即使是创始的首席执行官也不能幸免。\n这种情况下最困难的部分是什么？这些残酷的事实往往不言而喻。有时候，要告诉一个风雨同舟的人，他们有望成为未来大联盟高管的替身，这实在是太尴尬了。如果你的管理团队是第一次，他们可能甚至没有意识到正在发生什么-他们也可能在扩展过程中速度不够快。至少在你面试的时候，你有明确的机会脱颖而出；在忙碌的成长过程中，这样的机会可能不会被填鸭式地灌输给你。\n要避免这种情况，您需要成为一台自缩放机器。如饥似渴地阅读，并找到机会将新技能付诸实践-在成长模式中，总是有太多的事情要做，所以要利用优势，获得实际的战场经验。你应该经常在你的脑海中有一个你希望你的团队在6个月后会是什么样子的形象，并引导你走向那个未来的世界。学会环顾四周可以让你独立扩大规模，而独立性是一个关键的领导力特质，因为初创公司总是如火如荼。寻找在自己的职业生涯中领先你至少2-3年的导师，是建立这些本能的另一种很好的方式。\n最重要的是，问问题。问问你的经理，他们预计你的工作在6个月后会有什么不同(如果你是首席执行官，这个建议会略有不同--值得信赖的顾问和/或高管教练可以提供帮助)。问问他们认为你目前在这个角色中的发展轨迹是什么。根据我的经验，人们一般都不敢直接问问题，尤其是对他们的经理--你的经理的工作就是为你的职业问题提供高质量的答案。如果你做到了这一点，这就是增加责任和发展的快车道。\n从另一个角度来看，运营良好的成长型初创公司给了你定期面试更高级别(或两级！)的机会。这是一种行之有效的加速你职业生涯的方法。如果您与不断增长的组织一起扩展，您可以将数十年的经验打包为数年。", "note_en": "The hardest part of working at a growth startup is having to re-interview for your job every year.\n  You’re heading a key function at your 25-person startup. Maybe you’re head of engineering; maybe you run marketing. Hell, maybe you’re the CEO. You kick ass and your startup grows fast – and with that growth, the needs of the company evolve. Things in the new world are now going okay, but perhaps not optimally. Eventually, the CEO and board of directors get in a room to discuss what to do.\n I can tell you what will happen in this room. The board will discuss your performance, and compare it to the performance of other, hypothetical executives – just as if you were interviewing for your own job. In your favor: you are a known quantity, presumably viewed as talented, and perhaps even a close friend. Against you: you haven’t done this before, and we need results now.\n In many cases this conversation will lead to you being demoted or asked to leave. In extra cruel circumstances, you can literally get fired for having done a great job. This is normal, semi-expected, and sucks. And this happens to everyone – even founding CEOs are not immune.\n The hardest part of this situation? These hard truths often go unspoken. Sometimes it’s just too awkward to tell someone who’s been there through thick and thin that they’re expected to be a stand-in for a future big league exec. And if you have a first-time management team, they might not even realize what’s going on – they may also be in the process of not scaling fast enough, either. At least when you’re interviewing, you’re explicitly given the chance to shine; such opportunities may not be spoon-fed to you during hectic growth.\n  To avoid this situation you need to become a self-scaling machine. Read voraciously, and find opportunities to put new skills into practice – during growth mode there’s always too much to do, so take advantage and gain actual battlefield experience. You should constantly have an image in your mind of where you expect your team to be in 6 months and steer towards that future world. Learning to see around corners allows you to scale independently, and independence is a key leadership trait since  startups are constantly on fire. Finding mentors who are at least 2-3 years ahead of you in terms of their own careers is another great way to build these instincts.\n And most importantly,  ask questions. Ask your manager how they expect your job will be different in 6 months (if you’re the CEO, this advice will be slightly different – a trusted advisor and/or executive coach can help). Ask them what they see as your current trajectory in the role. In my experience people are way too shy about asking direct questions in general, especially to their managers – it is literally your manager’s job to provide high-quality answers to your career questions. If you nail this, it’s a fast track towards increasing responsibility and growth.\n  From the other perspective, well-run growth startups give you the regular opportunity to interview for roles that are a level higher (or two!).  This is a  proven way to  accelerate your  career. If you scale with a growing organization, you can pack decades of experience into years.", "posttime": "2020-06-29 05:29:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "初创,part", "title": "在成长型初创企业工作最困难的部分", "title_en": "The Hardest Part of Working at a Growth Startup", "transed": 1, "url": "https://staysaasy.com/scaling/2020/06/27/hardest-part-of-startup-scale-yourself.html", "via": "", "real_tags": ["初创", "part"]}, {"category": "", "categoryclass": "", "imagename": "1ff4cd858ac0b98e999e94769966f47a.jpg", "infoid": 1008779, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软发布了一款新的数据恢复应用程序，可用于检索已删除的文件，或从已格式化或损坏的驱动器中取回文档。\nWindows文件恢复是Microsoft应用商店中的免费应用程序，可用于恢复因各种原因丢失的数据。命令行工具可用于从本地硬盘驱动器以及可移动介质(如USB驱动器和存储卡)检索数据。\n由于这是一个命令行工具，而不是本机Windows应用程序，Windows文件恢复不会迎合每个人的口味。以前，对于那些不介意撸起袖子弄脏手的人来说，它提供了一种从NTFS、FAT、exFAT和ReFS格式化驱动器中取回文件的方法。\n不小心删除了一个重要文件？擦除了你的硬盘吗？不确定如何处理损坏的数据？Windows文件恢复可帮助恢复您的个人数据。\n对于照片、文档、视频等，Windows文件恢复支持多种文件类型，以帮助确保您的数据不会永久丢失。\n从相机或SD卡恢复？尝试签名模式，该模式超越了NTFS恢复，可满足您的存储设备需求。让此应用程序成为您帮助从硬盘、固态硬盘(*受Trim限制)、USB驱动器或存储卡查找所需内容的首选。\n您可以在此处下载Windows文件恢复，有关该应用程序的详细信息，请访问Microsoft支持网站。", "note_en": "Microsoft has released a new data recovery app which can be used to retrieve files that have been deleted, or get back documents from drives that have been formatted or have become corrupt.\n Windows File Recovery is a free app in the Microsoft store which can be used to recover data that has been lost for a variety of reasons. The command line tool can be used to retrieve data from local hard drives as well as removable media such as USB drives and memory cards.\n      As this is a command line tool rather than a native Windows app, Windows File Recovery is not going to be to everyone&#39;s taste. Before for those who don’t mind rolling up their sleeves and getting their hands dirty, it provides a means of getting back files from NTFS, FAT, exFAT and ReFS formatted drives.\n  Accidentally deleted an important file? Wiped clean your hard drive? Unsure of what to do with corrupted data? Windows File Recovery can help recover your personal data.\n For photos, documents, videos and more, Windows File Recovery supports many file types to help ensure that your data is not permanently lost.\n Recovering from a camera or SD card? Try Signature mode, which expands beyond NTFS recovery and caters to your storage device needs. Let this app be your first choice for helping to find what you need from your hard drive, SSD (*limited by TRIM), USB drive, or memory cards.\n You can download Windows File Recovery  here, and more information about the app is available on the Microsoft  support site.", "posttime": "2020-06-29 04:50:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,windows,微软,文件,恢复", "title": "微软新的“Windows文件恢复”工具可恢复已删除的数据", "title_en": "Microsoft's New 'Windows File Recovery' Tool Restores Deleted Data", "transed": 1, "url": "https://betanews.com/2020/06/27/microsoft-windows-file-recovery-app/", "via": "", "real_tags": ["microsoft", "windows", "微软", "文件", "恢复"]}, {"category": "", "categoryclass": "", "imagename": "22d46cca920551b7d1eb2cc832414959.jpg", "infoid": 1008778, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "·神经血管耦合·引流静脉·线性·前欠冲·后欠冲·长时间·心理计时学·负信号变化·静息状态源·死鱼激活·巫毒相关·全局信号回归·运动伪影·解码信号·非神经元粗体·与其他测量的关系·对比：自旋回波与梯度回波·对比：渗透对比·对比：弥散变化·对比：神经元电流·对比：核磁共振相位成像·测谎·相关≠连接·聚类难题·重现。\n这将是我即将出版的《MIT Press Essential Knowledge》丛书“Functional MRI”的一个章节。\n功能磁共振成像的独特之处在于，尽管作为一种方法已经有近30年的历史，但它在采集、硬件、处理的复杂性方面不断进步，在我们对信号本身的理解方面也是如此。这些地区中的任何一个都没有平台期。事实上，翻阅文献，我们会有这样的印像，就是这一进步正在加速。每一项新的进展都打开了可能产生影响的潜在范围，使有关大脑的新问题得以解决。\n尽管它取得了成功-也许是因为它的成功-但它也有其与方法进步、新观察和新应用相一致的争议。有些争议比其他争议更具争议性。多年来，我一直在关注这些争议，有时会进行研究来解决它们，或者至少更好地理解它们。一场好的争论可以帮助推动该领域向前发展，因为它可以集中精力并激励一群人本身致力于这一问题，在这些问题被克服的过程中，为该领域带来更广泛的曙光。\n虽然有几个争议或争议问题已经完全解决，但大多数在一定程度上仍然没有解决。通过了解fMRI的争议，可以更深入地了解该领域作为一个整体是如何进步的-以及科学是如何真正工作的-错误的开始、纠正，以及那些拥有潜在有用的脉冲序列、处理方法或应用的人提出的各种主张。下面是fMRI中26个主要争议的列表-大致按时间顺序排列。\n自19世纪末以来，Roy和Sherrington在1890年假设的普遍共识是，激活诱导的脑血流变化是由代谢需求的局部变化驱动的。1986年，福克斯等人出版了一本书。(2)挑战了这一观点，表明随着激活，局部血流量似乎增加到氧化代谢需求之外，这表明在激活过程中血流动力学反应与代谢需求“脱钩”。许多人，包括美国国立卫生研究院(National Institutes Of Health)著名的神经生理学家路易斯·索科洛夫(Louis Sokolof)，对这一结果提出了强烈质疑。福克斯在“耦合之争”(3)中从他的视角很好地描述了历史上的这一时期。\n我清楚地记得，在功能磁共振成像的早期，索科洛夫博士站在观众面前，就几种情况与福克斯进行辩论，认为血流反应应该与新陈代谢需要相匹配，氧合应该没有变化。他争辩说，我们在功能磁共振成像中看到的不是氧合变化。\n在功能磁共振成像之前的日子里，我记得不知道信号应该朝哪个方向走-就像1991年8月，当我第一次看到汤姆·布雷迪(Tom Brady)在磁共振学会(SMR)会议上关于MRI未来的全体讲座上展示的影响深远的视频时，从这些减影图像的时间序列电影中，我不清楚他执行减法操作的方向。是任务减去休息还是休息减去任务？信号是随着激活而上升还是下降？我也记得很清楚，分析我的第一次功能磁共振实验时，预计会看到BOLD信号的减少-正如小川在早期的一篇论文(4)中假设的那样，代谢率的增加会导致血液含氧量的降低，从而使BOLD信号在大脑激活期间变暗。相反，我所看到的都是信号的增加。正是福克斯的研究帮助我理解了为什么大胆的信号应该随着激活而增加。血流量增加，氧气输送超过新陈代谢需要，导致血液含氧量增加。\n虽然神经血管偶联的模型已经有所改善，但我们仍然不了解流量增加的确切需要。首先，我们有“浇灌整个花园来养活一朵干渴的花”的假说，该假说认为流量的增加与某一区域的新陈代谢需求相匹配，但由于血管控制粗糙，丰富的氧合被输送到比所需更广的区域，导致氧合增加。我们还有一个“扩散限制”模型，该模型假设为了将足够的氧气从供氧血管输送到最远的神经元，血管本身需要过多的氧气，因为氧气从血管扩散到最远的细胞时氧的减少被描述为指数级的。但这一理论已经有点失宠，因为CMRO2的增加或血液中氧气向组织扩散的限制程度往往高于生理指标。新陈代谢需要假说的替代方案涉及神经性的“前馈”假说--它仍然不能理解流动反应的“为什么”。\n目前，这就是田野所在的地方。我们知道，流量响应是稳健和一致的。我们知道，在活跃的区域，健康大脑中的含氧量总是会增加，然而我们只是不能具体地理解为什么需要这样做。它是一种神经性的、新陈代谢的机制，还是其他某种机制，以满足某些进化上的关键需求，而不仅仅是简单的对更多氧气的需求？我们仍在弄清楚这一点。然而，可以说，无论流量增加的原因是什么，它从根本上说都是重要的，因为大胆的反应是令人震惊的始终如一的。\n问题是：“引流的静脉怎么办？”我想最早是由明尼苏达大学的卡米尔·乌古比尔在一次早期的功能磁共振会议上提出的。在这里和接下来的几年里，他提醒社区注意观察到的情况，特别是在低场下，引流静脉是一个问题，因为它们会涂抹和扭曲功能磁共振信号的变化，以至于很难高度确定地知道潜在神经元激活的具体位置。在“神经影像”的“功能磁共振成像20年：科学与故事”特刊中，拉维·梅农(Ravi Menon)对“大脑与静脉”之争写了一篇透彻的叙述(5)。当第一批fMRI论文发表时，只有一篇是由Ogawa等人发表的。(6)高场(4特斯拉)，分辨率相对较高。在小川的论文中，研究表明，静脉(非常热点)和毛细血管(灰质中更分散、更弱的激活)之间存在差异。Ravi随后发表了另一篇使用多回波成像的论文(7)，显示静脉中的血液在4T时比灰质的T2*衰减期更短，在T2*加权结构图像中显示为暗点，但在4T功能图像中显示为明亮的功能热点。由于1.5T时的低信噪比和CNR，只能看到最强烈的大胆效果，而且由于模型表明，在低场强下，大血管对信号的贡献最大，因此该领域担心，所有fMRI正在查看的都是静脉-至少在1.5T。\n即使在高场下，使用标准梯度回波EPI也普遍存在大静脉效应的问题。简单地说，粗体信号与每个体素中的静脉血容量贡献成正比。如果静脉血容量很高-就像静脉填充体素的情况一样-那么如果该区域有血氧变化，那么巨大大胆变化的可能性就很高。在高场下，T2*加权梯度回波序列的血管内信号确实不多，但大血管的血管外效应仍然存在，自旋回波序列(对小室敏感)仍然对大血管内红细胞周围的易感性效应敏感-即使在7T，血管内贡献降低。使用梯度回波和自旋回波序列(8)，即使具有一定的静脉灵敏度，也可以在7T产生有希望的高分辨率取向柱结果。动脉自旋标记的使用作为一种对大静脉不敏感的方法是有潜力的，尽管时间效率、固有的敏感性和脑覆盖的限制削弱了它的实用性。血管空间占有率(VASO)是一种对血容量变化敏感的方法，已被证明对小血管和毛细血管的血容量变化非常敏感。初步结果显示，使用VASO可以清楚地显示依赖于层的激活，而其他方法提供的描述不那么清晰(9)。\n已经出现了识别和掩蔽大静脉效应的方法，包括基于信号变化百分比的阈值(大静脉往往填充体素，从而表现出更大的分数信号变化)，以及时间波动(大静脉是脉动的，因此表现出更多的幅度和相位噪声)。虽然这些似乎是可行的解决方案，但\nfMRI预欠冲最早出现于90年代末，在刺激的前0.5秒，有时可以观察到fMRI信号先稍微向下偏转，然后再升高(12，13)。只有几个小组能够在功能磁共振成像中复制这一发现，然而，在动物模型的光学成像工作中，它似乎无处不在。假设的机制是，在血流反应有机会启动之前，氧化代谢率的更快增加会导致血液的含氧量一过性降低。然后，这种瞬时效应被随之而来的流量的大幅增加冲刷掉。\n动物研究已经证明，通过降低血压可以增强这种预失调量。在已经在人类身上看到这种影响的小组中，有一小部分人声称它更接近于“真正的”神经元激活的位置。这些研究都是遥远的过去(&gt；15年前)，从那时起，很少有论文重新探讨难以捉摸的前期未达标的研究。当然，它可能是存在的，但刺激物的精确特征和受试者的生理状态可能对它的产生至关重要。\n虽然血液动力学反应的模拟可以很容易地再现这种效应(14)，但在健康人身上通过实验有力地再现和调节这种效应的能力已经被证明是难以捉摸的。在这些实验成为可能之前，这种效应还没有完全被理解，也没有完全被描述出来。\n与前欠冲相比，后欠冲是无处不在的，并得到了广泛的研究(15)。与之前的未达标类似，其起源仍存在广泛争议。基本的观察是，在大脑激活之后，大胆信号会减少，然后在长达40秒的时间里低于基线。假设的原因包括：1)持续升高的血容量导致即使氧合和流量恢复到基线水平，脱氧血红蛋白的量仍然保持升高，2)氧化代谢率的持续升高导致血液氧合在流量和总血量恢复到基线水平时降低到基线水平以下，3)刺激后流量下降到基线水平以下。稳态血容量和氧化代谢率的流量减少会导致血液氧合降低。已经发表的论文论证了这三个假说，并显示出证据表明这三个假说中的每一个，因此，尽管这一现象很常见，但其机理仍然没有解决。也有人建议，如果这可能是由于血流量的减少，那么这种减少可能表明神经元抑制正在发生的不应期(16)。目前，后未达标的生理基础仍然是一个谜。\n这是一个早已解决的争议(17)。在功能磁共振成像的早期，研究人员进行了基本测试，以确定反应是否是神经元活动的可靠指标，其中一项测试是确定在长期稳定状态神经元激活的情况下，大胆反应是否保持升高。克鲁格等人的一项研究表明，大胆的反应在5分钟(18分钟)后就习以为常了。一项反研究表明，当棋盘闪烁25分钟时，大胆反应和心流反应(同时测量)仍然升高(19)。后来得出的结论是，第一个研究中的刺激导致了一定程度的注意和神经元习惯化，而BOLD水平和神经元活动水平之间的关系没有长期的变化。因此，现在人们普遍认为，只要神经元在放电，只要大脑处于正常的生理状态，fMRI信号在整个激活过程中都会保持高水平。\n在整个功能磁共振成像的历史上，一个主要的研究主题是可以从功能磁共振成像信号中提取多少时间分辨率。fMRI的反应相对较慢，大约需要两秒才能开始增加，如果持续激活，需要大约10秒才能达到稳定的“开”状态。在停止时，需要更长的时间才能回到基线-大约10到12秒，刺激后的长时间欠冲持续长达40秒。除了这种缓慢的反应，已经表明由于脑血管系统的空间差异，延迟的空间分布长达4秒。\n考虑到血流动力学反应的迟滞性和空间变异性，最初看起来亚秒级的时间分辨率是没有任何希望的。然而，形势比人们预期的更有希望。基本模拟表明，假设血流动力学响应中没有空间变异性，并在11次运行后给出典型的5%的大胆响应幅度和大约1%的典型时间标准偏差\n在功能磁共振成像的最初几年里，负的粗略信号变化大多被忽略了，因为研究人员不知道如何准确地解释它们。几年后，随着越来越多的负信号变化观测，这个问题在这个领域出现了，并产生了几种解释它们的假说。一种假说引发了一种“窃取”效应，即活跃区域的血流量增加，而邻近区域的血流量假设会减少。如果相邻区域的流量减少，这些区域将显示为粗体信号减少，但实际上不会被“停用”。另一种假设是，这些区域在休息时更活跃，因此在任务期间变得“失活”，因为神经元活动被重新分配到大脑的其他区域。第三个原因是，它们代表了被任务积极抑制的区域。虽然在正常健康的受试者中，关于偷窃效应的证据很少，但其他假设都是明确的可能性。事实上，默认模式网络首先被报道为在大多数认知任务中表现出一致去激活的网络(27)。这种网络失活也见于PET文献(28)。Shmuel等人(29)提出了一个令人信服的证据，证明神经元抑制与负的大胆变化相关，显示在激活到环状环周围的视觉皮质的强健失活环中，神经元尖峰电位和fMRI信号同时减少。这些观察结果似乎指向这样一种观点，即整个大脑都很活跃，能够通过几种机制被其他区域的活动抑制。此抑制因素。\n..", "note_en": "•Neurovascular Coupling  •Draining Veins  •Linearity  •Pre-undershoot  •Post-undershoot  •Long duration  •Mental Chronometry  •Negative Signal Changes  •Resting state source  •Dead fish activation  •Voodoo correlations  •Global signal regression  •Motion artifacts  •The decoding signal  •non-neuronal BOLD  •relationship to other measures  •contrast: spin-echo vs gradient-echo  •contrast: SEEP contrast  •contrast: diffusion changes  •contrast: neuronal currents  •contrast: NMR phase imaging  •lie detection  •correlation ≠ connection  •clustering conundrum  •reproducibility  •dynamic connectivity changes\n  This will be a chapter in my upcoming book “Functional MRI”  in the MIT Press Essential Knowledge Series\n  Functional MRI is unique in that, in spite of being almost 30 years old as a method, it continues to progress in terms of sophistication of acquisition, hardware, processing, in our understanding of the signal itself. There has been no plateau in any of these areas. In fact, by looking at the literature, one gets the impression that this advancement is accelerating. Every new advance opens the potential range where it might have an impact, allowing new questions about the brain to be addressed.\n In spite of its success – perhaps as a result of its success – it has had its share of controversies coincident with methods advancements, new observations, and novel applications. Some controversies have been more contentious than others. Over the years, I’ve been following these controversies and have at times performed research to resolve them or at least better understand them. A good controversy can help to move the field forward as it can focus and motivate groups of people to work on the issue itself, shedding a broader light on the field as these are overcome.\n While a few of the controversies or issues of contention have been fully resolved, most remain to some degree unresolved. Understanding fMRI through its controversies allows a deeper appreciation for how the field advances as a whole – and how science really works – the false starts, the corrections, and the various claims made by those with potentially useful pulse sequences, processing methods, or applications. Below is the list of twenty-six major controversies in fMRI – in approximately chronological order.\n  Since the late 1800’s, the general consensus, hypothesized by Roy and Sherrington in 1890 (1), was that activation-induced cerebral flow changes were driven by local changes in metabolic demand. In 1986, a publication by Fox et al. (2)challenged that view, demonstrating that with activation, localized blood flow seemingly increased beyond oxidative metabolic demand, suggesting an “uncoupling” of the hemodynamic response from metabolic demand during activation. Many, including Louis Sokolof, a well-established neurophysiologist at the National Institutes of Health, strongly debated the results. Fox nicely describes this period in history from his perspective in “The coupling controversy” (3).\n I remember well, in the early days of fMRI, Dr. Sokolof standing up from the audience to debate Fox on several circumstances, arguing that the flow response should match the metabolic need and there should be no change in oxygenation. He argued that what we are seeing in fMRI is something other than an oxygenation change.\n In the pre-fMRI days, I recall not knowing what direction the signal should go – as when I first laid eyes on the impactful video presented by Tom Brady during his plenary lecture on the future of MRI at the Society for Magnetic Resonance (SMR) Meeting in August of 1991, it was not clear from these time series movies of subtracted images the direction he performed the subtraction operation. Was it task minus rest or rest minus task? Did the signal go up or down with activation? I also remember very well, analyzing my first fMRI experiments, expecting to see a decrease in BOLD signal – as Ogawa, in an earlier paper(4), hypothesized that metabolic rate increases would lead to a decrease blood oxygenation thus a darkening of the BOLD signal during brain activation. Instead, all I saw were signal increases. It was Fox’s work that helped me to understand why the BOLD signal should  increasewith activation. Flow goes up and oxygen delivery exceeds metabolic need, leading to an increase in blood oxygenation.\n While models of neurovascular coupling have improved, we still do not understand the precise need for flow increases. First, we had the “watering the whole garden to feed one thirsty flower” hypothesis which suggested that flow increases matched metabolic need for one area but since vascular control was coarse, the abundant oxygenation was delivered to a wider area than was needed, causing the increase in oxygenation. We also had the “diffusion limited” model, where it was hypothesized that in order to deliver enough oxygen to the furthest neurons from the oxygen supplying vessels, an overabundance of oxygen was needed at the vessel itself since the decrease of oxygen as it diffused from the vessel to the furthest cell was described as an exponential.  This theory has fallen a bit from favor as the increases in CMRO 2or the degree to which the diffusion of oxygen to tissue from blood is limited tend to be higher than physiologic measures. The alternative to the metabolic need hypothesis involves neurogenic “feed-forward” hypotheses – which still doesn’t get at the “why” of the flow response.\n Currently, this is where the field stands. We know that the flow response is robust and consistent. We know that in active areas, oxygenation in healthy brains always increases, however we just don’t understand specifically why it’s necessary. Is it a neurogenic, metabolic, or some other mechanism to satisfy some evolutionary critical need that extends beyond simple need for more oxygen? We are still figuring that out. Nevertheless, it can be said that whatever the reason for this increase in flow, it is fundamentally important, as the BOLD response is stunningly consistent.\n  The question: “what about the draining veins?” I think was first posited at an early fMRI conference by Kamil Ugurbil of the University of Minnesota. Here and for the next several years he alerted the community to the observation that, especially at low field, draining veins are a problem as they smear and distort the fMRI signal change such that it’s hard to know specifically where the underlying neuronal activation is with a high degree of certainty. In the “20 years of fMRI: the science and the stories” special issue of NeuroImage, Ravi Menon writes a thorough narrative of the “Great brain vs vein” debate (5).  When the first fMRI papers were published, only one, by Ogawa et al. (6), was at high field – 4 Tesla – and relatively high resolution. In Ogawa’s paper, it was shown that there was a differentiation between veins (very hot spots) and capillaries (more diffuse weaker activation in grey matter). Ravi followed this up with another paper (7)using multi-echo imaging, to show that blood in veins had an intrinsically shorter T2* decay than gray matter at 4T and appeared as dark dots in T2* weighted structural images yet appeared as bright functional hot spots in the 4T functional images. Because of the low SNR and CNR at 1.5T, allowing only the strongest BOLD effects to be seen, and because models suggested that at low field strengths, large vessels contributed the most to the signal, the field worried that all fMRI was looking at was veins – at least at 1.5T.\n The problem of large vein effects is prevalent using standard gradient-echo EPI – even at high fields. Simply put, the BOLD signal is directly proportional to the venous blood volume contribution in each voxel. If the venous blood volume is high – as with the case of a vein filling a voxel – then the potential for high BOLD changes is high if there is a blood oxygenation change in the area. At high field, indeed, there is not much intravascular signal left in T2* weighted Gradient-echo sequences, however, the extravascular effect of large vessels still exists.  Spin-echo sequences (sensitive to small compartments) still are sensitive to the susceptibility effects around intravascular red blood cells within large vessels – even at 7T where intravascular contribution is reduced. Even with some vein sensitivity, promising high resolution orientation column results have been produced at 7T using gradient-echo and spin-echo sequences (8). The use of arterial spin labeling has potential as a method insensitive to large veins, although the temporal efficiency, intrinsic sensitivity, and brain coverage limitations blunt its utility. Vascular Space Occupancy (VASO), a method sensitive to blood volume changes, has been shown to be exquisitely sensitive to blood volume changes in small vessels and capillaries. Preliminary results have shown clear layer dependent activation using VASO where other approaches have provided less clear delineation(9).\n Methods have arisen to identify and mask large vein effects – including thresholding based on percent signal change (large veins tend to fill voxels and thus exhibit a larger fractional signal change), as well as temporal fluctuations (large veins are pulsatile thus exhibit more magnitude and phase noise). While these seem to be workable solutions, they have not been picked up and used extensively. With regard to using the phase variations as a regressor to eliminate pulsatile blood and tissue, perhaps the primary reason for this not being adopted is because standard scanners do not produce these images readily, thus users do not have easy access to this information.\n The draining vein issue is least problematic at voxel sizes larger than 2mm, as at these resolutions, mostly the region of activation- as defined as &gt;1 cm “blob” is used and interpreted. Other than enhancing the magnitude of activation, vein effects do not distort these “blobs” thus are typically of no concern for low resolution studies. In fact, the presence of veins helps to amplify the signal in these cases. Spatial smoothing and multi-subject averaging – still commonly practiced – also ameliorate vein effects as they tend to be averaged out as each subject has a spatially variant macroscopic venous structure.\n The draining vein problem is most significant where details of high resolution fMRI maps need to be interpreted for understanding small and tortuous activation patterns in the context of layer and column level mapping. So far no fully effective method works at this resolution as the goal is not to mask the voxels containing veins since there may be useful capillary and therefore neuronal effects still within the voxel. We need to eliminate vein effects more effectively on the acquisition side.\n  The BOLD response is complex and not fully understood. In the early days of fMRI, it was found that BOLD contrast was both linear and nonlinear.  The hemodynamic response tends to overestimate activation at very brief (&lt;3 seconds) stimulus durations (10)or at very low stimulus intensities (11).  With stimuli that were of duration of 2 seconds or less, the response was much larger than predicted by a linear system. The reasons for these nonlinearities are still not fully understood, however for interpreting transient or weak activations relative to longer duration activation, a clear understanding of the nonlinearity of neurovascular coupling across all activation intensities and durations needs to be well established.\n  The fMRI pre-undershoot was first observed in the late 90’s. With activation, it was sometimes observed that the fMRI signal, in the first 0.5 second of stimulation, first deflected slightly downwards before it increased (12, 13). Only a few groups were able to replicate this finding in fMRI however it appears to be ubiquitous in optical imaging work on animal models. The hypothesized mechanism is that before the flow response has a chance to start, a more rapid increase in oxidative metabolic rate causes the blood to become transiently less oxygenated. This transient effect is then washed away by the large increase in flow that follows.\n Animal studies have demonstrated that this pre-undershoot could be enhanced by decreasing blood pressure. Of the groups that have seen the effect in humans, a handful claim that it is more closely localized to the locations of “true” neuronal activation. These studies were all in the distant past (&gt;15 years ago) and since then, very few papers have come out revisiting the study of the elusive pre-undershoot. It certainly may be that it exists, but the precise characteristics of the stimuli and physiologic state of the subject may be critically important to produce it.\n While simulations of the hemodynamic response can readily reproduce this effect (14), the ability to robustly reproduce and modulate this effect experimentally in healthy humans has proven elusive. Until these experiments are possible, this effect remains incompletely understood and not fully characterized.\n  In contrast to the pre-undershoot, the post-undershoot is ubiquitous and has been studied extensively (15). Similar to the pre-undershoot, its origins are still widely debated. The basic observation is that following brain activation, the BOLD signal decreases and then passes below baseline for up to 40 seconds. The hypothesized reasons for this include: 1) a perseveration of elevated blood volume causing the amount of deoxyhemoglobin to remain elevated even though oxygenation and flow are back to baseline levels, 2) a perseveration of an elevated oxidative metabolic rate causing the blood oxygenation to decrease below baseline levels as the flow and total blood volume have returned to baseline states, 3) a post stimulus decrease in flow below baseline levels. A decrease in flow with steady state blood volume and oxidative metabolic rate would cause a decrease in blood oxygenation. Papers have been published arguing for, and showing evidence suggesting each of these three hypotheses, so the mechanism of the post undershoot, as common as it is, stays unresolved. It has also been suggested that if it is perhaps due to a decrease in flow, then this decrease might indicate a refractory period where neuronal inhibition is taking place (16). For now, the physiologic underpinnings of the post-undershoot remain a mystery.\n  This is a controversy that has long been resolved (17). In the early days of fMRI, investigators were performing the basic tests to determine if the response was a reliable indicator of neuronal activity and one of the tests was to determine if, with long duration steady state neuronal activation, the BOLD response remains elevated. A study by Kruger et al came out suggesting that the BOLD response habituated after 5 minutes (18). A counter study came out showing that with a flashing checkerboard on for 25 minutes, the BOLD response and flow response (measured simultaneously) remained elevated (19). It was later concluded that the stimuli in the first study was leading to some degree of attentional and neuronal habituation and not a long duration change in the relationship between the level of BOLD and the level of neuronal activity. Therefore, it is now accepted that as long as neurons are firing, and as long as the brain is in a normal physiologic state, the fMRI signal will remain elevated for the entire duration of activation.\n  A major topic of study over the entire history of fMRI has been how much temporal resolution can be extracted from the fMRI signal. The fMRI response is relatively slow, taking about two seconds to start to increase and, with sustained activation, takes about 10 seconds to reach a steady-state “on” condition.  On cessation, it takes a bit longer to return to baseline – about 10 to 12 seconds, and has a long post-stimulus undershoot lasting up to 40 seconds. In addition to this slow response, it has been shown that the spatial distribution in delay is up to four seconds due to spatial variations in the brain vasculature.\n Given this sluggishness and spatial variability of the hemodynamic response, it may initially seem that there wouldn’t be any hope in sub-second temporal resolution. However, the situation is more promising than one would expect. Basic simulations demonstrate that, assuming no spatial variability in the hemodynamic response, and given a typical BOLD response magnitude of 5% and a typical temporal standard deviation of about 1%, after 11 runs of 5 minutes each, a relative delay of 50 to 100ms could be discerned from one area to the next. However, the spatial variation in the hemodynamic response, is plus or minus 2 seconds depending on where one is looking in the brain and depends mostly on what aspect of the underlying vasculature is captured with each voxel. Large veins tend to have longer delays.\n Several approaches have attempted to bypass or to calibrate the hemodynamic response. One way of bypassing the slow variable hemodynamic response problem is to modulate the timing of experiment, so the relative onset delays with task timing delays can be observed. This is using the understanding that in each voxel, the hemodynamic response is extremely well behaved and repeatable. Using this approach, relative delays of 500ms to 50 ms have been discerned (20-23). While these measures are not absolute, they are useful in discriminating which areas show delay modulations with specific tasks. This approach has been applied – to 500ms accuracy – to uncover the underlying dynamics and the relative timings of specific regions involved with word rotation and word recognition (23). Multivariate decoding approaches have been able to robustly resolve sub second (and sub-TR) relative delays in the hemodynamic response(24). By slowing down the paradigm itself, Formisano et al. (25)have been able to resolve absolute timing of mental operations down to the order of a second.  The fastest brain activation on-off rate that has been able to be resolved has recently been published by Lewis et al.(26)and is in the range of 0.75 Hz. While this is not mental chronometry in the strict sense of the term, it does indicate an upper limit at which high-speed changes in neuronal activation may be extracted.\n  Negative BOLD signal changes were mostly ignored for the first several years of fMRI as researchers did not know precisely how to interpret them. After several years, with a growing number of negative signal change observations, the issue arose in the field, spawning several hypotheses to explain them. One hypothesis invoked a “steal” effect, where active regions received an increase in blood flow at the expense of adjacent areas which would hypothetically experience a decrease in flow. If flow decreases from adjacent areas, these areas would exhibit a decrease in BOLD signal but not actually be “deactivated.” Another hypothesis was that these were areas that were more active during rest, thus becoming “deactivated” during a task as neuronal activity was re-allocated to other regions of the brain. A third was that they represented regions that were actively inhibited by the task. While in normal healthy subjects, the evidence for the steal effects is scant, the other hypotheses are clear possibilities. In fact, the default mode network was first reported as a network that showed consistent deactivation during most cognitive tasks(27). This network deactivation was also seen in the PET literature(28). A convincing demonstration of neuronal suppression associated with negative BOLD changes was carried out by Shmuel et al (29)showing simultaneous decreased neuronal spiking and decreased fMRI signal in a robustly deactivated ring of visual cortex surrounding activation to a ring annulus. These observations seem to point to the idea that the entire brain is tonically active and able to be inhibited by activity in other areas through several mechanisms. This inhibiti\n......", "posttime": "2020-06-29 04:49:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "磁共振,challenges,信号", "title": "功能磁共振成像领域的争议和挑战(2018)", "title_en": "Controversies and Challenges in fMRI (2018)", "transed": 1, "url": "http://www.thebrainblog.org/2018/12/23/twenty-six-controversies-and-challenges-in-fmri/", "via": "", "real_tags": ["磁共振", "信号"]}, {"category": "", "categoryclass": "", "imagename": "95b113be2e7d613af29f52bdb1d2421c.png", "infoid": 1008777, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我们第一次宣布今年秋天重新开放的计划(考虑到秋季新冠肺炎的可能患病率缺乏可靠的数据，这一决定还为时过早，但这样做是为了赶在六一全国大学决策日的最后期限之前)，许多学生、家长、教职员工问我们计划如何确保安全重新开放。我们的战略概述如下，但简短的答案是：我们的大学会像一切都会好的那样进行，因为我们真的、真的希望一切都会好起来。\n在测量了教室和检查了我们陈旧的通风系统之后，我们的工作人员(那些没有被暂时解雇的人)报告说，我们已经安排的和注册的课程绝对不可能安全地放在这些空间里。但是我们大学一直重视创造性地解决问题，所以我们在每一栋校园大楼的门上都贴了招牌。此外，为了表明我们有多么认真地对待这种情况，标志已经贴上了层压。\n所有宿舍都进行了彻底的清洁和消毒，所有住客都将被安排一个单人间。我们要求，学生入住后，频繁使用我们的洗手液站，每天同侧上下床，进出房间时准确地按开、关灯开关7次。\n当他们到达校园时，所有的学生都将收到一个欢迎包裹，其中包括一个印有我们学校标志的口罩、一个兔脚、一个马蹄铁、一个邪恶的眼睛护身符、一个Maneki-neko、一个十字架和一个大蒜球茎。我们知道有些东西是给吸血鬼看的，但你怎么小心都不为过。\n我们承认这件事很棘手。我们如何才能养活成千上万的学生，同时限制他们接触的表面数量，并保持社会距离，而与此同时，他们却摘下口罩，以便，你知道，吃东西？\n正如我们目前下岗的意大利语教授可能会说的那样，曼贾户外！我们很高兴地宣布，所有餐食都将作为预先包装好的野餐在户外供应。是的，关于病毒是否不太可能在温暖的天气传播，以及露天的好处是否被大量的人群抵消，科学上存在分歧。但我们的大学大胆地决定只相信我们喜欢的理论：那就是，在户外是好的，温暖的天气可以杀死病毒，如果每顿饭前我们一边用左脚跳着哼唱大卫·鲍伊(David Bowie)的《英雄》(Heroes)，我们就永远不会生病。\n许多学生患有焦虑和抑郁，预计在大流行之后，与这些和其他问题作斗争的学生数量将大幅增加。在冠状病毒之前，我们主要通过同情地点头，并将学生引导到我们超额预订和人手不足的健康中心，在那里他们无法安排与我们为数不多的顾问之一的预约，以应对学生的心理健康挑战。从下学期开始，我们将加强这一政策，增加一根用我们大学创始人挖掘出的骨头制成的魔杖。接待员(目前暂时休假)会一边在学生头上挥舞魔杖，一边高呼：“创始人治愈了你，克服了它，克服了它。”\n正如我们虔诚地崇拜杀灭病毒的夏日好仙女一样，我们也害怕滋养病毒的冬日坏仙女。因此，我们将提前结束秋季学期，就在感恩节之前，并在3月中旬开始春季学期。为什么是这些日期？它们是随机的吗？我们是在努力避免学生可能旅行并可能带回传染病的假期，还是在努力安抚各种异教神灵？也许所有这些都是肯定的。\n我们的管理员正在做些什么来提供帮助？请放心，在我们度过这场危机之前，他们决心做出任何牺牲(除了让被裁员的教职员工受益的减薪以外)。我们的教务长撕碎了每一期新出版的“高等教育纪事”，并用这些碎片构建了非常精确的SARS-CoV-2病毒肖像，然后她一边哭泣，一边砸碎和焚烧这些肖像。我们的图书馆院长一直在使用她令人敬畏的研究技能来定位猴子的爪子、神奇的鱼和其他实现愿望的实体。我们的总统把他第一个出生的孩子锁在我们附近的湖边，作为对伟大而可怕的克拉肯的供品。\n今年秋天，我们迫不及待地欢迎我们的新生和返校学生来到校园。同时，请不要考虑这样的现实，虽然我们说我们的校园将是开放的和面对面的，但很可能许多课程仍将部分或全部在网上进行。看在伊斯塔尔的份上，请不要认为在这些教学上有问题和潜在危险的情况下，你的学生最好还是休学一年。不要让不好的想法进来，我们大学的未来实际上取决于只想好的想法！\n哦，当你到达校园时，一定要参观我们新的四叶三叶草花园，这里曾是表演艺术中心的所在地！\n每月只有1美元(一年12美元！)。对支持我们的编辑人员和投稿人，同时保持我们没有广告有很大的帮助。今天就成为麦克斯威尼的互联网趋势赞助人吧。", "note_en": "Since we first announced our plans to reopen this fall (a far too early decision given the lack of reliable data about the likely prevalence of  COVID-19 in the fall, but done out of necessity to beat the June 1st National College Decision Day deadline), many students, parents, faculty, and staff have asked us how we plan to ensure that we reopen safely. Our strategy is outlined below, but the short answer is this: Our university will proceed as if everything will be okay because we really, really want it to be.\n  After measuring classrooms and examining our antiquated ventilation systems, our staff (those who haven’t been furloughed) reports that there’s absolutely no way our already scheduled and enrolled classes can safely fit in those spaces. But our university has always valued creative problem-solving, so we have posted   signs on the doors of every campus building. Plus, to show how seriously we take the situation, the signs have been laminated.\n  All dormitories have been thoroughly cleaned and disinfected, and all residents will be given a single room. We ask that after students move in, they make frequent use of our hand sanitizer stations, get in and out of bed on the same side every day, and flick their light switches on and off exactly seven times when they enter or exit a room.\n When they arrive on campus, all students will receive a welcome package containing a face mask branded with our university logo, a rabbit’s foot, a horseshoe, an evil-eye charm, a Maneki-neko, a crucifix, and a bulb of garlic. We know some of that stuff is for vampires, but you can never be too careful.\n  We admit this one’s a toughie. How can we feed thousands of students while limiting the number of surfaces they touch and maintaining social distancing, all while they remove their face masks in order to, you know, eat?\n As our currently laid-off professor of Italian might say,  mangia al fresco! We’re thrilled to announce that all meals will be served outdoors as pre-packaged picnics. Yes, there is scientific disagreement on whether the virus is less likely to spread in warmer weather, and whether the benefits of open air are canceled out by large crowds. But our university has boldly decided to believe only the theories that we like: that is, being outside is fine, warm weather kills the virus, and if before each meal we hum David Bowie’s “Heroes” while hopping on our left feet, we can never get sick.\n  Many students suffer from anxiety and depression, and the numbers of students struggling with these and other issues are expected to increase dramatically in the wake of the pandemic. Before coronavirus, we primarily dealt with student mental health challenges by nodding sympathetically and directing students to our overbooked and understaffed Wellness Center, where they were unable to schedule an appointment with one of our few counselors. Starting next semester, we will enhance that policy with the addition of a magic wand made from the exhumed bones of our university’s founder. A receptionist (currently furloughed) will wave the wand over the student’s head while chanting, “The Founder cures thee, get over it, get over it.”\n  Just as we lovingly worship the virus-killing Good Fairy of Summer, so too we fear the virus-nurturing Bad Fairy of Winter. Accordingly, we will be ending our fall semester early, just before Thanksgiving, and beginning our spring semester in mid-March. Why these dates? Are they random? Are we trying to avoid holidays in which students might travel and possibly carry back contagion, or working to appease a variety of pagan gods? Probably yes to all of these.\n What are our administrators doing to help? Rest assured, they’re determined to make any sacrifice (short of salary reductions that would go to benefit faculty and staff whose positions have been cut) until we make it through this crisis. Our Provost shreds every new issue of  The Chronicle of Higher Education and uses the scraps to construct remarkably accurate effigies of the  SARS-CoV-2 virus, which she then smashes and burns while sobbing. Our Dean of Libraries has been using her formidable research skills to locate monkeys’ paws, magical fish, and other wish-granting entities. And our President has chained his first-born child on the shores of our nearby lake as an offering to the great and terrible Kraken.\n We can’t wait to welcome our new and returning students to campus this fall. In the meantime, please don’t consider the reality that while we say our campus will be open and in-person, it’s likely that many classes will still be conducted partly or wholly online. And for the love of Ishtar, please don’t consider that under these pedagogically questionable and potentially dangerous circumstances, your student might be better off taking a gap year. Don’t let the bad thoughts in; the future of our university literally depends on thinking only good thoughts!\n Oh, and when you arrive on campus, be sure to visit our new four-leaf clover garden, located where the Performing Arts Center used to be!\n    As little as $1 a month ($12 a year!) goes a long way towards supporting our editorial staff and contributors while keeping us ad-free. Become a McSweeney’s Internet Tendency patron today.", "posttime": "2020-06-29 04:47:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "思维,负责,university,学生", "title": "贵校负责魔法思维的副校长的口信", "title_en": "A Message from Your University’s Vice President for Magical Thinking", "transed": 1, "url": "https://www.mcsweeneys.net/articles/a-message-from-your-universitys-vice-president-for-magical-thinking", "via": "", "real_tags": ["思维", "负责", "学生"]}, {"category": "", "categoryclass": "", "imagename": "7a5c55eb9bc578e2b7166b8a85eef3af.jpg", "infoid": 1008776, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "主要的互联网服务提供商计划很快结束他们的隔离福利，再次将美国人置于数据上限之下，并在他们无法支付账单的情况下取消保护。\n联邦通信委员会的“保持美国人联系”承诺将于6月30日到期。公司最初同意了这一承诺，并争先恐后地增加福利。像CenturyLink，T-Mobile，Verizon和其他许多ISP表示，他们不会停止服务，也不会对那些因为冠状病毒而无法支付的人收取滞纳金。他们还同意免费开放Wi-Fi接入点。到目前为止，FCC尚未公开表示将延长承诺。\n在某些方面，互联网服务提供商面临着与佛罗里达州和德克萨斯州州长相同的决定：结束他们的福利，这鼓励用户呆在家里，或者在一段不确定的时间内继续享受这些福利。这可能是康卡斯特Xfinity用户和其他主要ISP无限制数据的最后一个周末，对于许多失业的人来说，ISP可能会从6月30日开始要求支付未付的宽带账单。\n通过流媒体安然度过隔离的消费者也可能会发现，他们的无限数据将于6月30日到期。当天，AT&amp；T、Comcast Xfinity、Mediacom和T-Mobile计划恢复正常服务，并再次实施数据上限。但一些ISP，如Cox，已经终止了一些福利，因为其临时的无限数据计划已于5月份到期。\n当被问及康卡斯特是否会延长其无限制数据报价时，康卡斯特发言人表示异议。“还没有什么要宣布的，”他通过电子邮件说。“我们会和你保持联系的。”\n编者按：下面的信息改编自我们之前的故事，“哪些互联网提供商在冠状病毒期间取消了数据上限，哪些没有。”\n美国电话电报公司(AT&amp；T)的所有消费者家庭互联网客户，以及固定无线互联网客户，都可以在6月30日之前无限使用数据。\n客户的手机套餐中暂时增加了每月自动10 GB的数据，尽管这一期限似乎已于6月24日到期。截至6月30日，参加无限制蜂窝计划的人的移动热点数据每月平均增加15 GB。部分舰艇上的海军人员也可以免费致电军事基地，时间也是到6月30日。\n美国电话电报公司(AT&amp；T)承诺，不会终止任何无法支付账单的客户的服务，并将免除与逾期付款相关的费用。(这里可以申请豁免。)6月30日到期的签证。该公司将继续为住宅或小企业无线客户免除国内后付费无线计划的数据、语音或文本超额费用。AT&amp；T还将保持其公共Wi-Fi热点对所有人开放，并自动将热点数据每条线路每月增加15 GB。\nAT&amp；T电视/DirectTV的新客户将免费享受一年的家庭影院。美国电话电报公司(AT&amp；T；)增加了一套“夏令营”内容，并为那些还没有免费频道的客户提供了一些免费频道。\nCenturyLink表示，在6月30日之前，它已承诺免除滞纳金，不会因为与新冠肺炎有关的财务状况而终止住宅或小企业客户的服务。在此期间，该公司还暂停了对消费者客户的数据使用限制。它致力于联邦通信委员会的“保持美国人联系承诺”(Keep American Connected Pledge)。\nConsolidation加入了“保持美国人联系承诺”(Keep American Connected Pledge)，尽管其支持页面没有列出到期日期。该公司表示，Consolidation已经没有数据上限。\n3月13日，康卡斯特表示，将暂停执行数据上限60天，基本上为所有客户提供了这段时间的无限数据。(康卡斯特通常每12个月给Xfinity客户两个月的“宽限”，允许他们超过数据上限而不会受到惩罚。)。\n康卡斯特每月9.95美元的Internet Essentials计划的新订户最初获得两个月的免费，网速提高到25 Mbps下降和3 Mbps上升。康卡斯特6月19日表示，Internet Essentials的“两个月免费”介绍性优惠将延长至今年剩余时间。\n康卡斯特还向所有人免费提供Xfinity WiFi服务，无论你是不是康卡斯特的订户。(这是Xfinity WiFi热点地图。)。康卡斯特承诺，如果客户无法支付账单，不会断开他们的电话，并免除了滞纳金。\n考克斯从3月16日开始在60天内消除了数据使用过剩。拥有500 GB或现有无限制计划的客户将获得积分。Cox Starter互联网计划的新用户将可以在没有年度合同的情况下注册，并获得50 Mbps的下载速度。\n考克斯此前表示，不会终止对任何住宅或小企业客户的服务，并将开放考克斯WiFi热点网络，以保持公众的连接。这一期限将延长至6月30日。\n考克斯提供免费的支持电话和其低成本互联网服务Connect2Compete的第一个月免费服务。(考克斯补充说，它将免费开放到7月15日。)。其Essential计划的客户将看到他们的速度从30 Mbps提高到50 Mbps，Starter、Streightup Internet和Connect2Compete软件包也将自动升级到50 Mbps的速度。\nCharge Communications的频谱服务没有数据上限，在6月30日之前不会终止对因冠状病毒大流行而无法付费的家庭或小企业用户的服务。Charge最初表示，如果该家庭有K-12学生或还没有Spectrum宽带订阅的大学生，它将提供60天的免费Spectrum宽带和Wi-Fi。(该报价被延长至6月30日。)。Charge还表示，将向公众开放Wi-Fi热点。\n查特现有的所有HBO订户，包括其Spectrum Silver和Gold视频包中的订户，都自动获得了免费访问HBO Max的权限。\nEarthLink正在参与保持美国人互联承诺，并承诺(截至2020年3月16日)在未来60天内，不会因为任何住宅或小企业客户因冠状病毒大流行造成的中断而无法支付账单而终止他们的服务，也不会向住宅或小企业客户收取因冠状病毒大流行相关的经济困难而可能招致的滞纳金。\n该公司表示，FronTier没有数据上限，这将持续到新冠肺炎大流行期间。它还计划增加运力。\n“谷歌Fi已经加入了”保持美国人联网承诺“(Keep American Connected Pledge)，该公司发言人表示，这位发言人没有透露其承诺将持续多长时间。自4月1日起，谷歌Fi暂时将其全速数据限制提高到每用户30 GB，包括灵活计划和无限计划。在达到30 GB的限制后，用户可以支付10美元/GB，以便在计费周期的剩余时间内恢复全速数据。\n谷歌还将其帐单宽限期延长至帐单日期之后的60天。谷歌表示，所有这些措施都将从6月24日起生效。\n新客户如果注册了Mediacom的Access Internet 60宽带服务，12个月的费用为19.99美元/月，而不是29.99美元/月。Mediacom的Connect2Compete服务将其速度从10 Mbps/1 Mbps提高到25 Mbps/3 Mbps，并在最初的60天内免费提供。该公司还免费向公众开放其Wi-Fi热点网络。该公司6月23日表示，该公司已暂停所有宽带服务级别的每月数据补贴。Mediacom表示，所有这些举措现在都将持续到8月份。\n该公司表示，从9月份的计费周期开始，一直持续到2020年底，Mediacom将免费向任何超过每月数据限额的宽带客户提供高达100 GB的额外数据。\nSparklight在3月13日表示，在30天内，它将在所有互联网计划上提供无限制的数据。Sparklight将无限数据延长到5月12日。\n3月16日，该公司表示，将在其办公停车场提供其热点，供公众免费使用，并增加了一项15 Mbps的互联网计划，在未来60天内每月收费10美元。4月28日，该公司表示，将把这一期限延长至6月30日，并承诺如果用户无法支付账单，不会断开连接。根据美国联邦通信委员会(Federal Communications Commission)的保持美国人互联承诺，滞纳金也被免除。\nSprint在3月13日表示，在接下来的60天内将其网络扩展到包括T-Mobile的网络。Sprint签署了保持美国人连接承诺，并承诺在未来60天内，如果客户因冠状病毒而无法付款，将免收费用，并且不会终止服务。拥有计量数据计划的客户在60天内可获得无限数据，在同一时期内可获得20 GB的热点数据。\n无线宽带ISP Starry为公共和经济适用房业主提供了免费的宽带项目Starry Connect，一直持续到5月份。正常情况下，该计划提供30 Mbps的对称速度，每月15美元。由于冠状病毒导致不付款，Starry同意暂停取消服务。它已经不收取额外费用或滞纳金。Starry的服务也不包括数据上限。\nTDS在3月16日表示，将为拥有K-12或大学生的客户家庭提供免费宽带接入。(需要证明。)。TDS还免费向公众开放Wi-Fi热点。除此之外，TDS只有在6月30日之前同意不切断无法支付账单的客户，才会遵守FCC的“保持美国人联系”的承诺。\n到6月30日，所有现有的T-Mobile数据套餐都将获得免费的无限量数据，不包括漫游。到6月30日，T-Mobile和T-Mobile的Metro客户还将获得额外的20 GB移动热点和系留服务。在接下来的两个月里，生命线客户每月将获得额外的5 GB数据。\nT-Mobile补充说：“我们没有提供60天免费服务的优惠，并鼓励消费者对可能包含欺诈性号码的社交媒体帖子保持谨慎。”该公司还发布了帮助保护客户免受诈骗者侵害的资源。\nT-Mobile将其对联邦通信委员会承诺的期限延长至6月30日，继续为受新冠肺炎疫情影响的后付费无线、住宅和小企业客户提供支持。\n威瑞森在3月13日表示，如果受到全球危机的负面影响，将免除滞纳金，并保持住宅和小企业客户的联系。威瑞森现在在一个新的合并后的新冠肺炎回复页面上表示，其豁免计划将持续到6月30日。\nVerizon将其面向Title 1中学的Verizon创新学习计划的数据计划从10 GB/月升级为30 GB/月，为期两个月，从3月16日起生效。一名公司代表表示，Verizon家庭互联网用户没有数据上限。\n3月23日，Verizon更新了冠状病毒救援计划，指出将免除超时费、升级费和激活费。Verizon还承诺不会终止服务，并免除滞纳金。Verizon还在消费者和小企业计划中免费增加15 GB的4G LTE数据，并在一些国家增加了一些免费的海外通话。Verizon免除了其生命线计划接下来两个月的账单周期。4月3日，Verizon将推出一项新的宽带折扣计划；客户可以在其Mix&amp；Match计划中选择任何Verizon Fios速度，每月可获得20美元的折扣。\nWindstream尚未宣布为受冠状病毒影响的客户提供任何救济。但是，该服务不实现数据上限。\n这篇报道于6月26日下午12：21更新，并补充了Mediacom的详细信息。\n注：当您在点击我们文章中的链接后购买商品时，我们可能会赚取少量佣金。有关更多详细信息，请阅读我们的代销商链接政策。", "note_en": "Major Internet service providers are scheduled to end their quarantine benefits soon, once again subjecting Americans to data caps and removing protections if they are unable to pay their bills.\n The  FCC’s Keep Americans Connected Pledge is set to expire on June 30. Companies initially  agreed to the pledge and rushed to add benefits. ISPs like CenturyLink, T-Mobile, Verizon, and many others said they would not discontinue service or charge late fees for those unable to pay because of the coronavirus. They also agreed to open their Wi-Fi access points for free. So far, the FCC has not publicly said that it would extend the pledge.\n In some ways, ISPs face the same decision as governors in Florida and Texas: end their benefits, which encouraged users to stay home, or continue them for an indeterminate period of time. This could be the last weekend of unlimited data for Comcast Xfinity subscribers and other major ISPs. For many of those who are out of work, ISPs could begin demanding payment for outstanding broadband bills on June 30.\n  Consumers who have been riding out the quarantine by streaming may also find that their unlimited data expires June 30. On that day AT&amp;T, Comcast Xfinity, Mediacom, and T-Mobile are scheduled to resume normal service, and once again impose data caps. Some ISPs, like Cox, have already terminated some benefits, as its temporary unlimited data program expired in May.\n When asked whether Comcast would extend its unlimited data offer, a Comcast spokesman demurred. “Nothing to announce yet,” he said via email. “We’ll keep you posted.”\n Editor’s Note: The information below has been adapted from our earlier story, “ Which Internet providers are lifting data caps during the coronavirus, and which aren’t.”\n  All AT&amp;T consumer home Internet customers, as well as Fixed Wireless Internet, can  use unlimited data through June 30.\n An automatic 10GB of data per month was  temporarily added to customers’ capped phone plans, though that appears to have expired on June 24. Mobile hotspot data was  increased by 15GB per month for those on unlimited cellular plans, through June 30. Navy personnel on select ships may make free calls to military bases, also through June 30.\n  AT&amp;T  pledged not to terminate the service of any customer who can’t pay their bill, and will waive the fees associated with late payments. (Waivers can be applied for  here.)  That expires on June 30. The company will continue to waive domestic postpaid wireless plan overage charges for data, voice or text for residential or small business wireless customers. AT&amp;T will also keep its public Wi-Fi hotspots open to everyone, and has automatically increased hotspot data by 15GB per month per line.\n New AT&amp;T TV/DirectTV customers will receive a free year of HBO. An AT&amp;T “Summer Camp” collection of content  has been added, along with a number of free channels to those customers who didn’t already have them.\n  Until June 30,  CenturyLink said it has committed to waive late fees and to not terminate a residential or small business customer’s service due to financial circumstances associated with COVID-19. The company is also suspending data usage limits for consumer customers during this time period. It committed to the FCC’s Keeping Americans Connected Pledge.\n  Consolidated joined the Keep Americans Connected Pledge, although its  support page doesn’t list an expiration date. Consolidated already does not have data caps, the company said.\n   On March 13,  Comcast said it would pause enforcement of its data caps for 60 days, essentially giving all of its customers unlimited data for that period. (Comcast normally gives its Xfinity customers two “grace” months for every 12, allowing them to exceed their data cap without penalty.)\n New subscribers to Comcast’s $9.95/month Internet Essentials plan initially received two months free, and speeds were increased to 25Mbps down and 3Mbps up. Comcast  said on June 19 that the “two months free” introductory offer for Internet Essentials will be extended through the rest of the year.\n Comcast is also making its Xfinity WiFi service free for everyone, regardless of whether you’re a Comcast subscriber. (Here’s a  map of Xfinity WiFi hotspots.) Comcast pledged not to to disconnect a customer if they can’t pay their bill, and has waived late fees.\n  Cox  eliminated data usage overages starting March 16 for 60 days. Customers with a 500GB or existing Unlimited plan will receive credits. New subscribers to the Cox Starter Internet plan will be able to sign up without an annual contract and receive 50Mbps download speeds.\n Cox previously said that it would not terminate service for any residential or small business customers, and would open its Cox WiFi hotspot network to keep the public connected. That will be extended  through June 30.\n Cox is offering free support calls and the first month free to its low-cost Internet service, Connect2Compete. (It will be free through July 15,  Cox added.) Customers on its Essential plan will see their speeds increased from 30Mbps to 50Mbps, and Starter, StraightUp Internet and Connect2Compete packages will be automatically upgraded to speeds of 50 Mbps as well.\n  Charter Communications’ Spectrum services do not have data caps, and will not terminate service for home or small business users who can’t pay because of the coronavirus pandemic, through June 30.  Charter initially said it would offer free Spectrum broadband and Wi-Fi for 60 days if that household has K-12 students or college students who do not already have a Spectrum broadband subscription. (That  offer was extended until June 30.) Charter also said it will open its Wi-Fi hotspots for public use.\n All of Charter’s existing HBO subscribers, including subscribers in its Spectrum Silver and Gold video packages, have automatically been given access to HBO Max for no additional charge.\n  Earthlink is participating in the Keep Americans Connected Pledge, and  pledged (as of March 16, 2020) for the next 60 days not to terminate the service of any residential or small business customer because of their inability to pay their bill due to disruptions caused by the coronavirus pandemic, as well as not to charge late payment fees a residential or small business customer may incur because of economic hardship related to the coronavirus pandemic.\n   Frontier does not have data caps, and this will continue through the COVID-19 pandemic, the company  said. It also plans to increase its capacity.\n  “Google Fi has joined the  Keep Americans Connected Pledge,” according to a company spokesman, who has not said how long its pledge will be effective. Google Fi  temporarily increased its limits for full-speed data to 30GB per user, for both Flexible and Unlimited Plans, as of April 1. After the 30GB limit is reached, a user can pay $10/GB to return to full-speed data for the remainder of the billing cycle.\n Google is also extending its billing grace period to 60 days beyond the billing date.  All of these measures are effective as of June 24,  Google said.\n  New customers who sign up for Mediacom’s Access Internet 60 broadband service can do so for $19.99/mo for 12 months, rather than $29.99/mo. Mediacom’s Connect2Compete service raised its speeds from 10Mbps down/1Mbps up to 25Mbps down/3Mbps up, and made it free for the first 60 days. It also made its Wi-Fi hotspot network publicly accessible, for free. Mediacom has paused monthly data allowances across all broadband service tiers, the company said on June 23. All of these initiatives now extend through August, Mediacom said.\n Beginning with the September billing cycle and continuing through the end of 2020, Mediacom will provide up to 100 gigabytes of additional data to any broadband customer that exceeds their monthly data allowance for free, the company said.\n  Sparklight  said on March 13 that it would make unlimited data available on all Internet plans for 30 days. Sparklight extended unlimited data through May 12.\n On March 16, the company  said it would make its hotspots, accessible in its office parking lots, available for free public use, and added a  a 15Mbps internet plan for $10 per month for the next 60 days. On April 28, the company  said that it would extend this through June 30,  and it pledged not to disconnect users if they can’t pay their bills. Late fees are also waived, as per the  Federal Communications Commission’s Keep Americans Connected Pledge.\n   Sprint said on March 13 that it extended its network to include T-Mobile’s network for the next 60 days. Sprint signed the Keep Americans Connected Pledge and committed to waiving fees and not terminating services if customers were unable to pay because of the coronavirus for the next 60 days. Customers with metered data plans received unlimited data for 60 days and 20GB of hotspot data for the same period.\n   Wireless broadband ISP Starry made Starry Connect, a broadband program for public and affordable housing owners,  free through May. Normally, the program, which provides 30Mbps symmetrical speeds, is $15 per month. Starry agreed to suspend cancellation of service due to nonpayment due to the coronavirus. It already does not charge additional fees or late fees. Starry’s service does not include data caps, either.\n  TDS  said on March 16 that it would provide free broadband access to customer households with K-12 or college students. (Proof will be required.) TDS also its Wi-Fi hotspots to the public, for free. Other than that, TDS is adhering to the FCC’s “Keep Americans Connected” pledge only by agreeing not to disconnect customers who can’t pay their bills  through June 30.\n  All current T-Mobile plans with data have been granted free unlimited data through June 30, excluding roaming. T-Mobile and Metro by T-Mobile customers will be given an additional 20GB of mobile hotspot and tethering services through June 30 as well. Lifeline customers will be given an extra 5GB of data per month for the next two months.\n “We do not have an offer available for 60 days of free service and encourage consumers to be cautious of social media posts that may include fraudulent numbers,” T-Mobile  added. The company has also  posted resources to help protect customers from scammers.\n T-Mobile extended its commitment to the  FCC pledge through June 30, continuing to offer support for postpaid wireless, residential and small business customers impacted by the COVID-19 pandemic.\n  Verizon will waive late fees and keep residential and small business customers connected if negatively impacted by the global crisis, the company said on March 13. Verizon now  says on a new, consolidated COVID-19 response page that that its waiver plan will run until June 30,  it added.\n Verizon upgraded the data plan on its Verizon Innovative Learning program for Title 1 middle schools from 10GB/month to 30GB/month for two months, effective March 16. There are no data caps on Verizon home Internet subscribers, a company representative said.\n On March 23, Verizon  updated its coronavirus relief plans, noting that it will waive overage charges, upgrade fees and activation fees. Verizon has also pledged to not terminate service and waive late fees. Verizon is also adding 15GB of 4G LTE data to consumer and small business plans for free, and adding some free overseas calls to  some countries. Verizon waiveed the next two months of billing cycles on its Lifeline plan. On April 3, Verizon will launch a new broadband discount program; customers may select any Verizon Fios speed in its Mix &amp; Match plans and receive a $20 discount per month.\n  Windstream has not  announced any relief for customers affected by the coronavirus. The service does not implement data caps, however.\n This story was updated on June 26 on 12:21 PM with additional details from Mediacom.\n  Note: When you purchase something after clicking links in our articles, we may earn a small commission. Read our  affiliate link policy for more details.", "posttime": "2020-06-29 04:28:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "mobile,caps,客户", "title": "AT&T、Comcast、T-Mobile的数据上限将于6月30日返还", "title_en": "Data caps on AT&T, Comcast, T-Mobile will return June 30", "transed": 1, "url": "https://www.pcworld.com/article/3564590/data-caps-on-att-comcast-t-mobile-will-return-june-30.html", "via": "", "real_tags": ["mobile", "caps", "客户"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1008775, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "你会认为，如果你发现了第一个证据，证明在我们太阳系最遥远的地方潜伏着一颗比地球大的行星，那将是一个重要的时刻。这将使你成为历史上发现这样一件事的极少数人之一。\n但对于华盛顿特区卡内基科学研究所的天文学家斯科特·谢泼德来说，这是一件安静得多的事情。“这不像是有了尤里卡时刻，”他说。“证据只是慢慢积累起来的。”\n他是个轻描淡写的高手。自从他和他的合作者北亚利桑那大学的查德·特鲁希略在2014年首次发表了他们对这颗看不见的星球的怀疑以来，证据一直在不断增加。然而，当被问及他有多确信他称之为行星X(尽管许多其他天文学家称之为行星9)的新世界真的存在时，谢泼德只会说：“我认为它更有可能不存在。”\n至于天文学界的其他人，在大多数地区，人们对发现这个世界有着明显的兴奋之情。这种兴奋在很大程度上集中在一台以天文学家维拉·C·鲁宾(Vera C Rubin)的名字命名的巨型新巡天望远镜的启用上。鲁宾在20世纪70年代发现了暗物质的一些最早证据。\n按计划，鲁宾天文台将于2022年开始对天空进行全面调查，它可能会直接发现这颗行星，或者提供确凿的间接证据证明它就在那里。\n这颗行星的发现将是一场胜利，但对现有的关于太阳系是如何形成的理论来说，也是一场灾难。\n“这将改变我们认为我们所知道的关于行星形成的一切，”谢泼德在另一个特征上轻描淡写地说。事实上，没有人知道这么大的行星是如何在离太阳这么远的地方形成的。\n遥远的太阳系是一个黑暗而神秘的地方。它包含一个巨大的空间，从海王星的轨道开始，距离太阳的距离是地球的大约30倍，或者说30个天文单位(AU)，一直延伸到大约10万AU。这几乎是太阳到下一个最近恒星距离的三分之一。\n1930年，美国天文学家克莱德·汤博(Clyde Tombaugh)就是在这一卷的内部区域发现了冥王星。虽然冥王星的直径只有我们月球的三分之二，但它最初被归类为行星。\n然而，到了本世纪末，望远镜变得更大了，天文学家开始在海王星之外发现更多微小的世界。它们都比冥王星还小，直到2005年，加州理工学院的迈克·布朗发现了厄里斯。它至少和冥王星一样大，而且可能更大，所以，如果冥王星是一颗行星，厄里斯也是。美国宇航局匆忙组织新闻发布会，宣布发现行星10。\n大约一年后，国际天文联合会裁定冥王星和厄里斯实际上太小，不能被称为行星，并将它们重新命名为矮行星。因此，太阳系的点名名单又回到了八个：水星、金星、地球、火星、木星、土星、天王星、海王星。一个寻找遥远太阳系物体的家庭手工业真正开始了。\n通往行星9的旅程始于2012年的一个晚上，当时谢泼德和特鲁希略正在使用位于智利的塞罗托洛罗美洲天文台的望远镜。他们发现越来越远的物体，但有一个特别突出。编目为2012 VP113，他们以当时的美国副总统的名字给它起了个绰号拜登(因为目录名称中的字母VP)。令他们惊讶的是，这个遥远的世界从未比80AU更接近太阳。在最远的时候，拜登将达到440AU进入深空，这意味着它遵循的是一个高度椭圆形的轨道。但这还不是它最引人注目的地方。\n由于某种奇怪的巧合，它的轨道似乎与另一个被称为塞德纳(Sedna)的遥远星球的轨道非常相似。这个迷你世界是由耶鲁大学的布朗、特鲁希略和大卫·拉比诺维茨在2003年发现的。它立即脱颖而出，因为它的轨道高度椭圆形，从76AU摆动到937AU。\n“像Sedna和2012VP113这样的天体不可能在这些偏心轨道上形成，”谢泼德说。相反，计算机模拟表明，它们形成得更近，然后被与较大行星的引力相互作用抛出。然而，真正奇怪的是，这两个拉长的轨道指向大致相同的方向。\n谢泼德和特鲁希略对捕获的其他物体检查得越多，他们就越能看到这些轨道也是对齐的。就好像有什么东西围住了那些微小的世界，就像一只牧羊犬在操纵它的羊群。他们唯一能想到的就是一颗大得多的行星。\n好奇激起了他们的好奇心，他们做了一些计算，发现他们的结果暗示的行星必须比地球大2到15倍，其轨道距离太阳平均在250AU到1500AU之间。他们的研究结果于2014年3月发表在享有盛誉的“自然”杂志上，人们对行星9的兴趣开始席卷天文学世界。\n下一次重大飞跃发生在2015年，当时谢泼德和特鲁希略等科学家发现了2015年的TG387。他们给这个人起了个绰号叫“妖精”。它是仅次于塞德纳和拜登的第三个最极端的天体，它也排成一排，进一步减少了这种排列是随机巧合的想法。\n2016年，布朗和他的合作者康斯坦丁·巴蒂金(Konstantin Batygin)发表了他们自己对这些数据的分析。巴蒂金也来自加州理工大学。他们在行星的大小和距离上与谢泼德和特鲁希略意见一致，甚至提出了一个他们认为可能找到它的天空区域。\n宾夕法尼亚大学的博士生佩德罗·H·贝尔纳迪内利(Pedro H Bernardinelli)意识到，谢泼德的数据并不是人们可以寻找遥远世界的唯一地方。因此，他求助于一项宇宙学调查的一些初始数据，该调查旨在通过观察遥远的星系来测量宇宙正在膨胀的方式。他搜索数据，寻找相当于光弹的天体，寻找恰好挡住相机的遥远太阳系物体。他找到了七个。\n乍一看，这些世界似乎也像预期的那样排列在一起，但贝尔纳迪内利对数据的分析越严格，他感觉到的排列就越弱。“我们不认为我们在我们的数据中看到了信号，”贝尔纳迪内利说，尽管他承认他还不能确定排除这颗行星的可能性，而且还没有对全部调查数据进行分析。“下次我们这样做时，我们的答案可能会改变，”他说。\n这些天来，在夏威夷莫纳克亚，人们经常可以用日本的斯巴鲁望远镜找到谢泼德，他耐心地在天空中搜寻更多关于行星9的证据，甚至可能希望他能看到这颗行星本身。这项任务的规模是巨大的。这真的是大海捞针。这颗行星--如果它真的在那里的话--非常昏暗，天空非常广阔。但鲁宾天文台的形式正在提供帮助。\n鲁宾是一个会吞噬天空的怪物。虽然大多数望远镜需要几个月或几年的时间才能观测到整个天空，但鲁宾只需三个晚上就能完成这一任务。然后一遍又一遍地做，看看有什么变化，这样就能捕捉到移动的物体。\n建造工作即将完成，该望远镜将于今年晚些时候首次打开它的巨眼。然后，调试和调整还需要几年时间。\n“这项调查将改变我们所知的太阳系科学，”谢泼德说。如果9号行星还在外面，鲁宾应该能看到它。\n“我们可以探测到大约1000AU的地球质量的行星，”贝尔法斯特女王大学的梅格·施瓦布(Meg Schwamb)说，他是鲁宾天文台太阳系科学合作项目的联合主席。这让谢泼德的世界轻而易举地进入了它的视线。“如果其他人在我们的调查开始之前没有看到过行星9，那么我想，所有人的目光都集中在鲁宾天文台上了，”施瓦姆说。\n即使望远镜无法直接看到这颗行星，它也会探测到更远的迷你世界，这些世界都可以用来更精确地对行星的位置进行三角测量，从而有助于缩小搜索区域。如果9号行星真的存在，那么后果将是巨大的。\n天文学家认为太阳系是由围绕太阳的物质盘形成的。该物质凝聚成较小的天体，然后相互碰撞形成较大的天体。在这个过程的最后，行星诞生了。但这个圆盘中的物质在离太阳更远的地方变薄了，这意味着没有足够的原材料在遥远的太阳系形成一颗大行星。\n为了挽救标准理论，一些人认为，行星9曾经注定要成为像木星或土星一样的气体巨星，因此正在与它们一起形成。然而，引力的相互作用阻碍了它的生长，把它扔到了黑暗中。\n但达勒姆大学的雅各布·肖尔茨对此表示怀疑。“这是可能的，”他说，“但实际上需要相当多的巧合。”这是因为单一的引力相互作用不能完成这项工作。取而代之的是，需要一系列的相互作用才能把它放在永远不会回到它形成的地方的轨道上。\n肖尔茨有一个更具异国情调的想法。他与芝加哥伊利诺伊大学的合作者詹姆斯·昂温(James Unwin)一起提出，包围这些遥远世界的物体不是一个失踪已久的行星，而是一个黑洞。\n如果是这样的话，即使是鲁宾也看不到它，因为黑洞根本不发光-它们只是吞噬光线和任何碰巧穿过它们路径的东西。这是一种诱人的可能性，因为肖尔茨的黑洞必须是长期怀疑但从未证实的黑洞群体的一部分，这些黑洞是在宇宙形成后不久形成的。\n但就目前而言，大多数其他天文学家似乎不满足于这样的想法，即黑暗中有一颗大行星，正等待着在接下来的几年里出现在人们的视线中。\n如果9号行星真的在那里，那么也许谢泼德第一次通过望远镜看到它时，他将最终体验到类似于尤里卡时刻的东西。", "note_en": "You’d think that if you found the first evidence that a planet larger than the Earth was lurking unseen in the furthest reaches of our solar system, it would be a big moment. It would make you one of only a small handful of people in all of history to have discovered such a thing.\n But for astronomer Scott Sheppard of the Carnegie Institution for Science in Washington DC, it was a much quieter affair. “It wasn’t like there was a eureka moment,” he says. “The evidence just built up slowly.”\n He’s a master of understatement. Ever since he and his collaborator Chad Trujillo of Northern Arizona University, first published their suspicions about the unseen planet in 2014, the evidence has only continued to grow. Yet when asked how convinced he is that the new world, which he calls Planet X (though many other astronomers call it Planet 9), is really out there, Sheppard will only say: “I think it’s more likely than unlikely to exist.”\n As for the rest of the astronomical community, in most quarters there is a palpable excitement about finding this world. Much of this excitement centres on the opening of a giant new survey telescope named after Vera C Rubin, the astronomer who, in the 1970s, discovered some of the first evidence for dark matter.\n Scheduled to begin its full survey of the sky in 2022, the Rubin observatory could find the planet outright or provide the clinching circumstantial evidence that it’s there.\n Discovery of the planet would be a triumph, but also a disaster for existing theory about how the solar system was created.\n “It would change everything we thought we knew about planet formation,” says Sheppard, in another characteristic understatement. In truth, no one has a clue how such a large planet could form that far from the sun.\n The distant solar system is a place of darkness and mystery. It encompasses an enormous volume of space that begins at the orbit of Neptune, some 30 times further from the sun than Earth, or 30 astronomical units (AU)the , and extends to about 100,000AU. That’s almost one-third of the distance from the sun to the next nearest star.\n  It was in the inner regions of this volume that American astronomer Clyde Tombaugh discovered Pluto in 1930. Although  Pluto possessed just two-thirds of the diameter of our moon, it was originally classed as a planet.\n  By the end of the century, however, telescopes were bigger and astronomers were beginning to find more tiny worlds beyond Neptune. They were all even smaller than Pluto until 2005, when Mike Brown from the California Institute of Technology discovered Eris. It was at least the same size as Pluto and probably bigger, so, if Pluto was a planet, so was Eris. Nasa hastily organised a press conference and announced the discovery of Planet 10.\n About a year later, the International Astronomical Union ruled that Pluto and Eris were effectively too small to be called planets and renamed them dwarf planets. So the solar system’s roll-call returned to eight: Mercury, Venus, Earth, Mars, Jupiter, Saturn, Uranus, Neptune. And a cottage industry of finding distant solar system objects really got going.\n The path towards Planet 9 began one night in 2012, when Sheppard and Trujillo were using the Cerro Tololo Inter-American Observatory’s telescope in Chile. They were finding more and more distant objects, but one in particular stood out. Catalogued as 2012 VP113, they nicknamed it Biden after the US vice-president at the time (because of the letters VP in the catalogue designation). To their amazement, this far-flung world never came closer to the sun than about 80AU. At its furthest, Biden would reach 440AU into deep space, meaning that it followed a highly elliptical orbit. But that wasn’t the most remarkable thing about it.\n By some weird coincidence, its orbit appeared to be very similar to that of another distant world known as Sedna. This mini-world had been discovered in 2003 by Brown, Trujillo and David Rabinowitz of Yale University. It immediately stood out because of its highly elliptical orbit, which swings from 76AU to 937AU.\n “Objects like Sedna and 2012 VP113 can’t form on these eccentric orbits,” says Sheppard. Instead, computer simulations suggest that they form much closer and are then ejected by gravitational interactions with the larger planets. The truly odd thing, however, was that the two elongated orbits pointed in roughly the same direction.\n And the more Sheppard and Trujillo examined the other objects in their catch, the more they saw that those orbits were aligned, too. It was as if something was corralling those tiny worlds, like a sheepdog manoeuvring its flock. And the only thing they could think of that was capable of doing that was a much larger planet.\n  Curiosity piqued, they did some calculations and discovered that the planet their results were hinting at had to be somewhere between two and 15 times more massive than Earth, on an orbit that lies on average somewhere between 250AU and 1500AU from the sun. Their results were published by the prestigious journal   Nature  in March 2014 and interest in Planet 9 began to sweep the astronomical world.\n The next big leap came in 2015 when Sheppard and Trujillo were among the scientists who discovered 2015 TG387. They nicknamed this one the Goblin. It’s the third most extreme object behind Sedna and Biden and it, too, lines up, reducing still further the idea that this alignment is a random coincidence.\n In 2016, Brown and his collaborator Konstantin Batygin, also of Caltech, published their own analysis of the data. Agreeing with Sheppard and Trujillo about the size and distance of the planet, they even suggested an area of sky where they thought it might be found.\n   Pedro H Bernardinelli, a PhD candidate at the University of Pennsylvania, realised that Sheppard’s data wasn’t the only place one could look for distant worldlets. So he turned to some initial data from a cosmological survey that was designed to measure the way in which the universe is expanding by looking at far-away galaxies. He searched the data for the celestial equivalent of a photobomb, looking for distant solar system objects that just happened to get in the way of the camera. He found seven.\n At first sight, it looked as if these worldlets were also aligned as expected, but the more rigorously Bernardinelli analysed the data, the weaker he felt the alignment became. “We don’t think we see the signal in our data,” says Bernardinelli, although he admits the he can’t yet definitely rule out the planet and has yet to run the analysis on the full survey data. “Our answer might change the next time we do this,” he says.\n These days, Sheppard can regularly be found using Japan’s Subaru telescope on Mauna Kea, Hawaii, patiently scouring the sky for more evidence of Planet 9, maybe even hoping that he sees the planet itself. The scale of the task is enormous. It really is like looking for the proverbial needle in a haystack. The planet – if it is even there – is very faint and the sky is very large. But help is on its way in the form of the  Rubin  observatory.\n Rubin is a monster that will devour the sky. Whereas most telescopes would take months or years to survey the whole sky, Rubin will do it in just three nights. Then do it again and again and again to see what’s changed and so catch the moving objects.\n Construction is nearing completion, and the telescope is set to open its giant eye for the first time later this year. Commissioning and tweaking will then take another couple of years.\n  “That survey is going to change solar system science as we know it,” says Sheppard. And if Planet 9 is out there, Rubin should see it.\n “We can detect an Earth-mass planet at around 1000 AU,” says Meg Schwamb, of Queen’s University Belfast, who co-chairs the Rubin observatory’s solar system science collaboration. That puts Sheppard’s world easily within its sights. “If others haven’t seen Planet 9 before our survey starts then, I think, all eyes are on the Rubin observatory,” says Schwamb.\n Even if the telescope fails to see the planet directly, it will detect many more distant mini-worlds that can all be use to triangulate the planet’s position more precisely, thus helping to narrow the search area. And if Planet 9 really is out there, then the consequences will be huge.\n Astronomers think that the solar system formed in a disc of matter surrounding the sun. That matter condensed into smaller bodies, which then collided to form larger ones. At the end of this process, the planets were born. But the matter in this disc thins out further from the sun, meaning there is not enough raw material to form a large planet in the distant solar system.\n To rescue the standard theory, some suggest that Planet 9 was once destined to become a gas giant like Jupiter or Saturn and so was forming alongside them. However, a gravitational interaction stunted its growth by hurling it out into the dark.\n But Jakub Scholtz of Durham University is sceptical. “It’s possible,” he says, “but it actually requires quite a lot of coincidences.” That’s because a single gravitational interaction can’t do the job. Instead, a series of interactions is needed to place it in an orbit that never brings it back to where it formed.\n  Scholtz has a more exotic idea. Together with collaborator James Unwin, of the University of Illinois at Chicago, he has suggested that the object corralling these distant worldlets is not a long-lost planet but a black hole.\n If so, not even Rubin will be able to see it, because black holes emit no light whatsoever – they simply swallow light and anything else that happens to cross their path. It is a tantalising possibility because Scholtz’s black hole would have to be part of a long-suspected but never-proved population of black holes that were formed shortly after the formation of the universe.\n But for the time being, most other astronomers seem more than content with the idea that there’s a large planet out there in the darkness, just waiting to come into view in the next few years.\n And if Planet 9 really is there, then perhaps the first time Sheppard sees it through a telescope, he will finally experience something akin to a eureka moment.", "posttime": "2020-06-29 04:26:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "寻找,hunt,行星", "title": "冥王星之外：寻找太阳系新的第九颗行星", "title_en": "Beyond Pluto: the hunt for our solar system's new ninth planet", "transed": 1, "url": "https://www.theguardian.com/science/2020/jun/28/beyond-pluto-the-hunt-for-our-solar-system-new-ninth-planet", "via": "", "real_tags": ["寻找", "hunt", "行星"]}]