[{"category": "", "categoryclass": "", "imagename": "82e7d14e4ed587e3d37df4b52e4ca4a4.png", "infoid": 1071609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "另一个重要问题是儿童性虐待材料 (CSAM) 在线传播。 CSAM 是指描述涉及儿童的色情活动的内容。为了帮助解决这个问题，iOS 和 iPadOS * 中的新技术将允许 Apple 检测存储在 iCloud 照片中的已知 CSAM 图像。这将使 Apple 能够向国家失踪和受虐儿童中心 (NCMEC) 报告这些情况。 NCMEC 是 CSAM 的综合报告中心，并与美国各地的执法机构合作。 Apple 检测已知 CSAM 的方法在设计时考虑了用户隐私。该系统不是在云中扫描图像，而是使用 NCMEC 和其他儿童安全组织提供的已知 CSAM 图像哈希数据库执行设备上匹配。 Apple 进一步将此数据库转换为一组不可读的哈希值，并安全地存储在用户的设备上。在将图像存储在 iCloud 照片中之前，会根据已知的 CSAM 哈希值对该图像执行设备上的匹配过程。此匹配过程由称为私有集交集的加密技术提供支持，该技术可在不透露结果的情况下确定是否存在匹配。该设备创建一个加密安全凭证，对匹配结果以及有关图像的附加加密数据进行编码。此优惠券与图像一起上传到 iCloud 照片。该系统使用另一种称为阈值秘密共享的技术，确保除非 iCloud 照片帐户超过已知 CSAM 内容的阈值，否则 Apple 无法解释安全凭证的内容。该阈值旨在提供极高的准确性，并确保每年错误标记给定帐户的几率低于万亿分之一。只有当超过阈值时，加密技术才允许 Apple 解释与匹配 CSAM 图像相关联的安全凭证的内容。然后，Apple 手动审查每份报告以确认是否存在匹配项，禁用用户帐户，并向 NCMEC 发送报告。如果用户认为他们的帐户被错误标记，他们可以提出上诉以恢复其帐户。这项创新的新技术使 Apple 能够向 NCMEC 和执法部门提供有关已知 CSAM 扩散的有价值且可操作的信息。这样做的同时还提供了比现有技术显着的隐私优势，因为 Apple 只有在用户的 iCloud 照片帐户中有一组已知的 CSAM 时才会了解用户的照片。即使在这些情况下，Apple 也只会了解与已知 CSAM 匹配的图像。", "note_en": "Another important concern is the spread of Child Sexual Abuse Material (CSAM) online. CSAM refers to content that depicts sexually explicit activities involving a child.\n  To help address this, new technology in iOS and iPadOS  * will allow Apple to detect known CSAM images stored in iCloud Photos. This will enable Apple to report these instances to the National Center for Missing and Exploited Children (NCMEC). NCMEC acts as a comprehensive reporting center for CSAM and works in collaboration with law enforcement agencies across the United States.\n  Apple’s method of detecting known CSAM is designed with user privacy in mind. Instead of scanning images in the cloud, the system performs on-device matching using a database of known CSAM image hashes provided by NCMEC and other child safety organizations. Apple further transforms this database into an unreadable set of hashes that is securely stored on users’ devices.\n  Before an image is stored in iCloud Photos, an on-device matching process is performed for that image against the known CSAM hashes. This matching process is powered by a cryptographic technology called private set intersection, which determines if there is a match without revealing the result. The device creates a cryptographic safety voucher that encodes the match result along with additional encrypted data about the image. This voucher is uploaded to iCloud Photos along with the image.\n  Using another technology called threshold secret sharing, the system ensures the contents of the safety vouchers cannot be interpreted by Apple unless the iCloud Photos account crosses a threshold of known CSAM content. The threshold is set to provide an extremely high level of accuracy and ensures less than a one in one trillion chance per year of incorrectly flagging a given account.\n  Only when the threshold is exceeded does the cryptographic technology allow Apple to interpret the contents of the safety vouchers associated with the matching CSAM images. Apple then manually reviews each report to confirm there is a match, disables the user’s account, and sends a report to NCMEC. If a user feels their account has been mistakenly flagged they can file an appeal to have their account reinstated.\n  This innovative new technology allows Apple to provide valuable and actionable information to NCMEC and law enforcement regarding the proliferation of known CSAM. And it does so while providing significant privacy benefits over existing techniques since Apple only learns about users’ photos if they have a collection of known CSAM in their iCloud Photos account. Even in these cases, Apple only learns about images that match known CSAM.", "posttime": "2021-08-06 03:44:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "儿童,protections,csam", "title": "扩大对儿童的保护", "title_en": "Expanded Protections for Children", "transed": 1, "url": "https://www.apple.com/child-safety/", "via": "", "real_tags": ["儿童", "csam"]}, {"category": "", "categoryclass": "", "imagename": "9fbba133cad7aa0b9c6b733b01238074.jpg", "infoid": 1071608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，苹果计划在美国 iPhone 上安装软件来扫描虐待儿童的图像，为数百万人监控个人设备打开大门。这在安全研究人员中敲响了警钟，他们警告说存在。据两名在虚拟会议上听取简报的安全研究人员称，苹果公司向一些美国学者详细介绍了本周早些时候提出的系统（称为“神经匹配”）。他们表示，该计划可能会在本周内更广泛地公布。如果确定检测到非法图像，自动化系统会提前警告一组人工审核人员。如果材料可用，审查员将联系执法部门。该计划最初将仅在美国部署。该提案介于保护客户隐私的独特承诺和政府、执法机构和儿童安全活动家的持续要求之间，以进一步支持恐怖主义和儿童色情等刑事调查。苹果试图找到妥协。执法机构与 Apple 和 Facebook 等高科技公司之间的紧张关系为产品和服务中越来越多地使用加密辩护，导致 iPhone 制造商在 2016 年访问了 FBI 涉嫌恐怖分子的 iPhone。 自开庭以来，这种紧张局势一直在加剧在加利福尼亚州圣贝纳迪诺发生枪击事件后。虽然安全研究人员支持打击虐待儿童的努力，但他们担心世界各国政府寻求访问公民个人数据的风险。 “这是一个绝对可怕的想法，因为它导致分布式批量监控......我们的手机和笔记本电脑，”剑桥大学安全工程教授罗斯安德森说。\n该系统目前经过培训，可以检测儿童性虐待，但可以扫描其他有针对性的图像和文本，例如恐怖分子斩首和抗议活动中的反政府迹象。可以适应。苹果的先例也可能对其他科技公司施加压力，要求他们使用类似的技术。约翰霍普金斯大学安全教授马修格林说：“这将打破大坝——政府将要求所有人这样做。”发布一条关于该问题的推文。曾在 Facebook 和 Deliveroo 工作过的安全研究员和隐私活动家亚历克·穆菲特 (Alec Muffett) 表示，苹果的举动是“地壳运动”，是“迈向个人隐私的巨大而倒退的一步”。基于云的照片存储系统和社交网站已经在扫描虐待儿童的图像，但试图访问存储在个人设备上的数据会使过程复杂化。萨利大学计算机安全教授艾伦伍德沃德说，苹果系统的侵入性较小，因为筛选是通过电话完成的，“只有在匹配时，才会向搜索者返回通知”。我有。 “这种去中心化的方法是遵循这条路线的最佳方法。”苹果的 neuralMatch 算法会持续扫描存储在美国用户 iPhone 上并上传到 iCloud 备份系统的照片。通过称为“哈希”的过程转换为一系列数字的用户照片与已知的儿童性虐待图像数据库中的照片进行比较。该系统接受了美国非营利性国家失踪和受虐儿童中心收集的 200,000 张性虐待图像的训练。\n据知情人士透露，在美国上传到 iCloud 的所有照片都将获得一张“安全凭证”，以表明它们是否可疑。如果一定数量的照片被标记为可疑，Apple 将允许您解密所有可疑照片，如果它们明显非法，则将它们交给当局。苹果计划扫描美国 iPhone 中的虐待儿童图像来源链接苹果计划扫描美国 iPhone 中的虐待儿童图像", "note_en": "Apple plans to install software on US iPhones to scan images of child abuse, opening the door to monitoring personal devices for millions of people, according to people who were briefed on the plan. It is ringing a warning bell among security researchers who warn that there is.\n   Apple detailed the system proposed earlier this week (known as “neural Match”) to some US scholars, according to two security researchers briefed at a virtual meeting. They said the plan might be published more widely soon this week.\n  The automated system warns a team of human reviewers in advance if it determines that an illegal image has been detected. The reviewer will contact law enforcement if the material is available. This scheme will initially be deployed only in the United States.\n     The proposal is between a unique commitment to protect customer privacy and ongoing demands from governments, law enforcement agencies, and child safety activists for further support in criminal investigations such as terrorism and child pornography. Apple’s attempt to find a compromise.\n  Tensions between law enforcement agencies and high-tech companies such as Apple and Facebook defending the increasing use of encryption in products and services caused iPhone makers to access the iPhones of suspected terrorists in the FBI in 2016. It has been intensifying since the court was opened in. Following the shooting in San Bernardino, California.\n  While security researchers support efforts to combat child abuse, they are concerned about the risks that will allow governments around the world to seek access to citizens’ personal data.\n  “It’s an absolutely horrifying idea because it leads to distributed bulk monitoring … Our phones and laptops,” said Ross Anderson, a professor of security engineering at the University of Cambridge.\n  The system is currently trained to detect child sexual abuse, but to scan other targeted images and texts, such as signs of anti-government in terrorist decapitation and protests. Can be adapted. Apple’s precedent could also put pressure on other tech companies to use similar technologies.\n  “This will break the dam — the government will demand it from everyone,” said Matthew Green, a security professor at Johns Hopkins University.  Post a tweet About the problem.\n  Alec Muffett, a security researcher and privacy campaigner who previously worked for Facebook and Deliveroo, said Apple’s move was “crustal movement” and “a huge and backward step towards personal privacy.”\n    Cloud-based photo storage systems and social networking sites are already scanning images of child abuse, but trying to access the data stored on personal devices complicates the process.\n  Apple’s system is less invasive in that screening is done over the phone, and “only if there is a match, a notification is returned to the searcher,” said Alan Woodward, a professor of computer security at Sally University. I have. “This decentralized approach is the best approach you can take to follow this route.”\n  Apple’s neuralMatch algorithm continuously scans photos stored on the US user’s iPhone and also uploaded to the iCloud backup system. User photos converted into a series of numbers by a process called “hash” are compared to photos in a database of known images of child sexual abuse.\n  The system is trained on 200,000 sexual abuse images collected by the US Nonprofit National Missing and Exploited Children’s Center.\n  All photos uploaded to iCloud in the United States will be given a “safety voucher” to indicate if they are suspicious, according to those who were briefed on the plan. If a certain number of photos are marked as suspicious, Apple will allow you to decrypt all the suspicious photos and give them to the authorities if they are clearly illegal.\n  Apple plans to scan US iPhones for child abuse imagery  Source link  Apple plans to scan US iPhones for child abuse imagery", "posttime": "2021-08-06 03:43:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,苹果,iphone,apple,儿童", "title": "苹果计划扫描美国 iPhone 中的虐待儿童图像", "title_en": "Apple plans to scan US iPhones for child abuse imagery", "transed": 1, "url": "https://californianewstimes.com/apple-plans-to-scan-us-iphones-for-child-abuse-imagery/470263/", "via": "", "real_tags": ["美国", "苹果", "iphone", "apple", "儿童"]}, {"category": "", "categoryclass": "", "imagename": "94ce8da88e8e63ca295744fc252d720f.jpeg", "infoid": 1071607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "卡内基梅隆大学的一位数学家开发了一种更简单的方法来求解二次方程。他的秘诀是将两个根概括在一起，而不是将它们保留为单独的值。根据麻省理工学院的技术评论，一位数学家推导出了一种更简单的方法来解决二次方程问题。二次方程是包含 x² 的多项式，教师使用它们来教学生一次找到两个解。由卡内基梅隆大学的 Po-Shen Loh 博士开发的新过程绕过了传统方法，例如完成平方，并将求根变成了一个更简单的事情，涉及更少的步骤，也更直观。此内容是从 YouTube 导入的。您可以在他们的网站上找到另一种格式的相同内容，或者您​​可以找到更多信息。二次方程落入了教育中一个有趣的甜甜圈洞。学生们从代数或预代数课程开始学习它们，但它们是勺子喂养的例子，很容易用整数解来解决。勾股定理也发生了同样的事情，在学校里，大多数例子最终都会解出勾股三元组，这是一小组整数值，可以完全融入勾股定理。此内容是从 {embed-name} 导入的。您可以在他们的网站上找到另一种格式的相同内容，或者您​​可以找到更多信息。\n二次方程是多项式，意思是数学术语串。像“x + 4”这样的表达式是多项式。它们可以有一个或多个任意组合的变量，它们的大小取决于变量的幂。所以 x + 4 是描述一条直线的表达式，而 (x + 4)² 是一条曲线。由于一条线仅穿过任何特定纬度或经度一次，因此其解只是一个值。如果你有 x²，这意味着两个根值，形状像一个圆形或弧形，有两个交叉点。 Loh 博士的方法（他也在他的网站上详细分享了该方法）使用每个二次方程的两个根的思想来制作推导这些根的更简单方法。他意识到他可以用这种方式描述二次方程的两个根：组合起来，它们平均到某个值，然后有一个值 z 显示任何额外的未知值。我们不是搜索两个单独的、不同的值，而是搜索两个相同的值。这简化了将公式相乘的算术部分。 “通常情况下，当我们做一个因式分解问题时，我们会试图找到两个乘以 12 并加起来为 8 的数字，”Loh 博士说。这两个数字是二次方程的解，但学生们需要花费大量时间来解它们，因为他们经常使用猜测和检查的方法。如果我们要查找的两个数字相加后等于 8，则它们必须与平均值等距。因此这些数字可以表示为 4–u 和 4+u。乘法时，中间项相互抵消，得出方程 16–u2 = 12。求解 u 时，您会看到正负 2 各有效，然后将这些整数代入方程 4 –u 和 4+u，你会得到两个解，2 和 6，它们求解原始多项式方程。它比二次公式中使用的经典挫败方法更快——而且不需要猜测。 ——考特尼·林德\nLoh 博士认为学生可以更直观地学习这种方法，部分原因是不需要特殊的单独公式。如果学生能记住一些关于根的简单概括，他们就可以决定下一步去哪里。它仍然很复杂，但没有那么复杂，特别是如果 Loh 博士是对的，这将使学生对二次方程的工作原理以及它们如何适用于数学的理解更加顺畅。例如，理解它们是微积分开始的关键。在课堂上准备的例子之外，二次方法并不简单。真实的例子和应用是混乱的，丑陋的根由小数或无理数组成。作为一名学生，很难知道你找到了正确的答案。 Loh 博士的新方法适用于现实生活，但他希望它也能帮助学生同时更好地理解二次公式。许多数学学生在理解简单的课堂例子和自己应用想法之间难以跨越鸿沟，Loh 博士希望为他们搭建一座更好的桥梁。此内容由第三方创建和维护，并导入此页面以帮助用户提供其电子邮件地址。您可以在 Piano.io 上找到有关此内容和类似内容的更多信息", "note_en": "A mathematician at Carnegie Mellon University has developed   an easier way to solve quadratic equations.\n  His secret is in generalizing two roots together instead of keeping them as separate values.\n   A mathematician has derived   an easier way to solve quadratic equation problems, according to MIT&#39;s  Technology Review.\n  Quadratic equations are polynomials that include an x², and teachers use them to teach students to find two solutions at once.  The  new process, developed by Dr. Po-Shen Loh at Carnegie Mellon University, goes around traditional methods like completing the square and turns finding roots into a simpler thing involving fewer steps that are also more intuitive.\n  This content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  Quadratic equations fall into an interesting donut hole in education. Students learn them beginning in algebra or pre-algebra classes, but they’re spoonfed examples that work out very easily and with whole integer solutions. The same thing happens with the Pythagorean theorem, where in school, most examples end up solving out to   Pythagorean triples, the small set of integer values that work cleanly into the Pythagorean theorem.\n This content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  Quadratic equations are polynomials, meaning strings of math terms. An expression like “x + 4” is a polynomial. They can have one or many variables in any combination, and the magnitude of them is decided by what power the variables are taken to. So x + 4 is an expression describing a straight line, but (x + 4)² is a curve.\n  Since a line crosses just once through any particular latitude or longitude, its solution is just one value. If you have x², that means two root values, in a shape like a circle or arc that makes two crossings.\n  Dr. Loh’s method, which he also  shared in detail on his website, uses the idea of the two roots of every quadratic equation to make a simpler way to derive those roots. He realized he could describe the two roots of a quadratic equation this way: Combined, they average out to a certain value, then there’s a value z that shows any additional unknown value. Instead of searching for two separate, different values, we’re searching for two identical values to begin with. This simplifies the arithmetic part of multiplying the formula out.\n   “Normally, when we do a factoring problem, we are trying to find two numbers that multiply to 12 and add to 8,” Dr. Loh said. Those two numbers are the solution to the quadratic, but it takes students a lot of time to solve for them, as they’re often using a guess-and-check approach.\n  If the two numbers we’re looking for, added together, equal 8, then they must be equidistant from their average. So the numbers can be represented as 4–u and 4+u.\n When you multiply, the middle terms cancel out and you come up with the equation 16–u2 = 12. When solving for u, you’ll see that positive and negative 2 each work, and when you substitute those integers back into the equations 4–u and 4+u, you get two solutions, 2 and 6, which solve the original polynomial equation.\n It’s quicker than the classic foiling method used in the quadratic formula—and there’s no guessing required. —Courtney Linder\n  Dr. Loh believes students can learn this method more intuitively, partly because there’s not a special, separate formula required. If students can remember some simple generalizations about roots, they can decide where to go next.\n     It’s still complicated, but it’s less complicated, especially if Dr. Loh is right that this will smooth students’s understanding of how quadratic equations work and how they fit into math. Understanding them is key to the beginning ideas of precalculus, for example.\n  Outside of classroom-ready examples, the quadratic method isn&#39;t simple. Real examples and applications are messy, with ugly roots made of decimals or irrational numbers. As a student, it&#39;s hard to know you&#39;ve found the right answer. Dr. Loh’s new method is for real life, but he hopes it will also help students feel they understand the quadratic formula better at the same time.\n Many math students struggle to move across the gulf in understanding between simple classroom examples and applying ideas themselves, and Dr. Loh wants to build them a better bridge.\n     This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2021-08-06 03:43:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,求解,finds,方法", "title": "数学家找到更简单的方法来求解二次方程 (2020)", "title_en": "Mathematician Finds Easier Way to Solve Quadratic Equations (2020)", "transed": 1, "url": "https://www.popularmechanics.com/science/math/a30152083/solve-quadratic-equations/", "via": "", "real_tags": ["2020", "求解", "finds", "方法"]}, {"category": "", "categoryclass": "", "imagename": "c1583e4636f34490f8587f720fd983d1.gif", "infoid": 1071606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇文章的目的是介绍我们在 Cord 使用的“微模型”方法来自动化数据注释。我们已将这种方法部署在广泛领域的计算机视觉标记任务上，包括医学成像、农业、自动驾驶汽车和卫星成像。 TLDR；内容：应用于小范围数据分布的低偏差模型。如何：在狭义任务的少数示例上过度拟合深度学习模型。原因：节省数百小时的手工贴标时间。这当然取决于你的目标。也许您想要一个通用模型，可以同时检测出亚当·韦斯特、迈克尔·基顿和蝙蝠侠的蝙蝠侠。也许你需要它包括一个布鲁斯韦恩探测器，它也可以识别面具后面的人。但是，如果您想要一个模型在一个电影中的一个场景中跟随 Christian Bale 蝙蝠侠，那么答案是……五个带标签的图像。用于生成上述模型推理结果片段的模型使用以下五个标签进行训练：现在，这是否回答了最初的问题？这个模型只是部分蝙蝠侠模型。它在 Val Kilmer 或 George Clooney Batmen 上表现不佳，但它在特定用例中仍然有效。因此，我们不会称其为蝙蝠侠模型，而是蝙蝠侠微型模型。我们在 Cord 的早期就开始使用微模型，当时我们只关注视频数据。我们在尝试不同的建模框架来自动分类胃肠病学视频时偶然发现了这个想法（您可以在此处找到更多相关信息）。我们最初的策略是尝试一种“经典”数据科学方法，从广泛分布的视频中采样帧，训练模型，然后对不同视频集的样本外图像进行测试。然后，我们将使用这些模型并衡量与人工标记相比我们的注释效率改进。然而，我们在实验中意识到，在仅从一个视频中智能选择的一小组帧上训练的分类模型已经产生了很好的结果。我们还注意到，随着时代数量的增加，我们的注释效率变得更高。这与我们对良好数据科学的了解相反。我们严重过度拟合了这个视频的模型。但它奏效了，特别是如果我们把它分解成每个视频都有自己的模型。我们称它们为微型模型。虽然这是用于视频帧分类，但我们已经扩展了实践，包括对象检测、分割和姿态估计等任务。\n最简而言之，微模型是针对特定任务或特定数据进行过度训练的特定注释模型。它们是故意过度拟合的模型，因此它们在一般问题上表现不佳，但在自动化数据注释的某一方面非常有效。因此，他们被设计为只擅长一件事。为了在实践中使用它们，我们将许多组合在一起以自动化全面的注释过程。 “传统”模型和微观模型之间的区别不在于它们的架构或参数，而在于它们的应用领域、用于生成它们的违反直觉的数据科学实践，以及它们的最终用途。为了介绍微型模型的工作原理，我们将采用一个高度简化的玩具模型，它可以更清楚地了解它们下面的基础。机器学习的核心是曲线拟合，只是在具有许多参数的非常高的维度空间中。因此，将构建模型的本质提炼为最简单的可能情况之一，即一维标签，是有益的。下面的内容稍微有点技术性，请随意跳过。您没有曲线的 xy 坐标，也无法实际查看整个曲线，您只能手动采样 x 的值，并且对于每个值，您必须查找与之关联的相应 y 值（“标签”为 x)。您想用一个模型拟合整条曲线，但密集采样点的成本太高了。你可以在这里使用什么策略？一种策略是将高度多项式拟合到曲线域上的一些初始采样点集，随机重新采样，评估误差，并根据需要更新多项式。问题是每次检查新样本点时都必须重新拟合整条曲线。每一点都会相互影响。您的模型也必须非常复杂才能处理曲线中的所有不同变化。解决这些问题的另一种策略是在局部区域采样，拟合一个近似该区域的模型，然后将整个域中的许多局部区域拼接在一起。例如，我们可以尝试将模型拟合到下面这个弯曲的部分：\n这是样条插值，一种常用的曲线拟合技术。每个样条都故意“过拟合”到局部区域。它不会很好地外推到它的领域之外，但它不是必须的。这是微观模型的概念基础，表现在低维空间中。这些单独的样条单元类似于我们用来自动化 x 值标记的“微模型”。更一般的情况遵循类似的核心逻辑，但有一些额外的微妙之处（例如利用迁移学习和优化采样策略）。为了自动化完整的计算机视觉注释过程，我们还像装配线一样将微型模型“缝合”在一起。请注意，将弱模型集成在一起以获得更好的推理结果是一个已经存在很长时间的想法。这略有不同。我们不会为单个预测将微观模型平均在一起，我们让每个模型自己处理预测。微型模型也不仅仅是“弱学习者”。他们只是对数据分布的覆盖范围有限，并且对该覆盖范围的偏差很小。我们正在利用这样一个事实，即在注释过程中，我们可以使用某种形式的人工监督来将模型“指向”正确的域。这种对微模型领域的指导使我们能够避免使用很少的人工标签来开始自动化流程。模型可以根据形式（一种近似世界上某些现象的可量化表示）或功能（一种帮助您做事的工具）来定义。我的观点倾向于后者。俗话说：微型模型也不例外。它们的理由来自在各种领域的应用程序中使用它们。为了考虑微模型在注释方面的实际考虑，让我们看看我们的蝙蝠侠示例。从我们训练模型的场景中取一千五百帧，我们看到蝙蝠侠出现在其中的大约一半中。反过来，我们的微型模型可以提取这些实例中的大约 70%。因此，我们仅从五个手动注释中就获得了大约 500 个蝙蝠侠标签。当然还有更正的问题。例如，我们有误报。考虑来自我们模型选取的场景中的“人造”蝙蝠侠之一的推理结果。\n我们也有可能没有那么紧的边界框。然而，这只是我们微模型的第一遍。和普通模型一样，微模型也会经过几轮迭代。为此，主动学习是最好的解决方案。我们只从五个标签开始，但现在通过一些最小的校正和智能采样，我们有超过 500 个标签可以用来训练我们的下一代微模型。然后我们使用这个更强大的版本来改进我们的原始推理结果并生成更高质量的标签。在这个过程的另一个循环之后，当考虑到人类行为的数量时，包括手动更正，我们的蝙蝠侠标签效率与我们的微模型达到了 95% 以上。开始时间：由于需要训练的标签很少，您可以在新项目的五分钟内开始在推理中使用微模型。迭代时间：快速入门的必然结果是迭代周期短。您可以进入持续数分钟而不是数小时或数天的主动学习循环。原型设计：短迭代周期有助于快速模型实验。我们已经看到微型模型作为人们正在构建的未来生产模型的非常有用的原型。它们可以快速检查想法对于 ML 项目的可行性是否最低。虽然我们在使用微模型进行数据注释方面取得了成功，但我们认为除了数据管道应用程序之外，还有一个可能性领域。如前所述，人工智能是曲线拟合。但更根本的是，它是让计算机做你想让它做的事情，这只是编程。它只是一种统计而非逻辑驱动的编程形式。 “正常”编程的工作原理是通过逻辑运算为输入到输出的转换建立确定性的偶然性。机器学习在高度复杂的领域蓬勃发展，在这些领域中，通过从示例中学习来解决逻辑捕捉这些突发事件的困难。这种统计编程范式仍处于起步阶段，尚未开发出围绕它的概念框架以供可靠的实际使用。\n例如，将问题分解为更小的组件是大多数问题解决框架的关键要素之一。面向对象的编程范式是朝着这个方向进行的组织转变，它加速了软件工程的发展，至今仍在实践中。我们仍处于人工智能的早期，也许实例化面向数据的编程范式对于类似的快速发展是必要的。在这种情况下，微观模型可能在对象范式中具有自然的类似物。复杂数据分布中的一个块是“对象等价物”，微模型是该对象的实例。虽然这些想法还为时尚早，但它们与以数据为中心的人工智能的新重点相吻合。开发编排这些“数据对象”的工具是下一代人工智能基础设施的负担。我们才刚刚开始，还有很长的路要走。", "note_en": "The purpose of this post is to introduce the “micro-model” methodology we use at   Cord  to automate data annotation. We have deployed this approach on computer vision labelling tasks across a wide range of domains including medical imaging, agriculture, autonomous vehicles, and satellite imaging.\n TLDR;  What: Low bias models applied to a small domain of a data distribution.  How: Overfitting deep learning models on a handful of examples of a narrowly defined task.  Why: Saving hundreds of hours of hand labelling.\n   This o  f course depends on your goal. Maybe you want a general purpose model that can detect the Batmen of Adam West, Michael Keaton, and Batfleck all in one. Maybe you need it to include a Bruce Wayne detector that can also identify the man behind the mask.\n But if you want a model that follows the Christian Bale Batman in one movie, in one scene, the answer is… five labelled images. The model used to produce the snippet of model inference results above was trained with the five labels below:\n  Now, does this answer the initial question? This model is only a  partial Batman model. It doesn’t perform that well on the Val Kilmer or George Clooney Batmen, but it is still functional with a specific use case. We thus won’t call it a Batman model, but instead a Batman  micro-model.\n  We started using micro-models in the early days of Cord when our focus was purely on video data. We stumbled upon the idea when trying out different modelling frameworks to automate the classification of gastroenterology videos (you can find more about that  here). Our initial strategy was to try a “classical” data science approach of sampling frames from a wide distribution of videos, training a model, and then testing on out-of-sample images of a different set of videos. We would then use these models and measure our annotation efficiency improvement compared to human labelling. We realized in experiments, however, that a classification model trained on a small set of intelligently selected frames from  only one video already produced strong results. We also noticed that as we turned the number of epochs up, our annotation efficiencies got higher.\n This was contrary to what we knew about good data science; we were grossly overfitting a model to this video. But it worked, especially if we broke it up such that each video had its own model. We called them micro-models. While this was for video frame classification, we have since extended the practice to include tasks such as object detection, segmentation, and pose estimation.\n  Most succinctly,  micro-models are annotation specific models that are overtrained to a particular task or particular piece of data. They are  purposefully overfit models such that they don’t perform well on general problems, but are very effective in automating one aspect of your data annotation. They are thus designed to only be good at one thing. To use them in practice, we ensemble many together to automate a comprehensive annotation process.\n  The distinction between a “traditional” model and a micro-model is not in their architecture or parameters, but in their domain of application, the counter-intuitive data science practices that are used to produce them, and their eventual end uses.\n  To cover  how micro-models work, we will take a highly simplified toy model that can give a clearer insight into the underpinnings beneath them. Machine learning at its core is curve-fitting, just in a very high dimensional space with many parameters. It is thus instructive to distill the essence of building a model to one of the simplest possible cases, one-dimensional labelling.  The following is  slightly more technical, feel free to skip ahead.\n  You don’t have the x-y coordinates of the curve and can’t actually see the curve as a whole, you can only manually sample values of x and for each one you have to look up the corresponding y value associated with it (the “label” for x).\n  You want to fit the whole curve with one model, but it is too expensive to densely sample points to do so. What strategies can you use here?\n One strategy is fitting a high degree polynomial to some initial set of sampled points across the domain of the curve, re-sampling at random , evaluating the error, and updating the polynomial as necessary. The issue is that you will have to re-fit the whole curve each time new sample points are checked. Every point will affect every other. Your model will also have to be quite complex to handle all the different variations in the curve.\n Another strategy, which resolves these problems, is to sample in a local region, fit a model that approximates just that region, and then stitch together many of these local regions over the entire domain. We can try to fit a model to just this curved piece below for instance:\n  This is  spline interpolation, a common technique for curve-fitting. Each spline is purposefully “overfit” to a local region. It will not extrapolate well beyond its domain, but it doesn’t have to. This is the conceptual basis for micro-models, manifested in a low dimensional space. These individual spline units are analogous to “micro-models” that we are using to automate our x-value labelling.\n The more general case follows similar core logic with some additional subtleties(like utilizing transfer learning and optimizing sampling strategies). To automate a full computer vision annotation process, we also “stitch” micro-models together like an assembly line. Note, ensembling weak models together to achieve better inference results is an idea that has been around for a long time. This is slightly different. We are not averaging micro-models together for a single prediction, we let each one handle predictions on their own. Micro-models are also not just “weak learners.” They just have limited coverage over a data distribution and exhibit  very low bias over that coverage.\n We are leveraging the fact that during an annotation process, we have access to some form of human supervision to “point” the models to the correct domain. This guidance over the domain of the micro-model allows us to get away with using very few human labels to start automating a process.\n  Models can be defined based on  form (a quantifiable representation approximating some phenomena in the world) or on  function (a tool that helps you do stuff). My view leans toward the latter. As the common quote goes:\n  Micro-models are no different. Their justification flows from using them in applications along a variety of domains.\n To consider the practical considerations of micro-models with regards to annotation, let’s look at our Batman example. Taking fifteen hundred frames from the scene we trained our model on, we see that Batman is present in about half of them. Our micro-model in turn picks up about 70% of these instances. We thus get around  five hundred Batman labels from only  five manual annotations.\n There are of course issues of correction. We have false positives for instance. Consider the inference result of one of the “faux” Batmen from the scene that our model picks up on.\n  We also have bounding boxes that are not as tight as they could be. This is all, however, with just the first pass of our micro-model. Like normal models, micro-models will go through a few rounds of iteration. For this, active learning is the best solution.\n We only started with five labels, but now with some minimal correction and smart sampling, we have more than five hundred labels to work with to train the next generation of our micro-model. We then use this more powerful version to improve on our original inference results and produce higher quality labels. After another loop of this process, when accounting for number of human actions, including manual corrections, our Batman label efficiency with our micro-model gets to over 95%.\n   Time to get started: You can start using micro-models in inference within five minutes of a new project due to requiring so few labels to train.\n Iteration time: A corollary to the speed of getting started is the short iteration cycle. You can get into active learning loops that are minutes long rather than hours or days.\n Prototyping: Short iteration cycles facilitate rapid model experimentation. We have seen micro-models serve as very useful prototypes for the future production models people are building. They are quick checks if ideas are minimally feasible for an ML project.\n  While we have found success in using micro-models for data annotation, we think there is also a realm of possibility beyond just data pipeline applications. As mentioned before, AI is curve fitting. But even more fundamentally, it is getting a computer to do something you want it to do, which is simply programming. It is just a form of programming that is statistically rather than logically driven.\n “Normal” programming works by establishing deterministic contingencies for the transformation of inputs to outputs via logical operations. Machine learning thrives in high complexity domains where the difficulty in logically capturing these contingencies is supplanted by learning from examples. This  statistical programming paradigm is still in its infancy and hasn’t developed the conceptual frameworks around it for robust practical use yet.\n For example, factorization of problems into smaller components is one of the key elements to most problem solving frameworks. The object oriented programming paradigm was an organziational shift in this direction that accelerated the development of software engineering and is still in practice today. We are still in the early days of AI, and perhaps instantiating a   data-oriented programming paradigm is necessary for similar rapid progression.\n In this context, micro-models might have a natural analogue in the object paradigm. One lump in a complex data distribution is an “object equivalent” with the micro-model being an instantiation of that object. While these ideas are still early, they coincide well with the new emphasis on  data-centric AI. Developing the tools to orchestrate these “data objects” is the burden for the next generation of AI infrastructure. We are only getting started, and still have a long way to go.", "posttime": "2021-08-06 03:42:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "模型,models", "title": "微模型：有目的地过度拟合擅长某一特定事物的模型", "title_en": "Micro-models: purposefully overfit models that are good at one specific thing", "transed": 1, "url": "https://eric-landau.medium.com/introduction-to-micro-models-or-how-i-learned-to-stop-worrying-and-love-overfitting-fd8fbe98e99b", "via": "", "real_tags": ["模型", "models"]}, {"category": "", "categoryclass": "", "imagename": "0e0b3beac39ad5bf5e83f7703bede1cf.jpeg", "infoid": 1071604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据了解其计划的人士透露，苹果打算在美国 iPhone 上安装软件来扫描虐待儿童的图像，这引起了安全研究人员的警觉，他们警告说，这可能会打开对数百万人的个人设备进行监控的大门。据两位听取了虚拟会议简报的安全研究人员称，苹果公司本周早些时候向一些美国学者详细介绍了其提议的系统——称为“neuralMatch”。他们说，这些计划最早可能会在本周更广泛地公布。如果自动化系统认为检测到非法图像，它会主动提醒一组人工审核人员，然后如果可以验证材料，他们将联系执法部门。该计划最初将仅在美国推出。这些提议是苹果公司试图在其保护客户隐私的承诺与政府、执法机构和儿童安全活动家的持续要求之间找到折衷方案，这些要求在包括恐怖主义和儿童色情在内的刑事调查中提供更多帮助。苹果和 Facebook 等科技公司一直为他们在产品和服务中越来越多地使用加密进行辩护，而执法部门之间的紧张关系自 2016 年这家 iPhone 制造商因获取恐怖嫌疑人的 iPhone 而向 FBI 告上法庭以来愈演愈烈。在加利福尼亚州圣贝纳迪诺发生枪击事件后。安全研究人员虽然支持打击虐待儿童的努力，但担心 Apple 可能会让世界各国政府寻求访问其公民的个人数据，这可能远远超出其最初意图。 “这是一个绝对令人震惊的想法，因为它将导致对 . . .我们的手机和笔记本电脑，”剑桥大学安全工程教授罗斯安德森说。\n研究人员表示，虽然该系统目前经过训练可以发现儿童性虐待，但它可以适应扫描任何其他有针对性的图像和文本，例如恐怖斩首或抗议活动中的反政府标志。苹果的先例也可能增加其他科技公司使用类似技术的压力。约翰霍普金斯大学的安全教授马修格林说：“这将打破大坝——政府会要求每个人都这样做，”据信他是第一个发布关于这个问题的推文的研究人员。曾在 Facebook 和 Deliveroo 工作过的安全研究员和隐私活动家 Alec Muffett 表示，苹果的举动是“构造性的”，是“个人隐私的巨大倒退一步。”基于云的照片存储系统和社交网站已经扫描了儿童滥用图像，但当试图访问存储在个人设备上的数据时，这个过程变得更加复杂。Apple 的系统侵入性较小，因为筛选是在手机上完成的，并且“只有在匹配时才会向搜索者发送通知”，萨里大学计算机安全教授艾伦伍德沃德说，“如果你真的沿着这条路走下去，这种分散的方法是你可以采用的最佳方法。”苹果的neuralMatch算法会不断扫描存储在美国用户iPhone上的照片，并上传到其iCloud备份系统，用户的照片通过“散列”过程转换成一串数字，然后进行比较与已知的儿童性虐待图像数据库中的那些。该系统已经接受了美国非营利性国家失踪和受虐儿童中心收集的 200,000 张性虐待图像的训练。\n据知情人士透露，在美国上传到 iCloud 的每张照片都会得到一张“安全凭证”，说明是否可疑。一旦一定数量的照片被标记为可疑，Apple 就会对所有可疑照片进行解密，如果明显违法，则将其传递给有关当局。 © 2021 The Financial Times Ltd. 保留所有权利 不得以任何方式重新分发、复制或修改。", "note_en": "Apple intends to install software on American iPhones to scan for child abuse imagery, according to people briefed on its plans, raising alarm among security researchers who warn that it could open the door to surveillance of millions of people’s personal devices.\n Apple detailed its proposed system—known as “neuralMatch”—to some US academics earlier this week, according to two security researchers briefed on the virtual meeting. The plans could be publicized more widely as soon as this week, they said.\n The automated system would proactively alert a team of human reviewers if it believes illegal imagery is detected, who would then contact law enforcement if the material can be verified. The scheme will initially roll out only in the US.\n  The proposals are Apple’s attempt to find a compromise between its own promise to protect customers’ privacy and ongoing demands from governments, law enforcement agencies and child safety campaigners for more assistance in criminal investigations, including terrorism and child pornography.\n The tension between tech companies such as Apple and Facebook, which have defended their increasing use of encryption in their products and services, and law enforcement has only intensified since the iPhone maker went to court with the FBI in 2016 over access to a terror suspect’s iPhone following a shooting in San Bernardino, California.\n Security researchers, while supportive of efforts to combat child abuse, are concerned that Apple risks enabling governments around the world to seek access to their citizens’ personal data, potentially far beyond its original intent.\n “It is an absolutely appalling idea, because it is going to lead to distributed bulk surveillance of . . . our phones and laptops,” said Ross Anderson, professor of security engineering at the University of Cambridge.\n    Although the system is currently trained to spot child sex abuse, it could be adapted to scan for any other targeted imagery and text, for instance, terror beheadings or anti-government signs at protests, say researchers. Apple’s precedent could also increase pressure on other tech companies to use similar techniques.\n “This will break the dam—governments will demand it from everyone,” said Matthew Green, a security professor at Johns Hopkins University, who is believed to be the first researcher to  post a tweet about the issue.\n Alec Muffett, a security researcher and privacy campaigner who formerly worked at Facebook and Deliveroo, said Apple’s move was “tectonic” and a “huge and regressive step for individual privacy.&#34;\n  Cloud-based photo storage systems and social networking sites already scan for child abuse imagery, but that process becomes more complex when trying to access data stored on a personal device.\n Apple’s system is less invasive in that the screening is done on the phone, and “only if there is a match is notification sent back to those searching,” said Alan Woodward, a computer security professor at the University of Surrey. “This decentralized approach is about the best approach you could adopt if you do go down this route.”\n Apple’s neuralMatch algorithm will continuously scan photos that are stored on a US user’s iPhone and have also been uploaded to its iCloud back-up system. Users’ photos, converted into a string of numbers through a process known as “hashing,” will be compared with those on a database of known images of child sexual abuse.\n The system has been trained on 200,000 sex abuse images collected by the US non-profit National Center for Missing and Exploited Children.\n According to people briefed on the plans, every photo uploaded to iCloud in the US will be given a “safety voucher” saying whether it is suspect or not. Once a certain number of photos are marked as suspect, Apple will enable all the suspect photos to be decrypted and, if apparently illegal, passed on to the relevant authorities.\n © 2021 The Financial Times Ltd.  All rights reserved Not to be redistributed, copied, or modified in any way.", "posttime": "2021-08-06 02:58:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,苹果,iphone,apple,儿童", "title": "苹果计划扫描美国 iPhone 中的虐待儿童图像", "title_en": "Apple plans to scan US iPhones for child abuse imagery", "transed": 1, "url": "https://arstechnica.com/information-technology/2021/08/apple-plans-to-scan-us-iphones-for-child-abuse-imagery/", "via": "", "real_tags": ["美国", "苹果", "iphone", "apple", "儿童"]}, {"category": "", "categoryclass": "", "imagename": "d9f9999ceed5cd2d491d6a9da01bbf3c.jpg", "infoid": 1071602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你对特斯拉、SpaceX 和我的一般情况感到好奇，@WalterIsaacson 正在写一本传记马斯克说艾萨克森“到目前为止已经跟踪了他好几天”，尽管他后来补充说，自传可能仍然存在天。目前还不清楚这本书什么时候发行，或者艾萨克森在这个项目中有多远。他的史蒂夫·乔布斯传记（恰如其分地命名为“史蒂夫·乔布斯”）用了两年多的时间，其中包括对 100 多位乔布斯同行的采访。马斯克一直是许多书籍的主题，但艾萨克森是迄今为止最受瞩目的传记作者。作者现为杜兰大学教授，曾任阿斯彭研究所CEO和CNN CEO。艾萨克森于 2014 年在 TechCrunch 的 Disrupt 上出现在舞台上。其他关于马斯克生活和工作的书籍包括阿什莉万斯 2015 年的传记，“埃隆马斯克：特斯拉，SpaceX，以及对美好未来的追求”，马斯克参与了其中；埃德·尼德迈耶 (Ed Niedermeyer) 的“可笑：特斯拉汽车的原汁原味的故事”以及本月发布的蒂姆·希金斯 (Tim Higgins) 的“权力游戏：特斯拉、埃隆·马斯克和世纪赌注”。马斯克和希金斯对“权力游戏”的一段进行了简短的来回，描述了他和苹果首席执行官蒂姆库克之间特别激烈的互动。希金斯在他的书中报道并通过电话进行的谈话是关于库克声称有兴趣在 2016 年收购特斯拉。 正如希金斯所说，马斯克告诉库克他有兴趣，但条件是他被任命为首席执行官苹果——库克回答说：“F——你。”马斯克在一条推文中坚称，他和库克从未互相交谈或写过信。希金斯回答说，这则轶事来自据报道当时听到马斯克讲述谈话的人。他补充说，马斯克有很多机会对这则轶事发表评论。 “他没有，”他说。", "note_en": "If you’re curious about Tesla, SpaceX &amp; my general goings on,  @WalterIsaacson is writing a biography\n  Musk said that Isaacson has shadowed him “for several days so far,” though he later added that an autobiography might still be in the cards one day. It’s unclear when the book will be released or how far along Isaacson is in the project. His biography on Steve Jobs (aptly titled “Steve Jobs “) took more than two years and included interviews with more than 100 of Jobs’ peers.\n Musk has been the subject of a number of books, but Isaacson is the most high-profile biographer yet to take on his story. The author is currently a professor at Tulane University and was previously the CEO of the Aspen Institute and the CEO of CNN. Isaacson appeared onstage at TechCrunch’s Disrupt in 2014.\n  Other books on Musk’s life and work include Ashlee Vance’s 2015 biography, “Elon Musk: Tesla, SpaceX, and the Quest for a Fantastic Future,” in which Musk participated; Ed Niedermeyer’s “Ludicrous: The Unvarnished Story of Tesla Motors” and this month’s release of Tim Higgins’ “Power Play: Tesla, Elon Musk, and the Bet of the Century.”\n Musk and Higgins had a brief back-and-forth about a section of “Power Play” describing a particularly spicy interaction between him and Apple CEO Tim Cook. The conversation, which Higgins reported in his book and took place over the phone, was over Cook’s purported interest in acquiring Tesla back in 2016. As Higgins tells it, Musk tells Cook he’s interested, but on the condition that he be instated as CEO of Apple — to which Cook replies, “F—you.”\n Musk maintained in a tweet that he and Cook have never spoken or written to each other. Higgins replied that the anecdote came from people who reported as hearing Musk’s recounting of the conversation at the time. He added that Musk was given plenty of opportunities to comment on the anecdote. “He didn’t,” he said.", "posttime": "2021-08-06 02:58:03", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "埃隆·马斯克,马斯克,isaacson", "title": "沃尔特·艾萨克森正在撰写埃隆·马斯克的传记", "title_en": "\n\t\t\t\tWalter Isaacson is working on a biography of Elon Musk\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/05/walter-isaacson-is-working-on-a-biography-of-elon-musk/", "via": "", "real_tags": ["埃隆·马斯克", "马斯克", "isaacson"]}, {"category": "", "categoryclass": "", "imagename": "6b3448a23bda0f977f9981b41bf062a1.jpg", "infoid": 1071601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sudheesh Nair 是 ThoughtSpot 的首席执行官，ThoughtSpot 是一家商业智能公司，该公司为数据分析构建了一个类似于 Google 的直观界面。在加入 ThoughtSpot 之前，Sudheesh 是 Nutanix 的总裁。虽然没有什么有效、什么无效的神奇公式，但成功的初创公司在其基础领导团队的构建方式方面具有共同的特征。我们都经历过消极方面的情况——人们只是为了听到自己的声音而发表观点，领导者争夺信用和议程上的冲突。当人们宁愿被倾听而不是贡献时，产出就会受到影响。一个健康的领导团队的成员不会害怕让其他人成为众人瞩目的焦点，因为他们相信他们共同建立的使命和文化。我们都是不完美的人，包括创始人。总有一些时刻是领导者无法预测的，错误也随之而来。合适的领导团队应该能够减轻意外，有时还可以让未来更容易预测。尽早让合适的人担任合适的角色可能是成功与失败的区别——这从高层开始。投资者喜欢创始人兼 CEO，而创始人通常是这个角色的绝佳人选。但不是每个人都能做好，更重要的是，也不是每个人都想做。初创公司创始人在为移交统治的前景而失眠之前应该问自己几个问题：如果我不是首席执行官，我可以最大限度地发挥公司的潜力吗？\n诚实的自我评估是必要的，这是只有杰出和无私的创始人才能做到的。在许多情况下，创始人决定他们需要外部帮助来填补这个角色。虽然 CEO 可能不是您的第一个员工——甚至不是前五名员工之一——但您选择的人最终将担任您组织最关键的领导角色，因此请明智地选择。寻找什么：基于执行现实的雄心勃勃的愿景。您的 CEO 应该具有实践经验，使他们能够看到周围的角落、预测陷阱并发现机会。需要注意的事项：缺乏对创始愿景的尊重或缺乏快速聘用和平衡执行团队的能力的领导者。一个好的 CEO 应该能够在不影响真正的北方的情况下管理短期现金流和进入市场的需求，同时建立长期的基础和文化。", "note_en": "Sudheesh Nair is CEO of  ThoughtSpot, a business intelligence company that has built an intuitive Google-like interface for data analytics. Before ThoughtSpot, Sudheesh was president at Nutanix.\n  While there’s no magic formula for what works and what doesn’t, successful startups share common traits in terms of the way their foundational leadership teams are built.\n We’ve all experienced what it looks like on the negative end of the spectrum — people making points simply to hear their own voice, leaders competing for credit and clashing agendas. When people would rather be heard than contribute, the output suffers. Members of a healthy leadership team are unafraid to let others have the limelight, because they trust the mission and the culture they’ve built together.\n  We are all imperfect human beings, founders included. There are always going to be moments that leaders can’t predict, and mistakes come with the territory. The right leadership team should be able to mitigate the unexpected, and sometimes make the future easier to predict. Putting the right people in the right roles early on can be the difference between success and failure — and that starts at the top.\n  Investors love founder-CEOs, and founders are often fantastic candidates for this role. But not everyone can do it well, and more importantly, not everyone wants to.\n Startup founders should ask themselves a few questions before they lose sleep over the prospect of handing over the reigns:\n Can I maximize the potential of the company if I’m not the CEO?\n An honest self-assessment is necessary and this is something that only exceptional and selfless founders are capable of. In many cases, founders decide they need outside help to fill the role. While a CEO may not be your first hire — or even one of the first five — the person you choose will ultimately occupy your organization’s most critical leadership role, so choose wisely.\n What to look for: Ambitious vision grounded in execution reality. Your CEO should have hands-on experience that allows them to see around corners, predict pitfalls and identify opportunities.\n What to watch out for: Leaders who lack respect for the founding vision or the ability to hire and balance an executive team quickly. A good CEO should be able to manage short-term cash flow and go-to-market needs without compromising the true north, while building a foundation and culture for the long term.", "posttime": "2021-08-06 02:57:46", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "创业,创始,building", "title": "建立一个伟大的创业创始团队的蓝图", "title_en": "\n\t\t\t\tA blueprint for building a great startup founding team\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/05/a-blueprint-for-building-a-great-startup-founding-team/", "via": "", "real_tags": ["创业", "创始", "building"]}, {"category": "", "categoryclass": "", "imagename": "129edf53f1c830d11d134242cb801b68.jpg", "infoid": 1071600, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "现在，Twitter 允许 Space 主持人添加两个共同主持人，他们可以通过邀请系统加入。空间将允许一位主要主持人、两位额外的共同主持人和最多 10 位演讲者。额外的联合主持人将使节制任务更易于管理，因为他们将能够审查发言者请求、点击发言者并为 Space 中的任何人提供引导。 – 主持人有两个可以发送的联合主持人邀请 – 桌子变大了：1 个主持人、2 个联合主持人和 10 个发言人 – 联合主持人可以帮助邀请发言人、管理请求、删除参与者、固定推文等等！ pic.twitter.com/s76JFbhTL2 随着舰队的消失，Twitter 的空间是目前唯一位于 Twitter 应用程序主要提要之上的功能。该虚拟房地产与 Instagram 的 Stories 相呼应，吸引了社交网络希望其用户首先查看的任何内容。 Twitter 还开始推出一个专用标签，以便更轻松地发现 Spaces，在中心位置实时呈现现场音频室。鉴于 Clubhouse 的突破性运行，许多主要应用程序将实时音频聊天室拼接到他们的平台上。 6 月，Spotify 推出了 Greenroom，这是一个独立的应用程序，允许人们创建 1,000 人的语音事件。自然，Facebook 也在 6 月份推出了自己的现场音频室（称为 Live Audio Rooms）。 Discord 已经是语音聊天领域的领导者，在 3 月份增加了自己的类似俱乐部的活动频道。 Twitter 在 Spaces 上遵循了相同的趋势，但与 Fleets 不同的是，该公司似乎计划继续支持相对较新的功能。", "note_en": "Now, Twitter is giving Space hosts the ability to add two co-hosts, who they can rope in through an invite system. Spaces will allow one main host, two additional co-hosts and up to 10 speakers. Additional co-hosts will make the task of moderation much more manageable, as they’ll be able to vet speaker requests, tap speakers and give anyone in the Space the boot.\n – hosts have two co-host invites they can send – the table just got bigger: 1 host, 2 co-hosts, and 10 speakers – co-hosts can help invite speakers, manage requests, remove participants, pin Tweets and more!  pic.twitter.com/s76JFbhTL2\n With Fleets out of the picture, Twitter’s Spaces are the only feature for now that lives above the main feed in the Twitter app. That virtual real estate, which has echoes of Instagram’s Stories, draws the eye to anything that a social network wants its users to check out first. Twitter also began rolling out a  dedicated tab to make it easier to discover Spaces, surfacing live audio rooms in real time in a central location.\n A number of major apps spliced live audio chat rooms into their platforms in light of Clubhouse’s breakout run. In June,  Spotify launched Greenroom, a standalone app that allows people to create 1,000-person voice events. Naturally, Facebook also launched its own spin on live audio rooms ( called Live Audio Rooms) in June. Discord, already a leader in voice-based chat, added its own  Clubhouse-like event channels in March. Twitter followed the same trend with Spaces, but unlike with Fleets, it looks like the company plans to continue supporting the relatively new feature.", "posttime": "2021-08-06 02:57:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "spaces,twitter", "title": "Twitter Spaces 现在可让您邀请共同主持人", "title_en": "\n\t\t\t\tTwitter Spaces now let you invite co-hosts\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/05/twitter-spaces-cohosts/", "via": "", "real_tags": ["spaces", "twitter"]}, {"category": "", "categoryclass": "", "imagename": "d4ecc63143fa52fbf9df088ee32b5bc0.jpg", "infoid": 1071599, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软今天表示，它计划在其 Edge 网络浏览器中进行一项实验，在该实验中，它将有意禁用一项重要的性能和优化功能，以便在公司所谓的 Edge Super Duper 安全模式中启用更高级的安全升级。 Microsoft Edge 漏洞研究负责人 Johnathan Norman 今天宣布，新的 Super Duper 安全模式背后的想法是在 Edge 浏览器的 JavaScript 引擎 V8 中禁用对 JIT（即时）的支持。 JIT 虽然大多数最终用户都不知道，但在当今所有的 Web 浏览器中都起着至关重要的作用。 JIT 通过使用 JavaScript 并将其提前编译为机器代码来工作。如果浏览器需要代码，它会获得显着的速度提升。如果不是，则丢弃该代码。但是，V8 中的 JIT 支持很复杂。 Norman 表示，2019 年与 JIT 相关的安全问题占所有 V8 漏洞的 45%。此外，超过一半的“野外”Chrome 漏洞依赖于与 JIT 相关的错误。 Norman 表示，Edge 团队最近进行的测试表明，尽管它在 2010 年代初和中期在加速浏览器方面发挥了关键作用，但 JIT 不再是 Edge 性能的关键特性。受到这些发现的鼓舞，Norman 表示 Edge 团队现在正在研究 Super Duper 安全模式，这是一种 Edge 配置，他们禁用 JIT 并启用其他三个安全功能，例如控制流执行技术 (CET) 和任意代码保护 (ACG)——两个通常会与 V8 的 JIT 实现发生冲突的功能。正如 Norman 解释的那样，Super Duper 安全模式目前被归类为一项实验，目前还没有一成不变的计划将其交付给用户。\n我不确定这是否会成为一项功能。但我认为这个实验值得一试。如果您尝试，请在 Edge 中分享您的反馈（单击 3 个点 -&gt; 反馈）或在论坛 https://t.co/As3jeqMSyC 上发帖。我们很好奇这是否是用户想要的。 7/? — Johnathan Norman (@spoofyroot) 2021 年 8 月 4 日 然而，虽然 Super Duper 安全模式没有确定的未来，但该功能已经上线并准备进行测试。 Edge Canary、Dev 和 Beta 的用户可以转到以下地址并在他们的浏览器中启用它：", "note_en": "Microsoft said today it plans to run an experiment in its Edge web browser where it will intentionally disable an important performance and optimization feature in order to enable more advanced security upgrades in what the company is calling Edge  Super Duper Secure Mode.\n Announced today by Johnathan Norman, Microsoft Edge Vulnerability Research Lead, the idea behind the new Super Duper Secure Mode is to disable support for JIT (Just-In-Time) inside V8, the Edge browser’s JavaScript engine.\n JIT, while unknown to most end-users, plays a crucial role in all of today’s web browsers. JIT works by taking JavaScript and compiling it to machine code ahead of time. If the browser needs the code, it gains a significant speed boost. If it doesn’t, the code is discarded.\n However, JIT support in V8 is complex. Norman said JIT-related security issues amounted to 45% of all V8 vulnerabilities in 2019. Furthermore, more than half of the “in the wild” Chrome exploits rely on JIT-related bugs.\n Norman said that recent tests carried out by the Edge team have shown that despite its pivotal role in speeding up browsers in the early and mid-2010s, JIT is not a crucial feature anymore to Edge’s performance.\n  Encouraged by these findings, Norman said the Edge team is now working on Super Duper Secure Mode, an Edge configuration where they disable JIT and enable three other security features such as  Controlflow-Enforcement Technology (CET) and  Arbitrary Code Guard (ACG)—two features that would normally clash with V8’s JIT implementation.\n As Norman explained, Super Duper Secure Mode is currently classified as an experiment, and there are no plans set in stone to ship it to users just yet.\n I&#39;m not sure if this will land as a feature. But I think this experiment is worth a shot. If you try it please share your feedback in Edge (click the 3 dots -&gt; feedback) or post on the forum  https://t.co/As3jeqMSyC . We are curious to see if this is something users want. 7/?\n— Johnathan Norman (@spoofyroot)  August 4, 2021\n However, while Super Duper Secure Mode does not have a certain future, the feature is already live and ready for testing. Users of Edge Canary, Dev, and Beta can go to the following address and enable it in their browsers:", "posttime": "2021-08-06 02:44:25", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,微软,代码,安全,announces", "title": "微软宣布为其 Edge 桌面浏览器推出“Super Duper 安全模式”，该模式禁用了 V8 的 JIT，允许使用任意代码保护等安全功能", "title_en": "Microsoft announces “Super Duper Secure Mode” for its Edge desktop browser, which disables V8's JIT, allowing for security features like Arbitrary Code Guard", "transed": 1, "url": "https://therecord.media/microsoft-announces-new-super-duper-secure-mode-for-edge/", "via": "", "real_tags": ["microsoft", "微软", "代码", "安全", "announces"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071598, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我经常发现自己想引用我的书 Coders at Work 的摘录，主要是因为有人站着在 Dijkstra 上给 BS 打电话，这让我很兴奋： Seibel：似乎很多我与之交谈过的人都可以直接访问在他们开始时到一台机器。然而 Dijkstra 有一篇我相信你很熟悉的论文，他基本上说我们不应该让计算机科学专业的学生在他们接受培训的最初几年接触机器；他们应该把所有的时间都花在处理符号上。 Knuth：但这也不是他学习的方式。他说了很多非常棒的事情和鼓舞人心的事情，但他并不总是对的。我也不是，但我的看法是：以任何领域的科学家为例。科学家长大后说：“哦，是的，我一直在做的一些事情取得了非常好的回报，而其他事情，我不再使用了。我不会让我的学生在那些不会迈出巨大步伐的东西上浪费时间。我根本不会谈论低级的东西。这些理论概念真的非常强大——这就是整个故事。忘记我是如何走到这一步的。”我认为这是各个领域的科学家犯的一个基本错误。他们没有意识到，当你在学习一些东西时，你必须在各个层面看到一些东西。在建造天花板之前，您必须先查看地板。这一切都进入了大脑并被推到了老年人忘记他们需要它的地步。", "note_en": "An excerpt from my book  Coders at Work  that I frequently find myself wanting to cite mostly because I get a kick out of someone having standing to call BS on Dijkstra:\n  Seibel: It seems a lot of the people I’ve talked to had direct access to a machine when they were starting out. Yet Dijkstra has a paper I’m sure you’re familiar with, where he basically says we shouldn’t let computer-science students touch a machine for the first few years of their training; they should spend all their time manipulating symbols.  Knuth: But that’s not the way he learned either. He said a lot of really great things and inspirational things, but he’s not always right. Neither am I, but my take on it is this: Take a scientist in any field. The scientist gets older and says, “Oh, yes, some of the things that I’ve been doing have a really great payoff and other things, I’m not using anymore. I’m not going to have my students waste time on the stuff that doesn’t make giant steps. I’m not going to talk about low-level stuff at all. These theoretical concepts are really so powerful—that’s the whole story. Forget about how I got to this point.”  I think that’s a fundamental error made by scientists in every field. They don’t realize that when you’re learning something you’ve got to see something at all levels. You’ve got to see the floor before you build the ceiling. That all goes into the brain and gets shoved down to the point where the older people forget that they needed it.", "posttime": "2021-08-06 02:44:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "迪杰,knuth,科学家", "title": "迪杰斯特拉 (2014) 上的 Knuth", "title_en": "Knuth on Dijkstra (2014)", "transed": 1, "url": "https://gigamonkeys.com/knuth-dijkstra/", "via": "", "real_tags": ["迪杰", "knuth", "科学家"]}, {"category": "", "categoryclass": "", "imagename": "297a59e5a6fc9a027ea1155adf83395a.jpg", "infoid": 1071597, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英格兰超过 90% 的成年人都拥有冠状病毒抗体，因为不断提高的免疫力有助于减少病例。成人疫苗接种的最后阶段，加上年轻人病例激增，意味着 7 月 12 日当周 80% 的 16-24 岁人群有抗体，高于两周前的 67%。总体而言，94% 的英国成年人都有抗体。超过一半的 16 岁和 17 岁儿童通过感染获得了抗体，因为部长们昨天批准为这个年龄段的所有 140 万人接种疫苗。国家统计局数据显示，自两周前公布最新数据以来，抗体水平总体上增加了两个百分点，几乎没有迹象", "note_en": "More than 90 per cent of adults in England have coronavirus antibodies as rising immunity levels help to drive cases down.\n The final phase of vaccination in adults, coupled with a surge of cases in young people, mean that 80 per cent of those aged 16-24 had antibodies in the week of July 12, up from 67 per cent two weeks earlier. Overall, 94 per cent of English adults have antibodies.\n  More than half of 16- and 17-year-olds have acquired their antibodies through infection, as ministers  approve vaccination of all 1.4 million people in this age group yesterday.\n Office for National Statistics data shows antibody levels have increased by two percentage points overall since the last figures were released two weeks ago, with little sign", "posttime": "2021-08-06 02:43:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,adults,抗体", "title": "ONS 数据显示，94% 的英国成年人有 Covid 抗体", "title_en": "94% of English adults have Covid antibodies, ONS data shows", "transed": 1, "url": "https://www.thetimes.co.uk/article/658b3bc4-f518-11eb-8f01-2c678acbb979", "via": "", "real_tags": ["数据", "adults", "抗体"]}, {"category": "", "categoryclass": "", "imagename": "4e9e96994832c5a7c421947dfd7e97e2.jpeg", "infoid": 1071596, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "亚马逊周四表示，将公司员工返回办公室的时间推迟到 2022 年 1 月。此前，亚马逊曾表示，预计大部分员工将在今年 9 月 7 日这一周开始定期返回办公室。由于具有高度传染性的 delta 变体，在 Covid-19 病例增加的情况下，几家公司已经调整了他们的复工计划。亚马逊将其企业员工返回办公室的时间推迟到明年初，在 Covid-19 病例因高度传染性的 delta 变体而增加的情况下，亚马逊成为最新一家这样做的科技公司。该公司向 CNBC 证实，美国和其他一些国家/地区的公司员工将从 2022 年 1 月 3 日开始返回办公室。此前，亚马逊曾表示，预计其大部分员工将从今年 9 月 7 日那一周开始定期返回办公室。最近几周，随着 Covid-19 案件的增加，包括谷歌、Facebook、苹果和推特在内的其他科技公司已经调整了他们的复工计划。与谷歌和 Facebook 不同，亚马逊不会要求员工返回办公室接种疫苗。亚马逊首席财务官布赖恩·奥尔萨夫斯基 (Brian Olsavsky) 在上周公司发布第二季度收益报告后与记者通话时证实了这一点。\n亚马逊表示，该公司将要求员工在办公室戴口罩，除非他们出示完全接种疫苗的证明。亚马逊在 6 月份收回了关于远程工作的指导。该公司表示，它希望员工每周在办公室工作三天，让他们可以选择每周最多两天远程工作。这与 3 月份的指导方针相比发生了重大转变，当时该公司表示其目标是“回归以办公室为中心的文化作为我们的基线”。", "note_en": "Amazon said Thursday it&#39;s postponing a return to the office for its corporate employees to January of 2022.\n Previously, Amazon had said it expected most of its employees to begin returning regularly to the office the week of Sept. 7 of this year.\n Several companies have adjusted their return-to-work plans amid a rise in Covid-19 cases due to the highly contagious delta variant.\n Amazon is postponing a return to the office for its corporate employees until early next year, becoming the latest tech company to do so amid a rise in Covid-19 cases due to the highly contagious delta variant.\n Corporate employees in the U.S. and some other countries will begin returning to the office beginning Jan. 3, 2022, the company confirmed to CNBC. Previously, Amazon had said it expected most of its employees to begin returning regularly to the office the week of Sept. 7 of this year.\n   In recent weeks, other technology companies including  Google,  Facebook,  Apple and  Twitter have adjusted their return-to-work plans amid a rise in Covid-19 cases.\n Unlike  Google and  Facebook, Amazon won&#39;t require workers returning to its office to be vaccinated. Amazon CFO Brian Olsavsky confirmed this in a call with reporters following the company&#39;s second-quarter earnings report last week.\n The company will require employees to wear masks in the office, unless they show proof of full vaccination, Amazon said.\n Amazon in June  walked back its guidance around remote work. The company said it expects employees to work in the office three days a week, leaving them the option to work remotely up to two days a week. That was a significant U-turn from its  March guidance, when it said its goal was to &#34;return to an office-centric culture as our baseline.&#34;", "posttime": "2021-08-06 02:43:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,推迟,postpones,办公室", "title": "亚马逊推迟复职至 2022 年 1 月", "title_en": "Amazon postpones return to office until January 2022", "transed": 1, "url": "https://www.cnbc.com/2021/08/05/amazon-postpones-return-to-office-until-january-2022-.html", "via": "", "real_tags": ["amazon", "亚马逊", "推迟", "postpones", "办公室"]}, {"category": "", "categoryclass": "", "imagename": "6bf5887c1877f4aec6acdfed74853dfe.png", "infoid": 1071595, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 The Gradient Podcast 的第 6 集中，我们采访了深度学习先驱 Yann LeCun。订阅渐变播客：Apple 播客 | Spotify |袖珍铸件 | RSS 在 Twitter 上关注 Gradient Yann LeCun 是 Facebook 的副总裁兼首席人工智能科学家和纽约大学的 Silver 教授，他还是 Facebook 人工智能研究和纽约大学数据科学中心的创始主任。他以在 80 年代和 90 年代率先使用卷积神经网络进行图像处理而著称，并且通常被认为是其工作对人工智能深度学习革命至关重要的人之一。事实上，他是 2018 年 ACM 图灵奖（与 Geoffrey Hinton 和 Yoshua Bengio 一起）的获得者，因为“概念和工程突破使深度神经网络成为计算的关键组成部分”。主题：“MusicVAE：三重奏 16 小节样本 #2”，来自“MusicVAE：用于学习音乐中长期结构的分层潜在向量模型”。", "note_en": "In episode 6 of The Gradient Podcast, we interview Deep Learning pioneer Yann LeCun.  Subscribe to The Gradient Podcast:  Apple Podcasts |  Spotify |  Pocket Casts |  RSS Follow The Gradient on  Twitter\n Yann LeCun is the VP &amp; Chief AI Scientist at Facebook and Silver Professor at NYU and he was also the founding Director of Facebook AI Research and of the NYU Center for Data Science. He famously pioneered the use of Convolutional Neural Nets for image processing in the 80s and 90s, and is generally regarded as one of the people whose work was pivotal to the Deep Learning revolution in AI. In fact he is the recipient of the 2018 ACM Turing Award (with Geoffrey Hinton and Yoshua Bengio) for &#34;conceptual and engineering breakthroughs that have made deep neural networks a critical component of computing&#34;.\n Theme: “ MusicVAE: Trio 16-bar Sample #2” from &#34;MusicVAE: A Hierarchical Latent Vector Model for Learning Long-Term Structure in Music&#34;.", "posttime": "2021-08-06 02:43:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,学习,lecun", "title": "Yann LeCun 开始从事人工智能和最近的自我监督学习研究", "title_en": "Yann LeCun on his start in AI and recent self-supervised learning research", "transed": 1, "url": "https://thegradientpub.substack.com/p/yann-lecun-on-his-start-in-research", "via": "", "real_tags": ["人工智能", "学习", "lecun"]}, {"category": "", "categoryclass": "", "imagename": "449e5c36febe8bb42bd25038ce48be2d.jpeg", "infoid": 1071594, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "澳大利亚新的 App Store 预览功能包括诱使用户每周订阅超过 10 美元的应用程序。愤怒的用户已经在 Twitter 上抱怨，指出一个应用程序甚至没有做任何事情。澳大利亚的 App Store 用户对 Apple 决定在其 App Store 预览页面中推广骗局 ASMR 粘液应用程序的决定感到愤怒，其中包括似乎没有做任何事情并诱使用户每周进行大量订阅的应用程序。正如 Beau Nouvelle 在 Twitter 上指出的那样，苹果正在其 App Store 上推广“史莱姆放松”应用程序（显然不是第一次）：Apple 的 App Store 预览页面具有史莱姆放松功能，上面写着“你知道史莱姆对玩吗？揉捏、戳戳和拉伸这种多色粘稠物会立即引起大脑和身体的刺痛感，以及一种幸福感。缺点？这会变得混乱，真正快速 - 对您的放松目标适得其反。这就是这些应用程序的用武之地。 ” Twitter 用户 Simeon 对其中一个应用程序进行了更深入的研究，注意到 Jelly：Slime 模拟器，ASMR。在一个严厉的 Twitter 帖子中，Simeon 指出，该应用程序的第一页突出显示了一个捕获，右下角的一小段文字广告该应用程序每周收费 13 美元（澳大利亚），每年 676 澳元。下载和安装该应用程序会显示三个入门屏幕，然后是一个付费专区：\n解锁按钮会调出 Apple 的应用内支付系统，该系统规定您可以在付款开始前获得为期三天的免费试用。同样，这每年花费 676 美元。该应用程序是一个相当简单的骗局，在 App Store 及其他基于订阅的服务中使用，依赖于用户忘记取消免费试用。尽管有警告，但用户并没有留下深刻印象：作为一名开发人员，Simeon 继续说这个问题令人气愤，因为“作为一个不想骗人的开发人员（我不希望你的钱意外地想要”和一个不想要的人对“琐碎的事情收取淫秽的费用”，让“任何人都很难相信我们和 App Store。”在接受 iMore 采访时，Nouvelle 告诉我们 App Store 上存在这样的应用程序，这些应用程序被 Apple 推荐，感觉就像对于努力让他们的应用程序受到关注的开发人员来说，又是一记重拳。“它把 App Store 变成了一个笑话”，Nouvelle 说。证明 Apple 关于 App Store 评论存在质量控制和安全的说法只是谎言。” App Store 中欺诈应用程序的存在和扩散是 Apple 批评者经常使用的论点，因为它似乎削弱了 Apple 的论点，即拥有一个单一的 iOS App Store 是保护消费者免受恶意活动侵害的最佳方式。苹果自己的数据称，它去年在其 App Store 上阻止了 15 亿美元的欺诈行为，拒绝了 200 万份提交，其中包括 150,000 个垃圾邮件和山寨应用程序。 TikTok 现在提供 Stories，这是一种人们发布视频的方式，这些视频将在 24 小时后消失。因为当然是这样。几天前在 Apple Music 上举办了一场奇异的聆听派对后，Kanye West 将在该平台上为他的新专辑 Donda 举办另一场聆听活动。直播已经在运行。 Apple 已向开发人员发布了 Safari Technology Preview 129，让他们有机会在 macOS Big Sur 上测试其网络浏览器的最新版本。\n如果您不喜欢笔记本电脑包，并且您不喜欢硬壳保护套，请拿一个笔记本电脑套，至少保护您的新 MacBook Pro 免受划伤。这是我们的最爱！", "note_en": "A new App Store preview feature in Australia includes apps that trick users into subscriptions of more than $10 a week.\n Furious users have taken to Twitter to complain, noting one app doesn&#39;t even do anything.\n App Store users in Australia are furious at Apple&#39;s decision to promote scam ASMR slime apps in its App Store Preview page, including apps that don&#39;t seem to do anything and trick users into hefty weekly subscriptions.\n As noted by Beau Nouvelle on Twitter, Apple is promoting &#39;Slime relaxation&#39; apps on its App Store (apparently not for the first time):\n   Apple&#39;s  App Store Preview Page features a  Slime Relaxations feature that says &#34;Did you know that slime is therapeutic to play with? Kneading, poking and stretching that multi-coloured goo can elicit instant brain and body tingles, and a sense of bliss. The downside? This gets messy real fast- counterproductive to your goal of relaxation. That&#39;s where these apps come in.&#34;\n  A deeper dive into one of these apps by Twitter  user Simeon notes  Jelly: Slime simulator, ASMR.\n In a scathing Twitter thread, Simeon notes that the first page of the app highlights a catch, a tiny piece of text in the bottom right-hand corner advertising that the app is $13 (Australian) a week, a staggering $676 AU per year. Downloading and installing the app shows three onboarding screens and then a paywall:\n  The unlock button brings up Apple&#39;s in-app payment system that states you get a free three-day trial before the payments start. Again, this costs $676 a year. The app is a fairly simple scam that&#39;s used on the App Store and beyond in many subscription-based services, relying on a user forgetting to cancel their free trial. Despite warnings, users were not impressed:\n  As a developer, Simeon went on to say the problem was infuriating because &#34;as a developer who is not looking to scam people (I don&#39;t want your money accidentally&#34; and someone who didn&#39;t want to charge &#34;obscene amounts for trivial things&#34;, making it &#34;hard for anyone to trust us and the App Store.&#34;\n Speaking to iMore, Nouvelle told us the existence of apps like this on the App Store that are being featured by Apple felt like another punch in the face to developers who work hard to get their apps noticed. &#34;It turns the App Store into a joke&#34;, Nouvelle said. &#34;But for many of us, it&#39;s our livelihood. The active promotion of stuff like this is just proof that Apple&#39;s claims around App Store reviews being there for quality control and safety are just lies.&#34;\n The existence and proliferation of scam apps in the App Store is an argument frequently used by Apple&#39;s critics, as it seems to undermine Apple&#39;s arguments that having a single iOS App Store is the best way to protect consumers from malicious activity. Apple&#39;s own figures claim  it prevented $1.5 billion in fraud on its App Store last year, rejecting 2 million submissions including 150,000 spam and copycat apps.\n   TikTok is now offering Stories, a way for people to post videos that will disappear after 24 hours. Because of course it is.\n After a bizarre listening party on Apple Music a few days ago, Kanye West is set to host another listening event for his new album Donda on the platform. The live stream is already running.\n Apple has released Safari Technology Preview 129 to developers, giving them the chance to test the latest build of its web browser out on macOS Big Sur.\n If laptop bags aren&#39;t your thing and you don&#39;t like hardshell cases, grab a laptop sleeve and at least protect your new MacBook Pro from scratches. Here are our favorites!", "posttime": "2021-08-06 02:42:47", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,apple,app,scam,应用程序", "title": "苹果在 App Store 推广 676 美元/年的诈骗应用", "title_en": "Apple promotes $676/year scam apps on the App Store", "transed": 1, "url": "https://www.imore.com/apple-promotes-676-year-scam-asmr-slime-apps-app-store", "via": "", "real_tags": ["苹果", "apple", "app", "scam", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "aeaea302dbd6f0535c0067d7d3d6056e.jpg", "infoid": 1071593, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "经过四年多令人沮丧的延迟，蓝色起源终于在完成其强大的 BE-4 火箭发动机的开发方面取得了重大进展。目前，该公司的工程师和技术人员正在蓝色起源位于华盛顿肯特的主要工厂组装前两台飞行发动机。该公司希望在今年年底之前将这两种​​飞行引擎交付给联合发射联盟，尽管这似乎越来越成为一个“延伸”的目标。交付可能会推迟到 2022 年初。为了赶上这个截止日期，Blue Origin 计划采取有点冒险的步骤，在完成全面的资格测试之前将发动机运送给客户。这个交付已经很长时间了。联合发射联盟 (ULA) 于 2014 年首次同意从 Blue Origin 购买发动机。这是太空发射领域的蓝血动物 ULA 对市场新进入者的大胆赌注。但是对于 BE-4 发动机，Blue Origin 创始人杰夫·贝索斯 (Jeff Bezos) 承诺是一种相对低成本、高性能的发动机，其功率输出可与航天飞机主发动机相媲美。在达成初步协议时，蓝色起源表示 BE-4 将在 2017 年“准备好飞行”。BE-4 的延迟开发越来越引起人们浓厚的兴趣。这部分是因为 ULA 多年来一直致力于其新型 Vulcan 火箭，而该火箭对该公司的未来很重要。军方也渴望这种交付，因为 ULA 是与 SpaceX 一起向国防部提供发射服务的主要供应商。他们希望 Vulcan 为美国制造的发动机提供更低成本的发射服务。最后，太空界的许多人真的对延迟的原因感到好奇。然而，尽管有这种广泛的兴趣，Blue Origin 几乎没有公开谈论引擎的开发。因此，这个故事试图为 BE-4 发动机迟到的原因提供一些背景。它基于公司总部的匿名消息来源以及行业官员，其中一些人如果被点名可能会被解雇。针对本文提出的问题，Blue Origin 的发言人 Linda Mills 只提供了一句话的答复。 “我们有望在今年交付发动机，”她说。根据这些消息来源，将交付给 ULA 的飞行引擎没有。 1 和没有。 2、尚未完全组装。但是大部分组件都是构建的。好消息是 Blue Origin 认为它已经消除了所有重大的技术风险。工程师已经测试了 BE-4 发动机的配置接近于飞行发动机的配置，并且它在接近火神第一阶段发射的占空比的热点火期间表现良好。\nBlue Origin 目前的计划包括今年秋天在德克萨斯州范霍恩附近的工厂测试另外两个开发引擎。这些接近但不是 BE-4 引擎的最终版本。经过这些测试，一个完全组装的飞行发动机没有。 1 号将被运往德克萨斯州进行一轮相当简短的测试，称为验收测试。如果这台发动机按预期通过，它将被运送到 ULA。然后一个几乎完全相同的 BE-4 发动机将从肯特发送到德克萨斯。这种“合格”发动机将接受更为严格的一系列测试，称为资格测试。这个想法是推动引擎通过它的步伐来发现任何缺陷。然后类似的过程将遵循飞行引擎编号。 2，然后是第二个“质量”引擎。风险在于，ULA 将在完整的资格测试完成之前收到飞行引擎。即使 ULA 将发动机与其第一枚 Vulcan 火箭集成以进行测试并最终在 2022 年下半年发射，但 Blue Origin 的测试台上的认证工作仍将进行。因此，如果 Blue Origin 在最后一刻发现 BE-4 的问题引擎，ULA 可能不得不放松其在最终 Vulcan 开发方面的工作。 “这是一种以成功为导向的方法，但它肯定会适得其反，”一位消息人士告诉 Ars。", "note_en": "After more than four years of frustrating delays, Blue Origin is finally making significant progress toward completing development of its powerful BE-4 rocket engine. At present, engineers and technicians with the company are assembling the first two flight engines at  Blue Origin&#39;s main factory in Kent, Washington.\n  The company aspires to deliver these two flight engines to United Launch Alliance before the end of this year, although that increasingly appears to be a &#34;stretch&#34; goal. Delivery may slip into early 2022. And in order to make this deadline, Blue Origin plans to take the somewhat risky step of shipping the engines to its customer before completing full qualification testing.\n This delivery has been a long time coming. United Launch Alliance, or ULA, first agreed to buy the engines from Blue Origin back in 2014. It was a bold bet by ULA, a blueblood in space launch, on a new entrant to the market. But with the BE-4 engine, Blue Origin founder Jeff Bezos was promising a relatively low-cost, high performing engine with a power output comparable to a Space Shuttle main engine. At the time of this initial agreement, Blue Origin said the BE-4 would be &#34;ready for flight&#34;  by 2017.\n The BE-4&#39;s delayed development has, increasingly, been the subject of keen interest. This is partly because ULA has been working on its new Vulcan rocket for a number of years, and that rocket is important to the future of the company. The military is also eager for this delivery, as ULA is a primary provider of launch services to the Department of Defense alongside SpaceX. They hope Vulcan provides lower cost launch services with engines manufactured in the United States. Finally, many in the space community are genuinely curious about the cause of the delay.\n Despite this widespread interest, however, Blue Origin has said almost nothing publicly about the engine development. Therefore, this story attempts to provide some context for why the BE-4 engines are late. It is based on anonymous sources at the company&#39;s headquarters as well as industry officials, some of whom would likely be fired if they were named.\n    In response to questions for this article, a spokeswoman for Blue Origin, Linda Mills, offered only a single-sentence reply. &#34;We’re on track to deliver the engines this year,&#34; she said.\n   According to these sources, the flight engines to be delivered to ULA, no. 1 and no. 2, are not yet fully assembled. But most of the components are built. The good news is that Blue Origin believes it has retired all of the significant technical risks. Engineers have already tested the BE-4 engine in a configuration close to that of the flight engines, and it has performed well during hot firings that approximate the duty cycle of a Vulcan first stage launch.\n  Blue Origin&#39;s current plan involves testing two more development engines at its facility near Van Horn, Texas, this fall. These are close to, but not  the, final version of the BE-4 engine.\n After these tests, a fully assembled flight engine no. 1 will be shipped to Texas to undergo a fairly brief round of tests, known as acceptance testing. If this engine passes, as expected, it will be shipped to ULA. Then a virtually identical BE-4 engine will be sent from Kent to Texas. This &#34;qual&#34; engine will undergo a much more rigorous series of tests, known as qualification testing. The idea is to push the engine through its paces to find any flaws. Then a similar process will follow with flight engine no. 2, followed by a second &#34;qual&#34; engine.\n The risk is that ULA will receive the flight engines before the full qualification testing is complete. This qualification work on Blue Origin&#39;s test stands will be occurring even as ULA integrates the engines with its first Vulcan rocket for testing and ultimately a launch during the second half of 2022. So if Blue Origin finds a last-minute issue with the BE-4 engine, ULA may have to unwind its work on final Vulcan development.\n &#34;This is a success oriented approach, but it could definitely backfire,&#34; one source told Ars.", "posttime": "2021-08-06 02:42:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "blue,origin,发动机", "title": "Blue Origin 强大的 BE-4 引擎晚了四年多——这就是原因", "title_en": "Blue Origin’s powerful BE-4 engine is more than four years late–here’s why", "transed": 1, "url": "https://arstechnica.com/?p=1785176", "via": "", "real_tags": ["blue", "origin", "发动机"]}]