[{"category": "", "categoryclass": "", "imagename": "0ac0758f7d5e9227ddfaa181ac23c553.jpg", "infoid": 1011909, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "工作岗位正在发生变化，而大流行加快了这一步伐。无论你是第一次进入职场，还是需要转型和再培训，基于技能的教育都可以让你走上职业需求旺盛的快车道。探索你的选择，寻找新的东西。", "note_en": "Jobs are changing — and the pandemic has accelerated the pace. Whether you’re entering the workforce for the first time or need to pivot and retrain, skills-based education can put you on the fast track to an in-demand career. Explore your options to find something new.", "posttime": "2020-07-15 07:51:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "政府,admin,职业", "title": "特朗普政府推出关于就业培训和机会的新竞选活动", "title_en": "Trump Admin launch FindSomethingNew campaign about job train and opportunities", "transed": 1, "url": "https://findsomethingnew.org/", "via": "", "real_tags": ["政府", "admin", "职业"]}, {"category": "", "categoryclass": "", "imagename": "134822de0555e0e638bb7eb3cac2c010.jpg", "infoid": 1011908, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2017年10月，罗布·韦里克(Rob Weryk)在犹他州普罗沃市万豪酒店(Marriott)的酒店房间里发现了一个星际物体。韦里克是夏威夷大学的天文学家和博士后研究员，他来镇上参加美国天文学会行星科学部的第四十九次会议。一天早上，在出发去参加一天的演讲之前，他打开笔记本电脑，浏览了他从毛伊岛哈利卡拉天文台(Haleakala Observatory)上的一台名为Pan-的望远镜下载的数据，该望远镜位于毛伊岛的哈利卡拉天文台(Haleakala Observatory)。这架全景望远镜凝视着广阔的夜空，寻找随着时间的推移而发生的变化。特殊的软件会标记任何移动的内容以供审查。\n韦里克注意到，在10月19日，探测到了一些新的东西。从视觉上看，它是无法解释的-图像中的一个点，或者可能是噪音。尽管如此，一旦发现了移动，就有可能回到过去，在预先发现或“预先发现”的数据中定位它。韦里克利用这些先前的观测重建了该物体的飞行路线。它的行为很奇怪：与太阳系中的其他一切不同，从尘埃到木星，它似乎没有受到太阳的引力束缚。当他调查时，一幅令人惊叹的画面浮出水面。长周期彗星与我们的太阳系几乎没有联系，它们可能会以每秒一到两公里的速度移动。这个物体以二十六度的速度飞行。\n他让欧洲的一位同事来看一下。他还联系了位于夏威夷大岛的加拿大-法国-夏威夷望远镜的天文学家，他们将该天体的坐标添加到了望远镜第二天晚上应该看到的目标名单中。他写信给其他望远镜的个别主管，解释为什么该天体值得观察。一个团队和一个共识出现了，世界各地的学者用他们的望远镜研究现在几乎可以肯定是第一个观察到的进入我们太阳系的星际物体。他们把它命名为“Oumuamua”，这是一个夏威夷语单词，意思是“童子军”。\n两年后，在加利福尼亚州帕萨迪纳的喷气推进实验室，一位名叫兰迪·韦森(Randii Wessen)的航天工程师站在一个名为Left Field的房间里，面前是一块墙壁大小的白板。面对他的是18名研究人员--行星科学家、天体物理学家、工程师--大多数都是二十几岁的年轻人，都是研究生或博士后。61岁时，韦森秃顶，留着胡子，身材苗条，他在旅行者号和卡西尼号太空探测器上工作。他现在是J.P.L.所谓的A-Team的首席研究架构师，A-Team是一个负责实验室创新铸造厂早期太空任务概念规划的小组。(这个团队的名字既是以任务架构的纪律命名的，也是以20世纪80年代关于一支出色的行善雇佣兵团队的电视节目命名的。)。太阳系中数十万个已识别的物体中没有两个是完全相同的；每个物体都必须根据自己的特点进行探测。因此，成功的任务出现在事实证明的和幻想的交汇之处。探索木星的火山卫星木卫一的最好方式可能是轨道器，但也可能是熔岩船。通常，这些疯狂的、可能奏效的解决方案开始于韦森的白板。\n这些年轻的研究人员在那里是该机构一年一度的行星科学夏季研讨会的一部分，该研讨会是一个旨在教导不同领域的科学家如何合作计划前往其他世界的任务的项目。在抵达帕萨迪纳之前，他们已经参加了11次每周一次的电话会议，由任务发展的各个方面的专家讲授。在斯莱克和电话中，他们就不同的假设探索目标进行了辩论。最终，他们决定拦截和检查一个类似于奥穆阿美亚的星际物体--这是一项不同于以往任何尝试的任务。在帕萨迪纳，在研讨会的最后一次会议期间，他们希望设计一种能够确定这样一个物体来自哪里，以及它是否包含生命的基本组成部分的航天器。然后，他们将把他们的任务计划和航天器设计提交给一个由负责拆解它的太空探索老兵组成的审查小组。\n“所以你真的要试着找出这个东西是从哪个系统来的？”韦森问这群人。在黑板上，他写下了问题：“该天体来自哪个恒星或恒星形成区域？”他戏剧性地凝视着他所写的东西。“我甚至不知道你会怎么做，”他说。\n布朗大学行星科学博士生杰西·塔纳斯(Jesse Tarnas)说：“通过三种不同的同位素测量、轨迹信息和金属丰度。”“我认为潜在地限制它可能来自的核心集群是可行的。”\n“40亿年前？”韦森问道。“你认为从那时起它就是直线发展的吗？”\n这些设计在一个看起来像高中计算机科学教室的地方汇聚在一起。白板安装在拥挤的一排排计算机工作站的上方；每个监视器顶部的一个小标志表示特定的任务元素-“命令和数据系统”、“热能”、“机械”、“电力”、“成本”、“电信”、“推进”等。在房间的前面，一个小牌子勾勒出伊丽莎白·库布勒-罗斯的五个悲痛阶段。凯斯解释说，设计航天器子系统还涉及否认、愤怒、讨价还价、沮丧和接受。权衡是痛苦的。携带太多科学仪器，你会耗尽电力；增加太多热保护，你会限制发射能力；收集太多数据，你将无法存储或返回地球。金钱也是有限度的：野心必须与节俭相权衡。“你不会想当扁平松鼠的，”凯斯说。“那就是那只不能做决定的松鼠。”必须深思熟虑、果断而连贯地进行权衡。\n在帕萨迪纳市中心万豪酒店(Marriott Courtyard)的一间会议室里，研讨会参与者面临着这些复杂的问题。在与韦森和A团队进行了两天的会议后，哈佛大学行星科学博士生、该任务的负责人金伯利·摩尔(Kimberly Moore)开始问自己，是否有可能与星际物体会合。当时是10点45分，摩尔和其他研究人员聚集在连体桌子周围，桌上散落着电涌保护器、啤酒瓶和咖啡杯，他们坐在笔记本电脑前，拿出关于长周期彗星的论文，这些彗星每隔几个世纪就会摆动到地球附近。几乎可以肯定的是，这样的彗星会比星际物体或I.S.O更慢，更容易预测。追逐其中一颗会更好吗？是否真的有可能充分回答I.S.O.是否含有有机化合物的问题？\n摩尔说：“我不清楚我们是否能提出星际物体的任务，并以我们现在拥有的技术地位获得有价值的科学。”“尽管I.S.O.是华而不实的，但我不想继续执行一个半生不熟、提议软弱的任务。”\n也许证明截获I.S.O是不可信的本身就很有价值。“零结果仍然很重要，”卷发大气化学家亚历山大·塞伦(Alexander Thelen)指出。“这样人们就不需要重新发明轮子了。”\n从失败中获得成功是太空探索的一种传统。1989年，就在伽利略太空探测器离开地球开始木星之旅后，其一侧的高增益天线未能完全打开其16英尺的直径。没有它，任何数据都无法发回。J.P.L.的工程师们找到了使用咖啡罐大小的低增益天线的方法；在接下来的13年里，伽利略发现了木卫三--已知的唯一颗拥有磁场的卫星--证实了欧罗巴内部存在咸水海洋，并目睹了一颗名为休梅克-列维9号(Shoemaker-Levy 9)的彗星坠入木星大气层。\n“哦，见鬼，”桌子下面有人说。一瓶水被打翻了，正在倒进摩尔笔记本电脑的键盘里。摩尔把它捡起来，倾斜了一下，水从旁边流了出来。她转向西南研究所(Southwest Research Institute)的研究人员克里斯蒂·莱拉(Kristie Llera)，询问她关于智利的大型天气观测望远镜(Large SYNOTIONAL Survey Telescope)的情况，以及它如何才能实现他们正在努力起飞的任务。\n到了早上，团队已经决定坚持星际物体计划。即使是机器人任务也是人类企业；研究人员想要做一些令人兴奋的事情，之前没有人拦截过I.S.O。他们在9点左右到达X团队设计中心。摩尔和将领导设计阶段的地球物理学家塞缪尔·库维尔(Samuel Courville)坐在房间前面的一张桌子旁；其他研究人员坐在他们指定的工作站上，每个人旁边都有一名Team X工程师。\n摩尔站起来，用PowerPoint带领团队完成了这项任务，他们称之为通向星星的桥梁。他们的目标是拦截一个快速移动的星际物体，并对其进行探测。通过这样做，他们希望确定生命的基石是否分散在不同的恒星系统中，其他系统是否在化学上与我们的相似，以及它们是否以与我们相同的方式形成。在探测到星际访客后，他们会迅速评估它，然后在六个月内发射，在小行星带和太阳之间的某个地方进行接触。然后，他们的航天器将发射一个“撞击器”-一种特殊设计的投射物-任务是撞击物体，并将其微小的碎片炸向太空。(经过长时间的讨论，团队成员才就计划的这一方面达成一致。)。航天器会将仪器对准喷射物，研究其成分，寻找生命所必需的成分。C\nX团队的首席工程师阿尔弗雷德·纳什(Alfred Nash)戴着眼镜，留着马蹄形胡子，在一旁看着。他开始带领团队讨论技术困难。“为什么会有比平均更高的可能性不起作用呢？”他问。\n“目标位置，”查尔斯·布德尼(Charles Budney)回答说，他是一名实验航天器工程师，也是研讨会的两名长期教官之一。“对我们来说，在没有--的情况下机动就位已经够难的了。”\n“对不起，”纳什说，打断了他的话。“我刚刚有了一个惊人的想法。为什么我们不像他们在空军做的那样，用激光喷漆，利用瞄准技术呢？“。2005年，同样由J.P.L.设计的一项名为深度撞击(Deep Impact)的任务曾使用这样的系统向一颗小行星发射了类似的撞击器。\n“但是深度撞击天体要大十倍，慢十倍，”摩尔说。\n纳什点了点头，不慌不忙。“我们有355分钟的优质上场时间，”他说。“我知道你们都能胜任这项任务。”\n在项目设计中心，决策从房间前面向外流动。首席调查员--在本例中是摩尔，由库维尔担任项目管理和“捕获领导”--做出的选择首先到达“成本”站，然后到达代表航天器所有其他部件的站。随着时间的推移，所有的电台都会互动。推进与动力对话，热能与仪器谈判，引导与成本对话。成本团队通过安排与其他加油站之间的交易来找到所需的资金。房间里闷热难耐，空调坏了。随着成本和质量的波动，设计中心获得了交易大厅的嘈杂、紧张的氛围。\n在隔壁的房间里，行星科学研究生诺亚·哈蒙德(Noah Hammond)和X团队工程师斯蒂芬·克拉奇(Stephen Krach)站在一起。他们一直在研究宇宙飞船的计算机模型，遇到了一个棘手的问题。由于一块喷射物可能会摧毁他们的探测器，研究小组决定以他们所说的“弯管”模式操作它：不是存储数据并一次性返回，而是在会合后，信息在进入地球时被流式传输回地球。要实现这一点，航天器的天线需要一直固定在地球上。同时，仪器必须面向物体，太阳能电池板必须面向太阳。因此，天线需要能够向任何方向旋转，在一个轴上旋转360个自由度，并在万向节上增加机动性。\n这个复杂的设计已经变得很难在电脑屏幕上可视化和操纵，所以哈蒙德和克拉奇退到了隔壁房间的乐高积木储藏室。哈蒙德把手伸进一个透明的塑料垃圾箱，捡起砖块，开始把它们拼凑在一起。慢慢地，他用蓝色、红色、白色和黄色的积木建造了天线、吊杆组件和方形主体，以及它的太阳能电池板、助推器和相机。为\n.", "note_en": "In October of 2017, Rob Weryk discovered an interstellar object in his hotel room at the Marriott in Provo, Utah. Weryk, an astronomer and postdoctoral fellow at the University of Hawaii, was in town for the forty-ninth meeting of the American Astronomical Society’s Division for Planetary Sciences. One morning, before heading off for a day of presentations, he opened his laptop to go through data he had downloaded from a telescope called Pan- , which is situated at the Haleakala Observatory, on Maui. The panoramic telescope stares fixedly at vast fields of the night sky, searching for changes over time. Special software flags anything that moves for review.\n  Weryk noticed that, on October 19th, something new had been detected. Visually, it was uninterpretable—a dot, or maybe noise in the image. Still, once the movement had been spotted, it was possible to go back in time, locating it in the pre-discovery, or “precovery,” data. Weryk used these previous observations to reconstruct the object’s flight path. It behaved oddly: unlike everything else in the solar system, from dust motes to Jupiter, it didn’t seem gravitationally tethered to the sun. As he investigated, an astonishing picture emerged. Long-period comets, which are just barely bound to our solar system, might move at one or two kilometres per second. This object was travelling at twenty-six.\n He asked a colleague in Europe to take a look. He also contacted astronomers at the Canada-France-Hawaii Telescope, on the Big Island of Hawaii, who added the object’s coördinates to the list of targets the telescope should view the following night. He wrote to the individual directors of other telescopes, explaining why the object merited observation time. A team and a consensus grew, with scholars around the world using their telescopes to study what was now almost certainly the first interstellar object to be observed entering our solar system. They named it  ‘Oumuamua—a Hawaiian word meaning “scout.”\n  Two years later, at the Jet Propulsion Laboratory, in Pasadena, California, an astronautical engineer named Randii Wessen stood before a wall-sized whiteboard in a room called Left Field. Facing him were eighteen researchers—planetary scientists, astrophysicists, engineers—most in their mid-twenties, all graduate students or postdocs. Bald, bearded, and trim at sixty-one, Wessen worked on the Voyager and Cassini space probes. He is now the lead study architect of J.P.L.’s so-called A-Team—a group in charge of early space-mission concept planning at the lab’s Innovation Foundry. (The team is named both for the discipline of mission architecture and for the nineteen-eighties TV show about a crack team of do-gooding mercenaries.) No two of the hundreds of thousands of identified objects in the solar system are exactly alike; each must be explored according to its own characteristics. Successful missions, therefore, emerge from the spot where the proved and the fantastic intersect. The best way to explore Io, Jupiter’s volcanic moon, could be an orbiter, but it could also be a lava boat. Often, these so-crazy-they-might-work solutions begin on Wessen’s whiteboards.\n The young researchers were there as part of the agency’s annual Planetary Science Summer Seminar—a program designed to teach scientists in disparate fields how to work together to plan missions to other worlds. Before arriving in Pasadena, they had attended eleven weekly teleconferences taught by experts on every aspect of mission development. On Slack and over the phone, they had debated different targets of hypothetical exploration. They had settled, finally, on the idea of intercepting and inspecting an ‘Oumuamua-like interstellar object—a mission unlike any   had attempted. In Pasadena, during the seminar’s final meetings, they hoped to design a spacecraft capable of determining where such an object came from and whether it contained the basic components of life. They would then present their mission plan and spacecraft design to a review panel of space-exploration veterans charged with tearing it apart.\n  “So you’re actually going to try to figure out which system this thing came from?” Wessen asked the group. On the board, he wrote out the question: “Which star or star-forming region did the object originate from?” He gawked theatrically at what he had written. “I don’t even know how you would do that,” he said.\n “With three different isotope measurements and the trajectory information and the metallicity,” Jesse Tarnas, a doctoral candidate in planetary science from Brown University, said. “I think it is feasible to potentially constrain the core cluster that it might have come from.”\n “Four billion years ago?” Wessen asked. “And you think it went in a straight line since then?”\n “No,” Tarnas said. “But, look, you characterize three different isotopic compositions. . . .” He outlined a strategy: use telescopes to deduce, from the light reflecting off and absorbed by the object, which metals it was made from; match those observations with stars along its trajectory; make an educated guess about its system of origin.\n From the back of the room, another member of the A-Team—one of a dozen observers—voiced her skepticism. “It’s really going to be hard to do that,” she said. “And if you go to   and say that, and there’s anybody in the exoplanet community there, they’re going to tell you that objective is not going to work.” Since the beginning of the seminar, experts at J.P.L. had been explaining to the researchers just how difficult their mission would be. Finding a target was the first challenge: even assuming, optimistically, the discovery of one interstellar object per year, the team might have to wait twenty years for a candidate with the right speed and trajectory. It would be impossible, moreover, to know in advance what the object was or how it might behave. It could be an inert husk speeding through space; alternatively, frozen and comet-like, it might awaken with heat of the sun, spewing gas, dust, ice, and grains fatal to any approaching probe. After discovering the object, mission planners would have just a few weeks to decide whether to launch.\n In Left Field, Wessen and the researchers worked their way through these complexities and others. Eight hours later, the big whiteboard—fifty feet wide, and stretching from ceiling to floor—was filled with dry-erase marker. The next day, six rolling whiteboards were covered, too.\n The Planetary Science Summer Seminar exists because  ’s budget is small relative to the costs of space exploration. As a result, the agency makes no exploration decisions unilaterally; it crowd-sources its ideas from the planetary-science community. When funding permits, it issues “announcements of opportunity” to American laboratories, universities, and corporations, asking for their ideas. Submitting institutions launch their own internal competitions; the best proposals, which arrive at   headquarters by the dozens, are then “competed” against each other, “downselected” to a handful for further development, and narrowed to a final duo for a head-to-head competition. If a spacecraft and mission are selected, hundreds of millions of dollars will flow to the winning team, and careers and lives will be transformed. Many planetary scientists spend decades trying to get something off the ground, and most fail to do so.\n Actual mission proposals run thousands of pages; developing one requires years of work and significant research funding. Students at the seminar experience the process in miniature. They create a “science traceability matrix”—a document showing how a mission’s objectives, hypotheses, instruments, and trajectory fit together as a seamless whole. In designing their spacecraft, they use the same software and methodologies that are employed in real multibillion-dollar flight projects. In the end, they deliver their presentation to some of the same decision-makers who evaluate full-scale proposals. While summer-seminar missions don’t take flight, they contribute to the slow refinement of concepts across decades. The work regularly yields papers published in peer-reviewed journals, and the instructors are often developing missions themselves. (Karl Mitchell, who teaches at the summer school, is also the project scientist on  Trident, a Triton mission currently in competition for   selection.)\n  When participants arrive at J.P.L.’s campus, they find that it consists of about a hundred buildings, great and small, clustered along the San Gabriel mountains. In the cavernous high bays, spacecraft are built; in the outdoor Mars Yard, rovers are tested on simulated Martian terrain. The Space Flight Operations Facility is the mission control center for spacecraft across the solar system; it receives trajectory and science data from far-off probes and sends instructions back. Engineers call it the Center of the Universe.\n  Building 301, where the Innovation Foundry is situated, is more nondescript. It contains cubicles, conference rooms, water coolers, and offices for the planning-focussed A-Team and another group, Team X, which specializes in spacecraft design. In Wessen’s office, a globe of the moon sits near a plastic alien skull; a copy of “The Ten Special Commandments for a Would-Be Planet Hunter,” signed by its author, Clyde Tombaugh, the discoverer of Pluto, hangs on the wall, near a signed scientific paper by Jan Oort, who hypothesized the existence of a cloud of comets and other space debris surrounding the solar system. From behind his desk, Wessen explained that winning mission approval is not a purely scientific endeavor. Many of those charged with judging mission proposals lack any scientific background; they are political appointees, accountants, managers, and engineers. Planners can’t justify the inclusion of a thermal infrared spectrometer on the basis of its noteworthy wavelength range alone; they must also explain to an accountant why the device is cost-effective. Ultimately, Wessen said, the only way to sell a highly technical mission to stakeholders with diverse, often non-technical backgrounds is to tell a story. At the summer seminar, he cites the storytelling model used by the film studio Pixar, whose tales are conceptualized through a six-step process:\n  At the seminar, Wessen helps the researchers refine their stories. Spacecraft design is next. Kelley Case, the head of the Innovation Foundry’s Concept Office, led me down the hall and into the Team X project design center. Blond and bespectacled, Case, who is almost entirely unknown outside of J.P.L., is one of the most influential leaders in American space exploration. As the lab’s “concept design methods chief,” her job is to help refine and improve proposed spacecraft designs. Her team has worked on “cubesats” (car-sized satellites that are miniaturized into briefcases), rovers built to explore lunar tunnels, and probes tasked with searching for life within the plumes of Enceladus, the Saturnian moon that is blasting its interior ocean into space. In 2019,  ’s  Mars Cube One cubesats, conceived in the Innovation Foundry, proved revolutionary when, during a series of high-precision Martian flybys, they relayed data back to Earth while the InSight lander was touching down on the planet. The project’s advances in miniaturization could make future deep-space missions an order of magnitude less expensive. In 2022, the Innovation Foundry will launch its next major spacecraft, which will explore the metal asteroid Psyche, believed to be the core of an ancient, obliterated protoplanet.\n Such designs come together in what looks like a high-school computer-science classroom. Whiteboards are mounted above crowded rows of computer workstations; a small sign atop each monitor designates a particular mission element—“command and data systems,” “thermal,” “mechanical,” “power,” “cost,” “telecom,” “propulsion,” and so on. At the front of the room, a small sign outlines Elisabeth Kübler-Ross’s five stages of grief. Designing a spacecraft subsystem, Case explained, also involves denial, anger, bargaining, depression, and acceptance. The trade-offs are painful. Carry too many scientific instruments, and you drain power; add too much thermal protection, and you limit launch capacity; collect too much data, and you’ll have no way to store it or return it to Earth. Money is a limit, too: ambition must be weighed against thrift. “You don’t want to be the flat squirrel,” Case said. “That’s the squirrel that couldn’t make a decision.” Trade-offs must be made thoughtfully, decisively, and coherently.\n In a conference room at the Marriott Courtyard, in downtown Pasadena, the seminar participants were confronting these complexities. After two days of meetings with Wessen and the A-Team, Kimberly Moore, a Ph.D. candidate in planetary science at Harvard and the leader of the mission, had begun asking herself whether a rendezvous with an interstellar object was even possible. It was 10:45   Moore and the other researchers, gathered around conjoined tables littered with surge protectors, beer bottles, and coffee cups, were at their laptops, pulling up papers on long-period comets, which swing near to Earth once every several centuries. Almost certainly, such a comet would be slower and more predictable than an interstellar object, or I.S.O. Would it be better to go after one of those? Was it really possible to adequately answer the question of whether an I.S.O. contained organic compounds?\n “It’s not clear to me that we could propose a mission to an interstellar object and get worthy science with the technological status that we have now,” Moore said. “Even though I.S.O.s are flashy, I don’t want to go ahead with a mission that has a half-baked and a weak proposal.”\n Perhaps proving the implausibility of an I.S.O. interception was valuable in itself. “A null result is still important,” Alexander Thelen, a curly-haired atmospheric chemist, pointed out. “It makes it so people don’t have to reinvent the wheel.”\n Wringing success out of failure is something of a tradition in space exploration. In 1989, just after the Galileo space probe had left Earth and started its trip to Jupiter, the high-gain antenna on its side failed to open to its full, sixteen-foot diameter. Without it, no data could be sent back. Engineers at J.P.L. found a way to use its coffee-can-sized low-gain antenna instead; over the next thirteen years, Galileo discovered a magnetic field within Ganymede—the only moon known to possess one—confirmed the existence of a saltwater ocean inside Europa, and watched a comet, Shoemaker-Levy 9, plunge into the Jovian atmosphere.\n “Oh, shit,” somebody said, from down the table. A bottle of water had been knocked over and was emptying itself into the keyboard of Moore’s laptop. Moore picked it up and tilted it, so that water flowed from the side. She turned to Kristie Llera, a researcher at the Southwest Research Institute, and asked her about the Large Synoptic Survey Telescope, in Chile, and how it might enable the mission they were trying to get off the ground.\n  By morning, the team had decided to stick with the interstellar-object plan. Even robotic missions are human enterprises; the researchers wanted to do something exciting, and no one had intercepted an I.S.O. before. They arrived at the Team X design center at around nine. Moore and Samuel Courville, the geophysicist who would be leading the design phase, sat at a table at the front of the room; the other researchers sat at their designated workstations, each next to a Team X engineer.\n  Moore stood and, using PowerPoint, walked the group through the mission, which they called Bridge to the Stars. Their goal was to intercept a fast-moving interstellar object and probe it. By doing so, they hoped to determine whether the building blocks of life were dispersed among different star systems, whether other systems were chemically similar to our own, and whether they had formed in the same way as ours. After detecting an interstellar visitor, they’d evaluate it quickly, then launch within six months, making contact somewhere between the asteroid belt and the sun. Their spacecraft, in turn, would then launch an “impactor”—a specially designed projectile—tasked with smashing into the object and blasting tiny fragments of it into space. (The team members had agreed on this aspect of the plan only after a lengthy discussion.) The spacecraft would point its instruments at the ejecta, studying its composition, searching for the ingredients necessary for life. Considering the speeds involved, the uncertain nature of the object itself, and the danger posed by debris to a spacecraft, the plan was ambitious. But, Moore concluded, the science was sound. The weak point was the impactor. “We talked about this last night,” Moore said. “The only way to make this work is with an impact. We’re open to anything. We just want to hit the target.”\n Alfred Nash, the lead engineer of Team X, looked on from behind glasses and a horseshoe mustache. He began leading the team through a discussion of the technical difficulties. “Why is there a better-than-even chance it won’t work?” he asked.\n “The targeting positions,” Charles Budney, an experimental-spacecraft engineer, and one of the seminar’s two permanent instructors, replied. “It’s hard enough for us to maneuver into position without—”\n “Sorry,” Nash said, interrupting. “I just had an amazing thought. Why don’t we just do what they do in the Air Force and paint it with a laser and utilize targeting technology?” In 2005, a mission called Deep Impact, also designed by J.P.L., had used such a system to launch a similar impactor at an asteroid.\n “But the Deep Impact object was ten times bigger and ten times slower,” Moore said.\n  Nash nodded, unfazed. “We have three hundred and fifty-five quality minutes,” he said. “I know you’re all up to the task.”\n In the project design center, decisions flow outward from the front of the room. A choice made by the principal investigator—Moore, in this case, with Courville as the project management and “capture lead”—travels first to the “cost” station, then to the stations representing all the other components of the spacecraft. Over time, all the stations interact. Propulsion talks to power; thermal negotiates with instruments, and guidance with cost. The cost team finds the money it needs by arranging trades with and among the other stations. The room was sweltering; the air-conditioning wasn’t working. As cost and mass fluctuated, the design center acquired the noisy, stressed-out atmosphere of a trading floor.\n  In an adjacent room, Noah Hammond, a graduate student in planetary science, stood with Stephen Krach, a Team X engineer. They had been working on a computer model of the spacecraft and had encountered a thorny problem. Because of the risk that a piece of ejecta could obliterate their probe, the team had decided to operate it in what they called “bent pipe” mode: rather than store data and return it all at once, after the rendezvous, information would be streamed back to Earth as it came in. For this to work, the spacecraft’s antenna would need to be fixed on Earth at all times. Meanwhile, the instruments would have to face the object, and the solar panels would have to face the sun. The antenna, therefore, would need to be able to turn in any direction, rotating through three hundred and sixty degrees of freedom on one axis, with added maneuverability on a gimbal.\n The complex design had grown hard to visualize and manipulate on a computer screen, and so Hammond and Krach had retreated to the Lego stash in the next room. Hammond plunged his hands into a clear plastic bin, scooping up blocks, which he began snapping together. Slowly, out of blue, red, white, and yellow blocks, he built the antenna; the boom assembly; and the square-shaped main body, with its solar panels, boosters, and camera. For \n......", "posttime": "2020-07-15 07:49:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "航天,space,任务", "title": "如何规划航天任务", "title_en": "How to Plan a Space Mission", "transed": 1, "url": "https://www.newyorker.com/tech/annals-of-technology/how-to-plan-a-space-mission", "via": "", "real_tags": ["航天", "space", "任务"]}, {"category": "", "categoryclass": "", "imagename": "c2bf77afb208192bd87bccf523c0c072.jpg", "infoid": 1011907, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如今，找到一台像样的Linux笔记本电脑很容易，但要找到一台不花地球钱的笔记本电脑就有点难了。\n戴尔(Dell)和联想(Lenovo)等大牌品牌为难以击败的高端强国提供服务。但越来越多的Linux专用笔记本电脑供应商销售价格适中、同样有吸引力的设备。\n像Slimbook、Entroware和Star Labs这样的公司提供价格有竞争力、规格良好的Linux驱动的个人电脑、笔记本电脑和敞篷车，以满足“工作站”以外的需求。\n-如果‘Star Labs’这个名字听起来很耳熟，那可能是因为你读过我的指南，关于使用Star Labs GTK和图标主题来给普通的Ubuntu一个全新的电子外观。\nStar Labs Lite Mk III是一款小巧、功能齐全的Linux笔记本电脑，非常适合移动计算或基于沙发的工作效率。\nLite Mk III的规格相当不错(请看对面的表格，如果你在一个刮板网站上阅读，你是看不到的)。\nLite Mk III拥有11.6英寸IPS显示屏，带防反射涂层(ARC)和全高清分辨率。\n如今，配备11.6英寸显示屏的Linux笔记本电脑并不多，全高清的就更不用说了。虽然13英寸以下的尺寸(通常来说)被认为很小，但如果没有其他因素的话，舒适的外形因素确实是一种独特的与众不同之处。\n英特尔奔腾N5000处理器是这款小型设备的核心。这款14纳米的四核芯片速度足够快，突发频率高达2.7 GHz，并吹捧集成的英特尔超高清605显卡。\n8 GB的2400 MHz内存将提供快速的全方位体验-是的，即使是在ubuntu😉上也是如此。基本配置附带240 GB“超配”固态硬盘，顺序读取速度最高可达560MB/s，不过，您可以使用近1 TB的固态硬盘来实现最大存储容量，以获得更高的价格。\n您将获得一个用于充电、数据传输和视频输出的多功能USB Type C端口；一个传统USB端口；一个微型HDMI输出端口；3.5 mm耳机插孔；以及齐平MicroSD卡插槽。显然还有一个网络摄像头，但我找不到任何关于它的分辨率的细节。\n宽敞的键盘是背光的，没有去品牌的超级按键。触摸板是玻璃，便于触觉、精确输入。\nSTAR实验室还使用LVFS分发BIOS、嵌入式控制器和固态硬盘固件更新。他们的笔记本电脑还允许你禁用英特尔管理引擎(Yay)，如果你非常注重隐私，还可以禁用Wi-Fi和网络摄像头。\n这款售价426美元/GB的399 Linux笔记本电脑可以选择预装的Linux发行版，包括Ubuntu20.04LTS、Linux Mint20和Zorin OS 15.2。\n要了解更多详细信息，或为自己预订设备(8月开始发货)，请查看Star Labs网站上的产品页面(不是附属链接btw)。我写这篇文章是因为它看起来真的不错，而不是因为我得到了回扣)。", "note_en": "Finding a decent Linux laptop is easy these days, but finding one that doesn’t cost the earth is a little harder.\n  Big-name brands like  Dell and  Lenovo serve up hard-to-beat, high-end powerhouses. But a growing club of Linux-specific laptop vendors sell affordable and equally attractive devices.\n Companies like   Slimbook,   Entroware, and  Star Labs offer competitively priced, well spec’d Linux powered PCs, notebooks, and convertibles that cater to needs other than “workstation”.\n  —  If the name ‘Star Labs’ sounds familiar it might be because you read my guide on using the  Star Labs GTK and icon theme to give regular Ubuntu an electric new look.\n  The Star Labs Lite Mk III is a small, full-formed Linux laptop perfect for on-the-go computing or sofa-based productivity.\n The Lite Mk III specs are pretty decent (see the table opposite, which you won’t see if you’re reading from a scraper site).\n The Lite Mk III boasts a 11.6 inch IPS display with antireflective coating (ARC) and a full HD resolution.\n There aren’t many Linux laptops with a 11.6-inch display these days, much less ones at full HD. While sub 13-inch is (generally speaking) considered small the snug form factor does make for a unique differentiator, if nothing else.\n An  Intel Pentium N5000 processor sits at the heart of this diminutive device. This 14nm quad-core chip is speedy enough, boasts a burst frequency of up to 2.7 GHz, and touts integrated Intel UHD 605 graphics.\n  The 8 GB 2400MHz RAM will deliver a snappy all-round experience — yes even on Ubuntu 😉. The base config ships with a 240 GB “over provisioned” SSD card with a sequential read speed of up to 560MB/s, though you can max storage out with a near 1 TB SSD for more money.\n You get a versatile USB Type C port for charging, data transfer and video output; a pair of traditional USB ports; a micro HDMI out; 3.5 mm Headphone jack; and flush MicroSD card slot. There’s apparently a webcam too but I can’t find any details on the resolution of it.\n The roomy keyboard is backlit and lacks a de-branded  super key. The touchpad is glass for tactile, precise input.\n  Star Labs also the LVFS to distribute BIOS, Embedded Controller and SSD firmware updates. Their laptops also allow you to  disable Intel Management Engine (yay), plus Wi-Fi and the webcam if you’re super privacy-conscious.\n This $426/£399 Linux laptop is available to buy with a choice of pre-loaded Linux distro, including   Ubuntu 20.04 LTS,   Linux Mint 20, and   Zorin OS  15.2.\n For more details, or to pre-order the device for yourself (starts shipping August) check out the  product page on the Star Labs website (not an affiliate link btw. I’m writing about this because it genuinely looks good, not cos I get a kickback).", "posttime": "2020-07-15 07:48:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电脑,linux,星空,labs,笔记本电脑", "title": "星空实验室最新的Linux笔记本电脑很小，但外形完美", "title_en": "Star Labs’ Newest Linux Laptop Is Small but Perfectly Formed", "transed": 1, "url": "https://www.omgubuntu.co.uk/2020/07/starlabs-lite-mk-iii-linux-laptop", "via": "", "real_tags": ["电脑", "linux", "星空", "labs", "笔记本电脑"]}, {"category": "", "categoryclass": "", "imagename": "8b86ec3ca6c8246b526980fb39a3cf6a.jpeg", "infoid": 1011906, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "字母表公司(Alphabet Inc)的谷歌记录了人们在数十万个移动应用程序上的行为，即使他们遵循了该公司建议的停止此类监控的设置，这起诉讼在周二被指控为寻求集体诉讼地位。\n这起数据隐私诉讼是博伊斯·席勒·弗莱克斯纳律师事务所(Boies Schiller Flexner)在几个月内代表少数个人消费者对谷歌提起的第二起诉讼。该公司的客户还包括谷歌的竞争对手，如Facebook Inc.和甲骨文公司(Oracle Corp.)。\n圣何塞一家美国地区法院的新起诉书指控谷歌记录用户在新闻、叫车和其他类型的应用程序中查看的内容，违反了联邦窃听法和加州隐私法，尽管这些应用程序在谷歌账户设置中关闭了网络和应用程序活动跟踪。\n诉讼称，数据收集是通过谷歌的Firebase进行的，Firebase是一套在应用程序制造商中很受欢迎的软件，用于存储数据、发送通知和广告，以及跟踪故障和点击。FireBase通常在消费者看不见的应用程序内部运行。\n诉讼称，即使消费者听从谷歌自己的指示，关闭了对其隐私控制的网络应用活动跟踪，谷歌仍在继续拦截消费者的应用使用情况以及应用浏览通讯和个人信息的行为。(编者注：原文如此，原文为“Google&amp；App Activity on the Web&amp；App Activity on the Privacy Controls”)，诉讼称，即使消费者听从谷歌的指示，关闭了对其隐私控制的网络应用活动追踪，谷歌仍继续拦截消费者的应用使用情况以及应用浏览通讯和个人信息。\n诉讼称，谷歌使用Firebase的一些数据来改进其产品，并为消费者个性化广告和其他内容。\n路透社(Reuters)3月份报道称，美国反垄断调查人员正在调查谷歌是否通过有效地让Firebase变得不可避免，非法扼杀了广告和其他业务的竞争。\n在上个月的案件中，博伊斯·席勒·弗莱克斯纳(Boies Schiller Flexner)指控谷歌秘密记录Chrome浏览器用户的活动，即使他们启动了谷歌所谓的隐姓埋名模式。谷歌表示，将与这一指控进行抗争。\n点击“注册”，即表示您同意接收来自Business Insider的营销电子邮件以及其他合作伙伴优惠，并接受我们的服务条款和隐私政策。", "note_en": "Alphabet Inc&#39;s Google records what people are doing on hundreds of thousands of mobile apps even when they follow the company&#39;s recommended settings for stopping such monitoring, a lawsuit seeking class action status alleged on Tuesday.\n The data privacy lawsuit is the second filed in as many months against Google by the law firm Boies Schiller Flexner on behalf a handful of individual consumers. The firm&#39;s clients also have included Google competitors such as Facebook Inc and Oracle Corp.\n  The new complaint in a U.S. district court in San Jose accuses Google of violating federal wiretap law and California privacy law by logging what users are looking at in news, ride-hailing and other types of apps despite them having turned off &#34;Web &amp; App Activity&#34; tracking in their Google account settings.\n   The lawsuit alleges the data collection happens through Google&#39;s Firebase, a set of software popular among app makers for storing data, delivering notifications and ads, and tracking glitches and clicks. Firebase typically operates inside apps invisibly to consumers.\n &#34;Even when consumers follow Google&#39;s own instructions and turn off &#39;Web &amp; App Activity&#39; tracking on their &#39;Privacy Controls,&#39; Google nevertheless continues to intercept consumers&#39; app usage and app browsing communications and personal information,&#34; the lawsuit contends.\n Google uses some Firebase data to improve its products and personalize ads and other content for consumers, according to the lawsuit.\n Reuters reported in March that U.S. antitrust investigators are looking into whether Google has unlawfully stifled competition in advertising and other businesses by effectively making Firebase unavoidable.\n   In its case last month, Boies Schiller Flexner accused Google of surreptitiously recording Chrome browser users&#39; activity even when they activated what Google calls Incognito mode. Google said it would fight the claim.\n  By clicking ‘Sign up’, you agree to receive marketing emails from Business Insider as well as other partner offers and accept our  Terms of Service and  Privacy Policy.", "posttime": "2020-07-15 07:28:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,程序,谷歌,诉讼,slapped", "title": "谷歌刚刚遭到诉讼，声称它在数十万个应用程序上跟踪用户，即使他们选择退出", "title_en": "Google was just slapped with a lawsuit that claims it tracks people on hundreds of thousands of apps even when they opt out", "transed": 1, "url": "https://www.businessinsider.com/google-lawsuit-app-tracking-without-permission-reuters-2020-7", "via": "", "real_tags": ["google", "程序", "谷歌", "诉讼", "slapped"]}, {"category": "", "categoryclass": "", "imagename": "a374ff837fde0126af6030f71c8cd195.jpg", "infoid": 1011905, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在新冠肺炎大流行期间，该公司继续发展。创始人兼首席执行官亚历克斯·科尔默(Alex Collmer)告诉我，近几个月来，客户使用该平台的方式发生了实质性变化。例如，他表示，该平台的“最好技能”之一是将现有的镜头-包括为电视广告拍摄的镜头-以及其他创意资产转化为社交媒体广告。当然，“在过去的几个月里，所有的体检拍摄都被取消了。”\n因此科尔默表示，品牌不再简单地将VidMob视为社交媒体广告工具，而是越来越多地向这家初创公司寻求一种管理远程视频制作的方式。其结果是，该公司的“标识”同比增长了100%(又名。新客户)，然后在第二季度又增长了50%。\n他说，“我们在这里看到的是企业数字化转型的加速.”与我们交谈的几乎每一个客户、每一个营销者都在非常认真地考虑如何将他们所有的创意业务转移到某种统一的软件平台上，以便他们在不得不继续在远程环境中工作的情况下感到安全，并利用现有媒体更有效率。“。\n花旗(Citi)就是其中之一，该公司负责企业公关的副总裁梅根·科比特(Megan Corbett)告诉我，她的团队自去年以来一直与VidMob合作。她说，作为大流行的结果，就像许多营销人员一样，“我们被要求真的很灵活，迅速调整和扩大项目。”\n例如，为了响应#initogether标签，花旗使用VidMob制作了一系列鼓舞人心的视频，展示了员工的工作-比如上面视频中的Mihir，他正在为自己的社区3D打印防护设备。\n科比特说：“当我们思考如何讲述这些故事时，我们意识到你的同事是你所拥有的一些最重要的英雄。”\n据花旗称，自5月初该活动启动以来，这些视频已经被观看了近25万次，其中80%是在LinkedIn上观看的。\n尽管应对最初的大流行和关闭已经够困难的了，但新闻不断传来，种族正义的抗议活动，新冠肺炎的复兴，导致的关闭等等。\n“我们将在一段时间内处于不确定时期，但老实说，我认为这是一个机会，”Corbett说。“了解消费者需求的品牌，融入文化时代精神的品牌，迅速转向创造相关且吸引人的内容并推动业务KPI…的品牌。这将是未来的胜利者。“。\n同样，科尔默表示，在一个不确定的时期，品牌需要更快地做出反应，而不是简单地保持沉默：“闭嘴离开不是一个很好的定位自己的方式。”", "note_en": "And the company has continued to evolve during the COVID-19 pandemic. Founder and CEO Alex Collmer me that how customers use the platform has changed substantially in recent months. For example, he said that one of the platform’s “best skills” involved taking existing footage — including footage shot for TV commercials — and other creative assets and turning them into social media ads. But of course, “Over the last few months, all physical shoots were canceled.”\n So Collmer said that rather than simply treating  VidMob   as social media advertising tool, brands are increasingly turning to the startup for a way to manage remote video production. The result is that the company saw 100% year-over-year “logo growth” (a.k.a. new customers) in the first quarter, and then grew another 50% in Q2.\n  “What we have seen here is the acceleration of the digital transformation of the enterprise,” he said. “Pretty much every client we have, every marketer we talk to is looking very seriously at how to move all their creative operations onto some sort of unifying software platform, so that they feel safe in the event that they continue to have to work in a remote environment continue, and to be more efficient with existing media.”\n One of those clients is  Citi, whose vice president of corporate communications Megan Corbett told me her team has been working with VidMob since last year. She said that as as a result of the pandemic, like many marketers, “We were required to really be flexible and adjust and scale programs quickly.”\n  For example, in response to the #InItTogether hashtag,  Citi   used VidMob to create a series of inspirational videos showcasing the work of its employees — such as Mihir in the video above, who was 3D printing protective equipment for his communities.\n “As we thought about how we told the stories, we realized that your colleagues are some of the most important heroes that you have,” Corbett said.\n According to Citi, the videos have been viewed nearly 250,000 times since the campaign launched in early May, with 80% of that viewing on LinkedIn.\n And although dealing with the initial pandemic and shutdown was difficult enough, the news keeps coming, with protests for racial justice, a COVID-19 resurgence, resulting closures and more.\n “We’re going to be in a period of uncertainty for a while, but to be honest, I see that as an opportunity,” Corbett said. “Brands who understand what their consumers want, brands who are tuned into the cultural zeitgeist, brands [who] pivot quickly to create content that is relevant and engaging and drive business KPIs … that will be what wins in the future.”\n Similarly, Collmer said that in a period of uncertainty, brands need to respond more quickly, rather than simply falling silent: “Shutting up and going away is not a great way to position yourself.”", "posttime": "2020-07-15 07:28:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "视频,rethinks", "title": "\nVidMob在大流行时代重新思考视频制作", "title_en": "\n\t\t\t\tVidMob rethinks video production in the pandemic era\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/vidmob-pandemic/", "via": "", "real_tags": ["视频", "rethinks"]}, {"category": "", "categoryclass": "", "imagename": "9efedb7111f89595e368d7492b8ec2b1.jpeg", "infoid": 1011904, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几乎所有的BSD版本都保存得很好。如果你想找到1BSD，或者2BSD或4.3-Tahoe BSD，你可以在网上轻松地找到它们。然而，如果你搜索2.11BSD，你会很容易找到它，但它不会是原始的。您可以找到最新的补丁版本(2.11BSDpl469)或较早的流行版本(pl430很流行)。您甚至可以找到RetroBSD项目，该项目使用2.11BSD作为起点，为基于MIPS的微型PIC控制器创建系统。您将找到为该系统发布的每一个补丁程序。\n但是，您将找不到原始的2.11BSD发行版磁带。你不会找到原始资料的。通过挖掘，你可以找到2.11bsdpl195。这本书是在原版发行约30个月后发布的，也是目前已知存在的最古老的一本。原因是原来的2.11BSD磁带是由USENIX发行的。他们对录音带收取了很高的费用，所以没有太多人购买。这是在Caldera在许可的许可下发布古代制服之前，所以大部分的饲料都流向了AT&amp；T。它的成本使其成为一种低销量的产品。另外，所有的时间都有补丁，所以主带会时不时地重新拼写。遗憾的是，原件没有保存下来，因为储存费用很高，而且到了20世纪90年代初，PDP-11有点像是一台边缘机器，除了在某些采购时间较长的利基市场之外。\n但是等等，你说我们有所有的补丁，补丁-R超级好用。只是用它来倒车，对吗？\n好吧，不。补丁程序并不都是上下文不同的。相反，它们包含指令，如删除这些文件，然后解压此uuended压缩tarball或其他信息销毁指令。所以，信息丢失了，也许是永远丢失了。我们到不了那里。\n或者我们能不能。如果我们在真空中观察它，它听起来肯定是没有希望的。信息被毁了，你说的。然而，虽然它的真实信息在许多补丁中都被销毁了，但它只有一份副本被销毁。我们还有其他信息来源。2.11BSD版本是2BSD系列中一系列版本的一部分，因此我们有2.10.1BSD，也就是之前的版本。这一点被保存了下来。我们从发布说明中了解到，大量代码来自4.3BSD。还有一个名为comp.bugs.2bsd的Usenet新闻组发布了补丁。我们知道这些补丁最终出现在2.11BSD中(另外，2.11BSD的所有补丁都是由原始作者在Usenet离开之前发布在那里的)。\n所以，这就把我们带到了我的2.11BSD pl 0恢复项目上。该项目的目标是创建两个主要构件。首先，如果有一个包含所有2.11BSD补丁的git回购会很酷。其次，如果能有2.11BSD发行版磁带的近乎副本，那真的很酷。该项目旨在以可重现的方式创建这些工件。完成后，任何人都可以使用我们现有的工件、项目中的脚本(包括从其他项目中获取数据所需的所有提示，以及一些手工制作的补丁，这些补丁生成的结果与所有关于这些文件的已知信息一致)。\n我已经用我的方式完成了195个解除它们的补丁。它们中的许多都是简单的补丁，以令人讨厌的折衷的不同方式打包。然而，有些人会破坏信息，需要研究才能理清头绪。我已经尽了最大努力，并且已经回到了0级补丁来源(几乎有一两个挥之不去的问题需要在相对不重要的文件上进行追踪)。我已经创建了一个脚本来创建一个磁带，将其加载到我的2.11BSDpl 195中，以便在chroot中构建一个2.11BSD pl 0系统。\n有一个我构建的脚本，它在pl0级别构建所有内容(两次)。在这些版本中至少有一些版本的发行说明中有噪音，说明存在可再现性问题。它目前已经过了初始引导阶段。我可以建造所有的图书馆，但需要自动化。\n有两种方法可以让你随心所欲。一个是在推特上关注我。我的用户名是@bsdimp。或者你可以看看我的GitHub项目。我已经在那里写下了状态(虽然已经过时了几个星期)，你可以找到一篇论文的开头(虽然它更过时，但有更多的背景)。我每周至少更新一次，但有时会更多，因为我有时间。", "note_en": "Almost all of the BSD releases have been well preserved. If you want to find 1BSD, or 2BSD or 4.3-TAHOE BSD you can find them online with little fuss. However, if you search for 2.11BSD, you&#39;ll find it easily enough, but it won&#39;t be the original. You&#39;ll find either the latest patched version (2.11BSD pl 469), or one of the earlier popular version (pl 430 is popular). You can even find the RetroBSD project which used 2.11BSD as a starting point to create systems for tiny mips-based PIC controllers. You&#39;ll find every single patch that&#39;s been issued for the system.\n   What you will not find, however, is the original 2.11BSD release tapes. You won&#39;t find the original sources. With some digging, you can find is 2.11BSD pl 195. This was released about 30 months after the original was released, and is the oldest one that&#39;s known to exist. The reason is that the original 2.11BSD tapes were distributed by USENIX. They charged a large fee for the tapes, and so not too many people bought them. And this was before Caldera released the ancient Unixes under a permissive license, so the bulk of the feed went to AT&amp;T. It&#39;s cost made it a low volume item. Plus, there were patches all the time, so the master tapes were respun from time to time. The originals weren&#39;t preserved, alas, because storage was expensive and by the early 1990s the PDP-11s were a bit of a fringe machine, except in certain niches with long procurement times...\n  But wait, you said we have all the patches, patch -R is super easy to use. Just use that to go backwards, right?\n  Well, no. The patches aren&#39;t all context diffs. Instead they include instructions like &#34;remove these files, then extract this uuencoded compress tarball&#34; or other information destroying instructions. So, the information is lost, maybe for good. We can&#39;t get there.\n  Or can we. If we look at it in a vacuum, it sure sounds hopeless. Information destroyed, you said. However, while it&#39;s true information is destroyed in many of the patches, it&#39;s only one copy that&#39;s destroyed. We have other sources of information. The 2.11BSD release is part of a series of releases in the 2BSD family, so we have 2.10.1BSD, the prior release. That&#39;s been preserved. We know from the release notes that significant influxes of code came from 4.3BSD. There&#39;s also a usenet news group called comp.bugs.2bsd that posted patches. It&#39;s known that these patches wound up in 2.11BSD (also all the patches to 2.11BSD were posted there by the original authors until usenet went away).\n   So, that brings us to my 2.11BSD pl 0 restoration project. The goal of the project is to create two main artifacts. First, it would be cool to have a git repo that has all the 2.11BSD patch points in it. Second, it would be really cool to have a near copy of the 2.11BSD release tapes. This project aims to create these artifacts in a reproducible way. When completed, anybody can take the existing artifacts we have, the scripts from the project (including all the hints needed to get the data from other projects, as well as a few hand-crafted patches which produce results consistent with all know info about these files).\n  I&#39;ve worked my way through the 195 patches undoing them. Many of them are simple patches, packed in an annoying eclectic number of different ways. Some, however, destroy information and require research to untangle. I&#39;ve done the best I can and have made it back to patch level 0 sources (almost, there&#39;s one or two lingering issues that need to be tracked down on relatively unimportant files). I&#39;ve created a script to create a tape to load into my 2.11BSD pl 195 to build, in a chroot, a 2.11BSD pl 0 system.\n  There&#39;s a script that I&#39;ve build that builds everything at the pl0 level (twice). There&#39;s noise in the release notes of at least some of these releases that there reproducibility issues. It&#39;s currently past the initial bootstrap phase. I can build all the libraries, but automation is needed.\n  There&#39;s two ways to follow along. One is to follow me on Twitter. My handle is  @bsdimp. Or you can look at my  github project. I&#39;ve written up the status there (though it&#39;s a couple of weeks out of date) and you can find the start of a paper (though it&#39;s even more out of date, but has more background). I update at least once a week, but sometimes more as I have time.", "posttime": "2020-07-15 07:27:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "发布,最初,originally,补丁", "title": "搜索最初发布的2.11BSD", "title_en": "In search of 2.11BSD, as originally released", "transed": 1, "url": "https://bsdimp.blogspot.com/2020/07/211bsd-original-tapes-recreation.html", "via": "", "real_tags": ["发布", "最初", "补丁"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011903, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "安德鲁·怀特豪斯(Andrew Whitehouse)一直在德文郡南部普劳尔角(Prawle Point)的悬崖上，用手和膝盖搜寻一只稀有的蜜蜂。他去年只见过一只，今年夏天到目前为止，还没有看到这只带有醒目黄色斑点的六带游牧蜜蜂的迹象。\n怀特豪斯担心它正处于灭绝的边缘，因为作为一种寄生蜂，它依赖于一个宿主-长角蜜蜂-在这个宿主中产卵，而这个宿主现在也很稀少。\n“这种长角蜜蜂被限制在几个海岸悬崖上，在那里它赖以生存的野花仍在生长。当它找到它们时，就会钻到悬崖上筑巢，“他说。\n在英国，自20世纪40年代以来，97%的盛产野花的土地-700万公顷-已经被现代农业和城外发展冲走。\n现在，保护慈善机构怀特豪斯(Whitehouse)作为国家经理Buglife工作，希望通过周一启动其面向英格兰的B-line网络，帮助恢复和创建至少15万公顷的野花小径。\nB-Lines是一个战略地图网络，由横跨全国的现有和潜在的野花栖息地组成。这条3公里宽的走廊从海岸延伸到乡村和城镇，总共覆盖了英格兰约4.8万平方公里的面积。\n人们希望新的走廊能帮助长角蜜蜂等物种茁壮成长。蜜蜂以其超长的触角命名，一度在英格兰南部很常见，但可耕种的耕作和牛羊的过度放牧夺走了它的食物。怀特豪斯说：“剩下的太小，距离太远，需要连接在一起。”\n据预测，如果局限在一小片土地上，40-70%的昆虫物种可能灭绝。\nBuglife的传粉员和B-Lines负责人凯瑟琳·琼斯(Catherine Jones)说：“一个完整的英格兰B-Lines网络是我们扭转昆虫减少和帮助我们苦苦挣扎的传粉者的使命中里程碑式的一步。”当苏格兰、威尔士和北爱尔兰的地图在今年晚些时候完成时，B线将覆盖整个英国。\n自六年前开始绘制B线地图以来，在环境、食品和农村事务部(Defra)的财政支持下，该慈善机构与一系列合作伙伴合作，包括当地野生动物信托基金及其志愿者、议会、高速公路机构和土地所有者。他们总共创造了超过450公顷的野花小径，作为零散地点之间的垫脚石，并取得了一些成功。\n就在布里斯托尔以南的英格兰B-Line-与雅芳野生动物信托基金(Avon Wildlife Trust)的长期合作伙伴关系-Buglife的保护官员海利·赫里奇(Hayley Herbridge)去年在这座城市的边缘记录了另一个日益稀缺的物种-黑色胡萝卜采矿蜂，自2013年以来就再也没有出现过。在这里，大量野花丰富的栖息地，包括野生胡萝卜和蜜蜂赖以生存的其他伞形花卉，已经被志愿者修复。\n“发现这只小黑蜂非常令人兴奋，”赫里奇说。“我希望这将鼓励当地社区和开发商种植更多野花和野胡萝卜的混合物，以促进人口增长。”\n德文郡的B-Line连接了Prawle Point和Dartmoor，给了这只长角蜜蜂一个机会，让它在六带游牧蜜蜂的带领下搬回内陆。怀特豪斯说，影响农民和土地所有者在沿线创建和恢复蜜蜂友好型栖息地将是该项目成功的关键。\n他解释说：“由于社会距离的关系，我们无法与大庄园主和租户农民面对面会面，但我们希望与他们合作一个大项目，改变他们动物的放牧方式，这样野花就可以在沿途盛开。”\n自然友好农业网络主席马丁·莱恩斯表示，B线地图将为其成员带来巨大的好处。“如果农民选择在哪里建造更多的树篱或田地边际，地图就会告诉他们把精力集中在哪里，”他说。\n在英格兰西北部的B线上，坎布里亚野生动物信托基金(Cumbria Wildlife Trust)一直在与英格兰高速公路和A595/A66公路网沿线种植树木和野花的承包商合作。其他地点已经种植了紫云英，以帮助提高当地小蓝蝶的数量，小蓝蝶是一种全国稀有的蝴蝶。\nB线地图在英格兰的推出恰逢7月13日至19日的蜜蜂需求周，这是由Defra协调的一年一度的活动，旨在提高人们对如何通过简单的行动(如种植更多有利于蜜蜂的花朵和减少修剪草坪)来帮助蜜蜂和其他传粉者的认识。\n回到普劳尔角，怀特豪斯希望很快就能在德文郡B线的某个地方看到这只六带游牧蜜蜂。“我希望我们监测的不是一个物种的灭绝，而是恢复，”他说。\n英国大约有250种野生蜜蜂，其中24种是大黄蜂，其余的是独居蜜蜂，如挖胡萝卜的蜜蜂和长角蜜蜂。蜜蜂不是野生蜜蜂，因为它是由养蜂人管理的。\n在英国的大黄蜂中，有6种在过去的几十年里至少减少了80%。它们都有很长的舌头，它们赖以生存的花朵已经消失，因为土地被清理出来用于耕种和开发。\n我们没有足够的关于独居蜜蜂的数据来了解它们的风险有多大，但对于那些已经被研究的蜜蜂来说，37%的人在欧洲经历了种群数量的下降，9%的人面临灭绝。\n除了栖息地丧失之外，威胁还包括在现代农业以及公园和花园中使用杀虫剂和其他化学品。气候变化将是一个日益严重的问题。", "note_en": "Andrew Whitehouse has been on the cliffs at Prawle Point, south Devon, searching on his hands and knees for a rare bee. He saw only one last year, and so far this summer there has been no sign of the six-banded nomad bee with its striking yellow markings.\n Whitehouse fears it is on the brink of extinction because, as a parasitic bee, it depends on a host – the long-horned bee – in whose nest it lays its eggs, and the host is now also scarce.\n  “The long-horned bee is restricted to a few coastal clifftops where the wildflowers it feeds on are still growing. When it finds them it burrows into the cliffs to nest,” he says.\n In the UK, 97% of wildflower-rich land – seven million hectares –  has been swept away by modern agricultural and out-of-town developments since the 1940s.\n Now the conservation charity Whitehouse works for as countries manager,  Buglife, hopes to help restore and create at least 150,000 hectares of wildflower pathways with the launch on Monday of its  B-lines network for England.\n B-Lines are a strategically mapped network of existing and potential wildflower habitats that criss-cross the country. The 3km-wide corridors stretch from the coast to the countryside and towns and cities, covering in total some 48,000 sq km of England.\n  It is hoped the new corridors will help species such as the long-horned bee to thrive. Named after its extraordinarily long antennae, the bee was once common across the south of England, but arable farming and over-grazing by sheep and cattle has robbed it of food. “What’s left is too small and too far apart, and needs to be joined together,” says Whitehouse.\n It has been predicted that  40-70% of insect species could become extinct if confined to tiny fragments of land.\n  Catherine Jones, pollinator officer and B-Lines lead at Buglife, says: “A complete England B-Lines network is a landmark step in our mission to reverse insect declines and lend a hand to our struggling pollinators.” B-lines will cover the whole of the UK when maps for Scotland, Wales and Northern Ireland are completed later this year.\n Since the charity began mapping B-Lines six years ago, with financial support from the Department for Environment, Food and Rural Affairs (Defra), it has worked with a range of partners, including local wildlife trusts and their volunteers, councils, highways agencies and landowners. Together, they have created over 450 hectares of wildflower pathways as stepping stones between fragmented sites, and with some success.\n Just south of Bristol on the west of England B-Line – a long-term partnership with Avon  Wildlife Trust – Hayley Herridge, Buglife’s conservation officer, last year recorded another increasingly scarce species, the black carrot-mining bee, on the fringes of the city where it hadn’t been seen since 2013. Here, significant areas of wildflower-rich habitat, including wild carrot and other umbellifer flowers on which the bee feeds, had been restored by volunteers.\n “It was very exciting to find this small black bee,” says Herridge. “I hope it will encourage local communities and developers to plant more wildflower mixes with wild carrot to boost population growth.”\n  The Devon B-Line joins Prawle Point with Dartmoor, giving the long-horned bee a chance to move back inland with the six-banded nomad bee in tow. Influencing farmers and landowners to create and restore bee-friendly habitat along the route will be key to its success, says Whitehouse.\n “We can’t meet with large estate owners and tenant farmers face-to- face because of social distancing, but we hope to work with them on a big project to change the way their animals graze, so wildflowers can bloom along the route,” he explains.\n Martin Lines, chair of the  Nature Friendly Farming Network , says the B-lines map will be hugely beneficial for its members. “If farmers are choosing where to create more hedgerows or field margins, the map shows them where to focus their efforts,” he says.\n On the north-west England B-Line, the Cumbria Wildlife Trust has been working with Highways England and contractors  planting trees and wildflowers along the A595/A66 road network. Other sites have been planted with kidney vetch to help boost the local population of the small blue, a nationally scarce butterfly.\n The launch of the B-Lines map in England coincides with  Bees’ Needs Week, 13-19 July, an annual event coordinated by Defra to raise awareness about how we can help bees and other pollinators by simple actions, such as planting more bee-friendly flowers and mowing the lawn less.\n  Back at Prawle Point, Whitehouse hopes to see the six-banded nomad bee soon somewhere along the Devon B-line. “I hope we’re not monitoring the extinction of a species, but the recovery,” he says.\n  There are some  250 wild bee species in the UK;  24 are bumblebees and the rest are solitary bees, such as the carrot-mining bee and the long-horned bee. The honeybee is not a wild bee as it is managed by beekeepers.\n Of the UK bumblebees, six species have declined by at least 80% in the last few decades. They all have long tongues and the flowers they feed on have disappeared as land is cleared for farming and development.\n We don’t have enough data on solitary bees to know how at risk they are, but for those that have been studied  37% have experienced a decline in population in Europe and  9% face extinction.\n In addition to habitat loss, threats include the use of pesticides and other chemicals in modern farming and in parks and gardens. Climate change will be an increasing problem.", "posttime": "2020-07-15 07:26:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "行驶,beeline,蜜蜂", "title": "直线行驶：穿越英国的野花小径可以拯救物种", "title_en": "Making a beeline: wildflower paths across UK could save species", "transed": 1, "url": "https://www.theguardian.com/environment/2020/jul/12/making-a-beeline-wildflower-paths-across-uk-could-save-species", "via": "", "real_tags": ["行驶", "beeline", "蜜蜂"]}, {"category": "", "categoryclass": "", "imagename": "2c82b191bd06884b4bd376ef9188b386.png", "infoid": 1011902, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "双曲是一款独立的冒险游戏，将于今年晚些时候在Steam上推出，其原始图形隐藏着一个令人惊叹的创新：游戏世界设定在双曲线、非欧几里德空间中。换句话说--如果我没有正确解释的话，请各位数学爱好者纠正我--它不是发生在一个类似于我们日常生活的虚拟世界里，而是发生在一个感知上是球形的虚拟世界上，而这个虚拟世界看起来只是一个平面。更多信息请点击此处：\n双曲空间允许在相同的空间中容纳比你通常预期的更多的容量。这使你可以探索广阔的区域，而只需很少的时间步行到任何地方。你会发现建立你周围环境的心理导图是不可能的。直线不能再平行了。遍历地图可能会导致意外旋转。还有更多奇怪的后果会让你质疑现实。你还将探索球形空间，这会产生相反的结果。例如，反向透视：距离越远的对象看起来越大。\n如果你读完这篇文章也头疼，这款游戏的开发者--YouTube热门频道CodeParade的凯文--在下面制作了一个视频解说员。\n在Hyperbolica出版后，凯文告诉我，他计划将该引擎开源，这样其他游戏开发商就可以使用它进行开发--也许这是解释为什么这是有意义的最好方式：它将使制作各种甚至比Portal更令人费解的游戏变得更加容易。\n凯文告诉我，我认为该引擎将在游戏发布前一点时间开放源代码，可能会在测试版测试时间左右。希望到那时代码都能被清理和优化，这样就有机会在发布之前找到任何额外的优化/改进。所以我猜大概是在11月的某个时候。&#34；凯文告诉我，在游戏发布之前，引擎将会是开源的。希望到那时代码能全部清理和优化，并在发布之前找到任何其他的优化/改进。所以我猜大概是在11月的某个时候。\n他说，虽然“双曲”主要是一款冒险/探险类游戏，但我也希望看到其他类型的游戏被开发出来，比如第一人称射击游戏、RPG游戏和类似“我的世界”的游戏。(例如，想象一下在球形现实中玩一款堡垒之夜式的皇家战斗游戏是多么光荣的疯狂。)。\nHypberbolica引擎是基于凯文正在研发的另一个引擎，该引擎是在去年疯传的另一个视频中介绍的，但翻译成了Unity：\n凯文解释说，老式的引擎使用门户将世界的不同部分缝合在一起。虽然它是非欧几里德的，但它实际上并不是一个完整的几何图形。另一方面，双曲线卡不使用门户，它在太空中的任何地方都在不断地使用非欧几里德的东西，并使用了一种完全不同的技术(顶点着色器)来实现这种效果。我选择Unity是因为我试图避免从头开始编写所有东西，否则我将需要数年时间才能完成游戏。我正试图尽可能多地利用现有的工具，即使这意味着破解一些东西或做一些不太理想的事情。\n事实是，它安装在Unity上，向更多的开发人员开放，他们也可以对图形进行调整和升级：\n与普通的Unity游戏相比，双曲游戏对纹理分辨率没有什么要求，正如凯文所说，所以没有什么不同。要记住，顶点数可能是对性能影响最大的因素。", "note_en": "Hyperbolica is an indie adventure game coming out later this year on Steam and its rudimentary graphics hide an amazing  innovation: The game world is set in hyperbolic, non-euclidean space. In other words -- and please correct me, math-minded readers, if I&#39;m not explaining this correctly -- it does not take place on a virtual world that resembles our everyday reality, which only seems to be a flat plane, but on a virtual world that&#39;s perceptually spherical. More  here:\n  Hyperbolic space allows exponentially more volume to fit in the same &#39;space&#39; than you&#39;d normally expect. This allows you to explore enormous areas while taking very little time to walk anywhere. You&#39;ll find that building a mental map of your surroundings becomes impossible. Lines can no longer be parallel. Traversing the map can result in unexpected rotations. And many more strange consequences that will make you question reality. You&#39;ll also explore spherical space, which has the opposite outcomes. For example, a reverse-perspective: Objects appear larger the farther away they are.\n  If your head also hurts after reading this, the game&#39;s developer --  Kevin of the popular YouTube channel CodeParade -- created a video explainer below.\n  After Hyperbolica is published, Kevin tells me he plans to open source the engine so that other game developers can play around and built with it -- and maybe that&#39;s the best way of explaining why this is meaningful: It&#39;ll make it way easier to make all kinds of games that are even more mind-bending than Portal.\n    &#34;I think the engine will be open-sourced a little before the launch of the game, maybe around beta testing time,&#34; Kevin tells me.  &#34;Hopefully the code will all be cleaned up and optimized by then, and it would give a chance to find any additional optimizations/improvements before release.  So I&#39;m guessing sometime around November.&#34;\n  While Hyperbolica is mainly an adventure/exploration game, he says, &#34;I&#39;d like to see other genres explored, like first-person shooters, RPGs, and Minecraft-like games to name a few.&#34; (Imagine the glorious insanity, for example, of playing a Fortnite-type battle royale game in a spherical reality.)\n  The Hypberbolica engine is based on  another engine Kevin was working on, introduced in  another video that went viral last year, but translated to Unity:\n  &#34;The older engine used portals to stitch parts of the world together,&#34; Kevin explains. &#34;Although it is  non- euclidean, it&#39;s not actually a  geometry.  Hyperbolica on the other hand doesn&#39;t use portals, it&#39;s continuously  non- euclidean everywhere in space and uses an entirely different technique (vertex shaders) to achieve the effect.  I chose Unity because I&#39;m trying to avoid writing everything from scratch, otherwise it would take me years to finish the game. I&#39;m trying to utilize as many existing tools as possible, even if it means hacking something or doing things less optimally.&#34;\n  And the fact that it&#39;s on Unity opens it up to many more developers, who can also tweak and upgrade the graphics:\n    &#34;There&#39;s no requirements about texture resolution for Hyperbolica compared to regular Unity games,&#34; as Kevin puts it, &#34;so nothing different there. Vertex count is probably the bigger performance impact to keep in mind.&#34;", "posttime": "2020-07-15 07:26:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,图形,open,游戏", "title": "Hyperbolica：构建在top Unity之上的开源非欧几里得图形引擎", "title_en": "Hyperbolica: Open-source, non-euclidean graphics engine built on top Unity", "transed": 1, "url": "https://nwn.blogs.com/nwn/2020/07/hyberbolica-game-engine-code-parade.html", "via": "", "real_tags": ["开源", "图形", "open", "游戏"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1011900, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国证券交易委员会(SEC)今天宣布，向一名举报人支付380万美元的赔偿金，这名举报人提供了重要信息，帮助SEC瓦解了一项正在进行的欺诈计划，由此产生的执法行动将数百万美元返还给了受到伤害的投资者。\nSEC举报人办公室主任简·诺伯格(Jane Norberg)表示：“今天的裁决突显了SEC的举报人计划在保护普通投资者方面发挥的最重要作用。自近十年前该计划开始以来，SEC已经下令根据举报人信息采取超过25亿美元的财务补救措施，其中包括超过14亿美元的返还和判断前利息，其中近7.5亿美元已经退还或计划退还给受到伤害的投资者，”SEC举报人办公室主任简·诺伯格(Jane Norberg)表示。\n自2012年发布第一份奖励以来，SEC已经向87名个人颁发了大约5.05亿美元的奖励。这包括在过去10个月里向20名个人提供的奖励，总额近1.19亿美元。所有的付款都来自国会设立的投资者保护基金，资金完全来自违反证券法的人向SEC支付的货币制裁。“没有从受到伤害的投资者手中收取或扣留任何资金来支付举报人奖励。举报人如果自愿向SEC提供原创、及时、。以及导致执法行动成功的可信信息。当罚款超过100万美元时，举报人的奖励可以从所收资金的10%到30%不等。\n根据多德-弗兰克法案的规定，SEC保护举报人的机密性，不会披露可能泄露举报人身份的信息。\n有关举报人计划以及如何举报小费的更多信息，请访问SEC.gov/WESTLEBLAWER。", "note_en": "The Securities and Exchange Commission today announced a $3.8 million award to a whistleblower who provided significant information that helped the SEC disrupt an ongoing fraudulent scheme.  The resulting enforcement action returned millions of dollars to harmed investors.\n “Today’s award underscores the paramount role the SEC’s whistleblower program plays in safeguarding the Main Street investor.  Since the beginning of the program nearly ten years ago, the SEC has ordered more than $2.5 billion in financial remedies based on whistleblower information, including more than $1.4 billion in disgorgement and prejudgment interest, of which almost $750 million has been returned or is scheduled to be returned to harmed investors,” said Jane Norberg, Chief of the SEC’s Office of the Whistleblower.\n The SEC has awarded approximately $505 million to 87 individuals since issuing its first award in 2012.  This includes awards to 20 individuals in the last 10 months, totaling almost $119 million.  All payments are made out of an investor protection fund established by Congress that is financed entirely through monetary sanctions paid to the SEC by securities law violators.  No money has been taken or withheld from harmed investors to pay whistleblower awards.  Whistleblowers may be eligible for an award when they voluntarily provide the SEC with original, timely, and credible information that leads to a successful enforcement action.  Whistleblower awards can range from 10 percent to 30 percent of the money collected when the monetary sanctions exceed $1 million.\n As set forth in the Dodd-Frank Act, the SEC protects the confidentiality of whistleblowers and does not disclose information that could reveal a whistleblower’s identity.\n For more information about the whistleblower program and how to report a tip, visit  SEC.gov/whistleblower.", "posttime": "2020-07-15 07:05:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "sec,举报人", "title": "SEC发放380万美元举报人奖金", "title_en": "SEC issues $3.8M whistleblower award", "transed": 1, "url": "https://www.sec.gov/news/press-release/2020-155", "via": "", "real_tags": ["sec", "举报人"]}, {"category": "", "categoryclass": "", "imagename": "d540b7bf7d244396632253f3a27c7d12.png", "infoid": 1011899, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果从长远来看，大胆的透明度让我们所有人都更安全、更具创新性和更有利可图，那该怎么办？\n当你理解了游戏规则，并采取一种经过深思熟虑的方法来建立团队和制定游戏计划时，不仅有可能与坚定的对手竞争，而且更有可能利用你现有的天赋和资源做得更多，取得胜利。\n网络安全工具本身并不足以抵御当今的许多威胁。但良好的数字卫生是有效的第一道防线。\n黑客不会等待黑客的许可，您也不应该等待许可才能采取必要的措施来保护您的组织。", "note_en": "What if, in the long run, audacious transparency made us all safer, more innovative and more profitable?\n When you understand the rules of the game and take a studied approach to building a team and developing a game plan, it is not only possible to be competitive against a determined adversary, but it is more likely that you can do more and win with your available talent and resources.\n  Cybersecurity tools on their own are not sufficient protection against today’s many threats. But good digital hygiene is an effective first line of defense.\n  Hackers aren’t waiting for permission to hack, and you shouldn&#39;t wait for permission to do what is necessary to protect your organization.", "posttime": "2020-07-15 07:05:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "透明度,transparency,等待", "title": "大胆的透明度能让我们所有人都更安全、更创新、更有利可图吗？", "title_en": "Can audacious transparency made us all safer, more innovative and profitable?", "transed": 1, "url": "https://www.forbes.com/sites/forbestechcouncil/people/itzikkotler/#4f4ac5492431", "via": "", "real_tags": ["透明度", "等待"]}, {"category": "", "categoryclass": "", "imagename": "0767aec79a72cfcedd2dd80642b8bba9.jpg", "infoid": 1011898, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "早在6月份，我们就发表了一篇标题相当宏大的文章：“我们是如何重建风投行业的。”实际上，它就是宣布了TechCrunch榜单，这是一个长达一个月的项目，目的是让谁真正为初创企业开出第一张支票，从而提高透明度。\n今天，我们公布了这份名单--至少是第一个版本。我会让执行主编丹尼·克莱顿解释一下：\nTechCrunch List是一份经过验证的、经过精心策划的投资者名单，这些投资者表现出了从种子到成长的第一轮检查和领先轮次的承诺，由市场垂直市场(Market Vertical…)组织。\n归根结底，TechCrunch榜单是一个活生生的名录，列出了愿意引领该行业的最活跃的风投。我们打算定期更新这份榜单，因为创始人给了我们更多的推荐，投资者改变了他们的品味和投资组合。\n你可以读到从创始人那里得到最热情推荐的11家风投公司(需要额外的Crunch会员资格)，并浏览完整的名单。\n亚马逊将测试Dash Cart，这是一款智能杂货购物车，可以看到你买了什么-这款手推车将首先在加利福尼亚州伍德兰山开设的亚马逊杂货店进行测试，它将识别放在篮子里的商品并向你收费。\n英国对华为和5G进行了180度大转弯，给运营商在2027年之前拆除现有套件-英国政府禁止电信公司从华为和中兴购买5G设备，并必须在2027年之前从这些公司拆除任何设备。\nGoogle Play Pass扩展到美国以外，增加了更多的游戏和年度定价-Play Pass是Apple Arade的Android替代品，提供各种应用程序和游戏的订阅访问权限。\n身份平台Auth0筹集了1.2亿美元的F系列融资，估值为19.2亿美元-开发者只需添加几行代码就可以将应用程序连接到Auth0的身份管理服务。\n黑石集团的成长型投资者牵头向燕麦奶巨头Oatly投资2亿美元，这家燕麦奶巨头的名人投资者包括奥普拉·温弗瑞(Oprah Winfrey)、Roc Nation、娜塔莉·波特曼(Natalie Portman)和星巴克(Starbucks)前首席执行官霍华德·舒尔茨(Howard Schultz)。)我试过牛奶了。(很好。)。\n你可能想要了解的关于筹款的一切都将在TC的早期阶段涵盖-将有深入的会议，以及与Figma的Dylan Field、Minted.com的Mariam Naficy、红杉的James Buckhouse和Jess Lee以及Greylock的Reid Hoffman和Sarah Guo的炉边聊天。\n投资者正在浏览Chromium初创公司-Lucas Matney概述了建立在Google Chromium项目之上的有趣的浏览器初创公司。\n(提醒：Extra Crunch是我们的订阅会员计划，旨在使初创企业的信息大众化。您可以在这里注册。)。\n在学院提起诉讼后，ICE放弃了学生签证规则的改变-十几所大学和学院威胁要采取法律行动，反对政府吊销在美国学院学习的国际学生的签证，这些学院计划在秋季完全在网上提供课程。\nNBC环球的流媒体服务孔雀将于明天正式发布-该服务从4月份就已经向母公司康卡斯特的Xfinity X1和Flex有线电视客户开放，但明天将面向普通观众推出，美国任何人都可以在一系列设备上注册并访问孔雀(但Roku和Amazon Fire TV除外)。\n在乐高新的2,646件NES套件上手摇一个级别的超级马里奥兄弟-这很漂亮，但我肯定会失去其中的一些。\nThe Daily Crunch是TechCrunch对我们最重大、最重要的故事的综合报道。如果你想在太平洋时间每天下午3点左右把它送到你的收件箱，你可以在这里订阅。", "note_en": "Back in June we published a story with the rather grandiose headline “ How we’re rebuilding the VC industry. It was, in effect, announcing The TechCrunch List, which has been a months-long project to bring more transparency to who actually writes first checks for startups.\n  Today, we published the list — or at least the first version. I’ll let Managing Editor Danny Crichton  explain:\n The TechCrunch List is a verified, curated list of investors who have demonstrated a commitment to first checks and leading rounds from seed through growth, organized by market vertical …\n Ultimately, The TechCrunch List is a living and breathing directory of the most active VCs who are willing to lead in the industry. We intend for the List to be regularly updated as founders give us more recommendations and investors change their tastes and their portfolios.\n You can read about  the 11 VCs who got the most enthusiastic recommendations from founders (Extra Crunch membership required) and  browse the full list.\n  Amazon to test Dash Cart, a smart grocery shopping cart that sees what you buy — The cart, which will identify and charge you for items placed inside its basket, will first be tested in the Amazon grocery store opening in Woodland Hills, California.\n UK U-turns on Huawei and 5G, giving operators until 2027 to rip out existing kit — The U.K. government is forbidding telcos from buying 5G equipment from Huawei and ZTE, and must remove any equipment from those companies by 2027.\n Google Play Pass expands outside the US, adds more titles and annual pricing — Play Pass is the Android alternative to Apple Arcade, offering subscription access to a variety of apps and games.\n  Identity platform Auth0 raises $120M Series F funding round at $1.92B valuation — Developers can just add a few lines of code to connect applications to Auth0’s identity management service.\n Blackstone’s growth investors lead a $200 million investment into Oatly, the oat-milk juggernaut — Celebrity investors include Oprah Winfrey, Roc Nation, Natalie Portman and former Starbucks CEO Howard Schultz. (I’ve tried the milk. It was fine.)\n Everything you could possibly want to learn about fundraising will be covered at TC Early Stage — There will be in-depth sessions, as well as fireside chats with Figma’s Dylan Field, Minted.com’s Mariam Naficy, Sequoia’s James Buckhouse and Jess Lee and Greylock’s Reid Hoffman and Sarah Guo.\n  Investors are browsing for Chromium startups — Lucas Matney offers an overview of interesting browser startups building on top of Google’s Chromium project.\n  (Reminder: Extra Crunch is our subscription membership program, which aims to democratize information about startups.  You can sign up here.)\n  After colleges sue, ICE backs down from student visa rule change — A dozen universities and colleges threatened legal action against the administration’s order to revoke visas for international students studying at U.S. colleges that plan to provide their classes exclusively online in the fall.\n NBCUniversal’s streaming service Peacock officially launches tomorrow — The service has already been available to parent company Comcast’s Xfinity X1 and Flex cable customers since April, but tomorrow marks the launch to a general audience, with anyone in the United States able to sign up and access Peacock on a range of devices (but not Roku or Amazon Fire TV).\n Hand-crank a level of Super Mario Bros. on Lego’s new 2,646-piece NES kit — This is beautiful but I would definitely lose some of those pieces.\n The Daily Crunch is TechCrunch’s roundup of our biggest and most important stories. If you’d like to get this delivered to your inbox every day at around 3pm Pacific, you can  subscribe here.", "posttime": "2020-07-15 06:45:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "techcrunch,crunch,投资者", "title": "\n每日嘎嘎作响：看，TechCrunch列表", "title_en": "\n\t\t\t\tDaily Crunch: Behold, The TechCrunch List\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/14/daily-crunch-techcrunch-list/", "via": "", "real_tags": ["crunch", "投资者"]}, {"category": "", "categoryclass": "", "imagename": "2f6e6092669f0c6bc652b9b22615e2ab.png", "infoid": 1011897, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "并购是一个喜忧参半的问题。就运动服零售商而言，通过高调购买数字健身被证明是徒劳的。那么，为什么快速增长的服装公司露露柠檬(Lululemon)要在Mirror上掷骰子呢？一个词：耐克。\n耐克是运动服之王。无论如何，像阿迪达斯、锐步和Under Armour这样的对手都不是斯沃什的对手。就露露柠檬而言，它希望成为一个称职的对手-如果没有其他原因，就是为了继续赢得华尔街的好感。在这两个方面，镜子在方程式中都有很大的影响。\n纵观这场竞争，露露柠檬落后耐克一个数量级。耐克的市值为1520亿美元。在过去的12个月里，他们已经完成了370亿美元的销售额。与此同时，Lulu的市值为370亿美元，同期该公司的收入为38.5亿美元。\n虽然这家瑜伽裤制造商的股价近年来表现优于耐克，但Lulu可能永远达不到耐克的规模。但彻底击败耐克并不是重点。归根结底，露露柠檬是在与自己竞争，耐克代表着可能性的上限。\n为了证明它们还没有达到顶峰，露露柠檬有一个使命：保持增长。\n超越瑜伽利基市场，扩大其总的潜在市场，该公司于2019年4月发布的第一个五年计划规划了前进的道路：“男装收入翻一番，数字翻一番，国际收入翻两番”。加入自我护理产品，进军鞋业，以及开设一家2万平方英尺的体验店(配有瑜伽室和餐厅)，这些都将成为未来的增长。\n几个月后，也就是2019年11月，露露柠檬向Mirror价值3400万美元的B-1系列投资100万美元，这是在互联健身领域站稳脚跟的便宜货。作为投资的一部分，并与其成为体验型品牌的目标保持一致，露露柠檬大使开始为Mirror平台创建健身内容。\n闪回到3月份：当COVID命中时，桌子已经摆好了。随着零售店关门，健身工作室关闭，购物和出汗都转移到了网上。在短短几周内，露露柠檬已经看够了；他们准备在镜子上全力以赴。\n在商店关闭的第一周，17万人在Instagram上加入了Lulu的现场锻炼。\n在疫情爆发期间使用在家选项的Lulu客户中，有86%的人计划继续或增加他们新的数字锻炼习惯。\n4月份，露露的在线销售额飙升了125%，这一趋势预计将继续下去。另外，大约50%的Mirror用户也是露露柠檬的客户，这笔交易对这家专注于增长的零售商来说是一个很大的考验。\n去年，Mirror首席执行官布林·普特南(Brynn Putnam)告诉“快速公司”，她正在制造“下一代iPhone”。与另一家联网健身新贵不同，Mirror将是“你生活中的第三个屏幕，你将在未来使用它来获得所有身临其境的互动体验。”\n大约七个月后，普特南拉开了绳索，在全球大流行的情况下出售了她的公司-这是为身临其境的第三块屏幕量身定做的情况。\n那为什么“镜报”会卖出呢？露露提出了一个他们无法拒绝的提议。普特南是一位独行的女性创始人，她刚刚为自己、她的投资者和纽约的初创企业获得了一个“W”。\n除了显而易见的问题，我们可以公平地问，为什么是现在？在很多方面，佩洛顿强迫了普特南的手。\n将Mirror定位为“下一代iPhone”是一项战略举措。建立了一个价值7000万美元以上的宏伟愿景，以及2.)。帮助公司回避了这个问题，“你是如何与佩洛顿竞争的？”他们的回答很简单--我们没有。\n当COVID袭来的时候，镜子被归为一类。他们不是第三块银幕，他们是与佩洛顿直接竞争的。尽管销量激增，但与佩洛顿相比，Mirror的增长相形见绌。此外，越来越多的类似Mirror的竞争对手正在投放市场。突然之间，交互式屏幕感觉不到那么有新意，也不那么站得住脚了。\n与此同时，数字健身公司正在获得大量资金。随着Tone和Tempo瞄准新基金，Hydw、Aaptiv和Neou最近完成了投资。如果Mirror考虑在其COVID提升的基础上筹集资金，他们将不得不成为一台获取和留住客户的机器，根据佩洛顿现在公开(和飙升)的指标对每一项举措进行审计。\n最终，与露露柠檬联手比与佩洛顿决斗或坚持“第三屏”叙事更有说服力。\n在宣布这笔交易后，露露柠檬的股价大幅上涨，旁观者很快就对此赞不绝口。\n据美国银行(Bank Of America)分析师称，到2023年，Mirror可能会产生约7亿美元的收入，并达到60万订户。\n为了实现这一崇高的预测，露露柠檬将向其现有的客户群销售Mirrors，首先是其在全球的489家企业所有的门店。零售商将继续为平台创建内容，在平台上，镜子讲师将穿着露露柠檬装备。除了简单地销售更多的服装，Mirror创造经常性收入和加强Lulu与消费者关系的能力是此次收购的主要目的。\n虽然将一家运动休闲零售商转变为一家科技公司的艰苦工作才刚刚开始，但很难批评露露柠檬拍摄了这张照片。他们能不能继续成长，将是大家心头的问题：\n“Lulu没有表现出放缓的迹象，但在零售商核心技能之外进行的收购很少是天衣无缝的。现在这个故事没有什么坏处。Lulu(对投资者而言)最可怕的是，这就是它能得到的最好的结果吗？“BMO Capital Markets董事总经理兼高级零售分析师西蒙·西格尔(Simeon Siegel)说。\n在大流行期间，远程治疗正在获得吸引力。这可能是数百万与精神疾病作斗争的人解锁通道的关键。\n需求(那些需要护理的人)和供应(获得负担得起的医疗服务)之间存在着令人震惊的差距。\n能够获得护理的个人将平均等待约25天的预约时间。\n由于室内治疗每次治疗的费用为150-400美元，加上额外的药物费用，约45%的未接受治疗的个人将成本作为障碍。\n优点：在COVID期间，大多数治疗师从面对面治疗转向远程治疗。最近的一项调查发现，四分之三的临床医生专门使用远程治疗。事实证明，远程治疗在治疗创伤后应激障碍、抑郁症和焦虑方面与面对面治疗同样有效，这一事实有助于巩固这一转变。\n缺点：虽然远程护理的便利性和灵活性已被证明是有益的，但与隐私法规、保险覆盖范围、缩放疲劳和丢失的非语言提示相关的担忧给改善体验留下了很大的空间。\n根据Rock Health的数据，在2020年上半年，数字行为健康公司获得了5.88亿美元的资金-这个数字相当于之前任何一年这一类别的年度资金。\n展望未来：在焦虑和孤立达到历史最高水平的情况下，直面全球心理健康危机的必要性从未像现在这样强烈。数字行为健康是大流行中的一个亮点，它正在使人们失去尊严，并扩大获得护理的机会。\nLiteboxer是新贵X的最新成员，它的目标是在蓬勃发展的互联健身类别中进行拳击。\n内容：作为互动在家拳击体验FightCamp的竞争对手，Liteboxer提供1,495美元的独立、轻便的拳击包和每月29美元的内容订阅。\n工作原理：虽然FightCamp提供拳击跟踪技术和“真正的拳击手”的各种锻炼，但Liteboxer看起来很像拳击的舞蹈革命。与音乐同步的闪光灯会告诉用户应该击中哪里，力跟踪袋可以测量性能。\n展望未来：追随佩洛顿的脚步是诱人的，但家庭健身肯定是有上限的-特别是当每台设备的成本都在1500美元或更高的时候。\n对于他们来说，佩洛顿似乎正在重新考虑这个类别。有传言称，该公司正在研发一款联网的赛艇运动员。但最近，首席财务官吉尔·伍德沃斯(Jill Woodworth)表示，公司目前将放弃赛艇运动员，转而使用更便宜的跑步机。伍德沃斯还表示，为“新兵训练营类别”开发产品是当务之急。佩洛顿的“镜报”竞争对手正在筹备中吗？\n合成，一个迷幻的健康，研究和教育平台，完成了由诺瓦明德风险投资公司(Novamind Ventures)牵头的275万美元的种子资金。更多来自Fitt Insider的信息：迷幻健康的变革潜力。\nVR运动应用程序BoxVR的开发商FitXR完成了由Hiro Capital牵头的750万美元的首轮融资。\n前方，一个连接精神病学家和患者的平台，筹集了900万美元。更多来自Fitt Insider的消息：初创公司瞄准心理健康\n瑞典燕麦奶公司Oatly融资2亿美元，由黑石集团领投，估值为20亿美元。\nK4Connect是一家将新技术引入老年生活中心的初创公司，该公司结束了价值2100万美元的B系列投资。更多信息来自Fitt Insider：解决老年护理危机。\n强大的健康，一款针对50岁以上成年人的健身和营养应用程序，筹集了280万美元的资金。\n完美日(Perfect Day)，无动物乳蛋白制造商，将其C系列融资从之前宣布的1.4亿美元扩大到3亿美元。来自Fitt Insider的更多信息：寻找不含奶牛的牛奶。\n特鲁皮尔(Truepill)完成了一轮2500万美元的B轮融资。Truepill是Hims&amp；Her和GoodRx等公司背后与API相连的医疗基础设施。相关内容：Hims&amp；Hers首席执行官安德鲁·杜杜姆(Andrew Dudum)在Fitt Insider播客上表示。\n为婴幼儿生产更健康食品的Yamo公司在首轮融资中筹集了1010万欧元。更多来自Fitt Insider的报道：面对儿童肥胖症的女性。\n养殖肉类替代品制造商Mosa Meats从贝尔食品集团(Bell Food Group)获得了500万欧元的资金。\n植物性奶酪制造商Ground Foods在流浪狗资本(Sundy Dog Capital)的牵头下，筹集了174万美元的种子融资。\n运动服装初创公司NoBrakes Athletics完成了第一轮融资，金额不详。更多信息来自Fitt Insider：The New Athleasure Playbook。\n作为汇总战略的一部分，克莱夫·杰基(Krave Jerky)的创造者索诺马·布兰兹(Sonoma Brands)收购了厨师的Cut Real Jerky Co.。", "note_en": "M&amp;A is a mixed bag. In the case of activewear retailers, buying into digital fitness via high-profile purchases has  proven futile. So why did lululemon, a fast-growing apparel company, roll the dice on Mirror? One word: Nike.\n Nike is the king of activewear. Try as they might, foes like adidas, Reebok, and Under Armour are no match for the swoosh. For its part, lululemon hopes to become a worthy adversary — if for no other reason than to remain in the good graces of Wall Street. On both accounts, Mirror factors heavily into the equation.\n Putting this competition into context, lululemon trails Nike by an order of magnitude. Nike has a $152B market cap. Over the last 12 months, they’ve done $37B in sales. Meanwhile, lulu’s market cap is $37B, and the company had revenues of $3.85B over the same period.\n While shares of the yoga pant maker have outperformed Nike in recent years, lulu might not ever reach the scale of Nike. But beating Nike outright isn’t the point. Ultimately, lululemon is in competition with itself, where Nike represents the upper bounds of what’s possible.\n  To prove that they haven’t peaked, lululemon has one mandate: just keep growing.\n Moving beyond the yoga niche and expanding its total addressable market, the company’s  five-year strategic plan, released in April 2019, charted the path forward: “double men’s, double digital, and quadruple international” revenues. Add self-care products, a foray into footwear, and the opening of a 20,000-square-foot experiential store (complete with yoga studios and a restaurant) into the mix and grow they shall.\n A few months later, in November of 2019, lululemon invested $1M into Mirror’s $34M Series B-1, a bargain for a foothold in connected fitness. As part of the investment, and in keeping with its goal of becoming an experiential brand, lululemon ambassadors began creating workout content for the Mirror platform.\n Flash-forward to March: when COVID hit, the table was set. With retail stores shuttered and fitness studios closed, shopping and sweating moved online. In a few short weeks, lululemon had seen enough; they were ready to go all-in on Mirror.\n In the first week of store closures, 170K people joined lulu’s live workouts on Instagram.\n   86% of lulu customers who used an at-home option during the outbreak plan to continue or increase their new digital workout habit.\n In April, lulu’s online sales surged  125%, a trend that’s expected to continue. Add in the fact that some 50% of Mirror users are also lululemon customers, and this deal checks a lot of boxes for the growth-focused retailer.\n  Last year, Mirror CEO Brynn Putnam told Fast Company she was building “the next iPhone.” Far from another connected fitness upstart, Mirror would be “the third screen in your life that you’re going to turn to for all immersive interactive experiences going forward.”\n About seven months later, Putnam pulled the ripcord, selling her company amid a global pandemic — circumstances tailor-made for an immersive third screen.\n So why did Mirror sell? lulu made an offer they couldn’t refuse. Putnam, a solo, female founder just secured a “W” for herself, her investors, and New York’s startup scene.\n Beyond the obvious, it’s fair to ask,  why now? In many ways, Peloton forced Putnam’s hand.\n Pitching Mirror as the “next iPhone” was a strategic move that 1.) established a big vision worthy of $70M+ in funding, and 2.) helped the company duck the question, “how do you compete with Peloton?” Their answer was simple — we don’t.\n When COVID hit, Mirror was pigeonholed. They weren’t the third screen, they were in direct competition with Peloton. And despite surging sales, Mirror’s growth pales in comparison to Peloton’s. Plus, there’s  a growing list of Mirror-like competitors hitting the market. All of a sudden, an interactive screen didn’t feel all that innovative, or defensible.\n Meanwhile, digital fitness companies are raking in funding. Hydrow, Aaptiv, and NEOU recently closed investments as Tonal and Tempo target new funds. If Mirror considered raising on the back of its COVID boost, they’d have to become a customer acquisition and retention machine, where every move is audited in relation to Peloton’s now public (and soaring) metrics.\n In the end, joining forces with lululemon was more compelling than slugging it out with Peloton or adhering to the “third screen” narrative.\n  Upon announcing the deal, lululemon’s stock jumped, and onlookers have been quick to heap on the praise.\n According to Bank of America analysts, Mirror could generate  $700M in revenue and reach 600,000 subscribers by 2023.\n To realize this lofty forecast, lululemon will sell Mirrors to its existing customer base, starting with its 489 corporate-owned stores across the globe. The retailer will continue creating content for the platform, where Mirror instructors will be clad in lululemon gear. More than simply selling more apparel, Mirror’s ability to generate recurring revenue and strengthen lulu’s relationship with consumers is the chief aim of this acquisition.\n While the hard work of transforming an athleisure retailer into a tech company is just beginning, it will be difficult to criticize lululemon for shooting this shot. Whether or not they can keep growing will be the question on everyone’s mind:\n “Lulu is showing no signs of slowing down, but acquisitions made outside a retailer’s core skill set have rarely been seamless. There is nothing bad about the story right now. The scariest thing [for investors] about Lulu is, is this as good as it gets?” – Simeon Siegel, managing director &amp; senior retail analyst at BMO Capital Markets.\n  Teletherapy is gaining traction during the pandemic. It just might be the key to unlocking access for millions of individuals battling mental illness.\n There’s a  shocking gap between demand (those in need of care) and supply (access to affordable care).\n Individuals who are able to access care will wait an average of  25 days for an appointment.\n With in-room therapy costing $150–$400 per session, plus the added cost of medication,  45% of untreated individuals cite cost as a barrier.\n Pros: During COVID, the majority of therapists switched from in-person to remote therapy. A recent  survey found that three quarters of clinicians are exclusively using teletherapy. The fact that teletherapy has been  shown to be just as effective as in-person therapy for treating PTSD, depression, and anxiety helped solidify the switch.\n Cons: The convenience and flexibility of remote care have proven beneficial, but concerns related to privacy regulations, insurance coverage, Zoom fatigue, and missing non-verbal cues leave a lot of room for improving the experience.\n  According to  Rock Health, in the first half of 2020, digital behavioral health companies received  $588M in funding — a number equal to the annual funding for this category in any previous year.\n Looking ahead: With anxiety and isolation at an  all-time high, the need to confront the  mental health crisis has never been greater. A bright spot amid the pandemic, digital behavioral health is  destigmatizing and expanding access to care.\n  Liteboxer, the latest  Peloton of ‘X’ upstart, is taking aim at boxing within the booming connected fitness category.\n What it is: A competitor to FightCamp, an interactive at-home boxing experience, Liteboxer offers a free-standing, light-up punching bag for $1,495 and a $29/month content subscription.\n How it works: While FightCamp offers punch tracking technology and a variety of workouts from “real fighters”, Liteboxer looks a lot like Dance Dance Revolution for boxing. Flashing lights synced to music tell users where to hit and a force-tracking bag measures performance.\n Looking ahead: Following in Peloton’s footsteps is tempting, but surely at-home fitness has a ceiling — especially when every piece of equipment costs $1,500 or more.\n For their part, Peloton appears to be rethinking the category a bit. The company was rumored to be working on a connected rower à la Hydrow. But recently, CFO Jill Woodworth  said the company will forgo the rower, for now, in favor of a cheaper treadmill. Woodworth also said developing a product for the “boot camp category” is a priority. Is Peloton’s Mirror competitor in the works?\n    Synthesis, a psychedelic wellness, research, and education platform, closed  $2.75M in seed funding led by  Novamind Ventures.  More from Fitt Insider:   The Transformative Potential of Psychedelic Wellness\n FitXR, the developer of VR exercise app BoxVR, closed  $7.5M in Series A funding led by  Hiro Capital.\n Ahead, a platform that connects psychiatrists with patients, raised $9M.  More from Fitt Insider:   Startups Take Aim at Mental Health\n Oatly, a Swedish oat milk company, raised  $200M in funding led by  The Blackstone Group at a $2B valuation.\n K4Connect, a startup bringing new tech to senior living centers, closed its  $21M Series B.  More from Fitt Insider:   The Senior Care Crisis\n Mighty Health, a fitness and nutrition app targeting adults age 50+, raised  $2.8M in funding.\n Perfect Day, makers of animal-free dairy proteins, expanded its Series C round from a previously announced $140M up to $300M.  More from Fitt Insider:   The Quest for Cow-Free Milk\n Truepill,  the API-connected healthcare infrastructure behind companies like  hims &amp; hers  and  GoodRx , closed a  $25M  Series B funding round.  Related:  hims &amp; hers CEO Andrew Dudum on the  Fitt Insider podcast .\n yamo, makers of healthier food for babies and young children, raised  €10.1M in Series A funding.  More from Fitt Insider:   Confronting Childhood Obesity\n    Mosa Meats, makers of cultured meat alternatives, secured  €5M in funding from  Bell Food Group.\n Plant-based cheese maker  Grounded Foods raised a  $1.74M seed round led by Stray Dog Capital.\n NoBrakes Athletics, an athletic apparel startup, closed a  funding round of undisclosed amount.  More from Fitt Insider:   The New Athleisure Playbook\n     Sonoma Brands, creator of  KRAVE Jerky,  acquired Chef’s Cut Real Jerky Co. as part of a roll-up strategy.", "posttime": "2020-07-15 06:44:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "交易,mirror,breaking", "title": "打破Lululemon以5亿美元收购Mirror的交易", "title_en": "Breaking Down Lululemon's $500M Mirror Acquisition", "transed": 1, "url": "https://insider.fitt.co/issue-no-87-why-mirror-sold/", "via": "", "real_tags": ["交易", "mirror", "breaking"]}, {"category": "", "categoryclass": "", "imagename": "84092daebabb09d4f166a05e96e73618.jpg", "infoid": 1011896, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您要么与在爱沙尼亚境外注册的公司签订了有效的雇佣合同，通过在国外注册的您自己的公司开展业务，要么为大部分在爱沙尼亚以外的客户做自由职业者。\n你可以提供证据，证明你的收入在申请前六个月内达到了最低门槛。目前，月收入门槛为3504欧元(税收总额)。\n在线填写申请表。打印表格并在填写后签名。C型(短期停留)签证的州费是80欧元，D型(长期停留)签证是100欧元。\n预约您最近的爱沙尼亚大使馆或领事馆提交您的申请。请务必携带所需证明文件的复印件。\n如果你已经在爱沙尼亚合法居留，并想延长逗留时间，你也可以在警察和边境警卫队委员会办公室申请这一签证。如果您选择在爱沙尼亚申请，请确保您有足够的时间处理申请。\n您可以申请爱沙尼亚长期停留签证(D-VISA)或爱沙尼亚短期停留签证(C-VISA)，具体取决于计划的停留时间。\n除了一般的签证申请程序和规则外，你还需要提供证明你符合成为独立于地点的雇员或数字游牧者的资格要求的文件。\n没有人自动有资格获得签证，他们的背景像其他签证申请者一样受到仔细检查。\n由于新冠肺炎疫情的持续影响，爱沙尼亚的边境目前对有限的国家开放。数字游牧签证的持有者仍然需要遵守这些规则。欲了解最新情况，请浏览外交部网站。\n有关数字游牧签证、资格、申请流程和相关问题的更多信息，请阅读我们的博客文章和详细的常见问题。\n如果您是人类，请将此字段留空：我希望通过电子邮件接收来自e-Residency的时事通讯和特别优惠。我知道我可以随时通过单击任何电子邮件页脚中的取消订阅链接来改变主意。有关e-Residency团队如何处理您的数据的信息，请阅读我们的隐私政策", "note_en": "You either have an active employment contract with a company registered outside of Estonia, conduct business through your own company registered abroad, or work as a freelancer for clients mostly outside of Estonia.\n You can provide evidence that your income met the minimum threshold during the six months preceding the application. Currently, the monthly income threshold is €3504 (gross of tax).\n  Fill in the  application form online. Print the form and sign it after completion. The state fee is 80€ for a Type C (short stay) visa and 100€ Type D (long stay) visa.\n Make an  appointment  at your nearest  Estonian Embassy or Consulate to submit your application. Make sure you bring copies of any required supporting documents.\n  If you are already legally in Estonia and would like to extend your stay, you can also apply for this visa at a Police and Border Guard Board office. If you choose to apply in Estonia, make sure you have enough time for the application processing period.\n  You can apply for an Estonian long-stay visa (D-visa) or a short-stay visa to Estonia (C-visa), depending on the planned period of stay.\n  In addition to the general visa application procedure and rules, you’ll need to provide documents proving that you meet the eligibility requirements of being a location-independent employee or digital nomad.\n  No person is automatically eligible for a visa and their background is checked as carefully as for other visa applicants.\n  Due to the continued impact of the COVID-19 pandemic, Estonia’s borders are currently open to limited countries. Holders of the digital nomad visa will still need to comply with these rules. For the latest information, please visit the    Ministry of Foreign Affairs website.\n  For more information about the Digital Nomad Visa, eligibility, the application process, and associated issues, please    read our blog post and   detailed FAQ.\n  Leave this field empty if you&#39;re human:    I would like to receive newsletters and special offers via email from e-Residency. I understand that I can change my mind at any time by clicking the unsubscribe link in the footer of any email. For information about how the e-Residency team processes your data, please read our  Privacy Policy", "posttime": "2020-07-15 06:44:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "远程工作,游牧,launching,签证", "title": "爱沙尼亚正在为远程工作者推出新的数字游牧签证", "title_en": "Estonia is launching a new Digital Nomad Visa for remote workers", "transed": 1, "url": "https://e-resident.gov.ee/nomadvisa/", "via": "", "real_tags": ["远程工作", "游牧", "launching", "签证"]}, {"category": "", "categoryclass": "", "imagename": "295f283a011c92b24b56be45345a4b3a.png", "infoid": 1011895, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub是5000多万开发人员共同工作的家园。加入他们，发展您自己的开发团队，管理权限，并在项目中进行协作。\n报名", "note_en": "GitHub is home to over 50 million developers working together. Join them to grow your own development teams, manage permissions, and collaborate on projects.\n  Sign up", "posttime": "2020-07-15 06:44:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开源,卫星,open,发展", "title": "开放卫星计划：开源卫星计划", "title_en": "Open Satellite Project: The Open Source Satellite Project", "transed": 1, "url": "https://github.com/opensatelliteproject", "via": "", "real_tags": ["开源", "卫星", "open", "发展"]}, {"category": "", "categoryclass": "", "imagename": "a908bf53562e558885f2e2184329a0c8.jpg", "infoid": 1011894, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "获取突发新闻警报和特别报道。重要的新闻和故事会在工作日早上发布。\n订阅。\n旧金山--2015年，软件工程师彼得·穆迪(Peter Moody)开始在优步(Uber)工作，优步当时是最热门的公司之一。他接受了科技初创公司常见的交易：薪水较低，但承诺股票。\n过去一年，不仅优步股价下跌--这是正常的可能性，尤其是在经济衰退期间--而且在过去几个月里，穆迪和其他曾在优步工作过的人表示，他们还遭受了巨额税单的打击，在某些情况下，这可能抹去了他们最初在优步工作时承诺的回报。\n在周三报税截止日期之前，一些人刚刚发现了这些税单，这让人感到意外。\n前员工表示，优步应为税单负责，这要归功于该公司在2019年5月，也就是上市前几天做出的一个鲜为人知的最后一刻的决定。他们表示，优步实际上将潜在的税收风险从公司转移到了他们和其他现任和前任员工身上，从最近的员工一直到高管。\n包括穆迪在内的五名优步前雇员在接受采访时表示，他们非常愤怒，正在考虑起诉他们的前雇主。旧金山律师雷·加洛(Ray Gallo)说，大约2亿美元岌岌可危，他已经有60人签署了他计划提起的集体诉讼，尽管这件事可能会以仲裁告终。\n这种情况引发了人们对硅谷支付员工薪酬模式的可持续性的质疑。这些前员工表示，如果其他初创公司效仿优步，转移税收风险，那么就会有更少的人冒险从事主要以股票承诺支付的工作。\n今年的税单意味着穆迪在这家旧金山初创公司多年的努力不会像他预期的那样得到回报。他说，他原本计划把股票薪酬投资到他的两个孩子的大学基金中。\n他说，在卖掉所有RSU后，没有钱或非常、非常少的钱就离开是一种非常现实的可能性，他指的是限制性股票单位，这是一种股票补偿形式。\n将关于快速变化的媒体和技术世界的突发新闻和内部分析直接发送到您的收件箱。\n优步是一家早期的零工经济公司，曾积极扩张，已经习惯于应对司机、乘客、餐馆和城市监管机构的愤怒投诉，但前员工对薪酬的投诉就不那么常见了。现在，一些人说，他们怒不可遏。\n一位不愿透露姓名的前雇员表示：有些人放弃了加入优步的机会，在优步工作了4年，以为他们的薪酬方案中会有股权。由于担心公开发言会引起反响，这位前雇员要求匿名。\n他说：我不相信他们会预料到事情会这样发展，如果他们知道这一点，他们可能会做出不同的决定。\n争论的焦点是优步将承诺的股票交付给员工的确切日期。持有即将上市公司股票的员工或早期投资者通常需要等待一段时间后才能出售股票，这一规定被称为禁售期。\n公司还决定何时向员工发放股票。一个人收到股票的时间可能会产生重大的税收后果。\n优步在2019年5月IPO当天向员工交付股票，意味着员工将按每股45美元的价格征税。但员工们被限制在六个月内出售他们的股票，当时股价已跌至每股27美元左右。\n员工股东的代理律师加洛(Gallo)表示，优步应该在11月禁售期结束时交付股票，提前和解日期违反了他们的合同。他说，优步受益于消除了薪酬支出的不确定性，将税收风险转嫁给了员工。\n加洛说：科技行业在一定程度上是基于这样一种想法，即你会拿到很低的工资，我们会像狗一样努力工作，但当IPO发生时，你会得到这笔巨额奖金。他说，与他交谈过的大多数现任或前任优步员工都被卖空了2万至5万美元。\n他和优步的前员工说，他们不知道其他科技初创公司的IPO也有类似的情况。\n在过去的几周里，这个话题已经成为优步前员工的话题，许多人通过短信和电子邮件表达了他们的不满。\n一名前雇员说，很多人只是在和他们的会计师交谈，刚刚拿到他们的税单。她说，如果提到她的名字，她担心会遭到报复。当你的眼睛从脑海中跳出来的时候，它就像卡通一样。\n法律专家表示，结果将取决于优步与其员工之间的合同语言。\n圣克拉拉大学(Santa Clara University)研究劳动法的法学教授唐纳德·波登(Donald Polden)表示，问题很可能是，优步在构建期权计划时是否像它那样存在严重疏忽，或者它是否违反了联邦证券法。他说，这些前员工面临着一项艰巨的任务。\n但杜克大学(Duke University)专门研究证券法的教授詹姆斯·考克斯(James Cox)表示，还有一条原则是各方公平和真诚地交易。他说，合同的一方不应该破坏另一方预期的利益。", "note_en": "Get breaking news alerts and special reports. The news and stories that matter, delivered weekday mornings.\n SUBSCRIBE\n  SAN FRANCISCO — When software engineer Peter Moody went to work in 2015 at Uber, then one of the hottest companies to work for, he took a deal common at tech startups: a lower salary but the promise of stock.\n    Not only has Uber&#39;s stock dropped in the past year — a normal possibility, especially during a recession — but in the past few months, Moody and others who have worked at Uber said they&#39;ve also been hit by huge tax bills, which in some cases may have wiped out the promised reward that led them to go to work there in the first place.\n The tax bills have been a surprise that some are just finding out about ahead of Wednesday&#39;s  tax filing deadline.\n And Uber is to blame for the tax bills, former employees said, thanks to a little-noticed, last-minute decision the company made in May 2019, days before its  stock market debut. They said Uber in effect shifted potential tax risk from the company to them and other current and former employees, from recent hires all the way up to executives.\n Five former Uber employees, including Moody, said in interviews that they&#39;re angry enough that they&#39;re considering suing their former employer. Ray Gallo, a lawyer in San Francisco, said that about $200 million is at stake and that he has 60 people signed up  for a class-action lawsuit he&#39;s planning to file, although the matter may end up in arbitration.\n  The situation raises questions about the sustainability of the Silicon Valley model of paying employees. If other startups do what Uber did by shifting tax risk, the former employees said, fewer people will risk taking jobs for which they would be paid mostly in promises of stock.\n This year&#39;s tax bill means that years of work Moody put in at the San Francisco startup won&#39;t pay off as he expected. He said he had planned to put his stock compensation into his two kids&#39; college funds.\n &#34;Walking away with no money or very, very little money after selling all of the RSUs was a very real possibility,&#34; he said, referring to restricted stock units, a form of stock compensation.\n Get breaking news and insider analysis on the rapidly changing world of media and technology right to your inbox.\n    Uber, an early gig-economy company that expanded aggressively, is used to fielding angry complaints from  drivers,  passengers,  restaurants and  city regulators, but complaints from former employees about compensation have been less common. Now, some said, they&#39;re furious.\n &#34;There were folks who gave up opportunities to join Uber and worked four years assuming there would be equity as part of their compensation package,&#34; said a former employee who spoke on condition of anonymity because he feared repercussions from speaking publicly.\n &#34;I don&#39;t believe they expected it to play out this way, and had they known that, they might have made a different decision,&#34; he said.\n  At issue is the exact date Uber delivered the promised shares to its employees. Employees or early investors who hold stock in companies that are going public are typically required to wait to sell their shares until a certain amount of time has passed, a rule known as a lockup period.\n Companies also decide when to grant stock to employees. The timing of when a person receives stock can have significant tax consequences.\n Uber delivered shares to its employees on the day of its IPO in May 2019, meaning employees would be taxed at the price of $45 a share. But the employees were restricted from selling their shares for six months, by which point the price had fallen to around $27 a share.\n Gallo, the lawyer representing the employee-shareholders, said that Uber should have delivered the shares when the lockup ended in November and that  moving up the &#34;settlement&#34; date violated their contracts. Uber benefited by eliminating uncertainty around its compensation expenses, offloading tax risk onto employees, he said.\n  &#34;The tech industry is based in part on this idea that you&#39;re going to get low wages and we&#39;re going to work you like a dog but you&#39;ll get this huge payout when the IPO happens,&#34; Gallo said. Most of the current or former Uber employees he&#39;s spoken with were shorted out of $20,000 to $50,000, he said.\n He and the former Uber employees said they weren&#39;t aware of a similar situation with other tech-startup IPOs.\n In the past several weeks, the subject has become the talk of former Uber employees, with many pouring out their frustrations in text messages and emails.\n &#34;Multiple people are just having conversations with their accountants and are just getting their tax bill,&#34; said one of the former employees, who said she feared reprisals if she was quoted by name. &#34;It&#39;s like a cartoon when your eyes pop out of your head.&#34;\n  Legal experts said the outcome would come down to the language of the contract between Uber and its employees.\n &#34;The question will likely be whether or not Uber was grossly negligent in structuring the option plan as it did&#34; or whether it otherwise violated federal securities law, said Donald Polden, a Santa Clara University law professor who studies employment law. He said the former employees face a difficult task.\n But James Cox, a Duke University professor who specializes in securities law, said there&#39;s also a principle that parties deal fairly and in good faith. One side to a contract shouldn&#39;t &#34;destroy the contemplated benefit of the other party,&#34; he said.", "posttime": "2020-07-15 06:43:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高额,employees,优步", "title": "优步前员工被高额税单吓了一跳", "title_en": "Ex-Uber employees are being surprised by big tax bills", "transed": 1, "url": "https://www.nbcnews.com/tech/tech-news/ex-uber-employees-are-being-surprised-big-tax-bills-they-n1233699", "via": "", "real_tags": ["高额", "employees", "优步"]}]