[{"category": "", "categoryclass": "", "imagename": "8f1c49a21c8939273e52b227e4f9ccf4.jpg", "infoid": 1013529, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sack表示，它已向欧盟执委会提交了针对微软的反竞争申诉。斯拉克在一份声明中说：“诉状详细说明了微软滥用其市场主导地位，在违反欧盟竞争法的情况下扼杀竞争的非法和反竞争行为。”Sack指控微软将其Microsoft Teams产品“非法捆绑”到Office上，并“强迫数百万人安装，阻止其移除，并向企业客户隐瞒真实成本。”\n“微软正在恢复过去的行为，”Slake的总法律顾问大卫·谢尔哈斯(David Schellhase)声称。“他们创造了一个薄弱的山寨产品，将其与占主导地位的Office产品捆绑在一起，强行安装并阻止其删除，这是他们在‘浏览器大战’期间非法行为的翻版。”Sack要求欧盟委员会迅速采取行动，确保微软不会继续通过捆绑或捆绑产品的方式非法利用其权力从一个市场转移到另一个市场。\nSack一直声称微软团队不是真正的竞争对手，很大程度上是因为它更专注于视频通话和会议。这显然不是真的，Slake和微软几个月来一直在为未来的工作场所通信而战。\n微软声称，Slake没有“广度和深度”来重塑工作，而Slake首席执行官斯图尔特·巴特菲尔德此前曾表示，微软“不健康地全神贯注于杀死我们”。\n两家公司的竞争最早始于近四年前，当时斯拉克付费在报纸上刊登整版广告，“欢迎”微软团队成为竞争对手。微软在一年前超过了Slake的使用率，最近由于与流行病相关的需求，用户数量大幅增加。微软透露，早在4月份，它就拥有7500万微软团队的日活跃用户，该公司很可能在今天晚些时候的财报电话会议上更新这一数字。\nSack此前透露，早在10月份，它就拥有1200万日活跃用户，但自那以后，该公司再也没有公开更新过这一数字。早在3月份，随着越来越多的企业转向远程工作，Sack确实打破了用户纪录。\n欧盟执委会现在将评估斯拉克的申诉，以确定其是否符合正式调查的理由。微软自2008年以来就没有在欧洲面临过正式的反垄断调查，当时该公司在将Internet Explorer与Windows捆绑后，最终被迫提供浏览器投票选择。微软随后被罚款7.3亿美元，因其未能在Windows7SP1中包含浏览器投票屏幕。", "note_en": "Slack says it has filed an anti-competitive complaint against Microsoft with the European Commission. “The complaint details Microsoft’s illegal and anti-competitive practice of abusing its market dominance to extinguish competition in breach of European Union competition law,” says Slack  in a statement. Slack alleges that Microsoft has “illegally tied” its Microsoft Teams product to Office and is “force installing it for millions, blocking its removal, and hiding the true cost to enterprise customers.”\n “Microsoft is reverting to past behavior,” claims David Schellhase, general counsel at Slack. “They created a weak, copycat product and tied it to their dominant Office product, force installing it and blocking its removal, a carbon copy of their illegal behavior during the ‘browser wars.’ Slack is asking the European Commission to take swift action to ensure Microsoft cannot continue to illegally leverage its power from one market to another by bundling or tying products.”\n Slack has  persistently claimed that Microsoft Teams is not a true competitor, largely because it’s more focused on video calls and meetings. That’s clearly not true, and Slack and Microsoft have been caught in a battle for the future of workplace communications for months now.\n   Microsoft claimed Slack doesn’t have the “breadth and depth” to reinvent work, and Slack CEO Stewart Butterfield has previously said that Microsoft is “ unhealthily preoccupied with killing us.”\n The competition between the two companies first began nearly four years ago when  Slack paid for a full-page newspaper ad to “welcome” Microsoft Teams as a competitor.  Microsoft overtook Slack usage a year ago, and has hit big user numbers recently thanks to pandemic-related demand. Microsoft revealed it had  75 million daily active users of Microsoft Teams back in April, and the company may well update that figure during its earnings call later today.\n Slack previously revealed it has  12 million daily active users back in October, but the company has not publicly updated this number ever since.  Slack did break user records back in March as more businesses turned to remote working.\n The European Commission will now assess Slack’s complaint to determine whether it meets grounds for a formal investigation. Microsoft hasn’t faced a formal antitrust investigation in Europe since 2008, when the company was eventually forced to offer a browser ballot choice after bundling Internet Explorer with Windows.  Microsoft was later fined $730 million for failing to include the browser ballot screen in Windows 7 SP1.", "posttime": "2020-07-23 00:10:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,竞争,files,slake", "title": "Sack在欧盟对微软提出竞争申诉", "title_en": "Slack files competition complaint against Microsoft in the EU", "transed": 1, "url": "https://www.theverge.com/2020/7/22/21333989/slack-microsoft-eu-competition-complaint-teams-office", "via": "", "real_tags": ["microsoft", "微软", "竞争", "files", "slake"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013528, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "處理這個邀請時發生問題，我們正盡快修復.", "note_en": "處理這個邀請時發生問題，我們正盡快修復。", "posttime": "2020-07-23 00:10:10", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,深度学习,programming,翻译,learning", "title": "在编程语言之间进行翻译的深度学习", "title_en": "Deep learning to translate between programming languages", "transed": 1, "url": "https://ai.facebook.com/blog/deep-learning-to-translate-between-programming-languages", "via": "", "real_tags": ["编程", "深度学习", "翻译", "learning"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013527, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，我写了“IPv6是一个好设计的世界”(The World What IPv6 Is A GoodDesign)一书。我仍然为那篇文章感到自豪，但我想我应该更新一下。\n不，我不会改变立场的。与三年前一样，IPv6距离普遍采用或成为我们这个世界的好设计还很遥远。但从那时起，我与人共同创立了一家公司，结果意外地基于我在那篇文章中概述的原则。或者更确切地说，是为了避免颠覆这些原则。\n在那篇文章中，我探讨了网络的总体历史以及导致IPv6的考虑因素。我不打算再报道那块地了。相反，我想谈谈态度。\n当我在20世纪90年代第一次加入互联网时，我找到了丢失已久的入门教程。它谈到了互联网(小写I)和互联网(大写I)之间的区别。互联网是将较小的网络连接在一起的任何网络。互联网是…。嗯..。事实证明，你不需要一个以上的互联网。如果您有两个Internet，那么几乎不可避免的是，很快就会有人想出如何将它们连接在一起。你所需要的只是一个人建立一个链接，你的两个互联网就变成了一个。通过诱导，当你让一个有动力的人足够容易地将一个互联网连接到另一个互联网上时，互联网就是最终的结果。\n互联网基本上是马虎的。不管你可能组成多少个委员会，最终联系都是由个人把事情拼凑在一起建立起来的。这些东西可能符合规格，也可能不符合规格。他们可能会很好地遵守这些规格，也可能会很差。他们可能会违反规范，因为其他所有人也都违反了规范，而这是让一切正常工作的唯一方法。连接本身可能很快或很慢，或者很关键，或者每天只工作几分钟，或者受到业余无线电规则的约束，或者更糟。终端可能是功能强大的服务器、自动售货机、烤面包机或卫星，运行任何可以想象到的操作系统。只有一件事是肯定的：它们都有窃听器。\n这就把我们带到了波斯特定律，这是我在写关于网络的文章时总是提到的。当我这样做的时候，总是会有很多人回应，争论波斯特尔定律是正确的，还是一个好主意，就好像它只是一个想法，而不是自然的力量。\n邮政定律说得很简单：在你发送的东西上要保守，在你接受的东西上要自由。尽力正确处理另一端产生的窃听器。最成功的网络节点是对输入中可能存在的每一种不可能的损坏进行计划，并在它发生时采取合理措施的节点。(有时候，是的，抛出一个错误是明智的。)。\n[旁注：邮政定律并不是在所有情况下都适用。您可能不希望您的编译器自动修复您的语法错误，除非您的编译器是javascript或HTML，撇开玩笑不说，它们实际上是为Postel&#39；slaw原因而设计来进行这种自动更正的。但这条法律确实适用于几乎所有需要有效沟通的复杂情况，包括人与人之间的对话。我喜欢这样说，需要两个人才能沟通。一个好的倾听者，或者一个熟练的演说家，可以解决很多冲突。]\n波斯特尔定律是互联网所依据的原则。这并不是因为JonPostel是一位伟大的推销员，他说服了每个人，而是因为这是互联网竞争中唯一取胜的进化策略。自然并不关心你对波斯特定律的看法，因为唯一会发生的互联网就是遵循波斯特定律的互联网。每一个其他的互联网最终都会无一例外地被一些做错了的傻瓜加入到互联网中，但只要做得足够好，它就会增加价值，所以最终没有人愿意切断这种连接。然后，为了保持这种联系，将需要进一步应用波斯太尔定律(Postel&#39；‘s Law)。\n如果你读了我的文章，你可能已经看到我把IPv6称为第二个互联网，并不是每个人都能连接到它。这一说法是站不住脚的。让我们往后退一点。\n在IPv6是一个好设计的世界里，我谈到了导致IPv6的崇高设计目标：消除总线网络，去除MAC地址，不再有交换机和集线器，不再有NAT等等。我当时没有意识到的是，现在我认为这是至关重要的，与IPv4(以及导致v4的早期协议)相比，这些目标是一种根本的态度转变。\nIPv4演变成一种实用的方式，可以用一堆已经存在的网络和机器来构建互联网。波斯特尔定律说，你最好面对现实，而不是你希望的那样，他们也是这样做的。当某些东西无法连接时，有人会黑掉它，直到它正常工作。太草率了。断断续续，缠绕和胶带。但最重要的是，没有人真的认为这整个烂摊子会在最终奏效时发挥作用，或者只要它最终被证明是持续的，就会持续下去。当时，没有人知道，每当你开始建设互联网时，它们总是无情地通向互联网。\n当这些(大部分)人开始意识到他们制造的怪物时，他们开始担心。他们意识到，32位的地址，他们原本认为可以很容易地在他们小小的互联网的一生中持续下去，现在甚至不足以满足世界上每个人一个地址的需求。他们发现，并不是真的让任何人感到惊讶，波斯特尔定律，尽管它可能是坚定不移的，绝对是一个持续的噩梦。他们认为，在他们创建的这个非常流行的互联网成为可获得的、全球性的、必不可少的服务突然崩溃之前，他们最好快点修复这一切，这一切都将是他们的错。在此之前，他们认为自己最好快点修复这一切，以免这个非常流行的互联网突然崩溃，这一切都将是他们的错。\n[剧透：它从来没有倒塌过。嗯，不是永久的。时不时地会有短暂的突发事件，现在也是如此，但少数几个专注的灵魂把它重新组合在一起，就这样过去了。]。\nIPv6是在一个充满恐惧、可伸缩性问题和第二个系统效应的新环境中创建的。正如我们上一次所述，它的目标是用一个新的Internet取代Internet-一个不会犯下所有相同错误的Internet。这样黑客就会少一些。我们将在几年内逐步升级到它，就像我们在过去升级到更新版本的IP和TCP时所做的那样。\n我们很难责怪人们相信这会奏效。甚至连“第二体系效应”这个术语在当时也只有20年左右的历史，而且并不广为人知。以前的每一次互联网升级都很顺利。以前没有人建造过这么大的互联网，有这么多的邮政法则，有如此多的用户、供应商和系统，所以没有人知道会有什么不同。\n嗯，25年后的今天，我们并没有太大的变化。如果我们感到尖酸刻薄，我们或许可以将IPv6描述为“网络串论”：这是一个长达数十年的无聊玩意儿，吸引了真正的信徒，如果你质疑这一学说，你会勃然大怒，而且值得注意的是，它在多大程度上阻碍了进步。\n当然，仍然没有例外的规则，即如果你建立任何互联网，它将不可避免地(通常是很快)连接到互联网。\n当它发生时，我并没有坐在那里，但它很可能是第一个IPv6节点，它运行在一台也连接到IPv4的机器上，前提是有人可以远程登录到它进行调试。今天，即使是纯IPv6节点也几乎可以肯定地连接到一个网络，如果配置正确，可以找到通往任何IPv4节点的方法，反之亦然。这可能并不美观，它可能涉及很多代理、NAT、网桥和防火墙。但这是千丝万缕的。\n从这个意义上说，仍然只有一个互联网。这是个大问题。从第一天开始，互联网就从来没有说过只有一种协议；它总是由路由器、网桥和网关组成的乱七八糟的东西，在很多层上运行着许多协议。IPv6就是其中之一。\nIPv6的特别之处在于，它的支持者并不满足于它是一个连接到互联网的互联网。不！它是被选中的。它的命运是互联网。因此，我们不仅有连接IPv6互联网和IPv4互联网的网桥和网关(尽管我们确实有)。\n相反，IPv6希望最终直接在每个节点上运行。最终用户一直不愿意放弃IPv4，所以现在，每个节点也都有IPv4。因此，机器通常直接连接到我所说的两个相互竞争的互联网-IPv4互联网和IPv6互联网。\n好的，在这一点上，我们的术语变得非常混乱。抱歉，但所有这些都引出了一个问题，我知道你想让我回答：哪个互联网更好！？\n我会讲到这一点，但首先我们需要回顾一下我勇敢地称之为艾弗里的无线可靠性定律，它不是定律，肯定是别人发明的(因为它们大多是对CAP定理的一个微不足道的子集的诠释)，而且事实证明，它不仅仅适用于WiFi。哎呀。我猜这个名字几乎在很大程度上是错的。尽管如此，它们仍然是相当好的指导方针。\n规则1：如果您有两个wifi路由器品牌，可用于90%的客户端设备，而您的设备其中一个出现问题，则更换wifi路由器品牌可以解决90%的问题。因此，提供两台WiFi路由器的ISP有[1-(10%x 10%)]=99%的最终成功机会。\n规则2：如果您同时运行两个WiFi路由器(例如，一个主路由器和一个扩展器)，并且这两个路由器每天大约90%的时间都工作正常，那么您的网络全天没有问题的可能性为81%。\n这取决于您必须构建多少分布式系统，这要么非常明显，要么真的让人大吃一惊。为甚麽第一个方案的成功率跃升至99%，而第二个方案的成功率则跌至81%呢？有什么不同呢？还有.。这些情况中哪一种类似于IPv6？\n或者我们可以用另一种方式问这个问题。为什么有这么多网页建议您通过禁用IPv6来解决连接问题？\n让我们把事情简单化吧。IPv4是将客户端A连接到服务器X的一种方式，IPv6是第二种方式。这类似于从电缆和DSL提供商那里购买冗余的家庭IPv4连接，然后将它们插入同一台计算机。无论哪种方式，您都有两个独立的互联网连接。\n当您有两个连接时，您必须在它们之间进行选择。这里有一些你可以考虑的因素：\n哪一家甚至提供了从A到X的路径？(例如，如果X没有IPv6地址，那么IPv6就不是一个选项。)。\n哪一个给出了从A到X和从X到A的最短路径？(您可以使用Hopcount或延迟来评估它，例如，就像在我的旧netselect程序中一样。)\n哪条路径最少掉线？(重新启动的NAT将丢弃IPv4上的TCP连接。但IPv6路由更改更频繁。)。\n哪一个有漏洞的防火墙或NAT挡住了去路？他们是完全阻止它(很容易)，还是表现得很奇怪(很难)？\n哪一个错误配置为阻止某些ICMP数据包，从而使PMTU发现(始终或有时)不适用于部分或所有主机？\n一种名为“快乐眼球”的常见启发式方法是在路线之间进行选择的一种方式，但它只涵盖了其中的几个标准。\n事实是，要回答所有这些问题是极其困难的，即使你能回答，A和X的每一种组合的答案也是不同的，而且它们会随着时间的推移而变化。操作系统、网络浏览器和应用程序，即使它们实现了“快乐眼球”或类似的东西，也往往在检测所有这些边缘情况时表现得相当糟糕。而且每个APP都要单独做这件事！\n我的主张是，在两个互联网之间进行选择的问题与在同一SSID上的两个古怪的WiFi路由器之间进行选择的问题(规则2)相同。只要两个网际网络(或两个WifiRouter)都正常工作，一切都很好。一旦一个人行为怪异，你所有的结果都会变得怪异。\n……互联网总是行为怪异，这是因为波斯特定律的暴政。调试互联网是一项全职工作。\n现在有两个互联网，重叠程度低得令人吃惊，所以你的ISP必须构建和调试这两个互联网。\n而且每个操作系统供应商都必须调试这两种协议实现，这需要两倍以上的代码。\n……而且每个应用程序供应商都必须同时测试IPv4和IPv6，而他们当然不会这样做。\nIPv6的支持者对此了如指掌，无论是理性的还是直觉的，或者至少是经验上的。两个不稳定的互联网连接在一起的故障率比单独连接两个不稳定的互联网的故障率要高。\n这导致他们得出了你听过很多次的相同结论：我们应该干掉其中一个互联网，这样我们就可以把时间花在让剩下的一个互联网不那么摇摇欲坠，而不是把我们的精力分散在这两个互联网上。哦，很明显，我们杀死的是IPv4，谢谢。\n他们没有错！只用一个互联网进行调试会容易得多，而且你知道，如果我们都必须在一个问题上达成一致，IPv6可能是更好的选择。\n但是..。我们不一定要在其中一个问题上达成一致，因为波斯特尔定律有着令人敬畏的不可阻挡的可怕之处。没有人能宣布一个互联网或另一个互联网正式死亡，因为我们唯一能确定的关于互联网的事情是，它们总是结合在一起形成互联网。有些人可能试图拔掉IPv4或IPv6的插头，但其他一些笨蛋会马上把它插回去。\n这种规模的纯净是永远达不到的。如果您需要纯净才能使您的网络可靠，那么您就有一个无法解决的问题。\n好的，实际上我们必须做得更好，因为事实证明，在连接开始时，为每个连接在两个Internet之间做出正确选择是不可能的，也不够好。PMTU、碎片、NAT重置和路由更改等问题可能会中途中断连接，并导致性能低下或丢失。\n我想回到我在世界末日时留下的一个附注，其中IPv6是一个很好的设计：移动IP，也就是说，即使您在IP地址之间跳转，您的连接也能继续运行。如果您拥有IP移动性，那么您可以根据实时平等反馈，实时迁移两个互联网之间的连接。您可以在两条链路上发送相同的数据包，然后看看哪条链路工作得更好。如果您选择了一条链路，但它突然停止，您可以在另一条链路上重新传输数据包，然后从您停止的地方继续。你精确的启发式甚至不会有那么大的影响，只要它最终尝试了两种方式。\n如果您拥有IP移动性，那么您可以将第#34；a和第#34；b；情景(失败组合)转换为第#34；a或b#34；情景(成功组合)。\n你知道吗，忘了IPv4和IPv6吧。同样的技巧也适用于我们上面提到的冗余电缆+DSL设置。或者同时支持WiFi和LTE的话筒。或者，给出一个足够花哨的wifi客户端芯片组，在多个无关的wifi路由器之间平滑切换。\n这就是我们对Tailscale的VPN连接所做的小范围工作。我们尝试您的所有Internet链接，IPv4和IPv6，UDP和TCP，中继和点对点连接。我们让移动IP成为现实，即使现在只是在你们的私人网络上。你知道吗，数学是可行的。两个网络的Tailscale比一个网络的Tailscale更可靠。", "note_en": "A few years ago I wrote   The World in Which IPv6 was a GoodDesign. I&#39;m stillproud of that article, but I thought I should update it a bit.\n No, I&#39;m not switching sides. IPv6 is just as far away from universaladoption, or being a &#34;good design&#34; for our world, as it was threeyears ago. But since then I co-founded a company that turned out to beaccidentally based on the principles I outlined in that article. Orrather, from turning those principles upside-down.\n In that article, I explored the overall history of networking and theconsiderations that led to IPv6. I&#39;m not going to cover that groundagain. Instead, I want to talk about attitude.\n   When I first joined the Internet in the 1990s, I found somenow-long-lost introductory tutorial. It talked about the differencebetween an internet (lowercase i) and the Internet (capital I). Aninternet is &#34;any network that connects smaller networks together.&#34; TheInternet is... well... it turns out that you don&#39;t need more than oneinternet. If you have two internets, it is nearly unavoidable thatsomeone will soon figure out how to connect them together. All you needis one person to build that one link, and your two internets become one.By induction then, the Internet is the end result when you make it easyenough for a single motivated individual to join one internet toanother, however badly.\n Internets are fundamentally sloppy. No matter how many committees youmight form, ultimately connections are made by individuals pluggingthings together. Those things might follow the specs, or not. They mightfollow those specs well, or badly. They might violate the specs becauseeverybody else is also violating the specs and that&#39;s the only way tomake anything work. The connections themselves might be fast or slow, orflakey, or only functional for a few minutes each day, or subject to amateur radio regulations, orworse. The endpoints might be high-powered servers,  vending machines,toasters, or satellites, running any imaginable operating system. Onlyone thing&#39;s for sure: they all have bugs.\n Which brings us to Postel&#39;s Law, which I always bring up when I writeabout networks. When I do, invariably there&#39;s a slew of responsestrying to debate whether Postel&#39;s Law is &#34;right,&#34; or &#34;a good idea,&#34;as if it were just an idea and not a force of nature.\n Postel&#39;s Law says simply this: be conservative in what you send, andliberal in what you accept. Try your best to correctly handle the bugsproduced by the other end. The most successful network node is one thatplans for every &#34;impossible&#34; corruption there might be in the inputand does something sensible when it happens. (Sometimes, yes,&#34;something sensible&#34; is to throw an error.)\n [Side note: Postel&#39;s Law doesn&#39;t apply in every situation. Youprobably don&#39;t want your compiler to auto-fix your syntax errors,unless your compiler is javascript or HTML, which, kidding aside,actually were designed to do this sort of auto-correction for Postel&#39;sLaw reasons. But the law does apply in virtually every complex situationwhere you need to communicate effectively, including humanconversations. The way I like to say it is, &#34;It takes two tomiscommunicate.&#34; A great listener,  or a skilled speaker, can resolvea lot of conflicts.]\n Postel&#39;s Law is the principle the Internet is based on. Not because JonPostel was such a great salesperson and talked everyone into it, butbecause that is the only winning evolutionary strategy when internetsare competing. Nature doesn&#39;t care what you think about Postel&#39;s Law,because the only Internet that happens will be the one that followsPostel&#39;s Law. Every other internet will, without exception, eventuallybe joined to The Internet by some goofball who does it wrong, but justwell enough that it adds value, so that eventually nobody will bewilling to break the connection. And then to maintain that connectionwill require further application of Postel&#39;s Law.\n  If you&#39;ve followed my writing, you might have seen me refer to IPv6 as&#34;a second internet that not everyone is connected to.&#34; There&#39;s a lotwrapped up in that claim. Let&#39;s back up a bit.\n In   The World in Which IPv6 was a Good Design,I talked about the lofty design goals leading to IPv6: eliminate bus networks,get rid of MAC addresses, no more switches and hubs, no NATs, and so on.What I didn&#39;t realize at the time, which I now think is essential, is thatthese goals were a  fundamental attitude shift compared to what wentinto IPv4 (and the earlier protocols that led to v4).\n IPv4 evolved as a pragmatic way to build  an internet out of a bunch ofnetworks and machines that existed already. Postel&#39;s Law says you&#39;dbest deal with reality as it is, not as you wish it were, and so theydid. When something didn&#39;t connect, someone hacked on it until itworked. Sloppy. Fits and starts, twine and duct tape. But mostimportantly, nobody really thought this whole mess would work as well asit turned out to work, or last as long as it turned out to last. Nobodyknew, at the time, that whenever you start building internets, theyalways lead inexorably to The Internet.\n These (mostly) same people, when they started to realize the monsterthey had created, got worried. They realized that 32-bit addresses,which they had originally thought would easily last for the lifetime oftheir little internet, were not even enough for one address per personin the world. They found out, not really to anyone&#39;s surprise, thatPostel&#39;s Law, unyielding as it may be, is absolutely a maintenancenightmare. They thought they&#39;d better hurry up and fix it all, beforethis very popular Internet they had created, which had become avaluable, global, essential service, suddenly came crashing down and itwould all be their fault.\n [Spoiler: it never did come crashing down. Well, not permanently. Therewere and are still short-lived flare-ups every now and then, but a fewdedicated souls hack it back together, and so it goes.]\n IPv6 was created in a new environment of fear, scalability concerns, and Second SystemEffect.As we covered last time, its goal was to replace The Internet with a NewInternet — one that wouldn&#39;t make all the same mistakes. It would havefewer hacks. And we&#39;d upgrade to it incrementally over a few years,just as we did when upgrading to newer versions of IP and TCP back inthe old days.\n We can hardly blame people for believing this would work. Even the term&#34;Second System Effect&#34; was only about 20 years old at the time, andnot universally known. Every previous Internet upgrade had gone fine.Nobody had built such a big internet before, with so much Postel&#39;s Law,with such a variety of users, vendors, and systems, so nobody knew itwould be different.\n Well, here we are 25 years later, and not much has changed. If we werefeeling snarky, we could perhaps describe IPv6 as &#34;the String Theory ofnetworking&#34;: a decades-long boondoggle that attracts True Believers,gets you flamed intensely if you question the doctrine, and which isnotable mainly for how much progress it has held back.\n   There are, of course, still no exceptions to the rule that if you buildany internet, it will inevitably (and usually quickly) become connectedto The Internet.\n I wasn&#39;t sitting there when it happened, but it&#39;s likely the veryfirst IPv6 node ran on a machine that was also connected to IPv4, ifonly so someone could telnet to it for debugging. Today, even &#34;pureIPv6&#34; nodes are almost certainly connected to a network that, ifconfigured correctly, can find a way to any IPv4 node, and vice versa.It might not be pretty, it might involve a lot of proxies, NATs,bridges, and firewalls. But  it&#39;s allconnected.\n In that sense, there is still just one Internet. It&#39;s the big one.Since day 1, The Internet has never spoken just one protocol; it hasalways been a hairy mess of routers, bridges, and gateways, running manyprotocols at many layers. IPv6 is one of them.\n What makes IPv6 special is that its proponents are not content for it tobe  an internet that connects to The Internet. No! It&#39;s the chosenone. Its destiny is to be The Internet. As a result, we don&#39;t  onlyhave bridges and gateways to join the IPv6 internets and the IPv4internet (although we do).\n Instead, IPv6 wants to eventually run directly on every node. End usershave been, uh,  rather unwilling to give up IPv4, so for now, everynode has that too. As a result, machines are often joined directly towhat I call &#34;two competing internets&#34; --- the IPv4 one and the IPv6one.\n Okay, at this point our terminology has become very confusing. Sorry.But all this leads to the question I know you want me to answer: Whichinternet is better!?\n  I&#39;ll get to that, but first we need to revisit what I bravely called Avery&#39;s Laws of Wifi Reliability, which arenot laws, were surely invented by someone else (since they&#39;re mostly aparaphrasing of a trivial subset of CAP theorem), and as it turns out,apply to more than just wifi. Oops. I guess the name is wrong in almostevery possible way. Still, they&#39;re pretty good guidelines.\n  Rule #1: if you have two wifi router brands that work with 90% of client devices, and your device has a problem with one of them, replacing the wifi router brand will fix the problem 90% of the time. Thus, an ISP offering both wifi routers has a [1 - (10% x 10%)] = 99% chance of eventual success.\n Rule #2: if you&#39;re running two wifi routers at once (say, a primary router and an extender), and both of them work &#34;correctly&#34; for about 90% of the time each day, the chance that your network has no problems all day is 81%.\n    Depending how many distributed systems you&#39;ve had to build, this iseither really obvious or really mind blowing. Why did the success ratejump to 99% in the first scenario but drop to 81% in the second? What&#39;sthe difference? And... which one of those cases is like IPv6?\n  Or we can ask that question another way. Why are there so many web pagesthat advise you to solve your connectivity problem by disabling IPv6?\n  Let&#39;s keep things simple. IPv4 is one way to connect client A to serverX, and IPv6 is a second way. It&#39;s similar to buying redundant home IPv4connections from, say, a cable and a DSL provider and plugging them intothe same computer. Either way, you have two independent connections toThe Internet.\n When you have two connections, you must choose between them. Here aresome factors you can consider:\n Which one even offers a path from A to X? (If X doesn&#39;t have an IPv6 address, for example, then IPv6 won&#39;t be an option.)\n Which one gives the shortest paths from A to X and from X to A? (You could evaluate this using hopcount or latency, for example, like in my old  netselect program.)\n    Which path drops out least often? (A rebooted NAT will drop a TCP connection on IPv4. But IPv6 routes change more frequently.)\n Which one has buggy firewalls or NATs in the way? Do they completely block it (easy) or just act strangely (hard)?\n  Which one is misconfigured to block certain ICMP packets so that  PMTU discovery (always or sometimes) doesn&#39;t work with some or all hosts?\n A common heuristic called &#34; HappyEyeballs&#34;is one way to choose between routes, but it covers only a few of thosecriteria.\n The truth is, it&#39;s extremely hard to answer all those questions, andeven if you can, the answers are different for every combination of Aand X, and they change over time. Operating systems, web browsers, andapps, even if they implement Happy Eyeballs or something equivalent,tend to be pretty bad at detecting all these edge cases. And every apphas to do it separately!\n My claim is that the &#34;choose between two internets&#34; problem is thesame as the &#34;choose between two flakey wifi routers on the same SSID&#34;problem (Rule #2). All is well as long as both internets (or both wifirouters) are working perfectly. As soon as one is acting weird, youroverall results are going to be weird.\n ...and the Internet  always acts weird, because of the tyranny ofPostel&#39;s Law. Debugging the Internet is a full time job.\n ...and now there are two internets, with a surprisingly low level ofoverlap, so your ISP has to build and debug both.\n ...and every OS vendor has to debug both protocol implementations,which is more than twice as much code.\n ...and every app vendor has to test with both IPv4 and IPv6, which ofcourse they don&#39;t.\n   IPv6 proponents know all this, whether rationally or intuitively or atleast empirically. The failure rate of two wonky internets joinedtogether is higher than the failure rate of either wonky internet alone.\n This leads them to the same conclusion you&#39;ve heard so many times: weshould just kill one of the internets, so we can spend our time makingthe one remaining internet less wonky, instead of dividing our effortbetween the two. Oh, and, obviously the one we kill will be IPv4,thanks.\n They&#39;re not wrong! It  would be a lot easier to debug with just oneinternet, and you know, if we all had to agree on one, IPv6 is probablythe better choice.\n But... we don&#39;t all have to agree on one, because of the awesomeunstoppable terribleness that is Postel&#39;s Law. Nobody can declare oneinternet or the other to be officially dead, because the only thing weknow for sure about internets is that they always combine to make TheInternet. Someone might try to unplug IPv4 or IPv6, but some other jerkwill plug it right back in.\n Purity cannot ever be achieved at this kind of scale. If you need purityfor your network to be reliable, then you have an unsolvable problem.\n   Ok, actually we have to do better than that, because it turns out thatcorrectly choosing between the two internets for each connection, at thestart of that connection, is not possible or good enough. Problems likePMTU, fragmentation, NAT resets, and routing changes can interrupt aconnection partway through and cause poor performance or dropouts.\n I want to go back to a side note I left near the end of   The World inWhich IPv6 was a Good Design: mobile IP.That is, the ability for your connections to keep going even if you hopbetween IP addresses. If you had IP mobility, then you could migrateconnections between your two internets in real time, based on livequality feedback. You could send the same packets over both links andsee which ones work better. If you picked one link and it suddenlystopped, you could retransmit packets on the other link and pick upwhere you left off. Your precise heuristic wouldn&#39;t even matter thatmuch, as long as it tries both ways eventually.\n If you had IP mobility, then you could convert the &#34;a AND b&#34; scenario(failure compounds) into the &#34;a OR b&#34; scenario (success compounds).\n And you know what, forget about IPv4 and IPv6. The same tricks wouldwork with that redundant cable + DSL setup we mentioned above. Or aphone with both wifi and LTE. Or, given a fancy enough wifi clientchipset, smoothly switching between multiple unrelated wifi routers.\n This is what we do, in a small way, with Tailscale&#39;s VPN connections.We try all your Internet links, IPv4 and IPv6, UDP and TCP, relayed andpeer-to-peer. We made mobile IP a real thing, if only on your privatenetwork for now. And what do you know, the math works. Tailscale withtwo networks is more reliable than Tailscale with one network.", "posttime": "2020-07-23 00:09:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ipv6,互联网", "title": "IPv4、IPv6和态度的突然转变", "title_en": "IPv4, IPv6, and a sudden change in attitude", "transed": 1, "url": "https://apenwarr.ca/log/20200708", "via": "", "real_tags": ["ipv6", "互联网"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013525, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "以下是V.Rose对亚里士多德的一部名为“魔术”(ὁΜαγικόςλόγος，或τὸμαγικόν？)的作品的证词。标题要么是指三博士(来自波斯的琐罗亚斯德祭司)实践的艺术，要么是指这样一个事实，即讨论是关于三博士的讨论。后者似乎更有可能，尽管第欧根尼斯·拉尔修斯的第一段暗示了讨论中提到的各种智慧崇拜。\n其归属存在争议。提奥奇尼斯·拉尔修斯说这是亚里士多德的作品，但他没有把它放在他的亚里士多德作品清单中(它没有出现在我看过的任何其他希腊文或阿拉伯文的清单中)。苏达人说它是安提斯提尼写的，有些人把它归因于亚里士多德或一个叫罗登的人。目前还不清楚苏达人是从哪里得到这一消息的。\n虽然我们不知道它是谁写的，但它的内容从罗斯收集的证词中得到了暗示(加上我收集的其他几个证词)。提奥奇尼斯报告说，亚里士多德认为魔术不是巫术，而是哲学或智慧。这一点得到了苏达的证实。这与预言有关。根据普林尼的说法，尤多克斯认为它是有用的，非常有价值的，因此它不仅实用，而且与更有价值的研究对象有关，可能是天体。这是特别支持琐罗亚斯德(&#39；星占卜师)词源报告的提奥奇尼斯，和波菲里的词源&#39；法师；智慧在神圣的问题&#39；。菲罗指出，它是一种光学，是自然科学中一个非常精确的分支。最后，菲罗、波菲里和苏达人把它与智慧和王权联系在一起。菲罗说，不仅普通公民练习魔术，而且波斯国王本身也必须接受麦吉人的教育才能成为国王。\n在我看来，所有这些证词似乎都可以指的是一场关于智慧的哲学家国王的讨论，他们能够通过对天空和自然科学的理解来预测未来。\n有人说哲学的工作起源于野蛮人。因为在波斯人中有麦琪人，在巴比伦人和亚述人中有迦勒底人，在印第安人中有坚诺智者(LIT。裸体哲学家)，以及在凯尔特人和高卢人中，那些被称为德鲁伊教和圣人的人，这是根据亚里士多德在“哲学家继承”第二十三册的“关于魔法和解脱”一书中所说的。\nΤὸτῆςφιλοσοφίαςἔργονἔνιοίφασινἀπὸβαρβάρωνἄρξαι.。γεγενῆσθαιγὰρπαρὰμὲνΠέρσαιςμάγους，παρὰδὲΒαβυλωνίοιςἢἈσσυρίοιςΧαλδαίους，καὶγυμνοσοφιστὰςπαρ&#39；Ἰνδοῖς，παράτεΚελτοῖςκαὶΓαλάταιςτοὺςκαλουμένουςδρυίδαςκαὶσεμνοθέους，καθάφησινἈριστοτέληςἐντῷμαγικῷκαὶΣωτίωνἐνεἰκοστῷτρίτῳτῆςδιαδοχῆς。\n亚里士多德在他的历史第五卷“关于魔术和狄农”一书中说，三博士对魔术一无所知。他还说，琐罗亚斯德，当翻译成字面意思时，意思是占星师；赫莫多鲁斯也这么说。在“论哲学论”的第一本书中，亚里士多德说他们(东方三博士)实际上比埃及人还要古老。根据他们的说法，有两个原则，一个好的戴蒙和一个坏的戴蒙：对前者来说，名字是宙斯和[即，胡马兹达]，对另一个地狱和阿里马尼乌斯[即，艾瑞曼]来说，名字是宙斯和[即，阿胡玛兹达]。赫米普斯在第一本关于麦琪的书中也这样说过，尤多克斯在“调查”中也是这样说的，西奥波波斯在“腓力经”第八卷中也是这样说的。&#34；\nΤὴνδὲγοητικὴνμαγείαν[sc.。οἱΜάγοι]οὐδ&#39；ἔγνωσαν，φησὶνἈριστοτέληςἐντῷΜαγικῷκαὶΔείνωνἐντῇπέμπτῃτῶνἹστοριῶν·ὃςκαὶμεθερμηνευόμενόνφησιτὸνΖωροάστρηνἀστροθύτηνεἶναι·φησὶδὲτοῦτοκαὶὁἙρμόδωρος。Ἀριστοτέληςδ&#39；ἐνπρώτῳΠερὶφιλοσοφίαςκαὶπρεσβυτέρουςεἶναιτῶνΑἰγυπτίων·καὶδύοκατ&39；αὐτοὺςεἶναιἀρχάς，ἀγαθὸνδαίμονακαὶκακὸνδαίμονα·καὶτῷμὲνὄνομαεἶναιΖεὺςκαὶὨρομάσδης，τῷδὲἍιδηςκαὶἈρειμάνιος。φησὶδὲτοῦτοκαὶἝρμιπποςἐντῷπρώτῳΠερὶμάγωνκαὶΕὔδοξοςἐντῇΠεριόδῳκαὶΘεόπομποςἐντῇὀγδόῃτῶνΦιλιππικῶν.\n亚里士多德说，某个魔术师(波斯的魔术师或牧师)从叙利亚来到雅典，他对苏格拉底的其他预言之一是，他将有一个暴力的结局。\nφησὶδ&#39；ἈριστοτέληςμάγοντινὰἐλθόνταἐκΣυρίαςεἰςἈθήναςτάτεἄλλακαταγνῶναιτοῦΣωκράτουςκαὶδὴκαὶβίαιονἔσεσθαιτὴντελευτὴναὐτῷ。\n尤多克斯希望人们知道，在哲学流派中，魔术是最杰出、最有用的，他说，这位琐罗亚斯德人生活在柏拉图去世前六千年。亚里士多德也这么说。\n[中英文摘要]Eudoxus qui interSapientiae sectas clarissimam utilissimamque eam(MagiCam)intellegi volit，Zoroastren hunc sex Milibus annorum ante Platonis mortem Fuisse prodidit.。这就是亚里士多德。\n安蒂斯提尼斯是演说家中的雅典人，苏格拉底式的哲学家，他最初被称为流浪汉，然后扮演了狗的角色(也就是说，他的行为就像是后来被称为愤世嫉俗学派的人一样)。他是一位雅典人，也是苏格拉底式的哲学家，最初被称为巡回演说家，然后扮演了狗的角色(即，他的行为就像后来被称为愤世嫉俗学派的人一样)。他是同名父亲的儿子，他母亲是色雷斯人。他写了这十卷：第一卷，魔术：它讲述了一个法师，琐罗亚斯德，他发现了智慧。一些人把这归功于亚里士多德，另一些人则归功于罗登。\nἈντισθένης，Ἀθηναῖος，ἀπὸῥητόρωνφιλόσοφοςΣωκρατικός，ὅστιςΠεριπατητικὸςἐκλήθηπρῶτον，εἶταἐκύνισεν:υἱὸςδὲὢνὁμωνύμουπατρὸς，μητρὸςδὲτὸγένοςΘρᾴσσης.。οὗτοςσυνέγραψετόμουςδέκα:πρῶτονμαγικόν:ἀφηγεῖταιδὲπερὶΖωροάστρουτινὸςμάγου，εὑρόντοςτὴνσοφίαν:τοῦτοδέτινεςἈριστοτέλει，οἱδὲῬόδωνιἀνατιθέασιν.。\n菲西亚族暴君埃克塞斯托斯过去常常戴着两枚施了魔法的戒指，他常常根据他们相互攻击的声音来决定采取行动的合适时间。但是，正如亚里士多德在“佛陀宪法”中所说的那样，他还是死了，尽管受到了声音的警告，但还是被叛徒谋杀了。\nἘξήκεστόςτεὁΦωκαιέωντύραννοςδύοδακτυλίουςφορῶνγεγοητευμένουςτῷψόφῳτῷπρὸςἀλλήλουςδιῃσθάνετοτοὺςκαιροὺςτῶνπράξεων，ἀπέθανενδὲὅμωςδολοφονηθεὶςκαίτοιπροσημήναντοςτοῦψόφου，ὥςφησινἈριστοτέληςἐντῇΦωκαιέωνπολιτείᾳ.\n真正的魔术艺术是一门光学科学，它用更明亮的外表照亮自然的作品，被认为是神圣的和高度珍视的，不仅是普通公民，最伟大的国王和国王的国王，最伟大的波斯国王也是如此，以至于他们中没有一个人能够成为王位的继承人，如果他不碰巧在麦琪王宫里分享的话。&#34；(#34；。\nτὴνμὲνοὖνἀληθῆμαγικήν，ὀπτικὴνἐπιστήμηνοὖσαν，ᾗτὰτῆςφύσεωςἔργατρανοτέραιςφαντασίαιςαὐγάζεται，σεμνὴνκαὶπεριμάχητονδοκοῦσανεἶναι，οὐκἰδιῶταιμόνονἀλλὰκαὶβασιλεῖςκαὶβασιλέωνοἱμέγιστοικαὶμάλισταοἱΠερσῶνδιαπονοῦσινοὕτως，ὥστ&#39；οὐδέναφασὶνἐπὶβασιλείανδύνασθαιπαραπεμφθῆναιπαρ&#39；αὐτοῖς，εἰμὴπρότεροντοῦμάγωνγένουςκεκοινωνηκὼςτυγχάνοι.。\n在波斯人中，那些在神圣事务上有智慧并崇拜它的人被称为三博士。这正是法师在当地语言中的意思。这座房子被波斯人认为是如此宏伟和神圣，以至于就连希斯塔普斯的儿子大流士也在他的墓碑上(还有其他东西)刻上了他是一位魔术老师的名字。\nπαράγεμὴντοῖςΠέρσαιςοἱπερὶτὸθεῖονσοφοὶκαὶτούτουθεράποντεςμάγοιμὲνπροσαγορεύονται·τοῦτογὰρδηλοῖκατὰτὴνἐπιχώριονδιάλεκτονὁμάγος·οὕτωδὲμέγακαὶσεβάσμιονγένοςτοῦτοπαρὰΠέρσαιςνενόμισται，ὥστεκαὶΔαρεῖοντὸνὙστάσπουἐπιγράψαιτῷμνήματιπρὸςτοῖςἄλλοιςὅτικαὶμαγικῶνγένοιτοδιδάσκαλος.。\nΦάρμακαμὴτεύχειν，μαγικῶνβίβλωνἀπέχεσθαι.", "note_en": "Here are all of V. Rose&#39;s  testimonia of a work attributed to Aristotle called  Magic (ὁ Μαγικός λόγος, or τὸ μαγικόν?). The title either refers to the art practised by the Magi (the Zoroastrian priests from Persia), or it refers to the fact that the discussion is a discussion about the Magi. The latter seems more likely, even though the first passage, from Diogenes Laertius, suggests the discussion mentioned all sorts of wisdom cults.\n The attribution is disputed. Diogenes Laertius says it is by Aristotle, but doesn&#39;t put it in his list of Aristotle&#39;s works (it doesn&#39;t show up in any other list I&#39;ve looked at in either Greek or Arabic). The Suda says it is by Antisthenes, and that some people attributed it to Aristotle or someone named Rhodon. It&#39;s not clear where the Suda is getting this from.\n While we don&#39;t know who wrote it, its contents are hinted at by the testimonies gathered in Rose (+ a few others I&#39;ve put together). Diogenes reports that Aristotle thought magic wasn&#39;t sorcery, but philosophy or wisdom. This is confirmed by the Suda. It has something to do with prognostication. Eudoxus, according to Pliny, believed it was useful and very valuable, and so it was not only practical but connected to more valuable objects of study, probably the heavenly bodies. This is especially supported by the etymology of Zoroaster (&#39;star-diviner&#39;) reported by Diogenes, and Porphyry&#39;s etymology of &#39;magus&#39; as &#39;wise in divine matters&#39;. Philo specifies that it was a kind of &#39;optics&#39; and a very precise branch of natural science. Finally, Philo, Porphyry and the Suda associate it with both wisdom  and with kingship. Philo says not only private citizens practice magic, but that Persian kings themselves had to be educated as Magi to become king.\n It seems to me as if all these testimonies could be referring to a discussion of wise philosopher kings who are able to predict the future through their understanding of the heavens and the science of nature.\n  &#34;Some say the work of philosophy originated with the barbarians. For among the Persians are the Magi, among the Babylonians and Assyrians the Chaldeans, among the Indians the Gymnosophists (lit. naked philosophers), and among the Celts and Gauls, those called &#39;Druids&#39; and holy people, according to what Aristotle says in the book on  Magic and Sotion in the twenty-third book of the  Succession of Philosophers.&#34;\n Τὸ τῆς φιλοσοφίας ἔργον ἔνιοί φασιν ἀπὸ βαρβάρων ἄρξαι. γεγενῆσθαι γὰρ παρὰ μὲν Πέρσαις μάγους, παρὰ δὲ Βαβυλωνίοις ἢ Ἀσσυρίοις Χαλδαίους, καὶ γυμνοσοφιστὰς παρ&#39; Ἰνδοῖς, παρά τε Κελτοῖς καὶ Γαλάταις τοὺς καλουμένους δρυίδας καὶ σεμνοθέους, καθά φησιν Ἀριστοτέλης ἐν τῷ μαγικῷ καὶ Σωτίων ἐν εἰκοστῷ τρίτῳ τῆς διαδοχῆς.\n  &#34;The Magi were ignorant of sorcerers&#39; magic, says Aristotle in the book on  Magic and Dinon in the fifth book of his  Histories. He also says &#39;Zoroaster&#39; when translated literally means &#39;star-diviner&#39;; Hermodorus says this as well. In the first book of  On Philosophy, Aristotle says they (the Magi) are actually older than the Egyptians. And according to them there are two principles, a good daimon and a bad daimon: to the former, the name is Zeus and &#39;Oromasdes&#39; [i.e., Ahura Mazda], to the other Hades and &#39;Arimanius&#39; [i.e., Ahriman]. Hermippus says this too in the first book  On Magi, so does Eudoxus in the  Survey, and Theopompus in the eighth book of the  Philippics.&#34;\n Τὴν δὲ γοητικὴν μαγείαν [sc. οἱ Μάγοι] οὐδ&#39; ἔγνωσαν, φησὶν Ἀριστοτέλης ἐν τῷ Μαγικῷ καὶ Δείνων ἐν τῇ πέμπτῃ τῶν Ἱστοριῶν· ὃς καὶ μεθερμηνευόμενόν φησι τὸν Ζωροάστρην ἀστροθύτην εἶναι· φησὶ δὲ τοῦτο καὶ ὁ Ἑρμόδωρος. Ἀριστοτέλης δ&#39; ἐν πρώτῳ Περὶ φιλοσοφίας καὶ πρεσβυτέρους εἶναι τῶν Αἰγυπτίων· καὶ δύο κατ&#39; αὐτοὺς εἶναι ἀρχάς, ἀγαθὸν δαίμονα καὶ κακὸν δαίμονα· καὶ τῷ μὲν ὄνομα εἶναι Ζεὺς καὶ Ὠρομάσδης, τῷ δὲ Ἅιδης καὶ Ἀρειμάνιος. φησὶ δὲ τοῦτο καὶ Ἕρμιππος ἐν τῷ πρώτῳ Περὶ μάγων καὶ Εὔδοξος ἐν τῇ Περιόδῳ καὶ Θεόπομπος ἐν τῇ ὀγδόῃ τῶν Φιλιππικῶν.\n  &#34;Aristotle says that a certain  magus [magician or priest from Persia] came from Syria to Athens and among the other things he predicted about Socrates, was that he will have a violent end.&#34;\n φησὶ δ&#39; Ἀριστοτέλης μάγον τινὰ ἐλθόντα ἐκ Συρίας εἰς Ἀθήνας τά τε ἄλλα καταγνῶναι τοῦ Σωκράτους καὶ δὴ καὶ βίαιον ἔσεσθαι τὴν τελευτὴν αὐτῷ.\n  &#34;Eudoxus, who wanted it to be known that among the schools of philosophy, magic is the most illustrious and most useful, relates that this &#39;Zoroaster&#39; lived six thousand years before Plato&#39;s death. Aristotle says this too.&#34;\n Eudoxus qui inter sapientiae sectas clarissimam utilissimamque eam (magicam) intellegi voluit, Zoroastren hunc sex milibus annorum ante Platonis mortem fuisse prodidit. sic et Aristoteles.\n  &#34;Antisthenes, an Athenian, Socratic philosopher from among the orators, who first was called a Peripatetic, then &#39;played the dog&#39; (i.e., acted like someone from what would later be called the &#39;Cynic&#39; school). He was the son of a father with the same name, and his mother came from the people of Thrace. He wrote these ten volumes: first,  Magic: it tells about a certain  magus, Zoroaster, who discovered wisdom. Some people attribute this to Aristotle, others to Rhodon.&#34;\n Ἀντισθένης, Ἀθηναῖος, ἀπὸ ῥητόρων φιλόσοφος Σωκρατικός, ὅστις Περιπατητικὸς ἐκλήθη πρῶτον, εἶτα ἐκύνισεν: υἱὸς δὲ ὢν ὁμωνύμου πατρὸς, μητρὸς δὲ τὸ γένος Θρᾴσσης. οὗτος συνέγραψε τόμους δέκα: πρῶτον μαγικόν: ἀφηγεῖται δὲ περὶ Ζωροάστρου τινὸς μάγου, εὑρόντος τὴν σοφίαν: τοῦτο δέ τινες Ἀριστοτέλει, οἱ δὲ Ῥόδωνι ἀνατιθέασιν.\n  &#34;Execestus, the Phocian tyrant, used to wear two enchanted rings, and he used to determine the appropriate time to act by the sound they made against one another. But, he still died, murdered by treachery despite being warned by the sound, as Aristotle says in the  Phocian Constitution.&#34;\n Ἐξήκεστός τε ὁ Φωκαιέων τύραννος δύο δακτυλίους φορῶν γεγοητευμένους τῷ ψόφῳ τῷ πρὸς ἀλλήλους διῃσθάνετο τοὺς καιροὺς τῶν πράξεων, ἀπέθανεν δὲ ὅμως δολοφονηθεὶς καίτοι προσημήναντος τοῦ ψόφου, ὥς φησιν Ἀριστοτέλης ἐν τῇ Φωκαιέων πολιτείᾳ.\n  &#34;The true art of magic, which is a science of optics by which the works of nature are illuminated with a brighter appearance and is thought to be holy and highly prized, is not only practiced by private citizens, but also by kings and of kings the greatest, and most of all the Persian kings, to the extent that they say no one among them is able to be a successor to the kingship if he does not happen to share in the house of the Magi.&#34;\n τὴν μὲν οὖν ἀληθῆ μαγικήν, ὀπτικὴν ἐπιστήμην οὖσαν, ᾗ τὰ τῆς φύσεως ἔργα τρανοτέραις φαντασίαις αὐγάζεται, σεμνὴν καὶ περιμάχητον δοκοῦσαν εἶναι, οὐκ ἰδιῶται μόνον ἀλλὰ καὶ βασιλεῖς καὶ βασιλέων οἱ μέγιστοι καὶ μάλιστα οἱ Περσῶν διαπονοῦσιν οὕτως, ὥστ&#39; οὐδένα φασὶν ἐπὶ βασιλείαν δύνασθαι παραπεμφθῆναι παρ&#39; αὐτοῖς, εἰ μὴ πρότερον τοῦ μάγων γένους κεκοινωνηκὼς τυγχάνοι.\n  &#34;Among the Persians, those who are wise in divine matters and worship it are called &#39;Magi&#39;. This is just what &#39;Magus&#39; means in the regional language. This house is considered to be so great and so holy by the Persians, that even Darius, son of Hystaspes, had engraved on his tombstone (among other things) that he was a teacher of magic arts.&#34;\n παρά γε μὴν τοῖς Πέρσαις οἱ περὶ τὸ θεῖον σοφοὶ καὶ τούτου θεράποντες μάγοι μὲν προσαγορεύονται· τοῦτο γὰρ δηλοῖ κατὰ τὴν ἐπιχώριον διάλεκτον ὁ μάγος· οὕτω δὲ μέγα καὶ σεβάσμιον γένος τοῦτο παρὰ Πέρσαις νενόμισται, ὥστε καὶ Δαρεῖον τὸν Ὑστάσπου ἐπιγράψαι τῷ μνήματι πρὸς τοῖς ἄλλοις ὅτι καὶ μαγικῶν γένοιτο διδάσκαλος.\n   Φάρμακα μὴ τεύχειν, μαγικῶν βίβλων ἀπέχεσθαι.", "posttime": "2020-07-23 00:08:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "魔术,lost", "title": "亚里士多德的《魔术失传》(2018)", "title_en": "Aristotle's Lost Book on Magic (2018)", "transed": 1, "url": "https://www.ancientmedicine.org/home/2018/3/11/aristotles-lost-book-on-magic", "via": "", "real_tags": ["魔术", "lost"]}, {"category": "", "categoryclass": "", "imagename": "1a49a0713da34ce392ff504b364d73cb.jpg", "infoid": 1013522, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴鲁克·拉本斯基(Baruch Labunski)是一位来自多伦多的企业家、互联网营销专家和作家。他目前担任网页设计和互联网营销公司Rank Secure的首席执行官。\n这些策略背后的原则是有道理的；品牌希望有机会通过电子邮件等渠道与这些访问者进行更私密的交流。但大多数品牌从未弥合的一个鸿沟是，他们希望与网站访问者进行多大程度的个性化，以及他们在与该访问者的初始互动中有多个人化。\n以我作为营销员的经验，没有什么比深思熟虑地实现Messenger工具更好的弥合这一差距的方法了，许多大品牌利用这些聊天气泡来提供实时客户支持。\n仅实施这一战略就让我帮助我的客户挽回了数百万美元的收入损失-我曾与之共事的一家当地牙医损失了500多万美元。下面是它的工作原理，从部署位置开始。\n当选择在哪里部署Messenger工具的页面时，要记住的一条原则是，您不想为那些不需要的人提供客户支持。因此，每次我实施Messenger工具时，我都会想到四个关键的客户群：\n有时，网站访问者属于哪种类别是显而易见的；例如，单击您的客户端登录门户的人显然已经是客户，而快速单击您的站点的人显然对您的产品不感兴趣。但对于大多数其他用户来说，这一点就不那么清楚了。这就是与Google Analytics结合使用的热图软件在将用户行为映射到个人资料方面可能非常有帮助的地方。", "note_en": "Baruch Labunski is an entrepreneur, internet marketing expert and author from Toronto. He currently serves as CEO of  Rank Secure, a web design and internet marketing firm.\n  The principle that underlies these tactics makes sense; brands want the chance to communicate with those visitors more personally on a channel like email. But a gap most brands never bridge is the one between how personal they want to get with a website visitor and how personal they are in their initial interaction with that visitor.\n In my experience as a marketer, there are few better ways to bridge that gap than a thoughtful implementation of messenger tools, those chat bubbles many big brands use to offer real-time customer support.\n Implementing this strategy alone has allowed me to help my clients recover millions of dollars in what would have been lost revenue — more than $5 million for a local dentistry I’ve worked with. Here’s how it works, starting with where to deploy it.\n  When picking pages for where to deploy messenger tools, the one principle to keep in mind is that you don’t want to offer customer support to those who don’t need it. So every time I implement messenger tools, I think about four key customer segments:\n  Sometimes it’s obvious which category a website visitor falls into; for instance, someone who clicks on your client login portal is obviously already a customer and someone who rapidly clicks off your site is obviously not interested in your offering. But for most other users, it’s a lot less clear. That’s where heat map software used in tandem with Google Analytics could be tremendously helpful in mapping user behavior to a profile.", "posttime": "2020-07-22 23:46:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "工具,tools,访问者", "title": "\nMessenger工具可以帮助您挽回数百万美元的收入损失", "title_en": "\n\t\t\t\tMessenger tools can help you recover millions in lost revenue\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/22/use-messenger-tools-to-recover-millions-in-lost-revenue/", "via": "", "real_tags": ["工具", "tools", "访问者"]}, {"category": "", "categoryclass": "", "imagename": "c1f8941930694f8a30b36ab91c324937.png", "infoid": 1013521, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该公司最近被发现在野外测试App Lock，但它还没有完全推出。相反，Facebook在6月份表示，App Lock只向iOS上的一小部分Messenger用户提供。\n要使用它，您需要在Messenger的隐私设置中查找新选项。这是您可以找到允许您静音故事或阻止用户的控件的同一区域。\n与此同时，即将推出的消息隐私控制将与Instagram上的类似，在Instagram上，你可以通过设置来配置允许谁给你发消息。在Facebook Messenger的例子中，这些控件可以让你选择哪些人可以直接给你的收件箱发消息，哪些人会转到你的消息请求文件夹。这可以帮助人们让他们的Messenger收件箱更私密，只对朋友和家人开放。\n你还可以设置你根本不能给你发短信或给你打电话。\nFacebook表示，它还在测试更多的私信请求功能，这些功能在决定如何回复、屏蔽、报告或忽略新人的消息时，不需要你查看他们的图片。这类似于Instagram和WhatsApp上的现有功能，它将模糊来自陌生人的传入图像。", "note_en": "The company was  recently spotted testing App Lock in the wild, but it had not yet fully rolled out. Instead, Facebook said in June App Lock was only being offered to a small percentage of Messenger users on iOS.\n   To use it, you’ll look for a new option within Messenger’s Privacy Settings. This is the same area where you find controls that allow you to mute stories or block users.\n   The upcoming messaging privacy controls, meanwhile, will be  similar to those available on Instagram, where you can configure through settings who is allow to message you. In Facebook Messenger’s case, the controls will let you choose which people are allowed to message your inbox directly and which will go to your Message Requests folder, instead. This could help people keep their Messenger inbox more private for friends and family only.\n You’ll also be able to set you can’t message you at all or call you.\n Facebook says it’s also testing more private message requests features that won’t require you to view an image from someone new when deciding how to respond, block, report or ignore their message. This is similar to the existing feature on Instagram and WhatsApp that will blur incoming images from people you don’t know.", "posttime": "2020-07-22 23:46:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "id,privacy,messenger", "title": "\nMessenger的新隐私控制可以让您通过Face ID或Touch ID保护聊天安全", "title_en": "\n\t\t\t\tMessenger’s new privacy controls let you secure your chats via Face ID or Touch ID\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/22/messengers-new-privacy-controls-let-you-secure-your-chats-via-face-id-or-touch-id/", "via": "", "real_tags": ["id", "privacy", "messenger"]}, {"category": "", "categoryclass": "", "imagename": "eeb2ec95ef547da23c4ba3e4699ff828.jpg", "infoid": 1013520, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周，Dexterity从秘密行动中脱颖而出，宣布了旨在创建协作机器人系统的全栈解决方案。硬件-软件系统设计用于各种不同的任务，包括拣箱和装箱，目标是仓库履行和物流需求。这家总部位于旧金山湾区的初创公司已经获得了投资界的大力支持，[…]", "note_en": "Dexterity emerged from stealth this week to announced its full-stack solution aimed at creating collaborative robotics systems. The hardware-software system is designed for a variety of different tasks, including bin picking and box packing, targeted at warehouse fulfillment and logistics needs. The Bay Area-based startup has already built up significant support from the investment world, […]", "posttime": "2020-07-22 23:46:17", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,退出,exits,dexterity", "title": "\nDexterity退出隐形，为其协作仓库机器人筹集5620万美元", "title_en": "\n\t\t\t\tDexterity exits stealth with $56.2M raised for its collaborative warehouse robots\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/22/dexterity-exits-stealth-with-56-2m-raised-for-its-collaborative-warehouse-robots/", "via": "", "real_tags": ["机器人", "退出", "exits", "dexterity"]}, {"category": "", "categoryclass": "", "imagename": "510fecdbb5d2ede39d178f1d808ba0bb.jpg", "infoid": 1013518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "运营商试图说服人们他们需要一部新手机的例子不计其数，但美国电话电报公司(AT&&T)的这一最新例子尤其令人担忧。美国电话电报公司(AT&amp；T)通过一封发给数千名客户的电子邮件警告称，这些用户需要升级手机，以避免失去拨打语音电话的功能。问题出在哪里？这在近两年内不会发生。\n正如安卓警局最先报道的那样，下图所示的电子邮件正以粗体发送给客户，声明“您的设备与新网络不兼容。”这指的是美国电话电报公司(AT&amp；T)计划关闭其3G网络，一些设备仍在使用3G网络进行语音通话和数据传输。当这种情况发生时，网络上将只允许支持VoLTE(LTE语音)的电话。\nAT&amp；T的电子邮件让客户知道，他们目前的手机与VoLTE不兼容，但没有明确解释，更重要的是，没有提到他们的手机将继续工作到2022年2月！\n增加这封电子邮件痛点的是，AT&amp；T只支持有限数量的VoLTE手机。具体地说，它主要是在其直接销售的设备上正式支持“HDVoice”。AT&amp；T论坛上的一位用户使用的是最新款的Galaxy S10e，并收到了这封电子邮件，原因很简单，因为它不是通过运营商直接销售的机型。可以理解的是，电子邮件中没有提供上下文，这让该用户和其他几个人认为这是一个骗局。\n美国电话电报公司(AT&amp；T)未来可能会将更多VoLTE设备列入白名单，但与此同时，运营商显然想引导客户升级到新手机--我认为这封电子邮件是误导的。\n你正在阅读朝九晚五的谷歌新闻，这些专家日复一日地发布关于谷歌及其周边生态系统的新闻。请务必查看我们的主页以获取所有最新新闻，并关注Twitter、Facebook和LinkedIn上的朝九晚五谷歌，随时了解最新消息。不知道从何说起？查看我们的独家故事、评论、操作指南，并订阅我们的YouTube频道", "note_en": "There are countless examples of carriers trying to convince people they need a new phone, but this latest example from AT&amp;T is especially worrying. Through an email going out to thousands of customers, AT&amp;T is warning that those users need to upgrade their phones to avoid losing the ability to make voice calls. The problem? That won’t happen for nearly two years.\n  As first reported by   Android Police, the email pictured below is being sent out to customers with a statement in bold that “your device is not compatible with the new network.” This is referring to AT&amp;T’s plan to shut down its 3G network, still used by some devices for voice calls and data. When that happens, only phones that support VoLTE (voice over LTE) will be allowed on the network.\n AT&amp;T’s email lets customers know that their current phone isn’t compatible with VoLTE, but without explaining that explicitly or, more importantly, mentioning that their phone will continue to work  until February 2022!\n Adding to the pain point of this email is that AT&amp;T only supports a limited number of VoLTE phones. Specifically, it mostly officially supports “HDVoice” only on devices it sells directly. One user  on AT&amp;T’s forums was using the pretty-recent Galaxy S10e and received this email, simply because it was a model not sold through the carrier directly. Understandably, the lack of context provided in the email had that user and several others thinking it was a scam.\n  It’s possible AT&amp;T could whitelist more devices for VoLTE in the future, but in the meantime the carrier  clearly wants to lead — and I’d argue this email is misleading — customers to just upgrading to a new phone.\n  You’re reading 9to5Google — experts who break news about Google and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Google on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2020-07-22 23:45:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,客户,customers,封电子邮件", "title": "AT&T告诉客户升级手机以避免语音通话丢失--提前两年", "title_en": "AT&T Tells Customers To Upgrade Their Phones To Avoid Losing Voice Calls -- Two Years Early", "transed": 1, "url": "https://9to5google.com/2020/07/22/att-upgrade-email-false-alarm/", "via": "", "real_tags": ["手机", "客户", "customers", "封电子邮件"]}, {"category": "", "categoryclass": "", "imagename": "f4b89bee1409838016f16307641a4670.png", "infoid": 1013517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在经济受到重创之际，美国电话电报公司(AT&amp；T)决定，现在是向一些客户发送危言耸听电子邮件的最佳时机，告诉他们他们的设备与新网络不兼容，你需要更换它才能继续接受服务。方便的是，这封电子邮件甚至没有明确提到，这只会影响到2022年2月的客户，只会链接到这些信息。\n这封电子邮件的格式表明，最简单的方法就是直接通过运营商获得一部新手机：它宣传AT&amp；T让在线购买新设备变得容易，并详细介绍了各种免费和快速的送货选项。如果有人只是浏览邮件，而没有点击红色的“了解更多信息”按钮，他们可能会得出结论，他们现在需要一部新手机。\n这则通知措辞拙劣，足以让美国电话电报公司(AT&amp；T；)的用户怀疑这是不是AT&amp；论坛上的骗局，因为他们拥有的是一部相对较新的Galaxy S10e。其他客户甚至同意，除非有人能澄清这个问题，否则它很可能不是一封真正的电子邮件，他们指的是AT&amp；T在电子邮件中链接的支持页面。它详细说明了在2022年2月，运营商将关闭其3G网络，这将使一些手机失去语音通话。\n你可能会认为这并不是一个普遍存在的问题，因为大多数现代手机都支持4G数据和通话(AT&amp；T称之为HDVoice)。然而，AT&amp；T只将其直接销售给客户的一小部分4G语音通话手机列入了白名单，而且看起来完全相同的非运营商手机并不一定能与运营商的HDVoice服务配合使用，就像前面提到的Galaxy S10e一样。根据有多少手机是不兼容的，这封电子邮件可能已经发送给了相当数量的订阅者。\nAT&amp；T需要澄清这一点--在这个经济不确定的时期，许多人已经有了足够的问题，而新手机可能不在他们现在想要担心的事情之列。AT&amp；T可以很容易地将S10e和诺基亚6.1等现代非运营商设备列入白名单(为什么不能将OnePlus 5等更老的设备列入白名单)，这样它们就可以在2022年继续使用网络。该公司应该跟进一封电子邮件，明确表示真正不受支持的设备只会在一年半后停止工作，而不是明天。让我们希望最终没有人会感到压力而非自愿地马上买了一部新手机。\n现在你就知道了：如果你收到了这封电子邮件，你有一年半以上的时间来升级你现有的手机。在最好的情况下，AT&amp；T甚至可能会考虑将更多的设备列入白名单，这可能会让你的手机使用更长时间，而不需要更换其他运营商。", "note_en": "Amid an economy-crushing pandemic, AT&amp;T has decided that now is the best time to send a scaremongering email to some customers, telling them that their device &#34;is not compatible with the new network and you need to replace it to continue receiving service.&#34; The email conveniently doesn&#39;t even explicitly mention that this will only affect customers  as late as February 2022, only linking to that information.\n  The email&#39;s formatting suggests that the easiest path forward is just getting a new phone via the carrier straight away: It advertises that AT&amp;T makes &#34;getting a new device online easy,&#34; detailing various free and fast shipping options. Someone who just skims over the mail without clicking the red &#34;Learn More&#34; button might conclude they need a new phone right now.\n The notice is poorly worded enough to make an AT&amp;T subscriber wonder if it&#39;s a scam in  AT&amp;T&#39;s forum, since they own a relatively recent Galaxy S10e. Other customers even agreed that it&#39;s likely not a genuine email until someone could shine some light into the issue, pointing to the  support page that AT&amp;T linked to in the email. It details that in February 2022, the carrier will turn off its 3G network, which will make some phones lose voice calls.\n   You might think that this isn&#39;t a widespread issue since most modern phones support 4G data  and calling (or  HDVoice, as AT&amp;T calls it). However, AT&amp;T only whitelists a  small number of handsets it  directly sells to customers for 4G voice calling, and it looks like identical non-carrier phones don&#39;t necessarily work with the carrier&#39;s HDVoice service, like the aforementioned Galaxy S10e. Depending on how many handsets are incompatible, this email might have gone out to a significant amount of subscribers.\n  AT&amp;T needs to clarify this — many people already have enough problems in these times of economic uncertainty, and a new phone might not be among the things they want to worry about right now. AT&amp;T could easily whitelist modern non-carrier devices like the S10e and the Nokia 6.1 (and why not even older ones like the OnePlus 5) so they could continue working on the network in 2022. The company should follow up with an email explicitly making clear that genuinely unsupported devices will only stop working in a year and a half, not tomorrow. Let&#39;s hope no one ends up feeling pressured into getting a new phone right now involuntarily.\n So there you have it: If you&#39;ve received this email, you have more than a year and a half to upgrade your current phone. And in a best-case scenario, AT&amp;T might even consider whitelisting more devices, which could allow you to keep your handset even longer without switching to another carrier.", "posttime": "2020-07-22 23:44:39", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "手机,customers", "title": "AT&T告诉一些客户，他们的手机与其新网络不兼容，但没有明确表示这个问题可能要到2022年2月才会影响到他们", "title_en": "AT&T told some customers their phones are not compatible with its new network, without explicitly saying the issue may not affect them until February 2022", "transed": 1, "url": "https://www.androidpolice.com/2020/07/22/att-tells-customers-to-change-their-phones-or-they-wont-work-anymore/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["手机", "customers"]}, {"category": "", "categoryclass": "", "imagename": "f2c3e574447668bdfe3c16ed831d8038.jpeg", "infoid": 1013516, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数字媒体初创公司Wave.tv筹集了3200万美元，为其扩张计划提供资金，尽管冠状病毒大流行对其主要主题领域-体育造成了打击。\n据Wave.tv总裁伊沙恩·萨塔里亚(Ishaan Sutaria)说，首轮融资包括新股和新债，对该公司的估值在5,000万美元至1亿美元之间。该公司注册为牛棚体育网络公司(Bulkpen Sports Network Inc.)。\n这轮融资由新的支持者CoVenture和GPS Investment Partners牵头，现有投资者包括Golden Ventures和Sweet Capital参与。\nWave.tv表示，自3月份以来，它增加了收视率，月度收入翻了一番，部分原因是专注于非主流运动以及以运动员和球迷为主角的场外视频。\n高管们说，该公司计划利用新的资金扩大业务，同时迎合主流和利基体育迷的需求。\n萨塔里亚说，“我们可以利用大多数体育媒体没有报道的、每天都在发生的更广泛的体育时刻。”\nWave.tv使用来自65个主流和利基体育联盟和组织的内容，在Snap Inc.等平台上播放18个主题媒体品牌的节目。Snapchat、Facebook Instagram和字节跳动有限公司(Byteance Ltd.)的TikTok。例如，它与奋进集团控股公司(Endeavor Group Holdings Inc.)旗下的IMG达成的协议，使其能够获得“世界上最强壮的人”(The World‘s Strong Man)等促销活动的内容。Wave.tv的高管表示，Wave.tv与其内容合作伙伴分享其产生的广告收入。\n即使在其涵盖主流体育的内容中，Wave.tv也强调独特或不寻常的时刻，有时是在赛场外捕捉到的，而不是比赛亮点。\n例如，一个名为The Pump的频道以极端健身和运动特技为特色，其中包括砍柴比赛的镜头。\n粉丝们还提交家庭视频，在Wave.tv的一个频道上播出。例如，该公司的旗舰频道发布了一段检疫Wiffle球失败的视频。\n该公司表示，自疫情开始以来，Wave.tv大约80%的总浏览量来自以非传统运动为特色的视频。这部分反映了美国职业棒球大联盟(Major League Baseball)等主流体育合作伙伴缺乏新内容，部分原因是该公司不断增长的另类体育短片资料库。Wave.tv高管表示，该公司约有29个权利合作伙伴关系，包括过去几个月签署的26项协议中的16项，专注于空手道、羽毛球和裸指关节格斗等非传统运动。\n在大流行期间，更多老牌体育媒体公司也尝试了类似的策略，在他们的无线电波和社交馈送中充斥着一系列与体育相关或与体育相关的内容。\n广告公司Zeno Group负责数字和性能营销的执行副总裁格雷戈里·特德斯科(Gregory Tedesco)说，“甚至连ESPN都在Instagram上发布关于打耳光的帖子。”“这是人们可能不会参与的东西，但他们会与朋友分享。”\n但特德斯科说，Wave.tv对于寻求接触千禧一代和Z世代在线观众的客户来说是一个有吸引力的选择。据该公司称，Wave.tv 80%的观众年龄在13岁至34岁之间。\n他说：“他们正在获取体育内容，创造非常人性化的动态资产，这说明了普通体育迷喜欢在网上分享东西。”\nWave.tv也开始进行直接的品牌交易。Wave.tv高管说，营销客户包括Under Armour和Molson Coors BeverageCo.的Miller Lite。\nWave.tv将部分利用其新资金推出或收购节目品牌，并向其他内容格式扩张，包括音频和较长格式的视频。公司高管补充说，该公司将继续专注于将其内容发布到年轻观众花费时间的平台。\nWave.tv首席执行官布莱恩·弗恩(Brian Verne)说，“我们正在利用存在已久的时尚，并对其进行调整，以适应今天的Z世代和千禧一代寻求体育娱乐体验的平台和媒体。”", "note_en": "Digital-media startup Wave.tv has raised $32 million to fund its expansion plans despite the blow the coronavirus pandemic dealt to its chief subject area—sports.\n  The Series A round, which consists of new equity and debt, values the company, incorporated as Bullpen Sports Network Inc., at between $50 million and $100 million, according to Ishaan Sutaria, the president of Wave.tv.\n    The funding round was led by new backers CoVenture and GPS Investment Partners, with participation from existing investors including Golden Ventures and Sweet Capital.\n  Wave.tv said it has increased viewership and doubled its monthly revenue since March, partly by focusing on nonmainstream sports as well as off-the-field videos featuring athletes and fans.\n      It plans to use the new funding to expand its business catering to both mainstream and niche-sport fans, executives said.\n  “We can tap into the broader amount of sports moments that are happening every day that are not being covered by most sports media,” Mr. Sutaria said.\n  Wave.tv uses content from 65 mainstream and niche sports leagues and organizations to program 18 themed media brands across platforms such as  Snap Inc.  Snapchat,  Facebook  Instagram and Bytedance Ltd.’s TikTok. Its deal with Endeavor Group Holdings Inc.-owned IMG, for example, gives it access to content from promotions such as the World’s Strongest Man. Wave.tv shares the advertising revenue it generates with its content partners, the company’s executives said.\n  Even within its content covering mainstream sports, Wave.tv emphasizes unique or offbeat moments, sometimes captured away from the field, over game highlights.\n  A channel called The Pump that features extreme fitness and athletic stunts, for example, includes footage from wood-chopping competitions.\n  Fans also submit home videos to be featured on one of Wave.tv’s channels. The company’s flagship channel, for example, posted a video of a quarantine Wiffle ball fail.\n    Since the pandemic began, roughly 80% of Wave.tv’s overall viewing came from videos featuring nontraditional sports, the company said. That reflects partly the lack of new content from mainstream sports partners such as Major League Baseball, and partly from the company’s growing library of alternative sports clips. About 29 of the company’s rights partnerships, including 16 of the 26 deals signed in the past few months, are focused on nontraditional sports such as karate, badminton and bare knuckle fighting, Wave.tv executives said.\n  More established sports media companies have tried similar tactics during the pandemic, filling their airwaves and social feeds with an array of sports-related or sports-adjacent content.\n  “Even ESPN is posting on Instagram about slap-fighting,” said Gregory Tedesco, executive vice president of digital and performance marketing at ad agency Zeno Group. “This is stuff that people might not participate in, but they will share it with their friends.”\n  But Mr. Tedesco said Wave.tv is an attractive option for clients seeking to reach millennials and Gen-Z audiences online. Eighty percent of Wave.tv’s viewers are 13 to 34 years old, according to the company.\n  “They are taking sports content and creating dynamic assets that are very human and speak to how the average sports fan likes to share things online,” he said.\n  Wave.tv also has begun to do direct brand deals. Marketing clients have included  Under Armour  and Molson Coors BeverageCo.’s Miller Lite, Wave.tv executives said.\n  Wave.tv will use its new funds in part to launch or acquire programming brands as well as to expand into other content formats, including audio and longer-form video. The company will remain focused on distributing its content to platforms where younger viewers are spending their time, company executives added.\n  “We’re tapping into fandoms that have existed for a long time, and adapting it to the platforms and mediums where today’s Gen Z and millennials are going for their sports entertainment experience,” said Brian Verne, Wave.tv’s chief executive.", "posttime": "2020-07-22 23:44:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,sports,视频,videos,体育", "title": "为Snapchat和Facebook等平台制作非常规运动视频的Wave.tv表示，A系列融资3200万美元，估值在5000万至1亿美元之间", "title_en": "Wave.tv, which makes videos of offbeat sports for platforms like Snapchat and Facebook, raises $32M Series A, says at a valuation between $50M and $100M", "transed": 1, "url": "https://www.wsj.com/articles/sports-media-startup-wave-tv-pulls-in-new-funding-as-it-targets-expansion-11595412000?mod=djemalertNEWS", "via": "", "real_tags": ["facebook", "sports", "视频", "videos", "体育"]}, {"category": "", "categoryclass": "", "imagename": "ff66e39d2e7bf685fe6615a291ddd9fd.jpg", "infoid": 1013515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook现在允许你在iPhone或iPad上打开Messenger时增加一层额外的安全措施。应用程序本身现在可以锁定，也可以在关闭后不久锁定，要求您使用Face ID或Touch ID等身份验证方法将其重新打开。这意味着你可以解锁你的手机，让朋友借走，但那个人仍然无法访问你的Messenger聊天。\nFacebook称之为App Lock的这项功能，是Messenger在隐私和安全方面的一些小变化的一部分。这款应用程序还在应用程序的设置中添加了隐私部分，为用户提供了一个单一的位置来控制App Lock等功能以及他们屏蔽了哪些用户。App Lock预计将在“接下来的几个月”进入Android。\nFacebook还提到了一些计划很快开始测试的额外功能。它将开始为用户提供对谁可以给他们发短信的更多控制权(该公司没有提供太多细节说明这一功能将如何运作)，它将开始模糊那些未经你批准给你发短信的人的照片，这样你就不必打开一个潜在的麻烦图片来查看新邮件，知道你是否想和某人聊天。Instagram和WhatsApp上已经提供了类似的功能。Facebook没有说这项功能何时开始在Messenger上发布。", "note_en": "Facebook now lets you add an extra layer of security when opening Messenger on an iPhone or iPad. The app itself can now be locked upon or shortly after closing, requiring you to use an authentication method like Face ID or Touch ID to open it back up. That means you could unlock your phone and let a friend borrow it, and that person still wouldn’t be able to access your Messenger chats.\n The feature, which Facebook is calling App Lock, is part of a number of small changes coming to Messenger centered on privacy and security. The app is also adding a Privacy section to the app’s settings, giving users a single location to control features like App Lock and what users they’ve blocked. App Lock is supposed to come to Android in “the next few months.”\n Facebook also mentioned some additional features that it plans to begin testing soon. It’s going to start offering users more control over who can message them (the company didn’t offer much detail on how this will work), and it’s going to start blurring photos from people who message you without your approval so that you don’t have to open a potentially troubling image just to view a new message and know if you want to chat with someone. A similar feature is already available on Instagram and WhatsApp. Facebook didn’t say when this would start arriving in Messenger.", "posttime": "2020-07-22 23:43:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,iphone,privacy,messenger", "title": "Facebook为iPhone和iPad上的Messenger添加了App Lock功能，这是Messenger一系列隐私更改的一部分，包括设置中的隐私部分", "title_en": "Facebook adds an App Lock feature to Messenger on iPhone and iPad, as part of a number of privacy changes for Messenger including a Privacy section in settings", "transed": 1, "url": "https://www.theverge.com/2020/7/22/21333945/facebook-messenger-app-lock-security-iphone-ipad-face-id?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["facebook", "iphone", "privacy", "messenger"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年6月6日第18卷第2期Google出版了两本关于SRE(站点可靠性工程)原则、最佳实践和实际应用的书。1，2然而，在处理生产事件时的火热时刻，团队的实际响应和调试方法往往与理想的最佳实践不同。\n这篇文章涵盖了2019年Google工程师如何调试生产问题的研究结果，包括工程师在各种组合中使用的工具类型、高级策略和低级任务，以有效地进行调试。它检查了用于捕获数据的研究方法，总结了生产调查的常见工程过程，并分享了专家如何调试复杂分布式系统的示例。最后，本文对该研究的Google细节进行了扩展，以提供一些可以在您的组织中应用的实用策略。\n随着这项研究的开始，它的重点是发展对调试过程的经验理解，总体目标是创建满足谷歌工程师需求的最佳产品解决方案。我们希望捕获工程师在调试时需要的数据、他们需要的时间、相关团队之间的沟通过程，以及成功的缓解类型。这个假设是，工程师在调试生产事件时试图回答的问题类型以及他们应用的缓解策略都存在共性。\n为此，我们分析了过去一年的尸检结果，提取了缓解的时间、根本原因和相关的缓解措施。然后，我们选择了20个最近发生的事件进行定性的用户研究。这种方法使我们能够在真实环境中理解和评估工程师的流程和实践，并深入研究无法通过分析验尸文档趋势提取的用户行为和模式。\n第一步是试图理解用户行为：在最高级别，Google的端到端调试体验是什么样的？这项研究分为以下几个阶段(在以下各节中展开)：\n·阶段0-定义划分事件响应者和事件类型人群的方法。\n·阶段1-审核一系列谷歌实际事件的尸检文档。\n·阶段2-对处理这些事件的急救人员进行深入的用户访谈。\n·阶段3-绘制响应人员在这些事件中的行程图，详细说明常见模式、问题和采取的步骤。\n对研究人群进行划分的初步方法旨在确保包括足够广泛的事件和受访者集合，我们可以从中获取一组全面的数据。\n首先，事件响应者(或随叫者)被分成两个不同的组：SWES(软件工程师)和SRE(站点可靠性工程师)，前者通常与产品团队一起工作，后者通常负责许多产品的可靠性。根据在谷歌的任期，这两个群体被进一步细分。我们在不同的用户群中发现了以下行为：\n·SWE更有可能在调试工作流程的早期查阅日志，在调试工作流程中查找可能指示故障发生位置的错误。\n·SRE依赖更通用的调试方法：由于SRE通常待命提供多项服务，因此它们根据其系统的已知特征应用常规方法进行调试。他们寻找跨服务运行状况指标的常见故障模式(例如，请求的错误和延迟)，以隔离问题发生的位置，并且通常仅在他们仍然不确定最佳缓解策略时才深入日志。\n·较新的工程师更有可能使用最近开发的工具，而拥有丰富经验(在谷歌运行复杂的分布式系统十年或更长时间)的工程师倾向于使用更多遗留工具。直觉上，这一发现是有道理的--人们倾向于使用他们最舒服的工具，特别是在紧急情况下。\n我们还检查了以下各个维度的事件，并发现每个维度都有一些共同的模式：\n·规模和复杂性。爆炸半径越大(即其位置、受影响的系统、受影响的用户行程的重要性等)。问题越多，问题就越复杂。\n·响应团队的规模。随着更多的人参与调查，团队之间的沟通渠道越来越多，团队之间更紧密的协作和移交变得更加关键。\n·根本原因。在线呼叫者可能会对映射到六个常见基本问题的症状做出响应：容量问题；代码更改；配置更改；依赖性问题(我的系统/服务所依赖的系统/服务出现故障)；基础基础设施问题(网络或服务器故障)；以及外部流量问题。我们的调查故意没有关注安全或数据正确性问题，因为它们超出了本工作重点讨论的工具的范围。\n·检测。呼叫者通过基于可用性或性能问题的人或机器检测来了解问题。一些常见机制包括以下方面的警报：白盒指标；合成流量；SLO(服务级别目标)违规；以及用户检测到的问题。\n一旦确定了不同类别的事件，我们就阅读了20个确定用于定性研究的事件的验尸报告，绘制了响应人员在每个案例中采取的步骤。这种方法使我们能够验证影响响应人员如何处理这些事件以及他们面临的挑战的共同因素。我们还可以确保选择进行深度分析的事件分布在各个维度上，如上所述。\n谷歌有一种强烈的无可指责的事后处理文化。4团队通常会查看其失败的历史记录，以确保其服务继续可靠地运行。正因为如此，内部很容易获得验尸文档，并且是分析调试行为的宝贵资源。与这些尸检相关的详细聊天记录有助于形成对发生了什么、何时发生以及哪里出了问题的基本理解。然后，我们可以开始绘制调试过程的原型。未来的研究可以通过应用自然语言处理来进一步验证事件响应聊天中的响应模式，从而扩展这项工作。\n为了完成这项研究，对这20例尸检中确定的急救人员进行了深入的访谈，以便填补尸检文件中的任何空白。这些数据源为我们映射的调试之旅增添了浓墨重彩的一笔，并浮现出一组构成整个调试过程的核心构建块。\n这项研究使我们能够生成Google实际事件调查生命周期的快照。通过绘制每个响应者的旅程，然后聚合这些视图，我们提取了与调试相关的通用模式、工具和问题，这些模式、工具和问题几乎适用于每种类型的事件。图1是每个受访应答者所采取步骤的可视映射示例。\n典型的规范调试过程由图2所示和本节描述的阶段和子过程组成。在用户调查问题时，通常会重复这些构建块，并且每个构建块可能以不连续的顺序发生，有时还会以循环的顺序发生。\n在检测到缓解阶段，调查通常对时间敏感-特别是当问题影响最终用户体验时。在找出根本原因之前，上门拜访的人总是会尝试缓解问题或止血。在缓解之后，上门调用者和开发人员通常会对代码执行更深入的分析，并应用措施来防止类似情况再次发生。\n上门呼叫者通过警报、客户上报或团队工程师的主动调查发现问题。一个常见的问题是：这个问题的严重性有多大？\n呼叫者的目标是通过检查情况的爆炸半径(问题的严重性和影响)并确定是否需要升级(召集其他团队，通知内部和外部利益相关者)来快速评估情况。随着更多信息的传入，此阶段可能会在单个事件中多次发生。\n常见问题包括：我应该升级吗？我是需要立即解决这个问题，还是可以等一下？这次停机是本地的、地区性的还是全球性的？如果停机是本地的或地区性的，它是否会成为全局停机(例如，金丝雀分析工具包含的部署可能不会触发全局停机，而现在正在您的系统中传播的部署所触发的死亡查询可能不会触发全局停机)？\n来电者形成关于潜在问题的假设，并使用各种监测工具收集数据，以验证或反驳理论。然后，上门呼叫者尝试缓解或修复潜在问题。这一阶段通常会在单个事件中多次发生，因为呼叫者会收集数据来验证或反驳有关问题原因的任何假设。\n常见问题包括：错误和延迟是否出现峰值？需求有变化吗？这项服务有多不健康？(这是错误警报，还是客户仍在遇到问题？)。有哪些有问题的依赖项？服务或依赖项中是否有生产更改？\n上门拜访的人的目标是确定什么缓解措施可以解决这个问题。有时，缓解尝试可能会使问题变得更糟，或者对其依赖的服务之一造成不利的连锁反应。补救(或问题的完全解决)通常需要所有调试步骤中最长的时间。这一步骤可以并且经常在单个事件中多次发生。\n常见的问题包括：应该采取什么缓解措施？您对这是适当的缓解措施有多大信心？这种缓解解决了问题吗？\n随叫随到的人的目标是找出潜在的问题，以防止问题再次发生。此步骤通常发生在问题缓解之后，并且不再对时间敏感，并且可能涉及重大代码更改。应答者在这一阶段编写尸检文档。\n常见问题包括：哪里出了问题？问题的根本原因是什么？如何使您的流程和系统更具弹性？\n在整个过程中，事件响应者记录他们的调查结果，与团队成员一起进行调试，并根据需要在团队外部进行沟通。\n在每一次访谈中，上门拜访的人都报告说，他们开始使用指示给定服务健康状况的时间序列指标，执行广度优先搜索，以确定系统的哪些组件出现故障。大多数接受采访的团队对以下项目进行了评估：\n·RPC(Remote Procedure Call)延迟和错误指标(类似于源自开源GRPC库的指标)。\n警报和实时控制面板都使用这些指标。On-Callers通常仅在确定组件损坏后才使用日志和跟踪，然后需要深入到特定问题。\n一些受访者应用SRE最佳实践来调试复杂的分布式系统，有条不紊地消除了他们关于可能出错的理论，应用临时缓解措施来防止用户痛苦，最后，成功地解决了最初导致停机的问题并从根本上解决了问题。\n许多其他响应人员遇到了意想不到的路障。一些响应者受到整个堆栈中同时发生的一组复杂更改的影响。因此，隔离实际问题并找出如何解决它是极具挑战性的。其他应答者提到了流程和意识问题：一些人没有完全理解他们的生产工具是如何工作的，或者没有完全理解应该采取的适当的标准行动过程。一些响应者最终无意中将糟糕的变化应用到生产中。\n下面是一些(匿名)故事来说明成功的调试会话和有问题的调试会话。这些轶事旨在表明，即使拥有最有经验的工程师、伟大的技术和强大的工具，事情也可能-并且确实会-以意想不到的方式出错。\n以下是一个成功调试会话的示例，其中SRE遵循最佳做法，并在不到20分钟的时间内缓解了服务关键型问题。\n在开会时，SRE On-Caller收到一个页面，通知她前端服务器出现500服务器错误。当她最初查看服务健康仪表盘时，一场寻呼风暴开始了，她看到更多的警报被触发，错误浮出水面。她反应迅速，立即发现她的服务不健康。\n然后，她确定问题的严重性，首先问自己有多少用户受到影响。在查看了几张错误率图表后，她确认有几个位置受到了这次停机的影响，她怀疑如果不立即解决，情况将会显著恶化。这条问题线被称为分诊循环，类似于医疗保健中使用的分诊流程(例如，急诊室根据紧急程度或服务类型对患者进行分类)。SRE需要确定警报是否为噪音，是否需要立即处理，以及是否将问题上报给其他团队和风险承担者。\n现在她知道这是一个真实而相对严重的问题，SRE开始从她的团队中拉来其他人来帮助调查。她还建立了沟通渠道，通知可能受到影响的其他团队，并让他们知道她的团队正在处理停机问题。\n然后，她将重点放在为最终用户暂时缓解问题上。她让一名队友确保流量不会被路由到任何不健康的位置，并配置负载平衡器以避免将流量发送到受影响的位置。目前，这一行动阻止了问题的传播，这让她可以自由地使用监测数据进行更深入的调查。\n接下来，她问了一系列问题，帮助她缩小潜在原因的范围，并找出如何最好地永久缓解这个问题。她主要使用时间序列指标(例如，云监控指标3)来帮助快速回答以下问题：\n·缩小调查范围：服务的哪些具体部分是不健康的？错误是来自前端还是来自后端？是否有&34；个数据切片有问题？数据中是否存在异常值？\n·确定问题的严重程度并排除原因：图形的形状是阶跃(某些东西突然改变并保持不变)、尖峰(某些东西改变，然后停止)还是斜坡(正在逐步推出)？错误率上升的速度有多快？\n·确定严重程度：爆炸半径是多少？(如果在全球范围内发生错误，这表示存在很可能会对最终用户产生影响的严重问题。)。\n·排除潜在原因：问题是什么时候开始的？服务或其依赖项中的哪些生产事件与此问题相关？\n一旦问题得到缓解，SRE就会深入日志和跟踪，确认新的代码行正在使有问题的区域中的作业崩溃。她决定回滚到服务的最后一个稳定版本，并验证当受影响的位置重新联机时问题是否已解决。\n以下是Google On-Callers在调试时遇到意想不到的障碍的一个例子，应用最佳实践本可以减少缓解的时间。\n呼叫者会收到一个页面，通知他服务的总体服务器端可用性SLO(服务级别目标)已从99.9%降至91%，并且特定的用户操作失败。他通过查看度量图开始他的调查，这些度量图确认(1)错误率何时开始增加；(2)错误主要由超时引起；以及(3)请求持续时间大约等于超时持续时间。然后，他将指标切片到前面标识的失败用户操作，检查相关的服务器错误和每秒查询数指标，并深入服务器日志以查找特定错误。到目前为止，他一直遵循常见的调试实践。\n同时，另一个后端服务依赖项的在线调用者注意到该服务接近其配额限制，并怀疑这种情况可能会对调查产生影响。此On-Call尝试通过更改配置来分配一些配额，希望缓解问题。但是，由于配置推送工具中的误解，此更改意外地删除了一个位置的后端服务器，而不是添加配额，这会增加其他位置的错误率。此外，由于他认为这一更改是安全的，因此上门拜访的人没有像最佳实践建议的那样密切监控更新配置的推出，并且最初没有注意到通过移除该位置实际上降低了总容量的指标。此时，呼叫者通过执行包括完全不相关的更改的未经验证配置的全局推送来打破最佳实践-删除后端的操作应与添加容量分开。\n在此过程中，第一个呼叫者深入查看日志，发现删除后端服务器时权限被拒绝的错误增加。他通过广度优先搜索多个支持后端并分析它们的聚合日志来做到这一点。在这里，他注意到当一台服务器被删除时，更多的请求会流向出现问题的服务器。只有在深入挖掘日志并打开许多工具之后，他才能将错误与依赖项中的配置更改联系起来。\n更好的工具可以防止用户执行意想不到的更改。工具还可以帮助验证更改的实际效果。此外，更好的工具来支持监视系统更改的影响，本可以帮助呼叫者更早地得出这些结论。\n然后，上门拜访的人会联系起来，分享他们的发现。连接后，第一个呼叫方回滚降低容量的配置推送，识别更改权限错误的后端依赖项，并与后端团队合作回滚不良更改。\n如果您负责运行分布式服务，您可能会发现自己要处理的场景与我们采访的团队经历的场景相似。我们的研究表明，应用以下原则的团队通常能够更快地缓解服务问题。\n您需要有SLO和/或指标，您可以根据需要发出警报并选择性地进行报告。这些应该准确地反映用户的痛苦，并允许按故障域进行切片。这些还应与具有明确后续步骤和指向最重要信息的链接的警报相关联。\n一旦具备了SLO的前提条件和准确的监控，您需要能够快速确定用户疼痛的严重程度和总爆炸半径。您还应该知道如何根据问题的严重程度设置适当的沟通渠道。\n记录一组对您的服务安全的缓解策略可以帮助在线呼叫者临时修复面向用户的IS。\n.", "note_en": "June 6, 2020   Volume 18, issue 2     Google has published  two books about SRE (Site Reliability Engineering) principles, best practices, and practical applications. 1,2 In the heat of the moment when handling a production incident, however, a team&#39;s actual response and debugging approaches often differ from ideal best practices.\n This article covers the outcomes of research performed in 2019 on how engineers at Google debug production issues, including the types of tools, high-level strategies, and low-level tasks that engineers use in varying combinations to debug effectively. It examines the research approach used to capture data, summarizing the common engineering journeys for production investigations and sharing examples of how experts debug complex distributed systems. Finally, the article extends the Google specifics of this research to provide some practical strategies that you can apply in your organization.\n   As this study began, its focus was on developing an empirical understanding of the debugging process, with the overarching goal of creating optimal product solutions that met the needs of Google engineers. We wanted to capture the data that engineers need when debugging, when they need it, the communication process among the teams involved, and the types of mitigations that are successful. The hypothesis was that commonalities exist across the types of questions that engineers are trying to answer while debugging production incidents, as well as the mitigation strategies they apply.\n To this end, we analyzed postmortem results over the last year and extracted time to mitigation, root causes, and correlated mitigations for each. We then selected 20 recent incidents for qualitative user studies. This approach allowed us to understand and evaluate the processes and practices of engineers in a real-world setting and to deep-dive into user behavior and patterns that couldn&#39;t be extracted by analyzing trends in postmortem documents.\n The first step was trying to understand user behavior: At the highest level, what did the end-to-end debugging experience look like at Google? The study was broken down into the following phases (which are unpacked in the sections that follow):\n • Phase 0 – Define a way to segment the  incident responder and  incident type populations.\n • Phase 1 – Audit the postmortem documentation from a spread of actual Google incidents.\n • Phase 2 – Conduct in-depth user interviews with first responders who worked on those incidents.\n • Phase 3 – Map  the responders&#39; journeys across those incidents, detailing common patterns, questions, and steps taken.\n   The preliminary approach to segmenting the population under study was designed to ensure that a sufficiently broad set of incidents and interviewees was included, from which we could capture a comprehensive set of data.\n   First, the  incident responders (or  on-callers) were segmented into two distinct groups: SWEs (software engineers), who typically work with a product team, and SREs (Site Reliability Engineers), who are often responsible for the reliability of many products. These two groups were further segmented according to tenure at Google. We found the following behaviors across the different user cohorts:\n   • SWEs are more likely to consult logs earlier in their debugging workflow, where they look for errors that could indicate where a failure occurred.\n • SREs rely on a more generic approach to debugging: Because SREs are often on call for multiple services, they apply a general approach to debugging based on known characteristics of their system(s). They look for common failure patterns across service health metrics (e.g., errors and latency for requests) to isolate where the issue is happening, and often dig into logs only if they&#39;re still uncertain about the best mitigation strategy.\n   • Newer engineers are more likely to use recently developed tools, while engineers with extensive experience (ten or more years running complex, distributed systems at Google) tend to use more legacy tools. Intuitively, this finding makes sense—people tend to use the tools they are most comfortable with, particularly in emergency situations.\n   We also examined incidents across the following dimensions, and found some common patterns for each:\n • Scale and complexity. The larger the blast radius (i.e., its location(s), the affected systems, the importance of the user journey affected, etc.) of the problem, the more complex the issue.\n • Size of the responding team. As more people are involved in an investigation, communication channels among teams grow, and tighter collaboration and handoffs between teams become even more critical.\n • Underlying cause. On-callers are likely to respond to symptoms that map to six common underlying issues: capacity problems; code changes; configuration changes; dependency issues (a system/service my system/service depends on is broken); underlying infrastructure issues (network or servers are down); and external traffic issues. Our investigation intentionally did not look at security or data-correctness issues since they were outside the scope of the tools focused on in this work.\n • Detection. On-callers learn about issues through human or machine detection that is based on availability or performance problems. Some common mechanisms include alerts on the following: white-box metrics; synthetic traffic; SLO (service-level objective) violations; and user-detected issues.\n   Once the different categories of incidents were determined, we read the postmortems for the 20 incidents identified for qualitative studies, mapping the steps responders took in each case. This approach allowed us to validate the common factors that affect how responders handled these incidents and the challenges they faced. We could also ensure that the incidents selected for deep-dive analysis were distributed across the dimensions, as just described.\n Google has a strong culture of blameless postmortems. 4 It is common for teams to look at the history of their failures to ensure that their services are continuing to run reliably. Because of this, postmortem documents are readily available internally and were an invaluable resource for analyzing debugging behavior. Detailed chat transcripts linked to these postmortems helped form a base understanding of what happened, when it happened, and what went wrong. We could then start mapping a prototype of the debugging journey. Future research could extend this work by applying natural-language processing to further validate response patterns in the incident response chats.\n   To round out this study, in-depth interviews were conducted with the first responders identified in these 20 postmortems so any gaps in the postmortem document could be filled in. These data sources added significant color to the debugging journey we were mapping, and surfaced a core set of building blocks that make up the overall debugging process.\n   This study allowed us to generate snapshots of what an actual incident investigation lifecycle looks like at Google. By mapping out each responder&#39;s journey and then aggregating those views, we extracted common patterns, tools, and questions asked around debugging that apply to virtually every type of incident. Figure 1 is a sample of the visual mapping of the steps taken by each of the responders interviewed.\n    A typical canonical debugging journey consists of the stages and sub-journeys shown in figure 2 and described in this section.  These building blocks are often repeated as the user investigates the issue, and each block can happen in a nonsequential and, sometimes, cyclical order.\n During the detection to mitigation stages, investigations are typically time sensitive—especially when the issue affects the end-user experience. An on-caller will always try to mitigate the issue or &#34;stop the bleeding&#34; before uncovering the root cause. After mitigation, on-callers and developers often perform a deeper analysis of the code and apply measures to prevent a similar situation from recurring.\n    The on-caller discovers the issue via an alert, a customer escalation, or a proactive investigation by an engineer on the team. A common question would be: What is the severity of this issue?\n   The on-caller&#39;s goal is to assess the situation quickly by examining the situation&#39;s blast radius (the severity and impact of the issue) and determining whether there is a need to escalate (pull in other teams, inform internal and external stakeholders). This stage can happen multiple times in a single incident as more information comes in.\n Common questions include: Should I escalate? Do I need to address this issue immediately, or can this wait? Is this outage local, regional, or global? If the outage is local or regional, could it become global (for example, a rollout contained by a canary analysis tool likely won&#39;t trigger a global outage, whereas a query of death triggered by a rollout that is now spreading across your systems might)?\n   The on-caller forms hypotheses about potential issues and gathers data using a variety of monitoring tools to validate or disprove theories. The on-caller then attempts to mitigate or fix the underlying problem. This stage typically happens multiple times in a single incident as the on-caller collects data to validate or disprove any hypotheses about what caused the issue.\n Common questions include: Was there a spike in errors and latency? Was there a change in demand? How unhealthy is this service? (Is this a false alarm, or are customers still experiencing issues?) What are the problematic dependencies? Were there production changes in services or dependencies?\n   The on-caller&#39;s goal is to determine what mitigation action could fix the issue.  Sometimes a mitigation attempt can make the issue worse or cause an adverse ripple effect on one of its dependent services. Remediation (or full resolution of the issue) usually takes the longest of all the debugging steps. This step can, and often does, happen multiple times in a single incident.\n Common questions include: What mitigation should be taken? How confident are you that this is the appropriate mitigation? Did this mitigation fix the issue?\n   The on-caller&#39;s goal is to figure out the underlying issue in order to prevent the problem from occurring again. This step typically occurs after the issue is mitigated and is no longer time sensitive, and it may involve significant code changes. Responders write the postmortem documentation during this stage.\n Common questions include: What went wrong? What&#39;s the root cause of the problem? How can you make your processes and systems more resilient?\n   Throughout the entire process, incident responders document their findings, work with teammates on debugging, and communicate outside of their team as needed.\n   In every single interview, on-callers reported that they started working with time-series metrics that indicate the health of a given service, performing a breadth-first search to identify which components of the system were broken. The majority of the teams that were interviewed evaluated the following items:\n  • RPC (remote procedure call) latency and error metrics (similar to the metrics derived from the open-source gRPC libraries).\n    Both alerts and realtime dashboards use these metrics. On-callers typically used logs and traces only after they identified a component as broken, and they then needed to drill down to the specific issue.\n   Some of the interviewees applied SRE best practices to debug complex distributed systems, methodically eliminating their theories on what could go wrong, applying temporary mitigations to prevent user pain, and, finally, successfully resolving and root-causing the problem that set off the outage in the first place.\n Many other responders hit unexpected roadblocks. Some responders were impacted by a complex set of changes throughout the stack that occurred simultaneously. Therefore, it was extremely challenging to isolate the actual issue and figure out how to resolve it. Other responders cited process and awareness issues: Some did not fully understand how their production tooling worked, or the appropriate standard course of action to take. Some responders wound up unintentionally applying bad changes to production.\n Following are some (anonymous) stories to illustrate successful and problematic debugging sessions. These anecdotes are intended to show that even with the most experienced engineers, great technology, and powerful tooling, things can—and do—go wrong in unexpected ways.\n   The following is an example of a successful debugging session, where the SRE follows best practices and mitigates a service-critical issue in less than 20 minutes.\n While sitting in a meeting, the SRE on-caller receives a page informing her that the front-end server is seeing a 500 server error. While she&#39;s initially looking at service health dashboards, a pager-storm starts, and she sees many more alerts firing and errors surfacing. She responds quickly and immediately identifies that her service isn&#39;t healthy.\n She then determines the severity of the issue, first asking herself how many users are affected. After looking at a few error rate charts, she confirms that a few locations have been hit with this outage, and she suspects that it will significantly worsen if not immediately addressed. This line of questioning is referred to as the  triage loop, similar to triage processes used in health care (for example, emergency rooms that sort patients by urgency or type of service). The SRE needs to determine if the alert is noise, if she needs to handle it now, and whether to escalate the issue to other teams and stakeholders.\n Now that she knows this is a real and relatively severe issue, the SRE starts pulling in other people from her team to help with the investigation. She also sets up communication channels to inform other teams that may be affected, and to let them know her team is addressing the outage.\n She then focuses on temporarily mitigating the issue for end users. She tasks a teammate with ensuring that traffic isn&#39;t routed to any of the unhealthy locations and configuring load balancers to avoid sending traffic to affected locations. For the moment, this action stops the issue from propagating, which leaves her free to conduct a deeper investigation using monitoring data.\n Next, she asks a series of questions that help her narrow down the potential cause and figure out how best to mitigate the issue permanently. She largely uses time-series metrics ( e.g., Cloud Monitoring metrics 3) to help answer these questions quickly:\n •  To narrow down the breadth of the investigation: Which specific parts of the service are unhealthy? Are the errors coming from the front end or the back end? Are there &#34;slices&#34; of data that are problematic? Are there outliers in the data?\n •  To identify the severity of the issue and rule out causes: Is the shape of the graph a step (something changed suddenly and remained unchanged), a spike (something changed, then stopped), or a slope (a gradual rollout is happening)? How quickly did the error rate ramp up?\n •  To identify the severity: What is the blast radius? (If errors occur globally, this indicates a severe issue that will most likely have end-user impact.)\n •  To rule out underlying causes: When did the problem start? What production events in the service or in its dependencies correlate with this issue?\n Once the issue is mitigated, the SRE drills into logs and traces, confirming that a new line of code was crashing the jobs in the regions with issues. She decides to roll back to the last stable version of the service, and validates that the issue is resolved when the affected locations are brought back online.\n   The following is an example of a journey where Google on-callers hit unexpected hurdles as they debugged, and where applying best practices could have reduced the time to mitigation.\n The on-caller receives a page that informs him that the service&#39;s overall server-side availability SLO (service-level objective) was down from 99.9 percent to 91 percent, and that specific user actions failed. He begins his investigation by looking at graphs of metrics that confirm (1) when the error rate started to increase; (2) errors were mostly caused by timeouts; and (3) request durations were about equal to the duration of the timeout. He then slices the metrics to the failing user actions identified before, checks the associated server errors and queries-per-second metrics, and digs into server logs to find specific errors. Up to this point, he has followed common practices for debugging.\n At the same time, another on-caller for a back-end service dependency notices that the service is nearing its quota limitations and suspects that this situation might have an impact on the investigation. This on-caller tries to allocate some quota through a configuration change, hoping to alleviate the problem. Because of a misunderstanding in the configuration push tooling, however, this change accidentally removes a back-end server in one location instead of adding quota, which increases the error rates in the other locations. Additionally, since he considered this change to be safe, the on-caller didn&#39;t monitor the rollout of the updated configuration as closely as best practices recommend, and initially missed indicators that overall capacity was actually reduced by removing that location. At this point, the on-caller breaks from best practices by performing a global push of a nonvalidated configuration that includes a completely unrelated change—the action of dropping a back end should be separate from adding capacity.\n While this is happening, the first on-caller goes deep in the logs and finds &#34;permission-denied&#34; errors increased at the time the back-end server was removed. He does this through a breadth-first search of a number of the supporting back ends and an analysis of their aggregated logs. Here, he notices that when one server was removed, more requests were funneling to the servers that were experiencing issues. Only after digging into logs and opening a number of tools is he able to connect the errors to the configuration change in the dependency.\n Better tooling could have prevented the user from performing an unanticipated change. Tooling could also have helped validate what the change would actually do. Additionally, better tooling to support monitoring the effects of the changes to the system could have helped the on-callers draw these conclusions earlier.\n The on-callers then connect to share their findings. Once connected, the first on-caller rolls back the configuration push that reduced capacity, identifies the back-end dependency that changed the permission errors, and works with the back-end team to get bad changes rolled back.\n   If you are responsible for running a distributed service, you might find yourself dealing with scenarios similar to what the teams we interviewed experienced. Our study revealed that teams that apply the following principles are typically able to mitigate service problems faster.\n   You need to have SLOs and/or metrics that you can alert and optionally report on. These should accurately reflect user pain and allow for slicing by failure domains. These should also be associated with alerts that have clear next steps and links to the most important information.\n   Once you have the prerequisites of SLOs and accurate monitoring in place, you need to be able to quickly determine both the severity of user pain and the total blast radius. You should also know how to set up the proper communication channels based on the severity of the issue.\n   Documenting a set of mitigation strategies that are safe for your service can help on-callers temporarily fix user-facing is\n......", "posttime": "2020-07-22 23:37:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,incidents", "title": "Google分布式系统中的调试事件", "title_en": "Debugging Incidents in Google's Distributed Systems", "transed": 1, "url": "https://queue.acm.org/detail.cfm?id=3404974", "via": "", "real_tags": ["google", "incidents"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1013513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本网站使用Cookie来提高性能。如果您的浏览器不接受Cookie，您将无法查看此站点。\n无法正确设置Cookie的原因有很多。以下是最常见的原因：\n您的浏览器中禁用了Cookie。您需要重置浏览器以接受Cookie，或者询问您是否要接受Cookie。\n您的浏览器询问您是否要接受Cookie，但您拒绝了。若要接受来自此网站的Cookie，请使用“上一步”按钮并接受Cookie。\n您计算机上的日期是过去的日期。如果您的计算机时钟显示的日期早于1970年1月1日，浏览器将自动忘记cookie。要解决此问题，请在计算机上设置正确的时间和日期。\n您已安装监视或阻止设置Cookie的应用程序。您必须在登录时禁用该应用程序，或咨询您的系统管理员。\n此网站使用Cookie来提高性能，方法是在您从一个页面转到另一个页面时记住您已登录。如果在没有cookie的情况下提供访问，则需要站点为您访问的每个页面创建一个新会话，这会使系统速度降到不可接受的程度。\n此站点在Cookie中只存储自动生成的会话ID；不会捕获任何其他信息。\n通常，只有您提供的信息或您在访问网站时做出的选择才能存储在Cookie中。例如，除非您选择键入电子邮件名称，否则站点无法确定您的电子邮件名称。允许网站创建Cookie不会授予该站点或任何其他站点对计算机其余部分的访问权限，并且只有创建Cookie的站点才能读取该Cookie。", "note_en": "This site uses cookies to improve performance. If your browser does not accept cookies, you cannot view this site.\n      There are many reasons why a cookie could not be set correctly. Below are the most common reasons:\n  You have cookies disabled in your browser. You need to reset your browser to accept cookies or to ask you if you want to accept cookies.\n  Your browser asks you whether you want to accept cookies and you declined. To accept cookies from this site, use the Back button and accept the cookie.\n    The date on your computer is in the past. If your computer&#39;s clock shows a date before 1 Jan 1970, the browser will automatically forget the cookie. To fix this, set the correct time and date on your computer.\n  You have installed an application that monitors or blocks cookies from being set. You must disable the application while logging in or check with your system administrator.\n      This site uses cookies to improve performance by remembering that you are logged in when you go from page to page. To provide access without cookies would require the site to create a new session for every page you visit, which slows the system down to an unacceptable level.\n      This site stores nothing other than an automatically generated session ID in the cookie; no other information is captured.\n  In general, only the information that you provide, or the choices you make while visiting a web site, can be stored in a cookie. For example, the site cannot determine your email name unless you choose to type it. Allowing a website to create a cookie does not give that or any other site access to the rest of your computer, and only the site that created the cookie can read it.", "posttime": "2020-07-22 23:36:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经济学,污水,socioeconomics,cookie", "title": "利用污水进行人口社会经济学预测", "title_en": "Population Socioeconomics Predicted Using Wastewater", "transed": 1, "url": "https://pubs.acs.org/doi/10.1021/acs.estlett.0c00392", "via": "", "real_tags": ["经济学", "污水", "cookie"]}, {"category": "", "categoryclass": "", "imagename": "dae8810ade3c3946bbe9fc35955157c1.png", "infoid": 1013512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "首席数据科学布道员(美国远程可选)。\n布道主义和开发者倡导者", "note_en": "Lead Data Science Evangelist (US Remote Optional)\n Evangelism and Developer Advocacy", "posttime": "2020-07-22 23:36:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring,数据", "title": "Pachyderm正在招聘K8S DevOps和Golang Devs", "title_en": "Pachyderm is hiring K8s DevOps and Golang Devs", "transed": 1, "url": "https://jobs.lever.co/pachyderm/", "via": "", "real_tags": ["hiring", "数据"]}, {"category": "", "categoryclass": "", "imagename": "762e5f763606a4d5c76c66659d616c79.jpg", "infoid": 1013511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "匈牙利数学家Paul Erdős曾经说过：“你不一定要相信上帝，但你必须相信这本书。”这本书只存在于理论上，它包含了最重要定理的最优雅的证明。Erdő的授权暗示了数学家们的动机，他们继续为已经证明的定理寻找新的证明。最受欢迎的是素数定理--这是一种描述素数分布的语句，素数的唯一因子是1和它们自己。虽然数学家从来不知道一个证明是否值得收录在这本书中，但雅克·哈达玛(Jacques Hadamard)和查尔斯-让·德拉瓦莱·普辛(Charles-Jean de la Vallée Poussin)在1896年提出的素数定理的第一个独立证明是两位强有力的竞争者。\n素数定理提供了一种近似小于或等于给定数n的素数的方法，这个值称为π(N)，其中π是“素数计数函数”。例如，因为有四个素数小于或等于10(2，3，5和7)，所以π(10)=4。同样，π(100)=25，因为前100个整数中有25个是质数。在前1,000个整数中，有168个素数，因此π(1,000)=168，依此类推。请注意，当我们考虑前10个、100个和1000个整数时，素数的百分比从40%到25%再到16.8%。这些例子表明，素数定理证实，质数等于或低于给定数的密度随着该数的增大而减小。\n但是，即使您有一个排序的正整数列表，比方说，超过1万亿，谁会想要通过手动计数的方式来确定π(1,000,000,000)？素数定理提供了一条捷径。\n该定理告诉我们，π(N)n与$LaTeX{\\fRAC{n}{\\ln(N)}$“渐近相等”，其中1ln是自然对数。(您可以将渐近相等视为近似相等，尽管从技术上讲，它不止如此。)。例如，让我们估计素数的数量高达1万亿。不是计算单个素数来确定π(1,000,000,000,000)，而是可以使用这个定理了解到大约有$LaTeX\\FRAC{1,000,000,000}{\\ln(1,000,000,000)}$，等于。当四舍五入为整数时，为36,191,206,825。这个数字与实际答案37,607,912,018只相差约4%。\n在渐近相等的情况下，在公式中插入较大的数字时，精度会提高。基本上，当你走向无穷大时--它本身不是一个数字，而是比任何数字都大的东西--定理中的近似相等接近于实际的相等。这是尽管素数的实际数目总是等于整数，而在渐近相等的另一边，涉及自然对数函数的分数可以等于实数线上的任何值。整数和实数之间的这种联系充其量是违反直觉的。\n这是令人振奋的东西，即使在数学家中也是如此。令人抓狂的是，素数定理的陈述并没有暗示为什么这一切都是真的。\n“这个定理从来就不是关于这个定理的。澳大利亚昆士兰理工大学(Queensland University Of Technology)数学教授迈克尔·博德(Michael Bode)说。\n尽管阿达马德和德拉瓦莱·普辛的证明很优雅，但他们最初的证明依赖于复数分析--研究具有虚数的函数--一些人认为这并不令人满意，因为这个定理的陈述本身并不涉及复数。然而，1921年，G·H·哈代(G.H.Hardy)称质数定理的非分析性证明--也就是所谓的初等证明--的前景“极不可能”，并声称，如果有人能找到一个，那就需要“重写理论”。\nAtle Selberg和Erdő自己接受了挑战，并在1948年各自发表了使用对数性质的素数定理的新的、独立的初等证明。这些证明促使其他数学家考虑用类似的方法来处理数论猜想，此前人们认为这种看似简单的方法过于深奥。许多令人兴奋的结果随之而来，包括赫尔穆特·迈尔(Helmut Maier)1985年的初等证明，证明了素数分布出现了意想不到的不规则现象。\n西北大学(Northwest University)数学家弗洛里安·里希特(Florian Richter)最近发布了这一著名命题的新的初等证明，他说：“这么多悬而未决的问题都是建立在素数定理的基础上的。”里希特在试图证明素数定理的一个深远推广时找到了他的证明。\n随着时间的推移，数学家帮助建立了一种文化，在这种文化中，数学家致力于证明和重新证明定理，不仅是为了验证陈述，也是为了提高他们证明定理的技能和对所涉及的数学的理解。\n这超出了素数定理的范畴。保罗·里本博伊姆编目了至少7个素数无穷大的证明。Steven Kifowit和Terra Stamps确定了20个证明，证明调和系列1+$LATEX\\FRAC{1}{2}$+$LATEX\\FRAC{1}{3}$+$LATEX\\FRAC{1}{4}$+$LATEX\\FRAC{1}{5}$+$LATEX\\FRAC{1}{6}$+$LATEX\\FRAC{1}{7}$+…。，并不等于一个有限的数字，Kifowit后来又增加了28个。布鲁斯·拉特纳(Bruce Ratner)引用了毕达哥拉斯定理的371种不同证明，包括欧几里德、莱昂纳多·达·芬奇(Leonardo Da Vinci)和当时来自俄亥俄州的美国总统詹姆斯·加菲尔德(James Garfield)提供的一些宝石。\n重新证明事物的习惯现在是如此根深蒂固，数学家们可以从字面上指望它。Tom Edgar和Yajun An指出，在高斯1796年的最初证明之后，已经有246个被称为二次互易定律的陈述的证明。通过绘制随时间推移的证明数量图，他们推断，这个定理的第300次证明大约在2050年左右。\n堪萨斯州立大学(Kansas State University)研究生索菲娅·雷斯塔德(Sophia Restad)说：“我喜欢旧定理的新证明，就像我喜欢通往我已经去过的地方的新道路和捷径一样。”这些新路径为数学家提供了一种智力活动的比喻地域感。\n数学家可能永远不会停止寻找素数定理和其他受人喜爱的定理的新的、更有启发性的途径。幸运的是，他们中的一些人甚至值得被收录在这本书中。", "note_en": "“You don’t have to believe in God, but you have to believe in   The Book,” the Hungarian mathematician  Paul Erdős once said.  The Book, which only exists in theory, contains the most elegant proofs of the most important theorems. Erdős’ mandate hints at the motives of mathematicians who continue to search for new proofs of already proved theorems. One favorite is the prime number theorem — a statement that describes the distribution of prime numbers, those whose only divisors are 1 and themselves. While mathematicians never know whether a proof would merit inclusion in  The Book, two strong contenders are the first, independent proofs of the prime number theorem in 1896 by Jacques Hadamard and Charles-Jean de la Vallée Poussin.\n  The prime number theorem provides a way to approximate the number of primes less than or equal to a given number  n. This value is called π( n), where π is the “prime counting function.” For example, π(10) = 4 since there are four primes less than or equal to 10 (2, 3, 5 and 7). Similarly, π(100) = 25 , since 25 of the first 100 integers are prime. Among the first 1,000 integers, there are 168 primes, so π(1,000) = 168, and so on. Note that as we considered the first 10, 100 and 1,000 integers, the percentage of primes went from 40% to 25% to 16.8%. These examples suggest, and the prime number theorem confirms, that the density of prime numbers at or below a given number decreases as the number gets larger.\n But even if you had an ordered list of positive integers up through, say, 1 trillion, who would want to determine π(1,000,000,000,000) by way of a manual count? The prime number theorem offers a shortcut.\n The theorem tells us that π( n) is “asymptotically equal” to $latex \\frac{n}{\\ln (n)}$, where  ln is the natural logarithm. (You can think of an asymptotic equality as an approximate equality, though it is technically more than that.) As an example, let’s estimate the number of primes up to 1 trillion. Instead of counting individual primes to determine π(1,000,000,000,000), you could use this theorem to learn that there are approximately $latex \\frac{1,000,000,000,000}{\\ln (1,000,000,000,000)}$ of them, which equals. 36,191,206,825 when rounded to a whole number. This amount is only off by about 4% from the actual answer, 37,607,912,018.\n With asymptotic equality, the accuracy improves as you plug larger numbers into the formula. Basically, as you head toward infinity — which is not itself a number, but something larger than any number — the approximate equality in the theorem approaches an actual equality. This is despite the fact that the actual number of primes will always equal an integer, while on the other side of the asymptotic equality, the fraction involving the natural logarithm function could equal any value on the real number line. This connection between integers and real numbers is counterintuitive at best.\n It’s mind-blowing stuff, even among mathematicians. Maddeningly, the statement of the prime number theorem does not hint at why any of this is true.\n  “The theorem was never about the theorem. It was always about the proof,” said  Michael Bode, a mathematics professor at Queensland University of Technology in Australia.\n As elegant as they were, Hadamard’s and de la Vallée Poussin’s original proofs relied on complex analysis — the study of functions with imaginary numbers — which some found unsatisfying as the statement of this theorem does not itself involve complex numbers. However, G.H. Hardy, in 1921, dubbed the prospect of a nonanalytic proof — known as an elementary proof — of the prime number theorem “ extraordinarily unlikely” and claimed that if anyone should find one, it would call for “theory to be rewritten.”\n Atle Selberg and Erdős himself took on the challenge, and in 1948 they each published new, independent elementary proofs of the prime number theorem using properties of logarithms. These proofs enticed other mathematicians to consider similar methods for number theory conjectures previously considered too profound for such seemingly simple methods. Many exciting results followed, including Helmut Maier’s 1985  elementary proof showing unexpected irregularities in the distribution of primes.\n “So many open questions build on the prime number theorem,” said  Florian Richter, a mathematician at Northwestern University who recently posted a  new elementary proof of this celebrated statement. Richter found his proof while trying to prove a far-reaching extension of the prime number theorem.\n  Over time, number theorists helped establish a culture in which mathematicians worked on proving and re-proving theorems not just to verify statements, but also to improve their skills at proving theorems and their understanding of the math involved.\n This goes beyond the prime number theorem. Paulo Ribenboim cataloged  at least 7 proofs of the infinitude of primes. Steven Kifowit and Terra Stamps identified  20 proofs demonstrating that the harmonic series, 1+ $latex \\frac{1}{2}$ + $latex \\frac{1}{3}$ + $latex \\frac{1}{4}$ + $latex \\frac{1}{5}$ + $latex \\frac{1}{6}$ + $latex \\frac{1}{7}$ + …, does not equal a finite number, and Kifowit later followed up with  28 more. Bruce Ratner cites  more than 371 different proofs of the Pythagorean theorem, including some gems provided by Euclid, Leonardo da Vinci and U.S. President James Garfield, who was a member of Congress from Ohio at the time.\n This habit of re-proving things is now so ingrained, mathematicians can literally count on it.  Tom Edgar and  Yajun An noted that there have been  246 proofs of a statement known as the quadratic reciprocity law following Gauss’ original proof in 1796. Plotting the number of proofs over time, they extrapolated that we could expect the 300th proof of this theorem around the year 2050.\n  “I love new proofs of old theorems for the same reason I love new roads and shortcuts to places I’ve already been,” said  Sophia Restad, a graduate student at Kansas State University. These new paths provide mathematicians with a figurative sense of place for intellectual activity.\n Mathematicians may never stop searching for new and more illuminating paths to the prime number theorem and other beloved theorems. With luck, some of them will even merit inclusion in  The Book.", "posttime": "2020-07-22 23:35:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "停止,stop,证明", "title": "数学家永远不会停止证明素数定理", "title_en": "Mathematicians Will Never Stop Proving the Prime Number Theorem", "transed": 1, "url": "https://www.quantamagazine.org/mathematicians-will-never-stop-proving-the-prime-number-theorem-20200722/", "via": "", "real_tags": ["停止", "stop", "证明"]}]