[{"category": "", "categoryclass": "", "imagename": "7d448924dc38ff6622b0a480cff98377.jpg", "infoid": 1071282, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自 2017 年以来，总部位于波士顿的 Form Energy 一直在努力研究铁空气电池，但其研究细节很少……直到现在。本周，该公司表示其第一个商业产品是“可充电铁空气电池，能够以与传统发电厂竞争的系统成本和不到锂离子电池成本的 1/10 提供 100 小时电力”。这种电池可以连续使用多天，并将全年实现可靠、安全和完全可再生的电网。”化石燃料倡导者攻击可再生能源的方法之一是关注间歇性问题——风并不总是吹，太阳也不总是发光的事实。 Form Energy 表示，其电池技术将解决这个问题。该技术非常简单，至少在理论上是这样。据 Recharge News 报道，在放电模式下，数以千计的微小铁球暴露在空气中，这会使它们生锈——铁变成氧化铁。当系统通电时，铁锈中的氧气被去除，并恢复为铁。 Form Energy 首席执行官 Ted Wiley 说：“我们已经完成了这项研究。剩下要做的是从实验室规模的原型扩大到电网规模的发电厂。在满负荷生产时，这些模块的发电成本仅为当今可用于电网存储的任何技术成本的十分之一。” Wiley 表示，位于明尼苏达州的 Great River Energy 的 300 MW 试点项目将于 2023 年投入使用。“每个单独的电池大约有一台洗衣机的大小。这些模块中的每一个都填充有水基、不可燃的电解质，类似于 AA 电池中使用的电解质。液体电解质内部是由 10 到 20 米大小的电池堆叠而成，其中包括铁电极和空气电极，它们是电池的一部分，使电化学反应能够储存和放电。 “这些电池模块被组合在模块化兆瓦级电源块中，这些电源块在一个环保外壳中包含数以千计的电池模块。根据系统规模，数十到数百个这样的电源块将连接到电网。就规模而言，在最不密集的配置中，一兆瓦的系统需要大约一英亩的土地。更高密度的配置可以达到 &gt;3MW/英亩。 “我们的电池系统可以安装在任何地方，甚至在城市地区，以满足公用事业规模的能源需求。我们的电池补充了锂离子电池的功能，实现了我们的技术和锂离子电池的最佳平衡，全年提供成本最低的可再生和可靠的电力系统。”\nForm Energy 获得了 Breakthough Energy Ventures 的主要资金支持，该公司部分资金由比尔盖茨和杰夫贝索斯提供。但它也吸引了世界最大钢铁制造商之一安赛乐米塔尔以及意大利石油巨头埃尼和麦格理资本的投资。 Form 宣布了 D 轮融资，旨在筹集 2 亿美元。安赛乐米塔尔上周四宣布进一步投资 2500 万美元。该公司全球研发主管 Greg Ludkovsky 在该公告中表示：“Form Energy 处于长期电网电池存储领域发展的前沿。他们开发的多日储能技术具有令人兴奋的潜力，可以克服可再生能源的间歇性供应问题。他们正是我们希望通过 XCarb™ 创新基金投资的那种雄心勃勃和创新的公司。 “除了我们的投资，我们正在与他们探索明显的协同效应。其中包括安赛乐米塔尔为其电池解决方案提供铁，以及他们的电池为我们的钢铁厂提供永久、可靠的可再生能源供应的潜力，从而帮助我们过渡到碳中性炼钢。 ”这是关于开创性的新电池技术的一系列故事中的另一个，这些技术可能会或可能不会走出实验室？是的。但是这个骨头上的肉似乎比大多数都多。 ArecelorMittal 并不是一时兴起就投入资金。太阳能的价格在过去十年中暴跌了 90%。 LED 灯曾经非常微弱，只能在黑暗的房间里看到。曾经有一个没有互联网或智能手机的世界。并非每一项发明都能在市场上取得成功，但那些成功的发明可以改变世界。 Form Energy 是赢家之一吗？ “我们拭目以待，”禅师说。欣赏 CleanTechnica 的独创性？考虑成为 CleanTechnica 会员、支持者、技术员或大使——或 Patreon 的赞助人。有关于 CleanTechnica 的提示、想要做广告或想为我们的 CleanTech Talk 播客推荐一位客人？在这里联系我们。", "note_en": "Boston-based  Form Energy has been diligently working on an  iron-air battery since 2017, but details of its research have been sparse … until now. This week, the company said its first commercial product is a “rechargeable iron-air battery capable of delivering electricity for 100 hours at system costs competitive with conventional power plants and at less than 1/10th the cost of lithium-ion. This battery can be used continuously over a multi-day period and will enable a reliable, secure, and fully renewable electric grid year-round.”\n One of the ways fossil fuel advocates attack renewable energy is to focus on the intermittency issue — the fact that the wind doesn’t always blow and the sun doesn’t always shine. Form Energy says its battery technology will solve that problem.\n   The technology is dirt simple, at least in theory. According to   Recharge News, in discharge mode, thousands of tiny iron pellets are exposed to the air, which makes them rust — the iron turns to iron oxide. When the system is charged with an electric current, the oxygen in the rust is removed, and it reverts back to iron.\n Form Energy CEO Ted Wiley says, “We have completed the science. What’s left to do is scale up from lab-scale prototypes to grid-scale power plants. At full production, the modules will produce electricity for one-tenth the cost of any technology available today for grid storage.” Wiley says a 300 MW pilot project for Minnesota-based Great River Energy will be commissioned in 2023.\n  “Each individual battery is about the size of a washing machine. Each of these modules is filled with a water-based, non-flammable electrolyte, similar to the electrolyte used in AA batteries. Inside of the liquid electrolyte are stacks of between 10 and 20 meter-scale cells, which include iron electrodes and air electrodes, the parts of the battery that enable the electrochemical reactions to store and discharge electricity.\n “These battery modules are grouped together in modular megawatt-scale power blocks, which comprise thousands of battery modules in an environmentally protected enclosure. Depending on the system size, tens to hundreds of these power blocks will be connected to the electricity grid. For scale, in its least dense configuration, a one megawatt system requires about an acre of land. Higher density configurations can achieve &gt;3MW/acre.\n “Our battery systems can be sited anywhere, even in urban areas, to meet utility-scale energy needs. Our batteries complement the function of lithium-ion batteries, allowing for an optimal balance of our technology and lithium-ion batteries to deliver the lowest-cost renewable and reliable electric system year-round.”\n  Form Energy has received major funding support from Breakthough Energy Ventures, which is funded in part by Bill Gates and Jeff Bezos. But it is also attracting investments from  ArcelorMittal, one of the world’s largest steel makers, as well as Italian oil giant Eni and Macquarie Capital. Form has announced a Series D financing round that aims to raise $200 million.\n ArcelorMittal announced a further $25 million investment last Thursday. Greg Ludkovsky, global head of research and development for the company,  said as part of that announcement, “Form Energy is at the leading edge of developments in the long duration, grid  battery storage space. The multi-day energy storage technology they have developed holds exciting potential to overcome the issue of intermittent supply of renewable energy. They are exactly the kind of ambitious and innovative company we are seeking to invest in through our XCarb™ innovation fund.\n “In addition to our investment, there are obvious synergies we are exploring with them. These include from ArcelorMittal supplying iron for their battery solutions, through to the potential their batteries hold to deliver us a permanent, reliable supply of renewably generated energy for our steel plants, therefore helping us in our journey to transition to carbon-neutral steel making.”\n  Is this another in a long line of stories about groundbreaking new battery technology that may or may not ever make it out of the laboratory? Yes, it is. But this one seems to have more meat on its bones than most. ArecelorMittal is not putting up its money on a whim.\n The price of solar energy has plunged 90% in the past decade. LED lights were once so weak they could only be seen in darkened rooms. There once was a world without internet or smartphones. Not every invention succeeds in the marketplace, but those that do can transform the world. Is Form Energy one of the winners? “We’ll see,” said the Zen master.\n    Appreciate CleanTechnica’s originality? Consider becoming a  CleanTechnica Member, Supporter, Technician, or Ambassador — or a patron on  Patreon.\n             \r\r       Have a tip for CleanTechnica, want to advertise, or want to suggest a guest for our CleanTech Talk podcast?  Contact us here.", "posttime": "2021-08-03 04:58:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "energy,storage,电池", "title": "Form Energy 推出 Iron-Air 100 小时蓄电池", "title_en": "Form Energy Reveals Iron-Air 100 Hour Storage Battery", "transed": 1, "url": "https://cleantechnica.com/2021/07/24/form-energy-reveals-iron-air-100-hour-storage-battery/", "via": "", "real_tags": ["energy", "storage", "电池"]}, {"category": "", "categoryclass": "", "imagename": "6d2bb58ba2288a12bbf7701c96e27dbb.jpg", "infoid": 1071279, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "作为 Demand Curve 的高级内容主管，Stewart Hillhouse 撰写了可操作的增长营销见解。到了晚上，他会在他的播客 Top Of Mind 上采访营销人员和创意人员。在进入市场营销之前，斯图尔特是一名半职业伐木工人。他还在stewarthillhouse.com 上撰稿。我们已经在 Demand Curve 和我们的代理机构 Bell Curve 测试了数以千计的付费搜索广告。这篇文章分解了您的付费搜索广告应回答的 14 个问题，以确保您只为意向最高的购物者付费。付费搜索和自然搜索之间的一个重要区别是付费广告是一种中断。搜索引擎的用户只是在寻找他们问题的答案。看到您广告的人不欠您任何东西。仅仅因为您付费让您的广告首先出现并不意味着他们会关注它。例如，将免费送货重新定义为一种额外的便利，使该优惠更具吸引力。通过在页面说明中列出其他好处来使用广告附加信息。例如，在定价扩展页面中包含“定制计划”向您的客户表明他们可以控制成本。这将有助于吸引即使是最注重成本的买家的好奇心。大约 80% 的电子商务购物车被放弃，主要是因为购物者没有任何紧迫感来完成交易。在线购物者并不着急，因为互联网 24/7 全天候开放，库存感觉无限。要回答“我为什么要现在购买？”的问题，您必须创建激励措施，让他们立即采取行动。", "note_en": "Stewart Hillhouse writes actionable growth marketing insights as senior content lead at  Demand Curve. By night, he interviews marketers and creatives on his podcast,  Top Of Mind. Before getting into marketing, Stewart was a semi-professional lumberjack. He also writes at  stewarthillhouse.com.\n  We’ve tested thousands of paid search ads at  Demand Curve and through our agency  Bell Curve. This post breaks down 14 questions your paid search ads should answer to ensure you’re only paying for the highest-intent shoppers.\n  An important distinction between paid search and organic search is that paid ads are an interruption. Users of search engines are simply looking for an answer to their question. The people who see your ads don’t owe you anything. Just because you’re paying to have your ad show up first doesn’t mean they’re going to pay attention to it.\n    For example, reframing free delivery as an extra convenience makes the offer that much more attractive.\n Use ad extensions by listing additional benefits in the description of the page. For example, including “customized plans” in the pricing extension page signals to your customer that they’ll have control over the cost. This will help to attract the curiosity of even the most cost-conscious buyers.\n   Approximately 80% of e-commerce shopping carts are abandoned, mostly because shoppers don’t feel any urgency to complete the transaction. Online shoppers aren’t in any rush, as the internet is open 24/7 and inventory feels unlimited.\n  To answer the question, “Why should I buy now?”, you’re going to have to create an incentive to get them to take action now.", "posttime": "2021-08-03 04:14:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,曲线,curve", "title": "需求曲线：您需要在付费搜索广告中回答的问题", "title_en": "\n\t\t\t\tDemand Curve: Questions you need to answer in your paid search ads\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/demand-curve-questions-you-need-to-answer-in-your-paid-search-ads/", "via": "", "real_tags": ["广告", "曲线", "curve"]}, {"category": "", "categoryclass": "", "imagename": "066422944222078899255f3b91f853be.jpg", "infoid": 1071278, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透 7 月 28 日 - 语言学习应用程序 Duolingo Inc (DUOL.O) 周三在纳斯达克上市，股价飙升近 40%，成为给华尔街留下深刻印象的最新教育科技初创公司，估值达到 65 亿美元。 Duolingo 的股票开盘价为每股 141.4 美元，超过了每股 102 美元的首次公开募股价格 (IPO)，超过了其目标区间的上限。该股后来回吐了一些涨幅，下午交易价格为 130.92 美元。该公司的上市正值投资者对教育科技领域的兴趣增加之际，在大流行的限制将学生和教师从课堂上转移到网络之后。 Duolingo 的联合创始人兼首席执行官 Luis von Ahn 表示：“成为一家上市公司将使我们能够在更高的水平上运营，并从小联盟走向大联盟。” von Ahn 表示，在 IPO 之后，该公司将专注于改进其旗舰应用程序，并让更多活跃用户转向付费用户。 Duolingo 为每月约 4000 万活跃用户提供 40 种语言的课程。 von Ahn 表示，目前，Duolingo 最大的市场是美国，拥有 20% 的用户和 45% 的公司收入。 Duolingo 通过出售约 510 万股股票在 IPO 中筹集了近 5.21 亿美元。其中近 140 万股由现有股东出售，所得款项不会归公司所有。\n本周早些时候，该公司将其目标价格区间从早先的每股 85 美元至 95 美元上调至每股 95 美元至 100 美元之间。阅读更多 该公司由 von Ahn 和 Severin Hacker 于 2011 年创立，他们在卡内基梅隆大学相识。高盛公司和艾伦公司是此次 IPO 的主承销商。班加罗尔的 Niket Nishant 和纽约的 Echo Wang 报道； Devika Syamnath 编辑", "note_en": "July 28 (Reuters) - Language learning app Duolingo Inc  (DUOL.O) notched a valuation of $6.5 billion after its shares surged nearly 40% in the company&#39;s Nasdaq debut on Wednesday, becoming the latest education technology startup to impress Wall Street.\n Duolingo&#39;s stock opened at $141.4 per share, blowing past the initial public offering price (IPO) of $102 per share, which crossed the top end of its target range. The stock later pared some gains to trade at $130.92 in the afternoon.\n The company&#39;s flotation comes at a time of increased investor interest in the edtech space, after pandemic restrictions sent students and teachers from the classroom to the web.\n &#34;Being a public company will allow us to operate at a higher level, and get going from the minor leagues to the major leagues,&#34; said Luis von Ahn, co-founder and chief executive officer of Duolingo.\n Following the IPO, the company will focus on improving its flagship app and getting more active users to switch to paying subscribers, von Ahn said. Duolingo offers courses in 40 languages to about 40 million monthly active users.\n  Currently, Duolingo&#39;s largest market is the United States, home to 20% of its users and bringing in 45% of the company&#39;s revenue, von Ahn said.\n Duolingo raised nearly $521 million in the IPO by selling about 5.1 million shares. Almost 1.4 million of those shares were sold by existing stockholders and the proceeds will not go to the company.\n Earlier this week, the company raised its price target range to between $95 and $100 per share, from an earlier estimate of between $85 and $95 per share.   read more\n The company was founded in 2011 by von Ahn and Severin Hacker, who met at Carnegie Mellon University.\n Goldman Sachs &amp; Co and Allen &amp; Company are the lead underwriters for the IPO.\n Reporting by Niket Nishant in Bengaluru and Echo Wang in New York; Editing by Devika Syamnath", "posttime": "2021-08-03 04:02:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "当天,valuation", "title": "多邻国首次公开募股当天估值达到 65 亿美元", "title_en": "Duolingo Reaches $6.5 Billion Valuation On Day of IPO", "transed": 1, "url": "https://www.reuters.com/technology/duolingo-valued-65-bln-shares-soar-debut-2021-07-28/", "via": "", "real_tags": ["当天", "valuation"]}, {"category": "", "categoryclass": "", "imagename": "e01fba4333bdd6402fe40640823db783.jpg", "infoid": 1071277, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在相对论重离子对撞机 (RHIC) 上研究粒子碰撞的科学家们已经为 80 多年前预测的两种物理现象提供了确凿的证据。结果来自对 RHIC 掠射粒子碰撞中产生的 6,000 多对电子和正电子的详细分析，并发表在《物理评论快报》上。主要发现是电子和正电子对——物质和反物质的粒子——可以通过碰撞非常直接产生，它们是 的量子“包”。能量光转化为物质是爱因斯坦著名的 E=mc2 方程的直接结果，该方程指出能量和物质（或质量）是可以互换的。太阳和核电站中的核反应经常将物质转化为能量。现在，科学家们只需一步即可将光能直接转化为物质。第二个结果表明，光在真空中穿过磁场的路径弯曲不同，这取决于光的偏振方式。当光穿过某些材料时，就会发生这种偏振相关的偏转（称为双折射）。 （这种效果类似于波长相关偏转将白光分成彩虹的方式。）但这是真空中偏振相关光弯曲的首次演示。这两个结果都取决于 RHIC 的 STAR 探测器——RHIC 的电磁跟踪器——测量以接近光速移动的金离子的掠射碰撞中产生的粒子角分布的能力。当物理学家 Gregory Breit 和 John A. Wheeler 于 1934 年首次描述碰撞光粒子以产生电子对和它们的反物质对应物（称为正电子）的假设可能性时，这种能力并不存在。“在他们的论文中，Breit 和 Wheeler 已经意识到这几乎是不可能的，”布鲁克海文实验室物理学家、RHIC STAR Collaboration 的成员 Zhangbu Xu 说。 “激光甚至还不存在！但是 Breit 和 Wheeler 提出了一个替代方案：加速重离子。他们的替代方案正是我们在 RHIC 所做的。”离子本质上是一个裸原子，被剥夺了电子。具有 79 个质子的金离子带有强大的正电荷。将这种带电重离子加速到非常高的速度会产生一个强大的磁场，该磁场在高速粒子行进时围绕它盘旋——就像电流流过电线一样。 “如果速度足够高，圆形磁场的强度可以等于垂直电场的强度，”徐说。而这种强度相等的垂直电场和磁场的排列正是光子——光的量子化“粒子”。 “所以，当离子以接近光速的速度运动时，金核周围会有一堆光子，像云一样随它移动。”\n在 RHIC，科学家们在两个加速器环中将金离子加速到 99.995% 的光速。 “我们有两个光子云以足够的能量和强度向相反的方向移动，当两个离子相互擦过而不发生碰撞时，这些光子场可以相互作用，”徐说。但是这种粒子对可以通过 RHIC 的一系列过程产生，包括通过“虚拟”光子，一种短暂存在并带有有效质量的光子状态。为确保物质-反物质对来自真实光子，科学家必须证明“虚拟”光子的贡献不会改变实验结果。为此，STAR 科学家分析了每个电子相对于其伙伴正电子的角度分布模式。对于由真实光子与虚拟光子相互作用产生的对，这些模式不同。 “我们还测量了系统的所有能量、质量分布和量子数。它们与真实光子会发生什么的理论计算一致，”布鲁克海文实验室的 Goldhaber 研究员 Daniel Brandenburg 说，他分析了 STAR 数据这个发现。其他科学家已经尝试使用强大的激光——聚焦的强光光束——通过光的碰撞来制造正负电子对。但勃兰登堡说，这些强光束中的单个光子还没有足够的能量。 1997 年 SLAC 国家加速器实验室的一项实验通过使用非线性过程取得了成功。那里的科学家首先必须通过与强大的电子束碰撞来提高一束激光束中光子的能量。在另一个激光产生的巨大电磁场中，增强的光子与多个光子同时碰撞，产生物质和反物质。\n勃兰登堡说：“我们的结果提供了明确的证据，表明光的碰撞可以直接、一步地产生物质 - 反物质对，正如 Breit 和 Wheeler 最初预测的那样。” “得益于 RHIC 的高能重离子束和 STAR 探测器的大接受度和精确测量，我们能够以高统计量分析所有运动学分布，以确定实验结果确实与真实的光子碰撞一致。” STAR 能够测量在这些事件中几乎背靠背产生的电子和正电子的微小偏转，这也为物理学家提供了一种研究轻粒子如何与加速离子产生的强大磁场相互作用的方法。 “在 RHIC 的一个光束中，围绕金离子的光子云正射入由另一个金光束中的加速离子产生的强圆形磁场，”山东大学的长期 STAR 合作者 Chi Yang 说。整个职业生涯都在研究 RHIC 各种工艺产生的正负电子对。 “观察出来的粒子分布告诉我们偏振光如何与磁场相互作用。” Werner Heisenberg 和 Hans Heinrich Euler 在 1936 年，以及 John Toll 在 1950 年代预测，真空可以被强大的磁场极化，并且这种极化的真空应该根据光子极化偏转光子的路径。 Toll 在他的论文中还详细说明了磁场对光的吸收如何取决于偏振及其与真空中光的折射率的关系。这种偏振相关的偏转或双折射已在许多类型的晶体中观察到。最近还有一份报告称，来自中子星的光以这种方式弯曲，大概是因为它与恒星磁场的相互作用。但是没有地球上的实验在真空中检测到双折射。在 RHIC，科学家们测量了光的偏振如何影响光是否被磁场“吸收”。杨解释说，这类似于偏光太阳镜在某些光线与镜片的偏振不匹配时阻止它们通过的方式。就太阳镜而言，除了看到较少的光线通过之外，原则上您还可以测量镜片材料在吸收被阻挡光线的能量时的温度升高情况。在 RHIC，吸收的光能是产生电子-正电子对的原因。 “当我们查看 RHIC 光子相互作用产生的产物时，我们看到产物的角分布取决于光的偏振角。这表明光的吸收（或通过）取决于其偏振，”杨说。\n这是第一个基于地球的实验观察，即偏振影响光与真空中的相互作用——1936 年预测的真空双折射。“这两个发现都建立在 20 世纪初一些伟大物理学家的预测之上， ”莱斯大学教授 Frank Geurts 说，他的团队建造并操作了 STAR 最先进的“飞行时间”探测器组件，这是此次测量所必需的。 “它们基于最近才通过我们在 RHIC 开发的技术和分析技术实现的基本测量。”更多信息：J. Adam 等人，从线性​​偏振光子碰撞中测量 e+e− 动量和角分布，物理评论快报（2021 年）。 DOI：10.1103/PhysRevLett.127.052302", "note_en": "Scientists studying particle collisions at the Relativistic Heavy Ion Collider (RHIC)—a U.S. Department of Energy Office of Science user facility for nuclear physics research at DOE&#39;s Brookhaven National Laboratory—have produced definitive evidence for two physics phenomena predicted more than 80 years ago. The results were derived from a detailed analysis of more than 6,000 pairs of electrons and positrons produced in glancing particle collisions at RHIC and are published in  Physical Review Letters.    The primary finding is that pairs of electrons and positrons—particles of matter and antimatter—can be created directly by colliding very  , which are quantum &#34;packets&#34; of  . This conversion of energetic light into matter is a direct consequence of Einstein&#39;s famous E=mc2 equation, which states that energy and matter (or mass) are interchangeable. Nuclear reactions in the sun and at nuclear power plants regularly convert matter into energy. Now scientists have converted light energy directly into matter in a single step.\n  The second result shows that the path of light traveling through a magnetic field in a vacuum bends differently depending on how that light is polarized. Such polarization-dependent deflection (known as birefringence) occurs when light travels through certain materials. (This effect is similar to the way wavelength-dependent deflection splits white light into rainbows.) But this is the first demonstration of polarization-dependent light-bending in a vacuum.\n  Both results depend on the ability of RHIC&#39;s STAR detector—the Solenoid Tracker at RHIC—to measure the angular distribution of particles produced in glancing collisions of gold ions moving at nearly the speed of light.\n    Such capabilities didn&#39;t exist when physicists Gregory Breit and John A. Wheeler first described the hypothetical possibility of colliding light particles to create pairs of electrons and their antimatter counterparts, known as positrons, in 1934.\n  &#34;In their paper, Breit and Wheeler already realized this is almost impossible to do,&#34; said Brookhaven Lab physicist Zhangbu Xu, a member of RHIC&#39;s STAR Collaboration. &#34;Lasers didn&#39;t even exist yet! But Breit and Wheeler proposed an alternative: accelerating heavy ions. And their alternative is exactly what we are doing at RHIC.&#34;\n  An ion is essentially a naked atom, stripped of its electrons. A gold ion, with 79 protons, carries a powerful positive charge. Accelerating such a charged heavy ion to very   generates a powerful magnetic field that spirals around the speeding particle as it travels—like current flowing through a wire.\n    &#34;If the speed is high enough, the strength of the circular magnetic field can be equal to the strength of the perpendicular electric field,&#34; Xu said. And that arrangement of perpendicular electric and magnetic fields of equal strength is exactly what a photon is—a quantized &#34;particle&#34; of light. &#34;So, when the ions are moving close to the speed of light, there are a bunch of photons surrounding the gold nucleus, traveling with it like a cloud.&#34;\n   At RHIC, scientists accelerate gold ions to 99.995% of the speed of light in two accelerator rings.\n  &#34;We have two clouds of photons moving in opposite directions with enough energy and intensity that when the two ions graze past each other without colliding, those photon fields can interact,&#34; Xu said.\n    But such particle pairs can be created by a range of processes at RHIC, including through &#34;virtual&#34; photons, a state of photon that exists briefly and carries an effective mass. To be sure the matter-antimatter pairs were coming from real photons, scientists have to demonstrate that the contribution of &#34;virtual&#34; photons does not change the outcome of the experiment.\n  To do that, the STAR scientists analyzed the angular distribution patterns of each electron relative to its partner positron. These patterns differ for pairs produced by real photon interactions versus virtual photons.\n  &#34;We also measured all the energy, mass distributions, and quantum numbers of the systems. They are consistent with theory calculations for what would happen with real photons,&#34; said Daniel Brandenburg, a Goldhaber Fellow at Brookhaven Lab, who analyzed the STAR data on this discovery.\n  Other scientists have tried to create electron-positron pairs from collisions of light using powerful lasers—focused beams of intense light. But the individual photons within those intense beams don&#39;t have enough energy yet, Brandenburg said.\n  One experiment at the SLAC National Accelerator Laboratory in 1997 succeeded by using a nonlinear process. Scientists there first had to boost the energy of the photons in one laser beam by colliding it with a powerful electron beam. Collisions of the boosted photons with multiple photons simultaneously in an enormous electromagnetic field created by another laser produced matter and antimatter.\n  &#34;Our results provide clear evidence of direct, one-step creation of matter-antimatter pairs from collisions of light as originally predicted by Breit and Wheeler,&#34; Brandenburg said. &#34;Thanks to RHIC&#39;s high-energy heavy ion beam and the STAR detector&#39;s large acceptance and precision measurements, we are able to analyze all the kinematic distributions with high statistics to determine that the experimental results are indeed consistent with real photon collisions.&#34;\n     STAR&#39;s ability to measure the tiny deflections of electrons and positrons produced almost back-to-back in these events also gave the physicists a way to study how light particles interact with the powerful magnetic fields generated by the accelerated ions.\n  &#34;The cloud of photons surrounding the gold ions in one of RHIC&#39;s beams is shooting into the strong circular magnetic field produced by the accelerated ions in the other gold beam,&#34; said Chi Yang, a long-time STAR collaborator from Shandong University who spent his entire career studying electron-positron pairs produced from various processes at RHIC. &#34;Looking at the distribution of particles that come out tells us how polarized light interacts with the magnetic field.&#34;\n  Werner Heisenberg and Hans Heinrich Euler in 1936, and John Toll in the 1950s, predicted that a vacuum of empty space could be polarized by a powerful magnetic field and that such a polarized vacuum should deflect the paths of photons depending on photon polarization. Toll, in his thesis, also detailed how light absorption by a magnetic field depends on polarization and its connection to the refractive index of light in a vacuum. This polarization-dependent deflection, or birefringence, has been observed in many types of crystals. There was also a recent report of the light coming from a neutron star bending this way, presumably because of its interactions with the star&#39;s magnetic field. But no Earth-based experiment has detected birefringence in a vacuum.\n  At RHIC, the scientists measured how the polarization of the light affected whether the light was &#34;absorbed&#34; by the magnetic field.\n  This is similar to the way polarized sunglasses block certain rays from passing through if they don&#39;t match the polarization of the lenses, Yang explained. In the case of the sunglasses, in addition to seeing less light get through, you could, in principle, measure an increase in the temperature of the lens material as it absorbs the energy of the blocked light. At RHIC, the absorbed light energy is what creates the electron-positron pairs.\n  &#34;When we look at the products produced by photon-  interactions at RHIC, we see that the angular distribution of the products depends on the angle of the polarization of the light. This indicates that the absorption (or passing) of light depends on its polarization,&#34; Yang said.\n  This is the first Earth-based experimental observation that polarization affects the interactions of light with the   in the vacuum—the vacuum birefringence predicted in 1936.\n  &#34;Both of these findings build on predictions made by some of the great physicists in the early 20th century,&#34; said Frank Geurts, a professor at Rice University, whose team built and operated the state-of-the-art &#34;Time-of-Flight&#34; detector components of STAR that were necessary for this measurement. &#34;They are based on fundamental measurements made possible only recently with the technologies and analysis techniques we have developed at RHIC.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tJ. Adam et al, Measurement of e+e− Momentum and Angular Distributions from Linearly Polarized Photon Collisions,  Physical Review Letters (2021).  DOI: 10.1103/PhysRevLett.127.052302", "posttime": "2021-08-03 04:02:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "物质,light,光子", "title": "光的碰撞从纯能量中产生物质/反物质", "title_en": "Collisions of light produce matter/antimatter from pure energy", "transed": 1, "url": "https://phys.org/news/2021-07-collisions-matterantimatter-pure-energy.html", "via": "", "real_tags": ["物质", "light", "光子"]}, {"category": "", "categoryclass": "", "imagename": "7440306b63def19438f5cbfb7b74c0e3.jpg", "infoid": 1071274, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "去年，亚马逊推出了新的生物识别掌纹扫描仪 Amazon One，因此顾客可以通过在其中一台扫描仪上挥动掌纹来支付某些商店的商品费用。到 2 月，该公司将其手掌扫描仪扩展到西雅图的其他亚马逊杂货店、书籍和四星级商店。此后，亚马逊将其生物识别扫描技术扩展到了美国各地的商店，包括纽约、新泽西、马里兰和德克萨斯。这家零售和云巨头表示，其手掌扫描硬件“可以捕捉您手掌的细微特征——包括线条和脊线等表面区域细节以及静脉图案等皮下特征——以创建您的手掌特征”，然后将其存储在当您在其中一家商店时，用于确认您的身份。亚马逊究竟是如何处理这些数据的？你的掌纹本身可能没有多大作用——尽管亚马逊表示它使用匿名掌纹数据的未指定“子集”来改进技术。但是，通过将其链接到您的亚马逊账户，亚马逊可以使用它收集的数据（例如购物历史），随着时间的推移向您定位广告、优惠和推荐。亚马逊还表示，它会无限期地存储掌上数据，除非您选择在没有未完成交易时删除数据，或者您两年不使用该功能。虽然在大流行期间以非接触方式扫描您的掌纹以支付商品的想法似乎是一个新颖的想法，但鉴于亚马逊过去在开发生物识别技术方面的努力，这一想法值得谨慎和怀疑。亚马逊有争议的面部识别技术，它历来出售给警察和执法部门，成为诉讼的主题，指控该公司违反了禁止未经许可使用个人生物识别数据的州法律。 “科幻小说的反乌托邦未来就是现在。亚马逊要求人们出售自己的尸体令人震惊，但更糟糕的是人们以如此低的价格出售，”总部位于纽约的监控技术监督项目执行董事阿尔伯特·福克斯·卡恩 (Albert Fox Cahn) 在一封电子邮件中说。到 TechCrunch。\n“生物识别数据是公司和政府可以永久跟踪我们的唯一方式之一。你可以改变你的名字，你可以改变你的社会安全号码，但你不能改变你的掌纹。我们越是使这些策略正常化，他们就越难逃脱。如果我们不试着在这里排队，我很担心我们的未来会是什么样子，”卡恩说。", "note_en": "Last year, Amazon introduced its new biometric palm print scanners,  Amazon One, so customers can pay for goods in some stores by waving their palm prints over one of these scanners. By February, the company  expanded its palm scanners to other Amazon grocery, book and 4-star stores across Seattle.\n Amazon has  since expanded its biometric scanning technology to its stores across the U.S., including New York, New Jersey, Maryland, and Texas.\n The retail and cloud giant says its palm scanning hardware “captures the minute characteristics of your palm — both surface-area details like lines and ridges as well as subcutaneous features such as vein patterns — to create your palm signature,” which is then stored in the cloud and used to confirm your identity when you’re in one of its stores.\n  What’s Amazon doing with this data exactly? Your palm print on its own might not do much — though Amazon  says it uses an unspecified “subset” of anonymous palm data to improve the technology. But by linking it to your Amazon account, Amazon can  use the data it collects, like shopping history, to target ads, offers, and recommendations to you over time.\n Amazon also says it stores palm data indefinitely, unless you choose to delete the data once there are no outstanding transactions left, or if you don’t use the feature for two years.\n While the idea of contactlessly scanning your palm print to pay for goods during a pandemic might seem like a novel idea, it’s one to be met with caution and skepticism given Amazon’s past efforts in developing biometric technology. Amazon’s controversial facial recognition technology, which it historically  sold to police and law enforcement, was the subject of lawsuits that allege the company violated state laws that  bar the use of personal biometric data without permission.\n “The dystopian future of science fiction is now. It’s horrifying that Amazon is asking people to sell their bodies, but it’s even worse that people are doing it for such a low price,” said Albert Fox Cahn, the executive director of the New York-based Surveillance Technology Oversight Project, in an email to TechCrunch.\n “Biometric data is one of the only ways that companies and governments can track us permanently. You can change your name, you can change your Social Security number, but you can’t change your palm print. The more we normalize these tactics, the harder they will be coming to escape. If we don’t try to line in the sand here, I am very fearful what our future will look like,” said Cahn.", "posttime": "2021-08-03 03:20:02", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,生物,palm,数据", "title": "亚马逊将为您的掌纹生物识别支付 10 美元的信用额度", "title_en": "\n\t\t\t\tAmazon will pay you $10 in credit for your palm print biometrics\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/amazon-credit-palm-biometrics/", "via": "", "real_tags": ["amazon", "亚马逊", "生物", "palm", "数据"]}, {"category": "", "categoryclass": "", "imagename": "1ad667cf6724dfe12c447a3638dca2e7.jpg", "infoid": 1071273, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MGA Thermal 希望通过鞋盒大小的热能存储块帮助公用事业公司从化石燃料过渡到可再生能源。该公司表示，一叠 1,000 块积木大约相当于一辆小型汽车的大小，可以储存足够的能量为 27 个家庭供电 24 小时。这使公用事业供应商能够存储大量能源，并准备好在天气条件不适合产生太阳能或风能的情况下进行调度。模块化块还可以更轻松地将燃煤电厂等基础设施转换为电网规模的能源存储。 MGA Thermal 今天宣布已筹集了 800 万澳元（约合 590 万美元），使其迄今为止的总资金达到 900 万澳元。这轮融资由澳大利亚国家科学机构创立的风险投资公司 Main Sequence 领投，该公司最近推出了 2.5 亿澳元的新基金。 Alberts Impact Capital、新西兰气候风险投资基金、The Melt 和回归投资者 CP Ventures 以及 Chris Sang、Emlyn Scott 和 Glenn Butcher 等天使投资人参与了此次投资。 MGA Thermal 总部位于澳大利亚纽卡斯尔，于 2019 年 4 月由 Erich Kisi 和 Alexander Post 在纽卡斯尔大学研究和开发混相间隙合金技术近十年后成立。当被要求用外行的术语解释 MGA 技术时，Kisi 使用了一个很好的比喻。 MGA Thermal 的块“主要包含金属颗粒，当加热时会熔化，嵌入惰性基体材料中。将块想象成一个在微波炉中加热的巧克力松饼。松饼由蛋糕成分和巧克力片组成，蛋糕成分在加热时保持形状，巧克力片会融化，”他告诉 TechCrunch。 “融化巧克力片的能量被储存起来，当你咬松饼时会灼伤你的嘴，”他补充道。 “熔化能量比仅仅加热东西更强烈，熔化能量集中在熔化温度附近，因此能量可以以一致的方式释放。”存储在 MGA Thermal 块中的能量可用于加热水，从而为蒸汽轮机和发电机提供动力。在这种情况下，块设计有用于泵送和煮沸水的内部管道，或与热交换器相互作用。 Kisi 表示，MGA Thermal 的模块使老化的热电计划能够继续使用可再生能源运行，而这些可再生能源通常会在因阳光过多或大风导致过热等情况下被关闭。其他热能解决方案包括在隔热容器中将块状或颗粒状的低成本固体材料加热到高温。 Kisi 说，但是这些材料中的许多不擅长移动热能并且有温度限制。这意味着热能在排放时温度会降低，从而降低其效率。\n另一种储存热能的方法涉及由可再生能源加热并储存在热罐中的熔盐。然后将热盐泵送通过热交换器以产生蒸汽，而较冷（但仍处于熔融状态）的盐将返回“冷”罐。 “这些系统广泛用于聚集太阳能热能，但在其他地方几乎没有使用，”Kisi 说。 “这主要是因为管道泵和加热器的基础设施成本很高，而且浪费了大量电力以防止盐结冰。” MGA Thermal 正在新南威尔士州建立一家制造工厂，以将其区块的生产规模扩大到商业水平，并计划在未来 12 个月内将其团队扩大一倍，以便每月生产数十万个区块。目前，它还与瑞士公司 E2S Power ASG 和总部位于美国的 Peregrine Turbine Technologies 等合作伙伴合作，在澳大利亚、欧洲和北美部署其技术。例如，E2S Power AG 将使用 MGA Thermal 的技术来重新利用欧洲退役和活跃的燃煤热电厂。虽然 MGA Thermal 的技术有许多工业用例，例如转换发电站、建立离网存储以及为偏远社区和商业空间供电，但它还可以帮助消费者减少化石燃料的消耗。例如，家庭可以使用 MGA 块来存储屋顶太阳能电池板或小型风力涡轮机产生的多余能量。然后，这种能源可用于为房屋供暖 “全世界估计有 30 亿人通过燃烧燃料为房屋供暖，”Kisi 说。 “这是大量的二氧化碳，尤其是在非常寒冷的气候中。” Main Sequence 合伙人 Martin Duursma 在一份声明中说：“我们新基金的核心重点是发现科学发现，并帮助将它们转化为真实的、有形的技术，以便我们能够扭转气候影响。 Erich Kisi 和 Alexander Post 令人印象深刻的深厚研究背景、他们的专家团队和创新技术正在为电网规模的储能铺平道路，并提高全球可再生能源未来的能力。”", "note_en": "MGA Thermal wants to help utility companies transition from fossil fuels to renewable energy sources with shoebox-sized thermal energy storage blocks. The company says a stack of 1,000 blocks is about the size of a small car and can store enough energy to power 27 homes for 24 hours. This gives utility providers the ability to store large amounts of energy and have it ready to dispatch even when weather conditions aren’t ideal for generating solar or wind power. The modular blocks also make it easier to convert infrastructure, like coal-fired power plants, into grid-scale energy storage.\n MGA Thermal announced today it has raised $8 million AUD (about $5.9 million USD), bring its total funding so far to $9 million AUD. The round was led by Main Sequence, a venture firm founded by Australia’s national science agency that  recently launched a new $250 million AUD fund. Alberts Impact Capital, New Zealand’s Climate Venture Capital Fund, The Melt and returning investor CP Ventures participated, along with angel investors like Chris Sang, Emlyn Scott and Glenn Butcher.\n   Based in Newcastle, Australia, MGA Thermal was founded in April 2019 by Erich Kisi and Alexander Post after nearly a decade spent researching and developing miscibility gap alloys technology at the University of Newcastle. When asked to explain MGA tech in layperson’s terms, Kisi used a delicious analogy.\n MGA Thermal’s blocks “essentially comprise metal particles that melt when heated embedded in an inert matrix material. Think of a block as being like a choc-chip muffin heated in a microwave. The muffin consists of a cake component, which holds everything in shape when heated, and the choc chips, which melt,” he told TechCrunch.\n “The energy that goes into melting the choc chips is stored and can burn your mouth when you bite into the muffin,” he added. “Melting energy is more intense than merely heating something up and that melting energy is concentrated near the melting temperature so energy can be released in a consistent way.”\n  Energy stored in MGA Thermal’s blocks can be used to heat water to power steam turbines and generators. In this scenario, blocks are designed with internal tubing for pumping and boiling water, or interact with a heat exchanger. Kisi said MGA Thermal’s blocks enable aging thermal power plans to continue running on renewable energy that would usually be switched off in situations like overheating caused by too much sun or high winds.\n Other thermal energy solutions include heating low-cost solid materials in blocks or granules to high temperatures in an insulated container. But many of these materials aren’t good at moving thermal energy around and have temperature limitations, Kisi said. This means thermal energy decreases in temperature as it is discharged, making it less effective.\n Another method for storing thermal energy involves molten salts that are heated by a renewable energy source and stored in a hot tank. The hot salt is then pumped through a heat exchanger to make steam, while colder (but still molten) salt is returned to a “cold” tank.\n “These systems are widely used in concentrating solar thermal energy but have found little use elsewhere,” Kisi said. “That’s mostly because there is a large infrastructure cost for piping pumps and heaters, and a large amount of power is wasted keeping the salt from freezing.”\n MGA Thermal is establishing a manufacturing plant in New South Wales to scale production of its blocks to commercial levels and plans to double its team over the next 12 months so it can make hundreds of thousands of blocks each month. It is also currently working with partners like Swiss company E2S Power ASG and US-based Peregrine Turbine Technologies to deploy its tech in Australia, Europe and North America. For example, E2S Power AG will use MGA Thermal’s tech to repurpose retired and active coal-fired thermal plants in Europe.\n While MGA Thermal’s tech has many industrial use cases, like converting power stations, building off-grid storage and supplying power to remote communities and commercial spaces, it can also help consumers consume less fossil fuel. For example, MGA blocks can be used by households to store excess energy generated from rooftop solar panels or small wind turbines. Then that energy can be used to heat homes\n “Around the world an estimated three billion people heat their homes by burning fuel,” said Kisi. “That’s a lot of CO2, especially in very cold climates.”\n In a statement, Main Sequence partner Martin Duursma said, “A core focus of our new fund is uncovering the scientific discoveries, and helping to turn them into real, tangible technologies so we can reverse our climate impact. Erich Kisi and Alexander Post’s impressive deep research backgrounds, their expert team and innovative technology are paving the way for grid-scale energy storage and boosting the capability of a renewaBle energy future globally.”", "posttime": "2021-08-03 03:19:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "sequence,thermal,加热", "title": "MGA Thermal 为其模块化储能模块筹集了 800 万美元，由 Main Sequence 牵头", "title_en": "\n\t\t\t\tMGA Thermal raises $8M AUD led by Main Sequence for its modular energy storage blocks\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/mga-thermal-raises-8m-aud-led-by-main-sequence-for-its-modular-energy-storage-blocks/", "via": "", "real_tags": ["sequence", "thermal", "加热"]}, {"category": "", "categoryclass": "", "imagename": "10c0fdd3283bf78810441e80ee3742ef.jpg", "infoid": 1071272, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Planted 于 2019 年作为瑞士研究型大学苏黎世联邦理工学院的衍生产品出现，在那里创始人开发了将植物蛋白和水挤出成类似于真肉的纤维结构的原始技术。从那时起，该公司开始多样化其蛋白质来源，在混合物中加入燕麦和向日葵，并开发了猪肉和烤肉串替代产品。随着时间的推移，这个过程也得到了改进。 “我们添加了发酵/生物技术技术来增强口感和质地，”首席执行官兼联合创始人 Christoph Jenny 在给 TechCrunch 的电子邮件中写道。 “意思是 1）我们可以创造没有形式限制的结构，2）可以增加更广泛的口味。”最新的进展是炸肉排，它当然是一种裹面包屑和油炸的薄肉片，在世界各地都很受欢迎，尤其是在该公司的核心市场德国、奥地利和瑞士。珍妮指出，Planted 的炸肉排是整块生产的，而不是由较小的部分压在一起。 “味道和质地受益于发酵方法，这使得风味特征令人垂涎欲滴，质地超级多汁，”他说，当然，我们必须对其进行测试才能确定。预计炸肉排将在第三季度首次亮相。这是几个计划的“整体”或“主要”切割中的第一个，可以像任何其他肉块一样准备更大的块——该团队表示，他们的产品不需要特殊的准备或添加剂，可以作为 1:1 的替代品放入大多数食谱。现在，大幅削减正在离开实验室并进入消费者测试以进行口味调整并最终扩展。该轮融资来自“Vorwerk Ventures、Gullspång Re:food、Movendo Capital、Good Seed Ventures、Joyance、ACE &amp; Company（SFG 战略）和 Be8 Ventures”，被描述为 3 月份 CHF 17M A 系列的后续。毫无疑问，对替代蛋白质的需求激增和该领域日益激烈的竞争促使 Planted 的投资者选择更积极的增长和发展战略。该公司计划在第三季度和第四季度进入几个新市场，但由于 COVID-19 旅行限制，美国仍然是一个问号。 Jenny 说他们正在做准备，以便只要有可能就可以采取行动，但目前 Planted 专注于欧洲市场。", "note_en": "Planted  appeared in 2019 as a spinoff from Swiss research university ETH Zurich, where the founders developed the original technique of extruding plant proteins and water into fibrous structures similar to real meat’s. Since then the company has diversified its protein sources, adding oat and sunflower to the mix, and developed pulled pork and kebab alternative products as well.\n Over time the process has improved as well. “We added fermentation/biotech technologies to enhance taste and texture,” wrote CEO and co-founder Christoph Jenny in an email to TechCrunch. “Meaning 1) we can create structures without form limitation and 2) can add a broader taste profile.”\n  The latest advance is schnitzel, which is of course a breaded and fried piece of pounded-thin meat style popular around the world, but especially in the company’s core markets of Germany, Austria, and Switzerland. Jenny noted that Planted’s schnitzel is produced as one piece, not pressed together from smaller bits. “The taste and texture benefit from fermentation approach, that makes the flavor profile mouth watering and the texture super juicy,” he said, though of course we will have to test it to be sure. Expect schnitzel to debut in Q3.\n It’s the first of several planned “whole” or “prime” cuts, larger pieces that can be prepared like any other piece of meat — the team says their products require no special preparation or additives and can be dropped in as 1:1 replacements in most recipes. Right now the big cuts are leaving the lab and entering consumer testing for taste tuning and eventually scaling.\n The funding round came from “Vorwerk Ventures, Gullspång Re:food, Movendo Capital, Good Seed Ventures, Joyance, ACE &amp; Company (SFG strategy) and Be8 Ventures,” and was described as a follow-on to March’s  CHF 17M series A. No doubt the exploding demand for alternative proteins and growing competition in the space has spurred Planted’s investors to opt for more aggressive growth and development strategies.\n The company plans to enter several new markets over Q3 and Q4, but the U.S. is still a question mark due to COVID-19 restrictions on travel. Jenny said they are preparing so that they can make that move whenever it becomes possible, but for now Planted is focused on the European market.", "posttime": "2021-08-03 03:19:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "植物性,growing,planted", "title": "Planted 又筹集了 1800 万美元，以扩大其不断增长的植物性肉类帝国（并添加炸肉排）", "title_en": "\n\t\t\t\tPlanted raises another $18M to expand its growing plant-based meat empire (and add schnitzel)\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/08/02/planted-raises-another-18m-to-expand-its-growing-plant-based-meat-empire-and-add-schnitzel/", "via": "", "real_tags": ["植物性", "growing", "planted"]}, {"category": "", "categoryclass": "", "imagename": "52677d6448d6d2a1a912cf973dc1f2a6.jpg", "infoid": 1071271, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当微软上个月推出其 Windows 365 云 PC 桌面即服务产品时，官员们表示他们将在服务普遍可用的那天，即 8 月 2 日公布定价。正如承诺的那样，该公司已经公布了定价，并且它的范围从最低端 SKU 的每个用户每月 20 美元到最昂贵的每个用户每月 162 美元。 Windows 365 是 Microsoft 最新的远程桌面产品，它建立在 Azure 虚拟桌面之上并对其进行了补充。 Windows 365 将允许用户将他们的 Windows 10 或（一旦它在今年秋季晚些时候推出）、Windows 11 桌面、应用程序、工具、数据和设置带到他们的个人和工作设备，包括 PC、Mac、iPad、Linux 和 Android设备，通过本机远程桌面应用程序或 Web 浏览器。 7 月 15 日，微软官员（意外地？）透露了少数 Windows 365 SKU 之一的定价，每位用户每月 31 美元。今天是所有定价公开的日子。定价基于客户能够在其“云 PC”虚拟机中访问的虚拟内核、RAM 和存储的数量。 Windows 365 有两个版本：Windows 365 商业版和 Windows 365 企业版。 Windows 365 商业版 SKU 的上限为每个组织 300 个用户。每位用户每月 20 美元的商业价格适用于单个虚拟核心、2 GB RAM 和 64 GB 存储——并且需要 Windows 混合权益。 （混合权益是 Microsoft 的自带许可模式，它允许客户将现有（或新）许可证应用于产品成本。）如果没有混合权益折扣，则相同的 SKU 为每位用户每月 24 美元。在高端，具有 8 个虚拟核心、32 GB RAM 和 512 GB 存储空间的商业 SKU 每位用户每月花费 162 美元——或者使用 Windows 混合权益为每位用户每月花费 158 美元。 Windows 365 的企业 SKU 定价相似。单个虚拟核心、2 GB RAM 和 64 GV 存储空间的价格为每位用户每月 20 美元。在高端，8 个虚拟核心、32 GB 内存、512 GB 存储 SKU 的价格为每位用户每月 158 美元。 Windows 365/Cloud PC 将不仅支持 Microsoft 应用程序；该服务还将允许用户远程登录可在 Windows 10 或 11 上运行的任何应用程序。说。并且由于应用程序是虚拟运行的，因此无论他们使用的设备规格如何，用户都可以访问高计算应用程序，例如视频编辑软件或图形设计程序。为了使用 Windows 365 商业版，客户只需拥有 Microsoft 365订阅。要使用 Windows 365 Enterprise，用户需要满足以下要求： 更新：我看到很多人将 Windows 365 的价格与购买具有可比规格的新 PC 的成本进行比较，并嘲笑 Windows 365 的成本。实际上，正如微软合作伙伴 Nerdio 在这篇文章中所建议的那样，更恰当的比较可能是 Azure 虚拟桌面（用户为使用的 Azure 服务付费）和 Windows 365/云 PC。相比之下，Windows 365 可以为一些客户省钱。但是，是的，这些 Windows 365 价格相当令人震惊。需要记住的两件事：微软可能会为那些有兴趣批量购买的人提供这些估计零售价的大幅折扣。其次：虚拟化桌面绝对不适合所有人，尽管它们对某些特定用例有意义。更新 2：对 IT 专业人员的警告。从 8 月 14 日起，微软将提供 Windows 365 作为一种自助服务类型，这意味着用户可以选择订阅而无需集中批准——除非管理员使用 PowerShell 脚本和/或其他方式阻止订阅。 Microsoft 提供为期两个月的免费 Windows 365 Basic、Standard 或 Premium 试用版。免费试用期结束后，订阅会自动转换为付费订阅，除非用户采取行动阻止订阅。", "note_en": "When Microsoft unveiled its  Windows 365 Cloud PC desktop-as-a-service product last month, officials said they&#39;d release pricing on the day  the service became generally available, August 2. As promised, the company has published pricing, and it ranges from $20 per user per month for the lowest end SKU, to $162 per user per month for the most expensive one.    Windows 365 is Microsoft&#39;s newest remote-desktop offering, which builds on top of and complements Azure Virtual Desktop. Windows 365 will allow users to bring their Windows 10 or (once it&#39;s available later this fall), Windows 11 desktop, apps, tools, data, and settings to their personal and work devices, including PCs, Macs, iPads, Linux, and Android devices, via a native Remote Desktop application or web browser.    On July 15, Microsoft officials (accidentally?) revealed  pricing for one of the handful of Windows 365 SKUs at $31 per user per month. Today is the day all of the pricing goes public. Pricing is based on the number of virtual cores, RAM and storage a customer will be able to access in their &#34;Cloud PC&#34; virtual machine.    Windows 365 is available in two editions: Windows 365 Business and Windows 365 Enterprise. The  Windows 365 Business SKUs are capped at 300 users per organization. The $20 per user per month Business price is for a single virtual core, 2 GB of RAM and 64 GB of storage -- and requires the Windows Hybrid Benefit. (Hybrid Benefits are Microsoft&#39;s Bring-Your-Own license model, which allows customers to apply existing (or new) licenses toward the cost of a product.) Without the Hybrid Benefit discount, that same SKU is $24 per user per month. At the high end, the Business SKU with eight virtual cores, 32 GB of RAM and 512 GB of storage costs $162 per user per month --- or $158 per user per month with the Windows Hybrid Benefit.\n The  Enterprise SKUs for Windows 365 are priced similarly. A single virtual core, 2 GB of RAM and 64 GV of storage will go for $20 per user per month. At the high end, the 8 virtual core, 32 GB of RAM, 512 GB of storage SKU will go for $158 per user per month.\n Windows 365/Cloud PC won&#39;t only support Microsoft apps; the service also will allow users to remotely log into any app that can run on Windows 10 or 11. Software developers won&#39;t have to make any changes or modifications to their apps for them to work virtually with Windows 365/Cloud PC, officials have said. And because apps are running virtually, users will have access to high-compute apps like video editing software or graphic design programs regardless of the specs of the device they&#39;re using\n In order to use Windows 365 Business, customers need only have a Microsoft 365 subscription. To use Windows 365 Enterprise, users will need to meet the following requirements:\n  Update: I see lots of people comparing the price of Windows 365 to the cost of buying a new PC with comparable specs and laughing about the cost of Windows 365. Actually, a more apt comparison may be Azure Virtual Desktop (where users pay for Azure services consumed) and Windows 365/Cloud PC, as  suggested in this post by Microsoft partner Nerdio. In that comparison, Windows 365 could save some customers money.\n But, yes, these Windows 365 prices are rather shocking. Two things to remember: Microsoft is likely offering substantial discounts off these estimated retail prices for those interested in buying in volume. And secondly: Virtualized desktops are definitely NOT for everyone, though they make sense for some specific use cases.\n Update No. 2: A word of caution to IT pros. As of August 14, Microsoft will offer  Windows 365 as a self-service type of service, meaning users have the option to subscribe without centralized approval -- unless admins block this using PowerShell scripts and/or other means. Microsoft is offering free two-month trials of Windows 365 Basic, Standard or Premium. Once the free trial ends,  subscriptions automatically convert to paid unless users take action to stop this.", "posttime": "2021-08-03 03:06:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "microsoft,windows,微软,pc", "title": "微软的 Windows 365 云 PC 服务每个用户每月的费用从 20 美元到 162 美元不等", "title_en": "Microsoft's Windows 365 Cloud PC Service Will Range From $20 To $162 Per User Per Month", "transed": 1, "url": "https://www.zdnet.com/article/microsofts-windows-365-cloud-pc-service-will-range-from-20-to-162-per-user-per-month/", "via": "", "real_tags": ["microsoft", "windows", "微软", "pc"]}, {"category": "", "categoryclass": "", "imagename": "9630a45f23a11d31483858bf77502d0d.jpg", "infoid": 1071270, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "两个红色的东西藏在太阳系不应该存在的地方。由日本航天局 JAXA 的 Sunao Hasegawa 领导的科学家周一在《天体物理学杂志快报》上报道说，在火星和木星之间的小行星带中发现的两个物体似乎起源于海王星之外。这些发现有朝一日可能为早期太阳系中存在的混乱提供直接证据。 “如果这是真的，那将是一笔大买卖，”科罗拉多州西南研究所的行星科学家哈尔·莱维森 (Hal Levison) 说，他并未参与这项研究。今天地球的恒星附近相当稳定。但在 40 亿年前，木星和其他巨行星的轨道可能已经发生了变化，混乱统治着。这种行星之舞造成的重力破坏很可能将岩石和冰块扔得到处都是。 “这是非常有活力的，”哈佛大学太阳系演化专家卡琳·奥伯格说，他没有参与这项新研究。其中一些岩石落入火星和木星之间的缝隙中，成为小行星带。大多数材料被认为是相当相似的未形成行星的不活动岩石大块。它们的轨道大约是地球-太阳距离的 2.7 倍和 2.6 倍，正好位于小行星带内。大约 70 英里宽的 203 Pompeja 似乎在结构上完好无损，而只有 35 英里左右的 269 Justitia 可能是先前碰撞的碎片。两者都有稳定的圆形轨道，这意味着它们一定很久以前就已经进入这个空间了。\n两者也有不寻常的颜色。太阳系内部的物体往往反射更多的蓝光，因为它们没有有机物质——比如碳和甲烷——而太阳系外部的物体则更红，因为它们有很多有机物，也许是生命的基石地球。该论文的合著者、麻省理工学院的迈克尔·马塞特 (Michaël Marsset) 说：“为了拥有这些有机物，您最初需要在表面形成大量冰。” “所以它们一定是在非常寒冷的环境中形成的。然后冰的太阳辐射会产生那些复杂的有机物。”事实证明，这两块岩石非常红——比小行星带中看到的任何岩石都要红。虽然已经发现了其他红色小行星的初步迹象，但这两个似乎很特别。这一发现如果正确的话，将为早期太阳系中的行星迁移提供证据，特别是支持一种称为尼斯模型的想法，土星、天王星和海王星都向外移动，而木星稍微向内移动，历时数亿年.这会扰乱行星形成过程中遗留下来的富含有机物的小行星，让它们在太阳系周围嗡嗡作响。 “这是一个令人兴奋的发现，对生命起源有影响，”奥伯格博士说。今天这些遗留下来的天体大多被称为跨海王星天体，它们在海王星以外的柯伊伯带中运行。许多都是红色的，比如 Arrokoth，NASA 的新视野号任务在 2019 年近距离拍摄了这块岩石。 203 Pompeja 和 269 Justitia 似乎都与它们相匹配。未参与该论文的北亚利桑那大学行星科学家乔什·埃默里 (Josh Emery) 说：“人们一直在谈论来自柯伊伯带的部分小行星已经有一段时间了。”他说，这项研究“肯定向前迈出了一步”，以寻找支持该假设的证据。\n并非所有人都对此深信不疑。莱维森博士也没有参与该论文，他说物体在接近太阳时应该变得不那么红。即使在木星轨道上捕获的被称为特洛伊的小行星，被认为可能是跨海王星的物体，也不是这个红色的。 “这似乎与我们的模型不一致，”美国宇航局露西任务的负责人列维森博士说，该任务计划于 10 月发射以研究木星的特洛伊木马。 Marsset 博士同意，目前尚不清楚为什么它们会如此红，但这可能与它们被植入小行星带所需的时间有关。有些木马也可能是红色的，但还没有被发现。为了真正确认 203 Pompeja 和 269 Justitia 的起源，航天器可能需要访问它们。这样的任务有可能让我们一瞥外太阳系，但无需花费十年或更长时间飞到那里。 “你可以飞越这些奇怪的小行星中的一个，和一个更典型的小行星进行比较，”埃​​默里博士说。 “那将是一次非常引人注目的航天器任务。”", "note_en": "Two red things are hiding in a part of the solar system where they shouldn’t be.\n Scientists led by Sunao Hasegawa from JAXA, the Japanese space agency, reported in  The Astrophysical Journal Letters on Monday that two objects spotted in the asteroid belt between Mars and Jupiter appear to have originated beyond Neptune. The discoveries could one day provide direct evidence of the chaos that existed in the early solar system.\n “If true it would be a huge deal,” says Hal Levison, a planetary scientist at the Southwest Research Institute in Colorado, who was not involved in the research.\n Earth’s stellar neighborhood is fairly stable today. But 4 billion years ago, chaos reigned as the orbits of Jupiter and other giant planets beyond it may have shifted. The gravitational havoc caused by this planetary dance likely threw pieces of rock and ice all over the place.\n “It was very dynamic,” said Karin Öberg, an expert in solar system evolution from Harvard University who was not involved in the new study.\n Some of those rocks settled into the gap between Mars and Jupiter and became the asteroid belt. Most of the material is believed to be fairly similar hunks of inactive rock that failed to form planets.\n  They orbit at about 2.7 and 2.6 times the Earth-sun distance, well within the asteroid belt. 203 Pompeja, at about 70 miles across, appears to be structurally intact, whereas 269 Justitia, only 35 miles or so, is likely a fragment of a previous collision. Both have stable circular orbits, meaning they must have settled into this space long ago.\n Both also have an unusual color. Objects in the inner solar system tend to reflect more blue light because they are devoid of organic material — things like carbon and methane — whereas objects in the outer solar system are redder because they have a lot of organics, perhaps the building blocks of life on Earth.\n “In order to have these organics, you need to initially have a lot of ice at the surface,” said Michaël Marsset from the Massachusetts Institute of Technology, a co-author on the paper. “So they must have formed in a very cold environment. Then the solar irradiation of the ice creates those complex organics.”\n These two rocks, as it turns out, are extremely red — more red than anything else seen in the asteroid belt. While tentative hints of other red asteroids have been found, these two appear to be special.\n The finding, if correct, would offer evidence for planetary migration in the early solar system, particularly in support of an idea called  the Nice Model, with Saturn, Uranus and Neptune all moving outward, and Jupiter inward slightly, over a few hundred million years. This would have perturbed organic-laden asteroids leftover from the formation of the planets, sending them pinging around the solar system.\n “It’s an exciting discovery with implications for the origins of life,” Dr. Öberg said.\n Most of these leftover objects in the present day are known as trans-Neptunian objects and orbit in the Kuiper belt beyond Neptune. Many are red in color, like Arrokoth, the rock that NASA’s New Horizons mission  got a close-up of in 2019. 203 Pompeja and 269 Justitia both appear to match them.\n “People have been talking about some fraction of asteroids coming from the Kuiper belt for quite a while now,” said Josh Emery, a planetary scientist from Northern Arizona University who was not involved in the paper. He said the research “definitely takes a step” toward finding evidence to support that hypothesis.\n Not everyone is convinced just yet. Dr. Levison, who was also not involved in the paper, says objects should become less red as they approach the sun. Even captured asteroids in Jupiter’s orbit known as Trojans, thought to possibly be trans-Neptunian objects, aren’t this red. “It seems to be inconsistent with our models,” said Dr. Levison, who is the head of NASA’s  Lucy mission, which is scheduled to launch in October to study Jupiter’s Trojans.\n Dr. Marsset agrees that it’s not clear why they would be so red, but it is possibly related to how long it took them to become implanted into the asteroid belt. Some Trojans may also be as red, but haven’t been found yet.\n To truly confirm the origin of 203 Pompeja and 269 Justitia, a spacecraft would likely need to visit them. Such a mission could potentially offer a glimpse at the outer solar system, but without spending a decade or more to fly there.\n “You could flyby one of these strange asteroids, and a more typical asteroid for comparison,” Dr. Emery said. “That would be a really compelling spacecraft mission.”", "posttime": "2021-08-03 03:05:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "红色,objects,可能", "title": "在小行星带中发现的 2 个红色物体。他们不应该在那里。", "title_en": "2 Red Objects Found In the Asteroid Belt. They Shouldn't Be There.", "transed": 1, "url": "https://www.nytimes.com/2021/07/28/science/red-asteroids-belt.html", "via": "", "real_tags": ["红色", "objects", "可能"]}, {"category": "", "categoryclass": "", "imagename": "36c6bbfa0bf372785822f49cdc9193c2.jpeg", "infoid": 1071269, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "互联网和宠物有着悠久的关系。它始于臭名昭著的 Pets.com。虽然不幸的是，业务崩溃了，经济也崩溃了，但它确立了在线的存在。经济复苏了，对互联网的需求也比以前更强烈了。为了在线开展业务，我们过去常常购买服务器硬件进行运营。我们以尊重的方式命名它们——动物、龙、星球大战、葡萄酒或电影角色。就像我们的宠物一样，我们照顾它们并了解它们的所有怪癖。快进到今天，基础设施再次被宠物淹没。这一次，我们交换的是宠物照片，而不是宠物用品。突然间，我们可以使用大量这些服务器。我们再也不能用宠物来命名它们，我们也不太关心它们能为我们做什么。无论一个失败，还有另一个等待接受负载。关闭整个工厂以在传送带上进行维护工作是不可接受的。同样，如果对软件的某些部分进行维护，则软件作为一个整体无法使用也是无法容忍的。因此，简单的解决方案是将软件拆分为更小的、独立的服务。它是一组端点吗？属于支付团队权限的端点组合还是为多个团队服务的共享组件？数据仓库，迎合 API 和计费团队 在分布式系统中，您甚至不知道存在的计算机故障可能导致您自己的计算机无法使用。\n服务的定义体现在失败的定义上。软件模块的一个理想要求是它们应该是独立的并且不会失败而其他模块可能会失败，但实际上，大多数资源最终会级联/失败。一个理想的软件应该表现得几乎像一个人体。多个活动部件通过明确的通信合同独立运行，享有与软件所追求的相同程度的自由。失败的定义不是布尔值 Yes 或 No。相反，在某些东西被认为发生故障之前会有一段时间的性能下降。因此，为了使 KPI 最有效，应将它们作为一个整体来定义。示例：对于媒体流服务的 KPI，ProcessingLag 比 CPU 利用率更有效。以下是一些与服务类型相关的常见 KPI 示例。监控服务的关键性能指标的证明在于，最好的 KPI 和监控需要对故障进行最轻微的检查。但是，相反，它用于建立系统的其他损坏部分。代码与服务之间的一个公平区别是，服务只有在部署和运行时才有意义。因此，为继续驻留在 Github 中且从未部署过的软件建立服务级别目标将是徒劳的。同一服务的不同安装使用相同的 KPI，但具有不同的阈值。 KPI 允许将属于要观察的服务范围的所有组件和部件捆绑在一起。它使您不会有过分警告，这对实际健康状况几乎没有影响。\n这是一个示例：凌晨 3 点消耗 100% 的磁盘可能会或可能不会可操作，具体取决于其对服务 KPI 的影响。例如，如果它是一个注销服务，并且 KPI 显示 99.999% 的可用性，尽管磁盘故障，它可以等到早上。实际指标与服务及其健康状况的这种相关性允许做出最基本的决定；下一个冲刺应该是面向功能还是稳定性？可靠性不是战时反应；这是和平时期的准备。这种准备是以功能开发为代价的。如果一个服务在一个多月的时间里可以无误地处理 99.99% 的请求，并且在 20 毫秒内没有错误，那么它可以为新功能提供一点创造力，这总是存在降低可靠性数字的风险。相反，性能太差的服务必须在新功能之前加强现有部署。一旦思维过程在影响下从服务器和组件转移到服务，当与依赖信息结合时，它可以解锁巨大的收益。它允许快速做出决策，因为在发生影响的情况下，随叫随到的元帅可以与合适的团队接洽。当这 9 个按分钟计算时，上下游服务的快速检测可以将平均检测时间 (MTTD) 降低到个位数分钟以下。在人们意识到之前，讨论从 DevOps 与代码或基础设施与测试转移到“支付提供商 X 正在降级，让我们禁用 UPI 以支持或卡以防止结账失败。”\n这种能力提高了将新功能发布到产品中的敏捷性和信心。因此，下次当您看到 Kafka OfflinePartitionsCount 增加的警报时，只需通过询问哪些服务 KPI 受到影响以及影响程度来直接设置它们。在这种情况下，哪个主题的处理延迟增加了多少，最后，此警报会影响哪个服务的新鲜度？与实体业务相比，使软件业务如此成功的根本区别在于变化的速度。当您开始观察与消费者体验相关的每一个故障时，所有只是数据的东西都变成了可操作的知识。知识的力量和对早期未知事物的了解使我们能够自信而可靠地做出改变。只要产品不抱怨，您就不再关心底层组件的个性化。底层组件变成了牛，服务变成了你最关心的新宠物。这种对服务的无条件关怀是软件可靠性的关键！ Last9 是一个软件可靠性平台，允许您将软件视为服务优先。它鼓励您更多地关注服务 KPI，也称为服务水平指标 (SLI)，而不是分散为业务指标、性能指标或基础设施的单个指标。通过整体减少 MTTD 和警报疲劳，最终赢家是您的客户。我给你留下一个想象；下次您要在凌晨 3 点进行数据库更改时，想象一下能够在清楚了解该次要停机的所有影响有多大和影响的情况下执行迁移！", "note_en": "The Internet and Pets have an old relationship. It started with the infamous   Pets.com. While unfortunately, the business crashed, and so did the economy, it established that online was here to stay. The economy resurrected, and so did the need for the Internet, stronger than before.\n  To run a business online, we used to buy server hardware for operations. We named these with respect—animals, dragons, star wars, wines, or movie characters.  Just like our pets, we attended to them with care and understood all their quirks.\n Fast forward to today, Infrastructure  is overwhelmed with pets again. This time around, we are exchanging pet photos and not pet supplies. Suddenly, we have a flock of these servers at our disposal. No longer can we name them after pets, and we care less about the tricks they could do for us. No matter if one fails, there is another one waiting to entertain the load.\n   It is unacceptable for an entire factory to be shut for maintenance work on a conveyor belt. Likewise, it is intolerable for software as a whole to be unserviceable in the event of maintenance on a few parts of it. So the simple solution was to split the software into more minor, independent services.\n  Is it a group of  Endpoints? Combination of endpoints that fall under the purview of a payment team\n   Or shared components serving  multiple teams? A data warehouse, catering to the API and Billing teams\n    A  distributed system is  one in which the failure of a  computer you didn&#39;t even  know existed can render your own  computer unusable.\n The definition of a Service manifests from the definition of failure. An Ideal ask from a software module is that they should be independent and not fail while other modules may fail, but in reality, most resources end up cascading/failing together.\n   An ideal software should behave almost like a human body. Multiple moving parts are functioning independently with explicit communication contracts, enjoying the same  degree of freedom that a Software aspires.\n The definition of failure is not a boolean Yes or a No. Instead, there is a period of degraded performance before something is considered broken down. Therefore, for KPIs to be most effective, they should be defined for the Service as a whole.  Example: For KPIs of a media streaming service,  ProcessingLag is way more effective than  CPU utilization.\n Here’s an example of some common KPIs that are relevant based on the type of Service.\n  The testament of monitoring Key Performance Indicators of a Service lies in the fact that the best KPIs and monitoring require the slightest inspection on failures. But, instead, it is used to establish other broken parts of the system.\n A fair distinction between  code vs. service is that a service should only come to meaning when deployed and running. Thus, it would be futile to establish Service Level Objectives for a piece of software that continues to reside in Github and has never been deployed. Different  installations of the same service are served with the same KPIs but with different thresholds.\n   KPIs allow tying all components and parts that fall under the purview of a Service to be observed together. It allows you not to have throw-over-the-wall alerts, which have little or no bearing on the actual health.\n Here’s an  example: A disk consuming  100% at 3 AM may or may not be actionable depending on its impact on service KPI. For instance, if it’s a logout service and the KPI says  99.999% availability despite a disk failure, It can wait till the morning.\n Such correlation of actual metrics to Services and their health allows for the most fundamental decision to be made; Should the next sprint be towards features or stability?  Reliability is not a war-time reaction; it’s a peace-time preparation.\n This preparation comes at the cost of feature development. If a service has been serving 99.99% of requests without errors and within 20ms for over a month, it can afford a bit of creativity towards new features, which will always present a risk of bringing down the reliability numbers. On the contrary, a service performing too poorly must strengthen the existing deployments ahead of new features.\n    Once the thought process has moved away from Servers and Components to Service under the impact, it can unlock tremendous gains when coupled with dependency information.\n It allows speedy decision-making because the on-call marshal can engage the right team in case of an Impact.\n When these 9&#39;s are counted by the minute, quick detection of upstream and downstream services can bring down the Mean Time to Detect (MTTD) to under single-digit minutes.\n Before one realizes it, The discussion moves from DevOps vs. Code or Infra vs. Testing to  &#34;Payment provider X is degrading, let&#39;s disable UPI in favor or card to prevent checkout frustrations.&#34;\n This ability improves the agility and confidence of releasing new features into your product. So next time you see an alert that says Kafka OfflinePartitionsCount has increased, just set them straight by asking what service KPI is being impacted and by how much. In this case, what is the increase in processing  Lag for what topic, and lastly, will this alert impact what Service’s  freshness?\n  The fundamental difference that makes Software business so successful, compared with physical counterparts, is the speed of change.\n When you start observing every failure correlated with consumer experience, everything that was just data becomes actionable knowledge. The power of knowledge and knowing the earlier unknown allows us to make changes confidently and reliably. You stop caring about the individuality of the underlying components as long as the product isn’t complaining. The underlying  components become the cattle, and the  services become the new Pet that you tend to with your utmost care.  This unconditional care for services is the crux of software reliability!\n Last9 is a platform for Software reliability that allows you to view your software as Services-first. It encourages you to pay more attention to Service KPIs, also referred to as Service Level Indicators (SLIs), instead of individual metrics fragmented as business metrics, performance metrics, or Infrastructure. By overall reduction in MTTD and alert fatigue, the end winner is your customer.\n I leave you with an Imagination; Next time you are about to make a database change at 3 AM, imagine being able to perform the migration with a clear understanding of how much and where all the impact of that minor downtime will be!", "posttime": "2021-08-03 03:04:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "观察,observe,服务", "title": "观察服务；不是服务器", "title_en": "Observe a Service; Not a Server", "transed": 1, "url": "https://blog.last9.io/services-not-server-observability/", "via": "", "real_tags": ["观察", "observe", "服务"]}, {"category": "", "categoryclass": "", "imagename": "1bdd0419bc9746cad6b18131c00d3d21.png", "infoid": 1071268, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Heap 是一个数字洞察平台，可自动捕获 Web 和移动行为，例如页面查看、点击和点击。我们最近发布了 Effort Analysis，这是一种让 Heap 客户查看漏斗内每个步骤之间交互次数和秒数的中位数的方法。它的外观如下： 为了构建此功能，我们需要编写一个查询，该查询可以快速扫描超过 10 亿行的事件数据。但是当我们第一次开始研究这个功能时，扫描数据的时间太长了。幸运的是，我们找到了一种方法，可以将该功能的 p90 性能速度提高一倍。为此，我们必须解决 Postgres 规划器根据 Postgres 文档“不是很聪明”的情况。这个 Postgres 怪癖令人惊讶地阻止了现有索引支持仅索引扫描。这篇文章是关于导致我们的性能问题的怪癖以及我们用来实现 2 倍性能胜利的解决方法。首先，快速回顾一下仅索引扫描。索引是数据库中的辅助数据结构，查询规划器可以使用它来加快某些查询的速度。例如，user_id 列上的索引可以更快地查找特定 user_id。仅索引扫描是一种特殊的操作，在这种操作中，数据库可以仅使用索引中的信息来满足查询，而无需读取表的实际行。例如，堆上的一个典型索引包含一个事件的时间和执行该事件的用户的 user_id：给定这个表和索引，查询计划器将对像 SELECT user_id FROM events WHERE 这样的查询使用仅索引扫描time &gt; now() - &#39;7 days&#39;::interval 因为我们需要的唯一值 user_id 在索引中。对于类似 SELECT * FROM events WHERE time &gt; now() - &#39;7 days&#39;::interval 的稍微不同的查询，查询计划器不能使用仅索引扫描，因为我们需要不在此索引中的列。规划器可能 [1] 使用索引扫描代替。\n顾名思义，索引扫描会扫描索引以查找满足查询谓词的行。但是，它还从表本身读取数据页，以返回和/或对不在索引中的值执行计算。这个额外的步骤通常会使索引扫描比仅索引扫描慢。我们的许多客户每周记录超过 1 亿个事件，这意味着 90 天的漏斗需要扫描超过 10 亿行。结果，查询的 p90 大约为 20 秒，比我们最初启动时想要的要慢得多。这是支持 Effort Analysis 的初始查询的简化版本： 最初，支持 Effort Analysis 的查询不使用仅索引扫描。这让我们感到惊讶，因为我们有一个如下所示的索引： 这个索引没有产生仅索引扫描的原因是因为 Postgres 的一个令人惊讶的怪癖。这是发生的事情：虽然 data -&gt;&gt; &#39;type&#39; 在索引中，查询计划器认为它也需要在索引中包含数据，即使数据本身从未在查询中被引用，除了作为查询的一部分数据 -&gt;&gt; &#39;类型&#39; 表达式。如果这对计划者来说似乎不是一种聪明的工作方式，Postgres 文档同意您的看法：只要查询在列上使用函数或运算符，就会出现此问题。 （运算符只是函数的语法糖。[2]）如果您的查询引用 f(x)，则必须在索引中包含 f(x) 和 x 才能获得仅索引扫描。这不是一个随机的黑客攻击；这是 Postgres 文档中针对此问题的建议解决方法。然而，在我们的例子中，x 是数据，并且因为数据包含与事件相关的大部分数据（例如，类型、事件发生的页面 url 等），[3] 这种变通方法会导致无法接受的大索引。\n我们刚刚看到，如果您的查询包含一列作为函数参数或操作数，那么该列是否在索引中并不重要；您仍然不会获得仅索引扫描。但是，如果您的列仅用于与部分索引的谓词匹配的谓词中，则规划器足够聪明，可以意识到它不需要访问表来过滤结果，即使您的列是一个函数参数或操作数。 [4] 这是我们为提高性能而采用的解决方法。为了更好地理解它，让我们看看它如何应用于我们上面的示例查询。请注意，在我们的示例查询中，我们仅在查询的 WHERE 子句中引用了数据 -&gt;&gt; &#39;type&#39;。我们实际上并没有返回数据的值 -&gt;&gt; &#39;type&#39;。因此，Postgres 需要访问该表的唯一原因是确保 data -&gt;&gt; &#39;type&#39; IN (&#39;click&#39;, &#39;change&#39;, &#39;touch&#39;) 对于返回结果的每一行都为真，但由于部分索引是如何构建的，这次访问是没有必要的。作为复习，部分索引仅包含与谓词匹配的行的条目。例如，这个部分索引只包含数据 -&gt;&gt; &#39;type&#39; IN (&#39;click&#39;, &#39;change&#39;, &#39;touch&#39;) 的条目：因为 Postgres 知道 ea_index 只有数据 -&gt;&gt; &#39;type&#39; IN ( &#39;click&#39;, &#39;change&#39;, &#39;touch&#39;)，这样的查询：SELECT time FROM funnel_events WHERE data -&gt;&gt; &#39;type&#39; IN (&#39;click&#39;, &#39;change&#39;, &#39;touch&#39;) 将导致仅索引扫描。我们的示例查询引用了 step_num、time、num_actions、time_engaged 和 data 列。 step_num、time、num_actions和time_engaged都在索引中，data只在where子句中通过data -&gt;&gt; &#39;type&#39; IN (&#39;click&#39;, &#39;change&#39;)引用。因为查询谓词匹配部分索引谓词，所以规划器知道索引只包含满足查询谓词的值，不需要访问表来过滤扫描索引的结果。因此，我们最终对示例查询进行了仅索引扫描。此变通方法使 Effort Analysis 的 p90 性能提高了 2 倍，并且还使我们的 p70 和 p50 查询速度更快：只有在查看这些结果后，我们才完全了解导致此性能问题的怪癖以及解决该问题的变通方法。从某种意义上说，我们很幸运。我们希望通过分享这些 Postgres 事实，其他团队可以更加慎重地提高他们的查询性能。\n如果您喜欢对优化 Postgres 和/或 citus 查询感兴趣，请在 Twitter @philosohacker 上@-me，并且如果您在当前的工作中没有足够的机会优化查询，我们正在招聘！查看我们的团队和空缺职位。 [1] Postgres 使用索引扫描还是顺序扫描取决于它预计需要从表中获取的行的百分比。 [3] 我们知道严重依赖 JSONB 列有很多缺点。", "note_en": "Heap is a digital insights platform that automatically captures web and mobile behavior like page views, clicks, and taps. We recently shipped  Effort Analysis, a way for Heap customers to see the median number of interactions and seconds engaged between each step within a funnel. Here’s what it looks like:\n  To build this feature, we needed to write a query that could quickly scan more than a billion rows of event data. But when we first started working on this feature, it took too long to scan the data.\n Fortunately, we found a way to double the speed of this feature&#39;s p90 performance. To do this, we had to work around a case where the Postgres planner is, according to the Postgres docs, “not very smart.” This Postgres quirk surprisingly prevented an existing index from supporting an index-only scan. This post is about the quirk that caused our performance problem and the workaround we leveraged to achieve a 2x performance win.\n  First, a quick refresher on index-only scans. An index is a secondary data structure in your database that the query planner can use to make some queries faster. For example, an index on the  user_id column can make lookups of a specific  user_id faster. An index-only scan is a special kind of operation in which the database can satisfy a query with  just the information that’s in the index, without having to read the table’s actual rows.\n For example, a typical index at Heap contains the time of an event and the  user_id of the user who performed that event:\n    Given this table and index, the query planner would use an index-only scan for a query like  SELECT user_id FROM events WHERE time &gt; now() - ‘7 days’::interval because the only value we need,  user_id, is in the index.\n For a slightly different query like  SELECT * FROM events WHERE time &gt; now() - ‘7 days’::interval, the query planner couldn’t use an index-only scan because we need columns that are not in this index. The planner may [1] use an index scan instead.\n An index scan, as the name implies, scans the index for rows that satisfy the query predicate. However, it also reads in pages of data from the table itself to return and/or perform computations on values that aren’t in the index. This additional step often makes index scans slower than index-only scans.\n  Many of our clients record more than 100 million events a week, meaning a 90-day funnel would require scanning more than a billion rows. As a result, the p90 for the query was about 20 seconds, much slower than we wanted for our initial launch. Here’s a simplified version of the initial query that powered Effort Analysis:\n  Initially, the query that powered Effort Analysis wasn’t using an index-only scan. This surprised us because we had an index that looked like the following:\n  The reason this index didn’t yield an index-only scan is because of a surprising Postgres quirk.\n  Here’s what was happening: although  data -&gt;&gt; ‘type’ is in the index, the query planner thinks it also needs to have  data in the index,  even though  data  itself isn’t ever referenced in the query except as a part of the  data -&gt;&gt; ‘type’  expression. If that doesn’t seem like a smart way for the planner to work, the Postgres documentation agrees with you:\n  This problem arises any time a query uses a function or operator on a column. (Operators are just syntactic sugar for functions. [2]) If your query references  f(x), you must include  f(x)  and  x in your index to get an index-only scan. This isn’t a random hack; it&#39;s the suggested workaround for this issue in\r the Postgres docs.\n However, in our case,  x is  data, and because  data contains most of the data associated with an event (e.g., type, page url where event occurred, etc.), [3] this workaround would result in an unacceptably large index.\n  We’ve just seen that if your query includes a column as a function parameter or operand, it doesn’t matter if that column is in the index; you still won’t get an index-only scan. If, however, your column is only used in a predicate that matches the predicate of the partial index, the planner is smart enough to realize that it doesn’t need to visit the table to filter down the result,  even if your column is a function parameter or operand. [4]\n This is the workaround we leveraged for our performance win. To better understand it, let’s look at how it applies to our above example query. Notice that in our example query, we only reference  data -&gt;&gt; ‘type’ in the WHERE clause of the query. We aren’t actually returning the value of  data -&gt;&gt; ‘type’. So the only reason Postgres would need to visit the table would be to ensure that  data -&gt;&gt; ‘type’ IN (‘click’, ‘change’, ‘touch’) is true for each row of the returned result, but because of how partial indexes are constructed, this visit isn’t necessary.\n As a refresher, partial indexes only contain entries for rows that match a predicate. For example, this partial index only contains entries where  data -&gt;&gt; ‘type’ IN (‘click’, ‘change’, ‘touch’):\n  Because Postgres knows that  ea_index only has entries where  data -&gt;&gt; ‘type’ IN (‘click’, ‘change’, ‘touch’), a query like:  SELECT time FROM funnel_events WHERE data -&gt;&gt; ‘type’ IN (‘click’, ‘change’, ‘touch’) would result in an index-only scan.\n Our example query references the columns  step_num,  time,  num_actions,  time_engaged, and  data.  step_num, time,  num_actions, and  time_engaged are in the index, and  data is only referenced in the where clause via  data -&gt;&gt; ‘type’ IN (‘click’, ‘change’). Because the query predicate matches the partial index predicate, the planner knows that the index only contains values that satisfy the query predicate, and it doesn’t need to visit the table to filter down the results of scanning the index. Thus, we wind up with an index-only scan for our example query.\n  This workaround lead to a 2x p90 performance improvement for Effort Analysis, and it made our p70 and p50 query faster as well:\n  Only after looking at these results did we fully understand the quirk that caused this performance issue and the workaround that solved it. In some sense, we got lucky. We hope that by sharing these Postgres facts, other teams can be more deliberate about improving the performance of their queries.\n If you like nerding out about optimizing Postgres and/or citus queries, @-me on Twitter  @philosohacker, and if you’re not getting enough opportunities to optimize queries at your current gig, we’re hiring! Check out  our team and  open roles.\n  [1] Whether Postgres uses an index scan or a sequential scan depends on the percentage of rows it anticipates it will need to fetch from the table.\n  [3] We know that there are lots of downsides to relying this heavily on a JSONB column.", "posttime": "2021-08-03 03:04:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "postgres,case,查询", "title": "解决 Postgres 规划器“不是很聪明”的案例", "title_en": "Working Around a Case Where the Postgres Planner Is “Not Very Smart”", "transed": 1, "url": "https://heap.io/blog/when-the-postgres-planner-is-not-very-smart", "via": "", "real_tags": ["postgres", "case", "查询"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071267, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Jason A. Donenfeld Jason 在 zx2c4.com 周一 8 月 2 日 17:27:37 UTC 2021 大家好，经过几个月的工作，Simon 和我很高兴地宣布 WireGuardNT 项目，这是 WireGuard 到 Windows 内核的本地端口。这是一项意义重大的工作，如果您注意到我大约两个月没有阅读电子邮件，现在您知道为什么了。代码库，以便我们可以从该代码已经收到的分析和审查中受益。在最初的移植工作取得成功后，NT 代码库迅速分化，以很好地适应本机 NTism 和 NDIS（Windows 网络堆栈）API。最终结果是为 NTkernel 深度集成和高性能的 WireGuard 实现，它充分利用了 NT 内核和 NDIS 功能。您可以在此处阅读该项目并查看其源代码：https://git。 zx2c4.com/wireguard-nt/about/对于Windows平台，这个项目对我来说意义重大，因为它标志着WireGuard已经成为一个严肃的操作系统组件，意味着更严肃的使用。这也是一个相当重要的开源版本，因为通常没有那么多（尽管有一些）开源加密 NICdriver 代码已经在那里做这种事情，同时在这个过程中将各种内核功能整合在一起。 构建什么 WireGuardNT是，在此之前，Windows_currently_ 上的 WireGuard 如何工作的一些背景可能已经准备好了。我们目前有跨平台的 Go 代码库，称为 wireguard-go，它使用我们开发的通用 TUNdriver Wintun（有关信息，请参阅 wintun.net）。该实现存在于用户空间中，并在 Wintun 接口之间传送数据包。 WireGuardNT 将（最终）取代它，将所有 WireGuard 协议实现直接放入网络堆栈中以进行更深入的集成，就像目前在 Linux、OpenBSD 和 FreeBSD 上所做的那样。使用旧的wireguard-go/Wintun 实现，事实在用户空间意味着对于从 NIC 到达内核并放入 UDP 套接字缓冲区的每个 RX UDP 数据包，有一个上下文切换到用户空间以接收它，然后通过 Go 调度程序对其进行解密，然后写入到 Wintun 的环形缓冲区，然后在下一次上下文切换时处理它。对于 TX，事情是相反的：用户空间发送一个数据包，然后有一个上下文切换到内核将它交给 Wintun，它把它放到一个环形缓冲区中，然后有另一个到用户空间的上下文切换，并通过 Go 调度程序到加密它，然后它通过一个套接字发送，这涉及另一个到发送的上下文切换。所有的环形缓冲区——Wintun 的环和 Winsock 的 RIO 环——尽可能地摊销上下文切换并使其相当快，但所有它仍然构成开销和延迟。 WireGuardNT 摆脱了所有这些。虽然现在的性能相当不错（在我的小测试盒上大约 7.5Gbps TX），但还没有花很多精力来优化它，而且还有很多性能需要提高，我怀疑，尤其是当我们更多地了解 NT 的调度程序和线程模型细节时。然而，通过简单地进入内核，我们显着减少了延迟并消除了wireguard-go/Wintun 的上下文切换问题。然而，大多数 Windows 用户并不真正关心超过 1Gbps 会发生什么，这就是事情变得有趣的地方。使用以太网连接的 Windows 用户在使用旧的慢速wireguard-go/Wintun 时通常不会遇到接近 1Gbps 左右的问题，但是通过 WiFi，这些用户通常会看到大幅减速。随着 WireGuardNT 的延迟显着降低，这些减速似乎不再存在。 Jonathan Tooker 向我报告说，在他的带有 Intel AC9560 WiFi 卡的系统上，他在没有 WireGuard 的情况下获得~600Mbps，通过以太网使用wireguard-go/Wintun 获得~600Mbps，通过 WiFi 使用wireguard-go/Wintun 获得~95Mbps，使用 WireGuardNT 获得~600Mbps无线网络。换句话说，当使用 WireGuardNT 时，wireguard-go/Wintun 对 WiFi 性能的影响已经消失。功耗和电池使用量也应该更低。当然，在多千兆吞吐量方面，Windows Server 用户无疑将受益。该项目仍处于早期阶段，目前（2021 年 8 月；如果您&#39;将来重读这可能不适用）这应该被认为是“实验性的”。有相当多的新代码，我想花更多的时间仔细检查和分析。希望通过将在线代码置于“早期”开发阶段，其他人可能有兴趣研究源代码并报告其中的错误。尽管如此，无论是否具有实验性，我们仍然需要人们对此进行测试并帮助解决问题。为此，WireGuardNT 现在可用于 Windows 客户端的普通 WireGuard -- https://www.wireguard.com/install/ -- 以及 0.4.z 系列，此外还完全支持古老的 wg(8 ) 实用程序，但目前（2021 年 8 月；如果您将来阅读此内容，这可能不适用）它位于手动设置的注册表旋钮后面。 0.4.z 系列将分为三个阶段： 阶段 1) WireGuardNT 隐藏在“ExperimentalKernelDriver”注册表旋钮后面。如果您不手动修改以启用它，客户端将继续像以前一样使用 wireguard-go/Wintun。阶段 2) WireGuardNT 默认启用，不再隐藏。但是，如果存在导致现有基础设施停机的后期问题，将会有一个名为“UseUserspaceImplementation”的新隐藏旋钮，它可以像以前一样使用wireguard-go/Wintun。阶段 3) WireGuardNT 启用，wireguard-go/Wintun 从客户端中删除。 [请注意：作为项目和代码库，Wintun 和 wireguard-go 都将继续维护，因为它们在我们的 WireGuard 客户端之外有应用程序和用途，而 Wintun 通常在 WireGuard 之外使用。]每个阶段之间的飞跃是相当大，每次发生时我都会更新这个线程。当一般消费看起来没问题时，就会从 1 移到 2，而当我们有理由确定存在相同水平的稳定性时，就会发生从 2 移到 3。由于我们在客户端中不包含任何遥测，因此很多评估将取决于您、邮件列表读者、发送错误报告或不发送错误报告。当然，在不稳定的第 1 阶段拥有测试人员将是一个巨大的福音。可以在通常的位置找到有关启用这些旋钮的说明：https://git.zx2c4.com/wireguard-windows/about/docs/adminregistry.md[如果您将来正在阅读这封电子邮件并且该页面没有存在或不包含提及“ExperimentalKernelDriver”或“UseUserspaceImplementation”，那么我们已经进入了第 3 阶段，如上所述，这些都不再适用。 ]所以，请试一试，查看文档和代码，然后让我知道您的想法。我期待听到您的想法并收到错误报告、体验报告和总体反馈。享受吧！杰森", "note_en": "Jason A. Donenfeld  Jason at zx2c4.com    Mon Aug 2 17:27:37 UTC 2021  Hey everyone,After many months of work, Simon and I are pleased to announce the WireGuardNTproject, a native port of WireGuard to the Windows kernel. This has been amonumental undertaking, and if you&#39;ve noticed that I haven&#39;t read emails inabout two months, now you know why.WireGuardNT, lower-cased as &#34;wireguard-nt&#34; like the other repos, began as aport of the Linux codebase, so that we could benefit from the analysis andscrutiny that that code has already received. After the initial portingefforts there succeeded, the NT codebase quickly diverged to fit well withnative NTisms and NDIS (Windows networking stack) APIs. The end result is adeeply integrated and highly performant implementation of WireGuard for the NTkernel, that makes use of the full gamut of NT kernel and NDIS capabilities.You can read about the project and look at its source code here:  https://git.zx2c4.com/wireguard-nt/about/For the Windows platform, this project is a big deal to me, as it marks thegraduation of WireGuard to being a serious operating system component, meantfor more serious usage. It&#39;s also a rather significant open source release, asthere generally isn&#39;t so much (though there is some) open source crypto-NICdriver code already out there that does this kind of thing while pullingtogether various kernel capabilities in the process.To frame what WireGuardNT is, a bit of background for how WireGuard on Windows_currently_ works, prior to this, might be in store. We currently have across-platform Go codebase, called wireguard-go, which uses a generic TUNdriver we developed called Wintun (see wintun.net for info). Theimplementation lives in userspace, and shepherds packets to and from theWintun interface. WireGuardNT will (eventually) replace that, placing all ofthe WireGuard protocol implementation directly into the networking stack fordeeper integration, in the same way that it&#39;s done currently on Linux,OpenBSD, and FreeBSD.With the old wireguard-go/Wintun implementation, the fact of being inuserspace means that for each RX UDP packet that arrives in the kernel fromthe NIC and gets put in a UDP socket buffer, there&#39;s a context switch touserspace to receive it, and then a trip through the Go scheduler to decryptit, and then it&#39;s written to Wintun&#39;s ring buffer, where it is then processedupon the next context switch. For TX, things happen in reverse: userspacesends a packet, and there&#39;s a context switch to the kernel to hand it off toWintun, which places it into a ring buffer, and then there&#39;s another contextswitch to userspace, and a trip through the Go scheduler to encrypt it, andthen it&#39;s sent through a socket, which involves another context switch to sendit. All of the ring buffers -- Wintun&#39;s rings and Winsock&#39;s RIO rings --amortize context switches as much as possible and make this decently fast, butall and all it still constitutes overhead and latency. WireGuardNT gets rid ofall of that.While performance is quite good right now (~7.5Gbps TX on my small test box),not a lot of effort has yet been spent on optimizing it, and there&#39;s still alot more performance to eek out of it, I suspect, especially as we learn moreabout NT&#39;s scheduler and threading model particulars. Yet, by simply being inthe kernel, we significantly reduce latency and do away with the contextswitch problems of wireguard-go/Wintun.Most Windows users, however, don&#39;t really care what happens beyond 1Gbps, andthis is where things get interesting. Windows users with an Ethernetconnection generally haven&#39;t had much trouble getting close to 1Gbps or sowith the old slow wireguard-go/Wintun, but over WiFi, those same users wouldcommonly see massive slowdowns. With the significantly decreased latency ofWireGuardNT, it appears that these slowdowns are no more. Jonathan Tookerreported to me that, on his system with an Intel AC9560 WiFi card, he gets~600Mbps without WireGuard, ~600Mbps with wireguard-go/Wintun over Ethernet,~95Mbps with wireguard-go/Wintun over WiFi, and ~600Mbps with WireGuardNT overWiFi. In other words, the WiFi performance hit from wireguard-go/Wintun hasevaporated when using WireGuardNT. Power consumption, and hence battery usage,should be lower too.And of course, on the multigig throughput side of things, Windows Server userswill no doubt benefit.The project is still at its early stages, and for now (August 2021; if you&#39;rereading this in the future this might not apply) this should be considered&#34;experimental&#34;. There&#39;s a decent amount of new code on which I&#39;d like to spenda bit more time scrutinizing and analyzing. And hopefully by putting the codeonline in an &#34;earlier&#34; stage of development, others might be interested instudying the source and reporting bugs in it.Nonetheless, experimental or not, we still need people to test this and helpshake out issues. To that end, WireGuardNT is now available in the ordinaryWireGuard for Windows client --  https://www.wireguard.com/install/ -- with the0.4.z series, in addition to having full support of the venerable wg(8)utility, but currently (August 2021; if you&#39;re reading this in the future thismight not apply) it is behind a manually set registry knob. There will bethree phases of the 0.4.z series: Phase 1) WireGuardNT is hidden behind the &#34;ExperimentalKernelDriver&#34; registry knob. If you don&#39;t manually tinker around to enable it, the client will continue to use wireguard-go/Wintun like before. Phase 2) WireGuardNT is enabled by default and is no longer hidden. However, in case there are late-stage problems that cause downtime for existing infrastructure, there&#39;ll be a new hidden knob called &#34;UseUserspaceImplementation&#34; that goes back to using wireguard-go/Wintun like before. Phase 3) WireGuardNT is enabled, and wireguard-go/Wintun is removed from the client. [Do note: as projects and codebases, both Wintun and wireguard-go will continue to be maintained, as they have applications and uses outside of our WireGuard client, and Wintun has uses outside of WireGuard in general.]The leap between each phase is rather large, and I&#39;ll update this thread wheneach one happens. Moving from 1 to 2 will happen when things seem okay forgeneral consumption and from 2 to 3 when we&#39;re reasonably sure there&#39;s thesame level of stability. Since we don&#39;t include any telemetry in the client, alot of this assessment will be a matter of you, mailing list readers, sendingbug reports or not sending bug reports. And of course, having testers duringthe unstable phase 1 will be a great boon. Instructions on enabling theseknobs can be found in the usual place:  https://git.zx2c4.com/wireguard-windows/about/docs/adminregistry.md[ If you&#39;re reading this email in the future and that page either does not exist or does not contain mention of &#34;ExperimentalKernelDriver&#34; or &#34;UseUserspaceImplementation&#34;, then we have already moved to phase 3, as above, and none of this applies any more. ]So, please do give it a whirl, check out the documentation and code, and letme know what you think. I&#39;m looking forward to hearing your thoughts andreceiving bug reports, experience reports, and overall feedback.Enjoy!Jason", "posttime": "2021-08-03 03:04:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,windows,high,wintun", "title": "WireGuardNT，Windows 内核的高性能 WireGuard 实现", "title_en": "WireGuardNT, a high-performance WireGuard implementation for the Windows kernel", "transed": 1, "url": "https://lists.zx2c4.com/pipermail/wireguard/2021-August/006887.html", "via": "", "real_tags": ["性能", "windows", "high", "wintun"]}, {"category": "", "categoryclass": "", "imagename": "c3ad2256f31cc7b669820434f4cb01f6.jpeg", "infoid": 1071266, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在连续三次流产后，布列塔尼·古尔德 (Brittany Gould) 说，她求助于 Theranos Inc.，想知道她最近的怀孕是否顺利。古尔德女士说，然后，该公司的一项标志性手指刺痛测试表明她又失去了一个孩子。亚利桑那州梅萨市的医疗助理回忆说，当她不得不告诉正在等待兄弟姐妹的 7 岁女儿时，她很害怕。与在 Theranos 创始人 Elizabeth Holmes 的刑事审判中被指定为潜在证人的其他患者一样，Gould 女士的测试是错误的。检察官指控福尔摩斯女士通过错误地声称她的发明可以准确地对几滴血进行实验室测试来欺骗患者和投资者。一再推迟的审判——因为福尔摩斯女士自己要生孩子而推迟一次——预计将成为多年来最受关注的公司欺诈案件之一。审判定于 8 月 31 日在加利福尼亚州圣何塞开始陪审团选择，其中包括星光熠熠的潜在证人名单，其中包括前 Theranos 董事亨利·基辛格和吉姆·马蒂斯；前 Theranos 律师 David Boies；以及知名投资者，包括 Bechtel Corp. 前董事长 Riley Bechtel 和 Fox Corp. 董事长兼新闻集团执行主席 Rupert Murdoch，华尔街日报的所有者。 《华尔街日报》将向您收取 $ + 税款（如果适用）。您可以随时在客户中心更改您的计费偏好或致电客户服务。如果费率或条款有任何变化，您将提前收到通知。您可以随时致电客户服务部取消订阅。", "note_en": "After three back-to-back miscarriages, Brittany Gould said she turned to Theranos Inc. to know if her latest pregnancy was on track.\n  Then, one of the company’s trademark finger-prick tests indicated she was losing another baby, Ms. Gould said. The Mesa, Ariz., medical assistant recalled dreading the moment when she would have to tell her 7-year-old daughter, who was waiting for a sibling.\n    Like those of other patients slated as potential witnesses in  the criminal trial of Theranos founder Elizabeth Holmes, Ms. Gould’s test was wrong. Prosecutors have accused Ms. Holmes of defrauding patients and investors by falsely claiming her invention could accurately perform lab tests on just a few drops of blood.\n  The repeatedly delayed trial—postponed once because Ms. Holmes was due to have a baby herself—is expected to be one of the most widely watched corporate-fraud cases in years. Scheduled to begin with jury selection on Aug. 31 in San Jose, Calif., the trial features a star-studded list of potential witnesses, including ex-Theranos directors Henry Kissinger and Jim Mattis; ex-Theranos lawyer David Boies; and high-profile investors, including Riley Bechtel, the former chairman of Bechtel Corp., and Rupert Murdoch, chairman of Fox Corp. and executive chairman of News Corp, owner of The Wall Street Journal.\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-08-03 03:04:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "福尔摩斯,wild,女士", "title": "伊丽莎白福尔摩斯审判中的新通配符：Theranos 患者", "title_en": "The Emerging Wild Card in the Trial of Elizabeth Holmes: Theranos Patients", "transed": 1, "url": "https://www.wsj.com/articles/theranos-patients-the-emerging-wild-card-in-the-trial-of-elizabeth-holmes-11627915111", "via": "", "real_tags": ["福尔摩斯", "wild", "女士"]}, {"category": "", "categoryclass": "", "imagename": "299ce2b5e408059bd007506be32c2315.jpeg", "infoid": 1071265, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与去年相比，6 月份的平均小时工资增长了 3.6%，是十多年来的最高水平。然而，根据劳工统计局的数据，通货膨胀基本上使普通工人减薪了 2%。他们做或不做的程度取决于许多因素。经济学家表示，由于大流行的扭曲，在解释数据时也有理由保持谨慎。工人们看到他们 6 月份的时薪以十多年来最快的速度增长。然而，他们中的一些人看到这些收益被高通胀抹去。 “实际工资”——计入人们购买的商品和服务成本后的收入衡量标准——与 2020 年相比，上个月平均下降了近 2%。参议院共和党人周三表示，美国人因此而减薪. “美国人生活的必需品呈指数级增长，”RS.C. 参议员蒂姆·斯科特 (Tim Scott) 表示，他列举了诸如汽油、洗衣、机票、搬家费用、酒店、培根和电视价格上涨等例子。经济学家认为，这种论点的主旨——通胀侵蚀了工资上涨——是正确的。他们说，仍然存在许多细微差别。\n一方面，消费者是否减薪取决于他们的个人收入和他们购买的东西。右倾智囊团美国企业研究所经济政策研究主任迈克尔·斯特恩 (Michael Strain) 表示：“如果物价的增长速度快于工资，那么人们就会得到通胀调整后的减薪。” “最终，每个人​​的情况都有很大差异。”此外，经济学家表示，通胀一直不稳定，可能只是暂时的——这意味着购买力的下降可能是短暂的。与 2020 年同月相比，6 月份的平均时薪增长 3.6%，至 30.40 美元。根据经济政策研究所汇编的数据，这是自 2009 年 1 月以来的最大涨幅。与此同时，衡量通货膨胀的消费者价格指数同期上涨了 5.4%，这是自 2008 年 8 月以来的最高水平。根据季节性调整因素，这意味着购买力平均下降 1.7%。劳工统计局。 “通货膨胀是一种税收，”穆迪投资者服务公司副总裁威廉福斯特说。 “这是最好的思考方式。”\n福斯特说，通货膨胀对低收入者的影响最大，他们将更多的平均美元花在汽油、食品和其他可能价格上涨的物品上。他补充说，往往持有更多金融资产（如股票或房屋）的富裕人士可能能够更好地抵消通货膨胀的影响。但并不是每个人都一定会因此而减薪。 5.4% 的年通货膨胀率是许多商品的平均水平——家庭不一定会购买价格越来越贵的商品。例如，该指标包括二手车和卡车的价格，与 2020 年 6 月相比上涨了约 45%，这是有记录以来的最大变化。除非他们购买二手车，否则这种价格冲击不会打击某人的钱包。同样，汽油价格上涨了 45%。额外费用将由司机承担，但乘坐公共交通工具的城市居民可能不会承担。相比之下，食品价格同期仅上涨 2.4%，低于更广泛的通胀指标。消费者价格指数也没有考虑消费者行为的变化，他们可能会改变购买的东西以避免这些更高的成本。例如，人们可能会为了省钱而从牛肉转向鸡肉，或者推迟购买汽车直到价格下降。\n“人们通过改变消费来应对价格变化，”威斯康星大学麦迪逊分校经济学教授、曼哈顿研究所兼职研究员诺亚·威廉姆斯说。个人消费支出价格指数是衡量通货膨胀的另一项指标，说明了这些变化。经济分析局尚未公布 6 月份的数字。但 5 月份，PCE 指数比消费者价格指数年度读数低 1.1 个百分点（3.9% 对 5%）——这表明消费者购买了低成本商品。然而，芝加哥大学经济学教授凯西·穆里根 (Casey Mulligan) 表示，这些转变即使不是明确的，仍然会给消费者带来成本。特朗普政府期间担任白宫经济顾问委员会首席经济学家的穆里根说：“他们试图将弊端最小化，但它们都是弊端。”经济学家表示，随着美国经济从 Covid-19 大流行中反弹，还有理由对过度解读通货膨胀和工资数据保持警惕。这是由于病毒造成的经济扭曲。例如，在大流行初期，消费者价格下跌。将今天的价格与一年前的较低价格进行比较，自然会导致通胀读数看起来很高。同样，在大流行期间，低工资工人裁员人数不成比例，工资数据可能会出现偏差。例如，在 2020 年 4 月，即使在大规模裁员的情况下，平均时薪也增长了 8%（有记录以来的最高水平），因为更多的高收入者仍在工作中。\n现在可能正在发生同样的情况，但反过来。随着经济反弹和低薪工人被重新雇用，平均收入可能会受到抑制。 WE Upjohn 就业研究所的研究主管苏珊·豪斯曼 (Susan Houseman) 表示，暗示工人正在减薪“可能有点误导”。 “[劳动力的构成]在经济低迷和复苏期间尤其会发生变化，因此在解释这些数据时必须小心，”她说。经济学家表示，目前尚不清楚消费者价格和工资上涨是暂时的还是更持久的。然而，他们说，至少部分通胀可以用可能的短期动态来解释，例如供应限制和消费者从大流行引起的冬眠中醒来时需求激增。例如，据 AAA 称，近期天然气价格居高不下的部分原因是主要产油国未能在 7 月初达成增加石油供应的协议。微芯片短缺导致汽车价格飙升。 “通货膨胀不会是暂时的，”安联集团首席经济顾问穆罕默德·埃里安（Mohammed El-Erian）周五告诉彭博电视台。他补充说：“我有一整套已经宣布提价的公司名单，这些公司告诉我们他们预计价格会进一步上涨，而且他们预计价格会继续上涨。”\n据劳工部称，由于对工人的需求不断增加，近几个月工资似乎有所增加。豪斯曼说，加薪可能比高通胀持续时间更长，因为企业在加薪后通常不会减薪。", "note_en": "Average hourly wages grew 3.6% in June relative to last year, the most in more than a decade.\n However, inflation essentially gave the average worker about a 2% pay cut, according to the Bureau of Labor Statistics.\n  The extent to which they did or didn&#39;t depends on many factors. There are also reasons to be cautious when interpreting the data due to pandemic distortions, according to economists.\n Workers saw their hourly pay in June jump at the fastest clip in more than a decade. Yet some of them saw those gains erased by high levels of inflation.\n &#34;Real wages&#34; — a measure of income after accounting for the cost of goods and services people buy — fell by almost 2%, on average, last month compared with 2020. Senate Republicans said Wednesday that Americans were getting a pay cut as a result.\n  &#34;The staples of American life are increasing exponentially,&#34; according to Sen. Tim Scott, R-S.C., who cited examples like higher prices for gas, laundry, airfare, moving costs, hotels, bacon and TVs.\n  The thrust of the argument — that inflation eats into rising wages — is true, according to economists. Still, there are many nuances, they said.\n For one, whether a consumer got a pay cut or not depends on their individual earnings and the things they buy.\n &#34;If prices are growing faster than wages, then people are getting inflation-adjusted pay cuts,&#34; according to Michael Strain, director of economic policy studies at the American Enterprise Institute, a right-leaning think tank. &#34;Ultimately, this varies dramatically for every individual.&#34;\n  Plus, inflation has been volatile and may prove temporary — meaning a reduction in buying power could be short-lived, economists said.\n  Average hourly earnings  rose 3.6%, to $30.40, in June compared with the same month in 2020. That&#39;s the biggest spike since January 2009, according to  data compiled by the Economic Policy Institute.\n Meanwhile, the consumer price index, a measure of inflation,  jumped 5.4% over the same period — the most since August 2008.\n Together, this amounts to a 1.7% loss in buying power, on average, when factoring in seasonal adjustments,  according to the Bureau of Labor Statistics.\n  &#34;Inflation is a tax,&#34; said William Foster, a vice president at Moody&#39;s Investors Service. &#34;That&#39;s the best way to think about it.&#34;\n Inflation most impacts lower earners, who spend more of their average dollar on gas, food and other items that may be rising in price, Foster said. Wealthier individuals, who tend to hold more financial assets like stocks or homes, may be better able to offset the impact of inflation, he added.\n But not everyone necessarily got a pay cut as a result. The 5.4% jump in annual inflation is an average of many items — and households aren&#39;t necessarily buying the ones that are getting much costlier.\n  For example, the metric includes prices for used cars and trucks, which are up about 45% from June 2020 — their largest change on record. That price shock wouldn&#39;t hit someone&#39;s wallet unless they bought a used car.\n Similarly, gasoline prices are up 45%. That extra cost would be borne by drivers, though perhaps not city residents who ride public transit.\n By comparison, food prices are up just 2.4% over the same time, lower than the broader inflation measure.\n  The consumer price index also doesn&#39;t account for shifts in the behavior of consumers, who may change what they buy to avoid these higher costs.\n For example, one might switch to chicken from beef to save money, or delay buying a car until prices fall.\n &#34;People respond to price changes by shifting their consumption,&#34; according to Noah Williams, an economics professor at the University of Wisconsin-Madison and an adjunct fellow at the Manhattan Institute.\n  The personal consumption expenditures price index, another measure of inflation, accounts for these shifts. The Bureau of Economic Analysis hasn&#39;t yet issued the figure for June. But in May, the  PCE index was 1.1 percentage points lower than the consumer price index annual reading (3.9% versus 5%) — which indicates consumers bought lower-cost goods.\n However, these shifts still impose a cost on consumers, if not an explicit one, according to Casey Mulligan, an economics professor at the University of Chicago.\n &#34;They&#39;re trying to minimize the evils, but they&#39;re both evils,&#34; said Mulligan, who served as chief economist of the White House Council of Economic Advisers during the Trump administration.\n  There&#39;s also reason to be wary of overinterpreting inflation and wage figures as the U.S. economy rebounds from the  Covid-19 pandemic, according to economists.\n That&#39;s due to economic distortions caused by the virus. For example, consumer prices fell early in the pandemic. Comparing prices today to lower prices a year ago will naturally cause inflation readings to seem high.\n Similarly, wage data may be skewed by a disproportionate number of layoffs among low-wage workers during the pandemic. In April 2020, for example, average hourly earnings jumped 8% (the highest on record) even amid mass layoffs, since more high earners remained in the workforce.\n  The same may be happening now, but in reverse. As the economy rebounds and lower-wage workers are rehired, average earnings may appear suppressed.\n &#34;It could be a little misleading&#34; to suggest workers are getting a pay cut, according to Susan Houseman, research director at the W.E. Upjohn Institute for Employment Research.\n &#34;[The composition of the workforce] is especially changing during downturns and recoveries, so one has to be careful about interpreting these data,&#34; she said.\n  It&#39;s unclear whether higher consumer prices and wages are temporary or longer-lasting, according to economists.\n However, at least some of the inflation can be explained by likely short-term dynamics, like supply constraints and a surge in demand as consumers emerge from a pandemic-induced hibernation, they said.\n For example, high recent gas prices were caused partly because major oil-producing nations couldn&#39;t reach agreement to raise oil supply in early July,  according to AAA. And a shortage of microchips has led to a spike in car prices.\n  &#34;Inflation is not going to be transitory,&#34; Mohammed El-Erian, the chief economic adviser at Allianz SE,  told Bloomberg TV on Friday. &#34;I have a whole list of companies that have announced price increases, that have told us they expect further price increases, and that they expect them to stick,&#34; he added.\n Wages seem to have increased in recent months amid rising demand for workers,  according to the Labor Department. Increased pay may be longer-lasting than high inflation, since businesses often don&#39;t cut pay after raising it, Houseman said.", "posttime": "2021-08-03 03:03:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上涨,rising,可能", "title": "工资在上涨，但通货膨胀可能让工人减薪 2%", "title_en": "Wages are rising, but inflation may have given workers a 2% pay cut", "transed": 1, "url": "https://www.cnbc.com/2021/07/27/wages-are-rising-but-has-inflation-given-workers-a-2percent-pay-cut.html", "via": "", "real_tags": ["上涨", "rising", "可能"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1071264, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "麦迪逊广场花园拟建的体育场 MSG Sphere 将整天向当地人的脸上播放广告——但批评者质疑规划过程 随着规划申请的进行，它肯定有球。或者，准确地说，是一个巨大的球。一个巨大的发光球体，与伦敦眼一样宽，几乎与大本钟一样高，计划降落在斯特拉特福，像一颗巨大的人造太阳一样凸出天际线，用 3600 万 LED 的功率使东区眼花缭乱。这就是 MSG Sphere，这是纽约麦迪逊广场花园公司的最新现场娱乐概念，自 1879 年以来一直是高强度音乐的提供者。曼哈顿的“世界上最著名的舞台”曾接待过从滚石乐队到穆罕默德·阿里在内的所有人。圆形屋顶；但是，在伦敦，他们想做得更好。他们说，这个球体是为“下一代沉浸式体验”而设计的，拥有世界上最大和最高分辨率的屏幕、振动地板的“次声触觉系统”和“波束成形”音频技术，可将声音传送到每个座位。但它最极端、最有争议的特征是外面的东西：建筑物的立面是一个五英亩的球形电视屏幕，就像时代广场滚成一个球一样。它被设置为一天 24 小时发光，一半时间覆盖着动画广告，在人们卧室的窗户外面闪烁。 “我们的朋友开玩笑说，它至少会减少我们的电费，”住在拟建地点对面的 Ceren Sonmez 说。 “无论白天还是黑夜，我们都不必开灯。” Sonmez 和她的丈夫于 2018 年搬进了位于斯特拉特福 Legacy Tower 三楼的共享产权公寓，穿过铁路线，球体将从那里升起，毗邻 Westfield 购物中心。拿到钥匙的那天，他们在门垫上发现了一张宣传单，宣传附近该项目的公众咨询，于是他们直接跑了过去。 “我们认为这不适合住宅区的开发，”Sonmez 说。 “但那家伙只是说：&#39;如果你不喜欢噪音和人群，你就不应该搬到斯特拉特福。&#39;我一生都住在东伦敦，从没想过会在这里建造这样的东西。无论他们住在哪里，没有人会期望一个巨大的光球会到达他们的家门口。”除了，也许，在拉斯维加斯。如果这个项目看起来像是从罪恶之城空运的东西，那是因为它是。尽管声称伦敦球将“像您从未体验过的一样”，但 MSG 目前正在拉斯维加斯的威尼斯度假村旁边建造一个几乎相同的项目，该项目将于 2023 年开业。 MSG 老板詹姆斯多兰的创意，主要作为唐纳德特朗普竞选活动的捐助者，这个价值 18 亿美元的团块加入了一个假运河和人造天空的幻想世界。它是发光广告牌的世界之都的合适补充，它是 360 度广告的最高点，是最终的建筑标志。这是罗伯特·文丘里和丹尼​​斯·斯科特·布朗的霓虹灯梦。您可能会争辩说，奥运会后的斯特拉特福是伦敦最接近拉斯维加斯大道上任何东西都可以免费开放的地方。斯特拉特福大街现在两旁林立着自己特殊的俗气塔，有些在夜间呈现彩虹色，而奥林匹克公园对建筑奇思妙想并不陌生。它是一个形状像 Pringle 的赛车场、一个胖乎乎的黄貂鱼形状的游泳池和一个看起来像一个破损的过山车的观景塔的所在地。有什么更好的地方放置一个巨大的脉动球体，里面装满了 21,500 名音乐会观众？首先，毗邻可容纳 60,000 人的伦敦体育场可能不是最好的地方。斯特拉特福车站狭窄的走廊经常拥挤到极点，据报道，通勤者被踩踏。 MSG 坚称将与体育场合作，“在切实可行的情况下”避免赛事冲突，但当地人仍然担心。 MSG 还承诺为 Stratford 车站建造一个新入口，他们说这将有助于缓解加剧的拥堵，但活动人士认为，大厅区域不足以管理离开该领域的人群。 “我们认为斯特拉特福的居民不应该因为如此巨大的事情而成为试验品，”Stop MSG Sphere 活动小组的成员 Lindsay Mace 说。 “从车站人满为患，到交通量增加、噪音和光污染，甚至考虑这件事既荒谬又淫秽。”巨大的地球经历了一段非凡的旅程，从看起来像愚人节恶作剧到现在似乎很有可能发生。负责监督奥林匹克公园及其周边地区命运的市长机构伦敦遗产发展公司 (LLDC) 已将规划委员会的日期安排在 9 月，届时 MSG 3,000 多页申请的结果将最终确定。但它是如何走到这一步的？许多奥运遗产总体规划大多忽略了这个占地 1.9 公顷（4.7 英亩）的三角形场地。它一直被视为韦斯特菲尔德停车场后面的一个没有希望的腋窝，被铁路线包围，并在当前计划中模糊地分配给“尊重现有特征、规模和体量的市中心用途”。该场地由 London &amp; Continental Railways 公有所有，并在奥运会期间用作长途汽车公园，然后于 2015 年以 900 万英镑的价格出售给 Westfield。这位澳大利亚购物中心的老板计划建造一个室内滑雪场，并得到当时市长的大力支持鲍里斯约翰逊，但这个想法被搁置了，该网站于 2017 年以高达 6000 万英镑的价格卖给了 MSG。如果没有获得规划许可，也没有建立回收机制来为公共利益获取部分价值，那么一块铁路用地的价值如何在两年内增加了六倍以上？ MSG 是否得到了某种默许，他们的庞大领域将被允许，违反当地计划的原则？当活动人士意识到自 2018 年以来一直领导该领域项目的 MSG 开发和建设总裁 Jayne McGivern 在 2012 年至 2016 年期间担任 LLDC 董事会成员时，他们的怀疑进一步加剧。 信息自由要求显示，在 2017 年至2019 年，传统公司与 MSG 团队之间进行了 33 次无记录的会议，包括 McGivern 和 LLDC 老板 Lyn Garner 之间的定期私人电话。 LLDC 发言人说：“与所有地方规划当局一样，LLDC 定期与土地所有者讨论主要战略开发地点，这是标准做法，积极与申请人合作讨论开发建议，并在正式提交之前尝试解决开发问题。通过公众咨询与申请人和其他利益相关者的接触程度完全符合这一特定申请的规模和复杂性。” MSG 发言人表示同意，坚称从来没有利益冲突，也没有事先做出任何保证。反球运动也并非没有争议。 2019年，据透露，反对该项目的声音平台“纽汉行动集团”是一家公关公司代表竞争对手O2 Arena的运营商AEG创建的组织。格林威治音乐会场地对味精发动了一场精心策划的战争，聘请了大量公关机构和规划律师来挑选申请的每一个细节。他们的武器库包括超现实的视频，展示了如果球体继续前进，Sonmez 和她邻居的公寓会是什么样子——一个永久的银翼杀手反乌托邦的动画广告从他们的窗户中射出。如果该项目获得批准，将会有很多未知领域让律师们忙碌。 “过去，在邻居纠纷中，法庭上出现了过多的圣诞灯饰，”为 AEG 工作的律师事务所 Dentons 的财产诉讼主管布莱恩·约翰斯顿 (Bryan Johnston) 说。 “这将是一年 365 天的全能圣诞节展示。”光明权是一项完善的规划原则，但黑暗权呢？ MSG 表示，它将在夏季的午夜至早上 6 点和冬季的早上 7 点将球体置于“低亮度”模式 - 但这仍然意味着，在较暗的月份，它在日出前已经达到最亮的状态。该球体的命运将成为衡量伦敦决策过程真正民主程度的试金石。该网站所在的纽汉姆坚决反对它。该委员会以多种理由提出反对，从交通和空气质量到光污染和就业。邻近的哈克尼也反对，批评可能对北部李谷的“有害生态影响”。但是，就像 1980 年代引入金丝雀码头的 Docklands Development Corporation 一样，基本上不负责任的 LLDC 胜过当地的观点。 Of 12 members on the corporation&#39;s planning committee, only five are elected local councillors.作为西汉姆的MP，Lyn Brown说：“LLDC董事会和规划委员会的未人联系成员经常出选的自治市镇代表，这往往导致了未能使当地人民受益的发展。允许这个球体将是对奥运遗产的背叛。”由于传统公司很快将被清盘，规划权力将在 2024 年恢复到自治市镇，他们应该成为对该地区产生如此深远影响的项目的仲裁者吗？其他反对意见已逐渐被味精提供的旨在回答这些担忧的额外报告和缓解策略的点滴所淡化。伦敦交通局对车站容量和火车司机被旋转的 LED 分心的危险表示严重担忧，但现在表示它正在“建设性地工作”，以便“可以有效地缓解问题”。 Network Rail 的反对意见也有所减少。批评者指出，其主席 Peter Hendy 爵士也是 LLDC 的主席，并与 MSG 进行了未经记录的会议，尽管没有任何不当之处。 LLDC 的决定最终将提交给伦敦工党市长 Sadiq Khan。在 2018 年宣布该领域时，他热情地欢迎“另一个世界级的场地来到首都，以确认伦敦作为音乐强国的地位”；然而第二年，他的规划官员的第一份报告得出结论，它不符合他自己的伦敦计划。他陷入困境。他会站在工党一边听当地人的意见，还是支持他的开发公司，希望利用这个傲慢的小玩意来提升首都的脱欧后品牌？本文于 2021 年 8 月 2 日进行了修订，以删除小标题中关于规划申请正在快速审核的错误建议；并添加有关车站访问的更多详细信息", "note_en": "The MSG Sphere, Madison Square Garden’s proposed stadium will beam adverts into locals’ faces all day – but critics are questioning the planning process\n   A s planning applications go, it’s certainly got balls. Or, to be precise, one massive ball. A gigantic glowing orb, as wide as the London Eye and almost as tall as  Big Ben, is planned to descend on Stratford, bulging on to the skyline like a great artificial sun, dazzling the East End with the power of 36m LEDs.   This is  the MSG Sphere, the latest live entertainment concept from New York’s Madison Square Garden company, purveyors of high-octane razzmatazz since 1879. “The world’s most famous arena” in Manhattan has hosted everyone from the Rolling Stones to Muhammad Ali  beneath its great circular roof; but, in London, they want to go one better. The sphere, they say, is designed for “the next generation of immersive experiences”, featuring the biggest and highest-resolution screen in the world, an “infrasound haptic system” of vibrating floors, and “beamforming” audio technology to channel sound to every seat. But its most extreme, and controversial, feature is what’s on the outside: the building’s facade is a five-acre spherical TV screen, like Times Square rolled into a ball. It is set to glow 24 hours a day, covered with animated adverts for half the time, flickering right outside people’s bedroom windows.  “Our friends have joked that it will at least reduce our electricity bills,” says Ceren Sonmez, who lives opposite the proposed site. “We’ll never have to switch the lights on, day or night.”\n   Sonmez and her husband moved into a shared ownership flat on the third floor of Legacy Tower in Stratford in 2018, across the railway line from where the sphere will rise next to the Westfield shopping centre. On the day they picked up their keys, they found a leaflet on the doormat advertising a public consultation for the project nearby, so they ran straight over.  “We suggested it wasn’t an appropriate development for a residential area,” says Sonmez. “But the guy just said: ‘If you don’t like noise and crowds, you shouldn’t have moved to Stratford.’ I’ve lived in east London all my life and never imagined something like this would be built here. Nobody expects a gigantic ball of light to arrive on their doorstep, no matter where they live.”  Except, perhaps, in Las Vegas. If the project looks like something airlifted from Sin City, well, that’s because it is. Despite the claim that the London sphere will be “like nothing you’ve ever experienced”, MSG is currently  building an almost identical project next to the Venetian resort in Vegas, set to open in 2023. Brainchild of MSG boss James Dolan, a major donor to Donald Trump’s campaign, the $1.8bn blob joins a fantasy land of fake canals and artificial skies. It makes a fitting addition to the world capital of glowing billboards, standing as the apogee of 360-degree advertising, the ultimate building-as-sign. It is the stuff of  Robert Venturi and Denise Scott Brown’s neon-soaked dreams.  You might argue that post-Olympics Stratford is the closest thing that London has to the anything-goes free-for-all of the Vegas Strip. Stratford High Street is now  lined with its own special gauntlet of tacky towers, some rainbow-hued by night, while the Olympic Park is no stranger to architectural whimsy. It is home to a velodrome shaped like a Pringle, a  swimming pool in the form of a chubby stingray, and an observation tower that looks like  a mangled rollercoaster. What better place to put a colossal pulsating orb, full of 21,500 concert-goers?  Right next door to the  60,000-capacity London Stadium might not be the best place, for a start. The narrow corridors of Stratford station are often congested to breaking point and have  reportedly witnessed commuters being trampled. MSG insists it will work with the stadium to avoid event clashes “where practicably possible”, but locals remain concerned. MSG have also committed to build a new entrance to Stratford station, which they say will help relieve added congestion, but campaigners argue that the concourse area is not sufficient to manage crowds exiting the sphere.  “We don’t think Stratford residents should be guinea pigs for something this huge,” says Lindsay Mace, a member of the  Stop MSG Sphere campaign group. “From the station overcrowding to increased traffic, noise and light pollution, it’s both ridiculous and obscene that this thing is even being considered.”  The immense globe has made a remarkable journey, from looking like an April Fools’ Day prank to now seeming quite likely to happen. The London Legacy Development Corporation (LLDC), the mayoral body charged with overseeing the fate of the Olympic park and its surroundings, has scheduled a planning committee date for September, where the result of  MSG’s 3,000+ page application will finally be decided. But how did it get this far?  The 1.9-hectare (4.7-acre) triangular site in question has mostly been ignored by the many Olympic legacy masterplans. It was always seen as an unpromising armpit around the back of Westfield’s car park, hemmed in by railway lines, and vaguely allocated for “town centre uses which respect the existing character, scale and massing” in the current plan. The site was publicly owned by London &amp; Continental Railways, and served as a coach park during the Olympics, before being sold to Westfield for £9m in 2015. The Australian mall owner had plans  for an indoor ski slope, enthusiastically backed by then-mayor Boris Johnson, but the idea was binned and the site sold on to MSG in 2017 for a whopping £60m.  How could a scrap of railway land have increased more than six times in value in two years, without planning permission being granted, nor a clawback mechanism put in place to capture some of that value for the public good? Was MSG given some kind of tacit assurance that their gargantuan sphere would be permitted, against the principles of the local plan?  Campaigners’ suspicions were raised further when they realised that MSG’s president of development and construction, Jayne McGivern, who has led the sphere project since 2018, was an LLDC board member from 2012 to 2016. A  freedom of information request revealed that, between 2017 and 2019, there were 33 unminuted meetings between the legacy corporation and MSG’s team, including regular private phone calls between McGivern and LLDC boss Lyn Garner.\n  An LLDC spokesperson says: “Like all local planning authorities, LLDC regularly discusses major strategic development sites with landowners, as is standard practice, works proactively with applicants to discuss development proposals and tries to resolve issues with developments prior to formal submission. The level of engagement with the applicant and other stakeholders through public consultation is entirely in keeping with the scale and complexity of this particular application.” An MSG spokesperson agreed, insisting there has never been a conflict of interest and no prior assurances were given.  The anti-sphere campaign has not been without its controversies either. In 2019, it was revealed that the “Newham Action Group”, a vocal platform against the project, was an organisation  created by a PR firm on behalf of AEG, operator of the rival O2 Arena. The Greenwich concert venue has waged an elaborate war against MSG, hiring an army of PR agencies and planning lawyers to pick apart every detail of the application. Their arsenal includes surreal videos of what the view from Sonmez and her neighbours’ flats would look like if the sphere went ahead – a  permanent Blade Runner dystopia of animated ads beamed through their windows.  If the project is approved, there will be plenty of uncharted territory to keep the lawyers busy. “Excessive displays of Christmas lights have appeared before the courts in the past in neighbours’ disputes,” says Bryan Johnston, head of property litigation at Dentons, the law firm working for AEG. “This will be one almighty Christmas display, 365 days a year.” The right to light is a well established planning principle, but  what about the right to darkness? MSG says it will put the sphere in “low luminance” mode from midnight to 6am in summer and 7am in winter – but that still means that, in the darker months, it will already be at its brightest before sunrise.  The sphere’s fate will be a litmus test of how democratic London’s decision-making process really is. Newham, the borough the site is in, is firmly against it. The council has objected on  numerous grounds, from traffic and air quality to light pollution and employment. Neighbouring Hackney is also opposed, criticising the likely “harmful ecological impact” on Lee Valley to the north. But, like the  Docklands Development Corporation which ushered in Canary Wharf in the 1980s, the largely unaccountable LLDC trumps local views. Of 12 members on the corporation’s planning committee, only five are elected local councillors. As MP for West Ham, Lyn Brown says: “Unelected members of the LLDC board and planning committee frequently outvote elected borough representatives and this has often resulted in development that fails to benefit local people. Permitting the sphere would be a betrayal of the Olympic legacy.” As the legacy corporation is soon set to be wound up, with planning powers reverting to the boroughs in 2024, is it right that they should be the arbiter of a project with such far-reaching consequences on the area?  Other opposition has been gradually diluted by a drip-feed of additional reports and mitigation strategies from MSG that purport to answer the concerns. Transport for London raised serious worries over station capacity and the danger of train drivers being distracted by the swirling LEDs, but now says it is “working constructively” so that the issues “can be effectively mitigated”. Network Rail’s objections have also been reduced. Critics point out that its chair, Sir Peter Hendy, also chairs the LLDC, and had  unminuted meetings with MSG, though there is no suggestion of impropriety.  The LLDC’s decision will ultimately be referred to the Labour mayor of London, Sadiq Khan. He was enthusiastic about welcoming “another world-class venue to the capital, to confirm London’s position as a music powerhouse” when the sphere was announced in 2018; yet the following year, his planning officers’ first report concluded that it did not comply with his own London Plan. He is in a bind. Will he side with the Labour borough and listen to the locals, or back his development corporation in the hope of using this brash bauble to buff the capital’s post-Brexit brand?\n This article was amended on 2 August 2021 to remove an incorrect suggestion in the subheading that the planning application was being fast-tracked; and to add further detail about station access", "posttime": "2021-08-03 03:03:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "伦敦,gigantic", "title": "伦敦需要一个和大本钟一样高的巨大发光球体吗？", "title_en": "Does London need a gigantic glowing orb the height of Big Ben?", "transed": 1, "url": "https://www.theguardian.com/artanddesign/2021/aug/02/msg-sphere-stratford-london-orb-madison-square-gardens", "via": "", "real_tags": ["伦敦", "gigantic"]}]