[{"category": "", "categoryclass": "", "imagename": "e59fa66066cc6b3b6b8a502581d2e90f.jpg", "infoid": 1016023, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，联邦通信委员会要求公众对特朗普政府试图惩罚社交媒体网站所谓的反保守主义偏见的行为做出回应。\nFCC主席阿吉特·派(Ajit Pai)表示：长期的规则要求该机构迅速发布此类请愿书，征求公众意见，我们在这里将遵循这一要求。\n特朗普在5月份发布了一项行政命令，指示国家电信和信息管理局(NTIA)向联邦通信委员会请愿，要求对“通信正当法”第230条做出新的解释，该条款将限制社交媒体平台在他们认为令人反感的内容被删除时，为托管第三方内容提供法律保护。\nNTIA上周提交了这份请愿书，要求FCC更广泛地定义信息内容提供商，将做出修改或更改内容的编辑决定的实体包括在内。根据这一解释，Facebook和Twitter等网站将被视为用户发布信息的发布者或代言人，当网站屏蔽和屏蔽攻击性材料时，将失去第230条提供的法律保护。在几个倡导团体工作的律师表示，联邦通信委员会没有这一权力，特朗普的请愿书与第230条的通俗语言完全不兼容，请愿书的提议将违反第一修正案。\n联邦通信委员会征求意见的公告称，感兴趣的人可以提交声明，反对或支持制定规则的请愿书。初步声明的截止日期是从今天起30天，另外将提供15天的回复时间。此处提供摘要(单击#34；新归档&#34；或&#34；Express&#34；提交评论)。\n联邦通信委员会呼吁发表评论，对特朗普政府的请愿是否应该获得批准没有任何立场。如果FCC即将发布新规则，它可能会发布拟议的规则制定通知，提出具体的建议，并向公众提出一系列问题。但现在，联邦通信委员会只是要求公众就是否应该批准NTIA的请愿书发表意见。\n派的声明称，联邦通信委员会应该欢迎激烈的辩论，但他没有承诺采取任何进一步行动来回应特朗普政府的请愿。派说：\n我强烈反对那些要求我们无视法律，剥夺公众和所有利益相关者就这一重要问题发表意见的机会。我们应该欢迎激烈的辩论，而不是排除它。美国人民应该有发言权，我们会给他们这个机会。在接下来的45天里，他们的反馈将帮助我们仔细审阅这份请愿书。\n联邦通信委员会的两名民主党人今天继续反对请愿书。社交媒体可能会让人沮丧。但是联邦通信委员会委员杰西卡·罗森沃塞尔在推特上写道，联邦通信委员会不应该成为总统的演讲警察。所以大声说出来吧。告诉联邦通信委员会大声而明确地拒绝这一要求。\n联邦通信委员会委员杰弗里·斯塔克斯也在推特上发表了意见，他写道：我相信这份公告会引发热烈的讨论。也许当有评论的时候，我们可以把整个议事日程打包，然后把它送到国会--这场辩论属于国会。\n斯塔克斯此前表示，NTIA的请愿书并没有说明国会在这方面给予FCC任何角色。第230条最好理解，因为它早已被理解：作为对法院关于何时不应施加责任的指示。\n联邦通信委员会共和党人布兰登·卡尔(Brendan Carr)在5月份行政命令发布后不久就热情赞扬了特朗普的提议。但联邦通信委员会共和党人迈克尔·里利(Michael O&39；Rielly)对特朗普的命令表示了极大的保留。\n在上周的一次演讲中，里利表示，第一修正案保护我们不受政府(而不是私人演员)对言论的限制，我们都应该以第一修正案的名义拒绝私人演员以某种方式策划或发表演讲的要求。不管你喜不喜欢，第一修正案的保护适用于公司实体，特别是当他们参与编辑决策时。\n尽管里利的声明似乎拒绝了特朗普行政命令中的立场，但里利澄清说，他的批评绝不是针对特朗普总统或白宫的那些人。特朗普和他的政府完全有权要求审查任何联邦法规的申请，其结果将受到适用的法律和宪法的保护，O&##。", "note_en": "The Federal Communications Commission today asked the public for responses to the Trump administration&#39;s  attempt to punish social media websites for alleged anti-conservative bias.\n &#34;Longstanding rules require the agency to put such petitions out for public comment &#39;promptly,&#39; and we will follow that requirement here,&#34; FCC Chairman Ajit Pai  said.\n Trump issued an  executive order in May, instructing the National Telecommunications and Information Administration (NTIA) to petition the FCC for a new interpretation of Section 230 of the Communications Decency Act that would limit social media platforms&#39; legal protections for hosting third-party content when the platforms take down content they consider objectionable.\n The NTIA  filed that petition last week, asking the FCC to define &#34;information content provider&#34; more broadly to include entities that make &#34;editorial decisions that modify or alter content.&#34; Under that interpretation, websites like Facebook and Twitter would be treated as the publisher or speaker of information posted by their users, and lose the legal protections Section 230 provides when websites block and screen offensive material. Lawyers who work at several advocacy groups  say that the FCC doesn&#39;t have this authority, that the Trump petition &#34;is utterly incompatible with the plain language&#34; of Section 230, and that the petition&#39;s proposal would violate the First Amendment.\n The FCC&#39;s  public notice asking for comments says that &#34;Interested persons may file statements opposing or supporting the Petition for Rulemaking.&#34; The deadline for initial statements is 30 days from today, and another 15 days will be provided for replies. The docket is  available here (click &#34;New Filing&#34; or &#34;Express&#34; to file a comment).\n The FCC&#39;s call for comments takes no position on whether the Trump administration petition should be approved. If the FCC were close to issuing new rules, it would likely release a Notice of Proposed Rulemaking that makes a specific proposal and asks the public a series of questions. But right now, the FCC is just asking the public to weigh in on whether the NTIA petition should be granted.\n Pai&#39;s statement said the FCC should &#34;welcome vigorous debate&#34; but he didn&#39;t commit to taking any further action in response to the Trump administration petition. Pai said:\n I strongly disagree with those who demand that we ignore the law and deny the public and all stakeholders the opportunity to weigh in on this important issue. We should welcome vigorous debate—not foreclose it. The American people deserve to have a say, and we will give them that chance. Their feedback over the next 45 days will help us as we carefully review this petition.&#34;\n  The FCC&#39;s two Democrats continued their opposition to the petition today. &#34;Social media can be frustrating. But the FCC shouldn&#39;t be the President&#39;s speech police,&#34; FCC Commissioner Jessica Rosenworcel  wrote on Twitter. &#34;So speak up. Tell the FCC to reject this loud and clear.&#34;\n FCC Commissioner Geoffrey Starks  weighed in on Twitter too, writing, &#34;I&#39;m sure this Public Notice will generate a spirited discussion. Perhaps when comments are in we can package up the whole docket and send it over to Congress—where this debate belongs.&#34;\n Starks  previously said that the NTIA petition &#34;has not made the case that Congress gave the FCC any role here. Section 230 is best understood as it has long been understood: as an instruction to courts about when liability should not be imposed.&#34;\n FCC Republican Brendan Carr  enthusiastically praised Trump&#39;s proposal shortly after the executive order came out in May. But FCC Republican Michael O&#39;Rielly has expressed &#34; deep reservations&#34; about the Trump order.\n In a  speech last week, O&#39;Rielly said that &#34;The First Amendment protects us from limits on speech imposed by the government—not private actors—and we should all reject demands, in the name of the First Amendment, for private actors to curate or publish speech in a certain way. Like it or not, the First Amendment&#39;s protections apply to corporate entities, especially when they engage in editorial decision making.&#34;\n Although O&#39;Rielly&#39;s statement would seem to reject the position taken in Trump&#39;s executive order, O&#39;Rielly clarified that his &#34;critique is not in any way directed toward President Trump or those in the White House.&#34; Trump and his administration &#34;are fully within their rights to call for the review of any federal statute&#39;s application, the result of which would be subject to applicable statutory and constitutional guardrails,&#34; O&#39;Rielly said.", "posttime": "2020-08-04 04:38:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,特朗普,seeks", "title": "FCC就特朗普试图惩罚Twitter和Facebook征求公众评论", "title_en": "FCC seeks public comment on Trump’s attempt to punish Twitter and Facebook", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/08/fcc-seeks-public-comment-on-trumps-attempt-to-punish-twitter-and-facebook/", "via": "", "real_tags": ["facebook", "特朗普", "seeks"]}, {"category": "", "categoryclass": "", "imagename": "2cdae0aa69dec07a6aa470f7dab424d3.jpg", "infoid": 1016021, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "丢失重子的问题困扰了科学家20多年。但今年早些时候，一种新的天象和尖端望远镜帮助他们找到了它。\nJ·泽维尔·普罗查斯卡著，The Conversation，Jean-Pierre MacQuart，The Talk One|发表：2020年6月4日(星期四)。\n20世纪90年代末，宇宙学家预测宇宙中应该有多少普通物质。他们估计，大约5%的物质应该是常规物质，其余的是暗物质和暗能量的混合物。但是，当宇宙学家计算出他们当时所能看到或测量到的所有东西时，他们都做不到。增加了很多。\n宇宙学家测量到的所有普通物质的总和，加起来只是宇宙中理应存在的5%的一半左右。\n这就是众所周知的“丢失重子问题”，20多年来，像我们这样的宇宙学家一直在努力寻找这个问题，但没有成功。\n这需要发现一种新的天象和全新的望远镜技术，但今年早些时候，我们的团队终于找到了失踪的物质。\n重子是对粒子类型的一种分类-某种程度上是一个总括的术语-包括质子和中子，这是宇宙中所有普通物质的基石。元素周期表上的所有东西，以及你认为是“物质”的几乎所有东西都是由重子组成的。\n自20世纪70年代末以来，宇宙学家一直怀疑暗物质-一种至今仍未知的物质，必须存在才能解释太空中的引力模式-构成了宇宙的大部分物质，其余的是重子物质，但他们不知道确切的比例。1997年，来自加州大学圣地亚哥分校的三名科学家利用重氢原子核(加一个额外的中子的氢)与正常氢的比率来估计重子应该占宇宙质量能量预算的5%左右。\n然而，当出版物上的墨水还在干燥时，另三位宇宙学家升起了一面鲜艳的红旗。他们报告说，通过对恒星、星系及其内部和周围气体的普查，对我们现在宇宙中重子的直接测量加起来只有预测的5%的一半。\n这引发了丢失重子的问题。如果自然规律认为物质既不能创造也不能毁灭，有两种可能的解释：一种是物质不存在，数学错误，另一种是物质藏在外面的某个地方。\n全球的天文学家开始了搜索，一年后理论宇宙学家提供了第一条线索。他们的计算机模拟预测，大多数失踪的物质隐藏在弥漫宇宙的低密度、百万度的高温等离子体中。这被称为“温热星际介质”，绰号为“突发奇想”。这个奇想，如果存在的话，将会解决丢失的重子问题，但是当时还没有办法证实它的存在。\n2001年，另一项支持这一突发奇想的证据出现了。第二个研究小组通过观察宇宙微波背景中的微小温度波动--基本上是大爆炸遗留下来的辐射--证实了重子占宇宙5%的初步预测。在两次单独确认这个数字的情况下，数学必须是正确的，突发奇想似乎就是答案。现在宇宙学家只需要找到这种看不见的等离子体。\n在过去的20年里，我们和其他许多宇宙学家和天文学家团队几乎把地球上所有最伟大的天文台都带到了狩猎中。有一些错误的警报和温热气体的试探性探测，但我们的一个团队最终将这些与星系周围的气体联系起来。如果心血来潮真的存在，那就是太模糊、太分散了，无法察觉。\nJ·泽维尔·普罗查斯卡(加州大学圣克鲁斯分校)，杰伊·奇蒂迪(玛丽亚·米切尔天文台)和亚历山德拉·曼宁斯(加州大学圣克鲁斯分校)。\n2007年，一个完全意想不到的机会出现了。西弗吉尼亚大学的天文学家邓肯·洛里默报告了一种被称为快速射电爆发(FRB)的宇宙学现象的偶然发现。FRB是极其短暂、能量极高的射电发射脉冲。宇宙学家和天文学家仍然不知道是什么创造了它们，但它们似乎来自很远很远的星系。\n当这些辐射爆发穿过宇宙，穿过气体和理论上的冲动时，它们会经历一种叫做色散的东西。\n这些FRB最初神秘的原因持续了不到千分之一秒，所有的波长都是从一个紧密的团块开始的。如果有人足够幸运--或者足够不幸--在产生FRB的地点附近，所有的波长都会同时击中他们。\n但当无线电波穿过物质时，它们会短暂减速。波长越长，无线电波就越“感觉”到问题。把它想象成风阻。较大的汽车比较小的汽车感觉到更大的风阻。\n无线电波的“风阻”效应小得令人难以置信，但空间却很大。当FRB穿越数百万光年或数十亿光年到达地球时，色散已经大大减缓了较长波长的速度，以至于它们到达的时间比较短波长晚了近一秒。\n其中蕴藏着FRB称重宇宙重子的潜力，这是我们当场认识到的一个机会。通过测量一个FRB内不同波长的扩散，我们可以准确地计算出无线电波在返回地球的途中通过了多少物质-多少重子。\n在这一点上，我们非常接近，但还有最后一条我们需要的信息。为了精确测量重子密度，我们需要知道FRB在天空中从哪里来。如果我们知道源星系，我们就会知道无线电波传播了多远。有了这一点和他们经历的弥散量，也许我们可以计算出他们在前往地球的途中通过了多少物质？\n不幸的是，2007年的望远镜不够好，不能准确定位FRB来自哪个星系--因此也就是多远。\n我们知道什么信息可以让我们解决问题，现在我们只需要等待技术发展到足以给我们提供数据。\n我们花了11年时间才能够放置-或本地化-我们的第一个FRB。2018年8月，我们名为Craft的合作项目开始使用位于西澳大利亚内陆的澳大利亚平方公里阵列探路器(ASKAP)射电望远镜来寻找FRB。这架由澳大利亚国家科学机构CSIRO运营的新望远镜可以观测到大片天空，大约是满月大小的60倍，它可以同时探测FRB并精确定位它们来自天空的位置。\n一个月后，ASKAP捕获了它的第一个FRB。一旦我们知道了无线电波来自天空的确切位置，我们就迅速使用夏威夷的凯克望远镜来确定FRB来自哪个星系，以及那个星系有多远。如果你想知道的话，我们探测到的第一颗星系团来自一个名为DES J214425.25-405400.81的星系，该星系距离地球约40光年。\n这项技术和技巧奏效了。我们测量了FRB的色散，知道它来自哪里。但我们需要捕获更多的重子，以获得统计上有意义的重子计数。所以我们等待着，希望太空能给我们送来更多的FRB。\n到2019年7月中旬，我们又检测到了五起事件-足以对失踪物质进行第一次搜索。使用这六个FRB的色散测量，我们可以粗略地计算出无线电波在到达地球之前通过了多少物质。\n当我们看到数据正好落在5%的预估曲线上时，我们既感到惊讶，又感到放心。我们完全探测到了丢失的重子，解开了这个宇宙之谜，结束了长达20年的搜索。\n然而，这一结果只是第一步。我们能够估计出重子的数量，但由于只有6个数据点，我们还不能建立丢失的重子的全面地图。我们有证据证明这个心血来潮可能存在，并确认了有多少，但我们不知道它是如何传播的。它被认为是连接星系的巨大丝状气体网络的一部分，该网络被称为“宇宙网”，但有了大约100次快速射电爆发，宇宙学家就可以开始构建这张网的精确地图了。\n这篇文章被更新，以表明澳大利亚国家科学机构CSIRO运营着这台新望远镜。\n加州大学圣克鲁斯分校天文学和天体物理学教授J·泽维尔·普罗查斯卡接受国家科学基金会的资助。\n让-皮埃尔·麦夸特，科廷大学天体物理学副教授，接受澳大利亚研究理事会的资助。\n[洞察力，每天都在你的收件箱里。您可以通过对话的电子邮件时事通讯获取。]", "note_en": "The &#34;missing baryon problem&#34; plagued scientists for over 20 years. But a new celestial phenomenon and cutting-edge telescopes helped them find it earlier this year.\n By \r  J Xavier Prochaska, The Conversation,  Jean-Pierre Macquart, The Conversation  |  \r Published: Thursday, June 4, 2020\n  In the late 1990s, cosmologists made a prediction about how much ordinary matter there should be in the universe. About 5%, they estimated, should be regular stuff with the rest a mixture of dark matter and dark energy. But when cosmologists counted up everything they could see or measure at the time, they came up short. By a lot.\n  The sum of all the ordinary matter that cosmologists measured only added up to about half of the 5% what was supposed to be in the universe.\n  This is known as the “missing baryon problem” and for over 20 years,  cosmologists  like us looked hard for this matter without success.\n  It took the discovery of a new celestial phenomenon and entirely new telescope technology, but earlier this year, our team  finally found the missing matter.\n    Baryon is a classification for types of particles – sort of an umbrella term – that encompasses protons and neutrons, the building blocks of all the ordinary matter in the universe. Everything on the periodic table and pretty much anything that you think of as “stuff” is made of baryons.\n  Since the late 1970s, cosmologists have suspected that dark matter – an as of yet unknown type of matter that must exist to explain the gravitational patterns in space –  makes up most of the matter of the universe with the rest being baryonic matter, but they didn’t know the exact ratios. In 1997, three scientists from the University of California, San Diego, used the ratio of heavy hydrogen nuclei – hydrogen with an extra neutron – to normal hydrogen to estimate that  baryons should make up about 5% of the mass-energy budget of the universe.\n  Yet while the ink was still drying on the publication, another trio of cosmologists raised a bright red flag. They reported that a direct measure of baryons in our present universe – determined through a census of stars, galaxies, and the gas within and around them – added up to only  half of the predicted 5%.\n  This sparked the missing baryon problem. Provided the law of nature held that matter can be neither created nor destroyed, there were two possible explanations: Either the matter didn’t exist and the math was wrong, or, the matter was out there hiding somewhere.\n Astronomers across the globe took up the search and the first clue came a year later from theoretical cosmologists. Their computer simulations predicted that the majority of the missing matter was hiding in a  low-density, million-degree hot plasma that permeated the universe. This was termed the “warm-hot intergalactic medium” and nicknamed “the WHIM.” The WHIM, if it existed, would solve the missing baryon problem but at the time there was no way to confirm its existence.\n  In 2001, another piece of evidence in favor of the WHIM emerged. A second team confirmed the initial prediction of baryons making up 5% of the universe by looking at tiny  temperature fluctuations in the universe’s  cosmic microwave background – essentially the leftover radiation from the Big Bang. With two separate confirmations of this number, the math had to be right and the WHIM seemed to be the answer. Now cosmologists just had to find this invisible plasma.\n  Over the past 20 years, we and many other teams of cosmologists and astronomers have brought nearly all of the Earth’s greatest observatories to the hunt. There were some false alarms and  tentative detections of warm-hot gas, but one of our teams eventually linked those to  gas around galaxies. If the WHIM existed, it was too faint and diffuse to detect.\n J. Xavier Prochaska (UC Santa Cruz), Jay Chittidi (Maria Mitchell Observatory) and Alexandra Mannings (UC Santa Cruz)\n In 2007, an entirely unanticipated opportunity appeared.  Duncan Lorimer, an astronomer at the University of West Virginia, reported the serendipitous discovery of a cosmological phenomenon known as a  fast radio burst (FRB). FRBs are extremely brief, highly energetic pulses of radio emissions. Cosmologists and astronomers still don’t know what creates them, but they seem to come from galaxies far, far away.\n  As these bursts of radiation traverse the universe and pass through gasses and the theorized WHIM, they undergo something called  dispersion.\n  The initial mysterious cause of these FRBs lasts for less a thousandth of a second and all the wavelengths start out in a tight clump. If someone was lucky enough – or unlucky enough – to be near the spot where an FRB was produced, all the wavelengths would hit them simultaneously.\n  But when radio waves pass through matter, they are briefly slowed down. The longer the wavelength, the more a radio wave “feels” the matter. Think of it like wind resistance. A bigger car feels more wind resistance than a smaller car.\n  The “wind resistance” effect on radio waves is incredibly small, but space is big. By the time an FRB has traveled millions or billions of light-years to reach Earth, dispersion has slowed the longer wavelengths so much that they arrive nearly a second later than the shorter wavelengths.\n Therein lay the potential of FRBs to weigh the universe’s baryons, an opportunity we recognized on the spot. By measuring the spread of different wavelengths within one FRB, we could calculate exactly how much matter – how many baryons – the radio waves passed through on their way to Earth.\n  At this point we were so close, but there was one final piece of information we needed. To precisely measure the baryon density, we needed to know where in the sky an FRB came from. If we knew the source galaxy, we would know how far the radio waves traveled. With that and the amount of dispersion they experienced, perhaps we could calculate how much matter they passed through on the way to Earth?\n  Unfortunately, the telescopes in  2007 weren’t good enough to pinpoint exactly which galaxy – and therefore how far away – an FRB came from.\n  We knew what information would allow us to solve the problem, now we just had to wait for technology to develop enough to give us that data.\n    It was 11 years until we were able to place – or localize – our first FRB. In August 2018, our collaborative project called  CRAFT began using the  Australian Square Kilometre Array Pathfinder (ASKAP) radio telescope in the outback of Western Australia to look for FRBs. This new telescope – which is run by Australia’s national science agency,  CSIRO – can watch huge portions of the sky, about 60 times the size of a full Moon, and it can simultaneously detect FRBs and pinpoint where in the sky they come from.\n  ASKAP captured its  first FRB one month later. Once we knew the precise part of the sky the radio waves came from, we quickly used the  Keck telescope in Hawaii to identify which galaxy the FRB came from and how far away that galaxy was. The first FRB we detected came from a galaxy named  DES J214425.25–405400.81 that is about 4 billion light-years away from Earth, in case you were wondering.\n  The technology and technique worked. We had measured the dispersion from an FRB and knew where it came from. But we needed to catch a few more of them in order to attain a statistically significant count of the baryons. So we waited and hoped space would send us some more FRBs.\n  By mid-July 2019, we had detected five more events – enough to perform the first search for the missing matter. Using the dispersion measures of these six FRBs, we were able to make a rough calculation of how much matter the radio waves passed through before reaching earth.\n  We were overcome by both amazement and reassurance the moment we saw the  data fall right on the curve predicted by the 5% estimate. We had detected the missing baryons in full, solving this cosmological riddle and putting to rest two decades of searching.\n This result, however, is only the first step. We were able to estimate the amount of baryons, but with only six data points, we can’t yet build a comprehensive map of the missing baryons. We have proof the WHIM likely exists and have confirmed how much there is, but we don’t know exactly how it is distributed. It is believed to be part of a vast filamentary network of gas that connects galaxies termed “ the cosmic web,” but with about 100 fast radio bursts cosmologists could start building an accurate map of this web.\n    This article was updated to indicate that Australia’s national science agency, CSIRO, operates the new telescope.\n  J. Xavier Prochaska, Professor of Astronomy &amp; Astrophysics at the University of California, Santa Cruz, receives funding from the National Science Foundation.\n    Jean-Pierre Macquart, Associate Professor of Astrophysics at Curtin University, receives funding from the Australian Research Council.\n  [ Insight, in your inbox each day.  You can get it with The Conversation’s email newsletter.]", "posttime": "2020-08-04 04:36:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解决,solve,重子", "title": "天文学家解决了丢失的重子问题", "title_en": "Astronomers solve the missing baryon problem", "transed": 1, "url": "https://astronomy.com/news/2020/06/half-the-matter-in-the-cosmos-was-missing-but-astronomers-found-it", "via": "", "real_tags": ["解决", "solve", "重子"]}, {"category": "", "categoryclass": "", "imagename": "94f931bdebbc95d79152e9d77c0dce5d.jpg", "infoid": 1016020, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个非常简单的迷宫不知何故对RCT2中的客人来说几乎是不可能的。在这段视频中，我们将找出原因。加入我的不和谐服务器：https://discord.gg/TP8EGQG Jo...", "note_en": "This very easy maze is somehow nearly impossible for the guests in RCT2. In this video we find out why. Join my Discord server: https://discord.gg/TP8EGQG Jo...", "posttime": "2020-08-04 04:36:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "大亨,complete,https", "title": "乘坐过山车大亨2需要10^20k年才能完成的游乐设施[视频]", "title_en": "A ride that takes 10^20k years to complete in Roller Coaster Tycoon 2 [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=KVgoy_a_gWI", "via": "", "real_tags": ["大亨", "complete", "https"]}, {"category": "", "categoryclass": "", "imagename": "b451a6d1afc8f6f7532c08c30bac4b88.jpeg", "infoid": 1016019, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "华盛顿(路透社)-美国联邦航空管理局(Federal Aviation Administration)周一表示，正在提议要求波音737 Max做出四项关键的设计更改，以解决2019年3月导致346人死亡并导致飞机停飞的两起坠机事件中出现的安全问题。\n该机构正在发布一项拟议的适航指令，要求更新飞行控制软件，修改显示处理软件以生成警报，修改某些机组人员的操作程序，并改变一些布线捆绑的路线。\n这一声明意义重大，但仍有其他重要步骤，包括敲定飞行员培训程序，这些步骤必须在波音737 MAX恢复飞行之前完成。公众有45天的时间对这些变化发表评论，目前仍不清楚航班是否会在2020年底之前恢复。\n美国联邦航空局在周一发布的另一份96页的报告中表示，在这两起致命坠机事件中，波音对737 Max设计、机组人员程序和维护程序的拟议修改有效地缓解了与飞机相关的安全问题。适航指令寻求要求波音公司做出改变。\n美国联邦航空局表示，这些变化将“对飞行员行动和任何潜在单一故障的影响的依赖性降至最低”。\n一度最畅销的波音737 Max停飞危机已导致这家美国飞机制造商损失超过190亿美元，大幅减产，并阻碍了其供应链，刑事和国会调查仍在进行中。\n联邦航空局的广泛审查耗时超过18个月，包括40多名工程师、检查员、飞行员和技术支持人员的全职工作。到目前为止，联邦航空局已经进行了超过6万小时的审查、认证测试和文件评估。\n该机构还建议737 MAX操作员进行攻角(AOA)传感器系统测试，并在每架飞机恢复服务之前进行作战准备飞行。\n这些变化旨在防止与这两起坠机事件相关的关键系统MCAS的错误激活，如果两个AOA传感器接收到冲突的数据，则向飞行员发出警报，并确保机组人员可以识别并响应错误的稳定器移动。\n线路的改变将确保MAX符合美国联邦航空局的线路分离安全标准。", "note_en": "WASHINGTON (Reuters) - The Federal Aviation Administration said on Monday it is proposing requiring four key Boeing 737 MAX design changes to address safety issues seen in two crashes that killed 346 people and led to the plane’s grounding in March 2019.\n  The agency is issuing a proposed airworthiness directive to require updated flight-control software, revised display-processing software to generate alerts, revising certain flight-crew operating procedures, and changing the routing of some wiring bundles.\n The announcement is significant but there are still other major steps, including finalizing pilot-training procedures, that must be completed before the 737 MAX can resume flights. The public has 45 days to comment on the changes and it is still unclear if flights will resume before the end of 2020.\n The FAA said in a separate 96-page report released on Monday that it “has preliminarily determined that Boeing’s proposed changes to the 737 MAX design, flightcrew procedures and maintenance procedures effectively mitigate the airplane-related safety issues” in the two fatal crashes. The airworthiness directive seeks to require Boeing changes.\n The FAA said the changes minimize “dependence on pilot action and the effect of any potential single failure.”\n The crisis over the grounding of the once top-selling 737 MAX has cost the U.S. planemaker more than $19 billion, slashed production and hobbled its supply chain, with criminal and congressional investigations still ongoing.\n The FAA’s extensive review has taken more than 18 months and included the full-time work of more than 40 engineers, inspectors, pilots, and technical support staff. To date, the FAA has conducted more than 60,000 hours of review, certification testing, and document evaluation.\n The agency is also proposing that 737 MAX operators conduct an Angle of Attack (AOA) sensor system test and perform an operational readiness flight prior to returning each airplane to service.\n The changes are designed to prevent the erroneous activation of a key system known as MCAS tied to both crashes, to alert pilots if two AOA sensors are receiving conflicting data and to ensure flightcrew can recognize and respond to erroneous stabilizer movement.\n The wiring change will ensure the MAX complies with the FAA’s wire separation safety standards.", "posttime": "2020-08-04 04:36:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,美国,proposes,飞行员", "title": "美国联邦航空局提议要求关键的波音737 MAX设计更改", "title_en": "U.S. FAA proposes requiring key Boeing 737 MAX design changes", "transed": 1, "url": "https://www.reuters.com/article/us-boeing-737max-idUSKCN24Z2HK", "via": "", "real_tags": ["设计", "美国", "proposes", "飞行员"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016017, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "纪录片披露的证据证实了一名英国间谍在1953年恢复国王的过程中所扮演的角色-以及《观察家报》是如何揭露这一阴谋的。\n自1985年《观察家报》的一篇新闻报道被压制以来，一名领导永久改变中东地区的政变的英国特勤局官员的隐藏角色将首次被披露。\n这份标题为“军情六处和中央情报局如何联手策划伊朗政变”的报道出现在5月26日版上，但很快就被平息了。它揭露了这样一个事实，军情六处的一名男子诺曼·达比希尔(Norman Darbyshire)在1953年进行了一次秘密而暴力的行动，以恢复伊朗国王作为国家统治者的地位。然而，就在报纸出版几天后，所有关于这一英国行动和达比郡身份的新证据都从公众辩论中消失了。\n本周末，电影制作人Taghi Amirani在他的纪录片“政变53”上映之前表示：“我们仍然不知道是谁最初将这一消息泄露给了”观察家报“，或者是为什么。”“我们只知道达比郡的采访记录很快就消失了，没有人跟进这件事。到今天为止，这有点像是完全掩盖了英国的参与。“。\n1953年政变的背景长期以来一直是国际怀疑和猜测的原因。英国首相温斯顿·丘吉尔(Winston Churchill)反对该国第一位民主党领袖穆罕默德·莫萨德(Mohammad Mossadegh)的统治，很大程度上是因为这威胁到了英国在伊朗石油行业的利益。与美国中央情报局(CIA)合作，后者也希望看到沙雷扎·巴列维(Shah Reza Pahlavi)重新登上王位，现在很明显，军情六处所做的不仅仅是煽动推翻莫萨德。\n今年6月，在华盛顿的一个档案中发现的文件显示，在政变之前，女王伊丽莎白二世的名字是如何被错误地用来说服国王留在伊朗的。53号政变现在清楚地表明，英国人正在策划一场起义，甚至绑架、折磨并付钱让抗议者走上德黑兰街头。\n政变53是在8月19日，也就是政变67周年纪念日发布的，此前英裔伊朗导演阿米拉尼(Amirani)进行了调查。与沃尔特·默奇(Walter Murch)合作，阿米拉尼深入研究了档案，并采访了许多参与其中的人。默奇是“对话”、“现在的启示录”和“英国病人”等电影的广受好评的编辑。\n默奇说：“当我们开始拍摄这部电影时，我们对达比郡的谜团或关于这个谜团的谜团一无所知。”“这些都不在我们的雷达范围内。田地在我们前进的过程中发现了一些事情。惊险元素不是我们模板的一部分，我们的模板是回顾未见过的采访。这是我处理过的最多的素材--532个小时--是我现在处理的“启示录”的两倍多。“\n转折点是，阿米拉尼在为20世纪80年代中期具有里程碑意义的格拉纳达(Granada)纪录片系列进行的废弃研究中发现了关键证据，这部纪录片讲述的是帝国末日。一段关于伊朗的插曲的文字记录最初包含了对达比郡的采访，达比郡坦率地发表了讲话。\n“我的简报非常简单，”达比希尔说。“去那里，不要通知大使，利用情报机构获取任何你可能需要的资金，以确保通过合法或准合法的手段推翻摩萨德。”军情六处官员接着解释说，他花了“大量的钱，远远超过150万英镑”，并补充说，“我亲自下达了命令，指挥了街头起义。”\n然而，爆炸性的采访镜头从未播出。在阿米拉尼的电影中，达比郡的角色由拉尔夫·费因斯(Ralph Fiennes)扮演，他传递了被审查的格拉纳达剧本中的台词。1985年，记者奈杰尔·霍克斯(Nigel Hawkes)在第四频道(Channel 4)播出伊朗事件之前发表了这篇观察家的文章。\n但当节目播出时，达比郡和他的证词都缺席了。一周后，观察家评论家朱利安·巴恩斯(Julian Barnes)在电视评论中没有提到故事的这一部分。阿米拉尼、默奇和他们咨询过的情报专家现在得出结论，政府在私人放映后介入，阻止制片人使用达比郡的采访。包括当时由唐纳德·特雷福德(Donald Trelford)编辑的“观察家报”在内的报纸也将被告知，使用一项被称为D通知的州条款，不能再继续报道这件事。\n达比郡与中央情报局(CIA)同行斯蒂芬·米德(Stephen Meade)密切合作，后者也从“帝国”纪录片的结尾被删减。他将他的英国同事描述为“一个非常有能力的人，波斯语说得像法语一样流利”。\n也许53政变中最令人震惊的证据与英国绑架并最终“意外”杀害伊朗警察局长马哈茂德·阿夫沙图斯有关。这一事件故意挑起动乱，导致摩萨德在8月份被捕入狱。\n在丢失的视频中，达比郡声称他“对波斯暴徒角色进行了正确的心理解读”，但他理解他们“有一种感觉，从1920年开始，他们就被搞砸了，这是理所当然的”。\n达比郡于1993年去世，前格拉纳达研究员艾莉森·鲁珀和她的制片人/导演马克·安德森告诉阿米拉尼，他们对采访军情六处官员或视频发生了什么没有清晰的记忆。\n流亡意大利的国王飞回伊朗，当时由中央情报局(CIA)和军情六处(MI6)批准的法兹洛拉·扎赫迪将军(General Fazlollah Zahedi)统治。在美国，这场政变被称为“阿贾克斯行动”，而在英国，它被称为“靴子行动”。国王统治这个国家，直到1979年的伊斯兰革命。\n“这场政变不仅塑造了西方与伊朗长达60年的关系，也改变了中东地区。想象一下，如果那里有民主，“阿米拉尼说。\n·本文于2020年8月2日修改。早些时候的一个版本说斯蒂芬·米德出现在“帝国末日”中，但没有说他被从纪录片中删掉了。", "note_en": "Documentary reveals evidence confirming a British spy’s role in restoring the Shah in 1953 – and how the Observer exposed the plot\n   T he hidden role of a British secret service officer who led the coup that permanently altered the Middle East is to be revealed for the first time since an  Observer news story was suppressed in 1985.\n The report, headlined “How MI6 and CIA joined forces to plot Iran coup”, appeared in the 26 May edition but was swiftly quashed. It exposed the fact that an MI6 man, Norman Darbyshire, had run a covert and violent operation to reinstate the Shah of Iran as ruler of the country in 1953. Yet just a few days after the newspaper came out, all fresh evidence of this British operation and of Darbyshire’s identity disappeared from public debate.\n  “We still do not know who leaked this to the  Observer originally, or why,” said film-maker Taghi Amirani this weekend, ahead of the release of his documentary,  Coup 53. “We only know that any record of the interview with Darbyshire quickly disappeared and no one followed up the story. It smacks of a complete cover-up of British involvement to this day.”\n The background to the 1953 coup d’etat has long been the cause of international suspicion and conjecture. Prime Minister Winston Churchill opposed the rule of the country’s first democratic leader, Mohammad Mossadegh, largely because it threatened Britain’s interests in Iran’s oil industry. Working with the CIA, who also hoped to see the Shah Reza Pahlavi back on the throne, it is now clear that MI6 did much more than agitate for Mossadegh to be overthrown.\n In June, documents found in a Washington archive showed how  Queen Elizabeth II’s name was mistakenly used to persuade the Shah to stay in Iran prior to the coup.  Coup 53 now makes a clear case that the British were orchestrating an uprising, going as far as kidnapping, torturing and paying for protesters to go out on to the streets of Tehran.\n Coup 53, released on 19 August, the 67th anniversary of the coup, follows the investigations of Anglo-Iranian director Amirani. Working with Walter Murch, the acclaimed editor of films such as  The Conversation,  Apocalypse Now and  The English Patient, Amirani delves into the archives and interviews many of those involved.\n  “We knew nothing of the Darbyshire mystery, or of the mystery about that mystery, when we started making this film,” said Murch. “None of this was on our radar. Taghi discovered things as we went along. The thriller element was not part of our template, which was to look back at unseen interviews. This was the most material I have ever had to work with – 532 hours – more than double what I handled on  Apocalypse Now.”\n The turning point was when Amirani found key evidence in abandoned research carried out for a landmark Granada documentary series of the mid-1980s,  End of Empire. A transcript of an episode about Iran originally contained an interview with Darbyshire, who spoke candidly.\n “My brief was very simple,” says Darbyshire. “Go out there, don’t inform the ambassador, and use the intelligence service for any money you might need to secure the overthrow of Mossadegh by legal or quasi-legal means.” The MI6 officer goes on to explain he spent “vast sums of money, well over a million-and-a-half pounds”, adding, “I was personally giving orders and directing the street uprising.”\n Yet the explosive interview footage was never broadcast. In Amirani’s film, the part of Darbyshire is played by Ralph Fiennes, who delivers lines from the censored Granada transcript. The 1985  Observer article by reporter Nigel Hawkes was published just before the Iranian episode was shown by Channel 4.\n  But when the programme went out, Darbyshire and his testimony were absent. A TV review a week later by  Observer critic Julian Barnes made no mention of this part of the story. Amirani, Murch and the intelligence experts they have consulted now conclude the government stepped in after a private screening, preventing the producers from using the Darbyshire interview. Newspapers, including the  Observer, edited at the time by Donald Trelford, would also have been told to go no further with the story, using a state provision known as a D Notice.\n Darbyshire worked closely with a CIA counterpart, Stephen Meade, who was also cut from the  End of Empire documentary. He describes his British colleague as “a very competent individual who spoke Farsi fluently as well as French”.\n Perhaps the most shocking evidence in  Coup 53 concerns British guilt in the kidnapping and eventual “accidental” killing of the Iranian police chief Mahmoud Afshartous. This incident deliberately provoked the unrest that led to the arrest and imprisonment of Mossadegh in August.\n In the lost footage, Darbyshire claims he made “the correct psychological reading of the Persian mob character”, but that he understood that they “had the feeling they were being screwed, and rightly so, from 1920 onwards”.\n Darbyshire died in 1993, and former Granada researcher Alison Rooper, who worked on  End of Empire, together with her producer/director Mark Anderson, tell Amirani they have no clear memory of interviewing the MI6 officer or of what happened to the footage.\n The shah, who had been living in exile in Italy, flew back to Iran, then governed by CIA- and MI6-approved General Fazlollah Zahedi. In America, the coup was known as Operation Ajax, while in Britain it was Operation Boots. The shah ruled the country until the Islamic revolution of 1979.\n “This coup shaped not only western relations with Iran for 60 years, but changed the Middle East. Imagine if there had been a democracy there,” said Amirani.\n • This article was amended on 2 August 2020. An earlier version said that Stephen Meade appeared in End of Empire, but omitted to say that he was cut from the documentary.", "posttime": "2020-08-04 04:35:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "中东,coup,伊朗", "title": "军情六处，改变中东的伊朗政变和掩盖", "title_en": "MI6, the coup in Iran that changed the Middle East, and the cover-up", "transed": 1, "url": "https://www.theguardian.com/world/2020/aug/02/mi6-the-coup-in-iran-that-changed-the-middle-east-and-the-cover-up", "via": "", "real_tags": ["中东", "coup", "伊朗"]}, {"category": "", "categoryclass": "", "imagename": "b33bd69d01b3f38faf55293eb0d2026b.jpeg", "infoid": 1016016, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我没有想到我会爱上2021年保时捷911 Turbo S的前灯。毕竟，这是一辆拥有640马力的汽车，在2.6秒内从0加速到60英里，最高时速为205英里。我想我会对它感兴趣的主要原因是这些原因，在任何情况下都是相当可靠的积极因素。但这辆特殊的Turbo S前面挂着德国车牌，挡风玻璃上贴着德国注册标签。如今，美国市场的汽车和目的地是欧洲的汽车通常没有太大区别，但欧洲Turbo S包括一个我们这里禁止的主要功能：LED矩阵前大灯。现在我完全被我们愚蠢的旧灯给毁了，因为我真的看到了光。我们不能拥有它。\n每一个911&#39；的照明单元都包括84个单独控制的LED，使汽车可以连续地改变其光束的图案。当一辆车在迎面而来的车道上接近时，911&#39；的前灯在它周围变暗，而其余的图案则保持明亮。另一位司机没有失明，但你的一侧仍然有耀眼的灯光。这是一个令人叹为观止的奇迹。在夜间驾驶TurboS期间，我从来没有让另一个司机恼火地向我挥舞着远光灯-有时这种情况发生在只有明亮LED近光灯的汽车上。如果肩膀上的路标反射过度，保时捷的右侧也会变暗。有时，你会看到灯光经历了两个截然不同的变暗阶段，这说明了它们在最大瓦数下有多么耀眼的亮度。所有168个LED都亮着，你感觉就像可以看到四分之一英里外的路。也许你可以。\n保时捷的自适应车灯显然是对美国规定的简单的远光或近光设置的重大改进。那么，为什么你可以在慕尼黑买到，而在密尔沃基买不到呢？争论的焦点是联邦机动车安全标准第108号，该标准自1967年以来就定义了我们的前灯。FMVSS108还制定了只定义远光灯和近光灯的规则，因为当时我们还没有威利·旺卡(Willy Wonka)的前照灯，可以侧向、倾斜、纵向和反向。\n历史爱好者会注意到1967年是很久以前的事了，从那时起，汽车前路照明领域发生了一些变化。但这条规则仍然存在，原因很简单，那就是很难让所有参与其中的人就下一步应该做什么达成一致。然而，还是有希望的。丰田已经向NHTSA请愿，要求改变规则，允许自适应前灯系统。2018年，这一过程似乎正在悄悄推进，当时正是制造商可以发表评论的阶段(斯巴鲁指出，美国国家公路交通安全管理局(NHTSA)指的是测试的药水，因为它意味着部分，我们尊重他们对细节的关注--斜杠--琐碎)。但是，令人大吃一惊的是，还没有更新的规则最终敲定。这就是为什么我们仍然停留在高光束和低光束，而没有中间光束的原因。\n此内容是从YouTube导入的。您可以在他们的网站上找到不同格式的相同内容，也可以找到更多信息。\n我有一个快速审批新规则的解决方案。它包括在美国国家公路交通安全局(NHTSA)停飞一架911 Turbo S，为期一到两周，你知道，测量之类的。做你想在世界上看到的改变吧，保时捷。也许在前灯的事情摆好之后，我们可以和他们谈谈我对高速公路车道的想法。\n此内容由第三方创建和维护，并导入到此页面以帮助用户提供其电子邮件地址。您可以在piano.io上找到有关此内容和类似内容的更多信息。\n此评论区由第三方创建和维护，并导入到此页面。你可以在他们的网站上找到更多信息。", "note_en": "I didn&#39;t figure I&#39;d fall in love with the  2021 Porsche 911 Turbo S for its headlights. This, after all, is a car that has 640 horsepower, does zero to 60 in 2.6 seconds, and tops out at 205 mph. I figured I&#39;d be into it for mostly those reasons, which are pretty solid positives in any context. But this particular Turbo S wore a German plate up front and carried a German registration decal on the windshield. These days, there isn&#39;t usually much difference between a U.S.-market car and one destined for Europe, but the European Turbo S includes a major feature forbidden to us here: LED matrix headlights. Now I&#39;m totally ruined for our dumb old lamps, for I have literally seen the light. And we can&#39;t have it.\n  Each of the 911&#39;s lighting units includes 84 individually controlled LEDs that allow the car to continuously morph the pattern of its beams. When a car approaches in the oncoming lane, the 911&#39;s headlights dim around it while leaving the rest of the pattern bright. The other driver doesn&#39;t get blinded, but you still have blazing lights on your side. It&#39;s a wonder to behold. During nighttime drives in the Turbo S, I never had another driver flick their high-beams at me in annoyance—which sometimes happens with cars that simply have bright LED low-beams. The Porsche would also dim the right side if road signs on the shoulder were overly reflective. Sometimes, you&#39;d see the lights go through two distinct dimming phases, which illustrates how blazingly bright they are at max wattage. With all 168 LEDs at full blaze, you feel like you can see a quarter-mile down the road. And maybe you can.\n  Porsche&#39;s adaptive lights are clearly a major improvement over the simple high-beam or low-beam setup mandated for the U.S. So why can you get them in Munich but not Milwaukee? At issue is Federal Motor Vehicle Safety Standard No. 108, which has defined our headlights since 1967. And  ol&#39; FMVSS 108 set out rules that only defined high-beams and low-beams, because back then we didn&#39;t have Willy Wonka headlights that can go sideways, and slantways, and longways, and backways.\n History buffs will note that 1967 was a long time ago, and since then a few things have changed in the realm of vehicular forward-roadway illumination. But the rule remains in place for the simple reason that it&#39;s really hard to get everyone involved to agree on what should come next. There is hope, however. Toyota has petitioned NHTSA to change the rule, allowing adaptive headlight systems. And it looked like that process was  grinding forward in 2018, when it was in the phase where manufacturers could weigh in with comments (Subaru pointed out that NHTSA referred to a &#34;potion&#34; of a test when it meant &#34;portion,&#34; and we respect their attention to detail-slash-pettiness.) But, big surprise, no updated rule has been finalized. And that&#39;s why we&#39;re still stuck with high-beams and low-beams and no in-between-beams.\n This content is imported from YouTube. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n  I have a solution to fast-track approval of the new rule. It involves dropping a certain 911 Turbo S at NHTSA for a week or two for, you know, measurements and whatnot. Be the change you want to see in the world, Porsche. And maybe after the headlight thing is squared away, we can talk to them about my idea for the Autobahn Lane.\n  This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io\n   This commenting section is created and maintained by a third party, and imported onto this page. You may be able to find more information on their web site.", "posttime": "2020-08-04 04:10:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,stuck,汽车", "title": "为什么美国要忍受糟糕的前灯？", "title_en": "Why is America stuck with bad headlights?", "transed": 1, "url": "https://www.caranddriver.com/features/columns/a33447381/why-is-america-stuck-with-bad-headlights/", "via": "", "real_tags": ["美国", "stuck", "汽车"]}, {"category": "", "categoryclass": "", "imagename": "94f931bdebbc95d79152e9d77c0dce5d.jpg", "infoid": 1016015, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个非常简单的迷宫不知何故对RCT2中的客人来说几乎是不可能的。在这段视频中，我们将找出原因。加入我的不和谐服务器：https://discord.gg/TP8EGQG Jo...", "note_en": "This very easy maze is somehow nearly impossible for the guests in RCT2. In this video we find out why. Join my Discord server: https://discord.gg/TP8EGQG Jo...", "posttime": "2020-08-04 04:10:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "过山车,complete,https", "title": "乘坐过山车大亨2需要10^20k年才能完成的一次旅行", "title_en": "A ride that takes 10^20k years to complete in Roller Coaster Tycoon 2", "transed": 1, "url": "https://youtu.be/KVgoy_a_gWI", "via": "", "real_tags": ["过山车", "complete", "https"]}, {"category": "", "categoryclass": "", "imagename": "3743c7aaa32d3fc822f8c96d6e8c97ff.jpg", "infoid": 1016014, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软的Office 2016 for Mac将于2020年10月13日到期，在此之后，将不再支持使用Office 2016 for Mac软件连接到Office 365服务。\n微软在7月份的一份支持文档中分享了这一细节，其中强调了未来将支持哪些版本的Office连接到Office 365服务。\n2020年10月13日之后，不再支持使用Office 2016 for Mac连接到Office 365服务。这是因为Office 2016 for Mac将在那一天终止支持。\nMicrosoft Office 2016 for Windows、Microsoft Office 2019、Microsoft 365 Apps for Enterprise和Microsoft Apps for Business都将继续与Office 365配合使用。\n根据微软的说法，不会采取任何积极措施来阻止Office 2013等其他版本的Office客户端，但随着时间的推移，较旧的客户端可能会遇到性能或可靠性问题。\n这表明，在截止日期过后，使用Office for Mac 2016连接Office 365服务可能会奏效，但目前还不完全清楚情况是否会如此。\nOffice 2016 for Mac用户如果依赖微软的产品和服务，可以以150美元的价格购买Office 2019，或者以每年70美元的价格订阅Microsoft 365 Personal。Office 2019将支持到2023年。\n如果一个人发现软件和它的及时升级带来了好处，为什么这个人支付年费是不好的呢？开发人员需要能够像我们其他人一样支付账单。\n但并不是所有的软件都需要不断更新。事实上，您可能会认为文字处理器是2003年基本上完善的东西的一个主要例子，从那以后的改进一直是肤浅的，主要是为了配合其他非文字处理器的功能，以及更新以支持更新的硬件和更新的操作系统。我认为，要求人们回购更新的版本比订阅这类软件更好的商业模式。我对有意义的订阅软件没意见，但并不是对所有软件都有意义。例如，订阅教育软件是有意义的，因为大多数人只在有限的时间内需要它。再举一个例子，订阅会计软件是有意义的，因为它需要随着税收和会计法律、表格和程序的变化而不断更新。我可以到那些后面去。但并不是所有的软件都有这样的意义。当它没有意义时，为订阅软件付费的永久本质就变得无礼了。尤其令人恼火的是，及时升级实际上只是修复错误或完善功能，而这些功能在发布时就承诺过，但并没有得到理想的实施。如果您正在修复错误和改进功能，那是很好的，但这应该计入最初的购买价格，并在标准保修下支持一段合理的时间。如果硬件公司可以提供1-5年的保修，那么软件公司也应该提供。如果你不能用5美元的应用程序做到这一点，那么就不要以5美元的价格出售它。此外，订阅软件通常意味着它已经在线激活，需要每次使用或偶尔给家里打电话来验证它的订阅状态。在没有详细说明的情况下，有很多原因是许多用户不希望看到的。每个人都应该为他们的劳动获得报酬，但没有人能保证一定的商业模式。让人内疚的是，人们说开发者需要有能力支付账单，这并不能克服订阅软件只是对某些类型的软件来说是一种不合适的商业模式。开发商能否支付账单与此无关。\n我不确定你的说法是否适用于此。这会导致非订阅永久许可证可能无法使用，而订阅版本将保持活动状态。\n如果一个人发现软件和它的及时升级带来了好处，为什么这个人支付年费是不好的呢？开发人员需要能够像我们其他人一样支付账单。\n苹果首席财务官卢卡·马埃斯特里(Luca Maestri)今天在涵盖2020财年第三季度(第二财季)的财报电话会议上证实，苹果预计今年iPhone的发布时间将晚于往常。马埃斯特里说，苹果去年9月下旬开始销售iPhone，但今年，苹果预计几周后就会有货源供应。多个传言称……。\n苹果在3月份收购了天气应用程序Dark Sky，当时，Dark Sky的开发者表示，该应用程序的Android版本将于2020年7月1日停产。然而，这款应用的开发者并没有在那天关闭这款应用，而是宣布停止应用的时间将再推迟一个月。现在是8月份，安卓用户不能再使用这款应用了，而且……。\n根据DigiTimes的一份新报告，Apple Watch Series 6将在今年晚些时候发布时增加血氧监测功能。Apple Watch 6将配备生物传感器，可以监测睡眠状况，检测血氧，测量脉率、心跳和心房颤动，还将集成基于MEMS的加速计和陀螺仪，所有这些都允许...。\n随着有关iPhone12的传言在过去几个月里不断增加，最令人兴奋的一款机型是最小的5.4；机型。据信，iPhone12将有5.4&34；、6.7&34；和6.1&34；三种尺寸。虚拟模型已经表明，与iPhone的其他产品相比，5.4&34；的尺寸要小得多。即将发布的5.4&34；款iPhone的尺寸介于原版iPhone的尺寸之间。\n又一个忙碌的一周苹果新闻和谣言已经结束，很多人都在关注蒂姆·库克(Tim Cook)出席国会反垄断听证会和一份轰动一时的收益报告。订阅MacRumors YouTube频道可以获得更多视频。我们继续听到关于即将推出iPhone12的传言，包括苹果罕见地承认该产品将在几周后推出。\n据The Verge报道，众议院司法委员会(House Judiciary Committee)反垄断调查公布的苹果内部电子邮件披露了苹果为什么在iOS设备上阻止应用内购买Kindle图书的信息。史蒂夫·乔布斯(Steve Jobs)、菲尔·席勒(Phil Schiller)、埃迪·库伊(Eddy Cue)和其他苹果高管之间的两组电子邮件披露了苹果如何在iOS上接触Kindle的确切想法。那个.。\n一块可能用于即将推出的Apple Watch Series 6的电池已经提交给韩国测试研究所，并被推特用户@yabhishekhd发现。6月23日，韩国监管机构KTR颁发了容量为303.8mAh的1.17Wh电池的认证。KTR是一家韩国监管机构，负责在公开销售之前批准和测试新硬件。电池似乎注定了未来的命运……。\n苹果公司今天在其加拿大YouTube频道的iPhone上发布了一则新的广告，以庆祝NHL曲棍球的回归。这段30秒的视频名为曲棍球磁带，视频中拉斯维加斯金骑士队球员马克-安德烈·弗洛里和马克·斯通与iPhone 11 Pro一起享受冰上乐趣，他们把iPhone 11 Pro固定在滑板上、冰球棒上，以及用曲棍球胶带绑着的溜冰鞋上。与Ultra一起观看这场前所未有的比赛。\n苹果公司在美国推出了一种新的单一礼品卡，可以买到苹果的所有东西。这张卡最初是由种植业发现的，可以在App Store和其他在线服务中使用，但你也可以用它在苹果商店购买产品和配件。之前，有两种不同的Apple礼品卡可供选择：iTunes卡，可用于App Store、iTunes Store和iCloud存储……。\n泄密者乔恩·普罗瑟(Jon Prosser)在预测苹果的计划方面有一些喜忧参半的记录，他今天表示，新款iPhone12和新款iPad将于10月份发布。多个传言称，今年即将推出的部分或全部iPhone12机型的发布时间将晚于正常时间。苹果通常在9月份发布和发布新款iPhone，但问题是…", "note_en": "Microsoft&#39;s Office 2016 for Mac is set to reach its end of support date on October 13, 2020, and after that date, connecting to Office 365 services using the Office 2016 for Mac software will no longer be supported.\n Microsoft shared the detail  in a support document from July highlighting which versions of Office will be supported for connecting to Office 365 services in the future.\n Connecting to Office 365 services using Office 2016 for Mac isn&#39;t supported after October 13, 2020. That&#39;s because Office 2016 for Mac reaches end of support on that date.\n Microsoft Office 2016 for Windows, Microsoft Office 2019, Microsoft 365 Apps for enterprise, and Microsoft Apps for business will all continue to work with Office 365.\n According to Microsoft, no active measures will be taken to block other versions of the Office client, like Office 2013, but older clients could encounter performance or reliability issues over time.\n This suggests that connecting to Office 365 services using Office for Mac 2016 could potentially work after the deadline, but it&#39;s not entirely clear if that will be the case.\n Office 2016 for Mac users who rely on Microsoft&#39;s products and services can purchase Office 2019 for $150 or subscribe to Microsoft 365 Personal for $70 per year. Office 2019 will be supported through 2023.\n If a person finds benefit with the software and its timely upgrades, why is it bad for said person to pay a yearly fee? Developers need to be able to pay their bills just like the rest of us.\nBut not all software needs constant updating. Indeed you would think a word processor is a prime example of something that was essentially perfected in 2003 and since then the improvements have been superficial and mostly to tie in other non-word processor functionality, and updates to support newer hardware and newer operating systems. I think asking people to repurchase a newer version is a better business model than subscriptions for such software.  I&#39;m fine with subscription software where it makes sense, but it doesn&#39;t make sense for all software. For example, subscribing education software makes sense since most people only need it for a finite amount of time. As another example, subscribing to accounting software makes sense since it needs to be constantly updated with changes in tax and accounting laws, forms, and procedures. I can get behind those.  But not all software makes sense like that. And when it doesn&#39;t make sense, the perpetual nature of paying for subscription software becomes insulting. In particular, it&#39;s annoying where the &#34;timely upgrades&#34; are actually just bug fixes or perfecting features that were promised at launch but not ideally implemented. If you&#39;re fixing bugs and polishing features, that&#39;s fine, but that should be priced into the original purchase price and supported for a reasonable time under a standard warranty. If hardware companies can offer 1-5 year warranties, then so should software companies. If you can&#39;t do that with a $5 app, then don&#39;t sell it for $5.  Also, subscription software usually means it&#39;s online activated and needs to phone home every use or every so often to verify it&#39;s subscription status. Without getting into details, there are lots of reasons that is undesirable to many users.  Everyone deserves to be paid for their labor, but nobody is guaranteed a certain business model. Guilt-tripping people by saying &#34;developers need to be able to pay their bills&#34; doesn&#39;t overcome that subscription software is just an ill-fitting business model for some types of software. Whether or not developers can pay their bills is irrelevant to that.\n Not sure your statement applies here.  This renders a non-subscription &#34;perpetual&#34; license potentially unusable, whereas the subscription version remains active.\n If a person finds benefit with the software and its timely upgrades, why is it bad for said person to pay a yearly fee? Developers need to be able to pay their bills just like the rest of us.\n  During today&#39;s earnings call covering the third fiscal quarter of 2020 (second calendar quarter) Apple CFO Luca Maestri confirmed that Apple is expecting to release this year&#39;s iPhones later than usual.\rMaestri said that Apple last year started selling iPhones in late September, but this year, Apple projects supply will be &#34;available a few weeks later.&#34;\rMultiple rumors have suggested that ...\n Apple in March purchased weather app Dark Sky, and at that time, Dark Sky&#39;s developers said that the app&#39;s Android version would be discontinued on July 1, 2020. However, instead of shuttering the app on that date, the app&#39;s developers announced that the discontinuation would be delayed for another month.\rNow that it&#39;s August, Android users are no longer able to access the app, and...\n The Apple Watch Series 6 will add blood oxygen monitoring to its features list when it&#39;s launched later this year, according to a new report from DigiTimes.\rApple Watch 6 will feature biosensors that can monitor sleeping conditions, detect blood oxygen and measure pulse rates, heartbeats and atrial fibrillation, and will also incorporate MEMS-based accelerometer and gyroscope, all allowing the ...\n As rumors of the iPhone 12 have continued to build over the past few months, the one model that has the most excitement around it is the smallest 5.4&#34; model. The iPhone 12 is believed to be coming in 5.4&#34;, 6.7&#34;, and 6.1&#34; sizes.\rDummy models have shown how much smaller the 5.4&#34; is compared to the rest of the iPhone lineup. The upcoming 5.4&#34; iPhone falls in-between the size of the original...\n Another busy week of Apple news and rumors has wrapped up, with a lot of focus on Tim Cook&#39;s appearance at a Congressional antitrust hearing and a blockbuster earnings report.\rSubscribe to the MacRumors YouTube channel for more videos. We continued to hear rumors about the upcoming iPhone 12 lineup, including a rare admission from Apple that the lineup will launch &#34;a few weeks later&#34; than...\n Internal Apple emails, made public by the House Judiciary Committee&#39;s antitrust inquiry, have revealed information about why Apple blocked in-app purchases of Kindle books on iOS devices, reports The Verge.\rTwo sets of emails between Steve Jobs, Phil Schiller, Eddy Cue, and various other senior Apple executives, disclose the exact thinking behind how Apple approached Kindle on iOS. The...\n A battery likely for the upcoming Apple Watch Series 6 has been filed at the Korea Testing and Research Institute and discovered by a Twitter user @yabhishekhd.\rCertification for a 1.17Wh battery with a capacity of 303.8mAh was issued on June 23 by the KTR, a Korean regulatory body that approves and tests new hardware ahead of public sale.\rThe battery seems to be destined for a future...\n Apple today marked the return of NHL hockey with a new &#34;Shot on iPhone&#34; ad on its YouTube channel in Canada.\rTitled &#34;Hockey Tape,&#34; the 30-second video features Vegas Golden Knights players Marc-André Fleury and Mark Stone having some on-ice fun with the iPhone 11 Pro, which they attach to the boards, a hockey stick, and a skate with hockey tape. &#34;See the game like never before with Ultra ...\n Apple has introduced a new single gift card in the U.S. for all things Apple. First spotted by iCulture, the card can be used at the App Store and other online services, but you can also use it to buy products and accessories in the Apple Store. Previously, there were two separate Apple gift cards available: iTunes cards, which can be used for App Store, iTunes Store, and iCloud storage...\n Leaker Jon Prosser, who has a somewhat mixed track record when it comes to predicting Apple&#39;s plans, today said that new iPhone 12 models and new iPads will launch in October.\rMultiple rumors have suggested that some or all of the iPhone 12 models coming this year will see a later than normal launch. Apple typically unveils and releases new iPhones in the month of September, but problems...", "posttime": "2020-08-04 04:09:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,支持,stop,苹果", "title": "微软将于10月停止支持Mac版Office 2016", "title_en": "Microsoft to Stop Supporting Office 2016 for Mac in October", "transed": 1, "url": "https://www.macrumors.com/2020/08/03/microsoft-stop-supporting-office-2016-october/", "via": "", "real_tags": ["microsoft", "微软", "支持", "stop", "苹果"]}, {"category": "", "categoryclass": "", "imagename": "9232c96d7e730bccbd19b4975f6dc7ad.png", "infoid": 1016013, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "正如承诺的那样，广受欢迎的天气应用程序Dark Sky在周末结束了对Android和Wear OS的支持。Android Dark Sky的用户报告说，这款应用程序不再工作，它会向用户显示一条消息，告诉用户应用程序已经关闭。&#34；\n即将关闭的消息最初是在今年3月苹果收购该公司时宣布的。尽管对世界上最受欢迎的移动操作系统的支持已经结束，但黑暗天空的开发者在一篇宣布收购苹果的博客文章中写道，加入苹果意味着他们可以接触到比我们单独接触到的更多的人，产生的影响要大得多。\n作为收购的结果，黑暗天空Android应用程序并不是唯一一款被砍下的热门服务。IOS和Android上的几个应用程序开发者使用黑暗天空的API来获取天气数据已经有一段时间了，但就像对Android的支持一样，这一点正在消失。不过，在这种情况下还有一点时间：开发人员必须在明年年底之前找到并实现替代数据源。\n收购首次宣布时，“黑暗天空”原定于7月1日停止开发Android系统。这一期限推迟了一个月，但按计划于8月1日生效。网络版的“黑暗天空”原定于今天结束，但苹果已经延长了这一最后期限，尽管嵌入功能已被禁用。尚未指定网站关闭的新日期。该版本目前仍将是Android用户的一个选择，直到它停止工作为止。\n每年为该应用程序支付2.99美元的Android用户看到他们的订阅自动终止，并收到Google Play商店的电子邮件通知，通知称来自黑暗天空公司(Dark Sky Company)的超本地天气订阅已被取消。\n苹果公开的iOS14预览页非常清楚地表明，下一版本的iPhone操作系统将包含与黑暗天空相关的功能和数据。\n查看显示未来一小时内雨或雪强度的每分钟图表。适用于美国。\nWeather小部件指示第二天天气将变暖、变冷或变湿的时间。\nWeather应用程序和小部件显示政府对某些恶劣天气事件的警报，包括龙卷风、冬季风暴、山洪暴发等。适用于美国、欧洲、日本、加拿大和澳大利亚。", "note_en": "As promised, popular weather app Dark Sky ended support for Android and Wear OS over the weekend. Android Dark Sky users report that the app is no longer working and that it presents the user with a message that the &#34;app has shut down.&#34;\n The impending shutdown was first announced  when Apple acquired the company in March of this year. Despite the end of support for the world&#39;s most popular mobile operating system, Dark Sky&#39;s developers wrote in a blog post announcing the acquisition that joining Apple means they could &#34;reach far more people, with far more impact, than we ever could alone.&#34;\n The Dark Sky Android app is not the only popular service on the chopping block as a result of the acquisition. Several app developers on both iOS and Android have used Dark Sky&#39;s API for weather data for a while now, but like Android support, that&#39;s going away. There&#39;s a little more time in that case, though: developers have until the end of next year to find and implement alternative data sources.\n When the acquisition was first announced, Dark Sky was slated to stop working on Android on July 1. That deadline was extended by one month, but it went into effect as planned on August 1. The Web version of Dark Sky was slated to end today, but Apple has extended that deadline, though embeds have been disabled. A new date for the Web shutdown has not been specified. That version will remain an option for Android users for now until it, too, stops working.\n     Android users who were paying $2.99 per year for the app saw their subscriptions automatically ended and received Google Play store email notifications saying &#34;Hyperlocal Weather subscription from The Dark Sky Company, LLC on Google Play has been canceled.&#34;\n Apple&#39;s public  iOS 14 preview page makes it pretty clear that the next version of the iPhone&#39;s operating system is incorporating Dark Sky-related features and data.\n  View a minute‑by‑minute chart that shows the intensity of rain or snow over the coming hour. Available for the U.S.\n  The Weather widget indicates when the weather will be much warmer, colder, or wetter in the next day.\n  The Weather app and widgets display government alerts about certain severe weather events including tornados, winter storms, flash floods, and more. Available for the U.S., Europe, Japan, Canada, and Australia.", "posttime": "2020-08-04 03:46:04", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "android,天气,version", "title": "广受欢迎的黑暗天空天气应用安卓版本关闭", "title_en": "Android version of popular Dark Sky weather app shuts down", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/08/android-version-of-popular-dark-sky-weather-app-shuts-down/", "via": "", "real_tags": ["android", "天气", "version"]}, {"category": "", "categoryclass": "", "imagename": "005e0b26af9083f78d4fa9e7212b173f.jpg", "infoid": 1016012, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "魔术将发生在我们的下一期Extra Crunch Live系列节目中，时间是8月4日(星期四)。\nExtra Crunch Live只对额外的Crunch订户开放。如果您还不是Crunch的额外会员，您可以在这里加入。\nEC Live格式对我们TC来说是独一无二的。这是一场长达一小时的对话，这让我们可以深入探讨，不仅涉及当今科技、创业和投资领域的一些最大问题，而且还涉及到这些问题的核心。同时，它是一种更轻的格式，实际上看起来很有趣。\n把演讲从你们通常坐着听人们接受采访的正式的、安静的、昏暗的房间里拿出来，我们正在放大它，让它变得更轻松一些，我们在整个对话中都充斥着来自你们观众的问题。请参阅过去与红杉的Roelof Botha和Homebrew的Hunter Walk的谈话，了解这是如何工作的。(请参阅此处的Extra Crunch Live Talks的完整时间表。)。\nMax目前的公司Acfirm正试图给融资支付领域带来一些新东西，它与众多电商网站签订了协议，让购物者可以根据适合他们的时间表分期支付免息款项，而且注册这项服务的步骤不会比普通信用卡支付的步骤多。\n但因为这是金融科技-幕后，真实的故事要复杂得多。当然了。今天构建这些服务，并在20多年前构建它们，让Levin对处理数据的挑战和机遇有了一些令人惊叹的视角。这也让他对消费者想要和需要的东西，以及他们实际使用的东西有了一些批判性的洞察力-这些教训肯定与其他金融服务和电子商务企业家有关，但实际上对其他类别也同样重要。\n如今，“现代世界”是一场流动的盛宴：谁能想到，比方说，在1月份，我们今天面临的市场状况会发生如此剧烈的变化？更有理由继续对话，创造更多背景，为您自己的业务做出更好的选择。\nExtra Crunch Live只对额外的Crunch订阅者开放，所以如果你想看，可以在这里加入。您可以在下面的跳转下面找到呼叫的完整详细信息！", "note_en": "The magic happens in our next installment of our  Extra Crunch Live series, on Thursday, August 4.\n Extra Crunch Live is open exclusively to Extra Crunch subscribers. If you’re not already an Extra Crunch member, you can  join here.\n The EC Live format is a unique one for us at TC. It’s an hour-long conversation, and that allows us to take a deep dive, covering not only some of the biggest issues in tech, building startups and investing today but getting to the heart of them. At the same time, it’s a lighter format that’s actually fun to watch.\n Taking the talk out of the formal, hushed, darkened rooms where you usually sit to listen to people get interviewed, we’re Zooming it and keeping it a little more relaxed, and we’re peppering the conversation with questions from you, the audience, throughout. See past talks with  Sequoia’s Roelof Botha and  Homebrew’s Hunter Walk for a taste of how this works.  (See the whole schedule of Extra Crunch Live talks  here.)\n Max’s current company,  Affirm,   is trying to bring something new to the world of financing payments, inking deals with a wide plethora of e-commerce sites to give shoppers a way to make interest-free payments in installments, based on a schedule that works for them, and signing up for the service in no more steps than it takes to make an ordinary card payment.\n But because this is fintech — behind the scenes the real story is much more complex. Of course. Building these services today and building them 20+ years ago gives Levchin some amazing perspective on the challenges and opportunities of working with data. And it also has given him some critical insights into what consumers want and need, versus what they’ll actually use — lessons definitely pertinent to other financial services and e-commerce entrepreneurs, but actually just as important for other categories, too.\n The “modern world” is a moveable feast these days: who would have thought in, say, January that the market conditions we face today would have shifted so drastically? All the more reason to continue the conversation and create more context to make better choices for your own business.\n  Extra Crunch Live is open exclusively to Extra Crunch subscribers, and so if you want to watch,  join here. You can find the full details of the call below the jump!", "posttime": "2020-08-04 03:45:35", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,时间,live,支付", "title": "\nExtra Crunch Live：与金融科技传奇人物马克斯·列夫钦一起在美国东部时间8月6日下午4点/太平洋时间下午1点接受现场问答", "title_en": "\n\t\t\t\tExtra Crunch Live: Join fintech legend Max Levchin for a live Q&A on August 6 at 4pm ET/1pm PT\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/08/03/extra-crunch-live-join-fintech-legend-max-levchin-for-a-live-qa-on-august-6-at-4pm-et-1pm-pt/", "via": "", "real_tags": ["美国", "时间", "live", "支付"]}, {"category": "", "categoryclass": "", "imagename": "b130bf93d541afd3afe9210ce08a8676.jpg", "infoid": 1016008, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2015年5月18日凌晨，亚历山大·莫尔文采夫有了一项惊人的发现。他一直睡不着觉。午夜刚过，他惊醒了。他确信在他与妻子和孩子居住的苏黎世公寓里听到了噪音。他担心没有锁上露台的门，就跑出卧室查看是否有入侵者。一切都很好；露台的门是锁着的，没有入侵者。但当他站在客厅里时，他告诉我，突然他“被几十个非常美好的想法包围了”。“当一个想法具体化到可以开始编程的程度时，那个美好的时刻就出现了。”这一切都聚在一起了。刹那间，他看到了别人错过的东西。他立刻坐在他的电脑前，开始打几行代码。\n在此之前，旨在模仿大脑并识别模式的人工神经网络一直是我们的仆人，尽职尽责地执行我们要求它们执行的任务，在为我们提供服务方面变得越来越好。莫尔德文采夫当晚的冒险之旅彻底改变了我们对计算机能力的看法。他伟大的想法是让他们松开绳索，看看当他们被给予一点自由，允许他们有一点梦想时会发生什么。他释放了计算机的内部工作原理，并挖掘了它们神秘的隐藏层。谁会想到，他们会在距离梵高的“星夜”不到一百万英里的地方抛出狂野的画面呢？\n莫尔德文采夫给人的印象是专注、强烈。当他回忆起在圣彼得堡长大的童年时，他更放松了。Mordvintsev于2010年毕业于圣彼得堡国立信息技术、机械和光学大学，获得计算机科学硕士学位，然后前往一家专门从事海洋训练模拟器的公司工作，使用计算机为生物系统建模-在这种情况下，是珊瑚礁。他被分配到一个计算机视觉小组，很快就对这个领域着迷了。计算机视觉就是重新发明眼睛，教计算机看东西，开发能够理解数字和音频图像的计算机--也就是图像和声音。这对莫尔文采夫很有吸引力。\n当莫尔德文采夫的第一个孩子出生时，他和他的妻子决定大城市不是孩子的地方。就在那时，他接到了来自苏黎世谷歌招聘人员的电话，向他提供了一份那里的工作。\n到达时，他很担心。做计算机视觉的团队并不多，他是个“计算机视觉专家”。更糟糕的是，他被分配到一个专门从事安全搜索的团队，防止垃圾邮件和色情内容感染搜索结果。尽管如此，他还是有机会在谷歌周围闲逛和交往。在与他的同事聊天时，莫尔德文采夫被他所学到的关于深度神经网络的力量所震撼。虽然他曾经持怀疑态度，但现在他可以访问巨大的数据缓存和最新的机器。正如他所说，他很快意识到神经网络的深度可以“真正发光”。\n我们的大脑由至少1000亿个相互连接的神经细胞(神经元)组成，由一个鲜为人知的100万亿个连接的灌木丛连接起来。为了让我们看到，我们大脑中的神经元收集我们在视网膜上接收到的图像，并赋予它们形状和意义。从混乱的视觉印象中创建图像的过程始于初级视觉皮质，它识别线条和边缘。这个基本的草图被传递到大脑的区域，就像工厂里的流水线一样，它填充了形状、斑点阴影，并建立了鼻子、眼睛和脸部。最终的图像是使用我们记忆和语言中的信息组合在一起的，这有助于我们对图像进行分类，例如，将图像归类为不同类型的狗和猫。\n人工神经网络的设计目的是复制大脑的活动，并揭示大脑是如何工作的。卷积神经网络(ConvNets)在谷歌引起了莫德文采夫的注意，它是一种主要致力于视觉的专门形式，能够识别数据中的对象和斑点模式。神经元的排列方式与眼睛相似。ConvNet有多达30层，每层由数千个人工神经元组成，这就是为什么它们被称为深度神经网络。每一层中的神经元都能够检测到信号，但比大脑的神经细胞复杂得多。与人脑中的神经细胞和连接的数量相比，ConvNet中的神经元和连接的数量微乎其微。目前，人工神经网络更类似于老鼠的大脑。但是机器识别图像的装配线过程与我们看到图像的方式相似。\n要训练ConvNet，您需要从一个数据库(如ImageNet)输入数百万张图像，该数据库由1400多万个图像URL组成，并通过手工注释来指定内容。网络的可调参数-连接b\n然后，当你向它展示一张图像，并要求它识别它时，ConvNet的工作方式与人脑相似。首先，早期图层在组成图像的像素的地图中挑选线条。然后，每一层都连续挑选出越来越多的细节，建立起面孔、汽车、宝塔的部分，无论它的记忆中有什么图像。你越深入，信息就变得越抽象。最后，在最后一层，像素中特征分析的所有结果都被组装到最终图像中，无论是一张脸、一辆车、一只狗，还是神经网络训练过的数百万张图像中的任何一张。\n关键的一点是，机器不会像我们一样看到猫或狗，而是一组数字。图像被分割成像素。每个像素都用数字表示，这些数字给出了它在红色、绿色和蓝色刻度上的颜色及其位置。换句话说，它是数字一直往下。在第一层中，过滤器一次照亮像素映射中的一个区域，寻找线条和边缘，进行卷积-因此才有了卷积神经网络这一术语。然后，它将该原始草图传输到下一层。滤光片在每一层中以相同的方式操作，以澄清和识别目标图像。\n最后，最后一层得出图像实际是什么的概率。如果网络被要求识别一只狗，结论可能是99.99%的概率是狗，它是猫、狮子或汽车的可能性很低，就像它所训练的数据中的类别一样低。这就是谷歌反向图像搜索的可能：谷歌在你的图像上训练一个ConvNet，并返回它的最佳猜测。\n在深度神经网络出现之前，每一层中的滤波器都必须手工设计，这是一项艰巨的任务。在ConvNets中，它们是训练的自然结果。\n人工神经网络最早的成功之一是读取支票上的数字。现在他们可以识别人脸，在数据中找到模式，并为无人驾驶汽车提供动力。大多数科学家都满足于就此打住。未被问到的问题是，机器的推理是什么？在接收待识别图像的输入层和出现解决方案的输出层之间的神经元层中发生了什么？这些是隐藏层，之所以称为隐藏层，是因为它们既不是输入也不是输出；它们在机器内部。莫德文采夫不仅痴迷于找出为什么ConvNet工作得这么好，而且还痴迷于找出它们到底为什么工作，它们是如何推理的，以及隐藏的层里发生了什么。\n他开始工作，尽管这个问题不是他官方职责的一部分，这与安全搜索有关。谷歌有一项政策，允许其工程师将最多20%的时间，即每周一天，花在其他与谷歌相关的项目上。当然，研究人员不能简单地打开和关闭他们的思想。你探究的激情一直伴随着你，要么在你的意识里，要么更有可能是在潜意识里。\n牛津大学的一个研究小组发表了论文，为如何最好地继续进行提供了线索。他们解释说，当计算机被输入图像时，组成图像的像素被转换成数字。为了研究ConvNet是如何工作的，研究人员在隐藏层中途停止了这一过程，并调整了该层神经元之间的连接，以便机器看到目标图像的近似值。他们试图找出网络看到了什么，它的“大脑”里发生了什么。他们发现，不同图层中的图像虽然模糊，但仍与目标图像相似。\n沿着同样的路线，莫德文采夫确信隐藏的图层不仅仅是黑匣子，他接收数据并产生结果。他认为它们是“透明的，但非常、非常隐晦”。就在那时，5月的那个清晨，午夜过后不久，一切突然就位。莫尔德文采夫坐下来，编写了封装他的突破的代码，使他能够一层一层地探索神经网络是如何工作的。\n莫德文采夫没有像牛津团队那样，先看原始图像的哪些特征包含在特定的图层中，然后以像素的形式生成这些特征，以产生与原始图像大致相同的印象，而是做了相反的事情。他将一张图像输入到一个已经接受过ImageNet数据训练的ConvNet，但中途停止了前进的进程。换句话说，他踩了刹车。当网络还在试图验证某种特定模式可能是目标对象的初步感觉时，他告诉网络当场生成它。\n网络中的中间层由数千个相互连接的神经元组成，这些神经元包含网络训练过的所有东西的一部分-在这种情况下，是有很多狗和猫的ImageNet数据集。例如，如果目标图像中甚至有一丝狗的暗示，那一层中相关的人工神经元就会受到刺激，以强调狗的存在。然后，你来回反复地反转这个过程，看看会出现什么。正如莫尔德文采夫所说，“无论你在那里看到什么，我都想要更多。”根据谷歌虚拟现实的主要制片人杰西卡·布里哈特(Jessica Brillhart)的说法，谷歌工程师将这称为“脑外科手术”。牛津大学的研究小组试图重建原始图像，而莫德文采夫的伟大想法是保持神经元之间连接的强度不变，让图像发生变化。正如他谦虚地说：“有很多关于理解神经网络的建议。我的是非常实用的。“。\n通常情况下，如果你通过这台机器喂养它，它会同时识别猫和狗，因为它已经在ImageNet上接受过培训，上面有118个品种的狗和几只猫的图像。Mordvintsev只输入了图像中的猫部分，并在隐藏层中停了一半，神经元爆裂，包含狗和猫特征的混合，以及ImageNet中的任何其他特征。几次传递这张图片的结果就是这个恰如其分的名字“噩梦野兽”。从来没有见过这样的东西-一个头上有两双眼睛，腰上有另一双眼睛的东西，眼睛和犬类的属性遍布全身：这并不完全令人惊讶，因为这个网络更多的是针对狗而不是猫的训练。背景也变成了复杂的几何图案，几只蜘蛛冲了进来。似乎机器在那里看到了蜘蛛，尽管我们没有看到。这是机器眼中的世界景象。\n莫尔德文采夫熬夜到凌晨2点。写一份满是猫的图片的报告。他在多个尺度上应用了他的算法，同时产生了大小类似猫的生物，产生了具有分形属性的图像和只能被称为迷幻的表情。关键的一点是，这台机器产生的图像并没有编程到里面。\n我们的人类感知系统也有类似的行为方式，让我们“看到”并不真实存在的东西，比如月球上的面孔，云层中的图片，或者火星上加勒陨石坑里的笑脸，这是一种叫做空想的错觉。莫德文采夫的算法生成的梦幻图像几乎是迷幻的，与服用LSD的人体验的图像惊人地相似。这是否意味着人工神经网络不是那么人工的呢？我们可以说莫德文采夫已经找到了一种方法来观察机器的潜意识，它的内在生命，它的梦想吗？当然，他已经找到了一种方法来探测它的隐藏层。\n最后，莫尔德文采夫将他的几张照片发布在谷歌内部网站上，假设一段时间内没有人会注意到它们。“我在想怎么才能睡着，”他回忆道。\n但谷歌的太阳永远不会落山。当时是加利福尼亚州山景城的傍晚时分，谷歌总部正如火如荼地进行着。莫德文采夫的照片在网上疯传。这位来自苏黎世无伤大雅的SafeSearch团队的默默无闻的工程师获得了热烈的好评。\n阿瑟·I·米勒是伦敦大学学院历史与科学哲学荣誉退休教授。他是“碰撞的世界：尖端科学如何重新定义当代艺术”(W.W.Norton)和“机器中的艺术家”等书籍的作者，本文就是根据这两本书改编的。", "note_en": "Early in the morning on May 18, 2015, Alexander Mordvintsev made an amazing discovery. He had been having trouble sleeping. Just after midnight, he awoke with a start. He was sure he’d heard a noise in the Zurich apartment where he lived with his wife and child. Afraid that he hadn’t locked the door to the terrace, he ran out of the bedroom to check if there was an intruder. All was fine; the terrace door was locked, and there was no intruder. But as he was standing in his living room, suddenly he “was surrounded by dozens of very beautiful ideas,” he tells me. “That beautiful moment occurred when one idea crystallizes to a point where you can start programming.” It all came together. In an instant he saw what everyone else had missed. He sat down straight away at his computer and began to type lines of code.\n  Up until then, artificial neural networks — designed to mimic the brain and recognize patterns — had been our servants, dutifully performing the tasks we asked them to perform, becoming steadily better at serving us. Mordvintsev’s adventure that night was to transform completely our conception of what computers were capable of. His great idea was to let them off the leash, see what happened when they were given a little freedom, allowed to dream a little. He let loose the computer’s inner workings, and tapped into their mysterious hidden layers. Who would have guessed that they would throw up wild images not a million miles from van Gogh’s “Starry Night”?\n Mordvintsev comes across as focused, intense. He’s more relaxed when he recalls his childhood, growing up in St. Petersburg. Mordvintsev graduated in 2010 from Saint Petersburg State University of Information Technologies, Mechanics, and Optics with a master’s in computer science, then went to work for a company specializing in marine-training simulators, using computers to model biological systems — in this case, coral reefs. Assigned to a computer vision group, he quickly became fascinated with the field. Computer vision is all about reinventing the eye, teaching computers to see, developing computers that can understand digital and audio images — that is, pictures and sound. This appealed to Mordvintsev greatly.\n  When Mordvintsev’s first child was born, he and his wife decided that big cities were not the place for children. It was then that he received a call from a Google recruiter in Zurich, offering him a job there.\n On arrival, he was worried. There were not many teams that did computer vision, and he was “a computer vision guy.” Worse, he was assigned to a team specializing in SafeSearch, preventing spam and porn from infecting search results. Nevertheless, he had the chance to wander around Google and mingle. Chatting with his fellow workers, Mordvintsev was struck by what he was learning about the power of deep neural networks. While he was once skeptical, he was now in a place with access to huge data caches and the most up-to-date machines. As he put it, he quickly realized how deep neural networks could “really shine.”\n  Our brains are made up of at least 100 billion interconnected nerve cells (neurons), linked by a barely understood thicket of 100 trillion connections. For us to see, the neurons in our brains pick up the images we receive on our retinas and give them shape and meaning. The process of creating an image out of a jumble of visual impressions begins in the primary visual cortex, which identifies lines and edges. This basic sketch is passed — like an assembly line in a factory — to the regions of the brain, which fill in the shape, spot shadows, and build up noses, eyes, and faces. The final image is put together using information from our memories and from language, which helps us categorize and classify images into, for example, different types of dogs and cats.\n Artificial neural networks are designed to replicate the activities of the brain and to cast light on how the brain works. Convolutional neural networks (ConvNets), which captured Mordvintsev’s attention at Google, are a specialized form devoted mainly to vision, able to recognize objects and spot patterns in data. The neurons are arranged in a similar way as in the eye. ConvNets have up to 30 layers, each made up of many thousands of artificial neurons, which is why they are called deep neural networks. The neurons in each layer are able to detect signals but are much less complex than the brain’s nerve cells. The number of neurons and connections in a ConvNet is tiny in comparison to the number of nerve cells and connections in the human brain. For now, artificial neural networks are more akin to the brain of a mouse. But the assembly line process by which the machine recognizes an image is similar to the way in which we see.\n To train a ConvNet, you feed in millions of images from a database such as  ImageNet, which is made up of over 14 million URLs of images, annotated by hand to specify the content. The network’s adjustable parameters — the connections between the neurons — are tuned until it has learned the classifications so that when it is shown an image of, for example, a particular breed of dog, it recognizes it.\n When you then show it an image and ask it to identify it, the ConvNet works in a similar way to the human brain. First, the early layers pick out lines in the map of the pixels that make up the image. Each layer in succession then picks out more and more details, building up parts of faces, cars, pagodas, whatever images it has inside its memory. The deeper you go, the more abstract the information gets. Finally, in the last layer, all the results of analyzing features in the pixels are assembled into the final image, be it a face, a car, a dog, or any of the millions of images that the neural net was trained on.\n  The crucial point is that the machine does not see a cat or dog, as we do, but a set of numbers. The image is broken up into pixels. Each pixel is represented by numbers that give its color on a red, green, and blue scale and its position. In other words, it’s numbers all the way down. In the first layer, a filter illuminates areas of the pixel map one at a time, seeking out lines and edges, convolving — hence the term convolutional neural network. Then it transmits this primitive sketch to the next layer. The filters operate in the same way in each layer to clarify and identify the target image.\n Finally, the last layer comes up with probabilities of what the image actually is. If the network has been asked to identify a dog, the conclusion might be 99.99 percent probability that it’s a dog, with as many low probabilities for it being a cat, a lion, or a car as there are classes in the data it’s been trained on. This is what makes a Google reverse image search possible: Google trains a ConvNet on your image and returns its best guess.\n Before deep neural networks, the filters in each of the layers had to be hand-engineered, a formidable task. In ConvNets, they emerge as a natural consequence of training.\n  One of the first successes of artificial neural networks was to read the numbers on checks. Now they can recognize faces, find patterns in data, and power driverless cars. Most scientists were satisfied to leave it at that. The unasked question was, What is the machine’s reasoning? What occurs in the layers of neurons between the input layer that receives the image to be identified and the output layer where the solution emerges? These are the hidden layers, so called because they are neither input nor output; they are inside the machine. Mordvintsev became obsessed with finding out not only why ConvNets worked so well but why they worked at all, how they reasoned, what goes on in the hidden layers.\n  He set to work even though this problem was not part of his official duties, which related to SafeSearch. Google has a policy of allowing its engineers to spend up to 20 percent of their time, or one day a week, on some other Google-related project. Researchers, of course, can’t just turn their minds on and off. The passion of your inquiry stays with you, either in your conscious or, more likely, unconscious mind.\n A team from Oxford University had  published papers that provided clues as to how best to proceed. They explained that when the computer was being fed with images, the pixels that made up the image were converted into numbers. To investigate how the ConvNet worked, the researchers stopped the process part way into the hidden layers and adjusted the connections between the neurons in that layer so that the machine saw an approximation of the target image. They were trying to find out what the network saw, what was going on inside its “brain.” They discovered that the images in the various layers, though blurry, still resembled the target image.\n Following the same lines, Mordvintsev was sure the hidden layers were not just black boxes, taking in data and producing results. He saw them as “transparent but very, very obscure.” And that was when, not long after midnight on that early May morning, everything suddenly fell into place. Mordvintsev sat down and wrote the code that encapsulated his breakthrough, enabling him to explore how a neural network works layer by layer.\n Instead of looking at what features of the original image are contained in a particular layer and then generating those features in the form of pixels to produce an approximate impression of the original image, as the Oxford team had done, Mordvintsev did the reverse. He fed an image into a ConvNet that had been trained on the ImageNet data, but stopped the forward progress part way through. In other words, he stepped on the brakes. When the network was still in the middle of trying to verify a nascent sense that a particular pattern might be a target object, he told it to generate it right then and there.\n The intermediate layers in a network are made up of many thousands of interconnected neurons containing a bit of everything the network has been trained on — in this case, the ImageNet dataset with lots of dogs and cats. If the target image has, for example, even a hint of dog in it, the relevant artificial neuron in that layer will be stimulated to emphasize the dogness. Then you reverse the process repeatedly back and forth and see what emerges. As Mordvintsev puts it, “Whatever you see there, I want more of it.” Google engineers, according to Jessica Brillhart, the principal filmmaker for virtual reality at Google, refer to this as “brain surgery.” Whereas the Oxford group tried to reconstruct the original image, Mordvintsev’s great idea was to keep the strengths of the connections between the neurons fixed and let the image change. As he put it modestly: “There were many suggestions about understanding neural networks. Mine was very practical.”\n    Normally, if you fed this through the machine, it would identify both the cat and the dog, having been trained on ImageNet with its images of 118 breeds of dog plus several cats. Mordvintsev fed in just the cat portion of the image and stopped part way through the hidden layers, bursting with neurons containing a mash-up of dog and cat features, as well as whatever else is in ImageNet. The result of passing this image through several times was the aptly named “nightmare beast.” Nothing like it had ever been seen — a thing with two sets of eyes on its head and another set on its haunches, and eyes and canine attributes bursting out all over its body: not entirely surprising, as the network had been trained more on dogs than cats. The background too had been transformed into complex geometric patterns, with a couple of spiders bursting through. It seems the machine saw spiders there, even though we hadn’t. It was a vision of the world through the eyes of the machine.\n  Mordvintsev sat up until 2:00 a.m. writing a report full of images like that of the cat. He applied his algorithm at multiple scales, producing big and small cat-like creatures simultaneously, producing images with fractal properties and a look that can only be called psychedelic. The crucial point is that the machine was producing images that were not programmed into it.\n Our human perceptual system behaves in a similar way, making us “see” things that aren’t really there, like the face on the moon or pictures in clouds or the happy face in the Galle crater on Mars, an illusion called  pareidolia. The dream-like images generated by Mordvintsev’s algorithm were almost hallucinogenic, startlingly akin to those experienced by people on LSD. Did that mean that an artificial neural net was not that artificial? Could we say that Mordvintsev had found a way to look into the machine’s unconscious, into its inner life, its dreams? Certainly he’d found a way to plumb its hidden layers.\n Finally, Mordvintsev posted several of his images on an internal Google website, assuming that no one would notice them for a while. “I was wondering how to get back to sleep,” he recalls.\n But the sun never sets on Google. It was late afternoon in Mountain View, California, and Google headquarters was in full swing. Mordvintsev’s images went viral. The unknown engineer from the innocuous SafeSearch team in Zurich received rave reviews.\n  Arthur I. Miller is Emeritus Professor of History and Philosophy of Science at University College London. He is the author of, among other books, “ Colliding Worlds: How Cutting-Edge Science is Redefining Contemporary Art” (W.W. Norton) and “ The Artist in the Machine,” from which this article is adapted.", "posttime": "2020-08-04 03:42:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "梦想,alexander,图像", "title": "深度梦想：亚历山大·莫德文采夫挖掘了计算机的隐藏层", "title_en": "DeepDream: Alexander Mordvintsev Excavated the Computer’s Hidden Layers", "transed": 1, "url": "https://thereader.mitpress.mit.edu/deepdream-how-alexander-mordvintsev-excavated-the-computers-hidden-layers/", "via": "", "real_tags": ["梦想", "alexander", "图像"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1016007, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "使用图形时，操作系统使我们的工作变得更容易。在我们的情况下，除了其他一切。在这篇文章中，我们将使用VirtIO规范编写GPU(图形处理器)驱动程序。在这里，我们将允许用户应用程序将屏幕的一部分作为RAM，即通常所说的帧缓冲区。\n我们通过向主机(设备)发送某些命令来命令虚拟GPU(virtio-GPU)。来宾(操作系统驱动程序)分配的RAM成为帧缓冲区。然后驱动程序告诉设备，“嘿，这是我们要用来存储像素信息的RAM。”\n在我们的操作系统中，RAM是连续的，但根据规范，这不是严格要求。我们会给司机一个矩形。该矩形内的所有内容都将复制到主机。我们不想一遍又一遍地复制整个缓冲区。\n我们将使用我们在这里用于块驱动程序的virtio协议，所以我不会重新散列通用的virtio协议。但是，特定于设备的结构略有不同，因此我们将更深入地讨论这一部分。\n帧缓冲区必须足够大，才能存储\\(\\text{width}\\times\\text{height}\\times\\text{pixel大小}\\)字节数。有\\(\\text{width}\\次\\text{Height}\\)个像素数。每个像素都有一个1字节的红、绿、蓝和Alpha通道。因此，每个像素正好是4个字节，符合我们将要指定的配置。\n我们初级GPU驱动程序的帧缓冲区将支持\\(640\\乘以480\\)的固定分辨率。如果你是90年代的孩子，你会经常看到这个决议。事实上，我的第一台电脑是一台激光Pal386，它是一台分辨率为640像素、高480像素的16色显示器。\n红色、绿色和蓝色像素非常接近，通过改变这三个通道的强度，我们可以改变颜色。我们离显示器越近，就越容易看到像素。\n你可以看到这些小方块。如果你眯着眼睛看得够多，你就会发现它们不是纯白的。取而代之的是，你可以看到红色、蓝色和绿色的点点。这是因为这些小方块中的每一个都被细分为三种颜色：是的，红色、绿色和蓝色！为了生成白色，这些像素被调到11(明白其中的笑话了吗？)。要使其变黑，我们需要关闭该像素的所有三个通道。\n分辨率指的是我们的显示器上有多少个这样的方块。这是一台1920×1080的监视器。这意味着从左到右有1920个这样的方块，从上到下有1080个这样的方块。总而言之，我们有\\(1920\\乘以1080=2,073,600\\)个像素数。这些像素中的每一个都使用帧缓冲区中的4个字节表示，这意味着我们需要RAM中的\\(2,073,600\\x 4=8,294,400\\)字节来存储像素信息。\n您可以理解为什么我将分辨率限制为640×480，这只需要\\(640\\乘以480\\乘以4=1,228,800\\)字节-略高于1兆字节。\nGPU设备要求我们阅读更新的VirtIO规范。我将从V1.1中阅读，您可以在此处获得副本：https://docs.oasis-open.org/virtio/virtio/v1.1/virtio-v1.1.html.。具体来说，第5.7章“GPU设备”。这是一个未加速的2D设备，这意味着我们必须使用CPU来实际形成帧缓冲区，然后我们将CPU规定的内存位置转移到主机GPU，然后由主机GPU负责将其绘制到屏幕上。\n该设备使用请求/响应系统，在该系统中，我们驱动程序发出命令，向主机(GPU)请求一些东西。我们在请求中添加了一些额外的内存，以便主机可以制定其响应。当GPU打断我们时，我们可以查看这个响应内存位置，看看GPU告诉了我们什么。这非常类似于块驱动程序上的Status字段，其中块设备告诉我们上次请求的状态。\n标头对于所有请求和所有响应都是通用的。我们可以通过CtrlType枚举进行区分，它是：\n#[repr(U32)]enum CtrlType{/*2d命令*/CmdGetDisplayInfo=0x0100，CmdResourceCreate2d，CmdResourceUref，CmdSetScanout，CmdResourceFlush，CmdTransferToHost2d，CmdResourceAttachBack，CmdResourceDetachBacking，CmdGetCapsetInfo，CmdGet。\n这是我直接从说明书上拿来的，但为了避免被林特大喊大叫，我把名字生锈了。\n回想一下，帧缓冲区只是内存中的一串字节。我们需要在帧缓冲区后面放置一个结构，以便主机(GPU)知道如何解释您的字节序列。有几种格式，但总而言之，它们只是重新排列红色、绿色、蓝色和Alpha通道。所有这些都恰好是4个字节，这使得步幅相同。步长是从一个像素到另一个像素的间距-4个字节。\n#[repr(U32)]枚举格式{B8G8R8A8Unorm=1，B8G8R8X8 Unorm=2，A8R8G8B8B8 Unorm=3，X8R8G8B8B8 Unorm=4，R8G8B8A8Unorm=67，X8B8G8R8 Unorm=68，A8B8G8R8 Unorm=121，R8G8B8X8 Unorm=4。\n类型unorm是从0到255的8位(1字节)无符号值，其中0表示无强度，255表示全强度，介于两者之间的数字是无强度和全强度之间的线性插值。由于有三种颜色(和一种Alpha)，这给了我们\\(256\\乘以256\\乘以256=16,776,216\\)不同的颜色或颜色级别。\n对于本教程，我选择了R8G8B8A8Unorm=67，它首先是红色的，其次是绿色的，第三是蓝色的，第四是Alpha。这是一种常见的排序，因此我将选择它以便于后续操作。\n回想一下，每个单独的分量R、G、B和A都是一块一个字节，因此(x，y)引用的每个像素是4个字节。这就是为什么我们的内存指针是像素结构而不是字节。\n就像所有其他virtio设备一样，我们首先设置virtqueue，然后进行特定于设备的初始化。在我的代码中，我只是直接从块驱动程序复制粘贴到GPU驱动程序中。我在设备结构中添加的唯一内容是帧缓冲区和帧缓冲区的大小。\n发布结构设备{queue：*mut queue，dev：*mut u32，idx：u16，ack_use_idx：u16，frame buffer：*mut Pixel，width：u32，Height：u32，}。\n规范告诉我们执行以下操作，以便初始化设备并准备好绘制。我生锈了一些内容以符合我们的列举。\n使用CmdResourceAttachBacking从来宾RAM分配一个帧缓冲区，并将其作为后备存储附加到刚刚创建的资源。\n回想一下，我们的请求和响应打包在一起。我们将把它们放在不同的描述符中，但是每当我们从设备得到响应时，如果我们只释放一次来释放请求和响应，将会更容易。因此，在Rust中，我创建了请求结构来支持这样做。\n结构请求&lt；RqT，Rpt&gt；{请求：RqT，响应：Rpt，}实施&lt；RqT，Rpt&gt；请求&lt；RqT，Rpt&gt；{pub FN new(Request：RqT)-&gt；*mut self{let sz=size_of：：&lt；rqt&gt；()+size_of：：&lt；Rpt&Gt；{pub FN new(Request：RqT)-&gt；*mut self{let sz=size_of：：&lt；rqt&gt；()+size_of：：&lt；Rpt&Gt；\n让rq=request：：new(ResourceCreate2d{hdr：CtrlHeader{ctrl_type：CtrlType：：CmdResourceCreate2d，标志：0，栅栏_id：0，ctx_id：0，填充：0，}，resource_id：1，format：format：：R8G8B8A8Unorm，width：dev.width，Height：dev.Height，})；让desc_C2d=Desptor。()AS u32，标志：VIRTIO_DESC_F_NEXT，NEXT：(dev.idx+1)%VIRTIO_RING_SIZE AS u16，}；let desc_C2d_resp=Descriptor{addr：unsafe{&amp；(*rq).response as*Const CtrlHeader as U64}，len：size_of：：&lt；CtrlHeader&gt；()AS u32，标志：VII。(*dev.queue).desc[作为usize的dev.idx]=desc_C2d；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).desc[dev.idx作为usize]=desc_C2d_resp；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).avail.ring[(*dev.queue).avail.idx AS uSIZE%VIRTIO_RING_SIZE。(*dev.queue).avail.idx=(*dev.queue).avail.idx.wrapping_add(1)；}。\n我们在这里真正告诉GPU的是我们的分辨率和帧缓冲区的格式。当我们创建它时，主机可以自行配置，例如分配一个相同的缓冲区来从我们的操作系统进行传输。\n让rq=Request3：：New(AttachBacking{hdr：CtrlHeader{ctrl_type：：CmdResourceAttachBacking，FLAGS：0，FARCH_ID：0，CTX_ID：0，PADDING：0，}，RESOURCE_ID：1，}，MemEntry{addr：dev.frame buffer as U64，Length：dev.width*dev.high*size_of：)：(*rq).request as*const AttachBack as U64}，len：size_of：：&lt；AttachBacking&gt；()as u32，标志：VIRTIO_DESC_F_NEXT，NEXT：(dev.idx+1)%VIRTIO_RING_SIZE AS u16，}；let desc_ab_mementry=description ptor{addr：unsafe{&amp；(*rq).mementry as*const。()AS u32，标志：VIRTIO_DESC_F_NEXT，NEXT：(dev.idx+2)%VIRTIO_RING_SIZE AS u16，}；let desc_ab_resp=Descriptor{addr：unsafe{&amp；(*rq).response as*Const CtrlHeader as U64}，len：size_of：：&lt；CtrlHeader&gt；()AS u32，标志：VIRTIO。(*dev.queue).desc[dev.idx as usize]=desc_ab；dev.idx=(dev.idx+1)%VIRTIO_ring_size as u16；(*dev.queue).desc[dev.idx as usize]=desc_ab_mementry；dev.idx=(dev.idx+1)%VIRTIO_ring_size as u16；(*dev.queue).desc[dev.idx as usize。(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize%VIRTIO_RING_SIZE]=Head；(*dev.queue).avail.idx=(*dev.queue).avail.idx.wrapping_add(1)；}。\n支持通过MemEntry结构向GPU公开。这实质上是访客RAM中的物理地址。除了填充之外，MemEntry只是一个指针和一个长度。\n请注意，我创建了一个名为Request3的新结构。这是因为此步骤需要三个单独的描述符：(1)头、(2)mementry、(3)响应，而我们通常只需要两个描述符。我们的结构与普通请求非常相似，但它包含了mementry。\nStruct Request3&lt；RqT，rmt，Rpt&gt；{request：rqt，mementry：rmt，}Impll&lt；RqT，rmt，Rpt&gt；Request3&lt；RqT，rmt，rpt&gt；{pub FN new(request：rqt，meminfo：rmt)-&gt；*mut self{let sz=size_of：让ptr=kmalloc(Sz)as*mut self；unsafe{(*ptr).request=request；(*ptr).mementry=meminfo；}ptr}}\n让rq=request：：new(SetScanout{hdr：CtrlHeader{ctrl_type：CtrlType：：CmdSetScanout，FLAGS：0，FARCH_ID：0，CTX_ID：0，PADDING：0，}，r：RECT：：NEW(0，0，dev.width，dev.high)，resource_id：1，scanout_id：0，})；让desc_sso=description ptor{addr：un。()AS u32，标志：VIRTIO_DESC_F_NEXT，NEXT：(dev.idx+1)%VIRTIO_RING_SIZE AS u16，}；let desc_sso_resp=Descriptor{addr：unsafe{&amp；(*rq).response as*Const CtrlHeader as U64}，len：size_of：：&lt；CtrlHeader&gt；()AS u32，标志：VIRTHeader。(*dev.queue).desc[作为usize的dev.idx]=desc_sso；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).desc[dev.idx作为usize]=desc_sso_resp；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).avail.ring[(*dev.queue).avail.idx AS usize%VIRTIO_RING_SIZE]=。(*dev.queue).avail.idx=(*dev.queue).avail.idx.wrapping_add(1)；}。\n当我们想要写入缓冲区时，我们将通过它的扫描输出号来引用它。如果我们有两个放大镜，我们可以在其中一个上绘制，而另一个则显示在屏幕上。这称为双缓冲，但出于我们的目的，我们不这样做。取而代之的是，我们在相同的帧缓冲区上绘制，然后传输某些部分以供GPU更新显示。\n在我们发出信号QueueNotify(virtio寄存器“GO”按钮)之后，GPU将在内部创建一个新的缓冲区，设置后备存储，并将扫描输出数设置为该缓冲区。我们现在有了一个初始化的帧缓冲区！\n现在我们有了包含像素的内存。然而，我们有自己的内存，而GPU也有自己的内存。所以，要把我们的东西送到GPU上，就需要把它转移到GPU上。我们在初始化期间设置了后备存储，因此现在我们只需引用我们希望通过其扫描输出编号进行更新的内容。\n失效很重要，因为我们每次进行更改都要更新整个屏幕，这是非常昂贵的。事实上，如果我们传输整个屏幕，我们需要传输\\(640\\乘以480\\乘以4=1,228,800\\)字节。对于帧速率，例如每秒20或30帧，我们需要每秒传输此数量的字节20或30次！\n我们不会传输所有内容，而是使帧缓冲区的某些部分无效，并且GPU将只复制那些落在无效区域内的像素，这些像素的坐标由RECT结构定义。\n#[repr(C)]#[派生(克隆，复制)]pub struct rect{pub x：u32，pub y：u32，pub width：u32，pub Height：u32，}Impll RECT{pub Const FN new(x：u32，y：u32，width：u32，high：u32)-&gt；self{self{x，y，width，Height}。\n请注意，此矩形由左上角坐标(x，y)定义，然后由宽度和高度定义。矩形可以由它们的坐标(x1，y1)、(x2，y2)或初始坐标以及宽度和高度定义。我在规范中看不到关于前者的任何内容，但是当我试图使其无效并进行传输时，它似乎将矩形视为后者。哦，好吧，我想还有更多的测试，…\n无效只是将数据从来宾(驱动程序)传输到主机(GPU)。这只是复制内存，为了更新帧缓冲区，我们执行一个flush命令。\nPub FN Transfer(gdev：usize，x：u32，y：u32，width：u32，Height：u32){if let ome(Mut Dev)=unsafe{gpu_devices[gdev-1].Take()}{let rq=request：：new(hdr：CtrlHeader{ctrl_type：CtrlType：：CmdTransferToHost2d，flag：0，fence_填充：0，})；让desc_t2h=description ptor{addr：unsafe{&amp；(*rq).request as*const TransferToHost2d as u64}，len：size_of：：&lt；TransferToHost2d&gt；()as u32，标志：VIRTIO_DESC_F_NEXT，NEXT：(dev.idx+1)%VIRTIO_RING_SIZE AS u16，}；让desc_T2H_ress。()作为u32，标志：VIRTIO_DESC_F_WRITE，NEXT：0，}；不安全{let head=dev.idx；(*dev.queue).desc[dev.idx as usize]=desc_T2H；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).desc[dev.idx as usize]=desc_T2H_resp；dev.。(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize%VIRTIO_RING_SIZE]=Head；(*dev.queue).avail.idx=(*dev.queue).avail.idx.wrapping_add(1)；}//步骤5：刷新let rq=request：：new(ResourceFlush{hdr：CtrlHeader{ctrl_type：：CtrlType：：CmdResourceFlush，FLAGS：0，FARCH_ID：0，CTX_ID：0，PADDING：0，}，r：RECT：：NEW(x，y，width，Height)，resource_id：1，padding0，})；让desc_rf=description ptor{addr：un(*rq).request as*const ResourceFlush as U64}，len：size_of：：&lt；ResourceFlush&gt；()AS u32，标志：VIRTIO_DESC_F_NEXT，NEXT：(dev.idx+1)%VIRTIO_RING_SIZE AS u16，}；let desc_RF_resp=Descriptor{addr：unsafe{&amp；(*rq).response as*Const CtrlHeader as U64}，len：size_of：：&lt；CtrlHeader&gt；()AS u32，标志：VIRTIO。(*dev.queue).desc[dev.idx as usize]=desc_rf；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).desc[dev.idx as usize]=desc_rf_resp；dev.idx=(dev.idx+1)%VIRTIO_RING_SIZE AS u16；(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize%VIRTIO_RING_SIZE]=Head；(*dev.queue).avail.idx=(*dev.queue).avail.idx.wrapping_add(1)；}//运行队列不安全{dev.dev.add(MmioOffsets：：QueueNotify.scale32()).write_volatie(0)；GPU_Devices[gdev-1].place(Dev)；}}。\n因此，我们的传输首先告诉主机我们已经更新了帧缓冲区的特定部分，该部分指定为x、y、width和high。然后，我们进行所谓的资源刷新，让GPU将所有传输提交到屏幕上。\n这是一个相当简单的部分。大多数设备响应都以NODATA的形式出现，这只是对它发出请求的确认。另外，请注意，与块驱动程序不同，我们这里没有观察者。这允许我们异步更新屏幕。\n这样做的全部目的是让用户空间应用程序将内容绘制到屏幕上。通常，我们不会将整个帧缓冲区提供给任何需要它的用户空间应用程序，但是出于我们的目的，我们现在可以接受它。相反，我们会让窗口管理器将帧缓冲区的某些矩形委托给不同的应用程序。窗口管理器还将负责处理事件并将适当的事件发送到GUI应用程序。\n要允许我们的用户空间应用程序使用GPU，我们需要两个系统调用。一个用于获取指向帧缓冲区的指针。回想一下，我们首先必须将帧缓冲区映射到用户空间的MMU表。这就是我们分配页面而不是使用kmalloc的原因。\n让dev=(*frame).regs[Registers：：A0 as usize]；(*frame).regs[Registers：：A0 as usize]=0；if dev&gt；0&amp；&amp；dev&lt；=8{if let ome(P)=gpu：：gpu_Devices[dev-1].Take(){let ptr=p.get_frame buffer()as usize；gpu：：gpu_device[dev。60！=0{let p=get_by_pid((*frame).pid as u16)；let table=((*p).get_table_address()as*mut Table).as_mut().unwork()；let num_ages=(p.get_width()*p.get_Height()*4)as usize/page_size；for i in 0.num_ages{let vaddr=0x3000_0000+(i&lt；&设paddr=ptr+(i&lt；&lt；12)；map(table，vaddr，paddr，EntryBits：：UserReadWrite as i64，0)；}}(*frame).regs[Registers：：A0 as usize]=0x3000_0000；}}。\n正如您在上面看到的，我们从GPU设备获取帧缓冲区并将其映射到0x3000_0000。目前，我计算帧缓冲区的页数是\\(\\frac{640\\x 480\\x 4}{4,096}=300\\)。所以，这份决议正好需要300页。\n因此，现在我们有了一个帧缓冲区，这样用户空间应用程序就可以将它想要的写入到这个内存位置。但是，写入操作不会立即更新屏幕。回想一下，我们必须传输然后刷新才能将结果写入屏幕。这就是我们的第二个系统调用发挥作用的地方。\n设dev=(*frame).regs[Registers：：a0 as usize]；设x=(*frame).regs[Registers：：a1 as usize]as u32；令y=(*frame).regs[Registers：：a2 as usize]as u32；let width=(*frame).regs[Registers：：a3 as usize]as u32；let Height=(*frame).regs[Registers：：a4 as usize]as u32。\n我展示了上面的传递函数，它只发出两个请求：(1)CmdTransferToHost2d和(2)CmdResourceFlush。当用户空间应用程序进行此系统调用时，结果将刷新到屏幕上，因此，用户可以看到结果。我不会在系统调用本身中进行错误检查。传递函数将对设备进行错误检查，并且设备将对x、y、宽度和高度进行错误检查。因此，如果这是不正确的，传递函数将静默失败，并且屏幕上不会有任何更新。\n要查看屏幕上显示的内容，我们需要能够绘制最简单的。\n.", "note_en": "An operating system is used to make our job easier when using graphics. In our instance, in addition to everything else. In this post, we will be writing a GPU (graphics processing unit) driver using the VirtIO specification. In here, we will allow user applications to have a portion of the screen as RAM–with what is commonly known as a  framebuffer.\n      We command the virtual GPU (virtio-gpu) by sending certain commands to the host (the device). The guest (the OS driver) has an allocation of RAM that becomes the framebuffer. The driver then tells the device, “hey, here’s the RAM that we’re going to use to store pixel information.”\n The RAM is contiguous in our OS, but according to the specification, this isn’t strictly required. We will give the driver a rectangle. Everything that falls within that rectangle will be copied to the host. We don’t want to keep copying the entire buffer over and over again.\n We will be using the virtio protocol that we used for the block driver here, so I won’t rehash the general virtio protocol. However, the device-specific structures are a bit different, so we’ll cover that part more in depth.\n   A framebuffer must be large enough to store \\(\\text{width}\\times\\text{height}\\times\\text{pixel size}\\) number of bytes. There are \\(\\text{width}\\times\\text{height}\\) number of pixels. Each pixel has a 1-byte red, green, blue, and alpha channels. So, each pixel is exactly 4 bytes with the configuration we’re going to specify.\n The framebuffer for our junior GPU driver is going to support a fixed resolution of \\(640\\times 480\\). If you’re a child of the 90s, you saw this resolution a lot. In fact, my first computer, a Laser Pal 386, had a 16-color monitor with a resolution of 640 pixels wide with 480 pixels tall.\n  There are red, green, and blue pixels so close together that by varying the intensity of these three channels, we can change the color. The closer we get to our monitors, the easier a pixel is to see.\n  You can see these little squares. If you squint enough, you can see that they aren’t pure white. Instead, you can see bits of red, blue, and green. That’s because each one of these little squares is subdivided into three colors: yep, red, green, and blue! To make white, these pixels are turned up to 11 (get the joke?). To make black, we turn off all three channels of that pixel.\n The resolution refers to how many of these squares are on our monitor. This is a 1920×1080 monitor. That means that there are 1920 of these squares going left to right, and there are 1080 of these squares from top to bottom. All in all, we have \\(1920\\times 1080=2,073,600\\) number of pixels. Each one of these pixels is expressed using 4 bytes in the framebuffer, meaning we need \\(2,073,600\\times 4=8,294,400\\) bytes in RAM to store the pixel information.\n You can see why I limited our resolution to 640×480, which only requires \\(640\\times 480\\times 4=1,228,800\\) bytes–a bit over a megabyte.\n   The GPU device requires us to read a more up-to-date VirtIO specification. I’ll be reading from version 1.1, which you can get a copy here:  https://docs.oasis-open.org/virtio/virtio/v1.1/virtio-v1.1.html. Specifically, chapter 5.7 “GPU Device”. This is an  unaccelerated 2D device, meaning that we must use the CPU to actually form the framebuffer, then we transfer our CPU formulated memory location to the host GPU, which is then responsible for drawing it to the screen.\n The device uses a request/response system, where we the driver make a command to request something from the host (the GPU). We add a bit of extra memory into our request so that the host can formulate its response. When the GPU interrupts us, we can take a look at this response memory location to see what the GPU told us. This is much like the  status field on the block driver, where the block device tells us the status of our last request.\n   The header is common for all requests and all responses. We can differentiate by the CtrlType enumeration, which is:\n #[repr(u32)]enum CtrlType {\t/* 2d commands */\tCmdGetDisplayInfo = 0x0100,\tCmdResourceCreate2d,\tCmdResourceUref,\tCmdSetScanout,\tCmdResourceFlush,\tCmdTransferToHost2d,\tCmdResourceAttachBacking,\tCmdResourceDetachBacking,\tCmdGetCapsetInfo,\tCmdGetCapset,\tCmdGetEdid,\t/* cursor commands */\tCmdUpdateCursor = 0x0300,\tCmdMoveCursor,\t/* success responses */\tRespOkNoData = 0x1100,\tRespOkDisplayInfo,\tRespOkCapsetInfo,\tRespOkCapset,\tRespOkEdid,\t/* error responses */\tRespErrUnspec = 0x1200,\tRespErrOutOfMemory,\tRespErrInvalidScanoutId,\tRespErrInvalidResourceId,\tRespErrInvalidContextId,\tRespErrInvalidParameter,}\n I took this directly from the specification, but Rust-ified the names to avoid getting yelled at by the linter.\n  Recall that the framebuffer is just a bunch of bytes in memory. We need to put a structure behind the framebuffer so the host (the GPU) knows how to interpret your sequence of bytes. There are several formats, but all-in-all, they just re-arrange the red, green, blue, and alpha channels. All are exactly 4 bytes, which makes the  stride the same. The stride is the spacing from one pixel to another–4 bytes.\n #[repr(u32)]enum Formats {\tB8G8R8A8Unorm = 1,\tB8G8R8X8Unorm = 2,\tA8R8G8B8Unorm = 3,\tX8R8G8B8Unorm = 4,\tR8G8B8A8Unorm = 67,\tX8B8G8R8Unorm = 68,\tA8B8G8R8Unorm = 121,\tR8G8B8X8Unorm = 134,}\n The type,  unorm, is an 8-bit (1-byte) unsigned value from 0 through 255, where 0 represents no intensity and 255 represents full intensity, and a number in between is a linear-interpolation between no and full intensity. Since there are three color (and one alpha), that gives us \\(256\\times 256\\times 256=16,776,216\\) different colors or levels of colors.\n For this tutorial, I selected  R8G8B8A8Unorm = 67, which has red first, green second, blue third, and alpha fourth. This is a common ordering, so I’ll select it to make it easy to follow along.\n   Recall that each individual component R, G, B, and A are each one byte a piece, so each Pixel referred to by (x, y) is 4 bytes. This is why our memory pointer is a Pixel structure instead of a byte.\n   Just like all other virtio devices, we set up the virtqueues first and then we work on device-specific initialization. In my code, I just directly copied-and-pasted from the block driver into the gpu driver. The only thing I added to the Device structure was the framebuffer and dimensions of the framebuffer.\n pub struct Device {\tqueue: *mut Queue,\tdev: *mut u32,\tidx: u16,\tack_used_idx: u16,\tframebuffer: *mut Pixel,\twidth: u32,\theight: u32,}\n The specification tells us to do the following in order to initialize the device and get things ready to draw. I Rust-ified some of the content to match our enumerations.\n  Allocate a framebuffer from guest ram, and attach it as backing storage to the resource just created, using  CmdResourceAttachBacking.\n  Recall that our request and response come packaged together. We will put them in separate descriptors, but whenever we get a response back from the device, it is going to be easier if we free just once to free both the request and response. So, in Rust, I created the Request structure to support doing this.\n struct Request&lt;RqT, RpT&gt; {\trequest: RqT,\tresponse: RpT,}impl&lt;RqT, RpT&gt; Request&lt;RqT, RpT&gt; {\tpub fn new(request: RqT) -&gt; *mut Self {\t\tlet sz = size_of::&lt;RqT&gt;() + size_of::&lt;RpT&gt;();\t\tlet ptr = kmalloc(sz) as *mut Self;\t\tunsafe {\t\t\t(*ptr).request = request;\t\t}\t\tptr\t}}\n  let rq = Request::new(ResourceCreate2d {\thdr: CtrlHeader {\t\tctrl_type: CtrlType::CmdResourceCreate2d,\t\tflags: 0,\t\tfence_id: 0,\t\tctx_id: 0,\t\tpadding: 0,\t},\tresource_id: 1,\tformat: Formats::R8G8B8A8Unorm,\twidth: dev.width,\theight: dev.height,});let desc_c2d = Descriptor {\taddr: unsafe { &amp;(*rq).request as *const ResourceCreate2d as u64 },\tlen: size_of::&lt;ResourceCreate2d&gt;() as u32,\tflags: VIRTIO_DESC_F_NEXT,\tnext: (dev.idx + 1) % VIRTIO_RING_SIZE as u16,};let desc_c2d_resp = Descriptor {\taddr: unsafe { &amp;(*rq).response as *const CtrlHeader as u64 },\tlen: size_of::&lt;CtrlHeader&gt;() as u32,\tflags: VIRTIO_DESC_F_WRITE,\tnext: 0,};unsafe {\tlet head = dev.idx;\t(*dev.queue).desc[dev.idx as usize] = desc_c2d;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).desc[dev.idx as usize] = desc_c2d_resp;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize % VIRTIO_RING_SIZE] = head;\t(*dev.queue).avail.idx = (*dev.queue).avail.idx.wrapping_add(1);}\n All we’re really telling the GPU here is our resolution and the format of the framebuffer. When we create this, the host gets to configure itself, such as allocating an identical buffer to make transfers from our OS.\n  let rq = Request3::new(AttachBacking {\thdr: CtrlHeader {\t\tctrl_type: CtrlType::CmdResourceAttachBacking,\t\tflags: 0,\t\tfence_id: 0,\t\tctx_id: 0,\t\tpadding: 0,\t},\tresource_id: 1,\tnr_entries: 1,},MemEntry {\taddr: dev.framebuffer as u64,\tlength: dev.width * dev.height * size_of::&lt;Pixel&gt;() as u32,\tpadding: 0, });let desc_ab = Descriptor {\taddr: unsafe { &amp;(*rq).request as *const AttachBacking as u64 },\tlen: size_of::&lt;AttachBacking&gt;() as u32,\tflags: VIRTIO_DESC_F_NEXT,\tnext: (dev.idx + 1) % VIRTIO_RING_SIZE as u16,};let desc_ab_mementry = Descriptor {\taddr: unsafe { &amp;(*rq).mementries as *const MemEntry as u64 },\tlen: size_of::&lt;MemEntry&gt;() as u32,\tflags: VIRTIO_DESC_F_NEXT,\tnext: (dev.idx + 2) % VIRTIO_RING_SIZE as u16,};let desc_ab_resp = Descriptor {\taddr: unsafe { &amp;(*rq).response as *const CtrlHeader as u64 },\tlen: size_of::&lt;CtrlHeader&gt;() as u32,\tflags: VIRTIO_DESC_F_WRITE,\tnext: 0,};unsafe {\tlet head = dev.idx;\t(*dev.queue).desc[dev.idx as usize] = desc_ab;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).desc[dev.idx as usize] = desc_ab_mementry;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).desc[dev.idx as usize] = desc_ab_resp;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize % VIRTIO_RING_SIZE] = head;\t(*dev.queue).avail.idx = (*dev.queue).avail.idx.wrapping_add(1);}\n The backing is exposed to the GPU through the MemEntry structure. This essentially is a physical address in guest RAM. The MemEntry, aside from padding, is just a pointer and a length.\n Notice that I created a new structure called Request3. This is because this step requires  three separate descriptors: (1) the header, (2) the mementry, (3) the response, whereas usually we only need two descriptors. Our structure is much like a normal Request, but it includes the mementries.\n struct Request3&lt;RqT, RmT, RpT&gt; { request: RqT, mementries: RmT, response: RpT,}impl&lt;RqT, RmT, RpT&gt; Request3&lt;RqT, RmT, RpT&gt; { pub fn new(request: RqT, meminfo: RmT) -&gt; *mut Self { let sz = size_of::&lt;RqT&gt;() + size_of::&lt;RmT&gt;() + size_of::&lt;RpT&gt;(); let ptr = kmalloc(sz) as *mut Self; unsafe { (*ptr).request = request; (*ptr).mementries = meminfo; } ptr }}\n  let rq = Request::new(SetScanout {\thdr: CtrlHeader {\t\tctrl_type: CtrlType::CmdSetScanout,\t\tflags: 0,\t\tfence_id: 0,\t\tctx_id: 0,\t\tpadding: 0,\t},\tr: Rect::new(0, 0, dev.width, dev.height),\tresource_id: 1,\tscanout_id: 0,});let desc_sso = Descriptor {\taddr: unsafe { &amp;(*rq).request as *const SetScanout as u64 },\tlen: size_of::&lt;SetScanout&gt;() as u32,\tflags: VIRTIO_DESC_F_NEXT,\tnext: (dev.idx + 1) % VIRTIO_RING_SIZE as u16,};let desc_sso_resp = Descriptor {\taddr: unsafe { &amp;(*rq).response as *const CtrlHeader as u64 },\tlen: size_of::&lt;CtrlHeader&gt;() as u32,\tflags: VIRTIO_DESC_F_WRITE,\tnext: 0,};unsafe {\tlet head = dev.idx;\t(*dev.queue).desc[dev.idx as usize] = desc_sso;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).desc[dev.idx as usize] = desc_sso_resp;\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize % VIRTIO_RING_SIZE] = head;\t(*dev.queue).avail.idx = (*dev.queue).avail.idx.wrapping_add(1);}\n When we want to write to a buffer, we will refer to it by its  scanout number. If we had two scanouts, we could draw on one while the other is displayed to the screen. This is called  double-buffering, but for our purposes, we don’t do this. Instead, we draw on the same framebuffer, then transfer certain portions for the GPU to update the display.\n After we signal QueueNotify, the virtio register “GO” button, then the GPU will create a new buffer internally, set the backing store, and set the scanout number to this buffer. We now have an initialized framebuffer!\n   We now have memory that contains pixels. However, we have our own memory, and the GPU has its own memory. So, to get ours to the GPU, it needs to be transferred. We set the backing store during initialization, so we now only have to refer to what we want updated by its scanout number.\n Invalidation is important, since updating the entire screen every time we make a change is very expensive. In fact, if we transfer our entire screen, we need to transfer \\(640\\times 480\\times 4=1,228,800\\) bytes. For framerates, such as 20 or 30 frames per second, we need to transfer this number of bytes 20 or 30 times a second!\n Instead of transferring everything, we invalidate certain portions of the framebuffer, and the GPU will only copy over those Pixels that fall within the invalidated region, whose coordinates are defined by a Rect structure.\n #[repr(C)]#[derive(Clone, Copy)]pub struct Rect {\tpub x: u32,\tpub y: u32,\tpub width: u32,\tpub height: u32,}impl Rect {\tpub const fn new(x: u32, y: u32, width: u32, height: u32) -&gt; Self {\t\tSelf {\t\t\tx, y, width, height\t\t}\t}}\n Notice that this Rect is defined by an upper-left coordinate (x, y) and then a width and height. Rectangles can be defined by their coordinates (x 1, y 1), (x 2, y 2) or an initial coordinate and width and height. I don’t see anything in the spec about the former, but when I try to invalidate and transfer, it appears that it’s treating the rectangle as the latter. Oh well, more testing I guess…\n  Invalidating is just transferring the data from the guest (driver) to the host (GPU). This just copies the memory, to update the framebuffer, we execute a  flush command.\n pub fn transfer(gdev: usize, x: u32, y: u32, width: u32, height: u32) { if let Some(mut dev) = unsafe { GPU_DEVICES[gdev-1].take() } { let rq = Request::new(TransferToHost2d { hdr: CtrlHeader {\t\tctrl_type: CtrlType::CmdTransferToHost2d,\t\tflags: 0,\t\tfence_id: 0,\t\tctx_id: 0,\t\tpadding: 0, },\tr: Rect::new(x, y, width, height),\toffset: 0,\tresource_id: 1,\tpadding: 0,\t});\tlet desc_t2h = Descriptor {\t\taddr: unsafe { &amp;(*rq).request as *const TransferToHost2d as u64 },\t\tlen: size_of::&lt;TransferToHost2d&gt;() as u32,\t\tflags: VIRTIO_DESC_F_NEXT,\t\tnext: (dev.idx + 1) % VIRTIO_RING_SIZE as u16,\t};\tlet desc_t2h_resp = Descriptor {\t\taddr: unsafe { &amp;(*rq).response as *const CtrlHeader as u64 },\t\tlen: size_of::&lt;CtrlHeader&gt;() as u32,\t\tflags: VIRTIO_DESC_F_WRITE,\t\tnext: 0,\t};\tunsafe {\t\tlet head = dev.idx;\t\t(*dev.queue).desc[dev.idx as usize] = desc_t2h;\t\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t\t(*dev.queue).desc[dev.idx as usize] = desc_t2h_resp;\t\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t\t(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize % VIRTIO_RING_SIZE] = head;\t\t(*dev.queue).avail.idx = (*dev.queue).avail.idx.wrapping_add(1);\t}\t// Step 5: Flush\tlet rq = Request::new(ResourceFlush {\t\thdr: CtrlHeader {\t\t\tctrl_type: CtrlType::CmdResourceFlush,\t\t\tflags: 0,\t\t\tfence_id: 0,\t\t\tctx_id: 0,\t\t\tpadding: 0,\t\t},\t\tr: Rect::new(x, y, width, height),\t\tresource_id: 1,\t\tpadding: 0,\t});\tlet desc_rf = Descriptor {\t\taddr: unsafe { &amp;(*rq).request as *const ResourceFlush as u64 },\t\tlen: size_of::&lt;ResourceFlush&gt;() as u32,\t\tflags: VIRTIO_DESC_F_NEXT,\t\tnext: (dev.idx + 1) % VIRTIO_RING_SIZE as u16,\t};\tlet desc_rf_resp = Descriptor {\t\taddr: unsafe { &amp;(*rq).response as *const CtrlHeader as u64 },\t\tlen: size_of::&lt;CtrlHeader&gt;() as u32,\t\tflags: VIRTIO_DESC_F_WRITE,\t\tnext: 0,\t};\tunsafe {\t\tlet head = dev.idx;\t\t(*dev.queue).desc[dev.idx as usize] = desc_rf;\t\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t\t(*dev.queue).desc[dev.idx as usize] = desc_rf_resp;\t\tdev.idx = (dev.idx + 1) % VIRTIO_RING_SIZE as u16;\t\t(*dev.queue).avail.ring[(*dev.queue).avail.idx as usize % VIRTIO_RING_SIZE] = head;\t\t(*dev.queue).avail.idx = (*dev.queue).avail.idx.wrapping_add(1);\t}\t// Run Queue\tunsafe {\t\tdev.dev\t\t.add(MmioOffsets::QueueNotify.scale32())\t\t.write_volatile(0);\t\tGPU_DEVICES[gdev-1].replace(dev);\t}}\n So, our transfer first tells the host that we’ve updated a certain portion of the framebuffer, which is specified as x, y, width, and height. Then we do what is called a  resource flush to get the GPU to commit all transfers to the screen.\n   This is a fairly easy section. Most of the device responses come in the form of  NODATA, which is just an acknowledgment that it made the request. Also, notice that unlike the block driver, we don’t have watchers here. This allows us to asynchronously update the screen.\n   The whole point of this is to get a user space application drawing stuff to the screen. Generally, we wouldn’t give the full framebuffer to any user space application that wants it, but for our purposes, we can live with it for now. Instead, we would have a  window manager delegate certain rectangles of the framebuffer to different applications. The window manager would also be responsible for handling events and sending the appropriate events to the GUI application.\n  To allow our userspace applications to use the GPU, we need two system calls. One to get a pointer to the framebuffer. Recall that we first must map the framebuffer to the userspace’s MMU table. This is why we allocated pages instead of using kmalloc.\n let dev = (*frame).regs[Registers::A0 as usize];(*frame).regs[Registers::A0 as usize] = 0;if dev &gt; 0 &amp;&amp; dev &lt;= 8 {\tif let Some(p) = gpu::GPU_DEVICES[dev - 1].take() {\t\tlet ptr = p.get_framebuffer() as usize;\t\tgpu::GPU_DEVICES[dev-1].replace(p);\t\tif (*frame).satp &gt;&gt; 60 != 0 {\t\t\tlet p = get_by_pid((*frame).pid as u16);\t\t\tlet table = ((*p).get_table_address()\t\t\t\t\t\t as *mut Table)\t\t\t\t\t\t.as_mut()\t\t\t\t\t\t.unwrap(); let num_pages = (p.get_width() * p.get_height() * 4) as usize / PAGE_SIZE;\t\t\tfor i in 0..num_pages {\t\t\t\tlet vaddr = 0x3000_0000 + (i &lt;&lt; 12);\t\t\t\tlet paddr = ptr + (i &lt;&lt; 12);\t\t\t\tmap(table, vaddr, paddr, EntryBits::UserReadWrite as i64, 0);\t\t\t}\t\t}\t\t(*frame).regs[Registers::A0 as usize] = 0x3000_0000;\t}}\n As you can see above, we grab the framebuffer from the GPU device and map it to 0x3000_0000. Currently, I calculate the number of pages for the framebuffer, which is \\(\\frac{640\\times 480\\times 4}{4,096}=300\\). So, we need exactly 300 pages for this resolution.\n So, now we have a framebuffer, so the userspace application can write what it wants into this memory location. However, a write doesn’t immediately update the screen. Recall that we must transfer and then flush to get the results written to the screen. This is where our second system call comes into play.\n let dev = (*frame).regs[Registers::A0 as usize];let x = (*frame).regs[Registers::A1 as usize] as u32;let y = (*frame).regs[Registers::A2 as usize] as u32;let width = (*frame).regs[Registers::A3 as usize] as u32;let height = (*frame).regs[Registers::A4 as usize] as u32;gpu::transfer(dev, x, y, width, height);\n I showed the transfer function above, which just makes two requests: (1) CmdTransferToHost2d and (2) CmdResourceFlush. When the userspace application makes this system call, the results will be flushed to the screen and hence, it’ll be visible to the user. I don’t error check in the system call itself. The transfer function will error check the device, and the device will error check the x, y, width, and height. So, if this is incorrect, the transfer function will silently fail, and nothing will update to the screen.\n   To see something displayed to the screen, we need to be able to draw the simpl\n......", "posttime": "2020-08-04 03:42:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,显卡,操作系统,铁锈,os", "title": "使用铁锈的RISC-V操作系统：显卡", "title_en": "RISC-V OS using Rust: Graphics", "transed": 1, "url": "https://blog.stephenmarz.com/2020/07/24/risc-v-os-using-rust-graphics/", "via": "", "real_tags": ["rust", "显卡", "操作系统", "铁锈", "os"]}, {"category": "", "categoryclass": "", "imagename": "5e496abae1cc1f0952fa18dadae7f9bf.jpg", "infoid": 1016006, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "UPMC和匹兹堡大学的研究人员今天(2020年7月27日)在“柳叶刀数字健康杂志”上发表的一项研究表明，使用人工智能(AI)程序识别和描述前列腺癌的准确性是迄今为止最高的。\n资深作者、医学博士、工商管理硕士拉吉夫·迪尔(Rajiv Dhir)、UPMC Shadyside首席病理学家兼病理学副主席、皮特大学(Pitt)生物医学信息学教授拉吉夫·迪尔(Rajiv Dhir)说，“人类擅长识别异常，但他们有自己的偏见或过去的经验。”“机器脱离了整个故事。肯定有标准化医疗的因素。“。\n为了训练人工智能识别前列腺癌，Dhir和他的同事们提供了来自患者活检组织切片的100多万个部分的染色组织切片的图像。每张图像都由专家病理学家标记，以教人工智能如何区分健康和异常组织。然后，该算法在另一组1600张幻灯片上进行了测试，这些幻灯片取自UPMC连续就诊的100名疑似前列腺癌患者。\n在测试过程中，人工智能在检测前列腺癌方面显示出98%的灵敏度和97%的特异性-显著高于之前报道的基于组织切片的算法。\n此外，这是第一个扩展到癌症检测之外的算法，报告了对肿瘤分级、大小和周围神经侵袭的高性能。这些都是病理报告要求的临床重要特征。\n但迪尔解释说，这并不一定意味着机器比人类优越。例如，在评估这些病例的过程中，病理学家可以简单地在该患者的样本中看到足够多的恶性肿瘤证据，从而建议治疗。然而，对于经验较少的病理学家来说，该算法可以作为一种失败的保险措施，以捕捉否则可能被遗漏的病例。\n“像这样的算法在非典型病变中特别有用，”迪尔说。“非专业人士可能无法作出正确的评估。这是这种系统的一大优势。“。\n虽然这些结果很有希望，但迪尔警告说，必须训练新的算法来检测不同类型的癌症。病理标记物并不是所有组织类型都通用的。但他不明白为什么不能这样做，以使这项技术适用于例如乳腺癌。\n参考文献：LIron Pantanowitz医学博士、Gabriela M Quiroga-Garza医学博士、Lilach Bien医学博士、Ronen Heled博士、Daphna Laifenfeld博士、Chaim Linhart博士、Judith Sandbank医学博士、Anat Albrecht Shach医学博士、Varda Shalev医学博士、Manuela医学博士撰写的“用于前列腺癌诊断的人工智能算法”，作者为医学博士LIron Pantanowitz、医学博士Gabriela M Quiroga-Garza、医学博士Lilach Bien、医学博士Ronen Heled、博士Chaim Linhart、医学博士Judith Sandbank、医学博士Anat Albrecht Shach、医学博士Manuela。电话：30159-X(20)10.1016/S25897500。\n该研究的其他作者包括密歇根大学的LIron Pantanowitz，M.B.Ch；UPMC的Gabriela Quiroga-Garza，医学博士；Lilach Bien，Ronen Heled，Daphna Laifenfeld，Ph.D.，Chaim Linhart，Judith Sandbank，M.D.，Manuela Vecsler，Ibex Medical Analytics；Anat Albrecht-Shach，M.D.。\n这项研究的资金是由Ibex提供的，它也创造了这个商业上可用的算法。Pantanowitz，Shalev和Albrecht-Shach报告了Ibex支付的费用，Pantanowitz和Shalev在医疗顾问委员会任职。Bien和Linhart是未决专利US 62/743,559和US 62/981,925的作者。IBEX对研究的设计或结果的解释没有影响。", "note_en": "A study published today (July 27, 2020) in   The Lancet Digital Health by UPMC and University of Pittsburgh researchers demonstrates the highest  accuracy to date in recognizing and characterizing prostate cancer using an artificial intelligence (AI) program.\n “Humans are good at recognizing anomalies, but they have their own biases or past experience,” said senior author Rajiv Dhir, M.D., M.B.A., chief pathologist and vice chair of pathology at UPMC Shadyside and professor of biomedical informatics at Pitt. “Machines are detached from the whole story. There’s definitely an element of standardizing care.”\n To train the AI to recognize prostate cancer, Dhir and his colleagues provided images from more than a million parts of stained tissue slides taken from patient biopsies. Each image was labeled by expert pathologists to teach the AI how to discriminate between healthy and abnormal tissue. The algorithm was then tested on a separate set of 1,600 slides taken from 100 consecutive patients seen at UPMC for suspected prostate cancer.\n During testing, the AI demonstrated 98% sensitivity and 97% specificity at detecting prostate cancer — significantly higher than previously reported for algorithms working from tissue slides.\n Also, this is the first algorithm to extend beyond cancer detection, reporting high performance for tumor grading, sizing, and invasion of the surrounding nerves. These all are clinically important features required as part of the pathology report.\n  But Dhir explained that this doesn’t necessarily mean that the machine is superior to humans. For example, in the course of evaluating these cases, the pathologist could have simply seen enough evidence of malignancy elsewhere in that patient’s samples to recommend treatment. For less experienced pathologists, though, the algorithm could act as a failsafe to catch cases that might otherwise be missed.\n “Algorithms like this are especially useful in lesions that are atypical,” Dhir said. “A nonspecialized person may not be able to make the correct assessment. That’s a major advantage of this kind of system.”\n While these results are promising, Dhir cautions that new algorithms will have to be trained to detect different types of cancer. The pathology markers aren’t universal across all tissue types. But he didn’t see why that couldn’t be done to adapt this technology to work with breast cancer, for example.\n  Reference: “An artificial intelligence algorithm for prostate cancer diagnosis in whole slide images of core needle biopsies: a blinded clinical validation and deployment study” by Liron Pantanowitz, MD; Gabriela M Quiroga-Garza, MD; Lilach Bien; Ronen Heled; Daphna Laifenfeld, PhD; Chaim Linhart, PhD; Judith Sandbank, MD; Anat Albrecht Shach, MD; Varda Shalev, MD; Manuela Vecsler, PhD; Pamela Michelow, MBBCh; Scott Hazelhurst, PhD and Rajiv Dhir, MD, August 2020,  The Lancet Digital Health.  DOI: 10.1016/S2589-7500(20)30159-X\n Additional authors on the study include Liron Pantanowitz, M.B.B.Ch., of the University of Michigan; Gabriela Quiroga-Garza, M.D., of UPMC; Lilach Bien, Ronen Heled, Daphna Laifenfeld, Ph.D., Chaim Linhart, Judith Sandbank, M.D., Manuela Vecsler, of Ibex Medical Analytics; Anat Albrecht-Shach, M.D., of Shamir Medical Center; Varda Shalev, M.D., M.P.A., of Maccabbi Healthcare Services; and Pamela Michelow, M.S., and Scott Hazelhurst, Ph.D., of the University of the Witwatersrand.\n Funding for this study was provided by Ibex, which also created this commercially available algorithm. Pantanowitz, Shalev and Albrecht-Shach report fees paid by Ibex, and Pantanowitz and Shalev serve on the medical advisory board. Bien and Linhart are authors on pending patents US 62/743,559 and US 62/981,925. Ibex had no influence over the design of the study or the interpretation of the results.", "posttime": "2020-08-04 03:41:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人工智能,识别,intelligence,医学博士", "title": "人工智能以近乎完美的准确率识别前列腺癌", "title_en": "Artificial Intelligence Identifies Prostate Cancer with Near-Perfect Accuracy", "transed": 1, "url": "https://scitechdaily.com/artificial-intelligence-identifies-prostate-cancer-with-near-perfect-accuracy/", "via": "", "real_tags": ["人工智能", "识别", "医学博士"]}, {"category": "", "categoryclass": "", "imagename": "e24394ad4b56c232430f44f87427fd5d.png", "infoid": 1016005, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "开放源码安全基金会(OpenSSF)有10个可用的存储库。在GitHub上遵循他们的代码。", "note_en": "Open Source Security Foundation (OpenSSF) has 10 repositories available. Follow their code on GitHub.", "posttime": "2020-08-04 03:41:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "代码,源代码,source,存储", "title": "开放源代码安全基金会(OpenSSF)", "title_en": "Open Source Security Foundation (OpenSSF)", "transed": 1, "url": "https://github.com/ossf", "via": "", "real_tags": ["代码", "源代码", "source", "存储"]}, {"category": "", "categoryclass": "", "imagename": "bbe196efafac28fcb066a2203a806604.jpg", "infoid": 1016004, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月来为一个非常复杂的目标而努力的故事。看看到货的笔记本电脑，它确实帮助实现了这一目标(惠普羡慕15)：https://ti...", "note_en": "The story of many months working on a very complicated goal. Check out the laptop that arrived and really helped make this goal work (HP ENVY 15): https://ti...", "posttime": "2020-08-04 03:40:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高难度,difficult,到货", "title": "我是如何学习高难度技能的--拍摄银河系的探索", "title_en": "How I Learn Difficult Skills – My Quest to Photograph a Galaxy", "transed": 1, "url": "https://www.youtube.com/watch?v=zKDe094o-Q8", "via": "", "real_tags": ["高难度", "difficult", "到货"]}]