[{"category": "", "categoryclass": "", "imagename": "40eb13feee3fbf6f736cf02175ed7f50.jpg", "infoid": 1030097, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据一份新的报告，超过10万名女性的假裸照已经从社交媒体照片中创建出来，并在网上分享。\n通过人工技术(AI)将衣服从女性照片中数字化移除，并在即时通讯应用Telegram上传播。\n情报公司Sensity的报告称，其中一些目标似乎是未成年人。\nDeepfake是计算机生成的，通常是逼真的图像和视频，基于真实的模板。它的用途之一是制作名人的假色情视频剪辑。\n但Sensity首席执行官乔治·帕特里尼(Giorgio Patrini)表示，使用私人照片的转变相对较新。\n他警告说，拥有一个拥有公开照片的社交媒体账户足以让任何人成为攻击目标。\n这个人工智能驱动的机器人生活在电报私人消息频道内。用户可以向机器人发送一张女性的照片，它将在几分钟内免费数字脱掉她的衣服。\n英国广播公司测试了多张图片，所有图片都征得了受试者的同意，没有一张是完全真实的--我们的结果包括一张横隔膜上有肚脐的女人的照片。\n去年，一款类似的应用程序被关闭，但据信该软件有破解版本在流通。\n运行这项服务的管理员(仅被称为“P#34；”)说：“我不在乎那么多。”这是不带暴力的娱乐节目。\n他还说，团队关注哪些照片被分享，当我们看到未成年人时，我们会永久屏蔽用户。\n但他说，是否与他人分享这张照片取决于最初使用机器人创建它的人。\n他为它的相对危害程度辩护说：世界上有战争、疾病和许多有害的东西。他还声称他很快就会删除所有的图片。\nSensity报告称，2019年7月至2020年期间，约有104,852名女性成为攻击目标，并公开分享了她们的假裸照。\n它的调查发现，一些图片似乎未成年，这表明一些用户主要是使用该机器人来生成和分享恋童癖内容。\n该机器人在俄罗斯社交媒体网站VK上投放了大量广告，该平台上的一项调查显示，大多数用户来自俄罗斯和前苏联国家。\nSensity的乔治·帕特里尼(Giorgio Patrini)表示，许多这样的网站或应用程序都不会隐藏或在地下运行，因为它们并不是严格非法的，Sensity的乔治·帕特里尼(Giorgio Patrini)说。\n报告的作者说，他们已经与Telegram、VK和相关执法机构分享了他们的所有调查结果，但没有得到回应。\n“深度造假与信息启示录”一书的作者妮娜·希克说，深度造假的创造者遍布世界各地，法律保护正在用这项技术迎头赶上。“深度造假与信息末日”一书的作者尼娜·希克说，深度造假的创造者遍布世界各地，法律保护正在用这项技术迎头赶上。\n内容变得更加复杂只是个时间问题。她说，深度假冒色情视频的数量似乎每六个月就会翻一番。\n在这个问题上，我们的法律制度不适合这个目的。由于这些指数性的技术进步，社会变化的速度比我们想象的要快，而我们作为一个社会还没有决定如何规范这一点。\n对于假色情的受害者来说，这是毁灭性的。这会彻底颠覆他们的生活，因为他们觉得受到了侵犯和羞辱。\n去年，美国弗吉尼亚州成为首批取缔深度假货的地方之一。\n英国现行的关于假裸照的法律最近在一份大学报告中被批评为前后矛盾、过时和令人困惑。\n妇女援助慈善机构的露西·哈德利(Lucy Hadley)表示，尽管在复仇、色情和裙装等问题上取得了进展，但法律上仍然存在许多明显的差距。\n虽然这些统计数据显示了深伪图像可能会多么普遍，但目前这并不是一种具体的违法行为。\n政府已指示法律委员会审查英格兰和威尔士围绕这一问题的法律。其调查结果将于2021年公布。", "note_en": "Faked nude images of more than 100,000 women have been created from social media pictures and shared online, according to a new report.\n Clothes are digitally removed from pictures of women by Artificial Technology (AI), and spread on the messaging app Telegram.\n Some of those targeted &#34;appeared to be underage&#34;, the report by intelligence company Sensity said.\n    Deepfakes are computer-generated, often realistic images and video, based on a real template. One of its uses has been to create faked pornographic video clips of celebrities.\n But Sensity&#39;s chief executive Giorgio Patrini said the shift to using photos of private individuals is relatively new.\n &#34;Having a social media account with public photos is enough for anyone to become a target,&#34; he warned.\n  The artificial intelligence-powered bot lives inside a Telegram private messaging channel. Users can send the bot a photo of a woman, and it will digitally remove her clothes in minutes, at no cost.\n The BBC tested multiple images, all with the subjects&#39; consent, and none were completely realistic - our results included a photo of a woman with a belly button on her diaphragm.\n A similar app was shut down last year, but it is believed there are cracked versions of the software in circulation.\n The administrator running the service, known only as &#34;P&#34; said: &#34;I don&#39;t care that much. This is entertainment that does not carry violence.\n  He also said the team looks at what photos are shared, and &#34;when we see minors we block the user for good.&#34;\n  But the decision on whether to share the photo with others is up to whoever used the bot to create it in the first place, he said.\n Defending its relative level of harm, he added: &#34;There are wars, diseases, many bad things that are harmful in the world.&#34; He has also claimed he will soon remove all of the images.\n   Sensity reported that between July 2019 and 2020, approximately 104,852 women have been targeted and had fake naked images of them shared publicly.\n Its investigation found that some of the images appeared underage, &#34;suggesting that some users were primarily using the bot to generate and share paedophilic content.&#34;\n The bot has had significant advertising on the Russian social media site VK, and a survey on the platform showed that most users were from Russia and ex-USSR countries.\n  &#34;Many of these websites or apps do not hide or operate underground, because they are not strictly outlawed,&#34; said Sensity&#39;s Giorgio Patrini.\n   The authors of the report say they have shared all their findings with Telegram, VK and relevant law enforcement agencies, but have not had a response.\n Nina Schick, author of the book Deep Fakes and the Infocalypse, said deepfake creators were all over the world, and that legal protections were &#34;playing catch-up&#34; with the technology.\n &#34;It&#39;s only a matter of time until that content becomes more sophisticated. The number of deepfake porn videos seems to be doubling every six months,&#34; she said.\n &#34;Our legal systems are not fit for purpose on this issue. Society is changing quicker than we can imagine due to these exponential technological advances, and we as a society haven&#39;t decided how to regulate this.\n &#34;It&#39;s devastating, for victims of fake porn. It can completely upend their life because they feel violated and humiliated.&#34;\n Last year the US state of Virginia became one of the first places to  outlaw deepfakes\n The current UK law around fake nude images has recently been criticised for being &#34;inconsistent, out-of-date and confusing&#34; in a  university report.\n Despite progress on issues like revenge porn and upskirting, &#34;there remain many glaring gaps in the law&#34;, says Lucy Hadley of the Women&#39;s Aid charity.\n While these statistics show how widespread deep-fake images can be, it is not currently a specific offence.\n The government has instructed the  Law Commission to review the law around the issue in England and Wales. Its findings are due in 2021.", "posttime": "2020-10-21 00:07:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "女性,naked,照片", "title": "网上分享的数千名女性的假裸照", "title_en": "Fake naked photos of thousands of women shared online", "transed": 1, "url": "https://www.bbc.co.uk/news/technology-54584127", "via": "", "real_tags": ["女性", "naked", "照片"]}, {"category": "", "categoryclass": "", "imagename": "cb75d5ff40ffe8fff300686500a96818.jpg", "infoid": 1030096, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巢穴保安已经死了。谷歌向安卓警方证实，其家庭安全产品已停产。到目前为止，Nest Secure已经在谷歌商店上被列为不再提供，已经大约一周了。\nNest Secure于2017年推出，此前据报道，Nest Secure经历了一个问题重重的发展时期，最终持续了四年。这款产品在开发过程中经过了如此多次的修改，以至于它获得了一个非正式的绰号--墓碑，这个绰号现在看起来非常合适。它的主要部件--Nest Guard--是一个扬声器和(一个最初的秘密)麦克风，上面有一个按钮键盘，用于武装和解除安全系统的武装。它也是Nest Detect传感器的集线器，可以测量门窗的运动。Nest安全拼图的最后一块是Nest标签，它是一个圆形的NFC密钥卡，可以让你通过轻敲集线器来武装和解除系统。\n这一切都相当昂贵，最初的入门包售价为500美元，包括一个警卫集线器、两个探测传感器和两个标签。最初的套餐只能覆盖两扇门窗，从那里开始，你想要监控的任何其他门窗都将另外收费60美元，如果你想要全面覆盖，这笔钱很快就会加起来。所有这三款Nest安全设备现在都应该会被淘汰，因为集线器的Google Store列表不再有货，传感器的缺货也不再有了。这三款Nest安全设备现在都应该会退出市场，因为集线器的Google Store列表已经不再提供，传感器的库存也已经脱销。不过，这些标签仍在出售。", "note_en": "The Nest Secure is dead. Google confirmed to  Android Police that its home security product has been discontinued. Nest Secure has been listed as &#34;no longer available&#34; on the Google Store for about a week now.\n The Nest Secure  launched in 2017 after a  reportedly troubled development period that ended up lasting four years. The product had been changed so many times in development that it earned the informal nickname &#34;Tombstone,&#34; which now seems very appropriate. The main unit—called the &#34; Nest Guard&#34;—was a speaker and ( an originally secret) microphone with a push-button keypad on top for arming and disarming the security system. It was also a hub for the &#34; Nest Detect&#34; sensors, which would measure motion at a door or window. The final piece of the Nest Secure puzzle was the &#34; Nest Tag,&#34; which was a round NFC key fob that would let you arm and disarm the system by tapping it on the hub.\n This was all pretty expensive, with the initial starter pack costing $500 for a Guard hub, two Detect sensors, and two Tags. The initial pack would only cover two doors or windows, and from there any other doors and windows you wanted to monitor would be another $60 each, which would quickly add up if you wanted comprehensive coverage. All three of the Nest Secure devices should be on the way out now, with the Google Store listing &#34;no longer available&#34; for the hub and &#34; out of stock&#34; for the sensors. The tags are still for sale, though.", "posttime": "2020-10-20 23:53:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "谷歌,google,取消,security,nest", "title": "谷歌取消其价值500美元的家庭安全系统Nest Secure", "title_en": "Google kills the Nest Secure, its $500 home security system", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/10/google-kills-the-nest-secure-its-500-home-security-system/", "via": "", "real_tags": ["谷歌", "google", "取消", "security", "nest"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1030095, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着地球电信运营商之间的竞争一如既往地激烈，设备制造商诺基亚宣布向一个新市场扩张，赢得了在月球上安装第一个蜂窝网络的协议。\n这家芬兰设备制造商表示，它被美国国家航空航天局(NASA)选中，在月球表面部署“超紧凑、低功耗、太空加固”的无线4G网络，这是美国航天局在2030年之前在月球上建立长期人类存在计划的一部分。\n这份价值1410万美元的合同授予了诺基亚的美国子公司，是美国宇航局Artemis计划的一部分，该计划的目标是在2024年之前将第一名女性，也就是下一名男性送上月球。\n宇航员们将开始进行详细的实验和探索，该机构希望这将有助于它开展第一次人类登上火星的任务。\n诺基亚表示，2022年末，诺基亚的网络设备将使用直观机器建造的月球漏斗远程安装在月球表面。\n“网络将在部署后自我配置，”该公司在一份声明中说，并补充说，无线技术将允许“重要的指挥和控制功能，远程控制月球车，实时导航和高清视频流媒体”。\n诺基亚表示，未来4G设备可以升级到超高速的5G网络。\n总体而言，美国国家航空航天局(NASA)上周宣布，将向14家公司拨款3.7亿美元，为其任务提供“引爆点”技术，其中包括机器人技术，以及获取月球上生活所需资源(如氧气和能源)的新方法。\n大部分资金流向了研究低温推进剂的公司，低温推进剂是用于为航天器提供燃料的冷冻液体。\n其中，美国宇航局表示，埃隆·马斯克的SpaceX获得5320万美元，用于演示在星际飞船上的坦克之间转移10吨液氧。", "note_en": "With competition among Earth’s telecoms providers as fierce as ever, equipment maker Nokia has announced its expansion into a new market, winning a deal to install the first cellular network on the moon.\n The Finnish equipment manufacturer said it was selected by  Nasa to deploy an “ultra-compact, low-power, space-hardened” wireless 4G network on the lunar surface, as part of the US space agency’s plan to establish a long-term human presence on the moon by 2030.\n The $14.1m contract, awarded to Nokia’s US subsidiary, is part of Nasa’s Artemis programme which aims to send the first woman, and next man, to the moon by 2024.\n  The astronauts will begin carrying out detailed experiments and explorations which the agency hopes will help it develop its first human mission to Mars.\n Nokia’s network equipment will be installed remotely on the moon’s surface using a lunar hopper built by Intuitive Machines in late 2022, Nokia said.\n “The network will self-configure upon deployment,” the firm said in a statement, adding that the wireless technology will allow for “vital command and control functions, remote control of lunar rovers, real-time navigation and streaming of high definition video.”\n The 4G equipment can be updated to a super-fast 5G network in the future, Nokia said.\n In all, Nasa announced last week it would distribute $370m to 14 companies to supply “Tipping Point” technologies for its mission, which include robotics and new methods of harvesting the resources required for living on the moon, such as oxygen and energy sources.\n The bulk of the funding went to companies researching cryogenic propellants, freezing liquids used to fuel spacecraft.\n Among them, Elon Musk’s SpaceX received $53.2m for a demonstration of the transferring of ten metric tons of liquid oxygen between tanks on a starship vehicle, Nasa said.", "posttime": "2020-10-20 23:49:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,诺基亚,nokia", "title": "NASA和诺基亚将在月球表面安装4G", "title_en": "NASA and Nokia To Install 4G on Lunar Surface", "transed": 1, "url": "https://www.theguardian.com/science/2020/oct/20/talking-on-the-moon-nasa-and-nokia-to-install-4g-on-lunar-surface", "via": "", "real_tags": ["nasa", "诺基亚", "nokia"]}, {"category": "", "categoryclass": "", "imagename": "b9db2add871be5d8798863cb73450b35.png", "infoid": 1030094, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Adobe将允许一些Adobe Creative Cloud客户尝试一种将可信属性直接构建到图片中的工具。作为更大规模软件更新的一部分，Adobe正在推进内容真实性倡议，这是它去年提出的一个系统。该工具为Photoshop添加了一个额外的面板，并使用它附加Adobe旗下的艺术共享网站Behance支持的元数据。\nAdobe在视频中准确地展示了这个过程是如何工作的。该系统允许用户切换四种元数据：图片缩略图、创建图像的人的姓名、有关所做编辑类型的一些广泛信息，以及用于创建图像的原始资源。然后对这些文件进行密码签名，因此任何人篡改它们都是显而易见的。\n如果照片被上传到Behance，用户可以弹出面板的形式看到所有这些信息，或者他们可以点击进入一个专门的网站。在接下来的几周里，CAI面板将在Photoshop的测试版中提供给“精选客户”。\nAdobe的演示视频暗示了该系统可能会有多大用处。例如，如果一张合成照片的原始资源之一也使用CAI，你也可以点击并查看它的全部细节--本质上是给艺术家一个一键式的归属工具，当他们在别人的图像上构建的时候。正如我们之前讨论过的，CAI并不是用来阻止决心坚定的巨魔伪造图像的。但是如果你想表明你已经PS了一张图片，CAI也是一种简单而低调的方式。\nAdobe最终想要大量的应用程序、网站，甚至相机来支持CAI--很可能是希望使其成为图像属性的事实标准。蔡崇信的有效性最终取决于它能在更广泛的互联网上获得多少支持，Adobe已经点名了几个备受瞩目的合作伙伴，如微软、Twitter和纽约时报公司(New York Times Company)。不过，就目前而言，Adobe将看看这一选项在自己的生态系统中是如何运作的。", "note_en": "Adobe will let some Adobe Creative Cloud customers  try a tool that builds trustworthy attribution directly into a picture. As part of a bigger software update, Adobe is moving forward with the Content Authenticity Initiative,  a system it proposed last year. The tool adds an extra panel to Photoshop, and using it attaches metadata that’s supported by Adobe-owned art sharing site Behance.\n Adobe lays out exactly how the process works in a video. The system lets users toggle four kinds of metadata: a picture thumbnail, the name of the person creating the image, some broad information about the types of edits that were made, and the original assets used to create the image. These are then cryptographically signed so it’ll be evident if anyone tampers with them.\n If the picture is uploaded to Behance, users can see all that information as a pop-up panel, or they can click through to a dedicated website. The CAI panel is coming to “select customers” in Photoshop’s beta release over the next few weeks.\n  Adobe’s demonstration video hints at how the system might be useful. If one of a composite photo’s original assets also used CAI, for instance, you can click through and see the full details for it as well — essentially giving artists a one-click attribution tool when they’re building on other people’s images.  As we’ve discussed before, CAI isn’t designed to stop determined trolls from faking an image. But if you’d like to make clear that you’ve Photoshopped an image, CAI is also a simple and low-key way to do so.\n Adobe eventually wants lots of apps, websites, and even cameras to support the CAI — likely hoping to make it a de facto standard for image attribution. CAI’s effectiveness ultimately depends on how much buy-in it can get across the wider internet, and Adobe has named a few high-profile partners like Microsoft, Twitter, and The New York Times Company. For now, though, Adobe is going to see how the option works within its own ecosystem.", "posttime": "2020-10-20 23:48:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "adobe,photoshop,rust,adding", "title": "Adobe正在将其“内容真实性”工具添加到最新的Photoshop测试版中，以帮助用户将可信的属性直接添加到图片中", "title_en": "Adobe is adding its “content authenticity” tool to the latest Photoshop beta, to help users build trustworthy attribution directly into a picture", "transed": 1, "url": "https://www.theverge.com/2020/10/20/21523927/adobe-content-authenticity-initiative-photoshop-behance-beta-tool-added?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["adobe", "photoshop", "rust", "adding"]}, {"category": "", "categoryclass": "", "imagename": "3a8f4fd32a25e9cbfd41d9eb966f2544.png", "infoid": 1030091, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "微软正在与SpaceX合作，将Azure云计算网络与埃隆·马斯克(Elon Musk)的公司提供的不断增长的StarLink卫星互联网服务连接起来。\n这一合作关系正值微软向太空行业扩张之际，该公司几周前推出了一项名为Azure Orbital的新服务，将卫星直接连接到云上。\nAzure Space和新的合作伙伴建立了微软(Microsoft)和SpaceX，以进一步与杰夫·贝佐斯(Jeff Bezos)、亚马逊(Amazon)和蓝色起源(Blue Origin)展开竞争，这两家公司已经宣布了提供类似卫星服务和更多服务的计划。\n周二，两家公司宣布，微软正在与SpaceX合作，将这家科技巨头的Azure云计算网络与埃隆·马斯克的公司提供的不断增长的StarLink卫星互联网服务连接起来。\nStarLink是SpaceX的雄心勃勃的计划，目的是建立一个由数千颗卫星互连的互联网网络，为地球上任何地方提供高速互联网。\nSpaceX总裁兼首席运营官格温·肖特威尔在一段视频中表示：我们今天宣布的这项合作将使我们能够共同努力，为公共和私营部门提供新的产品，通过Starlink提供连接，供Azure使用，SpaceX总裁兼首席运营官格温·肖特威尔(Gwynne Shotwell)在视频中表示。在有意义的地方，我们将与[微软]合作：共同销售给我们共同的客户，共同销售给新的企业和未来的客户。\n到目前为止，SpaceX已经发射了800多颗Starlink卫星-这只是全球覆盖所需总数的一小部分，但足以开始在一些地区提供服务，包括美国西北部。该公司正在对该服务进行私人Beta测试，并正在与华盛顿州农村地区的组织合作，提供卫星互联网。\n这一合作关系正值微软向太空行业扩张之际，该公司几周前推出了一项名为Azure Orbital的新服务，将卫星直接连接到云上。值得注意的是，Azure Orbital和新的SpaceX合作伙伴成立了微软和马斯克的公司，以进一步与杰夫·贝佐斯(Jeff Bezos)的业务展开竞争。\n近几个月来，SpaceX和微软一直在测试连接Starlink和Azure所需的软件。\n这项服务将Starlink的网络连接到微软的数据中心，包括一款新的Azure模块化数据中心产品，本质上是一个半拖车大小的移动设备。StarLink的全球覆盖使这些Azure模块化数据中心成为可能，因为微软表示，该产品是为在混合或具有挑战性的环境(包括偏远地区)中需要云计算能力的客户设计的。\n微软Azure Global公司副总裁汤姆·基恩(Tom Keane)在一段公司视频中表示：当人们想到将太空技术带入21世纪的创新和发展时，SpaceX当然是人们第一时间想到的名字。\n微软表示，一些Azure模块化数据中心已在国防和私营部门组织中早期使用，该公司将该产品视为满足军事需求、人道主义努力、移动指挥中心、采矿等方面的解决方案。\n该公司周二宣布成立其蔚蓝太空部门，建立在蔚蓝轨道发射的基础上。\n基恩说，太空社区正在迅速发展，创新正在降低公共和私营部门组织进入太空的门槛。曾经只是政府堡垒的地方，私人空间公司开发的创新已经使进入太空的途径民主化，利用空间创造新的场景和机会，以满足公共和私营部门的需求，很长一段时间以来，空间一直在为世界提供动力。\n除了SpaceX的合作伙伴关系外，微软还与卢森堡卫星运营商SES合作。除了SES为Azure Orbary提供的服务外，该公司还将把其O3b卫星连接到Azure。\n基恩说：“我们打算让Azure成为满足太空社区任务需求的首选平台和生态系统。”\n订阅CNBC PRO，获得独家见解和分析，以及来自世界各地的实时工作日节目。", "note_en": "Microsoft is partnering with SpaceX to connect the Azure cloud computing network to the growing Starlink satellite internet service offered by Elon Musk&#39;s company.\n The partnership comes as Microsoft expands into the space industry, with the company a few weeks ago unveiling a new service called Azure Orbital to connect satellites directly to the cloud.\n Azure Space and the new partnership sets up Microsoft and SpaceX to compete further with Jeff Bezos&#39; businesses Amazon and Blue Origin, which have announced plans for similar satellite services and more.\n Microsoft is partnering with SpaceX to connect the tech giant&#39;s Azure cloud computing network to the growing Starlink satellite internet service offered by  Elon Musk&#39;s company, the companies announced Tuesday.\n Starlink is  SpaceX&#39;s ambitious plan to build an interconnected internet network with thousands of satellites, designed to deliver high-speed internet to anywhere on the planet.\n  &#34;The collaboration that we&#39;re announcing today will allow us to work together to deliver new offerings for both the public and the private sector to deliver connectivity through Starlink for use on Azure,&#34; SpaceX president and COO Gwynne Shotwell said in a video. &#34;Where it makes sense, we will work with [Microsoft]: co-selling to our mutual customers, co-selling to new enterprise and future customers.&#34;\n To date, SpaceX has launched over 800 Starlink satellites – a fraction of the total needed for global coverage but enough to begin providing services in some regions, including in the northwest U.S. The company has an ongoing private beta test of the service, and is also  working with organizations in rural regions of Washington state to deliver satellite internet.\n The partnership comes as Microsoft expands into the space industry, with the company a few weeks ago unveiling a new service called Azure Orbital to connect satellites directly to the cloud. Notably, Azure Orbital and the new SpaceX partnership set up Microsoft and Musk&#39;s company to compete further with  Jeff Bezos&#39; businesses.\n  SpaceX and Microsoft in recent months have been testing the software needed to connect Starlink and Azure.\n  The service connects Starlink&#39;s network to Microsoft datacenters, including a new &#34;Azure Modular Datacenter&#34; product that&#39;s essentially a mobile unit about the size of a semi-trailer. Starlink&#39;s global coverage helps make these Azure Modular Datacenters possible, as Microsoft says the product is designed &#34;for customers who need cloud computing capabilities in hybrid or challenging environments, including remote areas.&#34;\n  &#34;SpaceX is of course the name that people immediately think of when they think of innovation and the evolution that&#39;s occurring to bring space technology into the 21st century,&#34; Tom Keane, Microsoft&#39;s corporate vice president of Azure Global, said in a company video.\n Microsoft said that some Azure Modular Datacenters are &#34;in early use with defense and private sector organizations,&#34; with the company seeing the product as a solution for military needs, humanitarian efforts, mobile command centers, mining and more.\n   The company on Tuesday announced the establishment of its Azure Space unit, building on the Azure Orbital launch.\n &#34;The space community is growing rapidly, and innovation is lowering the barriers of access for public and private sector organizations,&#34; Keane said. &#34;What used to solely be the bastion of governments, the innovation developed by private space companies has democratized access to space, and the use of space to create new scenarios and opportunities to meet the needs of both the public and private sector space has been powering the world for a long time.&#34;\n In addition to its SpaceX partnership, Microsoft is partnering with Luxembourg satellite operator SES. The company will also connect its O3b satellites to Azure, in addition to the services SES is providing for Azure Orbital.\n &#34;We intend to make Azure the platform and ecosystem of choice for the mission needs of the space community,&#34; Keane said.\n Subscribe to CNBC PRO  for exclusive insights and analysis, and live business day programming from around the world.", "posttime": "2020-10-20 23:43:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "microsoft,微软,合作,partners,azure", "title": "微软与SpaceX合作将Azure云连接到Starlink", "title_en": "Microsoft partners with SpaceX to connect Azure cloud to Starlink", "transed": 1, "url": "https://www.cnbc.com/2020/10/20/microsoft-expands-its-space-business-pairing-its-azure-cloud-with-spacexs-starlink-internet.html", "via": "", "real_tags": ["microsoft", "微软", "合作", "partners", "azure"]}, {"category": "", "categoryclass": "", "imagename": "53d1be089cfd62b00a07f9ee073009f5.jpeg", "infoid": 1030090, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这位作曲家正在用骰子给他的作曲游戏增添情趣。事实证明，莫扎特做了同样的…。\n他追随着令人印象深刻的作曲家世系，这些作曲家确实是在他们的作品上掷骰子。20世纪，查尔斯·艾夫斯(Charles Ives)等作曲家以及后来的约翰·凯奇(John Cage)等作曲家将“亚历阿托克”或“机遇”音乐作为一种理念而闻名，但莫扎特甚至使用过这种音乐。在18世纪晚期，这位奥地利作曲家创造了一种游戏，在游戏中，176个音乐片段可以根据掷骰子的方式编排成不同的版本。\n奇尔弗斯发明了一种更复杂的系统，包括立方体、四面体和十二面体骰子，这些骰子都决定了他作曲的基调、调子和节奏。\n奇尔弗斯告诉“泰晤士报”：“我想让我的实践随机化，这样我就不会陷入僵局。”\n在接受出版物采访时，这位钢琴家说，他掷六面和四面骰子来决定他的作曲中使用的模式。然后，他掷出一个12面的骰子，确定他必须开始和结束的琴键。\n他用更多的骰子来决定节奏，最后掷出20个决定的骰子来决定节奏是如何相互作用的。\n“这就像是随机性，”他说。“宇宙中有没有随机性，还是有一种超级智能，一切都非常完美，所有这些掷骰子都是非常完美的？我对这个想法持开放态度。我们的想法是它是活的。我不喜欢演奏一些我知道会怎样的东西。“。\n奇尔弗斯的作曲都将在明年3月发行专辑《31首曲目》。在31条赛道中，有16条是基于多节奏的；8条是空闲时间的；4条是我一直在发展的风格；其中2条赛道连续放慢速度，同时双速线路连续进入。\n他在对音乐会钢琴家的生活感到沮丧后，开始了这个想法。“感觉回报越来越少，”他说。“我越来越努力地学习李斯特的作品，希望能更快一点，或者更干净一点。我重新调整了我对擅长乐器意味着什么的看法。\n“我关注的不是速度有多快，有多干净，而是速度有多少，速度有多少种组合，你可以用多少种方式来调节这些速度。”\n对奇尔弗斯来说，这种方法是音乐的未来。“我根本不认为它是一个系统，而是一些令人兴奋和神奇的工具，比如一把光剑或一些X射线眼镜，”他说。\n“我想创作一种多维的音乐，来反映静止的心灵无法言说的体验。我在努力制定法则：多节奏法则、相位法则、模态法则、结构法则。如果我能制定好法律，那么就应该有有趣或美好的东西出来。“", "note_en": "This composer is using dice to spice up his composition game. And it turns out, Mozart did the same…\n   He follows an impressive lineage of composers who literally rolled the dice on their works. ‘Aleatoric’ or ‘chance’ music became known as an idea in the 20th century through composers like  Charles Ives and later,  John Cage, but it was even used by  Mozart. In the late 18th century, the Austrian composer created a game in which 176 fragments of music could be arranged in different versions, based on the throw of a dice.\n Chilvers invented a more complex system involving cubic, tetrahedral and dodecahedral dice, which all determine the keys, modes and rhythms of his composition.\n “I wanted to randomise my practice so I wasn’t falling into ruts,” Chilvers  told  The Times .\n  Speaking to the publication, the  pianist says he throws six and four-sided dice to decide on the modes used in his composition. Then, he throws a 12-sided dice to settle on the keys he must start, and end, the piece in.\n He uses more dice to determine the rhythms, before finally throwing a 20-decided dice to decide how the rhythms interact with each other.\n   “It’s like randomness,” he said. “Is there randomness in the universe, or is there a super intelligence and everything is exactly perfect, and all these dice throws are exactly perfect? I’m open to that idea. The idea is that it’s alive. I’m not a fan of playing something that I know how it’s going to go.”\n  Chilvers’ compositions will all be released in an album,  31 Pieces, in March next year. “Of the 31 tracks, sixteen are based on polyrhythm; eight are in free time; four are in a style I’ve been developing; and two of the tracks slow down continuously while double speed lines continuously enter.”\n  He took up the idea after becoming frustrated with life as a concert pianist. “It felt like more and more diminishing returns,” he says. “I was working harder and harder to get a bit of  Liszt a little bit faster or a little bit cleaner. I recalibrated my idea of what it meant to be good at an instrument.\n “Rather than looking at how fast and how clean, I’d be looking at how many speeds and how many permutations of speeds and how many ways can you juggle those speeds.”\n For Chilvers, this method is the future of music. “I don’t think of it as a system at all but as some exciting and magical tools, like a light sabre or some X-Ray glasses,” he says.\n “I wanted to create a multi-dimensional music to reflect the unspeakable experience of the stilled mind. I’m trying to make laws: polyrhythmic laws, phasing laws, modal laws, structural laws. If I can make good laws, then something interesting or beautiful should come out.”", "posttime": "2020-10-20 23:42:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "作曲,dice,作曲家", "title": "用骰子作曲的人", "title_en": "A man using dice to compose his music", "transed": 1, "url": "https://www.classicfm.com/discover-music/instruments/piano/edward-chilvers-using-dice-compose-music/", "via": "", "real_tags": ["作曲", "dice", "作曲家"]}, {"category": "", "categoryclass": "", "imagename": "11f0d99daee1c3bdadbb838a7b03e13d.jpg", "infoid": 1030089, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据周一发布的一项研究，一项为雇主和社区大学牵线搭桥的学徒计划已经让毕业生进入中产阶级的职业生涯，这可能是解决缺乏四年制学位的美国人命运萎靡不振的一种方式。\n先进制造教育联合会的目标是对能够操作先进制造技术的中等技能工人的广泛需求。该项目的学生将每周两天的社区大学学习和每周三天的工厂现场实践培训结合起来，同时获得兼职工资。\n这项由机会美国和布鲁金斯学会发布的研究发现，该项目的毕业生的工资远远高于社区大学的同龄人。\n名校毕业生在完成该项目后一年的收入约为59164美元，比非名校毕业生(其他来自类似背景、选择了类似职业的人)高出63%，后者的收入约为36379美元。五年后，名气毕业生的收入约为98,000美元，比非名气参与者高出86%，后者的收入约为52,783美元。\n该项目始于2010年，是几家希望找到新员工来运营新技术的公司的一次试验。它现在与13个州的400家公司合作。\n这项研究跟踪了389名在2010年至2016年间开始名气项目的学生。学生们在学习英语和数学等传统科目的同时学习修理机械。\n学徒工作通常以贸易工作而闻名-焊接、管道、电气-但仍然是获得高薪工作的途径，而不是四年制学位的高昂成本。该课程侧重于先进制造业，需要技术技能、识字能力、团队合作精神和强烈的职业道德。\n学徒制长期以来在职业发展中发挥着关键作用。一些高中与当地的就业中心合作，在那里学生可以注册农业、焊接和护理等课程，同时仍在努力获得文凭。在完成其中一些课程后，学生可以直接进入劳动力大军。\n研究称，欧式学徒制将课堂教学与带薪在职经验相结合，是整个行业需求的教学技能，越来越多地被认为是职业准备的最有效形式之一，这项研究表明，这种学徒制将课堂教学与带薪在职经验相结合，成为整个行业需求的教学技能，越来越多地被认为是职业准备的最有效形式之一。", "note_en": "An apprenticeship program that matches employers with community colleges has launched graduates into middle class careers and could be a way to address the flagging fortunes of Americans lacking four-year degrees, according to  a study published Monday.\n  The Federation for Advanced Manufacturing Education targets the widespread need for &#34;middle-skill workers&#34; who are capable of operating advanced manufacturing technology. Students in  the program combine two days a week of community college study with three days a week of hands-on training on the factory floor while receiving part-time wages.\n     The study, released by Opportunity America and the Brookings Institution, found that graduates of the program earned salaries far exceeding their peers at community colleges.\n  FAME graduates earn about $59,164 one year after completing the program — 63% more than non-FAME graduates (others from similar backgrounds who had chosen similar careers), who earn around $36,379. After five years, FAME graduates were earning about $98,000, 86% more than non-FAME participants, who earned about $52,783.\n  The program, which started in 2010, was an experiment among several companies hoping to find new workers to operate new technology. It now works with 400 companies in 13 states.\n       The study followed 389 students who started a FAME program between 2010 and 2016. The students learn to repair machinery while being taught traditional subjects such as English and math.\n  Apprenticeships have usually been known for trade work — welding, plumbing, electrical — but are still a route to high-paying jobs without the high cost of a four-year degree. This program focuses on advanced manufacturing where technical skills, literacy, teamwork and a strong work ethic are required.\n     Apprenticeships have long played a key role in career development. Some high schools work with local career centers where students can enroll in courses such as agriculture, welding and nursing while still working toward their diploma. After completing some of these courses, students can go straight into the workforce.\n  &#34;European-style apprenticeship that combines classroom instruction with paid on-the-job experience, teaching skills in demand across an industry, is increasingly recognized as one of the most effective forms of career preparation,&#34; the study says.", "posttime": "2020-10-20 23:42:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "学徒,pays,毕业生", "title": "做学徒是值得的：多63%", "title_en": "It Pays to Be an Apprentice: 63% More", "transed": 1, "url": "https://www.npr.org/2020/10/20/925530452/it-pays-to-be-an-apprentice-63-more", "via": "", "real_tags": ["学徒", "pays", "毕业生"]}, {"category": "", "categoryclass": "", "imagename": "298d7cc512419f9fe32872ad0d9b1a39.jpg", "infoid": 1030088, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，我们和LGR&39；的克林特·贝辛格(Clint Basinger)一起做了一段视频，勾选了一份遗愿清单上的项目，然后我们只有一个地方可以去：太空。没有一位创造者像工程师和物理学大师斯科特·曼利那样，将太空科学、游戏和纯粹的疯狂融为一体。\n曼利的视频通常是聪明和魅力的混合体，以缓慢、平静的盖尔语节奏呈现。曼利的视频涵盖了从空间技术讲解员到游戏评论到物理思维实验，以及介于两者之间的所有要点。他最出名的可能是在“科巴尔太空计划”(Kerbal Space Program)中做了一些荒唐的事情(我对此略知一二！)。如果你是一位已经关注过斯科特的Ars读者，那么你很有可能是通过一段KSP视频被介绍到他的频道的。\n正如我们现在对几个不同的YouTuber所做的那样，我们在斯科特的日程表上预约了一些时间，然后带他沿着自己的记忆之路旅行，从他的一些优秀视频中提取了值得注意的、备受好评的评论，看看斯科特是否能告诉我们每条评论来自哪些视频。对于一个工科学生来说，斯科特的记忆力仍然很好，这或许并不令人惊讶-我们从他那里学到了相当多的东西，不仅是物理知识，还包括有时表现最好的视频可能是你甚至没有计划拍摄的视频。", "note_en": "After checking off a bucket list item by doing a video with  LGR&#39;s Clint Basinger last month, there was only one place we could go next:  to space. And no creator occupies the intersection of space science, gaming, and sheer lunacy quite like engineer and physics master  Scott Manley.\n Manley&#39;s videos are most often a mix of smarts and charm, delivered in a slow, calming Gaelic cadence. Manley&#39;s videos run the gamut from  space tech explainers to  game reviews to  physics thought experiments, and all points in between. He&#39;s perhaps best known for doing ridiculous things in   Kerbal Space Program (something I know  a little bit about!). It&#39;s pretty good odds that if you&#39;re an Ars reader who already follows Scott, you were introduced to his channel by a  KSP video.\n As we&#39;ve done now with a few different YouTubers, we booked some time on Scott&#39;s calendar and then took him on a trip down his own memory lane, pulling up notable and much-upvoted comments from some of his standout videos to see if Scott could tell us a bit about the videos each comment came from. Perhaps unsurprisingly for a student of engineering, Scott&#39;s recall remained excellent—and we learned quite a bit from him not just about physics but also about how sometimes the best-performing videos can be the ones you didn&#39;t even plan on shooting.", "posttime": "2020-10-20 23:27:58", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "youtube,曼利,scott,斯科特", "title": "斯科特·曼利(Scott Manley)讨论他在YouTube上发表的1000条评论", "title_en": "Blast off with Scott Manley as he discusses his top 1,000 YouTube comments", "transed": 1, "url": "https://arstechnica.com/gaming/2020/10/scott-manley-explores-the-far-reaches-of-space-and-his-top-1000-youtube-comments/", "via": "", "real_tags": ["youtube", "曼利", "scott", "斯科特"]}, {"category": "", "categoryclass": "", "imagename": "cc78088b8b88e209989acd47203163c2.jpg", "infoid": 1030087, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国司法部周二对谷歌提起诉讼，指控谷歌非法垄断搜索和广告市场，拉开了美国历史上最大的反垄断案之一的序幕。正如《华尔街日报》最先报道的那样，此案的重点是搜索和专注于搜索的广告，而不是该公司更广泛的定向广告业务。\n起诉书写道：“无数广告商必须为谷歌的搜索广告和一般搜索文本广告垄断付出代价，美国消费者被迫接受谷歌的政策、隐私做法和个人数据的使用；拥有创新商业模式的新公司无法从谷歌的长期阴影中涌现出来。”\n“拥有创新商业模式的新公司无法从谷歌的长长阴影中脱颖而出”\n在今天早上的电话会议上，司法部官员强调了谷歌控制搜索市场的规模和力量。“根据传统的反垄断原则，谷歌的行为是非法的，必须加以制止……。谷歌拥有或控制的搜索分销渠道约占美国一般搜索查询的80%，“司法部科技行业高级顾问Ryan Shores说。“我们要求法院打破谷歌对搜索分销的控制，这样竞争和创新才能站稳脚跟。”\n谷歌不同意，坚称其在搜索市场的高份额是消费者选择的结果。该公司在一份初步声明中称，“司法部今天的诉讼存在严重缺陷.”“人们使用谷歌是因为他们选择这样做，而不是因为他们是被迫这样做的，也不是因为他们找不到其他选择。\n此案是有史以来针对科技公司采取的最雄心勃勃的反垄断行动之一，汇集了美国司法部(Department Of Justice)和一系列州总检察长的平行调查。根据华盛顿邮报的一篇报道，司法部在9月底向州检察官通报了这起案件。据华尔街日报报道，预计将有11个不同的州总检察长在此案上签字，但其他人可能会单独提起反垄断指控。\n谷歌以前曾面临过反垄断行动，但规模从未如此之大。最重大的一次调查于2013年结束，当时该公司改变了AdSense政策，在没有采取正式法律行动的情况下解决了联邦贸易委员会(Federal Trade Commission)的一项调查。谷歌还面临欧盟监管机构的一系列罚款，其中包括15亿欧元的AdSense政策罚款，43亿欧元的Android软件捆绑罚款，以及24亿欧元的谷歌搜索中操纵购物结果的罚款。\n在7月份的国会科技反垄断听证会上，谷歌遭到了立法者的强烈批评，这表明该公司在华盛顿的盟友可能已经所剩无几。在开幕词中，众议员大卫·西西林(D-RI)指责该公司利用其作为搜索引擎的特权地位来粉碎其他领域的竞争对手。“谷歌的商业模式才是问题所在，”西西林说。“我们的文件显示，谷歌从一个通往网络其余部分的旋转门演变成了一个围墙花园，越来越多地将用户留在其网站内。”\n当时，谷歌首席执行官桑达尔·皮查伊(Sundar Pichai)为公司的行动辩护，称这是为用户服务的更广泛承诺的一部分。皮查伊说：“当我经营公司时，我真的专注于给用户提供他们想要的东西。”“我们以最高的标准行事。”", "note_en": "The Justice Department  filed suit against Google on Tuesday for illegal monopolization of the search and ad markets, kicking off one of the largest antitrust cases in US history. As first reported by   The Wall Street Journal, the case focuses on search and search-focused advertising, rather than the company’s broader targeted ad business.\n “Countless advertisers must pay a toll to Google’s search advertising and general search text advertising monopolies,” the complaint reads, “American consumers are forced to accept Google’s policies, privacy practices, and use of personal data; and new companies with innovative business models cannot emerge from Google’s long shadow.”\n “New companies with innovative business models cannot emerge from Google’s long shadow”\n In a call this morning, Justice Department officials emphasized the scale and power of Google’s control over the search market. “Google’s conduct is illegal under traditional antitrust principles and must be stopped.... Google owns or controls search distribution channels accounting for about 80 percent of general search queries in the United States,” said Ryan Shores, the Justice Department’s senior advisor for tech industries. “We’re asking the court to break Google’s grip on search distribution so that competition and innovation can take hold.”\n Google disagrees, insisting that its high share of the search market is the result of consumer choice. “Today’s lawsuit by the Department of Justice is deeply flawed,” the company said  in a preliminary statement. “People use Google because they choose to — not because they’re forced to or because they can’t find alternatives.\n The case is one of the most ambitious antitrust actions ever undertaken against a tech company, drawing together parallel investigations from the Department of Justice and a range of state attorneys general. The Department of Justice briefed state AGs on the case at the end of September, according to  a report from  The Washington Post. Eleven different state attorneys general are expected to sign onto the case, per the  Journal, but others are likely to file separate antitrust charges.\n Google has faced antitrust action before, but never on this scale. The most significant investigation concluded in 2013, when the company changed its AdSense policies to  resolve a Federal Trade Commission investigation without formal legal action. Google has also faced a string of fines from regulators in the European Union, including  €1.5 billion over its AdSense policy,  €4.3 billion over software bundling in Android, and  €2.4 billion for manipulating shopping results in Google search.\n Google drew significant criticism from lawmakers at  Congress’ tech antitrust hearing in July, suggesting the company may have few allies left in Washington. In opening remarks, Rep. David Cicilline (D-RI) accused the company of using its privileged position as a search engine to  crush competitors in other areas. “It is Google’s business model that is the problem,” Cicilline said. “Our documents show that Google evolved from a turnstile to the rest of the web to a walled garden that increasingly keeps users within its sites.”\n At the time, Google CEO Sundar Pichai defended the company’s actions as part of a broader commitment to serving users. “When I run the company, I’m really focused on giving users what they want,” Pichai said. “We conduct ourselves to the highest standard.”", "posttime": "2020-10-20 23:27:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,谷歌,google,rust,计划", "title": "美国政府计划今日对谷歌提出反垄断指控", "title_en": "The US government plans to file antitrust charges against Google today", "transed": 1, "url": "https://www.theverge.com/2020/10/20/21454192/google-monopoly-antitrust-case-lawsuit-filed-us-doj-department-of-justice", "via": "", "real_tags": ["美国", "谷歌", "google", "rust", "计划"]}, {"category": "", "categoryclass": "", "imagename": "cd756f3309d37b0d01c7b6ee199979a9.jpg", "infoid": 1030086, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sym联合创始人亚西夫·莫哈梅达利(Yasyf Mohamedali)在过去几年里一直担任医疗科技公司卡鲁纳健康(Karuna Health)的首席技术官。在这个职位上，他非常熟悉在高合规性行业工作，处理供应商审查和安全审计。为了使这些流程更有效率，他的团队制造了许多小型工具，但他意识到行业中的其他每个人都在做同样的事情。\n“作为一名工程师，当你看到人们一遍又一遍地建造同样的东西时，这是令人沮丧的，”Mohamedali告诉我。“多年来，我脑海里一直有这样的想法，‘如果我们只建一次，然后人们就不需要一遍又一遍地重复做同样的事情，会怎么样？’因此，当我离开卡鲁纳创办Sym时，最初，我想做的正是这件事-特别是为HIPAA做的。这是一种天真的做法，我想，‘你知道，什么，我只是要构建所有的工具，需要有人做HIPAA，把它像黑匣子一样开源。’“。\n然而，他意识到的是，公司有自己的安全和治理工作流，这些工作流往往共享相同的核心，但也有很多不同之处。因此，Sym现在要做的就是提供这些核心工具，让公司从公司创建的这个以开发人员为中心的工具箱中混合搭配他们需要的东西。\nMohamedali解释说：“我们正在构建的是一组映射到共享的20%核心的工作流模板和原语，然后是一组集成，您可以使用这些集成来拉下这些工作流模板，并通过将这些模板连接到所有不同的服务来编码最后一英里的差异。”\n这种方法的有趣之处在于，Sym提供了Python SDK，让开发人员只需几行代码就可以创建这些工作流和集成。这在一定程度上要归功于该公司让工程师重新掌控安全的理念--就像DevOps允许他们收回对基础设施和问答的控制权一样。“DevOps是一种东西。所以现在，DevSecOps需要成为一种东西。我们需要夺回安全保障。我们想成为这样做的工具，“他说。\n莫哈梅达利强调，这在很大程度上是一轮机会主义的融资，在接下来的几个月里，这次加薪不会改变公司路线图的任何内容。但由于Sym开始与大客户签约-并向他们做出了承诺-现在是筹集资金的好时机，特别是因为出现了合适的合作伙伴。这意味着雇佣更多的工程师，但随着时间的推移，该公司显然也计划建立自己的销售和营销团队。不过，该产品本身仍将处于私人测试版，直到明年年中。届时，Sym还将推出其平台的自助版。", "note_en": "Sym   co-founder Yasyf Mohamedali spent the last few years as CTO of health tech company  Karuna Health. In that role, he became intimately familiar with working in a high-compliance industry, handling vendor reviews and security audits. To make those processes more efficient, his team built lots of small tools, but he realized that everybody else in the industry was doing the same.\n   “As an engineer, it’s frustrating when you see people building the same thing over and over,” Mohamedali told me. “For years, I had this kind of concept in my head of, ‘what if we just built it all once, and then people didn’t have to keep redoing the same thing over and over?’ And so when I stepped away from Karuna to start Sym, originally, what I wanted to do was exactly that — and specifically for HIPAA. It’s kind of a naïve approach where I was like, ‘you know, what, I’m just going to build all the tools, someone needs to  do HIPAA and open source it as like a black box thing.”\n What he realized, though, is that companies have their own security and governance workflows that tend to share the same core but also a lot of variabilities. So what Sym now does is offer these core tools and lets companies mix and match what they need from this developer-centric toolbox the company has created.\n  “What we’re building is a set of workflow templates and primitives that map to that shared 20% core — and then a set of integrations that you can use to pull down those workflow templates, and codify that last mile variance by connecting those templates to all your different services,” Mohamedali explained.\n What’s interesting about this approach is that Sym offers a Python SDK and lets developers create these workflows and integrations with only a few lines of code. In part, that’s due to the company’s philosophy of putting engineers back into control of security — the same way DevOps allowed them to reclaim control over infrastructure and Q&amp;A. “DevOps is a thing. So now, DevSecOps needs to be a thing. We need to reclaim security. And we want to be the tool to do that with,” he said.\n Mohamedali stressed that this was very much an opportunistic round, and for the next few months this raise won’t change anything in the company’s road map. But because Sym started signing up large customers — and had made commitments to them — now was a good time to raise, especially because the right partners came along. That means hiring more engineers, but over time, the company obviously also plans to build out its sales and marketing teams. The product itself, though, will remain in private beta until about the middle of next year. At that time, Sym will also launch a self-serve version of its platform.", "posttime": "2020-10-20 23:23:11", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "安全,security", "title": "\nSym为其安全工作流平台筹集900万美元的首轮融资", "title_en": "\n\t\t\t\tSym raises $9M Series A for its security workflow platform\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/sym-raises-9m-series-a-for-its-security-workflow-platform/", "via": "", "real_tags": ["安全", "security"]}, {"category": "", "categoryclass": "", "imagename": "0ca239e009b9c19481b95f2e5ed11c51.jpg", "infoid": 1030085, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "克拉尔由曾为大型银行提供咨询服务的贝恩公司(Bain&amp；Co.)前顾问斯特凡·穆勒(Stefan Moller)创立，他将穆勒在墨西哥的工作经验与他在德国银行界的人脉以及他在柏林n26的技术团队的关系结合在一起，创建了一家为墨西哥客户提供存款和信贷服务的挑战者银行。\n根据穆勒的说法，墨西哥市场在金融行业方面服务严重不足。只有10%的墨西哥成年人拥有信用卡，穆勒说这是目前最便宜的消费贷款工具。\n这就是Klar去年推出信用卡和借记服务的原因。该公司拥有20万银行客户，其中约2.7万名客户已通过银行获得贷款。据穆勒称，一笔典型的贷款约为110美元，每笔贷款的年利率为68%。\n如果这听起来是高利贷，那是因为它确实是-至少按照美国的标准是这样的。根据WalletHub的数据，在美国，一张典型的信用卡的使用率在16%到24%之间。在墨西哥，穆勒说典型的利率是70%(难怪只有10%的成年人有信用卡)。\n尽管如此，扩大信贷和借记服务的机会对Prosus来说是有意义的，它与包括国际金融公司(International Finance Corporation)和前投资者Quona Capital在内的投资者一起领导了公司的首轮融资，Quona Capital领导了Klar的种子轮，Mouro Capital(前身为桑坦德创新风险投资公司(Santander InnoVentures)和aCrew)。\n负责该公司投资的普罗苏斯风险投资公司负责人巴纳夫谢·法蒂埃表示，对KLAR的承诺很可能是她的公司在该地区进行的许多投资中的第一笔-无论是对金融科技，还是更广泛的墨西哥科技生态系统。\n普罗苏斯以早期押注发展中市场的新兴科技公司而闻名。也许最著名的是，该公司的母公司是腾讯的早期投资者-这是一笔数百万美元的赌注，已经产生了数十亿美元的回报。\n在这笔投资之前，Prosus在拉丁美洲地区的工作仅限于对Creditas和Movile等巴西科技公司的投资。\n普罗苏斯风险投资公司(Prosus Ventures)与正在用技术解决重大社会问题的企业家合作，以一种独特的当地方式。我们投资于技术可以给消费者生活带来有意义变化的经济部门。Klar已经确定了墨西哥金融市场的巨大需求，并通过他们的信贷和借记提供了一个独特的解决方案，“Prosus Ventures的Banafsheh Fathieh在一份声明中说。“在不到一年的时间里，团队已经显示出有能力为大众打造一家世界级的数字银行，一家专注于金融接入和包容的数字银行。我们非常高兴能与他们合作完成这项任务。“", "note_en": "Founded by Stefan Moller, a former consultant at Bain &amp; Co. who advised large banks, Klar blends Moller’s work experience in Mexico with his connections to the German banking world and the tech team at  Berlin  -based  n26, to create a challenger bank offering deposit and credit services for Mexican customers.\n The Mexican market is woefully underserved when it comes to the finance industry, according to Moller. Only 10% of Mexican adults have a credit card, something Moller said is the cheapest consumer lending instrument around.\n  That’s why Klar launched last year with both credit and debit services. The company has 200,000 banking customers and roughly 27,000 of those customers have taken out loans through the bank. A typical loan is roughly $110, according to Moller, and each loan comes with a 68% annual percentage rate.\n If that sounds usurious, that’s because it is — at least by U.S. standards. In the U.S. a typical credit card will run somewhere between 16% and 24%, according to data from WalletHub. In Mexico, Moller said the typical interest rate is 70% (no wonder only 10% of adults have credit cards).\n Still, the opportunity to expand credit and debit services made sense to Prosus, which led the company’s Series A round alongside investors including the   International Finance Corporation  and former investors   Quona capital , who led Klar´s SEED round,   Mouro Capital  (formerly Santander Innoventures) and aCrew.\n Banafsheh Fathieh, the  Prosus Ventures   principal who led the investment for the firm, said that the commitment to Klar will likely be the first of many investments that her firm makes in the region — both in fintech and likely in Mexico’s tech ecosystem more broadly.\n Prosus is famous for making early bets on emerging technology companies in developing markets. Perhaps most famously the firm’s parent company was an early investor in Tencent — a multi-million dollar bet that has generated billions in returns.\n Before this investment, Prosus had confined its work in the Latin American region to investments in Brazilian technology companies like  Creditas   and  Movile  .\n “Prosus Ventures partners with entrepreneurs that are solving big societal problems with technology, in a uniquely local way. We invest in sectors of the economy where technology can lead to meaningful change in the lives of consumers. Klar has identified a massive need in the Mexican financial market and brings a unique solution through their credit and debit offering,” said Banafsheh Fathieh from Prosus Ventures, in a statement. “In less than a year, the team has shown an ability to build a world-class digital bank for the masses, one focused on financial access and inclusion. We are very excited to partner with them on that mission.”", "posttime": "2020-10-20 23:22:57", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "prosus", "title": "\n领导一轮1500万美元的融资，Prosus Ventures使挑战者银行Klar成为其在墨西哥的第一笔赌注", "title_en": "\n\t\t\t\tLeading a $15 million round, Prosus Ventures makes the challenger bank Klar its first bet in Mexico\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/leading-a-15-million-round-prosus-ventures-makes-the-challenger-bank-klar-its-first-bet-in-mexico/", "via": "", "real_tags": ["prosus"]}, {"category": "", "categoryclass": "", "imagename": "a2cc3137e4ee29dcbb58282675d87469.jpg", "infoid": 1030084, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这两大洲对当地初创企业的风险资本投资比一段时间以来都多，这突显出美国第三季度强劲的风险投资结果不是偶然的，而是更广泛趋势的一部分。\n该交易所探索初创企业、市场和资金。每天早上在Extra Crunch上阅读它，或者每周六获得Exchange时事通讯。\nCB Insights汇编的数据显示，随着2020年下半年的到来，风险投资家在全球投入的美元数量正在加速增长。第三季度提供的创纪录数据与第一季度末和第二季度初超越初创公司的担忧形成鲜明对比，当时新冠肺炎给一些年轻的科技公司带来了出人意料的动荡。\n但风险投资活动的下降是短暂的。随着许多初创公司销售软件，他们发现自己的产品突然需求更大；在众多垂直市场中，随着世界适应新的工作环境，初创公司受益于加速的数字转型。除了视频会议工具等明显的赢家外，从远程学习到安全工具的其他类别也得到了提升。\nCOVID-顺风，有时被称为顺风，似乎并不是美国或北美特有的。相反，根据风险投资数据，我们可以推断，世界各地的初创企业也在享受类似的提振。1个。\n让我们来看看这些数字，以便更好地了解欧洲和亚洲的情况。(顺便说一句，如果你有非洲初创企业风险投资结果的数据，请给我发电子邮件，因为我正开始四处寻找更全球化的图景。最近的交易活动清楚地表明，美国媒体需要对非洲大陆做更多、更好的报道。)。\n风险投资界的重心仍然落在美国的某个地方，但以下是三大洲在2020年第三季度的管理情况，看看它们筹集的风险投资：\n从我们的数据集来看，亚洲的结果是至少自2018年第四季度以来的最好结果。欧洲的总数追平了2019年第二季度创下的最高纪录。但作为一对合并后的组合，北美以外的风险资本可能刚刚经历了多年来最好的一个季度，如果不是有史以来的话。", "note_en": "The two continents enjoyed more venture capital investment into their local startups than in some time, underscoring that  strong VC results the United States saw in the third quarter were not a fluke, but part of a broader trend.\n  The Exchange explores startups, markets and money. Read it  every morning on Extra Crunch, or get  The Exchange newsletter every Saturday.\n  Data  compiled by CB Insights shows a global acceleration in the number of dollars venture capitalists are putting to work around the globe as 2020 chews through its second half. The record figures that Q3 supplied stand in stark contrast to the  fear that overtook startup-land in late Q1 and early Q2, when COVID-19  threw some young technology companies surprise turbulence.\n But the dip in venture capital activity was short-lived. As many startups sold software, they found their wares  suddenly in greater demand; across a host of verticals, startups benefited from an  accelerated digital transformation as the world adapted to a new work environment. Aside from clear winners  like video conferencing tools, other categories from  remote learning to  security tooling also got a bump.\n The COVID-tailwind, as it is sometimes called, does not appear to be specific to the United States or North America. Instead, given what the venture capital data states, we can infer that startups the world around are enjoying a similar boost. 1\n Let’s get into the numbers to better understand what’s up in Europe and Asia. (As an aside, if you have data on African startups’ venture capital results, please email me as I am starting to poke around for a more global picture.  Recent deal activity makes it plain that American media needs to do more and better reporting on the continent.)\n  The venture capital world’s center of gravity still lands somewhere in the United States, but here’s how the three continents managed in Q3 2020, looking at their raised venture capital dollars:\n  Asia’s result was its best since at least Q4 2018, as far back as our dataset goes. Europe’s total tied its high-water mark set in Q2 2019. But as a combined pair, venture capital outside North America might have just had its best quarter in years, if not ever.", "posttime": "2020-10-20 23:22:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "风险投资,企业,accelerate,美国", "title": "\n随着初创企业在创纪录的第三季度加速，欧洲和亚洲获得了巨大的风险投资业绩", "title_en": "\n\t\t\t\tAs startups accelerate in record Q3, Europe and Asia rack up huge VC results\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/as-startups-accelerate-in-record-q3-europe-and-asia-rack-up-huge-vc-results/", "via": "", "real_tags": ["风险投资", "企业", "美国"]}, {"category": "", "categoryclass": "", "imagename": "11bacea8b3c054855efcd60bd08e41f2.jpg", "infoid": 1030083, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尽管暴雪在“星际争霸II”推出近十年后停止了新的更新，但游戏投资者们正从游戏早期开发团队的关键成员那里为下一个新玩意儿提供资金。\n暴雪兽医蒂姆·莫滕，星际争霸II的前制作总监；蒂姆·坎贝尔，魔兽争霸III的首席广告设计师；与暴雪的一些同事一起成立了一个新的工作室，将实时战略游戏带给更多的观众。\n新公司Frost Giant Studios表示，该公司已经从专注于游戏和合成媒体的投资公司Bitkraft Ventures获得了470万美元的种子资金，并获得了1 Up Ventures、GC Tracker、Riot Games和Griffin Gaming Partners的参与。\nBitkraft Ventures的创始普通合伙人斯科特·鲁普(Scott Rupp)说：“弗罗斯特巨人制片厂的使命是将最受欢迎的类型之一带给更广泛的观众。”我们很高兴看到一些在实时战略游戏开发方面最有经验的领导者走到一起，共同打造一款游戏，这款游戏将确保RTS类型的未来增长，同时保持RTS的核心玩家幻想。“。\n基于他们在过去十年中开发星际争霸II的经验，弗罗斯特巨人工作室的战略专注于让游戏更好、更容易、更具协作性。\n可以把它看作是把王室战斗类型中一些最好的元素带到实时战略游戏中，着眼于在体育运动中的可玩性和竞争机会。\n“实时战略玩家是一个非常有激情的社区，他们值得的不仅仅是一款伟大的新游戏，而是一款他们可以广泛与朋友分享的游戏。建立一个称职的继任者需要时间，但我们非常兴奋和感激能够在弗罗斯特巨人工作室继续推进实时战略，“弗罗斯特巨人工作室首席执行官蒂姆·莫滕(Tim Morten)说。", "note_en": "Even as Blizzard pulls the plug on new updates for its StarCraft II game, nearly a decade after its launch, gaming investors are financing the next new thing coming from key members of the game’s early development team.\n Blizzard vets Tim Morten, the former production director for StarCraft II; and Tim Campbell, the lead campaign designer for WarCraft III; have launched a new studio with a number of colleagues from Blizzard to bring real time strategy games to a bigger audience.\n The new company,  Frost Giant Studios, has picked up $4.7 million in seed funding from the gaming and synthetic media focused investment firm, Bitkraft Ventures, along with participation from 1 Up Ventures, GC Tracker, Riot Games, and Griffin Gaming Partners, the company said.\n  “Frost Giant Studios is on a mission to bring one of the most beloved genres to a broader audience,” said Scott Rupp, Founding General Partner at Bitkraft Ventures. “We are excited to see some of the most experienced leaders in real-time strategy game development come together to build a game that will secure the future growth of the RTS genre while staying true to the core player fantasy of RTS.”\n Building on their experience developing StarCraft II over the past ten years, the Frost Giant Studios strategy is focused on making gameplay better, easier, and more collaborative.\n Think of it as taking some of the best elements of the battle royal genre and bringing them into real-time strategy games with an eye toward playability and competitive opportunities in esports.\n “Real-time strategy players are an incredibly passionate community, and they deserve not just a great new game, but one they can share broadly with friends. Building a worthy successor will take time, but we’re incredibly excited and grateful to carry real-time strategy forward at Frost Giant Studios,” said Tim Morten, Frost Giant Studios CEO.", "posttime": "2020-10-20 23:22:28", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "游戏,工作室,sunsets", "title": "\n随着暴雪日落星际争霸II，它的一些主要创造者为一个新的游戏工作室筹集资金", "title_en": "\n\t\t\t\tAs Blizzard sunsets StarCraft II, some of its key creators raise cash for a new gaming studio\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/frost-giant-studios-phoenix-from-starcraft-ashes/", "via": "", "real_tags": ["游戏", "工作室", "sunsets"]}, {"category": "", "categoryclass": "", "imagename": "44cf254a14c2e6e7a145e319b011ac62.png", "infoid": 1030082, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于蒙特利尔的YPC Technologies今天宣布，它已经筹集了180万美元的种子轮资金。由Hike Ventures和Real Ventures牵头，这笔资金包括丰田人工智能风险投资公司(Toyota AI Ventures)和上坡资本(Uplill Capital)等公司的参与，旨在帮助该公司试验其厨房机器人技术。\n丰田的资金是该公司“创新的呼唤”的一部分，该公司发现它投资于早期的国家人工智能、机器人和其他尖端技术。TRI的吉尔·普拉特(Gil Pratt)在一份声明中说：“在TRI，我们一直在寻找增强人类能力、帮助提高生活质量的方法。”“通过创新的号召，我们第一手看到了像YPC科技公司这样的初创企业是如何满足城市社区人们的需求的，我们对他们的努力感到鼓舞和兴奋。”\n在新冠肺炎倒闭的情况下，机器人和自动化发电一直是风投投资的一个相当热门的类别。特别是食品机器人，一直是人们关注的焦点。当然，这是有道理的。毕竟，为人们提供食物几乎是服务所能得到的最基本的东西。这家初创公司的解决方案是围绕一个机械臂构建的，它可以用各种不同的配料准备食谱-与我们看到的其他型号类似。\n这项基于订阅的服务的卖点之一是，与标准的商业厨房相比，它需要的空间相对较小。这使得它在应用程序上更加灵活，不仅可以在餐馆部署，还可以在幽灵厨房和酒店等较小的设施中部署。\n该公司还指出，该系统旨在与人类协同工作，取代重复性任务，而不是直接取代员工职位。", "note_en": "Montreal-based  YPC Technologies today announced that it has raised a $1.8 million seed round. Led by Hike Ventures and Real Ventures, the funding includes participation from Toyota AI Ventures and Uphill Capital, among others, designed to help the company pilot its kitchen robotics technology.\n Toyota’s funding came as part of the company’s “Call of Innovation,” which finds it investing in early state AI, robotics and other cutting edge technologies. “At TRI, we’re always searching for ways to amplify human ability and help improve quality of life,” TRI’s Gil Pratt said in a statement. “Through the call for innovation, we got a first-hand look at how startups like YPC Technologies are addressing the needs of people in urban communities, and we’re encouraged and excited by their efforts.”\n  Robotics and automation generation has been a fairly hot category for VC investment, amid the on-going COVID-19 shut down. Food robotics, in particular, have been a focus. And it makes sense, certainly. After all, providing people with sustenance is about as essential as services get. The startup’s solution is built around a robotic arm that can prepare recipes with a variety of different ingredients — similar to other models we’ve seen.\n One of the subscription-based service’s selling points is that it requires a relatively small amount of space, versus a standard commercial kitchen. That makes is a bit more versitile in applications, allowing it to be deployed in not only restaurants but smaller facilities like ghost kitchens and hotels.\n The company also points out that the system is designed to work collaboratively with humans, replacing repetitive tasks rather than staff positions outright.", "posttime": "2020-10-20 23:22:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "机器人,厨房,kitchen", "title": "\n机器人厨房初创公司YPC筹集180万美元种子轮", "title_en": "\n\t\t\t\tRobotic kitchen startup YPC raises a $1.8M seed round\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/20/robotic-kitchen-startup-ypc-raises-a-1-8m-seed-round/", "via": "", "real_tags": ["机器人", "厨房", "kitchen"]}, {"category": "", "categoryclass": "", "imagename": "0498fa6474ad6d2d18227c6c018514cb.png", "infoid": 1030081, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这一版本中，Firefox引入了许多改进，使观看视频变得更加愉快：\n画中画按钮具有新的外观和位置，使您可以更轻松地查找和使用该功能。\n画中画现在为Mac用户提供了一个键盘快捷键(Option+Command+Shift+右括号)，可以在您开始播放视频之前使用。\n对于Windows用户，Firefox现在对硬件解码的视频使用DirectComposition，这将提高视频播放期间的CPU和GPU使用率，从而延长电池续航时间。\nFirefox的速度比以往任何时候都要快，页面加载和启动时间的性能都有所提高：\n恢复会话的速度加快了17%，这意味着您可以更快地从您停止的地方恢复；\n现在，当您从Firefox工具栏将网页保存到Pocket时，您可以浏览新文章。", "note_en": "With this release, Firefox introduces a number of improvements that make watching videos more delightful:\n the Picture-In-Picture button has a new look and position, making it easier for you to find and use the feature.\n Picture-In-Picture now has a keyboard shortcut for Mac users (Option + Command + Shift + Right bracket) that works before you start playing the video.\n For Windows users, Firefox now uses DirectComposition for hardware decoded video, which will improve CPU and GPU usage during video playback, improving battery life.\n  Firefox is faster than ever with improved performance on both page loads and start up time:\n Restoring a session is 17% quicker, meaning you can more quickly pick up where you left off;\n  You can now explore new articles when you save a webpage to Pocket from the Firefox toolbar.", "posttime": "2020-10-20 23:17:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,视频", "title": "Firefox 82", "title_en": "Firefox 82", "transed": 1, "url": "https://www.mozilla.org/en-US/firefox/82.0/releasenotes/", "via": "", "real_tags": ["firefox", "视频"]}]