[{"category": "", "categoryclass": "", "imagename": "f0944f6a9d1121a97419b2d4dd62f315.jpeg", "infoid": 1069577, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "有每个人都听说过的浏览器。还有一些，无论出于何种原因，都消失了。这些是后者。或者，您可能知道名单上有一对夫妇。看看我能不能难倒你。 Samba 也称为 MacWWW，是 Web 创始团队的两名成员从 CERN 发布的最后一款浏览器。 Nicola Pellow 在实习期间编写了具有影响力的跨平台行模式浏览器，在完成学位后返回 CERN 继续她的工作。罗伯特·卡利奥 (Robert Calliau) 加入了她的行列，他与蒂姆·伯纳斯·李爵士 (Sir Tim Berners-Lee) 合作制定了网络的最初提案，并主要负责该提案被 CERN 采纳。他还是有史以来第一次网络会议的组织者。 Calliau 和 Pellow 认识到早期网络浏览器的一个差距。没有一个可用于 Mac。因此，他们创建了一个支持基本 HTML 的 Mac 兼容、纯文本浏览器。它总是比其他任何东西都更重要的是作为概念证明，一种向 Mac 用户展示网络的方式。即便如此，它有一个非常独特的功能，称为“跟踪”，它让浏览器的用户看到网页呈现方式的时间线。尽管跟踪对 Web 程序员很有用，但它表明这是开发人员的浏览器，而不是消费者的浏览器。在 Samba 发布后的一年内，Mosaic 将发布他们自己的 Mac 浏览器版本，由 Aleks Totić 开发，而 Samba 将不再有用。 1993 年，Marc Andreessen 离开 NCSA 的 Mosaic 项目，与 Jim Clark 一起启动他的“马赛克杀手”浏览器后，NCSA 决定开始许可他们的浏览器用于商业用途（拒绝直接进入市场是 Andreessen离开）。该许可使 Mosaic 成为了 Netscape 之前的一些最成功浏览器的起点，其中可能包括所有最成功的浏览器，Microsoft 的 Internet Explorer。其中一个项目被称为 Internet in a Box。 1994 年，O&#39;Reilly 与网络开发领导者 Spry 合作创建了他们的 Internet in a Box 或 IBox，它将调制解调器、订阅 Internet 访问和用于连接 Internet 的软件捆绑到一个包中。 Internet in a Box 的用户可以按照一些说明立即开始浏览网页，而这需要一两年前的专门时间和一些技术知识。对许多人来说，Ibox 是他们进入 Internet 的第一步，也是最有用的部分，即网络。为了服务这些网络用户，IBox 附带了自己的浏览器。一个名为 AirMosaic 的浏览器。\nMosaic 是由研究实验室的学生构建的，因此 AirMosaic 扩展了浏览器，使其更易于日常消费者使用。今天感觉司空见惯的功能，书签和详细的浏览历史，当它们被添加到 AirMosaic 时仍然是一个新奇事物。它有一个“信息亭”模式，它删除了网站周围的所有镶边（地址栏、后退按钮、书签），只留下网站本身。这是一个您仍然可以在浏览器中找到的功能，尽管它已经在很大程度上下降了。在早期的网络时代，它非常受欢迎，当时员工仍然不得不租用大屏幕的会议室来向他们的老板演示网络的功能。 AirMosaic 是真正意义上的实用浏览器，它适合所有人，适合最新的初学者。 Dave Raggett 是 Web 标准过程中的固定工具。自 1995 年以来，他一直在 W3C 从事开放标准方面的工作。在此之前，Raggett 在惠普公司担任研究员。在他任职期间，他第一次发现了网络。随着 Web 的发展，他担心浏览器开始将标准抛在后面，在 HTML 中实现非标准功能以适应 Web 开发人员更高级的布局和设计选项。他开始着手制定新的 HTML 规范（称为 HTML+），其中包括这些非标准功能，例如表格、图形和图像的标记以及新的 HTML 标签。为了演示这些功能，他创建了一个名为 Arena 的浏览器。 Arena 在 1993 年发布时是唯一支持非官方 HTML+ 标准的浏览器。这使得它相当先进，但也不过是一个实验。 HTML+ 正式并入 HTML 后，Arena 成为 W3C 测试新 Web 标准的首选浏览器，但从未流行使用。 InternetWorks 偶尔会被提及为第一个具有标签的浏览器，该功能在浏览器大战后 Firefox 发布之前不会重新出现。然而，由 BookLink Technologies 开发的 InternetWorks 在 1990 年代初发布时捆绑了许多有用的功能，前提是您是 Windows 用户。由于采用了渐进式加载技术，该技术首先呈现文本，然后呈现图像（在宽带出现之前的日子里很重要），该浏览器以异常快速而闻名。它还建立在可移植性原则上，可以嵌入电子邮件客户端甚至 Microsoft Word 中，以便在工作时随身携带网络。但它最显着的特点——当然除了标签式浏览——是它的卡片目录。借鉴图书馆的比喻，InternetWorks 允许其用户按主题或他们想要使用的任何其他层次结构将书签组织到不同的目录中。页面可以拖放到任何目录中，在那里它们立即被保存以供离线浏览。存储大脑碎片的一站式商店。 InternetWorks 因自身的成功而受到影响。它于 1995 年在网络历史的早期被 AOL 收购，并嵌入到 AOL 平台中。几年后，AOL 以 40 亿美元收购 Netscape，使之前对 BookLink 和 InternetWorks 的投资黯然失色。\nWebExplorer 可能只是这个列表中评价最高的浏览器，但也是最不为人知的。它是由 IBM 为其曾经流行但现已停产的操作系统 OS/2 创建的。该操作系统的第 3 版被称为“Warp”，它与 WebExplorer 浏览器捆绑在一起。没有多少人使用它，但那些使用它的人经常对它的功能赞不绝口。 WebExplorer 是最早支持 HTML 表格和 GIF 的浏览器之一。它内置了有用的工具，例如演示模式（很像 AirMosaic），它从浏览器中删除了 chrome，只在屏幕上留下网站。但与 InternetWorks 非常相似的是，WebExplorer 以创新的浏览历史方法脱颖而出。 1995 年 WebExplorer 发布后，网络仍然是（顾名思义）探索的地方。由于可供浏览的网站少得多，许多网络用户发现自己经常浏览以前访问过的网站。 WebExplorer 具有独特的“WebMap”，这是您访问过的网站的视觉轨迹，直接在浏览器中以分层、链接的视觉方式排列。它的界面类似于任何操作系统上的文件系统，点击一个网站会告诉你你接下来要去哪里，那些页面带你去哪里，以及你在网络空间中规划自己的方式。 WebExplorer 出现在杂志和书籍中，并被誉为浏览器中的佼佼者……大约一年了。当 Netscape 获得成功时，WebExplorer 将成为一种记忆。在 Netscape 输掉浏览器战争并将他们的浏览器作为开源发布后，一些程序员开始在 Mac 版本上工作。他们从最终成为 Mozilla Firefox 的正在开发的浏览器中获取渲染引擎，并将其调整为原生 Mac Cocoa API。结果是 Chimera，后来更名为 Camino，它在 2002 年推出了第一个测试版，比苹果团队的第一个官方浏览器 Safari 上市前一年。 Camino 在其开发周期中遇到了与任何浏览器一样多的故障。最初的团队成员之一 Dave Hyatt 离开并加入了 Safari 团队。当 AOL 接管 Netscape 时，他们在计划在 MacWorld Expo 上线前几个月剥夺了该项目的所有成员，只剩下一个基本的工作人员。结果，直到 2006 年，也就是最初开始开发四年后，它才发布了 1.0 版。尽管如此，卡米诺还是设法获得了一小部分忠实的追随者，他们拥护其在开源技术方面的血统以及对速度和性能的追求高于一切。专为 Mac 构建，它通常能够在事后排除移植到 Mac 的浏览器。而且因为它是公开构建的，所以它经常采用新功能或尖端的 UI 改进（早期版本的浏览器在单独的选项卡中打开新链接而不是新窗口，这是一个简单但非常受欢迎的功能），使其领先于它的竞争。\nCamino 设法继续开发直到 2012 年左右，并在 2013 年正式停止使用浏览器。到那时，Webkit 衍生的新贵 Safari 和谷歌 Chrome 几乎让它们尘埃落定。每月两次发送关于网络历史、构建它的不可思议的人以及您从未听说过的所有网站、代码和浏览器的快讯。", "note_en": "There are the browsers that everyone’s heard of. And then there are some that, for whatever reason, faded away. These are the latter.\n    Or maybe there’s a couple on the list that you know about. See if I can stump you.\n   Also known as MacWWW, Samba was the final browser to be released out of CERN from two members of the web’s founding team. Nicola Pellow, who had written the influential and cross-platform line mode browser while still an intern, returned to CERN to continue her work after she finished her degree. She was joined by Robert Calliau, who worked with Sir Tim Berners-Lee on the original proposal for the web, and largely responsible for its adoption by CERN. He was also the organizer of the first ever web conference.\n Calliau and Pellow recognized a gap in early web browsers. None were available for the Mac. So they created a Mac compatible, text-only browser with basic HTML support. It was always meant as a proof of concept more than anything else, a way of demonstrating the web to Mac users. Even so, it had one very unique featured it called “Trace,” which let users of the browser see a timeline of how a webpage was rendered. Though trace was useful for web programmers, it made the point that this was a developer’s browser, not a consumer one.\n Within a year of Samba’s release, Mosaic would release their own version of a Mac browser, developed by Aleks Totić, and Samba would cease to be useful.\n   After Marc Andreessen  left the Mosaic project at NCSA to kickstart his “Mosaic killer” browser with Jim Clark in 1993, NCSA made the decision to begin licensing their browser for commercial use (it’s refusal to enter the market directly was part of the reason for Andreessen’s departure). The license made Mosaic a starting point for some of the most successful browsers of the pre-Netscape web, including maybe the most successful of them all, Microsoft’s Internet Explorer. One of these projects was called Internet in a Box.\n In 1994, O’Reilly partnered with networking development leader Spry to create their Internet in a Box, or IBox, which bundled together a modem, subscription Internet access, and software for connecting to the Internet into a single package. Users of Internet in a Box could follow a few instructions and start browsing the web right away, something that required dedicated time and some technical know-how just a year or two earlier. For many, Ibox was their first step into the Internet and it’s most widely useful part, the web. To serve those web users, IBox shipped with a browser of its own. A browser called AirMosaic.\n Mosaic was built by students in a research lab, so AirMosaic extended the browser to make it easier to use for everyday consumers. Features that feel commonplace today, bookmarks and a detailed browsing history, were still a novelty when they were added to AirMosaic.\n And it had a “kiosk” mode, which removed all of the chrome around the website (the address bar, back button, bookmarks) and left only the website itself. It’s a feature that you still can find in browsers, though it has largely fallen off. It was immensely popular in the days of the early web, when employees still had to rent out conference rooms with big screens to demo the capabilities of the web to their bosses. AirMosaic was a utility browser in the truest sense, it was all things to all people, tailored to the newest of beginners.\n    Dave Raggett is a fixture in the web standards process. He has been working at the W3C on open standards since 1995. Before that, Raggett worked as a researcher at Hewlett-Packard. It was during his tenure there that he first found the web. As he watched the web grow, he feared that browsers were beginning to leave standards behind, implementing non-standard features in HTML to accommodate more advanced layout and design options for web developers. He began to work on a new specification for HTML — dubbed HTML+ — that included these non-standard features, such as tables, markup for figures and images, and new HTML tags.\n To demonstrate these features, he created a browser called Arena. Arena was the only browser to support the unofficial HTML+ standard upon its release in 1993. That made it fairly advanced, but also little more than an experiment. Once HTML+ was folded into HTML officially, Arena became the browser of choice at the W3C for testing new web standards, but it never fell into popular use.\n   InternetWorks is occasionally mentioned as the first browser to have tabs, a feature that wouldn’t re-appear until Firefox was released following the browser wars. And yet InternetWorks, developed by BookLink Technologies, came bundled with a host of useful features when it was released in the early 1990’s, provided you were a Windows user.\n The browser was known for being exceptionally fast, thanks to a progressive loading technique that rendered out text first, images second (important in the days before broadband). It was also built on a principle of portability, and could be embedded inside of email clients and even Microsoft Word, to bring the web with you as you worked. But its most distinctive feature — besides tabbed browsing of course — was its Card Catalog. Drawing on a library metaphor, InternetWorks allowed its users to organize bookmarks into different catalogs, by subject or any other hierarchy they wanted to use. Pages could be drag and dropped into any catalog, where they were instantly saved for browsing offline. A one-stop shop for storing bits of your brain.\n InternetWorks suffered from its own success. It was acquired by AOL early on in the web’s history, in 1995, and was embedded into the AOL platform. A few years later, AOL would acquire Netscape for 4 billion dollars, overshadowing any previous investment in BookLink, and InternetWorks.\n   WebExplorer may just be the most highly rated browser on this list, but also the least known. It was created by IBM for their once popular but now discontinued operating system called OS/2. Version 3 of that operating system was called “Warp” and it came bundled with the WebExplorer browser. There wasn’t a ton of people that used it, but those that did frequently raved about what it could do.\n WebExplorer was one of the first browsers that supported HTML tables and GIFs. It had useful tools embedded inside, such as a presentation mode (much like AirMosaic) that removed the chrome from the browser and left only the website on screen. But much like InternetWorks, WebExplorer set itself apart with an innovative approach to browsing history.\n Upon the release of WebExplorer in 1995, the web was still a place of (as the name suggests) exploration. With far less websites to browse, many web users found themselves often combing through websites they had visited before. WebExplorer featured a unique “WebMap,” a visual trail of websites that you had visited, arranged in a hierarchical, linked visual directly in the browser. Its interface is similar to the filesystem on any operating system, clicking a website would show you where you journeyed to next, and where those pages took you, and on and on as you charted your way through cyberspace.\n WebExplorer was featured in magazines and books and hailed as a one of a kind of a browser… for about a year. By the time Netscape gained steam, WebExplorer would become little more than a memory.\n   After Netscape lost the browser wars and released their browser as open source, a few programmers began to work on a Mac version. They took the rendering engine from the in-progress browser that would eventually become Mozilla Firefox, and adapted it to the native Mac Cocoa API. The result was Chimera, later renamed to Camino, which had its first version in beta in 2002, a year before Safari — the first official browser from the Apple team — hit the market.\n Camino has had about as many bad breaks as any browser can during their development cycle. One of the original team members, Dave Hyatt, left to go and join the Safari team. When AOL took over Netscape, they stripped the project of all but a bare-bones crew just months before it was set to go live at MacWorld Expo. As a result, it didn’t even manage to release Version 1.0 until 2006, four years after development initially began.\n Nevertheless, Camino managed to gain a loyal if small following of people that embraced its pedigree in open source technology and its devotion to speed and performance above all else. Built specifically for the Mac, it was often able to edge out browsers ported to the Mac as an afterthought. And because it was being built in the open, it often adopted new features or cutting edge UI improvements (an early version of the browser opened new links in separate tabs instead of new windows, a simple but extremely popular feature) that kept it ahead of its competition.\n Camino managed to continue devleopment until about 2012, and formally discontinued the browser in 2013. By then, Webkit-dervied upstarts Safari and Google Chrome had all but left them to dust.\n  A twice monthly dispatch about the web&#39;s history, the incredible people that built it, and all the websites, code, and browsers you&#39;ve never heard of.", "posttime": "2021-07-25 16:39:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "浏览器,list", "title": "一个有趣的浏览器列表", "title_en": "A Fun List of Browsers", "transed": 1, "url": "https://thehistoryoftheweb.com/a-fun-list-of-browsers-youve-never-heard-of/", "via": "", "real_tags": ["浏览器", "list"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069576, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "8 月 3 日，WebAssembly CG 将调查 JavaScript 字符串语义/编码是否超出接口类型提案的范围。这一决定可能会得到谷歌 (C++)、Mozilla (Rust) 和字节码联盟 (WASI) 的支持，他们似乎有共同的兴趣，专门在 WebAssembly 中推广 C++、Rust 和非 Web 语义和概念。如果投票通过（这很可能），AssemblyScript 将受到严重影响，因为由于无法解决的正确性和安全问题，必须弃用它开发的工具，该决定强加于使用类似 JavaScript 的 16 位字符串语义的语言及其用户。我们期望，AssemblyScript 保证数据完整性的唯一可行方法是将其对接口类型的依赖替换为对引用类型的依赖，并从 JavaScript 导入其标准库。虽然无法知道全面的影响，但这种转变可能会导致范围过大，或者，如果可以完成，可能会影响在 Wasmtime 和 Wasmer 等 WASI 主机上运行 AssemblyScript 的用户，因为 JavaScript 标准都不是这些平台上将不提供库或 GC。因此，在这些平台上使用未来版本的 AssemblyScript 可能不再可行，我们强烈建议避免使用早期版本，因为这些版本不安全。我们认为，由此产生的 Web 平台、编程语言和安全漏洞，以及 AssemblyScript 项目的特别不幸的结果，应该被阻止，但经过多年的专注而徒劳的努力，我们也不得不得出结论，我们对巨头无能为力.作为 TypeScript 的变体，无需学习新语言，即可轻松编译为 WebAssembly。与现有的 Web 生态系统集成 - 无需设置繁重的工具链。只需 npm 安装即可！ #!runtime=stub/** 计算第 n 个斐波那契数。 */export function fib(n: i32): i32 { var a = 0, b = 1 if (n &gt; 0) { while (--n) { let t = a + ba = bb = t } return b } return a}#!html&lt;textarea id=&quot;output&quot; style=&quot;height: 100%; width: 100%&quot; readonly&gt;&lt;/textarea&gt;&lt;script&gt;loader.instantiate(module_wasm, { /* 导入 */ }) .then (({exports }) =&gt; { const output = document.getElementById(&#39;output&#39;) for (let i = 0; i &lt;= 10; ++i) { output.value += `fib(${i}) = ${exports.fib(i)}\\n` } })&lt;/script&gt;\nAssemblyScript 是在 Apache 许可下发布的免费开源软件，版本 2.0，构建于 Binaryen 并基于 WebAssembly 规范。它是由以下很棒的人带给您的：“您现在无需学习新语言即可编写 WebAssembly，并利用 WebAssembly 可能为您提供的所有这些好处。我认为这有点强大。 AssemblyScript 绝对可用，而且非常有趣！” – Surma，Web 开发人员的 WebAssembly（Google I/O &#39;19）“AssemblyScript 的设计考虑了 WebAssembly 和代码大小。它不是我们用于新目的的现有语言，而是为 WebAssembly 设计的语言。它具有很好的 wasm-opt 集成，事实上它是用它构建的，并且很容易获得良好的代码大小。” – Alon Zakai，Shipping Tiny WebAssembly Builds（WebAssembly 峰会）“我选择了 AssemblyScript，因为它具有高级别的可读性和低级控制。它就像一种高级语言，但你会得到那种低级的感觉，如果你愿意，你甚至可以直接编写 WebAssembly 内在函数。” – Peter Salomonsen，WebAssembly Music（WebAssembly 峰会）大多数核心团队成员和大多数贡献者在空闲时间从事这项开源工作。如果您将 AssemblyScript 用于一项严肃的任务或计划这样做，并且您希望我们在它上面投入更多时间，请捐赠给我们的 OpenCollective。通过赞助该项目，您的徽标将显示在下方。非常感谢你的支持！如果您有只有人类才能回答的问题，想向其他人展示您的工作，或者只是想与其他 AssemblyScript 人员一起出去玩，请务必加入我们的 Discord 服务器！您可以在那里找到#announcements、#help 等频道。", "note_en": "On August 3rd, the WebAssembly CG will poll on whether JavaScript string semantics/encoding are out of scope of the Interface Types proposal. This decision will likely be backed by Google (C++), Mozilla (Rust) and the Bytecode Alliance (WASI), who appear to have a common interest to exclusively promote C++, Rust respectively non-Web semantics and concepts in WebAssembly.\n  If the poll passes, which is likely, AssemblyScript will be severely impacted as the tools it has developed must be deprecated due to unresolvable correctness and security problems the decision imposes upon languages utilizing JavaScript-like 16-bit string semantics and its users.\n  It is our expectation that AssemblyScript&#39;s only viable way forward to guarantee data integrity will be to replace its dependency upon Interface Types with a dependency upon Reference Types and import its standard library from JavaScript. While the full impact cannot be known, this transition may either turn out to be too large in scope, or, if it can be done, is likely to impact users running AssemblyScript on WASI hosts like Wasmtime and Wasmer, in that neither the JavaScript standard library nor a GC will be available on these platforms. As a result, it would likely not be feasible anymore to utilize future versions of AssemblyScript on these platforms, and we would strongly recommend to avoid earlier versions since these will not be safe.\n  We believe that the resulting Web platform, programming language and security breakage, as well as the particularly unfortunate outcome for the AssemblyScript project, should be prevented, but after many years of dedicated yet futile efforts we also have to conclude that we are powerless against giants.\n  Being a variant of TypeScript makes it easy to compile to WebAssembly without learning a new language.\n  Integrates with the existing Web ecosystem - no heavy toolchains to set up. Simply  npm install it!\n  #!runtime=stub/** Calculates the n-th Fibonacci number. */export function fib(n: i32): i32 { var a = 0, b = 1 if (n &gt; 0) { while (--n) { let t = a + b a = b b = t } return b } return a}#!html&lt;textarea id=&#34;output&#34; style=&#34;height: 100%; width: 100%&#34; readonly&gt;&lt;/textarea&gt;&lt;script&gt;loader.instantiate(module_wasm, { /* imports */ }) .then(({ exports }) =&gt; { const output = document.getElementById(&#39;output&#39;) for (let i = 0; i &lt;= 10; ++i) { output.value += `fib(${i}) = ${exports.fib(i)}\\n` } })&lt;/script&gt;\n  AssemblyScript is free and open source software released under the  Apache License, Version 2.0, builds upon  Binaryen and is based on the  WebAssembly specification. It is brought to you by the following awesome people:\n  “You are now able to write WebAssembly without learning a new language, and harness all these benefits WebAssembly might offer you. I think that is kind of powerful. AssemblyScript is absolutely usable, and very enjoyable!” –  Surma,  WebAssembly for Web Developers (Google I/O ’19)\n “AssemblyScript is designed with WebAssembly and code size in mind. It&#39;s not an existing language that we are using for a new purpose but it&#39;s a language designed for WebAssembly. It has great wasm-opt integration, in fact it&#39;s built with it, and it&#39;s very easy to get good code size.” –  Alon Zakai,  Shipping Tiny WebAssembly Builds (WebAssembly Summit)\n “I chose AssemblyScript because it has high-level readability and low-level control. It&#39;s like a high-level language but you get that low-level feeling and you can even directly write WebAssembly intrinsics if you want to.” –  Peter Salomonsen,  WebAssembly Music (WebAssembly Summit)\n  Most of the core team members and most contributors do this open source work in their free time. If you use AssemblyScript for a serious task or plan to do so, and you&#39;d like us to invest more time on it,  please donate to our  OpenCollective. By sponsoring this project, your logo will show up below. Thank you so much for your support!\n  If you have questions only a human can answer, would like to show others what you are working on or just want to hang out with other AssemblyScript folks, make sure to  join our Discord server! There you&#39;ll find channels for  #announcements,  #help, and more.", "posttime": "2021-07-25 16:38:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "assemblyscript,notice,webassembly", "title": "来自 AssemblyScript 的紧急通知", "title_en": "An Urgent Notice from AssemblyScript", "transed": 1, "url": "https://assemblyscript.org", "via": "", "real_tags": ["notice"]}, {"category": "", "categoryclass": "", "imagename": "07b3bd65449fb79c67b1e241e6075022.jpg", "infoid": 1069573, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "肖恩·奥米拉 (Shaun O&#39;Meara) 是 Mirantis 的全球首席技术官，20 年来一直与客户一起设计和构建企业 IT 基础设施。紧随其后的是——从某种意义上说，同样令人不安——宣布该大学已被禁止，至少是暂时禁止为内核开发做出贡献。随后研究人员公开道歉。尽管漏洞利用开发和披露通常很混乱，但针对世界上最大和最重要的开源项目运行技术上复杂的“红队”程序感觉有点额外。很难想象研究人员和机构会如此天真或被遗弃，以至于不了解这种行为潜在的巨大爆炸半径。同样可以肯定的是，维护人员和项目治理有义务执行政策并避免浪费时间。常识表明（和用户要求）他们努力生产不包含漏洞利用的内核版本。但是杀死信使似乎至少错过了一些要点——这是研究而不是纯粹的恶意，它揭示了一种要求技术和系统缓解的软件（和组织）漏洞。我认为“伪君子的承诺”在各个方面都是威胁整个扩展开源生态系统及其用户的相关趋势的征兆。长期以来，该生态系统一直在努力解决规模、复杂性以及免费和开源软件 (FOSS) 对各种人类事业日益重要的问题。让我们来看看这个复杂的问题：它们的复杂性和速度已经超出了传统“公共”方法甚至更先进的治理模型可以应对的规模。它们正在进化以相互商品化。例如，越来越难以明确地说明“Linux”还是“Kubernetes”应该被视为分布式应用程序的“操作系统”。营利性组织已经注意到这一点，并开始围绕“全栈”投资组合和叙述进行重组。\n在这样做的过程中，一些营利性组织开始扭曲传统的 FOSS 参与模式。许多实验正在进行中。与此同时，资金、对 FOSS 的员工人数承诺和其他指标似乎都在下降。 OSS 项目和生态系统正在以多种方式进行调整，有时使营利性组织很难有宾至如归的感觉或从参与中获益。攻击者更大、更聪明、更快、更有耐心，导致长期博弈、供应链颠覆等。越来越多地使用公共云创造了新的技术和组织单一文化​​层，可能会支持和证明攻击。部分或全部由开源软件组装而成的复杂商业现成 (COTS) 解决方案创建了复杂的攻击面，其组件（和交互）可被不良行为者访问和理解。与此同时，随着组织寻求摆脱非战略专业知识，将资本支出转为运营支出，并演变为依赖云供应商和其他实体来完成安全方面的艰苦工作，所有这一切都在发生。最终结果是 Linux 内核的规模和绝对关键的项目没有准备好应对改变游戏规则的超大规模威胁模型。在我们在这里研究的特定案例中，研究人员能够以相对较低的工作量（使用静态分析工具评估已经确定需要贡献者注意的代码单元）来定位候选入侵站点，通过电子邮件非正式地提出“修复”，以及利用许多因素，包括他们自己作为可靠和频繁贡献者的既定声誉，将漏洞利用代码置于提交的边缘。\n这是一个严重的背叛，实际上是由信任系统的“内部人员”实施的，该系统在历史上一直很好地产生强大且安全的内核版本。滥用信任本身改变了游戏规则，而隐含的后续要求——通过系统化的缓解措施来加强相互之间的信任——隐约可见。但是，您如何应对这样的威胁？在大多数情况下，形式验证实际上是不可能的。静态分析可能无法揭示巧妙设计的入侵。必须保持项目进度（毕竟有已知的错误需要修复）。而且威胁是不对称的：正如经典台词所说——蓝队需要防范一切，红队只需要成功一次。限制单一文化的传播。像 Alva Linux 和 AWS 的 ElasticSearch 的开放分发这样的东西很好，部分原因是它们使广泛使用的自由和开源软件解决方案保持免费和开源，还因为它们注入了技术多样性。重新评估项目治理、组织和资金，着眼于减少对人为因素的完全依赖，并激励营利性公司贡献其专业知识和其他资源。大多数营利性公司都乐于为开源做出贡献，因为它的开放性，而不是尽管如此，但在许多社区中，这可能需要对现有贡献者的文化进行改变。通过简化堆栈和验证组件来加速商品化。将适当的安全责任推入应用层。基本上，我在这里提倡的是，像 Kubernetes 这样的编排器应该不那么重要，而 Linux 应该影响较小。最后，我们应该尽快将 unikernel 之类的东西的使用形式化。无论如何，我们需要确保公司和个人都提供开源所需的资源。", "note_en": "Shaun O’Meara, global field CTO at  Mirantis, has worked with customers designing and building enterprise IT infrastructure for 20 years.\n  This was quickly followed by the — in some senses, equally disturbing — announcement that the university had been banned, at least temporarily, from contributing to kernel development. A  public apology from the researchers followed.\n Though exploit development and disclosure is often messy, running technically complex “red team” programs against the world’s biggest and most important open-source project feels a little extra. It’s hard to imagine researchers and institutions so naive or derelict as not to understand the potentially huge blast radius of such behavior.\n  Equally certain, maintainers and project governance are duty bound to enforce policy and avoid having their time wasted. Common sense suggests (and users demand) they strive to produce kernel releases that don’t contain exploits. But killing the messenger seems to miss at least some of the point — that this was research rather than pure malice, and that it casts light on a kind of software (and organizational) vulnerability that begs for technical and systemic mitigation.\n  I think the “hypocrite commits” contretemps is symptomatic, on every side, of related trends that threaten the entire extended open-source ecosystem and its users. That ecosystem has long wrestled with problems of scale, complexity and free and open-source software’s (FOSS) increasingly critical importance to every kind of human undertaking. Let’s look at that complex of problems:\n Their complexity and pace have grown beyond the scale where traditional “commons” approaches or even more evolved governance models can cope.\n They are evolving to commodify each other. For example, it’s becoming increasingly hard to state, categorically, whether “Linux” or “Kubernetes” should be treated as the “operating system” for distributed applications. For-profit organizations have taken note of this and have begun reorganizing around “full-stack” portfolios and narratives.\n In so doing, some for-profit organizations have begun distorting traditional patterns of FOSS participation. Many experiments are underway. Meanwhile, funding, headcount commitments to FOSS and other metrics seem in decline.\n OSS projects and ecosystems are adapting in diverse ways, sometimes making it difficult for for-profit organizations to feel at home or see benefit from participation.\n  Attackers are bigger, smarter, faster and more patient, leading to long games, supply-chain subversion and so on.\n   The increasing use of public clouds creates new layers of technical and organizational monocultures that may enable and justify attacks.\n Complex commercial off-the-shelf (COTS) solutions assembled partly or wholly from open-source software create elaborate attack surfaces whose components (and interactions) are accessible and well understood by bad actors.\n  Meanwhile, all this is happening as organizations seek to shed nonstrategic expertise, shift capital expenditures to operating expenses and evolve to depend on cloud vendors and other entities to do the hard work of security.\n The net result is that projects of the scale and utter criticality of the Linux kernel aren’t prepared to contend with game-changing, hyperscale threat models. In the specific case we’re examining here, the researchers were able to target candidate incursion sites with relatively low effort (using static analysis tools to assess units of code already identified as requiring contributor attention), propose “fixes” informally via email, and leverage many factors, including their own established reputation as reliable and frequent contributors, to bring exploit code to the verge of being committed.\n This was a serious betrayal, effectively by “insiders” of a trust system that’s historically worked very well to produce robust and secure kernel releases. The abuse of trust itself changes the game, and the implied follow-on requirement — to bolster mutual human trust with systematic mitigations — looms large.\n But how do you contend with threats like this? Formal verification is effectively impossible in most cases. Static analysis may not reveal cleverly engineered incursions. Project paces must be maintained (there are known bugs to fix, after all). And the threat is asymmetrical: As the classic line goes — blue team needs to protect against everything, red team only needs to succeed once.\n  Limit the spread of monocultures. Stuff like Alva Linux and AWS’ Open Distribution of ElasticSearch are good, partly because they keep widely used FOSS solutions free and open source, but also because they inject technical diversity.\n Reevaluate project governance, organization and funding with an eye toward mitigating complete reliance on the human factor, as well as incentivizing for-profit companies to contribute their expertise and other resources. Most for-profit companies would be happy to contribute to open source because of its openness, and not despite it, but within many communities, this may require a culture change for existing contributors.\n Accelerate commodification by simplifying the stack and verifying the components. Push appropriate responsibility for security up into the application layers.\n Basically, what I’m advocating here is that orchestrators like Kubernetes should matter less, and Linux should have less impact. Finally, we should proceed as fast as we can toward formalizing the use of things like unikernels.\n Regardless, we need to ensure that both companies and individuals provide the resources open source needs to continue.", "posttime": "2021-07-25 16:01:30", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "开源,运动,source,项目", "title": "开源运动需要发展吗？", "title_en": "Does the Open Source Movement Need to Evolve?", "transed": 1, "url": "https://techcrunch.com/2021/07/18/the-end-of-open-source/", "via": "", "real_tags": ["开源", "运动", "source", "项目"]}, {"category": "", "categoryclass": "", "imagename": "6b617d3d2107f41c06945733dd5f9bfb.jpeg", "infoid": 1069572, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "AuthenticID 最近宣布了一项由 Long Ridge Investment 牵头的 1 亿美元少数增长投资，该投资将用于支持 AuthenticID 在自动身份证明方面的持续创新以及公司的市场扩张努力。 AuthenticID 是一家为大型公司或企业提供身份证明解决方案的成熟提供商，完成了来自 Long Ridge Equity Partners 的 1 亿美元少数股权投资，Long Ridge Equity Partners 是一家专注于技术的成长型股权公司（2021 年 7 月 22 日）。根据一份新闻稿，这项投资将支持 AuthenticID 在电信、金融服务、政府和其他消费领域的持续扩张，“希望建立信任并减少欺诈，并使 AuthenticID 能够支持下一代数字身份平台”。 AuthenticID 为领先的公司提供身份证明服务，据报道其中包括一些美国最大的电信运营商和金融机构。该解决方案还“为全球许多领先的数字身份平台提供支持”。 “AuthenticID 通过唯一的 100% 自动化身份证明平台提供以文档为中心的身份验证，从而产生业界最高的准确率和最快的处理时间。” AuthenticID 的基于人工智能的产品用于“消除欺诈并提高美国大部分无线运营商市场的转化率”。\n该公告透露，身份证明市场“继续快速增长，最近转向数字客户入职和欺诈水平的增加推动了远程建立身份的需求”。这项最新投资将用于支持扩展身份验证用例的解决方案的开发。这笔资金还“使公司能够继续创新，并通过自动化解决方案解决世界不断发展的数字身份和验证挑战。” “大多数美国无线运营商和各种身份平台都依赖我们的平台来安全地建立身份。我们的与众不同之处在于我们为客户提供的显着投资回报率，从阻止更多欺诈到转换比我们的数字身份竞争对手更多的销售额。我们的使命是提高我们所有集体身份的安全性。” “AuthenticID 的自动化身份证明方法可以为其客户提供一流的结果，尤其是与手动和混合解决方案相比时。向数字化入职的转变正在加速，AuthenticID 的定位是帮助全球企业建立身份、减少欺诈和建立信任。我们很高兴与 AuthenticID 合作并支持他们在全球范围内保护身份的愿景。” “这项投资将推动研发、上市和市场意识活动，将公司提升到一个新的水平。” Union Square Advisors LLC 担任“独家财务顾问”，DLA Piper“担任 AuthenticID 的法律顾问”。 Choate, Hall, &amp; Stewart LLP 担任“Long Ridge Equity Partners 的法律顾问”。\n赞助商链接 DQ 推广", "note_en": "AuthenticID recently announced a $100 million minority growth investment that has been led by  Long Ridge Investment\n The investment will be directed towards supporting AuthenticID’s ongoing innovation in automated identity proofing as well as the firm’s market expansion efforts.\n AuthenticID, an established provider of Identity Proofing solutions for large companies or businesses, closed a $100 million minority investment from Long Ridge Equity Partners, a tech-focused growth equity firm (on July 22, 2021).\n The investment will support AuthenticID’s ongoing expansion within telecommunications, financial services, government, and other consumer segments “looking to establish trust and mitigate fraud, as well as enable AuthenticID to support the next generation of digital identity platforms,”  according to a release.\n AuthenticID offers identity proofing services to leading firms, which reportedly include some of the nation’s biggest telecom carriers and financial institutions. The solution also “powers many of the leading  digital identity platforms globally.”\n  “AuthenticID provides document-centric identity verification delivered via the only 100 percent automated identity proofing platform, producing the industry’s highest accuracy rates and fastest processing times.”\n AuthenticID’s AI-based offering is used “to eliminate fraud and increase conversion rates for a majority of the US wireless carrier market.”\n The Identity Proofing market “continues to grow at a rapid pace, with the recent shift to digital customer onboarding and increasing fraud levels driving the need to establish identity remotely,” the announcement revealed.\n This latest investment will be channeled towards supporting the development of solutions for extended  identity verification use cases. The funding also “allows the Company to continue innovating and address the world’s ever-evolving digital identity and verification challenges with automated solutions.”\n  “Our platform is relied upon by a majority of the US wireless carriers and various identity platforms to securely establish identity. Our differentiator is the significant ROI we deliver to customers, from stopping more fraud to converting more sales than our digital identity competitors. Our mission is to improve the security for all of our collective identities.”\n  “AuthenticID’s automated approach to Identity Proofing allows delivery of best-in-class results for their clients, especially when compared to manual and hybrid solutions. The shift towards digital onboarding is accelerating, and AuthenticID is positioned to help global enterprises establish identity, reduce fraud, and build trust. We are excited to partner with AuthenticID and support their vision for securing identities across the globe.”\n  “This investment will drive research and development, go-to-market, and market awareness activities that will take the Company to the next level.”\n Union Square Advisors LLC served “as exclusive financial advisor” and  DLA Piper “served as legal counsel to AuthenticID.”\n Choate, Hall, &amp; Stewart LLP served “as legal counsel to Long Ridge Equity Partners.”\nSponsored Links by DQ Promote", "posttime": "2021-07-25 16:00:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,身份证明,ridge,身份", "title": "AuthenticID 提供基于人工智能的身份证明和验证以帮助企业打击欺诈，从 Long Ridge Equity Partners 筹集了 1 亿美元", "title_en": "AuthenticID, which offers AI-based identity proofing and verification to help businesses fight fraud, raises $100M from Long Ridge Equity Partners", "transed": 1, "url": "https://www.crowdfundinsider.com/2021/07/178257-identity-proofing-firm-authenticid-announces-100m-minority-growth-investment-from-long-ridge-investment/", "via": "", "real_tags": ["人工智能", "身份证明", "ridge", "身份"]}, {"category": "", "categoryclass": "", "imagename": "fe18b8701d1bb5ba3c6354c9f999cabf.jpg", "infoid": 1069571, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "总部位于纽约的 Lev 正在通过在线自动化工作流程并将数亿个数据点收集到机器学习软件中以确保融资准确性来解决这个问题。为此，这家商业房地产融资交易平台在成立两年后就筹集了 3000 万美元，使其估值达到 1.3 亿美元。最新一轮融资是在该公司筹集了由 NFX 牵头的 1000 万美元种子资金四个月之后进行的。格林斯普林在最新一轮比赛中领先，First American Title 参加。根据 Crunchbase 的数据，现有投资者 NFX、Canaan Partners、JLL Spark、Animo Ventures 和 Ludlow Ventures 也加入了 Lev 的总投资额超过 3400 万美元。 Lev 创始人兼首席执行官 Yaakov Zar 之前共同创立了总部位于波士顿的 Dispatch，该公司为家庭服务业务构建工具。正是在他和他的妻子完成购房程序时——他们的抵押贷款失败了——Zar 决定考虑房地产融资。他将自己的挫败感转化为获得许可的抵押贷款发起人。搬到纽约后，Zar 正在帮助一家非营利组织的朋友为他们的建筑再融资，并亲眼目睹了他所说的分散的商业房地产抵押贷款行业。 Zar 告诉 TechCrunch，Blend 等公司正在解决房地产贷款问题，但很少有人关注商业房地产，因为商业房地产的贷款对利率和总摊销很敏感。此外，业主每 5 到 10 年就有一次再融资的负担。 “像 JLL 这样的传统企业，它是一个投资者，Cushman Wakefield 和 CBRE 致力于贷款，但它们比技术更注重&#39;关系&#39;，”扎尔说。 “我们认为这是一个必要的部分，因为交易如此庞大和复杂，你需要与他们建立关系，但低于 10 亿美元的交易非常简单。在经验和产品上，没有人能接近我们。”最初，Zar 和他的团队想建立“商业房地产贷款的火箭抵押贷款”，但发现这很困难，因为房地产经纪人正在为贷方整理自己的宣传册。相反，Lev 正在建立一个由 5,000 多家贷方组成的技术平台，其中包含有关他们喜欢为哪些项目融资的信息。然后分析客户的投资组合，并在几分钟内将他们与合适的贷方联系起来，每笔交易收取贷款金额的 1% 作为付款。 Lev 也在努力实现在线交易。\n当投资者接触 Zar 时，他并没有在寻求资金，但表示他被介绍给一些喜欢公司增长和发展轨迹的人，并决定接受融资要约。他打算将新的资金用于产品开发，目标是在几秒钟内提供一份条款清单，并在 7 天内完成贷款。现在可能需要一两个星期才能获得条款清单，而完成贷款则需要 45 到 90 天。该公司目前在其纽约总部、迈阿密研发中心、洛杉矶前哨和远程拥有约 40 名员工。将继续投资以扩大团队。去年，Lev 的交易量增长了 10 倍，到 2020 年完成了大约 1 亿美元的贷款。Zar 预计到 2021 年将关闭超过 10 亿美元。“客户多次回到我们这里，并且有大量推荐，”Zar 说。 “我们希望成为处理资本市场交易的平台。您需要有网络优势并找到超值优惠。我不想弄乱它，但是当你找到它时，把它带给我们，我们将关闭它，并为资产管理提供最佳选择，以在线关闭并从单个平台管理交易。”与此同时，NFX 的普通合伙人皮特弗林特告诉 TechCrunch，他在过去的 18 个月里认识了 Lev 团队，在全球大流行的各个阶段检查了公司，并且对公司如何驾驭它印象深刻。作为 Trulia 的联合创始人，他亲眼目睹了房地产行业在搜索和发现方面的问题，但随着问题的解决，重点转移到了融资上。 NFX 也是 Tomo 和 Ribbon 的投资者，这两家公司都专注于住宅融资。\n想看看商业地产方面有什么机会，弗林特听说列夫的名字在经纪人和业内人士中越来越多。 “随着我们了解 Lev 团队，我们认识到他们是解决这个问题的最佳团队，”弗林特说。 “我们也是对这一轮进行补充的一群了不起的人之一。深入的行业内幕人士将对战略和业务发展机会提出有用的看法。”", "note_en": "New York-based  Lev is taking on this problem by automating workflows online and gathering hundreds of millions of data points into machine learning software to ensure financing accuracy. To do this, the commercial real estate financing transaction platform raised $30 million to give it a $130 million valuation just two years into its inception.\n The latest financing comes four months after the company raised $10 million in seed funding led by NFX. Greenspring led the latest round, with participation from First American Title. Existing investors NFX, Canaan Partners, JLL Spark, Animo Ventures and Ludlow Ventures also joined in to give Lev total investments of more than $34 million, according to  Crunchbase data.\n  Lev founder and CEO Yaakov Zar previously co-founded Boston-based Dispatch, which built tools for home services businesses. It was when he and his wife went through the homebuying process — and their mortgage fell through — that Zar decided to look at real estate financing.\n He channeled his frustration into becoming a licensed mortgage loan originator. After relocating to New York, Zar was helping a friend at a nonprofit organization refinance their building and got a firsthand look at what he said was a fragmented commercial real estate mortgage industry.\n Companies like Blend are addressing the problem of real estate lending, Zar told TechCrunch, but very few are focusing on commercial real estate, where lending is sensitive to interest rates and total amortization. In addition, property owners have a burden of refinancing every five to 10 years.\n “Legacy businesses like JLL, which is an investor, Cushman Wakefield and CBRE work on lending, but they are much more ‘relationship focused’ than tech focused,” Zar said. “We think that it is a necessary part because the deals are so large and complex that you need a relationship for them, but transactions less than $1 billion are pretty straightforward. On experience and product, no one is close to us.”\n  Initially, Zar and his team wanted to build the “Rocket Mortgage of commercial real estate lending,” but found that to be difficult because real estate brokers are putting together their own pitch books for lenders. Instead, Lev is building a technology platform of more than 5,000 lenders with information on what projects they like to finance. It then analyzes a customer’s portfolio and connects them in minutes with the right lender, taking 1% of the loan amount for each transaction as payment. Lev is also working to be able to close deals online.\n Zar wasn’t looking for funding when he was approached by investors, but said he was introduced to some people who liked the company’s growth and trajectory and decided to accept the funding offer.\n He intends to use the new funding on product development, with the aim of giving a term sheet in seconds and closing a loan in seven days. Right now it can take a week or two to get the term sheet and 45 to 90 days to close a loan.\n The company has about 40 employees currently in its New York headquarters, Miami R&amp;D center, Los Angeles outpost and remotely. Continued investments will be made to expand the team.\n Lev grew 10 times in volume in the past year, closing approximately $100 million of loans in 2020. Zar expects to close over $1 billion in 2021.\n “Customers come back to us repeatedly, and there are a ton of referrals,” Zar said. “We want to be the platform on which capital market transactions are processed. You need an advantage to network and find great deals. I don’t want to mess with that, but when you find it, bring it to us, we will close it and provide the asset management with the best option to close online and manage the deal from a single platform.”\n Meanwhile, Pete Flint, general partner at NFX, told TechCrunch that he got to know the Lev team over the last 18 months, checking in on the company during various stages of the global pandemic, and was impressed at how the company navigated it.\n As co-founder of Trulia, he saw firsthand the problems in the real estate industry over search and discovery, but as that problem was being solved, the focus shifted to financing. NFX is also an investor in Tomo and Ribbon, which both focus on residential financing.\n Wanting to see what opportunities were on the commercial real estate side, Flint heard Lev’s name come up more and more among brokers and industry insiders.\n “As we got to know the Lev team, we recognized that they were the best team out there to solve this problem,” Flint said. “We are also among an amazing group of people complementing the round. The folks that are deep industry insiders will put a helpful lens on strategy and business development opportunities.”", "posttime": "2021-07-25 16:00:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,希望,financing,贷款", "title": "Lev 希望实现商业房地产融资的自动化，在四个月前筹集了 1000 万美元的种子轮之后，以 1.3 亿美元的估值筹集了 3000 万美元的 A 轮融资", "title_en": "Lev, which wants to automate commercial real estate financing, raises $30M Series A at a $130M valuation, after raising a $10M seed round four months ago", "transed": 1, "url": "https://techcrunch.com/2021/07/20/commercial-real-estate-lending-startup-lev-brings-in-30m-on-a-130m-valuation/", "via": "", "real_tags": ["商业", "希望", "financing", "贷款"]}, {"category": "", "categoryclass": "", "imagename": "0eac795f1f800d124e523c20980471ec.jpg", "infoid": 1069569, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天我想谈谈糟糕的工程师，特别是他们的一个方面——解决方案偏袒。但首先，让我再次提醒您工程应该如何工作。你遇到了一个问题——这可能是任何问题——你可能需要一个新的数据库、一个新的前端框架、一个新的包管理器，或者更抽象的，你可能需要一种新的方式在用户方便的时候向他们显示数据。哎呀，它甚至可能不是软件，你需要从水龙头里出来水，你需要一个新的淋浴装置，你需要一座过河的桥，你需要为偏远地区供电。然后，你深入研究这个问题。您会查看子问题、该领域的独特限制、您的公司、您的员工和团队、您的未来计划、您过去的计划等等。这些都很重要。从那里，您尝试一些解决方案。你依次尝试你能想到的每一个解决方案，通过小的概念证明 (POC) 或实验，最终你会看到什么最有效。您可能会排除一些，因为它们不适用于您的独特约束。您可能会进一步测试其他人。这是一些解决方案知识可以派上用场的地方，但稍后会更多。从那里，你解决关系。如果一种解决方案看起来与另一种几乎相同，那么您就继续前进。寻找其他独特的约束，直到出现明显的赢家。从那里，您可以继续实施解决方案。如果您发现问题，那么您的 POC 不够好，您需要退后一步。它发生了。没关系。就是这样，这是作为一名优秀工程师解决问题的（简化）方法。糟糕的工程正在进入解决问题的阶段，偏向于您最喜欢的潜在解决方案。这绝对是荒谬的，但它一直在发生，尤其是在软件工程领域，尤其是在线领域。这已成为非常普遍的在线，这是超级超级痛心地看到。让我列出一些我认为是不良工程迹象的短语：“我想使用 X，因为我想今年去 XCon 并做一个演讲”“我使用了架构 X，所以我们将在这个项目”我想走得更远。我想说它糟糕的工程甚至喜欢一种技术或工具。如果您喜欢它，那么在解决问题时就会偏向于它，并且您将成为一个更糟糕的问题解决者（又名工程师）。当然，我发现 Swifts 的语法令人愉快、可读或可维护。但归根结底，当它是解决问题的最佳方式时，我会使用它。在 iOS 应用程序的上下文中，考虑到正确的限制，Swift 可能会输给其他可能的解决方案，从任何对象到 Objective-C、React Native、移动网站、在地图上更好的谷歌列表，再到简单的传单一个局部区域。 &#39;我们是工程师。我们解决问题。我们不会带着一盒解决方案四处走动，然后将它们扭曲成我们遇到的问题。我们查看手头问题的独特约束并从那里开始。 “但是 Sam，我擅长 X，这就是我喜欢它的原因，所以我可以更快地做事，而且业务也喜欢我”。没关系。擅长特定的工具或技术很好。但是，如果约束是正确的，这只是一个很好的解决方案。可能倾向于这些情况的一些（常见但不是恒定的）约束是： 你已经有一个 X 的代码库，所以你添加了更多的 X（例如 Ruby 到 Ruby 代码库）\n交货日期临近和/或成本必须保持较低 - 因此您在寻找解决方案时强调您/您的团队当前的技能组合。作为一名优秀的工程师，您会警告管理层不以正确的方式进行长期风险。参见：初创公司。该项目是短期的，例如用于技术演示、临时使用或类似用途。所以，总而言之，有几个关键点我想开车回家并说清楚。从问题开始。努力消除偏见，并使用良好的科学和工程原理进行公平评估 注意博客和在线内容销售解决方案作为解决您独特问题的方法。这可能是一个解决方案，但我可以保证它不是每个人的解决方案。深入研究并掌握一项技术固然很好，但最好的工程师或开发人员的头衔中并没有工具名称。高级 Java 开发人员听起来和高级 PVC 管道工一样荒谬。最好从问题开始，并为它找到最佳解决方案。一些专注于某种工具的博客和在线内容通常可以让您更熟练地使用它们，但请注意您现在知道的在智力上不诚实和糟糕的工程的断言。\n祝这一切好运！如果我们继续关注问题并提出最佳解决方案，未来将是惊人的。如果我们继续使用我们现在拥有的东西，我们将陷入困境。我们不希望那样。", "note_en": "Today I want to talk about bad engineers, and one aspect of them in particular - solution favouritism. But first, let me remind you again how engineering is  supposed to work.    You get a problem - this could be anything - you might need a new database, a new frontend framework, a new package manager, or even more abstract, you might need a new way to show data to a user when it’s convenient for them. Heck, it could even be not software, you need water to come out of a tap, you need a new shower unit, you need a bridge to cross a river, you need to provide electricity to a remote region.   Then, you  go deep on the problem. You look at the sub-problems, the  unique constraints to this field, your company, your people and team, your future plans, your past plans, and much much more. These all matter.  From there,  you try some solutions. You try each solution you can think of in turn, with small proof of concepts (POC) or experiments, and eventually you see what works best. You might rule some out because they’re not working well with your unique constraints. You might test others even further. This is where some knowledge of solutions can come in handy, but more on that later.  From there,  you settle ties. If one solution seems pretty much the same as the other, you keep going. Find other unique constraints until a clear winner emerges. From there, you can go on to implement the solutions. If you find issues, then your POC wasn’t good enough, and you need to go back a step. It happens. It’s fine.  And that’s it, thats a (simplified) way to do solve problems as a good engineer.\n  Bad engineering is going into a problem solving phase with a bias towards your favourite potential solution. This is absolutely absurd yet it happens all the time, especially in software engineering and especially online. This is becoming too common online, and it’s super super sad to see. Let me list some phrases which I think are signs of bad engineering:\n “I want to use X because I want to go to XCon this year and do a talk”\n   “I’ve used architecture X, so we’ll use it in this project”\n I want to go even further than this. I want to say  its bad engineering to even  like a technology or tool. If you like it, you’ll have bias towards it when it comes to problem solving, and you’ll be a worse problem solver (aka engineer) for it. Sure, I find Swifts syntax  pleasant, or  readable, or  maintainable. But at the end of the day, I’ll use it when it’s the best possible way to solve a problem. In the context of iOS apps, Swift can fairly lose to other possible solutions given the right constraints, from anything to Objective-C, to React Native, to a mobile website, to a better Google listing on Maps through to a simple flyer drop in a local area. ‘\n We are engineers. We solve problems. We don’t walk around with a box of solutions and contorting them into the problems we come across. We look at the unique constraints of the problem at hand and go from there.   ”But Sam, I’m good at X and that’s why I like it, so I can do things faster and the business likes me for it”. That’s fine. It’s fine to be good at a particular tool or technology. BUT, it’s only a good solution  if the constraints are correct. Some ( common but not  constant) constraints that might lean towards these situations are:\n You already have a codebase of X, so you add more X (eg Ruby to a Ruby codebase)\n Delivery date is near and/or cost must be kept low - so you emphasises your/your team current skill set in a search for a solution. As a good engineer, you warn management of the long term risks of not doing it the  right way. See:  startups.\n The project is short term, such as for a tech demo, temporary use or similar.\n So, in summary, there are a few key points I’d like to drive home and make clear.\n Start with the problem. Work hard on dropping your biases, and evaluate fairly using good scientific and engineering principles\n Watch out for blogs and online content selling solutions as a solution to  your unique problem. It  may be a solution, but I can guarantee it isn’t  everyones solution.\n It’s fine to dive deep and master a technology, but the best engineers or developers don’t have a tool name in their title. Senior Java Developer sounds as ridiculous as Senior PVC Pipe Plumber. The best start with the problem and find the best solution for it.\n Some blogs and online content focusing on a certain tool are usually there to make you more proficient in using them, but watch out for assertions you now know are intellectually dishonest and bad engineering.\n Good luck with all this! The future will be amazing if we keep looking at problems and coming up with the best solutions. If we use what we have now going forward, we’ll stay pretty stuck. And we don’t want that.", "posttime": "2021-07-25 15:59:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "偏爱,tools,解决方案", "title": "偏爱工具是糟糕的工程 (2018)", "title_en": "Favouring tools is bad engineering (2018)", "transed": 1, "url": "https://www.samjarman.co.nz/blog/bad-engineering", "via": "", "real_tags": ["偏爱", "tools", "解决方案"]}, {"category": "", "categoryclass": "", "imagename": "6749c7cc928dac02d1da4b4c850972bd.png", "infoid": 1069568, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Sysinternals 网站由 Mark Russinovich 于 1996 年创建，用于托管他的高级系统实用程序和技术信息。无论您是 IT 专业人员还是开发人员，您都会找到 Sysinternals 实用程序来帮助您管理、排除故障和诊断您的 Windows 系统和应用程序。阅读 Mark 的博客，其中重点介绍了使用工具解决实际问题的方法 Sysinternals Live 是一项服务，可让您直接从 Web 执行 Sysinternals 工具，而无需寻找和手动下载它们。只需将工具的 Sysinternals Live 路径输入到 Windows 资源管理器或命令提示符中，如 live.sysinternals.com/&lt;toolname&gt; 或 \\\\live.sysinternals.com\\tools\\&lt;toolname&gt;。 RDCMan v2.8RDCMan 是一个用于管理多个远程桌面连接的实用程序，现在是 Sysinternals 工具系列的一部分！ Process Monitor v3.80Process Monitor 是与新的 Sysinternals 主题引擎集成的最新工具，为其提供暗模式支持。 Sysmon v13.20 Sysmon 这一高级系统安全监控器的更新添加了“不以”和“不以”过滤条件，并修复了规则包含/排除逻辑的回归。 TCPView v4.10 此次更新是 TCP/UDP 端点查询工具 TCPView，增加了按状态过滤连接的功能。\nProcess Explorer v16.40 此更新 Process Explorer，一个高级进程、DLL 和句柄查看实用程序，向主显示和报告进程 CET（影子堆栈）支持添加了进程过滤支持。 Process Monitor v3.70 Process Monitor 的此更新允许根据请求的分钟数和/或事件数据的大小限制事件数量，以便在必要时删除旧事件。它还修复了一个错误，即删除过滤事件选项并不总是受到尊重，并包含其他小错误修复和改进。 Sysmon v13.10 Sysmon 的此更新添加了 FileDeleteDetected 规则，该规则在文件被删除但不存档时记录，如果事件被排除，则删除剪贴板存档并修复 ImageLoad 事件错误。主题引擎本次更新的主题引擎在深色模式下使用自定义标题栏，类似于 MS Office 黑色主题。 WinObj 和 TCPView 已更新。期待在不久的将来更多使用主题引擎的工具！ TCPView v4.0 TCPView 的这次重大更新增加了灵活的过滤、对搜索的支持，现在可以显示拥有端点的 Windows 服务。它也是第二个具有暗模式的新主题引擎的 Sysinternals 工具。 WinObj v3.0 本次对WinObj 的重大更新添加了动态更新、快速搜索、完整搜索、更多对象类型的属性以及性能改进。它也是第一个具有深色主题的 Sysinternals 工具。 Sysmon v13.00 Sysmon 的此更新添加了一个进程映像篡改事件，该事件在进程的映射映像与磁盘映像文件不匹配或映像文件被锁定以进行独占访问时报告。这些指标由进程挖空和进程herpaderping触发。此版本还包括几个错误修复，包括对轻微内存泄漏的修复。\nProcess Monitor v3.61 Process Monitor 的此更新添加了对 RegSaveKey、RegLoadKey 和 RegRestoreKey API 的监控，并修复了某些类型的目录查询的详细信息输出中的错误。 AdExplorer v1.50 此版本的 AdExplorer（一种 Active Directory (AD) 查看器和编辑器）添加了对从“比较”对话框导出数据的支持，现在可用于 x64 和 ARM64。磁盘使用情况 (DU) v1.62 此版本的磁盘使用情况 (DU) 是查看磁盘使用情况信息的工具，现在还考虑了 MFT（主文件表），删除了 MAX_PATH 限制，现在可用于 ARM64。 VMMap v3.30VMMap 的此更新，这是一个报告进程虚拟内存布局的实用程序，可识别 .NET Core 3.0 托管堆。 RAMMap v1.60 此版本 RAMMap 是一种分析和显示物理内存使用情况的实用程序，添加了可自定义的地图颜色和新的命令行选项 -e，以清空不同类型的系统工作集。 Sysmon v12.0 除了几个错误修复之外，Sysmon 的这一重大更新增加了对捕获剪贴板操作的支持，以帮助事件响应者检索攻击者 RDP 文件和命令删除，包括原始远程机器 IP 地址。 Process Monitor v3.60 此更新 Process Monitor，一个记录进程文件、网络和注册表活动的实用程序，增加了对多个过滤器项目选择的支持，以及对新文件系统控制操作和错误状态代码的解码。\nProcdump v10.0 此版本的 Procdump 是一种灵活的手动和基于触发器的进程转储生成工具，增加了对转储取消和 CoreCLR 进程的支持。 ARM64 移植此外，一些工具已被新移植到 ARM64，现在可用于 ARM64。其中包括：AdInsight v1.2、AutoLogon v3.1、Autoruns v13.98、ClockRes v2.1、DebugView v4.9、DiskExt v1.2、FindLinks v1.1、Handle v4.22、Hex2Dec v1.1、Junction v1 .07、PendMoves v1.02、PipeList v1.02、Procdump v10.0、Process Explorer v16.32、RegDelNull v1.11、RU v1.2、Sigcheck v2.8、Streams v1.6、Sync v2.2、VMMap v3.26、WhoIs v1.21 和 ZoomIt v4.52。使用适用于 ARM64 的 Sysinternals 套件，在一次下载中下载所有 ARM64 工具。 Sysmon v11.10 Sysmon 的此更新现在将备用数据流的流内容捕获到记录的事件中，这对于调查带有“Web 标记”(MOTW) 流标记的下载非常有用，引入了“is-any”过滤条件，并修复了几个错误。 Sigcheck v2.80Sigcheck 是一种用于显示文件版本、文件签名和证书存储的灵活工具，引入了一个 -p 选项来指定用于签名验证的信任 GUID，现在即使链中的证书不受信任，它也会显示证书签名链. Sysinternals 6 月 24 日更新 VideoMark Russinovich 介绍了此更新中的新功能，演示了 Sysmon 的备用数据流内容捕获和 Sigcheck 中的新功能。", "note_en": "The Sysinternals web site was created in 1996 by  Mark Russinovich to host his advanced system utilities and technical information. Whether you’re an IT Pro or a developer, you’ll find Sysinternals utilities to help you manage, troubleshoot and diagnose your Windows systems and applications.\n Read  Mark’s Blog which highlight use of the tools to solve real problems\n   Sysinternals Live is a service that enables you to execute Sysinternals tools directly from the Web without hunting for and manually downloading them. Simply enter a tool&#39;s Sysinternals Live path into Windows Explorer or a command prompt as live.sysinternals.com/&lt;toolname&gt; or  \\\\live.sysinternals.com\\tools\\&lt;toolname&gt;.\n    RDCMan v2.8RDCMan, a utility for managing multiple remote desktop connections, is now part of the Sysinternals family of tools!\n  Process Monitor v3.80Process Monitor is the latest tool to integrate with the new Sysinternals theme engine, giving it dark mode support.\n Sysmon v13.20This update to Sysmon, an advanced system security monitor, adds &#34; not begin with&#34; and &#34; not end with&#34; filter conditions and fixes a regression for rule include/exclude logic.\n TCPView v4.10This update to TCPView, a TCP/UDP endpoint query tool, adds the ability to filter connections by state.\n Process Explorer v16.40This update to Process Explorer, an advanced process, DLL and handle viewing utility, adds process filtering support to the main display and reports process CET (shadow stack) support.\n  Process Monitor v3.70This update to Process Monitor allows constraining the number of events based on a requested number minutes and/or size of the events data, so that older events are dropped if necessary. It also fixes a bug where the Drop Filtered Events option wasn’t always respected and contains other minor bug fixes and improvements.\n Sysmon v13.10This update to Sysmon adds a FileDeleteDetected rule that logs when files are deleted but doesn&#39;t archive, deletes clipboard archive if event is excluded and fixes an ImageLoad event bug.\n Theme EngineThis update to the theme engine uses a custom title bar in dark mode, similar to MS Office black theme.  WinObj and  TCPView have been updated. Expect more tools using the theme engine in the near future!\n  TCPView v4.0This major update to TCPView adds flexible filtering, support for searching, and now shows the Windows service that owns an endpoint. It is also the second Sysinternals tool to feature the new theme engine with dark mode.\n  WinObj v3.0This major update to WinObj adds dynamic updates, quick search, full search, properties for more object types, as well as performance improvements. It&#39;s also the first Sysinternals tool to feature a dark theme.\n  Sysmon v13.00This update to Sysmon adds a process image tampering event that reports when the mapped image of a process doesn’t match the on-disk image file, or the image file is locked for exclusive access. These indicators are triggered by process hollowing and process herpaderping. This release also includes several bug fixes, including fixes for minor memory leaks.\n Process Monitor v3.61This update to Process Monitor adds monitoring for RegSaveKey, RegLoadKey and RegRestoreKey APIs, as well as fixes a bug in the details output for some types of directory queries.\n  AdExplorer v1.50This release of AdExplorer, an Active Directory (AD) viewer and editor, adds support for exporting data from the &#34;Compare&#34; dialog and is now available for x64 and ARM64.\n Disk Usage (DU) v1.62This release of Disk Usage (DU), a tool for viewing disk usage information, now also accounts for the MFT (Master File Table), removes the MAX_PATH limitation and is now available for ARM64.\n  VMMap v3.30This update to VMMap, a utility that reports the virtual memory layout of a process, identifies .NET Core 3.0 managed heaps.\n RAMMap v1.60This release to RAMMap, a utility that analyzes and displays physical memory usage, adds customizable map colors and a new command line option, -e, to empty the different types of system working sets.\n  Sysmon v12.0In addition to several bug fixes, this major update to Sysmon adds support for capturing clipboard operations to help incident responders retrieve attacker RDP file and command drops, including originating remote machine IP addresses.\n Process Monitor v3.60This update to Process Monitor, a utility that logs process file, network and registry activity, adds support for multiple filter item selection, as well as decoding for new file system control operations and error status codes.\n Procdump v10.0This release of Procdump, a flexible tool for manual and trigger-based process dump generation, adds support for dump cancellation and CoreCLR processes.\n ARM64 portsIn addition, several tools have been newly ported to and are now available for ARM64. These include: AdInsight v1.2, AutoLogon v3.1, Autoruns v13.98, ClockRes v2.1, DebugView v4.9, DiskExt v1.2, FindLinks v1.1, Handle v4.22, Hex2Dec v1.1, Junction v1.07, PendMoves v1.02, PipeList v1.02, Procdump v10.0, Process Explorer v16.32, RegDelNull v1.11, RU v1.2, Sigcheck v2.8, Streams v1.6, Sync v2.2, VMMap v3.26, WhoIs v1.21 and ZoomIt v4.52. Download all ARM64 tools in a single download with the  Sysinternals Suite for ARM64.\n  Sysmon v11.10This update to Sysmon now captures stream content for alternate data streams into logged events, which is useful for investigating downloads tagged with ‘Mark of the Web’ (MOTW) streams, introduces an ‘is-any’ filter condition, and fixes several bugs.\n Sigcheck v2.80Sigcheck, a flexible tool for showing file versions, file signatures, and certificate stores, introduces a -p option for specifying a trust GUID for signature verification, and it now shows certificate signing chains even when a certificate in the chain is untrusted.\n Sysinternals June 24 Update VideoMark Russinovich covers what’s new in this update, with demos of Sysmon’s alternate data stream content capture and new features in Sigcheck.", "posttime": "2021-07-25 15:59:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,程序,实用程序,sysinternals,v1", "title": "Windows Sysinternals：高级系统实用程序和技术信息", "title_en": "Windows Sysinternals: advanced system utilities and technical information", "transed": 1, "url": "https://docs.microsoft.com/en-us/sysinternals/", "via": "", "real_tags": ["windows", "程序", "实用程序", "v1"]}, {"category": "", "categoryclass": "", "imagename": "9992ee360a6647a7d7f38b7bebff2bd3.jpg", "infoid": 1069567, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "冲一个普通的马桶，你会听到湿漉漉的呜呜声，好像有人把一壶水倒在地上。冲洗韩国蔚山国立科学技术学院科学大楼的三个厕所中的一个，它听起来会大不相同——只是一小滴水，几乎被呼呼声淹没了。 “我们使用真空吸尘器，”厕所的策划者兼大学环境工程师 Jaeweon Cho 在描述他的发明的视频中解释道。就在按下冲水按钮之前，Cho 为观众准备了一个可能会吓到他们的声音。想象一下飞机厕所的吸力，在一个你意想不到的地方。 “请不要感到惊讶，”Cho 说。声音并不是 Cho 的厕所唯一不寻常的地方。被称为 BeeVi，是“蜜蜂”和“视觉”的混合体，它们使用的水比典型的宝座少得多——大约四分之一加仑的粪便和一半的尿液，相比之下，旧的传统厕所多达六加仑。这些废物不是将废物冲洗到管道中，通过下水道将其运送到处理厂，而是将粪便运送到建筑物的其他地方，到消化池，在那里微生物将其分解成可用的产品：沼气。其他地方也有类似的真空厕所和粪便转化为沼气系统，但与大多数污水处理设施最终通过账单将成本转嫁给消费者不同，Cho 的厕所向人们支付大便费用。每次冲水时，管道都会将粪便、尿液和废水输送到建筑物的地下室。从那里，粪便流向一个闪亮的银色消化器，厌氧细菌在那里等待。微生物吞噬粪便并产生甲烷气体。最多一立方米的气体储存在一楼的储罐中；从那里，甲烷通过管道在建筑物周围流动 - 想象一下埋在地下的下水道，但更纤细并固定在墙上 - 准备加热淋浴设施或在相邻的公共厨房点燃炉子。厨房空间俯瞰着厌氧消化正在进行的实验室，让学生和教职员工可以利用储存的气体并煮沸茶壶，同时观察使之成为可能的设备。每个大便者赚取 Cho 称为 Feces Standard Money 的几单位货币，并且可以亲自或在在线市场上使用这些资金购买从咖啡和卷心菜到救生衣和洗手液的所有物品。通过电子邮件，Cho 表示，虽然将粪便转化为能量“对公众来说似乎很奇怪”，但他认为这个概念不需要让人们感到恶心。在室温下，甲烷是无味的，Cho 的团队在产生气体的早期就过滤掉了气味更重的硫磺，因此它不会损坏设备。 Cho 表示，“在使用沼气时，我们很少闻到任何”气味。现在是修补改善厕所和废水系统的好时机。切尔西说，目前的许多厕所都非常浪费——不仅仅是浪费水，还因为它们丢弃了尿液和粪便，这些潜在的宝贵能量和营养资源通常被视为“你想要尽可能远离你的东西”沃尔德是科学记者，也是《白日梦：改造厕所的紧急全球探索》一书的作者。在世界各地的许多地方，市政污水系统也很陈旧、负担过重且表现不佳；在其他情况下，它们几乎不存在。许多废水系统被要求通过为比设计支持和拦截更多的水而设计的更多人口提供服务，从而超越其自身的重量。对于合流下水道尤其如此，在这种情况下，来自房屋的材料与从街道冲刷的雨水混合在一起。潮湿的天气刺激溢流的情况并不少见，在这种情况下，下水道将臭味内容物排放到水体中。许多下水道都设计成这样工作，部分原因是作为替代进入人们地下室的替代方案——但这意味着一些城市每年都会看到数百亿加仑的污水溢出到水道中。这些未经处理的洪流会带来垃圾和细菌，从而污染当地的生态系统。\nBeeVi 沼气收集计划是一项小规模运营，是世界各地使用类似技术的几个闭环概念之一。尽管存在一些家用沼气装置，但像 BeeVi 项目中的厕所需要专业知识才能建造，而沼气池不一定非常适合家庭规模。 Wald 认为这个特定项目的优点实际上在于教育，它改变了人们对污水的看法，以及他们对什么资源的重视。这些厕所无法解决我们更大的废水系统中的大规模基础设施问题。 “作为社会和社区，我们需要准备好在大局上花钱”，而不是指望我们的厕所能付钱给我们，沃尔德说。例如，美国土木工程师协会的年度基础设施报告卡最近将该国的污水处理业务评为 D+。一些重新设计的厕所不会提高这个分数。但是，如果你在 Cho 的厕所附近，你不妨坐下来——然后买一本书或香蕉上路。", "note_en": "Flush an average toilet, and you’ll hear a wet woosh, as if someone is dumping a pot of water on the ground. Flush one of three toilets in a science building at South Korea’s Ulsan National Institute of Science and Technology, and it will sound a lot different—just a tiny trickle of water, nearly drowned out by whirring. “We use a vacuum,” explained Jaeweon Cho, the mastermind of the toilets and an environmental engineer at the university, in  a video describing his invention. Just before pressing the flush button, Cho prepared viewers for a sound that might startle them; imagine the suction of an airplane toilet, in a place you wouldn’t expect to hear it. “Please don’t be surprised,” Cho said.\n The sound isn’t the only unusual thing about Cho’s toilets. Called BeeVi, a portmanteau of “honeybee” and “vision,” they use much less water than a typical throne—around a quarter of a gallon for feces and half that for urine, compared to  as many as six gallons in old conventional toilets. Instead of rinsing waste into pipes that ferry it through a sewer and to a treatment plant, these transport poop elsewhere in the building, to digesters where microbes break it down into a usable product: biogas. Similar vacuum-based toilets and  feces-to-biogas systems exist elsewhere, but unlike most sewage utilities, which eventually pass costs to consumers through bills, Cho’s toilets pay people to poop.\n  With each flush, pipes whisk feces, urine, and wastewater to the building’s basement. From there, the poop travels to a shiny, silver digester, where anaerobic bacteria is waiting. The microbes devour the feces and generate methane gas. Up to one cubic meter of the gas is stored in a first-floor tank; from there, the methane wends around the building in pipes—picture buried sewers, but scrawnier and fastened to walls—ready to heat shower facilities or fire up the stove in an adjacent communal kitchen. The kitchen space overlooks the lab where anaerobic digestion is chugging along, allowing students and staff to tap into the stored gas and boil a kettle for tea while looking out at the equipment that made it possible.\n Each pooper earns a few units of a currency Cho has dubbed Feces Standard Money, and can use the funds, in person or at an online marketplace, to buy  everything from coffee and cabbage to lifejackets and hand sanitizer.\n  Reached by email, Cho says that while the transformation of feces to energy “seems strange to the public,” he believes that the notion needn’t gross people out. At room temperature, methane is odorless, and Cho’s team filters out smellier sulfur early in the process of generating the gas, so it doesn’t damage the equipment. “When using biogas, we rarely smell any” odors, according to Cho.\n And it’s a good time to tinker with ways to improve toilets and wastewater systems. Many current toilets are wildly wasteful—not just in terms of squandered water, but also because they discard urine and feces, potentially valuable energy and nutrient resources often treated as “something you want to get as far away from you as possible,” says Chelsea Wald, a science journalist and author of   Pipe Dreams: The Urgent Global Quest to Transform the Toilet.\n Municipal wastewater systems, too, are old, overtaxed, and underperforming in many places around the world; in others, they barely exist at all. Many wastewater systems are called upon to punch way above their weight by serving larger populations than they were designed to support and intercepting more water than they can handle. This is especially true for combined sewers, where material from homes mingles with stormwater washed in off the street. It’s not uncommon for wet weather to spur overflows, in which sewers disgorge their smelly contents into bodies of water. Plenty of sewers are designed to work this way, partly as an alternative to backing up into people’s basements—but that means that some cities are seeing tens of billions of gallons of sewage spill into waterways each year. These untreated torrents introduce trash and bacteria that foul up local ecosystems.\n  The BeeVi biogas-harvesting scheme is a small-scale operation, one of several closed-loop concepts around the world that use similar technology. Though  some at-home biogas set-ups exist, toilets like those in the BeeVi project require expertise to build, and digesters aren’t necessarily a great fit on a household scale. Wald thinks the merit of this particular project is really in education, shaking up people’s ideas about sewage and—with the poop-for-pay element—what resources they value.\n These toilets won’t tackle the massive infrastructure problems in our larger wastewater systems. “As societies and communities, we need to be prepared to spend real money” on the big picture, rather than expect our toilets to pay us, Wald says. The American Society of Civil Engineers’ annual infrastructure report card  recently gave the country’s wastewater operations a grade of D+, for example. A handful of reimagined toilets won’t boost that score. But, if you’re near Cho’s toilet, you might as well take a seat—and then buy a book or banana for the road.", "posttime": "2021-07-25 15:59:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "厕所,toilet", "title": "重新思考厕所，将人类排泄物转化为甲烷动力", "title_en": "Rethinking the Toilet, Converting Human Waste into Methane Power", "transed": 1, "url": "https://www.atlasobscura.com/articles/korea-toilet-biogas", "via": "", "real_tags": ["厕所", "toilet"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069566, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "爵士乐评论家弗朗西斯·戴维斯 (Francis Davis) 描述了两种精湛技艺，一种是演奏的音乐可以想象，另一种是演奏超乎想象。俄罗斯钢琴家格里戈里·索科洛夫是第二类演奏家。当他演奏时，听众常常感觉好像他们是第一次听到音乐。找一个安静的地方，将手机静音，然后在接下来的半小时内体验贝多芬和索科洛夫的精湛技艺。几年前，我第一次听到格里戈里·索科洛夫 (Grigory Sokolov) 演奏。我对钢琴及其演奏所学、所想或所感的一切都烟消云散。索科洛夫虽然是一个保守得很好的秘密，但对许多当今活着的最伟大的钢琴家来说。拥有快速手指、设计师装备和精美照片的年轻名人与如此巨大的艺术相得益彰。索科洛夫是一位钢琴家陀思妥耶夫斯基，他的音乐创作范围广阔，富有远见和启发性，榨干了每一滴意义。经过巴比肯的新闻官员和索科洛夫的代理人的努力，我设法确定了这位伟大的俄罗斯钢琴家九年来第一次接受英国记者的采访。它始于他在巴塞罗那的 Palau de laMusica Catalana 的独奏会。这一定是世界上色彩最丰富的音乐厅：一座现代主义杰作，彩色玻璃、雕像和明亮色调的建筑细节洋溢着热情。在这里观看索科洛夫的独奏会就像看一部黑白电影叠加在技术色彩上：一个白发苍苍的男人在乌木和象牙色的钢琴前，以很少有钢琴家演奏过的方式演奏，当然自从“金色20 世纪初的时代”。他的音乐个性就像任何经典电影一样让人回想起另一个时代。然而，他演奏的色彩是如此生动，以至于立刻将帕劳的视觉丰富性置于阴影之中。演唱会结束后我们在后台交谈，由一位俄罗斯大提琴手担任翻译。西班牙是西班牙，独奏会在晚上 9 点开始。索科洛夫是索科洛夫，夜幕降临时，安可表演很慷慨。当我们在更衣室坐下时，已经接近午夜了。索科洛夫仍处于业绩后的高位。 “现在还在演唱会结束后，”他说，“但再过三四个小时，就要为下一场演唱会做准备了。”与斯维亚托斯拉夫·里希特 (Sviatoslav Richter) 一样，格里戈里·索科洛夫 (Grigory Sokolov) 是一位音乐家，围绕着他形成了巨大的神秘感。他完全不符合现代巨星的期望。他仿佛走出了一个不同的宇宙，一个遥远而纯净的世界。如果他还没有像他应有的那样广受赞誉，那是因为他不喜欢宣传、采访或任何与制作音乐无关的事情。他的头脑异常敏锐，见多识广。他不使用任何噱头，也没有俘虏。我告诉他，他不会对音乐行业的额外音乐需求做出让步。 “这不是一个问题，而是一种恭维，”他惊呼道。 “是的，我不喜欢与音乐无关的任何事情。确实，我讨厌它。任何扰乱音乐的东西都是反对它的，与它没有立足之地。自然，如果你喜欢音乐，你就不会喜欢那些其他的东西。如果你不喜欢音乐，你就在其他领域工作。如果你喜欢音乐，你就会接受这对你的一生来说已经足够了。”\n他出生在圣彼得堡，理论上仍然住在那里。“实际上，我住在飞机和汽车里。”他不记得他对音乐的热情是什么时候开始的：“我只能解释我从父母那里知道的。他们说，如果我在街上听到音乐，我会立即停下来想听听。在家里我们有一些唱片，我有一个小领奖台和指挥棒，我指挥了那里的一切！然后他们问一位钢琴老师如何处置我；她让他们等到我五岁。当我开始学习钢琴时，我忘记了当指挥的梦想，只想弹奏。一切都与往常相反。许多钢琴家开始演奏，然后开始指挥。我四岁的时候就已经学会了指挥。” 1966 年，年仅 16 岁的他赢得了由评审团主席埃米尔·吉列斯 (Emil Gilels) 支持的柴可夫斯基国际钢琴比赛。尽管这个奖项享有盛誉，但他在西方仍然相对不为人知。他没有背叛，在苏联政权下，他的旅行受到限制。改革之后，情况开始发生变化。现在他每年举办大约 80 场音乐会，歌迷们抢购他罕见的 CD，很少在音乐会现场录制。他现在不喜欢在录音室录音。 2002 年，法国导演布鲁诺·蒙赛因 (BrunoMonsaingeon) 在巴黎拍摄了一场神奇的独奏会。有人认为，他是继塔蒂亚娜·尼古拉耶娃、里希特和吉列斯等巨人之后，从传奇的“俄罗斯学派”中脱颖而出的最后一位伟大的艺术家。索科洛夫本人打折标签。 “如果所有来自俄罗斯这样一个大国的钢琴家都聚集在一起，展示一个写着俄罗斯学校的标志，那将是非常奇怪的，”他说。 “音乐家是个体，每个人都非常不同。如果我们根据世界某些地区的教学内容来谈论一所学校，我认为这没有多大意义。如果我们去博物馆，我们会看到伦勃朗或鲁本斯的画作，还有其他属于“伦勃朗学派”或“鲁本斯学派”的画。也就是说，原则上属于一个学派的人没有个性让我们记住每个人都是独立的艺术家。个性在艺术中很重要。”事实上，索科洛夫的解释跨越了一个与其他人相距数光年的精神星系。这不仅是他广泛的表现能力，从法国巴洛克作品的金银丝装饰到普罗科菲耶夫的第七和第八奏鸣曲等作品的巨大力量和凶猛，无论音量大小，他的音调总是圆润圆润。这仅仅是个开始。不可避免地，索科洛夫被贴上了“古怪”的标签。他拒绝妥协他的标准，因此，在其他人看来，他的要求可能看起来很极端。例如，他喜欢在音乐会开始前在大厅里用一整天的时间在钢琴上工作，并详细地指导调音师他需要从乐器中获得什么：“你需要几个小时来了解钢琴，因为每个人都有自己的个性，而我们一起玩，”他解释说。他严格的性格促使他决定减少与管弦乐队合作演奏的协奏曲数量。这听起来像是一个巨大的损失，但索科洛夫说：“这很简单。因为钢琴谱写了音乐的海洋，在你有生之年，你甚至无法弹奏其中的一小部分。在演奏协奏曲时，要找到足够的时间排练，或者找到一个对最终产品感兴趣而不看手表的管弦乐队并不容易。指挥也很麻烦，因为你必须找到一个非常优秀的音乐家的组合，他有这种特殊的才能以和你一样的方式来跟随和理解音乐。我必须说，这很少见！然后可能是最糟糕的：如果你在几天内演奏了几首单曲，你会发展到另一个层次。对于协奏曲，您会越来越多地演奏这首曲子，但是对于每个管弦乐队和指挥，您必须在第一次排练时从零开始。所以，如果你花费了如此多的精力，可以更有效地用于独奏会，你为什么要这样做？我非常喜欢这样一个事实，即我所做的一切都只取决于我自己。一百个人几乎是不可能的。你没有责任。”对索科洛夫来说，每场演出的音乐都是新鲜的。事实上，他觉得用同样的方式演奏一首曲子是不可能的：“第一次，因为每天我们都不同，”他说。 “接下来，你有另一架钢琴，你和钢琴一起弹奏；你有另一个音乐厅和另一个原声音乐厅。即使在同一个大厅里，同一架钢琴上也不能“相同”。他在巴塞罗那的节目包括巴赫和贝多芬的音乐，下半场由舒曼 F 小调奏鸣曲组成——这是一部不寻常的、有问题的作品，但在索科洛夫的手中充满了暴露的深度、幽灵般的声音和难以想象的温柔。不过，他并没有用语言表达对它的抒情。 “这是一件美丽的作品，”他简短地评论道。 “舒曼是一个非常好的品牌！”\n他的巴赫充满了错综复杂的细节和令人惊叹的诗歌时刻，其清晰的表达会让许多大键琴演奏者羡慕不已。我问他如何看待现在正在消退的时代，在这个时代，纯粹主义者习惯性地将钢琴定为错误的巴赫乐器。 “我无法相信一个年轻的音乐家可以在不演奏巴赫的情况下成长，”他开始说道。 “如果你不能弹巴赫，那你为什么要弹肖邦？这是不允许的，因为它是肖邦时代的另一种乐器吗？这完全是错误的想法，因为有一种博物馆的解释是可能的。首先，你现在找不到同等质量的旧乐器。如果您制作了复制品，则意味着您制作了新乐器。其次，从乐器的角度来看，巴赫是普遍的；他为键盘和管弦乐队创作的每首协奏曲最初都是为小提琴而写的；有些我们知道，有些丢失了。从小提琴到键盘乐器的距离比从琴巴罗到钢琴的距离更远。那个时候同样的曲子是用大键琴演奏的，因为它非常接近小提琴，所以很受欢迎；击弦古钢琴的系统是，当你触摸琴弦时，你会产生振动。问题是声音非常有限，不可能在更大的房间里播放。然后是室内风琴。三种完全不同的键盘乐器。接下来，无论你用哪种乐器演奏巴赫，公众都会遇到另一个问题：你永远不可能成为那个时代的公众。这意味着博物馆的诠释是不可能的。当然，如果你想让声音和 cembalo 完全一样，那就玩 cembalo。如果你弹钢琴，你不明白声音和其他东西有另一种性质，那也不是办法。但如果你进入这位作曲家的世界，那么你几乎可以在任何东西上演奏它。”尽管过去索科洛夫偶尔会演奏由一位作曲家组成的节目，但他目前没有计划加入演奏完整周期的钢琴家名单，例如所有三十二首贝多芬奏鸣曲。 “钢琴家应该只演奏他或她内心的感受。感觉一定很自然。我演奏了很多贝多芬奏鸣曲，如果我最后都演奏了它们，那么也许一起演奏也可以。但是贝多芬的每一首钢琴奏鸣曲都代表着一个不同的世界。”他的独奏会通常以起立鼓掌和安可狂欢结束。在巴塞罗那，我们听到了一些惊人的拉莫，三首肖邦即兴曲，一首马祖卡或两首，以及一首动人、安静的华尔兹。为什么这么多？索科洛夫笑道：“我喜欢弹钢琴，”他说，“所以如果人们想要……”人们当然会这样做。索科洛夫的魔力终于影响了全球的音乐爱好者，改变了我们对钢琴独奏会可以和应该做的一切的期望。我最后的印象是最后一位俄罗斯巨人像他走近钢琴一样走近他的茶：坚持按茶包，挤出最后一滴味道。", "note_en": "Jazz critic Francis Davis has described two kinds of virtuosity, one in whichthe music is played as well as can be imagined, the other in which the playingis beyond anything one could have imagined. Russian pianist Grigory Sokolov is avirtuoso of the second kind. When he performs, listeners often feel as ifthey’re hearing the music for the first time.\n Find a quiet place, silence your phone, and spend the next half hourexperiencing the virtuosity of Beethoven and Sokolov.\n    A FEW YEARS AGO, I heard Grigory Sokolov play for the first time. Everything Ihad ever learned, thought or felt about the piano and performance upon it wentup in smoke. Sokolov, although a well-kept secret, is for many the greatestpianist alive today. Youthful celebrities with fast fingers, designer gear, andslick photos pall beside such gigantic artistry. Sokolov is a pianisticDostoyevsky, his music-making vast in scope, visionary and revelatory, squeezingout every last drop of meaning.\n After much effort on the part of the barbican press officer and Sokolov’s agent,I manage to pin down the great Russian pianist for his first interview with aBritish journalist in nine years. It begins with his recital in the Palau de laMusica Catalana in Barcelona. This must be the world’s most colourful concerthall: A modernist masterpiece ebullient with stained glass, statuary andbright-hued architectural detail. Watching Sokolov give a recital here is likeseeing a black-and-white movie superimposed on technicolor: A grey-haired man inblack and white at an ebony and ivory piano, playing in a way that few pianistshave ever played, certainly not since the “golden age” of the early 20thcentury. The individuality of his musicianship harks back to another era as muchas any classic movie.\n Yet the colour in his playing is so vivid that it puts the palau’s visualrichness in the shadow at once. We talk backstage after the oncert, aided by aRussian cellist as interpreter. Spain being Spain, the recital had begun at 9pm.Sokolov being Sokolov, the encores were generous while the night draws on. Bythe time we sit down in the dressing room it is nearly midnight. Sokolov isstill in the midst of a post-performance high. “Now it is still after theconcert,” he remarks, “but in three or four hours it will be time to prepare forthe next concert.”\n  Like Sviatoslav Richter, Grigory Sokolov is a musician around whom tremendousmystique has formed. He meets none of the modern expectations of a mega-star; heseems to have stepped out of a different universe, a distant and purer world. Ifhe’s not yet as universally celebrated as he should be, that’s because hedoesn’t like publicity, interviews or, indeed, anything extraneous to makingmusic. His mind is phenomenally sharp and informed. He employs no gimmicks andtakes no prisoners.\n I put it to him that he makes no concessions to the extra-musical demands of themusic business. “That’s not a question, it’s a compliment,” he exclaims. “Yes, Idon”t like anything that is not a matter of music. Indeed, I hate it. Anythingthat disturbs the music is against it and has no place together with it.Naturally, if you like music you don’t like those other things. If you don’tlike music, you work in other areas. If you like music, you accept that it’senough for your whole life.”\n He was born in Saint Petersburg and still lives there – theoretically.“Practically, I live in the plane and the car.” He can’t remember when hispassion for music began: “I can only explain what I know from my parents. Theysaid that if I heard music in the street, I stopped immediately and wanted tolisten to it. At home we had some records, and I had a little podium and baton,and I conducted everything that was there! Then they asked a piano teacher whatto do with me; she told them to wait until I was five years old. When I began tostudy piano, I forgot my dream to be a conductor and wanted only to play.Everything was the opposite way round from the usual. Many pianists begin byplaying and later they start conducting. I had already had it with conducting bythe age of four.”\n In 1966, when he was only sixteen, he won the International Tchaikovsky PianoCompetition, championed by the chairman of its jury, Emil Gilels. Despite theprestige of this prize, he remained relatively unknown in the West. He did notdefect, and under the Soviet regime his travelling was limited. AfterPerestroika, that began to change. Now he gives around eighty concerts a yearand fans snap up his rare CDs, infrequent releases recorded live in concert. Hedoesn’t like to make studio recordings these days. The French director  BrunoMonsaingeoncaptured on film a magical 2002 recital in Paris.\n It’s been suggested that he is the last great artist to emerge from thelegendary “Russian school” of pianism, after such giants as Tatiana Nikolaeva,Richter, and Gilels. Sokolov himself discounts the tag. “It would be verystrange if all the pianists from such a huge country as Russia could be puttogether and display a sign saying Russian school,” he says. “Musicians areindividuals, and each one is very different. If we talk about a school in termsof what is taught in certain parts of the world, I think it does not make muchsense. If we go to a museum, we see paintings by Rembrandt or Rubens, but alsoother paintings attributed to a “school of Rembrandt” or a “school of Rubens”.That means, in principle, that people belonging to a school did not have thepersonality for us to remember each one as an individual artist. Personality iswhat’s important in art.”\n  Indeed, Sokolov’s interpretations span a spiritual galaxy light years away fromanyone else’s. It’s not only the vast range of his expressive capabilities, fromthe filigree ornamentations of works from the french baroque to the gargantuanpower and ferocity of such works as prokofiev’s seventh and eighth sonatas, withthe tone always speaking and rounded, no matter the volume. This is just thebeginning.\n Inevitably, Sokolov has been labelled “eccentric”. He refuses to compromise hisstandards and so, to others, his demands may seem extreme. For instance, helikes to spend an entire day working with the piano in the hall before aconcert, and instructs the tuner in precise detail about whai he needs from theinstrument: “You need hours to understand the piano because each one has its ownpersonality, and we play together,” he explains.\n His exacting nature has spurred a decision to reduce the number of concertos heperforms with orchestras. This sounds like a huge loss, but Sokolov says: “It’svery simple. For piano is written an ocean of music, and during your lifetimeyou are not able to play even a small part of it. When playing concertos, it’snot easy to find enough time to rehearse, or to find an orchestra which isinterested in the final product and not looking at their watch. It’s also noteasy with conductors, because you must find the combination of a very goodmusician who has this special talent to follow and to understand the music inthe same way as you. It’s very seldom, I must say! And then maybe the worst: Ifyou play a solo piece several limes over several days you will develop, going toanother level with it. With a concerto you play this piece more and more,but with each orchestra and conductor you must start again from zero at ihefirst rehearsal. So, if you spend so much energy that you could use much moreeffectively for recitals, why do you do it? I very much like the fact thateverything I make depends only on me. With a hundred people it”s almostimpossible. You have not the responsibility.”\n To Sokolov, music remains fresh at every performance. Indeed, he feels it isimpossible to play a piece the same way twice: “first, because every day we aresomething different,” he says. “next, you have another piano, and you playtogether with the piano; you have another concert hall and another acoustic.Even in the same hall on the same piano it can”t be the same.” His programme inBarcelona included music by Bach and Beethoven, with the second half consistingof the Schumann F sharp minor sonata - an unusual, problematic work, but inSokolov’s hands full of exposed depths, ghostly voices and unimaginabletenderness. He does not wax lyrical about it in words, though. “It’s a beautifulpiece,” he comments briefly. “Schumann is a very good brand!”\n His Bach is replete with intricate details and moments of startling poetry,delivered with a clarity that would turn many harpsichordists green with envy. Iask what he thinks about the era, now receding, in which purists habituallydecreed the piano the wrong instrument for Bach. “I can’t believe that a youngmusician can grow up without playing Bach,” he begins. “If you’re not allowed toplay Bach, then why can you play Chopin? Is that not allowed because it wasanother instrument in Chopin’s time? This is completely the wrong idea, as isthe idea that it’s possible to have one museum interpretation. First of all, youcan’t find an old instrument with a very good equivalent quality now. If youmake a replica, it means that you have made a new instrument. Next, Bach wasuniversal from the point of view of the instrument; each of his concertos forkeyboard and orchestra were originally written for violin; some we know, someare lost. There is a wider distance from violin to keyboard instrument than fromcembalo to piano. Back then the same piece was played on the clavichord, whichwas very popular because it was very close to violin; the system of theclavichord was that when you touched the string you made a vibration. Theproblem was that the sound was very limited and it was impossible to play in abigger room. Then there was the chamber organ. Three keyboard instruments whichare completely different. Next, on whichever instrument you play Bach, thepublic and you have another problem: you can never be the public of that time.That means that a museum interpretation is impossible. Of course, if you wantthe sound to be exactly like the cembalo, then play cembalo. If you play thepiano and you don”t understand that the sound and other things have anothernature, it’s also not the way. But if you enter the world of this composer, thenyou can play it on almost anything.”\n  Although in the past Sokolov has occasionally played programmes consisting ofjust one composer, he currently has no plans to join the roster of pianistsperforming complete cycles, such as all thirty-two Beethoven sonatas. “A pianistshould only play what he or she feels inside. It must feel natural. I haveplayed many of the Beethoven sonatas, and if I play in the end all of them, thenmaybe to play them together is ok. But every one of the piano sonatas ofBeethoven represents a different world.”\n His recitals usually end in standing ovations and a jamboree of encores. InBarcelona, we heard some astonishing Rameau, three Chopin impromptus, a mazurkaor two, and a touching, quiet waltz. Why so many? Sokolov laughs: “I like toplay piano,” he says, “so if people want …” and people certainly do. Sokolov’smagic is at last reaching music lovers across the globe, transforming ourexpectations of everything a piano recital can and should be. My finalimpression is of this last of the Russian titans approaching his tea in the sameway he approaches his piano: pressing the teabag insistently, squeezing outevery last drop of flavour.", "posttime": "2021-07-25 15:58:50", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "泰坦,titans,音乐", "title": "最后的泰坦", "title_en": "Last of the Titans", "transed": 1, "url": "https://corememorymusic.com/videos/last-of-the-titans.html", "via": "", "real_tags": ["泰坦", "titans", "音乐"]}, {"category": "", "categoryclass": "", "imagename": "a72cd1f1037600838ebf41615908792f.jpg", "infoid": 1069564, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在梵蒂冈的亵渎博物馆中，有一件文物在华丽的石棺和大理石雕像中显得格格不入：马赛克地板似乎被捡来的饭菜垃圾覆盖。当你第一次低头看马赛克时，它看起来像是翻倒的厨房垃圾：坚果壳、橄榄核、果皮和葡萄茎散落一地。但是如果你仔细观察，食物残渣会溶解成大块的石头和玻璃碎片。这是一幅马赛克错视画，非常精美。贝壳闪闪发光，栗子壳上长满了刺，葡萄在柔软、天鹅绒般的花朵中被毛茸茸的。像这样的马赛克形成了古罗马的 triclinia 餐厅的地板，派对客人可以在沙发上闲逛，挑选美食。这是在 Aventine 山上一栋别墅的遗迹中出土的，即使是现在，它也散发出一些漫长、昏暗、醉酒的罗马宴会的气氛。食物残渣在不同的方向投下长长的、飘忽不定的影子，仿佛被油灯舞动的灯光照亮，就连啃着角落里的坚果的小老鼠，眼中也带着一抹白光。这个主题出奇地普遍，以至于它有自己的名字：asarotos oikos，在希腊语中意为“未打扫的房间”。尽管希腊艺术家制作了第一批“未扫过的房间”马赛克，但我们只有后来的罗马复制品，它们是在希腊文化热潮中建造的。但是为什么一个精英罗马人会花费如此大的精力和费用来让他们的餐厅地板看起来像是被垃圾覆盖呢？一方面，这是一种狡猾的身份象征。想想亵渎博物馆（Profane Museum）（之所以这么命名，是因为它收藏了非基督教艺术品）所展示的垃圾：是的，它是垃圾，但属于最奢华的垃圾。有从海岸赶来的新鲜海鲜，包括龙虾、牡蛎，甚至还有一种只有罗马社会的精英才允许佩戴的著名的泰瑞亚紫（Tyrian Purple）的带刺骨螺壳（Murex Brandaris）。贝壳中散落着昂贵的进口商品，例如来自亚洲的桑葚、来自印度的生姜和来自中东的无花果。整个帝国的战利品散落在地板上。马赛克意味着一场盛宴如此奢华，如果真的有人供应，那可能是非法的——这违反了罗马的奢侈法律，该法律限制了主人在任何一场宴会上的花费。公元前 182 年通过的 Lex Orchia 限制了可以被邀请参加一顿饭的客人数量，后来的法律禁止食用肥禽、贝类和母猪的乳房（罗马人最喜欢的美食）。但根据我们从那时起的节期记录，这些规则经常遭到藐视。毕竟，有什么比违法招待客人更能打动客人的方式呢？然而，艺术史学家将这一主题与另一种罗马餐饮传统联系起来：memento mori，或“死亡提醒”。这些对死亡的小小提及都是罗马宴会中乐趣的一部分。例如，称为幼虫 convivalis 的小关节青铜骨架似乎已被用作派对娱乐。一个出现在 Satyricon 中，在桌子上跳着摇摇晃晃的木偶舞，而主持人则大声说：“唉，可怜的凡人……所以，在下面的世界将我们带走之后，我们都将如此。那就让我们好好生活吧。”\n从这个角度来看，马赛克展示了即使是最好的盛宴也会迅速从食物变成垃圾，就像食客会在时间里变成骨头和灰尘一样。换句话说，享受您的用餐，因为这可能是您的最后一次用餐。将近 2,000 年的时间将我们与在这幅马赛克上吃饭的食客分开。他们想象的死亡发生了；剩下的就是他们垃圾的这张图片。但是这个错视画马赛克仍然有一些技巧。古代历史教授詹姆斯·戴维森在他的书《妓女和鱼饼》中指出了一个有说服力的细节：一些食物残渣并没有完全符合自己的影子，就好像它们距离落地还有一瞬间的时间。食客可能早已死去，但盛宴仍在继续。 Gastro Obscura 涵盖了世界上最美妙的食物和饮料。注册我们的电子邮件，每周发送两次。", "note_en": "In the Vatican’s Profane Museum, there’s one artifact that looks out of place among the ornate sarcophagi and marble statues: a mosaic floor that seems to be covered  in the picked-over refuse of a meal.\n When you first look down at the mosaic, it looks like the kitchen trash tipped over: Nutshells, olive pits, fruit rinds, and grape stems are strewn about. But if you look closer, the food scraps dissolve into chunks of stone and chips of glass. It’s a  trompe l’oeil in mosaic, and an extraordinarily fine one. The shells gleam, the chestnut husks bristle with spines, and the grapes are fuzzed over with a soft, velvety bloom.\n Mosaics like this one formed the floors of  triclinia, dining rooms in ancient Rome where party guests lounged on couches, picking at delicacies. This one was unearthed among the remains of a  villa on Aventine Hill, and even now it emanates some of the atmosphere of one of those long, dim, boozy Roman banquets. The scraps of food cast long, erratic shadows in different directions, as if lit by the dancing flicker of oil lamps, and even the little mouse, nibbling on a nut in the corner, carries a white glimmer of reflected lamplight in its eye.\n This motif is a surprisingly common one, enough so that it has its own name:  asarotos oikos, or “unswept room” in Greek. Although Greek artists made the first “unswept room” mosaics, we have only later Roman copies, which were constructed during a craze for Greek culture. But why would an elite Roman go to such effort and expense to make their dining room floor look like it was covered in trash?\n For one, it was a kind of sly status symbol. Consider the refuse represented in the collection of the Profane Museum (so named because it houses non-Christian art): It’s trash, yes, but  trash of the most luxurious kind. There’s fresh seafood, rushed in from the coast, including lobster, oysters, and even the spiny shell of a  Murex Brandaris, which was the source of the famous Tyrian purple that only the elite of Roman society were permitted to wear. Strewn among the shells are expensive imports, such as mulberries from Asia, ginger from India, and figs from the Middle East. The spoils of a whole empire are scattered on the floor.\n  The mosaic implies a feast so lavish that, if it were actually served, it might have been illegal—a violation of Roman sumptuary laws, which capped how much a host could spend on any one banquet. The  Lex Orchia, passed in 182 BC, limited the number of guests that could be invited to a single meal, and later laws outlawed the consumption of fattened fowl, shellfish, and sow’s udders (a favorite Roman delicacy). But based on the accounts of feasts we have from this time, these rules were frequently flouted. After all, what better way to impress your guests than breaking the law to entertain them?\n Art historians, however, have connected the motif to another Roman dining tradition:  the  memento mori, or “reminder of death.” These little references to mortality were all part of the fun at a Roman banquet. Little jointed bronze skeletons called   larva convivalis, for instance, seem to have been used as party entertainment. One appears in the  Satyricon, doing a jiggly puppet-dance on the table  while the host declaims, “Alas for us poor mortals … So we shall all be, after the world below takes us away. Let us live then while it goes well with us.”\n Viewed from this perspective, the mosaic was a demonstration that even the finest feast is quickly transformed from sustenance into trash, just as the diner will be reduced in time to bones and dust. In other words, enjoy your meal, because it might be your last.\n Almost 2,000 years separate us from the diners who ate over this mosaic. The deaths they imagined came to pass; all that’s left is this image of their trash. But this trompe l’oeil mosaic still has a few tricks up its sleeve. In his book  Courtesans and Fishcakes, James Davidson, professor of ancient history, points out this telling detail: Some of the food remnants don’t quite meet their own shadows, as if they are still a split second from hitting the ground. The diners may be long dead, but the feast rages on.\n Gastro Obscura covers the world’s most wondrous food and drink.  Sign up for our email, delivered twice a week.", "posttime": "2021-07-25 15:58:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "罗马,romans", "title": "精英罗马人用垃圾装饰地板", "title_en": "Elite Romans decorated their floors with garbage", "transed": 1, "url": "https://www.atlasobscura.com/articles/what-is-in-profane-museum-vatican", "via": "", "real_tags": ["罗马", "romans"]}, {"category": "", "categoryclass": "", "imagename": "b2c7d4c013ee642dcaf2ec12678edfa1.jpg", "infoid": 1069563, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我最喜欢的“黑客”定义之一是创造性地重用工具以实现新的和意想不到的目的。 Hacking就是用你的email账号当硬盘，用你的自行车座开一瓶啤酒，用Minecraft的红砖在游戏中制作一个计算器。黑客的反面是营销。营销人员告诉您，这种特殊的不粘锅是您用来制作煎蛋的锅，您将在早上穿着时髦的衣服在漂亮的厨房里做。它包括照片和鼓舞人心的文案来推动这个家。营销决定了即使是最通用的产品的风格、背景和目的。这个叙述需要具体，这样你就可以很容易地想象出来：是你，在 Airbnb 里，和朋友一起笑。我最近一直在构建一个产品，基本上是通用的。在此之前，我参与了两个非常通用的项目（Observable 和 Mapbox）和一个相对特定领域的项目。制作通用工具的问题在于营销更难，您需要构建关于通用工具如何特别有用的叙述。例如，假设您正在构建另一个日历应用程序。这是一个不错的日历，您可以添加和删除事件。但是然后你在顶部输入“游艇时间表”，将其营销给拥有游艇的人，将缩放链接的文本字段更改为您在特定月份取出的游艇的选择框，并在游艇所有者中销售广告杂志。然后拥有游艇的人查看他们的日历应用程序，它不是为拥有游艇的人而设计的，以及这个针对游艇进行优化的新竞争对手，并支付你知道他们可以负担得起的溢价，因为毕竟他们拥有一艘游艇.夸张，当然，但这就是它如何动摇的方式。你可以让像 Mapbox 或 Observable 这样的通用公司工作，但房地产地图或金融笔记本比地图或笔记本更好。作为一个额外的好处，您可以选择域并尝试针对一个只会尖叫“金钱”的域进行优化，例如雪茄、金融或国防。因此，网站顶部的“解决方案”选项卡只是为了说“是的，您可以在这些地图上放置房地产”。\n这就是世界运作的方式，抱怨它没有好处。但无论如何，我认为这里存在文化鸿沟。黑客产品可以是 Redis 之类的东西，抽象的构建块，其描述类似于“内存数据结构存储”。这留下了很多可能性，但也有很多不确定性，除非你有创造力和知识。构建最通用的技术，然后添加最后一层界面、营销和叙述，使其看起来很具体，这是制造人们会购买的东西的挑战的一部分。", "note_en": "One of my favorite definitions of “hacking” is  the creative reuse of tools for new and unexpected purposes. Hacking is using your email account as a hard drive, using your bicycle seat to open a beer, using Minecraft’s red bricks to create a calculator in the game.\n The opposite of hacking is marketing. Marketing tells you that this particular non-stick pan is the pan you’ll use to make omelettes, and you’ll do it in the morning dressed in fashionable clothing in a nice kitchen. It includes photo and inspirational copywriting to drive this home. Marketing dictates a style, context, and purpose for even the most general-purpose products. This narrative needs to be specific so that you can readily imagine it:  it’s you, in an Airbnb, laughing with friends.\n I’ve been building a product recently, something fundamentally general-purpose. Before that I worked on two projects that were also pretty general (Observable and Mapbox) and one that was relatively domain-specific. The thing about making general tools is that marketing is harder and you need to build narratives about how the general thing is specifically useful.\n For example, let’s say you’re building another calendar app. It’s a decent calendar, you can add and remove events.\n  But then you type “Yachting schedule” at the top, market it to people who own yachts, change the text field for the Zoom link to a select box for which yacht you’re taking out that particular month, and sell ads in yacht owners magazines.\n Then people who own yachts look at their calendar app, which is not made for people with yachts, and this new competitor, which is optimized for yachting, and pay a premium that you know they can afford, because after all, they own a yacht.\n Exaggeration, sure, but this is sort of how it shakes out. You can make a general purpose company like Mapbox or Observable work, but  maps for real estate or  notebooks for finance are better pitches than  maps or  notebooks. And as an added plus, you can pick the domain and try to optimize for one that just screams “money,” like cigars or finance or defense. Hence the  Solutions tab at the top of the website, which exists only to say “yes, you can put real estate on these maps.”\n This is the way the world works, and whining about it does no good. But nevertheless I think there’s a cultural divide here. Products for hackers can be things like  Redis, abstract building blocks with descriptions like an “in-memory data structure store.” Which leaves a lot of possibility, but also a lot of uncertainty about  what it’s for, unless you have creativity and knowledge.\n Building maximally general technology, and then adding a final layer of interface, marketing, and narrative that makes it all seem  specific, is part of the challenge of making things people will buy.", "posttime": "2021-07-25 15:58:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "黑客,营销,hacking,游艇", "title": "黑客是营销的对立面", "title_en": "Hacking Is the Opposite of Marketing", "transed": 1, "url": "https://macwright.com/2021/07/24/hacking-is-the-opposite-of-marketing.html", "via": "", "real_tags": ["黑客", "营销", "hacking", "游艇"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069562, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "+------------------------------------------------- -----------------------------+| || （由 $/ dylanaraps 创建） || || || || |/ || |\\ISS LINUX || ||一个独立的 Linux(R) 发行版，专注于 ||简单和少即是多的概念。 || || || ____ || | | || .------------------------------------------------- -------.| | || | | | || | “……一切进步都靠不讲道理的人。” | | || | ._|____|_。 || &#39;------------------------------------------------- ------\\\\|o_o | || |:_/ | || // \\ \\ || (| | ) |+-------------------------------------------- ----------------------------------+概览________________________________________________________________________________* 静态包装系统 包装格式完全是静态的。一系列带有由行和空格分隔的字段的纯文本文件。可通过任何编程语言或使用基本的 UNIX 实用程序轻松解析。更多信息：@/ package-system $/kisslinux/repo* 便携包管理器 包管理器是用不到 1000 行的 POSIX shell 编写的，非常强调可移植性。唯一的要求是符合 POSIX 的环境、curl 和 git。更多信息：@/ package-manager $/kisslinux/kiss* 零总线因子 该发行版旨在由一个人维护。没有基础设施，整个发行版只是几个 Git 存储库。发行版的上游完全是可选的。更多信息：@/ faq#3.0 https://en.wikipedia.org/wiki/Bus_factor* 用户选择 没有锁定特定软件。用户可以混合搭配任何外壳、核心实用程序、初始化系统、设备管理器等。替代系统可以将其降低到文件级别。更多信息：@/ package-manager#3.2________________________________________________________________________________Dylan Araps (C) 2019-2021注册商标 Linux(R) 是根据 Linux 基金会的子许可使用的，Linux 基金会是该商标在全球范围内的所有者 Linus Torvalds 的独家被许可人。", "note_en": "+------------------------------------------------------------------------------+| || (Created by $/ dylanaraps) || || || || |/ || |\\ISS LINUX || || An independent Linux(R) distribution with a focus on || simplicity and the concept of less is more. || || || ____ || | | || .--------------------------------------------------------.| | || | | | || | &#34;...all progress depends on the unreasonable man.&#34; | | || | ._|____|_. || &#39;-------------------------------------------------------\\\\|o_o | || |:_/ | || // \\ \\ || (| | ) |+------------------------------------------------------------------------------+OVERVIEW________________________________________________________________________________* STATIC PACKAGING SYSTEM The package format is entirely static. A series of plain-text files with fields separated by lines and spaces. Easily parseable via any programming language or with basic UNIX utilities. More information: @/ package-system $/ kisslinux/repo* PORTABLE PACKAGE MANAGER The package manager is written in less than 1000 lines of POSIX shell with a large emphasis on portability. The only requirements are a POSIX compliant environment, curl and git. More information: @/ package-manager $/ kisslinux/kiss* BUS FACTOR OF ZERO The distribution is designed to be maintainable by a single person. There is no infrastructure and the entire distribution is merely a few Git repositories. The distribution&#39;s upstream is entirely optional. More information: @/ faq#3.0  https://en.wikipedia.org/wiki/Bus_factor* USER CHOICE There is no lock-in to specific software. The user has the ability to mix and match any shell, core utilities, init system, device manager and more. The alternatives system enables this down to file level. More information: @/ package-manager#3.2________________________________________________________________________________Dylan Araps (C) 2019-2021The registered trademark Linux(R) is used pursuant to a sublicense from theLinux Foundation, the exclusive licensee of Linus Torvalds, owner of the markon a world­wide basis.", "posttime": "2021-07-25 15:58:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,distro", "title": "一个专注于简单性和少即是多概念的 Linux 发行版", "title_en": "A Linux distro with a focus on simplicity and the concept of less is more", "transed": 1, "url": "https://kisslinux.org/", "via": "", "real_tags": ["linux", "distro"]}, {"category": "", "categoryclass": "", "imagename": "4fcd8450a8bcc1b73dac35e72351727c.png", "infoid": 1069561, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "上个月，作为循环无细胞基因组图谱 (CCGA) 的一部分，由 GRAIL 资助的一项研究报告了 GRAIL 的 Galleri 测试的验证结果。 Galleri 是一种多癌症早期检测测试，这是一项长期受追捧的血液测试，据报道可以从一次抽血中筛查 50 多种癌症类型。 Galleri 的工作原理是检测血液中的循环肿瘤 DNA (ctDNA)，这是肿瘤细胞快速更新的副产品。 Galleri 作为产品现已在美国上市，定价为 949 美元。对于像 Galleri 这样的筛查测试，两个指标几乎可以告诉我们有关测试性能的所有信息：特异性（真阴性率）和敏感性（真阳性率）。在验证研究中，作者对 4077 人进行了筛查，并报告了 Galleri 可以筛查的每种癌症类型的敏感性和特异性。让我们从好消息开始，所有癌症类型的特异性都很高，所有癌症的平均特异性为 99.5%。特异性是对真阴性率的衡量，即：假设您没有癌症，测试返回阴性结果的可能性有多大？该措施对于筛选方法很重要，因为低特异性会导致更多的假阳性。癌症筛查中的假阳性会导致不必要的后续扫描和活检，这对医疗保健系统来说是昂贵的，并且对患者有害。解读 Galleri 的敏感性则更为复杂。敏感性告诉我们测试发现癌症的能力。综合所有癌症类型和阶段，Galleri 的敏感性为 51.5%，这意味着大约一半的癌症被遗漏了。从表面上看，这听起来不太好，尽管考虑到多癌症检测武器库中缺乏武器，但这是一个可以接受的灵敏度水平。按癌症类型细分敏感性，很明显并非所有癌症在 Galleri 筛查时都是平等的：包括卵巢癌、胰腺癌和结肠癌在内的 11 种癌症类型具有超过 80% 的出色特异性。值得注意的是，Galleri 还实现了对肺癌的高敏感性 (74.8%)，尤其具有影响力，因为这是所有癌症中的主要死亡原因。另一方面，Galleri 在某些癌症方面表现不佳，尤其是前列腺癌和乳腺癌，这两种癌症的样本量都很大。\n按癌症类型细分并不能说明全部情况。 Galleri 的表现也因癌症分期而异。作为癌症检测的经验法则，越早越好。在早期发现癌症可以提高生存机会。从研究中截取的下表显示了按癌症分期（罗马数字一到四，I-IV）划分的敏感性：为了解释敏感性结果，最好重新审视基于 ctDNA 的筛查测试的工作原理。当肿瘤内的细胞死亡时，无论是通过自然更新还是通过其他方式（免疫系统靶向或治疗），癌细胞基因组的片段都会释放到血液中并循环。有许多因素会影响血液中 ctDNA 的数量，其中一个因素是起源肿瘤的大小（体积）。较大的肿瘤通常含有更多的细胞，因此细胞数量的周转率更高。回到结果表，Galleri 对早期癌症（I 期或 II 期）的敏感性较低，我们预计肿瘤体积较小，因此我们也预计这些患者血液中的 ctDNA 含量较低。换句话说，虽然令人失望，但这些结果在意料之中！对于晚期癌症（III 期或 IV 期），Galleri 的灵敏度约为 70-90%。 GRAIL 非常热衷于推动 Galleri 作为早期癌症检测。然而，分析表明对早期癌症（I 期）的敏感性很差，仅能检测到 16.8% 的癌症。显然，Galleri 在早期癌症检测方面并不擅长。另一方面，由于对晚期癌症的敏感性非常好，可以说 Galleri 将有助于（灵敏地）更早地发现晚期癌症。毫无疑问，基于 ctDNA 的癌症筛查将挽救生命，但第一个版本的 Galleri 并不是检测癌症最容易治疗的灵丹妙药。 Galleri 在筛查方面无疑是一个飞跃，对于所涵盖的许多癌症类型，没有其他筛查方法。然而，早期癌症的低敏感性给结果蒙上了阴影。需要进一步的试验和更长的随访期来了解广泛使用 Galleri 是否可以改善最重要的指标：死亡率。编辑：在这篇文章的原始版本中，我错误地在第 4 段中定义了特异性，并在第 7 段中错误地使用了特异性而不是敏感性。", "note_en": "Last month a study funded by GRAIL as part of the Circulating Cell-free Genome Atlas (CCGA)  reported validation results for GRAIL’s Galleri test.  Galleri is a multi-cancer early detection test, a long sought after blood test that can reportedly screen for over 50 cancer types from a single blood draw.\n Galleri works by detecting circulating tumour DNA (ctDNA) in the blood, a byproduct of the rapid turnover of tumour cells. Galleri as a product is now live and available in the USA for a list price of $949.\n For a screening test such as Galleri, two metrics tell us almost everything we need to know about the performance of the test: specificity (true negative rate) and sensitivity (true positive rate). In the validation study, the authors screened 4077 people and reported sensitivity and specificity for each of the cancer types that Galleri can screen for.\n Let’s start with the good news, specificity is high across all cancer types and the mean specificity across all of them is 99.5%. Specificity is a measure for the true negative rate, that is: given that you do not have cancer, how likely is the test to return a negative result? This measure is important for a screening method as a low specificity leads to a higher number of false positives. False positives in cancer screening can lead to unnecessary follow-up scans and biopsies which are costly for the healthcare system and harmful for the patient.\n Interpreting the sensitivity of Galleri is more complicated. Sensitivity tells us the test’s ability to find cancer. In aggregate across all cancer types and stages, Galleri has a sensitivity of 51.5%, meaning that roughly half of all cancers are missed. On the surface, that doesn’t sound great, although given the lack of weapons in the multi-cancer detection arsenal, this is an acceptable level of sensitivity.\n Breaking down the sensitivity by cancer type, it is clear that not all cancers are equal when screened for by Galleri:\n  Eleven cancer types including ovary, pancreas and colon cancer have an excellent specificity above 80%. Notably, Galleri also achieved a high sensitivity for lung cancer (74.8%), particularly impactful as this is the leading cause of death amongst all cancers. On the other end of the scale, Galleri performs poorly for some cancers, notably prostate and breast cancer, which both have large sample sizes.\n Segmenting by cancer type does not tell the full story. Galleri also performs differently depending on the cancer stage. As a rule of thumb in cancer detection, earlier is better. Detecting cancer at an earlier stage leads to a higher chance of survival. The table below, truncated from the study, shows the sensitivity segmented by cancer stage (Roman numerals one to four, I-IV):\n  To interpret the sensitivity results, it’s good to revisit how a ctDNA-based screening test works. When cells within a tumour die, either by natural turnover or through other means (immune system targeting or treatment), fragments of the cancer cell’s genome are released into the bloodstream and circulate. There are many factors that can affect the amount of ctDNA found in blood, one of these factors is the size (volume) of the originating tumour. Larger tumours will generally contain more cells and hence have a higher turnover in number of cells.\n Returning to the results table, Galleri achieves lower sensitivity for early stage cancer (stage I or II), where we expect the tumours to be smaller in volume and hence we also expect these patients to have a lower amount of ctDNA in their blood. In other words, although disappointing, these results are to be expected! For later stage cancer (stage III or IV), Galleri achieves a sensitivity of approximately 70-90%.\n GRAIL are very keen to push Galleri as early cancer detection. However, the analysis shows that sensitivity for early stage cancer (stage I) is poor, only detecting 16.8% of these cancers. Plainly, Galleri is not great at early stage cancer detection. On the other hand, since sensitivity for late stage cancer is excellent, it can be argued that Galleri will help to (sensitively) find late stage cancer earlier. Without a doubt, ctDNA-based cancer screening will save lives, but this first version of Galleri is not the magic bullet for detecting cancer when it is easiest to treat.\n Galleri is certainly a leap forward in screening, there are no other screening methods for many of the cancer types covered. However, the low sensitivity for early stage cancers casts a shadow on the results. Further trials and longer follow-up periods are required to understand whether widespread use of Galleri can result in an improvement in the most important metric of all: mortality.\n  Edit: In the original version of this post I wrongly defined specificity in paragraph 4 and mistakenly used specificity instead of sensitivity in paragraph 7.", "posttime": "2021-07-25 15:57:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "解读,interpreting,galleri", "title": "Galleri：解读 GRAIL 多癌早期检测研究的结果", "title_en": "Galleri: Interpreting results from GRAIL's multi-cancer early detection study", "transed": 1, "url": "https://arsham.substack.com/p/is-this-the-holy-grail-for-cancer", "via": "", "real_tags": ["解读", "galleri"]}, {"category": "", "categoryclass": "", "imagename": "f0d5f37f7f67d470516b9d7c6a892e5a.jpg", "infoid": 1069560, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着威尼斯市继续在令人震惊的洪水中跋涉，远在半个地球之外的布鲁克林的通勤者注意到了一些奇怪的事情——地铁站被淹没在街道上，这种景象自 2012 年以来就没有出现过，当时超级风暴桑迪淹没了近十二个隧道和城市周围的许多车站。除了这个车站入口在 11 月的一个阳光明媚的日子里被淹。这不是上帝的作为，而是考验这座城市下一次是否准备就绪。大都会运输署 (MTA) 与世界上其他主要运输机构，尤其是在靠近海洋的地区运营地下设施的机构一样，对风暴潮和海平面上升深表担忧。 “这是昨天对新安装的柔性闸门进行的水压测试。 MTA 的副通讯官沙姆斯·塔雷克 (Shams Tarek) 说：“大门经过水头测试，以确保安装正确。” “测试成功。”桑迪嘲笑了世界上最大的地铁系统，仅 MTA 就要求 50 亿美元来修复损坏的东西并在他们可以的地方塞上东西。连接布鲁克林和皇后区的 G 列车的百老汇站并不是整个车站都被洪水淹没。水被编织的凯夫拉弹性门挡住了，这是一种由 ILC Dover 工程公司开发的装置。在洪水事件中，这些凯夫拉纤维卷将能够从附在标记地铁入口的标志上的隐藏容器中展开。它们可以被拉过楼梯间并连接到最高的台阶上，以形成密封以防止最坏的情况发生。 “我们的屏障是不透水的，旨在应对 16 英尺深的洪水，”ILC Dover 的产品管理营销人员 Dan Klopp 说。 “我们的屏障和周围基础设施之间的接口处可能会出现一些轻微的渗漏，但是这比春季小雨时发生的进水要少得多。”在一个古老的地下系统中——一个贯穿整个城市的沃伦，到处都是封闭的车站，其中一些提供旅游、秘密出口、地下艺术品，甚至是废弃的气动地铁尝试——在那里下雨会导致火车停运、湿滑地板和漏水的天花板，这样的屏障是新时代的解决方案：理想情况下既防水又像钉子一样坚韧。障碍物使最明显的地铁接入点难以穿透，但水是一个滑溜的敌人。 “这些闸门并没有解决地下水渗入地铁的日益增加的压力，这也可能随着气候变化而增加，”哥伦比亚大学弹性城市和景观中心董事总经理 Thaddeus Pawlowski 说。 “曾经流经这座城市的许多小溪都被埋在地下，并找到了通往地铁的路。”\nPawlowski 说 MTA 已经花费了大量的精力来抽取和处理它。 “也许在未来，MTA 可以采用一种处理水的方法，而不仅仅是将其拒之门外，”他补充道。由于海拔较低，MTA 在洪水风险最高的站点开始了这项广泛的、高科技的堵塞计划。风险最大的，例如曼哈顿市中心的南渡轮终点站，安装了更大、更球根状的“弹性隧道塞”——32 英尺长的气球，就像飞艇和飞艇之间的交叉。一个安全气囊。 “我们这样做，”MTA 的推特账户说，“因为气候变化是真实的。”您可以在 Atlas Obscura 社区论坛中加入有关此故事和其他故事的对话。", "note_en": "As the city of Venice continued to wade through  its alarming floods, commuters half a world away in Brooklyn noticed something strange—a subway station flooded above street level, a sight that hadn’t been appeared since 2012, when Superstorm Sandy inundated nearly a dozen tunnels and many stations around the city. Except this station entrance was flooded on a sunny November day. It was no act of god, but rather a test to see if the city would be ready the next time around. The Metropolitan Transit Authority (MTA), like other major transportation agencies around the world, especially the ones that operate underground facilities in areas near the ocean, is deeply concerned about storm surges and rising seas.\n “That was a hydrostatic test yesterday of a newly installed flex gate. The gate is tested with a head of water to make sure it is installed correctly,” says Shams Tarek, a deputy communications officer for the MTA. “The test was successful.”\n  Sandy had made a mockery of the largest subway system in the world, and the MTA alone requested $5 billion to both fix what was broken and plug things up where they could.\n It wasn’t the entire station that was flooded at the Broadway station of the G train that connects Brooklyn and Queens. The water was being held back by a woven kevlar flex gate, a device developed by the engineering firm ILC Dover. In flooding events, these rolls of kevlar will be able to be unfurled from hidden receptacles attached to the signs that mark subway entrances. They can be pulled over the stairwell and attached to the highest step, to create a seal to prevent the worst from happening.\n “Our barriers are impervious and designed to handle flooding as much as 16 feet deep,” says Dan Klopp, a product managing marketer at ILC Dover. “There can be some slight leakage at the interfaces between our barriers and the surrounding infrastructure, however this amounts to much less water ingress than would happen during a light spring rain shower.”\n  In an old subterranean system—a warren that runs throughout the city, full of  closed stations,  some of which offer tours,  secret exits,  underground artwork, and even an  abandoned attempt at a pneumatic subway—where rain can lead to stalled trains, slippery floors, and leaky ceilings, such barriers are a new age solution: ideally both waterproof and tough as nails.\n The barriers make the most obvious subway access points impenetrable, but water is a slippery foe. “These gates do not address the increasing stress of groundwater penetration into the subway, which is also likely to increase with climate change,” says Thaddeus Pawlowski, managing director of Columbia University’s Center for Resilient Cities and Landscapes. “Many of the streams that once flowed through the city are buried underground and find their way into the subway.”\n Pawlowski says the MTA already spends considerable energy pumping it out and treating it. “Perhaps in the future, the MTA could adopt an approach of working with the water, rather than just keeping it out,” he adds.\n   The MTA began this expansive, high-tech plugging initiative with stations at the highest flood risk, due to their low elevation. The most at risk, such as the end-of-the-line South Ferry station in Downtown Manhattan, were fitted with larger, more bulbous “resilient tunnel plugs”—32-foot-long balloons that are like a cross between a blimp and an airbag.\n “We’re doing this,” the MTA’s  Twitter account stated, “because climate change is real.”\n You can  join the conversation about this and other stories in the Atlas Obscura Community Forums.", "posttime": "2021-07-25 15:57:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上升,flooding,地铁", "title": "在海平面上升的时代，如何防止地铁淹水？ (2019)", "title_en": "How Do You Keep a Subway from Flooding in the Age of Rising Seas? (2019)", "transed": 1, "url": "https://www.atlasobscura.com/articles/subways-flood-without-rain", "via": "", "real_tags": ["上升", "flooding", "地铁"]}, {"category": "", "categoryclass": "", "imagename": "c48d0c17cdbccb2e39ede678cc4a5300.jpg", "infoid": 1069559, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "古老的伊斯坦布尔蜿蜒的街道是海鸥、船角和五颜六色的新鲜水果摊贩的重叠杂音。阴暗的无花果树聚集在摇摇欲坠的拜占庭城墙和横扫的奥斯曼宫殿附近，这些帝国的残余势力征服并失去了博斯普鲁斯海峡上的这个战略要地，博斯普鲁斯海峡形成了东罗马帝国的所在地。在这一切之下是一个几乎看不见的古老世界，除非你知道去哪里看。 “你能想象我第一次看到这个时的兴奋吗？”考古学家费鲁登·奥兹古穆斯 (Ferudun Ozgumus) 惊呼道，他带领着沿着摇摇晃晃的木楼梯进入地毯店深处的洞穴结构。 “直到拱门的那个角落，它都充满了碎片，”他说，指着整个空间到头顶 15 英尺的地方。 “我们在爬！” 20 多年来，Ozgumus 敲响了伊斯坦布尔最古老街区的大门，并要求查看地下室。这位 64 岁的伊斯坦布尔大学教授是土耳其最早致力于研究城市地下空间的考古学家之一。他已经确定了 300 多个站点，他知道还有数百个站点。一踏进地毯店地下室的走廊，温度就下降了。至少 20 英尺高的拱门均匀地分布在整个结构中。水从天花板上滴下来，当你抬头时，你会看到砖块的漩涡——薄而锈色，与厚厚的砂浆条纹交替。 “砖块的厚度、砖块之间的砂浆厚度和颜色都告诉我结构的日期，”Ozgumus 解释说。 “你可以看到这个拱门，它是凿成的石头，切割过的石头。这个拱门比较古老。我确定这是公元 2 世纪的作品” Ozgumus 认为，这个特殊的地点可能与君士坦丁大帝建造的一座庞大的宫殿有关伟大的，4 世纪的罗马皇帝和古君士坦丁堡的创始人。但很难确定。档案文件中提到的许多拜占庭时代的建筑都已被历史遗忘，例如君士坦丁大名鼎鼎的宫殿接待大厅。从来没有人发现过它。\n“我们有很多来自罗马晚期的文学资料，但考古数据并不相符，”Ozgumus 说。 Ozgumus 的工作理论基于砖块和商店的位置，认为该结构可能是宫殿接待大厅下方的储藏室。但这个想法只能通过额外的挖掘来证实。在整个伊斯坦布尔，都有关于拜占庭首都居民如何生活、工作和建造城市的线索。这些与当前的环境融为一体：古罗马澡堂的废墟构成了现代办公楼的锅炉房。一个 6 世纪的蓄水池有着令人眼花缭乱的白色柱子，用作珠宝工坊，配备蚀刻银项链和戒指的机器。 （“通风不太好，”店主说，“但冬天保暖，夏天凉爽。”）还有一个小教堂的外壳——可通过梯子到达——坐落在水烟酒吧的地下室下方.在 Ozgumus 于 2010 年完成对伊斯坦布尔历史半岛的 13 年考古调查之后，年轻的学者继续他的工作，将数百个遗址添加到公共记录中。这些遗址构成了一个规模虽小但不断增长的地下游览线路的基础，游客可以在其中穿过狭窄的通道，从早已被遗忘的教堂中看到古老的砖砌、蓄水池和壁画。作家兼导游亚辛·卡拉巴卡 (Yasin Karabacak) 在社交媒体上将他的发现分享为“伊斯坦布尔的隐藏面孔”，他说：“地下建筑并不容易进入。它们是私有的，你需要一个网络。” “每个人都可以去圣索菲亚大教堂。但是当你打开一扇通往地下的门时......你会觉得很特别，就像它只适合你一样，”Karabacak 说。 “这就像另一个世界，另一个城市。”\n伊斯坦布尔的地下世界不乏神话，据说到处都是秘密隧道。人们相信一位皇帝在他的宫殿和圣索非亚大教堂和竞技场（现在的苏丹艾哈迈德广场）之间修建了秘密隧道，这样他和他的随从就可以在不进入街道的情况下出现在公众面前。当基督教十字军在 1204 年第四次十字军东征期间洗劫君士坦丁堡时，圣索菲亚大教堂的几件文物失踪了。如果存在的话，教堂的僧侣可以在这些秘密隧道中隐藏基督教遗物，这将是合乎逻辑的。但他们从未被发现。 Karabacak 说，一些隧道——比如那些在奥斯曼帝国建造的渡槽中供清洁人员使用的隧道——只是为了平凡的目的。 “因此，并非所有隧道都是秘密的或具有秘密功能。它们具有非常基本的功能，例如清洁、维护，”他说。伊斯坦布尔拜占庭地下室过剩的部分幸存下来，部分归功于 1980 年代的文化遗产法，该法允许人们在自己的财产上发现古老的东西，而不必担心政府会没收。 “由于这项新法律，伊斯坦布尔当地人保护了许多历史事物，”Ozgumus 说。 “以前，他们正在摧毁它。”对一些人来说，罗马遗址吸引了游客，是一个福音。一家地毯店的老板在其下方发现了一个蓄水池，将这里改造成一个小型博物馆，专门展示君士坦丁堡古老的竞技场。另一个人在倒下的柱子周围建造了他的商店地基，因为它太重而无法移动。\n其他人仍然担心失去财产或因历史调查而推迟装修。有时，由于重大的考古发现，施工可能会被搁置。 Ozgumus 说，所以他们隐藏了他们财产的古代遗址。拜占庭石匠是地下建筑的专家。他们创造了一个广泛的蓄水池系统来储存通过渡槽吸入的水，以及公共建筑下的大型地下室以提供温度控制的储存。与伊斯坦布尔大都会市政府合作的考古学家和建筑历史学家 Kerim Altug 注意到，这些蓄水池的建造技术有助于该市的供水抵御地震。 “该模型由四根柱子组成，每根柱子都与拱门相连。每个方形海湾形成一个蓄水池。每根柱子都通过木系梁连接到另一个，”阿尔图格说。 “它在地震中匀速运动，永不倒塌。” Altug 已经绘制了 158 个拜占庭蓄水池的位置，并相信古代君士坦丁堡有数千个蓄水池。 “我们不知道我们在这项工作中的位置，因为还有许多其他蓄水池等待被发现，”阿尔图格说。 “没有系统的考古发掘，大部分是建筑工程的抢救性发掘。”历史学家阿尔祖·乌拉斯 (Arzu Ulas) 表示，当奥斯曼帝国到来时，重建和重新使用拜占庭式建筑是有意义的，而不是拆除它们并从头开始。\n“拜占庭帝国使用的材料在战时很难找到，”她说。 “这是非常昂贵的，拜占庭式的结构非常坚固。”奥斯曼帝国扩大并改善了君士坦丁堡的供水系统。他们有时将蓄水池改造成丝绸编织车间和新鲜农产品储藏室。乌拉斯说，后来，一些下部结构年久失修或被用于走私等非法活动。在一些清真寺下，她发现了充满水和动物骨头的走廊。在伊斯坦布尔的法提赫区，一家皮革批发商背后的阳台俯瞰着石拱门，费鲁登·奥兹古穆斯认为，这些石拱门是君士坦丁堡主广场狄奥多西广场 (Forum of Theodosius) 一座庄严住宅下的储藏地下室的一部分。他认为这是一座 6 世纪的建筑，其柱头可以追溯到查士丁尼皇帝时代。 Ozgumus 指出石头中的两个矩形空隙，这是一个古老的供暖系统的残余物，它迫使温暖的空气通过建筑物的腹部进入相邻的房间。这些拱门经受住了几个世纪的地震、火灾和快速的城市发展。即使在今天，它们仍然支撑着上面世界的重量。但在一种不和谐的情况下，30 英尺高的蓝色金属高跷用螺栓固定在石头上，支撑着一个预制购物中心的地板。商场地板上的一个舱口用于将垃圾——外卖盒、木屑，甚至是一个塑料商店模特——倾倒在下面的拜占庭式建筑上。 “看看这个。这是我们的耻辱，”Ozgumus 说。 “在它的鼎盛时期，它很漂亮。”\n他说，这是一个很好的例子，说明为什么不应该挖掘伊斯坦布尔的所有地下世界。工作完成后，太多考古发掘被放弃，使遗址容易受到开发商的影响。 “从 4 世纪开始，这些子结构为我们提供了原始伊斯坦布尔的布局，”Ozgumus 说。 “我们现在在市中心。”如果你没有资金和计划来保护它，他认为，你应该把它留在地下。在这个故事的前一个版本中，引用错误的措辞说清真寺下的走廊由于疏忽而状况不佳。引用实际上是指用于识别结构的文件，而不是结构本身。此外，这个故事错误地将 Arzu Ulas 识别为伊斯坦布尔大学的研究生。她在伊斯坦布尔大学攻读本科学位，但目前就读于法提赫苏丹穆罕默德瓦基夫大学。", "note_en": "The winding streets of old Istanbul are an overlapping cacophony of seagulls, ship horns and vendors of colorful fresh fruit. Shady fig trees cluster near crumbling Byzantine walls and sweeping Ottoman palaces, remnants of the empires that conquered and lost this strategic point on the Bosporus Strait, which formed the seat of the Eastern Roman Empire.\n  Underneath it all is an ancient world that&#39;s almost invisible, unless you know where to look.\n  &#34;Can you imagine my excitement when I saw this for the first time?&#34; exclaims archaeologist Ferudun Ozgumus, as he leads the way down a rickety wooden staircase into a cavernous structure deep beneath a carpet shop. &#34;It was full of debris as far as that corner of the arch,&#34; he says, pointing across the space to a point 15 feet overhead. &#34;We were crawling!&#34;\n  For more than 20 years, Ozgumus has knocked on the doors of Istanbul&#39;s oldest neighborhoods and asked to see the basement. At 64, the Istanbul University professor is one of the first archaeologists in Turkey devoted to studying the city&#39;s underground spaces. He has identified more than 300 sites, and he knows there are hundreds more.\n    As soon as you step inside the corridor of the carpet shop basement, the temperature drops. Arches, at least 20 feet high, are evenly spaced through the structure. Water drips from the ceiling, and as you look up, you see swirls of bricks — thin and rust-colored, alternating with thick stripes of mortar.\n    &#34;The thickness of the bricks, the thickness of the mortar between the bricks and the color all tell me the date of the structure,&#34; Ozgumus explains. &#34;You can see this arch, it&#39;s hewn stones, cut stones. This arch is older. I&#39;m sure that this is from the 2nd century A.D.&#34;\n  This particular site, Ozgumus believes, may be related to a sprawling palace built by Constantine the Great, the 4th century Roman emperor and founder of ancient Constantinople. But it&#39;s hard to know for sure. Many Byzantine-era buildings that are mentioned in archival documents have been lost to history, such as Constantine&#39;s famous palace reception hall. No one has ever found it.\n  &#34;We have a lot of literary sources coming from the late-Roman time, but archaeological data doesn&#39;t match,&#34; Ozgumus says.\n    Ozgumus&#39; working theory, based on the bricks and the shop&#39;s location, is that this structure may have been a storage basement underneath that palace reception hall. But this idea can only be confirmed by additional excavations.\n    Throughout Istanbul, there are clues to how residents of the Byzantine capital lived, worked in and built their city. These blend in with the current surroundings: The ruins of an ancient Roman bathhouse frame the boiler room of a modern office building. A 6th century cistern with blinding-white columns serves as a jewelers&#39; workshop, with machinery to etch out silver necklaces and rings. (&#34;The ventilation isn&#39;t great,&#34; says the owner, &#34;but it stays warm in the winter and cool in the summer.&#34;) And the shell of a small church — reachable by ladder — sits beneath the basement of a hookah bar.\n  After Ozgumus completed a 13-year archeological survey of Istanbul&#39;s historic peninsula in 2010, younger scholars have continued his work, adding hundreds of sites to the public record.\n    These sites form the basis of a small but growing line of underground tours, in which visitors can navigate narrow passages to see ancient brickwork, cisterns and frescoes from long-forgotten churches.\n  &#34;There&#39;s no easy access to underground structures. They&#39;re privately owned, and you need a network,&#34; said Yasin Karabacak, an author and tour guide who shares his finds  on social media as the &#34; Hidden Face of Istanbul.&#34;\n  &#34;Everyone can go to the Hagia Sophia. But when you open a door to the underground... you feel special, like it&#39;s only for you,&#34; Karabacak says. &#34;It&#39;s like another world, another city.&#34;\n      There is no shortage of mythology surrounding Istanbul&#39;s underground world, said to be full of secret tunnels. It&#39;s believed that an emperor had secret tunnels built from his palace to both the Hagia Sophia and the Hippodrome (now Sultanahmet Square) so that he and his entourage could appear in public without entering the street.\n  When Christian crusaders sacked Constantinople during the Fourth Crusade in 1204, several artifacts from the Hagia Sophia went missing. It would be logical that the church&#39;s monks could have hidden Christian relics in these secret tunnels, if they existed. But they have never been found.\n  Some tunnels — like those for the cleaning crews in the Ottoman-built aqueducts — simply served mundane purposes, Karabacak says.\n  &#34;So not all tunnels are secret or have a secret function. They have a very basic function like cleaning, maintenance,&#34; he says.\n    Istanbul&#39;s Byzantine basement surfeit survives in part thanks  to a 1980s cultural heritage code that allows people who find something ancient on their property to keep it, without worrying that the government will seize it.\n  &#34;Thanks to this new law, a lot of historical things were protected by the locals in Istanbul,&#34; Ozgumus says. &#34;Before, they were destroying it.&#34;\n  For some, the Roman ruins have attracted tourists and been a boon. The owner of one carpet shop, finding a cistern underneath it, converted the site into a small museum devoted to Constantinople&#39;s ancient Hippodrome. Another built his shop&#39;s foundation around a fallen column simply because it was too heavy to move.\n  Others still fear losing their property or having renovations delayed by historical surveys. Sometimes construction can be held up because of significant archeological finds. So they keep their property&#39;s ancient sites hidden, Ozgumus says.\n    Byzantine stonemasons were experts at building underground. They created an extensive system of cisterns to store water pulled in through aqueducts, and large basements under public buildings to provide temperature-controlled storage.\n    Kerim Altug, an archaeologist and architectural historian who works with the Istanbul Metropolitan Municipality, noticed that the cisterns were built with techniques that helped the city&#39;s water supply withstand earthquakes.\n  &#34;The model consists of four columns, each connected with arches. Each square bay creates a cistern. And each is connected to another by wooden tie beams,&#34; Altug said. &#34;It moves uniformly during the earthquake and never collapses.&#34;\n  Altug has mapped the location of 158 Byzantine cisterns, and believes there were thousands in ancient Constantinople.\n  &#34;We don&#39;t know where we are on this work, because there are many other cisterns waiting to be discovered,&#34; Altug said. &#34;There are no systematic archeological excavations. Most are rescue excavations for construction projects.&#34;\n    When the Ottomans arrived, it made sense for then to build over and reuse Byzantine structures, says historian Arzu Ulas, rather than demolishing them and starting from scratch.\n  &#34;Materials used in the Byzantine empire were hard to find in wartime,&#34; she says. &#34;It was very costly, and the Byzantine structures were very strong.&#34;\n  The Ottomans expanded and improved Constantinople&#39;s water system. They sometimes converted cisterns into silk weaving workshops and storage for fresh produce. Later, some substructures fell into disrepair or were used for illegal activities such as smuggling, Ulas says. Under some mosques, she&#39;s found corridors filled with water and animal bones.\n      In Istanbul&#39;s Fatih district, a balcony behind a wholesale leather distributor overlooks stone arches that Ferudun Ozgumus believes were built as part of a storage basement under a stately home on the Forum of Theodosius, Constantinople&#39;s main square. He believes this is a 6th century structure, based on its column capitals dating to the era of the Emperor Justinian.\n  Ozgumus points out two rectangular voids in the stone, the remnants of an ancient heating system which forced warm air through the belly of a building and into adjoining rooms.\n    These arches have survived centuries of earthquakes, fires and rapid urban development. Even today, they&#39;re still supporting the weight of the world above.\n  But in a jarring juxtaposition, 30-foot blue metal stilts are bolted into the stones, holding up the floor of a prefabricated shopping mall. A hatch in the mall&#39;s floor is used to dump trash — takeout boxes, scraps of wood, even a plastic store mannequin — onto the Byzantine structure below.\n  &#34;Look at this. It&#39;s a shame on us,&#34; Ozgumus says. &#34;In its heyday, it was beautiful.&#34;\n  It&#39;s a good example, he says, of why not all of Istanbul&#39;s underworld should be excavated. Too many archeological excavations were abandoned after the work was done, leaving sites vulnerable to developers.\n  &#34;Those substructures are giving us the layout of the original Istanbul, from the time of the 4th century,&#34; Ozgumus says. &#34;We&#39;re in the heart of the city now.&#34;\n  If you don&#39;t have the financing and a plan to preserve it, he believes, you should keep it in the ground.\n In a previous version of this story, a quote was incorrectly phrased to say the corridors under the mosques were in bad shape because of inattention. The quote was actually referring to documents used to identify the structures and not the structures themselves. In addition, the story incorrectly identified Arzu Ulas as a graduate student at Istanbul University. She pursued her undergraduate degree at İstanbul University but is currently with Fatih Sultan Mehmet Vakif University.", "posttime": "2021-07-25 15:57:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "探索,istanbul,ozgumus", "title": "在伊斯坦布尔下方，考古学家探索古城的拜占庭地下室", "title_en": "Beneath Istanbul, Archaeologists Explore an Ancient City's Byzantine Basements", "transed": 1, "url": "https://www.npr.org/2021/07/23/1016814868/beneath-istanbul-archaeologists-explore-an-ancient-citys-byzantine-basements", "via": "", "real_tags": ["探索", "istanbul", "ozgumus"]}]