[{"category": "", "categoryclass": "", "imagename": "da075cddc106677c014c8b6bb3bb2091.jpg", "infoid": 1034615, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国，目前与新冠肺炎一起住院的人比以往任何时候都多，许多州的医院都处于不堪重负的边缘。\n根据COVID跟踪项目的数据，目前美国约有6.2万人感染了大流行冠状病毒，超过了之前所有住院人数的峰值，即约6万人。这股浪潮是激烈的，而且是扩散的。仅在过去两周，住院人数就上升了40%，而且在全国每个地区都在上升。\n现在有17个州的住院人数打破了纪录，其中中西部的州受到的打击最大。在北达科他州，医院的使用率达到100%。周一，北达科他州州长道格·伯古姆(Doug Burgum)宣布，该州已经修改了一项健康令，现在允许感染冠状病毒的护士继续在医院工作，只要他们没有出现症状。这一举措旨在缓解医院工作人员的压力，他们正被蜂拥而至的病人压得喘不过气来。这位州长补充说，该州还在寻求聘请紧急医疗技术人员和护理人员来进行新冠肺炎的测试操作。\n威斯康星州州长托尼·埃弗斯(Tony Evers)周二在黄金时段发表了一次不同寻常的演讲，敦促该州的人们呆在家里，如果可能的话，在家工作，如果必须外出，还要戴上口罩。最近几周，威斯康星州的病例、住院和死亡人数急剧上升，创历史新高，而且看不到结束的迹象。该州目前有2000多人住院，仅周二就有72人死亡。威斯康星州昨天还记录了7400多例新病例，使獾州的病例总数达到近30万例。\n威斯康星州以及爱荷华州、堪萨斯州、明尼苏达州、密苏里州和蒙大拿州的医院已经达到或接近饱和。周五，犹他州州长加里·赫伯特(Gary Herbert)宣布医院人满为患，进入紧急状态。该州在紧急状态声明中写道：“形势严峻，难以为继。”德克萨斯州的医院也很紧张。在埃尔帕索，情况非常严重，得克萨斯州州长格雷格·阿博特(Greg Abbott)周六要求使用一家军事医疗中心，因为当地医院挤满了新冠肺炎患者。据美国有线电视新闻网(CNN)周二报道，除了已经在使用的6个流动停尸房外，该县当局还要求再增加4个流动停尸房。\n随着全国新病例继续急剧上升，住院治疗的前景看起来很严峻。周二是又一个破纪录的病例统计日，新增阳性病例13.1万例。随着病例的增加，住院人数也在增加，几周内死亡人数也在增加。许多地方已经看到了上涨，而其他地方也在为此做准备。\n研究人员和医学专家在整个疫情期间磨练了新冠肺炎的治疗和护理策略，大大降低了住院患者的死亡率。然而，COVID跟踪项目正确地指出，如果医院和医疗保健提供者充斥着患者，这些成果可能很快就会被冲走。不堪重负的医疗机构将无法为所有患者提供最佳护理，因为他们的人员配备、资源甚至物理空间都达到了极限。\n几周来，专家们一直在对该国的严峻形势敲响警钟。当选总统乔·拜登(Joe Biden)呼应了这一警报，警告称将迎来一个“非常黑暗的冬天”，并呼吁采取行动。这位当选总统和他的过渡团队已经不遗余力地制定计划和基础工作，以便在他明年1月上任后尽快解决这场危机。", "note_en": "More people in the United States are currently hospitalized with COVID-19 than ever before in the pandemic, and hospitals in numerous states are on the brink of being overwhelmed.\n Around 62,000 people in the US are now in the hospital with the pandemic coronavirus, topping all previous peaks in hospitalizations, which were around 60,000, according to the COVID Tracking Project. The surge is intense and diffuse. Hospitalizations are up 40 percent over the last two weeks alone, and they’re rising in every region of the country.\n Seventeen states are now at record-breaking numbers of hospitalizations, with states in the Midwest hit the hardest. In North Dakota, hospitals are  at 100 percent capacity. On Monday, North Dakota Gov. Doug Burgum announced that the state has amended a health order to now allow nurses who are infected with the coronavirus to keep working in hospitals as long as they show no symptoms. The move is aimed at alleviating strain on hospital staff who are being overwhelmed by the influx of patients. The governor added that the state is also looking to hire emergency medical technicians and paramedics to run COVID-19 testing operations.\n Wisconsin Gov. Tony Evers gave an unusual prime-time speech Tuesday to urge people in his state to  stay in their homes, work from home if possible, and wear masks if they must go out. Wisconsin has seen a sharp, record-breaking rise in cases, hospitalizations, and deaths in recent weeks, with no end in sight. More than 2,000 people in the state are currently hospitalized and 72 died just on Tuesday. Wisconsin also logged over 7,400 new cases yesterday, bringing the Badger State’s total to nearly 300,000.\n  Hospitals in  Wisconsin, as well as  Iowa,  Kansas,  Minnesota,  Missouri, and  Montana, are at or near capacity. On Friday, Utah Gov. Gary Herbert declared a state of emergency over hospital overcrowding. “ The situation is dire and unsustainable,” the state wrote in its emergency declaration announcement. Hospitals are also  strained in Texas. In El Paso, the situation is so serious that Texas Gov. Greg Abbott on Saturday  requested to use a military medical center as local hospitals filled up with COVID-19 patients. Authorities in the county also requested  four more mobile morgues in addition to the six already in use, CNN reported Tuesday.\n The outlook for hospitalizations looks grim as new cases continue on a sharp ascent throughout the country. Tuesday saw yet another record-breaking day of case counts, with 131,000 new positive cases. With mounting cases come mounting hospitalizations and, within weeks, mounting deaths. Many places are already seeing upticks while others are bracing for them.\n Researchers and medical experts have honed COVID-19 treatments and care strategies throughout the pandemic, dragging death rates of hospitalized patients down considerably. However, those gains can be quickly washed out if hospitals and healthcare providers are flooded with patients,  the COVID Tracking Project rightly notes. Overwhelmed healthcare facilities will be unable to provide optimal care for all patients as their staffing, resources, and even physical space hit their limits.\n Experts have for weeks been sounding the alarm on the country’s dire situation. President-elect Joe Biden has echoed the alarm, warning of a “ very dark winter” and calling for action. The president-elect and his transition team have spared no time in laying out plans and ground work to addressing the crisis as soon as he takes office in January.", "posttime": "2020-11-12 02:42:40", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,濒临,brink,医院", "title": "新冠肺炎住院人数创历史新高，美国医疗保健濒临崩溃", "title_en": "US healthcare on brink as COVID-19 hospitalizations hit all-time high", "transed": 1, "url": "https://arstechnica.com/science/2020/11/us-healthcare-on-brink-as-covid-19-hospitalizations-hit-all-time-high/", "via": "", "real_tags": ["美国", "濒临", "brink", "医院"]}, {"category": "", "categoryclass": "", "imagename": "77c24db254affffc1ce46d1ee24147a5.jpg", "infoid": 1034614, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TechCrunch了解到并证实，Snap正在以1.2亿美元的价格收购一家名为voca.ai的初创公司，该公司为客户支持服务构建基于人工智能的语音助手：7000万美元的现金加上5000万美元的股票。\n“10个客户中有7个仍然更喜欢与代理商通话，”VOVA在其网站上写道。“VOVA提供自然的、类似人类的对话，这会让你想知道你是在和虚拟特工还是真人特工交谈。”该平台充当一种分诊系统，它处理简单的入站查询，然后无缝地将更复杂的问题移交给代理。\nSnap的发言人拒绝对本文发表评论，发给Voca创始人埃纳夫·伊塔马尔(Einav ITamar)和艾伦·贝克(Alan Bekker)的消息也没有得到回复。但我们已经确认了价格，并与接近交易的多个消息来源打交道。\n以色列出版物Calcalist最先报道了这笔交易(但没有给出正确的价格)。\n我们被告知，Voca.ai的40人团队将全部加入Snap。\nVoca.ai成立于以色列，在纽约也设有办事处，该公司已经筹集了约600万美元-包括2019年10月从美国运通风险投资公司(American Express Ventures)获得的一轮战略融资。其他投资者包括Lool Ventures和Flint Capital。\n值得注意的是，这家初创公司已经有了大量的客户，并表示它为“数百万次对话”提供了动力。具体地说，去年10月，该公司指出，它每月处理约200万次垂直领域的电话/对话，包括银行、电信、保险和法律服务。客户包括东芝、Amdocs、Firstclass Capital和Boost Health Insurance等。\n目前还不清楚Snap打算如何处理Voa.ai，但这笔交易发生在一个非常有趣的时刻。今年，所有虚拟服务的活跃度都出现了大幅增长，疫情以及公共卫生方面减少面对面接触的普遍努力，促使比以往任何时候都更多的人在网上办理业务。\n这推动了公司开发面向消费者的技术应用，使其平台多样化，并将其作为企业与客户之间的一种独特方式进行营销。这方面的一个关键例子是Facebook，它为Messenger、WhatsApp和Instagram添加了更多工具，使这些应用程序对那些不仅想向客户推销自己，还想用这些应用程序来处理他们的问题，并有可能向他们出售东西的企业更有用。\n尽管Snap对voca.ai感兴趣可能仅仅是为了与自己的客户建立更好的互动--它在上个季度的营收增长了52%，6.79亿美元的业务规模不容小觑--但它考虑如何在Snapchat中加入更多商业服务，并随之实现收入多元化，这是一个自然而合乎逻辑的举动。\n在其商业服务的主页上，该公司指出，“人们使用Snapchat与朋友交流、建立关系、玩耍和学习。”通过全屏数字广告激发行动，提高知名度，推动转化，并为各种规模的企业带来真正的结果。可以毫不夸张地认为，这些商业要务也可以扩展到“推动对话”。\nSnap在人工智能领域进行了许多有趣的交易，以获得知识产权，但其中大部分都是在计算机视觉领域，例如创建照片和视频滤镜以及其他增强现实应用。其中包括Looksery、AI Factory和CImagine等公司，CImagine恰好是另一家来自以色列的初创公司。", "note_en": "TechCrunch has learned and confirmed that Snap is acquiring a startup called  Voca.ai, which builds AI-based voice assistants for customer support services, for $120 million: $70 million in cash plus $50 million in stock.\n “7 out of 10 customers still prefer speaking with an agent,” Voca notes on its site. “Voca offers natural, human-like conversations that will leave you wondering if you spoke with a virtual or human agent.” The platform serves as a kind of triage system, which handles simple inbound queries, and then hands over to agents seamlessly for more complex issues.\n  A spokesperson for Snap declined to comment for this article, and messages sent to Voca’s founders — Einav Itamar and Alan Bekker — have not been returned. But we have confirmed the price and deal with multiple sources close to the transaction.\n Israeli publication  Calcalist first reported on the transaction (but didn’t get the price right).\n Voca.ai’s team of 40 will all be joining Snap, we have been told.\n Voca.ai, founded in Israel with offices also in New York — had raised about $6 million — including a  strategic round from American Express Ventures in October 2019. Other investors include lool ventures and Flint Capital.\n It’s notable that the startup already has a substantial list of customers and says that it powers “millions of conversations.” Specifically in October last year, it noted that it was processing some 2 million calls/conversations per month in verticals that include banking, telecoms, insurance and legal services. Customers include Toshiba, Amdocs, FirstClass Capital, and Boost Health Insurance, among others.\n It’s not clear what Snap intends to do with Voca.ai, but the deal comes at a very interesting moment.  All virtual services have seen a big boost of activity this year, with the pandemic — and the general public health push to reduce in-person contacts — driving more people to handle business online than ever before.\n And that is driving companies building consumer-facing tech apps to diversify and market their platforms as a unique way to interface between businesses and customers. One key example of that has been Facebook, which has added more tools to Messenger, WhatsApp and Instagram to make the apps more useful to businesses that want not just to market themselves to customers, but to use the apps to handle questions from them, and potentially sell things to them.\n Although Snap may be interested in Voca.ai simply as a way to build better interactions with its own customers — it registered a 52% growth in revenues this past quarter ( Q3), and $679 million in business is nothing to sniff at — it’s a natural and logical move for it to consider how it could build more business services into Snapchat, and diversify its own revenues along with that.\n In its home page for its business services, the company notes that “ People use Snapchat to communicate with friends, build relationships, play and learn. Inspire action with full-screen, digital ads that boost awareness, drive conversions, and generate real results for businesses of all sizes.” It’s not a stretch to think that those business imperatives could also extend to “drive conversations.”\n  Snap has made a number of interesting deals to pick up IP in the area of artificial intelligence, but much of that has been in the area of computer vision, for example to create photo and video filters and other augmented reality applications. They have included the likes of  Looksery,  AI Factory and  Cimagine, which happens to be another startup out of Israel.", "posttime": "2020-11-12 02:38:15", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "人工智能,代理,acquired,客户", "title": "\nSnap斥资1.2亿美元收购了为呼叫中心生产基于人工智能的语音代理的voca.ai", "title_en": "\n\t\t\t\tSnap acquired Voca.ai, which makes AI-based voice agents for call centers, for $120M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/11/11/snap-acquired-voca-ai-which-makes-ai-based-voice-agents-for-call-centers-for-120m/", "via": "", "real_tags": ["人工智能", "代理", "acquired", "客户"]}, {"category": "", "categoryclass": "", "imagename": "058153f51e1aa04999a0fb255928ca1f.jpg", "infoid": 1034613, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "目前，每个免费的谷歌账户都有15 GB的在线存储空间，可以满足你的所有Gmail、Drive和Photos需求。电子邮件和你存储在Drive中的文件已经计入了这15 GB的存储空间，但到了6月1日，所有的文档、工作表、幻灯片、图纸、表格或Jamboard文件都将计入免费存储空间。这些都是小文件，但这里最重要的可能是，你上传的几乎所有照片现在都会计入15 GB的费用。\n这是一笔竞标交易，因为今天，谷歌照片允许你免费存储无限的图片(如果是高清的话，也可以是无限的视频)，只要它们的分辨率低于16MP，或者你选择让谷歌降低质量。到2021年6月，任何高质量上传的新照片或视频都将计入免费的15 GB空间，目前这些照片或视频不会计入你的分配。\n随着人们每年拍摄更多的照片，免费赠送的照片不会持续很长时间。谷歌辩称，80%的用户将至少有三年的时间达到15 GB的容量。不过，考虑到你正在阅读TechCrunch，你很有可能是那20%的人中的一员，空间耗尽的速度会快得多(或者你已经在Google One计划中了)。\n好消息是：为了让这一过渡更容易一些，2021年6月1日之前上传的高质量照片和视频将不会计入15 GB的免费存储空间。不过，和往常一样，原创质量的图像将继续对其不利。如果你拥有Pixel设备，即使在6月1日之后，你仍然可以从这些设备上传无限数量的高质量图片。\n为了让你知道你目前的存储空间能持续多久，谷歌现在也会向你展示个性化的预估。明年6月，该公司将发布一个新的免费照片工具，让你可以更轻松地管理你的存储空间。它还会向你显示你可能想要删除的暗淡模糊的照片--但在很长一段时间里，谷歌的承诺是你不必担心存储问题(还记得谷歌的旧Gmail座右铭吗？‘存档，不要删除！’)。\n除了这些存储更新，还有一些额外的变化值得了解。如果你的账户在Gmail、Drive或Photos中停用超过两年，谷歌可能会删除这些产品中的内容。因此，如果你使用Gmail，但两年内不使用Photos，因为你使用了另一项服务，谷歌可能会删除你在那里存储的所有旧照片。如果你超过存储限制两年，谷歌“可能会删除你在Gmail、Drive和Photos上的内容。”\n削减免费和(在某些情况下)无限的服务从来都不是一个伟大的举措。谷歌辩称，它需要做出这些改变，以“继续为每个人提供出色的存储体验，并跟上不断增长的需求。”\n现在，人们每天都会向Gmail、Drive和Photos上传超过430万GB的内容。我敢肯定，这并不便宜，但谷歌也控制着这方面的方方面面，而且当它第一次制定这些政策时，肯定对这一点会如何发展有一些内部预测。\n不过，在某种程度上，这或许是意料之中的。毕竟，这不再是2010年那种随心所欲的谷歌了。例如，我们已经看到一些迹象表明，谷歌可能会在照片中为Google One用户保留一些高级功能。这一新举措显然将推动更多的人为Google One付费，而Google One带来的更多资金意味着该公司对广告的依赖程度有所降低。", "note_en": "Currently, every free Google Account comes with 15 GB of online storage for all your Gmail, Drive and Photos needs. Email and the files you store in Drive already counted against those 15 GB, but come June 1, all Docs, Sheets, Slides, Drawings, Forms or Jamboard files will count against the free storage as well. Those tend to be small files, but what’s maybe most important here, virtually all of your Photos uploads will now count against those 15 GB as well.\n That’s a bid deal because today, Google Photos lets you store  unlimited images (and unlimited video, if it’s in HD) for free as long as they are under 16MP in resolution or you opt to have Google degrade the quality. Come June of 2021, any new photo or video uploaded in high quality, which currently wouldn’t count against your allocation, will count against those free 15 GB.\n   As people take more photos every year, that free allotment won’t last very long. Google argues that 80 percent of its users will have at least three years to reach those 15 GB. Given that you’re reading TechCrunch, though, chances are you’re in those 20 percent that will run out of space much faster (or you’re already on a Google One plan).\n Some good news: to make this transition a bit easier, photos and videos uploaded in high quality before June 1, 2021 will not count toward the 15 GB of free storage. As usual, original quality images will continue to count against it, though. And if you own a Pixel device, even after June 1, you can still upload an unlimited number of high-quality images from those.\n To let you see how long your current storage will last, Google will now show you personalized estimates, too, and come next June, the company will release a new free tool for Photos that lets you more easily manage your storage. It’ll also show you dark and blurry photos you may want to delete — but then, for a long time Google’s promise was you didn’t have to worry about storage (remember Google’s old Gmail motto? ‘Archive, don’t delete!’)\n In addition to these storage updates, there’s a few additional changes worth knowing about. If your account is inactive in Gmail, Drive or Photos for more than two years, Google ‘may’ delete the content in that product. So if you use Gmail but don’t use Photos for two years because you use another service, Google may delete any old photos you had stored there. And if you stay over your storage limit for two years, Google “may delete your content across Gmail, Drive and Photos.”\n Cutting back a free and (in some cases) unlimited service is never a great move. Google argues that it needs to make these changes to “continue to provide everyone with a great storage experience and to keep pace with the growing demand.”\n People now upload more than 4.3 million GB to Gmail, Drive and Photos every day. That’s not cheap, I’m sure, but Google also controls every aspect of this and must have had some internal projections of how this would evolve when it first set those policies.\n To some degree, though, this was maybe to be expected. This isn’t the freewheeling Google of 2010 anymore, after all. We’ve already seen  some indications that Google may reserve some advanced features for Google One subscribers in Photos, for example. This new move will obviously push more people to pay for Google One and more money from Google One means a little bit less dependence on advertising for the company.", "posttime": "2020-11-12 02:37:59", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,免费,photos", "title": "到6月1日，你所有的新照片都将计入你的免费谷歌存储空间", "title_en": "Come June 1, All of Your New Photos Will Count Against Your Free Google Storage", "transed": 1, "url": "https://techcrunch.com/2020/11/11/google-cuts-back-on-its-free-storage-get-ready-to-pay-up", "via": "", "real_tags": ["google", "谷歌", "免费", "photos"]}, {"category": "", "categoryclass": "", "imagename": "408fc77d5ad92dbd9bcd4af44e6a15e9.jpeg", "infoid": 1034612, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "五年来，Google Photos一直提供“高质量”的无限量免费照片备份，一旦该账户使用超过15次，Google Photos将开始收取存储费用。这一变化将于2021年6月1日发生，同时还会有其他Google Drive政策变化，比如将Google Workspace文档和电子表格计算在同一上限内。谷歌还推出了一项新政策，从至少两年未登录的非活跃账户中删除数据。\n6月1日之前上传的所有照片和文件都不会计入15 GB的上限，所以你有足够的时间来决定是继续使用Google Photos还是切换到其他云存储提供商来保存你的照片。只有在6月1日之后上传的照片才会开始计入上限。\n谷歌已经将“原创质量”的照片上传计入了Google Photos的存储上限。然而，取消对“高质量”照片和视频(自动压缩以提高存储效率)的无限备份，也带走了该服务的一个最大卖点。这是一项照片服务，你根本不用担心你有多少存储空间。\n顺便说一句，6月1日之后，Pixel的拥有者仍然可以免费上传高质量(非原创)的照片，而不会把这些照片算在他们的帽子上。它不如Pixel最初提供无限原创质量的协议，但对于少数购买谷歌设备的人来说，这只是一个小小的奖励。\n谷歌指出，它比其他公司提供了更多的免费存储空间--你可以得到15 GB，而不是苹果iCloud提供的区区5 GB--它还声称，80%的谷歌照片用户至少在三年内都不会达到15 GB的上限。\n当你开始接近这个上限时，公司会发出警报和警告。谷歌还在谷歌照片(Google Photos)中加入了新的存储管理工具，包括一个让你更容易找到和删除你本来可能不想要的照片的工具，比如模糊的图片或截图。\n谷歌还将展示一个更有用的“个性化估计”，即一个存储层将在时间上持续多久，而不是千兆字节。它估计每个用户随着时间的推移的平均上传次数，以猜测他们还能使用当前层多长时间。\n为什么会有这样的变化？一种可能性是，这是吸引更多人注册Google One存储的更大努力的一部分。这项服务现在还包括一些较高级别的Android免费VPN，而且似乎许多谷歌产品都在与Google One结盟。谷歌在一次简短的采访中的解释更简单：上传到谷歌照片上的照片和视频已经达到了近乎深不可测的数量，而且这项服务需要具有可持续性。如果你从其博客帖子的字里行间读到这一点，你就会明白这一点：\n如今，超过4万亿张照片存储在Google Photos中，每周有280亿张新照片和视频上传。既然你们中有这么多人依赖谷歌照片来存储你的记忆，那么重要的是，它不仅是一款伟大的产品，而且从长远来看，它还能继续满足你的需求。为了欢迎你更多的回忆，并为未来打造谷歌照片，我们正在改变我们的无限高质量存储政策。\nGoogle One的定价没有改变。它的起步价为每月1.99美元(100 GB)，分为200 GB(2.99美元/月)、2TB(9.99美元/月)和30TB(149.99美元/月)。\n除了照片，“谷歌文档、表格、幻灯片、图纸、表格和Jamboard文件”也将开始计入存储上限。理由是“让我们的政策更符合行业标准，”谷歌说。(这结束了一些非常聪明的黑客攻击，比如这个通过二进制转换工具将文件转换成Google Docs的黑客攻击。)。\n至于非活跃账户政策，它似乎相当合理：如果你已经两年没有接触你的谷歌账户，并且没有以任何方式回复谷歌发送给你的多封警告电子邮件和通知，谷歌可能会从你的账户中删除数据。以下是谷歌对此的解释：\n如果你在这些服务中有一项或多项两年(24个月)处于非活跃状态，谷歌可能会删除你处于非活跃状态的产品中的内容。[.]。同样，如果你的存储空间超过了两年，谷歌可能会删除你在Gmail、Drive和Photos上的内容。\n在我们尝试删除任何内容之前，我们会多次通知您，以便您有足够的机会采取行动。保持账户活跃的最简单方法是在登录并连接到互联网时，定期访问网络或手机上的Gmail、Drive或Photos。", "note_en": "After  five years of offering unlimited free photo backups at “high quality,” Google Photos will start charging for storage once more than 15 gigs on the account have been used. The change will happen on June 1st, 2021, and it comes with other Google Drive policy changes like counting Google Workspace documents and spreadsheets against the same cap. Google is also introducing a new policy of deleting data from inactive accounts that haven’t been logged in to for at least two years.\n All photos and documents uploaded before June 1st will  not count against that 15GB cap, so you have plenty of time to decide whether to continue using Google Photos or switching to another cloud storage provider for your photos. Only photos uploaded  after June 1st will begin counting against the cap.\n Google already counts “original quality” photo uploads against a storage cap in Google Photos. However, taking away unlimited backup for “high quality” photos and video (which are automatically  compressed for more efficient storage) also takes away one of the service’s biggest selling points. It was the photo service where you just didn’t have to worry about how much storage you had.\n  As a side note, Pixel owners will still be able to upload high-quality (not original) photos for free after June 1st without those images counting against their cap. It’s not as good as the Pixel’s original deal of getting unlimited original quality, but it’s a small bonus for the few people who buy Google’s devices.\n Google points out that it offers more free storage than others — you get 15GB instead of the paltry 5GB that Apple’s iCloud gives you — and it also claims that 80 percent of Google Photos users won’t hit that 15GB cap for at least three years.\n The company will send alerts and warnings when you begin to approach that cap. Google is also putting new storage management tools into Google Photos, including a tool that makes it easier to find and delete photos you might not want anyway, like blurry images or screenshots.\n   Google is also going to show a more useful “personalized estimate” of how much longer a storage tier will last in terms of time instead of gigabytes. It estimates each user’s average uploads over time to guess how much longer they’ll be able to use their current tier.\n Why the change? One possibility is that it’s part of a larger push to get more people to sign up for Google One storage. The service now also includes a free VPN for Android at some of its higher tiers, and it seems as though many Google products are aligning with Google One. Google’s explanation in a brief interview is simpler: there is already a nearly unfathomable number of photos and videos uploaded to Google Photos, and the service needs to be sustainable. That’s the gist if you read between the lines of its blog post:\n Today, more than 4 trillion photos are stored in Google Photos, and every week 28 billion new photos and videos are uploaded. Since so many of you rely on Google Photos to store your memories, it’s important that it’s not just a great product, but also continues to meet your needs over the long haul. In order to welcome even more of your memories and build Google Photos for the future, we are changing our unlimited High quality storage policy.\n   Google One pricing is not changing. It starts at $1.99 / month for 100GB and has tiers going through 200GB ($2.99 / month), 2TB ($9.99 / month), and all the way up to 30TB ($149.99 / month).\n Alongside photos, “Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files” will also begin counting against storage caps. The reasoning is “to bring our policies more in line with industry standards,” Google says. (This puts an end to some very clever hacks like  this one that turned files into Google Docs through a binary conversion tool.)\n As for the inactive account policy, it seems fairly reasonable: if you haven’t touched your Google account for two years and don’t respond in any way to the multiple warning emails and notifications Google sends you, the company may delete data from your account. Here’s how Google explains it:\n If you’re inactive in one or more of these services for two years (24 months), Google may delete the content in the product(s) in which you’re inactive. [...] Similarly, if you’re over your storage limit for two years, Google may delete your content across Gmail, Drive and Photos.\n We will notify you multiple times before we attempt to remove any content so you have ample opportunities to take action. The simplest way to keep your account active is to periodically visit Gmail, Drive or Photos on the web or mobile, while signed in and connected to the internet.", "posttime": "2020-11-12 02:37:21", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,5g,照片,photos", "title": "谷歌将于2021年6月1日停止其无限量照片存储，并设置15 GB的存储容量上限，但在此之前上传的照片和文件将不计入存储容量上限", "title_en": "Google will end its free unlimited Photos storage on June 1, 2021, imposing a 15GB cap, but photos and documents uploaded before then will not count against cap", "transed": 1, "url": "https://www.theverge.com/2020/11/11/21560810/google-photos-unlimited-cap-free-uploads-15gb-ending?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["google", "谷歌", "5g", "照片", "photos"]}, {"category": "", "categoryclass": "", "imagename": "ed4d9f6bb8a5a76b5af188414a92585d.jpg", "infoid": 1034611, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几年前，彭博工程(Bloomberg Engineering)决定采用打字稿作为一种一流的支持语言。这篇文章分享了我们在这段旅程中学到的一些见解和教训。\n标题是，我们发现打字稿是一个很好的净值！在阅读我们探索的一些令人惊讶的角落时，请记住这一点。作为工程师，我们自然会被发现、解决和分享问题所吸引，即使我们在😉上玩得很开心。\n彭博在打字脚本出现之前就已经对JavaScript进行了巨额投资--超过5000万行JS代码。我们的主要产品是彭博终端，它包含1万多个应用程序。应用程序种类繁多，从密集实时金融数据和新闻的显示，到交互式交易解决方案和多种形式的消息传递，应有尽有。早在2005年，该公司就开始将这些应用程序从Fortran和C/C++迁移到服务器端JavaScript，客户端JavaScript大约在2012年问世。今天，我们公司有2000多名软件工程师在编写JavaScript。\n将这种规模的代码库从普通的JavaScript转换到打字脚本是一件大事。因此，我们努力确保有一个深思熟虑的过程，使我们与标准保持一致，并保持我们现有的能力，以便快速安全地发展和部署我们的代码。\n如果你曾经参与过一家大公司的技术迁移，你可能已经习惯了高压的项目管理被用来迫使不情愿的团队取得进展，这些团队宁愿从事新功能的工作。我们发现采用打字稿完全是另一回事。工程师们正在自行启动转换，并支持这一过程！当我们推出我们的TypeScript平台支持的测试版时，仅在第一年就有200多个项目选择了Tyescript。零个项目被退回。\n除了可伸缩性之外，这种TypeScrip集成的独特之处在于我们拥有自己的JavaScript运行时环境。这意味着，除了众所周知的JavaScript主机环境(如浏览器和Node)之外，我们还直接嵌入了V8引擎和Chromium来创建我们自己的JavaScript平台。这种情况的好处是，我们可以提供一种简单的开发体验，在这种体验中，我们的平台和包生态系统直接支持TypeScript。Ryan Dahl的Deno追求类似的理念，将打字脚本编译放入运行时，而我们将其放在独立于运行时版本的工具中。一个有趣的结果是，我们可以探索在跨越客户端和服务器且不使用特定于节点的约定(例如，没有NODE_MODULES目录)的独立JS环境中使用类型脚本编译器是什么感觉。\n我们的平台支持使用通用工具和发布系统的包的内部生态系统。这允许我们鼓励和实施最佳实践，例如默认使用TypeScrip的“严格模式”，以及确保全局不变量。例如，我们保证所有发布的类型都是模块化的，而不是全局的。这也意味着工程师可以专注于编写代码，而不是需要想办法让打字脚本很好地与捆绑器或测试框架配合使用。DevTool和错误堆栈正确使用源地图。测试可以用打字脚本编写，代码覆盖率可以用原始打字代码准确地表达出来。只是起作用了。\n我们的目标是让常规打字文件成为API的唯一真实来源，而不是维护手写声明文件。这意味着我们有很多代码严重依赖于TypeScript编译器从TypeScript源代码自动生成.d.ts声明文件。因此，当声明发出不理想时，我们会注意到这一点，正如您将看到的。\n⚖️可伸缩性：随着越来越多的包采用TypeScrip，应该保持较高的开发速度。安装、编译和检查代码所花费的时间应该最小化。\n📜标准对齐：我们希望坚持使用ECMAScript等标准，并为它们的下一步发展做好准备。\n令我们惊讶的发现通常归结为我们不确定是否能保留这些原则。\n多年来，打字团队一直在积极采用标准ECMAScript语法和运行时语义，并与之保持一致。这使得TypeScript专注于在JavaScript之上提供类型语法和类型检查语义层。职责是明确分开的：类型脚本=JavaScript+类型！\n这是一个很棒的模型。这意味着编译器的输出是人类可读的JavaScript，就像程序员写的那样。这使得调试产品代码变得容易，即使您没有原始源代码。这意味着您不必担心选择TypeScrip可能会切断您与未来ECMAScript功能的联系。它为运行时(甚至未来的JavaScript引擎)敞开了大门，这些引擎可以忽略类型语法，从而在本地“运行”类型脚本。一种更简单的开发体验即将到来！\n在此过程中，TypeScript扩展了一些不太适合这种模式的功能。枚举、命名空间、参数属性和实验性修饰符都具有需要扩展为运行时代码的语义，而这些代码很可能永远不会被JavaScript引擎直接支持。\n这没什么大不了的。Tyescript Design目标阐明了避免在未来引入更多运行时功能的必要性。打字团队的一名成员奥尔塔(Orta)制作了一张迷因幻灯片来强调这种认可。\n我们的工具链通过阻止使用这些不受欢迎的功能来解决这些问题。这确保了我们不断增长的打字代码库是真正的JS+类型。\n打字稿发展很快。该语言的新版本引入了新的类型级功能，增加了对JavaScript功能的支持，提高了性能和稳定性，并改进了类型检查器以发现更多类型错误。所以使用新版本有很大的诱惑力！\n虽然TypeScript努力保持兼容性，但这些类型检查改进代表着构建过程的破坏性更改，因为在以前看起来没有错误的代码库中发现了新的错误。因此，升级打字稿需要一些干预才能获得这些好处。\n还有另一种形式的兼容性需要考虑，那就是项目间的兼容性。随着JavaScript和TypeScript语法的发展，声明文件需要包含新的语法。\n如果库升级了TypeScript并开始生成带有新语法的现代声明文件，则使用该库的应用程序项目将无法编译(如果它们的TypeScript版本不理解该语法)。新声明语法的一个例子是TypeScript3.7中的getter/setter访问器的发出。这些是TypeScript3.5或更早版本无法理解的。这意味着拥有一个使用不同编译器版本的项目生态系统并不理想。\n在彭博社，代码库分布在使用通用工具的各种Git库中。尽管没有Monorepo，但我们有一个集中的打字项目注册表。这使我们能够创建一个持续集成(CI)作业来“构建世界”，并验证每个TypeScript项目上的编译器升级的构建时和运行时效果。\n这种全球检查非常强大。我们使用它来评估TypeScript的Beta和RC版本，以便在正式发布之前发现问题。拥有不同的真实代码语料库意味着我们还可以找到边缘案例。在编译器升级之前，我们使用这个系统来指导对项目的修补，因此升级本身是完美无缺的。到目前为止，这一策略运行良好，我们能够将整个代码库保存在最新版本的Tyescript上。这意味着我们不需要采用诸如降级DTS文件之类的缓解措施。\nTsconfig提供的很大一部分灵活性是允许您根据运行时平台调整类型脚本。在所有项目都以相同的Evergreen运行时为目标的环境中，事实证明，每个项目单独配置它是一件危险的事情。\n因此，我们让我们的工具链负责在构建时使用“理想”设置生成tsconfig。例如，默认情况下会启用严格模式，以提高类型安全性。IsolatedModules&#34；是强制执行的，以确保我们的代码可以通过一次操作一个文件的简单代码转换程序快速编译。\n将tsconfig视为生成的文件而不是源文件的另一个好处是，它允许高级工具通过负责定义选项(如引用和路径)，灵活地将多个项目的“工作区”链接在一起。\n这里存在一些矛盾，因为少数项目希望能够进行定制，比如切换到更宽松的模式以减轻迁移负担。\n最初，我们试图迎合这些要求，并提供了少量选择。后来我们发现，当使用一组选项构建的声明文件被使用不同选项的包使用时，这会导致包间冲突。这里有一个例子。\n可以创建由&#34；strictNullChecks&#34；的值指示的条件类型。\n如果启用了严格NullChecks，则A是一个数字。如果禁用了&#34；strictNullChecks，则A是一个字符串。*如果导出此类型的包使用的是与导入它的包不同的严格设置，则此代码将中断。\n这是我们面临的现实问题的一个简化例子。因此，我们选择不支持严格模式的灵活性，而是支持为所有项目提供一致的配置。\n我们需要能够显式声明我们对TypeScript的依赖关系的位置。这是因为我们的ES模块系统不依赖于Node文件系统约定，即通过遍历一系列名为NODE_MODULES的目录来查找依赖项。\n我们需要能够声明将裸说明符(例如，lodash)映射到磁盘上的目录位置(&#34；c：\\Dependency\\lowash&#34；)。这类似于导入地图试图为Web解决的问题。起初，我们尝试使用tsconfig中的路径选项。\n这对几乎所有用例都很有效。然而，我们发现这降低了生成的声明文件的质量。类型脚本编译器必须将合成的导入语句注入声明文件中，以支持复合类型-其中类型可以依赖于来自其他模块的类型。当合成导入引用依赖项中的类型时，我们发现路径方法注入了相对路径(导入(&#34；../../Dependations/lodash&#34；)，而不是保留裸说明符(import&#34；lodash&#34；)。对于我们的系统来说，外部包类型的相对位置是一个可能会改变的实现细节，所以这是不可接受的。\n//环境-模块.d.ts\r声明模块&#34；loash&#34；{\r从&#34；../../Dependations/Lotash&#34；；导出*\r从&#34；../../Dependents/lowash&#34；；中导出默认值\r}。\n环境模块是特殊的。TypeScript的声明-emit保留对它们的引用，而不是将它们转换为相对路径。\n应用程序的性能非常关键，因此我们尝试将应用程序在运行时加载的JS数量降至最低。我们的平台确保在运行时只使用包的一个版本。版本的这种去重复意味着给定的包不能“冻结”或“固定”它们的依赖关系。因此，这意味着包必须随时间保持兼容性。\n我们希望为类型提供相同的“只有一个”的保证，以确保对于给定的项目编译，类型检查将只考虑包的依赖项的一个版本。除了编译时的效率，其动机是确保类型检查世界更好地反映运行时世界。我们特别希望避免陈旧问题和“名义地狱”，即通过“钻石模式”导入两个不兼容的名义类型版本。这是一种危险，随着生态系统对名义类型的采用增加，这种危险可能会增加。\n我们编写了一个确定性解析器，该解析器根据正在构建的包的声明版本约束，选择每个依赖项的一个版本作为输入依据。\n这意味着类型依赖关系图是动态组装的-它不是冻结的。虽然这种未固定的依赖项方法提供了好处并避免了一些危险，但我们后来了解到，由于类型脚本编译器中的微妙行为，它可能会引入不同的危险。参见9.生成的声明可以内联依赖项中的类型，以了解更多信息。\n这些权衡和选择并不是我们的平台所特有的。它们同样适用于发布到DefinitelyTyped/npm的任何人，并由Package.json&#34；依赖项中表示的每个包的版本约束的聚合效果决定。\n在Tyescript中引入全局类型很容易。依赖全局类型甚至更容易。如果不选中，这意味着可能会在远程包之间发生隐藏耦合。《打字手册》(Tyescript Handbook)称这种做法“有些危险”。\n//注入全局类型的声明\r声明全局{\r接口字符串{\rFancyFormat(opts？：StringFormatOptions)：字符串；\r}\r}\r\r//在一个很远很远的文件里的某个地方...\rString.fancyFormat()；//没有错误！\n这个问题的解决方案是众所周知的：比起全局状态，更喜欢显式依赖关系。长期以来，TypeScript一直支持ECMAScript IMPORT和EXPORT语句，从而实现了这一目标。\n因此，剩下的唯一需要是防止意外创建全局类型。值得庆幸的是，可以静态地检测TypeScrip允许引入全局类型的每一种情况。因此，我们能够更新我们的工具链，以便在使用这些工具的情况下检测并出错。这意味着我们可以放心地相信，导入包的类型是一种无副作用的操作。\n并不是所有的声明文件都是平等的。声明文件以三种模式之一运行，具体取决于内容，特别是导入和导出关键字的使用。\n全局-未使用导入或导出的声明文件将被视为全局文件。顶级声明将被全局导出。\n模块-至少包含一个导出声明的声明文件将被视为模块。只导出导出声明，没有定义全局变量。\n隐式导出-没有导出声明但使用导入的声明文件将触发已定义但未记录的行为。这意味着顶级声明被视为命名的导出声明，并且没有定义全局变量。\n我们不使用第一种模式。我们的工具链阻止全局声明文件(参见上一节：6.应避免隐式类型依赖)。这意味着所有声明文件都使用ES模块语法。\n或许令人惊讶的是，我们发现略显诡异的第三模式很有用。只需在环境声明文件的顶部添加一行自导入，就可以防止它们污染全局命名空间：Import{}from&#34；./&lt；my-own-name&gt；&#34；；。这个一行代码使得将第三方声明(如lib.dom.d.ts)转换为模块化变得简单，并避免了维护更复杂的分支的需要。\n打字团队似乎不喜欢第三种模式，因此请考虑在可能的情况下避免使用第三种模式。\n正如前面所解释的(在5.消除重复类型可能很重要)，我们使用非固定依赖关系意味着我们的包不仅要保持运行时兼容性，而且要随着时间的推移保持类型兼容性，这一点很重要。这是一个挑战，所以要使兼容性的保持变得实用，我们必须真正了解哪些类型是公开的，并且必须以这种方式进行约束。第一步是明确区分公共模块和私有模块。\nNode最近以Package.json；Exports字段的形式获得了这一功能。这通过显式列出可从包外部访问的文件来定义封装边界。\n现在，TypeScript不知道包导出，因此不知道依赖项中的哪些文件被认为是公共的。在声明生成期间，当TypeScript将导入语句合成为发出的.d.ts文件中的可传递类型时，这会成为一个问题。我们的.d.ts文件引用其他包中的私有文件是不可接受的。这里有一个出错的例子。\n这很糟糕，因为&#34；Another-Package/Private&#34；不是该程序包兼容性承诺的一部分，因此可能会被移动或重命名，而不会出现SemVer大故障。今天的打字稿无法知道它生成了一个脆弱的导入。\n1.我们的工具链将指向依赖项的有意公开的裸说明符路径通知给文本解析器(例如，&#34；loash/Public 1&34；，&#34；loash/Public 2&34；)。我们通过在类型脚本文件流入编译器之前将仅类型的导入语句静默地添加到类型脚本文件的底部来确保类型脚本知道全部合法的依赖项入口点。\n//用户源代码\r\r//工具链注入辅助声明发出\r从&#34；lowash/Public 1&#34；导入类型*AS__FAKE_NAME_1；\r从&#34；loash/Public 2&#34；导入类型*AS__FAKE_NAME_2；\n在生成对推断的可传递类型的引用时，Tyescript的声明发出将更喜欢使用这些现有的名称空间标识符，而不是将导入合成到私有文件。\n2.如果TypeScript在我们知道是私有的依赖项中生成文件的路径，我们的工具链就会产生错误。这类似于当TypeScript意识到它正在生成通往依赖项的潜在危险路径时发出的现有打字错误。\n错误TS2742：在没有引用&#39；...&#39；的情况下，无法命名推断的&#39；...&#39；类型。\r这可能不是便携的。类型批注是必需的。\n这会通知用户通过显式注释其导出来解决此问题。或者，在某些情况下，它们需要更新依赖项以通过直接从公共包入口点导出来公开内部类型。\n我们期待着Tyescript获得入口点的一流支持，这样就不需要像这样的变通方法了。\n包需要导出.d.ts声明，以便用户可以使用它们。我们选择使用类型脚本声明选项从原始的.ts文件生成.d.ts文件。虽然手写和维护.d.ts同级文件和常规代码是可能的，但这样做不太可取，因为保持它们同步是一种危险。\nTypeScrip的声明在大多数情况下都工作得很好。我们发现的一个问题是，有时TypeScript会将依赖项中的类型内联到生成的类型中(#37151)。这意味着类型定义被重新定位并可能重复，而不是通过IMPORT语句引用。使用结构化类型，编译器不必确保类型是从一个定义站点引用的-复制这些类型是可以的。\n我们已经看到了极端的情况，这种重复使声明文件从7KB膨胀到700KB。这是相当多的冗余代码，需要下载和解析。\n包中类型的内联不是生态系统问题，因为它在外部不可见。当类型跨包边界内联时就会出现问题，因为它会将这两个特定版本耦合在一起。在我们的非固定包裹系统中，包裹可以。\n.", "note_en": "A few years ago, Bloomberg Engineering decided to adopt  TypeScript as a first-class supported language. This article shares some of the insights and lessons we learned during this journey.\n The headline is that we found TypeScript to be a strong net positive! Please keep that in mind when reading about some of the surprising corners we explored. As engineers, we are naturally attracted to seeing, solving and sharing problems, even when we’re having a good time 😉\n    Bloomberg already had a colossal investment in JavaScript before TypeScript even existed – more than 50 million lines of JS code. Our main product is the Bloomberg Terminal, which contains more than 10,000 apps. The variety of apps is huge, ranging from the display of intensive real-time financial data and news to interactive trading solutions and many forms of messaging. Back in 2005, the company started migrating those apps from Fortran and C/C++ to server-side JavaScript, with client-side JavaScript arriving around 2012. Today, we have more than 2,000 software engineers at the company writing JavaScript.\n    Transitioning this scale of codebase from plain JavaScript to TypeScript is a big deal. So we worked hard to ensure there was a thoughtful process that would keep us aligned with standards and preserve our existing capabilities to evolve and deploy our code quickly and safely.\n If you’ve ever been part of a technology migration in a large company, you may be used to heavy-handed project management being used to force progress from reluctant teams who would rather be working on new features. We found that adopting TypeScript was something altogether different. Engineers were self-starting conversions and championing the process! When we launched the beta version of our TypeScript platform support, more than 200 projects opted into TypeScript in the first year alone. Zero projects went back.\n  In addition to scale, something that makes this integration of TypeScript unique is that we have our own JavaScript runtime environment. This means that, in addition to well-known JavaScript host environments, such as browsers and Node, we also embed the V8 engine and Chromium directly to create our own JavaScript platform. The upside of this situation is that we can offer a simple developer experience in which TypeScript is supported directly by our platform and package ecosystem. Ryan Dahl’s Deno pursues similar ideas by putting TypeScript compilation into the runtime, whereas we keep it in tooling that is versioned independently of the runtime. An interesting consequence is that we get to explore what it’s like to exercise the TypeScript compiler in a standalone JS environment that spans both client and server and that does not use Node-specific conventions (e.g., there is no  node_modules directory).\n Our platform supports an internal ecosystem of packages that uses a common tooling and publishing system. This allows us to encourage and enforce best practices, such as defaulting to TypeScript’s “strict mode,” as well as ensuring global invariants. For example, we guarantee that all published types are modular rather than global. It also means that engineers can focus on writing code rather than needing to figure out how to make TypeScript play nicely with a bundler or test framework. DevTools and error stacks use sourcemaps correctly. Tests can be written in TypeScript and code coverage is accurately expressed in terms of the original TypeScript code. It just works.\n We aim for regular TypeScript files to be the single source of truth for our APIs, as opposed to maintaining handwritten declaration files. This means we have a lot of code leaning heavily on the TypeScript compiler’s automatic generation of  .d.ts declaration files from TypeScript source code. So when declaration-emit is not ideal, we notice it, as you will see.\n  ⚖️  Scalability: Development speed should be kept high as more packages adopt TypeScript. Time spent installing, compiling, and checking code should be minimized.\n  📜  Standards Alignment: We want to stick with standards, such as ECMAScript, and be ready for where they might go next.\n The discoveries that surprised us usually came down to cases where we weren’t sure if we could preserve these principles.\n  Over the years, the TypeScript team has actively pursued the adoption of and alignment with standard ECMAScript syntax and runtime semantics. This leaves TypeScript to concentrate on providing a layer of type syntax and type-checking semantics on top of JavaScript. The responsibilities are clearly separated:  TypeScript = JavaScript + Types!\n This is a wonderful model. It means that the compiler output is human-readable JavaScript, just like the programmer wrote. This makes debugging production code easy even if you don’t have the original source code. It means you do not need to worry that choosing TypeScript might cut you off from future  ECMAScript features. It leaves the door open to runtimes, and maybe even future JavaScript engines, that can ignore the type syntax and therefore “run” TypeScript natively. A simpler developer experience is in sight!\n Along the way, TypeScript was extended with a small number of features that don’t quite fit this model.  enum,  namespace,  parameter properties, and  experimental decorators all have semantics that require them to be expanded into runtime code that, in all likelihood, will never be directly supported by JavaScript engines.\n  This is not a big deal. The  TypeScript Design Goals articulate the need to avoid introducing more runtime features in the future. One member of the TypeScript team,  Orta, created a meme-slide to emphasize this recognition.\n    Our toolchain addresses this set of undesirable features by preventing their use. This ensures that our growing TypeScript codebase is truly JS + Types.\n   TypeScript evolves  rapidly. New versions of the language introduce new type-level features, add support for JavaScript features, improve performance and stability, as well as improve the type-checker to find more type errors. So there’s a lot of enticement to use new versions!\n Whilst TypeScript strives to preserve compatibility, these type-checking improvements represent breaking changes to the build process as new errors are identified in codebases that previously appeared error-free. Upgrading TypeScript therefore requires some intervention to get these benefits.\n There is another form of compatibility to consider, which is inter-project compatibility. As both JavaScript and TypeScript syntaxes evolve, declaration files need to contain new syntax.\n If a library upgrades TypeScript and starts producing modern declaration files with new syntax, application projects using that library will fail to compile if their version of TypeScript does not understand that syntax. An example of new declaration syntax is  the emit of getter/setter accessors in TypeScript 3.7. These are not understood by TypeScript 3.5 or earlier. This means that having an ecosystem of projects using different compiler versions is not ideal.\n  At Bloomberg, codebases are spread across various Git repositories that use common tooling. Despite not having a monorepo, we do have a centralized registry of TypeScript projects. This allowed us to create a Continuous Integration (CI) job to “build the world” and verify the build-time and run-time effects of compiler upgrades on every TypeScript project.\n This global checking is very powerful. We use this to assess Beta and RC releases of TypeScript to discover issues ahead of general release. Having a diverse corpus of real-world code means we also find edge cases. We use this system to guide fix-ups to projects ahead of the compiler upgrade, so that the upgrade itself is flawless. So far, this strategy has worked well and we have been able to keep the entire codebase on the latest version of TypeScript. This means we have not needed to employ mitigations such as  downlevelling DTS files.\n   Much of the flexibility provided by  tsconfig is to allow you to adapt TypeScript to your runtime platform. In an environment where all projects are targeting the same evergreen runtime, it turns out to be a hazard for each project to configure this separately.\n  Therefore we made our toolchain responsible for generating  tsconfig at build time with “ideal” settings. For example,   &#34;strict&#34; mode is enabled by default to increase type-safety.   &#34;isolatedModules&#34; is enforced to ensure our code can be compiled quickly by simple transpilers that operate on a single file at a time.\n A further benefit of treating  tsconfig as a generated file, rather than as a source file, is that it permits higher-level tooling to flexibly link together multi-project “workspaces” by taking responsibility for defining options such as   &#34;references&#34; and   &#34;paths&#34;.\n There is some tension here, as a minority of projects wanted the ability to make customizations such as switching to looser modes to reduce the migration burden.\n Initially we tried to cater to these requests and gave access to a small number of options. Later we found that this resulted in inter-package conflicts, when declaration files built using one set of options were consumed by a package using different options. Here’s one example.\n It’s possible to create a conditional type that is directed by the value of   &#34;strictNullChecks&#34;.\n    If  &#34;strictNullChecks&#34; are enabled, then A is a  number. If  &#34;strictNullChecks&#34; are disabled, then A is a  string. This code breaks if the package exporting this type is not using the same strictness settings as the package importing it.\n This is a simplified example of a real-life issue we faced. As a result, we chose to deprecate the flexibility on strictness modes in favour of having consistent configs for all projects.\n   We needed the ability to explicitly declare the location of our dependencies to TypeScript. This is because our ES module system does not rely on the Node file-system convention of finding dependencies by walking up a series of directories named  node_modules.\n We needed the ability to declare a mapping of bare-specifiers (e.g.,  &#34;lodash&#34;) to directory locations on disk ( &#34;c:\\dependencies\\lodash&#34;). This is similar to the problem that  import maps attempt to solve for the Web. At first, we tried using the   &#34;paths&#34; option in  tsconfig.\n    This worked great for nearly all use cases. However, we discovered this degraded the quality of generated declaration files. The TypeScript compiler necessarily injects synthetic import statements into declaration files to allow for composite types – where types can depend on types from other modules. When the synthetic imports reference types in dependencies, we found the  &#34;paths&#34; approach injected a relative path ( import(&#34;../../dependencies/lodash&#34;)) rather than preserving the bare-specifier ( import &#34;lodash&#34;). For our system, the relative location of external package typings is an implementation detail that may change, so this was unacceptable.\n  // ambient-modules.d.ts\r declare  module  &#34;lodash&#34;  {\r  export  *  from  &#34;../../dependencies/lodash&#34; ;\r  export  default  from  &#34;../../dependencies/lodash&#34; ;\r }\n  Ambient Modules are special. TypeScript’s declaration-emit preserves references to them rather than converting them to a relative path.\n   App performance is critical, so we try to minimize the volume of JS that apps load at runtime. Our platform ensures that only one version of a package is used at runtime. This de-duplication of versions means that a given package cannot “freeze” or “pin” their dependencies. Consequently, this means packages must preserve compatibility over time.\n We wanted to provide the same “exactly-one” guarantee for types to ensure that, for a given compilation of a project, the type-check would only ever consider one single version of a package’s dependencies. In addition to compile-time efficiency, the motivation was to ensure the type-checked world better reflects the runtime world. We specifically wanted to avoid staleness issues and “nominality hell,” in which two incompatible versions of nominal types are imported via a “diamond pattern”. This is a hazard that will likely grow as ecosystem adoption of nominal types increases.\n   We wrote a deterministic resolver that selects exactly one version of each dependency to type against based on the declared version constraints of the package being built.\n   This means the graph of type dependencies is dynamically assembled – it is not frozen. Whilst this unpinned dependency approach provides benefits and avoids some hazards, we later learned that it can introduce a different hazard due to subtle behavior in the TypeScript compiler. See   9.  Generated declarations can inline types from dependencies to learn more.\n These trade-offs and choices are not specific to our platform. They apply equally to anyone publishing to DefinitelyTyped/npm, and are determined by the aggregate effect of each package’s version constraints expressed in package.json  &#34;dependencies&#34;.\n   It’s easy to introduce global types in TypeScript. It’s even easier to depend on global types. If left unchecked, this means it is possible for hidden coupling to occur between distant packages. The TypeScript Handbook calls this out as being  “somewhat dangerous.”\n  // A declaration that injects global types\r declare  global {\r  interface  String {\r  fancyFormat(opts?: StringFormatOptions): string;\r  }\r }\r\r // Somewhere in a file far, far away...\r String.fancyFormat();  // no error!\n  The solution to this is well-known: prefer explicit dependencies over global state. TypeScript has provided support for ECMAScript  import and  export statements for a long time, which achieve this goal.\n So the only remaining need was to prevent accidental creation of global types. Thankfully, it is possible to statically detect each of the cases where TypeScript permits the introduction of global types. So, we were able to update our toolchain to detect and error in the cases where these are used. This means we can safely rely on the fact that importing a package’s types is a side-effect-free operation.\n   Not all declaration files are equal. A declaration file operates in  one of three modes, depending on the content; specifically the usage of  import and  export keywords.\n global — A declaration file with no usage of  import or  export will be considered to be  global. Top-level declarations are globally exported.\n module — A declaration file with at least one  export declaration will be considered to be a module. Only the  export declarations are exported and no globals are defined.\n implicit exports — A declaration file that has no  export declarations, but does use  import will trigger defined-yet-undocumented behaviour. This means that top-level declarations are treated as named  export declarations and no globals are defined.\n We do not use the first mode. Our toolchain prevents global declaration files (see previous section:   6.  Implicit Type Dependencies should be avoided). This means all declaration files use ES module syntax.\n    Perhaps surprisingly, we found the slightly-spooky third-mode to be useful. By adding just a single-line self-import to the top of ambient declaration files, you can prevent them from polluting the global namespace:  import {} from &#34;./&lt;my-own-name&gt;&#34;;. This one-liner made it trivial to convert third-party declarations, such as  lib.dom.d.ts, to be modular and avoided the need to maintain a more complex fork.\n The TypeScript team  do not seem to love the third-mode, so consider avoiding it where possible.\n   As explained earlier (in   5. De-duplicating types can be important), our use of unpinned dependencies means it is important for our packages to preserve not only runtime-compatibility, but also type-compatibility over time. That’s a challenge, so to make this preservation of compatibility practical, we have to really understand which types are exposed and must be constrained in this way. A first step is to explicitly differentiate public vs. private modules.\n Node recently gained this capability in the form of  the package.json  &#34;exports&#34; field. This defines an encapsulation boundary by explicitly listing the files that are accessible from outside the package.\n Today, TypeScript is not aware of  package exports and so does not have the concept of which files within a dependency are considered public or not. This becomes a problem during declaration generation, when TypeScript synthesizes import statements to transitive types in the emitted  .d.ts file. It is not acceptable for our  .d.ts files to reference private files in other packages. Here’s an example of it going wrong.\n        This is bad because  &#34;another-package/private&#34; is not part of that package’s compatibility promise, so might be moved or renamed without a SemVer major bump. TypeScript today has no way of knowing it generated a fragile import.\n   1. Our toolchain informs the TypeScript resolver of the intentionally-public bare-specifier paths that point to dependencies (e.g.,  &#34;lodash/public1&#34;,  &#34;lodash/public2&#34;). We ensure TypeScript knows about the full set of legitimate dependency entry-points by silently adding type-only import statements to the bottom of the TypeScript files just before they flow into the compiler.\n  // user&#39;s source code\r\r // injected by toolchain to assist declaration emit\r import  type  *  as  __fake_name_1  from  &#34;lodash/public1&#34; ;\r import  type  *  as  __fake_name_2  from  &#34;lodash/public2&#34; ;\n  When generating references to inferred transitive types, TypeScript’s declaration emit will prefer to use these existing namespace identifiers rather than synthesizing imports to private files.\n 2. Our toolchain generates errors if TypeScript generates a path to a file in a dependency that we know is private. This is analogous to the existing TypeScript errors emitted when TypeScript realizes that it is generating a potentially hazardous path to a dependency.\n  error TS2742 : The inferred type of  &#39; ... &#39; cannot be named without a reference to  &#39; ... &#39; .\rThis is likely not portable . A type annotation is necessary .\n  This informs the user to work around the issue, by explicitly annotating their exports. Or, in some cases, they need to update the dependency to publicise internal types by directly exporting them from a public package entrypoint.\n  We look forward to TypeScript gaining first-class support for entrypoints so that workarounds like this are unnecessary.\n   Packages need to export  .d.ts declarations so that users can consume them. We choose to use the TypeScript  declaration option to generate  .d.ts files from the original  .ts files. Whilst it’s possible to hand-write and maintain  .d.ts sibling files alongside regular code, this is less preferable because it is a hazard to keep them synchronized.\n TypeScript’s declaration emit works well most of the time. One issue we found was that  sometimes TypeScript will inline types from a dependency into the generated types (#37151). This means the type definition is relocated and potentially duplicated, rather than being referenced via an import statement. With structural typing, the compiler is not compelled to ensure types are referenced from one definition site – duplication of these types can be ok.\n We have seen  extreme cases where this duplication has inflated declaration files from 7KB to 700KB. That’s quite a lot of redundant code to download and parse.\n  Inlining of types within a package is not an ecosystem problem, because it is not externally visible. It becomes problematic when types are inlined across package boundaries, because it couples those two specific versions together. In our unpinned package system, packages can evol\n......", "posttime": "2020-11-12 02:32:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "采用,adopting,类型", "title": "大规模采用打字稿的感悟", "title_en": "Insights from Adopting TypeScript at Scale", "transed": 1, "url": "https://www.techatbloomberg.com/blog/10-insights-adopting-typescript-at-scale/", "via": "", "real_tags": ["采用", "adopting", "类型"]}, {"category": "", "categoryclass": "", "imagename": "6193f5b8cf611f9687b8533a2130ce57.jpg", "infoid": 1034610, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每天，数十名志同道合的数学家聚集在一个名为Zulip的在线论坛上，建立他们认为是他们所在领域未来的东西。\n他们都是名为精益(Lean)的软件程序的忠实拥护者。这是一个“证明助手”，原则上可以帮助数学家写证明。但在精益能够做到这一点之前，数学家们自己必须手动将数学输入到程序中，将数千年积累的知识转化为精益能够理解的形式。\n伦敦帝国理工学院(Imperial College London)的凯文·巴扎德(Kevin Buzzard)说：“很明显，当你把东西数字化时，你可以用新的方式来使用它。”“我们将把数学数字化，这会让它变得更好。”\n数学数字化是一个长期的梦想。预期的好处从平凡的计算机给学生的作业评分，到超凡的：使用人工智能发现新的数学，找到旧问题的新解决方案。数学家预计，证据助手还可以审查期刊提交的文件，发现人类审查员偶尔遗漏的错误，并处理填写证据所有细节所需的繁琐技术工作。\n但首先，聚集在Zulip上的数学家必须向Lean提供相当于本科数学知识的图书馆，而他们只完成了一半。Lean不会在短期内解决悬而未决的问题，但从事这项工作的人几乎可以肯定，几年后，该程序至少能够理解四年级期末考试中的问题。\n在那之后，谁知道呢？参与这些努力的数学家们并没有完全预料到数字数学会有什么用处。\n雷恩大学(University Of Rennes)的塞巴斯蒂安·古泽尔(Sébastien Gouëzel)说：“我们真的不知道我们的目标是什么。”\n整个夏天，一群经验丰富的精益用户举办了一个名为“好奇的数学家的精益”的在线研讨会。在第一节课中，悉尼大学的斯科特·莫里森演示了如何在程序中编写证明。\n他首先输入了他想要用Lean理解的语法来证明的陈述。简单地说，它的意思是“有无穷多个质数。”有几种方法可以证明这一说法，但莫里森想要使用对已发现的第一个方法的轻微修改，即公元前300年欧几里得的证明，它涉及将所有已知素数相乘，然后加1来找到新的素数(要么乘积本身，要么是它的一个因子是素数)。莫里森的选择反映了使用精益的一些基本原理：用户必须自己想出证明的大点子。\n莫里森在后来的一次采访中说：“你要为第一个建议负责。”\n在输入陈述和选择策略后，莫里森花了几分钟时间阐述了证据的结构：他定义了一系列中间步骤，每个步骤都相对简单，单靠自己就能证明。虽然精益不能提出证明的整体策略，但它通常可以帮助执行更小、更具体的步骤。莫里森把证据分成几个可管理的子任务，这有点像大厨指导线条厨师切洋葱、炖炖肉。莫里森说：“在这一点上，你希望精益能接手并开始提供帮助。”\n精益通过使用被称为“战术”的自动化流程来执行这些中间任务。可以把它们看作是为执行非常具体的工作而量身定做的短小算法。\n在研究他的证明时，莫里森使用了一种名为“图书馆搜索”的策略。它搜索了Lean的数学结果数据库，并返回了一些它认为可以填充证明特定部分细节的定理。其他策略执行不同的数学杂务。一种叫做“线性”的方法，可以利用两个实数之间的一组不等式，为你确认一个涉及第三个数的新的不等式是正确的：如果a是2，b大于a，那么3a+4b大于12。另一种方法完成了应用基本代数规则(如结合性)的大部分工作。\n伦敦帝国学院(Imperial College London)数学专业本科生阿米莉亚·利文斯顿(Amelia Livingston)正从Buzzard那里学习精益课程，她说：“两年前，你必须自己在精益课程中[应用联想属性]。”“然后(有人)写了一个战术，可以为你做所有的事情。每次我使用它，我都会非常开心。“。\n莫里森总共花了20分钟才完成欧几里德的证明。在一些地方，他自己填写细节；在另一些地方，他使用策略为他做这件事。在每一步，Lean都会检查以确保他的工作与程序的基本逻辑规则一致，这些规则是用一种名为依赖类型理论的形式语言编写的。\n“这就像一款数独应用。如果你做出一个无效的举动，它就会引起轰动。“Buzzard说。最后，利恩证明莫里森的证明是有效的。\n当技术介入做一些你过去自己做的事情时，这种练习总是令人兴奋的。但欧几里德的证据已经存在了2000多年。当今数学家关心的问题是如此复杂，以至于利恩甚至还不能理解这些问题，更不用说支持回答它们的过程了。\n另一位Lean用户、福特汉姆大学(Fordham University)的希瑟·麦克白(Heather Macbeth)说：“这可能需要几十年的时间才能成为研究工具。”\n因此，在数学家能够与Lean合作解决他们真正关心的问题之前，他们必须在程序中配备更多的数学知识。这实际上是一项相对简单的任务。\n莫里森说：“精益能够理解一些东西，很大程度上就是人类把数学教科书翻译成精益能够理解的形式。”\n不幸的是，直截了当并不意味着容易，特别是考虑到对于许多数学来说，教科书并不真正存在。\n如果你没有学过高等数学，这门课可能看起来很精确，而且有很好的文档：代数I通向代数II，预微积分通向微积分，所有这些都在教科书中列出，答案在后面。\n但高中和大学数学--甚至很多研究生数学--在整个知识中只占极小的一部分。其中绝大多数都没有那么有条理。\n数学中有许多巨大而重要的领域从未被完整地记录下来。它们储存在一小群人的脑海中，他们从从发明者那里学到数学的人那里学到了他们的子领域--也就是说，它几乎和民间传说一样存在。\n还有其他领域已经写下了基础材料，但它是如此冗长和复杂，以至于没有人能够检查它是否完全正确。取而代之的是，数学家们只是有信心。\n他说：“我们依赖作者的声誉。巴黎萨克雷大学的帕特里克·马索特说：“我们知道他是个天才，也是个细心的人，所以这一定是正确的。”\n这就是为什么取证助手如此有吸引力的原因之一。将数学翻译成计算机能够理解的语言，迫使数学家最终将他们的知识归类，并精确地定义对象。\n法国国家研究机构Inria的阿西娅·马赫布比(Assia Mahboubi)回忆说，她第一次意识到这样一个有序的数字图书馆的潜力时说：“从理论上讲，人们可以通过纯粹的逻辑语言捕捉整个数学文献，并将数学语料库存储在计算机中，然后使用这些软件进行检查和浏览，这对我来说是一件令人着迷的事情。”\nLean并不是第一个拥有这种潜力的项目。第一个叫Automath，在20世纪60年代问世，Coq，当今使用最广泛的证据助手之一，在1989年问世。CoQ用户已经用它的语言形式化了很多数学，但这项工作一直是分散的和无组织的。数学家从事他们感兴趣的项目，只定义执行项目所需的数学对象，通常以独特的方式描述这些对象。结果，Coq图书馆给人的感觉是杂乱无章，就像一座无规划的城市。\n“CoQ现在已经是个老头了，它有很多伤痕，”马赫布比说，他曾广泛参与过这个项目。“随着时间的推移，它得到了许多人的共同维护，而且由于其悠久的历史，它也存在着众所周知的缺陷。”\n2013年，一位名叫莱昂纳多·德莫拉(Leonardo De Moura)的微软研究员推出了Lean。这个名字反映了德莫拉希望创造一个高效、整洁设计的程序的愿望。他打算让这个程序成为检查软件代码准确性的工具，而不是数学。但事实证明，检查软件的正确性很像验证证据。\nDe Moura说：“我们创建精益是因为我们关心软件开发，而构建数学和构建软件之间存在着类比。”\n当Lean问世时，有很多其他的证明助手可用，包括Coq，它与Lean最相似--这两个程序的逻辑基础都基于依赖类型理论。但精益代表着一个重新开始的机会。\n数学家们很快就被它吸引住了。他们是这个项目的狂热拥护者，以至于他们开始把德·莫拉的时间花在专门针对数学的发展题上。“他对不得不管理数学家感到有点厌烦，于是说，‘你们做一个单独的储存库怎么样？’”莫里森说。\n数学家在2017年创建了这个图书馆。他们称它为Mathlib，并急切地开始用世界上的数学知识填满它，使它成为一种21世纪的亚历山大图书馆。数学家们创造并上传了数字化的数学作品，逐渐为利恩建立了一个可供参考的目录。因为Mathlib是新的，他们可以从Coq这样的旧系统的局限性中学习，并额外注意他们是如何组织材料的。\n麦克白说：“我们正在努力打造一个完整的数学库，其中所有的部分都能与所有其他部分协同工作。”\nMathlib的首页有一个实时仪表盘，显示了项目的进度。它有一个由顶级贡献者组成的排行榜，按照他们创建的代码行数进行排名。还有一份已经数字化的数学总量的最新统计：截至10月初，Mathlib包含了18416个定义和38315个定理。\n这些都是数学家可以在精益课程中混合在一起组成数学的要素。目前，尽管有这些数字，但它只是一个有限的储藏室。它几乎不包含复杂分析或微分方程--许多高等数学领域的两个基本元素--的内容，它甚至不足以说明任何千年奖的问题，这是克莱数学研究所列出的最重要的数学问题。\n但Mathlib正在慢慢充实起来。这项工作有一种谷仓抬高的感觉。在Zulip上，数学家识别需要创建的定义，自愿编写这些定义，并迅速提供对彼此工作的反馈。\n麦克白说：“任何一位研究数学家都可以查看数学库，发现它遗漏了40件事。”“所以你决定填补其中一个漏洞。这真的是立竿见影的满足感。其他人会在24小时内阅读并发表评论。\n今年夏天，里昂学院诺曼尔学院的索菲·莫雷尔在“好奇的数学家的学习”研讨会上发现，许多新增加的项目都是小规模的。(译者注：来自里昂诺曼尔学院的索菲·莫雷尔)在今年夏天举办的“好奇的数学家的学习”研讨会上发现了这一点。会议组织者给了与会者相对简单的数学陈述，让他们在精益实践中加以证明。在研究其中一个的过程中，莫雷尔意识到她的证明需要一个引理--一种简短的踏脚石结果--这是数学库所没有的。\n“这是关于线性代数的一件非常小的事情，但不知何故，它还没有出现。”编写数学库的人试图做到透彻，但你永远不可能想得一清二楚。“莫雷尔说，她自己编写了这三行引理。\n其他贡献更为重要。在过去的一年里，Gouëzel一直在为Mathlib定义“光滑流形”。光滑流形是空间--如直线、圆和球的表面--在几何学和拓扑学的研究中起着基础性的作用。它们也经常出现在数论和分析等领域的重大成果中。在没有定义数学研究的情况下，你不能指望做大多数形式的数学研究。\n但流畅的流形有不同的伪装，这取决于背景。它们可以是有限维的，也可以是无限维的，既可以有“边界”，也可以没有边界，并且可以在各种数系上定义，例如实数、复数或p-进制数。定义光滑的流形几乎就像试图定义爱：当你看到它的时候你就知道了，但任何严格的定义都可能排除这种现象的一些明显的例子。\n“对于一个基本的定义，你没有任何选择(如何定义它)，”古泽尔说。但对于更复杂的物体，可能有10到20种不同的方法来形式化它。\n古泽尔不得不在特殊性和概括性之间保持平衡。他说：“我的规则是，我知道15种我想要陈述的流形应用。”“但我不希望定义过于笼统，因为那样你就不能使用它了。”\n他提出的定义填满了1600行代码，这使得数学库的定义相当长，但与它在Lean中释放的数学可能性相比可能微不足道。\n“既然我们有了语言，我们就可以开始证明定理了，”他说。\n在正确的概括性水平上为一个对象找到正确的定义，是构建数学库的数学家们的一个主要关注点。它的创建者希望以一种现在有用但又足够灵活的方式来定义对象，以适应数学家可能对这些对象进行的意想不到的使用。\n麦克白说：“我们强调的是，所有的东西在未来都是有用的。”\n但精益不仅仅是有用的--它为数学家提供了以一种新的方式投入工作的机会。麦克白还记得她第一次尝试打样助手的情景。那是2019年，项目是Coq(尽管她现在使用精益)。她爱不释手。\n“在一个疯狂的周末，我每天花12个小时在上面，”她说。“这完全让人上瘾。”\n其他数学家也以同样的方式谈论这一经历。他们说，在精益公司工作感觉就像在玩电子游戏--完全是那种基于奖励的神经化学冲动，让人很难放下遥控器。利文斯顿说：“你可以一天玩14个小时，一整天都不会感到疲倦和兴奋。”“你不断地得到积极的强化。”\n尽管如此，精益社区认识到，对于许多数学家来说，没有足够的水平可供发挥。\n谷歌(Google)工程师克里斯蒂安·塞格迪(Christian Szegedy)说，“如果你要量化多少数学是形式化的，我会说这远远不到千分之一。”他希望人工智能系统能够自动阅读和形式化数学教科书。\n但数学家们正在提高这一比例。虽然今天Mathlib包含了本科二年级数学的大部分内容，但贡献者希望在几年内增加剩余的课程-这是一个重要的里程碑。\n巴扎德说：“在这些系统存在的50年里，没有一个人说过，‘让我们坐下来组织一个连贯的数学体系，代表本科教育。’”“我们正在制作能够理解本科期末考试试题的东西，这是以前从未有过的。”\nMathlib可能需要几十年的时间才能拥有真正的研究库的内容，但精益用户已经证明，这样一个全面的目录至少是可能的--要做到这一点，只需在所有的数学运算中编程即可。\n为此，去年德国弗莱堡大学的Buzzard、Massot和Johan Commelin进行了一个雄心勃勃的概念验证项目。他们暂时抛开本科数学的逐渐积累，跃居该领域的先锋。其目标是定义21世纪数学的伟大创新之一--波恩大学的彼得·肖尔茨在过去十年中开发出的一种名为完美拟态空间的物体。2018年，这项工作为肖尔茨赢得了菲尔兹奖，这是数学的最高荣誉。\nBuzzard、Massot和Commelin希望证明，至少在原则上，精益能够处理数学家真正关心的那种数学。马赫布比说：“他们采用了一些非常复杂和最新的技术，并展示了在验证助手的帮助下，对这些物体进行研究是可能的。”\n为了定义一个完美的拟态空间，这三位数学家必须将3000多个其他数学对象的定义和它们之间的3万个联系结合在一起。这些定义涉及数学的许多领域，从代数到拓扑学再到几何学。它们共同定义单个对象的方式生动地说明了数学是如何随着时间的推移变得越来越复杂的，以及为什么正确地奠定数学库的基础是如此重要。\n麦克白说：“高等数学的许多领域都需要你在本科时学到的每一种数学。”\n这三人成功地定义了一个完美拟态空间，但至少目前，数学家们还不能对它做太多的工作。精益需要更多的数学知识，才能提出完美拟态空间中出现的各种复杂问题。\n马索特说：“利恩知道什么是完美拟人空间，却不知道复杂的分析，这有点荒谬。”\n巴扎德对此表示赞同，他称完美拟人空间的正规化是一种“噱头”--这是一种新技术有时会表演的展示其价值的早期特技。在这种情况下，它起作用了。\n“你不应该认为是因为我们的工作，地球上的每个数学家都开始使用证明助手，”马索特说，“但我认为他们中的相当一部分人注意到了这一点，并提出了很多问题。”\n精益要真正成为数学研究的一部分还需要很长一段时间。但这并不意味着该节目如今只是科幻杂耍。忙于开发它的数学家们认为他们的工作类似于铺设第一条铁轨-这是一项重要努力的必要开始，即使他们自己可能永远也没有机会去兜风。\n麦克白说：“这将是非常酷的，值得现在投入大笔时间。”“我现在正在投入时间，这样将来的某个人就可以拥有那种令人惊叹的体验。”\n更正：2020年10月2日这篇文章的前一个版本错误地陈述了帕特里克·马索特所在的大学，因为它最近更名了。这篇文章已经做了相应的修改。", "note_en": "Every day, dozens of like-minded mathematicians gather on an online forum called Zulip to build what they believe is the future of their field.\n They’re all devotees of a software program called Lean. It’s a “proof assistant” that, in principle, can help mathematicians write proofs. But before Lean can do that, mathematicians themselves have to manually input mathematics into the program, translating thousands of years of accumulated knowledge into a form Lean can understand.\n  “It’s just fundamentally obvious that when you digitize something you can use it in new ways,” said  Kevin Buzzard of Imperial College London. “We’re going to digitize mathematics and it’s going to make it better.”\n Digitizing mathematics is a longtime dream. The expected benefits range from the mundane — computers grading students’ homework — to the transcendent: using artificial intelligence to discover new mathematics and find new solutions to old problems. Mathematicians expect that proof assistants could also review journal submissions, finding errors that human reviewers occasionally miss, and handle the tedious technical work that goes into filling in all the details of a proof.\n But first, the mathematicians who gather on Zulip must furnish Lean with what amounts to a library of undergraduate math knowledge, and they’re only about halfway there. Lean won’t be solving open problems anytime soon, but the people working on it are almost certain that in a few years the program will at least be able to understand the questions on a senior-year final exam.\n And after that, who knows? The mathematicians participating in these efforts don’t fully anticipate what digital mathematics will be good for.\n “We don’t really know where we’re headed,” said  Sébastien Gouëzel of the University of Rennes.\n  Over the summer, a group of experienced Lean users ran an online workshop called “ Lean for the Curious Mathematician.” In the first session,  Scott Morrison of the University of Sydney demonstrated how to write a proof in the program.\n He began by typing the statement he wanted to prove in syntax Lean understands. In plain English, it translates to “There are infinitely many prime numbers.” There are several ways to prove this statement, but Morrison wanted to use a slight modification of the first one ever discovered, Euclid’s proof from 300 BCE, which involves multiplying all known primes together and adding 1 to find a new prime (either the product itself or one of its divisors will be prime). Morrison’s choice reflected something basic about using Lean: The user has to come up with the big idea of the proof on their own.\n “You’re responsible for the first suggestion,” Morrison said in a later interview.\n After typing the statement and selecting a strategy, Morrison spent a few minutes laying out the structure of the proof: He defined a series of intermediate steps, each of which was relatively simple to prove on its own. While Lean can’t come up with the overall strategy of a proof, it can often help execute smaller, concrete steps. In breaking the proof into manageable sub-tasks, Morrison was a bit like a chef instructing line cooks to chop an onion and simmer a stew. “It’s at this point that you hope Lean takes over and starts being helpful,” Morrison said.\n  Lean performs these intermediate tasks by using automated processes called “tactics.” Think of them as short algorithms tailored to perform a very specific job.\n As he worked through his proof, Morrison ran a tactic called “library search.” It trawled Lean’s database of mathematical results and returned some theorems that it thought could fill in the details of a particular section of the proof. Other tactics perform different mathematical chores. One, called “linarith,” can take a set of inequalities among, say, two real numbers, and confirm for you that a new inequality involving a third number is true: If  a is 2 and  b is greater than  a, then 3 a + 4 b is greater than 12. Another does most of the work of applying basic algebraic rules like associativity.\n “Two years ago you would have had to [apply the associative property] yourself in Lean,” said Amelia Livingston, an undergraduate math major at Imperial College London who is learning Lean from Buzzard. “Then [someone] wrote a tactic that can do it all for you. Every time I use it, I get very happy.”\n Altogether, it took Morrison 20 minutes to complete Euclid’s proof. In some places he filled in the details himself; in others he used tactics to do it for him. At each step, Lean checked to make sure his work was consistent with the program’s underlying logical rules, which are written in a formal language called dependent type theory.\n “It’s like a sudoku app. If you make a move that’s not valid, it will go buzz,” Buzzard said. At the end, Lean certified that Morrison’s proof worked.\n The exercise was exciting in the way it always is when technology steps in to do something you used to do yourself. But Euclid’s proof has been around for more than 2,000 years. The kinds of problems mathematicians care about today are so complicated that Lean can’t even understand the questions yet, let alone support the process of answering them.\n “It will likely be decades before this is a research tool,” said  Heather Macbeth of Fordham University, a fellow Lean user.\n So before mathematicians can work with Lean on the problems they really care about, they have to equip the program with more mathematics. That’s actually a relatively straightforward task.\n  “Lean being able to understand something is pretty much just a matter of human beings having [translated math textbooks] into the form Lean can understand,” Morrison said.\n Unfortunately, straightforward doesn’t mean easy, especially considering that for a lot of mathematics, textbooks don’t really exist.\n  If you didn’t study higher math, the subject probably seems exact and well-documented: Algebra I leads into algebra II, pre-calculus leads into calculus, and it’s all laid out right there in the textbooks, answer key in the back.\n But high school and college math — even a lot of graduate school math — is a vanishingly small part of the overall knowledge. The vast majority of it is much less organized.\n There are huge, important areas of math that have never been fully written down. They’re stored in the minds of a small circle of people who learned their subfield of math from people who learned it from the person who invented it — which is to say, it exists nearly as folklore.\n There are other areas where the foundational material has been written down, but it’s so long and complicated that no one has been able to check that it’s fully correct. Instead, mathematicians simply have faith.\n “We rely on the reputation of the author. We know he’s a genius and a careful guy, so it must be correct,” said  Patrick Massot of Paris-Saclay University.\n  This is one reason why proof assistants are so appealing. Translating mathematics into a language a computer can understand forces mathematicians to finally catalog their knowledge and precisely define objects.\n Assia Mahboubi of the French national research institute Inria recalls the first time she realized the potential of such an orderly digital library: “It was fascinating for me that one could capture, in theory, the whole mathematical literature by the sheer language of logic and store a corpus of math in a computer and check it and browse it using these pieces of software.”\n Lean isn’t the first program with this potential. The first, called Automath, came out in the 1960s, and Coq, one of the most widely used proof assistants today, came out in 1989. Coq users have formalized a lot of mathematics in its language, but that work has been decentralized and unorganized. Mathematicians worked on projects that interested them and only defined the mathematical objects needed to carry their projects out, often describing those objects in unique ways. As a result, the Coq libraries feel jumbled, like an unplanned city.\n “Coq is an old man now, and it has a lot of scars,” said Mahboubi, who has worked with the program extensively. “It’s been collaboratively maintained by many people over time, and it has known defects due to its long history.”\n In 2013, a Microsoft researcher named  Leonardo de Moura launched Lean. The name reflects de Moura’s desire to create a program with an efficient, uncluttered design. He intended the program to be a tool for checking the accuracy of software code, not mathematics. But checking the correctness of software, it turns out, is a lot like verifying a proof.\n “We built Lean because we care about software development, and there is this analogy between building math and building software,” said de Moura.\n  When Lean came out, there were plenty of other proof assistants available, including Coq, which is the most similar to Lean — the logical foundations of both programs are based on dependent type theory. But Lean represented a chance to start fresh.\n Mathematicians gravitated to it quickly. They were such enthusiastic adopters of the program that they started to consume de Moura’s time with their math-specific development questions. “He got a bit sick of having to manage the mathematicians and said, ‘How about you guys make a separate repository?’” said Morrison.\n Mathematicians created that library in 2017. They called it mathlib and eagerly began to fill it with the world’s mathematical knowledge, making it a kind of 21st-century Library of Alexandria. Mathematicians created and uploaded pieces of digitized mathematics, gradually building a catalog for Lean to draw on. And because mathlib was new, they could learn from the limitations of older systems like Coq and pay extra attention to how they organized the material.\n “There’s a real effort to make a monolithic library of math in which all the pieces work with all the other pieces,” said Macbeth.\n  The front page of mathlib features a  real-time dashboard that charts the project’s progress. It has a leaderboard of top contributors, ranked by the number of lines of code they’ve created. There’s also a running tally of the total amount of mathematics that has been digitized: As of early October, mathlib contained 18,416 definitions and 38,315 theorems.\n These are the ingredients that mathematicians can mix together in Lean to make mathematics. Right now, despite those numbers, it’s a limited pantry. It contains almost nothing from complex analysis or differential equations — two basic elements of many fields of higher math — and it doesn’t know enough to even state any of the Millennium Prize problems, the Clay Mathematics Institute’s list of the  most important problems in mathematics.\n But mathlib is slowly filling out. The work has the air of a barn raising. On Zulip, mathematicians identify definitions that need to be created, volunteer to write them and quickly provide feedback on each other’s work.\n “Any research mathematician can look at mathlib and see 40 things it’s missing,” Macbeth said. “So you decide to fill in one of those holes. It really is instant gratification. Someone else reads it and comments on it within 24 hours.”\n Many of the additions are small, as  Sophie Morel of the École Normale Supérieure in Lyon discovered during the “Lean for the Curious Mathematician” workshop this summer. The conference organizers gave the participants relatively simple mathematical statements to prove in Lean as practice. While working on one of them, Morel realized her proof called for a lemma — a type of short steppingstone result — that mathlib didn’t have.\n “It was a very small thing about linear algebra that somehow wasn’t yet there. The people who write mathlib try to be thorough, but you can never think of everything,” said Morel, who coded the three-line lemma herself.\n Other contributions are more momentous. For the last year, Gouëzel has been working on a definition of “smooth manifold” for mathlib. Smooth manifolds are spaces — like lines, circles and the surface of a ball — that play a fundamental role in the study of geometry and topology. They also often feature in big results in areas like number theory and analysis. You couldn’t hope to do most forms of mathematical research without defining one.\n  But smooth manifolds come in different guises, depending on the context. They can be finite-dimensional or infinite-dimensional, have “boundary” or not have boundary, and be defined over a variety of number systems, such as the real, complex or  p-adic numbers. Defining a smooth manifold is almost like trying to define love: You know it when you see it, but any strict definition is likely to exclude some obvious instances of the phenomenon.\n “For a basic definition, you don’t have any choice [for how you define it],” Gouëzel said. “But with more complicated objects, there are maybe 10 or 20 different ways to formalize it.”\n Gouëzel had to maintain a balancing act between specificity and generality. “My rule was, I know 15 applications of manifolds that I wanted to be able to state,” he said. “But I didn’t want the definition to be too general, because then you cannot work with it.”\n The definition he came up with fills 1,600 lines of code, making it pretty long for a mathlib definition, but maybe slight compared to the mathematical possibilities it unlocks in Lean.\n “Now that we have the language, we can start proving theorems,” he said.\n Finding the right definition for an object, at the right level of generality, is a major preoccupation of the mathematicians building mathlib. Its creators hope to define objects in a way that’s useful now but flexible enough to accommodate the unanticipated uses mathematicians might have for these objects.\n “There’s an emphasis on everything being useful far into the future,” Macbeth said.\n  But Lean isn’t just useful — it offers mathematicians the chance to engage with their work in a new way. Macbeth still remembers the first time she tried a proof assistant. It was 2019 and the program was Coq (though she uses Lean now). She couldn’t put it down.\n “In one crazy weekend I spent 12 hours a day [on it],” she said. “It was totally addictive.”\n Other mathematicians talk about the experience the same way. They say working in Lean feels like playing a video game — complete with the same reward-based neurochemical rush that makes it hard to put the controller down. “You can do 14 hours a day in it and not get tired and feel kind of high the whole day,” Livingston said. “You’re constantly getting positive reinforcement.”\n  Still, the Lean community recognizes that for many mathematicians, there just aren’t enough levels to play.\n “If you were to quantify how much of mathematics is formalized, I’d say it’s way less than one-thousandth of one percent,” said  Christian Szegedy, an engineer at Google who is working on artificial intelligence systems that he hopes will be able to read and formalize math textbooks automatically.\n But mathematicians are increasing the percentage. While today mathlib contains most of the content through second-year undergraduate math, contributors hope to add the rest of the curriculum within a few years — a significant milestone.\n “In the 50 years these systems had existed, not one person had said, ‘Let’s sit down and organize a coherent body of mathematics that represents an undergraduate education,’” Buzzard said. “We’re making something that will understand the questions in an undergraduate final exam, and that has never been done before.”\n It will probably take decades before mathlib has the content of an actual research library, but Lean users have shown that such a comprehensive catalog is at least possible — that getting there is merely a matter of programming in all the math.\n To that end, last year Buzzard, Massot, and  Johan Commelin of the University of Freiburg in Germany undertook an ambitious proof-of-concept project. They temporarily put aside the gradual accumulation of undergraduate math and skipped ahead to the vanguard of the field. The goal was to define one of the great innovations of 21st-century mathematics — an object called a perfectoid space that was developed over the last decade by  Peter Scholze of the University of Bonn. In 2018, the work earned Scholze the  Fields Medal, math’s highest honor.\n Buzzard, Massot and Commelin hoped to demonstrate that, at least in principle, Lean can handle the kind of mathematics that mathematicians really care about. “They’re taking something very sophisticated and recent, and showing it’s possible to work on these objects with a proof assistant,” Mahboubi said.\n  To define a perfectoid space, the three mathematicians had to combine more than 3,000 definitions of other mathematical objects and 30,000 connections between them. The definitions sprawled across many areas of math, from algebra to topology to geometry. The way they came together in the definition of a single object is a vivid illustration of the way math grows more complex over time — and of why it’s so important to lay the foundations of mathlib correctly.\n “Many fields of advanced math require every kind of math you learn as an undergraduate,” Macbeth said.\n The trio succeeded in defining a perfectoid space, but for now at least, mathematicians can’t do much with it. Lean needs access to much more mathematics before it can even formulate the kinds of sophisticated questions in which perfectoid spaces emerge.\n “It’s a bit ridiculous that Lean knows what a perfectoid space is, but doesn’t know complex analysis,” Massot said.\n Buzzard agrees, calling the formalization of perfectoid spaces a “gimmick” — the kind of early stunt that new technologies sometimes perform to demonstrate their worth. In this case, it worked.\n  “You shouldn’t think that because of our work every mathematician around the Earth started to use a proof assistant,” Massot said, “but I think quite a few of them noticed and asked a lot of questions.”\n It will still be a long time before Lean is a real part of mathematical research. But that doesn’t mean the program is a science fiction sideshow today. The mathematicians busy developing it see their work as akin to laying the first railroad tracks — a necessary start to an important endeavor, even if they might never get to take a ride themselves.\n “It will be so cool that it’s worth a big time investment now,” Macbeth said. “I’m investing time now so that somebody in the future can have that amazing experience.”\n Correction: October 2, 2020   A previous version of this article misstated Patrick Massot’s university affiliation, due to a recent change in its name. The article has been revised accordingly.", "posttime": "2020-11-12 02:31:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "未来,mathematical,数学", "title": "建设未来的数学图书馆", "title_en": "Building the Mathematical Library of the Future", "transed": 1, "url": "https://www.quantamagazine.org/building-the-mathematical-library-of-the-future-20201001/", "via": "", "real_tags": ["未来", "数学"]}, {"category": "", "categoryclass": "", "imagename": "cba3e5a738f79dfa52a3f07c10a20db8.jpg", "infoid": 1034609, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "计算存储在市场中只占很小的一部分，但在不断增长。为了解决这一问题，三星SmartSSD正在推出内置Xilinx KINTX FPGA的三星SmartSSD，以标准外形提供计算存储功能。在本文中，我们将讨论Xilinx和三星如何提供计算存储平台。\n首先，为什么是计算存储。最大的驱动因素之一是，在系统间高速移动数据会消耗大量电力和带宽。通过计算存储，无需将数据带回主CPU即可处理数据。\n另一个驱动因素是Xilinx认为计算存储将成为主流，预计在短短几年内将占据5%的市场份额。就Xilinx而言，除了三星SmartSSD，Xilinx还涵盖了许多不同类型的加速器，包括Pliops、ScaleFlux和BittWare的加速器。\n基本的三星SmartSSD有两套主要组件。其中一个基本上是4TB的三星V-NAND固态硬盘。这包括一个NAND控制器，我们被告知控制器也可以使用DRAM。该解决方案的第二部分是Xilinx KINTEX FPGA，它有自己的4 GB内存。\n基本流程是，可以向驱动器的SSD或FPGA部分发出命令，并且处理可以在FPGA中进行，而不是返回到主机系统。\n我们稍后将展示一个示例，但一个常见的问题是这些代码是如何编程的。可以使用标准存储堆栈或OpenCL堆栈来进行计算存储。\n正如人们期待的那样，FPGA与合作伙伴的IP解决方案以及Xilinx和三星将拥有的解决方案是有联系的。\nXilinx存储服务(XSS)是该平台可用的卸载。其中包括压缩和加密卸载。\n以VDO中的压缩为例，以下幻灯片有基本流程：\n对于读取，使用FPGA对SmartSSD上的数据进行解压缩。Xilinx表示，通过对固态硬盘进行压缩，它可以获得更好的压缩比。\n在例子方面，我们想突出一个来自刘易斯·罗兹实验室的例子，他们正在使用计算存储进行NPU搜索。实际上，智能固态硬盘被用来根据固态硬盘的数量横向扩展加速器的数量。应用程序可以向存储发送请求，可以在驱动器上评估数据，并且只能将结果传回主系统。\n由于我们的很多读者都注意到了这一点，我们询问了第三代PCIe，他们告诉我们，未来有一个路线图。\n对于STH的读者来说，一个迫在眉睫的问题是为什么要进行计算存储？这种模式的一部分是加速器与存储捆绑在一起。对于加速器公司来说，这是很棒的。不过，我们的许多读者会问，为什么不使用DPU呢？如果你错过了，什么是DPU A数据处理单元Quick Primer是一个很好的资源。我们之所以问，是因为如果唯一的目标是卸载，而SmartSSD在很多方面是两个共同封装的设备，那么将其卸载到更大的芯片上可能是有意义的。我们被告知，在每个驱动器上使用较小的加速器比扩展到较大的加速器更便宜。我们知道，数据中心的每种模式背后都有很大的发展势头，这是我们知道的一个领域。我们将拭目以待，看哪一方最终胜出。", "note_en": "Computational storage is a small but growing segment of the market. To address this, the Samsung SmartSSD is being launched with a Xilinx Kintex FPGA inside to bring computational storage capabilities in a standard form factor. In this article, we are going to discuss how Xilinx and Samsung are delivering a computational storage platform.\n  First, why computational storage. One of the big drivers is that moving data, at high speeds, across systems can use a lot of power and consumes bandwidth. With computational storage, data can be processed without bringing it back to the main CPU.\n  Part of the other driver here is that Xilinx sees computational storage as becoming mainstream, projected to be 5% of the market in only a few years. For its part, Xilinx is covering a number of different types of accelerators aside form the Samsung SmartSSD including those from Pliops, ScaleFlux, and BittWare.\n  The basic Samsung SmartSSD has two main sets of components. One is basically a 4TB Samsung V-NAND SSD. This includes a NAND controller, and we are told DRAM for the controller to use as well. The second part of the solution is a Xilinx Kintex FPGA with its own 4GB of memory.\n  The basic flow is that commands can be issued to either the SSD or the FPGA portion of the drive and processing can occur at the FPGA instead of going back to the host system.\n  We are going to show an example later but a common question will be how are these programmed. One can use a standard storage stack or the OpenCL stack for computational storage aspects.\n  As one would expect with a FPGA, there is a tie in with partner IP solutions as well as those that Xilinx and Samsung will have.\n  The Xilinx Storage Services (XSS) are offloads available for the platform. These include compression and crypto offloads.\n  Taking the compression in VDO as an example, the following slides have the basic flow:\n  For reads, the FPGA is used to decompress data at the SmartSSD. By putting the compression on the SSD, Xilinx says it can get better compression ratios.\n  In terms of examples, we wanted to highlight one from Lewis Rhodes Labs where they are doing NPUSearch using computational storage. Effectively here the SmartSSDs are being used to scale out the number of accelerators with the number of SSDs. An application can send requests to the storage, data can be evaluated at the drives, and only results passed back to the main system.\n  Since many of our readers will have noticed this, we asked about the PCIe Gen3 and we were told that there is a roadmap to the future.\n  For STH readers, an immediate question is going to be why computational storage? Part of this model is that accelerators are tied to storage. For accelerator companies, this is great. Many of our readers though are going to ask about why not use DPUs instead. If you missed it  What is a DPU A Data Processing Unit Quick Primer is a good resource there. We asked since if the only goal is offload, and the SmartSSD is in many ways two devices that are co-packaged, then it could make sense to offload to a bigger chip. We were told that it is less expensive to use a smaller accelerator on each drive than to scale to a larger accelerator. This is one area that we know there is a lot of momentum behind each model in the data center. It will be interesting to see which ultimately wins.", "posttime": "2020-11-12 02:31:20", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "samsung,存储", "title": "Xilinx-Samsung SmartSSD计算存储驱动器推出", "title_en": "Xilinx-Samsung SmartSSD Computational Storage Drive Launched", "transed": 1, "url": "https://www.servethehome.com/xilinx-samsung-smartssd-computational-storage-drive-launched/", "via": "", "real_tags": ["samsung", "存储"]}, {"category": "", "categoryclass": "", "imagename": "10c030b2429f801a5aed8756bdece9d2.jpg", "infoid": 1034608, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TLDR--PGO使编译器速度更快，但在CI中实现起来并不简单。\n在过去的几个月里，Mozilla一直在使用概要引导优化(PGO)来构建他们自己的优化版本Clang，这使得他们的构建基础设施上的Firefox编译时间减少了9%。Rust编译器是否也有同样的可能，也就是说，我们是否可以对rustc本身应用概要引导优化以使它更快呢？这篇文章正是探讨了这个问题，首先详细介绍了生成一个PGOed版本的rustc(有两种风格)所需的步骤，然后来看一下。\nPGO的基本概念是收集有关程序典型执行的数据(例如，它可能采用哪些分支)，然后使用这些数据通知优化，如内联、机器代码布局、寄存器分配等。\n收集有关程序执行情况的数据有不同的方式。一种方法是在分析器(如perf)中运行程序，另一种方法是创建仪表化的二进制文件，即内置了数据收集的二进制文件，然后运行该程序。后者通常提供更准确的数据，也是rustc支持的。\n换句话说，我们首先生成要优化的程序的一个特殊的指令插入版本，然后使用该指令插入版本生成执行配置文件。然后，编译器使用该执行配置文件来更好地优化程序的实际最终版本。\n生成pgoed版本的rustc所涉及的基本步骤与生成任何其他类型的程序相同：\n使用Rustc的仪表化版本来收集配置文件数据，也就是用它编译一堆程序，最好是以一种代表编译器典型用例的方式。\n编译rustc的最终版本，这一次将构建系统指向我们在上一步中生成的概要数据。\n然而，与许多其他程序不同的是，rustc是一个有点特殊的情况，因为它由两个用不同编程语言编写的非常大的代码块组成：LLVM后端(用C++编写)和编译器的前端和中间部分(用Rust编写)。因此，构建rustc还涉及两个独立的编译器--它们都支持各自版本的PGO。这使得事情稍微复杂一些，但幸运的是，这两个组件的PGO设置可以单独处理。\nPGO是一个特定于工具链的特性，因此对于不同的C++编译器，它的工作方式可能会有所不同。在本文中，我将只讨论它是如何使用Clang的，因为(A)我没有在其他编译器中使用PGO的经验，(B)Clang是Rust项目在生产中实际使用的。\n为了为Rustc的LLVM启用PGO，我们基本上遵循上一节中列出的步骤。\n我们通过对Rust签出根目录中的config.toml文件应用以下更改来确保我们的LLVM得到检测：\n[llvm]#将额外的编译器和链接器标志传递给LLVM CMake内部版本。#&lt；PROFDATA_DIR&&gt;必须是指向可写目录的绝对路径，例如/tmp/my-rustc-Profdatacflag=&#34；-fprofile-generate=&lt；PROFDATA_DIR&gt；&#34；cxxflags=&#34；-fprofile-generate=&lt；PROFDATA_DIR&gt；&#34；#确保LLVM构建为dyliblink-Shared=true#确保我们使用Clang编译LLVM#(假设我们是为x86_64 Linux构建的)[target.x86_64-未知-Linux-gnu]cc=&#34；clang&#34；cxx=&#34；linker=&#34；clang&#34；clang&#34；\n-fprofile-Generate标志告诉Clang创建一个检测的二进制文件，将其生成的任何配置文件数据写入给定的目录。建议始终使用绝对路径，因为我们不希望一切依赖于编译器的工作目录。我们还设置了link-Shared=TRUE，以确保Rustc的链接器不必处理将检测运行时链接到C++代码的问题。这是可以实现的，但是。现在我们只需要运行./x.py构建，并等待我们有一个带指令插入的LLVM的有效rustc。\n接下来，我们通过运行在上一步中构建的编译器来收集配置文件数据。这很简单，因为数据收集是完全透明的。只需像往常一样运行该编译器(例如，通过货物)，配置文件数据就会显示在我们在上面的-fprofile-Generate标志中指定的&lt；PROFDATA_DIR&&gt;；中。为了使收集的数据尽可能有用，我们应该尝试执行编译器中的所有公共代码路径。I通常使用&#34；标准&#。用于此目的的rustc-perf基准测试套件，包括调试版本、优化版本、检查版本(增量和非增量版本)。完成此操作后，您将在&lt；PROFDATA_DIR&gt；中找到许多.profraw文件。如Clang用户手册中所述，需要使用Clang安装附带的llvm-Profdata工具将这些.profraw文件合并为一个.Profdata文件：\n现在可以在&lt；PROFDATA_DIR&gt；/rustc-llvm.Profdata中找到所有rustc调用的组合配置文件数据，是时候重新编译LLVM和rustc了，这一次指示Clang利用这个有价值的新信息。为此，我们修改了config.toml，如下所示：\n现在，我们通过删除旧版本并重新构建所有内容来确保正确重建LLVM：\n如上所述，使用PGOed编译器，Firefox的构建时间缩短了9%。Clang自己的文档甚至报告了20%的改进。我们评估Rust编译器性能的最好方法是rustc-perf基准测试套件。由于使用PGO编译不太符合Rust项目的CI的工作方式，我们不能使用Perf.rust-lang.org版本的基准测试套件。幸好，由于性能良好，我们不能使用Perf.rust-lang.org版本的基准测试套件。由于性能良好，我们无法使用Perf.rust-lang.org版本的基准测试套件。幸运的是，由于性能良好，使用PGO进行编译与Rust项目的CI的工作方式不太匹配，所以我们不能使用Perf.rust-lang.org版本的基准测试套件。让我们来看一看PGOed LLVM对Rustc性能的影响：\n这一结果并不像Clang文档中传闻的20%的改进那样惊人，但也相当鼓舞人心，也没有表现出明显的性能倒退。深入到更多的细节中可以看到预期的情况：\n在LLVM中花费大部分时间的工作负载(例如优化的版本)会显示出最大的改进，而根本不调用LLVM的工作负载(例如检查版本)也不会从更快的LLVM中获益。让我们来看看如何通过将PGO应用到编译器的另一半来进一步提高性能。\n基本原则保持不变：创建一个插装的编译器，使用它来收集配置文件数据，并在编译最终版本的编译器时使用这些数据。唯一的区别是，这次我们插装的是编译器代码的不同部分，即由Rustc本身生成的部分。现在，编译器已经支持这一点一段时间了，正如在Rustc书的相应章节中所看到的那样，命令行界面是仿照Clang的一组标志来设计的。不幸的是，该编译器已经支持这样做了一段时间了，正如在Rustc书的相应章节中所看到的那样，命令行界面是仿照Clang的一组标志来设计的。不幸的是，该编译器已经支持了这一点。的构建系统不支持开箱即用的pgo，因此我们必须直接修改src/bootstrap/pile.rs以设置所需的标志。我们只想检测编译器本身，而不是其他工具或标准库，请参见我们将标志添加到rustc_Cargo_env()：\nPub FN rustc_Cargo_env(建筑商：&amp；Builder&lt；，货物：&amp；mut Cargo，目标：TargetSelection){//...。省略了..。If Builder.config.rustc_Parallel{cargo.rustflag(&#34；--cfg=parallel_compiler&#34；)；}if Builder.config.rust_Verify_llvm_ir{cargo.env(&#34；RUSTC_Verify_LLVM_IR&#34；，&#34；1&#34；)；}//这是新的：生成//编译器cargo.rustflag(&#34；-Cprofile-generate=&lt；PROFDATA_DIR&gt；&#34；)；的Cargo调用的//RUSTFLAGS中的硬编码指令插入。//...。省略...}。\n与前面一样，&lt；PROFDATA_DIR&gt；必须是指向目录的实际绝对路径。一旦我们收集了足够的配置文件数据，我们就返回到src/bootstrap/pile.rs，并将-Cprofile-Generate标志替换为-Cprofile-use标志：\nPub FN rustc_Cargo_env(建筑商：&amp；Builder&lt；，货物：&amp；mut Cargo，目标：TargetSelection){//...。省略了..。If builder.config.rustc_parally{cargo.rustflag(&#34；--cfg=parallel_compiler&#34；)；}if builder.config.rust_Verify_llvm_ir{cargo.env(&#34；RUSTC_Verify_LLVM_IR&#34；，&#34；1&#34；)；}//将`-CProfile-Generate`替换为`-CProfile-use`，//假设我们使用了`llvm-Profdata`工具对采集到的`&lt；PROFD`进行了//合并。/*.profraw`文件//放入名为//`&lt；PROFDATA_DIR&gt；/rustc-rust.Profdata`的公共文件中。Cargo.rustflag(&#34；-Cprofile-use=&lt；PROFDATA_DIR&gt；/rustc-rust.profdata&#34；)；//...。省略...}\n让我们来看看PGO对这部分编译器的影响。\n正如预期的那样，结果与将PGO应用于LLVM时类似：指令计数减少了大约5%。注意：这些数字显示了将PGO专门应用于编译器的Rust部分所带来的改进。LLVM部分不是使用PGO编译的，如下所示：\n由于不同的工作负载执行不同数量的Rust代码(与C++/LLVM代码相比)，因此对于LLVM繁重的情况，总的减少可能要少得多。例如，完整的webrender-opt构建将在LLVM上花费超过80%的时间，因此将剩余20%的时间减少5%只能减少1%的总数。另一方面，检查构建或增量未改变的构建在LLVM中几乎不花费时间，因此5%的Rust性能改进可以转化为。\n简而言之，答案是肯定的。更长远的答案是，我们必须注意配置文件数据的不兼容性。Clang和Rust编译器在底层都使用相同的基于LLVM的PGO机制。如果Clang和Rust编译器使用完全相同的LLVM版本，我们甚至可以将两者合并为一个.Profdata文件。但是，如果两个LLVM版本不同，我们最好确保这两个编译器不会互相干扰。\n我们需要为各自的-fprofile-Generate和-Cprofile-Generate(和*-use)标志指定不同的目录。这样，来自Clang的检测代码将写入一个目录，而来自rustc的代码将写入另一个目录。\n我们需要确保为每组.profraw文件使用正确的llvm-Profdata工具。使用Clang附带的工具处理Clang目录中的文件，使用Rust编译器附带的工具处理Rust目录中的文件。\n如果我们这样做，我们将得到一个通过PGO优化了这两个部分的编译器，编译时间的减少也很不错。\n当我看到最终的数字时，我有点失望。当然，PGO似乎导致基准测试套件中几乎所有实际工作负载的指令计数减少了5%，这与检查、调试和OPT构建类似。这相当不错--但与Clang文档中提到的20%的改进相去甚远。考虑到PGO给编译器本身的构建过程增加了相当多的复杂性(更不用说几乎三倍的构建时间)，我开始考虑应用\n然后，我扫了一眼基准&#39；墙时间测量(而不是指令计数测量)，看到的是完全不同的画面：webrender-opt减15%，style-servic-opt减14%，serde-check减15%？这看起来显然比指令计数要好。但是墙时间测量可能非常嘈杂(这就是为什么大多数人只在Perf.rust-lang.org上查看指令计数)，并且rustc-perf只对每个基准进行一次迭代。所以我还没有准备好相信这些数字。我决定试着把基准测试的迭代次数从1次增加到20次，以减少噪音。我只做了#34；由于PGO的影响，这种配置下的完整构建似乎可以很好地转化为增量构建。大约8小时后，我完成了PGO和非PGO版本的基准测试，以下是我得到的数据：\n正如你所看到的，在真实世界的测试案例中，我们几乎全面减少了10%-16%的构建时间。这更符合我最初希望从PGO获得的结果。指令计数和挂起时间之间的差异如此明显，这有点令人惊讶。一个看似合理的解释是，PGO提高了指令高速缓存的利用率，这对执行时间有影响，但不会反映在执行的指令量上。我也不知道分支错误预测是如何影响指令计数-分支预测的。\n尽管这些数字看起来不错，但请记住，它们来自同一台机器。我使用的Ryzen 1700X处理器可能具有一些特性，支持PGO所做的那种优化，而具有不同缓存系统和分支预测器的不同处理器将生成完全不同的数字。尽管如此，这些数字无疑是非常令人鼓舞的，值得进一步研究。\n以上数字表明，PGO确实可以提供显著的编译时间减少。不幸的是，将这些改进带给最终用户并不像在dist构建中添加几个编译标志那么简单。PGO与大多数其他优化的不同之处在于它。\n由于额外的检测和数据收集阶段，需要不同的、扩展的构建工作流，以及。\n它会带来持续的构建时间成本(这是它与其他自动化优化(如LTO)的共同特征)。\n这两个问题都对在编译器本身上实际使用PGO造成了很大的障碍。Rust的CI构建时间一直太长，因此我们已经放弃了一些优化(例如，MacOS仍然不能从使用ThinLTOed LLVM中获得10%的性能提升，因为该平台上的构建机器特别慢)。但是，我认为仍有一条路要走。在上面提到的两个障碍之间有一个权衡：\n如果构建时间不是问题，那么在编译器的构建系统中支持PGO的工程工作量就相当低。也就是说，如果检测、数据收集和最终构建都作为单一的构建出现在同一台机器上，那么扩展构建系统来支持这一点应该是直截了当的。\n如果将大量工程工作投入到更复杂的构建设置中，使用带外检测和配置文件数据缓存，则对构建时间的影响可以保持在相当低的水平。\n我估计第一种方法更有成效，因为低工程和维护成本总是比低计算时间更有价值。拥有一种获得PGOed编译器的直接方法(例如，通过在config.toml中添加一个简单的设置)将打开通向以下几个场景的道路：\n不频繁切换编译器版本的组织和个人可以很容易地编译自己的Rustc优化版本以供内部使用，就像Mozilla已经在使用Clang所做的那样。让一台计算机花费几个小时以便在接下来的几个月内减少15%的编译时间似乎是一项不错的投资。\nRust项目本身可以开始考虑提供更优化的构建，至少在测试版和稳定的渠道上是这样。如果只需要每六周完成一次，而不是针对每个合并的拉请求，那么显著增加编译器在官方构建基础设施上的构建时间将更加可行。\n我不太可能在这件事上花很多时间--但我希望其他人能接过接力棒。我很乐意就如何具体使用PGO提供指导。\nPS--特别感谢Mark Rousskov将我本地的基准测试数据上传到Perf.rust-lang.org，这使它更便于探索！", "note_en": "TLDR -- PGO makes the compiler  faster but is  not straightforward to realize in CI.\n For the last few months Mozilla has been using Profile-Guided Optimization (PGO) to build their own  optimized version of Clang, leading to an up to 9% reduction of Firefox compile times on their build infrastructure.Would the same be possible for the Rust compiler, that is, could we apply profile-guided optimization to  rustc itself in order to make it faster?This post explores exactly this question, detailing first the steps needed for generating a PGOed versions of  rustc (in two flavors), and then taking a look at the resulting performance implications.But before that let&#39;s have a little reminder what PGO even is and how it works in general.\n   The basic concept of PGO is to collect data about the typical execution of a program (e.g. which branches it is likely to take) and then use this data to inform optimizations such as inlining, machine-code layout, register allocation, etc.\n There are different ways of collecting data about a program&#39;s execution. One is to run the program inside a profiler (such as perf) and another is to create an instrumented binary, that is, a binary that has data collection built into it, and run that. The latter usually provides more accurate data and it is also what is supported by  rustc.\n In other words, we first generate a special, &#34;instrumented&#34; version of the program we want to optimize, and then use this instrumented version to generate an execution profile.This execution profile is then used by the compiler for better optimizing the actual, final version of the program.\n  Generating a PGOed version of  rustc involves the same basic steps as it does for any other kind of program:\n Use the instrumented version of  rustc in order to collect profile data, i.e. compile a bunch of programs with it, ideally in a way that represents the typical use cases of the compiler.\n Compile the final version of  rustc, this time pointing the build system to the profile data we generated in the previous step.\n However, as opposed to many other programs,  rustc is a bit of a special case because it consists of two very large chunks of code written in different programming languages: the LLVM backend (written in C++) and the front and middle parts of the compiler (written in Rust).Consequently, there are also two separate compilers involved in building  rustc -- both of which support their own version of PGO.This complicates things slightly but fortunately the PGO setup for each of the two components can be treated in isolation.Let&#39;s take a look at the LLVM part first, since that is slightly simpler.\n  PGO is a toolchain specific feature, so how it works might be different for different C++ compilers.In this article I will only go into how it works with Clang because (a) I have no experience with PGO in other compilers, and (b) Clang is what the Rust project actually uses in production.\n In order to enable PGO for rustc&#39;s LLVM we basically follow the steps laid out in the previous section.\n We make sure that our LLVM gets instrumented by applying the following changes to the  config.toml file in the root directory of our Rust checkout:\n [llvm]# Pass extra compiler and linker flags to the LLVM CMake build.# &lt;PROFDATA_DIR&gt; must be an absolute path to a writeable# directory, like for example /tmp/my-rustc-profdatacflags = &#34;-fprofile-generate=&lt;PROFDATA_DIR&gt;&#34;cxxflags = &#34;-fprofile-generate=&lt;PROFDATA_DIR&gt;&#34;# Make sure that LLVM is built as a dyliblink-shared = true# Make sure we use Clang for compiling LLVM# (assuming that we are building for x86_64 Linux in this case)[target.x86_64-unknown-linux-gnu]cc = &#34;clang&#34;cxx = &#34;clang++&#34;linker = &#34;clang&#34;\n The  -fprofile-generate flag tells Clang to create an instrumented binary that will write any profile data it generates to the given directory.It is advisable to always use an absolute path here since we don&#39;t want things to depend on the working directory of the compiler.We also set  link-shared = true which makes sure that  rustc&#39;s linker does not have to deal with linking the instrumentation runtime into C++ code.It&#39;s possible to make that work but it&#39;s not worth the trouble.Now we just need to run  ./x.py build and wait until we have a working  rustc with an instrumented LLVM.\n Next we collect profile data by running the compiler we built in the previous step.This is straightforward because data collection happens completely transparently.Just run the compiler as you always would (e.g. via Cargo) and the profile data will show up in the  &lt;PROFDATA_DIR&gt; we specified in the  -fprofile-generate flag above.In order to make the collected data as useful as possible, we should try to exercise all the common code paths within the compiler.I typically use the &#34;standard&#34;  rustc-perf benchmark suite for this purpose, which includes debug builds, optimized builds, check builds, both incremental and non-incremental.After this is done, you will find a number of  .profraw files in  &lt;PROFDATA_DIR&gt;. As described in the Clang user manual these  .profraw files need to be merged into a single  .profdata file by using the  llvm-profdata tool that comes with your Clang installation:\n Now that the combined profile data from all  rustc invocations can be found in  &lt;PROFDATA_DIR&gt;/rustc-llvm.profdata it is time to re-compile LLVM and  rustc again, this time instructing Clang to make use of this valuable new information.To this end we modify  config.toml as follows:\n  Now we make sure that LLVM is properly rebuilt by deleting the old version and build everything again:\n  As mentioned above Firefox build times have improved by up to 9% with a PGOed compiler.Clang&#39;s own documentation even  reports an up to 20% improvement.The best way we have for assessing the Rust compiler&#39;s performance is the  rustc-perf benchmark suite.Since compiling with PGO does not quite fit with how the Rust project&#39;s CI works, we cannot use the  perf.rust-lang.org version of the benchmark suite.Fortunately, thanks to  good documentation, running the benchmarks locally is straightforward enough.Here&#39;s a glance at the effect that a PGOed LLVM has on  rustc&#39;s performance:\n  The results are not quite as spectacular as the anecdotal 20% improvement from Clang&#39;s documentation;but they are pretty encouraging and show no significant performance regressions.Diving more into details shows the expected profile:\n  Workloads that spend most of their time in LLVM (e.g. optimized builds) show the most improvement, while workloads that don&#39;t invoke LLVM at all (e.g. check builds) also don&#39;t profit from a faster LLVM.Let&#39;s take a look at how we can take things further by applying PGO to the other half of the compiler.\n  The basic principle stays the same:create an instrumented compiler, use it to collect profile data, use that data when compiling the final version of the compiler.The only difference is that this time we instrument a different part of the compiler&#39;s code, namely the part generated by  rustc itself.The compiler has had support for doing that  for a while now and, as can be seen in the  respective chapter of the rustc book, the command-line interface has been modeled after Clang&#39;s set of flags.Unfortunately, the compiler&#39;s build system does not support using PGO out of the box, so we have to directly modify  src/bootstrap/compile.rs in order to set the desired flags.We only want to instrument the compiler itself, not the other tools or the standard library, see we add the flags to  rustc_cargo_env():\n pub fn rustc_cargo_env(builder: &amp;Builder&lt;&#39;_&gt;, cargo: &amp;mut Cargo, target: TargetSelection) { // ... omitted ... if builder.config.rustc_parallel { cargo.rustflag(&#34;--cfg=parallel_compiler&#34;); } if builder.config.rust_verify_llvm_ir { cargo.env(&#34;RUSTC_VERIFY_LLVM_IR&#34;, &#34;1&#34;); } // This is new: Hard code instrumentation in the // RUSTFLAGS of the Cargo invocation that builds // the compiler cargo.rustflag(&#34;-Cprofile-generate=&lt;PROFDATA_DIR&gt;&#34;); // ... omitted ...}\n As before  &lt;PROFDATA_DIR&gt; must be an actual, absolute path to a directory.Once we have collected enough profile data, we go back to  src/bootstrap/compile.rs and replace the  -Cprofile-generate flag with a  -Cprofile-use flag:\n pub fn rustc_cargo_env(builder: &amp;Builder&lt;&#39;_&gt;, cargo: &amp;mut Cargo, target: TargetSelection) { // ... omitted ... if builder.config.rustc_parallel { cargo.rustflag(&#34;--cfg=parallel_compiler&#34;); } if builder.config.rust_verify_llvm_ir { cargo.env(&#34;RUSTC_VERIFY_LLVM_IR&#34;, &#34;1&#34;); } // Replace `-Cprofile-generate` with `-Cprofile-use`, // assuming that we used the `llvm-profdata` tool to // merge the collected `&lt;PROFDATA_DIR&gt;/*.profraw` files // into a common file named // `&lt;PROFDATA_DIR&gt;/rustc-rust.profdata`. cargo.rustflag( &#34;-Cprofile-use=&lt;PROFDATA_DIR&gt;/rustc-rust.profdata&#34; ); // ... omitted ...}\n Let&#39;s take a look at the effects PGO has on this portion of the compiler.\n  As expected the results are similar to when PGO was applied to LLVM: a reduction of instruction counts by roughly 5%. NOTE: These numbers show the improvement from applying PGO  exclusively to the Rust part of the compiler. The LLVM part was  not compiled with PGO here:\n  Because different workloads execute different amounts of Rust code (vs C++/LLVM code), the total reduction can be a lot less for LLVM-heavy cases.For example, a full  webrender-opt build will spend more than 80% of its time in LLVM, so reducing the remaining 20% by 5% can only reduce the total number by 1%.On the other hand, a  check build or an  incr-unchanged build spends almost no time in LLVM, so the 5% Rust performance improvement translates almost entirely into a 5% instruction count reduction for these cases:\n   The short answer is  yes.The longer answer is that we have to be careful about profile data incompatibilities.Both Clang and the Rust compiler use the same LLVM-based PGO mechanisms underneath.If both Clang and the Rust compiler use the exact same version of LLVM, we can even combine the two into a single  .profdata file.However, if the two LLVM versions are different, we better make sure that the two compilers don&#39;t get into each other&#39;s way.Luckily it&#39;s straightforward to facilitate that:\n We need to specify different directories for the respective  -fprofile-generate and  -Cprofile-generate (and  *-use) flags.This way the instrumentation code coming from Clang will write into one directory and the code coming from  rustc will write into another.\n We need to make sure that we use the right  llvm-profdata tool for each set of  .profraw files.Use the one coming with Clang for handling the files in the Clang directory and the one coming with the Rust compiler for the files in the Rust directory.\n If we do that, we get a compiler with both parts optimized via PGO, with the compile time reductions adding up nicely.\n  When I looked at the  the final numbers, I was a bit underwhelmed.Sure, PGO seems to lead to a pretty solid 5% reduction of instruction counts across basically all real world workloads in the benchmark suite, for  check,  debug, and  opt builds alike.That is pretty nice -- but also far away from the 20% improvement mentioned in the Clang documentation.Given that PGO adds quite a few complications to the build process of the compiler itself (not to mention the almost tripled build times) I started to think that applying PGO to the compiler would probably not be worth the trouble.\n I then took a glance at the benchmarks&#39; wall time measurements (instead of the instruction count measurements) and saw quite a different picture:  webrender-opt minus 15%,  style-servo-opt minus 14%,  serde-check minus 15%?This looked decidedly better than for instruction counts.But wall time measurements can be very noisy (which is why most people only look at instruction counts on perf.rust-lang.org), and  rustc-perf only does a single iteration for each benchmark, so I was not prepared to trust these numbers just yet.I decided to try and reduce the noise by increasing the number of benchmark iterations from one to twenty.I only did &#34;full&#34; builds in this configuration as PGO&#39;s effect seemed to translate pretty predictably to incremental builds.After roughly eight hours to complete both the PGO and the non-PGO versions of the benchmarks these are the numbers I got:\n  As you can see we get a 10-16% reduction of build times almost across the board for real world test cases.This was more in line with what I had initially hoped to get from PGO.It is a bit surprising that the difference between instruction counts and wall time is so pronounced.One plausible explanation would be that PGO improves instruction cache utilization, something which makes a difference for execution time but would not be reflected in the amount of instructions executed.I also don&#39;t know how branch mispredictions factor into instruction counts -- branch prediction being another aspect explicitly targeted by PGO.\n As good as these numbers look, please keep in mind that they come from a single machine.It&#39;s possible that the Ryzen 1700X processor I used has some idiosyncrasies that favor the kind of optimizations that PGO does, and a different processor with a different caching system and branch predictor would generate quite different numbers.Nonetheless, the numbers undoubtedly are very encouraging and warrant further investigation.\n  The numbers above suggest that PGO can indeed provide noticeable compile time reductions.Unfortunately, bringing these improvements to end users is not as simple as adding a few compiler flags to our  dist builds.PGO is different from most other optimizations in that it\n requires a different, extended build workflow due to the additional instrumentation and data collection phases, and\n it incurs a sustained build time cost (a trait it shares with other automated optimizations like LTO).\n Both of these problems pose substantial hurdles for actually using PGO on the compiler itself.Rust&#39;s CI build times have always been too long and we already forgo some optimizations because of them(e.g. macOS still does not get the 10% performance boost from using a ThinLTOed LLVM because the build machines on that platform are especially slow).However, I think there&#39;s still a way forward. There&#39;s a tradeoff between the two obstacles mentioned above:\n If build times are not a problem, then the engineering effort for supporting PGO in the compiler&#39;s build system is quite low.That is, if it is OK for instrumentation, data collection, and final build to all occur as a single monolithic build on the same machine then it should be straightforward to extend the build system to support just that.\n If a lot of engineering effort is put into a more complicated build setup, with out-of-band instrumentation and caching of profile data, then the impact on build times can be kept quite low.\n I estimate that the first approach is more fruitful, as it is always better to put more value on low engineering and maintenance costs than on low compute times.Having a straightforward way of obtaining a PGOed compiler (e.g. by adding a simple setting in  config.toml) would unblock the path to a couple of scenarios:\n Organizations and individuals who don&#39;t switch compiler versions too frequently can easily compile their own, optimized version of  rustc for internal use, like Mozilla is already doing with Clang.Letting a computer spend a couple of hours in order to get a 15% compile time reduction for the next couple of months seems like a good investment.\n The Rust project itself could start thinking about providing more optimized builds, at least on the beta and stable channels.Significantly increasing the compiler&#39;s build times on the official build infrastructure is a lot more viable if it only has to be done every six weeks instead of for every merged pull request.\n It&#39;s unlikely that I can spend a lot of time on this personally -- but my hope is that others will pick up the baton. I&#39;d be happy to provide guidance on how to use PGO specifically.\n PS -- Special thanks to Mark Rousskov for uploading my local benchmarking data to  perf.rust-lang.org, which makes it much nicer to explore!", "posttime": "2020-11-12 02:30:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,编译,程序,编译程序,pgo", "title": "铁锈编译程序的PGO探索", "title_en": "Exploring PGO for the Rust Compiler", "transed": 1, "url": "https://blog.rust-lang.org/inside-rust/2020/11/11/exploring-pgo-for-the-rust-compiler", "via": "", "real_tags": ["rust", "编译", "程序", "编译程序", "pgo"]}, {"category": "", "categoryclass": "", "imagename": "6e554fa84199a90c2d5d047c4dbcc509.png", "infoid": 1034607, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "五年多前，我们推出了谷歌照片(Google Photos)，使命是成为你记忆中的家。它最初是一款管理照片和视频的应用程序，现在已经演变成一个反思生活中有意义时刻的地方。如今，超过4万亿张照片存储在Google Photos中，每周有280亿张新照片和视频上传。\n既然你们中有这么多人依赖谷歌照片来存储你的记忆，那么重要的是，它不仅是一款伟大的产品，而且从长远来看，它还能继续满足你的需求。为了欢迎你更多的回忆，并为未来打造谷歌照片，我们正在改变我们的无限高质量存储政策。\n从2021年6月1日开始，你上传的任何新的照片和视频都将计入每个谷歌账户附带的免费15 GB存储空间，或者你作为Google One会员购买的额外存储空间。你的Google帐户存储在Drive、Gmail和Photos之间共享。这一变化还使我们能够跟上日益增长的存储需求。而且，我们一如既往地坚持我们的承诺，不会将谷歌照片中的信息用于广告目的。我们知道这是一个很大的转变，可能会让你大吃一惊，所以我们想提前让你知道，并给你资源让这件事变得更容易。\n你在2021年6月1日之前上传的任何高质量的照片或视频都不会计入你的15 GB免费存储空间。这意味着，2021年6月1日之前备份的照片和视频仍将被视为免费，不受存储限制。您可以随时在照片应用程序中通过转到设置中的备份和同步来验证您的备份质量。", "note_en": "We launched Google Photos more than five years ago with the mission of being the home for your memories. What started as an app to manage your photos and videos has evolved into a place to reflect on  meaningful moments in your life. Today, more than 4 trillion photos are stored in Google Photos, and every week 28 billion new photos and videos are uploaded.\n Since so many of you rely on Google Photos to store your memories, it’s important that it’s not just a great product, but also continues to meet your needs over the long haul. In order to welcome even more of your memories and build Google Photos for the future, we are changing our unlimited High quality storage policy.\n Starting June 1, 2021, any  new  photos and videos you upload will count toward the free 15 GB of storage that comes with every Google Account or the additional storage you’ve purchased as a Google One member. Your Google Account storage is shared across Drive, Gmail and Photos. This change also allows us to keep pace with the growing demand for storage. And, as always, we uphold our  commitment to not use information in Google Photos for advertising purposes. We know this is a big shift and may come as a surprise, so we wanted to let you know well in advance and give you resources to make this easier.\n   Any photos or videos you’ve uploaded in High quality before June 1, 2021 will not count toward your 15GB of free storage. This means that photos and videos backed up before June 1, 2021 will still be considered free and exempt from the storage limit. You can verify your backup quality at any time in the Photos app by going to  back up &amp; sync in Settings.", "posttime": "2020-11-12 02:30:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,photos,存储", "title": "更新Google Photos的存储策略，面向未来", "title_en": "Updating Google Photos’ storage policy to build for the future", "transed": 1, "url": "https://blog.google/products/photos/storage-changes/", "via": "", "real_tags": ["google", "photos", "存储"]}, {"category": "", "categoryclass": "", "imagename": "408fc77d5ad92dbd9bcd4af44e6a15e9.jpeg", "infoid": 1034606, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "五年来，Google Photos一直提供“高质量”的无限量免费照片备份，一旦该账户使用超过15次，Google Photos将开始收取存储费用。这一变化将于2021年6月1日发生，同时还会有其他Google Drive政策变化，比如将Google Workspace文档和电子表格计算在同一上限内。谷歌还推出了一项新政策，从至少两年未登录的非活跃账户中删除数据。\n6月1日之前上传的所有照片和文件都不会计入15 GB的上限，所以你有足够的时间来决定是继续使用Google Photos还是切换到其他云存储提供商来保存你的照片。只有在6月1日之后上传的照片才会开始计入上限。\n谷歌已经将“原创质量”的照片上传计入了Google Photos的存储上限。然而，取消对“高质量”照片和视频(自动压缩以提高存储效率)的无限备份，也带走了该服务的一个最大卖点。这是一项照片服务，你根本不用担心你有多少存储空间。\n顺便说一句，6月1日之后，Pixel的拥有者仍然可以免费上传高质量(非原创)的照片，而不会把这些照片算在他们的帽子上。它不如Pixel最初提供无限原创质量的协议，但对于少数购买谷歌设备的人来说，这只是一个小小的奖励。\n谷歌指出，它比其他公司提供了更多的免费存储空间--你可以得到15 GB，而不是苹果iCloud提供的区区5 GB--它还声称，80%的谷歌照片用户至少在三年内都不会达到15 GB的上限。\n当你开始接近这个上限时，公司会发出警报和警告。谷歌还在谷歌照片(Google Photos)中加入了新的存储管理工具，包括一个让你更容易找到和删除你本来可能不想要的照片的工具，比如模糊的图片或截图。\n谷歌还将展示一个更有用的“个性化估计”，即一个存储层将在时间上持续多久，而不是千兆字节。它估计每个用户随着时间的推移的平均上传次数，以猜测他们还能使用当前层多长时间。\n为什么会有这样的变化？一种可能性是，这是吸引更多人注册Google One存储的更大努力的一部分。这项服务现在还包括一些较高级别的Android免费VPN，而且似乎许多谷歌产品都在与Google One结盟。谷歌在一次简短的采访中的解释更简单：上传到谷歌照片上的照片和视频已经达到了近乎深不可测的数量，而且这项服务需要具有可持续性。如果你从其博客帖子的字里行间读到这一点，你就会明白这一点：\n如今，超过4万亿张照片存储在Google Photos中，每周有280亿张新照片和视频上传。既然你们中有这么多人依赖谷歌照片来存储你的记忆，那么重要的是，它不仅是一款伟大的产品，而且从长远来看，它还能继续满足你的需求。为了欢迎你更多的回忆，并为未来打造谷歌照片，我们正在改变我们的无限高质量存储政策。\nGoogle One的定价没有改变。它的起步价为每月1.99美元(100 GB)，分为200 GB(2.99美元/月)、2TB(9.99美元/月)和30TB(149.99美元/月)。\n除了照片，“谷歌文档、表格、幻灯片、图纸、表格和Jamboard文件”也将开始计入存储上限。理由是“让我们的政策更符合行业标准，”谷歌说。(这结束了一些非常聪明的黑客攻击，比如这个通过二进制转换工具将文件转换成Google Docs的黑客攻击。)。\n至于非活跃账户政策，它似乎相当合理：如果你已经两年没有接触你的谷歌账户，并且没有以任何方式回复谷歌发送给你的多封警告电子邮件和通知，谷歌可能会从你的账户中删除数据。以下是谷歌对此的解释：\n如果你在这些服务中有一项或多项两年(24个月)处于非活跃状态，谷歌可能会删除你处于非活跃状态的产品中的内容。[.]。同样，如果你的存储空间超过了两年，谷歌可能会删除你在Gmail、Drive和Photos上的内容。\n在我们尝试删除任何内容之前，我们会多次通知您，以便您有足够的机会采取行动。保持账户活跃的最简单方法是在登录并连接到互联网时，定期访问网络或手机上的Gmail、Drive或Photos。", "note_en": "After  five years of offering unlimited free photo backups at “high quality,” Google Photos will start charging for storage once more than 15 gigs on the account have been used. The change will happen on June 1st, 2021, and it comes with other Google Drive policy changes like counting Google Workspace documents and spreadsheets against the same cap. Google is also introducing a new policy of deleting data from inactive accounts that haven’t been logged in to for at least two years.\n All photos and documents uploaded before June 1st will  not count against that 15GB cap, so you have plenty of time to decide whether to continue using Google Photos or switching to another cloud storage provider for your photos. Only photos uploaded  after June 1st will begin counting against the cap.\n Google already counts “original quality” photo uploads against a storage cap in Google Photos. However, taking away unlimited backup for “high quality” photos and video (which are automatically  compressed for more efficient storage) also takes away one of the service’s biggest selling points. It was the photo service where you just didn’t have to worry about how much storage you had.\n  As a side note, Pixel owners will still be able to upload high-quality (not original) photos for free after June 1st without those images counting against their cap. It’s not as good as the Pixel’s original deal of getting unlimited original quality, but it’s a small bonus for the few people who buy Google’s devices.\n Google points out that it offers more free storage than others — you get 15GB instead of the paltry 5GB that Apple’s iCloud gives you — and it also claims that 80 percent of Google Photos users won’t hit that 15GB cap for at least three years.\n The company will send alerts and warnings when you begin to approach that cap. Google is also putting new storage management tools into Google Photos, including a tool that makes it easier to find and delete photos you might not want anyway, like blurry images or screenshots.\n   Google is also going to show a more useful “personalized estimate” of how much longer a storage tier will last in terms of time instead of gigabytes. It estimates each user’s average uploads over time to guess how much longer they’ll be able to use their current tier.\n Why the change? One possibility is that it’s part of a larger push to get more people to sign up for Google One storage. The service now also includes a free VPN for Android at some of its higher tiers, and it seems as though many Google products are aligning with Google One. Google’s explanation in a brief interview is simpler: there is already a nearly unfathomable number of photos and videos uploaded to Google Photos, and the service needs to be sustainable. That’s the gist if you read between the lines of its blog post:\n Today, more than 4 trillion photos are stored in Google Photos, and every week 28 billion new photos and videos are uploaded. Since so many of you rely on Google Photos to store your memories, it’s important that it’s not just a great product, but also continues to meet your needs over the long haul. In order to welcome even more of your memories and build Google Photos for the future, we are changing our unlimited High quality storage policy.\n   Google One pricing is not changing. It starts at $1.99 / month for 100GB and has tiers going through 200GB ($2.99 / month), 2TB ($9.99 / month), and all the way up to 30TB ($149.99 / month).\n Alongside photos, “Google Docs, Sheets, Slides, Drawings, Forms and Jamboard files” will also begin counting against storage caps. The reasoning is “to bring our policies more in line with industry standards,” Google says. (This puts an end to some very clever hacks like  this one that turned files into Google Docs through a binary conversion tool.)\n As for the inactive account policy, it seems fairly reasonable: if you haven’t touched your Google account for two years and don’t respond in any way to the multiple warning emails and notifications Google sends you, the company may delete data from your account. Here’s how Google explains it:\n If you’re inactive in one or more of these services for two years (24 months), Google may delete the content in the product(s) in which you’re inactive. [...] Similarly, if you’re over your storage limit for two years, Google may delete your content across Gmail, Drive and Photos.\n We will notify you multiple times before we attempt to remove any content so you have ample opportunities to take action. The simplest way to keep your account active is to periodically visit Gmail, Drive or Photos on the web or mobile, while signed in and connected to the internet.", "posttime": "2020-11-12 02:30:22", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,免费,photos", "title": "谷歌照片将于2021年6月1日停止免费无限存储", "title_en": "Google Photos will end its free unlimited storage on June first, 2021", "transed": 1, "url": "https://www.theverge.com/2020/11/11/21560810/google-photos-unlimited-cap-free-uploads-15gb-ending", "via": "", "real_tags": ["google", "谷歌", "免费", "photos"]}, {"category": "", "categoryclass": "", "imagename": "0611c9e8464ca6fcab2888d15829f679.png", "infoid": 1034605, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Brotli是一种最先进的无损压缩格式，所有主流浏览器都支持它。它能够实现比无处不在的gzip好得多的压缩比，并且正在迅速流行起来。CloudFlare尽可能使用Google brotli库来动态压缩Web内容。2015年，我们深入研究了brotli的工作原理及其压缩优势。\n在文本Web内容压缩的上下文中，brotli文件格式的一个更有趣的特性是包含了一个内置的静态词典。该词典相当大，除了包含多种语言的各种字符串外，它还支持对这些单词应用多个转换的选项，从而增加了它的通用性。\n开源的brotli库实现了brotli的编码器和解码器，它为编码器预定义了11个质量级别，更高的质量级别需要更多的CPU来换取更好的压缩比。由于静态字典功能的CPU成本较高，因此从级别5开始有限地使用，并且仅在级别10和11全面使用。\n我们对有限字典使用方法进行了改进，并添加了优化以在压缩Web内容时以可忽略的性能影响改善5到9级的压缩。\nBrotli主要使用LZ77算法来压缩其数据。我们之前关于Brotli的博客文章提供了一个介绍。\n为了改进对文本文件和网页内容的压缩，brotli还包括一个静态的预定义词典。如果字节序列不能与使用LZ77的较早序列匹配，则编码器将尝试通过引用静态字典来匹配该序列，可能使用多个转换中的一个。例如，每个HTML文件都包含不能用LZ77压缩的开始&lt；html&gt；标记，因为它是唯一的，但它包含在brotli静态字典中，并将被替换为对它的引用。引用通常比序列本身占用更少的空间，从而减小压缩文件的大小。\n这部词典收录了6种语言的13504个单词，长度从4到24个字符不等。为了改进对真实文本和Web数据的压缩，一些词典单词是Web内容中常见的短语(当前)或字符串(‘type=“text/javascript”’)。与通常的LZ77压缩不同，字典中的单词只能作为一个整体进行匹配。Brotli格式不支持在词典单词中间开始匹配，在单词结尾之前结束匹配，甚至扩展到下一个单词。\n取而代之的是，该词典支持120个词典单词的转换，以支持更大数量的匹配并查找更长的匹配。转换包括添加后缀(“work”变为“work”)，添加前缀(“book”=&&gt;；“the book”)，使第一个字符大写(&#34；process&#34；=&gt；&34；process&#34；)或将整个单词转换为大写(“html”=&&gt;；“HTML”)。除了使单词变长或大写的转换之外，Cut转换还允许缩短匹配(“Consistent”=&gt；“consistent”)，这使得查找更多匹配成为可能。\n在包含转换的情况下，静态词典包含1633,984个不同的单词--对于穷举搜索来说太多了，除非使用较慢的brotli压缩级别10和11。当使用较低的压缩级别时，brotli要么禁用词典，要么只搜索大约5500个单词的子集，以便在可接受的时间范围内找到匹配项。它还只考虑无法找到LZ77匹配项的位置的匹配项，并且只使用CUT变换。\n我们对brotli字典的方法使用了比默认字典更大但更专业的字典子集，使用更积极的启发式算法来提高压缩比，而性能损失可以忽略不计。为了提供更专业的词典，我们从服务器向压缩器提供了内容类型提示，依靠Content-Type标头告诉压缩器它是否应该使用用于HTML、JavaScript或CSS的词典。未来，词典还可以通过主机代管语言进一步完善。\n为了在不牺牲性能的情况下提高压缩性能，如果我们想要比brotli默认情况下更彻底地搜索字典，我们需要一种快速查找匹配的方法。我们的方法使用三种数据结构来直接查找匹配词。基数trie负责查找单词，而哈希表和Bloom filter用于加快基数trie的速度，并快速消除许多使用字典无法匹配的单词。\n基数trie很容易找到最长的匹配词，而不必尝试匹配几个词。为了找到匹配项，我们根据当前位置的文本遍历图表，并记住具有匹配词的最后一个节点。基数trie支持压缩节点(具有多个字符作为边缘标签)，这极大地减少了典型词典单词需要遍历的节点数量。\n我们找不到匹配的大量位置减慢了基数Trie的速度。一个重要的发现是，大多数不匹配的字符串在前四个字节中都有一个不匹配的字符。即使对于存在匹配的位置，也会花费大量时间遍历前四个字节的节点，因为靠近树根的节点通常有很多子节点。\n幸运的是，我们可以使用哈希表查找相当于四个字节的节点，如果存在则进行匹配，或者拒绝匹配的可能性。因此，我们查找字符串的前四个字节，如果有匹配节点，我们将从那里遍历trie，这样会更快，因为每个四字节的前缀通常只有几个相应的字典字。如果没有匹配节点，这个位置就不会有匹配词，我们就不需要进一步考虑了。\n虽然哈希表的设计目的是快速拒绝不匹配，并避免缓存未命中和Trie中的高搜索成本，但它仍然面临类似的问题：我们可能会使用给定位置的哈希值搜索几个4字节的前缀，结果发现没有找到匹配。此外，由于缓存未命中，散列查找的成本可能很高。\n为了快速拒绝与词典不匹配但仍可能导致缓存未命中的单词，我们使用k=1的Bloom过滤器来快速排除大多数不匹配的位置。在k=1的情况下，过滤器只是一个查找表，其中有一位指示对于给定的散列值是否存在任何匹配的4字节前缀。如果给定位的散列值为0，则不会有匹配。由于布隆过滤器对每个四字节前缀最多使用一位，而哈希表需要16字节，因此缓存未命中的可能性要小得多。(结构的实际大小略有不同，因为两个结构中都有许多空白空间，而Bloom过滤器有两倍的元素来拒绝更多不匹配的位置。)\n这对性能非常有用，因为Bloom Filter查找只需要一次内存访问。Bloom过滤器的设计既快速又简单，但仍会拒绝一半以上的非匹配位置，从而使我们可以省去完整的散列查找，这通常意味着缓存未命中。\n只在某些位置搜索词典这也是使用股票词典来完成的，但我们的搜索力度更大。虽然股票字典只考虑LZ77匹配查找器找不到匹配的位置，但我们也根据Brotli成本模型考虑匹配较差的位置：LZ77匹配较短或当前位置和参考位置之间的距离较长的位置通常只提供很小的压缩改进，因此值得尝试在静态字典中找到更好的匹配。\n只考虑最长的匹配，然后对其进行转换，而不是查找和转换某个位置的所有匹配，基数trie只给出最长的匹配，然后进行转换。这种方法会带来巨大的性能提升。在大多数情况下，这会导致找到最佳匹配。\n只包含一些转换，虽然所有转换都可以提高压缩比，但我们只包含那些能够很好地处理数据结构的转换。在找到未转换的匹配项后，可以轻松地应用后缀转换。对于大写转换，我们在基数trie中包括单词的未转换版本和大写版本。前缀和剪切转换不能很好地处理基数Trie，因此不支持超过1个字节的剪切和前缀转换。\n在低压缩级别时，Brotli从词典的13,504个单词中搜索~5,500个单词的子集，这对压缩有负面影响。要存储整个词典，我们需要在Trie中存储大约31,700个单词，考虑到ASCII序列的大写转换输出和散列中的大约11,000个4字节前缀。这会降低哈希表和基数trie的速度，因此我们需要找到适合Web内容的字典的另一个子集。\n为此，我们使用了包含代表性内容的大型数据集。我们确保使用来自世界多个地区的网络内容，以反映语言多样性并优化压缩。基于这个数据集，根据Brotli成本模型，我们确定了哪些单词是最常用的，并导致了最大的压缩改进。我们只收录基于这个计算的最有用的单词。此外，如果某些单词根据其散列值降低了对其他更常用单词的散列表查找速度，则会删除这些单词。\n我们已经为HTML、CSS和JavaScript内容生成了单独的字典，并使用MIME类型来标识要使用的正确字典。我们目前使用的词典包括整个词典的15%-35%，包括大写转换。根据数据类型和所需的压缩/速度权衡，字典大小的不同选项可能会很有用。我们还开发了自动收集有关匹配的统计信息并基于此生成简化词典的代码，这使得将其扩展到其他文本格式(可能是大多数非英语或XML数据的数据)变得容易，并为这类数据获得更好的结果。\n我们在一个由HTML、CSS和JavaScript文件组成的大型数据集上测试了缩减后的词典。\n这一改进对于小文件来说尤其显著，因为LZ77压缩对它们的效果较差。由于对大文件的改进要小得多，所以我们只测试了256KB以下的文件。我们使用压缩级别5，与我们目前在边缘上用于动态压缩的压缩级别相同，并在英特尔酷睿i7-7820HQ CPU上进行了测试。\n压缩改进被定义为1-(使用缩小字典的压缩大小/没有字典的压缩大小)。然后，对每个输入大小范围求该比率的平均值。我们还提供了按文件大小加权的平均值。我们的数据集反映了典型的网络流量，涵盖了大范围的文件大小，小文件更为常见，这解释了加权平均值和未加权平均值之间的巨大差异。\n有了改进的字典方法，我们现在也能够压缩HTML、JavaScript和CSS文件，有时甚至比使用更高的压缩级别更好，同时只多使用1%到3%的CPU。作为参考，使用压缩级别6超过5会使CPU使用率最多增加12%。\n压缩优化、速度和可靠性的职业生涯", "note_en": "Brotli is a state of the art lossless compression format, supported by all major browsers. It is capable of achieving considerably better compression ratios than the ubiquitous gzip, and is rapidly gaining in popularity. Cloudflare uses the Google brotli library to dynamically compress web content whenever possible. In 2015, we took  an in-depth look at how brotli works and its compression advantages.\n One of the more interesting features of the  brotli file format, in the context of textual web content compression, is the inclusion of a built-in static dictionary. The dictionary is quite large, and in addition to containing various strings in multiple languages, it also supports the option to apply multiple transformations to those words, increasing its versatility.\n The  open sourced brotli library, that implements an encoder and decoder for brotli, has 11 predefined quality levels for the encoder, with higher quality level demanding more CPU in exchange for a better compression ratio. The static dictionary feature is used to a limited extent starting with level 5, and to the full extent only at levels 10 and 11, due to the high CPU cost of this feature.\n We improve on the limited dictionary use approach and add optimizations to improve the compression at levels 5 through 9 at a negligible performance impact when compressing web content.\n  Brotli primarily uses the LZ77 algorithm to compress its data. Our  previous blog post about brotli provides an introduction.\n To improve compression on text files and web content, brotli also includes a static, predefined dictionary. If a byte sequence cannot be matched with an earlier sequence using LZ77 the encoder will try to match the sequence with a reference to the static dictionary, possibly using one of the multiple transforms. For example, every HTML file contains the opening &lt;html&gt; tag that cannot be compressed with LZ77, as it is unique, but it is contained in the brotli static dictionary and will be replaced by a reference to it. The reference generally takes less space than the sequence itself, which decreases the compressed file size.\n The dictionary contains 13,504 words in six languages, with lengths from 4 to 24 characters. To improve the compression of real-world text and web data, some dictionary words are common phrases (&#34;The current&#34;) or strings common in web content (‘type=”text/javascript”’). Unlike usual LZ77 compression, a word from the dictionary can only be matched as a whole. Starting a match in the middle of a dictionary word, ending it before the end of a word or even extending into the next word is not supported by the brotli format.\n Instead, the dictionary supports 120 transforms of dictionary words to support a larger number of matches and find longer matches. The transforms include adding suffixes (“work” becomes “working”) adding prefixes (“book” =&gt; “ the book”) making the first character uppercase (&#34;process&#34; =&gt; &#34;Process&#34;) or converting the whole word to uppercase (“html” =&gt; “HTML”). In addition to transforms that make words longer or capitalize them, the cut transform allows a shortened match (“consistently” =&gt; “consistent”), which makes it possible to find even more matches.\n  With the transforms included, the static dictionary contains 1,633,984 different words – too many for exhaustive search, except when used with the slow brotli compression levels 10 and 11. When used at a lower compression level, brotli either disables the dictionary or only searches through a subset of roughly 5,500 words to find matches in an acceptable time frame. It also only considers matches at positions where no LZ77 match can be found and only uses the cut transform.\n Our approach to the brotli dictionary uses a larger, but more specialized subset of the dictionary than the default, using more aggressive heuristics to improve the compression ratio with negligible cost to performance. In order to provide a more specialized dictionary, we provide the compressor with a content type hint from our servers, relying on the Content-Type header to tell the compressor if it should use a dictionary for HTML, JavaScript or CSS. The dictionaries can be furthermore refined by colocation language in the future.\n  To improve compression without sacrificing performance, we needed a fast way to find matches if we want to search the dictionary more thoroughly than brotli does by default. Our approach uses three data structures to find a matching word directly. The radix trie is responsible for finding the word while the hash table and bloom filter are used to speed up the radix trie and quickly eliminate many words that can’t be matched using the dictionary.\n  The  radix trie easily finds the longest matching word without having to try matching several words. To find the match, we traverse the graph based on the text at the current position and remember the last node with a matching word. The radix trie supports compressed nodes (having more than one character as an edge label), which greatly reduces the number of nodes that need to be traversed for typical dictionary words.\n The radix trie is slowed down by the large number of positions where we can’t find a match. An important finding is that most mismatching strings have a mismatching character in the first four bytes. Even for positions where a match exists, a lot of time is spent traversing nodes for the first four bytes since the nodes close to the tree root usually have many children.\n Luckily, we can use a  hash table to look up the node equivalent to four bytes, matching if it exists or reject the possibility of a match. We thus look up the first four bytes of the string, if there is a matching node we traverse the trie from there, which will be fast as each four-byte prefix usually only has a few corresponding dict words. If there is no matching node, there will not be a matching word at this position and we do not need to further consider it.\n While the hash table is designed to reject mismatches quickly and avoid cache misses and high search costs in the trie, it still suffers from similar problems: We might search through several 4-byte prefixes with the hash value of the given position, only to learn that no match can be found. Additionally, hash lookups can be expensive due to cache misses.\n To quickly reject words that do not match the dictionary, but might still cause cache misses, we use a  k=1 bloom filter to quickly rule out most non-matching positions. In the k=1 case, the filter is simply a lookup table with one bit indicating whether any matching 4-byte prefixes exist for a given hash value. If the hash value for the given bit is 0, there won’t be a match. Since the bloom filter uses at most one bit for each four-byte prefix while the hash table requires 16 bytes, cache misses are much less likely. (The actual size of the structures is a bit different since there are many empty spaces in both structures and the bloom filter has twice as many elements to reject more non-matching positions.)\n This is very useful for performance as a bloom filter lookup requires a single memory access. The bloom filter is designed to be fast and simple, but still rejects more than half of all non-matching positions and thus allows us to save a full hash lookup, which would often mean a cache miss.\n   Only search the dictionary at some positions This is also done using the stock dictionary, but we search more aggressively. While the stock dictionary only considers positions where the LZ77 match finder did not find a match, we also consider positions that have a bad match according to the brotli cost model: LZ77 matches that are short or have a long distance between the current position and the reference usually only offer a small compression improvement, so it is worth trying to find a better match in the static dictionary.\n Only consider the longest match and then transform it Instead of finding and transforming all matches at a position, the radix trie only gives us the longest match which we then transform. This approach results in a vast performance improvement. In most cases, this results in finding the best match.\n Only include some transforms While all transformations can improve the compression ratio, we only included those that work well with the data structures. The suffix transforms can easily be applied after finding a non-transformed match. For the upper case transforms, we include both the non-transformed and the upper case version of a word in the radix trie. The prefix and cut transforms do not play well with the radix trie, therefore a cut of more than 1 byte and prefix transforms are not supported.\n  At low compression levels, brotli searches a subset of ~5,500 out of 13,504 words of the dictionary, negatively impacting compression. To store the entire dictionary, we would need to store ~31,700 words in the trie considering the upper case transformed output of ASCII sequences and ~11,000 four-byte prefixes in the hash. This would slow down hash table and radix trie, so we needed to find a different subset of the dictionary that works well for web content.\n For this purpose, we used a large data set containing representative content. We made sure to use web content from several world regions to reflect language diversity and optimize compression. Based on this data set, we identified which words are most common and result in the largest compression improvement according to the brotli cost model. We only include the most useful words based on this calculation. Additionally, we remove some words if they slow down hash table lookups of other, more common words based on their hash value.\n We have generated separate dictionaries for HTML, CSS and JavaScript content and use the MIME type to identify the right dictionary to use. The dictionaries we currently use include about 15-35% of the entire dictionary including uppercase transforms. Depending on the type of data and the desired compression/speed tradeoff, different options for the size of the dictionary can be useful. We have also developed code that automatically gathers statistics about matches and generates a reduced dictionary based on this, which makes it easy to extend this to other textual formats, perhaps data that is majority non-English or XML data and achieve better results for this type of data.\n  We tested the reduced dictionary on a large data set of HTML, CSS and JavaScript files.\n The improvement is especially big for small files as the LZ77 compression is less effective on them. Since the improvement on large files is a lot smaller, we only tested files up to 256KB. We used compression level 5, the same compression level we currently use for dynamic compression on our edge, and tested on a Intel Core i7-7820HQ CPU.\n Compression improvement is defined as 1 - (compressed size using the reduced dictionary / compressed size without dictionary). This ratio is then averaged for each input size range. We also provide an average value weighted by file size. Our data set mirrors typical web traffic, covering a wide range of file sizes with small files being more common, which explains the large difference between the weighted and unweighted average.\n  With the improved dictionary approach, we are now able to compress HTML, JavaScript and CSS files as well, or sometimes even better than using a higher compression level would allow us, all while using only 1% to 3% more CPU. For reference using compression level 6 over 5 would increase CPU usage by up to 12%.\n  Compression  Optimization  Speed &amp; Reliability  Careers", "posttime": "2020-11-12 02:29:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经历,brotli,匹配", "title": "我的实习经历：使用精简词典进行Brotli压缩", "title_en": "My internship: Brotli compression using a reduced dictionary", "transed": 1, "url": "https://blog.cloudflare.com/brotli-compression-using-a-reduced-dictionary/", "via": "", "real_tags": ["经历", "brotli", "匹配"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1034604, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这份公告是由志愿者优先项目委员会和FSF共同撰写的。", "note_en": "This announcement was written collaboratively by the volunteer High Priority Projects committee and the FSF.", "posttime": "2020-11-12 02:29:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,委员会,begins,志愿者", "title": "委员会开始审查高优先级项目自由软件清单", "title_en": "Committee begins review of High Priority Projects free software list", "transed": 1, "url": "https://www.fsf.org/blogs/community/committee-begins-review-of-high-priority-projects-free-software-list", "via": "", "real_tags": ["软件", "委员会", "begins", "志愿者"]}, {"category": "", "categoryclass": "", "imagename": "76699355bf5b6adbde5da46c94b06ee1.jpg", "infoid": 1034603, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们最近对首次购房者的数据进行了研究，发现接受家庭经济援助的人比同龄人买房的时间长达12年。\n根据全国房地产经纪人协会的数据，在过去的几十年里，人们购买第一套住房的平均年龄从28岁上升到32岁。\n在35岁以下的人中，有43%的人在买房时会得到家人的经济帮助[2]。\n目前的平均首付大约是房屋价值的10-12%[3]。根据全国房价中值为25万美元计算，潜在的新购房者需要节省大约25000美元[4]。\n35岁以下的人平均每年存不到2000美元，这意味着在没有经济援助的情况下，他们需要12年才能存钱买房[5]。\n多年来，首次购房者的平均年龄一直在上升。对于许多二十多岁的年轻人来说，这曾经是一件相当常见的人生事件，现在对于普通人来说，这一事件已经蔓延到35岁左右，因为助学贷款、工资停滞和房价的负担阻碍了年轻人进入住房市场。\n全美房地产经纪人协会(National Association Of Realtors)在2018年报告称，首次购房者的年龄中值现在为32岁，在过去几十年里呈上升趋势，而在过去，25岁左右的人买得起房子的情况更常见。\n值得注意的是，考虑到所有购房者的年龄中值，无论这是否是他们的第一次购房，年龄差距都达到了有史以来的最大水平。彭博社报道，所有购房者的平均年龄为47岁，这个数字每年都在持续攀升。\n华盛顿房地产经纪集团(Realtors Group)负责人口统计和行为洞察力的副总裁杰西卡·劳茨(Jessica Lautz)在彭博社(Bloomberg)的这篇文章中表示：“如今，人们很难负担得起住房，尤其是在房租和助学贷款债务不断上涨的情况下，他们正在寻找不同的方式来拥有住房。”\n虽然考虑到大多数40岁以下成年人的经济状况，上述所有这些都是有意义的，但在首次购房方面，35岁以下人群之间存在一个明显的鸿沟：来自家庭的经济援助。\nReviews.com房屋研究团队发现，一个人在购买第一套住房时越年轻，他们就越有可能从家人那里获得直接的经济援助。\n事实上，根据我们的研究，如果一个人从父母那里得到了一笔可观的现金来帮助他们买房，这可以让他们比同龄人提前至少12年做到这一点。\n根据20多岁和30多岁人群的平均储蓄率(每年约1500至2000美元)计算，首付的中位数约为2.5万美元，35岁以下的普通人大约需要10至15年的时间才能存下首付，这是许多人购买第一套住房的最大障碍。\n随着43%的人从家人那里获得经济援助来买房，这一时间线变得短了很多。许多35岁以下的人可以承担每月拥有一套住房的经济责任。每月的抵押贷款、住房保险和财产税等费用通常不会比当地类似面积的租金高出多少。但为首付存钱很容易需要十年或更长时间，这意味着那些在购房过程的这一部分获得经济援助的人将拥有明显的优势。", "note_en": "Our recent study of data surrounding first-time home buyers has found that people who receive financial assistance from their family are able to buy a house up to 12 years ahead of their peers.\n The average age people buy a first home has gone from 28 years old to 32 years old over the past several decades, according to National Realtor Association data [1].\n 43% of people under 35 get financial help from family when buying a house [2].\n The current average down payment is approximately 10-12% of home value [3]. Based on the national median value of a home being $250,000, a potential new home buyer needs to save approximately $25,000 [4].\n The average person under 35 saves less than $2,000 a year, meaning with no financial assistance it will take them 12 years to save for a home [5].\n For years, the average age of first-time home buyers has gone up. What used to be a pretty common life event for many in their twenties, now pushes into the mid-thirties for the average person as the burden of student loans, wage stagnation, and housing prices have prevented younger people from being able to enter the home ownership market.\n The  National Association of Realtors reported in 2018, that the median age of first-time home buyers is now 32 years, trending upward over the last several decades, where previously it was more common for someone in their mid-20s to be able to buy a home.\n  Notably, when taking into account the median age of all homebuyers, irrespective of whether it is their first home purchase, the age gap has grown the widest it has ever been.  Bloomberg reports that the average of all homebuyers is 47 years old, a number that consistently climbs every year.\n “Housing affordability is so difficult today, especially when coupled with rising rents and student loan debt, that they’re finding different ways to enter home ownership,” Jessica Lautz, vice president of demographics and behavioral insights at the Realtors group in Washington said in the above Bloomberg article.\n And while all of the above makes sense given the financial climate of most adults under 40, there is one clear divide between the under-35 age bracket when it comes to first-time home buying accessibility: financial assistance from family.\n The Reviews.com home research team has found that the younger a person is when they buy their first home, the more likely it is that they have received direct financial assistance from their family to do so.\n In fact, based on our research,  if someone is gifted a notable sum of cash from their parents in order to help them buy a home, it can allow them to do so at least twelve years ahead of their peers.\n Calculating the median down payment being approximately $25,000 against the average savings rates of those in their twenties and young thirties (approximately $1,500 – $2,000 a year), it will take the average person under 35 about 10-15 years to save for a down payment, the largest hindrance for many buying their first home.\n  With 43% of people getting financial assistance from family to buy their home, this timeline gets a lot shorter. Many people under 35 can handle the monthly financial responsibilities of owning a home. Things like the monthly mortgage, home insurance, and property taxes are often not much higher than local rental rates for similar square footage. But saving for a down payment can easily take a decade or more, meaning those who receive financial assistance with this portion of the home buying process will have an obvious advantage.", "posttime": "2020-11-12 02:29:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "经济援助,faster,住房", "title": "有家庭经济援助的人买房比同龄人快12年", "title_en": "Those with Financial Aid from Family Can Buy Homes 12 Years Faster Than Peers", "transed": 1, "url": "https://www.reviews.com/insurance/homeowners/first-time-home-buyers-study/", "via": "", "real_tags": ["经济援助", "faster", "住房"]}, {"category": "", "categoryclass": "", "imagename": "491bfc86bbbb1ae35d121bad6b6d7496.webp", "infoid": 1034602, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这种前景看好的疫苗在广泛传播方面面临着几个障碍，包括以目前的形式，它必须在超低温下储存。\n周一早些时候，辉瑞公司和BioNTech SE宣布成功发布中期数据后，分发由辉瑞公司和BioNTech SE开发的实验性新冠肺炎疫苗的工作正在加紧进行。\n但它不会很快出现在当地的药店，面向普通公众。\n这些数据推动美国股市创下历史新高，数据显示，这两家公司正在试验的疫苗在预防新冠肺炎方面有90%的有效性。他们仍在等待有关安全的数据，该数据可能会在本月晚些时候公布。\n辉瑞(Pfizer)和BioNTech需要获得监管机构的批准，才能开始向政府认为最需要的人运送疫苗。医护人员和住在养老院的人很可能位居榜首。\n但是，疫苗复杂而超低温的储存要求对美国最先进的医院来说也是一个障碍，可能会影响农村地区或资源紧张的贫穷国家何时何地提供疫苗。\n主要问题是，这种疫苗需要保持在零下70摄氏度或更低的温度，这种疫苗基于一种新技术，使用合成的mRNA来激活免疫系统对抗病毒。\n约翰·霍普金斯卫生安全中心的高级学者阿梅什·阿达尔贾(Amesh Adalja)说，冷链将是提供这种疫苗的最具挑战性的方面之一。\n这在任何情况下都将是一个挑战，因为即使在大城市的医院也没有超低温下的疫苗储存设施。\n事实上，美国最负盛名的医院之一，明尼苏达州罗切斯特的梅奥诊所(Mayo Clinic)表示，它目前没有这种能力。\n我们正在谈论的是一种需要储存在零下70或80度的疫苗。梅奥诊所的病毒学家和疫苗研究员格雷戈里·波兰博士说，这不仅在美国是一个巨大的后勤问题，在西方世界之外也是如此。\n我们是一个主要的医疗中心，我们没有这样的存储容量。这对每个人都是正确的。这是一个后勤障碍。\n辉瑞发言人Kim Bencker表示，该公司正在与美国政府和州政府官员密切合作，研究如何将疫苗从其在美国、德国和比利时的分销中心运往全球。\n她说，详细的计划包括使用干冰在推荐温度下通过空中和陆地运输冷冻疫苗瓶长达10天。\nBencker女士说，它们可以在超低温冰箱里保存长达6个月，或者在2到8摄氏度之间保存5天--这是医院常见的一种冷藏方式。\n她说，辉瑞的储藏单元也可以再加冰长达15天。\n但在略高于冰点的正常冷藏温度下，镜头将在大约5天内变质。BioNTech首席执行官乌格尔·沙欣(Ugur Sahin)告诉路透社，两家公司正在分析是否可以将期限延长两周。\nModelna Inc.正在研发一种基于类似技术的疫苗，该公司的疫苗不需要在如此低的温度下储存。\n其他疫苗，包括强生公司和Novavax公司的疫苗，可以储存在2-8摄氏度，也就是普通冰箱的温度。\n纽约一家大型医院系统诺斯韦尔健康公司(Northwell Health)正在扩大其超低温存储能力。尽管在疫苗变质之前部署疫苗是可能的，但诺斯韦尔首席药剂师奥尼西斯·斯特法斯(Onisis Stefas)表示，医院认为冰箱通道将确保顺利推出。\n专家表示，冷藏要求可能会阻碍辉瑞进入农村医疗系统和疗养院，或者不太富裕的国家，这些国家可能没有资金建造制冷设备。\n如果辉瑞的疫苗是未来几个月内唯一获得批准的疫苗，我们确实担心在农村地区推广疫苗的公平性，“免疫管理者协会(Association Of Immunization Managers)的执行董事克莱尔·汉南(Claire Hannan)表示。该协会是一家游说当地公共卫生官员处理疫苗的组织。\n斯特法斯表示，由于医院争相进货，超低温冰箱的供应已经有限。\n根据各州提交给美国疾病控制中心(US Centers For Disease Control)的公开文件，一些州表示，他们缺乏超低温冰箱。\n文件显示，新罕布夏州已经购买了额外的超冷冰箱，和其他州一样，正在游说特朗普政府提供额外资金。\n加州还表示，超低温冰箱的供应是有限的，大约一半的州卫生部门正在考虑购买或租赁更多的冷藏用品。\n它提议建立一个超冷冰箱分销网络，包括移动疫苗接种诊所，以覆盖全州服务不足的地区。加州表示，不会向没有足够冷藏能力的设施提供疫苗供应。\n汉南表示，如果没有额外的设备，医生将面临两难境地：将疫苗储存在标准冰箱中，在不到五天的时间内将所有975剂疫苗部署到每个辉瑞的疫苗容器中，或者用干冰补充它们，每天只打开两次，以延长疫苗的寿命。\n我认为这将是困难的，但基于任务及其重要性，人们将尽其所能实现这一目标，斯特法斯表示。\n澳大利亚人必须与其他人保持至少1.5米的距离。检查您的司法管辖区对收集限制的限制。\n如果你有感冒或流感的症状，请呆在家里，打电话给你的医生或拨打冠状病毒健康信息热线1800 020080安排测试。\n请查看您所在州或地区的相关指南：新南威尔士州、维多利亚州、昆士兰州、西澳大利亚州、南澳大利亚州、北领地、亚利桑那州、塔斯马尼亚州。", "note_en": "The promising vaccine faces several hurdles to widespread distribution, including the fact that in its current form, it must be stored at ultra-cold temperatures.\n    Work to distribute the experimental COVID-19 vaccine developed by Pfizer Inc and BioNTech SE is gearing up after  the companies announced successful interim data earlier on Monday.\n But it will not be coming to local pharmacies for the general public any time soon.\n The data, which sent US stocks to record highs, showed the two companies&#39; experimental vaccine is 90 per cent effective at preventing COVID-19. They are still awaiting data on safety, which could come later this month.\n Pfizer and BioNTech need to get regulators to sign off on the shot before it can start shipping vaccines to those considered most in need by government. Healthcare workers and people living in nursing homes will likely top that list.\n  But the vaccine&#39;s complex and super-cold storage requirements are an obstacle for even the most sophisticated hospitals in the United States and may impact when and where it is available in rural areas or poor countries where resources are tight.\n The main issue is that the vaccine, which is based on a novel technology that uses synthetic mRNA to activate the immune system against the virus, needs to be kept at minus 70 degrees Celsius or below.\n &#34;The cold chain is going to be one of the most challenging aspects of delivery of this vaccination,&#34; said Amesh Adalja, senior scholar at Johns Hopkins Centre for Health Security.\n &#34;This will be a challenge in all settings because hospitals even in big cities do not have storage facilities for a vaccine at that ultra-low temperature.&#34;\n  Indeed, one of the most prestigious US hospitals, the Mayo Clinic in Rochester, Minnesota, said it does not currently have that capability.\n &#34;We&#39;re talking about a vaccine that needs storage at minus 70 or 80. That&#39;s a tremendous logistical issue not only in the US but outside the Western world,&#34; said Dr Gregory Poland, a virologist and vaccine researcher with the Mayo Clinic.\n &#34;We&#39;re a major medical centre and we don&#39;t have storage capacity like this. That will be true for everybody. This is a logistical obstacle.&#34;\n  Pfizer spokeswoman Kim Bencker said the company was working closely with the US government and state officials on how to ship the vaccine from its distribution centres in the United States, Germany and Belgium around the globe.\n The detailed plan includes using dry ice to transport frozen vaccine vials by both air and land at their recommended temperatures for up to 10 days, she said.\n   They can be kept in an ultra-low temperature freezer for up to six months, or for five days at between two and 8 degrees Celsius – a type of refrigeration commonly available at hospitals, Ms Bencker said.\n The Pfizer storage units can also be refilled with ice for up to 15 days, she said.\n  But shots will spoil in around five days at normal refrigeration temperatures of slightly above freezing. BioNTech CEO Ugur Sahin told Reuters the companies are analysing if they can extend that for two weeks.\n The vaccine of Moderna Inc, which is working on a vaccine based on similar technology, does not need to be stored at such a low temperature.\n Other vaccines including ones from Johnson &amp; Johnson and Novavax Inc can be stored at 2-8 degrees Celsius, the temperature of a regular refrigerator.\n  Northwell Health, a major hospital system in New York, is expanding its ultra-cold storage capacity. Although it is possible to deploy the vaccine before it spoils, Northwell Chief Pharmacy Officer Onisis Stefas said the hospital decided the freezer access would ensure a smooth rollout.\n The cold storage requirements could impede Pfizer’s ability to reach rural healthcare systems and nursing homes, or less wealthy nations, which may not have the funds for the refrigeration units, experts said.\n &#34;If Pfizer’s is the only vaccine to be authorised in the next few months, we do worry about equity when it comes to spreading it to rural areas,” said Claire Hannan, executive director at the Association of Immunisation Managers, a lobbying group for local public health officials who handle vaccines.\n Ultra-cold freezer supplies are already limited as hospitals scramble to stock up, Mr Stefas said.\n Some states have said they have a shortage of ultra-cold freezers, according to public documents that states filed with the US Centres for Disease Control.\n  New Hampshire has purchased extra ultra-cold freezers and like other states is lobbying the Trump administration for additional funds, the documents show.\n California has also said ultra-cold freezer supplies are limited and roughly half of the states’ health departments are looking in to purchasing or leasing additional cold storage supplies.\n It has proposed building a distribution network of ultra-cold freezers, including mobile vaccination clinics, to reach underserved areas around the state. California said it will not provide vaccine supplies to facilities without adequate cold-storage capabilities.\n Without the extra equipment, doctors will have a dilemma: store vaccines in standard refrigerators and deploy all 975 doses in each Pfizer vaccine container in less than five days or restock them with dry ice and open them only twice a day to extend the vaccines’ life span, Ms Hannan said.\n &#34;I think it will be difficult, but based on the task and how important it is, people will do the best to their ability to make that happen,&#34; Mr Stefas said.\n People in Australia must stay at least 1.5 metres away from others. Check your jurisdiction&#39;s restrictions on gathering limits.\n If you are experiencing cold or flu symptoms, stay home and arrange a test by calling your doctor or contact the Coronavirus Health Information Hotline on 1800 020 080.\n  Please check the relevant guidelines for your state or territory:  NSW, Victoria,  Queensland,  Western Australia,  South Australia,  Northern Territory,  ACT,  Tasmania.", "posttime": "2020-11-12 02:29:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "病毒,冠状病毒,coronavirus,疫苗", "title": "为什么辉瑞的冠状病毒疫苗可能不会很快上市", "title_en": "Why Pfizer's coronavirus vaccine may not be available any time soon", "transed": 1, "url": "https://www.sbs.com.au/news/why-pfizer-s-coronavirus-vaccine-may-not-be-available-to-the-general-public-any-time-soon", "via": "", "real_tags": ["病毒", "冠状病毒", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "bf7cf32e8d3c1b873004d674c9244f7c.png", "infoid": 1034601, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在北美市场销售的大约35万个环形门铃昨天发布了安全召回令。具体地说，安装不当的第二代环形门铃可能会起火，导致财产损失和潜在的烧伤危险。然而，这是一次相当不同寻常的召回--而且并不要求消费者退还手机。\n只要环门铃是用设备本身提供的螺丝安装的，它们就没问题。问题是，相当多的房主用自己的螺丝替换了套装中的螺丝--而且更长的螺丝可能会触及Ring设备内部他们不应该使用的地方，导致短路，可能导致过热或起火。\nRING向美国消费品安全委员会(US Consumer Product Safety Commission)报告称，它收到了85起涉及使用不当螺丝的事故报告，其中23起点火事件涉及轻微财产损失，8起轻微人身烧伤。\n受到安全通知的具体型号是5UM5E5，消费者可以通过在这里输入序列号来检查他们的铃声门铃是否包括在内-但考虑到安全问题的性质，型号本身并不真正重要。问题是，螺丝进入设备本身的主体-使用错误的螺丝长度或设计来穿透任何电子设备的机箱都可能导致短路和起火。", "note_en": "Approximately 350,000 Ring doorbells sold in the North American markets are subject to a  safety recall issued yesterday. Specifically, improperly installed 2nd-generation Ring doorbells can catch fire, causing property damage and potential burn hazards. This is a fairly unusual recall, however—and one that doesn&#39;t require consumers to return their devices.\n As long as the Ring doorbells were installed using the screws provided with the devices themselves, they&#39;re fine. The issue is that quite a few homeowners substituted their own screws for the ones included in the package—and longer screws may reach places inside the Ring device that they shouldn&#39;t, causing a short-circuit that can lead to overheating or fire.\n Ring reports to the US Consumer Product Safety Commission that it has received 85 incident reports involving use of improper screws, with 23 cases of ignition involving minor property damage and eight cases of minor personal burns.\n The specific model subject to the safety notice is model number 5UM5E5, and consumers can check to see if their Ring doorbell is included by entering its serial number  here—but given the nature of the safety issue, the model itself isn&#39;t really important. The issue is that the screws enter the body of the device itself—and using the wrong screw length or design to penetrate the chassis of  any electronic device can cause short-circuiting and fire.", "posttime": "2020-11-12 02:14:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "门铃,installed,螺丝", "title": "安装不当的环形门铃着火了", "title_en": "Improperly installed Ring doorbells are catching on fire", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/11/ring-doorbells-installed-with-the-wrong-screws-may-catch-fire/", "via": "", "real_tags": ["门铃", "installed", "螺丝"]}]