[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1072546, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我有一个Flux3D Beamo 30W CO2激光器。我使用金属雕刻预设（50％功率，80mm / s速度）。", "note_en": "I have a  Flux3D Beamo 30W CO2 laser. I use the metal engraving preset (50% power, 80mm/s speed).\n A light coat of mineral oil before engraving makes them shiny, if that’s the look you want.", "posttime": "2022-01-10 03:26:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "芯片,激光雕刻,collection,金属", "title": "Macrochips：激光雕刻的集合，4英寸板岩瓦片微芯片沿岸", "title_en": "Macrochips: A collection of laser engraved, 4 inch slate tile microchip coasters", "transed": 1, "url": "https://www.evilgeniuslabs.org/macrochips", "via": "", "real_tags": ["芯片", "激光雕刻", "金属"]}, {"category": "", "categoryclass": "", "imagename": "d5ac22b6724f715986d70f6c316f3742.jpg", "infoid": 1072545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "空间Cadet Pinball在许多Windows爱好者的心中有一个特殊的地方。客户使用他们的支持合同询问如何在太空Cadet Parball中的三个级别中改变。我最骄傲的Windows XP正在修复游戏，因此它没有消耗100％的CPU。人们一直在询问它是否可以带回。\nAlpha AXP在内部为64位处理器。只需32位窗口仅使用32位子集即可。", "note_en": "Space Cadet Pinball has a special place in the hearts of many Windows enthusiasts. A customer used their support contract to ask   how to change among the three levels of play in Space Cadet Pinball. My proudest achievement of Windows XP was   fixing the game so it didn’t consume 100% CPU. People keep asking   if it can be brought back.\n One point of contention is over my claim that   I removed Pinball from Windows because I couldn’t get the 64-bit version to work. Retrocomputing enthusiast   NCommander even undertook a   Zapruder-level analysis of all of the 64-bit versions of Windows he could find to prove or disprove my story.\n I was amazed at the level of thoroughness (and the fortitude it required to get those Itanium systems up and running, much less debug them), but there’s one version of 64-bit Windows that NCommander didn’t try out, and that’s the one that’s relevant to the story.\n When the 64-bit Windows project started, there was no Itanium hardware yet. The only way you could run any Itanium code was to run it in a simulator. Booting Windows on an Itanium simulator took forever. Clearly not the development environment you wanted when porting millions of lines of code.\n On the other hand, the Windows team did have access to a lot of copies of another 64-bit processor: The Alpha AXP.\n In 1999, Compaq announced that   it would no longer support Windows on the Alpha AXP, which left a lot of Windows team members with cumbersome paperweights on their desks.\n  \n The Alpha AXP is internally a 64-bit processor. It’s just that 32-bit Windows used only the 32-bit subset.\n  Now, 64-bit Windows on the Alpha AXP would never ship. But the Alpha AXP did have the advantage of  existing in physical form, so the system could finish booting before the heat death of the universe. The assumption is that most of the effort in porting Windows to the Itanium is in the 32-bit to 64-bit transition, and not in dealing with quirks of the specific 64-bit processor you are porting to.\n The assumption was somewhat validated by experience: The 32-bit Windows code base had been ported to many 32-bit processors, with relatively few architecture-specific issues. Once you got a 64-bit version of Windows working for the Alpha AXP, it should be a comparatively small amount of additional work to port it to Itanium. The hard part was going from 32-bit to 64-bit.\n The team set to work, and we had 64-bit Windows running on physical Alpha AXP hardware long before we had any physical Itanium hardware. I could test my 64-bit port on a physical Alpha AXP system to validate that it was successful. And that’s the system that had the broken collision detector.\n NCommander did find a collision detection bug on the Itanium, although that bug was nowhere as severe as the one that existed on the Alpha AXP. My guess is that it had to do with the default rounding mode established by the C runtime library.\n My theory as to what happened is that some time after I removed Pinball from the product, the C runtime team realized that they had a compatibility bug in the way they set the default rounding mode, and they fixed it. Or maybe there was a compiler bug, and the compiler team fixed that. Whatever the problem was, somebody fixed it, and then they went back and re-tested Pinball with this fix, and everything worked great, so they put Pinball back.\n I’m just guessing about what happened afterward because nobody informed me that they had gotten Pinball working and added it back. I just assumed that it was gone forever.", "posttime": "2022-01-10 03:25:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "windows,空间,gaps,cadet", "title": "在64位窗口上填充空间Cadet Pinball故事中的一些空白", "title_en": "Filling in some gaps in the story of Space Cadet Pinball on 64-bit Windows", "transed": 1, "url": "https://devblogs.microsoft.com/oldnewthing/20220106-00/?p=106122", "via": "", "real_tags": ["windows", "空间", "gaps", "cadet"]}, {"category": "", "categoryclass": "", "imagename": "2f96b034c675a9ba40e7c30ea4bd03d5.png", "infoid": 1072544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "顾名思义，电源远程桌面是一个完全以PowerShell编码的远程桌面应用程序。\n我还将提高注释和记录（详细/正常文本），并尝试支持光标状态监视器（在查看器上显示远程光标状态）。\n我们正在尽力准备这个应用程序的内容。然而，Phrozen Sasu不能不讲过内容的表达和建议，以及其准确性。在法律允许的范围内，Phrozen SASU不得责任任何损失和/或损失，因为有关信息的使用我们的应用程序。", "note_en": "As the name suggests, Power Remote Desktop is a Remote Desktop application entirely coded in PowerShell.\n It does not rely in any existing remote desktop application / protocol to function. It is a remote desktop application completely coded from scratch.\n Even the Viewer part (Including the GUI) is coded in PowerShell with the help of WinForms API.\n ⚠️ This project is actually in its very beginning. Do not use it under a production environment until version is marked as final / stable version.\n    Support custom SSL/TLS Certificate (File or Encoded in base64). If not specified, a default one is generated and installed on local machine (requires Administrator privileges)\n  Server client acquirement system is temporary, it works perectly fine (if nothing interfer with normal handshake). I will implement in final version the real client handler system in a separated thread to avoid possible and very rare dead locks.\n I will also implement a Read / Write Timeout system followed by a Keep-Alive system to detect ghost connections and avoid again rare dead locks.\n I will also improve comments and logging (verbose / normal text) and try to support cursor state monitor (to display the remote cursor state on viewer).\n  * [EASY] Add option for TLS v1.3. * [EASY] Version Synchronization.* [EASY] Support Password Protected external Certificates.* [EASY] Server Fingerprint Authentication.* [EASY] Mutual Authentication for SSL/TLS (Client Certificate).* [EASY] Improve Error Control Flow. * [EASY] Synchronize Cursor State.* [EASY] Improve Comments.* [EASY] Better detail on Verbose with possibility to disable verbose.* [EASY] Synchronize Clipboard. * [EASY] Handle new client acceptation on a separated Runspace to avoid locks which could cause DoS of the Service. This will be naturally fixed when I will implement my final version of client Connection Handler system.* [MEDIUM] Keep-Alive system to implement Read / Write Timeout.* [MEDIUM] Improve Virtual Keyboard.* [MEDIUM] Avoid Base64 for Desktop Steaming (Only if 100% Stable). It sounds obvious that writing RAW Bytes using Stream.Write is 100% stable but strangely locally it worked like a charm but while testing remotely, it sometimes acted funny. I will investigate about this issue and re-implement my other technique. * [MEDIUM] Server Concurrency.* [MEDIUM] Listen for local/remote screen resolution update event.* [MEDIUM] Multiple Monitor Support.* [MEDIUM] Improve HDPI Scaling / Quality.* [MEDIUM+] Motion Update for Desktop Streaming (Only send and update changing parts of desktop).\n  You can use this script both as a PowerShell Module or Raw Script (Pasted, from Encoded Base64 String, DownloadString(...) etc...).\n               DisableInputControl: If set to $true, this option disable control events on form (Mouse Clicks, Moves and Keyboard). This option is generally to true during development when connecting to local machine to avoid funny things.\n       CertificateFile: A valid X509 Certificate (With Private Key) File. If set, this parameter is prioritize.\n If no certificate option is set, then a default X509 Certificate is generated and installed on local machine (Requires Administrative Privilege)\n     Passing your own X509 Certificate is very useful if you want to avoid running your PowerShell Instance as Administrator.\n             We are doing our best to prepare the content of this app. However, PHROZEN SASU cannotwarranty the expressions and suggestions of the contents, as well as its accuracy.In addition, to the extent permitted by the law, PHROZEN SASU shall not be responsiblefor any losses and/or damages due to the usage of the information on our app.\n By using our app, you hereby consent to our disclaimer and agree to its terms.\n Any links contained in our app may lead to external sites are provided forconvenience only. Any information or statements that appeared in these sitesor app are not sponsored, endorsed, or otherwise approved by PHROZEN SASU.For these external sites, SubSeven Legacy cannot be held liable for theavailability of, or the content located on or through it.Plus, any losses or damages occurred from using these contents or the internetgenerally.", "posttime": "2022-01-10 03:23:49", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编码,desktop,应用程序", "title": "远程桌面编码为PowerShell", "title_en": "Remote Desktop Coded in PowerShell", "transed": 1, "url": "https://github.com/DarkCoderSc/PowerRemoteDesktop", "via": "", "real_tags": ["编码", "desktop", "应用程序"]}, {"category": "", "categoryclass": "", "imagename": "221cb13362adbef936339b077b8d973c.jpg", "infoid": 1072543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个顾问麻醉师告诉Sajid Javid，他不会对Covid接种疫苗，并对强制要求不满意。詹姆斯告诉......", "note_en": "A Consultant Anaesthetist has told Sajid Javid that he will not get vaccinated against COVID and is unhappy at the mandatory requirement.Steve James told the...", "posttime": "2022-01-10 03:23:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "医生,doctor,告诉", "title": "NHS医生告诉健康秘书他不会被刺戳[视频]", "title_en": "NHS doctor tells Health Secretary he won't get jabbed [video]", "transed": 1, "url": "https://www.youtube.com/watch?v=hOlEYcd1nyI", "via": "", "real_tags": ["医生", "doctor", "告诉"]}, {"category": "", "categoryclass": "", "imagename": "32f30a2aef073582e1d73988f039c5df.png", "infoid": 1072542, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1月2022年1月释放Dietpi删除了对Debian Slay的支持，并为整个平台带来了增量改进。\nDietpi-Dashboard添加了一个选项可从一个前端Web界面查看多个仪表板节点。与此相关，现在可以仅安装后端，从而减少内存使用情况，并使不可能手动访问后端API之外的节点。\nDietpi图像| Parallels Desktop（MacOS）新虚拟机映像在麦斯卡斯的Parallels Desktop。\nDIETPI-SOFTWARE | kodi解决了一个问题，后续kodi重新安装了config.txt中的KMS覆盖设置的CMA参数的重复项。在DITEPI更新期间修改重复项。\nDIETPI-SOFTWARE | MyMPD解决了由于更新依赖性而安装失败的问题。非常感谢@Supersexy报告此问题：Michaing / Dietpi＃5115", "note_en": "January 2022 release of DietPi removes support for Debian Stretch and brings an incremental improvement to the overall platform.\n    Support for Debian Stretch has been removed starting with v8.0. This change allowed us to do a major code cleanup and migrate to some newer methods in different areas which are only available on Buster and above.\n Debian 9 “Stretch” was released in 2017, and it has been initially superseded by Debian 10 “Buster”, and then Debian 11 “Bullseye”.\n DietPi v7.9 was the last release with support for Debian Stretch.  DietPi v8.0 and later require Debian Buster or newer.\n Read our article   Why you should upgrade your Stretch system now to learn more about the need to make this upgrade and you could do this easily to Debian Buster and even further to latest version ( Debian Bullseye).\n  Network    For new images, the default DHCP timeout is not reduced to 10 seconds anymore. This could have been too short, in which case network targets of the boot sequence are reached before an IP has been actually assigned. Especially in case of  AUTO_SETUP_AUTOMATED=1 this could have lead to connection test timeouts and hence abortion of the automated first run setup. Many thanks to  @jpeg2600 for reporting such a case:  MichaIng/DietPi#5143\n DietPi-Config    When configuring a first WiFi slot via scanning for SSIDs, the WiFi adapter is now not brought up via  ifup but  ip l dev wlanX up. This way no DHCP and WPA client starts are triggered, which are doomed to fail when the WiFi adapter is not connected to any access point yet. Especially in case of the default 60 seconds DHCP timeout, this would otherwise cause an unnecessary long delay.\n DietPi-Dashboard    Added an option to view multiple dashboard nodes from one frontend web interface. Related to this, the backend can now be installed only, reducing memory usage and making it impossible to manually access the node outside of the backend API.\n DietPi-Print_large    This new script has been added which can be executed or sourced from  /boot/dietpi/func/dietpi-print_large to print the string passed via first argument in large  figlet style fonts. It currently only supports the characters a-z, A-Z, 0-9, dot and dash, i.e. those commonly allowed in hostnames.\n DietPi-Banner    Added an option to print the system’s hostname in large  figlet style fonts, right below the banner header. In case it is enabled as well, the regular/small hostname line will then be skipped. Many thanks to  @matellis for implementing this feature:\n DietPi-Software |  Mono    mono-complete won’t be installed anymore but only  mono-devel instead. This skips the  XSP4 webserver service, which listens on port 8084 by default where it conflicts with File Browser. This only affects new installations. You can manually apply this change running next command:\n DietPi-Software |   FuguHub    The outdated official installer has been replaced with a fully automated own setup, removing the obsolete or even harmful interactive dialogues. On fresh installs, an admin account  dietpi with global software password is created as well.\n DietPi-Software |   myMPD    Installation is now done via official APT repository, which means quicker install compared to compiling from source, fewer dependencies and easier updates via  apt upgrade:  MichaIng/DietPi#5115\n DietPi-Software |   Airsonic    Since the project has been archived by its maintainer and suffers from the critical  Log4Shell security vulnerability, we moved to the advertised fork “Airsonic-Advanced” which also enables compatibility with Java 17 and hence Debian Bullseye. Airsonic will be reinstalled as part of the DietPi update to apply the migration. All data and settings will be preserved and migrated automatically.\n DietPi images |   Parallels Desktop (macOS)    New Virtual Machine image for Parallels Desktop on macOS.\n  Raspberry Pi    Resolved an issue where unintentionally the turbo mode was enabled. This got backported to v7.9, to our existing RPi images and via live patch. Many thanks to  @ayo-x and  @whyisthisbroken for reporting this issue:  MichaIng/DietPi#5088\n DietPi-FS_partition_resize    Resolved an issue where in some cases the boot partition failed to mount on first boot since after the partition resize the system in some cases didn’t get sufficient time to fully apply the change before continuing with the boot mount attempt. Many thanks to  @Mausy5043 and  @sistemicorp for reporting this issue:  MichaIng/DietPi#5006\n DietPi-Config    Resolved an issue where on Raspberry Pi, when the full KMS display driver is used, the sound card selection could have been falsely applied. With full KMS enabled, for each HDMI port an additional HDMI sound card appears (replacing the regular firmware HDMI sound device), even when no HDMI device is attached and with onboard audio disabled. This lead to an increase of external sound card indices. The appearance of the KMS HDMI sound cards is now aligned with the onboard firmware HDMI sound cards, i.e. if not onboard  auto or HDMI is selected in  dietpi-config, now the KMS HDMI sound devices are disabled as well, making use of the  noaudio device tree overlay parameter.\n DietPi-Software Resolved an issue where on first boot, choice and preference menu selections triggered an error as the install state file did not exist yet. Many thanks to  @bsheeres for reporting this issue:  MichaIng/DietPi#5080\n Resolved an issue where the deprecated  AUTO_SETUP_FILE_SERVER_INDEX option in  dietpi.txt file was applied inverted.  -1 should have installed  ProFTPD and  -2 Samba, while it was done the opposite way. However, note that this setting is not present on current images and deprecated. Use  AUTO_SETUP_INSTALL_SOFTWARE_ID instead to mark any one or multiple file servers for automatic install. Many thanks to  @bsheeres for reporting this issue:  MichaIng/DietPi#5081\n Browsers - On the ARMv6 Raspberry Pi models Raspberry Pi 1 and Zero (1) since Bullseye,  Chromium and  Firefox fail to start due to hardware and build limitations which are outside of our control. Since those are currently the only two browser available from  dietpi-software, they have been disabled together with the browser preference menu for those systems, until we find and implement a good additional compatible browser. Further info:  RPi-Distro/chromium-browser#21.\n DietPi-Software |   Kodi    Resolved an issue where subsequent Kodi reinstalls created duplicates of the  CMA parameter for the KMS overlay setting in  config.txt. The duplicates are patched out during DietPi update.\n DietPi-Software |   Docker    Resolved an issue where the install was aborted due to an incorrect check for missing kernel modules. Many thanks to  @dragonandy for reporting this issue:  MichaIng/DietPi#5061\n DietPi-Software |   Pi-hole    Resolved an issue where the teleporter import log was not shown but denied by the X-Frame-Options header:  https://discourse.pi-hole.net/t/unable-to-restore-teleporter-backup-fresh-install-no-funky-changes-made/51573\n DietPi-Software |   Blynk Server    Resolved an issue on ARMv6 RPi models where the install failed as the latest Blynk Server release does not contain a Java 8 build. Since the older Java 8 build does not contain a native Log4Shell vulnerability mitigation, it is added server-wise on these systems.\n DietPi-Software |   Mycroft AI    Resolved an issue on Bullseye (and above) systems where  mycroft-cli-client command fails with a permissions issue, even as root user. Many thanks to  @berndverhofstadt for reporting this issue:  MichaIng/DietPi#5100\n DietPi-Software |   Nukkit    Resolved an issue where the install failed due to a changed download URL. The Jenkins instance has moved to  ci.opencollab.dev, where also the Geyser and Floodgate projects are hosted.\n DietPi-Software |   FuguHub    Resolved an issue where the uninstall failed as the process was not stopped as intended. Many thanks to  @kd9352 for reporting this issue:  MichaIng/DietPi#5058\n DietPi-Software |   myMPD    Resolved an issue where the installation failed due to an updated dependency. Many thanks to  @supersexy for reporting this issue:  MichaIng/DietPi#5115\n DietPi-Software |   Python 3    Worked around an issue where the  pip reinstall failed. Many thanks to  @hueppinr for reporting this issue:  MichaIng/DietPi#5117\n DietPi-Software |   Unbound    Resolved an issue where the  unbound-resolvconf service applied localhost automatically as local name server, if the  resolvconf package was installed. Since often Unbound is installed in combination with Pi-hole or AdGuard Home, and those are usually used by network clients only, not the server itself,  unbound-resolvconf is disabled now on Unbound installs. If Unbound is wanted as local resolver as well, it should be explicitly configured, e.g. via dietpi-config network options. Many thanks to  @Ianszh for reporting this issue:  MichaIng/DietPi#5133\n DietPi-Software |   Mosquitto    Applied a workaround on ARMv6 where the latest Mosquitto packages from the official APT repository are not ARMv6-compatible. Many thanks to  @thomasmockridge for reporting this issue:  MichaIng/DietPi#5140\n As always, many smaller code performance and stability improvements, visual and spelling fixes have been done, too much to list all of them here. Check out all code changes of this release on GitHub:  MichaIng/DietPi#5137\n  DietPi-Config    Enabling WiFi + Ethernet adapters, both on different subnets, breaks WiFi connection in some cases:  MichaIng/DietPi#2103\n For all additional issues that may appear after release, please see the following link for active tickets:  https://github.com/MichaIng/DietPi/issues", "posttime": "2022-01-10 03:18:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "os,dietpi", "title": "Dietpi OS V8.0已被释放", "title_en": "DietPi OS v8.0 has been released", "transed": 1, "url": "https://dietpi.com/docs/releases/v8_0/", "via": "", "real_tags": ["os", "dietpi"]}]