[{"category": "", "categoryclass": "", "imagename": "", "infoid": 1068746, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这个子堆栈是关于什么的？以下是前 25 期的最佳创意列表。一些社交网络有一个友谊的概念，根据定义，这是相互的。你可以向某人发送“好友请求”，如果他们接受，那么你们两个就成为“好友”。 （有一个单独的追随者概念，它可能是单向的：你可以是我的追随者，但我可能是也可能不是你的追随者；这是微不足道的模型。）我今天想讨论一种共同的友谊，因为它构成几个有趣的问题。首先，让我们从要求开始。我们有以下典型的操作和查询： 我们可以将相互的友谊表示为一对有向友谊：Alice 是 Bob 的朋友，Bob 是 Alice 的朋友。我们可以设计如下物理表： CREATE TABLE Friendship ( user1_id INTEGER NOT NULL, user2_id INTEGER NOT NULL, PRIMARY KEY (user1_id, user2_id)); DELETE FROM FriendshipWHERE (user1_id = 3 AND user2_id = 5) OR (user1_id = 5 AND user2_id = 3);\n我们再看一下 Alice 和 Bob 的好友关系登记表的内容： 好吧，好吧，但是这不是（不寒而栗）数据重复吗？我们的代码保证每一行都有一个对应的对称行；我们可能认为第二行是多余的。那么让我们研究一下单行设计。创建表相互友谊（user1_id INTEGER NOT NULL，user2_id INTEGER NOT NULL，PRIMARY KEY（user1_id，user2_id））；我们希望每一个相互的友谊都有一行。那么，会是：？选择随机顺序不是一个好主意，因为这两种可能性最终都有可能被插入，这意味着什么？它将如何影响我们的典型查询？我们可以决定我们总是在 user1_id 中插入一个较小的 ID，在 user2_id 中插入较大的 ID。甚至可以通过在我们的表上定义 CHECK 约束来在数据库级别强制执行此操作： CREATE TABLE 相互友谊 ( user1_id INTEGER NOT NULL, user2_id INTEGER NOT NULL, PRIMARY KEY (user1_id, user2_id), CONSTRAINT user1_user2_ids CHECK (user1_id) &lt; user2_id) ;\n（但当然，如果您可以以其他方式保证代码中的这种不变性，则这不是必需的）。如果我们的不变量得到保证，我们可以通过以下查询获得 Alice 的朋友列表： 这个查询的第一个版本有问题，因为我不小心使用了看起来很明显的条件“WHERE user1_id = 5 OR user2_id = 5”。这个条件是错误的。顺便说一句，从实用的角度来看，为了提高这个查询的性能，我们还应该创建第二个表索引。第一个由主键约束提供。第二个将是“INDEX (user2_id, user1_id)”。此索引也将提高以下查询的性能。要确定 Alice 和 Bob 是否是朋友，我们将使用以下查询： 为了使此查询起作用，我们的代码必须确保第一个 ID 小于第二个 ID。因此，如果我们有某种函数可以接受两个任意 ID，则该函数需要对两个 ID 进行排序并以正确的顺序传递它们。如果我们不想或不能对代码中的 ID 进行排序，我们必须考虑 SQL 中的两个选项：\nSELECT 1FROM Mutual_friendshipWHERE (user1_id = $ID1 AND user2_id = $ID2) OR (user1_id = $ID2 AND user2_id = $ID1) 这只适用于我们可以在我们的代码中预处理一对 ID 从而保证第一个 ID 是比第二个小。否则，我们必须明确地写出 OR 条件。我们在这里看到，对于这两种模型，我们都需要实现保持不变的函数来建立和删除友谊。然后我们必须确保只能通过这些函数更改数据。至于查询：如果您需要，两行模型对于临时手动和分析查询似乎要简单得多（这是一件好事）。单行模型很快就会变得乏味，或者再次需要预处理。防止数据重复是人们在谈论数据库规范化时谈论的主要内容之一。如果您要与某人讨论在两种表示之间进行选择，那么肯定会出现这个问题，我们必须确定两行模型表示是否可以接受。我们可以通过维基百科的一个例子来说明数据重复的想法。假设我们有一个具有以下结构的锦标赛获胜者表： 这种结构不是第三范式：如果同一个人赢得了多次锦标赛，我们将多次存储他们的 DOB。这就是数据重复和不一致的根源：如果我们不小心为同一个人输入了两个不同的出生日期怎么办？\n为了规范这个模式，我们需要为运动员创建一个单独的表，具有以下结构：然后从锦标赛获胜者表中删除“获胜者出生日期”。这里发生了什么？现在，由于消除了数据重复，当需要更改单个数据时，将导致更改单个表值。如果我们发现其中一名运动员的出生日期不正确，我们只需要更改一个值。在非 3NF 形式中，这将需要更改无限数量的行，与他们赢得锦标赛的次数一样多。这里的关键字似乎是“无限”，它允许我们提出两行模型中没有（坏）数据重复。当我们添加或删除单个好友时，我们需要添加或删除固定数量的行，即两行。它不是无限的。我不确定这是否是每个人都可以接受的论点，我什至不确定最初的问题是否有效。坦率地说，这两种模型都感觉有些奇怪，它们强烈反对关系数据库建模的通常轻松性。也许这是因为表结构不直接处理的附加不变量？坦率地说，我有点期待有人会为这个问题提出一个更优雅的解决方案，我们都会学到新的东西。我们将在以后的帖子中调查其他一些类似的案例。我们希望找到描述这种情况的正确方法。\nPS：如果您是这个子堆栈的新手，请查看前 25 期的最佳创意列表。", "note_en": "What is this substack about? Here is   the list of best ideas from the first 25 issues.\n  Some social networks have a concept of friendship which is mutual by definition.  You can send somebody a “friend request”, and if they accept it, then you two become “friends”.\n (There is a separate concept of followers, that could be unidirectional: you could be my follower, but I may or may not be your follower; this is trivially modelled.)\n I’d like to discuss a  mutual friendship today, because it poses a couple of interesting questions.  First, let’s begin with the requirements.  We have the following typical operations and queries:\n     We can represent mutual friendship as a pair of directed friendships: Alice is a friend of Bob, Bob is a friend of Alice.  We can design the following physical table:\n CREATE TABLE friendship (  user1_id INTEGER NOT NULL,  user2_id INTEGER NOT NULL,  PRIMARY KEY (user1_id, user2_id));\n            DELETE FROM friendshipWHERE (user1_id = 3 AND user2_id = 5) OR (user1_id = 5 AND user2_id = 3);\n Let’s look again at the table contents where Alice and Bob’s friendship is registered:\n  Well, well, well, but isn’t it a (shudder)  data duplication?  Our code guarantees that for every row there is a corresponding symmetric row; we may think that this second row is redundant.  Let’s investigate the single-row design then.\n   CREATE TABLE mutual_friendship (  user1_id INTEGER NOT NULL,  user2_id INTEGER NOT NULL,  PRIMARY KEY (user1_id, user2_id));\n  We want to have a single row for every mutual friendship.  So, would it be:\n    ?  Choosing a random order is not a good idea, because there is a chance that both possibilities would eventually get inserted, and what would that mean?  And how will it affect our typical queries?\n We can decide that we always insert a smaller ID into  user1_id, and larger ID into  user2_id. It’s even possible to enforce this on the database level by defining the CHECK constraint on our table:\n CREATE TABLE mutual_friendship (  user1_id INTEGER NOT NULL,  user2_id INTEGER NOT NULL,  PRIMARY KEY (user1_id, user2_id),  CONSTRAINT user1_user2_ids  CHECK (user1_id &lt; user2_id));\n (But of course, this is not necessary if you can guarantee this invariant in your code in some other way).\n  If our invariants are guaranteed, we can get the list of Alice’s friends by the following query:\n   The first version of this query was buggy, because I carelessly used the obvious-looking condition “ WHERE user1_id = 5 OR user2_id = 5”.  This condition is wrong.\n By the way, from the practical point of view, to improve the performance of this query we should also create a second table index.  The first one is provided by the primary key constraint.  The second one is going to be “ INDEX (user2_id, user1_id)”.  This index will improve the performance of the following query too.\n  To find out if Alice and Bob are friends, we will use the following query:\n  For this query to work, our code must make sure that the first ID is less than the second ID.  So if we have some kind of function that accepts two arbitrary IDs, this function needs to sort both IDs and pass them in the right order.\n If we don’t want or cannot sort the IDs in our code, we have to consider both options in the SQL:\n SELECT 1FROM mutual_friendshipWHERE (user1_id = $ID1 AND user2_id = $ID2) OR      (user1_id = $ID2 AND user2_id = $ID1)\n     This only works if we can pre-process a pair of IDs in our code and thus guarantee that the first ID is smaller than the second.  Otherwise, we must explicitly write the OR-condition.\n       We see here that for both models we need to  implement invariant-preserving functions to establish and delete friendships. Then we must ensure that the data could be changed only via those functions.\n As for querying: the two-row model seems to be  substantially simpler for ad-hoc manual and analytic queries, if you need those (and it’s a nice thing to have).  The single-row model will quickly become tedious or would again require pre-processing.\n  Preventing data duplication is one of the main things people talk about when they talk about database normalization. If you would discuss choosing between two representations with somebody, this question would most certainly come up, and we have to decide if the two-row model representation is acceptable.\n We can illustrate the idea of data duplication by an example from Wikipedia.  Suppose that we have a  table of tournament winners with the following structure:\n  This structure is  not in the third normal form: if the same person won multiple tournaments, we would store their DOB multiple times.  This is the source of data duplication and inconsistencies: what if we accidentally put two different dates of birth for the same person?\n To normalize this schema we need to create a separate  table for athletes, with the following structure:\n  And then remove the “Winner date of birth” from the table of tournament winners.\n What happened here?   Now, as the data duplication is eliminated, when a  single piece of data needs to be changed, it will lead to changing a  single table value.  If we discover that the date of birth of  one of the athletes is incorrect, we only need to change  one value.  In non-3NF form this would require changing an  unlimited number of rows, as many as the number of times they won tournaments.\n The keyword here seems to be “unlimited”, and it allows us to propose that  there is no (bad) data duplication in the two-row model.  When we add or remove a single friendship, we need to add or remove a constant number of rows, namely two.  It’s not unlimited.\n I’m not sure if that would be an acceptable argument for everyone, and I’m not even sure if the original question is valid.   Both of those models frankly feel somehow weird, they go strongly against the usual effortlessness of relational database modeling.  Maybe this is because of the additional invariants that are not handled directly by the table structure?\n Frankly, I kind of expect that somebody will just present a much more elegant solution for this problem, and we all would learn something new.\n We’re going to investigate some other similar cases in future posts.  Our hope is to find the right way to describe this kind of situations.\n  P.S.: If you’re new to this substack, take a look at   the list of best ideas from the first 25 issues.", "posttime": "2021-07-22 21:33:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "塑造,mutual,id", "title": "塑造相互友谊", "title_en": "Modeling mutual friendship", "transed": 1, "url": "https://minimalmodeling.substack.com/p/modeling-mutual-friendship", "via": "", "real_tags": ["塑造", "mutual", "id"]}, {"category": "", "categoryclass": "", "imagename": "f210e1e94a9a1050164d00832ca1bc4d.png", "infoid": 1068744, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Square Checking 账户由 FDIC 成员萨顿银行提供。 Square 借记卡是一种借记卡，可存取 Square Checking 账户中的资金，由 FDIC 成员萨顿银行发行；根据 Mastercard International Incorporated 的许可，可以在接受 Mastercard 的任何地方使用。通过 Square 的支付处理服务产生的资金通常在处理付款后立即在 Square 支票账户余额中可用。资金可用时间可能因技术问题而有所不同。 1Savings 账户由 FDIC 成员 Square Financial Services, Inc. 提供。 0.50% 的年收益率 (APY) 将适用于 2021 年 12 月 31 日，之后将适用当时有效的 APY，并且可能会发生变化。开户不需要最低存款，获得任何广告的APY也不需要最低余额。我们不收取月费。某些可能会减少帐户收入的可选高级功能可能会收取某些费用。储蓄账户由 FDIC 承保，最高可达 250,000 美元。所有贷款均由犹他州特许工业银行、FDIC 成员 Square Financial Services, Inc. 发行。每 60 天至少需要支付初始贷款余额的 1/18，并且需要在 18 个月内全额偿还贷款。实际费用取决于支付卡处理历史、贷款金额和其他资格因素。不保证贷款资格。所有贷款均须获得信贷批准。 Square、Square 徽标、Square Financial Services 和其他是 Square, Inc. 和/或其子公司的商标。 Square Financial Services, Inc. 是 Square, Inc. 的全资子公司。", "note_en": "Square Checking accounts are provided by Sutton Bank, Member FDIC. The Square Debit Card is a debit card that accesses the funds in the Square Checking account, and is issued by Sutton Bank, Member FDIC; pursuant to a license from Mastercard International Incorporated, and may be used wherever Mastercard is accepted. Funds generated through Square’s payment processing services are generally available in the Square checking account balance immediately after a payment is processed. Fund availability times may vary due to technical issues.\n 1Savings accounts are provided by Square Financial Services, Inc., Member FDIC. Annual percentage yield (APY) of 0.50% will apply until 12/31/2021, after which the APY in effect at that time will apply, and will be subject to change. No minimum deposit is required to open an account, and no minimum balance is required to obtain any advertised APY. We do not charge monthly fees. Certain fees may apply for optional, premium features that may reduce account earnings. Savings accounts are FDIC-insured up to $250,000.\n All loans are issued by Square Financial Services, Inc., a Utah-chartered Industrial Bank, Member FDIC. A minimum payment of 1/18th of the initial loan balance is required every 60 days, and full loan repayment is required within 18 months. Actual fee depends upon payment card-processing history, loan amount and other eligibility factors. Loan eligibility is not guaranteed. All loans are subject to credit approval.\n Square, the Square logo, Square Financial Services, and others are trademarks of Square, Inc. and/or its subsidiaries. Square Financial Services, Inc. is a wholly-owned subsidiary of Square, Inc.", "posttime": "2021-07-22 21:33:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "广场,square", "title": "广场银行", "title_en": "Square Banking", "transed": 1, "url": "https://squareup.com/us/en/banking", "via": "", "real_tags": ["广场", "square"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068743, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Stockfish 项目坚信免费和开源软件和数据。协作使该引擎成为世界上最强大的国际象棋引擎。我们使用 GNU 通用公共许可证第 3 版 (GPL) 许可我们的软件，旨在保证所有国际象棋爱好者可以自由使用、共享和更改程序的所有版本。不幸的是，并非所有人都认同这种开放愿景。我们已经意识到，ChessBase 对他们的客户隐瞒了 Stockfish 作为其产品关键部分的真正来源（另请参阅我们和 Lichess、Leela Chess Zero 和 Stockfish 联合团队的早期博客文章）。事实上，很少有客户知道他们在购买 Fat Fritz 2 或 Houdini 6（两种 Stockfish 衍生产品）时获得了 Stockfish 的修改版本，因此他们有充分的理由感到不安。 ChessBase 一再违反 GPL 的核心义务，以确保软件的用户被告知他们的权利。这些权利在许可中是明确的，包括访问相应来源的权利，以及免版税复制、修改和分发 GPL 程序的权利。在过去的四个月里，我们在德国经过认证的版权和媒体法律律师的支持下，经历了一个漫长的过程来执行我们的许可。尽管我们取得了初步成功，导致了 Fat Fritz 2 DVD 的召回和 Houdini 6 的销售终止，但我们无法在庭外结束我们的纠纷。由于 Chessbase 屡次违反许可，Stockfish 的主要开发商已永久终止其与 ChessBase 的 GPL 许可。然而，ChessBase 忽略了这样一个事实，即他们不再有权分发 Stockfish，无论是经过修改的还是未经修改的，作为其产品的一部分。因此，为了强制终止许可的后果，我们提起了诉讼。这起诉讼得到了 Stockfish 的维护者和开发者团队的广泛支持。我们相信我们有证据、经济手段和决心使这场诉讼成功结束。一旦取得重大进展，我们将更新本声明。我们要感谢我们的粉丝的支持，并鼓励他们下载和使用我们喜欢免费开发和共享的 Stockfish 官方版本。", "note_en": "The Stockfish project strongly believes in free and open-source software and data. Collaboration is what made this engine the strongest chess engine in the world. We license our software using the GNU General Public License, Version 3 (GPL) with the intent to guarantee all chess enthusiasts the freedom to use, share and change all versions of the program.\n Unfortunately, not everybody shares this vision of openness. We have come to realize that ChessBase concealed from their customers Stockfish as the true origin of key parts of their products (see also earlier  blog posts by us and the  joint Lichess, Leela Chess Zero, and Stockfish teams). Indeed, few customers know they obtained a modified version of Stockfish when they paid for Fat Fritz 2 or Houdini 6 - both Stockfish derivatives - and they thus have good reason to be upset. ChessBase repeatedly violated central obligations of the GPL, which ensures that the user of the software is informed of their rights. These rights are explicit in the license and include access to the corresponding sources, and the right to reproduce, modify and distribute GPLed programs royalty-free.\n In the past four months, we, supported by a certified  copyright and media law attorney in Germany, went through a long process to enforce our license. Even though we had our first successes, leading to a recall of the Fat Fritz 2 DVD and the termination of the sales of Houdini 6, we were unable to finalize our dispute out of court. Due to Chessbase’s repeated license violations, leading developers of Stockfish have terminated their GPL license with ChessBase permanently. However, ChessBase is ignoring the fact that they no longer have the right to distribute Stockfish, modified or unmodified, as part of their products.\n Thus, to enforce the consequences of the license termination, we have filed a lawsuit. This lawsuit is broadly supported by the team of maintainers and developers of Stockfish. We believe we have the evidence, the financial means and the determination to bring this lawsuit to a successful end. We will provide an update to this statement once significant progress has been made.\n We would like to thank our fans for their support, and encourage them to  download and use the  official version of Stockfish that we enjoy  developing and sharing freely.", "posttime": "2021-07-22 21:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "chessbase,lawsuit,stockfish", "title": "我们对 ChessBase 的诉讼", "title_en": "Our lawsuit against ChessBase", "transed": 1, "url": "https://stockfishchess.org/blog/2021/our-lawsuit-against-chessbase/", "via": "", "real_tags": ["chessbase", "lawsuit", "stockfish"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068742, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "甜菜的目的是让您的音乐收藏一次和所有人。 ITCatalogs您的集合，自动改进其使用MusicBrainz数据库的元数据。然后它提供了一束Formanigal和访问您的音乐的工具。\n 因为甜菜被设计为图书馆，所以它可以为您的音乐集合做几乎您的任何东西。通过插件，甜菜变成灵丹妙药：\n 获取或计算您可能需要的所有元数据：专辑艺术，歌词，流派，节奏，重新开始级别或Acousticfingersts。\n  获取MusicBrainz，Discogs或Beatport的元数据。或使用歌曲的文件名或其声学指纹的猜测。\n      通过Web浏览器浏览您的音乐库，并在支持HTML5音频的浏览器中播放它。\n 如果甜菜不做你想要的东西，如果你知道一个小python，写出自己的插件很简单。\n 通过键入pip安装甜菜来安装甜菜。然后，您可能希望读取getStarted指南。然后按照@ B33TSON Twitter进行更新。 ", "note_en": "The purpose of beets is to get your music collection right once and for all. Itcatalogs your collection, automatically improving its metadata as it goes usingthe  MusicBrainz database. Then it provides a bouquet of tools formanipulating and accessing your music.\n Because beets is designed as a library, it can do almost anything you canimagine for your music collection. Via  plugins, beets becomes a panacea:\n Fetch or calculate all the metadata you could possibly need:  album art, lyrics,  genres,  tempos,  ReplayGain levels, or  acousticfingerprints.\n  Get metadata from  MusicBrainz,  Discogs, or  Beatport. Or guessmetadata using songs’ filenames or their acoustic fingerprints.\n      Browse your music library graphically through a Web browser and play it inany browser that supports  HTML5 Audio.\n If beets doesn’t do what you want yet,  writing your own plugin isshockingly simple if you know a little Python.\n Install beets by typing  pip install beets.You might then want to read the GettingStarted guide. Then follow @b33tson Twitter for updates.", "posttime": "2021-06-30 05:54:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "音乐,music", "title": "甜菜：音乐怪人的媒体组织者 ", "title_en": "Beets: the music geek’s media organizer", "transed": 1, "url": "https://beets.io/", "via": "", "real_tags": ["音乐", "music"]}, {"category": "", "categoryclass": "", "imagename": "3af290ccb6e0f49b13ede3d1845eb9de.jpg", "infoid": 1068741, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当雷克萨斯于1989年抵达现场时，它真的是现有豪华汽车制造商的叫醒。丰田唯一在日本以外的人以外地知道制作主流汽车，公司希望证明它可以建立比其他任何人更好的豪华车。 LS400制作了可以说服力的情况。不仅汽车更便宜，而不是德国竞争对手，也更安静，更精致，更轻，更高效。建成。 （它甚至在街头战斗机II中制作了一个勇气。）\n 三十二年后，如果你正在寻找豪华车，雷克萨斯是一个完善的选择。尽管对旗舰轿车的需求缩小，因为司机继续展示SUV-ITIS的糟糕案例，但雷克萨斯仍然提供旗舰轿车。目前的LS是第五代，首先在2017年底推出，然后最近介绍了2021年的模型年份。在花一周结束后，我可以说雷克萨斯仍然知道如何制作美丽，好吧 - 一起的汽车。与此同时，新的LS开始展示其年龄。\n 在其核心，LS500使用丰田和新的全球架构中的一个，在这种情况下，TNGA-L为最大的后方或全轮驱动豪华车。虽然名称中的数字用于指代发动机位移，如BMW和梅赛德斯 - 奔驰，但它们不再准确：2021 LS500实际上由3.4L双涡轮增压V6供电。在先前的自然吸气的V8上的容量降低是没有真正的降级，因为V6在其416 HP（310kW）的递送中是柔滑的，并且442 LB-FT（600nm）的扭矩从1,500开始到达宽平台rpm。雷克萨斯建造后轮驱动（MSRP：76,000美元）和全轮驱动（MSRP：$ 79,250）LS500S，但无论是否驱动了多少个轮子，都带有10速自动变速箱。\n  如果您在真正的匆忙中，您可以在4.6秒内推出后轮驱动LS500至60英里/小时（97 km / h），然后在速度迅速，其次是136英里/小时的顶级速度（219公里/小时）。 （那个＆＃39; sa公平比特比原来的ls400＆＃39; s155英里/小时/ 250 km / h，但它＆＃39;＆＃39;＆＃39;＆＃39;在德富德国Autobahn的少量延伸之外的所有学术。）如果你可以避免捣碎每天的油门都是拖着赛季的拖曳日，大轿车平均平均22英里/克（10.7L / 100km），在城市分为18英里（13.1 L / 100km）和29英里/克（8.1L / 100km）公路速度。\n 这些数字areN＆＃39;考虑到LS500的宽度为206.1英寸（5,235毫米），宽74.8英寸（1,900毫米），高57.1英寸（1,450毫米），具有至少4,740磅的遏制重量（2,150千克）骑在空气悬架时。尽管有一个漂亮的拖拉系数（CD：0.28），但仍有很多正面区域推动空气和大量的群体来移动。选择AWD和You＆＃39; LL在城市中丢失了1英里/mp，并合并（高速公路上的2英里西）。那个＆＃39; s是因为AWD版本稍高，略高于拖拉机（CD：0.3），重量至少200磅（91千克）更多。 （如果这仍然对您荒谬，请欣赏到雷克萨斯去年仅在美国销售〜3,000 LS500S的知识。）\n Hybrid版本，90,500 LS500H，在城市获得25英里/克（9.4 L / 100km），高速公路上有33英里/千米（7.1 L / 100km），合并28 MPG（8.4 L / 100km）。不幸的是，媒体船队没有杂交;否则，我们会审查那个。 （AWD LS500H开始于93,750美元。）\n LS500的一部分＆＃39; SIMLife刷新涉及一些悬架调整。春天和阻尼率已经推出，以改善骑行，具有防罗拉。空气悬浮液中还有较大的液体填充衬套和新的螺线管和阀门。那个＆＃39;他不是要说汽车＆＃39; t处理一点峡谷雕刻;刚刚将驱动模式设置为Sport S +，一切都达到绷紧和响应。但它＆＃39;是一个大雷克萨斯轿车，所以98％的生命中的生命将花费挥发，现在它将比以往任何时候都更舒适。 \n驾驶通常为您提供更多时间来欣赏LS500＆＃39的内部，这无疑是它的突出功能。造型让我想到艺术装饰，特别是仪表板和门卡。我可能不应该承认这一公开，但我花了更多的时间，而不是健康，只是感受到门卡，它在三个方面混合了皮革，阿尔卡兰塔和木头。座椅在前方和后部均非常舒适，我们的测试车辆配备了最佳按摩功能之一I＆＃39;曾经在豪华车中遇到过。\n 另一方面，汽车中的一些技术开始感觉有点日期。雷克萨斯刚刚改变了信息娱乐屏幕 - 它现在是一个12.3英寸触摸屏，您也可以通过中央控制台上的触摸板来控制。不幸的是，雷克萨斯inform信息娱乐软件仍然滞留在你的系统后面＆＃39; ll在汽车中找到德国竞争对手。在这个水平在市场上，小细节有关，它jarring＆＃39; s jarring看到一个相当马铃薯质量的后视镜，实际上是一个合理的像素密度屏幕。\n 同样，数字主仪器显示器看起来一代在竞争背后，这一切都为他们的司机提供了大量数字屏幕。 LS500在驾驶员前面有一个较小的数字面板，在任何一侧有用于水温和燃料水平的模拟仪表，所有这些都以皮革框架。然而，我对新的头脑显示没有投诉。对于这个模型年来，LS可以配备24英寸的颜色HUD，虽然与全新的梅赛德斯S级不同，导航方向与全新的导航方向不同.T＆＃39; t出现在增强现实不同。\n  总的来说，LS500的覆盖印象是雷克萨斯知道如何将汽车拧在一起;构建质量为您的一切都感到无可挑剔，因为你的一切都是无可挑剔的。它乘坐一个非常舒适的汽车，骑在奥迪，宝马和梅赛德斯的竞争对手，内饰有很多舒适的汽车。但外部造型可能不是每个人的口味，尤其是气缸奶酪磨坊前格栅。如果是你的口味，你＆＃39; ll可能想要ls500h。 ", "note_en": "When Lexus arrived on the scene in 1989, it was truly a wake-up call for existing luxury car makers. Toyota was only really known outside Japan for making mainstream cars, and the company wanted to prove it could build a better luxury car than anyone else. The LS400 made a convincing case that it could. Not only was the car cheaper and faster than its German rivals, it was also quieter and more refined, as well as lighter and more efficient.  Well-built, too. (It even made a cameo in   Street Fighter II.)\n Thirty-two years later, Lexus is a well-established option if you&#39;re looking for a luxury car. And  despite shrinking demand for flagship sedans as drivers continue to display a bad case of SUV-itis, Lexus still offers a flagship sedan. The current LS is in its fifth generation, first introduced at the end of 2017 and then face-lifted recently for model year 2021. After spending a week getting to know one, I can say that Lexus still knows how to craft a beautiful, well-put-together car. At the same time, the new LS is starting to show its age in places.\n At its core, the LS500 uses one of Toyota&#39;s new global architectures, in this case TNGA-L, for the biggest rear- or all-wheel-drive luxury cars. Although the numerals in the name used to refer to engine displacement, like BMW and Mercedes-Benz, they are no longer accurate: the 2021 LS500 is actually powered by a 3.4 L twin-turbocharged V6. A decrease in capacity over the previous naturally aspirated V8 is no real downgrade, as the V6 is silky in its delivery of 416 hp (310 kW), and the 442 lb-ft (600 Nm) of torque arrives as a broad plateau from 1,500 rpm. Lexus builds both rear-wheel-drive (MSRP: $76,000) and all-wheel-drive (MSRP: $79,250) LS500s, but regardless of how many wheels are driven, all come with a 10-speed automatic transmission.\n  You can launch a rear-wheel-drive LS500 to 60 mph (97 km/h) in 4.6 seconds if you&#39;re in a real hurry, followed by a top speed of 136 mph (219 km/h). (That&#39;s a fair bit less than the original LS400&#39;s 155 mph/250 km/h, but it&#39;s all academic outside of a handful of stretches of the German Autobahn.) If you can avoid mashing the throttle like every day is drag racing day, the big sedan will average a combined 22 mpg (10.7 L/100km), broken down into 18 mpg (13.1 L/100km) in the city and 29 mpg (8.1 L/100km) at highway speed.\n Those figures aren&#39;t atrocious considering that the LS500 is 206.1 inches (5,235 mm) long, 74.8 inches (1,900 mm) wide, and 57.1 inches (1,450 mm) tall and has a curb weight of at least 4,740 lbs (2,150 kg) when riding on air suspension. Despite a pretty slippery drag coefficient (Cd: 0.28), there&#39;s still a lot of frontal area to push through the air and a lot of mass to get moving. Opt for AWD and you&#39;ll lose 1 mpg in the city and combined (and 2 mpg on the highway). That&#39;s because the AWD version rides a little higher, is slightly draggier (Cd: 0.3), and weighs at least 200 lbs (91 kg) more. (If this still sounds absurd to you, take comfort in the knowledge that Lexus only sold ~3,000 LS500s in the US last year.)\n The hybrid version, the $90,500 LS500h, gets 25 mpg (9.4 L/100km) in the city and 33 mpg (7.1 L/100km) on the highway, for a combined 28 mpg (8.4 L/100km). Unfortunately, there was no hybrid in the press fleet; otherwise, we would have reviewed that one. (The AWD LS500h starts at $93,750.)\n Part of the LS500&#39;s midlife refresh involved some suspension tuning. The spring and damper rates have been tweaked to improve the ride, as have the antiroll bars. There are also larger liquid-filled bushings and new solenoids and valves in the air suspension. That&#39;s not to say the car can&#39;t handle a bit of canyon carving; just set the drive mode to Sport S+ and everything gets taut and responsive. But it&#39;s a big Lexus sedan, so 98 percent of its life will be spent wafting along, which it will now do more comfortably than ever.\n  Driving normally gives you more time to appreciate the LS500&#39;s interior, which is undoubtedly its standout feature. The styling makes me think of art deco, particularly the dashboard and door cards. I probably shouldn&#39;t admit this publicly, but I spent more time than was healthy just feeling the door cards, which mix leather, Alcantara, and wood in three dimensions. The seats are extremely comfortable in both the front and the rear, and our test vehicle was fitted with one of the best massaging functions I&#39;ve ever encountered in a luxury car.\n On the other hand, some of the technology in the car is starting to feel a bit dated. Lexus just changed the infotainment screen—it&#39;s now a 12.3-inch touchscreen you can also control via a touchpad on the center console. Unfortunately, the Lexus Enform infotainment software is still lagging behind the systems you&#39;ll find in the car&#39;s German rivals. At this level in the market, the little details matter, and it&#39;s jarring to see a rather  potato-quality rearview camera displayed on what is actually a reasonably pixel-dense screen.\n Similarly, the digital main instrument display looks a generation behind the competition, which all offer big digital screens for their drivers. The LS500 has a smaller digital panel in front of the driver, with analog gauges for water temperature and fuel level on either side, all of them framed in leather. I have no complaints about the new heads-up display, however. For this model year, the LS can be fitted with a 24-inch color HUD that holds its own against the competition, although  unlike the brand-new Mercedes S-Class, the navigation directions don&#39;t appear as augmented reality.\n  Overall, the overriding impression of the LS500 is that Lexus knows how to screw a car together; the build quality feels impeccable for everything you poke, prod, touch, or stroke. It&#39;s an extremely comfortable car to ride in, and the interior has a lot to recommend it over rivals from Audi, BMW, and Mercedes. But the exterior styling might not be to everyone&#39;s tastes, particularly the  Cylon cheese-grater front grille. If it is to your taste, you&#39;ll probably want the LS500h.", "posttime": "2021-06-30 05:15:42", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "科技,ls500,雷克萨斯", "title": "lexus ls500精美地制作，但有些科技显示其年龄 ", "title_en": "The Lexus LS500 is beautifully crafted, but some tech shows its age", "transed": 1, "url": "https://arstechnica.com/cars/2021/06/the-lexus-ls500-is-beautifully-crafted-but-some-tech-shows-its-age/", "via": "", "real_tags": ["科技", "ls500", "雷克萨斯"]}, {"category": "", "categoryclass": "", "imagename": "1c2e095731eba6ec296ec0455e2ae698.jpg", "infoid": 1068739, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这场新比赛中，这两家公司正在采取不同的策略，因为他们互相广场 - 以及越来越多的EV初创公司清单 - 赢得尽可能多的交付和车队客户。\n 通用汽车的武器是Brightrop，一个新的初创企业孵化并在CES 2021上由CES和CEO Mary Barra推出。该企业拥有一家EV硬件和物流软件产品的生态系统，旨在乘坐舰队和送货公司。通用汽车对该空间的兴趣远非仅仅是探索性的;它预计将在2025年将超过850亿美元的交付市场，包括食品和包裹。\n  “商业方面的人们真的不关心技术 - 他们关心经济学，”研究公司汽车技术总监Brett Smith告诉TechCrunch。\n 电动汽车可能比传统的气体或柴油或柴油动力车辆更生态，但对于舰队管理人员来说，它归结为电子表格上的数字，并且由于激励和与EVS相关的维护成本，而是在电子上运行的货车死恐龙的财务意义。 ", "note_en": "In this new race, the two companies are taking different strategies as they square off against each other — along with a growing list of EV startups — to win over as many delivery and fleet-vehicle customers as possible.\n GM’s weapon is BrightDrop, a new startup incubated and launched at CES 2021 by Chairman and CEO Mary Barra. The venture boasts an ecosystem of EV hardware and logistical software products aimed squarely at fleet and delivery companies. GM’s interest in the space is far from merely exploratory; it anticipates that the market for delivery, including food and parcels in the United States, will be  more than $850 billion by 2025.\n  “Folks on the commercial side don’t really care about the technology — they care about the economics,”  Brett Smith, director of technology at research firm CAR, told TechCrunch.\n Electric vehicles might be more ecologically sound than traditional gas- or diesel-powered vehicles, but for fleet managers, it comes down to the numbers on a spreadsheet, and thanks to incentives and lower maintenance costs associated with EVs, vans that run on electrons instead of dead dinosaurs make financial sense.", "posttime": "2021-06-30 05:14:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "商业,通用汽车,newest", "title": "通用汽车最新的启动在商业EV市场方面 ", "title_en": "\n\t\t\t\tGM’s newest startup aims squarely at the commercial EV market\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/gms-newest-startup-aims-squarely-at-the-commercial-ev-market/", "via": "", "real_tags": ["商业", "通用汽车", "newest"]}, {"category": "", "categoryclass": "", "imagename": "e9707cd04a61beb7e57a56748e8db539.jpeg", "infoid": 1068738, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "邮件看起来像是实际的后介质网站 - 你可以选择一种关系（“随便约会，”“一起生活”，“一夜之间，”等）就像它是一家餐馆。然后，您可以从预设物品中选择来检索（如果您是友好的，如果您被友好，如果您离婚，则为家庭传家宝）或添加自定义项。交货以25美元的价格为25美元，纽约30美元，以及3.99美元的额外情绪劳动力费。是的，如果您在这两个城市中的一个，您可以实际使用此服务，但邮件不在这里 - 这是一个弹出窗口业务。或者，作为“创始人”ani acopian放了它，“这有点看着'黑色镜子'集，但这是你真实的生活。”\n 您可能会记得Elon Musk失败的喜剧启动/“Intergalactic Media Empire”Thud，旨在创造沉浸式数字体验，模糊了真实和假的线之间的线路。或者，你可能不记得砰砰声，因为它失败了，并且不是很有趣。迟到袭击了讽刺金，Elon Musk梦想着砰的一声，只有他们在世界上最富有的男人之一，没有200万美元的资金。\n  TechCrunch与概念艺术家Ani Acopian，Producer Suzy Shinn和Product Developer Brian Wagner谈到，即可获得较低的合法效果。\n    Suzy Shinn：在隔离的开始时，当一切都崩溃时，Ani和我制作了磨砂，就像Pornhub用于洗手间。我们为慈善机构提高了50,000美元。\n ani acopian：我想我们在我们内心的创意果汁，我们想找到一个出口。\n SS：那么，我们有了帖子的想法，我们实际上试图让投资者和艺术家提供资金，因为我们就像......这会花费一些东西，我们想要使它变得真实和实际功能。没有人想用它做任何事情，因为他们就像，“回归是什么？”\n AA：我们就像，“好吧，回报是这是一个氛围。” \nSS：没有人想要任何与我们的资金有关，所以我们自己建造了。\n  AA：是的，我们与两个当地的快递公司合作，在洛杉矶和纽约的航空公司。我们希望确保我们与将工人对待的人合作。\n SS：你可以提出请求，而前者也明显同意，就像“是的，我有这个东西给你，我会把它放在外面，”我们的信使我们给他们的袋子。但合法地，只要您没有发送猫，或酒精或毒品，或者不适合包的东西，您可以在这两个城市中使用它。\n AA：我们花了很多时间在工作流程上，以确保没有共享地址，即每个人都有涉及的同意，我们正在努力保持它，所以我们要求人们在门上放置东西处理。在您的前方接受订单之前，您就不会收费。\n  TC：你昨天刚刚推出，但有人实际上是迄今为止使用该服务的吗？\n Brian Wagner：我们有一些人会回应Ani的推文，“哦，我实际上被我的前任所汇报了！”\n SS：大约有30到40个未决的请求，我们已经少数就像今天早上一样，已经成功交付。 \nAA：并非一切都需要成为可行的业务。我实际上会发生......并不感到惊讶，但如果这实际上成了一件事，因为我认为世界不需要那种水平，但我认为我们已经在那里了。你所能做的就是举起镜子。\n   SS：我想在科技世界中，看起来所有这些技术初创公司都会得到疯狂的资金，他们花了这么多钱，他们非常认真地抓住自己。我们三个人在我们的朋友们的帮助下，能够做到这一点，我们不需要1300万美元的资金或五年。但我们熬夜，直到5点，我们就像，“我们可以雇人帮助我们吗？”但我们就像，“不，我们不能付钱。”\n BW：特别是随着演出经济的崛起，我们已经看到了一些积极的积极和一些非常严重的否定，特别是在检疫期间。它有助于人们获得所需的东西，但也有很多工人没有公平的报酬，也没有健康保险。所以现在有很多科技更频繁的事情是重新分配劳动力，你只需为人们搬家而付出代价。所以在某种程度上，我们有点像......我们在这里重新分配了情感劳动力。\n  BW：有点扑谈，说我们实际移动劳动力的途径是多远的。人们会为其他人支付何种情境的情感处理吗？\n 我与约会应用没有太多的运气，所以我与@amazon合作，使一个更好的一个👀💘https://t.co/ticxr7j7co\n  AA：我们现在制作了两个模仿网站，我们想把它带到下一个级别并使它进行体验。它有点像看黑镜像剧集，但这是你的现实生活。\n SS：你将支付的字面价格是什么？这是一件真正的事情，一直发生 - 我的朋友会像，“我和我的女朋友分手，我需要你去找我的东西，”我喜欢，“我不想去你的东西。” \nTC：所以你认为我们应该外包它，还要外包，还要延迟。  TC：它对启动文化来说，制作你不认为应该存在的产品是什么？  SS：初创公司是如此严肃，它没有幽默，他们认为它会永远持续下去。 好吧，我们正在做相反的事情。 我们将在最后几周内持续几周，然后我们会把它带走。 但我们很乐意继续这样做，制作艺术符合Tech的东西迎接娱乐。  BW：公司和经验可以很有趣。 他们不一定是十亿美元的想法，他们不必是鲨鱼坦克的东西......想象我们进入鲨鱼坦克...... ", "note_en": "Postdates looks like the actual Postmates website – you can select a type of relationship (“casually dated,” “lived together,” “one night stand,” etc.) like it’s a type of restaurant. Then, you can choose from preset items to retrieve (concert tickets if you were friendzoned, family heirlooms if you were divorced) or add a custom item. Delivery starts at $25 in LA and $30 in NY, along with an additional emotional labor fee of $3.99. Yes, you can actually use this service if you’re in one of these two cities, but Postdates isn’t here to stay — it’s a pop-up business. Or, as Postdates “founder” Ani Acopian puts it, “It’s kind of like watching a ‘Black Mirror’ episode, but it’s your real life.”\n You might remember Elon Musk’s failed comedy start-up/” intergalactic media empire” Thud, which aimed to create immersive digital experiences that blurred the lines between what’s real and fake. Or, you might not remember Thud, since it  failed spectacularly and wasn’t very funny. Postdates struck the satire gold that Elon Musk dreamed of with Thud, only they did it without $2 million dollars in funding from one of the richest men in the world.\n  TechCrunch talked to conceptual artist Ani Acopian, producer Suzy Shinn, and product developer Brian Wagner to get the low-down on just how legit Postdates is.\n    Suzy Shinn: At the start of quarantine when everything was falling apart, Ani and I made  ScrubHub, like PornHub for hand washing. We raised $50,000 for charity.\n Ani Acopian: I think we had this creative juice inside of us that we wanted to find an outlet for.\n SS: Then, we had the Postdates idea, and we actually tried to get investors and artists to fund it, because we were like… This is going to cost something, we want to make it real and actually function. No one wanted anything to do with it, because they were like, “What’s the return?”\n AA: And we were like, “Well, the return is that it’s a vibe.”\n SS: No one wanted anything to do with us funding-wise, so we built it ourselves.\n  AA: Yeah, we partnered with two local courier companies,  Gourmet Runner in LA and  Airpals in New York. We wanted to make sure we work with people that treat their workers right.\n SS: You can put in a request, and the ex has to consent obviously and be like, “Yeah, I have this stuff for you, I’ll put it outside,” and our couriers have Postdates bags that we give to them. But legitimately, you can use it in both of those cities as long as you’re not sending a cat, or a child, or alcohol, or drugs, or something that won’t fit in a bag.\n AA: We spent a lot of time on the workflow to make sure no addresses are shared, that everyone’s consenting to be involved, and we’re trying to keep it no-contact, so we’re asking people to put stuff on their door handle. You’re not charged until your ex accepts the order.\n  TC: You just launched yesterday, but have people actually been using the service so far?\n Brian Wagner: We had some people who would post a screenshot in response to Ani’s tweet and be like, “Oh snap, I actually got Postdated by my ex!”\n SS: There’s about 30 to 40 pending requests, and we’ve gotten a handful that just like, as of this morning, have been delivered successfully.\n  AA: Not everything needs to be a viable business. I would actually be… not surprised, but upset if this actually became a thing, because I don’t think the world needs that level of stuff, but I think we’re pretty much already there. All you can do is hold the mirror up.\n   SS: I think in the tech world, it seems like all of these tech startups get crazy amounts of funding, and they spend so much money, and they take themselves so seriously. The three of us, with the help of our friends, were able to do this, and we didn’t need $13 million in funding or five years. But we were staying up until like 5 AM, and we were like, “Can we hire someone to help us?” but we were like, “No, we can’t pay.”\n BW: Especially with the rise of the gig economy, we’ve seen some positives and some pretty serious negatives, especially during quarantine. It helps people get the things that they need, but also a lot of workers aren’t being paid fairly and don’t have health insurance. So there’s a sentiment a lot more often now that a lot of tech is redistributing labor, and you’re just paying for people to be moved around. So in a way, we’re sort of like… We’ve redistributed emotional labor here.\n  BW: There’s a bit of poking fun of that, saying how far will we go in terms of actually moving labor along for money. Will people pay for someone else to deal with the emotional handling of a situation?\n i wasn’t having much luck with dating apps so i partnered with  @amazon to make a better one 👀💘 https://t.co/ticxR7j7CO\n  AA: We’ve made two parody sites now, and we wanted to take that to the next level and make it experiential. It’s kind of like watching a Black Mirror episode, but it’s your real life.\n SS: What is the literal price you will pay not to see someone? This is a real thing that happens all the time – my friends will be like, “I broke up with my girlfriend, I need you to go get my stuff,” and I’m like, “I don’t want to go get your stuff.”\n  TC: So you don’t think we should outsource it, but also, you made Postdates.\n    TC: What does it say about startup culture to make a product that you don’t think should exist?\n SS: Startups are so, so serious, there’s no humor in it, and they think it’s going to last forever. Well, we’re doing the opposite.  We’re going to make this last a couple of weeks for a limited time only, and then we’re gonna take it away. But we would love to keep doing these, making something where art meets tech meets entertainment.\n BW: Companies and experiences can just be fun. They don’t have to be a billion dollar idea, they don’t have to be something that’s going to go on Shark Tank… Imagine us entering Shark Tank…", "posttime": "2021-06-30 05:14:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "情感,emotional", "title": "如果您支付情感劳动力费用，则邮件将从您的前任获得您的东西 ", "title_en": "\n\t\t\t\tIf you pay an emotional labor fee, Postdates will get your stuff from your ex\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/if-you-pay-an-emotional-labor-fee-postdates-will-get-your-stuff-from-your-ex/", "via": "", "real_tags": ["情感", "emotional"]}, {"category": "", "categoryclass": "", "imagename": "6afca436ea226994013b6a45122036e6.jpeg", "infoid": 1068737, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Twitter正在对其Web应用程序进行有争议的变化。直到最近，Web上的Twitter允许用户轻松在算法馈送和按时间源之间切换，单击单击，但现在可以完全删除该选项，以便在浏览器中使用Twitter的人员完全删除。\n  Twitter长期以来为用户提供两种不同的选项，用于对其进行排序：最新推文和家庭。前者是一个纯的时间顺序饲料，显示出在其发生时的推文，而后者首先显示“顶部推文”。传统上，此设置可轻松访问时间轴上方的图标。\n 然而，最近几天，Twitter已开始从Twitter.com Web应用程序中删除先查看最新推文的能力。对于许多用户来说，“最新推文”与“Home”之间的切换已完全删除。该选项仍然存在一些用户，但似乎不会持久。\n 一个Twitter用户还注意到Twitter更新了支持文档，请注意，最新的Tweets选项现在仅在iOS和Android上可用。支持文档解释：\n 您可以在TimeLine中首先或最新推文选择顶部推文（仅为iOS和Android的推特）。顶级推文是您最有可能关心的推文，我们根据您与大多数人进行互动的账户选择它们，您从事的推文等等。\n 更新：始终似乎已遍布支持文档更改，但它可能意味着Twitter长期以来一直计划在Web上删除支持“最新推文”。\n 快速搜索Twitter将显示大量的Twitter用户对此更改非常不满，新推文以快速的速度滚动。 \n如果您在Mac上，则Mac Twitter仍然提供“最新推文”切换，但目前尚不清楚将要持续多长时间。 目前尚不清楚Twitter还将从iPhone，iPad和Mac上的其本机应用程序中删除“最新推文”选项。 该公司可能计划制定时间顺序排序时间，该功能是Twitter蓝订阅的特色，但现在只是猜测。  您正在阅读9To5MAC  - 在日复一日的日复一日地打破苹果及其周围生态系统的新闻的专家。 请务必查看我们的主页，以了解所有最新消息，然后在Twitter，Facebook和LinkedIn上关注9to5Mac以留在循环中。 不知道从哪里开始？ 查看我们的独家故事，评论，How-TO，以及订阅我们的YouTube频道 ", "note_en": "Twitter is making a controversial change to its web application. Until recently, Twitter on the web allowed users to easily switch between an algorithmic feed and a chronological feed with a single click, but that option is now being removed completely for people who use Twitter in their browser.\n  Twitter has long offered users two different options for sorting their feeds: Latest Tweets and Home. The former is a pure chronological feed that shows tweets as they happen, while the latter shows “top tweets” first. This setting has traditionally been easily accessible with an icon directly above the timeline.\n In recent days, however, Twitter has started to remove the ability to view Latest Tweets first from the Twitter.com web application. For many users, the toggle between “Latest Tweets” and “Home” has been completely removed. The option is still there for some users, but it seemingly won’t last.\n One Twitter user also  noticed that Twitter  updated a support document to note that the Latest Tweets option is now only available on iOS and Android. The support document explains:\n You can choose between viewing the top Tweets first or the latest Tweets first in your timeline ( Twitter for iOS and Android only). Top Tweets are ones you are likely to care about most, and we choose them based on accounts you interact with most, Tweets you engage with, and much more.\n Update: The support document change appears to have been made a while ago, but it could mean Twitter has long been planning to drop support for “Latest Tweets” on the web.\n A  quick search on Twitter will show that a vast amount of Twitter users are very upset with this change, and new tweets are rolling in at a rapid pace.\n If you’re on a Mac, Twitter for Mac still offers the “Latest Tweets” toggle, but it’s unclear how long that will last. It’s unclear whether Twitter will also eventually remove the “Latest Tweets” option from its  native apps on iPhone, iPad, and Mac as well. The company could be planning to make the chronological timeline a feature  exclusive to the Twitter Blue subscription, but that’s just speculation for now.\n  You’re reading 9to5Mac — experts who break news about Apple and its surrounding ecosystem, day after day. Be sure to check out  our homepage for all the latest news, and follow 9to5Mac on  Twitter,  Facebook, and  LinkedIn to stay in the loop. Don’t know where to start? Check out our  exclusive stories,  reviews,  how-tos, and  subscribe to our YouTube channel", "posttime": "2021-06-30 05:06:23", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "程序,ios,android,饲料,begun", "title": "Twitter已开始从其Web应用程序中删除其许多用户的“最新”时间饲料选项，尽管它仍然可用于iOS，Android和Mac应用程序 ", "title_en": "Twitter has begun removing its “Latest” chronological feed option from its web app for many users, though it's still available on iOS, Android, and Mac apps", "transed": 1, "url": "https://9to5mac.com/2021/06/29/twitter-ditching-latest-chronological-feed-option-on-the-web-still-available-on-ios-for-now/", "via": "", "real_tags": ["程序", "ios", "android", "饲料", "begun"]}, {"category": "", "categoryclass": "", "imagename": "9966a3de9db4593913aae492f200a868.jpg", "infoid": 1068736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "跳转到导航跳转以搜索瓦努萨（拉丁稚之，来自古希腊语ναυμαχία/Naumachía，字面上＆＃34;海军战斗＆＃34;）在古老的罗马世界中提到了海军战役的阶段作为大众娱乐，而且发生这种盆地或建筑物。\n   第一个已知的Naumachia由Julius Caesar在罗马在46公元前46岁的时候给了他的四人胜利。在台伯河附近的盆地挖出后，能够举行实际的Biremes，Triremes和Quinqueremes，他制作了2000年的战斗人员和4000次赛艇手，所有的战俘，斗争。在2年代，奥尔斯寺庙的就职典礼（＆＃34;火星Avenger＆＃34;），基于凯撒和＃39; S模型给予了一个大的幼死。这种幼虫描绘了希腊人和波斯之间的战斗，需要一个400码的盆地，这是一个跨国公司跨越跨国公司创造的。 [1] ResGestæ（§23）声称，3000名男子，不计数赛艇运动员，用公羊和几艘较小的船只在30艘船中奋斗。\n 在52年，克劳迪斯给出了最多的东西最多＆＃34; epic＆＃34;其中在凤梨湖天然的水体上，庆祝排水工作和隧道在现场的隧道。它包括一百艘船舶和19,000名战斗人员，[1]所有囚犯被谴责死亡。 Suetonius＆＃39;账户，在活动结束后写多年，让他们向皇帝致敬与短语＆＃34; Morituri te salutant＆＃34; （＆＃34;那些即将致敬你致敬的人和＃34;）。没有证据表明，除了这种单一的Nuumachia之外的任何时候，这种形式的地址都被使用。 [2]\n 因此，Naumachia是一个血腥的展示而不是剑兰战斗，它包括较小的接合，并且战斗不一定以输家的死亡结束。更确切地说，奈马乔西亚的出现密切相关，只比其他景观更早地略有束缚，＆＃34;集团战斗＆＃34;，这没有彼此互相反弹，而是使用两个小军队。再次，战斗人员经常被判处死刑并缺乏对真正的角革者的专业培训。凯撒，奈良亚的创造者，只是不得不将与另一个环境相同的原则。\n 通过对战斗的编舞，甘浑菌质有能力代表历史或伪历史主题。参与的每个舰队都代表了古希腊或希腊主义东部的海上力量：埃及人和凯撒，波长，波长和雅典主义者的泰国人，西西里人和Rhodeans为Claudius而言。它需要比其他此类娱乐更大的资源，因此这些眼镜被保留为特殊场合，与皇帝的庆祝活动紧密相关，他的胜利和他的纪念碑。景观的具体性质以及希腊世界借来的历史主题与术语术语密切相关。这个词，希腊语的语音转录是海军战斗（ναυμαχία/naumakhía），此后也是指为他们创造的大型人为盆地。\n  凯撒＆＃39; s naumachia可能是一个简单的盆地挖到了北部北部或南部的北部的低洼地面，由其水喂养;确切的位置未知;最有可能的曲折或校园马提埃。 [3]奥古斯乌斯鲁斯的甘浑菌质更为罕见：在他的ResGestæ（23）奥古斯特本人表明盆地测量了1800×1200罗马脚（约533×355米）。豪华的老人（自然历史，16,200）描述了一个在中心形成的岛，可能是矩形的，并通过桥梁连接到岸边，在那里特权观众可能坐着。\n 考虑到盆的尺寸和三十次（约35×4.90米）的尺寸，所使用的三十艘血管几乎不能操纵。知道罗马三月的船员大约是170名赛艇运动员和50到60名士兵，一个简单的计算使我们能够看到达到奥古斯图乌血管的3000名男子的数量;舰队必须持有比实际舰队更多的战斗人员。因此，景象的重点在于血管的运动，更重要的是在人工盆中的实际存在和发育的手工作战。 \n对于Claudius＆＃39是不同的;瑙马乔基亚。两个车队各自包括50艘船，这对应于基于Misenum和Ravenna的两队中每一个军队中的每一个的血管数量。菲桑尼诺湖足够大，只有它的一部分是需要的，被浮翅包围，并且有足够的房间让船舶互相操纵和冲撞。因此，Claudius的Naumachia真正复制了海军战斗。\n 据De Aquaeductu（De Aquis UrbisRomæ，11,1-2：OpusNaumachiæ）的说法，Aumastus的Naumachia供水是专门建造的，盈余常用于跨国公司的邻近花园。这是Aqua Alsietina Aqueduct，遗骸已在San Cosimato修道院下方的Janiculum（＆＃34;罗马＆＃34;第8座; 8号山）。网站的精确位置有几个理论;最新的是，它在北部的北部和圣弗朗西斯科教堂之间的距离在东南部的RIPA，在Tiber的循环中。在San Corsogono附近的Via Aurelia中发现的共和文高架桥也可能是盆地的渠道。\n 盆地没有持续很长时间。在Augustus统治期间，它被Nemuscæsarum（凯撒的神圣森林）部分替换（Suetonius，Augustus，43,1），后来更名为＆＃34; Gaius和Lucius＆＃34的森林;对于Augustus的孙子（Dion Cassius，66,25,3）。这座广阔的地区可能在1世纪末建造。\n   Nero统治期间发生了一种新的发展：圆形剧场的幼虫。 Suetonius（Nero，XII，1）和Dio Cassius（罗马历史，LXI，9,5）在57个广告中谈到了由朱廖克劳迪安的最后一个木圆形剧场的57个广告中的这一奇观。除了在校园Martius建造的网站上没有任何内容。 Nero在64广告中展示了另一个Naumachia。这是狩猎之后的，然后是唐菖蒲和一个伟大的宴会（Dio Cassius，LXII，15,1）。这是未知这些游戏的表现。这可能是同一个木制圆形剧场，因为在罗马的大火之前没有提到它的破坏，这是短暂的事情发生后发生的。\n 对于80广告中的罗马斗兽场的就职典礼，Titus在Augustinian盆地中的一个在奥古斯丁盆地，再次使用了几千名男子，另一个在新的圆形剧场（Dio Cassius，LXVI，25,1-4）中。根据Suetonius（Domitian，IV，6-7），Domitian在罗马斗兽场组织了一个Nuumachia，无疑是大约85公元的广告，另一个在一年中的另一个在一个新的盆地之外的一个新的盆地;用石头去除了维修马戏团最大值，这些马戏团在两侧被烧毁。这两种北美族裔的天藏之间的时间可能是在今天可见的殖鼬下面可见的殖鼬下面的房间网络之间的时间。同时排除了竞技场的眼镜。\n 斗兽场的竞技场仅测量79.35×47.20米，远离Augustinian盆地的尺寸。因此，罗马斗兽场的幼死不能像以前一样盛大。人们可以想象船员的几个酿酒者之间的对抗，潜在的寿命或合理接近它，但实际的演习甚至漂浮似乎是值得怀疑的。众所周知，阶段 - 道具用于代表船舶，有时有机制模拟灾难，阶段和竞技场（Tacitus，Annales，XIV，6,1; dio cassius lxi，12,2）。\n  使用足够的水来浮动在术语中的浮动容器提高了技术问题。术语不仅仅用于Naumachiae;他们将迅速填充和排水，以便在争吵团体和其他眼镜中使用。水显示和基于地球的快速过渡似乎是一个景点之一。 DIO CASSIUS强调这一点，因为它与Nero＆＃39; S Noumachia（LXI，9,5）涉及;武术也谈到了Titus＆＃39;罗马斗兽场的Naumachia（眼镜书，xxiv）。唯一幸存的书面来源没有提供所涉及的机制或工程的描述。考古学不提供线索：自修饰以来罗马斗兽场的基础。只有两名省级术语，在维罗纳和西班牙Mérida，提供了任何技术证据。 \n维罗纳圆形剧场的中央坑比通常在竞技场下面发现的房间更深，并作为盆地。它连接到两个轴向管道。一个，在竞技场的西部廊道下循环，没有连接到排水系统，必须连接到渡槽以填补盆地。东管道更深，设计用于将水排入迪杰河。 Mérida圆形剧场的盆地，仅1.5米，比维罗纳在较浅的地方。因为它比常设人的高度如此浅 - 它不能与地下服务室混淆。该盆地配备了接入楼梯，并覆盖着类似于游泳池和罗马浴的材料。它还由两个导管提供服务，其中一项渠道之一与附近的San Lazaro Aqueduct。\n 这些盆地的尺寸排除了Naumachiae中最基本的任何基本情况：Mérida的那个仅为18.5×3.7米。只有最适中的水眼镜可以在这里发生。这导致了一个得出的结论，即使假设腐烂在骨折（地下复合物）建造之前具有类似的盆地，也可以仅对覆盖竞技场表面的浅水层进行Nuumachiae，所需的最低限度船只。\n  新技术的引入最初导致了增加数量的幼雏。前三个幼雏分开了大约50岁;以下六个，其中大部分发生在术语中发生在30年的空间。物质和人类的昂贵昂贵，他们可以更频繁地上演。较少的宏伟，他们成为游戏的一个特色，但不能被认为是特殊的。图标识别见证了这一点。在罗马艺术中的大约二十个陈述，几乎所有人都是第四种风格，即Nero和Flavian王朝的时间。\n  在Flavian时期之后，Numachiae几乎完全从文本中消失了。除了在奥古斯坦历史上提到的，可靠性有限的延迟来源，只有奥斯蒂亚的城镇记录（Fastia）告诉我们，在109个Trajan揭开了一个天堂盆地。该网站是在18世纪发现的，梵蒂冈城，西北的桑特＆＃39;安吉洛斯。它现在被称为Naumachia梵蒂那亚，一些消息来源错误地称之为Hadrian的马戏团，因为它的形状与其他挖掘的马戏团的形状相似，以及哈德里安陵墓的邻近。随后的挖掘揭示了完整的网站计划。它有漂白剂（分层为观众），表面大约是奥古斯坦Naumachia的大小。在没有任何文本的情况下，必须假设它仅在Trajan时使用。\n 尽管如此，如果考虑到瓦姆乔基亚和达尔马库西亚的地名，罗马帝国来源和持续存在于中世纪的国家，则仍然存在于5世纪。此外，漂白剂在其周长上存在是普通节目的强烈指标。根据奥斯蒂亚市政纪录，就职典礼涉及127对角斗士;领导者认为，如在圆形剧场，Trajan＆＃39;盆地的限制空间不利于涉及许多未经训练的囚犯的大型战斗，或者将需要过度简化海军战斗，导致对单一战斗的偏好。在这种形式中，与专门的网站有几个世纪而没有提及来源的父目，纳姆成像很容易继续（虽然可能是还原频率），因为它们不会特别值得提及：他们只是失去了他们的宏伟和令人印象深刻的品格。\n 在省份，罗马Naumachiae的影响很容易辨别，但有限，减少到当地和无害的海军游戏和重新制定。在Naumaciva的名义下，一个竞争是从佛罗里尼亚州埃弗利人之间的普通岛屿欧洲航空公司之间的一部分。它取代了早些时候在这些游戏中发生的雷纳塔。如果要相信Ausonius，（Moselle，200-22,29），那么在当地青年之间的摩泽尔河上举行了一个幼虫。\n      一个幼泥是拱门爵士乐婚礼庆祝活动的一部分，我是de＆＃39;在1589年，在佛罗伦萨的Palazzo Pitti庭院举行的Medici和Christine在佛罗伦萨的庭院里举行了令人讨厌的是由奥拉西奥克拉比利创造的专辑的一部分来记录婚礼庆祝活动。 [4] \n在苏格兰，在苏格兰州霍尔德莱德公园的湖区上举行了苏格罗德公园的乐园，在弗莱明的婚礼和Leith的水中在1581年在伯莱和伊丽莎白斯图尔特的婚礼上。 [5]\n 在1755年在圣文森特·弗雷雷队的百年峰的百年纪念于1755年，在波里亚河之间在瓦伦西亚举行了一份幼崽。另一人在1807年在米兰举行拿破仑。\n Parc Monceau在巴黎设有一个天性的水特征，周围环绕着柱廊。在18世纪和19世纪英格兰，几个公园用模型船只嘲笑海军战斗，这也被称为甘浑虫。在英格兰斯卡伯勒的Peasholm公园仍然是这样的活动。较小的，剧院的Aqua Dramas也很受欢迎。\n 纽约艺术家公爵莱利于2009年在皇后艺术博物馆上演了一份Naumachia。 [6]\n  众所周知，Naumachia在私人公园和花园中的18世纪英格兰发生，比罗马发生的巨大事件更小得多。据信，这些都与帝国，海军至上，海事贸易的概念相连，可以在West Wycombe的湖泊中看到，由弗朗西斯·达希伍德的形状以天鹅为主。 [1]\n    ^ a b c felus，凯特（2006）。 ＆＃34;船和划船在设计的景观中，1720-1820＆＃34;园林历史。 34（1）：22。\n ^这句话在Suetonius，Lives，Claudius，21,1214和一个世纪以后，由Cassius Dio，60,33,3-4举行，他们提到了同一事件，并且可能使用了Sutonius或现在失去的共同来源。 Suetonius给Claudius＆＃39;回复和＃34; aut＆＃34; （＆＃34;或者不是＆＃34;），Naumachiarii误解为一般赦免，很多皇帝的愤怒。查看莱昂，HJ，莫里特里特萨鲁日州，美国理论协会的交易，1939,70,46-47：在账单Thayer＆＃39; S网站上提供在线[1]（2010年1月1日访问） \n^ Coleman，K. M.，＆＃34;发射历史：早期帝国的水生展示＆＃34;，罗马学习，卷。 83（1993），p。 50;罗马学习促进社会，DOI：10.2307 / 300978  - 通过JSTOR（所需订阅）\n  ^ pesala bandara，＆＃39;苏格兰州的玛丽女王和＃39; John Fleming婚礼的水生娱乐伊丽莎白罗斯＆＃39;，玛格丽特·索德，水上猎物和文艺复兴时期的庆祝活动：以纪念Jr Mulryne（ashgate ，2013）。\n ^在皇后区，在低海的战斗中，五月是最好的艺术家胜利，纽约时报，19八月，2009年8月14日[2]\n 本文基于法国维基百科的相应文章的翻译，于2006年6月20日检索。\n （意大利语）F. Coarelli，Aedes Fortis Fortunae，Naumachia Augusti，Castra Ravennatium：La Via Campana Portuensis E Alcuni Edifici Nella Pianta Marmorea Severiana，Ostraka 1,1992,39-54。\n （在意大利语）L. Cordischi，Margine di Topografia Romana的注释：＆＃34; Codeta，次要Codeta＆＃34; E＆＃34; Naumachia Caesaris，Bullettino Della Inseragee Acheologica Comunale di Roma，1999,100,53-62。\n K. M. Coleman，＆＃34;发射历史：早期帝国的水生展示＆＃34;罗马学习杂志83（1993），第48-74页。 \n（以法语）J.-Cl. Golvin，L＆＃39;Amphithétreromain。 Essai sur lathéorisationde sa forme et de ses fonctions，巴黎，1988,50-51,59-61。  A. M. Liberati，S。 v。＆＃34; Naumachia Augusti＆＃34;，在E. Steinby（ed。），Lexicon Topographicum Urbis Romae，III，1996,337。  L. Haselberger（Dir。），＆＃34; Mapping Augustan Rome＆＃34;，罗马考古补充系列50（2002），p。 179。  R. Taylor，＆＃34; Torrent或涓涓细流？ Aqua Alsietina，Naumachia Augusti和Transtiberim＆＃34;，美国考古101（1997），PP。465-492。 ", "note_en": "Jump to navigation  Jump to search  The  naumachia (in  Latin  naumachia, from the  Ancient Greek  ναυμαχία/ naumachía, literally &#34;naval combat&#34;) in the  Ancient Roman world referred to both the staging of  naval battles as mass entertainment, and the basin or building in which this took place.\n   The first known  naumachia was given by  Julius Caesar in Rome in 46 BC on occasion of his quadruple  triumph. After having a basin dug near the  Tiber, capable of holding actual   biremes,   triremes and   quinqueremes, he made 2000 combatants and 4000 rowers, all prisoners of war, fight. In 2 BC for the inauguration of the  Temple of Mars Ultor (&#34; Mars the Avenger&#34;), Augustus gave a grander  naumachia based on Caesar&#39;s model. This naumachia depicted a battle between the Greeks and the Persians and required a basin that was 400 by 600 yards, which was created straddling the Tiber.  [1]   Res Gestæ (§ 23) claimed that 3000 men, not counting rowers, fought in 30 vessels with rams and several smaller boats.\n In 52 AD  Claudius gave what was possibly the most &#34;epic&#34; of these on a natural body of water,  Fucine Lake, to celebrate the completion of drainage work and tunneling on the site. It included one hundred ships and 19,000 combatants,  [1] all of whom were prisoners who had been condemned to death. Suetonius&#39; account, written many years after the event, has them salute the emperor with the phrase  &#34; morituri te salutant&#34; (&#34;those who are about to die salute you&#34;). There is no evidence that this form of address was used on any occasion other than this single  naumachia.  [2]\n The  naumachia was thus a bloodier show than gladiatorial combat, which consisted of smaller engagements and where the combat did not necessarily end with the death of the losers. More exactly, the appearance of  naumachia is closely tied and only slightly earlier than that other spectacle, &#34;group combat&#34;, which did not pit single combatants against one another, but rather used two small armies. There again, the combatants were frequently those sentenced to death and lacked the specialized training of true  gladiators. Caesar, creator of the  naumachia, simply had to transpose the same principle to another environment.\n Through the choreography of the combat, the  naumachia had the ability to represent historical or pseudo-historical themes. Each of the fleets participating represented a maritime power of  Ancient Greece or the  Hellenistic east:  Egyptians and the  Tyrians for Caesar&#39;s  naumachia,  Persians and  Athenians for that of Augustus,  Sicilians and  Rhodeans for that of Claudius. It required significantly greater resources than other such entertainments, and as such these spectacles were reserved for exceptional occasions, closely tied to celebrations of the emperor, his victories and his monuments. The specific nature of the spectacle as well as the historical themes borrowed from the Greek world are closely tied to the term  naumachia. This word, a phonetic transcription of the Greek word for a naval battle ( ναυμαχία/ naumakhía), has since come to also refer to the large artificial basins created for them.\n  Caesar&#39;s  naumachia was probably a simple basin dug into the low-lying ground on the northern or southern banks of the Tiber, and fed by its waters; the exact location is unknown; most likely  Trastavere or the  Campus Martius.  [3] The  naumachia of Augustus is better known: in his  Res Gestæ (23) Augustus himself indicates that the basin measured 1800 × 1200 Roman feet (approximately 533 × 355 meters).  Pliny the Elder (  Natural History, 16, 200), describes an island formed in the center, probably rectangular and connected to the shore by a bridge where the privileged spectators likely sat.\n Taking into consideration the size of the basin and the dimensions of a trireme (approximately 35 × 4.90 meters), the thirty vessels used would hardly be able to manoeuvre. Knowing that the crew of a Roman trireme was approximately 170 rowers and 50 to 60 soldiers, a simple calculation allows us to see that to achieve the number of 3000 men the vessels of Augustus&#39; fleet would have to have held more combatants than an actual fleet. The spectacle thus focused less on the movement of the vessels, and more on their actual presence in the artificial basin and the hand-to-hand combat which developed.\n It was different for Claudius&#39;  naumachia. The two fleets each consisted of 50 vessels, which corresponds to the number of vessels in each of the two military fleets based at  Misenum and at  Ravenna. Lake Fucino was large enough that only part of it was needed, surrounded by pontoons, and there was room enough for the vessels to manoeuvre and ram each other. The  naumachia of Claudius therefore truly reproduced naval combat.\n According to  Sextus Julius Frontinus in   De aquaeductu ( De aquis urbis Romæ, 11, 1-2:  opus naumachiæ), the water supply for the  naumachia of Augustus was specially constructed, with the surplus used to water neighbouring gardens in the Trans Tiberim. This was the  Aqua Alsietina  aqueduct, remains of which have been found on the slopes of  Janiculum (the &#34;8th hill of Rome&#34;) below the monastery of  San Cosimato. There are several theories as to the precise location of the site; the latest of which places it between  Via Aurelia in the north and the church of  San Francesco a Ripa in the southeast, in the loop of the Tiber. The republican viaduct discovered in the Via Aurelia near  San Crisogono may also have served as a conduit for the basin.\n The basin did not last very long. During the reign of Augustus it was partly replaced (Suetonius,  Augustus, 43, 1) by the  nemus Cæsarum (sacred forest of the Caesars), later renamed &#34;forest of Gaius and Lucius&#34; for the grandsons of Augustus (Dion Cassius, 66, 25, 3). This vast area was probably built upon by the end of the 1st century.\n   A new development occurred during the reign of  Nero: a  naumachia in an  amphitheatre. Suetonius ( Nero, XII, 1) and  Dio Cassius ( Roman History, LXI, 9, 5) speak of such a spectacle in 57 AD in a wooden amphitheatre inaugurated by the last of the  Julio-Claudian dynasty. Nothing is known of the site other than that it was built on the  Campus Martius. Nero presented another  naumachia in 64 AD. This was preceded by hunts and followed by gladiatorial combat and a great banquet (Dio Cassius, LXII, 15, 1). It is unknown what form these games took. It was probably the same wooden amphitheatre, given that there is no mention of its destruction before the  great fire of Rome which happened shortly afterwards.\n For the inauguration of the  Colosseum in 80 AD,  Titus gave two  naumachiae, one in the Augustinian basin, again using several thousand men, and the other in the new amphitheatre (Dio Cassius, LXVI, 25, 1–4). According to Suetonius ( Domitian, IV, 6–7),  Domitian organised a  naumachia inside the Colosseum, undoubtedly circa 85 AD, and another one in the year 89 AD in a new basin dug beyond the Tiber; with the stone removed serving to repair the  Circus Maximus, which had burnt on two sides. It was probably in the time between these two  naumachia that Domitian completed the network of rooms underneath the Colosseum that are visible today, at the same time precluding such spectacles in the arena.\n The arena at the Colosseum only measured 79.35 × 47.20 meters, far removed from the dimensions of the  Augustinian basin. A  naumachia in the Colosseum could therefore not have been as grand as the previous ones. One can imagine a confrontation between the crews of several reproductions of warships, potentially life-size or reasonably close to it, but actual maneuvers or even floating seems doubtful. It is known that stage-props were used to represent ships, sometimes with mechanisms to simulate shipwrecks, both on stage and in the arena ( Tacitus,  Annales, XIV, 6, 1; Dio Cassius LXI, 12,2).\n  The use of enough water to float vessels in amphitheatres raises technical questions. Amphitheatres were not exclusively used for  naumachiae; they would have been filled and drained rapidly enough for use in gladiatorial combats and other spectacles. The rapid transition between water shows and earth-based shows seems to have been one of the great attractions. Dio Cassius underscores this as it relates to Nero&#39;s  naumachia (LXI, 9, 5);  Martial does as well speaking of Titus&#39;  naumachia in the Colosseum ( Book of Spectacles, XXIV). The only surviving written sources offer no descriptions of the mechanisms or engineering involved. Archaeology provides no clues: the basement of the Colosseum has since been modified. Only two provincial amphitheatres, those at  Verona and  Mérida, Spain, provide any technical evidence.\n The central pit of the Verona amphitheatre was deeper than the rooms normally found underneath the arena, and served as a basin. It was connected to two axial conduits. One, circulating under the West gallery of the arena, was not connected to the drainage system and had to be connected to an  aqueduct in order to fill the basin. The East conduit was deeper and designed to drain water into the  Adige River. The basin at the Mérida amphitheatre, at only 1.5 meters, was shallower than that at Verona. Because it is so shallow—less than the height of a standing man—it cannot be confused with an underground service room. This basin was equipped with access stairs and covered with material similar to that used for swimming pools and  Roman baths. It was also served by two conduits, the western one of which connected to the nearby San Lazaro aqueduct.\n The dimensions of these basins rule out any but the most basic of  naumachiae: the one at Mérida measures a mere 18.5 × 3.7 meters. Only the most modest of water spectacles could have taken place here. This leads one to conclude that, even assuming that the Colosseum had a similar basin before construction of the   hypogeum (underground complex),  naumachiae would have been performed on only a shallow layer of water covering the surface of the arena, the minimum required to float the ships.\n  The introduction of new technologies initially led to an increased number of  naumachiae. The first three  naumachiae were spaced about 50 years apart; the following six, most of which took place in amphitheatres, occurred in a space of 30 years. Less costly in material and human terms, they could afford to be staged more frequently. Less grandiose, they became a feature of the games, but could not be considered exceptional. The  iconography bears witness to this. Of some twenty representations of a  naumachia in  Roman art, nearly all are of the  Fourth Style, of the time of  Nero and the  Flavian dynasty.\n  After the Flavian period,  naumachiae disappear from the texts almost completely. Apart from a mention in the   Augustan History, a late source of limited reliability, only the town records ( fastia) of  Ostia tells us that in 109  Trajan inaugurated a  naumachia basin. This site was discovered in the 18th century on the grounds of the  Vatican City, northwest of the  Castel Sant&#39;Angelos. It is now referred to as the  Naumachia Vaticana, with some sources erroneously calling it the Circus of Hadrian due to the similarities of its shape to that of other excavated circuses, along with the site&#39;s proximity to the Mausoleum of Hadrian. Subsequent digs have revealed the complete site plan. It had  bleachers (tiered stands for spectators) and the surface was about one sixth the size of the Augustan  naumachia. In the absence of any texts, it has to be assumed that it was only used at the time of Trajan.\n Nevertheless, if late Roman Empire sources and persistence into the  Middle Ages in terms of the  toponymy of  naumachia and  dalmachia at the site are taken into consideration, it still existed into the 5th century. Moreover, the presence of bleachers on its perimeter is a strong indicator of regular shows. According to the Ostia municipal records, the inauguration involved 127 pairs of gladiators; leading one to believe that as in the amphitheatre, the restrictive space at Trajan&#39;s basin was not conducive to large combats involving many untrained prisoners, or would have required over-simplification of naval combats, leading to a preference for single combat. In this form, and with a dedicated site,  naumachiae could easily have continued (though likely at a reducing frequency) for several centuries without mention in sources, as they would not have been particularly worthy of mention: they simply lost their grandeur and impressive character.\n In the provinces, the influence of Roman  naumachiae is easily discernible, but limited and reduced to local and innocuous naval games and re-enactments. A competition which went under the name of  naumaciva was part of the  Panathenaic Games between the  Athenian  Ephebos from the Flavian period onward. It replaced the  regattas which had taken place at these games earlier. If  Ausonius is to be believed, (Moselle, 200–2,29), a  naumachia was held on the  Moselle River between local youth.\n      A  naumachia was part of the festivities of Wedding of Arch Duke  Ferdinando I de&#39; Medici and Christine of Lorraine held in the courtyard of the  Palazzo Pitti in  Florence in 1589. There is an etching of the event that was part of an album created by  Orazio Scarabelli to document the wedding festivities.   [4]\n In Scotland  naumachia were staged on a loch in Holyrood park in 1562 for the wedding of  Lord Fleming and on the  Water of Leith in 1581 for the wedding of the  Earl of Moray and  Elizabeth Stewart.  [5]\n A  naumachia was held in  Valencia between the Bridges of the  Turia river, on the occasion of the centenary of the canonization of  Saint Vincent Ferrer in 1755. Another was held in  Milan for  Napoleon in 1807.\n Parc Monceau in  Paris features a  naumachia water feature, surrounded by a colonnade. In 18th and 19th century England, several parks featured mock naval battles with model ships, which were also referred to as  naumachia.  Peasholm Park in  Scarborough, England, still stages such an event. Smaller, theatre-based  aqua dramas were also popular.\n New York artist  Duke Riley staged a  naumachia in 2009 at the  Queens Museum of Art.  [6]\n  Naumachia are known to have occurred in 18th century England in private parks and gardens, abet at a much smaller scale than the vast events that occurred in Rome. It is believed that these were connecting to the concepts of empire, naval supremacy, and  maritime trade, as can be seen in the lake at  West Wycombe, constructed by Sir  Francis Dashwood in the shape of a swan.  [1]\n    ^     a     b     c   Felus, Kate (2006).  &#34;Boats and Boating in the Designed Landscape, 1720-1820&#34;.  Garden History.  34 (1): 22 .\n ^  The phrase is attested in Suetonius,  Lives, Claudius, 21, 1214 and a century later, by Cassius Dio, 60, 33, 3‑4, who referred to the same event and probably used Suetonius or a now lost common source. Suetonius gives Claudius&#39; reply as  &#34;aut non&#34; (&#34;or not&#34;), which the naumachiarii misinterpret as a general pardon, much to the fury of the emperor. See Leon, HJ,  Morituri Te Salutamus, Transactions of the American Philological Association, 1939, 70, 46-47: available online at Bill Thayer&#39;s website  [1] (accessed 1 January 2010)\n ^  Coleman, K. M., &#34;Launching into History: Aquatic Displays in the Early Empire&#34;,  The Journal of Roman Studies, Vol. 83 (1993), p. 50; Society for the Promotion of Roman Studies, DOI: 10.2307/300978  – via  JSTOR  (subscription required)\n  ^  Pesala Bandara, &#39;Mary Queen of Scot&#39;s Aquatic Entertainments for the Wedding of John Fleming to Elizabeth Ross&#39;, Margaret Shewring,  Waterborne Pageants and Festivities in the Renaissance: Essays in Honour of J. R. Mulryne (Ashgate, 2013).\n ^  In Queens, a Battle on the Low Seas, and May the Best Artist Win, New York Times, Libby Nelson, Aug. 14, 2009  [2]\n This article is based on a translation of the  corresponding article from the French Wikipedia, retrieved on June 20, 2006.\n (in Italian) F. Coarelli,  Aedes Fortis Fortunae, Naumachia Augusti, Castra Ravennatium : la  Via Campana Portuensis e alcuni edifici nella Pianta Marmorea Severiana,  Ostraka 1, 1992, 39–54.\n (in Italian) L. Cordischi,  Note in margine di topografia romana : &#34;Codeta, minor Codeta&#34; e &#34;Naumachia Caesaris,  Bullettino della Commissione Acheologica comunale di Roma, 1999, 100, 53-62.\n K. M. Coleman, &#34;Launching into history: aquatic displays in the Early Empire&#34;,   Journal of Roman Studies 83 (1993), pp. 48-74.\n (in French) J.-Cl. Golvin,  L&#39;amphithéâtre romain. Essai sur la théorisation de sa forme et de ses fonctions, Paris, 1988, 50-51, 59-61.\n  A. M. Liberati, s. v. &#34;Naumachia Augusti&#34;, in E. Steinby (ed.),   Lexicon Topographicum Urbis Romae, III, 1996, 337.\n  L. Haselberger (dir.), &#34;Mapping Augustan Rome&#34;,  Journal of Roman Archaeology Supplementary Series 50 (2002), p. 179.\n R. Taylor, &#34;Torrent or trickle? The Aqua Alsietina, the Naumachia Augusti, and the Transtiberim&#34;,   American Journal of Archaeology 101 (1997), pp. 465–492.", "posttime": "2021-06-30 05:05:46", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "naumachia,罗马", "title": "瑙 ", "title_en": "Naumachia", "transed": 1, "url": "https://en.wikipedia.org/wiki/Naumachia", "via": "", "real_tags": ["naumachia", "罗马"]}, {"category": "", "categoryclass": "", "imagename": "2819ed6204ae19936d79fa7a7fad8f17.png", "infoid": 1068735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "完整堆栈工程师（员工/校长） ", "note_en": "Full Stack Engineer (Staff / Principal)", "posttime": "2021-06-30 05:05:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "build,工程师", "title": "Buildzoom（更好的方式来构建定制家庭）正在雇用一个主要的工程师 ", "title_en": "BuildZoom (better way to build custom homes) Is hiring a Principal Engineer", "transed": 1, "url": "https://jobs.lever.co/buildzoom", "via": "", "real_tags": ["build", "工程师"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "明尼阿波利斯有幸成为遭遇乐趣的后果的乐趣。他们拒绝痛苦，有时更多。因为它拒绝了现在。任何一个痛苦的痛苦：让整个韭菜和值得鄙视Quae.ea收到了事件的麻烦。乐趣或这些调查。更糟糕的事情是相同的。提供那些逃离仇恨后果或仇恨后果的人的乐趣，或由Voluptatem.quia。有一个希望编辑。办公室谴责疼痛。因为他们被发现了。\n 以下是在我的操作系统（Linux）和Web浏览器（Internet Explorer）上使用此文本框的一些细微差别：\n 双击选择一个单词，三次单击选择整行。 IFI双击或三点次单击，1可以拖动鼠标扩展TheSelection Word-Wise或线路，而不仅仅是性格。这也适用于这个博客文章的文本。\n 保持控制和按下右键将通过字样文件移动。始终移动到下一个或先前单词的开始或结尾，因此按“控制左，左控制，控制权”将结束不同于“控制”中心“单独。将“Shift”添加到其中任何一个都将默认文本选择。\n 单击文本末尾后的任何空格将使CURSORAFER将最后一个字符置于最后一个字符，即使您单击最后一个字符的左侧。这使得可以轻松启动将文本附加到结尾。\n 单击并从任何点拖动，1可以直接向上拖动鼠标，超过文本框或甚至整个Web浏览器的界限，从该点到“文本框的开始”。 （谢谢这一点不太努力）\n 选择文本和中间点击任何地方将粘贴ClickedLocation的文本。这使用单独的，不同于一个访问的剪贴板，其中包含了一个与CTTL + C / CTRL + V. 1还可以使用Shift + Insert粘贴来自此辅助连接板的文本（这称为“主选择”）。 \n当我在日常生活中使用表单控制时，我依靠所有这些细微差别。这只是英语，顺便说一句。我经常键入日语，这是一个完全存在的外星人术语。这是Android（移动Isanother野兽的看起来也是如此！）：\n    有一个看不见的编辑缓冲区，所以我可以输入“宾夕法尼亚州”（或只是p）托迭我想要的东西。我可以键入“新”，然后按下以选择“新泽西州”。如果我犯了一个错误，我一直追踪我在我的头部键入的东西，我可以用守卫校正，它只是有效。我在这两个临时生活中生活，并将这两个击键都在我的肌肉记忆中。用我的地址填写AFForm并使用这样的输入框来选择我的州居住，我不到一秒钟。\n 您无法以家庭成长的形式控制捕获所有这些细微差别，或者甚至接近它，但无论如何，许多JavaScript程序员都这样做。每当IENCOUNTER自定义表单控制时，将FORMCREASE放置到秒内完成的时间到一分钟。\n 对自己来说，这只是非常讨厌。想象一下，如果你错过了同样的情况。标准表单输入到处都是在思想中设计，因此您已经习惯了它们，可以轻松地填写标准浏览器控件的表单。但是，当你击中一个javascript-poweredorgorganic笼子的非转基因文本框时，你就搞砸了。\n 用户学会使用其计算机数百个细微差别。用户依赖的确切功能将在操作性系统，浏览器，硬件，自然语言，身体能力和个人备忘录和经验之间变化。每天都有几十个是甚至没有发生过的每天都有几十个工作流程。\n 用Javascript制作自定义表单控制将使人们变得更糟。只是不这样做。浏览器内置控件是不足的。 ", "note_en": "Consectetur qui consequatur voluptatibus voluptatem sit sint perspiciatis. Eos aspernatur ad laboriosam quam numquam quo. Quia reiciendis illo quo praesentium. Dolor porro et et sit dolorem quisquam totam quae.Ea molestias a aspernatur dignissimos suscipit incidunt. Voluptates in vel qui quaerat. Asperiores vel sit rerum est ipsam. Odio aut aut voluptate qui voluptatem.Quia consequatur provident fugiat voluptatibus consequatur. Est sunt aspernatur velit. Officiis a dolorum accusantium. Sint est ut inventore.\n Here are some of the nuances of using this text box on my operating system(Linux) and web browser (Firefox):\n Double clicking selects a word, and triple-clicking selects the whole line. IfI double- or triple-click-and-hold, I can drag the mouse to expand theselection word-wise or line-wise, not just character-wise. This works with theparagraphs of text in the body of this blog post, too.\n Holding control and pressing right will move move word-wise through the file.It always moves to the start or end of the next or prior word, so pressing“control+left, control+left, control+right” will end up in a differentposition than “control+left” alone. Adding “shift” to any of these will mutatethe text selection.\n Clicking any of the whitespace after the end of the text will put the cursorafter the last character, even if you click to the left of the last character.This makes it easy to start appending text to the end.\n Clicking and dragging from any point, I can drag the mouse straight upward,exceeding the bounds of the text box or even the entire web browser, to selectall text from that point to the start of the text box. (Thanks minus formentioning this one)\n Selecting text and middle clicking anywhere will paste the text at the clickedlocation. This uses a separate, distinct clipboard from the one accessed withctrl+c/ctrl+v. I can also use shift+insert to paste text from this secondaryclipboard (this is called the “primary selection”).\n I rely on all of these nuances when I use form controls in my everyday life.This is just for English, by the way. I often type in Japanese, which has anentirely alien set of nuances. Here’s what that looks like on Android (mobile isanother beast entirely, too!):\n    There’s an invisible edit buffer, so I can type “Pennsylvania” (or just P) toselect what I want. I can type “New” and then press down to select “New Jersey”.If I make a mistake and I’ve kept track of what I’ve typed in my head, I can usebackspace to make a correction, and it just works. I have lived in both of theseplaces, and worked both of these keystrokes into my muscle memory. Filling out aform with my address on it and using an input box like this to select my stateof residence takes me less than a second.\n You cannot capture all of this nuance in a home-grown form control, or evenanything close to it, but many JavaScript programmers do it anyway. Whenever Iencounter a custom form control, the time required to complete the formincreases from under a second to as much as a minute.\n For myself, this is just very annoying. Imagine the same situation if you wereblind. The standard form inputs work everywhere, and are designed withaccessibility in mind, so you’re used to them and can easily fill in forms whichuse the standard browser controls. But, when you hit a JavaScript-poweredorganic cage-free non-GMO text box, you’re screwed.\n There are hundreds of little nuances that users learn to use their computersefficiently. The exact features a user relies on will vary between operatingsystems, browsers, hardware, natural languages, physical ability, and personalpreferences and experience. There are dozens of tiny workflows that peopledepend on every day that have never even occurred to you.\n Making a custom form control with JavaScript is going to make life worse for alot of people. Just don’t do it. The browser’s built-in controls are quitesufficient.", "posttime": "2021-06-30 05:05:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "捕获,nuance,控制", "title": "您无法捕获表单字段的细节 ", "title_en": "You can't capture the nuance of my form fields", "transed": 1, "url": "https://drewdevault.com/2021/06/27/You-cant-capture-the-nuance.html", "via": "", "real_tags": ["捕获", "nuance", "控制"]}, {"category": "", "categoryclass": "", "imagename": "0801ca663741555e36988bab23e7b21f.jpg", "infoid": 1068733, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "洛杉矶县已经重新发出了一个在室内戴着面具的建议，无论疫苗接种状态如何，因为公共卫生官员在达美德拉达州的冲突以及从印度传播的突变。\n 虽然疾病控制和预防的中心在可能在疫苗的美国人在室内接种疫苗不再需要面具，但世界卫生组织表示比以往任何时候都更加“紧急”，以佩戴面膜来阻止新的变体传播。\n   引用三角洲变种，洛杉矶县公共卫生部发出的更新指导，“强烈建议”无论疫苗接种状况如何。该建议目前是自愿的。\n  加州的15日六月重新开放与CDC的指导保持一致，允许完全接种疫苗的人在公共室内空间中放弃面具，La County Supervisor Kathryn Barger在合唱中敦促州长Gavin Newsom对整个州的终身面具授权。\n  La县公共卫生官员表示，尽管人们完全接种疫苗的人从Delta Variants受到良好的保护，但每个人都应该专注于最大保护“直到我们更好地了解了Delta Variant正在传播的方式和谁。\n  La County有123人被证实感染了Delta Variant，根据洛杉矶时报编制的数据，有10个完全接种疫苗的，三个，疫苗有100次接种疫苗，100名未接受。它是加利福尼亚州的第三普遍 - 培养6月份的冠状病毒病例的14.5％，少于美国的平均值20％。\n  洛杉矶国家的举动是印度的警告，＆＃34; delta plus＆＃34;从恒河河流变种出现的突变。 \n所谓的Delta Plus或Ay.01突变含有原始Delta变体（B.1.617.2）的特征，也是称为K417N的突变，其在南非β变种中被发现。\n  三角洲Plus于4月5日在印度检测到，但在6月11日公共卫生英国公报公共卫生英国公报公共报告的突变中，突变突破，当时它确定了加拿大，德国，俄罗斯，尼泊尔，瑞士，印度瑞士63例，波兰，葡萄牙和日本。\n  截至6月16日，美国（83）和英国最多的人数增长至197例（36），新国家加入包括火鸡在内的名单。\n  总干事的高级顾问Bruce Aylwark博士告诉星期五新闻发布会，这些议会需要保持完全接种疫苗的人，以“扮演安全”。\n “因为你最终可以作为传输链的一部分。您实际上可能无法完全受到保护。有时疫苗不起作用，“他说。\n  “我认为我们想要小心的第一条消息是说一旦你接种疫苗，你就可以前进，做任何事情。是的，您可以减少一些措施，不同国家在这方面有不同的建议，但仍有必要谨慎。“\n         想在稍后读取或引用您最喜欢的文章和故事？立即启动您的独立高级订阅。 ", "note_en": "The county of Los Angeles has reissued a recommendation for wearing masks indoors, regardless of vaccination status, as public health officials clash over the Delta variant and its mutations spreading from India.\n While the Centres for Disease Control and Prevention issued guidance in May that vaccinated Americans no longer need masks indoors, the World Health Organisation says it’s more “urgent” than ever to wear masks to stop the spread of new variants.\n   Citing the Delta variant, the Los Angeles County Department of Public Health issued  updated guidance that “strongly recommends” indoor masking regardless of vaccination status. The recommendation is currently voluntary.\n  California’s 15 June reopening aligned with the CDC’s guidance allowing fully vaccinated people to forgo masks in public indoor spaces, with LA County Supervisor Kathryn Barger among the chorus urging governor Gavin Newsom to life mask mandates across the state.\n  LA County public health officials said that despite people who are fully vaccinated appearing well protected from Delta variants, everyone should focus on maximum protection “until we better understand how and to who the Delta variant is spreading”.\n  There have been 123 people in LA County confirmed to be infected with the Delta variant, with 10 in fully vaccinated, three in partially vaccinated, and 100 in unvaccinated, according to data compiled by   The Los Angeles Times. It is the third-most-common in California – making up 14.5 per cent of coronavirus cases in June, less than the average of 20 per cent across the US.\n  LA Country’s move comes as India is warning of a new &#34;Delta plus&#34; mutation emerging from the Ganges River variant.\n The so-called Delta Plus, or Ay.01 mutation, contains characteristics of the original Delta variant (B.1.617.2) and also of the mutation known as K417N, which was discovered in the Beta variant from South Africa.\n  Delta Plus was first detected in India on 5 April but the mutation was not formally acknowledged until being publicly reported as K417N in a  Public Health England bulletin on 11 June, when it identified 63 cases in Canada, Germany, Russia, Nepal, Switzerland, India, Poland, Portugal and Japan.\n  By 16 June that number grew to 197 cases with the most in the United States (83) and Britain (36), and new countries joining the list including Turkey.\n  Dr Bruce Aylward, senior advisor to the Director-General, told the Friday press conference that masks need to remain on fully vaccinated people to “play it safe”.\n “Because you could end up as part of a transmission chain. You may not actually be fully protected. Sometimes the vaccines don’t work,” he said.\n  “I think the first message we want to be careful about is saying once you’re vaccinated you can just ahead and do whatever. Yes, you can reduce some measures and different countries have different recommendations in that regard but there is still the need for caution.”\n         Want to bookmark your favourite articles and stories to read or reference later? Start your Independent Premium subscription today.", "posttime": "2021-06-30 05:05:03", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变体,reinstates,疫苗", "title": "由于Delta变体，La恢复室内遮罩用于疫苗接种疫苗 ", "title_en": "LA reinstates indoor masking for Covid vaccinated due to delta variant", "transed": 1, "url": "https://www.independent.co.uk/news/world/americas/delta-variant-covid-mask-la-b1874929.html", "via": "", "real_tags": ["变体", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "c3afdf0b8017bdef6d330767520257de.jpeg", "infoid": 1068732, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "芯片制造商英特尔公司正在推迟生产其最新筹码之一，以提高性能，这是新行政长官Pat Gelsinger下的第一个重要产品挫折，因为他寻求重建公司的竞争力。\n  英特尔现在正计划开始生产用于服务器的下一代中央处理单元 -  2022年初的大脑 - 在此前将准备好今年已准备好，该公司的公司副总裁，他管理服务器的公司副总裁-Chip业务，在星期二博客帖子中说。\n  Spelman女士额外的时间允许英特尔提高芯片的性能，特别是围绕数据处理和人工智能处理的高度珍贵度量。她写道，生产现已开始于明年的第一季度开始，并在第二季度上升。\n  新筹码的延误是戈尔辛格先生的第一个，他于2月份成为行政长官，这在其前任鲍勃天鹅下的筹码进展之后的主要延误​​。英特尔差点几乎一年前表示，下列甚至更先进的芯片与超小晶体管才能直到明年下年，大约一年晚于最初预期。\n  戈尔辛格先生发誓要使英特尔在生产新芯片方面更加可靠。在他的第一个股东大会上作为公司的首席执行官，他说，英特尔旨在为我们的客户提供“我们的客户可以依赖的领导产品的稳定节奏”。\n  您将收取$ +税（如果适用）为华尔街日记。您可以随时在客户中心的任何时间更改帐单偏好或致电客户服务。您将在率或条款的任何变化提前通知您。您可以随时通过调用客户服务来取消订阅。 ", "note_en": "Chip maker Intel Corp. is delaying production of one of its newest chips to improve performance, the first significant product setback under new Chief Executive Pat Gelsinger as he seeks to rebuild the company’s competitiveness.\n  Intel now is planning to start producing the next generation of central processing units for servers—the brains of those machines—in early 2022 after previously saying it would be ready late this year, Lisa Spelman, the company’s corporate vice president, who manages the server-chip business, said in a Tuesday blog post.\n  The additional time, Ms. Spelman wrote, would allow Intel to improve the chips’ performance, in particular around the highly prized metrics of data handling and artificial-intelligence processing. Production is now set to begin in next year’s first quarter and ramp up in the second quarter, she wrote.\n  The delay of the new chips is the first under Mr. Gelsinger, who  became chief executive in February following major delays in chip-making advances under his predecessor, Bob Swan. Intel almost a year ago said  the following generation of even more advanced chips with super-small transistors wouldn’t be ready until late next year, about a year later than initially expected.\n  Mr. Gelsinger has vowed to make Intel more reliable in producing new chips. At his first shareholder meeting as the company’s CEO in May, he said Intel was aiming to deliver a “steady cadence of leadership products that our customers can depend upon.”\n  You will be charged $  + tax (if applicable) for The Wall Street Journal. You may change your billing preferences at any time in the Customer Center or call  Customer Service. You will be notified in advance of any changes in rate or terms. You may cancel your subscription at anytime by calling  Customer Service.", "posttime": "2021-06-30 05:04:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,芯片,挫败,delays", "title": "英特尔延误了新芯片，首先挫败了首席执行官Gelingeringer的周转努力 ", "title_en": "Intel Delays New Chip in First Setback for CEO Gelsinger’s Turnaround Effort", "transed": 1, "url": "https://www.wsj.com/articles/intel-delays-new-chip-in-first-setback-for-ceo-gelsingers-turnaround-effort-11624988292", "via": "", "real_tags": ["英特尔", "芯片", "挫败", "delays"]}, {"category": "", "categoryclass": "", "imagename": "416e619425bf6d4986448b76a40bc9f6.jpg", "infoid": 1068730, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "能够在整体到移动设备上下载视频的能力是Netflix和类似服务的较少特征，几年来几年，但体验并非没有挫折。 Netflix Mobile App的新更新目标是其中一个挑战。\n  从今天开始，Version 7.64或更高版本的Android手机或平板电脑用户即使该视频Hasn＆＃39; t and＃39完成下载到他们的设备，也能够开始在Netflix移动应用程序中查看视频下载。公司和＃39;宣布新功能的新增功能说明了它＆＃39;＆＃39;＆＃34;不可靠的wifi或最大的数据计划＆＃34;防止了一个完全下载的视频。因此，如果您试图在海岸到海岸航班之前在机场Wi-Fi上下载电影，但只有在您才能挂上船只之前只有80％，您现在至少可以在等待机会完成后观看电影的一部分下载。一旦您再次进行了可靠的连接，即使您开始在临时观看视频，下载也可以拾取它离开的位置。\n    您＆＃39; ll在与任何完全下载的文件中找到部分下载的视频。\n 该功能目前仅适用于Android设备，但产品创新的Netflix VP Keela Robison将Netflix＆＃34写入Netflix＆＃34;在未来几个月开始测试iOS。＆＃34;下载功能从未在桌面Web上提供，仍然存在此处的情况。\n 这是第一次在Netflix Mobile App功能上获得第一次Dibs的第一次＆＃39; t。 Netflix介绍＆＃34;智能下载＆＃34;基本下载功能后几年;在您观看时，此新增添加删除了电视集，同时也以序列自动下载下一个。它以后来到ios。然后有＆＃34;为您下载，＆＃34;一个特征，可自动下载基于过去的视图推荐的内容。\n 为您的下载仍然只在Android上可用，但Netflix说它＆＃39; s也很快开始测试iOS上的功能。 ", "note_en": "The ability to download videos in their entirety to a mobile device has been one of the lesser-known features of Netflix and similar services for a few years now, but the experience has not been without its frustrations. A new update to the Netflix mobile app targets one of those challenges.\n  Starting today, Android phone or tablet users on version 7.64 or higher will be able to start viewing a video download in the Netflix mobile app even if that video hasn&#39;t finished downloading to their device. The company&#39;s  newsroom post announcing the new feature says it&#39;s intended for situations when &#34;unreliable wifi or a maxed-out data plan&#34; prevented a video from fully downloading. So if you tried to download a movie on airport Wi-Fi before your coast-to-coast flight but only got to 80 percent before you had to board, you can now at least watch part of the movie while waiting for an opportunity to finish the download. Once you have a reliable connection again, the download can pick up where it left off even if you started watching the video in the interim.\n    You&#39;ll find the partially downloaded videos in the same downloads tab as any fully downloaded files.\n The feature is only available on Android devices at present, but Netflix VP of Product Innovation Keela Robison writes that Netflix will &#34;begin testing on iOS in the coming months.&#34; The download feature was never available on desktop web, and that remains the case here.\n This isn&#39;t the first time Android has gotten first dibs on a Netflix mobile-app feature. Netflix introduced &#34;Smart Downloads&#34; a couple of years after the basic download feature; this new addition deleted a TV episode after you watched it while also automatically downloading the next one in sequence. It came to iOS much later. And then there was &#34;Downloads For You,&#34; a feature that automatically downloads content that is recommended based on your past viewing.\n Downloads For You is still only available on Android, but Netflix says it&#39;s going to start testing the feature on iOS soon, too.", "posttime": "2021-06-30 04:27:13", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "ios,android,introduces,下载", "title": "Netflix再次为Android引入了新功能，但不是iOS（尚未） ", "title_en": "Netflix once again introduces new features for Android, but not iOS (yet)", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/06/new-netflix-mobile-app-feature-allows-viewing-partially-downloaded-videos/", "via": "", "real_tags": ["ios", "android", "下载"]}, {"category": "", "categoryclass": "", "imagename": "ff988a1aba1328219350a0d739ec4e9f.jpg", "infoid": 1068729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Python实现Pyston旨在加快编程语言和＃39;用于Web应用程序的代码。 Creator Kevin Modzelewski告诉TechRepublic项目在下一个项目。\n  当凯文Modzelewski和他的同事于2014年开始创建Pyston时，他们有一个非常简单的目标：降低在Dropbox＆＃39; S服务器上运行Python代码的成本，通过使代码本身更快。\n ＆＃34;我们呈指数级增长，因此我们的服务器成本呈指数级增长，＆＃34; modzelewski告诉TechRepublic。 ＆＃34;如果我们可以让Python运行得更快，我们会花费少钱运行Python。＆＃34;\n    当公司于2017年从Python移开并取消了Pyston项目时，Doplbox的原始成本减少计划变成了更大的Modzelewski项目。\n 他在开发的语言中实现了强烈的Python在开发人员社区中有很大的需求，而虽然有足够的工具来提高较小应用中的性能，但没有为大型业务逻辑类型应用程序设计如Dropbox。\n ＆＃34;那里有很多工具，帮助你更快地运行python，但是有没有任何适合Dropbox＆＃39;使用案例，＆＃34; Modzelewski说。\n ＆＃34;这是Python市场的一个地区，花了很多钱，但却没有很多工具是为了帮助而开放。它是在服务下。＆＃34; \n今天快进至今，Pyston现在在2.2版中，已经开放了，Modzelewski和Sexteder Marius Wachtler现在将该项目领导为联合创始人。最新实现有关Python 3.8.8的绩效改进是30％的绩效改进，具有开发人员可以简单地将Python应用程序丢弃到Pyston并进入，而无需重写其代码。它＆＃39; s也是一个＆＃34;完全分开的东西＆＃34;大约七年前为Dropbox建造的Modzelewski和同事。\n ＆＃34;我们非常希望您能够丢弃Pyston而不是正常的Python，而且不必做一个其他的东西，＆＃34; Modzelewski说。\n ＆＃34;在我们开始时，Dropbox＆＃39; S代码库是数百万的代码。你可以和＃39; t真正合理地重写了另一种语言或注释整个事情。＆＃34;\n Pyston在一开始的目标是创建一个Python实现，可以将编程语言与与C ++这样的传统系统语言相当的性能推推。\n 这将意味着剥离一些cpython＆＃39; s的缺少使用的功能 - 例如调试检查 - 并使用JavaScript，C＃和Java中使用的即时（JIT）技术，以将执行速度更长。\n  多年来，多年来，多年来，虽然这么多的功能是很难说出重要的事情，而且可能会被抛弃的东西，说明：＆＃34;我认为自己非常了解Python，我没有有几个功能＆＃ 39; T知道直到实际上必须自己实施它们。我就像，＆＃39;我从来没有听过这个，我从未读过这件事，我从未听说过任何使用它的人和＃39;。＆＃34;\n 唯一弄清楚哪些功能对开发人员有用的方法，这不是简单地开始删除它们，然后等待反馈。 ＆＃34;我们想开始删除其中一些，以便我们可以从人们开始反馈，＆＃39;嘿，实际上我使用这个功能，你删除了它＆＃39;＆＃34; Modzelewski说。 \n这种积极的优化方法使Pyston能够通过CPython获得显着的性能改进。虽然30％是正式吹捧的数字，但Modzelewski表明这是一个保守的估计，由于Pyston使用更加现实的性能基准，更好地反映了Pyston开发人员可能实际上遇到它的事实。\n ＆＃34;我们测量比其他项目不同的性能，所以我们的30％ISN＆＃39; T直接相当。如果我们要以同样的方式衡量表现，我们的号码是更高的，＆＃34;他说。\n ＆＃34;有时我们认为，我们应该这样做吗？它听起来更好地＆＃39;更多的百分比＆＃39;快点。但是，我们试图衡量表现，因为我们的用户如何实际遇到它，那么最终会给我们提供较低的数字，而且我们的30％。＆＃34;\n Python Creator Guido Van Rossum拥有自己称为Python＆＃34;大而慢＆＃34;，它在移动应用程序开发和Web浏览器中阻碍了它的摄取。该语言仍然主要针对数据科学和机器学习，以及后端Web服务 - 虽然这主要由JavaScript主导，越来越多地，Microsoft＆＃39; sceepscript superset。\n  同时，Pyston专门针对Web应用程序。虽然有很多工具加速Python代码 - 例如＆＃39;竞争对手＆＃39; Pyton实现Pypy  -  Modzelewski解释说，由于依赖性的数量，这些Don＆＃39; T往往适用于Web应用程序。\n 它的这种差距在市场上的差距是针对性的。 ＆＃34;我们希望成为加快Python Web应用程序的进入的进程，我的意思是在公司和＃34的服务器上运行的组件。他补充道。\n  Guido Van Rossum承诺在即将推出的版本中致力于掌握Python＆＃39的性能问题，大胆地承诺为Python 3.11中的语言速度加倍，其中三个Python分支中的一个用于2022。 \nModzelewski表示，Python和Pyston正在尝试实现的相似之处，但注意到较新版本的Python Won＆＃39; t转换为Pyston;虽然团队已备份一些较新的Python代码，但它将继续瞄准版本Python 3.8。\n 无论如何，Modzelewski认为Pyston可以继续具有竞争力。 ＆＃34;我们＆＃39; VE更具侵略性[比Python]与我们＆＃39; ll做的类型，＆＃34;他说，注意到Pyston＆＃39; S JIT编译器提供了它在它处置的工具方面的优势。\n   目前没有办法，以确定有多少开发人员在该字段中使用Pyston。该项目显然有了一个充满热情和专用的用户，许多人将颂扬Pyston discord频道报告错误或只是让他们知道它们是如何与之相位的。\n Modzelewski表示该项目的主要目标是建立人们将获得价值的东西。 ＆＃34;我认为在这个空间里它真的很容易在令人难以置信的技术上有趣，智力非常有趣的东西，但是没有给用户的有用产品......我们＆＃39;重新服用产品方法，我们想要构建有用，我认为我们这样做。＆＃34;\n Pyston在不断增长的阶段仍然非常重要。后来沿着这条线，团队希望它能够通过多线程来解决Python＆＃39;一种通过多线程的问题 - 一组代码在多个处理核心之间分配的技术 - 尽管Modzelewski指出这一原位并＃39; t语言＆＃39;立即路线图。\n ＆＃34;我觉得长期，我们真的想成为贸易问题很容易接受的东西，很多人都会使用我们。在那里有很多专业的Python优化工具，大多数人都不会使用，＆＃34;他说。\n ＆＃34;我对这个项目的梦想是它只是有点标准建议：＆＃39;嘿，你也可以使用pyston。＆＃39;＆＃34; \n从最热的编程语言到具有最高薪水的作业，获取您需要知道的开发人员新闻和提示。 每周  今天注册 ", "note_en": "Python implementation Pyston aims to speed up the programming language&#39;s code for web applications. Creator Kevin Modzelewski tells TechRepublic where the project is heading next.\n  When Kevin Modzelewski and his colleagues at Dropbox set out to create Pyston in 2014, they had a very simple objective: to lower the costs of running Python code on Dropbox&#39;s servers, by making the code itself faster.\n &#34;We were growing exponentially, so our server cost was growing exponentially,&#34; Modzelewski tells TechRepublic. &#34;If we could get Python running faster, we would spend less money running Python.&#34;\n    The original cost reduction initiative  at Dropbox snowballed into a bigger project for Modzelewski when the company moved away from    Python  in 2017 and cancelled the Pyston project.\n He had realized while working on the language that there was a strong demand for faster Python among the developer community, and while there were plenty of tools around for improving the performance in smaller applications, there were none designed for big, business logic-type applications such as Dropbox.\n &#34;There&#39;s a lot of tools out there for helping you run Python faster, but there weren&#39;t any that were a good fit for Dropbox&#39;s use case,&#34; says Modzelewski.\n &#34;This was an area of the Python market where a lot of money was being spent, but not very many tools were being developed for helping. It was under served.&#34;\n  Fast forward to today and  Pyston is now in version 2.2, and has been open-sourced, with Modzelewski and fellow developer Marius Wachtler now leading the project as co-founders. The latest implementation promises a 30% performance improvement over Python 3.8.8, with a key benefit being that developers can simply drop their Python applications into Pyston and get going, without having to rewrite their code. It&#39;s also a &#34;completely separate thing&#34; to what Modzelewski and fellow developers built for Dropbox some seven years ago.\n &#34;We very much want you to be able to just drop in Pyston instead of the normal Python, and not have to do a single other thing,&#34; says Modzelewski.\n &#34;At the time we started, Dropbox&#39;s code base was millions of lines of code. And you can&#39;t really reasonably rewrite that into another language or annotate the whole thing.&#34;\n The goal for Pyston at the outset was to create a Python implementation that could push the programming language&#39;s performance to those comparable to traditional systems languages like    C++ .\n This would mean stripping out some of CPython&#39;s less-used features – such as debugging checks – and using just-in-time (JIT) techniques, such as those used in JavaScript, C# and Java, to edge up execution speeds.\n  Yet so many features had been added to Python over the years that it was hard to tell what was important and what could be ditched, says Modzelewski: &#34;I consider myself pretty knowledgeable about Python, and there were several features I didn&#39;t know about until actually having to implement them myself. I was like, &#39;I&#39;ve never heard about this, I&#39;ve never read about this, I&#39;ve never heard of anyone using it&#39;.&#34;\n The only way to figure out which features were useful to developers and which were not was to simply begin removing them and then wait for feedback. &#34;We wanted to start removing some of them so that we could start getting feedback from people saying, &#39;Hey, actually I use that feature and you removed it&#39;.&#34; Modzelewski says.\n This aggressive approach to optimization has allowed Pyston to gain significant performance improvements over CPython. While 30% is the figure officially touted, Modzelewski suggests that this is a conservative estimate, owing to the fact that Pyston uses more realistic performance benchmarks that better reflect how Pyston developers might actually experience it.\n &#34;We measure performance pretty differently than other projects do, so our 30% isn&#39;t directly comparable. If we were to measure performance the same way other people did our number would be higher,&#34; he says.\n &#34;Sometimes we think, should we do that? It sounds better to be &#39;more percent&#39; faster. But we try to measure performance similarly to how our users might actually experience it, and so that ends up giving us a lower number, and that&#39;s 30% for us.&#34;\n Python creator Guido van Rossum has himself called Python &#34;big and slow&#34;, which has  hindered its uptake in mobile app development and within web browsers. The language remains primarily aimed at data science and machine learning, as well as backend web services – though this is primarily dominated by JavaScript, and increasingly, Microsoft&#39;s TypeScript superset.\n  Pyston, meanwhile, is targeting web applications specifically. While there are a lot of tools for speeding up Python code – such as &#39;rival&#39; Pyton implementation PyPy – Modzelewski explains that these don&#39;t tend to work well for web applications, owing to the number of dependencies.\n It&#39;s this gap in the market that Pyston is targeting. &#34;We&#39;re looking to become the go-to way of speeding up Python web applications, by which I mean the components that run on a company&#39;s servers,&#34; he adds.\n  Guido van Rossum has pledged to address Python&#39;s performance issues in upcoming versions, boldly pledging to  double the language&#39;s speed in Python 3.11, one of three Python branches slated for a pre-alpha release in 2022.\n Modzelewski says there are similarities in what Python and Pyston are trying to achieve, but notes that any speed improvements in newer versions of Python won&#39;t translate over to Pyston; while the team has back-ported some of the newer Python code, it will continue to target version Python 3.8.\n Regardless, Modzelewski believes that Pyston can continue to be competitive. &#34;We&#39;ve been a lot more aggressive [than Python] with the types of things we&#39;ll do,&#34; he says, noting that Pyston&#39;s JIT compiler offers an edge in terms of the tools it has at its disposal.\n   There&#39;s currently no way of knowing for sure how many developers are using Pyston in the field. The project clearly has a following of enthusiastic and dedicated users, many of who will chime in to the Pyston Discord channel to report bugs or just let them know how they&#39;re getting on with it.\n Modzelewski says the primary goal of the project is to build something that people will get value from. &#34;I think in this space it&#39;s really easy to build something incredibly technically interesting, something intellectually very interesting, but isn&#39;t a useful product to users...We&#39;re very much taking a product approach to this where we want to build useful, and I think we&#39;re doing that.&#34;\n Pyston is still very much in the growing phase. Later down the line, the team hopes it will be able to address Python&#39;s issues with multithreading – a technique by which a single set of code is split between several processing cores – though Modzelewski notes that this isn&#39;t on the language&#39;s immediate roadmap.\n &#34;I think long term, we really want to be something where the trade offs are easy enough to accept, that a lot of people would use us. There&#39;s a lot of specialized Python optimization tools out there that most people wouldn&#39;t typically use,&#34; he says.\n &#34;My dream for the project is that it would just be sort of standard advice: &#39;Hey, you might as well use Pyston.&#39;&#34;\n From the hottest programming languages to the jobs with the highest salaries, get the developer news and tips you need to know. Weekly\n        Sign up today", "posttime": "2021-06-30 04:19:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "python,程序,代码,programming,编程", "title": "Python实现Pyston旨在加快编程语言的Web应用程序代码 ", "title_en": "Python Implementation Pyston Aims To Speed Up the Programming Language's Code for Web Applications", "transed": 1, "url": "https://www.techrepublic.com/article/faster-python-programming-how-these-developers-built-pyston-and-where-it-goes-next/", "via": "", "real_tags": ["python", "程序", "代码", "编程"]}]