[{"category": "", "categoryclass": "", "imagename": "58c0b720684ba2c3499c5662beb76050.png", "infoid": 1012983, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在“末日2”的末尾，玩家将面对罪恶之像，这真的只是一个巨大而令人毛骨悚然的纹理，可以吐出恶魔。但这场老板之战有一些奇怪的机制和怪癖，包括一个小小的编程疏忽，这可能会导致玩家不得不等待超过十年的时间才能让恶魔产卵。\n作为末日专家和YouTube上的超级粉丝，德西诺最近发布了一段视频，涵盖了末日II标志性的最终老板的所有奇怪的怪癖和机制。例如，你知道吗，由于纹理对齐方式的错误，恶魔的头上有一个小缺口？一旦德西诺指出这一点，我就忍不住要去看它。\n更有趣的是，恶魔繁殖是如何与这位最终的老板合作的。这一切都归结于漂浮的立方体，它们是从一个看不见的产卵器发射出来的。这些立方体根据一定的几率产生不同的恶魔。例如，小鬼是最常见的，而恼人的Arch-viles很少产卵。(谢天谢地，它们的产卵率不到1%。)。\n这些浮动立方体是由游戏编程中的简单系统和公式控制的。而且在很大程度上，这些系统运行得很好。但也有一些怪癖。其中一个怪癖涉及到游戏如何计算这些幼崽何时何地产卵。如果一个立方体产卵器和它的目标位置共享一个特定值，那么立方体就会像永远一样继续前进，永远不会产生它的恶魔。然而，这并不是真正的永远。相反，这只是一段很长的时间。德西诺做了计算，计算出这个立方体需要11.6年才能最终产生恶魔的有效载荷。\n这是一个漫长的等待，仅仅是为了产卵，并立即被末日之徒和他的超级猎枪杀死。\n众所周知的事实是，1993年的经典“末日”最终将被移植到所有东西上。你可以的。\n多读。\n末日之人是一个令人难以置信的强壮和强大的战士，他可以击穿混凝土墙，撕裂…。\n多读。\nKotaku周末编辑|Zack Zwiezen是一位居住在堪萨斯州的作家。他曾为GameCritics、USGamer、Kill Screen&Amp；Entertainment Fuse撰稿。", "note_en": "At the end of  Doom II players face off against The Icon of Sin, which is really just a large and creepy texture that spits out demons. But this boss fight has some odd mechanics and quirks, including a small programming oversight that could lead to players having to wait over a decade for a demon to spawn.\n  Decino, a  Doom expert and superfan on YouTube, released a video recently covering all the strange quirks and mechanics of  Doom II’s iconic final boss. For example, did you know that due to a mistake in how the textures were aligned, there’s a small gap in the demon’s head? Once   Decino pointed it out I can’t stop seeing it.\n     More interesting is how demon spawning works with this final boss. It all comes down to floating cubes, which are launched from an invisible spawner. These cubes spawn different demons based on a percentage chance. For example, Imps are the most common, while annoying Arch-viles rarely spawn. (Their spawn rate is less than 1%, thankfully.)\n  These floating cubes are controlled by simple systems and formulas in the game’s programming. And for the most part, these systems work just fine. But there are a few quirks. One quirk involves how the game calculates where and when these cubes spawn. If a cube spawner and its target location share a particular value, then the cube will just keep going for what seems like forever, never spawning its demon. However, it’s not actually forever. Instead, it’s just a long time.   Decino did the math and calculated that it would take 11.6 years before this cube finally spawned its demon payload.\n  That’s a long time to wait just to spawn and be instantly killed by the Doomguy and his super shotgun.\n  It’s a well-known fact that the 1993 classic Doom will be ported to everything, eventually. You can\n Read more\n The Doomguy is an incredibly strong and powerful warrior who can smash through concrete walls, rip…\n Read more\n Kotaku Weekend Editor | Zack Zwiezen is a writer living in Kansas. He has written for GameCritics, USgamer, Kill Screen &amp; Entertainment Fuse.", "posttime": "2020-07-20 14:30:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,可能,spawn,立方体", "title": "末日II编程怪癖可能需要12年才能催生出一个恶魔", "title_en": "Doom II Programming Quirk Can Take 12 Years to Spawn a Demon", "transed": 1, "url": "https://kotaku.com/it-can-take-nearly-12-years-to-spawn-a-demon-in-doom-ii-1844434925", "via": "", "real_tags": ["编程", "可能", "spawn", "立方体"]}, {"category": "", "categoryclass": "", "imagename": "93935a4b7b667db4f98c5c263490b316.png", "infoid": 1012982, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "市面上有很多由老牌公司的销售领导或代表撰写的教育性销售指南。\n这些公司，即使规模很小，通常都有功能相当齐全的产品，至少有一些满意的客户，以及可重复的销售流程-没有这三个方面的情况下，很少有一家公司会聘请有经验的销售代表。\n这些公司的销售代表在市场营销、品牌知名度、产品情况说明书和其他销售抵押品、客户推荐信、参加会议的资金等方面拥有很好的优势。\n早期创业公司的创始人没有这些优势。正因为如此，来自专业销售人员的建议通常不适用于试图拼命完成前10笔销售的创始人。当你有一个基本的MVP，没有钱花在营销上，没有品牌知名度，没有现有客户时，你需要采取不同的销售方式。\n根据我在一家全新公司推出全新产品的数百次销售对话和犯下的错误，这里有10条经验教训，专门针对那些试图实现前10次销售的初创公司创始人。\n请注意，这些课程主要针对B2B软件销售；B2C当然非常不同。\n第一课让我们针对特定公司的特定买家所遇到的特定问题提出具体的解决方案。\n这是我从W20批的YC合作伙伴那里学到的最重要的一课，我无法表达这第一课有多重要。\n许多产品创意在规模上听起来都很棒。例如，每个使用过Salesforce或Hubpot的人都知道这些大型CRM套件有多糟糕，那么为什么不干脆创建一个更好的CRM并将其出售给原本会购买Salesforce的公司呢？\n我们采访了一些大型企业公司，它们的总估值超过500亿美元。他们都同意：森德斯克是个坏蛋。由于需要进行大规模改进，但仍然是最佳选择…。\n1.Zendesk和Salesforce之间更好的集成，具有“高价值客户”警报，在CRM中提供类似于Rapportive的上下文。针对顶级客户打开的任何支持案例进行快速升级。\n2.更好地报道实时情绪和分析。让客户成功领导者根据他们的反应实时了解他们对产品的感觉。\n3.让回复感觉像是gmail电子邮件，而不是回复：案例1123232我们很快就会和你见面。\n对于大多数创始人来说，这种试图构建Zendesk2.0的方法注定要失败。除非您准备花费数年时间构建一个能够与Zendesk正面竞争的功能齐全的支持工具，否则请不要试图构建和销售Zendesk2.0。\nZendesk是一家市值超过100亿美元的大型公司，10多年来一直致力于核心产品的研发。在每次销售对话中，买家都会将您与Zendesk、对讲机或其他功能齐全的客户支持工具进行比较，他们会询问您没有但竞争对手有的功能。总会有一个你不能支持的功能，而且大多数情况下，这会导致他们选择现任的-我是根据这里的经验说的。\n与其试图推销一个听起来规模很大的想法(例如，Zendesk2.0)，不如向非常具体的公司的非常具体的买家推销非常具体的解决方案。例如，问问你自己，在5-20名员工之间的B2B技术公司的支持团队有什么最严重的问题，为什么Zendesk不能解决这个具体的问题。销售针对该特定问题的解决方案，并在此基础上扩展您的产品。相信我(我是尝试过的人)-不要试图在第一天就构建Zendesk2.0。\n这条规则的例外情况是，如果您与大型买家有现有的关系，这些买家会在您的产品建成之前预购您的产品，或者如果您拥有深厚的领域专业知识，并且确切知道如何制造出比现有产品好10倍的产品。对于所有其他早期创始人，特别是第一次创始人，你最好找到一个大型现任公司无法解决的非常具体的痛点，然后从那里扩展你的产品。\n第2课：不要承诺构建功能，除非它们是您的价值主张的核心。\n这是一种常见的失败模式，许多初创公司创始人都深陷其中。他们总是只差几个功能就能找到适合市场的产品。如果他们的产品再有一次集成，再多一份报告，再多一件自动化，那么客户就会准备好购买。他们构建这些功能，告诉他们的客户他们已经准备好了，然后…。安静。即使您已经构建了潜在客户要求您构建的产品，他们仍然不会购买您的产品。\n第一课是找出非常具体的买家在非常具体的公司遇到的非常具体的问题，然后销售专门为解决这个问题而构建的解决方案。\n如果你认为你正在解决一个问题，但潜在客户仍然要求你在他们购买之前构建额外的功能，很可能你正在解决的问题还不够痛苦(或者你实际上还没有解决他们真正的问题)。当人们不想说“不”，他们担心伤害你的感情时，他们会用额外的功能作为不购买的借口。\n我们的应用程序Cross掉进了这个陷阱，这是一个建立在Slake上的客户支持平台。潜在客户在想要购买之前不断要求额外的集成和功能，很快我们就构建了与各种其他支持工具的5+集成，以及具有许多酷功能的广泛前端。这些集成和附加功能并没有显著提高我们的销售能力，相反，为了支持现在臃肿的产品，只是让我们的团队变得精疲力竭。\n这些集成和附加功能并不是我们产品价值支柱的核心，我们的产品价值支柱使支持团队能够与客户一起使用Slake。真正的问题是，我们的产品在Slake中的价值支柱没有解决一个足够尖锐的痛点，而不是我们没有足够的功能。\n同样，如果客户不断要求您构建更多功能，我会认真考虑您是仍在为客户解决一个尖锐的痛点，还是他们只是想对您好一点，让您轻松失望。\n如果你想让你的公司快速发展，每天发送几十封冷淡的电子邮件是不会奏效的。买家被冷冰冰的电子邮件淹没，特别是在竞争激烈的市场，这些电子邮件已经不像以前那么有效了。如果做得好，B2B产品的付费营销是可行的，但它是要花钱的，而且大多数专家会说，在你达到100万ARR之前，不要开始付费营销。\n对于我们特定的市场、产品和买家，这里有几种比发电子邮件更有效的方法。你必须找到最适合你的创业公司的不饱和渠道。\n在LinkedIn上请求与冷漠的人联系，并在连接请求中发送关于我们产品的信息。发送500个LinkedIn连接请求只需不到几个小时。LinkedIn上的大多数人都乐于接受新的连接，而且回复率比电子邮件高得多。\n在线“反向销售”--向我们已经使用过产品的公司或目前正在评估产品的公司的买家请求热情的介绍。签约免费试用一家公司的产品意味着你将有机会与该公司的某个人交谈，他们通常很快就能介绍给你的目标买家。\n面对面的“反向销售”--你不需要在会议上购买昂贵的展位来销售你的产品。许多会议向早期初创公司提供免费门票，特别是当它们是虚拟的时候。只需去和你能找到的每个人交谈，然后反向销售试图卖给你的销售代表！\n内容营销--当内容营销奏效时，它可以非常强大。我们的一些内容，如这篇，在像HackerNews这样的网站上产生了数以万计的页面访问量，并导致了许多注册。我们还编写了大量的指南，以便在联系客户时与他们分享并建立信誉。\nPR-PR不受您的控制，当然也不是可扩展的，但它可以快速、轻松地向记者推介您的产品。以下是我们发给记者的一封电子邮件，它让我们的应用程序走廊出现在Techcrunch上，带来了数百名新客户：\n我们也一直在思考如何减少在家工作时的孤独感，所以我们在几周前推出了HALWAY。\n走廊为您的团队安排休息时间，以便在Slake的定时视频聊天“休息室”中进行连接。他们感觉就像走廊里的谈话，帮助团队保持联系，享受乐趣，并在他们的公司结识新朋友。\n我们在大约3周前推出，已经被Bank Novo、Productboard、Nextdoor等公司的150多个团队使用。以下是我们本周从一位客户那里收到的一封电子邮件中的一句话：“我在我们的印度办公室遇到了一个人，我和他交换了几封电子邮件，但这周我们在走廊里见面了。”…。有趣的!。爱你的爱的劳动吧！“。\n如果你感兴趣的话，我很乐意告诉你更多关于霍尔韦的事情！\n不管你的想法有多棒，你很可能不会在第一天就在合适的公司里把合适的产品卖给合适的买家。创业的关键是找到产品与市场的契合度(关键字是产品和市场)。每天进行多次实验，直到你弄清楚你真正能卖什么，卖给谁。\n你用来联系潜在客户的渠道(如果你无法通过电子邮件联系，可以试试LinkedIn、Twitter、Facebook、电话)。\n您联系的公司特定人员(初级与高级，不同部门)。\n如果有一家我知道我们应该可以卖给它的公司，在联系到合适的买家之前，我有时会和公司里的5-10多个人交谈。要有创意--你需要站在买家面前才能成交！\n这个建议会引起争议，但我认为这是正确的建议。\n个性化电子邮件需要大量时间。如果研究一个潜在客户和个性化一封电子邮件需要10分钟，那么发送30封电子邮件就需要大约5个小时。另一方面，如果您只个性化带有潜在客户名称和公司的电子邮件，您应该能够每小时发送数百封电子邮件。\n如果你联系到的联系人真的很冷淡，我怀疑高度个性化的电子邮件能让你的回复率提高50倍(如果你这样做了，请告诉我，我很想了解如何做到这一点)。也许你的回复率会提高10倍，但即便如此，考虑到给完全冷淡的联系人发送个性化电子邮件需要多长时间，这根本不会带来投资回报。\n潜在客户并不完全陌生-例如，您以前见过他们，或者他们被您网络中的某个人推荐过。\n您非常确定买家或公司面临的正是您试图解决的问题-例如，我们知道我们可以关闭使用10+共享Slake渠道与客户的公司，概率很高，因此对这些公司的买家的所有电子邮件进行个性化设置是有意义的。\n否则，我认为你最好在一个小时内发送数百封电子邮件，而不是在几个小时内发送几十封电子邮件。\n除非您继续推动销售流程，否则默认情况下销售流程是不起作用的。作为销售产品的人，您有责任引导潜在客户完成交易。他们的默认行为是不购买-你必须帮助他们。\n确保您和潜在客户在每次互动结束时都就明确的后续步骤达成一致。当然，如果他们不想买你的产品，或者他们希望你以后再联系你，但明确要求他们告诉你，而不是继续猜测。您和潜在客户都会喜欢这种透明度。\n在成立我们公司之前，我没有销售方面的经验，理解礼貌和真正感兴趣之间的区别是我必须克服的最大挑战之一。\n没有人想让创始人失望，人们经常会说这样的话：“我认为你正在研究一个好主意”，“我知道其他公司可能会想要这样”，“当你建立了XYZ的功能后，你绝对应该伸出援手。”大多数情况下，这是礼貌，而不是真正的兴趣。\n当人们问“我如何注册”、“你的产品什么时候能准备好”，或者最重要的是，如果他们真的预订了你的产品，你就会知道他们真的有兴趣购买你的产品。在大多数情况下，任何低于这一数字的事情都不表示真正的兴趣。\n人们想从他们信任和喜欢的人那里买东西。他们能知道你是不是真的想帮助他们成功。\n在Cross，我们经常与我们知道不会收购的公司通电话，帮助他们就如何建立客户成功团队提供建议。我们为其他公司介绍我们认为合适的潜在客户、员工或投资者。我们试图付出比收到的更多，我认为当这些公司从我们这里购买或将我们转介给其他公司时，这些努力最终真的得到了回报。\n在科技行业中，我最喜欢的部分是大多数人是多么真诚地提供帮助-他们很高兴看到你成功。我认为，作为一个初创公司的创始人，回馈和帮助他人，就像他们帮助你一样多，甚至更多，这是极其重要的。\n我为我们与客户建立的真正的关系感到自豪，也为我们与从未购买的人交谈过的人感到自豪。我们与我们的客户建立了共享的Slake频道，让他们与我们有了直接的沟通渠道，我们偶然地认识了他们，了解了他们的生活，并与他们中的许多人成为了朋友。\n这些友谊是极其重要的。我们的许多销售来自推荐，我们的潜在客户和客户总是很乐意接电话，分享想法，提供反馈。\n销售部因爱交易而声名狼藉。相反，发展真实的关系，我可以向你保证它们会有回报的。\n我们的许多客户在我们与他们第一次交谈几个月后终于签约了，通常是在我认为他们几周来都不感兴趣的时候。有时真的不是客户购买的合适时间-他们可能没有预算，他们可能有其他优先事项，或者许多其他因素可能会影响销售。别放弃!。你永远不知道什么时候一个你认为永远不会购买的顾客最终决定他们已经准备好了。", "note_en": "There’s a lot of educational sales guides out there written by sales leaders or reps at established companies.\n These companies, even if small, generally have reasonably fully-featured products, at least some happy customers, and a repeatable sales process — it’s rare that a company will have hired experienced sales reps without these three pieces in place.\n The sales reps at these companies have advantages as well — qualified leads from marketing, brand awareness, product fact sheets and other sales collateral, references from customers, money to attend conferences, etc.\n Founders of early startups have none of these advantages. Because of this, the advice from professional salespeople is often not applicable to the founder trying to grind out their first 10 sales. When you have a barebones MVP, no money to spend on marketing, no brand awareness, and no existing customers, you need to take a different approach to sales.\n  Here are 10 lessons specifically for startup founders trying to get their first 10 sales, based on hundreds of sales conversations and mistakes I’ve made launching brand new products at a brand new company.\n Note that these lessons are mostly for B2B software sales; B2C is of course very different.\n Lesson 1. S ell a  specific solution to a  specific problem that  specific buyers at  specific companies have\n This was the most important lesson I learned from the YC partners in the W20 batch, and I cannot express just how important this first lesson is.\n A lot of product ideas sound great at scale. For example, everyone who has used Salesforce or Hubspot knows just how bad these large CRM suites are, so why can’t you just create a better CRM and sell it to companies who would otherwise buy Salesforce?\n  We’ve spoken with a number of large enterprise companies, their collective valuation over $50B. They all agree:  Zendesk is bad. Due for massive improvements, but still the best option…\n  1. Better integration between Zendesk and Salesforce, with “high-value customer” alerts, Rapportive-like context within the CRM. Quick escalation for any support case opened by a top customer.\n 2. Better reporting on live sentiment and analytics. Give the customer success leader a live heartbeat for how people are feeling about the product based on their reactions.\n 3. Make the responses feel like Gmail emails, not Re: CASE 1123232 We’ll Be With You Shortly.\n For most founders, this approach of trying to build a Zendesk 2.0 is destined for failure. Unless you’re ready to commit years to building a fully-featured support tool that can compete head on with Zendesk, please do not try to build and sell a Zendesk 2.0.\n Zendesk is a massive, $10B+ company that has been working on their core product for over 10 years. In every sales conversation, buyers will compare you with Zendesk, Intercom, or a number of other fully-featured customer support tools, and they’ll ask you about features you don’t have but your competitors do. There will always be one feature you can’t support, and most of the time that will cause them to go with the incumbent — I am speaking from experience here.\n Instead of trying to sell an idea that sounds great at scale (i.e., Zendesk 2.0),  sell a  very specific solution to a  very specific problem that  very specific buyers at  very specific companies have. For example, ask yourself what the most acute problem is that support teams at B2B tech firms between 5–20 employees have, and why Zendesk can’t solve that specific problem. Sell a solution to that specific problem, and expand your product from there. Trust me (I’m someone who has tried) - do not try to build a Zendesk 2.0 on day 1.\n The exception to this rule is if you have existing relationships with large buyers who will pre-order your product before it’s built, or if have deep domain expertise and know exactly how to build a 10x better product than the incumbents. For all other early founders, and especially first-time founders, you’re better off finding a very specific pain point that a large incumbent does not solve, and then expand your product from there.\n Lesson 2. Don’t promise to build features unless they’re core to your value proposition\n This is a common failure mode many startup founders great trapped in. They are always just a couple more features away from finding product market fit. If only their product had one more integration, one more report, one more piece of automation, then customers would be ready to buy. They build these features, tell their customers they’re ready, and… silence. Even when you’ve built what your potential customers have asked you to build, they still won’t buy your product.\n Lesson 1 was to identify a  very specific problem that  very specific buyers at  very specific companies have , and then to sell a solution specifically built to solve that problem.\n If you think you’re solving a problem but prospects are still requesting that you build additional features before they buy, it’s likely that the problem you’re solving just isn’t painful enough (or that you haven’t actually solved their real problem). People use additional features as an excuse not to buy when they don’t want to say “no” and they’re worry about hurting your feelings.\n We fell into this trap with our app,  Across, a customer support platform built on Slack. Prospects kept requesting additional integrations and features before they wanted to buy, and pretty soon we had built 5+ integrations with various other support tools, as well as an extensive frontend with many cool features. These integrations and additional features did not significantly improve our ability to sell Across, and instead just stretched our team thin trying to support a now bloated product.\n These integrations and additional features were not core to our product’s value prop, which was enabling support teams to use Slack with customers. The real problem was that our product’s value prop in Slack was not solving an acute enough pain point, and not that we didn’t have enough features.\n Likewise, if customers keep asking you to build more features, I’d think hard about if you’re still solving an acute pain point for customers, or if they’re just trying to be nice and let you down easy.\n  If you want your company to grow quickly, sending a few dozen cold emails a day is just not going to cut it. Buyers are inundated with cold emails, especially in competitive markets, and these emails are not as effective as they used to be. Paid marketing for B2B products works if done right, but it costs money, and most experts will say not to start paid marketing until you reach $1M ARR.\n Here are a few techniques that worked much better than cold-emailing for our specific market, product, and buyer. You’ll have to find the unsaturated channels that works best for your startup.\n Requesting to connect with people cold on LinkedIn, and sending information about our products in the connection request. It takes less than a couple hours to send 500 LinkedIn connection requests. Most people on LinkedIn are happy to accept new connections, and the response rate is much higher than email\n “Reverse-selling” online — requesting warm introductions to buyers at companies whose products we already used or at companies whose products we were currently evaluating. Signing up for a free trial of a company’s product means that you will get to speak with  someone at that company, and they’re usually a quick introduction away from your target buyer\n “Reverse-selling” in person — you don’t need to buy expensive booths at conferences to sell your product. Many conferences offer free tickets to early startups, especially when they are virtual. Simply go and talk to everyone you can find, and reverse sell the sales reps trying to sell to you!\n Content marketing — content marketing can be extremely powerful when it works. A few of our content pieces, like this  one, generated tens of thousands of pages visits from sites like HackerNews and resulted in many signups. We also wrote  extensive guides to share with our customers and build credibility when we reached out to them\n PR — PR is less in your control and certainly not scalable, but it’s fast and easy to pitch reporters about your product. Below is an email we sent to a reporter that got our app Hallway  featured in Techcrunch, which resulted in hundreds of new customers:\n We have also been thinking about how to reduce loneliness while working from home, so we launched  Hallway a couple weeks ago.\n Hallway schedules breaks for your teams to connect in timed video chat “break rooms” in Slack. They feel just like hallway conversations and help teams stay connected, have fun, and meet new people at their companies.\n We launched ~3 weeks ago and are already used by 150+ teams at companies like Bank Novo, Productboard, Nextdoor and more. Here’s a quote from an email we received from a customer this week: “I met someone in our India office whom I’ve traded several emails with but we met ‘in the hallway’ this week…fun! Love your labor of love!”\n I’m happy to tell you more about Hallway if you’re interested!\n  No matter how brilliant your idea, you’re likely not going to sell the right product to the right buyer at the right type of companies on day 1. Startups are about finding product-market fit (keywords being product AND market). Keep running experiments multiple times a day until you figure out what you can actually sell and to whom.\n  The channels you use to reach prospects (if you can’t get in touch via email, try LinkedIn, Twitter, Facebook, a phone call)\n  The specific person at the company you reach out to (junior vs. senior, different departments)\n If there was a company I knew we should be able to sell to, I sometimes spoke with 5–10+ people at the company before getting in touch with the right buyer.  Be creative - you need to get in front of the buyer to make a sale!\n  This advice is going to be controversial, but I think it’s the right advice.\n Personalizing emails takes  a ton of time. If it takes 10 minutes to research a prospect and personalize an email, it’ll take about 5 hours to send 30 emails. On the other hand, if you only personalize emails with the prospects name and company, you should be able to send hundreds of emails per hour.\n If the contacts you reach out to are truly cold, I doubt you will get a 50x better response rate with highly personalized emails (if you do, please let me know and I’d love to learn how). Maybe you’ll 10x your response rate, but even then, there simply isn’t an ROI to personalizing emails to completely cold contacts given how much longer it takes.\n  The prospect not entirely cold — for example, you’ve met them before or they’ve been referred by someone in your network\n You are very sure that the buyer or company is facing the exact problem you are trying to solve — for example, we knew that we could close companies using 10+ shared Slack channels with customers with high probability, so it made sense to personalize all emails to buyers at those companies\n Otherwise, I think you’re better off sending hundreds of emails in an hour rather than dozens of emails over several hours.\n  Sales processes are default dead unless you continue to push them along. As the person selling the product, you are responsible for guiding the prospect to get the deal over the finish line. Their default action is not to buy — you have to help them along.\n Ensure both you and the prospect agree on explicit next steps at the end of every interaction. It’s of course OK if they don’t want to buy your product, or if they want you to reach out at a later date, but explicitly ask them to tell you rather than keep guessing. Both you and the prospect will appreciate the transparency.\n  Before starting our company, I had zero experience with sales, and understanding the difference between politeness and genuine interest was one of the biggest challenges I had to overcome.\n Nobody wants to disappoint a founder, and people will often say things like, “I think you’re working on a good idea,” “I can see how other companies might want this,” “You should definitely reach out when you’ve built XYZ features.” Most of the time, this is politeness and not genuine interest.\n You’ll know people are genuinely interested in buying your product when they say things like “how can I sign up,” “when will your product be ready,” or best of all, if they actually preorder your product. Anything less than that does not indicate real interest most of the time.\n  People want to buy from people they trust and like. They can tell when you are truly trying to help them succeed.\n At Across, we often got on the phone with companies we knew would not buy to help them with advice on how to set up their customer success teams. We made introductions for other companies to potential customers, employees, or investors who we thought would be a good fit. We tried to  give more than we received, and I think these efforts really paid off down the line when those same companies either bought from us or referred us to others.\n My favorite part of the tech industry is how genuinely helpful most people try to be — they’re excited to see you succeed. I think it’s extremely important as a startup founder to give back and help others as much or even more than they help you.\n  I am proud of the authentic relationships we developed with our customers, as well as the people we spoke with who never ended up buying. We set up shared Slack channels with our customers to give them a direct line of communication with us, and we got to know them casually, learned about their lives, and became friends with many of them.\n These friendships were been extremely important. Many of our sales came from referrals, and our prospects and customers were always happy to jump on the phone, share ideas, and provide feedback.\n Sales has a bad reputation for being transactional. Instead, develop authentic relationships, and I can assure you they’ll pay off.\n  Many of our customers finally signed up months after our first conversations with them, often when I thought they were not interested for weeks. Sometimes it really is just not the right time for a customer to buy — they may not have the budget, they may have other priorities, or a number of other factors may impact the sale. Don’t give up! You never know when a customer you thought would never buy finally decides they’re ready.", "posttime": "2020-07-20 14:28:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "startup", "title": "初创公司创始人获得前10笔销售的10个教训", "title_en": "10 lessons for startup founders to get their first 10 sales", "transed": 1, "url": "https://medium.com/@kunaljasty/10-lessons-for-startup-founders-to-get-their-first-10-sales-b11cef38ea6b", "via": "", "real_tags": ["startup"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012981, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我以前(在这里)写过关于我们当前的Linux ZFS文件服务器是如何工作的，就像我们以前的OmniOS文件服务器一样。然而，Linux上的ZFS和传统的Solaris/OmniOS ZFS之间并不是所有的东西都是完全一样的。对我们来说，最受欢迎的区别之一是ZED，即ZFS事件守护进程。ZED所做的非常棒的是，它提供了一种非常简单的方式来在ZFS事件发生时采取行动。\n当ZFS事件发生时，ZED查看目录(通常为/etc/zfs/zed.d)以查找应该运行以响应该事件的脚本(或程序)。每个脚本运行时都设置了一组环境变量来描述正在发生的事情，并且它可以使用这些环境变量来确定事件是什么。ZED根据它们的名称来决定要运行的内容；通常您最终得到的脚本名称是all-cslab.sh(在所有事件上运行)和reSilver_Finish-cslab.sh(在areSilver完成时运行)。\n因为这些只是单个文件的集合，所以您可以自由添加自己的文件，而不会与Linux上的ZFS提供的标准ZEDLETS冲突或更改它们。您添加的内容可以做任何您想做的事情，从简单到复杂。例如，我们最简单的ZEDLET只需syslog所有ZED环境变量：\nPATH=/usr/bin:/usr/sbin:/bin:/sbin：$PATHexport PATHIF[&#34；$ZEVENT_SUBCLASS&#34；=&#34；HISTORY_EVENT&#34；]；然后退出0fiunset ZEVENT_TIME_STRINGprintenv|fgrep&#39；ZEVENT_&#39；|SORT|fmt-999|LOGER-p daemon.info-t&#39；CSLAB-zevents&#39；退出0。\n(有一个标准的all-syslog.sh&39；ZEDLET，但它不会将zevents中的所有信息syslogt。如果您想要编写额外的ZEDLET和ZEDLET，捕获所有信息尤其有用。)我不太确定它们应该查找什么，或者哪些环境变量包含有用的信息。)。\n可能需要一些时间和实验来整理哪些ZFS事件(以及使用哪些信息可用)来响应您的ZFS池中发生的各种事情。但是，一旦您弄清楚了这一点，ZED为您提供了一种触发和驱动各种系统管理活动的方法。这些可以是主动的(比如在设备发生故障时采取措施)，也可以是被动的(比如在您的指标系统或性能仪表板中添加标记，以确定ZFS洗涤器resilver何时启动和结束，以便您可以将此与发生的其他事情关联起来)。\n来自Solaris和OmniOS，那里没有这样简单的系统来应对ZFS池中发生的事情，ZED对我们来说是一股新鲜空气。最重要的是，它感觉到从一开始就应该如何处理ZFS事件，这样系统管理员就可以灵活地满足他们自己的本地需求，而不必接受Solaris故障管理系统想要给他们的任何东西。\nPS：因为Linux上的ZFS现在是OpenZFS，我相信ZED最终可能会出现在FreeBSD中(如果它还没有出现在FreeBSD中)，甚至有一天它会被移植回Illumos。", "note_en": "I&#39;ve written before ( here) about how  ourcurrent Linux ZFS fileservers work muchlike  our old OmniOS fileservers.However, not everything is quite the same between ZFS on Linux andtraditional Solaris/OmniOS ZFS. One of the most welcome differencesfor us is  ZED,the ZFS Event Daemon. What ZED does that is so great is that it providesa very simple way to take action when  ZFS events happen.\n When a ZFS event happens, ZED looks through a directory (generally /etc/zfs/zed.d) to find scripts (or programs) that should be runin response to the event. Each script is run with a bunch ofenvironment variables set to describe what&#39;s going on, and it canuse those environment variables to figure out what the event is.ZED decides what things to run based on their names; generally youwind up with script names like  all-cslab.sh (which is run onall events) and  resilver_finish-cslab.sh (which is run when aresilver finishes).\n Because these are just a collection of individual files, you&#39;refree to add your own without colliding with or having to alter thestandard &#39;ZEDLETs&#39; provided by ZFS on Linux. Your additions can doanything you want them to, ranging from the simple to the complex.For instance, our simplest ZEDLET simply syslogs all of the ZEDenvironment variables:\n PATH=/usr/bin:/usr/sbin:/bin:/sbin:$PATHexport PATHif [ &#34;$ZEVENT_SUBCLASS&#34; = &#34;history_event&#34; ]; then exit 0fiunset ZEVENT_TIMEunset ZEVENT_TIME_STRINGprintenv | fgrep &#39;ZEVENT_&#39; | sort | fmt -999 | logger -p daemon.info -t &#39;cslab-zevents&#39;exit 0\n (There&#39;s a standard &#39;all-syslog.sh&#39; ZEDLET, but it doesn&#39;t syslogall of the information in the zevents. Capturing all of the informationis especially useful if you want to write additional ZEDLETs andaren&#39;t quite sure what they should look for or what environmentvariables have useful information.)\n It can take a bit of time and experimentation to sort out what ZFSevents are generated (and with what information available) inresponse to various things happening to adn in your ZFS pools. Butonce you have figured it out, ZED gives you a way to trigger anddrive all sorts of system management activities. These can be active(like taking action if devices fail) or passive (like adding markersin your metrics system or performance dashboards for when ZFS scrubsor resilvers start and end, so you can correlate this with otherthings happening).\n Coming from Solaris and OmniOS, where there was no such simplesystem for reacting to things happening in your ZFS pools, ZED wasa breath of fresh air for us. More than anything else, it feelslike how ZFS events should have been handled from the start, sothat system administrators could flexibly meet their own local needsrather than having to accept whatever the Solaris Fault Managementsystem wanted to give them.\n PS: Because ZFS on Linux is now OpenZFS, I believe that ZED willprobably eventually show up in FreeBSD (if it isn&#39;t already there).Perhaps it will even some day be ported back to Illumos.", "posttime": "2020-07-20 13:56:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "程序,linux,zfs", "title": "赞扬Linux的ZED“ZFS事件守护程序”上的ZFS", "title_en": "In Praise of ZFS on Linux's Zed 'ZFS Event Daemon'", "transed": 1, "url": "https://utcc.utoronto.ca/~cks/space/blog/linux/ZFSZEDPraise", "via": "", "real_tags": ["程序", "linux", "zfs"]}, {"category": "", "categoryclass": "", "imagename": "04aaf1da5e52bac3eb06e5d395fcd17d.jpeg", "infoid": 1012979, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，eBay eBay正在就将其分类广告业务出售给挪威的Adevinta进行深入谈判，这家在线拍卖先驱正寻求重新专注于其核心市场业务。\n知情人士说，如果谈判不破裂，现金加股票交易最快可能在周一宣布。一些知情人士说，这笔交易的价格无法得知，但eBay部门预计将以大约80亿美元或更高的价格出售。\n总部位于加利福尼亚州圣何塞的eBay曾是一家雄心勃勃的互联网集团，拥有贝宝(PayPal)和StubHub等品牌。在维权投资者的压力下，eBay一直在解除这种结构，他们认为这种结构掩盖了eBay的价值。分类广告部门是该公司去年达成出售StubHub票务部门的协议后，在核心业务之外仅存的业务之一。\nEBay的分类广告部门主要在加拿大、欧洲部分地区、非洲、澳大利亚和墨西哥开展国际业务。它的平台允许用户在当地社区发布商品和服务，类似于美国的Craigslist。去年，该部门创造了11亿美元的收入，而其市场业务的收入为76亿美元。\nEBay自2月份左右以来一直在寻求出售该部门，当时华尔街日报(Wall Street Journal)报道称，该部门正在挂牌出售。\nAdevinta在16个国家监管数字市场，在欧洲、南美和墨西哥的部分地区拥有重要的业务。通过收购eBay业务，Adevinta将大幅扩大其在德国的业务。根据该公司网站的说法，德国是欧洲最大的经济体之一，其目前的业务在德国并不占据主导地位。\nAdevinta的出价似乎已经击败了一个私募股权财团和Prosus NV的出价。对于Adevinta来说，这笔交易将是一个巨大的打击-该公司自身的市值略高于80亿美元-因为它寻求扩大客户基础和地理覆盖范围。与此同时，通过接受股票作为交易的一部分，eBay将受益于合并后业务的增长。\n这笔交易对Prosus来说是一个打击，该公司雄心勃勃地希望通过大规模收购来扩大其稳定的互联网业务。今年早些时候，这家由南非Naspers控股的阿姆斯特丹上市公司在收购英国外卖公司Just Eat的竞购战中输给了总部位于荷兰的Takeaway.com。\n在来自美国最大的在线零售商亚马逊(Amazon.com)日益激烈的竞争中，eBay的核心市场业务受到了影响。\n埃利奥特管理公司(Elliott Management Corp.)和Starboard Value LP一直在敦促eBay通过剥离对冲基金认为非核心的业务来提振股价。这些基金在和解协议中获得了董事会席位，这场冲突促使eBay前首席执行官德文·维尼格(Devin Venig)因战略分歧于9月份离开公司。他的离开恰逢六名工人被解雇，自那以后，司法部指控他们领导了一场针对马萨诸塞州一对夫妇的网络跟踪运动。\n今年4月，eBay任命沃尔玛(Walmart)电子商务部门前首席运营官杰米·伊纳内(Jamie Iannone)为新首席执行官。根据eMarketer的数据，沃尔玛最近超过eBay，成为美国在线销售额份额第二大的在线零售商，该公司将赌注押在了伊纳内的经历上，以重振增长。\n写信给Ben Dummett@wsj.com，Corrie Driebusch，corrie.driebusch@wsj.com，和Cara Lombardo@wsj.com", "note_en": "EBay    EBAY  -0.89%  is in advanced talks to sell its classified-ads business to Norway’s  Adevinta    ADE  -0.69%  A, according to people familiar with the matter, as the online auction pioneer seeks to refocus on its core marketplace business.\n  A cash-and-stock deal could be announced as soon as Monday assuming the talks don’t fall apart, the people said. The price of the deal couldn’t be learned but the eBay unit was expected to sell for roughly $8 billion or more, some of the people said.\n  San Jose, Calif.-based eBay, once a highflying internet conglomerate with brands like  PayPal and StubHub, has been unwinding that structure under pressure from activist investors who argued it shrouded eBay’s value. The classifieds unit is one of the last remaining businesses outside the core after the company struck a deal to sell its StubHub ticketing division last year.\n  EBay’s classifieds unit primarily operates internationally across Canada, parts of Europe, Africa, Australia and Mexico. Its platforms allow users to post goods and services in their local communities, similar to Craigslist in the U.S. Last year, the division produced $1.1 billion in revenue, compared with the $7.6 billion its marketplace business generated.\n      EBay has been seeking to sell the unit since around February, when The Wall Street Journal  reported that it was up for sale.\n  Adevinta oversees digital marketplaces in 16 countries, with a significant presence in parts of Europe, South America and Mexico. By acquiring the eBay business, Adevinta would significantly expand its presence in Germany, one of Europe’s biggest economies, where its current operation doesn’t hold a dominant position, according to the company’s website.\n  Adevinta’s bid appears to have beaten out those of a private-equity consortium and of  Prosus NV. The deal would be a big bite for Adevinta—whose own market value amounts to little more than $8 billion—as it seeks to expand its customer base and geographic reach. At the same time, eBay would benefit from growth in the combined business by accepting stock as part of the deal.\n  The deal is a blow for Prosus, which has ambitions to expand its stable of internet businesses through a big acquisition. Earlier this year, the Amsterdam-listed company, which is controlled by South Africa’s  Naspers  lost out to Netherlands-based  Takeaway.com in a bidding war to acquire Just Eat, a U.K.-based food-delivery company.\n  EBay’s core marketplace business has suffered amid growing competition from  Amazon.com  the U.S.’s biggest online retailer.\n  Elliott Management Corp. and Starboard Value LP have been urging eBay to boost its share price by shedding businesses the hedge funds had considered noncore. The funds received board seats in settlement agreements and the clash prompted Devin Wenig, eBay’s former CEO, to  leave the company in September over disagreements on strategy. His departure coincided with the firing of six workers, who have since been  charged by the Justice Department with leading  a cyberstalking campaign against a Massachusetts couple.\n  In April, eBay appointed Jamie Iannone, formerly chief operating officer of  Walmart  e-commerce division, as  its new chief executive. With Walmart recently overtaking eBay as the U.S.’s second-largest online retailer by share of online sales, according to eMarketer, the company is betting on Mr. Iannone’s experience to reignite growth.\n  Write to Ben Dummett at  ben.dummett@wsj.com, Corrie Driebusch at  corrie.driebusch@wsj.com and Cara Lombardo at  cara.lombardo@wsj.com", "posttime": "2020-07-20 13:34:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "广告,业务,ebay", "title": "消息来源：eBay正就以约80亿美元将其分类广告业务出售给挪威的Adevinta进行深入谈判", "title_en": "Sources: eBay is in advanced talks to sell its classified ads business to Norway's Adevinta for ~$8B", "transed": 1, "url": "https://www.wsj.com/articles/ebay-nears-deal-to-sell-classified-ads-unit-to-adevinta-11595219913?mod=djemalertNEWS", "via": "", "real_tags": ["广告", "业务", "ebay"]}, {"category": "", "categoryclass": "", "imagename": "394c34c75f3ba0f60deb065d492031b1.jpg", "infoid": 1012977, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(CNN)美国新泽西州地区法院法官埃斯特·萨拉斯(Esther Salas)的儿子周日在一名持枪歹徒向她位于北布伦瑞克的家中开枪后死亡，联邦法院的最高法官向CNN证实。\n周日晚些时候，首席法官弗雷达·沃尔夫森(Freda Wolfson)告诉CNN，萨拉斯的儿子丹尼尔·安德尔(Daniel Anderl)，20岁，在枪击中丧生，她的丈夫马克·安德尔(Mark Anderl)受伤。沃尔夫森说，萨拉斯安然无恙。\n美国法警和联邦调查局都在调查这起枪击事件。来自执法部门的初步报告称，丹尼尔·安德尔(Daniel Anderl)打开了门，他的父亲就在他身后。一名执法消息人士告诉CNN，门在枪林弹雨中打开，持枪歹徒逃跑了。\n联邦调查局在一份声明中说：我们正在寻找一个目标。我们正在与州和当地合作伙伴密切合作，并将在可用时提供更多更新。\n一名直接了解调查情况的执法官员告诉CNN，持枪歹徒似乎穿着联邦快递的制服。\n目前尚不清楚枪手是联邦快递员工还是冒充员工的人。\n联邦快递发言人乔纳森·莱昂斯(Jonathan Lyons)在一份电子邮件声明中表示：我们知道媒体的报道，并正在全力配合调查当局。\n消息人士告诉CNN，执法部门还没有意识到任何针对法官的威胁。目前，调查人员还不知道其动机。\n新泽西州州长菲尔·墨菲在一份声明中说，萨拉斯法官和她的家人此刻在我们的脑海中，因为他们正在应对这一毫无意义的行为。这场悲剧提醒我们，枪支暴力在我们国家仍然是一场危机，我们让每个社区更安全的工作还没有完成。\n美国民主党参议员鲍勃·梅嫩德斯(Bob Menendez)表示，他为向前总统巴拉克·奥巴马(Barack Obama)推荐萨拉斯法官而感到自豪，他也发表了一份声明，向萨拉斯的家人祈祷。\n梅嫩德斯说：我与萨拉斯法官和她的家人一起祈祷，希望那些对这一可怕行为负有责任的人迅速被逮捕并绳之以法。\n北不伦瑞克市长弗朗西斯·麦克·沃马克周日晚上在电话中告诉CNN，萨拉斯法官的丈夫马克·安德尔是他打交道过的最诚实的律师之一。\n沃马克说，他是一个非常精力充沛、充满活力、百分之百讨人喜欢的人。他喜欢谈论他的妻子，他喜欢吹嘘他的儿子，他的儿子将如何在棒球方面出类拔萃，以及他在华盛顿的大学里表现如何。看到他经历这一切，我感到非常难过。", "note_en": "(CNN)The son of  US District Court of New Jersey Judge Esther Salas has died after a gunman opened fire on her North Brunswick home Sunday, the top judge at the federal courthouse confirmed to CNN.\n Chief Judge Freda Wolfson told CNN late Sunday that Salas&#39; son Daniel Anderl, 20, was killed in the shooting and her husband, Mark Anderl, was injured. Salas was unharmed, Wolfson said.\n Both the  US Marshals and FBI are investigating the shooting. Initial reports from law enforcement said Daniel Anderl opened the door with his father right behind him. The door opened to a hail of gunfire and the gunman fled, a law enforcement source told CNN.\n   &#34;We are looking for one subject,&#34; the FBI said in a statement. &#34;We are working closely with our state and local partners and will provide additional updates when available.&#34;\n The gunman appeared to be wearing a FedEx uniform, a law enforcement official with direct knowledge of the investigation told CNN.\n  It is not yet known whether the gunman was a FedEx employee or someone posing to be an employee.\n &#34;We are aware of the media reports and are fully cooperating with investigating authorities,&#34; Jonathan Lyons, a spokesman for FedEx, said in an email statement.\n Law enforcement has not been aware of any threats against the judge, the source told CNN. Right now investigators don&#39;t know the motive.\n &#34;Judge Salas and her family are in our thoughts at this time as they cope with this senseless act,&#34; New Jersey Gov. Phil Murphy said in a statement. &#34;This tragedy is our latest reminder that gun violence remains a crisis in our country and that our work to make every community safer isn&#39;t done.&#34;\n Democratic US Sen. Bob Menendez, who said he was proud to have recommended Judge Salas to former President Barack Obama, also issued a statement sending his prayers to the family.\n &#34;My prayers are with Judge Salas and her family, and that those responsible for this horrendous act are swiftly apprehended and brought to justice,&#34; Menendez said.\n North Brunswick Mayor Francis &#34;Mac&#34; Womack told CNN over the phone Sunday night that Judge Salas&#39; husband Mark Anderl is &#34;one of the most straight-up honest attorneys&#34; he has dealt with.\n   &#34;He&#39;s a very very exuberant, vibrant, one hundred percent pleasant person,&#34; Womack said. &#34;He loves to talk about his wife, and he loves to brag about his son, and how his son would excel in baseball, and how he was doing down in college in Washington ... I&#39;m just very sorry to see him going through this.&#34;", "posttime": "2020-07-20 13:33:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "德意志银行,attempt,调查", "title": "对爱泼斯坦/德意志银行案法官的暗杀企图", "title_en": "Assasination attempt on the judge of the Epstein/Deutsche Bank case", "transed": 1, "url": "https://www.cnn.com/2020/07/19/us/federal-judge-esther-salas-shooting-investigation/index.html", "via": "", "real_tags": ["德意志银行", "attempt", "调查"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012976, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "(请忽略以上电子邮件收据是针对他们的Plus计划的。订阅后不久，我意识到我需要升级到支持商业用途的Pro。)。\n我需要一种可靠的方式来托管我为我的软件制作的大量屏幕录像和视频教程。我选择Vimeo是因为他们是这个领域显而易见的选择，主要有两个原因：\n我不想让我的内容托管在YouTube上，在那里它会被无穷无尽的燃烧的垃圾包围。(不要把这种批评看得太严厉--我是一名快乐的YouTube高级订户。)。\nVimeo真的，真的，真的很擅长他们做的事情。我的意思是，在易用性、控制最终用户体验、速度和质量方面都是一流的。\n但当我的续订电子邮件在4月份收到时，我和其他小型开发人员发现，随着疫情的恶化，销售正在放缓。\n对于我和他们一起托管的少量视频内容来说，每年另外240美元是一个很难推销的价格，我想知道是否有更便宜的替代方案-要么是另一项服务，要么是我自己托管视频。\n如果你再发布商业内容--就像我经常做的那样--Vimeo的条款要求你是专业版或更高级别的订阅者。需要明确的是，我仍然认为Vimeo以这个价格(几乎是任何价格，真的)是非常物有所值的。这比一家有四名员工为Slake买单的公司便宜。\n但考虑到我每月发布和托管的视频内容数量之多，再加上我是一个超级书呆子，考虑到我的规模很小，考虑到我在削减成本方面的考虑，这已经没有什么意义了。\n一种将原始视频转换为适合流式传输的大小和格式的简单方法。\n那么，视频文件实际存放在哪里呢？我的要求是一个可靠的地方，如果你得到Slashdoted(哈哈，还记得吗？)，就不会摔倒，可以快速地送到任何地方的游客手中，而且不会让你破产。\n我的Linode(附属链接-但Linode很棒)服务器上有足够的空间可用(并且几乎总是有足够的带宽可用)。但即使是我最初的每月20美元的VPS，在交通高峰时也多次陷入困境。(当然，我当时正在运行WordPress。)。我不想因为我在这个网站上的一篇愚蠢的博客帖子引起注意而冒着我的商业网站崩溃的机会。\n很久以前，我曾写过使用S3作为一个穷人的内容交付网络。这仍然是一个简单可靠的选择，但带宽成本并不能算得上真正的CDN。当然，这也是亚马逊提供CloudFront的原因。但即便如此，以每GB 0.085美元的价格计算，在过去的一年里，我有好几个月的价格都在200美元以上。\n相反，让我向你介绍我的秘密武器：BunnyCDN。(如果您点击那个链接，我会获得积分。但我之所以使用它，只是因为我完全喜欢他们的服务，正如您将在下面看到的那样。)。\n我从2011年开始对我所有的静态资产使用MaxCDN(现在的StackPath)后，于去年10月转向了Bunny。他们有多棒，让我大吃一惊。原因有很多：\n重要的主要指标是：它们真的很快。我看到的性能与我在日常工作中使用MaxCDN和更大的CDN时习惯使用的性能相当。\n我需要两次给他们发电子邮件提出支持问题，一个知识渊博、乐于助人的人很快就回复了，而且不需要通过愚蠢的自助解决方案。\nBunny的控制面板用于管理您的帐户、选择带宽设置等，使用起来非常简单，功能也非常强大(至少对我来说是这样)。与我使用MaxCDN和AWS控制台时相比，这真的是一个很好的改变(功能强大得像地狱，但很迟钝)。\n用于我的静态网站资产(图像、样式表、JavaScript等)。我使用的是Bunny的标准层，它提供他们所有流行音乐中的我的内容。这意味着访问者将以每GB 0.01美元的价格连接到离他们最近的服务器(针对美国和欧盟POP)。\n然而，我的视频内容使用他们的音量级别，从7个POP(而不是41个)分发。在仍然足够快的同时，这进一步将成本降低到0.005美元/GB。当我的流量激增时，这相当于5美元/TB。\n我对提供商之间的带宽实际上是如何在全球范围内定价的，或者为什么一些公司对相同的有线比特比其他公司收取如此高的费用一无所知。我想您是在为可靠性和/或速度买单吧？我所知道的是，在我使用BunnyCDN的9个月里，我没有看到一丝停机时间，也没有注意到任何缓慢的情况。我无法解释它们怎么会便宜得多。也许他们不会将规模扩大到真正的流量？但是对于我所需要的，它们是一个非凡的选择。\n(好的，我现在不想再喋喋不休地谈论它们了。这真的不是任何种类的付费或赞助的内容废话给兔子。自从转行以来，我对他们印象深刻，我终于想要表彰他们了。)。\n下一件事，我们需要的是一种方式，以内联方式显示这些视频在您的网站上。\n嵌入式Flash视频的时代已经一去不复返了。现在，您只需使用原生HTML5视频元素就可以大体上逃脱惩罚。\n但是，如果您想更好地控制视频的外观和行为，请查看Video.js。它是一个出色的开源播放器，来自Brightcove善良的人们，它提供了与Vimeo提供的Point and Click定制选项类似的控制级别。\n最后一块拼图是将你的原创视频转换成网络友好的格式，并上传到网上进行分发。\nBunnyCDN提供自己的在线存储区域，您只需通过FTP上传即可，但由于历史原因，我仍然将我下载的大量应用程序和视频存储在S3上，然后将Bunny(以前称为MaxCDN)从AWS拉取作为源服务器。\n至于正确的视频格式，我使用手刹的命令行界面，使用Vimeo YouTube HQ 720p60和Vimeo YouTube HQ 1080p60预设将我的源视频文件转换为MP4。\n但是，因为，嘿，我是一个极客，不喜欢做额外的工作，所以我把整个过程总结成了一个简短的shell脚本，\n使用qlmanager将视频的一帧输出为PNG，以便在视频开始之前在HTML播放器中预览。\n我只需将我的视频文件名传递给该脚本，几分钟后，我可以将输出复制并粘贴到我的文本编辑器中，然后在我的网站上可用。老实说，这是一个比使用Vimeo更快的过程。\n这是剧本。您当然希望修改路径以使其与您自己的设置一起工作，因为它现在完全特定于我的需要。\n#！/bin/bash bucket=$1 base=$(basename--&#34；$2&#34；)Extension=&#34；${base##*。}&#34；FileName=&#34；${BASE%.*}&#34；p720=&#34；/Users/thall/Dropbox/Freelance/Videos/720p/$FILENAME.mp4&#34；p1080=&#34；/Users/thall/Dropbox/Freelance/Videos/1080p/$FILENAME.mp4&#34；png=&#34；/Users/thall/Dropbox/Freelance/Videos/jpg/$BASE.png&#34；JPG=&#34；/Users/thall/Dropbox/Freelance/Videos/jpg/$FILENAME.jpg&#34；/usr/local/bin/HandBrakeCLI-Z&#34；Vimeo YouTube HQ 720p60&#34；-i&#34；$2&#34；-o$p720/usr/local/bin/HandBrakeCLI-Z&34；Vimeo YouTube HQ 1080p60&#34；-i&#34；$2&#34；-o$p1080/usr/bin/qlmanagement-t&#34。/usr/local/bin/magick Convert$png$jpgrm$pngs3cmd put--acl-public--guess-mime-type$p720&#34；s3：//$bucket/720p/$base&#34；s3cmd put--acl-public--guess-mime-type$p1080&#34；s3：//$bucket/1080p/$base&#34；s3cmd put-。Img=\\&#34；$filename.jpg\\&#34；]&#34；\n因此，这就是我如何离开Vimeo，开始自己托管我的视频内容。平均而言，我的带宽账单约为每月11美元-这包括视频、静态资产，以及我所有Mac应用程序的二进制下载。在此之前，我每月仅支付20美元的费用，就是在剩余带宽的基础上进行视频托管。\n它绝对是一个更极客的解决方案，需要做更多的前期工作才能设置，我不确定我会不会推荐它去做真正的生意，但根据我的需要，它是一个有趣的项目，我很高兴每年能节省200美元。", "note_en": "(Please ignore that the above email receipt is for their  Plus plan. Shortly after subscribing I realized I needed to upgrade to  Pro, which supports commercial use.)\n I needed a reliable way to host a bunch of screencasts and video tutorials I was producing for  my software. I went with Vimeo because they&#39;re the obvious choice in this space for two main reasons:\n I didn&#39;t want my content hosted on YouTube where it would be surrounded on all sides by an infinite expanse of flaming garbage. (Don&#39;t take that criticism too harshly - I&#39;m a happy YouTube Premium subscriber.)\n Vimeo is really, really, really good at what they do. I mean, supremely top-notch when it comes to ease-of-use, controlling the end-user experience, speed, and quality.\n But when my renewal email arrived in April, myself and other small developers were seeing sales slow down as the pandemic worsened.\n  Another $240/year was a tough sell for the small amount of video content I was hosting with them, and I wondered if there might be a cheaper alternative - either another service or by hosting videos myself.\n If you&#39;re posting commercial content - like I often do - Vimeo&#39;s terms require you to be a Pro subscriber or higher. And to be clear, I  still think Vimeo at that price (at almost any price, really) is a great value. It&#39;s cheaper than a company with four employees paying for Slack.\n But at my tiny scale and thinking about cutting costs, given the amount of video content I&#39;m actually posting each month and hosting with them, and also being a huge nerd, it didn&#39;t make sense any longer.\n   An easy way to convert raw video into an appropriate size and format for streaming.\n So, where to actually host the video files? My requirements are somewhere reliable that won&#39;t fall over if you get Slashdotted (ha, remember that?), can deliver quickly to visitors in any location, and won&#39;t bankrupt you.\n I have plenty of space available (and almost always enough bandwidth available) on my  Linode (affiliate link - but Linode is  wonderful) servers. But even my primary $20/month VPS with them was brought to its knees multiple times when traffic spiked. (Granted, I was running WordPress at the time.) And I don&#39;t want to take the chance of my business website going down because one of my dumb blog posts on this website gets noticed.\n A lifetime ago,  I wrote about using S3 as a poor man&#39;s content delivery network. That&#39;s still an easy and reliable choice, but the cost for bandwidth doesn&#39;t scale as a true CDN. Which is, of course, why Amazon offers CloudFront. But even then, at $0.085/GB, I&#39;ve had multiple months in the past calendar year that would have been over $200.\n Instead, let me introduce you to my secret weapon:  BunnyCDN. (I get credit if you click that link. But I only use it because I completely love their service as you&#39;ll see below.)\n I switched to Bunny last October after using  MaxCDN (now StackPath) since 2011 for all of my static assets. And I&#39;ve been utterly flabbergasted at just how damn good they are. For a number of reasons:\n The main metric that matters: they&#39;re really fast. I&#39;m seeing equivalent performance as what I was used to with MaxCDN and the larger CDNs I&#39;ve used at my day job.\n The two times I&#39;ve needed to email them with a support question, a knowledgable, helpful human has replied quickly and without needing to go through dumb self-serve solutions.\n Bunny&#39;s control panel where you manage your account, choose bandwidth settings, etc. is super easy to use and incredibly powerful (at least for my needs). It&#39;s a really nice change from what I had with MaxCDN and the AWS Console (powerful as hell, but obtuse).\n For my static website assets (images, stylesheets, JavaScript, etc.) I use Bunny&#39;s standard tier, which serves my content from all of their PoPs. That means visitors will connect to the server closest to them at $0.01/GB (for US and EU PoPs).\n However, my video content uses their volume tier, which is distributed from 7 PoPs (instead of 41). While still being plenty fast enough, that reduces the cost further to $0.005/GB. That works out to a cool $5/TB when my traffic spikes.\n I have zero understanding of how bandwidth is actually priced globally between providers or why some companies charge such a premium compared to others for the same bits over the wire. I assume you&#39;re paying for reliability and/or speed? All I know is that I haven&#39;t seen a blip of downtime or noticed any slowness in the nine months I&#39;ve used BunnyCDN. I can&#39;t explain how they can be  so much less expensive. Maybe they won&#39;t scale to &#34;real&#34; traffic? But for what I need, they&#39;ve been a phenomenal choice.\n (Ok, I&#39;m done going on and on about them now. This really isn&#39;t any sort of paid or sponsored content crap for Bunny. I&#39;ve just been so impressed since switching, that I finally wanted to give them recognition.)\n  The next thing we need is a way to show those videos inline on your website.\n Gone are the days of embedded Flash video. Now, you can mostly get away with just using the native HTML5 video element.\n However, if you want more control over the appearance of your video and how it behaves, take a look at  Video.js. It&#39;s a wonderful open source player from the kind folks at Brightcove that provides a similar level of control as the point and click customization options that Vimeo offers.\n The last puzzle piece is getting your original videos into a web-friendly format and uploading them for distribution.\n BunnyCDN offers their own online storage zones that you can simply upload to via FTP, but for historical reasons, I still store my large app downloads and videos on S3 and then have Bunny (and previously MaxCDN) pull from AWS as an origin server.\n And as for the correct video format, I&#39;m using  Handbrake&#39;s command line interface to convert my source videos files into  mp4 using the  Vimeo YouTube HQ 720p60 and  Vimeo YouTube HQ 1080p60 presets.\n But, because, hey, I&#39;m a geek who doesn&#39;t like doing extra work, I&#39;ve wrapped up the whole process into a short shell script that\n Uses   qlmanage to output a frame of the video as a  png for previewing in the HTML player before the video starts\n I just pass my video&#39;s filename to that script, and a few minutes later I can copy and paste the output into my text editor and make it available on my website. Honestly, it&#39;s an even faster process than using Vimeo.\n Here&#39;s the script. You&#39;ll of course want to modify the paths to make it work with your own setup since it&#39;s completely specific to my needs right now.\n #!/bin/bash bucket = $1 base = $(basename --  &#34; $2 &#34; ) extension = &#34; ${ base ##*. } &#34; filename = &#34; ${ base %.* } &#34; p720 = &#34;/Users/thall/Dropbox/Freelance/Videos/720p/ $filename .mp4&#34; p1080 = &#34;/Users/thall/Dropbox/Freelance/Videos/1080p/ $filename .mp4&#34; png = &#34;/Users/thall/Dropbox/Freelance/Videos/jpg/ $base .png&#34; jpg = &#34;/Users/thall/Dropbox/Freelance/Videos/jpg/ $filename .jpg&#34;/usr/local/bin/HandBrakeCLI -Z  &#34;Vimeo YouTube HQ 720p60&#34; -i  &#34; $2 &#34; -o  $p720/usr/local/bin/HandBrakeCLI -Z  &#34;Vimeo YouTube HQ 1080p60&#34; -i  &#34; $2 &#34; -o  $p1080/usr/bin/qlmanage -t  &#34; $2 &#34; -s  1080 -o  &#34;/Users/thall/Dropbox/Freelance/Videos/jpg/&#34;/usr/local/bin/magick convert  $png  $jpgrm  $pngs3cmd put --acl-public --guess-mime-type  $p720  &#34;s3:// $bucket /720p/ $base &#34;s3cmd put --acl-public --guess-mime-type  $p1080  &#34;s3:// $bucket /1080p/ $base &#34;s3cmd put --acl-public --guess-mime-type  $jpg  &#34;s3:// $bucket /jpg/ $filename .jpg&#34; echo  &#34;[tylervideo url=\\&#34; $base \\&#34; img=\\&#34; $filename .jpg\\&#34;]&#34;\n So that&#39;s how I moved off Vimeo and started hosting my video content myself. On average, my bandwidth bill is about $11/month - and that includes videos, static assets, and ALSO binary downloads for all of my Mac apps. Previously, I was paying $20/month  just for video hosting on top of the rest of my bandwidth.\n It&#39;s definitely a geekier solution that requires more work up front to setup, and I&#39;m not sure I would recommend it for a &#34;real&#34; business, but for my needs it was a fun project and I&#39;m happy to save $200 a year.", "posttime": "2020-07-20 13:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "视频,video", "title": "DIY视频托管", "title_en": "DIY Video Hosting", "transed": 1, "url": "https://tyler.io/diy-video-hosting/", "via": "", "real_tags": ["视频", "video"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012974, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我探索了如何使用几种不同的方法实现余弦。其中一个实现几乎比math.h快3倍，如果您可以使用4位小数精度。\n您有没有想过，用您最喜欢的编程语言编写的数学库是如何实现三角函数的，比如余弦？这是一个很常见的函数，你可以在任何一个数学库中找到，所以它必须相当简单，对吧？哦，不。它肯定不是。\n这一切都始于我的朋友和同事斯蒂芬·马兹博士，当时他正在研究一个操作系统的内核，我建议他在屏幕上画余弦函数。我经常使用余弦作为图形应用程序的余弦。问题：他的内核不能使用C标准库(再见，math.h！)。它的目标是RISC-V体系结构(与Intel fcos指令完全不同！)。\n您必须认识到，我既不是数学家，也不是系统编程大师。事实上，在我大学学习数学和计算机科学的10年里，不知何故，我从来没有上过三角学课程。因此，我将带您通过我在C语言中研究和实现余弦的障碍。我的目标是：\n我们将探索几种计算余弦的方法和一些优化。因为我不是C忍者，所以我会避免任何精心设计的诡计或微优化(但如果你知道一些，请告诉我！)。事实上，对于性能稍差的代码，我经常选择可读性更好的代码。我们将在进行过程中进行基准测试，以了解我们行动的影响。所有代码和基准都可以在GitHub存储库中找到。\n在我所有的编程时间里，只有一种情况下我使用余弦：游戏，游戏，游戏。\n这是我在几乎所有游戏中都使用的基本代码，用于向给定方向移动对象。无论是从自上而下的角度看玩家，还是从屏幕上飞来飞去的投射物。\n当我开始这个超越的兔子洞时，我发现了近似余弦的泰勒级数方法。\n这似乎是数学库中计算余弦的事实方法，至少在较高级别上是这样。给出更多的项，近似值就会更精确。\n我脑海中浮现的一个想法是使用查找表。它是一个预先计算的值数组，可用于在给定一些输入的情况下查找最接近的余弦值。在计算能力更加有限的年代，这种情况并不少见。我在GitHub上找不到任何使用表作为trig函数的著名项目，但我确信它们确实存在。\nCORDIC是另一个在我的搜索中不断出现的词。它是一种迭代方法，仅使用加法、减法、位移位和小查找表即可计算正弦和余弦等函数。它通常是在硬件中实现的，可以追溯到20世纪50年代末，或者在经常在低端CPU或微控制器上运行的软件中实现，比如计算器中的那些。这种方法在过去相当流行，并且被Intel8087数学协处理器、TI-85计算器和HP-48G计算器使用。然而，我找不到任何关于今天是否经常使用它的参考资料。有关更多详细信息，请参阅维基百科的文章或描述该方法的原始论文，或者查看用C编写的实现。我不会将我的方法与之进行比较，但我有点好奇它是如何站得住脚的。原文中的数字：\n然后是Intel CPU fcos指令。该指令在给定FPU寄存器中存储的-2^63到2^63范围内以弧度表示的浮点值的情况下计算余弦，并将其替换为结果。我不确定现代英特尔CPU是否仍然使用CORDIC方法，如果是，它是在硬件中实现还是在软件中实现。在分解了几个使用余弦的程序之后，我找不到一个真正使用fcos指令的程序。虽然速度很快，但其他人已经记录了指令的不准确性，尤其是当参数接近pi/2的倍数时。有关更多详细信息，请参阅此非官方文档或英特尔官方参考。\n现在，任何理智的人都会使用C&#39；的数学。出于日常目的，你可能应该这样做。但请记住，我们不能使用标准库中的任何内容。而且，那也不会有任何乐趣。我确实比较了数学在我电脑上的余弦函数和Wolfram Alpha的精确度。我发现Math.h的精确度高达15位数，这远远超过了我所需要的。为了了解标准库如何计算余弦，我查看了几个C标准库实现的源代码。Glibc、Newlibc、MUSL等。尽管它们看起来像是在使用泰勒级数，但这些对我来说有点太难理解了。它们彼此都非常不同，通常依赖于几个密集的函数，到处都是幻数，有预计算值的表，并且使用大量的位欺骗。有人花了很多时间把这些弄快。\n这是我在MUSL中尝试浏览相关代码时的屏幕截图。从cos()到__cos()到__rem_pio2()。\n随着我逐步实现不同的余弦计算方法，我将从两个角度对它们进行比较：运行时和准确性。对于运行时，每个函数使用一定范围的输入值执行1亿次，并使用time.h的时钟函数对其进行计时。为了准确起见，它取我的函数的结果与Math.h；的结果在一定输入范围内的差值，然后返回最坏的情况。例如，精确值0.0002意味着在最坏的情况下，对于大范围输入的一个输入，我的实现与math.h相差0.0002。\n//以秒为单位测量多次执行的时间。数值越小越好。Double Runtime(DOUBLE(*FUNC)(DOUBLE)){CLOCK_T START=CLOCK()；FOR(int i=0；i&lt；100000000；i++){易失性DOUBLE C=FUNC(I/10000.0)；(Void)c；}RETURN(CLOCK()-START)/(DOUBLE)CLOCKS_Per_Sec；}//找出与math.h相比精度最差的情况。数值越小越好。双精度(Double(*func)(Double)){Double w=-1；Double Start=0；Double Stop=const_2pi；Double Step=0.0000001；For(Double i=Start；I&lt；Stop；i+=Step){Double c=absd(func(I)-cos(I))；if(c&&gt;；w){w=c；}}返回w；}\n该基准测试是用clang 11.0.3编译的，运行在13英寸的2018 MacBook Pro上，配备2.7 GHz i7 CPU和16 GB RAM。\n您可以在GitHub资源库中找到所有基准代码。感谢Marz博士重写了它，使其具有易于使用的界面。\n当我开始使用输入值(如0.1%和0.235)测试它时，这似乎出人意料地准确。当我把它画在math.h旁边时，我的热情就消退了。\n洋红色的线条是math.h，绿色是我的函数。它看起来相当精确，介于-pi和+pi之间，但是随后就爆炸了。\nDOUBLE COS_TALYLE_TEXAL_6TERMS_NAIVE(DOUBLE X){Return 1-((x*x)/(2))+((x*x)/(24))-((x*x)/(720))+((x*x)/(40320))-((x*x)/(。3628800))+((x*x)/(479001600))；}。\n在这一点上，我突然想到了3个可能的改进：缩小输入范围，减少冗余计算的数量，以及不断添加更多的术语。\n我尝试的第一个优化是缩小范围。输入值越大，该方法的精度就越低。因为余弦每2pi重复一次，所以我们只想做x=x%(2*pi)；。然而，在C语言中，模运算符不能处理浮点数，所以我们自己做了一个。\n#定义modd(x，y)((X)-(Int)((X)/(Y))*(Y))DOUBLE COS_泰勒_TEXAL_6TERMS_2pi(DOUBLE X){x=modd(x，const_2pi)；返回1-((x*x)/(2))+((x*x)/(24))-((x*x)/(720))+((x*x)/(40320))-((x*x)/(3628800))+((。X*x)/(479001600))；}\n这对于pi以上的值更好，但是直到2pi它仍然非常不准确。我们可以做得更好，因为余弦值等于π的每个倍数，除了符号反转。要做到这一点，我们可以以2pi取模，如果值大于pi，则减去pi，计算泰勒级数，然后应用正确的符号。所以我们实际上只计算了从0到π的余弦。\nDOUBLE COS_TELLER_TEXAL_6TERMS_pi(DOUBLE X){x=modd(x，const_2pi)；char sign=1；if(x&gt；const_Pi){x-=const_Pi；sign=-1；}回车符号*(1-((x*x)/(2))+((x*x)/(24))-((x*x)/(720))+((x*x)/(40320))-((x*x)/(。3628800))+((x*x)/(479001600))；}。\n下一次优化涉及到删除一些冗余计算。您会注意到代码中到处都是x*x。我所做的只是减少了一些具有双xx=x*x；的乘法。\nDOUBLE COS_泰勒_TEXAL_6TERMS(DOUBLE X){x=modd(x，const_2pi)；char sign=1；if(x&gt；const_Pi){x-=const_Pi；sign=-1；}DOUBLE xx=x*x；回车符号*(1-((Xx)/(2))+((xx*xx)/(24))-((xx*xx*xx)/(720))+((xx*xx)/(40320))-((xx*xx)/(3628800))+((xx*xx)/(479001600)；}。\n这是一场巨大的表演胜利！我也试了双倍，但没有看到太大的不同，所以我继续前进。\n我仍然不确定要用多少个术语。所以我尝试了10个术语，看看它是如何提高准确性的：\nDOUBLE COS_泰勒_TEXAL_10TERMS(DOUBLE X){x=modd(x，const_2pi)；char sign=1；if(x&gt；const_Pi){x-=const_Pi；sign=-1；}DOUBLE xx=x*x；回车符号*(1-((Xx)/(2))+((xx*xx)/(24))-((xx*xx*xx)/(720))+((xx*xx)/(40320))-((xx*xx)/(3628800))+((xx*xx)/(479001600))-((xx*。Xx*xx)/(87178291200))+((xx*xx)/(20922789888000))-((xx*xx)/(6402373705728000))+((xx*xx)/(2432902008176640000))；}。\n此时，在查看图表时，10个术语线与math.h重叠。进步了！当将最坏情况的精确度与math.h进行比较时，这4项是个笑话。6个术语的偏差是0.0001，这比我需要的更准确，而10个术语的偏差只有0.00000000007。喔！\n然而，更多的术语是以高昂的运行时成本为代价的。从基准来看，天真的4个术语只用了0.4秒，6个术语用了0.94秒，10个术语用了1.46秒。同时，math.h只需要大约1.04秒，精度更高。\n在向马兹博士展示了我的进步后，他做了一些代数魔术，并把他的改良版本送给了我。他的方法通过存储消除了大量冗余的计算，并且还有一个额外的好处，那就是允许您指定所需的词条数量。对于特定的应用程序，这可能很方便，这样您就可以将不同程度的精度/速度作为参数。\nDouble cos_Taylor_running_yterm(Double x，int y){int div=(Int)(x/const_Pi)；x=x-(div*const_Pi)；char sign=1；if(div%2！=0)sign=-1；Double Result=1.0；Double Intern=1.0；Double Num=x*x；for(int i=1；i&lt；=y；i++){Double Comp=2.0*i；Double den=comp。IF(i%2==0)RESULT+=INTER；ELSE RESULT-=INTER；}RETURN SIGN*RESULT；}。\n为了进行基准测试，我没有使用带有第二个参数的这个版本。相反，我复制了该函数并对循环进行了硬编码，使其适用于常量值(如6、10和16)。\n增加更多的期限肯定会带来递减的回报。在16个条件下，最坏情况的准确率降低了0.0000000000000009，但是运行时基准测试需要2.57秒。它一点也不慢，但和数学比起来…。它是。\n我想尝试的另一个选项是查找表。其想法是预先计算一组值，并将它们硬编码到一个数组中。在计算机出现之前，查找表就已经存在很久了，所以这并不是一种新技术。在这种情况下，我希望放弃一点内存将带来巨大的运行时优势，同时仍然足够准确。\n为了生成查找表，Marz博士编写了一个Python脚本，该脚本生成一个C头文件，其中包含一个数组，其中每个元素都是使用math.h计算得出的余弦值。非常聪明！\n从数学导入cos，pidef main(f，精度，名称)：f.write(&#34；Double%s[]={\\n&#34；%name)j=0 p=0.0而True：f.write(&#34；{：.20f}，&#34；.format(cos(P)j+=1 p+=精度，如果p&gt；2*pi：中断f.write(&#34；1.0}；\\n&#34；)f。Const int%s_size=%d；\\n&#34；%(名称，j+1)if__name__==&#39；__main__&#39；：main(open(&#34；cotable_1.h&#34；，&#34；w&#34；)，1.0，&#34；cotable_1&#34；)main(open(&#34；cotable_0_1.h&#34；，&#34；w&#34；)main(&#34；cotable_0_1.h&#34；，&#34；w&#34；)main(打开(&#34；cotable_0_1.h&#34；，&#34；w&#34；)。)，0.001，&#34；COSTRATE_0_01&#34；)Main(OPEN(&#34；COSTABLE_0_001.h&#34；，&#34；W&#34；)Main(OPEN(&#34；COSTABLE_0_001.h&#34；，&#34；w&#34；)，0.10，&#34；COSTRATE_0_001&#34；)Main(OPEN(&#34；COSTABLE_0_001.h&#34；，&#34；W&#34；)Main(OPEN。COSTABLE_0_0001.h&#34；，&#34；w&#34；)，0.0001，&#34；COSTABLE_0_0001&#34；)\n我们想用不同的精度测试我们的桌子。我们生成了包含8个值、64个值、630值、6285值和62833个值的表。成本以增加可执行文件的形式出现。1.0和0.1表并不明显，但是其他表分别增加了大约5KB、50KB和500KB的可执行文件大小。\nDOUBLE ABSD(DOUBLE A){*(UNSIGNED LONG*)&amp；a)&amp；=~(1UL&lt；&lt；63)；return a；}DOUBLE COS_TABLE_0_01(DOUBLE X){x=ABSD(X)；x=modd(x，const_2pi)；return Cotable_0_01[(Int)(x*100+0.5)]；}。\n这些桌子似乎在精确度上达到了很好的平衡。最小表的最坏情况精度为0.49，因此不可用。但是，表大小每增加一位，精度就会增加1位：0.049、0.0049、0.00049和0.000049。每个表的运行时测试大约为0.38。真快啊！(实际上，我们将运行时降到了大约0.33，但是代码很难看。)。\n当然，查找表很棒，但是对于表中没有的值，我们可以做得更好。引言，线性插值。对于取两个值之间的加权平均值来说，这只是一个听起来很酷的术语。现在，当输入值不在表中时，我们将根据哪个表项更接近来计算近似值。代码：\n#定义LERP(w，v1，v2)((1-(W))*(V1)+(W)*(V2))DOUBLE COS_TABLE_0_01_LERP(DOUBLE X){x=absd(X)；x=modd(x，const_2pi)；Double i=x*100.0；int index=(Int)i；返回LERP(i-index，/*权重*/CoStability_0_01[索引]，/*下限*/CoStability_0_01[索引+1]/*上限*/)；}。\n以下是我们的函数与math.h(越低越好！)在最坏情况下的精确度的比较：\n下面是用于计算100,000,000个值的运行时函数的比较(越低越好！)：\n那么我推荐使用什么呢？Math.h，如果可能的话。这些函数都不是特别慢，而且大多数都足够精确。但是下次我制作一个严重依赖于触发器函数的游戏时，我会使用0_001表。", "note_en": "TL;DR:  I explored how to implement cosine using a few different approaches. One of the implementations is nearly  3x faster than  math.h if you are ok with 4 decimal places of precision.\n Have you ever wondered how the math library in your favorite programming language implements trigonometric functions, like cosine? It is such a common function that you can find in any and every math library so it must be fairly straight forward, right? Oh no. It most definitely is not.\n This all started when my friend and colleague,  Dr. Stephen Marz, was working on the kernel of an operating system and I suggested that he draw the cosine function on the screen. I often use cosine as a &#34;hello, world&#34; for graphical applications. The problem: his kernel can not use the C standard library (goodbye  math.h!) and it targets the RISC-V architecture (nothing like the Intel  fcos instruction!).\n  You must realize that I am neither a mathematician or a systems programming guru. In fact, out of my 10 years of college studying mathematics and computer science, I somehow never took a trigonometry course. So I&#39;m going to walk you through my hurdles of investigating and implementing cosine in C. The goals are:\n  We will explore several ways to compute cosine and a few optimizations. Since I&#39;m not a C ninja, I&#39;ll be avoiding any elaborate trickery or micro-optimizations (but if you know of some, let me know!). In fact, I often chose more readable code for slightly less performant code. We will benchmark as we go along to understand the implications of our actions. All of the code and benchmarks can be found in the GitHub  repository.\n    In all my time of coding, there has only been one situation in which I used cosine: games, games, games.\n  This is the basic code that I&#39;ve used in virtually all  my games to move an object in a given direction. Whether it be the player from a top-down perspective or projectiles flying across the screen.\n     When I initiated this transcendental rabbit hole, I found the  Taylor series method of approximating cosine.\n  This seems to be the defacto way of calculating cosine in math libraries, at least at a high level. Given more terms, the approximation will be more accurate.\n One thought that came to my mind is to use a  lookup table. It is a precalculated array of values that can be used to look up the closest cosine value given some input. This wasn&#39;t uncommon at all back when computing power was more limited. I couldn&#39;t find any notable projects on GitHub that use a table for trig functions, but I&#39;m sure they exist.\n CORDIC is another term that kept popping up in my searches. It is an iterative method for computing functions like sine and cosine using only addition, subtraction, bit shifting, and a small lookup table. It was often implemented in hardware, going back to the late 1950s, or in software that often runs on low-end CPUs or microcontrollers, like those found in calculators. This method was quite popular in the past, and was used by the Intel 8087 Math Coprocessor, TI-85 calculator, and HP-48G calculator. However, I can&#39;t find any references of whether it is used much today. For more details, see the Wikipedia  article or the original  paper describing the method or check out an  implementation written in C. I won&#39;t be comparing my methods to it, but I am a little curious how it holds up. Figure from the original  paper:\n  Then there is the Intel CPU  fcos instruction. The instruction computes cosine given a floating-point value in radians in the range -2^63 to 2^63 stored in a FPU register and replaces it with the result. I&#39;m not sure if modern Intel CPUs still use the CORDIC method, and if so, whether it is implemented in hardware or software. After dissembling a few programs that use cosine, I could not find one that actually used the fcos instruction. Although it is fast, others have  documented the inaccuracy of the instruction, most notably when the argument approaches multiples of pi/2. For more details, see this unofficial  documentation or the official Intel  reference.\n Now, any sane person will just use C&#39;s  math.h. And for everyday purposes, you probably should. But remember, we couldn&#39;t use anything from the standard library. Also, that wouldn&#39;t be any fun. I did compare the accuracy of math.h&#39;s cosine function on my computer to Wolfram Alpha. I found that math.h is accurate up to 15 digits of precision, which is way more than I will ever need.\t To see how the standard library computes cosine, I went and looked at the source of several C standard library implementations. Glibc, Newlibc, Musl, etc. Even though they looked like they were using a Taylor series, these were a bit too much for me to get my head around. They were all very different from one another, often relied on several dense functions, were littered with magic numbers, had tables of precomputed values, and were using extensive bit trickery. Someone spent a lot of time on making these fast.\n Here is a screenshot of when I was trying to walk through the relevant code in Musl. From  cos() to  __cos() to  __rem_pio2().\n    As I progress through implementing the different methods of calculating cosine, I will be comparing them from two perspectives: runtime and accuracy. For runtime, each function is executed 100 million times using a range of input values and timed it using time.h&#39;s clock function. For accuracy, it takes the difference of my function&#39;s results and math.h&#39;s results over a range of inputs, and returns the worst case. For example, an accuracy value of 0.0002 means that in the worst case, my implementation was 0.0002 off from math.h, for one input over a large range of inputs.\n  // Measures the time of many executions in seconds. Smaller number is better.double runtime(double (*func)(double)){ clock_t start = clock(); for (int i = 0; i &lt; 100000000; i++) { volatile double c = func(i / 10000.0); (void)c; } return (clock() - start) / (double)CLOCKS_PER_SEC;}// Finds the worst case for accuracy compared to math.h. Smaller number is better.double accuracy(double (*func)(double)){ double w = -1; double start = 0; double stop = CONST_2PI; double step = 0.0000001; for (double i = start; i &lt; stop; i += step) { double c = absd(func(i) - cos(i)); if (c &gt; w) { w = c; } } return w;}\n The benchmark was compiled with clang 11.0.3 and ran on a 13-inch 2018 MacBook Pro with a 2.7GHz i7 CPU and 16GB of RAM.\n You can find all the benchmark code in the GitHub  repo. Thanks to Dr. Marz for rewriting it to have an easy to use interface.\n    This seemed surprisingly accurate when I started testing it with input values like  0.1 and  0.235. My enthusiasm faded when I graphed it next to math.h:\n  The magenta line is math.h while green is my function. It looks fairly accurate between -pi and +pi, but then explodes.\n  double cos_taylor_literal_6terms_naive(double x) { return 1 - ((x*x)/(2)) + ((x*x*x*x)/(24)) - ((x*x*x*x*x*x)/(720)) + ((x*x*x*x*x*x*x*x)/(40320)) - ((x*x*x*x*x*x*x*x*x*x)/(3628800)) + ((x*x*x*x*x*x*x*x*x*x*x*x)/(479001600)); }\n     There were 3 possible improvements that jumped out at me at this point: reduce the range of the input, reduce the number of redundant calculations, and keep adding more terms.\n The first optimization I tried was  range reduction. The bigger the input value, the less accurate this method is. Since cosine repeats every 2pi, we want to just do  x = x % (2*pi);. However, in C the modulus operator doesn&#39;t work on floating point numbers, so we made our own.\n #define modd(x, y) ((x) - (int)((x) / (y)) * (y))double cos_taylor_literal_6terms_2pi(double x){ x = modd(x, CONST_2PI); return 1 - ((x * x) / (2)) + ((x * x * x * x) / (24)) - ((x * x * x * x * x * x) / (720)) + ((x * x * x * x * x * x * x * x) / (40320)) - ((x * x * x * x * x * x * x * x * x * x) / (3628800)) + ((x * x * x * x * x * x * x * x * x * x * x * x) / (479001600));}\n This is better for values over pi, but it is still very inaccurate leading up to 2pi. We can do better since the cosine values are equivalent every multiple of pi, except that the sign flips. To do that we can mod by 2pi, subtract pi if the value is greater than pi, calculate the Taylor series, and then apply the correct sign. So we are really only calculating cosine from 0 to pi.\n double cos_taylor_literal_6terms_pi(double x){ x = modd(x, CONST_2PI); char sign = 1; if (x &gt; CONST_PI) { x -= CONST_PI; sign = -1; } return sign * (1 - ((x * x) / (2)) + ((x * x * x * x) / (24)) - ((x * x * x * x * x * x) / (720)) + ((x * x * x * x * x * x * x * x) / (40320)) - ((x * x * x * x * x * x * x * x * x * x) / (3628800)) + ((x * x * x * x * x * x * x * x * x * x * x * x) / (479001600)));}\n   The next optimization involved removing some of the redundant calculations. You&#39;ll notice the  x*x everywhere in the code. All I did was reduce some of the multiplications with  double xx = x * x;.\n double cos_taylor_literal_6terms(double x){ x = modd(x, CONST_2PI); char sign = 1; if (x &gt; CONST_PI) { x -= CONST_PI; sign = -1; } double xx = x * x; return sign * (1 - ((xx) / (2)) + ((xx * xx) / (24)) - ((xx * xx * xx) / (720)) + ((xx * xx * xx * xx) / (40320)) - ((xx * xx * xx * xx * xx) / (3628800)) + ((xx * xx * xx * xx * xx * xx) / (479001600)));}\n This was a massive performance win! I also tried  double xxxx = xx * xx; but didn&#39;t see much of a difference, so I moved on.\n I still wasn&#39;t sure how many terms to use. So I tried it up to 10 terms to see how it improves accuracy:\n double cos_taylor_literal_10terms(double x){ x = modd(x, CONST_2PI); char sign = 1; if (x &gt; CONST_PI) { x -= CONST_PI; sign = -1; } double xx = x * x; return sign * (1 - ((xx) / (2)) + ((xx * xx) / (24)) - ((xx * xx * xx) / (720)) + ((xx * xx * xx * xx) / (40320)) - ((xx * xx * xx * xx * xx) / (3628800)) + ((xx * xx * xx * xx * xx * xx) / (479001600)) - ((xx * xx * xx * xx * xx * xx * xx) / (87178291200)) + ((xx * xx * xx * xx * xx * xx * xx * xx) / (20922789888000)) - ((xx * xx * xx * xx * xx * xx * xx * xx * xx) / (6402373705728000)) + ((xx * xx * xx * xx * xx * xx * xx * xx * xx * xx) / (2432902008176640000)));}\n At this point, when looking at the graph the 10 terms line overlaps with math.h. Progress! When comparing the worst case accuracy with math.h, the 4 terms was a joke. The 6 terms was off by 0.0001, which is more accuracy than I need, while the 10 terms was off by a mere 0.00000000007. Woohoo!\n However, more terms comes at a steep runtime cost. From the benchmark, the naive 4 terms only takes 0.4 seconds, 6 terms takes 0.94 seconds, and 10 terms takes 1.46 seconds. Meanwhile, math.h only takes about 1.04 seconds with even more accuracy.\n   After showing my progress to  Dr. Marz, he did some algebra magic and sent me over his modified version. His method removes a lot of redundant calculations by storing them and has the added benefit of allowing you to specify how many terms in you want. For particular applications, this could be handy so that you can have varying degrees of precision/speed as a parameter.\n double cos_taylor_running_yterms(double x, int y){ int div = (int)(x / CONST_PI); x = x - (div * CONST_PI); char sign = 1; if (div % 2 != 0) sign = -1; double result = 1.0; double inter = 1.0; double num = x * x; for (int i = 1; i &lt;= y; i++) { double comp = 2.0 * i; double den = comp * (comp - 1.0); inter *= num / den; if (i % 2 == 0) result += inter; else result -= inter; } return sign * result;}\n For the sake of benchmarks, I did not use this version with the second parameter. Instead, I duplicated the function and hardcoded the loop to work for constant values (like 6, 10, and 16).\n There are definitely diminishing returns with adding more terms. At 16 terms the worst case accuracy is off by 0.0000000000000009 but takes 2.57 seconds for the runtime benchmark. It isn&#39;t slow by any means at all, but compared to math.h... it is.\n  The other option I wanted to try is a lookup table. The idea is to precompute a bunch of values and hardcode them in an array. Lookup tables have existed looong before computers, so this isn&#39;t a novel technique. In this case, I&#39;m hoping that giving up a bit of memory will provide a huge runtime win while still being accurate enough.\n To generate the lookup table, Dr. Marz wrote a Python script that generates a C header file containing an array where each element is a cosine value that&#39;s calculated using math.h. Very smart!\n from math import cos, pidef main(f, PRECISION, NAME): f.write(&#34;double %s[] = {\\n&#34; % NAME) j = 0 p = 0.0 while True: f.write(&#34;{:.20f}, &#34;.format(cos(p))) j += 1 p += PRECISION if p &gt; 2*pi: break f.write(&#34;1.0 };\\n&#34;) f.write(&#34;const int %s_size = %d;\\n&#34; % (NAME, j+1))if __name__ == &#39;__main__&#39;: main(open(&#34;costable_1.h&#34;, &#34;w&#34;), 1.0, &#34;costable_1&#34;) main(open(&#34;costable_0_1.h&#34;, &#34;w&#34;), 0.1, &#34;costable_0_1&#34;) main(open(&#34;costable_0_01.h&#34;, &#34;w&#34;), 0.01, &#34;costable_0_01&#34;) main(open(&#34;costable_0_001.h&#34;, &#34;w&#34;), 0.001, &#34;costable_0_001&#34;) main(open(&#34;costable_0_0001.h&#34;, &#34;w&#34;), 0.0001, &#34;costable_0_0001&#34;)\n We wanted to test our tables with different precision. We generated tables with 8 values, 64 values, 630 values, 6285 values, and 62833 values. The cost comes in the form of an increased executable. The 1.0 and 0.1 tables aren&#39;t noticeable, but the other tables increased the executable size by about 5KB, 50KB, and 500KB, respectively.\n double absd(double a) { *((unsigned long *)&amp;a) &amp;= ~(1UL &lt;&lt; 63); return a; }double cos_table_0_01(double x){x = absd(x);x = modd(x, CONST_2PI);return costable_0_01[(int)(x * 100 + 0.5)];}\n The tables seem to hit a nice balance of accuracy. The worst case accuracy of the smallest table is 0.49, so not usable. But with each increase in the table size, you get 1 more digit of precision: 0.049, 0.0049, 0.00049, and 0.000049. The runtime test for each table was about 0.38.  That is fast! (Actually, we got the runtime down to about 0.33, but the code was ugly.)\n  Sure, a lookup table is great, but we can do better for values that aren&#39;t in the table. Introducing,  linear interpolation. This is just a cool sounding term for taking the weighted average between two values. Now when the input value isn&#39;t in the table, we will compute an approximation based on which table entry is closer. The code:\n #define lerp(w, v1, v2) ((1.0 - (w)) * (v1) + (w) * (v2))double cos_table_0_01_LERP(double x){ x = absd(x); x = modd(x, CONST_2PI); double i = x * 100.0; int index = (int)i; return lerp(i - index, /* weight */ costable_0_01[index], /* lower value */ costable_0_01[index + 1] /* upper value */ );}\n  Here is a comparison of our functions for worst case accuracy compared to math.h (lower is better!):\n  Here is a comparison of our functions for runtime to compute 100,000,000 values (lower is better!):\n   So what do I recommend using? Math.h if possible. None of these functions are particularly slow, and most of them are accurate enough. But the next time I make a game that depends heavily on trig functions, I&#39;ll be using the 0_001 table.", "posttime": "2020-07-20 13:04:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "从头开始,cosine,double", "title": "用C语言从头开始实现余弦", "title_en": "Implementing cosine in C from scratch", "transed": 1, "url": "http://web.eecs.utk.edu/~azh/blog/cosine.html", "via": "", "real_tags": ["从头开始", "cosine", "double"]}, {"category": "", "categoryclass": "", "imagename": "6967abbba6a708614ae9fcc6951e75f7.jpg", "infoid": 1012971, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "数百万在冠状病毒大流行中设法保住工作的美国人的收入下降，因为雇主大幅削减工资和工时，以度过他们预期的短期停工。\n现在，随着病毒的肆虐和经济衰退的加深，那些本应是暂时的削减可能会变成永久性的-甚至为进一步裁员铺平道路。这可能预示着对劳动力市场和经济的严重破坏，因为与几个月前相比，这么多保住了工作的工人可以消费的钱更少了。\n这些数字没有受到与失业人数同样的关注，政府数据每周都会强调失业人数。但据美联储(Federal Reserve)和芝加哥大学(University Of Chicago)的经济学家称，自2月份以来，至少有400万美国工人在继续工作的同时遭到减薪，还有数百万人的工资被冻结。他们发布了一项研究，分析了工资处理公司ADP的数据。\n其他估计数字更高：根据穆迪分析公司(Moody‘s Analytics)首席经济学家马克·赞迪(Mark Zandi)的说法，大约有700万工人可能收到了停薪。加上那些被迫工作时间减少的人，这一数字攀升至2000万人-或者说八分之一的工人-在过去几个月里，尽管他们继续工作，但工资却在缩水，这突显出停工造成的伤害不仅仅是裁员。\n华盛顿公平增长中心宏观经济政策主管克劳迪娅·萨姆(Claudia Sahm)最近在Twitter上写道：“我们面临的收入危机甚至比失业危机还要严重。”\n萨姆曾在美联储工作，他在接受采访时提到了“收入危机”的标签，他说：“这里面有太多的东西。”“有大量的工作岗位流失。工作时间在减少，加班时间在减少。最重要的是，有很大一部分工人减薪，这是我们完全没有看到的。“。\n值得注意的是，裁员主要打击了工资更高的工人，他们往往更容易受到经济低迷的影响。而较少的工资，即使是在短期内，也会导致支出减少，从而延长任何经济衰退的时间。\n前劳工部官员、现任非营利组织WorkingNation主席简·奥茨(Jane Oates)表示：“复苏的速度实际上与消费者的行为直接相关。”“如果人们没有钱，他们就不会花钱。”\n这一趋势还表明，员工认为，除了接受相同工作的更低工资之外，他们没有更好的选择。根据纽约联邦储备银行(New York Federal Reserve)的一项调查，美国人认为，如果他们今天失业，他们在三个月内找到新工作的可能性不到50%-比一年前下降了16个百分点以上。\n这也给雇主带来了麻烦，他们历来避免减薪，因为减薪对员工士气和公司生产率造成了损害。但根据对ADP数据的研究，现在工资下降的可能性是大衰退期间的两倍，这可能表明，雇主觉得如果他们想继续敞开大门，他们别无选择。\n杰米·瓦吉德斯(Jamie Vagedes)是圣路易斯旅游奖励公司Maritz Moditive的会计，他在4月份接受了20%的减薪，他认为至少还会再减3到6个月。该公司与遭受大流行残酷打击的酒店和汽车租赁公司合作，已经解雇或暂时解雇了大约四分之一的员工，而且没有给出那些留下来的员工恢复收入的时间表。\nVagedes说，他能够推迟支付抵押贷款，但所有其他账单和费用都保持不变。他说：“每件事的成本都降低了20%，这很有挑战性。”\n经济学家警告说，停摆持续的时间越长，经济滞后的时间越长，临时裁员就越有可能变成永久性的，或者导致进一步的裁员。Zandi说，如果公司为了生存而求助于减薪，“那么下一件事就是，我只能裁员--我别无选择。”\n根据对ADP数据的研究，与裁员不同，裁员对低收入工人的影响不成比例，减薪主要打击的是白领行业的工人。研究人员说，四分之三的减薪幅度属于收入最高的40%的工薪阶层。\n一些最大的公司也参与其中。前美联储经济学家朱莉娅·科罗纳多(Julia Coronado)创立了宏观政策展望公司(Macropolicy Perspections)，她跟踪了市值超过10亿美元的美国公司，发现在4月至7月期间提供财报电话会议细节的260家公司中，有42%的公司在减薪。\nLyft宣布对所有受薪员工进行为期三个月的减薪，降薪幅度从10%到30%不等，而零售巨头百思买(Best Buy)和盖普(Gap)则将减薪重点放在高管身上。\n削减工资的举措反映出雇主最初认为经济低迷将是短期的。\n一开始，由于政府停摆刚开始站稳脚跟，“人们愿意接受减薪，因为你认为这将是暂时的，”均富首席经济学家Diane Swank说.。“这真的突显了这场衰退的独特之处--人们认为这是一个短暂的事件。”\n但最新数据现在表明，随着冠状病毒病例达到创纪录高位，经济衰退可能会加深，持续时间可能比最初预期的要长得多，该国大部分地区要么暂停了重新开放计划，要么取消了重新开放计划。\n高盛(Goldman Sachs)周五在一份分析报告中表示，消费者服务支出的增长预计将在7月和8月停止。首次申领失业救济金人数连续17周保持在100万人以上，这是一个前所未有的水平。根据人口普查数据，预计下个月将失去收入的美国家庭数量在连续六周下降后，在最近的调查中开始上升。\n斯旺克说：“现在我们担心的是，一些临时性的减薪可能会成为永久性的，或者未来会变成更大规模的裁员。”\n经济学家说，现在就确定减薪是否会持续还为时过早，尽管很难指望工资会上涨，因为经济的大部分领域仍然处于关闭状态，而且消费者太担心冠状病毒，无法恢复正常的行为和支出。\nCoronado表示，一些最大的裁员几乎肯定是短期的，比如将高管薪酬削减至零的公司。但其他减排可能会持续下去。\n她说：“我们已经看到，报告更多永久性裁员的公司比例在上升，因此，如果这一比例在上升，那么你可能会看到其中一些减薪被证明是更持久的。”", "note_en": "Millions of Americans who managed to hold onto their jobs amid the coronavirus pandemic have seen their incomes drop as employers slashed wages and hours to weather what they expected to be a short-term shutdown.\n Now, with the virus raging and the recession deepening, those cuts that were meant to be temporary could turn permanent — or even pave the way for further layoffs. That could portend deep damage to the labor market and the economy because so many workers who have kept their jobs have less money to spend than a few months ago.\n  The numbers haven’t received the same attention as job losses, which are highlighted every week in government data. But at least 4 million U.S. workers have received pay cuts since February even as they continued working the same job, and millions more have seen pay freezes, according to economists from the Federal Reserve and University of Chicago who  put out a study analyzing data from the payroll processing company ADP.\n Other estimates put it higher: Roughly 7 million workers have likely received a dock in pay, according to Mark Zandi, the chief economist at Moody’s Analytics. Combined with those who have been forced to log fewer hours, the number climbs to 20 million people — or 1 in 8 workers — who have seen their paychecks shrink over the past few months even as they continued to work, underscoring how much harm shutdowns have caused beyond layoffs alone.\n “We have an income crisis that is even larger than a jobless crisis,” Claudia Sahm, director of macroeconomic policy at the Washington Center for Equitable Growth,  wrote on Twitter recently.\n  “There’s so much that falls under that,” Sahm, who previously worked at the Federal Reserve, said in an interview, referring to the “income crisis” label. “There’s these massive job losses. There’s hours being cut, overtime being lost. And then on top of that — and this is something we just really haven’t seen at all — is a large fraction of workers taking cuts in their wages.”\n Notably, the cuts are mostly hitting higher-wage workers, who tend to be more shielded from the effects of a downturn. And smaller paychecks, even in the short-term, lead to less spending, extending any recession.\n “The speed of a recovery is really directly aligned to how consumers are behaving,” said Jane Oates, a former Labor Department official who is now president of the nonprofit WorkingNation. “And if people don’t have money, they’re not spending it.”\n The trend also suggests that employees feel they have no better options than to accept less money for the same work. Americans believe they have a less than 50 percent chance of finding a new job within three months if they became unemployed today, according to a  New York Federal Reserve survey — a drop of more than 16 percentage points from a year ago.\n It spells trouble for employers, too, who have historically avoided pay cuts because of the damage they do to employee morale and company productivity. But a drop in wages is twice as likely now as it was during the Great Recession, according to the study of ADP data, likely signaling that employers felt they had no other choice if they wanted to keep their doors open.\n Jamie Vagedes, an accountant for the travel rewards company Maritz Motivation in St. Louis, took a 20 percent pay reduction in April that he thinks could remain in place at least another three to six months. The company, which partners with hotels and rental car companies that have been brutally hit by the pandemic, has already laid off or furloughed roughly a quarter of its staff and has not given a time frame for reinstating incomes for those who remain.\n  Vagedes said he was able to get a delay in paying his mortgage, but all other bills and expenses have remained the same. “Doing everything on 20 percent less — it’s challenging,” he said.\n The longer the shutdowns continue and the economy lags, the more likely temporary cuts are to turn permanent, or to result in further layoffs, economists warn. If companies resorted to reducing pay as a matter of survival, “then the next thing is, I just gotta cut [jobs] — I have no choice,” Zandi said.\n Unlike job losses, which have disproportionately affected low-income workers, the pay cuts are mostly hitting workers in white-collar industries, according to the study of ADP data. Three-fourths of the cuts in pay fall within the top 40 percent of wage earners, researchers said.\n And some of the biggest companies have taken part. Julia Coronado, a former Fed economist who founded the firm Macropolicy Perspectives, tracked U.S.-based companies with market caps greater than $1 billion and found that 42 percent of the 260 firms providing details on earnings calls between April and July were reducing pay.\n Lyft announced three-month pay reductions for all salaried employees ranging from 10 to 30 percent, while retail giants Best Buy and Gap focused income reductions on executives.\n  The move to cut wages reflects that employers initially felt the economic downturn was going to be short-term.\n At the beginning, as shutdowns first took hold, “There is a willingness to take a pay cut because you think it’s going to be a temporary thing,” said Diane Swonk, chief economist at Grant Thornton. “It really underscores how unique this recession is — people saw it as a transitory event.”\n But the latest data now suggests the recession is likely to deepen and last far longer than initially anticipated as coronavirus cases reach record highs and a majority of the country has either paused or reversed reopening plans.\n Growth in consumer service spending is expected to halt in July and August, Goldman Sachs said in an analysis on Friday. New unemployment claims have remained above 1 million, a previously unprecedented level, for 17 straight weeks. And the number of American households expecting to lose income over the next month has begun to rise in recent surveys after six straight weeks of declines, according to Census data.\n “Now what we’re concerned about is that some of those temporary wage cuts could become permanent or turn into larger layoffs down the road,” Swonk said.\n It’s too early in the crisis to know for sure whether the pay cuts are here to stay, economists say, though it’s difficult to expect wages to rise while so much of the economy remains shuttered and while consumers are too concerned about the coronavirus to resume regular behavior and spending.\n Some of the biggest cuts are almost certainly going to be short-term, like companies that slashed executive salaries down to zero, Coronado said. But other reductions could persist.\n “We have seen the share of companies reporting more permanent layoffs rising,” she said, “so if that is on the rise, then you might get some of these pay cuts proving to be more lasting.”", "posttime": "2020-07-20 12:41:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,隐藏,hidden", "title": "美国隐藏的经济危机：大范围减薪", "title_en": "America's hidden economic crisis: Widespread wage cuts", "transed": 1, "url": "https://www.politico.com/news/2020/07/19/wage-cuts-economy-crisis-368508", "via": "", "real_tags": ["美国", "隐藏", "hidden"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012970, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天做一些研究时，我读了詹姆斯·博伊尔(James Boyle)的一篇旧专栏，内容是关于2007年开放获取出版领域最近的实验。看到一个有趣的片段，我执行了ol‘Ctrl-C并将其粘贴到我的笔记中，我惊讶地看到它在我的选择前面：\n请使用通过文章顶部或侧面的共享按钮找到的共享工具。复制文章与他人分享是违反FT.com T&amp；Cs和版权政策的。请发送电子邮件至License@ft.com以购买其他版权。使用礼品服务，订阅者每月最多可以分享10或20篇文章。欲了解更多信息，请访问https://www.ft.com/tour.。\n我见过网站乱码复制文本或将其完全禁用，但我从来没有见过一个网站真正注入无关的文本。\n我很好奇他们是如何实现这一点的，所以我启动了Firefox DevTools，并在网站源代码中搜索了这则通知的一个片段。\n谢天谢地，英国“金融时报”提供了一个源代码地图，这样我就能够找到精简的Legal-copy/main.js实现，并看看发生了什么。从本质上讲，它可以归结为：\n函数handleCopy(E){变量选择=窗口。GetSelection()。ToString()；var wordcount=选择。拆分(/\\s+/)。长度；if(Wordcount&&gt;30){var patchedText=&#34；hello world\\n&34；+Selection；e.。剪贴板数据。SetData(&#39；文本/纯文本&#39；，patchedText)；}e.。BrementDefault()；}文档。身体。AddEventListener(&#39；copy&#39；，handleCopy)；\n它包括一些微妙之处，包括检测浏览器对丰富的ClipboardEvent API的支持，处理遗留的Chrome怪癖，以及在怀疑正在使用屏幕阅读器时试图禁用这一“功能”(出于可访问性的考虑，请参考英国“金融时报”，尽管我有一种感觉，这是对投诉的回应)。\n抄袭30个单词合法吗？注入的文字警告称，“复制文章与他人分享是违反FT.com T&amp；Cs和版权政策的”-复制文章，而不是30字。我不是律师，但合理使用可以保护很多东西，比如在另一篇文章中引用30个单词，或者对我来说，个人笔记。虽然可以想象到一些侵权用途，但这是否就证明了这样一种违反互联网规范的行为是正当的呢？\nW3C剪贴板规范的当前工作草案描述了操作剪贴板的机械用例，如附加元数据、富文本传输以及将数学表示法转换为明文-不会吓跑人们行使他们的权利。对于在网站上应该做什么和不应该做什么，有一套隐含的基本规则。干扰标准的访问模式，如关闭标签和使用右键菜单，违反了互联网的社会契约，并进一步威胁到它作为一种可使用的东西，而不是一种使用你的东西的濒危状态。\n顺便说一句，我读的这篇文章是詹姆斯·博伊尔(James Boyle)写的，他是一位版权改革家，曾是英国“金融时报”的专栏作家，很大程度上是因为他们允许他保留版权，至少有一些版权是根据知识共享协议(Creative Commons)许可的，所以如果我想的话，似乎真的可以复制整篇文章。\n原来很多其他人已经注意到了这种不良行为，并构建了规避浏览器扩展(就像这样)，我很高兴地用它从文章中复制了这段话：\n互联网使抄袭变得便宜。那些认为自己的生计依赖于复制限制的企业-集中在唱片、电影、出版和软件行业-感到沮丧是可以理解的。他们的目标是拥有与在模拟世界中相同的控制内容的能力，但同时保持全球数字网络带来的普及、成本节约和病毒式营销的所有好处。为此，他们积极采取行动，改变世界各地的法律，引入更严厉的惩罚，扩大权利，强制实施技术锁，禁止反向工程，并加大执法力度。与其说是想要吃他们的蛋糕，不如说是想要他们的蛋糕并使你的蛋糕非法。", "note_en": "While doing some research today I was reading  an old column by James Boyle about then-recent experiments in open access publishing in 2007. Seeing an interesting snippet, I did the ol’  Ctrl-C and pasted it into my notes, where I was surprised to see this prepended to my selection:\n Please use the sharing tools found via the share button at the top or side of articles. Copying articles to share with others is a breach of FT.com T&amp;Cs and Copyright Policy. Email licensing@ft.com to buy additional rights. Subscribers may share up to 10 or 20 articles per month using the gift article service. More information can be found at https://www.ft.com/tour.\n I’ve seen websites garble copied text or outright disable it, but I’ve never seen a site actually inject unrelated text before.\n I was curious how they had implemented this, so I fired up firefox devtools and searched for a snippet of the notice in the site sources.\n  Thankfully, the FT provides a sourcemap so I was able to find the de-minified  legal-copy/main.js implementation and see what was going on. Essentially, it boils down to this:\n function  handleCopy ( e )  {  var  selection  =  window . getSelection (). toString ();  var  wordCount  =  selection . split ( / \\s +/ ). length ;  if  ( wordCount  &gt;  30 )  {  var  patchedText  =  &#34; hello world \\n &#34;  +  selection ;  e . clipboardData . setData ( &#39; text/plain &#39; ,  patchedText );  }  e . preventDefault (); } document . body . addEventListener ( &#39; copy &#39; ,  handleCopy );\n It includes some subtleties around detecting browser support for the rich  ClipboardEvent API and handling legacy Chrome quirks, as well as trying to disable the “feature” when it suspects a screen reader is being used (points to the FT for accessibility consideration, though I have a feeling this was a response to a complaint).\n Is copying 30 words legal? The injected text warns “Copying articles to share with others is a breach of FT.com T&amp;Cs and Copyright Policy”—copying  articles, not 30 words. I’m no lawyer, but  fair use protects a great many things one might copy 30 words for, like quotation in another article, or in my case, personal notekeeping. While some infringing uses can be imagined, does this warrant such a violation of internet norms?\n The current working draft of the  W3C Clipboard spec describes mechanical use-cases for manipulating the clipboard like attaching metadata, rich text transfer, and translating mathematical notation to plaintext—not scaring people away from exercising their rights. There’s a set of implicit ground rules for what should and should not be done on websites. Interfering with standard access patterns like closing tabs and using right-click menus violates the social contract of the internet and further threatens its endangered state as a thing to be used, not a thing that uses you.\n Incidentally, the article I was reading was by  James Boyle, a copyright reformist who was a columnist for the Financial Times largely because they allowed him to  retain his copyrights, with at least some under  Creative Commons licenses, so it seems likely I actually  could copy the whole article if I wanted to.\n It turns out lots of other people have noticed this kind of bad behavior and have built circumventing browser extensions like  this one which I just happily used to copy this passage from  the article:\n The internet makes copying cheap. Businesses that see their livelihood as dependent on the restriction of copying – concentrated in the recording, film, publishing and software industries – are understandably upset. Their goal is to have the same ability to control their content as they had in an analog world but to keep all the benefits of pervasiveness, cost saving, and viral marketing that a global digital network brings. To that end, they have moved aggressively to change laws worldwide, to introduce stiffer penalties, expand rights, mandate technological locks, forbid reverse engineering, and increase enforcement. It is not so much a case of wanting to have their cake and eat it, as to have their cake and make your cake illegal.", "posttime": "2020-07-20 12:41:26", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "金融时报,injection", "title": "向英国“金融时报”注入剪贴板", "title_en": "Clipboard Injection on the Financial Times", "transed": 1, "url": "https://andrewyoon.art/blog/ft-clipboard", "via": "", "real_tags": ["金融时报", "injection"]}, {"category": "", "categoryclass": "", "imagename": "bd0ab016b931c12656dc9efb288246e5.jpg", "infoid": 1012969, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "访问https://www.squarespace.com/LTT并使用优惠码LTT9折，感谢热灰熊赞助今天的节目！购买保暖灰熊导管..。", "note_en": "Visit https://www.squarespace.com/LTT and use offer code LTT for 10% off Thanks to Thermal Grizzly for sponsoring today's episode! Buy Thermal Grizzly Conduc...", "posttime": "2020-07-20 12:40:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "英特尔,主板,内存,limits,https", "title": "英特尔限制主流主板的内存速度", "title_en": "Intel limits memory speeds in mainstream motherboads", "transed": 1, "url": "https://www.youtube.com/watch?v=Skry6cKyz50", "via": "", "real_tags": ["英特尔", "主板", "内存", "limits", "https"]}, {"category": "", "categoryclass": "", "imagename": "a269b6e1700d28d111ecbf8577e91f96.jpg", "infoid": 1012968, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Ruby应用服务器Mongrel的原始版本的开发者Zed Shaw的一句咆哮让我想起了DreamHost在过去几年托管Ruby on rails驱动的网站的经历。如果您是Ruby on Rails开发人员、对这类东西感兴趣的书呆子，或者对高度公开的开源项目的幕后内容感兴趣，那么这篇文章本身有些冗长，但却是一本有趣的(尽管是自我放纵的)读物。\n对于Zed Shaw关于Rails开发团队如何运作的评论，我没有任何补充，因为我个人对此没有任何了解。我个人了解的是，启动并运行Rails应用程序并保持其运行是多么困难。DreamHost有10多年在大多数最流行的Web编程框架中运行应用程序的经验，而Rails过去和现在都是最令人沮丧的。\n当我们第一次开始实现对Ruby on rails的支持时，我们想尽我们所能来支持它。这是一个令人兴奋的新Web框架，它为Web应用程序开发注入了活力。Ruby on rails似乎非常符合我们的公司理念，我们认为我们现有的客户群会喜欢它。我们最终实现了相当多的新功能，仅仅是为了支持Ruby on rails，尤其是对FastCGI的支持。事实证明，Rails本身速度太慢，无法在没有某种加速的情况下使用(与我们支持的任何其他web编程环境不同)，而FastCGI到目前为止是最适合共享web主机环境的。不幸的是，Rails和FastCGI并不能真正相处！无论我们做什么，Ruby on rails的用户总是看到常规的内部服务器错误。我最好的猜测是，FastCGI动态进程管理器礼貌地要求Rails进程停止运行，结果他们只是退出，让应用程序束之高阁。当然，这是外行的说法！\n这些问题后来大多被Ruby on rails的一个用户缓解了，他希望它在我们的服务器上能更好地工作，但是来自Rails社区本身的解决方案是相当老实、愚蠢的。他们说停止使用Apache和FastCGI(这两个组合成功地驱动了无数的网站，但不是Ruby on rails网站)，转而使用Lighttpd和SCGI(一种类似FastCGI的协议，可能在技术上更优越，但几乎没有人使用)来完全重新装备我们的服务器。(Lighttpd和SCGI是一种类似FastCGI的协议，可能在技术上更优越，但几乎没有人使用)。这一建议要么表明他们完全不了解虚拟主机的工作原理，要么表明他们完全无视现实世界。推荐用户为他们的商业应用程序使用更高端的专用服务器主机固然不错，但你不能忽视这样一个事实，即几乎每个人都会想要使用低成本的共享主机开始使用。这只是简单的经济学问题。此外，使用Ruby on rails等系统的人希望花时间编程，而不是花时间设置服务器。推荐没有被任何一家主要的虚拟主机公司广泛使用或支持的技术会给你的用户带来太多的负担，你想让他们高兴！值得庆幸的是，我们甚至从来没有尝试过切换我们的系统来支持lighttpd和scgi，因为6个月后，Rails社区的“流行事物”已经转移到了Mongrel。你们已经下定决心了！\nZed Shaw在他的咆哮中提到，即使是由DHH(编写Rails的人！)运行的Ruby on rails应用程序也是如此。出现常规问题，每天需要重新启动几次。Rails社区充满了非常聪明的程序员，他们实现了一个伟大的系统，在不需要管理的时候工作得非常棒。这是我用过的最反复无常的web应用程序系统之一，这来自于一个既经历过命运多舛的Netscape web服务器，也经历过多次PHP迭代的人(PHP本身有很多问题，所以PHP的人们不要太沾沾自喜)。\nRuby on rails具有惊人的潜力，但在它像PHPWebTM这样不那么大肆宣传的…应用程序环境得到广泛使用之前，这里有一些事情是必须解决的。\nRuby on rails需要更快得多。有了合适的加速器，它可以很好地使用，但没有加速器就会很痛苦。Ruby本身就是问题的一大部分，所以不幸的是，这个问题可能归结为只是简化了加速器技术的管理。混合似乎是朝着正确方向迈出的一大步，尽管它不是特定于Rails的。我希望Rails核心开发人员在未来能与Mongrel开发人员更紧密地合作。\nRuby on rails或多或少需要在任何环境中工作。您不能只期望您的用户以任何方式设置他们的服务器。有数以百万计的现有系统不能简单地集成任何你认为本周更好的尖端技术。如果你继续保持这种态度，你肯定是在自食其果。\n您需要更好地维护向后兼容性。诚然，这是PHP历史上做得很差的领域，但没有理由不胜过它们。此外，无可否认，Rails作为一个开发平台还很年轻，而你们在很早的时候就已经获得了很多关注。尽管如此，大肆炒作的同时也带来了重大的责任。你现在需要保持势头。\n官方支持共享主机环境。我从Rails社区得到的感觉是，Rails被当作某种高端应用系统来推动，这使得忽略绝大多数用户Web环境是可以的。您不能忽略共享主机用户。在我看来，PHP人员所做的让他们走到今天的一件事就是拥抱共享主机，努力让他们的软件在共享主机中运行良好。这意味着它必须非常轻量级(在Rails中可能已经太晚了！)，并且它必须以最小的麻烦“插入”到各种各样的操作环境中。像这样的兼容性工作不是迷人的、令人兴奋的或有趣的，但它是必须要做的。\nDreamHost非常希望继续完全支持Ruby on rails。Ruby on rails确实有很好的前景，我认为假以时日，它可能会迎合围绕它的炒作。我只希望社区在那之前不要自以为是！\n这里提出的观点完全是从一个有一定网络经验的局外人的角度出发的。我知道Ruby on rails正在一些流量非常大的网站上使用，当然可以让它工作得很好。我想说的是，它真的需要变得容易得多。您必须小心，不要将用户热情与易用性混为一谈。热情的用户将填补可用性方面的许多空白(DreamHost就是基于这一事实而蓬勃发展的！)，但你不能长期依赖这一点。", "note_en": "A rant by Zed Shaw, the man who wrote the original version of the Ruby application server  Mongrel got me thinking about the experiences  DreamHost has had hosting Ruby on Rails driven websites over the past couple of years. The rant itself was somewhat lengthy but an interesting (albeit self-indulgent) read if you’re either a Ruby on Rails developer, a nerd who’s just into stuff like that, or interested in the behind-the-scenes of a highly public open-source project.\n I don’t have anything to add to Zed Shaw’s comments about how the Rails development team operates as I don’t have any personal knowledge of that. What I do have personal knowledge of is how difficult it can be to get a Rails application up and running and to keep it running. DreamHost has over 10 years of experience running applications in most of the most popular web programming frameworks and Rails has and continues to be one of the most frustrating.\n  When we first started implementing our support for Ruby on Rails, we wanted to do whatever we could to support it. It was an exciting and new web framework that was invigorating web application development. Ruby on Rails seemed to really fit in with our company philosophy and we thought our existing customer base would love it. We ended up implementing quite a lot of new features just to support Ruby on Rails, not least of all FastCGI support. Rails itself turned out to be far too slow to use without some sort of acceleration (unlike any other web programming environment we support), and FastCGI is by far the best suited to a shared web hosting environment. Unfortunately, Rails and FastCGI just don’t really get along! No matter what we did users of Ruby on Rails kept seeing regular internal server errors. The best guess I have is the FastCGI dynamic process manager was politely asking the Rails process to die and instead they were just exiting and leaving the application high and dry. That’s in layman’s terms, of course!\n These issues were later mostly mitigated by a single user of Ruby on Rails who wanted it to work better on our servers, but the solution from the Rails community itself was quite honestly, stupid. They said to stop using Apache and FastCGI (a combination that successfully powers bazillions of websites, just not Ruby on Rails ones) and instead to entirely retool our servers with Lighttpd and SCGI (a FastCGI like protocol that may be technically superior, but next to nobody uses). That suggestion shows either a complete lack of understanding of how web hosting works or an utter disregard for the real world. It’s all good and fine to recommend that users use higher-end dedicated server hosting for their commercial applications but you simply cannot ignore the fact that  nearly everyone will want to use lower-cost shared hosting for getting started. It’s just simple economics. Additionally, people who use systems like Ruby on Rails want to spend time programming and not time  setting up servers. Recommending technologies that are not widely used or supported by any major web hosting company is putting too much of a burden on your users, the people you  want to keep happy! It’s a good thing we never even tried to switch our system to support Lighttpd and SCGI, too, because 6 months later the ‘in thing’ in the Rails community had shifted to  Mongrel, instead. Make up your minds already!\n   Zed Shaw mentions in his rant that even the Ruby on Rails application run by DHH (the guy who wrote Rails!) has regular issues and needs restarts several times a day. The Rails community is full of very smart programmers and they have implemented a great system that works awesome when it’s not needing looking after. It’s one of the most fickle web application systems I’ve ever had experience with, and this is coming from someone who has experienced both the ill-fated Netscape web server as well as many iterations of PHP (PHP has many issues of its own, so don’t get too smug, PHP people).\n Ruby on Rails has amazing potential, but here are some things that simply must be fixed before it will ever be as widely used as much less hyped web application environments like PHP…\n Ruby on Rails needs to be a helluva lot faster. With a proper accelerator, it’s nicely usable but without one it’s painful. Ruby itself is a big part of the problem so this one may come down to just simplifying the management of the accelerator technologies, unfortunately. Mongrel seems like a big step in the right direction, even though it’s not Rails-specific. I hope the Rails core developers will be cooperating a lot more closely with Mongrel developers in the future.\n Ruby on Rails needs to more or less work in ANY environment. You can’t just expect your users to set up their servers any which way. There are millions of established systems that cannot simply integrate any bleeding-edge technology you think is better this week. If you continue to keep this attitude you are surely shooting yourselves in both feet.\n You need to maintain backward compatibility better. Admittedly this is the area where PHP has historically done very poorly, but that’s no reason to not one-up them. Also, Rails is admittedly very young as a development platform and you guys have gotten a LOT of attention very early on. Still, with big hype comes big responsibility. You need to keep the momentum going now.\n Officially support shared hosting environments. The feeling I get from the Rails community is that Rails is being pushed as some sort of high-end application system and that makes it ok to ignore the  vast majority of user web environments. You simply cannot ignore the shared hosting users. In my opinion, the one thing the PHP people did that got them to where they are today is to embrace shared hosting and work hard to make their software work well within it. That means it has to be very lightweight (it may be too late for that in Rails already!), and it has to “plug in” to a wide variety of operating environments with minimal fuss and hassle. Compatibility work like that is not glamorous, exciting, or fun, but it’s gotta be done.\n  DreamHost very much intends to continue fully supporting Ruby on Rails. Ruby on Rails does have great promise, and I think in time it may be able to meet the hype it’s got surrounding it. I just hope the community doesn’t get a big head before that happens!\n The opinions presented here are entirely from the perspective of an outsider with some web experience. I know Ruby on Rails is in use on some very high traffic websites and it is certainly  possible to make it work well. What I’m saying is that it really needs to be a whole lot  easier. You have to be careful not to confuse  user enthusiasm with  easy to use. Enthusiastic users will fill in many many gaps in usability (DreamHost thrives on that fact!), but you cannot rely on that over the long-term.", "posttime": "2020-07-20 12:19:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ruby,rails", "title": "Ruby on Rails如何变得更好(2008)", "title_en": "How Ruby on Rails Could Be Much Better (2008)", "transed": 1, "url": "https://www.dreamhost.com/blog/how-ruby-on-rails-could-be-much-better/", "via": "", "real_tags": ["ruby", "rails"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012967, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我和一家初创公司进行了短暂的运营(确切地说是一个月)，面临着加入YC团队的决定。在那次惨败中，我还花了至少12个小时试图说服其他人离开。这已经有半年了，我有更多的时间思考人们为什么想要创办一家初创公司的原因。正如你可能已经猜到的那样，我决定不做这件事，而且我真心认为，对于我遇到的大多数想要成为创始人的人来说，经营一家初创公司似乎不是一个好主意。\n这个帖子肯定不会适用于每个人，但我希望这里能有一些有价值的想法。另外，请注意，这是相当面向技术创建者的。\n我不是在说对贵公司的承诺。我说的是对你的联合创始人的承诺(如果你有的话，很有可能)。\n也许我太年轻还不能理解，但是婚姻看起来很可怕！我的财务状况、社交生活、个人时间和情感健康在很大程度上取决于一个人，这很可怕。这应该是可怕的，或者至少需要几年的时间才不会变得可怕。\n你的联合创始人...差不多吗？在种子期，你们很可能真的住在一起，如果你们不住在一起，你们很可能在功能上生活在一起，而且涉及的工作量也很大。他们对你的财务状况负责。他们可能对你的社交生活质量负责(大多数创始人花了很多时间与其他技术人员+创始人进行社交)。它们与你的人生目标、梦想和激情息息相关。\n我的印象是，我和我的联合创始人的关系会比婚姻更亲密，一旦失败，关系就会格外糟糕，因为还有额外的损失(从统计学上讲，这是很有可能的，但我想婚姻也是如此)。我完全相信，有些联合创始人组合已经完全准备好开始创业之旅，有些联合创始人组合可能还没有准备好，但无论如何都很好，但我坚持这样的说法，那就是，这比婚姻更紧张，没有足够多的人关心这件事。\n我经常听到类似这样的情绪：哇，这些风投公司都在拿我冒险，我最好还是承诺这一点！&34；\n风投并不是试图占你便宜的坏人(实际上他们可能是，但让我们假设他们不是)，但他们不是处于风险中的人。对他们来说，15万或几百万并不是一个巨大的风险。种子期的回报将来自一小部分投资，因此，只要风投能拿到几个重要的东西，他们就能承受高得可笑的错误率。如果你重新回到软银，你可以做得更糟，还能有这么多钱！他们谨慎地做决定，出于各种原因关心你的成功，但在更大的抽象意义上，你的创业对他们来说毫无意义。\n他们也不会回避这一点，他们重新投资你的全部原因是因为他们认为你比你的成本更有价值。\n你的风险是你生命中的岁月，血汗和泪水。接下来的几年(假设你的初创企业一直持续到那时)将为这些风投公司提供服务，然后再服务于一些风投公司。风险投资家是你的老板，你要听从那些给你投资的人(尽管远不如普通老板)，也要听从那些你希望在未来筹集资金的人的话。\n带着更大的信心去冒险是件好事，因为有资格的人会认为你很有前途。然而，这可能会变成我将在这家初创公司工作，部分原因是服务于那些信任我并给了我很多钱的人。这些额外的压力来自于满足风险投资的期望，以及关系动态的复杂性，可能会导致各种问题。\n这个问题对我影响最大，但我可以看出它与其他很多人无关。\n许多创始人都有很大的自尊心--我并不是说他们是混蛋，也不是说他们过于自负，但他们确实有非常强大的自信，因为这是作为创始人应该具备的一项宝贵技能。不仅对向他人推销他们的项目有信心，而且对他们的远见和他们的公司也有信心。他们需要相信自己的公司会成功(尽管我遇到过一些创始人，他们只是想用风投资金狂欢几年，咳，咳，诺依曼)。\n我的第一个恐惧是我很快就为自己创造了一个自我。练习向客户推销和参加YC面试需要对自己重复为什么你很好，自我催眠是相当有力的。我喜欢自我感觉良好，但我突然发现自己比我认为的更自信。更可怕的是，我的性格和精力在几周内发生了重大变化。像那样失去这么多身份令人不安，更不用说可能在我的社交生活中产生的连锁反应了。\n另一种恐惧是由此而来的。初创公司的创始人(尤其是那些比较古怪的人)有时相信，他们会创造出能够改变世界的东西。随之而来的是，他们的身份开始与他们的公司合并。这没有什么错，但我也认为从这一点下来是非常悲惨的。这不仅仅是应对失败，重新站起来，它还失去了你身份的一部分。\n作为一名优秀的初创公司创始人，作为一名优秀的工程师似乎被低估了。不仅能够快速编写代码，而且能够做出良好的工程决策、进行良好的技术面试并吸引人才。有些工程技能是用不了的，我很聪明，学得很快，需要更长的时间和练习。如此一来，我还认为未来的创始人也高估了工程学方面可以学到的东西，主要是因为当你急于发布功能时，学习起来要比花时间在课程项目上更难。创始人的确会学到比在校期间更多的东西，但技术发展可能不会那么强劲。我的模型是，最好的就学经历是更好的技术教育，也是最好的创业经历。\n人们想要成为创始人的常见原因以及如何在其他地方获得这些功能。\n许多巨大的、突破性的产品都是由一家大公司内部主导的。示例包括电子邮件客户端hey.com、Chromebook和无数令人惊叹的开发工具。\n在一家大公司开始做这些事情会带来安全、资源和招聘方面的好处，这些都已经为你做好了。缺点包括美女统治，不能自己招聘，以及处理公关政策。在一家公司内部创业也有很高的门槛，比如级别足够高，能够做到这一点，以及在正确的时间出现在正确的公司。\n另一种选择是兼职开始一个项目。Ziglang最初只是一个辅助项目，现在是一种非常有前途的编程语言。从那时起，创建者就辞去了他的工作去做Zig，但也有可能在不离开工作的情况下拥有一些有意义的东西。例子包括朱莉娅·埃文(Julia Evan)的博客(实际上不是工作方面的项目)和杂志系列，卡西迪·威廉(Cassidy William)的Keycap系列，尼克·弗罗斯特(Nick Frosst)(我目前工作的公司的人！)。成功的、令人敬畏的乐队，还有更多。我知道这不是谷歌的水平，哦，是吗？这是我建立的，但我认为创造和拥有一些不是初创公司的东西的预期价值要高得多。\n很多人声称初创公司的资金较少，但我发现，对于相当多的创始人来说，这不是真的--不是因为他们肯定会有一个很好的退出机会，而是因为他们的技能让他们能够像在大公司那样筹集足够的资金来支付自己的工资。如果这适用于你，那么去创业公司可能是你致富的最好机会！对于其他人来说，行业的期望值(特别是加入一家基础雄厚的早期初创公司)通常会更高。\n对于普通的CS学生来说，这似乎是一个合理的理由。学校是这样一个地方，在那里，你要向那些不了解工业、不会做没人会在意的家庭作业的教授负责。然而，似乎所有这些问题都可以通过为自己建立更好的学校体验来显著地解决，如果不能完全解决的话。\n更好的课程可以改善很多事情，比如奥林工程学院(Olin College Of Engineering)有一个基于项目的课程，Make School是一个两年制的应用工程学位课程或开发学位，在那里你可以在Shopify工作，在整个学位过程中学习更多由Shopify教授的应用课程。这些项目规模小，有选择性，但可能不会比半成功的初创企业难。Dev学位的财务状况也更稳健，Shopify为你支付学费和工资，Make School整个学位的学费是7万英镑。\n另一种选择是在学校表现得更差，边学边学，和/或把你愚蠢的学校作业变成有成效的技能和有用的产出。椰子编程语言是在他们上学的时候由某人创建的。有些东西，如动态编程，通常被认为是无用的理论东西，但可以在行业中应用。人们还接受了像这个编译器这样的平凡的学校项目，几乎每所学校都会让你在编译器课程中构建这些项目，最终得到面向一般工程师的教育成果(也请参阅HackerNews线程)。在五周的时间里，我的朋友马斯在攻读Dev学位的同时推出了五款相对成功的产品。\n学校已经是一个勤奋、娱乐和学习的强大环境。我认为这是一个比创业世界更有凝聚力的环境(我也声称创业世界更好)。在学校里开发有用的软件和学习有用的技能是完全可能的。还有一堆其他原因，为什么不辍学，为什么上学很有趣，尽管那些比我更有资格的人已经提出了这些理由。\n我在前面的几节中略微谈到了这一点，但未来的创始人(以及人们和一般人)往往不喜欢行业工作，因为他们并不总是能选择最有趣的事情去做，而且一开始选择也很有限。\n找到一份完美的工作，让你做任何你想做的事情是相当困难的，但我也认为，最免费的行业工作比经营一家初创公司要自由得多，除非你觉得对股东负责、处理招聘、管理和文书工作都是你感兴趣的事情。我找不到很多像这样工作的人的账户，但我个人认识几个，所以我会描述一下。\nShopify有一个团队，致力于由团队创建和选择的较短项目，而不是高管发送的需求。\n我在Shopify的团队(我们致力于TruffleRuby)本质上是实验性的，因此有很多自由去尝试最有趣的东西。此外，Shopify给了我很大的工作空间，可以发表博客文章，参加会议。\n自由职业工程师可以挑选他们的项目，然后自己去做。\n我真的对这一部分进行了辩论，因为我还没有遇到过像这样的创始人，哦，我这么做是为了让我出名，并因我的才华而得到认可。然而，我认为这是一种强烈的愿望，在许多创始人身上正当地健康地体现出来。我不认为我需要举出个人贡献者的例子，但我也明白，他们的数量比多产的创始人要少。我个人的建议是，也许可以淡化外部认可的价值，尽管我意识到人们只是有不同的优先事项。老实说，我认为这一点很难完全复制(尽管你肯定可以非常接近)。\n我认为当人们想要成为创始人时，这是最让我困惑的一个。像“我想做得更好，而不仅仅是做另一个工程师”这样的话看起来并不是真正的雄心壮志。", "note_en": "I had a brief run with a startup (literally a month) and was faced with the decision of going into a YC Cohort. In that fiasco, I also spent at least twelve hours trying to convince other people to go. It&#39;s been half a year, and I&#39;ve had a lot more time to reflect on reasons as to why one might want to run a startup. As you might&#39;ve guessed, I decided not to do it and I genuinely believe that running a startup seems like a bad idea for the majority of people I meet who want to become founders.\n This post definitely will not apply to everyone, but I&#39;d hope there&#39;s some valuable thinking in here. Also, note that this is fairly oriented towards technical founders.\n   I&#39;m not talking about commitment to your company. I&#39;m talking about commitment to your cofounder (if you have one, which is likely).\n Maybe I&#39;m too young to understand, but marriage seems frightening! My finances, my social life, personal time, and emotional wellbeing would be largely dependent on a single person and that&#39;s scary. It should be scary or should at least take a few years for it not to become scary.\n Your cofounder is...kind of the same? In a seed-stage it&#39;s likely you  actually live together, and if you don&#39;t, you&#39;re likely functionally living together with the amount of work involved. They&#39;re responsible for your financial well-being. They may be responsible for the quality of your social lives (most founders spend a lot of time socializing with other tech people + founders). They&#39;re tied to your life goals, your dreams, and your passions.\n My impression was that my relationship with my cofounder would be more intense than marriage, and  extra bad in the event of failure since there&#39;s additional loss (and it&#39;s statistically likely, but I guess so is marriage). I totally believe that there are cofounder pairs that are completely ready to go through the founder journey and pairs that maybe weren&#39;t ready but were fine anyway, but I stand by the statement that it&#39;s more intense than marriage and not enough people put care into this.\n  I often hear sentiments that resemble &#34;wow these VCs are taking a chance on me I better commit to this!&#34;.\n VCs are not evil people trying to take advantage of you (actually they might be, but let&#39;s assume they&#39;re not), but they are not the ones at risk. For them, 150k or a few million is not a huge risk. Seed-stage returns will be from a very small percentage of investments, thus VCs can afford to have comically high error rates as long as they get the few that matter. If you&#39;re SoftBank you can do even worse and still have so much money! They make decisions carefully and they care about your success for various reasons, but in larger abstractions, your startup means nothing to them.\n They&#39;re not shy about it either, the entire reason they&#39;re investing in you is because they think you&#39;re more valuable than you cost.\n Your risk is years of your life, blood, sweat, and tears. The next few years (provided your startup lasts till then) will be in service to these VCs and then some. The VCs are your &#34;bosses&#34;, you answer to the ones who invested in you (though much less than a regular &#34;boss&#34;) and to the ones you hope to raise capital from in the future.\n It&#39;s good to take a risk with increased confidence because qualified people think you have promise. However, that can morph into &#34;I&#39;m going to work on this startup partially in service to these people who believed in me and gave me lots of money&#34;. These additional stresses that come from meeting VC expectations and the complications of the dynamics of the relationship can cause various problems.\n  This one is the one that got to me most but I can see it being irrelevant to a lot of other people.\n Many founders have big egos -- I don&#39;t mean they&#39;re assholes or overly self-important but they do have very powerful confidence, because that&#39;s a valuable skill to have as a founder. Not just confidence in pitching their project to others, but in their vision and their company. They need to believe their company will be successful (though I have met founders who just want to party with VC money for a few years  cough cough Neumann).\n My first fear was that I created an ego for myself rapidly. Practicing to sell to clients and for your YC interview involves repeating to yourself why you are  good and self-hypnosis is fairly powerful. I love feeling good about myself, but I suddenly found myself feeling more confident in myself than what I believed was warranted. More frighteningly, I had a major character and energy change in a couple of weeks. Losing so much of my identity like that was unnerving, not to mention the ripple effects that could&#39;ve occurred in my social life.\n The other fear is coming down from that. Startup founders (especially the more eccentric ones) sometimes believe that they will build something that will change the world. Along with that, their identities start to merge with their company. There&#39;s nothing wrong with that, but I also think it&#39;s exceptionally tragic to come down from that. It&#39;s not just dealing with failure and getting back up on your feet, it&#39;s losing a part of your identity.\n  Being a good engineer seems underrated for being a good startup founder. Not just being able to code fast, but being able to make good engineering decisions, conduct good technical interviews and attract talent. Some engineering skills can&#39;t be worked around with &#34;I am very smart and can learn fast&#34; and require extended time and practice. With that, I also think prospective founders also overestimate the amount of learning on the job that can be done on the engineering side, mostly because it&#39;s harder to learn when you&#39;re in a rush to release features than if you could take your time on a course project. It&#39;s true that founders will learn more than they will in school, but the technical development may not be as strong. My model is that the best schooling experience is better technical education and the best founding experience.\n Common reasons why people want to be founders and how to get those features elsewhere\n  Lots of huge, ground-breaking products have been lead from within a large company. Examples include email client  hey.com, Chromebooks, and countless amazing dev tools.\n Starting these things in a large company has the benefit of security, resources and recruiting already done for you. Downsides include beaurocracy, not being able to recruit on your own accord and dealing with PR policy. There is also high barriers to starting something within a company, like being senior enough to do so and being at the right company at the right time.\n The alternative is starting a project on the side.  Ziglang was started as a side project and is now a very promising programming language. The creator has since then left his job to work on Zig, but it is also possible to &#34;own&#34; something significant without even having to leave your job. Examples includes Julia Evan&#39;s  blog (not actually a work-side-project) and line of zines, Cassidy William&#39;s  keycap line, Nick Frosst&#39;s (someone at the company I currently work at!) successful and awesome  band and many more. I understand that it&#39;s not the extent of &#34;oh yeah Google? I built that&#34;, but I think the expected value is much higher in creating and owning something that isn&#39;t a startup.\n  A lot of people claim that startups are less money, but I find for signicant number of founders, that&#39;s not true -- not because they&#39;ll definitely have a good exit, but because they&#39;re skilled in ways that allow them to raise enough money to pay themselves like they would at a big company. If that applies to you, then going to a startup probably is your best shot at getting rich! For other people, the expected value of industry (particularly joining a well-founded early-stage startup) is usually higher.\n  This seems like a valid reasons for the average CS student. School is a place where you answer to professors who don&#39;t always understand industry and do homework assignments that no one will care about. However, it seems like all of these problems can be significantly if not fully solved by building a better school experience for yourself.\n A better program can improve many things, such as  Olin College of Engineering that has a project-based curriculum,  Make School that is a two year applied-engineering degree program or  Dev Degree, where you can work at Shopify and take more applied courses taught by Shopify throughout your degree. These programs are small and selective, but probably not harder than a semi-successful startup. Dev Degree also happens to be more financially sound, with Shopify paying for your tuition and a salary, and Make School tuition is 70k for the entire degree.\n Another alternative is to just be worse at school and learn on the side and/or to morph your silly school assignments into productive skills and useful outputs. The  Coconut Programming Language was built by someone while they were in school. Some things like dynamic programming that are often deemed useless theoretical things can have  industry applications. People have also taken mundane school projects like this compiler that almost every school will have you build in a compilers course and end up with  educational findings for engineers in general (also see  HackerNews thread). In five weeks, my friend Maas was able to launch  five relatively successful products while enrolled in Dev Degree.\n School is already a powerful environment of hardwork, fun and learning. I think it is a more cohesive enviromnment than the startup world (which I also claim is better). It is fully possible to build useful software and learn &#34;useful&#34; skills while at school. There are also a bunch of other reasons why not to drop out of school and why school is fun, though those have been argued by those more qualified than me.\n  I covered this a bit in previous sections, but prospective founders (and people and general) tend not to like industry jobs because they don&#39;t always get the pick the most interesting things to do and have a limited selection to begin with.\n Finding a perfect job that lets you do everything you want is pretty hard, but I also think that the free-est industry job is  much more free than running a startup, unless answering to shareholders, dealing with recruiting, management and paperwork are things you find interesting. I couldn&#39;t find many accounts of people with jobs like this, but I know a few personally so I&#39;ll describe.\n Shopify has a team that is dedicated to shorter projects that are created and selected by the team and not demands that are sent from executives.\n My own team at Shopify (we worked on  TruffleRuby) was experimental by nature and thus there was a lot of free reign to try things that are the most interesting. Furthermore, Shopify gave me a lot of room to work on + publish blog posts and go to conferences.\n Freelance engineers who get to pick their projects and then do them on their own accord\n  I really debated this section since I haven&#39;t met a founder who was like &#34;oh I&#39;m doing this so I can be famous and recognized for my talents&#34;. However, I think it&#39;s a strong desire that rightfully manifests healthily in a lot of founders. I don&#39;t think I need to give examples for profilic individual contributors, but I also understand that there are  less of them than prolific founders. My personal advice is to maybe downplay the value of external recognition, though I realize that people just have different priorities. I honestly think this one is hard to replicate fully (though you can certainly get very close).\n  I think this is the one that confuses me the most when people want to become founders. Phrases like &#34;I want to do better than just being another engineer&#34; don&#39;t really seem to be about ambition.\n To be ambitious often means things like wanting to do a Ph.D, become a medical doctor or an astronaut. On that scale, it&#39;s not  really about being better at something you&#39;re doing (though it partially is), but joining a new game where it&#39;s supposedly harder. I believe that running a successful startup is indeed harder than being a good engineer and is more ambitious on that axis. However, I think the games are close enough that ambition can easily be set without changing the game. Setting goals like working at a certain company, promotions (up to positions like CTO) and building a specific type of thing aren&#39;t less ambitious than building a successful startup.\n Enjoying risk, Passion about a very specific product/service that can only be done at a startup\n For people who feel the above reasons strongly, I think startups are a good idea. I do however, rarely see them though, especially noting that (adventure and variety) != risk.", "posttime": "2020-07-20 12:17:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不想,don", "title": "我不想成为创始人，我想你也不想", "title_en": "I Don't Want to Be a Founder and I Don't Think You Do Either", "transed": 1, "url": "https://carolchen.me/blog/founding-bad/", "via": "", "real_tags": ["不想", "don"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012966, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "显示手机通知显示所有笔记隐藏所有笔记您似乎正在屏幕宽度较窄的设备上(即您可能正在使用移动电话)。由于这个地点的数学性质，它是景观模式下的最佳景观。如果您的设备未处于横向模式，许多公式将从您的设备一侧运行(应该可以滚动查看)，并且由于屏幕宽度太窄，一些菜单项将被切断。\n这是我在拉马尔大学教的微分方程课程的笔记。尽管这些是我的“课堂笔记”，但任何想要学习如何解微分方程或需要复习微分方程的人都应该可以接触到它们。我试着让这些笔记尽可能地独立，所以阅读它们所需的所有信息要么来自微积分或代数类，要么包含在笔记的其他部分。这里有几个警告给我的学生，他们可能会在这里得到你们错过的那一天发生的事情的副本。因为我想为任何想学习微分方程的人提供一套相当完整的笔记，所以我包含了一些我通常没有时间在课堂上讲到的材料，而且因为这些内容随学期的不同而不同，所以这里不做说明。你需要找一个你的同班同学，看看这些笔记中是否有课堂上没有讲到的地方。\n一般来说，我试着在课堂上做一些与我的笔记不同的问题。然而，有了微分方程，很多问题都很难在一时的冲动下补上，所以在这节课上，我的课堂作业将非常紧密地遵循这些笔记，就算做出来的问题也是如此。话虽如此，当我可以提供更多的例子而不仅仅是我的笔记中的那些例子时，我有时会把工作中的问题抛在脑后。此外，我经常没有时间在课堂上解决笔记中的所有问题，所以你会发现有些部分包含由于时间限制而没有在课堂上解决的问题。\n有时，课堂上的问题会导致我们走上这里没有涉及到的道路。我试着在写这些的时候尽可能多地预料到问题，但现实是我不能预料到所有的问题。有时候，在课堂上会问到一个非常好的问题，这些问题会带来我在这里没有包括的见解。你应该经常与你错过的那一天在课堂上的人交谈，将这些笔记与他们的笔记进行比较，看看有什么不同。\n这与前三项有些关系，但重要到值得单独一项。这些笔记不能代替上课！用这些笔记代替上课容易给你带来麻烦。如前所述，并不是这些笔记中的所有内容都在课堂上涵盖，而且通常这些笔记中没有的材料或见解都会在课堂上涵盖。\n下面是这套笔记中材料的列表(和简要描述)。\n基本概念-在本章中，我们将介绍在典型微分方程课程中遇到的许多基本概念和定义。我们还将看一下方向场，以及如何使用它们来确定微分方程解的某些行为。定义-本节介绍微分方程课程中的一些常见定义和概念，包括阶次、线性与非线性、初始条件、初值问题和有效区间。方向场-在本节中，我们将讨论方向场以及如何绘制它们。我们还研究了如何使用方向场来确定关于微分方程解的一些信息，而实际上没有解。最后的想法-在这一部分中，我们就本课程将看到的内容给出几个最终的想法。\n一阶微分方程-在本章中，我们将介绍几种一阶微分方程的标准解法，包括线性微分方程、可分微分方程、精确微分方程和伯努利微分方程。我们还考察了有效性区间、均衡解和欧拉方法。此外，我们还用一阶微分方程模拟了一些物理情况。线性方程-在本节中，我们解线性一阶微分方程，即形式为\\(y&#39；+p(T)y=g(T)\\)的微分方程。我们对求解这类微分方程的过程进行了深入的概述，并推导了求解过程中使用的积分因子所需的公式。可分方程-在本节中，我们求解可分的一阶微分方程，即形式为\\(N(Y)y&#39；=M(X)\\)的微分方程。我们将给出这类微分方程的求解过程的推导。我们还将开始寻找\n二阶微分方程-在本章中，我们将开始研究二阶微分方程。我们将主要集中在常系数二阶微分方程上。我们将推导齐次微分方程的解，并使用待定系数法和参数变分法来求解非齐次微分方程。此外，我们还将讨论降阶、解集的基本原理、Wronskian振动和机械振动。基本概念-本节深入讨论求解齐次、线性、二阶微分方程\\(ay&39；&39；+by&#39；+cy=0\\)的过程。我们推导了特征多项式，并讨论了如何利用叠加原理得到通解。实根-在本节中，我们讨论齐次线性二阶微分方程\\(ay；&39；+by；+cy=0\\)的解，其中特征多项式的根(ar^{2}+br+c=0\\)是实不同根。复根-在本节中，我们讨论齐次、线性、二阶微分方程\\(ay；&39；+by；+cy=0\\)的解，其中特征多项式的根(ar^{2}+br+c=0\\)是实相异根。我们还将从复数根中推导出本例中通常使用的不涉及复数的标准解。重根-在本节中，我们讨论齐次线性二阶微分方程\\(ay；&39；+by；+cy=0\\)的解，其中特征多项式的根\\(ar^{2}+br+c=0\\)是重复的，即双根。在这种情况下，我们将使用降阶来导出获得一般解所需的第二个解。降阶-在本节中，我们将更详细地讨论降阶，这是用于推导齐次线性二阶微分方程重复根情况的解的过程。这将是本章为数不多的讨论非常系数微分方程的内容之一。基本解集-在这一节中，我们将看看二阶微分方程解背后的一些理论。我们定义了基本解集，并讨论了如何利用它们得到齐次二阶微分方程的通解。我们还将定义Wronskian，并说明如何使用它来确定一对解是否为基本解集。关于Wronskian的更多信息-在这一节中，我们将研究如何使用上一节中介绍的Wronskian来确定两个函数是线性独立的还是线性相关的。我们还将给出另一种寻找Wronskian的方法。非齐次微分方程-在本节中，我们将讨论求解非齐次微分方程的基础知识。定义了互补特解的概念，给出了一类非齐次微分方程的通解形式。待定系数-在本节中，我们介绍用待定系数法求解非齐次微分方程的特解。我们使用了各种各样的例子来说明对该方法所需的特定解的形式进行初始猜测的许多指导原则。参数的变分-在这一部分中，我们介绍参数变分的方法，以求非齐次微分方程的特解。我们对该方法进行了详细的分析，并推导出了一个可以用来求特解的公式。机械振动-在本节中，我们将检查机械振动。特别地，我们将对连接到弹簧并上下移动的对象进行建模。我们还允许在系统中引入阻尼器，并允许一般外力作用于对象。还要注意的是，虽然我们在本节中举了机械振动的例子，但简单的符号改变(以及量所代表的相应改变)就可以将其移动到几乎任何其他工程领域。\n拉普拉斯变换-在本章中，我们介绍拉普拉斯变换及其如何用于解决初值问题。随着拉普拉斯变换的引入，我们现在可以解决一些其他情况下无法解决的初值问题。我们将求解涉及Heaviside函数和Dirac Delta函数的微分方程。我们还将简要介绍拉普拉斯变换在求解非常系数微分方程中的应用。此外，我们还将定义卷积积分，并说明如何使用它进行逆变换。定义-在本节中，我们给出拉普拉斯变换的定义。我们还将比较", "note_en": "Show Mobile Notice    Show All Notes  Hide All Notes  You appear to be on a device with a &#34;narrow&#34; screen width ( i.e. you are probably on a mobile phone). Due to the nature of the mathematics on this site it is best views in landscape mode. If your device is not in landscape mode many of the equations will run off the side of your device (should be able to scroll to see them) and some of the menu items will be cut off due to the narrow screen width.\n    \r Here are my notes for my differential equations course that I teach here at Lamar University. Despite the fact that these are my “class notes”, they should be accessible to anyone wanting to learn how to solve differential equations or needing a refresher on differential equations. \r I’ve tried to make these notes as self-contained as possible and so all the information needed to read through them is either from a Calculus or Algebra class or contained in other sections of the notes. \r Here are a couple of warnings to my students who may be here to get a copy of what happened on a day that you missed.   Because I wanted to make this a fairly complete set of notes for anyone wanting to learn differential equations have included some material that I do not usually have time to cover in class and because this changes from semester to semester it is not noted here. You will need to find one of your fellow class mates to see if there is something in these notes that wasn’t covered in class.\n  In general, I try to work problems in class that are different from my notes. However, with Differential Equation many of the problems are difficult to make up on the spur of the moment and so in this class my class work will follow these notes fairly close as far as worked problems go. With that being said I will, on occasion, work problems off the top of my head when I can to provide more examples than just those in my notes. Also, I often don’t have time in class to work all of the problems in the notes and so you will find that some sections contain problems that weren’t worked in class due to time restrictions.\n  Sometimes questions in class will lead down paths that are not covered here. I try to anticipate as many of the questions as possible when writing these up, but the reality is that I can’t anticipate all the questions. Sometimes a very good question gets asked in class that leads to insights that I’ve not included here. You should always talk to someone who was in class on the day you missed and compare these notes to their notes and see what the differences are.\n  This is somewhat related to the previous three items, but is important enough to merit its own item. THESE NOTES ARE NOT A SUBSTITUTE FOR ATTENDING CLASS!! Using these notes as a substitute for class is liable to get you in trouble. As already noted not everything in these notes is covered in class and often material or insights not in these notes is covered in class.\n  Here is a listing (and brief description) of the material that is in this set of notes.\n  Basic Concepts - In this chapter we introduce many of the basic concepts and definitions that are encountered in a typical differential equations course. We will also take a look at direction fields and how they can be used to determine some of the behavior of solutions to differential equations.\r  Definitions  – In this section some of the common definitions and concepts in a differential equations course are introduced including order, linear vs. nonlinear, initial conditions, initial value problem and interval of validity.    Direction Fields  – In this section we discuss direction fields and how to sketch them. We also investigate how direction fields can be used to determine some information about the solution to a differential equation without actually having the solution.    Final Thoughts  – In this section we give a couple of final thoughts on what we will be looking at throughout this course.\n    First Order Differential Equations - In this chapter we will look at several of the standard solution methods for first order differential equations including linear, separable, exact and Bernoulli differential equations. We also take a look at intervals of validity, equilibrium solutions and Euler’s Method. In addition we model some physical situations with first order differential equations.\r  Linear Equations – In this section we solve linear first order differential equations, i.e. differential equations in the form \\(y&#39; + p(t) y = g(t)\\). We give an in depth overview of the process used to solve this type of differential equation as well as a derivation of the formula needed for the integrating factor used in the solution process.   Separable Equations – In this section we solve separable first order differential equations, i.e. differential equations in the form \\(N(y) y&#39; = M(x)\\). We will give a derivation of the solution process to this type of differential equation. We’ll also start looking at finding the interval of validity for the solution to a differential equation.   Exact Equations – In this section we will discuss identifying and solving exact differential equations. We will develop of a test that can be used to identify exact differential equations and give a detailed explanation of the solution process. We will also do a few more interval of validity problems here as well.   Bernoulli Differential Equations – In this section we solve Bernoulli differential equations, i.e. differential equations in the form \\(y&#39; + p(t) y = y^{n}\\). This section will also introduce the idea of using a substitution to help us solve differential equations.   Substitutions – In this section we’ll pick up where the last section left off and take a look at a couple of other substitutions that can be used to solve some differential equations. In particular we will discuss using solutions to solve differential equations of the form \\(y&#39; = F(\\frac{y}{x})\\) and \\(y&#39; = G(ax + by)\\).   Intervals of Validity – In this section we will give an in depth look at intervals of validity as well as an answer to the existence and uniqueness question for first order differential equations.   Modeling with First Order Differential Equations – In this section we will use first order differential equations to model physical situations. In particular we will look at mixing problems (modeling the amount of a substance dissolved in a liquid and liquid both enters and exits), population problems (modeling a population under a variety of situations in which the population can enter or exit) and falling objects (modeling the velocity of a falling object under the influence of both gravity and air resistance).   Equilibrium Solutions – In this section we will define equilibrium solutions (or equilibrium points) for autonomous differential equations, \\(y&#39; = f(y)\\). We discuss classifying equilibrium solutions as asymptotically stable, unstable or semi-stable equilibrium solutions.   Euler’s Method – In this section we’ll take a brief look at a fairly simple method for approximating solutions to differential equations. We derive the formulas used by Euler’s Method and give a brief discussion of the errors in the approximations of the solutions.\n    Second Order Differential Equations - In this chapter we will start looking at second order differential equations. We will concentrate mostly on constant coefficient second order differential equations. We will derive the solutions for homogeneous differential equations and we will use the methods of undetermined coefficients and variation of parameters to solve non homogeneous differential equations. In addition, we will discuss reduction of order, fundamentals of sets of solutions, Wronskian and mechanical vibrations.\r  Basic Concepts – In this section give an in depth discussion on the process used to solve homogeneous, linear, second order differential equations, \\(ay&#39;&#39; + by&#39; + cy = 0\\). We derive the characteristic polynomial and discuss how the Principle of Superposition is used to get the general solution.   Real Roots – In this section we discuss the solution to homogeneous, linear, second order differential equations, \\(ay&#39;&#39; + by&#39; + cy = 0\\), in which the roots of the characteristic polynomial, \\(ar^{2} + br + c = 0\\), are real distinct roots.   Complex Roots – In this section we discuss the solution to homogeneous, linear, second order differential equations, \\(ay&#39;&#39; + by&#39; + cy = 0\\), in which the roots of the characteristic polynomial, \\(ar^{2} + br + c = 0\\), are real distinct roots. We will also derive from the complex roots the standard solution that is typically used in this case that will not involve complex numbers.   Repeated Roots – In this section we discuss the solution to homogeneous, linear, second order differential equations, \\(ay&#39;&#39; + by&#39; + cy = 0\\), in which the roots of the characteristic polynomial, \\(ar^{2} + br + c = 0\\), are repeated,  i.e. double, roots. We will use reduction of order to derive the second solution needed to get a general solution in this case.   Reduction of Order – In this section we will discuss reduction of order, the process used to derive the solution to the repeated roots case for homogeneous linear second order differential equations, in greater detail. This will be one of the few times in this chapter that non-constant coefficient differential equation will be looked at.   Fundamental Sets of Solutions – In this section we will a look at some of the theory behind the solution to second order differential equations. We define fundamental sets of solutions and discuss how they can be used to get a general solution to a homogeneous second order differential equation. We will also define the Wronskian and show how it can be used to determine if a pair of solutions are a fundamental set of solutions.   More on the Wronskian – In this section we will examine how the Wronskian, introduced in the previous section, can be used to determine if two functions are linearly independent or linearly dependent. We will also give and an alternate method for finding the Wronskian.   Nonhomogeneous Differential Equations – In this section we will discuss the basics of solving nonhomogeneous differential equations. We define the complimentary and particular solution and give the form of the general solution to a nonhomogeneous differential equation.   Undetermined Coefficients – In this section we introduce the method of undetermined coefficients to find particular solutions to nonhomogeneous differential equation. We work a wide variety of examples illustrating the many guidelines for making the initial guess of the form of the particular solution that is needed for the method.   Variation of Parameters – In this section we introduce the method of variation of parameters to find particular solutions to nonhomogeneous differential equation. We give a detailed examination of the method as well as derive a formula that can be used to find particular solutions.   Mechanical Vibrations – In this section we will examine mechanical vibrations. In particular we will model an object connected to a spring and moving up and down. We also allow for the introduction of a damper to the system and for general external forces to act on the object. Note as well that while we example mechanical vibrations in this section a simple change of notation (and corresponding change in what the quantities represent) can move this into almost any other engineering field.\n    Laplace Transforms - In this chapter we introduce Laplace Transforms and how they are used to solve Initial Value Problems. With the introduction of Laplace Transforms we will now be able to solve some Initial Value Problems that we wouldn’t be able to solve otherwise. We will solve differential equations that involve Heaviside and Dirac Delta functions. We will also give brief overview on using Laplace transforms to solve nonconstant coefficient differential equations. In addition, we will define the convolution integral and show how it can be used to take inverse transforms.\r  The Definition – In this section we give the definition of the Laplace transform. We will also compute a couple Laplace transforms using the definition.   Laplace Transforms – In this section we introduce the way we usually compute Laplace transforms that avoids needing to use the definition. We discuss the table of Laplace transforms used in this material and work a variety of examples illustrating the use of the table of Laplace transforms.   Inverse Laplace Transforms – In this section we ask the opposite question from the previous section. In other words, given a Laplace transform, what function did we originally have? We again work a variety of examples illustrating how to use the table of Laplace transforms to do this as well as some of the manipulation of the given Laplace transform that is needed in order to use the table.   Step Functions – In this section we introduce the step or Heaviside function. We illustrate how to write a piecewise function in terms of Heaviside functions. We also work a variety of examples showing how to take Laplace transforms and inverse Laplace transforms that involve Heaviside functions. We also derive the formulas for taking the Laplace transform of functions which involve Heaviside functions.   Solving IVPs&#39; with Laplace Transforms - In this section we will examine how to use Laplace transforms to solve IVP’s. The examples in this section are restricted to differential equations that could be solved without using Laplace transform. The advantage of starting out with this type of differential equation is that the work tends to be not as involved and we can always check our answers if we wish to.   Nonconstant Coefficient IVP’s – In this section we will give a brief overview of using Laplace transforms to solve some nonconstant coefficient IVP’s. We do not work a great many examples in this section. We only work a couple to illustrate how the process works with Laplace transforms.   IVP’s with Step Functions – This is the section where the reason for using Laplace transforms really becomes apparent. We will use Laplace transforms to solve IVP’s that contain Heaviside (or step) functions. Without Laplace transforms solving these would involve quite a bit of work. While we do work one of these examples without Laplace transforms, we do it only to show what would be involved if we did try to solve one of the examples without using Laplace transforms.   Dirac Delta Function – In this section we introduce the Dirac Delta function and derive the Laplace transform of the Dirac Delta function. We work a couple of examples of solving differential equations involving Dirac Delta functions and unlike problems with Heaviside functions our only real option for this kind of differential equation is to use Laplace transforms. We also give a nice relationship between Heaviside and Dirac Delta functions.   Convolution Integral – In this section we give a brief introduction to the convolution integral and how it can be used to take inverse Laplace transforms. We also illustrate its use in solving a differential equation in which the forcing function ( i.e. the term without any y’s in it) is not known.   Table of Laplace Transforms – This section is the table of Laplace Transforms that we’ll be using in the material. We give as wide a variety of Laplace transforms as possible including some that aren’t often given in tables of Laplace transforms.\n    Systems of Differential Equations - In this chapter we will look at solving systems of differential equations. We will restrict ourselves to systems of two linear differential equations for the purposes of the discussion but many of the techniques will extend to larger systems of linear differential equations. We also examine sketch phase planes/portraits for systems of two differential equations. In addition, we give brief discussions on using Laplace transforms to solve systems and some modeling that gives rise to systems of differential equations.\r\r  Review : Systems of Equations – In this section we will give a review of the traditional starting point for a linear algebra class. We will use linear algebra techniques to solve a system of equations as well as give a couple of useful facts about the number of solutions that a system of equations can have.   Review : Matrices and Vectors – In this section we will give a brief review of matrices and vectors. We will look at arithmetic involving matrices and vectors, finding the inverse of a matrix, computing the determinant of a matrix, linearly dependent/independent vectors and converting systems of equations into matrix form.   Review : Eigenvalues and Eigenvectors – In this section we will introduce the concept of eigenvalues and eigenvectors of a matrix. We define the characteristic polynomial and show how it can be used to find the eigenvalues for a matrix. Once we have the eigenvalues for a matrix we also show how to find the corresponding eigenvalues for the matrix.   Systems of Differential Equations – In this section we will look at some of the basics of systems of differential equations. We show how to convert a system of differential equations into matrix form. In addition, we show how to convert an \\(n^{ \\text{th}}\\) order differential equation into a system of differential equations.   Solutions to Systems – In this section we will a quick overview on how we solve systems of differential equations that are in matrix form. We also define the Wronskian for systems of differential equations and show how it can be used to determine if we have a general solution to the system of differential equations.   Phase Plane – In this section we will give a brief introduction to the phase plane and phase portraits. We define the equilibrium solution/point for a homogeneous system of differential equations and how phase portraits can be used to determine the stability of the equilibrium solution. We also show the formal method of how phase portraits are constructed.   Real Eigenvalues – In this section we will solve systems of two linear differential equations in which the eigenvalues are distinct real numbers. We will also show how to sketch phase portraits associated with real distinct eigenvalues (saddle points and nodes).   Complex Eigenvalues – In this section we will solve systems of two linear differential equations in which the eigenvalues are complex numbers. This will include illustrating how to get a solution that does not involve complex numbers that we usually are after in these cases. We will also show how to sketch phase portraits associated with complex eigenvalues (centers and spirals).   Repeated Eigenvalues – In this section we will solve systems of two linear differential equations in which the eigenvalues are real repeated (double in this case) numbers. This will include deriving a second linearly independent solution that we will need to form the general solution to the system. We will also show how to sketch phase portraits associated with real repeated eigenvalues (improper nodes).   Nonhomogeneous Systems – In this section we will work quick examples illustrating the use of undetermined coefficients and variation of parameters to solve nonhomogeneous systems of differential equations. The method of undetermined coefficients will work pretty much as it does for nth order differential equations, while variation of parameters will need some extra derivation work to get a formula/process we can use on systems.   Laplace Transforms – In this section we will work a quick example illustrating how Laplace transforms can be used to solve a system of two linear differential equations.   Modeling – In this section we’ll take a quick look at some extensions of some of the modeling we did in previous chapters that lead to systems of differential equations. In particular we will\n......", "posttime": "2020-07-20 11:35:24", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微分方程,differential", "title": "微分方程组", "title_en": "Differential Equations", "transed": 1, "url": "https://tutorial.math.lamar.edu/Classes/DE/DE.aspx", "via": "", "real_tags": ["微分方程"]}, {"category": "", "categoryclass": "", "imagename": "9a23e4a36fa40d68d99992550b160957.jpg", "infoid": 1012965, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "史蒂夫·巴特尔(Steve Bartel)对组建团队并不陌生。他在公司只有20多名员工的时候加入了Dropbox，并在公司超过1000名员工时担任招聘经理。他的麻省理工学院同学尼克·布沙克(Nick Bushak)在Facebook担任经理时也有过类似的经历，随着两人在招聘上花费更多时间，他们开始相信招聘过程中遗漏了一步。\n他们两人见证了LinkedIn的影响，LinkedIn的知识员工集中数据库使公司更容易采取主动，寻找求职者。巴特尔说：“过去，你可以通过任何公司拥有多少工厂、原材料或制成品来衡量它的价值。”“如今，人是一家公司最重要的资产。因此，招聘发生变化也就不足为奇了。\n这一变化带来了流程上的空白-在公司联系求职者后对他们进行跟踪。2017年，这两位老朋友联手成立了Gem(前身为ZenSourcer)，巴特尔担任首席执行官，布沙克担任首席技术官。这家总部位于旧金山的初创公司的招聘软件发展势头迅猛，其客户数量从去年3月首轮上市时的100人增加到今天的300人。周四，该公司宣布了一轮3700万美元的B轮融资，由Greylock Partners牵头，Accel随后参与。AppDynamics前首席执行官大卫·瓦德瓦尼(David Wadhwani)去年成为Greylock的合伙人，加入了董事会。据PitchBook称，创业板拒绝披露其估值，但在前一轮融资后估值为4,700万美元。\nLinkedIn作为招聘人员和招聘经理发现潜在员工的工具在其市场上占据主导地位，而Workday和ADP等人力资源管理软件则有助于在员工被聘用后对他们进行管理。在此期间，招聘人员通常依靠自己的电子表格来记录他们交谈过的人，就像Gem客户Dropbox的全球人才招聘主管迈克·莫里亚蒂(Mike Moriarty)一样。莫里亚蒂回忆说，在他之前的雇主谷歌(Google)，他手动输入每个求职者的姓名、地点和技能集等信息，然后根据他们是被淘汰还是进入工作流程的后期阶段，在工作表上移动这些信息。\n巴特尔和布沙克都拥有麻省理工学院(Massachusetts Institute Of Technology)的计算机科学学位，并拥有工程经理的经验，他们迅速领导了Gem产品的推出。早期的结果足以让布沙克登上福布斯2019年30岁以下企业技术排行榜(巴特尔由于年龄原因没有获得资格)。今天，Gem与LinkedIn集成，可以自动化数据收集和与求职者的后续通信。该软件为招聘团队创建了一个中央数据库，以跟踪公司是否已经联系了某人，如果已经联系了某人，那么这个人已经到达了招聘管道的哪个阶段。分析细分了哪些外展技术有效，哪些团队成员表现最好。\n“我认为，在这个行业里，人们做的最重要的事情就是努力解决所有这些闪亮的镍币问题，而这些工具真正需要解决的一件事就是时间--你怎么才能给招聘团队更多的时间和效率呢？”莫里亚蒂说。\n除了B系列，Gem还宣布了其分析中的一个新组件，该组件考虑了多样性和包容性。这项功能允许招聘人员识别招聘过程中哪里出现了偏见；例如，想象一下这样一个场景：在电话屏幕阶段之后，有不成比例的白人应聘者接受了面试。巴特尔说，这笔新的资金将用于“加倍投入产品创新，并继续扩大平台。”\n产品的快速增长也带动了客户方面的增长，巴特尔表示，Gem已经与300多名付费客户签约使用其软件即服务产品(该软件对员工不超过15人的初创公司是免费的)，其中包括“过去几个月”推出的DoorDash和Coinbase等9家新的独角兽公司。这家初创公司声称，其第一财季-从2月到4月，恰逢大流行引发的经济低迷-从收入角度来看是迄今为止最强劲的，2019年的年度经常性收入增长了4倍。\n对于Wadhwani来说，过去领导AppDynamics并带头将Adobe转变为订阅模式的经历让他确信，Gem的产品迎合了公司运营商的需求。他说：“对于(AppDynamics和Adobe)来说，对我来说，我最重要的一项投资是在正确的时间让正确的人进入公司。”瓦德瓦尼补充说，他记得每个季度在招聘上花费数百万美元，但对资金的使用几乎一无所知。\n他表示：“对于任何增长故事或任何类型的企业来说，在这个时代拥有如此低的能见度，感觉就像是一个巨大的受益机会。”", "note_en": "Steve Bartel is no stranger to building teams. He joined Dropbox when the company had only two dozen employees, and acted as a hiring manager as it flew past 1,000 employees. His MIT classmate Nick Bushak had a similar experience as a manager at Facebook, and as the two spent more time on hiring, they came to believe that a step was missing from the recruiting process.\n  The two of them were witnessing the effect of LinkedIn, whose centralized database of knowledge workers had made it much easier for companies to take the initiative and scout for job candidates. “It used to be that you can measure the worth of any company by how many factories or raw materials or finished goods it has,” Bartel says. “These days people are a company&#39;s most important asset. So, it&#39;s really no surprise that hiring has changed.”\n  That change brought about a gap in the process—the tracking of job candidates after they are contacted by the company. In 2017, the longtime friends teamed up to fill the gap by starting Gem (formerly known as ZenSourcer), with Bartel as CEO and Bushak as chief technology officer. The San Francisco-based startup’s recruiting software has gained momentum rapidly, increasing its customer count to 300 today from 100 at the time of its Series A last March. On Thursday, the company announced a $37 million Series B round led by Greylock Partners, with follow-on participation from Accel. Former AppDynamics CEO David Wadhwani, who became a partner at Greylock last year, joins the board of directors. Gem declined to disclose its valuation, but it was valued at $47 million after its previous funding round, according to PitchBook.\n     LinkedIn dominates its market as a tool for recruiters and hiring managers to discover potential employees, while HR management software like Workday and ADP helps manage employees after they are hired. In between, recruiters often rely on their own spreadsheets to keep track of the people they’ve talked to, as was the case for Mike Moriarty, global head of talent acquisition at Dropbox, which is a Gem customer. At his previous employer Google, Moriarty recalls manually inputting information such as name, location and skill set for each job candidate, then moving them around the sheet depending on if they had been eliminated or progressed to a later stage of the job process.\n  Bartel and Bushak, both of whom hold computer science degrees from the Massachusetts Institute of Technology and have experience as engineering managers, have led the rollout of Gem’s offerings at a rapid pace. The early results were enough to land Bushak on  Forbes’  2019 30 Under 30 list in enterprise technology (Bartel did not qualify due to his age). Today, Gem integrates with LinkedIn and can automate data collection and follow-up correspondence with job candidates. The software creates a centralized database for the recruiting team to keep track of whether someone was already contacted by the company, and if so, which stage of the hiring pipeline the person has reached. Analytics break down which outreach techniques are working and which team members are performing strongest.\n    “I think the biggest thing that people do in this industry is they try to solve for all these shiny nickels, when really the one thing that these tools need to solve for that Gem does really well is time—how can you give the recruiting team more time and efficiency?” Moriarty says.\n  Alongside its Series B, Gem announced a new component to its analytics that accounts for diversity and inclusion. The feature allows recruiters to identify where biases occur across the hiring process; for example, imagine a scenario in which a disproportionate amount of white candidates received an interview after the phone screen stage. The new fundraise, Bartel says, will be used to “double down on product innovation and continue to expand the platform.”\n    The rapid product growth has led to growth on the customer side as well, where Gem has signed on more than 300 paying customers to its software-as-a-service product (the software is free for startups with 15 employees or less), including nine new unicorns such as DoorDash and Coinbase that were brought on “in the last few months,” say Bartel. The startup claims its fiscal first quarter—which ran from February to April, coinciding with the pandemic-induced economic downturn—was its strongest to date from a revenue standpoint and comes after 4x growth in annual recurring revenue in 2019.\n  For Wadhwani, past experiences leading AppDynamics and spearheading Adobe’s shift to a subscription model convinced him that Gem’s product was hitting on a need for company operators. “With both [AppDynamics and Adobe], for me, the single most important investments I made were about getting the right people into the company at the right time,” he says. Wadhwani adds that he remembers spending millions per quarter on recruiting while receiving little visibility on the money’s usage.\n  “For such a critical part of any growth story or any sort of business to run, to have low visibility in this day and age just felt like a massive opportunity to benefit from,” he says.", "posttime": "2020-07-20 11:14:09", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "linkedin,led,招聘", "title": "GEM与LinkedIn整合，帮助自动化数据收集和与求职者的后续通信，由Greylock牵头的B系列融资3700万美元", "title_en": "Gem, which integrates with LinkedIn to help automate data collection and follow-up correspondence with job candidates, raises $37M Series B led by Greylock", "transed": 1, "url": "https://www.forbes.com/sites/kenrickcai/2020/07/16/gem-raises-37-million-in-effort-to-become-the-middleman-between-linkedin-and-workday/", "via": "", "real_tags": ["linkedin", "led", "招聘"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1012964, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "蠕虫世界末日3.8版终于发布了！它已经等了很长时间，我们希望您会喜欢这个社区制作的更新中包含的所有功能、更改和错误修复。为了刺激你的胃口，这里有一些变化亮点：\n通过70多个新的方案选项，以奇特而奇妙的方式定制您的匹配。操纵物理，一次发射不止一种武器，让蠕虫在风景中跳跃，或者从一大堆其他调整中选择，以完善你的计划。这些选项只适用于经验丰富的蠕虫老手，因此您需要完成单人模式并解锁完整的蠕虫才能访问它们。\n对于那些在游戏的老版本中使用RubberWorm模块的人来说，以前通过该模块访问的所有功能现在都隐藏在闪亮的新扩展方案选项星形按钮后面。重温你过去的辉煌-所有你的旧的RubberWorm录制的游戏都可以回放，而不需要额外的软件。\n蠕虫世界末日看起来从来没有这么顺利过！在旧版本中，游戏中的移动和动画将以游戏引擎的更新速率为上限：每秒50帧。不过，在3.8版本中，无论您的硬件支持什么帧速率，都可以体验到丝滑的流畅度-现在，当您的蠕虫和武器在空中庄严地滑行时，移动可以在游戏引擎帧之间进行视觉插值。看一场慢动作录制的比赛，你就再也不想回去了！\n蠕虫世界末日现在可以在窗口里玩了！如果您在“高级设置”中启用此功能，则尴尬的屏幕分辨率更改和游戏截图问题将成为过去。\n除了窗口模式，还专门为拖缆添加了几个额外的选项，以使它们的生活变得更容易。现在可以在游戏窗口失去焦点时继续播放音频，并且新的流模式将防止在托管或加入在线游戏时显示IP地址(有关详细信息，请参阅更新文档)。\nCPU团队现在可以添加到在线游戏中。他们总是独一无二地区别于玩家团队，以防止恶作剧，但现在你终于可以和你的朋友们合作，拿下一大群由电脑控制的无脊椎动物了。或者，如果你只是想在工作时看一场轻松的比赛，现在也可以开始只有CPU团队的比赛，无论是在线还是离线。\n你是否曾经在你的蠕虫世界末日景观上留下了一条美丽的毁灭之路，并希望你能在剩下的土地上玩一场全新的游戏？或者，你是否曾经在游戏进行到一半时被打断，希望你能提取剩余的风景来帮助你安排一场重赛？现在你可以了！只需在游戏聊天中键入/map或随时按Alt+Pause保存地图当前状态的快照，就可以从您停止的地方继续您的横冲直撞！\n为了让每个人，无论他们的硬件是什么，都能有一个很好的蠕虫世界末日体验，已经花费了很多精力。为了改善Windows10用户的体验，已经做了进一步的调整。蠕虫世界末日现在在Linux上的Wine或Proton下运行良好。添加了新的OpenGL渲染器，该渲染器的性能可能会超过其他渲染器，具体取决于您的硬件。窗口模式意味着您的硬件不再需要支持特定的屏幕分辨率。对于那些进入复古计算的人来说，蠕虫世界末日被认为再次运行在过去的系统上……。\n通过志愿者翻译人员的不懈努力，“蠕虫世界末日”现已被完整翻译成七种语言(🇫🇮芬兰语、🇫🇷法语、🇩🇪德语、🇵🇹🇧🇷葡萄牙语、🇷🇺俄语、🇪🇸西班牙语和🇸🇪瑞典语)，还有四种语言的部分翻译正在进行中。更新文档(自述文件)现在有芬兰语、法语和西班牙语的翻译！\n我们感谢蠕虫世界末日社区的所有辛勤工作的成员，他们帮助使这一更新成为现实。有关最新消息的完整列表，请查看更新文档(包含在此更新中)或粉丝站点TUS！上的开发人员死码线程。", "note_en": "Worms Armageddon version 3.8 is finally released! It&#39;s been a long time coming, and we hope you&#39;ll enjoy all the features, changes, and bug fixes that made it into this community-made update. To whet your appetite, here are some change highlights:\n   Customise your matches in weird and wonderful ways with over 70 new scheme options. Manipulate physics, fire more than one weapon in a turn, have worms bounce around the landscape, or choose from a huge array of other tweaks in order to perfect your scheme. These options are only for the seasoned Worms veteran, and as such you will need to have completed the Single Player mode and unlocked The Full Wormage in order to access them.\n                For those who used the RubberWorm module in older versions of the game, all features formerly accessed through that module are now hiding behind the shiny new Extended Scheme Options star button. Relive your past glories — all your old RubberWorm recorded games can be played back with no additional software required.\n    Worms Armageddon has never looked this smooth! In older versions, in-game movement and animations would be capped at the update rate of the game engine: 50 frames per second. In 3.8 though, experience the full silky smoothness of whatever frame rate your hardware can support — movement is now visually interpolated between game engine frames as your worms and weapons glide majestically through the air. Watch a recorded game in slow motion and you&#39;ll never want to go back!\n    Worms Armageddon can now be played in a window! Awkward screen resolution changes and game capture issues are a thing of the past if you enable this feature in Advanced Settings.\n    Along with Windowed Mode, a couple of additional options have been added specifically for streamers to make their lives easier. Audio can now be allowed to continue playing when the game window loses focus, and the new Streaming Mode will prevent IP addresses from being displayed when hosting or joining an online game (see the Update Documentation for more information).\n    CPU teams can now be added to online games. They&#39;re always uniquely distinguishable from player teams to prevent shenanigans, but you can now finally team up with your friends to take down a swarm of those computer-controlled invertebrates. Or if you&#39;d just like to watch a relaxing game while you work, matches containing only CPU teams may now also be started, both online and offline.\n    Have you ever wrought a beautiful trail of destruction on your Worms Armageddon landscape and wished you could play a brand new game on the land that remained? Or have you ever been interrupted in the middle of a game and wished you could extract the remaining landscape to help you set up a rematch? Well, now you can! Simply type  /map into the in-game chat or press  Alt + Pause at any time to save a snapshot of the current state of the map, allowing you to continue your rampage from where you left off!\n    Much effort has been expended in allowing everyone, no matter their hardware, to have a good Worms Armageddon experience. Further tweaks have been made to improve the experience of Windows 10 users. Worms Armageddon now runs well under Wine or Proton on Linux. A new OpenGL renderer has been added which, depending on your hardware, might outperform the other renderers. Windowed mode means there&#39;s no more need for your hardware to support specific screen resolutions. And for those into retro computing, Worms Armageddon has been seen to once again run on systems of yore...\n    Through the tireless efforts of volunteer translators, Worms Armageddon is now fully translated to seven languages (🇫🇮 Finnish, 🇫🇷 French, 🇩🇪 German, 🇵🇹🇧🇷 Portuguese, 🇷🇺 Russian, 🇪🇸 Spanish and 🇸🇪 Swedish), with four more languages with partial translations on the way. The Update Documentation (Readme) now has translations to Finnish, French, and Spanish!\n      Our thanks go to all the hardworking members of the Worms Armageddon community who helped make this update a reality. And for the full list of what&#39;s new, check the Update Documentation (included with this update) or  developer Deadcode&#39;s thread on fan-site TUS!", "posttime": "2020-07-20 11:13:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "蠕虫,worms,游戏", "title": "蠕虫世界末日3.8", "title_en": "Worms Armageddon 3.8", "transed": 1, "url": "https://worms2d.info/Worms_Armageddon_3.8_Features", "via": "", "real_tags": ["蠕虫", "worms", "游戏"]}]