[{"category": "", "categoryclass": "", "imagename": "7dbed5e78ff68ce04998c1d48148e1dd.jpg", "infoid": 1068725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在建筑物崩溃前几个月，一个公寓官员警告说，近年来损坏的损失“得到了显着越差”。\n 尚普兰塔南公寓在佛罗里达州佛罗里达州的山南公寓前的不到三个月。，公寓协会主席警告说，这是建筑物的损害“得出明显差”，因为它在2018年检查中突出了。\n 这封信是由协会董事会主席Jean Wodnicki的居民编写的，解释为什么一个广泛的建筑项目名单价值1500万美元的特别评估，居民被要求支付。随着2018年检查，警告了“主要结构损害”的信，纽约时报所获得的副本增加了一个越来越多的证据，即工程师在建筑月份甚至年内提出了关于严重缺陷的警报在灾难性的建筑物失败之前，这杀死了11人，剩下150人。\n  Wodnicki女士在美国今天首次报道的信中撰写了这封信，将在未来几年内“繁衍地”，将在未来几年内“繁殖逐步逐步逐步逐步”。准备初始报告的工程师Frank Morabito进行了“更详细的财产调查”，发现了这种加速确实已经发生的迹象。 “当你可以在视觉上看到混凝土剥落（破解），这意味着钢筋在一起的钢筋在曲面下面的生锈和恶化，”Wodnicki女士写道。\n 尚普兰塔南公寓楼前不到三个月，公寓协会主席警告说，建筑物的损害“得出明显差”，因为它在2018年检查中突出了。\n  阅读文件\n 她解释说，由于2018年检查以来，这些损害造成的迹象是为什么估计的维修费用超过约60％。 “混凝土劣化正在加速。屋顶的情况变得更加糟糕，“她写道：”已经确定了新问题。“ \n“多年来，这项工作已经完成或计划了，”她在这封信中写道。 “但这是我们现在的位置。” ", "note_en": "Months before the building’s collapse, a condo official warned that damage had ‘gotten significantly worse’ in recent years.\n Less than three months before the collapse of the Champlain Towers South condo in Surfside, Fla., the president of the condominium association warned in a letter that the damage in the building had “gotten significantly worse” since it was  highlighted in a 2018 inspection.\n The letter was written to residents by Jean Wodnicki, president of the association’s board of directors, explaining why a list of extensive construction projects were worth a $15 million special assessment that residents were being asked to pay.  Along with the 2018 inspection, which warned of “major structural damage,” the letter, a copy of which The New York Times obtained, adds to a growing body of evidence that engineers had raised alarms about serious flaws in the building months and even years before the catastrophic building failure, which killed 11 people and left 150 unaccounted for.\n  That 2018 inspection warned that concrete damage would “multiply exponentially” in the coming years, Ms. Wodnicki wrote in the letter, which was first reported by  USA Today and  The Wall Street Journal. The engineer who prepared that initial report, Frank Morabito, carried out “a much more detailed survey of the property” and found signs that this acceleration was indeed already happening. “When you can visually see the concrete spalling (cracking), that means that the rebar holding it together is rusting and deteriorating beneath the surface,” Ms. Wodnicki wrote.\n Less than three months before the collapse of the Champlain Towers South condo complex, the president of the condominium association warned in a letter that the damage in the building had “gotten significantly worse” since it was highlighted in a 2018 inspection.\n  Read Document\n She explained that these signs of growing damage were why the estimated costs of repair had jumped by some 60 percent since that 2018 inspection. “The concrete deterioration is accelerating. The roof situation got much worse,” she wrote adding: “New problems have been identified.”\n “A lot of this work could have been done or planned for in years gone by,” she wrote in the letter. “But this is where we are now.”", "posttime": "2021-06-30 04:17:27", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "公寓,official,损害", "title": "近年来，公寓官方警告伤害“得出明显差” ", "title_en": "Condo official warned damage had ‘gotten significantly worse’ in recent years", "transed": 1, "url": "https://www.nytimes.com/2021/06/29/us/surfside-building-collapse-warning-letter.html", "via": "", "real_tags": ["公寓", "official", "损害"]}, {"category": "", "categoryclass": "", "imagename": "11153b9785cad9bdd32d328da0a8aab1.png", "infoid": 1068724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "自从我们涵盖了Marvell的Octeon TX2基础设施处理器以来，这是一年多的一年，从那时起，生态系统一直以非常快速的方式发展 - 无论是在Marvell和外面都在发展。今天，我们正在覆盖新一代Octeon 10家庭DPU，这是一个全新的SoC系列，建于TSMC的5nm流程节点，也是第一次ARM新的NeoVers N2处理器的特色。\n    Marvell开始使用一点历史和命名法，正在采用这类芯片和加速器类型的“DPU”术语。上一代Octeon TX和Octeon TX2已经是DPU，除名字之外，以前只是被称为“基础设施处理器”。随着最近的行业普及的级别以及竞争对手解决方案，似乎我们看到DPU术语现在被广泛接受了这种类型的多功能芯片设计的命名，所以由它有助于的实体在通过网络旅行时进程和移动数据。\n    从概述开始，新的Octeon 10通常具有我们在上一代中看到的相同多功能的构建块数组，这次升级到新的ACT IP块的新状态，并引入了集成机器等一些新功能学习推理引擎，新的内联和加密处理器以及矢量包处理器，都能够以虚拟化的方式操作。\n  这也是Marvell的第一个TSMC N5P Silicon设计，实际上是它在新过程中的第一个DPU，也是第一个公开宣布的新透明N2实现，具有最新的PCIe 5.0 I / O功能以及DDR5支持。\n    开始与Marvell视图作为DPU的重要补充，是一个新的内部ML引擎。 Marvell表示，IP的设计实际上是为专用推理加速器创建的，实际上已经完成了去年，但由于极其拥挤的竞争风景，Marvell无法将其带到市场上。相反，Marvell已选择将ML加速器集成到他们的Octeon DPU芯片中。 Marvell在此处指出，在同一单片硅芯片上具有推理加速器，直接集成到数据流水线方面对于实现这些类型的数据流使用情况所需的较高吞吐量处理的低延迟非常重要。\n  基本上Marvell在这里为NVIDIA的Nevid-Gen Bluefield-3 DPU提供了竞争对手解决方案，而在产品一代方面，在产品生成方面，由于第一个Octeon 10解决方案预计将在今年年底进行抽样，而NVIDIA预计BF3要抵达2022年。\n    此外，新的Octeon 10家族的新能力是引入矢量包处理引擎，其能够与当前生成标量处理引擎相比，可以大大增加5倍的分组处理吞吐量。 \n如上所述，新的Octeon 10 DPU系列是第一个公开宣布的硅设计，具有ARM最新的NeoVers N2基础架构CPU IP。几个月前我们已经涵盖了N2及其HPC v1兄弟姐妹 - 这是新一代核心是来自ARM的第一个ARMv9核心，与手臂中所看到的当前N1核心相比，承诺大40％的IPC增益服务器CPU，如Amazon Graviton2或Ampere Altra。\n  对于Marvell，性能改进甚至更加重要，因为公司正在从公司之前的内部内部“TX2”CPU IP为N2核心，很有用3倍高度的单螺纹性能隆起。去年年底，Marvell宣布已经停止了自己的CPU知识产权，支持ARM的新古代核心，并且今天重申该公司正计划在可预见的未来巩固ARM的路线图，这是ARM的新知识产权与其他行业球员（如安培或Qualcomm）对比的一点。\n  对于DPU使用而言，对于DPU使用情况是事实上，这是一个ARMv9 CPU，也具有SVE2支持，其中包含帮助数据处理和机器学习功能的新的重要说明。这实际上将是NVIDIA的BlueField3 DPU设计的巨大IP优势，仍然“仅”具有Cortex-A78核心，该核心是ARMV8.2 +。\n  Marvell使用完整的缓存配置选项为其N2实现，含义64KB L1i和L1D缓存，以及L2的完整1MB。该公司对SOC的集成仍然使用自己的内部网状网络解决方案 - 在非常高的级别上，这仍然在基本规范中看起来类似，网格中的256bit数据路径，以及包含2MB缓存切片的共享L3，缩放数量与核心计数一起。\n    在交换机集成和网络吞吐量方面，Marvell集成了1 TB / S开关，最多可达16 x 50G Mac  - 但不应指出，此处的功能将根据实际的SKU和芯片设计而变化很多家庭。\n    在使用情况下，八焊10家族涵盖了4G / 5G RAN数字单位或中央单元，前销网关甚至VRAN卸载处理器的各种应用。在云和数据中心，解决方案可以在计算和网络吞吐量性能方面提供广泛的多功能性，而对于企业用例，该系列提供深度集成的数据包处理和安全加速功能。\n    第一个Octeon 10产品和样品将基于CN106XX设计，具有24个N2核心和2x 100GBE QSFP56端口，用于PCIe 5.0形状因子，可用于Q4。 \n在规格方面，Marvell造成了各种八联10家族设计的细分：\n    幻灯片注意：此上下文中的DDR5控制器是指40位通道（32 + 8位ECC）。 Marvell还指出，由于与前一代和竞争对手解决方案相比，它仍然使用SPECINT2006  - 它将发布2017年估计第一款硅准备就绪。\n  CN106XX是八龙10家族的第一芯片设计，录制出来，预计将在今年下半年进行采样。超越这一芯片，Marvell有3个其他八焊10个以下端CN103xx形式设计，只有8个N2核心，低于TDP，以及10-25W的低TDP，以及两个高端CN106XX，具有改善的网络连接，最后是DPU400旗舰通过最大36个N2核心，并具有最大的处理能力和网络连接吞吐量。看到的是，即使具有最大的实现，TDP也达到60W，远远低于当代CN98XX Octeon TX2旗舰实施，该旗舰实施在80-120W。这些附加部件尚未被占用，并计划在整个2022中进行采样。\n  Marvell表示，DPU出货量方面是行业领导者，在所有大型数据中心部署中都是普遍的。这个新的辛加10代似乎从技术角度来看似乎极具侵略性，具有前沿IP和制造工艺，这应该在快速发展的DPU市场中的竞争中表现出显着的优势。\n  发布一个看起来像一个真正，真正平衡的加速器的评论。 （我也很欣赏他们在L3上没有像许多醉酒设计一样吝啬。）\n  回复\n  由于具有*两倍*每核的性能，顶部模型在标本上击败了Graviton 2。它还具有两倍的缓存和每核的内存带宽。而且，所有这些都在60w ...它＆＃39; s怪物，很可能优于大多数服务器都会卸货！回复 \n至少适用于LLC，它＆＃39; s 4x每个核心的缓存。八聚体10是2MB /芯，GRAG2为512KB /芯。回复\n  对于有状态数据包处理，它们确实需要尽可能多的缓存。他们可以抓住芯片的上下文的数量可能成为严重限制因素。因为那里没有SMT，如果您必须为某些连接特定状态下芯片，核心仍然赤裸裸。回复\n  ......以及用硬件预取人蒙上掩盖它的通常的伎俩＆＃39; T工作，因为它们可以＆＃39; t知道下一个数据包所属的连接。回复\n  ＆gt; NVIDIA的BlueField3 DPU设计仍然是“只有”功能Cortex-A78核心，我不相信这一点，鉴于其预计的发布日期，但事实证明在GTC 2021主题演讲幻灯片中是正确的！ https：//images.anandtech.com/doci/16611/17056937.j ...回复\n  有趣的单位，特别是对于5G基站和网络。注意他们如何强调＆＃34;无风扇＆＃34;幻灯片中的操作！好奇，那些与英特尔＆＃39; s x86的产品一起比较（如果有的话）如何抛出一些ml？此外，这些如何与华为在从TSMC启动之前与华为进行比较？回复\n  应该是：https：//en.wikipedia.org/wiki/hisilicon#kunpeng_93 ...更多，请参阅：https：//fuse.wikichip.org/news/2274/huawei- eppands ...我不和＃39 ; T知道此内容是否是（仍然）准确的。回复 ", "note_en": "It’s been a little over a year since we covered  Marvell’s OCTEON TX2 infrastructure processors, and since then, the ecosystem has been evolving in an extremely fast manner – both within Marvell and outside. Today, we’re covering the new generation OCTEON 10 family of DPUs, a whole new family of SoCs, built upon TSMC’s 5nm process node and also for the featuring for the first time Arm’s new Neoverse N2 processors.\n    Starting off with a bit of history and nomenclature, Marvell is adopting the “DPU” term for this class of chip and accelerator type. The previous generation OCTEON TX and OCTEON TX2 already were DPUs in everything but name, previously simply being referenced as “infrastructure processors”. With the recent industry rising popularity of the term as well as competitor solutions being propped up, it seems we’re seeing the DPU term now being widely accepted nomenclature for this type of versatile chip design, defined by the fact that it’s an entity that helps process and move data while it travels through the network.\n    Starting with an overview, the new OCTEON 10 generally features the same versatile array of building blocks we’ve seen in the previous generation, this time upgraded to the new state of the art IP blocks, and also introducing some new features such as integrated machine learning inference engine, new inline and crypto processors as well as vector packet processors, all able to operated in a virtualised manner.\n  This is also Marvell’s first TSMC N5P silicon design, actually the first DPU of its kind on the new process, and also the first publicly announced Neoverse N2 implementation, featuring the newest PCIe 5.0 I/O capabilities as well as DDR5 support.\n    Starting off with what Marvell views as an important addition to the DPU, is a new in-house ML engine. Marvell had stated that the design for the IP had actually been originally created for a dedicated inference accelerator, and actually had been completed last year, but with Marvell opting to not bring it to market due to the extremely crowded competitive landscape. Instead, Marvell has opted to integrate the ML accelerator into their OCTEON DPU chips. Marvell here states that having the inference accelerator on the same monolithic silicon chip, directly integrated into the data pipeline is extremely important in achieving the low latency for higher throughput processing required for these kinds of data stream use-cases.\n  Essentially Marvell here is offering a competitor solution to  Nvidia’s next-gen BlueField-3 DPU in terms of AI processing capabilities well ahead in terms of product generation, as the first OCTEON 10 solutions are expected to be sampling by end of this year while Nvidia projected BF3 to be arriving in 2022.\n    Also, a new capability of the new OCTEON 10 family is the introduction of vector packet processing engines, which are able to vastly augment the packet processing throughput by a factor of 5x compared to the current generation scalar processing engines.\n    As noted, the new OCTEON 10 DPU family is the first publicly announced silicon design featuring  Arm’s newest Neoverse N2 infrastructure CPU IP. We had covered the N2 and its HPC V1 sibling a couple of months ago – the jist of it is that the new generation core is the first Armv9 core from Arm and promises large 40% IPC gains in comparison to the current N1 core seen in Arm server CPUs such as the Amazon Graviton2 or Ampere Altra.\n  For Marvell, the performance improvements are even more significant as the company is switching over from the company’s previous in-house “TX2” CPU IP for the N2 core, promising a massive 3x higher single-threaded performance uplift. Late last year, Marvell had announced that it had stopped its own CPU IP in favour of Arm’s Neoverse cores, and today reiterated that the company is planning to stick to Arm’s roadmap for the foreseeable future, a large endorsement of Arm’s new IP which comes at bit of a contrast to other industry players  such as Ampere or  Qualcomm.\n  Important for DPU use-cases is the fact that this is a Armv9 CPU which also has SVE2 support, containing new important instructions that help data-processing and machine learning capabilities. This actually would be a large IP advantage over Nvidia’s BlueField3 DPU design that still “only” features Cortex-A78 cores which are Armv8.2+.\n  Marvell uses the full cache configuration options for their N2 implementations, meaning 64KB L1I and L1D caches, as well as the full 1MB of L2. The company’s integration into the SoC however continues to use their own internal mesh network solution – on a very high level this still looks similar in terms of basic specs, with 256bit datapaths in the mesh, and also a shared L3 containing 2MB cache slices, scaling up in number along with the core count.\n    In terms of switch integration and network throughput, Marvell integrated a 1 Tb/s switch with up to 16 x 50G MACs – it’s not be noted though that the capabilities here are going to vary a lot based on the actual SKU and chip design in the family.\n    In terms of use-cases, the OCTEON 10 family covers a wide range of applications from the 4G/5G RAN Digital Units or Central Units, Front Haul Gateways or even vRAN Offload processors. In the cloud and datacentre, the solutions can offer a wide array of versatility in terms of compute and network throughput performance, while for enterprise use-cases, the family offers deeply integrated packet processing and security acceleration features.\n    The first OCTEON 10 product and samples will be based on the CN106XX design with 24 N2 cores and 2x 100GbE QSFP56 ports on a PCIe 5.0 form-factor, available for Q4.\n  In terms of specifications, Marvell gives a breakdown of the various OCTEON 10 family designs:\n    Slide note: DDR5 controllers in this context refers to 40-bit channels (32+8bit ECC). Marvell also states that it still uses SPECint2006 due to its historical importance in regards to comparing to previous generation, and competitor solutions – it will publish 2017 estimates once the first silicon is ready.\n  The CN106XX is the first chip design of the OCTEON 10 family, taped out and expected to sample in the latter half of this year. Beyond this first chip, Marvell has 3 other OCTEON 10 designs in the form of the lower-end CN103XX with just 8 N2 cores and low TDPs of 10-25W, and two higher-end CN106XXS with improved network connectivity, and finally the DPU400 flagship with up to a massive 36 N2 cores and featuring the maximum amount of processing power and network connectivity throughput. What’s very exciting to see is that even with the largest implementations, the TDP only reaches 60W, which is far below the current generation CN98XX Octeon TX2 flagship implementation which lands in at 80-120W. These additional parts are yet to be taped out, and are planned to be sampled throughout 2022.\n  Marvell states that it’s been the industry leader in terms of DPU shipments, and is prevalent in all large datacentre deployments. This new Octeon 10 generation certainly seems extremely aggressive from a technology standpoint, featuring leading edge IP as well as manufacturing processes, which should give Marvell a notable advantage in terms of performance and power efficiency over the competition in the fast-evolving DPU market.\n  POST A COMMENT      That looks like a really, really well-balanced accelerator. (I also appreciate that they didn&#39;t skimp on L3 like a lot of Neoverse designs have.)\n  Reply\n  The top model beats Graviton 2 on SPECINT due to having *twice* the performance per core. It also has twice as much cache and memory bandwidth per core. And all that at 60W...  It&#39;s a monster and likely outperforms most servers it will be offloading!  Reply\n  At least for LLC, it&#39;s 4x the cache per core. Octeon10 is 2MB/core, Grav2 is 512KB/core.  Reply\n  For stateful packet processing, they really need as much cache as possible. The amount of context they can hold on chip can become a serious limiting factor. Because there&#39;s no SMT, the core is just sitting idle if you have to go off-chip for some connection-specific state.  Reply\n  ...and the usual trick of masking it with hardware prefetchers won&#39;t work at all, because they can&#39;t know which connection the next packet belongs to.  Reply\n  &gt; Nvidia’s BlueField3 DPU design that still “only” features Cortex-A78 cores  I didn&#39;t believe this, given its projected launch date, but it turns out to be right in the GTC 2021 keynote slides!   https://images.anandtech.com/doci/16611/17056937.j...  Reply\n  Interesting units, especially for 5G base stations and networking. Notice how they emphasize &#34;fanless&#34; operation in the slides! Curious how those compare (if at all) with Intel&#39;s x86-based offerings with some ML thrown in? Also, how do these compare with whatever Huawei has or had before they were booted from TSMC&#39;s advanced nodes?   Reply\n  Should be:  https://en.wikipedia.org/wiki/HiSilicon#Kunpeng_93...  For more, see:  https://fuse.wikichip.org/news/2274/huawei-expands...  I don&#39;t know if any of this stuff is (still) accurate.  Reply", "posttime": "2021-06-30 04:17:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "宣布,announces,核心", "title": "Marvell宣布Octeon 10 DPU系列：第一至5nm，N2 CPU ", "title_en": "Marvell Announces Octeon 10 DPU Family: First to 5nm with N2 CPUs", "transed": 1, "url": "https://www.anandtech.com/show/16790/marvell-announces-octeon-10-dpu-family-first-to-5nm-with-n2-cpus", "via": "", "real_tags": ["宣布", "announces", "核心"]}, {"category": "", "categoryclass": "", "imagename": "8183f577e73526e79ec4617acf46774b.jpeg", "infoid": 1068723, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Cobra是Bitcoin.org网站的伪创建者，已被伦敦的高等法院命令停止举办其Bitcoin白皮书的副本。\n 纳南首席科学家Craig Wright引用版权侵权，法官没有选择，但统治默认判决，因为眼镜蛇在周一的一份声明中表示，COBRA选择赖特LLP的赖特的代表性。\n QC QC QC QC禁止禁止眼镜蛇侵犯Wright在U.K的版权。，通过制作在网站上的白纸或“以任何其他方式下载”。\n   翁蒂尔说，还颁布了一个要求比特币.org发布法院命令副本的法院令的副本，以确定眼镜蛇对赖特造成的损害。\n Bitcoin.org是一个独立的开源项目，旨在支持比特币开发。该网站及其创造者在备受法律威胁的备忘上兴起。\n 诉讼程序于今年2月24日发布于英格兰和威尔士的业务和物业法院的知识产权清单。 4月份，赖特获得了允许服务眼镜蛇的许可，并寻求宣言，他拥有比特币白皮书的版权，声称眼镜蛇正在侵犯他的权利。\n 自今年年初以来，该网站表示，它认为怀特的索赔是“没有优点”，并拒绝将纸张拿下来。 ontier说，Wright不希望限制进入“他的”纸张，而是他不同意其支持者和开发人员的“替代资产”。 \n“......促进或以其他方式歪曲这些资产是比特币，因为他们不支持或将比特币的愿景一致，因为他在白皮书中掀起了比特币，”托尔的高级助理Simon Cohen说。\n  Wright Purports成为比特币的创造者，Satoshi Nakamoto。 Cobra表示，虽然Nakamoto的真实身份从未被揭示过，但赖特试图威胁到那些传播白皮书的人违背了比特币的精神。\n “特别关注的是，当@cobrabitcoin等绰号制作很大的公开陈述时，有关法院的宣言，以确认他们对我和比特币的评论，但不可避免地逃避现实，”赖特通过电子邮件告诉Coindesk。 “此外，他们还直接要求捐款给所述法院案件。我希望捐赠的任何资金将由@cobrabitcoin或至少宣布为税收的收入正式返回。“\n   “不幸的是，法院规则允许我伪追逐，但是，我无法伪追求自己。所以我在违约判决中丢失了我的隐私或失去案件的不可能的情况。它糟透了，但是我可以做得更多，真的。“ ", "note_en": "Cobra, the pseudonymous creator of the Bitcoin.org website, has been ordered by London’s High Court to discontinue hosting its copy of the Bitcoin white paper.\n Citing copyright infringement brought forward by nChain Chief Scientist Craig Wright, the judge had no option but to rule a default judgment because Cobra chose not to make an appearance, Wright’s representation,  Ontier LLP, said via a statement on Monday.\n Judge David Hodge, QC issued an injunction prohibiting Cobra from infringing Wright’s copyright in the U.K., either through making the white paper accessible for download on the website or “in any other way.”\n   An order requiring  bitcoin.org to publish a copy of the court’s order was also issued while an inquiry will be established to determine the damages caused by Cobra against Wright, Ontier said.\n Bitcoin.org is an independent open-source project that aims to support Bitcoin development. The website and its creator have been embroiled in a sparing of  legal threats.\n Proceedings were issued on Feb. 24 of this year in the Intellectual Property List of the Business and Property Courts of England and Wales. In April, Wright was granted permission to serve Cobra and sought a declaration that he owns the copyright to the Bitcoin white paper, claiming Cobra was infringing his rights.\n Since at least the start of this year, the website has said that it believes Wright’s claims are “without merit” and has refused to take the paper down. Ontier said Wright did not wish to restrict access to “his” paper but instead he did not agree with its use by supporters and developers of “alternative assets.”\n  “… To promote or otherwise misrepresent those assets as being Bitcoin given that they do not support or align with the vision for Bitcoin as he set out in his White Paper,” said Simon Cohen, senior associate at Ontier.\n  Wright purports to be Bitcoin’s creator, Satoshi Nakamoto. Though the true identity of Nakamoto has never been revealed, Wright’s attempt to threaten those disseminating the white paper runs contrary to the spirit of Bitcoin, said Cobra on Tuesday.\n “What is especially concerning is when monikers like @CobraBitcoin make big, public statements about coming to court to confirm their comments about me and Bitcoin but, inevitably, then, evade the reality,” Wright told CoinDesk via email. “Moreover, they have also directly asked for donations to said court case. I would hope that any funds donated will be duly returned by @CobraBitcoin or at least declared as income for tax purposes.”\n   “Unfortunately, the court rules allowed for me to be sued pseudonymously, however, I couldn’t defend myself pseudonymously. So I was put in an impossible situation of losing my privacy or losing the case in a default judgment. It sucks, but there’s nothing more I could have done, really.”", "posttime": "2021-06-30 04:16:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "比特币,法院,orders,赖特", "title": "英国法院订单比特币.org撤销诉讼后白皮书 ", "title_en": "UK Court Orders Bitcoin.org to Remove White Paper Following Lawsuit", "transed": 1, "url": "https://finance.yahoo.com/news/uk-court-orders-bitcoin-org-071013826.html", "via": "", "real_tags": ["比特币", "法院", "orders", "赖特"]}, {"category": "", "categoryclass": "", "imagename": "8aa6456e52269bb5c537cfb3297cebaf.jpg", "infoid": 1068722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "赖斯大学计算机科学家正在派遣兰博，以拯救有时等待几天或几周的基因组研究人员，以获得巨大的DNA数据库的搜索结果。 DNA测序是如此流行的，基因组数据集每两年倍增一次，以及数据哈比的工具＆＃39; T保持速度。将DNA与基因组或研究生物体的演变相比，如病毒的进化，导致Covid-19通常等待的软件，以索引大量的软件，＆＃34; Metagenomic＆＃34;数据库每月更大，现在在Petabytes中衡量。\n  rambo，这是＆＃34的短暂;重复和合并的盛开过滤器，＆＃34;是一种新的方法，可以将这些数据库的索引时间从几周到几小时搜索到几小时到秒。赖斯大学计算机科学家上周在计算机械数据科学会议Sigmod 2021的协会中展示了Rambo。\n  ＆＃34;询问数百万与传统方法的DNA序列可以在大型计算集群上需要几个小时，并且可以在单个服务器上需要几周，而＃34;瑞培共同创造者Todd Treangen表示，一位米计算机科学家，其实验室专门从事Metagenomics。 ＆＃34;减少数据库索引时间，除查询时间外，对于基因组数据库的大小继续以令人难以置信的步伐进行成长而令人遗憾。＆＃34;\n  为了解决问题，与米计算机科学家Anshumali Shrivastava合作，专门从事制作大数据和机器学习更快，更可扩展的算法，以及Gaurav Gupta和Minghao Yan，同行评审的会议的共同领导者关于rambo的纸。\n  Rambo使用的数据结构比最先进的基因组分度方法以及其他优点相同，更加易于并行化，零假阴性率和低假阳性率。\n  ＆＃34; rambo的搜索时间比现有方法快35倍，＃34;古普塔，电气电脑工程博士生。在使用微生物基因组的170达格拉布特数据集的实验中，Gupta表示，rambo减少了＆＃34;在一个复杂的，专用集群上六周减少了六周的分享商品集群。＆＃34;\n  闫济慈的科学博士学位，说，＆＃34;在这个巨大的档案中，rambo可以使用100台机器的标准服务器搜索几毫秒的基因序列，甚至是子毫秒。＆＃34; \nrambo提高了盛开过滤器的性能，半世纪历史的搜索技术，这些技术已经应用于许多先前研究中的基因组序列搜索。 Rambo通过使用称为＆＃34的计数素描的概率数据结构来提高更早的绽放过滤方法，该方法是＆＃34的概要素描;导致更好的查询时间和内存折衷＆＃34;比早期的方法，和＃34;通过实现非常强大，低记忆和超快索引数据结构，＆＃34击败当前基线;作者在研究中写道。\n  Gupta和Yan表示，Rambo通过将几乎任何实验室迅速且价格低廉的基因组档案馆与现成的计算机一起搜索巨大的基因组档案，可以使基因组搜索民主化。\n  ＆＃34; rambo可以减少生物信息学中的吨调查的等待时间，例如在全球的废水梅泰群中寻找SARS-COV-2的存在;严说。 ＆＃34; rambo可能会在癌症基因组学和细菌基因组进化的研究中成为乐器。＆＃34;更多信息：Gaurav Gupta等，通过重复和合并的盛开过滤器（rambo），2021年数据管理会议的诉讼程序进行快速处理和查询170TB的基因组学数据，数据管理数据会议（2021年）。 DOI：10.1145 / 3448016.3457333\n     引用：DNA数据库：新方法从数周到几小时削减索引，搜索分钟（2021，6月28日）从https://techxplore.com/news/2021-06-dna-databases-method-indexing  - 周.html.\n  本文件受版权保护。除了私人学习或研究目的的任何公平交易外，没有书面许可，没有任何部分。内容仅供参考。 ", "note_en": "Rice University computer scientists are sending RAMBO to rescue genomic researchers who sometimes wait days or weeks for search results from enormous DNA databases.    DNA sequencing is so popular, genomic datasets are doubling in size every two years, and the tools to   the data haven&#39;t kept pace. Researchers who compare DNA across genomes or study the evolution of organisms like the virus that causes COVID-19 often wait weeks for software to index large, &#34;metagenomic&#34; databases, which get bigger every month and are now measured in petabytes.\n  RAMBO, which is short for &#34;repeated and merged bloom filter,&#34; is a new method that can cut indexing times for such databases from weeks to hours and search times from hours to seconds. Rice University computer scientists presented RAMBO last week at the Association for Computing Machinery data science conference SIGMOD 2021.\n  &#34;Querying millions of DNA sequences against a   with traditional approaches can take several hours on a large compute cluster and can take several weeks on a single server,&#34; said RAMBO co-creator Todd Treangen, a Rice computer scientist whose lab specializes in metagenomics. &#34;Reducing database indexing times, in addition to query times, is crucially important as the size of genomic databases are continuing to grow at an incredible pace.&#34;\n  To solve the problem, Treangen teamed with Rice computer scientist Anshumali Shrivastava, who specializes in creating algorithms that make big data and machine learning faster and more scalable, and graduate students Gaurav Gupta and Minghao Yan, co-lead authors of the peer-reviewed conference paper on RAMBO.\n  RAMBO uses a data structure that has a significantly faster query   than state-of-the-art genome indexing methods as well as other advantages like ease of parallelization, a zero false-negative rate and a low false-positive rate.\n  &#34;The search time of RAMBO is up to 35 times faster than existing methods,&#34; said Gupta, a doctoral student in electrical and computer engineering. In experiments using a 170-terabyte dataset of microbial genomes, Gupta said RAMBO reduced indexing times from &#34;six weeks on a sophisticated, dedicated cluster to nine hours on a shared commodity cluster.&#34;\n  Yan, a Ph.D student in   science, said, &#34;On this huge archive, RAMBO can search for a gene sequence in a couple of milliseconds, even sub-milliseconds using a standard server of 100 machines.&#34;\n  RAMBO improves on the performance of Bloom filters, a half-century-old search technique that has been applied to genomic sequence search in a number of previous studies. RAMBO improves on earlier Bloom filter methods for genomic search by employing a probabilistic data structure known as a count-min sketch that &#34;leads to a better query time and memory trade-off&#34; than earlier methods, and &#34;beats the current baselines by achieving a very robust, low-memory and ultrafast indexing data structure,&#34; the authors wrote in the study.\n  Gupta and Yan said RAMBO has the potential to democratize genomic search by making it possible for almost any lab to quickly and inexpensively search huge genomic archives with off-the-shelf computers.\n  &#34;RAMBO could decrease the wait time for tons of investigations in bioinformatics, such as searching for the presence of SARS-CoV-2 in wastewater metagenomes across the globe,&#34; Yan said. &#34;RAMBO could become instrumental in the study of cancer genomics and bacterial genome evolution, for example.&#34;        More information:\t\t\t\t\t\t\t\t\t\t\t\tGaurav Gupta et al, Fast Processing and Querying of 170TB of Genomics Data via a Repeated And Merged BloOm Filter (RAMBO),  Proceedings of the 2021 International Conference on Management of Data (2021).  DOI: 10.1145/3448016.3457333\n     Citation: DNA databases: New method cuts indexing from weeks to hours, searches to minutes (2021, June 28) retrieved 29 June 2021 from https://techxplore.com/news/2021-06-dna-databases-method-indexing-weeks.html\n  This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no part may be reproduced without the written permission. The content is provided for information purposes only.", "posttime": "2021-06-30 04:16:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,database,索引,databases,基因组", "title": "DNA数据库：新方法从数周削减索引，搜索分钟 ", "title_en": "DNA databases: New method cuts indexing from weeks to hours, searches to minutes", "transed": 1, "url": "https://techxplore.com/news/2021-06-dna-databases-method-indexing-weeks.html", "via": "", "real_tags": ["数据库", "database", "索引", "databases", "基因组"]}, {"category": "", "categoryclass": "", "imagename": "e5e0be0f1ff4480e1c0d947834f1223f.jpg", "infoid": 1068721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "每一个自尊的普斯特都应该在他们的工具包中拥有一个强大的密码饼干，而John The Ripper只是最好的饼干。\n 最初在1996年由OpenWall发布，John The Ripper已成长为成为黑客和Pentesters的首选密码饼干以及审计员使用的可靠工具，以发现弱密码。\n  在本文中，我们将学习如何使用John The Ripper执行基本密码开裂。\n  John The Ripper是一个离线密码饼干。换句话说，它试图从捕获文件中查找密码，而无需与目标进行交互。通过这样做，它不会产生可疑流量，因为该过程通常在本地执行，在攻击者的机器上。\n 虽然它主要用于破解密码哈希，但John也可用于破解受保护的存档文件，加密私钥等。\n  John The Ripper是一个免费的开源项目。您可以从OpenWall网站或其官方Github存储库下载它。您应该确保为操作系统下载正确的包。\n 如果您有Kali Linux，那么John应该已经安装了。您可以通过运行locate命令找到二进制文件的正确位置。 \n一旦您成功下载并安装了John，您就可以通过在命令提示符上键入二进制文件的名称后跟密码文件来启动它。\n 在下面的示例中，PasswordFile是一个文件，其中包含我们想要破解的密码列表。\n  这是您可以使用的最基本命令。由于我们未指定密码文件以外的任何参数，因此John将尝试使用默认选项来破解此文件。\n 虽然这是使用John最简单和最简单的方法，但它不一定提供所需的结果。为此，我们必须指定其他选项。\n  尝试使用John The Ripper破解密码文件时，您需要考虑的第一件事是John应该如何执行开裂过程。\n 约翰有三种主要的裂缝模式，您可以选择。让我们看看这些模式中的每个模式。\n  这是使用John Primper的最常见方式。在此模式下，您可以指定包含可能密码列表的字列表文件的路径。约翰将测试该字列表中包含的所有单词，并检查是否存在正确的密码。此过程是称为字典攻击的过程。 \n重要的是，单词列表每行包含一个密码。否则，John The Ripper不会正确处理。\n 在下面的示例中，我正在使用' -  wordList'选项来指定WordList文件的路径，它是'/usr/share/wordlists/rockyou.txt'。如果在该文件中正确的密码，John将显示它。\n  *'passwordfile'是包含我们想要破解的密码哈希的文本文件。\n 要增加查找正确密码的机会，您可以使用Mangling规则启用WordList模式。通过这样做，John将在WordList中略微修改每个单词。这将导致新的可能在字列表中存在的密码，因此它将增加找到正确的机会。\n 要启用“乱蓬蓬的规则”，您可以使用“ -  -Rules”选项。但是，您应该注意，这需要更长的时间来处理WordList。\n  在尝试破解UNIX密码时通常使用单个裂缝模式。它利用Passwd文件中存在的GECOS字段。这些GECOS字段通常包含有关用户的信息，例如其用户名及其全名。\n John将生成来自这些字段的候选密码列表，并使用广泛的一组扫描规则（默认情况下，在单个裂缝模式下默认情况下，生成的列表将定制为每个用户。 \n您应该注意，当没有指定模式时，默认情况下的John以单裂模式开始，然后在以增量模式结束之前（将在即将到来的部分中看到）。\n 为了更好地说明此模式，让我们看看如何破解UNIX系统的密码的示例。\n  unix systems存储有关用户信息的古典密码文件是'/ etc / passwd'。但是，几乎所有Unix系统都在单独的文件'/ etc / shadow'中存储密码哈希。\n 现在，为了拥有Gecos字段和密码哈希的单个文件，我们可以使用John的“Unshadow”实用程序。\n   上面的命令将在名称“passwordfile”下的当前目录中保存生成的文件。\n 一旦我们拥有我们的密码文件，我们就可以使用单个裂缝模式运行John。\n   这是约翰的蛮力模式。启用后，John将在指定的Charset和密码长度限制内尝试所有可能的字符组合。 \n要启用增量模式，可以使用“ - ” - “ - ” - “ - ” - “ - ” - “ - ”选择“模式。此模式是定义要使用的字符集和密码长度限制的原因。\n 约翰附带一些预定义的增量模式。要选择最适合您目的的模式，您可以检查“John.Conf”文件，其中存储RIPPer的设置。\n   如本配置中定义的字母模式可以破解长度为1到13个字符的密码，以及52个可能的字符的字符集。\n 您可以在配置文件中找到的其他预定义模式包括：ASCII（所有可打印的ASCII字符），Alnum（所有字母数字字符），较低（仅小写字母）和数字（仅位数）。\n 如果找不到适合您需求的增量模式，则可以在配置中添加它。如果您决定这样做，我邀请您阅读关于如何自定义Ripper的官方文档。\n    默认情况下，John The Ripper检测到哈希类型，然后尝试根据该类型破解密码。但是，约翰有时会错过正确的类型。在这种情况下，最好绕过自动哈希检测并手动指定类型。为此，您可以使用“ -  -format”选项，然后使用散列类型。\n   要获取所有支持的哈希格式的列表，可以运行以下命令： \n您现在拥有所有基础知识，您需要使用John The Ripper开始打击密码。 当然，约翰还有其他我们尚未介绍的其他功能，所以如果您想要更完整的学习材料，我邀请您查看官方文档。 ", "note_en": "Every self-respecting pentester should have a powerful password cracker in their toolkit, and John the Ripper is simply the best cracker out there.\n Initially released in 1996 by Openwall,  John the Ripper has grown to become the preferred password cracker for hackers and pentesters and a reliable tool used by auditors to spot weak passwords.\n  In this article, we will learn how to perform basic password cracking using John the Ripper.\n  John the Ripper is an offline   password cracker. In other words, it tries to find passwords from captured files without having to interact with the target. By doing this, it does not generate suspicious traffic since the process is generally performed locally, on the attacker’s machine.\n Although it’s primarily used to crack password hashes, John can also be used to crack protected archive files, encrypted private keys, and many more.\n  John the Ripper is a free open-source project. You can download it for free from the  Openwall website or from its official  Github repository. You should make sure to download the correct package for your OS.\n If you have Kali Linux, then john should already be installed. You can find the correct location of the binary file by running the locate command.\n  Once you’ve successfully downloaded and installed John, you can launch it by typing the name of the binary file on your command prompt followed by a password file.\n In the below example,  passwordFile is a file that contains a list of password hashes that we want to crack.\n  This is the most basic command that you can use. Since we have not specified any parameter other than the password file, John will try to crack this file using the default options.\n Although this is the simplest and easiest way to use John, it will not necessarily provide the desired results. For this, we have to specify additional options.\n  When attempting to crack a password file using John the Ripper, the first thing you need to consider is how should John go about performing the cracking process.\n John has three main cracking modes that you can choose from. Let’s see what each of these modes does.\n  This is the most common way to use John the Ripper. In this mode, you can specify a path to a wordlist file that contains a list of possible passwords. John will test all the words contained in that wordlist and check if the correct password is present there. This process is what is known as a  Dictionary Attack.\n It is important that the wordlist contains one password per line. Otherwise, John the Ripper will not process it correctly.\n In the example below, I am using the  ‘--wordlist’ option to specify the path to the wordlist file, which is ‘ /usr/share/wordlists/rockyou.txt ‘. If the correct password is in that file, John will display it.\n  * ‘  passwordFile ‘ is the text file that contains the password hashes that we want to crack.\n To increase the chances of finding a correct password, you can enable the wordlist mode with  mangling rules. By doing this, John will slightly modify each word in the wordlist. This will result in new likely passwords that aren’t necessarily present in the wordlist, and thus it will increase your chances of finding the correct one.\n To enable mangling rules, you can use the ‘- -rules ‘ option. However, you should note that this will take a longer time to process the wordlist.\n  The single crack mode is generally used when trying to crack Unix passwords. It takes advantage of the GECOS fields present in the  passwd file. These GECOS fields normally contain information about the user, such as their username and their full name.\n John will generate a list of candidate passwords from these fields, and by using an extensive set of mangling rules (which John does by default in the single crack mode), the generated list will be customized to each user.\n  You should note that, when no mode is specified, John by default starts with single crack mode, then the wordlist mode, before ending with the incremental mode (which we’ll see in the coming section).\n To better illustrate this mode, let’s see an example of how you would crack the passwords of a Unix system.\n  The classical password file where Unix systems store information about users is ‘ /etc/passwd’. However, almost all Unix systems store password hashes in a separate file ‘ /etc/shadow ‘.\n Now, in order to have a single file with GECOS fields and password hashes, we can use the ‘  unshadow ‘ utility that comes with John.\n   The above command will save the generated file in the current directory under the name ‘  passwordFile ‘.\n Once we have our password file, we can run John with the single crack mode.\n   This is John’s brute force mode. When enabled, John will try every possible combination of characters within the specified charset and password length limit.\n To enable the incremental mode, you can use the ‘- -incremental ‘ option followed by the mode to use. This mode is what defines the charset to use and the password length limit.\n John comes with some predefined incremental modes. To choose the mode that best suits your purposes, you can check the ‘  john.conf ‘ file where settings for John the Ripper are stored.\n   The Alpha mode, as defined in this config, can crack passwords ranging from 1 to 13 characters in length, and with a charset of 52 possible characters.\n Other predefined modes that you can find in the config file include : ASCII (All printable ASCII characters), Alnum (All alphanumeric characters), Lower (Only lowercase letters), and Digits (Only digits).\n If you can’t find an incremental mode that fits your needs, you can add it in the config. If you decide to do so, I invite you to read the  official documentation about how to customize John the Ripper.\n    By default, John the Ripper detects the hash type and then tries to crack the password based on that type. However, John can sometimes miss the correct type. In this case, it would be better to bypass the automatic hash detection and manually specify the type. To do so, you can use the ‘- -format ‘ option followed by the hash type.\n   To get the list of all supported hash formats, you can run the following command:\n  You now have all the basics that you need to start cracking passwords using John the Ripper. Of course, John has other features that we haven’t covered here, so if you want a more complete learning material, I invite you to check the  official documentation.", "posttime": "2021-06-30 04:16:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "破解,密码,john,ripper", "title": "使用John The Ripper破解密码哈希 ", "title_en": "Using John the Ripper to Crack Password Hashes", "transed": 1, "url": "https://patchthenet.medium.com/using-john-the-ripper-to-crack-password-hashes-fd9a96cb9e81", "via": "", "real_tags": ["破解", "密码", "john", "ripper"]}, {"category": "", "categoryclass": "", "imagename": "2d8b720cccb2334df128d3a2c5adda44.png", "infoid": 1068719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，经过几个月的发展，我们很自豪地释放镜头5！这是我们在2020年3月开放的项目以来，这是我们最重要的发布。镜头5随着使用Kubernetes和其他云本机技术而增加开发人员和操作员效率的多种增强功能。\n 镜头5希望改善与Kubernetes一起使用的人的合作和团队合作。我们正在降低新用户的进入障碍，提高经验丰富的用户的生产力。我们对这个新的发布感到兴奋，我们希望你能享受它！这个新版本的亮点是目录，热杆和顶部的樱桃：空格。继续阅读以了解更多关于这些很酷的新功能。\n  当系统和云本机足迹变大时，组织，访问和查找集群和相关资源变得具有挑战性。使用镜头5，我们正在介绍一个统一的目录，将所有群集，服务，工作负载，工具，自动化和相关资源一起带到一起，以便轻松访问。您可以使用搜索，过滤器，类别和标签来访问您需要更容易工作所需的资源。\n 我们有5个版本的重大计划，但不能降落我们所需的所有功能，因为时间限制。我们不想再延迟镜头5释放，以便在未来几周和月份看到对目录的改进！\n  我们都是关于让事情做的事情快。不久前，我们介绍了一个命令调色板，允许用户执行特定的键盘快捷键，提高可访问性和效率。凭借镜头5，我们采取了另一个重大步骤来更快地制造。打个招呼到Hotbar！如果你是游戏玩家，你知道我在说什么♥。\n HotBar现在是主导航，允许用户从目录中选择最重要且常用的函数（例如打开群集），并将那些分配给HotBar。用户可以访问多个Hotbars，在它们之间快速切换并自定义为其喜欢轻松调用。\n  我们一直在寻找提高与Kubernetes的人们生活质量和体验的方法。使用镜头5，您可以拍摄惊人的镜头体验并与整个团队共享。加入空间并立即访问所有Kubernetes集群和云原始资源。需要一些帮助？邀请朋友帮助解决本地群集。在镜头内无缝地管理对本地，在线或公共云的群集的访问。 \n为此，我们正在引入一个称为空格的基于云的服务。通过镜头桌面应用程序注册以免费入门。哦，这只是一开始;期望在不久的将来可以通过空格查看更多功能！\n  共享对Kubernetes集群的访问并不总是容易的。要诚实，它是使用Kubernetes时遇到的最困难的过程之一。您可能必须使用IAMS，安装了一堆专用工具，获取访问kubectl文件，获取这些文件以使用您的kubect，并最终确保您与目标群集API的同一网络。这是如此痛苦，用户甚至可能绕过一些安全最佳实践！我们希望将这种痛苦远离，使其超级镜头用户可以访问并共享对群集的访问而不会损害安全性。\n 使用空格时，您将获得选项以共享对群集的访问权限。您还可以轻松接受其他人访问其集群的邀请。为了使这一点成为可能，我们创建了一个完全新的技术：群集连接。它允许镜头用户将任何群集连接到空格，而无需在防火墙上启用入站端口。它利用端到端加密来确保用户和集群之间的连接，从而消除了对VPN的需求。这意味着无需通过Internet公开Kubernetes API。开发人员和运营商可以轻松访问和与他们的Kubernetes集群从任何地方一起使用。\n 一如既往，我们都是关于开放来源的。如果您有兴趣了解我们如何实现群集连接，请参阅GitHub上的项目！它是完全开放的来源，所以任何人都可以验证我们如何实现安全功能。\n  代表整个镜头团队，我要感谢我们精彩的社区，以满足他们的所有支持和反馈。我们社区提供的支持是无价的，我们感到非常幸运！\n 团队和我邀请你试试镜头5，我们很乐意听到你的反馈，好坏。如果您喜欢镜头，我们会非常感谢您在Github上给我们一个明星。这使我们的开发人员和贡献者能够看到该项目的爱和欣赏！\n  镜头为在Kubernetes中运行的所有内容提供全部情境感知。它正在降低人们的进入障碍，因为人们刚刚开始和提高具有更多经验的人的生产力。镜头是在开源的内置和免费的任何目的。镜头开源项目由许多Kubernetes和云本机生态系统先驱备份。凭借超过500万个下载，超过20万用户，GitHub上的14.9万星级，这是Kubernetes最受欢迎的IDE。 https://k8slens.dev。 ", "note_en": "Today, after months of development, we are proud to release Lens 5! This is our most significant release since we open sourced the project in March 2020. Lens 5 comes with multiple enhancements that will increase developer and operator efficiency when working with Kubernetes and other cloud native technologies.\n Lens 5 looks to improve collaboration and teamwork for anyone working with Kubernetes. We are lowering the barrier of entry for new users and improving productivity for experienced users. We are excited about this new release, and we hope you’ll enjoy it! The highlights of this new release are  Catalog,  Hotbars and a cherry on top:  Spaces. Keep on reading to learn more about these cool new features.\n  Organizing, accessing and finding clusters and related resources becomes challenging when systems and your cloud native footprint grows bigger. With Lens 5, we are introducing a unified catalog to bring all your clusters, services, workloads, tools, automations, and related resources together for easy access. You can use search, filters, categories, and labels to access the resources you need to work with easier than ever before.\n We had big plans for the 5 release, but couldn’t land all the features we wanted given the time constraints. We didn’t want to delay the Lens 5 release anymore so expect to see improvements to the catalog in the coming weeks and months!\n  We are all about getting things done, fast. Not long ago, we introduced a command palette that allows users to perform specific keyboard shortcuts, improving accessibility and efficiency. With Lens 5, we took another major step to make things faster. Say hi to Hotbar! If you are a gamer, you know what I’m talking about 😊.\n Hotbar is now the main navigation, allowing users to pick and choose the most important and commonly used functions (such as open cluster) from the catalog and assign those to the hotbar. Users have access to multiple hotbars, switch quickly between them and customize to their liking for easy recall.\n  We are always looking for ways to improve the quality of life and experience for people working with Kubernetes. With Lens 5, you can take the amazing Lens experience and share it with your whole team. Join a Space and get instant access to all their Kubernetes clusters and cloud-native resources. Need some help? Invite a friend to help troubleshoot your local cluster. Seamlessly manage access to clusters across local, on-prem, or public clouds all from within Lens.\n  In order to do this, we are introducing a centralized cloud based service called Spaces. Sign up via Lens desktop application to get started for free. Oh, and this is just the beginning; expect to see more features available via Spaces in the near future!\n  Sharing access to the Kubernetes cluster is not always easy. To be honest, it’s one of the most difficult processes you’ll encounter when working with Kubernetes. You might have to work with IAMs, have a bunch of dedicated tooling installed, get access to kubectl files, get those files to work with your kubectl and finally ensure you are on the same network with the target cluster API. It’s so painful, users might even bypass some of the security best practices! We want to take this pain away and make it super easy for Lens users to access and share access to clusters without compromising security.\n When you use Spaces, you’ll get the option to share access to your cluster. You can also easily accept invitations from others to access their clusters. To make this possible, we created an entirely new technology:  Cluster Connect. It allows Lens users to connect any of their clusters to Spaces without requiring an inbound port to be enabled on the firewall. It utilizes end-to-end encryption to secure connections between users and clusters, eliminating the need for a VPN. This means there is no need to expose the Kubernetes API via the Internet. Developers and operators can easily access and work with their Kubernetes clusters from anywhere.\n As always, we are all about open source. If you are interested in seeing how we implemented Cluster Connect, please  see the project on GitHub! It’s fully open source, so anybody can verify how we implemented the security features.\n  On behalf of the entire Lens team, I would like to thank our wonderful community for all of their support and feedback. The support provided by our community has been priceless, and we feel incredibly fortunate!\n The team and I invite you to give Lens 5 a try, and we would love to hear your feedback, good or bad. If you enjoy Lens, we would greatly appreciate you giving us a star on  GitHub. This allows our developers and contributors to see the love and appreciation for the project!\n  Lens provides the full situational awareness for everything that runs in Kubernetes. It’s lowering the barrier of entry for people just getting started and improving productivity for people with more experience. Lens is built on open source and free of charge for any purpose. The Lens open source project is backed by a number of Kubernetes and cloud-native ecosystem pioneers. With more than 5 million downloads, over 200,000 users, and 14.9k stars on GitHub, it’s the most popular IDE for Kubernetes.  https://k8slens.dev.", "posttime": "2021-06-30 04:15:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "镜头,lens", "title": "镜头 -  Kubernetes IDE  - 宣布其最大的释放镜头5 ", "title_en": "Lens – The Kubernetes IDE – Announces its biggest release, LENS 5", "transed": 1, "url": "https://medium.com/k8slens/lens-5-released-f7e58e8842cf", "via": "", "real_tags": ["镜头", "lens"]}, {"category": "", "categoryclass": "", "imagename": "ddc58267c6f5e23eb93e0461fbf61d06.jpg", "infoid": 1068718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天＆＃39; Demainmaster的演绎有折扣我们在ARS轨道上的一些小工具，先前推荐。 Eufy＆＃39; S室内凸轮2K，我们最喜欢的室内安全摄像机是那些预算的，例如UE＆＃39; S清爽的声音和坚固的奇迹2蓝牙音箱下降到65美元的价格为10美元。苹果的多个skus＆＃39;令人印象深刻的M1 Macbook Air正在出售，anker＆＃39; scompic powerport III Nano USB-C快速充电器。我们喜欢的许多PC游戏，包括最近的ARS GOTY HADES，CONTROL和CELESTE，作为Steam＆＃39;持续的夏季销售的一部分，虽然开关所有者可以获得最低的价格。追踪ARS批准的怪物猎人崛起。\n 在其他地方，微软＆＃39;最近升级的Xbox游戏通过终极服务仍为过去或当前用户的15美元，而Apple＆＃39; S高端Airpods Max Headphones最高为60美元，使其降至490美元。它仍然昂贵，但它＆＃39;＆＃39;＆＃39是一个新的低。我们还涉及声音订阅，戴吞真空，巢恒温器等，您可以在下面的策划回程中找到所有这些。\n 注意：ARS Technica可以通过联盟计划获得从本帖子的链接销售的赔偿。\n   Eufy室内凸轮2K室内安全摄像头在亚马逊29.99美元（剪辑$ 4优惠券 - 通常$ 40）。\n Xbox游戏通过Ultimate 3个月的会员资格，可满足亚马逊和沃尔玛的$ 29.99（新用户1美元 - 通常$ 45）。\n Apple Airpods在亚马逊和最佳购买$ 489.99美元的最大蓝牙降噪耳机（通常为549美元）。\n 仅限亚马逊仅限27.80美元（6.95 /月/月）的Aucime Premium加4个月的会员资格（自动续订14.95美元/月 - 通常$ 60）。 \nAnker PowerPort III Nano 20W USB-C Gan Wall充电器在亚马逊13.59美元（剪辑20％优惠券 - 通常$ 17）。  Apple TV 4K（32GB）4K HDR媒体流媒体为169美元，亚马逊，Sam＆＃39; S俱乐部和沃尔玛（通常为179美元）。  Apple MacBook Air（2020）笔记本电脑 -  Apple M1，13.3英寸2560x1600,8GB RAM，256GB SSD，亚马逊899.99美元（通常960美元）。  Apple Macbook Air（2020）笔记本电脑 -  Apple M1，13.3英寸2560x1600，8GB RAM，512GB SSD，亚马逊1,099.99美元（在结账时见到 - 通常为1,200美元）。  Lenovo Chromebook Flex 5 2-1笔记本电脑 - 英特尔核心I3-10110U，13.3英寸1080P，4GB RAM，64GB EMMC，亚马逊$ 339.99（通常为390美元）。  Apple回到学校销售：通过购买Apple购买Select Mac和iPad产品，获得Apple Airpods True Wireless earbuds + 20％Off Apple。  Yakuza：亚马逊和目标的29.99美元的龙（Xbox，PS4）（也是游戏通行证 - 通常40美元）。 \n不朽的Fenyx上升（交换机，PS4，PS5，Xbox），可在亚马逊24.99美元，最佳购买（通常为33美元）。  Guacamelee！ 2 Microsoft $ 4.49完成（Xbox，Digital）（游戏通行证 - 通常$ 22）。  金属齿轮固体V：Playstation商店的4.99美元的幻影疼痛（PS5）（通常为20美元）。  Halo：蒸汽19.99美元的主船长（PC）（也可以在游戏通行证 - 通常40美元）。  控制：最终版（PC）$ 15.99在Steam（游戏通行证 - 通常$ 40）。  Xbox游戏通过Ultimate 3个月的会员资格，可满足亚马逊和沃尔玛的$ 29.99（新用户1美元 - 通常$ 45）。  任天堂游戏＆amp; 观看：Super Mario Bros.手持式游戏控制台为39.99美元，B＆amp; H（通常50美元）。 \nHori Split Pad Pro手持式游戏控制器为任天堂开关，可在亚马逊和沃尔玛为39.99美元（通常为50美元）。  Razer Basilisk Ultimate无线游戏鼠标+充电码头+ 50美元的蒸汽礼品卡，最佳购买$ 129.99（通常为185美元）。  Apple TV 4K（32GB）4K HDR媒体流媒体为169美元，亚马逊，Sam＆＃39; S俱乐部和沃尔玛（通常为179美元）。  55英寸LG C1（2021型号）4K HDR OLED电视以1,496.99美元，亚马逊，目标和沃尔玛（通常为1,775美元）。  55英寸索尼A8H（2020型号）4K HDR OLED电视，亚马逊$ 1,298（通常为1,650美元）。  Apple Airpods在亚马逊和最佳购买$ 489.99美元的最大蓝牙降噪耳机（通常为549美元）。  在Amazon，Target和Sam＆＃39; S俱乐部（通常为45美元），以39美元的价格为39美元击败Flex Bluetooth In-Ear耳机。 \nSandisk Extreme（500GB）便携式外部SSD为84.99美元，Amazon，Adorama和B＆amp; H（通常90美元）。  Eufy室内凸轮2K室内安全摄像头在亚马逊29.99美元（剪辑$ 4优惠券 - 通常$ 40）。  Google Nest学习恒温器（第3 Gen）Smart Thermostat，199美元在Amazon，Target和Walmart（通常为250美元）。  Google Nest Hello 1600x1200智能视频门铃$ 149，Sam＆＃39; S俱乐部和沃尔玛（通常为229美元）。  Anker PowerPort III Nano 20W USB-C Gan Wall充电器在亚马逊13.59美元（剪辑20％优惠券 - 通常$ 17）。  仅限亚马逊仅限27.80美元（6.95 /月/月）的Aucime Premium加4个月的会员资格（自动续订14.95美元/月 - 通常$ 60）。  亚马逊Kindle无限6个月的成员资格为47.86美元（243.80美元，12个月为80.30美元 - 通常$ 60）。 \nAnova Precision炊具纳米Sous Vide Machine在亚马逊，目标和Home Depot的99美元（通常为120美元）。 ", "note_en": "Today&#39;s rendition of the Dealmaster has discounts on a number of gadgets we at the Ars Orbiting HQ have previously recommended. Eufy&#39;s Indoor Cam 2K, one of our  favorite indoor security cameras for those on a budget, is $10 off, for instance, while UE&#39;s  crisp-sounding and rugged Wonderboom 2 Bluetooth speaker is down to $65. Multiple SKUs of  Apple&#39;s impressive M1 MacBook Air are on sale, as is Anker&#39;s compact  PowerPort III Nano USB-C fast charger. A number of PC games we like, including recent Ars GOTY   Hades,   Control, and   Celeste, are deeply discounted as part of  Steam&#39;s ongoing Summer Sale, while Switch owners can get the lowest price we&#39;ve tracked on the  Ars-approved  Monster Hunter Rise.\n Elsewhere, Microsoft&#39;s  recently upgraded Xbox Game Pass Ultimate service is still $15 off for past or current subscribers, while Apple&#39;s  high-end AirPods Max headphones are $60 off, bringing them down to $490. That&#39;s still pricey, but it&#39;s a new low all the same. We also have deals on Audible subscriptions, Dyson vacuums, Nest thermostats, and more, all of which you can find in our curated roundup below.\n Note: Ars Technica may earn compensation for sales from links on this post through  affiliate programs.\n   Eufy Indoor Cam 2K indoor security camera for  $29.99 at Amazon ( clip $4 coupon—normally $40).\n Xbox Game Pass Ultimate 3-month membership for  $29.99 at Amazon and  Walmart (  $1 for new subscribers—normally $45).\n Apple AirPods Max Bluetooth noise-canceling headphones for  $489.99 at Amazon and  Best Buy (normally $549).\n Prime members only:  Audible Premium Plus 4-month membership for  $27.80 ($6.95/month) at Amazon (auto-renews at $14.95/month—normally $60).\n  Anker PowerPort III Nano 20W USB-C GaN wall charger for  $13.59 at Amazon ( clip 20% coupon—normally $17).\n   Apple TV 4K (32GB) 4K HDR media streamer for  $169 at Amazon,  Sam&#39;s Club, and  Walmart (normally $179).\n   Apple MacBook Air (2020) laptop—Apple M1, 13.3-inch 2560x1600, 8GB RAM, 256GB SSD for  $899.99 at Amazon (normally $960).\n Apple MacBook Air (2020) laptop—Apple M1, 13.3-inch 2560x1600, 8GB RAM, 512GB SSD for  $1,099.99 at Amazon (discount seen at checkout—normally $1,200).\n Lenovo Chromebook Flex 5 2-in-1 laptop—Intel Core i3-10110U, 13.3-inch 1080p, 4GB RAM, 64GB eMMC for  $339.99 at Amazon (normally $390).\n Apple Back to School Sale: get Apple AirPods true wireless earbuds + 20% off AppleCare+ with purchase of select Mac and iPad products at Apple.\n   Yakuza: Like a Dragon (Xbox, PS4) for  $29.99 at Amazon and  Target (also on Game Pass—normally $40).\n Immortals Fenyx Rising (Switch, PS4, PS5, Xbox) for  $24.99 at Amazon and  Best Buy (normally $33).\n    Guacamelee! 2 Complete (Xbox, digital) for  $4.49 at Microsoft (base game on Game Pass—normally $22).\n Metal Gear Solid V: The Phantom Pain (PS5) for  $4.99 at PlayStation Store (normally $20).\n   Halo: The Master Chief Collection (PC) for  $19.99 at Steam (also on Game Pass—normally $40).\n   Control: Ultimate Edition (PC) for  $15.99 at Steam (base game on Game Pass—normally $40).\n     Xbox Game Pass Ultimate 3-month membership for  $29.99 at Amazon and  Walmart (  $1 for new subscribers—normally $45).\n Nintendo Game &amp; Watch:   Super Mario Bros. handheld game console for  $39.99 at B&amp;H (normally $50).\n Hori Split Pad Pro handheld game controller for Nintendo Switch for  $39.99 at Amazon and  Walmart (normally $50).\n Razer Basilisk Ultimate wireless gaming mouse + charging dock + $50 Steam gift card for  $129.99 at Best Buy (normally $185).\n   Apple TV 4K (32GB) 4K HDR media streamer for  $169 at Amazon,  Sam&#39;s Club, and  Walmart (normally $179).\n  55-inch LG C1 (2021 model) 4K HDR OLED TV for  $1,496.99 at Amazon,  Target, and  Walmart (normally $1,775).\n 55-inch Sony A8H (2020 model) 4K HDR OLED TV for  $1,298 at Amazon (normally $1,650).\n   Apple AirPods Max Bluetooth noise-canceling headphones for  $489.99 at Amazon and  Best Buy (normally $549).\n Beats Flex Bluetooth in-ear headphones for  $39 at Amazon,  Target, and  Sam&#39;s Club (normally $45).\n SanDisk Extreme (500GB) portable external SSD for  $84.99 at Amazon,  Adorama, and  B&amp;H (normally $90).\n Eufy Indoor Cam 2K indoor security camera for  $29.99 at Amazon ( clip $4 coupon—normally $40).\n   Google Nest Learning Thermostat (3rd gen) smart thermostat for  $199 at Amazon,  Target, and  Walmart (normally $250).\n Google Nest Hello 1600x1200 smart video doorbell for  $149 at Target,  Sam&#39;s Club, and  Walmart (normally $229).\n   Anker PowerPort III Nano 20W USB-C GaN wall charger for  $13.59 at Amazon ( clip 20% coupon—normally $17).\n Prime members only:  Audible Premium Plus 4-month membership for  $27.80 ($6.95/month) at Amazon (auto-renews at $14.95/month—normally $60).\n Amazon Kindle Unlimited 6-month membership for  $47.86 at Amazon (24-month for  $143.80, 12-month for  $80.30—normally $60).\n Anova Precision Cooker Nano sous vide machine for  $99 at Amazon,  Target, and  The Home Depot (normally $120).", "posttime": "2021-06-30 03:37:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,游戏,apple,tech", "title": "今天的最佳科技交易：Apple Airpods Max，Xbox游戏通过终极，更多 ", "title_en": "Today’s best tech deals: Apple AirPods Max, Xbox Game Pass Ultimate, and more", "transed": 1, "url": "https://arstechnica.com/staff/2021/06/best-tech-deals-apple-airpods-max-xbox-game-pass-ultimate/", "via": "", "real_tags": ["交易", "游戏", "apple", "tech"]}, {"category": "", "categoryclass": "", "imagename": "e6f45044137827c840452972b1db0493.jpeg", "infoid": 1068717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "电子卷烟制造商Juul和北卡罗来纳州达成了国家索赔的解决方案，使其在攻击其“高度上瘾”产品到青年，点燃毒吐率的流行病。\n  虽然仍然否认任何不法行为，但Juul同意在六年的历程中达到北卡罗来纳州的总额为4000万美元。此外，该公司将遵循旨在阻止其产品的任何促销和销售到青少年的限制。根据该清单，JUUL不会使用可能呼吁青年的广告;它将避免大多数社交媒体广告和利用影响者的使用;它不会赞助体育和娱乐活动，如音乐会;它不会在其营销中使用35岁以下的任何人。该公司还同意通过运行“秘密购物者”计划来帮助执行年龄限制。 Juul将在每月焦油脚跟状态下送到21至27岁的卧底代表，至少50家商店，以检查零售商是否正在验证买家的年龄。\n 经过多年的指控和火热的批评，在其营销活动和广告中有故意和偏见的青少年的批评，这是批评者的批评，这是批评者所说的是直接责任青少年的飙升水平。根据去年提交的诉讼，Masachusetts律师毛皮Healey，Juul在2015年和2016年的营销活动包括在卡通网络的CartodnetWork.com和Nickelodeon的网站Nick.com和NickJr.com等网站上运行广告。 2019年夏天的国会证词透露，Juul代表在没有教师目前或父母同意的情况下向学校内部的青少年提供演示。\n     根据疾病控制和预防的中心，2011年在2011年的1.5％汇率从2011年的1.5％从1.5％上跃升 - 这意味着四名高中生中的一个以前在前30天内使用电子烟来使用电子烟在2019年调查的时候。在Juul广告和味道销售的镇静之后，2020年，2020年的百分比仅为20％，以及联邦政府将年龄限制增加到21次。\n 北卡罗来纳州律师将军Josh Stein认为沉降作为拖累青少年卷烟的另一步。\n “多年来，Juul针对年轻人，包括青少年，具有高度上瘾的电子烟。它点亮了火花，并煽动了我们的孩子中吐痰流行病的火焰 - 你可以在北卡罗来纳州的任何高中看，“斯坦在一份声明中说。 “这场胜利将在让孩子们的手中保持果汁产品，使其化学蒸汽从肺部保持一致，并将其尼古丁免于中毒并造成脑中。”\n 在自己的声明中，Juul表示，随着我们继续打击未成年的使用，并推动成年吸烟者的危害减少机会，我们持续努力重置公司及其与利益相关者的关系。继续通过行动获得信任。“ \n北卡罗来纳州的诉讼解决可能只是Juul的法律运动的开始。 其他几个国家（包括马萨诸塞州）向本公司提出了诉讼。 39州律师将军于2020年2月2020年2月以来，旨在调查公司的营销和产品。 此外，该公司面临数百名人身伤害诉讼，该诉讼已在加州联邦案件中合并。 ", "note_en": "Electronic cigarette maker Juul and the state of North Carolina have reached  a settlement over the state’s claims that Juul aggressively targeted its “highly addictive” products to youth, igniting a vaping epidemic.\n  While still denying any wrongdoing, Juul has agreed to pay North Carolina a total of $40 million over the course of six years. Additionally, the company will adhere to a list of restrictions aimed at blocking any promotion and sales of its products to youths. According to the list, Juul won’t use advertisements that may appeal to youth; it will avoid most social media advertising and the use of influencers; it won’t sponsor sports and entertainment events, like concerts; and it won’t use anyone under the age of 35 in its marketing. The company also agreed to help enforce age restrictions by running a “secret shopper” program. Juul will send undercover representatives, ages 21 to 27, into at least 50 stores throughout the Tar-Heel State per month to check whether retailers are verifying buyers’ ages.\n The settlement comes after years of allegations and fiery criticism that Juul intentionally and egregiously targeted adolescents in its marketing campaigns and advertisements, which critics say were directly responsible for soaring levels of vaping among teens. According to a lawsuit filed last year by Massachusetts Attorney General Maura Healey,  Juul’s marketing campaigns in 2015 and 2016 included running ads on websites such as Cartoon Network’s cartoonnetwork.com and Nickelodeon’s sites Nick.com and NickJr.com. And congressional testimony in summer 2019 revealed that  Juul representatives gave presentations to teens inside schools, without teachers present or parental consent.\n     According to the Centers for Disease Control and Prevention, use of e-cigarettes among high schoolers jumped from 1.5 percent in 2011 to 27.5 percent in 2019—meaning that more than one in four high school students reported using e-cigarettes within the previous 30 days at the time of the 2019 survey. That percentage fell just shy of 20 percent in 2020, following a crackdown in Juul advertising and sales of flavored products, as well as the federal government  increasing the age restriction to 21.\n North Carolina Attorney General Josh Stein sees the settlement as another step in dragging down e-cigarette use among teens.\n “For years, JUUL targeted young people, including teens, with its highly addictive e-cigarette. It lit the spark and fanned the flames of a vaping epidemic among our children–one that you can see in any high school in North Carolina,” Stein said in  a statement. “This win will go a long way in keeping JUUL products out of kids’ hands, keeping its chemical vapor out of their lungs, and keeping its nicotine from poisoning and addicting their brains.”\n In its own  statement, Juul said the settlement “is consistent with our ongoing effort to reset our company and its relationship with our stakeholders, as we continue to combat underage usage and advance the opportunity for harm reduction for adult smokers... We seek to continue to earn trust through action.”\n The resolution of the lawsuit with North Carolina is likely just the start of legal movement for Juul. Several other states, including Massachusetts, have filed lawsuits against the company. The Associated Press reports that  39 state attorneys general have also been working together since February 2020 to investigate the company’s marketing and products. In addition, the company faces hundreds of personal injury lawsuits, which have been consolidated in a California federal case.", "posttime": "2021-06-30 03:37:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "juul,targeting,青少年", "title": "Juul支付N.C. $ 40m，在点燃“流行病”之后停止针对孩子 ", "title_en": "Juul to pay N.C. $40M and stop targeting kids after igniting vaping “epidemic“", "transed": 1, "url": "https://arstechnica.com/science/2021/06/juul-to-pay-nc-40m-and-stop-targeting-kids-after-igniting-vaping-epidemic/", "via": "", "real_tags": ["juul", "targeting", "青少年"]}, {"category": "", "categoryclass": "", "imagename": "d8af81415c9cb51dc1fd67220a8c3abd.jpg", "infoid": 1068716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "William Kilmer正在与C5 Capital的合作伙伴，这是一个投资安全数据生态系统的风险投资基金。他以前是Mercato增长合作伙伴的经营合作伙伴，并担任CEO和摩托罗拉收购的董事长，Avinti（与M86安全合并），并担任M86安全首席营销官/首席战略官（由TrustWave收购） 。\n  麦肯锡发现，2012年至2018年，共投资交易的价值增加到1040亿美元。通过一些计数，有多达1,600名“非传统”投资者有助于在2021年资助风险投资。\n 非传统投资者的主要动机正在寻求更好的回报，并与VC基金一起投资是实现这一目标的好方法。最近的预票研究表明，共同投资基金明显优于传统资金。\n 研究表明，80％的投资者发现他们的共同投资优于私募股权基金投资，占率超过5％的价格超过了46％。与传统的私募股权或VC资金相比，投资者还受益于一般昂贵的费用结构。\n  共同投资者也可以通过分享投资风险来利润，这使所有投资者都受益，并建立忠诚和信任。由于这种投资需要一项动手的方法，投资者有机会与顶级赞助商密切合作 - 普遍合作伙伴（GPS） - 促进更深入的关系，并更好地了解GPS的投资策略和交易审查流程。对于新投资者来说，建立这些关系对于长期加强自己的投资技能至关重要。\n  替代投资者不是唯一受益于协同投资的人，这也是GPS的福音。他们通过与替代投资者合作获得更广泛的融资选择，他们可以更有效地利用自己的资金，并使用前瞻性投资。\n VCS也有其他好处：虽然共同投资LPS在业务中保持被动，但VC可以使用投票权来保护投资者权利并巩固决策。它还允许他们在留在多样化限制范围内，在任何公司中都要在任何公司中工作。 ", "note_en": "William Kilmer is managing partner with  C5 Capital, a venture capital fund investing in the secure data ecosystem. He was formerly an operating partner at Mercato Growth Partners and served as CEO and chairman of PublicEngines (acquired by Motorola), and Avinti (merged with M86 Security) and served as chief marketing officer/chief strategy officer of M86 Security (acquired by Trustwave).\n  McKinsey  found that the value of co-investment deals has more than doubled to $104 billion from 2012 to 2018. And by some counts, there are as many as  1,600 “nontraditional” investors helping to fund venture capital deals in 2021.\n The primary motivator for nontraditional investors is seeking better returns, and investing alongside VC funds is a great way to achieve that. A recent  Preqin study shows co-investing funds significantly outperform traditional funds.\n Research shows that 80% of investors found their co-investments outperforming private equity fund investments, with 46% outperforming by a margin of more than 5%. Investors also benefit from a generally less expensive fee structure compared to traditional private equity or VC funds.\n  Co-investors can also profit by sharing the investment risk, which benefits all investors and builds loyalty and trust. And because this kind of investing requires a hands-on approach, investors get the chance to work closely with top sponsors — the general partners (GPs) — to foster deeper relationships and gain a better understanding of the GPs’ investment strategies and deal review processes. For new investors, building these relationships is essential for strengthening their own investment skills in the long run.\n  Alternative investors aren’t the only ones who benefit from co-investing, it’s also a boon for GPs. They gain a broader array of funding options by partnering with alternative investors, and they can leverage their own capital more effectively with prospective investments.\n VCs have other benefits too: While co-investing LPs remain passive in the business, the VC can use that voting power to preserve investor rights and consolidate decision-making. It also allows them to put more money to work in any company while staying within diversification limits.", "posttime": "2021-06-30 03:37:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "充分利用,investing,投资", "title": "VCS如何充分利用LPS与LPS共同投资 ", "title_en": "\n\t\t\t\tHow VCs can get the most out of co-investing alongside LPs\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/how-vcs-can-get-the-most-out-of-co-investing-alongside-lps/", "via": "", "real_tags": ["充分利用", "investing", "投资"]}, {"category": "", "categoryclass": "", "imagename": "eea3e3f18884f89dd891eb99726c91da.jpg", "infoid": 1068715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自Facebook的单独平台建立了BulletIn  - 在其网站上，常见问题解答说，这是“使创建者能够以不完全依赖Facebook平台的方式发展观众。”您不需要Facebook帐户来订阅时事通讯，但公告依赖于Facebook的基础架构，包括使用Facebook支付购买高级订阅，并加入仅限用户组和实时音频室。\n 竞争对手喜欢时尚采取“脱离”的内容审核方法，允许任何人启动时事通讯。但是，目前在Facebook公告中的每个作家都被挑选为贡献。尽管如此，食肉仍然通过其争议的家喻户口计划来补贴防跨修辞，该专业程序委托特定作家在家中写作。因此，尽管其严重策划模型，但仍不会对困扰困扰的问题不会免疫。\n  公告上的作家初始板岩包括Malcom Grortwell，Mitch Abom，Eri​​n Andrews和Tan France  - 常见问题解答还指出，其Beta计划是美国以美国为中心的，目前只有两名国际作家（“我们希望更多地包含更多国际作家国际创造者在我们的Beta计划发布后，“Bulletin说。）Facebook正在向其作家支付他们的贡献，到目前为止，并不计划削减他们的利润。如果作家选择关闭平台，他们将有能力与他们一起获取用户列表。 ", "note_en": "Bulletin is built on a separate platform from Facebook — on its  website, the FAQ states that this is to “enable creators to grow their audience in ways that are not exclusively dependent on the Facebook platform.” You don’t need a Facebook account to subscribe to a newsletter, but Bulletin relies on Facebook’s infrastructure, including the use of Facebook Pay to purchase premium subscriptions and join subscriber-only groups and live audio rooms.\n Competitors like Substack take a “ hands-off” approach to content moderation, allowing anyone to start a newsletter. But every writer currently on Facebook’s Bulletin was hand-picked to contribute. Still, Substack has received scrutiny for  subsidizing anti-trans rhetoric through its controversial  Substack Pro program, which commissioned particular writers to write on Substack. So, Bulletin won’t be immune to the issues that plague Substack despite its heavily curated model.\n  The initial slate of writers on Bulletin includes Malcom Gladwell, Mitch Albom, Erin Andrews, and Tan France — the FAQ also notes that its beta program is US-centric, with only two international writers at the moment (“We will look to include more international creators after our beta program launch,” Bulletin says.) Facebook is  paying its writers up front for their contributions, and so far, doesn’t plan to take a cut of their profits. If writers choose to move off the platform, they will have the ability to take their subscriber lists with them.", "posttime": "2021-06-30 03:36:48", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,时事,newsletter", "title": "Facebook的时事通讯平台公告现已直播 ", "title_en": "\n\t\t\t\tFacebook’s newsletter platform Bulletin is now live\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/29/facebooks-newsletter-platform-bulletin-is-now-live/", "via": "", "real_tags": ["facebook", "时事"]}, {"category": "", "categoryclass": "", "imagename": "cd4c047af4c6d234061c11294c5e9490.jpg", "infoid": 1068714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英特尔推迟了其下一代Xeon可扩展CPU，代码名为Sapphire Rapids的Code-Pation-Rapids，并表示将在明年至少4月开始起步升级。\n 加利福尼亚州圣克拉拉公司披露了英特尔Xeon和记忆集团负责人的Lisa Spelman的星期二博客文章的延迟，他们嘲笑CPU的新微型架构以及Xeon阵容将新的两个功能：下一代深度学习升压和称为英特尔数据流加速器的加速引擎。\n  Spelman表示，英特尔正在延迟蓝宝石急流，最近推出的冰湖服务器处理器的10纳米后继者，因为验证CPU需要额外的时间。\n “鉴于蓝宝石Rapids中的增强尺寸，我们在生产发布之前纳入了额外的验证时间，这将简化客户和合作伙伴的部署过程。基于这一点，我们现在预计蓝宝石急流在2022年的第一季度将在2022年的第一季度，在2022年的第二季度开始，“Spelman写道。\n 在去年的多个陈述中，英特尔表示，它旨在在2021年开始发运蓝宝石急流，但近几个月开始搬家，新的首席执行官Pat Gelsinger在3月份表示，英特尔旨在为CPU进入生产“周围”年底。”在英特尔的Computex 2021在本月初的主题演讲中，Spelman表示，Sapphire Rapids已设置为2022年推出。\n 尚不清楚生产延迟的挫折是多少，但英特尔的处理器使用10纳米和7纳米这样的下一代制造工艺的处理器面临多年来的多个延误，这为竞争对手AMD和公司开发了额外的优势。基于CPU。这有助于AMD将X86 CPU股份增长到服务器市场的8.9％。 AMD在一年内，也已经在世界上第500强超级计算机的份额进行了四倍。\n 延误是2月首席执行官盖尔格林格的一个主要原因，因为他努力将公司带回“无耻辱的领导”，就已经为本公司执行了最重要的优先事项。 \n“客户必须能够依靠英特尔为其产品及其未来的策略，”他在2月份的一封信中表示。 “虽然我们必须设定积极的目标来重新获得股权和领导力，但它们也必须可以实现并以最高质量完成。” ", "note_en": "Intel has delayed production of its next-generation Xeon Scalable CPUs, code-named Sapphire Rapids, to the first quarter of 2022 and said it will start ramping shipments by at least April of next year.\n The Santa Clara, Calif.-based company disclosed the delay in a Tuesday blog post by Lisa Spelman, head of Intel’s Xeon and Memory Group, who teased the CPU’s new microarchitecture as well as two features that will be new to the Xeon lineup: the next generation of Deep Learning Boost and an acceleration engine called Intel Data Streaming Accelerator.\n  Spelman said Intel is delaying Sapphire Rapids, the 10-nanometer successor to the recently launched  Ice Lake server processors, because of extra time needed to validate the CPU.\n “Given the breadth of enhancements in Sapphire Rapids, we are incorporating additional validation time prior to the production release, which will streamline the deployment process for our customers and partners. Based on this, we now expect Sapphire Rapids to be in production in the first quarter of 2022, with ramp beginning in the second quarter of 2022,” Spelman wrote.\n In multiple  statements last year, Intel said it was aiming to start shipping Sapphire Rapids in 2021, but the goalposts started to move in recent months, with new CEO Pat Gelsinger saying in March that Intel was aiming for the CPU to enter production “around the end of the year.” In Intel’s Computex 2021 keynote at the beginning of this month, Spelman said Sapphire Rapids was set for a 2022 launch.\n It’s not clear how much of a setback the production delay is, but Intel’s processors using next-generation manufacturing processes like 10 nanometer and 7 nanometer have faced multiple delays over the years, which has given an extra edge to rival AMD and companies developing Arm-based CPUs. That has helped AMD  grow its x86 CPU share in the server market to 8.9 percent. AMD has also quadrupled its share of the top 500 supercomputers in the world in a matter of one year.\n The delays are a major reason why Gelsinger, who became CEO in February, has made execution a  top priority for the company as he works to bring the company back to “unquestioned leadership.”\n “Customers must be able to rely on Intel for their products and their strategies for the future,” he said in a letter to employees in February. “While we must set aggressive targets to regain share and leadership, they must also be achievable and done with the highest quality.”", "posttime": "2021-06-30 03:29:00", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "英特尔,延迟,delays", "title": "英特尔延迟蓝宝石急流Xeon CPU生产到Q1 2022 ", "title_en": "Intel Delays Sapphire Rapids Xeon CPU Production To Q1 2022", "transed": 1, "url": "https://www.crn.com/news/components-peripherals/intel-delays-sapphire-rapids-xeon-cpu-production-to-q1-2022", "via": "", "real_tags": ["英特尔", "延迟", "delays"]}, {"category": "", "categoryclass": "", "imagename": "e14e3eefdde2c2cf58d7b88825a4f49d.png", "infoid": 1068713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这种情况下，让我们说你用脸部发出彩票票......  赢得1/1000的获胜机会的预期价值为一美分。 用户可以  付款：银行发出每个数字硬币，并在重新开始时再次处理它  事实证明是一个胜利者。 我们还致电收件人＆＃34;供应商，＆＃34; 自从此以来  其中用户想要支付供应商一分钱以下载网页  是正在冲浪网络的用户，并希望支付一些费用  我们曾经期望看到两个w的哈希值。）在这里 \n在任何情况下，票的机会是一个获胜机票必须清楚  发行人和收件人，以便他们可以计算预期的值  足以让银行付款的费用是小的  门票时间的价值是票证将成为a的概率  银行将收件人支付票的面值，并为用户收费＆＃39; s  考虑到那么多。 在某些情况下，银行可能是付款人和发行人，以及  该银行，银行将支付胜利彩票票据 \n门票，但净效应是向接收者提供证据，如果是  协议。 在某些情况下，它可能会增加，在其他情况下它可能很大  其他付款协议的成本 - 他们仍然必须为每个人做一点工作  发行人有风险，太多人会成为赢家，而且  收件人的风险太少的是赢家。 但  通过发布彩票票价的预期价值100美元，面值为10美元  超过50美元不到3％，他支付超过200美元的可能性较少 \n发行人也是买方。 他与他的银行有一个签名的凭证  （付款人）说出他的账户是良好的身体，并且他可能是 -  包括在彩票本身。 此哈希值被提供给发行人  他喜欢，支付商品和服务。 这些付款可以被视为＆＃34; prob-  有一种风险，用户可能会发出太多胜利的票数，并且是  无法从他的帐户支付奖金。 应该如何处理这种风险？  如果发行人缺乏与付款人缺乏足够的资金，可能无法获得报酬。 在这种情况下 \n付款人不会在下次期间重新认证发行人。 这个模式有效  坏发行者会随着时间的推移而得到了一些东西。 如果他，供应商可能会非常高兴  可以收集他的90％的胜利门票。 随着时间的推移，他可以调整价格以覆盖  这种失败。 供应商对供应商进行在线验证是不值得的  用户也有一些风险，他可能会发出太多的获胜  门票，因此为他的＆＃34筹集了一项大账单;微挖掘。＆＃34; 如上所述，  由于发行人可以在他的意愿创造多种彩票，因此它是批准的 \nAdi Shamir和我自己的Payword [6]。 用户向给定供应商A提交  可以对买方必须制造的供应商进行付款序列  然后在买方的第i票和第39票; S链条，具有价值xi，是一个获胜票  只有（x〜Rood 1000）与（Wi Rood 1000）相同。 通过这种方式，供应商  在一个变体中，银行将发出门票，或批准一批门票  买方将为多个供应商提供相同的票证，如此＆＃34;双重  花。＆＃34; 与买方发出几张门票，这并不不同 \n如果银行创造了胜利号码，那么银行和危险会有风险  如果获胜号码的创造者是任何可能是的，则会出现此问题  虽然可以保持很小; 用户需要为每个签名只签名  正确的是，微押服务的银行费用可能会很大  一些获奖者将结果毫无价值，但仅通过与发行人交往  如果他们收到的所有内容，我们将通过运行彩票来赚钱  返回访问网页。 规避这一索赔的方法将是 \n如果供应商揭示他收到他的胜利号码，那么它最简单  如果且仅当用户＆＃39;对中间人的票证才能赢得胜利者  向发行人和银行，并以惯常运行支付协议，除此之外  不是新的。 实际上，这个概念是概率基础的基本主题，  两项专利的物质[7,8]由迈克尔·罗斯德，并在一个纸条中讨论 ", "note_en": "In this scenario, let’s say you issue a lottery ticket with a face ...\n        with    a    1/1000  chance of   winning   has    an  expected   value of   one   cent.   A    user   can\n   payment:   the   bank   issues    each   digital   coin,   and   processes it    again  when  it   is   re-\n                           turns    out   to  be   a    winner.    We   also   call   the  recipient   the   &#34;vendor,&#34;   since   the\n tion   wherein  a   user wants  to   pay  a    vendor  a   penny  for downloading  a    web page\n         is   the   user  who  is   surfing the  web   and  and  wants    to  pay  for  some\n                     we    don&#39;t    ever   expect  to   see   two   w    values   with    the    same   hash    value.)    Here\n                In  any  case,  the   chance  of   the  ticket  being  a    winning ticket  must  be  clear  to  both\n the  issuer  and the  recipient,   so  that  they  can calculate  the   expected  value  of   the\n enough   so   that   the   cost    of  processing  the   payment  by  the   bank   is    small   com-\n    value   of  the  ticket   times   the   probability   that the   ticket   will   turn    out   to   be    a\n      the   bank  pays the   recipient  the  face   value   of   the   ticket,  and   charges   the   user&#39;s\n account  that  much.   In  some   cases,   a    bank  might be   both  payer  and  issuer,   and\n      the   bank,  and  that the  bank  will  pay  for  winning  lottery  tickets  issued  by  that\n   tickets,   but   the    net    effect   is    to    provide   evidence  to  the    recipient    that,    if  the\n   ment   protocols.   In   some   cases   it    may   add   little,   in   other  cases    it   may  greatly\n      the  costs  of   other  payment   protocols--they   still  have  to  do  a   little  work   for  each\n   there   is a   risk   to   the   issuer   that   too   many   of   them   will  turn   out   to   be  winners,  and\n a   risk   to  the   recipient(s)   that  too  few  of  them will   turn  out  to   be  winners.   But\n      with  an expected   worth  of   $100   by   issuing   lottery   tickets   with   a   face   value   of   $10\n  than  $50   is  less   than  3%,   and  the  probability   that  he  pays more   than   $200   is  less\n Here   the   issuer   is   also   the   buyer.   He   has   a   signed   credential  from   his   bank\n (the   payer)    stating  that   his   account   is    in   good   standing,    and   that   he    may  is-\n      to  include  in  the  lottery   ticket  itself.  This  hash  value  is   given to  the issuer\n     he  likes,   to  pay   for  goods   and  services.    These  payments   may   be  viewed   as   &#34;prob-\n  There   is    a    risk   that    the   user    may  issue   too   many  winning   tickets,  and   be\n unable   to   pay   for   the   winnings   from   his  account.   How   should   this   risk   be  handled?\n  may not  get  paid  if   the  issuer   lacks  sufficient   funds  with  the  payer.  In this   case\n the   payer   will   not   re-certify   the  issuer   for   the   next time   period.  This  model   works\n    bad  issuers  will   get weeded   out  over   time.  A   vendor   may   be  perfectly   happy   if   he\n can   collect   on  90%  of   his   winning   tickets.  Over   time,  he  can   adjust   prices  to  cover\n such  lossage.   It  is   not  worthwhile   for  the  vendor  to  do an on-line  verification   for\n          There  is  also  some   risk  to   the  user   that  he  might   be  issuing   too   many   winning\n tickets,  and  so  run  up  a   large bill   for  his    &#34;micropayments.&#34;   As   noted  above,  the\n        Since  the   issuer  may   create  as   many   lottery   tickets  as  he  wishes,  it   is   appro-\n    PayWord  by   Adi    Shamir   and   myself  [6].  A    user  commits   to    a    given   vendor  a\n sequence   of  payments  can  be    made   to    a    vendor   where   the   buyer  has   to   make\n       Then   the   i-th   ticket   in   the   buyer&#39;s   chain,  with  value   xi,   is    a    winning  ticket   if\n and  only  if  (x~   rood   1000)   is  the  same   as   (wi    rood  1000).   In  this  way,   the  vendor\n     In   a    variation,  the   bank would  issue   the  tickets,   or   authorize  a    batch of   tickets\n    the    buyer   will    give   the    same  ticket   to   more   than   one    vendor,   and    so    &#34;double\n spend.&#34;   This  is  not  so   different   from   having   the  buyer   issue  several   tickets  in  the\n         If   the   bank   creates   the   winning   number,   then  there   is  a   risk  that   the   bank  and\n    This   issue   arises   if  the  creator  of   the  winning  number   is   anyone   that   might  be\n tions    can   be  kept   very   small;    the    user   needs    to   sign  just   one  message   for   each\n  to  being  right,   and   the  bank  fees for  micropayment  service   are  likely   to  be  much\n     some   winners  will  turn  out to be   worthless,  but  by   dealing  only  with  issuers with\n is   going   to  make  money   by  running  a   lottery   of   our  sort   if   all  they  are receive  in\n return   is  access   to  web   pages.  The  way   to  circumvent   this  claim   would   be  to  have\n                 it   is    simplest  if  the   vendor   reveals   the   winning  number   w    after he   receives   his\n  vendor  can  be   made  winning   if  and  only   if   the  user&#39;s  ticket  to  the  intermediary\n    to   the   issuer  and   the   bank,  and  to   run   the  payment   protocol   as  usual,   except  that\n is  not   new.  Indeed,   this   notion   is  a   basic  theme   in  the   foundations   of   probability,\n        matter   of   two  patents  [7,8]  by   Michael   Rossides,  and  is   discussed  in   a   note   in  the", "posttime": "2021-06-30 03:28:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "彩票,lottery,支付", "title": "电子彩票门票作为微挖（1997） ", "title_en": "Electronic lottery tickets as micropayments (1997)", "transed": 1, "url": "https://fermatslibrary.com/s/electronic-lottery-tickets-as-micropayments", "via": "", "real_tags": ["彩票", "lottery", "支付"]}, {"category": "", "categoryclass": "", "imagename": "7884d3f3a5e2101c5991c7ddd95fbc62.jpg", "infoid": 1068712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "6月25日伦敦（路透社） - 博鳌预计美国通货膨胀率保持高达两到四年，以至于对其在暂时的上升而上升，并表示只有金融市场崩盘将阻止中央银行在未来六个月内收紧政策。\n 它是＆＃34;令人着迷于刺激，经济增长，资产/商品/住房通货膨胀（AS）被视为永久性的暂时性和＃34;，投资银行＆＃39;首脑博士·哈特纳特在一份注释时表示星期五。\n Hartnett认为通货膨胀将在未来2  -  4年内留在2％-4％的范围内。美国通胀在过去的100年里，2010年的平均率为3％，2％在2020年，迄今为止，在2021年，迄今为止，在2021年的年度增长率为8％。\n 全球股票在读取五月核心个人消费支出指数方面持有近几小时的纪录，这是美联储密切履行的通货膨胀率。衡量标准估计同比增长3.4％。\n 美国联邦储备董事长Jerome Powell周二发誓，只有对即将到来的通货膨胀的恐惧，才能超越超越利率。在令人援助的投资者神经之后，在上周的令人叹为高的官员认为利率将在2023年，可能比预期的一年来，这项评论被视为抚慰的投资者神经。\n BOFA客户仍然大量投资股票，现金分配远低于11.2％的长期平均值。\n 在本周到星期三，投资者将70亿美元的股票融入股票和99亿美元进入债券基金，同时从现金资金中拉535亿美元，使用EPFR数据计算BOFA。 \n在股票中，新兴市场资金出现了16亿美元的流出，自2020年9月以来最大。  由于2021年上半年绘图，哈特尼特表示，较高的通货膨胀，开头的中央银行和较弱的增长是在下半场观察的关键主题。 ", "note_en": "LONDON, June 25 (Reuters) - BofA expects U.S. inflation to remain elevated for two to four years, against a rising perception of it being transitory, and said that only a financial market crash would prevent central banks from tightening policy in the next six months.\n It was &#34;fascinating so many deem inflation as transitory when stimulus, economic growth, asset/commodity/housing inflations (are) deemed permanent&#34;, the investment bank&#39;s top strategist Michael Hartnett said in a note on Friday.\n Hartnett thinks inflation will remain in the 2%-4% range over the next 2-4 years. U.S. inflation has averaged 3% in the past 100 years, 2% in the 2010s, and 1% in 2020, but it has been annualising at 8% so far in 2021, Bofa said in the note.\n Global stocks were holding near record highs hours ahead of the reading of May core personal consumption expenditures index, an inflation gauge tracked closely by the Fed. The gauge is estimated to rise 3.4% year-on-year.\n U.S. Federal Reserve Chairman Jerome Powell vowed on Tuesday not to raise interest rates too quickly based only on the fear of coming inflation. The comments were seen as a move to soothe investor nerves after a hawkish monetary policy meeting last week suggested officials believed interest rates would rise as soon as 2023, perhaps a year earlier than anticipated.\n BofA clients were still heavily invested in equities, with cash allocations well below long-term averages at 11.2%.\n In the week to Wednesday, investors pumped $7 billion into equities and $9.9 billion into bond funds, while pulling $53.5 billion from cash funds, BofA calculated, using EPFR data.\n Within equities, emerging market funds saw outflows of $1.6 billion - the largest since September 2020.\n As the first half of 2021 is drawing to close, Hartnett said higher inflation, hawkish central banks and weaker growth are the key themes to watch out for in the second half.", "posttime": "2021-06-30 03:27:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,通胀,remain,股票", "title": "美国，通胀可能持续高达四年 -  BOFA ", "title_en": "U.S. inflation likely to remain elevated for up to four years – BofA", "transed": 1, "url": "https://www.reuters.com/business/global-markets-bofa-urgent-2021-06-25/", "via": "", "real_tags": ["美国", "通胀", "remain", "股票"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2021-22 NASA软件目录提供了数百种新软件程序，您可以免费下载，可用于各种技术应用。 FAQ PAGE软件联系人 ", "note_en": "The 2021-22 NASA Software Catalog offers hundreds of new software programs you can download for free to use in a wide variety of technical applications.     FAQ Page   Software Contacts", "posttime": "2021-06-30 03:27:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国宇航局,软件,nasa,美国,software", "title": "美国宇航局的软件目录 ", "title_en": "NASA's Software Catalog", "transed": 1, "url": "https://software.nasa.gov/", "via": "", "real_tags": ["美国宇航局", "软件", "nasa", "美国", "software"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1068710, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "EFAIL攻击表明，安全电子邮件是难以实现的可用性的改进可能导致关键的SecurityVulnersabilities。在EFAIL的情况下，攻击者可以利用显示损坏的消息的邮寄，以删除邮件的邮件。\n 虽然EFAIL的研究人员在他们的回应中衡量，但其他的，就像托马斯Ptacek在2019年的PGPProbly的PGPProbly中一样，并且停止使用2020的加密电子邮件，为人们放弃OpenPGP，并放弃安全电子邮件.Instead，他们争辩，人们应该像信号一样使用安全的信使。\n 托马斯的更大点很简单。他说，每个人都应该“倾斜加密电子邮件”。它未能保护具有强大的人，以及其他使用它的人只是在播下：\n 普通人不会兑换任何强大的越人令人费意阅读的电子邮件，以及那些人，加密电子邮件是LARP安全性的。无论这些恐怖都是安全的，这无关紧要，这就是为什么他们加密如此贪婪。\n  正如我在下面详细讨论的那样，有一个相当数量的证据表明，迫切需要的人可以成功使用OpenPGP。最近的学术论文，当最近的联系是强大的：在巴拿马文件的情况下，安全合作，看着参与巴拿马文件的记者的第四项安全做法。当作者发现，超过一年，数百人，数百人口在项目中成功使用OpenPGP成功合作。\n  如果用户失去访问在线帐户，大多数服务都有一个Ancount恢复机制，可以让用户返回.USUSALY，这通过将电子邮件发送给用户使用AONE-TIME密码。\n 如果攻击者会妥协用户的电子邮件帐户，它们可以使用相同的机制来获得使用电子邮件帐户作为信任根的用户服务器的用户帐户的控制。在实践中，这是大多数用户的在线帐户。不幸的是，双因素身份验证仅提供有限的保护。 IT ISOPT-IN并通常使用电话号码，这很容易被劫持。 \n如果要加密帐户恢复电子邮件，则信任锚将是加密密钥。由于加密密钥被储存器用户的计算机，这将击败这种类型的攻击。\n 如果公司将在数字签名电子邮件中，那么可以利用这一角度来更好地检测网络钓鱼。每次使用用户需要被教导来寻找微妙的线索嘟Tet这种类型的攻击。这占据了一个高位认知负债，并违反了克鲁格的第一条可用性法律：“不要想到。”\n 即使安全消息传递系统提供所有所需的Workflowsthat业务用户，也需要 - 轶事证据表明他们没有 - 他们是寨花园。此架构具有Threemajor问题，推送业务返回电子邮件：\n 由于一些外部通信合作伙伴将不可避免地ose不同，不兼容的系统，因此一些通信将发生在共同的分母，电子邮件中。\n 寨花园抑制了自定义工具的创作。商业需要遵守本地立法。在ManyJurisdictions中，公司需要归档和搜索消息。类似信号的服务不支持这一点，因此不是Anoption。\n 围墙花园不仅将业务锁定到一个程序中，是一个协议。这使得切换系统非常昂贵。这类依赖性对于禁用通信工具特别不可取。\n 有时电子邮件更方便。编写和SendingLong形式内容使用电子邮件应用程序更轻松。所以发货文件。此外，虽然信号的群聊特征是非常符合的，但需要设置并撕开;它通常更容易发送给少数人的电子邮件。 \n其他时候电子邮件是唯一的选项。大多数人在手机上安装了几年的客户。尽管如此，即使是小组，唯一的常见消息传递平台也不罕见。\n 这并不是说OpenPGP，它的各种实现以及集成它没有问题的申请。他们是这样。 TheOpenPGP工作组需要完成加密刷新和最后标准化AEAD。我们需要为具有强大的对手的人建造的电子邮件客户端，为具有强大的攻击性的人。，我们需要流行的邮件客户，以采用普通用户的信号来采用机会主义的加密。\n 确实，OpenPGP已经存在了三十年。但是，没有收入来自Whensapp的Whingsappers的5000万美元，Gnupg像Facebook和Stripe这样的主要捐助者已经减少了数量级数：每年5万美元。这几乎没有足以维持Gnupg从不介意UX研究。\n   OpenPGP的批评者经常引用为什么Johnny无法加密的学习，以及跟进文件，如为什么Johnny仍然，仍然将其作为证据表明OpenPGP无法使用。然而，Borradaile等人的最新纵向研究，动机的Canencrypt（即使是PGP）也表明那些有直接能够成功使用PGP的人：\n 在这项研究中，我们问：在长期内有具体隐私的用户如何遵循旨在克服PGP电子邮件加密的表征的可用性问题的培训？ ......\n [W]发现我们的受访者使用的长期PGP使用率为50％，似乎抵消了较差的可读性，未覆盖均衡性研究。事实上，在我们原来的PGP电子邮件工作坊中，AllBut一个参与者能够成功发送和接收加密电子邮件。\n 这些结果与2017年研究有数百名参与者在巴拿马文件报告的人的安全性研究中，当最薄弱的环节强劲时：在巴拿马文件的情况下证券规定。 McGregor Etal。写信给他们 \n感到惊讶地认为，项目领导者能够采取严格的安全要求 - 这种ASTWO-FIGIC认证和PGP的使用 - 尽管有的话，但是参与者以前已经使用过这些技术。\n 这些观察结果与我自己的采访系列与2017年举行的采访系列与使用Gnupg的活动家和组织相匹配。很多用户的iFound有定义使OpenPGP'SProtection急剧实实的时刻。例如，她说：在菲律宾的一位数字安全培训师的访谈中，她说：\n 在我的一个社区和网络中，我讨厌 - 让我只是说这是一场选举，在东南亚的一个干净的选举制作，那里的那种运动的领导人是逮捕或没有被捕，[但]被拘留，然后拘留，然后是拘留和所有的人。我们不得不将它们远离未征求的渠道，因为它们的通信是它们的沟通比安全的聊天软件更具实质性。他们需要交换文档和文件并希望冗长的邮件。我们确实让他们回到电子邮件的主要形式的通信，然后是GPG来保护这一主要形式的沟通。那真的有效。它允许他们创建并呼吁大规模示威活动。\n 这些成功并没有借口OpenPGP的可用性差。在Chontrary上，研究突出了用户有用的用户可以使用OpenPGP，尽管其可用性差。\n  根据我的密码经理，我在网站上创建了一个帐户。几乎所有这些服务的一件事都有Incommon是他们需要电子邮件地址来创建帐户。\n 这些服务使用我的电子邮件地址来更新我关于Apurchase的状态。他们有时会告诉我他们认为我有趣的东西（“嘿尼尔！你上周买了一支冰箱，牧师十几块其他冰箱你可能有兴趣加入你的Collection！”）。而且，他们使用我的电子邮件地址进行帐户恢复。\n  帐户恢复通常如下工作。如果我忘记了MyPassword，我可以使用该服务的帐户恢复工具来请求eAmail。 （Facebook的“帐户恢复”工具如图所示。）电子邮件包含一次性密码，通常嵌入Alink。当我遵循链接时，我发送一次性密码后退服务，从而证明我控制电子邮件地址，以及所以账户的合法所有者。 \n通过允许我使用我的电子邮件地址恢复我的帐户，Theservice将我的电子邮件帐户视为信任锚。由于许多索斯服务有敏感的个人和财务信息，意思是我与之互动的人，我必须保护它。\n 不幸的是，电子邮件帐户定期接管。 Tohelp保护用户，更大的服务现在提供了两种因素。使用双工厂身份验证提高了屏障，但它具有今天部署的两个主要弱点。\n 双工厂认证的第一个弱点是它是可选的。对于公众，银行是我所知的唯一服务，它是强制性的。通过制作两个因素的特朗兴奋剂选择，我们保证它仍然很大程度上未使用。\n Jared Spool报告在用户更改他们的设置？无论它们有多糟糕，95％的用户都不会改变默认设置。福林，早期版本的Microsoft Word没有启用Autosave.When Jared的团队要求参与者为什么他们没有启用它，他们相应的是开发人员必须有一个不错的理由而不是令人发牢骚。\n 在最近在usenix的谜大会展示中，谷歌工程师Grzegorz Milka的解剖学，谷歌工程师Grzegorz Milka确认，这是2011年GoogleIntroduced的双因素认证。截至2018年，占Google用户的10％覆盖了谷歌的用户。随着这种采用水平，几乎令人惊讶的是，谷歌尚未被杀死。而且，谷歌，因为它拥有如此多的用户数据，可能是一个异常值：其他因素认证，几乎肯定的采用水平。\n 第二个弱点是典型的第二因素是电话。使用电话号码作为第二个因素的大型安德拉达特今天有自己的大家拥有自己的;不需要usersto购买并围绕加密狗携带。但是，电话号码是suscepibleto sim交换。克雷布斯安全解释了这攻击的艰难程度：\n [A]最近的法庭案件和不幸的发展展示了无线行业今天的悲惨现实，即今天对这个重要的国家资源，诈骗者，腐败的员工和平原老本公司进行了控制。 \n互联网充满了来自普通用户的轶事，就像我被洗过的普通用户，由John Biggs：\n 截至8月22日星期二在大约晚上9点，黑客将他或她的Ownsim卡与我的，大概是通过呼叫T-Mobile。反过来，这将关闭网络服务，稍后将网络服务关闭，允许黑客更改我的大部分Gmail密码，我的脸庞广告，我代表我的文字。所有的双因素通知，默认情况下，到我的电话号码，所以我收到的任何一个人都没有在两分钟内锁定了我的数字生活。\n 简而言之，控制电话号码作为第二个因子只提供了Minimal添加保护。\n Wecould而不是使用用户的电子邮件帐户作为信任锚，而不是使用加密密钥。当服务需要向用户发送重要数据时，服务可以加密它。然后即使众所周知的电子邮件帐户和电话号码被劫持，攻击者将能够利用它们劫持用户的其他服务的账户。要保护用户免受exfiltratethe秘密关键材料的本地攻击，秘密密钥材料可以存储在应对的执行环境（TEE）中，如TPM或IOS的TrustedEnclave。这具有类似于电话号码的优势，如电话节目已经有了一个发球台。\n 图：模拟下拉目，允许用户在浏览器中选择OpenPGP密钥。单击键将自动将公钥插入表单中。\n 这个上载加密密钥的UX不必存在于vasive。当用户创建帐户时，帐户创建表单也会提示OpenPGP密钥。如果我们教授Web浏览器如何Tofind OpenPGP键，那么用户甚至没有复制和粘贴文本的ABLOCK，但可以只需从下拉下来选择一个键，如上图所示。\n   我知道的大多数人每周都收到一些网络钓鱼电子邮件。许多用户和大公司甚至培养他们的员工来检测如此，他们通过发送伪造的邮件定期测试员工。如果员工没有报告网络钓鱼电子邮件，那么他们可能会收到额外的培训，这被视为Apunishment。 \n必须继续寻找网络钓鱼邮件的努力提高了掌握的认知负担。曼彻斯特警察胜利克服了一辆农机：\n 曼彻斯特市中心的官员在估计有26,000名欺诈性文本成为一天的欺诈手段之后在一个Hotelyday被逮捕了一个男人[爱马仕]在一天内发送......在错过的交付后询问银行详细信息。\n  检查电子邮件已发送的地址。通过使用您的mouseto悬停在发件人名称上或右键单击，您将能够将电子邮件地址放在它背后。欺诈者经常拥有奇异的电子邮件成像或与他们所造成的公司完全匹配的奇异的电子邮件成套水手。\n 看看谁发送了谁。经常欺诈者将使用anigpersonal问候语，例如“嗨”或“亲爱的客户”。\n 不要感到压力。诈骗电子邮件经常声称您现在采取行动的时间表或紧迫感，但令人困难。花时间来制作需要的检查。\n 注意拼写和语法错误。另外还远远超过网站链接等事物的变化。这可能看起来类似于公司的真实网站，但即使是单身差异也意味着它是导致您到不同的网站。\n 想想您是否期待该公司的电子邮件。 ifit从蓝色中，它可能是一个骗局。 \n而且，我们可以。如果公司将数字签名电子邮件，那么可以检测何时缺少签名，或者无法对AKEY进行身份验证，或者在第一次使用密钥。\n  即使他们想要，如果企业可以贬低以支持安全的消息传递解决方案，则不清楚。企业需要与其他企业和客户融合，而虽然电子邮件已被ISFederated，几乎每个人都有电子邮件地址，但有许多人的安全消息解决方案以及所有流行的系统。只要许多不同的安全消息都没有互操作，企业将继续使用电子邮件。\n 这提出了另一个问题：因为受欢迎的安全消息组织是所有寨花园，因此转移关键通讯ToSomething，如信号不仅将公司锁定到一个特定的产品中，还可以是一个协议。这使得Secure Messaging System变得越来越令人生意，这使得它甚至更难开启。\n 但它不清楚企业可以用安全解决方案取代电子邮件。企业需要遵守法规。如果安全消息传递应用程序不支持所需功能，并且由于关闭系统无法添加该功能，则安全消息传递甚至是一个选项。\n HIPAA代表健康保险便携性和问斗。它是美国的一系列法律，解决了必须处理的健康信息。 HIPAA Journal解释了一些要求电子方式发送受保护的健康信息。特别地，必须使用端到端加密发送数据，并且需要保留和所有通信。\n 类似的监管适用于美国的其他行业。电子邮件归档软件的Intraadyn amaker解释说，在美国\n [i] 2006年，法律通过了授权数据归档。根据Totht的电子邮件归档法规，您的业务需求特曼绘画电子记录。这意味着当他们不再是目前相关时，你不能只需删除;他们需要渴望长期访问。法律要求您知道存储该数据的位置，以便能够通过它进行搜索，并能够按需重转它。电子邮件存档不仅仅是为了方便，您发现数据稍后会帮助您;这是一个高尚的必要性。 \n法律也谨慎注意，简单地存储数据所缺少。您不能使用随机系统，让您的电子邮件堆入其中，并希望您从未有过的理由搜索过。相反，法律指出，您必须知道系统操作，能够有效地使用它，并能够快速生成那些电子邮件。 “我不知道如何达到它”或“它在搜索中拉出”不是一个可接受的借口。\n 业务似乎不可避免地将继续使用电子邮件。 INTHAT案例，那么提供它可以最好的技术保护是明智的。我们可以更好地比跳跃加密更好。\n  尽管有安全的消息传递的流行度，但仍有许多正常的理由更喜欢电子邮件。安全信使在手机上的实时聊天进行了优化。因此，一些工作流程是简单的电子邮件客户端。此外，由于所有受欢迎的Securemessengers都是围墙花园，因此他们不太可能完全透明电子邮件的主导地位，并且电子邮件将仍将成为烛光状态。\n 图：默认情况下，信号＆＃39; s桌面客户端的输入区域限制为4.5行文本。\n 虽然我通常更喜欢使用实时聊天系统来发送送氧邮件，但是电子邮件仍然存在若干情况，否则是用户体验的透视。\n 首先，使用aproper文本编辑器写长表单内容比使用大多数医生提供的微小文本输入字段更方便。该图显示了Signal'SDesktop客户端中的文本输入字段（v5.3.0）。默认情况下只有四行和半行的文本播放。\n 另一个可用性问题与交换文件有关。虽然ITIS使用安全的信使发送文件相对简单，但大多数人只有在他们的电话上安装的消息传递应用程序，往往需要从用户的Desktop或笔记本电脑传输到邮件。轶事证据表明，这是使用电子邮件的常熟，或像Dropbox这样的文件传输服务。 \n启动短期的组线程也更容易使用电子邮件。例如，徽章首先是创建一个组。如果群组留在周围，那么它会追溯对话概述。如果小组太快解散，那么用户可能会错过回复.Email的CC功能和线程模型通常是不可挽回的。\n 团体沟通有另一个问题。在我的经历中，甚至insmall群组唯一的共同平台是电子邮件。\n 人们可以想象不同的客户和特殊工具，迎合了若要的需求，以及不同的MessicalicPlatforms之间的互操作性。但至少发出信号对支持性不感兴趣，从不介意替代客户。 Moxie陈述了：\n 我知道联邦和定义的协议，第三部分可以为客户制定伟大而重要的想法，幸福的是，他们不再在现代世界中有一个地方。\n 如果我们不保护电子邮件，那么我们才留下跳跃加密。它比一无所有更好，但仍然有太多的斑点，在哪里可以倾听。\n 生活在自由民主国家的大多数人永远不需要保护来自强大的对手的沟通。但这并不意味着我们不应该创建保护他们隐私的工具。在TheContrary上，民主需要隐私。\n  在这个博客文章中，我列出了几种原因，为什么继续为拥有强大的人以及普通人的人提供安全电子邮件。简而言之：安全的信使伟大，但他们没有代表 \n...... ", "note_en": "The  EFAIL attacks demonstrate that securing email is  hard.Incautious improvements to usability can lead to critical securityvulnerabilities. In the case of EFAIL, an attacker could exploit mailclients that show corrupted messages to exfiltrate a message’splain text.\n Although the EFAIL researchers are  measured in their response,others, like  Thomas Ptacek in his widely cited articles  The PGPProblem from 2019, and  Stop Using Encrypted Email from 2020, arecalling for people to abandon OpenPGP, and give up on secure email.Instead, they argue, people should use secure messengers like Signal.\n Thomas’s larger point is simple. Everyone, he says, should “[s]topusing encrypted email.” It fails to protect people who have powerfuladversaries, and everyone else who uses it is just posing:\n Ordinary people don’t exchange email messages that any powerfuladversary would bother to read, and for those people, encryptedemail is LARP security. It doesn’t matter whether or not theseemails are safe, which is why they’re encrypted so shoddily.\n  As I discuss in detail below, there is a fair amount of evidence thatpeople who have a pressing need  can use OpenPGP successfully. Forinstance, a recent academic paper,   When the Weakest Link is Strong:Secure Collaboration in the Case of the Panama Papers, looks at thesecurity practices of the journalists involved in the  Panama Papers.The authors found that for over a year, the hundreds of peopleinvolved in the project successfully collaborated using OpenPGP.\n  If a user loses access to an online account, most services have anaccount recovery mechanism that will let the user back in.Usually, this works by sending an email to the user with aone-time password.\n If an attacker compromises a user’s email account, they can usethe same mechanism to gain control of the user’s account on anyservice that uses the email account as a trust root. In practice,that’s most of the user’s online accounts. Unfortunately,two-factor authentication only offers limited protection. It isopt-in and usually uses a phone number, which is easily hijacked.\n If account recovery emails were encrypted, the trust anchor wouldinstead be the encryption key. Since the encryption key is storedon the user’s computer, this would defeat this type of attack.\n If companies would digitally sign their emails, then thesignatures could be leveraged to better detect phishing.Currently users need to be taught to look for subtle clues todetect this type of attack. This places a high cognitive burdenon them, and violates Krug’s first law of usability: “ Don’t makeme think.”\n Even if secure messaging systems offered all the desired workflowsthat business users need—anecdotal evidence suggests thatthey don’t—they are walled gardens. This architecture has threemajor issues, which push businesses back to email:\n Because some external communication partners will inevitablychoose a different, incompatible system, some communication willstill occur over the common denominator, email.\n A walled garden inhibits the creation of custom tools.Businesses need to comply with local legislation. In manyjurisdictions, companies need to archive and search messages.Services like Signal don’t support this, and hence aren’t anoption.\n A walled garden not only locks the business into a program, butinto a  protocol. This makes switching systems very costly.This type of dependency is particularly undesirable for acritical communication tool.\n Sometimes email is more convenient. Composing and sendinglong-form content is easier using an email application. So issending files. Further, although Signal’s group chat feature isgreat, it needs to be set up and torn down; it is often easier toquickly send an email to a few people.\n Other times email is the only option. Most people have a fewmessaging clients installed on their mobile phone. Nevertheless,it’s not unusual for the only common messaging platform to beemail even for small groups.\n This is not to say that OpenPGP, its various implementations, and theapplications that integrate it don’t have problems. They do. TheOpenPGP working group needs to finish the cryptographic refresh andfinally standardize AEAD. We need email clients that are built withsecurity-oriented workflows for people who have powerful adversaries.And, we need popular mail clients to adopt opportunistic encryptionsimilar to Signal for ordinary users.\n It’s true that OpenPGP has been around for three decades. But, unlikeSignal, which has received 50  million dollars from one of WhatsApp’sfounders, GnuPG’s major donors like Facebook and Stripe have pledgedthree orders of magnitude less: 50  thousand dollars per year. That’s barely enough to maintain GnuPG never mind do UX research.\n   Critics of OpenPGP often cite the   Why Johnny Can’t Encryptusability study, and followup papers like   Why Johnny Still, StillCan’t Encrypt as evidence that OpenPGP is unusable. Yet, a recentmulti-year longitudinal study by Borradaile et al.,   The Motivated CanEncrypt (Even with PGP) suggests that those who have an immediateneed can successfully use PGP:\n In this research, we ask: How do users with concrete privacy threatsrespond in the long term to training that aims to overcome thedocumented usability issues of PGP email encryption? …\n [W]e find that the rate of long-term PGP use by our respondents isover 50%, seeming to counter the poor learnability uncovered bylaboratory studies. Indeed, in our original PGP email workshops, allbut one participant were able to successfully send and receivePGP-encrypted emails.\n These results are consistent with a 2017 study of the securitypractices of the hundreds of participants involved in the reporting onthe  Panama Papers,   When the Weakest Link is Strong: SecureCollaboration in the Case of the Panama Papers. McGregor etal. write that they\n were surprised to learn that project leaders were able toconsistently enforce strict security requirements—such astwo-factor authentication and the use of PGP—despite the factthat few of the participants had previously used these technologies.\n These observations match my own from an  interview series that Iconducted in 2017 with activists and organizations who use GnuPG. Ifound that many users had defining moments that made OpenPGP’sprotection acutely tangible. For instance, in the  interview withC5, a digital security trainer from the Philippines, she said:\n In one of the communities and networks that I wassupporting—let me just say it’s an election, a clean electioncampaign in Southeast Asia where the leaders of that movement werebeing arrested or not arrested, [but] detained and then kind ofsurveilled and all of that. We had to move them away from unsecurecommunication channels because the communications that they weredoing were a lot more substantive than a secure chat software couldhandle. They needed to exchange documents and files and likelengthy, lengthy kind of messages. We did get them back to email asthe main form of communication and then GPG to secure that main formof communication. That really kind of worked. It allowed them toorganize and to call for mass demonstrations.\n These successes don’t excuse OpenPGP’s poor usability. On thecontrary, the studies highlights that a user with sufficientmotivation can use OpenPGP  despite its poor usability.\n  According to my password manager, I’ve created an account on hundredsof websites. One thing that nearly all of these services have incommon is that they require an email address to create the account.\n These services use my email address to update me about the status of apurchase. They sometimes inform me about something they think I’minterested in (“Hey Neal! You bought a refrigerator last week, hereare ten other refrigerators you might be interested in adding to yourcollection!“). And, they use my email address for account recovery.\n  Account recovery usually works as follows. If I’ve forgotten mypassword, I can use the service’s account recovery tool to request anemail. (Facebook’s account recovery tool is shown in the figure.)The email contains a one-time password, which is usually embedded in alink. When I follow the link, I send the one-time password back tothe service thereby proving that I control the email address, and thusam the rightful owner of the account.\n By allowing me to recover my account using my email address, theservice treats my email account as a  trust anchor. As many of theseservices have sensitive personal and financial information about meand the people I interact with, it is essential that I protect it.\n Unfortunately, email accounts are taken over on a regular basis. Tohelp protect users, bigger services now offer two-factorauthentication. Using two-factory authentication raises the barrier,but it has two major weaknesses as deployed today.\n Two-factory authentication’s first weakness is that it is optional.For the general public, banks are the only service that I’m aware ofwhere two-factor authentication is mandatory. By making two-factorauthentication opt-in, we guarantee that it remains largely unused.\n Jared Spool reports in   Do users change their settings? that 95% ofusers don’t change default settings no matter how bad they are. Forinstance, early versions of Microsoft Word did not enable autosave.When Jared’s team asked participants why they didn’t enable it, theyresponded that the developers must have had a good reason not toenable it.\n In his recent presentation at USENIX’s Enigma conference,   Anatomy ofAccount Takeover, Google Engineer Grzegorz Milka confirms that thisbehavior also applies to two-factor authentication, which Googleintroduced in 2011. As of 2018, less than 10% of Google’s users haveenabled it. With this level of adoption, it is almost surprising thatthis features hasn’t yet been  killed by Google. And, Google,because it holds so much user data, is probably an outlier: otherservices that offer two-factor authentication almost certainly havelower levels of adoption.\n The second weakness is that the typical second factor is a telephonenumber. Using a phone number as a second factor has the big advantagethat nearly everyone today has their own; there is no need for usersto buy and carry around a dongle. But, phone numbers are susceptibleto SIM swapping.  Krebs on Security explains how hard this attackisn’t:\n [A] series of recent court cases and unfortunate developmentshighlight the sad reality that the wireless industry today has allbut ceded control over this vital national resource tocybercriminals, scammers, corrupt employees and plain old corporategreed.\n And the Internet is full of anecdotes from ordinary users like   I washacked, by John Biggs:\n At about 9pm on Tuesday, August 22 a hacker swapped his or her ownSIM card with mine, presumably by calling T-Mobile. This, in turn,shut off network services to my phone and, moments later, allowedthe hacker to change most of my Gmail passwords, my Facebookpassword, and text on my behalf. All of the two-factor notificationswent, by default, to my phone number so I received none of them andin about two minutes I was locked out of my digital life.\n In short, control of a phone number as a second factor only offersminimal added protection.\n Instead of using the user’s email account as the trust anchor, wecould use a cryptographic key. When a service needs to send importantdata to the user, the service could encrypt it. Then even if theuser’s email account and phone number are hijacked, the attacker willnot be able to leverage them to also hijack the user’s account onother services. To protect users from local attacks that exfiltratethe secret key material, the secret key material could be stored in atrusted execution environment (TEE) like a TPM or iOS’s TrustedEnclave. This has the advantage that like a phone number mosthardware already has a TEE.\n Figure: A mocked up dropdown allowing the user to select an OpenPGP key in their browser. Clicking on a key will automatically insert the public key into the form.\n The UX for this uploading an encryption key does not have to beinvasive. When the user creates an account, the account creation formcould also prompt for an OpenPGP key. If we teach web browsers how tofind OpenPGP keys, then the user doesn’t even need to copy and paste ablock of text, but can simply select a key from a drop down, as shownin the above figure.\n   Most people I know receive a few phishing emails per week. Manymedium and large companies even train their employees to detect suchemails, and they regularly test their employees by sending fakephishing mails. If the employees don’t report the phishing email,then they may receive additional training, which is viewed as apunishment.\n Having to be on the constant look out for phishing mails increasesemployees’ cognitive burden.  The Greater Manchester Police recentlycaught a phisher:\n Officers in Manchester city centre arrested a man in a hotelyesterday after an estimated 26,000 fraudulent text messagespurporting to be a delivery company [Hermes] were sent in one day… asking for bank details after a missed delivery.\n  Check the address the email has been sent from. By using your mouseto hover over or right-click on the sender name, you will be able tosee the email address behind it. Fraudsters often have bizarre emailaddresses or one that doesn’t quite match with the company they areclaiming to be.\n Look to see who the email addressed to. Often fraudsters will use animpersonal greeting such as ‘Hi’ or ‘dear customer’.\n Don’t feel pressured. Scam emails will often claim there is a timelimit or sense of urgency for you to act now, but don’t feelpressured. Take your time to make the checks you need.\n Watch out for out for spelling and grammar mistakes. Also look outfor slight changes in things such as a website link. This could lookvery similar to the company’s real website, but even a singlecharacter difference means it is leading you to different website.\n Think about whether you are expecting an email from that company. Ifit’s out of the blue, it could be a scam.\n    And, yet, we can. If companies would digitally sign their emails,then it would be possible to detect when a signature is missing, or akey cannot be authenticated, or a key is being used for the firsttime.\n  Even if they wanted to, it is unclear if businesses could deprecateemail in favor of a secure messaging solution. Businesses need tocommunicate with other businesses and customers, and whereas email isfederated and nearly everyone has an email address, there are manydifferent secure messaging solutions, and all of the popular ones areclosed systems. As long as the many different secure messagingsolution don’t interoperate, businesses will continue to use email.\n This raises another issue: because the popular secure messagingsolutions are all walled gardens, shifting critical communication tosomething like Signal not only locks a company into a particularproduct, but also a protocol. This makes it even harder for thebusiness to switch should the secure messaging system becomeundesirable.\n But it is not clear what businesses can replace email with a securemessaging solution. Businesses need to comply with regulations. Ifthe secure messaging applications don’t support the requiredfunctionality, and that functionality can’t be added due to the closedecosystem, then secure messaging is not even an option.\n HIPAA stands for the  Health Insurance Portability and AccountabilityAct. It is a set of laws in the US that address how healthinformation must be handled.  The Hipaa Journal explains some of therequirements for sending protected health information electronically.In particular, the data must be sent using end-to-end encryption, andall communication needs to be retained.\n Similar regulation applies to other industries in the US. Intradyn, amaker of email archiving software,  explains that in the US\n [i]n 2006, a law was passed mandating data archiving. According tothis set of email archiving regulations, your business needs tomaintain electronic records. That means that you can’t just deleteemails when they are no longer currently relevant; they need to bestored for long-term access. The law requires you to know where thatdata is stored, to be able to search through it, and to be able toretrieve it on demand. Email archiving isn’t just a convenience, incase you discover that the data would have helped you later; it’s alegal necessity.\n The law is also careful to note that simply storing the data isn’tenough. You can’t use a random system, let your emails pile into it,and hope that you never actually have a reason to search throughit. Instead, the law notes that you have to know how the systemworks, be able to use it efficiently, and be able to produce therequested emails quickly. “I don’t know how to get to it” or “It’snot pulling up in a search” isn’t an acceptable excuse anymore.\n It seems inevitable that businesses will continue to use email. Inthat case, then it is sensible to offer it the best  technologicalprotection we can. And we can to better than hop-to-hop encryption.\n  Despite secure messaging’s popularity, there are still a number ofpractical reasons to prefer email. Secure messengers are optimizedfor real-time chat on mobile phones. Thus, some workflows are easierusing email clients. Further, since all of the popular securemessengers are walled gardens, they are unlikely to ever completelydislodge email’s dominance, and email will remain the commondenominator.\n Figure: The input area in Signal&#39;s desktop client is limited to 4.5 lines of text by default.\n Although I usually prefer using a real-time chat system to sending anemail, there are several situations where email continues to excelfrom a user experience perspective.\n First, it is much more convenient to write long-form content using aproper text editor, than with the tiny text input field that mostmessengers provide. The figure shows the text input field in Signal’sdesktop client (v5.3.0). Only four and a half lines of text aredisplayed by default.\n Another usability issue has to do with exchanging files. Although itis relatively straightforward to send a file using a secure messenger,because most people only have the messaging app installed on theirphone, files often need to be transferred to and from the user’sdesktop or laptop. Anecdotal evidence suggests that this is oftendone using email, or a file transfer service like Dropbox.\n Starting a short-lived group thread is also easier using email. InSignal, for instance, it is first necessary to create a group. If thegroup stays around, then it clutters the conversation overview. Ifthe group is disbanded too soon, then the user might miss replies.Email’s cc functionality and threading model are often moreconvenient.\n Groups communication has another problem. In my experience even insmall groups the only common platform is email.\n One could imagine different clients and special tools catering todifferent needs, and interoperability between different messagingplatforms. But at least Signal is not interested in supportingfederation never mind alternative clients.  Moxie has stated:\n I understand that federation and defined protocols that thirdparties can develop clients for are great and important ideas, butunfortunately they no longer have a place in the modern world.\n If we don’t secure email, then we are left with hop-by-hop encryption.It’s better than nothing, but there are still too many spots whereeavesdroppers can listen.\n Most people living in liberal democracies will never need to protecttheir communication from a powerful adversary. But that doesn’t meanthat we shouldn’t create tools to protect their privacy. On thecontrary,  democracy needs privacy.\n  In this blog post, I’ve listed several reasons why we should continueto press for secure email for both people who have powerfuladversaries, as well as ordinary people. In short: secure messengersare great, but they don’t rep\n......", "posttime": "2021-06-30 03:26:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电子邮件,protection", "title": "是的，我们希望电子邮件加密保护 ", "title_en": "Yes, We Want Cryptographic Protection for Email", "transed": 1, "url": "https://sequoia-pgp.org/blog/2021/06/29/202106-yes-we-want-cryptographic-protection-for-email/", "via": "", "real_tags": ["电子邮件"]}]