[{"category": "", "categoryclass": "", "imagename": "0bc923651a27bc2316a918455033e448.png", "infoid": 1031708, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与使用我们的Gretel测试版和开源合成数据库的开发人员合作时，我们听到的最重要的要求之一是，开发人员要求我们极其简单地开始使用包括数据匿名化、隐私工程和数据平衡在内的用例。本周，我们非常高兴地发布了Gretel的蓝图。Gretel蓝图是示例代码和示例数据集的集合，这些示例代码和示例数据集利用Gretel的SDK，可以轻松地调整以解决客户特定的用例。\n来自我们社区的反馈使我们相信代码的应用实际上可以是特定于用例的。但开发人员不应该总是为了解决特定问题而做出一系列技术决策。\n就像客户用例会发展一样，蓝图也会发展。我们将根据新功能和客户反馈添加新的蓝图-如果您想要查看您的用例蓝图，请在Twitter上通知我们。我们的几个蓝图也将有自己的详细博客，深入探讨用例，更重要的是，您如何使用Gretel自己解决这些挑战。\nGretel蓝图将通过Gretel Cloud访问，并托管在GitHub上。很快，在创建Gretel云项目时，您就可以选择我们的蓝图作为起始模板，几张蓝图将自带样本数据。如果您已经有一个项目或正在使用您自己的数据创建一个空白项目，则可以从“转换”页面获得蓝图。\n进入转换页面后，您将能够选择任何蓝图与您当前的Gretel云项目一起使用或与您自己环境中的数据一起使用。\n与我们的核心开源SDK一样，蓝图也托管在GitHub上，并在Apache2.0下获得许可。我们这样做是为了让客户可以采用我们的样例代码来具体满足他们的需求，而不会过度规定如何解决任何一个问题。\n在接下来的几天里，我们将发布我们新的Gretel云工作流程，并为我们的许多蓝图发布教程、演练，甚至是客户推荐信。如果你喜欢，给我们一个关于吉瑟布的⭐！请继续关注我们的博客和Twitter，了解这些令人兴奋的公告，并随时通过[受保护的电子邮件]、GitHub或社交媒体联系我们的团队！", "note_en": "Working with developers using our  Gretel beta and open-source  synthetic data libraries, one of the top requests we have heard is developers asking us to make it incredibly simple to get started on use cases including  data anonymization,  privacy engineering, and  data balancing. This week we are thrilled to release Gretel Blueprints. Gretel Blueprints are collections of sample code and sample datasets that utilize Gretel&#39;s SDKs that can be easily adapted to solve customer-specific use cases.\n Feedback from our community has led us to believe that the application of code can actually be use case specific.  Developers should not have to always make a series of technology decisions in order to solve a specific problem.\n Just like customer use cases evolve, so will Blueprints. We will be adding new Blueprints based on new features and customer feedback- let us know on  Twitter if you would like to see Blueprints for your use case.  Several of our Blueprints will also have detailed blogs of their own to deep dive into the use case and more importantly,  how you can use Gretel to solve these challenges on your own.\n  Gretel Blueprints will be accessible via  Gretel Cloud and are hosted on  GitHub.  Soon, when creating a Gretel Cloud Project, you will be able to choose our Blueprints as a starting template and several Blueprints will come with their own sample data. If you have a project already or are creating a blank project with your own data, the Blueprints will be available from the &#34;Transform&#34; page.\n Once in the &#34;Transform&#34; page, you will be able to select any Blueprint to use with your current Gretel Cloud Project or for use with data in your own environment.\n   Like our core open source SDKs, Blueprints are hosted on  GitHub and licensed under Apache 2.0. We did this so customers can adopt our sample code to meet their needs specifically without being overly prescriptive on how to solve any one problem.\n In the coming days, we&#39;ll be making announcements on our new Gretel Cloud workflows and releasing tutorials, walk-throughs, and even customer testimonials for many of our Blueprints. If you like it, give us a ⭐ on  Github! Stay tuned to our  Blog and  Twitter for these exciting announcements and feel free to reach out via   [email protected], GitHub, or social media to engage with our team!", "posttime": "2020-10-28 13:20:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "点击,making,蓝图", "title": "蓝图，只需点击几下即可轻松匿名和平衡数据集", "title_en": "Blueprints, making it easy to anonymize and balance datasets with a few clicks", "transed": 1, "url": "https://gretel.ai/blog/introducing-gretel-blueprints", "via": "", "real_tags": ["点击", "making", "蓝图"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1031707, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GAME Basic for Sega saturn是一个自制的开发工具包，允许你使用Basic编程语言为世嘉土星编写游戏。如果你熟悉PlayStation的Net Yaroze平台，可以将其视为土星的答案-只是更便宜，更容易上手。\nGame Basic使用BASIC语言在编程技能方面的入门门槛非常低。虽然土星的编程难度是出了名的高，但Game Basic让它很容易上手，而且功能强大得令人惊讶，允许非常轻松的精灵操作和简单的3D多边形实现。它甚至包括一根适配器电缆，允许你从PC与土星进行通信，以传输或保存程序并简化开发。例如，下面是一个Pilotwings风格的演示，但使用的是Game Basic：\n注意：Game Basic仅在日本发布，因此这意味着可能很难获得完整的设置，并且所有文档都是日语的！此外，允许您使用PC进行简化开发的支持软件是为Windows 95时代设计的，并且完全不会安装在现代系统上。哦，让您将土星连接到PC的适配器电缆是25针串行连接！\n世界上还有谁同时拥有Game Basic和带物理串口的Windows95 PC？没有人！(好吧，除非你是现代复古玩家)但如果你是一个勇敢的实验者，不怕稍微修修补补，那么即使是今天，仍然有多种选择可以让一切正常工作！你甚至可以通过仿真做很多事情。所以，让我们去实验室开始…吧。\n使用Game Basic有几种选择，既有非常简单但笨重的，也有非常强大和精简的。以下是三个选项：\n能够玩日本土星游戏(日式或改装主机、Pro Action Replay/伪土星凯盒或土星模拟器)。\n土星内部存储器中有足够的空间(如果你想保存你的程序)。\n对于此选项，您将在没有PC连接的土星上运行Game Basic，只使用标准的土星附件。如果您只想编写“Hello，World！”风格的程序或使用工具包附带的整齐的游戏和演示，这是一个合理的选择。理论上，您甚至可以用这种方式编写最复杂的程序，但您会遇到保存到土星内部存储器的游戏大小的限制。此外，使用虚拟键盘编程是非常痛苦的。如果您没有其他选项所需的硬件，请从这里开始。或者如果你只是想随便看看，看看这是怎么回事。\nGame Basic的一个伟大之处在于，访问土星的外围设备非常容易，包括内部备份RAM、外部存储盒，甚至土星软盘驱动器。有了这样的设置，你将有足够的空间来保存程序，还可以使用真正的键盘输入文本。你甚至可以开始尝试不同形式的输入，比如模拟控制和光枪！但如果没有PC提供的工具，就很难制作出好看的精灵、纹理和3D模型。因此，你甚至可以开始尝试不同形式的输入，比如模拟控制和光枪！但如果不能访问PC提供的工具，就很难制作出好看的精灵、纹理和3D模型。因此，你甚至可以开始尝试不同形式的输入，比如模拟控制和光枪！但如果没有PC提供的工具，就很难制作出好看的精灵、纹理和3D模型。尽管如此，这仍然会限制你的能力。无论如何，对于纯粹的乐趣因素“嘿，看！”来说，这是一个很好的选择。我在用我的土星编程！“。或者如果你没有能力将土星连接到个人电脑上。\n你甚至可以用土星模拟器走这条路，让你很容易获得改进的键盘、鼠标和存储选项。“我已经确认Mednafen成功地模拟了Game Basic，并允许键盘和鼠标直通输入，这意味着你可以进行大量的土星开发，进入门槛很小。\n一台带USB端口的现代PC，能够运行虚拟机(我使用的是VirtualBox)。\n能够在原装硬件上玩日本土星游戏(日式或改装游戏机，或Pro Action Replay/伪土星凯盒)。\n也可以选择任何有趣的土星配件(我特别推荐使用键盘或键盘适配器)。\n这就是凯迪拉克选项！这就是我使用的设置，这就是游戏Basic的实际用途(我想除了没人想到它会在VM上运行之外)，也是本指南其余部分将重点关注的。使用这种设置，编写游戏就像在文本编辑器中编写Basic并点击几个按钮将其发送到您的土星一样简单，在那里它会立即显示在您的电视上，并对控制器和键盘输入做出响应！说真的，一旦您让它运行…，它就会变得超级酷。\n简单而增强的土星专用设置非常简单。“你只需像任何其他土星游戏一样启动Game Basic并开始，所以没有太多的配置要讨论。”不管你选择什么设置，都可以继续到第2部分进行几个测试程序。但是如果你想要完整的设置，这是一个相当大的项目要开始进行，所以请继续阅读第3部分，了解完整的操作方法！(但是如果你想要完整的设置，这是一个相当大的项目，所以请继续阅读第三部分，了解完整的操作方法！)", "note_en": "Game BASIC for Sega Saturn is a homebrew development kit that allows you to program games for the Sega Saturn using the BASIC programming language.  If you’re familiar with the PlayStation’s Net Yaroze platform, think of this as the Saturn’s answer to it – just cheaper and easier to get started with.\n Game BASIC’s use of the BASIC language makes for a very low barrier to entry in terms of programming skill.  Though the Saturn is notoriously difficult to program for, Game BASIC makes it easy to get started and is surprisingly powerful, allowing very easy sprite manipulation and straightforward 3D polygon implementation.  It even includes an adapter cable that allows you to communicate with the Saturn from your PC to transfer or save programs and streamline development. For example, here’s a Pilotwings-esque demo, but in Game BASIC:\n  The caveat?  Game BASIC was released only in Japan, so this means a complete setup can be difficult to obtain and all documentation is in Japanese!  Moreover, the supporting software that allows you to use your PC for streamlined development was intended for the Windows 95 era and flat out does not install on modern systems. Oh, and the adapter cable that allows you to connect your Saturn to your PC is a 25-pin serial connection!\n Who in the world still has both Game BASIC and a Windows 95 PC with a physical serial port? Nobody!  (Well, unless you’re  Modern Vintage Gamer) But if you’re a brave experimenter who’s not afraid to tinker a bit, there are still multiple options to get everything working, even today!  You can even do a lot just via emulation.  So, let’s head to the Lab and get started…\n   There are several options for working with Game BASIC, ranging from quite simple but clunky to work with, to quite powerful and streamlined.  Here are the three options:\n   The ability to play Japanese Saturn games (A Japanese or modded console, a Pro Action Replay/ Pseudo Saturn Kai cartridge, or a Saturn emulator)\n  Plenty of room in the Saturn’s internal memory (if you want to save your programs)\n For this option, you’ll run Game BASIC on the Saturn with no PC connection, using only standard Saturn accessories.  This is a reasonable choice if you just want to write “Hello, World!”-style programs or play around with the neat games and demos that come with the kit.  Theoretically, you can write even the most complex programs this way, but you’ll run into limitations on the size of games you can save to the Saturn’s internal memory.  Plus, programming with a virtual keyboard is an absolute pain.  Start here if you don’t have the necessary hardware for the other options, or if you just want to poke around a bit and see what this is all about.\n    One of the great things about Game BASIC is how easy it makes it to access the Saturn’s peripherals, including the internal backup RAM, external memory cartridges, and even the Saturn Floppy Disk Drive.  With a setup like this, you’ll have plenty of space to save your programs and you can use a real keyboard for text entry.  You can even start experimenting with different forms of input, like analog controls and light guns!  But without access to the tools a PC provides, it will be difficult to make nice-looking sprites, textures, and 3D models.  So, this will still limit what you’re capable of.  Regardless, this is a great option for the sheer fun factor of “Hey look! I’m programming with my Saturn!” or if you have no ability to connect your Saturn to a PC.\n You can even go this route with a Saturn emulator, giving you easy access to improved keyboard, mouse, and storage options.  I’ve confirmed that Mednafen successfully emulates Game BASIC and allows for keyboard and mouse pass-through input, meaning you can do a whole lot of Saturn development with very little barrier to entry.\n   A modern PC with a USB port, capable of running a Virtual Machine (I use VirtualBox)\n   The ability to play Japanese Saturn games on original hardware (Japanese or modded console, or a Pro Action Replay/Pseudo Saturn Kai cartridge)\n  Optionally, any fun Saturn accessories you may want to experiment with (I especially recommend a keyboard or keyboard adapter)\n This is the Cadillac option!  This is the setup I use, is how Game BASIC was really intended to be used (well, except nobody expected it to be run on a VM, I suppose), and is what the rest of this guide will focus on.  With this setup, writing a game is as simple as writing BASIC in a text editor and hitting a couple of buttons to send it to your Saturn, where it immediately shows up on your TV and responds to controller and keyboard input!  Seriously, it’s super cool once you get it working…\n The Simple and Enhanced Saturn-only setups are extremely straightforward.  You just boot Game BASIC like any other Saturn game and get started, so there’s not much configuration to discuss.  Regardless of the setup you choose, continue on to Part 2 for a few test programs.  But if you want the Full setup, it’s quite a project to get going, so read on to Part 3 for the complete How-To!", "posttime": "2020-10-28 13:00:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,土星,saturn", "title": "世嘉土星自酿游戏基础版", "title_en": "Sega Saturn Homebrew with Game Basic", "transed": 1, "url": "https://flybacklabs.com/sega-saturn-homebrew-with-game-basic/", "via": "", "real_tags": ["游戏", "土星", "saturn"]}, {"category": "", "categoryclass": "", "imagename": "568cfab1d275f8ec0bf4032e7bfb4b58.jpeg", "infoid": 1031706, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据本周将听取行业高管意见的一个关键委员会成员的一份新报告，一些参议院民主党人正在寻求让监管机构能够保护当地新闻媒体，指责谷歌(Google)和Facebook等科技巨头“不公平的商业行为”。\n这是在参议院商务委员会周三与Alphabet公司的谷歌、Facebook公司首席执行长举行听证会前夕发布的。Twitter Inc.的报告认为，当地新闻业正处于危机之中-冠状病毒大流行严重加剧了危机-部分原因是所谓的科技平台的反竞争行为，这些行为应该受到联邦贸易委员会(Federal Trade Commission)的监管。\n“他们正面临着不公平的做法，”该委员会的资深成员、华盛顿州民主党参议员玛丽亚·坎特维尔(Maria Cantwell)在接受采访时说。“我们认为国会和联邦贸易委员会应该解决这些不公平的做法。”\n谷歌的一位女发言人说，这份报告“歪曲了围绕谷歌在在线新闻生态系统中的角色以及我们为面临向数字世界转型挑战的出版商提供的价值的现实”。\nFacebook驳斥了该报告的指控，即科技巨头为自己的网站窃取当地新闻内容和数据，这种做法被称为抓取。Facebook的一位发言人说：“关于我们抄袭新闻文章的指责根本不是真的。”", "note_en": "Some Senate Democrats are seeking to enable regulators to protect local news outlets, accusing tech giants such as Google and Facebook of “unfair business practices,” according to a new report by members of a key committee that will hear from the top industry executives this week.\n  Released on the  eve of the Senate Commerce Committee’s hearing Wednesday with the chief executives of Alphabet Inc.’s Google, Facebook Inc. and Twitter Inc., the report argues that local journalism is in a crisis— badly exacerbated by the coronavirus pandemic—partly because of alleged anticompetitive behavior on the part of the tech platforms that ought to be policed by the Federal Trade Commission.\n  “They are facing unfair practices,” Sen. Maria Cantwell (D., Wash.), the ranking member on the committee, said in an interview. “We think Congress and the FTC should address those unfair practices.”\n  A Google spokeswoman said the report “distorts the reality around Google’s role in the online news ecosystem and the value that we provide to publishers who face challenges in transitioning to the digital world.”\n  Facebook took issue with the report’s allegation that tech giants take local news content and data for their own sites, a practice known as scraping. “The accusation that we scrape news articles is simply not true,” a Facebook spokesman said.", "posttime": "2020-10-28 12:59:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "google,谷歌,报告,report,委员会", "title": "参议院报告称谷歌的AMP应由联邦贸易委员会监管", "title_en": "Senate report says Google's AMP should be policed by the FTC", "transed": 1, "url": "https://www.wsj.com/articles/lawmakers-want-to-protect-local-newspapers-from-google-facebook-11603789201", "via": "", "real_tags": ["google", "谷歌", "报告", "report", "委员会"]}, {"category": "", "categoryclass": "", "imagename": "0ffc6139e90bed213018eebb882d4c36.png", "infoid": 1031705, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们很兴奋地宣布发布1.20版。1.20版本于2020年10月26日发布。此版本提供了新功能，并为1.19版及更早版本的用户解决了问题。\n除了错误修复和用户界面改进之外，还有几个值得关注的新功能和改进。\n当FusionAuth充当SP或IdP时，它现在支持SAML POST绑定。这使得FusionAuth可以与许多流行的商业现成应用程序和网站集成，包括login.gov和Alfresh co。\nFusionAuth还支持SessionIndex属性，该属性是可选的，但某些软件应用程序(特别是ArtiFactory)需要该属性。\n最后，FusionAuth现在支持SAML请求中的AssertionConsumer erServiceURL。还可以在应用程序SAML设置中配置多个重定向URL。\n在这个版本中，我们将docker的基本镜像从alpine更新为ubuntu：ocus。这应该不会影响功能，但如果您正在基于我们的镜像构建Docker镜像，则值得注意。\n我们进行此更改是因为为了在不包含GNU C库(Glibc)的情况下在Alpine上运行，我们必须使用使用MUSL C库编译的OpenJDK的自定义版本。由于此选项可能存在一些性能问题，我们已转向由AdoptOpenJDK提供的正式版本的JDK。此构建是使用glibc编译的。不幸的是，使用ubuntu：ocus图像时，docker图像的大小比基于alpine的图像增加了大约30MB。然而，在我们从AdoptOpenJDK获得基于MUSL C库的正式构建之前，出于性能方面的考虑，我们不打算在Alpine上发布官方FusionAuth映像。\n在此版本中，我们添加了一些新表单。这些定制也仅对付费版的客户可用。(了解有关购买付费版的更多信息。)\n这个新特性允许您自定义用于从FusionAuth管理UI添加或编辑用户的表单。这些表单可以按租户配置。例如，当FusionAuth管理员创建用户时，您现在可以需要手机号码，或者需要一个或多个自定义字段。\n您还可以在FusionAuth管理UI中修改注册创建和更新表单，包括捕获自定义数据、删除未使用的字段以及向自定义字段添加验证。此表单可根据应用程序逐个配置。\n例如，如果您的业务逻辑需要知道用户最喜欢的颜色(或任何其他颜色)，FusionAuth可以帮助您：\n当与FusionAuth的细粒度角色(允许您创建具有有限权限的用户)结合使用时，您可以将这些表单公开给客户服务代表或您可能不想访问整个FusionAuth管理UI的其他用户。\n除了这些功能之外，还有十多个其他错误也得到了解决，GitHub的问题也得到了解决。这些修复包括在某些情况下对JWT内容的更改、仪表板用户数和多余的日志消息。有关1.19和1.20之间的更改的完整细目，请参阅发行说明。\n如果您想升级您的自托管FusionAuth实例，请参阅我们的升级指南。如果您部署了FusionAuth云，请从您的帐户控制面板打开支持请求或使用我们的联系人表单，我们将升级您的服务器！或者，如果您想下载并使用FusionAuth，请查看您的选项。", "note_en": "We’re excited to announce the release of version 1.20. The 1.20 release shipped on Oct 26, 2020. This version delivers new features as well as resolving issues for users on version 1.19 and older.\n  In addition to bug fixes and user interface improvements, there are a couple of new features and improvements which deserve a spotlight.\n   FusionAuth now has support for SAML POST bindings when it is acting as either the SP or the IdP. This allows FusionAuth to integrate with a number of popular commercial off-the-shelf applications and websites, including  login.gov and  Alfresco.\n FusionAuth also supports the  SessionIndex attribute, which is optional, but required by some software applications, notably Artifactory.\n Finally FusionAuth now honors the  AssertionConsumerServiceURL in a SAML request. Multiple redirect URLs can be configured in the application SAML settings as well.\n  In this release, we updated the base image for Docker from  alpine to  ubuntu:focal. This should not impact functionality, but it’s worth paying attention to if you are building Docker images based on our image.\n We made this change because in order to run on  alpine without including the GNU C Library ( glibc) we had to use a custom build of OpenJDK compiled using the  musl C library. Due to some possible performance concerns with this option, we have moved to an official build of JDK provided by AdoptOpenJDK. This build is compiled using  glibc. Unfortunately, using the  ubuntu:focal image increased the docker image size by approximately 30 MB over the  alpine based image. However, until we can obtain official builds from AdoptOpenJDK based upon the  musl C library, we are not planning to ship an official FusionAuth image on  alpine due to the performance concerns.\n   In this release, we’ve added a few new forms. These customizations are also only available to customers with a paid edition. (Learn more about  purchasing a paid edition.)\n This new feature allows you to customize the form used to add or edit a user from the FusionAuth admin UI. These forms can be configured on a per tenant basis. For instance, you can now require a mobile phone number or require one or many custom fields when a FusionAuth admin is creating a user.\n You can also modify the registration creation and update form in the FusionAuth admin UI, including capturing custom data, removing unused fields and adding validation to the custom fields. This form is configurable on an application by application basis.\n For instance, if your business logic needs to know a user’s favorite color (or anything else), FusionAuth has you covered:\n  When combined with FusionAuth’s granular roles, which allow you to create users with limited privileges, you can expose these forms to customer service reps or other users whom you might not want to access the entire FusionAuth admin UI.\n  In addition to these features, there were over ten other bugs squashed and GitHub issues resolved as well. These fixes include changes to JWT contents in certain situations, dashboard user counts, and superfluous log messages. Please see the  release notes for the full breakdown of the changes between 1.19 and 1.20.\n If you’d like to upgrade your self-hosted FusionAuth instance, see our  upgrade guide. If you have a FusionAuth Cloud deployment, open a  support request from your account dashboard or  use our contact form and we’ll get your servers upgraded! Or, if you’d like to download and use FusionAuth,  check out your options.", "posttime": "2020-10-28 12:54:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "fusionauth", "title": "FusionAuth 1.20", "title_en": "FusionAuth 1.20", "transed": 1, "url": "https://fusionauth.io/blog/2020/10/27/announcing-fusionauth-1-20/", "via": "", "real_tags": []}, {"category": "", "categoryclass": "", "imagename": "d8f5802e503832dab4492b6dd2bce025.jpg", "infoid": 1031704, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这一想法是一项关于跑步和步行对膝关节不同影响的有趣新研究的核心。通过动作捕捉和复杂的计算机建模，这项研究证实了跑步比步行对膝盖的影响更大。但作者总结说，在这个过程中，跑步可能也会加强和增大软骨，软骨是一种缓冲骨骼末端的橡胶组织。这些发现提出了一种令人着迷的可能性，即跑步可能会增强膝盖的力量，帮助延缓膝关节炎，而不是伤害膝盖。\n当然，跑步会伤及膝盖的观念是广泛而根深蒂固的。几乎每个跑步的人都熟悉好心的、不跑步的家人、朋友和陌生人的警告，他们的膝盖注定要完蛋了。\n这种担忧并不是没有根据的。跑步涉及到大量的关节弯曲和撞击，这会磨损膝盖内的缓冲软骨。软骨没有自己的血液供应，通常被认为在受损时几乎没有自我修复的能力，或者在童年后根本没有太大的变化。因此，可以想象，反复跑步会磨损脆弱的软骨，几乎不可避免地会导致严重的膝关节炎。\n但在现实生活中，情况并非如此。有些跑步者会患膝关节炎，但不是全部。事实上，从统计上看，作为一个群体，跑步者比不跑步者患关节炎的可能性更小。\n为什么跑步节省了这么多跑步者的膝盖，这个问题长期以来一直让马里兰大学位于学院公园的运动学副教授罗斯·米勒(Ross Miller)感兴趣。在早期的研究中，他和他的同事们通过让志愿者沿着装有板子的轨道行走和跑步，以测量每一步产生的力，从而研究了跑步机械是否重要。\n由此得出的数据显示，人们在跑步时更猛烈地撞击地面，每迈一步膝盖受到的撞击要大得多。但他们在两步之间花在高空的时间也更多，这意味着他们在行走相同距离的情况下走得更少。因此，研究人员得出结论，随着时间的推移，通过他们膝盖的累积力应该是大致相同的，无论是步行还是跑步。\n但是，最近，米勒博士开始怀疑这一发现是否真的解释了为什么跑步不会伤及更多的膝盖。他知道，最近对动物的一些研究暗示，软骨可能比研究人员之前认为的更有弹性。在这些研究中，跑步的动物往往比久坐不动的动物的可比组织有更厚、更健康的膝关节软骨，这表明活跃的动物的软骨随着跑步的反应而发生了变化。\n米勒博士推测，也许人类跑步者膝盖中的软骨同样会发生改变和适应。\n为了找出答案，他再次要求一群健康的年轻男女沿着一条包含力板的轨道行走和跑步，同时他和他的同事们对他们进行了拍摄。然后，研究人员计算了志愿者在散步和跑步时产生的力。最后，他们对志愿者膝盖的未来进行了建模。\n更具体地说，他们使用了力板数字，加上过去在实验室中拉动和敲打直到软骨分崩离析的活组织研究的大量额外数据，以及其他来源来创建计算机模拟。他们想看看，理论上，如果一个成年人多年来每天步行6公里(约3.7英里)，与之相比，如果他们每天步行3公里，再跑3公里，健康的膝关节软骨会发生什么。\n他们还测试了另外两种理论情况。首先，研究人员设定了这样一种可能性，即人们的膝盖软骨在行走或跑步造成的反复小损伤后会轻微修复--但不会发生其他变化。对于最后一种情况，他们假设软骨会主动地自我重塑，适应移动的要求，变得更厚、更强壮，就像我们锻炼肌肉时所做的那样。\n模特们的最终结果令人大开眼界。根据模拟，如果模型不包括膝盖软骨自我适应或修复的可能性，每天的步行者在55岁前患关节炎的可能性约为36%。如果假设软骨能够修复或适应，这一风险下降到约13%，这大约是研究预测的其他健康人在现实世界中关节炎的风险。\n竞选的数字更令人担忧。当模型假设软骨不会改变时，跑步者最终患关节炎的风险高达98%，如果模型考虑到软骨修复的可能性，风险只会下降到95%。实际上，根据这种情况，频繁跑步对软骨的损害将压倒组织自我修复的任何能力。\n但是，如果模型包括人们跑步时软骨主动适应的可能性-变得更厚、更柔软-跑步者患关节炎的几率下降到约13%，与健康的步行者相同。\n罗斯博士说，这些结果表明软骨是有延展性的。它必须能够感觉到跑步带来的紧张和轻微的损伤，并重建自己，变得更强壮。在这种情况下，跑步有助于软骨健康。\n然而，像这样的模型化结果只是理论上的，而且是有限的。他们没有解释在没有血液供应的情况下软骨是如何自我重塑的，也没有解释遗传、营养、体重、膝盖损伤和其他因素是否会影响个人的关节炎风险。这样的模型也没有告诉我们不同的距离、速度或跑步形式是否会改变结果。米勒博士说，为了了解更多，我们需要直接测量跑步后活体人类软骨的分子和其他变化，但这样的测试很困难。\n尽管如此，这项研究可能会平息一些跑步者的疑虑--以及他们的家人和朋友的疑虑。“看起来跑步不太可能因为软骨磨损而导致膝关节炎，”罗斯博士说。", "note_en": "That idea is at the heart of a  fascinating new study of the differing effects of running and walking on the knee joint. Using motion capture and sophisticated computer modeling, the study confirms that running pummels knees more than walking does. But in the process, the authors conclude, running likely also fortifies and bulks up the cartilage, the rubbery tissue that cushions the ends of bones. The findings raise the beguiling possibility that, instead of harming knees, running might fortify them and help to stave off knee arthritis.\n Of course, the notion that running wrecks knees is widespread and entrenched. Almost anyone who runs is familiar with warnings from well-meaning, nonrunning family members, friends and strangers that their knees are doomed.\n This concern is not unwarranted. Running involves substantial joint bending and pounding, which can fray the cushioning cartilage inside the knee. Cartilage, which does not have its own blood supply, generally is thought to have little ability to repair itself when damaged or to change much at all after childhood. So, repeated running conceivably wears away fragile cartilage and almost inevitably should lead to crippling knee arthritis.\n But in real life, it does not. Some runners develop knee arthritis, but not all. As a group, in fact,  runners may be statistically less likely to become arthritic than nonrunners.\n The question of why running spares so many runners’ knees has long intrigued Ross Miller, an associate professor of kinesiology at the University of Maryland in College Park. In earlier research, he and his colleagues had looked into whether running mechanics matter, by asking volunteers to walk and run along a track outfitted with plates to measure the forces generated with each step.\n The resulting data showed that people hit the ground harder while running, clobbering their knees far more with each stride. But they also spent more time aloft between strides, meaning they took fewer strides while covering the same distance as when walking. So, the cumulative forces moving through their knees over time  should be about the same, the researchers concluded, whether someone walked or ran.\n But, recently, Dr. Miller had begun to doubt whether this finding really explained why running wasn’t wrecking more knees. He knew that some recent studies with animals intimated that cartilage might be more resilient than researchers previously had believed. In those studies, animals that ran tended to have thicker, healthier knee cartilage than comparable tissues from sedentary animals, suggesting that the active animals’ cartilage had changed in response to their running.\n  Perhaps, Dr. Miller speculated, cartilage in human runners’ knees likewise might alter and adapt.\n To find out, he again asked a group of healthy young men and women to walk and run along a track containing force plates, while he and his colleagues filmed them. The researchers then computed the forces the volunteers had generated while strolling and running. Finally, they modeled what the future might hold for the volunteers’ knees.\n More specifically, they used the force-plate numbers, plus extensive additional data from past studies of biopsied cartilage pulled and pummeled in the lab until it fell apart and other sources to create computer simulations. They wanted to see what, theoretically, would happen to healthy knee cartilage if an adult walked for six kilometers (about 3.7 miles) every day for years, compared to if they walked for three kilometers and ran for another three kilometers each of those days.\n They also tested two additional theoretical situations. For one, the researchers programmed in the possibility that people’s knee cartilage would slightly repair itself after repeated small damage from walking or running — but not otherwise change. And for the last scenario, they presumed that the cartilage would actively remodel itself and adapt to the demands of moving, growing thicker and stronger, much as muscle does when we exercise.\n The models’ final results were eye-opening. According to the simulations, daily walkers faced about a 36 percent chance of developing arthritis by the age of 55, if the model did not include the possibility of the knee cartilage adapting or repairing itself. That risk dropped to about 13 percent if cartilage were assumed to be able to repair or adapt, which is about what studies predict to be the real-world arthritis risk for otherwise healthy people.\n The numbers for running were more worrisome. When the model assumed cartilage cannot change, the runners’ risk of eventual arthritis was a whopping 98 percent, declining only to 95 percent if the model factored in the possibility of cartilage repair. In effect, according to this scenario, the damage to cartilage from frequent running would overwhelm any ability of the tissue to fix itself.\n But if the model included the likelihood of the cartilage actively adapting — growing thicker and cushier — when people ran, the odds of runners developing arthritis fell to about 13 percent, the same as for healthy walkers.\n What these results suggest is that cartilage is malleable, Dr. Ross says. It must be able to sense the strains and slight damage from running and rebuild itself, becoming stronger. In this scenario, running bolsters cartilage health.\n Modeled results like these are theoretical, though, and limited. They do not explain how cartilage remodels itself without a blood supply or if genetics, nutrition, body weight, knee injuries and other factors affect individual arthritis risks. Such models also do not tell us if different distances, speeds or running forms would alter the outcomes. To learn more, we will need direct measures of molecular and other changes in living human cartilage after running, Dr. Miller says, but such tests are difficult.\n Still, this study may quiet some runners’ qualms — and those of their families and friends. “It looks like running is unlikely to cause knee arthritis by wearing out cartilage,” Dr. Ross says.", "posttime": "2020-10-28 12:54:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "不会,won,跑步", "title": "为什么跑步不会毁了你的膝盖", "title_en": "Why running won't ruin your knees", "transed": 1, "url": "https://www.nytimes.com/2020/10/21/well/move/why-running-wont-ruin-your-knees.html", "via": "", "real_tags": ["不会", "won", "跑步"]}, {"category": "", "categoryclass": "", "imagename": "cc84db356d2ac4ec40d44834554f4c86.jpg", "infoid": 1031703, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "名为Serial 1 Cycle Company的新业务最初是摩托车制造商产品开发中心内的一个项目。这个名字来源于“序列号1”，这是哈雷戴维森已知最古老的摩托车的昵称。\n踏板辅助电动自行车公司是在新冠肺炎疫情后需求不断增长的推动下蓬勃发展的电动自行车行业中成立的。根据哈雷-戴维森(Harley-Davidson)的数据，2019年全球电动自行车市场估计将超过150亿美元，预计从2020年到2025年的年增长率将超过6%。\n新的哈雷戴维森品牌Serial 1没有提供其新的电动自行车系列产品的性能细节或其他规格。然而，该公司确实发布了几张第一款车型的照片。\n这项新业务的推出也正值这家总部位于密尔沃基的摩托车制造商的关键时刻，由于其核心客户基础老化，其摩托车销售放缓。\n今年7月，哈雷-戴维森(Harley-Davidson)在全球业务部门裁员700人，这是一项名为“改头换面”的内部品牌重组计划的一部分。哈雷-戴维森董事长、总裁兼首席执行官约亨·泽茨(Jochen Zeitz)在4月份公司第一季度收益电话会议上首次谈到了这一计划，此前该公司推出了第一款量产电动摩托车Livewire。\n新公司品牌总监亚伦·弗兰克(Aaron Frank)在一份声明中表示：“Serial 1的成立使哈雷-戴维森在这场移动性革命中发挥了关键作用，同时允许Serial 1专注于电动自行车客户，并提供植根于自由和冒险的无与伦比的骑行体验，”新公司的品牌总监亚伦·弗兰克(Aaron Frank)在一份声明中表示。\n哈雷-戴维森说，杰森·洪博培是Serial 1 Cycle的总裁。高管团队的其余成员包括产品开发副总裁本·隆德(Ben Lund)和首席品牌营销专家汉娜·阿尔滕伯格(Hannah Altenburg)。", "note_en": "The new business called Serial 1 Cycle Company started as a project within the motorcycle manufacturer’s product development center. The name comes from “Serial Number One,” the nickname for Harley-Davidson’s oldest known motorcycle.\n The pedal assist electric bicycle company is being launched amid a booming ebike industry fueled by growing demand in the wake of the COVID-19 pandemic. The global eBicycle market was estimated to be over $15 billion in 2019 and projected to grow at an annual rate of more than 6% from 2020 to 2025, according to Harley-Davidson.\n  The new Harley-Davidson brand Serial 1 didn’t provide performance details or other specs of its new line of electric bike products. However, the company did release several photos of its first model.\n  The new business launch also comes at a critical time for the Milwaukee-based motorcycle manufacturer, which has seen its sales slow as its core customer base ages out of its motorcycles.\n In July, Harley-Davidson cut 700 jobs from its global operations as part of an internally branded restructuring plan called “The Rewire.” The plan, which Harley-Davidson chairman, president and CEO Jochen Zeitz first spoke about in the company’s first-quarter earnings call back in April, followed the launch of the company’s first production electric motorcycle the Livewire.\n “The formation of Serial 1 allows Harley-Davidson to play a key role in this mobility revolution while allowing Serial 1 to focus exclusively on the eBicycle customer and deliver an unmatched riding experience rooted in freedom and adventure,” Aaron Frank, the new company’s brand director said in a statement.\n Harley-Davidson said Jason Huntsman is president of Serial 1 Cycle. The rest of the executive team includes Ben Lund, who is vice president of product development and Hannah Altenburg as lead brand marketing specialist.", "posttime": "2020-10-28 12:37:14", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "戴维森,davidson,摩托车", "title": "\n哈雷戴维森正在进军电动自行车行业。", "title_en": "\n\t\t\t\tHarley-Davidson is getting into the electric bicycle business\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/harley-davidson-is-getting-into-the-electric-bicycle-business/", "via": "", "real_tags": ["戴维森", "davidson", "摩托车"]}, {"category": "", "categoryclass": "", "imagename": "778b5ac5f0146f57a7ec6f42afda2e57.jpeg", "infoid": 1031702, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "据知情人士透露，Visa Inc.斥资53亿美元收购金融科技领域一家关键企业的交易因反垄断担忧而岌岌可危。\n司法部可能很快就会决定是否起诉阻止Visa收购Play Inc.，这家公司提供支撑一系列下一代金融应用程序的技术基础设施。在今年大部分时间里都在仔细审查这笔交易后，商务部担心这可能会限制支付领域新生的竞争…", "note_en": "Visa Inc.’s $5.3 billion deal to buy a key player in the financial-technology space is in jeopardy because of antitrust concerns, according to people familiar with the matter.\n  The Justice Department could decide soon whether it will sue to block Visa’s acquisition of Plaid Inc., a firm that provides the technological infrastructure underpinning an array of next-generation financial apps. After spending the better part of the year scrutinizing the deal, the department is concerned it could limit nascent competition in the payments...", "posttime": "2020-10-28 12:27:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,计划,planned,金融", "title": "Visa计划收购格子布面临司法部反垄断审查", "title_en": "Visa’s Planned Purchase of Plaid Faces Antitrust Scrutiny at Justice Department", "transed": 1, "url": "https://www.wsj.com/articles/visas-planned-purchase-of-plaid-faces-antitrust-scrutiny-at-the-justice-department-11603819000", "via": "", "real_tags": ["rust", "计划", "planned", "金融"]}, {"category": "", "categoryclass": "", "imagename": "9e93bea6b83fa2cadd1c226b2a9a8416.jpeg", "infoid": 1031701, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "与最近其他备受瞩目的科技听证会相比，参议院听证会的范围将更窄，更以政策为中心，具体关注通信体面法案(Communications Decency Act)第230条。这项简短的法律可能听起来晦涩难懂，但它是保护互联网公司免受其托管的用户生成内容(从Facebook帖子和推文到Yelp评论和评论部分)责任的关键法律盾牌。\n最近的大型科技听证会一直在曲折进行，很少会迫使一些世界上最强大的公司的领导人透露太多信息。但是，联邦反垄断行动的累积压力，不到一周后的高风险选举，以及一些可能废除让他们的业务成为可能的法律的立法提案，可能会设定不同的基调-并有望提供更多实质内容。\n你可以在这里(上图)关注听证会的实况转播，从美国东部时间10月28日(星期三)上午10点开始。我们将关注证词和第230条的所有内容，所以请回来查看我们今天的主要外卖报道。", "note_en": "The Senate hearing will have a narrower, more policy-centric scope than other recent high profile tech hearings, focusing specifically on  Section 230 of the Communications Decency Act. That short law might sound obscure, but it’s the  key legal shield that protects internet companies from liability for the user-generated content they host, from Facebook posts and tweets to Yelp reviews and comments sections.\n   Recent big tech hearings have meandered, seldom forcing the leaders of some of the world’s most powerful companies into revealing much. But the cumulative pressure of  federal antitrust action, a  high-stakes election less than a week away and a  number of legislative proposals that could dismantle the law that made their businesses possible will likely set a different tone — and hopefully offer more substance.\n You can follow a livestream of the hearing here (above) starting at 10:00 AM ET on Wednesday, October 28. We’ll be following the testimony and all things Section 230, so check back for our coverage of the day’s key takeaways.", "posttime": "2020-10-28 12:10:49", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,google,听证会", "title": "\n观看Facebook、Google和Twitter的首席执行官们为这项使国会能够使用社交媒体的法律辩护", "title_en": "\n\t\t\t\tWatch Facebook, Google, and Twitter’s CEOs defend the law that made social media possible to Congress\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/10/27/how-to-watch-senate-commerce-tech-hearing-october-zuckerberg-dorsey-pichai/", "via": "", "real_tags": ["facebook", "google", "听证会"]}, {"category": "", "categoryclass": "", "imagename": "d4d3f3e73884a2cb59152e3d6a9b9a88.jpg", "infoid": 1031700, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "滴水的水龙头背后的复杂动态，粘合垫可能会失效的方式，泥浆的破裂-这些事情可能看起来并不重要，甚至令人厌烦。L.Mahadevan不同意这一观点。作为哈佛大学应用数学、物理学以及有机体和进化生物学的教授，马哈德万利用数学和物理学探索平凡的现象，表明许多我们认为是理所当然的对象和行为，因此很少考虑，经过更仔细的研究，是相当不同寻常的。\n对马哈达文来说，日常生活有着巨大的魅力。纸张已经被证明是特别耐人寻味的：马哈德万描述了湿纸弯曲和弯曲时产生的“平面外变形”，一张皱巴巴的纸的几何形状，以及落下的纸的空气动力学行为。但他也对“麦片效应”提供了明确的解释--早餐麦片悬浮在牛奶中的倾向是聚集在一起或粘在碗上。他甚至在他为哈佛大学本科生期刊撰写的文章“看着油漆干了”中，常常认为这是他能想象到的最乏味的事情，而这一过程往往被斥为最无聊的事情。\n他指出，那篇文章“只是试图告诉学生，他们不必总是随大流。”大家都说要做大问题，这很好，但做小问题，然后逐步建立更广泛的了解，也是值得说的。“。\n尽管马哈德万的方法显然是非正统的，但他的工作为他赢得了认可和赞誉。1995年获得斯坦福大学博士学位后，他曾在一系列著名机构任职，包括麻省理工学院、剑桥大学和哈佛大学，同时发表了300多篇科学论文。他也是伦敦皇家学会的会员。他的追求使他在2006年获得了古根海姆奖学金，在2007年获得了搞笑诺贝尔奖(物理学)，并在2009年获得了麦克阿瑟奖学金-最后一次是因为他“将复杂的数学分析应用于物理和生物科学中各种看似简单但令人烦恼的问题”。\nMahadevan很感激他工作过的学校总是给他自由去探索他认为合适的周围环境。“在平凡中寻找崇高是一个古老的目标，”他说。“日常生活杂乱无章，许多现像不断争相吸引眼球，不乏问题。因此，我从来没有想过会感到无聊。“。\n“广达”杂志最近与Mahadevan进行了面对面(户外，安全距离)的交谈，并通过视频通话。为清楚起见，采访内容经过了浓缩和编辑。\n我一直都是这样的，这可能是一种文化上的东西。我不是那种认为某些问题比其他问题更大的人。在我看来，没有等级制度。什么是轻浮的，什么是重要的，似乎是一个无关紧要的问题。毕竟，大自然根本不在乎！\n这种观点可能源于经常发现自己“夹在两件事之间”。从印度来到美国后，我在斯坦福大学上学时在工程学和数学之间徘徊，后来在麻省理工学院当教员，然后在剑桥大学在数学和物理之间，现在在哈佛大学在生物、数学和物理之间。在不同学科之间生活的一个积极方面是，我可以独自一人在杂草中寻找自己的路。我很高兴探索了许多小的远景，当别人喜欢这些边缘的东西时，我总是感到惊讶。\n几十年来，你一直在关注纸张--皱巴巴的、湿的、折叠的、割伤的或掉落的。为什么这么着迷呢？\n你从一个小问题开始，它就会变成更大的问题。20多年前，也就是我科学生涯的早期，我开始考虑一张皱巴巴的纸。没有顿悟。我只是在思考它的结构-它的折痕和角落。我们仍然不知道如何描述褶皱的精确物理和数学，也不知道纸张在哪里以及如何褶皱。这个问题涉及到微分几何和微分方程。在广义相对论中可能会有一个类比，因为在一张皱巴巴的纸里有许多奇点，比如黑洞，这些奇点可以相互接触和相互作用。所以这是一个有趣而美丽的问题。但这仍然是一个悬而未决的问题。\n幸运的是，科学是非常宽容的。你可以犯错误或误入歧途一段时间，但从长远来看，这并不重要。科学是自我修正的，重要的是你最终做对了什么。\n至于做一些“正确的”事情，你最近在折纸方面取得了什么成功？\n虽然揉皱一张纸是一个非常混乱的过程，但折叠可以非常有序，这就是折纸的全部意义所在。今年早些时候，我们展示了如何通过采用平板并引入折叠来近似任何三维形状。事实证明，做到这一点的方法与通常的方法相反。通常情况下，人们开始在纸的边缘折叠，然后向内移动，但我们从纸的中心开始，从那里向外移动。这是以前没有人做过的事情，它使我们能够复制任何形状。同时，我们已经将这一新方法转化为一种可能用于计算或制造目的的算法。\n你用kirigami也有类似的结果，就像用剪刀折纸一样？\n在某些方面，kirigami甚至更漂亮，因为现在你可以进行切割了。我们再次证明，我们完全可以控制形状。通过使用我们(从离散微分几何)发现的数学原理，我们可以设计出一种算法，告诉我们从平板创建任何3D形状所需的切割模式。我们的下一步是将裁剪和折叠结合起来，从而成为更好的裁缝。\n进入自然界，你最近也在研究白蚁丘。你是怎么第一次遇到他们的，你学到了什么？\n2009年，在参观印度班加罗尔的一所农业大学时，我在校园漫步时第一次看到了一个白蚁丘。我对他们知之甚少，但我认为这将是一件很酷的事情。\n白蚁被认为是地球上最伟大的建筑师之一。几年前，在巴西发现了一个与英国一样大的白蚁土堆网络。在每个几米高的土堆里，生活着数百万毫米大小的白蚁。这相当于人类居住在几公里高的建筑物里。这些土堆是为了利用环境-温度、湿度和气体浓度得到很好控制的地方。\n我们研究了印度和纳米比亚白蚁丘的功能，最近开始了解它们是如何建造的。我们的实验表明，土丘的运作方式就像肺一样，每天呼吸一次，对外界温度的变化做出反应。我们有一个数学模型，它显示了土丘的几何形状、环境条件和白蚁行为是如何相互关联的。\n我们建造的建筑，就像白蚁丘一样，不是完全渗透的，也不是完全绝缘的。这个比喻转移到了最基本的生命形式上。例如，细胞不是没有包膜的细胞，包膜使它能够与外界交流，允许能量、物质和信息的转移--既不是完全绝缘的，也不是完全多孔的。\n从我们对白蚁的研究中，我们有动力对同样生活在大群体中的蜜蜂和蚂蚁提出类似的问题。例如，我们了解到，蜜蜂通过在入口处附近扇动翅膀来维持蜂箱(或蜂箱)内的温度。悬挂在树枝上的圆锥形蜂群有另一种调节温度的方式：天气冷的时候它们挤在一起，天气暖和的时候它们分散开来。如果树枝摇晃，树丛就会变平，以增加稳定性，防止蜜蜂被扔出树。这类似于当下面的地面摇晃时，你可能会本能地做的事情-蹲下以防止摔倒。\n当然，更大的问题是，有机体如何在没有计划或指定计划者的情况下，在比个人规模大得多的情况下，共同解决问题。我们开始在蚂蚁和机器人身上研究同样的问题，蚂蚁可以有巨大的扩张的群体。\n您还展示了白蚁丘的几何形状如何影响热量和信息素的扩散。你的作品中还有没有几何图形？\n几年前，我们从三个不同的角度观察禽蛋。首先，我们量化了1400多种鸡蛋的形状，方法是确定鸡蛋的偏心率--它离球体的距离有多远--以及不对称性。其次，我们展示了一种特殊的鸡蛋形状是如何形成的：蛋壳内的膜表现得像一个加压的气球，形状是由改变气球的厚度产生的，而不是来自僵硬的蛋壳。最后，我们考虑了鸡蛋形状的功能(和进化)方面，并得出了一个惊人的发现：狭长的鸡蛋与更好的飞行能力相关，尽管一些科学家并不相信这一点。\n在我的工作中，形状总是出现在我的作品中。我们最近分析了哺乳动物大脑如何折叠，以及脊椎动物肠环和线圈如何折叠的几何学和物理学。沿着类似的思路，我们刚刚分析了苹果的形状(在尚未发表的研究中)。最有趣的不是它几乎是球形的，而是茎和果实相遇的美丽的尖状特征。这一特征在富士苹果中是对称的，但在红色美味苹果中则不是。我们试图用数学来描述它，并在实验室里模拟它，我们可以用凝胶来做到这一点。\n我们为什么要关心这个呢？原因有两个。首先，大脑中的皱纹和苹果中的尖端是奇点-就像破碎的波浪一样。正如亚瑟·柯南·道尔(Arthur Conan Doyle)曾经写道，“奇点几乎总是一条线索。”另一个原因是它就在我们面前。我们不需要使用望远镜或显微镜，也不需要花费十亿美元来研究它--只需一只好奇的眼睛。\n你的很多工作听起来都很抽象。你对可能的申请考虑了多少？\n其实我觉得我的作品一点也不抽象。我从事的是每个人都能看到和体验，但很少有人愿意深入思考的事情。至于第二个问题，艺术家、音乐家或作家是否考虑过申请？为什么科学要这样做呢？好奇心是人的本性。这就够了，不是吗？\n但我应该补充一点，我对做有用或实用的事情一点也不傲慢。我拥有一些设备和算法的专利，就在今年，我们开发了潜在的协议，以减轻流行病的极端成本。\n另一方面，我也喜欢做一些纯粹为了好玩的事情，比如，为了决定三方赌注，设计一枚公平的三面硬币。\n一枚正常的硬币一半时间头朝上，一半时间反面朝上--几乎从来不会侧面着地。但是如果你把硬币做得很厚，这样它就会变成一个长长的圆柱体，几乎100%的时间它都会侧着地。硬币必须有多厚才能在三分之一的时间里侧着地？据说数学家约翰·冯·诺伊曼已经确定，如果一枚硬币的厚度与直径之比为1/(2√2)，那么它有三分之一的机会落在边缘上。大约十年前，我们展示过，如果你考虑角动量守恒的因素，你会得到一个不同的答案：一枚公平的三面硬币的宽径比应该是1/√3。一种描绘方式是把八个四分之三的硬币粘在一起。我们还进行了实验，证实我们是正确的，我们设计了一种方法来制作不同概率的定制硬币，正面、反面和“侧面”的概率都不同。\n你认为这类工作如何适应更广泛的研究领域？\n我在做没人关心的事情，我很高兴这样做。你可以通过观察最卑微的东西来了解这个世界。你不必学习宇宙学或治愈癌症。正如威廉·布莱克曾经写道：“去看…。野花里的天堂/把无限握在手心。“。我们还研究了花朵的盛开和像手掌上那样的折痕状无限的形成。\n我还相信，我所做的工作表明，你不必费力去问关于这个世界的非常深刻和深刻的问题。也许有一条线贯穿了我所做的各种事情。我的观点是，这条线编织的布料只有在这段旅程结束时才能看到，如果有的话。但就目前而言，我真正关心的是旅程本身。\n我经常遛狗，当我遛狗的时候，我经常对它的行为感到好奇。他闻了闻地面，也抬起了头。他这样做是为了对世界有一种感觉，嗅觉。在地面附近，他得到了准确的信号，但这是当地的。从空中看，信号是不准确的，但范围很远。我们把局部线索称为知识及其积累的智慧，而狗(和我们人类)需要这两种信息才能成功。我是怎么学到这个的？不让我遛狗。", "note_en": "The complex  dynamics behind a dripping faucet, the ways  adhesive pads can fail, the  cracking of mud — these matters might seem unimportant, or even boring. L. Mahadevan disagrees. A professor of applied mathematics, physics, and organismic and evolutionary biology at Harvard University, Mahadevan uses mathematics and physics to explore commonplace phenomena, showing that many of the objects and behaviors we take for granted, and consequently give little thought to, are quite extraordinary upon closer examination.\n For Mahadevan, the everyday world holds great fascination. Paper has proven particularly intriguing: Mahadevan has  described the “out-of-plane deformations” that arise when wet paper bends and buckles,  the geometry of a crumpled sheet of paper, and  the aerodynamic behavior of falling paper. But he’s also provided  the definitive explanation of the “Cheerios effect” — the propensity of breakfast cereals suspended in milk to clump together or cling to the bowl. He even took on a process often dismissed as the dullest thing imaginable in his essay “ Watching Paint Dry,” written for a Harvard undergraduate journal.\n That essay, he noted, “was just an attempt to tell students they don’t always have to follow the crowd. Everyone says they should work on the big questions, which is fine, but there’s also something to be said for working on the little questions and then gradually building a broader understanding.”\n  Although Mahadevan’s approach is clearly unorthodox, his work has earned him recognition and acclaim. After receiving a doctorate from Stanford University in 1995, he’s held appointments at a string of prestigious institutions, including the Massachusetts Institute of Technology, the University of Cambridge and Harvard, while publishing more than 300 scientific papers. He’s also a fellow of the Royal Society of London. His pursuits have earned him a Guggenheim fellowship in 2006, an Ig Nobel Prize (in physics) in 2007 and a MacArthur fellowship in 2009 — the last for applying “complex mathematical analyses to a variety of seemingly simple, but vexing, questions across the physical and biological sciences.”\n Mahadevan is grateful that the schools he’s worked for have always given him the freedom to explore his surroundings as he sees fit. “Finding the sublime in the mundane is an old goal,” he said. “Since the everyday world is messy, with many phenomena continuously vying for attention, there is no dearth of problems. Consequently, I never expect to be bored.”\n Quanta Magazine spoke with Mahadevan recently in person (outdoors, at a safe distance) and via video call. The interview has been condensed and edited for clarity.\n  I’ve always been this way, which may be a cultural thing. I’m not the kind of person who thinks some problems are bigger than others. In my mind, there is no hierarchy. What is frivolous and what is important seems like an irrelevant question. After all, nature does not care!\n That perspective may stem from regularly finding myself “in between things.” After coming to the U.S. from India, I was between engineering and mathematics as a student at Stanford and later as a faculty member at MIT, then between mathematics and physics at Cambridge, and now between biology, mathematics and physics at Harvard. One positive aspect of being between disciplines is being left alone to find my own way through the weeds. I have delighted in exploring many little vistas, and I’m always surprised when others take pleasure in these marginalia.\n You’ve had a decades-long preoccupation with paper — crumpled, wet, folded, cut or falling. Why the fascination?\n You start with one little question and it turns into something much bigger. I began thinking about  a crumpled sheet of paper more than 20 years ago, early in my scientific career. There was no epiphany. I was just contemplating its structure — its creases and corners. We still don’t know how to describe the precise physics and mathematics of crumpling, just where and how the paper crumples. The problem involves differential geometry and differential equations. And there may be an analogy in general relativity because inside a crumpled sheet of paper there are many singularities, like black holes, and these singularities can touch and interact with each other. So it’s an interesting, beautiful problem. But it’s still an unsolved problem.\n Fortunately, science is very forgiving. You can make mistakes or go astray for a while, but that doesn’t matter in the long run. Science is self-correcting, and what matters is what you ultimately get right.\n  As for getting something “right,” what recent success have you had with  origami?\n Whereas crumpling a sheet of paper is an extremely disordered process, folding can be very ordered, and that’s what origami is all about. Earlier this year  we showed how to approximate any three-dimensional shape by taking a flat sheet and introducing folds. The way to do that turns out to be the opposite of the usual approach. Normally people start folding on the paper’s boundaries and move inward, but instead we start in the center of the paper and move outward from there. That’s something no one has done before, and it enables us to reproduce any shape. Meanwhile, we’ve converted this new approach to an algorithm that could potentially be used for computational or manufacturing purposes.\n  And you’ve had similar results with  kirigami, which is like origami with scissors?\n In some ways, kirigami is even more beautiful, because now you can make cuts. We’ve  proved, once  again, that we can completely control the shape. And by using the mathematical principles we’ve uncovered [from discrete differential geometry], we can devise an algorithm that tells us the pattern of cuts needed to create any 3D shape from a flat sheet. Our next step is to combine cuts and folds, thereby becoming even better tailors.\n Moving into the natural world, you’ve also been studying termite mounds recently. How did you first come across them, and what have you learned?\n While visiting an agricultural college in Bangalore [India] in 2009, I saw a termite mound for the first time during a stroll through campus. I knew little about them but decided it would be a cool thing to study.\n Termites are considered among the greatest architects on Earth. A couple of years ago, a network of termite mounds in Brazil was discovered that is as large as Great Britain. Inside each mound, which is a few meters tall, millions of millimeter-sized termites live. That’s comparable to humans living in buildings a few kilometers high. The mounds are built to harness the environment — places where temperature, humidity and gas concentrations are well controlled.\n We have studied the function of termite mounds in both India and Namibia, and most recently have begun to understand the principles of how they are built. Our experiments showed that the mound operates like a lung, breathing once a day in response to external temperature changes. And  we have a mathematical model that shows how the mound geometry, environmental conditions and termite behavior are all interrelated.\n  We build buildings that, like termite mounds, are not completely porous but not completely insulated either. That metaphor transfers to the most basic forms of life. For example, a cell is not a cell without an envelope that enables it to communicate with the outside world, allowing for the transfer of energy, matter and information — not completely insulated nor completely porous.\n From our work on termites, we were motivated to ask similar questions about bees and ants, which also live in large colonies. We learned, for instance, that  bees maintain the temperature within a bee box [or hive] by fanning their wings near the entrance. Conical clusters of bees hanging from a tree branch have another way of regulating their temperature: They huddle together when it’s cold and spread out when it’s warmer. And if the branch is shaken, the cluster flattens itself to increase stability and keep bees from being thrown from the tree. That’s similar to what you might instinctively do when the ground below is shaken — crouch to keep from falling down.\n  The bigger question, of course, is how organisms can collectively solve problems without planning, or a designated planner, on scales much larger than an individual. We’re starting to look into these same questions with ants, which can have huge extended colonies, and robots.\n You’ve also shown how the geometry, or shape, of a termite mound affects the diffusion of heat and pheromones. How else has geometry figured in your work?\n A couple of years ago, we looked at  avian eggs from three different angles. First, we quantified the egg shapes of more than 1,400 species by determining an egg’s eccentricity — how far it deviates from a sphere — and asymmetry. Second, we showed how a particular egg shape comes to be: The membrane inside the shell behaves like a pressurized balloon, and shape arises from varying the thickness of the balloon, not from the stiff shell. Finally, we considered the functional [and evolutionary] aspects of egg shape and made a striking finding: Narrow, elongated eggs correlate with better flight ability, although some scientists are not convinced of this.\n Shape comes up all the time in my work. We recently analyzed the geometry and physics of how  mammalian brains fold and how  vertebrate intestines loop and coil. Along a similar vein, we have just analyzed the shape of an apple [in not-yet-published research]. The most interesting thing is not that it’s almost spherical, but rather the beautiful cusplike feature where the stalk meets the fruit. That feature is symmetric in a Fuji apple but not in a Red Delicious. We tried to describe it mathematically and mimic it in the lab, which we were able to do with gel.\n Why do we care? There are two reasons. For one thing, creases in the brain and cusps in apples are singularities — just like breaking waves. And as Arthur Conan Doyle once wrote, a “singularity is almost invariably a clue.” The other reason is that it’s right in front of us. We don’t have to use a telescope, or a microscope, or spend a billion dollars to study it — just an inquisitive eye.\n  Much of your work sounds pretty abstract. How much thought do you give to possible applications?\n I actually think my work is far from abstract . I work on things that everyone can see and experience, but few care to think about deeply. As for the second question, does an artist, musician or writer think about applications? Why does science have to do so? It is human to be curious. That is enough, isn’t it?\n But I should add that I’m not at all snooty about working on useful or practical things. I have patents on a few devices and algorithms, and just this year we  developed potential protocols for mitigating the extreme costs of pandemics.\n On the other hand, I also like doing things for the sheer fun of it, like, for instance, designing a fair three-sided coin in order to decide a three-way bet.\n   A normal coin lands with heads facing up half the time, tails facing up half the time — almost never on its side. But if you make the coin really thick, so it becomes a long cylinder, it will land on its side almost 100% of the time. How thick does the coin have to be to land on its side exactly one-third of the time? The mathematician John von Neumann is said to have determined that a coin has a 1/3 chance of landing on its edge if the ratio of its thickness to its diameter is 1/(2√2). About a decade ago  we showed that if you factor in the conservation of angular momentum, you get a different answer: A fair three-sided coin should have a width-to-diameter ratio of 1/√3. One way of picturing that is to glue eight quarters together. We also carried out experiments confirming that we were right, and we devised a method for creating customized coins with varying probabilities of heads, tails and “sides.”\n How do you think this kind of work fits into the greater body of research?\n I work on things nobody cares about, and I’m quite happy that way. You can learn about the world by looking at the humblest of things. You don’t have to study cosmology or cure cancer. As William Blake once wrote: “To see … Heaven in a Wild Flower / Hold Infinity in the palm of your hand.” And we have studied  the blooming of flowers and  the formation of creaselike infinities like those in the palm of one’s hand.\n  I also believe that the work I’ve done shows that you don’t have to struggle to ask very deep and profound questions about the world. Maybe there is a thread that winds through the various things I’ve taken up. My opinion is that the fabric this thread is woven into will only be visible, if at all, at the end of this journey. But for now, all I really care about is the journey itself.\n  I walk my dog regularly, and when I do, I often wonder about his behavior. He sniffs the ground and also holds his head up high. He does that to get a sense of the world, olfactorily. Near the ground, he gets an accurate signal, but it’s local. From the air, the signal is inaccurate but long-range. We call the local cue knowledge and its accumulation wisdom, and the canine (and we humans) need both kinds of information to succeed. How did I learn this? From walking my dog.", "posttime": "2020-10-28 12:06:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "科学家,乐于,delights", "title": "一位乐于平凡的科学家", "title_en": "A Scientist Who Delights in the Mundane", "transed": 1, "url": "https://www.quantamagazine.org/l-mahadevan-finds-math-inspiration-in-the-mundane-20201026/", "via": "", "real_tags": ["科学家", "乐于", "delights"]}, {"category": "", "categoryclass": "", "imagename": "7443bf4030ebbac51d19b3fd149acd2c.jpg", "infoid": 1031698, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Folding@home项目分享了模拟SARS-CoV-2病毒蛋白质的新成果，以更好地了解它们的功能以及如何阻止它们。\nFolding@home是一种分布式计算成果，当用户的PC空闲时，它使用小型客户端来运行生物医学研究的模拟。客户端相互独立地操作，以执行自己独特的模拟，并将结果发送到F@h服务器。(了解更多有关Folding@Home网络的管理位置以及它如何突破exaFLOPS障碍的信息。)。\n在对SARS-CoV-2病毒的模拟中，F@h首先针对的是棘突，即病毒表面的锥形附属物，由三种蛋白质组成。尖刺必须打开，才能附着在人类细胞上，才能渗透和复制。F@h；的任务是模拟这个开放的过程，以获得对开放状态的独特洞察力，并找到一种方法来抑制尖峰与人类细胞之间的联系。\n它确实做到了。在一篇新发表的论文中，Folding@home团队表示，他们能够模拟出前所未有的0.1秒的病毒蛋白质组。他们捕捉到了刺突复合体戏剧性的打开，以及其他蛋白质的形状变化，揭示了50多个神秘的口袋，这些口袋扩大了抗病毒药物设计的靶向选择。\n华盛顿大学(Washington University)生物化学副教授、Folding@home的负责人格雷格·鲍曼(Greg Bowman)博士说，尖刺通过折叠自己来保护它们的受体结合位点，从而躲避免疫系统，这有点像海龟拉进壳里的方式。但最终，他们将不得不敞开大门，找到一个潜在的东道主。\n这就是F@h的目标。我们知道这件事正在发生，但不知道它看起来是什么样子。鲍曼告诉我，在模拟中，我们看到了比实验中看到的更广泛的开放。\n从F@h模拟得到的模型表明，尖峰打开并暴露了埋藏面。这些表面是感染人类细胞所必需的，也可以被结合到表面的抗体或抗病毒药物作为靶点，以中和病毒，防止它感染某人。\n通过产生比其他任何人都多100倍以上的数据，我们能够捕捉到一些事件，比如尖峰的戏剧性打开，暴露出人们原本预计不会是可行目标的表面。同样，我们还发现了在许多其他病毒蛋白中产生新奇口袋的张开动作。所有这些新的结构特征都可能成为有用的药物靶点。鲍曼说：我们在网上分享所有的数据，这样其他人就可以利用这些数据来了解病毒，并在我们自己的努力的同时开发抗病毒药物。\n为此，Folding@Home正在参与一个名为Covid Moonshot的项目，这是一个开放的科学合作项目，旨在设计小分子来阻止病毒复制。Covid Moonshot团队正在使用Folding@Home在大型化学药库中筛选最有可能是有用的抗病毒药物，这些化学物质正在由实验合作者合成和测试。\n在新冠肺炎之前，Folding@home是一个相当温和的项目，在华盛顿大学和其他学校只有30,000名用户和几台服务器。当大流行来袭时，NVIDIA向其用户发出了战斗号召，该组织突然增加了近100万用户，其服务器严重超载。\n从那时起，科技行业真的站出来提供帮助。鲍曼说，微软、NVIDIA、AMD、英特尔、AWS、甲骨文和思科都在硬件和云服务方面提供了帮助。Pure Storage捐赠了一个1PB的全闪存存储阵列。Linus Tech Tips是一个面向家庭系统建设者的业余YouTube频道，拥有1200万粉丝，它设置了一个100TB的服务器服务器来减轻负担。\n鲍曼说：我们非常感谢大家的帮助。来自公民科学家的大量支持和科技行业的帮助为我们打开了否则就不会有的科学机会。\n在其高峰期，F@h有超过2.5exaFLOPS的计算量，或2500千万亿次浮点运算。截至10月下旬，这一数字已降至247petaflops。\n然而，鲍曼看到了它的好处：它仍然比美国最快的超级计算机顶峰(Summit)有更强的马力。\n加入Facebook和LinkedIn上的网络世界社区，就最重要的话题发表评论。", "note_en": "The Folding@home project has shared new results of its efforts to simulate proteins from the SARS-CoV-2 virus to better understand how they function and how to stop them.\n Folding@home is a distributed computing effort that uses small clients to run simulations for biomedical research when users&#39; PCs are idle. The clients operate independently of each other to perform their own unique simulation and send in the results to the F@h servers. (Read more about where the Folding@home network is administered and  how it broke the exaFLOPS barrier.)\n In its SARS-CoV-2 simulations, F@h first targeted the spike, the cone-shaped appendages on the surface of the virus consisting of three proteins. The spike must open to attach itself to a human cell to infiltrate and replicate. F@h&#39;s mission was to simulate this opening process to gain unique insight into what the open state looks like and find a way to inhibit the connection between the spike and human cells.\n  And it did so. In a  newly published paper, the Folding@home team said it was able to simulate an &#34;unprecedented&#34; 0.1 seconds of the viral proteome. They captured dramatic opening of the spike complex, as well as shape-shifting in other proteins that revealed more than 50 &#34;cryptic&#34; pockets that expand targeting options for the design of antivirals.\n Dr. Greg Bowman, associate professor of biochemistry at Washington University and leader of Folding@home, said the spikes hide from the immune system by folding up on themselves to protect their receptor-binding sites, kind of like how a turtle pulls into its shell. Eventually, though, they would have to open up to find a potential host.\n That was what F@h targeted. &#34;We knew it was happening but not what it looked like. In the simulations, we see far more extensive opening than had been seen experimentally,&#34; Bowman told me.\n  The model derived from the F@h simulations shows that the spike opens up and exposes buried surfaces. These surfaces are necessary for infecting a human cell and can also be targeted with antibodies or antivirals that bind to the surface to neutralize the virus and prevent it from infecting someone.\n &#34;By generating over 100-fold more data than anyone else has access to, we were able to capture events like a dramatic opening of the spike that exposes surfaces one wouldn&#39;t otherwise have expected were viable targets. Likewise, we also found opening motions that create novel pockets in many other viral proteins. All these new structural features could be useful drug targets. We&#39;re sharing all the data online so that others can use it to understand the virus and develop antivirals in parallel with our own efforts,&#34; Bowman said.\n  To that end, Folding@home is taking part in a project called  Covid Moonshot, an open science collaboration to design small molecules to block viral replication. The Covid Moonshot team is using Folding@home to screen through large libraries of chemicals for the ones that are most likely to be useful antiviral drugs, and those chemicals are being synthesized and tested by experimental collaborators.\n  Before COVID-19, Folding@home was a rather modest project with 30,000 users and a few servers at Washington University and other schools. When the pandemic hit, and Nvidia put out a call to arms to its users, the organization suddenly gained nearly a million users and its servers were massively overloaded.\n From there, the tech industry really stepped up to help. Bowman said Microsoft, Nvidia, AMD, Intel, AWS, Oracle, and Cisco all helped with hardware and cloud services. Pure Storage  donated a one petabyte all-flash storage array. Linus Tech Tips, a hobbyist YouTube channel for home system builders with 12 million followers,  set up a 100TB server to take the load off.\n &#34;We&#39;re extremely grateful for all the help,&#34; Bowman said. &#34;The massive outpouring of support from citizen scientists and the help from the tech industry opened up scientific opportunities we wouldn&#39;t have had otherwise.&#34;\n  At its peak, F@h had more than 2.5 exaFLOPS of computation to throw at the problem, or 2,500 petaFLOPS. As of late October, that has dropped to  247 petaFLOPS.\n However, Bowman sees an upside to it: That&#39;s still more horsepower than Summit, the fastest supercomputer in the United States.\n  Join the Network World communities on  Facebook and  LinkedIn to comment on topics that are top of mind.", "posttime": "2020-10-28 11:42:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发现,home,病毒", "title": "折叠@家用亿级超级计算机发现新冠肺炎治愈的潜在目标", "title_en": "Folding@Home Exascale Supercomputer Finds Potential Targets For COVID-19 Cure", "transed": 1, "url": "https://www.networkworld.com/article/3587388/foldinghome-exascale-supercomputer-finds-potential-targets-for-covid-19-cure.html", "via": "", "real_tags": ["发现", "home", "病毒"]}, {"category": "", "categoryclass": "", "imagename": "eb4b0cd6ddf9e7a9ac9e291aade4d8b9.jpeg", "infoid": 1031696, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "巴拉克·戈瓦尼(Barak Govani)今年早些时候在亚马逊(Amazon.com)下了大赌注，现在他后悔了。他关闭了位于洛杉矶梅尔罗斯大道(Melrose Avenue)的New York Speed服装店，打包了150万美元(210万美元)的库存，运往全国各地的亚马逊仓库，将自己的命运交到了一家经常向世界展示自己是小企业朋友的公司手中。\n今天，这位41岁的零售业老手身无分文，在他母亲的家和他妹妹的家之间沙发冲浪。戈瓦尼希望通过让亚马逊支付他的库存费用来重新开始，亚马逊在暗示他的产品可能是假货后销毁了库存-戈瓦尼极力否认这一指控。\n他的律师在9月份要求他赔偿80万美元，并附上发票，以证实他的商品直接来自时尚品牌，他们正在等待亚马逊的回应。\n戈瓦尼说，我这一辈子都是早上5点半起床，每周工作40、50、60个小时。那份库存就是我的全部。亚马逊毁了我的生活，我没有做错任何事。\n亚马逊已经成为世界上最大的电子商务公司，这在很大程度上要归功于数百万选择在其庞大的市场上开店的第三方商家。在该公司向全球客户销售的商品中，有一半以上来自中小企业，在截至5月31日的一年里，仅中小企业就销售了34亿件产品。小企业在亚马逊上的平均年销售额为16万美元，比前一年增长了约60%。\n在博客和新闻稿中，亚马逊强调这些商家的成功是双赢的。像戈瓦尼这样的商人在公关的耀眼光芒中迷失了方向。\n像他这样的故事多年来一直在在线商家论坛和会议上流传。亚马逊可以随时以任何理由暂停卖家，切断他们的生计，并将他们的资金冻结数周或数月。商家必须驾驭一个基本上自动化的、有罪的、直到被证明无罪的过程，亚马逊在这个过程中担任法官和陪审团。他们的电子邮件和电话可能无人应答，或者亚马逊的回复令人费解，这让卖家怀疑他们受到了算法的摆布，几乎没有人的监督。\n那份清单就是我的全部。亚马逊毁了我的生活，我没做错什么\n零售商巴拉克·戈瓦尼(Barak Govani)。\n追索权是有限的，因为当商家在亚马逊上开店时，他们放弃了在法庭上呆一天的权利，同意通过有约束力的仲裁来解决任何纠纷。亚马逊不与商家协商条款。样板协议是一个要么接受要么放弃的协议，这清楚地提醒人们，谁在两国关系中占据上风。\n亚马逊如何对待第三方卖家是众议院司法委员会(House Judiciary Committee)最近一份报告的核心内容，该报告得出结论称，大型科技公司经常对规模较小的合作伙伴滥用权力。该委员会的建议包括向卖家提供足够的追索权，取消合同中剥夺他们提起诉讼的强制仲裁条款。\n报告称，由于停牌或退市带来的严重财务影响，许多亚马逊第三方卖家生活在对该公司的恐惧中。这是因为亚马逊的内部纠纷解决系统的特点是不确定、反应迟钝和决策过程不透明。\n在一份通过电子邮件发送的声明中，亚马逊的一位女发言人表示，公司努力确保其网站上出售的产品是正品，并提供公平的纠纷解决程序。\nGovani销售服装已有20多年的历史，主要是雨果·博斯(Hugo Boss)、卡尔文·克莱恩(Calvin Klein)和Lucky等品牌。大约十年前，他开始通过在亚马逊(Amazon)和易趣(EBay)等网络市场上投放商品来补充他的门店销售。亚马逊成为最有效的合作伙伴，占他在线销售额的90%以上。\n最初，戈瓦尼亲自储存、包装和运输所有订单，并向公司支付每笔销售的佣金。亚马逊代表建议他尝试亚马逊履行服务，这是一项收取额外费用的服务。Govani决定将他所有的库存发送到亚马逊，成为截至5月31日的一年中尝试这项服务的45万家企业之一。\n戈瓦尼的问题很快就开始了。今年4月，亚马逊给他发了一封电子邮件，说他的账户正在接受审查，因为有四个客户投诉他的产品是不正宗的。\n为了确保顾客可以放心地在亚马逊上购物，我们认真对待不真实的投诉，信息中写道。严禁在亚马逊上销售假冒产品。\n一位来自加利福尼亚州圣拉斐尔的原告对一件价值125美元的幸运摩托夹克的合身感到不满，她说她在怀疑这是不是假的。戈瓦尼退还了她的钱，并解释说，用不同材料制成的夹克穿起来不同。\n另一位购物者对他的Calvin Klein内裤被装在一个破损的纸箱里送到时感到不安。这位购物者在一次产品评论中说，盒子几乎坏了，这件商品是仿冒品。目前尚不清楚为什么亚马逊会将另外两起投诉--用纸巾包裹和信封装运的衣服--定性为不真实。\nGovani对暂停提出上诉，并向亚马逊提交了这些品牌的发票。他的发票是一年多以前的，因为那是他购买库存的时候，但亚马逊想要的是之前365天的发票。戈瓦尼接到通知，如果他不在7月中旬之前取回库存，他的库存将被销毁。商家必须向亚马逊支付额外的库存移除费用。\n戈瓦尼希望恢复他的账户，并继续在网站上销售，他推迟了这一决定。他总共收到了11封来自亚马逊的电子邮件，每封邮件都告诉了他不同的日期，如果他没有删除他的库存，那么在这个日期他的库存就会被销毁。他要求亚马逊澄清相互冲突的日期。当他试图通过亚马逊的门户网站提交库存清除订单时，它不让他这么做。\n这位女发言人说，亚马逊一再要求戈瓦尼提供证据，证明所售产品是正品，但他寄出的发票要么难以辨认，要么与品牌所有者的记录不符。\n她说：作为我们争议解决程序的一部分，在几次上诉后未能解决问题后，我们分别六次通知这位卖家，他们需要在特定日期前将库存从我们的商店移走，否则库存将被销毁。&#34；卖家未能要求在提供的日期之前清空库存。&#34；\n7月底，戈瓦尼向首席执行官杰夫·贝佐斯发出了一封惊慌失措的电子邮件。他与亚马逊一位名叫布里吉特·M·M·布里吉特(Brigitte M.&34；)的代表交换了电子邮件，后者承诺将进行调查。布里吉特·M在8月3日给出了最后的回应，重申她无能为力。\n亚马逊在使用算法将可疑的仿冒品从网站上剔除方面更加积极，顾问们表示，戈瓦尼的经历是常见的。\n前亚马逊人克里斯·麦凯布(Chris McCabe)现在帮助商家驾驭上诉过程，他表示，因投诉假冒产品而被暂停的情况正在上升，而且往往是由竞争对手提出的，目的是破坏竞争对手。\n在众议院小组作证的麦凯布说，许多卖家发现自己没完没了地上诉[反对]这一点，结果却听到他们的发票不可接受，或者他们的供应商无法核实，但没有任何迹象说明原因。或者他们没有收到回复。&#34；\n如果亚马逊拒绝偿还Govani的库存，他的下一步是具有约束力的仲裁，众议院小组表示，这让亚马逊在争端中占据上风。报告称，从2014年到2019年，只有163家亚马逊商家对该公司提起仲裁诉讼，因为卖家普遍意识到这一过程是不公平的，不太可能产生有意义的补救措施。\nGovani&39；的律师马里奥·西蒙尼安(Mario Simonyan)曾在类似纠纷中代表亚马逊的其他卖家，他怀疑亚马逊会提出低价报价，迫使Govani决定是否愿意支付仲裁费用，仲裁费用可能高达数万美元。\nGovani说，他渴望在一个全新的领域开始一项新的业务-可能是建筑业-尽管他的职业生涯是在零售业度过的。\n戈瓦尼说：我不想回到网上零售行业，尽管这是我唯一擅长的事情。我太害怕在亚马逊上卖东西了。这真是令人伤脑筋。&#34；\n每天下午将市场上一天的简明总结、突发商业新闻和专家意见发送到您的收件箱。在这里注册“先驱报”，在这里注册时代。", "note_en": "Barak Govani made a big bet on Amazon.com earlier this year that he now regrets. He shut his New York Speed clothing store on Los Angeles&#39; storied Melrose Avenue, packed up $US1.5 million ($2.1 million) in inventory and shipped it to Amazon warehouses around the country, putting his fate in the hands of a company that has routinely presented itself to the world as a friend of small business.\n Today, the 41-year-old retail veteran is broke and couch-surfs between his mother&#39;s home and his sister&#39;s place. Govani hopes to start anew by getting Amazon to pay him for inventory the company destroyed after suggesting his products could be fake - an accusation Govani strenuously denies.\n  His lawyer in September sent a demand for $US800,000, along with invoices to verify his merchandise came directly from fashion brands, and they&#39;re waiting for Amazon&#39;s response.\n &#34;All my life, I&#39;d wake up at 5.30am and work 40, 50, 60 hours each week,&#34; Govani said. &#34;That inventory was everything I had. Amazon ruined my life, and I did nothing wrong.&#34;\n  Amazon has become the world&#39;s largest e-commerce company in large part thanks to the millions of third-party merchants who have chosen to set up shop on its sprawling marketplace. Small- and medium-size businesses are responsible for more than half of the goods the company sells to customers around the world, moving 3.4 billion products alone in the year ending May 31. The average small business has annual sales of $US160,000 on Amazon, up about 60 per cent from the previous year.\n In blogs and news releases, Amazon highlights the success of these merchants as a win-win. Lost in the public-relations glare are merchants like Govani.\n Stories like his have swirled for years in online merchant forums and conferences. Amazon can suspend sellers at any time for any reason, cutting off their livelihoods and freezing their money for weeks or months. The merchants must navigate a largely automated, guilty-until-proven-innocent process in which Amazon serves as judge and jury. Their emails and calls can go unanswered, or Amazon&#39;s replies are incomprehensible, making sellers suspect they&#39;re at the mercy of algorithms with little human oversight.\n That inventory was everything I had. Amazon ruined my life, and I did nothing wrong\n Retailer Barak Govani\n Recourse is limited because, when merchants set up shop on Amazon, they waive their right to a day in court by agreeing to binding arbitration to resolve any disputes. Amazon doesn&#39;t negotiate terms with merchants. The boiler plate agreement is take-it-or-leave-it, a telling reminder of who has the upper hand in the relationship.\n  How Amazon treats third-party sellers is at the heart of a recent House Judiciary Committee report concluding that big technology companies often abuse their power over smaller partners. The committee&#39;s recommendations include providing adequate recourse to sellers and eliminating forced arbitration clauses from contracts that deprives them from filing a lawsuit.\n &#34;Because of the severe financial repercussions associated with suspension or delisting, many Amazon third-party sellers live in fear of the company,&#34; the report states. &#34;This is because Amazon&#39;s internal dispute resolution system is characterised by uncertainty, unresponsiveness and opaque decision-making processes.&#34;\n In an emailed statement, an Amazon spokeswoman said the company worked hard to ensure products sold on its site were authentic and to provide a fair dispute resolution process.\n Govani has been selling clothes for more than 20 years, mostly brands such as Hugo Boss, Calvin Klein and Lucky. About a decade ago, he began supplementing his store sales by putting merchandise on web marketplaces including Amazon and eBay. Amazon emerged as the most effective partner, accounting for more than 90 per cent of his online sales.\n  Initially, Govani stored, packed and shipped all the orders himself, paying the company a commission on each sale. Amazon representatives suggested he try Fulfillment by Amazon, a service that handles that for additional fees. Govani decided to send all of his inventory to Amazon, becoming one of 450,000 businesses to try the service in the year ending May 31.\n Govani&#39;s problems began soon afterward. In April, Amazon emailed him to say his account was being reviewed based on four customer complaints over &#34;inauthentic&#34; products.\n &#34;In order to ensure that customers can shop with confidence on Amazon, we take &#39;inauthentic&#39; complaints seriously,&#34; the message said. &#34;The sale of counterfeit products on Amazon is strictly prohibited.&#34;\n One complainant from San Rafael, California, was unhappy with the fit of a $US125 Lucky Moto jacket and said she was &#34;wondering if this was a fake&#34;. Govani refunded her money and explained that jackets made with different materials fitted differently.\n Another shopper was upset that his Calvin Klein underpants arrived in a damaged carton. &#34;Box is pretty much broken, the item is a knock off,&#34; the shopper said in a product review. It&#39;s not clear why Amazon characterised the other two complaints - about apparel wrapped in tissue paper and shipped in envelopes - as &#34;inauthentic&#34;.\n  Govani appealed against the suspension and submitted invoices from the brands to Amazon. His invoices were more than a year old because that&#39;s when he had purchased the inventory, but Amazon wanted invoices from the previous 365 days. Govani was notified that his inventory would be destroyed if he didn&#39;t reclaim it by mid-July. Merchants must pay Amazon additional fees for inventory removal.\n Hoping to have his account reinstated and continue selling on the site, Govani put off the decision. He received a total of 11 emails from Amazon each giving him different dates at which time his inventory would be destroyed if he hadn&#39;t removed it. He sought clarity from Amazon about the conflicting dates. When he tried to submit an inventory removal order through Amazon&#39;s web portal, it wouldn&#39;t let him.\n  The spokeswoman said Amazon repeatedly asked Govani to provide evidence that the products sold were authentic but that the invoices he sent were either illegible or didn&#39;t match the records of the brand owners.\n  &#34;After being unable to resolve the matter following several appeals as part of our dispute resolution process, we informed this seller six separate times that they needed to remove their inventory from our store by specific dates or it would be destroyed,&#34; she said. &#34;The seller failed to request to remove their inventory by the dates provided.&#34;\n At the end of July, Govani sent a panicked email to chief executive officer Jeff Bezos. He exchanged emails with an Amazon representative named &#34;Brigitte M.&#34;, who promised to investigate. Brigitte M. gave her final response on August 3, reiterating that there was nothing else she could do.\n Amazon has been more aggressive in using algorithms to knock suspected counterfeits off the site, and consultants say Govani&#39;s experience is common.\n Chris McCabe, a former Amazonian who now helps merchants navigate the appeal process, says suspensions based on complaints about inauthentic products are rising and often lodged by rival merchants looking to sabotage a competitor.\n  &#34;Numerous sellers find themselves appealing [against] this endlessly only to hear that their invoices aren&#39;t acceptable or their suppliers aren&#39;t verifiable, but without any indication as to why,&#34; said McCabe, who testified before the House panel. &#34;Or they receive no reply.&#34;\n If Amazon declines to reimburse Govani for his inventory, his next step is binding arbitration, which the House panel said gives Amazon the upper hand in disputes. From 2014 to 2019, only 163 Amazon merchants initiated arbitration proceedings against the company because &#34;sellers are generally aware that the process is unfair and unlikely to result in a meaningful remedy&#34;, the report states.\n Govani&#39;s attorney Mario Simonyan, who has represented other Amazon sellers in similar disputes, suspects the company will make a lowball offer, forcing Govani to decide if he wants to pay for arbitration, which can cost tens of thousands of dollars.\n Govani said he is eager to start a new business in an entirely new field - possibly construction - even though he spent his career in retail.\n &#34;I don&#39;t want to go back to online retail even though it&#39;s the only thing I&#39;m good at,&#34; Govani said. &#34;I&#39;m so scared to sell on Amazon. This has been traumatising.&#34;\n  A concise wrap of the day on the markets, breaking business news and expert opinion delivered to your inbox each afternoon. Sign up for  the  Herald&#39;s here and   The Age&#39;s here.", "posttime": "2020-10-28 11:36:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,库存,inventory", "title": "亚马逊销毁了150万美元的卖家库存-现在无家可归", "title_en": "Amazon destroys $1.5m of sellers inventory – now homeless", "transed": 1, "url": "https://www.smh.com.au/business/companies/ruined-my-life-after-going-all-in-on-amazon-a-merchant-says-he-lost-everything-20201028-p5697l.html", "via": "", "real_tags": ["amazon", "亚马逊", "库存", "inventory"]}, {"category": "", "categoryclass": "", "imagename": "a022a87498307e340e9ad1edc2b08f6d.jpg", "infoid": 1031695, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当你运行Ubuntu安装程序时，有一个选项可以用现有的Windows安装来双引导Ubuntu。还有一个选项可以加密你的Ubuntuinstall，但前提是你必须清除所有内容并安装Ubuntu。没有自动方式将Ubuntu与加密的Windows10一起安装。虽然有很多关于双引导Ubuntu和Windows的教程，但其中很多都已经过时了--通常引用的是MBR分区表--而且几乎没有一个教程涉及加密您的Ubuntu分区。\n实际上，一旦你弄清楚了，就没那么难了。棘手的是，这在任何地方都没有很好的记录！所以我希望用这篇文章来解决这个问题。老实说，如果您对Ubuntu有足够的了解，可以在Windows上设置双引导，那么使用加密只会稍微困难一点。我在Dell Latitude E7450上准备了本教程，在我的Dell Precision 5510上测试时对其进行了微调。因此，它在大多数戴尔系统上几乎都可以正常运行，而在大多数其他类型的计算机上只需稍作修改(特别是在BIOS设置方面)即可。\n为了撰写本指南，我从几个来源收集了信息。以下是我找到的一些最有用的参考资料：\nXPS 15 9560 Dual-Boot with Encryption Notes，作者：Luispabon。我非常仔细地遵循了这些说明，但根据其他指南修改了一些分区大小和名称。\n全磁盘加密方法2019，来自Ubuntu社区维基。这是一个很好的资源，但是在不使用双引导的情况下处理加密。\n手动全系统加密，来自Ubuntu社区维基。本文篇幅较长，并且不关注双引导，但提供了有关某些事情工作方式的详细信息。\n值得注意的是，此方法不加密/引导。虽然加密/引导是有正当理由的，但是当您使用Luk进行图形安装时，图形安装程序不会对其进行加密。因此，我将遵循这一先例，并保持未加密/引导分区的简单性。因此，我在下面编写的指南是使用双引导进行Luks加密的最简单的方法。\n五六年前，在注意到我工作过的所有公司都需要加密存储后，我开始在我所有的个人电脑上使用加密存储，并有很好的效果。笔记本电脑经常丢失和被盗。它们是价值很高的物品，体积小，携带方便。当小偷拿到你的笔记本电脑时，上面有成堆的有价值的信息，他们可以使用或出售。即使您使用密码登录，如果您的磁盘未加密(例如，使用活动的U盘)，攻击者也很容易获得访问您的数据的权限。一旦他们有了这些数据，他们就可以访问在线账户、银行对账单、电子邮件和大量其他数据。对我来说，加密硬盘不再是可选的--它是一种必需品。\n那么我们要做什么呢？本教程将帮助您设置一个双引导Ubuntu20.04和Windows10的系统。(我还没有测试过，但它应该可以与大多数其他现代版本(~16.04+)的Ubuntu或Windows兼容。)。系统将使用带有UEFI的GPT硬盘(您的BIOS必须支持UEFI)。Ubuntu分区将使用Luk进行加密。1 Windows分区可以选择使用BitLocker加密。我将使Ubuntu安装尽可能接近“默认”安装--没有像单独的/home分区那样的花哨把戏，但是如果你真的想要自己添加，应该会比较容易。\n我将从一个空白硬盘开始，从头开始安装Windows10和Ubuntu。如果您已经安装了Windows并且想要保留它，您应该能够收缩您的Windows分区并加入我们的第三阶段(尽管您可能想要浏览第一阶段和第二阶段以了解我们所做的工作)。\n为了让您大致了解我们的发展方向，以下是我们要做的事情：\n当然，与任何新的操作系统安装一样，您应该在继续安装之前备份所有重要数据。下面的说明将擦除硬盘上的所有数据。操作风险自负；我不对任何损坏或数据丢失负责。\n因为我们都是从头开始安装Windows10和Ubuntu，所以每个都需要一个USB棒。如果你还没有一台运行Ubuntu或Windows的电脑，制作安装介质会有点困难--不过有一些教程可以教你，我会让你自己弄明白的。\n创建Windows Installer U盘。最简单的方法是在已经运行Windows的计算机上使用Windows10媒体创建工具。\n创建一个Ubuntu 20.04 U盘。最简单的方法是下载ISO，然后在已经运行Ubuntu的计算机上使用Startup Disk Creator。\n太棒了！我们的U盘已经准备好了！在我们开始之前还有最后一件事-我们需要确保我们的BIOS设置正确。特别是，我们需要确保我们使用UEFI来引导我们的操作系统。2个\n确保您的计算机正在运行可用的最新BIOS。这一点很重要，因为过期的BIOS可能会有错误，而这些错误有时会影响UEFI、非Windows操作系统或我们打赌的其他组件。\n编辑您的BIOS设置。以下名称可能特定于DellBIOS，但其它制造商也会有类似的设置。在“常规”和“高级启动选项”下，我禁用了传统选件ROM。两个操作系统都必须以UEFI模式安装，这一点很重要(如果您愿意，可以在安装完成时启用该模式)。\n在“安全性”下，如果您希望在Windows中轻松设置BitLocker，则必须启用“TPM安全性”。\n我禁用了安全引导。我不确定这是否是绝对必需的，如果您愿意，可以尝试将其保留或在完成后重新启用。\n既然已经为UEFI配置了BIOS，我们就可以设置硬盘了。\n大多数现代计算机都支持这一点，但如果您的计算机不支持此功能，本教程将不适用于您。您应该考虑：\n或者找到另一个教程，或者找出如何使用MBR磁盘来做到这一点。\n通过执行以下操作，完全擦除硬盘并将其设置为UEFI。3找出您的主硬盘的名称。它可能是/dev/sda或/dev/nvme0n1。重要的是，它不是/dev/sda1或/dev/nvme0n1p1-它们是磁盘的分区。确定您的名称的一种方法是运行lsblk并查看磁盘大小。在本指南的其余部分，我将引用/dev/sda。如果您的目录不是/dev/sda，请在本指南的其余部分中将/dev/sda替换为您自己的目录(可能是/dev/sdb或/dev/nvme0n1)。\n运行以下命令。这会将驱动器初始化为GPT驱动器，并创建格式化为FAT32的550M EFI系统分区。\n$sudo su#sgdisk--zap-all/dev/sda#sgdisk--new=1：0：+550M/dev/sda#sgdisk--change-name=1：efi/dev/sda#sgdisk--typecode=1：ef00/dev/sda#mkfs.fa-F 32/dev/sda1。\n好的，第一阶段完成了。我们已准备好安装介质，并且计算机的BIOS和硬盘设置正确。接下来，我们将安装Windows。\n在此阶段，我们将安装Windows。请注意，当我们这样做时，我们将留下一些未分配的空间，以便稍后安装Linux。这是一个很好的方法，因为Windows安装程序会稍微修改一下我们的分区，而且在最终完成Linux分区之前让它这样做更容易。\n创建新分区。此分区的大小应该是要用于Windows的磁盘空间量。在本例中，我使用了80G，因为我计算机上的SSD相对较小。如果不确定，可以做大约一半的硬盘。\nWindows将警告您它将创建一个额外的系统分区。这很好。4.。\n将Windows安装到您刚刚创建的分区上。不需要格式化任何分区-Windows安装程序将为您处理。\nWindows安装完成后，登录并在驱动器C：上启用BitLocker。这将自动在您的磁盘上创建另一个分区(Windows恢复分区)-这就是为什么我们在为Ubuntu分区之前这样做的原因。\n此时，您可以开始使用Windows。但我会避免做太多的设置或个性化设置，这样如果下面出了什么问题，你就不必再做了。如果您想要仔细检查分区，在安装Windows并启用BitLocker后，您将得到以下结果：\nUbuntu@ubuntu：~$sudo sgdisk--print/dev/sdadisk/dev/sda：500118192个扇区，238.5 GiBNumber开始(扇区)大小代码名称12048 1128447 550.0 MiB EF00 EFI 2 1128448 1161215 16.0 MiB 0C01 Microsoft保留...3 1161216 167825076 79.5 GiB0700基本数据分区4 167825408 168900607 525.0 MiB2700。\n这是最棘手的阶段，因为这是我们需要手动为Ubuntu设置加密磁盘的阶段。我们将使它的工作方式非常类似于Ubuntu安装程序在加密整个磁盘时的设置方式。\n在本节中，我将引用sgdisk命令。如果您对gdisk感到满意并想要一个交互界面，您可以使用它，或者如果您愿意，也可以使用GParted。Sgdisk命令在教程中更易于参考。同样，我指的是/dev/sda，但是您的名称可能类似于/dev/nvme0n1-只需继续替换您一直使用的内容即可。\n如果需要，可以在继续之前运行sudo sgdisk--print/dev/sda来检查分区表。您将看到由Windowsinstaller创建的多个分区，并且应该会看到我们将要安装Ubuntu的一些空白空间。\n为/boot创建一个分区，为我们的Linux系统&amp；data创建一个分区(使用Luk加密)。\n$sudo su#sgdisk--new=5：0：+768m/dev/sda#sgdisk--new=6：0：0/dev/sda#sgdisk--change-name=5：/boot--change-name=6：rootfs/dev/sda#sgdisk--typecode=5：8300--tyecode=6：8300/dev/sda#mkfs.ext4-L boot/dev/sda5。\n#cryptsetup luksFormat--type=luks1/dev/sda6WARNING！=这将不可撤销地覆盖/dev/sda6上的数据。真的吗？(键入大写yes)：YES输入/dev/sda6的密码：验证密码：#cryptsetup open/dev/sda6 sda6_crypt输入/dev/sda6的密码：#ls/dev/mapper/control sda6_crypt\n在我们的加密分区中设置LVM用于数据卷和交换空间。我们的交换空间在加密分区中是件好事，因为当系统挂起时，数据可能会在那里。此外，对于挂起/休眠工作，您至少应该有与内存一样多的交换空间。我的笔记本电脑有8G内存，所以我将创建8G交换空间。5个。\n#pvcreate/dev/mapper/sda6_cryptPhysical Volume&#34；/dev/mapper/sda6_crypt&#34；已成功创建。#vgcreate ubuntu-vg/dev/mapper/sda6_cryptVolume group&#34；ubuntu-vg&#34；已成功创建#lvcreate-L 8G-n swap_1 ubuntu-vg逻辑卷&#34；swap_1&#34；已创建。#lvcreate-l 100%free-n root ubuntu-vgLogical volume&#34；已创建。\n现在，我们所有的分区都准备好了。别停在这里！在不退出Ubuntu实时环境的情况下继续进入下一阶段。\n从桌面运行Ubuntu安装程序，然后选择其他选项来自己配置分区。引导加载器设备应该是/dev/sda(尽管似乎在UEFI模式下可能并未实际使用此设置)。\n安装程序完成后，单击继续测试。在我们重新开始之前，我们必须做更多的事情。\n设置etc/crypttab。这将允许您在引导时通过键入密码来解锁加密的驱动器。#mount/dev/mapper/ubuntu--vg-root/target#mount/dev/sda5/target/boot#for n in proc sys dev etc/Resolution v.conf；do mount--rbind/$n/target/$n；do#chroot/target#mount-a。\n在chroot内部(即在同一终端中)，设置/etc/crypttab。使用您喜欢的编辑器编辑该文件。我将使用vi。Sudo vi/etc/crypttab保存以下文件内容，用上面找到的实际UUID替换UUID。\n#&lt；目标名称&gt；&lt；源设备&gt；&lt；密钥文件&gt；&lt；选项&gt；#使用的选项：#luks-指定这是Luks加密设备#TRIES=0-允许重新输入密码不限次数#discard-允许SSD trim命令，警告：潜在安全风险(更多：&#34；man crypttab&#34；)#out-显示所有警告ssda6_crypt UID=abcdefgh-1234-5678-9012-abcdefghijm NONE Luks，disard\n搞定了！恭喜您，您已经使用Ubuntu20.04和Windows10创建了一个双引导系统，所有数据都已加密！现在两个安装都已完成，您可以重新启动计算机了。\n默认情况下，您的计算机将引导至GRUB，GRUB可以引导Ubuntu。尽管GRUB中列出了Windows，但在启用BitLocker的情况下从GRUB启动Windows将不起作用，因为系统的TPM将检测到启动顺序中的更改。若要避免此问题，您应该直接从计算机的BIOS启动菜单启动Windows-通常在启动时按F12键即可访问。\n作为参考，下面是我的硬盘驱动器的最终状态(在rootfs分区上有2个逻辑卷，用于/和交换)：\n$sudo sgdisk--Print/dev/sdaDisk/dev/sda：500118192个扇区，238.5 GiB编号开始(扇区)结束(扇区)大小代码名称1 2048 1128447 550.0 MiB EF00 EFI 2 1128448 1161215 16.0 MiB 0C01 Microsoft保留...3 1161216 167825076 79.5 GiB0700基本数据分区4 167825408 168900607 525.0 MiB 2700 5 168900608 170473471 768.0 MiB 8301/Boot 6 170473472 500118158 157.2 GiB8301根文件系统。\n我希望你会发现这本指南很有用，我希望Ubuntu的全磁盘加密会因此变得更受欢迎和更好的支持！\nUbuntu支持其他类型的加密。但是主文件夹加密可能会导致很多问题和不兼容。Cryptsetup手册页推荐Luks而不是dm-crypt。-↩。\n在UEFI中引导对于此过程的工作非常重要。在Ubuntu社区维基上有一个关于引导模式的深入讨论。--↩。\n根据sgdisk手册页，“如果Windows要从GPT磁盘引导，建议使用Microsoft保留类型的分区(sgdisk内部代码0x0C01)。此分区的大小应约为128 MiB。它通常紧跟在EFI系统分区之后，紧跟在视窗数据分区之前。“”↩\n在Ubuntu社区维基上有关于暂停模式的很好的讨论，强调了交换空间的必要性。(↩", "note_en": "When you run the Ubuntu installer, there’s an option to dual-boot Ubuntu with anexisting Windows installation. There’s also an option to encrypt your Ubuntuinstallation, but  only if you erase everything and install ubuntu. There’s noautomatic way to install Ubuntu alongside Windows 10 with encryption. And whilethere are plenty of tutorials for dual-booting Ubuntu and Windows, many of themare outdated – often referencing an MBR partition table – and almost none ofthem seem to address encrypting your Ubuntu partition.\n  In reality, once you figure it out, it’s not that hard. The tricky thing is thatthis isn’t well-documented  anywhere! So I’m hoping to fix that with thistutorial blog post. Honestly, if you know enough about Ubuntu to set up adual-boot with Windows, it’s only a little bit harder to do it with encryption.I prepared this tutorial on a Dell Latitude e7450, and I fine-tuned it when Itested it on my Dell Precision 5510. So it should work with almost nomodification on most Dell systems, and with only minor modifications(particularly around BIOS setup) on most other types of computers.\n  To write this guide, I compiled information from several sources. Here are someof the most useful references I found:\n XPS 15 9560 Dual-Boot with Encryption Notes,by  luispabon. I followed these notes prettyclosely, but modified some partition sizes and names based on other guides.\n    Full Disk Encryption HowTo 2019,from the Ubuntu Community Wiki. This is a great resource, but deals withencryption without dual-booting.\n  Manual Full System Encryption,from the Ubuntu Community Wiki. This is longer, and isn’t focused ondual-booting, but provides great details on the way certain things work.\n It is worth noting that this method doesn’t encrypt  /boot. While there arevalid reasons for encrypting /boot, the graphical installer does not encrypt itwhen you do a graphical install with LUKS. As such, I’m matching that precedent,and keeping the simplicity of an unencrypted /boot partition. Thus, the guideI’ve compiled below is just about the  simplest way to have a LUKS encryptionwith dual-boot.\n  I began using encrypted storage on all my personal computers 5 or 6 years agoafter noticing that all the companies I’d worked for required it, and had goodreason to. Laptops get lost and stolen all the time. They’re high-value itemsthat are small and easy to carry. And when a thief gets your laptop, there’stons of valuable information on it that they can use or sell. Even if you use apassword to log in, it’s easy for an attacker to gain access to your data ifyour disk isn’t encrypted – for example, by using a live USB stick. And oncethey have that data, they might get access to online accounts, bank statements,emails, and tons of other data. For me, an encrypted hard disk isn’t optionalanymore – its a necessity.\n  So what are we going to do? This tutorial will help you set up a system to dual-boot Ubuntu 20.04 and Windows 10. (I haven’t tested it, but it shouldwork with most other modern versions (~16.04+) of Ubuntu or Windows.) The systemwill use a GPT hard disk with UEFI (your BIOS must support UEFI). The Ubuntupartition will be encrypted with LUKS.  1 The Windows partition can optionallybe encrypted with BitLocker. I’m going to keep the Ubuntu installation as closeto a “default” installation as possible – no fancy tricks like a separate /home partition, but it should be somewhat easy to add that yourself if youreally want to.\n I’m going to start with a blank hard disk, installing both Windows 10 and Ubuntufrom scratch. If you already have Windows installed and you want to keep it, youshould be able to shrink your windows partition and join us in phase 3 (thoughyou might want to skim phases 1 and 2 to understand what we did).\n To give you a broad overview of where we’re headed, here’s what we’re going todo:\n  Of course, as with any new OS installation, you should back up any importantdata before proceeding.  The instructions below will erase all the data on yourhard disk. Proceed at your own risk; I’m not responsible for any damage ordata loss.\n  Since we’re installing both Windows 10 and Ubuntu from scratch, we’ll need a USBstick for each. If you don’t already have a computer running Ubuntu or Windows,making the installation media will be a little harder – but there are tutorialsfor that and I’ll let you figure it out on your own.\n Create a Windows Installer USB stick. The easiest way is to use the  Windows10 Media Creation Tool from acomputer that’s already running Windows.\n  Create an Ubuntu 20.04 USB stick. The easiest way is to  download theISO and use the Startup Disk Creator on acomputer that’s already running Ubuntu.\n Great! We’ve got our USB sticks ready to go! One final thing before we getstarted – we need to make sure our BIOS is set up correctly. In particular, wewant to make sure we’re using UEFI to boot our OS.  2\n  Ensure your computer is running the latest BIOS available. This is importantbecause an out-of-date BIOS can have bugs, and those bugs sometimes affectthings like UEFI, non-Windows operating systems, or other components we’ll betouching.\n  Edit your BIOS settings. The following names are probably specific to DellBIOS, but other manufacturers will have similar settings.  Under  General and  Advanced Boot Options, I disabled Legacy Option ROMs. It’s important that both OSes install in UEFI mode.(You can probably enable this when installation is complete if you care).\n  Under  Security,  TPM Security must be enabled if youwant to easily set up BitLocker in Windows.\n  I disabled  Secure Boot. I’m not sure if this is absolutely required, andyou can try leaving it on or re-enabling it when you’re done if you want.\n Now that our BIOS is configured for UEFI, we’re going to set up our hard disk.\n Most modern computers support this, but if yours doesn&#39;t this tutorial won&#39;twork for you. You should consider:\n OR Finding another tutorial or figuring out how to do this with an MBR disk.\n Completely erase your hard disk and set it up for UEFI by doing thefollowing.  3  Figure out what your primary hard disk is called. It will probably beeither  /dev/sda or  /dev/nvme0n1. Importantly, it’s  not  /dev/sda1 or /dev/nvme0n1p1 – those are partitions of the disk. One way to figure out whatyours is called is to run  lsblk and look at the disk size. Throughout the restof this guide, I’m going to refer to  /dev/sda.  If yours is not /dev/sda, replace  /dev/sda with your own (perhaps  /dev/sdb or /dev/nvme0n1) for the rest of this guide.\n  Run the following commands. This will initialize the drive as a GPT driveand create a 550M EFI system partition formatted as FAT32.\n  $ sudo su# sgdisk --zap-all /dev/sda# sgdisk --new=1:0:+550M /dev/sda# sgdisk --change-name=1:EFI /dev/sda# sgdisk --typecode=1:ef00 /dev/sda# mkfs.fat -F 32 /dev/sda1\n OK, phase 1’s complete. We have our installation media ready to go and thecomputer’s BIOS and hard drive is set up correctly. Next, we’ll install Windows.\n  In this phase, we’re going to install Windows. Note that when we do this, we’regoing to leave some unallocated space to install Linux later. This is a goodapproach because the Windows installer will mess with our partitions a littlebit, and its easier to let it do so before finalizing our Linux partitions.\n  Create a new partition. The size of this partition should be the amount ofdisk space you want to use for Windows. In this example, I did 80G since the SSDon my computer is relatively small. If unsure, do about half of your harddisk.\n  Windows will warn you that it is going to create an extra system partition.This is good.  4\n  Install Windows onto the partition you just made. There’s no need to formatany partitions – the Windows installer will take care of that for you.\n  When the Windows installation is finished, log in and enable BitLocker ondrive  C:. This will automatically create yet another partition on your disk(a Windows recovery partition) - which is why we’re doing it beforepartitioning for Ubuntu.\n At this point, you can start using Windows. But I’d avoid doing too much setupor personalization yet so you don’t have to do it again if something goes wrongbelow. If you want to double check your partitions, this is what you’ll be leftwith after installing Windows and enabling BitLocker:\n ubuntu@ubuntu:~$ sudo sgdisk --print /dev/sdaDisk /dev/sda: 500118192 sectors, 238.5 GiBNumber Start (sector) End (sector) Size Code Name 1 2048 1128447 550.0 MiB EF00 EFI 2 1128448 1161215 16.0 MiB 0C01 Microsoft reserved ... 3 1161216 167825076 79.5 GiB 0700 Basic data partition 4 167825408 168900607 525.0 MiB 2700\n  This is the trickiest phase since this is where we need to manually set up ourencrypted disks for Ubuntu. We’re going to make it work very similar to the waythe Ubuntu installer would set things up if you encrypted your whole disk.\n  Throughout this section, I’m going to be referencing  sgdisk commands. Youcould use  gdisk if you’re comfortable with it and want an interactiveinterface, or you could use GParted if you prefer.  sgdisk commands are justeasier to reference in a tutorial. And again, I’ll be referring to  /dev/sda,but there’s a chance yours could be named something like  /dev/nvme0n1 – justcontinue substituting whatever you’ve been using.\n If you want, you can run  sudo sgdisk --print /dev/sda to examine the partitiontable before moving on. You’ll see multiple partitions created by the Windowsinstaller, and should see some empty space where we’re about to install Ubuntu.\n Make a partition for  /boot and a partition for our Linux system &amp; data (tobe encrypted with LUKS).\n  $ sudo su# sgdisk --new=5:0:+768M /dev/sda# sgdisk --new=6:0:0 /dev/sda# sgdisk --change-name=5:/boot --change-name=6:rootfs /dev/sda# sgdisk --typecode=5:8300 --typecode=6:8300 /dev/sda# mkfs.ext4 -L boot /dev/sda5\n  # cryptsetup luksFormat --type=luks1 /dev/sda6WARNING!========This will overwrite data on /dev/sda6 irrevocably. Are you sure? (Type uppercase yes): YESEnter passphrase for /dev/sda6: Verify passphrase: # cryptsetup open /dev/sda6 sda6_cryptEnter passphrase for /dev/sda6: # ls /dev/mapper/control sda6_crypt\n  Setup LVM inside our encrypted partition for a data volume and swap space.It’s good that our swap space is inside the encrypted partition because of datathat could be there when the system suspends. Also, for suspend/hibernate towork, you should have at least as much swap space as memory. My laptop has 8Gmemory, so I’ll create 8G swap space.  5\n  # pvcreate /dev/mapper/sda6_cryptPhysical volume &#34;/dev/mapper/sda6_crypt&#34; successfully created.# vgcreate ubuntu-vg /dev/mapper/sda6_cryptVolume group &#34;ubuntu-vg&#34; successfully created# lvcreate -L 8G -n swap_1 ubuntu-vgLogical volume &#34;swap_1&#34; created.# lvcreate -l 100%FREE -n root ubuntu-vgLogical volume &#34;root&#34; created.\n Now, all our partitions are prepared. Don’t stop here! Continue to the nextphase without exiting the Ubuntu live environment.\n  Run the Ubuntu installer from the Desktop, and choose  Something else toconfigure partitions yourself.  The bootloader device should be  /dev/sda (though it appears that thissetting might not actually be used in UEFI mode)\n  When the installer is finished, hit  Continue Testing. We have to do acouple more things before we restart.\n  Set up  etc/crypttab. This is what will allow you to unlock your encrypteddrive by typing in your passphrase when booting.  # mount /dev/mapper/ubuntu--vg-root /target# mount /dev/sda5 /target/boot# for n in proc sys dev etc/resolv.conf; do mount --rbind /$n /target/$n; done # chroot /target # mount -a\n  Inside your chroot (that is, in the same terminal), set up  /etc/crypttab.Use your favorite editor to edit this file. I’ll use vi.  sudo vi /etc/crypttabSave the following file contents, replacing the UUID with the actual UUID youfound above.\n  # &lt;target name&gt; &lt;source device&gt; &lt;key file&gt; &lt;options&gt;# options used:# luks - specifies that this is a LUKS encrypted device# tries=0 - allows to re-enter password unlimited number of times# discard - allows SSD TRIM command, WARNING: potential security risk (more: &#34;man crypttab&#34;)# loud - display all warningssda6_crypt UUID=abcdefgh-1234-5678-9012-abcdefghijklm none luks,discard\n Done! Congratulations, you’ve created a dual-boot system with Ubuntu 20.04 andWindows 10 with all your data encrypted! Now that both installations arefinished, you can reboot your computer.\n By default, your computer will boot into grub, which can boot Ubuntu. AlthoughWindows is listed in grub, booting Windows from grub with BitLocker enabledwon’t work because the system’s TPM will detect a change in the boot sequence.To avoid this problem, you should boot Windows directly from your computer’sBIOS boot menu - usually accessible by pressing  F12 on startup.\n As a reference, here’s the final state of my hard drive (with 2 logical volumeson the rootfs partition for  / and  swap):\n $ sudo sgdisk --print /dev/sdaDisk /dev/sda: 500118192 sectors, 238.5 GiB Number Start (sector) End (sector) Size Code Name 1 2048 1128447 550.0 MiB EF00 EFI 2 1128448 1161215 16.0 MiB 0C01 Microsoft reserved ... 3 1161216 167825076 79.5 GiB 0700 Basic data partition 4 167825408 168900607 525.0 MiB 2700 5 168900608 170473471 768.0 MiB 8301 /boot 6 170473472 500118158 157.2 GiB 8301 rootfs\n I hope you found this guide useful, and I hope full-disk encryption with Ubuntubecomes more popular and better-supported as a result!\n  Ubuntu supports other types of encryption. But home folder encryption can cause lots of problems and incompatibilities. And the  cryptsetup manpages recommend LUKS over dm-crypt.  ↩\n  Booting in UEFI is important for this process to work. There’s an  in-depth discussion of boot modes on the Ubuntu community wiki.  ↩\n    According to the  sgdisk man pages, “If Windows is to boot from a GPT disk, a partition of type Microsoft Reserved (sgdisk internal code 0x0C01) is recommended. This partition should be about 128 MiB in size. It ordinarily follows the EFI System Partition and immediately precedes the Windows data partitions.”  ↩\n  There’s a good  discussion of suspend modes on the Ubuntu community wiki, highlighting the need for swap space.  ↩", "posttime": "2020-10-28 11:36:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ubuntu,windows,windows-10,加密,boot", "title": "如何使用加密双引导Ubuntu 20.04和Windows 10", "title_en": "How to Dual-Boot Ubuntu 20.04 and Windows 10 with Encryption", "transed": 1, "url": "https://www.mikekasberg.com/blog/2020/04/08/dual-boot-ubuntu-and-windows-with-encryption.html", "via": "", "real_tags": ["ubuntu", "windows", "加密", "boot"]}, {"category": "", "categoryclass": "", "imagename": "d92d20e8210c4c8f5d5d4edc2a632356.jpg", "infoid": 1031694, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像我们中的许多人一样，谢默斯·布莱克利这个周末在推特上发了一张呆在家里的自制酸面团的照片。然而，与我们许多人不同的是，布莱克利并不是新手，这也不是由日常食材组成的在线食谱。布莱克利是一位训练有素的物理学家和视频游戏制作人，被誉为发明了Xbox，他也是一位经验丰富的面包师和业余埃及学家。食谱部分来自古代象形文字，配料部分来自博物馆档案。\n布莱克利的周末酸面团是一个长达一年的激情项目的高潮，该项目生产了一条几千年没有吃过的面包。布莱克利和他的合作者从古埃及烘焙器皿中提取了4500年前的休眠酵母样本，并在他的家中厨房里将它们复活，从而真正赋予了历史生命，并将其吃掉。“这对我来说是令人难以置信的情感，”布莱克利说。“我站在埃及。”虽然这一突破是埃及人、考古学家和各地面包师庆祝的理由，但该项目实际上是由一个网络错误诞生的。\n自从小时候在史酷比上第一次看到木乃伊以来，布莱克利对埃及的一切都怀有永不满足的好奇心。自从他的父母在他十几岁的时候允许他进厨房以来，他也一直在烤面包。因此，去年4月，当一位朋友带着他声称是古埃及酵母的东西走近他时，布莱克利抓住了这个机会，在推特上发布了一张由此产生的“古代”面包的照片。网上学者草率地指责他酵母的来源有问题。\n其中一位批评者是昆士兰大学(University Of Queensland)的考古学家塞雷娜·洛夫(Serena Love)博士，他有埃及学背景。“我当时就想，‘这家伙是谁？’我没有Xbox，我可以不太关心Xbox，“洛夫博士说。她熟练地探查了他的酵母菌，问了布莱克利最终所说的“正确的问题”。另一位感兴趣的声音是爱荷华大学的生物学家理查德·鲍曼(Richard Bowman)。\n“我还没有做好我的功课，”布莱克利说。“他们不是在骗我--我是游戏业的，在这一点上我是免疫的。”他们只是在找证据。我真的很尴尬，我没有做好这件事。“。\n网上的反应实际上似乎鼓励了布莱克利。布莱克利说：“我觉得我有责任成为古埃及人的现代代表，不让人们给他们任何狗屎。”他曾希望自己的实验能反驳关于古代文化的过于普遍的假设。\n“人们认为他们是原始的，因为他们没有iPhone，”布莱克利说。“正因为如此，他们可能会变得更加老练。”他认为，对古代烘焙重现的微弱尝试也进一步诋毁了古埃及人的遗产。布莱克利说：“人们拿出一个糟糕的结果说，‘哦，看看这恶心的食物，古代世界一定很糟糕’，但任何研究过这一点的人都知道这是彻头彻尾的胡说八道。”“他们是面包师大师。”\n布莱克利没有与他的审计师争辩，而是聘请了洛夫和鲍曼来帮助他把事情做好，烘烤出一块真正的古埃及面包。布莱克利说：“我挑了两个给我的废话最多的人，我说，‘让我们做朋友吧。’”\n在一位考古学家、一位生物学家和一位敬业的、资金充足的面包师之间，这个团队奠定了他们的基础。如果洛夫博士能够获得古代烘焙陶器，鲍曼就可以提供一种安全的方法来提取古代酵母，让布莱克利复活和烘焙。布莱克利说：“这是一种奇怪的融合，拥有合适技能组合的合适人才同时出现在Twitter上。”\n洛夫博士联系了美国和欧洲的几家拥有古埃及藏品的博物馆，并要求查阅他们的档案。“我肯定收到了褒贬不一的反应，”乐福博士说。“很多人对我不屑一顾。”最后，波士顿美术馆和哈佛的皮博迪博物馆态度缓和，允许布莱克利进入他们深藏的古埃及文物宝藏。“老实说，这有点吓人，”他说。鲍曼的非侵入性提取方法类似于小型化的水力压裂，即先将一部分陶瓷注入营养浴，然后通过注射器将古老的酵母完整地拉出来。\n布莱克利将样本运到爱荷华州的鲍曼，但带了一瓶回南加州喂养和繁殖自己。有趣的是，样品只能用埃默尔面粉复活，埃默尔面粉是一种更稠密的面粉品种，可能是古王国的埃及人使用的。现代的生长介质也不断地杀死了鲍曼在爱荷华州实验室里的酵母样本，导致他们两人都得出了类似的结论：在样本被污染的极小机会中，这些微生物可能仍然有数千年的历史。\n布莱克利复活了酵母，并将其放在他传统的家庭烤箱的平底锅上烘焙，导致了一条面包在去年8月登上了头条。“我他妈的做了一吨酸面团，”布莱克利说，“但这次不一样。”古老的面包比标准的现代酸面团更甜更奶酪，面包屑光滑，更接近白面包。\n根据洛夫博士的说法，旧王国的普通食物包括啤酒、豆类和洋葱(“它们比我们的甜得多，你可以像吃苹果一样吃它们，”她说)，但没有什么比面包更普遍了。研究过象形文字的布莱克利说，古埃及人实际上有176个词来形容它。然而，如果他们热衷于烘焙，他们就不那么坚持清晰的食谱，主要依靠口头传达指令。因此，洛夫博士不得不综合古代艺术、文字和考古学的数据来破译他们的烘焙方法。\n她的工作显示，埃及人将面团放入一个加热的圆锥形粘土锅中，名为Bedja，然后将其埋在一个被炽热的余烬包围的洞中，布莱克利将这个过程作为自己的使命，将其重现到完美。“这家伙的思维速度是每小时100英里，”乐福博士说，“但他非常有条不紊。我知道这会奏效的。“。\n首先，布莱克利花了几个月的时间在他家的烤箱里烘焙古老的酸面团，用一台塔吉酒代替贝德加(Bedja)。为了忠实于酵母的祖先，他甚至在华氏94度的温度下发酵了所有的酵母。布莱克利说：“这是尼罗河周围白天的平均温度，它能做出轰轰烈烈的面包。”\n他估计，在手工建造自己的Bedja之前，他煮了大约75条面包，并在自家后院挖了一个洞，以掌握地下烘焙。布莱克利说：“如果我没有花这么多时间在这上面，它就会是一片废墟。”“我会是另一个贴着一条又烂又焦的扁平面包的人，说，‘哎呀，我猜这就是古埃及人不得不处理的事情！’”取而代之的是，布莱克利的后院面包被证明是特别的，如果不是一个小问题的话。“我吓坏了，因为我烧了车顶，”布莱克利说。“但最终，我意识到，真正让我与这些我如此尊敬的人走得这么近的是弄清楚如何像他们一样烘焙的过程，而不是最终的产品。”从古老的酵母到地下烘焙的方法，布莱克利终于做出了一种无可争议的古老的面包，具有与他的夏季酸面团一样丰富的甜味。\n目前，鲍曼继续在他的实验室对提取的样本进行排序，将古代酵母与现代污染物分开。洛夫博士计划从一系列埃及文物中收集更多样化的酵母样本。布莱克利幻想有一天可以商业化销售古埃及面包。\n一旦测序完成，研究小组已经同意以某种形式将分离的古代酵母送回埃及。“这是他们的财产，”洛夫博士说。与此同时，布莱克利正在自家后院挖更多的洞。\n你可以在Atlas Obscura社区论坛上加入关于这个和其他故事的对话。\nGasto Obscura涵盖了世界上最神奇的食物和饮料。注册我们的电子邮件，每周递送两次。", "note_en": "Like many of us, Seamus Blackley tweeted a photo of homemade sourdough while stuck at home this weekend. Unlike many of us, however, Blackley is no novice, and this was no online recipe comprised of everyday ingredients. A trained physicist and video game producer credited with inventing the Xbox, Blackley is also an experienced baker and amateur Egyptologist. The recipe came, in part, from ancient hieroglyphs, and the ingredients came, in part, from museum archives.\n Blackley’s weekend sourdough was the culmination of a year-long passion project that produced a loaf of bread not eaten for millenia. By extracting 4,500-year-old dormant yeast samples from ancient Egyptian baking vessels and reviving them in his home kitchen, Blackley and his collaborators quite literally brought history to life, and ate it. “It was unbelievably emotional for me,” says Blackley. “I stan Egypt.” While the breakthrough is cause for celebration among Egyptophiles, archaeologists, and bakers everywhere, the project was actually born of an online blunder.\n  Ever since he first saw a mummy on Scooby-Doo as a child, Blackley has harbored an insatiable curiosity for all things Egypt. And ever since his parents let him in the kitchen as a teenager, he’s been baking bread as well. So when a friend approached him last April with what he claimed was ancient Egyptian yeast, Blackley leapt at the opportunity, tweeting a photo of the resultant “ancient” loaf. Online academics summarily dragged him for the yeast’s questionable provenance.\n One of the detractors was an archaeologist with a background in Egyptology from the University of Queensland, Dr. Serena Love. “I was like, ‘Who is this guy?’ I don’t have an Xbox, I could care less about Xboxes,” says Dr. Love. She expertly probed him about the yeast, asking what Blackley ultimately called “the right questions.” Another interested voice was Richard Bowman, a biologist at the University of Iowa.\n “I hadn’t exactly done my homework,” says Blackley. “They weren’t trolling me—I’m from the games business, I’m immune to trolling at this point. They were just after the proof. I was really embarrassed I hadn’t done this right.”\n  The online reaction actually seemed to encourage Blackley. “I feel I have a responsibility of being a modern representative of ancient Egyptians and not letting people give them any shit,” says Blackley. He’d hoped his experiment would disprove all-too-common assumptions about ancient cultures.\n “People assume they were primitive because they didn’t have iPhones,” says Blackley. “They were potentially more sophisticated because of that.” He believes that feeble attempts at ancient-baking reenactments further denigrate the legacy of ancient Egyptians as well. “People come out with a bad result and say, ‘Oh, look at this disgusting food, the ancient world must have been terrible,’ but anyone who’s studied this knows that’s utter bullshit,” says Blackley. “They were master bakers.”\n Instead of arguing with his auditors, Blackley enlisted Love and Bowman to help him get it right and bake a truly ancient Egyptian loaf. “I picked the two people who gave me the most crap and I said, ‘Let’s be friends,’” says Blackley.\n Between an archaeologist, a biologist, and a dedicated, well-funded baker, the team laid their groundwork. If Dr. Love could secure access to ancient baking pottery, Bowman could provide a safe method to extract the ancient yeast for Blackley to then revive and bake. “It was one of those weird confluences where the right people with the right mix of skills showed up on Twitter at the same time,” says Blackley.\n  Dr. Love contacted several museums throughout the United States and Europe with Ancient Egypt collections and requested access to their archives. “I definitely received mixed responses,” says Dr. Love. “A lot of people ignored me.” Finally, Boston’s Museum of Fine Arts and Harvard’s Peabody Museum relented, allowing Blackley access to their deep troves of ancient Egyptian artifacts. “It was a little intimidating, to be honest,” he says. Bowman’s non-invasive extraction method resembles miniaturized fracking, wherein a portion of ceramic is injected with a nutrient bath before being pulled out through a syringe with the ancient yeast intact.\n Blackley shipped the samples to Bowman in Iowa, but took one vial home to Southern California to feed and propagate himself. Interestingly, the sample could only be revived with Emmer flour, a denser varietal of flour likely used by Egyptians of the Old Kingdom. Modern growth media consistently killed the yeast samples in Bowman’s lab in Iowa as well, leading them both to a similar conclusion: In the off-chance that the samples were contaminated, the microbes are still likely thousands of years old.\n Blackley revived the yeast and baked it on a pan in his conventional home oven, resulting in a loaf that made  headlines this past August. “I’ve made a fuck ton of sourdough,” says Blackley, “but this was different.” The ancient loaves were sweeter and chewier than the standard modern sourdough, with a smooth crumb closer to white bread.\n   According to Dr. Love, commoner foods of the Old Kingdom included beer, pulses, and onions (“they were much sweeter than ours, you could eat them like apples,” she says), but nothing was more ubiquitous than bread. Blackley, having studied hieroglyphics, says ancient Egyptians actually had 176 words for it. If they were big on baking, however, they were less insistent on clear recipes, relying mostly on oral transmission of instructions. As such, Dr. Love had to synthesize data from ancient art, writing, and archaeology to decode their baking methods.\n Her work showed that Egyptians placed their dough into a heated, conical, clay pot called a  bedja before burying it in a hole surrounded by hot embers, a process Blackley made it his mission to reenact to perfection. “The guy’s mind runs at 100 miles per hour,” says Dr. Love, “but he’s very methodical. I knew it would work.”\n First, Blackley spent months baking ancient sourdough in his home oven using a  tajine as a stand in for a bedja. Staying true to the yeast’s forebears, he even fermented all his yeast at exactly 94° F. “That’s the average daytime temperature around the Nile, and it makes bangin’ bread,” says Blackley.\n  He estimates that he cooked about 75 loaves before building his own bedja by hand and digging a hole in his backyard to master underground baking. “If I hadn’t spent so much time working on it, it would have been a wreck,” says Blackley. “I would have been another one of those people posting a shitty, burned, flat loaf saying, ‘Welp I guess this is what the ancient Egyptians had to deal with!’” Instead, Blackley’s backyard loaf proved exceptional, if not for one minor hiccup. “I was freaking out because I burned the top,” says Blackley. “But in the end, I realized the process of figuring out how to bake like them was really what got me so close to these people I respect so much, not the end product.” From the ancient yeast to the underground baking method, Blackley had at long last produced an indisputably ancient loaf with the same rich sweetness as his summer sourdough.\n For now, Bowman continues to sequence the extracted samples in his lab, separating ancient yeast from modern contaminants. Dr. Love plans on gathering a greater diversity of yeast samples from an array of Egyptian artifacts. And Blackley fantasizes about one day selling ancient Egyptian bread commercially.\n Once the sequencing is completed, the team has agreed to return the isolated ancient yeast to Egypt in one form or another. “It’s their property,” says Dr. Love. In the meantime, Blackley is digging more holes in his backyard.\n You can  join the conversation about this and other stories in the Atlas Obscura Community Forums.\n Gastro Obscura covers the world’s most wondrous food and drink.  Sign up for our email, delivered twice a week.", "posttime": "2020-10-28 11:35:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "xbox,egyptian,古代", "title": "发明Xbox的人是如何烘焙4500年前的埃及酸面团的", "title_en": "How the Man Who Invented Xbox Baked a 4,500-Year-Old Egyptian Sourdough", "transed": 1, "url": "https://www.atlasobscura.com/articles/what-bread-did-ancient-egyptians-eat", "via": "", "real_tags": ["xbox", "egyptian", "古代"]}, {"category": "", "categoryclass": "", "imagename": "a9ccdffe58c81a77cada24c843c7854a.jpg", "infoid": 1031693, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国通信监管机构英国通信办公室(Ofcom)宣布，从2021年12月开始，禁止手机运营商销售锁定的手机，以使人们更容易更换供应商。尽管BBC新闻指出，许多运营商，如O2，Sky，Three和Virgin已经将解锁手机作为标准销售，但其他运营商，如EE，沃达丰和乐购移动销售的手机需要手动解锁，才能用于其他网络。\n英国通信办公室表示，这项规定是一系列新措施的一部分，这些措施旨在使移动运营商之间的切换变得更容易。根据该公司的研究，在决定不切换的人中，超过三分之一的人表示，他们之所以望而却步，是因为他们必须先解锁手机。监管机构表示，在该国，解锁一部手机的成本约为10 GB(13美元)，这个过程往往会导致延迟或服务中断等问题。\n目前销售锁定手机的运营商表示，他们将遵守规则。沃达丰告诉BBC新闻，它“准备好在这些变化生效时实施它们”，英国电信子公司EE表示，它将“与Ofcom合作，遵守其指导方针”。\n关于手机解锁的新规定只是英国通信总局今天宣布的措施之一。将于2022年6月生效的新规定要求公司在有人签约之前提供合同主要条款的摘要，2021年12月，公司还必须在被要求时使用盲文等易于获取的格式进行沟通。Ofcom表示，它还在努力使OpenReach和Virgin Media等不同宽带网络之间的切换变得更容易。\n虽然英国监管机构正在禁止销售锁定的手机，但在美国，直接从运营商购买设备时，这种做法仍然相对普遍。然而，就像在英国一样，大多数手机都可以解锁，以便在其他网络上使用。“数字趋势”(Digital Trends)有一个指南，介绍了每个运营商的流程是如何工作的，从简单到有点费力。与此同时，在加拿大，自2017年12月以来，手机不得不解锁销售。", "note_en": "The UK’s communications regulator Ofcom is banning phone carriers from selling locked handsets starting in December 2021 to make it easier for people to switch providers, the  watchdog has announced. Although   BBC News notes that many carriers like O2, Sky, Three, and Virgin already sell unlocked handsets as standard, others like EE, Vodafone, and Tesco Mobile sell phones that need to be manually unlocked before they can be used with other networks.\n Ofcom says the rule is part of a new set of measures designed to make it simpler to switch between cell carriers. According to its research, over a third of people who decided against switching said they were put off by having to unlock their phone first. Unlocking a phone costs around £10 ($13) in the country, the regulator says, and the process can often cause problems like delays or loss of service.\n  Carriers who currently sell locked handsets have said they’ll follow the rules. Vodafone told  BBC News that it is “ready to implement these changes when they come into force,” and BT subsidiary EE said that it will “work with Ofcom to comply with its guidelines.”\n The new rules about phone unlocking are just one of the measures  Ofcom is announcing today. New rules going into effect in June 2022 require companies to provide a summary of the main terms of a contract before someone signs up, and in December 2021, companies will also have to communicate in accessible formats like Braille when asked. Ofcom says it is also working to make it easier to switch between different broadband networks like Openreach and Virgin Media.\n While the UK’s regulator is banning the sale of locked handsets, the practice is still relatively common in the US when buying devices directly from carriers. However, as in the UK, it’s possible to unlock most phones to use them on other networks.   Digital Trends has a guide on how the process works for each carrier, which ranges from simple to a little laborious. Meanwhile in Canada, cellphones have had to be sold unlocked  since December 2017.", "posttime": "2020-10-28 11:35:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,销售,ban", "title": "英国将从2021年12月起禁止销售运营商锁定手机", "title_en": "UK to ban sale of carrier-locked phones from December 2021", "transed": 1, "url": "https://www.theverge.com/2020/10/27/21535957/uk-ofcom-locked-carrier-phone-ban-ee-vodafone-tesco-mobile", "via": "", "real_tags": ["手机", "销售", "ban"]}, {"category": "", "categoryclass": "", "imagename": "6c2ad4dcd0c6110a9cf23368ab275986.jpg", "infoid": 1031692, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "多年来，有很多谣言和流传的笑话说，XDA将(或许应该)制造一部手机。我们在LineageOS(以及之前的CyangenMod)等替代平台上的历史意味着，XDA在帮助开发智能手机上可用的主要平台的可行替代方案方面一直走在前列。\n今天，我们非常兴奋地宣布，我们终于做到了--我们制造了一部手机。今年早些时候，我们与F(X)tec合作，讨论如何将替代平台带给更广泛的受众。F(X)tec Pro1-X做到了这一点：它是世界上第一款开箱即用的运行LineageOS的手机，你也可以获得运行Ubuntu Touch操作系统的版本。\nCyangenMod-LineageOS的精神始祖-始于XDA社区，从那时起，我们一直在帮助维护、开发和扩展LineageOS支持的设备。可以肯定地说，LineageOS和XDA的历史是密不可分的，我们很高兴能推出第一款开箱即用的运行LineageOS的手机。\n我们创建Pro1-X的主要原因是为我们的用户提供选择。推出的每一款手机要么运行Android，要么运行iOS，即使是最好的Android手机也需要Root才能真正定制体验。\n现在，不仅仅有两种选择：Pro1-X不仅运行LineageOS；还有运行Ubuntu Touch OS和Android的变种，我们正在积极探索其他平台。\n您可能对Pro1-X很熟悉；我们以去年推出的流行的F(X)tec Pro1为例，做了一些关键的调整。RAM和存储空间都增加了-分别从6 GB和128 GB增加到8 GB和256 GB-Pro1-X采用了这种新的探索蓝色，看起来非常棒！\n除此之外，Pro1的许多规格都保持不变。有一个66键全QWERTY键盘，可以从显示屏下方滑出，高通骁龙835处理器，双SIM支持，指纹扫描仪，专用相机按钮，USB-C和HDMI输出，等等。还有一个800万像素的前置摄像头，一个1200万像素的主摄像头和一个500万像素的副摄像头。\n多年来，我们一直开玩笑说，我们计划制造一款手机。那么我们最终为什么要这么做呢？特别是今年，隐私变得比以往任何时候都重要，LineageOS以让你超越传统Android智能手机的控制而闻名。特别值得一提的是，LineageOS16中的Privacy Guard被LineageOS17中AOSP的权限中心所取代，它只允许您共享您想要共享的数据，而不能共享您不想共享的数据。\n我们还看到，在过去的几年里，LineageOS和其他平台在我们社区的受欢迎程度不断提高，人们对这些替代的Android发行版也越来越感兴趣。\n除了LineageOS，还有一大群Ubuntu用户一直梦想拥有一部运行Ubuntu Touch的智能手机，而Pro1-X是第一款运行Ubuntu Touch的高通智能手机。不仅如此，我们还设法让HDMI输出功能正常工作，这样你就可以插入HDMI数据线并将其连接到大屏幕上，然后将显示器用作触控板。\n制造一部智能手机并不便宜，即使我们在对现有设备进行一些关键升级时也是如此。也就是说，我们已经设法降低了成本，并且对XDA社区有一个特别的价格。\nPro1-X的完整零售价为899美元。但对于XDA社区来说，639美元的价格是有限的，这是29%的折扣！如果你够快的话，我们还有599美元的早起前优惠，可以节省33%！要了解更多详情，请访问Indiegogo众筹页面。您只能使用此页面上的链接访问XDA特价！\n我们非常高兴终于发布了XDA手机，我们也很自豪能帮助LineageOS和Ubuntu Touch OS更上一层楼。有一点需要注意的是，一旦Indiegogo活动结束，我们将不会提供Pro1-X出售，所以如果你不支持它，它将无法在之后购买！", "note_en": "There have been many rumors and running jokes over the years that XDA would, and probably should, make a phone. Our history with alternative platforms such as  LineageOS (and CyanogenMod that came before it) has meant that XDA has been at the forefront of helping develop viable alternatives to the primary platforms available on smartphones.\n Today, we’re super excited to announce that we’ve finally done it – we’ve made a phone. Earlier this year, we partnered with F(x)tec to discuss how we can bring an alternative platform to a wider audience. The F(x)tec Pro1-X does just this: it’s the world’s first phone to run LineageOS out of the box, and you can also get a version running Ubuntu Touch OS.\n    CyanogenMod – the spiritual ancestor to LineageOS – began in the XDA community, and since then, we’ve helped to maintain, develop, and expand the devices that LineageOS supports. It’s safe to say that the  history of LineageOS and XDA are inexorably linked and we’re excited to launch the first phone running LineageOS out of the box.\n The main reason we created the Pro1-X was to offer our users a choice. Every phone launched either runs Android or iOS, and even the  best Android phones require  rooting to be able to truly customize the experience.\n Now, there’s more than just two options: the Pro1-X doesn’t only run LineageOS; there are also variants available running Ubuntu Touch OS and Android, and we’re actively exploring other platforms.\n   The Pro1-X might look familiar to you; we took the popular  F(x)tec Pro1 that was launched last year and made a few key tweaks. The RAM and storage have both been increased – from 6GB and 128GB to 8GB and 256GB respectively – and the Pro1-X comes in this new Discovery Blue color that looks fantastic!\n Beyond that, many of the Pro1 specs have remained the same. There’s a 66-key full QWERTY keyboard that slides out from beneath the display, a Qualcomm  Snapdragon 835 processor, Dual SIM support, a fingerprint scanner, a dedicated camera button, USB-C, and HDMI out, and far more. There’s also an 8MP front camera, a 12MP primary camera, and a 5MP secondary camera.\n   For years, we’ve teased that we’re planning to create a phone. So why did we finally do it? This year especially, privacy has become more important than ever before, and LineageOS is known for letting you go beyond the controls you’d find on a traditional Android smartphone. In particular, the Privacy Guard – in LineageOS 16, which was replaced by AOSP’s Permissions Hub in LineageOS 17 – allows you to only share the data you want to share, and not share the data you don’t want to share.\n We’ve also seen that the popularity of LineageOS and other platforms across our community has grown over the past few years and there’s more interest in these alternative Android distributions.\n Beyond just LineageOS, there’s a large community of Ubuntu users who’ve always dreamed of having a smartphone running Ubuntu Touch, and the Pro1-X is the first Qualcomm-powered smartphone to run Ubuntu Touch. Not only that, we’ve also managed to get the HDMI-out feature working, so you can plug an HDMI cable in and connect it to a big screen, and use the display as a trackpad.\n   Building a smartphone isn’t cheap, even when we’re adapting an existing device with some key upgrades. That said, we’ve managed to keep our costs down and there’s a special price for the XDA community.\n The full retail price of the Pro1-X is $899. But for the XDA community, there are a limited number of devices available at $639, which is 29% off! If you’re fast enough, we also have a pre-early bird offer for $599, which is a saving of 33%!! To find out more details, head over to our  Indiegogo crowdfunding page. You can only access the special XDA price using the link on this page!\n We’re super excited to finally launch the XDA phone, and we’re proud to be helping elevate LineageOS and Ubuntu Touch OS to the next level. One thing to note is that we won’t be offering the Pro1-X for sale once the Indiegogo campaign ends, so if you don’t back it, it won’t be available to buy afterwards!", "posttime": "2020-10-28 11:30:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "手机,xda,pro1", "title": "XDA制造了一部手机", "title_en": "XDA Made a Phone", "transed": 1, "url": "https://www.xda-developers.com/pro1-x", "via": "", "real_tags": ["手机", "xda", "pro1"]}]