[{"category": "", "categoryclass": "", "imagename": "5f9465234a34f9050626720149bfbb85.jpg", "infoid": 1066738, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果你自20世纪90年代以来已经看过电视，那么SItcom主题歌曲我会在那里因为你可能已经陷入了一角或另一个点。\n UC Davis的新研究表明，这些经验不仅仅是一个滋扰 - 他们在帮助记忆形式方面发挥着重要作用，而不仅仅是歌曲，而且也像与朋友一起出去玩的相关生活事件 - 或者看着别人和朋友一起闲逛在90年代电视节目，朋友们。\n “科学家们在一段时间内知道音乐唤起了自传记忆，而那些是人们珍惜的音乐的情绪经历，”佩特拉纳塔，UC戴维斯的心理学教授和一个新的研究。\n  “迄今尚未理解的是那些回忆中的第一名以及它们如何变得如此耐用，这样就可以听到一点点歌曲可以引发生动的记忆，”Janata说。\n 本文，“音乐的自发心理重播改善了偶然相关的事件知识的记忆，”在实验心理学杂志上在线公布。\n 作者说，这项新的研究能够初步一瞥这些机制，有点令人惊讶，有点令人惊讶，有点令人惊讶，有点令人惊讶地发现，这位作者认为，这歌曲陷入了脑袋中，这令人困住的歌曲有助于加强回忆的过程首先形成的回忆。\n 因此，这是第一个将两个最常见的现象与音乐 - 耳朵（在您的脑袋中粘在一起）和音乐记忆中的两个研究。 \n为他们的最新学习，研究人员在三个实验中的每一个，三个不同的日子中的每一个不同的一天中的25到31个不同的人工作，间隔几周。\n 主题首先听取陌生的音乐，然后，一周后，再次听音乐，这次同样不熟悉的电影剪辑配对。在一个实例中，没有音乐就播放了电影。\n  随后，研究科目，所有UC戴维斯本科生和研究生都要求记住每个电影都可以随着音乐播放的各电影的细节。他们也被嗡嗡作响了他们对相关曲调的回忆，以及他们经历了每种曲面的频率。他们都没有正式的音乐训练。\n   结果：在一个人的头脑中越多，曲调的记忆越准确，批判性地，越来越多地，这些细节越详细地阅读了曲调的电影的特定部分。\n 当他们看到这部电影时只有一周，当他们被要求记住电影的许多细节时，他们在听电影原声带上，反复经历从原声带作为耳朵的效果导致近 - 核实电影细节的保留。\n 事实上，这些人的记忆和他们第一次看到电影一样好。此外，大多数科目能够在发生耳朵发生时报告它们通常正在做的事情，并且他们都没有提到这些时代的相关电影。\n “我们的论文表明，即使您在脑海中播放那首歌并没有明确地拉动记忆的细节，那么仍然可以帮助巩固这些记忆，”Janata说。 \n“我们通常将耳朵视为随机滋扰，但我们的结果表明，耳虫是一种自然发生的内存过程，有助于保护最近的长期记忆经验，”库布特说。  作者表示，他们希望正在进行的研究最终可能导致非药物的发展，基于音乐的干预措施，帮助患有痴呆和其他神经系统疾病的人们更好地记住活动，人民和日常任务。 ", "note_en": "If you have watched TV since the 1990s, the sitcom theme song  I’ll Be There for You has likely been stuck in your head at one point or another.\n New research from UC Davis suggests these experiences are more than a passing nuisance—they play an important role in helping memories form, not only for the song, but also related life events like hanging out with friends—or watching other people hang with their friends on the ’90s television show,  Friends.\n “Scientists have known for some time that music evokes autobiographical memories, and that those are among the emotional experiences with music that people cherish most,” said Petr Janata, UC Davis professor of psychology and co-author on a new study.\n  “What hasn’t been understood to date is how those memories form in the first place and how they become so durable, such that just hearing a bit of a song can trigger vivid remembering,” said Janata.\n The paper, “Spontaneous Mental Replay of Music Improves Memory for Incidentally Associated Event Knowledge,” was published online in the   Journal of Experimental Psychology.\n This new research offers an initial glimpse into these mechanisms and, somewhat surprisingly, finds that the songs that get stuck in your head help that process of strengthening memories as they first form, the authors said.\n Thus, this is the first research to link two of the most common phenomena people experience with music—earworms (having a song stuck in your head) and music-evoked remembering.\n For their latest study, the researchers worked with 25 to 31 different people in each of three experiments, over three different days, spaced weeks apart.\n Subjects first listened to unfamiliar music, and then, a week later, listened to the music again, this time paired with likewise unfamiliar movie clips. In one instance, movies were played without music.\n  The research subjects, all UC Davis undergraduate and graduate students, were subsequently asked to remember as many details as they could from each movie as the music played. They were also quizzed about their recollection of the associated tunes and how often they experienced each of the tunes as an earworm. None of them had formal music training.\n   The results: the more often a tune played in a person’s head, the more accurate the memory for the tune became and, critically, the more details the person remembered from the specific section of the movie with which the tune was paired.\n With only one week between when they saw the movie, and when they were asked to remember as many details from the movie as they could while listening to the movie soundtrack, the effect of repeatedly experiencing a tune from the soundtrack as an earworm resulted in near-perfect retention of the movie details.\n These people’s memories, in fact, were as good as when they had first seen the movie. Additionally, most subjects were able to report what they were typically doing when their earworms occurred, and none of them mentioned the associated movies coming to mind at those times.\n “Our paper shows that even if you are playing that song in your mind and not pulling up details of memories explicitly, that is still going to help solidify those memories,” Janata said.\n “We typically think of earworms as random nuisance beyond our control, but our results show that earworms are a naturally occurring memory process that helps preserve recent experiences in long-term memory,” Kubit said.\n   The authors said they hope the research, which is ongoing, could eventually lead to the development of nonpharmaceutical, music-based interventions to help people suffering from dementia and other neurological disorders to better remember events, people and daily tasks.", "posttime": "2021-06-19 02:42:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "帮助,stuck,记忆", "title": "那首歌卡在你的脑海里正在帮助大脑与长期记忆 ", "title_en": "That Song Stuck in Your Head Is Helping the Brain with Long-Term Memory", "transed": 1, "url": "https://www.goodnewsnetwork.org/that-song-is-stuck-in-your-head-but-its-helping-you-to-remember/", "via": "", "real_tags": ["帮助", "stuck", "记忆"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066737, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "1989-12-31T20：00：27-05：00 https://images.c-span.org/files/4fe/19891231200933001_hd.jpg rutgers大学英语教授威廉·莱兹讨论了他的T书双语：使用语言来欺骗你。对美国英语的独特分析，双语例子是“人类动力学”代替“体育”，“人行道缺陷”而不是“坑洼”。双语是有意识地用于操纵的。 Lutz指出，他的使命不是根除双语，而是消除从最危险的重要问题的话语中的话语。他指出，政府中最普遍的双重言论，紧随其后的广告行业。 Rutgers大学英语教授William Lutz讨论了他的T书双语：使用语言来欺骗你。对美国英语的独特分析，...阅读更多\n 报告视频发行房屋当前讲话者的房屋代表。托马斯Foley反映在回顾期间的面试中1968年的事件......\n 前教育秘书Bennett描述了他认为是所有儿童应该被教导的美德......\n 品牌先生谈到了他的书，鲁莽十年：美国在1890年代，由圣马丁的新闻发布。他…\n Michael Elliott谈到了他最近的书，昨天前一天：重新考虑美国的过去，重新发现...... ", "note_en": "1989-12-31T20:00:27-05:00 https://images.c-span.org/Files/4fe/19891231200933001_hd.jpg William Lutz, professor of English at Rutgers University, discussed his t book  Double-Speak: The Use of Language to Deceive You. A unique analysis of American English, examples of double-speak are “human kinetics” in place of “physical education,” and “pavement deficiencies” instead of “potholes.” Double-speak is consciously used to manipulate. Lutz points out that his mission is not to eradicate double-speak, but to eliminate double-speak from the discourse of important issues where it is most dangerous. He states that double-speak is most prevalent in government, followed closely by the advertising industry. William Lutz, professor of English at  Rutgers University, discussed his t book  Double-Speak: The Use of Language to Deceive You. A unique analysis of American English, examples of…  read more\n Report Video Issue      Current Speaker of the House Rep. Thomas Foley reflected on the events of 1968 in an interview during a retrospective…\n Former Education Secretary Bennett described what he believes are the virtues that all children should be taught, such…\n Mr. Brands talked about his book,  The Reckless Decade: America in the 1890s, published by St. Martin’s Press . He…\n Michael Elliott talked about his recent book,  The Day Before Yesterday: Reconsidering America’s Past, Rediscovering the…", "posttime": "2021-06-19 02:42:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rutgers,double,双语", "title": "Porf。 威廉卢茨（Rutgers University）关于他的书双语（1989） ", "title_en": "Porf. William Lutz (Rutgers University) about his book Double-Speak (1989)", "transed": 1, "url": "https://www.c-span.org/video/?10449-1/doublespeak", "via": "", "real_tags": ["rutgers", "double", "双语"]}, {"category": "", "categoryclass": "", "imagename": "14861cb279ba92381545c00c007ffb4a.png", "infoid": 1066736, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "是的，我将在即将到来的帖子中详细介绍所有列出的命令。因此，如果您正在寻求提高您的Linux技能，您将热爱此更新的指南。\n 无论您是Linux还是经验丰富的用户的初学者，都有一个常见的命令列表，手手近在咫尺是有用的。\n 以下文章讨论了Linux命令，无疑可以帮助您了解如何将Linux从头开始作为新手。\n 在本教程中，您将找到常用的Linux命令以及具有语法和示例的可下载备用表。\n    您可以通过单击下面的下载Linux Cheat表按钮，以PDF格式保存Linux命令列表并打印出来。\n                                                                                列出在指定位置[/文件夹/位置]中以指定字符[a]开头的名称：\n                                                                                                                                                   给所有者的读取，写和执行权限，以及r EAD和r EATH和DEATER的权限： \n该过程可以用FG或BG的背景中的前景恢复。  Linux命令行简化并加快了任务的执行。 一些基本命令可能需要一些时间来记住，但有很多练习，任何事情都是可能的。 ", "note_en": "Yes, I’ll cover all the listed command in detail in upcoming post. So if you’re looking to improve your Linux skills , you’ll love this updated guide.\n No matter whether you are beginner to Linux or an experienced user, having a list of common commands close at hand is helpful.\n The following article discusses Linux commands that will undoubtedly help you learn how to use Linux from scratch as a newbie.\n In this tutorial, you will find commonly used Linux commands as well as a downloadable cheat sheet with syntax and examples.\n    You can save the list of  Linux commands in PDF format and print it out by clicking the Download Linux Cheat Sheet button below.\n                                                                                List names that  begin with a specified character   [a] in a specified location   [/folder/location] by using the   find command:\n                                                                                                                                                   Give  read, write, and execute permission to owner, and r ead and execute permission to group and others:\n                                      The process can be  resumed in the  foreground with   fg or in the  background with   bg.\n                    The Linux command line simplifies and speeds up the execution of tasks. Some of the basic commands might take some time to remember, but with lots of practice, anything is possible.", "posttime": "2021-06-19 02:41:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "linux,命令,commands", "title": "Linux命令作弊表2021 ", "title_en": "Linux Commands Cheat Sheet 2021", "transed": 1, "url": "https://linuxguidehq.com/linux-commands-cheat-sheet/", "via": "", "real_tags": ["linux", "命令", "commands"]}, {"category": "", "categoryclass": "", "imagename": "c8c1c6f82cde0bdb1a1f8d2cec3286b8.jpg", "infoid": 1066735, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的研究发现，使用简单的决策策略与简单的决策策略一起使用他们的胆量策略的经理可能会产生同样的良好，但更快，决定是那些使用数据达到结果的决策。该报告，由学术学院（原迦斯），国王＆＃39; S商业学院和马耳他大学，发现，依赖决策可能是适得其反的，因为这降低了决策速度没有确保更准确的准确性。\n  该研究基于122广告，数字，出版的信息，发现使用数据以在高不确定性下通知决策通常不是最佳的。这可以解释为什么12个不同的出版商最初拒绝发布的机会＆＃34;哈利波特和哲学家＆＃39; stone＆＃39; - 因为它没有数据通知其潜力。\n  最近的一项调查显示，92％的财富1000家公司正在报告增加对数据倡议的投资，尽管似乎这可能并不总是必要的。\n  作者询问他们如何对其最近的创新项目做出决定，包括他们使用数据，本能和其他简单启发式的程度（心理策略）。这些调查结果概述了这些决策方法的：\n  被问及经理他们是否认为他们使他们达成了这一决定的速度。结果表明，管理人员与数据一样依赖于数据，使用＆＃39; Tallying＆＃39;超过任何其他公制。\n  奥格兹A. Acar博士博士营销商业学校和该报告的共同作者营销：＆＃34;该研究表明，数据驱动的决策不是所有情况下的灵丹妙药，可能不会导致面对不确定性时的准确性提高。\n  ＆＃34;在极端的不确定性下，经理，特别是那些拥有更多经验的经理，应该相信推动他们的专业知识和本能。随着领导者的态度而言，由于领导者可以比分析工具更有效，这在极端不确定性的情况下，可以充当障碍而不是成功的司机。＆＃34; \n＆＃34;选择替代新产品开发项目：启发式的作用＆＃34; 发表于心理学和营销。 更多信息：Douglas C. West等人，选择替代新产品开发项目：启发式，心理学＆amp的作用; 营销（2020年）。 DOI：10.1002 / 3月21397 ", "note_en": "Managers who use their gut instinct together with simple decision-making strategies may make equally good, but faster, decisions as those who use data to reach an outcome, a new study has found.    The report, co-authored by academics at the Business School (formerly Cass), King&#39;s Business School, and the University of Malta, finds that the reliance on   in decision-making might be counterproductive as this reduces decision-making speed without ensuring more accuracy.\n  The research, based on information from 122 advertising, digital, publishing, and  , finds that using data to inform decision making under high uncertainty is often not optimal. This may explain why 12 different publishers initially rejected the opportunity to publish &#34;Harry Potter and the Philosopher&#39;s Stone&#39; – because it had no data to inform its potential.\n  A  recent survey revealed that 92 percent of Fortune 1000 companies were reporting increased investment in data initiatives, although it appears this may not always be necessary.\n  The authors asked   how they made decisions on their most recent innovation project, including the extent to which they used data, instinct, and other simple heuristics (mental strategies). The findings outlined that among those decision-making methods were:\n  Managers were asked whether they think they made the   and how fast they were in reaching that decision. Results showed that managers relied on their own   as much as data, using &#39;tallying&#39; more than any other metric.\n  Dr. Oguz A. Acar, Reader in Marketing at the Business School and co-author of the report, said: &#34;This research shows that data-driven decision-making is not the panacea in all situations and may not result in increased accuracy when facing uncertainty.\n  &#34;Under extreme uncertainty, managers, particularly those with more experience, should trust the expertise and instincts that have propelled them to such a position. The nous developed over years as a leader can be a more effective than an analytical tool which, in situations of extreme uncertainty, could act as a hindrance rather than a driver of success.&#34;\n  &#34;Choosing among alternative new product development projects: The role of heuristics&#34; is published in  Psychology and Marketing.        More information:\t\t\t\t\t\t\t\t\t\t\t\tDouglas C. West et al, Choosing among alternative new product development projects: The role of heuristics,  Psychology &amp; Marketing (2020).  DOI: 10.1002/mar.21397", "posttime": "2021-06-19 02:41:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据,result", "title": "与你的肠道一起可以导致更好的决策而不是使用数据方法 ", "title_en": "Going with your gut can result in better decision-making than using data methods", "transed": 1, "url": "https://medicalxpress.com/news/2021-06-gut-result-decision-making-methods.html", "via": "", "real_tags": ["数据", "result"]}, {"category": "", "categoryclass": "", "imagename": "74c5c115a1ae393bef2a02bb93828aec.jpg", "infoid": 1066734, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "已经透露了其原始编程的基础数据，其中大部分是由去年1月收购图书馆的支持。\n Roku原装于5月20日推出，阵容最初为Quibi，Jeffrey Katzenberg的移动服务制作了大约30个节目。从6月3日开始，更多的Roku活动帐户流式传输了一个Roku原始的Quibi帐户的数量，这些帐户在启动的整个运行过程中流出了Quibi节目。\n 4月20日推出的融资17.5亿美元，Quibi未能获得其订阅移动服务的牵引，秋季关闭。 Roku已经与Quibi讨论了关于潜在分布的讨论，因为公司看到其移动的焦点群集，部分原因是冠状病毒大流行。\n  以克文哈特，安娜·肯德里克，詹妮弗·洛佩兹和其他恒星进行了展示，以缩短的耻辱形式得到了Quibi的名字，这对于“快速叮咬”是短暂的。那些七到10分钟的运行时间碰巧与Roku的广告休息一致。\n 该公司未提供特定的数字来查看原件，但表示在可用性的前两周内观看的记录数。流入的三个用户中的三个用户超过了一个Roku原始系列，用户平均流出了九个剧集。 Roku频道到达7000万人的家庭。 Roku有大约5400万活跃的账户。\n Roku以前尚未为其对编程投资提供估算，但熟悉该公司财务人员的内部人士表示，它正在接近10亿美元的内容支出。该图涵盖了图书馆采集和原件。计划不要呼吁戏剧性的速度达到Netflix的财务承诺水平，但即使在更适度的水平上，Roku就会超越其体重。 Roku最近订购了凯文哈特的动作喜剧系列Die Hart的第二季。\n 除Quibi外，该公司还有最近几个月收购了这座老房屋的改进品牌，并设定了与萨班电影的Pay-1 Windows交易。它在2017年推出的Roku频道上维护了一个40,000多个点播电影和电视标题的图书馆。它还具有近200个现场线性通道。 Roku频道上的大多数编程都是免费的，并且平台也使观众能够注册高级服务。 \n该公司表示，在Roku频道内，十大最多观看的节目是所有Roku原装在5月20日 -  6月20日跨度。  在侧边栏活动期间，侧栏举办的侧栏举行的侧栏节日，观看洞察洞中的观点和首席执行官Anthony Wood在Tribeca X.的内容融合融合技术融合了技术，广告和娱乐。  “我们始终相信Roku原件将在Roku频道上以免费的，广告支持的娱乐提供异常。” Roku VP编程Rob Holmes在新闻稿中表示。 “前两周已经超越了我们的期望，有数百万人媒体媒体原创，并提供了Roku频道飞轮的进一步示范，具有巨大的内容，驾驶记录参与，这对寻求达到媒体观众的广告商的呼吸录取。” ", "note_en": "has revealed viewership data for its original programming, much of which was powered by the acquisition of  ’s library last January.\n Roku Originals launched on May 20, with a lineup of about 30 shows initially made for Quibi, Jeffrey Katzenberg’s mobile   service. From launch through June 3, more Roku active accounts streamed a Roku Original than the number of Quibi accounts that streamed Quibi shows during the start-up’s entire run.\n Launched in April 2020 with $1.75 billion in financing, Quibi failed to gain traction with its subscription mobile service, shuttering by the fall. Roku had already been in discussions with Quibi about potential distribution, as the company saw its mobile-only focus floundering, in part due to the coronavirus pandemic.\n  Shows featuring Kevin Hart, Anna Kendrick, Jennifer Lopez and other stars were made in a shortened episodic format befitting Quibi’s name, which is short for “quick bites.” Those seven-to-10-minute running times happen to line up well with Roku’s ad breaks.\n The company did not offer a specific number for the viewing of originals, but said a record number of accounts watched during the first two weeks of availability. More than one in three users of The   streamed a Roku Originals series, with users streaming over nine episodes on average. The Roku Channel reaches households with 70 million people. Roku has about 54 million active accounts.\n Roku has not previously offered an estimate for its investment in programming, but insiders familiar with the company’s finances say it is approaching $1 billion in spending on content. That figure covers both library acquisitions and originals. Plans don’t call for a dramatic ramp-up to Netflix levels of financial commitment but even at a more modest level Roku is punching well above its weight. Roku recently ordered a second season of Kevin Hart’s action comedy series  Die Hart.\n In addition to Quibi, the company has also in recent months acquired the This Old House home improvement brand and set a pay-1 windows deal with Saban Films. It maintains a library of 40,000-plus on-demand film and TV titles on the Roku Channel, which launched in 2017. It also features nearly 200 live linear channels. Most of the programming on the Roku Channel is free and ad-supported, but the platform also enables viewers to sign up for premium services.\n  Within the Roku Channel, the top 10 most watched programs were all Roku Originals in the May 20-June 3 span, the company said.\n The viewing insights come as founder and CEO Anthony Wood appears today at the Tribeca Festival during a sidebar event called Tribeca X. The in-person event blends tech, advertising and entertainment.\n “We always believed Roku Originals would perform exceptionally well as free, ad-supported entertainment on The Roku Channel.” Roku VP of programming Rob Holmes said in a press release. “The first two weeks have surpassed our expectations, with millions of people streaming Roku Originals, and provided a further demonstration of The Roku Channel flywheel, with great content driving record engagement that’s appealing to advertisers seeking to reach the streaming audience.”", "posttime": "2021-06-19 00:51:52", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "quibi,roku", "title": "Roku从5月20日到6月3日开始，更多的Roku观众将从Quibi用户流式传播了一个Roku原始的，Quibi用户在近九个月的寿命期间显示了Quibi ", "title_en": "Roku says from May 20 to June 3, more Roku viewers streamed a Roku Original than Quibi users who streamed Quibi shows during the nine months of Quibi's lifetime", "transed": 1, "url": "https://deadline.com/2021/06/roku-originals-quibi-streaming-one-billion-1234777771/", "via": "", "real_tags": ["quibi", "roku"]}]