[{"category": "", "categoryclass": "", "imagename": "d9de707ed54029f426a7be5134c94c90.jpeg", "infoid": 1014729, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "路透日内瓦8月23日电-世界卫生组织(WHO)一名官员周二将新冠肺炎大流行描述为“一波大浪潮”，并警告不要在北半球夏季自满，因为这种感染并不像流感那样有随季节变化的趋势.。\n世卫组织官员一直在极力避免将像香港那样的新冠肺炎病例的卷土重来描述为“浪潮”，因为这表明病毒的行为方式超出了人类的控制，而事实上，协同行动可以减缓它的传播。\n玛格丽特·哈里斯在日内瓦的一次虚拟简报会上重申了这一信息。“我们正处在第一波浪潮中。这将是一个大浪。它会有一些起伏。最好的办法就是把它压平，然后把它变成只是搭在你脚下的东西，“她说。\n她指出，在美国盛夏，病例数量很高，她敦促在实施措施时保持警惕，并警告不要举行大规模集会。\n然而，她对南半球冬季与正常季节性流感病例重合的新冠肺炎病例表示担忧，并表示总部设在日内瓦的机构正在密切监测这一情况。\n她说，到目前为止，实验室样本没有显示大量流感病例，这表明这个季节的开始比正常情况下要晚。\n她说：“如果在你已经有很高的呼吸道疾病负担的情况下，你的呼吸系统疾病却增加了，那就会给卫生系统带来更大的压力。”她敦促人们接种流感疫苗。", "note_en": "GENEVA (Reuters) - A World Health Organization official on Tuesday described the COVID-19 pandemic as “one big wave” and warned against complacency in the northern hemisphere summer since the infection does not share influenza’s tendency to follow seasons.\n WHO officials have been at pains to avoid describing a resurgence of COVID-19 cases like those in Hong Kong as “waves” as this suggests the virus is behaving in ways beyond human control, when in fact concerted action can slow its spread.\n Margaret Harris repeated that message in a virtual briefing in Geneva. “We are in the first wave. It’s going to be one big wave. It’s going to go up and down a bit. The best thing is to flatten it and turn it into just something lapping at your feet,” she said.\n Pointing to high case numbers at the height of the U.S. summer, she urged vigilance in applying measures and warned against mass gatherings.\n      However, she expressed concern about COVID-19 cases coinciding with normal seasonal influenza cases during the southern hemisphere’s winter, and said the Geneva-based body was monitoring this closely.\n So far, she said, laboratory samples are not showing high numbers of flu cases, suggesting a later-than-normal start to the season.\n “If you have an increase in a respiratory illness when you already have a very high burden of respiratory illness, that puts even more pressure on the health system,” she said, urging people to be vaccinated against flu.", "posttime": "2020-07-29 01:11:19", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "组织,big,病例", "title": "世卫组织称新冠肺炎大流行是“一大波”，而不是季节性的", "title_en": "WHO says Covid-19 pandemic is 'one big wave', not seasonal", "transed": 1, "url": "https://www.reuters.com/article/us-health-coronavirus-who/who-says-covid-19-pandemic-is-one-big-wave-not-seasonal-idUSKCN24T16U", "via": "", "real_tags": ["组织", "big", "病例"]}, {"category": "", "categoryclass": "", "imagename": "2ee4dc5f2108c204320a8a0850e2ca1a.jpg", "infoid": 1014727, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "科学家周二报道，一种新开发的阿尔茨海默氏症血液检测方法对阿尔茨海默氏症的诊断准确率与昂贵或侵入性高得多的方法不相上下，这是患者、医生和痴呆症研究人员朝着长期目标迈出的重要一步。这项测试有可能使诊断变得简单，负担得起，并得到广泛的应用。\n这项测试确定了痴呆症患者是否患有阿尔茨海默氏症，而不是其他疾病。根据发表在“美国医学会网络开放”(JAMA Network Open)上并在阿尔茨海默氏症协会国际会议上发表的研究，该研究在携带导致阿尔茨海默氏症的基因突变的人出现记忆和思维问题的20年前就发现了这种退化的致命疾病的迹象。\n研究人员和其他专家估计，这样的测试可能在短短两到三年内投入临床使用，提供了一种负担得起的简单方法，可以诊断有认知问题的人是否正在经历阿尔茨海默氏症，而不是另一种类型的痴呆症。像这样的血液测试最终也可能被用来预测一个没有症状的人是否会患上阿尔茨海默氏症。\n没有参与这项研究的加州大学旧金山分校(University of California，San Francisco)阿尔茨海默氏症研究员迈克尔·韦纳(Michael Weiner)博士说，“这项血液测试非常、非常准确地预测了谁患有阿尔茨海默氏症，包括那些看起来正常的人。”“这不是治愈，也不是治疗，但在不能诊断的情况下，你不能治疗这种疾病。而且准确、低成本的诊断真的很令人兴奋，所以这是一个突破。“。\n美国有近600万人患有阿尔茨海默氏症，全球约有3000万人患有阿尔茨海默氏症，预计到2050年，随着人口老龄化，他们的人数将增加一倍以上。\n几个研究团队正在开发阿尔茨海默氏症的血液测试，这将为这个在寻找治疗和预防这种剥夺人们记忆和独立运作能力的毁灭性疾病的方法失败后经历失败的领域带来一些希望。\n专家表示，血液测试将使筛选参与者进行临床试验的速度更快、成本更低，从而加快新疗法的搜索。现在，这一过程往往需要数年时间，成本高达数百万美元，因为它依赖于脑部PET扫描和脊椎抽液等昂贵的方法。\n但是，通过快速验血来诊断阿尔茨海默氏症的能力也会加剧人们在伦理和情感上的两难境地，因为人们正在决定自己是否想知道自己患有的是一种尚未治愈或治疗的疾病。\n这项测试测量了在阿尔茨海默氏症患者整个大脑中发现的一种tau蛋白的形式，在对来自瑞典、哥伦比亚和美国三个不同群体的1402人的研究中证明非常准确。它的表现比MRI脑部扫描更好，与PET扫描或脊椎抽吸一样好，几乎与最具决定性的诊断方法一样准确：尸检在人死后在大脑中发现了阿尔茨海默氏症的有力证据。\n马萨诸塞州总医院和哈佛医学院的神经学教授鲁道夫·坦齐(Rudolph Tani)说，“基于数据，这是向前迈出的一大步。”他没有参与这项研究。\n他和其他专家表示，这些结果需要在更多人群的临床试验中复制，包括那些反映更多种族和民族多样性的临床试验。这项测试还需要改进和标准化，这样结果才能在实验室中进行一致的分析，并需要得到联邦监管机构的批准。\n目前，阿尔茨海默氏症的诊断主要是通过对记忆和认知障碍的临床评估，以及对患者家属和照顾者的采访。这种诊断通常是不准确的，因为医生很难将阿尔茨海默氏症与其他痴呆症和涉及认知障碍的身体状况区分开来。\nPET扫描和脊椎穿刺等昂贵且往往无法获得的措施可以检测到淀粉样蛋白水平升高，这种蛋白聚集在阿尔茨海默氏症患者大脑中的斑块中，最近在淀粉样蛋白血液测试方面取得了进展。但仅靠淀粉样蛋白不足以诊断阿尔茨海默氏症，因为一些水平高的人不会患上这种疾病。\n阿尔茨海默氏症协会的首席科学官玛丽亚·卡里洛(Maria Carrillo)说：“今天仅仅通过PET扫描就说你的大脑中有淀粉样蛋白，并不能告诉你他们有tau，这就是为什么它不能诊断出阿尔茨海默氏症。”她说，相比之下，tau血液测试似乎记录了淀粉样斑块和tau缠结的存在，这两种物质都存在于确诊为阿尔茨海默氏症的人的大脑中。\n卡里洛博士说：“这项测试确实开启了一种可能性，可以在诊所使用血液测试来更明确地诊断患有阿尔茨海默氏症的人。”“太神奇了，不是吗？我的意思是，真的，五年前，我会告诉你这是科幻小说。“。\n她说，检测tau也可能对预测一个人的认知能力下降的速度有价值，因为与淀粉样蛋白不同，tau往往随着痴呆症的恶化而增加。\n这项研究的资深作者、瑞典隆德大学(Lund University)临床记忆研究教授奥斯卡·汉森(Oskar Hansson)博士说，在确定痴呆症患者是否患有阿尔茨海默氏症而不是其他神经退行性疾病方面，这项测试的准确率为96%。在一组来自瑞典的近700人中，这种表现类似于PET扫描和脊柱轻拍，而且比MRI扫描和淀粉样蛋白的血液测试更好。淀粉样蛋白是tau的另一种形式，也是第三种神经生物标志物，名为神经丝轻链。\n汉森博士说，阿尔茨海默氏症患者的tau蛋白(称为p-tau217)的含量是没有痴呆症或其他神经系统疾病(如额颞痴呆、血管性痴呆或帕金森氏症)患者的7倍。\n这项研究还将来自亚利桑那州的捐赠者的脑部尸检结果与他们死前捐献的血液的测试结果进行了比较。位于凤凰城的班纳阿尔茨海默氏症研究所(Banner Alzheimer‘s Institute)的另一位资深作者、执行主任埃里克·雷曼(Eric Reiman)博士说，研究发现，血液测试在诊断阿尔茨海默氏症方面的准确率为98%，因为他们被发现患有阿尔茨海默氏病的可能性很高，因为他们的大脑中既有淀粉样斑块，也有广泛的tau缠结。他说，这项测试的准确性是大脑尸检的89%，这些大脑含有斑块，但tau缠结较少，被认为患有阿尔茨海默氏症的可能性中等。\n在世界上最大的遗传性早发性阿尔茨海默氏症家庭的600多名成员中，这项测试基本上确定了谁会在痴呆症症状出现前20年患上这种疾病。在哥伦比亚这个约有6000人的大家庭中，一些人在45岁左右就开始发生突变，导致认知障碍。这项测试可以在25岁的人群中区分那些有突变和没有突变的人。\n血液测试最直接的用途将是加快和降低临床试验的成本，并允许医生诊断或排除痴呆症患者的阿尔茨海默氏症，如果他们和他们的家人寻求这些信息来帮助他们计划未来的事情。\n“确诊的确定性可以帮助患者、家庭照顾者和医生自己应对，”雷曼博士说。\n韦纳博士说，最终可以更早地使用血液测试，让开始出现轻度记忆问题的人知道他们是会患上阿尔茨海默氏症，还是会患上另一种可能不那么咄咄逼人或进展迅速的疾病。\n坦齐博士说，未来可能会对没有任何损伤的人进行血液测试，如果检测到令人担忧的生物标志物水平，可能会将其作为PET扫描的初始筛查工具。\n坦齐博士说，“它承诺可以在我们出现症状之前及早发现这种疾病。”只有在有有效的方法预防或治疗阿尔茨海默氏症的情况下，该领域才会推荐将其用于临床。\n汉森博士说，他的实验室正在研究这项测试是否可以预测没有损伤或有轻度记忆问题的人患上痴呆症。\n“美国医学会杂志”(JAMA)研究中的这项测试使用了一种名为免疫分析的方法来检测与抗体结合的化合物。几种这样的分析方法正在开发中。研究中的特殊化验是由礼来公司(Eli Lilly And Company)开发的，该公司提供了材料和三名员工进行化验；作者报道，该公司被允许审查手稿，但不能否决其中的任何内容。这项研究的大部分资金来自瑞典和美国的政府机构和基金会。\n在阿尔茨海默氏症协会的会议上，汉森博士和合著者卡伊·布伦诺博士(Dr.Kaj Blennow)以及另外两个致力于tau血液测试的研究团队展示了他们的发现。\n其中一项测试是由圣路易斯华盛顿大学(Washington University)的一个团队开发的，团队成员包括兰德尔·贝特曼(Randall Bateman)博士、苏珊娜·辛德勒(Suzanne Schindler)博士和尼古拉斯·巴特勒米(Nicolas Barthélemy)博士。该测试使用了一种名为质谱的方法，可以检测tau或淀粉样蛋白的。在周二发表在“实验医学杂志”上的一项研究中，该团队发现，在“美国医学会杂志”(JAMA)的研究中，与一些研究人员一直关注的另一种形式p-tau 181相比，相同形式的tau p-tau217与大脑中淀粉样蛋白的堆积关系更密切。神经学助理教授辛德勒博士说，这可能是因为p-tau217在阿尔茨海默病过程中出现得更早。\n辛德勒博士说：“我个人认为，这些不同的小组使用不同类型的化验方法，并得到相同的结果，这非常令人放心。”“看起来是真的。看起来217作为阿尔茨海默病的血液测试有很大的希望，而且很可能与症状相一致。“。\n博克瑟博士说，在会议上公布的另一项研究中，加州大学旧金山分校的神经病学家亚当·博克瑟(Adam Boxer)博士和来访的研究生伊丽莎白·蒂伊森(ElisElizabeth Thijssen)博士在“美国医学会杂志”(JAMA)的研究中使用了相同的免疫分析方法，发现这两种形式的tau都可以区分阿尔茨海默氏症和额颞叶痴呆，这表明这些蛋白在检测tau与阿尔茨海默氏症相关方面的特异性有多高。\n一些研究人员正在与公司合作，或者像贝特曼博士和雷曼博士一样，成立了自己的公司。最终，各种方法可能会被批准用于医疗用途。卡里洛博士说，质谱的优点是依赖已经在使用的机器，但缺点是比免疫分析更昂贵，需要更多的专业知识，因为免疫分析很容易被定期进行血液测试的实验室进行分析。\n韦纳博士说：“在几年内，很有可能会有针对这些蛋白质和其他蛋白质的认证实验室检测，或许还会开发出帕金森氏症等检测方法。”“这是一个新的世界。”", "note_en": "A newly developed blood test for Alzheimer’s has diagnosed the disease as accurately as methods that are far more expensive or invasive, scientists reported on Tuesday, a significant step toward a longtime goal for patients, doctors and dementia researchers. The test has the potential to make diagnosis simple, affordable and widely available.\n The test determined whether people with dementia had Alzheimer’s instead of another condition. And it identified signs of the degenerative, deadly disease 20 years before memory and thinking problems were expected in people with a genetic mutation that causes Alzheimer’s, according to  research published in JAMA Network Open and presented at the Alzheimer’s Association International Conference.\n Such a test could be available for clinical use in as little as two to three years, the researchers and other experts estimated, providing an affordable, simple way to diagnose whether people with cognitive issues were experiencing Alzheimer’s, rather than another type of dementia. A blood test like this might also  eventually be used to predict whether someone with no symptoms would develop Alzheimer’s.\n “This blood test very, very accurately predicts who’s got Alzheimer’s disease in their brain, including people who seem to be normal,” said Dr. Michael Weiner, an Alzheimer’s disease researcher at the University of California, San Francisco, who was not involved in the study. “It’s not a cure, it’s not a treatment, but you can’t treat the disease without being able to diagnose it. And accurate, low-cost diagnosis is really exciting, so it’s a breakthrough.”\n Nearly  six million people in the United States and roughly  30 million worldwide have Alzheimer’s, and their ranks are expected to more than double by 2050 as the population ages.\n Blood tests for Alzheimer’s, which are being developed by several research teams, would provide some hope in a field that has experienced failure after failure in its search for ways to treat and prevent a devastating disease that robs people of their memories and ability to function independently.\n Experts said blood tests would accelerate the search for new therapies by making it faster and cheaper to screen participants for clinical trials, a process that now often takes years and costs millions of dollars because it relies on expensive methods like PET scans of the brain and spinal taps for cerebrospinal fluid.\n But the ability to diagnose Alzheimer’s with a quick blood test would also intensify ethical and emotional dilemmas for people deciding whether they wanted to know they had a disease that does not yet have a cure or treatment.\n The test, which measures a form of the tau protein found in tangles that spread throughout the brain in Alzheimer’s, proved remarkably accurate in a study of 1,402 people from three different groups in Sweden, Colombia and the United States. It performed better than MRI brain scans, was as good as PET scans or spinal taps and was nearly as accurate as the most definitive diagnostic method: autopsies that found strong evidence of Alzheimer’s in people’s brains after they died.\n “Based on the data, it’s a big step forward,” said Rudolph Tanzi, a professor of neurology at Massachusetts General Hospital and Harvard Medical School, who was not involved in the research.\n He and other experts said that the results would need to be replicated in clinical trials in more populations, including those reflecting more racial and ethnic diversity. The test will also need to be refined and standardized so results can consistently be analyzed in labs, and will need approval by federal regulators.\n Currently, Alzheimer’s diagnoses are made mostly with clinical assessments of memory and cognitive impairment, as well as interviews with patients’ family members and caregivers. The diagnoses are often inaccurate because doctors have trouble distinguishing Alzheimer’s from other dementias and physical conditions that involve cognitive impairment.\n Measures like PET scans and spinal taps — costly and often unavailable — can detect elevated levels of amyloid protein, which clumps into plaques in the brains of people with Alzheimer’s, and there has been recent progress on blood tests for amyloid. But amyloid alone isn’t enough to diagnose Alzheimer’s because some people with high levels don’t develop the disease.\n “Just saying you have amyloid in the brain through a PET scan today does not tell you they have tau, and that’s why it is not a diagnostic for Alzheimer’s,” said Maria Carrillo, chief science officer at the Alzheimer’s Association. By contrast, the tau blood test appears to register the presence of amyloid plaques and tau tangles, both of which are in brains of people with confirmed Alzheimer’s, she said.\n “This test really opens up the possibility of being able to use a blood test in the clinic to diagnose someone more definitely with Alzheimer’s,” Dr. Carrillo said. “Amazing, isn’t it? I mean, really, five years ago, I would have told you it was science fiction.”\n Detecting tau may also be valuable for predicting how quickly a person’s cognitive abilities will decline, because, unlike amyloid, tau tends to increase as dementia worsens, she said.\n  The test was 96 percent accurate in determining whether people with dementia had Alzheimer’s rather than other neurodegenerative disorders, said Dr. Oskar Hansson, a senior author of the study and a professor of clinical memory research at Lund University in Sweden. That performance, in a group of nearly 700 people from Sweden, was similar to PET scans and spinal taps, and it was better than MRI scans and blood tests for amyloid, another form of tau and a third type of neurological biomarker called neurofilament light chain.\n People with Alzheimer’s had seven times more of the tau protein, called p-tau217, that the test measured than people without any dementia or those with other neurological disorders, like frontotemporal dementia, vascular dementia or Parkinson’s disease, Dr. Hansson said.\n  The study also compared findings of brain autopsies of donors from Arizona with test results on blood that they donated before they died. It found the blood test was 98 percent as accurate in diagnosing Alzheimer’s as autopsies of people found to have had a high likelihood of the disease because they had both amyloid plaques and extensive tau tangles in their brains, said Dr. Eric Reiman, another senior author and the executive director of the Banner Alzheimer’s Institute in Phoenix. The test was 89 percent as accurate as autopsies of brains that contained plaques but had fewer tau tangles and were considered moderately likely to have had Alzheimer’s, he said.\n And in over 600 members of  the world’s largest family with genetic early-onset Alzheimer’s, the test essentially identified who would develop the disease 20 years before dementia symptoms would surface. In this extended family in Colombia of about 6,000 people, some have a mutation that causes cognitive impairment beginning in their mid-40s. The test could distinguish between those with and without the mutation in people as young as 25.\n The most immediate uses of blood tests would be to speed up and lower the cost of clinical trials and to allow doctors to diagnose or rule out Alzheimer’s in patients with dementia if they and their families sought that information to help them plan for what lay ahead.\n “The certainty of a diagnosis could help patients, family caregivers and physicians themselves cope,” Dr. Reiman said.\n Blood tests could eventually be used earlier, allowing people who were beginning to have mild memory issues to learn whether they would develop Alzheimer’s or instead had another condition that might be less aggressive or fast-moving, Dr. Weiner said.\n And, Dr. Tanzi said, in the future blood tests might be given to people without any impairment, perhaps as initial screening tools to be followed with PET scans if worrisome levels of biomarkers were detected.\n “It has the promise to make early detection of the disease possible, before we have symptoms,” Dr. Tanzi said, something the field would only recommend for clinical use if there were effective ways to prevent or treat Alzheimer’s.\n Dr. Hansson said his lab was studying whether the test could predict dementia in people with no impairments or those with mild memory problems.\n The test in the JAMA study used a method called an immunoassay to detect compounds that bind to antibodies. Several such assays are being developed. The particular assay in the study was developed by Eli Lilly and Company, which provided materials and three employees to conduct the assays; the company was allowed to review the manuscript but not veto anything in it, the authors reported. Most of the funding for the study came from government agencies and foundations in Sweden and the United States.\n At the Alzheimer’s Association conference, Dr. Hansson and a co-author, Dr. Kaj Blennow, presented their findings, as did two other research teams working on tau blood tests.\n One test, developed by a team at Washington University in St. Louis that included Dr. Randall Bateman, Dr. Suzanne Schindler and Nicolas Barthélemy, used a method called mass spectrometry, which detects entire molecules of tau or amyloid. In a  study published on Tuesday in the Journal of Experimental Medicine, that team found that the same form of tau in the JAMA study, p-tau217, correlated more closely to amyloid buildup in the brain than another form, p-tau 181, that some researchers have been focusing on. Dr. Schindler, an assistant professor of neurology, said that might be because p-tau217 emerges earlier in the Alzheimer’s disease process.\n “I personally find it very reassuring that these different groups are using different types of assays and getting the same result,” Dr. Schindler said. “It looks real. It looks like 217 has tremendous promise as a blood test for Alzheimer’s disease, and it is likely to correspond with the symptoms.”\n In another study presented at the conference, Dr. Adam Boxer, a neurologist at U.C.S.F., and Elisabeth Thijssen, a visiting graduate student, used the same immunoassay in the JAMA study and found both forms of tau could distinguish Alzheimer’s from  frontotemporal dementia, showing how specific these proteins are for detecting tau associated with Alzheimer’s, Dr. Boxer said.\n Several researchers are working with companies or, like Dr. Bateman and Dr. Reiman, have formed their own. Ultimately, various methods may be approved for medical use. Dr. Carrillo said mass spectrometry had the advantage of relying on a machine that was already in use, but the disadvantage of being more expensive and requiring more expertise than immunoassays, which are easily analyzed by laboratories that routinely run blood tests.\n “Within a few years, it’s very possible that there will be certified laboratory tests for these proteins and others, and maybe tests will be developed for Parkinson’s disease and so forth,” Dr. Weiner said. “It’s a new world.”", "posttime": "2020-07-29 01:10:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阿尔茨海默氏症,sought", "title": "长期寻求的阿尔茨海默氏症的血液测试", "title_en": "Long Sought Blood Test for Alzheimer’s in Reach", "transed": 1, "url": "https://www.nytimes.com/2020/07/28/health/alzheimers-blood-test.html", "via": "", "real_tags": ["阿尔茨海默氏症", "sought"]}, {"category": "", "categoryclass": "", "imagename": "8df5f2a599796c646911176e2209945d.png", "infoid": 1014725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们还在与开源社区迭代构建我们的许多功能，包括最近的GitHub讨论测试版。随着客户已经习惯了我们运送新东西，我们还听到您明确地告诉我们，您希望更清楚地了解我们正在做什么、我们要运送什么以及何时发货。\n今天，我们很兴奋地宣布GitHub的公共路线图。公共路线图旨在为您的团队提供更多信息，让他们了解您在接下来的几个季度中可以从GitHub获得哪些特性和功能。随着我们正在建设的项目更加透明，您还可以更好地计划和更早地分享反馈，以影响我们正在建设的项目。\nGitHub公共路线图是GitHub上一个新的公共存储库，任何人都可以访问。在那里，您会找到一个项目板，上面列出了即将发布的版本。黑板上的每一项都链接到一个详细的问题，上面有更多关于我们正在计划什么，为什么它很重要，什么时候我们希望交付它，以及我们希望它如何工作的更多信息。\n例如，如果您使用“测试版”、“服务器”和“安全法规遵从性”标签来过滤项目董事会，您将看到我们计划在测试版中为GitHub Enterprise Server带来代码扫描和秘密扫描的季度。您还可以查看存储库或订阅各个路线图问题，以便在GitHub中直接收到有关更改的通知。\n从历史上看，GitHub曾在重大活动或偶尔的博客文章中分享前瞻性的产品公告，我们将继续这样做。虽然公众路线图不是详尽的，但它将包括我们产品计划的大部分方面，并将定期更新。\n如果你有问题或意见，可以在GitHub社区论坛上公开分享，或者通过分享反馈页面私下分享，就像你今天已经做的那样。我们期待与您保持联系，并听取您对路线图内容的反馈。\n除了路线图的内容会定期更新外，我们还计划对路线图本身的格式进行迭代。我们看到反应、问题评论甚至是GitHub讨论的潜力，它们是对存储库的有价值的补充，可以直接从社区接收关于我们的计划的反馈信号。如果您对路线图存储库本身有反馈，例如问题是如何呈现的，请通过此共享反馈页面让我们知道。", "note_en": "We’re also building many of our features iteratively with the open source community, including the recent  GitHub Discussions beta. As customers have gotten used to us shipping new things, we’ve also heard you clearly tell us that you’d like more visibility into what we’re working on, what we’re going to be shipping, and when.\n Today, we’re excited to announce the  GitHub public roadmap. The public roadmap is designed to give your team more information about what features and functionality you can expect from GitHub over the coming quarters. With more transparency into what we’re building, you can also plan better and share feedback earlier to influence what we’re building.\n  The  GitHub public roadmap is a new public repository on GitHub that anyone can access. There, you’ll find a project board that lays out upcoming releases. Each item on the board links to a detailed issue with more information about what we’re planning, why it’s important, when we expect to deliver it, and a bit about how we expect it to work.\n  For example, if you filter the project board using the “beta”, “server”, and “security &amp; compliance” labels you’ll see which quarter we plan to bring code scanning and secret scanning to GitHub Enterprise Server in beta. You can also watch the repository or subscribe to individual roadmap issues to be notified about changes directly within GitHub.\n  Historically, GitHub has shared forward-looking product announcements at major events or in the occasional blog post, and we’ll continue to do this. While the public roadmap isn’t exhaustive, it will include most aspects of our product plans, and will be regularly updated.\n  If you have questions or comments, share them publicly on the  GitHub Community Forum or privately via the  Share feedback page, as you already do today. We look forward to keeping you informed and to hearing your feedback about what’s on the roadmap.\n Besides the content of the roadmap being updated regularly, we’re also planning to iterate on the format of the roadmap itself. We see the potential of reactions, issue comments, and even  GitHub Discussions being valuable additions to the repository for receiving direct signals back from the community about what we’ve planned. If you have feedback about the roadmap repository itself, such as how the issues are presented, let us know through this  Share feedback page.", "posttime": "2020-07-29 00:41:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,public", "title": "GitHub公共路线图", "title_en": "The GitHub Public Roadmap", "transed": 1, "url": "https://github.blog/2020-07-28-announcing-the-github-public-roadmap/", "via": "", "real_tags": ["github", "public"]}, {"category": "", "categoryclass": "", "imagename": "b4aca740f4de52fb19edb0b537b3474f.png", "infoid": 1014724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在这个库中，您可以找到官方的GitHub公共产品路线图。在我们的产品路线图中，您可以了解我们正在开发哪些功能，它们所处的阶段，以及我们预计何时将它们带给您。对路线图上的项目有任何问题或意见吗？加入GitHub社区论坛的讨论，或通过分享反馈页面分享您的反馈。\n我们开始时，路线图当前处于只读状态，对话已锁定。然而，我们期待不久能够在GitHub上更多地参与到关于GitHub产品和功能的未来的讨论中。如果您对此路线图存储库本身有反馈，例如问题是如何呈现的，请通过此共享反馈页面让我们知道。\n路线图上的每个项目都是一个问题，每个项目都有一个标签表示以下各项：\n描述路线图项目的下一个预期阶段的发布阶段。有关发布阶段的指南，请参阅下面的内容。\n指示项目所属产品区域的功能区域。有关当前产品领域的列表，请参阅下面的内容。\n指示项目所属的功能或产品的功能。有关当前功能的列表，请参阅下面的内容。\n一个或多个产品SKU标签，指明我们希望在哪些产品SKU中提供该功能。有关当前产品SKU的列表，请参阅下面的内容。\n一个或多个部署模型(云和/或服务器)。如果没有说明，特性通常会先在云中发布，然后在正式发布之后或很快出现在服务器上。\n每个产品或功能都会经历一组发布阶段，从早期测试到全面上市。\nAlpha：主要用于测试和反馈，可用性有限，需要预发布协议。功能仍在大力开发中，并可能发生变化。不用于生产，不提供任何文档、SLA或支持。\n测试版：公开提供全容量或有限容量功能，大部分功能完整且有文档记录。GA的时间表和要求通常会公布。未提供SLA或支持。\nGA：通常提供给所有准备生产使用的客户，并承担相关的SLA和技术支持义务。大约1-2个季度距离Beta。\n我们的一些功能可能还处于探索阶段，没有可用的时间表。这些内容仅包含在路线图中以供早期反馈。这些标记如下：\n设计中：发现阶段的功能。我们已经决定构建此功能，但仍在研究如何构建。\n路线图被安排在项目板上，以给出每个项目离地平线有多远的感觉。每个产品或功能都会根据预计下一次发货的季度添加到特定的项目公告板栏中。请务必阅读下面的免责声明，因为路线图可能会更改，特别是在时间线更靠后的地方。您还会发现一个探索性列，它与In Design and Explore Release阶段标签一起使用，用于在没有可用的时间范围时使用。\nGitHub Enterprise Server每季度发布一次主要版本，每月发布一次次要版本。一旦我们知道要交付功能的版本，我们将更新问题以指明该信息。\n以下是我们当前的功能和产品列表，带有用于过滤的不同标签：\n全部：所有用户均可使用，包括免费级别。不同的SKU可能具有不同的功能级别。\n该存储库中任何非纯历史的陈述都被认为是前瞻性陈述。本存储库中包含的前瞻性声明基于GitHub截至发布之日可获得的信息，GitHub不承担更新任何前瞻性声明的义务。前瞻性产品路线图并不代表承诺、保证、义务或承诺交付任何产品或功能，或在任何特定日期交付任何产品和功能，其目的是概述总体开发计划。客户不应依赖此路线图来做出任何购买决定。", "note_en": "In this repository, you can find the  official GitHub public product roadmap. Our product roadmap is where you can learn about what features we&#39;re working on, what stage they&#39;re in, and when we expect to bring them to you. Have any questions or comments about items on the roadmap? Join the discussion over on the  GitHub Community Forum or share your feedback via the  Share feedback page.\n The roadmap is currently in a read-only state, with locked conversations, as we get started. However, we anticipate being able to engage more in discussions about the future of GitHub products and features, here on GitHub, soon. If you have feedback about this roadmap repository itself, such as how the issues are presented, let us know through this  Share feedback page.\n  Every item on the roadmap is an issue, with a label that indicates each of the following:\n A  release phase that describes the next expected phase of the roadmap item. See below for a guide to release phases.\n A  feature area that indicates the area of the product to which the item belongs. For a list of current product areas, see below.\n A  feature that indicates the feature or product to which the item belongs. For a list of current features, see below.\n One or more  product SKU labels that indicate which product SKUs we expect the feature to be available in. For a list of current product SKUs, see below.\n One or more  deployment models (cloud and/or server). Where not stated, features will generally come out cloud first, and follow on server at or soon after GA.\n  Every product or feature goes through a set of release phases, from early testing to general availability.\n alpha:  Primarily for testing and feedback Limited availability, requires pre-release agreement. Features still under heavy development, and subject to change. Not for production use, and no documentation, SLAs or support provided.\n beta:  Publicly available in full or limited capacity Features mostly complete and documented. Timeline and requirements for GA usually published. No SLAs or support provided.\n ga:  Generally available to all customers Ready for production use with associated SLA and technical support obligations. Approximately 1-2 quarters from Beta.\n Some of our features may still be in the exploratory stages, and have no timeframe available. These are included in the roadmap only for early feedback. These are marked as follows:\n in design: Feature in discovery phase. We have decided to build this feature, but are still figuring out  how.\n  The roadmap is arranged on a project board to give a sense for how far out each item is on the horizon. Every product or feature is added to a particular project board column according to the quarter in which it is expected to ship next. Be sure to read the  disclaimer below since the roadmap is subject to change, especially further out on the timeline. You&#39;ll also find an  Exploratory column, which is used in conjunction with the  in design and  exploring release phase labels for when no timeframe is yet available.\n GitHub Enterprise Server has major releases on a quarterly basis, and minor releases on a monthly basis. Once we know what version we are delivering a feature, we will update the issue to indicate that information.\n     The following is a list of our current features and products, with distinct labels for filtering:\n     all: Available to all users, including a free tier. Different SKUs may have different levels of functionality.\n  Any statement in this repository that is not purely historical is considered a forward-looking statement. Forward-looking statements included in this repository are based on information available to GitHub as of the date they are made, and GitHub assumes no obligation to update any forward-looking statements. The forward-looking product roadmap does not represent a commitment, guarantee, obligation or promise to deliver any product or feature, or to deliver any product and feature by any particular date, and is intended to outline the general development plans. Customers should not rely on this roadmap to make any purchasing decision.", "posttime": "2020-07-29 00:41:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "github,public,功能", "title": "GitHub公共路线图", "title_en": "GitHub Public Roadmap", "transed": 1, "url": "https://github.com/github/roadmap", "via": "", "real_tags": ["github", "public", "功能"]}, {"category": "", "categoryclass": "", "imagename": "1732d8fdec9b75d52199f6a4bb067fc7.jpg", "infoid": 1014721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GPT-3最令人沮丧的限制之一是上下文窗口：2048BPES在您开始提示性编程时会很快用完，而且像BPES这样的黑客会有令人讨厌和微妙的副作用(例如，没有双关语或押韵；_；)。我们如何让未来的变形金刚拥有合理的上下文窗口和/或内存？\n下面我对打破密集注意力二次瓶颈的研究进行整理和归类(麦迪逊五月综述)：\n请随时提出我错过的建议或讨论您认为正确的前进方向。\n级别1在实际操作中，您会根据OpenAI&#39；的缩放文件使用不会太大的批次大小，因此在合理的批次大小范围内，O(N*sqrt(N))(例如Routing Transformer)相对于O(N)是足够小的。此外，路由变压器的性能似乎足够好的文本相比，与全注意力对应的相同上下文长度。OpenAI的稀疏变压器也是如此，其他模式也是如此。所以，目前在变形金刚中并没有真正的二次注意力瓶颈，因为我们已经有了很好的架构可以使用。\n现在，问题是，由于我们可以用来获得合理的性能-计算折衷的批处理大小如上所述，所以上下文大小也是上界。此外，我们在一般情况下可以利用的上下文大小也是我们拥有的数据集样本可用的典型上下文大小的上限。例如，WebText的平均样本长度只有1000左右。因此，对当前远程LM方法的扩展中的体系结构改进不能进一步扩展上下文。换句话说，由于样本长度和批次大小的原因，我们遇到了上下文大小的瓶颈。\n但是，您没有提到的基于检索的方法可以打破这一瓶颈。这包括许多最新的模型，包括KNN-LM、RAG、Fusion-in-Decoder、MARGE等。本质上，这些方法从当前样本和类似于当前样本上下文的不同样本中检索相关信息。KNN-LM尤其比SOTA远程LM(如路由变压器)性能更好。在某种意义上，这种方法是通过FAISS利用近似的KNN来关注数据集中的所有样本。\n然而，基于KNN-LM和DPR的方法(RAG和Fusion-in-Decoder)与MARGE相比有更大的局限性，因为它们的检索器和建模部分是分开训练的。另一方面，Marge可以以这样一种方式进行训练，即两个组件端到端的联合训练是不同的。因此，在我看来，Marge对因果LM的扩展，通过Faiss定期更新KNN，将是具有无限上下文大小的因果LM的一个有前途的下一步。\n2级是的，任何一种n*log(N)或n*sqrt(N)都是完全可行的，它将取决于那里的恒定因子&amp；Length。\n但是，看WebText完全太狭隘了。毕竟，书籍很重要。您还希望处理图像或音频等序列或电子表格/表格等结构化数据，这些数据远远超出了1k字，这意味着您可以立即从长达数百万的序列中获益。这将是非常好的，如果有一个多模式转换器，可以学习普通的文本和图像(不只是普通的图像，但序列/视频，或PDF页面，一般是一个巨大的未开发的资源，但本质上作为一种图像格式，没有惊人的OCR无用-或直接从图像学习)。\n我没有提到像领域这样的检索，因为我不清楚它们在什么意义上是一种解决方案。您不会在每次想要运行模型时都拖着整个数据集！您可以拥有任何长度的上下文，只要它的黑色WWikipedia不是语言模型或语言生成的解决方案即可。(毕竟，如果您的期望值如此之低，您只需在您的数据集上进一步微调GPT-3即可！)。\n第2级你通过限制在短文本上错过了太多。短篇小说的字数在1500-7500字之间。长篇小说的数量要多出几个数量级(短篇小说超过4万字)。作为参考，第一部和最后一部哈利波特小说大约有8万到20万字长。像“权力的游戏”这样的书每本30万字(+/-10万字)。\n那教科书呢？我找不到好的字数，但我书架上的大多数教科书都在400-1000页之间。我猜它们大多都在30万字以上。\n如果我们想真正打开最丰富的知识来源，我们需要破解书籍。\n级别1我知道这不完全是关于主题的，但是为了完整起见，值得一提的是，我们最终可能会回到RNN。也许我们离让它们像变形金刚一样正常工作只差几招了。\n我仍然希望我们能通过这一瓶颈，并期待着随着这一领域的进展而关注它，但我们应该对这两种方法都持开放态度。\n第二级我们可能会，但也许他们会被称为“变形金刚”，然后无论如何都会被称为“变形金刚”(Transformers&#34；Transformers)。你知道这是怎么回事--总有人表明，实际上，Resnet/高速公路网/任何展开的RNNs或RNNs实际上，自回归线性注意力变形金刚(AutoregedLinealAttect Transformers)就是RNNs。但是，无论是黑猫还是白猫，只要它抓到老鼠，人们就不会太在意它的名字或细节，而且现在，人们似乎在把“变形金刚”变成RNN方面做得比把RNN变成“变形金刚”做得更好。\n1级IMO，这似乎是目前一般变压器和序列预测器的最大弱点。\n我认为变压器的复发机制还在探索之中。变压器XL不是真正的循环，并且有一个有限的上下文窗口。老式重复的问题是每个人都使用截断的BPTT来训练他们的RNN。这种方法是超级串行的，参数#/GPU VRAM比率非常糟糕。这意味着在实践中，你实际上不能使用一个大的模型在很长的时间序列上进行反向传播。但是，还有其他学习递归模型的方法没有这些限制。我想到了学习隐马尔可夫模型和粒子过滤器的在线算法。\n使用微调吗？我知道OpenAI&#39；GPT-3最大的灵活性就是你不需要这样做，但这就是GPT-2做事情的方式，我不明白为什么你不能用GPT-3做同样的事情来完成更困难的任务。\n顺便说一句，为什么OpenAI选择使用巨大的标准转换器架构，而不是上面提到的任何改进，这对我来说仍然是一件痛苦的事情。这特别奇怪，因为OpenAI自己负责稀疏转换器之类的事情。\n级别2也许他们想要证明GPT-3的改进可以完全归功于扩展。但是，对于降低成本或扩大数据集而言，快速变压器变体应该是最受关注的。\n第二级，我怀疑最大的原因是培训所需的大量投资。当你在一次训练中花费1200万美元在计算机上时，你可能不想做太多的实验。\n级别2我们使用与GPT-2[RWC+19]相同的模型和体系结构，包括其中描述的修改的初始化、预归一化和可逆标记化，不同之处在于我们在变压器的各层中交替使用密集和局部带状稀疏注意模式，类似于稀疏变压器&#34；\n级别1还考虑了谈话卷积(ICML2020，https://arxiv.org/abs/2002.03184)，提出了一种新的方法，在不使用自我关注的情况下在线性时间内编码句子，并获得了有希望的结果。\n第2级，ICML 2020上发表的一篇MT论文仍然使用multibleu.perl报告性能，这让我感到困惑。我理解想要使您的数字与较旧的论文相比较，但是multibleu.perl依赖于标记化，并在其输出中明确说明了这一点！\n从multibleu.perl发布分数是不可取的。分数取决于你的标记器，这不太可能从你的论文中重现，也不可能在各个研究小组中保持一致。相反，您应该取消标记化，然后使用mteval-v14.pl，它有一个标准的标记化。当您拥有一致的记号赋值器时，来自multibleu.perl的分数仍然可以用于内部目的。\n如果他们真的觉得有必要报告multibleu.perl，那么他们至少应该使用sarebleu(或者去标记化，然后运行mteval)，并将这些数字包括在论文中。如果这不是建议的话，我对评论家没什么信心。\n级别1另一篇研究变压器模型中注意力的论文，希望加速注意力计算：用于神经机器翻译的硬编码高斯注意力。\n我实际上开始着手于一些新的想法，这些想法可以被视为类似于压缩历史的方法。最终，我认为这是最好的前进方式，因为不是每个被建模的令牌都具有相同的熵量，因此应该可以基于熵压缩历史，而不会对建模能力造成太多(或任何)损失。至少，这是我目前的看法。\n级别2，但在某种意义上，BPES已经使令牌的熵相等(更常见的序列可以形成更长的令牌)？", "note_en": "One of the most frustrating limitations of GPT-3 is the context window: 2048 BPEs runs out fast when you start prompt programming something hard, and hacks like  BPEs have nasty &amp; subtle side-effects (eg no puns or rhyming ;_;). How do we get future Transformers with reasonable context windows and/or memory?\n Below I compile &amp; categorize the research on breaking the dense attention quadratic bottleneck ( Madison May overview):\n  Feel free to suggest ones I missed or discuss what you think is the right direction forward.\n    level 1  In practice, you would like to use the batch size not insanely large according to OpenAI&#39;s scaling paper, so within the range of reasonable batch size, O(N*sqrt(N)) (e.g. Routing Transformer) is small enough relative to O(N). Furthermore, Routing Transformer&#39;s performance seems good enough for text compared with the full attention counterpart with the same context length. Likewise for OpenAI&#39;s Sparse Transformer etc for other modality. So, currently there isn&#39;t really quadratic attention bottleneck in Transformers, since we already have good architectures to use.\n Now, the problem is that, since the batch size we can use to get reasonable performance-computes tradeoff is upper-bounded as discussed above, so is the context size. Also, context size we can exploit in the generic situation is also upper-bounded by the typical context size available to the dataset samples we have. For example, the average sample length of WebText is only about 1000. So, architectural improvement in extension of the current approach of long-range LM cannot extend the context further. In other words, we have this bottleneck of context size due to sample length and batch size.\n However, retrieval-based approaches, which you have not mentioned, can break this bottleneck. This includes many recent models, including knn-LM, RAG, Fusion-in-Decoder, MARGE etc. Essentially, these methods retrieve relevant information from the current sample and diffeent samples similar to the context of the current sample. knn-lm, in particular, performs better than the SOTA long-range LM such as Routing Transformer. This approach, in some sense, is attention over all samples in the dataset by utilizing approximate knn through faiss.\n However, knn-LM and DPR-based methods (RAG and Fusion-in-Decoder) are more limited compared with MARGE, since their retriever and modeling components are trained separately. MARGE, on the other hand, can be trained in a way such that both components are jointly trained end-to-end differentiably. Hence, in my opinion MARGE&#39;s extension to causal LM, by periodically updating the knn through faiss, would be a promising next step for causal LM with infinite context size.\n level 2  Yeah, any kind of n*log(n) or n*sqrt(n) is entirely feasible, it&#39;ll depend on the constant factors &amp; lengths there.\n But looking at WebText is entirely too narrow. Books are important, after all. You also want to handle sequences like images or audio or structured data like spreadsheets/tables, which go vastly beyond a mere 1k words, and that instantly means you can benefit from sequences of up to millions in length. It would be  very nice to have a multimodal Transformer which can learn on both regular text and images (not just regular images, but sequences/videos, or PDF pages which in general are a huge untapped resource but as essentially an image format, useless without amazing OCR - or learning from the images directly).\n I didn&#39;t mention retrieval like REALM because it&#39;s not clear to me in what sense they are a solution. You&#39;re not going to haul around the entire dataset every time you want to run the model! &#34;You can have any length context you want, so long as it&#39;s black^WWikipedia&#34; is not really a solution for language models or generation. (After all, if your expectations are that low, you could just finetune GPT-3 further on your dataset!)\n  level 2  You&#39;re missing so much by limiting to short texts. Short stories are in the 1,500-7,500 word range. Novels are orders of magnitude more (40,000+ words for short ones). For reference, the first and last Harry Potter novels were about 80,000 and 200,000 words long. Books like game of thrones are 300,000 words each (+/- 100,000 words).\n What about textbooks? I can&#39;t find good wordcounts, but most of the textbooks on my shelf are in the 400-1000 page range. I&#39;d guess they&#39;re mostly well north of 300,000 words each.\n If we want to really unlock the most informative sources of knowledge, we need to crack books.\n    level 1  I know this isn’t entirely on topic, but for the sake of completeness it’s also worth mentioning we may eventually pivot back to RNNs. Maybe we were just a few tricks away from getting them to work as well as transformers.\n I’m still hoping we can pass this bottleneck, and looking forward to following this field as it progresses, but we should keep an open mind to both approaches.\n level 2  We may, but perhaps they&#39;ll be called &#34;Transformers&#34; then anyway. You know how it is - there&#39;s always someone showing that &#39;actually, resnets/highway nets/whatever are unrolled RNNs&#39; or &#39;actually, autoregressive linear attention Transformers are RNNs&#39;. But, whether a black cat or a white cat, as long as it catches mice, people won&#39;t care too much about the name or details, and right now, people seem to be doing a better job at making Transformers into RNNs than RNNs into Transformers.\n  level 1  IMO, this seems to be the biggest weakness of transformers and sequence predictors in general at the moment.\n   I think recurrence mechanisms with transformers are under explored. Transformer XL isn&#39;t truly recurrent and has a finite context window. The problem with old school recurrence is that everyone trains their RNNs using truncated BPTT. This approach is super serial and has a terrible parameter # / GPU VRAM ratio. This means that in practice you can&#39;t actually use a big model to back-propagate over a long time series. But there are other ways of learning recurrent models that don&#39;t have those limitations. Online algorithms for learning HMMs and particle filters come to mind...\n  Use fine tuning? I know that OpenAI&#39;s big flex with GPT-3 was specifically that you didn&#39;t need to do that, but that is how things were done with GPT-2 and I don&#39;t see why you couldn&#39;t do the same with GPT-3 for more difficult tasks.\n  As an aside, It remains a misery to me why OpenAI opted to use a huge standard transformer architecture rather than any of the above mentioned improvements. This is especially odd given that OpenAI themselves were responsible for things like the sparse transformer.\n level 2  Maybe they wanted to show the GPT-3 improvement can be attributed solely to scaling up. But a fast transformer variant should be of top interest for cost reduction or dataset enlargement.\n  level 2  I suspect the biggest reason was the massive investment required for training. When you&#39;re spending 12 million on compute for one training run, you probably don&#39;t want to experiment too much.\n  level 2  We use the same model and architecture as GPT-2 [RWC+19], including the modified initialization, pre-normalization, and reversible tokenization described therein,  with the exception that we use alternating dense and locally banded sparse attention patterns in the layers of the transformer, similar to the Sparse Transformer&#34;\n   level 1  Also look at TaLK convolutions (ICML 2020,  https://arxiv.org/abs/2002.03184), proposes to a new way for encoding sentences in linear time without using self-attention and with promising results.\n level 2  It’s baffling to me that a MT paper published in ICML 2020 is still reporting performance using multi-bleu.perl. I understand wanting to make your numbers comparable with older papers, but multi-bleu.perl is dependent upon tokenization and specifically states so in its output!\n It is not advisable to publish scores from multi-bleu.perl. The scores depend on your tokenizer, which is unlikely to be reproducible from your paper or consistent across research groups. Instead you should detokenize then use mteval-v14.pl, which has a standard tokenization. Scores from multi-bleu.perl can still be used for internal purposes when you have a consistent tokenizer.\n They should at least use  sacreBLEU (or detokenize then run mteval) and include those numbers in the paper in addition if they really feel the need to report multi-bleu.perl. I have little faith in reviewers if this wasn’t suggested.\n  level 1  Another paper which investigates attention in Transformer models with the hopes of speeding up the attention computation:  Hard-Coded Gaussian Attention for Neural Machine Translation.\n I&#39;m actually starting to work on some new ideas that can be seen as similar to the compressive history approach. Ultimately, I think those are the best ways forward, as not every token being modeled has the same amount of entropy, thus it should be possible to compress the history based on entropy without too much (or any) loss in modeling ability. At least, that&#39;s my current opinion.\n level 2  But in some sense BPEs already equalize entropy of token (more common sequences get to form longer tokens)?", "posttime": "2020-07-29 00:39:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "信息提取,attention", "title": "GPT-3类模型中注意广度与信息提取的探讨", "title_en": "Discussion of Attention Span and Information Retrieval in GPT-3 Like Models", "transed": 1, "url": "https://www.reddit.com/r/MachineLearning/comments/hxvts0/d_breaking_the_quadratic_attention_bottleneck_in/", "via": "", "real_tags": ["信息提取", "attention"]}, {"category": "", "categoryclass": "", "imagename": "27326eb4fb46019041d9744566c1f44c.jpg", "infoid": 1014720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "消费电子展(CES)在2020年初冠状病毒来袭之前举行，但在2021年不会是这样。今天，该展会的主办方消费者技术协会(CTA)宣布取消在拉斯维加斯举行的CES 2021。该展会将成为仅限在线的活动。\nCES 2021原定于1月初举行，但由于美国面临可怕的大流行应对措施，CTA认为美国到明年还没有准备好举办国际活动。CTA总裁兼首席执行官加里·夏皮罗(Gary Shapiro)发出了一封电子邮件，用现在非常熟悉的COVID取消语言。在疫情蔓延和全球对新冠肺炎传播的健康担忧与日俱增之际，夏皮罗写道，2021年1月初，安全地召集数以万计的人在拉斯维加斯会面并当面做生意是不可能的。\n夏皮罗说，2021年CES正在转向2021年的全数字平台，并提供一种独特的体验，帮助我们的参展商与现有和新的观众建立联系。CTA在其网站上声称，它将提供大致相当于CES三大支柱的在线服务：主旨笔记和会议、产品展示、会议和网络。\nCES始于1967年，当时互联网通信革命还没有到来，今天它定期吸引来自世界各地的15万多名参会者。作为科技新闻的来源，CES近年来一直在走下坡路，许多主要供应商意识到，他们可以只举办自己的活动，而不是与任何人分享聚光灯。虽然计划中的任何重大公告都可以很容易地通过互联网处理，但更难通过数字方式取代的是参加CES的数千家公司之间发生的数百笔商业交易。一个CES会场可以有来自数百家规模较小、默默无闻的公司的一排接一排的展位，他们在典当自己的商品，希望能与一家大公司达成一笔大交易。要在网上复制这一点将是困难的。\n2020年，大流行几乎取消了所有重大的面对面活动和贸易展，往往取而代之的是一些在线同类活动。移动世界大会、Google I/O、WWDC、日内瓦国际汽车展、E3、F8、PAX East、游戏开发者大会和许多其他会议都因安全问题而关闭。\nCTA誓言将在2022年重返拉斯维加斯，称CES将把实体和数字展览的最佳元素结合在一起。", "note_en": "The Consumer Electronics Show (CES) took place just before the coronavirus hit in early 2020, but that won&#39;t be the case in 2021. Today, the show&#39;s organizer, the Consumer Technology Association (CTA), announced that CES 2021 in Las Vegas  is canceled. The show will become an online-only event.\n CES 2021 was scheduled to take place in early January, but with the  terrible pandemic response in the US, the CTA doesn&#39;t think the country will be ready to host international events by next year. CTA President and CEO Gary Shapiro sent out an email with the now all-too-familiar COVID cancellation language. &#34;Amid the pandemic and growing global health concerns about the spread of COVID-19,&#34; Shapiro wrote, &#34;it&#39;s just not possible to safely convene tens of thousands of people in Las Vegas in early January 2021 to meet and do business in person.”\n Shapiro said CES 2021 is &#34;shifting to an all-digital platform for 2021&#34; and offering &#34;a unique experience that helps our exhibitors connect with existing and new audiences.&#34; On its website, the CTA claims it will offer a rough online equivalent to the three major pillars of CES: &#34;Keynotes and conferences,&#34; &#34;Product showcases,&#34; and &#34;Meetings and networking.&#34;\n CES started in 1967, in a time before the Internet communication revolution, and today it regularly pulls in 150,000+ attendees from around the world. As a source of tech news, CES has been on the decline in recent years, with many major vendors realizing they can just hold their own events and not share the spotlight with anyone. While whatever big announcements were planned can easily be handled over the Internet, what will be much harder to replace digitally are the hundreds of business deals that happen at CES between the thousands of companies that attend. A single CES venue can have row after row of booths from hundreds of smaller, unknown companies hocking their wares and hoping to score a major deal with a bigger company. Replicating that online would be difficult.\n In 2020, the pandemic has canceled just about every major in-person event and trade show, often replacing it with some online equivalent.  Mobile World Congress,  Google I/O,  WWDC, the  Geneva International Motor Show,  E3,  F8,  PAX East, the  Game Developer&#39;s Conference, and many other conventions have all shut down due to safety concerns.\n CTA vows to return to Las Vegas in 2022, saying that CES will combine &#34;the best elements of a physical and digital show.&#34;", "posttime": "2020-07-29 00:17:31", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "活动,vegas,ces", "title": "拉斯维加斯CES 2021取消；活动转移到网上", "title_en": "CES 2021 in Las Vegas is cancelled; event moves online", "transed": 1, "url": "https://arstechnica.com/gadgets/2020/07/ces-2021-in-las-vegas-is-cancelled-event-moves-online/", "via": "", "real_tags": ["活动", "vegas", "ces"]}, {"category": "", "categoryclass": "", "imagename": "34c04033fb1bfd2a2d5946c75f387df4.jpg", "infoid": 1014719, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但今天的更新将集团会议带入了新冠肺炎时代，在这个时代，人们继续分开消费。\n现在，高级用户将能够同时收看相同的播放列表或播客，即使他们不在同一地点。在此之前，用户必须在相同的物理空间中才能使用该功能。它还包括一种条形码，用户可以用自己的设备扫描，以添加到派对播放列表中。\n现在，两到五个人的小组可以通过点击小组会议主持人通过短信应用、短信或社交媒体发送的“加入”链接来加入远程小组会议。该链接可从Spotify应用程序播放屏幕左下角的“连接”菜单访问。从这里，主机向下滚动到“开始群组会话”选项，以获得与朋友或家人共享的链接。\n被邀请的参与者可以像以前一样点击链接或扫描Spotify代码加入会话。\n一旦进入，主人和客人就可以暂停、播放、跳过和选择队列中的曲目，或者添加他们自己的选择。当一个人对组会话进行更改时，它会立即反映在所有参与者的设备上。\n去年，在冠状病毒爆发之前很久，就发现了小组会议正在发展中。它最初被设想为一项功能，可以吸引Spotify更多的社交用户-比如参加派对的人或大学室友-升级到高级订阅，以便加入能够添加和控制共享队列的乐趣。但由于社交疏远措施仍然存在，今天几乎没有人需要派对模式的功能。\n很可能，Spotify发现该功能没有得到充分利用，因为它要求用户面对面在一起，所以将其扩展到包括远程使用。\n在实践中，这意味着许多有时间坐在一起(虚拟地)和朋友一起听音乐的人-通常是免费的年轻人-甚至不能尝试它。相反，群组会话应该允许免费用户参与这些协作播放列表，但程度低于付费订阅者。这将允许Spotify的所有用户尝试添加功能，但仍会向那些认为Group Session功能有用的用户提供升级的推动力。\n该公司甚至可以将小组会议与付费视频广告体验捆绑在一起，允许用户在第一次查看赞助商的消息后，在有限的一段时间内参与。\nGroup session选项仍处于公开测试版，这意味着它仍在测试和开发中。Spotify表示，该功能目前已在全球范围内向所有高级用户开放。", "note_en": "But today’s update brings Group Session into the COVID-19 era where people continue to spend apart.\n Now, Premium users will be able to tune into the same playlist or podcast together at the same time, even if they’re not in the same place. Before, users would have to be in the same physical space for the feature to work. It had also involved a barcode users would scan with their own device to add to the party playlist.\n  Now, groups of two to five people can join a remote Group Session by clicking on a “join” link sent out via messaging apps, SMS, or social media from the Group Session’s host. This link is accessed from the “Connect” menu in the bottom-left corner of the play screen in the Spotify app. From here, the host scrolls down to the option “Start a Group Session” to get the link to share with friends or family.\n Invited participants can click the link or scan the Spotify code, as before, to join in the session.\n Once in, hosts and guests can pause, play, skip and select tracks on the queue or add in their own choices. As one person makes a change to the Group Session, it’s immediately reflected on all participant’s devices.\n Group Session had been  spotted  in development last year, well before the coronavirus outbreak arrived. It was originally envisioned as a feature that could tempt Spotify’s more social users – like party-goers or college roommates, for example — to upgrade to a Premium subscription in order to join in the fun of being able to add to and control the shared queue. But with social distancing measures still in place, few people have need for a party mode feature today.\n Likely, Spotify saw the feature was under-utilized due to its requirement for users to be together in person, so expanded it to include remote usage.\n  In practice, that means many of the people who have time to sit around and (virtually) hang out with friends listening to music — often, young people on free accounts — can’t even try it. Instead, Group Session should allow free users the ability to participate on these collaborative playlists, but to a lesser extent than paid subscribers. That would allow all of Spotify’s users to try out the addition, but still deliver a push to upgrade to those who found the Group Session feature useful.\n The company could even tie the Group Session to a paid video ad experience that allowed users to participate for a limited period of time, after first viewing a sponsor’s message.\n The Group Session option continues to be in public beta, which means it’s still being tested and developed. Spotify says the feature is available globally to all Premium users today.", "posttime": "2020-07-29 00:16:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "新派,party", "title": "\nSpotify的新派对模式功能“Group Session”可以远程操作", "title_en": "\n\t\t\t\tSpotify’s new party mode feature, ‘Group Session,’ goes remote\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/28/spotifys-new-party-mode-feature-group-session-goes-remote/", "via": "", "real_tags": ["新派", "party"]}, {"category": "", "categoryclass": "", "imagename": "dbaa2acd91ea0f869e9aeeae7367c21d.jpg", "infoid": 1014718, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub产品高级副总裁Shanku Niyogi告诉我：“我们试图做的是为人们提供一种方式，让他们看到即将发生的事情，加入对话，给我们反馈，并能够与我们合作。”\n他还指出，随着公司企业业务的增长，客户能够为即将到来的事情做好准备的需求也有所增加。到目前为止，GitHub经常直接向一些较大的客户提供这些信息(通过好的旧幻灯片)，但现在所有人都可以获得同样的信息。对Niyogi来说，这本质上是关于“构建GitHub的方式更像人们已经在GitHub上构建软件的方式”。\n因此，毫不奇怪，路线图位于GitHub回购中。一切都将根据功能、影响的产品和开发阶段进行标记。随着时间的推移，GitHub计划将更多的人工制品附加到每一个项目上，例如，包括屏幕截图。\n例如，该公司还在使用自己的产品，通过GitHub最近推出的讨论功能给用户提供反馈。\n在目前的迭代中，路线图看起来大约提前了一年。Niyogi说：“我们不一定要在这里抛出我们展望未来五、六年的东西。”“但随着事情开始进入我们的地平线，我们会做到这一点的。就像软件开发一样，你总是可以期待变化，所以我们希望对此感到舒服。“", "note_en": "“What we’re trying to do is provide a way for people to see what’s coming, join in that dialogue and give us feedback and be able to collaborate with us,” GitHub’s SVP of Product Shanku Niyogi told me.\n He also noted that as the company’s enterprise business has grown, the need for customers to be able to prepare for what’s coming next has also increased. Until now, GitHub often provided this information to some of its larger customers directly (through good old slide decks), but that same information will now be available to all. To Niyogi, this is essentially about “building GitHub more the way that people build software on GitHub already.”\n   Unsurprisingly then, the roadmap lives in a GitHub repo. Everything will be tagged based on the feature, the product it affects and its development stage. Over time, GitHub plans to attach more artifacts to every item, including screenshots, for example.\n The company is also using its own product to give users the ability to give feedback through GitHub’s recently launched  Discussions feature, for example.\n  In its current iteration, the roadmap looks about a year ahead. “We’re not going to necessarily go throw things on here that we’re looking at five, six years ahead,” Niyogi said. “But as things start to kind of get into that horizon for us, we’ll have that. As happens with software development, you can always expect changes, so we want to be comfortable with that.”", "posttime": "2020-07-29 00:16:36", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,github,starts", "title": "\nGitHub开始发布公共路线图", "title_en": "\n\t\t\t\tGitHub starts publishing a public roadmap\t\t\t", "transed": 1, "url": "https://techcrunch.com/2020/07/28/github-starts-publishing-a-public-roadmap/", "via": "", "real_tags": ["发布", "github", "starts"]}, {"category": "", "categoryclass": "", "imagename": "da99ae1b76a35a2347cd7cea88f4410f.jpg", "infoid": 1014717, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CES技术贸易展将于2021年1月成为纯数字活动，这是50多年来的第一次。该活动是拉斯维加斯活动日历上今年的第一个重大活动，也是这座内华达州城市经济的一棵巨大的摇钱树。\n举办这次活动的消费者技术协会(CTA)今天宣布，原定于202年1月6日至9日举行的CES2021将完全在线。\n随着疫情的蔓延和全球对新冠肺炎传播的担忧与日俱增，在2021年1月初安全地召集数以万计的人在拉斯维加斯会面并亲自开展业务是不可能的，“美国旅游协会主席兼首席执行官加里·夏皮罗(Gary Shapiro)说。\nCTA在6月份改变了策略，表示CES将在2021年继续进行，尽管有一些更新的协议。这就是国际足联在柏林采取的做法，而且在很大程度上受到了抨击。一些人猜测，在一些与会者在社交媒体上报告他们在活动后患了重病后，CES2020可能无意中帮助了新冠肺炎在美国的早期传播。\n2021年秋季的第一个活动-CES 2020被证明是冠状病毒大流行席卷全球之前最后几个面对面的大型活动之一，迫使活动组织者搁置了今年所有其他重大会议。随着北半球进入秋季和冬季，预计第二波感染将席卷北半球的大部分地区(特别是在美国，在一些地区，戴口罩等简单的预防措施仍然存在争议)，取消CES 2021可能是一种趋势的开始。\n面对面活动仍然占有一席之地--近几个月来，网上已经出现了各种各样的活动、产品发布会和相关的技术活动，虽然面对面活动足以向媒体或感兴趣的消费者传达关键信息，但它们无法与面对面活动提供的人脉机会和实践机会相匹敌。仅限在线的活动也不太可能产生面对面活动那样的报道或炒作。尝试一辆水下滑板车，或者关注汽车制造商最新的车辆，或者制造自己的振动器，这些都是记者想要写的经历，也是观众想要读到的。我们期待着这些事情再次成为可能的日子。\nCTA在声明中表示，我们计划回到拉斯维加斯参加2022年国际消费电子展(CES2022)，将实体和数字展览的最佳元素结合在一起。让我们希望它是对的。", "note_en": "For the first time in more than 50 years, the CES technology tradeshow will be a digital-only event in January 2021. The event is the first big event of the year for the Las Vegas events calendar, and a huge cash cow for the Nevada city&#39;s economy.\n The Consumer Technology Association (CTA), which runs the event, today announced CES 2021 which was scheduled for January 6–9, 202, will be completely online.\n &#34;Amid the pandemic and growing global health concerns about the spread of COVID-19, it&#39;s just not possible to safely convene tens of thousands of people in Las Vegas in early January 2021 to meet and do business in person,” said Gary Shapiro, CTA president and CEO.\n Changing tack — Back in June, the CTA said CES  would go ahead in 2021, albeit with some updated protocols. That&#39;s the approach IFA in Berlin has gone for, and largely  been lambasted over. Some speculate that CES 2020 may have  inadvertently aided the early spread of COVID-19 in the U.S. after a number of attendees took to social media to report they got seriously ill after the event.\n The first of the 2021 events to fall — CES 2020 turned out to be one of the last big in-person events to happen before the coronavirus pandemic swept the globe and forced event organizers to shelve every other major conference of the year. With the second wave of infections expected to grip much of the northern hemisphere as it enters fall and winter (especially in the U.S., where simple preventative measures like wearing masks remain contentious in some regions), the cancelation of CES 2021 might be the beginning of a trend.\n  In-person events still have a place — Various events, product launches, and related tech events have happened online in recent months, and while they&#39;re enough to communicate key information to the media or interested consumers, they&#39;re no match for the networking opportunities and hands-on opportunities that in-person events offer. Online-only events are also less likely to generate the sort of coverage or hype that in-person ones do. Getting to try an  underwater scooter, or ogle  automakers&#39; latest vehicles, or  build your own vibrator are all experiences journalists want to write about, and audiences want to read about. We look forward to the days where those things are possible again.\n &#34;We plan to return to Las Vegas for CES 2022, combining the best elements of a physical and digital show,&#34; the CTA says in its statement. Let&#39;s hope it&#39;s right.", "posttime": "2020-07-29 00:15:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "进入,senses,活动", "title": "CES进入感官阶段，2021年将实现全数字化", "title_en": "CES Comes To Its Senses and Will Go All-Digital For 2021", "transed": 1, "url": "https://www.inputmag.com/culture/ces-is-seeing-sense-going-all-digital-for-2021", "via": "", "real_tags": ["进入", "senses", "活动"]}, {"category": "", "categoryclass": "", "imagename": "1eacd64ef0179757ad9bedc6ace5e80d.gif", "infoid": 1014716, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "社会距离可能是疾病控制和预防中心为抗击新冠肺炎大流行而制定的最突出的指导方针之一。因此，当公司希望重新开放他们的办公室和大楼时，限制房间里的人数是关键。\n这就是Density的技术--一种匿名统计人口的工具--的用武之地。\n该公司最近完成了由凯鹏华盈(Kleiner Perkins)牵头的5100万美元的C系列融资。该公司背后的想法是，如果企业和组织知道大楼里有多少人，以及空间是如何使用的，他们就可以更高效地使用它，而不是浪费空间。\n“团队有一个想法，如果你知道一座建筑是如何使用的，一座城市是如何使用的，你会以不同的方式建造吗？”Density首席营销官亚历克斯·斯特鲁布(Aleks Strub)在接受Crunchbase新闻采访时说。\n现在，随着新冠肺炎的大流行，知道一个地方有多少人比以往任何时候都更重要，但原因完全不同。\n斯特鲁布说：“我们不相信未来人类不知道(如何)测量空间，我们只是认为大流行只是加速了时间线。”\nDensity的技术在设计上是匿名的。根据Strub的说法，传感器穿过门口，使用激光来测量头部模式，作为一个网络来告诉人们一个房间里有多少人。最近，该公司推出了按密度安全的实时入住系统。\n据Strub称，现在许多地方都在重新开放或探索如何安全重新开放，Density已经看到不同行业的企业对该公司及其产品表示了兴趣。以前，Density的许多客户将其产品用于办公场所、礼拜场所或酒店业的区域(想想达美航空的机场休息室)。\n但现在，公司正在购买这种产品，用于肉类加工设施、仓库和赌场等场所。一些高等教育机构在大流行前是顾客，但随着学院和大学想办法安全地重新开放并限制学生进入食堂和图书馆等区域，需求大幅增加。\n新的资金将用于扩大公司的运营、销售团队，并在产品和工程方面加倍投入。\n斯特鲁布说，该公司去年季度环比增长30%，但在新冠肺炎上任后的前75天里，业务量比去年全年还要多。以Pinterest、Hello Fresh和纽约大学(New York University)为客户的Density不得不将其锡拉丘兹工厂的生产量增加了90%。\nDensity上一次通过B系列融资是在2018年6月，现在总共有7400万美元的资金。据该公司称，C系列融资的其他投资者包括01 Advisors、预付风险投资公司、Ludlow Ventures、LPC Ventures、Launch、Founders Fund、Greenoaks Capital、DTA(与亚历克斯·罗德里格斯共同参与)、Cyan和Scott Banister，以及Julia和Kevin Hartz。", "note_en": "Social distancing is perhaps one of the most prominent guidelines from the  Centers for Disease Control and Prevention to combat the COVID-19 pandemic. So when companies look to reopen their offices and buildings, limiting the number of people in a room is key.\n That’s where  Density‘s technology, a tool to anonymously count people, comes in.\n  The company recently closed a $51 million Series C round led by  Kleiner Perkins. The idea behind the company is that if businesses and organizations know how many people are in the building and how the space is being used, they can be more efficient with it and not waste space.\n “The team had a thought that if you knew how a building was used, how a city was used, would you build that differently?” Density chief marketing officer Aleks Strub said in an interview with Crunchbase News.\n Now, with the COVID-19 pandemic, knowing how many people are in a location is more important than ever, but for a whole other set of reasons.\n “We don’t believe there’s a future where humans don’t figure out (how) they measure space, we just think the pandemic just accelerated the timeline,” Strub said.\n Density’s technology is anonymous by design. The sensors go over doorways and use lasers to measure head patterns, acting as a network to tell how many people are in a room, according to Strub. Most recently, the company rolled out its real-time occupancy system, Safe by Density.\n Now that many places are reopening or exploring how to safely reopen, Density has seen businesses across industries express interest in the company and its products, according to Strub. Before, many of Density’s customers used its products for office spaces, places of worship, or areas in the hospitality industry (think  Delta’s airport lounge).\n But now companies are buying the product for spaces like meatpacking facilities, warehouses and casinos. Some higher-education institutions were customers pre-pandemic, but demand has increased significantly as colleges and universities figure out how to safely reopen and limit students in areas such as dining halls and libraries.\n The new funding will be used to expand the company’s operations, sales team and double down on product and engineering.\n The company was growing 30 percent quarter over quarter last year, but did more business in the first 75 days after COVID-19 took hold than it did in all of last year, Strub said. Density, which counts  Pinterest,  Hello Fresh and  New York University as customers,  had to increase its production volume out of its Syracuse facility by 90 percent.\n Density last raised money with its  Series B in June 2018, and now has a total of $74 million in funding. Additional investors in the Series C round include  01 Advisors,  Upfront Ventures,  Ludlow Ventures, LPC Ventures,  Launch,  Founders Fund,  Greenoaks Capital,  DTA (in participation with Alex Rodriguez), Cyan and Scott Banister, and Julia and Kevin Hartz, according to the company.", "posttime": "2020-07-29 00:08:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "办公室,startup", "title": "提供匿名计数技术的企业初创公司Density筹集了5100万美元的C系列资金，由凯鹏华盈(Kleiner Perkins)牵头，目标是重新开放办公室，保持社交距离", "title_en": "Enterprise startup Density, offering anonymous people-counting tech, raises $51M Series C led by Kleiner Perkins as offices aim to reopen with social distancing", "transed": 1, "url": "https://news.crunchbase.com/news/density-raises-51m-to-help-count-employees-in-offices/", "via": "", "real_tags": ["办公室", "startup"]}, {"category": "", "categoryclass": "", "imagename": "c4e4f4e97fcaad999be731eae74eebfe.jpg", "infoid": 1014715, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "狂欢暂停了在纽约市的服务，此前一名男子在皇后区骑着一辆共享电动轻便摩托车被杀，这使他成为最近几周第二名在使用这项服务时死亡的顾客。\n据“纽约邮报”报道，美国东部时间周二凌晨3点15分，32岁的杰里米·马拉夫(Jeremy Malave)在中村伍德海文大道(Woodaven Boulevard)向北行驶时，失去了对Revel轻便摩托车的控制，撞上了中间地带的路灯，然后被扔出了车外。他在现场被警方发现，头部严重受伤，并被送往北岸森林山医院，在那里他被宣布死亡。目前还不清楚他是否戴着由Revel提供的头盔。\n哥伦比亚广播公司新闻记者尼娜·卡普尔作为乘客乘坐一辆Revel轻便摩托车时死亡。\n本月早些时候，哥伦比亚广播公司(CBS)新闻记者尼娜·卡普尔(Nina Kapur)，26岁，作为乘客乘坐一辆Revel轻便摩托车时死亡。警方表示，这名骑轻便摩托车的司机转向是因为他认为有一辆车正从一个地方驶出，他试图避开它。警方表示，卡普尔没有按照公司的要求戴头盔。第二天，一名38岁的男子在皇后区骑着一辆Revel滑板车时头部受伤严重。\n周二，Revel表示将暂停在纽约市的服务，“直到另行通知”，同时评估其电动轻便摩托车车队的安全性。该公司还在迈阿密奥斯汀和华盛顿特区开展业务，最近宣布计划很快在旧金山推出。Revel的一位发言人拒绝回应有关该公司将审查哪些安全措施，或者是否会暂停在其他城市的服务的问题。该公司表示：“目前，我们不会对此事发表任何进一步的评论。”\n纽约乘客-从今天开始，纽约市的服务将被关闭，直到另行通知。我们正在审查和加强我们的乘客责任和安全措施，并与市政府官员进行沟通，我们期待着在不久的将来再次为您服务。\n-Revel(@_GoRevel)2020年7月28日。\n自2018年在纽约市首次推出以来，事实证明，这家轻便摩托车公司非常受欢迎。从那时起，该公司的乘客人数已经增长到30万人。这些客户已经乘坐了300万次Revel的轻便摩托车，总里程为1000万英里。这项服务今年变得更加受欢迎，冠状病毒大流行阻止了许多人使用地铁和公交车，并寻求替代的交通方式。\n注册这项基于应用的服务需要19美元。点击地图上的滑板车预订(最多提前15分钟)或立即预订。每次骑行的起步费是1美元(如果有人跟着你的话是2美元)，然后是每分钟0.25美元。每辆摩托车还配备了两个头盔，一个大，一个小，锁在后面的货舱里。\n但该公司也受到了一些严格的审查。据NY1报道，该公司已经受到至少12起诉讼的打击，这些诉讼声称其轻便摩托车服务质量差，骑起来很危险。狂欢声称，其所有的轻便摩托车在被允许上路之前都要经过训练有素的机械师的检查。周一，曼哈顿民主党众议员阿德里亚诺·埃斯帕亚特(Adriano Espaillat)呼吁纽约市政府关闭这项服务。\n卡普尔去世后，哥伦比亚广播公司(CBS)今天上午播出了一则故事，展示了Revel客户在拥挤的人行道上骑着摩托车、闯红灯或从事其他危险行为时滥用公司摩托车的镜头。\n当人们在#冠状病毒期间寻找私人交通方式时，轻便摩托车在全国各地如雨后春笋般涌现。“但是它们安全吗？”krisvancLeave介绍了围绕Revel轻便摩托车的安全问题，以及骑手们需要知道的事情。Pic.twitter.com/UWh0r0jPWJ。\n-CBS今晨(@CBSThisMorning)2020年7月28日。\n该公司回应称，其轻便摩托车的速度上限为每小时30英里，客户必须持有有效的驾照(但值得注意的是，不是摩托车驾照)才能骑行。轻便摩托车仅限于当地街道，不允许在人行道、高速公路或桥梁上行驶。狂欢用户应该在应用程序中观看一段简短的教学视频。他们还可以选择参加30分钟的面授课程。雷韦尔在给CBS的一份声明中说：“我们非常认真地对待违反安全规定的报告，我们与市政府官员密切合作，解决任何违反规定的问题。”\n该公司还使用GPS技术跟踪其轻便摩托车，并将被发现违反规则的客户停职。本月早些时候，Revel因违反安全规定暂停了1000多名客户的职务。\n据《纽约时报》报道，在周二的新闻发布会上，纽约市市长白思豪称雷韦尔的安全措施“不能令人满意，令人无法接受”。尽管如此，该公司暂停服务的决定是它自己的决定，而不是城市秩序的结果。\n白思豪表示，@_GoRevel关闭的决定是正确的。不幸的是，这已经被证明是不安全的。&#34；表示，除非确信它可以安全地进行，否则该市不会允许它重新开放。\n-Erin Durkin(@erinmdurkin)2020年7月28日。\n目前还不清楚瑞威尔的未来是什么。它现在面临的许多问题也是共享电动滑板车行业的同行面临的。像Bird和Lime这样的滑板车初创公司受到了数十起指控违反安全规定的诉讼。随着骑滑板车受伤或死亡的人数不断增加，有许多人预测共享滑板车即将消亡。然而，共享滑板车仍然存在，并仍被美国、亚洲和欧洲各地的数千名客户骑着。", "note_en": "Revel is suspending its service in New York City after a man was killed riding one of the shared electric mopeds in Queens, making him the second customer to die while using the service in recent weeks.\n According to the  New York Post, Jeremy Malave, 32, was heading north on Woodhaven Boulevard in Middle Village at 3:15AM ET on Tuesday when he lost control of the Revel moped, slammed into a streetlight on a median, and was thrown from the vehicle. He was found by police at the scene with severe head trauma and was transported to North Shore Forest Hills Hospital where he was pronounced dead. It was unclear whether he was wearing a helmet, which is provided by Revel.\n CBS News reporter Nina Kapur died while riding as a passenger on a Revel moped\n Earlier this month,  CBS News reporter Nina Kapur, 26, died while riding as a passenger on a Revel moped. Police say the moped driver swerved because he believed a car was pulling out of a spot and he was trying to avoid it. Police said Kapur was not wearing a helmet, as required by the company. The next day, a 38-year-old man was  critically injured with head trauma while riding a Revel scooter in Queens.\n On Tuesday, Revel said it would pause its service in New York City “until further notice” while it assesses the safety of its fleet of electric mopeds. The company also operates in Austin, Miami, and Washington, DC, and it recently announced plans to launch soon in San Francisco. A spokesperson for Revel declined to respond to questions about which safety measures the company would be reviewing, or whether it would be suspending service in other cities. “At this time, we will not be providing any further comments on this matter,” the company said.\n New York riders - starting today, NYC service will be shut down until further notice. We’re reviewing and strengthening our rider accountability and safety measures and communicating with city officials, and we look forward to serving you again in the near future.\n— Revel (@_GoRevel)  July 28, 2020\n The moped company has proven to be  enormously popular since first launching in New York City in 2018. Since then, the company has seen its ridership grow to 300,000 people. Those customers have taken 3 million rides on Revel’s mopeds for a total of 10 million miles. The service has grown even more popular this year, with the coronavirus pandemic deterring many people from using subways and buses and seeking alternative modes of getting transportation.\n It costs $19 to sign up for the app-based service. Tap a scooter on the map to reserve it (up to 15 minutes ahead of time) or book it right away. Each ride costs $1 to start ($2 if you have someone tagging along with you) and then $0.25 per minute. Each motor scooter also comes with two helmets, one big and one small, which are locked away in a cargo compartment at the back.\n  But the company has also drawn some harsh scrutiny. The company has been hit by at least a dozen lawsuits alleging that its mopeds are poorly serviced and dangerous to ride,  according to  NY1. Revel claims that all of its mopeds are inspected by trained mechanics before they are allowed on the road. On Monday,  Rep. Adriano Espaillat, a Manhattan Democrat, called on New York City’s government to shut down the service.\n Following Kapur’s death,  CBS This Morning broadcast a story showcasing footage of Revel customers misusing the company’s scooters by riding down crowded sidewalks, running red lights, or engaging in other dangerous behavior.\n As people look for a private mode of transportation during the  #coronavirus, mopeds are popping up around the nation. But are they safe? @krisvancleave looks at the safety concerns surrounding Revel mopeds and what riders need to know.  pic.twitter.com/UWh0r0jPWJ\n— CBS This Morning (@CBSThisMorning)  July 28, 2020\n The company responded by noting that its mopeds are speed-capped at 30 mph, and customers are required to have valid drivers’ licenses (but notably, not motorcycle licenses) to ride. The mopeds are confined to local streets and are not allowed on sidewalks, highways, or bridges. Revel users are supposed to watch a short instructional video in the app. They also have the option of taking a 30-minute, in-person lesson. “We take reports of safety violations very seriously, and we work closely with city officials to address any violations,”  Revel said in a statement to CBS.\n The company also tracks its mopeds using GPS technology and suspends customers caught breaking its rules. Earlier this month,  Revel suspended over 1,000 customers for safety violations.\n At a press conference on Tuesday, New York City Mayor Bill de Blasio called Revel’s approach to safety “unsatisfactory and unacceptable,”  according to  The  New York Times . Still, the company’s decision to suspend service was its own, not a result of a city order.\n De Blasio says  @_GoRevel decision to shut down was the right thing to do. &#34;Unfortunately this has been proven to be not safe.&#34; Says the city won&#39;t allow it to reopen unless convinced it can be done safely.\n— Erin Durkin (@erinmdurkin)  July 28, 2020\n It’s unclear what the future has in store for Revel. Many of the problems it is now facing were also faced by its counterparts in the shared electric scooter industry. Scooter startups like Bird and Lime were hit with dozens of lawsuits alleging safety infractions. And as the number of people injured or killed while riding scooters mounted, there were many predictions made about the imminent demise of scooter sharing. Yet, shared scooters are still around and still being ridden by thousands of customers all over the US, Asia, and Europe.", "posttime": "2020-07-29 00:08:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "撞车,helmet,摩托车", "title": "最近几周，在两人死亡后，狂欢暂停了在纽约市的电动轻便摩托车服务；至少有一人在撞车时没有戴头盔。", "title_en": "Revel suspends its electric moped service in NYC after two people were killed in recent weeks; at least one was not wearing a helmet during the crash", "transed": 1, "url": "https://www.theverge.com/2020/7/28/21344993/revel-suspends-electric-moped-nyc-people-killed?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["撞车", "helmet", "摩托车"]}, {"category": "", "categoryclass": "", "imagename": "b04f38326cbfd89df3f0f0c04251114d.jpg", "infoid": 1014714, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Spotify现在允许付费用户与朋友和家人同时收听音乐和播客，即使他们不在同一地点。通过其名为Group Session的测试版功能，任何高级用户都可以与最多五个朋友生成一个可共享的链接，这些朋友也有Spotify Premium，这将允许他们同时流媒体内容。\n流送方中的任何人都可以暂停、播放、跳过或选择队列中的曲目，他们也可以添加自己的选择。没有聊天功能，这意味着听众将不得不依赖第三方应用程序来与朋友讨论播客或音乐。要主持会话，高级用户可以选择其播放屏幕左下角的连接菜单，然后向下滚动到“开始群组会话”。一旦点击，他们将收到一个可共享的链接，他们可以通过社交媒体或消息发送。Spotify指出，这一功能仍处于测试阶段，但该公司表示，计划随着时间的推移“发展”这一功能。\nGroup Sessions于5月份首次推出，作为举办面对面派对的工具。主持人可以共享他们的客人扫描以加入派对的Spotify代码。多年来，该公司一直在构建其高级用户功能，试图鼓励他们订阅。它允许他们从播放列表中隐藏歌曲，之前还向订阅者提供了Hulu和Google Home。这只是另一个要添加到列表中的，可能还会有更多的添加到列表中。", "note_en": "Spotify is  now allowing its paying users to listen to music and podcasts with friends and family at the same time, even if they aren’t in the same location. Through its beta feature called Group Session, any premium user can generate a shareable link with up to five friends, who also have Spotify Premium, that’ll allow them to simultaneously stream content.\n Any person in the streaming party can pause, play, skip, or select tracks in the queue, and they can add their own choices, too. There’s no chat feature, which means listeners will have to rely on a third-party app to discuss the podcast or music with their friends. To host a session, premium users can select the Connect menu in the bottom left-hand corner of their play screen and scroll down to “Start a group session.” Once tapped, they’ll receive a shareable link they can send over social media or messaging. The feature is still in beta, Spotify notes, but the company says it plans to “evolve” it over time.\n Group Sessions  first launched in May as a tool for hosting in-person parties. Hosts can share a Spotify Code that their guests scan to join the party. The company has been building its premium user features for years in an attempt to encourage them to subscribe. It allows them to  hide songs from playlists and has previously  offered Hulu and  a Google Home to subscribers. This is just one more to add to the list with likely more to come.", "posttime": "2020-07-29 00:08:05", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "远程,debuts,功能", "title": "Spotify首次推出测试版的群组会话功能，最多可让5名高级用户同时远程收听相同的内容", "title_en": "Spotify debuts a Group Session feature in beta, letting up to five premium users simultaneously listen to the same content remotely", "transed": 1, "url": "https://www.theverge.com/2020/7/28/21344926/spotify-premium-group-session-stream-together?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["远程", "debuts", "功能"]}, {"category": "", "categoryclass": "", "imagename": "6649e79ebb6371356cc1eea11bf5633a.gif", "infoid": 1014713, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "随着共享内存的回归，火狐的新稳定版本为七月画上了句号！Firefox79还提供了一种新的承诺方法、更安全的target=_空白链接、逻辑赋值运算符和其他web开发人员感兴趣的更新。\n这篇博客文章只提供了一组亮点；有关所有细节，请查看以下内容：\n现代JavaScript依赖于承诺、异步/等待、事件和超时来编排代码、库和浏览器之间的复杂调度。然而，调试异步代码以理解控制和数据流可能是具有挑战性的。随着时间的推移，运营会被打破。异步堆栈跟踪通过将堆栈的实时同步部分与捕获的异步部分相结合来解决此问题。\n现在，您可以在Firefox JavaScript调试器的调用堆栈、控制台错误和网络启动器中享受详细的异步执行链。\n为此，JavaScript引擎在分配承诺或开始某些异步操作时捕获堆栈。则将捕获的堆栈附加到任何捕获的新堆栈。\n失败的服务器请求可能会导致一系列错误。以前，您必须在控制台和网络面板之间切换才能进行调试，或者在控制台中启用XHR/Requests过滤器。在Firefox79中，默认情况下，控制台使用4xx/5xx错误状态码显示网络请求。此外，还可以扩展请求/响应详细信息，以检查完整的详细信息。这些也可以在网络检查器中找到。\n提示：要进一步调试、重试或验证服务器端更改，请使用“Resend Request”上下文菜单选项。它在控制台和网络面板中都可用。您可以使用相同的参数和头部发送新请求。附加的“编辑并重新发送”选项仅在“网络”面板中可用。它在发送请求之前打开一个编辑器来调整请求。\n许多调试会话都是从记录的JavaScript错误跳到调试器开始的。为简化此流程，现在在调试器中的相应源代码位置突出显示错误。此外，在代码上下文中的悬停和暂停变量状态中会显示相关详细信息。\n我们要感谢核心贡献者StepanStava，他已经在构建此功能，进一步模糊了日志记录和调试之间的界限。\n从调试器重新启动帧时，调用堆栈将执行指针移动到函数的顶部。需要注意的是，变量的状态不会重置，这允许在当前调用堆栈中进行时间旅行。\n“重新启动框架”现在作为调试器调用堆栈中的上下文菜单选项可用。同样，我们要感谢StepanStava的添加，调试器用户可以从Chrome和VS Code中认出这一点。\n此版本中的性能改进加快了调试速度，对于包含大文件的项目尤其如此。我们还修复了一个影响计算繁重的代码模式的瓶颈，现在可以正常工作了。\n我们改进了所有面板上的源代码映射处理，现在可以更可靠地从Inspector打开SCSS和CSS-in-JS源代码。您可以从检验器侧面板中的规则定义快速跳转到样式编辑器中的原始文件。\n现在，可访问性检查器在浏览器上下文菜单中始终可用。允许您直接在辅助功能面板中打开元素，以检查ARIA属性并运行审核。\n现在，“网络”面板中的“禁用缓存”选项也会停用CORS印前检查请求缓存。这样可以更轻松地迭代您的网络安全设置。\n贡献者KC将控制台中显示的阻塞请求的样式与其在Network面板中的外观一致。\nRichard Sherman扩展了工具提示的范围，现在工具提示描述了控制台和调试器中预览的对象值的类型和值。\n为了整合侧边栏标签，Farooq AR将Network的WebSocket“Messages”标签移到了“Response”标签中。\n调试器对“Blackbox”的引用被重命名为“Ignore”，以使措辞与其他工具保持一致，并使其更具包容性。也感谢理查德·谢尔曼的这次更新！\n为了防止DOM属性window.opener被不受信任的第三方站点滥用，Firefox79现在自动为所有包含target=_blank的链接设置rel=noopener。以前，您必须手动设置rel=noopener，以使每个使用target=_Blank的链接的window.opener=null。如果需要window.opener，可以使用rel=opener显式启用它。\n2018年初，根据Spectre，共享内存和高分辨率计时器实际上被禁用了。在2020年，一种新的、更安全的方法已经标准化，以重新启用共享内存。作为基准要求，您的文档需要在安全的上下文中。对于顶级文档，您必须设置两个标题才能跨区域隔离您的文档：\n要检查跨域隔离是否成功，可以针对窗口和辅助上下文可用的CrossOriginIsolated属性进行测试：\n新的Promise.any()方法接受Promise对象的可迭代，一旦可迭代履行中的一个Promise实现，就返回单个Promise解析到该Promise的值。从本质上讲，此方法与Promise.all()相反。此外，Promise.any()不同于Promise.race()。重要的是承诺兑现的顺序，而不是承诺首先解决的顺序。\n如果所有给出的承诺都被拒绝，则会返回一个名为AggregateError的新错误类。此外，它还说明了拒绝的原因。\nConst Promise1=Promise.Reject(0)；Const Promise2=New Promise((Resolve)=&gt；setTimeout(Resolve，100；#39；Quick&39；))；Const Promise3=New Promise((Resolve)=&gt；setTimeout(Resolve，500，#39；Slow&39；))；Const Promise2=[Promise1，Promise2，Promise3]；Promise.any(Promises)。然后((。\nJavaScript已经支持各种赋值操作符。逻辑赋值运算符建议指定了现在Firefox中默认启用的三个新逻辑运算符：\n这些新的逻辑赋值运算符具有与现有逻辑运算已经实现的相同的短路行为。仅当逻辑运算对右侧求值时，才会进行赋值。\n例如，如果“lyrics”元素为空，则将innerHTML设置为默认值：\n这里短路特别有利，因为元件不会进行不必要的更新。此外，它不会导致不想要的副作用，例如额外的解析或呈现工作，或者失去焦点。\n在JavaScript中，对对象的引用通常是强引用。因此，只要您有一个对对象的引用，它就不会被垃圾收集。随着ES2015中添加了WeakMap和WeakSet，这种情况发生了变化。然而，从那时起，JavaScript就没有为弱保留的引用提供更高级的API。WeakRef提案添加了此功能。现在Firefox支持WeakRef和FinalizationRegistry对象。\n请跳转到MDN文档，例如WeakRef的用法。垃圾收集器很复杂，因此在使用WeakRef之前，请确保您也阅读了此注意事项。\n首先，为大容量内存操作提供了七个新的内置操作。例如，复制和初始化允许WebAssembly以更高效、更高效的方式对memcpy和memmove等本机函数进行建模。\n现在支持引用类型建议。它提供了一个新类型External Ref，该类型可以保存任何JavaScript值，例如字符串、DOM引用或对象。Wasm-bindgen文档包括如何利用来自Rust的外部引用的指导。\n随着SharedArrayBuffer对象的返回，我们现在也能够支持WebAssembly线程。因此，现在可以在独立的Web Worker中运行的多个WebAssembly实例之间共享WebAssembly内存对象。结果如何？工作人员之间的通信速度非常快，Web应用程序的性能也大幅提升。\n从Firefox79开始，标签管理扩展的开发者可以提高用户切换标签时的感知性能。新的tab.warmup()函数将准备要显示的选项卡。开发人员可以在预期切换制表符时使用此功能，例如，当将鼠标悬停在按钮或链接上时。\n如果您是一名扩展开发人员，并且您的扩展跨多个设备同步项目，请注意我们将storage.sync区域移植到了基于Rust的实现。当安装的扩展首次尝试访问Firefox79中的storage.sync数据时，本地存储在现有配置文件中的扩展数据将自动迁移。作为快速说明，新实现强制实施客户端配额限制。您应该估计扩展模块在本地存储的数据量，并在超出数据限制后测试扩展模块的行为。请查看此帖子，了解有关此更改的测试说明和更多信息。\n有关Firefox79中WebExtensions API的更多更新，请查看附加组件博客！\n一如既往，您可以随时分享建设性的反馈，并在评论中提出问题。感谢您让您的Firefox保持最新！", "note_en": "A new stable version of Firefox brings July to a close with the return of shared memory! Firefox 79 also offers a new Promise method, more secure  target=_blank links, logical assignment operators, and other updates of interest to web developers.\n This blog post provides merely a set of highlights; for all the details, check out the following:\n      Modern JavaScript depends on promises, async/await, events, and timeouts to orchestrate complex scheduling between your code, libraries, and the browser. And yet, it can be challenging to debug async code to understand control and data flow. Operations are broken up over time. Async stack traces solve this by combining the live synchronous part of the stack with the part that is captured and asynchronous.\n Now you can enjoy detailed async execution chains in the Firefox JavaScript Debugger’s call stack, Console errors, and Network initiators.\n  To make this work, the JavaScript engine captures the stack when a promise is allocated or when some async operation begins. Then the captured stack is appended to any new stacks captured.\n  Failing server requests can lead to a cascade of errors. Previously, you had to switch between the Console and Network panels to debug, or enable the  XHR/Requests filters in the Console. With Firefox 79, the Console shows network requests with 4xx/5xx error status codes by default. In addition, the request/response details can be expanded to inspect the full details. These are also available in the Network Inspector.\n  Tip: To further debug, retry, or verify server-side changes, use the “Resend Request” context-menu option. It’s available in both the Console and Network panels. You can send a new request with the same parameters and headers. The additional “Edit and Resend” option is only available in the Network panel. It opens an editor to tweak the request before sending it.\n  Many debugging sessions start by jumping from a logged JavaScript error to the Debugger. To make this flow easier, errors are now highlighted in their corresponding source location in the Debugger. Furthermore, relevant details are shown on hover, in the context of the code, and paused variable state.\n  We’d like to say thanks to core contributor  Stepan Stava, who is already building this feature out, further blurring the line between logging and debugging.\n  When you restart frames from the Debugger, the call stack moves the execution pointer to the top of the function. With the caveat that the state of variables is not reset, this allows time-traveling within the current call stack.\n  “Restart Frame” is now available as a context-menu option in the Debugger’s call stack. Again, we have  Stepan Stava to thank for this addition, which Debugger users will recognize from Chrome and VS Code.\n  Performance improvements in this release speed up debugging, particularly for projects with large files. We also fixed a bottleneck that affected eval-heavy code patterns, which will now just work.\n   We’ve improved source map handling across all panels, so that opening SCSS and CSS-in-JS sources from the Inspector now works more reliably. You can quickly jump from the rules definitions in the Inspector side panel to the original file in the  Style Editor.\n  The  Accessibility Inspector is now always available in the browser context menu. allows you can open the element in the Accessibility panel directly, to inspect  ARIA properties and run audits.\n  The “Disable Cache” option in the Network panel now also deactivates  CORS preflight request caching. This makes it easier to iterate on your  web security settings.\n Contributor  KC aligned the styling for blocked requests shown in Console with their appearance in the Network panel.\n Richard Sherman extended the reach of tooltips, which now describe the type and value for previewed object values across Console and Debugger.\n To consolidate sidebar tabs,  Farooq AR moved Network’s WebSocket “Messages” tab into the “Response” tab.\n Debugger’s references to “blackbox” were renamed “ignore”, to align wording with other tools and make it more inclusive. Thanks to  Richard Sherman for this update too!\n   To prevent the DOM property   window.opener from being abused by untrusted third-party sites, Firefox 79 now automatically sets  rel=noopener for all links that contain  target=_blank. Previously, you had to set  rel=noopener manually to make  window.opener = null for every link that uses  target=_blank. In case you need  window.opener, explicitly enable it using  rel=opener.\n  At the start of 2018,  Shared Memory and high-resolution timers were effectively  disabled in light of  Spectre. In 2020, a new, more secure approach has been standardized to re-enable shared memory. As a baseline requirement, your document needs to be in a secure context. For top-level documents, you must set two headers to cross-origin isolate your document:\n  To check if cross-origin isolation has been successful, you can test against the   crossOriginIsolated property available to window and worker contexts:\n    The new   Promise.any() method takes an iterable of   Promise objects and, as soon as one of the promises in the iterable fulfills, returns a single promise resolving to the value from that promise. Essentially, this method is the opposite of   Promise.all(). Additionally,  Promise.any() is different from   Promise.race(). What matters is the order in which a promise is fulfilled, as opposed to which promise settles first.\n If all of the promises given are rejected, a new error class called   AggregateError is returned. In addition, it indicates the reason for the rejection(s).\n const promise1 = Promise.reject(0);const promise2 = new Promise((resolve) =&gt; setTimeout(resolve, 100, &#39;quick&#39;));const promise3 = new Promise((resolve) =&gt; setTimeout(resolve, 500, &#39;slow&#39;));const promises = [promise1, promise2, promise3];Promise.any(promises).then((value) =&gt; console.log(value));// quick wins\n  JavaScript supports a variety of  assignment operators already. The  Logical Assignment Operator Proposal specifies three new logical operators that are now enabled by default in Firefox:\n  These new logical assignment operators have the same short-circuit behavior that the existing  logical operations implement already. Assignment only happens if the logical operation would evaluate the right-hand side.\n For example, if the “lyrics” element is empty, set the  innerHTML to a default value:\n  Here the short-circuit is especially beneficial, since the element will not be updated unnecessarily. Moreover, it won’t cause unwanted side-effects such as additional parsing or rendering work, or loss of focus.\n  In JavaScript, references to objects are generally held strongly. Thus, as long as you have a reference to an object, it won’t be garbage collected. This changed with the addition of   WeakMap and   WeakSet in ES2015. However, since that time JavaScript has not provided a more advanced API for weakly held references. The  WeakRef proposal adds this capability. Now Firefox supports the   WeakRef and   FinalizationRegistry objects.\n Hop over to the MDN docs for  example usage of  WeakRef. Garbage collectors are complicated, so make sure you also read  this note of caution before using WeakRefs.\n   First off, seven new built-in operations are provided for  bulk memory operations. For example, copying and initializing allow WebAssembly to model native functions such as  memcpy and  memmove in a more efficient, performant way.\n The  reference-types proposal is now supported. It provides a new type,  externref, which can hold any JavaScript value, for example strings, DOM references, or objects. The   wasm-bindgen documentation includes guidance for taking advantage of  externref from Rust.\n With the return of SharedArrayBuffer objects, we’re now also able to support  WebAssembly threads. Thus, it is now possible for WebAssembly Memory objects to be shared across multiple WebAssembly instances running in separate Web Workers. The outcome? Very fast communication between Workers, as well as significant performance gains in web applications.\n  Starting with Firefox 79, developers of tab management extensions can improve the perceived performance when users switch tabs. The new   tabs.warmup() function will prepare the tab to be displayed. Developers can use this function, when they anticipate a tab switch, e.g. when hovering over a button or link.\n If you’re an extension developer and your extensions sync items across multiple devices, be aware that we ported   storage.sync area to a Rust-based implementation. Extension data that had been stored locally in existing profiles will automatically migrate the first time an installed extension tries to access  storage.sync data in Firefox 79. As a quick note, the new implementation enforces client-side quota limits. You should estimate how much data your extension stores locally and test how your extension behaves once the data limit is exceeded. Check out  this post for testing instructions and more information about this change.\n Take a look at the  Add-ons Blog for more updates to the WebExtensions API in Firefox 79!\n  As always, feel free to share constructive feedback and ask questions in the comments. And thanks for keeping your  Firefox up to date!", "posttime": "2020-07-29 00:07:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "firefox,火狐,现在", "title": "火狐79", "title_en": "Firefox 79", "transed": 1, "url": "https://hacks.mozilla.org/2020/07/firefox-79/", "via": "", "real_tags": ["firefox", "火狐", "现在"]}, {"category": "", "categoryclass": "", "imagename": "80bc78c51dd2b241a27e4832f10c52ba.jpg", "infoid": 1014712, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "TLS-经典-罗马-散文|重读弗格斯·米勒的《罗马世界的皇帝》(1977)，玛丽·比尔德的散文", "note_en": "The TLS - Classics - Roman - Essay | Re-reading Fergus Millar’s The Emperor in the Roman World (1977), an essay by Mary Beard", "posttime": "2020-07-29 00:07:06", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "皇帝,emperor,罗马", "title": "如何成为皇帝--重读费格斯·米勒的“罗马世界的皇帝”", "title_en": "How to Be an Emperor: Re-Reading Fergus Millar’s the Emperor in the Roman World", "transed": 1, "url": "https://www.the-tls.co.uk/articles/how-to-be-a-roman-emperor-essay-mary-beard/", "via": "", "real_tags": ["皇帝", "emperor", "罗马"]}, {"category": "", "categoryclass": "", "imagename": "b6b6ca73f583def9ffad68937c1579c5.png", "infoid": 1014711, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是我们公司历史上一个激动人心的转折点，因为我们正在加速实现我们的使命：通过为开发人员和技术人员提供服务来帮助编写未来的脚本。我们将通过投资于我们的客户使用的社区和产品的生态系统来做到这一点，以解决他们编写下一代数字应用程序时的难题。\n我很高兴以非常激动人心的消息开始本季度的博客文章，今天我们宣布为该公司提供8500万美元的E系列融资。这是我们公司历史上一个激动人心的转折点，因为我们正在加速实现我们的使命：通过为开发人员和技术人员提供服务来帮助编写未来的脚本。\n这一轮融资由GIC牵头，新投资者Silver Lake Waterman参与，我们的长期机构投资者也参与其中，其中包括Andreessen Horowitz、Index Ventures、Spark Capital和Union Square Ventures(USV)。随着我们踏上下一阶段的旅程，我们很高兴能与一些世界上最好的技术投资者合作。特别要感谢我们的团队，由我们的首席财务官Jerry Raphael领导，在这一过程中投入了大量的辛勤工作。\nStack Overflow作为一家风险投资公司已经有12年的历史了，我们上一轮融资是在2015年。这项投资将使我们为Stack Overflow的下一阶段奠定基础的工作得以继续：成为开发人员和技术人员在构建下一代应用程序时协作和共享知识的产品领先者。\n随着世界各地的公司经历激烈而加速的数字化转型阶段，堆栈溢出是这场运动的核心。这一变化涵盖了几乎所有行业，其推动因素是向云计算的大规模转移，通过DevOps运动关注敏捷性，以及通过分布式和远程工作获得来自世界各地的人才。这笔资金使我们的公司能够为我们建立的产品和社区生态系统增加额外的资源，以帮助开发人员和技术人员解决难题。\n“团队的堆栈溢出使我们的开发人员很容易快速找到他们需要的信息。它减少了内部问题的重复，消除了跨职能的孤岛，“Stack Overflow的客户之一、穆迪分析公司董事总经理克里斯·托马斯(Chris Thomas)说。团队的堆栈溢出帮助我们在穆迪分析公司推动更多的协作和创新，特别是在我们已经完全远离的情况下。“。\n我们的公共社区和商业产品是共生的。一个人不能没有另一个人成功，一个人越繁荣，就越能推动这两个人的成功。有了这笔资金，我们将能够在我们的公共平台和社区管理团队上投资更多的人员和工具；在支持我们的社区经理、版主和用户的工具、功能和平台上投资。我们已经分享了我们的社区路线图，我相信这笔资金将使我们能够兑现并扩大这一承诺。我们从这些社区学到的东西将帮助我们为开发人员、技术人员和依赖他们的公司构建更好、更有用的产品。\n在庆祝这一消息的同时，我也想承认，对许多人来说，这是一个艰难、动荡的时代。虽然世界上一些地区现在似乎正在遏制新冠肺炎大流行的道路上，但其他地区，包括我们在美国的总部，仍在努力应对迅速增加的病例数量。我们有理由抱有希望。Stack Overflow成立和总部所在的纽约遭受了巨大的损失，但现在似乎走上了一条更好的道路。作为一家公司，我们也经历过颠覆，但现在已经找到了立足点。这要归功于我们的社区、我们的员工、我们的客户以及每月1.2亿名开发人员和技术人员的巨大努力，他们继续向我们寻求可靠的知识来源，以帮助他们完成自己的工作。\n在第二季度，我们的社区团队(由我们的首席产品官Teresa Dietrich领导)非常关注改善我们版主的基础。本月早些时候，我们介绍了一项新的主持人协议，这是我们多年来首次对本文件进行更新。我们很高兴看到它得到了社区的好评，我们在努力围绕这份文档建立强有力的共识的过程中听取了主持人的反馈。我们还推出了几个新的途径来接触和启用我们的版主：包括版主理事会、版主市政厅和版主培训平台。我们还努力更新我们对知识共享授权的方法。我们通过SA许可证将条款更新到CC版本4.0，但确保在此更改之前添加到我们平台的任何内容都保留在版本3.0下。\n我们继续在我们的社区中看到积极的指标。4月份见证了Stack Overflow历史上最多的新注册数量(26万)，第二季度我们平台上的参与用户数量是自2019年1月以来最高的。本季度，Ask Ubuntu和3D打印等交易所出现了井喷增长。我个人对我们社区中围绕机器学习和云计算等主题的活动感到兴奋。\n最后，在Stack Overflow内部，我们刚刚结束了有史以来第一个公司Community-a-thon。我们的目标是让所有Stack Overflow员工熟悉该平台，让他们亲身体验普通Stack Overflow用户提问和回答问题的情况，并向我们的产品组织提供他们自己的反馈。Stacker在一系列主题上贡献了400多个问题和答案。我们将在未来再次这样做，因为它有助于在各部门之间产生许多伟大的想法，并加强用户和员工之间的反馈循环。当您构建、营销或销售与我们的社区相关的产品时，了解基础并对用户产生高度的同理心是值得的。\n我们的长期产品愿景是建立一个社区和产品生态系统，使开发人员和技术人员能够解决他们最困难的问题-在他们构建世界下一代软件应用程序时找到他们需要的解决方案。作为一家以产品为导向的公司，我们寻求有意义且可重复的方式来为我们的用户社区提供价值。我们公司的基础是我们的公共平台，每月有超过1.2亿来自世界各地的独立用户访问。最重要的是，我们已经建立了一套产品：团队、广告和人才。\n这场大流行从根本上重塑了世界各地人们的工作方式。对于许多公司来说，当选项可用时，远程工作已成为常态。在这种环境下，我们看到团队对我们的SaaS协作产品堆栈溢出的需求激增。例如，自2019年以来，我们针对团队的堆栈溢出基础试验增加了10倍。工程、产品管理、数据科学甚至客户成功组织的员工都需要一种方法，通过异步通信和协作来更快地发货产品、加快入职速度、改善客户体验并推动创新，无论他们在世界各地工作。G2和DevOps周期表已经认识到，团队的堆栈溢出是这一领域的始终如一的领导者。\n伟大的协作和知识共享来自于打破团队和部门之间的孤岛。例如，对于我们的团队产品，我们推出了Custom Awards功能，这是一个很好的机制，可以在客户在其公司和组织内创建的内部社区中建立高水平的参与度。该功能允许客户根据公司关心的特定目标的实现情况来奖励和表彰员工。\n我们的广告业务允许公司和企业向开发人员和技术人员展示他们的平台和工具，在过去的一个季度里，我们的需求也有所增加。我们还将我们的Direct to Developers(直接面向开发者)广告扩展到我们的技术Stack Exchange网站，使公司能够接触到更多的受众。这也意味着，希望接触专门从事亚马逊网络服务(AWS)、Microsoft Azure、Google Cloud、网络安全、Android或iOS的开发人员和技术人员的公司可以在专门分享这些特定主题知识的网站上与有才华的技术人员进行交流。\n对于我们的人才产品，我们重新设计了工作版面上的导航，大大提高了可用性和点击率。现在，我们所有的技术Stack Exchange站点都可以找到工作列表，而不仅仅是Stack Overflow，这进一步推动了我们的目标，即围绕云、DevOps和机器学习等其他技术主题，将我们的主站点与众多高度活跃和参与度很高的社区集成在一起。我们将继续投资于作为开发人员和技术人员的工作\n对于我们的人才和广告产品，我们都专注于使开发人员和技术人员受益的改进-使发现和找到工作以及新工具和服务变得更容易，在当前情况下，这两者都是至关重要的。\n与新冠肺炎一起，在过去三个月里重塑我们的世界的另一股主要力量是黑人生命也是运动，以及美国和世界各地日益增长的意识，即必须采取更多措施打击和消除系统性、结构性种族主义。Stack Overflow的Black and Brown(BNB)亲和力小组一直在领导我们为应对这些问题制定短期和长期计划。你可以在这里阅读更多关于这方面的内容，你可以听听Stack员工和我们BNB小组的联合主席Ian Allen和Syeeda Briddell的讲话，他们最近来到Stack Overflow播客讨论这些问题。\n展望未来，我想详述一些计划，以期在近期经济增长的基础上再接再厉，并把新的拨款投入工作。我们对Stack Overflow团队的愿景是创建世界上最强大的异步协作和知识共享产品。为我们的公共站点构建的基础方法Stack Overflow在过去十年中一直服务于我们的社区，事实证明，当部署在大大小小的企业和公司内部时，它同样有效。团队堆栈溢出是文档和Wiki的传统方法的强大替代，是组织和共享同事头脑中存在的信息和经验的更有机、更民主的方法。用户从赚取声誉和徽章中获得的反馈产生了飞轮效应，通过激励用户在向系统贡献知识和管理时提升并赚取更大的特权，鼓励新的内容创作和有效的审核。\n随着今天如此多的组织专注于数字转型和业务连续性，快速组织信息、连接问题和答案以及就解决方案进行协作的能力变得越来越有价值。通过Zoom和Google Meet的视频通话、电子邮件和聊天应用程序，如Slake和Microsoft Teams，现在是我们在信息和技术公司内部同步沟通的主要手段。当我在2019年10月加入Stack Overflow担任首席执行官时，这些趋势已经存在，但在席卷全球的关闭和隔离期间，它们急剧加速。我们相信，对于公司和企业来说，利用Stack Overflow这样的异步协作产品为团队提高生产力并最大限度地减少分心将是至关重要的。我们将继续致力于使该产品成为开发人员和技术专家工作流程中更加不可或缺的一部分，同时与上述同步协作工具紧密协作。\n我们产品的活力和多样性反映了我们社会的健康和广度。看到思想和技术知识的多样性在我们的网络上共享，这是鼓舞人心的，这些知识是世界下一代软件应用程序的基础。我们的社区越成功，我们就越容易扩展Stack溢出公司。随着我们的发展，我们可以雇佣和投资于我们的社区蓬勃发展所需的产品和人员。没有对方，任何一方都不可能繁荣。我今天的承诺是与我们的社区继续沿着透明和问责的道路前进，这样他们就可以继续扩大Stack Overflow和我们的交易所，我们也可以继续发展我们的业务，这种关系允许全球各地的公司和社区之间更好地协作和知识共享。\n标签：公告，CEO季度帖子，社区，公司，资金，使命，产品", "note_en": "This is an exciting inflection point in our company’s history as we accelerate the realization of our mission: to help write the script of the future by serving developers and technologists. We will do this by investing in our ecosystem of communities and products used by our customers, to solve their difficult problems as they write the next generation of digital applications.\n I am thrilled to start this quarter’s blog post with the very exciting news that today we announced  $85 million in Series E funding for the company. This is an exciting inflection point in our company’s history as we accelerate the realization of our mission: to help write the script of the future by serving developers and technologists.\n The financing round was led by GIC with participation from new investor Silver Lake Waterman with participation from our longstanding, institutional investors that include Andreessen Horowitz, Index Ventures, Spark Capital, and Union Square Ventures (USV). We are excited to partner with some of the world’s best technology investors as we embark on this next phase in our journey. A special note of thanks to our team, led by Jerry Raphael, our Chief Financial Officer, for the significant hard work that was invested in this process.\n Stack Overflow has been a venture backed company for 12 years and our last funding round was in 2015. This investment will allow for a continuation of the work we are doing to establish the foundation for Stack Overflow’s next phase: a leader in products for developers and technologists to collaborate and share knowledge as they build the next generation of applications.\n As the world’s companies go through an intense and accelerated phase of digital transformation, Stack Overflow is at the heart of this movement. The change, which ranges across almost all industries, is being propelled by the massive shift to the cloud, a focus on agility via the DevOps movement, and access to talent from around the world through distributed and remote work. This funding enables our company to add additional resources to the ecosystem of products and communities that we build to help solve difficult problems for developers and technologists.\n “Stack Overflow for Teams makes it easy for our developers to find the information they need quickly. It reduces the repetition of questions internally and eliminates cross-functional silos,” said Chris Thomas, Managing Director at Moody’s Analytics, a customer of Stack Overflow. “Stack Overflow for Teams helps us drive more collaboration and innovation at Moody’s Analytics, especially as we’ve gone fully remote.”\n Our public community and commercial products are symbiotically linked. One cannot succeed without the other, and the more one prospers, the more it can propel the success of the pair. With this funding, we will be able to invest in more people and tooling on our public platform and community management teams; in the tools, features, and platforms that support our community managers, moderators, and users. We’ve shared our  roadmap for the community, and I am confident that this funding will allow us to deliver on and expand that commitment. What we learn from these communities will help us to build better, more useful products for developers, technologists, and the companies that rely on them.\n While celebrating this news, I also want to acknowledge that these are difficult, turbulent times for many. While some areas of the world now seem to be on a path to containing the COVID-19 pandemic, other regions, including our home base in the United States, are still grappling with a rapidly growing number of cases. There is reason to have hope. New York, where Stack Overflow was founded and is headquartered, has suffered tremendously, but now seems to be on a better path. As a company, we have also experienced disruption, but have now found our footing. This is thanks to the tremendous efforts of our community, our employees, our customers and the 120 million monthly developers and technologists who continue to turn to us as a trusted source of knowledge to help them to do their jobs.\n  In Q2, there was significant focus from our Community team, led by Teresa Dietrich, our Chief Product Officer, to improve the foundation for our moderators. Earlier this month, we introduced a new moderator agreement, our first update to this document in many years. We’re glad to see it has been well-received by the community, and we listened to moderator feedback as we worked to build a strong consensus around this document. We also launched several new avenues to engage with and enable our moderators: including a moderator council, moderator townhalls, and a moderator training platform. We have also worked to  update our approach to Creative Commons licensing. We updated our terms to version 4.0 of the CC By SA license, but ensured that any content added to our platform before that change remains under version 3.0.\n We continue to see positive metrics around our community. April saw the largest number of new signups (260K) in Stack Overflow history, and the second quarter saw the highest number of engaged users on our platform since January of 2019. This quarter saw growth spurts on exchanges like Ask Ubuntu and 3D printing. I am personally excited by the activity in our communities around topics like machine learning and cloud computing.\n  Finally, internally at Stack Overflow, we just wrapped our first ever company Community-a-thon. The goal was to familiarize all Stack Overflow employees with the platform, to have them experience firsthand what it’s like for the average Stack Overflow user to ask and answer questions and to provide their own feedback to our Product organization. Stackers contributed over 400 questions and answers on a range of topics. We’ll be doing this again in the future, as it helps to generate a lot of great ideas across departments and strengthens the feedback loop between users and employees. When you’re building, marketing, or selling a product connected to our community, it pays to understand the foundation with high levels of empathy for users.\n  Our long term product vision is to build an ecosystem of communities and products that enable developers and technologists to solve their hardest problems — to find the solutions they need as they build the world’s next generation software applications. As a product-led company, we look at meaningful and repeatable ways to deliver value to our community of users. The foundation of our company is our public platform, visited by over 120 million unique people from around the world each month. On top of that, we have built a suite of products: Teams, Advertising, and Talent.\n The pandemic has radically reshaped the way in which people around the world do their work. For many companies, when the option is available, remote work has become the norm. In this environment, we have seen a surge in demand for our SaaS collaboration product  Stack Overflow for Teams. As an example, our  Basic Trials for Stack Overflow for Teams have increased 10X since 2019. Employees across Engineering, Product Management, Data Science, and even Customer Success organizations need a way to ship products faster, accelerate onboarding, improve customer experience, and drive innovation by communicating and collaborating asynchronously, no matter where in the world they are working from.  G2 and the  DevOps Periodic Table have recognized Stack Overflow for Teams as a consistent leader in this space.\n  Great collaboration and knowledge sharing comes from breaking down silos between teams and departments. As an example, for our Teams product, we launched the  Custom Awards feature, which is a great mechanism to build high levels of engagement within the internal communities our customers create within their companies and organizations. The feature allows customers to reward and recognize employees based on achievement of specific goals that the company cares about.\n Our Advertising business, which allows companies and enterprises to showcase their platforms and tools to developers and technologists, has also seen increased demand over the past quarter. We also expanded our Direct to Developers advertising to our technical Stack Exchange websites, allowing companies to reach and engage a much larger audience. This also means companies looking to reach developers and technologists who specialize in Amazon Web Services (AWS), Microsoft Azure, Google Cloud, cybersecurity, Android, or iOS, can communicate with talented technologists on sites dedicated to sharing knowledge around those specific topics.\n For our Talent product, we have redesigned navigation on our Jobs board, leading to a major increase in usability and click through rates. Job listings can now be found across all our technical Stack Exchange sites, not just Stack Overflow, furthering our goal of integrating our main site with the plethora of highly active and engaged communities around other technical topics like Cloud, DevOps and Machine Learning. We will continue to invest in Jobs as developers and technologists look for work in record numbers.\n For both our Talent and Advertising products, we have focused on improvements that benefit developers and technologists—making it easier to discover and find jobs and new tools and services, both of which are so vital during the current situation.\n  Along with COVID-19, another major force reshaping our world over the last three months but for the better is the Black Lives Matter movement and growing awareness around the United States and the world that more must be done to combat and dismantle systemic, structural racism. The Black and Brown (BnB) affinity group at Stack Overflow has been leading the creation of short and long term plans for our response to these issues. You can read more about that  here, and you can  listen to Ian Allen and Syeeda Briddell, Stack employees and co-chairs of our BnB group, who recently came onto the Stack Overflow podcast to discuss these issues.\n Looking to the future, I would like to detail some of the plans we have for building on our recent growth and for putting our new funding to work. Our vision for Stack Overflow for Teams is to create the world’s most powerful product for asynchronous collaboration and knowledge sharing. The foundational approach Stack Overflow built for our public sites that has served our community for over the past decade has proven to be just as effective when deployed inside of enterprises and companies large and small. Stack Overflow for Teams is a powerful alternative to traditional approaches to documentation and Wikis, a more organic and democratic approach to organizing and sharing the information and experience that exists inside your co-workers’ minds. The feedback users get from earning reputation and badges creates a flywheel effect, encouraging fresh content creation and effective moderation by incentivizing users to level up and earn expanded privileges when they contribute knowledge and curation to the system.\n With so many organizations today focused on digital transformation and business continuity, the ability to quickly organize information, connect questions and answers and to collaborate on solutions is becoming increasingly valuable. Video calls via Zoom and Google Meet, emails, and chat apps like Slack and Microsoft Teams are now our primary means of communicating synchronously inside of information and technology companies. These trends were already in place when I joined Stack Overflow as CEO in October of 2019, but they have accelerated dramatically during the shutdowns and quarantine that have rippled across the globe. We believe it’s going to be critical for companies and enterprises to leverage asynchronous collaboration products like Stack Overflow for Teams to improve productivity and minimize distraction. We will continue to focus on making the product an even more indispensable part of the developer and technologist workflow while working cohesively with the above synchronous collaboration tools.\n The vitality and variety of our products is a reflection of the health and breadth of our community. It’s inspiring to see the diversity of thought and technical knowledge being shared on our network — knowledge that is foundational to the world’s next generation of software applications. The more our community succeeds, the easier it will be for us to scale Stack Overflow the company. As we grow, we can hire and invest in the products and people our community needs to thrive. Neither side can prosper without the other. My commitment today is to continue down the path of transparency and accountability with our community, so that they can continue to scale Stack Overflow and our Exchanges, and we can continue to grow our business, a relationship that allows for greater collaboration and knowledge sharing across companies and communities that span the globe.\n Tags:  announcements,  ceo quarterly post,  community,  company,  funding,  mission,  product", "posttime": "2020-07-29 00:06:42", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "堆栈,overflow,产品", "title": "堆栈溢出以8500万美元获得E系列资金", "title_en": "Stack Overflow gets series E funding for $85M", "transed": 1, "url": "https://stackoverflow.blog/2020/07/28/ceo-quarterly-blog-post-3-series-e-funding/", "via": "", "real_tags": ["堆栈", "overflow", "产品"]}]