[{"category": "", "categoryclass": "", "imagename": "2e3554f67350c2df0ef1906f0a2c741e.png", "infoid": 1069191, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Taboola 是一家跨媒体资产运营流行的基于网格的广告和内容推荐网络的公司，今天宣布进行一项收购，以进一步扩大其在电子商务领域的影响力，这是自 6 月通过 SPAC 上市以来的首次重大举措：正在以现金和股票的组合支付 8 亿美元收购 Connexity，这是一家营销技术公司，经营着一个以零售和电子商务为重点的广告网络。自 2011 年以来，Connexity 一直由 Symphony Technology Partners 所有。 这笔交易的形式为：2.6 亿美元来自手头现金，3 亿美元来自承诺债务融资，以及大约 2.4 亿美元通过向卖方发行普通股——将扩大规模并进一步扩大多元化 Taboola 目前市值约 19 亿美元，与另一家内容推荐网络运营商 Outbrain 展开激烈竞争：两者原本打算合并运营，但最终各行其是，而 Outbrain 本身也在本月上市。 Taboola 表示，预计合并后的公司在截至 2021 年 3 月 31 日的财政年度的毛利润将超过 5 亿美元（除去交通采购成本，或 TAC），该期间的调整后 EBITDA 为 1.85 亿美元，这两个数字都将增长 20 2021 年与 2020 年的百分比。Connexity 在更名之前最初称为 Shopzilla，多年来它积累了许多相关业务，包括become.com、Skimlinks 和 PriceGrabber。 （甚至 Connexity 本身也是 Shopzilla 收购的，当时它主要是一个购物搜索引擎。）一起，它帮助公司建立了一个规模庞大的网络，专注于电子商务业务。虽然 Taboola 专注于内容推荐和与之并存的广告，而 Connexity 更专注于电子商务业务，但两者有一些共同之处。他们都将自己定位为广告和发现领域大玩家的可行替代品，为出版商和零售商提供了另一种赚取收入和寻找新客户的方式，而无需出售数据，并削减了这个世界上的谷歌、Facebook 和亚马逊。 Taboola 的首席执行官兼联合创始人 Adam Singolda 告诉 TechCrunch，当 Taboola 上市时，其向投资者出售的部分内容是它将转向更新的“类型”推荐，涵盖新的细分市场，这也将进一步扩大规模操作，这是该策略的一部分。如今，Taboola 在其平台上拥有 9,000 个数字资产合作伙伴、13,000 个直接广告商和 5 亿每日活跃用户，出版商可以使用内容推荐格式在 Taboola 网络上循环自己以及其他出版商和广告商的内容。\n就 Connexity 而言，它涵盖了各种活动，如附属链接、影响者营销、插播广告、购物搜索广告等。它的客户包括 1,600 家直销商和 6,000 家出版商（（沃尔玛、Wayfair、Skechers、梅西百货、eBay 和 Otto 是其中一些最引人注目的）。它表示，其网络总共有大约 40,000 家面向零售的出版商，可以从 7.5 亿个产品优惠池和 1 亿购物者的受众中进行选择。在一个非常分散的电子商务世界中，保持在线消费者的注意力充满挑战，它表示​​其各种活动已经产生了超过 8 亿的购物线索到 2020 年，其客户的销售额将超过 20 亿美元。不过，这仍然是蛋糕中相对较小的一部分。eMarketer 估计，仅在美国，电子商务媒体市场的价值就约为 350 亿美元。此外，Taboola 的打赌它已经与之合作的出版商将更深入地进入这个领域，作为他们自己的一部分，以最大限度地提高每位访问者/读者的收入并使他们自己的商业模式更加可行（同时多样化付费内容、付费墙、替代广告格式（如赞助内容、活动等）。 “62% 的美国出版商预计电子商务将成为他们最大的收入渠道之一，”辛戈尔达说。 “我坚信，如今每个出版商的领导层都将电子商务列为他们想要大举进军的前三件事。”如今，Connexity 是一个相当多渠道的产品——它在相邻技术中进行的所有收购的副产品——而 Taboola 计划保留这一切，“大量的交叉销售和追加销售机会，为开放网络上的每个出版商带来电子商务，推动更高收益，通过电子商务走向全球，授权编辑团队围绕电子商务撰写什么内容，”Singolda 说。", "note_en": "Taboola, the company that operates a popular grid-based advertising and content recommendation network across media properties, today announced an acquisition to expand its reach further into e-commerce, its first big move since going public in June by way of a SPAC: it is paying $800 million in a combination of cash and stock to buy  Connexity, a marketing technology company that operates an retail- and e-commerce-focused advertising network. Connexity has been owned by Symphony Technology Partners since 2011.\n The deal — coming in the form of $260 million from cash on hand, $300 million from committed debt financing and approximately $240 million through the issuance of ordinary shares to the seller — will supersize and further diversify Taboola, which currently has a market cap of about $1.9 billion and is in hot competition with another content recommendation network operator, Outbrain: the two were  set to merge operations but eventually  went their own ways, and Outbrain itself  went public this month.\n Taboola said it expects the combined company to have gross profit of over $500 million for the fiscal year ended March 31, 2021 (ex- traffic acquisition costs, or TAC), with $185 million of adjusted EBITDA for the period, with both figures growing 20% in 2021 versus 2020.\n   Connexity was originally called Shopzilla before  rebranding, and it has over the years amassed a number of related businesses, including  Become.com,  Skimlinks and  PriceGrabber. (Even Connexity itself was an  acquisition made by Shopzilla when it was primarily a shopping search engine.) Together, it’s helped the company build out what has become a sizable network focused around the business of e-commerce.\n While Taboola focuses on content recommendations and advertising that runs alongside that, and Connexity is more squarely focused on the business of e-commerce, the two have something in common. They both position themselves as viable alternatives to the big players in advertising and discovery, giving publishers and retailers another way of making revenues and finding new customers without selling out data and a cut to the Googles, Facebooks and Amazons of this world.\n Adam Singolda, the CEO and co-founder of Taboola, told TechCrunch that when Taboola went public, part of its sell to investors was that it would move into newer “types” of recommendations, covering new segments, that would also further scale the bigger operation, and this is a part of that strategy.\n  Taboola today has 9,000 digital property partners, 13,000 direct advertisers and 500 million daily active users on its platform, where publishers can use the content recommendation format to recirculate their own content as well as that of other publishers and advertisers on the Taboola network.\n For Connexity’s part, it covers various activities like affiliate links, influencer marketing, in-stream advertising, shopping search ads, and more. Its customers include 1,600 direct merchants, and 6,000 publishers ((Walmart, Wayfair, Skechers, Macy’s, eBay and Otto are some of the most high profile of these). And in total, it says its network has some 40,000 retail-oriented publishers that can select from a pool of 750 million product offers, and an audience of 100 million shoppers.\n And in a very fragmented e-commerce world rife with challenges in keeping online consumers’ attention, it says its various activities have generated over 800 million shopping leads and in 2020 more than $2 billion in sales for its customers.\n That is still a relatively small part of the pie, though. eMarketer estimates that the e-commerce media market is worth some $35 billion in the U.S. alone.\n Added to that, Taboola’s bet is that the publishers it already works with are going to be getting deeper into this space as part of their own drive to maximize more revenues per visitor/reader and make their own business models more viable (alongside diversifying into paid content, paywalls, alternative advertising formats like sponsored content, events, and so on).\n “62% of US publishers expect ecommerce to be one of their biggest revenue channels,” Singolda said. “I strongly believe every publisher’s leadership these days have e-Commerce as a top 3 thing they want to get into in a big way.”\n Connexity is a fairly multichannel offering today — a byproduct of all the acquisitions it has made into adjacent technologies — and Taboola plans to keep it all, with “massive cross sell and upselling opportunities, bringing eCommerce to every publisher on the open web, driving higher yields, going global with e-Commerce, empowering editorial teams what to write about around e-Commerce,” Singolda said.", "posttime": "2021-07-23 19:03:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "电子商务,spac", "title": "通过 SPAC 上市后，Taboola 以 8 亿美元收购电子商务营销网络 Connexity", "title_en": "\n\t\t\t\tAfter going public via a SPAC, Taboola acquires e-commerce marketing network Connexity for $800M\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/23/after-going-public-via-a-spac-taboola-acquires-e-commerce-marketing-network-connexity-for-800m/", "via": "", "real_tags": ["电子商务", "spac"]}, {"category": "", "categoryclass": "", "imagename": "9181a92e7b34af551451edcb6d2f9ef3.jpg", "infoid": 1069190, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "英国快速增长的“先买后付”金融业的最大参与者之一将于周五宣布，它已从高盛和《每日邮报》的所有者那里获得资金。天空新闻获悉，Zilch 已达成协议，从高盛资产管理部门的私人信贷团队和每日邮报和通用信托 (DMGT) 的一个部门 DMG Ventures 筹集了 1.1 亿美元（8000 万英镑）的债务和股权。据内部人士称，此次融资是 Zilch 于 4 月宣布的 B 轮融资的延伸，将使该轮融资的整体规模超过 2 亿美元。其增加的注资反映了在监管审查日益严格期间对 BNPL 产品的需求飙升。 Zilch 预计将利用这笔额外资金继续建立其品牌形象并扩展到美国——一个关键的目标市场。该行业最大的参与者 Klarna 最近在一轮融资中筹集了超过 6 亿美元，其估值高达 456 亿美元。 Zilch 拥有超过 700,000 名客户，今年早些时候成为该行业第一家推出 BNPL 服务的公司，称为 Tap &amp; Pay-over-time，使消费者能够在六周内刷卡并支付购买费用.\n该公司由首席执行官 Philip Belamant 于 2018 年创立，是首批受金融行为监管局全面监管的 BNPL 参与者之一。其 B 轮融资的延期将使 Zilch 走上首次公开募股的道路，尽管该公司尚未决定确定的计划，例如上市时间。 Belamant 先生说：“随着我们的客户数量不断增长，我们决定筹集额外资金来满足这一惊人的需求。”我们很高兴高盛和 DMG Ventures 等备受推崇的机构与我们有共同的愿景当今世界应该有什么信用，以及如何以最负责任的方式将信用直接交付给客户。” DMGT 的风险投资部门还支持其他快速增长的技术公司，包括 Cazoo，这是一家即将在 New 上市的二手车市场。约克。Zilch 的服务可在接受万事达卡的商店中向客户提供，并认为它与竞争对手的区别在于它与消费者有直接关系。这意味着，它说，它不受与商家收单机构有关的传统障碍的阻碍，并为其在评论平台 Trustpilot 上的高评分做出了贡献。\nDMG Ventures 的首席执行官 Manuel Lopo de Carvalho 表示，Zilch 的增长速度是“惊人的”。 “显然有机会为英国消费者提供更容易获得和负责任的信贷，我们很高兴支持 Zilch 向全国英国客户传播其品牌和信息，”他说。在其前任高管克里斯托弗·伍拉德 (Christopher Woolard) 领导的审查之后，BNPL 部门的增长引起了 FCA 越来越多的审查。 Zilch 公开欢迎这种审查，认为它“建立在责任之上，提供透明度，并且是业内唯一一家使用开放银行技术结合软信用检查来实时查看和了解消费者的负担能力概况的公司。并对他们能负担得起的东西做出准确的建议，从而防止出现问题债务”。", "note_en": "One of the biggest players in Britain&#39;s fast-growing &#39;buy now pay later&#39; finance sector will announce on Friday that it has secured funding from Goldman Sachs and the owner of the Daily Mail.\n Sky News has learnt that Zilch has struck a deal to raise $110m (£80m) in debt and equity from Goldman&#39;s asset management arm&#39;s private credit team and DMG Ventures, a division of Daily Mail &amp; General Trust (DMGT).\n  The fundraising is an extension of Zilch&#39;s Series B round, announced in April, and will take the overall size of the round to more than $200m, according to insiders.\n Its increased capital injection reflects soaring demand for BNPL products during a period of growing regulatory scrutiny.\n Zilch is expected to use the additional funding to continue building its brand profile and expanding into the US - a key target market.\n   The industry&#39;s biggest player, Klarna, recently raised more than $600m in a funding round which valued it at a gargantuan $45.6bn.\n  Zilch has more than 700,000 customers, and earlier this year became the first company in the sector to launch a BNPL service, called Tap &amp; Pay-over-time, enabling consumers to tap their card and pay for their purchase over a six-week period.\n   The company, which was founded by chief executive Philip Belamant in 2018, was one of the first BNPL players to be fully regulated by the Financial Conduct Authority.\n The extension of its Series B round will place Zilch on a course towards an initial public offering, although the company has yet to decide on definitive plans such as the timing of a listing.\n Mr Belamant said: &#34;As our customer numbers continue to grow, we&#39;ve taken the decision to raise additional capital to service this phenomenal demand.\n &#34;We&#39;re delighted that well-respected institutions such as Goldman Sachs and DMG Ventures share our vision of what credit should be in today&#39;s world and how that can be delivered directly to customers in the most responsible way.&#34;\n DMGT&#39;s ventures arm has backed other fast-growing technology companies including Cazoo, the used-car marketplace which is about to list publicly in New York.\n Zilch&#39;s services are available to customers in shops wherever MasterCard is accepted, and argues that it is differentiated from competitors because it has direct relationships with consumers.\n That means, it says, that it is not hampered by conventional obstacles relating to merchant acquirers, and contributes to what it says its high rating on the reviews platform Trustpilot.\n Manuel Lopo de Carvalho, chief executive of DMG Ventures, said the pace of Zilch&#39;s growth was &#34;phenomenal&#34;.\n &#34;There is a clear opportunity to provide more accessible and responsible credit to UK consumers and we&#39;re delighted to support Zilch in the proliferation of its brand and message to UK customers nationwide,&#34; he said.\n The growth of the BNPL sector has drawn growing scrutiny from the FCA following a review led by Christopher Woolard, one of its former executives.\n Zilch has publicly welcomed that scrutiny, arguing that it is &#34;built upon responsibility, offers transparency and is the only player in the industry that uses Open Banking technology combined with soft credit checks to gain a real-time view and understanding of the consumer&#39;s affordability profile and make an accurate recommendation of what they can afford, preventing problem debt&#34;.", "posttime": "2021-07-23 19:00:22", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "服务,sachs,zilch", "title": "资料来源：伦敦的“先买后付”服务 Zilch 为其 B 轮融资增加了 1.1 亿美元，使该轮融资超过 2 亿美元，来自高盛和《每日邮报》的所有者", "title_en": "Source: London-based buy now, pay later service Zilch adds $110M to its Series B, bringing the round to over $200M, from Goldman Sachs and Daily Mail's owner", "transed": 1, "url": "https://news.sky.com/story/buy-now-pay-later-provider-zilch-strikes-110m-funding-deal-with-goldman-and-daily-mail-owner-12361365", "via": "", "real_tags": ["服务", "sachs", "zilch"]}, {"category": "", "categoryclass": "", "imagename": "24e5c61565960f1c26356fee6b9165f1.png", "infoid": 1069189, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 Chrome OS 91 方面，谷歌似乎无法休息。首先，我们看到许多用户报告他们的设备在升级到 91.0.4472.147 后使用了大量的 CPU。虽然谷歌此后不久取消了更新并将所有人回滚到 91.0.4472.114，但这设法锁定了 Linux 应用程序。现在我们看到 91.0.4772.165 的到来，此更新引入了一个可怕的错误，该错误正在左右破坏 Chromebook。 ChromeOS subreddit 的一位版主最近向我们透露了这个新的 Chrome 操作系统更新，它将用户锁定在他们的 Chromebook 之外。如果您在系统托盘中收到更新计算机的提示，请不要关闭 Chromebook。否则 Chrome OS 会在重新启动时自动安装它，这意味着您的设备将卡在有问题的 91.0.4772.165 版本中。虽然谷歌意识到了这个问题并正在从其服务器中提取更新，但损害已经造成。一位 redditor 报告说，他们的两台 Chromebook 将不再在登录屏幕上接受他们的密码——他们的一台笔记本电脑开始启动循环。即使是 powerwash 也无法挽救其他用户的 Asus Chromebook C436，迫使他们使用恢复 USB 来恢复并运行他们的 USB。拙劣的 91.0.4772.165 更新似乎导致了重要文件的大量丢失，很多人都很生气。我们不确定这个主要错误是如何通过三个开发者渠道进入稳定版的，我们希望你们中的很多人都不会受到它的影响。整个事件凸显了谷歌对其 Chrome OS 版本缺乏质量控制——对于计划长期使用 Chrome OS 的新用户来说，这当然不是一个好主意。在用其拙劣的版本破坏了一堆 Chromebook 之后，谷歌从其更新矩阵中删除了 91.0.4472.165 版本，将 Chrome 设备回滚到 91.0.4472.147。由于最近的零日漏洞利用，它不会那么安全，但至少您将能够访问您的笔记本电脑。谷歌澄清说，该团队发现了问题，并将于明天，即 7 月 21 日发布修复程序。对于担心数据丢失的受影响用户来说，还有一个好消息：如果你等到周三，你将能够再次登录，而无需进行 powerwash当您的设备自动应用更新时（您可以通过进入访客模式手动触发它）。谷歌将在 7 月 21 日推出更新的 Chrome OS 91 版本并进行修复。那么发生了什么？感谢 Reddit 上一位目光敏锐的用户的工作，我们现在知道一个错字似乎是导致如此多用户无法使用 Chromebook 的原因。通过查看此文件中的差异，我们可以看到 Google 忘记在条件语句中添加第二个“&amp;”，以防止 Chrome OS 解密您的登录信息（登录时需要）。\n虽然我们很高兴谷歌迅速采取行动并将拙劣的更新从其服务器上撤下，但损害已经造成。当然，您应该定期创建重要文件的备份，但您的 Chromebook 也不应该任意强迫您删除本地文件。我无法理解使用 Chromebook 的企业——甚至大学——正在经历什么。管理员可以一次远程批量更新数千台受管理的 Chromebook。对昨天的灾难进行故障排除一定很糟糕，而且没有办法补偿最终用户丢失的数据（以及恢复一切所需的时间）。这个问题无疑会给受影响的用户留下伤疤，我希望谷歌采取措施防止此类问题再次发生。", "note_en": "Google can&#39;t seem to catch a break when it comes to Chrome OS 91. First we saw many users reporting their devices using an  egregious amount of CPU after upgrading to 91.0.4472.147. While Google pulled the update shortly thereafter and rolled everyone back to 91.0.4472.114, that managed to lock out Linux apps. Now we&#39;re seeing the arrival of 91.0.4772.165, and this update introduces an awful bug that&#39;s breaking Chromebooks left and right.\n  A moderator from the  ChromeOS subreddit recently tipped us about this new Chrome OS update that&#39;s locking users out of their Chromebooks. If you receive a prompt in the system tray to update your machine,  do not shut off your Chromebook. Chrome OS would otherwise automatically install it upon restarting, meaning your device would be stuck with the problematic 91.0.4772.165 build.\n While  Google is aware of the problem and is pulling the update from its servers, the damage has already been done. A  redditor reports that two of their Chromebooks will no longer accept their password on the login screen — one of their laptops started to bootloop. Even a powerwash couldn&#39;t save  another user&#39;s Asus Chromebook C436, forcing them to use a recovery USB to get theirs back up and running. The botched 91.0.4772.165 update appears to have resulted in a significant loss of important files, and  a lot of folks are pissed.\n We&#39;re not sure how this major bug slipped past  three developer channels and into Stable, and we hope not many of you are affected by it. The whole incident highlights Google&#39;s  lack of quality control over its Chrome OS releases — it&#39;s certainly not a good look for new users who plan on using Chrome OS long-term.\n   After breaking a bunch of Chromebooks with its botched release, Google pulled the 91.0.4472.165 build off its update matrix, rolling Chrome devices back to 91.0.4472.147.  It won&#39;t be as secure thanks to a recent zero-day exploit, but at least you&#39;ll be able to access your laptop. Google clarifies that the team identified the problem and will  release a fix tomorrow, July 21. There&#39;s also good news for affected users worried about their lost data: if you wait until Wednesday, you&#39;ll be able to log in again without needing to powerwash when your device applies the update automatically (you can trigger it manually by entering guest mode).\n  Google will roll out an updated Chrome OS 91 build with a fix on July 21.\n So what happened? Thanks to the work of an  eagle-eyed user on Reddit, we now know that a  single typo appears responsible for locking so many users out of their Chromebooks. By looking at the diff in  this file, we can see that Google forgot to add a second &#34;&amp;&#34; to the conditional statement, preventing Chrome OS from decrypting your login information (required to log you in).\n While we&#39;re happy that Google acted quickly and pulled the botched update off its servers, the damage has been done. Sure, you should routinely create backups of your important files, but your Chromebook shouldn&#39;t arbitrarily force you to delete local files, either. I can&#39;t fathom what Chromebook-using businesses — or even universities — are going through. An admin can remotely bulk-update thousands of managed Chromebooks all at once. Troubleshooting yesterday&#39;s disaster must have been awful, and there&#39;s no way to compensate end users for their loss of data (and time recovering everything). This issue will undoubtedly leave a scar on affected users, and I hope Google will take steps to prevent this sort of issue from happening again.", "posttime": "2021-07-23 19:00:07", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "google,谷歌,chrome,错误,rolling", "title": "谷歌正在修复 Chrome OS 91 中的一个错误，该错误显然是由一个错字引起的，该错误在重新启动时将 Chromebook 所有者锁定在设备之外", "title_en": "Google is rolling out a fix for a bug in Chrome OS 91, apparently caused by a single typo, which locked Chromebook owners out of devices upon restarting", "transed": 1, "url": "https://www.androidpolice.com/2021/07/20/a-new-chrome-os-91-update-is-breaking-chromebooks-like-a-bull-in-a-china-shop/?scrolla=5eb6d68b7fedc32c19ef33b4", "via": "", "real_tags": ["google", "谷歌", "chrome", "错误", "rolling"]}, {"category": "", "categoryclass": "", "imagename": "cec7b0ec4c48653218c2231f80c27831.jpg", "infoid": 1069188, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据五角大楼联合人工智能中心 (JAIC) 委托编写的一份报告，俄罗斯正在快速开发一系列自主武器系统，以挑战美国的军事主导地位。 “俄罗斯军方寻求成为武器化人工智能技术的领导者，”JAIC 主任迈克尔格罗恩中将最近告诉国防部。这份名为《俄罗斯的人工智能和自治》的报告详细介绍了该国各个发展阶段的 150 多个支持人工智能的军事系统，包括自主的陆地、海洋、空中、太空和网络平台。根据格罗恩的说法，这些平台的目标是“战场上的信息优势”，该机构认为这是对美国及其盟友的潜在威胁。 “俄罗斯不是互联网或计算机网络发展的主要领导者，但俄罗斯已成为将这些技术武器化以实现先进网络攻击和网络犯罪能力的领导者，”格罗恩指出。据参谋长联席会议的约翰海滕将军称，莫斯科最近加快了对大数据、软件和人工智能的投资。他在 6 月份的国防部人工智能研讨会上解释说，该国在网络空间、下一代核武器和太空等领域的发展迅速加快。增强型人工智能系统在这种多管齐下的军事方法中占有突出地位。\n“俄罗斯是一个重大威胁，尤其是在短期内，”他说。 “不仅要跟上他们，而且要领先于他们，这是一个挑战。”", "note_en": "Russia is on the fast track to developing a range of   autonomous weapon systems  in a challenge to US military dominance, according to a report commissioned by the Pentagon’s Joint Artificial Intelligence Center (JAIC).\n “The Russian military seeks to be a leader in weaponizing AI technology,” JAIC director Lt. Gen.  Michael Groen  recently   told   National Defense.\n  Titled   Artificial Intelligence and Autonomy in Russia , the report details more than 150   AI-enabled military systems  at various points of development in the country, including   autonomous land ,   sea , air, space, and cyber platforms.\n The goal of these platforms is “information dominance on the battlefield,” according to Groen, something the agency considers a potential threat to America and its allies.\n “Russia was not a major leader in the development of the internet or computer networking, but Russia has become a leader in weaponizing those technologies for advanced cyberattacks and cybercrime capabilities,” Groen noted.\n  According to Gen.  John Hyten  of the Joint Chiefs of Staff, Moscow has recently accelerated its investments in big data, software, and artificial intelligence.\n The country has rapidly accelerated development in areas such as cyberspace, next-gen nuclear weapons, and space, he explained at a June Defense Department AI Symposium. Enhanced AI systems feature prominently in this multi-pronged military approach.\n “Russia is a significant threat, especially in the near term,” he said. “It is a challenge to not just keep up with them but stay ahead of them.”", "posttime": "2021-07-23 18:55:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "俄罗斯,人工智能,武器化,weaponizing", "title": "俄罗斯“武器化”人工智能：五角大楼情报报告", "title_en": "Russia ‘Weaponizing’ AI: Pentagon Intelligence Report", "transed": 1, "url": "https://www.thedefensepost.com/2021/07/21/russia-weaponizing-ai/", "via": "", "real_tags": ["俄罗斯", "人工智能", "武器化"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1069187, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "像往常一样通过广告和跟踪访问 zeit.de。有关跟踪的详细信息可以在数据保护声明和中找到。使用 zeit.de 广告较少且无广告跟踪，每周 1.20 欧元（数字订阅者仅需 0.40 欧元/周）。我们收集和传输个人数据以帮助我们改进和资助我们的网站。出于以下目的处理存储在您设备上的信息，例如 cookie 或个人标识符、IP 地址和您的个人使用行为： 出于以下目的，可以在您的设备上存储或检索 cookie、设备标识符或其他信息：你。广告和内容可以根据个人资料进行个性化。可以添加更多数据以更好地个性化广告和内容。可以衡量广告和内容的表现。可以得出对查看广告和内容的目标群体的洞察。数据可用于构建或改进可用性、系统和软件。", "note_en": "Besuchen Sie zeit.de wie gewohnt mit Werbung und Tracking. Details zum Tracking finden Sie in der  Datenschutzerklärung und im  .\n  Nutzen Sie zeit.de mit weniger Werbung und ohne Werbetracking für 1,20 €/Woche (für Digital-Abonnenten nur 0,40 €/Woche).\n  Wir erheben personenbezogene Daten und übermitteln diese auch an   , die uns helfen, unser Webangebot zu verbessern und zu finanzieren. Eine Verarbeitung der auf Ihrem Gerät gespeicherten Informationen wie z.B. Cookies oder persönliche Identifikatoren, IP-Adressen sowie Ihres individuellen Nutzungsverhaltens erfolgt dabei zu den folgenden Zwecken:\n      Für die Ihnen angezeigten Verarbeitungszwecke können Cookies, Geräte-Kennungen oder andere Informationen auf Ihrem Gerät gespeichert oder abgerufen werden.\n       Anzeigen und Inhalte können basierend auf einem Profil personalisiert werden. Es können mehr Daten hinzugefügt werden, um Anzeigen und Inhalte besser zu personalisieren. Die Performance von Anzeigen und Inhalten kann gemessen werden. Erkenntnisse über Zielgruppen, die die Anzeigen und Inhalte betrachtet haben, können abgeleitet werden. Daten können verwendet werden, um Benutzerfreundlichkeit, Systeme und Software aufzubauen oder zu verbessern.", "posttime": "2021-07-23 18:55:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "车轮下,wheels,广告", "title": "车轮下 (2019)", "title_en": "Under the Wheels (2019)", "transed": 1, "url": "https://www.zeit.de/wirtschaft/2019-12/cambodia-bicycles-worker-exploited-production-working-conditions-english", "via": "", "real_tags": ["车轮下", "wheels", "广告"]}]