[{"category": "", "categoryclass": "", "imagename": "d2d91d3760dd7ff02a7e926b6ae729b7.png", "infoid": 1070545, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您使用 Internet Explorer 11 (IE 11) 访问 AWS 管理控制台、基于 Web 的服务，例如 Amazon Chime 或 Amazon Honeycode，或 AWS 网站的其他部分（AWS 文档、AWS 营销、AWS Marketplace 或 AWS支持），是时候升级到更现代、更安全的浏览器了，例如 Edge、Firefox 或 Chrome。 2021 年 7 月 31 日 – 从今天开始，我们将不再确保新的 AWS 管理控制台功能和网页在 IE 11 上正常运行。我们将针对现有功能和页面修复特定于 IE 11 的错误。 2021 年末——如果您使用 IE 11 访问上面列出的任何服务或页面，您将在今年晚些时候收到弹出通知（以及升级浏览器的提醒）。 2022 年 7 月 31 日 – 从今天起一年后，我们将停止支持 IE 11，您将需要使用我们支持的浏览器。", "note_en": "If you are using Internet Explorer 11 (IE 11) to access the  AWS Management Console, web-based services such as  Amazon Chime or  Amazon Honeycode, or other parts of the AWS web site ( AWS Documentation,  AWS Marketing,  AWS Marketplace, or  AWS Support), it is time to upgrade to a more modern &amp; secure browser such as  Edge,  Firefox, or  Chrome.\n    July 31, 2021 – Effective today, we will no longer ensure that new  AWS Management Console features and web pages function properly on IE 11. We will fix bugs that are specific to IE 11 for existing features and pages.\n  Late 2021 – Later this year you will receive a pop-up notification (and a reminder to upgrade your browser) if you use IE 11 to access any of the services or pages listed above.\n  July 31, 2022 – One year from today we will discontinue our support for IE 11 and you will need to use a  browser that we support.", "posttime": "2021-07-30 08:01:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "internet,support,aws", "title": "AWS 对 Internet Explorer 11 的支持即将结束", "title_en": "AWS Support for Internet Explorer 11 Is Ending", "transed": 1, "url": "https://aws.amazon.com/blogs/aws/heads-up-aws-support-for-internet-explorer-11-is-ending/", "via": "", "real_tags": ["internet", "support", "aws"]}, {"category": "", "categoryclass": "", "imagename": "419333b740754ca8e6b68f230c570197.jpg", "infoid": 1070544, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Paragon Solutions 没有网站。网上关于他们的信息很少，即使这家总部位于特拉维夫的智能手机监控初创公司的员工都在 LinkedIn 上，其中有 50 多人。对于仍处于隐身模式的公司来说，这并不是一个糟糕的人数。但它确实有一位联合创始人、董事和首席股东会转过头来：Ehud Schneorson，前以色列国家安全局指挥官，被称为 Unit 8200。 其他联合创始人 - 首席执行官 Idan Nurick、首席技术官 Igor Bogudlov 和研究副总裁 Liad Avraham - 也是前以色列情报人员。董事会中还有联合创始人兼以色列前总理埃胡德·巴拉克 (Ehud Barak)。他们还有一个重要的美国金融支持者：位于马萨诸塞州波士顿的 Battery Ventures。据以色列监控行业公司的两名不愿透露姓名的高级员工称，风险投资业务投入了 5 至 1000 万美元，但 Battery 拒绝评论其投资的性质，这仅在公司网站上的简要介绍。业内消息人士称，Paragon 的产品也可能会遭到间谍软件批评者和监控专家的一致谴责：它声称赋予警方远程侵入加密即时消息通信的权力，无论是 WhatsApp、Signal、Facebook Messenger 还是 Gmail。另一位间谍软件行业高管表示，即使设备重新启动，它也有望获得更持久的设备访问权限。这家初创公司成立于 2019 年，在智能手机黑客雇佣行业的同类公司受到猛烈抨击之际，它正在悄悄地发展壮大。 The Pegasus Project, a coalition of nonprofits and global publications, this month claimed to have uncloaked worldwide surveillance of journalists, lawyers and high-profile elected politicians by clients of Israel&#39;s best known spyware provider NSO Group.该公司的首席执行官驳斥了该项目合作伙伴的说法，称没有证据表明其工具被用于针对报道中提到的人，从被谋杀的记者贾马尔·卡舒吉的妻子到法国总统埃马纽埃尔·马克龙。法国政府已经开始调查，但现在正在呼吁世界各地的其他政府调查谁被 NSO 的间谍软件入侵以及为什么被入侵。甚至在 Pegasus 项目之前，微软总裁布拉德史密斯就警告说，作为一个整体价值 120 亿美元的行业代表着一种威胁，他写道：“一个帮助进攻性网络攻击的行业部门在两个方面预示着坏消息。首先，它为主要的民族国家攻击者增加了更多的能力，其次，它使网络攻击扩散到其他有钱但没有人来制造自己武器的政府。简而言之，它为网络安全威胁格局增加了另一个重要因素。” Paragon 的一位高级管理人员拒绝就此事发表评论，他告诉福布斯，他不想谈论其产品。他说公司还没有客户。但是，为了避免 NSO 与其一些因滥用而被禁止的客户之间的麻烦，这位高管补充说，Paragon 只会向遵守国际规范并尊重基本权利和自由的国家出售产品。他补充说，专制或非民主政权永远不会成为顾客。两位业内消息人士表示，他们认为 Paragon 试图通过承诺访问设备上的即时消息应用程序，而不是完全控制手机上的一切，来进一步让自己与众不同。其中一位消息人士表示，他们了解到 Paragon 的间谍软件利用端到端加密应用程序的协议，这意味着它会通过软件运行的核心方式中的漏洞入侵消息。根据 LinkedIn 的个人资料，该公司的员工在监控方面拥有强大的背景，其运营副总裁和人力资源主管是前国家统计局，其许多开发人员来自以色列国防军情报部门。其软件开发人员之一阿隆·温伯格 (Alon Weinberg) 此前曾在美国著名的黑客大会 Def Con 上展示了对在英特尔和 AMD 芯片上运行的软件进行黑客攻击的研究。\n有了美国的支持者，Paragon 似乎将尝试破解美国执法机构，而 NSO 等其他机构则失败了。根据 LinkedIn 的个人资料，拥有 30 年以色列情报经验的资深人士梅纳赫姆·帕克曼 (Menachem Pakman) 已受雇帮助在美国寻找业务。然而，没有迹象表明他们在大西洋彼岸有客户。根据该公司的公司文件，Battery 于 2019 年 9 月通过其两个风险投资工具进行投资，表明它帮助启动了该业务，而其以色列副总裁 Aaron Rinberg 是 Paragon 的董事会观察员。 Battery 自 1983 年成立以来已筹集了超过 90 亿美元的资金，在其时代已经获得了一些非常成功的投资，包括 Coinbase、Groupon、Splunk、SkullCandy 和 Pokémon Go 的创造者 Niantic。截至发稿时，该公司尚未就其对以色列智能手机监控游戏的投资发表评论。多伦多大学芒克学院公民实验室高级研究员约翰斯科特-雷尔顿表示，如果 Paragon 的业务目标是帮助美国机构瞄准美国人，那么它需要仔细审查。 “现在正在向该行业投入资金的任何美国投资者都迫切需要认真审查。我们需要知道他们的客户是谁。我们已经了解到当该行业秘密运作并表示他们关心保护人权时会发生什么，”他说。 “黑客出租行业在法律上已经走得很远了。” Paragon 高管表示，该公司不会透露未来的客户。 Paragon 并不是第一家在推出时接受美国风险投资的以色列公司。 Toka 专注于帮助执法部门入侵 Amazon Echos 等物联网设备以进行取证或在财产突袭期间进行，在 2018 年的一轮融资中筹集了 1250 万美元，其中包括来自 Dell Technologies Capital 和 Andreessen Horowitz 的资金。与此同时，NSO 由美国私募股权公司 Francisco Partners 持有多数股权，直到英国私募股权公司 Novalpina Capital 接管。 Paragon 的领导层也处于为网络防御和进攻公司工作的有趣位置。首席执行官 Nurick 是 Hunters.ai 的联合创始人，这家初创公司承诺人工智能可以在网络上追捕黑客，并得到微软投资部门 M12 的支持。 Schneorson 被列为该业务的董事会成员和 ZecOps 的顾问，ZecOps 是一家移动安全业务，过去曾发现监控业务开发的电话黑客行为。 （在发布时，ZecOps 首席执行官 Zuk Avraham 尚未回应置评请求。）", "note_en": "Paragon Solutions doesn’t have a website. There’s very little information at all about them online, even if the Tel Aviv-based smartphone surveillance startup’s employees are all over LinkedIn, more than 50 of them. That’s not a bad headcount for a company that’s still in stealth mode.\n   But it does have a cofounder, director and chief shareholder that will turn heads: Ehud Schneorson, the former commander of Israel’s NSA equivalent, known as Unit 8200. The other cofounders - CEO Idan Nurick, CTO Igor Bogudlov and vice president of research Liad Avraham - are ex-Israeli intelligence too. Also on the board is cofounding director and former Israeli prime minister Ehud Barak. They also have a significant American financial backer: Boston, Massachusetts-based Battery Ventures. According to two senior employees at companies in the Israeli surveillance industry, who spoke on the condition of anonymity, the venture capital business put in between $5 and $10 million, though Battery declined to comment on the nature of its investment, which is only  mentioned in brief on the company’s website.\n Paragon’s product will also likely get spyware critics and surveillance experts alike rubbernecking: It claims to give police the power to remotely break into encrypted instant messaging communications, whether that’s WhatsApp, Signal, Facebook Messenger or Gmail, the industry sources said. One other spyware industry executive said it also promises to get longer-lasting access to a device, even when it’s rebooted.\n The startup, founded in 2019, is quietly building up steam at a time when its ilk in the smartphone hackers-for-hire industry are under heavy fire. The Pegasus Project, a coalition of nonprofits and global publications, this month claimed to have uncloaked worldwide surveillance of journalists, lawyers and high-profile elected politicians by clients of Israel’s best known spyware provider NSO Group. The company’s CEO has rebuffed the claims made by the Project’s partners, saying it had no evidence that its tools were used to target those named in reports, from the wife of murdered journalist Jamal Khashoggi to French president Emmanuel Macron. The French government has already begun its investigation, but other administrations around the world are now being called on to probe just who was hacked by NSO’s spyware and why. Even before the Pegasus Project, Microsoft president Brad Smith warned the $12 billion industry as a whole represented a threat,  writing: “An industry segment that aids offensive cyberattacks spells bad news on two fronts. First, it adds even more capability to the leading nation-state attackers, and second, it generates cyberattack proliferation to other governments that have the money but not the people to create their own weapons. In short, it adds another significant element to the cybersecurity threat landscape.”\n A senior executive at Paragon, who declined to comment on the record, told  Forbes that he did not want to talk about its products. He said the company does not yet have customers. But, in an attempt to avoid the trouble NSO has had with some of its clients who were barred over misuse, the executive added that Paragon would only sell to countries that abide by international norms and respect fundamental rights and freedoms. Authoritarian or non-democratic regimes would never be customers, he added.\n  Two industry sources said they believed Paragon was trying to set itself apart further by promising to get access to the instant messaging applications on a device, rather than taking complete control of everything on a phone. One of the sources said they understood that Paragon’s spyware exploits the protocols of end-to-end encrypted apps, meaning it would hack into messages via vulnerabilities in the core ways in which the software operates.\n  The company’s staff, according to LinkedIn profiles, have strong backgrounds in surveillance, with its VP of operations and HR lead being ex-NSO, and many of its developers coming from Israel Defense Forces intelligence units. One of its software developers, Alon Weinberg, previously presented research on  hacking the software running on Intel and AMD chips at famous U.S. hacking conference Def Con.\n  With an American backer, it appears Paragon is going to try and crack American law enforcement agencies where others like NSO have failed. According to a LinkedIn profile, a 30-year veteran of Israeli intelligence, Menachem Pakman, has been employed to help find business in the U.S. There’s no indication that they have clients across the Atlantic yet, however.\n According to the corporate filing for the company, Battery invested via two of its venture capital vehicles in September 2019, indicating it helped launch the business, while its Israel-based vice president Aaron Rinberg is a board observer at Paragon. Battery, which has raised more than $9 billion since its founding in 1983, has claimed some hugely successful investments in its time, including Coinbase, Groupon, Splunk, SkullCandy and Pokémon Go creator Niantic. The company hadn’t commented on its investment in the Israeli smartphone surveillance game at the time of publication.\n John Scott-Railton, senior researcher at Citizen Lab at the University of Toronto’s Munk School, said that if the aim of Paragon’s business is to help American agencies target Americans, then it needs to be scrutinized. “Any American investor that is putting money into the industry right now, urgently needs serious scrutiny. We are going to need to know who their customers are. We’ve learned what happens when the industry operates in secrecy and says they care about protecting human rights,” he said. “The hack-for-hire industry has gone way far out on a legal limb.” The Paragon executive said the company would not disclose future customers.\n Paragon isn’t the first Israeli company to take American venture capital on launch. Toka, which focuses on helping law enforcement hack into Internet of Things devices like Amazon Echos for forensics or during property raids,  raised $12.5 million in 2018, in a round that included funding from Dell Technologies Capital and Andreessen Horowitz. NSO, meanwhile, was majority-owned by U.S. private equity firm Francisco Partners until a U.K. private equity company, Novalpina Capital, took control.\n  Paragon’s leadership are also in the interesting position of working for both cyber defense and offensive companies. The CEO Nurick is cofounder of Hunters.ai, a startup promising artificial intelligence that can hunt down hackers on a network and is backed by Microsoft’s investment arm M12. Schneorson is listed as a board member of that business and as an advisor for ZecOps, a mobile security business that has, in the past, uncovered phone hacks developed by surveillance businesses. (ZecOps CEO Zuk Avraham hadn’t responded to a request for comment at the time of publication.)", "posttime": "2021-07-30 07:58:11", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "whatsapp,super", "title": "Paragon：一家“黑掉 WhatsApp 和 Signal”的超级秘密监控初创公司", "title_en": "Paragon: A Super-Secretive Surveillance Startup That ‘Hacks WhatsApp and Signal’", "transed": 1, "url": "https://www.forbes.com/sites/thomasbrewster/2021/07/29/paragon-is-an-nso-competitor-and-an-american-funded-israeli-surveillance-startup-that-hacks-encrypted-apps-like-whatsapp-and-signal/", "via": "", "real_tags": ["whatsapp", "super"]}, {"category": "", "categoryclass": "", "imagename": "3793112fcebb7f68f1c790c8c7472484.jpg", "infoid": 1070543, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在周三的财报电话会议上，Facebook 首席执行官马克扎克伯格告诉投资者，该公司的下一个硬件发布将是与经典太阳镜供应商雷朋合作制造的“智能眼镜”。在对 Facebook 的一体化虚拟现实 (VR) 平台 Oculus Quest 的计划进行了长时间的讨论后，扎克伯格继续宣布雷朋。扎克伯格表示，社交媒体是 VR 真正的“杀手级应用”，并以 Oculus Quest 的数据为后盾：“Quest 上最受欢迎的应用是社交应用，这符合我们最初的论点，即虚拟现实将成为社交平台。 ”扎克伯格打算将尚未命名的智能眼镜作为垫脚石，而不是最终目标。他对它们的实际用途保持谨慎，只说眼镜“具有其标志性的外形，并且[让]你做一些非常整洁的事情”，而没有关于这些“整洁的东西”可能是什么的具体细节。由于 The Verge 于 2020 年 9 月首次发布的报道，我们确实知道该眼镜预计不会集成显示。如果没有显示功能，雷朋/Facebook 眼镜似乎可能与亚马逊属于同一类别Echo Frames 或 Lucyd Lyte——我们在 3 月份评测过的一副看起来很普通的太阳镜，带有集成的蓝牙配对和定向扬声器。扎克伯格将智能眼镜描述为不仅是我们所知的虚拟或增强现实的垫脚石，而且是他称之为元宇宙的东西。 “那么什么是元宇宙？它是一个虚拟环境 [就像] 一个实体互联网，你身处其中，而不仅仅是看着。我们相信这将成为移动互联网的继任者。”在警告说建立他的愿景不仅需要 Facebook 本身而且需要来自其整个合作伙伴生态系统的大量投资之后，他加倍强调其最终的重要性，说：“除了成为互联网的下一章之外，元节也将成为我们公司的下一个篇章。”", "note_en": "In an earnings conference call on Wednesday, Facebook CEO Mark Zuckerberg told investors that the company&#39;s next hardware launch will be &#34;smart glasses&#34; made in partnership with classic sunglasses vendor Ray-Ban.\n Zuckerberg segued into the Ray-Ban announcement following a lengthy discussion of Facebook&#39;s plans for Oculus Quest, its all-in-one virtual reality (VR) platform. Zuckerberg says that social media is the real &#34;killer app&#34; for VR, backing that up with data from Oculus Quest: &#34;The most popular apps on Quest are social, which fits our original thesis [that] virtual reality will be a social platform.&#34;\n Zuckerberg intends the as yet unnamed smart glasses to be a stepping stone, not an end goal. He remained cagey about their actual purpose, saying only that the glasses &#34;have their iconic form factor, and [let] you do some pretty neat things,&#34; with no concrete details about what those &#34;neat things&#34; might be.\n     We do know that the glasses aren&#39;t expected to have integrated display, thanks to reporting from The Verge on their initial  announcement in September 2020. Without display capabilities, the Ray-Ban/Facebook glasses seem likely to fall in the same category as Amazon&#39;s Echo Frames or  Lucyd Lyte—a mostly normal-looking pair of sunglasses with integrated Bluetooth pairing and directional speakers that we  reviewed in March. Zuckerberg describes the smart glasses as a stepping stone toward not only virtual or augmented reality as we know it, but something he calls the metaverse. &#34;So what is the metaverse? It&#39;s a virtual environment [like] an embodied Internet that you&#39;re inside of rather than just looking at. And we believe that this is going to be the successor to the mobile Internet.&#34;\n After warning that building his vision will require significant investment not only from Facebook itself but from its entire ecosystem of partners, he doubled down on its eventual importance, saying, &#34;In addition to being the next chapter of the Internet, the metaverse is also going to be the next chapter for us as a company.&#34;", "posttime": "2021-07-30 07:20:24", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "硬件,facebook,产品,hardware,眼镜", "title": "Facebook 的下一个硬件产品将是“智能”雷朋眼镜", "title_en": "Facebook’s next hardware product will be “smart” Ray-Ban glasses", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/facebooks-next-hardware-product-will-be-smart-ray-ban-glasses/", "via": "", "real_tags": ["硬件", "facebook", "产品", "hardware", "眼镜"]}, {"category": "", "categoryclass": "", "imagename": "37efef5b002f5e96c021942ee61187fd.jpg", "infoid": 1070542, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "马里兰大学的一个工程师团队制造了一个三指柔软的机械手，它足够灵活，能够操纵任天堂控制器上的按钮和方向键——甚至设法击败了超级马里奥兄弟的第一关。根据最近发表在《科学进展》杂志上的一篇论文，概念证明。同一个团队还使用与生产机械手相同的多材料 3D 打印工艺制造了两只柔软的机器龟（龟龟是 UMD 的官方吉祥物）。我们传统上认为机器人是由坚硬的刚性材料制成的，但软机器人的子领域采用了不同的方法。它试图用更灵活的材料制造机器人设备，以模仿在活体动物身上发现的特性。用柔软的材料制造机器人的整个身体可以获得巨大的优势，例如足够灵活，可以挤过狭窄的空间，在灾难发生后寻找幸存者。软机器人在假肢或生物医学设备方面也具有强大的潜力。即使是刚性机器人也依赖一些软部件，例如用作减震器的脚垫或柔性弹簧来储存和释放能量。哈佛研究人员在 2016 年建造了一个完全由柔性材料制成的受章鱼启发的软体机器人。但是软机器人更难精确控制，因为它们非常灵活。在“octobot”的情况下，研究人员用微流体电路代替了刚性电子电路。这种电路涉及通过电路的微通道调节水（液压）或空气（气动）的流量，而不是电力，使机器人能够弯曲和移动。尽管这个解决方案很巧妙，但它也带来了一系列挑战。这些包括高成本（需要洁净室设施）和制造这些微流体系统所需的时间，然后将它们作为一个整体与系统集成。 “最近，有几个小组试图利用流体回路来增强软机器人的自主性，”合著者鲁本·阿塞维多说。 “但构建这些流体回路并将其与机器人集成的方法可能需要数天到数周的时间，需要高度的体力劳动和技术技能。”作为一名本科生，Acevedo 在马里兰大学机械工程师 Ryan D. Sochol 的实验室工作，他的兴趣是超越手动将流体电路组件连接到软机器人，而是将这些功能直接嵌入到软机器人系统中。他的团队在 PolyJet 3D 打印中找到了答案，其中几个不同的材料层相互堆叠。打印机放下一层液体，让它凝固，然后放下下一层，依此类推。 “通过允许定制特定特征的材料特性以补充所需的功能，结合刚性不同的材料有助于提高性能，”Sochol 等人。在他们的论文中写道。隔膜和 O 形环等组件必须能够在操作过程中变形，因此使用柔软的类似橡胶的材料来制造它们，而选择更坚硬的类似塑料的材料来制造需要稳定的组件（流体通道、接入端口和结构外壳，例如）。最后，该团队在打印过程中使用水溶性材料作为脚手架，然后将其从外部和内部的空隙和通道中移除——首先用水溶解材料，然后手动移除任何剩余的脚手架材料。微流体控制的软机器人通常需要为每个独立操作的软执行器提供不同的控制输入。通过集成流体回路，UMD 团队可以通过在低、中和高之间改变压力强度来操作手。换句话说，单个流体源可以通过改变压力来发送不同的信号，因此每个手指都可以独立移动。更好的是，手和两个乌龟机器人的一步 3D 打印过程——包括软执行器（运动部件）、流体回路和机器人身体——只需要几个小时，而不是几天或几周。\n该团队通过让它玩超级马里奥兄弟来测试机械手的性能。为了让马里奥走路，团队使用了低压，所以只有第一根手指按下控制器。研究人员使用中等压力使马里奥奔跑，使用高压使手按控制器上的正确按钮使马里奥跳跃。至于他们为什么选择《超级马里奥兄弟》，索科尔告诉《科学美国人》，这是他小时候玩的第一款任天堂游戏。但这个选择不仅仅是怀旧的问题。游戏的时间和细节已经确定；机器人手只需要根据预编程的动作来计时。失败会带来实际后果：一个错误就会让马里奥丧命。手的表现如此出色，在不到90秒的时间里就成功闯关了第一关。 “我们免费共享我们所有的设计文件，以便任何人都可以轻松下载、按需修改和 3D 打印——无论是使用他们自己的打印机还是通过像我们这样的打印服务——我们工作中的所有软机器人和流体电路元件，”Sochol 说，他估计使用 GitHub 上团队的软件打印自己的软机器人将花费大约 100 美元。 “我们希望这种开源 3D 打印策略将扩大具有集成流体回路的软机器人的可访问性、传播性、可重复性和采用范围，进而加速该领域的进步。”", "note_en": "A team of engineers at the University of Maryland has built a three-fingered soft robotic hand that is sufficiently agile to be able to manipulate the buttons and directional pad on a Nintendo controller—even managing to beat the first level of  Super Mario Bros. as proof of concept, according to  a recent paper published in the journal Science Advances. The same team also built two soft robotic turtles (the terrapin turtle is UMD&#39;s official mascot) using the same multimaterial 3D-printing process that produced the robotic hand.\n We traditionally think of robots as being manufactured out of hard, rigid materials, but the subfield of soft robotics takes a different approach. It seeks to build robotic devices out of more flexible materials that mimic the properties of those found in living animals. There are huge advantages to be gained by making the entire body of a robot out of soft materials, such as being flexible enough to squeeze through tight spaces to hunt for survivors after a disaster. Soft robots also hold strong potential as prosthetics or biomedical devices. Even rigid robots rely on some soft components, such as foot pads that serve as shock absorbers or flexible springs to store and release energy.\n Harvard researchers built an  octopus-inspired soft robot in 2016 that was constructed entirely out of flexible materials. But soft robots are more difficult to control precisely because they are so flexible. In the case of the &#34;octobot,&#34; the researchers replaced the rigid electronic circuits with microfluidic circuits. Such circuits involve regulating the flow of water (hydraulics) or air (pneumatics), rather than electricity, through the circuit&#39;s microchannels, enabling the robot to bend and move.\n    Although this solution is ingenious, it brings its own set of challenges. These include the high cost (clean room facilities are required) and time necessary to fabricate those microfluidic systems and then integrate them with the system as a whole. &#34;Recently, several groups have tried to harness fluidic circuits to enhance the autonomy of soft robots,&#34;  said co-author Ruben Acevedo. &#34;But the methods for building and integrating those fluidic circuits with the robots can take days to weeks, with a high degree of manual labor and technical skill.&#34;\n As an undergraduate, Acevedo worked in the lab of University of Maryland mechanical engineer Ryan D. Sochol, who was interested in moving beyond having to manually connect fluidic circuitry components to soft robots in favor of embedding these functions directly in the soft robotic systems. His team found the answer in PolyJet 3D printing, in which several different layers of materials are stacked on top of each other. The printer sets down one liquid layer, lets it solidify, then sets down the next layer, and so on.\n  &#34;The incorporation of materials that differ in rigidity serves to enhance performance by allowing the material properties of specific features to be tailored to complement desired functionalities,&#34; Sochol  et al. wrote in their paper. Components like diaphragms and O-rings must be able to deform during operation, so a soft rubber-like material was used to make them, while a more rigid, plastic-like material was chosen to make components that need to be stable (fluidic channels, access ports, and structural casings, for instance). Finally, the team used a water-soluble material to serve as scaffolding during the printing process, which was then removed from both the exterior and internal voids and channels—first by dissolving the stuff with water, then manually removing whatever scaffolding material remained.\n    Microfluidically controlled soft robots typically require distinct control inputs for every independently operated soft actuator. By integrating the fluidic circuit, the UMD team could operate the hand by varying the pressure strength between low, medium, and high. In other words, a single source of fluid could send different signals just by changing the pressure, so that each finger could move independently. Even better, the one-step 3D-printing process for the hand and the two turtle-bots—encompassing soft actuators (moving parts), the fluidic circuits, and robot body—took a matter of hours, not days or weeks.\n The team tested the performance of the robotic hand by having it play  Super Mario Bros. To make Mario walk, the team used a low pressure, so only the first finger pressed the controller. The researchers used a medium pressure to make Mario run and a high pressure to make the hand press the correct button on the controller to get Mario to jump.\n  As for why they chose  Super Mario Bros.,  Sochol told Scientific American that it was the very first Nintendo game he had played as a child. But the choice wasn&#39;t just a matter of nostalgia. The timing and specifics of the game are well-established; the robot hand simply needed to time its responses in accordance with the preprogrammed moves. And there are actual consequences for failure: a single mistake will cost Mario a life. The hand performed so well, it was able to successfully beat the first level of the game in less than 90 seconds.\n &#34;We are freely sharing all of our design files so that anyone can readily download, modify on demand, and 3D print—whether with their own printer or through a printing service like us— all of the soft robots and fluidic circuit elements from our work,&#34;  said Sochol, who estimates that printing one&#39;s own soft robots would cost about $100 using the team&#39;s software on GitHub. &#34;It is our hope that this open-source 3D printing strategy will broaden accessibility, dissemination, reproducibility, and adoption of soft robots with integrated fluidic circuits and, in turn, accelerate advancement in the field.&#34;", "posttime": "2021-07-30 07:20:06", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "马里奥,打印,兄弟,soft,机器人", "title": "这款 3D 打印的柔软机械手击败了超级马里奥兄弟的第一关。", "title_en": "This 3D-printed soft robotic hand beat the first level of Super Mario Bros.", "transed": 1, "url": "https://arstechnica.com/science/2021/07/this-3d-printed-soft-robotic-hand-beat-the-first-level-of-super-mario-bros/", "via": "", "real_tags": ["马里奥", "打印", "兄弟", "soft", "机器人"]}, {"category": "", "categoryclass": "", "imagename": "68bca27301d52fdacf54b38bee9fe938.jpg", "infoid": 1070541, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在本周早些时候向员工发表的公开声明中，动视暴雪首席执行官鲍比科蒂克表示，该公司正在审查政策和程序，以帮助促进更加尊重和包容的工作场所。为了帮助实现这一目标，该公司保留了著名律师事务所 WilmerHale 的服务，这家律师事务所帮助亚马逊阻止其工人加入工会。考虑到正在努力将游戏工人工会化，这种伙伴关系有点令人担忧。在一个经常因歧视​​性做法、性骚扰、严酷的紧缩条件和频繁的大规模裁员而受到抨击的行业中，工会是一个热点问题。正如加利福尼亚州对动视暴雪的诉讼所表明的那样，视频游戏公司在创造充其量是不舒服的，最糟糕的是完全敌对的工作环境方面享有盛誉。这正是游戏工人工会运动在过去几年中获得关注的原因。因此，当动视暴雪（一家目前因其歧视性做法和猖獗的性骚扰问题而受到抨击的公司）聘请以破坏工会而闻名的律师事务所威尔默黑尔（WilmerHale）时，他的头转过头来，眉头紧锁。 WilmerHale 是该国最负盛名的律师事务所之一。它实际上是两家律师事务所的合并。波士顿的 Hale and Dorr 成立于 1918 年，以在 1950 年代的陆军麦卡锡听证会上代表美国陆军公益组织以及在 1974 年美国诉尼克松案中代表理查德·尼克松总统而闻名。然后是 1962 年在华盛顿成立的 Wilmer, Cutler &amp; Pickering。 创始合伙人 Lloyd Cutler 曾担任吉米卡特总统和威廉克林顿总统的顾问，并应约翰肯尼迪总统的要求于 1963 年成立了法律下的民权律师委员会. 肯尼迪。这两家传奇公司于 2004 年合并成立了 Wilmer Cutler Pickering Hale 和 Dorr，称为 WilmerHale。合并后的实体共同总部位于华盛顿特区和波士顿，在美国、欧洲和亚洲设有办事处。基本上，WilmerHale 是一家强大的大型律师事务所，接受强大的客户。合并后公司的律师是受雇调查安然和世通财务状况的特别调查委员会的成员。 Wilmer, Cutler &amp; Pickering 代表被指控从大屠杀中获利的瑞士银行以及被指控在纳粹时代剥削强迫劳动的德国公司。 WilmerHale 还以吸引关注公共服务，尤其是美国政府服务的律师而闻名。负责动视暴雪政策审查流程的合伙人斯蒂芬妮·阿瓦基安 (Stephanie Avakian) 在特朗普政府期间担任证券交易委员会的执法主管。 Jamie Gorelick 是克林顿政府期间的美国副检察长，自 2003 年以来一直是 WilmerHale 的合伙人，自 2012 年以来一直是亚马逊董事会的成员。正是 Gorelick 与亚马逊的联系以及 WilmerHale 宣传的反工会服务，给予公司破坏工会的声誉。今年早些时候，亚马逊在阿拉巴马州的工人在一场公司主导的运动之后投票反对加入工会，该运动包括冗长的“信息会议”，散布反工会言论和标语“不交会费”的标语，表明提议的工会只对在不提供任何实质性支持的情况下支付工人费用。\n此次合作也恰逢动视暴雪员工在公开诉讼的支持下，开始集体谈论他们公司的政策。在 Bobby Kotick 宣布聘请 WilmerHale 之前，数千名员工签署了一封公开信，谴责该公司对诉讼中提出的指控的初步反应。随后是周三的罢工，其中动视暴雪全球员工停止工作数小时。对和平示威的支持从游戏社区的各个角落涌入。整体情况一直是重新讨论工会价值和重要性的动力。虽然动视暴雪与 WilmerHale 的关联涉及人力资源咨询，但该律师事务所的声誉加上游戏发行商的反工会倾向是一个令人不安的组合。根据UppercutCrit 本周早些时候的一份报告，当在最近一次关于加州诉讼的全体会议上提出工会化的话题时，动视暴雪高管约书亚陶布据称建议员工“最好的保护方式是联系你的员工。主管、热线和渠道。”但正如报告所显示的那样，求助于人力资源之类的事情并不总是对受影响的员工有效。今天早上，UppercutCrit 报道说，动视已经取消了进一步的全体员工会议，再次建议员工在解决问题时求助于内部资源。在回应 Kotaku 关于游戏公司与律师事务所之间关系的询问时，一位动视代表说：“WilmerHale 拥有丰富的经验，通过改进与歧视、骚扰和报复问题相关的政策和程序，帮助组织加强工作环境。”该律师事务所尚未回应我们的置评请求。", "note_en": "In a   public statement addressed to employees earlier this week, Activision Blizzard CEO Bobby Kotick said the company was reviewing policies and procedures to help promote a more respectful and inclusive workplace. To help accomplish that, the company has retained the services of prestigious law firm WilmerHale, which is the same law firm   helping Amazon keep its workers from unionizing. Considering ongoing efforts to unionize game workers, the partnership is a little concerning.\n  In an industry that’s constantly under fire for discriminatory practices, sexual harassment, grueling crunch conditions, and frequent mass layoffs, unionizing is a hot-button issue. As the   state of California’s lawsuit against Activision Blizzard demonstrates, video game companies have a well-earned reputation for creating work environments that are at best uncomfortable, at worst downright hostile. That’s exactly why the   game workers unionization movement has been gaining traction over the past several years.\n So when Activision Blizzard, a company currently under fire for its discriminatory practices and rampant sexual harassment issues, hires WilmerHale, a law firm with a reputation for union-busting, heads turn and brows furrow.\n    WilmerHale is one of the most prestigious law firms in the country. It’s actually a combination of two law firms. There’s Boston’s Hale and Dorr, founded in 1918, known for representing the U.S. Army pro-bono in the   Army-McCarthy hearings in the 1950s as well as President Richard Nixon in 1974’s   United States v. Nixon. Then there’s Wilmer, Cutler &amp; Pickering, founded in D.C. in 1962. Founding partner Lloyd Cutler served as an advisor to Presidents Jimmy Carter and William Clinton, and founded the   Lawyers’ Committee for Civil Rights Under Law in 1963 at the request of President John F. Kennedy. The two storied firms combined to form Wilmer Cutler Pickering Hale and Dorr, known as WilmerHale, in 2004. The combined entity is co-headquartered in D.C. and Boston, with offices across the U.S., Europe, and Asia.\n  Basically, WilmerHale is a big, powerful law firm that takes on big, powerful clients. Lawyers from the combined firm were part of special investigative committees hired to look into the finances of both Enron and Worldcom. Wilmer, Cutler &amp; Pickering represented Swiss banks accused of profiting from the Holocaust as well as German companies accused of exploiting forced labor during the Nazi era.\n   WilmerHale also has a reputation for attracting lawyers with an eye for public service, particularly U.S. government service. Partner Stephanie Avakian, who is heading up the Activision Blizzard policy review process, served as the Securities and Exchange Commission’s enforcement director during the Trump administration. Jamie Gorelick, Deputy Attorney General of the United States during the Clinton administration, has been a WilmerHale partner since 2003—and a member of Amazon’s board of directors since 2012.\n It’s Gorelick’s association with Amazon as well as WilmerHale’s   advertised anti-union services, that give the firm its union-busting reputation. Earlier this year,   Amazon workers in Alabama voted against unionizing following a company-led campaign that included lengthy “information meetings” spreading anti-union rhetoric and signs with the slogan “Do it without dues,” suggesting the proposed union was only interested in taking workers’ fees without offering any substantial support.\n  The partnership also comes at a time when Activision Blizzard employees, empowered by the very public lawsuit, have begun speaking out en masse about their companies policies. Prior to Bobby Kotick’s announcement about bringing on WilmerHale,   thousands of employees signed a public letter condemning the company’s initial reaction to the allegations raised in the lawsuit. This was followed   by Wednesday’s walkout, in which Activision Blizzard employees around the world stopped working for several hours. Support for the peaceful demonstration   poured in from all corners of the gaming community. The situation as a whole has been the impetus for renewed conversations about the value and importance of unionizing.\n While Activision Blizzard’s association with WilmerHale involves HR consulting, the law firm’s reputation plus the game publisher’s anti-union leanings are a troubling combination. According to a   report earlier this week from  UppercutCrit, when the topic of unionization was brought up in a recent all-hands meeting regarding the California lawsuit, Activision Blizzard executive Joshua Taub allegedly advised employees that “the best way for protection is reaching out to your supervisors, hotline and avenues.” But as reporting has shown, turning to things like HR   does not always work out for the affected employees. This morning    UppercutCrit reports that Activision has canceled further all-hands meetings, once again suggesting employees turn to in-house resources with their problems.\n  Responding to  Kotaku’s inquiry regarding the relationship between the game company and the law firm, an Activision representative said,“WilmerHale has extensive experience helping organizations strengthen their workplace environment by making improvements around policies and procedures related to discrimination, harassment, and retaliation issues.” The law firm has yet to respond to our request for comment.", "posttime": "2021-07-30 07:19:41", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,暴雪,blizzard", "title": "动视暴雪聘请亚马逊联盟破坏公司中期诉讼", "title_en": "Activision Blizzard Hires Amazon Union Busting Firm Mid Lawsuit", "transed": 1, "url": "https://kotaku.com/activision-blizzard-hires-union-busting-firm-as-workers-1847386654", "via": "", "real_tags": ["amazon", "亚马逊", "暴雪", "blizzard"]}, {"category": "", "categoryclass": "", "imagename": "a6c85d0ac1c30fddc1aa56ad691c4774.jpg", "infoid": 1070540, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "法学博士 Aron Solomon 是 Esquire Digital 的战略主管和 Today&#39;s Esquire 的编辑。他曾在麦吉尔大学和宾夕法尼亚大学教授创业，是法律技术加速器 LegalX 的创始人。对于那些不熟悉上限表的人来说，它是一份拥有您公司证券的清单，其中包括您公司的股票、期权等。一个清晰而简单的上限表应该可以快速表明谁拥有什么以及他们拥有多少。由于各种原因（有时是缺乏经验或糟糕的建议），太多的股权持有人经常发现公司的资本化信息不透明且不易获取。这对于能够长期生存的一小部分初创公司尤其重要，因为增长导致了更为复杂的上限表。良好的启动卫生的一个关键部分是始终拥有一个干净且更新的上限表。由于没有固定格式并且上限表通常不公开，因此它们通常是孤立的而不是协作的。在过去的二十年里，作为加速器的创始人、风险合作伙伴和政府资助的初创公司发射台的高级顾问，我曾为数百家初创公司提供过咨询服务，因此对我来说，上限表很亲近。我也一直站在股东一方，可以向你保证，几乎没有什么比沟通不畅更能破坏股东和初创公司之间的信任的了，尤其是在诸如上限表的当前状态之类的问题上。我真的很喜欢将上限表作为公开公司记录的想法，因为对公司的价值主张很明确。从初创公司创建上限表开始，就很容易出现不准确、摩擦和错误。这在实践中意味着初创公司可能会在与上限表相关的问题上花钱，而这些问题应该花在其他事情上。从法律程序的角度来看，被引入来帮助解决这些问题的律师事务所必须处理繁琐的后端工作，因此无论是初创公司还是律师事务所，法律时间都不是很有价值。股权持有人的价值主张同样清晰。所有股权持有人都对公司的资本化信息拥有一般和合法的利益。他们有权获得这些信息，他们可能出于各种原因需要这些信息（包括，如果事情变得非常糟糕，股东的受屈行为）。因此，让这些信息清晰易懂是对股权持有人的一种服务，也可以鼓励更多的投资，尤其是来自经验不足的投资者。\n当我想象这个项目在未来几年会变成什么样时，我会回想起 2013 年底，当时 Y Combinator 宣布了 SAFE（未来股权的简单协议）。我认为 SAFE 是一个很好的类比，因为没有人知道它是什么，人们想知道这对于初创公司来说是否是一个很好的拥有而不是必须拥有。但最终的结果是早期融资过程的显着改善。虽然该联盟的创始人包括摩根士丹利的 Shareworks、LTSE Software 和 Carta，但它也非常重视 Big Law，包括 Cooley、Goodwin Procter、Wilson Sonsini Goodrich &amp; Rosati、Orrick、Gunderson Dettmer、Latham &amp; Watkins 和 Fenwick &amp; West。 10 名创始成员。那么，在 2020 年收入超过 100 亿美元的 7 家律师事务所合作为初创公司开发开放式限额表产品的真正动机是什么？交易流程。 Big Law 几十年来一直在努力与初创公司建立关系，在这个阶段，初创公司与一家庞大且昂贵的律师事务所打交道毫无意义。他们建立创业项目的努力经常失败，并得到了褒贬不一的评价。他们也对自助服务过于重视，而对“我们将以一小部分成本为您提供我们常规的 Big Law 服务水平，以防万一您做得大并且有一天可以支付我们的常规费用。”因此，这些公司正试图通过构建这种对企业家友好的技术，将自己与其他大律师区分开来。该联盟已经制定了开放上限表的初始版本。真正的问题是，这是否会像 SAFE 那样成为一件大事，或者它是否会成为寻找真正问题的虚荣解决方案。我最好的猜测是，如果这个联盟处理好所有关系，不会变得贪婪，并且明白这里有一个社会公益的组成部分在起作用，那么这可能很快就会像外管局一样具有影响力。", "note_en": "Aron Solomon, J.D., is the head of Strategy for  Esquire Digital and the editor of  Today’s Esquire. He has taught entrepreneurship at McGill University and the University of Pennsylvania, and was the founder of LegalX, a legal technology accelerator.\n  For those unfamiliar with a cap table, it’s a list of who owns your company’s securities, which includes your company shares, options and more. A clear and simple cap table should quickly indicate who owns what and how much of it they own. For a variety of reasons (sometimes inexperience or bad advice) too many equity holders often find companies’ capitalization information to be opaque and not easily accessible.\n This is particularly important for the small percentage of startups that survive in the long term, as growth makes for far more complicated cap tables.\n  A critical part of good startup hygiene is to always have a clean and updated cap table. Since there is no set format and cap tables are generally not out in the open, they are often siloed rather than collaborative.\n Cap tables are near and dear to me as someone who has advised hundreds of startups over the past two decades as the founder of an accelerator, a venture partner and a senior adviser at a government-funded startup launchpad. I have been on the shareholder side of the equation as well and can assure you that pretty much nothing destroys trust between shareholders and startups quicker than poor communication, especially around issues such as the current status of the cap table.\n  I really like the idea of a cap table being an open corporate record, because the value proposition to the companies is clear. From the time a startup creates a cap table, it’s prone to inaccuracy, friction and mistakes. What this means in practice is that startups may spend money on cap-table-related issues that they should be spending on other things. From a legal process perspective, the law firm that is brought in to help with these issues has to deal with tedious back-end work, so the legal time isn’t high value for either the startup or the law firm.\n The value proposition for equity holders is equally clear. All equity holders have a general and legal interest in a company’s capitalization information. They have the right to this information, which they may need for a variety of reasons (including, if things ever get really bad, an aggrieved shareholder action). So making this information clear and easily accessible is a service to equity holders and can also encourage more investment, especially from less experienced investors.\n When I imagine what this project could become in the next couple of years, I think back to late 2013, when Y Combinator announced the SAFE (simple agreement for future equity). I think the SAFE is a good analogy here, as no one knew what it was and people wondered if this was a nice-to-have rather than a must-have for startups. But the end result was a dramatic improvement in the early-stage capital-raising process.\n While the coalition’s founders include Morgan Stanley’s Shareworks, LTSE Software and Carta, it’s also heavy on Big Law, with Cooley, Goodwin Procter, Wilson Sonsini Goodrich &amp; Rosati, Orrick, Gunderson Dettmer, Latham &amp; Watkins, and Fenwick &amp; West rounding out the group of 10 founding members.\n So what’s the real motivation of seven law firms, which together saw revenue of over $10 billion in 2020 to collaborate on an open cap table product for startups? Deal flow.\n Big Law has been trying for a couple of decades to build relationships with startups at the stage where it makes no sense for a startup to be dealing with a massive and expensive law firm. Their efforts to build startup programs have often fallen short and received mixed reviews. They have also been far too heavy on the self-serve and too light on the “we’re going to give you our regular Big Law level of services at a small fraction of the costs just in case you make it big and can one day pay our regular fees.” So these firms are trying to separate themselves from the rest of the Big Law pack by building this entrepreneur-friendly tech.\n The coalition has already produced its initial version of the open cap table. The real question is whether this is going to be a big deal, as the SAFE was, or whether it’s going to be a vanity solution in search of a real problem. My best guess is that if this coalition gets all the relationships right, doesn’t get greedy and understands that there is a social good component at play here, this could be, reasonably quickly, as impactful as the SAFE was.", "posttime": "2021-07-30 07:19:12", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "open", "title": "介绍 Open Cap Table Coalition", "title_en": "\n\t\t\t\tIntroducing the Open Cap Table Coalition\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/29/introducing-the-open-cap-table-coalition/", "via": "", "real_tags": ["open"]}, {"category": "", "categoryclass": "", "imagename": "81894ccd064d428711d8775be9526c2e.jpg", "infoid": 1070539, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "拜登总统周四宣布，所有文职联邦雇员必须接种冠状病毒疫苗，否则必须接受定期检测、保持社交距离、戴口罩并限制大多数旅行。拜登在东厅说：“我们都希望我们的生活恢复正常，而全面接种疫苗的工作场所将使这一切更快、更成功地发生。” “我们都知道我们的直觉。通过激励和授权，我们可以发挥巨大作用并挽救很多生命。”联邦政府雇佣了超过 400 万美国人，所有人都需要证明已完全接种疫苗，以避免在工作时戴口罩，无论他们在该国的哪个国家工作，并每年接受一次或两次筛查测试星期。总统还指示国防部研究如何以及何时将冠状病毒疫苗添加到所有军人所需的疫苗接种清单中。该公告标志着他首次建议在三种联邦授权的疫苗中的任何一种获得食品和药物管理局的完全批准之前，可以对现役军人进行授权。他呼吁各州、领地和地方政府向仍未接种疫苗的美国人支付 100 美元以接种疫苗。拜登先生在一次恳求演讲中宣布新的任务，是为了重新设定人们对几周前他认为已经得到控制的健康祸害的期望的一部分。 7 月 4 日，白宫将国庆节庆祝为“独立于 Covid-19”的日子。但是现在，Delta 变种正在席卷未接种疫苗的社区，威胁要取消拜登政府在前六个月为阻止冠状病毒传播而取得的进展。大约一半的美国人已经完全接种了疫苗，但从早春开始，接种疫苗的速度明显下降。最近的研究表明，完全接种疫苗的人可以免受 Covid-19 最坏结果的影响，包括那些涉及 Delta 变体的结果。而病例、住院和死亡人数仍然只是其毁灭性的冬季高峰期的一小部分。 “在开始回落之前，病例会进一步上升，”拜登周四表示，降低了对即将发生的事情的预期。 “正如你所知道的那样，这是一个挑战。”\n拜登先生承认这个消息令人沮丧。 “我知道我们希望这将是一条没有问题或新挑战的简单明了的路线，但这不是现实生活，”他说。周二，疾病预防控制中心修改了其口罩指南，建议即使是接种过疫苗的人也应该在该病毒肆虐的地区的公共室内场所恢复戴口罩。一些州和市政当局迅速更新了自己的口罩规定，而另一些则表达了愤怒。华盛顿特区市长穆里尔·鲍泽 (Muriel Bowser) 周四表示，周六将重新实施室内戴口罩规定，以符合新的联邦指导方针。对于担心突破性病例的接种疫苗的美国人，拜登先生重申，大流行病属于未接种疫苗的人群之一，没有必要进行加强注射。疾病控制与预防中心一直在追踪导致住院和死亡的突破性感染，该主任本周表示，该机构正在对疫情进行集群调查。 “截至目前，我的医疗顾问说答案是否定的，”他谈到加强注射时说。 “现在没有美国人需要助推器了。但如果科学告诉我们需要助推器，我们就会这样做。”政府正在加紧努力，说服未接种疫苗的美国人接种疫苗。拜登政府呼吁各州、领地和地方政府向仍未接种冠状病毒疫苗的美国人支付 100 美元以接种疫苗。拜登先生周四宣布，现在将为中小企业提供带薪休假让他们的家人（包括他们的孩子）接种疫苗的费用得到报销。一些专家，特别是在疫苗接种运动的早期，对花钱让人们接种疫苗的想法表示担忧，担心这可能会被认为与疫苗本身带来巨大好处的信息不符。拜登先生还呼吁全国各地的学区在未来几周内至少开设一个临时疫苗接种诊所，目标是提高 12 岁及以上儿童的疫苗接种率。\n全国其他政府也开始实施类似的安排，因为传染性极强的 Delta 变种导致最近几周病例数量激增。纽约市将要求所有 300,000 名城市雇员接种疫苗或接受每周检测，纽约州将要求数万名州雇员出示疫苗接种证明或接受每周检测，并将要求面向患者的医护人员在国营医院将接种疫苗作为其就业条件。加州还公布了一项要求州雇员接种疫苗的计划。根据周三发给《纽约时报》的一份声明，北卡罗来纳州卫生与公共服务部将要求在 9 月 30 日之前在国有设施中的所有工人和志愿者完全接种疫苗或获得批准的医疗或宗教豁免。官员们没有回答有关豁免者是否需要接受检测的问题。退伍军人事务部将要求其 115,000 名前线医护人员在未来两个月内接种冠状病毒疫苗。但公共卫生官员希望，未接种疫苗的人可能会面临额外负担，这将有助于说服更多人接种疫苗。熟悉拜登先生声明的人士表示，这是关于如何让大多数联邦工作人员重返办公室的长期讨论的一部分，在过去近一年半的时间里，数十万人因大流行而在家工作。一个团队几个月来一直在制定该计划，试图兼顾员工的担忧和保持政府运作的必要性。官员们面临的一个问题是如何要求接种疫苗，同时又不会促使关键员工辞职，从而破坏政府的使命。华盛顿——拜登政府呼吁各州、领地和地方政府向仍未接种冠状病毒疫苗的美国人支付 100 美元，以便他们接种疫苗。此举是因为人们越来越担心全国范围内不断增加的病例，并且政府已将其战略转移到更个性化的方法上。美国财政部周四表示，用于支付疫苗奖励金的资金可能来自提供给各州和城市的 3500 亿美元救助资金，作为国会 3 月批准的经济救助计划的一部分。该激励措施旨在“提高疫苗接种率、保护社区和挽救生命”。\n政府还在加紧努力，让公司让员工有时间接种疫苗。财政部和国税局表示，雇主可以申请税收抵免，以支付支付给带家人接种疫苗或照顾正在从疫苗接种中恢复的家庭成员的工人的工资。自雇工人也有资格获得税收抵免。该计划扩展了 4 月份推出的一项计划，该计划提供带薪休假税收抵免，以抵消员工少于 500 人的公司因为接种疫苗的员工提供带薪时间而产生的成本。拜登政府一直在与一些州就如何使用救济金争论不休，但今年早些时候发布了指导方针，明确表示它可以用于预计会增加选择接种疫苗的人数的计划。财政部表示，它将为各州和城市提供技术援助，帮助他们利用这笔资金在社区中加强疫苗接种，并将与卫生和公共服务部合作。各州和城市一直在采取创造性的方法，例如彩票，鼓励人们接种疫苗。然而，一些专家，尤其是在疫苗接种运动的早期，对花钱让人们接种疫苗的想法表示担忧，担心这可能会被认为与疫苗本身带来巨大好处的信息不符。该想法的反对者还质疑向人们支付费用是否是鼓励人们接种疫苗的最佳资金用途。纽约市市长比尔·德布拉西奥 (Bill de Blasio) 本周表示，该市将开始提供 100 美元的付款，作为激励计划的一部分，以鼓励更多人接种疫苗。该计划预计将于周五开始。 “我认为当有人说这里给你 100 美元时，这会产生很大的影响，”德布拉西奥先生说。\n圣地亚哥州立大学研究疫苗犹豫的人类学家 Elisa Sobo 博士说，支付可能是一种激励，但表示不太可能影响每个未接种疫苗的人。 “有些人会觉得这个提议很侮辱人；其他人会用它作为疫苗不好的‘证据’，”她说。但是，她补充说，“有很多人会对 100 美元说‘为什么不’。一些直到现在还持观望态度的人会认为 100 美元是放弃它的一个很好的理由。”在 5 月发布的指导意见中，财政部表示，救济资金可用于鼓励接种疫苗，“只要此类成本与预期的公共健康利益成比例合理”。拜登总统正在推动国会将住宅驱逐禁令第二次延长一个月，这是一项长期的请求，需要争取时间来支持一项因延误和繁文缛节而困扰的 470 亿美元租金减免计划。据几位知情人士透露，将责任推给国会的决定——就在冻结期结束前两天——让民主党领导层感到意外，本周匆忙通过语音投票通过延期的尝试预计将失败。在租户权利团体的压力下，白宫官员同意将美国疾病控制与预防中心发布的禁令延长一个月，就在之前的 6 月 30 日到期日之前。现在冻结定于周六到期。上个月，最高法院驳回了房东的挑战，称将允许暂停按计划持续到 7 月 31 日，以便财政部和各州有时间向房东支付现金，以支付租户未支付的租金。疫情期间支付。但法官布雷特·卡瓦诺 (Brett M. Kavanaugh) 在同意意见中写道，未来任何延长暂停令都需要国会采取行动。\n周四，拜登的新闻秘书珍·帕萨基 (Jen Psaki) 以全国冠状病毒感染率急剧上升为由，敦促国会将冻结期再延长一个月，以避免出现健康和驱逐危机。她在一份声明中写道：“鉴于最近 Delta 变种的传播，包括那些最有可能面临驱逐和缺乏疫苗接种的美国人，拜登总统将强烈支持 CDC 进一步延长驱逐令的决定。” “不幸的是，最高法院已经明确表示，此选项不再可用。”她补充说，拜登先生“呼吁国会立即延长驱逐令，以保护这些脆弱的租房者及其家人。”民主党国会助手说，请求的最后时刻实际上确保了这样的努力不会成功。一种快速通过延期的快速方法，通过称为一致同意的程序，可以通过单一的反对票来阻止。 “我不可能支持这一点。首先，这是一个坏主意，”宾夕法尼亚州参议员帕特里克·J·图米说，这反映了许多共和党人的观点。 “业主有权采取行动。他们需要追索未付租金。”根据美国财政部上周公布的统计数据，拜登政府在联邦禁令到期时阻止危机的努力在 6 月份获得了温和的动力，290,000 名租户获得了 15 亿美元的大流行救济。但是，两项大流行救助计划提供的现金流动仍然缓慢，并受到州一级混乱的阻碍，这可能危及过去一年拖欠租金的租户。到目前为止，在 470 亿美元的计划中，仅分配了约 30 亿美元，帮助了约 600,000 名租户。\n最近几天，白宫官员一直在通过电话向纽约和其他尚未开始分配援助的州的官员施加压力，要求他们加快行动。 “任何州或地方都没有理由不立即部署国会拨出的资源来满足如此多美国人的这一迫切需求，”普萨基女士说。欧盟 27 个成员国现在每 100 人接种的冠状病毒疫苗剂量比美国多，这又是一个迹象，表明整个欧盟的疫苗接种在整个夏季都保持了一定的速度，而在美国则停滞了数周.根据《我们的世界数据》编制的最新疫苗接种数据，截至周二，欧盟国家每 100 人接种了 102.66 剂疫苗，而美国接种了 102.44 剂。本月，欧盟也首次注射超过美国；目前，整个集团有 58% 的人接受了注射，而美国为 56.5%。最新数据与今年疫苗接种运动的早期阶段形成鲜明对比，当时欧盟国家面临疫苗短缺和交付延迟的问题，羡慕美国、英国和以色列最初取得的更成功的努力。但欧盟现在正在以比大多数发达国家更快的速度为其人口接种疫苗。该集团超过 70% 的成年人现在至少接种了一剂冠状病毒疫苗。欧盟委员会主席乌尔苏拉·冯德莱恩表示，这一成就使欧盟国家“跻身世界领袖之列”。\n“追赶过程非常成功，”她在周二的一份声明中说。由于美国许多州的疫苗接种活动受到广泛的反疫苗情绪的影响，欧盟国家已经能够在较少阻力的情况下对其人口进行免疫接种。根据 5 月份在整个欧盟进行的一项公开调查，该集团约有 75% 的居民同意疫苗是结束冠状病毒大流行的唯一途径。然而，Delta 变体的传播增​​加了新的紧迫性。荷兰和葡萄牙等国家的病例激增，法国和西班牙等国的住院人数增加，促使官员试图加快最近几周略有放缓的疫苗接种运动。 “各国在今年上半年曾试图延长第一剂和第二剂之间的间隔，但现在他们必须将间隔减少到最小，间隔尽可能短，”欧洲中心主任安德里亚·阿蒙疾病预防控制中心说，本月。该中心上周表示，Delta 变体现在在该集团的大多数国家中占主导地位。包括法国和意大利在内的国家已经宣布了新的疫苗要求，以试图加快接种速度，需要提供疫苗接种证明或阴性测试才能进入大多数公共室内场所。法国总统埃马纽埃尔·马克龙 (Emmanuel Macron) 在本月宣布这些措施时表示，其目标是“限制未接种疫苗的人而不是所有人”。\n由于一些欧盟国家的运动略有减少或趋于平稳，卫生官员也敦促年轻群体接种疫苗。 “我们非常关注老年人，这在年轻人中留下了一种非常强烈的看法，即他们没有风险，或者如果他们有风险，那就是非常温和，”人类学家和伦敦的创始人海蒂拉尔森说。基于疫苗信心项目，该项目跟踪世界各地关于免疫接种的意见。法国公共卫生研究中心 Inserm 驻巴黎的流行病学家 Vittoria Colliza 说，许多人群中的疫苗饱和度很高，但大部分人甚至还没有接种过一剂疫苗。她补充说，如果免疫接种未能跟上，可能必须重新实施新的锁定限制以阻止 Delta 变体的传播。 “他们已经在增加了，”科利扎博士谈到疫苗接种时说，尤其是在年轻人中。 “但令人担忧的是，到 8 月底，Delta 变体将开始全面影响我们的生活。”波多黎各州长周三宣布，该领土内的所有公职人员都必须接种冠状病毒疫苗或每周接受一次检测，加入越来越多的州、市政当局、公司和联邦政府的名单，这些州、市政当局、公司和联邦政府都实施了某种形式的疫苗要求。州长 Pedro R. Pierluisi 在 Twitter 上表示，政府雇员必须在 8 月 16 日之前接种第一针疫苗，并在 9 月 30 日之前完全接种疫苗，但允许出于宗教原因或残疾的例外情况。\n周四，拜登总统在华盛顿宣布，美国的所有文职联邦雇员必须接种疫苗或接受定期检测、社交距离、口罩要求和大多数旅行的限制。最近几天，纽约、加利福尼亚和北卡罗来纳州都宣布了对其员工的类似疫苗接种要求，退伍军人事务部也是如此。谷歌、Facebook 和华盛顿邮报等公司都宣布了自己的授权。根据美国疾病控制与预防中心的数据，自 4 月份达到顶峰以来，疫苗接种的步伐已显着放缓，近一半的国家已全面接种疫苗。最近几周，一些疫苗接种率低的社区的病例率和住院率飙升，部分原因是具有高度传染性的 Delta 变种。尽管疫苗在预防严重疾病和死亡方面仍然有效，但自该变种开始传播以来，完全接种疫苗的人群中的突破性感染有所增加。 Pierluisi 先生的任务是为了应对波多黎各报告的冠状病毒病例急剧增加——据《纽约时报》报道，该岛在过去两周内的每日病例增加了 311%，是美国所有州或领地中增幅最大的数据库。在波多黎各，未接种疫苗的公职人员每周需要提供阴性的冠状病毒检测结果，或阳性检测结果，并附有医生证明他们不再具有传染性。拒绝的人将被迫使用他们的假期或带薪休假时间，然后无薪休假。由于冠状病毒，波多黎各是美国最早下令封锁的地区之一。在企业、学校和旅游业重新开放后，那里的病例和住院人数在 2021 年 4 月激增，皮尔路易斯先生恢复了宵禁，对游客实施了检测要求，并降低了企业和餐馆的室内容量。\n到 5 月，情况有所改善，皮尔路易斯先生放宽了一些限制；但是病例数从 7 月开始上升，并且此后急剧增加，尽管它们仍然大约......", "note_en": "President Biden on Thursday announced that all civilian federal employees  must be vaccinated against the coronavirus or be forced to submit to regular testing, social distancing, mask requirements and restrictions on most travel.\n “We all want our lives to get back to normal, and fully vaccinated workplaces will make that happen more quickly and more successfully,” Mr. Biden said, speaking in the East Room. “We all know that in our gut. With incentives and mandates, we can make a huge difference and save a lot of lives.”\n The federal government employs more than 4 million Americans, all of whom will need to attest to being fully vaccinated in order to avoid wearing a mask on the job, regardless of where in the country they work, and comply with screening tests once or twice a week.\n The president also directed the Defense Department to study how and when to add the coronavirus vaccine to the list of required vaccinations for all members of the military. The announcement marked the first time he has suggested that a mandate could come for active-duty members of the military before any of the three federally authorized vaccines receives full approval from the Food and Drug Administration. And he called on states, territories and local governments  to pay $100 to Americans who remain unvaccinated to get their shots.\n Mr. Biden’s announcement of new mandates in a pleading speech was part of an attempt to reset expectations on the health scourge that just weeks ago he thought he had under control. On July 4, the White House celebrated the national holiday as a day of “independence from Covid-19.”\n But now, the Delta variant is ripping through unvaccinated communities, threatening to undo the progress to stop the spread of the coronavirus made by the Biden administration in its first six months. About half of all Americans  have been fully vaccinated, but  the pace of vaccinations has declined significantly from early spring. Recent research has shown fully vaccinated people are protected against the worst outcomes of Covid-19, including those involving the Delta variant. And cases, hospitalizations and deaths are still a fraction of their devastating winter peaks.\n “Cases will go up further before they start to go back down,” Mr. Biden said Thursday, tempering expectations for what is to come. “There’s a challenge as you knew there could be.”\n Mr. Biden acknowledged the news was frustrating. “I know we hoped this would be a simple straightforward line without problems or new challenges, but that isn’t real life,” he said.\n On Tuesday, the C.D.C.  revised its mask guidance, advising that even vaccinated people should resume wearing masks in public indoor spaces in parts of the country where the virus is surging. Some states and municipalities were quick to update their own mask rules, while  others expressed outrage. Mayor Muriel Bowser of  Washington, D.C., said Thursday that an indoor mask mandate would be reimposed on Saturday to comply with new federal guidance.\n For vaccinated Americans worried about breakthrough cases, Mr. Biden reiterated that the pandemic was among the unvaccinated and that booster shots were not necessary. The Centers for Disease Control and Prevention has been tracking  breakthrough infections that result in hospitalization and death and the director said this week the agency is conducting outbreak investigations in clusters.\n “As of now, my medical advisers say the answer is no,” he said of booster shots. “No American needs a booster now. But if science tells us there’s a need for boosters, that’s something we’ll do.”\n The administration is stepping up its efforts to  convince unvaccinated Americans to get their shots. The Biden administration is calling on states, territories and local governments  to pay $100 to Americans who remain unvaccinated against the coronavirus to get their shots. And Mr. Biden announced Thursday that small- and medium-sized businesses will now be reimbursed for offering their employees paid leave to get their family members, including their children, vaccinated.\n Some experts, especially in the early days of the vaccination campaign, have expressed concern over the idea of paying people to get vaccinated, worrying that it could be perceived as out of step with messaging that vaccines bring enormous benefits on their own.\n Mr. Biden also called on school districts across the country to host at least one pop-up vaccination clinic over the coming weeks, with the goal of increasing vaccination rates among children 12 and older.\n Other governments around the country are beginning to  put in place similar arrangements as well, as the highly contagious Delta variant has caused case numbers to balloon in recent weeks. New York City will require all 300,000 city employees to be vaccinated or submit to weekly testing, and New York State  will require tens of thousands of state employees to show proof of vaccination or submit to weekly testing and will mandate patient-facing health care workers at state-run hospitals to be vaccinated as a condition of their employment. California  also unveiled a plan to require vaccinations for state employees.\n The North Carolina Department of Health and Human Services will require all workers and volunteers at state-operated facilities to be fully vaccinated or receive an approved medical or religious exemption by Sept. 30, according to a statement sent to The New York Times on Wednesday. Officials had not responded to questions about whether those with exemptions will be required to undergo testing.\n And the Department of Veterans Affairs  will require 115,000 of its frontline health care workers to be vaccinated against the coronavirus in the next two months. But public health officials are hoping that the prospect of extra burdens for the unvaccinated will help persuade more people to get inoculated.\n People familiar with Mr. Biden’s announcement said it was part of a longstanding discussion about how to bring most federal workers back to the office after nearly a year and a half in which hundreds of thousands of them worked from home because of the pandemic.\n A team has been working on that plan for months, trying to juggle the concerns of employees and the need to keep the government functioning. One concern that officials confronted was how to require vaccinations without potentially prompting critical employees to quit, undermining the government’s mission.\n  WASHINGTON — The Biden administration is calling on states, territories and local governments to pay $100 to Americans who remain unvaccinated against the coronavirus to get their shots. The move comes as concern has grown about rising cases across the country, and the administration has shifted its strategy to focus on more personalized approaches.\n The Treasury Department said Thursday that the money to pay for the vaccine incentive payments could come from the $350 billion of relief funds that is being given to states and cities as part of the economic rescue package that Congress approved in March. The incentive is intended to “boost vaccination rates, protect communities, and save lives.”\n The administration is also stepping up efforts to get to companies to give their employees time off to get the vaccine.\n The Treasury Department and the Internal Revenue Service said that employers can claim tax credits to cover wages paid to workers who take family members to get vaccinated or care for members of their households who are recovering from the vaccination. Self-employed workers are also eligible to receive the tax credits.\n The initiative expands on a program that was rolled out in April that offered a paid leave tax credit to offset the cost to companies with fewer than 500 workers incurred by giving paid time to workers getting vaccines.\n The Biden administration has been tussling with some states over how the relief money can be used, but earlier this year issued guidance that made clear it can go toward programs that are expected to increase the number of people who choose to get vaccinated. The Treasury Department said it will provide technical assistance for states and cities to help them use the money to boost vaccinations in their communities and it will be working with the Department of Health and Human Services.\n States and cities have been taking creative approaches, such as lotteries, to encourage people to get vaccinated. Some experts, especially in the early days of the vaccination campaign, have expressed concern, though, over the idea of paying people to get vaccinated, worrying that it could be perceived as out of step with messaging that vaccines bring enormous benefits on their own. Opponents of the idea have also questioned whether paying people is the best use of funds to encourage people to get vaccinated.\n Mayor Bill de Blasio of New York City said this week that the city  will begin offering $100 payments as part of an incentive plan to spur more people to get vaccinated. The program is expected to start on Friday.\n “I think when someone says here’s $100 for you, that’s going to make a big impact,” Mr. de Blasio said.\n Dr. Elisa Sobo, an anthropologist at San Diego State University who studies vaccine hesitancy, said that the payment could be an incentive but suggested it was unlikely to sway every unvaccinated person. “Some folks will find the offer insulting; others will use it as ‘proof’ that the vaccine is no good,” she said. But, she added, “There are lots of people who will say ‘why not’ to $100. Some people who have until now been on the fence will see $100 as a good reason to get off of it.”\n In  guidance that was issued in May, the Treasury said that the relief funds can be used to encourage vaccinations “so long as such costs are reasonably proportional to the expected public health benefit.”\n  President Biden is pushing Congress for a second one-month extension of the moratorium on residential evictions, a long-shot request needed to buy time to stand up a $47 billion rental relief program plagued by delays and red tape.\n The decision to throw responsibility to Congress — just two days before the freeze expires — took Democratic leadership by surprise, and a rushed attempt to pass an extension by a voice vote this week is expected to fail, according to several people close to the situation.\n White House officials, under pressure from tenants’ rights groups, agreed to a one-month extension of the ban, which was issued by the Centers for Disease Control and Prevention, just ahead of its previous expiration date of June 30. The freeze is now set to expire on Saturday.\n Last month, the Supreme Court rejected a challenge by landlords, saying it would allow the moratorium to continue until July 31, as planned, to give the Treasury Department and the states time to disburse cash to landlords to cover back rent accrued that tenants did not pay during the pandemic.\n But Justice Brett M. Kavanaugh wrote  in a concurring opinion that any future extension of the moratorium would require Congressional action.\n On Thursday, Mr. Biden’s press secretary, Jen Psaki, citing the steep rise in coronavirus infections around the country, pressed Congress to extend the freeze for another month to avoid a health and eviction crisis.\n “Given the recent spread of the Delta variant, including among those Americans both most likely to face evictions and lacking vaccinations, President Biden would have strongly supported a decision by the C.D.C. to further extend this eviction moratorium,” she wrote in a statement. “Unfortunately, the Supreme Court has made clear that this option is no longer available.”\n Mr. Biden “calls on Congress to extend the eviction moratorium to protect such vulnerable renters and their families without delay,” she added.\n The last-minute timing of the request virtually ensures such an effort will not succeed, Democratic congressional aides said. The one fast-track method of quickly passing an extension, through a procedure known as unanimous consent, can be blocked by a single dissenting vote.\n “There’s no way I’m going to support this. It was a bad idea in the first place,” said Sen. Patrick J. Toomey of Pennsylvania, reflecting the view of many Republicans in the chamber. “Owners have the right to action. They need to have recourse for the nonpayment of rent.”\n The Biden administration’s effort to head off a crisis when the federal moratorium expires gained modest momentum in June, with 290,000 tenants receiving $1.5 billion in pandemic relief,  according to Treasury Department statistics released last week.\n But the flow of cash provided under two pandemic relief packages remains sluggish and  hampered by confusion at the state level, potentially endangering tenants who have fallen behind in their rent over the past year. So far, only about $3 billion of the $47 billion program has been allocated, assisting about 600,000 tenants.\n In recent days, White House officials have been working the phones to pressure officials in New York, and other states that have not yet begun to allocate the aid, to move more quickly.\n “There can be no excuse for any state or locality not to promptly deploy the resources that Congress appropriated to meet this critical need of so many Americans,” Ms. Psaki said.\n The 27 member states of the European Union altogether have now administered more coronavirus  vaccine doses per 100 people than the United States, in another sign that inoculations across the bloc have maintained some speed throughout the summer, while they have stagnated for weeks in the United States.\n E.U. countries had administered 102.66 doses per 100 people as of Tuesday, while the United States had administered 102.44, according to the latest vaccination figures compiled by  Our World in Data. This month, the European Union also overtook the United States in first injections; currently, 58 percent of people across the bloc have received a dose, compared with 56.5 percent in the United States.\n The latest figures provide a stark contrast with the early stages of the vaccination campaigns this year, when E.U. countries, facing a shortage of doses and delayed deliveries, looked in envy at the initially more successful efforts in the United States, Britain and Israel.\n But the European Union is now vaccinating its populations at a faster pace than most developed countries. More than 70 percent of adults in the bloc have now received at least one dose of a coronavirus vaccine.\n Ursula von der Leyen, president of the European Commission, said the achievement put E.U. countries “among the world leaders.”\n “The catch-up process has been very successful,” she said in a statement on Tuesday.\n As inoculation campaigns in many American states have been marred by widespread anti-vaccine sentiment, E.U. countries have been able to immunize their populations with less pushback.\n Around 75 percent of residents in the bloc agree that vaccines are the only way to end the coronavirus pandemic,  according to a public survey conducted across the European Union in May.\n  Yet the spread of the Delta variant has added new urgency. Cases have soared in countries such as the Netherlands and Portugal, and hospitalizations have increased in France and Spain, among others, driving officials to try to speed up vaccination campaigns that have slightly slowed in recent weeks.\n “Countries have tried in the first half of the year to stretch the interval between the first and the second doses, but now they have to reduce it to the minimum, with the shortest possible interval,” Andrea Ammon, director of the European Center for Disease Prevention and Control, said this month.\n The center said last week that the Delta variant was now dominant in a majority of countries in the bloc.\n Countries including  France and Italy have announced new vaccine requirements to try to speed up inoculations, with proof of vaccination or a negative test set to be required to gain access to most public indoor venues. The goal, President Emmanuel Macron of France said in  announcing the measures this month, is to “put restrictions on the unvaccinated rather than on everyone.”\n As campaigns have slightly decreased or plateaued in some E.U. countries, health officials have also urged younger age groups to get vaccinated.\n “We have focused a lot on the elderly, and it’s left a very strong perception among younger people that they’re not at risk, or that if they are, it’s very mild,” said Heidi Larson, an anthropologist and founder of the London-based  Vaccine Confidence Project, which tracks opinions about immunization across the world.\n Vittoria Colliza, a Paris-based epidemiologist at Inserm, the French public-health research center, said that vaccine saturation levels were high among many populations, but that large pockets had yet to even receive one dose.\n She added that new lockdown restrictions may have to be reimposed to stem the spread of the Delta variant if immunization fails to keep up.\n “They’re increasing already,” Dr. Colliza said about inoculations, especially among younger people. “But the fear is that the Delta variant will begin to fully impact our lives by the end of August.”\n Puerto Rico’s governor announced on Wednesday that all public employees in the territory would have to be vaccinated against the coronavirus or face weekly testing, joining a growing list of states, municipalities, companies and  the federal government that have imposed some form of vaccine requirement.\n The governor, Pedro R. Pierluisi,  said on Twitter that government employees must get their first shot by Aug. 16 and be completely inoculated by Sept. 30, though exceptions for religious reasons or disabilities will be allowed.\n On Thursday,  President Biden announced in Washington that all civilian federal employees in the United States must be vaccinated or submit to regular testing, social distancing, mask requirements and restrictions on most travel.\n In recent days  New York,  California and North Carolina have all announced similar vaccination requirements for their employees, as has  the Department of Veterans Affairs.  Google,  Facebook and  The Washington Post are among the companies that have announced mandates of their own.\n The pace of vaccinations has slowed dramatically since they peaked in April, and just under half the country is fully vaccinated, according to  data from the Centers for Disease Control and Prevention. Some communities with low rates of vaccination have seen soaring case rates and hospitalizations in recent weeks, due in part to the  highly contagious Delta variant.\n Although vaccines are still effective at preventing serious illness and death, there has been an  increase in breakthrough infections in people who are fully inoculated since the variant started spreading.\n Mr. Pierluisi’s mandate is in response to a sharp increase in reported coronavirus cases in  Puerto Rico — the island saw a 311 percent jump in daily cases over the past two weeks, the most of any U.S. state or territory, according to  a New York Times database.\n In Puerto Rico, public employees who are not vaccinated will need to provide a negative coronavirus test result every week, or a positive test result with a certification from a doctor that they are no longer contagious. Those who refuse will be forced to use their vacation or paid leave time, then placed on unpaid leave.\n Puerto Rico was one of the first parts of the United States to  order a lockdown because of the coronavirus.  Cases and hospitalizations there surged in April 2021 after businesses, schools and tourism reopened, and Mr. Pierluisi reinstated a curfew, imposed a testing requirement for tourists, and lowered the indoor capacity for businesses and restaurants.\n Conditions improved by May, and  Mr. Pierluisi relaxed some of the restrictions; but cases started to rise in July, and have since grown dramatically, though they are still about a\n......", "posttime": "2021-07-30 07:10:18", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "美国,疫苗,union", "title": "欧盟在疫苗接种方面领先于美国", "title_en": "The European Union Pulls Ahead of the United States In Vaccinations", "transed": 1, "url": "https://www.nytimes.com/live/2021/07/29/world/covid-delta-variant-vaccine#eu-us-vaccinations", "via": "", "real_tags": ["美国", "疫苗", "union"]}, {"category": "", "categoryclass": "", "imagename": "130090626125bf89cdbb450f11689bd7.jpg", "infoid": 1070538, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "摩托罗拉发布了三款新款手机，包括 Edge 20 Pro、Edge 20 和 Edge 20 Lite。 Pro 型号带来了旗舰规格表，其 6.7 英寸 OLED 显示屏具有 144Hz 的快速刷新率、108 个主摄像头和具有 5 倍光学变焦的 8MP 潜望镜模块。 Edge 20 装有相同的 144Hz OLED 面板和 108MP 主射手，但将潜望镜替换为具有 3 倍光学变焦的 8MP 远摄模块。 Edge 20 Lite 拨回 6.7 英寸 90Hz OLED 和 108MP 主凸轮。 Edge 20 Pro 搭载骁龙 870 芯片组，配备 12GB RAM 和 256GB 存储，而 Edge 20 配备骁龙 778G，配备 6/8GB RAM 和 128GB 存储。 Edge 20 Lite 还配备了 Dimensity 720、6GB RAM 和 128GB 存储空间。 Edge 20 和 20 Pro 与主要的 108MP 三星 ISOCELL HM2 传感器共享一个 16MP 超宽摄像头，而 Edge 20 Lite 则配备一个 8MP 超宽快照器和 2MP 深度助手。在电池容量方面，Lite 型号凭借 5,000mAh 电池和 30W 充电成为电池组的领导者。 Edge 20 Pro 配备 4,500mAh 电池，而香草型号则配备 4,000mAh 电池，两者都具有 30W 充电速度。软件前端由 Android 11 之上的 My UX 覆盖，所有三款手机都支持 Ready For PC 界面，当连接到外部显示器时，它会带来传统的桌面式外观。有趣的是，摩托罗拉只会带来一次 Android 版本更新和两年的软件支持。 Moto 方面的理由是，大多数用户使用手机的时间不会超过两年，尽管与其他智能手机品牌相比，这肯定是一个有争议的声明并且落后于曲线。摩托罗拉 Edge 20 Pro 的起价为 699.99 欧元/649.99 英镑。 Edge 20 的售价为 499.99 欧元/429.99 英镑，而 Edge 20 Lite 的售价为 349.99 欧元/299.99 英镑。这三款手机都将于 8 月晚些时候上市，最终将在欧洲、拉丁美洲和亚洲上市。摩托罗拉目前没有宣布任何将手机带到美国的计划。我使用 G5 Plus 大约 3.5 年。摩托罗拉只是懒惰地提供更新。使用摩托罗拉时，我唯一希望更新的是获得更好的自定义 rom 支持。\n联想操作系统仍然是他们仍然存在的原因，否则他们会遵循与诺基亚LG，HTC，爱立信.....等相同的垫子，他们可以去......他们自己，因为普通人至少应该得到2 软件更新，无论移动价格点如何", "note_en": "A trio of new Motorola phones was announced with the Edge 20 Pro, Edge 20 and Edge 20 Lite. The Pro model brings a flagship specs sheet with its 6.7-inch OLED display of speedy 144Hz refresh rate, 108 main cam and 8MP periscope module with 5x optical zoom. The Edge 20 houses the same 144Hz OLED panel and 108MP main shooter but substitutes the periscope for an 8MP telephoto module with 3x optical zoom. Edge 20 Lite dials back to a 6.7-inch 90Hz OLED and 108MP main cam.\n    Edge 20 Pro brings a Snapdragon 870 chipset with 12GB RAM and 256GB storage while the Edge 20 gets Snapdragon 778G with 6/8GB RAM and 128GB storage. Edge 20 Lite is left with a Dimensity 720 alongside 6GB RAM and 128GB storage. The Edge 20 and 20 Pro share a 16MP ultrawide cam alongside the main 108MP Samsung ISOCELL HM2 sensor while the Edge 20 Lite gets an 8MP ultrawide snapper and 2MP depth helper.\n    In terms of battery capacity, the Lite model is the leader of the pack with its 5,000mAh cell and 30W charging. The Edge 20 Pro gets a 4,500mAh cell while the vanilla model is left with a 4,000mAh cell and both also come with 30W charging speeds.\n    The software front is covered by My UX on top of Android 11 and all three phones support the Ready For PC interface which brings a traditional desktop-like look when connected to an external display.\n  Interestingly Motorola will bring only one Android version update and just two years of software support. The reasoning on Moto’s side is that most users don’t keep their phones for more than two years though that is certainly a controversial statement and behind the curve compared to other smartphone brands.\n    Pricing for the Motorola Edge 20 Pro starts at €699.99/£649.99. Edge 20 will go for €499.99/£429.99 while Edge 20 Lite will go for €349.99/£299.99. All three phones will be available later in August and will eventually make their way across Europe, Latin America and Asia. Motorola did not announce any plans to bring the handsets over to the US for now.\n    I used my G5 Plus for around 3.5 Years. Motorola is just lazy in providing updates. My only hope for updates when using a Motorola is getting a better custom rom support.\n  Lenovo os still the reason why they still exist otherwise they would have followed the same pad as Nokia LG, HTC , Ericsson.....etc etc\n  Well they can go f.... Themselves , because an average person should at least get 2 software updates regardless of mobile price point", "posttime": "2021-07-30 07:09:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "发布,推出,announces,配备", "title": "摩托罗拉发布面向欧洲、拉丁美洲和亚洲的 Edge 20、20 Pro 和 20 Lite；八月推出，价格从 349.99 欧元起", "title_en": "Motorola announces the Edge 20, 20 Pro, and 20 Lite for Europe, Latin America and Asia; coming in August with prices starting from €349.99", "transed": 1, "url": "https://www.gsmarena.com/motorola_edge_20_20_pro_20_lite_announced-news-50300.php", "via": "", "real_tags": ["发布", "推出", "announces", "配备"]}, {"category": "", "categoryclass": "", "imagename": "96697814dd0a09814cc70dc30d1e56c8.jpeg", "infoid": 1070537, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您想从头开始开设大学系，并吸引尽可能多的超级明星研究人员，您可以提供的最有吸引力的福利是什么？根据今天的嘉宾的说法，计算机科学教授和畅销书《没有电子邮件的世界》作者 Cal Newport 表示，对于一位拥有数十年经验的世界知名疫苗研究人员来说，花费三分之一的时间来处理 HR 的请求，这应该是一种淫秽和荒谬的做法。 、建筑管理、财务等等。然而，以今天的方式组织办公室，没有什么比这更自然的了。但这不仅仅是精英层面的问题——它几乎影响到我们所有人。典型的美国办公室职员每天检查电子邮件 80 次，或每六分钟检查一次。 RescueTime 的数据分析发现，三分之一的用户每三分钟或更长时间检查一次电子邮件或 Slack，平均在一个完整的工作日内。每次发生这种情况时，我们的注意力都会被打破，扼杀了我们本应支付报酬的知识工作的动力。当我们哀叹大量的电子邮件和聊天减少了我们的注意力，增加了我们的焦虑并使我们的生活变得疯狂时，我们最自然地责怪“意志薄弱”。如果我们有纪律每天检查一次 Slack 和电子邮件，一切都会好起来的——或者故事就是这样。 Cal 认为，这种思路从根本上误解了我们如何到达这样一个地方，知识工作者很少能连续五分钟花在做一件事上。自工业革命以来，技术和更好的组织相结合，使制造业在同样数量的人的情况下产量提高了 100 倍。\n卡尔说，相比之下，科学家、作家或高级管理人员等专业知识工作者是否比 50 年前的生产力更高尚不清楚。如果知识部门能够实现制造业的一小部分，并找到一种方法来协调其工作，仅将生产力提高 1%，那么全球每年将产生 1000 亿美元的收入。在 Cal 看来，这些机会正盯着我们看。由顶级公司运营的现代工厂精心构建，并积累了两个世纪的经验，以确保员工能够完成最大的工作。相比之下，当今大多数知识工作根本没有经过深思熟虑的结构。我们没有精心构建流程来充分利用每个人，我们只是分发任务，让人们以他们认为最容易的方式有机地组织自己。自 1990 年代以来，当每个人都有电子邮件地址并且大多数人都失去了他们的助手时，这种缺乏方向导致了 Cal 所说的“过度活跃的蜂巢思维”：每个人全天都在需要时向其他人发送电子邮件和聊天任何事物。管理人员不是战略思想家，而是作为人工总机工作，回答和转发有关任何主题的数十封电子邮件，以防止系统卡顿。找个时间让四个人见面可能意味着一个 8 个电子邮件线程。够烦的！但是这四个人中的每一个都必须不断检查以确保线程正在进展，并回答出现的任何新问题。因此，在协调单个会议的过程中，这四个人加起来可能会打断他们的思路并查看电子邮件 20、30 甚至 40 次。 Cal 指出，这太正常了，我们甚至不认为这是一种组织工作的方式，但它是：当管理层不采取任何措施使团队能够决定更好的协调方式时，就会发生这种情况。如果任何人试图选择退出并一整天专注于一件事，他们就是在“过度活跃的蜂巢思维”中抛出一个扳手，这解释了为什么呼吁个人纪律对解决问题的作用如此之小。\n一些行业在驯服“过度活跃的蜂巢思维”方面取得了进展。 Cal 指出技术支持票务系统，该系统会限制通信并让工程师一次专注于一个问题，直到他们无法进一步解决，此时该问题就被搁置了，他们会得到一个新的问题来解决下一个问题.他还提到了“极限编程”，在这种系统中，两名软件工程师并排坐在一台计算机前，共同编写代码来解决他们整个工作日的特定问题。在他们工作时，这些软件工程师没有电子邮件帐户，也没有电话号码。与世界其他地方的所有传入和传出通信都通过专门的联络官进行，因此他们可以保持 100% 的专注。通常在实际工作六个小时后，他们需要回家休息。但根据 Cal 的说法，在这次采访中和在没有电子邮件的世界中，这几乎没有触及知识工作中可能进行的改进的表面。控制过度活跃的蜂巢思维不仅能帮助人们完成更高质量的工作，还能让他们摆脱 24/7 的焦虑，因为他们没有回到某个地方。为什么花了一个多世纪才提出工厂组织的“装配线”方法 Cal 对高中生、大学生和早期职业员工的最高生产力建议 通过订阅我们关于世界上最紧迫的播客来获取这一集问题以及解决方法：在您的播客应用程序中输入 80,000 小时。或者阅读下面的文字记录。 Rob Wiblin：大家好，这是 80,000 小时播客，我们在其中就世界上最紧迫的问题进行了异常深入的对话，您可以采取哪些措施来解决这些问题，以及如何在仍然在 5 点下班的情况下击败纳粹：晚上 30 点。我是 Rob Wiblin，80,000 小时研究主管。\n在去年的调查中，您要求我们就我​​们以前从未讨论过的问题制作更多剧集，因此这一集确实可以传达，因为在为这一集做准备之前，我从未将这个问题概念化为紧迫的全球性问题.几乎从 80,000 小时开始，我们就一直是畅销书作家 Cal Newport 的粉丝。我经常发现自我提升或生产力书籍有点……嗯，没有说服力。但也许因为他的日常工作是作为一名学术计算机科学家，Cal 的东西似乎比大多数人都经过深思熟虑。 Cal 的日程安排非常紧凑，所以我们只有两个小时和他在一起——这意味着你不应该在这一刻找到慢节奏的时刻。为了确保我们得到一些原始问题，我们不得不快速浏览他在他的新书“没有电子邮件的世界”中提出的核心案例。因此，如果您感到有点困惑，并希望看到更好地充实论点——并听取对可能的反对意见的更多回应，请务必拿起这本书。如果你没有在一个让 Cal 所说的变得直观的办公室工作过，那么认为自己很幸运；但是您无需四处打听就能找到经历过“过度活跃的蜂巢思维”的人。如果您想了解更多 Cal Newport，可以在网上找到他的大量作品，包括他的个人播客 Deep Questions 和他的博客。最后，如果你有兴趣使用 80,000 小时的思维方式在你的职业生涯中为世界做更多的事情——或者努力解决我们经常在节目中讨论的问题——那么你可以申请与我们的团队交谈一-免费一对一。几年来，我们第一次取消了申请咨询的候补名单，因此我们的团队渴望与更多忠实的播客听众交谈。\n他们可以讨论要关注的问题，查看您的计划，向您介绍导师，并建议适合您技能的角色。只需访问 80000hours.org/speak 即可了解更多信息并申请。 Rob Wiblin：今天，我正在与 Cal Newport 交谈。 Cal 是乔治城大学计算机科学助理教授，他的工作重点是在具有挑战性的网络场景中的分布式算法。但除了成为一名蓬勃发展的学术计算机科学家之外，Cal 似乎还拥有完整的第二人生——至少是完整的第二职业——作为一名畅销书作家和思想家，如何从工作和生活中获得最大收益。罗布·威布林：这些书一开始就非常乐观，书名如《如何成为高中超级巨星》、《如何在大学中获胜》和《如此优秀以至于他们无法忽视你：为什么技能胜过对你热爱的工作的热情》。当然，这些都不是新话题，但这些书出奇地好，拥有广泛的读者，包括 80,000 小时——我们在早期的文章中大量借鉴了他们的建议。 Rob Wiblin：但 Cal 继续参与这些问题，试图帮助人们在享受自己的同时取得伟大的成就。这导致了一系列关于高度相关主题的三本书，标题为“深度工作：在分心世界中专注成功的规则”，“数字极简主义：在嘈杂的世界中选择专注的生活”，以及今年他的新书“没有的世界”电子邮件：在沟通过载的时代重新构想工作。 Rob Wiblin：在我看来，随着时间的推移，这些书的语气变得越来越惊慌，或者有些不安。最初是关于如何组织自己的生活以减少干扰，后来升级为对世界上绝大多数知识工作的组织方式的控诉，以及全面改革的建议。 Rob Wiblin：根据 Cal 的说法，我们正在浪费大量不敬虔的人类潜力，并创造了数亿不断焦虑和心慌的办公室工作人员。能够组织和协调人们整天在办公室和电脑前所做的工作的企业可能会产生更好的工作，并拥有更充实的员工。我发现这些书真的令人大开眼界，我对今天的谈话感到非常兴奋，所以谢谢你来参加这个节目，Cal。卡尔纽波特：这是我的荣幸。近十年来，我一直与 80,000 小时交织在一起并与之交谈并跟上，所以这当然不足为奇，我很高兴今天与您交谈。\nRob Wiblin：你在很多年前认识了我们的创始人 Ben Todd，对吧？我认为他非常喜欢你的工作，我认为这就是为什么它对我们的职业指南产生巨大影响的部分原因。 Cal Newport：是的，我记得当 80,000 小时开始并进行这些对话和最初的想法时，所以很高兴看到它是如何发展的。罗布·威布林：是的。我们将在谈话的稍后部分回到我们从你之前的书中学到的一些教训。但是，为了深入探讨我今天想要处理的真正内容，您对为什么电子邮件和 Slack 已成为大多数人和组织协调当今在办公室完成的大部分工作的方式的理论是什么？ Cal Newport：嗯，所以有一个由两部分组成的故事。所以，故事中有一个很有意义的部分，每个人可能都记得，那是在 1990 年代，主要是 1990 年代上半叶，电子邮件在整个办公室迅速传播。所以我们经历了一个非常快速的采用时期，办公室购买了电子邮件服务器，人们第一次获得了专业的电子邮件地址。 Cal Newport：如果你回过头去追溯那段历史，这完全是务实的。电子邮件正在被视为替代品，主要用于三种现有的通信方式：传真机、语音邮件和办公室内部或办公室之间的备忘录，您可以在其中将东西放入信封中。这种类型的沟通是经营企业所必需的。电子邮件做得更好，而且基本上是免费的。这是瞬间的。您可以拥有 CC 和数字附件。所以它在 1990 年代传播得非常快，因为它解决了一个真正的生产力问题，而且它解决得非常好。 Cal Newport：然而，在所有这些办公室收到电子邮件之后，我们得到的是一个意想不到的副作用。它的出现改变了办公室工作发生的技术生态系统，没有人真正认为这是一个好主意，没有人真正推动这一点，没有任何公司思考，“这就是我们将如何使我们所有的钱”，我们逐渐转向办公环境中的协作方式，通过这些工具实现，我称之为“过度活跃的蜂巢思维”。这是一种协作方法，我们说：“看，我们可以通过这些来回不定期的数字消息来即时解决大多数事情。” Cal Newport：所以我们推出了一个工具来摆脱传真机，几年后我们又查了一下，沟通的角色和我们的合作方式发生了意想不到的巨大变化。\n罗布·威布林：是的。所以我认为大多数人都会认识到这种过度活跃的蜂巢思维，每个人都只是不断地在 Slack 上回复电子邮件和回复消息，以协调正在发生的所有事情，而你最终要做的任务是有点取决于您最近收到的电子邮件是什么，或者谁最后一次与您聊天。我认为您的理论是，基本上这就是您什么都不做时会发生的情况。当没有人做任何事情来设置比这更好的东西时，惯性就会驱使你到达那里。为什么当你什么都不做时会发生这种情况？ Cal Newport：我的意思是，想想我们的直觉。让我们回到很远的地方。让我们回到旧石器时代的历史。让我们想想三个猎人采集者一起工作。我们正在猎杀乳齿象。我们将如何协调？这将是过度活跃的蜂巢思维，对吧？从某种意义上说，它将是按需、不定期的来回。临时通信。卡尔纽波特：“嘿，你去那边，小心那个。” “哦，等等，我听到这里有事。”这是我们在小组中交流的自然方式。因此，电子邮件启用的是将这种自然的通信方式扩展到非常大的群体。当然，它不起作用。 Cal Newport：那么为什么它不起作用是因为有太多这样的来回对话，而且我们试图与之对话的人太多，所以它没有扩展。如果我们三个人，假设我们分布在世界各地，但是一起做一件事并且我们都在 Slack 上，只是在飞行中解决问题，这实际上很有意义。对于一个小组来说，这是一种非常自然的方式来协调一件事。 Cal Newport：但如果我们有 30 人在办公室，并且有两打不同的异步来回对话正在进行，那么事情就会失控。因为正在进行的每一次对话都要求我们不断检查这些渠道，因为假设我们必须交换五到六条消息才能做出决定，而必须在我们的客户今天下午 3:00 致电之前做出决定.因此，必须交换五六封电子邮件。如果我们要在客户来电之前完成整个交流，我必须非常迅速地处理每封电子邮件。所以也许我每封电子邮件都会收到 10 次收件箱检查，因为我在等它。所以现在仅仅这个对话就产生了 50 到 60 个额外的收件箱检查。 Cal Newport：现在想象一下我们同时有几十个这样的事情发生。所以它只是不缩放。但我认为重要的是要认识到这种协作模式是人类一直以来的协作方式。我们从来没有遇到过这样的情况：一个组织中有 600 人，我们正在处理 60 种不同的事情。罗布·威布林：是的。所以上周我以为我知道这次采访的组织将如何进行，但在本周真正阅读了没有电子邮件的世界后，我决定完全改变重点。基本上，我想和你一起，通过有效的利他主义视角来研究这个我称之为“正确组织知识工作”的问题，以了解参与该项目是否可以成为一些听众了解展示他们的职业生涯对世界产生最大的积极影响。这听起来好吗？\n罗布·威布林：好的。因此，首先，我们在分析问题时通常会问的第一个问题是，您刚才描述的工作安排造成的损害程度是多少，以让所有这些对话线程同时进行为中心？卡尔纽波特：嗯，所以捕捉伤害的正确方法是它对我们的大脑造成的伤害，对吗？所以，如果你的办公室里有一个过度活跃的蜂巢思维，这意味着你将有所有这些不同的来回对话与计划外的消息发生，其中大多数需要相对较快地向前推进。因此，由此产生的直接影响是非常频繁地检查收件箱，无论是电子邮件还是 Slack。例如，我引用的一些数据显示，每 5 到 6 分钟一次，大约是人们检查收件箱频率的平均值。 Cal Newport：这种接近行为具有非常深刻的负面影响，主要是它与我们大脑注意力中心的交互方式。人脑不能像计算机处理器一样快速地来回转换上下文。这是一个混乱的过程，因为我们必须抑制某些神经网络，而我们必须放大其他神经网络。这可能需要一段时间。 Cal Newport：所以，我和你的谈话结束了，我现在想把注意力转移到写一篇文章上。这将需要 10 或 15 分钟，直到我真正让我们对话中所有语义相关的神经网络平静下来，并真正放大了与我的文章相关的语义网络，只有到那时我才会真正摇摆不定，取得一些实际进展。 Cal Newport：如果我们检查收件箱，无论是 Slack、Teams、电子邮件，如果我们每五分钟检查一次，每次检查时，我们都会启动这些缓慢、混乱的认知环境转变之一，但是我们不会让它完成，因为看，我们只是在等待看到三到四条需要快速恢复的消息。所以我们启动它，在它完成之前，我们试着把注意力集中在我们之前做的事情上，所以现在我们有了冲突的上下文。 Cal Newport：在所有通过查看收件箱启动的网络最终被禁止之前，我们再次回顾收件箱，现在我们启动了，它可能与网络略有不同，因为现在有一个新的来自客户的电子邮件，现在与该客户相关的网络正在启动，然后我们回去工作，然后我们回到那里。这是一场认知灾难。 Cal Newport：所以，我们的大脑根本做不到。如果您频繁查看收件箱，您的大脑就会处于这种认知能力显着降低的持续状态。也很累。这就是为什么在下午 2:00 或 3:00 时，它就像是，“我只是放弃了。我将在当天剩下的时间里做 Slack。”这是因为我们的大脑已经因所有这些上下文的变化而筋疲力尽。\nCal Newport：这也让我们感到焦虑。这种焦虑有不同的应用，因此取决于各种个性特征，这可能或多或少很明显，但它不会让我们感觉良好。有很多数据可以证明这一点。因此，这对我们的认知能力、精力和情绪健康来说都是一场灾难。所有这些事情，如果我们围绕不断来回的背景变化创造一天，所有这些事情都会受到严重的负面影响。 Rob Wiblin：是否有任何研究可以说明我们作为一个物种在全球层面上留下了多少GDP、创新或人类潜力？卡尔纽波特：我认为这是巨大的。所以，我认为一个具有挑衅性的数字是，如果你将工业部门视为一个类比，对，我喜欢引用的一个数字是 Peter Drucker 在 1999 年他生命结束时引用的一个数字。他说，看，如果你看看 20 世纪的工业部门，有 50 倍......", "note_en": "If you wanted to start a university department from scratch, and attract as many superstar researchers as possible, what’s the most attractive perk you could offer?\n  According to today’s guest, Cal Newport — computer science professor and best-selling author of   A World Without Email — it should seem obscene and absurd for a world-renowned vaccine researcher with decades of experience to spend a third of their time fielding requests from HR, building management, finance, and on and on. Yet with offices organised the way they are today, nothing could feel more natural.\n But this isn’t just a problem at the elite level — it affects almost all of us. A typical U.S. office worker checks their email  80 times a day, or once every six minutes. Data analysis by RescueTime found that a third of users checked email or Slack every  three minutes or more, averaged over a full work day.\n Each time that happens our focus is broken, killing our momentum on the knowledge work we’re supposedly paid to do.\n When we lament how much email and chat have reduced our focus, increased our anxiety and made our days a buzz of frenetic activity, we most naturally blame ‘weakness of will’. If only we had the discipline to check Slack and email once a day, all would be well — or so the story goes.\n Cal believes that line of thinking fundamentally misunderstands how we got to a place where knowledge workers can rarely find more than five consecutive minutes to spend doing just one thing.\n Since the Industrial Revolution, a combination of technology and better organization have allowed the manufacturing industry to produce a  hundred-fold as much with the same number of people.\n Cal says that by comparison, it’s not clear that specialised knowledge workers like scientists, authors, or senior managers are  any more productive than they were 50 years ago. If the knowledge sector could achieve even a tiny fraction of what manufacturing has, and find a way to coordinate its work that raised productivity by just 1%, that would generate on the order of $100 billion globally each year.\n On Cal’s account, those opportunities are staring us in the face. Modern factories operated by top firms are structured with painstaking care and two centuries of accumulated experience to ensure staff can get the greatest amount possible done.\n By contrast, most knowledge work today operates with no deliberate structure at all. Instead of carefully constructed processes to get the most out of each person, we just hand out tasks and leave people to organise themselves organically in whatever way feels easiest to them.\n Since the 1990s, when everyone got an email address and most lost their assistants, that lack of direction has led to what Cal calls the ‘hyperactive hive mind’: everyone sends emails and chats to everyone else, all throughout the day, whenever they need anything.\n Rather than strategic thinkers, managers work as human switchboards, answering and forwarding dozens of emails on any and every topic to keep the system from seizing up.\n Finding a time for four people to meet might mean an eight-email thread. Annoying enough! But each of those four has to keep checking in to make sure the thread is progressing, and answer any new questions that come up. So in aggregate those four might interrupt their train of thought and check their email 20, 30 or even 40 times in the process of coordinating a single meeting.\n Cal points out that this is so normal we don’t even think of it as a way of organising work, but it is: it’s what happens when management does nothing to enable teams to decide on a better way of coordinating themselves. And if any individual tries to opt out and focus on one thing for an entire day, they’re throwing a wrench in the ‘hyperactive hive mind’, which explains why calls for individual discipline have done so little to fix the problem.\n A few industries  have made progress taming the ‘hyperactive hive mind’. Cal points to tech support ticketing systems, which throttle correspondence and keep engineers focused on one problem at a time until they can’t get any further, at which point that problem is parked and they’re given a single new problem to work on next.\n He also points to ‘extreme programming’, a system in which two software engineers sit side-by-side in front of one computer and together write code to solve a specific problem for their entire work day. As they work, those software engineers have no email account and no phone number. All incoming and outgoing communication with the rest of the world is run through a dedicated liaison officer so they can maintain 100% focus. Usually after six hours of real actual work they need to go home and rest.\n But on Cal’s telling, in this interview and in  A World Without Email, this barely scratches the surface of the improvements that are possible within knowledge work. And reigning in the hyperactive hive mind won’t just help people do higher quality work, it will free them from the 24/7 anxiety that there’s someone somewhere they haven’t gotten back to.\n  Why it took more than a century to come up with the ‘assembly line’ method for factory organisation\n Cal’s top productivity advice for high school students, university students, and early-career employees\n Get this episode by subscribing to our podcast on the world’s most pressing problems and how to solve them: type 80,000 Hours into your podcasting app. Or read the transcript below.\n       Rob Wiblin: Hi listeners, this is the 80,000 Hours Podcast, where we have unusually in-depth conversations about the world’s most pressing problems, what you can do to solve them, and how you can defeat the Nazis while still knocking off at 5:30pm. I’m Rob Wiblin, Head of Research at 80,000 Hours.\n In last year’s survey you asked us to do more episodes about problems we’ve never talked about before, and on that count this episode certainly delivers, because it’s a problem I’d never even conceptualised as a pressing global problem until preparing for the episode.\n We’ve been fans of the best-selling author Cal Newport since almost when 80,000 Hours got started. I often find self-improvement or productivity books a bit…well, unpersuasive. But maybe because his day job is as an academic computer scientist, Cal’s stuff seems better thought through than most.\n Cal has a pretty packed schedule, so we only got two hours with him — which means you shouldn’t find a slow moment in this one.\n To make sure we got to some original questions, we had to blitz through the core case he puts forward in his new book   A World Without Email. So if you feel a bit confused and would like to see the arguments better fleshed out — and hear more responses to possible objections, do go grab the book.\n If you haven’t worked in an office that makes what Cal is saying intuitive, consider yourself lucky; but you won’t have to ask around for long to find someone who has lived through the ‘hyperactive hive mind’.\n If you’d like more Cal Newport there’s a huge amount of his work online, including his personal podcast  Deep Questions and  his blog.\n Finally, if you’re interested in using 80,000 Hours’ style of thinking to do more good for the world in your career — or working to solve the problems we often discuss on the show — then you can  apply to speak with our team one-on-one for free. For the first time in a couple of years we’ve removed our waitlist to apply for advising, so our team is keen to speak with more of you loyal podcast listeners.\n They can discuss which problem to focus on, look over your plan, introduce you to mentors, and suggest roles that suit your skills. Just go to 80000hours.org/speak to learn more and apply.\n   Rob Wiblin: Today, I’m speaking with Cal Newport. Cal is an assistant professor of computer science at Georgetown University, where his work focuses on distributed algorithms in challenging networks scenarios. But in addition to being a thriving academic computer scientist, Cal seemingly has a full second life — a full second career, at least — as a best-selling author and thinker on how to get the most out of work and out of life.\n Rob Wiblin: Those books started out pretty optimistically, with titles like,   How to Be a High School Superstar,   How to Win at College, and   So Good They Can’t Ignore You: Why Skills Trump Passion in the Quest for Work You Love. These weren’t new topics of course, but the books were unusually good and found a wide audience, including 80,000 Hours — we drew heavily on their advice in our early articles.\n Rob Wiblin: But Cal had continued engaging with these questions, trying to help people achieve great things while also enjoying themselves. And this led to a series of three books on highly related topics, titled   Deep Work: Rules for Focused Success in a Distracted World,   Digital Minimalism: Choosing a Focused Life in a Noisy World, and this year, his new book,   A World Without Email: Reimagining Work in an Age of Communication Overload.\n Rob Wiblin: To my ear, the tone of these books has become more and more alarmed, or somewhat troubled, over time. Initially about how to organize your own life in order to reduce distractions, they have escalated to an indictment of the way the great majority of knowledge work in the world is organized, and a proposal for wholescale reform.\n Rob Wiblin: On Cal’s telling, we are wasting an ungodly amount of human potential and creating a population of hundreds of millions of constantly anxious and flustered office workers. Businesses that could probably organize and coordinate the work that people do in offices and at computers all day would produce potentially much better work and have far more fulfilled staff. I’ve found these books really eye-opening, and I’m very excited for today’s conversation, so thanks for coming on the show, Cal.\n Cal Newport: It’s my pleasure. I have been intertwined and talking with and keeping up with 80,000 Hours for almost a decade now, so it’s of course no surprise, and my pleasure to be talking with you today.\n Rob Wiblin: You met our founder, Ben Todd, many years ago, right? I think he got very into your work and I think that’s part of why it had a massive influence on our career guide.\n Cal Newport: Yeah, I remember when 80,000 Hours was starting up and having those conversations and the original idea, so it’s exciting to see how it developed.\n  Rob Wiblin: Yeah. We’ll come back to some of the lessons that we took from your earlier books later in the conversation. But to launch into the real substance that I want to deal with today, what is your theory for why email and Slack have become the ways that most people and organizations coordinate most of the work done in offices today?\n Cal Newport: Well, so there’s a two-part story. So, there’s the part of the story that makes a lot of sense that everyone probably remembers, which is in the 1990s, predominantly the first half of the 1990s, email spread very rapidly throughout offices. So we had this very rapid period of adoption where offices bought email servers, people got professional email addresses for the first time.\n Cal Newport: And if you go back and track that history, it’s completely pragmatic why this happened. Email is being pitched as a replacement, primarily for three existing communication modalities: the fax machine, the voicemail, and the inner-office, or between-office memo, where you put things in envelopes. This type of communication was necessary to run businesses. Email did it a lot better, and it was basically free. It was instantaneous. You could have CCs and digital attachments. So it spread very quickly in the 1990s because it solved a real productivity problem, and it solved it really well.\n Cal Newport: In the wake of email arriving in all of these offices, however, what we got was an unexpected side effect. Its mere presence changed the technological ecosystem in which office work was happening, and without anyone really thinking this was a good idea, without anyone actually pushing for this, without any company thinking, “This is how we’re going to make all of our money”, we drifted towards a way of collaboration in the office environment, enabled by these tools, that I call the ‘hyperactive hive mind.’ It’s a method of collaboration where we say, “Look, we can just figure most things out on the fly with these back and forth unscheduled digital messages.”\n Cal Newport: So we introduced a tool to get rid of the fax machine, and then we looked up a couple years later and the role of communication and how we collaborate had drastically changed in really unexpected ways.\n Rob Wiblin: Yeah. So I think most people will recognize this idea of a hyperactive hive mind, where everyone is just constantly answering emails and responding to messages on Slack in order to coordinate all of the things that are going on, and the task that you end up doing is kind of determined by what’s the email that you happen to get most recently, or who has been chatting you last. I think your theory is that basically this is what happens when you don’t do anything. When no one does anything to set up anything better than that, then inertia drives you there. Why is that what happens when you don’t do anything?\n Cal Newport: I mean, think about our instincts. Let’s go back very far. Let’s go back into paleolithic history. Let’s think about three hunter gatherers working on something together. We’re hunting a Mastodon. How would we coordinate? It would be the hyperactive hive mind, right? In the sense that it would be on-demand, unscheduled back-and-forth. Ad hoc communication.\n Cal Newport: “Hey, you go over there, watch out for that.” “Ooh, wait, I hear something over here.” It’s the natural way we communicate in small groups. So what email enabled was scaling up this natural way of communication to very large groups. Of course, it doesn’t work.\n Cal Newport: So why it doesn’t work is there are too many of these back-and-forth conversations, and too many people that we’re trying to have conversations with, so it doesn’t scale. If there’s three of us and we’re, let’s say, spread across the world, but working on one thing together and we’re all on Slack, just figuring things out on the fly, it actually makes a lot of sense. That’s a very natural way for a small group to coordinate on one thing.\n Cal Newport: But if there’s 30 of us in the office and there’s two dozen different asynchronous back-and-forth conversations going on, that’s when things spiral out of control. Because each of these conversations that’s going on requires that we keep checking these channels, because, hypothetically let’s say, five or six messages have to be exchanged for us to reach a decision that has to be made before our client call today at 3:00pm. So, five or six emails have to be exchanged. I have to turn each of these emails around pretty quickly if we’re going to get through this whole exchange before the client calls. So maybe I’m getting 10 inbox checks per email, because I’m waiting for it. So now just this one conversation has generated 50 to 60 extra inbox checks.\n Cal Newport: Now imagine we have a couple dozen of these going on at the same time. So it just doesn’t scale. But I think it is important to recognize that this mode of collaborating is how humans have always collaborated. We’ve just never before been in a situation where there’s 600 of us in an organization and there’s 60 different things we’re working on.\n Rob Wiblin: Yeah. So last week I thought I knew how the organization of this interview was going to go, but after actually reading  A World Without Email this week, I decided to totally change focus. And basically I’d like to, with you, investigate this problem of what I would title ‘properly organizing knowledge work’ through a effective altruist lens, in order to see whether being involved in that project could be a way for some listeners to the show to have the biggest possible positive impact on the world with their career. Does that sound good?\n   Rob Wiblin: Okay. So to kick off, the first question that we usually ask when analyzing problems is, what is the quantity of harm done by the work arrangement that you just described, centered around having all of these threads of conversation going on simultaneously?\n Cal Newport: Well, so the right way to capture the harm is what it does to our brain, right? So, if you are going to have a hyperactive hive mind in your office, this means you’re going to have all of these different back-and-forth conversations happening with unscheduled messages, most of them need to be moved forward relatively quickly. So, the proximate impact of this is very frequent checking of inboxes, be it email or Slack. Some of the data I cite, for example, was showing once every five to six minutes was about average for how often people were checking their inboxes.\n Cal Newport: That proximate behavior has a really deep, negative impact, mainly the way it interacts with our brain’s attention centers. The human brain can’t very quickly shift context back and forth like a computer processor. It’s a messy process, because we have to inhibit certain neural networks and we have to amplify other neural networks. It can take a while.\n Cal Newport: So, I finish a conversation with you, and I want to now change my attention over to writing an article. It’s going to take 10 or 15 minutes until I’ve really calmed down all of the semantically related neural networks of our conversation, and really amplified the semantic networks relative to my article, and only at that point will I really be rocking and rolling and making some real progress.\n Cal Newport: If we’re checking inboxes, be it Slack, be it Teams, be it email, if we’re checking these every five minutes, every time we check, we initiate one of these slow, messy cognitive context shifts, but we don’t let it complete because look, we’re just waiting to see three or four messages that we need to get back to real quick. So we initiate it, and before it completes, we then try to wrench our attention back to the thing we were doing before, and so now we have colliding contexts.\n Cal Newport: And before all the networks that got fired up by looking at that inbox can finally finish being inhibited, we look back at the inbox again, and now we’re firing up and it’s probably slightly different networks, because now there’s a new email in there from a client, and now the networks related to that client are firing up and then we go back to the work and then we go back there. It’s a cognitive catastrophe.\n Cal Newport: So, our brain simply can’t do it. If you’re checking an inbox that frequently, your brain is in this persistent state of significantly reduced cognitive capacity. It’s also fatiguing. That’s why by 2:00 or 3:00 in the afternoon it’s like, “I just give up. I’m just going to do Slack for the rest of the day.” It’s because our brain has been exhausted from all this context shifting.\n Cal Newport: It also makes us anxious. This anxiety is differentially applied, so dependent on various personality traits, this could be more or less pronounced, but it doesn’t make us feel good. There’s a lot of data for that. So it really is a disaster for both our cognitive capacity, our energy, and our emotional health. All of these things, all of these things are deeply negatively affected if we create a day around constant back-and-forth context shifts.\n Rob Wiblin: Are there any studies that can speak to how much GDP or innovation or human potential at a global level we’re leaving on the table, as a species, basically?\n Cal Newport: I think it’s massive. So, one number that I think is provocative is, if you look at the industrial sector as an analog, right, and a number I like to cite is a number that  Peter Drucker cited towards the end of his life in 1999. He said, look, if you look at the industrial sector in the 20th century, there was 50x\n......", "posttime": "2021-07-30 07:08:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "newport", "title": "加州纽波特关于办公室工作的工业革命", "title_en": "Cal Newport on an industrial revolution for office work", "transed": 1, "url": "https://80000hours.org/podcast/episodes/cal-newport-industrial-revolution-for-office-work/", "via": "", "real_tags": ["newport"]}, {"category": "", "categoryclass": "", "imagename": "98687c2e9e3a054d90622f8d0d308420.jpeg", "infoid": 1070536, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "成为哈佛首位女性终身教授的间谍科拉·杜波依斯的非凡人生", "note_en": "The exceptional life of Cora Du Bois, the spy who became Harvard's first female permanent professor", "posttime": "2021-07-30 07:08:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "情报,intelligence,教授", "title": "特殊情报：科拉·杜波依斯的非凡人生 (2016)", "title_en": "Special intelligence: The exceptional life of Cora Du Bois (2016)", "transed": 1, "url": "https://www.the-tls.co.uk/articles/special-intelligence/", "via": "", "real_tags": ["情报", "教授"]}, {"category": "", "categoryclass": "", "imagename": "d1373bdd4354f91e8da7d04dccd6932c.gif", "infoid": 1070534, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "该分析利用了美国 2000 年至 2019 年间发生的致命车祸的完整数据集。结果表明，大型车辆增长较多的大都市地区的行人死亡率更高。在美国，行人中的交通死亡人数一直在上升，即使他们在驾车者中有所下降。与此同时，美国消费者对机动车辆的偏好发生了重大转变，大型运动型多功能车的市场份额不断增加。较大的车辆可能对行人构成风险，增加碰撞的严重性。我使用涵盖美国所有致命车辆碰撞的数据，并利用跨地铁更换车队的异质性进行识别。在 2000 年至 2019 年之间，我估计用汽车取代运动型多功能车的增长将避免 1,100 名行人死亡。我发现没有证据表明转向更大的车辆可以提高总体驾驶者的安全性。查看全文", "note_en": "The analysis makes use of a complete data set of fatal vehicle crashes in the US spanning 2000–2019.\n  Results suggest that metropolitan areas with more growth in large vehicles suffered greater rates of pedestrian fatalities.\n Traffic fatalities in the US have been rising among pedestrians even as they fall among motorists. Contemporaneously, the US has undergone a significant shift in consumer preferences for motor vehicles, with larger Sport Utility Vehicles comprising an increased market share. Larger vehicles may pose a risk to pedestrians, increasing the severity of collisions. I use data covering all fatal vehicle collisions in the US and exploit heterogeneity in changing vehicle fleets across metros for identification. Between 2000 and 2019, I estimate that replacing the growth in Sport Utility Vehicles with cars would have averted 1,100 pedestrian deaths. I find no evidence that the shift towards larger vehicles improved aggregate motorist safety.\n      View full text", "posttime": "2021-07-30 07:07:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "行人,deaths", "title": "行人死亡和大型车辆", "title_en": "Pedestrian Deaths and Large Vehicles", "transed": 1, "url": "https://www.sciencedirect.com/science/article/abs/pii/S2212012221000241?dgcid=author", "via": "", "real_tags": ["行人", "deaths"]}, {"category": "", "categoryclass": "", "imagename": "ba1cc068a49c1d643ed8d2db8e4e53fc.jpg", "infoid": 1070533, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Rick Astley 的“Never Gonna Give You Up”官方音乐视频订阅官方 Rick Astley YouTube 频道：https://RickAstley.lnk.to/YTSubIDFoll...", "note_en": "Rick Astley's official music video for “Never Gonna Give You Up” Subscribe to the official Rick Astley YouTube channel: https://RickAstley.lnk.to/YTSubIDFoll...", "posttime": "2021-07-30 07:07:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "give,官方", "title": "Never Gonna Give You Up（Rick Astley 着）达到 10 亿次观看", "title_en": "Never Gonna Give You Up (by Rick Astley) reaches one billion views", "transed": 1, "url": "https://www.youtube.com/watch?v=dQw4w9WgXcQ", "via": "", "real_tags": ["give", "官方"]}, {"category": "", "categoryclass": "", "imagename": "877bb57dfefb3b4b78f82afa1402400d.jpg", "infoid": 1070532, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "（美国有线电视新闻网）一位不想为同性伴侣创建婚礼网站的科罗拉多网页设计师已经失去了对该州反歧视法的吸引力。美国第十巡回上诉法院以宪法为由驳回了 303 Creative 所有者 Lorie Smith 对州法律的质疑。上诉裁决是在最高法院作出有利于同一州的一名面包师的裁决三年后做出的，该面包师拒绝为同性夫妇制作结婚蛋糕。上诉法院法官玛丽·贝克·布里斯科（Mary Beck Briscoe）代表多数人写作，表示同意持不同​​意见的法官的意见，并写道“信仰和宗教活动的多样性”，包括史密斯的“‘丰富’社会”。但法官写道，虽然史密斯的言论自由和自由行使权利“令人信服”，但它们并没有取代科罗拉多州的反歧视法。史密斯的代表是捍卫自由联盟，这是一个非营利性保守的基督教倡导组织，该组织辩称，该决定迫使其客户发布违反其宗教信仰的网站。 “政府永远不应该强迫创意专业人士宣传他们不同意的信息或事业。这是典型的言论自由和艺术自由，”ADF 高级法律顾问兼上诉倡导副总裁 John Bursch 在裁决后的一份声明中说。\n代表史密斯的 ADF 总法律顾问克里斯汀·瓦格纳 (Kristen Waggoner) 表示，该组织计划向美国最高法院提起上诉。在 ADF 的一份声明中，史密斯说她“与所有人合作”，但不会通过她的设计宣传“所有信息”。 “仅仅因为艺术家传达一种观点并不意味着他们应该被要求宣传相反的观点。政府不只是告诉我我不能说的；它告诉我我必须说的。我期待着上诉法院的决定，并支持所有美国人自由选择他们表达的信息，”史密斯说。首席法官蒂莫西·蒂姆科维奇（Timothy Tymkovich）在他的异议中写道，多数意见“支持政府对言论、宗教和良心问题进行实质性干预”。 “宪法既没有强迫史密斯女士妥协她的信仰，也没有宽恕政府这样做，”他写道。 “事实上，这个案例正好说明了为什么我们有第一修正案。正确应用，宪法保护史密斯女士免受政府告诉她该说什么或做什么。”根据意见，史密斯愿意为 LGBTQ 客户创建图形或网站，但打算拒绝为同性伴侣创建婚礼网站，她计划开始向异性结合提供这项服务。企业主的宗教信仰与 LGBTQ 权利之间的冲突，与商品和服务的销售有关，近年来在法庭上经常争论不休，最著名的是最高法院在 Masterpiece Cakeshop v. Colorado Civil Rights Commission 案中的裁决。\n尽管法院裁定面包店胜诉，但该决定并未解决有关宗教自由的更大的宪法问题。上个月，丹佛地区法院裁定 Masterpiece Cakeshop 的老板杰克·菲利普斯 (Jack Phillips) 拒绝为跨性别女性烤生日蛋糕违反了州歧视法。自 2018 年作出裁决以来，最高法院在很大程度上避免受理类似案件。 2019 年，法院将一起类似案件发回上诉法院，该案件涉及俄勒冈州一家面包店拒绝为同性夫妇制作结婚蛋糕。本月，最高法院拒绝受理华盛顿州花店巴罗内尔·斯图兹曼 (Barronelle Stutzman) 的上诉，后者因宗教问题拒绝为一对同性夫妇插花。华盛顿州最高法院已于 6 月对 Stutzman 作出裁决，称她的拒绝违反了反歧视法。", "note_en": "(CNN)A Colorado web designer who didn&#39;t want to create wedding websites for same-sex couples has lost her appeal of the state&#39;s anti-discrimination law.\n The US Court of Appeals for the 10th Circuit  rejected 303 Creative owner Lorie Smith&#39;s challenge to the state law on constitutional grounds.\n The appellate decision comes three years after the Supreme Court ruled in favor of a baker in the same state who refused to make a wedding cake for a same-sex couple.\n Appellate Court Judge Mary Beck Briscoe, writing for the majority, expressed agreement with the dissenting judge, writing &#34;diversity of faiths and religious exercise,&#34; including Smith&#39;s, &#34;&#39;enriches&#39; society.&#34;\n But the judge wrote that while Smith&#39;s free speech and free exercise rights were &#34;compelling,&#34; they did not supersede Colorado&#39;s anti-discrimination law.\n  Smith was represented by the Alliance Defending Freedom, a nonprofit conservative Christian advocacy group, which argued that the decision forces  its client  to publish websites that violate her religious beliefs.\n &#34;The government should never force creative professionals to promote a message or cause with which they disagree. That is quintessential free speech and artistic freedom,&#34; said ADF Senior Counsel and Vice President of Appellate Advocacy John Bursch  in a statement following the ruling.\n ADF&#39;s general counsel, Kristen Waggoner, who represented Smith says the group plans to appeal the decision to the US Supreme Court.\n In a statement via the ADF, Smith said she &#34;works with everyone&#34; but does not promote &#34;all messages&#34; through her designs.\n &#34;Just because artists communicate one viewpoint doesn&#39;t mean they should be required to promote an opposing viewpoint. The government isn&#39;t just telling me what I can&#39;t say; it&#39;s telling me what I must say. I look forward to appealing the court&#39;s decision and standing for the freedom of all Americans to choose which messages they express,&#34; Smith said.\n In his dissent, Chief Judge Timothy Tymkovich wrote that the  majority opinion &#34;endorses substantial government interference in matters of speech, religion and conscience.&#34;\n &#34;The Constitution neither forces Ms. Smith to compromise her beliefs nor condones the government doing so,&#34; he wrote. &#34;In fact, this case illustrates exactly why we have a First Amendment. Properly applied, the Constitution protects Ms. Smith from the government telling her what to say or do.&#34;\n Smith was willing to create graphics or websites for LGBTQ customers, according to the opinion, but intended to refuse  to create wedding websites for same-sex couples, a service she planned to begin offering to those in opposite-sex unions.\n Conflicts between a business owner&#39;s religious beliefs and LGBTQ rights, relating to the sale of goods and services, have been debated frequently in court in recent years, most notably in the Supreme Court&#39;s decision in Masterpiece Cakeshop v. Colorado Civil Rights Commission.\n Though the court ruled in favor of the bakery,  the decision did not settle larger constitutional questions about religious liberty.\n Last month, a Denver district court found that Masterpiece Cakeshop owner Jack Phillips had  violated state discrimination laws by refusing to bake a birthday cake for a trans woman.\n Since its 2018 decision, the Supreme Court has largely avoided taking up similar cases. In 2019, the court sent a similar case, which involved an Oregon bakery that refused to make a wedding cake for a same-sex couple, back to  the appeals court.\n This month, the Supreme Court  declined to take up an appeal from Washington state florist Barronelle Stutzman, who refused to make a floral arrangement for a same-sex couple due to religious concerns. The Washington state Supreme Court had already ruled against Stutzman in June, saying that her refusal violated anti-discrimination laws.", "posttime": "2021-07-30 07:07:02", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,失去,web,史密斯", "title": "拒绝制作同性婚礼网站的科罗拉多网页设计师失去吸引力", "title_en": "Colorado web designer who refused to make same-sex wedding websites loses appeal", "transed": 1, "url": "https://www.cnn.com/2021/07/29/us/same-sex-wedding-website-appeals-court-trnd/index.html", "via": "", "real_tags": ["设计", "失去", "web", "史密斯"]}, {"category": "", "categoryclass": "", "imagename": "8b15bf06619cd61ffdb848077302997e.jpeg", "infoid": 1070531, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本月早些时候，纽约长老会成为该州第一个要求员工接种 COVID-19 疫苗的医院系统。这是全国越来越多的医院正在采取的步骤，但该国最大的医疗保健联盟 1199SEIU 准备与之抗争。 1199SEIU 总裁 George Gresham 告诉 WNYC/Gothamist：“无论我们可以提出法律挑战，还是我们可以提出纯粹的组织挑战，我们都不会屈服。”工会总部位于纽约市，但代表全州以及马萨诸塞州、新泽西州、马里兰州、佛罗里达州和华盛顿特区的卫生保健工作者，格雷沙姆强调他接种了疫苗并鼓励所有工会成员这样做，但他相信医务工作者“有权就自己的健康做出决定”。格雷沙姆说，工会代表上周会见了纽约长老会总裁兼首席执行官史蒂夫科文博士，表达了他们的担忧。另一个医疗保健工会纽约州护士协会 (NYSNA) 表示反对强制接种疫苗，尽管它没有回应对此故事的评论请求。同样，当 WNYC/Gothamist 联系纽约长老会回应工会的立场时，它提到了 6 月 11 日发给员工的一份备忘录。备忘录说，所有员工必须在 9 月 1 日之前至少注射一次 COVID-19 疫苗才能保住工作。寻求医疗或宗教豁免的人必须在 8 月 1 日之前申请。到目前为止，NewYork-Presbyterian 大约 70% 的员工已经接种了疫苗。 “这件事的风险很高，有证据表明，接种 COVID-19 疫苗是我们作为 NYP 团队成员可以采取的最重要和最负责任的行动，以确保我们的患者和访客以及我们社区的安全和福祉和我们自己，”阅读这份由 Corwin 博士和 NewYork-Presbyterian 首席运营官 Laura Forese 博士签署的备忘录。纽约市地区的其他医院也在考虑类似的政策。 Northwell Health 是该州最大的医院系统，它要求在其设施内工作的所有新员工、志愿者和学生接种 COVID-19 疫苗，并将很快命令未接种疫苗的员工接受冠状病毒的定期检测。到目前为止，大约 75% 的 Northwell 员工已经拍摄了照片。\n与此同时，纽约市健康+医院只有 57% 的员工完全接种了疫苗，但该市的公立医院系统没有计划将接种疫苗作为就业条件。 COVID-19 疫苗的推出在该市和全国范围内停滞不前，即使 delta 变体在海外高接种人群中引起新的爆发。德克萨斯州最近的一项裁决可能会鼓励考虑这些任务的医疗保健雇主。上周，一名联邦法官驳回了休斯顿卫理公会医院员工质疑医疗保健提供者的疫苗要求的诉讼。据《华盛顿邮报》报道，最终有 153 人因拒绝接种疫苗而辞职或被解雇。联邦平等就业机会委员会也发布了指导意见，称雇主要求员工接种疫苗才能进入工作场所是合法的。 1199 的格雷沙姆说，工会成员绝大多数反对强制接种疫苗，即使他们自己注射了疫苗。但并非所有纽约长老会员工都与医疗保健工会持相同立场。医院系统中的一名护士是 NYSNA 成员，他说“需要更多的教育来鼓励员工接受它，并强调其安全性。”但这位不愿透露姓名的护士说，她对医院的要求感到高兴。她说：“我们被要求拥有如此多的其他疫苗来保护我们的患者以及我们的同事和我们自己。” NewYork-Presbyterian 在给员工的备忘录中指出，它已经有流感、麻疹、风疹和水痘的疫苗接种要求。尽管被认为是安全的，但 COVID-19 疫苗仍被归类为美国食品和药物管理局的紧急使用授权，并正在等待全面批准。其他医疗保健机构也可能会考虑向纽约的公立大学提出类似的警告，如果届时获得 FDA 的批准，则只需要在秋季学期为学生接种 COVID-19 疫苗。\n提交您的信息，即表示您同意根据我们的条款接收来自纽约公共广播电台的通讯。", "note_en": "Earlier this month, NewYork-Presbyterian became the first hospital system in the state to require employees to get vaccinated against COVID-19. It’s a step that a  growing number of hospitals across the country are taking, but one that 1199SEIU, the largest health care union in the country, is prepared to fight.\n “Whether there is a legal challenge that we can make, or whether it&#39;s just a pure organizational challenge that we can make, we are not going to just give in,” George Gresham, president of 1199SEIU, told WNYC/Gothamist. The union is headquartered in New York City but represents health care workers throughout the state and in Massachusetts, New Jersey, Maryland, Florida and Washington, D.C.\n Gresham emphasized that he got vaccinated and has encouraged all union members to do so, but that he believes medical workers “have the right to make their decision about their own health.” Gresham said union delegates met with Dr. Steve Corwin, president and CEO of NewYork-Presbyterian, to express their concerns last week.\n Another health care union, the New York State Nurses Association (NYSNA), has voiced opposition to  mandatory vaccination, although it did not respond to requests for comment for this story.\n Likewise, when WNYC/Gothamist contacted NewYork-Presbyterian to respond to the unions’ stances, it pointed to a memo sent to staff on June 11th. The memo says all employees must take at least one COVID-19 shot by September 1st to keep their jobs. Those seeking a medical or religious exemption must apply for one by August 1st. About 70% of staff at NewYork-Presbyterian have been vaccinated so far.\n “The stakes in this matter are high, and the evidence is clear that getting vaccinated against COVID-19 is the most important and responsible action we can take as NYP team members for the safety and well-being of our patients and visitors, our communities, and ourselves,” read the memo, signed by Dr. Corwin and Dr. Laura Forese, chief operating officer at NewYork-Presbyterian.\n Other hospitals in the New York City area are considering similar policies. Northwell Health, the largest hospital system in the state, requires all new hires, volunteers and students working in its facilities to get vaccinated against COVID-19 and will soon order employees who are not inoculated to submit to regular testing for the coronavirus. About 75% of Northwell staff have taken shots so far.\n Meanwhile, only 57% of employees at NYC Health + Hospitals are fully vaccinated, but the city’s public hospital system has no plans to make the shots a condition of employment. The COVID-19 vaccine rollout has stalled  in the city and  nationwide, even as the delta variant  causes new outbreaks in highly inoculated populations overseas.\n        Health care employers considering these mandates may be encouraged by a recent ruling in Texas. Last week, a  federal judge dismissed a lawsuit in which employees of Houston Methodist Hospital challenged the health care provider’s vaccine requirement. Ultimately, 153 people resigned or were fired over their refusal to get the vaccine, according to  The Washington Post. The federal Equal Employment Opportunity Commission has also  issued guidance saying it’s legal for employers to necessitate staff to get vaccinated in order to enter the workplace.\n Gresham of 1199 says that the union’s members are overwhelmingly against mandatory vaccination, even if they have taken shots themselves. But not all NewYork-Presbyterian employees share the position of the health care unions.\n One nurse in the hospital system, who is an NYSNA member, said there “needs to be more education to encourage employees to get it, with an emphasis on its safety.”\n But the nurse, who declined to be named because she is not authorized to speak to the press, said she was happy about the hospital’s requirement. “We are mandated to have so many other vaccines to protect our patients as well as our colleagues and ourselves,” she said.\n NewYork-Presbyterian noted in its memo to employees that it already has vaccination requirements for the flu, measles, rubella and varicella. While considered safe, the COVID-19 vaccines are still classified under emergency use authorization from the U.S. Food and Drug Administration and are awaiting full approval.\n Other health care institutions may also consider a similar caveat to public universities in New York, which will only require COVID-19 vaccines for students for the fall semester if one receives FDA approval by then.\n  By submitting your information, you&#39;re agreeing to receive communications from New York Public Radio in accordance with our  Terms.", "posttime": "2021-07-30 07:04:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,强制性,largest,疫苗", "title": "美国最大的医疗保健联盟发誓要对抗强制性 Covid-19 疫苗", "title_en": "America’s Largest Health Care Union Vows to Fight Mandatory Covid-19 Vaccines", "transed": 1, "url": "https://gothamist.com/news/americas-largest-health-care-union-vows-to-fight-mandatory-covid-19-vaccines", "via": "", "real_tags": ["美国", "强制性", "largest", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "e219270ef854b8351b840f7a908a6562.jpeg", "infoid": 1070530, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在一名退休实验室工作人员新发现一例朊病毒病后，法国的五家公共研究机构本周宣布暂停朊病毒研究三个月。如果发现该病例与实验室接触有关，这将是法国发现的第二例此类病例。 2019 年，该国的另一名实验室工作人员死于朊病毒病，享年 33 岁。大约九年后，她不小心用镊子刺伤了自己的拇指，用于处理感染了朊病毒的人源化小鼠大脑的冷冻切片。朊病毒是正常蛋白质的错误折叠、畸形形式，称为朊病毒蛋白，常见于人类和其他动物细胞中。朊病毒蛋白通常做什么还不清楚，但它们很容易在人脑中找到。当错误折叠的朊病毒进入混合​​物时，它会破坏它们周围的正常朊病毒蛋白，促使它们也错误折叠、聚集在一起并破坏其他蛋白。随着腐败在大脑中蔓延，它会导致脑组织损伤，最终导致形成小孔。这使大脑具有海绵状外观，这也是朊病毒疾病也称为传染性海绵状脑病 (TSE) 的原因。 TSE 的外在症状可能包括快速发展的痴呆症、疼痛的神经损伤、意识模糊、精神症状、移动和/或说话困难以及幻觉。没有针对 TSE 的疫苗或治疗方法。它们通常进展迅速，而且总是致命的。人类最常见的 TSE 类型是克雅氏病 (CJD)，它有两种形式：“经典型”和“变异型”。在美国和其他国家，经典形式的发病率约为百万分之一，患者通常在出现症状后一年内死亡。在大约 85% 的经典 CJD 患者中，发现该疾病是散发性的。也就是说，对于引发蛋白质错误折叠的原因没有明确的解释。在大约 5% 到 15% 的病例中，这种疾病被确定为遗传性，与克雅氏病家族史或与错误折叠相关的朊病毒蛋白突变有关。在极少数情况下，也可以通过感染朊病毒的医疗程序（例如角膜移植）获得经典 CJD。另一方面，变异型 CJD 是一种传染性类型，它通常与牛海绵状脑病 (BSE)，又名“疯牛病”病有关。人们可以通过食用受朊病毒污染的肉类感染变异 CJD，这似乎是 1980 年代和 1990 年代英国牛群 BSE 和人群中变异 CJD 大规模爆发的情况。似乎也有可能通过感染朊病毒的伤口发展出变异的 CJD，朊病毒甚至可能会在气溶胶中传播——至少研究人员已经证明这在老鼠身上是可能的。一旦发生暴露，变异 CJD 往往会潜伏约 10 年。也就是说，症状在朊病毒暴露后大约十年出现。重要的是，CJD 的经典和变异形式具有不同的临床和病理特征。一方面，经典的 CJD 倾向于影响老年人（死亡的中位年龄为 68 岁），而变异型倾向于更早发生（死亡的中位年龄为 28 岁）。经典 CJD 可能始于记忆问题和混乱，而变异 CJD 可能始于精神症状和疼痛的神经损伤。\n变异型 CJD 是 2019 年年轻实验室工作人员 Émilie Jaumain 感染朊病毒病的明确原因。 2010 年 5 月，24 岁的乔曼在弗朗西斯国家农业、食品和环境研究所 (INRAE) 的朊病毒实验室工作时，不幸刺伤了拇指，刺穿了双层乳胶手套和抽血。 “埃米莉一发生事故就开始担心，并向她见过的每一位医生都提到了这件事，”她的鳏夫阿梅尔·侯尔告诉《科学》杂志。根据去年发表在《新英格兰医学杂志》上的一份关于她的疾病和死亡的病例报告，乔曼于 2017 年 11 月首次出现症状，大约在事故发生后 7.5 年。症状开始时是她右肩和颈部的灼痛，在接下来的六个月中恶化并蔓延到她身体的右半部分。 2019 年 1 月，她变得抑郁和焦虑，并出现记忆障碍和幻视。她身体右侧的肌肉僵硬了。根据以乔曼名义成立的促进实验室安全协会的说法，她于 2019 年 4 月被诊断出患有变异 CJD，并在 6 月去世之前失去了移动和说话的能力。 NEJM 病例报告中的尸检分析证实了变异 CJD 的诊断。研究人员不能完全排除 Jaumain 在食用受污染的肉类后患上变异 CJD 的可能性。然而，NEJM 报告的作者指出，法国最后一例类似的 CJD 变异病例于 2014 年死亡。作者得出结论，2019 年法国发生变异 CJD 的风险“可以忽略不计或不存在”。作者还指出，变异 CJD 的职业案例并非闻所未闻。作者写道：“最后一位已知的意大利变异 CJD 患者于 2016 年去世，曾与感染 BSE 的脑组织有过职业接触，但随后的调查并未披露实验室事故。”到目前为止，对促使本周暂停的法国新病例知之甚少。在宣布暂停的联合声明中，研究机构表示，目前尚不清楚同样在 INRAE 工作的退休研究员是否患有变异或经典 CJD。 “从今天开始实施的暂停期将使研究观察到的病例与该人以前的职业活动之间存在联系的可能性成为可能，并在必要时调整研究实验室中现行的预防措施，”周二发布的联合声明内容如下。据《科学》杂志报道，Jaumain 的家人已对 INRAE 提起刑事指控和行政诉讼。该家庭的律师告诉该杂志，她没有接受过安全处理危险朊病毒的适当培训，没有戴金属网或手术手套，也没有立即将拇指浸泡在漂白剂中，律师说应该这样做。\n朊病毒净化是出了名的困难。世界卫生组织建议将废物在高浓度漂白剂中浸泡一小时，然后将其放入 121° 摄氏度（~250° 华氏度）或更高温度的高压灭菌器（基于蒸汽和压力的消毒机）中进行净化一个小时。也就是说，对于皮肤穿刺，世界卫生组织建议人们应该“轻轻地鼓励流血”并用肥皂和水清洗伤口。 《科学》杂志指出，法国调查人员在过去十年中在该国发现了 17 起涉及朊病毒的其他实验室事故，其中 5 起涉及割伤或刺伤。一些实验室表示，鉴于乔曼的死，他们提高了安全性，例如使用不如金属工具锋利的塑料工具和使用防割手套。", "note_en": "Five public research institutions in France announced  a three-month moratorium on prion research this week, following a newly identified case of prion disease in a retired lab worker.\n If the case is found to be linked to a laboratory exposure, it would be the second such case identified in France. In 2019, another lab worker in the country died of a prion disease at the age of 33. Her death came around nine years after she accidentally jabbed herself in the thumb with forceps used to handle frozen slices of humanized mouse brains infected with prions.\n  Prions are misfolded, misshapen forms of normal proteins, called prion proteins, which are commonly found in human and other animal cells. What prion proteins do normally is still unclear, but they&#39;re readily found in the human brain. When a misfolded prion enters the mix, it can corrupt the normal prion proteins around them, prompting them to misfold as well, clump together, and corrupt others. As the corruption ripples through the brain, it leads to brain tissue damage, eventually causing little holes to form. This gives the brain a sponge-like appearance and is the reason  prion diseases are also called transmissible spongiform encephalopathies (TSEs).\n Outward symptoms of TSEs can include rapidly developing dementia, painful nerve damage, confusion, psychiatric symptoms, difficulty moving and/or speaking, and hallucinations. There are no vaccines or treatments for TSEs. They often progress rapidly and are always fatal.\n The most common type of TSE in humans is  Creutzfeldt-Jakob disease (CJD), which has two forms: &#34;classic&#34; and &#34;variant.&#34; The classic form strikes about one person in a million in the US and other countries, and patients typically die within a year of the onset of symptoms. In roughly 85 percent of classic CJD patients, the disease is found to be sporadic. That is, there&#39;s no clear explanation of what sparked the protein misfolding. In about 5 percent to 15 percent of cases, the disease is determined to be hereditary, linked to a family history of CJD or a mutation in a prion protein that&#39;s linked to misfolding. In extremely rare cases, classic CJD can also be acquired, usually through prion-contaminated medical procedures, such as a cornea transplant.\n    Variant CJD, on the other hand, is an infectious type, and it&#39;s often associated with bovine spongiform encephalopathy (BSE), aka &#34;mad cow&#34; disease. People can contract variant CJD by eating prion-contaminated meat, which appeared to be the case in a large outbreak of BSE among cattle and variant CJD among people in the United Kingdom during the 1980s and 1990s. It also seems possible to develop variant CJD through prion-infected wounds, and prions may even be able to spread in aerosols—at least researchers have shown that  it&#39;s possible in mice. Once an exposure occurs, variant CJD tends to incubate for around 10 years. That is, symptoms show up around a decade after the prion exposure.\n  Importantly, the classic and variant forms of CJD have  distinct clinical and pathological features. For one thing, classic CJD tends to afflict older adults (median age of death is 68), while the variant form tends to strike earlier (median age at death is 28). Classic CJD may start with memory problems and confusion, while variant CJD may start with psychiatric symptoms and painful nerve damage.\n Variant CJD was the clear cause of the 2019 prion disease in the young lab worker, named Émilie Jaumain. In May of 2010, a 24-year-old Jaumain was working in a prion lab in Frances&#39; National Research Institute for Agriculture, Food and Environment (INRAE) when she tragically stabbed her thumb, piercing through a double-layer of latex gloves and drawing blood. &#34;Émilie started worrying about the accident as soon as it had happened, and mentioned it to every doctor she saw,&#34; her widower, Armel Houel,  told Science Magazine.\n According to  a case report of her disease and death published in the New England Journal of Medicine last year, Jaumain first developed symptoms in November 2017, about 7.5 years after the accident. The symptoms started as burning pain in her right shoulder and neck, which worsened and spread to the right half of her body over the next six months. In January 2019, she became depressed and anxious and had memory impairment and visual hallucinations. The muscles on the right side of her body stiffened. According to  an association set up in Jaumain&#39;s name to promote lab safety, she was diagnosed with variant CJD in April 2019, and, before her death in June, lost the ability to move and speak. Postmortem analysis included in the NEJM case report confirmed the diagnosis of variant CJD.\n    Researchers cannot entirely rule out the possibility that Jaumain developed variant CJD after eating contaminated meat. However, the authors of the NEJM report noted that the last similar case of variant CJD in France died in 2014. The authors concluded that the risk of developing variant CJD in France in 2019 was &#34;negligible or nonexistent.&#34;\n  The authors also note that the occupational cases of variant CJD are not unheard of. &#34;The last known Italian patient with variant CJD, who died in 2016, had had occupational contact with BSE-infected brain tissues, although subsequent investigation did not disclose a laboratory accident,&#34; the authors wrote.\n So far, little is known about the new case in France that prompted the moratorium this week. In a joint statement announcing the moratorium, the research institutions said that it was not yet known if the retired researcher, who also worked at the INRAE, had variant or classic CJD.\n &#34;The suspension period put in place as of this day will make it possible to study the possibility of a link between the observed case and the person&#39;s former professional activity and to adapt, if necessary, the preventive measures in force in the research laboratories,&#34; the joint statement, released Tuesday, reads.\n According to reporting by Science magazine, Jaumain&#39;s family has filed both criminal charges and an administrative lawsuit against the INRAE. The family&#39;s lawyer told the magazine that she had not been properly trained to safely handle dangerous prions, did not wear metal mesh or surgical gloves, and did not immediately soak the thumb in bleach, which the lawyer said should have been done.\n Prion decontamination is  notoriously difficult. The World Health Organization  recommends decontaminating waste materials by soaking them in a high concentration of bleach for an hour, then putting them in an autoclave (a steam- and pressure-based sterilization machine) at or above 121° Celsius (~250° Fahrenheit) for an hour. That said, for skin punctures, the WHO suggests people should &#34;gently encourage bleeding&#34; and wash the wound with soap and water.\n French investigators identified 17 other lab accidents involving prions in the past decade in the country, five of which involved cuts or stabs, Science noted. Some labs have said they had improved safety in light of Jaumain’s death, such as by using plastic tools that are less sharp than metal ones and using cut-resistant gloves.", "posttime": "2021-07-30 06:25:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "病毒,致命,worker,朊病毒", "title": "第二名患有致命朊病毒病的实验室工作人员促使法国暂停研究", "title_en": "Second lab worker with deadly prion disease prompts research pause in France", "transed": 1, "url": "https://arstechnica.com/science/2021/07/second-lab-worker-with-deadly-prion-disease-prompts-research-pause-in-france/", "via": "", "real_tags": ["病毒", "致命", "worker", "朊病毒"]}]