[{"category": "", "categoryclass": "", "imagename": "6fa2c1d2f0df8476dea8a0c8e5388f4d.jpeg", "infoid": 1066725, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "“在护理人员支付不佳的情况下，”这是卫生设施的一小次财富“，”联合创始人LéopoldReppoz告诉我。\n 传统的临时人员指挥机构雇用看护人和护士。当一个设施没有足够的员工时，他们会问他们通常的临时人员配置机构。该机构找到某人并为该设施收费。\n  “当我们开始时，我们认为我们会做一个临时人员配置机构，但更为数字，更多的技术，”Treppoz说。但是，初创公司意识到他们将面临与常规临时人员配置机构相同的问题。\n 相反，他们看着其他初创公司在自由职业者市场，为开发人员，项目经理，营销专家等等。在法国，他们中的一些人非常成功，如彗星，麦芽，员工和布里格 - 其中一些甚至在卫生专业人士上跑来垂直。但美联水想要专注于看护人。\n 签署Mediflash的专业人士是自由职业者。 Mediflash仅作为与护理人员联系健康设施的市场。该公司表示，护理人员可以预期更多收入 - 高达20％ - 虽然设施最终支付较少。\n 当然，由于临时人员指挥官雇用照顾者并不是一个公平的比较。作为一个自由职业者，您没有与全职员工的福利相同。特别是，您无法获得失业福利。\n “但很多看护人都说这不是一个问题，因为有很多要求[来自健康设施]，”Treppoz说。在平台上，你会发现养老院的学生，他们想赚取一些钱，已经有兼职工作的专业人士寻找额外的工作以及全职替代护理人员。 \n通常，设施只需要某人三天，因为他们正在努力工作。 Mediflash很清楚卫生设施通常与一个临时人员配置机构合作。 这就是为什么创业公司拥有一个销售团队，它必须逐一与每个设施与每个设施交谈。 现在，启动大多专注于Metz，Nancy和Strasbourg。  Mediflash最近通过Firstminute Capital筹集了200万美元的资金（1.7亿欧元）。 几个商业天使也参与，如亚历山大·弗雷特（麦芽），亚历山大·勒布伦（Nabla），Simon Dawlat（Batch.com）和玛丽  到目前为止，该公司已经管理了1,400天的替补天。 Mediflash在每笔交易上都会削减。 该公司现在计划扩展到全国各地的其他城市。 ", "note_en": "“It costs a small fortune to health facilities while caregivers are paid poorly,” co-founder Léopold Treppoz told me.\n Traditional temp staffing agencies hire caregivers and nurses on their payroll. When a facility doesn’t have enough staff, they ask their usual temp staffing agency. The agency finds someone and charges the facility.\n  “When we started, we thought we would do a temp staffing agency, but more digital, more tech,” Treppoz said. But the startup realized they would face the same issues as regular temp staffing agencies.\n Instead, they looked at other startups working on freelancer marketplaces for developers, project managers, marketing experts and more. In France, a few of them have been quite successful, such as  Comet,  Malt,  StaffMe and  Brigad — some of them even run a vertical focused on health professionals. But Mediflash wants to focus specifically on caregivers.\n Professionals signing up to Mediflash are freelancers. Mediflash only acts as a marketplace that connects health facilities with caregivers. The company says caregivers can expect more revenue — up to 20% — while facilities end up paying less.\n Of course, it’s not a fair comparison as temp staffing agencies hire caregivers. As a freelancer, you don’t have the same benefits as a full-time employee. And in particular, you can’t get unemployment benefits.\n “But a lot of caregivers say that this isn’t an issue because there is a lot of demand [from health facilities],” Treppoz said. On the platform, you’ll find students in nursing school who want to earn a bit of money, professionals who already have a part-time job looking for additional work as well as full-time substitute caregivers.\n Usually, facilities just want someone for three days because they’re running short on staff. Mediflash is well aware that health facilities usually work with one temp staffing agency and that’s it. That’s why the startup has a sales team that has to talk with each facility one by one. Right now, the startup is mostly focused on Metz, Nancy and Strasbourg.\n Mediflash recently raised a $2 million funding round (€1.7 million) led by Firstminute Capital. Several business angels are also participating, such as Alexandre Fretti (Malt), Alexandre Lebrun (Nabla), Simon Dawlat (Batch.com) and Marie\n  So far, the company has managed 1,400 substitute days. Mediflash takes a cut on each transaction. The company now plans to expand to other cities all around the country.", "posttime": "2021-06-19 00:12:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "卫生,freelancer", "title": "Mediflash是卫生专业人士的自由职业者市场 ", "title_en": "\n\t\t\t\tMediflash is a freelancer marketplace for health professionals\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/06/18/mediflash-is-a-freelancer-marketplace-for-health-professionals/", "via": "", "real_tags": ["卫生"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066724, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "来自机构和Noaa的科学家们说，地球的“能源不平衡”从2005年到2019年的“令人震惊”方式大致翻了一番\n    根据新的研究，地球正在捕捉到2005年的热量几倍，因为在气候危机中被描述为“前所未有的”增加。\n 来自美国宇航局，美国航天局和国家海洋和大气管理局（NOAA）的科学家们在一项新的研究中报告了地球的“能源不平衡大约加倍”，从2005年到2019年。增加被描述为“令人震惊”。\n   与“热红外辐射”反射回到空间，相比，“能量不平衡”是指地球大气层和表面吸收了大量的大气和表面之间的差异。\n “积极的能量不平衡意味着地球系统正在获得能量，导致行星升温，”美国宇航局在关于这项研究的陈述中说。\n 科学家通过比较来自卫星传感器的数据来确定能量不平衡 - 这跟踪了能量进入多少，并从海洋浮子中排出地球的系统和数据。\n 这种数据收集的浮子系统，它在全球范围内延伸，允许“准确估计世界海洋正在加热的速度”。 \n由于大约90％的多余能量在海洋中蜿蜒而来，卫星传感器的数据应与海洋的温度变化相对应。\n “查看地球能源不平衡变化的两个非常独立的方式都非常友好，它们都展现了这一非常大的趋势，这让我们很有信心是我们所看到的是真正现象而不仅仅是一个乐器工件，“诺曼洛伯说，领导学家和美国宇航局研究员说。\n  温室气体排放中的上涨在地球大气中保持热量，捕获辐射，否则将进入太空。这种变暖的马刺其他变化，包括冰雪融化。 NASA说，水蒸气的增加和对云变化的变化可以进一步加剧这种变暖。\n 该研究发现，这种加倍是结果，部分地通过温室气体和水蒸气的增加，以及云层和冰的减少。\n 研究人员还表示，从凉爽的阶段向太平洋到一个温暖的“天然存在”的转变可能在放大这种能量不平衡方面具有重要作用。\n “这可能是人为强迫和内部变异性的混合，”Loeb说。 “在此期间，它们都造成了变暖，这导致地球能量不平衡的相当大的变化。增加的幅度是前所未有的。“\n 然而，Loeb确实说，这项研究只提供了与Longterm Limate变化相关的一瞥，并且根据美国宇航局的说法，“未来几十年可能对地球能源预算的平衡来说，”不可能预测任何确定性。 “。 \n该研究确实确定了，除非热吸收率减慢，应预期较大的气候变化。 ", "note_en": "Scientists from agency and Noaa say Earth’s ‘energy imbalance’ roughly doubled from 2005 to 2019 in ‘alarming’ way\n    The Earth is trapping nearly twice as much heat as it did in 2005, according to new research, described as an “unprecedented” increase amid the climate crisis.\n Scientists from Nasa, the US space agency, and the  National Oceanic and Atmospheric Administration (Noaa), reported in a new study that Earth’s “energy imbalance approximately doubled” from 2005 to 2019. The increase was described as “alarming”.\n   “Energy imbalance” refers to the difference between how much of the Sun’s “radiative energy” is absorbed by Earth’s atmosphere and surface, compared to how much “thermal infrared radiation” bounces back into space.\n “A positive energy imbalance means the Earth system is gaining energy, causing the planet to heat up,” Nasa  said in a statement about this study.\n Scientists determined there was an energy imbalance by comparing data from satellite sensors – which track how much energy enters and exits Earth’s system – and data from ocean floats.\n This system of data-gathering floats, which stretches across the globe, allows for “an accurate estimate of the rate at which the world’s oceans are heating up”.\n Because about 90% of excess energy from an imbalance winds up in the ocean, the satellite sensors’ data should correspond with temperature changes in oceans.\n “The two very independent ways of looking at changes in Earth’s energy imbalance are in really, really good agreement, and they’re both showing this very large trend, which gives us a lot of confidence that what we’re seeing is a real phenomenon and not just an instrumental artifact,” said Norman Loeb, lead study author and a  Nasa researcher.\n  Upticks in  greenhouse gas emissions keep heat in Earth’s atmosphere, trapping radiation that would otherwise move into space. This  warming spurs other changes, including ice and snow melt. An increase in water vapor, and changes to clouds, could further exacerbate this warming, Nasa said.\n The study found that this doubling is the result, in part, by an increase in greenhouse gases and water vapor, as well as decreases in clouds and ice.\n Researchers also said that a “naturally occurring” shift in the Pacific ocean from a cool phase to a warm one probably had a significant role in amplifying this energy imbalance.\n “It’s likely a mix of anthropogenic forcing and internal variability,” Loeb said. “And over this period they’re both causing warming, which leads to a fairly large change in Earth’s energy imbalance. The magnitude of the increase is unprecedented.”\n Loeb did say, however, that this research provides only a glimpse in relation to longterm climate change, and, according to Nasa, that “it’s not possible to predict with any certainty what the coming decades might look like for the balance of Earth’s energy budget”.\n The study did determine that unless the rate of heat uptake slows, greater shifts in climate should be expected.", "posttime": "2021-06-19 00:05:55", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "nasa,前所未有,trapping,地球", "title": "NASA说，地球正在捕捉“前所未有的”的热量。 ", "title_en": "Earth is Trapping 'Unprecedented' Amount of Heat, NASA Says", "transed": 1, "url": "https://www.theguardian.com/science/2021/jun/17/earth-trapping-heat-study-nasa-noaa", "via": "", "real_tags": ["nasa", "前所未有", "trapping", "地球"]}, {"category": "", "categoryclass": "", "imagename": "dc4bca412d12326a9b2322a50baded20.png", "infoid": 1066722, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "让＆＃39;■rustls TLS库准备好尽可能多地替换OpenSSL。  当我们考虑对当今互联网最关键的代码最关键时，Linux内核位于列表的顶部。  阅读更多  现在是互联网上达到更安全的软件的时候了，这就是为什么我们的内存安全计划正在协调工作，以进一步改进Rustls TLS库。  阅读更多  Apache HTTP Server Httpd，是Internet基础架构的重要组件。 数亿个网站每天都使用它来服务要求。 因此，对HTTPD安全的改进具有广泛的影响。  阅读更多 \n作为Prossimo这样的雄心勃勃的工作的一部分比你想象的更容易：我们100％的资金来自公司和像你这样的人的慈善捐款。  当您支持PROSSIMO时，您可以帮助为Web创建一个更具内存安全和更安全的Web的未来 - 并且每个人都使用它！  捐  通过倡导组织中的内存安全代码来为您的组织带来更大的安全性！  许多组织与员工捐赠捐赠给非营利组织。 检查您的组织是否有匹配程序并对您的影响两倍！  看看您的组织是否有匹配计划  PROSSIMO用于连接互联网背后的维护人员，并通过采用内存安全语言向我们和组织向前迈进的人员和组织来连接维护者。 在这里＆＃39;这是Prossimo如何工作的简单框架： \n成为赞助商  捐赠股票赞赏的证券或相互基金股票，您拥有一年多年以上的优秀慈善礼物。  如果您在Sponsor@abetterinternet.org转移证券，请告诉我们。 您还可能想通过经纪人发送电子邮件授权信。  加密充电器的礼物我们接受BTC，BCH，ETH，DOGE，WBTC和BitPay支持的所有其他货币。 我们能够接受相当于1,000美元或更高的捐款。 请发送电子邮件@ adate@abetterinternet.org进行发票。  捐助者建议资金建议从您的礼品基金捐赠给互联网安全研究组（我们的父母组织）。 100％的捐款将用于支持安全和隐私尊重的互联网。 ", "note_en": "Let&#39;s get the Rustls TLS library ready to replace OpenSSL in as many projects as possible.\n When we think about what code is most critical for today’s Internet, the Linux kernel is at the top of the list.\n Read more\n It’s time for the Internet to move on to more secure software, and that’s why our Memory Safety Initiative is coordinating work to make further improvements to the Rustls TLS library.\n Read more\n The Apache HTTP Server, httpd, is an important piece of the Internet’s infrastructure. Hundreds of millions of websites use it every day to serve requests. As such, improvements to httpd security have broad impact.\n Read more\n Being part of ambitious work like Prossimo is easier than you might think: 100% of our funding comes from charitable donations from companies and people like you.\n When you support Prossimo, you’re helping to create a future for the Web that is more memory safe and more secure - and  that benefits everyone using it!\n Donate\n Bring greater security to your organization by advocating for memory safe code in your organization!\n Many organizations match donations to nonprofits made by employees. Check if your organization has a matching program and double your impact!\n See if your organization has a matching program\n Prossimo works to connect maintainers behind the Internet&#39;s most critical pieces of software with the people and organizations who want to see Internet security move forward by adopting memory safe languages. Here&#39;s the simple framework of how Prossimo works:\n    Become a Sponsor\n Donations of Stock  Appreciated securities or mutual fund shares that you’ve owned for more than one year can be excellent charitable gifts.\n  Please let us know if you are transferring securities at  sponsor@abetterinternet.org. You may also want to email the letter of authorization from your broker.\n Gifts of Cryptocurrency  We accept BTC, BCH, ETH, DOGE, WBTC, and all other currencies supported by BitPay. We are able to accept donations equivalent to $1,000 USD or greater. Please email  donate@abetterinternet.org for invoicing.\n Donor Advised Funds  Recommend a donation to Internet Security Research Group (our parent org) from your gift fund. 100% of your donation will go to support a secure and privacy-respecting Internet.", "posttime": "2021-06-19 00:04:04", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "内存,基础设施,memory,组织", "title": "PROSSIMO  - 互联网最关键的基础设施的内存安全 ", "title_en": "Prossimo – Memory safety for the Internet's most critical infrastructure", "transed": 1, "url": "https://www.memorysafety.org/", "via": "", "real_tags": ["内存", "基础设施", "memory", "组织"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1066721, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "词源WordNet项目提供有关如何在不同语言中的单词的信息是源性相关的。\n 这些信息是从维基词典开采的大部分。半结构化数据变成机器可读的导源数据库，还包含一些额外的手动添加的结果关系。\n 在Lexvo.com提供的（旧版本）的一个非常基本的接口（旧版本）在Lexvo.com上提供了更高级的浏览界面将稍后可用。\n  基于JVM的ProGamming语言（如Java，Scala等）的编程访问。下载UWN库和词源Wordnet插件。\n 注意：新版本目前在工程中，预计将在2020年夏季发布。请尽快回复！\n 对于学术用途，请引用以下出版物：Gerard de Melo。词源Wordnet：跟踪单词历史：proc。 LREC 2014. Elra，2014年，巴黎，法国。 Gerard de Melo和Gerhard Weikum。迈向普遍的多语言知识库：多语种Wordnets的原则，建设和应用。第五届全球Wordnet会议的诉讼程序（GWC 2010）。 Narosa Publishing 2010，新德里印度。\n  如果您想向Etymology Wordnet提供贡献或者您有其他建议或研究建议，请与Gerard de Melo取得联系。如果您考虑到了特定的研究项目，则有几种方法可以提高数据。 \n最大的多语言知识图之一，将众所周知的WordNet数据库转换为大量的多语言资源，涵盖在单个语义组织的层次结构中超过100万字和数百万个命名实体的大量多语言资源。这是基于机器学习以及基于Menta扩展 Wikipedia.our衍生工程OpenwordNet-Pt（GitHub）正在谷歌翻译使用。  为链接数据Web和语义Web提供有关单词和其他语言相关实体的信息，导致英国库，西班牙语库和其他人将其数据链接到Lexvo.org和Lexvo的数据网络。 ORG又将其自身的数据连接到其他有价值的资源。  用于情感分析和细粒度的情感分析的数据集和资源，部分可用于多种语言。 ", "note_en": "The Etymological Wordnet project provides information about how words in different languages are etymologically related.\n The information is for the most part mined from  Wiktionary. The semi-structured data is turned into a machine-readable etymological database that also incorporates some additional manually added etymological relationships.\n A very basic interface to (an older version of) the data is provided at  lexvo.com.A more advanced browsing interface will be available later.\n  Programmatical access for JVM-based progamming languages such as Java, Scala, and so on. Download the UWN library and the Etymological Wordnet plugin.\n Note: A new version is currently in the works and expected to be released in the summer of 2020. Please check back soon!\n For academic use, please cite the following publications:   Gerard de Melo.  Etymological Wordnet: Tracing the History of Words    In:  Proc.  LREC 2014. ELRA, 2014, Paris, France.   Gerard de Melo and  Gerhard Weikum.  Towards Universal Multilingual Knowledge Bases     In:  Principles, Construction, and Applications of Multilingual Wordnets. Proceedings of the  5th Global Wordnet Conference (GWC 2010). Narosa Publishing 2010, New Delhi India.\n  Please get in touch with  Gerard de Melo if you would like to contribute to the Etymological WordNet or if you have additional suggestions or research proposals. There are several ways in which the data could be improved if you have a specific research project in mind.\n One of the largest multilingual knowledge graphs, transforming the well-known  WordNet database into a massively multilingual resource covering over 1 million words and several million named entities in a single semantically organized hierarchy.This is based on machine learning along with the  MENTA extension based on Wikipedia.Our derivative project  OpenWordNet-PT ( GitHub) is being used by  Google Translate.\n  Contributes information about words and other language-related entities to the  Linked Data Web and Semantic Web, leading to a Web of Data in which the  British Library, the  Spanish National Library, and others have linked their data to Lexvo.org, and Lexvo.org in turn connects its own data to other valuable resources.\n Datasets and resources for sentiment analysis and fine-grained emotion analysis, in part available for multiple languages.", "posttime": "2021-06-19 00:03:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "词源,etymological,wordnet", "title": "词源Wordnet. ", "title_en": "Etymological Wordnet", "transed": 1, "url": "http://etym.org/", "via": "", "real_tags": ["词源", "wordnet"]}, {"category": "", "categoryclass": "", "imagename": "a8985a52fcbb0bdd2b6f8d76585548a5.jpg", "infoid": 1066720, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "MIRER CAR WASH INC.MCW，已将其首次公开发行的条款设定，这将使基于亚利桑那州的洗车连锁价值高达50.3亿美元。 该公司希望筹集高达6.375亿美元，因为它在IPO提供了3750万股，预计价格为15美元至17美元。 该公司预计首次公开募股后有296.07万股股份。 这些股票预计将在Ticker符号＆＃34下列出纽约证券交易所。＆＃34; BOFA Securities，Morgan Stanley，高盛和杰弗里斯是铅版本。 该公司于2020年录制了5930万美元的净收入为5.74亿美元，2019年收入约为9.29亿美元的收入约为6.295亿美元。该公司在众议院IPO ETF IPO，+ 0.37％的时间里寻求公开 在过去的三个月里，在S＆amp; P 500 SPX，-0.95％的同时下滑了3.5％。 ", "note_en": "Mister Car Wash Inc.  MCW,   has set terms of its initial public offering, which would value the Arizona-based  carwash chain at up to $5.03 billion. The company is looking to raise up to $637.5 million, as it is offering 37.5 million shares in the IPO, which is expected to price between $15 and $17 a share. The company expects to have 296.07 million shares outstanding after the IPO. The stock is expected to list on the NYSE under the ticker symbol &#34;MCW.&#34; BofA Securities, Morgan Stanley, Goldman Sachs and Jefferies are the lead underwriters. The company recorded net income of $59.3 million on revenue of $574.9 million in 2020, after income of about $920,000 on revenue of $629.5 million in 2019. The company is looking to go public at a time that the Renaissance IPO ETF  IPO,  +0.37% has slipped 3.5% over the past three months while the S&amp;P 500  SPX,  -0.95% has gained 6.3%.", "posttime": "2021-06-19 00:03:37", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "car,预计", "title": "Mister Car Wash设置了IPO术语，这些术语在大约5亿美元上价值 ", "title_en": "Mister Car Wash sets IPO terms that values the carwash chain at about $5B", "transed": 1, "url": "https://www.marketwatch.com/story/mister-car-wash-sets-ipo-terms-that-values-the-carwash-chain-at-about-5-billion-2021-06-17", "via": "", "real_tags": ["car", "预计"]}]