[{"category": "", "categoryclass": "", "imagename": "cc40af140ab39a82b7664f046aadbb18.jpg", "infoid": 1004346, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "周五，数以千计的人走上明尼阿波利斯街头，抗议当地黑人乔治·弗洛伊德(George Floyd)的死亡。弗洛伊德是当地一名白人警察在逮捕期间跪在他脖子上后死亡的。在此期间，一架海关和边境巡逻无人机一直在密切关注正在展开的动乱。\n来自实时航班跟踪服务FlightAware的这一消息显示，这架无人机使用跟踪信号CBP104，于中部夏令时上午9点08分从大福克斯空军基地起飞，不久后直接飞往明尼阿波利斯。从上午10点45分左右到中午，无人机在这座城市盘旋了6圈。飞机保持在约2万英尺的高度。\n大福克斯空军基地是空军第319侦察联队的所在地。它也是海关和边境巡逻人员用来起飞和降落捕食者B无人机系统的场地。CPB通过帮助识别和拦截潜在的恐怖分子和非法越境活动，在反恐行动中使用无人机。\n在特朗普总统给明尼阿波利斯的抗议者贴上暴徒的标签，并承诺提供军事支持以对抗他们不到12小时后，边境巡逻队部署了这架无人机：\n今天早些时候，应我们在明尼阿波利斯的联邦执法合作伙伴的要求，美国海关和边境保护、空中和海洋行动无人机系统准备提供实况视频，以帮助了解情况。无人机系统向地面执法部门提供实时视频馈送，使他们获得态势感知，最大限度地提高公共安全，同时将对人员和资产的威胁降至最低。\n在抵达明尼阿波利斯领空后，请求机构确定飞机不再需要用于作战意识，并返回大福克斯。\nCBP AMO经常与其他联邦、州和地方执法实体一起开展行动，以协助执法和人道主义救援工作。\n根据联邦法律和政策，AMO在全国范围内执行其使命，而不仅仅是在边境。在人道主义任务期间，除执法任务外，古迹办事处定期部署无人驾驶飞机系统，以协助联邦应急管理局评估飓风影响地区，与国家气象局协调拍摄受风暴影响地区的图像，并与联邦、州和地方合作伙伴执行搜索和救援任务。\n本周早些时候，明尼阿波利斯警察局白人警官德里克·肖文(Derek Chauvin)被铐在地上，跪在弗洛伊德的脖子上，随后发生了明尼阿波利斯抗议活动。可以看到弗洛伊德逐渐变得一动不动，肖文和其他三名警察无视旁观者要求停止的呼喊。在过去的四天里，明尼阿波利斯和美国各地的人们走上街头抗议暴力事件。\n据美联社报道，肖文于周五被捕，并被控三级谋杀罪和杀人罪。亨内平县检察官迈克·弗里曼(Mike Freeman)表示，对其他三名警官的调查仍在继续。这四个人都被解雇了。\n正如主板早些时候报道的那样，CBP104是电子前沿基金会发现的2012年飞行日志中捕获的无人驾驶飞机。日志显示了所做的活动，包括捕获合成孔径雷达图像和视频，以帮助监视和逮捕大麻种植业务和甲基苯丙胺实验室。在一个案例中，无人机反复盘旋并实时向警方提供视频，直到所有实验室嫌疑人都被抓获。", "note_en": "Thousands of people took to the streets of Minneapolis on Friday to protest the death of George Floyd, a local black man who died after a white police officer knelt on his neck during an arrest. All the while, a Customs and Border Patrol drone kept a careful eye on the unfolding unrest.\n The drone, using the tracking signal CBP104, took off from Grand Forks Airforce Base at 9:08 am Central Daylight Time and shortly afterward headed directly to Minneapolis,  this feed from live flight tracking service FlightAware showed. The drone then circled the city six times from about 10:45 until noon. The aircraft maintained an altitude of about 20,000 feet.\n Grand Forks AFB is the home of the Air Force&#39;s 319th Reconnaissance Wing. It is also a site Customs and Border Patrol personnel use for takeoff and landing of the  Predator B unmanned aircraft system. CPB uses the drone in anti-terrorism operations by helping to identify and intercept potential terrorists and illegal cross-border activity.\n The Border Patrol deployed the drone less than 12 hours after President Trump labeled the Minneapolis protestors &#34;thugs&#34; and pledged military support to counter them:\n   Earlier today a U.S. Customs and Border Protection, Air and Marine Operations unmanned aircraft system was preparing to provide live video to aid in situational awareness at the request of our federal law enforcement partners in Minneapolis. The unmanned aircraft system provides live video feed to ground law enforcement, giving them situational awareness, maximizing public safety, while minimizing the threat to personnel and assets.\n After arriving into the Minneapolis airspace, the requesting agency determined that the aircraft was no longer needed for operational awareness and departed back to Grand Forks.\n CBP AMO routinely conducts operations with other federal, state, and local law enforcement entities to assist law enforcement and humanitarian relief efforts.\n AMO carries out its mission nationwide, not just at the border, consistent with federal laws and policies. During humanitarian missions AMO regularly deploys the unmanned aircraft system to assist FEMA in assessing hurricane affected areas, in coordination with the National Weather Service to capture imagery of storm impacted areas, and with federal, state and local partners to conduct search and rescue missions, in addition to its law enforcement mission.\n The Minneapolis protests come after video footage emerged earlier this week of white Minneapolis Police Department officer Derek Chauvin earlier kneeling on Floyd&#39;s neck while he was handcuffed and on the ground. Floyd can be seen gradually becoming motionless as Chauvin and three other officers ignore bystanders’ shouts to stop. People in Minneapolis and cities across the US have taken to the streets to protest the violence in the four days that have passed.\n Chauvin was  arrested on Friday and charged with third-degree murder and homicide, the Associated Press reported. Hennepin County Attorney Mike Freeman said an investigation continues into the three other officers. All four have been fired.\n As  reported earlier by Motherboard CBP104 is the unmanned aircraft captured in 2012 flight logs  spotted by the Electronic Frontier Foundation. The logs showed the done activities including the capture of synthetic-aperture radar imagery and video to aid in surveilling and arresting cannabis growing operations and methamphetamine labs. In one case, the drone repeatedly circled and fed video in real time to police until all lab suspects have been captured.", "posttime": "2020-05-30 08:58:51", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "巡逻队,patrol,执法", "title": "边境巡逻队驾驶反恐无人机飞越明尼阿波利斯抗议者", "title_en": "Border Patrol Flies Anti-Terrorism Drone Over Minneapolis Protestors", "transed": 1, "url": "https://arstechnica.com/tech-policy/2020/05/border-patrol-drone-used-in-anti-terror-ops-flies-over-minneapolis-protestors/", "via": "", "real_tags": ["巡逻队", "patrol", "执法"]}, {"category": "", "categoryclass": "", "imagename": "5b70a80f7b8bfcb34348fa0ef0ed01b5.jpg", "infoid": 1004345, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "GitHub周四发布了安全警报，警告一种新的恶意软件变种，这种变种已经通过诱人的Java项目在其网站上传播。\nGitHub的安全团队已将该恶意软件命名为Octopus Scanner，该软件是在使用Apache NetBeans IDE(集成开发环境)管理的项目中发现的，Apache NetBeans IDE是一种用于编写和编译Java应用程序的工具。\nGitHub表示，在3月9日收到一名安全研究人员的提示后，它在其网站上发现了26个上传到其网站上的包含八达通扫描仪恶意软件的存储库。\nGitHub说，当其他用户下载26个项目中的任何一个时，恶意软件的行为就像是自我传播的病毒，并感染他们的本地计算机。\n它将扫描受害者的工作站以查找本地安装的NetBeans IDE，然后继续深入开发人员的其他Java项目。\n该恶意软件可在Windows、MacOS和Linux上运行，然后将下载远程访问特洛伊木马(RAT)作为其感染的最后一步，允许八达通扫描仪操作员在受感染受害者的计算机中搜寻敏感信息。\nGitHub表示，八达通扫描仪活动已经持续了多年，2018年8月，最古老的恶意软件样本被上传到VirusTotal网络扫描仪上，在此期间，恶意软件运行畅通无阻。\n虽然GitHub表示，它在其平台上只发现了26个上传的项目，其中包含八达通扫描仪恶意软件的痕迹，但它认为，在过去两年里，有更多的项目被感染。\n然而，攻击的真正目的是在从事敏感项目或在主要软件公司内部工作的开发人员的机器上放置老鼠，而不一定是毒害开源Java项目。\nRAT将授予攻击者访问权限，以窃取有关即将推出的工具、专有源代码或更改代码以在企业或其他封闭源代码软件中启用后门的机密信息。\nGitHub的安全团队在周四的一份报告中表示，有趣的是，这个恶意软件专门攻击了NetBeans的构建过程，因为它不是当今使用的最常见的Java IDE。\nGitHub补充说，如果恶意软件开发人员花时间专门为NetBeans实现了此恶意软件，这意味着这可能是一次有针对性的攻击，或者他们可能已经为Make、MsBuild、Gradle等构建系统实现了恶意软件，并且它可能正在不知不觉中传播。\n虽然感染构建过程当然不是一个新想法，但看到它在野外被积极部署和使用肯定是一个令人不安的趋势。\nGitHub没有公布26个中毒项目的名称，但已经公布了八达通扫描仪感染过程的细节，因此NetBeans用户和Java开发者可以查看他们的项目是否有被更改的迹象。", "note_en": "GitHub has issued a security alert on Thursday warning about a new malware strain that&#39;s been spreading on its site via boobytrapped Java projects.\n The malware, which GitHub&#39;s security team has named  Octopus Scanner, has been found in projects managed using the  Apache NetBeans IDE (integrated development environment), a tool used to write and compile Java applications.\n GitHub said it found 26 repositories uploaded on its site that contained the Octopus Scanner malware, following a tip it received from a security researcher on March 9.\n GitHub says that when other users would download any of the 26 projects, the malware would behave like a self-spreading virus and infect their local computers.\n It would scan the victim&#39;s workstation for a local NetBeans IDE installation, and proceed to burrow into the developer&#39;s other Java projects.\n    The malware, which can run on Windows, macOS, and Linux, would then download a remote access trojan (RAT) as the final step of its infection, allowing the Octopus Scanner operator to rummage through an infected victim&#39;s computer, looking for sensitive information.\n GitHub says the Octopus Scanner campaign has been going on for years, with the oldest sample of the malware being uploaded on the VirusTotal web scanner in August 2018, time during which the malware operated unimpeded.\n   While GitHub says it found only 26 projects uploaded on its platform that contained traces of the Octopus Scanner malware, it believes that many more projects have been infected during the past two years.\n However, the true purpose of the attack was to place a RAT on the machines of developers working on sensitive projects or inside major software companies, and not necessarily to poison open-source Java projects.\n The RAT would have given the attacker(s) access to steal confidential information about upcoming tools, proprietary source code, or alter code to enable backdoors in enterprise or other closed-source software.\n  &#34;It was interesting that this malware attacked the NetBeans build process specifically since it is not the most common Java IDE in use today,&#34; GitHub&#39;s security team said in a report on Thursday.\n &#34;If malware developers took the time to implement this malware specifically for NetBeans, it means that it could either be a targeted attack, or they may already have implemented the malware for build systems such as Make, MsBuild, Gradle and others as well and it may be spreading unnoticed,&#34; GitHub added.\n &#34;While infecting build processes is certainly not a new idea, seeing it actively deployed and used in the wild is certainly a disturbing trend.&#34;\n GitHub did not publish the name of the 26 poisoned projects, but has  published details about Octopus Scanner&#39;s infection process, so NetBeans users and Java developers can look for signs if their projects have been altered.", "posttime": "2020-05-30 08:42:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "软件,隐藏,buried,恶意软件", "title": "自2018年8月以来在NetBeans版本中发现隐藏的恶意软件", "title_en": "Malware found buried in NetBeans releases since August 2018", "transed": 1, "url": "https://www.zdnet.com/article/github-warns-java-developers-of-new-malware-poisoning-netbeans-projects/", "via": "", "real_tags": ["软件", "隐藏", "buried", "恶意软件"]}, {"category": "", "categoryclass": "", "imagename": "353fd0e4ac7c726533e94bfa33f35f54.jpeg", "infoid": 1004344, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在经历了一系列艰难的一周之后，这是令人难以置信的艰难的一周。乔治·弗洛伊德被杀再次表明，对于美国的黑人来说，只是.", "note_en": "This has been an incredibly tough week after a string of tough weeks. The killing of George Floyd showed yet again that for Black people in America, just...", "posttime": "2020-05-30 08:27:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "留下,zuckerberg,美国", "title": "马克·扎克伯格为留下特朗普帖子辩护", "title_en": "Mark Zuckerberg defends leaving up Trump posts", "transed": 1, "url": "https://www.facebook.com/zuck/posts/10111961824369871", "via": "", "real_tags": ["留下", "美国"]}, {"category": "", "categoryclass": "", "imagename": "52c0fad43cdd78332891b3e49ac6484f.jpg", "infoid": 1004343, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "CNN的奥马尔·希门尼斯在明尼阿波利斯抗议现场直播时被警方拘留，此前他清楚地表明了自己的身份。", "note_en": "CNN's Omar Jimenez was taken into police custody during a live broadcast at the site of the protests in Minneapolis, after clearly identifying himself to off...", "posttime": "2020-05-30 07:57:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cnn,arrest,奥马尔", "title": "警方在电视直播中逮捕CNN记者奥马尔·希门尼斯和工作人员", "title_en": "Police arrest CNN correspondent Omar Jimenez and crew on live television", "transed": 1, "url": "https://www.youtube.com/watch?v=ftLzQefpBvM", "via": "", "real_tags": ["cnn", "arrest", "奥马尔"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004341, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是一个简短的使用铁锈和戈多3.2的指南。本文在编写时考虑到了Linux，但是大部分知识应该可以移植到MacOS和Windows上。\n将Rust代码和Godot项目分开是值得的，因为我体验过Godot时不时地尝试从Rust项目导入各种文件，留下相当长的等待时间盯着进度条。\n#[宏_使用]外部机箱gdative；#[派生(gdative：：NativeClass)]#[Inherit(gdative：：Node)]struct HelloWorld；#[gdative：：Methods]Impll HelloWorld{fn_init(_owner：gdative：：node)-&gt；self{HelloWorld}#[export]FN_Ready(&amp；self，_owner：gdative：：node){Godot_Print！)}}fn init(Handle：gdative：：init：：InitHandle){handle.add_class：：&lt；HelloWorld&gt；()；}godot_gdative_init！()；godot_nativescript_init！(Init)；godot_gdative_Terminate！()；\n运行Cargo Build，您应该在target/debug/中有一个lib&lt；projectname&gt；.so文件(其中&lt；projectname&gt；是您的项目的名称)，一旦该文件被创建，就应该将其复制/移动到您的Godot项目中。\n如果在Mac上执行此操作，则文件扩展名为.dylib，而不是.so，而在Windows上为.dll。\n如果您使用的是MacOS或Windows，请选择相应的平台。同样适用于32位和64位。\n选择库后，保存GDNativeLibrary，因为保存场景时不会保存它，并确保文件扩展名为.gdnlib(默认为.tres)。\n这是最后一步。一旦您创建(并保存！)。您终于可以添加一个节点并将HelloWorld结构附加到它。\n如果您将第4步中的代码复制到lib.rs中，您可能已经注意到在#[Inherit(gdative：：Node)]中使用Node作为所有者类型。\n如果要使用其他节点类型，例如空间或精灵，请将节点替换为新的节点类型。\n在“Language”部分中，将“GDScript”更改为“NativeScript”，并在类名中输入“HelloWorld”(这应该是您的结构的名称)。\n最后，您需要加载步骤5中的gdnlib文件。选择“Library”下拉列表(当前为[空])，选择“Load”，最后选择您的gdnlib文件。\n如果您使用F6键(或按“Play Scene”)运行项目，您应该会看到“hello，world”。在Godot输出控制台中。\n它将gdnativedocumentation(运行Cargo文档--从您的Rust项目中打开)与Godot文档结合起来：https://docs.godotengine.org/en/stable/index.html，，例如查看RUST文档中的Call签名，以及Godot文档中的默认值，这将有助于弄清楚大多数事情是如何工作的。\n如果您希望在发生死机时查看堆栈跟踪，并且正在为Release进行构建，请将以下内容添加到Cargo.toml文件中：", "note_en": "This is a short guide to get going with  Rust and  Godot 3.2. This iswritten with Linux in mind but most of the knowledge should be transferable toMacOS and Windows.\n     It is worth keeping the Rust code and the Godot project separate from eachother, as I experienced Godot trying to import various files from the Rust projectevery now and then, leaving a rather long wait staring at a progress bar.\n       #[macro_use] extern  crate gdnative; #[derive(gdnative::NativeClass)] #[inherit(gdnative::Node)] struct  HelloWorld; #[gdnative::methods] impl HelloWorld {  fn  _init(_owner:  gdnative::Node) -&gt;  Self { HelloWorld }  #[export]  fn  _ready( &amp;self, _owner:  gdnative::Node) { godot_print !( &#34;hello, world.&#34;) }} fn  init(handle:  gdnative::init::InitHandle) { handle.add_class:: &lt;HelloWorld &gt;();}godot_gdnative_init !();godot_nativescript_init !(init);godot_gdnative_terminate !();\n Run  cargo build and you should have a  lib&lt;projectname&gt;.so file in target/debug/ (where  &lt;projectname&gt; is the name of your project)This file should be copied / moved into your Godot project once that’s crated.\n In case this is done on a Mac the file extension would be  .dylib and not .so, and on Windows it’s  .dll.\n        If you are on MacOS or Windows select the corresponding platform.Same goes for 32 vs 64-bit\n  Once the library is selected, save the  GDNativeLibrary, as it is  not savedwhen you save the scene, and make sure the file extension is  .gdnlib (it willdefault to .tres).\n   This is the final step. Once you have created (and saved!) your  GDNativeLibraryyou can finally add a node and attach your  HelloWorld struct to it.\n  If you copied the code from step 4 into  lib.rs you may have noticed theuse of  Node as the  owner type, as well as in  #[inherit(gdnative::Node)].\n  If you want to use another node type, e.g  Spatial or  Sprite, replace Node with the new node type.\n Attach a new script to the node.In the “Language” section change from “GDScript” to “NativeScript”, and enter“HelloWorld” in the class name (this should be the name of your struct).\n   Finally you need to load the  gdnlib file from step 5. Select the “Library”drop-down (currently reading [empty]), select “Load” and finally select your gdnlib file.\n  If you run the project with F6 (or press “Play Scene”) you should see “hello,world.” in the Godot output console.\n  It will help with figuring out how most things work by combining the  gdnativedocumentation (run  cargo doc --open from your rust project) with the Godotdocumentation:  https://docs.godotengine.org/en/stable/index.html, e.g seeing thecall signature in Rust docs, and the default values in the Godot documentation.\n If you want to see stack traces in the event of a panic and you are building forrelease, add the following to your  Cargo.toml file:", "posttime": "2020-05-30 07:11:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "rust,铁锈,godot,文件", "title": "戈多铁锈", "title_en": "Godot Rust", "transed": 1, "url": "https://hagsteel.com/posts/godot-rust/", "via": "", "real_tags": ["rust", "铁锈", "godot", "文件"]}, {"category": "", "categoryclass": "", "imagename": "65e745c496aef7bc47b11cd25ddb1064.jpg", "infoid": 1004339, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "编者按，2020年5月29日：2017年，史密森尼报道了针对菲兰多·卡斯蒂尔谋杀案判决的抗议活动中警察暴行的历史。在乔治·弗洛伊德被杀后，双子城再次成为全国关注的焦点，我们再次关注以下主题。上个月，在明尼苏达州圣保罗的抗议者枪杀32岁的菲兰多·卡斯蒂尔的事件中，陪审团宣判前警官杰罗尼莫·亚尼斯过失杀人罪无罪几个小时后，明尼苏达州圣保罗的抗议者关闭了94号州际公路。当他们在黑暗的夜里沿着高速公路行进时，上面写着“黑人的生命很重要”和“没有正义，没有和平”的标语响起了“菲兰多，菲兰多”的口号。\n这一幕很熟悉。一年前，当亚尼斯因尾灯损坏而停车杀害卡斯蒂尔时，爆发了大规模抗议活动。仪表盘摄像头的镜头显示，亚尼斯从卡斯蒂尔开着的车窗开枪，几秒钟前，卡斯蒂尔披露他拥有并获准携带隐蔽武器。\n作为一名受人尊敬的学校营养师，卡斯蒂利亚是2016年被警方枪杀的233名非裔美国人之一，考虑到人口统计学，这是一个令人震惊的数字。非洲裔美国人约占美国人口的13%，但占被警察开枪打死的人的24%。据“华盛顿邮报”报道，黑人被警察开枪打死的可能性是美国白人的2.5倍。\n今天的故事绝不是最近才出现的现象。史密森国家非裔美国人历史和文化博物馆藏品中的一张纸板标语牌，以及在新展览“不仅仅是一幅画”中展出的，都强调了这一现实。\n这个发黄的标语提醒人们，持续不断的压迫和暴力已经不成比例地撼动了几代人的黑人社区-“我们要求现在就结束警察的暴行！”是用红白相间的字母画的。\n大学教授塞缪尔·埃格顿(Samuel Egerton)将这张海报捐赠给了博物馆，他说：“50年后的信息仍然悬而未决。”他在1963年向华盛顿进军期间携带了它以示抗议。五十年后，这张海报传达的信息听起来非常及时，令人担忧。如果不是因为边缘发黄，这张标语牌几乎可能被误认为是过去三年中任何一次黑人生命也是游行的标志。\n有人问民权的拥护者，‘你什么时候才能满意？’小马丁·路德·金说。在他标志性的1963年游行演讲中，我有一个梦想。在经历了非洲裔美国公民和警察之间漫长的暴力对抗历史后，他的话在今天继续引起共鸣。只要黑人是警察无法形容的暴行的受害者，我们就永远不会满意。\n博物馆高级历史策展人威廉·普雷策(William Pretzer)表示，1963年，警察暴行的想法在人们的脑海中非常流行，随后几年，实际上是几十年，警察滥用权力，然后几个世纪以来，非裔美国人受到压迫，威廉·普雷策(William Pretzer)说。\n直到19世纪30年代和40年代，北方城市决定需要更好地控制快速增长的人口，现代警务机构才演变成一个有组织的机构。美国第一个警察局于1838年在波士顿成立。最受严厉策略打击的社区是最近的欧洲移民。但是，随着非裔美国人逃离吉姆·克罗(Jim Crow)南部的恐怖，他们也成为了他们寻求庇护的北部城市残酷和惩罚性警察行动的受害者。\n1929年，伊利诺伊州刑事司法协会发布了伊利诺伊州犯罪调查报告。这项调查在1927年至1928年之间进行，试图分析芝加哥和库克县犯罪率高的原因，特别是在与阿尔·卡彭有关联的罪犯中。但调查也提供了有关警察活动的重要数据-调查显示，尽管非裔美国人仅占该地区人口的5%，但他们占警察杀戮受害者的30%。\n怀俄明大学社会学教授约翰·马尔科姆·D·霍姆斯(Malcolm D.Holmes)表示，警察和公民之间发生了很多一对一的冲突，其中很多都是由警方发起的。霍姆斯曾就警察暴行这一话题进行了广泛的研究并撰写了大量文章。\n同年，赫伯特·胡佛(Herbert Hoover)总统成立了全国法律观察和执法委员会(National Commission On Law Observance And Execution)，除了调查警察战术外，还调查与禁止有关的犯罪。在1931年至1932年期间，该委员会以14卷的形式公布了调查结果，其中一卷的标题是《执法无法无天报告》。尽管该委员会没有彻底解决种族差异问题，但警察暴行的现实还是被曝光了。\n在民权时代，虽然许多运动领导人主张和平抗议，但20世纪60年代充满了暴力和破坏性的骚乱。\n在和平抗议和静坐中，针对个人的咄咄逼人的驱散策略，如警犬和消防水龙，是那个时代警察暴行最广为人知的例子。但正是有色人种社区无处不在的暴力警察在当地日常层面上建立了不信任。\n1967年，纽瓦克发生了最致命的骚乱之一，当时警察在一次交通拦截中严重殴打了黑人出租车司机约翰·史密斯(John Smith)。在持续四天的动乱中，有26人死亡，另有多人受伤。1968年，美国总统林登·B·约翰逊(Lyndon B.Johnson)组织成立了全国公民无序咨询委员会(National Consulting Commission On Civil Disorder)，调查这些重大骚乱的原因。\n纽瓦克骚乱的起因在警察与公民之间的事件中并不是独一无二的。委员会得出的结论是，在调查的24种疾病中，有12种在暴力爆发之前，警方的行动是最后的事件。\n该委员会将种族隔离和贫困确定为指标，并公布了减少社会不平等的建议，并建议“扩大和重新定位城市重建计划，优先考虑直接帮助低收入家庭获得适足住房的项目.”然而，约翰逊拒绝了委员会的建议。\n黑人报纸报道了整个20世纪初和中期发生的警察暴行事件，无线电讲故事的普及进一步传播了这些故事。1991年，在出租车司机罗德尼·金(Rodney King)被殴打后，视频片段生动地向更多观众讲述了电视上警察暴行的故事。这些警察被判无罪，他们用警棍打了金50多次。\n今天，直播、推文和Facebook帖子猛烈抨击警察暴行事件，超越了黑人社区，进入了主流媒体。菲兰多·卡斯蒂尔的未婚妻戴蒙德·雷诺兹(Diamond Reynolds)在被枪击时和女儿在车里，她在手机上通过Facebook Live直播了枪击事件的经过。\n普雷策说，现代技术允许白人社区注意到这类情况和事件，这一点确实是坚持的。\n随着技术的发展，执法设备也在发展。配备军用级别装备的警察部门已经成为美国城市的常态。每当这些事件发生时，戴着头盔和防弹衣的警察乘坐坦克在居民区穿行的画面，伴随着抗议的故事。\n我们看到的是一种不平等关系的延续，这种不平等关系已经恶化，如果你愿意的话，因为军事化和全国警察部队火力的增加，这种不平等关系变得更加严重，普雷策说。\n根据普雷策的说法，解决问题的办法不仅在于改善这些不平衡的警察与社区关系，更重要的是，消除使这些关系永久化的社会不平等，这些关系维持着双方的不信任和挫败感。\n人们有一种刻板印象认为人们或多或少是危险的。福尔摩斯说，人们对武力的依赖超出了完成警察职责所必需的范围。警察部门中有很多这样的东西助长了这个问题。", "note_en": "Editor&#39;s Note, May 29, 2020: In 2017,   Smithsonian covered the history of police brutality upon the protests over the verdict in the Philando Castile murder case. With the Twin Cities once again under the national spotlight after the killing of George Floyd, we revisit the subject matter below. \r\r  Last month, hours after a jury acquitted former police officer  Jeronimo Yanez of manslaughter in the shooting death of 32-year-old  Philando Castile, protesters in St. Paul, Minnesota,  shutdown Interstate 94. With signs that read: “Black Lives Matter” and “No Justice, No Peace,” the chant of “Philando, Philando” rang out as they marched down the highway in the dark of night.\n  The scene was familiar. A year earlier, massive protests  had erupted when Yanez killed Castile, after pulling him over for a broken taillight. Dashcam footage  shows Yanez firing through the open window of Castile’s car, seconds after Castile disclosed that he owned and was licensed to carry a concealed weapon.\n  A respected school nutritionist, Castile was one of 233 African-Americans  shot and killed by police in 2016, a startling number when demographics are considered. African-Americans  make up 13 percent of the U.S. population but account for 24 percent of people fatally shot by police.  According to the  Washington Post, blacks are &#34;2.5 times as likely as white Americans to be shot and killed by police officers.&#34;\n  Today&#39;s stories are anything but a recent phenomenon. A  cardboard placard in the collections of the Smithsonian&#39;s  National Museum of African American History and Culture and on view in the new exhibition “ More Than a Picture,” underscores that reality.\n    The yellowing sign is a reminder of the continuous oppression and violence that has disproportionately shaken black communities for generations—“We Demand an End to Police Brutality Now!” is painted in red and white letters.\n  “The message after 50 years is still unresolved,” remarks Samuel Egerton, a college professor, who donated the poster to the museum. He carried it in protest during the 1963 March on Washington. Five decades later, the poster’s message rings alarmingly timely. Were it not for the yellowed edges, the placard could almost be mistaken for a sign from any of the  Black Lives Matter marches of the past three years.\n  &#34;There are those who are asking the devotees of civil rights, ‘When will you be satisfied?&#34;  said Martin Luther King, Jr. in his iconic &#34;I Have a Dream&#34; speech at the 1963 march. His words continue to resonate today after a long history of violent confrontations between African-American citizens and the police. &#34;We can never be satisfied as long as the Negro is the victim of the unspeakable horrors of police brutality.&#34;\n  &#34;This idea of police brutality was very much on people’s minds in 1963, following on the years, decades really, of police abuse of power and then centuries of oppression of African-Americans,&#34; says William Pretzer, senior history curator at the museum.\n    Modern policing did not evolve into an organized institution until the 1830s and &#39;40s when northern cities decided they needed better control over quickly growing populations. The first American police department  was established in Boston in 1838. The communities most targeted by harsh tactics  were recent European immigrants. But, as African-Americans fled the horrors of the Jim Crow south, they too  became the victims of brutal and punitive policing in the northern cities where they sought refuge.\n  In 1929, the Illinois Association for Criminal Justice published the  Illinois Crime Survey. Conducted between 1927 and 1928, the survey sought to analyze causes of high crime rates in Chicago and Cook County, especially among criminals associated with Al Capone. But also the survey provided data on police activity—although African-Americans made up just five percent of the area&#39;s population, they constituted 30 percent of the victims of police killings, the survey revealed.\n  &#34;There was a lot of one-on-one conflict between police and citizens and a lot of it was initiated by the police,&#34; says  Malcolm D. Holmes, a sociology professor at the University of Wyoming, who has researched and  written about the topic of police brutality extensively.\n  That same year, President Herbert Hoover established the  National Commission on Law Observance and Enforcement to investigate crime related to prohibition in addition to policing tactics. Between 1931 and 1932, the commission published the findings of its investigation in 14 volumes, one of which was titled  “Report on Lawlessness in Law Enforcement.” The realities of police brutality came to light, even though the commission did not address racial disparities outright.\n  During the Civil Rights Era, though many of the movement&#39;s leaders advocated for peaceful protests, the 1960s were fraught with violent and destructive riots.\n    Aggressive dispersion tactics, such as police dogs and fire hoses, against individuals in peaceful protests and sit-ins were the most widely publicized examples of police brutality in that era. But it was the pervasive violent policing in communities of color that built distrust at a local, everyday level.\n    One of the deadliest riots occurred in Newark in 1967 after police officers severely  beat black cab driver John Smith during a traffic stop. Twenty-six people died and many others were injured during the four days of unrest. In 1968, President Lyndon B. Johnson organized the  National Advisory Commission on Civil Disorders to investigate the causes of these major riots.\n    The origins of the unrest in Newark weren&#39;t unique in a police versus citizen incident. The commission  concluded &#34;police actions were &#39;final&#39; incidents before the outbreak of violence in 12 of the 24 surveyed disorders.”\n    The commission identified  segregation and poverty as indicators and published recommendations for reducing social inequalities,  recommending an “expansion and reorientation of the urban renewal program to give priority to projects directly assisting low-income households to obtain adequate housing.” Johnson, however,  rejected the commission’s recommendations.\n    Black newspapers reported incidents of police brutality throughout the early and mid-20th century and the popularization of radio storytelling spread those stories even further. In 1991, following the beating of cab driver Rodney King, video footage vividly  told the story of police brutality on television to a much wider audience. The police officers, who were acquitted of the crime, had hit King more than 50 times with their batons.\n    Today, live streaming, tweets and Facebook posts have blasted the incidents of police brutality, beyond the black community and into the mainstream media. Philando Castile’s fiancée, Diamond Reynolds, who was in the car with her daughter when he was shot, streamed the immediate aftermath of the shooting on her phone using Facebook live.\n    &#34;Modern technology allows, indeed insists, that the white community take notice of these kinds of situations and incidents,&#34; says Pretzer.\n    And as technology has evolved, so has the equipment of law enforcement. Police departments with military-grade equipment  have become the norm in American cities.  Images of police officers in helmets and body armor riding through neighborhoods in tanks accompany stories of protests whenever one of these incidents occurs.\n  &#34;What we see is a continuation of an unequal relationship that has been exacerbated, made worse if you will, by the militarization and the increase in fire power of police forces around the country,&#34; says Pretzer.\n    The resolution to the problem, according to Pretzer, lies not only in improving these unbalanced police-community relationships, but, more importantly, in eradicating the social inequalities that perpetuate these relationships that sustain distrust and frustration on both sides.\n    &#39;There’s a tendency to stereotype people as being more or less dangerous. There’s a reliance upon force that goes beyond what is necessary to accomplish police duty,&#34; says Holmes. &#34;There’s a lot of this embedded in the police departments that helps foster this problem.&#34;", "posttime": "2020-05-30 07:10:54", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "警察,painful", "title": "美国警察暴行的漫长而痛苦的历史。", "title_en": "The Long, Painful History of Police Brutality in the U.S.", "transed": 1, "url": "https://www.smithsonianmag.com/smithsonian-institution/long-painful-history-police-brutality-in-the-us-180964098/", "via": "", "real_tags": ["警察", "painful"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004338, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2020年5月29日星期五早上6点08分，David Laight&lt；David.Laight@aculab.com&gt；写道：&gt；&gt；宽屏是用来查看大量文件的。不一定。过多的换行符是不好的。它们造成了现实的和日常的问题。它们会在模式和输出中给像grep&34；这样的东西带来问题，因为grep(和许多其他非常基本的Unix实用程序)基本上是基于行的。因此，事实是，我们中的许多人很久以前就跳过了整个80列终端模型，原因与我们一次可见的行比25行多得多。老实说，我不想看到补丁使内核阅读体验对我来说更糟，可能对绝大多数人来说也是如此，因为有些怪人的终端窗口很小。如果您或Christoph有80个字符行，您可能会得到难看的换行输出。硬汉。那是你的选择。您的硬件限制应该不会给我们其他人带来痛苦。更长的队伍基本上是有用的。我的显示器不仅比它高得多，而且我的字体普遍都比它高得窄。排长队是很自然的。当我在显示器上平铺终端窗口时，我一次可以看到6个终端，这是因为我有三个宽的终端。我还可以并排放进第四个的80%。你猜怎么着？这就是我的默认终端窗口(转到GNOME终端设置，您会发现80x25只是一个可以更改的初始默认设置)，而不是一些80x25。这是一种具有抗锯齿功能的字体，而且不是一些像素化的乱七八糟的东西。实际上，我的大多数航站楼最终都被拖得更宽更高。我检查了一下，我的主要终端现在是142x76个字符，因为事实证明，更宽(和更高)的终端不仅对源代码有用。您最近有没有看过PS AX的产量？还是用过&#34；top&#34；？或者做完--Stat&34；或者任何数量的事情，结果证明80x25真的是非常有限的，只是对我们大多数人来说已经不再相关了，或者是做了一些事情，结果证明80x25真的很有限，而且对我们大多数人来说已经不再是那么重要了。所以不是。我不关心有80x25终端窗口的人换行。出于完全相同的原因，如果有人说他们的内核编译需要10个小时，因为他们是在内存为4 GB的Raspberry PI上进行内核开发，我发现这完全无关紧要。硬件受限的人不应该给拥有更好资源的人带来更多不便。是的，我们会在合理的范围内处理。但事实并非如此，就我而言，2020年的80列航站楼再也不合理了。早在80年代，人们就普遍使用132柱端子，看在上帝的份上，不要试图把80柱定为不可移动的标准。如果选择使用80列端子，您可以忍受换行。事情就是这么简单。而且，更长的队伍非常有用。部分原因是我们不再是80年代的编程人员，我们的源代码也因此从根本上变得更加宽泛。是的，局部迭代变量仍然被称为“局部迭代变量”，因为更多的上下文对某些匿名计数器没有帮助。简洁明了仍然是一件好事，过于冗长的名字本质上并不是更好的。但是，使用10-15个字符的变量名是完全合理的，而且它使代码更易读。把东西写出来，而不是使用缩写等。是的，我们确实使用宽制表符，因为这使得缩进是你可以在结构中一目了然地看到的，而且是在整个功能的基础上，而不是你必须在视觉上将东西排成一行或计算空格的东西。在这方面，我们确实使用了宽制表符，因为这使得你可以在结构中一目了然地看到整个功能，而不是试图在视觉上排列或计算空格。因此，我们有很多相当基本的问题，在许多情况下，这些问题很容易造成更长的队伍。是的，我们在某些时候会换行。但真的没有任何理由让这一点再长达80栏了。莱纳斯", "note_en": "On Fri, May 29, 2020 at 6:08 AM David Laight &lt;David.Laight@aculab.com&gt; wrote: &gt; &gt; A wide monitor is for looking at lots of files.  Not necessarily.  Excessive line breaks are BAD. They cause real and every-day problems.  They cause problems for things like &#34;grep&#34; both in the patterns and in the output, since grep (and a lot of other very basic unix utilities) is fundamentally line-based.  So the fact is, many of us have long long since skipped the whole &#34;80-column terminal&#34; model, for the same reason that we have many more lines than 25 lines visible at a time.  And honestly, I don&#39;t want to see patches that make the kernel reading experience worse for me and likely for the vast majority of people, based on the argument that some odd people have small terminal windows.  If you or Christoph have 80 character lines, you&#39;ll get possibly ugly wrapped output. Tough. That&#39;s _your_ choice. Your hardware limitations shouldn&#39;t be a pain for the rest of us.  Longer lines are fundamentally useful. My monitor is not only a lot wider than it is tall, my fonts are universally narrower than they are tall. Long lines are natural.  When I tile my terminal windows on my display, I can have 6 terminals visible at one time, and that&#39;s because I have them three wide. And I could still fit 80% of a fourth one side-by-side.  And guess what? That&#39;s with my default &#34;100x50&#34; terminal window (go to your gnome terminal settings, you&#39;ll find that the 80x25 thing is just an initial default that you can change), not with some 80x25 one. And that&#39;s with a font that has anti-aliasing and isn&#39;t some pixelated mess.  And most of my terminals actually end up being dragged wider and taller than that. I checked, and my main one is 142x76 characters right now, because it turns out that wider (and taller) terminals are useful not just for source code.  Have you looked at &#34;ps ax&#34; output lately? Or used &#34;top&#34;? Or done &#34;git diff --stat&#34; or any number of things where it turns out that 80x25 is really really limiting, and is simply NO LONGER RELEVANT to most of us.  So no. I do not care about somebody with a 80x25 terminal window getting line wrapping.  For exactly the same reason I find it completely irrelevant if somebody says that their kernel compile takes 10 hours because they are doing kernel development on a Raspberry PI with 4GB of RAM.  People with restrictive hardware shouldn&#39;t make it more inconvenient for people who have better resources. Yes, we&#39;ll accommodate things to within reasonable limits. But no, 80-column terminals in 2020 isn&#39;t &#34;reasonable&#34; any more as far as I&#39;m concerned. People commonly used 132-column terminals even back in the 80&#39;s, for chrissake, don&#39;t try to make 80 columns some immovable standard.  If you choose to use a 80-column terminal, you can live with the line wrapping. It&#39;s just that simple.  And longer lines are simply useful. Part of that is that we aren&#39;t programming in the 80&#39;s any more, and our source code is fundamentally wider as a result.  Yes, local iteration variables are still called &#39;i&#39;, because more context just isn&#39;t helpful for some anonymous counter. Being concise is still a good thing, and overly verbose names are not inherently better.  But still - it&#39;s entirely reasonable to have variable names that are 10-15 characters and it makes the code more legible. Writing things out instead of using abbreviations etc.  And yes, we do use wide tabs, because that makes indentation something you can visually see in the structure at a glance and on a whole-function basis, rather than something you have to try to visually &#34;line up&#34; things for or count spaces.  So we have lots of fairly fundamental issues that fairly easily make for longer lines in many circumstances.  And yes, we do line breaks at some point. But there really isn&#39;t any reason to make that point be 80 columns any more.   Linus", "posttime": "2020-05-30 07:10:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,托瓦尔,linus,终端", "title": "莱纳斯·托瓦尔兹：但不，2020年的80柱航站楼已经不再“合理”了", "title_en": "Linus Torvalds: But no, 80-column terminals in 2020 isn't “reasonable” any more", "transed": 1, "url": "https://lkml.org/lkml/2020/5/29/1038", "via": "", "real_tags": ["2020", "托瓦尔", "linus", "终端"]}, {"category": "", "categoryclass": "", "imagename": "45eb1af30d997b780cecaad33ed63610.jpg", "infoid": 1004337, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "5月29日，抗议活动的第四天，州巡逻人员封锁了明尼阿波利斯的一条道路。\n明尼阿波利斯警察局拥有广泛的监控技术，可用于监控和瞄准抗议者-包括有争议的面部识别软件Clearview AI、车牌阅读器、车身摄像头和视频分析工具。该部门和邻近城市的执法机构有用科技监视居民的历史，这种科技可以加快识别并可能逮捕人的过程。\n本月，警方采取行动，对明尼阿波利斯一名手无寸铁的黑人男子和肯塔基州路易斯维尔一名手无寸铁的黑人女性的死亡展开调查后，美国各地爆发了抗议活动-包括明尼阿波利斯、丹佛、哥伦布和纽约-表达了悲痛和愤怒，并要求结束警察的暴行。\n在5月25日46岁的乔治·弗洛伊德(George Floyd)死亡后，明尼阿波利斯一直是这些抗议活动的中心。弗洛伊德是在一名白人警察拘留他并将他勒住膝盖后死亡的。在弗洛伊德死前的瞬间，摄像机捕捉到了他挣扎着呼吸，反复告诉警察，“我不能呼吸了”和“他们要杀了我。”\n随着抗议者走上街头，他们将受到执法机构的监视，执法机构已经试验或目前正在部署各种监控工具。明尼阿波利斯警察局过去曾使用过一系列技术--包括Clearview AI，它已经从社交媒体上抓取了数十亿张照片，为其面部识别工具提供动力。附近的警察局，以及亨内平县警长办公室和明尼苏达融合中心-这两个机构的管辖范围覆盖了明尼阿波利斯-也使用了Clearview。\nACLU的高级立法顾问尼玛·辛格·古利亚尼(Neema Singh Guliani)告诉BuzzFeed新闻：“从高水平上讲，这些监控技术不应该用于抗议者。”“有一群人提出了合理的担忧，现在可能会因为他们选择抗议而受到面部识别或监控，这一想法放大了人们对执法部门拥有这项技术的整体担忧。”\n根据BuzzFeed News查阅的文件，截至2月份，明尼阿波利斯警察局的10多名用户已经进行了160多次搜查。负责监管明尼阿波利斯所在县的亨内平县警长办公室也在10个账户中进行了近400次搜查。明尼苏达州融合中心-明尼苏达州刑事逮捕局(BCA)的一个专门部门，共享犯罪情报-截至2月份已经进行了近40次搜索。\n明尼苏达州融合中心的一位发言人告诉BuzzFeed新闻，我们过去曾使用Clearview人工智能在人口贩运案件的图像中帮助识别身份不明的受害者。明尼阿波利斯警察局和亨内平县警长办公室没有回复记者的置评请求。\n截至2月份，邻近的圣保罗警察局已经使用Clearview的面部识别工具进行了近40次搜索。明尼苏达州普赖尔湖(Prior Lake)是明尼阿波利斯西南约20英里的郊区，该州警察局在2019年7月至2020年2月期间使用三个Clearview账户进行了1100多次搜查。\n普赖尔湖警察局没有回复记者的置评请求。圣保罗警察局的一名发言人否认在他们与几个单位核实后使用了Clearview，尽管BuzzFeed新闻看到了这些数据。过去，多个警察部门最初否认使用Clearview，然后在对其警官进行全面审查或审计后收回他们的声明。\n明尼阿波利斯警察局尚未公开其面部识别的使用情况。今年7月，该部门的一名发言人告诉明尼阿波利斯明星论坛报(Minneapolis Star Tribune)，该组织没有部署这项技术的计划，但根据BuzzFeed News看到的数据，当月至少有一名与该组织相关的用户在Clearview AI上创建了一个账户。\n当地记者托尼·韦伯斯特(Tony Webster)获得的记录显示，亨内平县警长办公室自2013年以来一直在部署面部识别。今年7月，“明星论坛报”(Star Tribune)报道称，该办公室通过面部识别工具运行了一名嫌疑人从Instagram上拍摄的照片，以揭示可能的匹配。目前还不清楚这个面部识别工具是由Clearview提供的，还是由另一家公司提供的。Clearview已经从Facebook、Instagram和Twitter上拍摄了图像，以培训其软件。\n明尼阿波利斯警察局还使用了广泛的其他监控工具。在2019年的一份白皮书中，该部门表示，它使用了自动车牌阅读器，即捕捉车牌图像的设备，使警方能够潜在地跟踪一个人在整个城市或地区的移动。2009年，该市向总部位于田纳西州的交通摄像头公司PIPS Technology支付了超过5万美元的固定和移动车牌阅读器。\n此外，根据BuzzFeed新闻通过公开记录请求获得的新收据，从2016年10月到2019年9月，邻近的普里湖警察局已经为汤姆森路透社Clear支付了数千美元-这是一种执法数据聚合工具，也被移民和海关执法局使用。Clear结合了来自手机、车牌阅读器和实时逮捕记录的数据。总体而言，这些数据使警方追踪和逮捕嫌疑人变得更快、更容易。\n明尼阿波利斯警察局还使用了Securonet，这是一种监控工具，可以让警方上传手机录像，将其与闭路电视录像整合在一起，并将其可视化到地图上。警察局于2017年开始使用Securonet，当时该市正在举办2018年超级碗(Super Bowl)。该部门在2019年与Securonet签署了另一份合同。\n今年，明尼阿波利斯开始使用BriefCam，这是一种在全市铁路、公交车和地铁系统中使用的高清晰度监控摄像头系统。该市警察局在白皮书中表示，目前没有将监控摄像头与实时或自动面部识别相结合，但指出“可以想象，这种情况在不久的将来可能会改变。”\n1月30日，明尼阿波利斯居民里奇·纽迈斯特(Rich Neumeister)向城市数据实践小组委员会提交了书面证词，敦促该市对面部识别的使用实施限制。在撰写本文时，没有任何限制。\n他说：“需要有护栏、标准和限制政策，这样执法机构才不会秘密制定使用和规则。”“如果这项繁重而强大的技术得不到控制，我们的隐私和公民自由可能会被削弱。”\n明尼阿波利斯警察局还与警察随身相机Axon签订了一份为期五年的合同，合同将持续到2021年。该协议涉及向该市所有888名宣誓警察提供随身相机。2018年，警察局收到了国土安全部的拨款，帮助支付这些摄像头的费用。\n明尼阿波利斯还安装了一系列闭路电视摄像头，警方可以进入。明尼阿波利斯警察局在一份监控白皮书中表示，他们使用Arxys的里程碑软件来分析闭路电视录像。Arxys是一款视频管理工具，声称提供视频运动检测和视频分析功能。\n明尼阿波利斯警察局已经支付了200多万美元购买ShotSpotter，这是一款音频监控工具，可以监听枪声，并在地图上可视化可能的枪击地点。到目前为止，没有证据表明ShotSpotter公司声称的那样有效地减少了犯罪，让城市变得“更安全”。\n正如一份监控白皮书中指出的那样，在明尼阿波利斯运作的执法机构，如国营的明尼苏达州BCA，可以获得更多的监控工具。例如，明尼苏达州的BCA有能力部署黄貂鱼，这是一种模仿手机发射塔的工具，以近似定位手机用户的位置。据称，黄貂鱼被用来攻击黑人生命也是抗议者。\n随着抗议活动的展开，明尼阿波利斯也可能受到联邦层面的监视。据政府监督项目的调查记者杰森·帕拉迪诺(Jason Paladino)称，周五，海关和边境保护局(CBP)驾驶一架捕食者无人机飞越了这座城市。\n在BuzzFeed News获得的周五发给国会工作人员的一份声明中，CBP官员表示，应我们在明尼阿波利斯的联邦执法伙伴的要求，CBP的空中和海上行动部门正准备提供实况视频，以帮助我们了解情况。该机构表示，无人机经常部署在全国各地，以加强执法和人道主义救援工作。\n声明写道，在抵达明尼阿波利斯领空后，请求机构确定该飞机不再需要用于作战意识，并返回大福克斯。\n此外，根据亚马逊的活跃合作伙伴关系地图，明尼阿波利斯大都市区的几个地方警察部门-包括斯普林湖公园、布鲁克林中心、普利茅斯、圣路易斯公园和伊迪纳-已经与亚马逊的家庭监控公司Ring签署了合同。环形合同使警方能够进入该公司的执法门户网站，该门户网站允许警察在没有事先获得搜查令的情况下向居民索要摄像机镜头。作为交换，Ring向警方提供免费摄像头，如果警方说服足够多的人下载其邻里守望应用程序Neighborhood，它还向警方提供更多免费摄像头。\n电子前沿基金会(Electronic Frontier Foundation)的专职律师赛拉·侯赛因(Saira Hussain)告诉BuzzFeed新闻，监控技术的普及可能意味着示威者在示威活动结束后很久就面临被捕的风险。\n侯赛因说：“重要的是要知道有哪些类型的风险，知道风险可能不仅在当下，而且还会在以后，因为所有这些巨大的监控技术。”", "note_en": "State Patrol officers block a road in Minneapolis on the fourth day of protests, May 29.\n  The Minneapolis Police Department has a wide breadth of surveillance technologies that could be used to monitor and target protesters — including controversial facial recognition software Clearview AI, license plate readers, body cameras, and video analysis tools. The department and law enforcement agencies in neighboring cities have a history of surveilling residents with tech that can speed up the process of identifying and possibly arresting people.\n After investigations were opened this month into the deaths of  an unarmed black man in Minneapolis and an  unarmed black woman in Louisville, Kentucky following police action, protests have broken out across the United States — including in  Minneapolis, Denver, Columbus, and New York — expressing grief and outrage and demanding an end to police brutality.\n Minneapolis has been the center of these protests following  the May 25 death of 46-year-old George Floyd, who died after a white police officer detained him and placed him in a knee chokehold. The moments before Floyd&#39;s death, which were captured on camera, showed him struggling to breathe, repeatedly telling police, “I can’t breathe” and “they’re going to kill me.”\n As protesters take to the streets, they&#39;ll be watched by law enforcement agencies that have trialed or are currently deploying a variety of surveillance tools. The Minneapolis Police Department has used an array of technologies in the past —including Clearview AI,  which has scraped billions of photos from social media to power its facial recognition tool. Nearby police departments, as well as the Hennepin County Sheriff&#39;s Office and the Minnesota Fusion Center — which maintain jurisdictions that overlay Minneapolis — have also used Clearview.\n “At a high level, these surveillance technologies should not be used on protesters,” Neema Singh Guliani, a senior legislative counsel for the ACLU, told BuzzFeed News. “The idea that you have groups of people that are raising legitimate concerns and now that could be subject to face recognition or surveillance, simply because they choose to protest, amplifies the overall concerns with law enforcement having this technology to begin with.”\n According to documents reviewed by BuzzFeed News, more than 10 users with the Minneapolis Police Department had run more than 160 searches as of February. The Hennepin County Sheriff’s Office, which oversees the county that includes Minneapolis, had also conducted nearly 400 searches among 10 accounts. And the Minnesota Fusion Center — a specialized section of the Minnesota Bureau of Criminal Apprehension (BCA) that shares crime intelligence — had run almost 40 searches as of February.\n &#34;We have in the past used Clearview AI to help identify unidentified victims in images that are part of human trafficking cases,&#34; a spokesperson for the Minnesota Fusion Center told BuzzFeed News. The Minneapolis Police Department and the Hennepin County Sheriff’s Office did not respond to requests for comment.\n The neighboring St. Paul Police Department had conducted nearly 40 searches with Clearview&#39;s facial recognition tool as of February. And the police department of Prior Lake, Minnesota, a suburb about 20 miles southwest of Minneapolis, racked up more than 1,100 searches between July 2019 and February 2020 with three Clearview accounts.\n The Prior Lake Police Department did not respond to requests for comment. A spokesperson for the St. Paul Police Department denied that it had used Clearview after they checked with several units, despite the data seen by BuzzFeed News. In the past,  multiple  police departments initially denied using Clearview before walking back their statements following full reviews or audits of their officers.\n The Minneapolis Police Department has not been forthcoming about its use of facial recognition. In July, a spokesperson for the department told  the Minneapolis Star Tribune that the organization had no plans to deploy the technology, but at least one user associated with the organization created an account with Clearview AI that month, according to data seen by BuzzFeed News.\n Records obtained by  local journalist Tony Webster showed that the Hennepin County Sheriff’s Office has deployed facial recognition since 2013. In July, the  Star Tribune reported the office ran a suspect’s photo taken from Instagram through a facial recognition tool to reveal a possible match. It’s unclear if this facial recognition tool was offered by Clearview — which has taken images from Facebook, Instagram, and Twitter to train its software — or another company.\n The Minneapolis PD also uses a wide range of other surveillance tools. In a 2019  white paper, the department said it used automatic license plate readers, or devices that capture images of license plates, allowing police to potentially track the movement of a person throughout a city or region. In 2009, the city paid Tennessee-based  traffic camera company PIPS Technology more than $50,000 for both fixed and mobile license plate readers.\n Additionally, according to new receipts obtained by BuzzFeed News via public record request, the neighboring Prior Lake Police Department has  paid thousands of dollars for Thomson Reuters CLEAR — a law enforcement data aggregation tool that has also been used by  Immigration and Customs Enforcement — from October 2016 through at least September 2019.  CLEAR combines data from cellphones, license plate readers, and real-time arrest records. In aggregate, this data makes it faster and easier for police track and arrest suspects.\n The Minneapolis Police Department also uses Securonet, a surveillance tool that lets police upload cellphone footage, integrate it with CCTV footage, and visualize it on a map. The police department  started using Securonet in 2017, ahead of the city&#39;s hosting of the  2018 Super Bowl. The department signed  another contract with Securonet in 2019.\n This year, Minneapolis started using BriefCam, a  high-definition surveillance camera system used throughout the city’s rail, bus, and metro system. The city&#39;s police department said in the  white paper that it doesn’t currently combine surveillance cameras with real-time or automated facial recognition but noted that “it is conceivable that this could change in the near future.”\n Rich Neumeister, a Minneapolis resident,  submitted written testimony to the city subcommittee on data practice on Jan. 30 urging the city to enact restrictions on the use of facial recognition. At the time of writing, no restrictions existed.\n “There needs to be guardrails, standards, and curtailing policies so that the use and rules are not developed by law enforcement agencies in secret,” he said. “Our privacy and civil liberties can be diminished if this onerous and powerful technology is not kept in check.”\n    The Minneapolis Police Department also has a five-year contract with  police body camera Axon, which lasts through 2021. The agreement involves providing body cameras to all 888 sworn police officers in the city. The police department received a grant from  the Department of Homeland Security in 2018 to help pay for these cameras.\n Minneapolis also hosts an array of CCTV cameras, which the police can access. The Minneapolis Police Department said in a  surveillance white paper that it uses Milestone software from Arxys —  a video management tool that claims to offer &#34;video motion detection&#34; and &#34;video analytics&#34; — to analyze CCTV footage.\n The Minneapolis Police Department has paid  more than $2 million for ShotSpotter, an audio surveillance tool that listens for gunshots and visualizes possible shooting locations on a map. There’s  no evidence, as of right now, that ShotSpotter effectively reduces crime and makes cities “safer,”  which the company claims.\n As noted in a  surveillance white paper, law enforcement agencies operating in Minneapolis, like the state-run Minnesota BCA, have access to even more surveillance tools. For instance, the Minnesota BCA has the ability to deploy Stingrays, a tool that mimics cellphone towers in order to approximate the location of cellphone users. Stingrays  have allegedly been used to target  Black Lives Matter protesters.\n Minneapolis could also be subject to surveillance at the federal level as the protests unfold. Customs and Border Protection (CBP) flew a Predator drone  over the city on Friday, according to Jason Paladino, an investigative reporter at the Project on Government Oversight.\n In a statement given to congressional staffers on Friday that was obtained by BuzzFeed News, CBP officials said the agency&#39;s Air and Marine Operations was &#34;preparing to provide live video to aid in situational awareness at the request of our federal law enforcement partners in Minneapolis.&#34; The agency said drones are often deployed around the country to &#34;augment law enforcement and humanitarian relief efforts.&#34;\n &#34;After arriving into the Minneapolis airspace, the requesting agency determined that the aircraft was no longer needed for operational awareness and departed back to Grand Forks,&#34; the statement read.\n Additionally, several local police departments in the Minneapolis metropolitan area — including those in Spring Lake Park, Brooklyn Center, Plymouth, St. Louis Park, and Edina — have signed contracts with Ring,  Amazon’s home surveillance company, according to  the company’s map of active partnerships. Ring contracts give police access to the company’s law enforcement portal, which lets officers request camera footage from residents  without obtaining a warrant first. In exchange, Ring has given police  free cameras, and it  has offered police more free cameras if they convince enough people to download Neighbors, its neighborhood watch app.\n Saira Hussain, a staff attorney for the Electronic Frontier Foundation, told BuzzFeed News that the pervasiveness of surveillance technology could mean protesters face the risk of arrest long after demonstrations end.\n “It’s important to know what types of risks there are and knowing that the risks might not just be in the moment,” Hussain said, “but also thereafter, because of all this immense amount of surveillance technology.”", "posttime": "2020-05-30 07:10:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "tools,可能", "title": "以下是明尼阿波利斯警察局使用的监视工具", "title_en": "Here Are The Surveillance Tools Used by the Minneapolis Police Department", "transed": 1, "url": "https://www.buzzfeednews.com/article/carolinehaskins1/george-floyd-protests-surveillance-technology", "via": "", "real_tags": ["tools", "可能"]}, {"category": "", "categoryclass": "", "imagename": "46b80c7aae5e64514642ecb4862ac0e3.png", "infoid": 1004336, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当我在2016年创办“独立黑客”公司时，我选择了“独立”这个词，来代表我们独立于工作和朝九晚五的时间表、老板、有上限的薪资、固定地点的办公室，以及那些试图支配我们公司运营方式的投资者。\n但今天，我可能不得不把投资者从名单上划掉。在拥有投资者的同时，以某种方式保持独立，这正变得越来越普遍。\n对于第一次造访地球的外星人来说，任何创始人都不喜欢有投资者的概念，这似乎令人费解。双方不是都有互惠互利的关系吗？理想情况下，是的。但从历史上看，不一定是这样。\n几十年来，互联网公司的资金主要来自风险资本，风险资本家有一个非常特殊的模式：向初创企业投入大量资金，然后推动它们尽可能快地增长。不出所料，其结果是，少数初创公司大获成功，但大多数都付之东流。罗布·沃林(Rob Wling)在我们最近的谈话中说得很完美：\n比方说，你向一家公司投入1000万美元、2000万美元、3000万美元，然后你说，好吧，成为一家价值10亿美元的公司。立刻，你的风险就会冲破屋顶，你就会失败。因为你将雇佣50-100个人，那里会有更多的混乱，你的行动速度会更快，这只会让你更有可能通过…考试。这真的增加了你失败的可能性，或者成为一家独角兽，一家价值10亿美元的公司的可能性。他们希望它是二进制的。\n如果你对这种两极分化的结果感到满意，风险投资是适合你的。但对于大多数有抱负的创始人来说，筹集风险资金需要做一些不自然和不愉快的事情-把你的企业和你的生活方式扭曲成比实际需要的风险和压力大得多的东西。\n这也意味着首先要放弃你作为创始人所追求的独立性。风投们是守门人，他们可以告诉你不，就像老板拒绝你升职或加薪一样。而且，即使风投公司决定投资，他们通常也会投入足够的资金来要求获得董事会席位。无论哪种方式，你现在都有了一个老板。\n因此，这是拼图的第一块：风险投资=自由和独立的丧失。\n当然，那些不喜欢风投选择的创始人会转向其他形式的融资，但多年来，他们只找到了更多相同的融资方式。像Y Combinator这样的加速器将自己描述为风险投资的最早阶段。个人天使投资者往往遵循同样的策略。例如，在颇具影响力的风险黑客博客上，尼维给天使们的建议如下：\n只关注有100-1000倍回报潜力的公司。否则，就算了吧。如果没有这些大规模的退出，你的投资组合就不会获得风险回报。\n由于风险投资是镇上唯一的游戏，融资就成了风险资本的代名词。这是拼图的第二部分：所有资金=风险投资。\n总而言之，如果风险投资意味着放弃你的独立性，如果所有可用的融资形式真的只是变相的风险投资，那么由此得出的结论是，所有的筹资都需要放弃你的独立性。\n因此，自互联网热潮结束以来，自力更生的创始人一直团结在一起，以他们对资金的反对来定义自己，这也就不足为奇了。几十年来，本应帮助这些创始人实现目标的工具却将他们排除在外。\n在2010年，这些沮丧的鞋匠是我心目中的英雄。我尊敬像Basecamp的Jason Fry和Balsamiq的Peldi Guilizzoni这样的人，他们不知何故找到了一种在不筹集任何资金的情况下开发SaaS应用程序就能赚取数百万美元的方法。这在今天很难做到，但在当时就更难了。\n没有独立黑客，没有MicroConf，没有充满透明创始人故事的剧本。Stripe还没有上市，而且可能需要几个月的时间才能给信用卡充值。像AWS这样的开发人员工具和资源更稀有、更难使用、功能更弱、成本更高。而且互联网是一个较小的地方，愿意为软件付费的在线客户较少。\n甚至连文化本身都对你不利。这听起来很奇怪，但在2010年上一次经济衰退的尾声，赚钱被认为是…。笨死了。这个游戏的名字是筹集资金，免费赠送你的产品，实现超高速增长，然后再弄清楚你的商业模式。肖恩·帕克(Sean Parker)在“社交网络”(The Social Network)中饰演的角色用短短几句话完美地抓住了时代精神：\n巧合的是，我在电影上映的同一个月申请了Y Combinator。尽管我心目中的英雄都是盗鞋者，但他们的道路似乎更难追随。\n在其间的几年里，上述所有挑战都发生了逆转，使得它变得更便宜、更快、更容易开始。如果没有斯利普，有多少企业不会存在呢？如果不是因为AWS和它的竞争对手？如果不是那些多年来慷慨地分享他们的故事和战略的无数创始人呢？\n我们还看到，学会编程的人数呈爆炸式增长，而编程是开启互联网业务的良药--超过85%的独立黑客都是从软件工程师起步的。当你考虑到这样一种观点，即我们正处于代码作为看门人消失的过程中，潜在创始人的数量应该只会继续飙升。\n其结果是，我们现在生活在一个至少有数万名独立黑客建立有利可图的在线业务的世界。我敢打赌，他们中的绝大多数人碰巧认为100万美元是相当酷的。\n就像创始人一样，投资者寻找服务不足但增长迅速的利基市场，在那里他们可以通过避免竞争更容易获利。独立黑客已经证明，他们可以大量建立高利润率、高收入的业务。如果风险资本家不投资独立黑客，其他人会：\nClearbanc是由加拿大企业家米歇尔·罗曼诺(Michele Romanow)创立的。他们向电商和消费者SaaS公司提供10000至1000万美元的固定费用，从未来的收入中偿还。申请的最低要求是什么？一家公司，MRR为10K美元，至少6个月的持续收入历史。\nTinySeed是由MicroConf创始人兼独立黑客@robwling创建的，目标是找到一种模式，为创始人提供资本，而风投通常不会支持这种模式。他们为SaaS创始人提供为期一年的远程加速器，通常会根据创始团队的规模投资120-24万美元，以换取10-12%的股权。\nRevUp Capital由投资者梅丽莎·威瑟斯(Melissa Withers)创立。他们向B2B和B2C公司投资100至30万美元，这些公司有营收吸引力、稳健的增长率以及在他们所服务的市场上有经营空间。作为回报，他们要求从你的收入中提成，直到达到一定的上限。\nEnnest Capital是由独立黑客@tylertringas创建的。他们通过创新而简单的分享收益协议投资于自助商、独立黑客、制造商和真正的企业，根据该协议，创始人向他们返还的收入上限为收入的1%。\n独立风险投资是由@Bryce创办的，目的是资助和支持创始人走上盈利之路。他们是一家放弃了传统风险投资模式的风险投资公司，他们的目标是成为我们的创始人需要进行的最后一笔投资。\nLightter Capital是由BJ Lackland创建的，旨在向平均至少15K美元的MRR的科技公司提供基于债务的资本。\n寻求独立的创始人第一次有了符合他们目标的各种融资选择，而不是要求创始人符合风险投资模式。允许您远程参与的加速器。申请过程需要几个小时，而不是几个月。通过收入而不是股权返还的资金。没有获得董事会席位的投资者和获胜的投资者不会推动你进行闪电战或一轮又一轮地募集资金。\n最大的问题是：这会奏效吗？风险投资者以前从未采取过这种做法，这是有原因的。我问蒂尼·塞德的罗布这个问题，下面是他的回答：\n风投领域的普遍看法是，你在Airbnb和优步(Uber)上赚钱，而在其他大多数网站上亏损。但我们建模的方式似乎并不是这样的，…。能够取得7位数和8位数成功的公司比价值10亿美元的公司要多得多。\n从分析师的角度来看，我不会押注于一个由聪明人组成的生态系统，这些聪明人相互竞争，帮助其他聪明人赚钱。至少从长远来看不是这样。而我们正面临的大流行引发的经济衰退甚至可能是一种催化剂。初创公司的估值正在下降，这使得风险投资不再是一个有吸引力的选择。与此同时，许多传统的高增长初创公司已经将重点转移到简单地度过未来几年，因此表现得更像是独立黑客，他们把现金流放在增长之上。\n然而，从独立黑客的角度来看，这些新模式是否成功无关紧要。这无关紧要！无论哪种方式，最终都有资本可以帮助你在不牺牲理想的情况下实现你的目标，这是值得利用的。\n在文化层面上，自豪感一直是将我们作为一个社区联系在一起的东西。自举是独立的同义词，对于大多数独立黑客来说，独立才是重点。\n但是，在一定程度上，尽管筹集了资金，但仍有可能保持独立，计算方法就会改变，人们的态度也会相应地改变。情况可能是这样的，那些对资金没有任何先入为主偏见的新独立黑客将更好地利用生态系统的变化，因为更有经验的独立黑客需要更长的时间才能适应。\n从长远来看，自豪感最终将被独立自豪感所取代，这是许多创始人目标的更直接、更准确的体现。\n罗布·沃林(Rob Wling)和我在最近一集的独立黑客播客(Indie Hacker Podcast)上讨论了为引导程序提供资金的问题。给它一只手表或一只耳朵！", "note_en": "When I started Indie Hackers back in 2016, I chose the term &#34;indie&#34; to represent our independence from jobs and 9-to-5 schedules, from bosses, from capped salaries, from offices in fixed locations, and from investors who try to dictate how we run our companies.\n But today I might have to cross investors off that list. It&#39;s becoming increasingly common to have investors and yet, somehow, remain indie.\n  To an alien visiting Earth for the first time, it might seem puzzling that any founders would dislike the notion of having investors. Don&#39;t both parties have a mutually beneficial relationship? Ideally, yes. But historically, not necessarily.\n For decades now, funding for Internet companies has primarily come through venture capital, and venture capitalists have a very particular model: invest a ton of money into startups, then push them to grow as rapidly as possible. The result, predictably, is that a few startups win big, but most go down in flames.  Rob Walling put it perfectly in  our recent conversation:\n Let&#39;s say you put $10, $20, $30 million into a company, and you say alright, become a billion-dollar company. Instantly, your risk shoots through the roof that you&#39;re gonna fail. Because you&#39;re gonna hire 50-100 people, there&#39;s way more chaos, you&#39;re moving way faster, and it just makes it more likely that you&#39;re going to fail… It really increases your likelihood of either failing, or being a unicorn, a billion-dollar company. They want it to be binary.\n If you&#39;re okay with that kind of polarized outcome, VC is for you. But for the majority of aspiring founders, raising venture money requires doing the unnatural and unpleasant — contorting your business and your lifestyle into something far riskier and more stressful than it really needs to be.\n It also means giving up the very independence you sought as a founder in the first place. VCs are gatekeepers who can tell you &#34;no,&#34; like a boss denying you a promotion or a raise. And even if VCs decide to invest, they typically put in enough money to demand board seats. Either way, you now have a boss.\n So that&#39;s the first piece of the puzzle: venture capital = a loss of freedom and independence.\n Naturally, founders who didn&#39;t like the VC option turned to other forms of funding, but for years they only found more of the same. Accelerators like Y Combinator  describe themselves as &#34;the earliest stage of venture funding.&#34; And individual angel investors often follow the same playbook. For example, here&#39;s  Nivi&#39;s advice for angels on the influential Venture Hacks blog:\n Focus your attention only on companies with the potential for a 100-1000x return. Otherwise, pass. Without these large exits, your portfolio will not achieve a venture return.\n Since venture capital was the only game in town, funding became synonymous with venture capital. And that&#39;s the second piece of the puzzle: all funding = VC.\n Putting the pieces together, if VC means giving up your independence, and if all available forms of funding are really just venture capital in disguise, it follows that all fundraising requires giving up your independence.\n It&#39;s no surprise then that bootstrapped founders have been banding together since the end of the dot-com boom, literally defining themselves by their  opposition to funding. The very tool that should help these founders accomplish their goals has instead, for decades, excluded them.\n  In 2010, these frustrated bootstrappers were my heroes. I looked up to people like  Jason Fried of Basecamp and  Peldi Guilizzoni of Balsamiq, who&#39;d somehow found a way to make millions of dollars building SaaS apps without raising any funding. That&#39;s hard to do today, but it was even harder back then.\n There was no Indie Hackers, no MicroConf, no playbook full of transparent founder stories. Stripe wasn&#39;t available yet, and it could take months just to be able to charge credit cards. Developer tools and resources like AWS were rarer, harder to use, less powerful, and more expensive. And the Internet was a smaller place, with fewer customers online willing to pay for software.\n Even the culture itself was against you. It sounds bizarre, but at the tail-end of the last recession in 2010, making money was considered… stupid. The name of the game was to raise funding, give away your product for free, achieve hypergrowth, and figure out your business model later. Sean Parker&#39;s character in  The Social Network  captured the zeitgeist perfectly in just a few words:\n  Coincidentally, I applied to Y Combinator the same month that movie came out. Despite the fact that my heroes were bootstrappers, their path seemed so much harder to follow.\n  All of the aforementioned challenges reversed course in the intervening years, making it much cheaper, faster, and easier to get started. How many businesses wouldn&#39;t exist if not for Stripe? If not for AWS and its competitors? And if not for the countless founders who&#39;ve been generous enough to share their stories and strategies over the years?\n We&#39;ve also seen an explosion in the number of people who&#39;ve learned to code, which is the gateway drug to starting an Internet business — over 85% of indie hackers got their start as software engineers. When you factor in the argument that we&#39;re in the midst of  code disappearing as a gatekeeper, the number of potential founders should only continue to skyrocket.\n The result is that we now live in a world with  at least tens of thousands of  indie hackers building profitable online businesses. And I&#39;d wager the vast majority of them happen to think that a million dollars is pretty cool.\n   Just like founders, investors look for under-served but fast-growing niches where they can profit more easily by avoiding the competition. And indie hackers have proven that they can build high-margin, high-revenue businesses in vast quantities. If venture capitalists won&#39;t invest in indie hackers, others will:\n Clearbanc was founded by Canadian entrepreneur Michele Romanow. They provide between $10K and $10M to to e-commerce and consumer SaaS companies for a flat fee, repaid out of future revenues. The minimum requirements to apply? An incorporated business, $10K in MRR, and at least 6 months of consistent revenue history.\n TinySeed was created by MicroConf founder and indie hacker  @robwalling, with the goal of finding &#34;a model that provides capital to founders that VCs won’t typically back.&#34; They host a year-long, remote accelerator for SaaS founders, and typically invest $120-240K depending on the size of the founding team, in return for 10-12% equity.\n RevUp Capital was founded by investor  Melissa Withers. They invest $100-$300K in &#34;B2B and B2C companies that have revenue traction, a solid growth rate, and room to run in the markets they serve.&#34; In return, they ask for a cut of your revenue, up until a certain cap.\n Earnest Capital was created by indie hacker  @tylertringas. They invest in &#34;bootstrappers, indie hackers, makers and real businesses&#34; via their innovative yet simple  shared earnings agreement, in which founders repay them a % of earnings up to a cap.\n Indie VC was started by  @bryce to &#34;to fund and support founders on a path to profitability.&#34; They&#39;re a VC firm that&#39;s abandoned the traditional VC model, and who instead &#34;aim to be the last investment our founders need to take.&#34;\n Lighter Capital was created by  BJ Lackland to provide debt-based capital to tech companies averaging at least $15K MRR.\n For the first time, founders who are seeking independence have a variety of funding options that conform to  their goals, rather than requiring founders to conform to the venture model. Accelerators that allow you to participate remotely. Application processes that take hours, not months. Funding that&#39;s returned via revenue, not equity. Investors who don&#39;t take board seats and who won&#39;t push you to blitzscale or raise round after round.\n  The big question is: Will this work? There&#39;s a reason why venture investors never took this approach before.  I asked Rob of TinySeed this very question, and here&#39;s what he had to say:\n The common wisdom in the VC space is you make money on your Airbnbs and your Ubers, and you lose money on most of the other ones. But the way we&#39;ve modeled it out that doesn&#39;t appear to be the case… There are so many more companies that can be successful 7- and 8-figures than there are can be billion-dollar companies.\n From an analyst&#39;s perspective, I wouldn&#39;t bet against an ecosystem of smart people who are competing to help other smart people make money. At least not in the long run. And the pandemic-induced recession we&#39;re facing may even be a catalyst. Startup valuations are falling, which makes VC a less attractive option. Meanwhile, many traditional high-growth startups have shifted their focus to simply surviving the next few years, and thus behaving more like indie hackers who prioritize cash flow over growth.\n From an indie hacker&#39;s perspective, however, whether or not these new models succeed is irrelevant. It doesn&#39;t matter! Either way, there&#39;s finally capital available that can help you accomplish your goals without sacrificing your ideals, and that&#39;s something worth taking advantage of.\n  At a cultural level, &#34;bootstrapper pride&#34; has always been something that binds us together as a community. Bootstrapping is synonymous with independence, and for most indie hackers, independence is the entire point.\n But to the extent that it&#39;s possible to remain indie despite raising funds, the calculus changes, and attitudes will shift accordingly. It may be the case that new indie hackers who don&#39;t hold any preconceived biases against funding will do a better job taking advantage of the changes in the ecosystem, as more experienced indie hackers take longer to adapt.\n In the long run, &#34;bootstrapper pride&#34; will eventually be replaced by &#34;indie pride,&#34; which is a more direct and accurate manifestation of many founders&#39; goals, anyway.\n  Rob Walling and I discussed funding for bootstrappers on a  recent episode of The Indie Hackers Podcast. Give it a  watch or a  listen!", "posttime": "2020-05-30 07:09:35", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "app,自给自足,doesn,创始人", "title": "“独立”不再是“自给自足”的意思", "title_en": "“Indie” doesn't mean “bootstrapped” anymore", "transed": 1, "url": "https://www.indiehackers.com/post/indie-doesn-t-mean-bootstrapped-anymore-a88300c012", "via": "", "real_tags": ["app", "自给自足", "doesn", "创始人"]}, {"category": "", "categoryclass": "", "imagename": "ea0cc0f160e527f1490006786ac99b07.jpg", "infoid": 1004335, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "密歇根州立大学收到向勒索软件攻击者支付赎金的最后期限，威胁称从该机构网络窃取的文件将泄露给公众。\n这一需求来自Netwalker勒索软件即服务(RAAS)运营商，该组织最近开始为其附属计划招募熟练的网络入侵者。\n攻击者网站上的倒计时计时器显示，该大学有大约6天的时间遵守规定，否则“秘密数据”将会公之于众。\nNetwalker勒索软件团伙建立的网站没有给出攻击的细节，但他们发布了带有目录、护照扫描和据称是从大学网络窃取的两份财务文件的图片。\nBleepingcomputer联系了密歇根州立大学(MSU)，了解有关这次攻击的更多细节，但在发布时没有收到任何回复。\n关于袭击发生的方式和时间，对密歇根州州立大学的影响，以及赎金要求的信息目前仍不清楚。\nNetwalker勒索软件依赖于多个程序进行远程访问(Team Viewer、AnyDesk)、公共代码存储库中的文件和自定义PowerShell脚本。\n但是，他们还使用至少三种合法工具来卸载受损系统上的安全软件。\nSophos安全软件和硬件公司的研究人员昨天在一份报告中分享说，这名威胁行为人还使用了ESET AntiVirus、趋势科技的安全代理和微软安全客户端(Microsoft Security Essentials)的合法删除工具。\n除了能够在受害者网络上进行入侵和横向移动的工具外，他们还发现了Zeppelin Windows勒索软件和Smaug Linux勒索软件的单独样本。\n在调查Netwalker的恶意软件活动时发现的大量恶意文件中，研究人员还发现，攻击者还利用了几个漏洞来提升权限。\n其中之一是CVE-2020-0796，为其发布了用于本地权限提升的概念验证利用代码。还可以利用该漏洞进行远程代码执行，但用于此目的的代码目前不向公众开放。\nNetwalker勒索软件集团最近发布广告称，他们正在寻找能够访问大型企业网络的新合作者。此举是为了与通过垃圾邮件传播恶意软件保持距离，垃圾邮件是一种常见的方法。\n作为激励，该集团向附属公司承诺巨额奖励，从支付的赎金中削减80%至84%。其他勒索软件运营商通常会从赎金中拿出高达70%的费用。", "note_en": "Michigan State University received a deadline to pay ransomware attackers under the threat that files stolen from the institution’s network will be leaked to the public.\n The demand is from Netwalker ransomware-as-a-service (RaaS) operators, a group that recently started to recruit skilled network intruders for their affiliate program.\n  A countdown timer on the attacker’s website shows that the university has about six days to comply or “secret data” will become public.\n The site set up by the Netwalker ransomware gang gives no details about the attack but they posted images with directories, a passport scan, and two financial documents allegedly stolen from the university’s network.\n  BleepingComputer reached out to Michigan State University (MSU) for more details about the attack but received no reply at publishing time.\n Information about how and when the attack happened, its impact on MSU, and the ransom demand remain unknown at this time.\n  Netwalker ransomware relies on multiple programs for remote access (Team Viewer, AnyDesk), files from public code repositories, and custom PowerShell scripts.\n However, they also use at least three legitimate tools to uninstall security software on a compromised system.\n Researchers at Sophos security software and hardware company shared in a  report yesterday that the threat actor also used legitimate removal tools for ESET antivirus, Trend Micro’s Security Agent, and Microsoft Security Client that is part of Microsoft Security Essentials.\n Apart from tools that enabled intrusion and lateral movement on the victim network, they discovered &#34;individual samples of the Zeppelin Windows ransomware and the Smaug Linux ransomware as well.&#34;\n In a trove of malicious files discovered while investigating a malware campaign from Netwalker, the researchers also found that the attacker also leveraged several vulnerabilities for privilege escalation.\n One of them is  CVE-2020-0796, for which there is proof-of-concept exploit code released for local privilege escalation. It can also be exploited for remote code execution, but the code for this is not currently available to the public.\n  Netwalker ransomware group advertised recently that they were looking for new collaborators with access to large enterprise networks. The move is meant to distance themselves from malware distribution through spam, which is a common method.\n As an incentive, the group promised affiliates huge rewards, a cut between 80% and 84% from paid ransoms. Other ransomware operators typically offer up to 70% from the ransom money.", "posttime": "2020-05-30 06:54:53", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "大学,软件,州立大学,state,网络", "title": "密歇根州立大学网络在勒索软件攻击中被攻破", "title_en": "Michigan State University Network Breached In Ransomware Attack", "transed": 1, "url": "https://www.bleepingcomputer.com/news/security/michigan-state-university-network-breached-in-ransomware-attack/", "via": "", "real_tags": ["大学", "软件", "州立大学", "state", "网络"]}, {"category": "", "categoryclass": "", "imagename": "596515d12720c55979325645f16ee26e.jpeg", "infoid": 1004333, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Facebook告诉我的追随者，我在散布关于政府监控的错误信息。我没有。\n呼吁更多的审查-或者让大型科技公司成为真相的仲裁者-最终会适得其反。我们需要从根本上解决病毒造假的问题。\n好吧我承认。我现在还在用脸书。当我昨晚登录时，我看到了一些我以前从未见过的东西：一条通知，上面写着“独立事实核查人员在你的帖子中发现了部分错误的信息。”我很惊讶，但我想这可能是一个小故障，或者与我发布的某个笑话表情包或类似的东西有关。我点击它了解更多信息。\n事实证明，“今日美国”的“独立事实核查人员”标出了一篇下流文章，我分享了这篇文章，并被引用了这篇文章，内容是关于“爱国者法案”的重新授权，以及围绕限制大规模政府监控的修正案正在进行的斗争。这是我的组织“为未来而战”(Fight For The Future)在过去十年的大部分时间里一直致力于解决的问题。这篇帖子现在包含了一面醒目的旗帜，向所有看到它的人展示，有效地审查了原始文章，并用一个指向今日美国“事实核查”文章的大链接取代了它。\n我点击了一下，阅读了他们为什么认定这篇文章“部分虚假”的确切原因。说到这一点，“今日美国”的“独立事实审查员”在语义学上吹毛求疵。副标题写道，“参议院投票允许联邦调查局在没有授权的情况下查看你的网络浏览历史。”这篇文章指的是参议院通过了美国自由重新授权法案，该法案重新授权了几个爱国者法案和外国情报监视法案(FISA)的监视机构-同时未能通过参议员怀登(D-OR)和戴恩斯(R-MT)提出的修正案。修正案将要求联邦调查局在窥探网络浏览和搜索历史等互联网活动之前获得搜查令。这个标题很有挑衅性，但它是百分之百真实的。而这篇文章本身也详细阐述并解释了其中的细微差别。事实核查人员实质上是在声称这篇帖子是错误的信息，因为参议院并没有“投票允许”-他们只是“没有投票支持不允许”。\n即使这是真的，在一个有数十亿人使用的平台上有效审查信息的理由也相当站不住脚。但这不是真的-修正案是附加在基本法案上的，该法案重新授权即将到期的FISA监控权。因此，投票支持重新授权第215条，并投票反对修正案的参议员们，绝对是“投票允许”未经授权的政府监视互联网活动。“今日美国”的文章明显比“今日美国”的文章更“假”。\n看来“今日美国”的事实核查人员首先通过Facebook页面“成为自由主义者”的病毒式帖子发现了这篇色情文章。事实核查人员对该页面在共享文章时使用的一些特定语言提出了异议。但看起来Facebook不仅在该页面的帖子上贴上了“部分错误”的旗帜，而且对任何发布同一篇文章的人都贴上了“部分虚假”的旗帜。\n“今日美国”的这篇文章在很大程度上依赖于与斯图尔特·贝克(Stewart Baker)的“电子邮件交流”，贝克曾是美国国家安全局(National Security Agency)的首席律师，也是政府大规模监控项目的坚定捍卫者。他们没有试图联系我的组织争取未来，也没有联系美国公民自由联盟(ACLU)、自由新闻、要求进步(Demand Progress)的专家，也没有试图联系其他几十个声誉卓著的公民社会组织中的任何一个，这些组织发表了与这篇文章的框架非常相似的公开声明。他们似乎也没有试图联系参议员怀登或戴恩斯，副总统，或撰写这篇文章的记者。最后，他们声称这篇文章“部分是错误的”，这是基于对FISA法庭如何运作的相当广泛的阅读，以及他们对读者可能如何解读标题和文章的最佳猜测。在没有正当程序或有意义的方式对裁决提出上诉的情况下，这位“事实审查员”变成了法官、陪审团和刽子手，扼杀了一篇关于政府监控的有机病毒帖子的传播，而此时活动人士正夜以继日地向公众通报即将到来的影响他们最基本权利的投票。\n对参议院投票的强烈抗议产生了影响，众议院现在预计将在几天内就类似的修正案进行投票。Facebook和他们的事实核查伙伴将这篇色情文章标记为“错误信息”的武断决定可能会对投票产生重大影响。\n这不是什么史诗般的阴谋。我相信《今日美国》的事实核查人员已经尽了最大努力研究这个复杂的话题，并得出了他们认为是公平的结论。我怀疑他们是在秘密为监控州工作。记者总是会把他们的含蓄偏见带到他们框架故事的方式上，他们包括哪些细节，他们忽略了哪些细节。在这种情况下，显然色情故事更同情致力于限制政府监控的公民自由倡导者。《今日美国》的这篇文章对政府和情报机构更有同情心。它们都不是“虚假的”，它们都不应该被Facebook有效地审查，也不应该被其不透明的算法以阻止虚假信息的名义掩盖。Facebook不应该把拇指放在天平上，说一篇文章比另一篇文章“更真实”，因为这样的决定可能是令人难以置信的主观判断，并对民主进程具有深远的影响。\n在Facebook这样的平台上传播网络仇恨和彻头彻尾的谎言是一个真正的问题。社交媒体放大了白人民族主义和跨性恐惧症等腐蚀性和暴力的意识形态，现在正在造成现实世界的伤害，对黑人和棕色人以及有色人种的跨性女性造成了不成比例的影响。我们不能轻视或忽视以言论自由的名义不分青红皂白地为这些意识形态提供平台的方式，这可能会导致边缘化的人不安全地自由表达自己。\n没有简单的答案。但我认为，这些都是深层次的社会问题，只能通过组织和社区建设来解决，不能通过更多的审查或要求大型科技公司成为真假的仲裁者来解决。在世界各地，我们看到各国政府争先恐后地阻止“错误信息”的流动，往往是通过制定弊大于利的政策。埃塞俄比亚的“仇恨言论和虚假信息防止和镇压公告”被那里的积极分子谴责为被滥用来扼杀言论自由和新闻自由。埃及类似的立法已经为人权组织敲响了警钟。YouTube试图从其平台上删除白人民族主义视频，导致对南方贫困法律中心等组织的反种族主义视频进行自动审查。\n在美国，进步团体和立法者理所当然地担心极右翼网络活动的兴起，以及国家行为者操纵选举的企图，越来越多地转向呼吁互联网审查、去平台，以及Twitter、YouTube和Facebook等公司更积极的温和。这些呼吁的用意是好的，但最终被误导了。授权营利性公司成为言论的裁判者，并决定我们可以和不允许进行辩论的内容巩固了现状，在很大程度上有利于强者，同时压制了受压迫者。而在新冠肺炎危机当中，这种情况很容易很快恶化。Facebook已经承认，它更多地依赖于人工智能的使用，并将“删除有害内容”放在首位。隐含的意思是，他们把删除“有害”内容放在优先位置，而不是确保他们的审核系统不会在这个过程中也删除合法内容。例如，一个软件“漏洞”导致脸书从实际的医疗专业人员中删除了关于新冠肺炎的事实帖子。\n没有灵丹妙药可以阻止网上错误信息的传播，而不会导致对合法内容和边缘化声音的附带损害和审查。我们应该从根本上解决问题，而不是呼吁采取更激进的缓和措施：大型科技公司的基本商业模式，即数据收集、微目标定位和人工算法放大，最大限度地提高了参与度。这些固有缺陷已经成为社会危机，因为极少数公司已经变得如此之大，以至于它们的政策成为整个互联网事实上的法律，这只能通过拆分它们或建立分散的替代方案来解决。\nFacebook的问题并不在于人们可以在这里畅所欲言，或者分享可能是真的也可能是假的文章。这是因为，Facebook不是一个城市广场-它是一台机器，旨在通过将内容推入Facebook认为会与其打交道的人的喉咙中来赚钱，从而不惜一切代价创造广告收入。政客、权威人士、种族主义者和诈骗艺术家总是在公共场合撒谎。Facebook允许他们直接\nFacebook的监控资本主义商业模式在关键投票前无意中帮助支撑了美国政府的监控状态。很难想象有更好的例子来说明，我们让大型科技公司承担责任，为限制它们操纵和控制公共辩论能力的政策而战，而不是以真相的名义赋予它们更多的权力，这是多么紧迫。", "note_en": "Facebook told my followers I was spreading misinformation about government surveillance. I wasn’t.\n Calling for more censorship — or for Big Tech companies to become the arbiters of truth — will ultimately backfire. We need to address the problem of viral disinformation at its root.\n   Okay I’ll admit it. I still use Facebook. When I logged on last night I saw something I had never seen before: a notification that read “Partly false information found in your post by independent fact checkers.” I was surprised, but figured maybe it was a glitch or related to some joke meme I had posted or something like that. I clicked it to learn more.\n  It turned out that “Independent fact-checkers” at USA TODAY had flagged  a VICE article that I shared, and am quoted in, about the reauthorization of the Patriot Act and the ongoing fight around amendments to rein in mass government surveillance. This is an issue that my organization,  Fight for the Future, has been working on for the better part of a decade. The post now contains a prominent flag shown to everyone who sees it, effectively censoring the original article and replacing it with a large link to the USA TODAY “fact checking”  piece instead.\n  I clicked through to read why exactly they had decided the article was “partly false.” When it comes down to it, the “independent fact checker” at USA TODAY was quibbling about semantics. The VICE headline read, “Senate Votes to Allow FBI to Look At Your Web Browsing History Without A Warrant.” The article is referring to the Senate passing the USA Freedom Reauthorization Act, which reauthorizes several Patriot Act and Foreign Intelligence Surveillance Act (FISA) surveillance authorities — while failing to pass an amendment offered by Senators Wyden (D-OR) and Daines (R-MT). The amendment would have required the FBI to get a warrant before snooping on Internet activity like web browsing and search history. The headline is provocative, but it is 100% true. And the article itself elaborates and explains the nuance. The fact checker is essentially claiming that the post is misinformation because the Senate didn’t “vote to allow” — they just “didn’t vote to not allow.”\n Even if that were true, it would be a pretty tenuous justification for effectively censoring information on a platform used by billions of people. But it’s not true — the amendment was tacked on to the underlying bill, which reauthorizes FISA surveillance powers that are set to expire. So the Senators who voted to reauthorize Section 215, and voted against the amendment, absolutely did “vote to allow” warrantless government surveillance of Internet activity. The USA TODAY piece is significantly more “false” than the VICE piece.\n  It appears that the USA TODAY fact checker first discovered the VICE article via a viral post from the Facebook page “Being Libertarian.” The fact checker took issue with some of the specific language that that page used when sharing the article. But it appears that Facebook has applied the “partly false” flag not just to that page’s post, but to anyone who posts the same article.\n The USA TODAY piece relies heavily on “an email exchange” with Stewart Baker, the former top lawyer for the National Security Agency and a  staunch defender of mass government surveillance programs. They did not attempt to contact my organization Fight for the Future, or experts from the ACLU, Free Press, Demand Progress, or any of the  dozens of other reputable civil society organizations who have issued public statements that closely mirror the article’s framing. It also does not appear that they attempted to contact Senators Wyden or Daines, VICE, or the journalist who wrote the piece. In the end, they claim that the article is “partly false” based on a fairly generous read of how the FISA court works and their best guess at how a reader  might interpret the headline and article. Without due process or a meaningful way to appeal the decision,  this “fact checker” became judge, jury, and executioner, killing the spread of an organically viral post about government surveillance at a time when activists are working around the clock to inform the public about an upcoming vote that impacts their most basic rights.\n The outcry over the Senate vote  had an impact, and the House is now expected to vote on a similar amendment in a matter of days. Facebook and their fact checking partner’s arbitrary decision to flag the VICE article as “misinformation” could have a significant impact on that vote.\n  This is not some epic conspiracy. I’m sure the fact checker at USA TODAY did their best to research this complex topic and come to a determination they felt was fair. I doubt they’re secretly working for the surveillance state. Reporters will always bring their implicit biases to the ways they frame stories, which details they include and which ones they omit. In this case, clearly the VICE story was more sympathetic to civil liberties advocates working to limit government surveillance. The USA TODAY piece is more sympathetic to the government and intelligence agencies. Neither of them are “false,” and neither of them should be effectively censored by Facebook or buried by its non-transparent algorithm in the name of stopping disinformation. Facebook should not be putting its thumb on the scale, to say that one article is “more true” than the other, when such determinations can be incredibly subjective and have profound implications for the democratic process.\n The spread of online hate and outright lies on platforms like Facebook is a real problem. And social media amplification of corrosive and violent ideologies like white nationalism and transphobia are causing real world harm right now, disproportionately affecting Black and brown people and trans women of color. We must not downplay or ignore the ways that indiscriminately giving platform to these ideologies in the name of free speech can result in making it unsafe for marginalized people to freely express themselves.\n There are no easy answers. But I would argue that these are deep societal problems that can only be addressed through organizing and community building, and that they can’t be fixed with more censorship or by demanding that Big Tech companies become the arbiters of what is and isn’t true. Around the world, we’ve seen governments scrambling to stem the flow of “misinformation,” often by enacting policies that do more harm than good. Ethiopia’s “Hate Speech and Disinformation Prevention and Suppression Proclamation” has been  decried by activists there as being abused to stifle free expression and freedom of the press.  Similar legislation in Egypt has raised alarm bells for human rights groups. YouTube’s attempt to remove white nationalist videos from its platform  resulted in automated censorship of anti-racist videos from groups like the Southern Poverty Law Center.\n In the United States, progressive groups  and lawmakers rightly concerned about the rise of far right online activity, and attempts by state actors to manipulate elections, have increasingly turned to calls for Internet censorship, deplatforming, and more aggressive moderation by companies like Twitter, YouTube, and Facebook. These calls are well intentioned but  ultimately misguided. Empowering for-profit companies to become the referees of speech and determine what we are and are not allowed to debate solidifies the status quo, and largely benefits the powerful while silencing the oppressed. And in the midst of the COVID-19 crisis, this situation could easily get worse very quickly. Facebook has already  admitted that it’s relying more on the use of artificial intelligence, and prioritizing the “removal of harmful content” over all else. Implied is that they are prioritizing removing “harmful” content over ensuring that their moderation systems don’t also remove legitimate content in the process. A software “bug” led Facebook  to remove factual posts about COVID-19 from actual healthcare professionals, for example.\n There is no silver bullet solution that will stop the spread of online misinformation without resulting in collateral damage and censorship of legitimate content and marginalized voices. Instead of calling for more aggressive moderation, we should address the problem at its root: Big Tech companies’ underlying business model of  data harvesting,  micro-targeting, and artificial  algorithmic amplification maximized for engagement above all else. These inherent flaws have become societal crises as a tiny handful of companies have become so large that their policies become de facto law for the entire Internet, something that can only be addressed by either breaking them up or building decentralized alternatives.\n The problem with Facebook is not that it’s a place where people can say what they want or share articles that may or may not be true. It’s that Facebook is not a town square —  it’s a machine designed to make money by shoving content down the throats of people that Facebook thinks will engage with it, and thus generate advertising revenue, no matter what the cost. Politicians, pundits, racists, and scam artists have always lied in public. Facebook allows them to directly target those lies to the people most likely to believe them.\n Facebook isn’t broken. It’s working exactly as intended. The product that Facebook has built is fundamentally incompatible with basic human rights and democracy -– and begging Mark Zuckerberg to take down things we don’t like won’t change that. Worse, if we fail to address the underlying problems and get caught in an endless game of partisan whack-a-mole or working the refs, we will continue to see more and more collateral damage, like with my post about the Patriot Act.\n Facebook’s surveillance capitalist business model inadvertently helped prop up the US government’s surveillance state ahead of a crucial vote. It’s hard to imagine a better example of how urgent it is that we hold Big Tech companies accountable and fight for policies that limit their ability to manipulate and control public debate, rather than giving them more power in name of truth.", "posttime": "2020-05-30 06:53:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "facebook,app,事实,act,监控", "title": "Facebook对爱国者法案视频贴上可疑的“虚假信息”事实核查标签", "title_en": "Facebook applies dubious “false info” fact-check label to Patriot Act video", "transed": 1, "url": "https://medium.com/@fightfortheftr/facebook-told-my-followers-i-was-spreading-misinformation-about-government-surveillance-i-wasnt-63622dd7ae56", "via": "", "real_tags": ["facebook", "app", "事实", "act", "监控"]}, {"category": "", "categoryclass": "", "imagename": "bb77e422746bb33b5e7844188e549d3e.jpg", "infoid": 1004332, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我们会在2020年前解决所有从星门理论考试到2020年的试题。这个清单上有247个问题，我们解决了(大部分)，并尝试了…", "note_en": "In which we solve EVERY exam problem offered from GATE theory exams until 2020. There are 247 questions in this list, and we tackle (most of) them, and try n...", "posttime": "2020-05-30 06:37:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "cs,solves,解决", "title": "教授在连续4小时内解决了20多年的CS问题", "title_en": "Professor solves over two decades of CS problems in 4 hours straight", "transed": 1, "url": "https://www.youtube.com/watch?v=g_ZdcHSFGv0", "via": "", "real_tags": ["cs", "solves", "解决"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1004331, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "创建帐户", "note_en": "Create\r\t\t\t\t\t\t\t\t\t\t\tAccount", "posttime": "2020-05-30 06:37:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "冠状病毒,coronavirus,ios,病毒,传感器", "title": "生物传感器可能是大规模冠状病毒检测的关键", "title_en": "Biosensors May Hold the Key to Mass Coronavirus Testing", "transed": 1, "url": "https://spectrum.ieee.org/view-from-the-valley/biomedical/diagnostics/biosensors-key-mass-coronavirus-testing", "via": "", "real_tags": ["冠状病毒", "ios", "病毒", "传感器"]}, {"category": "", "categoryclass": "", "imagename": "5e460bf80029d70dc3ae151e217b6f00.png", "infoid": 1004330, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "谷歌今天宣布，计划在2020年7月12日发布Chrome84，在今年夏天在Chrome中启用其新的反垃圾通知系统。\n这个Chrome组件在内部被称为更安静的通知权限UI，它的工作原理是阻止网站显示通知请求，通知请求隐藏在Chrome地址栏的图标下(在桌面上)或工具栏下(在移动设备上)。\n谷歌在1月份首次发布了更安静的通知权限UI，并在2月份以有限的用户选择加入的方式推出了Chrome80。\n但在今天的一篇博客文章中，谷歌表示，随着Chrome84的发布，新的UI及其检测垃圾通知弹出窗口的能力已经得到了改进，并将在7月份为所有用户默认启用。\n据谷歌称，Chrome将开始屏蔽和隐藏所有旨在误导、欺骗或强迫用户允许通知的通知弹出窗口。\n强制用户允许通知以访问网站内容的通知请求。\n一旦获得显示浏览器通知的批准，它们就会利用这些通知窃取个人信息或诱骗用户共享个人信息。\n一旦获得显示浏览器通知的批准，就会使用这些通知来推广、托管或链接到恶意软件或不需要的软件的站点。\n谷歌表示，所有使用这些技术之一或其他技术被抓获的网站，都将有能力提示在Chrome中被屏蔽的用户，继续前进。\n正确使用通知API的网站将被允许显示通知，只要它们不骚扰用户或从事任何不正当行为。\n已经在谷歌搜索控制台注册了域名的网站所有者可以通过搜索控制台仪表板，在新的滥用通知报告部分检查他们的网站是否会从7月份开始被屏蔽。\n那些有能力在Chrome中显示通知的网站也可以使用这个仪表盘来查看他们做错了什么，一旦纠正了这个问题，就可以提出上诉。", "note_en": "Google announced today plans to enable its new anti-notification spam system in Chrome over the summer, with the release of Chrome 84, on July 12, 2020.\n Known internally as the &#34;quieter notification permission UI,&#34; this Chrome component works by blocking sites from showing notification requests, which are hidden under an icon in the Chrome URL bar (on desktop) or under a toolbar (on mobile).\n  Google first announced the &#34;quieter notification permission UI&#34; in January, and  shipped it in February, in Chrome 80, in a limited, user opt-in fashion.\n But in a blog post today, Google said the new UI and its ability to detect spammy notification popups has been improved and will roll out enabled by default for all users in July, with the release of Chrome 84.\n According to Google, Chrome will start blocking and hiding all notifications popups that are &#34;designed to mislead, trick, or force users into allowing notifications.&#34;\n    Notification requests that force users to allow notifications in order to gain access to the site&#39;s content\n   Sites that once they received approval to show browser notifications, they use the notifications to steal personal information or trick users into sharing personal information\n Sites that once they received approval to show browser notifications, they use the notifications to promote, host, or link to malware or unwanted software.\n  Google says that all sites that are caught using one of these techniques, or others, will have their ability to prompt users blocked in Chrome, going forward.\n   Sites that use the Notifications API the right way will be allowed to show notifications, as long as they don&#39;t pester users or engage in any shady practices.\n Site owners that have registered their domain with Google&#39;s Search Console can check if their site will be blocked starting July via the Search Console dashboard, in the new  Abusive Notifications Report section.\n Sites that have had their ability to show notifications in Chrome can also use this dashboard to see what they did wrong and file an appeal once they corrected the issue.", "posttime": "2020-05-30 06:07:32", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "chrome,google,2020,谷歌,enable", "title": "谷歌将于2020年7月启用Chrome反垃圾通知系统", "title_en": "Google To Enable the Chrome Anti-Notification Spam System in July 2020", "transed": 1, "url": "https://www.zdnet.com/article/google-to-enable-the-chrome-anti-notification-spam-system-in-july-2020/", "via": "", "real_tags": ["chrome", "google", "2020", "谷歌", "enable"]}, {"category": "", "categoryclass": "", "imagename": "4505a46931fd84c2fa1b351599cd89a7.png", "infoid": 1004329, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "木炉可以为家庭提供做饭、空间和热水的热能。配备热电发电机的木炉也能发电，这比太阳能电池板发电更可持续、更可靠、成本更低。插图：迭戈·马莫莱霍(Diego Marmolejo)。如果说有2000年历史的风车是今天风力涡轮机的前身，那么壁炉和木炉就是今天太阳能电池板更古老的前身。就像太阳能电池板一样，树木和其他植物将阳光转化为对人类有用的能源。纵观历史，燃烧木材和其他生物质为家庭提供热能，用于做饭、取暖、洗涤和照明。光合作用也支撑了历史上所有机械的来源。", "note_en": "Wood stoves can provide a household with thermal energy for cooking and for space and water heating. Wood stoves equipped with thermoelectric generators also produce electricity, which can be more sustainable, more reliable and less costly than power from solar panels. Illustration: Diego Marmolejo. If the 2,000 year old windmill is the predecessor of today’s wind turbines, the fireplace and the wood stove are the even older predecessors of today’s solar panels. Like solar panels, trees and other plants convert sunlight into a useful source of energy for humans. Throughout history, the burning of wood and other biomass provided households with thermal energy, which was used for cooking, heating, washing, and lighting. Photosynthesis also underpinned all historical sources of mechanical...", "posttime": "2020-05-30 05:51:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "电炉,thermoelectric,木炉", "title": "热电炉与太阳能电池板", "title_en": "Thermoelectric Stoves vs. Solar Panels", "transed": 1, "url": "https://www.lowtechmagazine.com/2020/05/thermoelectric-stoves-ditch-the-solar-panels.html", "via": "", "real_tags": ["电炉", "木炉"]}]