[{"category": "", "categoryclass": "", "imagename": "21edb8c6efd85989f07d8b1c55c945a8.jpeg", "infoid": 1070929, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "波士顿（美联社）——周六，背负着数月拖欠租金的租户正面临联邦驱逐禁令的结束，这一举措可能导致数百万人被迫离开家园，就像冠状病毒的高度传染性三角洲变种正在迅速传播一样。拜登政府周四宣布将允许全国范围内的禁令到期，并表示由于感染人数增加，它希望延长禁令，但在美国最高法院在 6 月份表示不会延长至 7 月底之后，拜登政府束手无策。国会行动。众议院立法者周五试图通过一项法案，将禁令延长数月，但未能通过。一些民主党议员曾希望将其延长至年底。 “八月将是艰难的一个月，因为很多人将流离失所，”大迈阿密公司诉讼法律服务主管杰弗里赫恩说。“这将是我们以前从未见过的数字。有很多人受到……暂停的保护。”疾病控制与预防中心于 9 月实施的暂停措施旨在防止冠状病毒的传播，据报道，在过去一年中，由于大流行重创经济，使 200 万人留在家中。普林斯顿大学驱逐实验室。纽约、新泽西、马里兰、伊利诺伊、加利福尼亚和华盛顿特区的暂停驱逐令仍将有效，直到今年晚些时候到期。在其他地方，联邦暂停令的结束意味着驱逐可能会在周一开始，这将导致数周内长达数年的驱逐，并迎来自大衰退以来最严重的住房危机。罗克珊·谢弗 (Roxanne Schaefer) 已经患有无数健康问题，包括呼吸系统问题和骨骼疾病，她是数百万人害怕无家可归的人之一。\n在她与女友、兄弟、一只狗和一只小猫合住的罗得岛州一套破旧、陈设简陋的公寓里，这位 38 岁的女孩在她的女友在大流行期间失去了洗碗机的工作后，每月 995 美元的房租拖欠了 3,000 美元。公寓里的沙发后面放着装满他们物品的盒子，谢弗说沙发上到处都是老鼠和蟑螂，她的卧室里甚至还有松鼠。房东于 1 月首次试图驱逐她，但拒绝接受联邦租金援助，因此阻止他换锁并驱逐她的唯一因素是 CDC 暂停。她每月 800 美元的残疾支票支付不了新公寓的费用。她只有 1,000 美元的储蓄。 “我感到焦虑。我很紧张。我睡不着，”罗德岛西沃里克的谢弗说，因为害怕被扔在街上。 “如果他这样做，你知道，我会失去一切，而我将一无所有。我会无家可归。”根据阿斯彭研究所的数据，超过 1500 万人生活在欠房东高达 200 亿美元的家庭中。根据美国人口普查局的家庭脉搏调查，截至 7 月 5 日，美国约有 360 万人表示他们将在未来两个月内面临驱逐。南部部分地区和其他租户保护较弱的地区可能会出现最大的高峰，而疫苗接种率有时较低的有色人种社区将受到最严重的打击。但倡导者表示，这场危机可能比大流行前的驱逐产生更广泛的影响，影响到郊区和农村地区以及失业且从未经历过驱逐的工薪家庭。 “我个人知道很多被驱逐的人都是以前工作过的人，他们从来没有遇到过问题，”亚利桑那州皮马县的一名警员克里斯汀兰德尔说，他将负责从周一开始执行驱逐。 “这些人已经尝试寻找新住房、新公寓或与家人同住，”她说。 “我知道他们中的很多人计划留在他们的车里，或者正在考虑尝试在当地的避难所进行预订。但是由于大流行，我们的庇护所空间更加有限。”\n“我们将看到比平时看到的更多的人走上街头。这是不幸的。”到 9 月份，当第一次止赎程序预计开始时，危机只会变得更糟。根据抵押贷款银行家协会的数据，估计有 175 万房主（约占所有房屋的 3.5%）与银行制定了某种宽容计划。相比之下，2008 年房地产泡沫破裂后，约有 1000 万房主因丧失抵押品赎回权而失去房屋。拜登政府曾希望国会在 12 月和 3 月分配的历史性租金援助将有助于避免驱逐危机。但到目前为止，到 6 月份，各州和地方仅分配了第一批 250 亿美元中的约 30 亿美元。另有 215 亿美元将流向各州。 6 月份发放速度加快，但纽约等一些州几乎没有发放任何款项。其他几个人只批准了几百万美元。维克森林大学法学教授、美国律师协会驱逐特别工作组主席艾米丽·本弗说：“我们正处于全国范围内发生灾难性住房流离失所的边缘，这只会增加对公共健康的直接威胁。” , 住房稳定性和公平。一些地方将在未来几天内看到被驱逐的人数激增，而其他司法管辖区将看到法庭文件增加，这将导致在几个月内被驱逐。“这几乎是深不可测的。我们正处于悬崖上一场全国性的驱逐危机是完全可以预防的，只要有更多的时间来分配租金援助，”本弗说。\n“在租金援助申请悬而未决的情况下，暂停驱逐是数百万租户和驱逐之间唯一的问题。当这个重要的公共卫生工具在周六结束时，就像 delta 变体激增一样，情况将变得可怕。”许多陷入困境的租户将被迫进入价格上涨而空置率暴跌的炙手可热的房地产市场。他们将被驱逐记录和拖欠租金困住，这几乎不可能找到新公寓，许多人不得不与家人同住，转向已经紧张的无家可归者收容所，或者在缺乏好学校、良好环境的低收入社区找到不安全的住所。就业和交通便利。许多人还将负债累累。驱逐对他们居住的社区来说也将是代价高昂的。研究表明，被驱逐的家庭面临着一长串健康问题，从较高的婴儿死亡率到高血压再到自杀。纳税人经常买单，提供社会服务、医疗保健和无家可归者服务。亚利桑那大学全国低收入住房联盟和司法创新计划的一项研究发现，与大流行相关的驱逐成本可能达到 1290 亿美元。在罗德岛，Schaefer 一直在努力理解为什么她的房东不接受联邦租金援助。很多房东都成功地在法庭上挑战了暂停令，他们认为经济正在改善，大多数地方的冠状病毒病例都在下降。那些不接受租金援助的人会出于各种原因拒绝，包括希望让租户离开。 “并不是说我想免费住在这里，”谢弗说，“我知道无论你去哪里住，你都得付钱。但我只是要求合理。” “你为什么不能接受租金减免？你知道，他们付钱，”她补充说。“在文书工作中，他们说他们会提前两个月付款。至少到那时，两个月，我可以存很多钱，然后开始付钱搬到其他地方的首付，你会得到我们欠你的钱，然后搬出去。”\n如果您通过本文中的推荐链接购买商品，Microsoft 和合作伙伴可能会获得补偿。在新窗口中打开 打开外部站点 在新窗口中打开外部站点", "note_en": "BOSTON (AP) — Tenants saddled with months of back rent are facing the end of the federal eviction moratorium Saturday, a move that could lead to millions being forced from their homes just as the highly contagious delta variant of the coronavirus is rapidly spreading.\n       The Biden administration  announced Thursday it would allow the nationwide ban to expire, saying it wanted to extend it due to rising infections but its hands were tied after the U.S. Supreme Court signaled in June that it wouldn&#39;t be extended beyond the end of July without congressional action.\n House lawmakers on Friday attempted, but failed, to pass a bill to extend the moratorium even for a few months. Some Democratic lawmakers had wanted it extended until the end of the year.\n “August is going to be a rough month because a lot of people will be displaced from their homes,” said Jeffrey Hearne, director of litigation Legal Services of Greater Miami, Inc. “It will be at numbers we haven’t seen before. There are a lot of people who are protected by the ... moratorium.”\n The moratorium, put in place by the Centers for Disease Control and Prevention in September to try to prevent the spread of the coronavirus, is credited with keeping 2 million people in their homes over the past year as the pandemic battered the economy, according to the Princeton University’s Eviction Lab. Eviction moratoriums will remain in place in New York, New Jersey, Maryland, Illinois, California and Washington, D.C., until they expire later this year.\n       Elsewhere, the end of the federal moratorium means evictions could begin Monday, leading to a years&#39; worth of evictions over several weeks and ushering in the worst housing crisis since the Great Recession.\n       Roxanne Schaefer, already suffering from myriad health issues, including respiratory problems and a bone disorder, is one of the millions fearing homelessness.\n In a rundown, sparsely furnished Rhode Island apartment she shares with her girlfriend, brother, a dog and a kitten, the 38-year-old is $3,000 behind on her $995 monthly rent after her girlfriend lost her dishwasher job during the pandemic. Boxes filled with their possessions were behind a couch in the apartment, which Schaeffer says is infested with mice and cockroaches, and even has squirrels in her bedroom.\n The landlord, who first tried to evict her in January, has refused to take federal rental assistance, so the only thing preventing him from changing the locks and evicting her is the CDC moratorium. Her $800 monthly disability check won&#39;t pay for a new apartment. She only has $1,000 in savings.\n “I got anxiety. I’m nervous. I can’t sleep,” said Schaefer, of West Warwick, Rhode Island, over fears of being thrown out on the street. “If he does, you know, I lose everything, and I’ll have nothing. I’ll be homeless.”\n More than 15 million people live in households that owe as much as $20 billion to their landlords, according to the Aspen Institute. As of July 5, roughly 3.6 million people in the U.S. said they faced eviction in the next two months, according to the U.S. Census Bureau’s Household Pulse Survey.\n       Parts of the South and other regions with weaker tenant protections will likely see the largest spikes, and communities of color, where vaccination rates are sometimes lower, will be hit hardest. But advocates say this crisis is likely to have a wider impact than pre-pandemic evictions, reaching suburban and rural areas and  working families who lost their jobs and never before experienced an eviction.\n  “I know personally many of the people evicted are people who worked before, who never had issues,” said Kristen Randall, a constable in Pima County, Arizona, who will be responsible for carrying out evictions starting Monday.\n “These are people who already tried to find new housing, a new apartment or move in with families,” she said. “I know quite a few of them plan on staying in their cars or are looking at trying to make reservations at local shelters. But because of the pandemic, our shelter space has been more limited.&#34;\n “We are going to see a higher proportion of people go to the streets than we normally see. That is unfortunate.”\n The crisis will only get worse in September when the first foreclosure proceedings are expected to begin. An estimated 1.75 million homeowners — roughly 3.5% of all homes — are in some sort of forbearance plan with their banks, according to the Mortgage Bankers Association. By comparison, about 10 million homeowners lost their homes to foreclosure after the housing bubble burst in 2008.\n The Biden administration had hoped that historic amounts of  rental assistance allocated by Congress in December and March would help avert an eviction crisis.\n But so far, only about  $3 billion of the first tranche of $25 billion had been distributed through June by states and localities. Another $21.5 billion will go to the states. The speed of disbursement picked up in June, but some states like New York have distributed almost nothing. Several others have only approved a few million dollars.\n &#34;We are on the brink of catastrophic levels of housing displacement across the country that will only increase the immediate threat to public health,” said Emily Benfer, a law professor at Wake Forest University and the chair of the American Bar Association’s Task Force on Eviction, Housing Stability and Equity.\n Some places will see a spike in people being evicted in the coming days, while other jurisdictions will see an increase in court filings that will lead to evictions over several months.\n “It’s almost unfathomable. We are on the precipice of a nationwide eviction crisis that is entirely preventable with more time to distribute rental assistance,&#34; Benfer said.\n “The eviction moratorium is the only thing standing between millions of tenants and eviction while rental assistance applications are pending. When that essential public health tool ends on Saturday, just as the delta variant surges, the situation will become dire.”\n Many beleaguered tenants will be forced out into a red-hot housing market where prices are rising and vacancy rates have plummeted.\n They will be stuck with eviction records and back rent that will make it almost impossible to find new apartments, leaving many to shack up with families, turn to already strained homeless shelters or find unsafe dwellings in low-income neighborhoods that lack good schools, good jobs and access to transportation. Many will also be debt-ridden.\n Evictions will also prove costly to the communities they reside in. Studies have shown evicted families face a laundry list of health problems, from higher infant mortality rates to high blood pressure to suicide. And taxpayers often foot the bill, from providing social services, health care and homeless services. One study by the National Low Income Housing Coalition and Innovation for Justice Program at the University of Arizona found costs could reach $129 billion from pandemic-related evictions.\n       In Rhode Island, Schaefer has struggled to grasp why her landlord wouldn&#39;t take federal rental assistance. Landlords, many of whom have successfully challenged the moratorium in court, argue the economy is improving and coronavirus cases are down in most places. Those who don&#39;t take rental assistance refuse for a variety of reasons, including a desire to get the tenant out.\n   “It’s not that I wanna live here for free,&#34; Schaefer said. “I know wherever you go and live, you gotta pay. But I’m just asking to be reasonable.&#34;\n “Why can’t you take the rent relief? You know, they pay,&#34; she added. “In the paperwork it says they’re gonna pay, like, two months in advance. At least by then, two months, I can save up quite a bit of money and get to put a down payment on somewhere else to move, and you’ll have your money that we owe you and will be moving out.”\n  Microsoft and partners may be compensated if you purchase something through recommended links in this article.\n            Opens in a new window  Opens an external site  Opens an external site in a new window", "posttime": "2021-08-01 07:47:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "结束,prepare,驱逐", "title": "随着驱逐暂停期结束，租户为未知做准备", "title_en": "Tenants prepare for unknown as eviction moratorium ends", "transed": 1, "url": "https://www.msn.com/en-gb/money/other/tenants-prepare-for-unknown-as-eviction-moratorium-ends/ar-AAMMMmH", "via": "", "real_tags": ["结束", "prepare", "驱逐"]}, {"category": "", "categoryclass": "", "imagename": "04e76d65d69076e52fafedc77aea0828.jpeg", "infoid": 1070927, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在美国，近八分之一的夫妇患有不孕症。不幸的是，像我这样专门从事生殖医学的医生在大约 30% 到 50% 的时间里无法确定男性不育的原因。几乎没有什么比告诉一对夫妇“我不知道”或“我无能为力”更令人沮丧的了。得到这个消息后，一对夫妇问我的问题都遵循类似的思路。 “他的工作、他的手机、我们的笔记本电脑、所有这些塑料呢？你认为他们可以为此做出贡献吗？”我的患者真正问我的是男性生殖健康方面的一个大问题：环境毒性是否会导致男性不育？不孕不育被定义为一对夫妇尽管经常性交但仍无法怀孕一年。在这种情况下，医生会对双方进行评估以确定原因。对于男性来说，生育力评估的基石是精液分析，并且有多种评估精子的方法。精子数量——一个男人产生的精子总数——和精子浓度——每毫升精液的精子数量——是常见的衡量标准，但它们并不是生育能力的最佳预测指标。更准确的测量是查看活动精子总数，它评估能够游泳和移动的精子的比例。多种因素——从肥胖到荷尔蒙失衡再到遗传疾病——都会影响生育能力。对于许多男性来说，有一些治疗方法可以提供帮助。但从 1990 年代开始，研究人员注意到了一个令人担忧的趋势。即使控制了许多已知的风险因素，几十年来男性生育能力似乎一直在下降。 1992 年，一项研究发现，在过去的 60 年中，全球男性的精子数量下降了 50%。随后几年的多项研究证实了这一初步发现，包括 2017 年的一篇论文显示，1973 年至 2011 年间，世界各地男性的精子浓度下降了 50% 至 60%。\n这些研究虽然很重要，但侧重于精子浓度或精子总数。因此，在 2019 年，一组研究人员决定专注于更强大的活动精子总数。他们发现，在过去的 16 年中，活动精子总数正常的男性比例下降了大约 10%。科学是一致的：今天的男性产生的精子比过去少，精子也不太健康。那么，问题是什么可能导致生育率下降。多年来，科学家们已经知道，至少在动物模型中，环境毒性暴露会改变荷尔蒙平衡并阻碍生殖。研究人员不能故意让人类患者接触有害化合物并测量结果，但我们可以尝试评估关联。随着男性生育能力下降的趋势出现，我和其他研究人员开始更多地寻找环境中的化学物质来寻找答案。这种方法无法让我们明确确定哪些化学物质导致男性生育能力下降，但证据的分量正在增加。许多研究都集中在内分泌干扰物上，即模拟人体荷尔蒙并打破脆弱的生殖荷尔蒙平衡的分子。其中包括邻苯二甲酸盐等物质——更广为人知的是增塑剂——以及杀虫剂、除草剂、重金属、有毒气体和其他合成材料。大多数塑料中都含有增塑剂——如水瓶和食品容器——并且暴露与对睾酮和精液健康的负面影响有关。除草剂和杀虫剂在食品供应中比比皆是，有些——特别是那些含有磷的合成有机化合物——是众所周知的对生育产生负面影响。城市周围的空气污染使居民受到颗粒物、二氧化硫、氮氧化物和其他可能导致精子质量异常的化合物的影响。来自笔记本电脑、手机和调制解调器的辐射暴露也与精子数量下降、精子活力受损和精子形状异常有关。镉、铅和砷等重金属也存在于食物、水和化妆品中，并且已知会损害精子健康。\n内分泌干​​扰化合物及其引起的不育问题正在对人类的身心健康造成重大影响。治疗这些危害是昂贵的。今天有很多化学品在使用，追踪它们是非常困难的。今天，超过 80,000 种化学品已在国家毒理学计划中注册。当该计划于 1978 年成立时，其中 60,000 人在信息很少的情况下被纳入该计划，并且每年引入近 2,000 种新化学品。许多科学家认为，健康和环境风险的安全测试不够强大，新化学品的快速开发和引入挑战了组织测试对人类健康的长期风险的能力。目前的美国国家毒理学法规遵循无罪原则，例如，与欧洲的类似法规相比，其全面性和限制性较差。世界卫生组织最近确定了 800 种能够破坏激素的化合物，其中只有一小部分经过了测试。一个贸易组织美国化学理事会在其网站上表示，制造商“拥有创新、增长、创造就业机会和在全球市场中获胜所需的监管确定性——同时公共健康和环境受益于强大的风险-基于保护。”但美国当前监管体系的现实是，化学品在引入时只经过最少的测试，只有在证明有害时才从市场上撤下。而这可能需要几十年的时间。 Niels Skakkebaek 博士是首批关于减少精子数量的手稿之一的首席研究员，他称男性生育能力下降是“对我们所有人的警钟”。我的患者为我敲响了警钟，即提高公众意识和宣传对于保护现在和未来的全球生殖健康非常重要。我不是毒理学家，无法确定我所看到的不孕症趋势的原因，但作为医生，我担心太多的举证责任落在了人体和成为我的病人的人身上。", "note_en": "In the U.S., nearly 1 in 8 couples  struggles with infertility. Unfortunately, physicians like me who specialize in reproductive medicine are unable to determine the cause of male infertility around  30% to 50% of the time. There is almost nothing more disheartening than telling a couple “I don’t know” or “There’s nothing I can do to help.”\n Upon getting this news, couple after couple asks me questions that all follow a similar line of thinking. “What about his work, his cellphone, our laptops, all these plastics? Do you think they could have contributed to this?”\n What my patients are really asking me is a big question in male reproductive health: Does environmental toxicity contribute to male infertility?\n   Infertility is defined as a couple’s inability to get pregnant for one year despite regular intercourse. When this is the case, doctors evaluate both partners to determine why.\n For men, the cornerstone of the fertility evaluation is semen analysis, and there are a number of ways to assess sperm. Sperm count – the total number of sperm a man produces – and sperm concentration – number of sperm per milliliter of semen – are common measures, but they aren’t the  best predictors of fertility. A more accurate measure looks at  the total motile sperm count, which evaluates the fraction of sperm that are able to swim and move.\n A wide range of factors – from  obesity to hormonal imbalances to genetic diseases – can affect fertility. For many men, there are  treatments that can help. But starting in the 1990s, researchers noticed a concerning trend. Even when controlling for many of the known risk factors, male fertility  appeared to have been declining for decades.\n In 1992, a study found a global  50% decline in sperm counts in men over the previous 60 years. Multiple studies over  subsequent years confirmed that initial finding, including a 2017 paper showing a  50% to 60% decline in sperm concentration between 1973 and 2011 in men from around the world.\n These studies, though important, focused on sperm concentration or total sperm count. So in 2019, a team of researchers decided to focus on the more powerful total motile sperm count. They found that the proportion of men with a normal total motile sperm count  had declined by approximately 10% over the previous 16 years.\n The science is consistent: Men today produce fewer sperm than in the past, and the sperm are less healthy. The question, then, is what could be causing this decline in fertility.\n   Scientists have known for years that, at least in  animal models, environmental toxic exposure can alter hormonal balance and throw off reproduction. Researchers can’t intentionally expose human patients to harmful compounds and measure outcomes, but we can try to assess associations.\n As the downward trend in male fertility emerged, I and other researchers began looking more toward chemicals in the environment for answers. This approach doesn’t allow us to definitively establish which chemicals are causing the male fertility decline, but the  weight of the evidence is growing.\n A lot of this research focuses on  endocrine disrupters, molecules that mimic the body’s hormones and  throw off the fragile hormonal balance of reproduction. These include substances like phthalates – better known as plasticizers – as well as pesticides, herbicides, heavy metals, toxic gases and other synthetic materials.\n Plasticizers are found in most plastics – like water bottles and food containers – and exposure is associated with  negative impacts on testosterone and semen health.Herbicides and pesticides abound in the food supply and some – specifically those with synthetic organic compounds that include phosphorus – are  known to negatively affect fertility.\n Air pollution surrounds cities, subjecting residents to particulate matter, sulfur dioxide, nitrogen oxide and other compounds that likely  contribute to abnormal sperm quality. Radiation exposure from laptops, cellphones and modems has also been associated with  declining sperm counts, impaired sperm motility and abnormal sperm shape. Heavy metals such as cadmium, lead and arsenic are also present in food, water and cosmetics and are also known to  harm sperm health.\n Endocrine-disrupting compounds and the infertility problems they cause are taking a significant toll on human  physical and emotional health. And treating these harms  is costly.\n   A lot of chemicals are in use today, and tracking them all is incredibly difficult. Today, more than 80,000 chemicals are registered with the National Toxicology Program. When the program was founded in 1978,  60,000 of those were grandfathered into the program with minimal information, and nearly  2,000 new chemicals are introduced each year. Many scientists believe that the safety testing for health and environmental risks  is not strong enough and that the rapid development and introduction of new chemicals challenges the ability of organizations to  test long-term risks to human health.\n Current U.S. national toxicology regulations follow the principle of  innocent until proved guilty and are  less comprehensive and restrictive than  similar regulations in Europe, for example. The  World Health Organization recently identified 800 compounds capable of disrupting hormones, only a small fraction of which have been tested.\n A trade group, the American Chemistry Council, says on its website that manufacturers “have the regulatory certainty they need to innovate, grow, create jobs and win in the global marketplace – at the same time that public health and the environment benefit from strong risk-based protections.”\n But the reality of the current regulatory system in the U.S. is that chemicals are introduced with minimal testing and taken off the market only when harm is proved. And that can  take decades.\n Dr. Niels Skakkebaek, the lead researcher on one of the  first manuscripts on decreasing sperm counts, called the male fertility decline a “wake-up call to all of us.” My patients have provided a wake–up call for me that increased public awareness and advocacy are important to protect global reproductive health now and in the future. I’m not a toxicologist and can’t identify the cause of the infertility trends I’m seeing, but as physician, I am concerned that too much of the burden of proof is falling on the human body and people who become my patients.", "posttime": "2021-08-01 07:46:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "生育能力,fertility,精子", "title": "男性生育能力下降——研究表明环境毒素可能是一个原因", "title_en": "Male fertility declining – studies show environmental toxins could be a reason", "transed": 1, "url": "https://theconversation.com/male-fertility-is-declining-studies-show-that-environmental-toxins-could-be-a-reason-163795", "via": "", "real_tags": ["生育能力", "fertility", "精子"]}, {"category": "", "categoryclass": "", "imagename": "17157b8a3d851252dd104ae92e9cec2f.jpg", "infoid": 1070926, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2014 年，Becky Hollingsworth 经历了一场肺炎，持续咳嗽和呼吸急促。她的医生诊断出哮喘并开了两个吸入器和一个口服药物。他们缓解了她的咳嗽，但霍林斯沃思并不相信她患有哮喘。她想，她的症状还不够严重。因此，几个月后，当她接到自动电话邀请她参加哮喘研究时，她抓住了这个机会。该研究由渥太华大学和渥太华医院呼吸科主任 Shawn Aaron 领导。他的研究受到了他在转诊给他的患者中看到的启发，因为他们的哮喘药物不起作用。哮喘是一种常见的气道疾病，伴随着喘息和胸闷等症状，也见于其他肺部疾病。但是，当 Aaron 对转诊的患者进行测试时，他发现许多诊断完全错误。他已经完成了几项较小的研究；这个新项目雄心勃勃，涉及全国十个地点的 613 名成年人。 Hollingsworth 是一名退休护士，是一名热心的新兵，愿意在距离她家一小时车程的渥太华接受反复测试。第一项测试是肺活量测定，她以前从未做过。戴上鼻夹，患者将呼气吸入连接到肺活量计的管子中，肺活量计是一种测量气流的装置，尽可能快地和用力地测量五秒钟。三击后，他们吸入支气管扩张剂——一种放松气道周围肌肉的药物——等待 15 分钟，然后再进行三击。如果机器记录气流改善，则诊断为哮喘。在 Hollingsworth 的案例中，支气管扩张剂没有任何作用，表明她可能没有患病。但是哮喘症状会来来去去。天气好的时候，患者可以在肺活量测定上做得很好，但仍然有病情。因此，Aaron 将所有看起来没有哮喘的研究参与者提交给第二个测试：乙酰甲胆碱挑战。乙酰甲胆碱是一种化学物质，会导致气道抽搐和易怒。在测试过程中，患者吸入越来越多的乙酰甲胆碱，并在每次增加后吹入肺活量计。患有哮喘的人会对低剂量的化学物质产生不良反应并且反应过度。在日常实践中，让每个通过肺量计测试的人都接受乙酰甲胆碱挑战的成本太高了；它通常保留用于最困难的情况。但是 Aaron 需要准确地确定研究中有多少人接受了错误的诊断。为了更加确定，他指示通过乙酰甲胆碱挑战的参与者在几周内停止服用药物，然后重新接受测试。那些始终没有表现出哮喘迹象的人随后由肺科医生进行评估，以确定他们实际患有的疾病。结果排除了近三分之一参与者的哮喘——总共 203 人。 61 人根本没有任何症状，几乎同样多的人只有过敏症。其中一些人患有焦虑症，另一些人患有胃肠道反流病。有几个人患有严重的疾病，例如心肺疾病和慢性阻塞性肺疾病。 Hollingsworth 曾因之前的肺炎而感染病毒后咳嗽。她从来没有，现在也没有，有哮喘。该研究的结论于 2017 年发表在《美国医学会杂志》上，与加拿大、意大利、荷兰和瑞典的早期研究一致。 Aaron 的研究是迄今为止规模最大的研究，它表明许多患者可以安全地退出治疗。\n误诊率高是有原因的。哮喘是一种可变疾病，可以自发缓解。如果人们从未接受过重新测试，他们可能会认为他们仍然患有哮喘。但更大的原因是系统性的。 Aaron 要求每位研究参与者的医生完成一份问卷和医疗记录审查，并提供肺活量测定、乙酰甲胆碱激发试验或其他用于进行原始诊断的客观测试的证据。在做出回应的 530 名医生中，只有一半要求进行任何此类测试。其他人根据办公室检查中观察到的症状主观做出诊断。如果不要求进行血液检查就诊断糖尿病，或者在不将袖带缠绕在患者手臂上进行测量的情况下开出血压药物，这将是不可想象的。然而，许多家庭医生并没有要求进行标准的哮喘检测，这导致数量惊人的加拿大人（根据亚伦帮助统计的一项估计为 785,000 人）接受了一种他们没有的疾病的治疗。 W 诊断哮喘，弄错不是小事。被贴上慢性病的标签会产生心理影响，并阻碍人们进行体育锻炼。药物有副作用，包括吸入器。通常情况下，哮喘患者每天使用皮质类固醇吸入器和紧急支气管扩张剂——例如熟悉的蓝河豚，万托林——如果他们有发作。长期使用类固醇与骨质疏松症、早期白内障形成、青光眼、容易瘀伤和皮肤变薄有关。然后是价格标签。对于加拿大人来说，每年的药物费用可能高达数百美元。不列颠哥伦比亚大学的一项研究于 2019 年发表在 BMJ Open 上，计算了加拿大哮喘误诊患者的整体医疗保健负担，包括医院和医生就诊以及药物支出。每年达到 2.42 亿美元。而由于缺乏适当的检测而错过重病的危害是无法估量的。长期以来，专家们一直认为，家庭医生不应该在没有先订购肺活量测定法的情况下诊断哮喘。一些全科医生会在他们自己的办公室进行测试，但大多数人认为这是不切实际的，因为对于初学者来说，所涉及的费用不足以支付这项工作。在安大略省，省级健康计划向医生支付 24 美元以进行肺活量测定；不列颠哥伦比亚省支付 28 美元；萨斯喀彻温省，50 美元。包括魁北克在内的一些省份根本不支付任何费用。高质量、解释良好的测试需要时间。患者需要指导才能正确进行测试；机器会输出结果，但如果医生没有解码它们的经验，它们就毫无意义。克莱尔拉姆齐是曼尼托巴大学呼吸学和重症监护助理教授。当她得到转诊时，她做的第一件事就是确保患者确实患有哮喘。她看到了一些从未做过肺活量测定的人；其他人的肺活量测定法“看起来不像哮喘”，但由于解释不当而导致误诊。比进行自己的肺活量测定更好的选择是让医生将患者转诊到测量肺功能的实验室，但拉姆齐承认有等候名单。进行肺活量测定的实验室通常位于专业中心或医院，在这些地方很难预约。例如，在温尼伯的健康科学中心，可能需要六个月的时间才能进行测试。这是全国都存在的问题。当患者呼吸困难并且看起来像哮喘时，提供药物并说：“让我们试试这个，看看它是否有帮助。”然而，即使患者没有哮喘，药物治疗也可能改善呼吸，因此如果医生没有跟进肺活量测定法进行确认，患者可能是最终被错误诊断的数千人之一。朗达·古尔德 (Rhonda Gould) 知道等待的挫败感。她是一名 58 岁的持证牙医助理，住在北温哥华，去年春天，就在加拿大爆发 COVID-19 之际，她出现了肺部感染。她的 COVID-19 测试呈阴性，她的感染得到了治疗，但她的咳嗽不断加重。到了六月，她呼吸困难。肺活量测定法测试未显示哮喘，但她的呼吸科医生建议她尝试吸入器，希望它们能提供一些缓解。她需要进行乙酰甲胆碱激发试验，但由于大流行，肺功能实验室的工作受到严重限制。她将不得不等待。呼吸发作持续到整个夏天，9 月，古尔德的家庭医生怀疑她的病情是由她工作的诊所大量使用消毒湿巾引起的烟雾引发的，建议她转到办公室工作。她的呼吸有所改善，但在 11 月 18 日，她需要回到诊所。到了一天结束的时候，她已经无法呼吸，惊慌失措。 “那是我一生中最可怕的事情，”她回忆道。 “我感觉自己快要窒息了。”那天晚上，她绝望地打电话给她的呼吸科医生，后者帮助她冷静下来，因为她从类固醇吸入器中吸了一口。他告诉她远离湿巾。然后，他向不列颠哥伦比亚大学呼吸内科主任兼职业性肺病诊所主任克里斯·卡尔斯滕（Chris Carlsten）发送了转诊信。\n最后，今年 1 月，古尔德进行了第二次肺活量测定，两周后又进行了乙酰甲胆碱试验，证实没有哮喘。她的呼吸科医生还对她的肺部进行了检查，发现她的声带不稳定且抽搐。在查看了完整的文件后，Carlsten 得出结论，她可能患有喉部易激综合征，这可以解释她对卫生巾的反应。他建议进行言语治疗，以加强她声带周围的肌肉。古尔德几个月都没有工作。与大流行有关的情况，而不是缺乏良好的护理，推迟了她需要的检测。尽管如此，这是确认诊断重要性的一个教训。 T 改进的肺活量测定方法看起来像，我们有温哥华地区的例子，几年前，那里有 17 家医院同意使用相同的转诊表格，使患者更容易预约和选择最方便的肺功能实验室为他们。温哥华总医院还设有一个特殊的诊所，任何有医生要求的人都可以走进去进行肺活量测定。据报道，在 2019 年大流行前，该诊所接待了 4,000 人次就诊。但是，在该省的其他地方以及全国范围内，访问仍然是一个巨大的问题。 “我们知道，与实际所做的工作相比，对肺活量测定法的需求是巨大的，”卡尔斯滕说，他也是气道健康遗产的负责人，这是一个致力于预防和护理哮喘和慢性阻塞性肺病的新组织。多年来，他一直试图教育家庭医生关于哮喘客观检查的重要性，并同意 Shawn Aaron 的观点，即进行肺活量测定应该像检查骨折的 X 光片一样容易。但这需要文化上的转变。很简单，肺活量测定法被低估了。尽管 Carlsten 坚信，如果有更多的实验室提供肺活量测定，就会有更多的家庭医生提出要求，但可能会更好地教育公众，让患者知道需要进行检测。 Carlsten 说：“医生和管理人员喜欢设置能带来很多钱的测试，无论是进入医生的口袋还是医院的金库，这不是一个大赚钱的人。”我们以加拿大的声音和专业知识为特色，讲述超越我们海岸的故事，我们坚信这种报道可以改变我们周围的世界。海象以独创性、深度和周到的方式涵盖了这一切，为基本对话带来了不同的观点，同时为事实核查和严谨性设定了最高标准。我们请求像您这样的读者支持 The Walrus，以便我们能够继续引领加拿大的对话。 20 美元或以上的捐款将收到慈善税收收据。", "note_en": "F  a bout of pneumonia in 2014, Becky Hollingsworth experienced a persistent cough and shortness of breath. Her doctor diagnosed asthma and prescribed two inhalers plus an oral medication. They eased her cough, but Hollingsworth wasn’t convinced that asthma was what she had. Her symptoms weren’t severe enough, she thought. So, months later, when she received an automated phone call inviting her into an asthma study, she leaped at the opportunity.\n  The study was led by Shawn Aaron, chief of respirology at the University of Ottawa and The Ottawa Hospital. His research was inspired by what he was seeing among patients referred to him because their asthma medications weren’t working. Asthma is a common disease of the airways that comes with symptoms, such as wheezing and chest tightness, also seen in other lung conditions. But, when Aaron tested the referred patients, he found many for whom the diagnosis was simply wrong. He’d already done several smaller studies; this new project was ambitious, involving 613 adults in ten locations across the country.\n Hollingsworth, a retired nurse, was an eager recruit, willing to undergo repeated tests in Ottawa, an hour-long drive from her home. The first test was spirometry, one she’d not had before. Wearing nose clips, patients exhale into a tube connected to a spirometer, a device that measures airflow, as fast and hard as they can for five seconds. After three blows, they inhale a bronchodilator—medication that relaxes muscles around the airways—wait fifteen minutes, and do three more blows. If the machine registers improvement in airflow, the diagnosis is asthma.\n  In Hollingsworth’s case, the bronchodilator made no difference, indicating she might not have the disease. But asthma symptoms can come and go. On a good day, a patient can do well on spirometry but still have the condition. Aaron therefore submitted all study participants who appeared asthma-free to a second test: the methacholine challenge. Methacholine is a chemical that causes the airways to get twitchy and irritable. During the test, patients inhale increasing doses of methacholine and blow into a spirometer after each increase. A person with asthma will react badly and be hyper-responsive to low doses of the chemical.\n In day-to-day practice, it’s too costly to give everyone who passes a spirometry test the methacholine challenge; it is typically reserved for the most difficult cases. But Aaron needed to be precise in determining how many in the study had received incorrect diagnoses. For even greater certainty, he instructed participants who passed the methacholine challenge to wean off their medications over several weeks and then get retested. Those who consistently showed no indication of asthma were then assessed by a pulmonologist to determine what they actually had.\n  The results ruled out asthma in nearly a third of the participants—203 in total. Sixty-one had no symptoms at all, and almost as many had only allergies. Among the others, some suffered anxiety, others gastrointestinal reflux disease. Several had serious conditions that had been missed, such as cardiorespiratory disease and chronic obstructive pulmonary disorder. Hollingsworth had a post-viral cough linked to her previous pneumonia. She never did, and still does not, have asthma.\n Conclusions from the study, published in the  Journal of the American Medical Association in 2017, were consistent with earlier research in Canada, Italy, the Netherlands, and Sweden. Aaron’s study is the largest to date, and it demonstrates that many patients can safely withdraw from treatment.\n There are reasons for the high rate of misdiagnosis. Asthma is a variable disease and can go into spontaneous remission. If people never get retested, they may assume they still have asthma. But the bigger reason is systemic. Aaron asked each study participant’s doctor to complete a questionnaire and medical-record review and provide evidence of spirometry, methacholine challenge, or other objective tests employed in making the original diagnosis. Of the 530 physicians who responded, only half had requested any such tests. The others had made the diagnosis subjectively, on the basis of symptoms observed in an office examination.\n It would be unthinkable to diagnose diabetes without ordering a blood test or to prescribe blood-pressure medication without wrapping a cuff around a patient’s arm to measure it. Yet many family physicians don’t order the standard test for asthma, which has resulted in a staggering number of Canadians—785,000, according to one estimate Aaron helped tally—being treated for a disease they do not have.\n W  diagnosing asthma, getting it wrong is not a trivial matter. Being labelled with a chronic illness can have psychological effects and hold people back from physical activity. Drugs have side effects, inhalers included. Typically, people with asthma use a corticosteroid inhaler daily and an emergency bronchodilator—such as the familiar blue puffer, Ventolin—if they have an attack. Prolonged use of steroids is associated with osteoporosis, earlier cataract formation, glaucoma, easy bruising, and skin thinning. Then there’s the price tag. For Canadians, the yearly cost of medication can be in the hundreds of dollars. A University of British Columbia study, published in  BMJ Open in 2019, calculated the overall health care burden, including hospital and physician visits and drug expenditures, of patients who had received asthma misdiagnoses in Canada. It came to $242 million per year. And the harm of missing a serious illness due to lack of a proper test is incalculable.\n  Specialists have long argued that family physicians should not diagnose asthma without first ordering spirometry. Some general practitioners will administer the test in their own offices, but most find it impractical because, for starters, the fees involved aren’t enough to cover the effort. In Ontario, the provincial health plan pays physicians $24 to perform spirometry; British Columbia pays $28; Saskatchewan, $50. Some provinces, including Quebec, pay no fee at all. A high-quality, well-interpreted test takes time. Patients need coaching to do the test properly; the machine spits out results, but they are meaningless if the physician is not experienced at decoding them. Clare Ramsey is an assistant professor of respirology and critical care at the University of Manitoba. When she gets a referral, the first thing she does is make sure the patient really has asthma. She sees some who’ve never had spirometry; others have had spirometry that “in no way looks like asthma” but led to a misdiagnosis because of poor interpretation.\n The better option than conducting their own spirometry is for doctors to refer patients to labs that measure lung function, but Ramsey acknowledges that there are waiting lists. The labs that do spirometry are most often in specialized centres or hospitals, where appointments aren’t easy to get. At Winnipeg’s Health Sciences Centre, for example, it can take six months to get a test. It’s a problem that exists across the country. When a patient has trouble breathing and it looks like asthma, it’s expedient to offer medication and say, “Let’s try this and see if it helps.” Yet medication may improve breathing even if the patient doesn’t have asthma, so if a doctor doesn’t follow up with spirometry to confirm, the patient could be one of the thousands who end up living with the wrong diagnosis.\n  Rhonda Gould knows the frustration of waiting. She is a fifty-eight-year-old certified dental assistant living in North Vancouver who developed a lung infection last spring, just as COVID-19 erupted in Canada. Her COVID-19 test was negative, and her infection was treated, but she was left with an annoying worsening cough. By June, she was experiencing difficulty breathing. A spirometry test did not indicate asthma, but her respirologist suggested she try inhalers, hoping they would provide some relief. She needed a methacholine challenge test, but due to the pandemic, pulmonary-function labs were severely restricted in what they could do. She would have to wait.\n The breathing attacks continued through the summer, and in September, Gould’s family doctor, suspecting that her condition was triggered by fumes from the aggressive use of disinfectant wipes in the clinic where she worked, recommended she transfer to office duties. Her breathing improved, but on November 18, she was needed back in the clinic. By the end of the day, she could not get a breath and was panicking. “It was the scariest thing of my life,” she recalls. “I felt like I was choking.” That evening, she made a desperate call to her respirologist, who helped her calm down as she took puffs from her steroid inhaler. He told her to stay away from the wipes. Then he sent a referral to Chris Carlsten, head of respiratory medicine and director of the occupational lung disease clinic at the University of British Columbia.\n Finally, this January, Gould had a second spirometry test, followed two weeks later by a methacholine challenge, which confirmed the absence of asthma. Her respirologist also did a scope of her lungs and noted that her vocal cords were erratic and twitchy. After reviewing the complete file, Carlsten concluded that she likely had an irritable larynx syndrome that could explain her reaction to the sanitation wipes. He recommended speech therapy to strengthen the muscles around her vocal cords. Gould was off work for months. Circumstances related to the pandemic, not lack of good care, delayed the testing she needed. Nevertheless, it’s a lesson in the importance of confirming diagnoses.\n T  improved spirometry access can look like, we have the example of the Vancouver area, where, several years ago, seventeen hospitals agreed to use the same referral form, making it easier for patients to book appointments and choose the lung-function lab most convenient for them. There is also a special clinic attached to Vancouver General Hospital where anyone with a doctor’s requisition can walk in and get a spirometry test. In 2019, prepandemic, the clinic reportedly saw 4,000 walk-ins. But access remains a huge problem elsewhere in the province—and the country.\n “We know that the need for spirometry is massive compared to what’s actually being done,” says Carlsten, who is also the director of Legacy for Airway Health, a new organization dedicated to the prevention and care of asthma and chronic obstructive pulmonary disease. He has tried for many years to educate family physicians about the importance of objective tests for asthma and agrees with Shawn Aaron that getting a spirometry test should be as easy as getting an X-ray for a broken bone. But it will take a cultural shift. Spirometry is, quite simply, undervalued. While Carlsten firmly believes that, if more labs offer spirometry, more family doctors will request it, efforts may be better directed at educating the public so that patients know to demand the test.\n “Doctors and administrators love to set up tests that are going to bring in a lot of money, either into the doctor’s pocket or the hospital’s coffers,” Carlsten says, “and this is not a big money maker.”\n   We feature Canadian voices and expertise on stories that travel beyond our shores, and we firmly believe that this reporting can change the world around us. The Walrus covers it all with originality, depth, and thoughtfulness, bringing diverse perspectives to bear on essential conversations while setting the highest bar for fact-checking and rigour.\r  We’re asking readers like you to support The Walrus so we can continue to lead the Canadian conversation.      Donations of $20 or more will receive a charitable tax receipt.", "posttime": "2021-08-01 07:46:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "阳性,positive,哮喘", "title": "假阳性：为什么成千上万的患者可能根本没有哮喘", "title_en": "False Positive: Why Thousands of Patients May Not Have Asthma After All", "transed": 1, "url": "https://thewalrus.ca/false-positive-why-thousands-of-patients-may-not-have-asthma-after-all/", "via": "", "real_tags": ["阳性", "positive", "哮喘"]}, {"category": "", "categoryclass": "", "imagename": "74672da68580076d20c86ae726acb5ed.jpeg", "infoid": 1070925, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对于美国城市杀戮事件的增加，有很多解释，包括大流行病以及为应对这一流行病所做的选择。在费城，原因、人力成本——以及苦难——尤其明显。 ProPublica 是一家调查滥用权力的非营利性新闻编辑室。注册以在发布后立即接收我们最大的故事。与 Miles Bryan 和 Jillian Weinberger 一起报道，作为 Vox 的“Today, Explained”播客合作的一部分。当 Nakisha Billa 决定第一次飞往安全地点时，她的儿子还是个婴儿。那是在 2000 年初，她和多莫尼克住在肯辛顿的北费城附近，这里长期以来一直是该市犯罪率最高的地区。比拉 22 岁，在西费城主要由她的祖父母抚养长大后，她为能住在自己的地方感到自豪，并且对母性的新鲜感充满了热情。 “当我发现我带着 Dom 时，这是我经历过的最好的事情，”她说。她喜欢亲吻他的脚，他也很喜欢，以至于他会带着灿烂的笑容将它们伸出来。感谢您的注册。如果您喜欢我们的故事，介意与朋友分享吗？复制链接 如需了解更多最新动态，请务必查看我们的其他时事通讯。\n看到所有一个不合时宜的温暖春日，她和多姆一起走到商店买东西吃。他们正要离开时，街上爆发了一场战斗，枪声四起。 “我只是僵住了，”她说。 “我什么也做不了，只能站在那里抱着我的孩子。”当他们安全回到家时，她已决定离开附近。她知道她的祖父母会收留他们，但她更喜欢自己走自己的路，所以她收拾好他们的东西，到收容所寻求帮助。 “我知道，如果我不为 Domonic 和我自己做点什么，我们就会一直依赖某个人，”她说。在一系列补贴公寓中蹦蹦跳跳的同时，比拉开始从事医疗账单工作。但她对 Dom 所在的托儿中心并不满意。所以她抓住了一份工作的机会，有人告诉她，她可以带他一起去：驾驶校车。她努力学习她的商业驾驶执照并通过了。每个工作日，她都会和他绑在公交车的前排出发。 2005 年，比拉又搬到了费城东北部。与她住在北费城的地方相比，这座城市的那条街道，一直延伸到 95 号州际公路，犯罪率和暴力行为要低得多。她想给儿子一个安全的环境。碰巧的是，在她搬家后的几年里，即使是她以前在北费城的社区也会变得更安全。费城暴力犯罪的下降并不像纽约市和洛杉矶那样引人注目，但它本身就令人印象深刻。 1990 年至 2007 年间，费城平均每年发生 382 起凶杀案。从 2008 年开始，这一数字稳步下降，而在 2013 年和 2014 年，该市每年登记的杀人事件不到 250 起。下降与城市前景的显着升级相吻合：中心城市的复兴，人口增长的恢复。 2008 年至 2016 年担任市长的迈克尔·纳特 (Michael Nutter) 说：“我相信，由于我们在那些日子里所做的许多事情，有些人今天可能还活着。暴力犯罪减少的背后。犯罪学家提出了一系列可能的解释，其中包括裂缝流行病的过去、1990 年代警察部队的扩张以及儿童房屋油漆和汽油中铅暴露的减少。\n辩论主要是学术性的，是关于一个快乐故事的友好争论。然而，近年来，这种趋势在费城和全国大部分地区开始逆转——首先是逐渐的，然后是去年急剧逆转。 2020 年全国凶杀率上升了 25%，回到了 1990 年代后期的水平，抹去了 20 年的进步。全国范围内的比率仍低于 1990 年代初的高点，但包括费城在内的许多城市已接近或超过历史高点。在包括费城在内的许多城市，今年的情况可能比去年更糟。这种飙升的死亡人数主要集中在黑人社区，这给理解这个问题带来了新的紧迫性。但过去一年半的可怕经历也提供了一个机会来了解是什么导致了枪支暴力，以及如何阻止它。冠状病毒大流行以及官员为应对此做出的决定，导致无数被认为对暴力具有预防作用的公共和社会服务被取消或冻结。几乎同时移除它们会产生一种意想不到的压力测试，揭示它们对维护社会秩序的重要性。此次撤军的影响叠加在其他促成因素之上，例如费城和其他城市的刑事司法改革，以及在更多引人注目的警察死亡事件后警察与社区关系的进一步恶化。全国各地的犯罪学家和城市领导人现在正争先恐后地解开这些因果关系，随着高峰的继续，将费城这样的城市变成了一种高风险的实验室。当然，对于像 Nakisha Billa 这样的费城人来说，这座城市不是实验室。这是她的家。在过去的二十年里，这座城市在公共安全方面所采取的道路在她的生活中是显而易见的，每时每刻都在塑造它——并在大流行期间打破它。", "note_en": "There are many explanations for the rise in killings in U.S. cities, including the pandemic and the choices made in response to it. In Philadelphia, the causes, the human costs — and the suffering — are particularly stark.\n    ProPublica is a nonprofit newsroom that investigates abuses of power. Sign up to receive  our biggest stories as soon as they’re published.\n  Reported with Miles Bryan and Jillian Weinberger as part of a collaboration for Vox’s  “Today, Explained” podcast.\n  Nakisha Billa’s son was still a baby when she decided to make their first flight to safety. It was early in 2000 and she and Domonic were living in the North Philadelphia neighborhood of Kensington, which had long suffered some of the highest crime rates in the city. Billa was 22, proud to be living in her own place after having been raised in West Philadelphia mostly by her grandparents, and flush with the novelty of motherhood. “When I found out I was carrying Dom, it was the best thing that had ever happened to me,” she said. She liked to kiss his feet, and he liked it, too, so much so that he would stick them out invitingly with a big smile on his face.\n  Thanks for signing up. If you like our stories, mind sharing this with a friend?\n    Copy link\n  For more ways to keep up, be sure to check out the rest of our newsletters.\n  See All\n    One unseasonably warm spring day, she walked with Dom to the store to get something to eat. As they were leaving, a fight broke out on the street, with gunfire all around. “I just froze,” she said. “There was nothing I could do but just stand there and hold my baby.”\n  By the time they got safely home, she had resolved to leave the neighborhood. She knew her grandparents would take them in, but she preferred to seek her own path, and so she packed up their belongings and sought assistance at a shelter. “I knew that if I didn’t do something for Domonic and me, we would always be dependent on someone,” she said.\n  While bouncing around a succession of subsidized apartments, Billa started working in medical billing. But she wasn’t happy with the child care center that Dom was in. So she jumped at the chance of a job where, she was told, she would be allowed to bring him with her: driving a school bus. She studied hard for her commercial driver’s license and passed. Every weekday, she would set off with him strapped in the front row of the bus.\n  In 2005, Billa made yet another move, to Northeast Philadelphia. That swath of the city, an arm extending far up Interstate 95, had a much lower rate of crime and violence than where she was living in North Philadelphia. She wanted a safe environment for her son.\n    As it happened, even her former neighborhoods in North Philadelphia would grow safer in the years following her move. The decline in violent crime in Philadelphia was not nearly as attention-getting as those in New York City and Los Angeles, but it was impressive in its own right. Between 1990 and 2007, Philadelphia averaged 382 homicides per year.  Beginning in 2008 the numbers dropped steadily, and in 2013 and 2014, the city registered fewer than 250 killings each year. The decline coincided with a notable upgrade of the city’s prospects: the rejuvenation of Center City, the resumption of population growth. “I believe that there are some people probably still alive today because of many of the things we did back in those days,” said Michael Nutter, who served as mayor from 2008 to 2016.\n  As elsewhere, there was no clear consensus about what was behind the drop in violent crime. Criminologists offered up a string of possible explanations, among them the passing of the crack epidemic, the expansion of police forces in the 1990s, and the reduction of childhood lead exposure in house paint and gasoline.\n    The debate was largely academic, a friendly argument over a happy story. In recent years, however, the trend started to reverse in Philadelphia and much of the country — first gradually, and then last year sharply. The nationwide homicide rate jumped 25% in 2020, taking it back to where it was in the late 1990s, wiping out two decades’ worth of progress. The nationwide rate is still below its highs in the early 1990s, but many cities, including Philadelphia, are near or past their all-time highs. And in many cities, including Philadelphia, this year is on track to be even worse than last year.\n  This soaring toll, which is heavily concentrated in Black neighborhoods, has brought new urgency to understanding the problem. But the terrible experience of the past year and a half has also offered an opportunity to make sense of what drives gun violence, and how to deter it. The coronavirus pandemic, and the decisions that officials made in response to it, had the effect of undoing or freezing countless public and social services that are believed to have a preventative effect on violence. Removing them, almost simultaneously, created a sort of unintended stress test, revealing how essential they are to preserving social order.\n    The effect of this withdrawal was layered atop other contributing factors, such as criminal justice reforms in Philadelphia and other cities, and further deterioration of police-community relations in the wake of more high-profile deaths at police hands. Criminologists and city leaders across the country are now scrambling to disentangle these layers of causation as the spike carries on, turning a city such as Philadelphia into a sort of high-stakes laboratory.\n  Of course, for Philadelphians like Nakisha Billa, the city is not a laboratory. It is her home. The path the city has taken on public safety over the past two decades has been something palpable in her life, shaping it at every turn — and shattering it during the pandemic.", "posttime": "2021-08-01 07:45:53", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "美国,揭示,reveals,费城", "title": "费城揭示了美国凶杀案激增的情况", "title_en": "What Philadelphia Reveals About America’s Homicide Surge", "transed": 1, "url": "https://www.propublica.org/article/philadelphia-homicide-surge", "via": "", "real_tags": ["美国", "揭示", "reveals", "费城"]}, {"category": "", "categoryclass": "", "imagename": "e0de86a2fdb62534931053399932967e.jpeg", "infoid": 1070924, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "特斯拉车主非常喜欢他们的汽车。根据研究小组 Escalent 的一项调查结果，他们对首席执行官埃隆马斯克的看法更加微妙。事实上，许多不是特斯拉电动车车主或打算购买电动车的受访者认为马斯克是负面的。该公司表示，特斯拉从融资到快速充电的一站式采购对该品牌来说是一个巨大的优势，这是通用汽车和福特可能无法复制的。汽车行业的大多数人都认为特斯拉的买家会被该品牌的高科技形象所吸引，或者是其反复无常的首席执行官埃隆马斯克的粉丝。但研究公司 Escalent 的一项新调查表明，这与真实情况相去甚远。 “事实上，”行为和分析公司 Escalent 的副总裁 Mike Dovorany 告诉 Car and Driver，“在购买或已经拥有电动汽车（特斯拉或其他）的受访者中，埃隆马斯克是他们考虑的首要[缺点]品牌。”作为 EVForward 计划的一部分，Escalent 的研究是在 2020 年 12 月 21 日至 2021 年 2 月 19 日期间对 1003 名受访者的全国样本进行的，包括调查、焦点小组和对行业专家的采访。受访者是 100 名特斯拉车主， 100 名其他电动汽车的车主，以及 803 名目前没有电动汽车的司机。它们是 EVForward 数据库的一个子集，该数据库包含 18 到 80 岁的 10,000 多名新车购买者，按年龄、性别和居住州加权以匹配美国新车购买者的人口统计数据，并按车辆类型匹配当前销量。这项研究的样本来自一个选择加入的在线小组。结果显示，特斯拉汽车对电动车车主和打算在五年内购买电动车的人都有吸引力。他们的理由类似于汽车制造商在推出任何新产品时所希望的，无论它是由什么驱动的。电动车车主和有意购买者认为特斯拉汽车因其造型、性能和加速、制造质量以及它们的新颖性和与众不同而具有吸引力。电池续航里程是前五名中唯一针对电动汽车的属性。\n至于马斯克，特斯拉车主对他有很多话要说。虽然其中一些是负面的——主要与他在 Twitter 上表达的观点有关——但他们认为他对公司和他们的汽车的贡献超过了这些负面影响。对于非特斯拉车主来说并非如此。他们也对特斯拉汽车持积极态度，并没有拒绝它们。但是，尽管大约四分之一的特斯拉车主 (26%) 表示马斯克贬低了该品牌，但大多数非车主认为他是负面的：“天才，但直言不讳，令人讨厌的人”，引用该公司的一句话采访。非车主也对特斯拉在自动驾驶技术方面的安全性表示了更大的担忧：该公司多年来承诺的高级驾驶辅助系统 Autopilot 套件和全自动驾驶 (FSD) 功能。该研究包含许多其他关于特斯拉及其如何看待的掘金。作为一家公司，它的年轻化并不重要，事实上，大多数受访者认为这是一个积极的因素。一位参与者表示，由于该公司完全致力于电动汽车，“没有什么可以与之相提并论的”。事实证明，特斯拉类似苹果的“一站式体验”对车主来说是一个巨大的优势。它管理电动汽车购买和拥有的所有方面的能力——销售、融资、服务、快速充电和包含快速充电的路线规划——被 91% 的车主认为是购买另一辆特斯拉的理由。 Dovorany 建议，这是一个传统制造商将难以复制的生态系统。最后，让人们驾驶电动汽车被广泛认为是让购物者相信汽车是真实的并且可以为他们工作的最佳方式。许多车主报告说，在认识拥有电动汽车的朋友、家人或同事后，他们对购买电动汽车变得更加开放。这与 JD Power 最近关于制造商如何销售更多电动汽车的研究得出的结论完全相同。通俗地说，它在行业中被称为让屁股坐在座位上。此内容是从 {embed-name} 导入的。您可以在他们的网站上找到另一种格式的相同内容，或者您​​可以找到更多信息。\n此内容由第三方创建和维护，并导入此页面以帮助用户提供其电子邮件地址。您可以在 Piano.io 上找到有关此内容和类似内容的更多信息", "note_en": "Tesla owners love their cars a lot. Their views of CEO Elon Musk are much more nuanced, according to results of  a survey by research group Escalent.\n  A number of respondents who are either non-Tesla EV owners or intend to buy an EV see Musk as a negative, in fact.\n  Tesla&#39;s one-stop shopping for everything from financing to fast charging is a huge plus for the brand, the firm said, and it&#39;s one GM and Ford may not be able to replicate.\n  Most people in the auto industry assume Tesla buyers are drawn to the brand&#39;s high-tech image or are fans of its mercurial CEO, Elon Musk. But a new  survey from research firm Escalent suggests that&#39;s far from the real story.\n   &#34;In fact,&#34; Mike Dovorany, VP at behavior and analytics firm Escalent, told  Car and Driver,  “among respondents who are shopping for or already own an EV—Tesla or otherwise—Elon Musk is among the top [drawbacks in] their consideration of the brand.”\n Escalent&#39;s research, part of its EVForward program, was conducted among a national sample of 1003 respondents, including a survey, focus groups, and interviews with industry experts, between December 21, 2020, and February 19, 2021. Respondents were 100 Tesla owners, 100 owners of other electric vehicles, and 803 drivers who do not currently own EVs. They are a subset of the EVForward database of more than 10,000 new-vehicle buyers from 18 to 80, weighted by age, gender, and state of residence to match the demographics of U.S. new-vehicle buyers and by vehicle type to match current sales. The sample for this research came from an opt-in online panel.\n The results showed that Tesla vehicles appeal to both EV owners and those who intend to buy an electric car within five years. Their reasons are similar to what automakers hope for when launching any new product, whatever it&#39;s powered by. EV owners and intenders saw Teslas as alluring for their styling, performance and acceleration, build quality, and the fact that they&#39;re new and different. Battery range was the sole attribute among the top five named that is specific to electric cars.\n As for Musk, Tesla owners had lots to say about him. While some of it was negative—largely related to views he has expressed on Twitter—they felt his contributions to the firm and to their cars outweighed those negatives.\n  Not so for the non-Tesla owners. They, too, had a positive view of Teslas as vehicles, and were far from rejecting them. But while roughly a quarter of Tesla owners (26 percent) said Musk detracted from the brand, a majority of non-owners viewed him as a negative: &#34;a genius, but an outspoken, obnoxious one,&#34; to use one quote from the company&#39;s interviews.\n Non-owners also expressed greater concern over Tesla&#39;s safety in regard to its self-driving technologies: the Autopilot suite of advanced driver-assistance systems and the Full Self-Driving (FSD) function promised by the company for several years now.\n The study contains many other nuggets about Tesla and how it&#39;s viewed. Its youth as a company is of little concern, and in fact most respondents saw it as a positive. Because the company is fully committed to EVs, &#34;there&#39;s nothing close to it,&#34; said one participant.\n And Tesla&#39;s Apple-like “one-stop experience” proved a huge plus for owners. Its ability to manage all aspects of EV purchase and ownership—sales, financing, service, fast charging, and route planning that incorporates fast charging—were cited by an overwhelming 91 percent of owners as a reason to buy another Tesla. That, Dovorany suggested, is an ecosystem traditional makers will struggle mightily to replicate.\n  Finally, getting people behind the wheel of an EV was widely seen as the best single way to convince shoppers that the cars were real and could work for them. Many owners reported they became much more open to buying an EV after knowing friends, family, or co-workers who had one. That&#39;s exactly the  same conclusion reached by a recent J.D. Power study of how makers could sell more EVs. Colloquially, it&#39;s known in the industry as getting butts in seats.\n This content is imported from {embed-name}. You may be able to find the same content in another format, or you may be able to find more information, at their web site.\n    This content is created and maintained by a third party, and imported onto this page to help users provide their email addresses. You may be able to find more information about this and similar content at piano.io", "posttime": "2021-08-01 07:45:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "特斯拉,buy,电动汽车", "title": "人们为什么要买特斯拉？调查称不是因为埃隆马斯克", "title_en": "Why Do People Buy a Tesla? Not Because of Elon Musk, Survey Says", "transed": 1, "url": "https://www.caranddriver.com/news/a35797034/survey-tesla-buyers-not-musk-fans/", "via": "", "real_tags": ["特斯拉", "buy", "电动汽车"]}, {"category": "", "categoryclass": "", "imagename": "2527519c0a58d0eeaf6d88b378ba3f5d.jpg", "infoid": 1070922, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一项新的研究发现，智能手机游戏可能对那些为了逃避消极情绪和无聊感而玩游戏的玩家有害。滑铁卢大学的研究人员发现，无聊的“逃生者”——那些难以融入真实环境并保持注意力的人——可能会寻求“心流”，这是一种与意识丧失相关的活动中一种深度而轻松的专注状态时间和空间。 “我们发现，在日常生活中经常感到极度无聊的人报告说，他们玩智能手机游戏是为了逃避或减轻这些无聊的感觉，”研究主要作者、滑铁卢认知神经科学博士候选人香奈儿拉奇说。 “这种无聊&#39;修复&#39;的问题在于，他们在无聊时就会玩，并且最终会遇到与过度玩游戏相关的问题。 “在游戏过程中，玩家可能会获得最佳的唤醒、专注和注意力并减少单调感，但这种逃跑玩家强烈的游戏冲动可能会产生负面影响并导致游戏时间过长。”使用流行的智能手机游戏 Candy Crush，Larche 和 Dixon 让 60 名当前等级在 77 到 3307 之间的游戏参与者从太容易开始玩各种难度级别——这意味着缺乏技能挑战平衡、低流量和低唤醒——平衡，这更具挑战性，导致更大的流动、唤醒、更少的无聊和更强烈的继续游戏的冲动。这样做是为了确定玩家是否会选择继续玩一个挑战和技能平衡有利于流动的游戏，而不是一个会产生较少流动的更简单的游戏。他们的研究结果证实，通过使用 Candy Crush 等智能手机游戏来逃避无聊的人比非逃避型玩家更沉浸在游戏中。然而，当逃脱玩家发现这些游戏更有益于缓解无聊时，他们可能会更频繁地玩更长的时间。迪克森说：“那些玩逃脱游戏的人比其他玩家体验到更大的流动性和积极影响，这会形成玩电子游戏的循环，以提升抑郁情绪。” “这是不适应的，因为虽然它提升了你的情绪，但它也增加了你继续玩的冲动。玩太久可能会导致上瘾，并意味着用于其他更健康的追求的时间更少。这实际上会增加你的抑郁症。”\nLarche 表示，这些发现可能会鼓励游戏开发者考虑直接在他们的游戏中实施负责任的视频游戏工具。例如，有一个时间限制选项允许玩家指定他们希望玩多长时间，这对于容易出现问题逃生游戏的玩家很有帮助。", "note_en": "Smartphone gaming can be harmful to players who game to escape their negative mood and feelings of boredom, a new study has found.\n Researchers at the University of Waterloo found that bored “escape players”—those who have difficulty engaging with the real environment and sustaining attention—may seek “flow,” which is a deep and effortless state of concentration in an activity linked to loss of awareness of time and space.\n “We found that people who experience intense boredom frequently in everyday life reported playing smartphone games to escape or alleviate these feelings of boredom,” said Chanel Larche, study lead author and a PhD candidate in cognitive neuroscience at Waterloo. “The problem with this boredom ‘fix’ is that they end up playing whenever they are bored, and end up experiencing problems tied to excessive game play.\n “During gameplay, players may achieve optimal arousal, engaged focus and attention and a reduction in feelings of monotony, but this heightened urge-to-play among escape players can have negative consequences and lead to excessive time gaming.”\n  Using the popular smartphone game Candy Crush, Larche and Dixon had 60 participants with current level standings in the game between 77 and 3307 play at various difficulty levels from too easy—which meant there was a lack of skill-challenge balance, low flow and low arousal—to balanced, which was more challenging and that caused greater flow, arousal, less boredom and a stronger urge to continue gameplay. This was done to determine whether players would choose to continue playing a game where there was a balance of challenge and skill conducive to flow, rather than an easier game that would generate less flow.\n Their results confirmed that individuals who game to escape boredom by using smartphone games such as Candy Crush become more immersed in gameplay than non-escape players. However, when escape players find these games more rewarding as a relief from boredom, they may play more frequently and for longer periods.\n “Those who play to escape experience greater flow and positive effect than other players, which sets up a cycle of playing video games to elevate a depressed mood,” Dixon said. “This is maladaptive because, although it elevates your mood, it also increases your urge to keep playing. Playing too long may lead to addiction and means less time is available for other healthier pursuits. This can actually increase your depression.”\n Larche says these findings might encourage game developers to consider implementing responsible video gaming tools directly within their games. For example, having a time-limit option to allow players to specify how long they wish to play could be helpful for players susceptible to problematic escape play.", "posttime": "2021-08-01 06:45:01", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "游戏,手机,手机游戏,gaming", "title": "智能手机游戏可能对一些寻求缓解无聊的人有害", "title_en": "Smartphone gaming can be harmful for some seeking relief from boredom", "transed": 1, "url": "https://uwaterloo.ca/news/media/smartphone-gaming-can-be-harmful-some-seeking-relief-boredom", "via": "", "real_tags": ["游戏", "手机", "手机游戏", "gaming"]}, {"category": "", "categoryclass": "", "imagename": "787686889751ab13684e736407773689.jpg", "infoid": 1070921, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "本周早些时候，这款黑白高科技装置首次亮相，是为数不多的旨在简化东京奥运会的机器人之一。在周末的田径比赛中，它可以再次被看到——本质上是在玩取球。国际奥委会表示，自动驾驶机器人在追逐锤子、标枪和运动员投掷的各种物体时，能够确定要遵循的“最佳路径”。国际奥委会解释说：“这将有助于减少取回物品所需的时间和活动所需的人力支持。”其他由奥运会组织者和丰田合作设计并投入使用的机器人包括 Miraitowa 和 Someity。蓝色和粉红色的卡通机器人是东京奥运会和残奥会的官方吉祥物。他们本打算成为公众的未来派大使，作为握手和挥手的欢迎东道主，但在没有观众的活动中，他们的那部分工作已经严重减少。同样，人类和送货支持机器人看起来更像一个更高大的 Wall-e，也是为了让奥运会更舒适。他们通过运送食物和其他物品，引导人们到他们的座位，并提供赛事信息，为奥林匹克体育场的轮椅观众提供帮助。东京 2020 机器人项目负责人 Hirohisa Hirukawa 表示：“2020 年东京奥运会是我们展示日本机器人技术的独特机会。\n他补充说，该项目将展示此类机器的实用和现实优势。", "note_en": "The black-and-white high-tech contraption made its debut earlier this week as one of a handful of robots designed to streamline the Tokyo Olympic Games. And it can be seen again — essentially playing fetch — during the  track and field throwing events over the weekend.\n     The International Olympics Committee  says the self-driving robot is able to suss out the &#34;optimal path&#34; to follow when it&#39;s chasing after hammers, javelins and all manner of objects thrown by athletes.\n  &#34;This will help reduce both the amount of time needed to retrieve items and the amount of human support required at events,&#34; the IOC explained.\n    Other robots that have been designed and put to work in a partnership between the Games organizers and Toyota include Miraitowa and Someity. The blue and pink cartoon-looking robots are the official Tokyo Olympics and Paralympics mascots.\n  They were intended to serve as futuristic ambassadors to the public, as welcoming hosts who shake hands and wave, but that part of their job has been severely diminished during the spectator-free events.\n    Similarly, human and delivery support robots, which look like a fancier and taller Wall-e, were developed to make the Games more comfortable. They are providing assistance to spectators in wheelchairs at the Olympic Stadium by carrying food and other items, guiding people to their seats, and providing event information.\n     &#34;The Tokyo 2020 Games are a unique opportunity for us to display Japanese robot technology,&#34; said Hirohisa Hirukawa, leader of the Tokyo 2020 Robot Project.\n  He added that the project will showcase the practical and real-life benefits of such machines.", "posttime": "2021-08-01 06:44:43", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "机器人,奥运会,olympic", "title": "东京奥运会机器人", "title_en": "The Tokyo Olympic Robots", "transed": 1, "url": "https://www.npr.org/sections/tokyo-olympics-live-updates/2021/07/30/1022984439/say-hello-to-the-tokyo-olympic-robots", "via": "", "real_tags": ["机器人", "奥运会", "olympic"]}, {"category": "", "categoryclass": "", "imagename": "98e0145e202a294203ce2409659f4ee1.jpg", "infoid": 1070920, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Austin LeTourneau 给他妹妹打的最后一个电话是在 2020 年 5 月的一个星期三，就在冠状病毒大流行席卷全国之际。这位 19 岁的底特律本地人在使用 FaceTime 时正在 Tomball 租来的房间里。他为自己找工作的困难而焦虑，他想念在数百英里外的密歇根州的家人。当他讲述他的担忧时，他停下来吃了一颗药丸。他告诉她，为了他的神经，服用了 Xanax。没有必要解释。这种药物是抗焦虑药物的流行文化简写，就像施乐品牌之于复印机，或苹果之于电脑。但 LeTourneau 的药丸是赝品——后来尸检显示，其中含有致命的芬太尼。这名青少年是 2020 年哈里斯县因合成阿片类药物过量死亡的 291 人之一，是 2017 年死于该药物的 56 人的五倍多。中西部和东北部的社区正在蔓延到德克萨斯州。 2020 年，美国有超过 93,000 人死于药物过量，是机动车事故造成的死亡人数的两倍多。专家说，大约三分之二涉及阿片类药物，芬太尼正在为其中的许多药物提供动力。美国国家药物滥用研究所发布的数据显示，从 2012 年到 2019 年，合成阿片类药物（主要是芬太尼）增加了 14 倍，这是导致药物过量的主要驱动因素。 根据国家卫生统计中心的数据，合成阿片类药物占所有药物滥用的一半以上。 2019 年致命的过量服用。“当人们想到德克萨斯州的药物滥用问题时，他们不会想到阿片类药物，”休斯顿法医科学中心主席彼得·斯托特博士说。 “但是这里的东西，它在这里杀人。 ......这不是俄亥俄河谷的事情，这不是宾夕法尼亚州发生的事情。”\n但随着这场最新的毒品危机恶化，专家表示，州和地方卫生官员未能采取关键措施，使德州人免受芬太尼污染药物的风险。国家没有有效地跟踪过量死亡，因此不完全了解问题的范围。据专家称，它没有为预防或治疗提供足够的资金。它已将减少危害的策略定为刑事犯罪，例如提供干净的针头和试纸，让吸毒者知道何时用可能致命的芬太尼剂量切断了毒品。德克萨斯州立法者为该州的回应辩护，指出最近通过的立法将芬太尼的销售或交付定为犯罪，为药物滥用治疗、阿片类药物使用预防计划和增加获得药物辅助治疗的机会提供了数亿美元的预算。阿片类药物问题始于几十年前，随着 OxyContin 等处方药的推出。该药物的制造商 Purdue Pharma 向公众保证他们的新止痛药不会上瘾。多年后，死亡人数已超过 90 万人，普渡制药最近同意斥资超过 45 亿美元解决 15 个州就其在危机中的作用提起的诉讼。随着监管机构收紧对处方阿片类药物的获取，用户转向海洛因。然后，分销商开始用芬太尼（一种比海洛因强 50 倍的强效合成阿片类药物）来限制非法药物供应。它在医疗环境中用于治疗剧烈疼痛的患者。休斯顿的外展工作人员表示，他们在 2017 年开始看到芬太尼进入毒品供应——主要添加到海洛因中。芬太尼比海洛因便宜，而且更小、更轻、更容易走私，因此经销商和分销商将其切入其他毒品。它以粉末形式出售，放入喷雾剂或液体中，或制成看起来像其他处方药的药丸。根据国家药物滥用研究所的数据，1999 年全国只有 730 起致命的过量服用与芬太尼有关。在哈里斯县，当局在 2019 年追踪了 104 起与芬太尼相关的死亡事件。去年，这一数字几乎翻了两倍，达到 291 起。\n执法官员表示，他们看到走私到该国的芬太尼数量显着增加。根据该机构的记录，2019 年，在休斯顿野战分部开展工作的特工缉毒局缉获了约 50 公斤芬太尼。去年，这个数字增加到了 323 公斤。今年到目前为止，该机构已经缉获的不仅仅是合成粉末。它不包括执法部门发现的大量药丸或其他与药物相关的物质，例如假冒的 percocet、摇头丸和 Xanax 的药丸。 “每个人都感受到这种流行病，”美国缉毒局休斯顿地区的高级官员丹尼尔·科莫 (Daniel Comeaux) 说。 “这在每个街区都有。这在每所学校、每一个地区、每一个社区，不管你多富有，多穷。”北德克萨斯农村韧性组织的露西·萨基维茨 (Lucy Sakiewicz) 表示，在北德克萨斯，芬太尼几乎污染了合成药物供应的所有部分。对于 Sakiewicz 来说，危机是个人的。她与鸦片成瘾作斗争，她的丈夫在二月份因过量服用而去世。该组织分发了安全使用用品，包括针头、棉花、阿司匹林、止血带、洗手液和手套的工具包。 COVID-19 大流行使危机恶化，扰乱了许多吸毒者的既定常规，例如美沙酮诊所就诊、参加支持小组甚至与朋友出去玩。 “人们不得不停止与朋友一起使用，”德克萨斯大学药房成瘾研究和医学项目的项目协调员克莱尔·扎戈尔斯基说。 “不能有你的朋友在附近带走了人们的生命线。” LeTourneau 的母亲 Rebecca Zavala 认为，她的儿子在足球训练中跟腱撕裂后开始吸毒。\n经过两次手术才将其重新组装起来，LeTourneau 的医生在康复期间给他开了止痛药。 LeTourneau 几乎不是一个异常值。休斯敦纪事报对哈里斯县法医死亡数据的分析显示，过去几年这里有数百起药物过量死亡事件。受害者年龄从 8 岁到 73 岁不等。三分之一的受害者年龄在 27 至 35 岁之间。大多数（约 71%）是男性。现有数据显示，在许多情况下，受伤的地址——该人服药过量的地方——与死亡地址相同。像 LeTourneau 一样，这些人死在了自己的家中。有些人在中午刚过，有些人在下午 5 点就死了，有些人在黎明时分死去。有些人死在父母家中，独自一人在他们的房间里。获得有关全州范围内过量用药死亡和芬太尼作用的清晰准确的数据几乎是不可能的。德克萨斯州依赖当地县的过量信息，其中许多县不跟踪该信息。 “当你甚至不知道问题是什么时，你如何解决问题？”波士顿东北大学教授 Leo Beletsky 问道，他研究法律和警务对健康的影响。 “在德克萨斯州，你有这种人人为己的心态。”只有 15 个县（包括哈里斯县）通过体检医师或验尸官报告药物过量。在较小的县，治安法官处理死亡调查。很少有人接受过评估医学死因方面的培训，或者接受过可以表明死因的尸检的能力。结果，专家说，许多过量死亡没有被确定。这种失败与精心设置的用于跟踪其他公共卫生危险的报告系统形成鲜明对比，例如该州实时发布 COVID-19 数据。\n密切关注过量服用药物的 15 个县都有专业的体检医师或验尸官，他们经过培训并配备了调查过量服用致死事件的资源。他们确实拥有的数据包括一些令人担忧的统计数据。在埃尔帕索，今年与芬太尼相关的死亡人数是 2016 年死亡人数的四倍。特拉维斯县与芬太尼相关的死亡人数增加了近三倍。在北德克萨斯，塔兰特县的法医发现芬太尼导致了去年 97 人的死亡，是五年前的 10 倍多。大多数郊区和农村县依靠民选的治安法官，他们不需要接受医疗培训，也不需要进行验尸。甚至该州一些最大的县也不追踪毒品致死的原因。为了回应《纪事报》的记录要求，贝克萨县法医办公室的官员表示，他们没有追踪特定药物的死因。该机构没有回应额外评论的请求。三年前，德克萨斯州立法机关和公共卫生官员试图解决合成阿片类药物死亡人数上升的问题。时任众议院议长、共和党圣安东尼奥的乔·施特劳斯 (Joe Straus) 创建了阿片类药物和药物滥用问题众议院特别委员会，以寻找解决“德克萨斯州阿片类药物祸害”的方法。立法者制作了一份 108 页的报告，其中包含近 100 条建议，但未能就更具争议的项目采取行动。报告指出，缺乏资金是一项挑战，并指出“众所周知，服务和计划的增加通常需要增加资金，而资金是有限的，无论是联邦、州还是地方。”休斯顿大学爱好公共事务学院发布了一份类似的报告，其中包括建议该州改进过量数据的收集，增加可以开出丁丙诺啡（一种用于治疗阿片类药物使用障碍的药物）的提供者的数量，并建立试点芬太尼测试和注射器交换计划。立法机关已采取一些措施，例如允许急救人员分发纳洛酮，这是一种可以逆转过量服用的药物。立法者通过了州法律，重点关注处方滥用、成瘾妇女的新生儿和孕产妇健康以及公众意识运动。他们还要求州机构改进数据跟踪，并为执法机构创建拨款计划，以购买紧急过量治疗剂，如纳洛酮。该州卫生与公共服务委员会有针对性的阿片类药物反应主任 Kasey Strey 说，他们已将联邦资金用于提高认识运动、处方监测计划、增加药物辅助治疗和许多其他项目。\n“每个人都对拯救生命感兴趣，”斯特雷说。 “我们都可以承认，去年在全国和德克萨斯州，我们已经失去了很多人，因为过量服用。”一项将使大县的注射器交换计划合法化的法案从未被提交给州参议院委员会进行听证，因此它从未有机会通过 2021 年的会议。 “你可以把我算作那些说我们的法律是错误的批评者，”起草该法案的州众议员乔穆迪 (D-El Paso) 说。 “以刑事方式而不是医学方式治疗毒瘾从来没有奏效，也永远不会奏效，而采取整体医疗保健方法的司法管辖区一直取得成功。令我难以置信的是，我们年复一年地在这个注定失败的战略上浪费人们的生命和纳税人的钱。”州长格雷格·阿博特将芬太尼危机归咎于乔·拜登总统的移民政策。 “我们看到进入休斯敦、达拉斯、进入全州其他城市地区以及全国各地的芬太尼数量急剧增加的一个关键原因是芬太尼正在越过我们的边界，”他于 7 月 21 日在休斯顿举行的新闻发布会上说，以宣传一项新的州法律，将芬太尼的制造或交付定为刑事犯罪。 “我们正在以前所未有的方式打击芬太尼，”他说，在休斯敦犯罪阻止者签署仪式法案期间，他手上拿着一个黑色的 Sharpie。 “如果州长想防止药物过量，他应该寻求经过验证的公共卫生解决方案和基于科学的药物教育，”德克萨斯州减少危害联盟的 Cate Graziani 说。 “他应该使芬太尼试纸和提供药物检测的项目合法化，扩大获得药物辅助治疗的机会，并使纳洛酮更广泛地可用。”\n在州长的新闻发布会上，雅培没有回答纪事报关于他是否会支持分配芬太尼试纸或安全注射点的资金的问题。德克萨斯州参议员琼霍夫曼 (R-Houston) 撰写了 SB1827，立法机关于今年早些时候通过了该法案，以帮助解决阿片类药物危机。该法案指示国家使用从针对阿片类药物制造商的诉讼中赢得的资金来资助各种项目。她说，这笔钱应该用于预防阿片类药物使用障碍、增加纳洛酮分配、提供阿片类药物成瘾治疗培训、为青少年和成人提供阿片类药物使用障碍治疗的项目。霍夫曼说，这些资金还可以提供更好的药物辅助治疗机会，并减少成瘾性处方药的滥用。她说：“德克萨斯州立法机构正在加紧帮助德克萨斯人应对目前影响到每个社区的危机，无论其种族、财富或地点如何。” “我期待我的法案对德州人产生积极影响，并将在下届立法会议上监督他们的进展，如果需要，我们可以在那里进行调整以支持他们。”这些天来，萨瓦拉一直在努力追查向她儿子出售杀死他的药丸的女人。她最近才得知警方对这名女子发出了逮捕令。她试图在 5 月 28 日 LeTourneau 的侄女 Eliyanna 出生时感到安慰。这个女孩出生一年，LeTourneau 的尸体被空运回密歇根州的那一天。但她仍然记得 2020 年二月那天，她带着儿子去底特律大都会机场时的每一个细节。 LeTourneau 在高中的最后几年并不顺利。他告诉她他想重新开始。他梦想有一天当教练。他决定搬到德克萨斯州——和休斯顿。在机场，扎瓦拉哭了。她吻了她 19 岁的孩子，告诉他她有多爱他。他站在比她高半个头的地方，一个瘦削、结实的青少年，留着一头金色的头发，带着假笑。\n“我揉了揉他的脸，我告诉他他会没事的，”她说，“而且他正在做出一个正确的决定。”每天早上，即使在他搬到休斯顿之后，他也会打电话给 Adreanna，祝她在学校度过愉快的一天。每天下午，他都会再次打电话，听听这一天的情况。 “他总是确保每个人都没事，”扎瓦拉说。 “在他自己之前，他总是为其他人担心。”即将到来的星期一：那些在阿片类药物流行前线的人说，芬太尼使公共卫生危机变得更加紧迫。他们在减少伤害方面的努力——试图让吸毒者保持安全——资金不足，有时在德克萨斯州是非法的。 St. John &quot;Sinjin&quot; Barned-Smith 于 2014 年加入《休斯顿纪事报》，负责公共安全。 Sinjin 在费城开始了他的职业生涯，在巴拉圭的和平队工作了两年，在搬到德克萨斯州之前，曾在马里兰州的一家小报社工作。在 Twitter 上关注他或将提示发送至 st.john.smith@chron.com。", "note_en": "The last phone call Austin LeTourneau made to his sister came on a Wednesday in May 2020, just as the coronavirus pandemic ripped across the country.\n  The 19-year-old Detroit native was  in a rented room in Tomball when he FaceTimed. He was anxious about his struggles finding work, and he missed his family, hundreds of miles away in Michigan. As he recounted his worries, he paused to pop a pill. A Xanax, he told her, for his nerves.\n  No explanation was necessary. The pharmaceutical is pop culture shorthand for anti-anxiety medications, like what the Xerox brand was to copiers, or Apple to computers.\n  But LeTourneau’s pill was a counterfeit — laced with deadly fentanyl, an autopsy later showed.\n  The teen was one of 291 people to die from an overdose linked to the synthetic opioid in Harris County in 2020, more than five times as many as the 56 killed by the drug in 2017.\n  The growing toll is evidence that the flood of fentanyl devastating communities across the Midwest and Northeast is spilling into Texas. More than 93,000 people died from drug overdoses across the U.S. in 2020, more than twice as many deaths as caused by motor vehicle accidents. About two-thirds involved opioids, and fentanyl is fueling many of them, experts say. The National Institute on Drug Abuse released data showing a 14-fold increase in synthetic opioids — mainly fentanyl — as the main driver of overdoses from 2012 to 2019. According to the  National Center for Health Statistics, synthetic opioids accounted for more than half of all fatal overdoses in 2019.\n  “People don’t think of opioids, when they think of drug abuse problems in Texas,” said Houston Forensic Science Center President Dr. Peter Stout. “But this stuff here, it’s killing people here. … This isn’t off in Ohio Valley, this isn’t something that’s happened in Pennsylvania.”\n   But as this newest drug crisis worsens, experts say state and local health officials are failing to take key steps that could save Texans in the grips of addiction  from the risk of fentanyl-tainted drugs. The state doesn’t effectively track overdose deaths and consequently doesn’t fully know the scope of the problem. It does not provide adequate funding for prevention or treatment, according to experts. It has criminalized harm reduction strategies such as providing clean needles and test strips that allow drug users to know when drugs have been cut with potentially lethal doses of fentanyl.\n  Texas lawmakers defended the state’s response, pointing to recent legislation passed that criminalizes the sale or delivery of fentanyl, budgeted hundreds of millions of dollars for substance abuse treatment, opioid use prevention programs and increased access to medication assisted treatment.\n      The opioid problem started decades ago, with the introduction of prescription drugs like OxyContin. The makers of the drug, Purdue Pharma, reassured the public that their new painkiller wasn’t addictive. Years later, the death toll has surpassed  900,000, and Purdue Pharma recently agreed to spend more than $4.5 billion to settle lawsuits brought by 15 states over its role in the crisis.\n  As regulators tightened access to prescription opioids, users turned to heroin. Then, distributors began lacing the illicit drug supply with fentanyl — a powerful synthetic opioid 50 times stronger than heroin. It is used in medical settings to treat patients with severe pain.\n   Outreach workers in Houston say they began seeing fentanyl enter the drug supply — mainly added to heroin — in 2017. Fentanyl is cheaper than heroin, and it’s smaller, lighter and easier to smuggle, so dealers and distributors cut it into other drugs. It is sold as a powder, put into sprays or liquids, or made into pills that look like other prescription drugs.\n  Just 730 fatal overdoses across the country were linked to fentanyl in 1999, according to the National Institute on Drug Abuse.\n  In Harris County, authorities tracked 104 fentanyl-related deaths in 2019. Last year, that number had nearly tripled, to 291.\n  Law enforcement officials said they’ve seen a marked rise in the amount of fentanyl being smuggled into the country. In 2019, special agents Drug Enforcement Administration operating within the Houston Field Division seized about 50 kilograms of fentanyl, according to the agency’s records. Last year, that number had grown to 323 kilograms.\n  So far, this year, the agency has already seized more than that in synthetic powder alone. It doesn’t include the slew of pills or other substances that law enforcement have found cut with the drug, such as counterfeit pressed pills of percocet, ecstasy and, in Austin’s case, Xanax.\n  “Everybody feels this epidemic,” said Daniel Comeaux, the DEA’s top official in the Houston area. “This is in every neighborhood. This is in every school, this is in every area, every community, it doesn’t matter how rich you are, or how poor you are.”\n  In North Texas, fentanyl has tainted almost every part of the supply of synthetic drugs, said Lucy Sakiewicz, with North Texas Rural Resilience. For Sakiewicz, the crisis is personal. She struggled with an addiction to opiates, and her husband died in February from an overdose. The group passes out safe-use supplies, kits that include needles, cotton, aspirin, tourniquets, hand sanitizer and gloves.\n   The COVID-19 pandemic worsened the crisis, disrupting established routines of many drug users, such as methadone clinic visits, attending support groups or even hanging out with friends.\n  “People had to stop using with their friends,” said Claire Zagorski, program coordinator for the pharmacy addiction research and medicine program at the University of Texas. “ Not being able to have your friends nearby took away a lifeline for people.”\n    LeTourneau’s mother, Rebecca Zavala, believes her son began using drugs after he tore his achilles tendon during football practice.\n  It took two surgeries to put it back together, and LeTourneau’s doctors prescribed him painkillers during the recovery.\n  LeTourneau was hardly an outlier. A Houston Chronicle analysis of death data from the Harris County Medical Examiner shows hundreds of overdose deaths here over the last few years. Victims ranged from 8 to 73 years old. A third of the victims were between the ages of 27 and 35. Most — about 71 percent — were male.\n  The data available shows that in many cases, the address of injury — the place where the person overdosed — is the same as the address of death. Like LeTourneau, these people died in their homes. Some died right after noon, some at 5 p.m., some at dawn. Some died at their parents’ home, alone in their room.\n       Getting clear and accurate data about statewide overdose deaths and the role of fentanyl is almost impossible. Texas relies on overdose information from local counties, many of which do not track that information.\n  “How do you address a problem when you don’t even know what the problem is?” asked Leo Beletsky, a professor at Northeastern University in Boston who studies the health impact of laws and policing. “In Texas, you have this everyone-for-themselves mentality.”\n  Just 15 counties — including Harris County — report overdoses through medical examiners or coroners. In the smaller counties justices of the peace handle death inquests. Few have any training in assessing medical causes of death, or the ability to conduct autopsies that would indicate a cause of death. As a result, experts say, many overdose deaths aren’t identified.\n  That failure stands in sharp contrast to the elaborate reporting systems setup to track other public health dangers, such as the state’s real-time release of COVID-19 data.\n  The 15 counties that keep tabs on overdoses have professional medical examiners or coroners who are trained and equipped with resources to investigate overdose deaths. The data they do have includes some worrying statistics. In El Paso, fentanyl-related deaths this year are quadruple the number of people who died in 2016. Travis County has seen fentanyl-related deaths nearly triple. In North Texas, Tarrant County medical examiners found fentanyl contributed to 97 of last year’s deaths, more than 10 times as many as five years ago.\n  Most suburban and rural counties rely on elected justices of the peace, who are not required to have medical training, or to conduct post-mortems. Even some of the biggest counties in the state do not track causes of deaths by drugs. In response to a records request from the Chronicle, officials from the Bexar County Medical Examiner’s Office said they do not track causes of death by specific drug. The agency did not respond to requests for additional comment.\n      Three years ago, the Texas Legislature and public health officials tried to address the rise in synthetic opioid deaths. Joe Straus, R-San Antonio, the then-House Speaker, created the House Select Committee on Opioids and Substance Abuse to find ways to tackle the “scourge of opioids in Texas.”\n  Lawmakers produced a  108-page report with nearly 100 recommendations but failed to act on the more controversial items. The report suggested lack of funding was one challenge, noting that “as all are aware, an increase in services and programs typically requires increased funding, and funds are limited, whether federal, state, or local.”\n  The Hobby School of Public Affairs at the University of Houston produced a similar report, which included recommendations that the state improve collection of overdose data, increase the number of providers who can prescribe buprenorphine — a medicine used to treat opioid use disorder — and establish pilot programs for fentanyl testing and syringe exchanges.\n  The Legislature has taken some steps, such as allowing first responders to dispense naloxone, a drug which can reverse overdoses.\n  Legislators have passed state laws focused on prescription abuse, newborn and maternal health for addicted women and public awareness campaigns. They also asked state agencies to improve data tracking and created grant programs for law enforcement agencies to purchase doses of emergency overdose treatments, like naloxone. They have used federal funding for awareness campaigns, prescription surveillance programs, increases in medication assisted treatment and numerous other projects, said Kasey Strey, director of targeted opioid response at the state’s Health and Human Services Commission.\n  “Everybody’s interested in saving lives,” Strey said. “We can all acknowledge that we have lost many, many people to overdose this last year, across the country and in Texas.”\n  A bill that would have legalized syringe exchange programs in large counties was never referred to the state Senate committee for a hearing so it never had a chance of passing the 2021 session.\n  “You can count me among those critics who say our laws are wrongheaded,” said state Rep. Joe Moody, D-El Paso, who authored the bill. “Treating drug addiction criminally rather than medically has never worked and will never work, period, whereas jurisdictions that take a holistic healthcare approach have consistently succeeded. It’s incredible to me that we keep throwing people’s lives and taxpayers’ dollars away year after year on this doomed strategy.”\n  Gov. Greg Abbott has blamed the fentanyl crisis on President Joe Biden’s immigration policies.\n  “One key reason why we’re seeing such a dramatic increase in the amount of fentanyl coming to Houston, coming to Dallas, coming to other urban areas across the state — as well as going across the country — is because of the massive amount of fentanyl that is coming across our border,” he said on July 21, at a press conference in Houston to tout a new state law criminalizing the manufacture or delivery of fentanyl.\n  “We are cracking down on fentanyl in an unprecedented way,” he said, flourishing a black Sharpie during the ceremonial bill signing at Crime Stoppers of Houston.\n      “If the governor wants to prevent overdoses, he should look to proven public health solutions and drug education based in science,” said Cate Graziani, with Texas Harm Reduction Alliance. “He should legalize fentanyl test strips and programs that offer drug testing, expand access to medication-assisted treatment and make naloxone more widely available.”\n  At the governor’s news conference, Abbott did not answer questions from the Chronicle about whether he would support funding for distribution of fentanyl test strips  or safe injection sites.\n  Texas Sen. Joan Huffman, R-Houston,  authored SB1827, which the Legislature passed earlier this year, to help address the opioid crisis. The bill directs the state to use funds won from lawsuits against opioid manufacturers to fund a variety of programs. She said the money should be used for programs that prevent opioid use disorder, increase naloxone distribution, provide training on opioid addiction treatment, provide opioid use disorder treatment for youths and adults. The funds could also provide better access to medication-assisted treatment and reduce the abuse of addictive prescription medications, Huffman said.\n  “The Texas Legislature is stepping up to help Texans deal with a crisis that is currently affecting every community, regardless of race, wealth, or location,” she said. “I look forward to the positive impact my bills will have for Texans and will monitor their progress into the next legislative session, where we can make tweaks to bolster them, if needed.”\n      These days, Zavala has spent her time trying to track down the woman who sold her son the pills that killed him. She just recently learned police put out a warrant for the woman’s arrest. And she tries to take comfort in the birth of Eliyanna, LeTourneau’s niece, on May 28. The girl was born a year to the day that LeTourneau’s body was flown back to Michigan.\n  But she still remembers every detail of the February day in 2020 when she took her son to the Detroit Metro Airport.\n  LeTourneau’s last few years in high school had been rocky. He’d told her he wanted to start over. He dreamed of coaching some day. He decided he’d wanted to move to Texas — and Houston.\n  At the airport, Zavala cried. She gave her 19-year-old a kiss and told him how much she loved him. He’d stood half a head taller than her, a lean, wiry teen, with a mop of blond hair and a smirking smile.\n  “I rubbed his face, and I told him he was going to be OK,” she said, “and that he was making a good decision.”\n    Every morning, even after he’d moved to Houston, he called Adreanna to wish her a good day at school. Every afternoon, he would call again, to hear how the day had gone.\n  “He always made sure everybody was OK,” Zavala said. “He was always worried for everybody else before himself.”\n     COMING MONDAY: Those on the front lines of the opioid epidemic say fentanyl has made a public health crisis even more urgent. Their efforts at harm reduction - trying to keep people who use drugs safe - are not well funded and are sometimes illegal in Texas.\n St. John &#34;Sinjin&#34; Barned-Smith joined the Houston Chronicle in 2014 and covers public safety. Sinjin started his career in Philadelphia, spent two years in Paraguay in the Peace Corps, and prior to moving to Texas, worked at a small paper in Maryland. Follow him on  Twitter or email tips to  st.john.smith@chron.com.", "posttime": "2021-08-01 06:44:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人数,deaths,药物", "title": "德克萨斯州芬太尼死亡人数飙升，官员们并未采取关键措施来阻止他们", "title_en": "Fentanyl deaths soaring in Texas, officials aren't taking key steps to stop them", "transed": 1, "url": "https://www.houstonchronicle.com/news/houston-texas/houston/article/fentanyl-deaths-soaring-texas-key-steps-16349531.php", "via": "", "real_tags": ["人数", "deaths", "药物"]}, {"category": "", "categoryclass": "", "imagename": "7dac814a6d9113819709a4d799dabd2e.jpg", "infoid": 1070919, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "从某种意义上说，世界因新冠病毒而走运。一个偶然的机会，科学家们刚好花了数年时间研究冠状病毒，一旦病毒的基因序列一公布，就准确地开发出制造 Covid 疫苗所需的工具。但是，如果下一次大流行来自引起拉沙热的病毒，或者来自苏丹埃博拉病毒株，或者来自尼帕病毒，将会发生什么？美国国家过敏和传染病研究所所长 Anthony S. Fauci 博士正在推动一项雄心勃勃且昂贵的计划，为此类噩梦情景做好准备。他说，这将每年花费“数十亿美元”，需要五年时间才能获得第一批成果，并需要大量科学家参与。这个想法是制造“原型”疫苗，以防止来自大约 20 个可能引发新流行病的病毒家族的病毒。使用对 Covid-19 证明是成功的研究工具，研究人员将揭示每种病毒的分子结构，了解抗体必须攻击它的位置，以及如何刺激身体准确地制造这些抗体。福奇博士说：“如果我们获得资金，我相信我们会获得资金，那么它可能会在 2022 年开始，”他补充说，他一直在“与白宫和其他人讨论”这一想法。美国国立卫生研究院院长弗朗西斯·柯林斯博士也认为可能会分配必要的资金，称该项目“引人注目”。 “当我们开始考虑成功结束 Covid-19 大流行时，我们绝不能重新自满，”柯林斯博士说。\n大部分资金支持将来自福奇博士的研究所，但这种规模的项目需要额外的资金，而这些资金必须由国会分配。今年传染病研究所的预算略高于 60 亿美元。福奇博士没有具体说明需要多少额外资金。如果监控网络检测到一种新病毒从动物传染给人类，那么按照逻辑，科学家们可以通过快速制造原型疫苗对爆发中的人进行免疫来阻止它。如果病毒在世界意识到正在发生的事情之前传播，原型疫苗可以更广泛地部署。 “游戏的名称是试图限制对疫情的溢出，”斯克里普斯研究所疫苗研究员兼免疫学和微生物学系主任丹尼斯伯顿博士说。原型疫苗项目是美国国家过敏和传染病研究所疫苗研究中心副主任 Barney Graham 博士的创意。他于 2017 年 2 月在研究所主任的私人会议上提出了这个想法。年复一年，病毒威胁要变成大流行病，格雷厄姆博士说：2009 年的 H1N1 猪流感，2012 年的基孔肯雅热，2013 年的 MERS，2014 年的埃博拉病毒，2016 年的寨卡病毒。每次科学家都争先恐后地试图制造疫苗.他们唯一的成功是部分成功，埃博拉疫苗有助于控制疫情，但对其他埃博拉病毒株无效。在疫苗可以制造或测试之前，其他流行病已经减弱。但是研究人员在过去十年中开发了新工具，可以产生很大的不同。他们允许科学家查看病毒的分子结构，分离阻断病毒的抗体并找出它们结合的位置。结果是能够为更精确地针对病原体的新疫苗进行“基于结构的设计”。当他在 2017 年听到 Graham 博士的演讲时，Fauci 博士受到了启发。福奇博士说：“这让我和执行委员会的其他人感到非常可行。”\n格雷厄姆博士于 2018 年在《自然免疫学》杂志上发表了一篇综述论文，概述了该提议。但没有威胁性大流行的紧迫性，他的想法仍然如此。该研究所疫苗研究中心主任约翰马斯科拉博士说，过敏和传染病研究所为 20 个病毒家族中的每一个都创建了一个电子表格，显示了对每种病原体的解剖结构和脆弱性的了解。学院和大学。 400 多所学院和大学要求学生接种 Covid-19 疫苗。几乎所有人都在投票支持拜登总统的州。医院和医疗中心。许多医院和主要卫生系统都要求员工接种 Covid-19 疫苗，理由是 Delta 变体导致病例数不断增加，而且他们所在社区的疫苗接种率一直很低，甚至在他们的劳动力中也是如此。在纽约市，市政医院和卫生诊所的工作人员将被要求每周接种疫苗或接受检测。您的雇主可以要求接种疫苗吗？根据美国政府最近的指导，公司可以要求进入工作场所的工人接种冠状病毒疫苗。 “对于每个病毒家族，我们处于不同的知识和疫苗开发状态，”马斯科拉博士说。例如，拉沙热和尼帕病毒的疫苗还处于早期阶段。基孔肯雅热和寨卡病毒的疫苗进一步开发。填补疫苗开发空白的工作将通过对学术科学家的研究资助来完成。杜克人类疫苗研究所所长巴顿海恩斯博士说，学术研究人员“有很多热情”。尽管该提案在公众中并不为人所知，但福奇博士表示，他已经在与科学观众的谈话中讨论过。\n福奇博士说，该计划还将与制药公司建立合作协议，以快速生产原型疫苗。这就是 Covid-19 的镜头所发生的情况。 SARS 和 MERS 的流行促使科学家们研究冠状病毒疫苗。这导致人们发现冠状病毒使用刺突蛋白来感染细胞，但刺突很容易改变形状，需要保持在一个位置才能用作疫苗。研究人员发现，这可以通过刺突蛋白的微小分子变化来实现。在新型冠状病毒的序列发表几天后，科学家们设计了疫苗来对抗它。福奇博士说，这就是大流行准备可以做的事情。他希望在工作的头五年内为 20 个病毒家族中的 10 个开发原型疫苗。 “这将需要相当大的资金，”福奇博士承认。 “但在我们经历过这些之后，这并不是不可能的。”", "note_en": "In one sense, the world got lucky with the new coronavirus. By sheer chance, scientists just happened to have spent years studying coronaviruses, developing exactly the tools needed to make Covid vaccines as soon as the virus’s genetic sequence was published.\n But what will happen if the next pandemic comes from a virus that causes Lassa fever, or from the Sudan strain of Ebola, or from a Nipah virus?\n Dr. Anthony S. Fauci, director of the National Institute of Allergy and Infectious Diseases, is promoting an ambitious and expensive plan to prepare for such nightmare scenarios. It would cost “a few billion dollars” a year, take five years for the first crop of results and engage a huge cadre of scientists, he said.\n The idea is to make “prototype” vaccines to protect against viruses from about 20 families that might spark a new pandemic. Using research tools that proved successful for Covid-19, researchers would uncover the molecular structure of each virus, learn where antibodies must strike it, and how to prod the body into making exactly those antibodies.\n “If we get the funding, which I believe we will, it likely will start in 2022,” Dr. Fauci said, adding that he has been promoting the idea “in discussions with the White House and others.”\n Dr. Francis Collins, director of the National Institutes of Health, also thought it likely that the necessary funds would be allocated, calling the project “compelling.”\n “As we begin to contemplate a successful end to the Covid-19 pandemic, we must not shift back into complacency,” Dr. Collins said.\n Much of the financial support would come from Dr. Fauci’s institute, but a project of this scope would require additional funds that would have to be allocated by Congress. This year’s budget for the infectious diseases institute is a little over $6 billion. Dr. Fauci did not specify how much additional money would be needed.\n If surveillance networks detected a new virus spilling over from animals into people, the logic goes, scientists could stop it by immunizing people in the outbreak by quickly manufacturing the prototype vaccine. And if the virus spread before the world realized what was happening, the prototype vaccines could be deployed more widely.\n “The name of the game would be to try and restrict spillovers to outbreaks,” said Dr. Dennis Burton, a vaccine researcher and chairman of the department of immunology and microbiology at Scripps Research Institute.\n  The prototype vaccines project is the brainchild of Dr. Barney Graham, deputy director of the Vaccine Research Center at the National Institute of Allergy and Infectious Diseases. He presented the idea in February of 2017 at a private meeting of institute directors.\n Year after year, viruses had threatened to turn into pandemics, Dr. Graham said: the H1N1 swine flu in 2009, Chikungunya in 2012, MERS in 2013, Ebola in 2014, Zika in 2016. Each time scientists scrambled to try to make a vaccine. Their only success was a partial one, with an Ebola vaccine that helped control the epidemic but would not work against other Ebola strains. The other epidemics waned before the vaccines could be made or tested.\n   But researchers had new tools developed over the past decade that could make a big difference. They allowed scientists to view molecular structures of viruses, isolate antibodies that block the viruses and find out where they bind. The result was an ability to do “structure-based design” for new vaccines that target the pathogen more precisely.\n When he heard Dr. Graham’s pitch in 2017, Dr. Fauci was inspired. “It struck me and others in the executive committee as something that is really doable,” Dr. Fauci said.\n Dr. Graham published a  review paper outlining the proposal in Nature Immunology in 2018. But without the urgency of a threatening pandemic, his idea remained just that.\n The allergy and infectious diseases institute has created a spreadsheet for each of the 20 virus families showing what is known about each pathogen’s anatomy and vulnerabilities, said Dr. John Mascola, director of the Vaccine Research Center at the institute.\n College and universities. More than 400 colleges and universities are requiring students to be vaccinated for Covid-19.  Almost all are in states that voted for President Biden.\n Hospitals and medical centers.  Many hospitals and major health systems are requiring employees to get the Covid-19 vaccine, citing rising caseloads fueled by the Delta variant and stubbornly low vaccination rates in their communities, even within their work force. In N.Y.C.,  workers in city-run hospitals and health clinics will be required to get vaccinated or else get tested on a weekly basis.\n Can your employer require a vaccine?  Companies can require workers entering the workplace to be vaccinated against the coronavirus, according to recent U.S. government guidance.\n “For each virus family we are in a different state of knowledge and vaccine development,” Dr. Mascola said. Vaccines for Lassa fever and Nipah virus, for example, are in early stages. Vaccines for Chikungunya and Zika are further along.\n The work to fill in the gaps in vaccine development would be done with research grants to academic scientists. “There is a lot of enthusiasm” among academic researchers, said Dr. Barton Haynes, director of the Duke Human Vaccine Institute. Although the proposal is not well known among the general public, Dr. Fauci said he has discussed it in talks to scientific audiences.\n The program would also establish collaborative agreements with pharmaceutical companies to produce prototype vaccines quickly, Dr. Fauci said.\n That is what happened with the shots for Covid-19. The SARS and MERS epidemics led scientists to work on a coronavirus vaccine. That led to the discovery that coronaviruses use a spike protein to infect cells, but the spike changes shape readily and needs to be held in one position to be useful as a vaccine. That could be done, researchers discovered, with tiny molecular changes in the spike protein.\n Days after the new coronavirus’s sequence was published, scientists had designed vaccines to fight it.\n That, Dr. Fauci said, is what pandemic preparedness can do. He’d like to have prototype vaccines for 10 out of the 20 virus families in the first five years of work.\n “It would require pretty large sums of money,” Dr. Fauci acknowledged. “But after what we’ve been through, it’s not out of the question.”", "posttime": "2021-08-01 06:43:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "流行,vaccines,疫苗", "title": "福奇希望在下一次大流行爆发之前为下一次大流行制造疫苗", "title_en": "Fauci wants to make vaccines for the next pandemic before it hits", "transed": 1, "url": "https://www.nytimes.com/2021/07/25/health/fauci-prototype-vaccines.html", "via": "", "real_tags": ["流行", "vaccines", "疫苗"]}, {"category": "", "categoryclass": "", "imagename": "3da5f2cb02348b0a31b7fbfa4eab69b8.jpg", "infoid": 1070918, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在欧空局与卫星运营商 Eutelsat 和主要制造商空中客车公司合作开发的合作项目下，Eutelsat Quantum 开创了欧洲航天工业的新一代卫星。这颗灵活的软件定义卫星将于 7 月 30 日从位于法属圭亚那的欧洲航天港发射升空，该卫星将由政府以及移动和数据市场使用。此后它已到达地球上空约 36 000 公里的地球静止轨道，在那里成功完成了航天器系统检查。由于卫星可以在轨道上重新编程，因此它可以在其生命周期内响应不断变化的需求。它的光束可以重新定向以几乎实时移动，为移动的船舶、飞机、卡车、卡车和其他陆基交通工具上的乘客提供信息。当需求激增时，还可以轻松调整光束以提供更多数据。卫星可以检测和表征任何恶意发射，使其能够动态响应意外干扰或故意干扰。该卫星将在地球静止轨道上运行 15 年，之后将安全地放置在远离地球的墓地轨道上，以避免对其他卫星构成威胁。\nEutelsat Quantum 是英国的旗舰项目，大部分卫星由英国工业开发和制造。空中客车公司是主要承包商，负责建造卫星的创新有效载荷，而萨里卫星技术有限公司制造了新平台。创新的相控阵天线由西班牙的空中客车公司开发。英国科学大臣阿曼达·索洛韦 (Amanda Solloway) 表示：“通过投资像这样的开创性国际项目，我们正在帮助英国企业将科幻小说转化为商业优势，从而创造就业、增长和创新。这项改变游戏规则的技术将确保英国继续在电信卫星方面领先世界，并进一步支持我们不断发展的航天部门。” ESA 电信和集成应用总监 Elodie Viau 说：“我很自豪地见证了 Eutelsat Quantum 的成功发射，这是 ESA 合作项目的成果。 ESA 在英国以及整个欧洲和加拿大促进航天工业的创新，使其能够在竞争激烈的全球电信市场中取得成功。投资太空可以在地球上创造就业机会和繁荣。”萨里卫星技术有限公司 (SSTL) 项目总监 Ben Stocker 表示：“EutelSat Quantum 计划为 SSTL 在卫星平台内的卫星系统设计、机械设计、推进系统和关键子系统的开发过程中提出了许多需要克服的挑战. “通过成功克服这些挑战获得的技能和知识使我们能够改进我们的工程方法，特别是对于系统可靠性和可用性是关键要求的市场和应用，并且在英国航天局和欧空局的持续支持下，我们处于非常有利的地位，可以完成我们即将到来的令人兴奋的探路者任务。”", "note_en": "Developed under an ESA Partnership Project with satellite operator Eutelsat and prime manufacturer Airbus,  Eutelsat Quantum has pioneered a new generation of satellites with the European space industry.\n The flexible software-defined satellite – which will be used by governments and in mobility and data markets – was launched on board an Ariane 5 on 30 July from Europe’s Spaceport in French Guiana.\n  It has since reached geostationary orbit some 36 000 km above Earth, where the spacecraft systems checkout was successfully completed.\n Because the satellite can be reprogrammed in orbit, it can respond to changing demands during its lifetime.\n Its beams can be redirected to move in almost real time to provide information to passengers on board moving ships, planes, trucks, lorries and other land-based transport. The beams also can be easily adjusted to deliver more data when demand surges.\n The satellite can detect and characterise any rogue emissions, enabling it to respond dynamically to accidental interference or intentional jamming.\n The satellite will remain in geostationary orbit for its 15-year lifespan, after which it will be safely placed in a graveyard orbit away from Earth to avoid becoming a risk to other satellites.\n Eutelsat Quantum is a UK flagship project with most of the satellite developed and manufactured by British industry. Airbus is the prime contractor and was responsible for building the satellite’s innovative payload, while Surrey Satellite Technology Ltd manufactured the new platform. The innovative phase array antenna was developed by Airbus in Spain.\n  UK Science Minister Amanda Solloway said: “By investing in ground-breaking international projects like this one, we are helping UK businesses transform science fiction into commercial advantage, resulting in jobs, growth and innovation. This game-changing technology will ensure the UK continues to lead the world on telecommunications satellites and further bolster our growing space sector.”\n Elodie Viau, ESA’s Director of Telecommunications and Integrated Applications, said: “I am proud to witness the successful launch of Eutelsat Quantum, which is the result of an ESA Partnership Project. ESA fosters innovation in the space industry in the UK and across Europe and Canada, enabling it to succeed in the highly competitive global telecommunications markets. Investing in space creates jobs and prosperity on Earth.”\n Ben Stocker, Director of Projects at Surrey Satellite Technology Ltd (SSTL), said: “The EutelSat Quantum programme presented many challenges for SSTL to overcome during the development of the satellite system design, mechanical design, propulsion system and key subsystems within the satellite platform.\n “The skills and knowledge gained through successfully overcoming these challenges has enabled us to refine our engineering approach, especially for markets and applications where system reliability and availability are key requirements, and, with the continued support of the UK Space Agency and ESA, has put us in a very strong position to deliver our exciting upcoming pathfinder missions.”", "posttime": "2021-08-01 06:43:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,satellite,卫星", "title": "发射了可重新编程的卫星", "title_en": "Reprogrammable Satellite Launched", "transed": 1, "url": "https://www.esa.int/Applications/Telecommunications_Integrated_Applications/Reprogrammable_satellite_launched", "via": "", "real_tags": ["编程", "satellite", "卫星"]}, {"category": "", "categoryclass": "", "imagename": "0432114c6d982945b682a59f770c6faf.jpg", "infoid": 1070916, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "新的！每个客户限制 2 选择您的存储大小。车辆 我们认为您会喜欢它，但如果您不满意，您可以将其退回以获得全额退款。需要使用汽车线束将逗号 3 开发套件连接到您的车辆。您当前没有选择汽车线束。现有的汽车线束是兼容的。逗号三 devkit 不随任何软件一起提供。拥有设备后，您将能够安装您选择的任何软件，风险自负。介绍逗号三 devkit。逗号三是第 4 代定制硬件，旨在安装在您的汽车中。它具有双凸轮 360° 视野，加上一个狭窄的凸轮，可以发现远处的物体。三款 1080p 摄像头具有 120 dB 的动态范围，比领先的电动汽车制造商领先两代。它就像手机一样连接，具有 WiFi、LTE 和更好的高精度 GPS。逗号 3 包括 3 个月的免费逗号 Prime（必须在购买后 30 天内激活）。要领取免费素数，请登录逗号连接。配对后，您可以查看记录的驱动器、设置导航目的地等。逗号三没有预装能够控制您的汽车的软件。开源软件可以单独安装。如果由于任何原因您对在comma.ai 商店购买的任何商品不满意，请在 30 天内将其寄回以获得全额退款。美国一周内免运费，国际统一费率 30 美元。订单在周一和周四完成（并在第二天取货）。美国运送是通过 USPS 运送，包括周六运送。我们目前不提供加急运输。买方负责与购买相关的任何海关费用和关税。针对硬件缺陷的 1 年有限保修。如果您上游支持不受支持的汽车，我们将延长您的退货窗口。购买后发送电子邮件至 support@comma.ai 了解详情。", "note_en": "NEW! LIMIT 2 PER CUSTOMER   Choose your storage size. Vehicle\n We think you’ll love it, but if you’re not satisfied, you can send it back for a  full refund.\n A car harness is required to connect the comma three devkit to your vehicle. You currently have no car harness selected.  Existing car harnesses are compatible.\n The comma three devkit does not ship with any software. Once you have the device you will be able to install any software you choose at your own risk.\n Introducting the comma three devkit. The comma three is 4th generation custom hardware designed to live in your car. It has dual cam 360° vision, plus a narrow cam to spot objects far off in the distance. The three 1080p cameras have 120 dB of dynamic range, two generations ahead of a leading electric car maker. It&#39;s as connected as a cell phone, with WiFi, LTE, and way better high precision GPS.  comma three includes 3 free months of  comma prime (must be activated within 30 days of purchase). To claim your free prime, log into  comma connect. Once paired, you can see your recorded drives, set navigation destinations, and more.  The comma three does not ship preloaded with software capable of controlling your car. Open source software can be installed separately.\n    If for any reason you are dissatisfied with anything purchased at the comma.ai shop, ship it back within 30 days for a full refund. Free US shipping in a week, $30 flat rate internationally. Orders are fulfilled on Monday and Thursday (and picked up the following day). U.S. shipping is via USPS and includes Saturday delivery. We do not currently offer expedited shipping. Buyer is responsible for any customs fees and duties associated with purchase. 1-year limited warranty against hardware defects. If you upstream support for an unsupported car, we will extend your return window. Email support@comma.ai after purchase for details.", "posttime": "2021-08-01 05:47:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "开发,逗号,comma", "title": "逗号三开发包", "title_en": "Comma Three Devkit", "transed": 1, "url": "https://comma.ai/shop/products/three", "via": "", "real_tags": ["开发", "逗号", "comma"]}, {"category": "", "categoryclass": "", "imagename": "5dac971c1aa941fecf98d05e528b5528.jpg", "infoid": 1070915, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "最近，当我把几堆书（31本书）从地板上移到地板上的另一个地方为我的办公椅腾出空间时，我经历了一个清晰的时刻，我觉得我已经到了狂躁期的结尾并正在面对后果。众所周知，囤积者会描述看似微不足道的碎屑——一个旧杯子、一张泛黄的报纸、一把牙刷——对他们来说是如此有意义，以至于他们不可能被扔掉。我也有能力证明我的每一本堆积如山的书的存在是合理的。有托马斯伯恩哈德的收集证据。在朋友的推荐下购买，从某个时候开始，搁置不是因为不好而是因为悄悄篡夺，知道有一天我会骑着自行车回到年轻的托马斯身边。篡位者？哈维尔·玛丽亚斯 (Javier Marías) 的《明天的脸：发烧和矛》。我想在玛丽亚斯泡一会儿，但显然时间不够。接下来是伊迪丝·格罗斯曼 (Edith Grossman) 对唐吉诃德 (Don Quixote) 的翻译，正在等待与我读过的唯一一本《托拜厄斯·斯莫利特 (Tobias Smollett)》进行比较。与堆栈和世纪相邻的崔斯特瑞姆·香迪，半成品，等待合适的心情来袭。 Shonagon 的 The Pillow Book，未破解——灵感来自 Suzanne Buffam 的 A Pillow Book。 Bergman 的 The Magic Lantern，刚刚开始，我拿起它是因为 Dorthe Nors 在某处提到过它，然后是她的故事集 Wild Swims... ，各种计算机编程指南，不止一本关于写作的方法书，过多的美女信件，期刊，朋友的书，也许是最病态和代表性最好的类别，我不得不购买的书的各种迭代神奇地解决了我目前正在从事的任何项目中的问题。我已经购买了所有这些书，无法抗拒在我当地独立公司 Diesel 书店的前台上的封套副本，或者在阅读了来自 Adam Moody 等特别引人入胜的推文后通过电话订购在网上找到了一些关于二手书商的脚注参考，或者通过 bookshop.org 将它点击到我家，或者——我为瘾君子的耻辱低下了头——不耐烦地从魔鬼那里买了它。至少有一堆从沙发上移了出来，这是我正在计划的课程的一组标题。但是其他人呢？我环顾四周。他们无处可去——我的茶几（56 个标题）或站立式办公桌两侧的柜台（49 个标题）上没有空间，没有放置相机或计算机设备的几个架子已经满了（27 个标题）标题）。巢穴已经人满为患（超过 1,000），即使在多次尝试扑杀为新来者腾出空间之后也是如此。在我们的卧室里，我的床头柜堆栈（41 个，溢出的 23 个）曾经在晚上因为我睡觉的手臂肌肉痉挛而翻倒，吵醒了我的妻子，她认为这是地震。目睹大量未读书籍的外部观察者可能会将其视为某种书目狂热的后果，但事实是，当我单独检查每一本书时，我真的觉得这只是时间问题打开它并开始——或者，更有可能，继续——阅读它。\n我试图停下来，试图强迫自己一次只读一本书。它只奏效了一次——这本书是战争与和平——然后我又回到了我的旧习惯，在叙述中进进出出，把书从一个房间带到另一个房间，到处都在我身后留下书堆。对于朋友，我开玩笑说我在五十本书的中间。对自己来说，我假装我决定把它们都当作一本大书来读。救恩来了，就像它经常做的那样，以一个词的形式出现：Tsundoku，日语的意思是买书，让它们堆积在房子周围未读的倾向。当我偶然发现它时，我感觉好像有人跨过太平洋来和我握手。 Tsundoku 起源于明治时代，源自 tsunde-oku（让事情堆积起来）和 dokusho（读书）的组合。它也可以指堆栈本身。至关重要的是，它没有贬义，更像是书呆子而不是不可救药的懒汉。与其因为新购买的东西，或没有为我已经拥有的书腾出足够的书架空间，或任何其他贪婪的书籍收购罪而责备自己，我告诉自己我正在“练习 tsundoku”。 “那不是一堆，它是一个 tsundoku，”我对我的妻子说，这个神奇的词把一堆东西从消极的联想中解脱出来，变成了我看着它时看到的东西，一座潜在的阅读体验之塔。知道还有像我一样的其他人，我们已经在这里和地球的另一边已经存在很长时间了，这是一种安慰和摇摇欲坠的姐妹们。在房子周围随意放置标题并不是一团糟，而是一个偶然重新发现的邀请。单个桩的看似随机性并不是混乱，而是具有启发性的并置的潜在生成器。最近，我一直在享受 tsundoku 提供的一种特殊乐趣：从书堆中间拉出一本书，阅读一个章节、一个故事或一个段落，然后将其放回顶部，很快就会出现发现自己被另一本书覆盖——可能是新买的——等待我再次发现它的那一天，解放它，打开它继续我离开的地方。", "note_en": "Recently, while moving several piles of books (31 titles) from the floor to another place on the floor to make space for my office chair, I experienced a moment of clarity during which I felt like I had arrived at the end of a manic episode and was confronting the aftermath.\n Hoarders have been known to describe how seemingly insignificant detritus—an old cup, a yellowed newspaper, a toothbrush—are so meaningful to them that they couldn’t possibly be thrown away.\n I, too, was capable of justifying the presence of each of my individual piled up volumes. There was Thomas Bernhard’s  Gathering Evidence. Purchased on the recommendation of a friend, begun at some point, set aside not because not good but because quietly usurped, knowing that someday I would get back to young Thomas on his bicycle. The usurper? Javier Marías’s  Your Face Tomorrow: Fever and Spear. I wanted to soak in Marías for a little while, but apparently not long enough to finish. Next, Edith Grossman’s translation of  Don Quixote, awaiting comparison to the only other one I’d read, Tobias Smollett’s. And adjacent in stack and century,  Tristram Shandy, half-finished, waiting for the right mood to strike. Shonagon’s  The Pillow Book, uncracked—a purchase inspired by Suzanne Buffam’s  A Pillow Book. Bergman’s  The Magic Lantern, just begun, which I picked up because Dorthe Nors mentioned it somewhere, and, below that, her story collection  Wild Swims…\n  Other stacks contained more yet-to-be read novels by authors I loved, books bought for research, various computer programming guides, more than one how-to book on writing, an excess of  belles lettres, journals, books by friends, and, perhaps the most pathological and well-represented category, various iterations of  the book I had to buy to magically solve the problems in whatever project I was currently working on.\n  I’d purchased all of these books, having been unable to resist jacket copy at the front table of my local indie,  Diesel Bookstore, or having ordered from them over the phone after reading a particularly fetching tweet from, say, Adam Moody, or having tracked down some footnoted reference to a used book seller online, or having clicked it to my house via  bookshop.org, or—I hang my head in junkie shame—having impatiently Bought It Now from the devil himself.\n    At least one pile had migrated from the sofa, a group of titles at-hand for a class I was planning. But the others? I looked around. There was nowhere left for them to go—no space left on my end table (56 titles) or on the counter on either side of my standing desk (49 titles), and the few shelves not holding cameras or computer equipment were full (27 titles). The den was overflowing already (over 1,000), even after repeated attempts at culling to make space for new arrivals. In our bedroom, my nightstand stack (41, with an overflow pile of 23) had once toppled in the night thanks to a myoclonic jerk of my sleeping arm, waking my wife, who thought it was an earthquake.\n An outside observer bearing witness to this largely unread accumulation of books might have seen it as the fallout of a kind of bibliomania, but the truth was that when I examined each volume individually, I genuinely felt that it was only a matter of time before I cracked it open and started—or, more likely, resumed—reading it.\n I had tried to stop, had tried to force myself to read only one book at a time. It worked exactly once—the book was  War and Peace—and then I was back to my old habits of dipping in and out of narratives, carrying books from room to room, leaving stacks behind me everywhere. To friends, I joked that I was in the middle of fifty books. To myself, I pretended that I’d decided to read them all as one big book.\n  Salvation came, as it often does, in the form of a word:  Tsundoku, Japanese for the tendency to buy books and let them pile up around the house unread. When I stumbled across it, I felt as if someone had reached across the Pacific to shake my hand.\n Tsundoku dates from the Meiji era, and derives from a combination of  tsunde-oku (to let things pile up) and  dokusho (to read books). It can also refer to the stacks themselves. Crucially, it doesn’t carry a pejorative connotation, being more akin to  bookworm than  irredeemable slob.\n  Instead of castigating myself over new purchases, or for not clearing enough shelf space for the books I already have, or for any other venal book-acquiring sin, I tell myself that I’m “practicing  tsundoku.”\n  “That’s not a pile, it’s a  tsundoku,” I say to my wife, the magic word transforming the stack into something unshackled from negative associations, into what I see when I look at it, a tower of potential reading experiences.\n It’s a comfort knowing that there are others out there like me, that we have been around for a long time, here and on the other side of the planet, fellow impulse-purchasers, novel half-abandoners, aspirational-title-acquirers—brothers and sisters of the teetering stack. That the haphazard placement of titles around the house is not a mess, but an invitation to serendipitous rediscovery. That the seeming randomness of individual piles is not disorganization, but a potential generator of illuminating juxtapositions.\n  Lately, I’ve been taking delight in a specific pleasure afforded by  tsundoku: Pulling a book out from the middle of a stack, reading a single chapter, or a story, or a passage, and replacing it on top, where it will soon find itself covered by another book—probably newly purchased—to await the day I discover it again, liberate it, and crack it open to continue where I left off.", "posttime": "2021-08-01 05:47:08", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "停止,tsundoku", "title": "Tsundoku 的乐趣：我如何学会停止担心和爱书堆", "title_en": "The Pleasures of Tsundoku: How I Learned to Stop Worrying and Love Book Piles", "transed": 1, "url": "https://lithub.com/the-pleasures-of-tsundoku-or-how-i-learned-to-stop-worrying-and-love-book-piles/", "via": "", "real_tags": ["停止", "tsundoku"]}, {"category": "", "categoryclass": "", "imagename": "6665a127565e64006f802b18a8e80033.png", "infoid": 1070914, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "项目状态：截至 0.8.0（参见 github 版本），相当安全和可用，但没有完善的 UX 或所有计划功能。 1.0.0 之前的版本应被视为 alpha/beta 质量。输入延迟感觉很高，因为重绘屏幕很慢（以及所有加密，这也很慢） 接收大量数据可能会中断通道或导致锁定（例如 cat /dev/zero） 需要 mbedtls、libssh2 和 libvterm ，有关详细信息，请参阅我的（cy384&#39;s）这些库的端口。请注意，您需要为两个平台（m68k 和 PPC）分别构建/安装。要构建胖二进制文件，请使用 Retro68 构建的路径编辑 build-ssheven.bash，然后运行它。", "note_en": "Project status: as of 0.8.0 ( see github releases), fairly secure and usable, but without a polished UX or all planned features. Versions prior to 1.0.0 should be considered alpha/beta quality.\n          input latency feels high because redrawing the screen is slow (along with all the encryption, which is also slow)\n receiving a large amount of data may break the channel or cause lockups (e.g.  cat /dev/zero)\n     Requires mbedtls, libssh2, and libvterm, see my (cy384&#39;s) ports of those libraries for details. Note that you need to build/install each for both platforms (m68k and PPC).\n To build a fat binary, edit  build-ssheven.bash with the path to your Retro68 build, and then run it.", "posttime": "2021-08-01 05:46:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ssheven,构建", "title": "Cy384/ssheven：适用于 Mac OS 7/8/9 的现代 SSH 客户端", "title_en": "Cy384/ssheven: A modern SSH client for Mac OS 7/8/9", "transed": 1, "url": "https://github.com/cy384/ssheven", "via": "", "real_tags": ["ssheven", "构建"]}, {"category": "", "categoryclass": "", "imagename": "eedd28775dfa13bcb042f0dd4061c09e.jpeg", "infoid": 1070913, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "On the Clock 是 Motherboard 对有组织的劳工运动、零工工作、自动化和工作的未来的报告。加利福尼亚州特雷西距旧金山内陆一小时车程。如果您是旧金山湾区的亚马逊客户，您的包裹很可能会通过特雷西的亚马逊仓库工人的手。去年 10 月的一天，亚马逊位于特雷西的六个配送中心之一的 OAK4 的 23 岁包装工帕蒂·埃尔南德斯突然有想上厕所的冲动。她冲过仓库来到浴室隔间，发现裤子里有血。埃尔南德斯当时怀孕七周。几周前，埃尔南德斯一再恳求她的经理和仓库的人力资源部门减轻工作量，并向亚马逊人力资源部门提交了一份医生证明，要求提供怀孕住宿。这张纸条是由 Motherboard 获得的，上面写着不能提、推、拉或携带超过 20 磅的重量，并且在超过 50% 的轮班时间里不能走路或站立。作为一名包装工，亚马逊仓库中最后一个在包裹被装上卡车之前处理亚马逊包裹的人，Hernandez 的工作是每 10 小时轮班从传送带上抬起装满重达 50 磅商品的黄色垃圾箱。有些垃圾桶比其他垃圾桶重，里面装满了能量饮料、洗发水瓶和狗粮。据埃尔南德斯说，亚马逊的人力资源部门否认了埃尔南德斯的医生证明，他说否认是由人力资源代表口头传达的。 “[HR] 只是告诉我，没有特定区域可以进行不需要超过 15 磅举重的轻量工作，或者让我站起来，”她说。\n疾控中心表示，反复提重物、长时间站立、反复弯腰会增加孕妇流产的几率。埃尔南德斯说，在被拒绝承担较轻的职责后，她的经理知道她怀孕了，一再问她为什么要花更长的时间去洗手间，坐着，走得更慢。 “我的经理并不乐于助人，”埃尔南德斯告诉主板。 “他问我，&#39;为什么你的费率这么低，为什么你在浴室里花这么多时间，为什么你的 [休息时间] 超过十分钟？&#39; “我们每天只有10分钟的休息时间，但仓库太大了，去洗手间和回来需要6分钟。” “休假时间”是亚马逊用来衡量工作效率和纪律的指标——通过跟踪员工在他们的工作站扫描包裹的频率。 Hernandez 说，OAK4 每天给她分配 10 分钟的空闲时间，并且必须保持扫描仪跟踪的高生产率。 Hernandez 发现她在流血后，她通知她的经理她有紧急医疗情况，可能会流产，然后回家了。根据 Motherboard 审查的一封信，她要求请病假，但遭到拒绝，该信函显示亚马逊拒绝了她的《家庭和医疗休假法案》请求，因为她没有工作足够的时间。日期为 2020 年 10 月 26 日的信件称：“根据联邦家庭和医疗休假法，您没有资格休假，因为您在过去 12 个月内没有工作 1,250 小时。您工作了大约 841.57 小时。”亚马逊发言人 Rena Lunak 表示，亚马逊正在调查情况。 “我们与每位亚马逊员工单独合作，以确保他们拥有保持健康所需的一切，”Lunak 说，“我们很高兴每天为我们运营中的数千名员工提供支持和医疗住宿。”\n那个星期，埃尔南德斯继续流血——她说，类似于重度月经——并留在家里休息。埃尔南德斯说，亚马逊从未回应过加州怀孕残疾和病假的两项待决请求，因此她从亚马逊辞职，因为她知道自己的个人时间已经用完了。一周后，她的护士通过超声波确认埃尔南德斯不再怀孕。 “我去看医生，他们检测不到心跳，”她说。她的未婚夫通过主板证实了她的故事的细节。 “这一切都让我非常情绪化。我从没想过这会发生在我身上。我每天都会哭，”埃尔南德斯说。亚马逊在拖延和拒绝提供各种残疾住宿方面有着良好的记录——包括减轻怀孕仓库工人的负担——这与其臭名昭著的高流动率商业模式（每年大约 150%）相吻合。 2011 年至 2019 年间，至少有七起针对亚马逊的怀孕歧视诉讼。工人声称该公司未能满足诸如更频繁地上厕所和减少连续站立时间等要求，然后解雇了他们。 2019 年，亚马逊凤凰城的仓库工人给杰夫·贝索斯 (Jeff Bezos) 写了一封信，称怀孕的工人已收到亚马逊发出的“请假”的最终警告。去年，Motherboard 报道称，亚马逊未能在俄克拉荷马城的一个仓库迅速容纳四名怀孕的工人——这迫使工人冒着流产、无家可归和被驱逐的风险。根据联邦法律，包括亚马逊在内的公司拒绝怀孕工人承担较轻的职责通常是合法的。 1978 年的《怀孕歧视法》规定，雇主只有在已经为“在工作能力或无能力方面相似”的其他员工提供便利的情况下，才必须为怀孕员工提供便利。在加利福尼亚州，怀孕住宿法律比其他州更严格。加利福尼亚州法律特别要求拥有超过五名雇员的雇主为怀孕雇员提供合理的便利——包括改变工作职责或工作时间——除非他们能证明“过度困难......对其运营”。加利福尼亚大学戴维斯医学中心专门研究生殖健康的教授詹妮弗·卡林告诉 Motherboard，无法知道在亚马逊工作是否导致埃尔南德斯流产，但持续的职业压力和夜班会增加流产的风险，据报道医学文献。 Hernandez 偶尔在亚马逊上夜班以获得额外收入。\n您有关于亚马逊孕期住宿的提示要与我们分享吗？请通过电子邮件 lauren.gurley@vice.com 或 Signal 201-897-2109 与记者 Lauren Gurley 取得联系。 “虽然这并不能证明因果关系，但为怀孕的人提供减轻压力的方法而不是在他们的生活中制造更多压力是合理的，以便为健康怀孕提供最佳可能性，”卡林博士说。 “这名工人被置于艰难险阻之间。要么你没有得到报酬，所以你不能养活自己和你的家人，要么你来工作并把怀孕置于危险之中。”根据美国流行病学杂志 2013 年的一项研究，大约 10% 到 15% 的怀孕以流产告终。大多数流产发生在孕早期。 2020 年 4 月，也就是大流行发生几周后，埃尔南德斯签约在特雷西的亚马逊仓库工作，因为她的家人关闭了她工作的墨西哥餐厅和他们拥有的几辆炸玉米饼卡车。当大多数地方都关门时，亚马逊正在迅速招聘——它在埃尔南德斯的社区中享有盛誉。 “我主要知道积极的一面，”她说。 “我有两个表兄弟在那里工作。他们说这很有趣。你每周工作四天。他们认为这里是工作的地方。在我看来，我觉得不管你做什么，他们都不关心你”正在经历。很难流产，因为他们不想容纳你。”", "note_en": "On the Clock is Motherboard&#39;s reporting on the organized labor movement, gig work, automation, and the future of work.\n  Tracy, California is an hour drive inland from the San Francisco. If you&#39;re an Amazon customer in the San Francisco Bay Area, chances are your packages pass through the hands of an Amazon warehouse worker in Tracy.\n  One day last October, Patty Hernandez, a 23-year-old packer at OAK4, one of Amazon&#39;s six fulfillment centers in Tracy, felt the sudden urge to go to the bathroom. She dashed across the warehouse to a bathroom stall, and discovered blood in her pants.\n    Hernandez was seven weeks pregnant at the time. In the weeks before, Hernandez had pleaded repeatedly with her manager and the warehouse&#39;s human resources for lighter duty, and submitted a doctor&#39;s note to Amazon&#39;s human resources requesting pregnancy accommodations. The note, which was obtained by Motherboard, said no lifting, pushing, pulling, or carrying more than 20 pounds, and no walking or standing for more than 50 percent of her shift.\n  As a packer, the last person in an Amazon warehouse to handle Amazon packages before they&#39;re loaded onto trucks, Hernandez&#39; job was to lift yellow bins filled with merchandise that weighed up to 50 pounds off conveyor belts on 10-hour shifts.\n  Some bins were heavier than others and were filled with cases of energy drinks, shampoo bottles, and dog food.\n  Amazon&#39;s human resources denied Hernandez&#39;s doctor&#39;s note, according to Hernandez who said the denial was communicated verbally by a human resources rep. &#34;[HR] just told me there was no specific area for light work that wouldn&#39;t require over 15 pounds of lifting, or for me to be off my feet,&#34; she said.\n  The Center for Disease Control says that  repeated heavy lifting, standing on your feet for long hours, and repeated bending at the waist can increase the chance of miscarriage for pregnant workers.\n  After being denied lighter duty, Hernandez said her manager, who knew she was pregnant, repeatedly asked why she was taking longer bathroom breaks, sitting, and moving slower.\n    &#34;My manager wasn’t accommodating,&#34; Hernandez told Motherboard. &#34;He was on me, asking, &#39;Why is your rate so low, why are you spending so much time in the bathroom, why is your [time off task] more than ten minutes?&#39; We were only allowed 10 minutes of time off task each day, but the warehouse is so big. It takes six minutes just to get to the bathroom and back.&#34;\n  &#39;Time off task&#39; is a  metric that Amazon uses to measure productivity and  discipline workers—by tracking how often its workers scan packages at their workstation. Hernandez said she was allotted 10 minutes of time off task per day OAK4, and had to maintain high productivity rates tracked by her scanner.\n  After Hernandez discovered she was bleeding, she notified her manager that she was having a medical emergency and could be miscarrying, and went home. She asked for medical leave, which was denied, according to a letter reviewed by Motherboard showing that Amazon had denied her request for Family and Medical Leave Act leave because she hadn&#39;t worked enough hours.\n  &#34;You are not eligible for leave under the federal Family and Medical Leave Act because you have not worked 1,250 hours in the previous 12 months. You have worked approximately 841.57 hours,&#34; the letter dated October 26, 2020, states.\n    Rena Lunak, an Amazon spokesperson, said Amazon is looking into the situation. &#34;We partner with each Amazon employee on an individual basis to ensure they have what they need to stay healthy,” Lunak said. “We gladly offer support and medical accommodations to thousands of employees across our operations daily.&#34;\n  That week, Hernandez continued to bleed—similar to a heavy period, she said—and stayed home to rest.  Amazon never responded to two pending requests for California Pregnancy Disability and a medical leave of absence, Hernandez said, and so she resigned from Amazon, knowing that she had run out of personal time off.\n  A week later, her nurse confirmed using an ultrasound that Hernandez was no longer pregnant. &#34;I went to the doctor and they couldn&#39;t detect a heartbeat,&#34; she said. Her fiancé confirmed the details of her story with Motherboard.\n  &#34;It all took a very emotional toll on me. I never imagined this would happen to me. I would cry every day,&#34; Hernandez said.\n  Amazon has a well-documented track record of delaying and denying all sorts of disability accommodations—including lighter duty for pregnant warehouse workers—which squares with its notoriously high turnover business model ( roughly 150 percent per year). Between 2011 and 2019, at least seven pregnancy discrimination lawsuits were filed against Amazon. Workers alleged that the company failed to accommodate requests such as more frequent bathroom breaks and fewer continuous hours standing and then fired them. In 2019, Amazon warehouse workers in Phoenix wrote a letter to Jeff Bezos that said that pregnant workers  had received final warnings from Amazon for &#34;time off task.&#34; Last year, Motherboard reported that  Amazon failed to quickly accommodate four pregnant workers at a warehouse in Oklahoma City—forcing workers to risk miscarriage, homelessness, and eviction.\n    Under federal law, it is often legal for companies, including Amazon, to deny pregnant workers lighter duty. The Pregnancy Discrimination Act of 1978 says that an employer has to accommodate pregnant employees only if it is already doing so for other employees who are &#34;similar in their ability or inability to work.&#34;\n  In California, pregnancy accommodation laws are stronger than other states. California laws specifically require that employers with over five employees provide reasonable accommodations for pregnant employees—including changing job duties or work hours—unless they can prove “undue hardship…to its operation.”\n  Jennifer Karlin, a professor at the University of California Davis Medical Center who specializes in reproductive health, told Motherboard that it is impossible to know whether working at Amazon caused Hernandez to miscarry, but persistent occupational stress and night shifts increase risk for miscarriage, according to medical literature. Hernandez occasionally worked night shifts at Amazon for extra income.\n Do you have tip to share with us about pregnancy accommodations at Amazon? Please get in touch with Lauren Gurley, the reporter, via email lauren.gurley@vice.com or on Signal 201-897-2109.\n  &#34;While this does not prove causality, it is reasonable to offer ways to decrease stress for individuals who are pregnant rather than create more stress in their lives in order to provide the best possibility for a healthy pregnancy,&#34; Dr. Karlin said. &#34;This worker was put between a rock and a hard place. Either you don’t get paid, so you can’t feed yourself and your family, or you come to work and put your pregnancy at risk.&#34;\n  Approximately, 10 to 15 percent of pregnancies end in miscarriage, according to  a 2013 study in the  American Journal of Epidemiology. The majority of those miscarriages occur in the first trimester.\n  In April 2020, a few weeks into the pandemic, Hernandez signed up to work at the Amazon warehouse in Tracy, because her family closed the Mexican restaurant and a few taco trucks they owned, where she worked.\n  Amazon was rapidly hiring when most places were shutting down—and it had a good reputation in Hernandez&#39; community. &#34;I was mostly aware of the positives,&#34; she said. &#34;I had two cousins working there. They said it’s so fun. You work four days a week. They made it sound like  the place to work. In my perspective, I feel like they don’t care about you no matter what you’re going through. It’s very hard to miscarry because they don’t want to accommodate you.&#34;", "posttime": "2021-08-01 05:46:23", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "amazon,亚马逊,员工,denied", "title": "亚马逊拒绝为员工提供怀孕住宿", "title_en": "Amazon Denied a Worker Pregnancy Accommodations", "transed": 1, "url": "https://www.vice.com/en/article/g5g8eq/amazon-denied-a-worker-pregnancy-accommodations-then-she-miscarried", "via": "", "real_tags": ["amazon", "亚马逊", "员工", "denied"]}, {"category": "", "categoryclass": "", "imagename": "26782739fdbf80a0ef0c7f0c9e13aa70.jpg", "infoid": 1070911, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一个阳光明媚的星期天早上，Natick 的居民大卫施泰纳正在他的车库里推杆，当一个遛狗的邻居对他喊道：“嘿，你的栅栏被贴上了标签。” Steiner 和他的妻子 Ina 在家里发布了一个关于电子商务行业的新闻网站，他认为他的邻居一定是在开玩笑——谁会在他们安静、绿树成荫的街道上涂鸦他的新白色乙烯基围栏？那是 2019 年 6 月，他不知道故意破坏只是由该国领先的互联网公司 eBay 的高级管理人员指挥的一场奇怪的骚扰活动的开始。最终，这些事件将打破 Steiners 平静的郊区生活，导致 6 名 eBay 员工和一名承包商受到刑事指控，其中 5 人已认罪，并导致 eBay 首席执行官离职。虐待最终导致这对夫妇担心他们的生命安全，因为他们在自己的邻居中被一辆缓慢移动的黑色面包车的身份不明的肇事者跟踪。但那个星期天，施泰纳只是惊讶和沮丧地看到他的栅栏上喷着“Fidomaster”这个词。在外出划桨的伊娜回家之前，他试图清理烂摊子，但他失败了。 Ina 意识到这个名字与他们时事通讯上的一位匿名评论者相匹配，该评论者对 eBay 尤其持批评态度。 “这非常令人不安，”伊娜在本周接受《环球报》采访时回忆道。 “这没有任何意义。”是 Fidomaster 的人在栅栏上画了他们的名字吗？还是有人指责 Steiners 是 Fidomaster？或者这个词还有其他含义吗？ “我马上用谷歌搜索，看看这是否是孩子们可能会说的话，”伊娜说。\n在他们第一次接受新闻媒体采访时，这对夫妇在罗斯玛丽·斯卡皮奇奥律师的办公室与《环球报》交谈了几个小时，罗斯玛丽·斯卡皮奇奥代表他们对 eBay 提起民事诉讼。除了在法庭文件中披露的内容之外，他们还提供了更多令人痛心的经历，其中包括 eBay 员工的电子邮件和短信副本，联邦检察官称这些副本显示了他们如何密谋恐吓斯坦纳家族。这对夫妇于 1980 年代中期在马萨诸塞州西部相遇，当时称为北亚当斯州立学院，现在称为马萨诸塞文理学院。这两个年轻的学生在一次聚会上认识了大卫的一位乐队成员，他即将离开，并立即感受到了联系并开始约会。他们于 1988 年结婚。大约 1999 年，当 eBay 还是一家年轻的公司，万维网还不是今天这样精心调整的商业市场时，大卫决定在拍卖网站上出售他的一些视频设备。这对夫妇还开始在车库销售和庭院销售中寻找可以在网上出售以赚钱的收藏品。 “我们会早起，浏览分类广告，购买您的 Dunkin&#39; Donuts 咖啡，并尽可能多地销售，”Ina 说。他们很快意识到，越来越多志同道合的卖家正在努力弄清楚如何最好地拍卖他们的物品。 Steiners 最初创建了一份包含提示和技巧的纸质时事通讯，以帮助其他卖家，但在一期之后意识到在线出版物更有意义，即使在 1999 年也是如此。 因此诞生了 AuctionBytes，后来改为 EcommerceBytes，并运行基于广告的出版物是这对夫妇的全职工作。多年来，该出版物蓬勃发展。特别是当 eBay 由 Meg Whitman 经营时，小卖家蓬勃发展，EcommerceBytes 提供了各种有用的建议。有一次，David 向读者解释了他如何使用 Greyhound 巴士而不是典型的包裹递送服务运送大件物品，从而节省了数百美元。在惠特曼于 2007 年离开并由前贝恩公司顾问约翰多纳霍取代后，eBay 开始迎合更大的卖家和老牌零售商，这种趋势在 2015 年德文维尼格被提升为首席执行官时继续。这对夫妇将他们的时事通讯从报告更多有关公司不断变化的战略和新政策的操作技巧。他们对新 eBay 的看法通常（尽管并非完全如此）具有批判性。该公司的批评并不顺利。检察官表示，从围栏喷漆事件开始的骚扰活动是由负责 eBay 全球安全和弹性部门的詹姆斯·鲍尔 (James Baugh) 指挥的。与该计划的其他参与者一起，Baugh 去年被指控串谋进行网络跟踪和串谋篡改证人。他正在等待审判。\n检察官表示，2019 年的竞选活动是由 eBay 首席执行官维尼格 (Wenig) 对其高级副总裁兼通讯总监史蒂夫·怀默 (Steve Wymer) 对 EcommerceBytes 文章的投诉引发的。根据联邦刑事诉讼，怀默反过来向鲍尔抱怨，鲍尔指示为他工作的 eBay 员工团队反对施泰纳家族。引起 eBay 高管愤怒的文章包括有关 CEO 薪水的报道以及他对保护电子卖家免受欺诈的评论。检察官透露了有关 2019 年 4 月 10 日的愤怒短信，文章标题为“eBay CEO Devin Wenig 的收入是员工的 152 倍”，以及“eBay CEO 说卖家可以期待更大的保护”，自 2019 年 5 月 31 日起。此类文章产生读者评论高度批评该公司的领导地位及其对待小卖家的方式，这些小卖家觉得自己落后于大零售商。从施泰纳夫妇的角度来看，涂鸦之后的几周内并没有发生太多事情。但在 2019 年 8 月 8 日，他们发现他们的收件箱里塞满了数十封他们没有注册的电子邮件通讯，从希瑟的肠易激综合症新闻和撒旦神庙到更令人不安的色情和束缚。她说，与此同时，一个新的 Twitter 帐户开始用充满咒骂的嘲讽轰炸 Ina Steiner。她说，她有时不得不处理网站上的不当评论。 “如果你已经上网一段时间了，你就会知道你不喂巨魔，不回应，不鼓励他们。”两天后，电话响了。这是亚利桑那州的一家动物标本剥制和动物零件商店，打电话询问据称是为了一头胎猪的 Steiners 订单。 Steiners 的送货地址与订单上使用的信用卡上的帐单地址不符，因此商店打电话再次检查订单。动摇了，施泰纳夫妇取消了订单。 “我想，我们开始吧，从网络到现实世界，”伊娜说。 “那真是太可怕了。”他们说，这对夫妇决定打电话给 Natick 警方，一名警官到他们家报案。当警官离开房子时，他注意到前门旁边有一个包裹。就在大卫和警官继续说话的时候，伊娜在厨房打开了包裹。看到一些头发和皮肤，她尖叫起来。里面是一张血淋淋的猪脸面具，就像《电锯惊魂》系列中疯狂杀手戴的面具一样。该官员在他的报告中添加了详细信息。\n这对夫妇说，Twitter 滥用行为继续升级，甚至出现了更奇怪的送货。有一天，大卫为大卫写了一本书，名为“悲伤日记：失去配偶的幸存”。 Ina 说她在谷歌上搜索了另一个包裹的返回地址，当她发现发件人名为 Carolina Biological Supply Co. 时，她担心他们可能需要致电危险品小组。致电该公司后发现，包裹里装满了活蜘蛛和苍蝇幼虫。他们把它交给了警察。几天后，一位花店来了，为大卫送去慰问花圈。司机告诉 Steiners 他来自剑桥的中央广场，并被指示将 255 美元的花圈放在他们的后门，没有按铃。伊娜拍了一张照片，为警方提供了更多证据，并向送货员汇报了情况。 “所有这些小零售商，他们都被武器化来对付我们，”大卫说。 8 月 15 日，竞选活动发生了更黑暗的转折。根据联邦文件，史泰纳夫妇不知道，一群 Baugh 的员工已经飞往波士顿，租了两辆车，并入住了丽思卡尔顿酒店。他们最初计划在 Steiners 的汽车上安装一个跟踪装置。文件称，幸运的是，丰田 Rav4 被锁在车库里，eBay 团队撤回了酒店。但第二天团队又回来了。大卫施泰纳正在梯子上安装他购买的几个新安全摄像头中的一个，而伊娜从二楼的窗户递给他工具。突然，伊娜看到一辆深色的道奇大篷车驶上他们的街道。 “黑色面包车，纽约车牌，”当车辆驶过时，她告诉大卫。面包车又从房子旁边经过，这对夫妇的其中一个安全摄像头捕捉到了这一点。然后，当天晚些时候，大卫注意到当他和一个朋友在他的车里时，同一辆面包车跟着他。 “我仍然能感觉到我脖子后面的每一根头发都竖起来了，”大卫说，面包车跟着他走了几个街区。\n施泰纳夫妇再次报了警，这一次三艘巡洋舰冲进了他们的房子。但他们无法取下面包车的整个车牌号，警方也无法追踪到这辆车。当警察四处闲逛时，“我只是坐在台阶上，大汗淋漓，感觉我的心在怦怦直跳，”大卫说。 “一切都消失了，这是超现实的，”伊娜补充道。 “我吓坏了。”考虑到他们可能会受到人身攻击，这对夫妇决定睡在不同的房间。伊娜在她的后门放了一辆洗衣车，上面放着几张烤盘。 “我们没有完整的警报系统，”她说。 “如果有人闯入，这至少可以警告我们。”那天晚上，大卫在凌晨 4:30 左右醒来，压力太大而无法入睡。他听到一辆汽车缓缓驶上街道。一辆黑色轿车停在他们家门前。当一名男子下车并从后座上拿出一个看起来像大皮套的东西时，大卫大喊让伊娜拨打 911。大卫开始对那个他报警的人大喊大叫。相反，据联邦检察官称，eBay 团队要求在 Steiners 的家中进行恶作剧披萨外卖。这对夫妇说，送货员把披萨盒放在地上就离开了。警察赶到了，但斯坦纳一家再也睡不着了。这对夫妇说，他们感到被围困并被困在自己的家中。 “你无法关闭恐惧感，只是没有关闭开关，”大卫说。 8 月 18 日，大卫下定决心要去杂货店。一辆银色 SUV 又开始跟在他后面。他打电话给伊娜。 “我要带他们去市中心，”他告诉她，打算开车去内蒂克警察局。\nSUV远远地跟在后面。他把车停在警察局对面的街上。当 SUV 缓缓驶过时，他将 Ina 的 iPhone 放在方向盘上，拍下跟踪者的照片。 “这次我下定决心要拍一张照片，我只是不停地按下按钮，”他说。有了大卫照片中完整的车牌号码，纳蒂克警方很快就开始揭开这个阴谋。车辆追踪到一位住在丽兹酒店的 eBay 承包商。根据联邦检察官后来获得的消息，eBay 的团队知道自己遇到了麻烦。但在 8 月 21 日，即使 Natick 的一名警探前往 Ritz 寻找面包车承租人，针对 Steiners 的威胁性推文仍在继续。施泰纳夫妇配合调查，很快就包括联邦调查局特工和联邦检察官。几个月来，这对夫妇不确定到底发生了什么，也不确定谁是虐待的幕后黑手，在 2019 年 9 月 6 日最后一次推文发布后停止了。在我们之上，”大卫说。这对夫妇一直对外界威胁保持警惕。伊娜不再独自长途跋涉，大卫仍然难以入睡。这对夫妇维护着一个安全摄像头网络，其中一个在他们的车里。 2020 年 6 月，联邦检察官宣布对 6 名前 eBay 员工和一名承包商提起刑事指控。该公司向 Steiners 夫妇道歉，并在一份冗长的声明中表示，它已经进行了自己的调查，结果解雇了政府指控的所有员工以及尚未受到指控的通讯主管 Wymer。调查还发现，前首席执行官韦尼格进行了“不恰当的交流”，但对骚扰和跟踪不了解。没有受到指控的 Wenig 于 2019 年 9 月被允许以价值 5700 万美元的薪酬方案辞职；该公司表示，施泰纳丑闻是他离职的“考虑因素”。\nWenig 的律师 Martin G. Weinberg 和 Abbe D. Lowell 在给《环球报》的一份声明中说：“一项独立调查证实，Devin Wenig 与施泰纳夫妇的诉状中所指称的任何活动无关，也不知情。尽管他作为前首席执行官是一个诱人的目标，但他并不知道、批准或授权这种行为，并对施泰纳的经历感到遗憾。”阅读 2020 年 6 月的刑事诉讼，施泰纳夫妇第一次了解了在他们遭受折磨期间 eBay 内部发生的事情。 “对我们的尖酸刻薄，从何而来？”大卫问道。 “我们甚至不认识这些人，”伊娜补充道。 “我们正在帮助他们的客户销售更多产品。这应该是件好事。”在 Steiners 于 7 月 21 日提起民事诉讼后，eBay 发表了一份新声明，再次向这对夫妇道歉，并表示公司将“采取公平和适当的措施来解决 Steiners 的遭遇”。 7 月 28 日，该刑事案件的被告之一、eBay 全球安全团队前安全运营高级经理菲利普·库克 (Philip Cooke) 被判处 18 个月监禁。这是涉案人员的第一次宣判。 “在过去的两年里，有时我无法认出自己，”大卫在库克被判刑后的第二天告诉环球报。 “但我今天醒来感觉很棒。”这对夫妇说，民事诉讼是为了获得更完整的故事，并为公司员工造成的精神损失获得一些赔偿。他们还希望引起其他公司的注意。\n“我们起诉的原因是我们不希望它发生在其他任何人身上，”伊娜说。 “必须知道对我们做了什么。”", "note_en": "Natick resident David Steiner was puttering in his garage on a sunny Sunday morning when a neighbor walking a dog called out to him: “Hey, your fence has been tagged.”\n Steiner, who with his wife, Ina, publishes a news website about the e-commerce industry from their home, thought his neighbor must be joking — who would be graffitiing his new white vinyl fence on their quiet, tree-lined street?\n It was June of 2019, and he had no clue that the vandalism was just the start of a bizarre harassment campaign directed by senior executives at one of the country’s leading Internet companies, eBay. Ultimately, the events would shatter the Steiners’ peaceful suburban life, result in criminal charges against six eBay employees and a contractor, five of whom have pleaded guilty, and contribute to the departure of eBay’s chief executive.\n The abuse would culminate in the couple fearing for their lives as they were stalked in their own neighborhood by unknown perpetrators in a slow-moving black van.\n But that Sunday, Steiner was simply surprised and dismayed  to see the word “Fidomaster” spray-painted across his fence. He tried to clean up the mess before Ina, who was out paddle boarding, returned home but he failed. Ina recognized that the name matched an anonymous commenter on their newsletter, one who was particularly critical of eBay.\n “This was very unnerving,” Ina recalled in an interview with the Globe this week. “It didn’t make any sense.”\n Had the person who was Fidomaster painted their name on the fence? Or was someone accusing the Steiners of being Fidomaster? Or did the term have some other meaning? “I Googled right away to see if it was something kids might be saying,” Ina said.\n In their first interview with the news media, the couple spoke to the Globe for several hours in the offices of attorney Rosemary Scapicchio, who is representing them  in a civil lawsuit against eBay. They provided additional harrowing details of their experience beyond those disclosed in court documents, which include copies of e-mails and text messages of eBay employees that federal prosecutors say show how they conspired to terrorize the Steiners.\n  The couple met in the mid-1980s in Western Massachusetts at what was then called North Adams State College and is now called the Massachusetts College of Liberal Arts. The two young students met at a party for a bandmate of David’s who was going away and immediately felt a connection and began dating. They married in 1988.\n Around 1999, when eBay was still a young company and the World Wide Web was not the finely tuned commercial marketplace it is today, David decided to sell some of his video gear on the auction site. The couple also began haunting garage sales and yard sales to find collectible items they could sell online to make money. “We’d get up early, go through the classified ads, get your Dunkin’ Donuts coffee, and hit as many sales as we could,” Ina said.\n They quickly realized that a growing throng of like-minded sellers was struggling to figure out how best to auction their items. The Steiners initially created a paper newsletter with tips and tricks to help other sellers, but realized after one issue that an online publication made more sense, even in 1999. Thus was born AuctionBytes, later changed to EcommerceBytes, and running the advertising-based publication is the couple’s full-time occupation.\n  For years, the publication thrived. Particularly while eBay was run by Meg Whitman, small sellers flourished and EcommerceBytes offered a wide variety of useful advice. One time, David explained to readers how he’d shipped a large item by Greyhound bus instead of a typical package delivery service, saving hundreds of dollars.\n After Whitman left in 2007 and was replaced by former Bain &amp; Co. consultant John Donahoe, eBay began to cater to larger sellers and established retailers, a trend that continued when Devin Wenig was promoted to CEO in 2015. The couple had pivoted their newsletter from how-to tips to reporting more on the changing strategy and new policies of the company. Their take on the new eBay was often, though hardly exclusively, critical.\n And criticism didn’t go down well at the firm.  Prosecutors said the harassment campaign, starting with the fence spray-painting incident, was directed by James Baugh, who headed eBay’s Global Security and Resiliency unit. Along with other participants in the scheme, Baugh was charged last year with conspiracy to commit cyberstalking and conspiracy to commit witness tampering. He is awaiting trial.\n Prosecutors said  the 2019 campaign was sparked by complaints about articles in EcommerceBytes from eBay chief executive Wenig to his senior vice president and communications director, Steve Wymer. Wymer in turn complained to Baugh, who directed the team of eBay employees who worked for him to move against the Steiners, according to the federal criminal complaints.\n  The articles that drew the eBay executives’ ire included reports about the CEO’s salary and his comments on protecting e-sellers against fraud. Prosecutors revealed angry text messages about an April 10, 2019, article titled “eBay CEO Devin Wenig Earns 152 Times That of Employees,” as well as “eBay CEO Says Sellers Can Expect Greater Protections,” from May 31, 2019. Such articles generated reader comments that were highly critical of the company’s leadership and its treatment of smaller sellers, who felt left behind in favor of larger retailers.\n From the Steiners’ point of view, not much happened for a few weeks after the graffiti. But on Aug. 8, 2019, they found their inboxes filling up with dozens of e-mail newsletters they hadn’t signed up for, ranging from Heather’s Irritable Bowel Syndrome News and The Satanic Temple to more disturbing fare featuring pornography and bondage. At the same time, a new Twitter account started bombarding Ina Steiner with expletive-laden taunts, she said.\n She had occasionally had to deal with inappropriate comments on the website, she said. “If you’ve been on the Internet for a while, you learn that you don’t feed the trolls, don’t respond, don’t encourage them.”\n Two days later, the phone rang. It was a taxidermy and animal parts shop in Arizona calling to ask about a purported order for the Steiners of a fetal pig. The Steiners’ delivery address didn’t match the billing address on the credit card used on the order, so the shop called to double check the order. Shaken, the Steiners canceled the order.\n  “I thought, here we go, from online to the real world,” Ina said. “It was really scary.”\n The couple decided to call the Natick police, and an officer arrived at their house to take a report, they said. As the officer was leaving the house, he noticed a package by the front door. While David and the officer continued talking, Ina opened the package in the kitchen. Seeing bits of hair and skin, she screamed. Inside was a mask of a bloody pig face, like the one worn by a crazed killer in the “Saw” horror movie series. The officer added the details to his report.\n  The Twitter abuse continued to escalate and even more bizarre deliveries arrived, the couple said. One day it was a book for David called “Grief Diaries: Surviving Loss of a Spouse.” Ina said she Googled the return address of another package, and when she discovered the sender was called Carolina Biological Supply Co., she feared they might need to call a hazmat team. A call to the company revealed the package was filled with live spiders and fly larvae; they turned it over to the police.\n A few days later, a florist arrived with a sympathy wreath for David. The driver told the Steiners he had come from Central Square in Cambridge and was instructed to leave the $255 wreath by their back door without ringing the bell. Ina snapped a picture, more evidence for the police, and debriefed the delivery man.\n “All of these small retailers, they were being weaponized to be used against us,” David said.\n On Aug. 15, the campaign took a darker turn. Unbeknownst to the Steiners, a group of Baugh’s employees had flown to Boston, rented two vehicles, and checked into the Ritz-Carlton Hotel, according to federal documents. They initially planned to plant a tracking device on the Steiners’ car. Luckily, the Toyota Rav4 was locked in the garage and the eBay team retreated to the hotel, the documents allege.\n But the next day the team returned. David Steiner was up on a ladder installing one of several new security cameras he’d purchased, while Ina handed him tools out of a second-floor window. Suddenly, Ina saw a dark-colored Dodge Caravan driving up their street. “Black van, New York plates,” she told David as the vehicle drove past.\n  The van took another pass by the house, as captured by one of the couple’s security cameras. Then, later in the day, David noticed the same van pull out to follow him while he was in his car with a friend.\n “I can still feel how every hair on the back of my neck stood up,” David said, as the van followed him for several blocks.\n The Steiners called the police again, and this time three cruisers rushed to their house. But they hadn’t been able to take down the entire license plate number of the van, and the police weren’t able to track down the vehicle. As the police milled about, “I just sat on my steps, sweating, feeling my heart pounding,” David said.\n “Everything just faded away, it was surreal,” added Ina. “I was terrified.”\n Thinking they might be physically attacked, the couple decided to sleep in different rooms. Ina put a laundry cart by her back door with a few baking sheets balanced on top. “We didn’t have a full alarm system,” she said. “This could at least warn us if someone broke in.”\n That night, David was awake at about 4:30 a.m., too stressed to sleep. He heard a car slowly driving up the street. A black sedan pulled up in front of their house. David yelled for Ina to call 911 as a man got out of the car and took what looked like a large leather case out of the back seat. David began screaming at the man that he’d called the police.\n  Instead, the eBay team had called for a prank pizza delivery at the Steiners’ house, according to federal prosecutors. The delivery man put the pizza boxes on the ground and left, the couple said. The police arrived, but the Steiners couldn’t get back to sleep.\n The couple said they felt besieged and trapped in their own home. “You couldn’t shut the feeling of terror off, there’s just no off switch,” David said.\n On Aug. 18, David became determined to break out and go to the grocery store. Again, a vehicle, a silver SUV, started following him. He called Ina. “I’m going to take them downtown,” he told her, planning to drive to the Natick Police Department.\n The SUV followed at a distance. He pulled over and parked across the street from the police station. As the SUV slowly drove past, he propped Ina’s iPhone up on the steering wheel and photographed the stalkers. “I’m determined to take a picture this time, I just kept hitting the button,” he said.\n With a full license plate number in hand from David’s pictures, the Natick police quickly started to unravel the conspiracy. The vehicle tracked back to an eBay contractor who was staying at the Ritz.\n eBay’s team knew it was in trouble, according to their own messages obtained later by federal prosecutors. But on Aug. 21, even as a Natick police detective traveled to the Ritz to find the van renter, the stream of threatening tweets against the Steiners continued.\n The Steiners cooperated with the investigation, which soon included FBI agents and federal prosecutors. For months, the couple weren’t sure what had really happened or who was behind the abuse, which stopped after a final burst of tweets on Sept. 6, 2019.\n “It was a really long winter with the weight of all of this hanging over us,” David said. The couple have remained vigilant to outside threats.  Ina no longer goes for long walks by herself and David still has trouble sleeping. The couple maintain a network of security cameras, including one in their car.\n In June 2020, federal prosecutors announced criminal charges against six former eBay employees and a contractor. The company apologized to the Steiners, and in  a lengthy statement said it had conducted its own investigation that had resulted in terminating all of the employees charged by the government plus communications chief Wymer, who has not been charged.\n The investigation also found that former CEO Wenig had made “inappropriate communications” but did not have advance knowledge of the harassment and stalking. Wenig,  who was not charged, was allowed to resign in September 2019 with a compensation package worth $57 million; the Steiner scandal was a “consideration” in his departure, the company has said.\n Wenig’s lawyers, Martin G. Weinberg and Abbe D. Lowell, said in a statement to the Globe: “An independent investigation confirmed that Devin Wenig had nothing to do with and no knowledge of any of the activities alleged in Mr &amp; Mrs Steiner’s Complaint. Although he is an inviting target as the former CEO, he did not know of, approve, or authorize the conduct and regrets what the Steiners experienced.”\n Reading the criminal complaint in June 2020, the Steiners got a view for the first time of what had been going on inside eBay during their torment. “The vitriol towards us, where did it come from?” David asked.\n “We didn’t even know these people,” Ina added. “We were helping their customers sell more. That should be a good thing.”\n After the Steiners filed their civil lawsuit on July 21, eBay issued a new statement, again apologizing to the couple and saying the company would “do what is fair and appropriate to try to address what the Steiners went through.”\n On July 28, one of the defendants in the criminal case, Philip Cooke, the former senior manager of Security Operations for eBay’s Global Security Team, was  sentenced to 18 months in prison. It was the first sentencing of anyone involved in the case.\n “Sometimes in the past two years, I haven’t been able to recognize myself,” David told the Globe on the day after Cooke was sentenced. “But I woke up feeling great today.”\n The civil lawsuit is an attempt to get the fuller story and gain some  compensation for the mental toll exacted by  the company’s employees, the couple said. They also want to put other corporations on notice.\n “The reason we’re suing is we don’t want it to happen to anybody else,” Ina said. “It has to be known what was done to us.”", "posttime": "2021-08-01 05:45:28", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "高管,harassed,ebay", "title": "被eBay高管骚扰的夫妇第一次讲述他们的故事", "title_en": "Couple harassed by eBay execs tell their story for the first time", "transed": 1, "url": "https://www.bostonglobe.com/2021/07/31/business/it-has-be-known-what-was-done-us-natick-couple-harassed-by-ebay-tell-their-story-first-time/", "via": "", "real_tags": ["高管", "harassed", "ebay"]}]