[{"category": "", "categoryclass": "", "imagename": "6b04b4b04cb2255e3e2df3cfb203b4b0.jpg", "infoid": 1070519, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "如果您想从加利福尼亚州伯克利的城市边缘一直到蒂尔登公园，您有多种选择。你可以慢慢地开车到那里，根据陡峭的道路需要每隔一百码左右切换回来。或者你可以用老式的方式来做，然后走楼梯。一系列 10 英尺宽的小径和楼梯 - 到 Whitaker Path 的隐蔽小径，一直到 Patty Kates - 从加州大学伯克利分校玫瑰园一直延伸到公园，在铺砌的街道上只需绕道几圈一路上。这是城市周围存在的数十条此类路线之一，是常规旧道路的有效且令人兴奋的替代方案。楼梯可能让人感觉很隐秘，但这个隐藏的网络实际上是城市基础设施中根深蒂固的一部分。 “路径是在原始城市地图上绘制的，”科琳·内夫说，她自 17 年前搬到伯克利以来，已经走过了所有 136 条路径。在 1900 年代初期的早期开发热潮中，该市的许多新社区都建在山上，房屋几乎叠在一起。她解释说：“街道蜿蜒前行，他们有点转回去下车。” “这些小路被设置为捷径，以便住在山上的人可以下来乘坐有轨电车。”从那里，他们可以进入镇中心，或者搭乘渡轮前往旧金山——这座城市拥有许多自己的秘密楼梯。 Neff 是 Berkeley Path Wanderer&#39;s Association 的主席，该组织最初是在 20 年前成立的，当时一场悲剧指出了道路提供的另一项重要服务。那时，内夫说，“没有人真正管理这些途径。”她说，在 1991 年山坡大火中数十人死亡后，“伯克利的人们看到这些确实可以用作人们从山上下来的逃生路线。”该市调查了现有路径，并添加了标牌。几年后，协会诞生了。现在——有了内夫所说的来自城市的“轻度监督”——该小组维护了楼梯和小径网络。他们为所需材料筹款，举办工作聚会，并与各个城市机构协调以充分利用基础设施。他们还出版了一张城市地图，“伯克利及其道路”，作为城市各种小路的完整指南。 （最新版本是 2018 年的新版本，本文摘录了其中的内容。）尽管该市最初制定了 150 多条路径的规划，但最终并未全部完成。因此，协会正在努力完成这项工作，每年都会带来一条计划但未建成的道路。内夫说，这可能是一场斗争——虽然人们喜欢小路，但并不是每个人都希望有人突然溜过他们的房子或院子。 “总有一位律师住在这条路附近，”内夫说。 “我们现在有一个正在与其中一种途径作斗争。”\n试图让每个人都在同一页面上意味着平均需要三年时间才能从一个粗略的计划变成一个功能正常的楼梯或小径。但因为城市最终拥有土地，所以“道路总是会建成的，”她说。 “我总是像悲伤的阶段一样谈论它：否认、愤怒、讨价还价，然后人们确实会接受。” （此外，在路径到达之后，内夫说，“人们永远不会认为它会是什么。他们总是认为会有一群青少年抢劫。但如果你有青少年，你就会知道他们不需要爬上这种小山，坐下来喝一罐啤酒。”）相反，这些小路继续吸引着它们建造的人群：试图从郊区进入城市的人们。 （虽然这座城市的有轨电车不再投入使用，但许多交通基础设施还是一样的，而且路径现在往往出现在公交车站。）但有点讽刺的是，楼梯却成为了那些想要尝试的人的避风港摆脱这一切。一旦您离开道路并踏上小路，原本作为捷径的事物本身就变成了目的地。 “你不是在街上闻汽车的气味和听到交通的声音，”内夫说。 “你在冒险。”", "note_en": "If you want to get from the edge of the city in Berkeley, California all the way up to Tilden Park, you have a couple of options. You can drive there, slowly, switching back every hundred yards or so as the steep roads demand. Or you can do it the old-fashioned way, and take the stairs.\n A series of 10-foot-wide paths and stairways—Covert Path to Whitaker Path, and all the way up to Patty Kates—leads from the UC Berkeley Rose Garden all the way up to the park, with just a few detours on paved streets along the way. It’s one of dozens of such routes that exist around the city, an efficient and exciting alternative to regular old roads.\n The stairways may feel furtive, but this hidden network is actually an entrenched part of the city’s infrastructure. “The paths were drawn out on the original city maps,” says Colleen Neff, who, since she moved to Berkeley 17 years ago, has walked all 136 pathways. During an early rush of development in the early 1900s, many of the city’s new neighborhoods were built way up in the hills, with the houses perched practically on top of each other.\n  “The streets wind along, and they sort of switch back to get down,” she explains. “The pathways were put in as shortcuts, so that people who lived up in the hills could come down and get the streetcar.” From there, they then could go into the center of town, or catch the ferry to San Francisco—a city with plenty of  secret stairs of its own.\n Neff is the president of the  Berkeley Path Wanderer’s Association, a group of volunteers that first arose two decades ago, after a tragedy pointed out another vital service provided by the paths. At that time, Neff says, “there was nobody really stewarding the pathways.” After dozens died in  a hillside fire in 1991, she says, “people in Berkeley saw that these really could have been used as escape routes for people to get down from the hills.” The city surveyed the existing paths, and added signage. A few years later, the Association was born.\n  Now—with what Neff calls “light supervision” from the city—the group maintains the network of staircases and pathways. They fundraise for needed materials, throw work parties, and coordinate with various city agencies to get the most out of the infrastructure. They also publish  a map of the city, “Berkeley and Its Pathways,” that serves as a complete guide to the city’s various byways. (The most recent edition is new as of 2018, and excerpts from it appear in this article.)\n Although the city originally laid out plans for over 150 paths, they did not end up making all of them. So the Association is working to finish the job, bringing one planned but unbuilt path to fruition every year. This, Neff says, can be a struggle—although people love the paths, not everyone necessarily wants one to suddenly sidle past their house or yard. “There is always a lawyer who lives adjacent to the path,” says Neff. “We have one right now that’s fighting one of the pathways.”\n  Trying to get everyone on the same page means it takes an average of three years to go from a rough plan to a functioning staircase or trail. But because the city ultimately owns the land, “the path always gets built,” she says. “I always talk about it like the stages of grief: denial, anger, bargaining, and then people do get to acceptance.”\n (Plus, after the path is there, Neff says, “it’s never what people think it’s going to be. They always think there is going to be maurauding bands of teenagers. But if you had teenagers, you would know they do not need to climb this kind of a hill to sit up and drink a can of beer.”)\n  Instead, the paths continue to attract the demographic they were built for: people trying to get into the city from the outskirts. (Although the city’s streetcars are no longer in commission, a lot of the transportation infrastructure is the same, and the paths now tend to emerge at bus stops.)\n But the stairways have, somewhat ironically, become a haven for those who are trying to get away from it all. Once you step off a road and onto a pathway, what started as a shortcut becomes a destination in itself. “You’re not on a street smelling the cars and hearing the traffic,” says Neff. “You’re on an adventure.”", "posttime": "2021-07-30 06:12:44", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "隐藏,hidden,城市", "title": "伯克利隐藏的山坡小路网络", "title_en": "Berkeley’s Hidden Network of Hillside Paths", "transed": 1, "url": "https://www.atlasobscura.com/articles/berkeley-path-stair-map", "via": "", "real_tags": ["隐藏", "hidden", "城市"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070518, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在我购买自己的笔记本电脑之前几个月检查一下 Framework 笔记本电脑是一种享受。 Framework 有望成为一款功能强大的高端超薄笔记本电脑，具有易于维修和升级的突出特点。我认为他们已经做到了。您需要使用 Linux 5.13 或更高版本的安装映像才能拥有可用的 Wi-Fi 卡。如果您愿意在没有 GUI 的情况下安装 NixOS，您可以使用 Hydra 的最新内核获取最低 21.05 ISO。构建您自己的自定义安装媒体非常简单。你需要一台装有 Nix 的 Linux 机器。 $ nix-shell -p nixos-generators nix-shell$ nixos-generate -I nixpkgs =channel:nixos-unstable --format iso --configuration ./custom-media.nix 解包 &#39;https://nixos.org/channels /nixos-unstable/nixexprs.tar.xz&#39;...这些派生将被构建：...snip.../nix/store/gnnbjvd916yh1f4svbgrssq94550pbxl-nixos-21.11pre304626.8ecc61x8c91a/iso -21.11pre304626.8ecc61c91a5-x86_64-linux.iso 注意：安全启动将阻止未签名的软件运行。 NixOS 目前不支持安全启动。\n他们寄给我的评测单元是预发布硬件，但规格齐全且可爱：它的性能似乎相当不错，足以满足我的日常工作。驱动我的 38 英寸超宽显示器没有问题。除了编译的时候，机器是安静的，从来没有感觉到热。经过长时间的编译，铰链附近的一些区域明显温暖，但手托仍然凉爽。对我来说，键盘和触控板感觉很完美。按键感觉清脆但不重。触控板感觉大而精确。也就是说，点击有点太点击了。音频和摄像头的硬件开关很好，但有点难以切换。开关非常小且光滑，因此难以移动。开关是可更换挡板的一部分，这很容易固定。电源砖经过 UL 能源验证，仅比戴尔 XPS 9300 砖稍大。 Intel Wi-Fi 6 AX210 与 Linux 存在集成问题。有时wifi固件在启动时会崩溃，但似乎不会比50/50更频繁。一旦启动，wifi就坚如磐石。\n一切都有一个二维码作为指令的链接。我的意思是一切：直到将墙壁连接到电源砖的电缆。然而，他们中的许多人实际上并没有领导任何地方。看到电源线的二维码是 404ing，我并不太惊讶，但看到 RAM 替换 404ing 的链接有点惊讶。我确信这是一项正在进行的工作，这些二维码都可以正常工作。我想要我能买到的最小、最轻的笔记本电脑，而 Framework 是这里的有力竞争者。这台笔记本电脑的宽度和厚度基本相同：在一两毫米之内。该框架仅比 XPS 重 60 克（1330g 与 1270g）。与 9300 相比的一项重大改进：指纹传感器由开箱即用的最新版本 fprintd 支持，并且不需要 TOD 补丁。传感器快速可靠，而戴尔 XPS 9300 的 TOD Goodix 驱动程序在 Linux 上几乎一文不值。从砖块到墙壁的电缆看起来像台式 PC 的电缆。厚而有光泽的塑料。与戴尔电缆的更抛光、抛光、品牌外观相比。总的来说，我对Framework 非常满意。团队看起来很棒，他们的价值观似乎与我自己的相符。今年晚些时候，当我现在的笔记本电脑不是那么新时，我会掏出我的钱包。我认为他们已经实现了他们的承诺，并创造了一种令人耳目一新的机器：一种可维修的超轻机器。", "note_en": "What a treat it is to review the  Framework laptop a few months before I’ll be buying my own.\n  The Framework promises to be a powerful, high-end ultra thin laptop with the stand-out feature of easy repairs and upgrades. I think they’ve done it.\n      You’ll need an install image with Linux 5.13 or newer to have a working Wi-Fi card.\n    If you’re comfortable installing NixOS without a GUI, you can  fetch a minimal 21.05 ISO with the latest kernel from Hydra.\n    Building your own customized install media is straightforward. You’ll need a Linux machine with Nix.\n        $  nix-shell  -p nixos-generators nix-shell$  nixos-generate  -I  nixpkgs =channel:nixos-unstable  --format iso  --configuration ./custom-media.nix  unpacking &#39;https://nixos.org/channels/nixos-unstable/nixexprs.tar.xz&#39;...these derivations will be built: ...snip.../nix/store/gnnbjvd916yh1f4svbgrssq94550pbxl-nixos-21.11pre304626.8ecc61c91a5-x86_64-linux.iso/iso/nixos-21.11pre304626.8ecc61c91a5-x86_64-linux.iso\n            Note: Secure Boot will prevent unsigned software from running. NixOS does not support Secure Boot today.\n                        The review unit they shipped me is pre-release hardware, but well specced out and lovely:\n    Its performance seems quite good, easily good enough for my day to day work. It has no problems driving my 38” ultrawide display.\n  The machine is silent except when I’m compiling, and it has never felt hot. After a long compilation some areas near the hinge are noticably warm, but the hand rests are still cool.\n  The keyboard and trackpad feel, to me, perfect. The keys feel crisp but not heavy. The trackpad feels large and precise. That said, click is a bit  too clicky.\n  Hardware switches for the audio and camera are nice, but a bit hard to toggle. The switches are very small and smooth, making it difficult to move. The switches are part of the replacable bezel, and this may be easily fixed.\n  The power brick is UL Energy Verified and just slightly larger than the Dell XPS 9300 brick.\n  The Intel Wi-Fi 6 AX210 has integration issues with Linux. Sometimes the wifi firmware crashes on startup, but it seems to be no more frequent than 50/50. Once it is booted, the wifi is rock solid.\n      Everything has a QR code as a link to instructions. And I mean everything: down to the cable connecting the wall to the power brick.\n  However, many of them don’t actually lead anywhere. I wasn’t too surprised to see the power cable’s QR code was 404ing, but a bit surprised to see the link for RAM replacement 404ing. I am sure this is a work in progress and these QR codes will all work.\n    I want the smallest, lightest laptop I can buy, and the Framework is a strong contender here.\n  This laptop is essentially the same width and thickness: within a milimeter or two. The framework comes in at just 60 grams heavier than the XPS (1330g vs. 1270g.)\n  One major improvement over the 9300: The fingerprint sensor is supported by recent versions of fprintd out of the box, and no TOD patches are required. The sensor is fast and reliable, whereas the Dell XPS 9300’s TOD Goodix drivers are nearly worthless on Linux.\n    The cable from the brick to the wall looks like a desktop PC’s cable. Thick, shiny plastic. compared to the more polished, polished, on-brand look of the Dell cable.\n    Overall, I am extremely satisfied by Framework. The team seems great, and their values appear to match my own. I’ll be pulling out my wallet later this year when my current laptop isn’t so new. I think they’ve fulfilled their promise, and have created a refreshing machine: an ultralight which is servicable.", "posttime": "2021-07-30 06:09:59", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "框架,nixos", "title": "框架上的 NixOS", "title_en": "NixOS on the Framework", "transed": 1, "url": "https://grahamc.com/blog/nixos-on-framework", "via": "", "real_tags": ["框架", "nixos"]}, {"category": "", "categoryclass": "", "imagename": "b1b7775ed7f2d2e267530919c4ba65d0.jpg", "infoid": 1070517, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "决定在迪士尼 Plus 上映的同时在影院上映，这引发了一场与扮演漫威超级英雄的女演员的法律纠纷。在周四向洛杉矶高等法院提起的诉讼中，约翰逊的律师声称，当制片厂选择不在影院独家首映这部电影时，这位明星的合同被违反，他们声称此举导致复仇者联盟衍生品的票房销售下滑。约翰逊的大部分薪酬与《黑寡妇》的票房表现挂钩——如果达到一定的标准，奖金就会开始发挥作用。她与漫威讨价还价的全部好处，”诉讼中写道。迪士尼在 3 月份宣布，《黑寡妇》将在该工作室基于订阅的流媒体服务上以 30 美元的高价同时在大屏幕上首映。此举是因为电影院行业正在从 COVID-19 关闭和容量限制中反弹。 7 月 9 日，《黑寡妇》在北美以 8000 万美元的首映创造了大流行时期的票房记录，并在海外获得了 7800 万美元的额外收入。它还在迪士尼 Plus 上获得了 6000 万美元的收入。随后几周的票房收入急剧下降，目前全球票房收入为 3.19 亿美元，这使《黑寡妇》有望成为有史以来票房最低的漫威电影之一。首次亮相后不久，该行业的主要贸易组织全国影院业主协会声称，“黑寡妇”在影院和流媒体上同时上映“在电影的整个生命周期中，每位观众的收入都会让迪士尼付出代价”。然而，诉讼指出，迪士尼的股票在公司披露租金数据后上涨。 “迪士尼选择安抚华尔街投资者并垫底，而不是让其子公司漫威遵守协议，”诉讼中写道。 “不出所料，迪士尼违反协议的行为成功地将数百万粉丝从影院转移到了其 Disney+ 流媒体服务上。”\n爆料诉讼消息的《华尔街日报》报道称，与约翰逊关系密切的消息人士估计，在迪士尼 Plus 上同时发行这部电影的决定导致奖金损失 5000 万美元。 Johansson 的合法齐发正值新的发行范式和 COVID-19 大流行正在重塑一线演员的工作报酬方式之际。许多顶级参与者将后端利润参与作为其合同的一部分。但是流媒体服务（例如 Netflix）的兴起已经取消了这些形式的补偿，而华纳兄弟和迪士尼等传统电影制片厂决定通过自己的内部订阅服务发行电影进一步颠覆了这些旧的方式经商。当华纳兄弟公司选择将其整个电影名单发送给 HBO Max 时，意识到电影院在一年中的大部分时间里只能以有限的容量运营，该工作室不得不向这些电影的明星支付数千万美元。这导致威尔史密斯、丹泽尔华盛顿和基努里维斯等演员在华纳兄弟在其新服务上发布的电影中获得了完整的后台。如果成功，约翰逊的诉讼可能会鼓励更多演员为迁移到流媒体服务的电影寻求额外赔偿，并可能导致代理商在合同中包含更严格的补偿条款，如果独家影院上映受到损害或绕过。约翰逊的律师建议她的诉讼可以成为先例设定者。约翰森的律师约翰·柏林斯基说：“众所周知，迪士尼将《黑寡妇》等电影直接发布到迪士尼 Plus 上以增加订阅者，从而提高公司的股价——而且它隐藏在 Covid-19 背后作为这样做的借口。” ，在给 Variety 的一份声明中说。 “但无视负责其电影成功的艺术家的合同来推进这种短视的策略侵犯了他们的权利，我们期待在法庭上证明这一点。这肯定不会是好莱坞人才对抗迪士尼的最后一个案例，并明确表示，无论公司如何伪装，它都有履行合同的法律义务。”约翰逊法律团队表示，这位女演员的代表担心，即使在冠状病毒使生活陷入停顿之前，“黑寡妇”也会在迪士尼 Plus 上首次亮相。作为诉讼的一部分，他们分享了来自明星管理团队的电子邮件，要求工作室保证《黑寡妇》将在电影院独家首映。作为回应，漫威首席法律顾问 Dave Galluzzi 承诺了传统的戏剧性鞠躬，同时补充说：“我们理解如果计划改变，我们需要与您讨论并达成共识，因为该交易基于一系列（非常大的) 票房奖金。”", "note_en": "’s decision to release “ ” on Disney Plus at the same time it hit theaters has sparked a legal battle with  , the actress tasked with playing the Marvel superhero.\n In a lawsuit filed Thursday in Los Angeles Superior Court, attorneys for Johansson allege that the star’s contract was breached when the studio opted not to debut the film exclusively in theaters, a move they claim depressed ticket sales for the Avengers spinoff. Much of Johansson’s compensation was tied to the box office performance of “Black Widow” — if it hit certain benchmarks, bonuses would kick in.\n “Disney intentionally induced Marvel’s breach of the agreement, without justification, in order to prevent Ms. Johansson from realizing the full benefit of her bargain with Marvel,” the suit reads.\n  Disney announced in March that “Black Widow”  would premiere simultaneously on the studio’s subscription-based streaming service, for a premium $30 price, as well as on the big screen. The move was made as the movie theater industry was rebounding from COVID-19 closures and capacity restrictions. On July 9, “Black Widow” set a pandemic-era box office record with its $80 million debut in North America and earned an additional $78 million overseas. It also pulled in $60 million on Disney Plus. Ticket sales steeply declined in subsequent weeks and currently stand at $319 million globally, putting “Black Widow” on track to become one of the lowest-grossing Marvel movies of all time.\n  Shortly after its debut, the  National Association of Theatre Owners, the industry’s main trade organization, asserted the simultaneous release of “Black Widow” in theaters and on streaming “costs Disney money in revenue per viewer over the life of the film.”\n However, the suit notes that Disney’s stock rose after the company disclosed the rental figures.\n “Disney chose to placate Wall Street investors and pad its bottom line, rather than allow its subsidiary Marvel to comply with the agreement,” the suit reads. ” To no one’s surprise, Disney’s breach of the Agreement successfully pulled millions of fans away from the theatres and toward its Disney+ streaming service.”\n The Wall Street Journal, which  broke the news of the lawsuit, reports that sources close to Johansson estimate that the decision to release the film concurrently on Disney Plus resulted in $50 million in lost bonuses.\n Johansson’s legal salvo comes as new distribution paradigms and the COVID-19 pandemic are reshaping the way that A-list actors are paid for their work. Many top actors include backend profit participation as part of their contracts. But the rise of streaming services, such as Netflix, has removed those forms of compensation and the decision by traditional movie studios, like Warner Bros. and Disney, to release films on their own in-house subscription services has further upended these old ways of doing business. When Warner Bros. opted to send its entire film slate to HBO Max, realizing that movie theaters were only operating at limited capacity for much of the year, the studio had to pay tens of millions of dollars to the stars of those films. That resulted in actors such as Will Smith, Denzel Washington, and Keanu Reeves earning their full back-end on the movies that Warner Bros. released on its new service. If successful, Johansson’s suit could embolden more actors to seek additional compensation for films that migrated to streaming services and may lead to agents including stricter language in contracts regarding compensation if an exclusive theatrical release is compromised or bypassed. Johansson’s attorneys suggested that her suit could be a precedent setter.\n  “It’s no secret that Disney is releasing films like Black Widow directly onto Disney Plus to increase subscribers and thereby boost the company’s stock price – and that it’s hiding behind Covid-19 as a pretext to do so,” John Berlinski, an attorney for Johansson, said in a statement to  Variety. “But ignoring the contracts of the artists responsible for the success of its films in furtherance of this short-sighted strategy violates their rights and we look forward to proving as much in court. This will surely not be the last case where Hollywood talent stands up to Disney and makes it clear that, whatever the company may pretend, it has a legal obligation to honor its contracts.”\n Johansson legal team said that representatives for the actress were worried that “Black Widow” would debut on Disney Plus even before coronavirus brought life to a standstill. As part of the suit, they share emails from the star’s management group that asked the studio to guarantee that “Black Widow” would premiere exclusively in cinemas. In response, Marvel Chief Counsel Dave Galluzzi promised a traditional theatrical bow, while adding “We understand that should the plan change, we would need to discuss this with you and come to an understanding as the deal is based on a series of (very large) box office bonuses.”", "posttime": "2021-07-30 06:09:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "上映,johansson,迪士尼", "title": "斯嘉丽约翰逊因《黑寡妇》上映起诉迪士尼", "title_en": "Scarlett Johansson Sues Disney over 'Black Widow' Release", "transed": 1, "url": "https://variety.com/2021/film/news/scarlett-johansson-sues-disney-black-widow-1235030582/", "via": "", "real_tags": ["上映", "johansson", "迪士尼"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1070515, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "黑人女性客户服务地狱的故事：当你打电话给迪士尼、Airbnb、嘉年华等时接电话的女性。多年来，我一直在写关于萨克勒犯罪家族的文章，因为新一代将家族的苯并帝国变成了阿片类药物的强国，通过推动奥施康定并引发一场夺走 80 万美国人生命的流行病，超过了洛克菲勒家族的财富。萨克勒家族很精明：多年来，他们通过精英慈善事业洗刷自己的声誉，用血钱在世界上伟大的文化机构上大肆挥霍，并花费相当的金额威胁记者和评论家对他们的罪行保持沉默。但是没有人可以永远骑在鳄鱼背上过河——最终，即使是最快的骗子也会失去一条腿。萨克勒夫妇最终成为地方检察官、联邦执法人员、失去亲人的家庭和正在康复的吸毒者的目标。从表面上看，这家人继续保持清白，并向我们保证他们会在法庭上获胜。私下里，他们将数十亿美元洗钱到离岸金融保密天堂。每一个大骗局都需要一次打击，这是一个让骗子从鳄鱼的下巴里扭出来的最后一招。对于萨克勒夫妇来说，这是对破产制度的惊人捕捉，以美国司法机构的顶级亿万富翁推动者 SDNY 的罗伯特·德莱恩法官为例。这个策略奏效了。 Drain 将以 $4b 单方面解决所有 Sacklers 的受害者索赔，让 Sacklers 保留 $6.7b 的血钱。没有萨克勒会进监狱。没有萨克勒会面临经济困难。关键文件永远不会被开封。\n德莱恩法官正在接受约瑟夫·斯大林的可怕意识形态：“重大罪行需要极大的宽恕。”萨克勒家族给美国带来的生命比冠状病毒还多——他们的惩罚是 6.7 亿美元的财富。这次爆炸事件引起了很多媒体对美国破产制度被超级富豪占领的方式的关注，他们为鲍勃·德莱恩这样的推动者“评判”。到目前为止，我读过的关于这个主题的最好的文章是 Maureen Tkacik 的“你如何像萨克勒斯一样解决问题？”为美国前景。 Tkacik 将萨克勒斯的策略放在上下文中，展示了它是如何悄悄地摧毁了该国的经济并毁掉了无数生命的长期皮影戏的最新行为。早在萨克勒家族呼吁鲍勃·德莱恩（Bob Drain）将他们的凶残遗产合法化之前，这位好法官就在为私募股权领域的金融犯罪分子提供服务，允许掠夺者从投资者、工人和供应商那里窃取资金。私募股权投资手册经常让第一次听说它的人感到困惑。 “投资者”如何能从收购一家公司、出售其所有重要资产、向其大量借款、然后宣布破产并以数十亿美元离开债权人的情况下逃脱？答案是美国的破产制度和少数负责监管大型企业破产的法官，任何私募股权欺诈者只需在其所在地区租一间空办公室并宣布其为您的总部即可对其进行监管。\n如果这听起来很熟悉，那是因为它是司法机构所有领域的病理学。想想德克萨斯州的东区，那里的法官和陪审团从未遇到过他们不喜欢的专利流氓。这就是为什么德克萨斯州马歇尔市到处都是空荡荡的建筑物，作为数百家公司的名义总部——以及为什么制造“东西”而不是“诉讼”的公司（如三星）通过安装德克萨斯州唯一的室外全年冰来吸引当地人溜冰场。对 Sacklers 的总索赔加起来为 $2t，但他们只会支付 $4b。尽管金额很大，但这种模式是古老的，私募股权观察人士也很熟悉——毕竟，十分之三的美国破产涉及一家私募股权公司冲洗一家被其破产的公司。 Tkacik 让我们想起上一次破产制度违反了公众意识，当时 PE 巨头阿波罗全球管理公司 (Apollo Global Management) 抨击凯撒宫 (Caesars Palace)，并要求破产法官让他们保留贪污的数十亿美元。阿波罗及其合作伙伴大卫·桑布尔在敲诈勒索诉讼中被点名，该诉讼揭露了桑布尔在破产前从该公司掠夺了数十亿美元，这是一种无耻的盗窃行为，其中包括购买价值 1500 万美元的曼哈顿住宅。像萨克勒斯一样，桑布尔把他的邪恶计划写成书面形式，通过电子邮件向同事的 Powerpoint 演示文稿发送电子邮件，详细说明他的计划，即通过承担巨额债务，然后拖欠巨额债务，“吃掉我们的蛋糕，也吃掉它”。 Sambur 的厚颜无耻可能是可以原谅的，因为他只是在重复 Drain 法官之前亲自开绿灯的噱头，当时 Sambur 收购、抢劫和摧毁了硅胶制造商 Momentive。\nSambur 借了 15 倍 Momentive 的收益并违约，解雇了公司一半的员工，并利用 Drain 的破产法庭迫使“有担保”的债券持有人损失 3 亿美元，从而使他自己和公司免于承担责任并保留对公司的控制权。正如 Tkacik 所写，美国被捕的破产法官“深谙法律理论，将有限责任公司的发明与蒸汽机的发明一起作为追求上述繁荣的典型发展。”对于这些法官来说，有罪不罚是一个特点，而不是一个错误——一种鼓励“冒险者”的方式。虽然支持这一理论的经济学家对公共医疗保健和住房的“道德风险”感到不安，但他们对有限责任却出奇地乐观。难怪 PE 拥有的公司宣布破产的可能性是传统结构公司的 10 倍——破产使掠夺者摆脱了对我们其他人的财务和道德义务。 PE 是否通过购买养老院并让每个工人负责 30 名老年人来谋杀你的祖母：但是，虽然 PE 喜欢收购和掠夺真正的企业，但他们更喜欢收购犯罪企业并掠夺它们。以 Millennium Health 为例，该骗局从医疗保险和医疗补助计划中窃取了数百万美元。千禧年的创始人，一位前总承包商变成了名为 James Slattery 的药物测试主管，在 Voya Capital 中找到了志同道合的人，他购买了该公司，然后帮助它借了 $1.8b，其中 $1.3b 直接进入了 Voya 的口袋。\n该公司支付了 2.56 亿美元来解决其欺诈诉讼。它完全免除了任何责任，Voya 也是如此。 Voya 保留了 $1.3b。 Slattery（其有限责任公司被称为“Pissed Away”）保留了数亿美元，以及他收集的 40 架老式飞机。Tkacik 指出，在其破产交易中代表 Millennium 的律师现在是联邦破产法官本人——尊敬的约翰·T·多尔西 (John T Dorsey)特拉华州破产法庭。幸运的是，特拉华州几乎不以金融犯罪而闻名。千禧年的犯罪老板都做得很好。千禧年首席执行官罗纳德·A·里滕迈尔 (Ronald A Rittenmeyer) 继续掌舵 Tenet Healthcare，这是一家以绑架 AA 会议人员而闻名的公司，让他们宣布无能，并为他们的监禁收费。具有讽刺意味的是，Tenet 将在 Sacklers 的破产中损失惨重（别担心，它仍然在联邦 CARES 面团中赚了一大笔钱，并将其两家社区医院转给了欠债的 PE 公司-加载他们并让他们破产以摆脱债务。当萨克勒斯计划他们的破产时，他们咨询了两家私募股权公司（有关剥离盈利部门的技巧以将他们置于债权人的控制范围之外，并提供有关从他们从成瘾治疗业务开始的流行病中获利的建议，以及麦肯锡。所有这些犯罪行为都没有逃过伊丽莎白沃伦的注意，她借此机会推出了她的标志性 2019 年竞选计划之一，即停止华尔街抢劫法案 (SWSLA)，该法案引起了私募股权行业的愤怒尖叫。就其所有细节而言，SWSLA 不会阻止萨克勒斯的罪行——也不会阻止强生和苹果等蓝筹公司的模仿者，他们利用他们的策略来完善 Tkacik 所说的“合法贪污”。\n看起来萨克勒家族将保留数十亿美元，而 Drain 法官将继续审理像他们这样的案件。但沃伦从 2019 年吸取了教训，并引入了新的、更强有力的立法，即《非债务人解除禁令法》，该法案将永远阻止此类交易。 Simone Biles 是 Larry Nasser 虐待的幸存者。纳赛尔幸存者的索赔被破产法官驳回。互联网时代无疑已经改变了新闻业。如今，我们主要考虑调查性新闻的衰落，但也有像钻石一样闪耀的数字调查媒体。 Propublica 的 Justin Elliott 和 Paul Kiel 写了一系列关于垄断企业 Intuit 的轰动一时的故事，Intuit 是一家围绕其当时的首席执行官布拉德·史密斯（Brad Smith）组织起来的邪教组织，几十年来一直从事肮脏的伎俩来扼杀免费的 IRS 税务准备服务。他们不仅连续数月关注这个故事，挖掘令人难以置信的腐败故事，还羞辱了美国国税局，并促使州 AG 调查这家公司。然后发生了一件有趣的事情：Intuit 客户服务举报人披露了另一起丑闻，该丑闻蔓延到 Intuit 之外，并波及了从迪士尼、Airbnb 到康卡斯特等全球最大的蓝筹公司。这就是 Arise 的故事，这是另一个类似邪教的企业，您几乎可以肯定与之互动，却不知道它。\n从表面上看，Arise 是一家外包客户服务公司。其他企业付钱给他们的电话员工并回答客户的疑问。但Arise还有很多其他的东西。一方面，这是一个金字塔计划：为其工作的人——不成比例的黑人女性——不被归类为雇员，而是“承包商”。他们因招募朋友为其工作而获得报酬。这听起来可能是帮助企业为其呼叫中心配备人员的好方法，但您需要了解 Arise 没有呼叫中心或员工——它的员工在家中接听电话。如果你想为 Arise 工作，你必须支付他们的特权。您不仅需要购买电脑和电话，还必须为您接听电话的每家公司支付培训费用。信不信由你，这些是为 Arise 工作的最佳部分。当您是 Arise 员工时，您可以在没有通知或原因的情况下被解雇 - 没收您在培训和设备上花费的金钱和时间。您可能会被 Arise 本身或其任何客户解雇。 Arise 及其客户的代表会听取您的电话。如果您的孩子在背景中制造噪音，您可能会失去一切。如果你邻居的狗开始吠叫也是一样。忘记运行风扇或空调——噪音是“不专业的”。 Arise 的故事引起了公众的愤怒——它让 Propublica 的调查人员更深入地了解了这个故事。他们记录了劳工部如何知道 Arise 的非法和虐待行为，并让他们多年来逍遥法外。\n这是最令人惊奇的部分：Propublica 从未停止报道这个故事。本月，Ariana Tobin、Ken Armstrong 和 Justin Elliott 与 Brooke Stephenson 合作，用他们自己的话讲述 Arise 工人的故事。这些故事揭露了 Arise 在其工作条件方面的谎言，因为工人描述了他们是如何被明确要求永远不要挂断客户的电话，即使面对死亡和强奸威胁、种族主义虐待和性骚扰。 Arise 可能会告诉监管机构和记者，如果另一端的男人在自慰，它的员工有权挂断电话，但忍受这种虐待的女性讲述了一个截然不同的故事：作者将 Arise 的工作条件与代代相传的临时机构——像“Kelly Girl”这样的公司，她承诺一个一次性的、有吸引力的、柔韧的、勤奋的女人，公司可以像政府的骡子一样工作然后丢弃。当配偶和孩子踮起脚尖绕过他们的家，以让他们的母亲免于被即刻解雇的经济灾难时，就会成为经济不稳定的猎物，并使他们的整个家庭陷入真正的沉默阴谋中。接听这些电话的女性的有力话语提醒人们注意系统性种族主义和性别歧视的人力成本，以及世界上最大的公司对其加以利用的意愿。虽然这是一个系统性问题，但除了礼貌、体面和理解（这是我们所有人对彼此的最低要求）之外，您还可以通过多种方式单独帮助与您交谈的人。\nI. 完成通话结束调查。如果他们帮助的人不这样做，工人可能会被解雇并失去对设备和培训的投资。二、在基于文本的服务交互之后，在代表询问“还有什么我可以帮你的吗？”之后，回答“不，谢谢你”。如果你没有回答这个问题就关闭浏览器，工人会受到惩罚。三、在您致电之前，整理好所有相关信息。工作人员会因通话时间过长而受到惩罚——即使延迟的原因是调用者花费了很长时间来查找关键信息。是的，如果你不遵守 Arise 愚蠢的客户服务指标，员工会受到惩罚是不公平的，但这种不公平对员工来说是不成比例的，你可以承担一些负担。我很感谢 Propublica 继续为我们带来这个故事——并且很高兴成为这个慈善非营利组织的年度捐助者。为我们的计算机添加传感器彻底改变了它们。我记得我买了我的第一个电脑拨片、我的第一个麦克风、我的第一个网络摄像头，以及通过让电脑感知和响应物理世界的方式解锁的令人难以置信的新功能。今天，我们的设备都塞满了传感器，以乞求想象力。我最新的手机有四个摄像头、多个麦克风、热传感器，当然还有一个加速度计，可以让系统测量它时时刻刻的移动方式。\n设备安全和隐私模型将摄像头和麦克风视为敏感设备，并控制应用程序访问它们的方式，但加速度计被视为实用程序，应用程序应该能够随意使用这种东西，而不会对用户造成风险。在“加速度计数据的隐私影响：可能推断的回顾”中，柏林技术大学的三位研究人员记录了加速度计数据可用于推断有关用户的敏感事实的惊人方式。合著者 Jacob Leon Kröger 出色地分解了团队的发现，并强调了设备许可模型与加速度计支持的各种广泛推理之间的差距。他引用了“不同学科的专利和文献”，这些专利和文献仅通过分析加速度计数据就可以揭示用户的“日常生活、体育活动、社交互动、健康状况、性别、年龄和情绪状态”。您移动的方式具有足够独特的特征，加速度计可以将您识别为携带设备的人。即使没有 GPS 定位，同样的技术也可以推断出您的驾驶风格、您是否醉酒，以及通过航位推测法推断您的位置。令人担忧的是，加速度计可以重新用作原始麦克风，将声音振动转化为语音和关键字检测。加速度计分析不完善且计算量大，但它仍然令人担忧，特别是考虑到移动操作系统中的加速度计数据缺乏保护。\n作者怀疑“知情同意”模型是否会解决这个问题，部分原因是加速度计数据有很多不明显的用途（例如纠正照片抖动），但也因为数字同意中存在充分理论化的缺陷：Kröger 提到了我们他与他人合着的另一篇关于同意和隐私的论文的第 7 节，“个人控制的神话”，关于在隐私和功能之间取得平衡的一些理论方法。本节将隐私设置的“自我管理”视为无效，并提出诸如机构管理的“社会影响评估”之类的东西，以评估“信息使用和滥用的后果”。 Kröger 承认“该领域的大多数现有想法仍然模糊和假设”，并呼吁“紧急”进一步研究（这对我来说也是正确的）。最后，他指出所有传感器数据中还潜藏着许多其他潜在的妥协推理技术，并建议他的论文“语音和语音分析的隐私影响”。早在 2019 年，佛罗里达环球影城主题公园的游客就开始在社交媒体上发布关于他们使用 RFID 芯片纸杯与公园自助苏打水喷泉的体验：收取高额入场费的主题公园确实令人沮丧，但正如 Daniel Danger 当时所写的那样，值得注意的部分在于这种纪律性技术的部署方式既笨拙又详细。\n它不仅强加了关于如何使用“无限”杯子的各种规则（你必须等待 120 秒才能重新装满它等），而且如果你违反了这些规则，“机器人的声音”会向你咆哮否认.那是吉列姆的奥威尔——一个荒谬的互联网，在有趣的公园里展示了狗屎的反乌托邦时刻。该技术来自“Validfill”，他们制作了一个漂亮且具有纪念意义的无意识视频，以吹嘘他们的系统在环球公司的使用。美国企业界从来没有遇到过它不喜欢的糟糕想法，这就是 Validfill 令人毛骨悚然的 RFID 芯片杯在 Universal 大门外扩散的方式。我已经忘记了转发@AnemoneAndMe 关于他们在野外遇到它的病毒推文的人数。他们称其为“反无家可归的 DRM”，并非一无是处 - 这些自助苏打水机分配的其中一项内容是饮用水，通常取代公共饮水机。缺口杯使像麦当劳这样的公司能够防止无家可归的人——以及其他因为所有人都需要喝水而仍然需要喝水的边缘化人群——喝他们的水。\n许多给我贴上标签来告诉我这种最新轰动的人都引用了我的故事 Unauthorized Bread，这是一部以设备越狱英雄行为为特色的垃圾互联网技术惊悚片：Unauthorized Bread 是一个关于纪律技术和糟糕技术采用的寓言曲线，通过将最糟糕的技术理念应用到那些投诉不被认真对待的人身上——难民、无家可归的人、囚犯、学生——来规范化。随着这些糟糕的想法被正常化，它们会沿着特权梯度上升，直到它们变得无处不在——20 年前，如果中央电视台观察到你的晚餐时间，你就在超级监狱里。今天，这只是意味着你从谷歌、苹果或亚马逊购买了家庭自动化。对于未经授权的面包，我既高兴又难过。作为一个故事，它无疑为人们提供了一个框架和词汇来谈论他们周围学科技术的扩散，以及那个可怕未来的不平等分布。但老实说，看到未经授权的面包适用于另一个可怕的技术理念的频率有点令人沮丧。赛博朋克是警告，而不是建议。 #20yrsago 2001 年前六个月主要杂志的广告下降 https://web.archive.org/web/20010714104017/https://ww ......", "note_en": "Stories from Black women&#39;s customer service hell: The women who answer the phone when you call Disney, Airbnb, Carnival and others.\n     I&#39;ve been writing about the Sackler crime-family for years, as a new generation turned the family&#39;s benzo empire into a opioid powerhouse, exceeding the Rockefeller family fortune by pushing Oxycontin and jumpstarting an epidemic that has claimed 800,000 American lives.\n The Sacklers are canny: for years, they laundered their reputation through elite philanthropy, using blood money to paint their names on the world&#39;s great cultural institutions and spending comparable sums to threaten journalists and critics into silence about their crimes.\n But no one can run across a river on the backs of alligators forever – eventually, even the fleetest grifter will lose a leg. The Sacklers eventually came into the crosshairs of district attorneys, federal enforcers, bereaved families and recovering addicts.\n Outwardly, the family continued to maintain their innocence and assure us that they would prevail in court. Privately, they laundered billions into offshore financial secrecy havens.\n Every big con needs a blow-off, a final trick that lets the crook wriggle out of the gator&#39;s jaws. For the Sacklers, that was a breathtaking capture of the bankruptcy system, in the person of Judge Robert Drain of the SDNY, the American judiciary&#39;s top billionaire enabler.\n The gambit worked. Drain will unilaterally settle all the Sacklers&#39; victims claims for $4b, leaving the Sacklers to keep $6.7b in blood money. No Sackler will go to jail. No Sackler will face financial hardship. Key documents will never be unsealed.\n  Judge Drain is embracing the monstrous ideology of Josef Stalin: &#34;Great crimes require great forgiveness.&#34; The Sacklers cost America more lives than coronavirus – and their punishment is a $6.7b fortune.\n This blow-off has attracted a lot of press attention to the way that the US bankruptcy system has been captured by the ultra-rich, who &#34;judge-shop&#34; for enablers like Bob Drain.\n  The best writing on the subject I&#39;ve read so far is Maureen Tkacik&#39;s &#34;How Do You Solve a Problem Like the Sacklers?&#34; for The American Prospect.\n  Tkacik puts the Sacklers&#39; gambit in context, showing how it is just the latest act of a longrunning shadow-play that has quietly demolished the country&#39;s economy and ruined countless lives.\n Long before the Sacklers were calling upon Bob Drain to legitimize their murderous legacy, the good judge was servicing the financial criminals of the private equity world, allowing looters to steal from investors, workers and suppliers.\n The private equity playbook often puzzles people who first hear about it. How can &#34;investors&#34; get away with buying a company, selling off all its vital assets, borrowing heavily against it, then declare bankruptcy and walk away from their creditors with billions?\n The answer is the US bankruptcy system and the tiny number of judges who oversee large corporate bankruptcies, whose supervision can be had by any PE grifter merely by renting an empty office in their district and declaring it to be your headquarters.\n If this sounds familiar, it&#39;s because it&#39;s a pathology in all areas of the judiciary. Think of the Eastern District of Texas, where judges and juries never met a patent troll they didn&#39;t find in favor of.\n  That&#39;s why Marshall, TX is full of empty buildings serving as nominal HQs to hundreds of companies – and why companies that make &#34;things&#34; as opposed to &#34;lawsuits&#34; (like Samsung) court locals by installing Texas&#39;s only outdoor, year-round ice-rink.\n  The total claims against the Sacklers add up to $2t, but they&#39;re only going to pay $4b. Though the sums are large, the pattern is an old one, and familiar to private equity watchers – after all, 3 in 10 US bankruptcies involve a PE firm flushing a company it ruined.\n Tkacik reminds us of the last time the bankruptcy system breached public consciousness, when PE giant Apollo Global Management trashed Caesars Palace and asked a bankruptcy judge to let them keep the billions they embezzled.\n  Apollo and its partner David Sambur were named in a racketeering suit, which revealed Sambur&#39;s looting of billions from the company prior to the bankruptcy, a display of shameless larceny that included buying a $15m Manhattan home.\n Like the Sacklers, Sambur put his evil plans in writing, emailing colleagues Powerpoint presentations detailing his scheme to &#34;have our cake and eat it too&#34; by taking on and then defaulting on vast debts.\n Sambur might be forgiven for his brazenness, because he was only repeating a stunt that Judge Drain himself had previously greenlit, when Sambur bought, looted and destroyed Momentive, a silicone manufacturer.\n Sambur borrowed 15 times Momentive&#39;s earnings and defaulted, laying off half the company&#39;s workers and using Drain&#39;s bankruptcy court to force a $300m loss on &#34;secured&#34; bondholders, shielding himself and the company from liability  and retaining control of the firm.\n As Tkacik writes, America&#39;s captured bankruptcy judges are &#34;steeped in legal theory that casts the invention of the limited liability corporation alongside that of the steam engine as a paradigmatic development in the pursuit of said prosperity.&#34;\n  For these judges, impunity is a feature, not a bug – a way to embolden &#34;risk takers.&#34; And while the economists who espouse this theory wring their hands about the &#34;moral hazard&#34; of public health care and housing, they&#39;re oddly sanguine about limited liability.\n Small wonder that PE-owned companies are 10 times likelier than traditionally structured companies to declare bankruptcy – bankruptcies that free looters from both their financial and moral obligations to the rest of us.\n Whether PE murdered your grandmother by buying her care-home and putting each worker in charge of 30 seniors:\n     But while PE loves buying up and looting  real businesses, they&#39;re even more fond of buying up criminal enterprises and looting  them. Take Millennium Health, a con that stole millions from Medicare and Medicaid.\n Millennium&#39;s founder, a former general contractor turned drug-testing kingpin named James Slattery, found kindred spirits in Voya Capital, who bought into the company and then helped it borrow $1.8b, $1.3b of which went straight into Voya&#39;s pockets.\n  The company paid $256m to settle its fraud lawsuits. It got a full release from any liability, as did Voya. Voya kept $1.3b. Slattery (whose LLC was called &#34;Pissed Away) kept hundreds of millions, and his collection of 40 vintage airplanes.\n Tkacik points out the lawyer who represented Millennium in its bankruptcy deal is now a federal bankruptcy judge himself – the honorable John T Dorsey, of the Delaware bankruptcy court. Lucky for us, Delaware is hardly known for its financial crimes.\n  Millennium&#39;s crime bosses all fared well. Millennium CEO Ronald A Rittenmeyer went on to take the helm at Tenet Healthcare, a company famous for kidnapping people from AA meetings, having them declared incompetent, and billing for their imprisonment.\n  Ironically, Tenet stands to lose big in the Sacklers&#39; bankruptcy (don&#39;t worry, it still got a fortune in federal CARES dough and flipped two of its community hospitals to PE companies that debt-loaded them and took them through bankruptcy to shed that debt).\n As the Sacklers planned their blowoff, they consulted with both PE companies (for tips on spinning off profitable units to put them out of creditors&#39; reach, and advice on cashing in on the epidemic they started with addiction treatment businesses), and McKinsey.\n All of this criming did not escape Elisabeth Warren&#39;s notice, who used it as occasion to launch one of her signature 2019 election campaign plans, the Stop Wall Street Looting Act (SWSLA), which drew outraged squeals from the PE industry.\n For all its detail, the SWSLA would not have prevented the Sacklers&#39; crimes – nor would it stop the copycats at blue chip firms like Johnson and Johnson and Apple, who have used their tactics to perfect what Tkacik calls &#34;legalized embezzlement.&#34;\n It really looks like the Sacklers will keep billions, and like Judge Drain will continue to hear cases like theirs. But Warren learned from 2019, and has introduced new, stronger legislation, the Nondebtor Release Prohibition Act, which would block deals like this for good.\n   Simone Biles is a survivor of Larry Nasser&#39;s abuse. The claims of Nasser&#39;s survivors were wiped out by a bankruptcy judge.\n      The internet age has certainly transformed journalism; these days we mostly think about investigative journalism&#39;s decline, but there are digital investigative outlets that shine like diamonds.\n  Propublica&#39;s Justin Elliott and Paul Kiel wrote a series of blockbuster stories about the monopolist Intuit, a business organized as a cult around its then-CEO Brad Smith, engaged in decades&#39; worth of dirty tricks to kill free, IRS tax-prep services.\n  Not only did they stay with this story for months on end, digging up incredible stories of corruption, they also shamed the IRS and spurred state AGs into investigating the company.\n Then a funny thing happened: Intuit customer service whistleblower revealed  another scandal, one that sprawled outside of Intuit and spilled over into the world&#39;s largest blue-chip companies from Disney to Airbnb to Comcast and more.\n That was the story of Arise, yet another cult-like business that you have almost certainly interacted with, without knowing it.\n On its surface, Arise is an outsource customer service company. Other businesses pay it to staff their phones and answer customer queries.\n But Arise is many other things. For one thing, it&#39;s a pyramid scheme: the people who work for it – disproportionately Black women – are not classed as employees, but as &#34;contractors.&#34; They are paid for recruiting their friends to work for it.\n  That might sound like a nice way to help a business staff its call-centers, but you need to understand that Arise has no call centers  or staff – its workers take calls from their homes.\n  If you want to work for Arise, you have to pay them for the privilege. Not only do you have to buy a computer and phone, you have to pay to get trained for each firm whose calls you&#39;ll be taking.\n  Believe it or not, those are the  best parts of working for Arise. When you are an Arise worker, you can be terminated without notice or cause – forfeiting the money and time you spent for training and equipment. You can get fired by Arise itself, or by any of its customers.\n Reps from Arise and its customers listen in on your calls. If your children make noise in the background, you can lose everything. Same if your neighbor&#39;s dog starts barking. Forget about running a fan or air conditioner – the noise is &#34;unprofessional.&#34;\n The Arise story prompted outrage from the public – and it sent Propublica&#39;s investigators deeper into the story. They documented how the Department of Labor knew about Arise&#39;s illegal and abusive conduct, and let them get away with it for years.\n  And here&#39;s the most amazing part: Propublica never stopped reporting on this story. This month, Ariana Tobin, Ken Armstrong and Justin Elliott worked with Brooke Stephenson to tell Arise workers&#39; stories in their own words.\n  These stories reveal Arise&#39;s lies about its working conditions, as workers describe how they were unequivocally ordered  never to hang up on customers, even in the face of death and rape threats, racist abuse, and sexual harassment.\n Arise may tell regulators and reporters that its workers are empowered to hang up the phone if the man on the other end is masturbating, but the women who endure this abuse tell a very different story:\n  The writers connect Arise&#39;s working conditions with the promises made by temp agencies for generations – companies like &#34;Kelly Girl,&#34; who promised a disposable, attractive, pliable and hardworking woman whom a company could work like a government mule and then discard.\n Arise preys on the economically precarious and traps their whole families into literal conspiracies of silence, as spouses and children tiptoe around their homes to spare their mothers the economic catastrophe of being summarily fired.\n The powerful words of the women answering these calls are a reminder of the human cost of systemic racism and sexism, and the willingness of the world&#39;s largest companies to exploit it.\n While this is a systemic problem, there are ways you can individually help the people you speak to, beyond being courteous and decent and understanding (this being the minimum we all owe one another).\n I. Complete the end-of-call survey. Workers can get fired and lose their investment in equipment and training if the people they help don&#39;t do this.\n II. After text-based service interactions, reply &#34;No thank you,&#34; after the rep asks &#34;is there anything else I can help you with?&#34; Workers are punished if you close your browser without answering this question.\n III. Be organized with all relevant information in hand before you call. Workers are penalized for calls that last too long – even if the reason for the delay is that the caller took forever looking up a key piece of information.\n Yes, it&#39;s unfair that workers are penalized if you don&#39;t play along with Arise&#39;s idiotic customer service metrics, but the unfairness accrues disproportionately to workers, and you can shoulder some of that burden.\n I&#39;m grateful to Propublica for continuing to bring us this story – and doubly glad to be an annual donor to this charitable nonprofit.\n     Adding sensors to our computers revolutionized them. I remember buying my first computer paddles, my first mic, my first webcam, and the incredible new features unlocked by giving computers a way to sense and respond to the physical world.\n Today, our devices are stuffed with sensors to beggar the imagination. My latest phone has  four cameras, multiple mics, thermal sensors, and, of course, an accelerometer that lets the system measure how it&#39;s moving from moment to moment.\n Device security and privacy models treat cameras and mics as sensitive and control how apps access them, but accelerometers are treated as utilities, the kind of thing that apps should be able to tap into at will without risk to the user.\n  In &#34;Privacy Implications of Accelerometer Data: A Review of Possible Inferences,&#34; a trio of researchers from the Technical University of Berlin document the surprising ways in which acclerometer data can be used to infer sensitive facts about users.\n  Co-author Jacob Leon Kröger did a great job of breaking down the team&#39;s findings, and emphasizing the gap between device permission models and the kinds of wide-ranging inferences that accelerometers enable.\n  He cites &#34;patents and literature of diverse disciplines&#34; that reveal users&#39; &#34;daily routines, physical activities, social interactions, health condition, gender, age, and emotional state&#34; just by analyzing accelerometer data.\n The way you move has a sufficiently unique signature that accelerometers can identify you as the person carrying a device. The same techniques can infer your driving style, whether you are intoxicated, and, through dead reckoning, where you are – even without a GPS fix.\n Alarmingly, accelerometers can be repurposed as crude mics, translating sound vibrations into speech and keyword detection.\n Accelerometer analysis is imperfect and computationally intensive, but it&#39;s still worrying, especially in light of the lack of protection for accelerometer data in mobile OSes.\n The authors are skeptical that an &#34;informed consent&#34; model will fix this, in part because accelerometer data has a lot of nonobvious uses (correcting photo jitter, say), but also because of the well-theorized flaws in digital consent:\n  Kröger refers us to Sec 7 of another paper he co-authored on consent and privacy, &#34;The myth of individual control,&#34; for some theoretical ways of striking a balance between privacy and functionality.\n  This section rejects &#34;self-management&#34; of privacy settings as ineffective and proposes things like institutionally administered &#34;social impact assessments&#34; that evaluate &#34;the consequences of information use and misuse.&#34;\n Kröger admits &#34;that most existing ideas in this area are still vague and hypothetical&#34; and calls for &#34;urgent&#34; further research (that sounds right to me, too).\n He concludes by pointing out that there are many other potentially compromising inference techniques latent in all sensor data, and suggests his paper, &#34;Privacy Implications of Voice and Speech Analysis.&#34;\n     Back in 2019, visitors to the Universal Studios theme park in Florida started to post to social media about their experience with the RFID-chipped paper cups they got to use with the park&#39;s self-serve soda fountains:\n  Getting nickle-and-dimed in a themepark that charges whopping sums for admission is frustrating, sure, but as Daniel Danger wrote at the time, the noteworthy part was in the clumsy-yet-detailed way that this disciplinary technology was deployed.\n Not only did it impose all kinds of rules about how your &#34;unlimited&#34; cup could be used (you had to wait 120 seconds before refilling it, etc), but if you violated those rules, a &#34;robot voice&#34; barked a denial at you.\n It was Orwell-by-way-of-Gilliam – an absurd internet of shit dystopia moment at the fun park.\n The technology came from &#34;Validfill,&#34; who produced a spiffy and monumentally unself-aware video to boast about their system&#39;s use at Universal.\n  Corporate America never met a terrible idea it didn&#39;t love, which is how Validfill&#39;s creepy RFID-chipped cups have proliferated outside of the gates of Universal.\n I&#39;ve lost track of the number of people who&#39;ve forwarded @AnemoneAndMe&#39;s viral tweet about their encounter with it in the wild.\n  They call it &#34;anti homeless DRM,&#34; and not for nothing – one of the things these self-serve soda machines dispense is drinking water, often replacing public water fountains.\n Chipped cups enable companies like McDonald&#39;s to prevent homeless people – and other marginalized people who still need to drink water because all humans need to drink water – from drinking their water.\n Many of the people who&#39;ve tagged me to tell me about this latest sensation cited my story Unauthorized Bread, an internet-of-shit technothriller that features heroic acts of appliance jailbreaking:\n  Unauthorized Bread is a parable about disciplinary technology and the shitty technology adoption curve, whereby the worst technological ideas are normalized by applying them to people whose complaints aren&#39;t taken seriously – refugees, homeless people, prisoners, students.\n As these bad ideas are normalized, they travel up the privilege gradient, until they become ubiquitous – 20 years ago, if a CCTV observed your dinner hour, you were in a supermax prison. Today, it just means you bought home automation from Google, Apple or Amazon.\n I&#39;m both happy and sad about Unauthorized Bread. As a story, it&#39;s certainly given people a framework and vocabulary for talking about the proliferation of disciplinary technologies around them, and the unequal distribution of that terrible future.\n But honestly, it&#39;s a little demoralizing to see how often Unauthorized Bread is applicable to another ghastly technological idea. Cyberpunk is a warning, not a suggestion.\n      #20yrsago Declines in advertising in major magazines in the first six months of 2001  https://web.archive.org/web/20010714104017/https://ww\n......", "posttime": "2021-07-30 06:08:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "加速度计,accelerometer", "title": "使用加速度计签名跟踪您", "title_en": "Tracking You with Accelerometer Signatures", "transed": 1, "url": "https://pluralistic.net/2021/07/29/impunity-corrodes/#in-motion", "via": "", "real_tags": ["加速度计"]}, {"category": "", "categoryclass": "", "imagename": "d86b96a4d6cfd537c54dd35de9bc33fa.png", "infoid": 1070514, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "几个月来，Apple 和 Facebook 就 App Tracking Transparency 展开了一场公关战（并以法律为威胁），这是 iPhone iOS 软件最新版本的一种变化，通常会限制以广告为重点的应用程序和公司如何通过 iPhone 用户获利。 Facebook 最初对 App Tracking Transparency 效果的公开预测是灾难性的。但即使 App Tracking Transparency 在 Facebook 最近一个季度（2021 年第二季度）生效，该公司的广告收入仍然实现了巨大增长。 Facebook 的收入主要受苹果 iOS 变化破坏的广告类型的推动，第二季度同比增长 56%，超出了投资者的预期。该公司拥有 19 亿日活跃用户和 29 亿月活跃用户。它平均为每位用户赚取了 10.12 美元的收入。这是 Facebook 在一个季度内发布的第一份收益报告，该报告应显示应用跟踪透明度对公司利润的任何影响。 56% 的同比增长当然看起来不是世界末日，但首席财务官 David Wehner 告诉投资者，预计下一季度的情况会不那么乐观：我们继续预计 2021 年监管和平台变化带来的广告定位逆风会增加，尤其是最近的 iOS 更新，我们预计与第二季度相比，第三季度的影响更大。用户选择加入跟踪率的数据变化很大。一些公司认为这个数字仅为 4%，但其他公司则认为选择率高达 30% 左右。费率可能取决于相关应用程序。无论如何，选择加入的用户绝对不是大多数；大多数用户在收到提示时拒绝被跟踪。而每个这样做的用户对 Facebook 的价值要低得多，Facebook 利用每个用户的数据向广告商收取费用，向微目标用户和其他具有类似属性的人收取费用。虽然 Facebook 最初围绕 App Tracking Transparency 发出的信息是好斗的，但扎克伯格最近改变了态度。他开始争辩说，这种变化在某些方面甚至可能对 Facebook 有利。\n今天，扎克伯格将大部分时间花在描述他对“元宇宙”的愿景上，他已将其确定为公司的新方向。他将这一愿景描述为在我们的生活中加入一个混合现实层，通过它，人们可以在跨越地理障碍的同时以新的方式进行虚拟互动和社交。但苹果高管也概述了一个有点类似的长期愿景，尽管方法非常不同。通过迫使 Facebook 遵守不同的广告定位规则，苹果在未来的混合现实计算领域的任何一场战斗中都加强了与这家社交媒体公司的对抗。但至少在本季度，Facebook 似乎并没有因为最近的 iOS 变化而受到太大影响。", "note_en": "For months, Apple and Facebook  waged a PR war (with threats of a legal one) over App Tracking Transparency, a change in recent versions of the iPhone&#39;s iOS software that will often limit how advertising-focused apps and companies can monetize iPhone users.\n Facebook&#39;s original public predictions about App Tracking Transparency&#39;s effect were apocalyptic. But even though App Tracking Transparency took effect during Facebook&#39;s most recent quarter (Q2 of 2021), the company still posted huge ad revenue growth.\n Facebook&#39;s revenue, which is largely driven by the kinds of advertising that Apple&#39;s iOS change undermines,  grew 56 percent year-over-year in Q2, beating investor expectations. The company had 1.9 billion daily active users and 2.9 billion monthly active users. It earned $10.12 of revenue per user, on average.\n This was the first earnings report Facebook has delivered for a quarter that should show any effects of App Tracking Transparency on the company&#39;s bottom line. Fifty-six percent year-over-year growth certainly doesn&#39;t look apocalyptic, but CFO David Wehner told investors to expect a less rosy story in the next quarter:\n We continue to expect increased ad targeting headwinds in 2021 from regulatory and platform changes, notably the recent iOS updates, which we expect to have a greater impact in the third quarter compared to the second quarter.\n Data on user opt-in rates for tracking has varied quite a bit. Some firms put the figure at just  4 percent, but others place opt-in rates as high as around 30 percent. The rate likely depends on the app in question. In any case, users who opt in are definitely not the majority; most users are declining to be tracked when prompted. And each user who does is worth a lot less money to Facebook, which makes much of its money leveraging each user&#39;s data to charge advertisers money to microtarget users and others with similar attributes.\n    While Facebook&#39;s initial messaging around App Tracking Transparency was combative, Zuckerberg has changed his tune recently. He began to argue that the change  could even be good for Facebook in some ways.\n  Today, Zuckerberg is dedicating much of his time to describing his vision for the &#34;metaverse,&#34; which he has identified as the new direction for the company. He has described this vision as putting a mixed-reality layer on our lives through which people can interact and socialize with one another virtually in new ways while crossing geographic barriers. But Apple executives have also outlined a somewhat similar long-term vision, albeit with a very different approach. By forcing Facebook to play by different ad-targeting rules, Apple has strengthened its position against the social media company in any coming battle over a future mixed-reality computing landscape.\n But at least for this quarter, Facebook does not seem to be suffering too badly from the recent iOS change.", "posttime": "2021-07-30 05:29:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "facebook,广告,应用,app", "title": "忘记“应用跟踪透明度”：Facebook 的广告收入比以往任何时候都多", "title_en": "Forget “App Tracking Transparency”: Facebook is making more ad revenue than ever", "transed": 1, "url": "https://arstechnica.com/gadgets/2021/07/facebook-set-a-new-ad-revenue-record-despite-apples-ios-privacy-change/", "via": "", "real_tags": ["facebook", "广告", "应用", "app"]}, {"category": "", "categoryclass": "", "imagename": "fdea9e326f14511b68e413adb78618e9.jpg", "infoid": 1070513, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "但是，一旦美国消费者投资和交易应用程序开始允许投资者交易其股票，它们就急剧下跌，在其作为浮动股票上市的最初几个小时内下跌了 10% 以上。根据雅虎财经，Robinhood 在稍后的交易中收复了一些，但当日收盘价为每股 34.82 美元，下跌 8.37%。该公司在首次公开募股中出售了 55,000,000 股股票，产生了 21 亿美元的总收益，但如果其承销银行购买其可用期权，这一数字可能会上升。无论如何，该公司现在资本充足，可以根据自己的意愿规划未来。那么，为什么股价会下跌呢？鉴于去年我们在许多面向消费者的大品牌科技公司中看到的饥肠辘辘的愤怒，你可能会惊讶于 Robinhood 没有以 80% 或类似的方式收盘。毕竟，DoorDash 和 Airbnb 有过巨大的首次亮相。 Robinhood 将其 IPO 的很大一部分提供给自己的用户。或者，在实践中，Robinhood 通过以与大投资者相同的价格和准入级别向其投资者和交易员提供股票来减少早期的零售需求。这是个好主意。但通过这样做，Robinhood 可能降低了对其股票的未获服务的零售兴趣，也许会重塑其早期的供需曲线。或者，该公司关于其交易量可能会在 2021 年第二季度下降的警告吓跑了一些多头。无论如何，在 stonk 和 meme-stock 时代，Robinhood 的首次亮相有点令人困惑。随着公司股票站稳脚跟，我们更深入地了解投资者对其未来表现的看法。我们有更多关于公司首次亮相的消息，包括对公司首席财务官的采访笔记，关于其明天早上在 Extra Crunch 上的 IPO。", "note_en": "But once the U.S. consumer investing and trading app began to allow investors to trade its shares, they went down sharply, off more than 10% in the first hours of its life as a floating stock. Robinhood recovered some in later trading, but closed the day worth $34.82 per share, off 8.37%, per Yahoo Finance.\n The company sold 55,000,000 shares in its IPO, generating gross proceeds of $2.1 billion, though that figure may rise if its underwriting banks purchase their available options. Regardless, the company is now well-capitalized to chart its future according to its own wishes.\n  So, why did the stock go down? Given the hungry furor we’ve seen around many big-brand, consumer-facing tech companies in the last year, you might be surprised that Robinhood didn’t close the day up 80%, or something similar. After all, DoorDash and Airbnb  had huge  debuts.\n  Robinhood made a big chunk of its IPO available to its own users. Or, in practice, Robinhood curtailed early retail demand by offering its investors and traders shares at the same price and level of access that big investors were given. It’s a neat idea. But by doing so, Robinhood may have lowered  unserved retail interest in its shares, perhaps reshaping its early supply/demand curve.\n Or maybe the company’s warnings that its trading volumes could decline in Q2 2021 scared off some bulls.\n Regardless, in the stonk and meme-stock era, Robinhood’s somewhat downward debut is a bit of a puzzler. More as the company’s stock finds its footing and we dig more deeply into investor sentiment regarding its future performance.\n We have more coming on the company’s debut, including notes from an interview with the company’s CFO about its IPO coming tomorrow morning on  Extra Crunch.", "posttime": "2021-07-30 05:29:01", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "交易,股票,stock,robinhood", "title": "Robinhood 的股票在首日交易中下跌 8%", "title_en": "\n\t\t\t\tRobinhood’s stock drops 8% in its first day’s trading\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/29/robinhoods-stock-drops-8-in-its-first-days-trading/", "via": "", "real_tags": ["交易", "股票", "stock", "robinhood"]}, {"category": "", "categoryclass": "", "imagename": "21b00ab37b4d01706b379e87a9fc6fbe.jpg", "infoid": 1070512, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在 Pinterest 宣布之前，华尔街预计收入为 5.623 亿美元，每股收益为 0.133 美元，高于去年同期的每股亏损 0.70 美元。但是，尽管 Pinterest 实现了财务业绩，但该公司在用户增长方面的挣扎导致股价暴跌。在大流行初期，图片钉板和购物灵感网站最初受益于参与度和用户增长的增加，但由于 Covid-19 限制的放宽，这两者在 2021 年第一季度都放缓，随后股价下跌了在公布第一季度收益后超过 10%。今天，在公布收益后不久，该股在盘后交易中下跌了 12% 以上。 Pinterest 在财报电话会议上预先解决了有关用户增长的问题，再次将使用量下降归咎于 COVID 大流行。 Pinterest 首席执行官本·西尔伯曼 (Ben Silbermann) 解释说：“大流行是史无前例的独特全球事件。” “在过去的财报电话会议中，我们谈到了居家订单如何显着增加 Pinterest 的使用率。在过去的一年中，我们强调了人们如何在如此困难的时期来到 Pinterest 寻求灵感，以重塑他们的生活，”他继续说道。 “现在，随着世界的开放，我们看到了影响我们增长的相反方向的类似影响——特别是因为我们在平台上看到的一些核心用例在 2021 年比一年前少见。第二季度的这种转变行为会影响参与度，”西尔伯曼说。该公司还指出，截至 2021 年 7 月 27 日，其在美国的月活跃用户下降了约 7%，而全球月活跃用户同比增长了约 5%。\nPinterest 表示，与来自移动应用程序的用户相比，其网络用户的参与度和收入往往较低。在第二季度，其移动应用程序的月活跃用户在美国和国际上同比增长超过 20%。该公司在用户增长和参与方面的问题表明 Pinterest 迎合创作者行业的计划对公司的未来至关重要。最近，该公司推出了视频优先的 Idea Pins，允许创作者展示他们的工艺、食谱、时尚、美容教程、项目或其他任何东西。本周，Pinterest 推出了新功能，现在可以让创作者从这些图钉中赚钱。尽管存在用户增长问题，但广告支出的回报导致第一季度收入同比增长 78%，该公司预计第二季度收入同比增长将达到 105%。今天，它报告了 125% 的收入增长——高于 Snap 在其创纪录的第二季度报告的 116%——这一数字 Pinterest 将这一数字归因于广告商的回报。", "note_en": "Ahead of Pinterest’s announcement, Wall St. had  forecast revenue of $562.3 million and earnings of $0.133 per share, up from a loss of $0.70 per share from the same quarter last year.\n But while Pinterest delivered on financials, the company’s struggles with user growth sent the stock tumbling.\n  The image pinboard and shopping inspiration site had initially benefitted from increased engagement and user growth during the early days of the pandemic, but both  slowed in the first quarter of 2021 due the easing of Covid-19 restrictions, which had then sent the stock down by more than 10% after its first quarter earnings were posted.\n Today, the stock  was down more than 12% in after-hours trading, shortly after earnings were announced.\n Pinterest addressed the issues around user growth upfront on the earnings call, again blaming the COVID pandemic for declines in usage.\n “The pandemic was an unprecedented and unique global event,” explained Pinterest CEO Ben Silbermann. “In past earnings calls, we talked about how stay-at-home orders significantly increased usage of Pinterest. And for the past year, we’ve highlighted how people came to Pinterest for inspiration to reinvent their lives during such a difficult time,” he continued. “Now, as the world opens up, we’re seeing the similar effect in the opposite direction that impacted our growth — particularly because some of the core use cases we see on our platform are less common in 2021 than they were a year ago. That shifting behavior in Q2 impacts engagement,” Silbermann said.\n The company also noted that, as of July 27, 2021, its monthly active users in the U.S. had declined by approximately 7%, while global monthly active users gained approximately 5% year-over-year.\n Pinterest said its web users tend to be less engaged and generate less revenue than those who come from mobile apps. In the second quarter, its monthly active users on mobile apps grew in U.S. and internationally, year-over-year, by more than 20%.\n The company’s issues with user growth and engagement indicate just how critical Pinterest’s plan to cater to the creator industry is the company’s future. Recently, the company  launched video-first Idea Pins that allow creators to showcase their crafts, recipes, fashion, beauty tutorials, projects or anything else. This week,  Pinterest introduced new features that will now allow creators to make money from those pins.\n Despite user growth issues, the return of ad spending led to year-over-year revenue growth of 78% in the first quarter, and the company  predicted it would see even higher 105% year-over-year revenue growth in Q2. Today, it reported 125% revenue growth — above with the 116% Snap reported in its  record second quarter — a figure Pinterest attributed to advertisers’ return.", "posttime": "2021-07-30 05:28:44", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "股价,shares,pinterest", "title": "Pinterest 股价下跌，因为公司错过了用户增长……再次", "title_en": "\n\t\t\t\tPinterest shares drop as company misses on user growth…again\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/29/pinterest-shares-drop-as-company-misses-on-user-growth-again/", "via": "", "real_tags": ["股价", "shares", "pinterest"]}, {"category": "", "categoryclass": "", "imagename": "9ad8278a3b946f7b01ebc6e85d69bd4e.jpg", "infoid": 1070511, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Prashant Pandey 是 Asana 的工程主管，Asana 是领先的团队工作管理平台。在加入 Asana 之前，Prashant 开始并领导湾区团队构建 Amazon DynamoDB，这是一项完全托管的 NoSQL 数据库服务。以下是有关如何推进公司基础架构以支持最大客户并与他们一起发展的四个技巧。如果您正在构建 SaaS，那么您很有可能持有非常重要的客户数据。无论您构建什么，这都会使您成为攻击客户的威胁媒介。虽然安全性对所有客户都很重要，但随着客户的增长，风险肯定会更高。考虑到风险，构建基础设施、产品和流程来满足客户不断增长的安全性和可靠性需求至关重要。这包括您必须承担的道德和道德义务，以确保您的系统和实践符合并超越您向客户提出的关于安全性和可靠性的任何要求。关于正常运行时间的正式 SLA：如果您正在构建 SaaS，客户希望它始终可用。将您的软件用于关键任务应用程序的大客户希望在合同中看到正式的 SLA，承诺正常运行时间为 99.9% 或更高。在构建基础架构和产品层时，您需要对正常运行时间充满信心，并能够根据每个客户来衡量正常运行时间，以便了解自己是否履行了合同义务。您平台的实时状态：大多数大客户都希望看到您平台的历史正常运行时间，并在事件和事件发生时实时了解它们。随着您的成熟和专业化，为客户创造这种可见性也会推动您的客户运营和基础架构团队之间的更多协作。这种合作对投资很有价值，因为它提供了有关客户如何体验您的服务中特定降级的见解，并允许您反馈您目前发现的内容以及您的预计到达时间。备份：随着您的客户的增长，对备份的期望做好准备——不仅是恢复整个应用程序需要多长时间，还包括备份周期、备份位置和数据保留（例如，您是否坚持数据太长？）。如果您正在制定备份策略，考虑未来围绕备份管理的灵活性将帮助您领先于这些要求。", "note_en": "Prashant Pandey is the head of engineering at  Asana, a leading work management platform for teams. Prior to Asana, Prashant started and led the Bay Area team building Amazon DynamoDB, a fully managed NoSQL database service.\n  Below are four tips on how to advance your company’s infrastructure to support and grow with your largest customers.\n  If you’re building SaaS, odds are you’re holding very important customer data. Regardless of what you build, that makes you a threat vector for attacks on your customers. While security is important for all customers, the stakes certainly get higher the larger they grow.\n Given the stakes, it’s paramount to build infrastructure, products and processes that address your customers’ growing security and reliability needs. That includes the ethical and moral obligation you have to make sure your systems and practices meet and exceed any claim you make about security and reliability to your customers.\n  Formal SLAs around uptime: If you’re building SaaS, customers expect it to be available all the time. Large customers using your software for mission-critical applications will expect to see formal SLAs in contracts committing to 99.9% uptime or higher. As you build infrastructure and product layers, you need to be confident in your uptime and be able to measure uptime on a per customer basis so you know if you’re meeting your contractual obligations.\n  Real-time status of your platform: Most larger customers will expect to see your platform’s historical uptime and have real-time visibility into events and incidents as they happen. As you mature and specialize, creating this visibility for customers also drives more collaboration between your customer operations and infrastructure teams. This collaboration is valuable to invest in, as it provides insights into how customers are experiencing a particular degradation in your service and allows for you to communicate back what you found so far and what your ETA is.\n Backups: As your customers grow, be prepared for expectations around backups — not just in terms of how long it takes to recover the whole application, but also around backup periodicity, location of your backups and data retention (e.g., are you holding on to the data too long?). If you’re building your backup strategy, thinking about future flexibility around backup management will help you stay ahead of these asks.", "posttime": "2021-07-30 05:28:29", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "初创,areas,客户", "title": "SaaS 初创公司必须解决的 4 个关键领域才能为企业扩展基础架构", "title_en": "\n\t\t\t\t4 key areas SaaS startups must address to scale infrastructure for the enterprise\t\t\t", "transed": 1, "url": "https://techcrunch.com/2021/07/29/4-key-areas-saas-startups-must-address-to-scale-infrastructure-for-the-enterprise/", "via": "", "real_tags": ["初创", "areas", "客户"]}, {"category": "", "categoryclass": "", "imagename": "f2b9030f9f1ac7b1c3c900c7f278e54f.jpeg", "infoid": 1070509, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Pinterest 股价在周四盘后交易中下跌超过 17%，此前该公司公布了第二季度业绩，显示月度用户数量下降。与分析师的预期相比，该公司在第二季度的表现如下：Pinterest 的月活跃用户数为 4.54 亿，比公司 4 月份报告的 4.78 亿下降了 5% 以上。该公司表示，截至 7 月 27 日，其美国 MAU 下降了约 7%，而全球 MAU 同比增长约 5%。社交媒体市场的其他人也在努力满足用户增长预期。 Twitter 上周的表现略低于其可获利的每日活跃用户预期。 Facebook 周三符合 DAU 预期，但略低于 MAU 预期。然而，Snap 上周的 DAU 预期超出了预期。 Pinterest 将其用户减少归因于 2020 年的使用量激增，因为 Covid-19 大流行导致人们被困在家里。 “然而，自 3 月中旬以来，我们认为 Pinterest 的参与度低得不成比例，因为人们开始花更多时间与家外的朋友社交、在餐馆吃饭，以及通常参与不是我们核心用例的活动，”该公司表示在致股东的信中。该公司报告该季度的收入为 6.13 亿美元，同比增长超过 125%。 Pinterest 还公布了 6940 万美元的净收入。一年前，该公司报告净亏损超过 1.007 亿美元。\nPinterest 还提供了第三季度收入同比增长“在 40 多岁以下”的估计。这大致符合 Refinitiv 对下一季度收入同比增长 42.8% 的预期。但是，由于 Covid-19 变体的未知影响，该公司拒绝提供第三季度 MAU 指导。该公司在一份声明中表示：“ COVID-19 大流行的演变和相关限制仍然未知，鉴于我们对某些关键的参与驱动因素缺乏了解，我们没有提供关于 2021 年第三季度 MAU 的指导。”", "note_en": "Pinterest shares fell more than 17% in after-hours trading Thursday after the company reported its  second-quarter results, which showed a decline in monthly users.\n Here&#39;s how the company fared in the second quarter, relative to what analysts were expecting:\n   Pinterest posted 454 million monthly active users, down more than 5% from the 478 million the company  reported in April. The company said that, as of July 27, its U.S. MAUs have declined by approximately 7%, while global MAUs have grown approximately 5% year-to-year.\n Others in the social media market also struggled to meet user growth expectations.  Twitter last week  came in just shy of its monetizable daily active user expectations.  Facebook on Wednesday  matched DAU expectations, while falling just shy of MAU expectations.  Snap last week, however, was able to  beat its DAU expectations.\n Pinterest attributed its decline in users due to a disproportionate bump in usage in 2020 as people were stuck at home as a result of the Covid-19 pandemic.\n &#34;Since mid-March, however, we believe engagement on Pinterest was disproportionately lower as people began spending more time socializing with friends outside their homes, eating in restaurants, and generally participating in activities that are not our core use cases,&#34; the company said in  a letter to shareholders.\n The company reported revenue of $613 million for the quarter, which was up more than 125% year over year. Pinterest also posted a net income of $69.4 million. A year ago, the company reported a net loss of more than $100.7 million.\n  Pinterest also provided a third-quarter revenue growth estimate &#34;in the low-40s&#34; on a year-to-year basis. That was approximately in line with Refinitiv expectations of 42.8% year-to-year revenue growth for the upcoming quarter.\n However, the company declined to provide Q3 MAU guidance due to the unknown impact of Covid-19 variants.\n &#34;The evolution of the COVID-19 pandemic and related restrictions remain unknown, and we are not providing guidance on Q3 2021 MAUs given our lack of visibility into certain key drivers of engagement,&#34; the company said in a statement.", "posttime": "2021-07-30 05:18:54", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "增长,misses", "title": "Pinterest 在第二季度未能实现用户增长，MAU 为 4.54 亿，而预期为 4.82 亿，因为收入超过了 6.13 亿美元，同比增长 125% 以上，而预期为 5.621 亿美元；下班后库存下降约 14%", "title_en": "Pinterest misses on user growth in Q2, with 454M MAUs vs. 482M est., as revenue beats, with $613M, up 125%+ YoY, vs. $562.1M est.; stock down ~14% after hours", "transed": 1, "url": "https://www.cnbc.com/2021/07/29/pinterest-pins-earnings-q2-2021.html", "via": "", "real_tags": ["增长", "misses"]}, {"category": "", "categoryclass": "", "imagename": "b70fd1ff402e16d6826534cb479d9949.jpg", "infoid": 1070508, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "公司第二季度净销售额为 1130 亿美元，增长 27%，但低于预期，令股价在尾盘下跌超过 5%。净利润为 78 亿美元，即每股 15.12 美元，高于 52 亿美元或 10.30 美元。订阅服务，包括与 Amazon Prime 会员相关的年费和月费，以及数字视频、有声读物、数字音乐、电子书和其他非 AWS 订阅服务，收入增长了 32%，达到 79 亿美元。 Prime - 为会员提供无限制的免费快速送货和亚马逊 Prime 流媒体访问 - 现已在 22 个国家/地区推出，最新加入的是葡萄牙。该公司的“其他”部门，主要包括广告服务的销售，飙升了 83%，这与 Snap、Twitter、谷歌和其他公司在本轮收益中看到的强劲数字广告趋势一致。这是创始人在今年早些时候担任执行主席后，CEO 掌舵电子商务巨头的第一个季度。该报告是在该公司宣布以 84.5 亿美元收购米高梅以加强其视频产品和扩展亚马逊 Prime 的交易之后发布的。 FTC 重新关注反垄断，正在密切审查该协议。该公司已呼吁 FTC 负责人 Lina Khan 回避审查，她过去曾就亚马逊的“反垄断难题”撰写过文章。去年 5 月宣布交易时，贝索斯称赞了 的内容库和 IP。今天亚马逊的收益新闻稿中没有提到它（众所周知的文件冗长且充斥着杂乱无章的信息），但计划在美国东部时间 5:30 召开电话会议。委员会还在调查亚马逊涉嫌使用第三方卖家数据开发自己的亚马逊品牌商品以与他们竞争。\n- Prime Video 为全球客户发布了新的亚马逊原创电影，包括由迈克尔·B·乔丹主演的汤姆·克兰西的《无悔》和由克里斯·普拉特主演的《明日战争》，这两部电影都是首映周末播放量第一的电影。 Prime 会员还享受了新的和回归的 Amazon Original 系列和特别节目，如 THEM、Solos、The Underground Railroad、Panic、Flack、Mary J. Blige 的 My Life 和 Prime Day Show，以及 Bosch 的第七季和最后一季，迄今为止运行时间最长的亚马逊原创系列。此外，Prime Video 在国际上首次推出了 20 多个本地原创作品，包括 Dom（巴西）、Chivas：El Rebaño Sagrado（墨西哥）、Clarkson&#39;s Farm（英国）、La Leyenda de Sergio Ramos（西班牙）、Mixte（法国）和 Head Above Water （澳大利亚）。 - 亚马逊获得了 20 项艾美奖提名，其中包括亚马逊工作室首次获得剧情类剧集（男孩们）和限定剧集（地下铁路）的类别提名。亚马逊还获得了电视电影类别的两项提名（弗兰克叔叔和西尔维的爱），以及写作（All In）、编舞（Savage X Fenty Show Vol. 2）、摄影（Small Axe）、视觉效果（Vikings）的提名、互动节目（欢迎来到 Blumhouse）和商业节目（Michael B. Jordan 的 Alexa 广告）。 -Prime Video 宣布与世界各地的体育联盟达成流媒体交易，包括： 2022 年开始的美国国家橄榄球联盟 (NFL) 周四夜间足球赛，比之前宣布的提前一年；每个赛季 16 场女篮 (WNBA) 比赛和专员杯冠军赛；英国的英超联赛；在巴西观看足球的 Premiere 频道；每个赛季在法国有 300 多场 Ligue 1 足球比赛。 Prime Video 还在全球范围内播放了有史以来第一场法网公开赛之夜比赛和澳大利亚游泳选拔赛。 -Peacock 是 NBCUniversal 的流媒体服务，现在可在 Fire TV 和 Fire 平板设备上使用。客户可以通过说“Alexa，打开 Peacock”来使用 Alexa 开始观看 Peacock。 -Prime Video 和 IMDb TV 宣布与 Universal Filmed Entertainment Group (UFEG) 达成一项独家多年许可协议。从 2022 年开始，Prime Video 将成为 UFEG 在美国的一系列真人电影的独家订阅视频合作伙伴，在影院上映后不久将把侏罗纪世界：统治、355 和救护车等电影带到 Prime Video。通过这笔交易，IMDb TV 将成为第一个获得主要演播室网络窗口的基于广告的流媒体服务，该窗口通常用于广播或有线网络。 -IMDb TV 宣布了 12 个原创剧集和开发项目，包括 Dick Wolf 的新半小时剧、Jeff Lewis 的家庭装修项目、乡村巨星 Luke Bryan 的纪录片系列以及 Clea DuVall 和 Tegan 以及 Sara Quin 的剧情片.在评论 Covid 对公司的影响时，Jassy 指出：“在过去的 18 个月中，我们的消费者业务被要求提供数量空前的物品，包括个人防护装备、食品和其他帮助世界各地社区的产品应对大流行的困难情况。”\n“与此同时，AWS 已帮助如此多的企业和政府保持业务连续性，随着越来越多的公司提出业务转型和迁移到云的计划，我们看到 AWS 的增长重新加速，”Jassy 说，他指的是亚马逊网络服务，他曾经经营的部门。 “感谢我们在世界各地的所有热情、创新、使命驱动的员工继续专注于为客户提供服务——我很高兴能与你们合作，为未来创造和建设。”", "note_en": "saw second quarter net sales of $113 billion, up 27% but below expectations, dinging the shares, which fell more than 5% in late trading. Net profit came in at a strong $7.8 billion, or $15.12 a share — up from $5.2 billion or $10.30.\n Subscriptions services, which includes annual and monthly fees associated with Amazon Prime memberships, as well as digital video, audiobook, digital music, e-book, and other non-AWS subscription services, grew revenue by 32% to $7.9 billion. Prime — which offers members unlimited free fast delivery and access to Amazon Prime streaming — is now available in 22 countries with the latest addition of Portugal.\n  The company’s “other” segment, which primarily includes sales of advertising services, surged 83%, in line with strong digital advertising trends seen in this earnings round at Snap, Twitter, Google and others.\n  This was CEO  ’s first quarter at the helm of the e-commerce giant after founder   stepped into the role of executive chairman earlier this year.\n  The report follows the company’s announcement of  a deal to buy MGM for $8.45 billion to bolster its video offering and expand Amazon Prime. The FTC, with a renewed focus on antitrust, is scrutinizing the agreement closely. The company has called for FTC chief Lina Khan, who has written in the past on Amazon’s “antitrust conundrum,” to recuse herself from the review.\n Bezos lauded  ’s content library and IP when the deal was announced in last May. There was no mention of it today in Amazon’s earnings press release (documents that are famously long and crowded with haphazard information) but a conference call is planned for 5:30 ET.\n The Commission is also probing Amazon for its alleged use of third-party seller data to develop its own Amazon-branded goods to compete with them.\n  -Prime Video released new Amazon Original movies for customers worldwide, including  Tom Clancy’s Without Remorse, starring Michael B. Jordan, and  The Tomorrow War, starring Chris Pratt, both of which were the No. 1 streamed movie on their opening weekends. Prime members also enjoyed new and returning Amazon Original series and specials such as  THEM,  Solos,  The Underground Railroad,  Panic,  Flack,  Mary J. Blige’s My Life, and the  Prime Day Show, as well as the seventh and final season of  Bosch, the longest-running Amazon Original series to date. Additionally, Prime Video debuted over 20 local originals internationally, including  Dom (Brazil),  Chivas: El Rebaño Sagrado (Mexico),  Clarkson’s Farm (UK),  La Leyenda de Sergio Ramos (Spain),  Mixte (France), and  Head Above Water (Australia).\n  -Amazon earned 20 Emmy Award nominations, including Amazon Studios’ first-ever category nominations for a drama series ( The Boys) and limited series ( The Underground Railroad). Amazon also received two nominations in the TV movie category ( Uncle Frank and  Sylvie’s Love), along with nominations for writing ( All In), choreography ( Savage X Fenty Show Vol. 2), cinematography ( Small Axe), visual effects ( Vikings), interactive program (Welcome to the Blumhouse), and commercial (Michael B. Jordan’s Alexa ad).\n -Prime Video announced streaming deals with sports leagues around the world, including: the National Football League (NFL)  Thursday Night Football beginning in 2022, a year earlier than previously announced; 16 Women’s National Basketball Association (WNBA) games per season and the Commissioner’s Cup Championship Game; the Premier League in the UK; the Premiere channel to watch soccer in Brazil; and 300+ Ligue 1 soccer matches per season in France. Prime Video also streamed the first-ever French Open night matches and the Australian Swimming Trials globally.\n -Peacock, NBCUniversal’s streaming service, is now available on Fire TV and Fire tablet devices. Customers can use Alexa to start watching Peacock by saying “Alexa, open Peacock.”\n -Prime Video and IMDb TV announced an exclusive, multi-year licensing deal with Universal Filmed Entertainment Group (UFEG). Beginning in 2022, Prime Video will be an exclusive subscription video partner for UFEG’s slate of live-action films in the U.S., bringing films such as  Jurassic World: Dominion,  The 355, and  Ambulance to Prime Video soon after theatrical release. With this deal, IMDb TV will be the first advertising-based streaming service to secure a major studio network window, which traditionally goes to broadcast or cable networks.\n -IMDb TV announced 12 original series and development projects including a new half-hour drama from Dick Wolf, a home renovation project with Jeff Lewis, a docu-series with country superstar Luke Bryan, and a dramedy from Clea DuVall and Tegan and Sara Quin.\n Commenting on the impact of Covid on the company, Jassy noted that, “Over the past 18 months, our consumer business has been called on to deliver an unprecedented number of items, including PPE, food, and other products that helped communities around the world cope with the difficult circumstances of the pandemic.”\n “At the same time, AWS has helped so many businesses and governments maintain business continuity, and we’ve seen AWS growth reaccelerate as more companies bring forward plans to transform their businesses and move to the cloud,” said Jassy, referring to Amazon Web Services, the division he used to run.\n “Thank you to all of our passionate, innovative, mission-driven employees around the world for continuing to stay focused on delivering for customers—I am very excited to work with you as we invent and build for the future.”", "posttime": "2021-07-30 05:18:34", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "amazon,亚马逊,广告,类别,revenue", "title": "亚马逊报告第二季度“其他”类别收入（主要涵盖其广告业务）为 7.9B 美元，同比增长 83%，订阅服务收入为 7.9B 美元，同比增长 28%", "title_en": "Amazon reports Q2 “other” category revenue, which mostly covers its ad business, of $7.9B, up 83% YoY, and subscription services revenue of $7.9B, up 28% YoY", "transed": 1, "url": "https://deadline.com/2021/07/amazon-earnings-mgm-andy-jassy-1234802552/", "via": "", "real_tags": ["amazon", "亚马逊", "广告", "类别", "revenue"]}, {"category": "", "categoryclass": "", "imagename": "2e34bcf72095fa9ac7a498f8848ff102.jpg", "infoid": 1070507, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "天文学团队在 2 年前捕捉到了潜伏在梅西耶 87 (M87) 星系中心的巨大黑洞的第一个特写镜头，现在已经放大了附近活动星系半人马座 A 中的第二个稍小的巨星. 事件视界望远镜 (EHT) 的最新图像应该有助于解决这样的问题，即这样的星系中心如何将大量物质聚集成强大的光束并将它们发射到数千光年的太空中。这些图像一起也支持了理论家的信念，即所有黑洞都以相同的方式运作，尽管它们的质量存在巨大差异。 “这真是太好了，”爱丁堡大学的天文学家菲利普·贝斯特谈到新的 EHT 图像时说。 “与这些喷流的先前图像相比，角分辨率令人惊讶。” EHT 将数十个广泛分布的无线电天线（从夏威夷到法国，从格陵兰到南极）合并成一个巨大的虚拟望远镜。通过同时将大量碟形物体指向一个天体，并用原子钟仔细地为每个碟形物体的数据打上时间戳，研究人员随后可以用大规模计算集群重新组装它——这个过程需要数年时间——以生成具有分辨率与单个地球大小的碟子一样清晰。一项挑战是同时获得 11 个不同天文台的观测时间，因此 EHT 每年仅运行几周；恶劣的天气和技术故障通常会进一步缩小该窗口。虚拟望远镜在 2017 年的同一观测活动中探测了半人马 A，该活动产生了现在著名的 M87 超大质量黑洞图像——2019 年科学年度突破。半人马 A 距离大约 1300 万光年，是其中之一。离地球最近的星系，在无线电波长下是明亮的。它也有明显的喷流在银盘上方和下方喷出物质，这是一个活跃的巨型黑洞的标志。马克斯普朗克射电天文学研究所的团队成员迈克尔詹森说：“我们想看看 EHT 可以提供的分辨率下喷流的样子。” “我们不知道会发生什么。”他和他的同事今天在《自然天文学》杂志上报告的结果是喷流如何从半人马座 A 的超大质量黑洞周围区域出现的详细图像，显示出与 EHT 的 M87 喷流图像在更小尺度上的显着相似性。其他望远镜在不同波长拍摄的半人马座 A 喷流图像显示的细节很少，但 EHT 图像显示喷流的中心较暗，两侧有两条明亮的条纹；贝斯特认为，喷流的边缘可能看起来很亮，因为它的外部区域与周围的气体和尘埃摩擦，使它们发光。天体物理学家并不完全了解星系核是如何驱动这些极其强大的喷泉的。一种理论认为，吸积盘，即螺旋进入黑洞的物质漩涡，会产生一个磁场，将一些物质聚集成喷射流。其他人则认为，这个磁场必须利用黑洞本身的旋转能量才能获得如此巨大的能量。对半人马座 A 的新观测并没有解决这个问题，但它们提供了线索。詹森说，图像显示喷流的平行边缘在靠近黑洞的地方变窄成锥形。他说，那个锥体的底部仍然很宽，这可能表明它来自吸积盘。 “还有待观察，”他说。\n圣约翰学院的理论天体物理学家吉姆·比尔 (Jim Beall) 表示，可能没有唯一的答案：黑洞的自转会拖曳下落物质最内部的稳定轨道，这反过来又会影响吸积盘的形状和为喷流提供动力的方式。 “这是一种共生关系，”他说。 “EHT 让我们靠近吸积盘。结果真的很漂亮。”半人马座 A 的照片也填补了黑洞观测中的尺寸空白。观察者研究了来自最大黑洞（包括 M87）的喷流的工作原理，该黑洞的质量是太阳质量的数十亿倍。他们还看到了来自小得多的黑洞的喷流，质量有几十个太阳。半人马座 A 的新视图，质量是太阳质量的 5500 万倍，看起来就像它越来越小的亲戚。这证实了黑洞本质上是简单物体的观点，仅由它们的质量、电荷和自旋来定义，因此具有大恒星质量的黑洞的行为应该与具有星系质量的黑洞没有区别。", "note_en": "The astronomy team that 2 years ago captured the first close-up of a giant black hole, lurking at the center of the galaxy Messier 87 (M87), has now zoomed in on a second, somewhat smaller giant in the nearby active galaxy Centaurus A. The Event Horizon Telescope’s (EHT’s) latest image should help resolve questions about how such galactic centers funnel huge amounts of matter into powerful beams and fire them thousands of light-years into space. Together the images also support theorists’ belief that all black holes operate the same way, despite huge variations in their masses.\n “This is really nice,” astronomer Philip Best of the University of Edinburgh says of the new EHT image. “The angular resolution is astonishing compared to previous images of these jets.”\n The EHT merges dozens of widely dispersed radio dishes, from Hawaii to France and from Greenland to the South Pole, into a huge virtual telescope. By pointing a large number of dishes at a celestial object at the same time and carefully time stamping the data from each one with an atomic clock, researchers can later reassemble it with massive computing clusters—a process that takes years—to produce an image with a resolution as sharp as that of a single Earth-size dish. One challenge is getting observing time on 11 different observatories simultaneously, so the EHT only operates for a few weeks each year; poor weather and technical glitches often further narrow that window.\n The virtual telescope probed Centaurus A during the same 2017 observing campaign that produced the  now-famous image of the supermassive black hole in M87— Science’s  Breakthrough of the Year for 2019. Centaurus A, about 13 million light-years away, is one of the closest galaxies to Earth that is bright at radio wavelengths. It also has obvious jets spewing matter above and below the galactic disk, a hallmark of an active giant black hole. “We wanted to see what the jet looked like at the resolution” EHT could offer, says team member Michael Janssen of the Max Planck Institute for Radio Astronomy. “We didn’t know what to expect.”\n    The result, which he and colleagues report today in  Nature Astronomy, was a  detailed image of how the jet emerges from the region around Centaurus A’s supermassive black hole, showing a remarkable similarity to EHT’s images of M87’s jet on a much smaller scale. Images of Centaurus A’s jets taken by other telescopes at different wavelengths revealed little detail, but the EHT images show the jet with a dark center flanked by two bright stripes; Best suggests the jet may appear bright around its edge because its outer regions rub against surrounding gas and dust, causing them to glow.\n Astrophysicists don’t fully understand how galactic nuclei drive these fantastically powerful fountains. One theory holds that an accretion disk, the swirling whirlpool of matter spiraling into the black hole, generates a magnetic field that funnels some of the matter into a jet. Others argue this magnetic field must tap into the rotational energy of the black hole itself to be able to achieve such colossal power.\n The new observations of Centaurus A don’t resolve that question, but they hold clues. Janssen says the images show that the remarkably parallel edges of the jet narrow into a cone close to the black hole. The base of that cone remains wide, he says, which might suggest it is coming from the accretion disk. “It remains to be seen,” he says.\n Theoretical astrophysicist Jim Beall of St. John’s College says there may be no single answer: The spin of the black hole drags on the innermost stable orbit of the infalling matter, which in turn affects how the accretion disk shapes and powers the jet. “It’s a symbiotic relationship,” he says. “The EHT takes us down close to the accretion disk. The results are really quite beautiful.”\n The pictures of Centaurus A also fill in a size gap in black hole observations. Observers have studied the workings of  jets coming from the very largest of black holes—including M87—weighing billions of times the mass of our Sun. They’ve also seen jets from much smaller black holes, with masses of a few tens of Suns. The new view of Centaurus A, at 55 million times the Sun’s mass, looks just like its bigger and smaller relatives. This confirms the idea that black holes are essentially simple objects, defined only by their mass, charge, and spin, so those with the mass of a large star should behave no differently from one with the mass of a galaxy.", "posttime": "2021-07-30 05:17:56", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "视界,horizon,黑洞", "title": "事件视界望远镜捕捉到第二个黑洞喷流的“美丽”图像", "title_en": "Event Horizon Telescope captures ‘beautiful’ images of second black hole’s jet", "transed": 1, "url": "https://www.sciencemag.org/news/2021/07/event-horizon-telescope-captures-beautiful-images-second-black-hole-s-jet", "via": "", "real_tags": ["视界", "horizon", "黑洞"]}, {"category": "", "categoryclass": "", "imagename": "5588370e1fb4327c643fcb34f7eb4434.jpg", "infoid": 1070505, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "蒲团推销员杰森·帕吉特 (Jason Padgett) 除了参加派对和追女孩外，对任何事情都不关心，然后一个决定性的夜晚永远改变了他。 BBC Future 为您带来了深入而严谨的故事，以帮助您应对当前的流行病，但我们知道您想阅读的不仅仅是这些。所以现在我们专门推出一个系列来帮助你逃脱。我们将在 Lockdown Longreads 中重新审视过去三年中最受欢迎的功能。从关于世界上最伟大的太空任务的故事到关于我们的猫是否真的爱我们的真相，将非法渔民绳之以法的史诗般的狩猎，以及让埋藏已久的第二次世界大战坦克复活的小团队，您将找到一切.你不会找到的是任何参考，嗯，你知道什么。享受。杰森·帕吉特 (Jason Padgett) 随处可见数学。即使像刷牙这样普通的事情也受数学支配——他打开水龙头，将牙刷浸入水中 16 次。 “我不知道为什么我喜欢完美的正方形，”他说。 “这不仅仅是一个完美的正方形，它是 2 的 4 或 4 次方，但我只是喜欢完美的正方形......我会自动对所有东西做那些事。” Padgett 痴迷于数学，理解如此复杂的概念，被称为天才。他当然具有手工绘制重复几何图案（称为分形）的罕见天赋。但这位来自阿拉斯加的前蒲团推销员并不总是对数字有办法。就在 17 年前，他在华盛顿州塔科马过着截然不同的生活。\n“我很肤浅，”他笑着说。 “生活围绕着女孩旋转，聚会、喝酒、宿醉醒来，然后出去追逐女孩，然后又去酒吧。” “我曾经说过‘数学很愚蠢，你怎么能在现实世界中使用它’？我认为这是一个聪明的声明。我真的相信了。”但在 2002 年 9 月 13 日星期五晚上，一切都变了。 （阅读更多关于为什么有些人会突然成为天才的信息）。在与朋友外出时，帕吉特在卡拉 OK 酒吧外遭到两名男子的袭击和抢劫。他们拿走了他已经破烂的皮夹克。他回忆说：“当第一个跑到我身后用力砸我的后脑勺时，我听到和感觉到这种低沉的砰砰声。” “我看到了这股白光，就像有人拍照一样。接下来我知道我跪在地上，一切都在旋转，我不知道我在哪里，也不知道我是如何到达那里的。” Padgett 摇摇晃晃地去了街对面的一家医院，在那里他被告知他有脑震荡，并且由于肠道一拳而导致肾脏流血。 “他们给了我一针止痛药，然后送我回家，”他回忆道。但是回到家后，帕吉特的行为迅速而戏剧性地发生了变化。他遭受了创伤性脑损伤，这会导致强迫症 - 强迫症。以杰森为例，他越来越害怕外面的世界，只会出门囤积食物。\n“我只记得在房子的所有窗户上钉了毯子和毛巾……我记得实际上使用了这种喷雾泡沫并将前门粘上。”强迫症让帕吉特不合理地害怕细菌，这对他的女儿产生了连锁反应，女儿会在与前伴侣的监护权谈判中和他在一起。 “当她过来时，我会痴迷地洗手和清洁，”他说。 “我想做的第一件事就是给她脱鞋，换上干净的衣服，洗手。”但是，当帕吉特因他的袭击而经历所有这些负面后果时，一些令人难以置信的事情也在发生。杰森看待事物的方式发生了变化。 “所有弯曲的东西看起来都有些像素化，”他解释道。 “从下水道流下来的水看起来不再是光滑、流动的东西，它看起来像这些小切线。”云也发生了同样的事情，阳光在树木和水坑之间流动。对帕吉特来说，这个世界本质上就像一个复古的电子游戏。看到他周围环境的这种截然不同的看法在帕吉特身上引起了矛盾的情绪。 “我很惊讶……很困惑。它很美，但同时也很可怕。”由于这些愿景，帕吉特开始思考与数学和物理有关的巨大问题。考虑到他当时像隐士一样的生活，当他在网上广泛阅读数学时，互联网成为了他宝贵的信息来源。\n他偶然发现了一个关于分形的网页，这引起了他的共鸣。这是一个困难的数学概念，从最基本的角度来说，它可以比作雪花。当您放大时，您会看到它由连接在一起的较小雪花组成，再次放大，这些雪花由较小的雪花组成，依此类推，直到无穷大。 Padgett 对这个概念很着迷，但直到有一天他的女儿问他电视是如何工作的，他才用语言来形容它。 “当你看着电视屏幕时，你看到一个圆圈，它真的不是一个圆圈，”他说。 “它是由长方形或正方形制成的，如果你仔细观察，圆的边缘实际上是一个锯齿形。你可以把这些像素切成两半，再把它们切成两半，你会越来越接近一个完美的圆，但你永远不会真正达到一个，因为你可以永远把像素切成两半，所以分辨率会变得更好，但你永远不会有一个完美的圆。” Padgett 觉得有必要进一步探索这个有趣的概念。于是，他开始画画。而且他一直在画。 “我实际上有一千张或更多的圆形、分形图，以及我能画的每一种形状。这是我能够有效地传达我所看到的东西的唯一方式。” Padgett 相信他的画“掌握着通向宇宙的钥匙”并且非常重要，以至于他需要随身携带它们。有一天，在一次罕见的外出旅行中，一个人找到了他，他注意到帕吉特的画，并告诉他这些画看起来很数学。\n“我试图根据普朗克长度（物理学家马克斯普朗克开发的一种微小测量单位）和量子黑洞来描述时空的离散结构，”帕吉特告诉他。原来这个人是个物理学家，认出了帕吉特画的高级数学。他敦促他上数学课，这让帕吉特进入了社区大学，在那里他开始学习描述他的痴迷所需的语言。在像隐士一样生活了三年半之后，上学改变了帕吉特的一切。他开始为他的强迫症寻求心理帮助，甚至遇到了后来成为他妻子的女人。但为什么他会以如此奇怪和不同的方式看待事物？为什么他的世界现在由几何形状和图形组成？诗意地，是电视再次为他提供了线索。 Padgett 看到一个人，一个所谓的学者，他拥有非凡的数字能力，并谈论了他对数字的看法。 “我总是说数学是形状而不是数字，那是我第一次听到除了我以外的任何人谈论数字的样子，”Padgett 说。他在互联网上搜索更多信息，并遇到了现在在迈阿密大学工作的认知神经科学家 Berit Brogaard。两人在电话里聊了几个小时，从这些谈话中，布罗加德假设帕吉特有联觉——本质上是大脑的交叉连接，其中感官混杂在一起。 （了解更多关于联觉的信息——以及它是否可以学习）。据估计，它仅影响约 4% 的人口。一些联觉者在听到音乐时可能会看到某些颜色，或者在感受到某种特定情绪时会闻到一些不存在的东西。\n这种情况是由其他人不存在的大脑部分之间的连接引起的。你可能是这样出生的，也可能是某种类型的创伤、损伤、中风、过敏反应，都可以改变大脑。 Brogaard 认为 Padgett 遭受​​的脑损伤导致他发展出一种联觉形式，在这种情况下，某些事物会在他的脑海中或投射在他的面前引发数学公式或几何形状的幻觉。她还假设通感使帕吉特成为后天学者。 “我们大多数人没有那种洞察力，因为我们没有将数学公式形象化，”布罗加德说。为了验证这些想法，布罗加德将帕吉特带到赫尔辛基阿尔托大学的大脑研究中心，在那里他接受了一系列大脑扫描。在核磁共振扫描仪中，数百个方程，包括假方程，在帕吉特眼前的屏幕上闪烁。研究人员随后观察了他大脑的哪些部分发出了反应。 Padgett 说：“他们发现我可以接触到我们无法有意识地接触到的大脑部分，而且视觉皮层正在与大脑中负责数学的部分协同工作，这显然是有道理的。” Brogaard 的假设被证明是正确的。 Padgett 被正式诊断出患有获得性学者综合征和一种联觉。终于，他有了答案。\n自从他确诊后，Padgett 出版了一本关于他的经历的书，名为 Struck by Genius，他周游世界，向人们讲述他的故事并教育他们有关数学的知识。他的目标是通过出版或制作电影来帮助那些拥有独特或罕见/有趣生活的人。他甚至出售他的分形图。尽管帕吉特确认了他们并提出指控，但在那个决定性的九月晚上袭击他的两个人从未被定罪。然而，多年后，其中一名男子布雷迪·西蒙斯 (Brady Simmons) 写信给帕吉特道歉，当时他因自杀未遂而接受处方药成瘾治疗。从某种意义上说，袭击发生后的几年里，两个人的生活发生了变化。 “我是一个完全不同的人，”西蒙斯说。 “当我回顾过去那个深不可测的人时，我只是不明白我是如何存在于那个层次上的。” “我到处都看到它[美]，”他说。他被大多数人甚至没有注意到的简单事物如落在水坑上的雨滴迷住了。通过帕吉特的眼睛，水坑变成了复杂的涟漪图案，重叠形成星星或雪花的形状。他希望其他人都能看到他所看到的。他说：“在现实甚至存在的任何时候，你都应该在绝对的惊奇中四处走动。” “我正在经历这种数学觉醒，我们周围的一切都是绝对的魔法，或者你可以接近魔法。”\n通过在 Facebook 上点赞我们，或在 Twitter 或 Instagram 上关注我们，加入一百万未来的粉丝。如果您喜欢这个故事，请注册每周 bbc.com 专题通讯，称为“基本清单”。从 BBC 未来、文化、工作生活和旅行中精心挑选的故事，每周五发送到您的收件箱。", "note_en": "Futon salesman Jason Padgett cared little about anything beyond partying and chasing girls, then one fateful night changed him forever.\n BBC Future has brought you in-depth and rigorous stories to help you navigate the  current pandemic, but we know that’s not all you want to read. So now we’re dedicating a series to help you escape. We’ll be revisiting our most popular features from the last three years in our   Lockdown Longreads .\n You’ll find everything from the story about the  world’s greatest space mission to the truth about whether  our cats really love us, the epic hunt to bring  illegal fishermen to justice and the small team which brings  long-buried World War Two tanks back to life. What you won’t find is any reference to, well, you-know-what. Enjoy.\n Jason Padgett sees maths everywhere. Even something as ordinary as brushing his teeth is governed by mathematics – he turns the tap on and dips his toothbrush into the water 16 times.\n “I don’t know why I like perfect squares,” he says. “It’s not just a perfect square, it’s two to the power of four or four squared but I just like perfect squares… I automatically do that stuff with everything.”\n Padgett is so obsessed with maths and understands such complex concepts, he&#39;s been called a genius. He certainly has a rare talent for drawing repeating geometric patterns – known as fractals – by hand.\n  But the former futon salesman from Alaska hasn’t always had a way with numbers. Just under 17 years ago he was living a very different life in Tacoma, Washington.\n “I was very shallow,” he laughs. “Life rotated around girls, partying, drinking, waking up with a hangover and then going out and chasing girls and going out to bars again.”\n  “I used to say ‘math is stupid, how can you use that in the real world’? And I thought that was like a smart statement. I really believed it.”\n But on the night of Friday 13 September 2002 everything changed.  (Read more about  why some people become sudden geniuses).\n While out with friends, Padgett was attacked and robbed by two men outside a karaoke bar. They took his already torn leather jacket.\n  “I heard as much as felt this deep, low-pitched thud as the first guy ran up behind me and smashed me in the back of the head,” he recalls. “And I saw this puff of white light just like someone took a picture. The next thing I knew I was on my knees and everything was spinning and I didn’t know where I was or how I got there.”\n Padgett staggered to a hospital across the street where he was told he had concussion and a bleeding kidney thanks to a punch to the gut. “They gave me a shot of pain medication and sent me home,” he remembers.\n But once home, Padgett’s behaviour changed quickly and dramatically. He had sustained a traumatic brain injury, which can bring on obsessive compulsive disorder - OCD. In Jason&#39;s case, he became increasingly afraid of the outside world and would only leave his house to stock up on food.\n “I just remember nailing blankets and towels over all the windows in the house… I remember actually using this spray foam and gluing the front door shut.”\n The OCD had made Padgett irrationally afraid of germs, which had a knock-on effect on his daughter who would come to stay with him amidst custody negotiations with his ex-partner.\n “When she would come over I would obsessively wash my hands and clean,” he says. “The very first thing I would want to do is get her shoes off, get her into clean clothes, wash her hands.”\n But while Padgett was experiencing all these negative consequences from his attack, something incredible was happening too. The way Jason was seeing things changed.\n  “Everything that was curved looked like it was slightly pixelated,” he explains. “Water coming down the drain didn’t look like it was a smooth, flowing thing anymore, it looked like these little tangent lines.”\n The same thing happened with clouds, sunlight streaming between trees and puddles. To Padgett, the world essentially looked like a retro video game. Seeing such a radically different view of his surroundings evoked conflicting emotions in Padgett. “I was surprised…confused. It was beautiful but it was also scary at the same time.”\n Because of these visions, Padgett began to think about huge questions in relation to mathematics and physics. Given his hermit-like existence at that time, the internet became a valuable source of information to him as he read extensively about mathematics online.\n  He stumbled across a webpage about fractals which struck a chord with him. It’s a difficult mathematical concept which, put at its most basic, can be likened to a snowflake. When you zoom in, you will see it’s made up of smaller snowflakes connected together, zoom in again and those snowflakes are made of smaller snowflakes, and so on until infinity.\n Padgett was fascinated by this concept but didn’t yet have the words to describe it until one day his daughter asked him how the TV worked.\n  “When you’re looking at a TV screen and you see a circle it’s really not a circle,” he says. “It’s made with rectangles or squares and, if you look close, the edge of the circle is really a zig zag. You can take those pixels and cut them in half and cut them in half and you get closer and closer to a perfect circle but you never actually reach one because you can keep cutting the pixels in half forever, so the resolution gets better but you never have a perfect circle.”\n Padgett felt compelled to explore this intriguing concept further. So, he began to draw. And he kept drawing.\n  “I had literally a thousand or more drawings of circles, fractals, every shape that I could manage to draw. It was the only way I could manage to communicate effectively what I was seeing.”\n Padgett believed his drawings “held the key to the universe” and were so important that he needed to take them everywhere with him.\n While on a rare trip out one day, he was approached by a man who had noticed Padgett with his drawings and told him they looked mathematical.\n  “I’m trying to describe the discrete structure of space time based on Planck length (a tiny unit of measurement developed by physicist Max Planck) and quantum black holes,” Padgett told him. It turned out the man was a physicist and recognised the high-level mathematics Padgett was drawing. He urged him to take a maths class, which led Padgett to enrol in a community college, where he began to learn the language he needed to describe his obsession.\n After three and a half years of living like a virtual hermit, going to school changed everything for Padgett. He started to get psychological help for his OCD and even met the woman who would become his wife.\n But why was he seeing things in such a strange and different way? Why was his world now comprised of geometric shapes and graphs?\n Poetically, it was television that again provided him with a clue. Padgett saw a man, a so-called savant, who had extraordinary numerical abilities and talked about what numbers looked like to him.\n  “I would always describe that math was shapes not numbers and that was the first time I’d heard anybody but me talk about what numbers looked like,” says Padgett.\n He scoured the internet for more information and came across Berit Brogaard, a cognitive neuroscientist now at the University of Miami. The pair spent hours talking on the phone and from these conversations, Brogaard hypothesised that Padgett had synaesthesia – essentially a cross-wiring of the brain in which the senses get mixed up.  (Find out more about  synaesthesia — and whether it can be learnt).\n  It is estimated to effect only around 4% of the population. Some synesthetes might see certain colours when they hear music or smell something that’s not there when feeling a particular emotion.\n The condition is caused by connections between parts of the brain that are not there in other people. You can be born this way or some type of trauma, an injury, a stroke, an allergic reaction, can change the brain.\n Brogaard believes the brain injury Padgett sustained caused him to develop a form of synaesthesia where certain things triggered visions of mathematical formulas or geometric shapes, either in his mind or projected in front of him. She also hypothesised that synaesthesia made Padgett an acquired savant.\n “Most of us don’t have that kind of insight because we don’t visualise mathematical formulas,” says Brogaard.\n  To test these ideas, Brogaard brought Padgett to the Brain Research Unit of Aalto University in Helsinki, where he underwent a series of brain scans.\n While in the MRI scanner, hundreds of equations, including fake ones, flashed on a screen in front of Padgett’s eyes. The researchers then watched which parts of his brain lit up in response.\n “They found that I had access to parts of the brain that we don’t have conscious access to and also the visual cortex was working in conjunction with the part of the brain that does mathematics, which obviously makes sense,” says Padgett.\n Brogaard’s hypotheses turned out to be true. Padgett was formally diagnosed with acquired savant syndrome and a form of synaesthesia. Finally, he had answers.\n Since his diagnosis, Padgett has published a book about his experience called  Struck by Genius, he’s toured the world telling people his story and educating them about maths. He is aiming to help others who have had unique or rare/interesting lives by getting their stories published or made into movies. He even sells his drawings of fractals.\n The two men who attacked him that fateful September night were never convicted despite Padgett identifying them and pressing charges.\n  Years later, however, one of the men, Brady Simmons, wrote to Padgett to apologise while he was undergoing treatment for prescription drug addiction following a suicide attempt. In a sense, two lives were changed in the years that followed the attack.\n  “I’m a completely different person,” says Simmons. “When I look back the abysmal person that I was in the past, I just don’t see how I existed on that level.”\n  “I see it [beauty] everywhere,” he says. He is mesmerised by simple things that most people don’t even notice such as raindrops falling on a puddle.\n Through Padgett’s eyes, the puddle is transformed into complex rippling patterns, overlapping and forming shapes like stars or snowflakes. And he wants everyone else to see what he sees.\n “You should be walking around in absolute amazement at all times that reality even exists,” he says. “I’m having this mathematical awakening and all around us is absolute magic or about as close as you can get to magic.”\n  Join one million Future fans by liking us on    Facebook , or follow us on    Twitter  or     Instagram .\n If you liked this story,    sign up for the weekly bbc.com features newsletter , called “The Essential List”. A handpicked selection of stories from BBC Future, Culture, Worklife, and Travel, delivered to your inbox every Friday.", "posttime": "2021-07-30 05:16:55", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "变成,attack,帕吉特", "title": "将一个人变成数学天才的暴力袭击", "title_en": "The violent attack that turned a man into a maths genius", "transed": 1, "url": "https://www.bbc.com/future/article/20190411-the-violent-attack-that-turned-a-man-into-a-maths-genius", "via": "", "real_tags": ["变成", "attack", "帕吉特"]}, {"category": "", "categoryclass": "", "imagename": "f66716aef55b147a42c26023a572e44f.png", "infoid": 1070504, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "要申请，请将您的简历（或 LinkedIn 个人资料）发送给我们，并在电子邮件中添加几行内容，解释为什么您会成为这个职位的合适人选，请发送至careers@up.codes。产品经理 Fullstack 工程师 内容经理 注意：我们的远程职位仅限于 UTC-8 到 UTC-3（基本上是北美和南美）。 UpCodes 正在寻找我们的第一位产品经理来定义和实施我们的产品流程。此人将与 CEO 密切合作，制定具体的路线图，帮助我们实现愿景。由于我们的空间中不存在类似的工具，因此一个关键的挑战是决定构建什么以及如何构建。我们在一个不断发展的高度复杂的行业中运营，因此理想的候选人喜欢掌握新领域、与用户交谈以及将复杂的想法转化为简单、明智的解决方案。 UpCodes 最具挑战性的任务之一是决定构建什么以及如何构建。我们在一个高度复杂且不透明的领域（3D 中的规则会随着时间和地点的变化而变化）中运作，因此我们需要一个能够解决复杂性、与用户交谈并提出明智、简单的想法的人。对于我们的第一个产品经理，我们需要一个能够进行战略性思考并且不怕弄脏自己的手的人。您将与我们的用户和工程团队密切合作，创建假设、测试您的假设并制定规范。鉴于决定构建什么和解决细节是我们最艰巨的挑战之一，您会发现我们有一个非常开放的环境，我们鼓励许多利益相关者进行辩论和投入。通过大量用户访谈和研究深入了解我们的行业，并以此为基础提供高级见解以及磨练新功能的细节与设计师和主题专家合作，为新功能，收集有关它们的内部/外部反馈并进行迭代 以合乎逻辑、结构良好的方式与我们的团队沟通和调整新功能的战略和基本原理 管理复杂产品的经验，以结构化的方式提出解决方案，使用用户反馈和数据 作为我们工程团队的基础成员，您将参与我们网络产品功能的端到端开发，从架构一直到支持。我们经常发布新功能，并与我们的市场保持密切联系。您必须愿意亲自动手（并学习）整个堆栈中的所有内容：API 设计、前端、后端、数据工程、算法、启动工程、分析、错误报告等。创建一个工具，让专家编写公式来识别建筑规范部分何时适用于用户的建筑，以便我们可以帮助他们找到相关信息 在建筑规范部分创建 Rap Genius 风格的注释，以创建更具交互性的用户体验\n编写算法来检测和显​​示代码版本如何随时间变化，以便用户了解法规如何演变", "note_en": "To apply, send us your resume (or LinkedIn profile) with a couple lines in the email that explain why you’d be the right person for the opportunity at careers@up.codes.     Product Manager   Fullstack Engineer   Content Manager     Note: our remote positions are limited to UTC-8 to UTC-3 (basically North and South America).\n  UpCodes is looking for our first product manager to define and operationalize our Product process. This person will partner closely with the CEO to build a concrete roadmap to help us achieve our vision.     Since no similar tools exist in our space, a key challenge is deciding what to build and how to do it. We operate in a highly complex industry that’s constantly evolving, so the ideal candidate enjoys mastering new domains, talking with users, and translating complex ideas into simple, sensible solutions.     One of the most challenging tasks at UpCodes is deciding what to build and exactly how to do it. We operate in a highly complex and opaque domain (regulations that are in 3D and change across time and location), so we need someone who can wrangle complexity, talk with users, and come up with sensible, simple ideas. For our first product manager, we need someone who can think strategically and isn&#39;t afraid to get their hands dirty.     You will work closely with our users and engineering team to create hypotheses, test your assumptions, and develop specs. Given that deciding what to build and ironing out the details is one of our toughest challenges, you&#39;ll find that we have a very open environment where we encourage debate and input from lots of stakeholders.    Gain a deep understanding of our industry through lots of user interviews and research, and use this to inform both high-level insights as well as honing the nitty-gritty details of new features\n  Work with designers and subject matter experts to create specs/mocks for new features, gather internal/external feedback on them and iterate\n        Communicate and align our team with the strategy and rationale for new features in a logical, well-structured way\n    Experience with managing a complex product, coming up with solutions in a structured way, using user feedback and data\n  As a foundational member of our engineering team, you&#39;ll be involved in end-to-end development on features across our web product, from architecture all the way to support. We have a frequent cadence of shipping new features and a close connection to our market.    You&#39;ll have to be willing to get your hands dirty with (and learn) everything across the stack: API design, frontend, backend, data engineering, algorithms, startup engineering, analytics, bug reporting, etc.            Create a tool that allows experts to write formulas to identify when a building code section applies for a user&#39;s building, so we can help them find relevant information\n  Create Rap Genius-style annotations on sections of building code, to create a more interactive user experience\n  Write algorithms to detect and display how versions of a code have changed through time, so users understand how regulations how evolved", "posttime": "2021-07-30 05:16:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hiring", "title": "UpCodes 正在聘请我们的第一位 PM 来为架构师自动化合规性", "title_en": "UpCodes is hiring our first PM to automate compliance for architects", "transed": 1, "url": "https://up.codes/careers#product_manager", "via": "", "real_tags": ["hiring"]}, {"category": "", "categoryclass": "", "imagename": "3d438c1f6954aa586516b67d6787e757.png", "infoid": 1070503, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "根据 NSO 在一项正在进行的诉讼中提交的特别法庭文件，Facebook 代表与有争议的监控供应商 NSO Group 接洽，试图购买一种可以帮助 Facebook 更好地监控其部分用户的工具。 Facebook 目前正在起诉 NSO，因为这家黑客公司如何利用 WhatsApp 中的漏洞帮助政府黑客入侵用户。 NSO 销售一种名为 Pegasus 的产品，它允许操作员远程感染手机并从中提取数据。根据 NSO 首席执行官 Shalev Hulio 的声明，两名 Facebook 代表于 2017 年 10 月与 NSO 接洽，要求购买 Pegasus 某些功能的使用权。当时，Facebook 正处于部署名为 Onavo Protect 的 VPN 产品的早期阶段，在某些用户不知情的情况下，该产品会分析下载该产品的用户的网络流量，以查看他们使用的其他应用程序。根据法庭文件，Facebook 的代表似乎对购买 Pegasus 的一部分作为远程入侵手机的黑客工具不感兴趣，而是作为一种更有效地监控已经安装了 Onavo 的用户的手机的一种方式。你为 NSO 或 Facebook 工作，还是曾经？我们很乐意听取您的意见。使用非工作电话或计算机，您可以通过 +44 20 8133 5190 的 Signal 安全联系 Joseph Cox，josephcox 的 Wickr，jfcox@jabber.ccc.de 的 OTR 聊天", "note_en": "Facebook representatives approached  controversial surveillance vendor NSO Group to try and buy a tool that could help Facebook better monitor a subset of its users, according to an extraordinary court filing from NSO in an ongoing lawsuit.\n  Facebook is currently suing NSO for how the hacking firm leveraged a vulnerability in WhatsApp to help governments hack users. NSO sells a product called Pegasus, which allows operators to remotely infect cell phones and lift data from them.\n    According to  a declaration from NSO CEO Shalev Hulio, two Facebook representatives approached NSO in October 2017 and asked to purchase the right to use certain capabilities of Pegasus.\n  At the time, Facebook was in the early stages of deploying a VPN product called Onavo Protect, which, unbeknownst to some users,  analyzed the web traffic of users who downloaded it to see what other apps they were using. According to the court documents, it seems the Facebook representatives were not interested in buying parts of Pegasus as a hacking tool to remotely break into phones, but more as a way to more effectively monitor phones of users who had already installed Onavo.\n Do you work for NSO or Facebook, or used to? We’d love to hear from you. Using a non-work phone or computer, you can contact Joseph Cox securely on Signal on  +44 20 8133 5190   , Wickr on josephcox, OTR chat on    jfcox@jabber.ccc.de", "posttime": "2021-07-30 05:16:15", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "2020,软件,facebook,nso", "title": "Facebook 希望 NSO 间谍软件监视用户，NSO 首席执行官声称（2020 年）", "title_en": "Facebook Wanted NSO Spyware to Monitor Users, NSO CEO Claims (2020)", "transed": 1, "url": "https://www.vice.com/en/article/pke9k9/facebook-wanted-nso-spyware-to-monitor-users", "via": "", "real_tags": ["2020", "软件", "facebook", "nso"]}, {"category": "", "categoryclass": "", "imagename": "7775927f9ad4a7cb1cfccbb40660ef29.jpg", "infoid": 1070502, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迈克尔摩尔展示了人类星球，一部敢于说出其他人不会说的话的纪录片——我们正在失去阻止气候变化的战斗……", "note_en": "Michael Moore presents Planet of the Humans, a documentary that dares to say what no one else will  — that we are losing the battle to stop climate change on...", "posttime": "2021-07-30 05:13:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "人类,planet,展示", "title": "纪录片：人类星球", "title_en": "Documentary: Planet of the Humans", "transed": 1, "url": "https://www.youtube.com/watch?v=Zk11vI-7czE", "via": "", "real_tags": ["人类", "planet", "展示"]}]