[{"category": "", "categoryclass": "", "imagename": "c9d38da3ea5a19e93e8fab3a28de60a2.jpg", "infoid": 1006806, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "加布里埃尔·凯勒(Gabriele Keller)是乌得勒支大学软件技术小组的主席。她是新南威尔士大学编程语言与系统小组的联合创始人之一，也是Data6(NICTA)“值得信赖的系统”项目的首席研究员。她为哈斯克尔的类型族设计做出了贡献，也是“关联类型同义词”一文的合著者之一。\n有两天时间，您处于函数式编程世界的中心。它是学术界和产业界相遇的地方，是研究和实际应用相碰撞的地方。", "note_en": "Gabriele Keller is the chair of the Software Technology Group at Utrecht University. She co-founded the Programming Languages &amp; Systems Group at the University of New South Wales, and was a Principal Researcher at Data6 (NICTA) in the Trustworthy Systems project. She contributed to the design of type families in Haskell, and is one of the co-authors of the paper ”Associated Type Synonyms”.\n  For two days you are at the centre of the functional programming world. It is a place where academia meets industry, where research and practical application collide.", "posttime": "2020-06-16 21:03:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,并行,大学", "title": "基于数组的并行的函数式编程", "title_en": "Functional Programming for Array-Based Parallelism", "transed": 1, "url": "https://www.infoq.com/presentations/functional-programming-parallelism/", "via": "", "real_tags": ["编程", "并行", "大学"]}, {"category": "", "categoryclass": "", "imagename": "5d9693895038e55c541d2d1b18dba1e5.jpg", "infoid": 1006805, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "一种名为地塞米松的廉价且随处可得的药物可以帮助挽救冠状病毒重病患者的生命。\n英国专家表示，低剂量类固醇治疗是抗击这种致命病毒的重大突破。\n它将使用呼吸机的患者的死亡风险降低了三分之一。对于那些使用氧气的人来说，它将死亡人数减少了五分之一。\n该药物是世界上最大的试验的一部分，测试现有的治疗方法，看看它们是否也对冠状病毒有效。\n研究人员估计，如果这种药物从冠状病毒大流行开始就在英国上市，可能会拯救多达5000人的生命。由于价格便宜，它在较贫穷的国家也可能带来巨大的好处，这些国家正在与大量的新冠肺炎患者作斗争。\n在20名冠状病毒患者中，约有19人在没有入院的情况下康复。在住院的人中，大多数人也都康复了，但也有一些人可能需要氧气或机械通气。这些都是地塞米松似乎可以帮助的高危患者。\n这种药物已经在一系列其他情况下被用来消炎，而且它似乎有助于阻止人体免疫系统在试图击退冠状病毒的过程中进入超速状态时可能造成的一些损害。在这种情况下，这种药物已经被用来减少炎症，而且它似乎有助于阻止人体免疫系统在试图击退冠状病毒的过程中超负荷运转时可能造成的一些损害。\n在牛津大学的一个团队领导的试验中，大约2000名医院患者服用了地塞米松，并与4000多名没有接受药物的患者进行了比较。\n对于使用呼吸机的患者，它将死亡风险从40%降低到28%。对于需要氧气的患者，它将死亡风险从25%降低到20%。\n首席研究员彼得·霍比教授说：到目前为止，这是唯一一种被证明可以降低死亡率的药物，而且它能显著降低死亡率。这是一个重大突破。\n首席研究员马丁·兰德雷教授说，研究结果表明，每八名接受呼吸机治疗的患者中，就有一人可以挽救一条生命。\n对于那些接受氧气治疗的患者，大约每20-25人接受一次药物治疗，你就可以挽救一条生命。\n&#34；这有一个明显的好处。地塞米松的治疗时间长达10天，每个患者的费用约为5 GB。因此，从本质上讲，拯救一条生命需要花费35 GB。这是一种全球通用的药物。\n兰德雷教授说，在适当的时候，医院的病人现在应该立即给予它，但人们不应该出去买它回家服用。\n地塞米松似乎对冠状病毒症状较轻的人没有帮助--那些不需要呼吸帮助的人。\n恢复试验自3月份以来一直在进行。其中包括疟疾药物羟基氯喹，由于担心它会增加死亡率和心脏问题，该药物后来被抛弃。\n另一种名为redesivir的药物，一种似乎可以缩短冠状病毒携带者康复时间的抗病毒治疗，已经在NHS上提供。\n第一种被证实可以减少新冠肺炎死亡的药物不是什么昂贵的新药，而是一种古老的、廉价的类固醇。\n这是值得庆祝的事情，因为这意味着世界各地的患者可以立即受益。这就是为什么这项试验的主要结果被匆忙公布的原因-因为它在全球范围内的影响是如此巨大。\n地塞米松自20世纪60年代初以来一直用于治疗各种疾病，如类风湿性关节炎和哮喘。所有需要呼吸机的Covid患者中有一半无法存活，因此将风险降低三分之一将产生巨大的影响。\n该药在重症监护期间静脉给药，对病情较轻的患者以片剂形式给药。到目前为止，唯一被证明有益于Covid患者的药物是redesivir，这是一种已用于埃博拉病毒的抗病毒治疗。\n这已经被证明可以将冠状病毒症状的持续时间从15天减少到11天，但证据还不够有力，不足以表明它是否降低了死亡率。与地塞米松不同的是，瑞美西韦是一种供应有限的新药，价格尚未公布。", "note_en": "A cheap and widely available drug called dexamethasone can help save the lives of patients who are seriously ill with coronavirus.\n UK experts say the low-dose steroid treatment is a major breakthrough in the fight against the deadly virus.\n It cut the risk of death by a third for patients on ventilators. For those on oxygen, it cut deaths by a fifth.\n The drug is part of  the world&#39;s biggest trial testing existing treatments to see if they also work for coronavirus.\n Researchers estimate that if the drug had been available in the UK from the start of the coronavirus pandemic up to 5,000 lives could have been saved. Because it is cheap, it could also be of huge benefit in poorer countries struggling with high numbers of Covid-19 patients.\n    About 19 out of 20 patients with coronavirus recover without being admitted to hospital. Of those who are admitted to hospital, most also recover, but some may need oxygen or mechanical ventilation. These are the high-risk patients whom dexamethasone appears to help.\n The drug is already used to reduce inflammation in a range of other conditions, and it appears that it helps stop some of the damage that can happen when the body&#39;s immune system goes into overdrive as it tries to fight off coronavirus.\n  In the trial, led by a team from Oxford University, around 2,000 hospital patients were given dexamethasone and were compared with more than 4,000 who did not receive the drug.\n For patients on ventilators, it cut the risk of death from 40% to 28%. For patients needing oxygen, it cut the risk of death from 25% to 20%.\n Chief investigator Prof Peter Horby said: &#34;This is the only drug so far that has been shown to reduce mortality - and it reduces it significantly. It&#39;s a major breakthrough.&#34;\n Lead researcher Prof Martin Landray says the findings suggest that for every eight patients treated on ventilators, you could save one life.\n For those patients treated with oxygen, you save one life for approximately every 20-25 treated with the drug.\n &#34;There is a clear, clear benefit. The treatment is up to 10 days of dexamethasone and it costs about £5 per patient. So essentially it costs £35 to save a life. This is a drug that is globally available.&#34;\n Prof Landray said, when appropriate, hospital patients should now be given it without delay, but people should not go out and buy it to take at home.\n Dexamethasone does not appear to help people with milder symptoms of coronavirus - those who don&#39;t need help with their breathing.\n The Recovery Trial has been running since March. It included the malaria drug hydroxychloroquine which has subsequently been  ditched amid concerns that it increases fatalities and heart problems.\n Another drug called remdesivir, an antiviral treatment that appears to shorten recovery time for people with coronavirus, is already  being made available on the NHS.\n   The first drug proven to cut deaths from Covid-19 is not some new, expensive medicine but an old, cheap-as-chips steroid.\n That is something to celebrate because it means patients across the world could benefit immediately. That&#39;s why the top-line results of this trial have been rushed out - because the implications are so huge globally.\n Dexamethasone has been used since the early 1960s to treat a wide range of conditions, such as rheumatoid arthritis and asthma. Half of all Covid patients who require a ventilator do not survive, so cutting that risk by a third would have a huge impact.\n The drug is given intravenously in intensive care, and in tablet form for less seriously ill patients. So far, the only other drug proven to benefit Covid patients is remdesivir, an antiviral treatment which has been used for Ebola.\n That has been shown to reduce the duration of coronavirus symptoms from 15 days to 11, but the evidence was not strong enough to show whether it reduced mortality. Unlike dexamethasone, remdesivir is a new drug with limited supplies and a price has yet to be announced.", "posttime": "2020-06-16 20:46:39", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "coronavirus,病毒,冠状病毒,life,患者", "title": "地塞米松是一种救命的冠状病毒药物", "title_en": "Dexamethasone is a life-saving coronavirus drug", "transed": 1, "url": "https://www.bbc.com/news/health-53061281", "via": "", "real_tags": ["病毒", "冠状病毒", "life", "患者"]}, {"category": "", "categoryclass": "", "imagename": "d8ed45f5b446d7cc6b844c83d03a2a79.jpg", "infoid": 1006804, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧盟委员会今天表示，在对这些问题进行初步调查后，他们担心这家科技巨头施加的条件和限制可能会扭曲一些领域的竞争。\n早在2019年3月，欧洲音乐流媒体服务商Spotify就对苹果公司提起了反垄断诉讼--非常公开地抨击它所称的“苹果税”；也就是这家科技巨头对在其App Store上接受应用程序支付所征收的30%的关税。Spotify还指责苹果通过应用武断的规则来阻碍其业务-比如让自己的用户更难提供折扣。\n欧盟委员会今天证实，他们正在正式调查苹果针对应用开发商通过App Store发布应用的规定是否违反了欧盟的竞争规定。该公司表示，调查的重点是苹果强制要求应用开发者使用自己专有的应用内购买系统，以及对开发者向iPhone和iPad用户告知应用外其他更便宜的购买可能性的能力施加的限制。\n除了Spotify非常公开的投诉外，欧盟委员会还收到了一家未具名的电子书/有声图书分销商的类似投诉，涉及App Store规则对竞争的影响。\n根据欧盟委员会的说法，苹果在与希望向苹果设备用户分发应用的公司达成的协议中施加的两项具体限制将受到调查-即[强调其]：\n(I)强制使用苹果自己专有的应用内购买系统“IAP”进行付费数字内容的分发。苹果向应用开发商收取通过IAP支付的所有订阅费的30%佣金。\n(Ii)限制开发者通知用户在应用程序之外的其他购买可能性。虽然苹果允许用户在应用程序中消费在其他地方购买的音乐、电子书和有声读物等内容(例如，在应用程序开发商的网站上购买)，但苹果的规定阻止开发商告知用户此类购买可能性，这些可能性通常更便宜。\n该委员会在一份新闻稿中写道：“经过初步调查，委员会担心苹果的限制可能会扭曲苹果设备上对音乐流媒体服务的竞争。”“苹果的竞争对手要么决定完全禁用应用内订阅功能，要么提高了应用内订阅价格，并将苹果的费用转嫁给消费者。\n“在这两种情况下，他们都不被允许通知用户在应用程序之外的替代订阅可能性。IAP义务似乎也让苹果完全控制了与订阅该应用的竞争对手客户的关系，从而使其竞争对手脱离了重要的客户数据，而苹果可能会获得有关竞争对手活动和报价的有价值的数据。\n欧盟委员会执行副总裁玛格丽特·维斯特格(Margrethe Vestager)在一份声明中发表评论说：“移动应用从根本上改变了我们获取内容的方式。苹果制定了向iPhone和iPad用户分发应用程序的规则。在向苹果流行设备的用户分发应用程序和内容方面，苹果似乎获得了“看门人”的角色。我们需要确保苹果的规则不会扭曲苹果与其他应用开发商竞争的市场竞争，例如与其音乐流媒体服务Apple Music或Apple Books的竞争。因此，我决定密切关注苹果App Store的规定，以及它们是否符合欧盟的竞争规定。“。\n维斯塔格提到的“看门人”角色具有特殊的意义，因为欧盟委员会目前正在就更新数字平台的监管进行咨询-包括提出对被视为看门人的平台相对于其他供应商进行事前监管的可能性。(同时，欧盟委员会正在就竞争法的更新进行咨询，这可能允许它在未来更快地干预，以防它怀疑数字市场已经“倾斜”。)。\n对于欧洲和世界各地的消费者、Spotify和其他应用开发商来说，今天是一个好日子。苹果的反竞争行为故意使竞争对手处于不利地位，创造了一个不公平的竞争环境，并在很长时间内剥夺了消费者有意义的选择。我们欢迎欧盟委员会正式调查苹果的决定，并希望他们尽快采取行动，确保数字经济中所有参与者在iOS平台上的公平竞争。\n在Apple Pay方面，欧盟委员会表示，对其如何操作支付技术的正式调查将调查苹果申请将支付解决方案整合到iPhone和iPad上的商家应用和网站中的“条款、条件和其他措施”；苹果限制在iPhone上使用NFC功能进行商店支付；以及“拒绝使用Apple Pay”的指控。\n在初步调查之后，欧盟委员会表示，它担心苹果的流程“可能会扭曲竞争，减少选择和创新”。\n它还指出，Apple Pay是唯一允许在iOS设备上访问NFC技术的移动支付解决方案，用于在商店进行支付。\n“调查还将聚焦于涉嫌限制竞争对手在iOS和iPadOS智能移动设备上访问Apple Pay的特定产品，”它补充道。\n欧盟委员会表示，它将“作为优先事项”开展调查，但这一过程可能需要多长时间没有固定的时间表。\n欧盟反垄断调查往往需要数年时间，从宣布正式调查到做出决定。(尽管，在针对博通的正在进行的调查中，维斯特格最近重新启用了一种加快监管干预的工具--但到目前为止，还没有针对苹果的正式“反对声明”，因此此案将如何进展，以及监管机构是否会寻求加快任何干预速度，仍有待观察。)。\n记者联系到苹果就欧盟委员会宣布的两项反垄断调查发表评论，苹果称这些投诉是“毫无根据的”--选择给投诉人蒙上阴影，声称这些公司是“搭便车，不想像其他人一样遵守同样的规则”。\n纵观我们的历史，苹果在世界上竞争最激烈的一些市场创造了突破性的新产品和服务。“我们做任何事情都遵循法律，我们在每个阶段都拥抱竞争，因为我们相信竞争会推动我们取得更好的结果。”\n我们开发App Store有两个目标：成为客户发现和下载应用程序的安全和值得信赖的地方，以及为企业家和开发人员提供巨大的商机。我们为无数通过我们的平台进行创新并取得成功的开发人员深感自豪。随着我们的共同成长，我们继续提供创新的新服务，如Apple Pay，这些服务在满足行业领先的隐私和安全标准的同时，提供最好的客户体验。\n令人失望的是，欧盟委员会(European Commission)提出了少数公司的无端投诉，这些公司只是想搭便车，不想像其他人一样遵守同样的规则。我们不认为这是正确的-我们希望保持一个公平的竞争环境，在这个环境中，任何有决心和伟大想法的人都可以成功。\n归根结底，我们的目标很简单：让我们的客户能够在安全可靠的环境中访问他们选择的最好的应用程序或服务。我们欢迎有机会向欧盟委员会展示我们为实现这一目标所做的一切。\n多年来，苹果与欧盟监管机构发生了多起争执，包括对其收购Shazam的调查(后来被澄清)；对电子书定价的重大调查；以及对爱尔兰税收优惠的调查，调查显示苹果卷入了150亿美元的税收优惠。\n法国竞争监管机构最近还以反竞争销售策略为由对这家科技巨头处以12亿美元的罚款。今年，该公司还被法国监管机构罚款2700万美元，原因是它限制了旧iPhone的使用。", "note_en": "The Commission said today that it has concerns that conditions and restrictions applied by the tech giant may be distorting competition in a number of areas, following a preliminary probe of the issues.\n Back in  March 2019, European music streaming service Spotify filed an antitrust complaint against Apple — railing  very publicly against what it dubbed an “Apple tax”; aka the 30% tariff the tech giant applies on accepting payments in apps on its App Store. Spotify also accused Apple of impeding its business by applying arbitrary rules — such as making it harder to offer its own users discounts.\n  The Commission  confirmed today that it’s looking formally into whether Apple’s rules for app developers on the distribution of apps via the App Store violate EU competition rules. It said the probe focuses on Apple’s mandatory requirement that app developers use its own proprietary in-app purchase system, as well as restrictions applied on the ability of developers to inform iPhone and iPad users of alternative cheaper purchasing possibilities outside of apps.\n As well as the very public complaint from  Spotify,   the Commission has received a similar complaint from an unnamed e-book/audiobook distributor related to the impact of the App Store rules on competition.\n Two specific restrictions imposed by Apple in its agreements with companies that wish to distribute apps to users of Apple devices will be investigated, per the Commission — namely [emphasis its]:\n (i)   The mandatory use of Apple’s own proprietary  in-app purchase system “IAP” for the distribution of paid digital content. Apple charges app developers a 30% commission on all subscription fees through IAP.\n (ii)  Restrictions on the ability of developers to inform users of  alternative purchasing possibilities outside of apps. While Apple allows users to consume content such as music, e-books and audiobooks purchased elsewhere (e.g. on the website of the app developer) also in the app, its rules prevent developers from informing users about such purchasing possibilities, which are usually cheaper.\n “Following a preliminary investigation the Commission has concerns that Apple’s restrictions may distort competition for music streaming services on Apple’s devices,” it writes in a  press release. “Apple’s competitors have either decided to disable the in-app subscription possibility altogether or have raised their subscription prices in the app and passed on Apple’s fee to consumers.\n “In both cases, they were not allowed to inform users about alternative subscription possibilities outside of the app. The IAP obligation also appears to give Apple full control over the relationship with customers of its competitors subscribing in the app, thus dis-intermediating its competitors from important customer data while Apple may obtain valuable data about the activities and offers of its competitors.”\n Commenting in a statement, Commission EVP  Margrethe Vestager   — who heads up competition policy for the bloc — added:  “Mobile applications have fundamentally changed the way we access content. Apple sets the rules for the distribution of apps to users of iPhones and iPads. It appears that Apple obtained a ‘gatekeeper’ role when it comes to the distribution of apps and content to users of Apple’s popular devices. We need to ensure that Apple’s rules do not distort competition in markets where Apple is competing with other app developers, for example with its music streaming service Apple Music or with Apple Books. I have therefore decided to take a close look at Apple’s App Store rules and their compliance with EU competition rules.”\n Vestager’s reference to a “gatekeeper” role has specific significance as the Commission is  currently consulting on updating regulations for digital platforms — including floating the possibility of ex ante regulation for platforms deemed to be gatekeepers vis-a-vis other suppliers.  (In parallel, the Commission is consulting on updates to competition law that may allow it to intervene more swiftly in future, in instances where it suspects digital markets have ‘tipped’.)\n  Today is a good day for consumers,  Spotify and other app developers across Europe and around the world. Apple’s anticompetitive behavior has intentionally disadvantaged competitors, created an unlevel playing field, and deprived consumers of meaningful choice for far too long. We welcome the European Commission’s decision to formally investigate Apple, and hope they’ll act with urgency to ensure fair competition on the iOS platform for all participants in the digital economy.\n On Apple Pay, the Commission  said a formal investigation of how it operates the payment tech will look at the “terms, conditions and other measures” Apple applies for integrating the payment solution in merchant apps and websites on iPhones and iPads; Apple’s limitation of access to the NFC functionality on iPhones for payments in stores; and allegations of “refusals of access to Apple Pay”.\n Following a preliminary probe, the Commission said it is concerned Apple’s processes “may distort competition and reduce choice and innovation”.\n It also notes that Apple Pay is the only mobile payment solution that is allowed to access NFC technology on iOS devices for making payments in stores.\n “The investigation will also focus on alleged restrictions of access to Apple Pay for specific products of rivals on iOS and iPadOS smart mobile devices,” it added.\n The Commission said it will carry out the investigations “as a matter of priority”, but there’s no set timeframe for how long this process might take.\n EU antitrust investigations have tended to take a number of years from an announcement of a formal probe to a decision being reached. (Although, in an ongoing investigation against Broadcom, Vestager  recently dusted off a tool to accelerate regulatory intervention — but as yet there’s no formal ‘statement of objections’ against Apple so it remains to be seen how this case will proceed, and whether regulators may seek to speed up any intervention.)\n Reached for comment on the Commission’s announcement of the two antitrust investigations, Apple dubbed the complaints “baseless” — choosing to throw shade on the complainants by claiming these companies are after “a free ride, and don’t want to play by the same rules as everyone else”.\n  Throughout our history, Apple has created groundbreaking new products and services in some of the most fiercely competitive markets in the world. We follow the law in everything we do and we embrace competition at every stage because we believe it pushes us to deliver even better results.\n We developed the App Store with two goals in mind: that it be a safe and trusted place for customers to discover and download apps, and a great business opportunity for entrepreneurs and developers. We’re deeply proud of the countless developers who’ve innovated and found success through our platform. And as we’ve grown together, we’ve continued to deliver innovative new services — like Apple Pay — that provide the very best customer experience while meeting industry-leading standards for privacy and security.\n It’s disappointing the  European Commission   is advancing baseless complaints from a handful of companies who simply want a free ride, and don’t want to play by the same rules as everyone else. We don’t think that’s right — we want to maintain a level playing field where anyone with determination and a great idea can succeed.\n At the end of the day, our goal is simple: for our customers to have access to the best app or service of their choice, in a safe and secure environment. We welcome the opportunity to show the European Commission all we’ve done to make that goal a reality.\n Apple has had a number of run-ins with EU regulators over the years — including a  probe of its acquisition of Shazam (which was  later cleared); a major  investigation of ebook pricing; and a  probe of tax benefits in Ireland which saw it  on the hook for $15BN.\n French competition regulators also recently fined the tech giant  $1.2BN for anti-competitive sales tactics. It’s also  been fined $27M by French regulators this year for throttling old iPhones.", "posttime": "2020-06-16 20:45:31", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "ios,app,apple,rust,pay", "title": "Apple Pay和iOS App Store在欧洲接受正式反垄断调查", "title_en": "Apple Pay and iOS App Store under formal antitrust probe in Europe", "transed": 1, "url": "https://techcrunch.com/2020/06/16/apple-pay-and-ios-app-store-under-formal-antitrust-probe-in-europe/", "via": "", "real_tags": ["ios", "app", "apple", "rust", "pay"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006803, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Geany是一个强大、稳定和轻量级的程序员文本编辑器，它提供了大量有用的功能，而不会使您的工作流程陷入困境。它在Linux、Windows和MacOS上运行，被翻译成40多种语言，并具有对50多种编程语言的内置支持。下载Geany 1.36»", "note_en": "Geany is a powerful, stable and lightweight programmer&#39;s text editor\t\t\t\t\tthat provides tons of useful features without bogging down your\t\t\t\t\tworkflow. It runs on Linux, Windows and MacOS is translated into\t\t\t\t\tover 40 languages, and has built-in support for more than 50 programming\t\t\t\t\tlanguages.\t\t\t\t\t   \t\t\t\t\t\tDownload Geany 1.36 »", "posttime": "2020-06-16 20:28:21", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "flyweight,内置", "title": "Geany-Flyweight IDE", "title_en": "Geany – The Flyweight IDE", "transed": 1, "url": "https://www.geany.org/", "via": "", "real_tags": ["flyweight", "内置"]}, {"category": "", "categoryclass": "", "imagename": "6f345283c1790edac8d69195c5fb1d06.png", "infoid": 1006802, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "移动-首先，解决了移动计算革命早期设备的限制。那时候它很有意义，即使到了今天，它在很多情况下也能很好地工作。尽管它一成不变地创造了两类设备-移动设备和台式机设备-这两类设备往往带有许多其他假设：\n最新的移动设备比普通的笔记本电脑或台式机要强大得多。同时支持触摸和鼠标的混合设备越来越多。平板电脑是移动的还是台式的？或者它们完全是一个新的类别？\n设备功能方法是一种渐进式增强方法，您最初针对的是功能较差的设备，然后在它们变得功能更强时进行增强。在许多方面，这正是移动优先正在尝试做的事情，只是效果较差。听我解释。\nCanva是我的日常工作产品，它是一种相当复杂的东西。不久前，我们还在处理选择框架-选择元素时出现的控制柄。\n之前，我们有一个桌面版和一个移动版--这两个版本让触控变得很友好--而且在很大程度上工作得很好。虽然大约在同一时间，我们也在开发一些东西，后来变成了Canva设计实验室。\n从大多数标准来看，它都是一款台式设备--它有一个大屏幕，可以连接到WiFi，而且它位于一个位置--然而，它的屏幕是支持触控的。这一分类意味着大触摸屏使用的是桌面版本的选择框，该版本已针对鼠标使用进行了优化。\n我们的目标是移动设备或台式机，而实际上我们应该瞄准的是该设备的特定功能。在这种特殊情况下，应该是指针，它本质上映射到触摸或鼠标。\n这是一个相当极端的例子，但在更多的情况下，你会遇到类似的问题。下面是处理这些问题的一些互动示例和实际解决方案。\n在移动优先设计时，最常考虑的是视口的大小。最常见的目标属性是视口宽度，其他属性包括高度、纵横比和设备方向，即纵向和横向。\n首先要注意的是，视口不一定等于屏幕大小。偶尔会出现这种情况，但在大多数情况下，UI会占用空间，窗口没有使用整个屏幕，或者其他一些原因，比如安全区域。以您当前的情况为例：\n为不同大小的设备设计的常用方法是使用断点。不过，大多数人在使用断点时犯的错误是将它们放在与普通设备大小(375px、768px、1024px等)完全匹配的位置。\n当九月来临，苹果决定发布新的iPad时，这就变成了一场维护的噩梦--他们目前有4款不同尺寸的iPad在售。\n如果我们退后一步，看看今天市场上所有的设备，在常见的设备类别-手机、平板电脑、笔记本电脑和台式机-周围都有相当明显的集群。它位于群集之间的空隙中，我们应该在其中放置断点：\nDavid Gilbertson撰写了一篇精彩的文章，内容是关于使用CSS断点的100%正确方法，其中深入讨论了这个主题。\n接下来是指针。典型的解释是触摸与鼠标-它甚至反映在指针媒体查询规范中-尽管现实更像是一种光谱：\n当谈到指针精确度时，大多数平台都有关于最小目标大小的建议，这是一个很好的起点，尽管其他因素也值得考虑。\nSpotify和地图等应用的汽车模式就是一个很好的例子。尽管设备相同，但上下文却大不相同。注意力集中在路上，设备使用的距离比通常情况下更远，再加上开车时通常会出现颠簸和跳跃，这意味着要准确点击屏幕上的元素要困难得多。要解决此问题，CAR模式会增加常用操作的大小：\n即使是屏幕的类型也可能是个问题。现代智能手机上使用的电容式触摸屏比其他类型的触摸屏具有更高的精确度-我敢肯定，你们以前都曾在飞机和自动取款机上遇到过这种情况。\n作为一个小实验，试着在下面的不同圆圈中拖动。您可能会注意到，有些需要付出更多努力，甚至是不可能在您的设备上四处移动：\n每个指针都支持简单的点击或单击事件，但大多数支持更高级的事件-例如右键单击、双击或滑动。\n通常，设备(特别是设备的大小)用于检测对这些事件的支持。当我们说移动设备是触摸式设备时，我们可能是对的。但很多笔记本电脑也是如此。\n很多设备都支持触摸，但不包括移动设备，还有更多的设备支持几种不同的指针类型--iPad的最新更新包括对鼠标和触控板的一流支持。\n一种精确得多的方法是使用各种指针API中的一种，这些API揭示了有关当前指针类型的大量信息。单击或轻触下面的按钮，查看有关您的指针的信息：\n理想的解决方案是设计成适合能力最差的指针的需要，然后在必要时，随着精确度和功能的提高而逐渐增强。\n值得一提的是，虽然不是所有的高级事件都可以在每台设备上使用，但通常还有其他交互事件可以作为合适的替代方案。请记住以下几点：\n键盘实际上只有两个选项可用：虚拟键盘或物理键盘。大多数设备都支持其中一种，尽管同时支持这两种功能的设备越来越多--尽管从来不会同时支持这两种功能。例如，如果连接了蓝牙或智能键盘，iPad就不会显示虚拟键盘。\n物理键盘不会带来太大问题，尽管虚拟键盘在出现时会占据宝贵的屏幕空间。不幸的是，目前还没有很好的方法来检测虚拟键盘的存在，也没有准确测量结果键盘的大小。有一些老套的解决方案-例如检测视口大小的更改-只需记住，任何解决方案都是不可靠的，应该在不同的设备和平台上进行测试。\n我最初确实提到过，键盘只有两种选择，不过严格说来并非如此。如果你想在这里进入一个怪异而美妙的兔子洞，这是一个关于键盘选择的很好的指南。\n设备、传感器和硬件是事情开始变得有趣的地方。它们包括陀螺仪、GPS、触觉引擎、相机、指纹传感器和环境光传感器。\n这些传感器和硬件的使用范围很广，从对用户的微妙增强，比如来自触觉引擎的少量反馈，一直到打开GPS的整个产品类别。\n有许多不同的API可以从浏览器中访问这些传感器和硬件。你可能会遇到的一个例子是地理定位API，它可以用来定位你的当前位置。该API支持的不仅仅是定位，请单击或轻拍下面的按钮以了解更多信息：\n不幸的是，在各种平台和浏览器上对这些API中的许多API的支持并不是很好，所以请谨慎操作。大多数都在积极开发中，因此值得及时更新可用的浏览器API，以获得更多有趣和即将到来的选项，如触觉反馈和环境光传感器。\n网络速度不一定是设备的限制，但它会极大地影响设备的使用方式。检测网络速度的方法有多种，精确度各不相同。\n最简单的检查就是看看你是否在线。Navigator.onLine API返回一个布尔值，检查您是否连接到网络。\n通过让浏览器获取已知大小的媒体，然后测量已用时间，可以检测速度。还有一个实验性的网络信息API，它提供了连接类型等方面的更多细节。\n遗憾的是，这两种方法都不是特别准确，也不是得到广泛支持，因此最好的方法是采取网络速度可能很慢且不可靠的立场。因此，只发送必要的内容，并始终压缩文件和资产。\n同样值得澄清的是，移动连接不能保证低速，就像有线或WiFi连接不能保证高速一样。Wifi和移动连接之间的相对速度差异在世界各地差异很大：\n还有更多的情境因素会影响速度--我敢肯定，你们以前都在机场或咖啡馆用过摇摇欲坠的WiFi连接。\n移动优先的意图是正确的。对于普通的网站或应用程序来说，移动优先方法和设备功能方法之间的结果大致相同。\n不过，随着设备版图的不断融合，分类将继续变得模糊。当你给你的站点引入更多的交互性和更复杂的功能时，单一的方法开始瓦解。\n这只是这两种方法之间的一个微小的心态转变，但却是一个重大的转变。它是为触摸屏而设计的，它将与鼠标配合使用，为慢速连接优化性能，它将为更快的连接而工作，它将为小屏幕而设计，至少它将在更大的屏幕上工作。\n自从我们在Canva开始采用这种方法以来，它意味着更少的代码、更少的设计和更少的测试--所有这些都会带来更好的结果。而这是我认为我们都可以落后的。", "note_en": "Mobile-first, a solution to the constraints of devices in the early days of mobile computing revolution. Back then it made a lot of sense, and even to this day it works well in a lot of situations. Though what it invariably does do is create two categories of devices—mobile and desktop—which tend to carry a lot of other assumptions:\n   The latest mobile devices are far more powerful than your average laptop or desktop. There are more and more hybrid devices which work with both touch  and mouse. Are tablets mobile or desktop? Or are they a new category altogether?\n  The device capabilities approach is a type of progressive enhancement where you initially target less capable devices, then enhance at they become more capable. In many ways, that&#39;s what mobile-first is attempting to do, just to a lesser effect. Let me explain.\n Canva, the product I work on day-to-day, is a pretty complex beast. Not too long ago we were working on the selection frame—the handles which appear when an element is selected.\n  Previously we had a version for desktop and a version for mobile—which made things touch friendly—and that worked pretty nicely for the most part. Though around the same time we were also developing something which turned into the Canva Design Lab.\n  By most measures it&#39;s a desktop device—it has a large 40&#34; screen, it&#39;s connected to WiFi, and it sits in one spot—and yet, the screen is touch enabled. The categorisation meant that the large touchscreen was using the desktop version of the selection frame, a version which had been optimised for use with a mouse.\n We were targeting &#34;mobile or desktop&#34;, when instead we should have been targeting a particular capability of the device. In this particular case that would have been the pointer, which essentially maps to touch or mouse.\n That&#39;s a pretty extreme example, but there are plenty more situations where you&#39;ll encounter similar issues. Below are some interactive examples and practical solutions to dealing with these issues.\n  Size of the viewport is most frequently considered when designing mobile-first. The most commonly targeted attribute is viewport width, with other attributes including height, aspect ratio, and device orientation i.e. portrait and landscape.\n The first thing of note is that the viewport doesn&#39;t necessarily equal the screen size. It occasionally does, but in most cases UI is taking up space, the window isn&#39;t using the entire screen or some other reason like  safe areas. Take your current situation:\n   A common way to design for different size devices is to use breakpoints. The mistake most make with breakpoints though is placing them at points which exactly match common device sizes (375px, 768px, 1024px, etc).\n This becomes a bit of a maintenance nightmare when September rolls around and Apple decides to release a new iPad—they currently have 4 different sized iPads on sale.\n If we take a step back and look across all the devices on the market today there&#39;s pretty apparent clusters around the common device classes—phone, tablet, laptop and desktop. It&#39;s in the gaps between the clusters where we should place our breakpoints:\n  There&#39;s a fantastic article by David Gilbertson on  The 100% correct way to do CSS breakpoints which covers this topic in depth.\n  Next up is pointers. The typical interpretation is touch vs mouse—it&#39;s even reflected in the  pointer media query specifications—though the reality is more of a spectrum:\n  When it comes to pointer accuracy most platforms have suggestions on minimum target sizes, which is a good place to start, though other factors are worth taking into account.\n A good example is Car Mode for apps like Spotify and Maps. Even though the device is the same, the context is quite different. A combination of focus being on the road, the device being used further away than is typical, and the general bumps and jumps you get when driving means that it&#39;s much harder to accurately tap elements on the screen. To account for this Car Mode increases the size of commonly used actions:\n  Even the type of screen can be an issue. Capacitive touchscreens used on modern smart phones have far greater accuracy than other types of touchscreen technologies—I&#39;m sure you&#39;ve all struggled with the screens on planes and ATMs before.\n As a little experiment try dragging around the different circles below. You may notice that some take more effort, or are even impossible, to move around on your device:\n  Every pointer supports a simple tap or click events, though most support more advanced events—such as right click, double tap, or swipe.\n Often the device, specifically the size of the device, is used to detect support for these events. When we say mobile devices are touch we&#39;d be right. But so are a lot of laptops.\n Lots of devices support touch but aren&#39;t considered &#34;mobile&#34; devices, and a many more support several different pointer types—the latest iPad update includes first class support for mouses and trackpads.\n A far more accurate method is to use one of the various  pointer API&#39;s, which reveal a lot of information about the current pointer type. Click or tap the button below see what it says about your pointer:\n  The ideal solution is to design to suit the needs of the &#34;least capable&#34; pointer then, if necessary, progressively enhancing as accuracy and capabilities improve.\n It&#39;s worth also noting that whilst not all advanced events are available across every device, there&#39;s often other events of interactions which can serve as a suitable alternative. A few to keep in mind:\n   The keyboard only really has two options available: a virtual keyboard or a physical keyboard. Most devices support one or the other, though there&#39;s a growing number of devices which support both—though never both at the same time. An iPad, for instance, won&#39;t show the virtual keyboard if a Bluetooth or smart keyboard is connected.\n  Physical keyboards don&#39;t pose much of an issue, though virtual keyboards take up valuable screen real estate when they appear. Unfortunately at this time there&#39;s no nice way to detect the existence of a virtual keyboard, nor accurately measure the size of the resultant keyboard. There are some hacky solutions—such as detecting changes to the size of the viewport—just keep in mind that any solution is unreliable and should be tested across different devices and platforms.\n I did originally mention that there were only two keyboard options, though that&#39;s not strictly true. If you want to go down a weird and wonderful rabbit hole here&#39;s a good guide on  keyboard alternatives.\n  Devices sensors and hardware is where things start to get interesting. They include things like gyroscopes, GPS, haptic engines, cameras, fingerprint sensors, and ambient light sensors.\n The usage of these sensors and hardware can range from subtle enhancements for the user, such as a small buzz of feedback from a haptic engine, right through to opening up entire product categories in the case of GPS.\n There&#39;s lots of different API&#39;s which can access these sensors and hardware from within the browser. One you&#39;ve likely come across is the Geolocation API which can be used to locate your current position. The API supports much more than just position though, click or tap the button below to find out more:\n  Unfortunately, support for many of these API&#39;s isn&#39;t great across the various platforms and browsers, so proceed with caution. Most are in active development so it&#39;s worth keeping up to date with the available  browser API&#39;s for more interesting and upcoming options such as  haptic feedback and  ambient light sensors.\n  Network speed isn&#39;t necessarily a device constraint, but it can greatly impact how they&#39;re used. There&#39;s different ways of detecting network speeds with varying levels of accuracy.\n The simplest check is to see if you&#39;re online at all. The  Navigator.onLine API returns a boolean checking whether you&#39;re connected to a network or not.\n  It&#39;s possible to detect speed by getting the browser to  fetch media of a known size then measuring the elapsed time. There&#39;s also an experimental  Network Information API which provides even further detail for things such as connection type.\n Sadly neither of these approaches is particularly accurate or widely supported so the best approach is to take the stance that network speeds can be slow and unreliable. So only send as much as necessary and always compress files and assets.\n It&#39;s also worth clarifying that a mobile connection doesn&#39;t assure slow speeds, just as a wired or WiFi connection doesn&#39;t assure fast speeds. The relative  speed difference between Wifi and mobile connections varies drastically around the world:\n  There&#39;s also more situational factors which can impact speeds—I&#39;m sure you&#39;ve all used a flaky WiFi connection at an airport or cafe before.\n  The intent of mobile-first is the right one. And for your average site or app, the outcome between a mobile-first approach vs a device capability approach is fairly much the same.\n Though as the device landscape continues to converge, the categorisations will continue to blur. And as you introduce more interactivity and complex features to your site, the singular approach starts to break down.\n It&#39;s only a slight mindset shift between the two approaches, but it is a significant one. Design for a touchscreen and it&#39;ll work with a mouse, optimise performance for a slow connection and it&#39;ll work on a faster connection, design for a small screen, and at the very least it&#39;ll work on a larger screen.\n Since we started this approach at Canva it&#39;s meant less code, less design, and less testing—all for a far greater outcome. And that&#39;s something I think we can all get behind.", "posttime": "2020-06-16 20:27:12", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "设计,移动,design,设备", "title": "不要为移动设计", "title_en": "Don’t Design for Mobile", "transed": 1, "url": "https://mattanddesign.com/dont-design-for-mobile/", "via": "", "real_tags": ["设计", "移动", "design", "设备"]}, {"category": "", "categoryclass": "", "imagename": "3560810c6fcb541eb13cd3024bba937e.jpeg", "infoid": 1006801, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "PermalLink GitHub是5000多万开发人员的家园，他们一起工作，共同托管和审查代码、管理项目和构建软件。\n报名。\n用户可以很容易地将其网络流量代理到Intranet节点(多层)，打破限制并操作您控制的所有节点XD。\nPS：感谢大家的明星，我只是个业余爱好者，代码还需要优化，所以如果你发现任何错误或错误，请随时告诉我，PRS和问题都欢迎😘。\n本工具仅限于安全研究和教学，因使用本工具而造成的一切法律责任及相关责任由用户承担！作者不承担任何法律责任和相关责任！\n检查版本以获取一个。如果您想要未压缩的集合，请选中未压缩，或者您可以选择压缩的集合(更容易将代理上载到目标服务器)，请选中压缩。\nStartnode和Simple节点可以命名为agent模式，除了有一些细微的不同之外，它们几乎是相同的(您可以在以下内容中看到不同之处)。\n含义：-l表示Stowaway正在侦听端口9999并等待传入连接-s表示Stowaway在通信期间使用123作为加密密钥请注意！-s选项的值在启动每个节点时必须相同\n含义：-c表示Stowaway的监视器节点的侦听地址-l表示Stowaway正在侦听端口10000并等待传入连接(可选，您也可以通过命令打开侦听端口)-s表示Stowaway在通信过程中使用123aes加密密钥--startnode它表示Stowaway作为起始节点启动(如果该节点是连接到管理员的第一个节点，则必须添加此选项！否则，只需删除此选项)--reconnect它意味着startnode将每隔5秒自动尝试重新连接到管理节点(在本例中)。PS：如果您想启动重新连接功能，请在启动STARTNODE时添加--RECONNECT，在启动其他简单节点时不需要添加此选项。\n含义：-r表示要以被动模式启动节点-l表示Stowaway正在侦听端口10000并等待传入连接。\n现在，您可以使用ADMIN，键入use 1-&gt；connect127.0.0.1：10001将这个简单的节点添加到网络中。\n含义：-l，-s，--startnode与示例1-r相同，表示startnode被动启动。\n下次要重新连接到startnode并重建整个网络时，只需启动管理节点，如./stowaway_admin-s 123-c 127.0.0.1：9999，然后整个网络将重建。\n现在，Stowaway提供了基于SO_REUSEPORT和SO_REUSEADDR特性和iptable规则的端口重用功能(StartNode和Simple Node都可以使用此功能)。\n主要支持WINDOWS、mac操作系统，也可以在linux上使用，但在linux平台上有一定的限制。\n含义：-c/-s与我前面提到的一样--runstreuse它表示您要连接的节点处于端口重用模式(如果您要连接的节点正在重用端口，则必须设置此选项)\n含义：-s/--startnode如前所述--report表示要重用的端口--rehost表示要监听的IP地址(不要设置0.0.0.0，会使重用功能失效)。\n现在，如果有一个后跟startnode的简单节点，并且希望连接到startnode，则命令可以如下所示：./stowaway_agent-s123-c 192.168.0.105：80--runstreuse。\n这种重用方法依赖于在流量到达重用端口(--report选项)之前，使用iptables规则将流量重定向到端口(-l选项)。\n含义：--startnode/-s与我之前提到的相同--report它表示您要重用的端口-l它表示将接受所有重定向流量的端口(节点将侦听它)。\n设置SECRET的值(SECRET的值是启动节点时-s选项的值)。\n使用该脚本后，admin可以连接到startnode：./stowaway_admin-c 192.168.0.105：22-s 123--runstreuse。\n现在，如果有一个后跟startnode的简单节点，并且希望连接到startnode，则命令可以如下所示：./stowaway_agent-s123-c 192.168.0.105：22--runstreuse。\n如果节点被ctrl-c或命令kill终止，它将自动清除iptables规则，但如果它被命令kill-9终止，则它无法执行此操作，这将导致无法访问最初在重用端口上运行的服务，因此，为了避免这种情况，reuse.py提供了可以停止端口重用功能的函数。\n如果要停止端口重用，只需运行reuse.py，如下所示：Python reuse.py--stop--rhost 192.168.0.105--rport 22。\n然后将关闭重新使用的&#34；端口，并且可以再次访问原来在重新使用的端口上运行的服务。\n每个节点(除管理节点外)都可以由多个节点连接以构建网络树。\n当一个节点离线时，它将强制与该节点相关的所有SOCKS、反射、转发服务关闭。\n如果其中一个分支因网络波动或中间节点断开而断开(例如，admin之后是startnode，并且startnode的分支分为两个分支，一个是startnode-&gt;节点2-节点3-节点4，另一个是startnode-节点5-节点6)。\n此时，如果用户想要将节点3和节点4重新加入网络，则用户有两个选择。一种是，如果startnode可以直接访问node3，那么用户可以随时在startnode使用connect或sshnel命令重新连接node3(请记住，即使startnode也可以同时访问node4，请不要直接连接到node4，请将整个缺失链(node3-&gt；node4)的头节点node3连接到网络中，这样就可以将node3和node4重新连接到网络中。\n另一种选择是，当starnode无法直接访问node3(即必须通过node2)时，请先重启node2并加入网络，然后在node2上使用connect或sshnel命令连接到node3，使node3和node4重新入网(如前所述，即使node2可以直接访问node4，也请不要连接node4，只连接node3)。\n现在，使用管理节点并键入&#34；use 1&#34；-&&gt;&34；connect 127.0.0.1：10001&#34；，然后就可以将节点1添加到网络中\n一旦设置了节点的便笺，除非节点关闭，否则即使在管理员脱机后重新连接到整个网络，也可以恢复便笺。因此，您不必担心丢失便笺。\n它可以将您的流量代理到第二个简单节点，第二个简单节点将像socks5服务器一样执行其工作。\n如果您想为socks5服务设置用户名/密码(火狐支持此功能，Chrome不支持此功能)，例如，如果您想要将用户名设置为ph4ntom，将密码设置为11235，只需将命令更改为socks7777 ph4ntom 11235(请注意，用户名和密码中都不要使用冒号(：))。\n它可以让第二个简单节点作为ssh客户端启动到127.0.0.1：22的ssh连接(ARM和MIPSEL代理不支持此功能)。\n现在，如果您想将另一个节点添加到网络中，您可以选择sshnel命令：\n我建议在防火墙限制了除SSH之外的所有流量后，使用命令将节点添加到网络中。通常，您只需使用命令即可，它也可以工作(ARM和Mipsel代理不支持此功能)。\n如果您要上传/下载任何文件，请使用Upload/Download+(Filepath)，然后可以将特定文件上传到选定节点/从选定节点XD下载特定文件(请注意！您一次只能传输一个文件，如果您想传输更多文件，请等待上一个文件传输完成。)。\n现在您可以像真正连接到127.0.0.1：22一样连接到127.0.0.1：8888(将本地端口转发到远程端口)\n现在，任何连接到127.0.0.1：80的人实际上都将连接到127.0.0.1：22(将远程端口转发到本地端口)。\n如果要在节点3上打开新监听器以接受以下节点连接，可以使用&#34；listen&#34；命令。\n这个项目编码只是为了好玩，逻辑结构和代码结构不够严格，请不要那么认真。\n这个程序编译后会比平时稍微大一点，但实际上通过我的测试，它只比平时多了1MB，在物联网平台上可能会稍微大一点(1MB可能不是什么大不了的事情)，所以如果你在物联网平台上使用时有什么问题，尽管告诉我，我会尽我最大的努力减小它的大小。\nUPX压缩后的可执行文件看起来比原来的要小很多，确实让偷渡客上传到目标服务器变得很容易，但实际上，虽然它可以让上传东西变得更容易，但它会比原来的稍微占用更多的内存，所以根据你想要使用偷渡者的目标来选择合适的版本(UPX或非UPX)。\n如果要从源代码编译此项目，可以运行build_admin.sh/build_agent.sh(请注意！默认编译结果为代理模式，请运行build_agent.sh。但是如果您想编译管理模式，请查看main.go文件并按照说明进行操作，接下来您可以运行build_admin.sh来获取管理模式程序。)", "note_en": "Permalink     GitHub is home to over 50 million developers working together to host and review code, manage projects, and build software together.\n  Sign up\n       Users can easily proxy their network traffic to intranet nodes (multi-layer),break the restrction and manipulate all the nodes that under your control XD\n PS: Thanks for everyone&#39;s star, i&#39;m just an amateur, and the code still need be optimized,so if you find anything wrong or bugs, feel free to tell me, prs and issues are welcome  😘.\n This tool is limited to security research and teaching, and the user bears all legal and related responsibilities caused by the use of this tool! The author does not assume any legal and related responsibilities!\n    Check the  release to get one.And if you want the Uncompressed collection，check  Uncompressed or you can choose the Compressed collection(much more easier for u to upload agent to target server),check  Compressed\n     startnode and  simple node can be named as AGENT mode, they are almost identical except for some tiny differences(You can see the differences in the following content)\n  Meaning： -l It means Stowaway is listening on port 9999 and waiting for incoming connection -s It means Stowaway has used 123 as the encrypt key during the communication Be aware! -s option&#39;s value must be identical when you start every node\n  Meaning： -c It means Stowaway&#39;s monitor node&#39;s listening address -l It means Stowaway is listening on port 10000 and waiting for incoming connection (optional，you can also open the listening port via &#34;listen&#34; command) -s It means Stowaway has used 123 as the AES encrypt key during the communication --startnode It means Stowaway is started as startnode(if the node is the first node that connect to admin, you MUST add this option!!! otherwise, just remove this option) --reconnect It means the startnode will automatically try to reconnect to admin node every 5 seconds (in this example). PS:if you want to start the reconnect function,add --reconnect JUST when you start the STARTNODE , there is no need to add this option when you start the other simple nodes.\n  Meaning： -r It means you want to start the node in passive mode -l It means Stowaway is listening on port 10000 and waiting for incoming connection\n And now, you can use admin,type in  use 1---&gt;  connect 127.0.0.1:10001 to add this simple node into network\n Meaning: -l,-s,--startnode As the same as Example 1 -r It means startnode is started passively\n  The next time you want to reconnect to the startnode and rebuild the whole network,just start the admin node like  ./stowaway_admin -s 123 -c 127.0.0.1:9999,and then whole network will be rebuilt\n  Now Stowaway provide the port reuse functions based on SO_REUSEPORT和SO_REUSEADDR features and iptable rules(startnode and simple node can both use this function)\n   Mainly support windows、mac operation system,also can be used on linux,but there are some restrictions on linux platform\n  Meaning: -c/-s As the same as i mentioned before --rhostreuse It means the node that you want to connect is under port reusing mode(This option MUST be set if the node you want to connect is reusing port)\n  Meaning: -s/--startnode As the same as i mentioned before --report It means the port you want to reuse --rehost It means the ip address you want to listen on(DO NOT set 0.0.0.0,it will make the reuse funtion lose its effect)\n Now if there is a simple node followed by startnode and want to connect to startnode,the command can be like this:  ./stowaway_agent -s 123 -c 192.168.0.105:80 --rhostreuse\n And this kind of reusing method depend on using iptables rule to redirect traffics to the port(-l option) before they reach the reuse port(--report option).\n  Meaning: --startnode/-s As the same as i mentioned before --report It means the port you want to reuse -l It means the port that will accept all redirect traffics(node will listen on it)\n  Set the value of SECRET(the value of SECRET is the value of -s option when you start the nodes)\n  And after using the script,admin can connect to startnode: ./stowaway_admin -c 192.168.0.105:22 -s 123 --rhostreuse\n  Now if there is a simple node followed by startnode and want to connect to startnode,the command can be like this: ./stowaway_agent -s 123 -c 192.168.0.105:22 --rhostreuse\n  If node is killed by ctrl-c or command  kill,it will clean up the iptables rules automatically,but if it is killed by command  kill -9,then it can&#39;t do that and it will lead to the service originally run on the reusing port cannot be reached,so in order to avoid this situation ,the reuse.py provide the function that can stop the &#34;port reusing&#34; function.\n If you want to stop &#34;port reusing&#34;,just run reuse.py like this:  python reuse.py --stop --rhost 192.168.0.105 --rport 22\n And then the &#34;port reusing&#34; will be closed,and the service originally run on the reusing port can be reached again\n  Every node(except for the admin node),can be connected by several nodes to build the network tree\n When a node offline,it will force all the socks,reflect,forward services that related to this node down\n If one of the branches is disconnected due to network fluctuations or disconnection of intermediate nodes (for example, admin is followed by startnode, and startnode&#39;s branch is divided into two branches, one is startnode-&gt; node 2-&gt; node 3-&gt; node 4,another is startnode-&gt; node 5-&gt; node 6).\n  At this time, if the user wants to rejoin node3 and node4 to the network, the user has two options. One is that if startnode can directly access node3, then the user can reconnect the node3 with the connect or sshtunnel command at startnode at any time (remember, even if startnode can also access node4 at the same time, please DO NOT directly connect to node4, please connect the head node node3 of the entire missing chain (node3-&gt; node4), so that you can rejoin node3 and node4 to the network\n Another option is when startnode cannot directly access node3 (that means you must pass through node2), please restart node2 and join it into the network first, and then use connect or sshtunnel command on node2 to connect to node3, so that node3 and node4 will rejoin to the network (As mentioned before, even if node2 can directly access node4, please do not connect to node4, just connect to node3)\n         Now, use admin node and type in &#34;use 1&#34; -&gt; &#34;connect 127.0.0.1:10001&#34; ,then you can add node 1 into the net\n         Once the node&#39;s note is set,unless the node down,the note can be recovered even when admin offline follow by reconnecting to the whole network.So you don&#39;t need to be worried about losing the notes.\n           And it can proxy your traffic to the second simple node and the second simple node will do its work like a socks5 server\n If you want to set username/password for socks5 service(Firefox support this function, Chrome doesn&#39;t), For instance, if you want to set the username as ph4ntom and password as 11235,just change the command to  socks 7777 ph4ntom 11235 (Be aware,do not use colon(:) in either username or password)\n     And it can make the second simple node do its work as ssh cilent to start a ssh connection to 127.0.0.1:22(arm and mipsel agent doesn&#39;t support this function)\n  Now if you want to add another node into the network, you can choose sshtunnel command：\n  And I suggest to use the &#34;sshtunnel&#34; command to add the node into network when the firewall has stricted all the traffics expect for SSH.In general,you can just use &#34;connect&#34; command,it also works(arm and mipsel agent doesn&#39;t support this function)\n    If you want to upload/download any files,use upload/download + (filepath),and then you can upload specific file to selected node/download specific file from selected node XD (Be aware! You can just transfer only ONE file at the same time,if you want to transfer more,please wait for the previous one complete.)\n   Now you can connect to 127.0.0.1:8888 like really connecting to 127.0.0.1:22(forward local port to remote port)\n     Now anyone who connect to 127.0.0.1:80 will connect to 127.0.0.1:22 in fact(forward remote port to local port)\n   If you want to open a new listener on node 3 for accepting the following nodes connection,you can use &#34;listen&#34; command\n      This porject is coding just for fun , the logic structure and code structure are not strict enough, please don&#39;t be so serious about it\n This program will be slightly bigger than usual after compiled, but actually through my test , it just 1 MB more than usual,Maybe slightly big on IOT platform(1MB maybe not a big deal lol),so if you got any problem when you are using it on IOT platform,just tell me, and i will try my best to decrease the size.\n The executable file after upx compress seems much more smaller than original one and it really makes upload stowaway to target server easily,but actually ,although it can make uploading stuff easier,it will occupy slightly more memory than original one,so pick the suitable version(upx or non-upx) depends on the target you want to use stowaway on.\n  If you want to compile this project from source code,you can run build_admin.sh/build_agent.sh（Be Mentioned!!!!!!!!!! The default compile result is AGENT mode and please run build_agent.sh. But if you want to compile ADMIN mode,please see the main.go file and FOLLOW THE INSTRUCTION, and next you can run build_admin.sh to get admin mode program.)", "posttime": "2020-06-16 20:26:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "用于,multi,节点", "title": "Stowaway-用于戊酯的多跳代理工具", "title_en": "Stowaway – Multi-hop Proxy Tool for pentesters", "transed": 1, "url": "https://github.com/ph4ntonn/Stowaway/blob/master/README_EN.md", "via": "", "real_tags": ["用于", "multi", "节点"]}, {"category": "", "categoryclass": "", "imagename": "fa0d6b5b966f989095909fac4e57fbfc.jpg", "infoid": 1006800, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "欧盟委员会今天将对苹果的App Store和Apple Pay的做法展开两项反垄断调查。\n第一项调查将调查苹果的App Store政策是否违反了欧盟的竞争规则，此前Spotify和乐天(Rakuten)投诉苹果通过其App Store将电子书的订阅和销售削减30%。\n欧盟反垄断部门负责人玛格丽特·维斯特格(Margrethe Vestager)表示：“我们需要确保，在苹果与其他应用开发商竞争的市场上，苹果的规则不会扭曲竞争，例如与其音乐流媒体服务Apple Music或Apple Books竞争。”“因此我决定密切关注苹果App Store的规定，以及它们对欧盟竞争规定的遵守情况.”\nSpotify声称苹果利用其App Store扼杀创新，限制消费者的选择，转而支持自己的Apple Music服务。乐天今年早些时候向欧盟提出了类似的申诉，声称苹果在推广自己的苹果图书服务的同时，对通过App Store销售的电子书收取30%的佣金，这是反竞争的。\n在App Store调查的同时，欧盟执委会还将调查Apple Pay，以评估苹果的支付系统是否违反了欧盟的竞争规则。苹果对其iPhone和Apple Watch设备的近场通信(NFC)功能的使用受到限制，此举意味着银行和其他金融服务提供商不能通过自己的应用程序提供NFC支付。\n维斯特格指出，由于冠状病毒大流行，欧洲移动支付的增加是其Apple Pay调查的动机。维斯塔格说：“苹果似乎为Apple Pay在商家的应用程序和网站中的使用设定了条件。”“它还将iPhone的‘点击即走’功能保留给Apple Pay。重要的是，苹果的措施不会剥夺消费者从新支付技术中获得的好处，包括更好的选择、质量、创新和具有竞争力的价格。“。\n就在对Apple Pay进行调查的几个月前，德国议员投票通过了一项立法，该立法可能迫使苹果允许其他公司访问其手机的NFC芯片。苹果公司对这项立法草案感到惊讶，声称此举“可能会损害用户友好性、数据保护和金融信息安全”。\n这两项正式的反垄断调查都将从今天开始，欧盟委员会承诺“作为优先事项”进行深入调查。就在调查进行的前一天，苹果公司兜售了一项新研究的结果，该研究称，App Store在2019年为实体产品和服务以及数字产品的估计总账单和销售额贡献了5190亿美元。\n苹果发言人在给The Verge的一份声明中表示：“令人失望的是，欧盟委员会(European Commission)提出了少数几家公司的无端投诉，这些公司只是想搭便车，不想像其他人一样遵守同样的规则。”“我们认为这是不对的--我们希望维持一个公平的竞争环境，让任何有决心和伟大想法的人都能成功。”\n苹果现在表示，它欢迎有机会向欧盟委员会证明它心中有一个简单的目标。“归根结底，我们的目标很简单：让我们的客户能够在安全可靠的环境中使用他们选择的最好的应用程序或服务。我们欢迎有机会向欧盟委员会展示我们为实现这一目标所做的一切。“。\nSpotify在给The Verge的一份声明中称此次调查对消费者、Spotify和开发者来说是“美好的一天”。“我们欢迎欧盟委员会正式调查苹果的决定，并希望他们能迅速采取行动，确保数字经济中所有参与者在iOS平台上的公平竞争。”", "note_en": "The European Commission is opening two antitrust investigations into Apple’s App Store and Apple Pay practices today.\n The first investigation will probe whether Apple has broken EU competition rules with its App Store policies, following complaints by Spotify and Rakuten over Apple’s 30 percent cut on subscriptions and sales of ebooks through its App Store.\n “We need to ensure that Apple’s rules do not distort competition in markets where Apple is competing with other app developers, for example with its music streaming service Apple Music or with Apple Books,”  says Margrethe Vestager, the head of the EU’s antitrust division. “I have therefore decided to take a close look at Apple’s App Store rules and their compliance with EU competition rules.”\n  Spotify has claimed Apple uses its App Store to stifle innovation and limit consumer choice in favor of its own Apple Music service.  Rakuten filed a similar complaint to the EU earlier this year, alleging that it’s anti-competitive for Apple to take a 30 percent commission on ebooks sold through the App Store while promoting its own Apple Books service.\n   Alongside the App Store investigation, the European Commission will also look at Apple Pay to assess whether Apple’s payment system violates EU competition rules. Apple has limited access to the Near Field Communication (NFC) functionality of its iPhone and Apple Watch devices, a move that means banks and other financial service providers can’t offer NFC payments through their own apps.\n Vestager points to an increase in mobile payments in Europe, due to the ongoing coronavirus pandemic, as motivation for its Apple Pay investigation. “It appears that Apple sets the conditions on how Apple Pay should be used in merchants’ apps and websites,” says Vestager. “It also reserves the ‘tap and go’ functionality of iPhones to Apple Pay. It is important that Apple’s measures do not deny consumers the benefits of new payment technologies, including better choice, quality, innovation and competitive prices.”\n  The investigation into Apple Pay comes months after  German lawmakers voted in favor of legislation that could force Apple to allow other companies to access its phone’s NFC chips. Apple was left surprised by the draft legislation, claiming that the move “could be harmful to user friendliness, data protection, and the security of financial information.”\n Both formal antitrust investigations will begin today, with the Commission promising to carry out in-depth investigations “as a matter of priority.” The investigations come just a day after Apple  touted the findings of a new study that says the App Store was responsible for $519 billion in estimated total billings and sales of both physical products and services and digital goods in 2019.\n “It’s disappointing the European Commission is advancing baseless complaints from a handful of companies who simply want a free ride, and don’t want to play by the same rules as everyone else,” says an Apple spokesperson in a statement to  The Verge. “We don’t think that’s right — we want to maintain a level playing field where anyone with determination and a great idea can succeed.”\n Apple now says it welcomes the opportunity to prove to the European Commission it has a simple goal in mind. “At the end of the day, our goal is simple: for our customers to have access to the best app or service of their choice, in a safe and secure environment. We welcome the opportunity to show the European Commission all we’ve done to make that goal a reality.”\n Spotify described the investigation as a “good day” for consumers, Spotify, and developers in a statement to  The Verge. “We welcome the European Commission’s decision to formally investigate Apple, and hope they’ll act with urgency to ensure fair competition on the iOS platform for all participants in the digital economy.”", "posttime": "2020-06-16 20:08:29", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "苹果,app,apple,rust", "title": "欧盟对App Store和Apple Pay做法展开苹果反垄断调查", "title_en": "EU opens Apple antitrust investigations into App Store and Apple Pay practices", "transed": 1, "url": "https://www.theverge.com/2020/6/16/21292651/apple-eu-antitrust-investigation-app-store-apple-pay", "via": "", "real_tags": ["苹果", "app", "apple", "rust"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1006799, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "DBCore现在可以生成一个类型脚本/反应CRUDUI，该CRUDUI会自动连接到生成的REST API(在GO中)。\n该项目的目标主要是为全栈应用程序提供尽可能多的有用样板。该系统可能不足以成为一个完整的应用程序开发平台。它目前缺少挂钩、覆盖和按行/按表授权。\n从长远来看，UI代码生成可能比API更没有用处，因为UI必然非常多样化。但是，既然在代码生成中已经处理好了，那么不需要再次构建相同的浏览器端API、身份验证和路由逻辑是一件好事。\n以下是示例/待办事项应用程序的一些屏幕截图。这里的Everypage是在读取数据库模式后自动生成的。浏览器应用程序与类似的自动生成的API挂钩。\nDBCore的新特性：从您的数据库模式生成并与类似生成的Go REST API挂钩的TypeScript/Reaction UI。因此您现在可以从数据库模式生成完整堆栈应用程序。帖子里的截图。https://t.co/BTGRVBsfUR。\n-菲尔·伊顿(@Phil_Eaton)2020年6月14日", "note_en": "DBCore can now generate a TypeScript/React CRUDUI that is automatically hooked up to the generated REST API (in Go).\n    The goal of this project is primarily to provide as much usefulboilerplate as possible for full-stack applications. The system isprobably not sufficient to be an entire application developmentplatform. It&#39;s currently missing hooks, overrides, andper-row/per-table authorization.\n The UI code generation may be even less useful in the long-term thanthe API because UIs are by necessity very diverse. But it is good notto need to build the same browser-side API, authentication, androuting logic again now that it&#39;s taken care of in code generation.\n  Here are a few screenshots of the examples/todo application. Everypage here is auto-generated after reading the database schema. Thebrowser application is hooked up to the similarly auto-generated API.\n         What&#39;s new in DBCore: a TypeScript/React UI generated from your database schema and hooked up to the similarly generated Go REST API.  So you can now generate an entire full stack application from your database schema. Screenshots in the post. https://t.co/BTGRVBsfUR\n— Phil Eaton (@phil_eaton)  June 14, 2020", "posttime": "2020-06-16 20:08:09", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "数据库,程序,database,app,full", "title": "从数据库生成完整堆栈应用程序", "title_en": "Generating a full-stack application from a database", "transed": 1, "url": "https://notes.eatonphil.com/generating-a-full-stack-application-from-a-database.html", "via": "", "real_tags": ["数据库", "程序", "database", "app", "full"]}, {"category": "", "categoryclass": "", "imagename": "730059dd215a8651222706259c9badde.jpg", "infoid": 1006798, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "东京-从今年开始，总部位于英国的投资管理公司日本法律与投资管理公司(Legal&Amp；General Investment Management)将投票反对日本所有TOPIX 100家公司，这些公司的董事会中至少没有一名女性代表。\n与此同时，如果一家公司的董事会至少缺少一名女性成员，高盛资产管理公司(Goldman Sachs Asset Management)将反对该公司提名委员会的候选人或高管。\n随着年度股东大会的召开，这些都是日本公司面临来自外国机构投资者的越来越大的压力的例子，因为担任最高职位的女性越来越少。\n更好的多样性带来了经济和文化上的好处，Legal&amp；General Investment在宣布这项新政策时表示。该公司将这一目标描述为在日本推动多样性。\n政府一直在推动日本企业界对女性管理层更加欢迎。2018年发布的治理准则称，董事会应该多样化，包括性别和国际经验。\n根据东京证券交易所的数据，截至2019年7月，JPX 400指数成份股公司中有63%的公司至少有一名女性董事会成员。虽然这一比例高于2018年12月的54%，但超过三分之一的董事会仍然全部为男性。\n超过90%的美国和欧洲大公司都有女性董事。虽然投资者对日本在整个社会性别平等方面进展相对缓慢的做法有些松懈，但他们已经开始采取更强硬的路线。\n总部位于美国的道富全球顾问公司(State Street Global Advisors)将投票反对董事会中没有女性且最近没有参加性别多样性对话的公司的所有提名委员会现任成员，扩大了之前仅适用于高管的政策。\n代理顾问格拉斯·刘易斯(Glass Lewis)曾建议投票反对任命全为男性董事会的TOPIX 100公司的高级董事，现在该公司将这一政策适用于东京证交所第一和第二板块的所有企业。\n这一趋势让一些公司汗流浃背。日本中部铁路的董事会候选人名单中没有女性，该公司正试图说服投资者无论如何都要在下周的股东大会上通过这项提议，辩称它并不是试图将女性拒之门外。\n铁路运营商JR Central表示：当我们成立时，“劳工标准法案”禁止女性加班，因此我们别无选择，只能限制雇佣女性。\n根据日本劳动政策和培训研究所(Japan Institute For Labor Policy And Training)的数据，截至2018年，日本约有15%的管理职位由女性担任。相比之下，美国和英国的这一比例超过了35%。内部晋升一直很缓慢，部分原因是潜在候选人的人才库有限。\nGlass Lewis的上野直子(Naoko Ueno)表示，投资者采取更强硬的立场，是为了推动企业在力所能及的情况下培养更多具有管理潜力的女性人才。", "note_en": "TOKYO -- Starting this year, U.K.-based investment management firm Legal &amp; General Investment Management will vote against all Topix 100 companies in Japan that do not have at least one woman representative on their board.\n Goldman Sachs Asset Management, meanwhile, will oppose candidates for a company&#39;s nominating committee or top executives if its board lacks at least one female member.\n These are examples of the growing pressure Japanese companies face from foreign institutional investors over the dearth of women in top roles as annual shareholder meetings get underway.\n  Better diversity &#34;brings economic as well as cultural benefits,&#34; Legal &amp; General Investment said when announcing the new policy. The company described the goal as &#34;moving the needle on diversity in Japan.&#34;\n The government has pushed for corporate Japan to be more welcoming to women in management. The governance code issued in 2018 says boards should be diverse, including in gender and international experience.\n As of July 2019, 63% of companies in the JPX 400 had at least one female board member, according to the Tokyo Stock Exchange. While this is up from 54% in December 2018, more than a third of boards remain all-male.\n More than 90% of major American and European companies have female directors. While investors had given Japan some slack for its relatively slow progress on gender equality in society as a whole, they have begun taking a tougher line.\n U.S.-based State Street Global Advisors will vote against all nominating committee incumbents for companies that have no women on their boards and have not participated recently in dialogue on gender diversity, expanding a prior policy that applied only to top executives.\n Proxy adviser Glass Lewis, which has recommended voting against the appointment of top directors of Topix 100 companies with all-male boards, now applies this policy to all businesses on the first and second sections of the TSE.\n The trend is making some companies sweat.  Central Japan Railway, which has no women on its slate of board candidates, is trying to persuade investors to pass the proposal anyway at next week&#39;s general meeting by arguing that it is not trying to keep women out.\n &#34;When we were established, the Labor Standards Act had prohibited women from working late hours, so we had no choice but to limit hiring&#34; of women, said the railway operator, known as JR Central.\n About 15% of managerial positions in Japan were held by women as of 2018, according to the Japan Institute for Labor Policy and Training. This compares with more than 35% in the U.S. and the U.K. Internal promotions have been slow, owing partly to limited pools of potential candidates.\n Investors&#39; tougher stance is intended to push companies to cultivate more female talent with management potential while they can, said Naoko Ueno of Glass Lewis.", "posttime": "2020-06-16 19:50:36", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "日本,投资者,male,女性", "title": "日本全由男性组成的董事会面临外国投资者的拒绝", "title_en": "Japan's all-male boards face rejection by foreign investors", "transed": 1, "url": "https://asia.nikkei.com/Business/Business-trends/Japan-s-all-male-boards-face-rejection-by-foreign-investors", "via": "", "real_tags": ["日本", "投资者", "male", "女性"]}, {"category": "", "categoryclass": "", "imagename": "431a92a7c59ed1a02bf769151e19caa6.jpg", "infoid": 1006797, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "迪拜是一座消防员使用喷气背包的城市，群岛是从零开始建造的，建筑物爬上云端；在广阔的红色沙漠中，迪拜是一个光滑的大都市。第一次参观的人会认为他们无意中发现了一部科幻电影的布景，这是情有可原的。\n2017年，阿联酋宣布了在未来100年内殖民火星的雄心。但建筑师们已经在想象火星城市会是什么样子，并计划在迪拜郊外的沙漠中重建它。\n火星科学城最初计划覆盖17.6万平方米的沙漠，相当于30多个足球场的大小，耗资约1.35亿美元。\n为了给迪拜的穆罕默德·本·拉希德太空中心(MBRSC)开发殖民火星所需的技术，建筑师Bjarke Ingels Group被要求设计一个适合在火星上维持生命的城市原型，然后对其进行改造，以用于阿联酋沙漠。\n为了这个独特的任务，建筑师们首先必须克服巨大的挑战，创造一个让火星不适宜居住的环境变得宜居的设计。\n火星的大气层稀薄，没有全球磁场，因此对有害辐射的防护很少。温度是另一个问题--火星的平均温度是零下63摄氏度(零下81华氏度)。稀薄的大气也意味着那里的气压很小，所以液体很快就会蒸发成气体；尽管温度很低，没有保护措施的人类血液还是会在火星上沸腾。\n但据与迪拜项目无关的伦敦帝国理工学院空间实验室主任乔纳森·伊斯特伍德(Jonathan Eastwood)表示，在火星上生活的挑战远远超出了技术层面。\n伊斯特伍德解释说，我认为要在火星上持续存在，最大的挑战不是工程[或科学]挑战，而是人类[和]个人的挑战。\n所以，不仅要回答你如何生存的问题，还要回答你如何茁壮成长的问题。\nBjarke Ingels Group的合伙人雅各布·兰格(Jakob Lange)希望他的设计能支持后者，他向CNN解释了他和他的团队计划如何克服这颗红色星球带来的挑战。\n为了保持舒适的温度和适宜居住的气压，火星城市将由加压的生物穹顶组成，每个生物穹顶上都覆盖着一层透明的聚乙烯膜。通过向地下冰通电而产生的氧气将充满每个生物圈。\n随着火星上人口的增长，生物穹顶将连接在一起形成村庄，并最终形成环形或环状的城市。\n这座城市将使用太阳能供电和供暖，稀薄的大气实际上可以帮助穹顶保持温度。\n兰格说，由于火星上的大气层很少，热量传递将非常低，这意味着圆顶内的空气冷却速度不会像地球上那样快。\n建筑物将在圆顶下进行3D打印，使用火星土壤，房间将延伸到地下20英尺，以防止有害的辐射和流星。\n超凡脱俗的设计甚至在一些地方变得有点好玩。兰格说，将来在火星上，你的地下洞穴里会有天窗，就像鱼缸一样，鱼在周围游动。水窗将保护居民免受辐射，同时允许光线进入地下房间。\n火星建筑不再受地球物理的束缚，可以呈现出一种全新的形式。\n兰格说，大约有三分之一的重力，这意味着你可以突然制造出[更细]的柱子，[有]更长的结构跨度。它创建的几乎就像是一个全新的规则集，您在设计空间建筑时必须遵循这些规则。\n根据伊斯特伍德的说法，该设计满足了火星带来的挑战。他说：我认为(这些设计元素)绝对是长期存在的关键基础设施的一部分。逐渐屏蔽[不受辐射]的想法是明智的[.]。水窗的想法相当优雅。\nMBRSC表示，科学城仍处于概念阶段，尚未敲定最终建筑的设计或建筑师，但BIG已经研究出，如果被选中，它将如何调整自己的提议，以适应迪拜沙漠。\n在地球上，穹顶不需要加压或充氧，建筑物将由沙漠沙子而不是火星土壤进行3D打印。但水的天窗仍然存在，而且它也将由太阳能供电。\n在BIG&#39；的设计中，以及研究实验室，火星科学城将包括教育设施、博物馆、圆形剧场和联合办公空间。\n到目前为止，还没有关于何时开工或何时开放的时间表，但MBRSC表示，它目前正在对规格进行详细研究，并将利用这些规格制定修改后的预算和场地规模。\n火星科学城只是迪拜穆罕默德·本·拉希德太空中心雄心勃勃的太空计划的一部分。去年，它将第一名宇航员送入太空；今年夏天，它将向火星发射探测器，11月，它将执行有史以来第一次模拟任务。\n这项为期8个月的冒险活动将在俄罗斯进行，一名阿联酋船员将被选为一个6人国际团队的成员。该任务将测试隔离和禁闭对身心健康的影响。\n地球上其他用于模拟太空任务条件的地方包括南极洲的康科迪亚空间站(用于模拟与世隔绝)，加利福尼亚州的莫哈韦沙漠(NASA曾用来测试火星漫游者)，以及摩洛哥撒哈拉，欧洲航天局(European Space Agency)将其用作火星模拟物。\nMBRSC希望，在未来，这样的研究可以在火星科学城进行。\nMBRSC的火星2117项目经理阿德南·阿尔赖斯(Adnan AlRais)说，这将是我们的平台，我们可以在这里发展科学[和]技术，这将有助于我们未来的火星任务。我们想要想出一个全新的设施来帮助国际社会。\n为了在不到一个世纪的时间里实现殖民目标，MBRSC承认，对太空旅行的热情将不得不代代相传。它希望火星科学城能激励下一代梦想在这个红色星球上生活，使之成为现实。", "note_en": "Dubai is a city where firefighters use jetpacks,  archipelagos are built from scratch, and  buildings climb into the clouds; a slick metropolis in the middle of a vast red desert. First-time visitors would be forgiven for thinking they had stumbled onto a film set for a sci-fi movie.\n  In 2017, the United Arab Emirates announced its ambition to colonize Mars within the next 100 years. But architects are already imagining what a Martian city might look like -- and planning to recreate it in the desert outside Dubai.\n  Mars Science City was originally earmarked to cover 176,000 square meters of desert -- the size of more than 30 football fields -- and cost approximately $135 million.\n Intended as a space for Dubai&#39;s Mohammed Bin Rashid Space Centre (MBRSC) to develop the technology needed to colonize Mars, architects Bjarke Ingels Group  were asked to design a prototype of a city suitable for sustaining life on Mars -- and then adapt it for use in the Emirati desert.\n  For this unique commission, the architects first had to overcome the immense challenges of creating a design to make the inhospitable environment of Mars habitable.\n Mars has a thin atmosphere and no global magnetic field, so there&#39;s little protection from harmful radiation. Temperature is another problem -- the average on Mars is a chilly -63 degrees C (-81 degrees F). The thin atmosphere also means there&#39;s little air pressure, so liquids quickly evaporate into gas; despite freezing temperatures, an unprotected human&#39;s blood would boil on Mars.\n  But according to Jonathan Eastwood, director of the Space Lab at Imperial College London, who&#39;s not connected with the Dubai project, the challenges of living on Mars extend far beyond technicalities.\n &#34;I think the biggest challenge in terms of a sustained presence on Mars is not the engineering [or scientific] challenge, but the human [and] personal one,&#34; Eastwood explained.\n &#34;So not just to answer the question about how do you survive, but how do you thrive?&#34;\n  Hoping his design will allow for the latter, Jakob Lange, partner at Bjarke Ingels Group, explained to CNN how he and his team plan to overcome the challenges posed by the Red Planet.\n To maintain a comfortable temperature and habitable air pressure, the Martian city would be made up of pressurized biodomes each covered with a transparent polyethylene membrane. Oxygen, made by applying electricity to underground ice, would fill each biodome.\n   As the population on Mars grows, biodomes would be joined together to form villages and eventually form cities in the shape of rings, or &#34;toruses.&#34;\n The city would be powered and heated using solar energy, and the thin atmosphere could actually help the domes maintain their temperature.\n &#34;Since there is very little atmosphere on Mars, the heat transfer will be very low, meaning that the air inside the domes will not cool down as fast as it would on Earth,&#34; said Lange.\n Buildings would be 3D printed under the domes, using Martian soil, and rooms would extend 20 feet underground, protecting from harmful radiation and meteors.\n The unearthly design even becomes a little playful in places. &#34;In the future on Mars, you would have skylights in your underground cave that would be like aquariums, with fish swimming around,&#34; said Lange. The water-windows would shield the residents from radiation while allowing light to enter the underground rooms.\n  No longer bound by Earth&#39;s physics, Martian architecture can take on a whole new form.\n &#34;There is approximately one-third gravity which means that you can suddenly make columns that are [slimmer] and [have] longer spans of structures,&#34; Lange said. &#34;It creates almost like a completely new rule set that you have to follow when designing architecture in space.&#34;\n According to Eastwood, the design meets the challenges posed by Mars. &#34;I think [these design elements] definitely [are] part of the key infrastructure for a long-term presence,&#34; he said. &#34;The idea of gradually shielding [from radiation] is sensible [...] The idea of water windows is quite elegant.&#34;\n MBRSC says the Science City is still in the concept stage, and that it hasn&#39;t yet settled on a design or architect for the final build, but BIG has already worked out how it would adapt its proposal for the Dubai desert, if selected.\n  On Earth, domes wouldn&#39;t need to be pressurized or filled with oxygen, and buildings would be 3D-printed from desert sand rather than Martian soil. But the water skylights would still be present, and it would also be powered by solar energy.\n In BIG&#39;s design, as well as research labs, Mars Science City will contain an educational facility, museum, an amphitheater, and co-working office space.\n As yet, there&#39;s no timeline for when construction will begin, or when it will open, but MBRSC says it is currently conducting a detailed study of the specifications, which it will use to develop a revised budget and size for the site.\n  Mars Science City is only one part of the ambitious space program run by Dubai&#39;s Mohammed Bin Rashid Space Centre. Last year it sent  its first astronaut into space; this summer it will  launch a probe to Mars, and in November it will undertake its first-ever analog mission.\n  The eight-month venture will take place in Russia and one Emirati crewmember will be chosen as part of an international team of six. The mission will test the effects of isolation and confinement on mental and physical health.\n Other places on Earth used to mimic conditions for space missions include Antarctica&#39;s Concordia Station, used to simulate isolation, California&#39;s Mojave Desert, which NASA has used to test Mars rovers, and the Moroccan Sahara, used by the European Space Agency as a Mars analog.\n The MBRSC hopes that, in future, such research could take place in Mars Science City.\n &#34;This is going to be our platform where we can develop the science [and] the technology that will help us in our future missions to Mars,&#34; said Adnan AlRais, Mars 2117 Program Manager at MBRSC. &#34;We want to come up with a totally new facility that will help the international community.&#34;\n To reach its goal of colonization in less than a century, the MBRSC acknowledges enthusiasm for space travel will have to pass down multiple generations. It hopes Mars Science City will inspire the next generation to dream of life on the Red Planet enough to make it a reality.", "posttime": "2020-06-16 19:15:18", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "火星,建筑,设计,建筑师,designed", "title": "建筑师为迪拜郊外的沙漠设计了一座火星城市。", "title_en": "Architects have designed a Martian city for the desert outside Dubai", "transed": 1, "url": "https://edition.cnn.com/style/article/mars-science-city-design-spc-scn/index.html", "via": "", "real_tags": ["火星", "建筑", "设计", "建筑师", "designed"]}, {"category": "", "categoryclass": "", "imagename": "55abdefb2bb1245bd8de14305def1b72.jpg", "infoid": 1006796, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "物理学家已经追踪到自然界四种力中的三种-电磁力和强核力和弱核力-可以追溯到它们起源于量子粒子。但是第四个基本力，重力，是不同的。\n我们目前理解引力的框架是由阿尔伯特·爱因斯坦(Albert Einstein)在一个世纪前设计的，它告诉我们，苹果是从树上掉下来的，而行星围绕恒星运行，因为它们在时空连续体中沿着曲线移动。这些曲线是重力。根据爱因斯坦的说法，重力是时空媒介的一个特征；其他自然力都在那个舞台上发挥作用。\n但是在黑洞中心附近，或者在宇宙的最初时刻，爱因斯坦的方程式就破裂了。物理学家需要更真实的引力图像来准确描述这些极端情况。这一更真实的理论必须做出与爱因斯坦方程式在其他任何地方所做的预测相同的预测。\n物理学家认为，在这个更真实的理论中，重力必须像其他自然力一样具有量子形式。自20世纪30年代以来，研究人员一直在寻求引力的量子理论。他们已经找到了候选的想法-特别是弦理论，该理论认为重力和所有其他现象都是由微小的振动弦产生的-但到目前为止，这些可能性仍然是推测的，还没有完全理解。建立起作用的量子引力理论可能是当今物理学最崇高的目标。\n是什么让重力独一无二呢？第四种力有什么不同，使研究人员无法找到其潜在的量子描述？我们询问了四位不同的量子引力研究人员。我们有四个不同的答案。\n伦敦帝国理工学院(Imperial College London)的理论物理学家克劳迪娅·德·拉姆(Claudia De Rham)一直致力于质量引力理论的研究，该理论假设量化的重力单位是质量粒子：\n爱因斯坦的广义相对论正确地描述了近30个数量级的引力行为，从亚毫米尺度一直到宇宙距离。没有其他的自然力被如此精确地描述过，而且描述的尺度如此之多。有了与实验和观测完美一致的水平，广义相对论似乎提供了对引力的终极描述。然而，广义相对论的不同寻常之处在于它预言了自己的衰落。\n广义相对论给出了关于黑洞和宇宙起源的大爆炸的预言。然而，这些地方的“奇点”，即时空曲率似乎变得无限的神秘点，充当着广义相对论崩溃的旗帜。当人们接近黑洞中心的奇点或大爆炸奇点时，从广义相对论中推断出来的预测就不再提供正确的答案。对空间和时间的更基本、更基本的描述应该取而代之。如果我们揭开这一新的物理层，我们也许能够实现对空间和时间本身的新理解。\n如果重力是自然界的任何其他力量，我们可以希望通过能够达到更大能量和更小距离的工程实验来更深入地研究它。但是重力不是普通的力。试图把它推到某个点之后才揭开它的秘密，实验仪器本身就会坍塌成一个黑洞。\n麻省理工学院(Massachusetts Institute Of Technology)量子引力理论家丹尼尔·哈洛(Daniel Harlow)以将量子信息理论应用于引力和黑洞研究而闻名：\n黑洞是引力和量子力学难以结合的原因。黑洞只能是重力的结果，因为引力是所有物质唯一能感觉到的力。如果有任何类型的粒子没有感觉到重力，我们可以用那个粒子从黑洞内部发出信息，所以它实际上不会是黑色的。\n所有物质都感觉到引力的事实对可能的实验类型带来了限制：无论你建造什么仪器，无论它是由什么组成的，它都不能太重，否则它必然会在引力的作用下坍塌成一个黑洞。但这个限制在日常情况下并不相关，但如果你试图构建一个实验来测量重力的量子力学属性，它就变得至关重要。\n我们对其他自然力的理解是建立在局部性原则的基础上的，即描述空间中每个点发生的事情的变量-例如那里的电场强度-都可以独立变化。而且，这些我们称之为“自由度”的变量只能直接影响它们的近邻。局部性对我们目前描述粒子及其相互作用的方式很重要，因为它保留了因果关系：如果马萨诸塞州剑桥市的自由度取决于旧金山的自由度，我们或许能够利用这种依赖性来实现两个城市之间的即时交流，甚至将信息及时向后发送，从而可能违反因果关系。\n局部性假设在普通环境中已经得到了很好的测试，似乎很自然地假设它延伸到与量子重力相关的非常短的距离(这些距离很小，因为重力比其他力弱得多)。要确认局部性在这些距离尺度上持续存在，我们需要建造一种能够测试被如此小距离隔开的自由度的独立性的仪器。然而，一个简单的计算表明，一个足够重的设备，如果足够重，可以避免其位置上的巨大量子波动，这将毁掉实验，那么它也一定会足够重，足以坍塌成黑洞！因此，在这种规模上进行实验确认局部性是不可能的。因此，量子引力不需要在这样的长度尺度上考虑局域性。\n事实上，到目前为止，我们对黑洞的理解表明，任何量子引力理论的自由度都应该比我们根据对其他力的经验所预期的要少得多。这个想法被编纂在“全息原理”中，粗略地说，空间区域中的自由度数与其表面积成正比，而不是与其体积成正比。\n新泽西州普林斯顿高级研究所(Institute For Advanced Study)的量子引力理论家胡安·马尔达塞纳(Juan Maldacena)最出名的是发现了引力和量子力学之间的全息图关系：\n粒子可以表现出许多有趣和令人惊讶的现象。我们可以自发地产生粒子，在相隔很远的粒子的状态之间纠缠，以及在多个位置叠加存在的粒子。\n在量子引力中，时空本身的行为方式很新奇。我们拥有的不是粒子的创造，而是宇宙的创造。纠缠被认为在遥远的时空区域之间建立了联系。我们有不同时空几何的宇宙叠加。\n此外，从粒子物理学的角度来看，空间真空是一个复杂的物体。我们可以想象许多被称为场的实体，它们相互叠加，延伸到整个空间。每个场的值都在短距离内不断波动，在这些波动的场及其相互作用中，真空状态就出现了。粒子在这种真空状态下是扰动。我们可以把它们想象成真空结构中的小缺陷。\n当我们考虑重力时，我们发现宇宙的膨胀似乎无中生有地产生了更多的真空物质。当时空被创造时，它恰好处于与真空相对应的状态，没有任何缺陷。真空是如何以正确的排列出现的，这是我们需要回答的主要问题之一，以获得对黑洞和宇宙学的一致的量子描述。在这两种情况下，都有一种时空的伸展，导致产生更多的真空物质。\n塞拉·克雷莫尼尼(Sera Cremonini)是利哈伊大学(Lehigh University)的理论物理学家，从事弦理论、量子引力和宇宙学的研究：\n重力之所以特殊，原因有很多。让我把重点放在一个方面，即爱因斯坦广义相对论的量子版本是“不可重整化的”。这对高能时的重力行为有一定的影响。\n在量子理论中，当你试图计算非常高能的粒子如何相互散射和相互作用时，就会出现无限项。在可重整化的理论中-包括描述除重力之外的所有自然力的理论-我们可以通过适当地添加其他有效地抵消它们的量，即所谓的反项，以严格的方式消除这些无穷大。这个重整化过程产生了物理上合理的答案，这些答案与实验相符，具有非常高的精确度。\n量子版广义相对论的问题在于，描述高能引力子相互作用的计算--引力的量子化单位--会有无限多的无穷多项。在一个永无止境的过程中，您需要添加无限多个对立项。重整化将失败。正因为如此，爱因斯坦广义相对论的量子版本不能很好地描述高能引力。它一定是缺少了重力的一些关键特征和成分。\n然而，我们仍然可以使用自然界中其他相互作用的标准量子技术，在较低的能量下完美地近似描述重力。关键的一点是，这种对重力的近似描述将在某个能量尺度上崩溃--或者等同地，在某个长度以下。\n在这个能量标度之上，或者在相关的长度标度之下，我们期望发现新的自由度和新的对称性。为了准确捕捉这些特征，我们需要一个新的理论框架。这正是弦理论或一些适当的推广的用武之地：根据弦理论，在很短的距离内，我们会看到引力子和其他粒子是延伸的物体，称为弦。研究这种可能性可以给我们提供关于引力量子行为的宝贵经验。", "note_en": "Physicists have traced three of the four forces of nature — the electromagnetic force and the strong and weak nuclear forces — to their origins in quantum particles. But the fourth fundamental force, gravity, is different.\n Our current framework for understanding gravity, devised a century ago by Albert Einstein, tells us that apples fall from trees and planets orbit stars because they move along curves in the space-time continuum. These curves are gravity. According to Einstein, gravity is a feature of the space-time medium; the other forces of nature play out on that stage.\n But near the center of a black hole or in the first moments of the universe, Einstein’s equations break. Physicists need a truer picture of gravity to accurately describe these extremes. This truer theory must make the same predictions Einstein’s equations make everywhere else.\n Physicists think that in this truer theory, gravity must have a quantum form, like the other forces of nature. Researchers have sought the quantum theory of gravity since the 1930s. They’ve found candidate ideas — notably string theory, which says gravity and all other phenomena arise from minuscule vibrating strings — but so far these possibilities remain conjectural and incompletely understood. A working quantum theory of gravity is perhaps the loftiest goal in physics today.\n What is it that makes gravity unique? What’s different about the fourth force that prevents researchers from finding its underlying quantum description? We asked four different quantum gravity researchers. We got four different answers.\n  Claudia de Rham , a theoretical physicist at Imperial College London, has worked on theories of massive gravity, which posit that the quantized units of gravity are massive particles:\n Einstein’s general theory of relativity correctly describes the behavior of gravity over close to 30 orders of magnitude, from submillimeter scales all the way up to cosmological distances. No other force of nature has been described with such precision and over such a variety of scales. With such a level of impeccable agreement with experiments and observations, general relativity could seem to provide the ultimate description of gravity. Yet general relativity is remarkable in that it predicts its very own fall.\n General relativity yields the predictions of black holes and the Big Bang at the origin of our universe. Yet the “singularities” in these places, mysterious points where the curvature of space-time seems to become infinite, act as flags that signal the breakdown of general relativity. As one approaches the singularity at the center of a black hole, or the Big Bang singularity, the predictions inferred from general relativity stop providing the correct answers. A more fundamental, underlying description of space and time ought to take over. If we uncover this new layer of physics, we may be able to achieve a new understanding of space and time themselves.\n If gravity were any other force of nature, we could hope to probe it more deeply by engineering experiments capable of reaching ever-greater energies and smaller distances. But gravity is no ordinary force. Try to push it into unveiling its secrets past a certain point, and the experimental apparatus itself will collapse into a black hole.\n  Daniel Harlow , a quantum gravity theorist at the Massachusetts Institute of Technology, is known for applying quantum information theory to the study of gravity and black holes:\n Black holes are the reason it’s difficult to combine gravity with quantum mechanics. Black holes can only be a consequence of gravity because gravity is the only force that is felt by all kinds of matter. If there were any type of particle that did not feel gravity, we could use that particle to send out a message from the inside of the black hole, so it wouldn’t actually be black.\n The fact that all matter feels gravity introduces a constraint on the kinds of experiments that are possible: Whatever apparatus you construct, no matter what it’s made of, it can’t be too heavy, or it will necessarily gravitationally collapse into a black hole. This constraint is not relevant in everyday situations, but it becomes essential if you try to construct an experiment to measure the quantum mechanical properties of gravity.\n  Our understanding of the other forces of nature is built on the principle of locality, which says that the variables that describe what’s going on at each point in space — such as the strength of the electric field there — can all change independently. Moreover, these variables, which we call “degrees of freedom,” can only directly influence their immediate neighbors. Locality is important to the way we currently describe particles and their interactions because it preserves causal relationships: If the degrees of freedom here in Cambridge, Massachusetts, depended on the degrees of freedom in San Francisco, we may be able to use this dependence to achieve instantaneous communication between the two cities or even to send information backward in time, leading to possible violations of causality.\n The hypothesis of locality has been tested very well in ordinary settings, and it may seem natural to assume that it extends to the very short distances that are relevant for quantum gravity (these distances are small because gravity is so much weaker than the other forces). To confirm that locality persists at those distance scales, we need to build an apparatus capable of testing the independence of degrees of freedom separated by such small distances. A  simple calculation shows, however, that an apparatus that’s heavy enough to avoid large quantum fluctuations in its position, which would ruin the experiment, will also necessarily be heavy enough to collapse into a black hole! Therefore, experiments confirming locality at this scale are not possible. And quantum gravity therefore has no need to respect locality at such length scales.\n Indeed, our understanding of black holes so far suggests that any theory of quantum gravity should have substantially fewer degrees of freedom than we would expect based on experience with the other forces. This idea is codified in the “holographic principle,” which says, roughly speaking, that the number of degrees of freedom in a spatial region is proportional to its surface area instead of its volume.\n  Juan Maldacena , a quantum gravity theorist at the Institute for Advanced Study in Princeton, New Jersey, is best known for discovering a hologram-like relationship between gravity and quantum mechanics:\n Particles can display many interesting and surprising phenomena. We can have spontaneous particle creation, entanglement between the states of particles that are far apart, and particles in a superposition of existence in multiple locations.\n In quantum gravity, space-time itself behaves in novel ways. Instead of the creation of particles, we have the creation of universes. Entanglement is thought to create connections between distant regions of space-time. We have superpositions of universes with different space-time geometries.\n  Furthermore, from the perspective of particle physics, the vacuum of space is a complex object. We can picture many entities called fields superimposed on top of one another and extending throughout space. The value of each field is constantly fluctuating at short distances. Out of these fluctuating fields and their interactions, the vacuum state emerges. Particles are disturbances in this vacuum state. We can picture them as small defects in the structure of the vacuum.\n When we consider gravity, we find that the expansion of the universe appears to produce more of this vacuum stuff out of nothing. When space-time is created, it just happens to be in the state that corresponds to the vacuum without any defects. How the vacuum appears in precisely the right arrangement is one of the main questions we need to answer to obtain a consistent quantum description of black holes and cosmology. In both of these cases there is a kind of stretching of space-time that results in the creation of more of the vacuum substance.\n  Sera Cremonini , a theoretical physicist at Lehigh University, works on string theory, quantum gravity and cosmology:\n There are many reasons why gravity is special. Let me focus on one aspect, the idea that the quantum version of Einstein’s general relativity is “nonrenormalizable.” This has implications for the behavior of gravity at high energies.\n In quantum theories, infinite terms appear when you try to calculate how very energetic particles scatter off each other and interact. In theories that are renormalizable — which include the theories describing all the forces of nature other than gravity — we can remove these infinities in a rigorous way by appropriately adding other quantities that effectively cancel them, so-called counterterms. This renormalization process leads to physically sensible answers that agree with experiments to a very high degree of accuracy.\n  The problem with a quantum version of general relativity is that the calculations that would describe interactions of very energetic gravitons — the quantized units of gravity — would have infinitely many infinite terms. You would need to add infinitely many counterterms in a never-ending process. Renormalization would fail. Because of this, a quantum version of Einstein’s general relativity is not a good description of gravity at very high energies. It must be missing some of gravity’s key features and ingredients.\n However, we can still have a perfectly good approximate description of gravity at lower energies using the standard quantum techniques that work for the other interactions in nature. The crucial point is that this approximate description of gravity will break down at some energy scale — or equivalently, below some length.\n Above this energy scale, or below the associated length scale, we expect to find new degrees of freedom and new symmetries. To capture these features accurately we need a new theoretical framework. This is precisely where string theory or some suitable generalization comes in: According to string theory, at very short distances, we would see that gravitons and other particles are extended objects, called strings. Studying this possibility can teach us valuable lessons about the quantum behavior of gravity.", "posttime": "2020-06-16 18:56:52", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "地心引力,gravity,引力", "title": "为什么地心引力不同于其他力", "title_en": "Why Gravity Is Not Like the Other Forces", "transed": 1, "url": "https://www.quantamagazine.org/why-gravity-is-not-like-the-other-forces-20200615/", "via": "", "real_tags": ["地心引力", "gravity", "引力"]}, {"category": "", "categoryclass": "", "imagename": "1f175b3f16cbad00cccd64e7ccd35970.png", "infoid": 1006795, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "我将考虑的主要指标是CPU消耗、内存消耗，以及扩展是否会使页面呈现速度变慢。\n让我们先来看看100个最常用的Chrome扩展。每台机器的安装次数都超过了200万次。\n页面CPU时间页面主线程忙碌了多长时间，它在做什么？\nJavaScript执行或运行布局逻辑会阻塞浏览器主线程。这意味着浏览器无法响应用户交互。\n如果没有安装扩展，加载example.com大约需要40ms的CPU时间。如果你安装了Evernote或Grammarly，这个时间会跳到500ms以上。\n这个图表显示了100个最常用的Chrome扩展中最慢的20个。其他80个都给页面增加了不到100ms的额外CPU时间。\n这些扩展不是针对特定站点，而是向用户打开的每个页面添加代码。让我们来看看他们中的一些人在做什么。\nEvernote扩展拥有400多万用户。它向每个页面添加一个2.9MB的内容脚本。仅解析和编译该代码就花费了140ms。\n一旦加载了包，就需要对其进行评估，这又需要300ms。\n这段代码实际上有什么作用吗？据我所知，没有，除非用户点击了Evernote扩展图标。\n代码确实设置了当用户单击图标时触发的事件侦听器，但这可以在不加载完整的JavaScript包的情况下完成。\n扩展通常需要向每个页面注入代码，而不是只针对某些域。密码管理员需要检查是否有登录表。拼写检查器需要查找文本字段。\n但是，如果检查相关条件的代码与扩展的主要功能分开，性能会好得多。则大多数代码将仅在必要时加载。蜜糖在去年做出了这一改变，大大降低了它们对性能的影响。\n有趣的是，尽管Skype有一个很大的JavaScript包，但它只增加了150ms的CPU时间。我猜测这是因为代码主要由易于解析和计算的静态配置对象和长字符串组成。\n我很惊讶地看到Ghostery在名单上排在相对靠前的位置。与其他扩展不同的是，它实际上在页面上做了一些事情，即显示有多少跟踪器被阻止。\nGhostery加载了160KB的JavaScript，并增加了120ms的CPU时间-这并不是一个很大的数量。但是，其中一些代码是呈现阻塞的，我们将在下一节中看到。\n虽然额外的CPU时间意味着页面在一段时间内不会交互，但这通常不会完全阻止页面呈现。要查看扩展是否会阻止呈现，我们可以查看第一个内容画图指标--当浏览器开始显示文本或图像时。\n大多数扩展不引入或仅引入很小的呈现延迟。此图表显示了对初始内容呈现有最大负面影响的扩展。\nChrome扩展可以定义应该注入页面的脚本和样式表。默认情况下，一旦页面完成加载并处于空闲状态，就会将它们添加到页面中。\n但是，一旦页面开始加载，扩展开发人员就可以决定加载这些资源。例如，Dark Reader扩展将网站内容更改为黑色主题。首先以明亮的主题呈现页面，然后突然过渡，这将是不和谐的。在这里，在页面开始呈现之前运行代码是有意义的。\n这个代码的数量应该减少到最低限度。好消息是，图表中只有6个扩展导致呈现延迟超过100ms。\n在页面开始呈现之前，这些扩展都会运行大量代码。在Clear的情况下，页面内容只比没有安装扩展的情况晚了300ms才开始显示。\n虽然SafePrice不会等到页面空闲时才注入脚本，但它会等到文档加载完毕。我不确定为什么，但不知何故，JavaScript代码似乎仍然在初始呈现之前运行。\n并非浏览器扩展所做的所有处理都发生在用户可见的页面上。大多数Chrome扩展还有一个叫做后台页面的东西，它可以让扩展做一些事情，比如监听网络请求或更新扩展图标。\nAvira Browser Safety在后台页面运行代码的时间几乎是3秒，而所有其他扩展的运行时间都不到200毫秒。\n后台页通常运行代码以响应用户打开的页发出的网络请求。上一次测试中的页面仅发出一个网络请求，远远少于正常情况。所以我再次运行了这个测试，这一次加载了Apple主页，它发出了大约50个请求。\n有趣的是，Avira现在明显更快了，600ms而不是2.7s！到底怎么回事？\nAvira浏览器安全扩展包含带有30k+正则表达式的网站允许列表。当用户导航到新页面时，Avira会检查页面URL是否在该允许列表中：\n{：&#34；_isWhitelisted&#34；，：function(Url){return！！this._Whitelist&amp；&amp；this._Whitelist.ome(function(Pattern){return pattern.test(Url)；})；}}。\nApple.com在允许列表中，因为列表是按字母顺序排序的，所以函数很快就结束了。example.com不在列表中，因此扩展最终根据所有30,000个正则表达式模式检查URL。\nChrome扩展会增加内存消耗，无论是在用户打开的页面中还是在扩展背景页面中都是如此。\nAvira浏览器安全再次位居榜首，增加了218MB的内存消耗。这要归功于30k+的正则表达式--我认为它们被编译成字节码或机器代码，需要存储在内存中。\n带有后台页的扩展至少会增加10MB的内存消耗。如果没有后台页面，只有一个很小的页面脚本，那么扩展名对内存的影响可能是最小的。\n之前Evernote的负面性能最大，CPU时间增加了560ms。在前1000名中，有9项扩展的负面影响比这更大。\nVigia de preço是一个巴西优惠券和价格观察扩展，拥有20万用户。它会阻塞主线程1.6s。\n这在很大程度上是使用指纹js2来生成令牌。例如，这涉及呈现图像并为其生成数据URL，以便检测浏览器是否支持某些画布功能。\nSnap&amp；Read拥有超过50万用户，帮助他们阅读和理解文本。在每个页面上，它加载一个3.8Mb的licion.js文件，这是花费大部分解析和编译时间的地方。解析它可能会比JSON文件高效得多。\n然后，它处理词典并加载一系列库，如Comfort、jQuery、pdfmake和citeproc。Snap&amp；Read总共在每个页面上加载7.5MB的JavaScript代码。\n这是一个拥有30万用户的中文Chrome扩展。它似乎主要是对微信网页编辑器的扩展，但不管怎样，它在每个页面上都加载了4MB的代码。\nMozBar是一款拥有70万用户的SEO工具。除非你真的点击了扩展图标，否则它似乎没什么作用，但仍然运行3MB的代码。\n壹伴·小插件加载14个内容脚本，这些脚本在页面呈现开始之前需要超过700ms进行处理。AXE在呈现页面之前加载两个价值1.8MB的内容脚本。\n看看背景页面，没有其他扩展超过了Avira浏览器安全和Avira安全购物引入的额外处理。\nBitdefender TrafficLight是一个拥有60万用户的安全扩展。它对照可能指示安全问题的数千个标准的列表检查请求URL。为此，它需要遍历该列表并检查当前URL是否匹配。\n有趣的是，在没有广告的页面上，广告拦截器会显著增加浏览器的内存消耗。这主要是由于存储了较大的域阻止列表。\n我测试了20个广告拦截器和隐私工具在加载WCPO新闻文章时对性能的影响。\nDuckDuckGo Privacy Essentials将文章页面的CPU时间从31秒减少到1.6秒。所有其他经过测试的扩展也将CPU时间降低到最多10秒。\n大多数广告拦截器通过阻止页面发起的某些网络请求来工作。DDG Privacy Essentials将网络请求数减少了95%，下载重量减少了80%。\nChrome扩展需要做一些处理来决定阻止哪些请求。这项工作发生在后台页面。因此，虽然广告拦截器节省了页面上的CPU时间，但它们也略微增加了后台的CPU时间。\n是什么导致了这些巨大的差异？广告拦截器存储要拦截的请求的标准列表，然后需要将请求URL与该列表进行匹配。\nADS Blocker RP遍历一千多个正则表达式，并检查它们是否与请求URL匹配。这样做可能需要10毫秒，如果发出数百个请求，很快就会累积起来。\nDDG Privacy Essentials根据请求域执行简单的对象属性查找，该操作实际上是即时的。\n广告通常在独立于主页内容的IFRAME中提供。经过测试的新闻文章的子名使用536MB的内存。\n运行广告拦截器后台页面会消耗一些内存-在Ad-Blocker的情况下，最高可达142MB。\n但是，页面和子帧内存消耗减少了高达640MB，远远超过了这一点。\n让我们来看看Chrome Web Store开发者工具类别中的前100个扩展。\nSEOquake在页面顶部显示条，导致页面重新布局和重新绘制。\nSelenium IDE注入了700KB的JavaScript，即使您没有记录测试。\nAXE在页面开始呈现之前加载三个内容脚本。这可能是可以避免的，因为只有当用户单击Chrome DevTools中的按钮时才会运行可访问性测试。\n这里没有什么太有趣而看不到的东西。后台CPU使用率始终低于120ms。ChromeVox导致的内存消耗增幅最大，为80MB。\n去年我测试了26个Chrome扩展，Grammarly和Honey是速度最慢的两个扩展。我的笔记本上仍然有这些扩展的旧版本，所以我也将它们包括在测试中。\n您可以看到，Honey解决了它们的性能问题。现在，后台页面不再向每个页面注入大脚本，而是首先检查域名是否是他们支持的45k+商店之一。\nGrammarly变得更快了一些，但仍然使用250ms的CPU时间。更重要的是，这段代码仍然是呈现阻塞的，并且延迟了网站的第一次绘制。\n扩展开发人员可以通过仅在必要时加载脚本来限制性能成本。如果可能，请使用Chrome扩展平台提供的URL过滤器。\n如果不能选择，请使用一个小脚本来检测扩展是否需要在页面上执行任何操作。如果是这种情况，则小脚本可以引入任何附加代码。\n避免迭代包含数千个URL过滤条件的列表，特别是当条件依赖于复杂的逻辑或正则表达式时。\n如果您在运行时以编程方式更新扩展图标，请取消此操作。每次更新只需要大约25ms，但是如果您在加载页面的同时更新图标10次，那么这一时间加起来就足够了。\n如果您对正在开发的扩展的性能有疑问，或者希望持续监控其性能，请与其联系。\n大多数网站至少需要一秒钟才能加载，所以如果一个扩展增加了100ms，这个用户可能根本不会注意到。然而，在每一个页面上这样做都是合情合理的。\n许多用户都安装了多个扩展，因此很小的性能影响可能会对用户体验造成很大的负面影响。\n我在N2-Standard-2 Google Cloud实例上运行了这些测试，该报告中的数字显示了7次运行的中位数。\n我测试了1000个最流行的Chrome扩展对浏览器性能的影响。这是结果。线程1/N.。https://t.co/chyqyRiMAs➡️。\n-DebugBear(@DebugBear)2020年6月15日", "note_en": "The main metrics I&#39;ll consider are CPU consumption, memory consumption, and whether the extension makes pages render more slowly.\n     Let’s start by looking at the 100 most used Chrome extensions. Each of these has been installed more than 2 million times.\n  Page CPU time How long is the page main thread busy for, and what is it doing?\n  JavaScript execution or running layout logic blocks the browser main thread. This means the browser can’t respond to user interactions.\n If no extension is installed loading example.com takes around 40ms of CPU time. If you’ve installed Evernote or Grammarly this jumps to over 500ms.\n This chart shows the 20 slowest extensions out of the 100 most used Chrome extensions. The other 80 all add less than 100ms of additional CPU time to the page.\n  Rather than targetting specific sites, these extesions add code to every page opened by the user. Let’s take a look at what some of they are doing.\n  The Evernote extension has over 4 million users. It adds a 2.9MB content script to every page. 140ms are spent just parsing and compiling that code.\n  Once the bundle has been loaded it needs to be evaluated, which takes another 300ms.\n Does this code actually do anything? As far as I can tell, no, not unless the user clicks the Evernote extension icon.\n The code does set up an event listener that’s fired when the user clicks the icon, but this can be done without loading the full JavaScript bundle.\n    Extensions often need to inject code into every page, rather than only targetting certain domains. Password managers need to check if there&#39;s a login form. Spell checkers need to look for text fields.\n However, for performance it would be much better if the code that checks the relevant conditions was separated from the primary functionality of the extension. Then most of the code would only be loaded when necessary. Honey made this change last year and it  greatly reduced their performance impact.\n Interestingly, Skype only adds 150ms of CPU time, even though it has a large JavaScript bundle. My guess is that this is due to the code mostly consisting of static configuration objects and long strings that are easy to parse and evaluate.\n  I was surprised to see Ghostery relatively high up in the list. Unlike the other extensions it actually does something on the page, namely displaying how many trackers were blocked.\n Ghostery loads 160KB of JavaScript and adds 120ms of CPU time – not a huge amount. However some of this code is render-blocking, as we’ll see in the next section.\n  While extra CPU time means the page isn’t interactive for some time, this doesn’t normally completely block the page from rendering. To see if an extension blocks rendering we can look at the First Contentful Paint metric – when the browser starts to display text or images.\n Most extensions introduce no or only minor rendering delays. This chart shows the extensions with the largest negative impact on initial content rendering.\n  Chrome extensions can define scripts and stylesheets that should be injected into the page. By default these are added to the page once the page has finished loading and is idle.\n However, extensions developers can decide to load these resources as soon as the page starts loading. For example, the Dark Reader extension changes website content to a dark theme. It would be jarring to first render pages in a bright theme and then suddenly transition. Here it makes sense to run the code before the page starts to render.\n The amount of this code should be reduced to a minimum. The good news is that only 6 of the extensions in the chart cause a rendering delay of more than 100ms.\n  These extensions all run significant amounts of code before the page starts rendering. In the case of Clever, page content only starts showing 300ms later than without the extension installed.\n  While SafePrice doesn’t wait until the page is idle before injecting scripts, it does wait until the document has loaded. I&#39;m not sure why, but somehow the JavaScript code still appears to run before the initial render.\n   Not all processing that a browser extension does happens on a page that&#39;s visible to the user. Most Chrome extensions also have something called a background page which lets the extension do things like listen to network requests or update the extension icon.\n  Avira Browser Safety spends almost 3s running code in the background page, while all other extensions spend less than 200ms.\n Background pages often run code in response to network requests made by the page that was opened by the user. The page from the previous test only makes one network requests, far less than normal. So I ran this test again, this time loading the Apple homepage, which makes around 50 requests.\n  Interestingly Avira is now significantly faster, 600ms instead of 2.7s! What’s going on?\n The Avira Browser Safety extension contains a website allowlist with 30k+ regular expressions. When the user navigates to a new page Avira checks if the page URL is in that allowlist:\n {  :  &#34;_isWhitelisted&#34;,  :   function  ( url) {  return !! this._whitelist &amp;&amp;  this._whitelist.some(  function ( pattern) {  return pattern.test(url); }); }}\n Apple.com is in the allowlist, and because the list is sorted alphabetically the function quickly finishes. Example.com is not in the list, so the extension ends up checking the URL against all 30 thousand regex patterns.\n  Chrome extensions can increase memory consumption, both in pages opened by the user and in the extension background page.\n Again, Avira Browser Safety is at the top of the list, increasing memory consumption by 218MB. This is due to the 30k+ regular expressions – I think they are compiled to bytecode or machine code, which needs to be stored in memory.\n    An extension with a background page increases memory consumption by at least 10MB. If there’s no background page and only a small on-page script then an extension&#39;s the memory impact can be minimal.\n    Previously Evernote had the greatest negative performance, increasing CPU times by 560ms. There are 9 extensions among the top 1000 with a greater negative impact than that.\n   Vigia de Preço is a Brazilian coupon and price watching extension with 200k users. It blocks the main thread for 1.6s.\n A big part of this is using  fingerprintjs2 to generate a token. For example, this involves rendering an image and generating a data URL for it, in order to detect if certain Canvas features are supported by the browser.\n   Snap &amp; Read has over half a million users and helps them read and understand texts. On every page it loads a 3.8MB lexicon.js file, which is where most of the parse and compile time is spent. Parsing this would likely be much more efficient as a JSON file.\n It then processes the lexicon and loads a bunch of libraries like  compromise, jQuery, pdfmake and citeproc. In total Snap &amp; Read loads 7.5MB of JavaScript code on every page.\n  This is a Chinese Chrome extension with 300 thousand users. It seems mostly extend the WeChat web editor, but it loads 4MB of code on every page anyway.\n  MozBar is an SEO tool with 700 thousand users. It doesn’t seem to do much unless you actually click the extension icon, but still runs 3MB of code.\n    壹伴 · 小插件 loads 14 content scripts that take over 700ms to process before the page rendering starts. Axe loads two content scripts worth 1.8MB before the page is rendered.\n  Looking at background pages, no other extension exceeds the additional processing introduced by Avira Browser Safety and Avira Safe Shopping.\n   Bitdefender TrafficLight is a security extension with 600k users. It checks request URLs against a list of several thousand criteria that might indicate a security issue. To do that it needs to iterate over that list and check if the current URL matches.\n   Interestingly, on a page without ads, ad blockers significantly increase browser memory consumption. This is mostly due to storing large domain blocklists.\n   I tested how 20 ad blockers and privacy tools affect performance when loading a WCPO news article.\n  DuckDuckGo Privacy Essentials reduces the CPU time of the article page from 31s to just 1.6s. All other tested extensions also bring CPU time down to at most 10s.\n  Most ad blockers work by blocking certain network requests that are initiated by the page. DDG Privacy Essentials reduces the number of network requests by 95% and the download weight by 80%.\n   Chrome extensions need to do some processing to decide what requests to block. This work happens in the background page. So while ad blockers save CPU time on the page, they also slightly increase it in the background.\n  What’s causing these large discrepancies? Ad blockers store a list of criteria for what requests to block, and then need to match request URLs against that list.\n Ads Blocker RP iterates over more than a thousand regular expression and checks if they match the request URL. Doing this can take 10s of milliseconds, quickly adding up if hundreds of requests are made.\n DDG Privacy Essentials does a simple object property lookup based on the request domain, an operation that is practically instantaneous.\n  Ads are usually served in iframes that are isolated from the main page content. The subfames of the tested news article use 536MB of memory.\n  Running the ad blocker background page uses up some memory – up to 142MB in the case of Ad-Blocker.\n However, this is greatly outweighed by the reduction in page and subframe memory consumption by up to 640MB.\n  Let’s look at top 100 extensions in the Developer Tools category of the Chrome Web Store.\n    SEOquake displays a bar at the top of the page, causing the page to relayout and repaint.\n Selenium IDE injects 700KB of JavaScript, even if you’re not recording a test.\n    Axe loads three content scripts before the page starts rendering. This can probably be avoided, since the accessibility tests are only run when the user clicks a button in Chrome DevTools.\n   There&#39;s nothing too interesting to see here. Background CPU usage was always below 120ms. ChromeVox caused the highest increase in memory consumption, with a moderate 80MB.\n    When I tested 26 Chrome extensions  last year, Grammarly and Honey were the two slowest extensions. I still had the old versions of these extensions on my laptop, so I included them in the test as well.\n  You can see that Honey fixed their performance issue. Instead of injecting a large script into every page, the background page now first checks if the domain is one of the 45k+ shops they support.\n Grammarly has become a bit faster, but still uses 250ms of CPU time. More importantly, this code is still render-blocking and delays the first paint of the website.\n   Extension developers can limit the performance cost by only loading scripts when necessary. Where possible, use the URL filter provided by the Chrome extension platform.\n If that&#39;s not an option, use a small script that detects if the extension needs to do anything on the page. If that&#39;s the case, the small script can pull in any additional code.\n  Avoid iterating over a list of thousands of URL filtering criteria, especially if the criteria depend on complex logic or regular expressions.\n If you programmatically update the extension icon at runtime, debounce this operation. Each update only takes about 25ms, but this adds up if you update the icon 10 times while loading a page.\n Get in touch if you have questions about the performance of an extension you&#39;re working on, or would like to continuously monitor its performance.\n  Most websites take at least a second to load, so if an extension adds another 100ms this user might not even notice. However, doing this on every single page adds up.\n Many users have several extensions installed, so a small performance impact can add up to large negative effect on user experience.\n I ran these tests on an n2-standard-2 Google Cloud instance, the numbers in this report show the median of 7 runs.\n I tested the how the 1000 most popular Chrome extension impact browser performance. Here are the results. Thread 1/N...  ➡️  https://t.co/chyqyRiMAs\n— DebugBear (@DebugBear)  June 15, 2020", "posttime": "2020-06-16 18:55:48", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "性能,chrome,扩展", "title": "1000个最受欢迎的Chrome扩展对浏览器性能的影响", "title_en": "1000 Most popular Chrome extensions impact on browser performance", "transed": 1, "url": "https://www.debugbear.com/blog/2020-chrome-extension-performance-report#performance-impact-of-ad-blockers", "via": "", "real_tags": ["性能", "chrome", "扩展"]}, {"category": "", "categoryclass": "", "imagename": "b5b0ef95531db3dfcd8277cd13636cf1.jpg", "infoid": 1006794, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "星期日版查尔斯·狄更斯称拖延症是时间的窃贼。而马克·吐温则建议：后天要做的事千万不要拖到明天。\n拖延，就是我们决定把任务推迟到明天的那一刻，我们都会做的事情，这种邪恶的做法就是推迟、拖延和推迟。松了一口气是压倒性的。感觉就像在阳光明媚的日子里逃课。\n但第二天，这项可怕的任务迫在眉睫，感觉更加不可逾越。按照传统观点，拖延只是时间管理不善和自制力不强的简单问题。\n卡尔顿大学(Carleton University)心理学副教授蒂姆·皮切尔(Tim Pychyl)对这一假设提出了质疑。他在接受“星期日版”主持人迈克尔·恩赖特(Michael Enright)采访时表示：我们认为这是糟糕的时间管理，只要我们更加努力，更加自律，我们就能完成这项工作。但它看起来一点也不像那样。\nPychyl专门研究拖延症的根本原因，并就此写了一本书，名为“解决拖延症之谜：变革策略简明指南”。\n研究表明，在各种各样的研究中，这是一种情绪调节的情况。拖延者的歌是什么：我不想唱，我不想唱，我不喜欢，而且通常会有大合唱：我明天会感觉更好。\n所以这关系到我们的感受，而不仅仅是埋头苦干把事情做好的问题。做一项既定的任务会产生负面情绪，我们知道如何摆脱它们：避免任务。\n你可以通过拖延来暂时避免负面情绪，但总会有明天。\n死于癌症的麻省理工学院教授兰迪·鲍什(Randy Pausch)在他的最后一堂课中谈到了这一点，他说的是时间是我们生命中唯一不可再生的东西，我们不知道我们会得到多少时间。我想这就是为什么在每个主要的世界宗教中都有懒惰是一种罪过的观念。\n我明白为什么浪费时间被深深地视为一种罪过，这不仅是一种宗教表达，也是一种存在主义的表达，因为这就是我的生活。我需要继续做下去。经常如此，这就是拖延症如此有趣的原因。\n我们正处在一个不确定性、担忧和焦虑在情绪上主宰我们的时代。我们不可避免地会以拖延收场，但如果我们只能用一个词来形容这种拖延，那就是拖延，我们最终会为此而痛打自己。\n我会争辩说，是的，很多事情都被推迟了，但我们现在需要大量的自我同情。我们不需要把这种拖延的观念归咎于自己。\n现在有很多人试图给人们一个拖延的许可证。当我看到这一点时，我认为，不，我们需要找到更好地应对的方法，而不是放任事情拖延。能够在家工作并继续有收入是一种特权，所以我永远不会说不把你的工作做得最好是可以的。有些人非常渴望工作，但他们没有工作。\n像正念和冥想这样的事情从长远来看是有效的，但是如果你曾经尝试过正念冥想，你会意识到我们并不是很擅长这一点。我们通常在想下一件我们应该做的事情，或者我们有多不舒服，等等。\n我还有另一个建议，那就是&真的会改变人生，如果人们愿意的话，现在就可以这么做。在我的书“拖延症之谜”中，我写了整整一章，标题是“开始吧。”\n我让人们给我回信说，皮奇尔博士，现在你已经研究这个研究了多少年了，你想的是：你就这么开始吧？如果我能马上开始，那么我就不会有拖延症的问题了。我想：很公平。\n这就是神奇之处--下一次你面对一项你全身都在尖叫的任务时，我不想，我不想这样做，问问你自己：下一步行动是什么？我下一步需要采取什么行动才能取得一些进展？不要把整个任务搞得支离破碎。这肯定会让你不知所措。我想，如果我们中的大多数人把整个任务都分解了，我们就会意识到生命太短暂了，你永远不可能把它全部完成。相反，只要说下一步行动是什么就行了，而且行动要尽可能小而具体。", "note_en": "The Sunday Edition      Charles Dickens called procrastination the &#34;thief of time.&#34; Mark Twain on the other hand, advised: &#34;Never put off until tomorrow what may be done the day after tomorrow.&#34;\n  Procrastination, the nefarious practice of deferring, delaying and postponing is something we all do in the moment we decide to put off a task for tomorrow. The relief is overwhelming. It feels like cutting class on a sunny day.\n     But the next day, that dreaded task looms and feels even more insurmountable. According to conventional wisdom, procrastination is a simple matter of bad time management and weak self-control.\n  Tim Pychyl, an associate professor of psychology at Carleton University, challenges that assumption. &#34;We believed that it was poor time management and that if we just worked a bit harder and had more self-discipline, we could do the job,&#34; he said in an interview with Michael Enright, host of  The Sunday Edition. &#34;But it doesn&#39;t seem to be that at all.&#34;\n  Pychyl specializes in studying the root causes of procrastination and has written a book about it called  Solving the Procrastination Puzzle: A Concise Guide to Strategies for Change.\n        What research has indicated across a wide variety of studies is that it is an emotion regulation situation. What&#39;s the song of the procrastinator: &#34;I don&#39;t want to, I don&#39;t feel like it,&#34; and usually there&#39;s the chorus of: &#34;I&#39;ll feel more like it tomorrow.&#34;\n  So it&#39;s about our feelings, it&#39;s not just a matter of buckling down and getting it done. There are negative emotions associated with doing a set task and we know how to get rid of them: avoid the task.\n  You can avoid the negative emotions for the time being by procrastinating, but then there&#39;s always tomorrow.\n      Randy Pausch, an M.I.T. professor who died of cancer, talked about this in his final lecture, which was about how time is the only thing that&#39;s non-renewable in our lives and we don&#39;t know how much of it we&#39;re going to get. I think that&#39;s why in every major world religion there&#39;s this notion of sloth as a sin.\n  I can see why wasting time is deeply held as a sin and that&#39;s not only as a religious expression but as an existential one in terms of: &#34;This is my life. I need to get on with it.&#34; So often, that&#39;s what makes procrastination so interesting.\n      We are in a time when uncertainty, worry and anxiety are dominating us emotionally. We are inevitably going to end up delaying things, but if we only have one word for that delay, which is procrastination, we end up beating ourselves up for it.\n  I would argue that yes, many things are being delayed, but we need a lot of self-compassion right now. We don&#39;t need to impugn ourselves with this notion of procrastination.\n  There are a lot of people right now trying to give people a licence to procrastinate. When I see that, I think, &#34;No, we need to find ways to better cope, not give licence to delay things.&#34; What a privilege it is to be able to work from home and continue to have an income, so I would never say that it&#39;s OK not to do your best work. There are people that are desperate for jobs and they don&#39;t have them.\n      Things like mindfulness and meditation work in the long term but if you&#39;ve ever tried to do some mindfulness meditation, you realize we&#39;re not very good at it. We&#39;re usually thinking about the next thing we should be doing or how uncomfortable we are, etc.\n  I have another suggestion that&#39;s really life-changing and people could do now if they wanted. In my book,  The Procrastination Puzzle, I wrote a whole chapter titled, &#34;Just Get Started.&#34;\n  I had people write back to me and say, &#34;Dr. Pychyl, now you&#39;ve been studying this for how many years and what you came up with is: &#39;Just get started&#39;? If I could just get started then I wouldn&#39;t have a procrastination problem.&#34; I thought: fair enough.\n  Here&#39;s the magic — the next time you face a task that your whole body is screaming, &#34;I don&#39;t want to, I don&#39;t feel like it,&#34; ask yourself: what&#39;s the next action? What&#39;s the next action I&#39;d need to take to make some progress? Don&#39;t break the whole task down. That will be sure to overwhelm you. I think if most of us broke our whole task down, we&#39;d realize that life&#39;s too short, you can never get it all done. Instead just say, &#34;What&#39;s the next action?&#34; and keep that action as small and as concrete as possible.", "posttime": "2020-06-16 18:55:25", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "拖延,procrastinate", "title": "我们拖延是有原因的，而不是懒惰", "title_en": "There's a reason we procrastinate and it's not laziness", "transed": 1, "url": "https://www.cbc.ca/radio/thesundayedition/the-sunday-edition-for-june-14-2020-1.5604357/there-s-a-reason-we-procrastinate-and-it-s-not-laziness-1.5604433", "via": "", "real_tags": ["拖延"]}, {"category": "", "categoryclass": "", "imagename": "5e629f1a2a67f0003395f37f030375e0.jpg", "infoid": 1006793, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这篇论文引起了一定程度的争议，至今仍令维斯瓦纳坦感到惊讶。一些对动物行为感兴趣的生态学家和物理学家接受了这些数学观点，但其他人断然拒绝了它们。“回想起来，”他说，“我感觉这种思维方式…。这对一些研究人员来说太令人震惊了。“。\n这一领域很快就获得了脾气暴躁、被激烈的争论撕裂的名声。莱维漫步的有用性得到了理论工作的进一步支持，比如一项研究表明，当目标罕见且移动速度比搜索者慢时，雷维漫步是最好的盲目搜索策略-这种情况与捕食者寻找猎物、传粉者寻找花朵和交配生物寻找伴侣有关。但许多物种的运动符合这一理论框架的经验证明来得很慢：动物学家需要对野生动物的运动进行更全面、更详细的观察，数学家需要更精细的方法来分析这些数据。\n一位受到莱维行走想法启发而采取行动的生态学家是西姆斯。当时，他正试图绘制鱼类的运动地图，以帮助海洋保护。他想，“我真的很想在晒鲨身上测试这一点”--这是一种在多年被猎杀以获取油、肉和鳍后濒临灭绝的物种。\n晒太阳的鲨鱼在广阔的海洋中游荡，寻找成片的浮游生物--就像翅膀上的信天翁一样，寻找成群的鱼群。如果鲨鱼的路径上有明显的莱维行走，这可能意味着这种动物正在探索，而不是在吃浮游生物。西姆斯认为这种洞察力可能会帮助他更好地理解鲨鱼的运动，并研究出如何保护动物免受渔业的伤害。\n他面临的问题是获得足够的数据。为了检测雷维行走，研究人员需要在相当长的时间内跟踪动物的每一个动作。今天，GPS系统可以精确地跟踪无线电启用的物体的运动，比如我们的手机。但在20世纪90年代末，西姆斯在一艘船上观察晒鲨鱼扰乱海面时，通过观察它们来监控它们，这意味着他只能看到生物运动的一小部分。他能看到的鲨鱼几乎肯定是在一片浮游生物中觅食，而不是在雷维小道上漫步。\n因此，西姆斯求助于给鲨鱼贴上标签。当鲨鱼在水柱中上下移动时，附着在鱼翅上的标签上的压力传感器每隔一秒记录动物的游泳深度。在设定的时间，标签从鲨鱼身上分离出来，浮出水面，并将其数据记录传递给卫星。\n这些垂直运动的模式是典型的截断Lévy行走。(截断，也就是说，在纯粹的数学意义上：在完美的雷维行走中，鲨鱼偶尔迈出相当于游向火星的一步的可能性不为零。)。西姆斯印象深刻，他也查看了他对蓝鲨和海洋太阳鱼的跟踪数据，然后写信给同事，获得了描述棱皮龟、企鹅和金枪鱼的可比数据。所有这些照片都或多或少地显示出雷维走路的样子。\n西姆斯和他的同事们假设，许多动物在进化过程中，当它们既不能感觉也不记得食物在哪里时，就会使用这种搜索模式。西姆斯实验室的计算生物学家、博士后研究员尼克·汉弗莱斯(Nick Humphries)说：“当动物真的毫无头绪时，雷维运动就会出现。”\n这一描述适用于海洋中央的鲨鱼。“大西洋几乎是一片沙漠，”汉弗莱斯说。“有食物补丁，但很稀疏。上一块食物和下一块食物之间的距离远远超出了感官范围。“。这也是一个不断变化的环境，在那里记忆是无用的。这正是基于Lévy Walk的搜索最有可能发展的环境类型。\n西姆斯、汉弗莱斯和他们的同事在2008年的“自然”杂志上总结了他们的发现，他们发现，鲨鱼和其他海洋捕食者的运动方式是不同的，取决于它们是在寻找食物(当它们在Lévy散步时)，还是在食物带中(当布朗随机性占上风时)。他们的工作支持了西姆斯最初的预感，即定义运动类型可能会揭示鱼是在进食还是在寻找食物。\n具有讽刺意味的是，他们的论文是在维斯瓦纳坦、达卢兹和拉波索共同撰写的一项研究显示维斯瓦纳坦最初的信天翁研究中存在灾难性错误的几个月后发表的。他们依赖的干/湿传感器不仅在鸟儿飞翔时是干的，当信天翁坐在它们的巢上时也是干的。数据集中一些最长的“飞行”实际上可能是对鸟巢的长时间访问。这项研究还批评了某些分析技术，并声称信天翁根本不会走Lévy路，目前还不清楚是否有很多物种会这样做。\n西姆斯承认，相互矛盾的文件“让人们感到不安”。但他的研究使用了更多最新的数学方法，证明了整个海洋捕食者群体都会走列维步道。回想起来，西姆斯的论文是该领域的一个转折点。根据Raposo的说法，这“唤起了在该领域工作的许多科学家的注意，使用更强大和更现代的统计技术来对动物运动进行经验数据分析。”这些改进的方法打消了人们对动物是否会走列维步道的疑虑。“数据量是压倒性的，”达卢兹说。\n西姆斯和汉弗莱斯甚至在2012年的一项后续研究中重新研究了信天翁。通过使用更复杂的GPS跟踪设备，他们发现信天翁在浅水上空寻找食物时不会进行莱维行走，在那里它们可能有更多的视觉或嗅觉信息来引导它们。但当它们飞到更深的水域时，这些鸟实际上确实采用了雷维搜索。\nLévy散步现在被认为是神经系统在缺乏有用的感觉或记忆信息的情况下可以产生的一种运动模式，而这是动物最有利的搜索策略。当然，许多动物可能永远不会使用莱维行走：如果北极熊能闻到海豹的气味，或者猎豹能看到瞪羚，这些动物就不太可能采取随机的搜索策略。维斯瓦纳坦说：“我们预计，雷维步道的改编只会出现在它们具有实际优势的地方。”\n对于伯尼、西姆斯和汉弗莱斯来说，情况就不那么确定了：虽然雷维步道还没有在许多物种中被记录在案，但科学家们认为，被适当观察到的物种太少，无法证明关于它们可能有多常见的说法是合理的。\n西姆斯和伯尼正在与转基因果蝇幼虫进行合作，这是在席卷该领域的下一场辩论中出现的，这场辩论关注的是莱维行走是否是适应性的内在特征。Lévy散步是不是一种行为策略，因为它让动物更容易找到它们需要的东西？还是因为世界上的资源和信息遵循这种分布，所以当一只动物去寻找时，莱维行走才会出现？\n例如，某些猴子在探险时会走Lévy路，但它们似乎是在用感官和记忆在以这种方式分布的食物资源之间穿行。因此，猴子既不会产生雷维行走，也不会使用它们进行盲目搜索。\n英国Rothamsted Research的理论物理学家安迪·雷诺兹(Andy Reynolds)指出，在各种生物和物理现象中都发现了Lévy分布，包括免疫T细胞在大脑中的旅行，细胞内分子的操作，以及种子和孢子的空气传播。雷诺兹说：“几乎可以肯定的是，情况是多元的，因为没有一种机制可以解释所有的观察结果。”\n例如，雷诺兹认为，信天翁的莱维行走“似乎是鸟类跟随它们的嗅觉导航的意外副产品。”他怀疑空气中的气味运动才是莱维分布的真正来源。(西姆斯说，许多观察结果与这一假设不相容，尤其是信天翁在浅水和深水上空进行不同搜索的区别。)。雷诺兹说，解决问题的方法是暂时干扰一些鸟类的嗅觉，看看雷维图案是否会消失。简而言之，实验科学需要超越主导该领域的观测科学。\n这正是西姆斯和伯尼开始在果蝇身上做的事情。通过关闭它的大脑和任何感觉通道，他们可以确定在缺乏关于世界的信息的情况下，幼虫中的一种机制是否会产生Lévy行走。\n西姆斯说，当他开始思考如何解决莱维行走的机械基础时，他很幸运地读到了伯尼2012年的论文，其中描述了果蝇幼虫的大脑如何因基因失活而无法阻止它们探索环境：神经索上的一小簇神经元沿着幼虫的背部延伸，仍然可以有效地控制动物的肌肉，而不需要大脑的指导。这篇论文描述了果蝇幼虫的大脑是如何遗传失活的，并没有阻止它们探索环境：在没有大脑指导的情况下，神经索上的一小簇神经元仍然可以有效地控制动物的肌肉。“我意识到她的方法正是我们开始测试内在与外在的想法所需要的，”西姆斯说。\n碰巧的是，伯尼也开始对觅食和雷维散步感兴趣，并热衷于与该领域的某人合作。2013年，西姆斯前往剑桥大学，伯尼当时在那里工作。“我们聚在一起吃了一顿非常棒的午餐，”他回忆道。他们一拍即合，同意一起工作。\n伯尼培育了新的果蝇，并建造了更大的琼脂竞技场，以进行更长时间的跟踪实验。她早期对幼虫运动的研究类似于西姆斯在船上观察鲨鱼的方法；现在她需要跟踪这些动物，因为它们在更远的距离上漫步。\n当西姆斯和汉弗莱斯在2015年分析伯尼的结果时，他们发现，正常的幼虫被放在一大片没有食物的琼脂上，偶尔会以一种近似雷维行走的方式移动。但是，即使当动物的大脑和感官被关闭时，仍然可以检测到雷维行走。他们的结论是，神经中枢本质上产生了这种模式。“哇--我们都被打动了！”西姆斯说。\n这篇论文于去年11月发表在“电子生活”杂志上，受到评论家的热烈欢迎。普林斯顿大学的神经学家亚当·卡尔霍恩(Adam Calhoun)就是其中之一，他对这项研究赞不绝口。他说，直到过去十年，觅食的生物学才开始成为神经科学家的严重担忧。他的观点是“没有感官信息，他们正在产生一个幂律--这真的很酷。”它们产生了作为基态的莱维行走。“。\n维斯瓦纳坦形容这项工作令人惊叹。“现在的问题不再是动物是否会利用雷维行走，而是动物何时利用雷维行走。而且，内在的世代只能有一个进化的起源。“。\n不过，雷诺兹还不确定。“到目前为止，这些结果提供了最有力的证据，证明雷维状运动模式是内在产生的，”他说，但他警告说，“雷维氏行走行为是否是这种动物的进化特征，还有待观察。”\n伯尼现在正试图证明这一点。“我们正在研究是什么电路在直线和转弯之间产生这些交替，”她说。为了做到这一点，她分离出幼虫的神经系统，并将它们放在显微镜下。因为它们的转基因神经元在激活时会发光，她可以观察到神经元放电的闪烁模式。“它们在没有任何感觉输入的情况下自发地产生节律，”她说，“我们可以看到这些运动神经元行为的节律相当于行为输出。”\n伯尼和她的团队还在研究是什么导致了步行长度的莱维分布。他们与计算神经学家Julijana Gjorgjieva和法兰克福Max Planck脑研究所的数学家Marina Wosniack合作，正在建立神经网络的计算机模型。他们希望这样的模型能够让他们探索外部感觉信号或来自大脑的指令如何改变支配幼虫基线行为的内在活动模式。\n伯尼的实验室还在进行进一步的行为实验，让幼虫穿过点缀着不同食物排列的琼脂平板。当有成片的食物时，有趣的行为转变就会发生：就像鲨鱼在海洋浮游生物云层内或之外移动一样，幼虫在雷维路上来回移动。\n神经科学家还可以监测其他实验室动物的Lévy走路行为。有证据表明，线虫和某些泥螺使用这种搜索策略。西姆斯和伯尼想知道如何在老鼠和斑马鱼等脊椎动物身上探索这些想法。汉弗莱斯思考，是否简单地让一些本科生去寻找隐藏在海滩上的东西，是否会揭示出特有的模式。\n对不同物种之间的雷维行走行为的比较可能会被证明是令人着迷的。伯尼想知道是不是不同的动物以不同的方式实现了这种行为，“或者是不同的动物实际上产生了相同类型的特征的神经放电、神经活动或神经元连接的某些原理？”最优盲目搜索策略的数学原理可能嵌入到神经系统的结构中，这种想法感觉像是一个需要回答的问题。\n不过，就目前而言，西姆斯和汉弗莱斯大多离开了这一现象的基础科学，重新专注于保护工作：他们将使用雷维行走(Lévy Walks)和其他工具来对鲨鱼的行为进行分类。但伯尼希望其他神经科学家能受到启发，在大脑所做的一切事情之下寻找这些运动模式的生成器。\n“这个领域发现了一些他们真正可以研究的东西，”她在谈到神经科学家时说。“然后他们会留下来探索一段时间，然后再继续寻找其他东西。”她笑着补充说，“有点像莱维式的方式。”", "note_en": "The paper evoked a level of controversy that still surprises Viswanathan. The mathematical ideas were embraced by some ecologists and physicists interested in animal behavior, but others flatly rejected them. “In retrospect,” he said, “I get the feeling that this way of thinking … was too shocking to some researchers.”\n The field quickly acquired a reputation as fractious and torn by passionate arguments. The usefulness of Lévy walks was further supported by theoretical work, such as a study that showed they were the best blind search strategy  when the target was rare and slower moving than the searcher — a scenario relevant to predators seeking prey, pollinators seeking flowers and mating creatures seeking partners. But empirical demonstrations that many species’ movements fit this theoretical framework were slow to come: Zoologists needed more complete and detailed observations of wild animals’ movements, and mathematicians needed more refined methods for analyzing such data.\n  One ecologist inspired to action by the Lévy walk idea was Sims. At the time he was trying to map the movements of fish as an aid to marine conservation. He thought, “I really want to test this in basking sharks ” — a species that had become endangered after many years of being hunted for their oil, meat and fins.\n Basking sharks rove vast spans of the ocean for patches of plankton to graze — not unlike an albatross on the wing seeking schools of fish. If a Lévy walk was evident in a shark’s path, it might mean the animal was exploring rather than dining on plankton. And Sims thought that insight might help him better understand the sharks’ movements and work out how to protect the animals from fisheries.\n The problem he faced was getting enough data. To detect a Lévy walk, researchers need to follow every move an animal makes for a considerable amount of time. Today, GPS systems can precisely track the movements of radio-enabled objects, such as our cell phones. But in the late 1990s, Sims was monitoring basking sharks by watching from a boat when they disturbed the surface, which meant he was seeing only a tiny fraction of the creatures’ movements. And the sharks he could see were almost certainly feeding amid plankton patches — not wandering on Lévy walks.\n  So Sims resorted to tagging the sharks. A pressure sensor on a tag attached to a shark’s fin recorded the animal’s swimming depth at one-second intervals as the shark moved up and down in the water column. At a programmed time, the tag separated from the shark, bobbed to the surface and relayed its data record to a satellite.\n The pattern of these vertical movements was a classic truncated Lévy walk. (Truncated, that is, in a purely mathematical sense: In a perfect Lévy walk, there would be a nonzero probability of the shark occasionally taking a step equivalent to swimming to Mars.) Sims was so impressed, he looked at tracking data he had on blue sharks and ocean sunfish too, then wrote to colleagues and got comparable data describing leatherback turtles, penguins and tuna. All of them showed Lévy walks to greater or lesser extents.\n Sims and his colleagues hypothesize that many animals evolved to use this search pattern when they could neither sense nor remember where food was. “Lévy movements arise when the animal really has no clue,” said  Nick Humphries, a computational biologist and a postdoctoral researcher in Sims’ lab.\n  That description applies to sharks in the middle of the ocean. “The Atlantic Ocean is pretty much a desert,” Humphries said. “There are food patches, but they are sparse. The distance between the last food patch and the next is way beyond sensory range.” It’s also an ever-shifting environment where memory is useless. It’s exactly the type of environment where a Lévy walk-based search would most likely have evolved.\n In a  summary of their findings in  Nature in 2008, Sims, Humphries and their colleagues showed that the movements of sharks and other marine predators varied depending on whether they were searching for food (when they did Lévy walks) or in the midst of a food patch (when Brownian randomness prevailed). Their work supported Sims’ original hunch that defining the type of movement might reveal whether a fish was consuming food or exploring for it.\n  Ironically, their paper arrived only months after a study co-authored by Viswanathan, da Luz and Raposo showed  a catastrophic error in Viswanathan’s original albatross study. The wet/dry sensors they had relied on weren’t dry only when the birds flew: They were also dry when the albatrosses sat on their nests. Some of the longest “flights” in the data set might have actually been protracted visits to the birds’ nests. The study also criticized certain analytical techniques and claimed that albatrosses don’t do Lévy walks after all, and that it was unclear whether many species did.\n Sims acknowledges that the conflicting papers “put people on edge.” But his work used more up-to-date mathematical methods to demonstrate that a whole menagerie of marine predators take Lévy walks. And in retrospect, Sims’ paper was a turning point in the field. According to Raposo, it “called the attention of many scientists working in the area to the use of more powerful and modern statistical techniques of empirical data analysis of animal movement.” These improved methods quashed doubts over whether animals ever do Lévy walks. “The amount of data is overwhelming,” said da Luz.\n Sims and Humphries even revisited albatrosses in  a subsequent study in 2012. Working with more sophisticated GPS tracking devices, they found that albatrosses did not perform Lévy walks while searching for food above shallow water, where they might have more visual or olfactory information to guide them. But when they flew out over deeper water, the birds did in fact adopt Lévy searches.\n  Lévy walks are now seen as a movement pattern that a nervous system can produce in the absence of useful sensory or mnemonic information, when it is an animal’s most advantageous search strategy. Of course, many animals may never employ a Lévy walk: If a polar bear can smell a seal, or a cheetah can see a gazelle, the animals are unlikely to engage in a random search strategy. “We expect the adaptation for Lévy walks to have appeared only where they confer practical advantages,” Viswanathan said.\n To Berni, Sims and Humphries, the situation is less definitive: Although Lévy walks have not been documented in many species yet, the scientists think too few species have been properly observed to justify statements about how common they might be.\n  The ongoing collaboration between Sims and Berni with the genetically modified  Drosophila larvae emerged from the next debate that engulfed the field, which concerned whether Lévy walks are adaptive, intrinsic traits. Are Lévy walks a behavioral strategy that evolved because it made animals better at finding whatever they needed? Or do Lévy walks just emerge when an animal goes searching because the world’s resources and information follow that distribution?\n Certain monkey species, for example, do Lévy walks when exploring, but they seem to be using their senses and memories to travel between food resources distributed that way. The monkeys are therefore neither generating the Lévy walks nor using them for blind searches.\n Andy Reynolds, a theoretical physicist at Rothamsted Research in the U.K., notes that Lévy distributions have been found in assorted biological and physical phenomena, including the journeys of immune T cells in the brain, the operations of intracellular molecules, and the airborne dispersal of seeds and spores. “The picture is almost certainly a pluralistic one, as no one mechanism can account for all the observations,” Reynolds said.\n  For example, Reynolds believes that the albatrosses’ Lévy walks “appear to be an accidental byproduct of olfactory-cued navigation — of the birds following their noses.” He suspects that the movements of airborne scents are the true source of the Lévy distribution. (Sims says a number of observations are incompatible with this hypothesis, not least the distinction between albatrosses’ different searches above shallow and deep water.) The way to settle the matter, Reynolds says, is to temporarily disrupt some birds’ sense of smell to see if the Lévy patterns disappear. In short, experimental science needs to overtake the observational science that has dominated the field.\n This is exactly what Sims and Berni set out to do in the fruit fly. By shutting down its brain and any sensory channels, they could determine whether a mechanism in the larvae generated Lévy walks in the absence of information about the world.\n Sims says that when he started thinking about how to tackle the mechanistic underpinnings of Lévy walks, he was lucky to read  Berni’s 2012 paper that described how genetically inactivating the brains of  Drosophila larvae didn’t stop them from exploring their environment: A small cluster of neurons in the nerve cord running down the larva’s back could still usefully control the animal’s muscles without guidance from the brain. “I realized her methods were exactly what we needed to begin testing this idea of intrinsic versus extrinsic,” Sims said.\n As it happened, Berni had also become interested in foraging and Lévy walks and was keen to collaborate with someone in the field. In 2013, Sims travelled to the University of Cambridge, where Berni then worked. “We met for a really good lunch,” he recalled. They hit it off and agreed to work together.\n Berni bred new fruit flies and built much bigger agar arenas to run much longer tracking experiments. Her early studies of larval movement were akin to Sims’ method of watching a shark from a boat; now she needed to follow the animals as they roamed over much greater distances.\n When Sims and Humphries analyzed Berni’s results in 2015, they found that normal larvae placed on an expanse of agar containing no food occasionally moved in a way that approximated a Lévy walk. But Lévy walks were still detectable even when the animals’ brains and senses were switched off. They concluded that the neural center intrinsically generates the pattern. “Wow — we were blown away!” Sims said.\n  The resultant paper was  published last November in  eLife, where it was warmly received by reviewers. One of these was  Adam Calhoun, a neuroscientist at Princeton University, who roundly praises the study. He says that the biology of foraging has emerged as a serious concern for neuroscientists only over the last decade. His take was that “there’s no sensory information and they’re generating a power law — that’s really cool. They generate a Lévy walk as a base state.”\n Viswanathan describes the work as amazing. “The question is no longer if but when animals exploit Lévy walks. Also, the intrinsic generation can only have an evolutionary origin.”\n Reynolds, though, isn’t yet certain. “The results provide the strongest evidence so far for the intrinsic generation of Lévy-like movement patterns,” he said, but he warned that “it remains to be seen whether the Lévy walk behavior is an evolved trait of this animal.”\n  Berni is now trying to demonstrate exactly that. “We’re working on what circuits are generating these alternations between the straight runs and the turns,” she said. To do so, she isolates larval nervous systems and places them under a microscope. Because their genetically modified neurons glow when active, she can watch the flickering patterns of neurons firing. “They are producing rhythms spontaneously without any sensory inputs coming to them,” she said, “and we can see these rhythms of motor neuron behavior that are equivalent to what the behavioral output is.”\n Berni and her group are also investigating what generates the Lévy distribution of walk lengths. In collaboration with the computational neuroscientist  Julijana Gjorgjieva and the mathematician  Marina Wosniack at the Max Planck Institute for Brain Research in Frankfurt, they are building computer models of the neural network. They are hoping such a model will enable them to explore how external sensory signals or instructions from the brain change the intrinsic activity pattern governing a larva’s baseline behavior.\n Berni’s lab is also running further behavioral experiments in which larvae traverse agar plates dotted with different arrangements of food. When there are patches of food, interesting behavioral transitions happen: Like sharks moving within or beyond clouds of oceanic plankton, the larvae move in and out of Lévy walks.\n  There are other lab animals that neuroscientists could monitor for Lévy walk behavior. Evidence hints that nematodes and certain mud snails use this search strategy. Sims and Berni wonder how these ideas might be explored in vertebrates like mice and zebra fish. Humphries ponders whether simply asking some undergraduates to look for something hidden on a beach might reveal the characteristic pattern.\n  Comparisons of Lévy walk behavior between species could prove fascinating. Berni wonders if different animals arrive at the behavior in different ways, “or is there some principle of neural firing or neural activity or neuronal connectivity that is actually generating the same type of characteristics in different animals?” The idea that the mathematics for an optimal blind search strategy might be embedded in the very structure of a nervous system feels like a question that needs to be answered.\n For now, though, Sims and Humphries are mostly turning away from the basic science of the phenomenon to focus again on conservation work: They will use Lévy walks along with other tools to classify shark behavior. But Berni hopes other neuroscientists will be inspired to look for generators of these movement patterns beneath everything else brains do.\n “The field discovers something they can really work on,” she said of the neuroscientists. “Then they stay and explore this for a while, before they move on and look for something else.” She added with a smile, “In a little bit of a Lévy way.”", "posttime": "2020-06-16 18:54:51", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "联网,search,动物", "title": "随机搜索联网到动物中可能有助于它们狩猎", "title_en": "Random Search Wired into Animals May Help Them Hunt", "transed": 1, "url": "https://www.quantamagazine.org/random-search-wired-into-animals-may-help-them-hunt-20200611/", "via": "", "real_tags": ["联网", "search", "动物"]}, {"category": "", "categoryclass": "", "imagename": "0b2d944444ab4380e1c2598d09054cc0.jpg", "infoid": 1006791, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "为了将CRISPR-Cas9介导的DNA切割的时间分辨率提高到小时尺度，已经做了大量的努力。刘等人。开发了一个Cas9系统，实现了第二时间尺度的基因组编辑操作(见Medhi和Jasin的透视图)。部分引导RNA被化学囚禁，使Cas9-引导RNA复合物能够在没有切割的情况下结合在特定的基因组位点上，直到被光激活。这个快速的CRISPR系统实现了高时间分辨率的基因组编辑，使得研究DNA修复过程的早期分子事件成为可能。该系统还具有短时间尺度下的高空间分辨率，允许编辑一个基因组等位基因，而另一个不受干扰。科学，本期第[1265]页[1]；另见第[1180]页[2]CRISPR-CAS系统为可编程基因组编辑提供了通用工具。在这里，我们开发了一种笼式RNA策略，允许Cas9与DNA结合，但在光诱导激活之前不会切割。这种方法被称为非常快的CRISPR(VfCRISPR)，在亚微米和秒尺度上产生双链断裂(DSB)。同步切割改善了DNA修复的动力学分析，显示细胞在几分钟内对Cas9诱导的DSB有反应，并在DNA连接后保留Mre11。DNA损伤后H2AX的磷酸化速度超过每分钟100千碱基，最高可达30兆碱基。利用单细胞荧光成像，我们表征了多个周期的53BP1修复灶的形成和溶解，第一个周期比随后的周期需要更长的时间，其持续时间受修复抑制的调节。成像引导的亚细胞Cas9激活进一步促进了单等位基因分辨率的基因组操作。vfCRISPR可以在空间、时间和基因组坐标上进行高分辨率的DNA修复研究。[1]：/lookup/doi/10.1126/cience.aay8204[2]：/lookup/doi/10.1126/cience.abc3997", "note_en": "Numerous efforts have been made to improve the temporal resolution of CRISPR-Cas9–mediated DNA cleavage to the hour time scale. Liu et al. developed a Cas9 system that achieved genome-editing manipulation at the second time scale (see the Perspective by Medhi and Jasin). Part of the guide RNA is chemically caged, allowing the Cas9-guide RNA complex to bind at a specific genomic locus without cleavage until activation by light. This fast CRISPR system achieves genome editing at high temporal resolution, enabling the study of early molecular events of DNA repair processes. This system also has high spatial resolution at short time scales, allowing editing of one genomic allele while leaving the other unperturbed.Science , this issue p. [1265][1]; see also p. [1180][2]CRISPR-Cas systems provide versatile tools for programmable genome editing. Here, we developed a caged RNA strategy that allows Cas9 to bind DNA but not cleave until light-induced activation. This approach, referred to as very fast CRISPR (vfCRISPR), creates double-strand breaks (DSBs) at the submicrometer and second scales. Synchronized cleavage improved kinetic analysis of DNA repair, revealing that cells respond to Cas9-induced DSBs within minutes and can retain MRE11 after DNA ligation. Phosphorylation of H2AX after DNA damage propagated more than 100 kilobases per minute, reaching up to 30 megabases. Using single-cell fluorescence imaging, we characterized multiple cycles of 53BP1 repair foci formation and dissolution, with the first cycle taking longer than subsequent cycles and its duration modulated by inhibition of repair. Imaging-guided subcellular Cas9 activation further facilitated genomic manipulation with single-allele resolution. vfCRISPR enables DNA-repair studies at high resolution in space, time, and genomic coordinates. [1]: /lookup/doi/10.1126/science.aay8204 [2]: /lookup/doi/10.1126/science.abc3997", "posttime": "2020-06-16 18:54:00", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "crispr,dna", "title": "FAST Crispr按需", "title_en": "Fast Crispr on Demand", "transed": 1, "url": "https://science.sciencemag.org/content/368/6496/1265", "via": "", "real_tags": ["crispr", "dna"]}]