[{"category": "", "categoryclass": "", "imagename": "41327772d1dcb0da1bd3f165e0caa78a.png", "infoid": 1001952, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "您已经构建了很多API并进行了测试。您还可能使用Postman之类的工具或借助前端应用程序中的API实现来手动测试您的API。到目前为止，这个运行得很好。\n现在想象一下，你已经接近终点线了，想要向大众发布你的下一款网络应用程序。你可能会感到不舒服，因为你不确定你可能会面临什么样的意想不到的问题。由于负载过重，您的服务器甚至可能变得无法访问。\n测试尽可能可靠的API是一项需要掌握的挑战。没有最好的方法，这完全取决于你的个人工作流程和喜好。\n但是，您应该考虑对任何Web项目使用负载测试，以防万一。这篇文章将介绍一些顶级的开源和商业工具，它们将帮助您轻松地加载测试您的下一个项目。\n以下工具没有特定的顺序，只是我或我的同事偶然发现的一些工具的概述。\nApache JMeter可用于测试静态和动态资源(Web动态应用程序)的性能。它可以用来模拟服务器、服务器组、网络或对象上的重载，以测试其强度或分析不同负载类型下的整体性能。\n啊，是的，这是每个开发人员至少遇到过一次的名字之一。\nJMeter是一款基于Java的开源负载测试工具，由Apache Foundation构建，自1998年以来一直有很多更新。\n它流行的原因之一是它基于插件的架构。它不仅可以测试HTTP，还可以测试其他协议。\n庞大的社区。由于其受欢迎程度，可以在Web上找到各种插件和资源。\n如果您是负载测试的新手，由于负载测试的可能性很多，可能会让您应接不暇。\n对于大量使用CLI工具的人来说，可能不适合每个人的工作负荷。\nLoadMill通过重放真实的用户行为自动执行后端回归测试。它可以根据实际的用户流创建和重放许多API测试。\nLoadMill是一项商业Web服务，可帮助您自动执行API测试，并基于录制或手动输入启动负载测试。\n火炮是一款现代化、功能强大、易于使用的负载测试和功能测试解决方案。发货可扩展的后端、API和服务，可在高负载下保持高性能和弹性。\nGunning是一个开放源码的CLI工具，可以基于YAML文件运行负载测试。它基于Node.js，几乎可以在任何地方运行。它最出名的是它的简单性，但负载测试的可能性也很多。\nGatling是一款针对Web应用程序的开源负载测试工具，专为DevOps和持续集成而设计。它的设计考虑到了易用性、可维护性和高性能。加特林包括一个网络记录器和五颜六色的报告。\nGatling是一个用于负载测试Web应用程序的开源工具，也提供企业版。与Artillery类似，它基于用Scala编写的模拟脚本运行测试计划。\nBlazemeter是一个与JMeter兼容的商业负载测试PaaS。它可以像任何其他工具一样运行功能和性能测试，但还提供可以组合到测试中的资源监控。\nTelerik的Test Studio是用于UI、rest API和负载测试的独立测试工具。它主要关注创建测试并将其与现有工作负载(如CI/CD、错误跟踪等)集成。\n还有许许多多其他工具专门用于API和负载测试。这些工具之所以令人信服，是因为它的透明和公平(就免费级别而言)定价模型(如果是商业的话)和可以集成到大多数开发人员的工具集中的功能。\n希望这份列表启发了您，并让您大致了解了现有的测试工具类型以及它们具有的功能。享受测试和查找更多工具的乐趣。\n顺便说一下，…。如果您想了解有关负载测试的更多信息，请查看以下链接：", "note_en": "You have built a lot of APIs and went through testing. You also probably test your APIs manually with tools like Postman or with the help of your API implementation in your frontend app. This works fine so far.\n Now imagine you are close to the finish line and want to release your next web app to the masses. You might feel uncomfortable because you are not sure what kind of unexpected issues you might face. Your servers even might become inaccessible due to heavy load.\n Testing APIs as reliable as possible is a challenge that needs to be mastered. There is no best way of doing it, it all depends on your personal workflow and preferences.\n You should, however, consider making use of  load tests for any web project just in case. This post will go through some top open-source and commercial tools that will help you to load test your next project with ease.\n The following tools are in no particular order and just serve as an overview of some tools that I or my colleagues have stumbled upon.\n  Apache JMeter may be used to test performance both on static and dynamic resources, Web dynamic applications. It can be used to simulate a heavy load on a server, group of servers, network or object to test its strength or to analyze overall performance under different load types.\n Ah yes, this is one of the names that every developer came across at least once.\n JMeter is an open-source load test tool based on Java built by the Apache Foundation that’s around since 1998 and still receives many updates.\n One of the reasons for its popularity is its architecture based on plugins. It can not only test HTTP but also other protocols.\n   Large community. A variety of plugins and resources can be found on the web due to its popularity\n  Can be overwhelming if you are new to load tests due to its many possibilities\n Might not fit into everybody’s workload for people who are heavily used to CLI tools\n  Loadmill automates backend regression testing by replaying real user behavior. It can create and replay many API tests based on actual user flows.\n Loadmill is a commercial web service that helps you to automate API tests and start load tests based on recordings or manual input.\n        Artillery is a modern, powerful &amp; easy-to-use solution for   load testing  and   functional testing . Ship   scalable  backends, APIs &amp; services that stay   performant  &amp;   resilient  under high load.\n Artillery is an open-source CLI tool that can run load tests based on YAML files. It is based on Node.js and can run almost anywhere as well. It is best known for its simplicity yet many possibilities for load tests.\n       Gatling is an open-source load testing tool for web applications, designed for DevOps and Continuous Integration. It is designed for ease of use, maintainability and high performance. Gatling includes a web recorder and colorful reports.\n Gatling is an open-source tool for load testing web applications that also offers an enterprise version. Similar to Artillery, it runs test plans based on simulation scripts written in Scala.\n       Blazemeter is a commercial load testing PaaS that is compatible with JMeter. It can run functional and performance test just like any other tool but also offers resource monitoring that can be combined into tests.\n       Telerik’s Test Studio is a standalone testing tool for UI, REST API, and load tests. It focuses a lot on creating tests and integrating them with existing workloads such as CI/CD, bug tracking, etc.\n      There are many, many other tools dedicated to API and load tests. These tools convince due to its transparent and fair (in terms of free tier) pricing model (in case it’s commercial) and functionality that can be integrated into most developers’ toolset.\n Hopefully, this list inspired you and gave you an overview of what type of test tools exist and what kind of capabilities they have. Have fun with testing and finding more tools.\n By the way… if you want to learn more about load testing, check out these links:", "posttime": "2020-05-13 17:17:40", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "负载,tools,测试", "title": "API和负载测试的热门工具", "title_en": "Top Tools for API and Load Testing", "transed": 1, "url": "https://medium.com/@Dickson_Mwendia/top-6-tools-for-api-load-testing-7ff51d1ac1e8", "via": "", "real_tags": ["负载", "tools", "测试"]}, {"category": "", "categoryclass": "", "imagename": "4831a56fd6e2a893dfca72c3085fc4f1.jpg", "infoid": 1001951, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "对作为深入理解广义相对论或量子场论基础所需的数学知识的解释。\n计算机程序的结构和解释以及经典力学的结构和解释的传统中的另一个瑰宝，提供了应用数学，就像前两本书对计算机科学和物理所做的那样。\n对作为深入理解广义相对论或量子场论基础所需的数学知识的解释。\n物理学自然是用数学语言来表达的。刚接触这门学科的学生必须同时学习一门地道的数学语言和用这种语言表达的内容。这就好像他们被要求一边读“悲惨世界”，一边努力学习法语语法。这本书提供了一种创新的方式来学习微分几何，作为深入理解广义相对论或大学水平上教授的量子场论的基础。\n作者采取的方法(在麻省理工学院的课堂上使用了多年)在几个方面与传统的方法不同，包括强调协变导数的开发，以及避免使用传统的张量索引记数法，转而使用语义更丰富的矢量场和微分形式语言。但最大的一个不同之处在于作者将计算机编程融入到他们的解释中。通过编写计算机程序来解释公式，学生很快就能知道公式是否正确。引导学生改进他们的程序，从而提高他们的理解。\n$55.00X|GB 45.00ISBN：9780262019347 248页。|6英寸x 9英寸8英寸(&A；W)。", "note_en": "An explanation of the mathematics needed as a foundation for a deep understanding of general relativity or quantum field theory.\n    Another gem in the tradition of  Structure and Interpretation of Computer Programs and  Structure and Interpretation of Classical Mechanics, providing for applied mathematics what the previous two books did for computer science and physics.\n  An explanation of the mathematics needed as a foundation for a deep understanding of general relativity or quantum field theory.\n Physics is naturally expressed in mathematical language. Students new to the subject must simultaneously learn an idiomatic mathematical language and the content that is expressed in that language. It is as if they were asked to read  Les Misérables while struggling with French grammar. This book offers an innovative way to learn the differential geometry needed as a foundation for a deep understanding of general relativity or quantum field theory as taught at the college level.\n The approach taken by the authors (and used in their classes at MIT for many years) differs from the conventional one in several ways, including an emphasis on the development of the covariant derivative and an avoidance of the use of traditional index notation for tensors in favor of a semantically richer language of vector fields and differential forms. But the biggest single difference is the authors&#39; integration of computer programming into their explanations. By programming a computer to interpret a formula, the student soon learns whether or not a formula is correct. Students are led to improve their program, and as a result improve their understanding.\n  $55.00   X  |   £45.00      ISBN:  9780262019347   248 pp. | 6 in x 9 in  8 b&amp;w illus.", "posttime": "2020-05-13 17:17:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "微分,differential,解释", "title": "泛函微分几何", "title_en": "Functional Differential Geometry", "transed": 1, "url": "https://mitpress.mit.edu/books/functional-differential-geometry", "via": "", "real_tags": ["微分", "解释"]}, {"category": "", "categoryclass": "", "imagename": "d9e68ebfe7718bafe7868ceda171d9f7.jpg", "infoid": 1001950, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "只需几行额外代码就可以很容易地洞察Python Web服务是如何工作的。\n这就是真正的开始！通过添加一个导入和一行来初始化PrometheusMetrics，您将获得在其注册的Flask应用程序的/metrics端点上公开的请求持续时间度量和请求计数器，以及从底层Prometheus客户端库获得的所有默认度量。\n您可以在GitHub存储库中找到一个易于运行的示例，该示例生成一个Prometheus和Grafana实例以及一个演示应用程序来生成一些指标，如下所示：\n您还可以在示例的自述文件中找到仪表板上显示的指标列表，以及填充面板的Prometheus查询。\n该库有很多配置选项，请查看项目自述文件中的示例并进行简要说明。\n基本配置如顶部所示。只需创建一个PrometheusMetrics实例，让我们将其命名为Metrics，然后使用它来定义您希望通过以下方式装饰函数来收集的其他指标：\n计数器对调用进行计数，而其余计数器根据这些调用的持续时间收集度量。您可以为其中的每一个定义标签，可能使用请求或响应的属性。例如：\n从烧瓶导入烧瓶，从prometheus_flask_exporter导入prometheusMetricsapp=flask(__Name__)#按端点分组，而不是按路径度量=prometheusMetrics(app，group_by=&#39；endpoint&#39；)@app.route(&#39；/collection/:collection_id/item/:item_id&#39；)@metrics.counter(&#39；cnt_Collection&#39；，&#39；每个集合的调用次数&#39；，Labels={&#39；集合&#39；：lambda：request.view_args[&#39；Collection_id&#39；]，&#39；status&#39；：lambda resp：res.status_code})def get_item_from_Collection(Collection_id，item_id)：pass\n在上面的示例中，点击端点/Collection/10002/Item/76将增加一个计数器，如cnt_Collection{Collect=&#34；10002&#34；}，另外您将从库中获取默认指标(在本例中为每个端点)，默认情况下：\nflask_http_Request_Duration_Second-按方法、路径和状态列出的所有Flask请求的HTTP请求持续时间(以秒为单位。\n可以选择跳过跟踪某些端点、注册更多默认指标、跳过上述指标或将相同的自定义指标应用于多个端点。请查看项目自述文件，了解可用的内容。\nAPP=Flask(__NAME__)指标=PrometheusMetrics(app)@app.route(&#39；/&#39；)def Main()：default@app.route(&#39；/skip&#39；)@metrics.do_not_track()def SKIP()跟踪的PASS#请求数：PASS#不收集默认指标#要应用于多个端点的自定义指标COMMON_COUNTER=metrics.count(&#39；BY_ENDPOINT_COUNTER&#39；，&#39；请求计数(&#39；按端点&#39；，标签={&#39；Endpoint&#39；：lambda：request.endpoint})@app.route(&#39；/common/one&#39；)@common_counterdef Endpoint_One()：自定义跟踪的路径#和默认的metrics@app.route(&#39；/common/two&#39；)@common_counterdef Endpoint_Two()：路径#也由自定义和默认度量跟踪#注册其他默认度量。register_Default(metrics.count(&#39；by_path_count&#39；，&#39；按请求路径的请求计数&#39；，标签={&#39；path&#39；：lambda：request.path})。\n该库为流行的多处理库提供了一些方便的扩展，如uWSGI和Gunicorn。您还可以找到目标用例的小示例，包括这些多处理用例。\n如上所述，默认情况下，库在Flask应用程序上公开一个/metrics端点，该端点可以作为普罗米修斯抓取的目标。\n从上面仪表板的示例中，您可以将普罗米修斯指向具有默认设置的Flask应用程序，配置如下：\n请参阅GitHub存储库中的完整示例。这里假设，Prometheus可以将您的Flask应用程序实例定位在http://app:5000/metrics，上，在那里，应用程序域名可以潜在地解析为多个IP地址，比如在Kubernetes或Docker Sarm中运行时。\n如果这样公开Metrics端点不适合您，可能是因为您不想允许外部访问它，那么您可以在创建PrometheusMetrics实例时通过传递path=None轻松地禁用它。\n然后，您可以使用start_http_server(Port)在不同的HTTP端口(在上例中为5099)上公开此端点。或者，如果您对端点位于相同的Flask应用程序感到满意，但需要更改其路径，而不是/metrics，则可以传入不同的URI作为path参数，或者使用register_end(..)。以后再安排。\n如果你试试看，打开一个GitHub问题或者在这里留下你的反馈和建议的评论！谢谢!", "note_en": "Getting insights into how your Python web services are doing can be easily done with a few lines of extra code.\n   That’s really it to get started! By adding an import and a line to initialize  PrometheusMetrics you’ll get  request duration metrics and  request counters exposed on the  /metrics endpoint of the Flask application it’s registered on, along with all the default metrics you get from the underlying  Prometheus client library.\n You can find an  easy-to-run example in the GitHub repo that spins up a  Prometheus and a  Grafana instance along with a demo app to generate some metrics, which will look something like this:\n  You’ll also find the list of metrics in the  README of the example that are displayed on the dashboard, along with the Prometheus queries which populate the panels.\n  The library has lots of configuration options, have a look at the  project README for examples of them with a brief explanation.\n The basic configuration is as shown at the top. Simply create a  PrometheusMetrics instance, let’s call it  metrics, then use it do define additional metrics you want collected by decorating functions with:\n  The counters count invocations, while the rest of them collect metrics based on the duration of those invocations. You can define labels for each of these, potentially using properties of the request or the response. For example:\n from flask import Flask, requestfrom prometheus_flask_exporter import PrometheusMetricsapp = Flask(__name__)# group by endpoint rather than pathmetrics = PrometheusMetrics(app, group_by=&#39;endpoint&#39;)@app.route(&#39;/collection/:collection_id/item/:item_id&#39;)@metrics.counter( &#39;cnt_collection&#39;, &#39;Number of invocations per collection&#39;, labels={ &#39;collection&#39;: lambda: request.view_args[&#39;collection_id&#39;], &#39;status&#39;: lambda resp: resp.status_code })def get_item_from_collection(collection_id, item_id): pass\n In the example above, hitting the endpoint  /collection/10002/item/76 would increment a counter like  cnt_collection{ collection=&#34;10002&#34;, status=&#34;200&#34; }, plus you would get the default metrics (per-endpoint in this example) from the library, by default:\n flask_http_request_duration_seconds - HTTP request duration in seconds for all Flask requests by  method, path and status\n There are options to skip tracking certain endpoints, registering more default metrics, or skipping the ones above, or applying the same custom metric to multiple endpoints. Check out the  project README to see what’s available.\n app = Flask(__name__)metrics = PrometheusMetrics(app)@app.route(&#39;/&#39;)def main(): pass # requests tracked by default@app.route(&#39;/skip&#39;)@metrics.do_not_track()def skip(): pass # default metrics are not collected# custom metric to be applied to multiple endpointscommon_counter = metrics.counter( &#39;by_endpoint_counter&#39;, &#39;Request count by endpoints&#39;, labels={&#39;endpoint&#39;: lambda: request.endpoint})@app.route(&#39;/common/one&#39;)@common_counterdef endpoint_one(): pass # tracked by the custom and the default metrics@app.route(&#39;/common/two&#39;)@common_counterdef endpoint_two(): pass # also tracked by the custom and the default metrics# register additional default metricsmetrics.register_default( metrics.counter( &#39;by_path_counter&#39;, &#39;Request count by request paths&#39;, labels={&#39;path&#39;: lambda: request.path} ))\n The library has some  handy extensions for popular multiprocessing libraries, like  uWSGI and  Gunicorn. You can also find  small examples for targeted use-cases, including these multiprocessing ones.\n  As mentioned above, the library exposes a  /metrics endpoint on the Flask application by default, which can serve as a target for  Prometheus scraping.\n From the example with the dashboard above, you can point your Prometheus to a Flask app with the default settings with configuration like this:\n  See the full example  in the GitHub repository. This assumes, that Prometheus can target your Flask application instances on  http://app:5000/metrics, where the  app domain name can potentially resolve to multiple IP addresses, like when running in Kubernetes or  Docker Swarm.\n If exposing the metrics endpoint like this is not suitable for you, perhaps because you don’t want to allow external access to it, you can easily disable it by passing  path=None when creating the  PrometheusMetrics instance.\n  You can then use  start_http_server(port) to expose this endpoint on a different HTTP port,  5099 in the example above. Alternatively, if you’re happy with the endpoint being on the same Flask app, but need to change its path away from  /metrics, you can either pass in a different URI as the  path parameter, or use  register_endpoint(..) to set it up later.\n   If you give it a go, open a  GitHub issue or leave a comment here with your feedback and suggestions! Thanks!", "posttime": "2020-05-13 17:16:38", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "python,博客,监控,指标", "title": "用普罗米修斯·维克多·亚当的博客监控Python烧瓶微服务", "title_en": "Monitoring Python Flask Microservices with Prometheus · Viktor Adam's Blog", "transed": 1, "url": "https://blog.viktoradam.net/2020/05/11/prometheus-flask-exporter/", "via": "", "real_tags": ["python", "博客", "监控", "指标"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001949, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "JY1是一个谜。20世纪70年代初，当来自诺丁汉的一名电台火腿在一个广播节上发出一般呼叫时，一名自称侯赛因、呼号为JY1的男子做出了回应。他声称自己是约旦人，这一点从前两封信中就很清楚了。但是，从一个使用两三位数字作为呼号的国家来说，谁会胆大妄为把自己列为第一呢？无线电火腿被搞糊涂了。他认为没有人的呼号只有一位数，所以他认为那是海盗，诺丁汉郡比斯顿的亨利·巴伦解释说，他的朋友(现已去世)已经拨打了电话。他告诉任何自称JY1的人停止广播，用我无法重复的语言。但是，这位被巴伦的朋友用如此亵渎的语言赶走的业余无线电狂热分子，正是约旦国王侯赛因·本·塔拉勒陛下，他是世界上最著名的业余无线电爱好者。侯赛因国王是一位真正的绅士，他向他解释了为什么他的呼号只是第一。因为，作为国王，他是他的国家的头号人物，这位绅士感到非常尴尬。当他几乎半个世纪没有发动战争、促成和平或治理自己的国家时，已故的侯赛因国王经常在广播中寻找朋友，就像他在广播式的早期版本的互联网聊天室中一样。\n侯赛因国王与声望很高的同伴在一起。在他有生之年，他本可以与其他爱好者KY2(他的妻子，努尔王后)，EA0JC(西班牙国王胡安·卡洛斯)和LU1SM(阿根廷总统卡洛斯·梅内姆)勾搭在一起。普里西拉·普雷斯利(Priscilla Presley)是其他不太可能的名人之一，尽管不那么庄严，但她喜欢用这种方式与世界沟通。在死后，国王加入了已故的VU2RG(拉吉夫·甘地饰)和K7UGA(参议员巴里·戈德沃特饰)的行列。\n但在这些人中，侯赛因是至高无上的。1970年，英国无线电协会授予他荣誉会员资格。当他1993年来到英国时，他抽出时间接受了该协会的官方杂志“无线电通讯”(Radio Com)的采访。\n国王与太空中的第一位业余无线电爱好者W5LFL(欧文·加里奥特在哥伦比亚号航天飞机上)取得了联系：据报道，我们设法在他的第92圈与他安排了日程。这是一次极好的接触，距离地平线大约有三四分钟的距离。国王在旅途中不仅从约旦而且从美国、西班牙、奥地利和加拿大进行操作。他在英国有自己的空间站，尽管由于天线损坏，这个空间站有一段时间无法工作。\n在昨天写给“每日电讯报”的一封信中，一位读者回忆起1964年与28岁的JY1接触的情景。阿拉斯加发生地震后，阿留申群岛上的一小群美国海军人员难以与外界联系。当他们在无线电波中搜索可以与家人建立联系的运营商时，他们在安曼遇到了JY1。\n我们向JY1传递了几条信息，马蒂·贝克写信给JY1，他通过正常的联系给相关家庭打了电话。他肯定因此而损失惨重。国王真是个了不起的国王！他自己也承认，国王有点像个收音机迷。\n他告诉Radcom，我尽量随时随地开展业务。我曾建造过设备，但没有我想要的那么多。这位哈罗大学的前学生，在得到一台哈利克拉夫特收音机后，成为了学校无线电协会的成员，即使在他晚年也是广播节目的常客。\n他说，在危机和困难时期，这是一种与世界各地的朋友保持联系的方式，这些朋友能够帮助传递信息，并获得人道主义援助。\n本周早些时候，爱尔兰一名退休教师表示，他与侯赛因国王保持定期联系。伯尼·奥沙利文(Bernie O&#39；Sullivan)来自爱尔兰西海岸西科克(West Cork)的一个偏远地区比拉(Beara)，他会坐在红海上的游艇上与国王交谈。\n我们是好朋友。他曾经找过我，我也找过他，沙利文说。有时我们会联系三四次，有时可能只联系一次。这种联系持续了大约五年，然后有点泡汤了。我最后一次和他说话是在10年前。我想他最终变得太忙了，没有时间听收音机。化疗后见到他我很难过--他是个伤心欲绝的人。伯尼一生中的两大爱好是业余无线电和飞行。1970年4月，伯尼在切换无线电频段时偶然遇到了国王。\n沙利文说，有一天，我听到他在其中一支乐队上对美国人讲话。他的呼号让我着迷，因为它很短，只有JY1。这封信代表乔丹，数字1代表他自己。听完广播后，我和其他一大批欧洲电视台给他打了电话。\n他要求和爱尔兰电台说几句话。他知道这一点，因为我的呼号一开始就是EI。他过去只是自称侯赛因。没有带有电台火腿的标题。这就是我们的收音机之美--没有阶级之分。只有侯赛因和伯尼。", "note_en": "JY1 was an enigma. When a radio ham from Nottingham put out a general call during a radio festival in the early 1970s, a man calling himself Hussein, with the call sign JY1, responded. That he claimed to be Jordanian was clear enough from the first two letters. But who, from a nation that used two or three digits as its call signs, would be audacious enough to list themselves as number one? The radio ham was confused. &#39;He thought that nobody has a call sign of just one digit, so he thought it was a pirate,&#39; explains Henry Balen, of Beeston in Nottinghamshire, whose friend (who has since died) had put out the call. &#39;He told whoever it was claiming to be JY1 to get off the air in language that I couldn&#39;t repeat.&#39; But the amateur radio fanatic, whom Balen&#39;s friend had sent off with such profanity, was none other than his majesty King Hussein bin Talal of Jordan, the most famous amateur radio enthusiast in the world. &#39;King Hussein was a proper gentleman and explained to him why his call sign was just number one. Because, as the King, he was number one in his country, and the gentleman was very embarrassed.&#39; When he wasn&#39;t making war, brokering peace or running his own country for almost half a century, the late King Hussein was often scanning the airwaves for friends, as if he were in broad- casting&#39;s earlier version of an Internet chat room.\n King Hussein was in prestigious company. During his lifetime he could have hooked up with fellow enthusiasts KY2 (his wife, Queen Noor), EA0JC (King Juan Carlos of Spain) and LU1SM (Argentinian president Carlos Menem). And Priscilla Presley is among the other unlikely, though less stately, celebrities who enjoy communic-ating with the world this way. While in death, the King joins the late VU2RG (Rajiv Ghandi) and K7UGA (Senator Barry Goldwater).\n But among them Hussein reigned supreme. In 1970, the radio society of Great Britain made him an honorary member. When he came to Britain in 1993 he found time to give an interview to the society&#39;s official magazine, Radiocom.\n The King made contact with the first radio amateur in space - W5LFL (Owen Garriott aboard the space shuttle Columbia): &#39;We managed to arrange a schedule with him on his 92nd orbit,&#39; Hussein was reported as saying. &#39;It was an excellent contact, something like three or four minutes horizon to horizon.&#39; The King operated not only from Jordan but from the United States, Spain, Austria and Canada when he was on the road. He had his own station in Britain, although it was put out of action for some time when the antennae was damaged.\n In a letter to the Daily Telegraph yesterday, one reader recalled making contact with a 28-year-old JY1 in 1964. A small group of US Navy personnel on the Aleutian islands were having trouble getting through to the outside world following an earthquake in Alaska. As they searched the radio waves for operators who could establish a link with their families, they came across JY1 in Amman.\n &#39;We passed on several messages to JY1,&#39; wrote Marty Baker, &#39;who duly phoned the families concerned through the normal links. He must have been considerably out of pocket as a result. What a King!&#39; By his own admission, the King was something of a radio addict.\n &#39;I try to operate whenever and wherever I can,&#39; he told Radcom. &#39;I have constructed equipment, but not as much as I would like to.&#39; The former Harrow student, who became a member of the the school&#39;s radio society after he was given a Hallicrafters radio, was a regular on the airwaves even in his later years.\n &#39;In times of crisis and difficulty, it was a way to keep in touch with friends throughout the world who were able to help relay messages and to secure humanitarian help as well,&#39; he said.\n Earlier this week, one retired teacher in Ireland said he was in regular contact with King Hussein. From Beara, a remote area in West Cork on the west coast of Ireland, Bernie O&#39;Sullivan would talk to the King as he sat on his yacht in the Red Sea.\n &#39;We were good friends. He used to look for me and I looked for him,&#39; says Sullivan. &#39;Sometimes we would make contact three or four times, other times it might be once. The contact lasted for about five years, then it sort of fizzled out. The last time I spoke to him was 10 years ago. I think he eventually became too busy for the radio. I was very sad to see him after the chemotherapy - he was a broken man. The two great loves in his life were amateur radio and flying.&#39; Bernie came across the King by accident when he was switching through radio bands in April 1970.\n &#39;I heard him speaking to Americans one day on the one of the bands,&#39; Sullivan said. &#39;His call sign fascinated me because it was very short, just JY1. The letter stood for Jordan and the number one stood for himself. After hearing the broadcast, myself and a load of other European stations called him up.\n &#39;He asked to have a word with the Irish station. He knew that because my call sign started as EI. He used to just give his name as Hussein. There are no titles with radio hams. That&#39;s the beauty of our radio - there is no class distinction. It was just Hussein and Bernie.&#39;", "posttime": "2020-05-13 17:02:41", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "陛下,call,国王", "title": "与陛下的一对一通话(1999)", "title_en": "A one-to-one call with his majesty (1999)", "transed": 1, "url": "https://www.theguardian.com/theguardian/1999/feb/11/features11.g22", "via": "", "real_tags": ["陛下", "call", "国王"]}, {"category": "", "categoryclass": "", "imagename": "5b6cd0a3acd4d190e126eb0cde665ef8.png", "infoid": 1001948, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "尼尔·埃亚尔认为我们花了太多时间试图让工作变得轻松。\n他是一位行为设计专家，曾在斯坦福大学任教，并写过两本畅销书。\n但他认为，我们为了完成工作而求助的大多数生产力灵丹妙药，比如养成习惯或努力进入流程，并不总是像我们希望的那样有用：\n“当大多数人谈论习惯时，他们说的是，‘我想要一些很难变得毫不费力的东西。我想要好处，但我不想让它变得困难。“尼尔在几周前的一次采访中对我说。“好吧，我有个消息告诉你：有些事情就是很难。没有办法绕过它。“。\n问题是，当我们期望工作是毫不费力的，结果却是困难的时候，我们经常责怪自己。因此，我们用来让工作变得更容易的工具，反而会让我们更容易放弃。\nNir推荐了一种不同的方法。他认为完成工作的头号障碍是分心。它无处不在：从我们的社交媒体馈送，到我们的应用程序通知，再到我们的电子邮件收件箱或待办事项列表等假的工作分心事。\n大多数人认为分心是由科技引起的，或者分心意味着他们有问题。\n但尼尔认为，当我们坐下来工作时，分心的时刻实际上是我们人类对不适的反应。“它们不是性格缺陷，而是情绪调节问题，”他说。\n尼尔认为，我们应该开发工具来应对内心的不适，而不是让自己陷入分心之中。一旦我们可以理解，我们就会准备好做好我们最好的工作。\n在这次采访中，我们讨论了尼尔对分心的非正统定义，经历了他变得容易理解的四个步骤，并探索了他如何在自己的生活中使用这个过程。\n嗨，我是尼尔·埃亚尔。我是一名行为设计师，这意味着我使用消费者心理学和行为设计来帮助公司打造在我们生活中养成良好习惯的产品。\n我已经写了两本书，一本是上瘾的，另一本是独立的。“上钩”是关于如何打造养成习惯的产品。“独立生活”是关于如何改掉坏习惯的。\n我在斯坦福大学商学院(Graduate School Of Business)任教多年，后来又在哈索·普拉特纳设计学院(Hasso Plattner Institute Of Design)任教。今天，我主要讲授和写作如何养成好习惯和改掉坏习惯。\n大多数人说，分心的反义词是专注。但我不认为那是真的。我认为分心的对立面不是专注，而是牵引力。\n“牵引”和“分心”实际上都来自同一个拉丁词根，trahere，意思是拉。\n牵引力是任何能把你拉向你想做的事情的动作。相反，分心是指任何会让你偏离计划的行动。\n这是非常非常重要的一点。因为在生产力领域的很多人并不区分牵引和分心。\n这一点你可以在做大量假工作的人身上看得最清楚。我以前也是这样做的：我会坐在办公桌前说，“好了，现在我要把工作做完了，我不会再拖拉了。但首先让我快速查看一下电子邮件。让我来做我待办事项清单上的那一件家务事吧。“。\n人们没有意识到的是，如果你埋头于电子邮件收件箱，而不是做你最重要的工作，你就会分心，就像你在Facebook或Instagram或其他什么网站上一样。根据定义，任何不是你计划做的事情都会让你分心。\n我认为像电子邮件或小的待办事项这样的事情实际上是最有害的干扰，因为它们让人感觉效率很高。如果我在我的待办事项清单上勾选一些让我觉得有成效的事情。\n我们没有意识到的是，在这些情况下，分心欺骗了我们，让我们优先考虑感觉紧急的事情，而不是我们真正需要做的事情。这对你的生产力、你的福祉和你的幸福都是有害的。\n顺便说一句，这并不意味着你永远不应该查看Twitter或Facebook。如果你想浏览Twitter或Facebook，那就去做吧！只要你用心去做，你计划浪费的时间就不是浪费的时间。\n所以：只要不是你计划做的事情，任何事情都会让你分心。同样，任何东西都可以是牵引力。\n在我的书中，我描述了我消除分心的策略。战略这个词非常重要。战略是至关重要的，因为战术是一毛钱一打的。\n不会有一种策略对每个人都有效。您可以使用该策略来尝试单独的策略，直到找到适合您的公式。\n就这样。我们将深入其中的每一个，并讨论它们是什么。\n外部诱因是我们已经想了很多的所有事情。是ping、ping和我们外部环境中的所有东西将我们的注意力从我们计划花费时间的事情上转移开了。\n这些都很重要，但如果你真的观察人们是如何度过时间的，更有可能偷走我们注意力的是内在的触发因素。\n事实证明，分心和拖拉实际上是我们对不舒服感觉的默认反应。它们不是性格缺陷，而是情绪调节问题。\n当我们拖延或分散注意力时，那是因为我们想摆脱不舒服的感觉：无聊、孤独、疲劳、不确定。有时我们通过新闻、酗酒、足球或脸谱网来逃避。每个人都有自己选择的药物。但我们都试图对这些分心的事情做同样的事情：试图缓解情绪上的不适。\n因此，如果你想处理分心问题，你首先要做的就是处理导致分心的负面情绪因素。\n不管生产力大师说什么，其他的狗屎都不管用。首先，也是最重要的，你必须从内部触发因素开始。\n如果你没有工具来处理情绪上的不适，那么所有的生活小窍门都不会奏效。\n在我的生活中，我必须处理许多内部触发因素的地方之一是在我的写作例行公事中。\n我每天早上写作2小时，一周5天。没有例外。\n在这个系统中，我只有一个目标：无论我说什么，只要我说我要做，我就会一直做下去。就这样。\n您还会注意到，我没有设置字数。字数统计太糟糕了。像字数这样的东西真的很难用，因为一项又一项的研究表明，人们很难预测做一件事需要多长时间。我们在这方面做得很糟糕。\n所以总有一天我会写出300字。有时候是1000美元。有时候是3个。但没关系。我只是坐在办公桌前，试着在我的日程表上写上2个小时。这是最重要的。\n现在，人们可能会认为，因为我每天都在写作，所以这很容易。\n当我坐下来写的时候，有几件事经常会出现。无聊。疲劳。焦虑。不确定性。\n写作中有很多不确定性。我从来不知道某一特定的研究方向是否会浪费时间。我写的大部分东西都没有发表。\n我制作的大部分作品都没有启发性。这并不令人兴奋。它会被扔进垃圾桶。\n所以经常会有这样的不确定性，“这会有什么好处吗？”我说的对吗？人们会觉得它有用吗？“。\n解决这一问题的一种方法是向它倾斜，而不是试图摆脱它。如果你向不确定性倾斜，你就能开始在未知中发现美。\n例如，你可以寻找工作中的可变性-比如你对它的感觉，那种不确定的感觉，是如何随着时间的推移而变化的。你也可以更专注于作品的细节--使作品保持原样的微小细节。这就是人们学会热爱各种东西的方式。\n因此，一项研究不再是黑暗可怕的东西，它开始像一朵花一样绽放。你开始看到这项任务的美妙之处。对我来说，这就是不确定性。这实际上是驱使我现在回到研究中的原因，而不是让我分心-因为我不知道会发生什么。这很令人兴奋。\n但也有其他方法来处理出现的触发因素。例如，对我来说，另一个触发因素是想要查到一些东西。我会写作，我会让这种疯狂的渴望去谷歌一些东西-我知道这会把我送进一个让我分心的兔子洞。\n我不会在谷歌上搜索，我通常会做的是在一张纸上写下我认为我需要查找的任何东西。然后我会给自己10分钟的时间。如果十分钟后这件事真的那么重要，那么也许我会去查一查。通常这很管用，我就可以回去工作了。\n当10分钟过去的时候，我觉得谷歌需要什么似乎不再那么重要了。\n然而，有时这种冲动并不会消失。当你想吃一块巧克力蛋糕时，你可能会有同样的冲动。\n如果发生这种情况，那么我会做我所谓的“冲浪冲动”。你基本上是带着感觉坐着，检查它。你会发现，如果你能做到这一点，它不会永远持续下去--尽管它看起来会持续下去。\n但这里的关键，也是我真正想要回家的一点是，有时候这种事情并不容易。\n当人们说“我想养成一个习惯”时，他们实际上是在说：“我想要一些很难毫不费力地养成的东西。”他们说：“我想要好处，但我不想让事情变得艰难。”\n这就是为什么会有习惯的神话，因为人们知道习惯的定义是很少或根本没有意识的行为。但我有个消息要告诉你们：写作，就像许多其他行为一样，是很难的，它需要很多有意识的思考，至少对我来说是这样。\n这和心流是一样的。你已经听说了，我相信所有关于心流的研究，对大多数人来说都不是很好的建议。因为再一次，它让你认为你可以毫不费力地做任何事情。你知道，职业篮球运动员很活跃。但是，当你在纳税的时候，你是如何进入流程的呢？\n写作也是如此。我已经写了两本书和数百篇文章。写作从来都不是一件容易的事。这很无聊。这是令人沮丧的。这很难。它正在产生焦虑。\n当我写作时，有所有这些内部触发因素。因此，如果我没有解除这种不适的技巧，这样我就可以继续做任务了，我会分心的。这就是为什么我们不应该崇拜这个习惯或流动的祭坛。\n一旦你开始走上掌握内在触发因素的道路，下一步就是计划如何度过你的时间。我把这叫做做牵引的时间。\n您的日程安排需要由您的值来定义。值是你想成为的人的属性。一旦我们了解了我们想要成为什么样的人，我们就可以制定一个与之对应的日程表。\n这感觉很复杂，但事实并非如此。我不想让你做幻想板。我不想让你做一个五年计划。我要你做的就是制定明天的日程安排。就这样。只要做个时间表就行了。\n有三个重要的生活领域需要考虑：你，你的人际关系，你的工作。\n我希望你明天在你的日程表上为这三个生命领域中的每一个都留出时间。这个项目是要弄清楚如何将你的价值转化为时间。所以，如果你的价值观之一是你的精神健康，那么问题是：你打算在你的日程表上安排多少时间进行冥想，或者治疗，或者任何其他以这种方式支持你的时间？你打算什么时候做这件事？\n你工作需要多长时间？请记住，有两种类型的工作：反应性工作(回复电子邮件、松懈等)。和反思性的作品。把它放进你的日历里。\n你不能把某件事叫做分心，除非你知道它让你分心的是什么。知道你是否分心的唯一方法是你是否计划把时间花在一件事上，而不是把时间花在其他事情上。\n一旦你掌握了你的内部触发因素，并计划好了你的时间，你就准备好了第三步：砍掉外部触发因素。\n一旦我坐到我的办公桌前，我就试着消除我的外部触发因素。这是幼儿园的东西。\n我关闭了所有的通知，并确保我的工作空间不受干扰。例如，您会注意到我的桌面完全是空的。这可是件大事，对吧？\n您不希望在您的工作区中有任何外部触发器。请勿打扰始终处于启用状态。因此，我的桌面上没有收到任何烦人的通知。这一直都是这样。我认为在你的桌面上发布通知不是一个好主意。如果有人真的需要联系我，他们可以用我的电话。\n一个重要的外部诱因，特别是现在，是孩子们。现在我们在家工作，这对我们来说尤其困难。\n要和孩子打交道，你需要做的第一件事当然是和你的伴侣建立真正牢固的关系。理想情况下，你们可以在不同的时间分担照顾他们的负担，这样你们每个人都能把事情做好。你设定一个时间表，一个伙伴把孩子从W小时带到X小时，然后另一个伙伴把他们从Y带到Z。\n但除此之外，我还有一项技术，它确实有效地减少了我的孩子们打断我的次数。这是我工作时戴的帽子。我们称它为集中王冠。\n当我戴上专注力王冠时，它向我女儿发出了一个信号，那就是我不能被打扰。顺便说一句，这也适用于同事。你不一定需要一顶愚蠢的帽子-你只需要一种方式让人们知道你什么时候可以被打扰，什么时候不能被打扰。\n他用契约来处理他最麻烦的任务，比如锻炼。\n这对我的写作来说已经足够了。但实际上，我想谈的是这个体系的第四个组成部分：契约。\n我不会用它们来写作，但我确实会把它们用在我必须完成的任务上，而这些任务我最有可能会跳过。\n例如，我一直讨厌锻炼，实际上我曾经临床上患有肥胖症。我真的一直讨厌锻炼。但不管怎样，我每天早上都要锻炼--所以问题是，如何锻炼呢？\n首先，我已经完成了系统中的其他三个步骤。我已经掌握了锻炼的内在触发因素。这是我每天的日程安排。我已经排除了可能会阻止它的外部触发因素。\n协议有几种类型，但当涉及到锻炼时，我使用价格协议。基本上，这意味着我已经建立了一种金钱上的抑制，让我不去锻炼。它的工作原理是这样的：\n我衣柜里有一本日历，日历上别着一张100美元的钞票。日历上的每一天，我可以通过去健身房来燃烧卡路里，或者我必须燃烧100美元的钞票。每天我都会把账单移到日历上的下一天，然后再做一次选择。\n答案是肯定的。你必须烧掉它。这叫做“烧”或“烧”。为什么？因为送人感觉很好，你必须为此感到难过，才能让这件事奏效。\n顺便说一下，我从来没有烧过钱。为什么？因为我只做他妈的20个俯卧撑。\n它的名字叫“火花”，是专门为超级组织者高级会员制作的。\n它的灵感来自蒂亚戈·福特(Tiago Forte)的Para方法论-文件应该按可操作性排序的想法。\n最近是指在过去3天内创建或修改的任何文件。\n它简单、干净，旨在确保您的桌面不受外部触发器的影响，这样您就可以完成最重要的工作。", "note_en": "Nir Eyal thinks we’re spending too much time trying to make work easy.\n He’s a behavioral design expert who taught at Stanford and has written two best-selling books.\n But he thinks most of the productivity panaceas, like forming habits or trying to get into flow, that we all turn to in order to get our work done aren’t always as useful as we might hope:\n “When most people talk about habits, what they’re saying is, ‘I want something that’s difficult to become effortless. I want the benefits but I don’t want it to be hard,” Nir said to me in an interview a few weeks ago. “Well, I have news for you: some things are just hard. There’s no way of getting around it.”\n The problem is, when we expect work to be effortless and it ends up being difficult, we often blame ourselves. So the very tools we’re using to make work easier, can instead make it easier for us to give up.\n Nir recommends a different approach. He thinks the number one barrier to getting our work done is distraction. It’s all around us: from our social media feeds, to our app notifications, to pseudo work distractions like our email inbox or our todo lists.\n Most people think distraction is caused by technology, or that being distracted means there’s something wrong with them.\n But Nir thinks that moments of distraction are actually our own human reaction to the discomfort we feel when we sit down to do our work. “They’re not character flaws, they’re emotional regulation problems,” he says\n Nir thinks that we should develop tools to deal with internal discomfort instead of burying ourselves in distraction. And that once we’re indistractable, we’ll be ready to do our best work.\n In this interview we talk about Nir’s unorthodox definition of distraction, go through his four-step process to becoming indistractible, and explore how he uses this process in his own life.\n   Hi, I’m Nir Eyal. I&#39;m a behavioral designer which means I use consumer psychology and behavioral design to help companies build the kind of products that build good habits in our lives.\n I’ve written two books,  Hooked and  Indistractable. Hooked was about how to build habit-forming products. Indistractable is about how to break bad habits.\n I taught for many years at Stanford at the Graduate School of Business, and then later at the Hasso Plattner Institute of Design. And today, I mostly teach and write about how to build good habits and break bad ones.\n    Most people say that the opposite of distraction is focus. But I don’t think that’s true. I think that the opposite of distraction is not focus, it is  traction.\n Both “traction” and “distraction” actually come from the same Latin root,  trahere, which means to pull.\n Traction is any action that pulls you toward what you want to do. By contrast, distraction is any action that pulls you away from what you planned to do.\n This is a really, really important point. Because a lot of people in the productivity space don’t differentiate between traction and distraction.\n You can see this most clearly in people that do a lot of pseudo-work. I used to do it too: I would sit down at my desk and I would say, “Okay, now I’m going to get my work done, I’m going to stop procrastinating.  But first let me just check email real quick. Let me just do that one chore on my todo list.”\n What people don’t realize is that if you’re buried in your email inbox instead of doing your most important work, you are just as distracted as if you went on Facebook or Instagram or whatever. Anything that is not what you planned to do is by definition a distraction.\n And I think that things like email, or small todo list items are actually the most pernicious distractions because they  feel productive. If I’m checking something off of my todo list that feels productive.\n What we don’t realize is that in those instances, distraction has tricked us into prioritizing what feels urgent as opposed to what we really need to be doing. And that is toxic for your productivity, for your well-being, and for your happiness.\n And by the way, this doesn’t mean that you should  never check Twitter or Facebook. If you want to scroll through Twitter or Facebook, do it! As long as you do it with intent, the time you  plan to waste is not wasted time.\n So: anything is a distraction as long as it’s not what you planned to do. In the same way, anything can be traction, too.\n   In my book I describe my strategy for eliminating distraction. That word, strategy, is very important. The strategy is critical, because tactics are a dime a dozen.\n There isn’t going to be one tactic that works for everyone. You use the strategy to try individual tactics until you find the right formula for you.\n   That’s it. We’ll go into each of these and talk about what they are.\n   External triggers are all of the things that we already think a lot about. It’s the pings, and the dings, and all the things in our external environment that are pulling our attention away from the thing we had planned to spend our time on.\n These are important to pay attention to, but if you actually observe how people spend their time, the thing that is more likely to steal our attention is the internal triggers.\n  It turns out that distraction and procrastination are actually our default responses to uncomfortable feelings. They’re not character flaws, they’re emotional regulation problems.\n When we procrastinate or distract ourselves it’s because we want to escape from uncomfortable sensations: boredom, loneliness, fatigue, uncertainty. Sometimes we escape through news, booze, football, or Facebook. Everyone has their drug of choice. But we’re all trying to do the same thing with these distractions: attempting to relieve emotional discomfort.\n So if you want to deal with distraction the first thing you have to do is deal with the negative emotional triggers that lead to it.\n None of the other shit works, whatever any productivity guru says. You first and foremost have to start with the internal triggers.\n If you don’t have the tools to deal with emotional discomfort, none of the life hacks work.\n  One of the places in my life where I have to deal with a lot of internal triggers is in my writing routine.\n I write every day in the morning for 2 hours, 5 days a week. No exceptions.\n In this system I only have one goal: to work on whatever it is I say I’m going to work on for as long as I say I’m going to work on it. That’s it.\n What you’ll also notice is that I don’t set a word count. Word counts are terrible. It’s really hard to use things like word counts because study after study has shown that people are terrible at predicting how long it will take to do something. We’re awful at it.\n So some days I’ll produce 300 words. Sometimes it’s 1,000. Sometimes it’s 3. But it doesn’t matter. I just stay at my desk and try to write for the 2 hours on my schedule. And that’s the most important thing.\n Now, people might think that because I write every day that it’s easy.\n  When I sit down to write a few things come up regularly. Boredom. Fatigue. Anxiety. Uncertainty.\n There’s a lot of uncertainty in writing. I never know if a particular line of research is going to be a waste of time. Most of the stuff I write about doesn’t get published.\n Most of what I produce isn’t illuminating. It’s not exciting. It gets trashed.\n So there’s constantly this uncertainty of, “Is this going to be any good? Am I right? Are people going to find it useful?”\n One way to deal with that is to lean into it instead of trying to get away from it. If you lean into the uncertainty, you can start to find beauty in the unknown.\n For example, you can look for the variability in the work — on how the way you feel about it, that feeling of uncertainty, is changing over time. You can also focus more intently on the details of the work — the minute details that make it the way it is. That’s how people learn to love all kinds of things.\n So a piece of research isn’t this dark scary thing anymore, it starts to unfold like a flower. You start to see the beauty in the task. For me, that’s what uncertainty is. It’s actually what drives me back to research now rather than causing me to be distracted — because I don’t know what’s going to happen. And that’s exciting.\n But there are other ways to deal with the triggers that come up too. For example, another trigger for me is the desire to look something up. I’ll be writing and I’ll get this insane itch to go Google something — which I know will send me down a rabbit hole of distraction.\n  Rather than Google it, what I&#39;ll often do is write down on a piece of paper whatever it is I think I need to look up. And then I&#39;ll give myself 10 minutes. And if it&#39;s so important after ten minutes then maybe I’ll look it up. Usually that works, and I can just get back to work.\n By the time the ten minutes are up what I felt like I needed to Google doesn’t seem that important anymore.\n Sometimes, though, the urge doesn’t go away. It’s the same type of urge that you might feel when you want to eat a piece of chocolate cake.\n If that happens, then I do what I call “surfing the urge.” You basically sit with the sensation, and examine it. You’ll find that if you can do that, it doesn’t last forever — even though it feels like it will.\n  But the key here, the point I really want to drive home, is that sometimes this stuff just isn’t easy.\n When people say, “I want to start a habit,” what they’re really saying is: “I want something that&#39;s difficult to become effortless.” They’re saying: “I want the benefits, but I don&#39;t want it to be hard.”\n That&#39;s why there&#39;s this myth of habits, because people know the definition of a habit is a behavior done with little or no conscious thought. But I have news for you folks: writing, like many other behaviors, is hard, it requires a lot of conscious thought, at least it is for me.\n It’s the same deal with flow. You’ve heard, I’m sure all of the research on flow, and it’s actually not very good advice for most people. Because again, it makes you think you can make anything effortless. You know, professional basketball players are in flow. But how do you get into flow when you’re doing your taxes?\n Same with writing. I&#39;ve written two books, and hundreds of articles. Writing is never easy. It&#39;s boring. It&#39;s frustrating. It&#39;s difficult. It&#39;s anxiety producing.\n There&#39;s all these internal triggers when I write. And so if I don&#39;t have the techniques to disarm that discomfort so that I can stay on task I&#39;ll get distracted. And that&#39;s why we shouldn&#39;t worship at this altar of habits or flow.\n   Once you’ve started down the path of mastering your internal triggers, the next step is to plan how you spend your time. I call this making time for traction.\n Your schedule needs to be defined by your values. Values are the attributes of the person that you want to become. Once we understand the kind of people we want to become, we can create a schedule that maps to that.\n This feels complicated but it’s not. I don’t want you to do a vision board. I don’t want you to do a 5 year plan. All I want you to do is make a schedule for tomorrow. That’s it. Just make a schedule.\n There are three life domains that are important to consider: You, Your Relationships, Your Work.\n   I want you to block time on your schedule tomorrow for each of those three life domains. The project is to figure out how to turn your values into time. So, if one of your values is your mental well-being the question is: how much time are you going to put on your schedule for meditation, or therapy, or whatever else supports you in that way? When are you going to do it?\n  How much time do you need for work? And keep in mind there are two types of work: reactive work (responding to emails, Slacks, etc.) and reflective work. Put that in your calendar.\n  You can’t call something a distraction unless you know what it distracted you from. The only way to know if you were distracted is if you planned to spend your time on one thing, and instead you spent your time on something else.\n Once you’ve mastered your internal triggers, and planned your time you’re ready for the 3rd step: hacking back external triggers.\n  Once I sit down at my desk, I try to eliminate my external triggers. This is the kindergarten stuff.\n I turn off all of the notifications, and make sure my workspace is free from distraction. For example, you’ll notice my desktop is totally empty. That&#39;s a big deal, right?\n    You don&#39;t want any external triggers in your workspace. Do Not Disturb is always turned on. So I don&#39;t get any bothersome notifications on my desktop. That&#39;s all the time. I think notifications on your desktop are a bad idea. If someone really needs to get in touch with me they can use my phone.\n One big external trigger, especially right now, is kids. This is especially difficult for us now that we’re working from home.\n To deal with kids, the first thing you need to have, of course, is a really strong relationship with your partner. Ideally you can share the load of taking care of them at different times, so that each of you can get things done. You set a schedule where one partner takes the kids from W hour to X hour, and then the other partner takes them from Y to Z\n But aside from that, I have a technique that’s been really effective for reducing the number of interruptions I get from my kids. It’s a hat that I put on when I’m working. We call it the concentration crown.\n    When I’m wearing the concentration crown it sends a signal to my daughter that I can’t be interrupted. By the way, this also works for co-workers too. You don’t necessarily need a silly hat — you just need a way of letting people know when you can and can’t be interrupted.\n  He uses pacts to deal with the tasks he has the most trouble with like exercise\n   And that’s enough for me for writing. But there’s actually a fourth component of the system that I want to talk about: pacts.\n I don’t use them for writing, but I do use them for the tasks that I have to do that I’m most likely to skip out on.\n For example, I always hated working out, and I actually used to be clinically obese. I really always hated exercise. But I work out every morning anyway — so the question is, how?\n Well first, I’ve done the three other steps in the system. I’ve mastered my internal triggers around exercise. It’s on my schedule every day. And I’ve eliminated external triggers that might prevent from doing it.\n  There are a few types of pacts, but when it comes to exercise I use a price pact. Basically, what that means is I’ve established a monetary disincentive for me to skip my workout. It works like this:\n In my closet I have a calendar, and pinned to the calendar is a $100 bill. For each day on the calendar I can either burn the calories by going to the gym, or I have to burn the $100 bill. Each day I move the bill to the next day on the calendar and make the choice over again.\n    The answer is yes. You have to burn it. It&#39;s called burn or burn. Why? Because giving it away feels good, you have to feel bad about it in order for this to work.\n By the way, I&#39;ve never burned the money. Why? Because I just do the 20 fucking pushups.\n        It’s called  Sparkle and it’s made exclusively for Superorganizers Premium members.\n       It’s inspired by  Tiago Forte’s PARA methodology — the idea that files should be sorted by actionability.\n  Recents is any file that has been created or modified in the last 3 days\n  It’s simple, and clean, and designed to make sure that your desktop is free from external triggers, so that you can do your most important work.", "posttime": "2020-05-13 16:32:58", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "hard,分心", "title": "不要试图让辛苦的工作变得容易", "title_en": "Stop trying to make hard work easy", "transed": 1, "url": "https://superorganizers.substack.com/p/stop-trying-to-make-hard-work-easy", "via": "", "real_tags": ["hard", "分心"]}, {"category": "", "categoryclass": "", "imagename": "eef5b6821e968095240be0857045ac36.png", "infoid": 1001947, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "Janet是一种函数式和命令式编程语言。它可以在Windows、Linux、MacOS、BSD上运行，也可以通过一些移植在其他系统上运行。整个语言(核心库、解释器、编译器、汇编器、PEG)小于1Mb。您还可以通过嵌入单个C文件和两个头文件将Janet脚本添加到应用程序中。\nJanet是一种很好的系统脚本语言，或者是一种可以嵌入到其他程序中的语言。想想Lua或者Guile吧。Janet还可以用于快速原型、动态系统以及Lisp闪耀的其他领域。Janet主要是用标准C99实现的，可以在Windows、Linux和MacOS上运行。少数非标准C的特性(动态库加载、编译器特定优化)相当简单。珍妮特可以很容易地移植到新的平台上。\n当在没有参数的情况下调用二进制文件时，将启动REPL。传递-h标志以显示使用信息。可以使用Janet myscript.janet运行各个脚本。\n如果您要浏览，可以通过在REPL中输入all-bindings命令来打印所有可用宏、函数和常量的列表。\n$janetJanet 1.0.0-dev-cc1ff91版权所有(C)2017-2019Calvin Rosejanet：0：&gt；(+1 2 3)6janet：10：&gt；(print&#34；Hello，world！&#34；)您好，world！niljanet：34：&gt；(OS/EXIT)$Janet-HUSAGE：Janet[Options]脚本参数.选项有：-h：显示此帮助-v：打印版本字符串-s：使用原始stdin而不是getline之类的功能-e code：执行janet字符串-r：在运行所有脚本后输入repl-p：如果出现顶级错误则继续执行(持久)-q：隐藏提示、徽标、。和repl输出(安静)-k：编译脚本但不执行-m syspath：设置加载全局模块的系统路径-c源代码输出：将Janet源代码编译成图像-n：禁用repl-l路径中的ANSI颜色输出：在运行主脚本之前执行文件中的代码--：停止处理选项。\n查看GitHub上的一些辅助项目。这是珍妮特的一份简短的图书馆清单，可以帮助你开始学习一些有趣的东西。有关更完整的列表，请参阅Janet包清单。清单中的包可以通过JPM install pkg-name安装。\n欢迎在珍妮特·吉特频道上提问和参与讨论。或者，也可以在Freenode上查看#Janet频道。", "note_en": "Janet is a functional and imperative programming language. It runs on Windows, Linux, macOS, BSDs, and should run on other systems with some porting. The entire language (core library, interpreter, compiler, assembler, PEG) is less than 1Mb. You can also add Janet scripting to an application by embedding a single C file and two headers.\n    Janet makes a good system scripting language, or a language to embed in other programs. Think Lua or Guile. Janet also can be used for rapid prototyping, dynamic systems, and other domainswhere Lisp shines. Implemented mostly in standard C99, Janet runs on Windows, Linux and macOS.The few features that are not standard C (dynamic library loading, compiler specific optimizations),are fairly straightforward. Janet can be easily ported to new platforms.\n      A REPL is launched when the binary is invoked with no arguments. Pass the -h flagto display the usage information. Individual scripts can be run with  janet myscript.janet\n If you are looking to explore, you can print a list of all available macros, functions, and constantsby entering the command  all-bindings into the REPL.\n $ janetJanet 1.0.0-dev-cc1ff91 Copyright (C) 2017-2019 Calvin Rosejanet:0:&gt; (+ 1 2 3)6janet:10:&gt; (print &#34;Hello, world!&#34;)Hello, world!niljanet:34:&gt; (os/exit)$ janet -husage: janet [options] script args...Options are: -h : Show this help -v : Print the version string -s : Use raw stdin instead of getline like functionality -e code : Execute a string of janet -r : Enter the repl after running all scripts -p : Keep on executing if there is a top level error (persistent) -q : Hide prompt, logo, and repl output (quiet) -k : Compile scripts but do not execute -m syspath : Set system path for loading global modules -c source output : Compile janet source code into an image -n : Disable ANSI color output in the repl -l path : Execute code in a file before running the main script -- : Stop handling options\n    See some auxiliary projects on  GitHub. Here is a short list of librariesfor Janet to help you get started with some interesting stuff. See  the Janet Package Listingfor a more complete list. Packages in the listing can be installed via  jpm install pkg-name.\n     Feel free to ask questions and join discussion on the  Janet Gitter Channel.Alternatively, check out  the #janet channel on Freenode.", "posttime": "2020-05-13 16:18:16", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "表现力,lightweight,janet", "title": "珍妮特：轻量级、富于表现力和现代感的Lisp", "title_en": "Janet: a lightweight, expressive and modern Lisp", "transed": 1, "url": "https://janet-lang.org", "via": "", "real_tags": ["表现力", "janet"]}, {"category": "", "categoryclass": "", "imagename": "54dbcf0bdd363782b953743faf770a04.jpeg", "infoid": 1001946, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "脱机PDF编辑器。在浏览器中将图像、绘图和文本添加到PDF。🚀-市池静久/pdf-编辑", "note_en": "Offline PDF editor. Add images, drawing, text to PDF in your browser. 🚀 - ShizukuIchi/pdf-editor", "posttime": "2020-05-13 16:03:32", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "pdf", "title": "浏览器中的脱机PDF编辑器", "title_en": "Offline PDF Editor in the Browser", "transed": 1, "url": "https://github.com/ShizukuIchi/pdf-editor", "via": "", "real_tags": ["pdf"]}, {"category": "", "categoryclass": "", "imagename": "c70ae0990be25e7fd1171c771c2703e5.jpeg", "infoid": 1001944, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "美国有线电视新闻网(CNN)一个误导性的标题引发了社交媒体风暴。以下是数据实际显示的情况。\n5月11日，美国有线电视新闻网(CNN)在其网站上发布了一篇标题为“一项新的调查发现，68%的美国人表示在恢复正常生活之前需要接种冠状病毒疫苗”的报道。CNN官方账号随后发布的一条推文使用了相同的措辞。许多评论员都做出了负面反应，称这表明美国人“被宠坏了”，称这是“一种幻想”，增加了“未来发生冲突和冲突的可能性”，并指出“接种疫苗从来都不是一个完全可能的时间表”。\n“正常生活”这个词是模棱两可的。这是否意味着回到冠状病毒之前的正常状态，在公共场合不戴口罩，餐厅人满为患，不用担心大型室内聚会，如音乐会、篮球比赛和会议？这是否意味着许多州已经放松的政府强制封锁的结束？也许它意味着介于两者之间的某种东西。CNN的文章没有说。\n更糟糕的是，这些数据与CNN的头条或推文不符，这是许多人在社交媒体时代将看到的全部内容。\n这篇文章没有链接到任何民意调查-从来都不是一个好兆头-但提到了“两次盖洛普调查”。我搜索了盖洛普关于冠状病毒的民意调查，关于“正常生活”的调查问题没有那么模棱两可，结果与CNN的说法有很大不同。\n其中一个问题是，如果“没有政府限制”，“你会在多长时间内恢复正常的日常活动”，给出了四个选择。最受欢迎的答案是“在新病例数量大幅下降后”，在最近的调查中获得了40%的支持率。最不受欢迎的答案是“在研制出冠状病毒疫苗之后”。只有9%的人赞成这样做。\n还有另一个提到疫苗的问题，这可能就是CNN得出68%的数字的原因：“当你考虑到自己是否愿意恢复正常活动时，以下每一个因素对你有多重要？”\n对于“提供预防冠状病毒的疫苗”，68%的受访者表示非常重要。另有17%的人说有些重要，8%的人说不太重要，只有7%的人说根本不重要。\n当然可以。如果有COVID疫苗，谁不会恢复正常活动呢？但与CNN的文章不同的是，这个问题并没有说明什么是“需要的”。\n“考虑你的意愿”比“需要”要少得多。人们当然在考虑这件事。这并不意味着他们不愿意在没有它的情况下恢复正常的活动。\n盖洛普用这个问题问了11件事。仅从“非常重要”的百分比来看，有三个超过了疫苗的68%：“对任何冠状病毒检测呈阳性的人进行强制隔离”(80%)，“改进治疗冠状病毒的医疗方法”(77%)，以及“新病例或死亡人数的显著减少”(73%)。\n受访者不需要只选择其中一个因素，显然也没有。超过50%的受访者表示，其中七个因素非常重要，如果我们再加上一些重要的因素，所有11个因素都超过了60%。\n此外，虽然“医疗当局保证当地医院有能力接收病人”的得分比疫苗低(59%比68%)，但当加上一些重要的因素时，它的得分更高(89%比85%)。而且“识别和监测冠状病毒感染的广泛测试”也很接近(61%非常重要，如果加上一些重要的话，82%)。\n声称这项调查显示“68%的美国人认为恢复正常生活前需要接种疫苗”是对数据的严重误解。看看盖洛普提到疫苗的两个问题，数据显示，美国人正在考虑很多事情，主要是担心新病例的下降。\nCNN应该删除这条推文，修复这篇文章，发布更正，并在未来更加谨慎地准确表达调查数据。\n这篇帖子引起了很多关注，大约在东部时间下午4点左右，CNN更新了它的文章。\n新的调查发现，现在的标题是“68%的美国人表示，在恢复正常生活之前，可用的疫苗非常重要。”我不认为这是最好的框架-因为，正如上面提到的，有更受欢迎的答案-但这是一个重大的改进。与原来的标题不同，新标题准确地传达了盖洛普调查中的一些信息。\n此外，CNN的这篇文章现在底部增加了一条注释，称“澄清是为了强调受访者对每个基准的重要性以及他们重返正常活动的意愿”-这是另一个回应我批评的改进。\n几个小时后，CNN删除了这条推文，标题是歪曲盖洛普的数据。郑重声明，以下是原版的截图：", "note_en": "A misleading CNN headline set off a social media storm. Here’s what the data actually says.\n  On May 11, CNN posted a  story to its website headlined “68% of Americans say a coronavirus vaccine is needed before returning to normal life, a new survey finds.” A subsequent  tweet from the official CNN account used identical phrasing. Various commentators reacted negatively, saying it showed  Americans are “spoiled,” calling it “ a fantasy,” raising  the possibility of “strife and conflict down the road,” and  noting that “Never is a perfectly likely timeline for a vaccine.”\n The term “normal life” is ambiguous. Does it mean a return to pre-coronavirus normal, with no masks in public, packed restaurants, and no worries about large indoor gatherings such as concerts, basketball games, and conferences? Does it mean the end of government-mandated lockdowns, which many states are easing already? Maybe it means something in between. The CNN article doesn’t say.\n Even worse, the data doesn’t match CNN’s headline or tweet, which is all many people will see in the age of social media.\n The article doesn’t link to any polls— never a good sign — but mentions “two Gallup surveys.” I searched  Gallup’s polling on coronavirus, and the survey questions are less ambiguous regarding “normal life,” with results that differ substantially from CNN’s claim.\n One question asks “how soon would you return to your normal day-to-day activities” if “there were no government restrictions,” giving four options. The most popular answer is “after the number of new cases declines significantly,” getting 40 percent in the most recent survey. The least popular answer is “after a coronavirus vaccine is developed.” Only 9 percent went with that.\n   There’s another question that mentions vaccines, which is probably where CNN got the 68 percent figure: “How important are each of the following factors to you when thinking about your willingness to return to your normal activities?”\n For “the availability of a vaccine to prevent COVID-19,” 68 percent of respondents said very important. Another 17 percent said somewhat important, while 8 percent said not too important, and just 7 percent said not important at all.\n Well, sure. If there was a COVID vaccine, who wouldn’t return to their normal activities? But the question, unlike CNN’s article, doesn’t say anything about what’s “needed.”\n “Thinking about your willingness” is much less restrictive than “needed.” Of course people are thinking about it. That doesn’t mean they’re unwilling to resume normal activities without it.\n Gallup uses this question to ask about eleven things. Looking only at the percentage saying “very important,” three beat the vaccine’s 68 percent: “Mandatory quarantine for anyone testing positive with COVID-19” (80 percent), “improved medical therapies to treat COVID-19” (77 percent), and “a significant reduction in the number of new cases or deaths” (73 percent).\n  Respondents don’t have to pick just one of these factors, and clearly didn’t. More than 50 percent said that seven of the factors are very important, and if we add in somewhat important, all eleven factors clear 60 percent.\n Additionally, while “assurances from medical authorities that local hospitals have capacity to accept patients” has a lower very important score than a vaccine (59 percent v. 68 percent), it has a higher score when adding in somewhat important (89 percent v. 85 percent). And “widespread testing to identify and monitor coronavirus infections” is close (61 percent very important, 82 percent when adding in somewhat important).\n Claiming that this survey shows that “68% of Americans say a vaccine is needed before returning to normal life” is an egregious misreading of the data. Looking at the two Gallup questions that mention vaccines, the data shows that Americans are thinking about a lot of things, and primarily concerned about a decline in new cases.\n CNN should delete the tweet, fix the article, issue a correction, and be a lot more careful to accurately represent survey data in the future.\n   This post got a  lot of  attention, and around 4:00 pm eastern,  CNN updated its article.\n The headline now says “68% of Americans say an available vaccine is very important before returning to normal life, new survey finds.” I don’t think that’s the best framing — because, as noted above, there were more popular answers — but it’s a significant improvement. Unlike the original headline, the new one accurately conveys something in the Gallup survey.\n Additionally, the CNN article now includes a note at the bottom saying it was “clarified to emphasize that respondents were rating the importance of each benchmark to their willingness to return to regular activities” — another improvement that addresses my criticism.\n A couple of hours later, CNN deleted the tweet with the headline that misrepresented the Gallup data. For the record, here’s a screenshot of the original:", "posttime": "2020-05-13 16:01:30", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "接种,vaccine,cnn", "title": "不，68%的美国人认为在恢复正常之前不需要接种疫苗", "title_en": "No, 68% of Americans Do Not Think a Vaccine Is Needed Before Returning to Normal", "transed": 1, "url": "https://arcdigital.media/no-68-of-americans-do-not-think-a-vaccine-is-needed-before-returning-to-normal-life-b0762e1223dc", "via": "", "real_tags": ["接种", "vaccine", "cnn"]}, {"category": "", "categoryclass": "", "imagename": "8dab88a9b6d0d9f7039e7e379efb4b55.jpg", "infoid": 1001943, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "今天，我们宣布，Eclipse基金会正在转型，成为一个总部设在欧洲的组织，特别是比利时的国际非营利组织。我想借此机会与大家分享我们的过渡计划，以及这项宣布对我们社会的意义。\n让我们从一些背景开始。2020年第一季度是我们组织历史上最成功的季度，增加了40家新成员公司、5个新工作组和11个新项目提案。在过去几年中，我们的社区已经扩展到在云和边缘应用、物联网、人工智能、数字分类帐技术、开放式处理器设计等许多技术领域创建新项目。再加上我们在Java、工具和富客户端平台以及建模方面的根基，这使得Eclipse Foundation成为各种令人兴奋的、以商业为重点的开源技术的发源地。\n我们的目标是继续这种增长和多样化，并继续建立Eclipse基金会，使其成为一个支持全球开放协作和创新的机构。我们相信，这一战略将使基金会以及您对我们开源项目的投资更加安全和可持续。\n我们相信，这次“迁往欧洲”是我们实现这一目标的最有效途径。原因很简单-虽然我们支持一个多样化的国际生态系统，但我们的大部分增长已经发生在欧洲。Eclipse基金会拥有170个我们的成员组织和900多个总部设在欧洲的提交者，按照这些标准和其他标准，它已经是欧洲最大的开源组织。\n这就把我带到了今天的公告。通过创建Eclipse Foundation Aisbl，这是一个总部设在布鲁塞尔的国际非营利性协会，我们正在推动Eclipse基金会成为一个全球性机构的愿景，该机构建立在我们现有的会员基础、活跃的开发人员社区和牢固的机构关系基础上，以实现开放软件创新的自由流动。我们相信，我们向欧洲的过渡将有助于实现这一目标，使世界各地的行业和开发人员社区受益。\n同时，我们将建立一个基于GitLab的现代开源项目开发熔炉，并实际托管在欧洲。我们预计锻造厂将于今年夏天投入运营。这将为我们的项目和提交者提供第三种选择，用于他们的开发锻造。\nEclipse和Eclipse Foundation的名称、商标和品牌将由新的比利时实体控制，反垄断和知识产权等核心政策也将受到控制。展望未来，我们的会费将以欧元计价。\nEclipse基金会，虽然目前是美国注册的非盈利组织，但已经在加拿大和欧洲管理其业务，因此对基金会的业务影响很小，甚至没有影响。\n那么，这一举动对我们的会员意味着什么呢？对于我们的企业成员来说，不会立即发生变化。我们的项目和工作组将继续按原样运营。*一旦我们的比利时实体启动并运营，我们将与您联系，提供更多细节，但希望您与基金会的合作在很大程度上保持不变。\n对于我们的委员会成员，以及我们的项目提交人和贡献者，这一信息是双重的。首先，感谢你们的承诺和参与。第二，继续做你正在做的事情。在短期内，Eclipse项目的提交者和贡献者将“一切照旧”。从中期来看，我们将在欧洲建立一个新的基于GitLab的锻造厂，它将作为任何想要使用它的项目的选择。\n而且，至关重要的是，由于这是这一举措的主要驱动力，随着我们扩大在欧洲的存在，我们预计我们的全球社区成员将有新的机会参与创新的新开源项目。\n点击此处阅读公告全文。有关Eclipse基金会的计划以及感兴趣的各方如何参与的其他资源和信息，请访问eclipse.org/Europe。资源包括：\n一份阐述Eclipse基金会在欧洲开源创新中心的角色：通过全球开源协作在欧洲实现数字化转型的白皮书。\n我希望这有助澄清我们的动机，以及下一个令人兴奋的社区扩展阶段的未来路向。在接下来的几周里，随着我们迅速执行这些计划，更多的细节将随之而来，但如果您在此期间有任何问题，请随时联系我，或通过eclipse-Europe@eclipse.org联系我们的团队。\n我期待着这激动人心的新篇章的到来-谢谢您的持续支持！", "note_en": "Today we are announcing that the Eclipse Foundation is transitioning itself to become a European-based organization, specifically a Belgian international nonprofit association. I wanted to take this opportunity to share with you our plans for the transition and what the announcement means to our community.\n Let’s begin with some context. The first quarter of 2020 was the most successful in our organization’s history, as measured by the addition of 40 new member companies, five new working groups, and 11 new project proposals. Over the last few years, our community has expanded to create new projects in technology areas such as cloud and edge applications, IoT, artificial intelligence, digital ledger technologies, open processor designs, and many others. Combined with our roots in Java, tooling and rich client platforms, and modeling, this has made Eclipse Foundation the home of an incredibly diverse range of exciting, commercially-focused open source technologies.\n Our goal is to continue this growth and diversification, and to continue to establish the Eclipse Foundation as an institution enabling global open collaboration and innovation. We believe that this strategy makes the Foundation, and by extension your investments in our open source projects, more secure and sustainable.\n We believe this “move to Europe” is the most effective way for us to achieve this goal.   The reason is straightforward – while we support a diverse, international ecosystem, most of our growth has already been happening in Europe. With 170 of our member organizations and more than 900 of our committers based in Europe, the Eclipse Foundation is, by those measures and others, already the largest open source organization in Europe.\n Which brings me to today’s announcement. By creating the Eclipse Foundation AISBL, an international non-profit association based in Brussels, we are furthering our vision of the Eclipse Foundation as a global institution that builds on our existing membership base, active developer community, and strong institutional relationships to enable the free flow of open software innovation. We believe that our transition to Europe will help to advance toward this goal, for the benefit of industries and developer communities worldwide.\n  In parallel, we will establish a modern open source project development forge based on GitLab and physically hosted in Europe. We expect the forge to be operational this summer. This will provide our projects and committers a third option for their development forge.\n The Eclipse and Eclipse Foundation names, trademarks, and brands will be controlled by the new Belgian entity, as will the core policies such as antitrust and intellectual property. Going forward our membership dues will be stated in euros.\n The Eclipse Foundation, while currently a USA incorporated not-for-profit organization, already manages its operations split between Canada and Europe, so there will be minimal to no impact to the Foundation’s operations.\n So, what does this move mean for our members? For our corporate members, there is no immediate change.  Our projects and working groups will continue operating exactly as they are.  Once we have the Belgian entity up and operating, we will reach out to you with more details, but do expect your engagement with the Foundation to remain largely unchanged.\n To our Committer members, as well as our project committers and contributors, the message is two-fold. First, thank you for your commitment and participation. Second, keep doing what you’re doing. In the near-term, it will be “business as usual” for committers and contributors of Eclipse projects. In the medium term, we are standing up a new GitLab-based forge physically hosted in Europe that will be available as a choice for any projects that would like to use it.\n And, critically important as it is the main driver for the move, as we expand our presence in Europe, we anticipate new opportunities for our global community members to participate in innovative new open source projects.\n Read the full text of the announcement  here. Additional resources and information on the Eclipse Foundation’s plans and how interested parties can get involved at  eclipse.org/europe. Resources include:\n A white paper elaborating on the Eclipse Foundation’s role at the center of European open source innovation:  Enabling Digital Transformation in Europe Through Global Open Source Collaboration\n I hope that this has helped clarify our motivations and the way forward for the next exciting phase of our community’s expansion. More details will follow over the coming weeks as we quickly execute on these plans, but if you have questions in the interim, feel free to reach out to me, or to our team at  eclipse-europe@eclipse.org.\n I look forward to this exciting next chapter together – thank you for your continued support!", "posttime": "2020-05-13 15:47:13", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "eclipse,foundation,欧洲", "title": "Eclipse基金会即将迁往欧洲", "title_en": "The Eclipse Foundation Is Moving to Europe", "transed": 1, "url": "https://eclipse-foundation.blog/2020/05/12/moving-to-europe/", "via": "", "real_tags": ["eclipse", "欧洲"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001942, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "2013年玛丽莎·梅耶尔在雅虎2020禁止在家工作杰克·多尔西在Twitter将在家工作永久制度化。\n从学术界到开放源码运动，远程协作并不是什么新鲜事。从Github到DuckDuckGo，远程优先成功的企业不再少见。\n远程工作占据了那些神童做的事情的文化相关性，他们在泰国的海滩上工作。直到今天。\n惯性。我有一份工作和一套对我“有效”的制度。不要改变没有损坏的东西。\n状况。我在一家“真正的公司”有一份“真正的工作”。远程工作是怪胎和孤独者的专利。\n生产力。真正的决定发生在去吃午饭的路上的电梯里。我们知道如何身临其境地高效创新。见鬼，你是怎么远程组建团队的？\n冠状病毒解决了惰性问题。推特，一家合法的科技公司™️，解决了状态问题。生产率仍然相当参差不齐，但现在还为时尚早。\n我大学毕业后就像飞蛾一样来到旧金山湾区。\n由于没有H-1B，我于2014年离开，创办了黑客天堂(Hacker Paradise)，这是一家面向远程员工的精品旅游企业。在那段时间里，我作为一个SF客户的软件工程师远程工作了一年多。\n2016年，我回到了旧金山。我这么做的原因和我一开始来的原因一样--工作和社区的质量。\n我不喜欢远程工作。我怀念从良好的办公环境中获得的活力。冠状病毒告诉我，我是一个外向的人，而原地避难所很糟糕。\n现实是，当你不再相信它时，它不会消失。\n1.远程工作对旧金山的影响，就像旧金山对南湾的影响一样。\n十多年来，技术人员一直在离开旧金山前往波特兰、奥斯汀、丹佛和西雅图等城市。我们寻求一个安身立命的地方，提高生活成本与生活质量的比率。\n随着搬家期间保住工作变得比以往任何时候都容易，这一趋势将会抬头。推特的小厨房很不错，但不是“每月额外2000美元的房租”。\n当雄心勃勃的千禧一代意识到他们可以优化生活质量时，期待Culdesac和Hacker Paradise(参见我在那里做的事情)这样的企业会蓬勃发展。\n旧金山既不会很快被抛弃，也不会被完全抛弃。它将保留“荣休城市”的地位，就像伦敦、费城或帕洛阿尔托一样。\n公平地说，我们甚至不擅长正常的公司建设。我们刚刚发现1：1是个好主意，并且仍在决定矩阵组织结构中谁给谁虚线。\n你不能只是在你的工作页面上打上“远程友好”的一巴掌，然后就认定你做了一份“非常棒的工作”。\n团队规模应该改变吗？如何衡量和管理士气？入职和知识共享怎么样？\n从大本营的人们那里可以学到一些知识；他们写了一本关于远程工作的书。那本书是远程工作的COBOL语言；它是有效的，但我们可以做得更好。\nSack在冠状病毒期间做得非常好，但还是有点糟糕，对吧？至少当人们给你发电子邮件时，他们并不指望马上回复。关于松弛用法的礼仪还很不成熟，我说的对吗？@channel？\n还有.。软件工程师使用Github，这是一种非常成熟的共享工作协作方式。所有其他行业仍在发送演示文稿期末决赛.pdf。我最喜欢的一些前同事正在这个领域建立公司。期待更多像Figma和Loom这样的企业蓬勃发展。\n我们倾向于高估一项技术在短期内的效果，而低估其长期效果。\n向远程作为主流选项的转变将需要很好的十年或二十年的时间。然而，拐点出现在2020年5月12日的今天。\n作为一个人，我期待着孩子们问我每天不得不离开去工作是什么感觉。", "note_en": "2013 Marissa Mayer  bans work-from-home at Yahoo   2020 Jack Dorsey  permanently institutionalizes work-from-home at Twitter.\n   From academia to the Open Source movement, remote collaboration is not exactly novel. From Github to DuckDuckGo, remote-first successful businesses are no longer rare.\n Remote work occupied the cultural relevance of  something those whiz kids do, working on a beach in Thailand. Until today.\n   Inertia. I have a job and a system that “works” for me. Don’t change what isn’t broken.\n  Status. I have a “real job” at a “real company.” Working remote is for weirdos and loners.\n  Productivity. Real decisions happen in elevators on the way to lunch. We know how to be efficient and innovative in-person. How the hell do you build a team remotely?\n COVID-19 addressed  inertia. Twitter, a Legitimate Tech Company™️, addressed  status. Productivity is still pretty hit-or-miss, but it’s early days yet.\n  I came to the Bay Area like a moth to the flame of start-ups after college.\n Lacking an H-1B, I left in 2014, and started  Hacker Paradise, a boutique travel business catered to remote workers. During that time, I worked remotely as a software engineer for  an SF client for over a year.\n In 2016, I came back to San Francisco. I did it for the same reason I came in the first place - the quality of the jobs and the community.\n I don’t love working remotely. I miss the energy I get from a well-run office environment. COVID-19 has taught me that I’m an extrovert, and shelter-in-place has sucked.\n  Reality is that which, when you stop believing in it, doesn’t go away\n  1. Remote work is about to do to San Francisco what San Francisco did to the South Bay.\n Techies have been leaving San Francisco for cities like Portland, Austin, Denver and Seattle (PADS) for over a decade. We seek a place to settle down and improve cost-to-quality-of-life ratio.\n  As it becomes easier than ever to keep your job while moving, this trend will pick up. The microkitchens at Twitter are nice, but not “an extra $2k/mo in rent” nice.\n As ambitious millennials realize they can optimize for quality of life, expect businesses like Culdesac and Hacker Paradise (see what I did there) to blossom.\n San Francisco will neither be abandoned quickly nor completely. It’ll retain a “city emeritus” status, like London, Philadelphia or Palo Alto.\n   In fairness, we’re not even that good at regular company building. We just figured out 1:1s were a good idea and are still deciding who dotted-lines to whom in the matrix org structure.\n You can’t just slap “remote friendly” on your jobs page and decide you’ve done a “heck of a job.”\n  Should team sizes change? How to you measure and manage morale? What about onboarding and knowledge sharing?\n There’s some knowledge to be gleaned from the Basecamp folks; they  wrote a book about remote work. That book is the COBOL of remote work; it works, but we can do better.\n  Slack is  doing phenomenally well during COVID-19, but it still kind of sucks, right? At least when people emailed you, they didn’t expect a response right away. Etiquette around Slack usage is still pretty immature, am I right  @channel?\n Also. Software engineers use Github, and it’s a pretty mature way to collaborate on shared work. Every other industry is still sending around  Presentation Final Final [2].pdf. Some of my favorite former co-workers are building companies in this space. expect more businesses like Figma and Loom to blossom.\n   We tend to overestimate the effect of a technology in the short run and underestimate the effect in the long run\n The move to remote-as-mainstream-option will take a good decade or two. The inflection point, however, was today, on May 12, 2020.\n I for one look forward to kids asking what it was like when I had to  leave for work  every day.", "posttime": "2020-05-13 15:32:34", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "办公,remotely", "title": "远程办公今天“跨越鸿沟”", "title_en": "Working remotely “Crossed the Chasm” today", "transed": 1, "url": "http://alexeymk.com/2020/05/12/working-remotely-crossed-the-chasm-on-may-12-2C-2020.html", "via": "", "real_tags": ["办公", "remotely"]}, {"category": "", "categoryclass": "", "imagename": "6a39d4caa807eae64cd04abd7e816b00.jpeg", "infoid": 1001941, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "此软件包需要Reaction&gt；15.5.0。如果要使用较低版本，请使用此原始存储库。\n从#39；REACT；REACT；IMPORT ParallaxView；IMPORT&#39；REACT-NATIVE-PARALLAX-HEADER-VIEW；IMPORT{StyleSheet，ScrollView，View，Text}从&#39；REACT-NATIVE&#39；IMPORT{LearnMoreLinks，Colors，DebugInstructions，ReloadInstructions，}从&#39；REACT-NATIVE/Libraries/NewAppScreen&#39；导入{LearnMoreLinks，Colors，DebugInstructions，ReloadInstructions，}。{常量背景Style={不透明度：0.2，溢出：&#39；可见&#39；，大小模式：&#39；封面&#39；，边框左：-128，边沿底部：-192，}；常量标题Style={fontSize：40，fontWeight：&#39；600&#39；，textAlign：&#39；center&#39；，paddingTop：80，color：Colors。Black，}；return(&lt；ParallaxView backargSource={Required(&#39；./logo.png&#39；)}windowHeight={250}backackStyle={backargStyle}headerStyle={headerStyle}Header={&lt；Text Style={headerStyle}&gt；欢迎回应&lt；/text&gt；}&gt；&lt；查看&gt；&lt。scllView}&gt；&lt；视图样式={样式。正文}&gt；&lt；视图样式={样式。sectionContainer}&gt；&lt；text style={样式。sectionTitle}&gt；第一步&lt；/text&gt；&lt；text style={样式。sectionDescription}&gt；编辑&lt；文本样式={样式。突出显示}&gt；App.js&lt；/text&gt；更改此屏幕，然后返回查看您所做的编辑。&lt；/text&gt；&lt；/View&gt；&lt；View style={样式。sectionContainer}&gt；&lt；text style={样式。sectionTitle}&gt；查看您的更改&lt；/text&gt；&lt；text style={样式。sectionDescription}&gt；&lt；重新加载说明/&gt；&lt；/text&gt；&lt；/View&gt；&lt；View style={样式。sectionContainer}&gt；&lt；text style={样式。sectionTitle}&gt；调试&lt；/text&gt；&lt；文本样式={样式。sectionDescription}&gt；&lt；DebugInstructions/&gt；&lt；/text&gt；&lt；/View&gt；&lt；View style={样式。sectionContainer}&gt；&lt；text style={样式。sectionTitle}&gt；了解更多&lt；/text&gt；&lt；text style={样式。sectionDescription}&gt；阅读文档以了解下一步要做什么：&lt；/text&gt；&lt；/View&gt；&lt；&lt；LearnMoreLinks/&gt；&lt；/View&gt；&lt；/ScrollView&gt；&lt；/View&gt；&lt；/ParallaxView&gt；)；}；Const Style=StyleSheet。创建({scllView：{background Color：Colors。较浅，}，正文：{background Color：Colors。白色，}，sectionContainer：{kernTop：32，paddingHorizbian：24，}，sectionTitle：{fontSize：24，fontWeight：&#39；600&39；，color：Colors。Black，}，sectionDescription：{armTop：8，fontSize：18，fontWeight：&#39；400&#39；，color：Colors。暗，}，高亮显示：{fontWeight：&#39；700&#39；，}，})；导出默认应用；\n将获取传递到后台图像组件的源属性。如果保留为空，则不呈现任何背景。\n要在图像顶部渲染的任何内容。当滚动视图向上滚动时，此内容的不透明度向下动画。(可选)。\n标题图像的静止高度。如果传入0，则不渲染背景。\n此样式将与可滚动视图样式(在背景上滚动的视图)混合(覆盖现有字段)。\n{.this.props}应用于内部ScrollView(不包括传递到外部容器的样式道具)", "note_en": "this package requires  React &gt; 15.5.0.If you want to use a lower version, please use  this original repository\n  import  React  from   &#39;react &#39;; import  ParallaxView  from   &#39;react-native-parallax-header-view &#39;; import { StyleSheet,  ScrollView,  View,  Text}  from   &#39;react-native &#39;; import {  LearnMoreLinks,  Colors,  DebugInstructions,  ReloadInstructions,}  from   &#39;react-native/Libraries/NewAppScreen &#39;; const   App: ()  =&gt;  React$Node  = ()  =&gt; {  const  backgroundStyle  = {   opacity:  0.2,   overflow:   &#39;visible &#39;,   resizeMode:   &#39;cover &#39;,   marginLeft:  -128,   marginBottom:  -192, };  const  headerStyle  = {   fontSize:  40,   fontWeight:   &#39;600 &#39;,   textAlign:   &#39;center &#39;,   paddingTop:  80,   color:  Colors . black, };  return ( &lt; ParallaxView  backgroundSource = { require(  &#39;./logo.png &#39;) }  windowHeight = { 250 }  backgroundStyle = { backgroundStyle }  headerStyle = { headerStyle }  header = {&lt; Text  style = { headerStyle }&gt;Welcome to React&lt;/ Text&gt; }&gt; &lt; View&gt; &lt; ScrollView  contentInsetAdjustmentBehavior =  &#34;automatic &#34;  style = {  styles . scrollView }&gt; &lt; View  style = {  styles . body }&gt; &lt; View  style = {  styles . sectionContainer }&gt; &lt; Text  style = {  styles . sectionTitle }&gt;Step One&lt;/ Text&gt; &lt; Text  style = {  styles . sectionDescription }&gt; Edit &lt; Text  style = {  styles . highlight }&gt;App.js&lt;/ Text&gt; to change this screen and then come back to see your edits. &lt;/ Text&gt; &lt;/ View&gt; &lt; View  style = {  styles . sectionContainer }&gt; &lt; Text  style = {  styles . sectionTitle }&gt;See Your Changes&lt;/ Text&gt; &lt; Text  style = {  styles . sectionDescription }&gt; &lt; ReloadInstructions /&gt; &lt;/ Text&gt; &lt;/ View&gt; &lt; View  style = {  styles . sectionContainer }&gt; &lt; Text  style = {  styles . sectionTitle }&gt;Debug&lt;/ Text&gt; &lt; Text  style = {  styles . sectionDescription }&gt; &lt; DebugInstructions /&gt; &lt;/ Text&gt; &lt;/ View&gt; &lt; View  style = {  styles . sectionContainer }&gt; &lt; Text  style = {  styles . sectionTitle }&gt;Learn More&lt;/ Text&gt; &lt; Text  style = {  styles . sectionDescription }&gt; Read the docs to discover what to do next: &lt;/ Text&gt; &lt;/ View&gt; &lt; LearnMoreLinks /&gt; &lt;/ View&gt; &lt;/ ScrollView&gt; &lt;/ View&gt; &lt;/ ParallaxView&gt; );}; const  styles  =  StyleSheet . create({   scrollView: {   backgroundColor:  Colors . lighter, },   body: {   backgroundColor:  Colors . white, },   sectionContainer: {   marginTop:  32,   paddingHorizontal:  24, },   sectionTitle: {   fontSize:  24,   fontWeight:   &#39;600 &#39;,   color:  Colors . black, },   sectionDescription: {   marginTop:  8,   fontSize:  18,   fontWeight:   &#39;400 &#39;,   color:  Colors . dark, },   highlight: {   fontWeight:   &#39;700 &#39;, },}); export  default  App;\n  the  source prop that get&#39;s passed to the background  &lt;Image&gt; component. If left blank, no background is rendered\n any content you want to render on top of the image. This content&#39;s opacity get&#39;s animated down as the scrollview scrolls up. (optional)\n the resting height of the header image. If 0 is passed in, the background is not rendered.\n this style will be mixed (overriding existing fields) with scrollable view style (view which is scrolled over the background)\n {...this.props} is applied on the internal  ScrollView (excluding the  style prop which is passed on to the outer container)", "posttime": "2020-05-13 15:32:07", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "反应,react,gt", "title": "灵活的原生反应视差视图，无依赖关系", "title_en": "Flexible react-native-parallax-view with no dependencies", "transed": 1, "url": "https://github.com/100010/react-native-parallax-header-view", "via": "", "real_tags": ["反应", "react", "gt"]}, {"category": "", "categoryclass": "", "imagename": "1593db81dd327e5d9136337de757879b.jpg", "infoid": 1001940, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "这是彗星用它们华丽的尾巴戏弄天文爱好者的季节。今年早些时候，阿特拉斯彗星在解体和失败之前似乎是一件大事。但就在那个充满希望的太空雪球即将解体之际，C/2020 F8天鹅彗星在3月下旬被发现。\n现在，天鹅彗星可以兑现阿特拉斯未能提供的罕见夜空表演的承诺。天鹅已经可以被那些拥有精致黑暗天空和锐利眼睛的人看到了。其他人或许也能用双筒望远镜发现它。\n天文学家康斯托伊特斯说，一些预测显示，这颗彗星在未来几天将继续变亮。他在推特上说，5月中旬，这颗彗星应该是一个显而易见的肉眼目标。\n这颗彗星在5月13日经过地球，5月27日距离太阳最近。\n网上有很多工具--TheSkyLive是一个很好的起点--可以帮助你在夜空中找到天鹅彗星。当然，这颗彗星也有一个值得关注的Twitter账号。\n请记住，正如阿特拉斯彗星所展示的那样，彗星是出了名的反复无常，而天鹅也可能在任何时候从迅速变亮到碎裂和褪色。\n考虑到这一点，现在试着抓住它可能是个好主意。你可以一边寻找它，一边观看本周的埃塔·阿夸里德流星雨，这场流星雨来自另一个太空雪球--著名的哈雷彗星--的残余物。\n尊重他人，保持文明礼貌，不离题。我们删除违反我们政策的评论，我们鼓励您阅读这些评论。我们可以随时关闭讨论线程。", "note_en": "It&#39;s looking to be a season for comets teasing skywatchers with their magnificent tails.   Comet Atlas seemed to be a big deal earlier this year before it broke up and fizzled out. But just as that promising space snowball was cracking up,   Comet C/2020 F8 Swan was discovered in late March.\n Now Comet Swan could deliver on the promise of a rare night sky show that Atlas failed to provide. Already, Swan could be visible to those with exquisitely dark skies and sharp eyes. Others might also be able to spot it with binoculars.\n Astronomer  Con Stoitsis said some predictions show the comet continuing to brighten in the coming days.&#34;It should be an &#39;obvious&#39; naked eye target in mid-May,&#34; he said on Twitter.\n  The comet makes its closest pass by Earth on May 13 and comes nearest to the sun on May 27.\n There&#39;re a number of tools online --  TheSkyLive is a great place to start -- to help you find Comet Swan in the night sky. And, of course, the  comet also has a Twitter account worth following.\n  Keep in mind that comets are notoriously fickle, as Comet Atlas demonstrated, and Swan could also go from rapidly brightening to fragmenting and fading at any moment.\n With that in mind, it&#39;s probably a good idea to try and catch it now. You can look for it while also watching for this week&#39;s   Eta Aquarid meteor shower, which comes from the leftovers of another space snowball, the famed Halley&#39;s Comet.\n  Be respectful, keep it civil and stay on topic. We delete comments that violate  our policy, which we encourage you to read. Discussion threads can be closed at any time at our discretion.", "posttime": "2020-05-13 15:03:50", "source_domain": "slashdot.org", "source_name": "slashdot", "tags": "天鹅,swan,彗星", "title": "今夜天鹅彗星肉眼可见并经过地球", "title_en": "Comet Swan Is Visible To the Naked Eye and Passing By Earth Tonight", "transed": 1, "url": "https://www.cnet.com/news/comet-swan-is-visible-to-the-naked-eye-and-passing-by-earth-tonight/", "via": "", "real_tags": ["天鹅", "swan", "彗星"]}, {"category": "", "categoryclass": "", "imagename": "d210626783f03e99269977a2a84ee350.png", "infoid": 1001939, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "当程序员讨论不同编程语言的相对优点时，他们经常用平淡无奇的术语谈论它们，就好像它们是工具带中的许多工具-一种可能更适合于系统编程，另一种可能更适合将其他程序粘合在一起来完成一些特别的任务。这就是它应该是的样子。语言有不同的优点，声称一种语言比其他语言更好，而不参考特定的用例，只会招致一场徒劳和尖刻的辩论。\n但有一种语言似乎激发了一种特殊的普遍崇敬：LISP。键盘斗士本来会突然袭击任何敢于暗示某种语言比其他语言更好的人，但他们会承认Lisp达到了另一个水平。LISP超越了用来评判其他语言的实用标准，因为中等水平的程序员从未使用过Lisp来构建任何实用的东西，而且很可能永远也不会使用，但是人们对Lisp的崇敬如此深厚，以至于Lisp经常被归因于神秘的特性。每个人都喜欢的网络漫画，xkcd，至少两次这样描述Lisp：在一个经济学中，一个人物达到了某种李斯本启蒙，这似乎允许他理解宇宙的基本结构。在另一幅漫画中，一位身着长袍、年迈的程序员把一叠括号递给他的徒弟，说这些括号是“更文明时代的优雅武器”，暗示Lisp拥有原力的所有神秘力量。\n另一个很好的例子是鲍勃·卡纳夫斯基(Bob Kanefsky)对阿松的恶搞，名为“上帝住在Terra”。他的恶搞写于20世纪90年代中期，名为“永恒的火焰”，描述了上帝一定是如何用Lisp创造了世界。以下是摘录，但全套歌词可以在GNU Humor Collection中找到：\n因为上帝用Lisp代码写道，当他用绿色填满树叶时。分形的花朵和递归的根：这是我见过的最可爱的黑客。当我沉思着雪花，从来没有找到两片相同的雪花时，我知道上帝喜欢一种有自己四个字母名字的语言。\n我想我只能说我自己，但我认为这个“Lisp是神秘的魔术”的文化迷因是有史以来最离奇和迷人的事情。LISP是在象牙塔里炮制出来的，作为人工智能研究的工具，所以对编程人员来说，它总是很陌生，甚至可能有点神秘。但是程序员们现在互相鼓励对方“在死前尝试一下Lisp”，就好像它是某种扩张性的迷幻剂一样。尽管Lisp现在是被广泛使用的第二种最古老的编程语言，仅比Fortran年轻，但他们还是这么做了，而且只比Fortran年轻一年。1想象一下，如果你的工作是代表创建它的组织或团队推广某种新的编程语言。如果你能让每个人相信你的新语言具有神圣的力量，那不是很棒吗？但你要怎么做呢？编程语言是如何被称为隐藏知识的字体的呢？\nLisp的创建者约翰·麦卡锡(John McCarthy)最初并不打算让Lisp成为计算原理的优雅升华。但是，经过一两次幸运的洞察和一系列的改进，Lisp就变成了这样。保罗·格雷厄姆(稍后我们将进一步讨论他)写道，在Lisp中，麦卡锡“在编程方面所做的工作就像欧几里德在几何学上所做的那样”。2人们可能会在Lisp中看到更深层次的含义，因为麦卡锡是从如此基础的部件中构建Lisp的，以至于很难说是他发明了Lisp还是发现了Lisp。\n麦卡锡在1956年的人工智能达斯茅斯夏季研究项目中开始考虑创造一种语言。夏季研究项目实际上是一场持续数周的学术会议，是人工智能领域的第一次。麦卡锡当时是达特茅斯大学的数学助理教授，当他提出这项活动时，实际上已经创造了“人工智能”这个术语。在整个会议期间，大约有十个人参加了会议。其中包括艾伦·纽威尔(Allen Newell)和赫伯特·西蒙(Herbert Simon)，他们是兰德公司(RAND Corporation)和卡内基梅隆大学(Carnegie Mellon)的两名研究人员，他们刚刚设计了一种名为。\n纽威尔和西蒙一直试图建立一个能够在命题演算中生成证明的系统。他们意识到在计算机本地指令集级别上工作时很难做到这一点，所以他们决定创造一种语言--或者他们所说的“伪代码”--来帮助他们更自然地表达他们的“逻辑理论机器”的工作。5他们的语言被称为IPL，意思是“信息处理语言”，它更像是一种高级汇编语言，而不是我们今天所说的编程语言。纽威尔和西蒙可能指的是Fortran，他们注意到当时正在开发的其他“伪代码”“全神贯注”于用标准数学符号表示方程式。他们的语言侧重于将命题演算中的句子表示为列表\n麦卡锡认为，用Fortran风格的语言编写代数表达式会很有用。所以他不太喜欢IPL。但他认为符号列表是模拟人工智能问题的好方法，特别是涉及演绎的问题。这就是麦卡锡希望创建一种代数列表处理语言的萌芽，这种语言类似于Fortran，但也能够处理像IPL这样的符号列表。\n当然，今天的Lisp不像Fortran。在接下来的几年里，麦卡锡关于理想的列表处理语言应该是什么样子的想法逐渐发展起来。1957年，当他开始用Fortran编写下棋程序的例程时，他的想法开始改变。长期接触Fortran让麦卡锡相信它的设计有几个不恰当之处，主要是尴尬的if语句。麦卡锡发明了另一种选择，“真”条件表达式，如果所提供的测试成功，它返回子表达式A，如果提供的测试失败，返回子表达式B，它也只计算实际返回的子表达式。1958年夏天，当麦卡锡致力于设计一个可以执行微分的程序时，他意识到他的“真”条件表达式使编写递归函数变得更容易、更自然。微分问题还促使McCarthy设计了Maplist函数，该函数将另一个函数作为参数，并将其应用于列表中的所有元素。10这对于区分任意多项的和很有用。\n所有这些都不能用Fortran来表达，所以，在1958年秋天，McCarthy让一些学生去实现Lisp。因为麦卡锡现在是麻省理工学院的助理教授，所以这些人都是麻省理工学院的学生。当麦卡锡和他的学生将他的想法转化为运行代码时，他们做出了进一步简化语言的改变。最大的变化涉及到Lisp的语法。麦卡锡原本打算让这门语言包含一种叫做“M-Expression”的东西，这将是一层语法糖，使Lisp的语法类似于Fortran。虽然M-Expression可以被翻译成s-Expression-Lisp以圆括号括起来的基本列表-S-Expression实际上是机器的低级表示。唯一的问题是麦卡锡一直使用方括号来表示M表达式，而麦卡锡团队在麻省理工学院使用的IBM026键盘上没有任何方括号按键。11所以Lisp团队坚持使用s表达式，不仅使用它们来表示数据列表，而且还使用它们来表示函数应用程序。麦卡锡和他的学生还做了其他一些简化，包括切换到前缀记法和记忆模型的改变，这意味着这种语言只有一种真正的类型。12个。\n1960年，McCarthy发表了他关于Lisp的著名论文，名为“符号表达式的递归函数及其机器计算”(RecursiveFunctions Of Symbol Expression And They Computation By Machine)。到那时，这门语言已经缩减到如此程度，以至于麦卡锡意识到他具备了“一个优雅的数学系统”的素质，而不仅仅是另一种编程语言。13他后来写道，对Lisp所做的许多简化使其“变成了一种比图灵机或递归函数理论中使用的一般递归定义更简洁地描述可计算函数的方式”。14因此，在他的论文中，他将Lisp既作为一种可工作的编程语言，又作为研究递归函数行为的形式主义。\n麦卡锡向他的读者解释了Lisp，他只用一小部分规则构建了Lisp。保罗·格雷厄姆后来在他的文章“Lisp的根源”中使用了更易读的语言，追随了麦卡锡的脚步。Graham仅使用7个基元运算符、两种不同的函数符号和6个根据基元运算符定义的高级函数就可以解释Lisp。Lisp可以用这么小的一系列基本规则来指定，这无疑是它的神秘性所在。Graham称McCarthy的论文是试图“公理化计算”。15我认为这是一个很好的思考Lisp吸引力的方式。虽然其他语言有明显的人工构造，由预留字(如while、tyecif或public static void)表示，但Lisp的设计似乎几乎是由计算逻辑决定的。这种特性和Lisp与深奥的“递归函数理论”这一领域的原始联系应该使Lisp在今天享有如此高的声望也就不足为奇了。\n根据著名的黑客词典，Lisp在创建20年后，已经成为人工智能研究的“母语”。早些时候，Lisp传播很快，可能是因为它的规则语法使得在新机器上实现它相对简单。后来，研究人员会继续使用它，因为它处理符号表达式的能力很好，这在一个人工智能如此之多是象征性的时代很重要。使用了LISP\n结果，Symbolics机器贵得离谱。1983年，Symbolics 3600的价格为11万美元。16所以大多数人只能从远处惊叹Lisp机器的威力和Lisp编写操作员的魔力。但令人惊叹的是他们做到了。Byte Magazine从1979年到20世纪80年代末几次以Lisp和Lisp机器为特色。在1979年8月的一期Lisp专刊中，该杂志的编辑盛赞麻省理工学院正在开发的具有“海量内存”和“先进操作系统”的新机器。他认为这些机器听起来非常有前途，相比之下，前两年--苹果II、准将PET和TRS-80的发布--会显得乏味。五年后，也就是1985年，一家字节杂志撰文描述了为“复杂、超级强大的符号3670”编写Lisp程序，并敦促他的观众学习Lisp，声称它既是“大多数人工智能工作人员的首选语言”，也很快就会成为一种通用编程语言。18岁。\n我问保罗·麦克琼斯(Paul McJones)，他为山景城的计算机历史博物馆(ComputerHistory Museum)做了大量的Lisp保护工作，关于人们什么时候开始谈论Lisp的，就好像它是来自更高维度的生物的礼物一样。他说，语言的固有属性无疑与此有很大关系，但他也表示，Lisp与20世纪60年代和70年代强大的人工智能应用程序之间的密切联系可能也起到了作用。当Lisp机器在20世纪80年代开始可供购买时，更多的人在麻省理工学院和斯坦福等地以外的地方接触到了Lisp的强大功能，这一趋势也随之发展起来。今天，Lisp机器和符号已鲜为人知，但它们使Lisp的神秘感一直延续到20世纪80年代末。\n1985年，麻省理工学院教授哈罗德·阿贝尔森和杰拉尔德·萨斯曼与萨斯曼的妻子朱莉·萨斯曼一起出版了一本名为“计算机程序的结构与解释”的教科书。这本教科书向读者介绍了使用Lisp方言“语言方案”进行编程。它被用来教授麻省理工学院的入门编程课程长达20年之久。我的预感是，SICP(标题通常缩写)大约是Lisp的“神秘感因素”的两倍。SICP以Lispand为例展示了如何用它来说明计算机编程艺术中深刻的、近乎哲学的概念。这些概念很普遍，任何语言都可以使用，但SiCp的作者选择了Lisp。因此，Lisp的声誉因这本奇特而精彩的书而声名狼藉，这本书吸引了一代又一代的程序员(也成为了一个非常奇怪的人)。Lisp一直是“麦卡锡优雅的形式主义”；现在也是“那种教你编程秘密的语言”。\n值得花点时间思考SICP到底有多奇怪，因为我认为这本书的怪诞和Lisp的怪诞在今天被混为一谈了。奇怪之处在于这本书的封面。它描绘了一个巫师或炼金术士走近桌子，准备进行某种巫术。他一只手拿着一套卡尺或指南针，另一只手拿着刻有“评估”和“申请”两个字的地球仪。他对面的一个女人在桌子旁做着手势；在背景中，希腊字母lambda漂浮在半空中，散发着光芒。\n老实说，这是怎么回事？为什么桌子上有动物的脚？为什么那个女人在桌子旁打手势？墨水池的意义是什么？我们是否应该得出这样的结论：巫师已经解开了宇宙中隐藏的奥秘，而这些奥秘是由“求值/应用”循环和兰姆达微积分组成的？看起来是这样。单是这张图片一定在很大程度上影响了今天人们谈论Lisp的方式。\n但这本书本身的文字往往也同样怪异。SICP与你读过的大多数其他计算机科学教科书不同。该书的作者在该书的前言中解释说，这本书不仅仅是关于如何用Lisp语言编程的，相反，它是关于“三个现象的焦点：人类的头脑，计算机程序的集合和计算机”。19后来，他们详细阐述了自己的信念，即编程不应该被视为计算机科学的一门学科，而应该被视为“程序认识论”的一种新符号。20个程序是一种新的思维结构方式，只是偶然地输入到计算机中。这本书的第一章简要介绍了Lisp，但之后的大部分内容都是关于更抽象的概念。文中讨论了不同的编程范例，讨论了面向对象系统中“时间”和“同一性”的本质，并一度讨论了同步问题是如何由于通信的基本限制而产生的，这些基本限制的作用类似于相对论中的固定光速。这是令人兴奋的事情。\n所有这一切并不是说这本书不好。这是一本很棒的书。它讨论了重要的编程c++。\n在SiCp发布的同一年，Bjarne Stroustrup发布了C++编程语言的第一版，它将面向对象的编程带给了大众。几年后，Lisp机器市场崩溃，人工智能冬天开始了。在接下来的十年和变化中，C++和Java将成为未来的语言，而Lisp将被排除在外。\n当然，要准确地指出人们何时开始对Lisp再次感到兴奋是不可能的。但这可能是在Y-Combinator联合创始人兼黑客新闻创建者保罗·格雷厄姆(Paul Graham)发表了一系列有影响力的文章spushin之后发生的。\n..", "note_en": "When programmers discuss the relative merits of different programminglanguages, they often talk about them in prosaic terms as if they were so manytools in a tool belt—one might be more appropriate for systems programming,another might be more appropriate for gluing together other programs toaccomplish some ad hoc task. This is as it should be. Languages have differentstrengths and claiming that a language is better than other languages withoutreference to a specific use case only invites an unproductive and vitriolicdebate.\n But there is one language that seems to inspire a peculiar universal reverence:Lisp. Keyboard crusaders that would otherwise pounce on anyone daring tosuggest that some language is better than any other will concede that Lisp ison another level. Lisp transcends the utilitarian criteria used to judge otherlanguages, because the median programmer has never used Lisp to build anythingpractical and probably never will, yet the reverence for Lisp runs so deep thatLisp is often ascribed mystical properties. Everyone’s favorite webcomic, xkcd, has depicted Lisp this way at least twice: In  onecomic, a character reaches some sort of Lispenlightenment, which appears to allow him to comprehend the fundamentalstructure of the universe. In  another comic, a robed,senescent programmer hands a stack of parentheses to his padawan, saying thatthe parentheses are “elegant weapons for a more civilized age,” suggesting thatLisp has all the occult power of the Force.\n Another great example is Bob Kanefsky’s parody of asong called “God Lives on Terra.” His parody, written in the mid-1990s andcalled “Eternal Flame”, describes how God must have created the world usingLisp. The following is an excerpt, but the full set of lyrics can be found inthe  GNU HumorCollection:\n For God wrote in Lisp code When he filled the leaves with green. The fractal flowers and recursive roots: The most lovely hack I’ve seen. And when I ponder snowflakes, never finding two the same, I know God likes a language with its own four-letter name.\n I can only speak for myself, I suppose, but I think this “Lisp Is Arcane Magic”cultural meme is the most bizarre and fascinating thing ever. Lisp wasconcocted in the ivory tower as a tool for artificial intelligence research, soit was always going to be unfamiliar and maybe even a bit mysterious to theprogramming laity. But programmers now  urge each other to “try Lisp before youdie”as if it were some kind of mind-expanding psychedelic. They do this even thoughLisp is now the second-oldest programming language in widespread use, youngeronly than Fortran, and even then by just one year.  1 Imagine if your job wereto promote some new programming language on behalf of the organization or teamthat created it. Wouldn’t it be great if you could convince everyone that yournew language had divine powers? But how would you even do that? How does aprogramming language come to be known as a font of hidden knowledge?\n    John McCarthy, Lisp’s creator, did not originally intend for Lisp to be anelegant distillation of the principles of computation. But, after one or twofortunate insights and a series of refinements, that’s what Lisp became. PaulGraham—we will talk about him some more later—has written that, with Lisp,McCarthy “did for programming something like what Euclid did for geometry.”  2People might see a deeper meaning in Lisp because McCarthy built Lisp out ofparts so fundamental that it is hard to say whether he invented it ordiscovered it.\n McCarthy began thinking about creating a language during the 1956 DarthmouthSummer Research Project on Artificial Intelligence. The Summer Research Projectwas in effect an ongoing, multi-week academic conference, the very first in thefield of artificial intelligence. McCarthy, then an assistant professor ofMathematics at Dartmouth, had actually coined the term “artificialintelligence” when he proposed the event.  3 About ten or so people attendedthe conference for its entire duration.  4 Among them were Allen Newell andHerbert Simon, two researchers affiliated with the RAND Corporation andCarnegie Mellon that had just designed a language called IPL.\n Newell and Simon had been trying to build a system capable of generating proofsin propositional calculus. They realized that it would be hard to do this whileworking at the level of the computer’s native instruction set, so they decidedto create a language—or, as they called it, a “pseudo-code”—that would helpthem more naturally express the workings of their “Logic Theory Machine.”  5Their language, called IPL for “Information Processing Language”, was more of ahigh-level assembly dialect then a programming language in the sense we meantoday. Newell and Simon, perhaps referring to Fortran, noted that other“pseudo-codes” then in development were “preoccupied” with representingequations in standard mathematical notation.  6 Their language focused insteadon representing sentences in propositional calculus as lists of symbolicexpressions. Programs in IPL would basically leverage a series ofassembly-language macros to manipulate and evaluate expressions within one ormore of these lists.\n McCarthy thought that having algebraic expressions in a language,Fortran-style, would be useful. So he didn’t like IPL very much.  7 But hethought that symbolic lists were a good way to model problems in artificialintelligence, particularly problems involving deduction. This was the germ ofMcCarthy’s desire to create an algebraic list processing language, a languagethat would resemble Fortran but also be able to process symbolic lists likeIPL.\n Of course, Lisp today does not resemble Fortran. Over the next few years,McCarthy’s ideas about what an ideal list processing language should look likeevolved. His ideas began to change in 1957, when he started writing routinesfor a chess-playing program in Fortran. The prolonged exposure to Fortranconvinced McCarthy that there were several infelicities in its design, chiefamong them the awkward  IF statement.  8 McCarthy invented an alternative,the “true” conditional expression, which returns sub-expression A if thesupplied test succeeds and sub-expression B if the supplied test fails andwhich  also only evaluates the sub-expression that actually gets returned.During the summer of 1958, when McCarthy worked to design a program that couldperform differentiation, he realized that his “true” conditional expressionmade writing recursive functions easier and more natural.  9 Thedifferentiation problem also prompted McCarthy to devise the  maplistfunction, which takes another function as an argument and applies it to all theelements in a list.  10 This was useful for differentiating sums ofarbitrarily many terms.\n None of these things could be expressed in Fortran, so, in the fall of 1958,McCarthy set some students to work implementing Lisp. Since McCarthy was now anassistant professor at MIT, these were all MIT students. As McCarthy and hisstudents translated his ideas into running code, they made changes that furthersimplified the language. The biggest change involved Lisp’s syntax. McCarthyhad originally intended for the language to include something called“M-expressions,” which would be a layer of syntactic sugar that made Lisp’ssyntax resemble Fortran’s. Though M-expressions could be translated toS-expressions—the basic lists enclosed by parentheses that Lisp is known for—S-expressions were really a low-level representation meant for the machine. Theonly problem was that McCarthy had been denoting M-expressions using squarebrackets, and the IBM 026 keypunch that McCarthy’s team used at MIT did nothave any square bracket keys on its keyboard.  11 So the Lisp team stuck withS-expressions, using them to represent not just lists of data but functionapplications too. McCarthy and his students also made a few othersimplifications, including a switch to prefix notation and a memory modelchange that meant the language only had one real type.  12\n In 1960, McCarthy published his famous paper on Lisp called “RecursiveFunctions of Symbolic Expressions and Their Computation by Machine.” By thattime, the language had been pared down to such a degree that McCarthy realizedhe had the makings of “an elegant mathematical system” and not just anotherprogramming language.  13 He later wrote that the many simplifications thathad been made to Lisp turned it “into a way of describing computable functionsmuch neater than the Turing machines or the general recursive definitions usedin recursive function theory.”  14 In his paper, he therefore presented Lispboth as a working programming language and as a formalism for studying thebehavior of recursive functions.\n McCarthy explained Lisp to his readers by building it up out of only a verysmall collection of rules. Paul Graham later retraced McCarthy’s steps, usingmore readable language, in his essay  “The Roots ofLisp”. Graham is able toexplain Lisp using only seven primitive operators, two different notations forfunctions, and a half-dozen higher-level functions defined in terms of theprimitive operators. That Lisp can be specified by such a small sequence ofbasic rules no doubt contributes to its mystique. Graham has called McCarthy’spaper an attempt to “axiomatize computation.”  15 I think that is a great wayto think about Lisp’s appeal. Whereas other languages have clearly artificialconstructs denoted by reserved words like  while or  typedef or  publicstatic void, Lisp’s design almost seems entailed by the very logic ofcomputing. This quality and Lisp’s original connection to a field as esotericas “recursive function theory” should make it no surprise that Lisp has so muchprestige today.\n  Two decades after its creation, Lisp had become, according to the famous  Hacker’s Dictionary, the “mothertongue” of artificial intelligence research. Early on, Lisp spread quickly,probably because its regular syntax made implementing it on new machinesrelatively straightforward. Later, researchers would keep using it because ofhow well it handled symbolic expressions, important in an era when so much ofartificial intelligence was symbolic. Lisp was used in seminal artificialintelligence projects like the  SHRDLU natural languageprogram, the  Macsyma algebrasystem, and the  ACL2 logicsystem.\n By the mid-1970s, though, artificial intelligence researchers were running outof computer power. The PDP-10, in particular—everyone’s favorite machine forartificial intelligence work—had an 18-bit address space that increasingly wasinsufficient for Lisp AI programs.  16 Many AI programs were also supposed tobe interactive, and making a demanding interactive program perform well on atime-sharing system was challenging. The solution, originally proposed by PeterDeutsch at MIT, was to engineer a computer specifically designed to run Lispprograms. These Lisp machines, as I described in  my last post on Chaosnet, would give each user a dedicatedprocessor optimized for Lisp. They would also eventually come with developmentenvironments written entirely in Lisp for hardcore Lisp programmers. Lispmachines, devised in an awkward moment at the tail of the minicomputer era butbefore the full flowering of the microcomputer revolution, werehigh-performance personal computers for the programming elite.\n For a while, it seemed as if Lisp machines would be the wave of the future.Several companies sprang into existence and raced to commercialize thetechnology. The most successful of these companies was called Symbolics,founded by veterans of the MIT AI Lab. Throughout the 1980s, Symbolics produceda line of computers known as the 3600 series, which were popular in the AIfield and in industries requiring high-powered computing. The 3600 seriescomputers featured large screens, bit-mapped graphics, a mouse interface, and powerful graphics and animation software.These were impressive machines that enabled impressive programs. For example,Bob Culley, who worked in robotics research and contacted me via Twitter, wasable to implement and visualize a path-finding algorithm on a Symbolics 3650 in 1985. He explained to me that bit-mapped graphics and object-orientedprogramming (available on Lisp machines via  the Flavorsextension) werevery new in the 1980s. Symbolics was the cutting edge.\n  As a result, Symbolics machines were outrageously expensive. The Symbolics 3600cost $110,000 in 1983.  16 So most people could only marvel at the power ofLisp machines and the wizardry of their Lisp-writing operators from afar. Butmarvel they did.  Byte Magazine featured Lisp and Lisp machines several timesfrom 1979 through to the end of the 1980s. In the August, 1979 issue, a specialon Lisp, the magazine’s editor raved about the new machines being developed atMIT with “gobs of memory” and “an advanced operating system.”  17 He thoughtthey sounded so promising that they would make the two prior years—which sawthe launch of the Apple II, the Commodore PET, and the TRS-80—look boring bycomparison. A half decade later, in 1985, a  Byte Magazine contributordescribed writing Lisp programs for the “sophisticated, superpowerful Symbolics3670” and urged his audience to learn Lisp, claiming it was both “the languageof choice for most people working in AI” and soon to be a general-purposeprogramming language as well.  18\n I asked Paul McJones, who has done lots of Lisp  preservationwork for the ComputerHistory Museum in Mountain View, about when people first began talking aboutLisp as if it were a gift from higher-dimensional beings. He said that theinherent properties of the language no doubt had a lot to do with it, but healso said that the close association between Lisp and the powerful artificialintelligence applications of the 1960s and 1970s probably contributed too. WhenLisp machines became available for purchase in the 1980s, a few more peopleoutside of places like MIT and Stanford were exposed to Lisp’s power and thelegend grew. Today, Lisp machines and Symbolics are little remembered, but theyhelped keep the mystique of Lisp alive through to the late 1980s.\n  In 1985, MIT professors Harold Abelson and Gerald Sussman, along with Sussman’swife, Julie Sussman, published a textbook called  Structure and Interpretationof Computer Programs. The textbook introduced readers to programming using thelanguage Scheme, a dialect of Lisp. It was used to teach MIT’s introductoryprogramming class for two decades. My hunch is that SICP (as the title iscommonly abbreviated) about doubled Lisp’s “mystique factor.” SICP took Lispand showed how it could be used to illustrate deep, almost philosophicalconcepts in the art of computer programming. Those concepts were general enoughthat any language could have been used, but SICP’s authors chose Lisp. As aresult, Lisp’s reputation was augmented by the notoriety of this bizarre andbrilliant book, which has intrigued generations of programmers (and also become a very strangememe).Lisp had always been “McCarthy’s elegant formalism”; now it was also “thatlanguage that teaches you the hidden secrets of programming.”\n It’s worth dwelling for a while on how weird SICP really is, because I thinkthe book’s weirdness and Lisp’s weirdness get conflated today. The weirdnessstarts with the book’s cover. It depicts a wizard or alchemist approaching atable, prepared to perform some sort of sorcery. In one hand he holds a set ofcalipers or a compass, in the other he holds a globe inscribed with the words“eval” and “apply.” A woman opposite him gestures at the table; in thebackground, the Greek letter lambda floats in mid-air, radiating light.\n  Honestly, what is going on here? Why does the table have animal feet? Why isthe woman gesturing at the table? What is the significance of the inkwell? Arewe supposed to conclude that the wizard has unlocked the hidden mysteries ofthe universe, and that those mysteries consist of the “eval/apply” loop andthe Lambda Calculus? It would seem so. This image alone must have done anenormous amount to shape how people talk about Lisp today.\n But the text of the book itself is often just as weird. SICP is unlike mostother computer science textbooks that you have ever read. Its authors explainin the foreword to the book that the book is not merely about how to program inLisp—it is instead about “three foci of phenomena: the human mind, collectionsof computer programs, and the computer.”  19 Later, they elaborate, describingtheir conviction that programming shouldn’t be considered a discipline ofcomputer science but instead should be considered a new notation for “proceduralepistemology.”  20 Programs are a new way of structuring thought that onlyincidentally get fed into computers. The first chapter of the book gives abrief tour of Lisp, but most of the book after that point is about much moreabstract concepts. There is a discussion of different programming paradigms, adiscussion of the nature of “time” and “identity” in object-oriented systems,and at one point a discussion of how synchronization problems may arise becauseof fundamental constraints on communication that play a role akin to the fixedspeed of light in the theory of relativity.  21 It’s heady stuff.\n All this isn’t to say that the book is bad. It’s a wonderful book. It discussesimportant programming concepts at a higher level than anything else I haveread, concepts that I had long wondered about but didn’t quite have thelanguage to describe. It’s impressive that an introductory programming textbookcan move so quickly to describing the fundamental shortfalls of object-orientedprogramming and the benefits of functional languages that minimize mutablestate. It’s mind-blowing that this then turns into a discussion of how a streamparadigm, perhaps something like today’s RxJS, can give you the best of bothworlds. SICP distills the essence of high-level program design in a wayreminiscent of McCarthy’s original Lisp paper. The first thing you want to doafter reading it is get your programmer friends to read it; if they look itup, see the cover, but then don’t read it, all they take away is that somemysterious, fundamental “eval/apply” thing gives magicians special powers overtables with animal feet. I would be deeply impressed in their shoes too.\n But maybe SICP’s most important contribution was to elevate Lisp fromcurious oddity to pedagogical must-have. Well before SICP, people told eachother to learn Lisp as a way of getting better at programming. The 1979 Lispissue of  Byte Magazine is testament to that fact. The same editor that ravedabout MIT’s new Lisp machines also explained that the language was worthlearning because it “represents a different point of view from which to analyzeproblems.”  22 But SICP presented Lisp as more than just a foil for otherlanguages; SICP used Lisp as an  introductory language, implicitly making theargument that Lisp is the best language in which to grasp the fundamentals ofcomputer programming. When programmers today tell each other to try Lisp beforethey die, they arguably do so in large part because of SICP. After all, thelanguage  Brainfuck presumably offers“a different point of view from which to analyze problems.” But people learnLisp instead because they know that, for twenty years or so, the Lisp point ofview was thought to be so useful that MIT taught Lisp to undergraduates beforeanything else.\n  The same year that SICP was released, Bjarne Stroustrup published the firstedition of  The C++ Programming Language, which brought object-orientedprogramming to the masses. A few years later, the market for Lisp machinescollapsed and the AI winter began. For the next decade and change, C++ and thenJava would be the languages of the future and Lisp would be left out in thecold.\n It is of course impossible to pinpoint when people started getting excitedabout Lisp again. But that may have happened after Paul Graham, Y-Combinatorco-founder and Hacker News creator, published a series of influential essayspushin\n......", "posttime": "2020-05-13 14:34:05", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "编程,programming,成为,god,lisp", "title": "LISP成为上帝自己的编程语言", "title_en": "Lisp Became God's Own Programming Language", "transed": 1, "url": "https://twobithistory.org/2018/10/14/lisp.html", "via": "", "real_tags": ["编程", "成为", "god", "lisp"]}, {"category": "", "categoryclass": "", "imagename": "5d8b3259ddb7167b8dcb965c6415d1b7.jpg", "infoid": 1001938, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "海平面--永恒不变。在海洋表面有一个微毫米，在海洋和天空之间移动，两者同时存在，两者都不存在。每一种已知的生命形式都与这一层有关。在它的上方，是土地、空气、阳光和肺部的世界。在它下面，是水、深度和压力的世界。你走得越深，就越黑暗，越充满敌意，越不熟悉，越不慎重，越不为人所知。\n去年6月南太平洋的一次水花，标志着那个世界的历史性突破。一台起重机把一个白色的小潜水器从船尾放下来，然后把它扑通一声扔进水里。有一阵子，它在水面上悄悄地上下摆动，它的浮力根据飞行员的重量进行了校准，飞行员是它唯一的乘客。然后他按下开关，潜水艇发出疯狂的、高音的漩涡。电泵将海水吸入一个空房间，将船压得喘不过气来。当水涌入时，水面起泡-然后沉默，因为潜水器的顶部浸入水线以下，海洋吸收了它。\n大多数潜艇下潜几百米，然后横跨；这艘潜艇被设计成像石头一样沉没。它的形状像一个鼓起的公文包，底部有一个突出的灯泡。这就是耐压船体-一个直径5英尺的钛球，它与潜水器的其余部分密封在一起，容纳着飞行员和他的所有控制器。乘客座位下面是一个金枪鱼三明治，飞行员的午餐。他凝视着其中一个视口，凝视着蓝色。到达底部需要近四个小时。\n阳光穿透了最初的1000英尺深的水。这是上层，浮游生物、海藻和珊瑚礁的一层。它包含了海洋植物的整个生态系统，以及哺乳动物和以它们为食的鱼类。一名埃及潜水员曾下潜到这一层的极限。这一壮举需要终生的训练，四年的计划，一支支援潜水员团队，一系列专门的气罐，以及冗长的13个小时的攀登，不停地减压，这样他的血液才不会中毒，他的肺也不会爆炸。\n潜水器以大约每秒2.5英尺的速度下沉。潜水20分钟后，飞行员到达了午夜区域，那里的黑暗水域变成了黑色。唯一的光是微弱的生物发光-来自电凝胶、伪装的虾和带着天然灯笼的有牙齿的捕食者，以吸引不知情的猎物。这些深海的一些鱼没有眼睛--它们有什么用呢？几乎没有什么吃的。午夜地带的条件有利于新陈代谢速度慢、肌肉虚弱、身体粘稠的鱼。\n下降一个小时后，飞行员到达了10000英尺--深海地带的起点。温度总是比冰点高几度，不受地表天气的影响。动物以“海洋雪”为食：上层的死鱼和植物的碎片，轻轻地从水柱中飘落下来。延伸到两万英尺的深海带覆盖了97%的海底。\n在自由落体两个小时后，飞行员进入了哈达尔区域，该区域以希腊冥界之神的名字命名。它是由海沟(地球构造板块边缘的地质伤痕)组成的，虽然它只占海底的一小部分，但却占到了将近50%的深度。\n超过了2.7万英尺，飞行员已经超出了任何一种鱼的理论极限。(它们的细胞在更深的地方坍塌。)。在3.5万英尺后，他开始释放一系列的重量，以减缓他的下降速度。将近7英里的水压在钛球上。如果有任何瑕疵，它可能会立即内爆。\n潜艇触碰了淤泥质的海底，53岁的德克萨斯人维克多·韦斯科沃(Victor Vescovo)成为第一个到达汤加海沟最深处的有血有骨的生物。他驾驶着唯一能把人带到那个深度的潜水器：他自己的潜水器。\n在接下来的一个小时里，他探索了平淡无奇的米色沉积物，并试图找到并收集岩石样本。然后灯在闪烁，警报器响了。Vescovo检查了他的系统-一号电池发生了灾难性的故障。水已经渗入电子设备，带来了一个不太受欢迎的最好的东西：有史以来最深的人工爆炸发生在距离他头部几英尺的地方。\n如果在那个深度有氧气，可能会有一场熊熊大火。取而代之的是，一个电池接线盒熔化了，在外壳上烧了一个洞，没有显示出火焰。由于无法营救，任何恐慌的本能都被压制住了。维斯科沃将不得不自己想办法。\n头顶七英里处，一艘白色的船在波利尼西亚水域上下摆动。它曾由美国海军建造，目的是追捕苏联军用潜艇，最近被重新调整用途，以运输和推出韦斯科沃的私人潜艇。船上有几十名机组人员，他们都是Vescovo雇佣的。他试图成为第一个到达每个大洋最深处的人，这一探险被他称为五个迪普斯(Fiep Deep)，当时他已经进行了一半。他在私募股权领域赚了一大笔钱，但他买不到这方面的成功--一个更有钱的人尝试过，但失败了。当这个想法第一次浮现在他脑海中时，他没有可以租用的车辆，甚至没有来自政府的车辆。没有一位科学家或军方有能力进入他试图探访的深度2英里以内。地质学家甚至不确定他应该潜入哪里。\n维斯科沃的船员是一个不太可能的集合-正如探险队的首席科学家所说，是“一群真正的小偷”-拥有后勤、工程学、学术界和轻微犯罪的背景。船上的一些人在海上呆了几十年，另一些人是陆上驾驶者。在一年多的时间里，他们面临着像恶劣天气一样永恒的挑战，像他们为这项工作发明的设备一样新颖。他们发现了海底山脉，收集了数千个生物样本，发现了数十个新物种，并烧毁了数万加仑的燃料和酒精。\n1969年，当韦斯科沃三岁时，他爬上了母亲的车的前座，这辆车停在他们家门外的小山上。他身材矮小，金发碧眼，是19世纪末来到美国的意大利移民的早熟蓝眼睛孙子，以在南方卖冰激凌为生。维斯科沃把车调到空档。它向后滚到一棵树上，他在重症监护病房度过了接下来的六个星期。有持久的影响：他的右手神经受损，对驾驶复杂车辆的兴趣，以及“折磨人的强迫”，他说，在他死前体验他能体验到的一切。\n他从小看科幻小说长大，渴望成为一名宇航员；他有成绩，但没有视力。在斯坦福大学读本科时，他学会了驾驶飞机。之后，他去了麻省理工学院，攻读国防与军备控制研究的硕士学位，在那里他为决策和风险利益建模，这些利益后来汇聚在重叠的职业生涯中，既是一名后备海军情报官员，也是一名商人。韦斯科沃被部署为科索沃爆炸案的目标官员，作为一名反恐官员，他参与了菲律宾的人质营救行动。他学习阿拉伯语，通过金融和咨询工作致富，后来又通过他居住的达拉斯郊区的一家名为Insight Equity的私募股权公司致富。\n韦斯科沃开始进行越来越复杂的登山探险，到2014年，他已经滑雪了最后100公里到达北极和南极，并登上了每一大洲的最高峰。他在山顶附近的一次山体滑坡中险些幸免于难。位于阿根廷安第斯山脉的阿空加瓜，并逐渐接受了以计算风险为中心的哲学。控制你能控制的；意识到你不能控制的。在某种程度上，死亡是必然的--“你必须接受它，”他说--他推断，一个人能冒的最大风险就是浪费地球上的时间，在没有最大限度地活着的情况下到达终点。“这是对抗死亡的唯一途径，”他说。“我的社交生活几乎不存在，但这不是优先事项。生活太有趣了。“。他把头发留到肩膀，甚至在胡须变白的时候也染上了颜色。周末，他用自己的私人飞机将救援犬运送到美国各地的潜在主人手中。据他的探险队成员说，在海上，他一个人在船舱里呆了几个小时，玩着使命召唤，吃着微波通心粉和奶酪。\n但是，每一个探索的时代都有它自己的路要走。“当沙克尔顿在1914年乘船前往南极时，他仍然可以成为一名英雄。当他在1917年回来时，他不能，“费格斯·弗莱明在欧内斯特·沙克尔顿的日记”南方“的引言中写道。“英雄主义的概念在第一次世界大战的战壕中烟消云散。”当沙克尔顿在南极洲失踪时，他的探险队的一名成员发来电报寻求帮助。温斯顿·丘吉尔回应说：“当所有的伤病员都得到了照顾，当他们所有的贫穷和破碎的家园都得到了重建，当每家医院的钱都充斥着，所有的慈善捐款都被关闭了，那么直到那时。”我很关心这些企鹅。“。\n一个世纪后，冒险家们往往会积累更多毫无意义的第一：从山顶上发一条Snapchat。珠穆朗玛峰；在南极洲，用吊杆旅行的最快英里。但没有限制地开放海洋进行探索-韦斯科沃认为，这是一项有意义的记录，可能是地球上最后一项记录。1961年，约翰·F·肯尼迪说：“海洋知识不仅仅是好奇心的问题。我们的生存可能取决于它。“。然而，在接下来的几十年里，距离美国最近的哈达尔海沟成为了制药废物的垃圾场。\n2014年9月，Vescovo向佛罗里达州维罗比奇的一家小型制造商Triton Submarines发出了询盘。他指出，他是一名喷气式和直升机飞行员，熟悉“复杂飞行器的程序驱动驾驶”，并概述了后来的五次深度探险。\nTriton的总裁帕特里克·莱希在他13岁的时候开始潜水，他发现他在水下的感觉比在陆地上更自在。静默，缓慢而深呼吸的潜水迫使他进入一种冥想状态。“我喜欢失重的感觉，”他告诉我。“我喜欢三维运动，而不是二维运动。”莱希就读于商业潜水学校，学习水坝、桥梁和油气设施的水下焊接和施工。他说：“你可以在水中做的任何事情都可以在水下做。”“你用螺栓固定东西，你切割东西，你把东西焊接在一起，你移动东西，你回收东西。”他补充说，水能导电，有时，“你能感觉到它在牙齿里冒泡。”\n1983年，当他21岁的时候，他进行了他的第一次潜艇潜水，下潜到1400英尺的高度，检查北加州海岸的一个石油钻井平台。他被这一经历深深地影响着--前一个小时深入海底，下个小时浮出水面，“没有任何惩罚性的减压，”他说。到维斯科沃联系他时，莱希已经驾驶了60多艘潜水器进行了数千次潜水。一位与他共事数十年的探险队队长告诉我，他“毫无疑问，是世界上最好的潜水艇驾驶员。”\n莱希于2007年与人共同创立了Triton。商业模式是为亿万富翁建造私人潜水器，其中包括一名俄罗斯寡头和一名中东王室成员。(在第一个订单之前的几年里，莱希在参加船展时经常被嘲笑；现在有一些公司为游艇建造支援船，用来运载直升机、潜艇和其他昂贵的玩具。)。但他更深层次的愿望是让其他人理解，正如赫尔曼·梅尔维尔在“白鲸”中所写的那样，在河流和海洋中，我们看到了“难以捉摸的生命幻影的形象；而这是一切的关键。”在潜水几次之后，莱希的许多客户开始允许他们的车用于科学和拍摄。\n维斯科沃不在乎莱希是否把他用无窗钢球送到海底；他只想到那里去。但莱希拒绝建造任何没有乘客座位的东西，比如科学家；没有用于采集样本的机械手手臂；没有视口的东西，这样乘客就可以享受沉没的感觉。这样的功能会使构建复杂化，甚至可能导致失败。但莱希有一种倾向，在他确定如何实现之前，他倾向于承诺他想要的现实。“这不是一个真正的商业决定，”一位Triton工程师告诉我。“他想要建造这个。放弃不是一种选择。“。莱希将维斯科沃的任务视为开发和测试世界上第一个无限哈达尔探测系统的一种方式-一个可以复制和改进的系统，供科学家使用。\n维斯科沃飞往巴哈马，莱希带他乘坐Triton的旗舰潜水器进行了试潜，该潜水器有三个座位，额定深度为3300英尺。第三个座位被一个30多岁的古怪的英国男子约翰·拉姆齐占据，他似乎不喜欢潜水；他全神贯注于他不喜欢的潜水器-这是他设计的。\n“我从来没有真正对潜艇有过特别的热情，”拉姆齐告诉我，他是Triton的首席潜艇设计师。“我现在仍然不知道，真的。”他真正喜欢的是，他可以设计每台机器的每一个方面，从中央框架到舱门后部优雅的把手。汽车制造商让整个团队设计座椅或挡泥板，然后规模化生产。但几乎每一艘Triton潜艇都是独一无二的；拉姆齐决定了他想要的样子，佛罗里达州的十几个人开始建造。\n拉姆齐在英格兰西南部荒野的一间空余卧室里工作，他从未读过一本关于潜艇的书。“你最终只会完全被你的思维方式玷污，”他说。“我只是想清楚它必须做些什么，然后拿出一个解决方案.”维斯科沃任务的成败在很大程度上掌握在他手中。\n“如果维克多死了，这是你的错，你就得自杀，”他告诉他的妻子卡罗琳。\n潜水员根据压力、浮力和重量来考虑空间和材料。空气上升，电池下沉；为了实现中性浮力-在水下保持悬浮的能力，而不会上升或下降-每个组件必须与其他组件相互抵消。鱼也是如此，它们通过鱼囊的充气和放气来调节它们的浮力。\n拉姆齐的潜艇通常以一个厚厚的丙烯酸球体为中心，本质上是一个气泡；把它释放到水下，它就会弹出水面。但对于维斯科沃的潜水器来说，丙烯酸还不够坚固。在最深的沟渠底部，每平方英寸都要挡住一万六千磅的水--一头站在细高跟鞋上的大象。\n拉姆齐固定在钛上：延展性好，耐腐蚀，强度密度比高。耐压船体将重近8000磅。它将不得不由复合泡沫来平衡，复合泡沫是一种由数百万个空心玻璃球组成的浮力填充物。为了让潜艇保持直立，泡沫必须浮在船体上方，提供向上的升力-就像热气球一样，提供水。拉姆齐解释说：“只要重物悬挂在浮力之下保持平衡，潜艇就会一直保持直立。”\n船体需要将两块钛板锻造成完美的半球。世界上只有一个设施的舱室足够大、足够强大，可以让船体承受与全海洋深度相当的压力，那就是位于俄罗斯圣彼得堡的克里洛夫国家研究中心(Krylov State Research Center)。莱希参加了压力测试。当时没有后备船体；如果发生内爆，该项目将会终止。“但它奏效了--它证实了我们正在做的事情，”莱希告诉我。\n那是2018年仲夏，在南佛罗里达州，Triton的技术人员每天工作15个小时，在一个没有空调的空间里。莱希在车间里走来走去，汗流浃背，试图鼓励他的团队。建造世界上最先进的深潜器的人没有毕业于斯坦福大学或麻省理工学院；他们以前是汽车修理工、潜水教练和水下焊工，因为他们的职业道德和实践经验而被聘用。商店领班过去是一名卡车司机。这位水力学专家在80年代将可卡因运出劳德代尔堡的时候，腹部中了一颗子弹。十几岁时，其中一名电工通过偷汽车收音机来磨练自己的手艺。(“我真的很擅长，”他告诉我。)。拉希则表示，他被联邦政府点名为一起涉及一艘苏联军用潜艇和一个哥伦比亚卡特尔的毒品走私行动中未被起诉的同谋，后来又被宣布无罪。\n维斯科沃潜艇的每一个主要部件都必须从头开始研发。石油和天然气行业已经建立了压力额定在6000米左右的零部件供应链-但这只是所需深度的一半。在组装潜艇之前，Triton团队花了几个月的时间在压力室内爆部件，并向制造商发送反馈。拉姆齐说：“你正在解决以前从未存在过的问题，用以前从未存在过的零件，从不知道如何制造它们的供应商那里。”\n探险队的其余成员在停靠在维罗海滩港口的一艘船上，等待着。Vescovo留在达拉斯的家中，在Triton在他的车库里组装的模拟器上进行训练。在莱希的推荐下，他聘请了探险队队长兼探险联合创始人罗布·麦卡勒姆(Rob McCallum)，为这个原本可能会梦想破灭的项目注入现实主义。\n对于每一个去南极的维斯科沃，都有一个麦卡勒姆确保他活着。(麦卡勒姆去过南极洲128次。)。他对我说：“我喜欢客户走进门来说，‘有人告诉我，这是不可能的，但你怎么看？’”他对我说。“嗯，我认为你刚刚暴露了你的谈判立场。我们喝杯酒好好谈谈吧。“。\n麦卡勒姆身材苗条，但胸部丰满，声音柔和，带有新西兰口音。他在巴布亚新几内亚的热带地区长大，后来成为了一名极地导游。他是一名训练有素的医生、潜水大师、消防员、飞机飞行员和船只操作员，曾是新西兰公园护林员，曾担任挪威海军的顾问。他会说三种新美拉尼西亚语言，可以在16英尺深的海浪中为一艘黄道十二宫船驾驶。他是“泰晤士报”“现代爱情”专栏的主角。(“我父亲警告过我要提防你这样的人，”作者回忆道，不管怎样，在嫁给他之前，他曾这样告诉过他。)。麦卡勒姆和他的同事们发现了几艘备受瞩目的沉船，包括澳大利亚和美国的军舰以及一艘以色列军用潜艇。几个月前，他在他的电脑上向我展示了一个声纳扫描的物体，他认为这就是阿米莉亚·埃尔哈特(Amelia Earhart)的飞机。\n维斯科沃问麦卡勒姆对他有什么要求。“我首先需要的是你把预算增加两倍，”他回答说。他还驳斥了维斯科沃的几个提议，从过时的(船上没有酒精或配偶)到疯狂的(在船头安装假鱼雷管；把他的狗带到地球的最深处)。\n五大洋，五深--环游世界，到达两极。麦卡勒姆解释说，探险必须以极地潜水为依托。北冰洋可能的潜水点一年中的大部分时间都被冰覆盖，但有两周的潜水胜利。\n..", "note_en": "Sea level—perpetual flux. There is a micromillimetre on the surface of the ocean that moves between sea and sky and is simultaneously both and neither. Every known life-form exists in relation to this layer. Above it, the world of land, air, sunlight, and lungs. Below it, the world of water, depth, and pressure. The deeper you go, the darker, the more hostile, the less familiar, the less measured, the less known.\n  A splash in the South Pacific, last June, marked a historic breach of that world. A crane lowered a small white submersible off the back of a ship and plonked it in the water. For a moment, it bobbed quietly on the surface, its buoyancy calibrated to the weight of the pilot, its only occupant. Then he flipped a switch, and the submarine emitted a frantic, high-pitched whirr. Electric pumps sucked seawater into an empty chamber, weighing the vessel down. The surface frothed as the water poured in—then silence, as the top of the submersible dipped below the waterline, and the ocean absorbed it.\n  Most submarines go down several hundred metres, then across; this one was designed to sink like a stone. It was the shape of a bulging briefcase, with a protruding bulb at the bottom. This was the pressure hull—a titanium sphere, five feet in diameter, which was sealed off from the rest of the submersible and housed the pilot and all his controls. Under the passenger seat was a tuna-fish sandwich, the pilot’s lunch. He gazed out of one of the viewports, into the blue. It would take nearly four hours to reach the bottom.\n  Sunlight cuts through the first thousand feet of water. This is the epipelagic zone, the layer of plankton, kelp, and reefs. It contains the entire ecosystem of marine plants, as well as the mammals and the fish that eat them. An Egyptian diver once descended to the limits of this layer. The feat required a lifetime of training, four years of planning, a team of support divers, an array of specialized air tanks, and a tedious, thirteen-hour ascent, with constant decompression stops, so that his blood would not be poisoned and his lungs would not explode.\n  The submersible dropped at a rate of about two and a half feet per second. Twenty minutes into the dive, the pilot reached the midnight zone, where dark waters turn black. The only light is the dim glow of bioluminescence—from electric jellies, camouflaged shrimp, and toothy predators with natural lanterns to attract unwitting prey. Some fish in these depths have no eyes—what use are they? There is little to eat. Conditions in the midnight zone favor fish with slow metabolic rates, weak muscles, and slimy, gelatinous bodies.\n  An hour into the descent, the pilot reached ten thousand feet—the beginning of the abyssal zone. The temperature is always a few degrees above freezing, and is unaffected by the weather at the surface. Animals feed on “marine snow”: scraps of dead fish and plants from the upper layers, falling gently through the water column. The abyssal zone, which extends to twenty thousand feet, encompasses ninety-seven per cent of the ocean floor.\n  After two hours in free fall, the pilot entered the hadal zone, named for the Greek god of the underworld. It is made up of trenches—geological scars at the edges of the earth’s tectonic plates—and although it composes only a tiny fraction of the ocean floor, it accounts for nearly fifty per cent of the depth.\n Past twenty-seven thousand feet, the pilot had gone beyond the theoretical limit for any kind of fish. (Their cells collapse at greater depths.) After thirty-five thousand feet, he began releasing a series of weights, to slow his descent. Nearly seven miles of water was pressing on the titanium sphere. If there were any imperfections, it could instantly implode.\n  The submarine touched the silty bottom, and the pilot, a fifty-three-year-old Texan named Victor Vescovo, became the first living creature with blood and bones to reach the deepest point in the Tonga Trench. He was piloting the only submersible that can bring a human to that depth: his own.\n  For the next hour, he explored the featureless beige sediment, and tried to find and collect a rock sample. Then the lights flickered, and an alarm went off. Vescovo checked his systems—there was a catastrophic failure in battery one. Water had seeped into the electronics, bringing about a less welcome superlative: the deepest-ever artificial explosion was taking place a few feet from his head.\n  If there were oxygen at that depth, there could have been a raging fire. Instead, a battery junction box melted, burning a hole through its external shell without ever showing a flame. Any instinct to panic was suppressed by the impossibility of rescue. Vescovo would have to come up on his own.\n  Seven miles overhead, a white ship bobbed in Polynesian waters. It had been built by the U.S. Navy to hunt Soviet military submarines, and recently repurposed to transport and launch Vescovo’s private one. There were a couple of dozen crew members on board, all of whom were hired by Vescovo. He was midway through an attempt to become the first person to reach the deepest point in each ocean, an expedition he called the Five Deeps. He had made a fortune in private equity, but he could not buy success in this—a richer man had tried and failed. When the idea first crossed his mind, there was no vehicle to rent, not even from a government. No scientist or military had the capacity to go within two miles of the depths he sought to visit. Geologists weren’t even sure where he should dive.\n  Vescovo’s crew was an unlikely assemblage—“a proper band of thieves,” as the expedition’s chief scientist put it—with backgrounds in logistics, engineering, academia, and petty crime. Some on board had spent decades at sea; others were landlubbers. For more than a year, they faced challenges as timeless as bad weather and as novel as the equipment they had invented for the job. They discovered undersea mountain ranges, collected thousands of biological samples that revealed scores of new species, and burned through tens of thousands of gallons of fuel and alcohol.\n    In 1969, when Vescovo was three years old, he climbed into the front seat of his mother’s car, which was parked on a hill outside their house. He was small and blond, the precocious, blue-eyed grandson of Italian immigrants who had come to the United States in the late nineteenth century and made a life selling gelato in the South. Vescovo put the car in neutral. It rolled backward into a tree, and he spent the next six weeks in an intensive-care unit. There were lasting effects: nerve damage to his right hand, an interest in piloting complex vehicles, and the “torturous compulsion,” he said, to experience everything he could before he died.\n  He grew up reading science fiction, and aspired to be an astronaut; he had the grades but not the eyesight. As an undergraduate, at Stanford, he learned to fly planes. Afterward, he went to M.I.T., for a master’s degree in defense-and-arms-control studies, where he modelled decision-making and risk—interests that later converged in overlapping careers as a Reserve Naval Intelligence officer and a businessman. Vescovo was deployed as a targeting officer for the   bombing of Kosovo, and, as a counterterrorism officer, he was involved in a hostage rescue in the Philippines. He learned Arabic and became rich through finance and consulting jobs, and, later, through a private-equity firm, Insight Equity, in the suburbs of Dallas, where he lives.\n  Vescovo started going on increasingly elaborate mountaineering expeditions, and by 2014 he had skied the last hundred kilometres to the North and South Poles and summited the highest peak on every continent. He had narrowly survived a rock slide near the top of Mt. Aconcagua, in the Argentinean Andes, and had come to embrace a philosophy that centered on calculated risk. Control what you can; be aware of what you cannot. Death, at some point, is a given—“You have to accept it,” he said—and he reasoned that the gravest risk a person could take was to waste time on earth, to reach the end without having maximally lived. “This is the only way to fight against mortality,” he said. “My social life was pretty nonexistent, but it just wasn’t a priority. Life was too interesting.” He grew his hair down to his shoulders, and touched up the color, even as his beard turned white. On weekends, he used his private jet to shuttle rescue dogs to prospective owners all over the U.S. At sea, according to members of his expedition team, he spent hours in his cabin alone, playing Call of Duty and eating microwaved macaroni and cheese.\n  But every age of exploration runs its course. “When Shackleton sailed for the Antarctic in 1914, he could still be a hero. When he returned in 1917 he could not,” Fergus Fleming writes, in his introduction to “ South,” Ernest Shackleton’s diary. “The concept of heroism evaporated in the trenches of the First World War.” While Shackleton was missing in Antarctica, a member of his expedition cabled for help. Winston Churchill responded, “When all the sick and wounded have been tended, when all their impoverished &amp; broken hearted homes have been restored, when every hospital is gorged with money, &amp; every charitable subscription is closed, then &amp; not till then wd. I concern myself with these penguins.”\n  A century later, adventurers tend to accumulate ever more meaningless firsts: a Snapchat from the top of Mt. Everest; in Antarctica, the fastest mile ever travelled on a pogo stick. But to open the oceans for exploration without limit—here was a meaningful record, Vescovo thought, perhaps the last on earth. In 1961, John F. Kennedy said that “knowledge of the oceans is more than a matter of curiosity. Our very survival may hinge upon it.” Yet, in the following decades, the hadal trench nearest to the U.S. became a dumping ground for pharmaceutical waste.\n  In September, 2014, Vescovo sent an inquiry to Triton Submarines, a small manufacturer in Vero Beach, Florida. He noted that he was a jet and helicopter pilot familiar with the “procedure-driven piloting of complex craft,” and outlined what became the Five Deeps Expedition.\n  Patrick Lahey, the president of Triton, took up scuba diving when he was thirteen years old, and discovered that he felt more at home underwater than he did on land. The muted silence, the slow, deep breaths—diving forced him into a kind of meditative state. “I love the feeling of weightlessness,” he told me. “I love moving around in three dimensions, instead of two.” Lahey attended commercial diving school, to learn underwater welding and construction for dams, bridges, and oil-and-gas installations. “Just about anything you might do out of the water you could do underwater,” he said. “You bolt things, you cut things, you weld things together, you move things, you recover things.” Water conducts electricity, and sometimes, he added, “you can feel it fizzing in your teeth.”\n  In 1983, when he was twenty-one, he carried out his first submarine dive, to fourteen hundred feet, to inspect an oil rig off the coast of Northern California. He was profoundly affected by the experience—to go deep one hour and surface the next, with “none of the punitive decompression,” he said. By the time Vescovo contacted him, Lahey had piloted more than sixty submersibles on several thousand dives. An expedition leader who has worked with him for decades told me that he is, “without question, the best submarine pilot in the world.”\n  Lahey co-founded Triton in 2007. The business model was to build private submersibles for billionaires, including a Russian oligarch and a member of a Middle Eastern royal family. (In the years leading up to the first order, Lahey used to be laughed at when he attended boat shows; now there are companies that build support vessels for yachts, to carry helicopters, submarines, and other expensive toys.) But his deeper aspiration was to make other people comprehend, as Herman Melville wrote, in “ Moby-Dick,” that in rivers and oceans we see “the image of the ungraspable phantom of life; and this is the key to it all.” After a few dives, many of Lahey’s clients started allowing their vehicles to be used for science and filming.\n  Vescovo didn’t care if Lahey sent him to the bottom of the ocean in a windowless steel ball; he just wanted to get there. But Lahey declined to build anything that didn’t have a passenger seat, for a scientist; a manipulator arm, for collecting samples; and viewports, so that the occupants could appreciate the sensation of submergence. Such features would complicate the build, possibly to the point of failure. But Lahey has a tendency to promise the reality he wants before he’s sure how to deliver it. “It wasn’t really a business decision,” a Triton engineer told me. “He wanted to build this. Giving up was not an option.” Lahey saw Vescovo’s mission as a way to develop and test the world’s first unlimited hadal exploration system—one that could then be replicated and improved, for scientists.\n    Vescovo flew to the Bahamas, and Lahey took him for a test dive in Triton’s flagship submersible, which has three seats and is rated to a depth of thirty-three hundred feet. The third seat was occupied by an eccentric British man in his thirties, named John Ramsay, who didn’t seem to enjoy the dive; he was preoccupied with what he didn’t like about the submersible—which he had designed.\n  “I never really had a particular passion for submarines,” Ramsay, who is Triton’s chief submarine designer, told me. “I still don’t, really.” What he does love is that he gets to design every aspect of each machine, from the central frame to the elegant handle on the back of the hatch. Car manufacturers have entire teams design a seat or a fender, and then produce it at scale. But nearly every Triton submarine is unique; Ramsay determines how he wants things to be, and a dozen or so men in Florida start building.\n  Ramsay, who works out of a spare bedroom in the wilds of southwest England, has never read a book about submarines. “You would just end up totally tainted in the way you think,” he said. “I just work out what it’s got to do, and then come up with a solution to it.” The success or the failure of Vescovo’s mission would rest largely in his hands.\n  “If Victor dies, and it’s your fault, you’ve got to kill yourself,” he told his wife, Caroline.\n  A submariner thinks of space and materials in terms of pressure, buoyancy, and weight. Air rises, batteries sink; in order to achieve neutral buoyancy—the ability to remain suspended underwater, without rising or falling—each component must be offset against the others. The same is true of fish, which regulate their buoyancy through the inflation and deflation of swim bladders.\n  Ramsay’s submarines typically center on a thick acrylic sphere, essentially a bubble; release it underwater and it will pop right up to the surface. But acrylic was not strong enough for Vescovo’s submersible. At the bottom of the deepest trench, every square inch would have to hold back sixteen thousand pounds of water—an elephant standing on a stiletto heel.\n  Ramsay settled on titanium: malleable and resistant to corrosion, with a high ratio of strength to density. The pressure hull would weigh nearly eight thousand pounds. It would have to be counterbalanced by syntactic foam, a buoyant filler comprising millions of hollow glass spheres. For the submarine to stay upright, the foam would have to go above the hull, providing upward lift—like a hot-air balloon, for water. “As long as the heavy stuff hangs in balance below the buoyant stuff, the sub will always stay upright,” Ramsay explained.\n  The hull required the forging of two slabs of titanium into perfect hemispheres. Only one facility in the world had a chamber that was sufficiently large and powerful to subject the hull to pressures equivalent to those found at full ocean depth: the Krylov State Research Center, in St. Petersburg, Russia. Lahey attended the pressure test. There was no backup hull; an implosion would end the project. “But it worked—it validated what we were doing,” Lahey told me.\n   It was the middle of summer, 2018, in South Florida, and Triton’s technicians were working fifteen hours a day, in a space with no air-conditioning. Lahey paced the workshop, sweating, trying to encourage his team. The men who were building the world’s most advanced deep-diving submersible had not attended Stanford or M.I.T.; they were former car mechanics, scuba instructors, and underwater welders, hired for their work ethic and their practical experience. The shop foreman used to be a truck driver. The hydraulics expert had a bullet in his abdomen, from his days running cocaine out of Fort Lauderdale, in the eighties. One of the electricians honed his craft by stealing car radios, as a teen-ager. (“I was really good at it,” he told me.) Lahey, for his part, said that he was named—and later exonerated—by the federal government as an unindicted co-conspirator in a narcotics-trafficking operation involving a Soviet military submarine and a Colombian cartel.\n  Every major component of Vescovo’s submarine had to be developed from scratch. The oil-and-gas industry had established a supply chain of components that are pressure-rated to around six thousand metres—but that was only half the required depth. Before assembling the submarine, the Triton team spent months imploding parts in a pressure chamber, and sending feedback to the manufacturers. “You’re solving problems that have never existed before, with parts that have never existed before, from venders who don’t know how to make them,” Ramsay said.\n  The rest of the expedition team was on a ship docked in the harbor at Vero Beach, waiting. Vescovo remained at home in Dallas, training on a simulator that Triton had rigged up in his garage. On Lahey’s recommendation, he had hired Rob McCallum, an expedition leader and a co-founder of   Expeditions, to inject realism into a project that might otherwise die a dream.\n  For every Vescovo who goes to the South Pole, there is a McCallum making sure he stays alive. (McCallum has been to Antarctica a hundred and twenty-eight times.) “I love it when clients come through the door and say, ‘I’ve been told this is impossible, but what do you think?’ ” he said to me. “Well, I think you’ve just given away your negotiating position. Let’s have a glass of wine and talk about it.”\n  McCallum—who is trim but barrel-chested, with a soft voice and a Kiwi accent—grew up in the tropics of Papua New Guinea, and became a polar guide. He is a trained medic, dive master, firefighter, aircraft pilot, and boat operator, a former New Zealand park ranger who has served as an adviser to the Norwegian Navy. He speaks three Neo-Melanesian languages, and can pilot a Zodiac boat standing up, in sixteen-foot waves. He is the subject of a “Modern Love” column, in the  Times. (“My father warned me about guys like you,” the author recalls telling him, before  marrying him anyway.) McCallum and his associates have discovered several high-profile shipwrecks, including Australian and American warships and an Israeli military submarine. A few months ago, he showed me on his computer an object on a sonar scan, which he believes to be  Amelia Earhart’s plane.\n  Vescovo asked what McCallum required from him. “The first thing I need is for you to triple the budget,” he replied. He also shot down several of Vescovo’s proposals, from the antiquated (no alcohol or spouses on board) to the insane (installing fake torpedo tubes on the bow; bringing his dog to the deepest point on earth).\n  Five oceans, five deeps—a journey around the world and to both poles. McCallum explained that the expedition would have to be anchored by the polar dives. The likely dive spot in the Arctic Ocean is covered by ice for much of the year, but there is a two-week dive win\n......", "posttime": "2020-05-13 14:33:14", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "feet", "title": "海底3.6万英尺", "title_en": "Thirty-six Thousand Feet Under the Sea", "transed": 1, "url": "https://www.newyorker.com/magazine/2020/05/18/thirty-six-thousand-feet-under-the-sea#intcid=recommendations_default-popular_1f63b3f2-e33d-4bae-8988-e60497faed01_popular4-1", "via": "", "real_tags": ["feet"]}, {"category": "", "categoryclass": "", "imagename": "", "infoid": 1001937, "ip": "", "isanchordig": 1, "ischecked": 1, "isdelete": 0, "isneo": 1, "mark": "", "name": "", "note": "在隔离的早期，我和我的父亲、女朋友和邻居围坐在昏暗的火堆旁-你们是典型的邻居爸爸。带着灿烂的笑容，他兴奋地谈到他是如何让他的孩子们通过保住收银员、女服务员等工作来谋生的。…。你经常能找到其他高中生和大学生填补的工作类型。他的目的是，有一天，30年后，当他的儿子或女儿站在杂货店排队时，他们会对柜台后面的那个人有更多的耐心和理解-这个人就是无法扫描该死的香蕉的条形码！\n事实证明这是真的(而且很简单)。你会对你以前经历过的事情产生共鸣(这一点你可能已经知道了)。我的那些当服务员的朋友经常是餐馆里给小费最多的人，不管他们的收入有多高。\n顾客总是对的--但是事情发生了，也许你的食物上得比你想吃的慢，或者稍微凉了一点。在对女服务员大喊大叫之前，也许有一点耐心和理解是值得的。\n这是一个火热的话题，有人在读这篇文章，他们握紧拳头，咬牙切齿。为什么？因为顾客总是对的。你为一项服务或项目付钱，你应得的每一美元都是你应得的。\n说得对。95%的时间是公平的。我的观点是世界并不完美。人类不是十全十美的，他们对所有的服务都负有相当大的责任。\n就像我的醉酒邻居对他们的孩子在世界上的地位大喊大叫一样，我认为现在也是人们对工程学有更多同情的时候了。更具体地说，要有耐心。我们的世界是建立在一堆我们不知道的黑盒抽象之上的。当我们冲排水沟的时候，我们不需要知道我们的屎去了哪里。它已经被抽象出来了。\n本文的论点是，抽象化并不意味着完全消失。如果一个产品团队能做到这一点-所有的权力给他们。他们理应占有世界上所有的市场份额--但是事情打破了…。有很多不同的原因。也许产品中的一个缺陷漏掉了，或者一些人买不起最新最好的产品，所以他们剩下的产品质量会随着时间的推移而偏离方向。\n我们中的许多人都对为我们抽象出来的一些工程壮举和过程感到震惊。而且往往伴随着特权而来的是对这种特权的无知。种族主义有印象吗？\n当我们插入电脑时，当我们的电脑鼠标不工作时，我们可能会生气。但是坐在那里一秒钟，试着发明鼠标。你面前有一台电脑，但是你必须先做一个鼠标，并使它与电脑里的软件配合工作，然后才能使用它。\n这就是工程学的好处和坏处--你(通常)没有什么抽象的东西可以隐藏。你现在是创造黑匣子和抽象概念的人了。\n有太多行业没有人负责制造黑匣子，换言之，便是只处理表面的事情。这就像是考虑其他人对比特币的看法，而不是真正阅读科学论文，解决你不理解的每一个未知问题。这就是我讨厌八卦的原因。这就像围绕着人们自己没有花时间去思考或找到根源的抽象概念和想法进行交易。\n一旦你对生活中的黑匣子和抽象负责-我相信它会渗入生活的其他领域。一旦你开始尊重软件的面貌，年轻人就不再对你的特权一无所知。能够查看屏幕并键入备注的特权。与500英里外的祖母通话的特权。也许还有…。当你转动一个小冲水钮时，也许你会开始想你的粪便去了哪里。你可能永远不会去看它是如何工作的，也不会去关心它，但你会尊重它的存在。你不是不知道你的特权。\n也许，作为一名工程师可以让你在生活的其他方面检查你的特权-比如种族、性别和性取向。", "note_en": "During the early days of quarantine, I sat around a dim lit hot fire with my father, girlfriend, and neighbor – you’re typical neighborhood dad. With a glare across his huge smile, he spoke excitedly of how he let his kids earn their living by holding down jobs like cashier, waitress, etc… The types of jobs you often find other high schoolers and college students filling. His purpose was that one day, when his son or his daughter is standing in a grocery store line, 30 years from now, they’ll have a lot more patience and understanding for that person behind the counter – who just couldn’t get the damn bananas’ bar code to scan!\n  Turns out it’s true(and simple). You’re going to have empathy towards things you’ve experiencedbefore (you probably already know this). My friends who are waitresses areoften the biggest tippers at restaurants, despite what their income is.\n The customer isalways right – but things happen, maybe your food came out slower than you’reliking or slightly cold. Before screaming at the waitress, it may be worthhaving a bit of patience and understanding.\n THIS IS A HOT TAKE.There’s someone reading this gripping their fist and grinding their teeth. Why?Because the customer is always right. You paid for a service or item, and youdeserve every dollars worth of that.\n Fair point. 95% ofthe time a fair point. My point is that the world isn’t perfect. Humans are notperfect, and they’re pretty much responsible for all services.\n Similar to my drunkneighbor’s rant on their kids place in the world, I think it’s also time peoplehave more sympathy towards engineering. More specifically, having patience forit. Our world is built on a bunch of black-box abstractions that we don’t haveto know about. We don’t have to know about where our shit goes when we flushthe drain. It’s been abstracted out.\n The thesis of thisarticle is that abstracted out doesn’t mean completely disappear. If a productteam can do that – all the power to them. They deserve all the market share inthe world – but things break… for a lot of different reasons. Perhaps a bug inthe product fell through the gaps, or some people couldn’t afford the latestand greatest, and so they are left with a product whose quality detoriates overtime.\n Many of us are soprivileged at some of the engineering feats and processes that have beenabstracted out for us. And often with privilege, comes ignorance of thatprivilege. Does racism ring a bell?\n We might get angrywhen our computer mouse doesn’t work when we plug into the computer. But sitthere for a second, and try to invent the mouse. There’s a computer in front ofyou, but you cannot use it until you build a mouse and make it work with the softwarein the computer.\n  That’s the beautyand curse of engineering – you (often) have no abstractions to hide behind. Youare now the person who creates and black boxes and abstractions.\n There are too manyindustries in which people are not responsible for the creation of black boxes.Another way to put this, is they only deal with surface level things. It’s likeconsuming what other people’s opinions of Bitcoin are, without actually goingthrough the scientific paper and solving for every unknown you don’tunderstand. That’s why I hate gossip. It’s like trading around abstractions andideas that people themselves have not taken the time to think about, or get tothe root source of.\n Once you areresponsible for black boxes and abstractions in life – I believe it bleeds intoother areas of life. Once you start respecting the complexion of software – youno longer become ignorant of your privilege. The privilege of being able tolook at a screen and type notes. The privilege of facetime your grandmother 500miles away. And maybe… just maybe you will start thinking of where your shitgoes when you swivel a small flush button. You may never look into how itworks, or care, but you respect that it’s there. You’re not ignorant of yourprivilege.\n Perhaps, being an engineer can allow you to check your privilege in other areas of your life – like race, gender, and sexuality.", "posttime": "2020-05-13 14:32:45", "source_domain": "news.ycombinator.com", "source_name": "Hacker News", "tags": "缺乏,sympathy,特权", "title": "对复杂系统缺乏同情心", "title_en": "Lack of sympathy towards complex systems", "transed": 1, "url": "https://acityaway.io/2020/05/13/lack-of-sympathy-towards-complex-systems/", "via": "", "real_tags": ["缺乏", "sympathy", "特权"]}]